{
  "source_id": "太上老君戒经",
  "source_file": "chunked_daozang\\太上老君戒经.json",
  "total_chunks": 9,
  "total_original_chars": 8959,
  "total_translated_chars": 50400,
  "total_translation_time": 239.0351436138153,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\戒律类\\太上老君戒经.txt",
    "category": "戒律类"
  },
  "full_translation": "**The Scripture of Precepts by the Most High Lord Lao**\n\n**Preface to the Precepts**\n\nThe Most High Lord Lao journeyed westward, bound for Tianzhu. This occurred at the end of the reign of King You of Zhou. Traveling west from Zhou, he arrived in Tianzhu—a land so named. The account is recorded in *The Esoteric Wondrous Chapters*. There, he bestowed the *Scripture of Dao* and *Scripture of Virtue* upon the Pass Keeper Yin Xi. After Yin Xi received the scriptures, he further entreated the Master for the method of upholding them in body and conduct.\n\nThe transmission of the scriptures is fully documented in records and biographies; here, only the origins of the request for precepts are briefly recounted. Having received the scriptures in full, one ought to propagate and master them, hence the repeated entreaty for the method of upholding them in body and conduct. The method of bodily discipline is expounded in the scriptural text, yet its meaning is profound and subtle, not readily grasped by beginners. Thus, Yin Xi separately requested its essential precepts to sever later doubts.\n\nThereupon, Lord Lao again conferred upon him the essential precepts, universally enjoining all to uphold them and thereby transcend the world. For by upholding the precepts and forsaking evil, one naturally transcends the world. Yet to uphold the precepts is to revere the scriptures, and to revere the scriptures is necessarily to seek the Dao. Now that the method of reverent upholding has been heard, let the precepts be first expounded.\n\nHere follow three hymns of praise. The hymns extol the matter at hand, clarifying that upholding the precepts and revering the Dharma are both causes of attaining the Dao. Thus, their fundamental purport is first chanted to enlighten beginners and guide them to its ultimate aim.\n\nThe first hymn elucidates the blessings of upholding the precepts, which gradually refine body and mind. The second hymn declares that as the Dharma becomes universal, households and states flourish alike, and heaven and humanity rejoice in unison. The third hymn reveals that as refinement deepens, the principles of the scriptures are exhausted, and upon exhausting these principles, one attains perfection. Hence, there are three hymns.\n\n**Hymn One**\nDelight in the Dharma as one delights in a wife—\nA wife is a handle, meaning mutual reliance.\nThe way of human relations, the brush of yin and yang’s qi,\nAll life arises from husband and wife.\n\"Delight\" implies mutual dependence and joy.\nAll beings delight in wives,\nBut if one grasps the Dharma as a handle for the mind,\nThere is no dependence, no pairing, yet life’s principles are self-sufficient.\nThus, to delight in the Dharma as one delights in a wife\nIs to uphold the body and revere the scriptures.\n\nCherish the scriptures as pearls and jade—\nThe Dharma is that which is revered;\nThe scriptures are that which is studied.\n\"Cherish\" means to treasure.\nOf worldly treasures, none surpass pearls and jade,\nYet worldly treasures bring no benefit to the mind,\nWhile the scriptures and Dharma yield eternal attainment.\nThus, the learner is bid to forsake the former and embrace the latter.\n\nUphold the precepts to restrain the six emotions—\nThe six emotions are the six desires:\nThe eye desires lewd sights,\nThe ear desires lewd sounds,\nThe nose desires fragrance,\nThe tongue desires rich flavors,\nThe body desires softness and smoothness,\nThe mind desires indulgence and excess.\nThese six matters all arise from the heart, hence they are called emotions.\nThey are the evil karma of the three realms, thus they must be restrained and abandoned.\nIf left unchecked, the six emotions run rampant,\nIn life, one is despised by the world;\nIn death, one is oppressed by ghosts.\n\nContemplate the Dao to dispel desires—\nPrecepts guard the external;\nContemplation gathers the internal.\nInternal gathering arises from contemplating the Dao;\nContemplating the Dao, external desires vanish.\nThe *Scripture of Western Ascent* states:\n\"The Dao’s subtle heart you cannot yet discern.\nGrasp its essentials, be cautious, and do not lose them.\nFirst diminish desires, let not the mind run wild.\"\nThese are the very precepts here expounded.\n\nSerene and unadorned, the qi of rectitude fills the courtyard—\nThat by which people are restless and competitive\nIs the prompting of the six emotions.\nIf one upholds the precepts and contemplates the Dao,\nThe six emotions become clear and still,\nThe spirit is at peace, the qi is upright,\nAnd no delusion or confusion can disturb.\nThe \"courtyard\" is the Yellow Court.\n\nDesolate and still, the spirit abides in silence—\n\"Desolate\" means without desire;\n\"Still and silent\" means inner tranquility.\n\nHeavenly demons all revere and protect—\nDemons refer to the Five Great Heavenly Demons,\nWho govern life and death from above the Six Heavens.\nIf one upholds the precepts and reveres the Dharma,\nUltimately attaining true immortality,\nOne transcends the Three Realms,\nHence all demons revere and protect.\nThere are four kinds of demons;\nThe other three reside within the human body,\nThus they are called heavenly demons.\n\nLifetimes receive great blessings—\nTo uphold the precepts and contemplate the Dao\nIs to prevent the arising of all evils\nAnd daily establish good causes.\nThough passing through life and death,\nIn this life and the next,\nOne abides ever in blessings,\nAnd upon attaining the Dao, these are called great.\n\n**Hymn Two**\nLush and flourishing, households and states prosper;\nMajestic and grand, the scriptures and Dao thrive—\nThe blessings of upholding the precepts\nEnsure no premature death or harm.\nIn this life, one enjoys prosperity,\nDescendants multiply,\nHouseholds and states flourish,\nExtending to the ten directions,\nAll become lush and flourishing.\n\nHeaven and humanity share the same aspiration—\n\"Heaven\" refers to the immortals above;\n\"Humanity\" refers to people in the world.\nTo uphold the precepts and revere the Dharma\nBegins among people,\nWhere one receives retribution and ascends to heaven.\nAdvancing in practice among people,\nOne receives retribution and ascends to heaven,\nProgressing in practice until attaining Highest Clarity.\nThus, heaven and humanity share the same aspiration.\n\nEthereal and distant, one enters the Great Vehicle—\nThe Great Vehicle refers to the Dharma of Highest Clarity.\nFrom the coarse, one ascends to the wondrous,\nStep by step, refinement deepens.\nHaving departed the world and ascended to heaven,\nFrom heaven one rises still higher,\nHence it is called ethereal and distant.\n\"Ethereal and distant\" describes a soaring, ascending demeanor.\n\n**Hymn Three**\nBy the heart, establish the field of blessings—\nBlessings are the fruits of goodness.\nThe cause of blessings does not lie elsewhere;\nOne’s own heart is the field of blessings.\nIf one cultivates the body and reveres the Dharma,\nAll evils are naturally removed,\nJust as one tends a field,\nWeeding out grasses and filth.\nWhen grasses and filth are exhausted,\nNaturally, fine grain is obtained.\n\nGradually, the Dharma Wheel ascends—\n\"Gradually\" means step by step.\nAs blessings accumulate,\nThe Dharma Wheel gradually ascends.\n\nSeven ancestors ascend to the heavenly halls;\nThis body ascends in broad daylight—\nThe attainment of the true Dao by this body\nBrings joy to the seven ancestors.\nThis is the culmination of upholding the precepts and aspiring to the Dao,\nWhere merit is perfected and virtue is accomplished.\n\nThe Great Dao pervades the profound and void,\nAll dharmas are called the Dao—\nThere are the hundred officials and eighteen thousand kinds,\nAll belonging to the Dao of the Six Heavens and the Three Realms.\nThe Great Dao is formless and imageless, pervading the profound and void.\nThe Dao is nowhere absent; its principle responds without fail—hence it is called \"great.\"\nWith thought, nothing fails to be awakened—\n\"Awakened\" means responsive.\nThis clarifies that upholding the precepts and contemplating the Dao,\nWith mind intent, brings response; thought after thought unceasing,\nUntil the Dao is attained—all by the power of thought.\nRefining the substance, one enters the immortals’ truth;\nWhen desires are many, the spirit is turbid; when qi is pure, the substance is refined.\nRefining the substance to become true—none but through the precepts.\nThus is the body of adamantine formed—\nIts inner and outer firmness and truth leave no room for decay.\nSurpassing the Three Realms’ hardships—\nThe Realm of Desire, the Realm of Form, and the Formless Realm,\nThese Three Realms’ cycle of birth and death knows no rest,\nEver opposing the Three Wretched Paths—hence it is called \"hardship.\"\nOnly by attaining truth can one transcend them.\nThe five sufferings of hell are dissolved—\nThe five sufferings are the icy pools, fire chariots, boiling cauldrons,\nKnife mountains, and sword trees of hell.\nHaving transcended the Three Realms, no more suffering remains.\nIt is also said that the five paths are the five sufferings.\nAll return to the scriptures of the Most High—\nThe methods of the Highest Clarity.\nAll dharmas reach their culmination—hence they return to the scriptures of the Most High.\nWith tranquil thought, bow the head in reverence—\nThe recitation now complete, the dharma’s threads briefly revealed,\nAs the precepts are about to be expounded, one is bidden to still the mind,\nBow the head, and receive them.\nThereupon, Yin Xi, having heard the verses, bowed and stood,\nRequesting to receive the precepts’ words.\nThe Old Master said: The first precept is against killing,\nThe second against stealing,\nThe third against licentiousness,\nThe fourth against false speech,\nThe fifth against wine.\nThese are the Five Precepts.\nIf there are faithful men and faithful women—\nIf men and women resolve to receive the precepts, they attain the title of the faithful.\nUpholding the Five Precepts to the end of life without transgression—\nThis means holding the precepts until life’s end without violation.\nThese are the faithful men and faithful women.\nAt the outset, the resolve earns the title of faithful;\nIf midway one falters, the faithful heart is lost.\nOnly by upholding them to life’s end, receiving blessings in the next life,\nIs the principle of the faithful fully preserved—hence the reiteration.\nThe Old Master said: The precept against killing—\nAll sentient beings, from those possessing qi upward,\nTo the flying and wriggling creatures—none may be killed.\nAll wriggling creatures delight in life;\nEven mosquitoes, ants, and earthworms know to avoid death.\nThe Old Master said: The precept against stealing—\nFrom a single coin upward, whether owned or ownerless,\nAnything not one’s own must not be taken.\nOn land, the earth officials; in water, the water officials;\nAmong men, the human masters—thus there are no ownerless things.\nThis speaks of ownerless as meaning no one presently guards them.\nThe Old Master said: The precept against licentiousness—\nOutside of husband and wife,\nIf one has left the household, neither marrying nor taking a spouse,\nNeither men nor women may transgress.\nEven between husband and wife, excess is licentious transgression.\nThe Old Master said: The precept against false speech—\nSpeaking of what one has not seen or heard,\nOr what the mind does not comprehend—all is false speech.\nThe spoken matter contradicts the mind.\nThere are also ornate words, flattery, duplicity, and divisive speech—\nThese belong to later precepts.\nThe Old Master said: The precept against wine—\nUnless for bodily illness or ritual propriety, one must not drink.\n\"Bodily illness\" refers to one’s own ailments requiring wine.\n\"Ritual propriety\" clarifies that it is not for secular gatherings or sacrificial offerings to ghosts and spirits.\nFor rites of honor and inferiority, or feasts for the true spirits,\nOne does not lose oneself.\nThe Old Master said: These Five Precepts are the root of bodily conduct,\nThe foundation of upholding the Dharma.\nThe body’s root is without evil; through evil, the precepts are upheld.\nWith a pure heart and a clear body, one can uphold the Dharma—\nHence they are called the Dharma’s root.\nGood men and good women—\nThe previous chapter spoke of the faithful, clarifying that receiving the precepts and reforming evil earns this title.\nHere, \"good\" refers to innate goodness,\nBestowed by karmic endowment, not arising from upholding precepts.\nThose who delight in wholesome dharmas—\nAll dharmas.\nBy virtue of past goodness, they are able to delight in them.\nUpholding them to life’s end without transgression—\nTransgression is a flaw, failing to complete the beginning and end.\n\nThe violation of precepts is arrogance, giving rise to disbelief.\nThis is what makes one a faithful follower—\nReceiving the scriptures, receiving the Dharma, forever attaining the true Dao.\nTo \"receive the scriptures\" means not merely to study and practice;\nOnly those who practice truly receive the Dharma.\nReceiving the Dharma, one receives the Dao—\nHence it is said to attain it forever.\n\"Forever\" means far-reaching.\nThereupon, Yin Xi, having heard and received them in full—\n\"Full\" means completion—\nHeard the precepts spoken and personally received them,\nUnlike the *Five Thousand Characters*, which Laozi himself produced.\nHe bowed twice and asked: Why are there five?\nHuman wrongdoings are countless, all requiring prevention and restraint—\nWhy then are only five precepts taught?\n\nThe Old Master said: The five encompass all evil.\nAll manifold evils arise from these five;\nIf one upholds these five precepts, all evils are extinguished.\nJust as heaven has five luminaries to govern the myriad spirits—\nThe five luminaries are the stars.\n\"Spirits\" refers to divine spirits.\nEarth has the five phases to sustain all life—\nMetal, wood, water, fire, and earth.\nAll living beings depend on them for sustenance.\nHumans have the five viscera to govern spirit and clarity.\nThe reason humans possess discerning consciousness lies in the five viscera.\nThe six senses and five desires each have their origins,\nThus the five precepts counter and govern them.\nThis makes clear that these five precepts,\nFrom heaven to humanity, are the foundation of the Three Powers,\nNot newly established.\n\n\"Precepts\" means prevention—preventing transgression.\nBefore transgression, prevention ensures it is not committed;\nAfter transgression, restraint ensures it is not repeated—\nBoth embody the meaning of prevention.\nIf transgression is not prevented,\nThe Three Realms overflow with suffering, and the heavens and humans become empty.\nFailing to prevent transgression allows evil to proliferate daily.\nEvil leads to karmic retribution,\nFilling the Three Realms of suffering.\nOnce the Three Realms are full, the ghostly path spreads unchecked.\nAll beings have a fixed number—\nWhen the Three Realms are full, the heavenly realms become empty,\nAnd human births diminish.\nThus, the five precepts.\n\nThis clarifies the root of the five precepts and their origin.\nYin Xi said: How great are the precepts! Why then do transgressions occur?\nHaving heard this teaching, he marveled at their greatness.\nThough these precepts have existed since ancient times,\nWhy do beings still commit such transgressions?\n\nThe Old Master said: Originally, there was no transgression;\nEven if one transgresses and then receives the precepts, nothing is lost.\n\"Originally, there was no transgression\" means that in a past life,\nOne had already received these precepts, so in this life, there is no transgression.\nIf this life has transgressions, it is because in a past life,\nThere were no precepts, or they were violated—hence the transgression.\nYet if in this life one receives and upholds them,\nThen in this life there is no transgression, and future lives will be good.\nThus, though one transgresses and then receives the precepts, nothing is lost.\nThe earlier verse says: *Life after life, one receives great blessings.*\nThis is its meaning.\n\nYin Xi asked about one transgression,\nBut the answer addressed three—\nResponding to the latter question while revealing past, present, and future lives.\nIt clarifies that humans, endowed with the Dao, are originally without transgression,\nAs the meaning is shown in the scriptures.\n\nYin Xi said: May I ask about their origin?\nSince transgression and attainment are now clear, the principle must be elucidated—\nThus he inquired about their origin to seek their culmination.\n\nThe Old Master said: Now I shall fully explain their origin for you.\nFollowing his question, he expounded their reason—hence \"fully.\"\nListen carefully, listen carefully and receive them,\nSo that all may know.\n\"Listen carefully\" means to guard against deficiencies.\n\"Receive carefully\" means to avoid falsehood and delusion.\nOnly then can all be made to hear and know.\n\nYin Xi bowed twice and stood reverently to listen.\n\"Stood reverently\" means what is now called kneeling upright.\n\nThe Old Master said: The five precepts began with heaven and earth,\nAnd exist alongside all things.\nWhere there are heaven and earth, there are the myriad things;\nWhere there are the myriad things, there are attainment and loss;\nWhere there are attainment and loss, there are the Dharma and precepts to govern them.\nUpholding them brings fortune; losing them brings misfortune.\nGood fruits are fortune; evil retribution is misfortune.\nThe matters of fortune and misfortune are fully set forth in later chapters.\nAll who attained the Dao in the past did so through them.\nThus, the spirits number twenty-five—\nThe number five times five.\nThe *Inner Classic* speaks of twenty-five spirits,\nThe numinous essence of the human body,\nCorresponding to the celestial perfected and residing within.\nWhen one upholds the precepts and the body is pure, these spirits remain at peace.\nThe meaning of the *Five Thousand Characters* lies herein.\nThe matters of transgression are all contained within the *Five Thousand*,\nWhile these precepts were expounded specifically in response to Yin Xi’s request.\n\nThe Old Master said: The five precepts—\nIn heaven, they are the five planets:\nIn the east, Jupiter; in the west, Venus; in the south, Mars;\nIn the north, Mercury; and in the center, Saturn.\nWhen the heavenly Dao loses the precepts, omens and disasters appear.\nThe five planets each occupy a direction, their movements, qi, and colors all following constancy.\nIf the heavenly cycles lose harmony, yin and yang fall into disorder,\nDeviating from their proper courses and manifesting portents.\nThus the scripture says: *If heaven cannot remain clear, it will surely split.*\n\"Split\" refers to the ruler losing virtue, yin and yang collapsing,\nAnd the five planets reversing their courses.\n\nOn earth, they are the five peaks:\nIn the east, Mount Tai; in the south, Mount Heng;\nIn the west, Mount Hua; in the north, Mount Heng;\nAnd in the center, Mount Song.\nWhen the earthly Dao loses the precepts, the hundred grains do not ripen.\nThe five peaks each govern their direction, the sources of wind, clouds, water, and rain.\nIf the earthly Dao loses the precepts,\nDisastrous winds and floods arise, along with droughts,\nAnd the hundred grains fail to bear fruit.\nAll grasses and trees are called \"grains.\"\nThe scripture says: *If earth cannot remain stable, it will surely erupt.*\nThis refers to mountains collapsing and rivers drying,\nAll things suffering calamity—all due to the ruler’s faults.\nFirst, omens appear in heaven, then disasters descend upon earth.\n\nIn the numerological scheme, they are the five phases.\n\nThe east corresponds to wood, nine; the south to fire, three; the west to metal, seven; the north to water, five; and the center to earth, twelve. Though the center holds its position, it resides within the four seasons. When the five numbers lose the precepts, water and fire clash, metal and wood injure one another. The five numbers shift and transform, completing the four seasons; if they falter, disasters, pestilence, and warfare arise. The *Scripture of Western Ascension* states: *When the five phases do not overcome one another, all things may be preserved whole.*\n\nIn governance, they are the Five Emperors:\nThe east, Taihao of wood; the south, the Flame Emperor of fire; the west, Shaohao of metal; the north, Zhuanxu of water; and the center, the Yellow Emperor of earth. When the Five Emperors lose the precepts, their reigns are cut short, and their lives end prematurely. The Five Emperors succeed one another in rule, the five phases generating one another, each assuming office according to its direction. If they lose the precepts and govern with tyranny, their states will not endure, nor will they attain longevity.\n\nIn the human body, they are the five viscera:\nThe liver pertains to wood, the heart to fire, the lungs to metal, the kidneys to water, and the spleen to earth. When the five viscera lose the precepts, one’s nature turns mad. Engaging in evil deeds causes the five viscera to lose their spirit; when the five viscera lose their spirit, one’s nature becomes deranged. *Deranged* means perverse. One must observe the five precepts to guard against the five evils. Each evil arises from its own source, yet even a single evil can drive one’s nature to madness—it need not wait for all five. Here, *five* is spoken to encompass their totality. The scripture says: *Indulging in hunting and chasing game drives the heart to madness.* The heart governs the five viscera, so this is but one example. Thus, a later passage states: *Lose one, and life cannot be fulfilled.*\n\nFurthermore, examining the intent of the precepts—from heaven to humanity—all speak of losing the precepts as the cause of fortune and misfortune, making clear that the rise of calamity begins with people. Therefore, when rulers act with virtue, the myriad people depend on them; if they act wickedly, the realm suffers. Thus, we know that in the governance of the Three Powers, success and failure are shared alike. Though from heaven to humanity there are five categories, the root of failure lies solely in people. Hence, the next passage states: *To observe the precepts in this is to accord with that.* Laozi says: *These five matters: observe the precepts in this to accord with that.* The five matters above all depend on people, hence *observe the precepts in this*. *To accord with that* is to follow principle. The arising of calamity stems from violating principle; if one acts in accordance with principle, what need is there for precepts? This makes clear that precepts are for guarding against transgressions. If one transgresses and does not guard against it, how can the arising of disaster and calamity be averted?\n\nThe precept against killing corresponds to the east, the qi of birth and growth. Yet when people violate this precept, the liver suffers harm. Qi and numbers resonate, extending from within to without. The liver governs growth and nourishment, so all things naturally cherish life. A nature that harbors killing reverses the qi, which surges against the liver; the liver’s qi becomes fierce and violent, bringing disaster upon the self—hence, *harm*.\n\nThe precept against stealing corresponds to the north, the essence of great yin, which governs storage and concealment. Yet when people steal, the kidneys suffer misfortune. The kidneys belong to great yin, and yin governs storage and concealment, so all things naturally know how to gather and preserve. When people steal, the kidney qi is injured—hence, *misfortune*. *Misfortune* is the consequence of accumulated evil.\n\nThe precept against licentiousness corresponds to the west, the quality of lesser yin, where male and female remain steadfast. Yet when people indulge in licentiousness, the lungs suffer corruption. The lungs belong to lesser yin, and metal’s nature is firm and steadfast, so men are upright and women chaste. When people indulge in depravity, the lung qi withers and dries—hence, *corruption*, the baleful qi of drought.\n\nThe precept against intoxication corresponds to the south, to fire, the qi of great yang, by which things reach completion. Yet when people indulge in wine, the heart suffers its poison. The heart governs the entire body and brings human beings to fulfillment—this is the qi of great yang. Those who indulge in wine allow poison to surge into the heart, causing the viscera and bowels to fall into neglect, leading to confusion and ruin.\n\nThe precept against false speech corresponds to the center, the virtue of earth, which is trustworthy. Yet when people speak falsely, the spleen suffers disgrace. The spleen pertains to earth, and earth is trustworthy and constant—hence, *virtue*. The nature of human beings takes trust as its foundation; when people speak falsely, disgrace returns to themselves. The spleen governs the entire body with righteousness.\n\nThe five virtues support one another and must not be diminished. *Diminished* means abandoned; *deficient* means injured. When people receive life, they must possess these five virtues. If the five virtues are not diminished, one will enjoy good fortune until the end—hence, *they must not be diminished or deficient*. Laozi says: *Lose one of these five, and life cannot be fulfilled.* Earlier, the origins of the human body were explained, each arising from its own source; this is called *violation and transgression*, the fault of diminution and deficiency—hence, *life cannot be fulfilled*. *Life cannot be fulfilled* means failing to complete one’s allotted nature and years. The *Yuanming Bao* states: *Acting with uprightness does not exceed attaining one’s destined lifespan.* *Destined lifespan* is the proper life.\n\nTherefore, not killing extends even to the absence of a killing mind. The rise of a killing mind begins with a lack of vigilance, which then grows severe. Here, *even to the absence of a killing mind* means guarding against it from the slightest inclination. Even if one does not personally kill, one may cause others to kill, encourage others to kill, watch others kill, or order others to kill—if the mind does not deem it evil, it is the same as killing. The reason is that all such acts arise from a killing mind. Without vigilance, one will never achieve completion.\n\nNot stealing extends even to the absence of illicit gain. Those who covet and steal begin with petty theft; if petty theft goes unchecked, it leads to grand larceny. One may exploit public benefit for private gain, manipulate the law to seize property, rely on power and influence to enclose mountains and marshes, or deceive and coerce the foolish to exploit their labor. Whatever is obtained in such ways is not by right principle—it is the same as stealing. Hence, *even to the absence of illicit gain*. This makes clear that it is not only outright theft but all forms of greed.\n\nNot engaging in sexual misconduct extends even to the absence of impure thoughts. Sexual misconduct arises from indulgence, whether in men or women, their desires are manifold. Among the Five Precepts, none is weightier than this, for it leads to the ruin of body and family—thus, no further discussion is needed. Yet there are those who, unafraid of the net of transgression, use the pretext of the Dao to gratify their lusts, outwardly feigning devotion while inwardly wallowing in impurity. Such persons are truly great evildoers, hence *even to the absence of impure thoughts*. All sexual conduct outside the bond of husband and wife is impure.\n\nNot consuming intoxicants extends even to resisting coercion. Wine leads to transgressions, and though one may be pressed by superiors, it can result in chaos and loss. Now, with the precept as one’s support, even under coercion, one does not violate it. The harm of wine is like fire left unchecked—it grows ever fiercer and does not cease until it burns itself out.\n\nNot speaking falsehood extends even to the absence of leakage. A mind of truth harbors no private malice. Without private malice, there is nothing to conceal. Without concealment, what can leak out? Only thus may one be said to have achieved completion. Earlier, it was said that losing one precept prevents the attainment of destiny—this principle was not yet fully expounded. Now, with this reiteration, the meaning is roughly clear, hence *only thus may one be said to have achieved completion*.\n\nLord Lao said: Within the precepts, sexual misconduct and wine give rise to the Five Evils. Lust leads to extravagance, extravagance to demand, demand to theft, theft to deceit, deceit to fear, and fear to killing—all these stem from lust. Wine incites madness and also fuels lust. The *Taiqing Sutra* states: The human body contains thirty-six thousand worms, all dwelling within the five viscera and the skin. When one drinks wine, these worms stir; when they stir, all manner of evils arise, and with evils arisen, there is nothing one will not do. Thus it is said to give rise to the Five Evils.\n\nPrecepts are for restraining evil. In this degenerate age, men and women, though bound by kinship, fall into incest. *Huān* means mixing; *lí* means violating. It speaks of how the mind of lust knows no bounds of lineage, using the pretext of the Dao to intermingle without distinction.\n\nArrogance toward superiors and violence toward inferiors defile the celestial virtue. Arrogance toward the divine is defilement; mutual harm among the lowly is violence. Drunkenness and brawls lead to lawsuits, bringing calamity, disgrace, and ruin. *Chén* means indulgence; *xù* means daily drunkenness. *Zhēng* means conflict; *sòng* means litigation. Harming life is calamity; ensnaring the body is disgrace.\n\nDeceit and fraud know no bounds. *Wàng* means falsehood; *zhà* means deception; *qī* means trickery. Such persons, in their pursuit of wealth and profit, disregard all three.\n\nTheft among the six relations is not limited to outsiders. Husband and wife, father and son, brothers—these are the six relations. Theft is not only against others; even a son may steal from his father, a wife from her husband, or brothers from one another—nothing is beyond them.\n\nKilling living beings to nourish body and mouth. Killing for medicine is to nourish the body; slaughtering for the kitchen is to profit the mouth. Such persons, seeing life, incur karmic debt and forever sink into suffering. Those who do not receive the precepts in life, who only practice evil, see their evil karma grow and fall into the Three Wretched Realms. Enduring the Five Evils without respite, those who commit the Five Evils enter hell, suffering the full retribution of the Five Torments without end or limit.\n\nThe sutras say: The retribution in the Three Wretched Realms lasts at least one kalpa. If there are those who escape, it speaks of varying degrees of severity—some may eventually return to be born among humans. They will be born among the barbarians of the frontier, short-lived and maimed. The frontier barbarians are savages who devour one another. This is the retribution for killing: if born in such lands, or even in the Central Kingdom, they will be short-lived or physically impaired.\n\nTheir spouses will be ugly and base, unchaste and impure. This is the retribution for lust. *Chǒu* means repulsive; *è* means vile. Unchastity is lust; impurity is greed.\n\nPoverty, exposure to the elements, and constant insecurity—even if they possess wealth, it will be seized by others. This is the retribution for theft. Exposure means having no shelter; insecurity means being unable to escape hunger and cold. Even if they have property, it will be plundered to repay past debts.\n\nTheir words will not be trusted, and no one will befriend them. This is the retribution for falsehood. Whether their words are right or wrong, none will believe them. Without trustworthiness, how can they have friends?\n\nTheir thoughts will be dull and obstructed, and all will disdain and belittle them. This is the retribution for wine. Born in turbidity, they will lack clarity in death. How can such a rebirth be pure? Thus, they are despised by all.\n\nLord Lao said: Devout men and devout women who uphold the precepts and practice the Dao will enjoy peace and happiness in this life, free from sorrow and affliction. Those who uphold the precepts and practice the Way set their minds on the Dao. With all evils dispelled, they abide in goodness forever—what sorrow or affliction could there be? Sorrow and affliction arise from evil deeds, for they are bound to evil. How could they come without cause?\n\nThey will be revered by all. Not engaging in lust, they earn universal respect. All who see them will feel awe and joy. Without the mind of killing, all who encounter them will feel awe and joy. They will constantly receive offerings. Not stealing, people will gladly provide for them. All will look up to them. Not speaking falsehood, their words will always be true—who would not revere them? Their wisdom will be profound and subtle. Not drinking wine, their thoughts will be calm and serene, entering the profound. Abiding in purity, their four elements will be whole and firm. Having received these five rewards, wherever they go, they will be loved and respected. Constantly pure, untainted by the vulgar, their four limbs will be sound. Without external distractions, their internal organs will be unharmed, their exterior and interior firm and unbreachable, and no illness will arise. Thus, they will be able to cultivate and gather all dharmas to attain the true Dao.\n\nThose prior teachings expounded the karmic retribution of evil conditions arising from the absence of precepts. Here, the observance of the Dharma is shown to bring blessings in this very life, even unto the attainment of the Dao—none of this is possible without it. Furthermore, it is made clear that to walk the Way, one must cultivate and gather all virtues to realize the true. Thus, the Dao is elucidated through the Dharma, and the true is made manifest through the person.\n\nYin Xi bowed twice and said: \"I venture to ask about the method of receiving and upholding the precepts?\"\n*(Note: \"Receiving\" here should be understood as \"transmitting.\")*\nNow that the precepts are fully expounded, the next inquiry concerns the rites of transmission and upholding. Having raised this new question, he bowed again to make his request.\n\nLord Lao said: When men and women hear the Dharma and generate faith, they take refuge in the Three Treasures.\n*(This refers generally to those who first arouse the aspiration.)*\nThe Dharma here means the precepts. The Three Treasures are also called the Three Honored Ones or the Three Masters: the Dharma of the Most High, the transmission of the Dharma of the Most High, and the lineage of that transmission—these are the Three. Thus, the Most High is the lord of all dharmas, the transmitter of the Dharma is the teacher of all learners, and Lord Lao is the master of this Dharma, while other teachings follow their respective origins.\n\nThey should immediately bow their heads in reverence.\n*(Those who wish to arouse the aspiration should be transmitted the precepts at once, without hesitation or inquiry into their past conduct.)*\nWhy is this so?\nThe precepts are fundamentally for the removal of evil; as long as one has the aspiration, what need is there to discuss past actions? Moreover, the human mind is often deluded—though a good impulse may arise momentarily, it may soon waver and retreat. Therefore, one should seize the moment to encourage, not waiting until the day’s end.\n\nThey take refuge in the Great Dao with their bodies, take refuge in the Great Dao with their spirits, and take refuge in the Great Dao with their lives.\nThis threefold refuge addresses the fact that the body may be good or evil, the spirit may know fear, and life may be long or short—these are the three necessities for all sentient beings. Now, by taking refuge in the Dao with all three, one who receives and practices the precepts will: first, ensure that in life and death, they remain constantly good and do not fall into evil conditions; second, strengthen and rectify their spirit so that they need not fear demonic influences; and third, enjoy longevity in this life without suffering untimely death. Though the refuges are three, in essence, they are one. The earlier reference to taking refuge in the Three Treasures pertains to the Dharma, while this reference to the Great Dao denotes the eternal—what was previously praised as the mysterious and empty Dao.\n\nThe men and women\ndeclare their names and make their vows.\nThey abandon the perverse ways of the world,\n*(Abandon means to leave behind. All worldly pursuits are perverse ways.)*\nand uphold the true precepts,\n*(Like holding an object in hand, ever fearful of losing it.)*\nresolving to keep them with their bodies and lives, never violating or transgressing them.\n*(The body refers to conduct; life refers to consciousness. Thus, they resolve never to transgress or diminish the precepts in either aspect.)*\nThereupon, they praise and recite, receiving with reverent hearts.\n*(This refers to the recitation of the Five Precepts. The transmission is received in person: after completing the Three Refuges before the Three Treasures, bowing their heads, they make their vows, receive explanations of each precept, and are then transmitted the precepts. A reverent heart means treating the occasion as if in the presence of the divine.)*\n\nLord Lao said: If men and women, having received the true precepts, further seek the scriptures,\n*(This refers to the Five Thousand Character Text.)*\nthey should first receive the precepts.\n*(Earlier, it was said that after receiving the precepts, one may receive the scriptures; now it is said that one should first receive the precepts. The former refers to the time of receiving the scriptures, when the precepts are again expounded. If both scriptures and precepts are to be received, the precepts should come first.)*\nOnly after ensuring their steadfast purity should the scriptures be transmitted.\n*(This examines whether the recipient has upheld the precepts; if there have been lapses, they are permitted to renew themselves, making clear the reason for re-transmission.)*\nThey should reverently uphold them day and night, without ceasing at any time.\n*(Morning and evening rituals must not be neglected, even in hunger or cold—this is the way to uphold the scriptures.)*\nEach month, they observe the ten days of uprightness;\n*(The month has ten fast days.)*\neach year, they observe the three months of fasting.\n*(One year includes three months of prolonged fasting.)*\nAfter reciting the scriptures ten thousand times, they ascend in broad daylight to the morning realm.\n*(Reciting aloud is called \"recitation.\" The morning realm is the domain of true immortals. Through these fasts and recitations, one attains the flight of immortality. The *Scripture of Western Ascension* states: \"With meticulous and wondrous words, the inner meaning does not depart; recite the text ten thousand times, and with sincere thought, penetrate it thoroughly.\" This is the meaning.)*\nThe ten days of uprightness and three months of fasting have their own separate scriptures.\n\nIf one expounds and disseminates the scriptures, propagating their wondrous meanings, this brings great benefit to sentient beings, delivering them from the three evil destinies and all suffering.\n*(To expound and lecture, guiding those who have not yet awakened, is to widely bestow merit and deliverance, rescuing beings from the three evil destinies.)*\nThrough such merit and virtue, one severs the roots of past karma, eradicates immeasurable afflictions, and ascends to the Upper Clarity, never to regress.\n*(When merit is complete and virtue perfected, the roots of birth and death are extinguished, and the Dao of the Upper Clarity is attained without regression.)*\nThis briefly outlines the culmination of the path of cultivation—from upholding the precepts to the attainment of non-action, encompassing the great Dharma from beginning to end.\n\nLord Lao said: Devout men and devout women, whether householders or renunciates, who receive and uphold the scriptures, aspire to the divine immortals, recite day and night, and seek their wondrous meanings—\n*(This refers to the principle of non-action.)*\nthey cast aside all defilements and distractions, harmonizing the mind and mastering the nature.\n\nThis refers to worldly learning.\n\nThe superior person practices the Dao amidst the marketplace, while the inferior person retreats to the mountains and forests. Mountains and forests signify that impurities still abound, and one cannot yet immediately harmonize with stillness, thus withdrawing from the world to cultivate and subdue the self. Yet if one can cultivate and subdue the self within the world, there is no need to rely on mountains and forests.\n\nWith a gentle countenance and kind demeanor, one exhorts all men and women: when the mind is coarse, the appearance becomes harsh; when the intent is wild, the speech turns foul. But with a harmonious expression and soft words, those who see will feel affection and no anger will arise.\n\nDistance yourself from the five evils, uphold the five precepts, and make offerings to the Three Treasures. Having grasped the most wondrous principle and discerned good from evil, one expounds what one has attained, urging others to abandon all evil conditions.\n\nStrive for their accomplishment without regard for ease or hardship. Recognize differences in capacity—some are sharp, some dull; some natures are good, some evil—yet adapt to others, guiding them into the Dao. Do not seek personal gain, nor shrink from humiliation: this is teaching.\n\nThose who fully uphold the great precepts, engage in ascetic practice with purity, practice generosity and forbearance, and sacrifice themselves to save others—these are the practitioners of cultivation. The great precepts comprise the one hundred and eighty precepts, the Taiqing precepts, and others. The Fourfold Bright Prohibitions and the great taboos of the immortals are all essential methods for those who study the Real.\n\nDiligence means unwavering generosity: whatever is sought, one gives without refusal, sparing neither wealth nor goods, regardless of abundance or lack. Forbearance means enduring insult without complaint—even when beaten or whipped, one harbors no resentment. Sacrifice means rushing to aid those in peril without regard for one’s own life; if one sees the cold and hungry, one strips oneself to provide, not waiting to be asked.\n\nThose who leave the world to dwell in secluded abodes, focusing the mind on ultimate stillness, undisturbed by any hardship—these are the devotees of the spirit. Leaving the world to dwell in mountain seclusion avoids the filth of the mundane; solitary wandering without companionship leaves no room for other thoughts. \"Focused\" means unifying the will; \"mind\" means contemplating the attainment of the spirit. \"Stillness\" means concentration: with the mind settled in concentration, wisdom stabilizes within, and no external hardship or honor can disturb it.\n\nSuch practice necessarily culminates in non-action. To cultivate these deeds is to assuredly realize the truth of non-action.\n\nLord Guan Yin asked: \"Does upholding the scriptures entail transgressions?\"\n\nSince the precepts on good and evil have already been expounded, one who knows the scriptures yet violates them incurs fault and loss. How so? This is a general inquiry into all scriptures, not limited to the Five Thousand Characters. As the earlier verse states, \"All归 to the Supreme Scripture,\" and what follows clarifies the destruction of the Dharma and the difficulty of transmission and reception—thus we know this to be the case. This exchange between Lord Guan Yin and Laozi serves to elucidate matters of sin and merit.\n\nLaozi replied: \"There are thirteen.\"\n\nThe scripture states: \"Of those who follow life, there are thirteen; of those who follow death, there are thirteen.\" To uphold the scriptures and follow the Dharma is to attain long life; to violate the precepts and commit evil is to move toward death. Having answered the question regarding faults and losses, he thus speaks directly of the thirteen.\n\nLord Guan Yin asked: \"What does this mean?\"\n\nHe inquired about the matter of the thirteen.\n\nLaozi said: \"Listen carefully.\"\n\nSince there is further clarification, he admonishes again: The thirteen are the six dusts and six consciousnesses, all arising from the mind. The six dusts refer to the six entrances, for what enters can defile the true nature—hence they are called dusts. The six consciousnesses are the roots of the six entrances, capable of generating discrimination—hence they are called consciousnesses. The mind is their master, making thirteen in total; the lower scroll provides a full explanation. All causes of evil arise from the thirteen, and the path to goodness arises from their cessation. Entering goodness is life; committing evil is death. This life and death are not limited to this body. To cultivate goodness without cease is to attain the Dao; on the day the Dao is attained, how can this not be life? Thus the scripture says \"emerge.\" To commit evil without respite is to sink into hell—how can this not be death? Thus the scripture says \"enter.\"\n\nTherefore, lust, greed, and envious wrath—\nLust arises from the pursuit of form, hence it stands at the forefront of the thirteen. Lust may involve greed, but not all greed involves lust. Yet greed as a flaw is not limited to wealth and status; it extends to craving fame and worldly success. To resent others surpassing oneself is jealousy; to desire their superiority is envy. Wrath refers to true anger. When greed and envy arise, wrath naturally follows.\n\nDeceit, theft, falsehood, and fraud—\nTo take things in violation of the precepts is deceit and theft, meaning to deceive the mind. To feign promises for a time is falsehood and fraud, employing cunning to gain advantage—what is called the bane of the people.\n\nFlattering speech and double-tongued words—\nWords that are false yet embellished are flattering speech. To reverse right and wrong is double-tongued speech. Both arise from deceit and fraud.\n\nFlattery for profit and clinging to power—\nTo speak of calamities and omens, proclaiming fortune and misfortune, using humble words to extol others for personal gain—this is flattery. To rely on temporal authority to control others—this is clinging to power. The most extreme flattery extends to praying to spirits and sacrificing to ghosts to seek unjust protection.\n\nDefilement and destruction of the Dharma—\nThe mixing of men and women without distinction is defilement. Destruction of the Dharma refers to the presence of such acts. Initially indulging in lust, it culminates in defilement—all arising sequentially. Such is not the conduct of the pure and faithful. Those who act thus hasten to the realm of death; if even the pure and faithful do not behave so, how much less should those who uphold the scriptures!\n\nThe net of Heaven does not fail—\nThis cites the scripture to clarify the matter. Though the net of Heaven is vast, the principle of karmic retribution never misses.\n\nLife and death leave no refuge—\n\"Life\" refers to witnessing retribution; \"death\" refers to facing judgment—there is no place to escape.\n\nHaving answered the question regarding the thirteen, what follows clarifies karmic retribution. Such people lack the capacity for wisdom. From ignorance arise all karmic offenses, thus they have no share in the Dharma. Defilement corrodes the Dharma, destroying good roots. The transmission of the Dharma is like a tree with roots—growth is unceasing; this is the good root. With such evil conduct, daily deepening defilement, how can the good root not be destroyed?\n\nThey are not known by those who do good.\nTheir conduct being evil, they associate with the wicked; the foolish and base naturally form their company. The good refer to those of superior talent, wisdom, and virtue.\n\nThey assume the bodies of sentient beings.\nAll this stems from past causes, lacking in wisdom and merit, thus in this life they are born foolish and dull. \"Foolish and dull\" refers to committing all manner of evil deeds, not to a lack of understanding.\n\nHaving no goodness in life, they fall into the three evil paths at death, assuming the bodies of sentient beings. Sentient beings are of myriad kinds, each receiving a body according to karmic retribution.\n\nThey sow the seeds of lust, with no aversion or avoidance.\nThe multitude of sentient beings arises from the propagation of lust. This refers to receiving such retribution due to past karmic actions—like chickens and dogs among humans, with no avoidance or preference, acting according to their kind, without hatred or love, all determined by past karma.\n\nThey are constantly filled with fear and dread.\nThis is the retribution for past greed and grasping. Among hungry ghosts, there are myriad types; though called hungry, some may occasionally be sated. Here, \"unsated\" means never having experienced fullness. In hell, the five pains are unceasing. Those in hell suffer torment with intervals of respite; \"unceasing\" means no rest at all. The five pains are the five sufferings—thus is the retribution of the three evil paths.\n\nAssuming such bodies, they endure all manner of suffering and evil.\nWhen the retribution of the three paths is exhausted, they are born among humans, yet their forms are incomplete, bearing all manner of disabilities—festering sores, scabies, leprosy, and the most repulsive afflictions.\n\nThey are despised by all beings—\nNot only by humans, but even among animals, they are met with hatred and aversion.\n\nUnattended and untended,\ntheir afflictions so repulsive that none would heal them—\nthis is the retribution of defilement, arrogance, and frivolous dharma.\n\nIn the cycle of birth and death, they remain unhearing and unseeing:\n*unhearing* means they do not believe in the teachings;\n*unseeing* means they do not encounter good conditions.\nThis broadly clarifies the thirteen transgressions against the dharma—\nthe destinies of birth and death.\n\nAll arise from a single thought, multiplying into countless thoughts,\ntheir consequences boundless.\nFor those who do evil, it begins with the first impulse.\n\n[Text incomplete]\n\n*Tai Shang Lao Jun Jie Jing* concludes.\n\n#1 Before the character *dòng* (洞), the character *kōng* (空) may be missing.\n#2 Before *zhī rén* (之人), text may be missing.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞神部戒律类 太上老君戒经 经名：太上老君戒经。 撰人不详，约出於南北期。 假托老君为关令尹喜讲授。 一卷。 底本出处：《正统道藏》洞神部戒律类。 太上老君戒经 戒上 老君西游，将之天竺。 周幽王之末也。 周而西之于天竺。 天竺，国名也。 事出《玄妙内篇》。 以道德二经，授关令尹喜，喜受经毕，又请持身奉经之法。 授经之事，具载记传，此略序请戒之端耳。 受经既竟，理应宣通，故重请奉经持身。 持身之法，备在经文，但文旨深微，非始学便晓，故别请其要，以斩后语者也。 老君於是复授喜要戒，普令一切，咸持度世。 谓但持戒去恶，自得度世。 然持戒者，乃为奉经，奉经者，必在求道。 今既闻奉持之法，且举戒而言也。 於是说颂三章。 颂者，美其事也。 明持戒奉法，并为道之因，故先诵其宗致，以悟始学，令知其指归也。 初章明持戒所得，身心福渐。 次章明其法既普，家国咸兴，天人同庆。 后章明自渐之深，理穷於经，经理既穷，乃至成真。 故有三章也。 乐法以为妻， 妻者，柄也，谓相依柄也。 阴阳笔气，人伦之道，莫不由夫妻生我者矣。 乐者，谓并有待而相乐也。 一切众生，咸知乐妻，若柄心法教，则无待返偶而生理自足。 又明乐法能如乐妻，则能持身奉经也。 爱经如珠玉。 法，语其所宗； 经，指其所学。 爱者，宝爱也。 世之所宝，莫过珠玉，而世宝无益於心，经法有永於得，故令学人去彼而取此也。 持戒制六情， 六情者，六欲也。 眼欲淫色，耳欲淫声，鼻欲芬芳，舌欲脂味，身欲柔滑，意欲放泆。 如此六事，皆成乎心，故为之情也。 并是三涂恶业，故制而去也。 若不检制，纵恣六情，生为世人所恶，死为鬼之所迫也。 念道遣所欲。 戒以防外，念心摄内。 内摄由念道，念道则所欲外亡。 《西升经》云：道之微心，子未能别，撮取於要，慎戒勿失，先损诸欲，莫令意泆。 即此戒者也。 淡泊正气庭， 人之所以躁竞者，由是六情之所使也。 若持戒念道，则六情澄静，神安气正，邪惑所不能扰。 庭者，黄庭也。 萧然神静默。 萧然，无欲也，静默内定也。 天魔并敬护， 魔谓五帝大魔也，领人生死，在六天之上。 若持戒奉法，终获真仙，则超於三界，故并为其所敬护也。 魔有四种，余三在人身中，故曰天魔。 世世受大福。 谓持戒念道，众恶不生，善因日建，虽经生死，今身后身，常在福中，及至成道，故云大也。 郁郁家国盛，济济经道兴。 谓持戒之福，命无夭伤，见世昌盛，子孙繁茂，有家有国，逮至十方，莫不郁然而盛者也。 天人同其愿， 天谓天上仙也，人谓世中人也。 言持戒奉法，始在人中，受报生天，进业人中，受报生天，进业乃至上清，是故天人同其愿也。 飘眇入大乘。 大乘，谓上清法也。 缘粗铃至妙，阶渐自之深。 既离世升天，从天之上，故云飘眇。 飘眇，犹势飘然也，飞腾之貌矣。 因心立福田， 福者，善之果也。 为福之因，不由於他，己心即福田也。 若修身奉法，众恶自除，犹如治田，去其草秽，草秽既尽，自获良谷者也。 靡靡法轮升。 靡靡，犹渐渐也。 福既积，则法轮渐升之也。 七祖生天堂， 身获道真，七祖蒙庆。 我身白日腾。 持戒志道，功成德就之所至也。",
      "translated_text": "**The Scripture of Precepts by the Most High Lord Lao**\n\n**Preface to the Precepts**\n\nThe Most High Lord Lao journeyed westward, bound for Tianzhu. This occurred at the end of the reign of King You of Zhou. Traveling west from Zhou, he arrived in Tianzhu—a land so named. The account is recorded in *The Esoteric Wondrous Chapters*. There, he bestowed the *Scripture of Dao* and *Scripture of Virtue* upon the Pass Keeper Yin Xi. After Yin Xi received the scriptures, he further entreated the Master for the method of upholding them in body and conduct.\n\nThe transmission of the scriptures is fully documented in records and biographies; here, only the origins of the request for precepts are briefly recounted. Having received the scriptures in full, one ought to propagate and master them, hence the repeated entreaty for the method of upholding them in body and conduct. The method of bodily discipline is expounded in the scriptural text, yet its meaning is profound and subtle, not readily grasped by beginners. Thus, Yin Xi separately requested its essential precepts to sever later doubts.\n\nThereupon, Lord Lao again conferred upon him the essential precepts, universally enjoining all to uphold them and thereby transcend the world. For by upholding the precepts and forsaking evil, one naturally transcends the world. Yet to uphold the precepts is to revere the scriptures, and to revere the scriptures is necessarily to seek the Dao. Now that the method of reverent upholding has been heard, let the precepts be first expounded.\n\nHere follow three hymns of praise. The hymns extol the matter at hand, clarifying that upholding the precepts and revering the Dharma are both causes of attaining the Dao. Thus, their fundamental purport is first chanted to enlighten beginners and guide them to its ultimate aim.\n\nThe first hymn elucidates the blessings of upholding the precepts, which gradually refine body and mind. The second hymn declares that as the Dharma becomes universal, households and states flourish alike, and heaven and humanity rejoice in unison. The third hymn reveals that as refinement deepens, the principles of the scriptures are exhausted, and upon exhausting these principles, one attains perfection. Hence, there are three hymns.\n\n**Hymn One**\nDelight in the Dharma as one delights in a wife—\nA wife is a handle, meaning mutual reliance.\nThe way of human relations, the brush of yin and yang’s qi,\nAll life arises from husband and wife.\n\"Delight\" implies mutual dependence and joy.\nAll beings delight in wives,\nBut if one grasps the Dharma as a handle for the mind,\nThere is no dependence, no pairing, yet life’s principles are self-sufficient.\nThus, to delight in the Dharma as one delights in a wife\nIs to uphold the body and revere the scriptures.\n\nCherish the scriptures as pearls and jade—\nThe Dharma is that which is revered;\nThe scriptures are that which is studied.\n\"Cherish\" means to treasure.\nOf worldly treasures, none surpass pearls and jade,\nYet worldly treasures bring no benefit to the mind,\nWhile the scriptures and Dharma yield eternal attainment.\nThus, the learner is bid to forsake the former and embrace the latter.\n\nUphold the precepts to restrain the six emotions—\nThe six emotions are the six desires:\nThe eye desires lewd sights,\nThe ear desires lewd sounds,\nThe nose desires fragrance,\nThe tongue desires rich flavors,\nThe body desires softness and smoothness,\nThe mind desires indulgence and excess.\nThese six matters all arise from the heart, hence they are called emotions.\nThey are the evil karma of the three realms, thus they must be restrained and abandoned.\nIf left unchecked, the six emotions run rampant,\nIn life, one is despised by the world;\nIn death, one is oppressed by ghosts.\n\nContemplate the Dao to dispel desires—\nPrecepts guard the external;\nContemplation gathers the internal.\nInternal gathering arises from contemplating the Dao;\nContemplating the Dao, external desires vanish.\nThe *Scripture of Western Ascent* states:\n\"The Dao’s subtle heart you cannot yet discern.\nGrasp its essentials, be cautious, and do not lose them.\nFirst diminish desires, let not the mind run wild.\"\nThese are the very precepts here expounded.\n\nSerene and unadorned, the qi of rectitude fills the courtyard—\nThat by which people are restless and competitive\nIs the prompting of the six emotions.\nIf one upholds the precepts and contemplates the Dao,\nThe six emotions become clear and still,\nThe spirit is at peace, the qi is upright,\nAnd no delusion or confusion can disturb.\nThe \"courtyard\" is the Yellow Court.\n\nDesolate and still, the spirit abides in silence—\n\"Desolate\" means without desire;\n\"Still and silent\" means inner tranquility.\n\nHeavenly demons all revere and protect—\nDemons refer to the Five Great Heavenly Demons,\nWho govern life and death from above the Six Heavens.\nIf one upholds the precepts and reveres the Dharma,\nUltimately attaining true immortality,\nOne transcends the Three Realms,\nHence all demons revere and protect.\nThere are four kinds of demons;\nThe other three reside within the human body,\nThus they are called heavenly demons.\n\nLifetimes receive great blessings—\nTo uphold the precepts and contemplate the Dao\nIs to prevent the arising of all evils\nAnd daily establish good causes.\nThough passing through life and death,\nIn this life and the next,\nOne abides ever in blessings,\nAnd upon attaining the Dao, these are called great.\n\n**Hymn Two**\nLush and flourishing, households and states prosper;\nMajestic and grand, the scriptures and Dao thrive—\nThe blessings of upholding the precepts\nEnsure no premature death or harm.\nIn this life, one enjoys prosperity,\nDescendants multiply,\nHouseholds and states flourish,\nExtending to the ten directions,\nAll become lush and flourishing.\n\nHeaven and humanity share the same aspiration—\n\"Heaven\" refers to the immortals above;\n\"Humanity\" refers to people in the world.\nTo uphold the precepts and revere the Dharma\nBegins among people,\nWhere one receives retribution and ascends to heaven.\nAdvancing in practice among people,\nOne receives retribution and ascends to heaven,\nProgressing in practice until attaining Highest Clarity.\nThus, heaven and humanity share the same aspiration.\n\nEthereal and distant, one enters the Great Vehicle—\nThe Great Vehicle refers to the Dharma of Highest Clarity.\nFrom the coarse, one ascends to the wondrous,\nStep by step, refinement deepens.\nHaving departed the world and ascended to heaven,\nFrom heaven one rises still higher,\nHence it is called ethereal and distant.\n\"Ethereal and distant\" describes a soaring, ascending demeanor.\n\n**Hymn Three**\nBy the heart, establish the field of blessings—\nBlessings are the fruits of goodness.\nThe cause of blessings does not lie elsewhere;\nOne’s own heart is the field of blessings.\nIf one cultivates the body and reveres the Dharma,\nAll evils are naturally removed,\nJust as one tends a field,\nWeeding out grasses and filth.\nWhen grasses and filth are exhausted,\nNaturally, fine grain is obtained.\n\nGradually, the Dharma Wheel ascends—\n\"Gradually\" means step by step.\nAs blessings accumulate,\nThe Dharma Wheel gradually ascends.\n\nSeven ancestors ascend to the heavenly halls;\nThis body ascends in broad daylight—\nThe attainment of the true Dao by this body\nBrings joy to the seven ancestors.\nThis is the culmination of upholding the precepts and aspiring to the Dao,\nWhere merit is perfected and virtue is accomplished.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1326,
      "start_sentence": 0,
      "end_sentence": 83,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.45221710205078,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\太上老君戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "大道洞玄虚， 一切诸法，皆称为道。 乃有百官及万八千种，并是六天及三界之道。 大道者，无形无象，洞玄虚#1。 道无不在，理无不应，故云大也。 有念无不启。 启，谓感也。 此明持戒念道，有心即感，念念不止，以至成道，莫非念力。 练质入仙真， 欲多则神浊，气清则质练，练质成真，莫不由戒。 遂成金刚体。 言其表裹坚真，无复朽败者也。 超度三界难 欲界、色界、无色界，此三界生死轮转无休，恒与三涂对治，故云难也。 自非成真，莫能超者也。 地狱五苦解。 五苦是地狱中寒池、火车、擭汤、刀山、剑树也。 解脱既超三界，无复苦绿也。 亦谓五道为五苦者也。 悉归太上经， 上清法也。 众法所穷，故云归太上经也。 静念稽首礼。 诵说既竟，法绿略显，今将说戒，故令静念稽首而受也。 於是尹喜闻说颂已，稽首而立，请受戒言。 老君日：第一戒杀，第二戒盗，第三戒淫，第四戒妄语，第五戒酒。 是为五戒。 若清信男，清信女， 若有男女发心受戒，便得清信之号。 奉持五戒，毕命不犯， 谓持戒至于命终而不能犯也。 是为清信男，清信女。 向发心即号清信，若中涂亏缺，则清信心废。 唯尽命不犯，来生又受福果，则全清信之理，故重云尔。 老君曰：戒杀者，一切众生，含气以上，邓飞蠕动之类，皆不得杀。 蠕动之类，无不乐生，自蚊蚁蜓岫，咸知避死也。 老君曰：戒盗者，一钱以上，有主无主，非己之物，皆不妄取。 在地地官，在水水官，在人人主，如是则无无主之物。 此言无主者，谓当时无志护也。 老君曰：戒娌者，非夫妇。 若出家人，不妻不娶，若男若女，皆不得犯。 夫妻虽非犯戒，过亦为淫犯。 老君曰：戒妄语者，若不闻不见，非心所了而向人说，皆为妄语。 所说事与心相违也。 复有绮言謟曲，反覆两舌，在后戒也。 老君曰：戒酒者，非身病，非法礼，皆不得饮。 身病，谓己身疾，叉应以酒也。 法礼者，明非世俗候会及鬼神之胙。 若尊卑之礼，真灵之飨，则不至於失之者也。 老君曰：是五戒者，持身之本，持法之根。 身本无恶，缘恶持戒，心净身清，可以奉法，故日法根者也。 善男子，善女人， 前章云清信者，明受戒改恶，乃得此号。 此言善者，谓生而善也，是禀业所得，非持戒而起。 愿乐善法， 一切法也。 绿有宿善，故能愿乐。 受持终身不犯， 犯为亏缺，不全首尾；",
      "translated_text": "The Great Dao pervades the profound and void,\nAll dharmas are called the Dao—\nThere are the hundred officials and eighteen thousand kinds,\nAll belonging to the Dao of the Six Heavens and the Three Realms.\nThe Great Dao is formless and imageless, pervading the profound and void.\nThe Dao is nowhere absent; its principle responds without fail—hence it is called \"great.\"\nWith thought, nothing fails to be awakened—\n\"Awakened\" means responsive.\nThis clarifies that upholding the precepts and contemplating the Dao,\nWith mind intent, brings response; thought after thought unceasing,\nUntil the Dao is attained—all by the power of thought.\nRefining the substance, one enters the immortals’ truth;\nWhen desires are many, the spirit is turbid; when qi is pure, the substance is refined.\nRefining the substance to become true—none but through the precepts.\nThus is the body of adamantine formed—\nIts inner and outer firmness and truth leave no room for decay.\nSurpassing the Three Realms’ hardships—\nThe Realm of Desire, the Realm of Form, and the Formless Realm,\nThese Three Realms’ cycle of birth and death knows no rest,\nEver opposing the Three Wretched Paths—hence it is called \"hardship.\"\nOnly by attaining truth can one transcend them.\nThe five sufferings of hell are dissolved—\nThe five sufferings are the icy pools, fire chariots, boiling cauldrons,\nKnife mountains, and sword trees of hell.\nHaving transcended the Three Realms, no more suffering remains.\nIt is also said that the five paths are the five sufferings.\nAll return to the scriptures of the Most High—\nThe methods of the Highest Clarity.\nAll dharmas reach their culmination—hence they return to the scriptures of the Most High.\nWith tranquil thought, bow the head in reverence—\nThe recitation now complete, the dharma’s threads briefly revealed,\nAs the precepts are about to be expounded, one is bidden to still the mind,\nBow the head, and receive them.\nThereupon, Yin Xi, having heard the verses, bowed and stood,\nRequesting to receive the precepts’ words.\nThe Old Master said: The first precept is against killing,\nThe second against stealing,\nThe third against licentiousness,\nThe fourth against false speech,\nThe fifth against wine.\nThese are the Five Precepts.\nIf there are faithful men and faithful women—\nIf men and women resolve to receive the precepts, they attain the title of the faithful.\nUpholding the Five Precepts to the end of life without transgression—\nThis means holding the precepts until life’s end without violation.\nThese are the faithful men and faithful women.\nAt the outset, the resolve earns the title of faithful;\nIf midway one falters, the faithful heart is lost.\nOnly by upholding them to life’s end, receiving blessings in the next life,\nIs the principle of the faithful fully preserved—hence the reiteration.\nThe Old Master said: The precept against killing—\nAll sentient beings, from those possessing qi upward,\nTo the flying and wriggling creatures—none may be killed.\nAll wriggling creatures delight in life;\nEven mosquitoes, ants, and earthworms know to avoid death.\nThe Old Master said: The precept against stealing—\nFrom a single coin upward, whether owned or ownerless,\nAnything not one’s own must not be taken.\nOn land, the earth officials; in water, the water officials;\nAmong men, the human masters—thus there are no ownerless things.\nThis speaks of ownerless as meaning no one presently guards them.\nThe Old Master said: The precept against licentiousness—\nOutside of husband and wife,\nIf one has left the household, neither marrying nor taking a spouse,\nNeither men nor women may transgress.\nEven between husband and wife, excess is licentious transgression.\nThe Old Master said: The precept against false speech—\nSpeaking of what one has not seen or heard,\nOr what the mind does not comprehend—all is false speech.\nThe spoken matter contradicts the mind.\nThere are also ornate words, flattery, duplicity, and divisive speech—\nThese belong to later precepts.\nThe Old Master said: The precept against wine—\nUnless for bodily illness or ritual propriety, one must not drink.\n\"Bodily illness\" refers to one’s own ailments requiring wine.\n\"Ritual propriety\" clarifies that it is not for secular gatherings or sacrificial offerings to ghosts and spirits.\nFor rites of honor and inferiority, or feasts for the true spirits,\nOne does not lose oneself.\nThe Old Master said: These Five Precepts are the root of bodily conduct,\nThe foundation of upholding the Dharma.\nThe body’s root is without evil; through evil, the precepts are upheld.\nWith a pure heart and a clear body, one can uphold the Dharma—\nHence they are called the Dharma’s root.\nGood men and good women—\nThe previous chapter spoke of the faithful, clarifying that receiving the precepts and reforming evil earns this title.\nHere, \"good\" refers to innate goodness,\nBestowed by karmic endowment, not arising from upholding precepts.\nThose who delight in wholesome dharmas—\nAll dharmas.\nBy virtue of past goodness, they are able to delight in them.\nUpholding them to life’s end without transgression—\nTransgression is a flaw, failing to complete the beginning and end.",
      "overlap_context": "ilth.\nWhen grasses and filth are exhausted,\nNaturally, fine grain is obtained.\n\nGradually, the Dharma Wheel ascends—\n\"Gradually\" means step by step.\nAs blessings accumulate,\nThe Dharma Wheel gradually ascends.\n\nSeven ancestors ascend to the heavenly halls;\nThis body ascends in broad daylight—\nThe attainment of the true Dao by this body\nBrings joy to the seven ancestors.\nThis is the culmination of upholding the precepts and aspiring to the Dao,\nWhere merit is perfected and virtue is accomplished.",
      "start_char": 1327,
      "end_char": 2331,
      "start_sentence": 84,
      "end_sentence": 142,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.132490634918213,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\太上老君戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "毁为毁慢，生不信心。 是为清信，得经得法，永成道真。 夫得经者，不爻能修行，能修行者，乃为得法耳。 得法则得道，故云永成。 永，谓远者也。 於是尹喜闻受既已， 已，谓已毕也。 闻说戒言而亲受之，非如五千是老子自出。 再拜而问，何故有五？ 言人之为恶，其事万万方，皆应防戒，今何故止说有五也？ 老君曰：五者，摄一切恶。 言一切众恶，皆起此五，若持此五戒，则众恶悉绝也。 犹天有五精，以摄万灵； 五精，星也。 灵，谓神灵。 地有五行，以摄群生； 金木水火土也。 群生所禀，莫不资之。 人有五藏，以摄神明。 人所以有神明之识者，由於五藏也。 六情五欲，各有所生，故以五戒对而治之。 明此五戒，自天至人，三才之本，非始有也。 戒者，防也，防其失也。 未失则防而不为，既失则戒而不犯，皆是防其义者也。 失而不防，则三涂盈逸，天人虚空。 不防其失，则纵恶日多。 恶绿报对，则充满三涂，三涂既盛，则鬼道横逸。 夫一切众生，皆有定数。 三涂既满，则天堂虚空，生人咸少也。 是故五也。 明五戒根本，所由如此也。 尹喜曰：大乎戒也，何故失耶？ 既闻斯旨，方叹其大。 言有此戒，其来久矣，云何众生，犹有此失。 老君曰：本得无失，既失而得，亦无所失。 本得无失，谓前身过去已得此戒，故於今身而无失也。 而今身有失者，前身无戒，或有而违犯，故有失耳。 虽为有失，而於今身得受持者，则见生无失，后身复善，故既失而得，亦无所失。 前颂云：世世受大福。 即此义也。 尹喜所问一失，而并举三失答之，是对其后问，顿显前身、此生、后身也。 明人禀道，本自无失，义见经中也。 尹喜曰：敢问其本？ 得失既显，事理须明，故却问其本，以求其末也。 老君曰：今当为尔，具说其本。 顺其所问而言其所以，故云具。 谛听，谛听受持，普为一切之所知也。 谛听，戒其阙失。 谛受，使无漏妄。 然后可令一切，咸得知闻。 尹喜再拜，恭立而听。 恭立者，即今长跪也。 老君日：五戒者，天地并始，万物并有。 举其本也。 夫有天地则有万物，有万物则有得失，有得失则有法戒之者也。 持之者吉，失之者凶。 善果为吉，恶对为凶。 吉凶之事，悉备复章。 过去成道，莫不由之。 言凡得道者，莫不绿於戒者也。 故其神二十五也， 五五之数也。 《内经》有二十五神，是人身之灵，上应天真而镇在人身。 持戒身清，则其神常安。 经文五千是其义也。 谓失之事，备在五千，而后此戒者，特应尹喜所请耳。 老君曰：五戒者，在天为五纬， 东曰岁星，西曰太白星，南曰荧惑星，北曰辰星，中央曰镇星也。 天道失戒，则见灾祥。 五星各位一方，行度气色，并各有常。 若天运失和，阴阳愆戾，皆非其分度而见妖征，故经云：天无以清，将恐裂。 裂，谓王者失德，阴阳圯裂，五纬返常也。 在地为五岳， 东曰太山，南曰衡山，西曰华山，北曰怛山，中央曰嵩高山也。 地道失戒，则百谷不成。 五岳各镇其方，风云水雨之所由也。 若地道失戒，则疾风涌水，旷旱之灾，百谷不实也。 一切草木，皆谓之谷。 经言：地无以宁，将恐发。 谓山崩川竭，万物灾伤，皆由王者咎。 先见兆於天，次降灾於地也。 在数为五行，",
      "translated_text": "The violation of precepts is arrogance, giving rise to disbelief.\nThis is what makes one a faithful follower—\nReceiving the scriptures, receiving the Dharma, forever attaining the true Dao.\nTo \"receive the scriptures\" means not merely to study and practice;\nOnly those who practice truly receive the Dharma.\nReceiving the Dharma, one receives the Dao—\nHence it is said to attain it forever.\n\"Forever\" means far-reaching.\nThereupon, Yin Xi, having heard and received them in full—\n\"Full\" means completion—\nHeard the precepts spoken and personally received them,\nUnlike the *Five Thousand Characters*, which Laozi himself produced.\nHe bowed twice and asked: Why are there five?\nHuman wrongdoings are countless, all requiring prevention and restraint—\nWhy then are only five precepts taught?\n\nThe Old Master said: The five encompass all evil.\nAll manifold evils arise from these five;\nIf one upholds these five precepts, all evils are extinguished.\nJust as heaven has five luminaries to govern the myriad spirits—\nThe five luminaries are the stars.\n\"Spirits\" refers to divine spirits.\nEarth has the five phases to sustain all life—\nMetal, wood, water, fire, and earth.\nAll living beings depend on them for sustenance.\nHumans have the five viscera to govern spirit and clarity.\nThe reason humans possess discerning consciousness lies in the five viscera.\nThe six senses and five desires each have their origins,\nThus the five precepts counter and govern them.\nThis makes clear that these five precepts,\nFrom heaven to humanity, are the foundation of the Three Powers,\nNot newly established.\n\n\"Precepts\" means prevention—preventing transgression.\nBefore transgression, prevention ensures it is not committed;\nAfter transgression, restraint ensures it is not repeated—\nBoth embody the meaning of prevention.\nIf transgression is not prevented,\nThe Three Realms overflow with suffering, and the heavens and humans become empty.\nFailing to prevent transgression allows evil to proliferate daily.\nEvil leads to karmic retribution,\nFilling the Three Realms of suffering.\nOnce the Three Realms are full, the ghostly path spreads unchecked.\nAll beings have a fixed number—\nWhen the Three Realms are full, the heavenly realms become empty,\nAnd human births diminish.\nThus, the five precepts.\n\nThis clarifies the root of the five precepts and their origin.\nYin Xi said: How great are the precepts! Why then do transgressions occur?\nHaving heard this teaching, he marveled at their greatness.\nThough these precepts have existed since ancient times,\nWhy do beings still commit such transgressions?\n\nThe Old Master said: Originally, there was no transgression;\nEven if one transgresses and then receives the precepts, nothing is lost.\n\"Originally, there was no transgression\" means that in a past life,\nOne had already received these precepts, so in this life, there is no transgression.\nIf this life has transgressions, it is because in a past life,\nThere were no precepts, or they were violated—hence the transgression.\nYet if in this life one receives and upholds them,\nThen in this life there is no transgression, and future lives will be good.\nThus, though one transgresses and then receives the precepts, nothing is lost.\nThe earlier verse says: *Life after life, one receives great blessings.*\nThis is its meaning.\n\nYin Xi asked about one transgression,\nBut the answer addressed three—\nResponding to the latter question while revealing past, present, and future lives.\nIt clarifies that humans, endowed with the Dao, are originally without transgression,\nAs the meaning is shown in the scriptures.\n\nYin Xi said: May I ask about their origin?\nSince transgression and attainment are now clear, the principle must be elucidated—\nThus he inquired about their origin to seek their culmination.\n\nThe Old Master said: Now I shall fully explain their origin for you.\nFollowing his question, he expounded their reason—hence \"fully.\"\nListen carefully, listen carefully and receive them,\nSo that all may know.\n\"Listen carefully\" means to guard against deficiencies.\n\"Receive carefully\" means to avoid falsehood and delusion.\nOnly then can all be made to hear and know.\n\nYin Xi bowed twice and stood reverently to listen.\n\"Stood reverently\" means what is now called kneeling upright.\n\nThe Old Master said: The five precepts began with heaven and earth,\nAnd exist alongside all things.\nWhere there are heaven and earth, there are the myriad things;\nWhere there are the myriad things, there are attainment and loss;\nWhere there are attainment and loss, there are the Dharma and precepts to govern them.\nUpholding them brings fortune; losing them brings misfortune.\nGood fruits are fortune; evil retribution is misfortune.\nThe matters of fortune and misfortune are fully set forth in later chapters.\nAll who attained the Dao in the past did so through them.\nThus, the spirits number twenty-five—\nThe number five times five.\nThe *Inner Classic* speaks of twenty-five spirits,\nThe numinous essence of the human body,\nCorresponding to the celestial perfected and residing within.\nWhen one upholds the precepts and the body is pure, these spirits remain at peace.\nThe meaning of the *Five Thousand Characters* lies herein.\nThe matters of transgression are all contained within the *Five Thousand*,\nWhile these precepts were expounded specifically in response to Yin Xi’s request.\n\nThe Old Master said: The five precepts—\nIn heaven, they are the five planets:\nIn the east, Jupiter; in the west, Venus; in the south, Mars;\nIn the north, Mercury; and in the center, Saturn.\nWhen the heavenly Dao loses the precepts, omens and disasters appear.\nThe five planets each occupy a direction, their movements, qi, and colors all following constancy.\nIf the heavenly cycles lose harmony, yin and yang fall into disorder,\nDeviating from their proper courses and manifesting portents.\nThus the scripture says: *If heaven cannot remain clear, it will surely split.*\n\"Split\" refers to the ruler losing virtue, yin and yang collapsing,\nAnd the five planets reversing their courses.\n\nOn earth, they are the five peaks:\nIn the east, Mount Tai; in the south, Mount Heng;\nIn the west, Mount Hua; in the north, Mount Heng;\nAnd in the center, Mount Song.\nWhen the earthly Dao loses the precepts, the hundred grains do not ripen.\nThe five peaks each govern their direction, the sources of wind, clouds, water, and rain.\nIf the earthly Dao loses the precepts,\nDisastrous winds and floods arise, along with droughts,\nAnd the hundred grains fail to bear fruit.\nAll grasses and trees are called \"grains.\"\nThe scripture says: *If earth cannot remain stable, it will surely erupt.*\nThis refers to mountains collapsing and rivers drying,\nAll things suffering calamity—all due to the ruler’s faults.\nFirst, omens appear in heaven, then disasters descend upon earth.\n\nIn the numerological scheme, they are the five phases.",
      "overlap_context": "harma’s root.\nGood men and good women—\nThe previous chapter spoke of the faithful, clarifying that receiving the precepts and reforming evil earns this title.\nHere, \"good\" refers to innate goodness,\nBestowed by karmic endowment, not arising from upholding precepts.\nThose who delight in wholesome dharmas—\nAll dharmas.\nBy virtue of past goodness, they are able to delight in them.\nUpholding them to life’s end without transgression—\nTransgression is a flaw, failing to complete the beginning and end.",
      "start_char": 2331,
      "end_char": 3689,
      "start_sentence": 143,
      "end_sentence": 224,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.37012195587158,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\太上老君戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "东方木九，南方火三，西方金七，北方水五，中央土十二。 虽中央而位在四季。 五数失戒，则水火相薄，金木相伤。 五数推移，四时以成，若其有失，则灾疠刀兵。 《西升经》曰：五行不相克，万物尽可全也。 在治为五帝， 东方太皞木，南方炎帝火，西方少皞金，北方颛顼水，中央黄帝土也。 五帝失戒，则祚夭身亡。 五帝为帝王更治，五行相生，随方受任，若失戒暴虐，则国祚不长，身不获寿也。 在人为五藏， 肝属木，心属火，肺属金，肾属水，脾属土也。 五藏失戒，则性发狂。 所行过恶，则五藏失神，五藏失神，则令人性狂。 狂，谓僻也。 寻五戒以防五恶。 为恶各有所生，但一恶便使性狂，不待五也。 今言五者，总其数耳。 经云：驰骋田猎，令人心发狂。 心为五藏之主，故举其一也。 故后章云：失一则命不成。 又寻戒旨，自天及人，皆云失戒而致灾祥者，明为息之起，起自由人。 是以帝王有庆，兆民赖之，如有不善，则天下受殃。 故知三才等治，得失必同。 又自天至人，虽有五条，为失之本，在人而已。 故次章云：戒於此者，而顺於彼也。 老君曰：是五者，戒於此而顺於彼。 谓上来五事，悉在於人，故云戒於此也。 顺於彼者，理也。 夫息之所生，由於违理，若顺理而行，复何戒乎？ 明为戒於过耳，若过而不戒，祸息之兴，岂可禳也！ 故杀戒者，束方也，受生之气，尚於长养，而人犯杀，则肝受其害。 气数相感，自内于外。 肝主长养，故一切咸知慕生。 怀杀之性，则逆气冲肝，肝气凶壮，还自灾身，故云害也。 盗戒者，北方也，太阴之精，主於闭藏，而人为盗，则肾受其殃。 肾为太阴，阴主闭藏，故一切咸知收敛。 而人为盗，则肾气为伤，故云殃也。 殃者，积恶之应者也。 淫戒者，西方也，少阴之质，男女贞固，而人好淫，则肺受其沴。 肺为少阴，金性坚贞，故男正女洁。 而人好侄，则肺气枯竭，故云沴沴恶气也。 旱灾日沴也。 酒戒者，南方火也，太阳之气，物以之成，而人好酒，则心受其毒。 心为一身之主，以成乎人，是太阳之气也。 好酒之人，则毒冲于心，藏府荒废，以致迷丧者也。 妄语戒者，中央土德信，而人妄语，则脾受其辱。 脾属土，土信而有怛，故言德也。 人之禀性，以信为本，而人妄语，则辱归於己。 脾总人身为义也。 五德相资，不可亏缺。 亏，谓废也。 缺，谓伤也。 言人受生，铃备此五德，五德无亏，则终享福吉，故云不可亏缺者也。 老君曰：此五失一，则命不成。 向辩人身，各有所生，此名毁犯，亏缺之咎，故云命不成。 命不成者，谓不全其性分及天年也。 《元命包》日：行正不过得寿命。 寿命，正命。 是故不杀者，乃至无有杀心。 夫杀心之起，起於不戒，遂至增甚。 今言乃至无有杀心者，自微自防也。 自有虽不手杀，或因人行杀，或劝人行杀，或看人行杀，或使人行杀，而心不为恶，皆同於杀也。 所以然者，皆由有杀心。 若其不戒，终不能成就者也。 不盗，乃至无有邪取。 谓贪盗之人，始於小窃，小窃不戒，遂至大取。 或因公利私，或凭法招物，或依恃势力，封山畋泽，或诱说痴愚，以役其力。 如此而得，皆非正理，同於盗，故云乃至无有邪取。 明非正偷盗也，贪婪皆是者也。",
      "translated_text": "The east corresponds to wood, nine; the south to fire, three; the west to metal, seven; the north to water, five; and the center to earth, twelve. Though the center holds its position, it resides within the four seasons. When the five numbers lose the precepts, water and fire clash, metal and wood injure one another. The five numbers shift and transform, completing the four seasons; if they falter, disasters, pestilence, and warfare arise. The *Scripture of Western Ascension* states: *When the five phases do not overcome one another, all things may be preserved whole.*\n\nIn governance, they are the Five Emperors:\nThe east, Taihao of wood; the south, the Flame Emperor of fire; the west, Shaohao of metal; the north, Zhuanxu of water; and the center, the Yellow Emperor of earth. When the Five Emperors lose the precepts, their reigns are cut short, and their lives end prematurely. The Five Emperors succeed one another in rule, the five phases generating one another, each assuming office according to its direction. If they lose the precepts and govern with tyranny, their states will not endure, nor will they attain longevity.\n\nIn the human body, they are the five viscera:\nThe liver pertains to wood, the heart to fire, the lungs to metal, the kidneys to water, and the spleen to earth. When the five viscera lose the precepts, one’s nature turns mad. Engaging in evil deeds causes the five viscera to lose their spirit; when the five viscera lose their spirit, one’s nature becomes deranged. *Deranged* means perverse. One must observe the five precepts to guard against the five evils. Each evil arises from its own source, yet even a single evil can drive one’s nature to madness—it need not wait for all five. Here, *five* is spoken to encompass their totality. The scripture says: *Indulging in hunting and chasing game drives the heart to madness.* The heart governs the five viscera, so this is but one example. Thus, a later passage states: *Lose one, and life cannot be fulfilled.*\n\nFurthermore, examining the intent of the precepts—from heaven to humanity—all speak of losing the precepts as the cause of fortune and misfortune, making clear that the rise of calamity begins with people. Therefore, when rulers act with virtue, the myriad people depend on them; if they act wickedly, the realm suffers. Thus, we know that in the governance of the Three Powers, success and failure are shared alike. Though from heaven to humanity there are five categories, the root of failure lies solely in people. Hence, the next passage states: *To observe the precepts in this is to accord with that.* Laozi says: *These five matters: observe the precepts in this to accord with that.* The five matters above all depend on people, hence *observe the precepts in this*. *To accord with that* is to follow principle. The arising of calamity stems from violating principle; if one acts in accordance with principle, what need is there for precepts? This makes clear that precepts are for guarding against transgressions. If one transgresses and does not guard against it, how can the arising of disaster and calamity be averted?\n\nThe precept against killing corresponds to the east, the qi of birth and growth. Yet when people violate this precept, the liver suffers harm. Qi and numbers resonate, extending from within to without. The liver governs growth and nourishment, so all things naturally cherish life. A nature that harbors killing reverses the qi, which surges against the liver; the liver’s qi becomes fierce and violent, bringing disaster upon the self—hence, *harm*.\n\nThe precept against stealing corresponds to the north, the essence of great yin, which governs storage and concealment. Yet when people steal, the kidneys suffer misfortune. The kidneys belong to great yin, and yin governs storage and concealment, so all things naturally know how to gather and preserve. When people steal, the kidney qi is injured—hence, *misfortune*. *Misfortune* is the consequence of accumulated evil.\n\nThe precept against licentiousness corresponds to the west, the quality of lesser yin, where male and female remain steadfast. Yet when people indulge in licentiousness, the lungs suffer corruption. The lungs belong to lesser yin, and metal’s nature is firm and steadfast, so men are upright and women chaste. When people indulge in depravity, the lung qi withers and dries—hence, *corruption*, the baleful qi of drought.\n\nThe precept against intoxication corresponds to the south, to fire, the qi of great yang, by which things reach completion. Yet when people indulge in wine, the heart suffers its poison. The heart governs the entire body and brings human beings to fulfillment—this is the qi of great yang. Those who indulge in wine allow poison to surge into the heart, causing the viscera and bowels to fall into neglect, leading to confusion and ruin.\n\nThe precept against false speech corresponds to the center, the virtue of earth, which is trustworthy. Yet when people speak falsely, the spleen suffers disgrace. The spleen pertains to earth, and earth is trustworthy and constant—hence, *virtue*. The nature of human beings takes trust as its foundation; when people speak falsely, disgrace returns to themselves. The spleen governs the entire body with righteousness.\n\nThe five virtues support one another and must not be diminished. *Diminished* means abandoned; *deficient* means injured. When people receive life, they must possess these five virtues. If the five virtues are not diminished, one will enjoy good fortune until the end—hence, *they must not be diminished or deficient*. Laozi says: *Lose one of these five, and life cannot be fulfilled.* Earlier, the origins of the human body were explained, each arising from its own source; this is called *violation and transgression*, the fault of diminution and deficiency—hence, *life cannot be fulfilled*. *Life cannot be fulfilled* means failing to complete one’s allotted nature and years. The *Yuanming Bao* states: *Acting with uprightness does not exceed attaining one’s destined lifespan.* *Destined lifespan* is the proper life.\n\nTherefore, not killing extends even to the absence of a killing mind. The rise of a killing mind begins with a lack of vigilance, which then grows severe. Here, *even to the absence of a killing mind* means guarding against it from the slightest inclination. Even if one does not personally kill, one may cause others to kill, encourage others to kill, watch others kill, or order others to kill—if the mind does not deem it evil, it is the same as killing. The reason is that all such acts arise from a killing mind. Without vigilance, one will never achieve completion.\n\nNot stealing extends even to the absence of illicit gain. Those who covet and steal begin with petty theft; if petty theft goes unchecked, it leads to grand larceny. One may exploit public benefit for private gain, manipulate the law to seize property, rely on power and influence to enclose mountains and marshes, or deceive and coerce the foolish to exploit their labor. Whatever is obtained in such ways is not by right principle—it is the same as stealing. Hence, *even to the absence of illicit gain*. This makes clear that it is not only outright theft but all forms of greed.",
      "overlap_context": " rain.\nIf the earthly Dao loses the precepts,\nDisastrous winds and floods arise, along with droughts,\nAnd the hundred grains fail to bear fruit.\nAll grasses and trees are called \"grains.\"\nThe scripture says: *If earth cannot remain stable, it will surely erupt.*\nThis refers to mountains collapsing and rivers drying,\nAll things suffering calamity—all due to the ruler’s faults.\nFirst, omens appear in heaven, then disasters descend upon earth.\n\nIn the numerological scheme, they are the five phases.",
      "start_char": 3689,
      "end_char": 4996,
      "start_sentence": 225,
      "end_sentence": 293,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.27603530883789,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\太上老君戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "不淫，乃至无有邪念。 淫者，皆由放恣，或男或女，情欲不一。 寻五戒之重，莫过於淫，亡身丧家，故不复论。 又有不畏罪网，因法媾欲，外托奉道，内实淫浊。 如斯之徒，实为巨恶，故云乃至无有邪念。 自非夫妻而行淫者，皆为邪也。 不酒，乃至无有势力。 夫酒致过，或因尊上之所劝逼，遂至乱失。 今以戒自持，虽有势力，亦不违犯。 酒之伤人，如火不救，逾多逾盛，不极而不止者也。 不妄语，乃至无有漏泄。 真实之心，则无私恶。 无私恶，故无有隐讳。 无隐讳，复何漏泄也。 如是可谓成也。 前云失一则命不成，是理未曲备。 今既重说，其义粗显，故云如是可谓成也。 老君曰：戒中淫酒，能生五恶。 淫则奢，奢则责，食则盗，盗则欺，欺则惧，惧则杀，此并淫之所能至也。 酒能发狂，又能淫。 《太清经》云：人身有三万六千虫，皆在五藏皮肤之中，饮酒则诸虫唉动，唉动则众恶兴，众恶兴则无所不为。 故云能生五恶也。 戒者，戒恶也。 恶世之中，男女权娌，罹於骨肉。 讙，谓杂也。 罹，谓犯也。 言淫欲之心，人乃至不避姓族，因法混杂，无复分别者也。 上慢下暴，毁篾天德。 上慢天灵为篾，下相残害为暴之者也。 沈酗争讼，祸命辱身。 沈，犹耽也，狂酒日酗。 对斗为争，诉理为讼，害命为祸，陷身为辱也。 妄诈欺诳，罔有所由。 妄谓妄语。 诈谓诈伪。 欺谓妄诈。 之人#2要求财利，不顾在此三者也。 六亲相盗，非但於他。 夫妇、父子、兄弟，六亲也。 言为盗者，非但於他，乃至子盗於父，妇盗於夫二兄弟相盗，无所不为。 杀害众生，利养身口。 杀生治病为养身，宰害供厨为利口也。 如此等辈，见生受业，永坠诸苦。 生不受戒，唯恶是行，恶业增长，则沦三涂。 备加五恶，无有休限。 其有五恶者，则入地狱，备五苦之报，无有休息及年限也。 经云：三涂受报，近者一劫。 如有出者， 言其受对，或有轻重、如有得，竟还生人中者也。 当在边夷，短命伤残。 边夷，俚獠也，其人相食。 此谓杀害之报，受生此地，若生中国，则短命及形体不具。 夫妇丑恶，及不贞廉。 淫报也。 丑谓可憎，恶谓弊恶。 不贞为淫，不康谓贪也。 贫穷冻露，在处不安，如有财畜，为人所夺。 盗报也。 冻露谓居无屋宅，不安谓饥寒不立，纵有财物，则被劫夺，以偿先债也。 言说不信，人所不亲。 妄语报也。 其所言说，是之与非，人皆不信，既无信义，宁得亲友也。 意虑昏塞，众所慢轻。 酒报也。 生既昏浊，死无神明，此之受身，岂得清静，故人所轻慢。 老君曰：清信男，清信女，奉持戒行，见世安乐，无有忧恼。 奉戒持行，所志者道。 众恶既消，长与善会，复何忧恼哉！ 夫忧恼者，由於恶行，故与恶相牵耳，岂有不为而至者邪？ 众所恭敬， 不淫，则为众所敬也。 见者惧喜， 无复杀心，故一切见之，莫不惧喜者也。 常蒙利养， 不盗也。 既无邪取，则人乐给与也。 一切归仰。 不妄语也。 所言铃实，谁不归仰。 其智深微， 不饮酒也。 则思虑安静，入於深微。 处在清静，四大完坚， 既受此五报，行止所在，人所敬爱。 常清静，不杂凡秽，四体也。 外思不加，则内府无伤，表裹坚密，万病不生也。 故能修集众法，以成道真。",
      "translated_text": "Not engaging in sexual misconduct extends even to the absence of impure thoughts. Sexual misconduct arises from indulgence, whether in men or women, their desires are manifold. Among the Five Precepts, none is weightier than this, for it leads to the ruin of body and family—thus, no further discussion is needed. Yet there are those who, unafraid of the net of transgression, use the pretext of the Dao to gratify their lusts, outwardly feigning devotion while inwardly wallowing in impurity. Such persons are truly great evildoers, hence *even to the absence of impure thoughts*. All sexual conduct outside the bond of husband and wife is impure.\n\nNot consuming intoxicants extends even to resisting coercion. Wine leads to transgressions, and though one may be pressed by superiors, it can result in chaos and loss. Now, with the precept as one’s support, even under coercion, one does not violate it. The harm of wine is like fire left unchecked—it grows ever fiercer and does not cease until it burns itself out.\n\nNot speaking falsehood extends even to the absence of leakage. A mind of truth harbors no private malice. Without private malice, there is nothing to conceal. Without concealment, what can leak out? Only thus may one be said to have achieved completion. Earlier, it was said that losing one precept prevents the attainment of destiny—this principle was not yet fully expounded. Now, with this reiteration, the meaning is roughly clear, hence *only thus may one be said to have achieved completion*.\n\nLord Lao said: Within the precepts, sexual misconduct and wine give rise to the Five Evils. Lust leads to extravagance, extravagance to demand, demand to theft, theft to deceit, deceit to fear, and fear to killing—all these stem from lust. Wine incites madness and also fuels lust. The *Taiqing Sutra* states: The human body contains thirty-six thousand worms, all dwelling within the five viscera and the skin. When one drinks wine, these worms stir; when they stir, all manner of evils arise, and with evils arisen, there is nothing one will not do. Thus it is said to give rise to the Five Evils.\n\nPrecepts are for restraining evil. In this degenerate age, men and women, though bound by kinship, fall into incest. *Huān* means mixing; *lí* means violating. It speaks of how the mind of lust knows no bounds of lineage, using the pretext of the Dao to intermingle without distinction.\n\nArrogance toward superiors and violence toward inferiors defile the celestial virtue. Arrogance toward the divine is defilement; mutual harm among the lowly is violence. Drunkenness and brawls lead to lawsuits, bringing calamity, disgrace, and ruin. *Chén* means indulgence; *xù* means daily drunkenness. *Zhēng* means conflict; *sòng* means litigation. Harming life is calamity; ensnaring the body is disgrace.\n\nDeceit and fraud know no bounds. *Wàng* means falsehood; *zhà* means deception; *qī* means trickery. Such persons, in their pursuit of wealth and profit, disregard all three.\n\nTheft among the six relations is not limited to outsiders. Husband and wife, father and son, brothers—these are the six relations. Theft is not only against others; even a son may steal from his father, a wife from her husband, or brothers from one another—nothing is beyond them.\n\nKilling living beings to nourish body and mouth. Killing for medicine is to nourish the body; slaughtering for the kitchen is to profit the mouth. Such persons, seeing life, incur karmic debt and forever sink into suffering. Those who do not receive the precepts in life, who only practice evil, see their evil karma grow and fall into the Three Wretched Realms. Enduring the Five Evils without respite, those who commit the Five Evils enter hell, suffering the full retribution of the Five Torments without end or limit.\n\nThe sutras say: The retribution in the Three Wretched Realms lasts at least one kalpa. If there are those who escape, it speaks of varying degrees of severity—some may eventually return to be born among humans. They will be born among the barbarians of the frontier, short-lived and maimed. The frontier barbarians are savages who devour one another. This is the retribution for killing: if born in such lands, or even in the Central Kingdom, they will be short-lived or physically impaired.\n\nTheir spouses will be ugly and base, unchaste and impure. This is the retribution for lust. *Chǒu* means repulsive; *è* means vile. Unchastity is lust; impurity is greed.\n\nPoverty, exposure to the elements, and constant insecurity—even if they possess wealth, it will be seized by others. This is the retribution for theft. Exposure means having no shelter; insecurity means being unable to escape hunger and cold. Even if they have property, it will be plundered to repay past debts.\n\nTheir words will not be trusted, and no one will befriend them. This is the retribution for falsehood. Whether their words are right or wrong, none will believe them. Without trustworthiness, how can they have friends?\n\nTheir thoughts will be dull and obstructed, and all will disdain and belittle them. This is the retribution for wine. Born in turbidity, they will lack clarity in death. How can such a rebirth be pure? Thus, they are despised by all.\n\nLord Lao said: Devout men and devout women who uphold the precepts and practice the Dao will enjoy peace and happiness in this life, free from sorrow and affliction. Those who uphold the precepts and practice the Way set their minds on the Dao. With all evils dispelled, they abide in goodness forever—what sorrow or affliction could there be? Sorrow and affliction arise from evil deeds, for they are bound to evil. How could they come without cause?\n\nThey will be revered by all. Not engaging in lust, they earn universal respect. All who see them will feel awe and joy. Without the mind of killing, all who encounter them will feel awe and joy. They will constantly receive offerings. Not stealing, people will gladly provide for them. All will look up to them. Not speaking falsehood, their words will always be true—who would not revere them? Their wisdom will be profound and subtle. Not drinking wine, their thoughts will be calm and serene, entering the profound. Abiding in purity, their four elements will be whole and firm. Having received these five rewards, wherever they go, they will be loved and respected. Constantly pure, untainted by the vulgar, their four limbs will be sound. Without external distractions, their internal organs will be unharmed, their exterior and interior firm and unbreachable, and no illness will arise. Thus, they will be able to cultivate and gather all dharmas to attain the true Dao.",
      "overlap_context": "l begin with petty theft; if petty theft goes unchecked, it leads to grand larceny. One may exploit public benefit for private gain, manipulate the law to seize property, rely on power and influence to enclose mountains and marshes, or deceive and coerce the foolish to exploit their labor. Whatever is obtained in such ways is not by right principle—it is the same as stealing. Hence, *even to the absence of illicit gain*. This makes clear that it is not only outright theft but all forms of greed.",
      "start_char": 4997,
      "end_char": 6358,
      "start_sentence": 294,
      "end_sentence": 380,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.32214593887329,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\太上老君戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "前明无戒，恶缘果报。 此明奉法，见世受福，乃至成道，莫不由之。 又明为道叉修集众善乃得成真，故以法明道，以真明人者也。 尹喜再拜日：敢问受持之法？ 受，当为授。 戒法既备，次问授持之仪也。 更起谘端，故再拜而请。 老君曰：若男子女人闻法，生信归身三宝， 此直云男子女人者，总谓始发心也。 法谓戒法也。 三宝亦日三尊，亦曰三师，谓太上之法，太上之法传太上之法，是为三也。 故太上为万法之主，传法者为众学之师，老君即此法之师，余法各随所出。 即时稽颗， 言有欲发心者，即时授与，不待依违，辩其由来。 所以者何？ 戒本去恶，但令有心，何论往行。 且人心多惑，自有善机暂起，回复退悔，故承机而奖，不待终日也。 归身大道，归神大道，归命大道。 此三归者，谓身有善恶，神有恐怖，命有寿夭，盖一切众生之叉有也。 今以此三悉归於道者，谓受行法戒，一则生死常善，不堕恶缘； 二则神明强正，不畏邪魔； 三则见世长寿，不遭横夭。 归虽有三，其实一也。 向言归身三宝是法，此言大道是常，即前颂云玄虚之道。 男子女人， 称姓名以告誓。 舍世邪法， 拾，犹离。 凡世问所为，悉是邪法。 奉持正戒， 如手持物，恒畏遗失。 尽身尽命，终不毁犯。 身，语其行。 命，言其识。 故尽犯二边而不毁慢及亏犯也。 於是赞诵，恭心而受。 赞诵五戒之事也，谓受之身。 三归既竟於三宝前，稽颗自誓，一一受解，然后授之。 恭心者，如对神也。 老君日； 若复男子女人受正戒已，进求经法， 谓五千文者也。 先当受戒， 向言受戒已是受经之时，今复云先当受戒。 前是受经之时，更复说戒，若经戒具受，故宜先受戒。 一一坚净，然后授与。 辩核已持戒者，若有漏失，许其自新，明知所以更授者也。 旦暮恭心，不息时节， 朝夕礼事，虽复饥寒，亦不阙废，此是奉经之法也。 月修十直， 月有十斋日也。 年用三斋， 一年用三月长斋也。 诵经万遍，白日登晨。 暗读曰诵。 晨者，真仙之域也。 用此斋直，诵经万过，则获飞仙。 《西升经》云：罗缕妙言，内意不出，诵文万过，精诚思彻。 此之义也。 十直三斋，别自有经也。 若为人敷说宣通妙义，大利众生，乃拔三涂一切诸苦。 敷扬讲说，开导未悟，则功德广济，三涂救拔也。 以是功德，能断宿命，无量诸根，得升上清，无复退堕。 功圆德备，则生死根灭，上清之道，无复退转。 此略明学道之所至也。 始自持戒，终於无为，举大法之始终者也。 老君曰：清信男，清信女，在家出家，受持经法，愿乐神仙，日夜诵读，求诸妙义。 谓无为至理也。 去诸谊杂，调心制性。",
      "translated_text": "Those prior teachings expounded the karmic retribution of evil conditions arising from the absence of precepts. Here, the observance of the Dharma is shown to bring blessings in this very life, even unto the attainment of the Dao—none of this is possible without it. Furthermore, it is made clear that to walk the Way, one must cultivate and gather all virtues to realize the true. Thus, the Dao is elucidated through the Dharma, and the true is made manifest through the person.\n\nYin Xi bowed twice and said: \"I venture to ask about the method of receiving and upholding the precepts?\"\n*(Note: \"Receiving\" here should be understood as \"transmitting.\")*\nNow that the precepts are fully expounded, the next inquiry concerns the rites of transmission and upholding. Having raised this new question, he bowed again to make his request.\n\nLord Lao said: When men and women hear the Dharma and generate faith, they take refuge in the Three Treasures.\n*(This refers generally to those who first arouse the aspiration.)*\nThe Dharma here means the precepts. The Three Treasures are also called the Three Honored Ones or the Three Masters: the Dharma of the Most High, the transmission of the Dharma of the Most High, and the lineage of that transmission—these are the Three. Thus, the Most High is the lord of all dharmas, the transmitter of the Dharma is the teacher of all learners, and Lord Lao is the master of this Dharma, while other teachings follow their respective origins.\n\nThey should immediately bow their heads in reverence.\n*(Those who wish to arouse the aspiration should be transmitted the precepts at once, without hesitation or inquiry into their past conduct.)*\nWhy is this so?\nThe precepts are fundamentally for the removal of evil; as long as one has the aspiration, what need is there to discuss past actions? Moreover, the human mind is often deluded—though a good impulse may arise momentarily, it may soon waver and retreat. Therefore, one should seize the moment to encourage, not waiting until the day’s end.\n\nThey take refuge in the Great Dao with their bodies, take refuge in the Great Dao with their spirits, and take refuge in the Great Dao with their lives.\nThis threefold refuge addresses the fact that the body may be good or evil, the spirit may know fear, and life may be long or short—these are the three necessities for all sentient beings. Now, by taking refuge in the Dao with all three, one who receives and practices the precepts will: first, ensure that in life and death, they remain constantly good and do not fall into evil conditions; second, strengthen and rectify their spirit so that they need not fear demonic influences; and third, enjoy longevity in this life without suffering untimely death. Though the refuges are three, in essence, they are one. The earlier reference to taking refuge in the Three Treasures pertains to the Dharma, while this reference to the Great Dao denotes the eternal—what was previously praised as the mysterious and empty Dao.\n\nThe men and women\ndeclare their names and make their vows.\nThey abandon the perverse ways of the world,\n*(Abandon means to leave behind. All worldly pursuits are perverse ways.)*\nand uphold the true precepts,\n*(Like holding an object in hand, ever fearful of losing it.)*\nresolving to keep them with their bodies and lives, never violating or transgressing them.\n*(The body refers to conduct; life refers to consciousness. Thus, they resolve never to transgress or diminish the precepts in either aspect.)*\nThereupon, they praise and recite, receiving with reverent hearts.\n*(This refers to the recitation of the Five Precepts. The transmission is received in person: after completing the Three Refuges before the Three Treasures, bowing their heads, they make their vows, receive explanations of each precept, and are then transmitted the precepts. A reverent heart means treating the occasion as if in the presence of the divine.)*\n\nLord Lao said: If men and women, having received the true precepts, further seek the scriptures,\n*(This refers to the Five Thousand Character Text.)*\nthey should first receive the precepts.\n*(Earlier, it was said that after receiving the precepts, one may receive the scriptures; now it is said that one should first receive the precepts. The former refers to the time of receiving the scriptures, when the precepts are again expounded. If both scriptures and precepts are to be received, the precepts should come first.)*\nOnly after ensuring their steadfast purity should the scriptures be transmitted.\n*(This examines whether the recipient has upheld the precepts; if there have been lapses, they are permitted to renew themselves, making clear the reason for re-transmission.)*\nThey should reverently uphold them day and night, without ceasing at any time.\n*(Morning and evening rituals must not be neglected, even in hunger or cold—this is the way to uphold the scriptures.)*\nEach month, they observe the ten days of uprightness;\n*(The month has ten fast days.)*\neach year, they observe the three months of fasting.\n*(One year includes three months of prolonged fasting.)*\nAfter reciting the scriptures ten thousand times, they ascend in broad daylight to the morning realm.\n*(Reciting aloud is called \"recitation.\" The morning realm is the domain of true immortals. Through these fasts and recitations, one attains the flight of immortality. The *Scripture of Western Ascension* states: \"With meticulous and wondrous words, the inner meaning does not depart; recite the text ten thousand times, and with sincere thought, penetrate it thoroughly.\" This is the meaning.)*\nThe ten days of uprightness and three months of fasting have their own separate scriptures.\n\nIf one expounds and disseminates the scriptures, propagating their wondrous meanings, this brings great benefit to sentient beings, delivering them from the three evil destinies and all suffering.\n*(To expound and lecture, guiding those who have not yet awakened, is to widely bestow merit and deliverance, rescuing beings from the three evil destinies.)*\nThrough such merit and virtue, one severs the roots of past karma, eradicates immeasurable afflictions, and ascends to the Upper Clarity, never to regress.\n*(When merit is complete and virtue perfected, the roots of birth and death are extinguished, and the Dao of the Upper Clarity is attained without regression.)*\nThis briefly outlines the culmination of the path of cultivation—from upholding the precepts to the attainment of non-action, encompassing the great Dharma from beginning to end.\n\nLord Lao said: Devout men and devout women, whether householders or renunciates, who receive and uphold the scriptures, aspire to the divine immortals, recite day and night, and seek their wondrous meanings—\n*(This refers to the principle of non-action.)*\nthey cast aside all defilements and distractions, harmonizing the mind and mastering the nature.",
      "overlap_context": "be calm and serene, entering the profound. Abiding in purity, their four elements will be whole and firm. Having received these five rewards, wherever they go, they will be loved and respected. Constantly pure, untainted by the vulgar, their four limbs will be sound. Without external distractions, their internal organs will be unharmed, their exterior and interior firm and unbreachable, and no illness will arise. Thus, they will be able to cultivate and gather all dharmas to attain the true Dao.",
      "start_char": 6359,
      "end_char": 7462,
      "start_sentence": 381,
      "end_sentence": 449,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.698363065719604,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\太上老君戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "谓即世学也。 夫上士学道在市朝，下士远处山林。 山林者，谓垢秽尚多，未能即谊为静，故远避人世，以自调伏耳。 若即世而调伏者，则无待於山林者也。 柔颜善气，劝诸男女， 心粗则貌强，意犷则言恶。 若和颜软语，则见者亲爱，不生忿心也。 远离五恶，受持五戒，供养三宝。 既知至妙之理，又能分别善恶，则以我所得为敷说，劝令拾离诸恶缘也。 取令成就，不择甘苦。 识有利钝，性有善恶，曲己顺彼，取令入道，不为身利，不辞屈辱，此为教也。 若具持大戒，苦行精葱，布施忍辱，舍身救物， 谓修行者也。 大戒为百八十、太清．等戒。 若四明科禁，众仙大忌，皆是学真之具法也。 精进恋谓匪懈布施，几来求无不给与，不吝财贿，不问有无。 忍辱谓受辱不言，乃至打马亦无啧恨。 拾谓见诸危难次往救，不顾身命，若见冻饿，剔身给与，不待有求，是为拾也。 若复离世独往幽柄，专想至寂，众难不惊， 谓耽神者也。 离世山柄，以避谊浊，独往无群，无复他念。 专谓志一。 想谓思神至之者也。 寂谓定也，此专定心，智定内安，非复外难荣辱所惊也。 必至无为。 言修此等行，铃果无为之真也。",
      "translated_text": "This refers to worldly learning.\n\nThe superior person practices the Dao amidst the marketplace, while the inferior person retreats to the mountains and forests. Mountains and forests signify that impurities still abound, and one cannot yet immediately harmonize with stillness, thus withdrawing from the world to cultivate and subdue the self. Yet if one can cultivate and subdue the self within the world, there is no need to rely on mountains and forests.\n\nWith a gentle countenance and kind demeanor, one exhorts all men and women: when the mind is coarse, the appearance becomes harsh; when the intent is wild, the speech turns foul. But with a harmonious expression and soft words, those who see will feel affection and no anger will arise.\n\nDistance yourself from the five evils, uphold the five precepts, and make offerings to the Three Treasures. Having grasped the most wondrous principle and discerned good from evil, one expounds what one has attained, urging others to abandon all evil conditions.\n\nStrive for their accomplishment without regard for ease or hardship. Recognize differences in capacity—some are sharp, some dull; some natures are good, some evil—yet adapt to others, guiding them into the Dao. Do not seek personal gain, nor shrink from humiliation: this is teaching.\n\nThose who fully uphold the great precepts, engage in ascetic practice with purity, practice generosity and forbearance, and sacrifice themselves to save others—these are the practitioners of cultivation. The great precepts comprise the one hundred and eighty precepts, the Taiqing precepts, and others. The Fourfold Bright Prohibitions and the great taboos of the immortals are all essential methods for those who study the Real.\n\nDiligence means unwavering generosity: whatever is sought, one gives without refusal, sparing neither wealth nor goods, regardless of abundance or lack. Forbearance means enduring insult without complaint—even when beaten or whipped, one harbors no resentment. Sacrifice means rushing to aid those in peril without regard for one’s own life; if one sees the cold and hungry, one strips oneself to provide, not waiting to be asked.\n\nThose who leave the world to dwell in secluded abodes, focusing the mind on ultimate stillness, undisturbed by any hardship—these are the devotees of the spirit. Leaving the world to dwell in mountain seclusion avoids the filth of the mundane; solitary wandering without companionship leaves no room for other thoughts. \"Focused\" means unifying the will; \"mind\" means contemplating the attainment of the spirit. \"Stillness\" means concentration: with the mind settled in concentration, wisdom stabilizes within, and no external hardship or honor can disturb it.\n\nSuch practice necessarily culminates in non-action. To cultivate these deeds is to assuredly realize the truth of non-action.",
      "overlap_context": "ation of the path of cultivation—from upholding the precepts to the attainment of non-action, encompassing the great Dharma from beginning to end.\n\nLord Lao said: Devout men and devout women, whether householders or renunciates, who receive and uphold the scriptures, aspire to the divine immortals, recite day and night, and seek their wondrous meanings—\n*(This refers to the principle of non-action.)*\nthey cast aside all defilements and distractions, harmonizing the mind and mastering the nature.",
      "start_char": 7463,
      "end_char": 7943,
      "start_sentence": 450,
      "end_sentence": 475,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.747515439987183,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\太上老君戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "尹喜曰：奉经有犯乎？ 持戒善恶既备於前，夫知奉经凌犯罪失。 云何？ 此总问众经非止五千也。 前颂云悉归太上经，此后又明破法及授受之难，推此故知也。 斯乃尹喜相资发，故令出罪福之事耳。 老子曰：十有三者也。 经云：生之徒十有三，死之徒十有三。 言奉经顺法，则获长生； 违戒犯恶，则动之死地。 既答所问罪失，故直云十三也。 尹喜曰：何谓也？ 问十三之事也。 老子曰：尔谛听之。 既更有所明，故复戒。 十有三者，六尘六识，皆由於心。 六尘，谓六入也。 以其所入能秽染正性，故言尘也。 六识，即六入之根，能起分别，故云识也。 心为其主，是为十三，下卷具解。 凡致恶之由，因十三起，入善之由，因十三灭。 入善为生，为恶而死。 死生之谓，非止此身也。 谓修善不已，以至成道，成道之日，岂得非生？ 故经云出也。 为恶不息，遂沦地狱，岂非死乎？ 故经云入也。 是故淫贪疾志， 淫之所起，由於色取，故在十三之端。 夫淫叉有贪，而贪者不叉皆淫。 然贪之为病，非但在於富贵，乃至贪名贪世。 不欲人在己先病者，妬嫉也，嫉彼而胜我也。 恚谓真恚也。 贪嫉既起，嗔恚自生者也。 欺盗妄诈， 违戒取物，是为欺盗，谓欺心者也。 自诡要时，是为妄诈，是用权数苟得者也，所谓民之贼矣。 绮言两舌， 辞非而泽，谓之绮言。 反覆是非，是为两舌。 皆绿欺诈而有。 谄利持权， 口忌灾祟，明言祸福，卑辞高物，以要利人，是为诸也。 凭恃时威，自我制物，是为权也。 夫謟之甚者，乃至祈神祭鬼，以求曲佑也。 溷集破法， 男女无别为溷。 破法者，谓有此等事也。 始则食淫，终於混集，并皆相因而至之也。 非清信也。 如此皆之死地，尚非清信，况复奉经者乎！ 天网不失， 引经明事也。 夫天网虽疏，报对之理，铃无遗失也。 生死无地， 生谓见报，死谓考对，无地可逃也。 答所间十三毕，此以下乃明罪报也。 如此等人，非其智分。 由无智识起诸罪业，故於法无分也。 染垮至法，毁废善根。 法法相传，如树有栽，生长不绝，是为善根。 如此恶行，日相深渍，善根岂得不废？ 不为善人，之所知识。 所行既恶，则恶恶相知，愚下之类自多党。 善人，谓才识高明德胜者也。 备众生身。 皆由前绿，无有慧业，故令今生，得此愚痴。 夫言愚痴者，谓造诸恶业也，非谓无所解矣。 生既无善，死堕三涂，受众生身。 众生万等，各随绿报而备得其身者。 种於侄欲，无所憎避。 众生所以繁多，由其种类娌欲故也。 谓因法行侄而受此报，犹鸡犬等在於人中无所避就，得类便为，亦无憎爱，皆由前业之所行者也。 常怀怖畏。 因往贵取之报也。 饿鬼之中，复有万品，虽云是饿，有时得足。 此言无足者，便是未尝堑饱也。 若在地狱，五痛无间。 地狱受苦，有时而息。 此言无间，是时无休息也。 五痛犹五苦也，明三涂报应如此。 如此受身，备诸苦恶。 三涂报尽，出生人中，则形体不具，备诸残疾，或疮痒疥癞，可恶之极者也。 物所怀恶， 非但於人，乃至畜生，亦有憎恶。",
      "translated_text": "Lord Guan Yin asked: \"Does upholding the scriptures entail transgressions?\"\n\nSince the precepts on good and evil have already been expounded, one who knows the scriptures yet violates them incurs fault and loss. How so? This is a general inquiry into all scriptures, not limited to the Five Thousand Characters. As the earlier verse states, \"All归 to the Supreme Scripture,\" and what follows clarifies the destruction of the Dharma and the difficulty of transmission and reception—thus we know this to be the case. This exchange between Lord Guan Yin and Laozi serves to elucidate matters of sin and merit.\n\nLaozi replied: \"There are thirteen.\"\n\nThe scripture states: \"Of those who follow life, there are thirteen; of those who follow death, there are thirteen.\" To uphold the scriptures and follow the Dharma is to attain long life; to violate the precepts and commit evil is to move toward death. Having answered the question regarding faults and losses, he thus speaks directly of the thirteen.\n\nLord Guan Yin asked: \"What does this mean?\"\n\nHe inquired about the matter of the thirteen.\n\nLaozi said: \"Listen carefully.\"\n\nSince there is further clarification, he admonishes again: The thirteen are the six dusts and six consciousnesses, all arising from the mind. The six dusts refer to the six entrances, for what enters can defile the true nature—hence they are called dusts. The six consciousnesses are the roots of the six entrances, capable of generating discrimination—hence they are called consciousnesses. The mind is their master, making thirteen in total; the lower scroll provides a full explanation. All causes of evil arise from the thirteen, and the path to goodness arises from their cessation. Entering goodness is life; committing evil is death. This life and death are not limited to this body. To cultivate goodness without cease is to attain the Dao; on the day the Dao is attained, how can this not be life? Thus the scripture says \"emerge.\" To commit evil without respite is to sink into hell—how can this not be death? Thus the scripture says \"enter.\"\n\nTherefore, lust, greed, and envious wrath—\nLust arises from the pursuit of form, hence it stands at the forefront of the thirteen. Lust may involve greed, but not all greed involves lust. Yet greed as a flaw is not limited to wealth and status; it extends to craving fame and worldly success. To resent others surpassing oneself is jealousy; to desire their superiority is envy. Wrath refers to true anger. When greed and envy arise, wrath naturally follows.\n\nDeceit, theft, falsehood, and fraud—\nTo take things in violation of the precepts is deceit and theft, meaning to deceive the mind. To feign promises for a time is falsehood and fraud, employing cunning to gain advantage—what is called the bane of the people.\n\nFlattering speech and double-tongued words—\nWords that are false yet embellished are flattering speech. To reverse right and wrong is double-tongued speech. Both arise from deceit and fraud.\n\nFlattery for profit and clinging to power—\nTo speak of calamities and omens, proclaiming fortune and misfortune, using humble words to extol others for personal gain—this is flattery. To rely on temporal authority to control others—this is clinging to power. The most extreme flattery extends to praying to spirits and sacrificing to ghosts to seek unjust protection.\n\nDefilement and destruction of the Dharma—\nThe mixing of men and women without distinction is defilement. Destruction of the Dharma refers to the presence of such acts. Initially indulging in lust, it culminates in defilement—all arising sequentially. Such is not the conduct of the pure and faithful. Those who act thus hasten to the realm of death; if even the pure and faithful do not behave so, how much less should those who uphold the scriptures!\n\nThe net of Heaven does not fail—\nThis cites the scripture to clarify the matter. Though the net of Heaven is vast, the principle of karmic retribution never misses.\n\nLife and death leave no refuge—\n\"Life\" refers to witnessing retribution; \"death\" refers to facing judgment—there is no place to escape.\n\nHaving answered the question regarding the thirteen, what follows clarifies karmic retribution. Such people lack the capacity for wisdom. From ignorance arise all karmic offenses, thus they have no share in the Dharma. Defilement corrodes the Dharma, destroying good roots. The transmission of the Dharma is like a tree with roots—growth is unceasing; this is the good root. With such evil conduct, daily deepening defilement, how can the good root not be destroyed?\n\nThey are not known by those who do good.\nTheir conduct being evil, they associate with the wicked; the foolish and base naturally form their company. The good refer to those of superior talent, wisdom, and virtue.\n\nThey assume the bodies of sentient beings.\nAll this stems from past causes, lacking in wisdom and merit, thus in this life they are born foolish and dull. \"Foolish and dull\" refers to committing all manner of evil deeds, not to a lack of understanding.\n\nHaving no goodness in life, they fall into the three evil paths at death, assuming the bodies of sentient beings. Sentient beings are of myriad kinds, each receiving a body according to karmic retribution.\n\nThey sow the seeds of lust, with no aversion or avoidance.\nThe multitude of sentient beings arises from the propagation of lust. This refers to receiving such retribution due to past karmic actions—like chickens and dogs among humans, with no avoidance or preference, acting according to their kind, without hatred or love, all determined by past karma.\n\nThey are constantly filled with fear and dread.\nThis is the retribution for past greed and grasping. Among hungry ghosts, there are myriad types; though called hungry, some may occasionally be sated. Here, \"unsated\" means never having experienced fullness. In hell, the five pains are unceasing. Those in hell suffer torment with intervals of respite; \"unceasing\" means no rest at all. The five pains are the five sufferings—thus is the retribution of the three evil paths.\n\nAssuming such bodies, they endure all manner of suffering and evil.\nWhen the retribution of the three paths is exhausted, they are born among humans, yet their forms are incomplete, bearing all manner of disabilities—festering sores, scabies, leprosy, and the most repulsive afflictions.\n\nThey are despised by all beings—\nNot only by humans, but even among animals, they are met with hatred and aversion.",
      "overlap_context": "l in mountain seclusion avoids the filth of the mundane; solitary wandering without companionship leaves no room for other thoughts. \"Focused\" means unifying the will; \"mind\" means contemplating the attainment of the spirit. \"Stillness\" means concentration: with the mind settled in concentration, wisdom stabilizes within, and no external hardship or honor can disturb it.\n\nSuch practice necessarily culminates in non-action. To cultivate these deeds is to assuredly realize the truth of non-action.",
      "start_char": 7944,
      "end_char": 9208,
      "start_sentence": 476,
      "end_sentence": 560,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.037458658218384,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\太上老君戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "无有救治， 疾既可恶，则人无治者，此是秽慢浮法之报应也。 生死输转，无闻无见， 无闻，谓不信法教。 无见，谓不值善绿。 此总明十三，破法之罪，生死所之也。 皆由一念中生至无数念，其对无穷。 夫为恶者始起。 原缺文 太上老君戒经竟 ＃１『洞』字上疑脱一『空』字。 ＃２『之人』前疑有脱漏。",
      "translated_text": "Unattended and untended,\ntheir afflictions so repulsive that none would heal them—\nthis is the retribution of defilement, arrogance, and frivolous dharma.\n\nIn the cycle of birth and death, they remain unhearing and unseeing:\n*unhearing* means they do not believe in the teachings;\n*unseeing* means they do not encounter good conditions.\nThis broadly clarifies the thirteen transgressions against the dharma—\nthe destinies of birth and death.\n\nAll arise from a single thought, multiplying into countless thoughts,\ntheir consequences boundless.\nFor those who do evil, it begins with the first impulse.\n\n[Text incomplete]\n\n*Tai Shang Lao Jun Jie Jing* concludes.\n\n#1 Before the character *dòng* (洞), the character *kōng* (空) may be missing.\n#2 Before *zhī rén* (之人), text may be missing.",
      "overlap_context": "t all. The five pains are the five sufferings—thus is the retribution of the three evil paths.\n\nAssuming such bodies, they endure all manner of suffering and evil.\nWhen the retribution of the three paths is exhausted, they are born among humans, yet their forms are incomplete, bearing all manner of disabilities—festering sores, scabies, leprosy, and the most repulsive afflictions.\n\nThey are despised by all beings—\nNot only by humans, but even among animals, they are met with hatred and aversion.",
      "start_char": 9209,
      "end_char": 9367,
      "start_sentence": 561,
      "end_sentence": 572,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.998795509338379,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\太上老君戒经.txt",
        "category": "戒律类"
      }
    }
  ]
}