{
  "source_id": "太上消灭地狱升陟天堂忏",
  "source_file": "chunked_daozang\\太上消灭地狱升陟天堂忏.json",
  "total_chunks": 5,
  "total_original_chars": 4285,
  "total_translated_chars": 27064,
  "total_translation_time": 126.67249345779419,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上消灭地狱升陟天堂忏.txt",
    "category": "威仪类"
  },
  "full_translation": "**The Supreme Petition for the Elimination of Hell and Ascension to Heaven**\n\n**Title:** *The Supreme Petition for the Elimination of Hell and Ascension to Heaven*\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, Dongxuan Section, *Weiyi* (Ritual Propriety) Category\n\nWith solemn dignity and reverent devotion,\nWe focus our minds in worship, reciting and upholding the secret jade scrolls, the profound and subtle treasures of the mystic vault.\n\nMay the grace of Heaven universally deliver,\nMay the hells all open wide,\nMay the sun of wisdom shine upon them,\nMay the light of compassion gather and receive them.\n\nWith focused minds we worship, reciting and upholding the sacred texts of the Three Treasures, the holy standards of the Nine Purities.\n\nMay great beneficence and salvation extend,\nPervading the dark and hidden realms,\nDelivering beings to the Southern Palace,\nTransforming and rebirthing them in the Northern Mansion.\n\nWith focused minds we worship, reciting and upholding the true teachings of the Ten Caves, the celestial hymns of the myriad heavens.\n\nMay divine compassion rescue and uplift,\nMay the mysterious transformation spread far and wide,\nWherever the paths of darkness lie,\nMay all receive extraordinary blessings.\n\nNow, as we prepare to perform the jade register rites,\nFulfilling the golden precepts,\nThe Most Sacred opens the way,\nThe host of perfected beings ascends in their chariots.\n\nThus, the Nine Dark Realms converge,\nThe Five Sufferings all heed,\nWe turn and offer, praising in accordance with the Dharma.\n\nAt that time, the Most High Lord of the Primordial Beginning,\nResiding in the wondrous realm of the Nine Purities, within the Three Primordials’ Jeweled Palace,\nSeated upon the Kalpa-Blade Terrace amid the Qianmu Grove,\nTogether with the Most High Lord of the Dao, the Most High Lord Lao,\nThe host of celestial sages, the honored deities of the Three Realms,\nThe officials of the Nine Bureaus and Three Offices,\nThe Four Directors and Five Emperors,\nThe Inspecting Destiny Youths, the Perfected of Wondrous Conduct,\nAll arrived at once,\nRiding eightfold jade chariots, five-colored jasper carriages,\nUnicorns and feathered steeds,\nPhoenix canopies and dragon banners,\nChanting the cave scriptures, praising the jeweled throne.\n\nThereupon, the Most High Lord of the Primordial Beginning,\nMoved by great compassion,\nEmitted rays of light,\nIlluminating the Nine Dark Hells of the Underworld,\nOpening all the nether bureaus and the Fengdu courts.\n\nThe assembly exclaimed:\n“By what cause today,\nAfter eons of longing,\nDwelling in eternal darkness,\nDo we now receive this illumination?”\n\nThe Most High Lord of the Primordial Beginning commanded:\nThe Great Emperor of the Northern Capital,\nThe Judging Officials of the Five Emperors,\nThe clerks of the Six Palaces,\nOx-Headed Ghost Soldiers,\nTiger-Eyed Divine Kings,\nThe great demons of the Three Realms,\nThe multitude of souls in the Nine Dark Realms—\nAll the Six Palaces,\nThe Nine Bureaus recording life and death,\nThe twelve river sources,\nThe twenty-four prisons,\nThe Southern Water Assembly Palace,\nThe Northern Sea’s Eternal Night Court—\nAll received the great compassion of Heaven,\nThe sacred path was widely opened,\nThe wondrous precepts of the Nine Perfected were expounded,\nTo aid the dark paths of the Five Destinies.\n\nSincere devotion, once kindled in the flames of practice,\nWill surely manifest in profound response.\nRelying on the transformation of the Mysterious Origin,\nWe attain the gate of deliverance.\nWe bow our heads in reverence, devoutly repenting.\n\nIn the East are those sinners,\nConfined in the prisons of wind and thunder, the dungeons of lightning.\nSword trees and blade mountains,\nFlying spears and drifting halberds,\nPiercing the five viscera,\nDismembering the four limbs.\nEver bound in the prisons,\nUnceasing day and night.\nWe now offer aid,\nWishing them rebirth.\nWith focused minds we take refuge in the Heavenly Worthy of the Pure Capital, who expounds the teachings.\nWith focused minds we take refuge in the Heavenly Worthy of the Purple Palace, who bestows compassion.\nWith focused minds we take refuge in the Heavenly Worthy who opens deliverance through Heaven and Earth.\nWith focused minds we take refuge in the Heavenly Worthy illumined by sun and moon.\nWith focused minds we take refuge in the Heavenly Worthy of the Lofty and Sacred Vessel.\nWith focused minds we take refuge in the Heavenly Worthy of vast and mysterious merit.\nWith focused minds we take refuge in the Heavenly Worthy of the turning wheel, who is self-soverign.\nWith focused minds we take refuge in the Heavenly Worthy who undergoes refinement and rebirth.\nWith focused minds we take refuge in the Heavenly Worthy who transcends to the highest realms.\nWith focused minds we take refuge in the Heavenly Worthy who roams the Great Void.\nWe bow our heads in reverence, devoutly repenting.\n\nIn the South are those sinners,\nConfined in the prisons of blazing wheels, the dungeons of debt mountains.\nFierce flames scorch their heads,\nRaging fires burn their faces,\nBones reduced to ash,\nSkin and flesh seared.\nEver bound in the prisons,\nUnceasing day and night.\nWe now offer aid,\nWishing them rebirth.\nWith focused minds we take refuge in the Heavenly Worthy of the Mysterious Vault, who bestows transformation.\nWith focused minds we take refuge in the Heavenly Worthy of utmost sageliness, who extends grace.\nWith focused minds we take refuge in the Heavenly Worthy of compassion for the Five Sufferings.\nWith focused minds we take refuge in the Heavenly Worthy who pities the Three Paths.\nWith focused minds we take refuge in the Heavenly Worthy who dissolves grievances and ends disputes.\nWith focused minds we take refuge in the Heavenly Worthy who delivers stagnant souls to rebirth.\nWith focused minds we take refuge in the Heavenly Worthy who eliminates evil destinies.\nWith focused minds we take refuge in the Heavenly Worthy who aids good affinities.\nWith focused minds we take refuge in the Heavenly Worthy who ascends to the Jeweled Grotto.\nWith focused minds we take refuge in the Heavenly Worthy who soars to the Vermilion Mound.\nWe bow our heads in reverence, devoutly repenting.\n\nIn the West are those sinners,\nConfined in the prisons of vajra, the dungeons of iron enclosures.\nGolden hammers pierce their hearts,\nIron rods penetrate their bellies,\nFlesh and bones rot away,\nLimbs and joints separate.\nEver bound in the prisons,\nUnceasing day and night.\nWe now offer aid,\nWishing them rebirth.\nWith focused minds we take refuge in the Heavenly Worthy who universally receives the sun of wisdom.\nWith focused minds we take refuge in the Heavenly Worthy of universal deliverance through the true wind.\nWith focused minds we take refuge in the Heavenly Worthy of mysterious compassion and salvation.\nWith focused minds we take refuge in the Heavenly Worthy of sacred power who opens the way.\nWith focused minds we take refuge in the Heavenly Worthy who absolves transgressions.\nWith focused minds we take refuge in the Heavenly Worthy who repents and delivers the submerged.\nWith focused minds we take refuge in the Heavenly Worthy who transforms the traces of the Five Paths.\nWith focused minds we take refuge in the Heavenly Worthy who turns the wheel tenfold to restore the numinous.\nWith focused minds we take refuge in the Heavenly Worthy who responds and transforms wherever present.\nWith focused minds we take refuge in the Heavenly Worthy who generates immortals in every place.\nWe bow our heads in reverence, devoutly repenting.\n\nIn the North are those sinners,\nConfined in the prisons of icy depths, the dungeons of sinking.\nFrigid mounds and frozen pools,\nSnow spears and frost blades,\nRotten corpses shattered,\nPoisonous juices poured over them.\nEver bound in the prisons,\nUnceasing day and night.\nWe now offer aid,\nWishing them rebirth.\nWith focused minds we take refuge in the Heavenly Worthy of inexhaustible Dao-power.\nWith focused minds we take refuge in the Heavenly Worthy of boundless mysterious penetration.\nWith focused minds we take refuge in the Heavenly Worthy who eliminates karmic offenses.\n\nWith focused minds we take refuge in the Heavenly Worthy who redeems the sunken.\nWith focused minds we take refuge in the Heavenly Worthy who breaks the blades of the Knife Mountain.\nWith focused minds we take refuge in the Heavenly Worthy who shatters the points of the Sword Trees.\nWith focused minds we take refuge in the Heavenly Worthy who swiftly traverses the Five Gates.\nWith focused minds we take refuge in the Heavenly Worthy who transcends the Eight Portals.\nWith focused minds we take refuge in the Heavenly Worthy who transforms and gives birth in the Purple Ultimate.\nWith focused minds we take refuge in the Heavenly Worthy of the Serene Azure Vault.\nWe bow our heads in reverence, devoutly repenting.\n\nIn the Northeast are those sinners,\nConfined in the prisons of boiling cauldrons, the dungeons of furnace coals.\nTheir four limbs boiled to dissolution, their six viscera seared apart,\nSinews and bones putrid and foul, pus and blood melting away.\nEver bound in the prisons,\nUnceasing day and night.\nWe now offer aid,\nWishing them rebirth.\nWith focused minds we take refuge in the Heavenly Worthy who severs obstacles.\nWith focused minds we take refuge in the Heavenly Worthy who extinguishes enmity.\nWith focused minds we take refuge in the Heavenly Worthy who stills the flames of the Smoke Prison.\nWith focused minds we take refuge in the Heavenly Worthy who dims the fires of the Fire Prison.\nWith focused minds we take refuge in the Heavenly Worthy who restores the scattered bones to deliverance.\nWith focused minds we take refuge in the Heavenly Worthy who refines the substance to receive rebirth.\nWith focused minds we take refuge in the Heavenly Worthy who enables all to ascend the Sea of Blessings.\nWith focused minds we take refuge in the Heavenly Worthy who broadly spreads the Dharma Bridge.\nWith focused minds we take refuge in the Heavenly Worthy whose spirits ascend to the Gardens of Lang.\nWith focused minds we take refuge in the Heavenly Worthy whose souls ascend to the Brahma Heavens.\nWe bow our heads in reverence, devoutly repenting.\n\nIn the Southeast are those sinners,\nConfined in the prisons of copper pillars, the dungeons of iron beds.\nEmbracing with hands and climbing with feet, their bellies scorched and backs seared,\nPus and blood oozing, smoke and fire burning.\nEver bound in the prisons,\nUnceasing day and night.\nWe now offer aid,\nWishing them rebirth.\nWith focused minds we take refuge in the Heavenly Worthy whose sagely transformation descends from above.\nWith focused minds we take refuge in the Heavenly Worthy of vast deliverance and great compassion.\nWith focused minds we take refuge in the Heavenly Worthy of the Great Mystery who revives the dead.\nWith focused minds we take refuge in the Heavenly Worthy of the Sacred Register who gives life to the spirits.\nWith focused minds we take refuge in the Heavenly Worthy who can absolve the karmic path.\nWith focused minds we take refuge in the Heavenly Worthy who enables escape from the Wheel of Suffering.\nWith focused minds we take refuge in the Heavenly Worthy who ascends the Sea of Desire.\nWith focused minds we take refuge in the Heavenly Worthy who transcends the River of Attachment.\nWith focused minds we take refuge in the Heavenly Worthy of the Carefree True Realm.\nWith focused minds we take refuge in the Heavenly Worthy who soars to the Immortal Palaces.\nWe bow our heads in reverence, devoutly repenting.\n\nIn the Southwest are those sinners,\nConfined in the prisons of butchery, the dungeons of inverted suspension.\nTheir five viscera and skin, their four limbs and sinews,\nPierced by knives at every hand, blood flowing across the ground.\nEver bound in the prisons,\nUnceasing day and night.\nWe now offer aid,\nWishing them rebirth.\nWith focused minds we take refuge in the Heavenly Worthy whose grace descends from Heaven.\nWith focused minds we take refuge in the Heavenly Worthy who enables ascent to higher rebirth.\nWith focused minds we take refuge in the Heavenly Worthy who universally bestows the Dharma Rain.\nWith focused minds we take refuge in the Heavenly Worthy who densely spreads the Clouds of Compassion.\nWith focused minds we take refuge in the Heavenly Worthy who secretly transcends the Sea of Suffering.\nWith focused minds we take refuge in the Heavenly Worthy who swiftly escapes the River of Ashes.\nWith focused minds we take refuge in the Heavenly Worthy who transforms traces in the Dragon City.\nWith focused minds we take refuge in the Heavenly Worthy who ascends to the Phoenix Palaces.\nWith focused minds we take refuge in the Heavenly Worthy who forever departs from affliction.\nWith focused minds we take refuge in the Heavenly Worthy who attains the carefree fruition.\nWe bow our heads in reverence, devoutly repenting.\n\nIn the Northwest are those sinners,\nConfined in the prisons of fire chariots, the dungeons of smoking blades.\nWheels turning east and west, their four great elements torn apart,\nAll enmeshed in ashes and embers, enduring ceaseless torment.\nEver bound in the prisons,\nUnceasing day and night.\nWe now offer aid,\nWishing them rebirth.\nWith focused minds we take refuge in the Heavenly Worthy who encompasses all beings in the Round Vault.\nWith focused minds we take refuge in the Heavenly Worthy who delivers people to the Heavens above.\nWith focused minds we take refuge in the Heavenly Worthy who opens the path through dark realms.\nWith focused minds we take refuge in the Heavenly Worthy who washes away flaws and blemishes.\nWith focused minds we take refuge in the Heavenly Worthy who responds to thoughts with power.\nWith focused minds we take refuge in the Heavenly Worthy who unites with the True through contemplation.\nWith focused minds we take refuge in the Heavenly Worthy who dissolves karmic traces.\nWith focused minds we take refuge in the Heavenly Worthy who eradicates evil roots.\nWith focused minds we take refuge in the Heavenly Worthy who enables all to be born in blissful realms.\nWith focused minds we take refuge in the Heavenly Worthy who enables all to rejoice in the Immortal Homeland.\nWe bow our heads in reverence, devoutly repenting.\n\nAt the Center are those sinners,\nConfined in the prisons of universal plunder, the dungeons of torture.\nSword trees severing sinews, knife mountains flowing with blood,\nFeet falling upon axe blades, bodies impaled on sword points.\nEver bound in the prisons,\nUnceasing day and night.\nWe now offer aid,\nWishing them rebirth.\nWith focused minds we take refuge in the Heavenly Worthy whose mysterious grace universally extends.\nWith focused minds we take refuge in the Heavenly Worthy of inexhaustible Dharma-power.\nWith focused minds we take refuge in the Heavenly Worthy whose divine work saves all beings.\nWith focused minds we take refuge in the Heavenly Worthy who transforms and completes persons.\nWith focused minds we take refuge in the Heavenly Worthy who unites past lives with the Dao.\nWith focused minds we take refuge in the Heavenly Worthy who gives life to the dead souls.\nWith focused minds we take refuge in the Heavenly Worthy who sweeps away transgressions.\nWith focused minds we take refuge in the Heavenly Worthy who repents and washes away entanglements.\nWith focused minds we take refuge in the Heavenly Worthy who secretly dissolves karmic obstacles.\nWith focused minds we take refuge in the Heavenly Worthy who forever departs from the dark underworld.\nWe bow our heads in reverence, devoutly repenting.\n\nThe Fengdu of twenty-six hundred li,\nThe eighty-four thousand layers of ghostly prisons,\nA vast and boundless sea of suffering, churning snow-white waves a thousand fathoms deep;\nA distant and endless River of Ashes, surging with smoke and waves in ten thousand forms.\nNo tree unpierced by frost blades,\nNo mountain unlined with wind knives.\nForever without the chance for deliverance,\nOne can only sigh at the path of sinking.\nThus we look up, relying on the precious incense,\nSpecially expounding the true teachings.\nProclaiming the sacred names, they universally respond in the ten directions;\nRaising the sounds of the Dharma, they soar afar through the three realms.\nMay it be that grace descends from above,\nExtending even to the hidden souls.\nWe now earnestly contemplate the Dao altar,\nRepenting and removing the knife mountains and sword trees of hell,\nFreeing them from the boiling cauldrons and furnace coals of hell.\nThe hells of scorching iron beds and copper pillars,\nThe hells of searing flames,\nThe hells of wheeling fire chariots and blade wheels,\nThe hells of thunderous plows and tongue-ripping.\n\nThe **Torture Hell**, where bodies are nailed and sawn asunder.\nThe **Severing Hell**, where iron nets rend limbs from joints.\nThe **Parting Hell**, where fire pits roast and sear.\nThe **Fierce Hell**, where blades and claws rend flesh.\nThe **Grappling Hell**, where tigers, wolves, eagles, and hounds maul.\nThe **Mutilation Hell**, where iron pellets are swallowed and devoured.\nThe **Festering Hell**, where dark mountains of rotting flesh rise.\nThe **Hacking Hell**, where molten bronze is drunk and molten iron imbibed.\nThe **Dissolving Hell**, where brine and freezing ice corrode.\nThe **Splitting Hell**, where the **Great Iron Enclosure Mountain Gate Hell** and the **Lesser Iron Enclosure Mountain Gate Hell** stand;\nthe **Iron Horse Iron Ox Hell**, the **Iron Donkey Iron Bird Hell**,\nthe **Iron Mountain Iron Chamber Hell**, the **Iron Chariot Iron Armor Hell**,\nthe **Flying Blades and Lightning Hell**, the **Dismembered Body and Severed Head Hell**,\nthe **Eight Cold and Eight Extreme Hells**, the **Two-Tongued and Two-Stone Hell**,\nthe **Burning Hands and Scorching Feet Hell**, the **Flayed Skin and Blood-Drinking Hell**,\nthe **Excrement and Urine Hell**, the **Minced Flesh Hell**,\nthe **( ) Cauldron Hell**, the **Collapsing and Burial Hell**,\nthe **Apapa Hell**, the **Apopo Hell**,\nthe **Atata Hell**, the **Arara Hell**—\nsuch are the searing flames and fierce fires,\nthe biting cold and freezing ice.\nWithout repentance and recitation, sin and karma cannot be purged.\n\nThus, in accordance with the teachings and rites,\nwe bow in submission to the Dao’s conditions,\ninvoking this morning’s incense and flame,\nto relieve the suffering of past kalpas and distant origins,\nto rescue the benighted from the nine nights,\nto extricate the tormented from the eight gates.\nMoved by the sorrow of Mount Tai,\nwe break the stagnation of Fengdu,\nhoping for the enlightened power’s grace,\nto bathe in the radiance of divine compassion.\n\nNow, with focused intent, we perform the rites.\nWith sincere devotion, we take refuge in the **Heavenly Worthy who Eradicates Past Karma**.\nWith sincere devotion, we take refuge in the **Heavenly Worthy who Delivers Sunken Souls**.\nWith sincere devotion, we take refuge in the **Heavenly Worthy who Severs the Three Evils**.\nWith sincere devotion, we take refuge in the **Heavenly Worthy who Ascends the Nine Dark Realms**.\nWith sincere devotion, we take refuge in the **Heavenly Worthy of Penglai’s Transformed Traces**.\nWith sincere devotion, we take refuge in the **Heavenly Worthy of Kunlun’s Soaring Form**.\nWith sincere devotion, we take refuge in the **Heavenly Worthy of Ascending Ao Island**.\nWith sincere devotion, we take refuge in the **Heavenly Worthy of Linzhou’s Karmic Convergence**.\nWith sincere devotion, we take refuge in the **Heavenly Worthy who Delivers All Without Exception**.\nWith sincere devotion, we take refuge in the **Heavenly Worthy who Answers Every Prayer**.\nWith sincere devotion, we take refuge in the **Perfected One of Great Compassion and Great Mercy, Savior from Suffering**.\nWith sincere devotion, we take refuge in the **Perfected One of Great Compassion and Great Mercy, Deliverer from Tribulation**.\nWith sincere devotion, we take refuge in the **Perfected One of Great Compassion and Great Mercy, Eradicator of Sin**.\nWith sincere devotion, we take refuge in the **Perfected One of Great Compassion and Great Mercy, Liberator from Calamity**.\n\nWe further repent before all the great hells,\nthe great ghostly prisons,\nthe sevenfold iron cities,\nthe sevenfold iron nets,\nwhere ox-headed jailers stand—\nsixty-two eyes and eight heads,\neighteen horns and nine tails,\nbrandishing iron halberds in their hands,\nshooting iron pellets from their eyes.\nSinners are pierced from crown to sole,\npain searing bone and marrow,\nagony piercing heart and liver,\nbegging for life yet denied,\npleading for death yet withheld.\nGround by stone mills through kalpas of rebirth,\npounded by iron pestles without respite,\nsmoke and fire intertwine,\nbirds and beasts strike and maul.\nAll this is the retribution of evil paths,\nthe summons of past karma.\nDeprived of the Three Lights,\nunaware of the Three Treasures.\n\nThen the **Primordial Heavenly Worthy** declared:\nIf one copies this scripture,\ncherishes its meaning,\nquietly recites and establishes altars with images,\ndevoutly practices the Dao and scatters flowers,\nthen the **Vajra Divine Kings**, the **Heavenly Soldiers and Mighties**,\nthe **Five Emperors of the Three Realms**, and all spirits\nwill widely bestow compassion,\nabundantly bring blessings,\nrestore bones to life,\nrefine form into truth.\nMerciful light will gaze upon the sentient,\nmysterious creation will pervade the unbounded.\nWhere jade bells chime, gates of salvation open;\nwhen jade chimes resound, paths of proclamation unfold.\nRelying on the wondrous model of the Nine Heavens,\nentrusted to the true teachings of the Ten Caves,\nice courts transform into jade lands,\nfire chambers become treasure realms.\nSword trees shatter, blade mountains break.\nThus, the long-night’s sinking shall all attain this morning’s liberation.\n\nThe Scripture concludes:\nThose who hear the scripture and attain the Dao shall follow their thoughts to rebirth.\nBoundless mysterious merit,\nlimitless enlightened grace.\nMay past enmities dissolve,\nand future karmic ties converge.\nMay the three evil paths be purged,\nthe eight difficulties averted.\nThose who hear the scripture and attain the Dao shall follow their thoughts to rebirth.\nImmeasurable virtuous causes,\ninexhaustible sacred power.\nMay the cycles of rebirth cease,\nentanglements forever severed.\nMay evil destinies brighten,\nlost souls be refined.\nThose who hear the scripture and attain the Dao shall follow their thoughts to rebirth.\nInfinite good roots,\nunfathomable wondrous force.\nMay the Four Offices flow without obstruction,\nthe Nine Bureaus silently connect.\nMay souls ascend the Vermilion Mound,\nspirits wander the Purple Palace.\n\nNow that repentance is complete and rites concluded,\neach enveloped in clouds of compassion,\nwe ascend together to the pure realm.\nThus, rainbow banners guide our steps,\nfeathered chariots arrive in splendor.\nWe soar into the great void,\ncarefree in the realm of ultimate bliss.\n\n**Praise of the Scripture:**\nBehold the wondrous canon of the highest rank,\nthe treasure trove of the central heavens,\ninscribed with phoenix scripts and dragon seals,\nadorned with soaring clouds and dewdrop characters.\nIts merit transforms and transcends,\nits power elevates and advances.\nThus, the scripture clarifies the Dao,\nand the Dao establishes the scripture.\nWithout diligent recitation,\nhow can the bonds of entanglement be undone?\nThose who bear sins—teeth bared, hair unbound—\nthose who harbor grievances—feathered and furred—\nall endure water, fire, wind, and blades,\nrevolving through birth and death,\ngathering and dispersing in the netherworld,\nfacing interrogation in the dark courts.\nTherefore, we offer these resources,\nextending repentance and deliverance.\n\nWe humbly invoke the **Golden Maidens of Incense** and the **Jade Lads of Scriptures**,\nwho open the eight gates above,\nconnect the five portals below,\nproclaiming the immortal ranks of reborn souls,\ntransmitting the divine decrees of appointed spirits.\nThey enable those who turn toward them to enter the blessed immortal realms,\nthose who listen attentively to transcend the evil destinies.\nThey calm the waves of the River of Love,\nprovide the ferry across the Sea of Suffering.\nThey widely lay the Dharma bridge,\nguiding all to the Dao’s shore.\nSwiftly, we attend the rainbow banners and feathered regalia,\nforever accompanying the crane-drawn and phoenix-borne chariots.\n\nAmidst the seven-jeweled sutra platforms they wander and delight,\nin the three-pure grotto-palaces they find joy.\nThe nine-flowered melodies conclude,\nthe myriad stones’ voices harmonize.\nHaving received the profound compassion,\nthey accomplish return to the wondrous Dao.\n\nNow, at this dawn observance,\nwith the remnants of incense and flame,\nwe humbly pray for our ancestors of former generations,\nwho have not yet ascended;\nfor our recently departed kin,\nstill dwelling in the nether darkness.\nMay their sin-records be erased,\ntheir evil traces swept away,\nso they may swiftly be delivered by the Han Bureau,\ngranted passage through the open gates of Fengdu.\nTogether they ascend to the heavens of utmost bliss,\neach gathering in the realms of rebirth.\n\nWe reflect upon our own coarse and careless transgressions,\nwhich have entangled us in karmic bonds.\nAll greed for savor that harms,\nall passions that wound living things—\nthese become knots of enmity in life,\nand when life ends, the retribution body bears them.\nWithout the gate of repentance and redemption,\nthe path of entanglement remains unsolved.\nBearing grievances and debts,\nall long for freedom.\nFeathered flocks and furred herds,\nall receive transformation.\nThe power of repentance and purification shines forth,\nso body and speech are free from hindrance.\n\nReverently we invoke the Compassionate Venerables of the Golden Towers,\nthe Supreme Sages of the Jade Capital,\nwho widely open their mercy,\nand specially accept our earnest prayers.\nMay the time of returning to simplicity\npass without the eight obstructions;\nmay the dawn of restoring purity\nnot traverse the three paths.\n\nBefore the Nine-Splendor Terrace, riding the wind and commanding qi;\nWithin the Five-Luminance Palace, meeting the Dao and uniting with the Real.\nOn white tablets, ascending to life—\nthe thirty-two heavens’ red writ confers destiny;\nOn yellow registers, erasing death—\nthe hundred-twenty bureaus’ black ledgers strike out names.\nThose past receive grace,\nthose present gain blessings.\nEstablishing the hundred sacred titles of Purple Emptiness,\nthey respond to the myriad layers of the cinnabar heavens’ divine wisdom.\nWhen the jeweled scroll unfurls,\nit further strengthens the power of cultivation;\nWhere the numinous scripture is recited,\nthere arises the heart of dawn reverence.\nPrecious incense unceasing through the two watches,\nwisdom torches ever-burning through midnight.\nBoundless wondrous goodness,\nmeasureless supreme causes.\nGreatly opening the gate of refuge,\nwidely extending repentance.\nThe *Highest’s Repentance for Eliminating Hell and Ascending to Heaven* is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上消灭地狱升陟天堂忏 经名：太上消灭地狱升陟天堂忏。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 太上消灭地狱升陟天堂忏 各整威仪　咸生虔敬 志心朝礼，运念诵持，秘密琅函，玄微琼藏。 当愿天恩普度，地狱咸开，慧日照临，慈光摄受。 志心朝礼，运念诵持，三宝灵文，九清圣范。 当愿大施利济，遍及阴冥，度品南宫，化生北府。 志心朝礼，运念诵持，十洞真诠，万天仙梵。 当愿灵慈拯拔，玄化敷弘，应处幽涂，悉沾殊胜。 以今将修玉籍，特蒇金科，至圣启途，众真浮驾。 遂使九幽交会，五苦咸听，回向奉行，赞咏如法。 尔时，元始天尊，在九清妙境三元宝宫，御劫刃台中，集骞木林下，与太上道君、太上老君、诸天众圣、三界尊神、九府三官、四司五帝、察命童子、妙行真人，一时同至，皆驾八景琅舆、五色琼辇、麟驭羽骑，凤葆龙旗，吟诵洞章，朝赞玉座。 於是元始天尊轸大慈悲，放诸光明，辉映九幽地狱，开通一切冥司罗酆。 众曰：今日何缘，亿劫所感。 恒居黑暗，克赖照临。 元始天尊敕命北都大帝、五帝考官、六宫掾吏、牛头鬼卒、虎眼神王、三界大魔、九幽群魂，有诸六宫，校集九府死生、一十二之河源、二十四之狴犴、南水会宫之府、北海长夜之庭，遂得大轸天慈，广开圣道，显说九真之妙戒，当资五业之幽涂。 志诚才起於焚修，玄感必彰於显应。 仰赖玄元之化，成归拯拔之门。 稽首归依，虔诚忏悔。 东方有诸罪人，处风雷之狱、霹雳之牢。 剑树刀山，飞戈飘戟，穿穴五藏，分解四肢。 常处狴犴，不舍昼夜。 谨当资荐，愿遂往生。 志心归命，清都阐教天尊。 志心归命，紫府垂慈天尊。 志心归命，乾坤开度天尊。 志心归命，日月照临天尊。 志心归命，穹崇圣盘天尊。 志心归命，广大玄功天尊。 志心归命，转轮自在天尊。 志心归命，受炼更生天尊。 志心归命，超凌上境天尊。 志心归命，逍遥太虚天尊。 稽首归依，虔诚忏悔。 南方有诸罪人，处烽轮之狱、欠山之牢。 烈焱燎头，猛焰烧面，骸骨灰粉，皮肤焦熬。 常处狴犴，不舍昼夜。 谨当资荐，愿遂往生。 志心归命，玄穹垂化天尊。 志心归命，至圣覃恩天尊。 志心归命，慈悲五苦天尊。 志心归命，愍念三涂天尊。 志心归命，沈冤罢对天尊。 志心归命，滞魂超生天尊。 志心归命，消灭恶趣天尊。 志心归命，资益善缘天尊。 志心归命，冲升宝洞天尊。 志心归命，飞陟朱陵天尊。 稽首归依，虔诚忏悔。 西方有诸罪人，处金刚之狱、铁围之牢。 金锤塞心，铁棒穿腹，骨肉烂坏，肢节分离。 常处狴犴，不舍昼夜。 谨当资荐，愿遂往生。 志心归命，咸承慧日天尊。 志心归命，普度真风天尊。 志心归命，玄慈拯济天尊。 志心归命，圣力开通天尊。 志心归命，蠲除罪衅天尊。 志心归命，忏拔湮沉天尊。 志心归命，五道变迹天尊。 志心归命，十转回灵天尊。 志心归命，随处应化天尊。 志心归命，所在生仙天尊。 稽首归依，虔诚忏悔。 北方有诸罪人，处溟泠之狱，沈没之牢。 寒丘冰池，雪戟霜刃，臭尸破坏，毒汁浇淋。 常处狴犴，不舍昼夜。 谨当资荐，愿遂往生。 志心归命，不尽道力天尊。 志心归命，无极玄通天尊。 志心归命，落除罪业天尊。",
      "translated_text": "**The Supreme Petition for the Elimination of Hell and Ascension to Heaven**\n\n**Title:** *The Supreme Petition for the Elimination of Hell and Ascension to Heaven*\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, Dongxuan Section, *Weiyi* (Ritual Propriety) Category\n\nWith solemn dignity and reverent devotion,\nWe focus our minds in worship, reciting and upholding the secret jade scrolls, the profound and subtle treasures of the mystic vault.\n\nMay the grace of Heaven universally deliver,\nMay the hells all open wide,\nMay the sun of wisdom shine upon them,\nMay the light of compassion gather and receive them.\n\nWith focused minds we worship, reciting and upholding the sacred texts of the Three Treasures, the holy standards of the Nine Purities.\n\nMay great beneficence and salvation extend,\nPervading the dark and hidden realms,\nDelivering beings to the Southern Palace,\nTransforming and rebirthing them in the Northern Mansion.\n\nWith focused minds we worship, reciting and upholding the true teachings of the Ten Caves, the celestial hymns of the myriad heavens.\n\nMay divine compassion rescue and uplift,\nMay the mysterious transformation spread far and wide,\nWherever the paths of darkness lie,\nMay all receive extraordinary blessings.\n\nNow, as we prepare to perform the jade register rites,\nFulfilling the golden precepts,\nThe Most Sacred opens the way,\nThe host of perfected beings ascends in their chariots.\n\nThus, the Nine Dark Realms converge,\nThe Five Sufferings all heed,\nWe turn and offer, praising in accordance with the Dharma.\n\nAt that time, the Most High Lord of the Primordial Beginning,\nResiding in the wondrous realm of the Nine Purities, within the Three Primordials’ Jeweled Palace,\nSeated upon the Kalpa-Blade Terrace amid the Qianmu Grove,\nTogether with the Most High Lord of the Dao, the Most High Lord Lao,\nThe host of celestial sages, the honored deities of the Three Realms,\nThe officials of the Nine Bureaus and Three Offices,\nThe Four Directors and Five Emperors,\nThe Inspecting Destiny Youths, the Perfected of Wondrous Conduct,\nAll arrived at once,\nRiding eightfold jade chariots, five-colored jasper carriages,\nUnicorns and feathered steeds,\nPhoenix canopies and dragon banners,\nChanting the cave scriptures, praising the jeweled throne.\n\nThereupon, the Most High Lord of the Primordial Beginning,\nMoved by great compassion,\nEmitted rays of light,\nIlluminating the Nine Dark Hells of the Underworld,\nOpening all the nether bureaus and the Fengdu courts.\n\nThe assembly exclaimed:\n“By what cause today,\nAfter eons of longing,\nDwelling in eternal darkness,\nDo we now receive this illumination?”\n\nThe Most High Lord of the Primordial Beginning commanded:\nThe Great Emperor of the Northern Capital,\nThe Judging Officials of the Five Emperors,\nThe clerks of the Six Palaces,\nOx-Headed Ghost Soldiers,\nTiger-Eyed Divine Kings,\nThe great demons of the Three Realms,\nThe multitude of souls in the Nine Dark Realms—\nAll the Six Palaces,\nThe Nine Bureaus recording life and death,\nThe twelve river sources,\nThe twenty-four prisons,\nThe Southern Water Assembly Palace,\nThe Northern Sea’s Eternal Night Court—\nAll received the great compassion of Heaven,\nThe sacred path was widely opened,\nThe wondrous precepts of the Nine Perfected were expounded,\nTo aid the dark paths of the Five Destinies.\n\nSincere devotion, once kindled in the flames of practice,\nWill surely manifest in profound response.\nRelying on the transformation of the Mysterious Origin,\nWe attain the gate of deliverance.\nWe bow our heads in reverence, devoutly repenting.\n\nIn the East are those sinners,\nConfined in the prisons of wind and thunder, the dungeons of lightning.\nSword trees and blade mountains,\nFlying spears and drifting halberds,\nPiercing the five viscera,\nDismembering the four limbs.\nEver bound in the prisons,\nUnceasing day and night.\nWe now offer aid,\nWishing them rebirth.\nWith focused minds we take refuge in the Heavenly Worthy of the Pure Capital, who expounds the teachings.\nWith focused minds we take refuge in the Heavenly Worthy of the Purple Palace, who bestows compassion.\nWith focused minds we take refuge in the Heavenly Worthy who opens deliverance through Heaven and Earth.\nWith focused minds we take refuge in the Heavenly Worthy illumined by sun and moon.\nWith focused minds we take refuge in the Heavenly Worthy of the Lofty and Sacred Vessel.\nWith focused minds we take refuge in the Heavenly Worthy of vast and mysterious merit.\nWith focused minds we take refuge in the Heavenly Worthy of the turning wheel, who is self-soverign.\nWith focused minds we take refuge in the Heavenly Worthy who undergoes refinement and rebirth.\nWith focused minds we take refuge in the Heavenly Worthy who transcends to the highest realms.\nWith focused minds we take refuge in the Heavenly Worthy who roams the Great Void.\nWe bow our heads in reverence, devoutly repenting.\n\nIn the South are those sinners,\nConfined in the prisons of blazing wheels, the dungeons of debt mountains.\nFierce flames scorch their heads,\nRaging fires burn their faces,\nBones reduced to ash,\nSkin and flesh seared.\nEver bound in the prisons,\nUnceasing day and night.\nWe now offer aid,\nWishing them rebirth.\nWith focused minds we take refuge in the Heavenly Worthy of the Mysterious Vault, who bestows transformation.\nWith focused minds we take refuge in the Heavenly Worthy of utmost sageliness, who extends grace.\nWith focused minds we take refuge in the Heavenly Worthy of compassion for the Five Sufferings.\nWith focused minds we take refuge in the Heavenly Worthy who pities the Three Paths.\nWith focused minds we take refuge in the Heavenly Worthy who dissolves grievances and ends disputes.\nWith focused minds we take refuge in the Heavenly Worthy who delivers stagnant souls to rebirth.\nWith focused minds we take refuge in the Heavenly Worthy who eliminates evil destinies.\nWith focused minds we take refuge in the Heavenly Worthy who aids good affinities.\nWith focused minds we take refuge in the Heavenly Worthy who ascends to the Jeweled Grotto.\nWith focused minds we take refuge in the Heavenly Worthy who soars to the Vermilion Mound.\nWe bow our heads in reverence, devoutly repenting.\n\nIn the West are those sinners,\nConfined in the prisons of vajra, the dungeons of iron enclosures.\nGolden hammers pierce their hearts,\nIron rods penetrate their bellies,\nFlesh and bones rot away,\nLimbs and joints separate.\nEver bound in the prisons,\nUnceasing day and night.\nWe now offer aid,\nWishing them rebirth.\nWith focused minds we take refuge in the Heavenly Worthy who universally receives the sun of wisdom.\nWith focused minds we take refuge in the Heavenly Worthy of universal deliverance through the true wind.\nWith focused minds we take refuge in the Heavenly Worthy of mysterious compassion and salvation.\nWith focused minds we take refuge in the Heavenly Worthy of sacred power who opens the way.\nWith focused minds we take refuge in the Heavenly Worthy who absolves transgressions.\nWith focused minds we take refuge in the Heavenly Worthy who repents and delivers the submerged.\nWith focused minds we take refuge in the Heavenly Worthy who transforms the traces of the Five Paths.\nWith focused minds we take refuge in the Heavenly Worthy who turns the wheel tenfold to restore the numinous.\nWith focused minds we take refuge in the Heavenly Worthy who responds and transforms wherever present.\nWith focused minds we take refuge in the Heavenly Worthy who generates immortals in every place.\nWe bow our heads in reverence, devoutly repenting.\n\nIn the North are those sinners,\nConfined in the prisons of icy depths, the dungeons of sinking.\nFrigid mounds and frozen pools,\nSnow spears and frost blades,\nRotten corpses shattered,\nPoisonous juices poured over them.\nEver bound in the prisons,\nUnceasing day and night.\nWe now offer aid,\nWishing them rebirth.\nWith focused minds we take refuge in the Heavenly Worthy of inexhaustible Dao-power.\nWith focused minds we take refuge in the Heavenly Worthy of boundless mysterious penetration.\nWith focused minds we take refuge in the Heavenly Worthy who eliminates karmic offenses.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1348,
      "start_sentence": 0,
      "end_sentence": 73,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.59588885307312,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上消灭地狱升陟天堂忏.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "志心归命，拔赎沈沦天尊。 志心归命，刀山断刃天尊。 志心归命，剑树摧锋天尊。 志心归命，飞度五户天尊。 志心归命，超转八门天尊。 志心归命，化生紫极天尊。 志心归命，冲寂碧穹天尊。 稽首归依，虔诚忏悔。 东北方有诸罪人，处镬汤之狱，炉炭之牢。 煮溃四肢，烹离六府，筋骨臭秽，脓血消洋。 常处狴犴，不舍昼夜。 谨当资荐，愿遂往生。 志心归命，断除障碍天尊。 志心归命，消灭冤仇天尊。 志心归命，烟牢息焰天尊。 志心归命，火狱沈光天尊。 志心归命，回骸得度天尊。 志心归命，炼质受生天尊。 志心归命，咸登福海天尊。 志心归命，广布法桥天尊。 志心归命，神升阆苑天尊。 志心归命，魂陟梵天天尊。 稽首归依，虔诚忏悔。 东南方有诸罪人，处铜柱之狱、铁床之牢。 手抱足登，腹焦背烂，脓血溃滴，烟火烧焚。 常处狴犴，不舍昼夜。 谨当资荐，愿遂往生。 志心归命，上垂睿化天尊。 志心归命，普度洪慈天尊。 志心归命，太玄起死天尊。 志心归命，宝籍生神天尊。 志心归命，能蠲业道天尊。 志心归命，得脱苦轮天尊。 志心归命，飞升欲海天尊。 志心归命，离超爱河天尊。 志心归命，逍遥真境天尊。 志心归命，腾翥仙阙天尊。 稽首归依，虔诚忏悔。 西南方有诸罪人，处屠割之狱、倒悬之牢。 五藏皮肤，四肢筋脉，随手刀刺，满地血流。 常处狴犴，不舍昼夜。 谨当资荐，愿遂往生。 志心归命，天垂开度天尊。 志心归命，身得上生天尊。 志心归命，普施法雨天尊。 志心归命，密布慈云天尊。 志心归命，潜超苦海天尊。 志心归命，遽脱灰河天尊。 志心归命，龙城化迹天尊。 志心归命，凤阙登仙天尊。 志心归命，永离烦恼天尊。 志心归命，感果逍遥天尊。 稽首归依，虔诚忏悔。 西北方有诸罪人，处火车之狱、烟刃之牢。 轮转东西，支分四大，悉萦灰炭，遍受煎熬。 常处狴犴，不舍昼夜。 谨当资荐，愿遂往生。 志心归命，圆穹及物天尊。 志心归命，上天度人天尊。 志心归命，开度幽暗天尊。 志心归命，荡涤瑕疵天尊。 志心归命，应念得力天尊。 志心归命，随念合真天尊。 志心归命，消除罪迹天尊。 志心归命，落灭恶根天尊。 志心归命，悉生乐境天尊。 志心归命，咸庆仙乡天尊。 稽首归依，虔诚忏悔。 中央有诸罪人，处普掠之狱，受拷之牢。 剑树断筋，刀山流血，足落斧刃，身挂剑楞。 常处狴犴，不舍昼夜。 谨当资荐，愿遂往生。 志心归命，玄恩普及天尊。 志心归命，法力无穷天尊。 志心归命，神功拯物天尊。 志心归命，仙化成人天尊。 志心归命，宿命合道天尊。 志心归命，死魂生身天尊。 志心归命，荡除愆衅天尊。 志心归命，忏涤萦缠天尊。 志心归命，潜消业障天尊。 志心归命，永离幽冥天尊。 稽首归依，虔诚忏悔。 二千六百里之酆都，八万四千重之鬼狱，茫茫苦海，翻雪浪之千寻； 渺渺灰河，鼓烟波之万状。 无树不钻於霜刃，有山皆列於风刀。 永无追荐之缘，堪叹沈沦之道。 遂则仰凭宝炷，特演真诠。 宣圣号，则溥应十方； 揭梵音，则遥腾三界。 当愿上垂阴德，下及幽魂。 谨当精念道场，忏除地狱刀山剑树，脱落地狱镬汤炉炭。 烧煮地狱，铁床铜柱。 焦然地狱，刀轮火车。 霹雳地狱，拔舌耕犂。",
      "translated_text": "With focused minds we take refuge in the Heavenly Worthy who redeems the sunken.\nWith focused minds we take refuge in the Heavenly Worthy who breaks the blades of the Knife Mountain.\nWith focused minds we take refuge in the Heavenly Worthy who shatters the points of the Sword Trees.\nWith focused minds we take refuge in the Heavenly Worthy who swiftly traverses the Five Gates.\nWith focused minds we take refuge in the Heavenly Worthy who transcends the Eight Portals.\nWith focused minds we take refuge in the Heavenly Worthy who transforms and gives birth in the Purple Ultimate.\nWith focused minds we take refuge in the Heavenly Worthy of the Serene Azure Vault.\nWe bow our heads in reverence, devoutly repenting.\n\nIn the Northeast are those sinners,\nConfined in the prisons of boiling cauldrons, the dungeons of furnace coals.\nTheir four limbs boiled to dissolution, their six viscera seared apart,\nSinews and bones putrid and foul, pus and blood melting away.\nEver bound in the prisons,\nUnceasing day and night.\nWe now offer aid,\nWishing them rebirth.\nWith focused minds we take refuge in the Heavenly Worthy who severs obstacles.\nWith focused minds we take refuge in the Heavenly Worthy who extinguishes enmity.\nWith focused minds we take refuge in the Heavenly Worthy who stills the flames of the Smoke Prison.\nWith focused minds we take refuge in the Heavenly Worthy who dims the fires of the Fire Prison.\nWith focused minds we take refuge in the Heavenly Worthy who restores the scattered bones to deliverance.\nWith focused minds we take refuge in the Heavenly Worthy who refines the substance to receive rebirth.\nWith focused minds we take refuge in the Heavenly Worthy who enables all to ascend the Sea of Blessings.\nWith focused minds we take refuge in the Heavenly Worthy who broadly spreads the Dharma Bridge.\nWith focused minds we take refuge in the Heavenly Worthy whose spirits ascend to the Gardens of Lang.\nWith focused minds we take refuge in the Heavenly Worthy whose souls ascend to the Brahma Heavens.\nWe bow our heads in reverence, devoutly repenting.\n\nIn the Southeast are those sinners,\nConfined in the prisons of copper pillars, the dungeons of iron beds.\nEmbracing with hands and climbing with feet, their bellies scorched and backs seared,\nPus and blood oozing, smoke and fire burning.\nEver bound in the prisons,\nUnceasing day and night.\nWe now offer aid,\nWishing them rebirth.\nWith focused minds we take refuge in the Heavenly Worthy whose sagely transformation descends from above.\nWith focused minds we take refuge in the Heavenly Worthy of vast deliverance and great compassion.\nWith focused minds we take refuge in the Heavenly Worthy of the Great Mystery who revives the dead.\nWith focused minds we take refuge in the Heavenly Worthy of the Sacred Register who gives life to the spirits.\nWith focused minds we take refuge in the Heavenly Worthy who can absolve the karmic path.\nWith focused minds we take refuge in the Heavenly Worthy who enables escape from the Wheel of Suffering.\nWith focused minds we take refuge in the Heavenly Worthy who ascends the Sea of Desire.\nWith focused minds we take refuge in the Heavenly Worthy who transcends the River of Attachment.\nWith focused minds we take refuge in the Heavenly Worthy of the Carefree True Realm.\nWith focused minds we take refuge in the Heavenly Worthy who soars to the Immortal Palaces.\nWe bow our heads in reverence, devoutly repenting.\n\nIn the Southwest are those sinners,\nConfined in the prisons of butchery, the dungeons of inverted suspension.\nTheir five viscera and skin, their four limbs and sinews,\nPierced by knives at every hand, blood flowing across the ground.\nEver bound in the prisons,\nUnceasing day and night.\nWe now offer aid,\nWishing them rebirth.\nWith focused minds we take refuge in the Heavenly Worthy whose grace descends from Heaven.\nWith focused minds we take refuge in the Heavenly Worthy who enables ascent to higher rebirth.\nWith focused minds we take refuge in the Heavenly Worthy who universally bestows the Dharma Rain.\nWith focused minds we take refuge in the Heavenly Worthy who densely spreads the Clouds of Compassion.\nWith focused minds we take refuge in the Heavenly Worthy who secretly transcends the Sea of Suffering.\nWith focused minds we take refuge in the Heavenly Worthy who swiftly escapes the River of Ashes.\nWith focused minds we take refuge in the Heavenly Worthy who transforms traces in the Dragon City.\nWith focused minds we take refuge in the Heavenly Worthy who ascends to the Phoenix Palaces.\nWith focused minds we take refuge in the Heavenly Worthy who forever departs from affliction.\nWith focused minds we take refuge in the Heavenly Worthy who attains the carefree fruition.\nWe bow our heads in reverence, devoutly repenting.\n\nIn the Northwest are those sinners,\nConfined in the prisons of fire chariots, the dungeons of smoking blades.\nWheels turning east and west, their four great elements torn apart,\nAll enmeshed in ashes and embers, enduring ceaseless torment.\nEver bound in the prisons,\nUnceasing day and night.\nWe now offer aid,\nWishing them rebirth.\nWith focused minds we take refuge in the Heavenly Worthy who encompasses all beings in the Round Vault.\nWith focused minds we take refuge in the Heavenly Worthy who delivers people to the Heavens above.\nWith focused minds we take refuge in the Heavenly Worthy who opens the path through dark realms.\nWith focused minds we take refuge in the Heavenly Worthy who washes away flaws and blemishes.\nWith focused minds we take refuge in the Heavenly Worthy who responds to thoughts with power.\nWith focused minds we take refuge in the Heavenly Worthy who unites with the True through contemplation.\nWith focused minds we take refuge in the Heavenly Worthy who dissolves karmic traces.\nWith focused minds we take refuge in the Heavenly Worthy who eradicates evil roots.\nWith focused minds we take refuge in the Heavenly Worthy who enables all to be born in blissful realms.\nWith focused minds we take refuge in the Heavenly Worthy who enables all to rejoice in the Immortal Homeland.\nWe bow our heads in reverence, devoutly repenting.\n\nAt the Center are those sinners,\nConfined in the prisons of universal plunder, the dungeons of torture.\nSword trees severing sinews, knife mountains flowing with blood,\nFeet falling upon axe blades, bodies impaled on sword points.\nEver bound in the prisons,\nUnceasing day and night.\nWe now offer aid,\nWishing them rebirth.\nWith focused minds we take refuge in the Heavenly Worthy whose mysterious grace universally extends.\nWith focused minds we take refuge in the Heavenly Worthy of inexhaustible Dharma-power.\nWith focused minds we take refuge in the Heavenly Worthy whose divine work saves all beings.\nWith focused minds we take refuge in the Heavenly Worthy who transforms and completes persons.\nWith focused minds we take refuge in the Heavenly Worthy who unites past lives with the Dao.\nWith focused minds we take refuge in the Heavenly Worthy who gives life to the dead souls.\nWith focused minds we take refuge in the Heavenly Worthy who sweeps away transgressions.\nWith focused minds we take refuge in the Heavenly Worthy who repents and washes away entanglements.\nWith focused minds we take refuge in the Heavenly Worthy who secretly dissolves karmic obstacles.\nWith focused minds we take refuge in the Heavenly Worthy who forever departs from the dark underworld.\nWe bow our heads in reverence, devoutly repenting.\n\nThe Fengdu of twenty-six hundred li,\nThe eighty-four thousand layers of ghostly prisons,\nA vast and boundless sea of suffering, churning snow-white waves a thousand fathoms deep;\nA distant and endless River of Ashes, surging with smoke and waves in ten thousand forms.\nNo tree unpierced by frost blades,\nNo mountain unlined with wind knives.\nForever without the chance for deliverance,\nOne can only sigh at the path of sinking.\nThus we look up, relying on the precious incense,\nSpecially expounding the true teachings.\nProclaiming the sacred names, they universally respond in the ten directions;\nRaising the sounds of the Dharma, they soar afar through the three realms.\nMay it be that grace descends from above,\nExtending even to the hidden souls.\nWe now earnestly contemplate the Dao altar,\nRepenting and removing the knife mountains and sword trees of hell,\nFreeing them from the boiling cauldrons and furnace coals of hell.\nThe hells of scorching iron beds and copper pillars,\nThe hells of searing flames,\nThe hells of wheeling fire chariots and blade wheels,\nThe hells of thunderous plows and tongue-ripping.",
      "overlap_context": "geons of sinking.\nFrigid mounds and frozen pools,\nSnow spears and frost blades,\nRotten corpses shattered,\nPoisonous juices poured over them.\nEver bound in the prisons,\nUnceasing day and night.\nWe now offer aid,\nWishing them rebirth.\nWith focused minds we take refuge in the Heavenly Worthy of inexhaustible Dao-power.\nWith focused minds we take refuge in the Heavenly Worthy of boundless mysterious penetration.\nWith focused minds we take refuge in the Heavenly Worthy who eliminates karmic offenses.",
      "start_char": 1349,
      "end_char": 2764,
      "start_sentence": 74,
      "end_sentence": 168,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.042659282684326,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上消灭地狱升陟天堂忏.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "楚痛地狱，钉身锯解。 断截地狱，铁网肢节。 分离地狱，火坑炮炙。 猛烈地狱，刀兵爪距。 搏撮地狱，虎狼鹰犬。 残害地狱，吞啖铁丸。 消烂地狱，暗冥肉山。 斩锉地狱，洋铜饮铁。 烂溃地狱，咸水寒冰。 坼裂地狱，大铁围山门地狱，小铁围山门地狱，铁马铁牛地狱，铁驴铁鸟地狱，铁山铁屋地狱，铁车铁衣地狱，飞刀掣电地狱，解身爪头地狱，八寒八极地狱，两舌两石地狱，然手烧脚地狱，剥皮饮血地狱，粪尿地狱，鲙肉地狱，( )鏫地狱，崩埋地狱，阿波波地狱，阿婆婆地狱，阿咤咤地狱，阿罗罗地狱。 如是焦熬猛焰，凛冽寒冰，不以忏扬，难蠲罪业。 遂乃用依科教，俯伏道缘，启今晨香火之功，为曩劫河源之苦，拯昏冥於九夜，拔楚痛於八门。 念岱岳之悲哀，辟酆都之壅滞，觊期睿力，获沐灵慈。 以今运心，谨当作礼。 志心归命，蠲消宿业天尊。 志心归命，超拔沈魂天尊。 志心归命，断灭三恶天尊。 志心归命，出陟九幽天尊。 志心归命，蓬莱化迹天尊。 志心归命，昆阆飞身天尊。 志心归命，冲升鳌岛天尊。 志心归命，缘会麟洲天尊。 志心归命，无所不度天尊。 志心归命，有念皆通天尊。 志心归命，大慈大悲救苦真人。 志心归命，大慈大悲拔难真人。 志心归命，大慈大悲灭罪真人。 志心归命，大慈大悲度厄真人。 复忏诸大地狱，诸大鬼牢，七重铁城，七重铁网，有牛头狱卒，六十二眼而八头，一十八角而九尾，手中执其铁戟，目中放其铁丸，罪人从顶而穿，从足而出，痛连骨髓，苦切心肝，求生不生，求死不死。 石磨而轮回历劫，铁碓而上下无时，烟火交飞，鸟兽击搏。 悉是恶道所感，皆由宿业所招。 不睹三光，不识三宝。 於是元始天尊告曰：若能缮写斯经，葆称其旨，静念而建坛立像，志心而行道散花，当遣金刚神王、天丁力士、三界五帝、一切众灵，大布慈悲，广臻福祉，回骸起死，炼质成真。 慈光俯鉴於有情，玄造遍施於无碍。 琼钟扣处，尽开利济之门； 玉磬锵时，悉导宣扬之路。 赖其九清妙范，托乎十洞真诠。 冰庭而变作瑶地，火屋而化为宝地。 锋摧剑树，刃断刀山。 当令长夜之沈沦，尽遂今朝之解脱。 收经 闻经得道，随念往生。 无尽玄功，无边睿爱。 复原解分宿对，缘会当来。 所堕三涂，悉蠲八难。 闻经得道，随念往生。 无量洪因，无涯圣槩。 复愿潜停轮转，永断牵缠。 恶趣腾辉，死魂受炼。 闻经得道，随念往生。 无极良因，无穷妙力。 复愿四司无滞，九署潜通。 魂度朱陵，神游紫府。 以今忏扬已蒇，礼念将周。 各拥慈云，同超净域。 遂得霓幢接步，羽驾来仪。 飞陟太虚，逍遥极乐。 叹经 详夫上品玄科，中天宝藏，列凤篆龙章之迹，缀飞云垂露之文。 功乃变通，力能升进。 是故因经所以明道，因道所以立经。 苟无敷诵之勤，焉解萦缠之道。 受罪之含齿被发，衔冤之插羽披毛，莫不水火风刀，轮回生死，会翕张於阴府，当拷讯於玄司。 是用荐资，将伸忏拔。 伏惟侍香金媛、典经玉郎，上启八门，下通五户，演死魂生身之仙品，腾神公受命之灵音。 能令归向者，开泰仙都； 谛听者，超凌恶趣。 息爱河之波浪，设苦海之舟航。 广布法桥，俱跻道岸。 速奉霓旌羽节，常陪鹤驭鸾舆。",
      "translated_text": "The **Torture Hell**, where bodies are nailed and sawn asunder.\nThe **Severing Hell**, where iron nets rend limbs from joints.\nThe **Parting Hell**, where fire pits roast and sear.\nThe **Fierce Hell**, where blades and claws rend flesh.\nThe **Grappling Hell**, where tigers, wolves, eagles, and hounds maul.\nThe **Mutilation Hell**, where iron pellets are swallowed and devoured.\nThe **Festering Hell**, where dark mountains of rotting flesh rise.\nThe **Hacking Hell**, where molten bronze is drunk and molten iron imbibed.\nThe **Dissolving Hell**, where brine and freezing ice corrode.\nThe **Splitting Hell**, where the **Great Iron Enclosure Mountain Gate Hell** and the **Lesser Iron Enclosure Mountain Gate Hell** stand;\nthe **Iron Horse Iron Ox Hell**, the **Iron Donkey Iron Bird Hell**,\nthe **Iron Mountain Iron Chamber Hell**, the **Iron Chariot Iron Armor Hell**,\nthe **Flying Blades and Lightning Hell**, the **Dismembered Body and Severed Head Hell**,\nthe **Eight Cold and Eight Extreme Hells**, the **Two-Tongued and Two-Stone Hell**,\nthe **Burning Hands and Scorching Feet Hell**, the **Flayed Skin and Blood-Drinking Hell**,\nthe **Excrement and Urine Hell**, the **Minced Flesh Hell**,\nthe **( ) Cauldron Hell**, the **Collapsing and Burial Hell**,\nthe **Apapa Hell**, the **Apopo Hell**,\nthe **Atata Hell**, the **Arara Hell**—\nsuch are the searing flames and fierce fires,\nthe biting cold and freezing ice.\nWithout repentance and recitation, sin and karma cannot be purged.\n\nThus, in accordance with the teachings and rites,\nwe bow in submission to the Dao’s conditions,\ninvoking this morning’s incense and flame,\nto relieve the suffering of past kalpas and distant origins,\nto rescue the benighted from the nine nights,\nto extricate the tormented from the eight gates.\nMoved by the sorrow of Mount Tai,\nwe break the stagnation of Fengdu,\nhoping for the enlightened power’s grace,\nto bathe in the radiance of divine compassion.\n\nNow, with focused intent, we perform the rites.\nWith sincere devotion, we take refuge in the **Heavenly Worthy who Eradicates Past Karma**.\nWith sincere devotion, we take refuge in the **Heavenly Worthy who Delivers Sunken Souls**.\nWith sincere devotion, we take refuge in the **Heavenly Worthy who Severs the Three Evils**.\nWith sincere devotion, we take refuge in the **Heavenly Worthy who Ascends the Nine Dark Realms**.\nWith sincere devotion, we take refuge in the **Heavenly Worthy of Penglai’s Transformed Traces**.\nWith sincere devotion, we take refuge in the **Heavenly Worthy of Kunlun’s Soaring Form**.\nWith sincere devotion, we take refuge in the **Heavenly Worthy of Ascending Ao Island**.\nWith sincere devotion, we take refuge in the **Heavenly Worthy of Linzhou’s Karmic Convergence**.\nWith sincere devotion, we take refuge in the **Heavenly Worthy who Delivers All Without Exception**.\nWith sincere devotion, we take refuge in the **Heavenly Worthy who Answers Every Prayer**.\nWith sincere devotion, we take refuge in the **Perfected One of Great Compassion and Great Mercy, Savior from Suffering**.\nWith sincere devotion, we take refuge in the **Perfected One of Great Compassion and Great Mercy, Deliverer from Tribulation**.\nWith sincere devotion, we take refuge in the **Perfected One of Great Compassion and Great Mercy, Eradicator of Sin**.\nWith sincere devotion, we take refuge in the **Perfected One of Great Compassion and Great Mercy, Liberator from Calamity**.\n\nWe further repent before all the great hells,\nthe great ghostly prisons,\nthe sevenfold iron cities,\nthe sevenfold iron nets,\nwhere ox-headed jailers stand—\nsixty-two eyes and eight heads,\neighteen horns and nine tails,\nbrandishing iron halberds in their hands,\nshooting iron pellets from their eyes.\nSinners are pierced from crown to sole,\npain searing bone and marrow,\nagony piercing heart and liver,\nbegging for life yet denied,\npleading for death yet withheld.\nGround by stone mills through kalpas of rebirth,\npounded by iron pestles without respite,\nsmoke and fire intertwine,\nbirds and beasts strike and maul.\nAll this is the retribution of evil paths,\nthe summons of past karma.\nDeprived of the Three Lights,\nunaware of the Three Treasures.\n\nThen the **Primordial Heavenly Worthy** declared:\nIf one copies this scripture,\ncherishes its meaning,\nquietly recites and establishes altars with images,\ndevoutly practices the Dao and scatters flowers,\nthen the **Vajra Divine Kings**, the **Heavenly Soldiers and Mighties**,\nthe **Five Emperors of the Three Realms**, and all spirits\nwill widely bestow compassion,\nabundantly bring blessings,\nrestore bones to life,\nrefine form into truth.\nMerciful light will gaze upon the sentient,\nmysterious creation will pervade the unbounded.\nWhere jade bells chime, gates of salvation open;\nwhen jade chimes resound, paths of proclamation unfold.\nRelying on the wondrous model of the Nine Heavens,\nentrusted to the true teachings of the Ten Caves,\nice courts transform into jade lands,\nfire chambers become treasure realms.\nSword trees shatter, blade mountains break.\nThus, the long-night’s sinking shall all attain this morning’s liberation.\n\nThe Scripture concludes:\nThose who hear the scripture and attain the Dao shall follow their thoughts to rebirth.\nBoundless mysterious merit,\nlimitless enlightened grace.\nMay past enmities dissolve,\nand future karmic ties converge.\nMay the three evil paths be purged,\nthe eight difficulties averted.\nThose who hear the scripture and attain the Dao shall follow their thoughts to rebirth.\nImmeasurable virtuous causes,\ninexhaustible sacred power.\nMay the cycles of rebirth cease,\nentanglements forever severed.\nMay evil destinies brighten,\nlost souls be refined.\nThose who hear the scripture and attain the Dao shall follow their thoughts to rebirth.\nInfinite good roots,\nunfathomable wondrous force.\nMay the Four Offices flow without obstruction,\nthe Nine Bureaus silently connect.\nMay souls ascend the Vermilion Mound,\nspirits wander the Purple Palace.\n\nNow that repentance is complete and rites concluded,\neach enveloped in clouds of compassion,\nwe ascend together to the pure realm.\nThus, rainbow banners guide our steps,\nfeathered chariots arrive in splendor.\nWe soar into the great void,\ncarefree in the realm of ultimate bliss.\n\n**Praise of the Scripture:**\nBehold the wondrous canon of the highest rank,\nthe treasure trove of the central heavens,\ninscribed with phoenix scripts and dragon seals,\nadorned with soaring clouds and dewdrop characters.\nIts merit transforms and transcends,\nits power elevates and advances.\nThus, the scripture clarifies the Dao,\nand the Dao establishes the scripture.\nWithout diligent recitation,\nhow can the bonds of entanglement be undone?\nThose who bear sins—teeth bared, hair unbound—\nthose who harbor grievances—feathered and furred—\nall endure water, fire, wind, and blades,\nrevolving through birth and death,\ngathering and dispersing in the netherworld,\nfacing interrogation in the dark courts.\nTherefore, we offer these resources,\nextending repentance and deliverance.\n\nWe humbly invoke the **Golden Maidens of Incense** and the **Jade Lads of Scriptures**,\nwho open the eight gates above,\nconnect the five portals below,\nproclaiming the immortal ranks of reborn souls,\ntransmitting the divine decrees of appointed spirits.\nThey enable those who turn toward them to enter the blessed immortal realms,\nthose who listen attentively to transcend the evil destinies.\nThey calm the waves of the River of Love,\nprovide the ferry across the Sea of Suffering.\nThey widely lay the Dharma bridge,\nguiding all to the Dao’s shore.\nSwiftly, we attend the rainbow banners and feathered regalia,\nforever accompanying the crane-drawn and phoenix-borne chariots.",
      "overlap_context": "s of the Dharma, they soar afar through the three realms.\nMay it be that grace descends from above,\nExtending even to the hidden souls.\nWe now earnestly contemplate the Dao altar,\nRepenting and removing the knife mountains and sword trees of hell,\nFreeing them from the boiling cauldrons and furnace coals of hell.\nThe hells of scorching iron beds and copper pillars,\nThe hells of searing flames,\nThe hells of wheeling fire chariots and blade wheels,\nThe hells of thunderous plows and tongue-ripping.",
      "start_char": 2764,
      "end_char": 4035,
      "start_sentence": 169,
      "end_sentence": 238,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.430561542510986,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上消灭地狱升陟天堂忏.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "徘徊於七宝经台，娱乐於三清洞阙。 九华韵阕，万石声和。 既荷玄慈，成归妙道。 谨值朝修之际，得以香火之余。 伏为上代祖宗，未能迁适； 近亡姻眷，尚在幽冥。 乞使抹破罪书，扫除恶迹，遂果韩司拯度，获承酆都开通，齐朝极乐之天，各会往生之府。 窃念臣等所造粗心恶迹，致涉因依。 凡贪爽口肆，情有伤物。 命为生前之结衅，当命尽之报身。 不修忏赎之门，难解萦仍之路。 衔冤负债，悉觊逍遥。 羽族毛群，咸蒙通变。 忏涤有感昭之力，身口无挂碍之虞。 恭惟金阙慈尊、玉京上圣，广开愍恻，特纳虔祈。 俾令返朴之时，无经八障； 还淳之旦，不历三涂。",
      "translated_text": "Amidst the seven-jeweled sutra platforms they wander and delight,\nin the three-pure grotto-palaces they find joy.\nThe nine-flowered melodies conclude,\nthe myriad stones’ voices harmonize.\nHaving received the profound compassion,\nthey accomplish return to the wondrous Dao.\n\nNow, at this dawn observance,\nwith the remnants of incense and flame,\nwe humbly pray for our ancestors of former generations,\nwho have not yet ascended;\nfor our recently departed kin,\nstill dwelling in the nether darkness.\nMay their sin-records be erased,\ntheir evil traces swept away,\nso they may swiftly be delivered by the Han Bureau,\ngranted passage through the open gates of Fengdu.\nTogether they ascend to the heavens of utmost bliss,\neach gathering in the realms of rebirth.\n\nWe reflect upon our own coarse and careless transgressions,\nwhich have entangled us in karmic bonds.\nAll greed for savor that harms,\nall passions that wound living things—\nthese become knots of enmity in life,\nand when life ends, the retribution body bears them.\nWithout the gate of repentance and redemption,\nthe path of entanglement remains unsolved.\nBearing grievances and debts,\nall long for freedom.\nFeathered flocks and furred herds,\nall receive transformation.\nThe power of repentance and purification shines forth,\nso body and speech are free from hindrance.\n\nReverently we invoke the Compassionate Venerables of the Golden Towers,\nthe Supreme Sages of the Jade Capital,\nwho widely open their mercy,\nand specially accept our earnest prayers.\nMay the time of returning to simplicity\npass without the eight obstructions;\nmay the dawn of restoring purity\nnot traverse the three paths.",
      "overlap_context": "l ranks of reborn souls,\ntransmitting the divine decrees of appointed spirits.\nThey enable those who turn toward them to enter the blessed immortal realms,\nthose who listen attentively to transcend the evil destinies.\nThey calm the waves of the River of Love,\nprovide the ferry across the Sea of Suffering.\nThey widely lay the Dharma bridge,\nguiding all to the Dao’s shore.\nSwiftly, we attend the rainbow banners and feathered regalia,\nforever accompanying the crane-drawn and phoenix-borne chariots.",
      "start_char": 4035,
      "end_char": 4283,
      "start_sentence": 239,
      "end_sentence": 255,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.580172777175903,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上消灭地狱升陟天堂忏.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "九景台前，乘风御气； 五明宫内，会道合真。 白简上生，三十二天之赤书受命； 黄箓削死，百二十曹之黑籍勾名。 已往沾恩，见存获庆。 建一百紫虚之圣号，应万重丹汉之宸聪。 钿轴启时，更助修持之力； 灵文诵处，当伸朝礼之心。 宝香不断於二时，慧炬常然於午夜。 无尽妙善，无量胜因。 大启归依，广伸忏悔。 太上消灭地狱升陟天堂忏竟",
      "translated_text": "Before the Nine-Splendor Terrace, riding the wind and commanding qi;\nWithin the Five-Luminance Palace, meeting the Dao and uniting with the Real.\nOn white tablets, ascending to life—\nthe thirty-two heavens’ red writ confers destiny;\nOn yellow registers, erasing death—\nthe hundred-twenty bureaus’ black ledgers strike out names.\nThose past receive grace,\nthose present gain blessings.\nEstablishing the hundred sacred titles of Purple Emptiness,\nthey respond to the myriad layers of the cinnabar heavens’ divine wisdom.\nWhen the jeweled scroll unfurls,\nit further strengthens the power of cultivation;\nWhere the numinous scripture is recited,\nthere arises the heart of dawn reverence.\nPrecious incense unceasing through the two watches,\nwisdom torches ever-burning through midnight.\nBoundless wondrous goodness,\nmeasureless supreme causes.\nGreatly opening the gate of refuge,\nwidely extending repentance.\nThe *Highest’s Repentance for Eliminating Hell and Ascending to Heaven* is now complete.",
      "overlap_context": "ng for freedom.\nFeathered flocks and furred herds,\nall receive transformation.\nThe power of repentance and purification shines forth,\nso body and speech are free from hindrance.\n\nReverently we invoke the Compassionate Venerables of the Golden Towers,\nthe Supreme Sages of the Jade Capital,\nwho widely open their mercy,\nand specially accept our earnest prayers.\nMay the time of returning to simplicity\npass without the eight obstructions;\nmay the dawn of restoring purity\nnot traverse the three paths.",
      "start_char": 4283,
      "end_char": 4437,
      "start_sentence": 256,
      "end_sentence": 267,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.023211002349854,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上消灭地狱升陟天堂忏.txt",
        "category": "威仪类"
      }
    }
  ]
}