{
  "source_id": "太上老君大存思图注诀",
  "source_file": "chunked_daozang\\太上老君大存思图注诀.json",
  "total_chunks": 7,
  "total_original_chars": 6638,
  "total_translated_chars": 38886,
  "total_translation_time": 183.38011264801025,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\太上老君大存思图注诀.txt",
    "category": "方法类"
  },
  "full_translation": "**The Supreme Lord Lao’s Great Visualization Chart with Annotated Instructions**\n\n**Title:** *The Supreme Lord Lao’s Great Visualization Chart with Annotated Instructions*. Author unknown, approximately dated to the Northern and Southern Dynasties. Originally one fascicle, divided into eighteen sections; now ten sections survive. Base text from *Zhengtong Daoist Canon*, *Dongshen* Section, Methods Category. Reference: *Yunji Qiqian*, Scroll 43.\n\n**The Supreme Lord Lao’s Great Visualization Chart with Annotated Instructions**\n\nVisualize the five viscera, the five sacred mountains, the five stars, the five emperors, and the golden radiance of the five-colored halo.\n\nFirst visualize the Three Masters, then proceed to see the five viscera, the five sacred mountains, the five stars, and the five emperors.\n\nThe four preceding conditions guard the body within, wherein transformations occur without limit. As for drawing the chart, no method suffices to encompass all; thus, external symbols mark the directions, clarifying positions before speech. Do not rigidly adhere to progression.\n\nThe golden radiance forms one body, manifesting in five colors, emerging from behind the lungs. The nape bears a halo like the sun’s image.\n\nThe three preceding conditions reside within the body, illuminating the ten directions. Together with the four above, these seven conditions take the following forms:\n\nWhenever visualizing, close the eyes and look inward. The human body contains many spirits, but the five viscera serve as the foundation. Each governs its affairs, and each affair achieves its completion. Completion in correctness unifies without division; undivided, the hidden and manifest remain free from deviation. Without deviation, all wonders become visible; seeing wonders, one aligns with the sagely talisman. Aligning with the sagely, one may then accumulate learning extensively, naturally achieving resonance.\n\nThus, morning and evening visualization must not be neglected. What is *cun* (visualization)? It is *dun* (sincerity) and *lun* (revolving). What is *si* (contemplation)? It is *si* (overseeing) and *si* (continuing).\n\nDo not, through frivolity and impatience, lose the root of learning. Learning, through gravity and depth, attains the宗 (origin). Attaining the origin, circulation proceeds without obstruction; unobstructed, visualization endures without loss. Endurance arises from overseeing good and evil. Good and evil lie in the bias of desires. Bias arises from desires, loves, and hates, wavering in hesitation. The cycle of life and death, toil and suffering, never ceases. To cease this ceaselessness, cease attachment to goodness. The goodness of attachment to goodness has yet to return to the origin. Reaching the origin, the non-existent relies on念 (thought). Thoughts follow one another in succession, continuing contemplation and sustaining visualization. Without entering into questioning, acting without action yet accomplishing all—this is called subtle, wondrous, and profoundly penetrating. Harmonizing light while subduing sharpness, it delivers boundlessly.\n\nThus, the foundation of learning takes visualization as its foremost practice, and the efficacy of visualization culminates in the five viscera. What are the *zang* (viscera)? They are *cang* (storing), *cheng* (completing), concealing spirit and hiding wisdom without ostentation. When wisdom manifests and desires stir, stirring leads to brilliance; brilliance leads to ruin, while concealment leads to completion. Shining without brilliance, wisdom stills and spirit congeals. Desires are eliminated, and within, purity arises—like jade within a mountain, inwardly luminous. Attaining this supreme principle, one achieves longevity and enduring vision.\n\n**First, visualize the lungs:** red and white in color, seven lobes—four long, three short—connected below the throat.\n\nWhat are the lungs? They are *chu* (restraining) and *fa* (striking). At the inception of good and evil, signs are yet unclear. Clarifying goodness strikes evil; clarifying evil strikes goodness. When goodness decays and evil flourishes, the root of life is struck. Whether the root severs or endures depends on this viscus.\n\nThis viscus stores the *po* (corporeal soul). What is the *po*? It is *po* (dregs) and *zhuo* (attachment). Human ostentation invariably relates to desire. Desire’s attachment is evil; evil resembles dregs. The foolish and vulgar cling to it, unaware of the essence of emotion. Now, wishing to mark and attach, visualize to perceive it. The *po* then becomes solemn, no longer capable of evil. Evil must be urgently discarded; thus, it is visualized first.\n\nFire and metal unite, success and failure yet undetermined. Their color is red and white; the number of lobes corresponds to speech, embodying harmonious completion of virtue. Virtue begins in the lungs and ends in the spleen. The spleen is one yet also two, encompassing equilibrium. Equilibrium embodies trust.\n\n**Second, visualize the heart:** like a closed lotus bud or a suspended red oil sac, three inches long, located before the lungs.\n\nWhat is the heart? It is *shen* (profound) and *zhen* (measuring).\n\nThe right and wrong remain undiscerned; weigh and measure with care. Failure leads to self-destruction, while success brings the Dao. The depth of fortune and misfortune lies within this organ.\n\nThis organ stores *shen*. What is *shen*? It is *extension* and *truth*, the sovereign of wisdom. When constrained, it can extend. Visualize to perceive it, and *shen* then congeals, recognition stabilizes into truth, and one cannot be deeply burdened.\n\n**Third, visualize the liver:** a deep purple hue, with five lobes—three long and two short—nine inches in length, located below the heart.\n\nWhat is the liver? It is *dryness* and *return*. Awakening to evil and correcting it, determination becomes unshakable. Practicing goodness and establishing merit, one acts with diligence. Discerning correctness and returning to the origin depend on this organ.\n\nThis organ stores the *hun*. What is *hun*? It is *abundance* and *reversion*. Amidst the tumultuous sea of the vulgar, it reverts toward the gate of the Dao. Visualize to perceive it, and *hun* then rejoices, urging progress and establishing merit, perpetuating virtuous deeds.\n\n**Fourth, visualize the kidneys:** a lustrous dark hue, like an inverted pair of lacquered cups, five inches long, flanking the spine and attached to the back.\n\nWhat are the kidneys? They are *tension* and *moisture*. Practicing goodness with tension, one dares not be negligent. Moisture is inexhaustible, aiding and delivering without limit, bridging the Dao and the vulgar—this depends on this organ.\n\nThis organ stores *jing*. What is *jing*? It is *clarity* and *numinosity*. Moving with gradual clarity, it transforms without obstruction. The numinous comes and goes, bearing the empty extreme. Visualize to perceive it, and *jing* then becomes serene, not dissipating or leaking.\n\n**Fifth, visualize the spleen:** yellow and dark, twelve inches long, with a one-foot curved *yu* (granary) at its center, above the stomach.\n\nWhat is the spleen? It is *support* and *transference*. Clear and congealed, it silently moistens, nourishing all. At rest, it can transfer; transferring, it does not deplete. Thus, the curve is completed within this organ.\n\nThis organ stores *zhi*. What is *zhi*? It is *ultimacy* and *distinction*. Profoundly moistening and secretly transforming the coarse and vulgar into the extraordinary, visualize to perceive it, and the efficacy in governing the vulgar is verified. *Zhi* then becomes profound, reaching the Dao.\n\nNext, contemplate the Five Peaks.\nWhat are the Peaks? They are *doubt* and *awakening*. Firmly settled and unshakable, their movement and transformation align with the Dao, awakening those lost in dreams. Scholars emulate them, hence the contemplation follows.\n\nContemplating the Peaks’ proper alignment within the organs refines this fleshly form into vajra.\n\n**First, visualize Mount Tai, the Eastern Peak,** properly situated in the east.\nWhat is the east? It is *youth* and *movement*. Moving to cultivate the correct Dao, its source becomes clear and pure—thus, the qi of this direction is clear. Its colors are mostly green; green spring governs *ren* (benevolence). The stirring of life should be cherished. Visualize it within the liver. With the liver free from calamity and stagnation, one preserves longevity. Life is the origin, hence it is visualized first.\n\n**Second, visualize Mount Heng, the Southern Peak,** properly situated in the south.\nWhat is the south? It is *capacity* and *reception*. When the season arrives, one’s conduct is capable and can be entrusted, broadly able to contain—thus, the qi of this direction is abundant. Its colors are mostly red; red summer governs *li* (propriety). Great affairs should be illuminated. Visualize it within the heart. With the heart free from calamity and stagnation, one preserves constant peace.\n\n**Third, visualize Mount Song, the Central Peak,** properly situated in the center.\nWhat is the center? It is *work* and *harmony*. What is *yang* (center)? It is *constancy* and *measure*. Revolving endlessly, its body is empty and attains the extreme—thus, the qi of this direction is harmonious. Its colors are mostly yellow; central correctness is without deviation, circulating without exhaustion, responding to all stimuli. Thus, yellow autumn governs *xin* (trust), encompassing essential density. Visualize it within the spleen. With the spleen free from calamity, one preserves eternal stability.\n\n**Fourth, visualize Mount Hua, the Western Peak,** properly situated in the west.\nWhat is the west? It is *chill* and *equilibrium*. The wife is earnest and pure, inner and outer equally immaculate—thus, the qi of this direction is fierce. Its colors are mostly white; white autumn governs *yi* (righteousness). Virtuous conduct should be comprehensive. Visualize it within the lungs. With the lungs free from calamity and stagnation, one preserves completion.\n\n**Fifth, visualize Mount Heng, the Northern Peak,** properly situated in the north.\nWhat is the north? It is *submission* and *blessing*. Movement reaches its extreme and returns to stillness; regulation is inexhaustible. Exhaustion enables transformation, and myriad blessings are ever-renewed. Renewal is as if not renewed, subtly wondrous and profoundly mysterious—thus, the qi of this direction is gentle. Its colors are mostly black; black winter governs *zhi* (wisdom). Wisdom universally aids and delivers. Visualize it within the kidneys. With the kidneys free from calamity and stagnation, one preserves constant joy.\n\nNext, contemplate the Five Stars.\nWhat are the Stars? They are *essence* and *life*. Essence emerges from the obscure, manifesting in form, loosening all stagnation, and aiding longevity. The vajra’s utmost essence unites with *shen*.\n\n**First, visualize Mars, the Blazing Deluder Star,** above the Southern Peak.\nIts color is red; its essence is vermilion.\nWhat is *ying* (blazing)? It is *restraint* and *dazzlement*.\nWhat is *huo* (delusion)? It is *martial* and *predatory*.\nDesire stirs and dazzles; governance falters, and predation harms. It is named the lord of chaos; chaos must be urgently governed. First, visualize to perceive it. To speak of chaos is to stabilize it. Once chaos is stabilized and made manifest, trust becomes evident, righteousness becomes clear, clarity enters wisdom, and wisdom enables enduring preservation.\n\n**Second, visualize Saturn, the Quelling Star,** above the Central Peak.\nIts color is yellow; its essence is radiant.\nWhat is *zhen* (quelling)? It is *trust* and *stability*. Its radiance is resplendent; inner and outer affairs are settled. The four directions do not transgress; trust has its subtlety.\n\n**Third, visualize Venus, the Grand White Star,** above the Western Peak.\nIts color is white; its essence is pure.\nWhat is *tai* (grand)? It is the greatest of the great.\nWhat is *bai* (white)? It is *luminous* and *restrained*.\nLuminous and restrained, it can receive all hues. When all hues attain it, they become distinctly manifest. Applied as appropriate, none can surpass it—hence it is called *Tai Tai*, surpassing all names.\n\n**Fourth, visualize Mercury, the Chronographic Star,** above the Northern Peak.\nIts color is black; its essence is profound.\nWhat is *chen* (chronographic)?\n\nProfound, authentic, and latent.\nLatent yet aptly established, beginning and end without flaw, untarnished by defilement—this is the stillness of wisdom.\n\n**Fifth, visualize Jupiter, the Year-Star,** above the Eastern Peak.\nIts color is azure; its essence is verdant.\nWhat is *sui* (year)?\nIt is *boundary* and *fulfillment*.\nDiscarding the old and embracing the new, exhausted yet able to penetrate, through boundaries it meets again, thus accomplishing its work.\n\nNext, visualize the Five Thearchs:\nWhat is *di* (thearch)?\nIt is *discernment* and *attainment*.\nThe sincerity of refined authenticity gives rise to this spirit-form. Form and spirit both wondrous, their responses are inexhaustible. Examining and reaching the ultimate origin, there is no regression.\n\n**First, visualize the Yellow Thearch.**\nWithin the Saturn-star, descending to hover above the Central Peak.\nIt proclaims and regulates the spleen’s *qi*, connecting human aspirations.\nPalaces of towering cliffs, halls of seven treasures, robes and feathered regalia, attendants with parasols, civil and martial retinues with music—all hues are predominantly yellow. Desires and vows seek verification; transformations await confirmation. Thus, first visualize it, for sincerity is the master.\n\n**Second, visualize the White Thearch.**\nWithin the Venus-star, descending to roam above the Western Peak.\nIt proclaims and regulates the lung’s *qi*, dispelling human stagnation.\nPalaces of towering cliffs, halls of seven treasures, robes and feathered regalia, attendants with canopies, civil and martial retinues with music—all hues are predominantly white.\n\n**Third, visualize the Black Thearch.**\nWithin the Mercury-star, descending to traverse the Northern Peak.\n\nIt proclaims and regulates the kidney’s *qi*, nourishing human essence.\nPalaces of towering cliffs, halls of seven treasures, robes and feathered regalia, attendants with canopies, civil and martial retinues with music—all hues are predominantly black.\n\n**Fourth, visualize the Azure Thearch.**\nWithin the Jupiter-star, descending to traverse the Eastern Peak.\nIt proclaims and regulates the liver’s *qi*, encouraging human goodness.\nPalaces of towering cliffs, halls of seven treasures, robes and feathered regalia, attendants with canopies, civil and martial retinues with music—all hues are predominantly green.\n\n**Fifth, visualize the Vermilion Thearch.**\nWithin the Mars-star, descending to advance upon the Southern Peak.\nIt proclaims and regulates the heart’s *qi*, stabilizing human spirit and wisdom.\nPalaces of towering cliffs, halls of seven treasures, robes and feathered regalia, attendants with canopies, civil and martial retinues with music—all hues are predominantly red.\n\nNext, visualize the golden radiance enveloping the body:\nBehold the luminous forms of the Five Thearchs, guarding within the body, their five stellar colors flying and covering the exterior.\nMars hovers above the head, Mercury rests before the heart, Jupiter stands between the knees, Saturn at the left elbow, Venus at the right shoulder—light and color intermingling, blending into a golden radiance.\nWhat is this radiance? It is vastness, a mirror.\nWhat is this gold? It is resilience, reverence.\nThe body assumes a golden-purple hue, the spirit’s *qi* pure and harmonious, vast and profoundly still, bright as a flawless mirror. Resilient and firm, it severs doubt and dispels evil, elevating the ordinary to sagehood.\n\nNext, visualize the body manifesting five colors:\nWhat are these colors? They are discernment, recognition.\nSubtle *qi* responds to perception, dispelling delusion; delusion yields to truth, exposing falsehood. Once false colors are discarded, true colors naturally emerge. Through refinement and transmutation, the weak are tempered, and sagehood is attained.\n\nFirst, behold white *qi* issuing from the lungs; second, red *qi* from the heart; third, green *qi* from the liver; fourth, yellow *qi* from the spleen; fifth, black *qi* from the kidneys.\nPreviously seen were the radiant stellar forms of the Five Thearchs, coalescing into golden radiance. Now, the five *qi* of the five viscera emerge in sequence, ascending to the head, revolving in five colors, crowning and enveloping the body, thick and misty, as if immersed in dense smoke.\n\nNext, visualize a halo around the neck:\nThe body has transformed into a golden-purple hue, further enveloped by the revolving five *qi*, resplendent in majesty. A halo arises around the neck, encircling above and below, luminous and blazing, illuminating the ten directions.\nIt dissolves all evil, penetrating within and without, leaving no blemish of impurity. The radiant spirit is undivided; the Dao is one.\n\nUpon completing the visualization, pay homage to the ten directions, then to the true scriptures and perfected beings, saying: When bowing to the scriptures, focus the mind on the Most High Lord Lao, offering three bows. Next, invoke Master Yin and the Perfected One of the River’s Edge, along with the Master of the Mystic Teachings, and bow three more times. Thirty-six thousand immortal youths and jade maidens constantly attend the scriptures, burning incense on behalf of the practitioner to seek the Dao of ascending to heaven in broad daylight.\n\n**Seated Morning Visualization**\nSeated morning practice entails sitting upright to perform the rites. If public or private affairs obstruct, or if one finds oneself among those of different inclinations, one may not bow fully in the hall—simply sit composed, concealing the practice from others. Incense and offerings need not be avoided; they may be used discreetly. Even if others mock, one may omit the rites, taking care not to offend their sensibilities or exacerbate their faults. From dawn to dusk, perform the practice at the proper times. When making daytime invocations, it is also fitting to sit calmly, maintaining an ordinary demeanor without altering one’s appearance, so that those of different inclinations remain unaware. If others notice and approve, one may guide them; if they scorn or slander the true and upright, they bring misfortune upon themselves and corrupt their own cultivation. The ancients studied the Dao for themselves; today, many study it for others. Those who practice for others seek to please, disregarding the falsity in their hearts. Those who practice for themselves focus on sincerity—whether adhering or deviating, the heart remains the source. The more one strives to subdue others without true intent, the more futile the effort, and the greater the transgression. Those who study the true Dao must each deepen their sincerity. Sincerity values timely convergence, and timing values harmonious union. If the union is not virtuous, one should not converge at that time. Convergence must bring mutual benefit, aiding both others and oneself. Virtue and virtue align; abandoning evil, one ascends as an immortal. Abandoning evil to ascend as an immortal is the purpose of convergence. Converging with evil leads to ruin, where names and realities diverge. In one’s conduct and circumstances, two afflictions may arise: the first is mental stagnation, the second is clinging to the near. For those who cling to the near, transform them through the method of the heart. For those with stagnant minds, guide them through the method of proximity. Neither heart nor proximity should be biased; transform clinging and guide stagnation. When both afflictions are dispelled, the Dao of the highest sages is attained.\n\nWhen traveling through mountains and waters, or spending days in boats and carriages, whether in transit or at rest, whether walking, climbing, or lodging, whenever weary and pausing to rest, perform the visualization rites at the proper times. Adapt to concealment or openness as circumstances allow, and concentrate the visualization with precision. Naturally, fatigue will be forgotten, and demonic or malevolent people will not dare to disturb. When reciting scriptures and observing precepts, conduct oneself with virtue. If one’s conduct lacks virtue, precepts are broken and scriptures violated. Even if one performs the rites, the true will not be perceived. Jealous ghosts and malevolent spirits, along with wicked people and harmful things, will clash and provoke one another, giving rise to afflictions and disasters, leaving no peace even when seated outside. Swiftly visualize the Nine Practices to regulate the body. With the heart focused and the mouth reciting, understand clearly without doubt. Stabilize the Three Actions, and once they are settled, all disasters will dissolve. People and ghosts will revere and submit, safeguarding one’s comings and goings, movements and stillness, ensuring steadfast good fortune.\n\nThe Nine Practices are found in the *Xianger Commentary*, and the Three Actions follow the *Mingwei Sutra*. Those who practice visualization must urgently recall them, as outlined below:\n\nPractice non-action; practice gentleness and weakness; practice holding to the feminine, never moving first. These are the first three practices.\nPractice namelessness; practice purity and integrity; practice all virtues. These are the middle three practices.\nPractice desirelessness; practice knowing when to stop and be content; practice yielding and deference. These are the last three practices.\n\nThe first: do not kill.\nThe second: do not steal.\nThe third: do not engage in licentiousness.\nThese three pertain to bodily action.\n\nThe first: do not speak falsely.\nThe second: do not use flowery speech.\nThe third: do not engage in double-tongued speech.\nThe fourth: do not use harsh language.\nThese four pertain to verbal action.\n\nThe first: do not be envious or obstructive.\nThe second: do not harbor anger.\nThe third: do not hold perverse doubts.\nThese three pertain to mental action.\n\nThe above Nine Practices and Three Actions, comprising ten matters, should always be kept in mind. In moments of alarm or peril, recall them swiftly—danger will turn to safety.\n\nFor attire, wear a jade-green cap, a blue-green robe, and a yellow garment, adapting as appropriate.\n\n**Seated and Reclining Visualization**\nThe method of reclining: do not lie flat like a corpse. Instead, lie on one side, keeping the body composed. Do not sprawl the limbs or use a high pillow—only about three inches. Make a pillow of fragrant herbs; do not use foul or rotting wood, as its cold dampness and stench will offend the *niwan* (mud-pill palace). Even when traveling and temporarily resting, one must guard against this. Upon rising from sleep, recite incantations and vows, maintaining virtuous thoughts. Visualize the morning rites at the proper time; do not omit them. If public or private affairs obstruct, repent afterward. When leaving the chamber in the morning, visualize the Jade Maiden. The Jade Maiden is the wondrous *qi* of spontaneity, taking form in response to resonance. Her form and substance are luminous and pure, clear and bright as jade, hidden yet moistening, manifest yet without perversity. As the practitioner cultivates the true, they ascend step by step. Advancement and retreat lie in form; entry and exit lie in the Dao. The *qi* of the Dao is subtle and wondrous, responding even to the finest detail. Responses unfold in order, from the humble to the exalted. Thus, in daylight, the Jade Maiden guards the palace; at night, the Maiden of the Evening attends to affairs, aiding in overcoming peril and attaining the fruition of the Dao. Wear a jade-green cap, a green robe, and a light garment, adapting the rest as appropriate.\n\nWhen leaving the chamber at dusk, visualize the Maiden of the Evening. Upon exiting, recite: \"Maiden of the Evening, communicate with the numinous.\" Before ascending to the mysterious, one must not be without practice. Practices vary in excellence, but all require a foundation. When the foundation is refined, the fruit is wondrous, and the spirit becomes unified. If the spirit is not unified, it is because the practice is not yet refined. Refine it gradually, drawing yin to aid yang. Human life resides in the yang realm; movement and stillness return to yin. Yin is the subtle mechanism of the Dao, and its responses are most wondrous. At the inception of this wondrous response, the Maiden of the Evening appears, upholding rectitude to govern perversity, harmonizing and releasing arrogance, punishing evil and protecting good. Through yin virtue, she aids yang, her luminous fame as bright as jade. She is steadfast and pure; cherish and visualize her, and attainment of the true will be swift.\n\nWhen practicing the Dao, visualize the *qi*-soldiers and cavalry. At dawn, first visualize azure clouds filling the purification hall, with blue-green dragons and lions guarding the front and rear.\n\nNext, visualize azure *qi* emerging from the master’s liver, ascending like clouds. Within this azure *qi*, blue-green dragons and lions move back and forth, covering the bodies of the disciple’s household, large and small. Divine youths and jade maidens, celestial immortals, earthbound immortals, flying immortals, the sun, moon, stars, and Five Thearchs—along with nine hundred million *qi*-soldiers and cavalry—oversee the ritual, attend to the proceedings, and arrange the officials of the Three Realms to left and right.\n\nAt the center, visualize crimson clouds filling the purification hall, with vermilion phoenixes and red birds crying out to left and right. Then visualize crimson *qi* emerging from the master’s heart, ascending like clouds. Within this crimson *qi*, phoenixes and red birds move back and forth, covering the bodies of the disciple’s household, large and small. Divine youths and jade maidens, celestial immortals, earthbound immortals, flying immortals, the sun, moon, stars, and Five Thearchs—along with nine hundred million *qi*-soldiers and cavalry—oversee the ritual, attend to the proceedings, and arrange the officials of the Three Realms to left and right.\n\nAt sunset, visualize yellow clouds filling the purification hall, with yellow dragons and yellow *lin*-beasts guarding the four directions. Then visualize yellow *qi* emerging from the master’s spleen, ascending like clouds. Within this yellow *qi*, yellow dragons and yellow *lin*-beasts move back and forth, covering the bodies of the disciple’s household, large and small. Divine youths and jade maidens, celestial immortals, earthbound immortals, flying immortals, the sun, moon, stars, and Five Thearchs—along with nine hundred million *qi*-soldiers and cavalry—oversee the ritual, attend to the proceedings, and arrange the officials of the Three Realms to left and right. The three periods of practice follow the six periods as prescribed below.\n\nAt the hour of *ren ding*, visualize white clouds filling the purification hall, with white tigers and *qi*-*lin* guarding within and without. Then visualize white *qi* emerging from the master’s lungs. There is no need to visualize the *qi*-*lin*; instead, focus on the white tiger. If visualizing the *lin*, see the white *lin* within the white *qi*, moving back and forth to cover the bodies of the disciple’s household, large and small. Divine youths and jade maidens, the sun, moon, and *qi*-soldiers follow the previous method.\n\nFor the great Yellow Register purification ritual, the three periods of practice should begin at sunset. For ordinary purifications, the three periods may begin at *ren ding*. If using *ren ding*, the visualization at sunset remains the same. However, practicing all six periods in sequence—beginning with azure, then crimson, and cycling through white—deviates from the proper method. Azure, crimson, and white each have their own distinct forms, none of which correspond to the five viscera and six bowels.\n\nAt midnight, visualize dark clouds filling the purification hall, with divine turtles and soaring serpents guarding above and below. Then visualize black *qi* emerging from the master’s kidneys, ascending like clouds. Within this black *qi*, divine turtles and soaring serpents move back and forth. Divine youths and jade maidens, the sun, moon, and *qi*-soldiers follow the previous method.\n\nAt dawn, visualize violet clouds filling the purification hall, with apotropaic lions guarding the hidden and manifest, their forms as depicted to the left. Then visualize violet *qi* emerging from the gallbladder, following the previous method.\n\nIn all visualizations of cloud-*qi*, each arises from its respective direction: azure clouds from the east, crimson clouds from the south, yellow clouds from the center, white clouds from the west, black clouds from the north, and violet clouds from above. Observe them emerging from their directions, gradually growing in abundance, thick and misty, filling the hall. Then visualize the *qi* of your own viscera emerging to merge with the clouds of corresponding colors. When *qi* and clouds unite, they become luminous, pure, fragrant, and immaculate, covering and protecting the household, the palace city, mountains, and waters—encompassing all, great and small. Divine officials and spirit-beasts align in perfect order before and behind, to left and right, within and without, above and below, hidden and manifest. In the six periods, the flourishing of numinous spirits is all-pervading.\n\nDuring the *shang jiang* lecture, sit and visualize the three colors and the Three Ones of the hun and po souls. When delivering the lecture, first visualize the three colors, then the Three Ones.\n\nThe practice has six periods, while the *shang jiang* lecture is held in three: after the morning meal, at *shang bu*, and at *ren ding*. During these three periods, enter the purification hall, take incense, bow three times, circumambulate, and return to your seat. When seated, if there is an assembly, the Dharma Master strikes the mat with a whisk and places the clapper before the knees. All close their eyes and clasp their hands firmly, visualizing azure *qi* at the head, crimson *qi* at both hands, and white *qi* at both feet. The three *qi* encircle the body, their forms as depicted to the left.\n\nVisualize the Three Ones of the hun and po souls. The Three Ones are the spirits of three regions united in one Dao. Though the Dao is fundamentally one, its responses manifest as three. Within and beyond the Three Realms, there is nowhere it is not present. It governs transformation and presides over all things, known as the Three Heavens’ Supreme. When proclaiming teachings and attending to scriptures, it is called the Three Pure Left Lords. When descending to perfect human virtue, it is named the Three Ones.\n\nThe Three Ones reside within humans, who possess three palaces: the brain is the Upper Prime Palace, its spirit named Yi; the heart is the Middle Prime Palace, its spirit named Xi; and below the navel is the Lower Prime Palace, its spirit named Wei. Each appears as an infant, all one *cun* in length. Sit in stillness, hands clasped, free from desire and action, the body devoid of all but the essential. This is what the aspirant to immortality visualizes. With prolonged and steadfast practice, spiritual penetration becomes thorough, and transformation thereafter knows no obstruction. All movements align with the Dao, the subtle is entered without fail, and the vast is encompassed without limit. It may become boundless or infinite. At the inception of observing the wondrous, one begins with the *cun*-sized form, its shape as depicted to the left.\n\nThe Perfected One says: During purification, the mind must focus on the mysterious and true, without external distractions. When thoughts turn to the scripture master, first visualize the Three Ones within their chambers, dwelling clearly and distinctly, complete with the three hun souls and seven po souls. The Great One presides over the *ni wan* palace, as in the *Hui Feng Di Yi* method. Then, together with the disciple, engage in purification and listen to the scripture. Through oral transmission and mental visualization, the Three Corpses flee, perverse *qi* is extinguished, and inner and outer receive the true. Thus, one draws near to immortality.\n\nAdditionally, practice exhalation and inhalation, guiding and harmonizing fluids, and perform the wondrous methods described above. Heavenly Perfected Ones will then descend to you. The superior adept attains the Dao within their chamber. Though dwelling in mountain caves, if even a single thread of external thought persists, it is but vain labor and wasted effort. In learning the Dao, the mind must be wholly devoted and the will resolute. The Immortals observe and test you in that very moment. Disciple, examine this carefully.\n\nWear a jade crown, a blue-green robe, and a pale yellow garment; the rest may be chosen as appropriate. When first ascending the high seat, first visualize and pay homage to the Three Worthies. Before expounding the meaning or reciting scriptures, first sit in stillness. Then rise, face the seat of the Supreme, and offer incense three times. Step back several feet, bow three times to the Three Worthies, and again visualize the scripture master, register master, and preceptor, bowing once to each—six bows in total. Then ascend the high seat, its form as depicted to the left.\n\nThe Three Worthies are the Dao-Worthy, the Scripture-Worthy, and the Perfected-Worthy. The Three Ones’ Worthiness pervades the human body. Those who wish their bodies to align with the Three Worthies must purify themselves through fasting, refine their thoughts, and perform rites of homage and visualization. Do this once daily: first descend to perform six bows, then ascend again without further bowing. Upon descending, perform two bows, knocking the forehead and reciting vows according to the proper method—those who are weak may perform the bows in their hearts.\n\nWhen ascending the high seat, visualize the attendants and guards. Settle into a composed posture, hold the scripture tablet before the heart, strike the drum thirty-six times, and swallow saliva thirty-six times. With eyes closed, envision the Azure Dragon to the left, the White Tiger to the right, the Vermilion Bird before, the Dark Warrior behind, the Eight Trigrams and divine tortoise beneath the feet, thirty-six lions crouching ahead, the Seven Stars of the headscarf, the five viscera each generating five riders, and the net-like scriptural patterns covering the body. The Three Ones attend the scriptures, each with a thousand chariots and ten thousand qi, while jade lads and maidens serve as guards. The form is as depicted to the left.\n\nWhen the recitation of the *Five Thousand Character Text* reaches ten thousand repetitions, the Supreme Lord’s thunderous chariot descends to welcome you. If, upon completing ten thousand repetitions, you do not depart, recite it thrice monthly. When the cloud chariot arrives, you will ascend as an immortal. The form is as depicted to the left.\n\nIn the practice of the ten-thousand-repetition Dao, also visualize the Five Cloud Stars. After reciting the scripture, from midnight to the hour of generative qi, fully absorb the Five Sprouts’ qi. Sit facing the direction of the monthly constellation, knock the teeth nine times, swallow saliva thirty-six times, and with eyes closed, visualize the Five Stars: the Chronographic Star above the head, Jupiter at the left elbow, Venus at the right elbow, Mars between the knees, and Saturn at the heart. Persist in this for a long time.\n\nIn all actions—sitting, rising, coming, and going—constantly hold this visualization without forgetfulness. A thousand disasters will naturally cease, and ten thousand calamities will be unable to assail you. Later, water will emerge from above your body and fire from below. With the six penetrations of wisdom, you will suddenly behold the Five Elders.\n\nThe Five Elders are the essences of the Five Stars. Upon seeing them, you will gain mastery over transformations and ascend together into the heavens. The Perfected don a jade crown, a green robe, and a yellow garment, with chariots, attendants, and cloud motifs chosen as appropriate.\n\nAfter receiving the scripture, maintain perpetual fasting and preserve the Real. Forsake the secular and cultivate the Dao, refining your thoughts while reciting the text. Recite ten times daily, and over three years—one thousand days—complete ten thousand repetitions. Once you have thoroughly understood and fulfilled the practices, with refinement complete and virtue abundant, body and spirit will unite, and cloud dragons will come to welcome you, ascending to the Three Clarities.\n\nIf, upon completion, you do not depart, there are two possibilities: first, your merit is perfected and virtue accomplished, yet moved by compassion to aid the age, your destiny has not yet concealed your light, so you remain to inspire later generations; second, your practice is not yet exhaustive, your conduct not fully perfected, your refinement not yet precise, and your thoughts have not summoned a response—though the recitations are complete, you have not ascended. You must then further refine your progress, dispel desires, contemplate the wondrous, diminish the self to deliver others, establish merit with courage, and maintain strict visualization. Whether many or few, practice thrice monthly, harmonizing self and other, accumulating merit and virtue without interruption, linking goodness to goodness. Constantly behold the Three Worthies, and the cloud chariot will arrive of itself. With time, spiritual penetrations will surely manifest.\n\nImpatience leads to obstruction; even with a hundred million repetitions, you will not transcend. Only when your conduct is complete will body and spirit ascend together.\n\nConduct is complete when you embody the seven virtues of ritual, wisdom, trust, and salvation of heaven and humanity. Though you may possess these five virtues, if they are faint and you do not universally deliver beings, your salvific merit will be slight—this is not complete conduct, and you cannot hope to attain the Dao.\n\nThe means to attain the Dao lie in practicing the five virtues. One who practices the five virtues stabilizes the three karmas, fulfills the ten good deeds, and the Great One will descend, the Five Elders will accompany you—attainment of the Dao is then without doubt.\n\nThe *Great Visualization and Annotation of the Supreme Lord Lao* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上老君大存思图注诀 经名：太上老君大卉思图注诀。 撰人不详，约出矜南北朝。 原本一春，分十八篇。 现卉徒十篇。 底本出处：《正统道藏》洞神部方法类。 参考：《云夏七签》卷四十三。 太上老君大存思图注诀 存五藏五岳五星五帝金映五色圆光 存三师竟，次思见五藏、五岳、五星、五帝。 右四条备卫身中，身中变化，无所不容，至於画图，无由备受，象之於外，标明方位，得之言前，勿拘进致云耳＃１。 金映盖一体，体作五色，从肺后出，项有圆光如日象。 右三条在身中，照明十方，共右七条，其形如左： 凡存思之时，皆闭目内视。 人体多神，必以五藏为主，主各料其事，事各得其成，成正则一而不二，不二则隐显无邪，无邪则众妙可见，见妙则与圣符同，同圣则即可弘积学，自然感会。 是以朝夕存思，不可懈息。 存者何也？ 敦也，轮也，思者何也？ 司也，嗣也。 勿以轻躁失本学，学以重厚得宗，得宗则输转无滞，无滞则存而不亡。 不亡由於司察善恶，善恶在乎嗜欲偏颇，偏者嗜欲＃２爱憎徊惶，往反生死劳苦未停，未停之停，停善不着善，着善之善，归宗未能至，至宗无者资於念，念念相续，继念嗣存，无有入於无问，无为而无不为，号日微妙玄通，和光挫锐，济度无穷。 是故为学之基，以存思为首，存思之功，以五藏为盛。 藏者，何也？ 藏也，成也，潜神隐智不炫惧也。 智显欲动，动欲日耀，耀之则败，隐之则成，光而不耀，智静神凝，除欲中净，如山玉内明，得斯胜理，久视长生也。 第一见肺，红白色，七叶，四长三短，接喉咙下。 肺者何也？ 绌也，伐也。 善恶之初，兆而未明，明善则伐恶，恶明则伐善，善废恶兴，伐人命根，根断不断，由於此藏。 此藏魄，藏魄者何也？ 粕也，着也。 人之炫耀莫不关欲，欲着日恶，恶如糟粕，愚俗滞之，不识情本，今愿标着，存而见之，魄则肃然不得为恶，恶急宜弃，故先存之。 火与金合，成败未分＃３，其色红白，叶数纳言，取其和成德，德始於肺，终於脾，脾一又二兼齐也，兼齐者，有信也＃４。 第二见心，如芙集未开，又似县赤油囊，长三寸，在肺前。 心者何也？ 深也，斟也。",
      "translated_text": "**The Supreme Lord Lao’s Great Visualization Chart with Annotated Instructions**\n\n**Title:** *The Supreme Lord Lao’s Great Visualization Chart with Annotated Instructions*. Author unknown, approximately dated to the Northern and Southern Dynasties. Originally one fascicle, divided into eighteen sections; now ten sections survive. Base text from *Zhengtong Daoist Canon*, *Dongshen* Section, Methods Category. Reference: *Yunji Qiqian*, Scroll 43.\n\n**The Supreme Lord Lao’s Great Visualization Chart with Annotated Instructions**\n\nVisualize the five viscera, the five sacred mountains, the five stars, the five emperors, and the golden radiance of the five-colored halo.\n\nFirst visualize the Three Masters, then proceed to see the five viscera, the five sacred mountains, the five stars, and the five emperors.\n\nThe four preceding conditions guard the body within, wherein transformations occur without limit. As for drawing the chart, no method suffices to encompass all; thus, external symbols mark the directions, clarifying positions before speech. Do not rigidly adhere to progression.\n\nThe golden radiance forms one body, manifesting in five colors, emerging from behind the lungs. The nape bears a halo like the sun’s image.\n\nThe three preceding conditions reside within the body, illuminating the ten directions. Together with the four above, these seven conditions take the following forms:\n\nWhenever visualizing, close the eyes and look inward. The human body contains many spirits, but the five viscera serve as the foundation. Each governs its affairs, and each affair achieves its completion. Completion in correctness unifies without division; undivided, the hidden and manifest remain free from deviation. Without deviation, all wonders become visible; seeing wonders, one aligns with the sagely talisman. Aligning with the sagely, one may then accumulate learning extensively, naturally achieving resonance.\n\nThus, morning and evening visualization must not be neglected. What is *cun* (visualization)? It is *dun* (sincerity) and *lun* (revolving). What is *si* (contemplation)? It is *si* (overseeing) and *si* (continuing).\n\nDo not, through frivolity and impatience, lose the root of learning. Learning, through gravity and depth, attains the宗 (origin). Attaining the origin, circulation proceeds without obstruction; unobstructed, visualization endures without loss. Endurance arises from overseeing good and evil. Good and evil lie in the bias of desires. Bias arises from desires, loves, and hates, wavering in hesitation. The cycle of life and death, toil and suffering, never ceases. To cease this ceaselessness, cease attachment to goodness. The goodness of attachment to goodness has yet to return to the origin. Reaching the origin, the non-existent relies on念 (thought). Thoughts follow one another in succession, continuing contemplation and sustaining visualization. Without entering into questioning, acting without action yet accomplishing all—this is called subtle, wondrous, and profoundly penetrating. Harmonizing light while subduing sharpness, it delivers boundlessly.\n\nThus, the foundation of learning takes visualization as its foremost practice, and the efficacy of visualization culminates in the five viscera. What are the *zang* (viscera)? They are *cang* (storing), *cheng* (completing), concealing spirit and hiding wisdom without ostentation. When wisdom manifests and desires stir, stirring leads to brilliance; brilliance leads to ruin, while concealment leads to completion. Shining without brilliance, wisdom stills and spirit congeals. Desires are eliminated, and within, purity arises—like jade within a mountain, inwardly luminous. Attaining this supreme principle, one achieves longevity and enduring vision.\n\n**First, visualize the lungs:** red and white in color, seven lobes—four long, three short—connected below the throat.\n\nWhat are the lungs? They are *chu* (restraining) and *fa* (striking). At the inception of good and evil, signs are yet unclear. Clarifying goodness strikes evil; clarifying evil strikes goodness. When goodness decays and evil flourishes, the root of life is struck. Whether the root severs or endures depends on this viscus.\n\nThis viscus stores the *po* (corporeal soul). What is the *po*? It is *po* (dregs) and *zhuo* (attachment). Human ostentation invariably relates to desire. Desire’s attachment is evil; evil resembles dregs. The foolish and vulgar cling to it, unaware of the essence of emotion. Now, wishing to mark and attach, visualize to perceive it. The *po* then becomes solemn, no longer capable of evil. Evil must be urgently discarded; thus, it is visualized first.\n\nFire and metal unite, success and failure yet undetermined. Their color is red and white; the number of lobes corresponds to speech, embodying harmonious completion of virtue. Virtue begins in the lungs and ends in the spleen. The spleen is one yet also two, encompassing equilibrium. Equilibrium embodies trust.\n\n**Second, visualize the heart:** like a closed lotus bud or a suspended red oil sac, three inches long, located before the lungs.\n\nWhat is the heart? It is *shen* (profound) and *zhen* (measuring).",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 855,
      "start_sentence": 0,
      "end_sentence": 35,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.094464540481567,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太上老君大存思图注诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "是非未辫，斟酌优量，败则灭身，成则得道，祸福之深，由於此藏。 此藏藏神，神者何也？ 申也，真也，智慧之王＃５，使屈能申，存而见之，神则凝然，识定入真，不可深累也。 第三见肝、苍紫色，五叶，三长二短，长九寸，在心下。 肝者何也？ 干也，还也。 悟恶能改，次定无疑，行善建功，干事不怠，审正还宗，由於此藏。 此藏藏魂，魂者何也？ 纭也，回也，纷纭俗海，回向道门，存而见之，魂则欣然劝进立功，克隆善业也。 第四见肾，苍铄色＃６，如覆双漆杯，长五寸，夹背两膂，着脊。 肾者何也？ 紧也，津也。 习善紧，不敢慢，津润无穷，济度无极，通道松俗，由於此藏。 此藏藏精，精者何也？ 清也，灵也，动以徐清，变化无碍，神灵往还，提担空极，存而见之，精则澄然，不散泄也。 第五见脾，黄，苍色，长一尺二寸，中有一尺曲榆太仓，胃上。 脾者何也？ 柠也，移也。 清凝潜润，补益一切，安而能移，移而不匮，既成曲於此藏＃７。 此藏藏志，志者何也？ 至也，异也，港润密化顽鄙异人，存而见之，信验治俗，志则湛然，至乎道也哉。 次思五岳： 岳者何也？ 疑也，觉也。 农然安镇，不可倾动，动化顺道，使迷梦觉悟。 学士象之，故次思也。 思岳正方在於藏者，炼此肉姿为金刚也。 第一见东岳泰山，正在东方？ 东者何也？ 童也，动也。 动修正道，澄源清净，故其方气清。 物色多青，青春主仁，蠢息宜爱，存见在肝。 肝无灾息，保长生也。 生为元首，故先存之也。 第二见南岳霍山，正在南方。 南者何也？ 任也，纳也。 运至此时，才行堪任，广能容纳，故其方气盛。 物色多赤，赤夏主礼，大事宜明，存见在心。 心无灾息，保常安也耳。 第三见中岳嵩高山，正在中央。 中者何也？ 工也，冲也。 央者何也？ 常也，量也。 轮转无穷，体空诣极，其方气和。 物色多黄，中正无邪，周行不殆，触感能应，故黄季主信，总括要密，存见在脾。 脾无灾患，保永立也。 第四见西岳华山，正在西方。 西者何也？ 凄也，齐也。 妻切贞白，内外齐洁，故其方气烈。 物色多素，素秋主义，德行宜总，存见在肺。 肺无灾息，保通成也。 第五见北岳恒山，正在北方。 北者何也？ 伏也，福也。 动极归静，调伏无穷，穷则能变万福惟新，新如不新，微妙幽玄，故其方气柔。 物色多黑，黑冬主智，智周铃济，存见在肾。 肾无灾息，保常乐也。 次存五星： 星者何也？ 精也，生也。 精由窈冥，应现成形，松诸赢滞，济长生也，金刚极精，与神合也。 第一见荧感星，在南岳上。 其色赤，其精朱。 荧者何也？ 约也，炫也。 惑者何也？ □ 武也，贼也。 欲动炫耀，政差错贼害，名以为主乱，乱宜急治，先存见之。 谓乱则定，定乱既着，信显义明，明义入智，智通长存。 第二见镇星，在中岳上。 其色黄，其精煌。 镇者何也？ 信也，定也。 煌煌之盛，内外安事，四方无违，信有微也。 第三见太白星，在西岳上。 其色、白，其精素。 太者何也？ 大之大也。 白者有也？ 的也，约也。 约然明白，能受众彩，众彩得之，的然显发，用之随宜，无能大此，故曰太台，殊诸名也哉。 第四见辰星，在北岳上。 其色黑，其精玄。 辰者何也？",
      "translated_text": "The right and wrong remain undiscerned; weigh and measure with care. Failure leads to self-destruction, while success brings the Dao. The depth of fortune and misfortune lies within this organ.\n\nThis organ stores *shen*. What is *shen*? It is *extension* and *truth*, the sovereign of wisdom. When constrained, it can extend. Visualize to perceive it, and *shen* then congeals, recognition stabilizes into truth, and one cannot be deeply burdened.\n\n**Third, visualize the liver:** a deep purple hue, with five lobes—three long and two short—nine inches in length, located below the heart.\n\nWhat is the liver? It is *dryness* and *return*. Awakening to evil and correcting it, determination becomes unshakable. Practicing goodness and establishing merit, one acts with diligence. Discerning correctness and returning to the origin depend on this organ.\n\nThis organ stores the *hun*. What is *hun*? It is *abundance* and *reversion*. Amidst the tumultuous sea of the vulgar, it reverts toward the gate of the Dao. Visualize to perceive it, and *hun* then rejoices, urging progress and establishing merit, perpetuating virtuous deeds.\n\n**Fourth, visualize the kidneys:** a lustrous dark hue, like an inverted pair of lacquered cups, five inches long, flanking the spine and attached to the back.\n\nWhat are the kidneys? They are *tension* and *moisture*. Practicing goodness with tension, one dares not be negligent. Moisture is inexhaustible, aiding and delivering without limit, bridging the Dao and the vulgar—this depends on this organ.\n\nThis organ stores *jing*. What is *jing*? It is *clarity* and *numinosity*. Moving with gradual clarity, it transforms without obstruction. The numinous comes and goes, bearing the empty extreme. Visualize to perceive it, and *jing* then becomes serene, not dissipating or leaking.\n\n**Fifth, visualize the spleen:** yellow and dark, twelve inches long, with a one-foot curved *yu* (granary) at its center, above the stomach.\n\nWhat is the spleen? It is *support* and *transference*. Clear and congealed, it silently moistens, nourishing all. At rest, it can transfer; transferring, it does not deplete. Thus, the curve is completed within this organ.\n\nThis organ stores *zhi*. What is *zhi*? It is *ultimacy* and *distinction*. Profoundly moistening and secretly transforming the coarse and vulgar into the extraordinary, visualize to perceive it, and the efficacy in governing the vulgar is verified. *Zhi* then becomes profound, reaching the Dao.\n\nNext, contemplate the Five Peaks.\nWhat are the Peaks? They are *doubt* and *awakening*. Firmly settled and unshakable, their movement and transformation align with the Dao, awakening those lost in dreams. Scholars emulate them, hence the contemplation follows.\n\nContemplating the Peaks’ proper alignment within the organs refines this fleshly form into vajra.\n\n**First, visualize Mount Tai, the Eastern Peak,** properly situated in the east.\nWhat is the east? It is *youth* and *movement*. Moving to cultivate the correct Dao, its source becomes clear and pure—thus, the qi of this direction is clear. Its colors are mostly green; green spring governs *ren* (benevolence). The stirring of life should be cherished. Visualize it within the liver. With the liver free from calamity and stagnation, one preserves longevity. Life is the origin, hence it is visualized first.\n\n**Second, visualize Mount Heng, the Southern Peak,** properly situated in the south.\nWhat is the south? It is *capacity* and *reception*. When the season arrives, one’s conduct is capable and can be entrusted, broadly able to contain—thus, the qi of this direction is abundant. Its colors are mostly red; red summer governs *li* (propriety). Great affairs should be illuminated. Visualize it within the heart. With the heart free from calamity and stagnation, one preserves constant peace.\n\n**Third, visualize Mount Song, the Central Peak,** properly situated in the center.\nWhat is the center? It is *work* and *harmony*. What is *yang* (center)? It is *constancy* and *measure*. Revolving endlessly, its body is empty and attains the extreme—thus, the qi of this direction is harmonious. Its colors are mostly yellow; central correctness is without deviation, circulating without exhaustion, responding to all stimuli. Thus, yellow autumn governs *xin* (trust), encompassing essential density. Visualize it within the spleen. With the spleen free from calamity, one preserves eternal stability.\n\n**Fourth, visualize Mount Hua, the Western Peak,** properly situated in the west.\nWhat is the west? It is *chill* and *equilibrium*. The wife is earnest and pure, inner and outer equally immaculate—thus, the qi of this direction is fierce. Its colors are mostly white; white autumn governs *yi* (righteousness). Virtuous conduct should be comprehensive. Visualize it within the lungs. With the lungs free from calamity and stagnation, one preserves completion.\n\n**Fifth, visualize Mount Heng, the Northern Peak,** properly situated in the north.\nWhat is the north? It is *submission* and *blessing*. Movement reaches its extreme and returns to stillness; regulation is inexhaustible. Exhaustion enables transformation, and myriad blessings are ever-renewed. Renewal is as if not renewed, subtly wondrous and profoundly mysterious—thus, the qi of this direction is gentle. Its colors are mostly black; black winter governs *zhi* (wisdom). Wisdom universally aids and delivers. Visualize it within the kidneys. With the kidneys free from calamity and stagnation, one preserves constant joy.\n\nNext, contemplate the Five Stars.\nWhat are the Stars? They are *essence* and *life*. Essence emerges from the obscure, manifesting in form, loosening all stagnation, and aiding longevity. The vajra’s utmost essence unites with *shen*.\n\n**First, visualize Mars, the Blazing Deluder Star,** above the Southern Peak.\nIts color is red; its essence is vermilion.\nWhat is *ying* (blazing)? It is *restraint* and *dazzlement*.\nWhat is *huo* (delusion)? It is *martial* and *predatory*.\nDesire stirs and dazzles; governance falters, and predation harms. It is named the lord of chaos; chaos must be urgently governed. First, visualize to perceive it. To speak of chaos is to stabilize it. Once chaos is stabilized and made manifest, trust becomes evident, righteousness becomes clear, clarity enters wisdom, and wisdom enables enduring preservation.\n\n**Second, visualize Saturn, the Quelling Star,** above the Central Peak.\nIts color is yellow; its essence is radiant.\nWhat is *zhen* (quelling)? It is *trust* and *stability*. Its radiance is resplendent; inner and outer affairs are settled. The four directions do not transgress; trust has its subtlety.\n\n**Third, visualize Venus, the Grand White Star,** above the Western Peak.\nIts color is white; its essence is pure.\nWhat is *tai* (grand)? It is the greatest of the great.\nWhat is *bai* (white)? It is *luminous* and *restrained*.\nLuminous and restrained, it can receive all hues. When all hues attain it, they become distinctly manifest. Applied as appropriate, none can surpass it—hence it is called *Tai Tai*, surpassing all names.\n\n**Fourth, visualize Mercury, the Chronographic Star,** above the Northern Peak.\nIts color is black; its essence is profound.\nWhat is *chen* (chronographic)?",
      "overlap_context": "tal unite, success and failure yet undetermined. Their color is red and white; the number of lobes corresponds to speech, embodying harmonious completion of virtue. Virtue begins in the lungs and ends in the spleen. The spleen is one yet also two, encompassing equilibrium. Equilibrium embodies trust.\n\n**Second, visualize the heart:** like a closed lotus bud or a suspended red oil sac, three inches long, located before the lungs.\n\nWhat is the heart? It is *shen* (profound) and *zhen* (measuring).",
      "start_char": 855,
      "end_char": 2140,
      "start_sentence": 36,
      "end_sentence": 122,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.36868357658386,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太上老君大存思图注诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "淳也，真也，潜也。 潜适顾建，始终无亏，杂污不染，智慧静也。 第五见岁星，在东岳上 其色青，其精苍。 岁者何也？ 际也，、遂也。 去故就新，穷而能通，因际又会，遂成功也。 次存五帝： 帝者何也？ 谛也，诣也。 精真之信，有此神形，形神俱妙，妙应无穷，审至宗极，无退转也。 第一见黄帝。 在镇星之中，下进中岳之上。 宣理脾气，通人志愿。 岩问官殿，七宝堂室，衣服羽仪，侍从婶盖，文武侠乐，物色多黄，果愿责征，变化须验，故先存之，信为主也。 第二见白帝。 在太白星中，下游西岳之上。 宣理肺气，遣人滞着。 岩问官殿，七宝堂室，衣服羽仪，待从为盖，文武枚乐，物色多素也。 第三见黑帝。 在辰星之中，下道北岳。",
      "translated_text": "Profound, authentic, and latent.\nLatent yet aptly established, beginning and end without flaw, untarnished by defilement—this is the stillness of wisdom.\n\n**Fifth, visualize Jupiter, the Year-Star,** above the Eastern Peak.\nIts color is azure; its essence is verdant.\nWhat is *sui* (year)?\nIt is *boundary* and *fulfillment*.\nDiscarding the old and embracing the new, exhausted yet able to penetrate, through boundaries it meets again, thus accomplishing its work.\n\nNext, visualize the Five Thearchs:\nWhat is *di* (thearch)?\nIt is *discernment* and *attainment*.\nThe sincerity of refined authenticity gives rise to this spirit-form. Form and spirit both wondrous, their responses are inexhaustible. Examining and reaching the ultimate origin, there is no regression.\n\n**First, visualize the Yellow Thearch.**\nWithin the Saturn-star, descending to hover above the Central Peak.\nIt proclaims and regulates the spleen’s *qi*, connecting human aspirations.\nPalaces of towering cliffs, halls of seven treasures, robes and feathered regalia, attendants with parasols, civil and martial retinues with music—all hues are predominantly yellow. Desires and vows seek verification; transformations await confirmation. Thus, first visualize it, for sincerity is the master.\n\n**Second, visualize the White Thearch.**\nWithin the Venus-star, descending to roam above the Western Peak.\nIt proclaims and regulates the lung’s *qi*, dispelling human stagnation.\nPalaces of towering cliffs, halls of seven treasures, robes and feathered regalia, attendants with canopies, civil and martial retinues with music—all hues are predominantly white.\n\n**Third, visualize the Black Thearch.**\nWithin the Mercury-star, descending to traverse the Northern Peak.",
      "overlap_context": "te; its essence is pure.\nWhat is *tai* (grand)? It is the greatest of the great.\nWhat is *bai* (white)? It is *luminous* and *restrained*.\nLuminous and restrained, it can receive all hues. When all hues attain it, they become distinctly manifest. Applied as appropriate, none can surpass it—hence it is called *Tai Tai*, surpassing all names.\n\n**Fourth, visualize Mercury, the Chronographic Star,** above the Northern Peak.\nIts color is black; its essence is profound.\nWhat is *chen* (chronographic)?",
      "start_char": 2140,
      "end_char": 2451,
      "start_sentence": 123,
      "end_sentence": 143,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.511693716049194,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太上老君大存思图注诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "宣理肾气，润人精液。 岩问宫殿，七宝堂室，衣服羽仪，侍从婶盖，文武仗乐，物色多玄也。 第四见青帝。 在岁星中，下道东岳，宣理肝气，奖人善事。 岩问官殿，七宝官室，衣服羽仪，侍从婶盖，文武仗乐，物色多苍也。 第五见赤帝。 在荧惑星中，下进南岳，宣理心气，定人神智。 岩问官殿，七宝官室，衣服羽仪，侍从婶盖，文武仗乐，物色多朱也。 次存金映盖体： 见五帝光仪，备卫身中，飞五星色相，也覆体外。 荧惑在头上，镇在心前，长在膝问，岁在左肘，太白在右计，光色往还，混成金映。 映者何也，泱也，镜也。 金者何也？ 堪也，钦也。 身金紫色，神气清和，泱泱深静，朗镜无昧，堪干坚刚，断央邪疑，拾凡成圣也。 次存体作五色： 色者何也？ 测也，识也。 妙气应感，以反众迷，迷复欢真，以测邪伪，伪色既拾，真色自形，形妙炼赢，厅消成圣耳。 第一见白气从肺出，第二见赤气从心出，第三见青气从肝出，第四见黄气从脾出，第五见黑气从肾出。 向见帝帝光星色，合成金映，今见五藏五气从藏又出，以次相随，上升至头，五色轮回，冠覆身体，蓊郁氛氲，如在浓烟中也。 次存项有圆光： 身已化为紫金之色，又得五气周旋，明严相好，项生圆光，匝绕上下，通洞晃炎，照明十方。 消却万恶，内外洞彻，无鄙之疵。 光神不二，道同一矣。",
      "translated_text": "It proclaims and regulates the kidney’s *qi*, nourishing human essence.\nPalaces of towering cliffs, halls of seven treasures, robes and feathered regalia, attendants with canopies, civil and martial retinues with music—all hues are predominantly black.\n\n**Fourth, visualize the Azure Thearch.**\nWithin the Jupiter-star, descending to traverse the Eastern Peak.\nIt proclaims and regulates the liver’s *qi*, encouraging human goodness.\nPalaces of towering cliffs, halls of seven treasures, robes and feathered regalia, attendants with canopies, civil and martial retinues with music—all hues are predominantly green.\n\n**Fifth, visualize the Vermilion Thearch.**\nWithin the Mars-star, descending to advance upon the Southern Peak.\nIt proclaims and regulates the heart’s *qi*, stabilizing human spirit and wisdom.\nPalaces of towering cliffs, halls of seven treasures, robes and feathered regalia, attendants with canopies, civil and martial retinues with music—all hues are predominantly red.\n\nNext, visualize the golden radiance enveloping the body:\nBehold the luminous forms of the Five Thearchs, guarding within the body, their five stellar colors flying and covering the exterior.\nMars hovers above the head, Mercury rests before the heart, Jupiter stands between the knees, Saturn at the left elbow, Venus at the right shoulder—light and color intermingling, blending into a golden radiance.\nWhat is this radiance? It is vastness, a mirror.\nWhat is this gold? It is resilience, reverence.\nThe body assumes a golden-purple hue, the spirit’s *qi* pure and harmonious, vast and profoundly still, bright as a flawless mirror. Resilient and firm, it severs doubt and dispels evil, elevating the ordinary to sagehood.\n\nNext, visualize the body manifesting five colors:\nWhat are these colors? They are discernment, recognition.\nSubtle *qi* responds to perception, dispelling delusion; delusion yields to truth, exposing falsehood. Once false colors are discarded, true colors naturally emerge. Through refinement and transmutation, the weak are tempered, and sagehood is attained.\n\nFirst, behold white *qi* issuing from the lungs; second, red *qi* from the heart; third, green *qi* from the liver; fourth, yellow *qi* from the spleen; fifth, black *qi* from the kidneys.\nPreviously seen were the radiant stellar forms of the Five Thearchs, coalescing into golden radiance. Now, the five *qi* of the five viscera emerge in sequence, ascending to the head, revolving in five colors, crowning and enveloping the body, thick and misty, as if immersed in dense smoke.\n\nNext, visualize a halo around the neck:\nThe body has transformed into a golden-purple hue, further enveloped by the revolving five *qi*, resplendent in majesty. A halo arises around the neck, encircling above and below, luminous and blazing, illuminating the ten directions.\nIt dissolves all evil, penetrating within and without, leaving no blemish of impurity. The radiant spirit is undivided; the Dao is one.",
      "overlap_context": ", for sincerity is the master.\n\n**Second, visualize the White Thearch.**\nWithin the Venus-star, descending to roam above the Western Peak.\nIt proclaims and regulates the lung’s *qi*, dispelling human stagnation.\nPalaces of towering cliffs, halls of seven treasures, robes and feathered regalia, attendants with canopies, civil and martial retinues with music—all hues are predominantly white.\n\n**Third, visualize the Black Thearch.**\nWithin the Mercury-star, descending to traverse the Northern Peak.",
      "start_char": 2451,
      "end_char": 3003,
      "start_sentence": 144,
      "end_sentence": 168,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.825520277023315,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太上老君大存思图注诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "存竟，礼十方，次礼真经真人曰：礼经时，心注太上老君，三拜，次念尹先生，河上真人，玄中法师，复三拜。 常三万六千仙童玉女侍经烧香，为兆求白日升天之道者也。 坐朝存思 坐朝者，端坐而修礼也。 凡有公事私碍，或在非类之问，不得束躬上堂展敬，但自安坐，不使人知，香火非嫌，乃可然之，人见致笑，亦即可阙，将护彼意，勿增他愆，初夕向晓，依时修之。 白日启请，亦宜平坐，坐则如常，勿革形色，唯令异人，不能觉知，人觉而喜，乃可化之，觉而嗤鄙，訾毁正真，误其招殃，又坏子业。 古之学道为己，今之学道为人，为人苟以悦人，不顾心非，为己者存心是不顾亦违，违亦由心，致感弥速，强欲伏众，有迩无心，非唯徒劳，乃更获罪。 学真之士，各加思真，真贵会时，时贵善合，合而非善，此时勿会，会必兼济，济物及身，善善相得，舍恶升仙。 舍恶升仙，乃谓为会，会恶致败，名滥实殊，若出处所遭，遭时二病，一者滞心，二者执迩。 执迩者，宜以心法化之，滞心者，宜以迩法引导，心迩弗偏，化执导滞，二病豁除，上圣之道就矣。 几行经山水，积日舟车，舟车之中，山水之际，步涉登陆，舍住相须，疲倦止息，皆依时存礼。 隐显随宜，存思精审，自然忘劳，魔邪恶人，不敢挠近。 当诵经行戒，以善兴居，兴居无善，破戒违经，虽复存礼，终不睹真。 嫉鬼坏神，凶人恶物，更相冲犯，烦恼生灾，外坐无宁。 急存九行，行之检身，心存口诵，解了无疑，以定三业，三业既定，众灾自消，人鬼敬伏，拥护去来，出入动静，铃保贞吉。 九行在《想尔注》前，三业在《明威经》后，存思者急宜忆之，故标出如左： 行无为，行柔弱，行守雌，勿先动。 此上最三行。 行无名，行清诤，行诸善。 此中最三行。 行无欲，行知止足，行推让。 此下最三行。 一者不杀，二者不盗，三者不淫。 此三事，属身业。 一者不妄言，二者不绮语，三者不两舌，四者不恶口。 此四事，属口业。 一者不嫉拓，二者不瞋志，三者不邪疑。 此三事，属心业。 右九行三业十事，常当存念，惊恐之 际，急难之时，皆速思之，危即安也。 碧冠青被黄服，取宜装。 卧朝存思 卧之为法，勿正仰如尸，当侧傍检体，莫恣纵四肢，不可高枕，三寸许耳，香药为枕，无用恶木，泠漯秽臭，冲犯泥丸。 虽行途权假，怛宜防之。 卧起，咒愿，善念在心，心存朝礼，时不可阙，阙碍公私，后皆忏悔也。 朝出户，存玉女。 玉女者，是自然妙气，应感成形，形质明净，清皎如玉，隐而有润，显又无邪。 学者存真，阶渐升进，进退在形，出入在道，道气微妙，纤毫必应，应引以次从卑至尊。 故白日则玉女守宫，夕夜则少女通事，济度危难，登道果也。 碧冠绿被浅服，余并取宜装。 夕出户，存少女。 夕出户，呎曰：少女通灵。 学未升玄，不得无业，业有优劣，皆必须因，因精果妙，乃一其神，神而未一，由学未精，精之以渐，引阴济阳，人生阳境，动静归阴，阴为道几，应感最妙，妙应之初，有兹少女，秉正治邪，和释高戾＃８，罚恶佑善，阴德济阳，显称玉明，其可坚贞，呢而存之，成真则速矣哉。 行道时，存蕾买气兵马。 清旦，先思青云之气匝满斋堂中，青龙狮子，备守前后。",
      "translated_text": "Upon completing the visualization, pay homage to the ten directions, then to the true scriptures and perfected beings, saying: When bowing to the scriptures, focus the mind on the Most High Lord Lao, offering three bows. Next, invoke Master Yin and the Perfected One of the River’s Edge, along with the Master of the Mystic Teachings, and bow three more times. Thirty-six thousand immortal youths and jade maidens constantly attend the scriptures, burning incense on behalf of the practitioner to seek the Dao of ascending to heaven in broad daylight.\n\n**Seated Morning Visualization**\nSeated morning practice entails sitting upright to perform the rites. If public or private affairs obstruct, or if one finds oneself among those of different inclinations, one may not bow fully in the hall—simply sit composed, concealing the practice from others. Incense and offerings need not be avoided; they may be used discreetly. Even if others mock, one may omit the rites, taking care not to offend their sensibilities or exacerbate their faults. From dawn to dusk, perform the practice at the proper times. When making daytime invocations, it is also fitting to sit calmly, maintaining an ordinary demeanor without altering one’s appearance, so that those of different inclinations remain unaware. If others notice and approve, one may guide them; if they scorn or slander the true and upright, they bring misfortune upon themselves and corrupt their own cultivation. The ancients studied the Dao for themselves; today, many study it for others. Those who practice for others seek to please, disregarding the falsity in their hearts. Those who practice for themselves focus on sincerity—whether adhering or deviating, the heart remains the source. The more one strives to subdue others without true intent, the more futile the effort, and the greater the transgression. Those who study the true Dao must each deepen their sincerity. Sincerity values timely convergence, and timing values harmonious union. If the union is not virtuous, one should not converge at that time. Convergence must bring mutual benefit, aiding both others and oneself. Virtue and virtue align; abandoning evil, one ascends as an immortal. Abandoning evil to ascend as an immortal is the purpose of convergence. Converging with evil leads to ruin, where names and realities diverge. In one’s conduct and circumstances, two afflictions may arise: the first is mental stagnation, the second is clinging to the near. For those who cling to the near, transform them through the method of the heart. For those with stagnant minds, guide them through the method of proximity. Neither heart nor proximity should be biased; transform clinging and guide stagnation. When both afflictions are dispelled, the Dao of the highest sages is attained.\n\nWhen traveling through mountains and waters, or spending days in boats and carriages, whether in transit or at rest, whether walking, climbing, or lodging, whenever weary and pausing to rest, perform the visualization rites at the proper times. Adapt to concealment or openness as circumstances allow, and concentrate the visualization with precision. Naturally, fatigue will be forgotten, and demonic or malevolent people will not dare to disturb. When reciting scriptures and observing precepts, conduct oneself with virtue. If one’s conduct lacks virtue, precepts are broken and scriptures violated. Even if one performs the rites, the true will not be perceived. Jealous ghosts and malevolent spirits, along with wicked people and harmful things, will clash and provoke one another, giving rise to afflictions and disasters, leaving no peace even when seated outside. Swiftly visualize the Nine Practices to regulate the body. With the heart focused and the mouth reciting, understand clearly without doubt. Stabilize the Three Actions, and once they are settled, all disasters will dissolve. People and ghosts will revere and submit, safeguarding one’s comings and goings, movements and stillness, ensuring steadfast good fortune.\n\nThe Nine Practices are found in the *Xianger Commentary*, and the Three Actions follow the *Mingwei Sutra*. Those who practice visualization must urgently recall them, as outlined below:\n\nPractice non-action; practice gentleness and weakness; practice holding to the feminine, never moving first. These are the first three practices.\nPractice namelessness; practice purity and integrity; practice all virtues. These are the middle three practices.\nPractice desirelessness; practice knowing when to stop and be content; practice yielding and deference. These are the last three practices.\n\nThe first: do not kill.\nThe second: do not steal.\nThe third: do not engage in licentiousness.\nThese three pertain to bodily action.\n\nThe first: do not speak falsely.\nThe second: do not use flowery speech.\nThe third: do not engage in double-tongued speech.\nThe fourth: do not use harsh language.\nThese four pertain to verbal action.\n\nThe first: do not be envious or obstructive.\nThe second: do not harbor anger.\nThe third: do not hold perverse doubts.\nThese three pertain to mental action.\n\nThe above Nine Practices and Three Actions, comprising ten matters, should always be kept in mind. In moments of alarm or peril, recall them swiftly—danger will turn to safety.\n\nFor attire, wear a jade-green cap, a blue-green robe, and a yellow garment, adapting as appropriate.\n\n**Seated and Reclining Visualization**\nThe method of reclining: do not lie flat like a corpse. Instead, lie on one side, keeping the body composed. Do not sprawl the limbs or use a high pillow—only about three inches. Make a pillow of fragrant herbs; do not use foul or rotting wood, as its cold dampness and stench will offend the *niwan* (mud-pill palace). Even when traveling and temporarily resting, one must guard against this. Upon rising from sleep, recite incantations and vows, maintaining virtuous thoughts. Visualize the morning rites at the proper time; do not omit them. If public or private affairs obstruct, repent afterward. When leaving the chamber in the morning, visualize the Jade Maiden. The Jade Maiden is the wondrous *qi* of spontaneity, taking form in response to resonance. Her form and substance are luminous and pure, clear and bright as jade, hidden yet moistening, manifest yet without perversity. As the practitioner cultivates the true, they ascend step by step. Advancement and retreat lie in form; entry and exit lie in the Dao. The *qi* of the Dao is subtle and wondrous, responding even to the finest detail. Responses unfold in order, from the humble to the exalted. Thus, in daylight, the Jade Maiden guards the palace; at night, the Maiden of the Evening attends to affairs, aiding in overcoming peril and attaining the fruition of the Dao. Wear a jade-green cap, a green robe, and a light garment, adapting the rest as appropriate.\n\nWhen leaving the chamber at dusk, visualize the Maiden of the Evening. Upon exiting, recite: \"Maiden of the Evening, communicate with the numinous.\" Before ascending to the mysterious, one must not be without practice. Practices vary in excellence, but all require a foundation. When the foundation is refined, the fruit is wondrous, and the spirit becomes unified. If the spirit is not unified, it is because the practice is not yet refined. Refine it gradually, drawing yin to aid yang. Human life resides in the yang realm; movement and stillness return to yin. Yin is the subtle mechanism of the Dao, and its responses are most wondrous. At the inception of this wondrous response, the Maiden of the Evening appears, upholding rectitude to govern perversity, harmonizing and releasing arrogance, punishing evil and protecting good. Through yin virtue, she aids yang, her luminous fame as bright as jade. She is steadfast and pure; cherish and visualize her, and attainment of the true will be swift.\n\nWhen practicing the Dao, visualize the *qi*-soldiers and cavalry. At dawn, first visualize azure clouds filling the purification hall, with blue-green dragons and lions guarding the front and rear.",
      "overlap_context": "olors, crowning and enveloping the body, thick and misty, as if immersed in dense smoke.\n\nNext, visualize a halo around the neck:\nThe body has transformed into a golden-purple hue, further enveloped by the revolving five *qi*, resplendent in majesty. A halo arises around the neck, encircling above and below, luminous and blazing, illuminating the ten directions.\nIt dissolves all evil, penetrating within and without, leaving no blemish of impurity. The radiant spirit is undivided; the Dao is one.",
      "start_char": 3004,
      "end_char": 4313,
      "start_sentence": 169,
      "end_sentence": 213,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.64757013320923,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太上老君大存思图注诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "次思青气从师肝中出，知云之升＃９，青龙狮子在青气中，往覆弟子家合宅大小之身。 仙童玉女，天仙地仙飞仙，日月星宿五帝，兵马九亿万骑，监斋直事，三界官属，罗列左右耳。 正中，思赤云之气匝满斋堂，朱雀凤凰，悲呜左右。 次思赤气从师心中出，如云之升，凤凰朱雀在赤气中，往覆弟子家合宅大小之身。 仙童玉女，天仙地仙飞仙，日月星宿五帝，兵马九亿万骑，监斋直事，三界官属，罗列左右。 日入，思黄云之气匝满斋堂，黄龙黄麟，备守四方。 次思黄气从师脾中出，如云之升，黄龙黄麟在黄气中，往覆弟子家合宅大小之身。 仙童玉女，天仙地仙飞仙，日月星宿五帝，兵马九亿万骑，监斋直事，三界官属，罗列左右耳，三时行道，六时依如后科。 人定，思白云之气匝满斋堂，白虎麒麟备守内外。 次思白气从师肺中出，不须存麒麟，宜存白虎，若存麟，思白麟在白气中，往覆弟子家合宅大小之身。 仙童玉女，日月兵马，悉如前法。 黄录大斋三时行道，宜用日入，常斋三时，可取人定，人定而用，日入存思。 又六时更从青始，次赤，周白，此皆失法，青赤白别有，皆非五藏六府之仪也。 夜半，思玄云之气匝满斋堂，灵龟剩蛇备守上下。 次思黑气从师肾中出，如云之升，灵龟腾蛇在黑气中，仙童玉女，日月兵马，悉如前法也。 向晓，思紫云之气匝满斋堂，辟邪狮子备守隐显，其形如左。 次思紫气从胆中出，余如前法。 凡存云气，各从方来，青云出束，赤云出南，黄云出中，白云出西，黑云出北，紫云出上。 见从其方，稍出渐盛，蓊郁氤氲，充溢堂宇。 然后思己身中藏气，又出与云色乎合＃１０，气同明净香洁，覆庇家门，宫城山水，小大毕周，神官灵兽，齐整参罗前后左右，四方内外，上下隐显，六时转隆神灵普遍也。 上讲，坐存三色，三一魂魄。 上讲时，先存三色，次存三一。 行道有六时，上讲常三时：食后，上哺，人定。 三时入斋堂捻香，礼三拜，巡回依座，坐竟，有众者法师以拂击席＃１１，仍放板膝前，同临目握固，存头气青，两乎气赤＃１２，两足气白，三气绕身，其形如左： 存三一魂魄。 三一者，三处之神同一道也。 其道本一，应感成三，三界内外，无乎不在，统化主物，号三天太上，宣教侍经，号三素左君，降人成德，号曰三一。 三一在人，人有三宫：头脑名为上元宫，其神日夷； 心内名为中元官，其神曰希； 脐下名为下元官，其神曰微。 皆如婴儿，俱长一寸。 静坐正拱，无欲无为，体无应有，学仙所存。 久习坚固，神通洞达，然后变化无滞，群动成依，细无不入，大无不包，或为无穷，或为无极，观妙之初，先由寸起，其形如左： 真人曰：斋时，皆心注玄真，永无外想。 想念在经师，先思三一在官室，安居分明，具三魂七魄，太一镇泥丸中，如回风帝一法。 然后与兆俱斋听经，口授心存，则三尸亡走，邪气灭去，内外受真，如此近仙矣。 傍吐纳导引和液，行上诸妙道，天真铃降子。 上士得道於室内，虽处岩穴，而外想一毫不绝，亦徒劳损力耳。 学道唯心尽志，仙人当下观试之也，子善详察之焉。 碧冠青被浅黄服，余取宜装． 初登高座，先存礼三尊。 讲义及读经，先静竟，登起向太上座，三过上香，却后数尺，礼三尊三拜，又仍存，经师、籍师，度师，各礼一拜，合六拜，乃登高座，其形如左：",
      "translated_text": "Next, visualize azure *qi* emerging from the master’s liver, ascending like clouds. Within this azure *qi*, blue-green dragons and lions move back and forth, covering the bodies of the disciple’s household, large and small. Divine youths and jade maidens, celestial immortals, earthbound immortals, flying immortals, the sun, moon, stars, and Five Thearchs—along with nine hundred million *qi*-soldiers and cavalry—oversee the ritual, attend to the proceedings, and arrange the officials of the Three Realms to left and right.\n\nAt the center, visualize crimson clouds filling the purification hall, with vermilion phoenixes and red birds crying out to left and right. Then visualize crimson *qi* emerging from the master’s heart, ascending like clouds. Within this crimson *qi*, phoenixes and red birds move back and forth, covering the bodies of the disciple’s household, large and small. Divine youths and jade maidens, celestial immortals, earthbound immortals, flying immortals, the sun, moon, stars, and Five Thearchs—along with nine hundred million *qi*-soldiers and cavalry—oversee the ritual, attend to the proceedings, and arrange the officials of the Three Realms to left and right.\n\nAt sunset, visualize yellow clouds filling the purification hall, with yellow dragons and yellow *lin*-beasts guarding the four directions. Then visualize yellow *qi* emerging from the master’s spleen, ascending like clouds. Within this yellow *qi*, yellow dragons and yellow *lin*-beasts move back and forth, covering the bodies of the disciple’s household, large and small. Divine youths and jade maidens, celestial immortals, earthbound immortals, flying immortals, the sun, moon, stars, and Five Thearchs—along with nine hundred million *qi*-soldiers and cavalry—oversee the ritual, attend to the proceedings, and arrange the officials of the Three Realms to left and right. The three periods of practice follow the six periods as prescribed below.\n\nAt the hour of *ren ding*, visualize white clouds filling the purification hall, with white tigers and *qi*-*lin* guarding within and without. Then visualize white *qi* emerging from the master’s lungs. There is no need to visualize the *qi*-*lin*; instead, focus on the white tiger. If visualizing the *lin*, see the white *lin* within the white *qi*, moving back and forth to cover the bodies of the disciple’s household, large and small. Divine youths and jade maidens, the sun, moon, and *qi*-soldiers follow the previous method.\n\nFor the great Yellow Register purification ritual, the three periods of practice should begin at sunset. For ordinary purifications, the three periods may begin at *ren ding*. If using *ren ding*, the visualization at sunset remains the same. However, practicing all six periods in sequence—beginning with azure, then crimson, and cycling through white—deviates from the proper method. Azure, crimson, and white each have their own distinct forms, none of which correspond to the five viscera and six bowels.\n\nAt midnight, visualize dark clouds filling the purification hall, with divine turtles and soaring serpents guarding above and below. Then visualize black *qi* emerging from the master’s kidneys, ascending like clouds. Within this black *qi*, divine turtles and soaring serpents move back and forth. Divine youths and jade maidens, the sun, moon, and *qi*-soldiers follow the previous method.\n\nAt dawn, visualize violet clouds filling the purification hall, with apotropaic lions guarding the hidden and manifest, their forms as depicted to the left. Then visualize violet *qi* emerging from the gallbladder, following the previous method.\n\nIn all visualizations of cloud-*qi*, each arises from its respective direction: azure clouds from the east, crimson clouds from the south, yellow clouds from the center, white clouds from the west, black clouds from the north, and violet clouds from above. Observe them emerging from their directions, gradually growing in abundance, thick and misty, filling the hall. Then visualize the *qi* of your own viscera emerging to merge with the clouds of corresponding colors. When *qi* and clouds unite, they become luminous, pure, fragrant, and immaculate, covering and protecting the household, the palace city, mountains, and waters—encompassing all, great and small. Divine officials and spirit-beasts align in perfect order before and behind, to left and right, within and without, above and below, hidden and manifest. In the six periods, the flourishing of numinous spirits is all-pervading.\n\nDuring the *shang jiang* lecture, sit and visualize the three colors and the Three Ones of the hun and po souls. When delivering the lecture, first visualize the three colors, then the Three Ones.\n\nThe practice has six periods, while the *shang jiang* lecture is held in three: after the morning meal, at *shang bu*, and at *ren ding*. During these three periods, enter the purification hall, take incense, bow three times, circumambulate, and return to your seat. When seated, if there is an assembly, the Dharma Master strikes the mat with a whisk and places the clapper before the knees. All close their eyes and clasp their hands firmly, visualizing azure *qi* at the head, crimson *qi* at both hands, and white *qi* at both feet. The three *qi* encircle the body, their forms as depicted to the left.\n\nVisualize the Three Ones of the hun and po souls. The Three Ones are the spirits of three regions united in one Dao. Though the Dao is fundamentally one, its responses manifest as three. Within and beyond the Three Realms, there is nowhere it is not present. It governs transformation and presides over all things, known as the Three Heavens’ Supreme. When proclaiming teachings and attending to scriptures, it is called the Three Pure Left Lords. When descending to perfect human virtue, it is named the Three Ones.\n\nThe Three Ones reside within humans, who possess three palaces: the brain is the Upper Prime Palace, its spirit named Yi; the heart is the Middle Prime Palace, its spirit named Xi; and below the navel is the Lower Prime Palace, its spirit named Wei. Each appears as an infant, all one *cun* in length. Sit in stillness, hands clasped, free from desire and action, the body devoid of all but the essential. This is what the aspirant to immortality visualizes. With prolonged and steadfast practice, spiritual penetration becomes thorough, and transformation thereafter knows no obstruction. All movements align with the Dao, the subtle is entered without fail, and the vast is encompassed without limit. It may become boundless or infinite. At the inception of observing the wondrous, one begins with the *cun*-sized form, its shape as depicted to the left.\n\nThe Perfected One says: During purification, the mind must focus on the mysterious and true, without external distractions. When thoughts turn to the scripture master, first visualize the Three Ones within their chambers, dwelling clearly and distinctly, complete with the three hun souls and seven po souls. The Great One presides over the *ni wan* palace, as in the *Hui Feng Di Yi* method. Then, together with the disciple, engage in purification and listen to the scripture. Through oral transmission and mental visualization, the Three Corpses flee, perverse *qi* is extinguished, and inner and outer receive the true. Thus, one draws near to immortality.\n\nAdditionally, practice exhalation and inhalation, guiding and harmonizing fluids, and perform the wondrous methods described above. Heavenly Perfected Ones will then descend to you. The superior adept attains the Dao within their chamber. Though dwelling in mountain caves, if even a single thread of external thought persists, it is but vain labor and wasted effort. In learning the Dao, the mind must be wholly devoted and the will resolute. The Immortals observe and test you in that very moment. Disciple, examine this carefully.\n\nWear a jade crown, a blue-green robe, and a pale yellow garment; the rest may be chosen as appropriate. When first ascending the high seat, first visualize and pay homage to the Three Worthies. Before expounding the meaning or reciting scriptures, first sit in stillness. Then rise, face the seat of the Supreme, and offer incense three times. Step back several feet, bow three times to the Three Worthies, and again visualize the scripture master, register master, and preceptor, bowing once to each—six bows in total. Then ascend the high seat, its form as depicted to the left.",
      "overlap_context": "e Evening appears, upholding rectitude to govern perversity, harmonizing and releasing arrogance, punishing evil and protecting good. Through yin virtue, she aids yang, her luminous fame as bright as jade. She is steadfast and pure; cherish and visualize her, and attainment of the true will be swift.\n\nWhen practicing the Dao, visualize the *qi*-soldiers and cavalry. At dawn, first visualize azure clouds filling the purification hall, with blue-green dragons and lions guarding the front and rear.",
      "start_char": 4314,
      "end_char": 5636,
      "start_sentence": 214,
      "end_sentence": 255,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.47017955780029,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太上老君大存思图注诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "三尊者，道尊，经尊，真人尊。 三一之尊，通乎人身，人身欲与三尊同者，清斋精思，礼拜存之，日一过如此，初下礼六拜，后重上，不须礼，下则二拜，叩搏愿念如法，赢者心拜也。 登高座，存侍卫。 登高座，安坐，敛简当心，呜鼓三十六通，咽液三十六过，临目见左青龙，右白虎，前朱雀，后玄武，足下八卦神龟，三十六狮子伏前，头巾七星，五藏生五骑，罗文覆身上，三一侍经，各千乘万气，仙童玉女卫之，其形如左： 万遍竟，云驾至。 能读《五千文》万遍，太上蕾买龙下迎，万遍毕未去者，一月三读之，须云驾至，便升仙，其形如左： 修行万遍之道，又存五云之星。 转经之后，夜半至生气之时，饱服五牙之气，坐向月建之方，叩齿九通，咽液三十六过，临目存五星，辰在头上，岁星在左肘，太白在右肘，荧惑在两膝间，镇心在心中＃１３，久久乃止。 行坐出入，常思不忘，千灾自然绝，万祸不能干，后当身上出水，身下出火，智慧六通，奄见五老。 五老是五星之精，见之，则变化自在，同升乎天也。 真人碧冠绿被黄服，车辇人物云彩并取宜 受经之后，长斋存真，舍俗习道，精思诵文。 日转十遍，涉历三年，千日之中，数充万遍。 解了究悉，具足修行，炼易备弘，身神相一，云龙来迎，上升三清。 遍毕未去，其事有二：一者功成德就，赴感济时，运未隐景，故续奖后生； 二者未究竟，行未备周，炼未能精，思未招应，虽讫未升。 方须研进，遣欲观妙，损己度人，勇猛立功，精严存念，或多或少，一月三修，物我咸通，积勋成德，念念不断，善善相联，恒见三尊，云驾自至，久必神通。 躁促则塞，塞而亿遍，亦弗能超。 超然行周，身神俱腾矣。 行周者，能七义礼智信救度天人也。 有此五德，虽具而微，不周济物，济物功少，皆非行周，无望得道。 得道之由，由行五德，行五德者，三业则定，十善事成，太一叉降，五老相携，得道无疑也。 太上老君大存思图注诀竟 ＃１此句，《云笈七签》卷四十三作『功拘迩致谬耳』。 ＃２『偏者嗜欲』，《云笈七签》本作『嗜欲偏颇者』。 ＃３此句，《云笈七签》本作『成则未分』。 ＃４此句，《云笈七签》本作『脾一又二兼济也，兼济者，信也』。 ＃５此句，《云笈七签》本作『智慧之主』。 ＃６此句，《云笈七签》本作『苍色』。 ＃７此句，《云笈七签》本作『既成由於此藏』。 ＃８此句，《云笈七签》本作『和释隔戾』。 ＃９此句，《云笈七签》本作『如云之升』。 ＃１０此句，《云笈七签》本作『又出与云色采合』。 ＃１１此句，《云笈七签》本作『……以板击席』。 ＃１２此句，《云笈七签》本作『两手气赤』。 ＃１３此句，《云笈七签》本作『镇在心中』，故文中『镇心』当作『镇星』。",
      "translated_text": "The Three Worthies are the Dao-Worthy, the Scripture-Worthy, and the Perfected-Worthy. The Three Ones’ Worthiness pervades the human body. Those who wish their bodies to align with the Three Worthies must purify themselves through fasting, refine their thoughts, and perform rites of homage and visualization. Do this once daily: first descend to perform six bows, then ascend again without further bowing. Upon descending, perform two bows, knocking the forehead and reciting vows according to the proper method—those who are weak may perform the bows in their hearts.\n\nWhen ascending the high seat, visualize the attendants and guards. Settle into a composed posture, hold the scripture tablet before the heart, strike the drum thirty-six times, and swallow saliva thirty-six times. With eyes closed, envision the Azure Dragon to the left, the White Tiger to the right, the Vermilion Bird before, the Dark Warrior behind, the Eight Trigrams and divine tortoise beneath the feet, thirty-six lions crouching ahead, the Seven Stars of the headscarf, the five viscera each generating five riders, and the net-like scriptural patterns covering the body. The Three Ones attend the scriptures, each with a thousand chariots and ten thousand qi, while jade lads and maidens serve as guards. The form is as depicted to the left.\n\nWhen the recitation of the *Five Thousand Character Text* reaches ten thousand repetitions, the Supreme Lord’s thunderous chariot descends to welcome you. If, upon completing ten thousand repetitions, you do not depart, recite it thrice monthly. When the cloud chariot arrives, you will ascend as an immortal. The form is as depicted to the left.\n\nIn the practice of the ten-thousand-repetition Dao, also visualize the Five Cloud Stars. After reciting the scripture, from midnight to the hour of generative qi, fully absorb the Five Sprouts’ qi. Sit facing the direction of the monthly constellation, knock the teeth nine times, swallow saliva thirty-six times, and with eyes closed, visualize the Five Stars: the Chronographic Star above the head, Jupiter at the left elbow, Venus at the right elbow, Mars between the knees, and Saturn at the heart. Persist in this for a long time.\n\nIn all actions—sitting, rising, coming, and going—constantly hold this visualization without forgetfulness. A thousand disasters will naturally cease, and ten thousand calamities will be unable to assail you. Later, water will emerge from above your body and fire from below. With the six penetrations of wisdom, you will suddenly behold the Five Elders.\n\nThe Five Elders are the essences of the Five Stars. Upon seeing them, you will gain mastery over transformations and ascend together into the heavens. The Perfected don a jade crown, a green robe, and a yellow garment, with chariots, attendants, and cloud motifs chosen as appropriate.\n\nAfter receiving the scripture, maintain perpetual fasting and preserve the Real. Forsake the secular and cultivate the Dao, refining your thoughts while reciting the text. Recite ten times daily, and over three years—one thousand days—complete ten thousand repetitions. Once you have thoroughly understood and fulfilled the practices, with refinement complete and virtue abundant, body and spirit will unite, and cloud dragons will come to welcome you, ascending to the Three Clarities.\n\nIf, upon completion, you do not depart, there are two possibilities: first, your merit is perfected and virtue accomplished, yet moved by compassion to aid the age, your destiny has not yet concealed your light, so you remain to inspire later generations; second, your practice is not yet exhaustive, your conduct not fully perfected, your refinement not yet precise, and your thoughts have not summoned a response—though the recitations are complete, you have not ascended. You must then further refine your progress, dispel desires, contemplate the wondrous, diminish the self to deliver others, establish merit with courage, and maintain strict visualization. Whether many or few, practice thrice monthly, harmonizing self and other, accumulating merit and virtue without interruption, linking goodness to goodness. Constantly behold the Three Worthies, and the cloud chariot will arrive of itself. With time, spiritual penetrations will surely manifest.\n\nImpatience leads to obstruction; even with a hundred million repetitions, you will not transcend. Only when your conduct is complete will body and spirit ascend together.\n\nConduct is complete when you embody the seven virtues of ritual, wisdom, trust, and salvation of heaven and humanity. Though you may possess these five virtues, if they are faint and you do not universally deliver beings, your salvific merit will be slight—this is not complete conduct, and you cannot hope to attain the Dao.\n\nThe means to attain the Dao lie in practicing the five virtues. One who practices the five virtues stabilizes the three karmas, fulfills the ten good deeds, and the Great One will descend, the Five Elders will accompany you—attainment of the Dao is then without doubt.\n\nThe *Great Visualization and Annotation of the Supreme Lord Lao* concludes.",
      "overlap_context": " chosen as appropriate. When first ascending the high seat, first visualize and pay homage to the Three Worthies. Before expounding the meaning or reciting scriptures, first sit in stillness. Then rise, face the seat of the Supreme, and offer incense three times. Step back several feet, bow three times to the Three Worthies, and again visualize the scripture master, register master, and preceptor, bowing once to each—six bows in total. Then ascend the high seat, its form as depicted to the left.",
      "start_char": 5636,
      "end_char": 6754,
      "start_sentence": 256,
      "end_sentence": 291,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.462000846862793,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太上老君大存思图注诀.txt",
        "category": "方法类"
      }
    }
  ]
}