{
  "source_id": "太上北斗二十八章经",
  "source_file": "chunked_daozang\\太上北斗二十八章经.json",
  "total_chunks": 8,
  "total_original_chars": 9955,
  "total_translated_chars": 62587,
  "total_translation_time": 291.3674578666687,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\本文类\\太上北斗二十八章经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Supreme Northern Dipper Twenty-Eighth Chapter Sutra**\n\n**Title:** *The Supreme Northern Dipper Twenty-Eighth Chapter Sutra*. The author is unknown, though it likely emerged during the Song dynasty. It purports that the Seven Primordial Star Lords of the Northern Dipper expounded twenty-eight chapters to Emperor Ming of Han on Mount Zhongnan, teaching the rites of invoking the Seven Primordial Lords to preserve life and dispel calamities. One scroll.\n\n**Source:** *Daoist Canon of the Zhengtong Era*, *Section of Divine Writings*, *Category of Original Texts*.\n\n---\n\n**The Supreme Northern Dipper Twenty-Eighth Chapter Sutra**\n\nOnce, Emperor Ming of Han wandered upon Mount Zhongnan, where he beheld a woman clad in plain white robes, her hair unbound and feet bare, seated motionless upon a stone.\n\nThe Emperor said: \"I am the sovereign of all under Heaven. Who are you, that you show no proper reverence in my presence?\"\n\nThe woman replied: \"I am a servant of the Jade Emperor of the Vast Heaven, a star official who governs the registers of the Seven Primordials of the Northern Pole. Who are *you*, to demand my obeisance?\"\n\nThe Emperor’s countenance paled, and he bowed deeply in apology: \"I am the lord of the myriad people, yet I have never encountered a true immortal. Today, by fortune, I meet you. I bow twice in reverence, blessed to gaze upon the true and sagely visage of your compassion. This is no mere coincidence of this life, but a karmic bond from past existences.\n\nI humbly beseech the Primordial Lord to take pity and transmit the true instructions, that I may govern body, life, state, and household. Let my ministers each receive and uphold them. I implore the Primordial Lord not to withhold the treasure of the great abyss, but to raise once more the thunderous voice. I shall proclaim this throughout the realm, that it may flow across mountains and rivers, and all the people may share in this encounter with the grand model.\"\n\nHe bowed twice more, then rose and stepped forward. As he gazed, he saw clouds and mist crowning her head, her feet enveloped in radiant hues, auspicious qi rising five feet into the air. The Seven Sages dwelled above, with two officials standing behind.\n\nThe Primordial Lord said: \"I am not one sage, but seven. The two star officials record the good and evil of humanity, known as the Stars of Left Assistant and Right Supporter.\"\n\nThe Emperor asked: \"What are the names of the Seven Stars?\"\n\nThe Primordial Lord replied: \"The first is Greedy Wolf, the second is Great Gate, the third is Store of Emolument, the fourth is Literary Curve, the fifth is Upright Integrity, the sixth is Martial Curve, and the seventh is Breaking Army.\"\n\n---\n\n**Ritual Invocation of the Seven Perfected Sages’ Names**\n\nWith sincere heart, I take refuge and pay homage:\nThe Great Compassionate, Great Vowed, Great Sage, Great Merciful Seven Primordial Star Lords of the Central Northern Dipper,\nThe High Perfected of the Central Northern Dipper’s Arrayed Sages,\nThe Seven Official Lords who extend life, preserve destiny, deliver from calamity, dispel misfortune, avert decline, scatter woes, and augment fate,\nThe Former Sage Emperor Ming of Han, Initiator of this Sutra,\nThe Celestial Capital’s Original Destiny of My Life,\nI humbly beseech your vast compassion to deign to witness this recitation.\n\n---\n\n**Chapter One: The Star Lord Greedy Wolf**\n\nAt that time, the Primordial Lord of the Great Dao spoke to the sagely and enlightened Emperor: \"If you now seek my true Dao to govern body, life, state, and household, cultivate equanimity in your heart and walk the path with uprightness. Heaven and Earth will bear witness, the sun and moon will take pity, the stars will aid and protect, ghosts and spirits will retreat afar, loyal ministers will assist the sovereign, and the people will know no affliction. The four seas and eight directions will resound with songs of joy and come to pay homage. The myriad people will live without strife, life will be prolonged, years will be added to your fate, the hundred passages will flow smoothly, and the Emperor’s mandate will endure forever, the Dao and qi naturally harmonious.\"\n\n---\n\n**Chapter Two: The Star Lord Great Gate**\n\nThe Primordial Lord spoke to the sagely Emperor: \"If you now seek my Dao and methods to govern the body, within the twelve hours of the day, do not lose the true Dao, and your life’s fate will be extended.\"\n\nThe Primordial Lord said: \"If you abide by the Dao, my life is in my own hands, not in Heaven’s. If you lose the Dao, the myriad stars will not protect you, a hundred misfortunes will arise in competition, and your lifespan will not be long, with calamities arising naturally.\"\n\n---\n\n**Chapter Three: The Star Lord Store of Emolument**\n\nThe Primordial Lord spoke to the sagely Emperor: \"If you now seek my Dao, cast aside wealth and sensuality, eliminate the attachments of self and others, greed and anger. Honor superiors and care for inferiors. Let wisdom and faith be your foundation, propriety and righteousness your priority. Refrain from harming life, and cease indulging in pleasure.\"\n\nThe Emperor replied: \"I seek the Dao and its methods to govern household and self, and others will follow suit. Let the people know no vexation, heed no false words, and ensure that ruler and ministers remain unconfused. Body will flourish, the Dao will align, and the myriad people will naturally follow.\"\n\n---\n\n**Chapter Four: The Star Lord Literary Curve**\n\nThe Primordial Lord spoke to the sagely Emperor: \"If you now seek my true Dao, this is no small affinity. Through kalpas past, you have followed the heavens above, and only today do you encounter us, the assembly of Star Lords. Excellent, excellent!\n\nFor the myriad people of later generations, the benefits of goodness will be boundless. The world’s abundance or scarcity, suffering or joy, are not decreed by the celestial bureaus. They are self-created by the human heart, not ordained by Heaven and Earth. You must guard against licentiousness and avoid disordered sensuality. Then the union of yin and yang will be correct, the Dao’s radiance will shine, and Heaven and Earth will naturally harmonize.\"\n\n---\n\n**Chapter Five: The Star Lord Upright Integrity**\n\nThe Primordial Lord spoke to the sagely Emperor: \"If one seeks my true Dao, throughout the twelve hours of the day, let the Azure Dragon on the left and the White Tiger on the right each occupy their proper directions. Let the dragon’s roar summon clouds, and the tiger’s howl stir the wind. Press the tongue against the upper palate, click the teeth forty-nine times, and rub the numinous with both hands. Then let the Red Ox plow the earth nine times. The Vermilion Bird will respond in front, the Dark Warrior behind, the Six Dings and Six Jias at my left and right, and the Heavenly Ding warriors and celestial soldiers before and behind me. Alone, I ride the White Dragon, and yellow qi penetrates my crown gate. My complexion will not age, my hair will not wither, my teeth will regrow when fallen. Above, I ascend to the Golden Gates; below, I cover Kunlun. My life will be extended, ruler and ministers will not fall into chaos, the myriad people will know no strife, the Dao’s radiance will shine, and Heaven and Earth will naturally harmonize.\"\n\n---\n\n**Chapter Six: The Star Lord Martial Curve**\n\nThe Primordial Lord spoke to the sagely Emperor: \"As the lord of the people in this world, if you aspire to seek my methods, I bestow upon you the virtue of Heaven’s mechanism to augment your life. Let your household and state know peace, the people live without strife, and your lifespan be extended. Within the twelve hours, let there be little joy, little fear, little pleasure, and much suffering. Moreover, in the human body, the four great elements—bone and blood—correspond to the Five Phases. When metal, wood, water, fire, and earth follow their proper sequence, the myriad things are born, and the Dao and qi harmonize.\"\n\nWhen metal and wood oppose each other, when water and fire overcome one another, humanity acts against the natural order, causing life to falter, the Dao and qi to fall out of harmony, households to know no peace, and calamity to draw near the people. Heaven and Earth cannot save them, for when one acts against the Way, a hundred misfortunes naturally follow.\n\n**Chapter Seven: The Star Lord of Destruction**\n\nThe Primordial Lord spoke to the sagely Emperor: \"To seek the methods of the highest sages is neither difficult nor easy—it lies solely in the heart of the seeker.\"\n\nThe Star Lord of Destruction asked the Emperor: \"Will you attain it?\"\nThe Emperor replied: \"It is rare to encounter, and even rarer to comprehend the teachings of the true immortals.\"\n\nThe Primordial Lord said: \"The round becomes square, the square becomes round. Within the four great elements of the human body lies a wondrous and true method. In the twelve hours, clasp your left hand with your right, and your right hand with your left. Exhale qi in nine revolutions—employ great fire and small water, small fire and great water. This will bring peace and health to the body, prevent the arising of a hundred calamities, extend your lifespan, and increase your blessings. From generation to generation, fortune and longevity will be passed down, the household and state will know tranquility, and the Dao and qi will naturally harmonize.\"\n\n**Chapter Eight: The Great Dao of the Northern Primordial Unity**\n\nThe Lady of the Northern Dipper of the Great Dao proclaimed to the vast assembly of humans and heavens: \"Those who accumulate myriad good causes reap myriad blessings, while those who accumulate myriad evil deeds suffer myriad afflictions. The wicked are ever enslaved by things, drifting through the cycles of birth and death, submerged in the sea of suffering.\n\nYet those who practice the Dao become the masters of the myriad things, untouched by the withering of the four seasons. I cause the myriad things to be empty, and those who do not cling to things avoid greed and wrath. Like clouds racing past the moon or a boat drifting while the shore appears to move, attachment to things harms the self. Know that the twofold Dharma is the mind beyond things, unattached to them. Then ruler and ministers will rejoice, the myriad people will know no suffering, the land will be purified, ghosts and spirits will show reverence, fruit trees will flourish, the five grains will ripen, the sun and moon will aid them, and the stars will protect them. The radiance of the Dao and qi will shine, and Heaven and Earth will naturally harmonize.\"\n\n**Chapter Nine: The Northern Primordial Unity**\n\nThe Emperor asked the Primordial Lady: \"The celestial registers of the highest immortals record their ceaseless journeys through day and night. What do they govern, and how many bureaus are there? I observe the radiance of day and night, the stars moving in their cycles, and the constellations arrayed in order, yet I do not understand their Way. I humbly beseech the Primordial Lady to linger like lingering auspicious clouds, to pause her crane-like steps, and to let her divine light remain, illuminating me. If I come to understand the Way of the highest immortals, I shall never forget this day’s encounter with the lofty perfected ones. I shall exhort the establishment of temples and monasteries throughout the land as eternal sanctuaries and compile the Daoist canon.\"\n\n**Chapter Ten: The Northern Primordial Unity**\n\nThe Primordial Lady said: \"Above, I govern the immortals of the myriad heavens; in the middle, I oversee the ghosts and spirits of the Five Peaks and Four Waterways; below, I manage the dark souls of the earthly prisons, the jailers of Mount Fengdu, and all beings within the Three Realms—those born from wombs, eggs, moisture, or transformation. In a single day and night, ten thousand die and ten thousand are born. The poor and lowly, the noble and wise, the karmic destinies of ghosts and spirits, the lengthening and shortening of lifespans, the violent deaths and injuries of the kalpic disasters, the jailers and prisoners, the dragon spirits who bring rain, the success or failure of the five grains, the illnesses of the four classes of people, the mountains and rivers, the waters and lands—all pass through the records of my thirty-six hundred bureau lords. In a single day and night, nothing is amiss. Heaven and Earth are impartial, and good and evil naturally unfold.\"\n\n**Chapter Eleven: The Northern Primordial Unity**\n\nThe Emperor further asked the Primordial Lady: \"Within the Three Realms, all living creatures fall under your governance. As the lord of the people, do I also belong to your jurisdiction?\"\n\nThe Primordial Lady replied: \"The immortals of the myriad heavens and the stellar generals of the celestial nets are all recorded in my registers—how much more so you! Moreover, in the primordial heavens of old, you were the marshal Tianpeng, the lord of the northern direction. Yet you conceived a fleeting thought of the strange illusions of the human world, and with that single念, you descended to become the lord of humanity. Now, having forgotten your original vow and united with the sagely and perfected, you have encountered the source of the Dao within our assembly. Suddenly, you have attained clarity, and the Dao and qi naturally return to their original state. When your heavenly blessings are complete and your merits and virtues perfected, you shall again meet Tianpeng and resume your place as the lord of heaven.\"\n\n**Chapter Twelve: The Northern Primordial Unity**\n\nThe Emperor said: \"I am overjoyed by the gracious countenance of the Primordial Lady. Today, my ministers and their families have all encountered the highest immortals and received the true teachings from beginning to end. I shall reverently follow your instructions and cultivate the ten thousand practices within the twelve hours to restore the source of the Dao. Yet I fear for the people—what methods can they use to extend their lives, eradicate sins, prolong blessings, and dispel calamities?\"\n\nThe Lady of the Northern Dipper of the Great Dao replied: \"I possess divine power and divine incantations. For all people in peril, suffering from illness, fear, or enmity, or those who seek private convenience—whether plagued by the cries of crows and a hundred omens, by *wangliang* and *chimei* spirits, or by lonely souls and lingering spirits of those who died in battle, drowned, hanged themselves, or were harmed by curses on fields, by celestial talismans bringing disease, or by pestilence—whether in childbirth where mother and child are not yet parted, or in city gods’ temples and earth shrines where spirits are unruly, or where shamans and sorcerers perform reckless and perverse rituals, bringing about inauspicious events—whether due to the kalpic disasters of Heaven and Earth, the failure of the five grains, or those who seek fame and profit, or offspring—bathe in fragrant water, and on the days of *gengshen* and *jiazi*, or on the days when the Northern Dipper descends each month, face north, burn incense, and sincerely inscribe my name: □□□□□□□ Star. All demons will be destroyed, and a hundred calamities will vanish. All shall attain auspiciousness: *Qianyuan heng li zhen*, peace and good fortune. If any ghosts disobey, their heads shall split into seven parts. The decree: *Om hum zhan ba!* Hasten as the law commands!\"\n\n**Chapter Thirteen: The Northern Primordial Unity**\n\nThe Primordial Lady said: \"For all sentient beings in peril, suffering from illness, or facing blockages on all four paths with no way out—whether men or women, family members, parents, friends, or old acquaintances—if afflicted by celestial talismans or seasonal epidemics, let them purify themselves with fasting and bathing, let their hair down and go barefoot. At midnight, the hour of *zi*, face north, or stand in the central courtyard. Write seven memorials and present them to the celestial bureaus. Invoke my name and inscribe it on the memorials: □□□□□□□ Star. In the celestial bureaus, each star lord commands thirty-six hundred stellar officials and thirty-six thousand divine lords, along with the four duty *gongcao* spirits. Swiftly submit the memorials to the Golden Gates of the Jade Palace. All calamities, hardships, and entangling sufferings shall retreat and disperse, and evil ghosts shall be obliterated. Those who do not believe shall have their heads split into seven pieces.\"\n\nThe Perfected Sovereign commands: \"Demonic spirits, perish! *Oṃ hūṃ* sever and disperse! Swiftly, swiftly, as decreed by law!\"\n\n**Section Fourteen of the Northern Primordial Compendium**\nThe Perfected Sovereign declares: Should *wangliang*, *chimei*, or lingering dead spirits not disperse, wailing day and night in terror, bringing calamities and misfortune, harming lives, consuming flesh and blood, frightening boys and girls, and causing a hundred kinds of suffering to disturb the living—let the household purify themselves with fasting and bathing. Inscribe my name: □□□□□□□ Star. I command all demons to self-annihilate, all misfortunes to dissolve, and all to attain the auspicious harmony of *Qianyuan hengli zhen*. May all affairs be peaceful. Should any ghost disbelieve, their heads shall split into seven pieces. *Oṃ hūṃ* sever and disperse! Swiftly, swiftly, as decreed by law!\n\n**Section Fifteen of the Northern Primordial Compendium**\nThe Perfected Sovereign declares: Should there be vengeful curses, buried names or binding charms, effigies of straw or wood, or sorcerers employing perverse methods to invoke inauspicious omens—disturbing dreams, inverted fortunes, disputes over fields, wealth, or property, betrayal by friends, love turned to harm, or suffering under oppressive officials and unjust imprisonment—let the afflicted, with utmost sincerity, invoke my name: □□□□□□□ Star. The Dao’s *qi* shall then enter their body, and all difficulties shall disperse. I command Marshal Tianpeng, the Four-Eyed Elder, and eighty thousand celestial soldiers and warriors—each thirty-six *zhang* in height—to shake their bells and exert their power. *Oṃ hūṃ* sever and disperse! Swiftly, swiftly, as decreed by law!\n\n**Section Sixteen of the Northern Primordial Compendium**\nThe Perfected Sovereign declares: Should the realm be unsettled, with calamities arising from all directions, or should the appointed time of heaven and earth bring disasters—celestial dragons sending floods, the earth failing to yield harvests, the five grains falling to famine, the five kalpas plunging the world into chaos, kings waging war, bandits rising, fires raging, or floods sweeping all away—let the sovereign, ministers, and common people alike, with sincere resolve, purify themselves with fasting and bathing. Prepare seven vermilion memorials, each detailing their plight, and inscribe my name upon them: □□□□□□□ Star. At midnight, the hour of *zi*, prostrate thrice in reverence. The Four Duty *Gongcao* spirits shall swiftly submit the memorials to the Golden Gates of the Jade Palace. The stellar lords shall render judgment. I command the dispatch of the Perfected Martial Great Sage of the Northern Dipper, Zhenwu, Marshal Tianpeng, the Four-Eyed Elder, and eighty thousand celestial soldiers and warriors—each thirty-six *zhang* in height—to shake their bells and exert their power. *Oṃ hūṃ* sever and disperse! Swiftly, swiftly, as decreed by law!\n\n**Section Seventeen of the Northern Primordial Compendium**\nThe Perfected Sovereign declares: Should those dwelling in villages, wilderness, prefectures, counties, cities, or alleys be afflicted by celestial talismans or seasonal epidemics—where the five pestilences and their legions spread seventy-two toxic *qi*—this is by my decree, recorded in the registers of the Seven Primordials, the *Gongcao* spirits of the Great Year, and the duty spirits of the year, month, day, and hour. Each region and county shall suffer according to its allotted measure. Some may fall ill at dawn and die by dusk, or be struck by indiscriminate death talismans, their terror unassuaged. If there are pure Daoist companions or faithful men and women, let them each, with sincere devotion, burn incense, face north, and prostrate thrice in reverence. Invoke my name: □□□□□□□ Star. The Four Duty *Gongcao* spirits shall submit their pleas to the Golden Gates of the Jade Palace. I command the dispatch of Marshal Tianpeng, the Four-Eyed Elder, and eighty thousand celestial soldiers and warriors to descend and reclaim my celestial talisman registers of the five pestilences. Swiftly, let every household attain the harmony of *Qianyuan hengli zhen*, and may every door know prosperity. The Dao’s *qi* shall naturally prevail. Shake the bells and exert power! *Oṃ hūṃ* sever and disperse! Swiftly, swiftly, as decreed by law!\n\n**Section Eighteen of the Northern Primordial Compendium**\nThe Perfected Sovereign declares: Should there be faithful Daoist followers or common folk without descendants, let them, on the days when the Dipper’s Perfected descends—*gengshen* and *jiazi*—burn incense, fast, recite my true scripture, and invoke my name: □□□□□□□ Star. Let incense and lamps burn without cease through the twelve hours, and let offerings of flowers, tea, and fruit never falter. After forty-nine days, or one hundred days, auspicious signs of the *Qian* Dao shall manifest. In the celestial bureaus, I oversee the registers, determining their allotted rank. I shall inscribe the birth of a wise son, blessed with a lifespan of a hundred years, free from calamity or hindrance, pure in virtue and power, to assist the human sovereign. Or, should they be destined for the *Kun* Dao, I shall grant the birth of a daughter of noble appearance, endowed with exceptional fortune and virtue. Such is the autonomous power of the divine. I command the auspicious harmony of *Qianyuan hengli zhen*! Swiftly, swiftly, as decreed by law!\n\n**Section Nineteen of the Northern Primordial Compendium**\nThe Perfected Sovereign declares: Should parents, siblings, spouses, children, or other kin be imprisoned, executed, or perish by law; or fall victim to disputes over wealth or desire, languishing in bitter realms without hope of rebirth; or suffer in childbirth, mother and child undivided in death, their souls lingering in darkness, unable to ascend, bound to the ghostly realm without prospect of escape—let their faithful kin, on the days when the Dipper’s Perfected descends—*gengshen* and *jiazi*—at midnight, the hour of *zi*, burn incense with sincere devotion and invoke my name: □□□□□□□ Star. Declare their plight, face north, and prostrate thrice in reverence. I shall petition the Golden Gates of the Jade Palace, summoning the duty spirits and the Four-Eyed Elder to report to the *Gongcao* of life inscription. They shall record the dead according to their destined time, and in accordance with their karma, grant them rebirth. Shake the bells and exert power! *Oṃ hūṃ* sever and disperse! Swiftly, swiftly, as decreed by law!\n\n**Section Twenty of the Northern Primordial Compendium**\nThe Perfected Sovereign declares: Should soldiers or civilians perish in battle, bound by karmic grievances and unable to escape, let them purify their hearts with fasting, abstain from meat, wine, and the five pungent roots, let their hair down, and go barefoot. Face north and invoke my name: □□□□□□□ Star. In the celestial bureaus, I shall command Marshal Tianpeng to dispatch the Perfected Martial Great Sage of the Northern Dipper, Zhenwu, the Supreme General of the Dark Warrior, the Four-Eyed Elder, and eighty-four thousand celestial soldiers and warriors—each thirty-six *zhang* in height—to shake their bells and exert their power. *Oṃ hūṃ* sever and disperse! Swiftly, swiftly, as decreed by law!\n\n**Section Twenty-One of the Northern Primordial Compendium**\nThe Perfected Sovereign declares: Should merchants traveling by boat encounter rapids where waves endanger their heavy cargo, or find themselves at sea without wind for their sails, unable to distinguish day from night, assailed by malevolent spirits—dragons, mirages, demons, or ghosts—let them swiftly inscribe my name: □□□□□□□ Star, along with the talisman, and cast it into the water. I shall command the celestial soldiers and warriors under my authority, the local water and earth deities, the River Earl, the Water Officials, and all spirits of city gods and earth altars to exert their power, aiding them to escape suffering and demonic perils. Those who disbelieve shall have their heads split into seven parts. Swiftly, swiftly, bring peace! *Oṃ hūṃ* sever and disperse! Swiftly, swiftly, as decreed by law!\n\n**The Perfected Talisman for Rescuing from Water Perils**\nBy the Emperor’s decree, divine and efficacious, the Seven Perfected of the Central Heaven.\nThe divine talisman’s proclamation ensures the safety of people and boats.\nSwiftly, swiftly, as decreed by the Great Emperor of the Northern Pole!\n\n---\n\n**Section Twenty-Two of the Northern Primordial Compendium**\nThe Perfected Sovereign declares: Should devout men or women, pure in heart, observe long fasts and invoke my name: □□□□□□□ Star, practice my great Dharma, study my true scriptures, and prostrate themselves for forty-nine days and nights, including auspicious evenings—or even for a lifetime or across kalpas in upholding the true Dharma, accumulating hidden merits—then in their next rebirth, they shall ascend to the celestial realms. The celestial bureaus shall record their names, and as they pass through villages, communities, or temples, they need not bow to the local spirits, who shall be unsettled and dare not accept their reverence. Instead, these ghosts and deities shall flee a thousand *li* away or sink a thousand *chi* into the earth. Those who disbelieve shall have their heads split into seven parts. *Oṃ hūṃ* sever and disperse! Swiftly, swiftly, as decreed by law!\n\n---\n\n**Section Twenty-Three of the Northern Primordial Compendium**\nThe Perfected Sovereign addresses the Emperor: When people perform the *Chaoyuan* rites and Dharma practices, purifying body and mind to eradicate past karmic deeds, relinquishing all deluded thoughts and unwholesome intentions—regarding the foolish as cherished as jewels in their palms, yet seeing the noble as irritants like sand in their eyes—when their minds and actions turn to all manner of unwholesomeness, whether due to karmic debts from three lifetimes, their own malevolence, the death of family members, insufficient clothing or food, lack of noble patrons, domestic or national unrest, or whether they act as commoners, for others, for fame or profit, for constructing graves or buildings, for themselves, their families, their nation’s military campaigns, their parents’ illnesses, disasters of water or fire, or the depravities of evil people—when subjected to official punishments or all manner of misfortunes, let each person sincerely purify themselves through fasting and the Dao, bathe in fragrant waters, don plain robes and caps, red shoes, and a wooden tablet one *chi* and two *cun* in length. Let them prepare a sandalwood altar, painted with cinnabar, two *chi* and four *cun* long and seven *cun* and seven *fen* high, with an incense burner placed upon it. Ascend to a high place, face north, and with utmost sincerity, gaze toward my celestial palace until midnight. Invoke my name and perform three sets of three prostrations. From the first to the seventh day of the seventh month, for seven nights, arrange incense and lamps with devout reverence and bow in homage.\n\n**First *Chaoyuan* Prostration (three bows):**\nRise, hold the tablet, and declare your intentions:\n*\"Your servant petitions the Perfected Sovereign of the Northern Dipper and all celestial asterisms. May the clarity of heaven and earth witness this: let all ghosts, deities, heavenly dragons, and beings receive the enduring Dao-qi of their respective paths, and may the myriad things of heaven and earth arise naturally.\"*\n\n**Second *Chaoyuan* Prostration (three bows):**\n*\"Your servant petitions the Perfected Sovereign of the Northern Dipper: In past years, when my parents passed away, I feared they might fall into the dark paths, enduring the torments of hell, long sunk in the ghostly realms, their sins recorded in the underworld bureaus, unable to transcend. With no means to repay the grace of heaven and earth, the love of parents who bore me, or the teachings of friends and mentors—*\n*If my parents are still alive, I humbly pray that the Perfected Sovereign, with the gaze of wisdom from the celestial offices, bestow upon me a single repayment: may the living gain blessings, the departed transcend, and may my parents forever follow the Dao’s teachings, eternally freed from suffering.\"*\n\n**Third *Chaoyuan* Prostration (three bows):**\n*\"Your servant petitions the Perfected Sovereign of the Northern Dipper: I, a humble being in the lower realm, am a mortal whose fate is recorded in the celestial registers of the Perfected Immortals. My clothing and food are insufficient through the four seasons, my wealth and grains perpetually depleted. My endeavors fail, and I fear my past sins have accumulated to this day. With no means to express my gratitude, I now, by good fortune, have encountered the true teachings of the Perfected Immortals. Following the rites and Dharma, I prostrate myself, humbly praying that the Perfected Sovereign bestow upon me a hundred blessings and a thousand auspices, that all things attain the primal harmony of *qian*, and that the myriad things flourish in uprightness. Your servant bows again in reverence.\"*\n\n---\n\n**Section Twenty-Four of the Northern Primordial Compendium**\nThe Perfected Sovereign further addresses the Emperor: On the ninth night of the ninth month, at midnight during the *zi* hour, perform the *Chaoyuan* rites and Dharma practices, entrusting them to those who take refuge in my Dharma and propagate it among the people of the world. Liberate the hungry ghosts, animals, those born from wombs, eggs, moisture, or transformation, as well as prisoners in hell and all beings in suffering. On this night, the Northern Dipper’s celestial chariot, the High Perfected, records the registers of merit and sin, determining people’s clothing, food, fortune, poverty, nobility, servitude, and all other conditions. All is fixed in this month’s records, with no discrepancy between good and evil. I expound this scripture and Dharma for the sake of all sentient beings—ghosts, deities, the myriad people, the four kinds of birth, hungry ghosts, the kings and ministers of the world, soldiers, commoners, and all beings. Should they follow my Dharma and perform the nine nights of *Chaoyuan* rites, I shall, from my celestial palace, meticulously review and select their destinies among the immortals of the southern realms, granting their wishes to the finest detail.\nShould they seek the Dao and its methods, the heavenly Dao shall hear and respond to their prayers.\nShould they seek clothing, food, official rank, or emoluments, they shall receive a hundred blessings and a thousand fortunes, their personal Dao-qi enduring, and the myriad things arising naturally.\n\nAt midnight during the *zi* hour on the first day of the ninth month, prostrate before the first palace of the Northern Dipper, the Star Lord of Greed and Wolf. Within the first case, he oversees three hundred and sixty star officials, three hundred and sixty bureaus, and thirty-six hundred celestial offices. Clad in azure robes, crowned with an azure cap, and shod in red shoes, he holds a green tablet. He is attended by thirty-six hundred youths, dressed in azure, bearing green banners and floral canopies, corresponding to the *jia-yi* wood of the east.\n\nThe Star Lord of Greed and Wolf judges the affairs of the living and the dead.\nYour servant invokes the Northern Dipper’s Star Lord of Greed and Wolf, who benevolently records the life and death of mortals, ensuring equitable good deeds. May the sovereign enjoy ten thousand years of life, court ministers remain loyal, and human affairs flow in harmony. Spare them from exile, execution, or decapitation, that each may be born and die in goodness, never obscuring the heart of the Dao. May pure *qi* endure, and the myriad things arise naturally. Such a person shall accrue three thousand six hundred and ninety measures of merit, their transgressions gradually dissolving. Swiftly, swiftly, as decreed by the statutes!\n\nAt midnight during the *zi* hour on the second day of the ninth month, prostrate before the Northern Dipper’s second palace, the Star Lord of Great Gate, who benevolently records longevity among mortals. Within his case, he oversees three hundred and sixty star officials, three hundred and sixty bureaus, and three thousand six hundred celestial offices. Clad in yellow robes, crowned with a yellow cap, and shod in red shoes, he holds a yellow tablet. He is attended by three thousand six hundred youths, dressed in yellow, bearing yellow banners, corresponding to the *wu-ji* earth of the center.\n\nThe Star Lord of Great Gate judges the affairs of the living and the dead.\nYour servant invokes the Northern Dipper’s Star Lord of Great Gate, who benevolently records equitable good deeds among mortals. May the sovereign enjoy ten thousand years of life, and worthy ministers assist the state. May human affairs flow in harmony, sparing them from exile, execution, or decapitation, that each may be born and die in goodness, never obscuring the heart of the Dao. May pure *qi* endure, and the myriad things arise naturally. Such a person shall attain five thousand one hundred and seventy measures of merit, their transgressions eradicated. Swiftly, swiftly, as decreed by the statutes!\n\nAt midnight during the *zi* hour on the third day of the ninth month, pay homage to the Northern Dipper’s third palace, the Star Lord of Emolument and Existence, who records the affairs of the orphaned, widowed, lame, and blind among the four classes of people. Within his case, he oversees three hundred and sixty star officials, three hundred and sixty bureaus, and three thousand six hundred celestial offices. Clad in black robes, crowned with a black cap, and shod in red shoes, he holds a black tablet. He is attended by three thousand six hundred youths, dressed in black, bearing black banners, corresponding to the *ren-gui* water of the north.\n\nThe Star Lord of Emolument and Existence judges the affairs of the living and the dead.\nYour servant invokes the Northern Dipper’s Star Lord of Emolument and Existence, who benevolently records the equitable life and death of mortals. Spare them from imprisonment, untimely death, or the extinction of the orphaned, widowed, and impoverished. May they never obscure the heart of the Dao. May pure *qi* endure, and the myriad things arise naturally. Such a person shall attain five thousand one hundred measures of merit, their transgressions dissolved. Swiftly, swiftly, as decreed by the statutes!\n\nAt midnight during the *zi* hour on the fourth day of the ninth month, prostrate before the Northern Dipper’s fourth palace, the Star Lord of Literary Brilliance, who records the success and failure of mortals. Within his case, he oversees three hundred and sixty star officials, three hundred and sixty bureaus, and three thousand six hundred celestial offices. Clad in black robes, crowned with a black cap, and shod in red shoes, he holds a black tablet. He is attended by three thousand six hundred youths, dressed in black, bearing black banners, corresponding to the *ren-gui* water of the north.\n\nThe Star Lord of Literary Brilliance judges the affairs of the living and the dead.\nYour servant invokes the Northern Dipper’s Star Lord of Literary Brilliance, who benevolently records the life and death of mortals, ensuring all other matters remain equitable. Spare them from licentiousness, failure, imprisonment, untimely death, or extinction. May they never obscure the heart of the Dao. May pure *qi* endure, and the myriad things arise naturally. Such a person shall attain three thousand three hundred measures of merit, their transgressions eradicated. Swiftly, swiftly, as decreed by the statutes!\n\nAt midnight during the *zi* hour on the fifth day of the ninth month, prostrate before the Northern Dipper’s fifth palace, the Star Lord of Integrity and Chastity, the Fire Star attended by the Merit Clerk. Within his case, he oversees three hundred and sixty star officials, three hundred and sixty bureaus, and three thousand six hundred celestial offices. Clad in crimson robes, crowned with a red cap, and shod in red shoes, he holds a vermilion tablet. He is attended by three thousand six hundred youths, dressed in crimson, bearing red banners, corresponding to the *bing-ding* fire of the south.\n\nThe Star Lord of Integrity and Chastity judges the affairs of the living and the dead, recording the matters of wind and fire among mortals.\nYour servant invokes the Northern Dipper’s Star Lord of Integrity and Chastity, who benevolently records the trials of life and death among mortals. Spare them from imprisonment, dissolve fire calamities, and safeguard commanderies and cities. May households be free from malevolent omens, and people enjoy peace and health. May divine spirits guard their gates, benefiting both public and private affairs. May they always encounter good fortune, never obscuring the heart of the Dao. May pure *qi* endure, and the myriad things arise naturally. Such a person shall attain three thousand three hundred measures of merit, all transgressions and faults utterly eradicated. Swiftly, swiftly, as decreed by the statutes!\n\nAt midnight during the *zi* hour on the sixth day of the ninth month, prostrate before the Northern Dipper’s sixth palace, the Star Lord of Martial Brilliance, who records the gold, silver, grains, and wealth of mortals. Within his case, he oversees three hundred and sixty star officials, three hundred and sixty bureaus, and three thousand six hundred celestial offices. Clad in white robes, crowned with a plain cap, and shod in red shoes, he holds a white tablet and registers. He is attended by three thousand six hundred youths, dressed in white, bearing white banners, corresponding to the *geng-xin* metal of the west.\n\nThe Star Lord of Martial Brilliance judges the affairs of the living and the dead.\nYour servant invokes the Northern Dipper’s Star Lord of Martial Brilliance, who benevolently records the wealth of mortals, ensuring it benefits others without malice. Spare them from imprisonment, untimely death, or misfortune. May the true stars of the Dipper bestow blessings, their life’s destiny bringing auspiciousness. May their clothing and emoluments increase in abundance, their original destiny protected. May divine spirits grant their shelter. May they never obscure the heart of the Dao. May pure *qi* endure, and the myriad things arise naturally. Such a person shall attain two thousand four hundred measures of merit, their transgressions eradicated. Swiftly, swiftly, as decreed by the statutes!\n\nAt midnight during the *zi* hour on the seventh day of the ninth month, prostrate before the Northern Dipper’s seventh palace, the Star Lord of Destruction and War, who records the violent deaths, executions, and imprisonments of mortals. Within his case, he oversees three hundred and sixty star officials, three hundred and sixty bureaus, and three thousand six hundred celestial offices. Clad in white robes, crowned with a plain cap, and shod in red shoes, he holds a white tablet. He is attended by three thousand six hundred youths, dressed in white, bearing white banners, corresponding to the *geng-xin* metal of the west, as well as the celestial, terrestrial, and mortal domains governed by the Five Phases’ transformations of generation and flourishing. May auspiciousness spread through the star palaces and their stations. They stand to the right.\n\nThe Star Lord of Destruction and War, pivot of the jade celestial mechanism, axis of the Dipper’s hub, arbiter of the living and the dead. Your servant humbly petitions the Star Lord of Destruction and War of the Northern Dipper, the Heavenly Stem Great Sage Dharma King Heavenly Lord, the Inner Enclosure Emperor’s Throne Venerable Star Lord, the Outer Enclosure Terrace-Assistant Longevity and Prosperity Lord, the Life-Prolonging and Destiny-Protecting Lord, the Calamity-Dispelling and Disaster-Eradicating Lord, the Decay-Supporting and Misfortune-Dispersing Lord, the Lifespan-Enhancing and Harmony-Balancing Lord, the Seven Primes Generals, and the Nine Palaces Heavenly Queen. First, I beseech forgiveness for the thousand transgressions and ten thousand sins of your servant’s past and present lives. Next, I beseech deliverance for the lingering souls of ancestors and departed kin, bound by grievances. May your servant be spared suffering and distress, granted favorable karmic conditions, untouched by the myriad calamities, with malevolent spirits subdued and hidden. May all that is sought be attained, and all that is pursued be prosperous.\n\nMoreover, beneath the palace of the Star Lord of Destruction, benevolent records are made of mortal injuries, violent deaths, and the afflictions of prisoners and those in bondage. I beseech the celestial grace that my Dao-heart remain unobscured, with pure *qi* enduring eternally, and all things in their natural state. May merchants and travelers, public and private affairs, all be blessed with myriad fortunes. May descendants flourish, and the primal harmony prevail. Such a person shall accrue three thousand eight hundred merits. Swiftly, swiftly, as the law commands!\n\nOn the eighth night of the ninth month, at midnight, prostrate before the Northern Dipper’s eighth palace, the Star Lord of the Left Assistant, arbiter of the living and the dead, who records the fates of servants and slaves among mortals. Within his case, he oversees three hundred and sixty star officials and three hundred and sixty celestial offices, each holding registers to govern the lifespans and deaths of the world’s servants and steeds. Your servant petitions the Star Lord of the Left Assistant, who benevolently records the affairs of mortal servants and slaves, sparing them from imprisonment, death, and the loss of human form. May pure *qi* abide naturally, and all matters harmonize.\n\nOn the ninth night of the ninth month, at midnight, prostrate before the Northern Dipper’s ninth palace, the Star Lord of the Right Assistant, arbiter of the living and the dead, who records the fates of maidservants and bondswomen among mortals. Within his case, he oversees three hundred and sixty star officials and three hundred and sixty celestial offices, each holding registers to govern the lifespans and deaths of the world’s maidservants and bondswomen. Your servant petitions the Star Lord of the Right Assistant, who benevolently records the destinies of mortal maidservants and bondswomen, sparing them from imprisonment and bondage, and preserving their human form in life and death. May pure *qi* endure eternally, all things be in their natural state, and all matters harmonize.\n\nBy the August Mandate of the Supreme Emperor, this decree is issued to the Heavenly Talisman Marshal of the Capital of All Heavens, the True Lord who executes affairs, the Ghost King of Epidemic Diseases for the twelve-year cycle, the five pestilence ghost hosts of the *jia-yi* wood essence of the east, the five pestilence ghost hosts of the *bing-ding* fire essence of the south, the five pestilence ghost hosts of the *geng-xin* metal essence of the west, the five pestilence ghost hosts of the *ren-gui* water essence of the north, the five pestilence ghost hosts of the *wu-ji* earth essence of the center, the myriad epidemic ghost spirits of the world, the twenty-four *qi* spirit kings, the seventy-two seasonal ghost kings, and all epidemic ghost spirits under the jurisdiction of the Cave Abyss Samādhi. Whether by the phases of the Five Agents—metal, wood, water, fire, or earth—when metal and wood clash, mortals suffer executions and exile; when water and fire clash, mortals suffer violent deaths or injuries by tigers and wolves; when water and earth clash, mortals suffer from jaundice and perish in epidemics. These ghosts are burned by fire.\n\nThis decree commands them to descend year by year and month by month to their respective prefectures and counties, visiting every household in temples and monasteries across the land to inspect and record their merits and transgressions. Those who fail to practice virtuous dharma shall be struck down by celestial thunder, burned by fire, or drowned by water. Whether officials, the wealthy, or the powerful, those who accumulate no goodness, perpetrate evil, and fail to recognize the worthy—be they magistrates, jailers, or village heads—who exacerbate the law’s severity, oppress the good, and ignore the cries of the people, or whose superiors remain blind to virtue, shall be punished. This decree commands the Four-Eyed Elder, who shakes the bell and wields the executioner’s blade, to lead the hosts of the five pestilences in their descent to the mortal realm. Those who defy this law, mocking or insulting it, shall be annihilated, their lineages extinguished.\n\nThe Primordial Lord further addressed the Emperor: On the ninth night of the ninth month, at midnight, if one, together with their household, observes a pure fast, practices the Dao, dons immaculate robes and cap, and offers fragrant incense and white memorials, prostrating thrice in succession and presenting their wishes, I shall observe them from the Seven Primes Palace. At the Golden Gates of the Celestial Palace, the celestial officials on duty for the year, month, day, and hour, along with the True Officer of Heaven, shall promptly receive and present their petitions. Whatever is sought or revealed shall be swiftly judged as good or evil, and their fate determined. The living shall have their lifespans extended, and blessings and prosperity shall come naturally. Descendants shall inherit these fortunes generation after generation. The departed shall ascend to heaven, escape the realms of suffering, and be reborn in auspicious destinies. If seeking fame or profit, their rank shall correspond to their aspirations. If redressing grievances, their cases shall be sent to the courts of Fengdu and Mount Tai, swiftly adjudicated in the Bureau of Retribution. Heaven and earth are impartial. Should a king prostrate before the Dipper, his realm and the four directions shall know peace, the eight wilds shall submit, the five grains ripen, fruits and trees flourish, and the people live without strife. Heaven and earth shall protect him, and the stars shall honor him. Should one with a pure Dao-heart prostrate before the Dipper, their district shall be free of demonic afflictions. Such a person, through sincere devotion and accumulated merit, prostrating for one, two, or three years—or eighteen years—shall enable the seven ancestors and nine lineages to transcend and be reborn in blissful realms, while the living shall gain blessings. Those who defy this law shall have their heads split into seven parts, their lifelines severed.\n\n**Chapter Twenty-Five: The Northern Dipper’s Entrusted Petition**\nThe superior adept forgets form to seek the truth of the Dao. The Dao’s profound mystery holds dominion over the world, adapting to circumstances and transforming in response, like the tortoise’s divination or the oracle’s discernment of fortune and misfortune. Heaven sends sweet rain to universally succor all things, benefiting the world and aiding humanity, arriving without announcement. Heaven and earth nurture the myriad beings—thus is the superior adept’s pursuit of the Dao.\n\nThe middling adept seeks the Dao for fame and profit, an external learning that abandons the burning house of worldly attachments, indulging in fleeting pleasures, ensnared by material desires. Their lifelong suffering extends to their descendants, who endure hardship for generations. Excess in food and clothing wastes heaven and earth’s labor. The Three Offices impose retribution, reducing them to poverty, their suffering spanning lifetimes, their deaths consigning them to the dark paths without hope of escape—thus is the middling adept’s pursuit of the Dao.\n\nThe inferior adept seeks the Dao, treating it as a mere gateway, coveting wealth and sensual pleasures, discoursing on past and present with their lips while their hearts know only deceitful conduct. They prize the pursuit of food and clothing, oblivious to the Dao’s source, drifting through the cycles of life and death, sinking into the苦海 of suffering. The Three Offices consign them to the underworld courts, condemning them to rebirth as oxen or horses, spinning endlessly through the wheel of existence. Death casts them into rebirth, never to encounter the true Dao, never to hear of meritorious deeds—thus is the inferior adept’s pursuit of the Dao.\n\n**Chapter Twenty-Six: The Northern Dipper’s Entrusted Charge**\n\nThe Primordial Sovereign of the Great Dao and Northern Dipper once more addressed the Emperor, saying: On the days when I descend from the celestial palace each season and month, I lead the hosts of heaven’s immortals, the Four-Eyed Elder, and the twelve hourly messengers of the Four Quarters to the lower realms. There, we inspect kings, ministers, prefectural and county officials, scholars and commoners, monks and nuns, Daoists and laity, as well as the spirits of mountain forests, altars, and temples, the river lords and water officials, the deities of heaven and earth, mountains and rivers, the Yangzi, Huai, and Ji, the numina of trees and ancient woods, the spirits of cliffs and caves, and the bridges and aged trees that have grown sentient over centuries—all the *wangliang* demons, monstrous apparitions, and various dragons and *shen* that feed on human blood and take human lives. We examine the dwellings and ancestral tombs of the people, all construction and orientation of residences, and whether they have offended the celestial stars or terrestrial constellations, along with every virtuous thought in the hearts of all people.\n\nThe intent of the Great Dao is to act with impartiality, to succor the poor and destitute, to provide clothing and food, and to offer medicine to all the sick. We interrogate the local deities—kings of spirits, altar lords, household earth gods, Stove Lords, and the seventy-two deities of taboos—regarding the inhabitants of each dwelling: good men and faithful women, elders and juniors, masters and servants, bondservants and maidservants, or even sojourners. If any, with sincere hearts, aspire to the primordial and reverently uphold the Dipper’s methods, they shall receive boundless clothing and food, their lifespans extended, and they shall be spared from warfare, misfortune, and all suffering. They will be granted 11,800 merits, constantly protected by benevolent stars. The dragon spirits of their dwelling’s domain shall also receive 32,000 merits and 88,000 ranks of emolument, transcending the ghostly realms to be reborn in the celestial cities and palaces of the upper realms. There, they shall enjoy the joys of humans and gods, ascending to the ranks of stellar officials and perfected lords.\n\nFor those who align their dwellings and orient their palaces, great peace shall be attained, their every wish fulfilled, and the gods shall guard and bless them.\n\nMoreover, if kings, great ministers, civil and military officials hear of the Northern Dipper’s entrusted charge and, with reverent hearts, gaze toward the Dipper from afar to pay homage, beseeching the blessing of peace for their states and families—\n\nOr if the people of the world, with their entire households and loved ones, unite in faith, purify body and mind, and sincerely pay homage to the primordial, they shall receive the celestial courts’ inscription of blessings, their names recorded in the earthly registers. The Southern Dipper shall inscribe their lives, and the Primordial Chronograms shall protect them together. The Three Officials—the Emperors of Heaven, Earth, and Water—and the hosts of immortals of the Three Bureaus shall jointly memorialize the accumulated merits to the Northern Pole Great Emperor. The Dipper Pivot of Our Northern Bureau shall dispatch the Four-Eyed Elder to lead the 3,600 case offices in compiling and submitting the records to the Jade Emperor of the Golden Portal of the Supreme Heaven. We shall personally memorialize their elevation to the rank of Impartial Life-Inscribing Perfected Lords, jointly governing the people of the lower realms, dispelling all noxious *qi*. Their living kin shall be protected by the myriad spirits, their descendants generation after generation delivered from disaster and blessed with fortune—this is no empty promise.\n\nIf there are people who do not practice the virtuous Dao, who cheat in weights and measures, whose hearts harbor hidden malice, who commit manifold evil deeds, who scheme against the good—then the spirits shall strike their names from the registers, diminishing their blessings, emoluments, and lifespans. Their names shall be inscribed in the ledgers of sins and sent to hell, forever losing their human form. They shall drift through the cycles of life and death, rarely encountering liberation. If reborn, they may lack the six senses or endure all manner of suffering: their spirits dimmed, their clothes insufficient to cover their bodies, their food inadequate to fill their mouths, or they may suffer imprisonment, hardship, and unending peril.\n\nThe Primordial Sovereign further addressed the Emperor, saying: All living beings who think and act with goodness shall receive the retribution of good fruits; those who think and act with evil shall receive the retribution of evil karma. The words of the Great Dao are true and not false. Those who do not believe shall be punished by countermanding the law: I shall command the Five Thunder Messengers of the Central Heaven to strike them down with thunderbolts, the Five Pestilence Great Commissioners to afflict them with deadly diseases, and the hosts of the Fiery Star of the Southern Thearch to incinerate and annihilate them.\n\nEach year, on the days of My seasonal descents, I traverse the regions and domains, inspecting the guardian spirits of states, commanderies, prefectures, counties, towns, and villages, the dragon spirits of altars and dwellings, the Stove Lords, and the deities of the land. The Four-Eyed Elder examines the city gods, earth masters, and local spirits, along with the altar lords of the Nine Provinces and Ten Continents, the Stove Lords, and the recording deities of the registers. Each month and hour, they transcribe the good and evil of the human world and memorialize it to the celestial courts—reward and punishment are impartial.\n\nMoreover, on the twenty-fifth and twenty-sixth days of the first month, the third and seventh days of the second month, and the twenty-third and twenty-sixth days of the third month—these three months being spring—the Celestial Thunder and Celestial Fire shall burn away those who die from the Five Pestilences and seasonal epidemics. Those who study the Dao and seek the true, their hearts undivided, shall have their blessings inscribed and their lives extended.\n\nOn the seventeenth and twenty-seventh days of the fourth month, the fifth, thirteenth, and twentieth days of the fifth month, and the fourth and eighth days of the sixth month—these being summer—the dragons shall distribute rain, and the records of good and evil shall be compiled according to their weight. Those who accumulate goodness shall receive tenfold recompense in full; those who accumulate evil shall have their merits reduced by four-tenths.\n\nOn the fourth and twenty-fourth days of the seventh month, the eleventh, nineteenth, and twenty-seventh days of the eighth month, and the third and eighteenth days of the ninth month—these being autumn—the harvest of the five grains shall be assessed, and the degrees of good and evil shall be apportioned. The registers shall be transcribed and compiled, blessings and misfortunes adjusted, with not the slightest partiality.\n\nOn the tenth and twenty-sixth days of the tenth month, the first, ninth, seventeenth, and twenty-fifth days of the eleventh month, and the twentieth day of the twelfth month—these being winter—the deities shall inspect the good and evil, the hidden and concealed, of the people across the Four Heavens. Moreover, at midnight of the thirtieth day of the twelfth month, as the Year-Star of the old year yields to that of the new, the positions of the Three Sha and the Twelve Taboos shall be assessed. For those of sincere devotion, regardless of high or low station, noble or base—whether spirits in the ghostly realm, beings in the animal realm, or souls in the hellish realm; whether women wishing to be reborn as men; those bedridden with chronic illness; those robbed by brigands on the road; those falsely accused by enemies; those afflicted by official calamities or misfortune; those framed by neighbors; those imprisoned for years with no hope of release; those stricken by the Five Pestilences; those cursed by sorcerers; those at odds with brothers; those in discord with spouses; those entangled in the pursuit of fame and profit; those without sons or daughters; those trapped in evil destinies or unkind places; those beset by floods or sea-monsters; those whose construction of altars or selection of directions has erred in year, month, day, or hour, offending inauspicious stars or malevolent spirits; or those engaged in warfare or entering battle with all manner of uncertainties—on the days when the Perfected of the Dipper descend, let them purify themselves, fast with sincerity, burn incense, and prostrate in worship, facing north with single-minded reverence. Let them present their pleas, and I, the Recording Immortal of the Dipper’s Bureau, shall weigh the degrees of their goodness and evil. I shall dispel misfortune and bestow blessings: if their karmic burden is heavy, their hidden sins shall be meted out, lest they fall from human form; if their virtuous power is great, I shall inscribe for them fifteen thousand eight hundred blessings. With their Dao-practice pure and their merit complete, the Perfected Immortals of my Dipper Palace shall memorialize the Jade Emperor of the Golden Portal of the Vast Heaven, beseeching the issuance of a sacred decree and talismanic command. The Great Sage Marshal Tianpeng, the Perfected Warrior of Dark Might, shall lead his generals, the Four-Eyed Elder, and their divine retinues, each manifesting a dharma-body of thirty-six *zhang*, to obey the decree at all times and rescue the living, daring not disobey the command.\n\nI proclaim this scripture to open the paths of deliverance for both the living and the dead, that the wronged and the deceased may each attain liberation, and that the living and the virtuous may together increase in fortune and longevity. Those who cultivate the Dao of immortality shall swiftly attain immortal rank. Such are the great responses to reciting this scripture, venerating the Primordial, and worshipping the Dipper.\n\nShould any ghosts or spirits disbelieve and defy my words, their heads shall shatter and their clans be annihilated. By my decree, I shall sever their demonic roots—hasten, hasten, in accordance with the law!\n\n**Chapter Twenty-Seven: The Dipper’s Entrustment**\nThe Lady of the Primordial again addressed the Emperor, saying: In future kalpas, when you attain the rank of High Perfected and Upper Immortal, and become Marshal Tianpeng, I shall bestow upon you the sacred illumination of my touch upon your crown, granting you eighteen thousand blessings. With your pure Dao-conduct and sublime merit, widely propagate my Dharma to benefit the living in the world, for all shall depend upon your sagely and luminous great field of blessings.\n\n**The Lady of the Primordial Praises the Scripture, saying:**\nA household with the Dipper Scripture brings peace to family and state.\nA household with the Dipper Scripture naturally enjoys long life.\nA household with the Dipper Scripture sees the dead attain rebirth.\nA household with the Dipper Scripture cannot be harmed by official calamities.\nA household with the Dipper Scripture sees its five grains ripen of themselves.\nA household with the Dipper Scripture cannot be invaded by malevolent spirits.\nA household with the Dipper Scripture finds safety even in the dead of night.\n\n**Chapter Twenty-Eight: The Dipper’s Entrustment**\nThe Lady of the Primordial said: I now bestow upon you, one and all, the charge to uphold and protect these true words, which surpass gold and jade in value. This is the Dharma of the Jade Emperor of the Vast Heaven—auspicious and wondrous verses, radiant as the sun and moon, bright as the stars and Dipper. I now grant it to you to govern the world of mortals. May all people return to the good Dao, and may each and every one revert to the Primordial and face the Origin.\n\nShe further addressed the Emperor, saying: Protect the people well, and forever serve as the master of the Dharma for heaven and earth, mountains and rivers. Disseminate it through the world, that its merit not be obscured. The preceding chapters have been distinguished one by one, and there is no falsehood in them.\n\nOur assembly now receives the Jade Emperor’s decree to proclaim this edict. We shall not tarry long, but each return to our celestial abodes. This scripture must not be treated with disrespect. You must purify yourselves, burn incense with utmost sincerity, don Daoist robes and plain garments, and recite it with single-minded devotion, as if facing me in person.\n\nUpon hearing these words, the Emperor bowed deeply, prostrated himself twice, and took his leave. The sagely carriage returned to the immortal palace. The August Emperor of the Great Han, the Sagely Lord Ming, then issued an edict to the provincial departments, directing that the scripture be delivered to renowned mountains, blessed lands, and Daoist abbeys for transcription and transmission to humans and gods, that all may believe, receive, and uphold it.\n\nHere ends the *Scripture of the Twenty-Eight Chapters of the Northern Dipper of the Most High*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上北斗二十八章经 经名：太上北斗二十八章经。 撰人不祥，约出於宋代。 假托北斗七元星君於终南山为汉明帝说经二十八章，言礼诵七元星君，保命消灾之事。 一卷。 底本出处：《正统道藏》洞神部本文类。 太上北斗二十八章经 昔汉明帝游终南山，见一女人，身着素衣，披发跣足，端然坐石不起。 帝曰：朕为天下兆民之主，卿是何人，见朕失仪？ 女子答曰：吾是昊天玉皇帝车之臣，北极七元掌籍之星，君是何人，教吾施礼？ 帝龙颜失色，稽首拜谢：朕为兆民之主，不遇真仙，今幸得遇，稽首再拜，得睹真圣慈采，夙生有缘，即非今日之因。 伏愿元君慈悯，传付真诀，将治身命国家，群臣各各信受，伏愿元君不惜大渊之宝，重举雷音，朕将宣布天下，流遍山河，万民同朕遭遇洪范。 稽首再拜，起身进步，以目观之，见云雾布顶，身足霞采，瑞气腾空五尺，七圣居住其上，二官在后。 元君曰：吾非一圣，乃七人也。 二星官者，是斗中注人间善恶星官，名号左辅右弼之星。 帝曰：七星何名？ 元君曰：一名贪狼，二名巨门，三名禄存，四名文曲，五名廉贞，六名武曲，七名破军也。 礼念七真圣号 志心皈命礼，消灾解厄洗罪延生大悲大愿大圣大慈中天北斗七元星君，中天北斗中列圣高真，延生保命度厄消灾扶衰散祸益算七官君，启经教主前圣汉明帝君，天京本命元辰，伏望洪慈俯垂鉴诵。 贪狼星君章第一 是时大道元君语圣明曰：今若求吾真道，治身治命治国治家，心行平等，以直中行道，天地鉴之，日月悯之，星辰佐护，鬼神远退，直臣辅帝，民无烦恼，四海八表歌乐来朝，万姓无争，身命增长，延龄益算，百关调畅，使帝命永固，道炁自然。 巨门星君章第二 元君语圣明日：今若有求吾道法治身，於一日十二时中，不失真道，使汝身命寿算增延。 元君曰：若守於道，我命在我不在於天； 若失於道，诸星不佑，百祸竞起，寿命不长，诸灾自然。 禄存星君章第三 元君语圣明曰：今求吾道，去其财色，除却人我贪嗔，尊上念下，当以智信为本，礼义为先，戒伐生命，休贪娱乐。 帝白：朕求道法治家治身，他人亦耳，使民无恼，不听非言，使君臣不乱，身昌道合，万民自然。 文曲星君章第四 元君语圣明曰：今求吾之真道，即非小缘，历劫曾从上天，今日方遇吾众星君，善哉善哉。 万民后代，善利无穷，世间丰歉苦乐，即非天曹注也，自是人心自造，非干天地所注，子戒之邪淫，不可乱色，即可阴阳正配，使道光辉，天地自然。 廉贞星君章第五 元君语圣明曰：人求吾真道，终日十二时中，使左青龙、右白虎各依方位，使龙吟云起，虎啸风生，舌柱上腭，叩齿四十九通，两手摩灵，然后使赤牛耕地九市，应前朱雀、后玄武、六丁六甲在吾左右，天丁力士从吾前后，独乘白龙黄炁透入顶门，使颜不老，发不霜凋，齿落再生，上朝金阙，下覆昆仑，使命增延，君臣不乱，万民无争，道炁光辉，天地自然。 武曲星君章第六 元君语圣明曰：夫处世为人民之主，志求吾法，赐汝天机之德，益汝身命，使家国和平，人民无争，寿命增延，於十二时中，少喜、少惧、少乐、多苦，又於人身四大骨血配之五行，金木水火土五行顺，万物生，道炁和。",
      "translated_text": "**The Supreme Northern Dipper Twenty-Eighth Chapter Sutra**\n\n**Title:** *The Supreme Northern Dipper Twenty-Eighth Chapter Sutra*. The author is unknown, though it likely emerged during the Song dynasty. It purports that the Seven Primordial Star Lords of the Northern Dipper expounded twenty-eight chapters to Emperor Ming of Han on Mount Zhongnan, teaching the rites of invoking the Seven Primordial Lords to preserve life and dispel calamities. One scroll.\n\n**Source:** *Daoist Canon of the Zhengtong Era*, *Section of Divine Writings*, *Category of Original Texts*.\n\n---\n\n**The Supreme Northern Dipper Twenty-Eighth Chapter Sutra**\n\nOnce, Emperor Ming of Han wandered upon Mount Zhongnan, where he beheld a woman clad in plain white robes, her hair unbound and feet bare, seated motionless upon a stone.\n\nThe Emperor said: \"I am the sovereign of all under Heaven. Who are you, that you show no proper reverence in my presence?\"\n\nThe woman replied: \"I am a servant of the Jade Emperor of the Vast Heaven, a star official who governs the registers of the Seven Primordials of the Northern Pole. Who are *you*, to demand my obeisance?\"\n\nThe Emperor’s countenance paled, and he bowed deeply in apology: \"I am the lord of the myriad people, yet I have never encountered a true immortal. Today, by fortune, I meet you. I bow twice in reverence, blessed to gaze upon the true and sagely visage of your compassion. This is no mere coincidence of this life, but a karmic bond from past existences.\n\nI humbly beseech the Primordial Lord to take pity and transmit the true instructions, that I may govern body, life, state, and household. Let my ministers each receive and uphold them. I implore the Primordial Lord not to withhold the treasure of the great abyss, but to raise once more the thunderous voice. I shall proclaim this throughout the realm, that it may flow across mountains and rivers, and all the people may share in this encounter with the grand model.\"\n\nHe bowed twice more, then rose and stepped forward. As he gazed, he saw clouds and mist crowning her head, her feet enveloped in radiant hues, auspicious qi rising five feet into the air. The Seven Sages dwelled above, with two officials standing behind.\n\nThe Primordial Lord said: \"I am not one sage, but seven. The two star officials record the good and evil of humanity, known as the Stars of Left Assistant and Right Supporter.\"\n\nThe Emperor asked: \"What are the names of the Seven Stars?\"\n\nThe Primordial Lord replied: \"The first is Greedy Wolf, the second is Great Gate, the third is Store of Emolument, the fourth is Literary Curve, the fifth is Upright Integrity, the sixth is Martial Curve, and the seventh is Breaking Army.\"\n\n---\n\n**Ritual Invocation of the Seven Perfected Sages’ Names**\n\nWith sincere heart, I take refuge and pay homage:\nThe Great Compassionate, Great Vowed, Great Sage, Great Merciful Seven Primordial Star Lords of the Central Northern Dipper,\nThe High Perfected of the Central Northern Dipper’s Arrayed Sages,\nThe Seven Official Lords who extend life, preserve destiny, deliver from calamity, dispel misfortune, avert decline, scatter woes, and augment fate,\nThe Former Sage Emperor Ming of Han, Initiator of this Sutra,\nThe Celestial Capital’s Original Destiny of My Life,\nI humbly beseech your vast compassion to deign to witness this recitation.\n\n---\n\n**Chapter One: The Star Lord Greedy Wolf**\n\nAt that time, the Primordial Lord of the Great Dao spoke to the sagely and enlightened Emperor: \"If you now seek my true Dao to govern body, life, state, and household, cultivate equanimity in your heart and walk the path with uprightness. Heaven and Earth will bear witness, the sun and moon will take pity, the stars will aid and protect, ghosts and spirits will retreat afar, loyal ministers will assist the sovereign, and the people will know no affliction. The four seas and eight directions will resound with songs of joy and come to pay homage. The myriad people will live without strife, life will be prolonged, years will be added to your fate, the hundred passages will flow smoothly, and the Emperor’s mandate will endure forever, the Dao and qi naturally harmonious.\"\n\n---\n\n**Chapter Two: The Star Lord Great Gate**\n\nThe Primordial Lord spoke to the sagely Emperor: \"If you now seek my Dao and methods to govern the body, within the twelve hours of the day, do not lose the true Dao, and your life’s fate will be extended.\"\n\nThe Primordial Lord said: \"If you abide by the Dao, my life is in my own hands, not in Heaven’s. If you lose the Dao, the myriad stars will not protect you, a hundred misfortunes will arise in competition, and your lifespan will not be long, with calamities arising naturally.\"\n\n---\n\n**Chapter Three: The Star Lord Store of Emolument**\n\nThe Primordial Lord spoke to the sagely Emperor: \"If you now seek my Dao, cast aside wealth and sensuality, eliminate the attachments of self and others, greed and anger. Honor superiors and care for inferiors. Let wisdom and faith be your foundation, propriety and righteousness your priority. Refrain from harming life, and cease indulging in pleasure.\"\n\nThe Emperor replied: \"I seek the Dao and its methods to govern household and self, and others will follow suit. Let the people know no vexation, heed no false words, and ensure that ruler and ministers remain unconfused. Body will flourish, the Dao will align, and the myriad people will naturally follow.\"\n\n---\n\n**Chapter Four: The Star Lord Literary Curve**\n\nThe Primordial Lord spoke to the sagely Emperor: \"If you now seek my true Dao, this is no small affinity. Through kalpas past, you have followed the heavens above, and only today do you encounter us, the assembly of Star Lords. Excellent, excellent!\n\nFor the myriad people of later generations, the benefits of goodness will be boundless. The world’s abundance or scarcity, suffering or joy, are not decreed by the celestial bureaus. They are self-created by the human heart, not ordained by Heaven and Earth. You must guard against licentiousness and avoid disordered sensuality. Then the union of yin and yang will be correct, the Dao’s radiance will shine, and Heaven and Earth will naturally harmonize.\"\n\n---\n\n**Chapter Five: The Star Lord Upright Integrity**\n\nThe Primordial Lord spoke to the sagely Emperor: \"If one seeks my true Dao, throughout the twelve hours of the day, let the Azure Dragon on the left and the White Tiger on the right each occupy their proper directions. Let the dragon’s roar summon clouds, and the tiger’s howl stir the wind. Press the tongue against the upper palate, click the teeth forty-nine times, and rub the numinous with both hands. Then let the Red Ox plow the earth nine times. The Vermilion Bird will respond in front, the Dark Warrior behind, the Six Dings and Six Jias at my left and right, and the Heavenly Ding warriors and celestial soldiers before and behind me. Alone, I ride the White Dragon, and yellow qi penetrates my crown gate. My complexion will not age, my hair will not wither, my teeth will regrow when fallen. Above, I ascend to the Golden Gates; below, I cover Kunlun. My life will be extended, ruler and ministers will not fall into chaos, the myriad people will know no strife, the Dao’s radiance will shine, and Heaven and Earth will naturally harmonize.\"\n\n---\n\n**Chapter Six: The Star Lord Martial Curve**\n\nThe Primordial Lord spoke to the sagely Emperor: \"As the lord of the people in this world, if you aspire to seek my methods, I bestow upon you the virtue of Heaven’s mechanism to augment your life. Let your household and state know peace, the people live without strife, and your lifespan be extended. Within the twelve hours, let there be little joy, little fear, little pleasure, and much suffering. Moreover, in the human body, the four great elements—bone and blood—correspond to the Five Phases. When metal, wood, water, fire, and earth follow their proper sequence, the myriad things are born, and the Dao and qi harmonize.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1270,
      "start_sentence": 0,
      "end_sentence": 34,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.16638207435608,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上北斗二十八章经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "金木相逆，水火相克，人为之不顺，使身命不昌，道炁不和，家宅不宁，灾近民矣，天地不救，亦知为人不顺，百祸自然。 破军星君章第七 元君语圣明曰：夫求上圣之法，亦非难，亦非易，只在人之方寸。 破军问帝曰：还会否？ 帝曰：难可得遇，未便会解真仙之说。 元君曰：圆者方，方者圆，人身四大，有玄妙真法，汝於十二时中，左手握右手，右手握左手，吐气九转，大用火，小用水，小用火，大用水，使人身体安健，百祸不生，增算益禄，世世生生，福寿相承，家国清泰，道炁自然。 大道北元统章第八 大道北斗元君普告人天大众曰：积万善之因，积万恶之苦，造恶之人，常被物使也，流浪生死，沉沦苦海。 若夫行道，常为万物之主，不逐四时凋谢，吾使万物皆空，不将万物围绕着物者，为之贪嗔，如云雾驶月，舟移岸随，玩物伤人之致，明知二法是物外之心，不着物也，君臣自乐，万民无苦，使国土清静，鬼神恭敬，果木茂盛，五谷成熟，日月佐之，星辰佑之，道炁光辉，乾坤自然。 北元统章第九 帝问元君曰：上仙管籍，日夜周游，管之何事，有多少曹局，朕见日夜光明，星行旬分罗列星宿，未知其道，伏愿元君祥云久驻，鹤步停飞，神光存照，朕若明上仙之道，不忘今日得遇高真，劝赐天下宫观永为宗庙，编集道录。 北元统章第十 元君曰：吾上管诸天列仙，中管五岳四渎鬼神，下管地府幽灵酆都狱卒，三界之中，胎卵湿化，尽属吾管，一日一夜，万死万生，贫穷下贱，上下贤愚，鬼神劫数，长短增延，劫杀死伤，狱卒囚徒，龙神行雨，五谷成败，寡病四民，山河水陆，皆过北元案中三千六百曹君，一日一夜无差，天地无私，善恶自然。 北元统章第十一 帝又问元君曰：三界之中，蠢动物类，尽是元君管局，朕为人民之主，还属上仙管否？ 元君曰：诸天列仙，天罗星帅，吾籍管之，何况於汝乎！ 况昔当元天，主北方天蓬主帅，於座逆想人间异幻，一念才生，降下为人之主，今忘夙念，与圣合真，得遇吾众体道之源，忽然清静，道炁自然复元本想，若将来天福具足，功满德就，再遇天蓬，仍位天主。 北元统章第十二 帝曰：朕得元君容颜喜悦，畅哉，今日群臣眷属，尽遇上仙，真诠本末，谨奉教言，十二时中修之万行，再复道源，恐有人民如何方法增寿灭罪，长福消灾？ 大道北辰元君曰：吾有神力，吾有神咒，凡有人民危难，病苦、恐怖、冤家，私求其便者，而又或是鸦鸣百怪，魍魉魑魅，倘值孤魂滞魄，及军阵中亡，投河系颈伤死，或是田地咒咀，或是天符行病，瘟疫侵凌，或是生产，母子不分，或是城隍社庙，鬼神不正，师巫厌祷，妄行逆法，作诸不祥，又或天地劫数，五谷不熟，或求名利，或求男女之人，香汤沐浴，於庚申甲子，并每月北斗下降之日，面向北方焚香，志诚书吾名字，□□□□□□□星，诸魔自灭，百祸自消，皆得吉利，乾元亨利贞，吉祥和平，诸鬼若不从者，头破七分，勑唵吽斩癹，急急如律令！ 北元统章第十三 元君曰：一切众生，若有危难病苦，四路闭塞，无门所出，男女眷属，父母亲朋，或亲友故旧，或天符时气，各请清斋沐浴，散发跣足，於夜半子时，面向北方，或在中庭，书章七封，表奏天曹，念吾名字，於表章上写吾名字：□□□□□□□星，吾在天曹，每一星君有三千六百星官，三万六千神君，四直功曹，速为上奏金阙门下，诸灾厄难，缠绵困苦，悉皆退散，邪鬼磨灭，若不信者，头破七段。",
      "translated_text": "When metal and wood oppose each other, when water and fire overcome one another, humanity acts against the natural order, causing life to falter, the Dao and qi to fall out of harmony, households to know no peace, and calamity to draw near the people. Heaven and Earth cannot save them, for when one acts against the Way, a hundred misfortunes naturally follow.\n\n**Chapter Seven: The Star Lord of Destruction**\n\nThe Primordial Lord spoke to the sagely Emperor: \"To seek the methods of the highest sages is neither difficult nor easy—it lies solely in the heart of the seeker.\"\n\nThe Star Lord of Destruction asked the Emperor: \"Will you attain it?\"\nThe Emperor replied: \"It is rare to encounter, and even rarer to comprehend the teachings of the true immortals.\"\n\nThe Primordial Lord said: \"The round becomes square, the square becomes round. Within the four great elements of the human body lies a wondrous and true method. In the twelve hours, clasp your left hand with your right, and your right hand with your left. Exhale qi in nine revolutions—employ great fire and small water, small fire and great water. This will bring peace and health to the body, prevent the arising of a hundred calamities, extend your lifespan, and increase your blessings. From generation to generation, fortune and longevity will be passed down, the household and state will know tranquility, and the Dao and qi will naturally harmonize.\"\n\n**Chapter Eight: The Great Dao of the Northern Primordial Unity**\n\nThe Lady of the Northern Dipper of the Great Dao proclaimed to the vast assembly of humans and heavens: \"Those who accumulate myriad good causes reap myriad blessings, while those who accumulate myriad evil deeds suffer myriad afflictions. The wicked are ever enslaved by things, drifting through the cycles of birth and death, submerged in the sea of suffering.\n\nYet those who practice the Dao become the masters of the myriad things, untouched by the withering of the four seasons. I cause the myriad things to be empty, and those who do not cling to things avoid greed and wrath. Like clouds racing past the moon or a boat drifting while the shore appears to move, attachment to things harms the self. Know that the twofold Dharma is the mind beyond things, unattached to them. Then ruler and ministers will rejoice, the myriad people will know no suffering, the land will be purified, ghosts and spirits will show reverence, fruit trees will flourish, the five grains will ripen, the sun and moon will aid them, and the stars will protect them. The radiance of the Dao and qi will shine, and Heaven and Earth will naturally harmonize.\"\n\n**Chapter Nine: The Northern Primordial Unity**\n\nThe Emperor asked the Primordial Lady: \"The celestial registers of the highest immortals record their ceaseless journeys through day and night. What do they govern, and how many bureaus are there? I observe the radiance of day and night, the stars moving in their cycles, and the constellations arrayed in order, yet I do not understand their Way. I humbly beseech the Primordial Lady to linger like lingering auspicious clouds, to pause her crane-like steps, and to let her divine light remain, illuminating me. If I come to understand the Way of the highest immortals, I shall never forget this day’s encounter with the lofty perfected ones. I shall exhort the establishment of temples and monasteries throughout the land as eternal sanctuaries and compile the Daoist canon.\"\n\n**Chapter Ten: The Northern Primordial Unity**\n\nThe Primordial Lady said: \"Above, I govern the immortals of the myriad heavens; in the middle, I oversee the ghosts and spirits of the Five Peaks and Four Waterways; below, I manage the dark souls of the earthly prisons, the jailers of Mount Fengdu, and all beings within the Three Realms—those born from wombs, eggs, moisture, or transformation. In a single day and night, ten thousand die and ten thousand are born. The poor and lowly, the noble and wise, the karmic destinies of ghosts and spirits, the lengthening and shortening of lifespans, the violent deaths and injuries of the kalpic disasters, the jailers and prisoners, the dragon spirits who bring rain, the success or failure of the five grains, the illnesses of the four classes of people, the mountains and rivers, the waters and lands—all pass through the records of my thirty-six hundred bureau lords. In a single day and night, nothing is amiss. Heaven and Earth are impartial, and good and evil naturally unfold.\"\n\n**Chapter Eleven: The Northern Primordial Unity**\n\nThe Emperor further asked the Primordial Lady: \"Within the Three Realms, all living creatures fall under your governance. As the lord of the people, do I also belong to your jurisdiction?\"\n\nThe Primordial Lady replied: \"The immortals of the myriad heavens and the stellar generals of the celestial nets are all recorded in my registers—how much more so you! Moreover, in the primordial heavens of old, you were the marshal Tianpeng, the lord of the northern direction. Yet you conceived a fleeting thought of the strange illusions of the human world, and with that single念, you descended to become the lord of humanity. Now, having forgotten your original vow and united with the sagely and perfected, you have encountered the source of the Dao within our assembly. Suddenly, you have attained clarity, and the Dao and qi naturally return to their original state. When your heavenly blessings are complete and your merits and virtues perfected, you shall again meet Tianpeng and resume your place as the lord of heaven.\"\n\n**Chapter Twelve: The Northern Primordial Unity**\n\nThe Emperor said: \"I am overjoyed by the gracious countenance of the Primordial Lady. Today, my ministers and their families have all encountered the highest immortals and received the true teachings from beginning to end. I shall reverently follow your instructions and cultivate the ten thousand practices within the twelve hours to restore the source of the Dao. Yet I fear for the people—what methods can they use to extend their lives, eradicate sins, prolong blessings, and dispel calamities?\"\n\nThe Lady of the Northern Dipper of the Great Dao replied: \"I possess divine power and divine incantations. For all people in peril, suffering from illness, fear, or enmity, or those who seek private convenience—whether plagued by the cries of crows and a hundred omens, by *wangliang* and *chimei* spirits, or by lonely souls and lingering spirits of those who died in battle, drowned, hanged themselves, or were harmed by curses on fields, by celestial talismans bringing disease, or by pestilence—whether in childbirth where mother and child are not yet parted, or in city gods’ temples and earth shrines where spirits are unruly, or where shamans and sorcerers perform reckless and perverse rituals, bringing about inauspicious events—whether due to the kalpic disasters of Heaven and Earth, the failure of the five grains, or those who seek fame and profit, or offspring—bathe in fragrant water, and on the days of *gengshen* and *jiazi*, or on the days when the Northern Dipper descends each month, face north, burn incense, and sincerely inscribe my name: □□□□□□□ Star. All demons will be destroyed, and a hundred calamities will vanish. All shall attain auspiciousness: *Qianyuan heng li zhen*, peace and good fortune. If any ghosts disobey, their heads shall split into seven parts. The decree: *Om hum zhan ba!* Hasten as the law commands!\"\n\n**Chapter Thirteen: The Northern Primordial Unity**\n\nThe Primordial Lady said: \"For all sentient beings in peril, suffering from illness, or facing blockages on all four paths with no way out—whether men or women, family members, parents, friends, or old acquaintances—if afflicted by celestial talismans or seasonal epidemics, let them purify themselves with fasting and bathing, let their hair down and go barefoot. At midnight, the hour of *zi*, face north, or stand in the central courtyard. Write seven memorials and present them to the celestial bureaus. Invoke my name and inscribe it on the memorials: □□□□□□□ Star. In the celestial bureaus, each star lord commands thirty-six hundred stellar officials and thirty-six thousand divine lords, along with the four duty *gongcao* spirits. Swiftly submit the memorials to the Golden Gates of the Jade Palace. All calamities, hardships, and entangling sufferings shall retreat and disperse, and evil ghosts shall be obliterated. Those who do not believe shall have their heads split into seven pieces.\"",
      "overlap_context": "tow upon you the virtue of Heaven’s mechanism to augment your life. Let your household and state know peace, the people live without strife, and your lifespan be extended. Within the twelve hours, let there be little joy, little fear, little pleasure, and much suffering. Moreover, in the human body, the four great elements—bone and blood—correspond to the Five Phases. When metal, wood, water, fire, and earth follow their proper sequence, the myriad things are born, and the Dao and qi harmonize.\"",
      "start_char": 1270,
      "end_char": 2630,
      "start_sentence": 35,
      "end_sentence": 56,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.27469849586487,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上北斗二十八章经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "元君勑魔魂魔魂灭，唵吽斩癹，急急如律令！ 北元统章第十四 元君曰：或魍魉魑魅死魂不散，日夜悲啼惊恐，作其灾祸，害人身命，采其血肉，惊怖童男童女，百种苦恼，作乱生人，於家清斋沐浴，书吾名字：□□□□□□□星，吾勑诸魔自灭，百祸自消，皆得乾元亨利贞吉祥，万事和平，诸鬼若不信者，头破七分，勑唵吽斩癹，急急如律令！ 北元统章第十五 元君曰：或有冤家咒咀，埋名禁字，茆木作形，巫师逆法，作诸不祥，怪梦颠倒，或因田地财帛不明，朋友不足，恩爱成害，或因牢狱荼毒，害民官吏抑塞，自此之情，无由解脱，至诚发心，念吾名字：□□□□□□□星，当时道炁付身，诸难消散，吾勑天蓬主帅、四目老翁、八万天兵力士，身长三十六丈，摇铃勑力，唵吽斩癹，急急如律令！ 北元统章第十六 元君曰：或是国内不宁，四方万耗竞起，或天地劫数，天龙行雨，地不成熟，五谷饥馑，五劫乱世，君王斗战，贼发火起水漂之难，五路障闭，君臣民俗等众各发志诚，清斋沐浴，具朱章七封，各奏本情，於表章上书吾名字：□□□□□□□星，於夜半子时，朝吾三三之拜，四直使者速为上奏金阙门下，诸星判断，吾勑差北方天蓬真武大圣、四目老翁、八万天兵力士，身长三十六丈，摇铃勑力，唵吽斩癹，急急如律令！ 北元统章第十七 元君曰：若有住落乡村旷野之处，或是州县城郭坊巷，被天符行病，五瘟徒众行其毒病七十二疫气，此是吾七元簿籍功曹太岁、直年直月直日直时，方位州县行病，各有分数，或是朝病暮死，上下不分死符恐怖，无门奏谢，若有清净道侣，或是信心男女，各各志诚焚香，面北朝礼三三之拜，念吾名号□□□□□□□星，四直功曹奏上金阙门下，吾勑差天蓬帅、使四目老翁、八万天兵力士，直到下方，收吾五瘟天符簿书，速令家家乾元亨利贞和平，门门利益，道炁自然，摇铃勑力，唵吽斩癹，急急如律令！ 北元统章第十八 元君曰：若有信心道众，或是凡民，若无后嗣子孙，每遇庚申甲子斗真下降本命之日，焚香清斋，念吾真经，及吾名号：□□□□□□□星，十二时中，香灯不绝，时花茶果，供养不绝，或七七四十九日，或一百日，便有降祥乾道之喜，吾在天曹掌籍，详其分等，注生智慧之男，寿命百岁，无灾无障，清净道德，佐助人皇，又或当隶坤道，降生有相之女，福德殊胜，此乃神力自在，勑乾元亨利贞，急急如律令！ 北元统章第十九 元君曰：或是父母兄弟妻眷男女等人，遭枷落狱，赴法伤亡，或因财色斗杀，久沉苦趣，无由超生，或遭生产，子母不分，死伤无托，久在幽冥，孤魂不散，未遇超生，沉於鬼趣，无有出期，全藉信心男女眷属，於其庚申甲子下降之日，夜半子时，志诚焚香，念吾名号：□□□□□□□星，陈说披分本情，面向北方，礼吾三三之拜，吾请金阙门下奏章直事、四目老翕，告示注生功曹，注死元辰，随其分数，逐业超生，摇铃勑力，唵吽斩癹，急急如律令！ 北元统章第二十 元君曰：或是军民战阵，各负死力，冤牵相撞，不能解脱，可以清净斋心，去其酒肉五辛，披发跣足，面向北方，念吾名号：□□□□□□□星，吾在天曹勑下天蓬帅，使玄武上将军真武大圣、四目老翕、天兵力士八万四千，身长三十六丈，摇铃勑力，唵吽斩癹，急急如律令！",
      "translated_text": "The Perfected Sovereign commands: \"Demonic spirits, perish! *Oṃ hūṃ* sever and disperse! Swiftly, swiftly, as decreed by law!\"\n\n**Section Fourteen of the Northern Primordial Compendium**\nThe Perfected Sovereign declares: Should *wangliang*, *chimei*, or lingering dead spirits not disperse, wailing day and night in terror, bringing calamities and misfortune, harming lives, consuming flesh and blood, frightening boys and girls, and causing a hundred kinds of suffering to disturb the living—let the household purify themselves with fasting and bathing. Inscribe my name: □□□□□□□ Star. I command all demons to self-annihilate, all misfortunes to dissolve, and all to attain the auspicious harmony of *Qianyuan hengli zhen*. May all affairs be peaceful. Should any ghost disbelieve, their heads shall split into seven pieces. *Oṃ hūṃ* sever and disperse! Swiftly, swiftly, as decreed by law!\n\n**Section Fifteen of the Northern Primordial Compendium**\nThe Perfected Sovereign declares: Should there be vengeful curses, buried names or binding charms, effigies of straw or wood, or sorcerers employing perverse methods to invoke inauspicious omens—disturbing dreams, inverted fortunes, disputes over fields, wealth, or property, betrayal by friends, love turned to harm, or suffering under oppressive officials and unjust imprisonment—let the afflicted, with utmost sincerity, invoke my name: □□□□□□□ Star. The Dao’s *qi* shall then enter their body, and all difficulties shall disperse. I command Marshal Tianpeng, the Four-Eyed Elder, and eighty thousand celestial soldiers and warriors—each thirty-six *zhang* in height—to shake their bells and exert their power. *Oṃ hūṃ* sever and disperse! Swiftly, swiftly, as decreed by law!\n\n**Section Sixteen of the Northern Primordial Compendium**\nThe Perfected Sovereign declares: Should the realm be unsettled, with calamities arising from all directions, or should the appointed time of heaven and earth bring disasters—celestial dragons sending floods, the earth failing to yield harvests, the five grains falling to famine, the five kalpas plunging the world into chaos, kings waging war, bandits rising, fires raging, or floods sweeping all away—let the sovereign, ministers, and common people alike, with sincere resolve, purify themselves with fasting and bathing. Prepare seven vermilion memorials, each detailing their plight, and inscribe my name upon them: □□□□□□□ Star. At midnight, the hour of *zi*, prostrate thrice in reverence. The Four Duty *Gongcao* spirits shall swiftly submit the memorials to the Golden Gates of the Jade Palace. The stellar lords shall render judgment. I command the dispatch of the Perfected Martial Great Sage of the Northern Dipper, Zhenwu, Marshal Tianpeng, the Four-Eyed Elder, and eighty thousand celestial soldiers and warriors—each thirty-six *zhang* in height—to shake their bells and exert their power. *Oṃ hūṃ* sever and disperse! Swiftly, swiftly, as decreed by law!\n\n**Section Seventeen of the Northern Primordial Compendium**\nThe Perfected Sovereign declares: Should those dwelling in villages, wilderness, prefectures, counties, cities, or alleys be afflicted by celestial talismans or seasonal epidemics—where the five pestilences and their legions spread seventy-two toxic *qi*—this is by my decree, recorded in the registers of the Seven Primordials, the *Gongcao* spirits of the Great Year, and the duty spirits of the year, month, day, and hour. Each region and county shall suffer according to its allotted measure. Some may fall ill at dawn and die by dusk, or be struck by indiscriminate death talismans, their terror unassuaged. If there are pure Daoist companions or faithful men and women, let them each, with sincere devotion, burn incense, face north, and prostrate thrice in reverence. Invoke my name: □□□□□□□ Star. The Four Duty *Gongcao* spirits shall submit their pleas to the Golden Gates of the Jade Palace. I command the dispatch of Marshal Tianpeng, the Four-Eyed Elder, and eighty thousand celestial soldiers and warriors to descend and reclaim my celestial talisman registers of the five pestilences. Swiftly, let every household attain the harmony of *Qianyuan hengli zhen*, and may every door know prosperity. The Dao’s *qi* shall naturally prevail. Shake the bells and exert power! *Oṃ hūṃ* sever and disperse! Swiftly, swiftly, as decreed by law!\n\n**Section Eighteen of the Northern Primordial Compendium**\nThe Perfected Sovereign declares: Should there be faithful Daoist followers or common folk without descendants, let them, on the days when the Dipper’s Perfected descends—*gengshen* and *jiazi*—burn incense, fast, recite my true scripture, and invoke my name: □□□□□□□ Star. Let incense and lamps burn without cease through the twelve hours, and let offerings of flowers, tea, and fruit never falter. After forty-nine days, or one hundred days, auspicious signs of the *Qian* Dao shall manifest. In the celestial bureaus, I oversee the registers, determining their allotted rank. I shall inscribe the birth of a wise son, blessed with a lifespan of a hundred years, free from calamity or hindrance, pure in virtue and power, to assist the human sovereign. Or, should they be destined for the *Kun* Dao, I shall grant the birth of a daughter of noble appearance, endowed with exceptional fortune and virtue. Such is the autonomous power of the divine. I command the auspicious harmony of *Qianyuan hengli zhen*! Swiftly, swiftly, as decreed by law!\n\n**Section Nineteen of the Northern Primordial Compendium**\nThe Perfected Sovereign declares: Should parents, siblings, spouses, children, or other kin be imprisoned, executed, or perish by law; or fall victim to disputes over wealth or desire, languishing in bitter realms without hope of rebirth; or suffer in childbirth, mother and child undivided in death, their souls lingering in darkness, unable to ascend, bound to the ghostly realm without prospect of escape—let their faithful kin, on the days when the Dipper’s Perfected descends—*gengshen* and *jiazi*—at midnight, the hour of *zi*, burn incense with sincere devotion and invoke my name: □□□□□□□ Star. Declare their plight, face north, and prostrate thrice in reverence. I shall petition the Golden Gates of the Jade Palace, summoning the duty spirits and the Four-Eyed Elder to report to the *Gongcao* of life inscription. They shall record the dead according to their destined time, and in accordance with their karma, grant them rebirth. Shake the bells and exert power! *Oṃ hūṃ* sever and disperse! Swiftly, swiftly, as decreed by law!\n\n**Section Twenty of the Northern Primordial Compendium**\nThe Perfected Sovereign declares: Should soldiers or civilians perish in battle, bound by karmic grievances and unable to escape, let them purify their hearts with fasting, abstain from meat, wine, and the five pungent roots, let their hair down, and go barefoot. Face north and invoke my name: □□□□□□□ Star. In the celestial bureaus, I shall command Marshal Tianpeng to dispatch the Perfected Martial Great Sage of the Northern Dipper, Zhenwu, the Supreme General of the Dark Warrior, the Four-Eyed Elder, and eighty-four thousand celestial soldiers and warriors—each thirty-six *zhang* in height—to shake their bells and exert their power. *Oṃ hūṃ* sever and disperse! Swiftly, swiftly, as decreed by law!",
      "overlap_context": "reaus. Invoke my name and inscribe it on the memorials: □□□□□□□ Star. In the celestial bureaus, each star lord commands thirty-six hundred stellar officials and thirty-six thousand divine lords, along with the four duty *gongcao* spirits. Swiftly submit the memorials to the Golden Gates of the Jade Palace. All calamities, hardships, and entangling sufferings shall retreat and disperse, and evil ghosts shall be obliterated. Those who do not believe shall have their heads split into seven pieces.\"",
      "start_char": 2631,
      "end_char": 3936,
      "start_sentence": 57,
      "end_sentence": 71,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.593952655792236,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上北斗二十八章经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "元统章第二十一 元君曰：或有商人行船过渡，其江滩之波，难负累财帛，或在海中，不遇风帆，日月不分，邪精蛟蜃，妖怪鬼神，作起障难，速书吾名字：□□□□□□□星及符，放在水中，吾勑下天兵力士、当界地分水神地神、河伯水官、城隍庙社诸神，得力扶持，脱离苦难诸魔，不信者头破七分，劲疾速安，勑疾速宁，勑力唵吽斩癹，急急如律令！ 太上救水难真符 帝勑灵灵，中天七真。 神符诰命，人船安宁。 急急如北极大帝律令！ 北元统章第二十二 元君曰：或是信心清净男女，久事斋戒，念吾名字：□□□□□□□星，行吾大法，看吾真经，朝拜七七四十九日，并良宵，或一世及累劫行正法，积阴隐，当生上界，天曹簿管，过其坊村社庙，不得顶礼，诸神不安，亦不敢受，令其鬼神，远去千里，入地千尺，不信者，头破七分，勑疾速唵吽斩癹，急急如律令！ 北元统章第二十三 元君启告帝曰：凡人朝元拜法，洗荡身心，消灭宿业，一切妄想颠倒，息心不善，见下愚之辈，如掌上之珠，见清高之人，如眼中之砂，或使心行一切不善，或有三世冤亲，或自心不善，妻眷男女死亡，或是自己衣食不充，不遇贵人接引，或是家国不宁，或为庶民，或为他人，或为名利，或是埋坟，起造修方，或是自己，或为妻眷，或为国行兵，或为父母恶病，或是水火之灾，及恶人淫乱，或被上官责罚，一切诸恶不详，各各志诚清斋行道，香汤沐浴，素衣冠裳，朱履，木简一尺二寸，楠木为案，朱砂涂之，长二尺四寸，高七寸七分香炉，登之高处，面向北方，志诚望吾宫中，直至夜半，念吾名号，朝礼三三之拜，七月一日至七日七夜，虔心志诚，布列香灯，稽首。 第一朝元三拜，起身执简，伸白情意，臣启北斗元君诸天星宿，昭鉴乾坤，使一切鬼神天龙等众，普及人民各身道炁长存，天地万物自然。 第二朝元三拜，臣启北斗元君：臣昔年父母死亡，恐堕冥涂，地狱辛苦，久沉鬼趣，罪掠冥曹，未能超生，无由报答天地之恩，父母所生恩爱，朋友师长教诲。 又云：父母见在堂上，臣伏愿元君上官真炁慧眼遥观，赐臣一报，见存获福，过去超生，长亲道教，永离苦趣。 第三朝元三拜，臣启北斗元君，臣值下界凡身凡夫，命系上宫，真仙管籍，四时衣食不足，财帛谷米常生虚耗，所作不成，恐臣夙生罪业，累至今日，无门告谢，今生幸遇真仙典教，一依科法朝拜，伏愿元君赐臣百福千祥，万事乾元亨，万物利贞，臣稽首再拜。 北元统章第二十四 元君再语帝曰：九月九夜夜半子时，朝元拜法，付常皈依吾法及传教世间，化治天下人民等众，开度饿鬼、畜生、胎卵、湿化等，及囚徒地狱，一切苦难，系九月九夜注籍罪福，此是北斗帝车高真定其簿书，注人衣食、福绿、贫富、贵贱、奴婢、杂使等类，皆从此月定录注籍，善恶无差，吾说此经教法，生灵鬼神万民四生饿鬼等众，天下人间国王大臣军庶一切等类，若依吾法朝拜九夜，吾在元宫端详注选南方列仙，随愿所生，定其分毫； 若求道法，天道闻之，便应所求； 若求衣食官爵，便得百福千禄，自身道炁长存，万物自然。 九月一日夜半子时，朝拜北斗第一宫中贪狼星君，文章#1案内管三百六十星官、三百六十司，三千六百曹官，身披青衣，头戴青冠，脚踏朱履，手执青简，又有三千六百童子，身着青衣，手执青旛，持华盖以应东方甲乙之木，侍右。",
      "translated_text": "**Section Twenty-One of the Northern Primordial Compendium**\nThe Perfected Sovereign declares: Should merchants traveling by boat encounter rapids where waves endanger their heavy cargo, or find themselves at sea without wind for their sails, unable to distinguish day from night, assailed by malevolent spirits—dragons, mirages, demons, or ghosts—let them swiftly inscribe my name: □□□□□□□ Star, along with the talisman, and cast it into the water. I shall command the celestial soldiers and warriors under my authority, the local water and earth deities, the River Earl, the Water Officials, and all spirits of city gods and earth altars to exert their power, aiding them to escape suffering and demonic perils. Those who disbelieve shall have their heads split into seven parts. Swiftly, swiftly, bring peace! *Oṃ hūṃ* sever and disperse! Swiftly, swiftly, as decreed by law!\n\n**The Perfected Talisman for Rescuing from Water Perils**\nBy the Emperor’s decree, divine and efficacious, the Seven Perfected of the Central Heaven.\nThe divine talisman’s proclamation ensures the safety of people and boats.\nSwiftly, swiftly, as decreed by the Great Emperor of the Northern Pole!\n\n---\n\n**Section Twenty-Two of the Northern Primordial Compendium**\nThe Perfected Sovereign declares: Should devout men or women, pure in heart, observe long fasts and invoke my name: □□□□□□□ Star, practice my great Dharma, study my true scriptures, and prostrate themselves for forty-nine days and nights, including auspicious evenings—or even for a lifetime or across kalpas in upholding the true Dharma, accumulating hidden merits—then in their next rebirth, they shall ascend to the celestial realms. The celestial bureaus shall record their names, and as they pass through villages, communities, or temples, they need not bow to the local spirits, who shall be unsettled and dare not accept their reverence. Instead, these ghosts and deities shall flee a thousand *li* away or sink a thousand *chi* into the earth. Those who disbelieve shall have their heads split into seven parts. *Oṃ hūṃ* sever and disperse! Swiftly, swiftly, as decreed by law!\n\n---\n\n**Section Twenty-Three of the Northern Primordial Compendium**\nThe Perfected Sovereign addresses the Emperor: When people perform the *Chaoyuan* rites and Dharma practices, purifying body and mind to eradicate past karmic deeds, relinquishing all deluded thoughts and unwholesome intentions—regarding the foolish as cherished as jewels in their palms, yet seeing the noble as irritants like sand in their eyes—when their minds and actions turn to all manner of unwholesomeness, whether due to karmic debts from three lifetimes, their own malevolence, the death of family members, insufficient clothing or food, lack of noble patrons, domestic or national unrest, or whether they act as commoners, for others, for fame or profit, for constructing graves or buildings, for themselves, their families, their nation’s military campaigns, their parents’ illnesses, disasters of water or fire, or the depravities of evil people—when subjected to official punishments or all manner of misfortunes, let each person sincerely purify themselves through fasting and the Dao, bathe in fragrant waters, don plain robes and caps, red shoes, and a wooden tablet one *chi* and two *cun* in length. Let them prepare a sandalwood altar, painted with cinnabar, two *chi* and four *cun* long and seven *cun* and seven *fen* high, with an incense burner placed upon it. Ascend to a high place, face north, and with utmost sincerity, gaze toward my celestial palace until midnight. Invoke my name and perform three sets of three prostrations. From the first to the seventh day of the seventh month, for seven nights, arrange incense and lamps with devout reverence and bow in homage.\n\n**First *Chaoyuan* Prostration (three bows):**\nRise, hold the tablet, and declare your intentions:\n*\"Your servant petitions the Perfected Sovereign of the Northern Dipper and all celestial asterisms. May the clarity of heaven and earth witness this: let all ghosts, deities, heavenly dragons, and beings receive the enduring Dao-qi of their respective paths, and may the myriad things of heaven and earth arise naturally.\"*\n\n**Second *Chaoyuan* Prostration (three bows):**\n*\"Your servant petitions the Perfected Sovereign of the Northern Dipper: In past years, when my parents passed away, I feared they might fall into the dark paths, enduring the torments of hell, long sunk in the ghostly realms, their sins recorded in the underworld bureaus, unable to transcend. With no means to repay the grace of heaven and earth, the love of parents who bore me, or the teachings of friends and mentors—*\n*If my parents are still alive, I humbly pray that the Perfected Sovereign, with the gaze of wisdom from the celestial offices, bestow upon me a single repayment: may the living gain blessings, the departed transcend, and may my parents forever follow the Dao’s teachings, eternally freed from suffering.\"*\n\n**Third *Chaoyuan* Prostration (three bows):**\n*\"Your servant petitions the Perfected Sovereign of the Northern Dipper: I, a humble being in the lower realm, am a mortal whose fate is recorded in the celestial registers of the Perfected Immortals. My clothing and food are insufficient through the four seasons, my wealth and grains perpetually depleted. My endeavors fail, and I fear my past sins have accumulated to this day. With no means to express my gratitude, I now, by good fortune, have encountered the true teachings of the Perfected Immortals. Following the rites and Dharma, I prostrate myself, humbly praying that the Perfected Sovereign bestow upon me a hundred blessings and a thousand auspices, that all things attain the primal harmony of *qian*, and that the myriad things flourish in uprightness. Your servant bows again in reverence.\"*\n\n---\n\n**Section Twenty-Four of the Northern Primordial Compendium**\nThe Perfected Sovereign further addresses the Emperor: On the ninth night of the ninth month, at midnight during the *zi* hour, perform the *Chaoyuan* rites and Dharma practices, entrusting them to those who take refuge in my Dharma and propagate it among the people of the world. Liberate the hungry ghosts, animals, those born from wombs, eggs, moisture, or transformation, as well as prisoners in hell and all beings in suffering. On this night, the Northern Dipper’s celestial chariot, the High Perfected, records the registers of merit and sin, determining people’s clothing, food, fortune, poverty, nobility, servitude, and all other conditions. All is fixed in this month’s records, with no discrepancy between good and evil. I expound this scripture and Dharma for the sake of all sentient beings—ghosts, deities, the myriad people, the four kinds of birth, hungry ghosts, the kings and ministers of the world, soldiers, commoners, and all beings. Should they follow my Dharma and perform the nine nights of *Chaoyuan* rites, I shall, from my celestial palace, meticulously review and select their destinies among the immortals of the southern realms, granting their wishes to the finest detail.\nShould they seek the Dao and its methods, the heavenly Dao shall hear and respond to their prayers.\nShould they seek clothing, food, official rank, or emoluments, they shall receive a hundred blessings and a thousand fortunes, their personal Dao-qi enduring, and the myriad things arising naturally.\n\nAt midnight during the *zi* hour on the first day of the ninth month, prostrate before the first palace of the Northern Dipper, the Star Lord of Greed and Wolf. Within the first case, he oversees three hundred and sixty star officials, three hundred and sixty bureaus, and thirty-six hundred celestial offices. Clad in azure robes, crowned with an azure cap, and shod in red shoes, he holds a green tablet. He is attended by thirty-six hundred youths, dressed in azure, bearing green banners and floral canopies, corresponding to the *jia-yi* wood of the east.",
      "overlap_context": "ive pungent roots, let their hair down, and go barefoot. Face north and invoke my name: □□□□□□□ Star. In the celestial bureaus, I shall command Marshal Tianpeng to dispatch the Perfected Martial Great Sage of the Northern Dipper, Zhenwu, the Supreme General of the Dark Warrior, the Four-Eyed Elder, and eighty-four thousand celestial soldiers and warriors—each thirty-six *zhang* in height—to shake their bells and exert their power. *Oṃ hūṃ* sever and disperse! Swiftly, swiftly, as decreed by law!",
      "start_char": 3937,
      "end_char": 5264,
      "start_sentence": 72,
      "end_sentence": 90,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.395201683044434,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上北斗二十八章经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "贪狼星君，判断阳冥。 臣启北斗贪狼星君，善注人间生死，平等善事，国君万寿，朝臣尽忠，人事通和，免使徒配诛斩，各各善生善终，不昧道心，清炁长存，万物自然，其人便得三千六百九十分数功德，罪障渐惭消除，急急如律令！ 九月二日夜半子时，朝拜北斗第二宫巨门星君，善注人间长寿，案内管三百六十星官、三百六十司、三千六百曹官，头戴黄冠，身披黄衣，脚踏朱履，手执黄简，又有三千六百童子，身着黄衣，手执黄旛，以应中央戊己之土，侍右。 巨门星君，判断阳冥。 臣启北斗巨门星君，善注人间平等善事，君王万寿，贤臣佐国，人事通和，兔其徒配诛斩，各各善生善终，不昧道心，清炁长存，万物自然，其人当得五千一百七十功德，罪障消灭，急急如律令！ 九月初三日夜半子时，朝礼北斗第三宫禄存星君，注人间孤寡跛瞶四民，案内管三百六十星官、三百六十司、三千六百曹官，头戴黑冠，身披黑衣，手执黑简，脚踏朱履，又有三千六百童子，身着黑衣，手执黑旛，以应北方壬癸之水，侍右。 禄存星君，判断阳冥。 臣启北斗禄存星君，善注人间生死平等，免见囚徒死亡，孤寡贫穷绝灭，不昧道心，清炁长存，万物自然，其人当得五千一百功德，罪障消除，急急如律令！ 九月初四日夜半子时，朝拜北斗第四宫文曲星君，注人间成败，案内管三百六十星官、三百六十司、三千六百曹官，头戴黑冠，身披黑衣，手执黑简，脚踏朱履，又有三千六百童子，身着黑衣，手执黑旛，以应北方壬癸之水，侍右。 文曲星君，判断阳冥。 臣启北斗文曲星君，善注人间生死，余事平等，免见淫乱成败，囚徒死亡绝灭，不昧道心，清炁长存，万物自然，其人当得三千三百功德，罪障消灭，急急如律令！ 九月初五日夜半子时，朝拜北斗第五宫廉贞星君，功曹掌事火星，案内管三百六十星官、三百六十司、三千六百曹官，身披绯衣，头戴红冠，手执朱简，脚踏朱履，又有三千六百童子，身着绯衣，手执红旛，以应南方丙丁之火，侍右。 廉贞星君，判断阳冥，注人间风火之事。 臣启北斗廉贞星君，善注人间生死之难，免见囚徒，消解火殃，保安郡邑，使家无祆现，人得安康，次愿神明护门，公私两利，更乞常逢好事，不昧道心，清炁长存，万物自然，其人当得三千三百功德，一切罪咎悉皆消灭，急急如律令！ 九月初六日夜半子时，朝拜北斗第六宫武曲星君，注人间金银五谷财帛，案内管三百六十星官、三百六十司、三千六百曹官，身披白衣，头戴素冠，手执白简，脚踏朱履，各执文簿，又有三千六百童子，身着白衣，手执白旛，以应西方庚辛之金，侍右。 武曲星君，判断阳冥，臣启北斗武曲星君，善注人间财帛，善利他人，莫生毒害，免见囚徒死亡交杂，上望斗真赐福，本命降祥，衣禄增崇，元辰共护，仍乞神芘，不昧道心，清黑长存，万物自然，其人当得二千四百功德，罪障消灭，急急如律令！ 九月初七日夜半子时，朝拜北斗第七宫破军星君，注籍人间伤暴诛斩囚徒，案内管三百六十星官、三百六十司、三千六百曹官，身披白衣，头戴素冠，手执白简，脚踏朱履，又有三千六百童子，身着白衣，手执白旛，以应西方庚辛之金，及天上地下人间五行造化生旺所属星宫舍次之分，流布祯祥，侍右。",
      "translated_text": "The Star Lord of Greed and Wolf judges the affairs of the living and the dead.\nYour servant invokes the Northern Dipper’s Star Lord of Greed and Wolf, who benevolently records the life and death of mortals, ensuring equitable good deeds. May the sovereign enjoy ten thousand years of life, court ministers remain loyal, and human affairs flow in harmony. Spare them from exile, execution, or decapitation, that each may be born and die in goodness, never obscuring the heart of the Dao. May pure *qi* endure, and the myriad things arise naturally. Such a person shall accrue three thousand six hundred and ninety measures of merit, their transgressions gradually dissolving. Swiftly, swiftly, as decreed by the statutes!\n\nAt midnight during the *zi* hour on the second day of the ninth month, prostrate before the Northern Dipper’s second palace, the Star Lord of Great Gate, who benevolently records longevity among mortals. Within his case, he oversees three hundred and sixty star officials, three hundred and sixty bureaus, and three thousand six hundred celestial offices. Clad in yellow robes, crowned with a yellow cap, and shod in red shoes, he holds a yellow tablet. He is attended by three thousand six hundred youths, dressed in yellow, bearing yellow banners, corresponding to the *wu-ji* earth of the center.\n\nThe Star Lord of Great Gate judges the affairs of the living and the dead.\nYour servant invokes the Northern Dipper’s Star Lord of Great Gate, who benevolently records equitable good deeds among mortals. May the sovereign enjoy ten thousand years of life, and worthy ministers assist the state. May human affairs flow in harmony, sparing them from exile, execution, or decapitation, that each may be born and die in goodness, never obscuring the heart of the Dao. May pure *qi* endure, and the myriad things arise naturally. Such a person shall attain five thousand one hundred and seventy measures of merit, their transgressions eradicated. Swiftly, swiftly, as decreed by the statutes!\n\nAt midnight during the *zi* hour on the third day of the ninth month, pay homage to the Northern Dipper’s third palace, the Star Lord of Emolument and Existence, who records the affairs of the orphaned, widowed, lame, and blind among the four classes of people. Within his case, he oversees three hundred and sixty star officials, three hundred and sixty bureaus, and three thousand six hundred celestial offices. Clad in black robes, crowned with a black cap, and shod in red shoes, he holds a black tablet. He is attended by three thousand six hundred youths, dressed in black, bearing black banners, corresponding to the *ren-gui* water of the north.\n\nThe Star Lord of Emolument and Existence judges the affairs of the living and the dead.\nYour servant invokes the Northern Dipper’s Star Lord of Emolument and Existence, who benevolently records the equitable life and death of mortals. Spare them from imprisonment, untimely death, or the extinction of the orphaned, widowed, and impoverished. May they never obscure the heart of the Dao. May pure *qi* endure, and the myriad things arise naturally. Such a person shall attain five thousand one hundred measures of merit, their transgressions dissolved. Swiftly, swiftly, as decreed by the statutes!\n\nAt midnight during the *zi* hour on the fourth day of the ninth month, prostrate before the Northern Dipper’s fourth palace, the Star Lord of Literary Brilliance, who records the success and failure of mortals. Within his case, he oversees three hundred and sixty star officials, three hundred and sixty bureaus, and three thousand six hundred celestial offices. Clad in black robes, crowned with a black cap, and shod in red shoes, he holds a black tablet. He is attended by three thousand six hundred youths, dressed in black, bearing black banners, corresponding to the *ren-gui* water of the north.\n\nThe Star Lord of Literary Brilliance judges the affairs of the living and the dead.\nYour servant invokes the Northern Dipper’s Star Lord of Literary Brilliance, who benevolently records the life and death of mortals, ensuring all other matters remain equitable. Spare them from licentiousness, failure, imprisonment, untimely death, or extinction. May they never obscure the heart of the Dao. May pure *qi* endure, and the myriad things arise naturally. Such a person shall attain three thousand three hundred measures of merit, their transgressions eradicated. Swiftly, swiftly, as decreed by the statutes!\n\nAt midnight during the *zi* hour on the fifth day of the ninth month, prostrate before the Northern Dipper’s fifth palace, the Star Lord of Integrity and Chastity, the Fire Star attended by the Merit Clerk. Within his case, he oversees three hundred and sixty star officials, three hundred and sixty bureaus, and three thousand six hundred celestial offices. Clad in crimson robes, crowned with a red cap, and shod in red shoes, he holds a vermilion tablet. He is attended by three thousand six hundred youths, dressed in crimson, bearing red banners, corresponding to the *bing-ding* fire of the south.\n\nThe Star Lord of Integrity and Chastity judges the affairs of the living and the dead, recording the matters of wind and fire among mortals.\nYour servant invokes the Northern Dipper’s Star Lord of Integrity and Chastity, who benevolently records the trials of life and death among mortals. Spare them from imprisonment, dissolve fire calamities, and safeguard commanderies and cities. May households be free from malevolent omens, and people enjoy peace and health. May divine spirits guard their gates, benefiting both public and private affairs. May they always encounter good fortune, never obscuring the heart of the Dao. May pure *qi* endure, and the myriad things arise naturally. Such a person shall attain three thousand three hundred measures of merit, all transgressions and faults utterly eradicated. Swiftly, swiftly, as decreed by the statutes!\n\nAt midnight during the *zi* hour on the sixth day of the ninth month, prostrate before the Northern Dipper’s sixth palace, the Star Lord of Martial Brilliance, who records the gold, silver, grains, and wealth of mortals. Within his case, he oversees three hundred and sixty star officials, three hundred and sixty bureaus, and three thousand six hundred celestial offices. Clad in white robes, crowned with a plain cap, and shod in red shoes, he holds a white tablet and registers. He is attended by three thousand six hundred youths, dressed in white, bearing white banners, corresponding to the *geng-xin* metal of the west.\n\nThe Star Lord of Martial Brilliance judges the affairs of the living and the dead.\nYour servant invokes the Northern Dipper’s Star Lord of Martial Brilliance, who benevolently records the wealth of mortals, ensuring it benefits others without malice. Spare them from imprisonment, untimely death, or misfortune. May the true stars of the Dipper bestow blessings, their life’s destiny bringing auspiciousness. May their clothing and emoluments increase in abundance, their original destiny protected. May divine spirits grant their shelter. May they never obscure the heart of the Dao. May pure *qi* endure, and the myriad things arise naturally. Such a person shall attain two thousand four hundred measures of merit, their transgressions eradicated. Swiftly, swiftly, as decreed by the statutes!\n\nAt midnight during the *zi* hour on the seventh day of the ninth month, prostrate before the Northern Dipper’s seventh palace, the Star Lord of Destruction and War, who records the violent deaths, executions, and imprisonments of mortals. Within his case, he oversees three hundred and sixty star officials, three hundred and sixty bureaus, and three thousand six hundred celestial offices. Clad in white robes, crowned with a plain cap, and shod in red shoes, he holds a white tablet. He is attended by three thousand six hundred youths, dressed in white, bearing white banners, corresponding to the *geng-xin* metal of the west, as well as the celestial, terrestrial, and mortal domains governed by the Five Phases’ transformations of generation and flourishing. May auspiciousness spread through the star palaces and their stations. They stand to the right.",
      "overlap_context": "th month, prostrate before the first palace of the Northern Dipper, the Star Lord of Greed and Wolf. Within the first case, he oversees three hundred and sixty star officials, three hundred and sixty bureaus, and thirty-six hundred celestial offices. Clad in azure robes, crowned with an azure cap, and shod in red shoes, he holds a green tablet. He is attended by thirty-six hundred youths, dressed in azure, bearing green banners and floral canopies, corresponding to the *jia-yi* wood of the east.",
      "start_char": 5265,
      "end_char": 6549,
      "start_sentence": 91,
      "end_sentence": 107,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.324418544769287,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上北斗二十八章经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "破军星君，璇玑玉衡，斗枢之府，判断阳冥。 臣总伸奏启北斗破军星君，天罡大圣法王天君、内垣帝座尊星君、外垣台辅寿禄君、延生保命君、度厄消灾君、扶衰散祸君、益算冲和君、七元将军、九宫天后，先乞赦臣夙生今世千愆万罪，次乞开度祖弥先亡冤亲滞爽，愿臣不经苦恼，与善因缘，万灾不干，精灵伏匿，所求者得，所向者亨。 再惟破军宫下善注人间伤暴，囚徒牢狱死亡众厄不侵，仍乞天芘，不昧道心，清炁长存，万物自然，坐贾行商，公私万吉，后昆昌炽，元亨利贞，其人当得三千八百功德，急急如律令！ 九月初八日夜半子时，朝拜北斗第八宫左辅星君，判断阳冥，注籍人间奴仆，案内管三百六十星官、三百六十曹官，各执文簿，掌天下仆马命宫生死分数，臣启北斗左辅星君，善注人间奴仆之事，兔见囚徒死亡，愿不失人身，清炁自然，万事和合。 九月初九日夜半子时，朝拜北斗第九宫右弼星君，判断阳冥，注籍人间奴婢，案内管三百六十星官，三百六十曹官，各执文簿，掌天下婢使命官生死分数，臣启北斗右弼星君，善注人间婢使命宫，免见囚徒牢狱，生死不失人身，清炁长存，万物自然，万事和合。 右奉上帝命降吾勑牒，起天符都天元帅授事真君，十二年分行病鬼王，东方甲乙木精五瘟鬼众，南方丙丁火精五瘟鬼众，西方庚辛金精五瘟鬼众，北方壬癸水精五瘟鬼众，中央戊己土精五瘟鬼众，天下杂使行病鬼神，二十四炁神王，七十二候鬼王，尽洞渊三昧所掌行病鬼神等众，或五行金木水火土之候，金木相克，人民受诛斩徒配，水火相克，人民受暴死、虎狼所伤，水土相克，人民受黄病瘟死，以火烧之，吾勑此鬼，使逐年逐月下降各分州县，随方逐家道观僧寺，察录罪福，不行善法，使天雷霹除，以火烧之，以水溺之。 或是仕宦，或是富豪，不积寸善，常行恶毒，不明贤良，或是官吏、狱卒里首人等，增加王法，将恶凌善，叫天不闻，官长不明，不行其善者，吾勑四目老访摇铃斩癹咤统领五瘟徒众，往来下方，若不信吾法，轻慢笑辱者，磨灭死绝。 元君再语帝日：此之九月九日九夜，遇夜半子时，若人至此月此日，自身合家清斋行道，清洁素裳冠履，百和名香砂素表章，奏拜三三之次，各随愿所陈披宣，吾在七元宫中端目视之，天宫金阙门下，有左右年直月直日直时直天一真官、天官直事，获时与此人合奏何事，披露何言，疾速判断善恶，定其分数，生人增加寿算，福禄自然，子子孙孙，代代相承，亡者生天，出离苦趣，受生善道，若求名利，随其高下，若雪冤雠，送冥府泰山府判，送速报司对照，天地无私，若有一王朝斗盖之，一国四方宁静，八表来朝，五谷成熟，果木茂盛，万民无争，乾坤佑之，星辰恭敬，若有清静道心朝斗盖之，坊境无诸魔难，此人虔诚积功，朝拜一二三年、二九之年，九玄七祖超生善国，见存获福，若有不信吾法者，头破七分，绝其命根。 北斗付嘱章第二十五 上士忘形，求道之真，道之玄妙，主握天下，随机而化，以应精龟拆形视物，言其吉凶，天降甘雨，普济万物，利世济人，不言而至，天地包育万物，故云上士求道也。 中士求道，贪其名利，外学也，委其火宅，贪其娱乐，被物所转，终身之苦，祸及子孙，饮食着衣太过，天地费工，三司配下，致使贫穷，累世受苦，生生世世，死入冥涂，无有出期，故云中士求道也。",
      "translated_text": "The Star Lord of Destruction and War, pivot of the jade celestial mechanism, axis of the Dipper’s hub, arbiter of the living and the dead. Your servant humbly petitions the Star Lord of Destruction and War of the Northern Dipper, the Heavenly Stem Great Sage Dharma King Heavenly Lord, the Inner Enclosure Emperor’s Throne Venerable Star Lord, the Outer Enclosure Terrace-Assistant Longevity and Prosperity Lord, the Life-Prolonging and Destiny-Protecting Lord, the Calamity-Dispelling and Disaster-Eradicating Lord, the Decay-Supporting and Misfortune-Dispersing Lord, the Lifespan-Enhancing and Harmony-Balancing Lord, the Seven Primes Generals, and the Nine Palaces Heavenly Queen. First, I beseech forgiveness for the thousand transgressions and ten thousand sins of your servant’s past and present lives. Next, I beseech deliverance for the lingering souls of ancestors and departed kin, bound by grievances. May your servant be spared suffering and distress, granted favorable karmic conditions, untouched by the myriad calamities, with malevolent spirits subdued and hidden. May all that is sought be attained, and all that is pursued be prosperous.\n\nMoreover, beneath the palace of the Star Lord of Destruction, benevolent records are made of mortal injuries, violent deaths, and the afflictions of prisoners and those in bondage. I beseech the celestial grace that my Dao-heart remain unobscured, with pure *qi* enduring eternally, and all things in their natural state. May merchants and travelers, public and private affairs, all be blessed with myriad fortunes. May descendants flourish, and the primal harmony prevail. Such a person shall accrue three thousand eight hundred merits. Swiftly, swiftly, as the law commands!\n\nOn the eighth night of the ninth month, at midnight, prostrate before the Northern Dipper’s eighth palace, the Star Lord of the Left Assistant, arbiter of the living and the dead, who records the fates of servants and slaves among mortals. Within his case, he oversees three hundred and sixty star officials and three hundred and sixty celestial offices, each holding registers to govern the lifespans and deaths of the world’s servants and steeds. Your servant petitions the Star Lord of the Left Assistant, who benevolently records the affairs of mortal servants and slaves, sparing them from imprisonment, death, and the loss of human form. May pure *qi* abide naturally, and all matters harmonize.\n\nOn the ninth night of the ninth month, at midnight, prostrate before the Northern Dipper’s ninth palace, the Star Lord of the Right Assistant, arbiter of the living and the dead, who records the fates of maidservants and bondswomen among mortals. Within his case, he oversees three hundred and sixty star officials and three hundred and sixty celestial offices, each holding registers to govern the lifespans and deaths of the world’s maidservants and bondswomen. Your servant petitions the Star Lord of the Right Assistant, who benevolently records the destinies of mortal maidservants and bondswomen, sparing them from imprisonment and bondage, and preserving their human form in life and death. May pure *qi* endure eternally, all things be in their natural state, and all matters harmonize.\n\nBy the August Mandate of the Supreme Emperor, this decree is issued to the Heavenly Talisman Marshal of the Capital of All Heavens, the True Lord who executes affairs, the Ghost King of Epidemic Diseases for the twelve-year cycle, the five pestilence ghost hosts of the *jia-yi* wood essence of the east, the five pestilence ghost hosts of the *bing-ding* fire essence of the south, the five pestilence ghost hosts of the *geng-xin* metal essence of the west, the five pestilence ghost hosts of the *ren-gui* water essence of the north, the five pestilence ghost hosts of the *wu-ji* earth essence of the center, the myriad epidemic ghost spirits of the world, the twenty-four *qi* spirit kings, the seventy-two seasonal ghost kings, and all epidemic ghost spirits under the jurisdiction of the Cave Abyss Samādhi. Whether by the phases of the Five Agents—metal, wood, water, fire, or earth—when metal and wood clash, mortals suffer executions and exile; when water and fire clash, mortals suffer violent deaths or injuries by tigers and wolves; when water and earth clash, mortals suffer from jaundice and perish in epidemics. These ghosts are burned by fire.\n\nThis decree commands them to descend year by year and month by month to their respective prefectures and counties, visiting every household in temples and monasteries across the land to inspect and record their merits and transgressions. Those who fail to practice virtuous dharma shall be struck down by celestial thunder, burned by fire, or drowned by water. Whether officials, the wealthy, or the powerful, those who accumulate no goodness, perpetrate evil, and fail to recognize the worthy—be they magistrates, jailers, or village heads—who exacerbate the law’s severity, oppress the good, and ignore the cries of the people, or whose superiors remain blind to virtue, shall be punished. This decree commands the Four-Eyed Elder, who shakes the bell and wields the executioner’s blade, to lead the hosts of the five pestilences in their descent to the mortal realm. Those who defy this law, mocking or insulting it, shall be annihilated, their lineages extinguished.\n\nThe Primordial Lord further addressed the Emperor: On the ninth night of the ninth month, at midnight, if one, together with their household, observes a pure fast, practices the Dao, dons immaculate robes and cap, and offers fragrant incense and white memorials, prostrating thrice in succession and presenting their wishes, I shall observe them from the Seven Primes Palace. At the Golden Gates of the Celestial Palace, the celestial officials on duty for the year, month, day, and hour, along with the True Officer of Heaven, shall promptly receive and present their petitions. Whatever is sought or revealed shall be swiftly judged as good or evil, and their fate determined. The living shall have their lifespans extended, and blessings and prosperity shall come naturally. Descendants shall inherit these fortunes generation after generation. The departed shall ascend to heaven, escape the realms of suffering, and be reborn in auspicious destinies. If seeking fame or profit, their rank shall correspond to their aspirations. If redressing grievances, their cases shall be sent to the courts of Fengdu and Mount Tai, swiftly adjudicated in the Bureau of Retribution. Heaven and earth are impartial. Should a king prostrate before the Dipper, his realm and the four directions shall know peace, the eight wilds shall submit, the five grains ripen, fruits and trees flourish, and the people live without strife. Heaven and earth shall protect him, and the stars shall honor him. Should one with a pure Dao-heart prostrate before the Dipper, their district shall be free of demonic afflictions. Such a person, through sincere devotion and accumulated merit, prostrating for one, two, or three years—or eighteen years—shall enable the seven ancestors and nine lineages to transcend and be reborn in blissful realms, while the living shall gain blessings. Those who defy this law shall have their heads split into seven parts, their lifelines severed.\n\n**Chapter Twenty-Five: The Northern Dipper’s Entrusted Petition**\nThe superior adept forgets form to seek the truth of the Dao. The Dao’s profound mystery holds dominion over the world, adapting to circumstances and transforming in response, like the tortoise’s divination or the oracle’s discernment of fortune and misfortune. Heaven sends sweet rain to universally succor all things, benefiting the world and aiding humanity, arriving without announcement. Heaven and earth nurture the myriad beings—thus is the superior adept’s pursuit of the Dao.\n\nThe middling adept seeks the Dao for fame and profit, an external learning that abandons the burning house of worldly attachments, indulging in fleeting pleasures, ensnared by material desires. Their lifelong suffering extends to their descendants, who endure hardship for generations. Excess in food and clothing wastes heaven and earth’s labor. The Three Offices impose retribution, reducing them to poverty, their suffering spanning lifetimes, their deaths consigning them to the dark paths without hope of escape—thus is the middling adept’s pursuit of the Dao.",
      "overlap_context": "six hundred celestial offices. Clad in white robes, crowned with a plain cap, and shod in red shoes, he holds a white tablet. He is attended by three thousand six hundred youths, dressed in white, bearing white banners, corresponding to the *geng-xin* metal of the west, as well as the celestial, terrestrial, and mortal domains governed by the Five Phases’ transformations of generation and flourishing. May auspiciousness spread through the star palaces and their stations. They stand to the right.",
      "start_char": 6550,
      "end_char": 7855,
      "start_sentence": 108,
      "end_sentence": 118,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.96318030357361,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上北斗二十八章经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "下士求道，将道为门，贪财贪色，口谈今古，心知昧行，贵求衣食，昧道之源，流浪生死，沉沦苦海，三司配下冥曹，堕作牛马之身，转转生生，死入轮回，永不遇其正道，善业不闻，故云下士求道也。 北斗付嘱章第二十六 大道北斗元君重告帝曰：吾在天宫逐季逐月下降之日，统领诸天列仙及四目老翁、十二时辰四直使者，同到下方，检点王臣州县官僚士庶、僧尼道俗，及诸山林社庙鬼神、河伯水官、天地山川、江河淮济、木树精灵、山岩石穴、桥梁古木，年深成精，作诸魍魉怪魅，及诸般蛟蜃，食生人血，害生人命，及人住宅冢坟，并修方起造，坐宫作向，有犯天星地宿，并一切人民心行一切善念。 大道之意，行於平等，救护贫苦，给济衣食，一切病患，给以汤药，推问当界神王社令、住宅土地、司命灶君、七十二禁忌之神，住宅人口，善男信女，老幼尊卑，童奴童婢，或外人寄居，发心朝元，恭敬吾斗之法，其人当受衣食无穷，寿命延长，不见刀兵恶事，及一切患苦，赐增一万一千八百功德，常得善星拥护，其住宅当界一切龙神，亦受三万二千功德，八万八千禄位，超出鬼趣，得生上界天邑天宫，受人天快乐，转於星官真君之位。 凡修方注禄，坐宫作向，大获安宁，随心所应，天神护佑。 又有国王大臣文武官班见闻北斗付嘱之法，心生恭敬，遥空望斗朝元，乞保家国安宁之赐。 又有生民合家眷爱，齐心信受，沐浴身心，虔诚朝元，便得天曹注福，地府落名，南斗注生，元辰共护，天地水府三官大帝，三府群真同举，具奏北极大帝积功等数，奏上三天，吾北府斗枢当差四目老翕，领下三千六百案局，具录进奏昊天金阙玉皇大天帝，吾亲奏受平等注生真君之位，共治下界生民，除诸恶毒之气，见存眷爱，万灵护佑，子子孙孙，除灾降福，真实不虚。 或有生民不行善道，秤尺升斗不平，心行暗毒，广造恶业，谋害善良，百灵落籍，减除福禄寿命，善籍注罪，送入地狱，永失人身，流浪生死，难遇超生，若出入#2中，六根不具足，及受诸苦恼，精神暗昧，衣不盖形，食不充口，或受囚狱困苦连绵之危难。 元君复告帝曰：一切生民，心念行善，善果之报； 心念行恶，恶缘之报。 大道之语，真实不虚。 若不信者，吾使逆法治之，勑差天中五雷使者灭随霹雳绝，勑差五瘟大宪行化恶病绝，勑差南方炎帝烈火星众焚荡绝。 吾於每年逐季逐月下降，巡转分野，国郡州县镇场管界王神、社庙住宅龙神司命，较量一切善恶，四目老翁检点城隍土主里域灵祇，及九州社令、十洲社官、司命录籍诸神，逐月逐时抄录人间善恶，具奏天曹，祸福无私。 又有正月二十五、二十六日，二月初三、初七日，三月念三、念六日，此三月系春季，行天雷天火烧之，五瘟时气病之死绝，若学道求真，心无二行，吾当注福延命。 四月十七、二十七日，五月初五、十三、二十日，六月初四、初八日，此系夏季，分龙行雨，随行抄录善恶轻重，积善者十倍全收，积恶者减克四分。 七月初四、二十四日，八月十一、十九、二十七日，九月初三、十八日，此系秋季，收掠人间五谷，分数善恶等分，注簿抄攒，增减祸福，分毫无私。",
      "translated_text": "The inferior adept seeks the Dao, treating it as a mere gateway, coveting wealth and sensual pleasures, discoursing on past and present with their lips while their hearts know only deceitful conduct. They prize the pursuit of food and clothing, oblivious to the Dao’s source, drifting through the cycles of life and death, sinking into the苦海 of suffering. The Three Offices consign them to the underworld courts, condemning them to rebirth as oxen or horses, spinning endlessly through the wheel of existence. Death casts them into rebirth, never to encounter the true Dao, never to hear of meritorious deeds—thus is the inferior adept’s pursuit of the Dao.\n\n**Chapter Twenty-Six: The Northern Dipper’s Entrusted Charge**\n\nThe Primordial Sovereign of the Great Dao and Northern Dipper once more addressed the Emperor, saying: On the days when I descend from the celestial palace each season and month, I lead the hosts of heaven’s immortals, the Four-Eyed Elder, and the twelve hourly messengers of the Four Quarters to the lower realms. There, we inspect kings, ministers, prefectural and county officials, scholars and commoners, monks and nuns, Daoists and laity, as well as the spirits of mountain forests, altars, and temples, the river lords and water officials, the deities of heaven and earth, mountains and rivers, the Yangzi, Huai, and Ji, the numina of trees and ancient woods, the spirits of cliffs and caves, and the bridges and aged trees that have grown sentient over centuries—all the *wangliang* demons, monstrous apparitions, and various dragons and *shen* that feed on human blood and take human lives. We examine the dwellings and ancestral tombs of the people, all construction and orientation of residences, and whether they have offended the celestial stars or terrestrial constellations, along with every virtuous thought in the hearts of all people.\n\nThe intent of the Great Dao is to act with impartiality, to succor the poor and destitute, to provide clothing and food, and to offer medicine to all the sick. We interrogate the local deities—kings of spirits, altar lords, household earth gods, Stove Lords, and the seventy-two deities of taboos—regarding the inhabitants of each dwelling: good men and faithful women, elders and juniors, masters and servants, bondservants and maidservants, or even sojourners. If any, with sincere hearts, aspire to the primordial and reverently uphold the Dipper’s methods, they shall receive boundless clothing and food, their lifespans extended, and they shall be spared from warfare, misfortune, and all suffering. They will be granted 11,800 merits, constantly protected by benevolent stars. The dragon spirits of their dwelling’s domain shall also receive 32,000 merits and 88,000 ranks of emolument, transcending the ghostly realms to be reborn in the celestial cities and palaces of the upper realms. There, they shall enjoy the joys of humans and gods, ascending to the ranks of stellar officials and perfected lords.\n\nFor those who align their dwellings and orient their palaces, great peace shall be attained, their every wish fulfilled, and the gods shall guard and bless them.\n\nMoreover, if kings, great ministers, civil and military officials hear of the Northern Dipper’s entrusted charge and, with reverent hearts, gaze toward the Dipper from afar to pay homage, beseeching the blessing of peace for their states and families—\n\nOr if the people of the world, with their entire households and loved ones, unite in faith, purify body and mind, and sincerely pay homage to the primordial, they shall receive the celestial courts’ inscription of blessings, their names recorded in the earthly registers. The Southern Dipper shall inscribe their lives, and the Primordial Chronograms shall protect them together. The Three Officials—the Emperors of Heaven, Earth, and Water—and the hosts of immortals of the Three Bureaus shall jointly memorialize the accumulated merits to the Northern Pole Great Emperor. The Dipper Pivot of Our Northern Bureau shall dispatch the Four-Eyed Elder to lead the 3,600 case offices in compiling and submitting the records to the Jade Emperor of the Golden Portal of the Supreme Heaven. We shall personally memorialize their elevation to the rank of Impartial Life-Inscribing Perfected Lords, jointly governing the people of the lower realms, dispelling all noxious *qi*. Their living kin shall be protected by the myriad spirits, their descendants generation after generation delivered from disaster and blessed with fortune—this is no empty promise.\n\nIf there are people who do not practice the virtuous Dao, who cheat in weights and measures, whose hearts harbor hidden malice, who commit manifold evil deeds, who scheme against the good—then the spirits shall strike their names from the registers, diminishing their blessings, emoluments, and lifespans. Their names shall be inscribed in the ledgers of sins and sent to hell, forever losing their human form. They shall drift through the cycles of life and death, rarely encountering liberation. If reborn, they may lack the six senses or endure all manner of suffering: their spirits dimmed, their clothes insufficient to cover their bodies, their food inadequate to fill their mouths, or they may suffer imprisonment, hardship, and unending peril.\n\nThe Primordial Sovereign further addressed the Emperor, saying: All living beings who think and act with goodness shall receive the retribution of good fruits; those who think and act with evil shall receive the retribution of evil karma. The words of the Great Dao are true and not false. Those who do not believe shall be punished by countermanding the law: I shall command the Five Thunder Messengers of the Central Heaven to strike them down with thunderbolts, the Five Pestilence Great Commissioners to afflict them with deadly diseases, and the hosts of the Fiery Star of the Southern Thearch to incinerate and annihilate them.\n\nEach year, on the days of My seasonal descents, I traverse the regions and domains, inspecting the guardian spirits of states, commanderies, prefectures, counties, towns, and villages, the dragon spirits of altars and dwellings, the Stove Lords, and the deities of the land. The Four-Eyed Elder examines the city gods, earth masters, and local spirits, along with the altar lords of the Nine Provinces and Ten Continents, the Stove Lords, and the recording deities of the registers. Each month and hour, they transcribe the good and evil of the human world and memorialize it to the celestial courts—reward and punishment are impartial.\n\nMoreover, on the twenty-fifth and twenty-sixth days of the first month, the third and seventh days of the second month, and the twenty-third and twenty-sixth days of the third month—these three months being spring—the Celestial Thunder and Celestial Fire shall burn away those who die from the Five Pestilences and seasonal epidemics. Those who study the Dao and seek the true, their hearts undivided, shall have their blessings inscribed and their lives extended.\n\nOn the seventeenth and twenty-seventh days of the fourth month, the fifth, thirteenth, and twentieth days of the fifth month, and the fourth and eighth days of the sixth month—these being summer—the dragons shall distribute rain, and the records of good and evil shall be compiled according to their weight. Those who accumulate goodness shall receive tenfold recompense in full; those who accumulate evil shall have their merits reduced by four-tenths.\n\nOn the fourth and twenty-fourth days of the seventh month, the eleventh, nineteenth, and twenty-seventh days of the eighth month, and the third and eighteenth days of the ninth month—these being autumn—the harvest of the five grains shall be assessed, and the degrees of good and evil shall be apportioned. The registers shall be transcribed and compiled, blessings and misfortunes adjusted, with not the slightest partiality.",
      "overlap_context": " learning that abandons the burning house of worldly attachments, indulging in fleeting pleasures, ensnared by material desires. Their lifelong suffering extends to their descendants, who endure hardship for generations. Excess in food and clothing wastes heaven and earth’s labor. The Three Offices impose retribution, reducing them to poverty, their suffering spanning lifetimes, their deaths consigning them to the dark paths without hope of escape—thus is the middling adept’s pursuit of the Dao.",
      "start_char": 7855,
      "end_char": 9068,
      "start_sentence": 119,
      "end_sentence": 134,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.46135067939758,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上北斗二十八章经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "十月初十、二十六日，十一月初一、初九、十七、二十五日，十二月二十日，此系冬季，检校四天下人民善恶阴隐，而又十二月三十日夜半子时，旧年太岁交换新年太岁点对方位，三煞十二禁忌，若有志心，不拘高下贵贱，阴间鬼神道、畜生道、或地狱道，或女人欲转男子身，或在床枕久病，或被恶人道路劫掠，或被冤人执赖，或被官灾横祸，或被邻里谋执，或被狱囚日久，无门得放，或遭五瘟行病，或被巫师咒诅，或兄弟不和，或夫妻不顺，或为名利牵缠，或无男女，或在恶道之中、不仁之所，或被蛟蜃之难，或修方有悮年月日时，坐宫作向有犯凶星恶煞，或行兵入阵一切不明之事，至斗真下降之日，清斋志诚，焚香朝拜，面向北方，一心恭敬，分申情款，吾管案分仙曹灵官，度量善恶等分轻重，除灾降福，如业力重者，阴罪降之，恐坠人身，若善力高者，吾当注一万五千八百善利，道业清静，功德完成，吾斗府真仙部众面奏昊天金阙玉皇上帝，乞降勑旨符命颁行，天蓬大圣主帅真武佑圣，帅将及四目老翁神通眷属部众，各化法身三十六丈，无时奉勑救护生民，不敢违令。 吾说此经，开济存亡两道，令死者冤者各遂超升，令生者善者同增福寿，若学仙道，早得仙名，此是诵经朝元礼斗大感应者也。 若有鬼神不信、违吾语者，头破分裂，应灭魔族，吾勑力斩癹，急急如律令！ 北斗付嘱章第二十七 元君复告帝曰：若於来世，当证高真上仙之位，天蓬大帅，吾勑赐摩顶圣明，合受一万八千善利，清静道行上妙功德，广扬吾法，治教人间生民利益，皆由圣明大种福田。 元君赞经曰： 家有北斗经，家国自安宁。 家有北斗经，寿命自然长。 家有北斗经，亡者得超生。 家有北斗经，官灾不能成。 家有北斗经，五谷自成熟。 家有北斗经，百怪不能侵。 家有北斗经，更夜自然安。 北斗付嘱章第二十八 元君曰：吾今一一赐与护持，凡此实语，过胜金玉。 昊天玉皇上帝之法，祥瑞章句，光如日月，明如星斗，吾今赐与，将治人间，愿凡夫人人各归善道，愿个个返本朝元。 又语帝日：善护人民，永为天地山河教法作主，通世流布，不昧其功，前章一一乃为分别，更无虚也。 吾众今奉上帝勑宣，来诏吾众，更不久住，各返仙都，凡此经典，不得轻慢，须洁净焚香至诚，身披道服素裳，一心看礼，如对吾面而宣。 是时帝闻语已，稽首再拜奉辞，圣驾还返仙宫，大汉明皇圣主，当时勑下省部，直送郡邑名山福地道观抄录，传授人天，信受奉行。 太上北斗二十八章经竟 #1『文章』，据下文，疑此二字为衍文。 #2『入』，疑当作『人』。",
      "translated_text": "On the tenth and twenty-sixth days of the tenth month, the first, ninth, seventeenth, and twenty-fifth days of the eleventh month, and the twentieth day of the twelfth month—these being winter—the deities shall inspect the good and evil, the hidden and concealed, of the people across the Four Heavens. Moreover, at midnight of the thirtieth day of the twelfth month, as the Year-Star of the old year yields to that of the new, the positions of the Three Sha and the Twelve Taboos shall be assessed. For those of sincere devotion, regardless of high or low station, noble or base—whether spirits in the ghostly realm, beings in the animal realm, or souls in the hellish realm; whether women wishing to be reborn as men; those bedridden with chronic illness; those robbed by brigands on the road; those falsely accused by enemies; those afflicted by official calamities or misfortune; those framed by neighbors; those imprisoned for years with no hope of release; those stricken by the Five Pestilences; those cursed by sorcerers; those at odds with brothers; those in discord with spouses; those entangled in the pursuit of fame and profit; those without sons or daughters; those trapped in evil destinies or unkind places; those beset by floods or sea-monsters; those whose construction of altars or selection of directions has erred in year, month, day, or hour, offending inauspicious stars or malevolent spirits; or those engaged in warfare or entering battle with all manner of uncertainties—on the days when the Perfected of the Dipper descend, let them purify themselves, fast with sincerity, burn incense, and prostrate in worship, facing north with single-minded reverence. Let them present their pleas, and I, the Recording Immortal of the Dipper’s Bureau, shall weigh the degrees of their goodness and evil. I shall dispel misfortune and bestow blessings: if their karmic burden is heavy, their hidden sins shall be meted out, lest they fall from human form; if their virtuous power is great, I shall inscribe for them fifteen thousand eight hundred blessings. With their Dao-practice pure and their merit complete, the Perfected Immortals of my Dipper Palace shall memorialize the Jade Emperor of the Golden Portal of the Vast Heaven, beseeching the issuance of a sacred decree and talismanic command. The Great Sage Marshal Tianpeng, the Perfected Warrior of Dark Might, shall lead his generals, the Four-Eyed Elder, and their divine retinues, each manifesting a dharma-body of thirty-six *zhang*, to obey the decree at all times and rescue the living, daring not disobey the command.\n\nI proclaim this scripture to open the paths of deliverance for both the living and the dead, that the wronged and the deceased may each attain liberation, and that the living and the virtuous may together increase in fortune and longevity. Those who cultivate the Dao of immortality shall swiftly attain immortal rank. Such are the great responses to reciting this scripture, venerating the Primordial, and worshipping the Dipper.\n\nShould any ghosts or spirits disbelieve and defy my words, their heads shall shatter and their clans be annihilated. By my decree, I shall sever their demonic roots—hasten, hasten, in accordance with the law!\n\n**Chapter Twenty-Seven: The Dipper’s Entrustment**\nThe Lady of the Primordial again addressed the Emperor, saying: In future kalpas, when you attain the rank of High Perfected and Upper Immortal, and become Marshal Tianpeng, I shall bestow upon you the sacred illumination of my touch upon your crown, granting you eighteen thousand blessings. With your pure Dao-conduct and sublime merit, widely propagate my Dharma to benefit the living in the world, for all shall depend upon your sagely and luminous great field of blessings.\n\n**The Lady of the Primordial Praises the Scripture, saying:**\nA household with the Dipper Scripture brings peace to family and state.\nA household with the Dipper Scripture naturally enjoys long life.\nA household with the Dipper Scripture sees the dead attain rebirth.\nA household with the Dipper Scripture cannot be harmed by official calamities.\nA household with the Dipper Scripture sees its five grains ripen of themselves.\nA household with the Dipper Scripture cannot be invaded by malevolent spirits.\nA household with the Dipper Scripture finds safety even in the dead of night.\n\n**Chapter Twenty-Eight: The Dipper’s Entrustment**\nThe Lady of the Primordial said: I now bestow upon you, one and all, the charge to uphold and protect these true words, which surpass gold and jade in value. This is the Dharma of the Jade Emperor of the Vast Heaven—auspicious and wondrous verses, radiant as the sun and moon, bright as the stars and Dipper. I now grant it to you to govern the world of mortals. May all people return to the good Dao, and may each and every one revert to the Primordial and face the Origin.\n\nShe further addressed the Emperor, saying: Protect the people well, and forever serve as the master of the Dharma for heaven and earth, mountains and rivers. Disseminate it through the world, that its merit not be obscured. The preceding chapters have been distinguished one by one, and there is no falsehood in them.\n\nOur assembly now receives the Jade Emperor’s decree to proclaim this edict. We shall not tarry long, but each return to our celestial abodes. This scripture must not be treated with disrespect. You must purify yourselves, burn incense with utmost sincerity, don Daoist robes and plain garments, and recite it with single-minded devotion, as if facing me in person.\n\nUpon hearing these words, the Emperor bowed deeply, prostrated himself twice, and took his leave. The sagely carriage returned to the immortal palace. The August Emperor of the Great Han, the Sagely Lord Ming, then issued an edict to the provincial departments, directing that the scripture be delivered to renowned mountains, blessed lands, and Daoist abbeys for transcription and transmission to humans and gods, that all may believe, receive, and uphold it.\n\nHere ends the *Scripture of the Twenty-Eight Chapters of the Northern Dipper of the Most High*.",
      "overlap_context": "hose who accumulate evil shall have their merits reduced by four-tenths.\n\nOn the fourth and twenty-fourth days of the seventh month, the eleventh, nineteenth, and twenty-seventh days of the eighth month, and the third and eighteenth days of the ninth month—these being autumn—the harvest of the five grains shall be assessed, and the degrees of good and evil shall be apportioned. The registers shall be transcribed and compiled, blessings and misfortunes adjusted, with not the slightest partiality.",
      "start_char": 9068,
      "end_char": 10103,
      "start_sentence": 135,
      "end_sentence": 156,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.188273429870605,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上北斗二十八章经.txt",
        "category": "本文类"
      }
    }
  ]
}