{
  "source_id": "太上三五正一盟威阅箓醮仪",
  "source_file": "chunked_daozang\\太上三五正一盟威阅箓醮仪.json",
  "total_chunks": 6,
  "total_original_chars": 5203,
  "total_translated_chars": 33699,
  "total_translation_time": 153.85467624664307,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\威仪类\\太上三五正一盟威阅箓醮仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**Ritual Protocols of the Dongshen Section: The Supreme Alliance of the Three-Five Orthodox Unity Register-Inspection and Offering Rites**\n\n**Text Title:** *The Supreme Alliance of the Three-Five Orthodox Unity Register-Inspection and Offering Rites*\n*Compiled and edited by Master Guangcheng, Du Guangting, in the late Tang dynasty. A revised version of an early Celestial Master register-inspection ritual. One fascicle.*\n\n**Source:** *Daoist Canon of the Zhengtong Era*, Dongshen Section, Ritual Protocols.\n\n---\n\n**The Supreme Alliance of the Three-Five Orthodox Unity Register-Inspection and Offering Rites**\n*Compiled and edited by Master Guangcheng, Du Guangting*\n\nFor all register inspections, the rites are customarily performed on *jiazi*, *gengshen*, one’s own life-day, the Three Assemblies, the Three Primes, or the last and first days of the lunar month, during the *mao* and *you* hours.\n\n**Next: Kindling the Incense Burner**\nThe Supreme Mysterious Origin, the Five Numinous Venerable Lord, shall summon the Merit Officers and Envoys, the Left and Right Dragon-Tiger Lords, the Incense-Bearing Envoys, and the Three *Qi* Orthodox Deities. Hasten to report to the Three Heavens’ Supreme Mysterious Origin, the Orthodox Unity Dao Lord: \"Your servant now enters the oratory to burn incense. On this auspicious day of the [such-and-such] month, in the [such-and-such] prefecture, county, village, and hamlet, I reverently follow the methods of the Former Masters to inspect the Orthodox Unity Alliance Register of the Upper Immortals and Upper Numinous Twenty-Four Grades, along with the generals, officers, and soldiers bestowed upon my person for self-protection. May the upright and true *qi* of the Eight Directions descend into my body, that I may swiftly ascend to present myself before the August Jade Emperor of the Supreme Perfection of the Limitless Dao.\"\n\nThe Celestial Master of [such-and-such] Oratory, the True Person of the Three-Five Step Net of Primordial Destiny of the Red Heaven, bows twice and respectfully addresses the Supreme Venerable Lord of the Great Dao of the Limitless Three Heavens of the Great Clarity, the Heavenly Emperor Lord of the Supreme Elder, the Nine Elders of the Immortal Capital, the Hundred-Thousandfold *Qi* of the Elder of the Nine *Qi*, the Thousand-Two Hundred Official Lords of the Great Clarity before the Jade Throne of the Great Clarity: \"Your humble servant, dull and unworthy, has been blessed across a thousand kalpas to partake in this pure transformation. By your sheltering grace, I have been granted officers and soldiers for my protection. Ever adhering to the ritual statutes, I inspect on auspicious days the Orthodox Unity Register of the Upper Immortals and Upper Numinous Generals bestowed upon me. The Merit Officers, Envoys, Generals, and Soldiers recorded in the register each hold their appointed duties, safeguarding my body, pacifying my spirit, and nurturing my nature. May the Three Corpses be cast down, all calamities dissolved, illnesses expelled within, and decrepitude repelled without. In due time, I shall report my merits and seek promotion, never daring to betray this trust. I humbly present this petition.\"\n\n**Next: Striking the Ritual Drum Twenty-Four Times**\nFace east, sit upright, close the eyes, and visualize: to the left, the Azure Dragon; to the right, the White Tiger; before, the Vermilion Bird; behind, the Dark Warrior. The *qilin* and phoenix soar and perch at the four corners. The sun, moon, Five Planets, Twenty-Eight Constellations, and the Seven Stars of the Northern Dipper illuminate body and spirit.\n\n**Next: Exiting the Oratory**\n\nI reverently dispatch the One Hundred Fifty Generals of Upper Transcendents and Upper Numinous Beings from within my body, along with fifteen Direct Envoys, fifteen Orthodox Unity Attendants, and fifteen Healing Attendants, all to serve as my executive envoys. The Commanding Generals shall escort the proper *qi* of east, west, south, and north, dispelling illnesses. The Upper Transcendents, Upper Numinous Beings, and their left and right official envoys, along with the Commanding Generals, shall escort the four directions, repelling and expelling the Three Calamities, Nine Adversities, Five Punishments, and Six Harms. The chief officers and soldiers shall maintain order on left and right, preventing any misstep or error. Fifteen Upper Transcendents, Upper Numinous Beings, and yin-yang divine adjudicators shall emerge to harmonize my yin and yang, determine my register of life, pacify my spirit, and nurture my nature, aligning me with the Perfected Transcendents. Fifteen Healing Attendants and fifteen Grand Physician Officers shall emerge to regulate my yin and yang, examine the signs of my five viscera, and administer divine medicines to repel illness and dissolve calamities.\n\nThe Two Bureaus of Upper Transcendents and Upper Numinous Beings, along with their One Hundred Fifty Generals, shall lead their officers, generals, and soldiers to encircle my body in threefold ranks, leaving no gaps. One thousand two hundred Upper Transcendents, Upper Numinous Beings, Gentleman-Officers, Tiger Warriors, Inspectors of Treachery, Hook Cavalry, Three Bureau Commanders, and Archery Officers shall emerge to garrison and guard my dwelling, chambers, and courtyards, patrolling left and right, ever following a hundred paces from me in all directions. Their blades shall face outward to hunt down and capture the rebellious and perverse, seizing and annihilating all treacherous and iniquitous forces, permitting no escape, all to safeguard my body.\n\nOne thousand two hundred Upper Transcendents and Upper Numinous Beings, along with Celestial Armored Soldiers, and one hundred twenty Celestial Ding Warriors shall emerge to follow me in all directions, responding to my call and assembling at my command. Sixty *Qi*-Gathering and *Qi*-Consuming Officers, Spirit-Gathering and Spirit-Consuming Officers, Ghost-Gathering and Ghost-Consuming Officers, Malevolence-Gathering and Malevolence-Consuming Officers, and Poison-Gathering and Poison-Consuming Officers shall emerge to gather and consume all noxious epidemics, demonic *qi*, specters, malevolent spirits, cold damage, malarial fevers, dysentery, poisonous influxes, warm afflictions, and venomous creatures—all shall be gathered and devoured, utterly dispersed.\n\nTen Upper Transcendents, Upper Numinous Beings, Red Talisman Chariot Officers, Gale-Riding Couriers, and Memorial-Submitting Officers shall emerge to capture and seize iniquitous spirits, thieving demons, and improper *qi*, presenting memorials and petitions to ensure swift transmission.\n\n**Next: Dispatching the Petition-Offering Officers and Soldiers**\n\nI reverently dispatch the Register of the Orthodox Unity Supreme General, along with its Attendants, Generals, Envoys, Officers, Soldiers, and Jade Maidens, to assist me in aiding the state, propagating transformation, and eradicating malevolence, that the Supreme Dao may flourish.\n\nI reverently dispatch the Register of the Ten Orthodox Unity Generals, along with its Generals, Talisman Officers, Attendants, and others, to sever evil and reward goodness, fulfilling all my aspirations.\n\nI reverently dispatch the Register of the One Hundred Fifty Orthodox Unity Generals, along with its Numinous Officials, Attendants, Generals, Cavalry, Envoys, Officers, and Soldiers, to repel and expel improper human spirits and ghosts from the four directions, forever dissolving misfortune.\n\nI reverently dispatch the Register of the Three Orthodox Unity Generals, along with its Generals, Attendants, Divine Lads, and Jade Maidens, to cultivate life, nourish *qi*, and extend my years and blessings, fulfilling my will in all endeavors.\n\nI reverently dispatch the Register for Summoning the Hundred Ghosts of Orthodox Unity, along with its Attendants, Guardian Generals, Jade Lads, and Jade Maidens, to gather and sever all *wangliang* spirits within my body, sparing no harm to humanity.\n\nI reverently dispatch the Orthodox Unity Register of Primordial Destiny and Red Talismans, along with its Three Heavens’ Defilement-Dissolving Jade Lads and Jade Maidens, Five Directions’ Dragon Kings, Officers, and Soldiers, to eliminate all blood-consuming and wandering spirits that assail humanity, utterly eradicating them.\n\nI reverently dispatch the Orthodox Unity Register for Summoning Ghosts of Upper Transcendents, along with its various Perfected Ones, Divine Beings, Attendants, Six Jia Generals, Six Ding Jade Maidens, and others, to annihilate the Three Calamities and Nine Adversities upon my body, leaving no other afflictions.\n\nI reverently dispatch the Orthodox Unity Register of the Nine Provinces’ Community Decrees, along with its various Great Generals, Attendants, Jade Lads, Jade Maidens, and Direct Envoys, to propagate the Dao’s principles and *qi*, subduing all spirits.\n\nI reverently dispatch the Orthodox Unity Register of the Starry Net and Five Dipper, along with its Supreme Mystery Prohibitors, Hu Mystery Prohibitors, Western Mystery Prohibitors, Master Hu’s Prohibitors, Generals, Officers, and Soldiers, to prohibit and intercept all unrighteous, harmful, rebellious, and malevolent specters.\n\nI reverently dispatch the Orthodox Unity Register of the *River Chart* for Preserving Life, along with its Perfected Ones, Attendants, Generals, Jade Lads, and Jade Maidens, to safeguard my life, fulfilling all my requests with efficacy.\n\nI reverently dispatch the Orthodox Unity Register of the Six Harms, along with its Supreme Unity Lord, August Heavenly Thearch Lord, Supreme Primordial Lord, Six Harm Spirits, Punishment-Dissolving and Harm-Eradicating Attendants, Generals, and others, to drive away misfortune, a thousand spirits, and ten thousand ghosts, all to be captured and subdued.\n\nI reverently dispatch the Orthodox Unity Register of the Nine Phoenixes for Defilement-Breaking, along with its Celestial Numinous Red Officials, Demon-Severing Attendants, Execution, Capture, Severance, Interception, and Eradication Generals, Envoys, Jade Lads, and Jade Maidens, to cleanse and purge all unregistered malevolent spirits, ensuring divine responsiveness.\n\nI reverently dispatch the Orthodox Unity Register of the Capital Memorial and Completed Seal, along with its Celestial Numinous Officials, Attendants, Generals, Transcendents, Daoists, Jade Maidens, and Envoys, to sever and annihilate a thousand malevolences and ten thousand specters, preventing their encroachment upon the living.\n\nI reverently dispatch the Orthodox Unity Register of the Great Canopy, along with its various Attendants, Generals, Jade Lads, Jade Maidens, and Envoys, to execute and annihilate the rebellious, dissolving treachery and eradicating deceit.\n\nI reverently dispatch the Orthodox Unity Register of the Nine Heavens’ Military Talismans, along with its Attendants, Generals, Officers, and Soldiers, to secure my dwelling and respond instantly to my summons.\n\nI reverently dispatch the Orthodox Unity Register of the Nine Palaces for Warding Off Adversity, along with its Attendants, Transcendent Numinous Officials, Generals, Envoys, and Celestial Armored Soldiers, to aid the state and succor the people, fulfilling the desires of my heart and words.\n\nI reverently dispatch the Orthodox Unity Register of the Eight Trigrams for Body Protection, along with its Five Directions’ Generals for Summoning Ghosts, Five Thearch Generals, Left and Right Commandants, Officers, and Soldiers, to station one soldier every *chi* and one encampment every *li*, wielding swords and halberds to sever and extinguish spectral spirits.\n\nI reverently dispatch the Orthodox Unity Register of the Three-Five Summoning and Examination, along with its Generals of the Three Origins, Attendants of the Five Dipper, Attendants of the Five Stars, and various Divine Lads and Envoys, to summon stars and cause constellations to descend, entangling and binding the forms of malevolent spirits and wicked persons, compelling them to submission.\n\nI reverently dispatch the Orthodox Unity Register of the Dragon-Tiger for Slaying Malevolence, along with its Attendants, Generals, Envoys, Jade Lads, and Jade Maidens, to resist and repel spectral malevolence, with concentrated thought and secret response.\n\nI reverently dispatch the Orthodox Unity Register of the Divine Talismans for Warding Off Malevolence, along with its Mysterious Elder General, Five Garrison Generals, Five Canopy Generals, Supreme Generals, Attendants, and Envoys, to suppress and subdue celestial spirits, earthly *zhi*, *wangliang*, and spectral demons, ensuring they never harm humanity.\n\nI reverently dispatch the Orthodox Unity Register of the Four Divisions for Qi Prohibition, along with its Crimson Officials, various Attendants, Generals, Officers, Soldiers, Jade Lads, and Jade Maidens, to leap through stars and tread upon constellations, pacing the steps and invoking spirits, responding to my innermost heart, preventing the onset of illness.\n\nI reverently dispatch the Orthodox Unity Supreme Register for Greatly Slaying River Malevolence, along with its Five Commanding Generals, Hu, Yue, Qiang, and Cang forces, the Valiant Tiger Warriors of Lord Lao, those who shake heaven and move earth, Generals of the Five-Colored Canopy and the Supreme Mysterious Elder, along with their Officers, Soldiers, Envoys, Jade Lads, and Jade Maidens, to brandish flying halberds and wheeling blades, searching out and eradicating spectral malevolence, securing and safeguarding my dwelling, ensuring all is peaceful and untroubled.\n\nI reverently dispatch the Orthodox Unity Register of the Three-Five Attendants, along with its troops for concealing the body, hiding the shadow, and concealing the self, to internally guard the Three Palaces, externally govern the Three Realms, and eradicate celestial spirits, earthly *zhi*, corrupt Daoists, and demonic forces, beseeching their complete dissolution, with concentrated thought and secret response.\n\nI reverently dispatch the Orthodox Unity Register for Preserving Life and Prolonging Longevity, along with its various Attendants, Generals, Officers, Soldiers, and Envoys of the Left and Right Stellar Nets, to internally govern the Five Viscera, preventing the intrusion of malevolent *qi*, ensuring the heart, liver, spleen, kidneys, and lungs remain unharmed, commanding the Three Corpses to be annihilated, the hundred passages to flow smoothly, and ascending to heaven in broad daylight, bearing the profound grace of the Dao.\n\nNext, dispatching the various divisions of Generals and troops:\n\nI reverently dispatch the Orthodox Unity’s various divisions of the Supreme Mysterious Elder and Five Marquises, comprising five hundred thousand troops; the Supreme Mysterious Elder Liu General, the Peripatetic Heaven General, the Canopy Heaven General, the Establishing Heaven General, the Central Yue General, the Central Martial General, the Central Charioteer General, and the Central Pavilion General, each with one hundred thousand troops; the Supreme Five Canopy Generals, the Heavenly Encampment General, the Nine Kinds General, the Soaring Heaven General, the Nine Passes General, the Northern Watchtower General, the Nine Pearls General, the Nine Paths General, the Upright Heaven General, the Level Heaven General, the Yue Gate General, the Central High August Commanding General, the Eastern Azure Commanding General, the Southern Vermilion Commanding General, the Western White Commanding General, the Northern Black Commanding General, and the Central Yellow Commanding General, each with one hundred thousand troops.\n\nEach division, leading their respective troops, encamps before, behind, to the left, and right of me, eliminating misfortune and eradicating evil. The Supreme Five Kinds of Troops number five hundred thousand.\n\nDispatching the Central Palace’s Five Encampment Commanders with one hundred thousand troops; the City Gate Commanders with four hundred thousand soldiers; the Central Great Army with four hundred thousand troops; the Central Great Army of the Nine Upright Elders with one million troops; the Supreme City Gate Troops, Heavenly *Ding* Soldiers, the Eastern Encampment Great Army of the Former Thearch, the Supervising Heaven Great Army, the Earth-Shaking Great Army, and the Northern Five Qin Armies, each with four hundred thousand troops.\n\nDispatching the Supreme Azure Canopy, Vermilion Canopy, White Canopy, Black Canopy, and Yellow Canopy Great Armies, each with four hundred thousand troops.\n\nDispatching the Left and Right Generals, each with twelve troops.\n\nDispatching the Left and Right Transverse Marching Troops, numbering six hundred thousand.\n\nDispatching the Eastern Hu Elder Lord’s Reverse-Armor, Reverse-Scale Troops, nine hundred thousand strong.\n\nDispatching the Southern Yue Elder Lord’s Fire Encampment Cavalry, Fire Candle Officers, and troops, eight hundred thousand strong.\n\nDispatching the Western Di Elder Lord’s Refined Staff, Metal Essence Troops, six hundred thousand strong.\n\nDispatching the Northern Qiang Elder Lord’s Wuwan and Bian Que Troops, five hundred thousand strong.\n\nDispatching the Central Cang Elder Lord’s Twenty-Five Myriad Official Lords and troops, five hundred thousand strong.\n\nDispatching the Eastern Azure Origin *Jia-Yi* Lords, Southern Vermilion Origin *Bing-Ding* Lords, Western White Origin *Geng-Xin* Lords, Northern Black Origin *Ren-Gui* Lords, Central Yellow Origin *Wu-Ji* Lords, and the Heavenly Pillar Life-Directing Lords, each with one thousand two hundred chariots and cavalry.\n\nDispatching the High Heaven’s Ten-Thousand-*Zhang* Great Ghosts, the Hundred Ghosts’ Central Kings, each numbering twelve thousand, with six hundred thousand officers and soldiers.\n\nDispatching the High Merit Marshal, Central Cavalry General, Gentleman-Officers, Valiant Tiger Warriors, Inspectors of Treachery, Hook Cavalry, and Three Officials’ Commandants, each with one thousand two hundred troops.\n\nDispatching the Heavenly Couriers, Armored Soldiers, Heavenly *Ding* Valiants, *Qi*-Absorbing and *Qi*-Consuming Officers, Spirit-Absorbing and Spirit-Consuming Officers, Ghost-Absorbing and Ghost-Consuming Officers, Malevolence-Absorbing and Malevolence-Consuming Officers, Essence-Absorbing and Essence-Consuming Officers, Toxin-Absorbing and Toxin-Consuming Officers, and Talisman-Slaying and Shrine-Destroying Officers, each numbering twelve thousand.\n\nAll are dispatched to serve me, [Name], and stand ready before the altar, wielding the authority of heaven, sternly bearing arms, punishing rebellion, eradicating spectral malevolence, and protecting my person, responding instantly to my summons.\n\nI reverently dispatch the Crimson Register of the Primordial Chaos Perfected One of the Original Destiny of the Central Division, from the Upper Three Heavens’ Three-Five Attendants, along with the Direct Envoys, Orthodox Unity Attendants, and fifteen each of the Attendants for the East, West, South, and North, to establish and distribute the upright *qi*, cure all illnesses, and prolong life, with fifteen Envoys for each of the directional offices.\n\nDispatched to serve me, [Name], are fifteen Officers for Communicating with the Netherworld and Coordinating Affairs, ensuring no retreat in the divine decrees of yin and yang. Dispatched to serve me are fifteen Officers of the Yin-Yang Bureau for Harmonizing Yin and Yang, Determining the Registers of Life, and Generating *qi*, along with fifteen Grand Physicians of the Yin-Yang Offices for Healing Illnesses. Dispatched to serve me are fifteen Envoys for Harmonizing Acupuncture and Medicines, Curing All Illnesses, and Eliminating Falsehoods and Expelling Malevolence. Dispatched to serve me are fifteen Officers of the Controller of Destiny for Eliminating Malevolence, Dispelling Falsehoods, Eradicating Evil, and Punishing the Wicked. Dispatched to serve me are fifteen Officers of the Controller of Emoluments for Augmenting Longevity and Increasing Life Span. Dispatched to serve me are fifteen Officers of the Controller of Perils for Conferring Rank and Enriching Emoluments. Dispatched to serve me are fifteen Officers of the Controller of Punishments for Governing and Transforming without Disorder. Dispatched to serve me are fifteen Scribes of the Controller of Rectitude for Beheading Demons and Eradicating Māras. Dispatched to serve me are fifteen Officers of the Controller of Villainy for Eliminating Wrongful Accusations and Severing Excesses. Dispatched to serve me are fifteen Officers of the Controller of Surveillance for Restraining Deviant Licentiousness. Dispatched to serve me are fifteen Chief Officers of the General Bureau for Affirming the Right and Protecting the Just.\n\nDispatched to serve me are fifteen Lords of Destiny of the Ninefold Yellow Path of the Central Palace of the Upper Three Heavens’ Literary Brilliance for Subduing Rebellion and Restoring Order. Dispatched to serve me are nine Great Generals of the Dipper’s Net for Erasing Death from the Registers, Rectifying Life’s Name, Securing the Cinnabar Field, Dispelling Disasters, and Averting Illnesses, from the Three-Five Crimson Heaven of Primordial Chaos, who give birth to the body and shield the spirit. Dispatched are nine Left Generals of the Dipper’s Net. Dispatched are nine Right Generals of the Dipper’s Net. Dispatched are nine Great Generals of the Dipper’s Handle. Dispatched are nine Left Generals of the Dipper’s Handle. Dispatched are nine Right Generals of the Dipper’s Handle. Dispatched are nine Great Generals of the Dipper’s □. Dispatched are nine Left Generals of the Dipper’s □. Dispatched are nine Right Generals of the Dipper’s □. Dispatched are nine Great Generals of the Dipper’s □. Dispatched are nine Left Generals of the Dipper’s □. Dispatched are nine Right Generals of the Dipper’s □. Dispatched are nine Great Generals of the Dipper’s □. Dispatched are nine Left Generals of the Dipper’s □. Dispatched are nine Right Generals of the Dipper’s □. Dispatched are nine Great Generals of the Dipper’s *Bi*. Dispatched are nine Left Generals of the Dipper’s *Bi*. Dispatched are nine Right Generals of the Dipper’s *Bi*. Dispatched are nine Great Generals of the Dipper’s □. Dispatched are nine Left Generals of the Dipper’s □. Dispatched are nine Right Generals of the Dipper’s □. Dispatched are nine Great Generals of the Dipper’s *Piao*. Dispatched are nine Left Generals of the Dipper’s *Piao*. Dispatched are nine Right Generals of the Dipper’s *Piao*. Dispatched are nine Great Generals of the Dipper’s *Ji*. Dispatched are nine Left Generals of the Dipper’s *Ji*. Dispatched are nine Right Generals of the Dipper’s *Ji*.\n\nDispatched to govern my left kidney and right kidney: the Dipper’s Net determines life, the Dipper’s Handle generates the liver, the Dipper’s □ generates the hun-soul, the Dipper’s □ generates form, the Dipper’s □ generates the lungs, the Dipper’s *Bi* generates the po-soul, the Dipper’s □ generates humanity, the Dipper’s *Piao* generates sinews, the Dipper’s *Ji* generates the spirit. They must not disobey. From the Three-Five Crimson Heaven, dispatched are nine Great Generals of the Dipper’s *Ji* to Assist the Body. Dispatched are nine Left Generals of the Dipper’s *Ji*. Dispatched are nine Right Generals of the Dipper’s *Ji*. Dispatched are nine Great Generals of the Dipper’s *Fa*. Dispatched are nine Left Generals of the Dipper’s *Fa*. Dispatched are nine Right Generals of the Dipper’s *Fa*. Dispatched are nine Great Generals of the Dipper’s *Sha*. Dispatched are nine Left Generals of the Dipper’s *Sha*. Dispatched are nine Right Generals of the Dipper’s *Sha*. Dispatched are nine Great Generals of the Dipper’s *Ji* to Pacify the Hun-Soul, nine Generals of the Dipper’s *Fa* to Calm the Po-Soul, and nine Generals of the Dipper’s *Sha* to Immortalize the Hun-Soul. From the Three-Five Crimson Heaven, dispatched are nine Great Generals of the Revolving Mechanism for Repelling Enemies. Dispatched are nine Left Generals for Repelling Enemies. Dispatched are nine Right Generals for Repelling Enemies.\n\nDispatched are nine Great Generals to Smash Enemies. Dispatched are nine Left Generals to Smash Enemies. Dispatched are nine Right Generals to Smash Enemies. Dispatched are nine Great Generals to Gather and Strike. Dispatched are nine Left Generals to Gather and Strike. Dispatched are nine Right Generals to Gather and Strike. Together they govern the臣’s repelling of enemies to pacify the spirit, smashing of enemies to calm the po-soul, and gathering of enemies to immortalize the po-soul—none may be replaced. From the Crimson Heaven’s Three-Five Central Yellow, dispatched are nine Great Generals of the Controller of Destiny. Dispatched are nine Left Generals of the Controller of Destiny. Dispatched are nine Right Generals of the Controller of Destiny. Dispatched are nine Great Generals to Fix Lifespan. Dispatched are nine Left Generals to Fix Lifespan. Dispatched are nine Right Generals to Fix Lifespan. Dispatched are nine Great Generals to Fix Immortality. Dispatched are nine Left Generals to Fix Immortality. Dispatched are nine Right Generals to Fix Immortality. Together they govern the臣’s Controller of Destiny to pacify the spirit and fix lifespan, to calm the spirit and fix immortality—none of the hundred spirits may disobey.\n\nFrom the Upper Immortal Capital of the Most High Divine Luminaries, the Upper Numinous Bureau, and the Central Palace: Executors of Inauspicious Affairs, Tiger-Rushing Valiant Warriors, Smashers of Enemies and Investigators of Treachery, Hook-Riding Archers, Slayers of Evil from the Three Bureaus—each twenty-four in number. Dispatched to guard the臣’s dwelling, to seize and suppress inauspicious rebels, to hunt down and capture treacherous evil, and to ensure their annihilation without omission.\n\nFrom the Upper Immortal Capital of the Most High Divine Luminaries and the Upper Numinous Bureau: the Central Palace’s Intercepting and Severing Bureau Archers, attendants and messengers for the north and south, who respond to summons instantly. From the Upper Immortal Capital of the Most High Divine Luminaries and the Upper Numinous Bureau: the Central Palace’s *Kui*-Riders who gather *qi* and consume *qi*, Dipper-Riders who gather spirits and consume spirits, Star-Riders who gather ghosts and consume ghosts, *Xuanji*-Riders who gather essences and consume essences, Jade Balance-Riders who gather evil and consume evil—each one hundred twenty [myriad] in number. Dispatched to gather and consume for the臣 all inauspicious *qi*, ghostly *qi*, essences, evil, and demonic afflictions under heaven.\n\nFrom the Upper Immortal Capital of the Most High Divine Luminaries and the Upper Numinous Bureau: the Central Palace’s Crimson Talisman Clerks riding the Three-Five Solar Chariots, and Ghost-Capturing Messengers riding the Lunar Chariots—each one hundred twenty myriad in number. Dispatched to exterminate for the臣 all inauspicious rebels, to hunt down and capture evil essences, to pursue and seize with crimson talismans, ensuring their complete annihilation.\n\nFrom the Upper Immortal Capital of the Most High Divine Luminaries and the Upper Numinous Bureau: the Central Palace’s Steeds of the Strong Wind, couriers of the memorials, clerks who remove death records and fix life records—each ten myriad in number. Dispatched to present memorials and petitions for the臣, swiftly submitting them to the throne to erase death records and inscribe life in the Jade Calendar.\n\nFrom the Upper Immortal Capital of the Most High Divine Luminaries and the Upper Numinous Bureau: the Central Palace’s clerks of the Central Yellow Nine Paths to fix resolve, clerks to fix courage, clerks to fix wisdom, and valiant warriors—each twelve myriad in number. Dispatched to open the臣’s heart-spirit to enlightenment and penetrate the subtle mysteries.\n\nFrom the Upper Immortal Capital of the Most High Divine Luminaries and the Upper Numinous Bureau: the Central Palace’s clerks of the Six Yin and Six Yang to complete the body—each twelve myriad in number. Dispatched to regulate the臣’s yin and yang, prolong life, preserve destiny, complete the body, unite with the Dao, commune with spirits, and connect with the perfected.\n\nFrom the Upper Immortal Capital of the Most High Divine Luminaries and the Upper Numinous Bureau: the Central Palace’s Eight Spirit Vajra Warriors, Eight Slayer Vajra Warriors, High Chariot Direct Attendants, Crimson Chariot Direct Talisman Messengers, Inspection Chariot Arresting Messengers, and Intercepting Warriors—each seven thousand two hundred in number. Dispatched to hunt down and strike for the臣 all inauspicious rebels, to slay and eradicate evil essences, to eliminate misfortune and avert calamity, and to expel demonic thieves.\n\nFrom the Heavenly Numinous Crimson Bureau: Direct Attendants, Merit Clerks, Spirit-Seizing Protectors, Prison-Seizing Clerks, Evil-Seizing Messengers, Spirit-Seizing Direct Talisman Slayers of Treacherous Evil—each two in number. Dispatched are one hundred twenty immortals, Daoist masters, and jade maidens each. Dispatched are the seven spirits to guard the body, with fourteen generals and clerks who must not leave the body, and two generals to cure illness and protect the body each. Dispatched are nine clerks of the Military Bureau each. Dispatched are two clerks of Bian Que and two clerks of the Heavenly Physicians each.\n\nTogether they enforce dignity and majesty to execute evil and eradicate falsehood, to repel death and summon life, to rescue and assist the臣’s body, ensuring that breath and response are harmonized. This臣, a humble sprout, has fortunately encountered this millennial opportunity. Prostrating, I have received the profound compassion of my revered master, who bestowed upon me the register of methods to defend and protect myself, granting me peace and security—an indebtedness beyond measure.\n\nThe generals, clerks, messengers, perfected officials, jade lads, jade maidens, clerks, soldiers, and troops under the twenty-four registers of the Upper Immortals and Upper Numinous Bureaus that I have received are hereby beseeched to act according to their respective duties, to bear commands and transmit the truth, to propagate the essentials of the Dao, and to encourage goodness. Should any subordinate clerks, inauspicious *qi*, rebellious evil, or treacherous demons—along with officials, slanderous individuals, or conspirators seeking to harm this臣—exist, the attending messengers shall immediately report to the Heavenly Bureau without concealment. From year’s end to year’s end, from month’s end to month’s end, from day’s end to day’s end, from hour’s end to hour’s end, cyclically without cease.\n\nLet it be executed according to the method to safeguard this臣’s life, to avert calamity and transcend peril, to attain longevity and enduring vision, to stabilize the heart-spirit, and to align all endeavors with the perfected. In all travels and undertakings, may metal and stone open, water and fire aid, the August Heaven cover, the August Earth bear, the sun and moon illuminate, mountains and rivers connect. May all evil be subdued, and the myriad spirits obey. May this臣’s hundred passages flow with moisture, the five viscera generate fluids, true *qi* descend into the body, and the form be refined to transform its substance. When merit is accomplished and virtue perfected, may I ascend to heaven in broad daylight. At that time, I shall report my merits without failing in my demonstrated sincerity.\n\nThis臣, a late and shallow learner, foolish and dim, having reviewed the generals, clerks, soldiers, and troops, fears they may not conform to the proper forms or align in sequence, accumulating a thousand faults and ten thousand errors. I beseech your forgiveness, extending mercy even to the unenlightened, sparing me from punishment and penalty. With utmost reverence and trepidation, I bow my head and prostrate twice.\n\nNext, swallow the *qi* three times and rise, kneeling lengthily to pray:\nThis臣 has completed the review of the register. All the aforementioned Upper Immortal Numinous Bureau merit clerks, messengers, generals, clerks, and soldiers shall return into this臣’s body, entering through the Gate of Myriad Subtleties. According to their respective positions, those on the left return to the left, those on the right return to the right, resting securely in the golden hall and jade chamber. Let the Direct Attendant Merit Clerks inspect and supervise, ensuring no errors in their protective encirclement. Let them surround and envelop, externally and internally, without transgressing the bounds of heaven and earth.\n\nNext, recite the incense burner incantation. Then chant the *Receiving and Sending Hymn*, saying:\n\nThis method is most profound and wondrous,\nFreeing your nine generations from servitude.\nIf unworthy ones receive it,\nThey sever themselves from the Dao.\nThose not fit who rashly transmit it\nShall face interrogation in this life,\nAnd upon death, fall into the Three Wretched Realms’ prisons,\nWith ten thousand kalpas of remorse to no avail.\n\nAfter the *Exiting the Chamber Incantation*, declare:\nUpon the completion of the register’s review, may this servant’s Three Masters attain the Dao, may the nine generations ascend to heaven, may the living reap blessings, may kindness and joy fill every countenance, may fathers be compassionate and children filial, and may all who study the Dao achieve immortality.\n\nThus concludes the *Rite of Register Review for the Alliance of Orthodox Unity under the Three and Five August Ones*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞神部威仪类 太上三五正一盟威阅箓醮仪 经名：太上三五正一盟威阅箓醮仪。 唐末杜光庭删定，系早期天师道阅箓仪改编本。 一卷。 底本出处：《正统道藏》洞神部威仪类。 太上三五正一盟威阅箓醮仪 广成先生杜光庭删定 凡阅箓，常以甲子、庚申、本命、三会、三元、晦朔等日，卯酉二时。 次发炉 太上玄元五灵老君，当召功曹使者，左右龙虎君，捧香使者，三炁正神，急上关启三天太上玄元正一道君，臣今正尔入靖烧香，以今某月某日吉辰，於某州县乡里谨依先师之法，简阅身中所佩正一盟威上仙上灵二十四阶宝箓中将军吏兵，以自防护，愿得八方正真生炁降入臣等身中，令臣自启速达，径御 太上至真无极大道玉皇上帝御前。 系天师某治炁赤天三五步纲元命真人，臣某稽首再拜，上启 太清玄元无上三天无极大道太上老君，太上丈人天帝君，天帝丈人九老仙都君，九炁丈人百千万重道炁千二百官君太清玉陛下，小臣愚短，千载幸会，得染清化，乃蒙覆盖，赐受吏兵，以自保护，常依科法，每以吉日简阅，臣所佩正一上仙上灵将军等箓，箓上功曹使者将军吏兵各有主职，保护臣某身形安神养性，长调宫府，三尸堕落，众灾消灭，内除疾病，外却衰形，臣当以时言功举迁，不敢违负谨启。 次鸣法鼓二十四通 东向平坐闭目存左青龙，右白虎，前朱雀，后玄武，麒麟凤凰翔踞四隅，日月五星二十八宿北斗七星临照形神。 次出官",
      "translated_text": "**Ritual Protocols of the Dongshen Section: The Supreme Alliance of the Three-Five Orthodox Unity Register-Inspection and Offering Rites**\n\n**Text Title:** *The Supreme Alliance of the Three-Five Orthodox Unity Register-Inspection and Offering Rites*\n*Compiled and edited by Master Guangcheng, Du Guangting, in the late Tang dynasty. A revised version of an early Celestial Master register-inspection ritual. One fascicle.*\n\n**Source:** *Daoist Canon of the Zhengtong Era*, Dongshen Section, Ritual Protocols.\n\n---\n\n**The Supreme Alliance of the Three-Five Orthodox Unity Register-Inspection and Offering Rites**\n*Compiled and edited by Master Guangcheng, Du Guangting*\n\nFor all register inspections, the rites are customarily performed on *jiazi*, *gengshen*, one’s own life-day, the Three Assemblies, the Three Primes, or the last and first days of the lunar month, during the *mao* and *you* hours.\n\n**Next: Kindling the Incense Burner**\nThe Supreme Mysterious Origin, the Five Numinous Venerable Lord, shall summon the Merit Officers and Envoys, the Left and Right Dragon-Tiger Lords, the Incense-Bearing Envoys, and the Three *Qi* Orthodox Deities. Hasten to report to the Three Heavens’ Supreme Mysterious Origin, the Orthodox Unity Dao Lord: \"Your servant now enters the oratory to burn incense. On this auspicious day of the [such-and-such] month, in the [such-and-such] prefecture, county, village, and hamlet, I reverently follow the methods of the Former Masters to inspect the Orthodox Unity Alliance Register of the Upper Immortals and Upper Numinous Twenty-Four Grades, along with the generals, officers, and soldiers bestowed upon my person for self-protection. May the upright and true *qi* of the Eight Directions descend into my body, that I may swiftly ascend to present myself before the August Jade Emperor of the Supreme Perfection of the Limitless Dao.\"\n\nThe Celestial Master of [such-and-such] Oratory, the True Person of the Three-Five Step Net of Primordial Destiny of the Red Heaven, bows twice and respectfully addresses the Supreme Venerable Lord of the Great Dao of the Limitless Three Heavens of the Great Clarity, the Heavenly Emperor Lord of the Supreme Elder, the Nine Elders of the Immortal Capital, the Hundred-Thousandfold *Qi* of the Elder of the Nine *Qi*, the Thousand-Two Hundred Official Lords of the Great Clarity before the Jade Throne of the Great Clarity: \"Your humble servant, dull and unworthy, has been blessed across a thousand kalpas to partake in this pure transformation. By your sheltering grace, I have been granted officers and soldiers for my protection. Ever adhering to the ritual statutes, I inspect on auspicious days the Orthodox Unity Register of the Upper Immortals and Upper Numinous Generals bestowed upon me. The Merit Officers, Envoys, Generals, and Soldiers recorded in the register each hold their appointed duties, safeguarding my body, pacifying my spirit, and nurturing my nature. May the Three Corpses be cast down, all calamities dissolved, illnesses expelled within, and decrepitude repelled without. In due time, I shall report my merits and seek promotion, never daring to betray this trust. I humbly present this petition.\"\n\n**Next: Striking the Ritual Drum Twenty-Four Times**\nFace east, sit upright, close the eyes, and visualize: to the left, the Azure Dragon; to the right, the White Tiger; before, the Vermilion Bird; behind, the Dark Warrior. The *qilin* and phoenix soar and perch at the four corners. The sun, moon, Five Planets, Twenty-Eight Constellations, and the Seven Stars of the Northern Dipper illuminate body and spirit.\n\n**Next: Exiting the Oratory**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 585,
      "start_sentence": 0,
      "end_sentence": 16,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.896148920059204,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上三五正一盟威阅箓醮仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "谨出臣某身中上仙上灵百五十将军，直使功曹，正一功曹，治病功曹各十五人出，主为臣某执使者，主将送东西南北正定诸炁，消除疾病，上仙上灵左右官使者，主将送东西南北，辟斥三灾九厄五刑六害之考，都主吏兵，主左右无令前却错互，上仙上灵阴阳神决吏各十五人，出为臣和合阴阳，决定生籍安神养性，使合真仙上仙上灵阴阳治病，功曹治病太医吏各十五人，出主为臣某调理阴阳察候五藏神仙妙药，却病销灾，上仙上灵二官百五十将军，主领官将吏兵士卒围绕臣某身周雨三重，无令空缺，上仙上灵郎吏虎贲察奸钩骑三官仆射吏各千二百人，出主为臣某屯守所居宅舍房院营卫左右，随逐东西南北常去臣百步兵刃，外向讨捕凶逆，执捉奸邪，并令绝灭，不得纵逸，皆共保护臣某等身，上仙上灵天绉甲卒各千二百人，出天丁力士各百二十人出，主为臣某随逐东西南北所有呼名应口而集，上仙上灵收炁食炁吏，收神食神吏，收鬼食鬼吏，收邪食邪吏，收毒食毒吏各六十人出，主为臣某收食天下毒疫鬼炁妖精邪神伤寒疟痢毒注温邪虫兽，强（歹＋羊）一切皆收而食之，悉令荡散，上仙上灵科车赤符吏，刚风骑置驿马上章吏各十人，出主为臣某收捕凶邪鬼贼不正之气，呈章奏表，速令上达。 次出奏法箓吏兵 谨出太上正一一将军箓，箓中功曹将军使者吏兵玉女等，为臣助国行化，翦灭凶恶，至道长兴，谨出太上正一十将军箓，箓中将军符吏功曹等，为臣斩恶赏善，万愿随心。 谨出太上正一百五十将军线，箓中灵官功曹将军骑吏使者甲卒等，为臣辟斥四方不正人鬼，祸害永消。 谨出太上正一三将军箓，箓中将军功曹童子玉女等，为臣修生养炁，延长寿禄，所向随心。 谨出太上正一召百鬼箓，箓中功曹护身将军玉童玉女等，为臣收斩天下身中魍魉，无害於人。 谨出太上正一元命赤箓，箓中三天解秽玉童玉女五方龙王吏兵等，为臣消灭血食浮游侵人之鬼，一切荡除。 谨出太上正一上仙召鬼箓，箓中诸部真人真神功曹六甲神将六丁玉女等，为臣杀灭身上三灾九厄，一切无他。 谨出太上正一九州社令箓，箓中诸部大将军功曹玉童玉女直符使者等，为臣行纲布炁，制伏群精。 谨出太上正一星纲五斗箓，箓中太玄禁师，胡玄禁师，西玄禁师，壶公禁师将军吏兵等，为臣禁截不道害人凶逆邪祟。 谨出太上正一河图保命箓，箓中真人功曹将军玉童玉女等，为臣保守身命，应臣所请，悉令效验。 谨出太上正一六害箓，箓中太一君，皇天上帝君，太上元君，六害神消刑灭害功曹将军等，为臣驱逐妖殃千精万鬼，并令摄伏。 谨出太上正一九凤破秽箓，箓中天灵赤官斩邪功曹，诛摄斩伐击截翦灭禽奇将军使者玉童玉女等，为臣涤荡不系籍之邪神，当令神应。 谨出太上正一都章毕印箓，箓中天灵官功曹将军仙人道士玉女使者等，为臣斩灭千邪万妖不侵生人。 谨出太上正一华盖大箓，箓中诸部功曹将军玉童玉女使者，为臣诛斩恶逆，消奸灭伪。 谨出太上正一九天兵符箓，箓中功曹将军吏兵甲卒等，为臣守固所居，呼召立到。 谨出太上正一九宫捍厄箓，箓中功曹仙灵官将军使者天绉甲卒等，为臣助国救民，应於心口。",
      "translated_text": "I reverently dispatch the One Hundred Fifty Generals of Upper Transcendents and Upper Numinous Beings from within my body, along with fifteen Direct Envoys, fifteen Orthodox Unity Attendants, and fifteen Healing Attendants, all to serve as my executive envoys. The Commanding Generals shall escort the proper *qi* of east, west, south, and north, dispelling illnesses. The Upper Transcendents, Upper Numinous Beings, and their left and right official envoys, along with the Commanding Generals, shall escort the four directions, repelling and expelling the Three Calamities, Nine Adversities, Five Punishments, and Six Harms. The chief officers and soldiers shall maintain order on left and right, preventing any misstep or error. Fifteen Upper Transcendents, Upper Numinous Beings, and yin-yang divine adjudicators shall emerge to harmonize my yin and yang, determine my register of life, pacify my spirit, and nurture my nature, aligning me with the Perfected Transcendents. Fifteen Healing Attendants and fifteen Grand Physician Officers shall emerge to regulate my yin and yang, examine the signs of my five viscera, and administer divine medicines to repel illness and dissolve calamities.\n\nThe Two Bureaus of Upper Transcendents and Upper Numinous Beings, along with their One Hundred Fifty Generals, shall lead their officers, generals, and soldiers to encircle my body in threefold ranks, leaving no gaps. One thousand two hundred Upper Transcendents, Upper Numinous Beings, Gentleman-Officers, Tiger Warriors, Inspectors of Treachery, Hook Cavalry, Three Bureau Commanders, and Archery Officers shall emerge to garrison and guard my dwelling, chambers, and courtyards, patrolling left and right, ever following a hundred paces from me in all directions. Their blades shall face outward to hunt down and capture the rebellious and perverse, seizing and annihilating all treacherous and iniquitous forces, permitting no escape, all to safeguard my body.\n\nOne thousand two hundred Upper Transcendents and Upper Numinous Beings, along with Celestial Armored Soldiers, and one hundred twenty Celestial Ding Warriors shall emerge to follow me in all directions, responding to my call and assembling at my command. Sixty *Qi*-Gathering and *Qi*-Consuming Officers, Spirit-Gathering and Spirit-Consuming Officers, Ghost-Gathering and Ghost-Consuming Officers, Malevolence-Gathering and Malevolence-Consuming Officers, and Poison-Gathering and Poison-Consuming Officers shall emerge to gather and consume all noxious epidemics, demonic *qi*, specters, malevolent spirits, cold damage, malarial fevers, dysentery, poisonous influxes, warm afflictions, and venomous creatures—all shall be gathered and devoured, utterly dispersed.\n\nTen Upper Transcendents, Upper Numinous Beings, Red Talisman Chariot Officers, Gale-Riding Couriers, and Memorial-Submitting Officers shall emerge to capture and seize iniquitous spirits, thieving demons, and improper *qi*, presenting memorials and petitions to ensure swift transmission.\n\n**Next: Dispatching the Petition-Offering Officers and Soldiers**\n\nI reverently dispatch the Register of the Orthodox Unity Supreme General, along with its Attendants, Generals, Envoys, Officers, Soldiers, and Jade Maidens, to assist me in aiding the state, propagating transformation, and eradicating malevolence, that the Supreme Dao may flourish.\n\nI reverently dispatch the Register of the Ten Orthodox Unity Generals, along with its Generals, Talisman Officers, Attendants, and others, to sever evil and reward goodness, fulfilling all my aspirations.\n\nI reverently dispatch the Register of the One Hundred Fifty Orthodox Unity Generals, along with its Numinous Officials, Attendants, Generals, Cavalry, Envoys, Officers, and Soldiers, to repel and expel improper human spirits and ghosts from the four directions, forever dissolving misfortune.\n\nI reverently dispatch the Register of the Three Orthodox Unity Generals, along with its Generals, Attendants, Divine Lads, and Jade Maidens, to cultivate life, nourish *qi*, and extend my years and blessings, fulfilling my will in all endeavors.\n\nI reverently dispatch the Register for Summoning the Hundred Ghosts of Orthodox Unity, along with its Attendants, Guardian Generals, Jade Lads, and Jade Maidens, to gather and sever all *wangliang* spirits within my body, sparing no harm to humanity.\n\nI reverently dispatch the Orthodox Unity Register of Primordial Destiny and Red Talismans, along with its Three Heavens’ Defilement-Dissolving Jade Lads and Jade Maidens, Five Directions’ Dragon Kings, Officers, and Soldiers, to eliminate all blood-consuming and wandering spirits that assail humanity, utterly eradicating them.\n\nI reverently dispatch the Orthodox Unity Register for Summoning Ghosts of Upper Transcendents, along with its various Perfected Ones, Divine Beings, Attendants, Six Jia Generals, Six Ding Jade Maidens, and others, to annihilate the Three Calamities and Nine Adversities upon my body, leaving no other afflictions.\n\nI reverently dispatch the Orthodox Unity Register of the Nine Provinces’ Community Decrees, along with its various Great Generals, Attendants, Jade Lads, Jade Maidens, and Direct Envoys, to propagate the Dao’s principles and *qi*, subduing all spirits.\n\nI reverently dispatch the Orthodox Unity Register of the Starry Net and Five Dipper, along with its Supreme Mystery Prohibitors, Hu Mystery Prohibitors, Western Mystery Prohibitors, Master Hu’s Prohibitors, Generals, Officers, and Soldiers, to prohibit and intercept all unrighteous, harmful, rebellious, and malevolent specters.\n\nI reverently dispatch the Orthodox Unity Register of the *River Chart* for Preserving Life, along with its Perfected Ones, Attendants, Generals, Jade Lads, and Jade Maidens, to safeguard my life, fulfilling all my requests with efficacy.\n\nI reverently dispatch the Orthodox Unity Register of the Six Harms, along with its Supreme Unity Lord, August Heavenly Thearch Lord, Supreme Primordial Lord, Six Harm Spirits, Punishment-Dissolving and Harm-Eradicating Attendants, Generals, and others, to drive away misfortune, a thousand spirits, and ten thousand ghosts, all to be captured and subdued.\n\nI reverently dispatch the Orthodox Unity Register of the Nine Phoenixes for Defilement-Breaking, along with its Celestial Numinous Red Officials, Demon-Severing Attendants, Execution, Capture, Severance, Interception, and Eradication Generals, Envoys, Jade Lads, and Jade Maidens, to cleanse and purge all unregistered malevolent spirits, ensuring divine responsiveness.\n\nI reverently dispatch the Orthodox Unity Register of the Capital Memorial and Completed Seal, along with its Celestial Numinous Officials, Attendants, Generals, Transcendents, Daoists, Jade Maidens, and Envoys, to sever and annihilate a thousand malevolences and ten thousand specters, preventing their encroachment upon the living.\n\nI reverently dispatch the Orthodox Unity Register of the Great Canopy, along with its various Attendants, Generals, Jade Lads, Jade Maidens, and Envoys, to execute and annihilate the rebellious, dissolving treachery and eradicating deceit.\n\nI reverently dispatch the Orthodox Unity Register of the Nine Heavens’ Military Talismans, along with its Attendants, Generals, Officers, and Soldiers, to secure my dwelling and respond instantly to my summons.\n\nI reverently dispatch the Orthodox Unity Register of the Nine Palaces for Warding Off Adversity, along with its Attendants, Transcendent Numinous Officials, Generals, Envoys, and Celestial Armored Soldiers, to aid the state and succor the people, fulfilling the desires of my heart and words.",
      "overlap_context": " to betray this trust. I humbly present this petition.\"\n\n**Next: Striking the Ritual Drum Twenty-Four Times**\nFace east, sit upright, close the eyes, and visualize: to the left, the Azure Dragon; to the right, the White Tiger; before, the Vermilion Bird; behind, the Dark Warrior. The *qilin* and phoenix soar and perch at the four corners. The sun, moon, Five Planets, Twenty-Eight Constellations, and the Seven Stars of the Northern Dipper illuminate body and spirit.\n\n**Next: Exiting the Oratory**",
      "start_char": 585,
      "end_char": 1794,
      "start_sentence": 17,
      "end_sentence": 33,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.73114061355591,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上三五正一盟威阅箓醮仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "谨出太上正一八卦护身箓，箓中五方召鬼将军，五帝将军，左右仆射吏兵等，为臣尺置一兵，里置一营，按剑持戟，斩绝精灵。 谨出太上正一三五考召箓，箓中三元将军，五斗功曹，五星功曹诸童子使者等，为臣招星落斗，缠络身形邪神恶人，并令摄伏。 谨出太上正一龙虎斩邪箓，箓中功曹将军使者玉童玉女等，为臣抵杆精邪，存念密应。 谨出太上正一辟邪神箓，箓中玄老将军，五镇将军，五盖将军，太上将军功曹使者等，为臣镇压天神地只魍魉精魅，永不害人。 谨出太上正一四部禁炁箓，箓中赤官诸部功曹，将军吏兵，玉童玉女等，为臣跳星蹑斗，步纪存神，应於本心，勿生疾病。 谨出太上正一大斩河邪箓，箓中五领将军，胡越氏羌伧等，老君虎贲，施天发地，摇天动地将军，五色华盖兵马无上玄老将军吏兵使者，玉童玉女等，为臣飞戈轮刀，搜索精邪，营卫居止，皆令安隐。 谨出 太上正一三五功曹箓，箓中蔽身隐影藏已兵马等，为臣内守三宫，外治三界，天神地只，坏道邪魔，悉乞荡除，存思密应。 谨出太上正一保命长生箓，箓中魁纲左右诸部功曹将军吏兵使者等，为臣内治五藏，不使邪炁注入，心肝脾肾肺，敕三尸殄灭，百关调畅，白日冲天，仰荷玄泽。 次出诸部将军兵马 谨出太上正一诸部玄老五侯大将军五十万人，出无上玄老留大将军，周天大将军，盖天大将军，建天大将军，中越大将军，中武大将军，中御大将军，中亭大将军各十万人，出太上五盖大将军，天营大将军，九种大将军，冲天大将军，九关大将军，北阙大将军，九珠大将军，九道大将军，正天大将军，平天大将军，越门大将军，中央高皇领大将军，东方青领大将军，南方赤领大将军，西方白领大将军，北方黑领大将军，中央黄领大将军，各十万人。 出各领所部，并依本位营卫臣前后左右，除凶灭恶，无上五种兵马五十万人。 出中宫五营校尉兵十万人，出城门校尉兵士四十万人，出中央大兵四十万人，出九正丈人中央大兵百万人，出太上城门兵，天丁兵，前帝东营大兵，督天大兵，发地大兵，北方五秦兵各四十万人。 出太上青盖赤盖白盖黑盖黄盖大兵各四十万人。 出左右将军兵各十二人。 出左右横行兵六十〔万〕人。 出东方胡老君反甲逆鳞兵九十万人。 出南方越老君火营骑吏火烛兵八十万人。 出西方氏老君炼杖金精兵六十万人。 出北方羌老君乌丸扁鹊兵五十万人。 出中央伧老君二十五万官君兵五十万人。 出东方青始甲乙君，南方赤始丙丁君，西方白始庚辛君，北方黑始壬癸君，中央黄始戊己君，天柱司命君等，车骑兵各千二百人。 出高天万丈大鬼百鬼中王各万二千人，吏兵六十万人。 出高功司马中骑大将军郎吏虎贲察奸钩骑三官仆射各千二百人。 出天驺甲卒天丁力士收炁食炁吏，收神食神吏，收鬼食鬼吏，收邪食邪吏，收精食精吏，收毒食毒吏，诛符破庙吏各万二千人。 出主为臣某并在案前所部，备执天威，严加器仗，诛讨凶逆，翦灭精邪，防护臣身，呼召相应。 谨出臣所佩上三天三五功曹中部元命混沌真人赤箓，直使功曹正一功曹各十五人，出主为臣执使东西南北布定正炁，救疗诸病，益寿延年左右官使者各十五人。",
      "translated_text": "I reverently dispatch the Orthodox Unity Register of the Eight Trigrams for Body Protection, along with its Five Directions’ Generals for Summoning Ghosts, Five Thearch Generals, Left and Right Commandants, Officers, and Soldiers, to station one soldier every *chi* and one encampment every *li*, wielding swords and halberds to sever and extinguish spectral spirits.\n\nI reverently dispatch the Orthodox Unity Register of the Three-Five Summoning and Examination, along with its Generals of the Three Origins, Attendants of the Five Dipper, Attendants of the Five Stars, and various Divine Lads and Envoys, to summon stars and cause constellations to descend, entangling and binding the forms of malevolent spirits and wicked persons, compelling them to submission.\n\nI reverently dispatch the Orthodox Unity Register of the Dragon-Tiger for Slaying Malevolence, along with its Attendants, Generals, Envoys, Jade Lads, and Jade Maidens, to resist and repel spectral malevolence, with concentrated thought and secret response.\n\nI reverently dispatch the Orthodox Unity Register of the Divine Talismans for Warding Off Malevolence, along with its Mysterious Elder General, Five Garrison Generals, Five Canopy Generals, Supreme Generals, Attendants, and Envoys, to suppress and subdue celestial spirits, earthly *zhi*, *wangliang*, and spectral demons, ensuring they never harm humanity.\n\nI reverently dispatch the Orthodox Unity Register of the Four Divisions for Qi Prohibition, along with its Crimson Officials, various Attendants, Generals, Officers, Soldiers, Jade Lads, and Jade Maidens, to leap through stars and tread upon constellations, pacing the steps and invoking spirits, responding to my innermost heart, preventing the onset of illness.\n\nI reverently dispatch the Orthodox Unity Supreme Register for Greatly Slaying River Malevolence, along with its Five Commanding Generals, Hu, Yue, Qiang, and Cang forces, the Valiant Tiger Warriors of Lord Lao, those who shake heaven and move earth, Generals of the Five-Colored Canopy and the Supreme Mysterious Elder, along with their Officers, Soldiers, Envoys, Jade Lads, and Jade Maidens, to brandish flying halberds and wheeling blades, searching out and eradicating spectral malevolence, securing and safeguarding my dwelling, ensuring all is peaceful and untroubled.\n\nI reverently dispatch the Orthodox Unity Register of the Three-Five Attendants, along with its troops for concealing the body, hiding the shadow, and concealing the self, to internally guard the Three Palaces, externally govern the Three Realms, and eradicate celestial spirits, earthly *zhi*, corrupt Daoists, and demonic forces, beseeching their complete dissolution, with concentrated thought and secret response.\n\nI reverently dispatch the Orthodox Unity Register for Preserving Life and Prolonging Longevity, along with its various Attendants, Generals, Officers, Soldiers, and Envoys of the Left and Right Stellar Nets, to internally govern the Five Viscera, preventing the intrusion of malevolent *qi*, ensuring the heart, liver, spleen, kidneys, and lungs remain unharmed, commanding the Three Corpses to be annihilated, the hundred passages to flow smoothly, and ascending to heaven in broad daylight, bearing the profound grace of the Dao.\n\nNext, dispatching the various divisions of Generals and troops:\n\nI reverently dispatch the Orthodox Unity’s various divisions of the Supreme Mysterious Elder and Five Marquises, comprising five hundred thousand troops; the Supreme Mysterious Elder Liu General, the Peripatetic Heaven General, the Canopy Heaven General, the Establishing Heaven General, the Central Yue General, the Central Martial General, the Central Charioteer General, and the Central Pavilion General, each with one hundred thousand troops; the Supreme Five Canopy Generals, the Heavenly Encampment General, the Nine Kinds General, the Soaring Heaven General, the Nine Passes General, the Northern Watchtower General, the Nine Pearls General, the Nine Paths General, the Upright Heaven General, the Level Heaven General, the Yue Gate General, the Central High August Commanding General, the Eastern Azure Commanding General, the Southern Vermilion Commanding General, the Western White Commanding General, the Northern Black Commanding General, and the Central Yellow Commanding General, each with one hundred thousand troops.\n\nEach division, leading their respective troops, encamps before, behind, to the left, and right of me, eliminating misfortune and eradicating evil. The Supreme Five Kinds of Troops number five hundred thousand.\n\nDispatching the Central Palace’s Five Encampment Commanders with one hundred thousand troops; the City Gate Commanders with four hundred thousand soldiers; the Central Great Army with four hundred thousand troops; the Central Great Army of the Nine Upright Elders with one million troops; the Supreme City Gate Troops, Heavenly *Ding* Soldiers, the Eastern Encampment Great Army of the Former Thearch, the Supervising Heaven Great Army, the Earth-Shaking Great Army, and the Northern Five Qin Armies, each with four hundred thousand troops.\n\nDispatching the Supreme Azure Canopy, Vermilion Canopy, White Canopy, Black Canopy, and Yellow Canopy Great Armies, each with four hundred thousand troops.\n\nDispatching the Left and Right Generals, each with twelve troops.\n\nDispatching the Left and Right Transverse Marching Troops, numbering six hundred thousand.\n\nDispatching the Eastern Hu Elder Lord’s Reverse-Armor, Reverse-Scale Troops, nine hundred thousand strong.\n\nDispatching the Southern Yue Elder Lord’s Fire Encampment Cavalry, Fire Candle Officers, and troops, eight hundred thousand strong.\n\nDispatching the Western Di Elder Lord’s Refined Staff, Metal Essence Troops, six hundred thousand strong.\n\nDispatching the Northern Qiang Elder Lord’s Wuwan and Bian Que Troops, five hundred thousand strong.\n\nDispatching the Central Cang Elder Lord’s Twenty-Five Myriad Official Lords and troops, five hundred thousand strong.\n\nDispatching the Eastern Azure Origin *Jia-Yi* Lords, Southern Vermilion Origin *Bing-Ding* Lords, Western White Origin *Geng-Xin* Lords, Northern Black Origin *Ren-Gui* Lords, Central Yellow Origin *Wu-Ji* Lords, and the Heavenly Pillar Life-Directing Lords, each with one thousand two hundred chariots and cavalry.\n\nDispatching the High Heaven’s Ten-Thousand-*Zhang* Great Ghosts, the Hundred Ghosts’ Central Kings, each numbering twelve thousand, with six hundred thousand officers and soldiers.\n\nDispatching the High Merit Marshal, Central Cavalry General, Gentleman-Officers, Valiant Tiger Warriors, Inspectors of Treachery, Hook Cavalry, and Three Officials’ Commandants, each with one thousand two hundred troops.\n\nDispatching the Heavenly Couriers, Armored Soldiers, Heavenly *Ding* Valiants, *Qi*-Absorbing and *Qi*-Consuming Officers, Spirit-Absorbing and Spirit-Consuming Officers, Ghost-Absorbing and Ghost-Consuming Officers, Malevolence-Absorbing and Malevolence-Consuming Officers, Essence-Absorbing and Essence-Consuming Officers, Toxin-Absorbing and Toxin-Consuming Officers, and Talisman-Slaying and Shrine-Destroying Officers, each numbering twelve thousand.\n\nAll are dispatched to serve me, [Name], and stand ready before the altar, wielding the authority of heaven, sternly bearing arms, punishing rebellion, eradicating spectral malevolence, and protecting my person, responding instantly to my summons.\n\nI reverently dispatch the Crimson Register of the Primordial Chaos Perfected One of the Original Destiny of the Central Division, from the Upper Three Heavens’ Three-Five Attendants, along with the Direct Envoys, Orthodox Unity Attendants, and fifteen each of the Attendants for the East, West, South, and North, to establish and distribute the upright *qi*, cure all illnesses, and prolong life, with fifteen Envoys for each of the directional offices.",
      "overlap_context": "verently dispatch the Orthodox Unity Register of the Nine Heavens’ Military Talismans, along with its Attendants, Generals, Officers, and Soldiers, to secure my dwelling and respond instantly to my summons.\n\nI reverently dispatch the Orthodox Unity Register of the Nine Palaces for Warding Off Adversity, along with its Attendants, Transcendent Numinous Officials, Generals, Envoys, and Celestial Armored Soldiers, to aid the state and succor the people, fulfilling the desires of my heart and words.",
      "start_char": 1794,
      "end_char": 3011,
      "start_sentence": 34,
      "end_sentence": 60,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.25155329704285,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上三五正一盟威阅箓醮仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "出为臣某通达幽冥，共相整理，无令前却阴阳神决吏各十五人。 出主为臣某调和阴阳，决定生籍生炁阴阳二官治病太医吏，各十五人。 出主为臣某和合针药，疗诸疾病，收伪却邪功曹使者，各十五人。 出主为臣某收邪却伪灭恶诛凶司命吏十五人。 出为臣某增寿益算司禄吏十五人。 出主为臣某加爵厚禄司危吏十五人。 出主为臣某治化无乱司罚吏十五人。 出主为臣某斩妖灭魔司直史十五人。 出主为臣某却枉翦滥司奸吏十五人。 出主为臣某执制邪淫司察吏十五人。 出主为臣某请是护非都司吏十五人。 出主为臣某伏逆理顺上三天文昌中宫中黄九道司命君十五人。 出主为臣某除死籍，正生名，固守丹田，消灾辟病，赤天三五混沌，生身蔽神斗纲大将军九人。 出斗纲左将军九人。 出斗纲右将军九人。 出斗魁大将军九人。 出斗魁左将军九人。 出斗魁右将军九人。 出斗□大将军九人。 出斗□左将军九人。 出斗□右将军九人。 出斗□大将军九人。 出斗□左将军九人。 出斗□右将军九人。 出斗□大将军九人。 出斗□左将军九人。 出斗□右将军九人。 出斗魓大将军九人。 出斗魓左将军九人。 出斗魓右将军九人。 出斗□大将军九人。 出斗□左将军九人。 出斗□右将军九人。 出斗魒大将军九人。 出斗魒左将军九人。 出斗魒右将军九人。 出斗击大将军九人。 出斗击左将军九人。 出斗击右将军九人。 出并治臣左肾右肾，斗纲定生，斗魁生肝，斗□生魂，斗□生形，斗□生肺，斗魓生魄，斗□生人，斗魒生筋，斗击生神，不得有违，赤天三五，辅体斗击大将军九人。 出斗击左将军九人。 出斗击右将军九人。 出斗伐大将军九人。 出斗伐左将军九人。 出斗伐右将军九人。 出斗杀大将军九人。 出斗杀左将军九人。 出斗杀右将军九人。 出斗击安魂，斗伐静魄，斗杀仙魂，赤天三五璇玑却敌大将军九人。 出却敌左将军九人。 出却敌右将军九人。",
      "translated_text": "Dispatched to serve me, [Name], are fifteen Officers for Communicating with the Netherworld and Coordinating Affairs, ensuring no retreat in the divine decrees of yin and yang. Dispatched to serve me are fifteen Officers of the Yin-Yang Bureau for Harmonizing Yin and Yang, Determining the Registers of Life, and Generating *qi*, along with fifteen Grand Physicians of the Yin-Yang Offices for Healing Illnesses. Dispatched to serve me are fifteen Envoys for Harmonizing Acupuncture and Medicines, Curing All Illnesses, and Eliminating Falsehoods and Expelling Malevolence. Dispatched to serve me are fifteen Officers of the Controller of Destiny for Eliminating Malevolence, Dispelling Falsehoods, Eradicating Evil, and Punishing the Wicked. Dispatched to serve me are fifteen Officers of the Controller of Emoluments for Augmenting Longevity and Increasing Life Span. Dispatched to serve me are fifteen Officers of the Controller of Perils for Conferring Rank and Enriching Emoluments. Dispatched to serve me are fifteen Officers of the Controller of Punishments for Governing and Transforming without Disorder. Dispatched to serve me are fifteen Scribes of the Controller of Rectitude for Beheading Demons and Eradicating Māras. Dispatched to serve me are fifteen Officers of the Controller of Villainy for Eliminating Wrongful Accusations and Severing Excesses. Dispatched to serve me are fifteen Officers of the Controller of Surveillance for Restraining Deviant Licentiousness. Dispatched to serve me are fifteen Chief Officers of the General Bureau for Affirming the Right and Protecting the Just.\n\nDispatched to serve me are fifteen Lords of Destiny of the Ninefold Yellow Path of the Central Palace of the Upper Three Heavens’ Literary Brilliance for Subduing Rebellion and Restoring Order. Dispatched to serve me are nine Great Generals of the Dipper’s Net for Erasing Death from the Registers, Rectifying Life’s Name, Securing the Cinnabar Field, Dispelling Disasters, and Averting Illnesses, from the Three-Five Crimson Heaven of Primordial Chaos, who give birth to the body and shield the spirit. Dispatched are nine Left Generals of the Dipper’s Net. Dispatched are nine Right Generals of the Dipper’s Net. Dispatched are nine Great Generals of the Dipper’s Handle. Dispatched are nine Left Generals of the Dipper’s Handle. Dispatched are nine Right Generals of the Dipper’s Handle. Dispatched are nine Great Generals of the Dipper’s □. Dispatched are nine Left Generals of the Dipper’s □. Dispatched are nine Right Generals of the Dipper’s □. Dispatched are nine Great Generals of the Dipper’s □. Dispatched are nine Left Generals of the Dipper’s □. Dispatched are nine Right Generals of the Dipper’s □. Dispatched are nine Great Generals of the Dipper’s □. Dispatched are nine Left Generals of the Dipper’s □. Dispatched are nine Right Generals of the Dipper’s □. Dispatched are nine Great Generals of the Dipper’s *Bi*. Dispatched are nine Left Generals of the Dipper’s *Bi*. Dispatched are nine Right Generals of the Dipper’s *Bi*. Dispatched are nine Great Generals of the Dipper’s □. Dispatched are nine Left Generals of the Dipper’s □. Dispatched are nine Right Generals of the Dipper’s □. Dispatched are nine Great Generals of the Dipper’s *Piao*. Dispatched are nine Left Generals of the Dipper’s *Piao*. Dispatched are nine Right Generals of the Dipper’s *Piao*. Dispatched are nine Great Generals of the Dipper’s *Ji*. Dispatched are nine Left Generals of the Dipper’s *Ji*. Dispatched are nine Right Generals of the Dipper’s *Ji*.\n\nDispatched to govern my left kidney and right kidney: the Dipper’s Net determines life, the Dipper’s Handle generates the liver, the Dipper’s □ generates the hun-soul, the Dipper’s □ generates form, the Dipper’s □ generates the lungs, the Dipper’s *Bi* generates the po-soul, the Dipper’s □ generates humanity, the Dipper’s *Piao* generates sinews, the Dipper’s *Ji* generates the spirit. They must not disobey. From the Three-Five Crimson Heaven, dispatched are nine Great Generals of the Dipper’s *Ji* to Assist the Body. Dispatched are nine Left Generals of the Dipper’s *Ji*. Dispatched are nine Right Generals of the Dipper’s *Ji*. Dispatched are nine Great Generals of the Dipper’s *Fa*. Dispatched are nine Left Generals of the Dipper’s *Fa*. Dispatched are nine Right Generals of the Dipper’s *Fa*. Dispatched are nine Great Generals of the Dipper’s *Sha*. Dispatched are nine Left Generals of the Dipper’s *Sha*. Dispatched are nine Right Generals of the Dipper’s *Sha*. Dispatched are nine Great Generals of the Dipper’s *Ji* to Pacify the Hun-Soul, nine Generals of the Dipper’s *Fa* to Calm the Po-Soul, and nine Generals of the Dipper’s *Sha* to Immortalize the Hun-Soul. From the Three-Five Crimson Heaven, dispatched are nine Great Generals of the Revolving Mechanism for Repelling Enemies. Dispatched are nine Left Generals for Repelling Enemies. Dispatched are nine Right Generals for Repelling Enemies.",
      "overlap_context": "y person, responding instantly to my summons.\n\nI reverently dispatch the Crimson Register of the Primordial Chaos Perfected One of the Original Destiny of the Central Division, from the Upper Three Heavens’ Three-Five Attendants, along with the Direct Envoys, Orthodox Unity Attendants, and fifteen each of the Attendants for the East, West, South, and North, to establish and distribute the upright *qi*, cure all illnesses, and prolong life, with fifteen Envoys for each of the directional offices.",
      "start_char": 3011,
      "end_char": 3727,
      "start_sentence": 61,
      "end_sentence": 111,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.991543531417847,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上三五正一盟威阅箓醮仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "出破敌大将军九人。 出破敌左将军九人。 出破敌右将军九人。 出收击大将军九人。 出收击左将军九人。 出收击右将军九人。 出并治臣却敌安神，破敌静魄，收敌仙魄，不得有替，赤天三五中黄司命大将军九人。 出司命左将军九人。 出司命右将军九人。 出定寿大将军九人。 出定寿左将军九人。 出定寿右将军九人。 出定仙大将军九人。 出定仙左将军九人。 出定仙右将军九人。 出并治臣司命安神定寿，静神定仙，百神不得有违，上仙都太上神明上灵官，中宫执凶郎吏，虎贲力士，破敌察奸，钩骑仆射力士，斩邪三官都官仆射力士各二十四人。 出主为臣某守护所居宅舍，执捉凶逆，讨捕奸邪，并令消灭，不得遗失，上仙都太上神明，上灵官中宫断截都官仆射，南北给侍驱使，呼召立至，上仙都太上神明，上灵官中宫乘魁收炁食炁吏，乘斗收神食神吏，乘星收鬼食鬼吏，乘璇玑收精食精吏，乘玉衡收邪食邪吏各一百二十〔万〕人。 出为臣某收食天下凶注鬼炁精邪妖孽之神，上仙都太上神明，上灵官中宫乘日三五科车赤符吏，乘月科车捕鬼使者各一百二十万人。 出主为臣某诛翦凶逆，讨捕精邪，赤符追摄，并令殄灭，上仙都太上神明，上灵官中宫刚风骑置驿马上章吏，三五除死籍定生吏各十万人。 出主为臣某呈章奏表，速令上御消除死籍注玉历生名上仙都太上神明，上灵官中宫中黄九道定志意吏，定胆吏，定慧吏力士各十二万人。 出主为臣某心神开悟通达玄微，上仙都太上神明，上灵官中宫六阴六阳成身吏各十二万人。 出主为臣某调理阴阳，延年保命，成身合道，通神接真，上仙都太上神明，上灵官中宫八神金刚力士，八杀金刚力士，高车直事使者，赤车直符使者，科车检捕使者，交击力士各七千二百人。 出主为臣某讨击凶逆，斩伐精邪，灭祸禳灾，驱除鬼贼，天灵赤官直使功曹，摄神都护，摄狱吏摄邪使者，摄神直符斩刺奸邪吏各二人。 出仙人道士玉女各百二十人。 出护身七神，不得离身将吏十四人，治病功曹护身将军各二人。 出兵曹吏各九人。 出扁鹊吏天医吏各二人。 出并按威仪诛邪灭伪，却死来生，救助臣某等身，保令呼吸相应，臣某草苗小子，千载幸会，伏蒙师尊弘愍赐授法箓，以自防保过泰之恩，实谓罔极，臣所受上仙上灵等二十四录所部将军，功曹，使者，真官，玉童玉女吏兵，士卒，并乞依按所部当局行事，衔命传真，宣扬道要，劝进良善，若有下官故炁恶逆凶邪，县官口舌恶人，谋议欲见中伤臣某，左右官使者径上天曹言白，不得容隐，从岁竟岁，从月竟月，从日竟日，从时竟时，周而复始。 奉行如法，营卫臣某身命，免厄度难，长生久视，心神安定，所向合真，出入行游，诸所造诣，金石为开，水火为济，皇天所覆，皇地所载，日月所照，山川所通，百邪摧伏，万神敬诺，使某百关流润，五藏生津，真炁降身，炼形易质，功成德备，白日升天，当以时言功，不负效信，臣晚学浅劣，加以愚暗，所简阅将军吏兵士卒，恐不合仪式，不相次比，千愆万过，乞垂赦宥，一及济未悟，不见罪罚，某诚惶诚恐稽首再拜。 次三咽气起，长跪祝曰： 臣阅箓事讫，向来所出上仙灵官功曹使者将军吏兵悉还臣身中，从众妙门而入，依按次位，在左还左，在右还右，安隐金堂玉室，直使功曹检押，无令错互营卫，周匝缠绕，表裹弥纶，天地无有违越。",
      "translated_text": "Dispatched are nine Great Generals to Smash Enemies. Dispatched are nine Left Generals to Smash Enemies. Dispatched are nine Right Generals to Smash Enemies. Dispatched are nine Great Generals to Gather and Strike. Dispatched are nine Left Generals to Gather and Strike. Dispatched are nine Right Generals to Gather and Strike. Together they govern the臣’s repelling of enemies to pacify the spirit, smashing of enemies to calm the po-soul, and gathering of enemies to immortalize the po-soul—none may be replaced. From the Crimson Heaven’s Three-Five Central Yellow, dispatched are nine Great Generals of the Controller of Destiny. Dispatched are nine Left Generals of the Controller of Destiny. Dispatched are nine Right Generals of the Controller of Destiny. Dispatched are nine Great Generals to Fix Lifespan. Dispatched are nine Left Generals to Fix Lifespan. Dispatched are nine Right Generals to Fix Lifespan. Dispatched are nine Great Generals to Fix Immortality. Dispatched are nine Left Generals to Fix Immortality. Dispatched are nine Right Generals to Fix Immortality. Together they govern the臣’s Controller of Destiny to pacify the spirit and fix lifespan, to calm the spirit and fix immortality—none of the hundred spirits may disobey.\n\nFrom the Upper Immortal Capital of the Most High Divine Luminaries, the Upper Numinous Bureau, and the Central Palace: Executors of Inauspicious Affairs, Tiger-Rushing Valiant Warriors, Smashers of Enemies and Investigators of Treachery, Hook-Riding Archers, Slayers of Evil from the Three Bureaus—each twenty-four in number. Dispatched to guard the臣’s dwelling, to seize and suppress inauspicious rebels, to hunt down and capture treacherous evil, and to ensure their annihilation without omission.\n\nFrom the Upper Immortal Capital of the Most High Divine Luminaries and the Upper Numinous Bureau: the Central Palace’s Intercepting and Severing Bureau Archers, attendants and messengers for the north and south, who respond to summons instantly. From the Upper Immortal Capital of the Most High Divine Luminaries and the Upper Numinous Bureau: the Central Palace’s *Kui*-Riders who gather *qi* and consume *qi*, Dipper-Riders who gather spirits and consume spirits, Star-Riders who gather ghosts and consume ghosts, *Xuanji*-Riders who gather essences and consume essences, Jade Balance-Riders who gather evil and consume evil—each one hundred twenty [myriad] in number. Dispatched to gather and consume for the臣 all inauspicious *qi*, ghostly *qi*, essences, evil, and demonic afflictions under heaven.\n\nFrom the Upper Immortal Capital of the Most High Divine Luminaries and the Upper Numinous Bureau: the Central Palace’s Crimson Talisman Clerks riding the Three-Five Solar Chariots, and Ghost-Capturing Messengers riding the Lunar Chariots—each one hundred twenty myriad in number. Dispatched to exterminate for the臣 all inauspicious rebels, to hunt down and capture evil essences, to pursue and seize with crimson talismans, ensuring their complete annihilation.\n\nFrom the Upper Immortal Capital of the Most High Divine Luminaries and the Upper Numinous Bureau: the Central Palace’s Steeds of the Strong Wind, couriers of the memorials, clerks who remove death records and fix life records—each ten myriad in number. Dispatched to present memorials and petitions for the臣, swiftly submitting them to the throne to erase death records and inscribe life in the Jade Calendar.\n\nFrom the Upper Immortal Capital of the Most High Divine Luminaries and the Upper Numinous Bureau: the Central Palace’s clerks of the Central Yellow Nine Paths to fix resolve, clerks to fix courage, clerks to fix wisdom, and valiant warriors—each twelve myriad in number. Dispatched to open the臣’s heart-spirit to enlightenment and penetrate the subtle mysteries.\n\nFrom the Upper Immortal Capital of the Most High Divine Luminaries and the Upper Numinous Bureau: the Central Palace’s clerks of the Six Yin and Six Yang to complete the body—each twelve myriad in number. Dispatched to regulate the臣’s yin and yang, prolong life, preserve destiny, complete the body, unite with the Dao, commune with spirits, and connect with the perfected.\n\nFrom the Upper Immortal Capital of the Most High Divine Luminaries and the Upper Numinous Bureau: the Central Palace’s Eight Spirit Vajra Warriors, Eight Slayer Vajra Warriors, High Chariot Direct Attendants, Crimson Chariot Direct Talisman Messengers, Inspection Chariot Arresting Messengers, and Intercepting Warriors—each seven thousand two hundred in number. Dispatched to hunt down and strike for the臣 all inauspicious rebels, to slay and eradicate evil essences, to eliminate misfortune and avert calamity, and to expel demonic thieves.\n\nFrom the Heavenly Numinous Crimson Bureau: Direct Attendants, Merit Clerks, Spirit-Seizing Protectors, Prison-Seizing Clerks, Evil-Seizing Messengers, Spirit-Seizing Direct Talisman Slayers of Treacherous Evil—each two in number. Dispatched are one hundred twenty immortals, Daoist masters, and jade maidens each. Dispatched are the seven spirits to guard the body, with fourteen generals and clerks who must not leave the body, and two generals to cure illness and protect the body each. Dispatched are nine clerks of the Military Bureau each. Dispatched are two clerks of Bian Que and two clerks of the Heavenly Physicians each.\n\nTogether they enforce dignity and majesty to execute evil and eradicate falsehood, to repel death and summon life, to rescue and assist the臣’s body, ensuring that breath and response are harmonized. This臣, a humble sprout, has fortunately encountered this millennial opportunity. Prostrating, I have received the profound compassion of my revered master, who bestowed upon me the register of methods to defend and protect myself, granting me peace and security—an indebtedness beyond measure.\n\nThe generals, clerks, messengers, perfected officials, jade lads, jade maidens, clerks, soldiers, and troops under the twenty-four registers of the Upper Immortals and Upper Numinous Bureaus that I have received are hereby beseeched to act according to their respective duties, to bear commands and transmit the truth, to propagate the essentials of the Dao, and to encourage goodness. Should any subordinate clerks, inauspicious *qi*, rebellious evil, or treacherous demons—along with officials, slanderous individuals, or conspirators seeking to harm this臣—exist, the attending messengers shall immediately report to the Heavenly Bureau without concealment. From year’s end to year’s end, from month’s end to month’s end, from day’s end to day’s end, from hour’s end to hour’s end, cyclically without cease.\n\nLet it be executed according to the method to safeguard this臣’s life, to avert calamity and transcend peril, to attain longevity and enduring vision, to stabilize the heart-spirit, and to align all endeavors with the perfected. In all travels and undertakings, may metal and stone open, water and fire aid, the August Heaven cover, the August Earth bear, the sun and moon illuminate, mountains and rivers connect. May all evil be subdued, and the myriad spirits obey. May this臣’s hundred passages flow with moisture, the five viscera generate fluids, true *qi* descend into the body, and the form be refined to transform its substance. When merit is accomplished and virtue perfected, may I ascend to heaven in broad daylight. At that time, I shall report my merits without failing in my demonstrated sincerity.\n\nThis臣, a late and shallow learner, foolish and dim, having reviewed the generals, clerks, soldiers, and troops, fears they may not conform to the proper forms or align in sequence, accumulating a thousand faults and ten thousand errors. I beseech your forgiveness, extending mercy even to the unenlightened, sparing me from punishment and penalty. With utmost reverence and trepidation, I bow my head and prostrate twice.\n\nNext, swallow the *qi* three times and rise, kneeling lengthily to pray:\nThis臣 has completed the review of the register. All the aforementioned Upper Immortal Numinous Bureau merit clerks, messengers, generals, clerks, and soldiers shall return into this臣’s body, entering through the Gate of Myriad Subtleties. According to their respective positions, those on the left return to the left, those on the right return to the right, resting securely in the golden hall and jade chamber. Let the Direct Attendant Merit Clerks inspect and supervise, ensuring no errors in their protective encirclement. Let them surround and envelop, externally and internally, without transgressing the bounds of heaven and earth.",
      "overlap_context": ". Dispatched are nine Right Generals of the Dipper’s *Sha*. Dispatched are nine Great Generals of the Dipper’s *Ji* to Pacify the Hun-Soul, nine Generals of the Dipper’s *Fa* to Calm the Po-Soul, and nine Generals of the Dipper’s *Sha* to Immortalize the Hun-Soul. From the Three-Five Crimson Heaven, dispatched are nine Great Generals of the Revolving Mechanism for Repelling Enemies. Dispatched are nine Left Generals for Repelling Enemies. Dispatched are nine Right Generals for Repelling Enemies.",
      "start_char": 3727,
      "end_char": 5006,
      "start_sentence": 112,
      "end_sentence": 142,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.20906352996826,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上三五正一盟威阅箓醮仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "次复炉咒 次吟受送颂曰： 此法甚玄妙，免汝九祖役，是其人不授。 令人与道隔，非人而辄授，见世被考责，死堕三途狱，万劫悔无益。 次出户咒后云 阅箓已后，唯愿臣等三师得道，九祖生天，见存获福，善善和颜，父慈子孝，学道成仙。 太上三五正一盟威阅箓醮仪竟",
      "translated_text": "Next, recite the incense burner incantation. Then chant the *Receiving and Sending Hymn*, saying:\n\nThis method is most profound and wondrous,\nFreeing your nine generations from servitude.\nIf unworthy ones receive it,\nThey sever themselves from the Dao.\nThose not fit who rashly transmit it\nShall face interrogation in this life,\nAnd upon death, fall into the Three Wretched Realms’ prisons,\nWith ten thousand kalpas of remorse to no avail.\n\nAfter the *Exiting the Chamber Incantation*, declare:\nUpon the completion of the register’s review, may this servant’s Three Masters attain the Dao, may the nine generations ascend to heaven, may the living reap blessings, may kindness and joy fill every countenance, may fathers be compassionate and children filial, and may all who study the Dao achieve immortality.\n\nThus concludes the *Rite of Register Review for the Alliance of Orthodox Unity under the Three and Five August Ones*.",
      "overlap_context": " clerks, and soldiers shall return into this臣’s body, entering through the Gate of Myriad Subtleties. According to their respective positions, those on the left return to the left, those on the right return to the right, resting securely in the golden hall and jade chamber. Let the Direct Attendant Merit Clerks inspect and supervise, ensuring no errors in their protective encirclement. Let them surround and envelop, externally and internally, without transgressing the bounds of heaven and earth.",
      "start_char": 5007,
      "end_char": 5142,
      "start_sentence": 143,
      "end_sentence": 149,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.775226354598999,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上三五正一盟威阅箓醮仪.txt",
        "category": "威仪类"
      }
    }
  ]
}