{
  "source_id": "太上化道度世仙经",
  "source_file": "chunked_daozang\\太上化道度世仙经.json",
  "total_chunks": 5,
  "total_original_chars": 4607,
  "total_translated_chars": 27192,
  "total_translation_time": 125.06658124923706,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\本文类\\太上化道度世仙经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Supreme Scripture of the Dao’s Transformation and Salvation of the World**\n\n**Scripture Title:** *The Supreme Scripture of the Dao’s Transformation and Salvation of the World*\n\n**Section One**\n\n**Chapter One: The Transformation of the Dao**\n\nAt that time, in the first year of the Primordial Ultimate Era, the year *guichou* (Water-Ox), on the seventh day of the tenth month, the Supreme Lord ascended the Seven Treasures Hall within the Great Clarity Palace to discourse upon the Perfect and Wondrous Dao.\n\nThen the Supreme Lord addressed the Left Mysterious Perfected One, saying:\nIn the Great Beginning, there was primordial chaos, and heaven and earth first divided. Yin and yang brought forth transformation, and the myriad beings were endowed with spirit.\n\nThe *Great Beginning* is the origin of chaos; *chaos* is that which preceded the division of heaven and earth. Taking the Great Beginning as its source, heaven and earth first separated, yin and yang paired and united, the Five Phases were established, and the transformations of the four seasons were apportioned to give rise to the myriad beings. By force of naming, this is called the *Dao*.\n\nThe Dao is the mother of heaven and earth, yin and yang, the ancestor of the Five Phases and the myriad beings. The Dao’s original form is formless, and thus it is forcibly named the *Dao*.\n\nIts form is in the indistinct and imperceptible.\nThe *indistinct and imperceptible* signify clarity and profundity. The Great Dao, when beheld, has no image; when listened to, no sound; when sought afar, no rule; when approached, no reliance. Thus, its image is in the indistinct, and its form is in emptiness and nothingness.\n\nFollow it, and principle is found; with diligent intent, all becomes clear.\nThe Great Dao is formless, its principles profound and distant. Without diligent intent, its wondrous principles are difficult to comprehend. Hold fast to the end as to the beginning, and meritorious deeds will be accomplished.\n\nThose who cultivate the Dao must practice their meritorious deeds, preserving the end as the beginning. Whether great or small, none will fail to achieve perfection.\n\nObserve fasting and uphold the precepts; simplicity is the gateway.\nPeople take fasting as precepts and precepts as conduct. With fasting and precepts as conduct, simplicity becomes the root.\n\nBody and mind are pure and still, without love or aversion.\nThe spirit delights in stillness, yet the distinctions of body and mind disturb it. The Supreme Lord, with a mind devoid of mind and a body devoid of body, empties the heart to realize true nature. Without body, there is yet spirit; when spirit and nature unite, this is the essence of sagely Dao.\n\nTaking emptiness and nothingness as its substance, how could there be love or aversion?\n\nThe six desires do no harm,\nThe six desires are the eyes, ears, nose, tongue, mind, and intent. The tongue craves flavors, the eyes behold forms, the ears listen to sounds, the nose smells fragrances, and the mind and intent cling to affairs. Desires follow emotions in pursuit of things, disturbing body and mind—these are the thieves of the six senses.\n\nAnd the myriad spirits submit.\nWithin the human body dwell thirty-six thousand spirits, all fond of life and averse to death. If one preserves the principles of the Mysterious Origin and comprehends the Dao of non-action, keeping the body free from defilement, how could the myriad spirits not submit?\n\nCultivate the mind and refine nature—this is my original body.\nTo *cultivate the mind* is to have a mind devoid of mind; to *refine nature* is to have a nature devoid of nature. The Supreme Lord is the spirit of purity, stillness, emptiness, and nothingness, the honored one of the Mysterious Origin’s perfect virtue.\n\nIf one sheds emotional defilements, sets aside right and wrong, and preserves the principles of the Great Dao, how could they not become one with the original body?\n\nMy body is not the Dao; through the Dao, it becomes true.\nThe *body is not the Dao* because the Dao is emptiness. Without body, there is yet form; the Dao resides within the human body like fire within stone—without striking, it does not manifest. Thus, the body is not the Dao.\n\nStrike it, and form appears—thus, through the Dao, it becomes true.\n\nDarkly harmonizing with heaven and earth, in the profound and obscure,\nThe *profound and obscure* are the images of clarity, emptiness, and stillness. Heaven and earth and the myriad beings arise through the Dao. The Dao has no form or body, thus it darkly harmonizes within the profound and obscure emptiness.\n\nYang’s form and substance, day and night are both divided.\nHeaven has no form or image; day and night are its foundation. The Dao has no form or image; meritorious deeds, fasting, and precepts are its root.\n\nThe four seasons are its signs, revolving through ancient and modern times.\nThe *four seasons* are spring, summer, autumn, and winter. Heaven takes the four seasons as its signs; the Dao responds through spiritual transformation. From the Primordial Beginning to the present, has there ever been a lapse?\n\nWithout speaking, it responds with goodness; the myriad beings all submit.\nHeaven does not speak, yet through yin and yang and the four seasons, it responds with goodness. The myriad beings receive the seasons and naturally live and die—how could they not submit as guests?\n\nEmbody it, and it is called the Dao; rely upon it, and it is called the True.\nThe mechanisms of heaven and earth, the sentiments of the four seasons—if one embodies and applies them, cultivating within the body, accomplishing the three thousand meritorious deeds, transforming the self into a sage, and ascending as a perfected one, this is the True.\n\n**Chapter Two: The Five Phases**\n\nThe Five Phases bring forth transformation; yin and yang are their utmost essence.\nThe *Five Phases* are metal, wood, water, fire, and earth. They transform the myriad beings, pairing and uniting yin and yang, becoming the essence of heaven, earth, and the myriad beings.\n\nWood, fire, metal, and water are named the Four Images.\nThe *Four Images* are named by the Dao: the Infant Boy, the Maiden Girl, Metal Elder, and Yellow Crone.\n\nThe Green Dragon extends to the left; the White Tiger is tamed to the right. The Vermilion Bird stands before; the Dark Warrior welcomes behind.\nThe Green Dragon pertains to wood and governs the liver on the left; the White Tiger pertains to metal and governs the lungs on the right; the Vermilion Bird pertains to fire and governs the heart in front; the Dark Warrior pertains to water and governs the kidneys behind. These are the lords of the Five Phases.\n\n*Bing*, *ding*, *jia*, *yi*, *ren*, *gui*, *geng*, *xin*—\nThese are the proper names of the four directions.\n\nThe east, ninefold blackness, gives rise to the myriad beings;\nThe *east, ninefold blackness* is the first of the four seasons, called the *wind of harmony and brightness*, which gives rise to the myriad beings.\n\nThe south, threefold blackness, is the spirit of growth and nourishment;\nThe *south, threefold blackness* is called the *scorching wind*, which nourishes the myriad beings.\n\nThe west, sevenfold blackness, is the pale and bright harvest;\nThe *west, sevenfold blackness* is called the *metal wind*, which brings the decline and withering of the myriad beings.\n\nThe north, fivefold blackness, is the Dark Heaven’s return to the root.\nThe *north, fivefold blackness* is called the *cold wind*, where the myriad beings rest and each returns to its root.\n\nHere is the translation:\n\n---\n\nThis is the record of the four *qi*. Each flourishes in its eight or nine, where yin and yang unite in form.\n\nThat each flourishes in its eight or nine refers to the Five Phases following the four seasons, each flourishing for seventy-two days—these are the seventy-two seasonal markers. Every five days make a minor marker, and seventy-two days make a major marker.\n\nAt the *Beginning of Spring*, wood flourishes for seventy-two days; at the *Beginning of Summer*, fire flourishes for seventy-two days; at the *Beginning of Autumn*, metal flourishes for seventy-two days; at the *Beginning of Winter*, water flourishes for seventy-two days. The four seasons of metal, wood, water, and fire together flourish for a total of two hundred and eighty-eight days.\n\nThe center, *wu* and *ji*, is uniquely honored among the four seasons. The *center, wu and ji*, is earth, the twelvefold blackness of the center, which governs the Five Phases and the myriad beings. Earth has no fixed position but is uniquely honored in the four seasons, flourishing for eighteen days in each. For earth harmonizes and nourishes the myriad beings, and thus the center is honored.\n\nIn spring, it flourishes with the *taihua* flower for eighteen days; in summer, with the *huaihua* flower for eighteen days; in autumn, with the chrysanthemum for eighteen days; in winter, with the *naidong* flower for eighteen days—together flourishing for seventy-two days. Thus, the Five Phases combine to complete three hundred and sixty days, forming one year.\n\nEarth has the Five Peaks, heaven corresponds to the Five Stars, and humans have the five viscera, each divided accordingly. Metal, wood, water, fire, and earth—the Five Phases—correspond to the Five Stars; the Five Peaks correspond to the five viscera. All share one body yet are divided by kind.\n\nThe Five Peaks of earth are: In the east, the Green Emperor, who gives rise to the myriad beings, with Mount Tai of the eastern peak as the chief of the Five Peaks. In the south, the Red Emperor, who nourishes the myriad beings, with Mount Heng as its peak. In the west, the White Emperor, who presides over harvest and decline, with Mount Hua as its peak. In the north, the Black Emperor, where the myriad beings’ work is completed and they return to their root, with Mount Heng as its peak. In the center, the Yellow Emperor, who harmonizes and nourishes the myriad beings, with Mount Song as its peak. These are the Five Phases of earth.\n\nHeaven corresponds to the Five Stars: In the east, the Wood Virtue Jupiter Star Lord; in the south, the Fire Virtue Mars Star Lord; in the west, the Metal Virtue Venus Star Lord; in the north, the Water Virtue Mercury Star Lord; and in the center, the Earth Virtue Saturn Star Lord. These are the Five Phases of heaven.\n\nThe five viscera of humans are the heart, liver, spleen, lungs, and kidneys. The liver corresponds to wood, governing spring and belonging to the east, *jia* and *yi*. The heart governs fire, corresponding to summer and belonging to the south, *bing* and *ding*. The lungs govern metal, corresponding to autumn and belonging to the west, *geng* and *xin*. The kidneys govern water, corresponding to winter and belonging to the north, *ren* and *gui*. The spleen governs earth, corresponding to the four seasons and belonging to the center, *wu* and *ji*. These are the Five Phases of humans.\n\nThe Dao of heaven and the transformation of the myriad beings all depend on the Five Phases. Heaven, earth, and humans share one root. All things between heaven and earth receive their *qi* to take form, with the Five Phases as their foundation.\n\nPure turbidity becomes earth; the nature of heaven is light and clear. Clear *qi* forms heaven, turbid *qi* forms earth. The clear resides above, the turbid below—thus the two *qi* each return to their origin. Earth, turbid, does not disperse; heaven, clear, does not collapse. Heaven is light and clear, taking emptiness and nothingness as its form; earth is turbid and heavy, taking solidity and substance as its shape. Through the Five Phases and yin-yang as their principle, the four seasons revolve without speech, and the myriad beings live and die naturally without contrivance. In these two images of non-action, how could there be collapse or dispersion?\n\nThe life and death of humans, the afflictions of the bodily form—all things between heaven and earth share one root. Yet humans and beings undergo birth and extinction, for they are born and must die. Birth is the root of death; death is the foundation of birth. Beings have life, have form; form gives rise to the bodily form. When nature is violated, within the unceasing there lurks the thief of the Dao—lust harms the bodily form. When emotions are violated, there is extinction. Heaven and earth have no birth, no emotions—they are without action.\n\nYet humans, within heaven and earth, follow their six senses, coveting love, fame, and profit, failing to secure their lives and destinies. Calamities, disasters, illnesses, and suffering arise from entanglement in affairs and attachment to wrongdoing. With scattered spirit and disordered mind, they submit to the ravages of the four seasons, meeting death without awakening.\n\nKnow that the wondrous Dao encompasses heaven and earth, bestowing kindness upon the dull and moving, nurturing all sentient beings without fail. Follow heaven and comply with earth—thus the true Dao endures long.\n\nIf humans embrace the natural principles of heaven and earth, carefully observing the workings of the four seasons, they may bring peace to the state and abundance to the people, pacifying the four seas. They may bring prosperity to the family and propriety to rites, extending kindness to kin and neighbors. The ruler who attains this may harmonize the myriad states and govern the hundred officials; by upholding the law with rectitude, the common people may become loyal, wise, and sincere. Those who cultivate themselves and attain this may endure for eternal kalpas.\n\nYet if one favors the perverse and loses the great, the Five Phases will govern and restrain the myriad beings. In their profound and enduring workings through eternal kalpas, the transformations of the Five Phases become the means to govern the state, manage the household, and order agriculture—nothing is disordered. Without this, no affair can be accomplished, and one may depart from the few to become a sage, sharing the same longevity as the Dao.\n\n**Chapter Three: The Mysterious Principle**\n\nThe formless is called the Dao; when principle is united, it is called the mysterious. The wondrous Dao is formless, taking heaven as its foundation. Seek the Dao by measuring heavenly principle; heavenly principle unites to form the mysterious mechanism. When the mysterious mechanism is realized and applied, success is achieved, and when merit is complete, it returns to the Dao.\n\nSpring, autumn, winter, and summer—the four seasons are linked. The supreme principle of the Dao is like the revolution of the four seasons in heaven, the fundamental mechanism of the law. The celestial circle of the heavens, the movement of the sun and moon—the celestial circle is the count of one year; the constellations are the twenty-eight lodges. Heaven has the Twelve Palaces of Upper Clarity, within which the lodges and planets are arrayed in degrees. Earth is divided into twelve terrestrial branches, each corresponding to the stellar lodges. Above and below, they illumine one another, like the twelve hours of the day, each hour further divided into quarters.\n\nThe Great Dao is empty and primordial, subtly aligning with the principles of heaven. Its divisions and measures, its laws and rules—all reside in oneness. The cycles of the sun and moon, the alternations of yin and yang, the moments of time—how could there be any separation? The qi-cycles and seasonal nodes embody the Dao in its natural course.\n\nThe qi-cycles consist of twenty-four qi and seventy-two seasonal markers in a year. Every fifteen days form one qi, every five days form one seasonal marker. The twenty-four qi and seventy-two seasonal markers of the year all correspond to the solar terms. Those who embody the Dao align with the four seasons, the qi-cycles, and the moments of time—this is the foundation of applying the Dao, the mechanism of heaven and earth’s creative transformation. If one holds to heaven while practicing the Dao, the alternations of yin and yang, the qi-cycles, and the moments of time are applied within the body, thereby embodying the Dao in its natural state.\n\nClouds rise and rain falls; wind and thunder do not remain hidden. Clouds are the qi of earth: when earth’s qi ascends and merges with heaven’s qi, rain is formed. This is because heaven is yang and earth is yin—when yin and yang unite, sweet rain descends. All things are nourished and grow, and none of this occurs without water.\n\nWind is the harmonious qi of the Five Agents. Gentle and without rigidity, it fulfills the temperaments of the four seasons, giving life to and destroying the myriad things, with hardness and softness prevailing in turn. The four seasons take this as their nature; the myriad things take this as their creative transformation; heaven and earth take this as their constancy; clouds and rain take this as their chariot and steed.\n\nThunder arises from the collision of the two qi of yin and yang. Earth’s qi belongs to yin, while the darkness of heaven belongs to yang. After the Beginning of Spring, yang qi grows abundant and scorching heat rises above; pure yin qi surges upward, and when cold and heat clash, sound is produced. In winter, there is no thunder because after the Beginning of Autumn, yang qi gradually wanes while yin qi grows abundant. Yang qi dissipates, leaving no scorching heat; yin qi surges upward in its purity, and thus thunder makes no sound. These two images match perfectly, demonstrating the wondrous application of the Dao. Wind and thunder do not remain hidden, for they are the union of yin and yang.\n\nThe hundred divisions of day and night complete a year. Each day and night consists of one hundred divisions. Divisions form hours, hours form days, days form months, and months form years. As for the number of breaths in a human: in one division, there are one hundred thirty-five breaths; in ten divisions, one thousand three hundred fifty breaths; in one hundred divisions, thirteen thousand five hundred breaths. Thus, breaths and divisions correspond.\n\nHeaven has its hundred divisions of day and night, which are the mechanism by which yin and yang govern. Humans have their exhalations and inhalations, which are the principle of matching effort in practice. If a perfected person understands the wondrous application of the Dao, how could there be any separation from the Dao of heaven?\n\nThe imperial Dao works divine transformations, and its responses are one with heaven. The imperial Dao is the image of the Dao flourishing and virtue prevailing; divine transformation is the auspiciousness of yin and yang’s unfathomable workings. When the Dao flourishes, auspiciousness arises, and responses align with heaven.\n\nWhen heaven’s Dao flourishes, it responds: yin and yang follow their sequence, the four seasons proceed without error, wind and rain arrive in due time—this is heaven’s auspiciousness. When a sage’s Dao flourishes, it responds: the state and nation enjoy great peace, worthy ministers assist, and celestial spirits manifest—this is the nation’s auspiciousness. When the Dao of self-cultivation flourishes, it responds: one attains long life and enduring vision, clarity and effortless action, and the spirit-soul undergoes transformations—this is the body’s auspiciousness. Thus, the imperial Dao and divine transformation share a single response.\n\nThe root gives rise to one ancestor, while branches divide into six sources. The root giving rise to one ancestor refers to the Primordial Unity of qi. All things receive this single qi and are born as two; the two qi form shapes, and the single qi is their root-ancestor.\n\nThe branches dividing into six sources refer to the six qi, which are governed by the Five Agents. Heaven has six qi: the winds and rains of the four seasons. Humans have six qi: the *xu* breath belongs to the liver, externally corresponding to wood, temporally to spring, and hexagrammatically to *Zhen*; the *he* breath belongs to the heart, externally corresponding to fire, temporally to summer, and hexagrammatically to *Li*; the *si* breath governs the lungs, externally corresponding to metal, temporally to autumn, and hexagrammatically to *Dui*; the *chui* breath governs the kidneys, externally corresponding to water, temporally to winter, and hexagrammatically to *Kan*; the *hu* breath governs the spleen, externally corresponding to earth, temporally to the four seasons; the *xi* breath governs the Triple Burner, externally corresponding to wind. These are the six qi and their governance. Those who practice refinement must not fail to understand them.\n\nThe Fire Dragon plays in the water, while the Metal Tiger flows ceaselessly. The Fire Dragon is the tongue, also called the Red Dragon, which governs the heart. The heart belongs to the southern direction, *bing* and *ding* fire—thus, it is the Fire Dragon. \"Playing in the water\" refers to the fluids in the mouth. Beneath the tongue lies a vessel called the Jade Spring, within which is the divine water of the Flowery Pond, also known as the Jade Nectar or the True Elixir of Jade Essence. This water does not arrive without qi, and qi does not move without water. The Most High rides the deer-drawn goat cart; immortals call it Jade Nectar, while mortals call it saliva. It is refined into the Golden Elixir and serves as the foundation.\n\nThe Metal Tiger belongs to the western direction, called the White Tiger, which internally governs the lungs. The lungs govern qi. In the practice of elixir refinement, qi circulates and fluids flow; fluids flow and qi abounds; qi abounds and the spirit flourishes; the spirit flourishes and the body becomes light. By practicing in accordance with the seasons, after nine years of great effort, the spirit transforms. When the spirit transforms, the form stabilizes; when the form stabilizes, qi stabilizes; when qi stabilizes, the body becomes sacred. When the body becomes sacred, the myriad spirits all attend, and one ascends in transformation, entering effortless action.\n\nThe Five Agents reverse, and the four seasons cycle. The reversal of the Five Agents means the intermingling of metal, wood, water, fire, and earth—such as water above and fire below, or metal and water alternating—turning and flowing in reversal. The cycling of the four seasons refers to spring, summer, autumn, and winter, like the revolution of heaven’s four seasons, which creates and transforms the myriad things.\n\nSpring, summer, autumn, and winter cycle through the four seasons; qi waxes and wanes with the climate, augmented by intercalary months, circulating endlessly in perpetual return—this is the meaning of cyclical recurrence. The principle of the Great Dao and the mechanism of heaven and earth—how could the movement of the celestial Dao be dual?\n\nIn the practice of cultivation, one must not cling to personal cleverness; rather, one should reflect upon the method. Those who do not align with the natural operation of heaven’s principle, but instead obstinately adhere to minor techniques, lead others astray and cannot escape the cycle of life and death.\n\nThrough the opening and closing of the Great Dao, the yin and yang of the four seasons are governed, the qi of the solar terms and hours is apportioned, and the myriad things are nurtured, all encompassed within heaven and earth. Yet the methods vary—how then can one attain the longevity of heaven and earth?\n\nThe supreme principle of Qian and Kun, the mechanism of the cosmos. The functioning of the Great Dao is one with heaven and earth, its movement of the Five Agents’ true qi in harmony with the four seasons’ ebb and flow—thus is the mechanism of Qian, Kun, and the cosmos spoken of.\n\nStillness is sublime; refinement is mysterious. Stillness means shedding right and wrong, freeing oneself from attachments, partaking of simple fare and bland flavors, and keeping the heart undisturbed by external chaos—this is the foundation of self-cultivation. Refinement means embracing the principle of heaven and earth, the union of yin and yang, the pairing of the Five Agents, the differentiation of the Four Images, the interplay of water and fire, the floating and sinking of metal and wood, and the blending of the myriad spirits—this is the work of alchemical refinement.\n\nConsuming the elixir and ingesting the black: thus is the immortal ascendant perfected. The saliva in the mouth is the supreme treasure of heaven and earth, the essence of the Five Agents. It nourishes the myriad things, moistens the body, and through it, blood is nurtured; through blood, essence is nurtured; through essence, qi is nurtured; through qi, spirit is nurtured; and through spirit, life is nurtured. Thus, in the refinement of the Golden Elixir, saliva is the foundation.\n\nIngesting qi is the upright qi of the Five Agents. Heaven and earth operate through the four seasons and day and night; humans rely on the qi and vessels of the five viscera as their root. If one follows the wondrous principle in practice, constantly nourishing the saliva and ingesting qi, once the merit is complete, one ascends to the Golden Towers. Thus does one traverse the realm of emptiness and nothingness!\n\nThe foolish remain deluded; the awakened are blessed with affinity.\n\nThe deluded, bound to the floating world’s gains and losses, entangle body and mind—how could they know the Dao/Way has its learning, that emptiness and nothingness hold principle? The enlightened, though they may not yet grasp its ultimate truth, first delight in emptiness and nothingness. They examine the heavens and earth, the four seasons, and find their operations governed by principle; they scrutinize the myriad things’ transformations, their arising and ceasing, and find them imbued with sentiment.\n\nIf one sets their resolve to study the immortals’ scriptures, they will all attain the wondrous method. When merit is complete and fruit is full, the body realizes the Dao/Way of non-action—thus do they become spirit-immortals by affinity.\n\nThe oral instruction states: Regularly, between midnight and noon, face south and sit upright. Collect the spirit, clench the fists, and strike the bell and drum thirty-six times each. Then, using the seasonal dominant qi as the head, circulate the Five Agents’ qi, exhaling stale breath and inhaling saliva. For each season, exhale and inhale seventy-two times, and for earth, ninety times—thus, in one season of three months, the four seasons total three hundred sixty breaths. When complete, add five more breaths, symbolizing the three hundred sixty days of a year plus the remaining five, forming one merit cycle. Then, following the head’s revolution, begin anew. Three merit cycles make one intercalary period, adding thirty breaths, just as three years include one intercalary month.\n\nIf the count remains unerring and merit gradually accumulates, naturally the desire for flavors will recede. Hunger is met with qi; thirst, with saliva. The qi of the Five Grains wanes while true qi waxes. After nine years, the spirit transforms.\n\n*Thus concludes the Supreme One’s Scripture on Transforming the Dao/Way and Delivering the World to Immortality.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上化道度世仙经 经名：太上化道度世仙经。 一春。 不着撰人，疑出于宋代。 底本出处：文类。 《正统道藏》 洞神部本文类。 太上化道度世仙经 化道品第一 尔时太上於元极元年，岁次癸丑，十月七日，诣太清宫中七宝殿内，论至真妙道。 是时太上告左玄真人曰：太初混沌，天地始分，阴阳造化，万物含灵。 太初者，混沌之始也； 混沌者，天地分立之先也。 以太初为祖，始分天地，配合阴阳，立其五行，分其四时之造化，以发生万物也。 强名日道。 道乃天地阴阳之母，五行万物之宗，道之元形，故强名日道也。 恍惚为形， 恍惚者，澄湛之意也。 谓大道视之元象，听之元声，远之元则，近之元依，故以恍惚为象，以虚元为形。 随之有理，勤志皆明， 大道无形，其理幽远，若不志勤，难明妙理。 守终如始，功行乃成。 修道之人，施其功行，守终如初，大之与小，无不成矣！ 持斋奉戒，淡泊为门， 人以斋为戒，以戒为行，斋戒为行，用淡泊为根也。 身心清静，无爱无憎， 神好静，而以身心是非挠之。 太上以心无心，以身无身，乃虚心而实性，无身而有神，以神性共聚，乃为圣道之质也。 以虚无为体，何有憎爱。 六欲不贼， 六欲者，眼耳鼻舌心意也，常以舌责其味，眼观其色，耳听其声，鼻嗅其香，心意系其事，欲绿情逐物，乱其身心，皆六根之贼者也。 万神乃遵。 人身中有三万六千之神，俱好生而不好死，若人守其玄元之、理，达无为之道，身无秽污，万神岂不遵伏也。 修心炼性，是吾本身。 修心者，以心无心也； 炼性者，以性无性也。 太上乃清静虚无之神，玄元至德之尊。 几人去其情染，外其是非，守其大道之理，岂不为一体本身？ 吾身非道，因道成真， 身非道者，为道乃虚，无身则有象，道在人身，如石中之火，不击本无，故身非道也。 击之有象，故因道成真者也。 暗合天地，杳杳冥冥， 杳冥者，清虚寂湛之象也，为天地万物，因道而生，道无形体，乃暗合在杳冥虚无之中矣！ 阳形质，昼夜俱分。 天无形象，以昼夜为本； 道无形象，以功行斋戒为根。 四时为信，运转古今。 四时者，春夏秋冬也。 天以四时为信，道以神化为应，自元始至今，岂有失乎？ 不言善应，万物皆宾， 天之不言，以阴阳四时善应，万物禀时，而生杀自然，可不为宾伏者乎！ 体之日道，依者为真。 天地之机，四时之情，若人体之运用，依而於身修炼，三千功行成就，变几为圣，乃升真也。 五行品第二 五行造化，阴阳至精， 五行者，金木水火土也，乃造化万物，配合阴阳，为天地万物之精华者也。 木火金水，四象为名。 四象以道名也，婴儿妮女，金公黄婆也。 青龙左达，白虎右驯，朱雀前立，玄武后迎。 青龙属木，为肝在左； 白虎属金，为肺在右； 朱雀属火，为心在前； 玄武属水，为肾在后。 此乃五行之所主也。 丙丁甲乙，壬癸庚辛。 乃四方之正名也。 束方九黑，万物发生； 南方三黑，长养之神； 西方七黑，素皓收成； 北方五黑，玄天归根。 束方九黑者，四时之首也，谓之日和风，乃发生万物者也。 南方三黑者，谓之炎风，乃万物之长养也。 西方七黑者，谓之金风也，万物之衰杀也。 北方五熙者，谓之寒风，乃万物之休息，各归根本。",
      "translated_text": "**The Supreme Scripture of the Dao’s Transformation and Salvation of the World**\n\n**Scripture Title:** *The Supreme Scripture of the Dao’s Transformation and Salvation of the World*\n\n**Section One**\n\n**Chapter One: The Transformation of the Dao**\n\nAt that time, in the first year of the Primordial Ultimate Era, the year *guichou* (Water-Ox), on the seventh day of the tenth month, the Supreme Lord ascended the Seven Treasures Hall within the Great Clarity Palace to discourse upon the Perfect and Wondrous Dao.\n\nThen the Supreme Lord addressed the Left Mysterious Perfected One, saying:\nIn the Great Beginning, there was primordial chaos, and heaven and earth first divided. Yin and yang brought forth transformation, and the myriad beings were endowed with spirit.\n\nThe *Great Beginning* is the origin of chaos; *chaos* is that which preceded the division of heaven and earth. Taking the Great Beginning as its source, heaven and earth first separated, yin and yang paired and united, the Five Phases were established, and the transformations of the four seasons were apportioned to give rise to the myriad beings. By force of naming, this is called the *Dao*.\n\nThe Dao is the mother of heaven and earth, yin and yang, the ancestor of the Five Phases and the myriad beings. The Dao’s original form is formless, and thus it is forcibly named the *Dao*.\n\nIts form is in the indistinct and imperceptible.\nThe *indistinct and imperceptible* signify clarity and profundity. The Great Dao, when beheld, has no image; when listened to, no sound; when sought afar, no rule; when approached, no reliance. Thus, its image is in the indistinct, and its form is in emptiness and nothingness.\n\nFollow it, and principle is found; with diligent intent, all becomes clear.\nThe Great Dao is formless, its principles profound and distant. Without diligent intent, its wondrous principles are difficult to comprehend. Hold fast to the end as to the beginning, and meritorious deeds will be accomplished.\n\nThose who cultivate the Dao must practice their meritorious deeds, preserving the end as the beginning. Whether great or small, none will fail to achieve perfection.\n\nObserve fasting and uphold the precepts; simplicity is the gateway.\nPeople take fasting as precepts and precepts as conduct. With fasting and precepts as conduct, simplicity becomes the root.\n\nBody and mind are pure and still, without love or aversion.\nThe spirit delights in stillness, yet the distinctions of body and mind disturb it. The Supreme Lord, with a mind devoid of mind and a body devoid of body, empties the heart to realize true nature. Without body, there is yet spirit; when spirit and nature unite, this is the essence of sagely Dao.\n\nTaking emptiness and nothingness as its substance, how could there be love or aversion?\n\nThe six desires do no harm,\nThe six desires are the eyes, ears, nose, tongue, mind, and intent. The tongue craves flavors, the eyes behold forms, the ears listen to sounds, the nose smells fragrances, and the mind and intent cling to affairs. Desires follow emotions in pursuit of things, disturbing body and mind—these are the thieves of the six senses.\n\nAnd the myriad spirits submit.\nWithin the human body dwell thirty-six thousand spirits, all fond of life and averse to death. If one preserves the principles of the Mysterious Origin and comprehends the Dao of non-action, keeping the body free from defilement, how could the myriad spirits not submit?\n\nCultivate the mind and refine nature—this is my original body.\nTo *cultivate the mind* is to have a mind devoid of mind; to *refine nature* is to have a nature devoid of nature. The Supreme Lord is the spirit of purity, stillness, emptiness, and nothingness, the honored one of the Mysterious Origin’s perfect virtue.\n\nIf one sheds emotional defilements, sets aside right and wrong, and preserves the principles of the Great Dao, how could they not become one with the original body?\n\nMy body is not the Dao; through the Dao, it becomes true.\nThe *body is not the Dao* because the Dao is emptiness. Without body, there is yet form; the Dao resides within the human body like fire within stone—without striking, it does not manifest. Thus, the body is not the Dao.\n\nStrike it, and form appears—thus, through the Dao, it becomes true.\n\nDarkly harmonizing with heaven and earth, in the profound and obscure,\nThe *profound and obscure* are the images of clarity, emptiness, and stillness. Heaven and earth and the myriad beings arise through the Dao. The Dao has no form or body, thus it darkly harmonizes within the profound and obscure emptiness.\n\nYang’s form and substance, day and night are both divided.\nHeaven has no form or image; day and night are its foundation. The Dao has no form or image; meritorious deeds, fasting, and precepts are its root.\n\nThe four seasons are its signs, revolving through ancient and modern times.\nThe *four seasons* are spring, summer, autumn, and winter. Heaven takes the four seasons as its signs; the Dao responds through spiritual transformation. From the Primordial Beginning to the present, has there ever been a lapse?\n\nWithout speaking, it responds with goodness; the myriad beings all submit.\nHeaven does not speak, yet through yin and yang and the four seasons, it responds with goodness. The myriad beings receive the seasons and naturally live and die—how could they not submit as guests?\n\nEmbody it, and it is called the Dao; rely upon it, and it is called the True.\nThe mechanisms of heaven and earth, the sentiments of the four seasons—if one embodies and applies them, cultivating within the body, accomplishing the three thousand meritorious deeds, transforming the self into a sage, and ascending as a perfected one, this is the True.\n\n**Chapter Two: The Five Phases**\n\nThe Five Phases bring forth transformation; yin and yang are their utmost essence.\nThe *Five Phases* are metal, wood, water, fire, and earth. They transform the myriad beings, pairing and uniting yin and yang, becoming the essence of heaven, earth, and the myriad beings.\n\nWood, fire, metal, and water are named the Four Images.\nThe *Four Images* are named by the Dao: the Infant Boy, the Maiden Girl, Metal Elder, and Yellow Crone.\n\nThe Green Dragon extends to the left; the White Tiger is tamed to the right. The Vermilion Bird stands before; the Dark Warrior welcomes behind.\nThe Green Dragon pertains to wood and governs the liver on the left; the White Tiger pertains to metal and governs the lungs on the right; the Vermilion Bird pertains to fire and governs the heart in front; the Dark Warrior pertains to water and governs the kidneys behind. These are the lords of the Five Phases.\n\n*Bing*, *ding*, *jia*, *yi*, *ren*, *gui*, *geng*, *xin*—\nThese are the proper names of the four directions.\n\nThe east, ninefold blackness, gives rise to the myriad beings;\nThe *east, ninefold blackness* is the first of the four seasons, called the *wind of harmony and brightness*, which gives rise to the myriad beings.\n\nThe south, threefold blackness, is the spirit of growth and nourishment;\nThe *south, threefold blackness* is called the *scorching wind*, which nourishes the myriad beings.\n\nThe west, sevenfold blackness, is the pale and bright harvest;\nThe *west, sevenfold blackness* is called the *metal wind*, which brings the decline and withering of the myriad beings.\n\nThe north, fivefold blackness, is the Dark Heaven’s return to the root.\nThe *north, fivefold blackness* is called the *cold wind*, where the myriad beings rest and each returns to its root.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1350,
      "start_sentence": 0,
      "end_sentence": 72,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.20759439468384,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上化道度世仙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "此乃四熙之志也。 各旺八九，阴阳合形。 各旺八九者，为五行逐四时，各旺七十二日也，乃日七十二候也。 几五日为一小侯，七十二日为一大候焉！ 立春木旺七十二日，立夏火旺七十二日，立秋金旺七十二日，立冬水旺七十二日。 金木水火四时，共旺二百八十八日之数者也。 中央戊己，四季独尊。 中央戊己者，土也，乃中央一十二黑，为五行万物之统领也。 土无正位，以四季而独尊也，逐四时而各旺一十八日也。 为土能和养万物，以中央为尊也。 春旺薹花一十八日，夏旺槐花一十八日，秋旺菊花一十八日，冬旺奈冻花一十八日，四季共旺七十二日。 乃五行配合，共成三百六十日，为一年之岁也。 地为五岳，天应五星，人有五藏，一体各分。 金木水火土，五行为五星，五岳为五藏，皆同一体也，各分其类也。 地之五岳者，束方青帝，乃发生万物，以束岳泰山为五岳之长也。 南方赤帝，长养万物，岳日衡山。 西方白帝，主於收杀，岳日华山。 北方黑帝，万物之功成归本，岳日怛山。 中央黄帝，主和养万物，岳日嵩山。 此乃地之五行也。 天应五星者，束方木德岁星君，南方火德荧惑星君，西方金德太白星君，北方水德辰星君，中央土德镇星君也。 此乃天之五行也。 人之五藏者，心肝脾肺肾也，肝应其木，主於春，属束方甲乙。 心主火，应於夏，属南方丙丁。 肺主金，应於秋，属四方庚辛。 肾主水，应於冬，属北方壬癸。 脾主土，应於四季，属中央戊己。 此乃人之五行也。 天道万物之造化，皆不离於五行也。 天地与人，元同一根。 天地万物，皆禀其一熙而成形，以五行为主，用之本也。 纯浊为地，天性轻清。 清熙为天，浊熙为地，清处其上，浊处其下。 乃以二熙，各归其本也。 地浊无发，天清无崩。 天乃轻清，虚无为象，地以浊重，纯实为形。 用其五行，阴阳为信，乃不言而四时自运，用其万物为本，乃不裁而生杀自然。 此二象之无为，岂有崩发者也？ 人之生死，患害色身。 天地万物，根本皆一，人物有生灭者，为人物有生有死。 生乃死之根死乃生之本也。 物之有生，象，有象而乃为色身性有违，无灭之中那贼道淫色身患害，情有违则有灭也。 天地无生为情情无为也。 几人在天地从其六根，责爱名利，，不固身命，，祸息病苦，染事着非以心神散乱任四时摧逼以至死亡而不悟也。 知妙道包含於天地，惠於蠢动，养育於有情存，无不济给者也。 随天顺地，正道长存。 人若禀天地自然之理机，审察四时之运用，可以国安民丰，克清四海用，可以家丰礼义，恩及亲邻。 国主得之可以协和万邦，统摄百寮； 可以执法禀正庶人得之，可以忠良智朴紊； 修身得之永劫长存矣！ 则成其，好其邪，失於大，五行相统制万物，恩，湛湛历劫长五行造化之乃治国之用治家之农事不乱； 侯非事无可以去几作圣寿同 玄理品第三 无象日道，合理为玄。 妙道无象，以天为本也。 觅道测其天理，天理合作玄机，玄机悟用成功，功满却同於道也。 春秋冬夏，四季相连， 道之至理，如天运四时，乃法则之机本也。 周天列宿，日月运行， 周天者，一年之数也，列宿者，二十八宿。 天有上清十二官，内列其宿曜缠度； 地分十二地分，皆以星宿，上下照临，如日分十二时，以时内分刻。",
      "translated_text": "Here is the translation:\n\n---\n\nThis is the record of the four *qi*. Each flourishes in its eight or nine, where yin and yang unite in form.\n\nThat each flourishes in its eight or nine refers to the Five Phases following the four seasons, each flourishing for seventy-two days—these are the seventy-two seasonal markers. Every five days make a minor marker, and seventy-two days make a major marker.\n\nAt the *Beginning of Spring*, wood flourishes for seventy-two days; at the *Beginning of Summer*, fire flourishes for seventy-two days; at the *Beginning of Autumn*, metal flourishes for seventy-two days; at the *Beginning of Winter*, water flourishes for seventy-two days. The four seasons of metal, wood, water, and fire together flourish for a total of two hundred and eighty-eight days.\n\nThe center, *wu* and *ji*, is uniquely honored among the four seasons. The *center, wu and ji*, is earth, the twelvefold blackness of the center, which governs the Five Phases and the myriad beings. Earth has no fixed position but is uniquely honored in the four seasons, flourishing for eighteen days in each. For earth harmonizes and nourishes the myriad beings, and thus the center is honored.\n\nIn spring, it flourishes with the *taihua* flower for eighteen days; in summer, with the *huaihua* flower for eighteen days; in autumn, with the chrysanthemum for eighteen days; in winter, with the *naidong* flower for eighteen days—together flourishing for seventy-two days. Thus, the Five Phases combine to complete three hundred and sixty days, forming one year.\n\nEarth has the Five Peaks, heaven corresponds to the Five Stars, and humans have the five viscera, each divided accordingly. Metal, wood, water, fire, and earth—the Five Phases—correspond to the Five Stars; the Five Peaks correspond to the five viscera. All share one body yet are divided by kind.\n\nThe Five Peaks of earth are: In the east, the Green Emperor, who gives rise to the myriad beings, with Mount Tai of the eastern peak as the chief of the Five Peaks. In the south, the Red Emperor, who nourishes the myriad beings, with Mount Heng as its peak. In the west, the White Emperor, who presides over harvest and decline, with Mount Hua as its peak. In the north, the Black Emperor, where the myriad beings’ work is completed and they return to their root, with Mount Heng as its peak. In the center, the Yellow Emperor, who harmonizes and nourishes the myriad beings, with Mount Song as its peak. These are the Five Phases of earth.\n\nHeaven corresponds to the Five Stars: In the east, the Wood Virtue Jupiter Star Lord; in the south, the Fire Virtue Mars Star Lord; in the west, the Metal Virtue Venus Star Lord; in the north, the Water Virtue Mercury Star Lord; and in the center, the Earth Virtue Saturn Star Lord. These are the Five Phases of heaven.\n\nThe five viscera of humans are the heart, liver, spleen, lungs, and kidneys. The liver corresponds to wood, governing spring and belonging to the east, *jia* and *yi*. The heart governs fire, corresponding to summer and belonging to the south, *bing* and *ding*. The lungs govern metal, corresponding to autumn and belonging to the west, *geng* and *xin*. The kidneys govern water, corresponding to winter and belonging to the north, *ren* and *gui*. The spleen governs earth, corresponding to the four seasons and belonging to the center, *wu* and *ji*. These are the Five Phases of humans.\n\nThe Dao of heaven and the transformation of the myriad beings all depend on the Five Phases. Heaven, earth, and humans share one root. All things between heaven and earth receive their *qi* to take form, with the Five Phases as their foundation.\n\nPure turbidity becomes earth; the nature of heaven is light and clear. Clear *qi* forms heaven, turbid *qi* forms earth. The clear resides above, the turbid below—thus the two *qi* each return to their origin. Earth, turbid, does not disperse; heaven, clear, does not collapse. Heaven is light and clear, taking emptiness and nothingness as its form; earth is turbid and heavy, taking solidity and substance as its shape. Through the Five Phases and yin-yang as their principle, the four seasons revolve without speech, and the myriad beings live and die naturally without contrivance. In these two images of non-action, how could there be collapse or dispersion?\n\nThe life and death of humans, the afflictions of the bodily form—all things between heaven and earth share one root. Yet humans and beings undergo birth and extinction, for they are born and must die. Birth is the root of death; death is the foundation of birth. Beings have life, have form; form gives rise to the bodily form. When nature is violated, within the unceasing there lurks the thief of the Dao—lust harms the bodily form. When emotions are violated, there is extinction. Heaven and earth have no birth, no emotions—they are without action.\n\nYet humans, within heaven and earth, follow their six senses, coveting love, fame, and profit, failing to secure their lives and destinies. Calamities, disasters, illnesses, and suffering arise from entanglement in affairs and attachment to wrongdoing. With scattered spirit and disordered mind, they submit to the ravages of the four seasons, meeting death without awakening.\n\nKnow that the wondrous Dao encompasses heaven and earth, bestowing kindness upon the dull and moving, nurturing all sentient beings without fail. Follow heaven and comply with earth—thus the true Dao endures long.\n\nIf humans embrace the natural principles of heaven and earth, carefully observing the workings of the four seasons, they may bring peace to the state and abundance to the people, pacifying the four seas. They may bring prosperity to the family and propriety to rites, extending kindness to kin and neighbors. The ruler who attains this may harmonize the myriad states and govern the hundred officials; by upholding the law with rectitude, the common people may become loyal, wise, and sincere. Those who cultivate themselves and attain this may endure for eternal kalpas.\n\nYet if one favors the perverse and loses the great, the Five Phases will govern and restrain the myriad beings. In their profound and enduring workings through eternal kalpas, the transformations of the Five Phases become the means to govern the state, manage the household, and order agriculture—nothing is disordered. Without this, no affair can be accomplished, and one may depart from the few to become a sage, sharing the same longevity as the Dao.\n\n**Chapter Three: The Mysterious Principle**\n\nThe formless is called the Dao; when principle is united, it is called the mysterious. The wondrous Dao is formless, taking heaven as its foundation. Seek the Dao by measuring heavenly principle; heavenly principle unites to form the mysterious mechanism. When the mysterious mechanism is realized and applied, success is achieved, and when merit is complete, it returns to the Dao.\n\nSpring, autumn, winter, and summer—the four seasons are linked. The supreme principle of the Dao is like the revolution of the four seasons in heaven, the fundamental mechanism of the law. The celestial circle of the heavens, the movement of the sun and moon—the celestial circle is the count of one year; the constellations are the twenty-eight lodges. Heaven has the Twelve Palaces of Upper Clarity, within which the lodges and planets are arrayed in degrees. Earth is divided into twelve terrestrial branches, each corresponding to the stellar lodges. Above and below, they illumine one another, like the twelve hours of the day, each hour further divided into quarters.",
      "overlap_context": " growth and nourishment;\nThe *south, threefold blackness* is called the *scorching wind*, which nourishes the myriad beings.\n\nThe west, sevenfold blackness, is the pale and bright harvest;\nThe *west, sevenfold blackness* is called the *metal wind*, which brings the decline and withering of the myriad beings.\n\nThe north, fivefold blackness, is the Dark Heaven’s return to the root.\nThe *north, fivefold blackness* is called the *cold wind*, where the myriad beings rest and each returns to its root.",
      "start_char": 1350,
      "end_char": 2646,
      "start_sentence": 73,
      "end_sentence": 134,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.79112458229065,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上化道度世仙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "以大道虚元，暗合天理，分度法则，皆居一也。 日月之循环，阴阳时刻，岂有分别？ 气候时节，体道自然。 气候者，一年有二十四气，七十二候。 几十五日为一气，五日为一候，一年二十四气、七十二候，皆以节令相应也。 体道者为四时气候时刻，乃用道之本，天地造化之机。 若执天而行道，阴阳气侯时刻，在身施用，而体道於自然者也。 云腾雨施，风雷不潜， 云者地气也，地气出而腾於天，天气相合，而成雨也。 为天阳地阴，阴阳相合，而降甘雨也。 万物润泽，长养皆不出於水也。 风者，五行之和气也，和而无刚，乃遂其四时之情性，生杀万物，刚柔相胜。 四时以此为情，万物以此为造化，天地以此为常，云雨以此为车马也。 雷者，阴阳二熙相击也，为地熙属阴，天黑属阳。 以立春之后，阳气盛旺，炎热在上； 阴气纯玲上冲，故玲热相交，而成声。 冬天无雷者，为立秋之后，阳气渐衰，阴气盛旺，阳气消败，而无炎热； 阴气盛旺，纯玲上升，故雷无声也。 此二象匹配，乃妙道施用，风雷不潜，乃阴阳构合者也。 昼夜百刻，遭匝成年。 凡一日一夜，一百刻也，以刻成时，以时成日，以日成月，以月成年也。 如人有喘息之数，一刻有一百三十五息，十刻一千三百五十息，百刻一万三千五百息，乃以息而刻同也。 天有昼夜百刻，为阴阳统领之机； 人有吐纳喘息，为用功匹配之理，至人若明妙道作用，天道岂有分别者也。 帝道神化，感应同天。 帝道者，道泰德胜之象也； 神化者，阴阳不测之祥也。 以道泰而有祥，感应合於天也。 天之道泰以感，阴阳顺序，四季无差，风雨应时，为天之祥也。 圣人道泰以感，邦国太平，贤臣辅佐，天神应现，为国之祥也。 修身之道泰以感，长生久视，清冷无为，神魂变化，为身之祥也。 乃帝道神化，感应居一也。 根生一祖，枝分六源。 根生一祖者，混元一熙也，万物皆禀一熙，而生二，二黑而成形也，以一熙为根祖也。 枝分六源者，为六熙也，为五行之所主也。 天有六气，乃四时风雨； 人有六气者，为嘘气属肝，外应木，时应春，卦应震； 呵气属心，外应火，时应夏，卦应高； 咽气主肺，外应金，时应秋，卦应兑； 吹气主肾，外应水，时应冬，卦应坎； 呼气主脾，外应土，时应四季也； 嘻气主三焦，外应风。 此乃六气所主也。 修炼之士，不可不明。 火龙戏水，金虎绵绵， 火龙者，舌也，一名赤龙，为舌，主於心。 心属南方丙丁火，乃火龙也。 戏水者，为口中之津液也。 舌下有脉，名日玉泉，内有神水华池，又名琼浆玉液，乃玉华之真醴也。 此水非气而不至，气非水而不行。 太上乃鹿驾羊车，神仙谓之琼浆玉液，几人谓之津唾也。 几炼金丹，以为根本也。 金虎者，金主於西方，名日白虎，内主於肺，肺主於气也。 几炼丹之用，以气行而津注，津注而气盈，气盈则神旺，神旺则身轻。 以依时候用功，大以九年功满，而神变； 神变而形住，形住而气住，气住而几身圣，几身圣而万神俱侍，乃以升腾变化，身入无为也。 五行颠倒，四季循环。 五行颠倒者，金木水火土相交，如水上火下，金水问隔，翻腾往来，以颠倒之义也。 四季循环者，如春夏秋冬也，以如天运四时，而造化万物；",
      "translated_text": "The Great Dao is empty and primordial, subtly aligning with the principles of heaven. Its divisions and measures, its laws and rules—all reside in oneness. The cycles of the sun and moon, the alternations of yin and yang, the moments of time—how could there be any separation? The qi-cycles and seasonal nodes embody the Dao in its natural course.\n\nThe qi-cycles consist of twenty-four qi and seventy-two seasonal markers in a year. Every fifteen days form one qi, every five days form one seasonal marker. The twenty-four qi and seventy-two seasonal markers of the year all correspond to the solar terms. Those who embody the Dao align with the four seasons, the qi-cycles, and the moments of time—this is the foundation of applying the Dao, the mechanism of heaven and earth’s creative transformation. If one holds to heaven while practicing the Dao, the alternations of yin and yang, the qi-cycles, and the moments of time are applied within the body, thereby embodying the Dao in its natural state.\n\nClouds rise and rain falls; wind and thunder do not remain hidden. Clouds are the qi of earth: when earth’s qi ascends and merges with heaven’s qi, rain is formed. This is because heaven is yang and earth is yin—when yin and yang unite, sweet rain descends. All things are nourished and grow, and none of this occurs without water.\n\nWind is the harmonious qi of the Five Agents. Gentle and without rigidity, it fulfills the temperaments of the four seasons, giving life to and destroying the myriad things, with hardness and softness prevailing in turn. The four seasons take this as their nature; the myriad things take this as their creative transformation; heaven and earth take this as their constancy; clouds and rain take this as their chariot and steed.\n\nThunder arises from the collision of the two qi of yin and yang. Earth’s qi belongs to yin, while the darkness of heaven belongs to yang. After the Beginning of Spring, yang qi grows abundant and scorching heat rises above; pure yin qi surges upward, and when cold and heat clash, sound is produced. In winter, there is no thunder because after the Beginning of Autumn, yang qi gradually wanes while yin qi grows abundant. Yang qi dissipates, leaving no scorching heat; yin qi surges upward in its purity, and thus thunder makes no sound. These two images match perfectly, demonstrating the wondrous application of the Dao. Wind and thunder do not remain hidden, for they are the union of yin and yang.\n\nThe hundred divisions of day and night complete a year. Each day and night consists of one hundred divisions. Divisions form hours, hours form days, days form months, and months form years. As for the number of breaths in a human: in one division, there are one hundred thirty-five breaths; in ten divisions, one thousand three hundred fifty breaths; in one hundred divisions, thirteen thousand five hundred breaths. Thus, breaths and divisions correspond.\n\nHeaven has its hundred divisions of day and night, which are the mechanism by which yin and yang govern. Humans have their exhalations and inhalations, which are the principle of matching effort in practice. If a perfected person understands the wondrous application of the Dao, how could there be any separation from the Dao of heaven?\n\nThe imperial Dao works divine transformations, and its responses are one with heaven. The imperial Dao is the image of the Dao flourishing and virtue prevailing; divine transformation is the auspiciousness of yin and yang’s unfathomable workings. When the Dao flourishes, auspiciousness arises, and responses align with heaven.\n\nWhen heaven’s Dao flourishes, it responds: yin and yang follow their sequence, the four seasons proceed without error, wind and rain arrive in due time—this is heaven’s auspiciousness. When a sage’s Dao flourishes, it responds: the state and nation enjoy great peace, worthy ministers assist, and celestial spirits manifest—this is the nation’s auspiciousness. When the Dao of self-cultivation flourishes, it responds: one attains long life and enduring vision, clarity and effortless action, and the spirit-soul undergoes transformations—this is the body’s auspiciousness. Thus, the imperial Dao and divine transformation share a single response.\n\nThe root gives rise to one ancestor, while branches divide into six sources. The root giving rise to one ancestor refers to the Primordial Unity of qi. All things receive this single qi and are born as two; the two qi form shapes, and the single qi is their root-ancestor.\n\nThe branches dividing into six sources refer to the six qi, which are governed by the Five Agents. Heaven has six qi: the winds and rains of the four seasons. Humans have six qi: the *xu* breath belongs to the liver, externally corresponding to wood, temporally to spring, and hexagrammatically to *Zhen*; the *he* breath belongs to the heart, externally corresponding to fire, temporally to summer, and hexagrammatically to *Li*; the *si* breath governs the lungs, externally corresponding to metal, temporally to autumn, and hexagrammatically to *Dui*; the *chui* breath governs the kidneys, externally corresponding to water, temporally to winter, and hexagrammatically to *Kan*; the *hu* breath governs the spleen, externally corresponding to earth, temporally to the four seasons; the *xi* breath governs the Triple Burner, externally corresponding to wind. These are the six qi and their governance. Those who practice refinement must not fail to understand them.\n\nThe Fire Dragon plays in the water, while the Metal Tiger flows ceaselessly. The Fire Dragon is the tongue, also called the Red Dragon, which governs the heart. The heart belongs to the southern direction, *bing* and *ding* fire—thus, it is the Fire Dragon. \"Playing in the water\" refers to the fluids in the mouth. Beneath the tongue lies a vessel called the Jade Spring, within which is the divine water of the Flowery Pond, also known as the Jade Nectar or the True Elixir of Jade Essence. This water does not arrive without qi, and qi does not move without water. The Most High rides the deer-drawn goat cart; immortals call it Jade Nectar, while mortals call it saliva. It is refined into the Golden Elixir and serves as the foundation.\n\nThe Metal Tiger belongs to the western direction, called the White Tiger, which internally governs the lungs. The lungs govern qi. In the practice of elixir refinement, qi circulates and fluids flow; fluids flow and qi abounds; qi abounds and the spirit flourishes; the spirit flourishes and the body becomes light. By practicing in accordance with the seasons, after nine years of great effort, the spirit transforms. When the spirit transforms, the form stabilizes; when the form stabilizes, qi stabilizes; when qi stabilizes, the body becomes sacred. When the body becomes sacred, the myriad spirits all attend, and one ascends in transformation, entering effortless action.\n\nThe Five Agents reverse, and the four seasons cycle. The reversal of the Five Agents means the intermingling of metal, wood, water, fire, and earth—such as water above and fire below, or metal and water alternating—turning and flowing in reversal. The cycling of the four seasons refers to spring, summer, autumn, and winter, like the revolution of heaven’s four seasons, which creates and transforms the myriad things.",
      "overlap_context": "ism of the law. The celestial circle of the heavens, the movement of the sun and moon—the celestial circle is the count of one year; the constellations are the twenty-eight lodges. Heaven has the Twelve Palaces of Upper Clarity, within which the lodges and planets are arrayed in degrees. Earth is divided into twelve terrestrial branches, each corresponding to the stellar lodges. Above and below, they illumine one another, like the twelve hours of the day, each hour further divided into quarters.",
      "start_char": 2646,
      "end_char": 3899,
      "start_sentence": 135,
      "end_sentence": 193,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.2093768119812,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上化道度世仙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "春夏秋冬四季而循环，气侯旺衰，加喊余闰，周流复始，乃循环之义也。 大道之理，天地之机，天道运转，岂有二乎？ 凡人修炼用功，法不可执自以智，．宜鉴之以法，不应其天理之运用，皆以小卫执之，有误於人，难逃生死也。 以大道之开合，统领四时阴阳，分配节气刻侯，生育万物，包含於天地，用法不一，何以同天地之寿者也？ 乾坤至理，宇宙机权。 凡大道之作用，与天地一体，以五行真气之运动，同四时而往还，故言乾坤宇宙之机理也。 寂静为妙，烹炼则玄。 寂静者，以去其是非，无有染着，薄食淡味，心无外乱，乃修养之基也。 烹炼者，以禀天地之理，以阴阳媾也交合，五行匹配，四象分别，用水火相，金木浮沈，混合万神，烹炼之功也。 餐津服黑，毕成飞仙。 人口中之津液，乃天地之至宝，五行之秀气也。 能长养万物，润泽躯体，乃因津而养血，以血而养精，因精而养气，因气而养神，因神以养命。 故炼金丹，以津液为本也。 服气者，五行之正气也，天地以有四时昼夜为用，人以五脏气豚为根，若人依妙理运用，常养津服气，功行满毕，飞升金阙也。 往返於虚无者矣！ 愚者自迷，悟者有缘。",
      "translated_text": "Spring, summer, autumn, and winter cycle through the four seasons; qi waxes and wanes with the climate, augmented by intercalary months, circulating endlessly in perpetual return—this is the meaning of cyclical recurrence. The principle of the Great Dao and the mechanism of heaven and earth—how could the movement of the celestial Dao be dual?\n\nIn the practice of cultivation, one must not cling to personal cleverness; rather, one should reflect upon the method. Those who do not align with the natural operation of heaven’s principle, but instead obstinately adhere to minor techniques, lead others astray and cannot escape the cycle of life and death.\n\nThrough the opening and closing of the Great Dao, the yin and yang of the four seasons are governed, the qi of the solar terms and hours is apportioned, and the myriad things are nurtured, all encompassed within heaven and earth. Yet the methods vary—how then can one attain the longevity of heaven and earth?\n\nThe supreme principle of Qian and Kun, the mechanism of the cosmos. The functioning of the Great Dao is one with heaven and earth, its movement of the Five Agents’ true qi in harmony with the four seasons’ ebb and flow—thus is the mechanism of Qian, Kun, and the cosmos spoken of.\n\nStillness is sublime; refinement is mysterious. Stillness means shedding right and wrong, freeing oneself from attachments, partaking of simple fare and bland flavors, and keeping the heart undisturbed by external chaos—this is the foundation of self-cultivation. Refinement means embracing the principle of heaven and earth, the union of yin and yang, the pairing of the Five Agents, the differentiation of the Four Images, the interplay of water and fire, the floating and sinking of metal and wood, and the blending of the myriad spirits—this is the work of alchemical refinement.\n\nConsuming the elixir and ingesting the black: thus is the immortal ascendant perfected. The saliva in the mouth is the supreme treasure of heaven and earth, the essence of the Five Agents. It nourishes the myriad things, moistens the body, and through it, blood is nurtured; through blood, essence is nurtured; through essence, qi is nurtured; through qi, spirit is nurtured; and through spirit, life is nurtured. Thus, in the refinement of the Golden Elixir, saliva is the foundation.\n\nIngesting qi is the upright qi of the Five Agents. Heaven and earth operate through the four seasons and day and night; humans rely on the qi and vessels of the five viscera as their root. If one follows the wondrous principle in practice, constantly nourishing the saliva and ingesting qi, once the merit is complete, one ascends to the Golden Towers. Thus does one traverse the realm of emptiness and nothingness!\n\nThe foolish remain deluded; the awakened are blessed with affinity.",
      "overlap_context": "rits all attend, and one ascends in transformation, entering effortless action.\n\nThe Five Agents reverse, and the four seasons cycle. The reversal of the Five Agents means the intermingling of metal, wood, water, fire, and earth—such as water above and fire below, or metal and water alternating—turning and flowing in reversal. The cycling of the four seasons refers to spring, summer, autumn, and winter, like the revolution of heaven’s four seasons, which creates and transforms the myriad things.",
      "start_char": 3899,
      "end_char": 4369,
      "start_sentence": 194,
      "end_sentence": 209,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.331674098968506,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上化道度世仙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "愚迷之人，共浮世之利害，系染身心，岂知大道之有学，虚无有理也？ 达悟之人，虽未得其至理性，先乐其虚无，详天地四时，运用有理； 审万物造化，生杀有情。 若以志讨於仙经，咸获於妙法，以功成果满，身证无为之道，故神仙有缘也。 诀日：常以子后午前，面南端坐，存神握固，呜钟鼓各三十六通，乃用四时旺气为头，循环五气，吐气纳津。 一季各吐纳七十二口，并土共九十口，如一季三月，四季共成三百六十口。 毕，又加五口，象一年三百六十，余五日之约，乃为一功。 又依头周而复始，三功一闰，加三十口，如同三年一闺也。 数内常无差错，渐以加功，而自然食味喊退。 以饥则气，渴则津，五谷气衰，真气旺，九年神化也。 太上化道度世仙经竟",
      "translated_text": "The deluded, bound to the floating world’s gains and losses, entangle body and mind—how could they know the Dao/Way has its learning, that emptiness and nothingness hold principle? The enlightened, though they may not yet grasp its ultimate truth, first delight in emptiness and nothingness. They examine the heavens and earth, the four seasons, and find their operations governed by principle; they scrutinize the myriad things’ transformations, their arising and ceasing, and find them imbued with sentiment.\n\nIf one sets their resolve to study the immortals’ scriptures, they will all attain the wondrous method. When merit is complete and fruit is full, the body realizes the Dao/Way of non-action—thus do they become spirit-immortals by affinity.\n\nThe oral instruction states: Regularly, between midnight and noon, face south and sit upright. Collect the spirit, clench the fists, and strike the bell and drum thirty-six times each. Then, using the seasonal dominant qi as the head, circulate the Five Agents’ qi, exhaling stale breath and inhaling saliva. For each season, exhale and inhale seventy-two times, and for earth, ninety times—thus, in one season of three months, the four seasons total three hundred sixty breaths. When complete, add five more breaths, symbolizing the three hundred sixty days of a year plus the remaining five, forming one merit cycle. Then, following the head’s revolution, begin anew. Three merit cycles make one intercalary period, adding thirty breaths, just as three years include one intercalary month.\n\nIf the count remains unerring and merit gradually accumulates, naturally the desire for flavors will recede. Hunger is met with qi; thirst, with saliva. The qi of the Five Grains wanes while true qi waxes. After nine years, the spirit transforms.\n\n*Thus concludes the Supreme One’s Scripture on Transforming the Dao/Way and Delivering the World to Immortality.*",
      "overlap_context": "he foundation.\n\nIngesting qi is the upright qi of the Five Agents. Heaven and earth operate through the four seasons and day and night; humans rely on the qi and vessels of the five viscera as their root. If one follows the wondrous principle in practice, constantly nourishing the saliva and ingesting qi, once the merit is complete, one ascends to the Golden Towers. Thus does one traverse the realm of emptiness and nothingness!\n\nThe foolish remain deluded; the awakened are blessed with affinity.",
      "start_char": 4370,
      "end_char": 4668,
      "start_sentence": 210,
      "end_sentence": 220,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.526811361312866,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上化道度世仙经.txt",
        "category": "本文类"
      }
    }
  ]
}