{
  "source_id": "太上洞玄灵宝投简符文要诀",
  "source_file": "chunked_daozang\\太上洞玄灵宝投简符文要诀.json",
  "total_chunks": 8,
  "total_original_chars": 6893,
  "total_translated_chars": 43404,
  "total_translation_time": 206.8208565711975,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\神符类\\太上洞玄灵宝投简符文要诀.txt",
    "category": "神符类"
  },
  "full_translation": "**The Supreme Cavern Mystery Numinous Treasure Essentials of Petitioning with Talismanic Writs**\n\n**Scripture Title:** *The Supreme Cavern Mystery Numinous Treasure Essentials of Petitioning with Talismanic Writs*. Author unknown, likely composed during the Northern and Southern Dynasties or Sui-Tang period. An abridged and adapted version of ancient *Scriptures of the Numinous Treasure*, detailing methods for inscribing talismans and petitioning with writs to absolve sins. One fascicle.\n\n**Source:** *Daoist Canon of the Zhengtong Era*, Cavern Mystery Section, Numinous Talismans Category.\n\n---\n\n**The Supreme Cavern Mystery Numinous Treasure Essentials of Petitioning with Talismanic Writs**\n\nAt cock’s crow, when yang light first divides, face east and knock the teeth nine times. Rub both palms until warm, then wipe the face and eyes nine times with the hands. Look upward and recite while ingesting the Azure Tooth qi.\n\nFor the south, face south and follow the same method, knocking the teeth three times.\nFor the west, face west and do so seven times, as above.\nFor the center, knock the teeth twelve times and wipe the face and eyes.\nFor the north, five times, following the same method.\n\nAlways at cock’s crow, settle the body and stabilize the spirit, then proceed in order: first ingest the Azure Tooth qi of the east, then the south, then the center, then the west, then the north, as above. When the Five Thearchs are complete, knock the teeth thirty-six times and swallow qi twenty-five times to conclude.\n\nThen recite the general incantation:\n*\"White rocks, towering in sequence,\nSpring founts surge forth with jade nectar.\nDrink of it and attain long life,\nLifespan ever extending.\"*\n\nWhen finished, roll the tongue around the upper and lower mouth and center, filling the mouth with jade springwater, then swallow three times. Again draw qi twenty-five times, swallowing it fully—thus the Dao is complete.\n\nThe method for ingesting the Five Cloud Teeth is recorded in a separate fascicle.\n\nThe Heavenly Perfected Sovereign says: For those cultivating the Dao of flying transcendence, the method of liberation, corpse-liberation and concealed transformation, or the revolving cycles of life and death—roaming freely without constraint in the Great Yin—one must vermilion-inscribe the Jade Characters of the Myriad Heavens’ Ineffable Inner Sounds upon white silk, wear it upon the body, and ingest it according to the text. The heart remains unstained by defilement; the five viscera are harmoniously clear; the six palaces are tranquil and still. Abiding in empty azure and non-action, after eight years one penetrates all heavens, sits and beholds the ten directions, and myriad spirits descend in communion. The body generates jade radiance, and one gallops upon dragon chariots, ascending at dawn.\n\nThe transmission of the Jade Chapters of the Supreme Dao occurs once every forty thousand kalpas. The method of practice requires following the above vermilion-inscribed texts according to the seasons’ nodes.\n\n**Spring (First, Second, Third Months):**\nVermilion-inscribe the writ, face the Thearch, and knock the teeth nine times. Recite:\n*\"Great Brahmā of Flying Heaven, Vairāja of the Eight Directions,\nNine Qi Azure Heaven, all become divine kings.\nFive Unions and Eight Assemblies, flowing and resplendent in the Great Void.\nAbove, they open the Dragon Han, ancestral lineage of divine transcendents.\nBelow, they part the long night, chambers of the Nine Darks.\nThey deliver suffering souls, making withered bones glow with life.\nThe body transforms into feathers, clad in five-colored raiment.\nAzure dragons and jade carriages, soaring through empty space.\nToday I make this supplication to the Azure Heaven’s dawning yang.\nMay all vows be fulfilled, harmonizing with qi as one.\nAscend into formlessness, eternally preserved without end.\"*\n\nWhen finished, ingest the writ and swallow qi eight times to conclude.\n\n**Summer (Fourth, Fifth, Sixth Months):**\nVermilion-inscribe the writ, face the Thearch, and knock the teeth eight times. Recite:\n*\"Heavenly writs spread in arrays, Brahmā practices in Crimson Clarity.\nAbove, they open the Eight Paths; the Five Unions communicate with spirits.\nThe Great Cycle initiates its term; the Cavern Yang refines essence.\nJade texts gleam and shine; the Three Luminaries illuminate themselves.\nBelow, they deliver life and death, all who receive form.\nToday is most auspicious; the Great Sage attends the court.\nNine nights open the windows; dark chambers grow bright and clear.\nThe Three Evils cease; my Dao naturally fulfills.\nThe Five Thearchs protect and deliver, ascending to the Flourishing Capital.\nIn the Seven Treasures Grove, eternally enjoying kalpas of longevity.\"*\n\nWhen finished, ingest the writ and swallow qi eight times to conclude.\n\n**Autumn (Seventh, Eighth, Ninth Months):**\nVermilion-inscribe the writ, face the Thearch, and knock the teeth seven times. Recite:\n*\"Flying Mystery’s Eight Assemblies, congealing qi to form perfection.\nSixty-four characters, root of the Numinous Heaven.\nThey open and deliver life and death, restoring withered bones to humanity.\nDark souls disperse, receiving qi from the Supreme Mystery.\nToday is a time of celebration; ten thousand vows unfold.\nMyriad spirits gather in communion; I vow to become transcendent.\nScenery unites with the Dao; I vow to become divine.\nAttaining to ride upon plain clouds, ascending to the Thearch’s dawn.\nDelighting in the Seven Treasures, befriending perfected beings.\"*\n\nWhen finished, ingest the writ and swallow qi eight times to conclude.\n\n**Winter (Tenth, Eleventh, Twelfth Months):**\nVermilion-inscribe the writ, face the Thearch, and knock the teeth five times. Recite:\n*\"Jade characters open the dark; flowing and resplendent, they ascend the gate.\nEight qi congeal perfection; Brahmā practices in luminous clouds.\nDivine kings initiate radiance; the Three Images part the Cavern.\nFive colors drift and linger, illuminating my soul alone.\nToday, in timely convergence, I look upward to the Thearch.\nOpen and pardon, issue the writ, bestow upon me the true text.\nJade moisture intermingles and irrigates; the five palaces generate fragrance.\nFeathers transform; I ride the luminous chariot at dawn.\nEmerging from darkness into formlessness, transcendence occurs naturally.\nSeven ancestors return together, rejoicing in the Upper Prime.\"*\n\nWhen finished, ingest the writ and swallow qi eight times to conclude.\n\nThe Heavenly Perfected Sovereign says: These recitations are the qi of the Four Assemblies and the sounds of the Eight Harmonies, natural chapters. Those who practice them will have the distant heavens echo their chants; the Three Realms prepare rites; myriad spirits gird their sashes and attend the numinous writs.\n\nIngesting according to the seasonal nodes, reciting, and swallowing qi—after a hundred days, the heavens record it, the Earth Officials erase the ledgers. After eight years, divine perfected beings descend of their own accord. The body generates jade radiance, penetrating the dark and empty. Sitting, one beholds the natural; the dead corpse revives, returning to the womb and becoming human again. The revolving wheel ceases not; in life and death, one attains transcendence.\n\nThe Dao is revered, the method wondrous—practiced once in ten thousand kalpas. Those who lightly divulge or carelessly reveal it will bear the burden of the river’s source, suffering the wind-knives for ten thousand kalpas, never attaining transcendence. The ancient statutes of the Illuminated Perfected decree that this must be kept secret.\n\nWhen entering and exiting the Azure Heaven of the East, one should always knock the teeth nine times, envisioning nine-colored dragons leading and following, with nine layers of azure clouds enveloping the body. Secretly recite:\n\nThe Crimson Clarity unfolds the Chart, the Eight Qi return to the True. Governing the Mystic Tablet, the Great Divine Lord of the Azure Thearch, his transformative flow extends beyond the Nine Realms, entwining my body. The numinous sounds of the Eight Scripts, sixty-four chapters in all, illumine Heaven and Earth, merging with me to attain transcendence. The dragon-drawn chariot arrives, ascending to the imperial terrace.\n\nThis done, draw in qi and swallow nine times to conclude.\n\nWhen entering and exiting the Vermilion Heaven of the South, one should always knock the teeth three times, envisioning the Vermilion Bird and phoenix soaring ahead, with three layers of crimson clouds enveloping the body. Secretly recite:\n\nThe Three Qi linger and return, clouds and phoenix come in flight. The Jade Tone’s eight characters blaze in the Purple Tenuity. On this auspicious day of great rejoicing, my Dao opens wide. I partake of cinnabar’s sweet nectar, inhaling the numinous radiance. My body generates water and fire, clad in crimson and feathered robes. Ascending the void with mystic steps, my feet tread the phoenix ladder. Circling the Eight Heavens, seven generations follow in my wake.\n\nThis done, draw in qi and swallow three times to conclude.\n\nWhen entering and exiting the White Heaven of the West, one should always knock the teeth seven times, envisioning the White Tiger and lion guiding left and right, with seven layers of white clouds enveloping the body. Secretly recite:\n\nThe Seven Qi gather the numinous, the Eight Heavenly Honored Gods. The White Tiger steers the chariot, the lion bears the shafts. The Seven Qi entwine me, refining me into an immortal. My body emits golden radiance, my lungs reflect the white clouds. Inner and outer transform, ascending into the Cavernous Gate. Seven ancestors escape the night, the Nine Darks release their souls!\n\nThe Three Calamities and Five Sufferings are severed forever, cutting away evil roots. Together they rejoice in the abode of blessings, receiving the felicity of the natural. For a hundred million kalpas, they attain deliverance, enduring with the turning of the ages.\n\nThis done, draw in qi and swallow seven times to conclude.\n\nWhen entering and exiting the Mysterious Heaven of the North, one should always knock the teeth five times, envisioning the soaring tortoise and feathered canopy flourishing left and right, with five layers of black clouds enveloping the body. Divine lads and jade maidens in feathered robes and flying garments attend before and behind. Secretly recite:\n\nThe Mysterious Heaven lingers and returns, streaming light to the Upper Clarity. The Great Possession initiates its course, the eight characters exalted and bright. The soaring mystery settles into emptiness, the Cavernous Tone arises spontaneously. The Five Qi entwine me, irrigating my form. Crowned and girded with the Northern Host, I receive refinement in the Cavernous Numinous. My kidney palace transforms into an immortal, inner and outer radiant with essence. Flying through the Three Realms, I roam and feast in the Purple Court. Seven ancestors rejoice together, delighting in kalpas of age. In the Forest of Seven Treasures, I return to the womb and renew my form. The long night vanishes in death, the Southern Bureau records my name. On the Yellow Register and White Tablet, I attain eternal life through the ages.\n\nThis done, draw in qi and swallow five times to conclude.\n\nIf one truly desires the Dao, to become an immortal and never die, one must first expel the Three Worms and the corpse-crawling parasite beneath the heart. Each day, perform 360 breath-cycles of qi-ingestion, swallowing once every thirty cycles, resting once every ninety cycles, and doing this four times daily.\n\nRegularly at midnight and cock’s crow, recite:\n\nIn the East, the Azure Molar—consume the Azure Molar, drink from the Morning Flower.\n\nThis done, swallow three times to conclude.\n\nIn the South, the Vermilion Cinnabar—consume the Vermilion Cinnabar, drink from the Cinnabar Pool.\n\nThis done, swallow three times to conclude.\n\nIn the Central Wilds, the towering Mount Tai—consume the Primordial Qi, drink from the Sweet Spring.\n\nThis done, swallow three times to conclude.\n\nIn the West, the Luminous Stone—consume the Luminous Stone, drink from the Numinous Brook.\n\nThis done, swallow three times to conclude.\n\nIn the North, the Mysterious Nourishment—consume the Mysterious Nourishment, drink from the Jade Nectar.\n\nThis done, swallow three times to conclude.\n\nAfter thirty days of this practice, the Three Worms will die, the corpse-crawling parasite will depart, and the true spirit and true qi will settle naturally. The corpse-crawling parasite will no longer return to the heart, and you shall become an immortal.\n\nThe twenty-four characters above summon the Nine Heavenly Thearchs and the registers of divine immortals.\n\nThose who study the Dao of immortality should, on the first *jiazi* day of their life cycle coinciding with the Beginning of Spring, inscribe in green on a white poplar tablet their year, month, and name, then cast it beneath an isolated cliff. After nine years, the immortal officials will arrive, and you shall attain true transcendence.\n\nThe thirty-two characters above should be inscribed in vermilion on a white tablet on the first *jiazi* day of one’s life cycle coinciding with the Beginning of Summer, recording one’s name, year, and month, then cast upon a sacred mountain’s peak. After nine years, the immortal officials will arrive, and you shall attain flying transcendence.\n\nThe forty characters above govern the Jade Tablets of divine immortals. Regularly on the first *jiazi* day of one’s life cycle coinciding with the Spring Equinox, Summer Solstice, Autumn Equinox, or Winter Solstice, inscribe in yellow on a white tablet, recording one’s name, year, month, and day, then cast it upon a sacred mountain’s ridge. After nine years, the immortal officials and jade maidens will arrive, and you shall attain transcendence.\n\nThe forty-eight characters above should be inscribed in white on a tablet on the first *jiazi* day of one’s life cycle coinciding with the Beginning of Autumn, then cast upon a famous mountain’s peak, following the method above.\n\nThe forty characters above govern the registers of all Perfected Ones and divine immortals.\n\nDaoist practitioners should, on the first *jiazi* day of their life cycle coinciding with the Beginning of Winter, inscribe in black on a white tablet, recording their name, year, and month at the tablet’s base, then cast it upon a sacred mountain’s peak. After five years, the immortal officials will arrive, dispatching five Jade Maidens of the Great Mystery, and your name shall be inscribed in the registers of immortals.\n\nTo cultivate the Azure Molar and practice the method of guiding the Nine Qi of the Azure Heaven of the East, regularly at cock’s crow on the day of the Beginning of Spring, enter the chamber, face east, and perform nine bows. Seated evenly, knock the teeth nine times, envisioning the Azure Numinous First Elder Lord of the Peaceful Treasure Flower Grove in the East—surnamed Yan, named Kai Ming, styled Ling Wei Yang—his form nine inches tall, wearing a crown of azure essence-jade, clad in a nine-qi azure feathered flying robe, riding a chariot drawn by green dragons, bearing the *baobu* banner, attended by the nine hundred myriad officials of the Jia-Yi Hu-Lao’s Bureau, descending from the Nine Qi Azure Heaven into the chamber. In an instant, he transforms and generates azure qi, dense as clouded mist, enveloping your form and entering through the mouth, descending directly into the liver palace.\n\nNext, envision Jupiter shining brightly in the East, its light illuminating your body, all made distinct and clear. Then open your eyes and recite while looking upward:\n\nNine Qi Azure Heaven, primordial essence of the Highest Beginning.\nAugust Elder Divine Lord, clad in feathered azure.\nCommanding the celestial officials, Jupiter shines resplendent.\nScattering radiance and streaming fragrance, refining and irrigating my form.\nAbove, I feast on morning clouds; I ingest and guide the essence of wood.\n\nCultivate and nourish the azure sprouts, preserving and securing decrepit age.\nThe liver palace fills to overflowing, jade mushrooms grow of themselves.\nYears reverse and kalpas halt; complexion returns to that of a child.\nThe five qi merge and harmonize, heaven and earth endure as one.\n\nWhen finished, guide the azure qi and swallow it nine times, then cease. Proceed to ingest the twelve vermilion-script jade characters of the eastern direction. These twelve characters are the names of the Nine Qi Azure Heaven. Guide and draw the Nine Qi of the Azure Emperor, and consume the azure sprouts—all inscribed in vermilion on white paper, visualized and then ingested in one draught.\n\nRegularly at cock’s crow, when yang light first divides, face east and click the teeth nine times. Rub the palms until warm, then with them wipe the face and eyes nine times. Look upward and recite:\n\nAzure sprouts of the East, consume the azure sprouts, drink of the morning radiance.\n\nWhen finished, with the tongue stroke the outer side of the upper teeth, lick the lips three times, and let jade spring fill the mouth. Swallow it three times, then guide the azure qi and swallow it nine times, allowing it to settle within the liver. Thus is the Dao complete.\n\nTo cultivate and nourish the cinnabar sprouts, guide and draw the Three Qi of the Vermilion Heaven of the South. Regularly on the day of the Summer Solstice at cock’s crow, enter the chamber, face south, and perform three bows. Sit upright and click the teeth three times. Envision the Southern Treasure of Brahma, the Radiant Yang Cinnabar Numinous True Elder Lord, whose surname is Dongfu, personal name Jiyan, and style Chifiaonu. His form is three inches in height, his head crowned with a vermilion turban and jade diadem, his body clad in a feathered flying robe of the Three Qi Vermilion. He rides a vermilion dragon-drawn jade chariot, raises a vermilion banner, and is followed by three hundred myriad officials of the Bing-Ding Yue-Lao, descending from the Three Qi Vermilion Heaven into the chamber. In an instant, he transforms and generates vermilion qi, blazing bright as the brilliance of fire, enveloping your form and entering through the mouth, descending directly into the heart palace.\n\nNext, envision Mars shining brightly in the South, its light illuminating your body, all made distinct and clear. Then open your eyes and recite while looking upward:\n\nThree Qi Vermilion Heaven, vermilion palace numinous youth.\nPrimordial Elder of the Highest Beginning, riding a chariot drawn by vermilion dragons.\nVermilion feathered flying robe, brocade mantle of radiant light.\nCommanding and directing the celestial officials, regulating and guiding yin and yang.\nThe Three Qi exhale their splendor, irrigating my crimson palace.\nThe Red Child preserves and secures; refining the sprouts adorns the countenance.\nAbove, I feast on vermilion dawn; jade mushrooms fill to abundance.\nYears reverse and kalpas halt; decrepit frame returns to youth.\nLifespan endures with heaven and earth, eternally enjoying boundless existence.\nBody generates water and fire, transforming in a hundred ways.\n\nWhen finished, guide the vermilion qi and swallow it three times, then cease. Proceed to ingest the twelve vermilion-script jade characters of the southern direction. These twelve characters are the names of the Three Qi Vermilion Heaven. Guide and draw the Three Qi of the Vermilion Emperor, and consume the cinnabar sprouts—all inscribed in vermilion on white paper, visualized and then ingested in one draught.\n\nRegularly at cock’s crow, when yang light first divides, face south and click the teeth three times. Rub the palms until warm, then with them wipe the face three times. Look upward and recite:\n\nVermilion cinnabar of the South, consume the vermilion cinnabar, drink from the cinnabar pool.\n\nWhen finished, with the tongue stroke the outer side of the lower teeth, lick the lips and rinse the mouth, letting jade spring fill the mouth. Swallow it three times, then guide the vermilion qi and swallow it three times, allowing it to settle within the heart palace. Thus is the Dao complete.\n\nTo cultivate and nourish the yellow sprouts, guide and draw the Twelve Qi of the Central Yellow Heaven of Wu-Ji. Regularly on the days of the Spring Equinox, Summer Solstice, Autumn Equinox, and Winter Solstice at cock’s crow, enter the chamber, face the center, and perform twelve bows. Sit upright and click the teeth twelve times. Envision the Central Jade Treasure Primordial Numinous Primordial Elder Lord, whose surname is Tongban, personal name Yuanshi, and style Hanshuniu. His form is one foot two inches in height, his head crowned with a yellow essence jade diadem, his body clad in a five-colored feathered robe. He rides a yellow dragon-drawn jade chariot, raises a yellow banner, and is followed by one hundred twenty myriad officials of the Wu-Ji Cang-Lao, descending from the Twelve Qi Yellow Heaven into the chamber. In an instant, he transforms and generates yellow qi, billowing forth like luminous clouds exhaling their radiance, enveloping your form and entering through the mouth, descending directly into the spleen palace.\n\nNext, envision Saturn shining brightly in the center of heaven, its light illuminating your body, all made distinct and clear. Then open your eyes and recite while looking upward:\n\nAt the Central Yellow Great Mountain, the primordial qi lingers and swirls.\nAbove resides the Primordial Elder, governing the four directions.\nHe harnesses yellow dragons, clad in a five-colored feathered robe,\nGuiding the Nine Heavens, turning the wheel of the celestial pivot.\nSaturn shines resplendent, its streaming light scattering radiance.\nJade blossoms and fragrant mushrooms fill and overflow the four directions.\nThey bathe and irrigate my body, the spleen palace blooming fresh and bright.\nThey nourish the teeth and consume essence, all spirits converging in unity.\nThey inspect the hun and restrain the po, refining the eight mights of immortality.\nInner and outer shine alike, ever-living and unwaning.\nCommuning with the real and penetrating the numinous, ascending into the Grand Tenuity.\n\nWhen finished, draw in yellow qi and swallow twelve times, then ingest the sixteen-character vermilion script of the Central Jade Text. These sixteen characters are the names of the Central Yellow Heaven. Guide and lead the twelve qi of the Yellow Emperor, consume the yellow sprouts—all written in vermilion on white paper. After visualizing, suddenly ingest them.\n\nRegularly at cock’s crow, when yang light first divides, face the king, click the teeth twelve times, rub both palms until warm, and with them wipe the face and eyes twelve times. Look upward and recite:\nAt the Central Wu-Ji, the majestic Great Mountain,\nConsuming essence and qi, drinking from the sweet spring.\n\nWhen finished, stir the tongue beneath the dark jade channel, gather the jade spring to lick the lips, swallow three times, then draw in yellow qi twelve times to settle within the spleen palace. This completes the method.\n\nThe practice of cultivating plain sprouts and guiding the seven qi of the Plain Heaven’s method: regularly on the day of the Autumn Commencement at cock’s crow, enter the chamber, face west, and perform seven bows. Sit upright, click the teeth seven times, and envision the August Elder of the Western Seven-Jewel Golden Gate, personal name Shangjin, style Yaopobao, and personal name Changkai. His form is seven inches in height, his head crowned with a white essence jade diadem, his body clad in a white feathered flying robe. He rides a white dragon-drawn chariot, raises a plain banner, and is followed by seventy myriad officials of the Geng-Xin Cang-Lao, descending from the Seven Qi Plain Heaven into the chamber. In an instant, he transforms and generates white qi, billowing forth like luminous clouds veiling the heavens, enveloping your form and entering through the mouth, descending directly into the lung palace.\n\nNext, envision Venus shining brightly in the west, its light illuminating your body, all made distinct and clear. Then open your eyes and recite while looking upward:\n\nThe Seven Golden Gates of the Numinous Spirit gleam radiantly in the Western Florescence.\nAt their center dwells the White Sovereign, the primordial household of the Origin.\nHe harnesses white dragons, the seven qi towering majestically.\nPacing the Jade Gate, he scatters luminous crimson auroras.\nVenus emits its splendor, fragrant mushrooms overflow in abundance.\nThe Mystic Grotto suffuses my body, nourishing my white sprouts.\nBright stones gleam with fresh radiance, enduring through ten thousand kalpas without decay.\nI imbibe the flowing springs, I feast upon the Great Harmony.\nThe Nine Heavens’ Lord bestows upon me jade blossoms.\nPreserving years and halting aging, the white effulgence spreads in profusion.\nAbiding long between Heaven and Earth, the Three Luminaries share eternity.\n\nConclude by drawing in white qi seven times and swallowing it. Then ingest the twelve vermilion-script jade characters of the West.\nThese twelve characters are the names of the Western Seven Qi Plain Heaven.\nFor guiding and drawing in the White Thearch’s seven qi and ingesting the white sprouts, all are written in vermilion script on white paper. After visualization, promptly consume them.\n\nRegularly at cock’s crow, when yang light first divides, face west, knock the teeth seven times, rub the palms until warm, and wipe the face and eyes seven times. Look upward and recite:\n*O Bright Stone of the West, I ingest the Bright Stone, drinking the numinous liquid.*\n\nConclude by passing the tongue over the upper teeth, licking the lips, and rinsing the mouth until jade spring fills it. Swallow it three times, then draw in white qi seven times, allowing it to settle within the lung palace. This method is complete.\n\nThe method for cultivating the Mystic Sprouts and guiding the Five Qi of the Mystic Heaven:\nRegularly on the day of the Winter Solstice at cock’s crow, enter the chamber, face north, and complete the five rites. Sit upright, knock the teeth five times, and envision the Dark Yin of the Northern Culmen, the Five Numinous Mystic Elder Lord of Solitary Obscurity, bearing the surname Black Node, personal name Linghui, style Yinhouju. His form is five inches in height, his head crowned with a dark essence jade diadem, his body clad in a dark feathered flying robe. He rides a black dragon jade chariot, raises a black banner, and is followed by fifty myriad officials of the Ren-Gui Qiang-Lao, descending from the Five Qi Mystic Heaven into the chamber. In an instant, he transforms and generates black qi, its brilliance layered and cascading like the radiance of shooting stars, enveloping your form and entering through the mouth, descending directly into the kidney palace.\n\nNext, envision Mercury shining brightly in the north, its light illuminating your body, all made distinct and clear. Then open your eyes and recite while looking upward:\n\nIn the northern Mystic Heaven of the Five Qi, numinous essence scatters and spreads.\nAbove resides the Great Spirit, the Primordial Elder of Original Essence.\nHe rides a dragon, raises his banner, and roams the Upper Capital in joyous feast.\nThis day is supremely auspicious, as radiant blessings unfold in glory.\nFlying mushrooms stream and pour, suffusing all with abundant splendor.\nJade maidens of the Mystic Gulf bathe my form,\nfilling and fortifying the kidney palace, decayed teeth firming anew.\nThe Five Palaces receive the true, ascending to commune with the divine.\nThe Five Elders descend to welcome, and the Dao of immortality is swiftly attained.\nTransforming water and fire, clad in azure-feathered robes,\nsoaring through the Great Void, roaming to the Purple Court.\nLifespan aligns with the Three Luminaries, enduring through ten thousand kalpas of long age.\n\nConclude by drawing in black qi and swallowing five times, then ingest the twelve-character vermilion-script jade talisman of the north.\nThese twelve characters are the names of the northern Five Qi Mystic Heaven.\nTo guide and absorb the Five Qi of the Black Emperor and consume the Mystic Teeth, write all in vermilion on white paper, visualize fully, then suddenly ingest.\nRegularly at cock’s crow, when yang light first divides, face north, click the teeth five times, rub the palms until warm, and wipe the face and eyes five times. Look upward and recite:\nThe northern Mystic Essence, consumed as Mystic Nourishment,\ndrunk as Jade Elixir.\n\nConclude by running the tongue along the outer surface of the lower teeth, licking the lips, rinsing the mouth until Jade Spring fills it, swallowing three times, then drawing in black qi five times to settle within the kidney palace. Thus the method is complete.\n\nFor all who cultivate the Five Chapters of the Numinous Treasure’s true writs, visualize the spirits and invoke the immortals—whatever desires they seek shall be granted in due time. The Perfected of the Nine Heavens will attend their chamber, and they shall attain the body of divine immortality. This should be performed on the days of *jiǎyín* or *yǐmǎo* after the Beginning of Spring: bathe, purify, and fast, then at dawn enter the chamber, face east, bow nine times, sit upright, and click the teeth nine times to awaken the body’s spirits.\n\nConclude by closing the eyes and visualizing the Azure Emperor Lord of Mount Tai in the East, his surname, personal name, and style; his form nine inches and nine-tenths in height, crowned with a sapphire jade *tongtian* diadem, clad in an azure-feathered flying robe, riding a green dragon, attended by twelve Jade Maidens of the Azure Waist. From the east he descends into your chamber. After a long while, the Azure Emperor transforms into the form of a newborn infant within a cloud of green qi, following the qi into your mouth and proceeding directly to the liver. Visualize the heart generating red qi to encircle and envelop the liver palace; the green and red qi blend in primordial chaos, layering like auspicious clouds of intertwining mist. Feel the liver suffused with warmth, then swallow nine times. Look upward and recite:\n\nThe Nine Gates of the Azure Heaven,\nwithin resides the Primordial Sovereign.\nExiting and entering the Three Clarities, reveling in the Flowery Chambers.\nPacifying and guarding the numinous peak, dispatching and directing Goumang.\nAbove, governing the azure mists, nine thousand myriad layers.\nDrawn by a feathered chariot, twelve flying dragons.\nTo the left, the Azure-Waisted attend; to the right, divine youths guard.\nHolding jade tablets and scrolls, inscribed with azure writs.\nVerifying and recording immortal names, reporting to the Upper Palace.\nToday is most auspicious; I present my petition.\nMy body bears the vermilion script, my name enters the imperial hall.\nI vow to attain the divine, I vow to become immortal—\npray record me in the celestial registers.\nTurn your cloud-borne chariot, descend into my chamber.\nThe Three Qi merge and blend, transforming into an infant’s form.\nPacify and govern the liver palace, summoning radiant splendor.\nNuminous brilliance flows and bathes, my face assumes a golden countenance.\nSeated, I attain spontaneity, communing with the divine.\nMy body achieves longevity, boundless as heaven and earth.\n\nConclude by drawing in green qi and swallowing nine times. Practicing this method for nine years will summon nine Jade Maidens of the Azure Waist and the divine officials of Mount Tai in the East to descend, conveying your prayers and fulfilling all wishes. Petitions ascend to the Nine Heavens, and the karmic records of your parents’ transgressions—assigned as servitude to Mount Tai—shall be dissolved. The divine and the mortal will be newly bound, sins erased, and you shall ascend to the Hall of Blessings. This method is wondrous and profound, a bridge between life and death.\n\nRegularly on the days of *bǐngwǔ* or *dīngsì* after the Beginning of Summer: bathe, purify, and fast, then at noon enter the chamber, face south, bow three times, sit upright, and click the teeth three times to awaken the body’s spirits.\n\nConclude by closing the eyes and visualizing the Vermilion Emperor Lord of Mount Heng in the South, his surname, personal name, and style; his form three inches and three-tenths in height, crowned with a cinnabar jade *tongtian* diadem, clad in a vermilion-feathered flying robe, riding a red dragon, attended by twelve Jade Maidens of the Vermilion Jade. From the south he descends into your chamber. After a long while, the Vermilion Emperor transforms into the form of a newborn infant within a cloud of red qi, following the qi into your mouth and proceeding directly to the heart. Visualize the spleen generating yellow qi to encircle and envelop the heart palace; the yellow and red qi blend in primordial chaos, blazing like the radiant light of flames. Feel the heart suffused with warmth, then swallow three times. Look upward and recite:\n\nThe Three Qi of the Cinnabar Heaven,\nthe southern Jade Gate above.\nWithin resides the Great Spirit, the Vermilion Emperor, Numinous Lord.\nClad in cinnabar, bearing talismans, flying script on feathered skirts.\nRiding a crimson dragon, jade reins descending through clouds.\nOn the numinous peak of Mount Heng in the south, myriad spirits hold him in highest reverence.\nExiting and entering the Three Clarities, ascending to feast in the Nine Mysteries.\nThe Vermilion Jade attend and serve; jade youths guard the true.\nHolding jade tablets and records, inscribed with crimson registers.\nVerifying and recording immortal ranks, reporting their weight to the heavens.\nToday, Great King, the numinous peak opens the path to immortality.\nTurn your exalted spirit, descend through my three gates.\nTransform into an infant, pacifying the heart and settling the hun-soul.\nThe two qi merge and blend, entwining my life’s root.\nEver with Zhurong, riding the luminous clouds,\nroaming the southern slopes, enduring as heaven and earth.\n\nConclude by drawing in red qi and swallowing three times. Practicing this method will summon the divine officials of Mount Heng in the South to descend, dispatching three Jade Maidens of the Vermilion Jade to serve you, conveying petitions and fulfilling all requests. The karmic records of your parents’ transgressions—assigned as servitude to Mount Heng—shall be dissolved, punishments released, and names expunged, ascending to the celestial offices. This method is wondrous and profound, unlocking the passage between life and death.\n\nRegularly on the days of *wùchén*, *wùxū*, *jǐchǒu*, or *jǐwèi* after the Spring Equinox, Summer Solstice, Autumn Equinox, or Winter Solstice: bathe, purify, and fast, then at sunrise enter the chamber, face the sovereign, bow twelve times, sit upright, and click the teeth twelve times to awaken the body’s spirits.\n\nClose your eyes and visualize the Yellow Emperor of the Central Peak, Mount Songgao—his surname, given name, and courtesy name—standing twelve inches tall, crowned with a Yellow Jade *Tongtian* Treasure Diadem, clad in a yellow feathered flying robe, riding a yellow dragon. Twelve Yellow Plain Jade Maidens accompany him as he descends from the Central Peak into your chamber. After a while, the Yellow Emperor transforms into the form of a newborn infant, nestled within yellow qi, which follows the breath into your mouth and proceeds directly to the Spleen Palace. Envision the lungs generating white qi to encircle and envelop the Spleen Palace, where the yellow and white qi intermingle in primordial chaos, swirling like yellow clouds across the heavens. When you feel a warm sensation suffusing the spleen, swallow twelve times.\n\nThen recite the prayer while looking upward:\n*\"Central Heaven’s Yellow Origin, sovereign of the Four Numinous Ones,\nMountain of Wu and Ji, primordial essence of the Supreme Beginning.\nGreat God Yellow Emperor, riding a flying chariot,\nTwelve Yellow Dragons ascend to feast in the Three Clarities.\nJade Maidens attend as guards, divine youths serve as messengers.\nUnsealing the mountain to inspect the charts, recording immortals’ names for confirmation.\nRoaming the Central Peak, white jade unfurls its numen.\nReturning in a winding descent, streaming to irrigate my form.\nMerging and transforming, the aged emperor becomes an infant.\nSecurely settled in the Yellow Palace, the treasury flourishes in splendor,\nMy body sprouts wondrous hairs, radiant within and without.\nTrue ones commune, pathways open to the Nine Clarities—\nMy heart attains the yellow chariot, soaring to the Jade Court.\"*\n\nConclude by drawing in yellow qi and swallowing twelve times.\n\nPracticing this method will summon the divine officials of the Central Peak’s Five Emperors to descend into your chamber, dispatching twelve Yellow Plain Jade Maidens to serve as your spirit-mediums, opening the gates to report your prayers to the Nine Heavens. The karmic records of your parents’ transgressions—assigned as servitude to the Central Peak—shall be dissolved, punishments released, and names expunged, ascending to the immortal registers. Freed from the Earthly Offices, they rise into the Hall of Blessings, unlocking the passage between life and death and bestowing boundless deliverance.\n\nRegularly on the days of *gēngshēn* or *xīnyǒu* after the Beginning of Autumn: bathe, purify, and fast, then at dusk enter the chamber, face west, bow seven times, sit upright, and click the teeth seven times to awaken the body’s spirits. Close your eyes and visualize the White Emperor of the Western Peak, Mount Huayin—his surname, given name, and courtesy name—standing seven inches and seven parts tall, crowned with a White Jade *Tongtian* Treasure Diadem, clad in a white feathered flying robe, riding a white dragon. Twelve White Plain Jade Maidens accompany him as he descends from the Western Peak into your chamber. After a while, the White Emperor transforms into the form of a newborn infant, nestled within white qi, which follows the breath into your mouth and proceeds directly to the Lung Palace. Envision the kidneys generating black qi to encircle and envelop the Lung Palace, where the white and black qi intermingle in primordial chaos, layering like auspicious clouds across the heavens. When you feel a warm sensation suffusing the lungs, swallow seven times.\n\nThen recite the prayer while looking upward:\n*\"Heaven of the Seven Qi, golden hall of the White Sovereign,\nGreat God White Emperor, securely settled in the West.\nSpiritual mountain of Huayin, hailed as the Divine King.\nWhite feathered skirts flutter, banners command the dragons,\nRoaming the dark azure, entering and exiting the Flowery Palace.\nOverseeing the immortal registers, arranging the records of all directions.\nOn this auspicious day, the myriad sages feast upon the peaks,\nRoaming the Nine Radiant Clouds, scattering their luminous glow.\nGolden essence gleams, white stones surge in abundance.\nUnsealing the mountain to observe the numen, spirits spread to the four quarters.\nWishing for the Dao, wishing for immortality,\nWishing for life, wishing for longevity.\nWhen the supreme wish is fulfilled, naught shall not prosper.\nGathering and refining the perfected, transforming my form,\nChanging and completing myself, soaring in unison with qi.\nMy body flies, my bones grow light, ascending to the Purple Chamber.\"*\n\nConclude by drawing in white qi and swallowing seven times.\n\nPracticing this method will summon the divine officials of the Western Peak’s White Emperor to descend in truth, dispatching seven White Plain Jade Maidens to serve as your spirit-mediums, opening the gates to report all your prayers to the Nine Heavens. The karmic records of your parents’ transgressions—assigned as servitude to the Western Peak—shall be dissolved, punishments released, and names expunged, ascending to the immortal registers. Freed from the Five Paths, they rise eternally into the Hall of Blessings, unlocking the passage between life and death, with blessings arriving naturally.\n\nRegularly on the days of *rénzǐ* or *guǐhài* after the Beginning of Winter: bathe, purify, and fast, then at midnight enter the chamber, face north, bow five times, sit upright, and click the teeth five times to awaken the body’s spirits. Close your eyes and visualize the Black Emperor of the Northern Peak, Mount Heng—his surname, given name, and courtesy name—standing five inches and five parts tall, crowned with a Dark Jade *Tongtian* Treasure Diadem, clad in a black feathered flying robe, riding a black dragon. Twelve Great Mysterious Jade Maidens accompany him as he descends from the Northern Peak into your chamber. After a while, the Black Emperor transforms into the form of a newborn infant, nestled within black qi, which follows the breath into your mouth and proceeds directly to the Kidney Palace. Envision the liver generating blue-green qi to encircle and envelop the Kidney Palace, where the blue-green and black qi intermingle in primordial chaos, swirling like azure clouds in the distant mist. When you feel a warm sensation suffusing the kidneys, swallow five times.\n\nThen recite the prayer while looking upward:\n*\"Heaven of the Five Qi, primordial essence flowing from the Supreme Beginning...\"*\n\nGather qi and congeal spirit, calling it the Immortal Hut.\nSecurely settled at Northern Heng, where the Black Emperor roams.\nWandering and feasting in the northern wastes, riding a dragon-drawn chariot.\nToday is most auspicious—ten thousand spirits unfurl the chart.\nThe Five Qi linger and circle; felicitous clouds spread in all four directions.\nImmortal youths hold tablets, the Supreme Mystery transmits the talisman.\nInscribe my name in the immortal register, inscribed in golden script above.\nReturning to the true and winding descent, merging with the infant form.\nThe two qi intertwine and weave, thoroughly irrigating my body.\nThe Dark and Hidden leads by the hand, with immortals as companions.\nEternally partaking of Heaven and Earth, through ten thousand kalpas without end.\n\nConclude by drawing in black qi and swallowing five times.\n\nPracticing this Way, the numinous officials of Northern Heng and the Black Emperor descend in truth, sending five Supreme Mystery Jade Maidens to serve and command. Through them, all prayers and petitions ascend to the Nine Heavens. The records of sins and punishments binding one’s parents to Northern Heng are all dissolved, allowing passage beyond the Three Evil Paths, ascending to the Heavenly Palace. This is the most wondrous and supreme method, universally delivering boundless beings.\n\nPracticing this Way, one must always maintain a serene mind and focused intent, clearly directing attention. The numinous and true readily respond, and one attains the proper method. Within a year, one will witness spirits coming and going in all directions, with heavenly officials receiving and escorting. Demonic spirits disperse and submit, daring not approach. The mind becomes keen and the intellect sharp, discerning fortune and misfortune. The Five Peaks and Five Emperors become constant companions, and divine communication is established, effortlessly attaining immortality.\n\nHere ends the *Essential Instructions on the Talismanic Petition of the Supreme Mystery Wondrous Treasure*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝投简符文要诀 经名：太上洞玄灵宝投简符文要诀。 撰人不详，约出於南北朝或隋唐。 摘录古《灵宝经》 改编而成，言书符投简除罪之法。 一卷。 底本出处：《正统道藏》洞玄部神符类。 太上洞玄灵宝投简符文要诀 常以鸡鸣阳光始分，东向叩齿九通，摩两掌令热，以手掌拭面目九过，仰祝服青牙。 南方南向，亦如上法，叩齿三通。 西方西向七通，如上法。 中央十二通叩齿，拭面目。 北方五通，一如上法。 常以鸡鸣，安身定神，以次行事，先服东方青牙气，次南方，次中央，次西方，次北方，如上法。 五帝毕，便叩齿三十六通，咽气二十五过止。 又都咒曰： 白石岩岩以次行，源泉涌洞以玉浆，饮之长生，寿命益长。 毕，以舌料口上下中央，令玉泉满口而三咽，又引气二十五过，极气而咽之，其道都毕。 服五云牙之法，别卷写之。 天真皇人曰：凡修飞仙之道，及灭度之法，尸解隐化，轮转生死，随运逍遥，无拘太阴，当朱书诸天玉字无量内音，白素佩身，随文服御，心不受秽，五内清和，六府恬寂，空碧无为，八年洞达诸天，坐见十方，万神交降，体生玉光，驰骋龙驾，白日登晨。 玉章上道，四万劫一传，修行之法，当依上朱书，随四时之节。 春正月、二月、三月，朱书文，向王叩齿九通，祝曰： 飞天大梵，维罗八方。 九气青天，总为神王。 五合八会，流焕太空。 上开龙汉，神仙之宗。 下披长夜，九幽之房。 拔度苦魂，朽骸生光。 身变毛羽，五色衣裳。 苍龙碧辇，飞步空行。 今日上告，青天始阳。 万愿皆合，与气齐同。 升入无形，永保无穷。 毕，服文，仰咽八气止。 夏四月、五月、六月，朱书文，向王叩齿八通，祝曰： 天书敷罗，梵行赤明。 上开八道，五合通灵。 大运启期，洞阳炼精。 玉文焕朗，三景自明。 下度生死，一切受形。 今日良吉，大圣临庭。 九夜开牖，幽房朗清。 三恶休息，我道自成。 五帝保度，上登华京。 七宝林中，长享劫龄。 毕，服文，仰咽八气止。 秋七月、八月、九月，朱书文，向王叩齿七通，祝曰： 飞玄八会，结气成真。 六十四字，总灵天根。 开度生死，朽骨还人。 幽魂披散，受气上玄。 今日时庆，万愿开陈。 众灵交会，我愿我仙。 景与道合，我愿我神。 得乘素云，上升帝晨。 七宝欢乐，交友真人。 毕，服文，仰咽八气止。 冬十月、十一月、十二月，朱书文，向王叩齿五通，祝曰： 玉字开冥，流焕上门。 八气结真，梵行景云。 神王启光，三象洞分。 五色徘徊，昭一我灵魂。 今日值合，仰希帝君。 开宥出书，授我真文。 玉泽交灌，五府生熏，毛羽变化，驾景乘晨。 出幽入无，仙度自然。 七祖同归，欢乐上元。 毕，服文，仰咽八气止。 天真皇人曰：此祝说之辞，皆四会之气，八和之音，自然之章，行之者上天遥唱，三界设礼，万神束带，侍卫灵文也。 随节服御，祝说咽气，百日诸天记录，地官削简，八年神真自降，体生玉光，洞达幽虚，坐睹自然，死尸更生，反胎还人，转轮不灭，生死得仙。 道尊法妙，万劫一行，轻泄漏慢，身负河源，风刀万劫，终不得仙，明真旧格，宜秘之焉。 东方青天出入游行，常当叩齿九通，思九色之龙导从前后，青云九重覆匝身形，密祝曰：",
      "translated_text": "**The Supreme Cavern Mystery Numinous Treasure Essentials of Petitioning with Talismanic Writs**\n\n**Scripture Title:** *The Supreme Cavern Mystery Numinous Treasure Essentials of Petitioning with Talismanic Writs*. Author unknown, likely composed during the Northern and Southern Dynasties or Sui-Tang period. An abridged and adapted version of ancient *Scriptures of the Numinous Treasure*, detailing methods for inscribing talismans and petitioning with writs to absolve sins. One fascicle.\n\n**Source:** *Daoist Canon of the Zhengtong Era*, Cavern Mystery Section, Numinous Talismans Category.\n\n---\n\n**The Supreme Cavern Mystery Numinous Treasure Essentials of Petitioning with Talismanic Writs**\n\nAt cock’s crow, when yang light first divides, face east and knock the teeth nine times. Rub both palms until warm, then wipe the face and eyes nine times with the hands. Look upward and recite while ingesting the Azure Tooth qi.\n\nFor the south, face south and follow the same method, knocking the teeth three times.\nFor the west, face west and do so seven times, as above.\nFor the center, knock the teeth twelve times and wipe the face and eyes.\nFor the north, five times, following the same method.\n\nAlways at cock’s crow, settle the body and stabilize the spirit, then proceed in order: first ingest the Azure Tooth qi of the east, then the south, then the center, then the west, then the north, as above. When the Five Thearchs are complete, knock the teeth thirty-six times and swallow qi twenty-five times to conclude.\n\nThen recite the general incantation:\n*\"White rocks, towering in sequence,\nSpring founts surge forth with jade nectar.\nDrink of it and attain long life,\nLifespan ever extending.\"*\n\nWhen finished, roll the tongue around the upper and lower mouth and center, filling the mouth with jade springwater, then swallow three times. Again draw qi twenty-five times, swallowing it fully—thus the Dao is complete.\n\nThe method for ingesting the Five Cloud Teeth is recorded in a separate fascicle.\n\nThe Heavenly Perfected Sovereign says: For those cultivating the Dao of flying transcendence, the method of liberation, corpse-liberation and concealed transformation, or the revolving cycles of life and death—roaming freely without constraint in the Great Yin—one must vermilion-inscribe the Jade Characters of the Myriad Heavens’ Ineffable Inner Sounds upon white silk, wear it upon the body, and ingest it according to the text. The heart remains unstained by defilement; the five viscera are harmoniously clear; the six palaces are tranquil and still. Abiding in empty azure and non-action, after eight years one penetrates all heavens, sits and beholds the ten directions, and myriad spirits descend in communion. The body generates jade radiance, and one gallops upon dragon chariots, ascending at dawn.\n\nThe transmission of the Jade Chapters of the Supreme Dao occurs once every forty thousand kalpas. The method of practice requires following the above vermilion-inscribed texts according to the seasons’ nodes.\n\n**Spring (First, Second, Third Months):**\nVermilion-inscribe the writ, face the Thearch, and knock the teeth nine times. Recite:\n*\"Great Brahmā of Flying Heaven, Vairāja of the Eight Directions,\nNine Qi Azure Heaven, all become divine kings.\nFive Unions and Eight Assemblies, flowing and resplendent in the Great Void.\nAbove, they open the Dragon Han, ancestral lineage of divine transcendents.\nBelow, they part the long night, chambers of the Nine Darks.\nThey deliver suffering souls, making withered bones glow with life.\nThe body transforms into feathers, clad in five-colored raiment.\nAzure dragons and jade carriages, soaring through empty space.\nToday I make this supplication to the Azure Heaven’s dawning yang.\nMay all vows be fulfilled, harmonizing with qi as one.\nAscend into formlessness, eternally preserved without end.\"*\n\nWhen finished, ingest the writ and swallow qi eight times to conclude.\n\n**Summer (Fourth, Fifth, Sixth Months):**\nVermilion-inscribe the writ, face the Thearch, and knock the teeth eight times. Recite:\n*\"Heavenly writs spread in arrays, Brahmā practices in Crimson Clarity.\nAbove, they open the Eight Paths; the Five Unions communicate with spirits.\nThe Great Cycle initiates its term; the Cavern Yang refines essence.\nJade texts gleam and shine; the Three Luminaries illuminate themselves.\nBelow, they deliver life and death, all who receive form.\nToday is most auspicious; the Great Sage attends the court.\nNine nights open the windows; dark chambers grow bright and clear.\nThe Three Evils cease; my Dao naturally fulfills.\nThe Five Thearchs protect and deliver, ascending to the Flourishing Capital.\nIn the Seven Treasures Grove, eternally enjoying kalpas of longevity.\"*\n\nWhen finished, ingest the writ and swallow qi eight times to conclude.\n\n**Autumn (Seventh, Eighth, Ninth Months):**\nVermilion-inscribe the writ, face the Thearch, and knock the teeth seven times. Recite:\n*\"Flying Mystery’s Eight Assemblies, congealing qi to form perfection.\nSixty-four characters, root of the Numinous Heaven.\nThey open and deliver life and death, restoring withered bones to humanity.\nDark souls disperse, receiving qi from the Supreme Mystery.\nToday is a time of celebration; ten thousand vows unfold.\nMyriad spirits gather in communion; I vow to become transcendent.\nScenery unites with the Dao; I vow to become divine.\nAttaining to ride upon plain clouds, ascending to the Thearch’s dawn.\nDelighting in the Seven Treasures, befriending perfected beings.\"*\n\nWhen finished, ingest the writ and swallow qi eight times to conclude.\n\n**Winter (Tenth, Eleventh, Twelfth Months):**\nVermilion-inscribe the writ, face the Thearch, and knock the teeth five times. Recite:\n*\"Jade characters open the dark; flowing and resplendent, they ascend the gate.\nEight qi congeal perfection; Brahmā practices in luminous clouds.\nDivine kings initiate radiance; the Three Images part the Cavern.\nFive colors drift and linger, illuminating my soul alone.\nToday, in timely convergence, I look upward to the Thearch.\nOpen and pardon, issue the writ, bestow upon me the true text.\nJade moisture intermingles and irrigates; the five palaces generate fragrance.\nFeathers transform; I ride the luminous chariot at dawn.\nEmerging from darkness into formlessness, transcendence occurs naturally.\nSeven ancestors return together, rejoicing in the Upper Prime.\"*\n\nWhen finished, ingest the writ and swallow qi eight times to conclude.\n\nThe Heavenly Perfected Sovereign says: These recitations are the qi of the Four Assemblies and the sounds of the Eight Harmonies, natural chapters. Those who practice them will have the distant heavens echo their chants; the Three Realms prepare rites; myriad spirits gird their sashes and attend the numinous writs.\n\nIngesting according to the seasonal nodes, reciting, and swallowing qi—after a hundred days, the heavens record it, the Earth Officials erase the ledgers. After eight years, divine perfected beings descend of their own accord. The body generates jade radiance, penetrating the dark and empty. Sitting, one beholds the natural; the dead corpse revives, returning to the womb and becoming human again. The revolving wheel ceases not; in life and death, one attains transcendence.\n\nThe Dao is revered, the method wondrous—practiced once in ten thousand kalpas. Those who lightly divulge or carelessly reveal it will bear the burden of the river’s source, suffering the wind-knives for ten thousand kalpas, never attaining transcendence. The ancient statutes of the Illuminated Perfected decree that this must be kept secret.\n\nWhen entering and exiting the Azure Heaven of the East, one should always knock the teeth nine times, envisioning nine-colored dragons leading and following, with nine layers of azure clouds enveloping the body. Secretly recite:",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1264,
      "start_sentence": 0,
      "end_sentence": 70,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.65259051322937,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\神符类\\太上洞玄灵宝投简符文要诀.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "赤明开图，八气回真，总统玄简，青帝大神，流化九外，缠绵我身，灵音八书，六十四篇，洞明天地，与我合仙，运致龙驾，上升帝轩。 毕，引气九咽止。 南方赤天出入游行，常当叩齿三通，思朱鸟凤凰翻翔其前，绛云三垂覆匝身形，密咒曰： 三气徘徊，云凤来飞，玉音八字，焕烂紫微，日吉大庆，我道洞开，朱丹哺饴，仰噏灵晖，身生水火，绛被羽衣，登空玄步，足践凤梯，周旋八天，七世相随。 毕，引气三咽止。 西方素天出入游行，常当叩齿七通，思白虎狮子导引左右，素云七重覆匝身形，密咒曰： 七气会灵，八天尊神，白虎策辇，狮子捧辕，七气缠绵，炼我成仙，身发金光，肺映素云，内外变化，升入洞门，七祖出夜，九幽放魂！ 三徒五苦，长斩恶根，同欢福舍，受庆自然，亿劫开度，随运长存。 毕，引气七咽止。 北方玄天出入游行，常当叩齿五通，思飞龟羽盖蓊郁左右，玄云五重覆匝身形，神童玉女羽衣飞裳，侍卫前后，密祝曰： 玄天徘徊，流景上清，大有启运，八字高明，飞玄澄虚，洞音自生，五气缠绵，灌我身形，冠带北军，受炼洞灵，肾府化仙，内外光精，飞行三界，遨宴紫庭，七祖同庆，欢乐劫龄，七宝林中，反胎更形，长夜灭死，南官记名，黄箓白简，世世长生。 毕，引气五咽止。 子审欲为道，神仙不死，当先去三虫，心下伏尸，日三百六十息食气，三十通一咽，九十通一休息，日四为之。 常以夜半鸡鸣祝曰：东方青牙，服食青牙，饮以朝华。 三咽止。 南方朱丹，服食朱丹，饮以丹池。 三咽止。 中央之野，昂昂太山，服食元气，饮以醴泉。 三咽止。 西方明石，服食明石，饮以灵汋。 三咽止。 北方玄滋，服食玄滋，饮以玉饴。 三咽止。 如此三十日，三虫皆死，伏尸走去，正神正气自安，伏尸不复还心中，兆自仙矣。 右二十四字，主召九天上帝，神仙图录。 学仙道者，常以本命甲子立春之日，青书白银木刺，记年月姓名，投於绝岩之下，九年仙官到，便得真仙。 右三十二字，常以本命甲子立夏之日，朱书三十二字於白刺，上记姓名年月，投灵山之岳，九年仙官到，便得飞仙。 右四十字，主神仙玉简。 常以本命甲子春分夏至秋分冬至之日，黄书白刺，上记姓名年月日，投刺灵山之冈，九年仙官到玉女至，便仙矣。 右四十八字，常以本命甲子立秋之日，白书於刺上，投名岳之上，如上法。 右四十字，主诸真人神仙之图录。 学仙道士，常以本命甲子立冬之日，黑书白刺上，记姓名年月於刺下，投灵山之岳，五年仙官到，使太玄玉女五人，名上仙籍。 修养青牙，导引东方九气青天之法，常以立春日鸡鸣，入室东向九礼毕，平坐叩齿九通，思东方安宝华林青灵始老君，姓爓，讳开明，字灵威仰，形长九寸，头戴青精玉冠，衣九气青羽飞衣，驾乘苍龙之舆，建鸨布老切旗，从神甲乙胡老之官九十万人，从九气青天中下，来降室内，须臾化生青气，郁郁如云之杳烟，贯覆己形，从口中而入，直下肝府。 又思木星焕明东方，光照我身，皆令分明。 竟便开目，仰祝曰： 九气青天，元始上精。 皇老尊神，衣服羽青。 役御天官，焕明岁星。 散晖流芳，陶溉我形。 上餐朝霞，服引木精。",
      "translated_text": "The Crimson Clarity unfolds the Chart, the Eight Qi return to the True. Governing the Mystic Tablet, the Great Divine Lord of the Azure Thearch, his transformative flow extends beyond the Nine Realms, entwining my body. The numinous sounds of the Eight Scripts, sixty-four chapters in all, illumine Heaven and Earth, merging with me to attain transcendence. The dragon-drawn chariot arrives, ascending to the imperial terrace.\n\nThis done, draw in qi and swallow nine times to conclude.\n\nWhen entering and exiting the Vermilion Heaven of the South, one should always knock the teeth three times, envisioning the Vermilion Bird and phoenix soaring ahead, with three layers of crimson clouds enveloping the body. Secretly recite:\n\nThe Three Qi linger and return, clouds and phoenix come in flight. The Jade Tone’s eight characters blaze in the Purple Tenuity. On this auspicious day of great rejoicing, my Dao opens wide. I partake of cinnabar’s sweet nectar, inhaling the numinous radiance. My body generates water and fire, clad in crimson and feathered robes. Ascending the void with mystic steps, my feet tread the phoenix ladder. Circling the Eight Heavens, seven generations follow in my wake.\n\nThis done, draw in qi and swallow three times to conclude.\n\nWhen entering and exiting the White Heaven of the West, one should always knock the teeth seven times, envisioning the White Tiger and lion guiding left and right, with seven layers of white clouds enveloping the body. Secretly recite:\n\nThe Seven Qi gather the numinous, the Eight Heavenly Honored Gods. The White Tiger steers the chariot, the lion bears the shafts. The Seven Qi entwine me, refining me into an immortal. My body emits golden radiance, my lungs reflect the white clouds. Inner and outer transform, ascending into the Cavernous Gate. Seven ancestors escape the night, the Nine Darks release their souls!\n\nThe Three Calamities and Five Sufferings are severed forever, cutting away evil roots. Together they rejoice in the abode of blessings, receiving the felicity of the natural. For a hundred million kalpas, they attain deliverance, enduring with the turning of the ages.\n\nThis done, draw in qi and swallow seven times to conclude.\n\nWhen entering and exiting the Mysterious Heaven of the North, one should always knock the teeth five times, envisioning the soaring tortoise and feathered canopy flourishing left and right, with five layers of black clouds enveloping the body. Divine lads and jade maidens in feathered robes and flying garments attend before and behind. Secretly recite:\n\nThe Mysterious Heaven lingers and returns, streaming light to the Upper Clarity. The Great Possession initiates its course, the eight characters exalted and bright. The soaring mystery settles into emptiness, the Cavernous Tone arises spontaneously. The Five Qi entwine me, irrigating my form. Crowned and girded with the Northern Host, I receive refinement in the Cavernous Numinous. My kidney palace transforms into an immortal, inner and outer radiant with essence. Flying through the Three Realms, I roam and feast in the Purple Court. Seven ancestors rejoice together, delighting in kalpas of age. In the Forest of Seven Treasures, I return to the womb and renew my form. The long night vanishes in death, the Southern Bureau records my name. On the Yellow Register and White Tablet, I attain eternal life through the ages.\n\nThis done, draw in qi and swallow five times to conclude.\n\nIf one truly desires the Dao, to become an immortal and never die, one must first expel the Three Worms and the corpse-crawling parasite beneath the heart. Each day, perform 360 breath-cycles of qi-ingestion, swallowing once every thirty cycles, resting once every ninety cycles, and doing this four times daily.\n\nRegularly at midnight and cock’s crow, recite:\n\nIn the East, the Azure Molar—consume the Azure Molar, drink from the Morning Flower.\n\nThis done, swallow three times to conclude.\n\nIn the South, the Vermilion Cinnabar—consume the Vermilion Cinnabar, drink from the Cinnabar Pool.\n\nThis done, swallow three times to conclude.\n\nIn the Central Wilds, the towering Mount Tai—consume the Primordial Qi, drink from the Sweet Spring.\n\nThis done, swallow three times to conclude.\n\nIn the West, the Luminous Stone—consume the Luminous Stone, drink from the Numinous Brook.\n\nThis done, swallow three times to conclude.\n\nIn the North, the Mysterious Nourishment—consume the Mysterious Nourishment, drink from the Jade Nectar.\n\nThis done, swallow three times to conclude.\n\nAfter thirty days of this practice, the Three Worms will die, the corpse-crawling parasite will depart, and the true spirit and true qi will settle naturally. The corpse-crawling parasite will no longer return to the heart, and you shall become an immortal.\n\nThe twenty-four characters above summon the Nine Heavenly Thearchs and the registers of divine immortals.\n\nThose who study the Dao of immortality should, on the first *jiazi* day of their life cycle coinciding with the Beginning of Spring, inscribe in green on a white poplar tablet their year, month, and name, then cast it beneath an isolated cliff. After nine years, the immortal officials will arrive, and you shall attain true transcendence.\n\nThe thirty-two characters above should be inscribed in vermilion on a white tablet on the first *jiazi* day of one’s life cycle coinciding with the Beginning of Summer, recording one’s name, year, and month, then cast upon a sacred mountain’s peak. After nine years, the immortal officials will arrive, and you shall attain flying transcendence.\n\nThe forty characters above govern the Jade Tablets of divine immortals. Regularly on the first *jiazi* day of one’s life cycle coinciding with the Spring Equinox, Summer Solstice, Autumn Equinox, or Winter Solstice, inscribe in yellow on a white tablet, recording one’s name, year, month, and day, then cast it upon a sacred mountain’s ridge. After nine years, the immortal officials and jade maidens will arrive, and you shall attain transcendence.\n\nThe forty-eight characters above should be inscribed in white on a tablet on the first *jiazi* day of one’s life cycle coinciding with the Beginning of Autumn, then cast upon a famous mountain’s peak, following the method above.\n\nThe forty characters above govern the registers of all Perfected Ones and divine immortals.\n\nDaoist practitioners should, on the first *jiazi* day of their life cycle coinciding with the Beginning of Winter, inscribe in black on a white tablet, recording their name, year, and month at the tablet’s base, then cast it upon a sacred mountain’s peak. After five years, the immortal officials will arrive, dispatching five Jade Maidens of the Great Mystery, and your name shall be inscribed in the registers of immortals.\n\nTo cultivate the Azure Molar and practice the method of guiding the Nine Qi of the Azure Heaven of the East, regularly at cock’s crow on the day of the Beginning of Spring, enter the chamber, face east, and perform nine bows. Seated evenly, knock the teeth nine times, envisioning the Azure Numinous First Elder Lord of the Peaceful Treasure Flower Grove in the East—surnamed Yan, named Kai Ming, styled Ling Wei Yang—his form nine inches tall, wearing a crown of azure essence-jade, clad in a nine-qi azure feathered flying robe, riding a chariot drawn by green dragons, bearing the *baobu* banner, attended by the nine hundred myriad officials of the Jia-Yi Hu-Lao’s Bureau, descending from the Nine Qi Azure Heaven into the chamber. In an instant, he transforms and generates azure qi, dense as clouded mist, enveloping your form and entering through the mouth, descending directly into the liver palace.\n\nNext, envision Jupiter shining brightly in the East, its light illuminating your body, all made distinct and clear. Then open your eyes and recite while looking upward:\n\nNine Qi Azure Heaven, primordial essence of the Highest Beginning.\nAugust Elder Divine Lord, clad in feathered azure.\nCommanding the celestial officials, Jupiter shines resplendent.\nScattering radiance and streaming fragrance, refining and irrigating my form.\nAbove, I feast on morning clouds; I ingest and guide the essence of wood.",
      "overlap_context": "alpas. Those who lightly divulge or carelessly reveal it will bear the burden of the river’s source, suffering the wind-knives for ten thousand kalpas, never attaining transcendence. The ancient statutes of the Illuminated Perfected decree that this must be kept secret.\n\nWhen entering and exiting the Azure Heaven of the East, one should always knock the teeth nine times, envisioning nine-colored dragons leading and following, with nine layers of azure clouds enveloping the body. Secretly recite:",
      "start_char": 1264,
      "end_char": 2522,
      "start_sentence": 71,
      "end_sentence": 110,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.119040966033936,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\神符类\\太上洞玄灵宝投简符文要诀.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "固养青牙，保镇朽龄。 肝府充溢，玉芝自生。 回年住劫，色返童婴。 五气混合，天地长并。 毕，引青气九咽止，便服束方赤书玉文十二字。 右十二字，则九气青天之名。 导引青帝九气，服食青牙，皆赤书白纸上，存思讫而顿服之。 常以鸡鸣，阳光始分，东向叩齿九通，摩两掌令热，以手掌拭面目九过，仰祝曰： 东方青牙，服食青牙，饮以朝华。 毕，便以舌料上齿之表，舐唇三过，令玉泉满口，而咽之三过，又引青气九咽，令镇肝之中，其道毕也。 修养丹牙，导引南方三气丹天之法，常以立夏之日鸡鸣，入室南向三礼毕，平坐叩齿三通，思南方梵宝昌阳丹灵真老君，姓洞浮，讳极炎，字赤飘弩，形长三寸，头戴赤帻玉冠，衣三气丹羽飞衣，驾乘丹龙玉舆，建朱旗，从神丙丁越老之官三十万人，从三气丹天中下，来降室内，须臾化生赤气，焕焕如火之明，贯覆己形，从口中而入，直下心宫。 又思火星焕明南方，光照我身，皆令分朋。 竟便开目，仰祝曰： 三气丹天，朱宫灵童。 元始上老，骖驾赤龙。 丹羽飞衣，锦帔明光。 驱策天官，运导阴阳。 三气吐晖，灌我绛宫。 赤子保镇，炼牙饰容。 朝餐朱景，玉芝满充。 回停劫年，朽骸返童。 长龄天地，永享无穷。 身生水火，变化百方。 毕，引赤气三咽止，便服南方赤书玉文十二字。 右十二字，则三气丹天之名。 导引赤帝三气，服食丹牙，皆赤书白纸上，存思讫而顿服之。 常以鸡鸣，阳光始分，南向叩齿三通，摩两掌令热，以摩拭面三过，仰祝曰： 南方朱丹，服食朱丹，饮以丹池。 毕，以舌料下齿之表，舐唇漱口，令玉泉满口，而三咽之，又引赤气三咽，令镇心宫之中，其道毕也。 修养黄牙，导引戊己十二气中黄之天，常以春分夏至秋分冬至四日鸡鸣，入室向王十二礼毕，平坐叩齿十二通，思中央玉宝元灵元老君，姓通斑，讳元氏，字含枢纽，形长一尺二寸，头戴黄精玉冠，衣五色羽衣，驾乘黄龙玉舆，建黄旗，从神戊己伧老之官十二万人，从十二气黄天中下，来降室内，须臾化生黄气，勃勃如景云之吐晖，贯覆己形，从口中而入，直下脾府。 又思土星焕明中天，光照我身，皆使分明。 便开目，仰祝曰：",
      "translated_text": "Cultivate and nourish the azure sprouts, preserving and securing decrepit age.\nThe liver palace fills to overflowing, jade mushrooms grow of themselves.\nYears reverse and kalpas halt; complexion returns to that of a child.\nThe five qi merge and harmonize, heaven and earth endure as one.\n\nWhen finished, guide the azure qi and swallow it nine times, then cease. Proceed to ingest the twelve vermilion-script jade characters of the eastern direction. These twelve characters are the names of the Nine Qi Azure Heaven. Guide and draw the Nine Qi of the Azure Emperor, and consume the azure sprouts—all inscribed in vermilion on white paper, visualized and then ingested in one draught.\n\nRegularly at cock’s crow, when yang light first divides, face east and click the teeth nine times. Rub the palms until warm, then with them wipe the face and eyes nine times. Look upward and recite:\n\nAzure sprouts of the East, consume the azure sprouts, drink of the morning radiance.\n\nWhen finished, with the tongue stroke the outer side of the upper teeth, lick the lips three times, and let jade spring fill the mouth. Swallow it three times, then guide the azure qi and swallow it nine times, allowing it to settle within the liver. Thus is the Dao complete.\n\nTo cultivate and nourish the cinnabar sprouts, guide and draw the Three Qi of the Vermilion Heaven of the South. Regularly on the day of the Summer Solstice at cock’s crow, enter the chamber, face south, and perform three bows. Sit upright and click the teeth three times. Envision the Southern Treasure of Brahma, the Radiant Yang Cinnabar Numinous True Elder Lord, whose surname is Dongfu, personal name Jiyan, and style Chifiaonu. His form is three inches in height, his head crowned with a vermilion turban and jade diadem, his body clad in a feathered flying robe of the Three Qi Vermilion. He rides a vermilion dragon-drawn jade chariot, raises a vermilion banner, and is followed by three hundred myriad officials of the Bing-Ding Yue-Lao, descending from the Three Qi Vermilion Heaven into the chamber. In an instant, he transforms and generates vermilion qi, blazing bright as the brilliance of fire, enveloping your form and entering through the mouth, descending directly into the heart palace.\n\nNext, envision Mars shining brightly in the South, its light illuminating your body, all made distinct and clear. Then open your eyes and recite while looking upward:\n\nThree Qi Vermilion Heaven, vermilion palace numinous youth.\nPrimordial Elder of the Highest Beginning, riding a chariot drawn by vermilion dragons.\nVermilion feathered flying robe, brocade mantle of radiant light.\nCommanding and directing the celestial officials, regulating and guiding yin and yang.\nThe Three Qi exhale their splendor, irrigating my crimson palace.\nThe Red Child preserves and secures; refining the sprouts adorns the countenance.\nAbove, I feast on vermilion dawn; jade mushrooms fill to abundance.\nYears reverse and kalpas halt; decrepit frame returns to youth.\nLifespan endures with heaven and earth, eternally enjoying boundless existence.\nBody generates water and fire, transforming in a hundred ways.\n\nWhen finished, guide the vermilion qi and swallow it three times, then cease. Proceed to ingest the twelve vermilion-script jade characters of the southern direction. These twelve characters are the names of the Three Qi Vermilion Heaven. Guide and draw the Three Qi of the Vermilion Emperor, and consume the cinnabar sprouts—all inscribed in vermilion on white paper, visualized and then ingested in one draught.\n\nRegularly at cock’s crow, when yang light first divides, face south and click the teeth three times. Rub the palms until warm, then with them wipe the face three times. Look upward and recite:\n\nVermilion cinnabar of the South, consume the vermilion cinnabar, drink from the cinnabar pool.\n\nWhen finished, with the tongue stroke the outer side of the lower teeth, lick the lips and rinse the mouth, letting jade spring fill the mouth. Swallow it three times, then guide the vermilion qi and swallow it three times, allowing it to settle within the heart palace. Thus is the Dao complete.\n\nTo cultivate and nourish the yellow sprouts, guide and draw the Twelve Qi of the Central Yellow Heaven of Wu-Ji. Regularly on the days of the Spring Equinox, Summer Solstice, Autumn Equinox, and Winter Solstice at cock’s crow, enter the chamber, face the center, and perform twelve bows. Sit upright and click the teeth twelve times. Envision the Central Jade Treasure Primordial Numinous Primordial Elder Lord, whose surname is Tongban, personal name Yuanshi, and style Hanshuniu. His form is one foot two inches in height, his head crowned with a yellow essence jade diadem, his body clad in a five-colored feathered robe. He rides a yellow dragon-drawn jade chariot, raises a yellow banner, and is followed by one hundred twenty myriad officials of the Wu-Ji Cang-Lao, descending from the Twelve Qi Yellow Heaven into the chamber. In an instant, he transforms and generates yellow qi, billowing forth like luminous clouds exhaling their radiance, enveloping your form and entering through the mouth, descending directly into the spleen palace.\n\nNext, envision Saturn shining brightly in the center of heaven, its light illuminating your body, all made distinct and clear. Then open your eyes and recite while looking upward:",
      "overlap_context": "t, envision Jupiter shining brightly in the East, its light illuminating your body, all made distinct and clear. Then open your eyes and recite while looking upward:\n\nNine Qi Azure Heaven, primordial essence of the Highest Beginning.\nAugust Elder Divine Lord, clad in feathered azure.\nCommanding the celestial officials, Jupiter shines resplendent.\nScattering radiance and streaming fragrance, refining and irrigating my form.\nAbove, I feast on morning clouds; I ingest and guide the essence of wood.",
      "start_char": 2522,
      "end_char": 3374,
      "start_sentence": 111,
      "end_sentence": 142,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.111215353012085,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\神符类\\太上洞玄灵宝投简符文要诀.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "中黄太山，元气徘徊。 上有元老，总统四垂。 骖驾黄龙，五色羽衣。 运导九天，转轮璇玑。 焕明土星，流光散晖。 玉英芳芝，充溢四飞。 陶灌我身，脾府鲜开。 养牙餐精，万神总归。 检魂制魄，仙炼八威。 表裹同明，常生不衰。 通真达灵，升入太微。 毕，引黄气十二咽止，便服中央赤书玉文十六字。 右十六字，则中央黄天之名。 导引黄帝十二气，服食黄牙，皆赤书白纸，存思讫，顿而服之。 常以鸡鸣，阳光始分，向王叩齿十二通，摩两掌令热，以摩拭面目十二过，仰祝曰： 中央戊己，昂昂太山，服食精气，饮以醴泉。 毕，以舌料舌下玄膺，取玉泉以舐唇，三过咽之，又引黄气十二咽，令镇脾府之中，其道毕也。 修养素牙，导引七气素天之法，常以立秋之日鸡鸣，入室西向七礼毕，平坐叩齿七通，思西方七宝金门皓灵皇老君，姓上金，讳昌开，字曜魄宝，形长七寸，头戴白精玉冠，衣白羽飞衣，驾乘白龙，建素旗，从神庚辛氏老之官七十万人，从七气素天中下，来降室内，须臾化生白气，皓皓如和云之罗天，贯覆己形，从口中而入，直下肺府。 又思金星焕明西方，光照我身，皆使分明。 便开目，仰祝曰：",
      "translated_text": "At the Central Yellow Great Mountain, the primordial qi lingers and swirls.\nAbove resides the Primordial Elder, governing the four directions.\nHe harnesses yellow dragons, clad in a five-colored feathered robe,\nGuiding the Nine Heavens, turning the wheel of the celestial pivot.\nSaturn shines resplendent, its streaming light scattering radiance.\nJade blossoms and fragrant mushrooms fill and overflow the four directions.\nThey bathe and irrigate my body, the spleen palace blooming fresh and bright.\nThey nourish the teeth and consume essence, all spirits converging in unity.\nThey inspect the hun and restrain the po, refining the eight mights of immortality.\nInner and outer shine alike, ever-living and unwaning.\nCommuning with the real and penetrating the numinous, ascending into the Grand Tenuity.\n\nWhen finished, draw in yellow qi and swallow twelve times, then ingest the sixteen-character vermilion script of the Central Jade Text. These sixteen characters are the names of the Central Yellow Heaven. Guide and lead the twelve qi of the Yellow Emperor, consume the yellow sprouts—all written in vermilion on white paper. After visualizing, suddenly ingest them.\n\nRegularly at cock’s crow, when yang light first divides, face the king, click the teeth twelve times, rub both palms until warm, and with them wipe the face and eyes twelve times. Look upward and recite:\nAt the Central Wu-Ji, the majestic Great Mountain,\nConsuming essence and qi, drinking from the sweet spring.\n\nWhen finished, stir the tongue beneath the dark jade channel, gather the jade spring to lick the lips, swallow three times, then draw in yellow qi twelve times to settle within the spleen palace. This completes the method.\n\nThe practice of cultivating plain sprouts and guiding the seven qi of the Plain Heaven’s method: regularly on the day of the Autumn Commencement at cock’s crow, enter the chamber, face west, and perform seven bows. Sit upright, click the teeth seven times, and envision the August Elder of the Western Seven-Jewel Golden Gate, personal name Shangjin, style Yaopobao, and personal name Changkai. His form is seven inches in height, his head crowned with a white essence jade diadem, his body clad in a white feathered flying robe. He rides a white dragon-drawn chariot, raises a plain banner, and is followed by seventy myriad officials of the Geng-Xin Cang-Lao, descending from the Seven Qi Plain Heaven into the chamber. In an instant, he transforms and generates white qi, billowing forth like luminous clouds veiling the heavens, enveloping your form and entering through the mouth, descending directly into the lung palace.\n\nNext, envision Venus shining brightly in the west, its light illuminating your body, all made distinct and clear. Then open your eyes and recite while looking upward:",
      "overlap_context": "enty myriad officials of the Wu-Ji Cang-Lao, descending from the Twelve Qi Yellow Heaven into the chamber. In an instant, he transforms and generates yellow qi, billowing forth like luminous clouds exhaling their radiance, enveloping your form and entering through the mouth, descending directly into the spleen palace.\n\nNext, envision Saturn shining brightly in the center of heaven, its light illuminating your body, all made distinct and clear. Then open your eyes and recite while looking upward:",
      "start_char": 3374,
      "end_char": 3840,
      "start_sentence": 143,
      "end_sentence": 162,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.810194253921509,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\神符类\\太上洞玄灵宝投简符文要诀.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "金灵七门，皓映西华。 中有素皇，元始之家。 骖驾白龙，七气峨峨。 徘徊玉门，散精朱霞。 金星吐晖，芳芝滂沲。 玄澳我身，养我素牙。 明石鲜光，万劫不殂。 服以流泉，餐以太和。 九天上帝，给以玉华。 保年驻颜，白景敷罗。 长存天地，三光同遐。 毕，引白气七咽止，便服西方赤书玉文十二字。 右十二字，则西方七气素天之名。 导引白帝七气，服食素牙，皆赤书白纸，存思讫，顿而服之。 常以鸡鸣阳光始分，西向叩齿七通，摩两掌令热，以摩拭面目七过，仰祝曰： 西方明石，服食明石，饮以灵液。 毕，以舌料齿上，舐唇漱口，令玉泉满口，便三咽之，又引白气七咽，令镇肺府之中，其道毕也。 修养玄牙，导引五气玄天之法，常以立冬之日鸡鸣，入室北向五礼毕，平坐叩齿五通，思北方洞阴朔单郁绝五灵玄老君，姓黑节，讳灵会，字隐侯局，形长五寸，头戴玄精玉冠，衣玄羽飞衣，乘黑龙玉舆，建皂旗，从神壬癸羌老之官五十万人，从五气玄天中下，来降室内，须臾化生黑气，晖晖相沓，光若流星之焕曜，贯覆己形，从口中而入，直下肾府。 又思水星焕明北方，光照我身，皆使分明。 便开目，仰祝曰：",
      "translated_text": "The Seven Golden Gates of the Numinous Spirit gleam radiantly in the Western Florescence.\nAt their center dwells the White Sovereign, the primordial household of the Origin.\nHe harnesses white dragons, the seven qi towering majestically.\nPacing the Jade Gate, he scatters luminous crimson auroras.\nVenus emits its splendor, fragrant mushrooms overflow in abundance.\nThe Mystic Grotto suffuses my body, nourishing my white sprouts.\nBright stones gleam with fresh radiance, enduring through ten thousand kalpas without decay.\nI imbibe the flowing springs, I feast upon the Great Harmony.\nThe Nine Heavens’ Lord bestows upon me jade blossoms.\nPreserving years and halting aging, the white effulgence spreads in profusion.\nAbiding long between Heaven and Earth, the Three Luminaries share eternity.\n\nConclude by drawing in white qi seven times and swallowing it. Then ingest the twelve vermilion-script jade characters of the West.\nThese twelve characters are the names of the Western Seven Qi Plain Heaven.\nFor guiding and drawing in the White Thearch’s seven qi and ingesting the white sprouts, all are written in vermilion script on white paper. After visualization, promptly consume them.\n\nRegularly at cock’s crow, when yang light first divides, face west, knock the teeth seven times, rub the palms until warm, and wipe the face and eyes seven times. Look upward and recite:\n*O Bright Stone of the West, I ingest the Bright Stone, drinking the numinous liquid.*\n\nConclude by passing the tongue over the upper teeth, licking the lips, and rinsing the mouth until jade spring fills it. Swallow it three times, then draw in white qi seven times, allowing it to settle within the lung palace. This method is complete.\n\nThe method for cultivating the Mystic Sprouts and guiding the Five Qi of the Mystic Heaven:\nRegularly on the day of the Winter Solstice at cock’s crow, enter the chamber, face north, and complete the five rites. Sit upright, knock the teeth five times, and envision the Dark Yin of the Northern Culmen, the Five Numinous Mystic Elder Lord of Solitary Obscurity, bearing the surname Black Node, personal name Linghui, style Yinhouju. His form is five inches in height, his head crowned with a dark essence jade diadem, his body clad in a dark feathered flying robe. He rides a black dragon jade chariot, raises a black banner, and is followed by fifty myriad officials of the Ren-Gui Qiang-Lao, descending from the Five Qi Mystic Heaven into the chamber. In an instant, he transforms and generates black qi, its brilliance layered and cascading like the radiance of shooting stars, enveloping your form and entering through the mouth, descending directly into the kidney palace.\n\nNext, envision Mercury shining brightly in the north, its light illuminating your body, all made distinct and clear. Then open your eyes and recite while looking upward:",
      "overlap_context": " is followed by seventy myriad officials of the Geng-Xin Cang-Lao, descending from the Seven Qi Plain Heaven into the chamber. In an instant, he transforms and generates white qi, billowing forth like luminous clouds veiling the heavens, enveloping your form and entering through the mouth, descending directly into the lung palace.\n\nNext, envision Venus shining brightly in the west, its light illuminating your body, all made distinct and clear. Then open your eyes and recite while looking upward:",
      "start_char": 3840,
      "end_char": 4306,
      "start_sentence": 163,
      "end_sentence": 182,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.267142295837402,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\神符类\\太上洞玄灵宝投简符文要诀.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "北方玄天，五气散灵。 上有大神，始老元精。 驾龙建旗，游宴上京。 是日元吉，庆灵敷荣。 飞芝流洒，滂沲四盈。 玉女玄澳，灌我身形。 肾宫充镇，朽牙坚生。 五府纳真，上通神明。 五老降接，仙道早成。 变化水火，衣服羽青。 飞行太空，游造紫庭。 寿同三景，万劫长龄。 毕，引黑气五咽止，便服北方赤书玉文十二字。 右十二字，则北方五气玄天之名。 导引黑帝五气，服食玄牙，皆赤书白纸，存思讫，顿而服之。 常以鸡鸣阳光始分，北向叩齿五通，摩两掌令热，以拭面目五过，仰祝曰： 北方玄滋，服食玄滋，饮以玉饴。 毕，以舌料下齿之表，以舌舐唇漱口，令玉泉满口，三咽，又引黑气五咽，令镇肾府之中，其道毕也。 凡修灵宝五篇真文，思神念仙，诸所求欲使时闻，九天真人诣房，身得神仙，当以立春后甲寅、乙卯日，沐浴清斋，平旦入室，东向九礼，平坐叩齿九通，关启身神。 毕闭眼，思东岳太山青帝君姓讳字，形长九寸九分，头戴青玉通天宝冠，衣青羽飞衣，驾乘青龙，从神青腰玉女十二人，从东方来降兆室，良久，青帝君化为婴儿始生之状，在青气之中，随气从兆口入，径至肝中，思心生赤气，以贯绕肝府，青赤二气混沌相着，如庆云之沓烟，觉肝中熏热，便九咽。 仰祝曰： 青天九门，中有始皇。 出入三清，遨宴华房。 安镇灵岳，役运勾芒。 上统青霞，九千万重。 骖驾羽辇，十二飞龙。 左侍青腰，右卫神童。 把执简籍，青札玉文。 校定仙名，列言上宫。 今日王吉，请陈所言。 身佩赤书，名参帝堂。 愿神愿仙，请录簿中。 上回云驾，来降我房。 三气混合，化形婴蒙。 安治肝府，招致华光。 灵晖流灌，面生金容。 坐致自然，神明交通。 身得长生，天地无穷。 毕，引青气九咽止。 行此道九年，则致青腰玉女九人，东岳泰山灵官来降，为兆通致求愿，上闻九天，生死父母罪书责役配属东岳，则神明更相系属，灭除罪名，自得解脱，升上福堂。 此法妙重，生死津梁也。 常以立夏后丙午、丁巳之日，沐浴清斋，正中入室，南向三礼，平坐叩齿三通，关启身神。 毕，闭眼，思南岳衡山赤帝君姓讳字形，长三寸三分，头戴赤玉通天宝冠，衣丹羽飞衣，驾乘赤龙，从神赤圭玉女十二人，从南方来降兆室，良久，赤帝君化为婴儿始生之状，在赤气之中，随气从兆口入，径至心中，思脾生黄气，以贯绕心宫，黄赤二气混沌相着，如炎火之烂光，觉心中熏热，便三咽。 仰祝曰： 丹天三气，南上玉门。 中有大神，赤帝灵君。 衣丹带符，飞文羽裙。 驾乘朱龙，玉举降云。 南衡灵山，万神高尊。 出入三清，上宴九玄。 赤圭侍役，玉童卫真。 把执简录，绛簿玉文。 校定仙品，轻重上闻。 今日大王，灵岳开仙。 上回高神，降我三门。 变化婴儿，镇心安魂。 混合二气，缠我命根。 长与祝融，驾乘景云。 逍遥南阿，天地长存。 毕，引赤气三咽止。 行此道，南岳衡山灵官来降，致赤圭玉女三人为兆驱使，通致启愿，万求皆从，生死父母罪书刑责配属南岳，皆得解除，刑名释散，升上天官。 其法妙重，生死开通也。 常以春分、夏节、秋分、冬节后，戊辰、戊戌、己丑、己未之日，沐浴清斋，日映入室，向王十二礼，平坐叩齿十二通，关启身神。",
      "translated_text": "In the northern Mystic Heaven of the Five Qi, numinous essence scatters and spreads.\nAbove resides the Great Spirit, the Primordial Elder of Original Essence.\nHe rides a dragon, raises his banner, and roams the Upper Capital in joyous feast.\nThis day is supremely auspicious, as radiant blessings unfold in glory.\nFlying mushrooms stream and pour, suffusing all with abundant splendor.\nJade maidens of the Mystic Gulf bathe my form,\nfilling and fortifying the kidney palace, decayed teeth firming anew.\nThe Five Palaces receive the true, ascending to commune with the divine.\nThe Five Elders descend to welcome, and the Dao of immortality is swiftly attained.\nTransforming water and fire, clad in azure-feathered robes,\nsoaring through the Great Void, roaming to the Purple Court.\nLifespan aligns with the Three Luminaries, enduring through ten thousand kalpas of long age.\n\nConclude by drawing in black qi and swallowing five times, then ingest the twelve-character vermilion-script jade talisman of the north.\nThese twelve characters are the names of the northern Five Qi Mystic Heaven.\nTo guide and absorb the Five Qi of the Black Emperor and consume the Mystic Teeth, write all in vermilion on white paper, visualize fully, then suddenly ingest.\nRegularly at cock’s crow, when yang light first divides, face north, click the teeth five times, rub the palms until warm, and wipe the face and eyes five times. Look upward and recite:\nThe northern Mystic Essence, consumed as Mystic Nourishment,\ndrunk as Jade Elixir.\n\nConclude by running the tongue along the outer surface of the lower teeth, licking the lips, rinsing the mouth until Jade Spring fills it, swallowing three times, then drawing in black qi five times to settle within the kidney palace. Thus the method is complete.\n\nFor all who cultivate the Five Chapters of the Numinous Treasure’s true writs, visualize the spirits and invoke the immortals—whatever desires they seek shall be granted in due time. The Perfected of the Nine Heavens will attend their chamber, and they shall attain the body of divine immortality. This should be performed on the days of *jiǎyín* or *yǐmǎo* after the Beginning of Spring: bathe, purify, and fast, then at dawn enter the chamber, face east, bow nine times, sit upright, and click the teeth nine times to awaken the body’s spirits.\n\nConclude by closing the eyes and visualizing the Azure Emperor Lord of Mount Tai in the East, his surname, personal name, and style; his form nine inches and nine-tenths in height, crowned with a sapphire jade *tongtian* diadem, clad in an azure-feathered flying robe, riding a green dragon, attended by twelve Jade Maidens of the Azure Waist. From the east he descends into your chamber. After a long while, the Azure Emperor transforms into the form of a newborn infant within a cloud of green qi, following the qi into your mouth and proceeding directly to the liver. Visualize the heart generating red qi to encircle and envelop the liver palace; the green and red qi blend in primordial chaos, layering like auspicious clouds of intertwining mist. Feel the liver suffused with warmth, then swallow nine times. Look upward and recite:\n\nThe Nine Gates of the Azure Heaven,\nwithin resides the Primordial Sovereign.\nExiting and entering the Three Clarities, reveling in the Flowery Chambers.\nPacifying and guarding the numinous peak, dispatching and directing Goumang.\nAbove, governing the azure mists, nine thousand myriad layers.\nDrawn by a feathered chariot, twelve flying dragons.\nTo the left, the Azure-Waisted attend; to the right, divine youths guard.\nHolding jade tablets and scrolls, inscribed with azure writs.\nVerifying and recording immortal names, reporting to the Upper Palace.\nToday is most auspicious; I present my petition.\nMy body bears the vermilion script, my name enters the imperial hall.\nI vow to attain the divine, I vow to become immortal—\npray record me in the celestial registers.\nTurn your cloud-borne chariot, descend into my chamber.\nThe Three Qi merge and blend, transforming into an infant’s form.\nPacify and govern the liver palace, summoning radiant splendor.\nNuminous brilliance flows and bathes, my face assumes a golden countenance.\nSeated, I attain spontaneity, communing with the divine.\nMy body achieves longevity, boundless as heaven and earth.\n\nConclude by drawing in green qi and swallowing nine times. Practicing this method for nine years will summon nine Jade Maidens of the Azure Waist and the divine officials of Mount Tai in the East to descend, conveying your prayers and fulfilling all wishes. Petitions ascend to the Nine Heavens, and the karmic records of your parents’ transgressions—assigned as servitude to Mount Tai—shall be dissolved. The divine and the mortal will be newly bound, sins erased, and you shall ascend to the Hall of Blessings. This method is wondrous and profound, a bridge between life and death.\n\nRegularly on the days of *bǐngwǔ* or *dīngsì* after the Beginning of Summer: bathe, purify, and fast, then at noon enter the chamber, face south, bow three times, sit upright, and click the teeth three times to awaken the body’s spirits.\n\nConclude by closing the eyes and visualizing the Vermilion Emperor Lord of Mount Heng in the South, his surname, personal name, and style; his form three inches and three-tenths in height, crowned with a cinnabar jade *tongtian* diadem, clad in a vermilion-feathered flying robe, riding a red dragon, attended by twelve Jade Maidens of the Vermilion Jade. From the south he descends into your chamber. After a long while, the Vermilion Emperor transforms into the form of a newborn infant within a cloud of red qi, following the qi into your mouth and proceeding directly to the heart. Visualize the spleen generating yellow qi to encircle and envelop the heart palace; the yellow and red qi blend in primordial chaos, blazing like the radiant light of flames. Feel the heart suffused with warmth, then swallow three times. Look upward and recite:\n\nThe Three Qi of the Cinnabar Heaven,\nthe southern Jade Gate above.\nWithin resides the Great Spirit, the Vermilion Emperor, Numinous Lord.\nClad in cinnabar, bearing talismans, flying script on feathered skirts.\nRiding a crimson dragon, jade reins descending through clouds.\nOn the numinous peak of Mount Heng in the south, myriad spirits hold him in highest reverence.\nExiting and entering the Three Clarities, ascending to feast in the Nine Mysteries.\nThe Vermilion Jade attend and serve; jade youths guard the true.\nHolding jade tablets and records, inscribed with crimson registers.\nVerifying and recording immortal ranks, reporting their weight to the heavens.\nToday, Great King, the numinous peak opens the path to immortality.\nTurn your exalted spirit, descend through my three gates.\nTransform into an infant, pacifying the heart and settling the hun-soul.\nThe two qi merge and blend, entwining my life’s root.\nEver with Zhurong, riding the luminous clouds,\nroaming the southern slopes, enduring as heaven and earth.\n\nConclude by drawing in red qi and swallowing three times. Practicing this method will summon the divine officials of Mount Heng in the South to descend, dispatching three Jade Maidens of the Vermilion Jade to serve you, conveying petitions and fulfilling all requests. The karmic records of your parents’ transgressions—assigned as servitude to Mount Heng—shall be dissolved, punishments released, and names expunged, ascending to the celestial offices. This method is wondrous and profound, unlocking the passage between life and death.\n\nRegularly on the days of *wùchén*, *wùxū*, *jǐchǒu*, or *jǐwèi* after the Spring Equinox, Summer Solstice, Autumn Equinox, or Winter Solstice: bathe, purify, and fast, then at sunrise enter the chamber, face the sovereign, bow twelve times, sit upright, and click the teeth twelve times to awaken the body’s spirits.",
      "overlap_context": "ty myriad officials of the Ren-Gui Qiang-Lao, descending from the Five Qi Mystic Heaven into the chamber. In an instant, he transforms and generates black qi, its brilliance layered and cascading like the radiance of shooting stars, enveloping your form and entering through the mouth, descending directly into the kidney palace.\n\nNext, envision Mercury shining brightly in the north, its light illuminating your body, all made distinct and clear. Then open your eyes and recite while looking upward:",
      "start_char": 4306,
      "end_char": 5556,
      "start_sentence": 183,
      "end_sentence": 245,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.66457939147949,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\神符类\\太上洞玄灵宝投简符文要诀.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "毕闭目，思中岳嵩高山黄帝君姓讳字，形长一尺二寸，头戴黄玉通天宝冠，衣黄羽飞衣，驾乘黄龙，从神黄素玉女十二人，从中岳来降兆室，良久，黄帝君化为婴儿始生之状，在黄气之中，随气从兆口入，径至脾府，思肺生白气，以贯绕脾宫，黄白二气混沌相着，似黄云之回天，觉脾中熏热，便十二咽。 仰祝曰： 中天黄元，总统四灵。 戊己中山，元始上精。 黄帝大神，骖驾飞軿。 十二黄龙，上宴三清。 玉女侍卫，神童使令。 开山校图，录仙定名。 徘徊中岳，白玉敷灵。 回真曲降，流灌我形。 混合变化，老帝成婴。 安镇黄宫，府藏华荣，身生奇毛，内外光明。 真人交接，通达九清心得骖黄軿，飞升玉庭。 毕，引黄气十二咽止。 行此道，中岳灵官五帝降房，致黄素玉女十二人为兆通灵，关启上闻九天，生死父母罪书刑名系於中岳，皆得解散，灭绝罪书，上名仙录，去离地官，升入福堂，生死开泰，度人无量。 常以立秋后庚申、辛酉之日晡时，沐浴清斋，入室向西七礼，平坐叩齿七通，关启身神。 毕闭目，思西岳华阴山白帝君姓讳字，形长七寸七分，头戴素玉通天宝冠，衣素羽飞衣，驾乘白龙，从神白素玉女十二人，从西岳来降兆室内，良久，白帝君化为婴儿始生之状，在白气之中，随气入兆口中，径至肺府，思肾生黑气，以贯绕肺宫，白黑二气混沌相着，似庆云之沓霄，觉肺中熏热，便七咽。 仰祝曰： 七气之天，素皇金堂。 白帝大神，安镇西方。 华阴灵山，号曰神王。 白羽飞裙，建旗御龙。 上游玄青，出入华宫。 总领仙籍，列简诸方。 日吉嘉辰，万圣宴峰。 徘徊九霞，流散晖光。 金精焕焕，白石洋洋。 开山观灵，神敷四乡。 愿道愿仙，愿生愿长。 上愿既会，靡不吉昌。 募收通真，改我形容，变化自成，与气同翔。 身飞骨轻，上升紫房。 毕，引白气七咽止。 行此道，则西岳灵官白帝降真，致白素玉女七人，为兆通灵关启，所求皆闻九天，生死父母罪书刑名系於西岳，咸得解脱，罪书自除，名上仙籍，去离五道，永升福堂，生死开度，福至自然。 常以立冬后壬子、癸亥之日子时，沐浴清斋，入室北向五礼，平坐叩齿五通，关启身神。 毕闭目，思北岳恒山黑帝君姓讳字，形长五寸五分，头戴玄玉通天宝冠，衣玄羽飞衣，驾乘黑龙，从神太玄玉女十二人，从北岳来降兆室，良久，黑帝君化为婴儿始生之状，在黑气之中，随气入兆口中，径至肾府，思肝生青气，以贯绕肾府，青黑二气混沌相着，如碧云之杳烟，觉肾中熏热，便五咽。 仰祝曰： 五气玄天，上始精流。",
      "translated_text": "Close your eyes and visualize the Yellow Emperor of the Central Peak, Mount Songgao—his surname, given name, and courtesy name—standing twelve inches tall, crowned with a Yellow Jade *Tongtian* Treasure Diadem, clad in a yellow feathered flying robe, riding a yellow dragon. Twelve Yellow Plain Jade Maidens accompany him as he descends from the Central Peak into your chamber. After a while, the Yellow Emperor transforms into the form of a newborn infant, nestled within yellow qi, which follows the breath into your mouth and proceeds directly to the Spleen Palace. Envision the lungs generating white qi to encircle and envelop the Spleen Palace, where the yellow and white qi intermingle in primordial chaos, swirling like yellow clouds across the heavens. When you feel a warm sensation suffusing the spleen, swallow twelve times.\n\nThen recite the prayer while looking upward:\n*\"Central Heaven’s Yellow Origin, sovereign of the Four Numinous Ones,\nMountain of Wu and Ji, primordial essence of the Supreme Beginning.\nGreat God Yellow Emperor, riding a flying chariot,\nTwelve Yellow Dragons ascend to feast in the Three Clarities.\nJade Maidens attend as guards, divine youths serve as messengers.\nUnsealing the mountain to inspect the charts, recording immortals’ names for confirmation.\nRoaming the Central Peak, white jade unfurls its numen.\nReturning in a winding descent, streaming to irrigate my form.\nMerging and transforming, the aged emperor becomes an infant.\nSecurely settled in the Yellow Palace, the treasury flourishes in splendor,\nMy body sprouts wondrous hairs, radiant within and without.\nTrue ones commune, pathways open to the Nine Clarities—\nMy heart attains the yellow chariot, soaring to the Jade Court.\"*\n\nConclude by drawing in yellow qi and swallowing twelve times.\n\nPracticing this method will summon the divine officials of the Central Peak’s Five Emperors to descend into your chamber, dispatching twelve Yellow Plain Jade Maidens to serve as your spirit-mediums, opening the gates to report your prayers to the Nine Heavens. The karmic records of your parents’ transgressions—assigned as servitude to the Central Peak—shall be dissolved, punishments released, and names expunged, ascending to the immortal registers. Freed from the Earthly Offices, they rise into the Hall of Blessings, unlocking the passage between life and death and bestowing boundless deliverance.\n\nRegularly on the days of *gēngshēn* or *xīnyǒu* after the Beginning of Autumn: bathe, purify, and fast, then at dusk enter the chamber, face west, bow seven times, sit upright, and click the teeth seven times to awaken the body’s spirits. Close your eyes and visualize the White Emperor of the Western Peak, Mount Huayin—his surname, given name, and courtesy name—standing seven inches and seven parts tall, crowned with a White Jade *Tongtian* Treasure Diadem, clad in a white feathered flying robe, riding a white dragon. Twelve White Plain Jade Maidens accompany him as he descends from the Western Peak into your chamber. After a while, the White Emperor transforms into the form of a newborn infant, nestled within white qi, which follows the breath into your mouth and proceeds directly to the Lung Palace. Envision the kidneys generating black qi to encircle and envelop the Lung Palace, where the white and black qi intermingle in primordial chaos, layering like auspicious clouds across the heavens. When you feel a warm sensation suffusing the lungs, swallow seven times.\n\nThen recite the prayer while looking upward:\n*\"Heaven of the Seven Qi, golden hall of the White Sovereign,\nGreat God White Emperor, securely settled in the West.\nSpiritual mountain of Huayin, hailed as the Divine King.\nWhite feathered skirts flutter, banners command the dragons,\nRoaming the dark azure, entering and exiting the Flowery Palace.\nOverseeing the immortal registers, arranging the records of all directions.\nOn this auspicious day, the myriad sages feast upon the peaks,\nRoaming the Nine Radiant Clouds, scattering their luminous glow.\nGolden essence gleams, white stones surge in abundance.\nUnsealing the mountain to observe the numen, spirits spread to the four quarters.\nWishing for the Dao, wishing for immortality,\nWishing for life, wishing for longevity.\nWhen the supreme wish is fulfilled, naught shall not prosper.\nGathering and refining the perfected, transforming my form,\nChanging and completing myself, soaring in unison with qi.\nMy body flies, my bones grow light, ascending to the Purple Chamber.\"*\n\nConclude by drawing in white qi and swallowing seven times.\n\nPracticing this method will summon the divine officials of the Western Peak’s White Emperor to descend in truth, dispatching seven White Plain Jade Maidens to serve as your spirit-mediums, opening the gates to report all your prayers to the Nine Heavens. The karmic records of your parents’ transgressions—assigned as servitude to the Western Peak—shall be dissolved, punishments released, and names expunged, ascending to the immortal registers. Freed from the Five Paths, they rise eternally into the Hall of Blessings, unlocking the passage between life and death, with blessings arriving naturally.\n\nRegularly on the days of *rénzǐ* or *guǐhài* after the Beginning of Winter: bathe, purify, and fast, then at midnight enter the chamber, face north, bow five times, sit upright, and click the teeth five times to awaken the body’s spirits. Close your eyes and visualize the Black Emperor of the Northern Peak, Mount Heng—his surname, given name, and courtesy name—standing five inches and five parts tall, crowned with a Dark Jade *Tongtian* Treasure Diadem, clad in a black feathered flying robe, riding a black dragon. Twelve Great Mysterious Jade Maidens accompany him as he descends from the Northern Peak into your chamber. After a while, the Black Emperor transforms into the form of a newborn infant, nestled within black qi, which follows the breath into your mouth and proceeds directly to the Kidney Palace. Envision the liver generating blue-green qi to encircle and envelop the Kidney Palace, where the blue-green and black qi intermingle in primordial chaos, swirling like azure clouds in the distant mist. When you feel a warm sensation suffusing the kidneys, swallow five times.\n\nThen recite the prayer while looking upward:\n*\"Heaven of the Five Qi, primordial essence flowing from the Supreme Beginning...\"*",
      "overlap_context": "—shall be dissolved, punishments released, and names expunged, ascending to the celestial offices. This method is wondrous and profound, unlocking the passage between life and death.\n\nRegularly on the days of *wùchén*, *wùxū*, *jǐchǒu*, or *jǐwèi* after the Spring Equinox, Summer Solstice, Autumn Equinox, or Winter Solstice: bathe, purify, and fast, then at sunrise enter the chamber, face the sovereign, bow twelve times, sit upright, and click the teeth twelve times to awaken the body’s spirits.",
      "start_char": 5556,
      "end_char": 6541,
      "start_sentence": 246,
      "end_sentence": 283,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.32681369781494,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\神符类\\太上洞玄灵宝投简符文要诀.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "结气凝灵，号曰仙庐。 安镇北恒，黑帝所游。 遨宴北单，骖龙驾游。 今日王吉，万灵开图。 五气徘徊，庆云四敷。 仙童执简，太玄度符。 记我仙籍，金录上书。 回真曲降，混合婴孩。 二气交络，洞灌我躯。 玄冥提携，神仙为俦。 永享天地，万劫无休。 毕，引黑气五咽止。 行此道，北岳灵官黑帝降真，致太玄玉女五人给以使令，通致启乞，上闻九天，生死父母罪名刑书系属北岳，并蒙解除，得度三恶之道，上升天堂，太妙上法，普度无穷。 行此道，常当夷心静思，意注分明，灵真易感，得其法式，不移年而睹神行来出入之向方面，天官司迎，魔灵消伏，不敢干前，心聪意慧，自审吉凶，五岳五帝，常为友宾，神明交通，坐致神仙。 太上洞玄灵宝投简符文要诀竟",
      "translated_text": "Gather qi and congeal spirit, calling it the Immortal Hut.\nSecurely settled at Northern Heng, where the Black Emperor roams.\nWandering and feasting in the northern wastes, riding a dragon-drawn chariot.\nToday is most auspicious—ten thousand spirits unfurl the chart.\nThe Five Qi linger and circle; felicitous clouds spread in all four directions.\nImmortal youths hold tablets, the Supreme Mystery transmits the talisman.\nInscribe my name in the immortal register, inscribed in golden script above.\nReturning to the true and winding descent, merging with the infant form.\nThe two qi intertwine and weave, thoroughly irrigating my body.\nThe Dark and Hidden leads by the hand, with immortals as companions.\nEternally partaking of Heaven and Earth, through ten thousand kalpas without end.\n\nConclude by drawing in black qi and swallowing five times.\n\nPracticing this Way, the numinous officials of Northern Heng and the Black Emperor descend in truth, sending five Supreme Mystery Jade Maidens to serve and command. Through them, all prayers and petitions ascend to the Nine Heavens. The records of sins and punishments binding one’s parents to Northern Heng are all dissolved, allowing passage beyond the Three Evil Paths, ascending to the Heavenly Palace. This is the most wondrous and supreme method, universally delivering boundless beings.\n\nPracticing this Way, one must always maintain a serene mind and focused intent, clearly directing attention. The numinous and true readily respond, and one attains the proper method. Within a year, one will witness spirits coming and going in all directions, with heavenly officials receiving and escorting. Demonic spirits disperse and submit, daring not approach. The mind becomes keen and the intellect sharp, discerning fortune and misfortune. The Five Peaks and Five Emperors become constant companions, and divine communication is established, effortlessly attaining immortality.\n\nHere ends the *Essential Instructions on the Talismanic Petition of the Supreme Mystery Wondrous Treasure*.",
      "overlap_context": "black qi, which follows the breath into your mouth and proceeds directly to the Kidney Palace. Envision the liver generating blue-green qi to encircle and envelop the Kidney Palace, where the blue-green and black qi intermingle in primordial chaos, swirling like azure clouds in the distant mist. When you feel a warm sensation suffusing the kidneys, swallow five times.\n\nThen recite the prayer while looking upward:\n*\"Heaven of the Five Qi, primordial essence flowing from the Supreme Beginning...\"*",
      "start_char": 6541,
      "end_char": 6844,
      "start_sentence": 284,
      "end_sentence": 298,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.869280099868774,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\神符类\\太上洞玄灵宝投简符文要诀.txt",
        "category": "神符类"
      }
    }
  ]
}