{
  "source_id": "太上洞玄灵宝众简文",
  "source_file": "chunked_daozang\\太上洞玄灵宝众简文.json",
  "total_chunks": 3,
  "total_original_chars": 2970,
  "total_translated_chars": 19979,
  "total_translation_time": 98.68670630455017,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上洞玄灵宝众简文.txt",
    "category": "玉诀类"
  },
  "full_translation": "**The Supreme Cavern Mystery Numinous Treasure Collection of Memorial Tablets**\n\n**Scripture Title:** *The Supreme Cavern Mystery Numinous Treasure Collection of Memorial Tablets*\nCompiled by Daoist Lu Xiujing of the Liu-Song Dynasty of the Southern Dynasties. A method for submitting memorial tablets to absolve sins in the Orthodox Numinous Treasure tradition. One scroll.\nSource of the base text: *Daoist Canon of the Zhengtong Era*, Cavern Mystery Section, Jade Instructions Category.\n\n---\n\n**The Supreme Cavern Mystery Numinous Treasure Collection of Memorial Tablets**\nCompiled by Master of Simplicity Lu Xiujing\n\nThose who receive the Numinous Treasure registers and covenants must first ascend the steps of initiation; those who submit memorial tablets and perform repentance must follow the proper sequence. For the Middle Covenant and the Great Covenant, one must cast dragon tablets. Thereafter, on the eight nodal *jiazi* days, one separately submits the Three Primordials Jade Tablets. Only then may one ascend the mountains in the four seasons to practice the affairs of the true scriptures.\n\nThe *Luminous True Jade Instructions* provides detailed explanations, yet later learners, indolent and dull, with shallow aspirations and limited understanding, encounter a single ritual and fail to study it diligently. They apply it carelessly, leading to errors—losing the beginning and end, never realizing their mistakes. Such individuals are a constant source of sorrow. Witnessing their sinking and drowning, I fear the harm to the compassionate teachings. Thus, in accordance with ancient canons, I have compiled the sequence for submitting memorial tablets, arranging them in order and annotating the methods and standards, to enlighten the ignorant and establish a model for my disciples. How could this be casually offered to the careless?\n\nThe *Instructions on the Scripture of the True One and the Natural* states: After receiving the scripture, the disciple casts ten golden rings, making an oath to the ten directions as a pledge of secrecy. These ten rings are offered to the master, and a golden dragon is released into the limpid abyss to seek the token of transcendence.\n\nThis ritual pertains to the initial reception of the *Numinous Treasure Register of the Palace of the Natural*, which, upon completion of the fivefold verification and repeated bows, is followed by the presentation of the yellow silk-wrapped scripture, called the Middle Covenant. One should cast a single dragon tablet, forging the dragon with ten rings, binding the tablet with blue silk, and submitting it to the limpid abyss. The text of the tablet follows the *Jade Instructions*, notifying the Water Officials. The ritual text is as follows.\n\nThe *Luminous True Rituals* states: Upon receiving the Ten Sections of Wondrous Scriptures of the True Writ of the Numinous Treasure from the Three Heavens, one casts three golden dragons into the water palaces, the numinous mountains, and the dwelling places—three locations in total—as a token of the pursuit of transcendence. Without this submission, the Three Officials will bind one’s life register, and petitions will not reach them.\n\nThis ritual pertains to the Great Covenant upon ascending the altar, when one wears the True Writ of the Red Script and holds the two rings and the staff. On that day, one must cast three golden dragons and twenty-seven golden rings into the three locations of mountains, waters, and dwelling places, notifying and pledging to the Three Officials. The text of the tablet follows the *Jade Instructions* as below.\n\nThe *Jade Instructions* state: On the *jiazi* days of the eight nodes, one submits the Three Primordials Jade Tablets to erase the records of past sins, reporting one’s name to Heaven. Each matter is performed three times. The Three Officials of the various heavens mutually entrust and record, distinguishing the right in the heavens above. All spirits respect and protect, and the myriad demons do not interfere.\n\nThis ritual follows the Great Covenant, submitting to the three locations of mountains, waters, and dwelling places, with three submissions per location. The first submission uses one dragon and nine rings; the subsequent two submissions use only dragons without rings. In total, nine tablets, nine dragons, and twenty-seven pairs of rings are used.\n\nThe scripture states: The mention of the eight nodal *jiazi* days is a general reference. The submission of these tablets must occur on an auspicious day and cannot be performed on other days. If the eight nodes are not encountered, another *jiazi* day may be used.\n\nThe texts of the Three Primordials Jade Tablets are as follows:\nFor the Middle Covenant’s casting of the dragon tablet, use this Water Tablet text. For the Great Covenant’s casting of the three dragons to pledge to the Three Officials, use all three tablet texts.\n\n---\n\n**Method for the Supreme Numinous Treasure’s Notification to the Water Emperor to Erase Sins**\n\nThe Numinous Treasure [Title] Emperor Master [or Lady] of the Clouds, Daoist So-and-so, aged [number] years, born in the [ordinal] month, aspires to the divine and to transcendence, to live forever without death, and to preserve the Three Primordials. To the Nine Palaces’ Water Emperors, the Twelve River Sources, the Jiang, Hai, Huai, and Ji rivers, and the great spirits of the netherworld, I beseech the erasure of my sinful name, that it may be reported to the Nine Heavens. I request to proceed to the Water Palace, conveyed by the golden dragon courier.\n\nSubmitted on the [day] of the [month] of the [year] at [location].\n\nWrite this in red on a silver-wood tablet, wrap the tablet in blue paper, bind it with blue silk, and let the golden dragon bear the tablet. Cast it into the abyss of the Three Rivers. For the first submission, use nine golden rings attached to the tablet; for subsequent submissions, no further rings are needed, and the three submissions are complete.\n\nThe submission should take place in the limpid abyss. First, face east, knock the teeth three times, and light the incense in the burner.\n\nInvoke the Supreme Three Heavens’ Primordial Qi, the Most High Lord Lao: Summon forth the Three and Five Merit Officers within my body, the left and right official messengers, the left and right incense-bearers, the dragon courier riders, the jade lads attending the incense, the jade maidens transmitting words, and the thirty-six attendants of the Five Thearchs’ direct talismans. Emerge and report to the true officials of the land in the four directions here. I now burn incense and report: May the qi of the true and correct in the ten directions descend into my body, allowing my report to ascend directly to the presence of the Most High, the Perfectly True, the Great Sage, the August Thearch, and the Jade Emperor.\n\nNext, turn to face north, knock the teeth three times, and read the Water Tablet text to its conclusion. Then recite the incantation:\n\nThe Primordial Five Elders, the August Highest Honored Ones,\nThe Perfectly True of the Ten Directions, the Numinous Transcendents of Mount Taihua.\nThe Red Script issues commands, penetrating even the hidden.\nAscending to the Nine Heavens, I request the descent of the Jade Writ.\nThe sun, moon, and Five Stars, the Seven Primes of the Northern Dipper.\nI report to the Five Marchmounts and the numinous mountains of the four directions.\nBelow, I report to the rivers and seas, the Twelve Water Sources.\nThe Nine Palaces’ Water Emperors, the great spirits of the netherworld.\nToday, I make this report above, unfolding myriad wishes.\nI request the casting of the Jade Tablet to beseech the erasure of my sinful name.\nMy thousand ancestors and myriad forebears, the nine clans and all kin,\nWhose sins have been transmitted and tainted, extending even to my body—\nMay all be universally erased, their roots severed.\nRecord my name in the Water Palace and report it before the Emperor on High.\nMay my seven generations of ancestors and parents depart from the Eight Difficulties,\nAscend to the Nine Heavens, and be clothed and fed by the natural.\nMay all sins be released and dispersed, heard by the myriad spirits.\nI request the golden rings to seal the pledge with the Water Officials.\nMay my request be conveyed as stated, by the golden dragon courier.\n\nThen, offer incense three times and replenish the burner.\n\nO Fragrant Official Messengers, Lords of the Left and Right Dragons and Tigers, Bearers of the Fragrant Offering: May the naturally born golden liquid, cinnabar essence, and myriad numinous mushrooms of this very hall converge before this incense burner. May I attain the Dao and achieve transcendence, my entire household receive blessings, and the world be graced with kindness. May the jade lads and jade maidens of the ten directions attend the fragrant smoke, transmitting my words directly to the presence of the Most High, the Jade Emperor before the Golden Gates of the Jade Capital.\n\nThe Primordial Numinous Treasure announces to the Five Marchmounts and Sacred Mountains the Rite for Removing Sins and Seeking Transcendence:\n\nNuminous Treasure [So-and-So], Emperor-Master of [Such-and-Such], your servant [Name], aged [X] years, born in the [X] month, provisionally assigned to the Red Emperor and named for the removal of Mount Huo—wishing for divine transcendence, long life, deliverance from the world, and flight to the Upper Clarity; the Perfected of the Five Marchmounts, most divine and numinous—entreat that my name be stricken from the registers of sin and inscribed in the Nine Heavens. I request to present myself at the Sacred Mountain, conveyed by the golden dragon courier.\n\nOn the [X] day of the [X] year, month, and hour, submit this document at [Such-and-Such] Marchmount. (If not at a Marchmount, state: [Such-and-Such] prefecture, county, and mountain.)\n\nInscribe the above in cinnabar on a silver-wood tablet, wrap it in blue paper, bind it with blue silk, affix nine golden rings and one golden dragon, and bury it at the Marchmount of one’s natal destiny, all in accordance with the above method.\n\nNext, at the Marchmount of one’s natal destiny, face east, knock the teeth, and kindle the incense burner as prescribed.\n\nThen knock the teeth nine times, recite the tablet to its end, and intone the incantation:\n\nDarkly above, the Luminous opens;\nThe Primordial oversees the Perfected.\nThe Five Elders of the Lord,\nCrimson script of the Vermilion Text—\nHeaven and Earth’s origin,\nGovernor of the Three Primes.\nGathering qi and summoning assembly,\nHastening the ascent of transcendents.\nSupreme talismanic command,\nUniversally proclaimed to the Ten Heavens.\nSun, moon, and stellar lodges,\nFive Marchmounts and Sacred Mountains,\nAbove the earth and below the heavens,\nNuminous spirits of the unseen—\nOverseers of life and keepers of records,\nSouthern Three Gates.\nReceive the jade tablet,\nInscribe names in the Vermilion Register.\nStrike out the ledgers of sin,\nPromote to imperial servitors.\nThousands of ancestors, myriad forebears,\nNine clans and all kin—\nAll attain liberation,\nFreed from the Five Paths and Eight Difficulties.\nDepart the Three Evils,\nSouls ascend to the Nine Heavens.\nDeliverance from life and death,\nEternal abiding through ten thousand kalpas.\nToday’s supplication,\nHeard by all spirits.\nI request the golden rings\nTo seal the pledge with the Perfected Officials.\nMay my request be conveyed as stated,\nBy the golden dragon courier.\n\nNext, offer incense three times and replenish the burner as above.\n\n---\n\nThe Primordial Numinous Treasure announces to the Nine Earths and Earth Sovereigns the Rite for Extinguishing Sins and Seeking Transcendence:\n\nNuminous Treasure, Red Emperor-Master, your servant [Name], aged [X] years, born on the [X] day of the [X] month, now registered under the Nine Heavens and governed by the Southern Dipper. (This document refers to the Red Emperor for those born in the hours of *si* or *wu*; those whose destiny number is nine are born in the first or second month; \"governed by the Southern Dipper\" refers to the direction of one’s natal destiny. Others born in different months follow this model.)\n\nWishing for divine transcendence, long life, deliverance from the world, and flight to the Upper Clarity; the Central August One of the Nine Earths, the Yellow Spirit of *wu* and *ji*, the Five Emperors of the Earth Palace—entreat that my record of sins be stricken and inscribed in the Supreme Mystery. I request to present myself at the Central Palace, deposit the tablet, and record my name, with golden rings as tokens of faith, conveyed by the golden dragon courier.\n\nOn the [X] day of the [X] month and year, submit this document at [Such-and-Such] prefecture, county, village, and hamlet.\n\nInscribe the above in cinnabar on a silver-wood tablet, wrap it in blue paper, bind it with blue silk, affix nine golden rings and one golden dragon, and bury it at the central palace of one’s residence, all in accordance with the above method.\n\nNext, in the central courtyard, knock the teeth, kindle the incense burner, and face the [direction of the] king as prescribed.\n\nThen knock the teeth twelve times, recite the tablet to its end, and intone the incantation:\n\nHeaven unfolds, Earth extends,\nNine qi divide the numinous.\nThree Primes in unison,\nTen Directions in Mysterious Clarity.\nThe Five Elder Lords,\nOpen the Perfected and govern life.\nVermilion script of the Crimson Text,\nPrimordial essence above.\nUniversally proclaimed below,\nNine Earths’ august spirits.\nToday’s supplication,\nDestined for transcendence by all immortals.\nMay I attain transcendence,\nI request to deposit my jade name.\nGreat Sovereign of the Earth Palace,\nStrike out my sentence of sin.\nPresent the tablet to the Upper Palace,\nInscribe it in the resplendent register.\nSwiftly attain flight,\nSpiritual in harmony with Heaven and Earth.\nNine clans and all kin,\nRotten bones renewed in glory.\nSouls ascend to the Southern Palace,\nTransformed in the transcendent courts.\nToday’s proclamation,\nHeard by all spirits.\nI request the golden rings\nTo manifest the sincerity of this pledge.\nMay my request be conveyed as stated,\nBy the golden dragon courier.\n\nNext, offer incense and replenish the burner as above.\n\n---\n\nFor all who receive the Two Pledges of the Numinous Treasure and thereafter compose jade tablets, a total of seventy-four golden rings and thirteen golden dragons are required. Only after completing these rites may one proceed to compose the talismanic texts of the Vermilion Script for the Eight Nodal Days.\n\n**Vermilion Script of the Five Directions’ Perfected Texts in Large Characters**\n\n**East:**\nNine qi of the East,\nAugust Sovereign of the Azure Heaven.\nVerdant mists and layered ramparts,\nWithin dwells the Elder,\nOverseer of charts and records,\nGathering qi to elevate transcendents.\n\nThe twenty-four characters of the Eastern Perfected Text are customarily inscribed in blue on white paper on the day of *lichun* (Beginning of Spring) of one’s natal *jiazi* year.\n\n*Tai Shang Dong Xuan* disciple [Name], Marchmount Master of [Such-and-Such], on the day of *lichun* in the [X] year, [X] month, and [X] day, deposits this paper at [Such-and-Such] prefecture, county, village, and hamlet. The same method applies to all Eight Nodal Days of one’s natal *jiazi* year.\n\n**South:**\nCinnabar Heaven of the South,\nJade Hall of the Red Emperor.\nWithin dwells the Great Spirit,\nNamed the August Red One.\nFlaming mists ascend,\nThree qi ablaze with light.\nTranscendents receive their mandate,\nResponding to the Great Yang.\n\nThe thirty-two characters of the Southern Perfected Text are customarily inscribed in vermilion on white paper on the day of *lixia* (Beginning of Summer) of one’s natal *jiazi* year.\n\n**Center:**\nSpirit of the Center,\nYellow Prime of Heaven.\nFirstborn of the Five Elders,\nCentral August One most revered.\nGathering qi and overseeing the Perfected,\nGovernor of all transcendents.\nKeeper of the Mysterious Charts,\nCustodian of jade texts in the starry ledgers.\nHastening the ascent of primordial qi,\nUniversally proclaimed to all spirits.\n\nThe forty characters of the Central Perfected Text are customarily inscribed in yellow on white paper on the days of *chunfen* (Spring Equinox), *xiazhi* (Summer Solstice), *qiufen* (Autumn Equinox), and *dongzhi* (Winter Solstice) of one’s natal *jiazi* year.\n\n**West:**\nWhite Heaven of the West,\nSeven Gates of the White Emperor.\nRadiant brilliance of Metal’s spirit,\nGreat Flower’s effulgent mists.\nWhite stones towering,\nSeven qi in smoldering clouds.\nAbove dwells the Firstborn,\nAugust Elder Great Spirit.\nGovernor of lung qi,\nOverseer of the Nine Heavens.\nInspector of charts and records,\nController of the ascent of transcendents.\n\nThe forty-eight characters of the Western Perfected Text are customarily inscribed in white on white paper on the day of *liqiu* (Beginning of Autumn) of one’s natal *jiazi* year.\n\n**North:**\nMysterious Heaven of the North,\nFive qi meandering.\nWithin dwells the Black Emperor,\nTwin August Ones of the Supreme Tenuity.\nGovernor of talismanic commands,\nTranscendents refining the Eight Potencies.\nAzure skirts and feathered retinue,\nDragon-script and phoenix robes.\nThose whom the Lord promotes,\nAscend to the jade steps.\n\nThe forty characters of the Northern Perfected Text are customarily inscribed in black on white paper on the day of *lidong* (Beginning of Winter) of one’s natal *jiazi* year.\n\n**Method for Presenting the Five Directions’ Perfected Texts on Tallies**\n\nOn each respective day, inscribe the tallies in the five colors, following the method above. Then ascend the mountain, first facing east and knocking the teeth, reciting the incense incantation and kindling the censer, all as in the method above.\n\nNext, knock the teeth twelve times and recite the incantation:\n\nO Mystic Loftiness, Exalted Spirit,\nPrimal Beginning, Venerable Divinity.\nGreat Sage meandering,\nMyriad Perfected descending to the hall.\nThree luminaries spread their radiance,\nAuspicious clouds arrayed on four sides.\nAbove, report to the Inspector of Charts,\nWho reckons and computes the Nine Heavens.\nToday I make my vow,\nPresenting my tally to the numinous mountain.\nCinnabar-script in vermilion characters,\nThe spontaneous Perfected Text.\nAbove, I report to the Five Thearchs,\nRecording my name in the Jade Register.\nMyriad spirits bear witness,\nSun and moon clearly attest.\nMay I attain deliverance, may I attain life,\nMay I attain spirithood, may I attain transcendence.\nHeaven and earth, stars and constellations,\nMysteriously illumine my body.\nThree Officials and Nine Bureaus,\nThe great gods of the Five Marchmounts.\nUniversally proclaim without end,\nEradicating the roots of transgression.\nThe Primal Beginning opens wide,\nNone shall reject my words.\nThe hidden souls of my seven ancestors\nReceive blessings as a matter of course.\nThe Three Paths and Five Sufferings,\nForever parted from the Eight Perils.\nMay I join the Three Luminaries,\nTogether shining in the Purple Dawn,\nThe Wheel of Rebirth unceasing,\nMy body attaining flight as an immortal.\n\nWhen the recitation of the tally is complete, cast it into the abyss of the sheer cliff, then scatter incense upon the numinous mountain. Next, knock the teeth three times and face your natal direction, reciting the incantation:\n\nThe Primal Beginning bears witness,\nMy immortal name already inscribed.\nThree Officials and Nine Bureaus,\nNo transgression remains unabsolved.\nScatter incense to the Five Thearchs,\nProclaiming to the luminous Great Void.\nAs I have petitioned,\nMay I endure for ten thousand kalpas.\n\nThen swallow the nine breaths of qi. Next, recite the incense incantation and kindle the censer as in the method above.\n\nOn the Eight Nodal Days, *jiazi* days, and one’s natal day, when performing the rites for the five directions, employ this single method.\n\nHere ends the *Scriptures of Tallies of the Most High Cavernous Mystery Numinous Treasure*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝众简文 经名：太上洞玄灵宝众简文。 南朝宋道士陆修静编撰。 官灵宝派投简除罪法街。 一卷。 底本出处：《正统道藏》洞玄部玉诀类。 太上洞玄灵宝众简文 简寂先生陆修静撰 夫受灵宝券盟，既有梯首，授简修刺，必由次第，中盟大盟，皆投龙简，其后八节甲子，别投三元玉简，如此方得四时登山，修真文之事。 明真玉诀并有其详，而晚学暗惰，志性浅略，遇见一科，不加精寻，率意施用，遂致矫错，亡首失尾，永不悟非。 若斯之徒，常为痛心，视其沦溺，惧伤慈教，谨依旧典，撰投简文次第，复为甲乙，注解法度，以启昧者之怀，自为门人成轨，岂苟施悠悠者哉。 真一自然经诀曰：弟子受书后，投金环十口，告於十方，为不泄之誓，并十口奉师，放金龙，并於清泠之渊，求登仙之信矣。 此科是初受灵宝度自然券宫经，竟校当五过定重拜，黄缯章付经，名曰中盟，应投此一龙，以十口锻合龙，青丝缠简，投之清渊，简文依玉诀，告水官，法文如左。 明真科：三天受灵宝真文十部妙经，以金龙三枚，投水府灵山所住宅合三处，为学仙之信，不投此，三官拘人命籍，求乞不达。 此科是登坛大盟，佩真文赤书，二镮策杖之日，当以金龙三枚，金环二十七只，投山水宅三处，告盟三官，简文依玉诀如左。 玉诀曰：当以八节甲子之日，投三元玉简，除宿罪簿，言名上天，事事三过，诸天三官，更相嘱记，上天右别，万神敬护，千魔不干。 此科是大盟后，投山水所住宅三处，处三过止，初一过处用一龙九只钮，后二过但用龙不须钮，合九简九龙二十七双钮。 经云：以八节甲子者，总举大意耳，投此简要当以吉辰，不得用他日，若不值八节，别用甲子。 三元玉简文如左 中盟投龙则用此水简文，大盟投三龙盟三官，则尽用此三简文。 元始灵宝告水帝削除罪简上法 灵宝某帝先生女人，云道士某甲，年如干岁，某月生，愿神愿仙，长生不死，三元同存，九府水帝，十二河源，江海淮济，冥灵大神，乞削罪名，上闻九天，请诣水府，金龙驿传。 某岁日月於某处告文。 右朱书银木简上，以青纸裹简，青丝缠之，金龙负简，以投三河之渊，初用金钮九只连简，沉之后投，不须三过都止。 投简当於清泠之渊，先东向叩齿三通，捻香发炉。 无上三天玄元始气太上老君，召出臣身中三五功曹，左右官使者，左右捧香，驿龙骑吏，侍香玉童，传言玉女，五帝直符，各三十六人出，关启此间土地四面真官，臣今正尔烧香关启，愿得十方正真之气降入臣身中，令臣所启上闻，径御无上至真大圣尊神玉帝几前。 次回北向，又叩齿三通，读水简文竟，咒曰： 元始五老，上帝高尊。 十方至真，太华灵仙。 赤文告命，无幽不关。 上御九天，请下玉文。 日月五星，北斗七元。 中告五岳，四方灵山。 下告河海，十二水源。 九府水帝，冥灵大神。 今日上告，万愿开陈。 请投玉简，乞削罪名。 千曾万祖，九族种亲。 罪相连染，及得臣身。 普蒙削除，绝灭种根。 记名水府，言上帝前。 七祖父母，去离八难。 上登九天，衣食自然。 罪皆释散，万神咸闻。 请以金钮，关盟水官。 请如所陈，金龙驿传。 次三捻香，复垆。 香官使者，左右龙虎君，捧香使者，当今斋堂自然生金液丹精芝英百灵，交会在此香火炉前，使臣得道，克获神仙，举家蒙福，天下受恩，十方玉童玉女侍卫香烟，传臣所言，径御太上金阙玉皇几前。",
      "translated_text": "**The Supreme Cavern Mystery Numinous Treasure Collection of Memorial Tablets**\n\n**Scripture Title:** *The Supreme Cavern Mystery Numinous Treasure Collection of Memorial Tablets*\nCompiled by Daoist Lu Xiujing of the Liu-Song Dynasty of the Southern Dynasties. A method for submitting memorial tablets to absolve sins in the Orthodox Numinous Treasure tradition. One scroll.\nSource of the base text: *Daoist Canon of the Zhengtong Era*, Cavern Mystery Section, Jade Instructions Category.\n\n---\n\n**The Supreme Cavern Mystery Numinous Treasure Collection of Memorial Tablets**\nCompiled by Master of Simplicity Lu Xiujing\n\nThose who receive the Numinous Treasure registers and covenants must first ascend the steps of initiation; those who submit memorial tablets and perform repentance must follow the proper sequence. For the Middle Covenant and the Great Covenant, one must cast dragon tablets. Thereafter, on the eight nodal *jiazi* days, one separately submits the Three Primordials Jade Tablets. Only then may one ascend the mountains in the four seasons to practice the affairs of the true scriptures.\n\nThe *Luminous True Jade Instructions* provides detailed explanations, yet later learners, indolent and dull, with shallow aspirations and limited understanding, encounter a single ritual and fail to study it diligently. They apply it carelessly, leading to errors—losing the beginning and end, never realizing their mistakes. Such individuals are a constant source of sorrow. Witnessing their sinking and drowning, I fear the harm to the compassionate teachings. Thus, in accordance with ancient canons, I have compiled the sequence for submitting memorial tablets, arranging them in order and annotating the methods and standards, to enlighten the ignorant and establish a model for my disciples. How could this be casually offered to the careless?\n\nThe *Instructions on the Scripture of the True One and the Natural* states: After receiving the scripture, the disciple casts ten golden rings, making an oath to the ten directions as a pledge of secrecy. These ten rings are offered to the master, and a golden dragon is released into the limpid abyss to seek the token of transcendence.\n\nThis ritual pertains to the initial reception of the *Numinous Treasure Register of the Palace of the Natural*, which, upon completion of the fivefold verification and repeated bows, is followed by the presentation of the yellow silk-wrapped scripture, called the Middle Covenant. One should cast a single dragon tablet, forging the dragon with ten rings, binding the tablet with blue silk, and submitting it to the limpid abyss. The text of the tablet follows the *Jade Instructions*, notifying the Water Officials. The ritual text is as follows.\n\nThe *Luminous True Rituals* states: Upon receiving the Ten Sections of Wondrous Scriptures of the True Writ of the Numinous Treasure from the Three Heavens, one casts three golden dragons into the water palaces, the numinous mountains, and the dwelling places—three locations in total—as a token of the pursuit of transcendence. Without this submission, the Three Officials will bind one’s life register, and petitions will not reach them.\n\nThis ritual pertains to the Great Covenant upon ascending the altar, when one wears the True Writ of the Red Script and holds the two rings and the staff. On that day, one must cast three golden dragons and twenty-seven golden rings into the three locations of mountains, waters, and dwelling places, notifying and pledging to the Three Officials. The text of the tablet follows the *Jade Instructions* as below.\n\nThe *Jade Instructions* state: On the *jiazi* days of the eight nodes, one submits the Three Primordials Jade Tablets to erase the records of past sins, reporting one’s name to Heaven. Each matter is performed three times. The Three Officials of the various heavens mutually entrust and record, distinguishing the right in the heavens above. All spirits respect and protect, and the myriad demons do not interfere.\n\nThis ritual follows the Great Covenant, submitting to the three locations of mountains, waters, and dwelling places, with three submissions per location. The first submission uses one dragon and nine rings; the subsequent two submissions use only dragons without rings. In total, nine tablets, nine dragons, and twenty-seven pairs of rings are used.\n\nThe scripture states: The mention of the eight nodal *jiazi* days is a general reference. The submission of these tablets must occur on an auspicious day and cannot be performed on other days. If the eight nodes are not encountered, another *jiazi* day may be used.\n\nThe texts of the Three Primordials Jade Tablets are as follows:\nFor the Middle Covenant’s casting of the dragon tablet, use this Water Tablet text. For the Great Covenant’s casting of the three dragons to pledge to the Three Officials, use all three tablet texts.\n\n---\n\n**Method for the Supreme Numinous Treasure’s Notification to the Water Emperor to Erase Sins**\n\nThe Numinous Treasure [Title] Emperor Master [or Lady] of the Clouds, Daoist So-and-so, aged [number] years, born in the [ordinal] month, aspires to the divine and to transcendence, to live forever without death, and to preserve the Three Primordials. To the Nine Palaces’ Water Emperors, the Twelve River Sources, the Jiang, Hai, Huai, and Ji rivers, and the great spirits of the netherworld, I beseech the erasure of my sinful name, that it may be reported to the Nine Heavens. I request to proceed to the Water Palace, conveyed by the golden dragon courier.\n\nSubmitted on the [day] of the [month] of the [year] at [location].\n\nWrite this in red on a silver-wood tablet, wrap the tablet in blue paper, bind it with blue silk, and let the golden dragon bear the tablet. Cast it into the abyss of the Three Rivers. For the first submission, use nine golden rings attached to the tablet; for subsequent submissions, no further rings are needed, and the three submissions are complete.\n\nThe submission should take place in the limpid abyss. First, face east, knock the teeth three times, and light the incense in the burner.\n\nInvoke the Supreme Three Heavens’ Primordial Qi, the Most High Lord Lao: Summon forth the Three and Five Merit Officers within my body, the left and right official messengers, the left and right incense-bearers, the dragon courier riders, the jade lads attending the incense, the jade maidens transmitting words, and the thirty-six attendants of the Five Thearchs’ direct talismans. Emerge and report to the true officials of the land in the four directions here. I now burn incense and report: May the qi of the true and correct in the ten directions descend into my body, allowing my report to ascend directly to the presence of the Most High, the Perfectly True, the Great Sage, the August Thearch, and the Jade Emperor.\n\nNext, turn to face north, knock the teeth three times, and read the Water Tablet text to its conclusion. Then recite the incantation:\n\nThe Primordial Five Elders, the August Highest Honored Ones,\nThe Perfectly True of the Ten Directions, the Numinous Transcendents of Mount Taihua.\nThe Red Script issues commands, penetrating even the hidden.\nAscending to the Nine Heavens, I request the descent of the Jade Writ.\nThe sun, moon, and Five Stars, the Seven Primes of the Northern Dipper.\nI report to the Five Marchmounts and the numinous mountains of the four directions.\nBelow, I report to the rivers and seas, the Twelve Water Sources.\nThe Nine Palaces’ Water Emperors, the great spirits of the netherworld.\nToday, I make this report above, unfolding myriad wishes.\nI request the casting of the Jade Tablet to beseech the erasure of my sinful name.\nMy thousand ancestors and myriad forebears, the nine clans and all kin,\nWhose sins have been transmitted and tainted, extending even to my body—\nMay all be universally erased, their roots severed.\nRecord my name in the Water Palace and report it before the Emperor on High.\nMay my seven generations of ancestors and parents depart from the Eight Difficulties,\nAscend to the Nine Heavens, and be clothed and fed by the natural.\nMay all sins be released and dispersed, heard by the myriad spirits.\nI request the golden rings to seal the pledge with the Water Officials.\nMay my request be conveyed as stated, by the golden dragon courier.\n\nThen, offer incense three times and replenish the burner.\n\nO Fragrant Official Messengers, Lords of the Left and Right Dragons and Tigers, Bearers of the Fragrant Offering: May the naturally born golden liquid, cinnabar essence, and myriad numinous mushrooms of this very hall converge before this incense burner. May I attain the Dao and achieve transcendence, my entire household receive blessings, and the world be graced with kindness. May the jade lads and jade maidens of the ten directions attend the fragrant smoke, transmitting my words directly to the presence of the Most High, the Jade Emperor before the Golden Gates of the Jade Capital.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1349,
      "start_sentence": 0,
      "end_sentence": 47,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.41598987579346,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上洞玄灵宝众简文.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "元始灵宝告五岳灵山除罪求仙法灵宝某帝先生，臣某年如干岁某月生，假令属赤帝名除霍山，愿神愿仙，长生度世，飞行上清，五岳真人，至神至灵，乞削罪籍，上名九天，请诣灵山，金龙驿传。 太岁某甲子日月某时，於某岳告文。 非岳则云某郡县某山。 右朱书银木简，青纸裹之，青丝缠之，金钮九只，金龙一枚，埋本命之岳，悉如上法。 次於本命之岳，东向叩齿，发炉如法。 次叩齿九通，读简竟，咒曰： 玄上开明，元始监真。 上帝五老，赤书丹文。 天地本始，总领三元。 摄气召会，催促举仙。 高上符命，普告十天。 日月星宿，五岳灵山。 天下地上，冥灵大神。 监生主录，南上三门。 关领玉简，勒名丹编。 削落罪书，上补帝臣。 千曾万祖，九族种亲。 皆蒙解脱，五道八难。 去离三恶，魂升九天。 生死开度，万劫长存。 今日上告，万神咸闻。 请以金钮，关盟真官。 请如所告，金龙驿传。 次三捻香，复垆如上法。 元始灵宝告九地土皇灭罪求仙法灵宝赤帝先生，臣某年若干岁某月日生，今系九天，南斗领籍。 此文云赤帝者，是本命巳午，命系九者，是正二月生，南斗领籍者，犹取本命之方，余生则效此。 愿神愿仙，长生度世，飞行上清，中皇九地，戊己黄神，土府五帝，乞削罪录，勒上太玄，请诣中宫，投简记名，金钮自信，金龙驿传。 太岁某月日於某郡县乡里告文 右朱书银木简，青纸裹之，青丝缠之，金钮九只，金龙一枚，埋所住中官，悉如上法。 次於中庭叩齿发炉，如上法。 次向王叩齿十二通，读简竟，咒曰： 天开地张，九气分灵。 三元同符，十方玄清。 五老上帝，开真领生。 丹书赤文，元始上精。 普告无下，九土皇灵。 今日上告，万仙定生。 愿我得仙，请投玉名。 土府大皇，勒除罪刑。 奏简上宫，列簿华青。 早得飞腾，天地同灵。 九祖种亲，腐骸更荣。 魂升南宫，受化仙庭。 今日告命，万神咸听。 请以金钮，表盟至情。 请如所告，金龙驿传。 次捻香，复垆如上法。 凡受灵宝度二盟，及后修玉简，都合用金环七十四只，金龙十三枚，如此事毕，方得依八节修真文赤书之简也。 五方真文赤书大字 东方九炁，始皇青天，碧霞郁垒，中有老人，总校图录，摄炁举仙。 东方真文二十四字，常以本命甲子立春之日，青书於白刺上。 太上洞玄弟子某岳先生甲乙，以某岁某月某日立春，於某郡某县某乡某里投刺。 本命甲子八节同用此。 南方丹天，赤帝玉堂，中有大神，号曰赤皇，上炎流烟，三炁勃光，神仙受命，应运太阳。 南方真文三十二字，常以本命甲子立夏之日二朱书於白刺上。 中央总灵，黄上天元，始生五老，中皇高尊，摄气监真，总领群仙，典录玄图，宿简玉文，催运上气，普告万神。 中央真文四十字，以本命甲子春分夏至秋分冬至之日，黄书白刺上。 西方素天，白帝七门，金灵皓映，太华流氛，白石峨峨，七炁烟煴，上有始生，皇老大神，总领肺炁，主校九天，检定图录，制召上仙。 西方真文四十八字，常以本命甲子立秋日，白书於白刺上。 北方玄天，五炁徘徊，中有黑帝，双皇太微，总领符命，仙炼八威，青裙羽属，龙文凤衣，上帝所举，制至玉阶。 北方真文四十字，常以本命甲子立冬之日，黑书於白刺上。",
      "translated_text": "The Primordial Numinous Treasure announces to the Five Marchmounts and Sacred Mountains the Rite for Removing Sins and Seeking Transcendence:\n\nNuminous Treasure [So-and-So], Emperor-Master of [Such-and-Such], your servant [Name], aged [X] years, born in the [X] month, provisionally assigned to the Red Emperor and named for the removal of Mount Huo—wishing for divine transcendence, long life, deliverance from the world, and flight to the Upper Clarity; the Perfected of the Five Marchmounts, most divine and numinous—entreat that my name be stricken from the registers of sin and inscribed in the Nine Heavens. I request to present myself at the Sacred Mountain, conveyed by the golden dragon courier.\n\nOn the [X] day of the [X] year, month, and hour, submit this document at [Such-and-Such] Marchmount. (If not at a Marchmount, state: [Such-and-Such] prefecture, county, and mountain.)\n\nInscribe the above in cinnabar on a silver-wood tablet, wrap it in blue paper, bind it with blue silk, affix nine golden rings and one golden dragon, and bury it at the Marchmount of one’s natal destiny, all in accordance with the above method.\n\nNext, at the Marchmount of one’s natal destiny, face east, knock the teeth, and kindle the incense burner as prescribed.\n\nThen knock the teeth nine times, recite the tablet to its end, and intone the incantation:\n\nDarkly above, the Luminous opens;\nThe Primordial oversees the Perfected.\nThe Five Elders of the Lord,\nCrimson script of the Vermilion Text—\nHeaven and Earth’s origin,\nGovernor of the Three Primes.\nGathering qi and summoning assembly,\nHastening the ascent of transcendents.\nSupreme talismanic command,\nUniversally proclaimed to the Ten Heavens.\nSun, moon, and stellar lodges,\nFive Marchmounts and Sacred Mountains,\nAbove the earth and below the heavens,\nNuminous spirits of the unseen—\nOverseers of life and keepers of records,\nSouthern Three Gates.\nReceive the jade tablet,\nInscribe names in the Vermilion Register.\nStrike out the ledgers of sin,\nPromote to imperial servitors.\nThousands of ancestors, myriad forebears,\nNine clans and all kin—\nAll attain liberation,\nFreed from the Five Paths and Eight Difficulties.\nDepart the Three Evils,\nSouls ascend to the Nine Heavens.\nDeliverance from life and death,\nEternal abiding through ten thousand kalpas.\nToday’s supplication,\nHeard by all spirits.\nI request the golden rings\nTo seal the pledge with the Perfected Officials.\nMay my request be conveyed as stated,\nBy the golden dragon courier.\n\nNext, offer incense three times and replenish the burner as above.\n\n---\n\nThe Primordial Numinous Treasure announces to the Nine Earths and Earth Sovereigns the Rite for Extinguishing Sins and Seeking Transcendence:\n\nNuminous Treasure, Red Emperor-Master, your servant [Name], aged [X] years, born on the [X] day of the [X] month, now registered under the Nine Heavens and governed by the Southern Dipper. (This document refers to the Red Emperor for those born in the hours of *si* or *wu*; those whose destiny number is nine are born in the first or second month; \"governed by the Southern Dipper\" refers to the direction of one’s natal destiny. Others born in different months follow this model.)\n\nWishing for divine transcendence, long life, deliverance from the world, and flight to the Upper Clarity; the Central August One of the Nine Earths, the Yellow Spirit of *wu* and *ji*, the Five Emperors of the Earth Palace—entreat that my record of sins be stricken and inscribed in the Supreme Mystery. I request to present myself at the Central Palace, deposit the tablet, and record my name, with golden rings as tokens of faith, conveyed by the golden dragon courier.\n\nOn the [X] day of the [X] month and year, submit this document at [Such-and-Such] prefecture, county, village, and hamlet.\n\nInscribe the above in cinnabar on a silver-wood tablet, wrap it in blue paper, bind it with blue silk, affix nine golden rings and one golden dragon, and bury it at the central palace of one’s residence, all in accordance with the above method.\n\nNext, in the central courtyard, knock the teeth, kindle the incense burner, and face the [direction of the] king as prescribed.\n\nThen knock the teeth twelve times, recite the tablet to its end, and intone the incantation:\n\nHeaven unfolds, Earth extends,\nNine qi divide the numinous.\nThree Primes in unison,\nTen Directions in Mysterious Clarity.\nThe Five Elder Lords,\nOpen the Perfected and govern life.\nVermilion script of the Crimson Text,\nPrimordial essence above.\nUniversally proclaimed below,\nNine Earths’ august spirits.\nToday’s supplication,\nDestined for transcendence by all immortals.\nMay I attain transcendence,\nI request to deposit my jade name.\nGreat Sovereign of the Earth Palace,\nStrike out my sentence of sin.\nPresent the tablet to the Upper Palace,\nInscribe it in the resplendent register.\nSwiftly attain flight,\nSpiritual in harmony with Heaven and Earth.\nNine clans and all kin,\nRotten bones renewed in glory.\nSouls ascend to the Southern Palace,\nTransformed in the transcendent courts.\nToday’s proclamation,\nHeard by all spirits.\nI request the golden rings\nTo manifest the sincerity of this pledge.\nMay my request be conveyed as stated,\nBy the golden dragon courier.\n\nNext, offer incense and replenish the burner as above.\n\n---\n\nFor all who receive the Two Pledges of the Numinous Treasure and thereafter compose jade tablets, a total of seventy-four golden rings and thirteen golden dragons are required. Only after completing these rites may one proceed to compose the talismanic texts of the Vermilion Script for the Eight Nodal Days.\n\n**Vermilion Script of the Five Directions’ Perfected Texts in Large Characters**\n\n**East:**\nNine qi of the East,\nAugust Sovereign of the Azure Heaven.\nVerdant mists and layered ramparts,\nWithin dwells the Elder,\nOverseer of charts and records,\nGathering qi to elevate transcendents.\n\nThe twenty-four characters of the Eastern Perfected Text are customarily inscribed in blue on white paper on the day of *lichun* (Beginning of Spring) of one’s natal *jiazi* year.\n\n*Tai Shang Dong Xuan* disciple [Name], Marchmount Master of [Such-and-Such], on the day of *lichun* in the [X] year, [X] month, and [X] day, deposits this paper at [Such-and-Such] prefecture, county, village, and hamlet. The same method applies to all Eight Nodal Days of one’s natal *jiazi* year.\n\n**South:**\nCinnabar Heaven of the South,\nJade Hall of the Red Emperor.\nWithin dwells the Great Spirit,\nNamed the August Red One.\nFlaming mists ascend,\nThree qi ablaze with light.\nTranscendents receive their mandate,\nResponding to the Great Yang.\n\nThe thirty-two characters of the Southern Perfected Text are customarily inscribed in vermilion on white paper on the day of *lixia* (Beginning of Summer) of one’s natal *jiazi* year.\n\n**Center:**\nSpirit of the Center,\nYellow Prime of Heaven.\nFirstborn of the Five Elders,\nCentral August One most revered.\nGathering qi and overseeing the Perfected,\nGovernor of all transcendents.\nKeeper of the Mysterious Charts,\nCustodian of jade texts in the starry ledgers.\nHastening the ascent of primordial qi,\nUniversally proclaimed to all spirits.\n\nThe forty characters of the Central Perfected Text are customarily inscribed in yellow on white paper on the days of *chunfen* (Spring Equinox), *xiazhi* (Summer Solstice), *qiufen* (Autumn Equinox), and *dongzhi* (Winter Solstice) of one’s natal *jiazi* year.\n\n**West:**\nWhite Heaven of the West,\nSeven Gates of the White Emperor.\nRadiant brilliance of Metal’s spirit,\nGreat Flower’s effulgent mists.\nWhite stones towering,\nSeven qi in smoldering clouds.\nAbove dwells the Firstborn,\nAugust Elder Great Spirit.\nGovernor of lung qi,\nOverseer of the Nine Heavens.\nInspector of charts and records,\nController of the ascent of transcendents.\n\nThe forty-eight characters of the Western Perfected Text are customarily inscribed in white on white paper on the day of *liqiu* (Beginning of Autumn) of one’s natal *jiazi* year.\n\n**North:**\nMysterious Heaven of the North,\nFive qi meandering.\nWithin dwells the Black Emperor,\nTwin August Ones of the Supreme Tenuity.\nGovernor of talismanic commands,\nTranscendents refining the Eight Potencies.\nAzure skirts and feathered retinue,\nDragon-script and phoenix robes.\nThose whom the Lord promotes,\nAscend to the jade steps.\n\nThe forty characters of the Northern Perfected Text are customarily inscribed in black on white paper on the day of *lidong* (Beginning of Winter) of one’s natal *jiazi* year.",
      "overlap_context": "the Fragrant Offering: May the naturally born golden liquid, cinnabar essence, and myriad numinous mushrooms of this very hall converge before this incense burner. May I attain the Dao and achieve transcendence, my entire household receive blessings, and the world be graced with kindness. May the jade lads and jade maidens of the ten directions attend the fragrant smoke, transmitting my words directly to the presence of the Most High, the Jade Emperor before the Golden Gates of the Jade Capital.",
      "start_char": 1350,
      "end_char": 2654,
      "start_sentence": 48,
      "end_sentence": 108,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.83877897262573,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上洞玄灵宝众简文.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "投五方真文简法 各以其日，五色书简，如上法。 次登山，先东向叩齿，咒香发炉，悉如上法。 次叩齿十二通，咒曰： 玄上高灵，元始尊神。 大圣徘徊，万真临轩。 三景敷晖，庆云四陈。 上告校图，推算九天。 今日启愿，投刺灵山。 丹书赤字，自然真文。 上告五帝，记名玉篇。 万神监映，日月明言。 愿度愿生，愿神愿仙。 天地星宿，玄照我身。 三官九府，五岳大神。 普告无穷，削除罪根。 元始大开，莫不纳言。 七祖幽魂，受福自然。 三涂五苦，永离八难。 得与三景，同晖紫晨，转轮不灭，身得飞仙。 毕，读刺竟，投於绝岩之中，便散香灵山之上。 次叩齿三通，向本命咒曰： 元始监映，仙名已书。 三官九府，罪莫不除。 散香五帝，告明太虚。 请如所陈，万劫长存。 仰咽九气。 次咒香复炉如上法。 八节、甲子、本命，五方用事，同此一法。 太上洞玄灵宝众简文竟",
      "translated_text": "**Method for Presenting the Five Directions’ Perfected Texts on Tallies**\n\nOn each respective day, inscribe the tallies in the five colors, following the method above. Then ascend the mountain, first facing east and knocking the teeth, reciting the incense incantation and kindling the censer, all as in the method above.\n\nNext, knock the teeth twelve times and recite the incantation:\n\nO Mystic Loftiness, Exalted Spirit,\nPrimal Beginning, Venerable Divinity.\nGreat Sage meandering,\nMyriad Perfected descending to the hall.\nThree luminaries spread their radiance,\nAuspicious clouds arrayed on four sides.\nAbove, report to the Inspector of Charts,\nWho reckons and computes the Nine Heavens.\nToday I make my vow,\nPresenting my tally to the numinous mountain.\nCinnabar-script in vermilion characters,\nThe spontaneous Perfected Text.\nAbove, I report to the Five Thearchs,\nRecording my name in the Jade Register.\nMyriad spirits bear witness,\nSun and moon clearly attest.\nMay I attain deliverance, may I attain life,\nMay I attain spirithood, may I attain transcendence.\nHeaven and earth, stars and constellations,\nMysteriously illumine my body.\nThree Officials and Nine Bureaus,\nThe great gods of the Five Marchmounts.\nUniversally proclaim without end,\nEradicating the roots of transgression.\nThe Primal Beginning opens wide,\nNone shall reject my words.\nThe hidden souls of my seven ancestors\nReceive blessings as a matter of course.\nThe Three Paths and Five Sufferings,\nForever parted from the Eight Perils.\nMay I join the Three Luminaries,\nTogether shining in the Purple Dawn,\nThe Wheel of Rebirth unceasing,\nMy body attaining flight as an immortal.\n\nWhen the recitation of the tally is complete, cast it into the abyss of the sheer cliff, then scatter incense upon the numinous mountain. Next, knock the teeth three times and face your natal direction, reciting the incantation:\n\nThe Primal Beginning bears witness,\nMy immortal name already inscribed.\nThree Officials and Nine Bureaus,\nNo transgression remains unabsolved.\nScatter incense to the Five Thearchs,\nProclaiming to the luminous Great Void.\nAs I have petitioned,\nMay I endure for ten thousand kalpas.\n\nThen swallow the nine breaths of qi. Next, recite the incense incantation and kindle the censer as in the method above.\n\nOn the Eight Nodal Days, *jiazi* days, and one’s natal day, when performing the rites for the five directions, employ this single method.\n\nHere ends the *Scriptures of Tallies of the Most High Cavernous Mystery Numinous Treasure*.",
      "overlap_context": "erious Heaven of the North,\nFive qi meandering.\nWithin dwells the Black Emperor,\nTwin August Ones of the Supreme Tenuity.\nGovernor of talismanic commands,\nTranscendents refining the Eight Potencies.\nAzure skirts and feathered retinue,\nDragon-script and phoenix robes.\nThose whom the Lord promotes,\nAscend to the jade steps.\n\nThe forty characters of the Northern Perfected Text are customarily inscribed in black on white paper on the day of *lidong* (Beginning of Winter) of one’s natal *jiazi* year.",
      "start_char": 2655,
      "end_char": 3028,
      "start_sentence": 109,
      "end_sentence": 138,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.431937456130981,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上洞玄灵宝众简文.txt",
        "category": "玉诀类"
      }
    }
  ]
}