{
  "source_id": "太上九真明科",
  "source_file": "chunked_daozang\\太上九真明科.json",
  "total_chunks": 8,
  "total_original_chars": 8966,
  "total_translated_chars": 60339,
  "total_translation_time": 267.19248628616333,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\太上九真明科.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Nine Perfected Illuminating Regulations**\n\n**Scripture Title:** *The Supreme Nine Perfected Illuminating Regulations*. Author unknown, approximately composed during the Eastern Jin or Southern Dynasties. Compiled from excerpts of *The Scripture of Great Mystery and Wondrousness*. Source text: *Daoist Canon of the Zhengtong Era*, Orthodox Section, Part One.\n\nThe Supreme Nine Perfected Illuminating Regulations\n\nThe Most High addressed the Heavenly Thearchs, Later Sage Lords, High Ministers and Azure Lads, and Perfected Ones of the Great Ultimate, saying: All later disciples who obtain and behold the Three Caverns’ precious chapters, the secret scriptures of the primordial day, have their names inscribed in golden characters in the Eastern Florescence, ascending to the Supreme Clarity. Though they have not yet transcended the mundane, they hold the reins of the Purple Court—all are persons destined for ascension and deliverance.\n\nYet though they have seen these texts, without knowing the *Nine Perfected Illuminating Regulations*, the protocols and standards, the wondrous writings of the Three Caverns, and the Most High’s precious scriptures, they cannot readily unroll them. The illuminating regulations and precious secrets are concealed within the Palace of the Dark Capital, in the Golden Chambers of the Jade Metropolis, and are not transmitted to the world.\n\nThey clarify the profound mysteries of the Three Caverns, establish the ritual forms of the host of Perfected Ones, deliver those bound by karmic debts in the hidden bureaus, and elevate the Seven Mysteries to the registers of immortality. They truly encompass the myriad Dao, dissolve the heavy burdens of the Nine Yin, and their wonders may be immediately applied; their regulations may be solemnly observed.\n\nNow, therefore, I set forth the three ranks of their chapters to assist in the propagation of the Three Wondrous and Primordial Numinous Scriptures, that they may serve as admonitions to later disciples. Let those who diligently aspire to the Dao take heed and be cautious in their secret covenants.\n\nThe Heavenly Thearchs, the Nine Mysterious Imperial Lords of Later Sages, the High Ministers and Azure Lads, and the Perfected Ones of the Great Ultimate bowed their heads and respectfully inquired of the Most High Heavenly Worthy: The supreme and true methods are lofty, transcendent, and limpid; the myriad schools are vast and boundless, profoundly quiescent and empty. Their wonders surpass the abstruse, their teachings transform the Three Vehicles, and they encompass kalpas beyond measure—how could they be surpassed by illuminating regulations?\n\nThe Most High replied: Your words are excellent. As for later generations, unless they are descendants of the Jade Void, born of spontaneous natural harmony, they all emerge from the turbid currents of the Primordial Chaos, mired in clamor and defilement. Their conduct is not purely formed, their natures not wholly refined. Though they may yearn for the profound mysteries, their minds constantly stray, and their actions deviate. None fail to commit transgressions. Transgressions arise externally, extinguishing life internally. Those who study under such conditions—how can they not drift far from the truth?\n\nIf the Three Offices report their faults, and they face judgment in the hidden bureaus, with calamities extending to their seven ancestors and sins accumulating upon themselves—those who commit such transgressions, if they awaken to the existence of the illuminating regulations with their systems of correction and punishment, and to the greatness of the sagely transformation, which permits redemption through prescribed methods, and apply them according to the regulations, will surely draw near to the Perfected in due time.\n\nFor scholars who lack these standards, their diligent contemplation and arduous devotion are in vain. Now, therefore, I set forth the *Nine Perfected Three Ranks of Illuminating Regulations*, which may be transmitted to later disciples who are to become Perfected Ones.\n\nThe Imperial Lords, High Ministers and Azure Lads, and Perfected Ones of the Great Ultimate then withdrew to purify themselves in the Supreme Clarity, receiving the *Primordial Numinous Scripture of Great Mystery and Wondrousness* and the *Nine Perfected Regulations*. They concealed them in golden repositories and jade coffers, guarded by jade lads and jade maidens, three thousand each, who attended to the numinous texts. They scattered incense in the empty courtyard, and flying dragons and poisonous beasts, giant serpents a thousand fathoms long, brandished their claws upon the cloud-walls, fortifying the Jade Pass.\n\nThus, the Ten Heavenly Great Sages and the Perfected Immortals of the Nine Palaces, three times each month, all ascend to the Dark Palace to receive the illuminating regulations, paying homage to the scriptural texts.\n\nThe High Minister and Azure Lad said: All who possess bones of gold and marrow of jade, whose names are recorded in the Azure Palace, and who obtain these texts, must keep them secret and put them into practice. In thus receiving and observing the rites, harmonizing with the supreme canon, applying the regulations and measures, and aligning with the Perfected in merit, they may redeem sins and dispel calamities, dissolving karmic entanglements. The ancestors of the Seven Mysteries rejoice, and their own persons ascend to feast in the Jade Metropolis.\n\n**The Upper Rank Transmission of Scriptures from the Nine Perfected Illuminating Regulations of the Dark Capital**\n\n**First Chapter of the Upper Rank of the Dark Capital:**\nThe *True Scripture of the Great Cavern*, the *Precious Scripture of the Feminine One*, and the *Primordial Numinous Scripture of Great Mystery and Wondrousness*—the three wondrous chapters, the precious writings of the Most High Jade Emperor—are concealed in the Palace of Great Mystery above the Nine Heavens, within the Jade Chambers of the Numinous Terrace of the Great Mystery.\n\nThe ancient regulations of the Primordial Thearch decree that these scriptures be transmitted once every ten thousand kalpas. The three true and illuminating Daoist canons, the standards for studying the Perfected, and the supreme orthodox regulations permit three transmissions within seven thousand years. Jade lads and jade maidens, seven thousand each, hold incense and attend to the numinous texts.\n\nAccording to the regulations for transmission, one must face the scriptures after a hundred days of purification, swear an oath with golden clasps, and unite the jade lads and jade maidens in accordance with the Four Poles’ regulations. Those who transmit without adhering to the regulations will incur sins extending to their seven ancestors, their hidden souls condemned to servitude, swallowing fire and eating coals, bearing mountains and transporting stones to fill the boundless abyss. Their own persons will suffer the punishment of the wind-blade, their bodies perishing and forms disintegrating, eternally confined to hell, never to attain immortality.\n\n**Second Chapter of the Upper Rank of the Dark Capital:**\nTo transmit the *Thirty-Nine Chapters of the True Scripture of the Great Cavern* to later disciples, one must swear an oath with ten taels of superior gold, twenty-five catties of copper, five pairs of golden clasps, one golden fish, one jade dragon, and one tael of green silk to bind the clasps.\n\nFor the *Feminine One*, five taels of superior gold, fifty bolts each of five-colored patterned silk, one catty of incense, and three pairs of golden clasps.\n\nFor the *Primordial Numinous Scripture of the Cavern and True Mystery*, three taels of superior gold, one hundred feet of purple silk, twenty-seven feet of green silk, five taels of red silk, one catty of incense, and one tael of cinnabar.\n\nThe Primordial Thearch requires sincere oaths; no deficiencies are permitted, for deficiencies violate the regulations. If the master transgresses, the jade lads and jade maidens attending the scriptures will be returned to their original palaces. Within three years, the master will suffer the trial of the wind-blade and naturally lose the scriptures. Those who receive them without adhering to the illuminating regulations will lose their sight, their forms will disintegrate, and their seven ancestors and parents will be consigned to the punishments of the Northern Feng. After ten thousand kalpas, they will be reborn in non-human destinies. Disciples, be cautious!\n\nThe Third Scroll of the Supreme Category of the Mysterious Capital states: All those bearing the golden name Donghua and the jade title Shangqing, having received *The Jade Scripture of the Supreme Empyrean*, *The Purple Ascension of the Flaming Radiance and the Mysterious True Transformation Sutra*, *The Seventy-Four Methods of Shangqing Transformation*, *The Central Scripture of the Nine Perfected*, *The Eight Arts of the Hidden Earth of Cinnabar Scenery and Daoist Essence*, *The Jade Scripture of Dissolving Form and Transmuting through Flowing Light*, and *The Seven Transformations Dancing in Heaven*, have obtained the lofty scriptures of the Nine Heavens’ Perfected Kings, the Primordial Heavenly King, the Supreme Heavenly Thearch, and the Central Yellow Elder Lord, received within the Great Void and the Nine Mysteries—scriptures of the highest order from the realm of Non-Being.\n\nAll are secretly kept within the Palace of the Supreme Numinous Capital, in the Purple Chamber, presided over by the Lords of the Three Origins, attended by three thousand jade lads and jade maidens. From the inception of the Primordial Beginning, these scriptures were transmitted once every seven thousand kalpas. After the establishment of the Three Ways and the Rectification of the Dao, transmission is permitted thrice within seven thousand years, and if a worthy recipient appears within seven hundred years, transmission is also permitted. All transmissions require a fast of ninety days, or thirty days, or nine days, followed by an oath of covenant, after which jade lads and jade maidens are assigned in accordance with the regulations of the Four Poles. Should transmission occur without adherence to the regulations, the transgressor’s seven ancestors and parents will be consigned to the punishments of the ghostly officials, compelled to haul stones from Mount Meng to fill the River of Night. After ten thousand kalpas, they will be reborn in non-human destinies, while the transgressor’s own body will suffer the trial of the wind-blade, naturally lose the scriptures, and forever forfeit the attainment of immortality. Those who transmit must be cautious.\n\nThe Fourth Scroll of the Supreme Category of the Mysterious Capital states: For the transmission of *The Jade Scripture of the Supreme Empyrean*, the oath requires golden fish, jade dragons, forty-two feet of green silk, and three pairs of golden seals. For *The Purple Ascension of the Flaming Radiance*, the oath requires fifty feet each of five-colored brocade, five taels of refined gold, five catties of aloeswood, one catty of true cinnabar, one scripture knife, seven golden pearls, and seventy feet of crimson silk. For *The Seventy-Four Methods of Shangqing Transformation*, the oath requires forty feet of green silk, ten taels of refined gold, six pairs of golden seals, one catty of fine incense, and golden fish and jade dragons. For *The Central Scripture of the Nine Perfected*, the regulations require cutting hair as a covenant; now, ninety feet of white silk are used as a substitute, corresponding to the number of the Nine Perfected. One catty of green silk thread, twenty-four feet of crimson silk—this is the oath of the Sun’s Radiance; twenty-four feet of azure silk—the oath of the Moon’s Splendor; and three pairs of golden rings—the pledge of the Ever-Changing Lad’s transformation.\n\nFor *The Eight Arts of the Hidden Earth of Cinnabar Scenery and Daoist Essence* and *The Jade Scripture of Dissolving Form and Transmuting through Flowing Light*, the requirements are ten taels of refined gold each, one golden fish and one jade dragon, forty feet of green silk, and forty feet of purple silk, with three pairs of golden rings each. For *The Seven Transformations Dancing in Heaven*, the oath requires five taels of refined gold, one catty of cinnabar, and thirty-two feet of green silk. The pledge must be made with sincerity; no deficiencies are permitted, for deficiencies violate the regulations. The master shall cast the heavenly pledge into the mountains to succor the destitute, while the remainder is to be used for the preparation of scriptural implements and not dispersed elsewhere. Should the master transgress the supreme regulations, their jade lads and jade maidens will be revoked, their lifespan and destiny records diminished, and their names registered for return to the Northern Feng. Those who receive the scriptures without adhering to the regulations will lose their souls and spirits, suffer the trial of the wind-blade, and within three years naturally lose the scriptures, forever forfeiting the attainment of immortality.\n\nThe Fifth Scroll of the Supreme Category of the Mysterious Capital states: *The Wisdom of Dispelling Demons*, *The Hidden Book of Jade Clarity*, *The Golden Chapters of the Supreme Empyrean’s Soaring Mystery*, *The Crimson Book of the Purple Phoenix and the Eight Sceneries of the Morning Sun*, *The Golden Perfection and Jade Radiance*, *The Numinous Book of Purple Script*, *The Golden Pendants and Jade Girdles*, *The Supreme Scripture of the Golden Root*, and *The Orthodox Dharma of the Three Heavens* are all precious scriptures of the Supreme Lord of the Great Dao, the Primordial Heavenly King, and the Golden Portal Thearch, secretly kept within the Palace of Jade Clarity, behind the golden chambers and purple gates, guarded by three thousand jade lads and jade maidens each, attendants of the numinous scriptures.\n\nFrom the inception of the Primordial Beginning, these were transmitted once every thousand kalpas. After the establishment of the Three Heavens and the Rectification of the Dao, transmission is permitted thrice within seven hundred years, and if a worthy recipient appears within a hundred years, one transmission is permitted. Jade lads and jade maidens are assigned in accordance with the illuminating regulations of the Four Poles. Transmission requires a fast of ninety days, or thirty days, or nine days. Should transmission occur without adherence to the regulations, the transgressor’s seven generations of ancestors will be condemned to eternal ghostly servitude without release, while the transgressor’s own body will suffer the trial of the wind-blade, die as a lowly ghost, and forever forfeit the attainment of immortality.\n\nThe Sixth Scroll of the Supreme Category of the Mysterious Capital states: For the transmission of *The Wisdom of Dispelling Demons*, *The Golden Chapters of the Supreme Empyrean’s Soaring Mystery*, and *The Crimson Book of the Purple Phoenix and the Eight Sceneries of the Morning Sun*, the requirements are ten taels of refined gold, one jade tablet, one golden fish and one jade dragon, and forty feet of purple silk. For *The Supreme Scriptures of the Golden Root* and *The Numinous Book of Purple Script*, the requirements are five taels of refined gold, one golden slip and one jade tablet each—each slip and tablet being one foot six inches in length and two inches four fen in width—one golden fish and one jade dragon, one hundred feet of purple silk, and forty feet of green silk. For *The Orthodox Dharma of the Three Heavens*, the requirements are thirty feet of green silk, forty-three feet of green cloth, and five pairs of golden rings as a secret oath, along with ten taels of refined gold as a pledge to the spirits.\n\nFor *The Golden Perfection and Jade Radiance*, *The Jade Girdles and Golden Pendants*, and *The Hidden Book of Jade Clarity*, the oath requires one golden fish and one jade dragon each. No deficiencies are permitted in adherence to the regulations, for deficiencies will result in the master’s jade lads and jade maidens being revoked and their name registered for return to the Northern Feng. Those who receive the scriptures without adhering to the regulations will lose their souls and spirits, suffer the trial of the wind-blade, and within three years naturally lose the scriptures, forever forfeiting the attainment of immortality.\n\nThe Seventh Scroll of the Supreme Category of the Mysterious Capital states: *The Seven Stars’ Transference of Destiny*, *The Flying Feather Scripture of White Plumes and Black Wings*, *The Seven Origins’ Treading of the Celestial Net*, *The Supreme Hidden Book*, and *The Six Jia of the Numinous Flight* are all the Dao of the Supreme Thearch and the Heavenly Thearch of the Grand Tenuity, the secret scriptures of transformation and concealment, secretly kept within the Supreme Jade Palace, in the Purple Chamber, attended by three thousand jade lads and jade maidens.\n\nFollowing the regulations, transmission occurs once every seven thousand years. After the Three Heavens establish rectitude, this is amended to permit transmission within seven hundred years, or even within a century if a worthy recipient appears. The transmission ritual requires a ninety-day or thirty-day purification fast, after which jade lads and jade maidens are assigned in accordance with the *Bright Statutes of the Four Poles*. Those who transmit without adhering to the regulations shall incur guilt extending to their seven ancestral lineages, condemned to perpetual servitude as *guitou* in the Northern Feng, enduring ten torments and eight calamities. Their own bodies shall suffer the trial of the wind-blade, forever consigned to the dark abyss, and they shall never attain immortality.\n\nThe Eighth Scroll of the Supreme Category of the Mysterious Capital states: For the transmission of *The Seven Stars’ Transference of Destiny*, prepare thirty-two feet of blue silk, thirty feet of crimson damask, ninety feet of phoenix-patterned gauze, and a pair of golden clasps. For *The Flying Feather Scripture of White Plumes and Black Wings*, offer two taels of gold, thirty-two feet of blue damask, to substitute for the oath of severed hair and blood. For *The Seven Origins’ Treading of the Celestial Net*, prepare thirty feet of brocade and the oath of the golden fish and jade dragon. For *The Six Jia of the Numinous Flight*, provide sixty feet of white silk, six pairs of golden rings, and six taels of blue thread. The celestial statutes demand absolute sincerity; any deficiency violates the Mysterious Statutes. The master shall reclaim the jade lads and jade maidens, erase the disciple’s name from the Azure Register, and return them to the Northern Feng. Those who receive the scriptures without adhering to the regulations will lose their essence and spirit, suffer the trial of the wind-blade, and within three years naturally lose the scriptures, forever forfeiting the attainment of immortality.\n\nThe Ninth Scroll of the Supreme Category of the Mysterious Capital states: The transmission includes the *Square-Zhang Divine Manifestation*, the *Hidden Writ of the Seven Origins and Eight Heavens of the Vast Expanse*, the *Flowing Gold Fire Bell*, the *Golden Spirit Tiger Talisman*, the *Demon-Dispelling Stem-and-Branch Night-Illuminating Divine Candle*, the *Eight Arts of Concealment and the Purple Clarity Jade Talisman*, the *Five Registers of the Cavernous Mystery and the Supreme Talisman of the Six Jia*, and the *Secret Writ of the Five Phases and the Jade Canon of the Mysterious Capital*—altogether six hundred sections. The Supreme Thearch has marked these texts within the original scriptures to serve as their foundation. The transmission must strictly adhere to the regulations; any deficiency incurs the same penalty as above. Scriptures without talismans invite harm from celestial demons, while talismans without scriptures render devotion ineffectual, and the divine perfected will not descend. The statutes decree that neither may be practiced in isolation; violation of this rule incurs the same penalty. Both scriptures and talismans originate from the *qi* of spontaneity and the principles of emptiness and non-being, and thus may not be cultivated separately. Without adhering to the statutes, the Dao can never be achieved.\n\n---\n\n**The Middle Category Admonitions on Transgressions in the Statutes of the Nine Perfected of the Mysterious Capital**\n\nThe First Scroll of the Middle Category of the Mysterious Capital states: Among later learners, those whose seven generations of ancestors have committed murder, banditry, plunder, treacherous schemes, illicit lust, usurpation, or rebellion, or whose nine clans have colluded in treason and impiety, shall bear the heaviest retribution. Their grievances and transgressions accumulate in the Nine Yin, beyond the reach of pardon. Their descendants, burdened by residual calamity, may not partake in the true scriptures or secretly receive the sacred texts. If, however, they endure hardship, aspire to self-improvement, confess their sins to the Seven Mysteries, perform meritorious deeds, liberate imprisoned souls, and expose themselves beneath the Three Luminaries with unbound hair, persisting for three years without wearying, then—having prepared substantial offerings—they may cast them into the Nine Rivers to atone for past transgressions. Only thereafter may they observe a hundred-day purification fast and receive the sacred scriptures to proceed with their practice. Those who bear such sins yet fail to first punish and reproach themselves, confessing to Heaven and the unseen, and who receive the teachings, shall—both master and disciple—suffer the trial of the wind-blade. Their seven ancestral lineages shall be eternally confined to the dark abyss, bearing stones and mountains for ten thousand kalpas without release. Their bodies shall perish, the scriptures shall be lost, and they must exercise utmost caution.\n\nThe Second Scroll of the Middle Category of the Mysterious Capital states: Those who wish to cultivate the supreme methods yet bear grave sins—having taken lives with their own hands, cruelly oppressed the lowly, slaughtered living beings, plundered the common folk, schemed deceitfully, colluded with their nine clans, envied the worthy and capable, or rebelled against their masters—shall incur unpardonable offenses, their transgressions accumulating in the Nine Yin. They may not partake in the wondrous methods or cultivate the scriptures. If, however, they endure hardship, confess their initial crimes, perform meritorious deeds, expose themselves beneath the Three Luminaries with unbound hair, and prostrate themselves for three years to atone for their transgressions, they may redeem their faults, liberate their seven ancestral lineages, and separate their destinies from the Three Realms. Only thereafter may they observe a hundred-day purification fast and receive the sacred scriptures to proceed with their practice. Those who bear such sins yet fail to first confess, reproach, and punish themselves, and who receive the scriptures, shall—both master and disciple—suffer the trial of the wind-blade, endure ten torments and eight calamities, and be consigned to the dark springs. The scriptures shall be lost, and their seven generations of ancestors shall serve as eternal prisoners in the dark abyss, never to be released for ten thousand kalpas. Learners must exercise caution.\n\nThe Third Scroll of the Middle Category of the Mysterious Capital states: Any learner who, having received the Three Wonders’ sacred texts or the *Supreme Clarity* secret scriptures, carelessly reveals their catalog, displays them to the unworthy, or profanes their mysteries, shall—upon the first to the tenth offense—be penalized with three years of severed merit and suspended practice, after which they may resume purification and cultivation. Beyond this, their guilt shall accumulate in the Nine Yin, their seven ancestral lineages shall suffer retribution, and they shall be condemned to servitude in the Three Prisons, bearing stones and mountains, enduring ten torments and eight calamities. Only after ten thousand kalpas may they emerge, but they shall be reborn beyond the path of humanity. Their own bodies shall suffer the trial of the wind-blade, lose their sight and limbs, die as lowly ghosts, and never attain immortality. Those who transmit the teachings must exercise caution.\n\nThe Fourth Scroll of the Middle Category of the Mysterious Capital states: Any learner who, having received the *Supreme Clarity* sacred scriptures or the Three Wonders’ sacred texts, weeps, encounters corpses, or is defiled by blood and filth, shall—upon the first to the tenth offense—be penalized with one year of severed merit and suspended practice, after which they may atone in accordance with the statutes, redeem their sins in the Great Yin, and resume purification and practice. Beyond this, upon the twenty-fourth offense, their lifespan shall be diminished, and their jade lads and jade maidens shall return to their original abodes. Within three years, they shall lose the scriptures and perish. Their seven ancestral lineages shall serve as eternal ghostly laborers, never to be released for ten thousand kalpas. Learners must exercise caution.\n\n**The Fifth Scroll of the Middle Grade of the Mysterious Capital states:** Any learner who receives the *Supreme Clarity* sacred scriptures or the Three Caverns’ secret texts must not approach women or engage in yin-yang intercourse, for these defile and corrupt the true qi. From ten to twenty-four offenses, they shall be penalized with three hundred days of severed merit and suspended practice, after which they may purify themselves and resume cultivation. Beyond this, their jade lads and jade maidens shall each return to their original abodes, their lifespan shall be diminished, and within a year they shall lose the scriptures and perish. Their seven ancestral lineages shall be punished—learners must exercise caution.\n\n**The Sixth Scroll of the Middle Grade of the Mysterious Capital states:** Any learner who receives the *Supreme Clarity* sacred texts or the Three Caverns’ secret texts yet harbors malicious intent, commits acts of cruelty, kills living beings, engages in violence, schemes with deceit, envies the worthy, resents the capable, attacks kin of the same qi, or undermines their scripture master—upon the first to fifth offense—shall be permitted to atone by pledging sincerity, making amends in the Nine Yin, redeeming their sins in the Five Marchmounts, and enduring ten years of severed merit and suspended practice. They may then purify themselves and resume their studies. Beyond five offenses, up to twenty-four, the Four Administrations shall seize and execute them, capturing their hun and shen to be punished in the Northern Feng. Their seven ancestral lineages shall serve as laborers, and after ten thousand kalpas, they may return to be reborn in non-human realms. Their jade lads and jade maidens shall each return to the Upper Palaces, and within a year, they shall lose the scriptures and perish, never attaining immortality—learners must exercise caution.\n\n**The Seventh Scroll of the Middle Grade of the Mysterious Capital states:** Any learner who receives the *Supreme Clarity* sacred scriptures or the Three Caverns’ secret texts must not urinate facing north, consume the meat of the five pungent vegetables or the six livestock, drink wine, engage in licentiousness, violate the Dao, disrespect the dharma, or waver in devotion. From ten to twenty-four offenses, they may atone in accordance with the statutes by pledging sincerity, making amends in the Great Yin, enduring one year of severed merit, and then purifying themselves for ninety days before resuming their studies. Beyond this, their lifespan shall be diminished, their body shall endure the trials of the wind-knife, and their seven ancestral lineages shall be punished in the Three Ways. Within five years, they shall lose the scriptures and perish—learners must exercise caution.\n\n**The Eighth Scroll of the Middle Grade of the Mysterious Capital states:** Any learner who receives the *Supreme Clarity* sacred scriptures or the Three Caverns’ secret texts must, in accordance with the statutes, present offerings and sincerity to their master, announce their purification, and only then receive the scriptures. They must not, without declaration or oath, recklessly peruse the sacred texts. All learners who obtain the scriptures must receive them from a master—these are bestowed by unseen agents. They must not lightly copy or alter the sacred texts, impose their own interpretations, corrupt the ancient names and sounds, or devise their own methods. The Four Administrations shall record their offenses, and their sins shall be inscribed in the Nine Yin. From the first to third offense, they shall endure three years of severed merit and suspended practice, atone in accordance with the statutes, present offerings to the Nine Rivers, and purify themselves for thirty days before resuming cultivation. Beyond this, up to twenty-four offenses, their jade lads and jade maidens shall each return to their original abodes, their lifespan shall be diminished, their body shall serve as a ghostly official, and their seven ancestral lineages shall serve as eternal ghostly laborers. After ten thousand kalpas, they may return to be reborn in non-human realms—learners must exercise caution.\n\n**The Ninth Scroll of the Middle Grade of the Mysterious Capital states:** Any who receive the *Supreme Clarity* sacred scriptures or the Three Caverns’ wondrous texts must place them in a separate chamber upon a high bed, four feet and four inches in height and five feet in width, distinct from ordinary or inferior scriptures. They shall light lamps, burn incense, and make morning and evening offerings with reverent vows, always maintaining their devotion. They must not allow those of impure qi, those defiled by filth, or women to enter and disturb the divine perfected. These are the statutes observed in the world.\n\nThe recipient of the scriptures must not wear clothing, shoes, or sandals that are improper or mingled with the common. In lying down, resting, sitting, or rising, they must always remain distinct from ordinary things. From the first to twenty-fourth offense, they shall be penalized with one year of severed merit and suspended practice, after which they may purify themselves and resume cultivation. Beyond this, they shall be seized by the Four Administrations, their transgressions reported to the Jade Clarity, and their names returned to Fengdu. Within seven years, they shall lose the scriptures and perish, and their seven ancestral lineages shall be punished—learners must exercise caution.\n\n---\n\n**The Lower Grade Redemption Scroll of the Mysterious Capital’s Nine Perfected Bright Statutes**\n\n**The First Scroll of the Lower Grade of the Mysterious Capital states:** If any later learner’s seven ancestors or parents committed the sins described in the first scroll of the Upper or Middle Grades of the Mysterious Capital during their lifetimes, their punishment shall be especially severe, their sins bound in the Nine Yin. Their seven ancestors shall face their accusers, enduring eternal torment in the dark prisons, their misfortunes extending to their descendants, who shall be pursued by unseen forces without release. They must stand bare beneath the Great Yin, dishevel their hair, and kowtow, confessing their sins to the Nine Yin. After three years of self-reproach, at the year’s end, they shall present nine pairs of gold rings, one liang of blue silk, and one gold figurine, casting them into the mouth of the Three Rivers to redeem the sins of their seven ancestors and deliver their souls from the trials of the dark prisons.\n\nThe statute requires a peachwood tablet inscribed in red with five lines, recording: *\"On such-and-such a day, month, and year, I, [name], of [prefecture], [county], and [village], confess that my seven ancestors, parents, and myself have committed the sins described in the first scroll of the Upper and Middle Grades of the Mysterious Capital, our sins bound in the Nine Yin. Now, in accordance with the statutes, I present nine pairs of gold rings and one gold figurine to redeem the cruel punishments of the dark prisons. I cast this petition to the Water Officials, seeking absolution. May my sins be erased by the Three Offices, and my soul ascend to the Nine Heavens.\"* Upon completion, they shall bind the objects and tablet with blue silk and sink them with a blue stone. At the moment of sinking, they shall face north, raise their head, and recite the incantation: *\"Nine Lords of the Great Yin, divine officials of the executive bureau, I now declare my words and report to the river’s source. I cast my pledge into the Nine Springs to deliver my seven ancestors. May our grievances be dissolved, and may I ascend as an immortal.\"* Upon completion, the punishments of their seven ancestors shall be released, allowing them to depart the dark prisons and ascend to the Hall of Blessings. The learner may then proceed to study the sacred scriptures, and after nine years, the true numinous shall descend in form, ascending with the gods. The statutes are especially severe—no further transgressions are permitted.\n\n**The Second Scroll of the Lower Grade of the Mysterious Capital states:** Any who wish to cultivate the Dao of the Supreme Perfected and whose own body has previously committed the sins described in the second scroll of the Upper or Middle Grades shall find their punishments deeply bound, their sins coiled in the Nine Yin, obstructing the unseen realms. This shall extend to their seven ancestors, who shall face the trials of the destitute souls, their suffering unending. They must first stand beneath the Great Yin, face north, dishevel their hair, and kowtow to the Three Luminaries, confessing their sins. After three years of self-reproach...\n\nWhen the year concludes, one must provide a catty of cinnabar, a scribing knife, an ounce of gold, and a golden figurine, casting them into the confluence of the Three Rivers to redeem one’s own grievous transgressions, unbind the knots before the Three Offices, and extricate one’s seven ancestors. The ritual requires a foot of azure silk inscribed with cinnabar, bearing the following record: *\"On the first day of the [specific] month in the [specific] year, [Name], of [Prefecture], [County], [Village], aged [X] years, whose person has hitherto committed no visible transgressions but has erred against the Mysterious Statutes, his hands having perpetrated primordial evil, now incurs the sins of the second scroll of the Upper and Middle Grades of the Mysterious Capital. His sins coil in the Great Yin. In accordance with the statutes, he offers a golden figurine, a catty of cinnabar, and a scribing knife to redeem his own foul transgressions. He casts this petition to declare his fate, prostrating himself before the numinous, that he may be unbound and his sins dissolved in the Nine Rivers, his person attaining longevity.\"* Upon completion, bind the objects and text with azure silk, then sink them with a blue stone. At the moment of submersion, face north, raise your head, and recite the incantation:\n\n*\"Above lies the Great Yin, governed by the Nine Lords.\nI now declare my words, reporting to the source of the rivers.\nRedeem my sins, unbind the knots,\nDeliver me from ninefold calamities.\nWandering souls and paired spirits,\nEach returns to their natural state.\nMisfortune vanishes, and I learn immortality—\nMy person ascends.\"*\n\nWhen finished, the knots of the Nine Yin shall be untangled, and the souls of grievance shall return to their natural state. One may then proceed to study the scriptures of the Supreme Clarity. After nine years of unwavering practice, the true numinous shall descend in form, merging with the divine.\n\nThe statutes are especially severe—no further transgressions are permitted.\n\n**The Third Scroll of the Lower Grade of the Mysterious Capital states:** Any who cultivate the precious scriptures of the Supreme Clarity and the esoteric texts of the Cavernous Mystery, yet whose person has committed the sins described in the third scroll of the Upper or Middle Grades, shall find their punishments bound to the Great Yang, seized by the Four Offices, and reported to the Jade Clarity. For such transgressions, one must sever attachments, practice self-restraint, enter the chamber to burn incense, kowtow in confession, face north, and click the teeth ten times. Raising the head, recite the incantation:\n\n*\"O profound and distant Mysterious Primordial,\nRarely heard in the lower world,\nI lightly divulged the precious and true,\nOffending the august honor of the Emperor on High.\nI now assume responsibility,\nProstrating myself at the gates of the numinous.\nI humbly beseech the Most High\nTo bestow the grace of the Mysterious,\nDescending with numinous resonance,\nAwakening the natural.\"*\n\nWhen finished, kowtow nine times. After three years of such confessions, followed by thirty days of purificatory abstinence, one may be absolved by the Three Offices, the punishments of the Nine Yin dissolved. One may then resume cultivation, treasuring the secret recitations, and in time attain flight as an immortal.\n\nThe statutes are especially severe—no further transgressions are permitted.\n\n**The Fourth Scroll of the Lower Grade of the Mysterious Capital states:** Any who cultivate the Dao of the Supreme Perfected yet whose person has committed the sins described in the fourth scroll of the Upper or Middle Grades shall find their sins coiled in the Nine Yin, their punishments suspended before the Jade Clarity. The transgressor must, at midnight in the central courtyard, kindle thirty-two lamps to cleanse defiling qi, purifying both inner and outer. Entering the chamber to burn incense, face north, kowtow, and confess the transgressions. Click the teeth thirty-six times, then raise the head and recite the prayer:\n\n*\"The turning of the world’s fate brings ruin,\nThe desiccated corpse’s shadow grows manifest.\nDefiling qi swirls in profusion,\nConfronting the true.\nI violated the statutes and breached sincerity,\nMy person entering the realm of sin.\nI redeem myself through ritual and confession,\nWashing clean with luminous lamps.\nMisfortune scatters before the Three Clarities,\nFortune fills and my person prospers.\nThe Dao’s shade flows in curves,\nIts blessings boundless.\"*\n\nWhen finished, kowtow nine more times. After a year of such practice, followed by thirty days of purificatory abstinence, one may resume cultivation. Conduct must be meticulous, statutes observed with care, and the heart devoted to the true. After nine years, one shall ascend in broad daylight to the dawn.\n\n**The Fifth Scroll of the Lower Grade of the Mysterious Capital states:** Any who cultivate the Dao of the Supreme Perfected yet whose person has committed the sins described in the fifth scroll of the Upper or Middle Grades shall find their sins bound to the Great Yin, their punishments suspended before the Azure Palace. The transgressor must bathe in fragrant waters, then in the central courtyard provide oil to kindle twenty-four lamps for ninety days. Entering the chamber, face north, kowtow nine times, confess the transgressions, and click the teeth twenty-four times. Raising the head, recite the prayer:\n\n*\"Heaven’s firmament and Earth’s foundation,\nThe two images intermingle.\nYin qi obscures the upright,\nDefiling qi fills all.\nThe spirit is lost, the treasure diminished,\nThe dignity of the Dao impaired.\nWith reverence, I kindle luminous lamps,\nIlluminating the Mysterious Palace above.\nScatter misfortune in the Nine Yin,\nFortune and blessings return to the lineage.\"*\n\nAfter ninety days, conclude with twenty-four days of abstinence. One may then resume the practice of the true methods, ever mindful and cautious, strictly adhering to the statutes. In time, the Mysterious and True shall merge with one’s form, attaining immortality.\n\nThe statutes are especially severe—no further transgressions are permitted.\n\n**The Sixth Scroll of the Lower Grade of the Mysterious Capital states:** Any who cultivate the Dao of the Supreme Perfected yet whose person has committed the sins described in the sixth scroll of the Upper or Middle Grades shall find their transgressions especially grave, seized by the Four Offices, their punishments bound to the Great Yin, confronting them in the Dark Palace. The transgressor must stand beneath the Great Yin, dishevel the hair, kowtow, and confess before the Jade Clarity to extricate themselves from the Great Yin. In accordance with the statutes, one must distribute personal treasures to the poor, providing meals for a hundred people to relieve the hungry for ten years. Entering the chamber, kowtow in self-reproach, face north, click the teeth nine times, and raise the head to recite the incantation:\n\n*\"Heaven is vast, Earth is broad,\nThe Nine Origins unfold.\nMy person treads the gates of fortune,\nYet my sins hang before the Jade Capital.\nEntangled in snares, I fall into the numinous precincts of the Cavernous Mystery.\nI scatter treasures to lift the punishments,\nOffering sustenance to the destitute.\nSins dissolve in the Great Yin,\nFortune arises in ten directions.\nShedding the old, embracing the new,\nBlessings descend without end.\"*\n\nWhen finished, kowtow nine more times. This is the supreme method of the Most High for lifting sins, recorded in the orthodox statutes. After ten years of such practice, the accumulated sins and lingering punishments shall be dissolved in the Great Yin. Upon completing the year of self-reproach, observe a hundred days of abstinence, then resume cultivation. One must vigilantly uphold the laws, never transgressing again.\n\n**The Seventh Scroll of the Lower Grade of the Mysterious Capital states:** Any who study the Dao of the Supreme Perfected yet whose person has committed the sins described in the seventh scroll of the Upper or Middle Grades shall find their sins filling the Supreme Clarity. The transgressor must offer ten catties of fine incense to fellow practitioners in ten different places, each act absolving a year of sin. Entering the chamber to burn incense, face east, kowtow nine times, confess before the Supreme Perfected, click the teeth nine times, and raise the head to recite the incantation:\n\nAmidst the tangled five qi, the Supreme Perfected remain incomplete; the body, tainted by defiled qi, offends the Cavern Gate, harms the viscera, and severs life, disturbing the Three Passes. Violating the statutes and transgressing the precepts, one incurs prolonged karmic retribution. With reverent penance, I now report to the Imperial Honored Ones, beseeching that my case be proclaimed: may I depart from the lower worlds and ascend as a Heavenly Immortal. Thus concludes.\n\nUpon completing this year, observe twenty-four days of abstinence, then resume the practices you have received, and the true numina will descend. The gravity of the statutes is great—never transgress again.\n\n**The Eighth Scroll of the Lower Grade of the Mysterious Capital states:** Any who study the Dao of the Supreme Perfected yet commit the sins described in the eighth scroll of the Upper or Middle Grades shall be seized by the supervisory officials, their transgressions binding the Three Clarities. The offender must burn a *hu* of pure oil as lamps in the central courtyard, the quantity at their discretion, until the oil is exhausted. Additionally, offer ten catties of fine incense to a master who possesses the scriptures, thereby absolving three years of sin. Entering the chamber to burn incense, face north, kowtow nine times, confess the transgression, click the teeth twelve times, and recite the incantation:\n\nThe Heavenly Perfected are lofty and distant, their mysterious radiance descending in clarity. By virtue of past blessings, I have beheld the true scriptures. Yet, failing to grasp the mysterious statutes, I have slighted the celestial numina, violated the truth, and breached sincerity, plunging my person into darkness. Now, with rigorous self-reproach, I report to the Supreme Clarity. Henceforth, I shall purify my former form, uphold the mysterious truth, and align with the Dao. Thus concludes.\n\nAfter three years have passed, observe ninety days of abstinence. If you have already received the teachings from a master, you may resume cultivation; if not, present offerings and visit a master to receive the scriptures, then practice in accordance with the statutes to ascend. The mysterious statutes are exceedingly weighty—never transgress again.\n\n**The Ninth Scroll of the Lower Grade of the Mysterious Capital states:** Any who cultivate the Dao of the Supreme Perfected yet commit the sins described in the ninth scroll of the Upper or Middle Grades shall find their transgressions bound in the Nine Yin and their karmic retribution suspended in the Jade Clarity. The offender must light seven lamps before the hall, enter the chamber, kowtow, confess their sins before the scriptures, click the teeth twenty-four times, and recite the incantation:\n\nThe radiance of jade descends, illuminating the Supreme Clarity above. Through negligence in service and reverence, I have violated the precious scriptures. I fear the Four Offices will list my sins in the Purple Court. With solemn abstinence and reverence, I beseech the true numina to condescend and descend, erasing my sins and dissolving my punishments. I vow to uphold the mysterious statutes and eternally preserve my original integrity. Thus concludes.\n\nAfter one year, observe twenty-four days of abstinence, then resume the practices you have received. The mysterious statutes are exceedingly weighty—be vigilant and never transgress again.\n\nThe **Nine Perfected Statutes of the Great Mystery**, comprising three grades and twenty-seven clauses, originate from the Palace of the Numinous Capital of the Supreme, treasured and secretly guarded by the Supreme Lord, never to be disseminated in the lower worlds. Now, these essential excerpts are transcribed for the enlightenment of future sages, to illuminate the Three Marvels and be appended to the *Scripture of the Great Primordial Numinous Simplicity*. Those whose bones align with immortality may apply this text to absolve sins, resolve transgressions, untangle karmic knots, and dispel obstructions. The Seven Mysteries shall vanish, and after three years, the true numina will manifest, uniting with you to ascend the Nine Heavens together. To lightly divulge the mysterious statutes incurs the same punishment as the aforementioned transgressions. Guard them as treasures, keeping them secret and practicing them with reverence.\n\n**The Ninth Perfected Scroll of the Mysterious Capital states:** The transmission of scriptural titles found within the Three Grades of the Nine Perfected Statutes occurred when the Sage Emperor Lord first received the scriptures from the Supreme Dao Lord. The Supreme Lord bestowed the scriptures, derived from the Three Grades of Illuminated Statutes, to assist the Three Treasures and the marvelous texts of the Supreme Perfected scriptures. The statutes governing their application, along with the thirty-one scrolls, independent matters, and various scriptural rituals, are all contained within the *Illuminated Statutes of the Four Poles*. The Three Grades of the Nine Perfected are placed in the Nine Emperor’s Palace as the upper scrolls of the Three Simplicities. The Four Poles, governed by the Four Offices, oversee all transgressions and the prohibitions of punishments. The *Illuminated Statutes of the Supreme Perfected*, received by the Supreme Emperor Lord from the mysterious chapters of the Celestial King of Primordial Beginning, contain the rituals and statutes of the Supreme Perfected. Their methods are concealed above the Nine Heavens, and the prohibitions of the Supreme Emperor Lord are stored in the Palace of the Supreme Perfected, never to be practiced in the world. The *Illuminated Statutes of the Nine Perfected* restrain later students, while the *Illuminated Statutes of the Four Poles* govern the four directions. Their purport is profound and penetrating, yet without golden characters or jade inscriptions, they remain unknown. Those who obtain these scrolls need not study to attain perfection. The statutes exist to restrain sins; seeing the statutes and reforming ensures no transgression against Heaven and Earth. To be without transgression is to align with spontaneity, and aligning with spontaneity enables one to ascend and supplement the ranks of the True Immortals. To study without statutes is to distance oneself from immortality.\n\n**The Ninth Perfected Scroll of the Mysterious Capital states:** All who possess the utmost resolve and whose names are recorded in the Mysterious Palace may first receive the Illuminated Statutes to understand the celestial laws and prohibitions before receiving the scriptures. If their bones are aligned, they may first make a covenant and then be transmitted the teachings. The covenant’s ritual implements and offerings shall follow the quantities prescribed in the *Three Marvels’ Precious Scriptures*, with the same duration of years. Never lightly transmit to the unworthy, nor reveal the mysterious texts. Failure to adhere to the statutes will result in one’s person being consigned to the offices of ghosts, while the seven generations of ancestors and parents will tread upon the Mountain of Knives and Forest of Swords, never to be redeemed for ten thousand kalpas. Even external violations of the statutes incur the same punishment as the statutory text. These prohibitions apply to both parties—students, be vigilant.\n\n**The Ninth Perfected Scroll of the Mysterious Capital states:** All who receive the supreme methods yet fail to uphold the Illuminated Statutes, slighting the celestial prohibitions, shall incur sins that burden the Seven Mysteries and extend karmic retribution to their person. Once they repent and reform, their penance shall be rigorous. If, after resuming their practices, they transgress again, their retribution shall be heavier than before. Such individuals’ bones and life are misaligned, their form opposed to the truth, their po souls akin to ghosts—none may repent again or resume the study of the true scriptures. I now elucidate these statutes to awaken those who remain unawakened. For those who know yet still transgress, what purpose remains? Practitioners, be vigilant.\n\n**Eulogy of the Supreme Emperor Lord.**\n\nAmidst the obscurity of primal transformation’s dawn,\nthe faintest morning dews disperse.\nIn the Great Stillness above the Void and Mystery,\nthe Two Modes divide in boundless clarity.\n\nCongealed essence embraces the hollow womb,\ncoalescing into form, nurturing the vision of emptiness.\nHolding essence within the profound and numinous,\nin a flash, the dark dawn unfolds.\n\nAt last awakening to the sorrow of fleeting years,\none’s fate turns back toward the Celestial Han.\nWith whispers of *buxu* steps, circling in reverence,\none pays homage to the Jade Capital.\n\nBowing in obeisance to the Great Nothingness,\nriding the wind, scattering sacred incense.\nLooking up and down within the halls of emperors,\nadrift and soaring on the void.\n\nExquisite chants emit wondrous sounds,\nintoning the hymns of the Supreme Perfected.\nFlowing through the Four Great Realms,\nthe Ten Heavens stretch boundlessly.\n\nFrom the Tower of Lang, the dark night breaks,\ndivine candles spout radiant light.\nJade forests bloom resplendently,\ntheir brilliance illuminating the jasper halls.\n\nThe void gives rise to natural mist,\nlush and dense, upholding the Mysterious Net.\nThe host of perfected beings, robed in dawn’s glory, praise,\ntheir jeweled canopies raised with the wind.\n\nIn flying steps, they chant the hymns of emptiness,\ndivine songs nurturing the Dao’s growth.\nProfound and vast, the Great Transformation flourishes,\nabundant and thriving, the Dao’s rise.\n\nThrough daily accumulation of study, responding to inspiration,\nmerit fulfilled, one enters the Great Vehicle.\nBlessings and fortune extend to all,\nthe Seven Ancestors all ascend.\n\nHarnessing the chariot to scale the Great Flower,\nturning the reins toward the celestial palaces.\nDivine winds stir the hollow vastness,\nfragrant blossoms ride the mist and scatter.\n\nWith whispers, they pay homage in the numinous hall,\nin orderly ranks, they tread the Mysterious Han.\nBright chants open the depths of the heart,\ndelivering from the hardships of past roots.\n\nThe Five Sufferings dissolve in due time,\ntheir fragrance infused in the alchemical vessel.\nThe luminous towers stand amidst cloud-nets,\nflying auroras flank the divine carriage.\n\nLifting the traceless perfected,\ngently they enter the Great Void.\nRiding the void, they recite the jade scriptures,\nin desolate elegance, they chant the feathered texts.\n\nVast thoughts extend universally,\nall things overflow with blessings.\nThe Celestial Emperor Lord’s Eulogy:\n\nThe Supreme Dao arises from emptiness and stillness,\nmysterious echoes seek one another in the yin.\nThe Three Perfected originate from the Primordial One,\nyet in qi’s transformation, principles diverge.\n\nWithin the formless Dharma Wheel,\nit flows, ethereal and pure in contemplation.\nVerses congeal without awaiting thought,\nqi coalesces, uniting with the mysterious talisman.\n\nDivine chants emit hymns of emptiness,\nintoning while treading the void in reverent circling.\nThe mysterious transformation is originally traceless,\nyet traces give rise to the Dao’s lineage.\n\nRoaming the Nine Heavens’ bounds,\nresting the chariot at the Six Peaks’ palaces.\nLifting the exalted guests,\nreturning to my pristine numinous chamber.\n\nThe Dao flows freely within the vast and silent,\ndivine songs resound in the Great Void.\nForms respond in the Court of Utmost Stillness,\nthoughts and chants connect the subtle and imperceptible.\n\nCloud-light veils the morning glow,\nits lingering radiance shades the Jade Capital.\nThe Mysterious Dragon awaits no chariot,\nwith whispers, it soars on the void.\n\nHands pluck the Seven Treasures’ blossoms,\ndivine winds scatter wondrous fragrance.\nExquisite chants arise from the heart’s depths,\nbrilliant and resplendent, unfolding jade verses.\n\nThe myriad qi merge into the Primordial One,\nall returning to the Three Mysteries’ beam.\nRiding the heavens, how could it be called high?\nGazing afar, the Nine Mysteries stretch boundlessly.\n\nFlapping wings, longing for the mysterious reins,\nyearning to ascend the evening clouds’ empyrean.\nAccumulated thoughts invoke divine resonance,\nhoping to commune with the Jade Perfected.\n\nDimly, the Celestial Han clears,\nadrift, the auroras return.\nThe Three Perfected soar into the void,\ngrasping the reins, swiftly entering the Purple Tenuity.\n\nBright chants deliver the later bodies,\nall are enabled to ride the light and fly.\nDelivering from the Three Paths’ hardships,\nthe Nine Mysteries escape sorrow and lament.\n\nThe Supreme Tenuity Emperor Lord’s Eulogy:\n\nThe Supreme Perfected arises from the hollow vastness,\nthe jasper net illumines the jeweled terrace.\nCircling in reverence to the Jade Capital,\nthe host of immortals chant subtle verses.\n\nTurning within the traceless,\nvoid songs harmonize with the hidden tryst.\nDelivering the body to ascend heaven,\nintoning to accumulate the foundations of fortune.\n\nUrging the reins toward the Great Aurora’s palace,\noccasionally feasting amidst the auroras.\nAdrift without bounds,\nseparating to enter the Mysterious Gate.\n\nThe mind at ease, the Dao also flows freely,\nthe cinnabar heart and will also part.\nThrough daily accumulation of study, renewing,\nchanting my pristine numinous texts.\n\nThe Eight Auroras propel the celestial carriage,\nflying auroras embellish the mysterious banner.\nThe plain canopy rides the wind in return,\ndesolate, entering the Purple Clarity.\n\nExquisite praises of the myriad perfected hymns,\njade echoes—how resonant!\nUnbinding the Nine Yin’s registers,\ndelivering the body back to the Southern Court.\n\nBlessings flow universally to all,\nwondrous transformations leave none unprosperous.\nThe pure and tranquil Mysterious Dao’s lineage,\nluminous and radiant, illumines the Great Void.\n\nWondrous transformations arise from silent stillness,\ninwardly contemplating the Three Primes’ palace.\nAccumulated thoughts pierce the mysterious void,\nsubtly, the Supreme Dao is attained.\n\nKnocking and chanting, resonating with the mysterious stillness,\ndivine songs leave none unexalted.\nCinnabar radiance reflects the cloud-court,\npurple mist illumines the jade forest.\n\nResplendent, the Seven Treasures’ blossoms,\nbrilliant, they sway with the numinous sounds.\nGong and shang naturally harmonize,\nexquisite subtleties guide the heart’s depths.\n\nMysterious chants sow the fields of fortune,\nbroadly delivering the boundless heart.\nThe Golden Portal Emperor Lord of Later Saints’ Eulogy:\n\nVast and boundless, the Primordial Beginning of Heaven,\nthe Three Images merge into the Mysterious One.\nWith whispers, the Orthodox Dao flourishes,\nvast and expansive, the Great Vehicle soars.\n\nThe Six Qi return to the Orthodox Court,\nall converging in the Mud-Pill Chamber.\nEntering and exiting, roaming the Emperor’s halls,\nessence and splendor illumine the clouds and sun.\n\nCirculating, returning to the Celestial Han,\ngently riding the Mysterious Seven.\nRound blossoms reflect the luminous pearl,\nthe Two Auroras face the true light.\n\nDivine radiance initiates the northern assembly,\nmysterious images intersect at Fusang.\nDarkly, they seek one another,\nyin flows freely through the Mysterious Eight Wastes.\n\nIf one can consume this essence,\none shall long uphold the Mysterious Net.\nPlayfully roaming the Nine Mysteries’ terrace,\nresting at ease in the Western Feather’s Alley.\n\nDivine beasts sing in the jasper hall,\nflying phoenixes intermingle in disarray.\nThe void gives rise to natural chants,\nperfected beings sing in rhythmic harmony.\n\nTransforming bodies in the kalpa’s court,\nincense and destiny command pure songs.\nEstablishing merit and sowing fields of fortune,\ndelivering later bodies from the net.\n\nThe Seven Mysteries scatter from the dark palace,\ndeparting, leaving no hardship behind.\nFlying to tread the empyrean ridges,\nsoaring wings toward the Eastern Flower’s Palace.\n\nWinds and clouds chant within the void,\njade sounds scatter in the jasper hall.\nPerfected beings chant hymns of emptiness,\nexquisite echoes transcend the cloud-chambers.\n\nUnbinding my natural heart,\nfulfilling my kalpas’ accumulated merit.\nLong whistling above the Nine Mysteries,\nclearly gazing upon the void’s sameness.\n\nDragons sing beyond the abodes,\nphoenixes whistle in the Great Aurora’s palace.\nVoid chants leave no lingering taste,\nmournful sounds ride the wind and scatter.\n\nWho can fathom these verses?\nDiligently reciting the pristine numinous praises,\nto resolve the Nine Yin’s transgressions,\ndelivering from the Seven Mysteries’ hardships.\n\nThe Supreme Ultimate Perfected states: *The Supreme Lord’s Pristine Numinous Cavern-Mystery Wondrous Scripture*, since the Primordial Beginning shares life with all, and the numinous texts already exist, the host of perfected beings approach the throne, burn incense, pay homage to the scriptures, and circumambulate while reciting these twenty-one chapters, to celebrate within the divine court.\n\nThe Jade Tone resounds with clarity,\npiercing through the Nine Heavens.\nIts lines are subtle and profound,\ntheir wondrous essence branching wide.\nReciting once, the myriad spirits awaken;\npersistently studying, one merges with the Emperor in truth.\nIt dissolves the heavy burdens of past confrontations,\ndelivers from the dark palaces of the Seven Mysteries,\nreleases the Five Sufferings from grieving souls,\nand elevates the body to ascend to the heavens of life.\n\nHow wondrous and subtle—\nthis numinous scripture!\n*Here ends the Supreme Lord’s Nine Perfected Bright Statutes.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上九真明科 经名：太上九真明科。 撰人不详，约出於东晋南朝。 系摘录《大有妙经》而成。 底本出处：《正统道藏》正一部。 太上九真明科 太上告诸天帝王、后圣君、上相青童、太极真人曰：凡是后学，得见上真三洞宝章，秘经首日者，皆东华书名，金字上清，虽未超腾，控辔紫庭，皆是升度之人也。 然虽见此文，而不知《九真明科》条检仪式，三洞奇文，太上宝书，不可得而便披也。 明科宝秘，藏於玄都之宫，玉京金房之内，不传於世。 乃明三洞之渊赜，标众真之仪格，拔宿对於幽官，度七玄於仙籍，实总落於万道，解九阴之重责，其妙可得立用，其科可得肃厉。 今故标出三品篇目，以辅扬三奇素灵妙经，可诫於后学，使勤尚之人，告慎於冥契。 诸天帝王、后圣九玄帝君、上相青童、太极真人，稽首敢问太上天尊：至真上法，高秀玄澄，落落万宗，玄寂虚凝，妙超激玄，法化三乘，弥纶亿劫，量何可胜，岂复稽於明科乎？ 太上曰：善子之言。 夫后生之徒，自非玉虚之胤，结自然而生者，皆於混元淬流於嚣秽也。 结有不纯之行，性有不专之美，虽希慕玄赜，故心恒背伐举止所乘，莫不犯於过，过生乎外，灭命乎内，承此而学，岂不去真远哉。 如使三官报咎，对在幽司，祸延七祖，罪累於身，有犯斯过者，而使悟於玄科有纠罚之制，圣化之大，复许有赎罪之法，案科而用，如此期真将必近矣。 为学之士而无此检，亦徒劳於精思，无益於苦念也。 今故标出九真三品明科，自可授於后学应为真人者。 帝君、上相青童、太极真人，於是退斋上清，奉受素灵大有妙经九真科检，秘於金藏玉匮，卫以玉童玉女，各三千人，侍典灵文，散香虚庭，飞龙毒兽，巨虬千寻，奋爪云墙，备玉关也。 如是十天大圣，九宫真仙，一月三过，莫不上登玄宫，禀承明科，礼拜於经文也。 上相青童君曰：凡有金骨玉髓，名参青宫，得有此文，秘而施行。 於是承受之仪，玄合上典，施用节度，与真同功，赎罪拔难，宿结咸解，七玄之祖，於是而欣，己身升腾，上宴玉京也。 玄都九真明科上品传经篇 玄都上品第一篇曰：《大洞真经》、《雌一宝经》、《太上素灵大有妙经》，三奇之章，高上玉皇宝篇，秘在九天之上大有之宫，太玄灵台玉房之中。 上皇之初旧科，经万劫一传，三道正明，学真格典，高上正科，七千年内听得三传。 侍卫玉童、玉女各七千人，执香典灵。 案科传授之法，皆对告斋百日，分金钮为盟，合玉童玉女，依四极科。 不依科而传，罪延七祖，幽魂充役，吞火食炭，负山运石，以填无极之源，己身抱风刀之罚，身没形残，长闭地狱，万不得仙。 玄都上品第二篇曰：传《大洞真经三十九章》於后学者，誓以上金十两，铜二十五斤，金钮五双，金鱼、玉龙各一枚，青丝一两，缠钮为盟。 《雌一》，以上金五两，五色文缯各五十尺，香一斤，金钮三双。 《太上素灵洞真玄经》，上金三两，紫纹百尺，青缯二十七尺，赤丝五两，香一斤，丹一两。 上皇以信誓心，不得有阙，阙则亏科。 师犯则迁侍经玉童玉女，还於本宫，不过三年，身被风刀之考，自然失经。 受者不依明科，目皆失明，形残，七祖、父母充北酆之责，万劫还生非人之道，学者慎之。",
      "translated_text": "**The Supreme Nine Perfected Illuminating Regulations**\n\n**Scripture Title:** *The Supreme Nine Perfected Illuminating Regulations*. Author unknown, approximately composed during the Eastern Jin or Southern Dynasties. Compiled from excerpts of *The Scripture of Great Mystery and Wondrousness*. Source text: *Daoist Canon of the Zhengtong Era*, Orthodox Section, Part One.\n\nThe Supreme Nine Perfected Illuminating Regulations\n\nThe Most High addressed the Heavenly Thearchs, Later Sage Lords, High Ministers and Azure Lads, and Perfected Ones of the Great Ultimate, saying: All later disciples who obtain and behold the Three Caverns’ precious chapters, the secret scriptures of the primordial day, have their names inscribed in golden characters in the Eastern Florescence, ascending to the Supreme Clarity. Though they have not yet transcended the mundane, they hold the reins of the Purple Court—all are persons destined for ascension and deliverance.\n\nYet though they have seen these texts, without knowing the *Nine Perfected Illuminating Regulations*, the protocols and standards, the wondrous writings of the Three Caverns, and the Most High’s precious scriptures, they cannot readily unroll them. The illuminating regulations and precious secrets are concealed within the Palace of the Dark Capital, in the Golden Chambers of the Jade Metropolis, and are not transmitted to the world.\n\nThey clarify the profound mysteries of the Three Caverns, establish the ritual forms of the host of Perfected Ones, deliver those bound by karmic debts in the hidden bureaus, and elevate the Seven Mysteries to the registers of immortality. They truly encompass the myriad Dao, dissolve the heavy burdens of the Nine Yin, and their wonders may be immediately applied; their regulations may be solemnly observed.\n\nNow, therefore, I set forth the three ranks of their chapters to assist in the propagation of the Three Wondrous and Primordial Numinous Scriptures, that they may serve as admonitions to later disciples. Let those who diligently aspire to the Dao take heed and be cautious in their secret covenants.\n\nThe Heavenly Thearchs, the Nine Mysterious Imperial Lords of Later Sages, the High Ministers and Azure Lads, and the Perfected Ones of the Great Ultimate bowed their heads and respectfully inquired of the Most High Heavenly Worthy: The supreme and true methods are lofty, transcendent, and limpid; the myriad schools are vast and boundless, profoundly quiescent and empty. Their wonders surpass the abstruse, their teachings transform the Three Vehicles, and they encompass kalpas beyond measure—how could they be surpassed by illuminating regulations?\n\nThe Most High replied: Your words are excellent. As for later generations, unless they are descendants of the Jade Void, born of spontaneous natural harmony, they all emerge from the turbid currents of the Primordial Chaos, mired in clamor and defilement. Their conduct is not purely formed, their natures not wholly refined. Though they may yearn for the profound mysteries, their minds constantly stray, and their actions deviate. None fail to commit transgressions. Transgressions arise externally, extinguishing life internally. Those who study under such conditions—how can they not drift far from the truth?\n\nIf the Three Offices report their faults, and they face judgment in the hidden bureaus, with calamities extending to their seven ancestors and sins accumulating upon themselves—those who commit such transgressions, if they awaken to the existence of the illuminating regulations with their systems of correction and punishment, and to the greatness of the sagely transformation, which permits redemption through prescribed methods, and apply them according to the regulations, will surely draw near to the Perfected in due time.\n\nFor scholars who lack these standards, their diligent contemplation and arduous devotion are in vain. Now, therefore, I set forth the *Nine Perfected Three Ranks of Illuminating Regulations*, which may be transmitted to later disciples who are to become Perfected Ones.\n\nThe Imperial Lords, High Ministers and Azure Lads, and Perfected Ones of the Great Ultimate then withdrew to purify themselves in the Supreme Clarity, receiving the *Primordial Numinous Scripture of Great Mystery and Wondrousness* and the *Nine Perfected Regulations*. They concealed them in golden repositories and jade coffers, guarded by jade lads and jade maidens, three thousand each, who attended to the numinous texts. They scattered incense in the empty courtyard, and flying dragons and poisonous beasts, giant serpents a thousand fathoms long, brandished their claws upon the cloud-walls, fortifying the Jade Pass.\n\nThus, the Ten Heavenly Great Sages and the Perfected Immortals of the Nine Palaces, three times each month, all ascend to the Dark Palace to receive the illuminating regulations, paying homage to the scriptural texts.\n\nThe High Minister and Azure Lad said: All who possess bones of gold and marrow of jade, whose names are recorded in the Azure Palace, and who obtain these texts, must keep them secret and put them into practice. In thus receiving and observing the rites, harmonizing with the supreme canon, applying the regulations and measures, and aligning with the Perfected in merit, they may redeem sins and dispel calamities, dissolving karmic entanglements. The ancestors of the Seven Mysteries rejoice, and their own persons ascend to feast in the Jade Metropolis.\n\n**The Upper Rank Transmission of Scriptures from the Nine Perfected Illuminating Regulations of the Dark Capital**\n\n**First Chapter of the Upper Rank of the Dark Capital:**\nThe *True Scripture of the Great Cavern*, the *Precious Scripture of the Feminine One*, and the *Primordial Numinous Scripture of Great Mystery and Wondrousness*—the three wondrous chapters, the precious writings of the Most High Jade Emperor—are concealed in the Palace of Great Mystery above the Nine Heavens, within the Jade Chambers of the Numinous Terrace of the Great Mystery.\n\nThe ancient regulations of the Primordial Thearch decree that these scriptures be transmitted once every ten thousand kalpas. The three true and illuminating Daoist canons, the standards for studying the Perfected, and the supreme orthodox regulations permit three transmissions within seven thousand years. Jade lads and jade maidens, seven thousand each, hold incense and attend to the numinous texts.\n\nAccording to the regulations for transmission, one must face the scriptures after a hundred days of purification, swear an oath with golden clasps, and unite the jade lads and jade maidens in accordance with the Four Poles’ regulations. Those who transmit without adhering to the regulations will incur sins extending to their seven ancestors, their hidden souls condemned to servitude, swallowing fire and eating coals, bearing mountains and transporting stones to fill the boundless abyss. Their own persons will suffer the punishment of the wind-blade, their bodies perishing and forms disintegrating, eternally confined to hell, never to attain immortality.\n\n**Second Chapter of the Upper Rank of the Dark Capital:**\nTo transmit the *Thirty-Nine Chapters of the True Scripture of the Great Cavern* to later disciples, one must swear an oath with ten taels of superior gold, twenty-five catties of copper, five pairs of golden clasps, one golden fish, one jade dragon, and one tael of green silk to bind the clasps.\n\nFor the *Feminine One*, five taels of superior gold, fifty bolts each of five-colored patterned silk, one catty of incense, and three pairs of golden clasps.\n\nFor the *Primordial Numinous Scripture of the Cavern and True Mystery*, three taels of superior gold, one hundred feet of purple silk, twenty-seven feet of green silk, five taels of red silk, one catty of incense, and one tael of cinnabar.\n\nThe Primordial Thearch requires sincere oaths; no deficiencies are permitted, for deficiencies violate the regulations. If the master transgresses, the jade lads and jade maidens attending the scriptures will be returned to their original palaces. Within three years, the master will suffer the trial of the wind-blade and naturally lose the scriptures. Those who receive them without adhering to the illuminating regulations will lose their sight, their forms will disintegrate, and their seven ancestors and parents will be consigned to the punishments of the Northern Feng. After ten thousand kalpas, they will be reborn in non-human destinies. Disciples, be cautious!",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1247,
      "start_sentence": 0,
      "end_sentence": 33,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.29021072387695,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上九真明科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "玄都上品第三篇曰：凡有金名东华，玉字上清，得受《太霄琅书琼文帝章》、《紫度炎光玄真变经》、《上清变化七十四方》、《九真中经》、《丹景道精隐地八术》、《解形遁变流景玉经》、《七变舞天》，皆九天真王、元始天王、太上天帝君、中央黄老君，受於太空之中，九玄之内，虚无之高章也。 皆秘在太上灵都之宫，紫房之内，三元君主，侍卫玉童玉女皆三千人。 元始之初，经七千劫一传，自三道立正之后，七千年内听三传，七百年中有其人亦听传。 皆对斋九十日，或三十日，或九日，告盟而授之，给玉童玉女，依四极科。 若不依科而传，罪延七祖、父母，充责鬼官，运蒙山之石，填积夜之河，万劫还生不人之道，己身被风刀之考，自然失经，终不得仙，传者慎之。 玄都上品第四篇曰：传《琼文帝章》，金鱼、玉龙，青缯四十二尺，金钮三双之誓。 《紫度炎光》，五色锦各五十尺，上金五两，沉香五斤，真朱一斤，书刀一口，金珠七枚，绛文七十尺之誓。 《上清变化七十四方》，青缯四十尺，上金十两，金钮六双，好香一斤，金鱼、玉龙之誓。 《九真中经》，具科截发为盟，今以白绢九十尺准盟，法於九真之数。 青丝一斤，绛缯二十四尺，此日晖之誓； 碧缯二十四尺，月华之誓； 金镮三双，无常童子图变之信。 《丹景道精隐地八术》、《解形遁变流景玉经》，悉上金十两，金鱼、玉龙各一枚，青缯四十尺，紫纹四十尺，金镮各三双。 《七变舞天》，上金五两，朱一斤，青缯三十二尺之誓。 信以质心，不得有阙，阙则违科。 师以天信投於山栖，以拯穷乏，余以供营经书之具，不得他散。 师犯上科，夺玉童玉女，减算夺纪，注名度还北酆。 受者不依科，皆丧魂失神，风刀之考，不出三年，自然失经，终不得仙。 玄都上品第五篇曰：《消魔智慧》、《玉清隐书》、《宝洞飞霄绝玄金章》、《紫凤赤书八景晨图》、《金真玉光》、《灵书紫文》、《金珰玉佩》、《金根上经》、《三天正法》，皆太上大道君、元始天王、金阙帝君之宝章，秘在玉清之宫，金房紫户之内，典卫灵文玉童、玉女各三千人。 元始之初，皆千劫一传，自三天立正之后，七百年内听得三传，百年中有其人听一传，给玉童玉女，依四极明科。 授者对斋九十日，或三十日，或九日而传。 不依科而传，罪延七玄之祖，长充鬼役，无有解脱，己身被风刀之考，死充下鬼，万不得仙。 玄都上品第六篇曰：传《消魔智慧》、《宝洞飞霄绝玄金章》、《紫凤赤书八景晨图》，皆上金十两，玉札一枚，金鱼、玉龙各一枚，紫缯四十尺。 《金根众经》、《灵书紫文》，上金五两，金简玉札各一枚，枚长一尺六寸，广二寸四分，金鱼、玉龙各一枚，紫缯百尺，青纹四十尺。 《三天正法》，青缯三十尺，青布四十三尺，金环五双，以为密誓。 上金十两，通神之信。 《金真玉光》、《玉佩金珰》、《玉清隐书》，皆金鱼、玉龙各一枚，以为誓信。 依科不得有阙，阙之则师夺玉童、玉女，注名还度北酆。 受者皆丧魂失神，考以风刀，不出三年，自然失经，万不得仙。 玄都上品第七篇曰：《七星移度》、《白羽黑翩飞行羽经》、《飞步天纲蹑行七元》、《太上隐书》、《灵飞六甲》，皆太上太帝君、太微天帝君登空之道，隐化之秘章，秘在太上琼宫之上，紫房之内，侍卫玉童、玉女皆三千人。",
      "translated_text": "The Third Scroll of the Supreme Category of the Mysterious Capital states: All those bearing the golden name Donghua and the jade title Shangqing, having received *The Jade Scripture of the Supreme Empyrean*, *The Purple Ascension of the Flaming Radiance and the Mysterious True Transformation Sutra*, *The Seventy-Four Methods of Shangqing Transformation*, *The Central Scripture of the Nine Perfected*, *The Eight Arts of the Hidden Earth of Cinnabar Scenery and Daoist Essence*, *The Jade Scripture of Dissolving Form and Transmuting through Flowing Light*, and *The Seven Transformations Dancing in Heaven*, have obtained the lofty scriptures of the Nine Heavens’ Perfected Kings, the Primordial Heavenly King, the Supreme Heavenly Thearch, and the Central Yellow Elder Lord, received within the Great Void and the Nine Mysteries—scriptures of the highest order from the realm of Non-Being.\n\nAll are secretly kept within the Palace of the Supreme Numinous Capital, in the Purple Chamber, presided over by the Lords of the Three Origins, attended by three thousand jade lads and jade maidens. From the inception of the Primordial Beginning, these scriptures were transmitted once every seven thousand kalpas. After the establishment of the Three Ways and the Rectification of the Dao, transmission is permitted thrice within seven thousand years, and if a worthy recipient appears within seven hundred years, transmission is also permitted. All transmissions require a fast of ninety days, or thirty days, or nine days, followed by an oath of covenant, after which jade lads and jade maidens are assigned in accordance with the regulations of the Four Poles. Should transmission occur without adherence to the regulations, the transgressor’s seven ancestors and parents will be consigned to the punishments of the ghostly officials, compelled to haul stones from Mount Meng to fill the River of Night. After ten thousand kalpas, they will be reborn in non-human destinies, while the transgressor’s own body will suffer the trial of the wind-blade, naturally lose the scriptures, and forever forfeit the attainment of immortality. Those who transmit must be cautious.\n\nThe Fourth Scroll of the Supreme Category of the Mysterious Capital states: For the transmission of *The Jade Scripture of the Supreme Empyrean*, the oath requires golden fish, jade dragons, forty-two feet of green silk, and three pairs of golden seals. For *The Purple Ascension of the Flaming Radiance*, the oath requires fifty feet each of five-colored brocade, five taels of refined gold, five catties of aloeswood, one catty of true cinnabar, one scripture knife, seven golden pearls, and seventy feet of crimson silk. For *The Seventy-Four Methods of Shangqing Transformation*, the oath requires forty feet of green silk, ten taels of refined gold, six pairs of golden seals, one catty of fine incense, and golden fish and jade dragons. For *The Central Scripture of the Nine Perfected*, the regulations require cutting hair as a covenant; now, ninety feet of white silk are used as a substitute, corresponding to the number of the Nine Perfected. One catty of green silk thread, twenty-four feet of crimson silk—this is the oath of the Sun’s Radiance; twenty-four feet of azure silk—the oath of the Moon’s Splendor; and three pairs of golden rings—the pledge of the Ever-Changing Lad’s transformation.\n\nFor *The Eight Arts of the Hidden Earth of Cinnabar Scenery and Daoist Essence* and *The Jade Scripture of Dissolving Form and Transmuting through Flowing Light*, the requirements are ten taels of refined gold each, one golden fish and one jade dragon, forty feet of green silk, and forty feet of purple silk, with three pairs of golden rings each. For *The Seven Transformations Dancing in Heaven*, the oath requires five taels of refined gold, one catty of cinnabar, and thirty-two feet of green silk. The pledge must be made with sincerity; no deficiencies are permitted, for deficiencies violate the regulations. The master shall cast the heavenly pledge into the mountains to succor the destitute, while the remainder is to be used for the preparation of scriptural implements and not dispersed elsewhere. Should the master transgress the supreme regulations, their jade lads and jade maidens will be revoked, their lifespan and destiny records diminished, and their names registered for return to the Northern Feng. Those who receive the scriptures without adhering to the regulations will lose their souls and spirits, suffer the trial of the wind-blade, and within three years naturally lose the scriptures, forever forfeiting the attainment of immortality.\n\nThe Fifth Scroll of the Supreme Category of the Mysterious Capital states: *The Wisdom of Dispelling Demons*, *The Hidden Book of Jade Clarity*, *The Golden Chapters of the Supreme Empyrean’s Soaring Mystery*, *The Crimson Book of the Purple Phoenix and the Eight Sceneries of the Morning Sun*, *The Golden Perfection and Jade Radiance*, *The Numinous Book of Purple Script*, *The Golden Pendants and Jade Girdles*, *The Supreme Scripture of the Golden Root*, and *The Orthodox Dharma of the Three Heavens* are all precious scriptures of the Supreme Lord of the Great Dao, the Primordial Heavenly King, and the Golden Portal Thearch, secretly kept within the Palace of Jade Clarity, behind the golden chambers and purple gates, guarded by three thousand jade lads and jade maidens each, attendants of the numinous scriptures.\n\nFrom the inception of the Primordial Beginning, these were transmitted once every thousand kalpas. After the establishment of the Three Heavens and the Rectification of the Dao, transmission is permitted thrice within seven hundred years, and if a worthy recipient appears within a hundred years, one transmission is permitted. Jade lads and jade maidens are assigned in accordance with the illuminating regulations of the Four Poles. Transmission requires a fast of ninety days, or thirty days, or nine days. Should transmission occur without adherence to the regulations, the transgressor’s seven generations of ancestors will be condemned to eternal ghostly servitude without release, while the transgressor’s own body will suffer the trial of the wind-blade, die as a lowly ghost, and forever forfeit the attainment of immortality.\n\nThe Sixth Scroll of the Supreme Category of the Mysterious Capital states: For the transmission of *The Wisdom of Dispelling Demons*, *The Golden Chapters of the Supreme Empyrean’s Soaring Mystery*, and *The Crimson Book of the Purple Phoenix and the Eight Sceneries of the Morning Sun*, the requirements are ten taels of refined gold, one jade tablet, one golden fish and one jade dragon, and forty feet of purple silk. For *The Supreme Scriptures of the Golden Root* and *The Numinous Book of Purple Script*, the requirements are five taels of refined gold, one golden slip and one jade tablet each—each slip and tablet being one foot six inches in length and two inches four fen in width—one golden fish and one jade dragon, one hundred feet of purple silk, and forty feet of green silk. For *The Orthodox Dharma of the Three Heavens*, the requirements are thirty feet of green silk, forty-three feet of green cloth, and five pairs of golden rings as a secret oath, along with ten taels of refined gold as a pledge to the spirits.\n\nFor *The Golden Perfection and Jade Radiance*, *The Jade Girdles and Golden Pendants*, and *The Hidden Book of Jade Clarity*, the oath requires one golden fish and one jade dragon each. No deficiencies are permitted in adherence to the regulations, for deficiencies will result in the master’s jade lads and jade maidens being revoked and their name registered for return to the Northern Feng. Those who receive the scriptures without adhering to the regulations will lose their souls and spirits, suffer the trial of the wind-blade, and within three years naturally lose the scriptures, forever forfeiting the attainment of immortality.\n\nThe Seventh Scroll of the Supreme Category of the Mysterious Capital states: *The Seven Stars’ Transference of Destiny*, *The Flying Feather Scripture of White Plumes and Black Wings*, *The Seven Origins’ Treading of the Celestial Net*, *The Supreme Hidden Book*, and *The Six Jia of the Numinous Flight* are all the Dao of the Supreme Thearch and the Heavenly Thearch of the Grand Tenuity, the secret scriptures of transformation and concealment, secretly kept within the Supreme Jade Palace, in the Purple Chamber, attended by three thousand jade lads and jade maidens.",
      "overlap_context": "maidens attending the scriptures will be returned to their original palaces. Within three years, the master will suffer the trial of the wind-blade and naturally lose the scriptures. Those who receive them without adhering to the illuminating regulations will lose their sight, their forms will disintegrate, and their seven ancestors and parents will be consigned to the punishments of the Northern Feng. After ten thousand kalpas, they will be reborn in non-human destinies. Disciples, be cautious!",
      "start_char": 1248,
      "end_char": 2534,
      "start_sentence": 34,
      "end_sentence": 63,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.99454188346863,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上九真明科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "依科七千年一传，三天立正之后，改七百年内听三传，若百年中有其人便传。 传授告斋九十日，或三十日，给玉童玉女，依四极明科。 不依科而传，罪延七玄之祖，长充北酆鬼投，十苦八难，己身被风刀之考，永没幽源，万不得仙。 玄都上品第八篇曰：传《七星移度》，青纹三十二尺，绛缯三十尺，凤纹之罗九十尺，金钮一双。 《白羽黑翮飞行羽经》，金二两，青缯三十二尺，以代截发嗡血之誓。 《飞步天纲》，锦三十尺，金鱼、玉龙之誓。 《灵飞六甲》，白素六十尺，金环六双，青丝六两。 天科以信质心，不得有阙，阙则违玄科。 师夺玉童玉女，除落青簿玉名，移还北酆。 受者不依科，亡精丧神，罚以风刀，不出三年，自然失经，终不得仙。 玄都上品第九篇曰：传方丈震灵、豁落七元八天隐文、流金火铃、金神虎符、消魔支干夜照神烛、八术隐遁紫清玉符、五籍洞玄六甲上符、五行秘文玄都玉格诸符，凡有六百部。 太上悉以其文，标於旧经之内，以为立用。 传授明科，悉依经科，传受有阙，罪同上品。 有经无符，则天魔害人，有符无经，则思念无感，神真不绛。 科云：皆不得单行，单行罪亦如之科。 经及符本同出於自然之气，虚无之章旨，故不得独修也。 无科修道，万不成也。 玄都九真明科中品诫罪篇 玄都中品第一篇曰：诸是后学，七祖以下有杀害人命，劫贼攻略，谋图奸淫，篡逆之祸，九族交通，谋反无道，其考尤重，怨对咎逮，积结九阴，非赦所原。 后生皆不得以余殃之身，参涉真经，窃受宝文。 若有苦至，志尚自励，首谢七玄，重施功德，拔出幽魂，披露己身於三光之下，散髻至头，三年不倦，自赍重信，投於九江，赎解前咎，然后听得清斋百日，奉受宝经，然后行事。 有此之罪而不先自罚责，吐首天冥，而受法者，师及弟子同被风刀之考，七玄之祖长闭幽源，负石担山，万劫不解，身亡失经，明慎之焉。 玄都中品第二篇曰：凡欲修学上法，己身先有重罪，手杀人命，及酷虐下贱，杀害众生，劫略百姓，谋图奸诡，九族相交，( )妬贤能，悖逆师主，不赦之罪，积结九阴，皆不得参受妙法，修行经文。 若能苦志，吐首先犯，效功施德，披露三光，散髻叩头，三年陈谢罚校，可以赎己愆，拔出七玄，使三界各别，然后听得清斋百日，奉受宝经行事。 有此之罪，而不先自首谢，责罚自厉，而受经文，师及弟子同受风刀之考，魂魄十苦八难，身役幽泉，自然失经，七祖父母长充幽徒，万劫不解，学者慎之。 玄都中品第三篇曰：凡是学者，受三奇宝文，上清秘经，轻泄目录，以示不同，宣露妙秘，轻慢宝章者，一犯至十，罚功断事三年，然后得更清斋修行。 过此以上，皆罪结九阴，考延七祖，充役三徒，运石负山，十苦八难，经万劫得出还，更生不人之道，己身罚以风刀之考，失明形残，死充下鬼，万不得仙，奉者慎之。 玄都中品第四篇曰：凡是学者，受上清宝经，三奇宝文，不得哭泣，临见死尸及血秽之淹。 一犯至十，罚功断事一年，然后得依科自罚，拔罪太阴，更清斋行事。 过此以上，二十四犯，夺算减命，玉童玉女还於本宫，不出三年，失经身丧，七玄之祖长充鬼役，万劫不解，学者慎之。",
      "translated_text": "Following the regulations, transmission occurs once every seven thousand years. After the Three Heavens establish rectitude, this is amended to permit transmission within seven hundred years, or even within a century if a worthy recipient appears. The transmission ritual requires a ninety-day or thirty-day purification fast, after which jade lads and jade maidens are assigned in accordance with the *Bright Statutes of the Four Poles*. Those who transmit without adhering to the regulations shall incur guilt extending to their seven ancestral lineages, condemned to perpetual servitude as *guitou* in the Northern Feng, enduring ten torments and eight calamities. Their own bodies shall suffer the trial of the wind-blade, forever consigned to the dark abyss, and they shall never attain immortality.\n\nThe Eighth Scroll of the Supreme Category of the Mysterious Capital states: For the transmission of *The Seven Stars’ Transference of Destiny*, prepare thirty-two feet of blue silk, thirty feet of crimson damask, ninety feet of phoenix-patterned gauze, and a pair of golden clasps. For *The Flying Feather Scripture of White Plumes and Black Wings*, offer two taels of gold, thirty-two feet of blue damask, to substitute for the oath of severed hair and blood. For *The Seven Origins’ Treading of the Celestial Net*, prepare thirty feet of brocade and the oath of the golden fish and jade dragon. For *The Six Jia of the Numinous Flight*, provide sixty feet of white silk, six pairs of golden rings, and six taels of blue thread. The celestial statutes demand absolute sincerity; any deficiency violates the Mysterious Statutes. The master shall reclaim the jade lads and jade maidens, erase the disciple’s name from the Azure Register, and return them to the Northern Feng. Those who receive the scriptures without adhering to the regulations will lose their essence and spirit, suffer the trial of the wind-blade, and within three years naturally lose the scriptures, forever forfeiting the attainment of immortality.\n\nThe Ninth Scroll of the Supreme Category of the Mysterious Capital states: The transmission includes the *Square-Zhang Divine Manifestation*, the *Hidden Writ of the Seven Origins and Eight Heavens of the Vast Expanse*, the *Flowing Gold Fire Bell*, the *Golden Spirit Tiger Talisman*, the *Demon-Dispelling Stem-and-Branch Night-Illuminating Divine Candle*, the *Eight Arts of Concealment and the Purple Clarity Jade Talisman*, the *Five Registers of the Cavernous Mystery and the Supreme Talisman of the Six Jia*, and the *Secret Writ of the Five Phases and the Jade Canon of the Mysterious Capital*—altogether six hundred sections. The Supreme Thearch has marked these texts within the original scriptures to serve as their foundation. The transmission must strictly adhere to the regulations; any deficiency incurs the same penalty as above. Scriptures without talismans invite harm from celestial demons, while talismans without scriptures render devotion ineffectual, and the divine perfected will not descend. The statutes decree that neither may be practiced in isolation; violation of this rule incurs the same penalty. Both scriptures and talismans originate from the *qi* of spontaneity and the principles of emptiness and non-being, and thus may not be cultivated separately. Without adhering to the statutes, the Dao can never be achieved.\n\n---\n\n**The Middle Category Admonitions on Transgressions in the Statutes of the Nine Perfected of the Mysterious Capital**\n\nThe First Scroll of the Middle Category of the Mysterious Capital states: Among later learners, those whose seven generations of ancestors have committed murder, banditry, plunder, treacherous schemes, illicit lust, usurpation, or rebellion, or whose nine clans have colluded in treason and impiety, shall bear the heaviest retribution. Their grievances and transgressions accumulate in the Nine Yin, beyond the reach of pardon. Their descendants, burdened by residual calamity, may not partake in the true scriptures or secretly receive the sacred texts. If, however, they endure hardship, aspire to self-improvement, confess their sins to the Seven Mysteries, perform meritorious deeds, liberate imprisoned souls, and expose themselves beneath the Three Luminaries with unbound hair, persisting for three years without wearying, then—having prepared substantial offerings—they may cast them into the Nine Rivers to atone for past transgressions. Only thereafter may they observe a hundred-day purification fast and receive the sacred scriptures to proceed with their practice. Those who bear such sins yet fail to first punish and reproach themselves, confessing to Heaven and the unseen, and who receive the teachings, shall—both master and disciple—suffer the trial of the wind-blade. Their seven ancestral lineages shall be eternally confined to the dark abyss, bearing stones and mountains for ten thousand kalpas without release. Their bodies shall perish, the scriptures shall be lost, and they must exercise utmost caution.\n\nThe Second Scroll of the Middle Category of the Mysterious Capital states: Those who wish to cultivate the supreme methods yet bear grave sins—having taken lives with their own hands, cruelly oppressed the lowly, slaughtered living beings, plundered the common folk, schemed deceitfully, colluded with their nine clans, envied the worthy and capable, or rebelled against their masters—shall incur unpardonable offenses, their transgressions accumulating in the Nine Yin. They may not partake in the wondrous methods or cultivate the scriptures. If, however, they endure hardship, confess their initial crimes, perform meritorious deeds, expose themselves beneath the Three Luminaries with unbound hair, and prostrate themselves for three years to atone for their transgressions, they may redeem their faults, liberate their seven ancestral lineages, and separate their destinies from the Three Realms. Only thereafter may they observe a hundred-day purification fast and receive the sacred scriptures to proceed with their practice. Those who bear such sins yet fail to first confess, reproach, and punish themselves, and who receive the scriptures, shall—both master and disciple—suffer the trial of the wind-blade, endure ten torments and eight calamities, and be consigned to the dark springs. The scriptures shall be lost, and their seven generations of ancestors shall serve as eternal prisoners in the dark abyss, never to be released for ten thousand kalpas. Learners must exercise caution.\n\nThe Third Scroll of the Middle Category of the Mysterious Capital states: Any learner who, having received the Three Wonders’ sacred texts or the *Supreme Clarity* secret scriptures, carelessly reveals their catalog, displays them to the unworthy, or profanes their mysteries, shall—upon the first to the tenth offense—be penalized with three years of severed merit and suspended practice, after which they may resume purification and cultivation. Beyond this, their guilt shall accumulate in the Nine Yin, their seven ancestral lineages shall suffer retribution, and they shall be condemned to servitude in the Three Prisons, bearing stones and mountains, enduring ten torments and eight calamities. Only after ten thousand kalpas may they emerge, but they shall be reborn beyond the path of humanity. Their own bodies shall suffer the trial of the wind-blade, lose their sight and limbs, die as lowly ghosts, and never attain immortality. Those who transmit the teachings must exercise caution.\n\nThe Fourth Scroll of the Middle Category of the Mysterious Capital states: Any learner who, having received the *Supreme Clarity* sacred scriptures or the Three Wonders’ sacred texts, weeps, encounters corpses, or is defiled by blood and filth, shall—upon the first to the tenth offense—be penalized with one year of severed merit and suspended practice, after which they may atone in accordance with the statutes, redeem their sins in the Great Yin, and resume purification and practice. Beyond this, upon the twenty-fourth offense, their lifespan shall be diminished, and their jade lads and jade maidens shall return to their original abodes. Within three years, they shall lose the scriptures and perish. Their seven ancestral lineages shall serve as eternal ghostly laborers, never to be released for ten thousand kalpas. Learners must exercise caution.",
      "overlap_context": "ates: *The Seven Stars’ Transference of Destiny*, *The Flying Feather Scripture of White Plumes and Black Wings*, *The Seven Origins’ Treading of the Celestial Net*, *The Supreme Hidden Book*, and *The Six Jia of the Numinous Flight* are all the Dao of the Supreme Thearch and the Heavenly Thearch of the Grand Tenuity, the secret scriptures of transformation and concealment, secretly kept within the Supreme Jade Palace, in the Purple Chamber, attended by three thousand jade lads and jade maidens.",
      "start_char": 2534,
      "end_char": 3767,
      "start_sentence": 64,
      "end_sentence": 93,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.87896013259888,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上九真明科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "玄都中品第五篇曰：凡学者受上清宝经，三洞秘文，不得带近妇人，行阴阳之事，皆混淬真气。 十犯至二十四过，罚功断事三百日，然后得清斋修#1行。 过此以上，玉童玉女各还本宫，减算促命，不出年失经身亡，七祖被考，学者慎之。 玄都中品第六篇曰：凡学者受上清宝文，三洞秘文，而心怀贼害，手行虐暴，杀生行凶，攻略奸诡，( )贤妬能，攻毁同气，伐败经师，一犯至五，听得罚信，谢责九阴，拔罪五岳，断功禁事十年，听得清斋，还修所受。 过五以上，至二十四犯，〔四〕司执杀，收摄魂神，充责北酆，七祖充役，经万劫得还，更生非人之道，玉童玉女各反上宫，不出一年，失经身亡，终不得仙，学者慎之。 玄都中品第七篇曰：凡学者受上清宝经，三洞秘文，不得北向便溺#2，及食五辛六畜之肉，饮酒邪淫，亏道慢法，疑贰不专。 十犯至二十四过，听得依科罚信，谢过太阴，断功一年，然后听清斋九十日，还修所受。 过此以上，减算促命，身被风刀之考，七玄充责三途，不过五年，失经身亡，学者慎之。 玄都中品第八篇曰：凡学者受上清宝经，三洞秘文，当依科资信，诣师告斋，然后受经，不得不告盟而妄披宝文。 凡诸学人得经，便师而受焉，此皆冥使授之，不得轻略窃写，及改易圣文，以意自决，毁名古音，自作一法，四司所纠，罪书九阴。 一犯至三，断功禁事三年，案科自罚，投信九河，更清斋三十日，然后得还修行。 过此以上，至二十四过，玉童玉女各还本宫，减算夺命，身役鬼官，七玄之祖长充鬼役，万劫得还，更生非人之道，学者慎之。 玄都中品第九篇曰：凡受上清宝经，三洞奇文，当别室安高床，高四尺四寸，广五尺，异诸凡下之经，明灯烧香，朝夕礼愿，常为供养，不得使异炁之人，冒淹履秽，及妇人参入内，触误神真，此世间所用之科。 受经之身，不得衣服屐履交关非类，卧息坐起，皆当与物有异。 犯者从一至二十四过，罚功断事一年，然后更清斋修行。 过此以上，为四司所执，言过玉清，还名酆都，七年身亡失经，七祖被考，奉者慎之。 玄都九真明科下品赎罪篇 玄都下品第一篇曰：凡有后学之人，七祖、父母，生世有犯玄都上品、中品第一篇之罪，其考尤重，结在九阴，七祖对冤，幽掠累劫，殃充后代，冥逮不释者，皆当露身太阴之下，披发叩头，首罪九阴，三年自责，年竟，赍金镮九双，〔青丝〕一两，金人一形，投於三河之口，以赎七祖之罪，拔出幽魂之难。 其科朱书五行桐板一枚，记曰：某年某月某子朔如干日，子某郡悬乡里，某七祖、父母，下逮己身，有犯玄都上品、中品第一篇之罪，罪结九阴，今谨依科罚金镮九双，金人一形，以赎幽魂酷对之罪，投书告命，归首水官，以自解拔，罪灭三官，魂升九天。 毕，以青丝缠物及板，以青石沈之，临沈之时，北向仰头咒曰： 太阴九君，执司灵官，甲今有言，归告河源，投信九源，拔出七玄，怨对灭解，我身登仙。 毕。 如此七祖之考，於是释散，得离幽宫，上升福堂，己身便得参修宝经，九年克有真灵降形，与神同升也。 玄科尤重，不得又犯。 玄都下品第二篇曰：凡欲修学上真之道，若己身先有犯上品、中品第二篇中之罪，其考沈结，结罪九阴，盘塞冥中，上延七祖，考对穷魂，缠绵不解者，皆当先於太阴之下，北向散发，叩头首罪三光，三年克责。",
      "translated_text": "**The Fifth Scroll of the Middle Grade of the Mysterious Capital states:** Any learner who receives the *Supreme Clarity* sacred scriptures or the Three Caverns’ secret texts must not approach women or engage in yin-yang intercourse, for these defile and corrupt the true qi. From ten to twenty-four offenses, they shall be penalized with three hundred days of severed merit and suspended practice, after which they may purify themselves and resume cultivation. Beyond this, their jade lads and jade maidens shall each return to their original abodes, their lifespan shall be diminished, and within a year they shall lose the scriptures and perish. Their seven ancestral lineages shall be punished—learners must exercise caution.\n\n**The Sixth Scroll of the Middle Grade of the Mysterious Capital states:** Any learner who receives the *Supreme Clarity* sacred texts or the Three Caverns’ secret texts yet harbors malicious intent, commits acts of cruelty, kills living beings, engages in violence, schemes with deceit, envies the worthy, resents the capable, attacks kin of the same qi, or undermines their scripture master—upon the first to fifth offense—shall be permitted to atone by pledging sincerity, making amends in the Nine Yin, redeeming their sins in the Five Marchmounts, and enduring ten years of severed merit and suspended practice. They may then purify themselves and resume their studies. Beyond five offenses, up to twenty-four, the Four Administrations shall seize and execute them, capturing their hun and shen to be punished in the Northern Feng. Their seven ancestral lineages shall serve as laborers, and after ten thousand kalpas, they may return to be reborn in non-human realms. Their jade lads and jade maidens shall each return to the Upper Palaces, and within a year, they shall lose the scriptures and perish, never attaining immortality—learners must exercise caution.\n\n**The Seventh Scroll of the Middle Grade of the Mysterious Capital states:** Any learner who receives the *Supreme Clarity* sacred scriptures or the Three Caverns’ secret texts must not urinate facing north, consume the meat of the five pungent vegetables or the six livestock, drink wine, engage in licentiousness, violate the Dao, disrespect the dharma, or waver in devotion. From ten to twenty-four offenses, they may atone in accordance with the statutes by pledging sincerity, making amends in the Great Yin, enduring one year of severed merit, and then purifying themselves for ninety days before resuming their studies. Beyond this, their lifespan shall be diminished, their body shall endure the trials of the wind-knife, and their seven ancestral lineages shall be punished in the Three Ways. Within five years, they shall lose the scriptures and perish—learners must exercise caution.\n\n**The Eighth Scroll of the Middle Grade of the Mysterious Capital states:** Any learner who receives the *Supreme Clarity* sacred scriptures or the Three Caverns’ secret texts must, in accordance with the statutes, present offerings and sincerity to their master, announce their purification, and only then receive the scriptures. They must not, without declaration or oath, recklessly peruse the sacred texts. All learners who obtain the scriptures must receive them from a master—these are bestowed by unseen agents. They must not lightly copy or alter the sacred texts, impose their own interpretations, corrupt the ancient names and sounds, or devise their own methods. The Four Administrations shall record their offenses, and their sins shall be inscribed in the Nine Yin. From the first to third offense, they shall endure three years of severed merit and suspended practice, atone in accordance with the statutes, present offerings to the Nine Rivers, and purify themselves for thirty days before resuming cultivation. Beyond this, up to twenty-four offenses, their jade lads and jade maidens shall each return to their original abodes, their lifespan shall be diminished, their body shall serve as a ghostly official, and their seven ancestral lineages shall serve as eternal ghostly laborers. After ten thousand kalpas, they may return to be reborn in non-human realms—learners must exercise caution.\n\n**The Ninth Scroll of the Middle Grade of the Mysterious Capital states:** Any who receive the *Supreme Clarity* sacred scriptures or the Three Caverns’ wondrous texts must place them in a separate chamber upon a high bed, four feet and four inches in height and five feet in width, distinct from ordinary or inferior scriptures. They shall light lamps, burn incense, and make morning and evening offerings with reverent vows, always maintaining their devotion. They must not allow those of impure qi, those defiled by filth, or women to enter and disturb the divine perfected. These are the statutes observed in the world.\n\nThe recipient of the scriptures must not wear clothing, shoes, or sandals that are improper or mingled with the common. In lying down, resting, sitting, or rising, they must always remain distinct from ordinary things. From the first to twenty-fourth offense, they shall be penalized with one year of severed merit and suspended practice, after which they may purify themselves and resume cultivation. Beyond this, they shall be seized by the Four Administrations, their transgressions reported to the Jade Clarity, and their names returned to Fengdu. Within seven years, they shall lose the scriptures and perish, and their seven ancestral lineages shall be punished—learners must exercise caution.\n\n---\n\n**The Lower Grade Redemption Scroll of the Mysterious Capital’s Nine Perfected Bright Statutes**\n\n**The First Scroll of the Lower Grade of the Mysterious Capital states:** If any later learner’s seven ancestors or parents committed the sins described in the first scroll of the Upper or Middle Grades of the Mysterious Capital during their lifetimes, their punishment shall be especially severe, their sins bound in the Nine Yin. Their seven ancestors shall face their accusers, enduring eternal torment in the dark prisons, their misfortunes extending to their descendants, who shall be pursued by unseen forces without release. They must stand bare beneath the Great Yin, dishevel their hair, and kowtow, confessing their sins to the Nine Yin. After three years of self-reproach, at the year’s end, they shall present nine pairs of gold rings, one liang of blue silk, and one gold figurine, casting them into the mouth of the Three Rivers to redeem the sins of their seven ancestors and deliver their souls from the trials of the dark prisons.\n\nThe statute requires a peachwood tablet inscribed in red with five lines, recording: *\"On such-and-such a day, month, and year, I, [name], of [prefecture], [county], and [village], confess that my seven ancestors, parents, and myself have committed the sins described in the first scroll of the Upper and Middle Grades of the Mysterious Capital, our sins bound in the Nine Yin. Now, in accordance with the statutes, I present nine pairs of gold rings and one gold figurine to redeem the cruel punishments of the dark prisons. I cast this petition to the Water Officials, seeking absolution. May my sins be erased by the Three Offices, and my soul ascend to the Nine Heavens.\"* Upon completion, they shall bind the objects and tablet with blue silk and sink them with a blue stone. At the moment of sinking, they shall face north, raise their head, and recite the incantation: *\"Nine Lords of the Great Yin, divine officials of the executive bureau, I now declare my words and report to the river’s source. I cast my pledge into the Nine Springs to deliver my seven ancestors. May our grievances be dissolved, and may I ascend as an immortal.\"* Upon completion, the punishments of their seven ancestors shall be released, allowing them to depart the dark prisons and ascend to the Hall of Blessings. The learner may then proceed to study the sacred scriptures, and after nine years, the true numinous shall descend in form, ascending with the gods. The statutes are especially severe—no further transgressions are permitted.\n\n**The Second Scroll of the Lower Grade of the Mysterious Capital states:** Any who wish to cultivate the Dao of the Supreme Perfected and whose own body has previously committed the sins described in the second scroll of the Upper or Middle Grades shall find their punishments deeply bound, their sins coiled in the Nine Yin, obstructing the unseen realms. This shall extend to their seven ancestors, who shall face the trials of the destitute souls, their suffering unending. They must first stand beneath the Great Yin, face north, dishevel their hair, and kowtow to the Three Luminaries, confessing their sins. After three years of self-reproach...",
      "overlap_context": "er which they may atone in accordance with the statutes, redeem their sins in the Great Yin, and resume purification and practice. Beyond this, upon the twenty-fourth offense, their lifespan shall be diminished, and their jade lads and jade maidens shall return to their original abodes. Within three years, they shall lose the scriptures and perish. Their seven ancestral lineages shall serve as eternal ghostly laborers, never to be released for ten thousand kalpas. Learners must exercise caution.",
      "start_char": 3768,
      "end_char": 5070,
      "start_sentence": 94,
      "end_sentence": 118,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.44864225387573,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上九真明科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "年竟，当资真朱一斤，书刀一口，上金一两，金人一形，投於三河之口，以赎己罪酷逆之过，解结三官，拔出七祖。 其科朱书青缯一尺，上记曰：某年某月某朔日子，某郡县乡里某甲，年如干岁，甲身先无所见，行失玄科，手犯元恶，上罹玄都上品、中品第二篇之罪，罪结太阴，以依科罚金人一形，真朱一斤，书刀一枚，以赎己身丑恶之罪，投书告命，归首有灵，以自解拔，罪灭九河，身得长生。 毕，以青丝缠物及文，以青石沈之，临沉之时，北向仰头咒曰： 上有太阴，执司九君，甲今有言，归告河源，赎罪解结，拔度九难，怨魂对魄，各反自然，祸灭学仙，我身得升。 毕。 如此九阴之结，便得解释，怨对之魂，反於自然也。 便得修受上清之经，九年不亏，真灵降形，与神合冥也。 玄科严重，不得又犯。 玄都下品第三篇曰：凡修上清宝经，洞玄秘文，己身有犯於上品、中品第三篇目之罪，其考结於太阳，为四司所执，言奏玉清。 犯此之过，当断功克己，入室烧香，叩头首谢，北向叩齿十通，仰头咒曰： 太玄幽邈，下世希闻，轻泄宝真，上亏帝尊，自收负责，伏款灵门，伏愿高上，曲垂玄恩，降以灵感，启以自然。 毕，便叩头九过。 如此三年首谢，更清斋三十日，得上解三官，解考九阴，便还修行，宝秘密念，克得飞仙。 玄科尤重，不得又犯。 玄都下品第四篇曰：凡修学上真之道，己身有犯上品、中品第四篇目之罪，罪结九阴，悬考玉清，犯者当於中庭，夜半然三十二灯，以洗秽气，清明内外，入室烧香，北向叩头，首谢所犯，叩齿三十六通，仰头祝曰： 世运交丧，乾尸翳彰，秽气纷纷，与真相迎，亏科犯诚，身入罪乡，赎以礼谢，洗以明灯，祸散三清，福充身昌，道荫曲流，其庆靡央。 毕，又叩头九过止。 如此一年，更清斋三十日，然后得还修事，检行慎科，懃心注真，九年克得白日登晨。 玄都下品第五篇曰：凡修上真之道，己身有犯上品、中品第五篇目之罪，罪结太阴，考悬青宫，犯者当作香汤自浴，资油於中庭，然二十四灯九十日，入室北向叩头九过，首谢所犯，叩齿二十四通，仰头祝曰： 天乾地坤，二象交通，阴炁混正，秽气弥充，丧神亏宝，损落法容，谨以明灯，上映玄宫，散祸九阴，福庆归宗。 毕。 如此九十日，日竟，退斋二十四日，然后得还修行真法，每在告慎，明依科文，克得玄真与形合仙，玄科尤重，不得又犯。 玄都下品第六篇曰：凡修上真之道，己身有犯上品、中品第六篇目之罪，其罪尤重，为四司所执，考结太阴，对在幽宫。 有犯当於太阴之下，披发叩头，首谢玉清，解拔太阴。 依科当以私宝散乞贫民，作百人食以伺饥乏十年，入室叩头自责，北向叩齿九通，仰头咒曰： 天遐地广，九原开张，身履福门，悬罪玉京，倏罗缠落，玄洞灵场，散宝拔罚，施以穷粮，罪消太阴，福生十乡，去故奉新，方降未央。 毕，又叩头九过止。 此乃高上拔罪上法，标於正科，十年如此，宿罪滞考并消太阴，施行自责年竟，更斋百日，然后得还修行。 拯身慎法，不得重犯。 玄都下品第七篇曰：凡学上真之道，有犯上品、中品第七篇目之罪，罪充上清，犯者当以上香十斤，送同学之人，合十处，拔罪一年，入室烧香，东向叩头九遍，首谢上真，叩齿九通，仰头咒曰：",
      "translated_text": "When the year concludes, one must provide a catty of cinnabar, a scribing knife, an ounce of gold, and a golden figurine, casting them into the confluence of the Three Rivers to redeem one’s own grievous transgressions, unbind the knots before the Three Offices, and extricate one’s seven ancestors. The ritual requires a foot of azure silk inscribed with cinnabar, bearing the following record: *\"On the first day of the [specific] month in the [specific] year, [Name], of [Prefecture], [County], [Village], aged [X] years, whose person has hitherto committed no visible transgressions but has erred against the Mysterious Statutes, his hands having perpetrated primordial evil, now incurs the sins of the second scroll of the Upper and Middle Grades of the Mysterious Capital. His sins coil in the Great Yin. In accordance with the statutes, he offers a golden figurine, a catty of cinnabar, and a scribing knife to redeem his own foul transgressions. He casts this petition to declare his fate, prostrating himself before the numinous, that he may be unbound and his sins dissolved in the Nine Rivers, his person attaining longevity.\"* Upon completion, bind the objects and text with azure silk, then sink them with a blue stone. At the moment of submersion, face north, raise your head, and recite the incantation:\n\n*\"Above lies the Great Yin, governed by the Nine Lords.\nI now declare my words, reporting to the source of the rivers.\nRedeem my sins, unbind the knots,\nDeliver me from ninefold calamities.\nWandering souls and paired spirits,\nEach returns to their natural state.\nMisfortune vanishes, and I learn immortality—\nMy person ascends.\"*\n\nWhen finished, the knots of the Nine Yin shall be untangled, and the souls of grievance shall return to their natural state. One may then proceed to study the scriptures of the Supreme Clarity. After nine years of unwavering practice, the true numinous shall descend in form, merging with the divine.\n\nThe statutes are especially severe—no further transgressions are permitted.\n\n**The Third Scroll of the Lower Grade of the Mysterious Capital states:** Any who cultivate the precious scriptures of the Supreme Clarity and the esoteric texts of the Cavernous Mystery, yet whose person has committed the sins described in the third scroll of the Upper or Middle Grades, shall find their punishments bound to the Great Yang, seized by the Four Offices, and reported to the Jade Clarity. For such transgressions, one must sever attachments, practice self-restraint, enter the chamber to burn incense, kowtow in confession, face north, and click the teeth ten times. Raising the head, recite the incantation:\n\n*\"O profound and distant Mysterious Primordial,\nRarely heard in the lower world,\nI lightly divulged the precious and true,\nOffending the august honor of the Emperor on High.\nI now assume responsibility,\nProstrating myself at the gates of the numinous.\nI humbly beseech the Most High\nTo bestow the grace of the Mysterious,\nDescending with numinous resonance,\nAwakening the natural.\"*\n\nWhen finished, kowtow nine times. After three years of such confessions, followed by thirty days of purificatory abstinence, one may be absolved by the Three Offices, the punishments of the Nine Yin dissolved. One may then resume cultivation, treasuring the secret recitations, and in time attain flight as an immortal.\n\nThe statutes are especially severe—no further transgressions are permitted.\n\n**The Fourth Scroll of the Lower Grade of the Mysterious Capital states:** Any who cultivate the Dao of the Supreme Perfected yet whose person has committed the sins described in the fourth scroll of the Upper or Middle Grades shall find their sins coiled in the Nine Yin, their punishments suspended before the Jade Clarity. The transgressor must, at midnight in the central courtyard, kindle thirty-two lamps to cleanse defiling qi, purifying both inner and outer. Entering the chamber to burn incense, face north, kowtow, and confess the transgressions. Click the teeth thirty-six times, then raise the head and recite the prayer:\n\n*\"The turning of the world’s fate brings ruin,\nThe desiccated corpse’s shadow grows manifest.\nDefiling qi swirls in profusion,\nConfronting the true.\nI violated the statutes and breached sincerity,\nMy person entering the realm of sin.\nI redeem myself through ritual and confession,\nWashing clean with luminous lamps.\nMisfortune scatters before the Three Clarities,\nFortune fills and my person prospers.\nThe Dao’s shade flows in curves,\nIts blessings boundless.\"*\n\nWhen finished, kowtow nine more times. After a year of such practice, followed by thirty days of purificatory abstinence, one may resume cultivation. Conduct must be meticulous, statutes observed with care, and the heart devoted to the true. After nine years, one shall ascend in broad daylight to the dawn.\n\n**The Fifth Scroll of the Lower Grade of the Mysterious Capital states:** Any who cultivate the Dao of the Supreme Perfected yet whose person has committed the sins described in the fifth scroll of the Upper or Middle Grades shall find their sins bound to the Great Yin, their punishments suspended before the Azure Palace. The transgressor must bathe in fragrant waters, then in the central courtyard provide oil to kindle twenty-four lamps for ninety days. Entering the chamber, face north, kowtow nine times, confess the transgressions, and click the teeth twenty-four times. Raising the head, recite the prayer:\n\n*\"Heaven’s firmament and Earth’s foundation,\nThe two images intermingle.\nYin qi obscures the upright,\nDefiling qi fills all.\nThe spirit is lost, the treasure diminished,\nThe dignity of the Dao impaired.\nWith reverence, I kindle luminous lamps,\nIlluminating the Mysterious Palace above.\nScatter misfortune in the Nine Yin,\nFortune and blessings return to the lineage.\"*\n\nAfter ninety days, conclude with twenty-four days of abstinence. One may then resume the practice of the true methods, ever mindful and cautious, strictly adhering to the statutes. In time, the Mysterious and True shall merge with one’s form, attaining immortality.\n\nThe statutes are especially severe—no further transgressions are permitted.\n\n**The Sixth Scroll of the Lower Grade of the Mysterious Capital states:** Any who cultivate the Dao of the Supreme Perfected yet whose person has committed the sins described in the sixth scroll of the Upper or Middle Grades shall find their transgressions especially grave, seized by the Four Offices, their punishments bound to the Great Yin, confronting them in the Dark Palace. The transgressor must stand beneath the Great Yin, dishevel the hair, kowtow, and confess before the Jade Clarity to extricate themselves from the Great Yin. In accordance with the statutes, one must distribute personal treasures to the poor, providing meals for a hundred people to relieve the hungry for ten years. Entering the chamber, kowtow in self-reproach, face north, click the teeth nine times, and raise the head to recite the incantation:\n\n*\"Heaven is vast, Earth is broad,\nThe Nine Origins unfold.\nMy person treads the gates of fortune,\nYet my sins hang before the Jade Capital.\nEntangled in snares, I fall into the numinous precincts of the Cavernous Mystery.\nI scatter treasures to lift the punishments,\nOffering sustenance to the destitute.\nSins dissolve in the Great Yin,\nFortune arises in ten directions.\nShedding the old, embracing the new,\nBlessings descend without end.\"*\n\nWhen finished, kowtow nine more times. This is the supreme method of the Most High for lifting sins, recorded in the orthodox statutes. After ten years of such practice, the accumulated sins and lingering punishments shall be dissolved in the Great Yin. Upon completing the year of self-reproach, observe a hundred days of abstinence, then resume cultivation. One must vigilantly uphold the laws, never transgressing again.\n\n**The Seventh Scroll of the Lower Grade of the Mysterious Capital states:** Any who study the Dao of the Supreme Perfected yet whose person has committed the sins described in the seventh scroll of the Upper or Middle Grades shall find their sins filling the Supreme Clarity. The transgressor must offer ten catties of fine incense to fellow practitioners in ten different places, each act absolving a year of sin. Entering the chamber to burn incense, face east, kowtow nine times, confess before the Supreme Perfected, click the teeth nine times, and raise the head to recite the incantation:",
      "overlap_context": "y has previously committed the sins described in the second scroll of the Upper or Middle Grades shall find their punishments deeply bound, their sins coiled in the Nine Yin, obstructing the unseen realms. This shall extend to their seven ancestors, who shall face the trials of the destitute souls, their suffering unending. They must first stand beneath the Great Yin, face north, dishevel their hair, and kowtow to the Three Luminaries, confessing their sins. After three years of self-reproach...",
      "start_char": 5070,
      "end_char": 6342,
      "start_sentence": 119,
      "end_sentence": 148,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.68068814277649,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上九真明科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "五气错综，上真不全，身染秽炁，触忤洞门，伤藏伐命，摇动三关，违科犯诫，罹考自延，谨以罚责，归告帝尊，乞白使我，於今自宣，去离下世，上登天仙。 毕。 如此一年竟，更斋二十四日，还修所受，克得真灵下降。 明科之大，不得重犯。 玄都下品第八篇曰：凡学上真之道，有犯上品、中品第八篇目之罪，为监司所执，考结三清，犯者当以清油一斛，於中庭然灯，多少适意，惟令油尽。 又以上香十斤，奉有经之师，以拔其过三年，入室烧香，北向叩头九过，首谢所犯，叩齿十二通，咒曰： 天真高远，玄光下明，缘恃宿庆，得观真经，未获玄科，亏略天灵，违真犯诚，沉身分冥，克自责厉，归告上清，自是之后，洗濯故形，奉承玄真，与道齐并。 毕。 三年周竟，当更斋九十日，先以师受便得修行，未经师受，当资信诣师度经，修行如科，克得上升。 玄科尤重，不得又犯也。 玄都下品第九篇曰：凡修上真之道，有犯上品、中品第九篇目之罪，罪结於九阴，悬考於玉清，犯者当然七灯於堂前，入室叩头，首罪经前，叩齿二十四通，陈咒曰： 玉光垂曜，仰彻上清，执供不礼，亏犯宝经，恐为四司，列罪紫庭，谨重斋敬，仰希真灵，曲垂下降，灭罪消刑，摄奉玄科，永保元贞。 毕。 如此一年，更斋二十四日，然后得还修奉所受。 玄科尤重，宜自明慎，不得又犯。 右太玄九真明科，三品二十七条，出自太上灵都之宫，太上常所宝秘，不宣下世。 今抄立用要诀，以付后圣，辅明三奇，标以大有素灵之经。 有骨分合仙，便得此文施用，拔罪解咎，释结散理，七玄将无，三年真灵见形，与子合并，同升九天。 轻泄玄科，罪同上文，惟在宝秘，密而奉行。 玄都九真篇曰：传授经目，在九真三品科中者，是后圣帝君始佩经之时，受於太上道君。 太上授经，出於三品明科，以辅三宝奇文，上真道经。 施用之科格，其三十一卷、独立余事及众经仪品，悉在《四极明科》之中。 九真三品，以三素之上篇，置於九帝之宫，四极以四司之官，总统众非纠罚之禁律。 太真明科，以太帝君所受，元始天王之玄章，上真之仪格，其法秘於九天之上，太帝之王藏诫於上真之官，不行於世。 九真明科以禁后学，四极明科总领四达，其旨幽彻，自无金字玉名，不得知闻。 有得此篇，不须学而自成。 科以禁罪，见科知改，知改则无亏於天地，无亏於天地则合於自然，合於自然便得上补於真仙也。 无科而学，去仙将为远矣。 玄都九真篇曰：凡有至志，名参玄宫，欲单受明科，知天法禁，然后受经，审有骨分，亦可先告盟而授之。 盟信法物，悉依三奇宝经之数，年限亦同如之。 不得轻付非真，宣露玄文，不依科旨，身没鬼官，七祖、父母，履刀山剑树，万劫不原。 外如不依科旨，罪同科文，彼此之禁，学者慎之。 玄都九真篇曰：凡受上法，而不承明科，亏略天禁，罪累七玄，考逮一身。 既知改首，罪责自厉，还修所受，而回又犯，其考重先。 此则骨命不合，形与真反，魄同鬼位，皆不得重首，复修於真经也。 吾今故以明科，悟於未悟，既知而犯，将何要哉。 奉者慎之。 太帝君赞",
      "translated_text": "Amidst the tangled five qi, the Supreme Perfected remain incomplete; the body, tainted by defiled qi, offends the Cavern Gate, harms the viscera, and severs life, disturbing the Three Passes. Violating the statutes and transgressing the precepts, one incurs prolonged karmic retribution. With reverent penance, I now report to the Imperial Honored Ones, beseeching that my case be proclaimed: may I depart from the lower worlds and ascend as a Heavenly Immortal. Thus concludes.\n\nUpon completing this year, observe twenty-four days of abstinence, then resume the practices you have received, and the true numina will descend. The gravity of the statutes is great—never transgress again.\n\n**The Eighth Scroll of the Lower Grade of the Mysterious Capital states:** Any who study the Dao of the Supreme Perfected yet commit the sins described in the eighth scroll of the Upper or Middle Grades shall be seized by the supervisory officials, their transgressions binding the Three Clarities. The offender must burn a *hu* of pure oil as lamps in the central courtyard, the quantity at their discretion, until the oil is exhausted. Additionally, offer ten catties of fine incense to a master who possesses the scriptures, thereby absolving three years of sin. Entering the chamber to burn incense, face north, kowtow nine times, confess the transgression, click the teeth twelve times, and recite the incantation:\n\nThe Heavenly Perfected are lofty and distant, their mysterious radiance descending in clarity. By virtue of past blessings, I have beheld the true scriptures. Yet, failing to grasp the mysterious statutes, I have slighted the celestial numina, violated the truth, and breached sincerity, plunging my person into darkness. Now, with rigorous self-reproach, I report to the Supreme Clarity. Henceforth, I shall purify my former form, uphold the mysterious truth, and align with the Dao. Thus concludes.\n\nAfter three years have passed, observe ninety days of abstinence. If you have already received the teachings from a master, you may resume cultivation; if not, present offerings and visit a master to receive the scriptures, then practice in accordance with the statutes to ascend. The mysterious statutes are exceedingly weighty—never transgress again.\n\n**The Ninth Scroll of the Lower Grade of the Mysterious Capital states:** Any who cultivate the Dao of the Supreme Perfected yet commit the sins described in the ninth scroll of the Upper or Middle Grades shall find their transgressions bound in the Nine Yin and their karmic retribution suspended in the Jade Clarity. The offender must light seven lamps before the hall, enter the chamber, kowtow, confess their sins before the scriptures, click the teeth twenty-four times, and recite the incantation:\n\nThe radiance of jade descends, illuminating the Supreme Clarity above. Through negligence in service and reverence, I have violated the precious scriptures. I fear the Four Offices will list my sins in the Purple Court. With solemn abstinence and reverence, I beseech the true numina to condescend and descend, erasing my sins and dissolving my punishments. I vow to uphold the mysterious statutes and eternally preserve my original integrity. Thus concludes.\n\nAfter one year, observe twenty-four days of abstinence, then resume the practices you have received. The mysterious statutes are exceedingly weighty—be vigilant and never transgress again.\n\nThe **Nine Perfected Statutes of the Great Mystery**, comprising three grades and twenty-seven clauses, originate from the Palace of the Numinous Capital of the Supreme, treasured and secretly guarded by the Supreme Lord, never to be disseminated in the lower worlds. Now, these essential excerpts are transcribed for the enlightenment of future sages, to illuminate the Three Marvels and be appended to the *Scripture of the Great Primordial Numinous Simplicity*. Those whose bones align with immortality may apply this text to absolve sins, resolve transgressions, untangle karmic knots, and dispel obstructions. The Seven Mysteries shall vanish, and after three years, the true numina will manifest, uniting with you to ascend the Nine Heavens together. To lightly divulge the mysterious statutes incurs the same punishment as the aforementioned transgressions. Guard them as treasures, keeping them secret and practicing them with reverence.\n\n**The Ninth Perfected Scroll of the Mysterious Capital states:** The transmission of scriptural titles found within the Three Grades of the Nine Perfected Statutes occurred when the Sage Emperor Lord first received the scriptures from the Supreme Dao Lord. The Supreme Lord bestowed the scriptures, derived from the Three Grades of Illuminated Statutes, to assist the Three Treasures and the marvelous texts of the Supreme Perfected scriptures. The statutes governing their application, along with the thirty-one scrolls, independent matters, and various scriptural rituals, are all contained within the *Illuminated Statutes of the Four Poles*. The Three Grades of the Nine Perfected are placed in the Nine Emperor’s Palace as the upper scrolls of the Three Simplicities. The Four Poles, governed by the Four Offices, oversee all transgressions and the prohibitions of punishments. The *Illuminated Statutes of the Supreme Perfected*, received by the Supreme Emperor Lord from the mysterious chapters of the Celestial King of Primordial Beginning, contain the rituals and statutes of the Supreme Perfected. Their methods are concealed above the Nine Heavens, and the prohibitions of the Supreme Emperor Lord are stored in the Palace of the Supreme Perfected, never to be practiced in the world. The *Illuminated Statutes of the Nine Perfected* restrain later students, while the *Illuminated Statutes of the Four Poles* govern the four directions. Their purport is profound and penetrating, yet without golden characters or jade inscriptions, they remain unknown. Those who obtain these scrolls need not study to attain perfection. The statutes exist to restrain sins; seeing the statutes and reforming ensures no transgression against Heaven and Earth. To be without transgression is to align with spontaneity, and aligning with spontaneity enables one to ascend and supplement the ranks of the True Immortals. To study without statutes is to distance oneself from immortality.\n\n**The Ninth Perfected Scroll of the Mysterious Capital states:** All who possess the utmost resolve and whose names are recorded in the Mysterious Palace may first receive the Illuminated Statutes to understand the celestial laws and prohibitions before receiving the scriptures. If their bones are aligned, they may first make a covenant and then be transmitted the teachings. The covenant’s ritual implements and offerings shall follow the quantities prescribed in the *Three Marvels’ Precious Scriptures*, with the same duration of years. Never lightly transmit to the unworthy, nor reveal the mysterious texts. Failure to adhere to the statutes will result in one’s person being consigned to the offices of ghosts, while the seven generations of ancestors and parents will tread upon the Mountain of Knives and Forest of Swords, never to be redeemed for ten thousand kalpas. Even external violations of the statutes incur the same punishment as the statutory text. These prohibitions apply to both parties—students, be vigilant.\n\n**The Ninth Perfected Scroll of the Mysterious Capital states:** All who receive the supreme methods yet fail to uphold the Illuminated Statutes, slighting the celestial prohibitions, shall incur sins that burden the Seven Mysteries and extend karmic retribution to their person. Once they repent and reform, their penance shall be rigorous. If, after resuming their practices, they transgress again, their retribution shall be heavier than before. Such individuals’ bones and life are misaligned, their form opposed to the truth, their po souls akin to ghosts—none may repent again or resume the study of the true scriptures. I now elucidate these statutes to awaken those who remain unawakened. For those who know yet still transgress, what purpose remains? Practitioners, be vigilant.\n\n**Eulogy of the Supreme Emperor Lord.**",
      "overlap_context": "Dao of the Supreme Perfected yet whose person has committed the sins described in the seventh scroll of the Upper or Middle Grades shall find their sins filling the Supreme Clarity. The transgressor must offer ten catties of fine incense to fellow practitioners in ten different places, each act absolving a year of sin. Entering the chamber to burn incense, face east, kowtow nine times, confess before the Supreme Perfected, click the teeth nine times, and raise the head to recite the incantation:",
      "start_char": 6342,
      "end_char": 7551,
      "start_sentence": 149,
      "end_sentence": 186,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.4180543422699,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上九真明科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "翳翳元化初，眇眇晨露散。 太寂空玄上。 寥朗二仪判。 凝精抱空胞，结化孕虚观。 含精赜神内，鲦欻启冥旦。 始悟忧促龄，运交反天汉。 萧萧步虚游，旋行礼玉京。 稽首归太无，乘风散灵香。 俯仰帝皇堂，飘飘随虚翔。 妙唱发奇音，吟咏太真章。 流度四大界，十天量无央。 阆台发幽夜，神烛吐奇光。 璀璨玉林华，熠烁耀琼堂。 虚生自然烟，蓊郁御玄纲。 群真披霄赞，宝盖顺风昂。 飞步咏空歌，神唱化道长。 郁郁大化隆，济济滋道兴。 积学随日感，功满入大乘。 福庆逮一切，七祖咸得升。 整驾陵太华，回辔绝霄馆。 灵风鼓空洞，香花乘烟散。 萧萧礼灵堂，诜诜步玄汉。 朗咏启幽襟，拔度宿根难。 五苦应时解，流芳注陶灌。 朗阙峙云网，飞霞翼灵舆。 提携无迹真，窈窕入太虚。 乘空诵玉篇，萧条咏羽书。 广念无不普，一切庆有余。 天帝君赞 至道生空寂，玄响阴相求。 三真本元一，气化理还殊。 法轮无形内，飘飘清观流。 凝章不待思，结气合玄符。 灵唱发空歌，吟咏步虚游。 玄化本无迹，有迹生道宗。 遨游九天际，息驾六领宫。 提携高上宾，反我素灵房。 道畅虚漠内，灵歌发太空。 形感至寂庭，思咏希微通。 云光翳晨晖，停曜荫玉京。 玄龙不待驾，萧萧步虚翔。 手拨七宝华，灵风散奇香。 妙咏乘襟发，粲粲启玉章。 万气混元一，总归三玄梁。 乘天不云高，遐望九玄辽。 振翮思玄辔，希登暮云霄。 积念告灵感，期与玉真交。 暧暧天汉澄，飘飘景云回。 三真腾空上，控辔迅紫微。 明唱度后身，咸令乘景飞。 拔出三涂难，九玄离苦哀。 太微帝君赞 太真生空洞，琼罗耀宝台。 旋行礼玉京，众仙唱微诗。 回转无迹内，虚歌契幽期。 度身上生天，吟咏积福基。 策辔太霞馆，时复宴景云。 飘飘无崖际，离离入玄门。 意适道亦畅，心丹志亦分。 积学随日新，咏我素灵文。 八景运天舆，飞霄蔚玄旌。 素盖乘风回，寥寥入紫清。 妙赞万真曲，玉响何铃铃。 披拔九阴籍，度身反南庭。 庆流普一切，妙化靡不荣。 清净玄道宗，明朗焕太空。 妙化由静嘿，潜想三素宫。 积念彻玄虚，微微至道通。 叩咏响玄寂，灵唱靡不隆。 丹晖映云庭，紫烟耀玉林。 焕烂七宝华，璀璨摇灵音。 宫商自相和，妙趣领入衿。 玄唱种福田，广度无界心。 后圣金阙帝君赞 眇莽元始天，三象混玄一。 萧萧正道兴，浩浩大乘逸。 六气还正庭，总归泥丸室。 出入游帝堂，精华曜云日。 运周反天汉，窈窕乘玄七。 圆华映明珠，二景对真光。 灵晖启朔会，玄象交扶桑。 冥度自相求，阴畅玄八荒。 若能餐此精，长得御玄纲。 游戏九玄台，解憩西羽阿。 神兽鸣琼堂，飞凤互参差。 虚生自然咏，真人唱节和。 化身劫仞庭，缘香命清歌。 建功立福田，拔度后身罗。 七玄散幽宫，去离无难那。 飞度蹑霄岭，翔翮东华宫。 风云虚中唱，玉音散琼堂。 真人咏空歌，妙响绝云房。 解我自然襟，成我积劫功。 长啸九玄上，清瞻睹空同。 龙吟绝宅府，凤啸太霄馆。 虚唱无留味，哀音乘风散。 谁能究此章，精诵素灵赞。 以解九阴过，拔度七玄难。 太极真人曰：《太上素灵洞玄妙经》，以元始同生，灵文既存，众真诣座，烧香礼经，旋行诵此二十一篇之章，以庆於神庭也。",
      "translated_text": "Amidst the obscurity of primal transformation’s dawn,\nthe faintest morning dews disperse.\nIn the Great Stillness above the Void and Mystery,\nthe Two Modes divide in boundless clarity.\n\nCongealed essence embraces the hollow womb,\ncoalescing into form, nurturing the vision of emptiness.\nHolding essence within the profound and numinous,\nin a flash, the dark dawn unfolds.\n\nAt last awakening to the sorrow of fleeting years,\none’s fate turns back toward the Celestial Han.\nWith whispers of *buxu* steps, circling in reverence,\none pays homage to the Jade Capital.\n\nBowing in obeisance to the Great Nothingness,\nriding the wind, scattering sacred incense.\nLooking up and down within the halls of emperors,\nadrift and soaring on the void.\n\nExquisite chants emit wondrous sounds,\nintoning the hymns of the Supreme Perfected.\nFlowing through the Four Great Realms,\nthe Ten Heavens stretch boundlessly.\n\nFrom the Tower of Lang, the dark night breaks,\ndivine candles spout radiant light.\nJade forests bloom resplendently,\ntheir brilliance illuminating the jasper halls.\n\nThe void gives rise to natural mist,\nlush and dense, upholding the Mysterious Net.\nThe host of perfected beings, robed in dawn’s glory, praise,\ntheir jeweled canopies raised with the wind.\n\nIn flying steps, they chant the hymns of emptiness,\ndivine songs nurturing the Dao’s growth.\nProfound and vast, the Great Transformation flourishes,\nabundant and thriving, the Dao’s rise.\n\nThrough daily accumulation of study, responding to inspiration,\nmerit fulfilled, one enters the Great Vehicle.\nBlessings and fortune extend to all,\nthe Seven Ancestors all ascend.\n\nHarnessing the chariot to scale the Great Flower,\nturning the reins toward the celestial palaces.\nDivine winds stir the hollow vastness,\nfragrant blossoms ride the mist and scatter.\n\nWith whispers, they pay homage in the numinous hall,\nin orderly ranks, they tread the Mysterious Han.\nBright chants open the depths of the heart,\ndelivering from the hardships of past roots.\n\nThe Five Sufferings dissolve in due time,\ntheir fragrance infused in the alchemical vessel.\nThe luminous towers stand amidst cloud-nets,\nflying auroras flank the divine carriage.\n\nLifting the traceless perfected,\ngently they enter the Great Void.\nRiding the void, they recite the jade scriptures,\nin desolate elegance, they chant the feathered texts.\n\nVast thoughts extend universally,\nall things overflow with blessings.\nThe Celestial Emperor Lord’s Eulogy:\n\nThe Supreme Dao arises from emptiness and stillness,\nmysterious echoes seek one another in the yin.\nThe Three Perfected originate from the Primordial One,\nyet in qi’s transformation, principles diverge.\n\nWithin the formless Dharma Wheel,\nit flows, ethereal and pure in contemplation.\nVerses congeal without awaiting thought,\nqi coalesces, uniting with the mysterious talisman.\n\nDivine chants emit hymns of emptiness,\nintoning while treading the void in reverent circling.\nThe mysterious transformation is originally traceless,\nyet traces give rise to the Dao’s lineage.\n\nRoaming the Nine Heavens’ bounds,\nresting the chariot at the Six Peaks’ palaces.\nLifting the exalted guests,\nreturning to my pristine numinous chamber.\n\nThe Dao flows freely within the vast and silent,\ndivine songs resound in the Great Void.\nForms respond in the Court of Utmost Stillness,\nthoughts and chants connect the subtle and imperceptible.\n\nCloud-light veils the morning glow,\nits lingering radiance shades the Jade Capital.\nThe Mysterious Dragon awaits no chariot,\nwith whispers, it soars on the void.\n\nHands pluck the Seven Treasures’ blossoms,\ndivine winds scatter wondrous fragrance.\nExquisite chants arise from the heart’s depths,\nbrilliant and resplendent, unfolding jade verses.\n\nThe myriad qi merge into the Primordial One,\nall returning to the Three Mysteries’ beam.\nRiding the heavens, how could it be called high?\nGazing afar, the Nine Mysteries stretch boundlessly.\n\nFlapping wings, longing for the mysterious reins,\nyearning to ascend the evening clouds’ empyrean.\nAccumulated thoughts invoke divine resonance,\nhoping to commune with the Jade Perfected.\n\nDimly, the Celestial Han clears,\nadrift, the auroras return.\nThe Three Perfected soar into the void,\ngrasping the reins, swiftly entering the Purple Tenuity.\n\nBright chants deliver the later bodies,\nall are enabled to ride the light and fly.\nDelivering from the Three Paths’ hardships,\nthe Nine Mysteries escape sorrow and lament.\n\nThe Supreme Tenuity Emperor Lord’s Eulogy:\n\nThe Supreme Perfected arises from the hollow vastness,\nthe jasper net illumines the jeweled terrace.\nCircling in reverence to the Jade Capital,\nthe host of immortals chant subtle verses.\n\nTurning within the traceless,\nvoid songs harmonize with the hidden tryst.\nDelivering the body to ascend heaven,\nintoning to accumulate the foundations of fortune.\n\nUrging the reins toward the Great Aurora’s palace,\noccasionally feasting amidst the auroras.\nAdrift without bounds,\nseparating to enter the Mysterious Gate.\n\nThe mind at ease, the Dao also flows freely,\nthe cinnabar heart and will also part.\nThrough daily accumulation of study, renewing,\nchanting my pristine numinous texts.\n\nThe Eight Auroras propel the celestial carriage,\nflying auroras embellish the mysterious banner.\nThe plain canopy rides the wind in return,\ndesolate, entering the Purple Clarity.\n\nExquisite praises of the myriad perfected hymns,\njade echoes—how resonant!\nUnbinding the Nine Yin’s registers,\ndelivering the body back to the Southern Court.\n\nBlessings flow universally to all,\nwondrous transformations leave none unprosperous.\nThe pure and tranquil Mysterious Dao’s lineage,\nluminous and radiant, illumines the Great Void.\n\nWondrous transformations arise from silent stillness,\ninwardly contemplating the Three Primes’ palace.\nAccumulated thoughts pierce the mysterious void,\nsubtly, the Supreme Dao is attained.\n\nKnocking and chanting, resonating with the mysterious stillness,\ndivine songs leave none unexalted.\nCinnabar radiance reflects the cloud-court,\npurple mist illumines the jade forest.\n\nResplendent, the Seven Treasures’ blossoms,\nbrilliant, they sway with the numinous sounds.\nGong and shang naturally harmonize,\nexquisite subtleties guide the heart’s depths.\n\nMysterious chants sow the fields of fortune,\nbroadly delivering the boundless heart.\nThe Golden Portal Emperor Lord of Later Saints’ Eulogy:\n\nVast and boundless, the Primordial Beginning of Heaven,\nthe Three Images merge into the Mysterious One.\nWith whispers, the Orthodox Dao flourishes,\nvast and expansive, the Great Vehicle soars.\n\nThe Six Qi return to the Orthodox Court,\nall converging in the Mud-Pill Chamber.\nEntering and exiting, roaming the Emperor’s halls,\nessence and splendor illumine the clouds and sun.\n\nCirculating, returning to the Celestial Han,\ngently riding the Mysterious Seven.\nRound blossoms reflect the luminous pearl,\nthe Two Auroras face the true light.\n\nDivine radiance initiates the northern assembly,\nmysterious images intersect at Fusang.\nDarkly, they seek one another,\nyin flows freely through the Mysterious Eight Wastes.\n\nIf one can consume this essence,\none shall long uphold the Mysterious Net.\nPlayfully roaming the Nine Mysteries’ terrace,\nresting at ease in the Western Feather’s Alley.\n\nDivine beasts sing in the jasper hall,\nflying phoenixes intermingle in disarray.\nThe void gives rise to natural chants,\nperfected beings sing in rhythmic harmony.\n\nTransforming bodies in the kalpa’s court,\nincense and destiny command pure songs.\nEstablishing merit and sowing fields of fortune,\ndelivering later bodies from the net.\n\nThe Seven Mysteries scatter from the dark palace,\ndeparting, leaving no hardship behind.\nFlying to tread the empyrean ridges,\nsoaring wings toward the Eastern Flower’s Palace.\n\nWinds and clouds chant within the void,\njade sounds scatter in the jasper hall.\nPerfected beings chant hymns of emptiness,\nexquisite echoes transcend the cloud-chambers.\n\nUnbinding my natural heart,\nfulfilling my kalpas’ accumulated merit.\nLong whistling above the Nine Mysteries,\nclearly gazing upon the void’s sameness.\n\nDragons sing beyond the abodes,\nphoenixes whistle in the Great Aurora’s palace.\nVoid chants leave no lingering taste,\nmournful sounds ride the wind and scatter.\n\nWho can fathom these verses?\nDiligently reciting the pristine numinous praises,\nto resolve the Nine Yin’s transgressions,\ndelivering from the Seven Mysteries’ hardships.\n\nThe Supreme Ultimate Perfected states: *The Supreme Lord’s Pristine Numinous Cavern-Mystery Wondrous Scripture*, since the Primordial Beginning shares life with all, and the numinous texts already exist, the host of perfected beings approach the throne, burn incense, pay homage to the scriptures, and circumambulate while reciting these twenty-one chapters, to celebrate within the divine court.",
      "overlap_context": " be rigorous. If, after resuming their practices, they transgress again, their retribution shall be heavier than before. Such individuals’ bones and life are misaligned, their form opposed to the truth, their po souls akin to ghosts—none may repent again or resume the study of the true scriptures. I now elucidate these statutes to awaken those who remain unawakened. For those who know yet still transgress, what purpose remains? Practitioners, be vigilant.\n\n**Eulogy of the Supreme Emperor Lord.**",
      "start_char": 7551,
      "end_char": 8774,
      "start_sentence": 187,
      "end_sentence": 285,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.09852409362793,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上九真明科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "玉音激朗，清彻九天，其句幽微，妙趣傍通，诵咏一过，万神启灵，恒能究习，与帝合真，解宿对之重责，拔七玄之幽宫，解五苦於愁魂，度身上於生天。 妙乎微哉，斯之灵文也。 太上九真明科竟",
      "translated_text": "The Jade Tone resounds with clarity,\npiercing through the Nine Heavens.\nIts lines are subtle and profound,\ntheir wondrous essence branching wide.\nReciting once, the myriad spirits awaken;\npersistently studying, one merges with the Emperor in truth.\nIt dissolves the heavy burdens of past confrontations,\ndelivers from the dark palaces of the Seven Mysteries,\nreleases the Five Sufferings from grieving souls,\nand elevates the body to ascend to the heavens of life.\n\nHow wondrous and subtle—\nthis numinous scripture!\n*Here ends the Supreme Lord’s Nine Perfected Bright Statutes.*",
      "overlap_context": "ous praises,\nto resolve the Nine Yin’s transgressions,\ndelivering from the Seven Mysteries’ hardships.\n\nThe Supreme Ultimate Perfected states: *The Supreme Lord’s Pristine Numinous Cavern-Mystery Wondrous Scripture*, since the Primordial Beginning shares life with all, and the numinous texts already exist, the host of perfected beings approach the throne, burn incense, pay homage to the scriptures, and circumambulate while reciting these twenty-one chapters, to celebrate within the divine court.",
      "start_char": 8774,
      "end_char": 8864,
      "start_sentence": 286,
      "end_sentence": 288,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.3828647136688232,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上九真明科.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}