{
  "source_id": "太上洞玄灵宝诚业本行上品妙经",
  "source_file": "chunked_daozang\\太上洞玄灵宝诚业本行上品妙经.json",
  "total_chunks": 10,
  "total_original_chars": 10780,
  "total_translated_chars": 73328,
  "total_translation_time": 343.6527976989746,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝诚业本行上品妙经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Supreme Cavernous Mystery Numinous Treasure Scripture on the Precepts of Karmic Origins and Fundamental Practices, Upper Grade**\n\n**Scripture Title:** *The Supreme Cavernous Mystery Numinous Treasure Scripture on the Precepts of Karmic Origins and Fundamental Practices, Upper Grade*. Author unknown, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. Exhorts cultivation of the supreme Golden Perfection and sincere karma. One scroll.\n\n**Source:** *Daoist Canon of the Orthodox Unity*, Cavernous Mystery Section, Textual Category.\n\n---\n\nThe Dao spoke: In former times, upon the Jade Terrace within the Cavern of Luminous Cinnabar Heavens, I received the supreme grade of the Wheel of the Golden Perfection’s Precepts of Karmic Origins and Fundamental Practices. Thereby was I bestowed the title of Supreme Highest Cavernous Luminous Great Dharma King, ever presiding over the Great Enclosure of the Jade Clarity’s Highest Heaven, where the Flying Celestials gather.\n\nThe merit of the Wheel’s original precepts of karma unfolds the realm of the myriad existences’ birth and death, the roots of heavenly and human transgressions and blessings. It conveys the Three Vehicles, ascending to the Upper Clarity, where the Tenfold Perfected attain transcendence. Its radiance illumines the darkest nights, vast and boundless across the ten directions. It severs the roots of the ten evils, guiding all to practice the ten virtues, that they may swiftly ascend to the Heaven of Immeasurable Great Enclosure. Those who follow shall attain the Perfection of the Dao.\n\nThe Dao spoke: I ever descend with the turning of the kalpas to the Great Hall of Primordial Life and Blessing in the Flying Heavens of the ten directions, within the Cavern of Luminous Treasure Courts. There I unfold this Wheel of Dharma, the ten gates of virtue, causing all ten evils to transform by the Law. Through this Wheel’s turning, they ascend to the heavens, all attaining wondrous communion and the vast illumination of fundamental practices.\n\nBy the karmic conditions of past lives, I observe heaven and earth, yet few indeed are those who, lacking supreme virtue, can uphold this teaching.\n\nThe Dao spoke: The precepts of karma and the highest practices belong to the far-reaching virtue of the exalted. The fundamental practices of the Golden Perfection are the enduring source. When virtue aligns with right mindfulness, demons dare not speak. Sever all delusions and confusions, and the myriad heavens shall pay homage to the Perfected. As for those who generate evil, do not follow them. Their roots of sin run deep. Should they enter my Wheel of Dharma, the calamities they provoke—do not contend with them. To fall into the Three Evil Realms is to find return most arduous. Those who obstruct the Dao are shrouded in ignorance; those who envy others inflict punishment upon themselves. Those who slander others first emerge from the paths of beasts. Those who delight in lust and sensuality—from their past karma, the roots of the six domestic animals remain unsevered. The greedy and cruel harm themselves; the gluttonous swallow poison. Such are the origins of suffering—one must distance oneself from them.\n\nThe Dao spoke: When the Primordial Heavenly Worthy was to expound these precepts of karmic origins and fundamental practices, the Heavenly Worthy pointed a finger toward the ten directions of empty space, summoning the Flying Heavenly Thearchs, the Perfected Sovereigns, the Flying Heavenly Boundless Divine Kings, the Perfected of Wondrous Practices, the Supreme Jade Emperor, the Boundless Great Sage and Venerable Spirits, the Thirty-Six Heavenly Emperors, the Perfected of the Myriad Heavens, the Perfected of the Nine Palaces, the Five Elders of the Upper Perfected, the Heavenly Perfected and Earthly Immortals, the Jade Maidens of the Boundless Worlds, the Immeasurable Great Sage Assemblies, the Spiritual Officials of the Three Realms, the Enforcing Officials of the Three Primes, and their innumerable hosts. All at once, they rode the void and came, ascending to the Fourfold Radiance of the Jade Capital’s Heavenly Light, beneath the Purple Canopy that revolves the heavens. Their majestic spirits surged, streaming through the ten directions, illuminating the myriad heavens. They burned incense, scattered flowers, and circumambulated thrice in the Flying Mystery Step, then returned to their places. Bowing in reverence, they paid homage to the Perfected and together ascended the fields of the Golden Perfection’s Wheel of Dharma. Gazing upward to the Dharma’s sound, none were not filled with joy, all praising its goodness.\n\nThe Dao spoke: The supreme sincere karma of the Golden Perfection universally exalts the foundation of practice in the ten thousand enclosures. Few indeed are those who grasp the wondrous essence of Heaven’s principle—only the Upper Perfected practice it.\n\nYet the heavenly beings of the ten directions, dwelling in the treasuries of calamity, devise myriad schemes, releasing all manner of evil. The key lies in the heart. Establish the Daoist sanctuary, universally turn the Wheel of Dharma, illumine the Six Paths, and deliver the heavenly beings, the lonely souls, and the suffering spirits, that all may ascend to the Heaven of Blessing, ever rejoicing, enduring through kalpas, forever preserved. Henceforth, all shall be by the grace of the Wheel’s supreme grade.\n\nAt that time, the innumerable hosts of the Great Sages of the Myriad Heavens all praised its goodness, circumambulated thrice to the left, clasped their hands in reverence, and prostrated to receive the precepts.\n\nThe Heavenly Worthy addressed the assembly of heavenly sages: \"I unfold the Wheel of the Golden Perfection, transforming the causes of all. Yet nothing is more difficult than the form.\n\nThe body of utmost virtue is also the domain of a single state. Profit invites calamity—it is the heart’s creation. Thus, the realm of containment and concealment is entered through the gate of good and evil. Only the Perfected are awakened, attaining the Dao through non-action. If one can follow this, receive it sincerely, and never forget—\"\n\nThe Heavenly Worthy addressed the assembly of heavenly sages: \"The primordial qi is subtle and insubstantial, its movement and guidance impure. Fundamental karma is easily created, yet may lead to the loss of one’s body. From the five hearts arise the ten evils, long drowning in the blades of poison—can none awaken? They suffer their own pain!\n\nI turn the Wheel to deliver the heavenly beings of the ten directions from the sources of birth and death. When the ten virtues are fully established and one awakens to all karmic conditions of future lives, submitting to the precepts of karma, one attains the Perfection of the Dao.\"\n\nThe Heavenly Worthy addressed the Dao Lord: \"I unfold the supreme grade of the Wheel of Dharma, the Golden Perfection’s precepts of karma, the ten virtues as the root, the gate of myriad practices. If you follow them, all must submit and listen.\"\n\nThereupon, the Dao Lord bowed with clasped hands and prostrated to receive the precept text.\n\nThe Precepts state:\n\n**First Grade:** Right contemplation of the wondrous origin of the multitude—all attain the karma of spiritual penetration.\n**Second Grade:** Right hearing of the wondrous sound—spiritual penetration knows the ten directions.\n**Third Grade:** Right knowledge of the entry of fragrant light—spiritual penetration abides in the numinous qi.\n**Fourth Grade:** Right sound opens the wondrous gate—spiritual penetration brings boundless fruits of benefit.\n**Fifth Grade:** Right mindfulness of the precepts of Dharma and practice—spiritual penetration descends the Perfection of the Dao.\n**Sixth Grade:** Right mindfulness of the suffering of sentient beings—spiritual penetration manifests radiant retribution.\n**Seventh Grade:** Right contemplation of non-dual delusion—spiritual penetration enters the realm of the true Dao.\n**Eighth Grade:** Right practice of the great compassionate karma—spiritual penetration attains the supreme Perfection.\n**Ninth Grade:** Right stabilization of form and shadow, unmoved by the multitude of practices—spiritual penetration awakens to the wondrous.\n**Tenth Grade:** Right embodiment of form and spirit, steadfast and luminous in rectitude—spiritual penetration is profoundly mysterious.\n\nThe Heavenly Worthy spoke: The Ten Right Spiritual Penetrations of the Golden Perfection’s Supreme Grade are the foremost of the ten thousand practices, the foundation of rectitude throughout the ten directions, and the root of boundless subtle penetrations. I now turn the Wheel of Dharma to expound this text, that all may transcend kalpa-disaster and the obstructions of birth and death, turning from these to ascend to eternal abiding. The Perfection of the Dao is thereby accomplished, and one shall never encounter the gates of the ten evils throughout life.\n\nThe Heavenly Worthy spoke: The Ten Grades of the Golden Perfection’s fundamental practice are the supreme merits of the highest good.\n\n**First Grade:** Sever the causes of craving for the five colors, and right vision shall not stray into perverse gazing.\n**Second Grade:** Sever the sounds of the five tones and six defilements, so that no perverse hearing arises within or without.\n**Third Grade:** Sever the causes of the six contacts, and perverse qi shall not enter.\n**Fourth Grade:** Sever empty chatter and false discourse, so that perverse speech and frivolous words do not arise.\n**Fifth Grade:** Sever the harms of manifold calamities, so that no multitude of perversities may invade.\n**Sixth Grade:** Sever the contemplation of the five aggregates, so that perverse evil does not encroach.\n**Seventh Grade:** Sever actions that are improper or contrived, so that perverse disasters do not arise.\n**Eighth Grade:** Sever all deluded confusions, so that no multitude of perversities may assail any being.\n**Ninth Grade:** Sever aimless conduct, and perverse illnesses shall naturally dissolve.\n**Tenth Grade:** Sever the karma of the ten evils, and ever hold the Dharma Wheel in mind. Then the myriad demonic and perverse spirits shall retreat of themselves, none daring to oppose you.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: These are the supreme grades of the Golden Perfection’s fundamental practice. By refining the true in the clarity of emptiness and quiescence, one is called a practitioner of the supreme practice. Those who can thus abide may attain the Golden Perfection. I observe that among the hosts of heaven and humanity, not one in ten thousand—unless they be perfected beings—can follow this path.\n\nThe Heavenly Worthy spoke: Those who constantly uphold the Ten Grades of the Golden Perfection’s contemplative practice shall perfect the ten thousand virtues.\n\n**First Grade:** Seeing the five colors without craving—licentious winds shall not arise.\n**Second Grade:** Hearing the five tones without listening—demonic winds shall naturally disperse.\n**Third Grade:** Encountering manifold fragrant qi without delight—the six viscera shall not be harmed, and perverse winds shall retreat of themselves.\n**Fourth Grade:** Seeing the five flavors without craving sweetness or excess—no multitude of defilements shall stain the body.\n**Fifth Grade:** Hearing manifold pleasures without observing them—external defilements and perverse winds shall not disturb.\n**Sixth Grade:** Abiding in oneness without false imaginings—one shall remain unstained throughout life, and perverse qi shall not arise.\n**Seventh Grade:** In all actions, riding the precepts and fundamental practice—all defilements shall dissolve of themselves, and one’s form and countenance shall radiate purity.\n**Eighth Grade:** Seeing treasures and goods without seizing what is not rightfully obtained—myriad virtues shall come to fruition, and one shall abide in peace throughout life.\n**Ninth Grade:** Harmonizing one’s nature without envy or jealousy, and not being provoked by events—myriad blessings shall descend upon the true, and numinous demons shall pay homage.\n**Tenth Grade:** Abiding in tranquility and serene contemplation, cherishing compassionate thoughts for all past lives—guardians from the ten directions shall protect the body. One shall present merits on high and attain the Golden Perfection.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: I now reveal the origin of the Wheel of Dharma’s precepts and fundamental practice of the Golden Perfection’s Supreme Grade. If the heavenly and human beings of the ten directions can thus abide, they shall equal the merits of the Ten Sages and enter the Dharma-realm of eternal abiding. They shall attain the Dao naturally, their lives suffused with luminosity. For kalpas unnumbered as the Ganges’ sands, they shall share in rejoicing, their blessings flowing through ten thousand generations, ever abiding with the Dharma Wheel without cessation.\n\nThe Heavenly Worthy spoke: I now turn the Wheel of Dharma in the assembly of the Ten Sages. With each grade of turning penetration:\n\n**First Grade:** One immediately knows the weight of matters in a single direction and discerns the ranks of the sages.\n**Second Grade:** One knows the existence or non-existence of auspicious and inauspicious matters in the world, and attains the rank of awakened sage.\n**Third Grade:** One thoroughly understands the causes of sin and blessing, the comings and goings of all past lives, their destinations, and the fruits of karmic retribution, and attains the rank of rightly awakened sage.\n**Fourth Grade:** One can perceive the minds of sentient beings with the mind, reverse-illuminating future events and the hidden matters of fortune and misfortune, and attains the rank of penetratingly awakened sage.\n**Fifth Grade:** One universally knows the conditions, movements, causes, and fortunes of all inexhaustible worlds in the ten directions, and attains the rank of greatly awakened sage.\n**Sixth Grade:** Through penetrating observation, one knows the abodes of all sages in the realms of the ten directions as clearly as pointing to the palm of one’s hand. One can divide form and disperse shadow without hindrance in the void, and attains the rank of wondrously awakened sage.\n**Seventh Grade:** One universally knows the movements and mechanisms of heaven and earth, their existence or non-existence, far or near, all without obstruction, and attains the rank of penetratingly awakened sage.\n**Eighth Grade:** Abiding in forgetfulness while standing, one’s form is like a shadow at noon. All is seen through, and one attains the rank of observantly awakened sage.\n**Ninth Grade:** One universally illumines and radiates the precious light from within the body, universally illuminating the ten directions. All is universally seen, and there is nothing above or below that is not thoroughly understood. One attains the rank of universally luminous, greatly awakened sage.\n**Tenth Grade:** Universally observing, universally examining, universally illuminating, universally shining—nothing is hidden or dark. One thoroughly knows heaven and earth, and the light manifests throughout the ten directions, abiding in silent profundity. One attains the rank of penetratingly luminous, greatly awakened, perfected, and supreme sage.\n\nThe practices and merits of these grades all turn through the Wheel of Dharma. The eighty penetrations of the great sages are of lofty and wondrous virtue. Without the power of the Dharma Wheel, none could attain them. The fruition of the Ten Sages arises from kalpas as numerous as the Ganges’ sands, wherein they have cultivated merit and spread virtue, filling heaven and earth and pervading the ten directions. Thus they attain their ranks and enter the merits of the Ten Sages, wondrously penetrating the Supreme Grade. If the heavenly and human beings of the ten directions can thus abide, the Perfection of the Dao is accomplished.\n\nThen the Heavenly Worthy commanded the Supreme, Most High, Penetratingly Luminous Great Dharma King, saying: You shall recite the Jade Chapters of the Turning Ranks of the Wondrous Penetrations of the Precepts and Fundamental Practice of the Supreme Golden Perfection’s Dharma Wheel. The Supreme, Most High, Penetratingly Luminous Great Dharma King rose, made obeisance, and circumambulated the True One thrice to the left.\n\nHe recited the Jade Chapters of the Precepts and Fundamental Practice of the Dharma Wheel, saying:\n\nIn the profound quiescence, the merit of Dharma’s sincerity,\nContemplation and practice reach the Great Vehicle’s utmost.\nThe Golden Perfection’s manifold wondrous excellences,\nRightly ranked, are the court of all heavens.\nThe Dharma Wheel’s supreme virtue,\nAll turns to the supreme Perfection.\nBeyond the six perfections, spiritual penetrations,\nAre the flying immortals, the greatly blessed.\nOpening and delivering the great Brahmā immortals,\nThe Ten Grades all attain the Perfection.\nMajestic is the natural Dao,\nCarefree in the Great Radiant Heaven.\nThrough kalpas as the Ganges’ sands,\nAll conditions are observed.\nWithout the supreme-grade practice,\nHow could the roots of suffering be eradicated?\n\nThe Jade Chapters of the Supreme-Grade Fundamental Practice of the Dharma Wheel say:\n\nIn penetrating contemplation of the Ten Fundamental Sources, luminous and clear, they congeal into the Real.\nSevering the realms of the Ten Evils, one’s conduct enters the Dharma Wheel.\nInner and outer fragrance and radiance arise,\nSwiftly ascending to the Golden Perfection.\nOnce risen to the Cloud-Luminous Palace,\nMajestic radiance illumines all heavens.\nAll proceeds from the Fundamental Practice.\nBowing in reverence, they pay homage to the Heavenly Worthy.\n\nThe Jade Chapters on Contemplation and Practice of the Dharma Wheel say:\nGazing upward at the Golden Perfection’s conduct,\nIts surpassing splendor is free of all dust.\nIts form and bearing bear the Seven Treasures’ marks,\nCloud-luminous, illuminating all heavens.\nSoaring in the Great Vehicle’s realm,\nFlying immortals turn the Dharma Wheel.\nMyriad blessings unite in one celebration,\nTurning to deliver those in the Ten Sufferings.\nThe body ascends above the Jade Pool,\nBathing and refining to become an immortal.\nIn the Ten Directions, no lonely souls remain,\nUniversally opening the Ganges’ sands of grace.\nWondrously penetrating the Perfection’s virtue,\nThey bow their heads before the Heavenly Treasure.\n\nThe Jade Chapters on the Dharma Wheel’s Turning and Penetrating the Ten Sagely Luminous Realms say:\nThe Supreme unfolds wondrous transformation,\nIts merit in motion, all dawn in unison.\nThe Dharma Wheel’s Ten Grades’ realms,\nThe Great Canopy’s manifold Dharma gates.\nCollectively called the Great Radiance Grade,\nThe Ten Sages and Highest Perfected.\nWondrous virtue turns the Ten Penetrations,\nSerene are the Ten Flying Immortals.\nPeaceful and joyful, unending bliss,\nUniversally illuminating past karmic conditions.\nLife harmonizes with eternal longevity,\nLuminous awakening responds to the natural.\nSubtle and peerless, none can compare,\nIn the six periods, they pay homage to the Heavenly Worthy.\n\nThe Heavenly Worthy addressed the Dao Lord, saying:\nThese four Jade Chapters are the foremost of the Supreme Golden Perfection’s precepts and karma, the source of the Dharma Wheel’s turning and wondrous awakening’s Fundamental Practice. This text is sealed within the Supreme Jade Capital’s Flowing Luminosity Palace, guarded and cherished by the Golden Perfection’s Primordial Lady. The Golden Spirit Youths and eight thousand four hundred Perfected constantly recite its chapters, their voices resounding through the Ten Directions, echoing brightly through all heavens. The host of Perfected join hands in praise, the Utmost Perfected pay homage, and the Highest then opens the Supreme Grade of the Dharma Wheel, turning to deliver the multitudes of great sagely beings in the Ten Directions who have attained the Dao, thereby ascending to the Supreme Golden Perfection.\n\nIf any among heaven and humankind know these chapters, receive and uphold them with devotion, observe purification rites, and reverently recite this sacred text, their numinous tones will ascend to penetrate the Ten Directions. The Nine Heavens rejoice, the Highest praise and extol, immediately opening the grades of the Dharma Wheel to turn and deliver such persons, enabling them to ascend to the Supreme Perfected’s manifold realms. This Dao is lofty and wondrous; unless the Great Radiance unfolds to pervade the Ten Directions, none could hear of it.\n\nThe Heavenly Worthy said: I open the Dharma Wheel’s Ten Virtues’ manifold realms. The first grade is compassion and filial piety toward all beings, with all conduct harmonized in one mind. The second grade is cherishing and caring for all sentient beings as one’s own self. The third grade is faithfully turning toward the scriptural precepts, the source from which transgressions and blessings arise. The fourth grade is being able to relinquish treasures and wealth, bestowing alms upon the immeasurable multitudes of the destitute and suffering in the world. The fifth grade is being able to extensively establish merit and virtue, constructing Daoist sanctuaries, thereby creating blessings for ten thousand generations. The sixth grade is being able to uphold goodness unto death, enduring humiliation, refraining from killing and stealing. The seventh grade is being able to rescue and relieve all in dire distress, preserving the lives of immeasurable sentient beings, releasing and liberating without end, all thereby preserving their fundamental lives. The eighth grade is being able to make offerings to the Three Treasures, morning and evening paying homage and reciting scriptures, upholding precepts and observing purification, ever without weariness. The ninth grade is constantly being able to transform and enlighten heaven and humankind, cherishing and caring for the sovereign, ensuring the longevity of their reign, perpetually using wealth and resources to benefit the poor, orphaned, elderly, and immeasurable suffering beings, ever without greed or stinginess. The tenth grade is conduct that is perpetually thus, neither advancing nor retreating, single-mindedly practicing goodness.\n\nIf any among heaven and humankind can be thus, they may be called the merit of the Ten Virtues, the foundation of the myriad practices’ united celebration. These are all the source of the Ten Directions’ Flying Immortals’ boundless Utmost Perfected Sovereigns’ supreme precepts and Fundamental Practice. If any among heaven and humankind can follow them, they will thereby equal the merit of the Ten Directions’ Flying Immortals’ boundless Utmost Perfected.\n\nThe Jade Chapters on the Supreme Flying Immortals’ Dharma Wheel Turning the Ten Virtues’ Wondrous Penetration say:\nThe Flowing Luminosity’s Great Model Grade,\nOpens the Dao’s immeasurable merit.\nTurning to deliver the Ten Virtues’ conduct,\nBrahmā’s splendor, the Flying Immortals’ hall.\nCarefree in the Seven Treasures’ palace,\nGazing upward at the Dharma Wheel’s King.\nNuminous countenance surpassingly wondrous,\nConstantly descending to the Ten Dao Realms.\nIn unison, they ride the Three Treasures’ vehicle,\nConveying all heaven and humankind.\nSwiftly, cloud radiance arises,\nAll forms bearing golden countenances.\nAll proceeds from this blessing,\nReceiving the rank of Highest Perfected.\nRoaming and resting on the Heavenly Treasure Terrace,\nCelebrating this kalpic cycle’s return.\nThrice circling, they pay homage to the Dao’s Master,\nBowing their heads in reverence to the Heavenly Worthy.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: This Jade Chapter is one of the Ten Directions’ Supreme Golden Radiance Youths, each with ten Perfected, stationed within the Flying Immortals’ Dharma Wheel’s Heavenly Treasure Palace, guarding and cherishing the sacred text. They constantly follow the Dharma Wheel’s Ten Virtues’ grades, turning the Dharma Wheel, reciting its chapters to deliver the Ten Directions’ heavens’ multitudes of practitioners of immeasurable goodness. Urging them to ride the Three Vehicles’ treasure conveyance, they chant and recite its tones, the host of Perfected joining in praise, their voices shaking the Ten Directions. All heavens perform rites, none without reverent hearts, opening the ford to the Three Realms. The Three Perfected welcome them with incense, flowers, music, and dance, escorting the virtuous directly to ascend to the Dharma Wheel’s manifold realms.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: I open the Supreme Grade of the Dharma Wheel’s Ten Virtues, universally enabling all heaven and humankind in the Ten Directions to abandon the Ten Evils’ manifold realms. If any practice these Ten Evils, you must not follow their conduct. Among them, those who proclaim joy and happiness, you should avoid their words. If any seek to harm you, you need only single-mindedly contemplate the precepts and karma, preserving the Real while enduring their killing. In principle, they will be unable to harm your body, thereby transforming into the Supreme Utmost Perfected. Such persons will naturally receive the karmic retribution of killing. If any sagely and worthy beings emerge, you should seek them out, drawing near to their numinous countenance, thereby perpetually receiving their power for ten thousand kalpas.\n\nThe principle is most subtle, thus the Ten Blessings’ Hall of the Upper Heavens is set against the Ten Evils’ realms below.\n\nThe Heavenly Worthy said: The Dharma Wheel opens to deliver the Ten Evils’ manifold realms. The first grade is failing to practice the Dao of compassion and filial piety, lacking propriety between high and low, perpetually without harmonious and compliant hearts toward one another. The second grade is failing to practice cherishing and caring for sentient beings, perpetually harboring malevolence. The third grade is lacking faith and devotion, following the impulses of their emotions, committing manifold evil deeds, rebelling against the sovereign.\n\nThe fourth grade is failing to practice love of goodness, refusing to relinquish or bestow, constantly damaging others’ possessions, claiming satisfaction for themselves, devoid of all compassion. The fifth grade is lacking the mind to establish merit and virtue, delighting only in creating misfortune and calamity. The sixth grade is failing to practice forbearance, constantly deceiving and lying to others, utterly devoid of trustworthiness in myriad ways. The seventh grade is lacking the mind to rescue and relieve those in dire straits, perpetually harboring obstinate attachments, constantly wishing others to fall into evil destinies. The eighth grade is lacking the mind of reverence for scriptures and precepts, constantly slandering and defaming the Heavenly Perfected, entering into heterodox doctrines, harming living beings through sacrifices. The ninth grade is lacking the mind of benefiting others, constantly using wealth and profit to exploit the poor, the orphaned, and the elderly, selfishly enriching their own bodies. The tenth grade is constantly killing and harming boundless sentient beings, indulging in unbridled lust, amassing every evil, wavering in advance and retreat, perpetually acting thus—these may be called the Ten Evils.\n\nSuch actions are neither of Heaven nor of Earth, but arise solely from the mind. Those of supreme virtue and perfected persons take the Ten Goodnesses as their merit, constantly making their own minds the flying heavens’ Hall of Blessings for the ten directions, directly entering the Dharma Wheel as their causal condition. They uphold and maintain sincere deeds, tracing back to the subtlety of their original conduct, thereby attaining the virtue of the fruit-report of the Upper Perfected. Thus, they do not undergo the Ten Sufferings, do not enter the Eight Difficulties, do not encounter afflictions, and do not tread the Three Wretched Paths.\n\nAs for the inferior persons of the lower realms, they constantly make their own minds the office of execution and slaughter, directly seeking the cyclic retributions of hell, turning their backs on the Ten Goodnesses and facing the Ten Evils, practicing the Ten Sufferings. They cast their own bodies into the Eight Difficulties, proceeding to grasp the roots of affliction, their forms treading the gates of the Three Wretched Paths. Daily they sink and drown, enduring eons of endless suffering in the mire and ashes, ever more distant from blessings.\n\nI now open the Dharma Wheel to universally deliver all people.\n\nThe Jade Chapter Hymn of the Supreme Flying Heaven’s Dharma Wheel, Turning the Ten Evils into the Wondrous and Penetrating Upper Grade, proclaims:\n\nLush and resplendent, Jade Clarity,\nSupremely Non-Being, naturally so,\nShading and reflecting the ten directions,\nOpening the ford of the Dharma Wheel,\nDelivering from the Eight Difficulties,\nTurning all blessed heavens,\nRadiant light as crown and sash,\nDissolving the stagnant roots of the womb,\nAccumulated corpses undergo refinement,\nEvil extinguished, the Perfected attained,\nThe Jade Emperor commands and summons,\nThe Ten Goodnesses all restored,\nAll heavens rejoice,\nThe Five Elders attend the dawn,\nThe Thearch holds the tally,\nTogether they escort before the Dao,\nThe great park of the Flying Heavens,\nBoundlessly delivering people,\nKalpa after kalpa receiving transformation,\nConveying the Three Vehicles,\nThe Dharma King’s ranked positions,\nSupreme and Perfected,\nThe Three Primes eliminate evil,\nThe Nine Nights shine brightly,\nBinding the body with heavenly treasures,\nForm ascends to eternal abiding,\nWondrous virtue, lofty and supreme,\nPenetrating and illuminating the Golden Perfected.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: This Jade Chapter is enshrined in the right palace of the Flying Heaven’s Dharma Wheel. In each of the ten directions, ten jade lads and ten jade maidens, each a true guardian, receive the numinous text, constantly accompanying the Dharma Wheel’s upper grade as it turns the realms of the Ten Evils, transporting and delivering the suffering souls of heaven-dwellers and mortals in the cycle of birth and death, ensuring that kalpa after kalpa they undergo transformation, ever in affinity with the Dharma Wheel.\n\nIf heaven-dwellers and mortals know this chapter and perform purification rites, burn incense, and reverently recite it, the Dharma King will descend in truth, and their attainment of the Dao will not be long in coming.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: I open the Dharma Wheel to turn the realms of the Ten Evils. The blessings of the upper grade are boundless in merit. To still the mind and extinguish thoughts—this is the virtue of the highest. To hear music and not hear it, to see floating splendor and beautiful forms—these are the roots of the Ten Evils. The form is not eternally possessed, wealth does not eternally remain; the Dao and the Perfected are supreme. Thus, I open the Dharma Wheel.\n\nIn the world, those who seek the true and abandon the mundane through causal conditions must preserve and secure their original qi, congealing their pure and natural essence. When demons come to oppose, guard your mouth and do not speak, lest evil arise and delusion begin. In the end, they will enter the Dharma Wheel. Those who obstruct the Dao suffer; in later lives, it will be the same.\n\nThe Heavenly Worthy said: The Dharma Wheel opens to deliver the realms of the Ten Sufferings. The first grade is treading the suffering of the Mountain of Knives. The second grade is ascending the suffering of the Tree of Swords. The third grade is entering the suffering of the Cauldron of Boiling Water. The fourth grade is embracing the suffering of the Bronze Pillar. The fifth grade is lying on the suffering of the Iron Bed. The sixth grade is the suffering of the Fire Cart carrying one into the Frigid Pool. The seventh grade is the suffering of having one’s head restrained and tongue pulled out. The eighth grade is the suffering of swallowing fire and eating coals. The ninth grade is the suffering of the Three Officials’ shackles and fetters, penal servitude, and the torment of the golden hammer and iron staff. The tenth grade is the suffering of being shackled in life, afflictions of form and killing.\n\nIn these ten directions, such Ten Sufferings all arise from the causes accumulated in former lives. I observe these sufferings—words cannot describe their misery in the mire and ashes. Thus, I open the Dharma Wheel to universally deliver all heavens, bringing joy to the ten directions, pardoning and absolving them. The Six Paths shine brightly, the Dharma Bridge’s path is open, all rejoice together, and the Dao and the Perfected descend.\n\nThe Jade Chapter Hymn of the Supreme Flying Heaven’s Dharma Wheel, Turning and Delivering the Ten Sufferings, proclaims:\n\nSurveying the ten directions,\nBoundless roots of sin,\nDragged through the Ten Sufferings,\nBodies scorched and rotting,\nGreat and small entangled,\nEons in the mire and ashes,\nToxic blades wound the body,\nSinking into the Nine Nights,\nLonging to return is most difficult,\nOnly then do they think of the Ten Goodnesses,\nReflecting on these causal conditions,\nGrasping the pain and urgency,\nWind and blade come and go,\nSwallowing darkness, consuming poison,\nHun and spirit have no respite,\nGazing upward to the Supreme,\nThe Flying Heaven’s Dharma Wheel,\nOpening to deliver the upper grade,\nTurning all to ascend and be promoted,\nAdorning the body in the Jade Court,\nWondrously penetrating the Ten Heavens,\nThe boundless worlds,\nPenetrating and recognizing all conditions,\nCultivating sincere deeds,\nBowing in reverence before the Dao.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: This Jade Chapter is enshrined in the central palace of the Flying Heaven’s Dharma Wheel. In each of the ten directions, ten cinnabar-spirit lads, each a true guardian, receive the numinous text, constantly accompanying the Dharma Wheel’s upper grade as it turns and delivers the realms of the Ten Sufferings, opening the path to deliver heaven-dwellers and mortals from birth and death, all attaining affinity with the Dharma. If heaven-dwellers and mortals recite this chapter, it ascends to be heard in the Nine Heavens, and the Dharma King commands the Perfected to come and deliver them.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: I open the Dharma Wheel to turn the realms of the Eight Difficulties. The merit of the upper grade encompasses boundless Dharma gates. When a person’s mind is pure, the Ten Goodnesses descend. When one gives rise to the evil of covetous karma, the mind toward things is impure. If others harbor evil, you should make them good. The Three Primes’ enforcers of the law are close at hand within your own body. Secret transgressions are all recorded, reported above to the heavens. The investigating officials swiftly arrive, and one is afflicted with illness and harm.\n\nShould one practice the superior scripture, goodness will naturally follow—let no perverted views be heard, for without affinity, the true form and spirit remain intact. Morning and evening, with reverent heart, the Perfected of the Dao descend to deliver you to the heavens of blessings.\n\nThe Heavenly Worthy said: The Dharma Wheel opens to deliver the realms of the Eight Difficulties. The first grade is reborn beyond the frontier barbarians; the second grade is reborn as a slave or servant; the third grade is reborn as a destitute, lonely, and lowly person; the fourth grade is reborn with the six chronic illnesses; the fifth grade is reborn with foolishness and incomplete faculties; the sixth grade is reborn in shackles, afflicted by the toils of karmic bondage; the seventh grade is reborn into a life of unfilial impiety or bereavement; the eighth grade is reborn in a lawless kingdom. These Eight Difficulties all arise from past deeds and emerge from the Ten Sufferings, only to be reborn within the Eight Difficulties.\n\nYet those of supreme virtue and perfected persons constantly cultivate the Ten Goodnesses in preparation for the future, to be reborn in the boundless halls of blessings across the ten directions. Those who cling to deluded and perverted views invariably take the Ten Evils as their foundation, thus forsaking the Ten Goodnesses. They cycle through birth and death, enduring eons of suffering, forever reborn into the Eight Difficulties to receive their retribution. I now open the Dharma Wheel to deliver such beings.\n\nThe *Jade Chapter Hymn of the Supreme Flying Heaven Dharma Wheel* for the upper grade of the Eight Difficulties proclaims:\n\nBehold the Eight Gates, the Wheel turning the field of sins,\nReceiving all sufferings, where form and soul find no respite.\nWithout prior deeds of sincerity, one’s life ends in the Eight Difficulties,\nCountless gates of transgression, cycling through birth and death.\nThe Ten Evils return again, plunging into darkness,\nReceiving endless sinking and drowning.\nYet the Great Amnesty of the Flying Heaven universally turns the Dharma Wheel,\nThe lofty Eight Visions open the Jade City,\nPalaces of the Seven Treasures, borne on chariots to welcome,\nClouds of radiance illuminating the great courts of the ten directions.\nA golden countenance of unmatched beauty, twin lights spontaneously arising,\nUrging dragons and riding phoenixes, they roam the Jade Capital.\nJeweled forests arrayed, light shining from within the body,\nThe Three Fetters dissolve, the Eight Difficulties simultaneously resolved.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: This Jade Chapter is enshrined upon the right Mystery Terrace of the Flying Heaven Dharma Wheel. The Jade Lads and Jade Maidens of the ten directions, each bearing the *Ten Perfected Treasured Writ of Reward*, constantly follow the upper-grade Dharma Wheel, reciting this chapter to turn and deliver the realms of the Eight Difficulties, gladdening the souls of heaven-dwellers and mortals in the cycle of birth and death, that all may attain radiance and universally perceive the affinity of the Dharma.\n\nIf heaven-dwellers and mortals know this chapter and recite it with sincerity, they will deliver both the living and the dead from lingering suffering. The heavens will descend, and the destinies of their lives and deaths will be transferred to the halls of eternal blessings.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: I open the Dharma Wheel to turn the realms of the Three Evil Paths. The blessings of the upper grade are boundless, and all beings are enabled to be delivered to the halls of blessings across the ten directions, transforming to be reborn in heaven. These profound evils arise from past lives, where countless beings were harmed, leading to rebirth in those paths as retribution for former causes. Cycling through birth and death, the karmic consequences of their deeds now turn all bodies to universally enter the roots of goodness. Through self-awakening, they are reborn, and all karmic conditions of birth and death receive grace, none failing to rejoice.\n\nThe Heavenly Worthy said: The Dharma Wheel opens to deliver the realms of the Three Evil Paths. The first grade is the hells of dark confinement and scorching torment; the second grade is the hungry ghosts who devour one another in the suffering of affliction; the third grade is the beasts who strike one another in mutual enmity and poison. Such beings, if they reverse their ways, are reborn into the Three Evil Paths: the first grade as insects, the second as crows, and the third as beasts. The deeds of their past lives were fundamentally rebellious, their sins heavy, thus incurring such evils. Gathering over eons, they receive this retribution. I now open the boundless Dharma Wheel of the upper grade to universally deliver these evils and return them to the gates of blessings.\n\nThe *Jade Chapter Hymn of the Supreme Flying Heaven Dharma Wheel* for the upper grade of the Three Evil Paths proclaims:\n\nSurveying the ten directions within,\nThe boundless worlds of men—\nThe powerful and noble fear no transgression,\nIndulging in the slaughter of beings.\nThey raise armies to rebel against rulers,\nHeedless of future retribution.\nWhen sins fill the Nine Rivers,\nTheir forms tread the courts of Knife Mountain.\nHands brushing the Sword Trees,\nBlood flows like falling stars.\nSeated to await boiling in cauldrons,\nIron awls piercing their bodies.\nTurning, they enter the realm of hungry ghosts,\nHearing only wails of sorrow.\nHeads raised to see the iron net,\nFeet standing in the courtyard of flowing fire.\nBeasts tearing at one another,\nRetribution for past lives.\nYet behold the Ten Blessed Heavens,\nRiding the light, bearing the full moon.\nRoaming beyond the Three Realms,\nOnly then do they recall the scriptures of the Three Treasures.\nThe Dharma King’s myriad good deeds\nUniversally open boundless merit.\nTurning to deliver the Three Evil Paths,\nThey undergo refinement as the Ten Heavenly Immortals.\nBodies emitting five-colored light,\nAwakening to the wondrous causes of all evils.\nIn one leap, they transcend the Three Paths,\nDwelling leisurely in the Ten Flying Heavens.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: This Jade Chapter is enshrined within the Jade City of the upper-grade Flying Heaven Dharma Wheel. The Jade Lads and Jade Maidens of the Dharma Wheels of the ten directions, each bearing the *Ten Perfected Treasured Writ of Reward*, constantly follow the supreme upper-grade Dharma Wheel, reciting this chapter to turn and deliver the realms of the Three Evil Paths of suffering, refining the stagnant corpses and suffering bones, that all may attain radiance and universally ascend to the halls of blessings in the Ten Heavens. If heaven-dwellers and mortals know this chapter and recite it with sincerity on the day their lives end, their souls will not pass through the Three Evil Paths but will directly ascend to the Dharma Wheel of the ten directions, entering its ranks.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: I open the Dharma Wheel to turn the realms of the Ten Deviant and Unorthodox Paths, the practices of the upper grade. Beings, insatiable in their myriad desires, cast their bodies and lives into the Ten Evils, entangling their forms in suffering and self-inflicting the punishments of their transgressions. Their offenses fill heaven and earth, their names and forms becoming paths, falsely generating unrighteousness, licentiousness, and deviant qi. Born without virtuous teachings, they inevitably face severe judgment in death, their bodies enduring eons of dismemberment, cycling through birth and death, forever dwelling in blind paths. Their lives end in perverse speech, illness, and suffering, ultimately returning to the Eight Gates. I now open the Dharma gates to universally turn them back to the Perfected of the Dao.\n\nThe Heavenly Worthy spoke: When the Dharma Wheel opens to deliver the beings in the realms of the Ten Deviant and Evil Paths, those of the first grade turn their backs on the true and enter the ghostly path, their entire lives born into perverse demonic influences, forever afflicted by manifold illnesses and sufferings, receiving retribution without end. Those of the second grade lightly defile the Dao and its Dharma, entering deviant paths, believing and following perverse speech, slandering the Dao and deceiving their masters. Those of the third grade do not believe in the true Dao, casting aside their bodies to become ghostly specters. Those of the fourth grade, deluded by ignorance and inverted views, beings constantly harbor the Five Turbidities, clinging to demonic influences, falsely claiming sacred names to disrupt the true Dao. Those of the fifth grade constantly engage in killing and harming, offering licentious sacrifices to ghosts and demons, fraudulently claiming to be divine and true, gluttonously craving rich flavors, committing boundless transgressions. Those of the sixth grade exploit others’ fortunes and misfortunes, falsely claiming to be true deities, making demands of heavenly and mortal beings, insatiably receiving and devouring without restraint. Those of the seventh grade, demonically possessed beings roaming the world, sometimes singing perverse songs or speaking ghostly tongues, falsely claiming to be Dao deities, lying in wait for others’ misfortunes to recklessly speak of divination and omens. Those of the eighth grade, beings who encounter the Dharma yet cling to deviant views, wholeheartedly turn their backs on the true to embrace the false, serving the forms and images of ghosts and spirits, following the ways of shamans and sorcerers. Those of the ninth grade engage in licentious acts with clan kin, harboring perverse and suffering thoughts, practicing unorthodox Dharma. Those of the tenth grade abandon the true Dharma, entering demonic paths and deviant ways, colluding to deceive and lure heavenly and mortal beings, falsely claiming to be sages and saints, indulging in lawless debauchery, concealing their perverse and rebellious acts, cursing and swearing at others, casting hexes and praying to harm kings, pointing to heaven and drawing on earth, killing and harming beings, making no distinction between true and false, yet claiming to be heavenly and true. Such beings bring upon themselves the Ten Sufferings and Eight Calamities, accumulating causes for evil, born amidst afflictions, mired in the Nine Dark Realms, enduring punishments without end.\n\nI now open the boundless mercy of the Flying Heaven, universally liberating all karmic causes of birth and death, enabling all to escape the roots of the Ten Deviant and Evil Paths, universally ascending the Ten Directions, eternally abiding in the Heaven of Blessings, their bodies receiving majestic radiance, forever transcending the Dharma Wheel.\n\nThe Jade Hymn of the Supreme Flying Heaven Dharma Wheel Turning the Ten Deviant and Evil Paths, Upper Grade, proclaims:\n\nVast and distant, the Flying Heaven’s hall,\nResplendent and radiant, illuminating the Supreme Clarity.\nThe King of Scenery descends in a precious chariot,\nGuiding the ten Dharma realms.\nYet all see the deviant paths,\nPlunging into hell’s abyss.\nMolten bronze poured into mouths,\nNaked bodies upon sword-tree peaks.\nGiant heavenly flying blades sever,\nIron awls pierce hearts and livers.\nHungry, they feast on flowing fire’s essence,\nBearing stones, they tread upon knife mountains.\nNo sight of blessed joy,\nOnly the cries of torment and filth.\nGazing upward at the Ten True Paths,\nTheir forms radiant with perfect clarity.\nSeated serenely within jeweled groves,\nWondrous marks naturally arise.\nOn high, the Dharma Wheel turns,\nUniversally delivering all deviant forms.\nOpening the ford of the Five Paths’ realms,\nTranscending to the Southern Mound’s court.\nTheir bodies refine in the Jade Pool,\nPrecious radiance born within.\nSoaring through the Great Void,\nThrice circling to venerate the true scriptures.\n\nThe Heavenly Worthy addressed the Dao Lord: This Jade Hymn is enshrined in the Flying Heaven’s Cloud Radiance Upper Palace of the Ten Directions. Ten Perfected Youths and Jade Maidens of each direction guard and reward the numinous text, constantly following the Dharma Wheel’s turning to recite this hymn, delivering the beings in the realms of the Ten Deviant Paths, thereby dissolving the accumulated sufferings of heavenly and mortal beings, universally guiding them into the Dharma gates. If heavenly and mortal beings know this hymn, contemplating the sufferings of life and death, fasting and reciting it, their suffering souls shall immediately transcend to the divine realms of the Ten Directions.\n\nThe Heavenly Worthy addressed the Dao Lord: I now open the Dharma Wheel of the Ten True Paths’ realms, the foremost of the upper grade’s fundamental practices. Though the profound is made manifest, it is by the power of karma. Yet to clarify the true is exceedingly difficult; beings do not purely receive the teachings, and those who concentrate their essence to attain the mysterious symbols of the supreme Dao are rare. Those who harmonize with the Dao and respond to the true—its principle is subtle and refined, verily called natural. Once in ninety thousand kalpas it descends; ponder this deeply. I now open the true treasure, turning the Dharma Wheel, so that kalpic disasters remain unmoved and heaven and earth endure.\n\nThe Heavenly Worthy spoke: When the Dharma Wheel opens the realms of the Ten True Paths, those of the first grade distance themselves from evil and depart from deviant ways, observing and practicing non-action, establishing blessed causes, maintaining a luminous and resolute mind, refraining from hidden malice. Those of the second grade seek the true and pursue the Dao, believing in and turning toward the great scriptures, upholding precepts and entering the Dharma, universally practicing hidden virtues. Those of the third grade are neither deviant nor false, constantly practicing the true Dharma, wholeheartedly guarding the Dao. Those of the fourth grade cherish and care for all beings, constantly attaining peace and abiding together within the Dharma Wheel. Those of the fifth grade compassionately regard the myriad things, revering the king, universally flourishing the heavens, broadly propagating the Three Treasures. Those of the sixth grade cultivate and study the supreme Dao, relinquishing the body and abandoning the world, utterly without false thoughts or stagnant delusions. Those of the seventh grade arise and act in accordance with precepts, their words devoid of falsehood. Those of the eighth grade guide heavenly and mortal beings, flowing and spreading the Dharma’s sound, broadly proclaiming the Dao’s teachings, infinitely expanding them. Those of the ninth grade universally rectify the myriad models, broadly propagating the Ten Directions, compassionately benefiting all. Those of the tenth grade, as the Dharma Wheel opens and expands, universally deliver heavenly and mortal beings, all rejoicing together, entering the true path, their minds resolute and luminous.\n\nSuch are the upper grades of the Ten True Paths, which only those of the highest virtue and utmost personhood can practice. I now open the boundless Dharma gates of the Ten Directions, universally and impartially delivering all. Once entering the true path, deviance daily recedes, the supreme truth of the Dao unmatched. Those who form affinities with the Dharma, thus it is.\n\nThe Jade Hymn of the Supreme Flying Heaven Dharma Wheel Opening the Ten True Paths, Upper Grade, proclaims:\n\nWithin the purple void’s surging mist,\nThere stands a mysterious terrace.\nFlowing radiance and jade towers,\nSeven treasures naturally arise.\nResplendent and radiant in the Ten Directions,\nPervading and covering all heavens.\nThe supreme Dharma Wheel,\nTurns to deliver the Ten Directions.\nThe true path clearly opens,\nThe Primordial Sovereign’s mandate aligns.\nThe Flying Heaven’s perfected,\nFloat in the void, extolling goodness.\nJade Thearchs attend their forms,\nGolden youths to left and right.\nSurveying all conditions,\nThe great workings of mysterious transformation,\nAll equal before the true Dao.\n\nThe Heavenly Worthy addressed the Dao Lord: This Jade Hymn is enshrined in the Supreme Golden Perfection Mysterious Palace. Ten Golden Youths and Mystic Maidens of each direction guard and reward the numinous text, constantly following the great turning of the Ten Directions’ true Dharma Wheel, reciting this hymn, its sound pervading the Ten Directions. The Primordial Sovereign of the Nine Heavens clasps hands in celebration, the Supreme Jade Thearch bows in reverence. Thus is the Great Radiance Dharma Gate, delivering all heavens, the boundless worlds, and the myriad multitudes of all beings, enabling all to ascend the Blessed Hall of the Ten True Paths, universally harmonizing with the true Dao.\n\nThe great sages and perfected beings of all heavens who know this hymn, perform purification rites and recite it, may all deliver beings from manifold sufferings, and also preserve the kalpa from disruption, firmly securing their numinous root.\n\nThe Heavenly Worthy addressed the Dao Lord: In my turning of the Dharma Wheel through ten revolutions across all realms, the supreme and boundless foundation of the perfected beings’ original karma cannot be set in motion without the Dharma Wheel. Those who preserve truth and uphold the Dao, awaiting this assembly—from the beginning of this kalpa to the present—all who attain the Dao enter the Dharma Gate, cultivate and study the highest virtue, and ascend to the rank of the utmost perfected. Never have I seen one who, clinging to ease and arrogantly guarding wealth, yet hopes to be reborn in heaven.\n\nI observe that beings throughout the Ten Directions are deeply entangled in attachments. Though wealth and treasures are esteemed, they ultimately cannot enable one to attain the Dao. Hoarding precious treasures will surely bring lingering misfortune, while embracing poverty and delighting in the Dao—this is the true treasure. On the day the Dao is accomplished, the Lord of the Dao will manifest signs.\n\nClad in a nine-rayed treasure mantle and a seven-hued flying silk skirt, wearing a Heaven-piercing treasure crown upon the head and jade-embroidered lion slippers upon the feet, with twin flames of celestial light upon the neck, a canopy of flowing luminous treasure above, ascending a seven-jeweled palanquin, riding a golden dragon—thus do they transcend the supreme Dao realms. Resplendent in feathered regalia, their majestic radiance and fragrant adornments pervade the void. With heavenly perfected ones to left and right, they grasp the Ten Absolute Spirit Banners. All heavens offer up spontaneous celestial music, burning incense and scattering flowers, suffusing the Ten Directions. The host of perfected beings descends to welcome the signs, receiving the rank of Heavenly Treasure in the Jade Clarity Realm, eternally abiding in Golden Perfection.\n\nAt that time, true joy is theirs. Such persons are those who embraced poverty and upheld the Dao, thereby attaining this state. How could the fleeting glory of worldly prosperity be worth coveting?\n\nThose who serve the ten evils shall see their wealth scatter—even vast fortunes of hundreds of millions become but a gateway to poison.\n\nI now turn the Wheel of the Dharma, proclaiming to the ten directions. Flying immortals and perfected beings open the path to salvation across the ten directions, in boundless worlds, for all sentient beings, that they may perfect the merit of the Tenfold Cyclic Fast and attain the rank of True Persons of the Tenth Transformation.\n\nThe Heavenly Worthy declares: When the Wheel of the Dharma opens the realms of the Tenfold Cyclic Perfected, those who receive and uphold the precepts in the first rank become Earth Immortals. Those who cultivate the precepts and practices, advancing to the second rank, become Wandering Immortals. Those who double their resolve and rectify their minds, advancing to the third rank, become Immortals. Those who uphold the precepts and their karmic duties, advancing to the fourth rank, become Flying Immortals. Those who constantly follow the scriptures and precepts, transgressing no conduct, advancing to the fifth rank, become Spirit Immortals. Those who abstain from gluttony, maintain perpetual fasting, and steadfastly uphold the precepts, advancing to the sixth rank, become Divine Immortals. Those who renounce sensual desire, practice equanimity in all meritorious deeds, and embrace purity with an unclinging heart, advancing to the seventh rank, become True Immortals. Those who set their minds on broadly contemplating the ten directions, constantly aiding those in distress, speak no wrongful words, and relieve beings without partiality, advancing to the eighth rank, become Flying Heavenly True Persons. Those who guard the One without wavering, perform myriad good deeds, revere the precepts as if facing the gods, advancing to the ninth rank, become Supreme True Persons. Those who perpetually consume the radiance and drink the qi, endure austerities in Daoist cultivation, recite scriptures and burn incense, enlighten the ten directions, universally save boundless beings, and bestow blessings upon heaven and earth without weariness, advancing to the tenth rank, become Supreme Shangqing True Persons.\n\nAll things are inherently without intent; those who practice the Eight Precepts may yet achieve the merit of the flying immortals of the ten directions—how much more so those who uphold the Ten Precepts and their fundamental practices! Yet in this final kalpa, beings only break the precepts; who among them can truly cultivate? Mortals, steeped in the Five Turbidities, commit countless coarse deeds. When they receive and uphold the precepts, they treat them as lifelong treasures, while the coarse-minded seize them in hopes of worldly exaltation. They destroy the practice of the Ten Good Deeds, turning instead to the path of the Ten Evils. It is not the Dao that fails humanity, but humanity that fails the Dao. Never has one with true intent sought and not attained.\n\nThe *Jade Hymn of the Supreme Golden Perfection Wheel of the Tenfold Cyclic Upper Rank* proclaims:\n\nThe Great Garden unfolds transformation,\nAbove lies a jeweled city,\nGoverned by the Mysterious Void,\nIllumined by the Primal Unity.\nJade trees of the eight directions,\nSeven treasures arrayed in birth,\nSpirit winds attune to the seasons,\nAll sounds harmonize in voice.\nWithin stands the Wheel of the Dharma,\nCalled the Dharma King,\nCherished by the Most High,\nExalted by the Jade Emperor.\nGolden Perfection’s wondrous virtue\nDescends with the flying immortals,\nSurveying the ten directions,\nCountless karmic causes of sin.\nTransforming the upper ranks,\nDelivering from all苦缘,\nThe body escapes the ten evils,\nEnters the Dharma gate,\nThe form eludes the blade’s edge,\nJoyfully attains True Immortality.\nTenfold cyclic, supreme,\nWondrously penetrating the natural,\nIn the realms of the Perfected,\nEternally abiding in the Dao’s truth.\n\nThe *Jade Hymn of the Supreme Golden Perfection Precepts and Practices, Surveying the Ten Directions and Penetrating the Mysteries* proclaims:\n\nRoaming the heavens,\nWithin lie the Three Nets,\nIron webs in eightfold array,\nFlaming chariots and flying blades,\nScourging whips and lashes,\nMyriad pains conjoined.\nHeads split asunder,\nWoe! Self-inflicted wounds.\nOne birth, one death,\nRevolving in evil realms,\nTears and blood flowing,\nNo longer human in form.\nMired in suffering for kalpas,\nUnknowing of life’s root,\nLives face one another,\nEntangled in myriad ways.\nThe Ten Good Deeds, serene and still,\nDesolate the ten heavens.\nClothed in the layered Non-Action,\nThey save the hopeless.\nGolden Perfection opens the Dharma,\nUniversally radiating majestic light,\nFlowing through heaven and earth,\nIllumining the ten directions.\nExpounding sincerity to deliver beings,\nThe power of karmic merit is vast.\nThe ten sufferings dissolve,\nBathed in the golden countenance.\nAwakening to the fundamental practice,\nThe Three Nets part and clear.\nAdvancing in the supreme ranks,\nThe body ascends to the jeweled palace,\nTo pay homage to the Lord of the Dao,\nBowing thrice in reverence.\n\nThe *Jade Hymn of the Supreme Golden Perfection Precepts, Practices, and Fundamental Conduct of the Upper Rank* proclaims:\n\nClouds luminous and lush,\nRadiant across the ten directions,\nGolden dawn’s glow arises,\nShading the jade halls.\nSeven treasures congeal,\nEight assemblies purify the spirit,\nThe Mysterious covers the Three Images,\nNaturally limpid and clear.\nHeavenly light shines brightly,\nUniversally illuminating all forms.\nThe Primal Beginning’s myriad practices,\nTake the precepts and deeds as their foundation.\nGrasping the Wheel of the Dharma,\nVastly transforming all merits,\nBoundless fundamental conduct,\nMyriad models of karmic conditions.\nThe Perfected universally named,\nThe spiritual root of all dharmas.\nRiding the void, treading the empty,\nCommuning with the ford.\nThe Primal August’s supreme treasure,\nThus establishes the Wheel of the Dharma.\nOpening the Dao of the Three Realms,\nMounting the purple mist,\nFeathered canopies draped in cover,\nAscending to meet the Heavenly Worthy.\n\nThe Heavenly Worthy addressed the Lord of the Dao, saying: These three jade hymns are enshrined in the Supreme Great Possession’s Jade Capital. The twelve thousand Perfected Guardians of the Supreme Golden Perfection Youths eternally follow the kalpic revolutions, turning the Wheel of the Tenfold Cyclic True Persons of the Upper Rank across the ten directions of all heavens.\n\nWherever these hymns are recited, their numinous tones resound with clarity. In the boundless worlds of the ten directions, the exalted perfected of all heavens simultaneously perform obeisance. The Supreme Perfected praise their excellence. The Dharma King proclaims the opening of the Dharma gates, bestowing ranks to deliver myriad beings, that all may attain the truth of the Dao.\n\nIf the great sages and perfected beings of all heavens know these hymns and recite them with fasting, the perfected of the ten directions will descend, paying homage six times daily. Myriad karmic obstructions dissolve, and soon the Dao is perfected.\n\nThe Heavenly Worthy addressed the Lord of the Dao, saying: I now open the Supreme Golden Perfection Wheel of the Dharma, the fundamental practices of the precepts, and the twelve boundless upper-rank karmic conditions. Revolving through the wondrously penetrating realms of the Perfected, this scripture’s supreme merit is universally efficacious. As the Wheel of the Dharma, it pours the consecrated waters upon the abysses of beings, turning across the ten directions to open salvation for boundless beings mired in sin, guiding them into the fields of blessings.\n\nThe precepts and practices of Golden Perfection ensure eternal abiding. Their Dao is lofty and wondrous, universally saving without end. The supreme treasure of the flying immortals is not transmitted to ordinary immortals. It naturally responds to the kalpic revolutions, its text resplendently luminous, universally efficacious.\n\nThe revolutions of Heaven and Earth all proceed through the Wheel of the Dharma; its merit is supreme, and none but those of utmost virtue and perfected persons may uphold it. The exalted sages ascend in rank to become lofty Perfected Ones, all through its scripture. The myriad evils turn to goodness, obstructions dissolve, suffering is uprooted, sins are eradicated, and blessings descend—all through this sutra. It broadly saves the ten directions, propagates the teachings across the heavens; its virtue is greatly penetrating, its Dao universally true. It drives the three vehicles to ferry boundless beings. I expound this sutra to entrust you with its observance. Once in nine kalpas it descends to the Jade Court of the Flying Immortals, where beings are opened and delivered according to their ranks—this is no difficult task.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: I open the supreme Wheel of the Flying Immortals’ upper-rank realms to counter the five turbid kalpas. The first rank: the ten directions’ boundless worlds beset by calamities of war, slaughter, and turbidity. The second rank: the kalpic cycle shortened, the sun and moon waning and waxing in turbidity. The third rank: yin and yang in inversion and disorder, the stellar lodges losing their degrees, the myriad things failing to grow in turbidity. The fourth rank: the five directions’ demonic armies converging, slaughtering and harming boundless heavenly and human beings in turbidity of life and death. The fifth rank: the governance of nations in chaos, heavenly and human beings in turmoil, weapons and afflictions in turbidity.\n\nWhen you witness these five turbid ages, you should rightly rely on the ranks of the Wheel of the Dharma to open, deliver, and revolve, securing and stabilizing the myriad ranks. Thus shall Heaven and Earth, the sun and moon, and the stellar lodges each return to their proper positions, pacifying and settling the myriad nations, all of which shall abide.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: I open the supreme Wheel of the Flying Immortals’ upper-rank realms to counter the three calamitous kalpas, delivering the ten directions’ boundless worlds and myriad beings, all of whom shall be spared from kalpic tribulations. Thus do I employ the three vehicles’ treasure store to ferry them. The first rank: the kalpic fire flowing through the Three Realms. The second rank: the deluge surging and overflowing, the eight poles merging into one, waves surging to the heavens. The third rank: the violent winds raging for kalpas, shattering and piercing the heavens, the ten directions sinking, not one spared.\n\nThese are the great revolutions responding to the kalpic cycles, called the Three Calamities. At such times, you must diligently apply your mind to turn the Wheel of the Dharma, opening the three vehicles’ upper ranks to deliver heavenly and human beings from calamity, ensuring all abide in peace and behold the Great Perfected.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: The six dusts of concealment and manifestation, the mysterious roots touched by sight and hearing, the demonic qi of forms and colors, the emptiness arising in listeners—cloud gates at dawn and dusk, evening veils upon body and mind, the failure to preserve thoughts of things—these are the most bitter harbingers of misfortune. The divine youths who know remain unmoved; those evils harm themselves. What is not of the Dharma is practiced, deceit and cunning alike. A single abandonment of the myriad virtues is irrecoverable for a lifetime. Harming one repays tenfold; for ten thousand kalpas, there is no rebirth. To kill with the hand or with thought—how much more so to take a life? The upper-rank precepts and karmic practices of Golden Perfection must be rightly followed. The ten thousand praises all arise from conduct as their foundation.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: To turn the Wheel of the Dharma and open the upper ranks for deliverance, one must use ten golden dragons, each weighing one tael, to stabilize the ten directions. The patterned silks should correspond to each direction: nine feet of azure-patterned silk for the east, three feet of crimson-patterned silk for the south, seven feet of white-patterned silk for the west, five feet of black-patterned silk for the north, eight feet of purple-patterned silk for each of the four corners, twelve feet of blue-patterned silk for the upper direction, and fourteen feet of yellow-patterned silk for the lower direction. Ten incense tables and ten incense burners are placed in the ten directions.\n\nThe altar is constructed according to the Three Primes’ method of smearing ashes. The rites of repentance and thanksgiving follow the Three Primes’ method for removing sins. Lamps are lit in three tiers: ten lamps on each side of the outer altar, eight lamps on each side of the middle altar, and nine lamps on each side of the upper altar, all according to the ritual ranks. The Three Treasures stabilize the altar. For three days and three nights, the Dharma assembly burns incense, recites the sutra, confesses and repents, and turns the Wheel of the Flying Immortals’ luminous statutes to open and deliver the ten directions’ myriad beings from the roots of sin, obstructions, and suffering. The ten evils and all realms are thus enabled to advance into the ten directions’ Flying Immortals’ boundless halls of blessings.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: When heavenly and human beings cultivate the supreme Dao and the Way of Perfection, they may rely on this Dharma to establish and practice it. This Dharma opens and delivers the ten directions’ vast and obscure suffering souls in the cycle of life and death, as well as the sins of ancestors, all of whom shall be turned and delivered to the halls of the ten blessings. When you witness the revolutions of Heaven and Earth, you should establish this great merit. When you witness the sun and moon waning and waxing, you should perform this fast. When the stellar lodges lose their degrees, you should perform this fast. When the lands of the heavens and nations are unsettled, you should perform this fast. When demonic armies arise in the world, myriad deaths occur, and yin and yang are disharmonious, you should perform this fast. When master and disciple face crises or the day of passing, you should perform this fast.\n\nThis upper-rank fast of the Wheel of the Dharma’s merit is boundless. All who attain the Dao in the ten directions do so through it, thereby reaching the realms of the utmost Perfected. The exalted sages who cultivate this merit ascend in rank to become Golden Perfected. The heavens’ Perfected Ones who establish this fast naturally open and deliver the myriad beings, universally propagating the Dharma gate. The causes and conditions of life and death all proceed through the Wheel of the Dharma. Its Dharma is lofty and wondrous, treasured beyond all else. Once in nine kalpas it revolves, illuminating Heaven and Earth. The boundless cycles of life and death all attain blessings and felicity, their light shining across the ten directions, universally abiding in perpetuity.\n\nWhen heavenly and human beings of utmost virtue and perfected persons know this Dharma, receive, uphold, and propagate its gate of transformation, and cultivate this merit, they shall surely accomplish the Dao and attain Perfection.\n\nThe Heavenly Worthy said: The upper-rank Wheel of the Dharma carries the ten directions, the supreme, utmost Perfected, wondrous Dharma of precepts and practices. It universally gathers the boundless, awakens all to the mysterious, and perceives the boundless foundational practices and the myriad karmic conditions. It penetrates and observes Heaven and Earth, universally entering the Dharma gate. Those whose karmic and bodily actions are evil, sinking into the nine nights—when I turn the Wheel of the Dharma, all shall attain immortality. Beings reverse their transformations to be reborn in the heavens and among humans. The Wheel of the Dharma revolves the Dao; once in ninety thousand kalpas it is transmitted. None but the exalted companions of the Jade Emperor may descend as Perfected Ones. I now tell you this, sealing it in the Central Palace. Receive and uphold it faithfully. When kalpic calamities approach, rely on the upper-rank Dharma to turn and deliver the heavens, the ten directions’ boundless worlds, and all myriad beings, all of whom shall share in the Dharma’s conditions, universally beholding the great light that opens the revolutions, awakening and perceiving the Perfected Dao.\n\nIts merit broadly illuminates, magnifying the Dao of the Three Vehicles—the Mother of all dharmas, the Most Perfect and Exalted—universally serving as the radiance and reflection of the ten directions, the宗 of all the myriad Dao of heaven and earth. Its blessings are supreme, abiding in serene constancy; when the great kalpa descends, all shall behold the Perfected Dao, universally delivering beings, all of whom ascend to the ten directions, eternally dwelling in the Heaven of Blessings.\n\nYou, who receive the supreme position of Dharma King, must apply your mind with diligence.\n\nThereupon, the Dao Lord arose, clasped his hands in reverence, and received the Golden Perfected Dharma Wheel’s *Precepts of Karmic and Bodily Actions, Upper Rank*. When the affair was concluded, the Primordial Heavenly Worthy commanded the assembly of great sages to harness their chariots and depart; the hosts of heaven returned to their positions, enduring for a hundred million kalpas.\n\nThe Dao declared: I receive the supreme *Golden Perfected Dharma Wheel’s Precepts of Karmic and Bodily Actions, Upper Rank*, eternally abiding in the highest grade, boundless in karmic conditions. Since the dawn of the kalpic beginning, when the Wheel was set in motion, I have delivered the boundless worlds of the ten directions and the measureless, innumerable beings—suffering souls in the cycle of birth and death—reversing the ten evils, extracting the roots of all sins, untying the nets and freeing the obstructed, liberating them from the fields of affliction. All alike proceed to the Jade Pool to refine their forms, donning jeweled robes and luminous crowns, dwelling in the Hall of Ten Abodes of Blessing. Its merit turns with the revolutions; none but those of profound awakening may descend to it. The texts of the ancient canon, the *Ten Thousand Dao of Power*, are now complete. The Dao shall proceed forth, its morning radiance gathering in eight assemblies—this shall be the time when cloud-brightness descends to preserve against kalpic calamities. The lands of blessed virtue shall first attain the Perfected Dao.\n\nThus concludes the *Supreme Wondrous Scripture of the Upper Rank Precepts of Karmic and Bodily Actions from the Numinous Treasure of the Highest Cavern-Mystery*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝诫业本行上品妙经 经名：太上洞玄灵宝诫业本行上品妙经。 撰人不详，约出於南北朝或隋唐。 劝人修行无上金真诚业。 一卷。 底本出处：《正统道藏》洞玄部本文类。 太上洞玄灵宝诫业本行上品妙经 道言：昔我於洞明丹陵天中玉台，受元一金真法轮诫业本行因缘上品，与我无上高上洞明大法王之号，常镇玉清高上大囿都开飞天。 法轮上本诫业之功，开度万有生死之场，天人罪福诸源，运载三乘，登步上清，十转真人，光明幽夜，弘广十方，回十恶之根，使从十善而行，咸得径生无量大囿天堂，有能从者，克获道真。 道言：我常随运降下十方飞天元生大福堂洞明宝庭，开是法轮，十善法门，咸使十恶从法而迁，从是法轮转升上天，悉得妙通，广明本行。 宿业因缘，吾观天地，希有其人，自非上德，何能奉焉。 道言：诫业至行，惟上德弘远，金真本行，长存之源，善当正念，魔无敢言，断诸惑乱，诸天朝真，彼诸生恶，尔勿从之，斯罪根深，会当入吾法轮，彼之起祸，莫与之争，堕身三恶，望反甚艰，障道者无明，嫉人者自刑，谤人者始从畜生道中出也，乐淫色者，由之先业六畜根未断矣，贪狠者自伤，贪味者吞毒，斯酷之本，善当远之乎。 道言：元一天尊当说是诫业本行之时，天尊以手指点十方虚空之中，命召十方飞天帝王，至真皇人，飞天无极神王，妙行真人，高上玉皇，无极大圣尊神，三十六天上帝，诸天至真，九宫真人，五老上真，天真地仙，无极世界神仙玉女，无量大圣众，三界灵官，三元正真执法官属，无鞅之众，一时同驾，乘空而来，上诣玉都天光四朗紫盖回天，威灵济济，流激十方，敷明诸天，烧香散华，飞玄步虚，三匝复位，稽首朝真，同登金真法轮诸场，仰观法音，莫不欢悦，咸同称善。 道言：无上金真诚业，普隆万囿诚行之本，万无其人，天理妙旨，上真行焉。 但十方天人，空生祸府，造立万端，通恶所释，诀在乎心，开建道场，普转法轮，光明六道，开度天人，孤魂苦爽，同登福天，终身欢乐，劫劫长存，自斯以往，皆由法轮，上品之恩。 尔时诸天大圣无鞅之众，同时称善，左回三匝，叉手作礼，伏受诫言。 天尊告诸天圣众曰：吾开金真法轮，运化诸因，有诸难得，惟形是难。 夫至德身，亦为一国之域，利用招祸，心之能造，故通制包藏之境，由善恶之门，惟有至人知觉，得道无为，若能从之，谛受勿忘。 天尊告诸天圣众曰：元气轻微，运导不淳，本业易造，动至亡身，五心所起，十恶生焉，长沦毒刃，莫能觉乎，自受痛哉。 吾为十方天人转度生死之源，十善备立，悟其来生一切因缘，伏承诫业，即得道真。 天尊告道君曰：吾开法轮上品，金真诫业，十善正本，万行之门，尔若从之，咸当伏听。 於是道君稽手作礼，伏受诚文。 诚曰：一品正观众妙本，皆得神通业。 二品正听玄妙音，神通知十方。 三品正知香光入，神通灵气存。 四品正音开妙门，神通利益无量果。 五品正存法诫行，神通道真降。 六品正念众生苦，神通光明报。 七品正想无二惑，神通正道界。 八品正行大慈业，神通无上真。 九品正定形影，不动众行，神通妙觉。 十品正具形神，刚明执正，神通玄妙。",
      "translated_text": "**The Supreme Cavernous Mystery Numinous Treasure Scripture on the Precepts of Karmic Origins and Fundamental Practices, Upper Grade**\n\n**Scripture Title:** *The Supreme Cavernous Mystery Numinous Treasure Scripture on the Precepts of Karmic Origins and Fundamental Practices, Upper Grade*. Author unknown, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. Exhorts cultivation of the supreme Golden Perfection and sincere karma. One scroll.\n\n**Source:** *Daoist Canon of the Orthodox Unity*, Cavernous Mystery Section, Textual Category.\n\n---\n\nThe Dao spoke: In former times, upon the Jade Terrace within the Cavern of Luminous Cinnabar Heavens, I received the supreme grade of the Wheel of the Golden Perfection’s Precepts of Karmic Origins and Fundamental Practices. Thereby was I bestowed the title of Supreme Highest Cavernous Luminous Great Dharma King, ever presiding over the Great Enclosure of the Jade Clarity’s Highest Heaven, where the Flying Celestials gather.\n\nThe merit of the Wheel’s original precepts of karma unfolds the realm of the myriad existences’ birth and death, the roots of heavenly and human transgressions and blessings. It conveys the Three Vehicles, ascending to the Upper Clarity, where the Tenfold Perfected attain transcendence. Its radiance illumines the darkest nights, vast and boundless across the ten directions. It severs the roots of the ten evils, guiding all to practice the ten virtues, that they may swiftly ascend to the Heaven of Immeasurable Great Enclosure. Those who follow shall attain the Perfection of the Dao.\n\nThe Dao spoke: I ever descend with the turning of the kalpas to the Great Hall of Primordial Life and Blessing in the Flying Heavens of the ten directions, within the Cavern of Luminous Treasure Courts. There I unfold this Wheel of Dharma, the ten gates of virtue, causing all ten evils to transform by the Law. Through this Wheel’s turning, they ascend to the heavens, all attaining wondrous communion and the vast illumination of fundamental practices.\n\nBy the karmic conditions of past lives, I observe heaven and earth, yet few indeed are those who, lacking supreme virtue, can uphold this teaching.\n\nThe Dao spoke: The precepts of karma and the highest practices belong to the far-reaching virtue of the exalted. The fundamental practices of the Golden Perfection are the enduring source. When virtue aligns with right mindfulness, demons dare not speak. Sever all delusions and confusions, and the myriad heavens shall pay homage to the Perfected. As for those who generate evil, do not follow them. Their roots of sin run deep. Should they enter my Wheel of Dharma, the calamities they provoke—do not contend with them. To fall into the Three Evil Realms is to find return most arduous. Those who obstruct the Dao are shrouded in ignorance; those who envy others inflict punishment upon themselves. Those who slander others first emerge from the paths of beasts. Those who delight in lust and sensuality—from their past karma, the roots of the six domestic animals remain unsevered. The greedy and cruel harm themselves; the gluttonous swallow poison. Such are the origins of suffering—one must distance oneself from them.\n\nThe Dao spoke: When the Primordial Heavenly Worthy was to expound these precepts of karmic origins and fundamental practices, the Heavenly Worthy pointed a finger toward the ten directions of empty space, summoning the Flying Heavenly Thearchs, the Perfected Sovereigns, the Flying Heavenly Boundless Divine Kings, the Perfected of Wondrous Practices, the Supreme Jade Emperor, the Boundless Great Sage and Venerable Spirits, the Thirty-Six Heavenly Emperors, the Perfected of the Myriad Heavens, the Perfected of the Nine Palaces, the Five Elders of the Upper Perfected, the Heavenly Perfected and Earthly Immortals, the Jade Maidens of the Boundless Worlds, the Immeasurable Great Sage Assemblies, the Spiritual Officials of the Three Realms, the Enforcing Officials of the Three Primes, and their innumerable hosts. All at once, they rode the void and came, ascending to the Fourfold Radiance of the Jade Capital’s Heavenly Light, beneath the Purple Canopy that revolves the heavens. Their majestic spirits surged, streaming through the ten directions, illuminating the myriad heavens. They burned incense, scattered flowers, and circumambulated thrice in the Flying Mystery Step, then returned to their places. Bowing in reverence, they paid homage to the Perfected and together ascended the fields of the Golden Perfection’s Wheel of Dharma. Gazing upward to the Dharma’s sound, none were not filled with joy, all praising its goodness.\n\nThe Dao spoke: The supreme sincere karma of the Golden Perfection universally exalts the foundation of practice in the ten thousand enclosures. Few indeed are those who grasp the wondrous essence of Heaven’s principle—only the Upper Perfected practice it.\n\nYet the heavenly beings of the ten directions, dwelling in the treasuries of calamity, devise myriad schemes, releasing all manner of evil. The key lies in the heart. Establish the Daoist sanctuary, universally turn the Wheel of Dharma, illumine the Six Paths, and deliver the heavenly beings, the lonely souls, and the suffering spirits, that all may ascend to the Heaven of Blessing, ever rejoicing, enduring through kalpas, forever preserved. Henceforth, all shall be by the grace of the Wheel’s supreme grade.\n\nAt that time, the innumerable hosts of the Great Sages of the Myriad Heavens all praised its goodness, circumambulated thrice to the left, clasped their hands in reverence, and prostrated to receive the precepts.\n\nThe Heavenly Worthy addressed the assembly of heavenly sages: \"I unfold the Wheel of the Golden Perfection, transforming the causes of all. Yet nothing is more difficult than the form.\n\nThe body of utmost virtue is also the domain of a single state. Profit invites calamity—it is the heart’s creation. Thus, the realm of containment and concealment is entered through the gate of good and evil. Only the Perfected are awakened, attaining the Dao through non-action. If one can follow this, receive it sincerely, and never forget—\"\n\nThe Heavenly Worthy addressed the assembly of heavenly sages: \"The primordial qi is subtle and insubstantial, its movement and guidance impure. Fundamental karma is easily created, yet may lead to the loss of one’s body. From the five hearts arise the ten evils, long drowning in the blades of poison—can none awaken? They suffer their own pain!\n\nI turn the Wheel to deliver the heavenly beings of the ten directions from the sources of birth and death. When the ten virtues are fully established and one awakens to all karmic conditions of future lives, submitting to the precepts of karma, one attains the Perfection of the Dao.\"\n\nThe Heavenly Worthy addressed the Dao Lord: \"I unfold the supreme grade of the Wheel of Dharma, the Golden Perfection’s precepts of karma, the ten virtues as the root, the gate of myriad practices. If you follow them, all must submit and listen.\"\n\nThereupon, the Dao Lord bowed with clasped hands and prostrated to receive the precept text.\n\nThe Precepts state:\n\n**First Grade:** Right contemplation of the wondrous origin of the multitude—all attain the karma of spiritual penetration.\n**Second Grade:** Right hearing of the wondrous sound—spiritual penetration knows the ten directions.\n**Third Grade:** Right knowledge of the entry of fragrant light—spiritual penetration abides in the numinous qi.\n**Fourth Grade:** Right sound opens the wondrous gate—spiritual penetration brings boundless fruits of benefit.\n**Fifth Grade:** Right mindfulness of the precepts of Dharma and practice—spiritual penetration descends the Perfection of the Dao.\n**Sixth Grade:** Right mindfulness of the suffering of sentient beings—spiritual penetration manifests radiant retribution.\n**Seventh Grade:** Right contemplation of non-dual delusion—spiritual penetration enters the realm of the true Dao.\n**Eighth Grade:** Right practice of the great compassionate karma—spiritual penetration attains the supreme Perfection.\n**Ninth Grade:** Right stabilization of form and shadow, unmoved by the multitude of practices—spiritual penetration awakens to the wondrous.\n**Tenth Grade:** Right embodiment of form and spirit, steadfast and luminous in rectitude—spiritual penetration is profoundly mysterious.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1244,
      "start_sentence": 0,
      "end_sentence": 31,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.35757303237915,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝诚业本行上品妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "天尊言：金真上品十正神通诫业，万行之首，执正十方，无量通微之本。 吾开法轮，故演其文，以度劫灾，生死诸滞，咸使从兹而转，登乎长存，道真成就，终身不见十恶之门。 天尊言：金真本行十品，上善之功。 一品断五色贪利缘，正见不邪视。 二品断五音六尘之声，内外无邪听之闻。 三品断六触之因，邪气不入。 四品断虚谈假论，邪言绮语不前。 五品断众祸之害，众邪不侵。 六品断想五阴，邪恶不干。 七品断行非造作，邪灾不生。 八品断诸惑乱，众邪不犯於物。 九品断无端之行，邪疾自消。 十品断十恶之业，常当心取法轮，万魔邪神自却，无敢当矣。 天尊告道君曰：此是无上金真本行上品，澄真自炼空寂，通称上业，能如是者，金真可期矣。 吾观天人，万无一，自非至人，莫能从焉。 天尊言：金真观行十品，常能是者，万善备立。 一品见五色不贪者，淫风不行。 二品闻五音不听者； 魔风自除。 三品闻众气馨香不乐者，六府不伤，邪风自退。 四品见五味不贪甘进者，众尘不污身。 五品闻众乐不观者，即外尘恶风不惊。 六品守一无诸假想者，终身不染，邪气不生。 七品举动乘诫本行者，诸尘自消，形色光浄。 八品见宝货非横不取者，万善来臻，终身安存。 九品和性无嫉无妬，见事不触者，万福降真，灵魔礼焉。 十品安身闲想，慈念一切宿命者，十方护身，高上奏功，克获上真。 天尊告道君曰：吾开金真上品法轮诫业本行之由，十方天人，若能如是 者，即与十圣齐功，得入长存法界，得道自然者也，终身光明，亿劫同庆，福流万代，常与法轮不绝矣。 天尊言：吾开法轮十圣之场，一品转通，立能心知一方中轻重事，位次别觉圣； 二品转通，得知世界有无吉凶事，位次得觉圣； 三品转通，能达知罪福，一切宿命来往生处，果报由趣，位次正觉圣； 四品转通，能以心往见众生心，逆照未然，祸福阴中事，位次通觉圣； 五品转通，普知十方无极世界一切缘运由趣休否事，位次大觉圣； 六品转通，通玄观知悉达十方界域众圣处所，只如指掌，分形散影，虚空无碍，位次妙觉圣； 七品转通，普知天地运趣机数，有无远近，悉无障碍，位次洞觉圣； 八品转通，身居立忘，形如日中景，一切观彻，位次观觉圣； 九品转通，普能开明，放身中宝光，普照十方，一切普见，上下无不洞达，位次普明大觉圣； 十品转通，普观普察，普明普照，无幽无冥，洞知天地，光显十方默湛然长存，位次洞明大觉至真大圣者也。 斯行之业，皆从法轮而转，八十通大圣，其德高妙，自非法轮之功，莫能转焉。 十圣果缘，乃从无量恒沙劫来，施功布德，备满天地，弘广十方，致得转位，入十圣之功，妙通上品。 夫十方天人，能如是者，道真成焉。 天尊即勑无上高上洞明大法王曰：可诵无上金真法轮诫业本行妙通转位玉章，无上高上洞明大法王即起，作礼朝真，左回三匝。 诵法轮诫业玉章颂曰： 湛寂法诚功，观行极大乘。 金真众妙好，正位诸天朝。 法轮无上德，皆转无上真。 神通六度外，飞天多福人。 开度大梵仙，十品悉成真。 巍巍自然道，逍遥大光天。 念得恒沙劫，历观一切缘。 自无上品业，何由拔苦根。 法轮本行上品玉章颂曰：",
      "translated_text": "The Heavenly Worthy spoke: The Ten Right Spiritual Penetrations of the Golden Perfection’s Supreme Grade are the foremost of the ten thousand practices, the foundation of rectitude throughout the ten directions, and the root of boundless subtle penetrations. I now turn the Wheel of Dharma to expound this text, that all may transcend kalpa-disaster and the obstructions of birth and death, turning from these to ascend to eternal abiding. The Perfection of the Dao is thereby accomplished, and one shall never encounter the gates of the ten evils throughout life.\n\nThe Heavenly Worthy spoke: The Ten Grades of the Golden Perfection’s fundamental practice are the supreme merits of the highest good.\n\n**First Grade:** Sever the causes of craving for the five colors, and right vision shall not stray into perverse gazing.\n**Second Grade:** Sever the sounds of the five tones and six defilements, so that no perverse hearing arises within or without.\n**Third Grade:** Sever the causes of the six contacts, and perverse qi shall not enter.\n**Fourth Grade:** Sever empty chatter and false discourse, so that perverse speech and frivolous words do not arise.\n**Fifth Grade:** Sever the harms of manifold calamities, so that no multitude of perversities may invade.\n**Sixth Grade:** Sever the contemplation of the five aggregates, so that perverse evil does not encroach.\n**Seventh Grade:** Sever actions that are improper or contrived, so that perverse disasters do not arise.\n**Eighth Grade:** Sever all deluded confusions, so that no multitude of perversities may assail any being.\n**Ninth Grade:** Sever aimless conduct, and perverse illnesses shall naturally dissolve.\n**Tenth Grade:** Sever the karma of the ten evils, and ever hold the Dharma Wheel in mind. Then the myriad demonic and perverse spirits shall retreat of themselves, none daring to oppose you.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: These are the supreme grades of the Golden Perfection’s fundamental practice. By refining the true in the clarity of emptiness and quiescence, one is called a practitioner of the supreme practice. Those who can thus abide may attain the Golden Perfection. I observe that among the hosts of heaven and humanity, not one in ten thousand—unless they be perfected beings—can follow this path.\n\nThe Heavenly Worthy spoke: Those who constantly uphold the Ten Grades of the Golden Perfection’s contemplative practice shall perfect the ten thousand virtues.\n\n**First Grade:** Seeing the five colors without craving—licentious winds shall not arise.\n**Second Grade:** Hearing the five tones without listening—demonic winds shall naturally disperse.\n**Third Grade:** Encountering manifold fragrant qi without delight—the six viscera shall not be harmed, and perverse winds shall retreat of themselves.\n**Fourth Grade:** Seeing the five flavors without craving sweetness or excess—no multitude of defilements shall stain the body.\n**Fifth Grade:** Hearing manifold pleasures without observing them—external defilements and perverse winds shall not disturb.\n**Sixth Grade:** Abiding in oneness without false imaginings—one shall remain unstained throughout life, and perverse qi shall not arise.\n**Seventh Grade:** In all actions, riding the precepts and fundamental practice—all defilements shall dissolve of themselves, and one’s form and countenance shall radiate purity.\n**Eighth Grade:** Seeing treasures and goods without seizing what is not rightfully obtained—myriad virtues shall come to fruition, and one shall abide in peace throughout life.\n**Ninth Grade:** Harmonizing one’s nature without envy or jealousy, and not being provoked by events—myriad blessings shall descend upon the true, and numinous demons shall pay homage.\n**Tenth Grade:** Abiding in tranquility and serene contemplation, cherishing compassionate thoughts for all past lives—guardians from the ten directions shall protect the body. One shall present merits on high and attain the Golden Perfection.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: I now reveal the origin of the Wheel of Dharma’s precepts and fundamental practice of the Golden Perfection’s Supreme Grade. If the heavenly and human beings of the ten directions can thus abide, they shall equal the merits of the Ten Sages and enter the Dharma-realm of eternal abiding. They shall attain the Dao naturally, their lives suffused with luminosity. For kalpas unnumbered as the Ganges’ sands, they shall share in rejoicing, their blessings flowing through ten thousand generations, ever abiding with the Dharma Wheel without cessation.\n\nThe Heavenly Worthy spoke: I now turn the Wheel of Dharma in the assembly of the Ten Sages. With each grade of turning penetration:\n\n**First Grade:** One immediately knows the weight of matters in a single direction and discerns the ranks of the sages.\n**Second Grade:** One knows the existence or non-existence of auspicious and inauspicious matters in the world, and attains the rank of awakened sage.\n**Third Grade:** One thoroughly understands the causes of sin and blessing, the comings and goings of all past lives, their destinations, and the fruits of karmic retribution, and attains the rank of rightly awakened sage.\n**Fourth Grade:** One can perceive the minds of sentient beings with the mind, reverse-illuminating future events and the hidden matters of fortune and misfortune, and attains the rank of penetratingly awakened sage.\n**Fifth Grade:** One universally knows the conditions, movements, causes, and fortunes of all inexhaustible worlds in the ten directions, and attains the rank of greatly awakened sage.\n**Sixth Grade:** Through penetrating observation, one knows the abodes of all sages in the realms of the ten directions as clearly as pointing to the palm of one’s hand. One can divide form and disperse shadow without hindrance in the void, and attains the rank of wondrously awakened sage.\n**Seventh Grade:** One universally knows the movements and mechanisms of heaven and earth, their existence or non-existence, far or near, all without obstruction, and attains the rank of penetratingly awakened sage.\n**Eighth Grade:** Abiding in forgetfulness while standing, one’s form is like a shadow at noon. All is seen through, and one attains the rank of observantly awakened sage.\n**Ninth Grade:** One universally illumines and radiates the precious light from within the body, universally illuminating the ten directions. All is universally seen, and there is nothing above or below that is not thoroughly understood. One attains the rank of universally luminous, greatly awakened sage.\n**Tenth Grade:** Universally observing, universally examining, universally illuminating, universally shining—nothing is hidden or dark. One thoroughly knows heaven and earth, and the light manifests throughout the ten directions, abiding in silent profundity. One attains the rank of penetratingly luminous, greatly awakened, perfected, and supreme sage.\n\nThe practices and merits of these grades all turn through the Wheel of Dharma. The eighty penetrations of the great sages are of lofty and wondrous virtue. Without the power of the Dharma Wheel, none could attain them. The fruition of the Ten Sages arises from kalpas as numerous as the Ganges’ sands, wherein they have cultivated merit and spread virtue, filling heaven and earth and pervading the ten directions. Thus they attain their ranks and enter the merits of the Ten Sages, wondrously penetrating the Supreme Grade. If the heavenly and human beings of the ten directions can thus abide, the Perfection of the Dao is accomplished.\n\nThen the Heavenly Worthy commanded the Supreme, Most High, Penetratingly Luminous Great Dharma King, saying: You shall recite the Jade Chapters of the Turning Ranks of the Wondrous Penetrations of the Precepts and Fundamental Practice of the Supreme Golden Perfection’s Dharma Wheel. The Supreme, Most High, Penetratingly Luminous Great Dharma King rose, made obeisance, and circumambulated the True One thrice to the left.\n\nHe recited the Jade Chapters of the Precepts and Fundamental Practice of the Dharma Wheel, saying:\n\nIn the profound quiescence, the merit of Dharma’s sincerity,\nContemplation and practice reach the Great Vehicle’s utmost.\nThe Golden Perfection’s manifold wondrous excellences,\nRightly ranked, are the court of all heavens.\nThe Dharma Wheel’s supreme virtue,\nAll turns to the supreme Perfection.\nBeyond the six perfections, spiritual penetrations,\nAre the flying immortals, the greatly blessed.\nOpening and delivering the great Brahmā immortals,\nThe Ten Grades all attain the Perfection.\nMajestic is the natural Dao,\nCarefree in the Great Radiant Heaven.\nThrough kalpas as the Ganges’ sands,\nAll conditions are observed.\nWithout the supreme-grade practice,\nHow could the roots of suffering be eradicated?\n\nThe Jade Chapters of the Supreme-Grade Fundamental Practice of the Dharma Wheel say:",
      "overlap_context": ":** Right contemplation of non-dual delusion—spiritual penetration enters the realm of the true Dao.\n**Eighth Grade:** Right practice of the great compassionate karma—spiritual penetration attains the supreme Perfection.\n**Ninth Grade:** Right stabilization of form and shadow, unmoved by the multitude of practices—spiritual penetration awakens to the wondrous.\n**Tenth Grade:** Right embodiment of form and spirit, steadfast and luminous in rectitude—spiritual penetration is profoundly mysterious.",
      "start_char": 1245,
      "end_char": 2485,
      "start_sentence": 32,
      "end_sentence": 84,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.214818716049194,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝诚业本行上品妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "通观十本源，朗朗凝成真。 断去十恶场，品行入法轮。 内外香光起，倏忽登金真。 一升云明宫，威光焕诸天。 皆从本行起。 稽首朝天尊。 法轮观行玉章颂曰： 仰观金真行，绝景无诸尘。 形姿七宝相，云明照诸天。 飘飘大乘境，飞天转法轮。 万福同一庆，转度十苦人。 身登玉池上，沐浴炼成仙。 十方无孤魂，普开恒沙恩。 妙通至真德，束首天宝前。 法轮转通十圣洞明玉章颂曰： 无上开妙化，运功皆齐晨。 法轮十位场，大罗诸法门。 通称大光品，十圣并高真。 妙德转十通，湛然十飞天。 安和乐未央，普明昔往缘。 命合长存寿，洞觉应自然。 眇眇难为双，六时朝天尊。 天尊告道君曰； 是四篇玉章，此乃是无上金真诫业之首，法轮转通妙觉本行之源。 其文封在无上玉都流明宫中，金真元君保赏，金灵童子、八千四百真常诵其章，声响十方，啸朗诸天，群真叉手称善，至真朝焉，高上即开法轮上品，转度十方诸得道大圣众，以登无上金真者矣。 夫是天人有知其章，受持修斋执诚，礼诵灵文者，灵音即上彻十方，九天称庆，高上赞叹，即开法轮之品，转度其人，得登无上至真诸场。 其道高妙，自非大光开运十方，莫能闻焉。 天尊言：吾开法轮十善诸场，一品慈孝顺物，万行同心； 二品爱念一切众生，皆如我身； 三品信向经诫，罪福所由之源； 四品能舍宝货，布施天下无量诸人穷厄者； 五品能广建功德，营建道场，福因万代； 六品能守善而死，忍辱不杀不盗； 七品能救济一切厄急，无量众生性命，舍放无穷，皆得存其本命； 八品能供养三宝，晨夕礼诵，执戒持斋，恒无怠倦； 九品常能开化天人，爱念国主，享祚长存，恒以财物润益贫穷孤老、无量苦人，常无贪惜； 十品行常使然，不进不退，一心行善。 夫天人能如是者，即可谓十善之功，万行同庆之本也。 此皆是十方飞天无极至真皇人无上诫业本行之源，天人能从之者，即以十方飞天无极至真齐功矣。 无上飞天法轮转十善妙通玉章颂曰： 流明大范品，开道无量功。 转度十善行，梵景飞天堂。 逍遥七宝宫，仰观法轮王。 灵颜绝妙好，常降十道场。 齐驾三宝乘，运载诸天人。 倏忽云光发，众相并金容。 皆从斯福起，受位高上真。 游憩天宝台，庆此劫数回。 三匝朝道主，稽首礼天尊。 天尊告道君曰：是玉章一篇，乃是十方无上金光童子各十真，镇於飞天法轮天宝宫中，保赏灵文，常随法轮十善品转法轮，诵其章，以度十方诸天持行无量善人，策驾三乘宝乘，啸诵其音，群真赞和，震响十方，诸天设礼，莫不恭心，开津三界，三真奉迎，香华伎乐，营卫善人，直登法轮诸场矣。 天尊告道君日：吾开法轮十善上品，咸使十方诸天人，皆去十恶诸场。 其有如是行十恶者，尔莫从之行，其中唱言快乐者，尔宜避之言。 其欲来害者，尔但当一心念诫业，存真而受之杀，其理自不能有害我身，此即转成无上至真者乎，其人自当杀报也。 其有贤圣出者，尔当寻之，一亲神颜，万劫常得其力矣。 夫理甚微，故以上天十福堂以对下十恶场者也。 天尊言：法轮开度十恶诸场，一品不行慈孝之道，尊卑上下失礼，恒无和顺之心相向； 二品不行爱念众生，常怀凶勃； 三品不行信向心，快情所为，作诸恶业，反逆君王；",
      "translated_text": "In penetrating contemplation of the Ten Fundamental Sources, luminous and clear, they congeal into the Real.\nSevering the realms of the Ten Evils, one’s conduct enters the Dharma Wheel.\nInner and outer fragrance and radiance arise,\nSwiftly ascending to the Golden Perfection.\nOnce risen to the Cloud-Luminous Palace,\nMajestic radiance illumines all heavens.\nAll proceeds from the Fundamental Practice.\nBowing in reverence, they pay homage to the Heavenly Worthy.\n\nThe Jade Chapters on Contemplation and Practice of the Dharma Wheel say:\nGazing upward at the Golden Perfection’s conduct,\nIts surpassing splendor is free of all dust.\nIts form and bearing bear the Seven Treasures’ marks,\nCloud-luminous, illuminating all heavens.\nSoaring in the Great Vehicle’s realm,\nFlying immortals turn the Dharma Wheel.\nMyriad blessings unite in one celebration,\nTurning to deliver those in the Ten Sufferings.\nThe body ascends above the Jade Pool,\nBathing and refining to become an immortal.\nIn the Ten Directions, no lonely souls remain,\nUniversally opening the Ganges’ sands of grace.\nWondrously penetrating the Perfection’s virtue,\nThey bow their heads before the Heavenly Treasure.\n\nThe Jade Chapters on the Dharma Wheel’s Turning and Penetrating the Ten Sagely Luminous Realms say:\nThe Supreme unfolds wondrous transformation,\nIts merit in motion, all dawn in unison.\nThe Dharma Wheel’s Ten Grades’ realms,\nThe Great Canopy’s manifold Dharma gates.\nCollectively called the Great Radiance Grade,\nThe Ten Sages and Highest Perfected.\nWondrous virtue turns the Ten Penetrations,\nSerene are the Ten Flying Immortals.\nPeaceful and joyful, unending bliss,\nUniversally illuminating past karmic conditions.\nLife harmonizes with eternal longevity,\nLuminous awakening responds to the natural.\nSubtle and peerless, none can compare,\nIn the six periods, they pay homage to the Heavenly Worthy.\n\nThe Heavenly Worthy addressed the Dao Lord, saying:\nThese four Jade Chapters are the foremost of the Supreme Golden Perfection’s precepts and karma, the source of the Dharma Wheel’s turning and wondrous awakening’s Fundamental Practice. This text is sealed within the Supreme Jade Capital’s Flowing Luminosity Palace, guarded and cherished by the Golden Perfection’s Primordial Lady. The Golden Spirit Youths and eight thousand four hundred Perfected constantly recite its chapters, their voices resounding through the Ten Directions, echoing brightly through all heavens. The host of Perfected join hands in praise, the Utmost Perfected pay homage, and the Highest then opens the Supreme Grade of the Dharma Wheel, turning to deliver the multitudes of great sagely beings in the Ten Directions who have attained the Dao, thereby ascending to the Supreme Golden Perfection.\n\nIf any among heaven and humankind know these chapters, receive and uphold them with devotion, observe purification rites, and reverently recite this sacred text, their numinous tones will ascend to penetrate the Ten Directions. The Nine Heavens rejoice, the Highest praise and extol, immediately opening the grades of the Dharma Wheel to turn and deliver such persons, enabling them to ascend to the Supreme Perfected’s manifold realms. This Dao is lofty and wondrous; unless the Great Radiance unfolds to pervade the Ten Directions, none could hear of it.\n\nThe Heavenly Worthy said: I open the Dharma Wheel’s Ten Virtues’ manifold realms. The first grade is compassion and filial piety toward all beings, with all conduct harmonized in one mind. The second grade is cherishing and caring for all sentient beings as one’s own self. The third grade is faithfully turning toward the scriptural precepts, the source from which transgressions and blessings arise. The fourth grade is being able to relinquish treasures and wealth, bestowing alms upon the immeasurable multitudes of the destitute and suffering in the world. The fifth grade is being able to extensively establish merit and virtue, constructing Daoist sanctuaries, thereby creating blessings for ten thousand generations. The sixth grade is being able to uphold goodness unto death, enduring humiliation, refraining from killing and stealing. The seventh grade is being able to rescue and relieve all in dire distress, preserving the lives of immeasurable sentient beings, releasing and liberating without end, all thereby preserving their fundamental lives. The eighth grade is being able to make offerings to the Three Treasures, morning and evening paying homage and reciting scriptures, upholding precepts and observing purification, ever without weariness. The ninth grade is constantly being able to transform and enlighten heaven and humankind, cherishing and caring for the sovereign, ensuring the longevity of their reign, perpetually using wealth and resources to benefit the poor, orphaned, elderly, and immeasurable suffering beings, ever without greed or stinginess. The tenth grade is conduct that is perpetually thus, neither advancing nor retreating, single-mindedly practicing goodness.\n\nIf any among heaven and humankind can be thus, they may be called the merit of the Ten Virtues, the foundation of the myriad practices’ united celebration. These are all the source of the Ten Directions’ Flying Immortals’ boundless Utmost Perfected Sovereigns’ supreme precepts and Fundamental Practice. If any among heaven and humankind can follow them, they will thereby equal the merit of the Ten Directions’ Flying Immortals’ boundless Utmost Perfected.\n\nThe Jade Chapters on the Supreme Flying Immortals’ Dharma Wheel Turning the Ten Virtues’ Wondrous Penetration say:\nThe Flowing Luminosity’s Great Model Grade,\nOpens the Dao’s immeasurable merit.\nTurning to deliver the Ten Virtues’ conduct,\nBrahmā’s splendor, the Flying Immortals’ hall.\nCarefree in the Seven Treasures’ palace,\nGazing upward at the Dharma Wheel’s King.\nNuminous countenance surpassingly wondrous,\nConstantly descending to the Ten Dao Realms.\nIn unison, they ride the Three Treasures’ vehicle,\nConveying all heaven and humankind.\nSwiftly, cloud radiance arises,\nAll forms bearing golden countenances.\nAll proceeds from this blessing,\nReceiving the rank of Highest Perfected.\nRoaming and resting on the Heavenly Treasure Terrace,\nCelebrating this kalpic cycle’s return.\nThrice circling, they pay homage to the Dao’s Master,\nBowing their heads in reverence to the Heavenly Worthy.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: This Jade Chapter is one of the Ten Directions’ Supreme Golden Radiance Youths, each with ten Perfected, stationed within the Flying Immortals’ Dharma Wheel’s Heavenly Treasure Palace, guarding and cherishing the sacred text. They constantly follow the Dharma Wheel’s Ten Virtues’ grades, turning the Dharma Wheel, reciting its chapters to deliver the Ten Directions’ heavens’ multitudes of practitioners of immeasurable goodness. Urging them to ride the Three Vehicles’ treasure conveyance, they chant and recite its tones, the host of Perfected joining in praise, their voices shaking the Ten Directions. All heavens perform rites, none without reverent hearts, opening the ford to the Three Realms. The Three Perfected welcome them with incense, flowers, music, and dance, escorting the virtuous directly to ascend to the Dharma Wheel’s manifold realms.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: I open the Supreme Grade of the Dharma Wheel’s Ten Virtues, universally enabling all heaven and humankind in the Ten Directions to abandon the Ten Evils’ manifold realms. If any practice these Ten Evils, you must not follow their conduct. Among them, those who proclaim joy and happiness, you should avoid their words. If any seek to harm you, you need only single-mindedly contemplate the precepts and karma, preserving the Real while enduring their killing. In principle, they will be unable to harm your body, thereby transforming into the Supreme Utmost Perfected. Such persons will naturally receive the karmic retribution of killing. If any sagely and worthy beings emerge, you should seek them out, drawing near to their numinous countenance, thereby perpetually receiving their power for ten thousand kalpas.\n\nThe principle is most subtle, thus the Ten Blessings’ Hall of the Upper Heavens is set against the Ten Evils’ realms below.\n\nThe Heavenly Worthy said: The Dharma Wheel opens to deliver the Ten Evils’ manifold realms. The first grade is failing to practice the Dao of compassion and filial piety, lacking propriety between high and low, perpetually without harmonious and compliant hearts toward one another. The second grade is failing to practice cherishing and caring for sentient beings, perpetually harboring malevolence. The third grade is lacking faith and devotion, following the impulses of their emotions, committing manifold evil deeds, rebelling against the sovereign.",
      "overlap_context": "tion.\nBeyond the six perfections, spiritual penetrations,\nAre the flying immortals, the greatly blessed.\nOpening and delivering the great Brahmā immortals,\nThe Ten Grades all attain the Perfection.\nMajestic is the natural Dao,\nCarefree in the Great Radiant Heaven.\nThrough kalpas as the Ganges’ sands,\nAll conditions are observed.\nWithout the supreme-grade practice,\nHow could the roots of suffering be eradicated?\n\nThe Jade Chapters of the Supreme-Grade Fundamental Practice of the Dharma Wheel say:",
      "start_char": 2485,
      "end_char": 3740,
      "start_sentence": 85,
      "end_sentence": 142,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.14275050163269,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝诚业本行上品妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "四品不行爱善，不舍不施，心常破伤他物，自言得快，无诸慈悲； 五品不行建功德心，惟建非祸事为乐； 六品行不能忍辱，心常欺妄於他，万端无信； 七品不行救济厄急心，常怀执着性，常愿人堕恶道； 八品不行恭敬经诫心，常谤毁天真，以入邪论，害生祭祀； 九品不行利益心，常以财利割剔贫穷孤老，自贪润己身； 十品行常杀害无量众生，淫欲无度，万恶备立，进退疑惑，行常使然者，可谓十恶矣。 斯行皆非天非地，止由於心。 夫上德至人，唯以十善为功，常以己心为十方飞天福堂，径往法轮为因缘，执持诚业，寻本行微，取果报上真之德，是以不经十苦，不入八难，不见烦恼，不履三涂也。 夫下士诸人，唯以己心常为执杀之官，径寻地狱循环诸报，背十善，向十恶，行十苦，自以身投八难，往取烦恼之根，形履三涂之门，日有沉沦，亿劫长罹涂炭，去福远矣。 吾开法轮，普度诸人矣。 无上飞天法轮转十恶入妙通上品玉章颂曰： 郁秀玉清，太无自然，荫影十方，开津法轮，拔度八难，转诸福天，流景冠带，解滞胞根，积尸受炼，灭恶通真，玉皇命召，十善并原，诸天称庆，五老侍晨，帝君执符，齐送道前，飞天大囿，无量度人，劫劫承化，运载三乘，法王品位，无上至真，三元除恶，九夜光明，束身天宝，形登长存，妙德高上，洞明金真。 天尊告道君日：是玉章镇於飞天法轮右宫，十方玉童玉女各十真保赏灵文，常随法轮上品转十恶诸场，迁度天人生死苦魂，咸使劫劫运化，常与法轮有缘。 天人有知其章，修斋行香礼诵者，法王降真，道成不久矣。 天尊告道君曰：吾开法轮以转十恶诸场，上品之福，其功无量，静心绝想，此为上德。 闻乐不闻，浮华美色，此是十恶之根，形非长有，财不长存，道真无上，故开法轮。 世界有欲寻真弃俗因缘，保固元气，凝素自然，魔来忤者，慎口勿言，生恶起惑，终入法轮，障道者苦，后身如然。 天尊言：法轮开度十苦诸场，一品履刀山苦，二品上剑树苦，三品入镬汤苦，四品抱铜柱苦，五品卧铁床苦，六品火车载入寒池苦，七品拘头拔舌苦，八品吞火食炭苦，九品三官锁械徒役、金槌铁杖考掠苦，十品生身受锁械，烦恼形杀苦。 如是十方，有斯十苦，皆由先身集因所得。 吾观诸苦，涂炭难言，故开法轮，普度诸天，十方欢乐，原赦之焉，六道光明，法桥路通，一切同庆，道真降矣。 无上飞天法轮转度十苦品玉章颂曰： 历观十方，无量罪根，流曳十苦，焦体烂坏，大小相牵，弥劫涂炭，毒刃伤身，沉没九夜，望反甚难，方思十善，念是因缘，撄承痛切，风刀往还，吞阴食毒，魂神无闲，仰视无上，飞天法轮，开度上品，转诸升迁，荣身玉庭，妙通十天，无极世界，洞识诸缘，修行诚业，稽首道前。 天尊告道君曰：是玉章镇於飞天法轮中宫，十方丹灵童子各十真保赏灵文，常随法轮上品转度十苦诸场，开度天人生死，咸得法缘，天人有诵其章，上闻九天，法王命真来度之焉。 天尊告道君曰：吾开法轮以转八难诸场，上品之功，无量法门。 夫人心净，十善降焉，生贪业恶，物心不淳，彼有怀恶，尔当善之，三元执法，近在身中，阴私皆结，以上奏诸天，考官速至，坐征疾伤。",
      "translated_text": "The fourth grade is failing to practice love of goodness, refusing to relinquish or bestow, constantly damaging others’ possessions, claiming satisfaction for themselves, devoid of all compassion. The fifth grade is lacking the mind to establish merit and virtue, delighting only in creating misfortune and calamity. The sixth grade is failing to practice forbearance, constantly deceiving and lying to others, utterly devoid of trustworthiness in myriad ways. The seventh grade is lacking the mind to rescue and relieve those in dire straits, perpetually harboring obstinate attachments, constantly wishing others to fall into evil destinies. The eighth grade is lacking the mind of reverence for scriptures and precepts, constantly slandering and defaming the Heavenly Perfected, entering into heterodox doctrines, harming living beings through sacrifices. The ninth grade is lacking the mind of benefiting others, constantly using wealth and profit to exploit the poor, the orphaned, and the elderly, selfishly enriching their own bodies. The tenth grade is constantly killing and harming boundless sentient beings, indulging in unbridled lust, amassing every evil, wavering in advance and retreat, perpetually acting thus—these may be called the Ten Evils.\n\nSuch actions are neither of Heaven nor of Earth, but arise solely from the mind. Those of supreme virtue and perfected persons take the Ten Goodnesses as their merit, constantly making their own minds the flying heavens’ Hall of Blessings for the ten directions, directly entering the Dharma Wheel as their causal condition. They uphold and maintain sincere deeds, tracing back to the subtlety of their original conduct, thereby attaining the virtue of the fruit-report of the Upper Perfected. Thus, they do not undergo the Ten Sufferings, do not enter the Eight Difficulties, do not encounter afflictions, and do not tread the Three Wretched Paths.\n\nAs for the inferior persons of the lower realms, they constantly make their own minds the office of execution and slaughter, directly seeking the cyclic retributions of hell, turning their backs on the Ten Goodnesses and facing the Ten Evils, practicing the Ten Sufferings. They cast their own bodies into the Eight Difficulties, proceeding to grasp the roots of affliction, their forms treading the gates of the Three Wretched Paths. Daily they sink and drown, enduring eons of endless suffering in the mire and ashes, ever more distant from blessings.\n\nI now open the Dharma Wheel to universally deliver all people.\n\nThe Jade Chapter Hymn of the Supreme Flying Heaven’s Dharma Wheel, Turning the Ten Evils into the Wondrous and Penetrating Upper Grade, proclaims:\n\nLush and resplendent, Jade Clarity,\nSupremely Non-Being, naturally so,\nShading and reflecting the ten directions,\nOpening the ford of the Dharma Wheel,\nDelivering from the Eight Difficulties,\nTurning all blessed heavens,\nRadiant light as crown and sash,\nDissolving the stagnant roots of the womb,\nAccumulated corpses undergo refinement,\nEvil extinguished, the Perfected attained,\nThe Jade Emperor commands and summons,\nThe Ten Goodnesses all restored,\nAll heavens rejoice,\nThe Five Elders attend the dawn,\nThe Thearch holds the tally,\nTogether they escort before the Dao,\nThe great park of the Flying Heavens,\nBoundlessly delivering people,\nKalpa after kalpa receiving transformation,\nConveying the Three Vehicles,\nThe Dharma King’s ranked positions,\nSupreme and Perfected,\nThe Three Primes eliminate evil,\nThe Nine Nights shine brightly,\nBinding the body with heavenly treasures,\nForm ascends to eternal abiding,\nWondrous virtue, lofty and supreme,\nPenetrating and illuminating the Golden Perfected.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: This Jade Chapter is enshrined in the right palace of the Flying Heaven’s Dharma Wheel. In each of the ten directions, ten jade lads and ten jade maidens, each a true guardian, receive the numinous text, constantly accompanying the Dharma Wheel’s upper grade as it turns the realms of the Ten Evils, transporting and delivering the suffering souls of heaven-dwellers and mortals in the cycle of birth and death, ensuring that kalpa after kalpa they undergo transformation, ever in affinity with the Dharma Wheel.\n\nIf heaven-dwellers and mortals know this chapter and perform purification rites, burn incense, and reverently recite it, the Dharma King will descend in truth, and their attainment of the Dao will not be long in coming.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: I open the Dharma Wheel to turn the realms of the Ten Evils. The blessings of the upper grade are boundless in merit. To still the mind and extinguish thoughts—this is the virtue of the highest. To hear music and not hear it, to see floating splendor and beautiful forms—these are the roots of the Ten Evils. The form is not eternally possessed, wealth does not eternally remain; the Dao and the Perfected are supreme. Thus, I open the Dharma Wheel.\n\nIn the world, those who seek the true and abandon the mundane through causal conditions must preserve and secure their original qi, congealing their pure and natural essence. When demons come to oppose, guard your mouth and do not speak, lest evil arise and delusion begin. In the end, they will enter the Dharma Wheel. Those who obstruct the Dao suffer; in later lives, it will be the same.\n\nThe Heavenly Worthy said: The Dharma Wheel opens to deliver the realms of the Ten Sufferings. The first grade is treading the suffering of the Mountain of Knives. The second grade is ascending the suffering of the Tree of Swords. The third grade is entering the suffering of the Cauldron of Boiling Water. The fourth grade is embracing the suffering of the Bronze Pillar. The fifth grade is lying on the suffering of the Iron Bed. The sixth grade is the suffering of the Fire Cart carrying one into the Frigid Pool. The seventh grade is the suffering of having one’s head restrained and tongue pulled out. The eighth grade is the suffering of swallowing fire and eating coals. The ninth grade is the suffering of the Three Officials’ shackles and fetters, penal servitude, and the torment of the golden hammer and iron staff. The tenth grade is the suffering of being shackled in life, afflictions of form and killing.\n\nIn these ten directions, such Ten Sufferings all arise from the causes accumulated in former lives. I observe these sufferings—words cannot describe their misery in the mire and ashes. Thus, I open the Dharma Wheel to universally deliver all heavens, bringing joy to the ten directions, pardoning and absolving them. The Six Paths shine brightly, the Dharma Bridge’s path is open, all rejoice together, and the Dao and the Perfected descend.\n\nThe Jade Chapter Hymn of the Supreme Flying Heaven’s Dharma Wheel, Turning and Delivering the Ten Sufferings, proclaims:\n\nSurveying the ten directions,\nBoundless roots of sin,\nDragged through the Ten Sufferings,\nBodies scorched and rotting,\nGreat and small entangled,\nEons in the mire and ashes,\nToxic blades wound the body,\nSinking into the Nine Nights,\nLonging to return is most difficult,\nOnly then do they think of the Ten Goodnesses,\nReflecting on these causal conditions,\nGrasping the pain and urgency,\nWind and blade come and go,\nSwallowing darkness, consuming poison,\nHun and spirit have no respite,\nGazing upward to the Supreme,\nThe Flying Heaven’s Dharma Wheel,\nOpening to deliver the upper grade,\nTurning all to ascend and be promoted,\nAdorning the body in the Jade Court,\nWondrously penetrating the Ten Heavens,\nThe boundless worlds,\nPenetrating and recognizing all conditions,\nCultivating sincere deeds,\nBowing in reverence before the Dao.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: This Jade Chapter is enshrined in the central palace of the Flying Heaven’s Dharma Wheel. In each of the ten directions, ten cinnabar-spirit lads, each a true guardian, receive the numinous text, constantly accompanying the Dharma Wheel’s upper grade as it turns and delivers the realms of the Ten Sufferings, opening the path to deliver heaven-dwellers and mortals from birth and death, all attaining affinity with the Dharma. If heaven-dwellers and mortals recite this chapter, it ascends to be heard in the Nine Heavens, and the Dharma King commands the Perfected to come and deliver them.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: I open the Dharma Wheel to turn the realms of the Eight Difficulties. The merit of the upper grade encompasses boundless Dharma gates. When a person’s mind is pure, the Ten Goodnesses descend. When one gives rise to the evil of covetous karma, the mind toward things is impure. If others harbor evil, you should make them good. The Three Primes’ enforcers of the law are close at hand within your own body. Secret transgressions are all recorded, reported above to the heavens. The investigating officials swiftly arrive, and one is afflicted with illness and harm.",
      "overlap_context": "liver the Ten Evils’ manifold realms. The first grade is failing to practice the Dao of compassion and filial piety, lacking propriety between high and low, perpetually without harmonious and compliant hearts toward one another. The second grade is failing to practice cherishing and caring for sentient beings, perpetually harboring malevolence. The third grade is lacking faith and devotion, following the impulses of their emotions, committing manifold evil deeds, rebelling against the sovereign.",
      "start_char": 3740,
      "end_char": 4981,
      "start_sentence": 143,
      "end_sentence": 168,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.45803904533386,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝诚业本行上品妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "试行上本，善当从之，无闻倒见，故知无缘，正具形神，晨夕恭心，道真下降，度尔福天。 天尊言：法轮开度八难诸场，一品受身出边夷难，二品受身为奴婢下使难，三品受身出为贫穷孤陋人难，四品受身六疾人难，五品受身愚痴，六根不具足难，六品受身锁械，烦恼徒役难，七品受身出不孝不慈生亡难，八品受身出於无道国中难者也。 夫是八难者，皆由先身集行所得，从十苦中出，方生八难中。 但上德至人，常以十善以拟将来，往生十方无量福堂也。 夫无明倒见者，恒以十恶为本，故生亡十善，一生一死，亿劫苦恼，恒出八难受报。 吾开法轮，以度斯人矣。 无上飞天法轮转八难上品玉章颂曰： 仰观八门，轮转罪田，受诸苦恼，形魂不闲，先无诚业，终身八难，无量罪门，一生一死，十恶往还，於是冥冥，受诸沉沦，飞天大赦，普转法转，高上八观，洞开玉城，七宝宫台，乘运相迎，云明焕照，十方大庭，金容绝妙，双光自生，策龙驾凤，游憩玉京，宝林罗列，身中光明，三罗自解，八难齐并。 天尊告道君曰：是玉章镇於飞－天法轮右玄台上，十方灵光玉童玉女各· 十真保赏灵文，常随法轮上品诵其章，转度八难诸场，以畅天人生死之魂，咸得光明，普见法缘。 夫天人有知其章，拔度存亡滞苦，斋而诵之者，诸天降· 下，即度兆生死命籍迁上长存之福堂矣。 天尊告道君曰：吾开法轮以转三恶道之场，上品之福，无量群生，悉令得转度十方福堂，运化生天。 斯恶深重，皆由先身害生万物无量众生之命，致生彼道，以报昔缘，一生一死，业对所因，今转诸身、普入善根，自觉往生，一切因缘，生死蒙惠，莫不欢焉。 天尊言：法轮开度三恶道诸场，一品地狱幽闭涂炭，二品饿鬼自相食啖烦恼之苦，三品畜生同类怨对相击之毒。 夫如斯等，众生若反化，即生三恶中，一品生虫中，二品生乌中，三品生兽中者矣。 先身行业，元逆之本，其罪负重，致招斯恶，弥劫聚集，应得是报。 吾开上品无量法轮，普拔斯恶，以还福门。 无上飞天法轮三恶道上品玉章颂曰： 历观十方中，无极世界人。 豪贵不畏罪，快意害众生。 兴伐逆国主，不顾后身撄。 罪满九河内，形履刀山庭。 举手循剑树，流血落如星。 坐待镬汤煮，铁锥刺身形。 回身入饿鬼，只闻悲哭声。 仰头看铁网，足立流火庭。 六畜相割剔，以报昔往生。 但见十福天，乘景负圆月。 逍遥三界外，方念三宝经。 法王万善行，普开无量功。 转度三恶道，受炼十天仙。 身生五色光，妙觉诸恶缘。 一超三便去，闲居十飞天。 天尊告道君曰：是玉章镇於飞天法轮上品玉城中，十方法轮玉童玉女各十真保赏灵文，常随高上上品法轮诵其章，转度三恶苦道诸场，以炼滞尸苦骸，咸得光鲜，普登十天福堂。 天人有知其章，命过之日，斋而诵之，魂爽即不过三恶，径升十方品入法轮者也。 天尊告道君曰：吾开法轮，以转十邪不正道诸场，上品之行。 夫众生贪欲，万端无厌，自以身命投於十恶，缠骸苦想，自役罪状，衅满天地，形名作道，非法妄生，淫佚邪气，生无善教，死必有重考，亿劫委身屠割，生死往还，长处盲道，终身邪言，疾病撄苦，终归八门，吾开法门，普转还入道真。",
      "translated_text": "Should one practice the superior scripture, goodness will naturally follow—let no perverted views be heard, for without affinity, the true form and spirit remain intact. Morning and evening, with reverent heart, the Perfected of the Dao descend to deliver you to the heavens of blessings.\n\nThe Heavenly Worthy said: The Dharma Wheel opens to deliver the realms of the Eight Difficulties. The first grade is reborn beyond the frontier barbarians; the second grade is reborn as a slave or servant; the third grade is reborn as a destitute, lonely, and lowly person; the fourth grade is reborn with the six chronic illnesses; the fifth grade is reborn with foolishness and incomplete faculties; the sixth grade is reborn in shackles, afflicted by the toils of karmic bondage; the seventh grade is reborn into a life of unfilial impiety or bereavement; the eighth grade is reborn in a lawless kingdom. These Eight Difficulties all arise from past deeds and emerge from the Ten Sufferings, only to be reborn within the Eight Difficulties.\n\nYet those of supreme virtue and perfected persons constantly cultivate the Ten Goodnesses in preparation for the future, to be reborn in the boundless halls of blessings across the ten directions. Those who cling to deluded and perverted views invariably take the Ten Evils as their foundation, thus forsaking the Ten Goodnesses. They cycle through birth and death, enduring eons of suffering, forever reborn into the Eight Difficulties to receive their retribution. I now open the Dharma Wheel to deliver such beings.\n\nThe *Jade Chapter Hymn of the Supreme Flying Heaven Dharma Wheel* for the upper grade of the Eight Difficulties proclaims:\n\nBehold the Eight Gates, the Wheel turning the field of sins,\nReceiving all sufferings, where form and soul find no respite.\nWithout prior deeds of sincerity, one’s life ends in the Eight Difficulties,\nCountless gates of transgression, cycling through birth and death.\nThe Ten Evils return again, plunging into darkness,\nReceiving endless sinking and drowning.\nYet the Great Amnesty of the Flying Heaven universally turns the Dharma Wheel,\nThe lofty Eight Visions open the Jade City,\nPalaces of the Seven Treasures, borne on chariots to welcome,\nClouds of radiance illuminating the great courts of the ten directions.\nA golden countenance of unmatched beauty, twin lights spontaneously arising,\nUrging dragons and riding phoenixes, they roam the Jade Capital.\nJeweled forests arrayed, light shining from within the body,\nThe Three Fetters dissolve, the Eight Difficulties simultaneously resolved.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: This Jade Chapter is enshrined upon the right Mystery Terrace of the Flying Heaven Dharma Wheel. The Jade Lads and Jade Maidens of the ten directions, each bearing the *Ten Perfected Treasured Writ of Reward*, constantly follow the upper-grade Dharma Wheel, reciting this chapter to turn and deliver the realms of the Eight Difficulties, gladdening the souls of heaven-dwellers and mortals in the cycle of birth and death, that all may attain radiance and universally perceive the affinity of the Dharma.\n\nIf heaven-dwellers and mortals know this chapter and recite it with sincerity, they will deliver both the living and the dead from lingering suffering. The heavens will descend, and the destinies of their lives and deaths will be transferred to the halls of eternal blessings.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: I open the Dharma Wheel to turn the realms of the Three Evil Paths. The blessings of the upper grade are boundless, and all beings are enabled to be delivered to the halls of blessings across the ten directions, transforming to be reborn in heaven. These profound evils arise from past lives, where countless beings were harmed, leading to rebirth in those paths as retribution for former causes. Cycling through birth and death, the karmic consequences of their deeds now turn all bodies to universally enter the roots of goodness. Through self-awakening, they are reborn, and all karmic conditions of birth and death receive grace, none failing to rejoice.\n\nThe Heavenly Worthy said: The Dharma Wheel opens to deliver the realms of the Three Evil Paths. The first grade is the hells of dark confinement and scorching torment; the second grade is the hungry ghosts who devour one another in the suffering of affliction; the third grade is the beasts who strike one another in mutual enmity and poison. Such beings, if they reverse their ways, are reborn into the Three Evil Paths: the first grade as insects, the second as crows, and the third as beasts. The deeds of their past lives were fundamentally rebellious, their sins heavy, thus incurring such evils. Gathering over eons, they receive this retribution. I now open the boundless Dharma Wheel of the upper grade to universally deliver these evils and return them to the gates of blessings.\n\nThe *Jade Chapter Hymn of the Supreme Flying Heaven Dharma Wheel* for the upper grade of the Three Evil Paths proclaims:\n\nSurveying the ten directions within,\nThe boundless worlds of men—\nThe powerful and noble fear no transgression,\nIndulging in the slaughter of beings.\nThey raise armies to rebel against rulers,\nHeedless of future retribution.\nWhen sins fill the Nine Rivers,\nTheir forms tread the courts of Knife Mountain.\nHands brushing the Sword Trees,\nBlood flows like falling stars.\nSeated to await boiling in cauldrons,\nIron awls piercing their bodies.\nTurning, they enter the realm of hungry ghosts,\nHearing only wails of sorrow.\nHeads raised to see the iron net,\nFeet standing in the courtyard of flowing fire.\nBeasts tearing at one another,\nRetribution for past lives.\nYet behold the Ten Blessed Heavens,\nRiding the light, bearing the full moon.\nRoaming beyond the Three Realms,\nOnly then do they recall the scriptures of the Three Treasures.\nThe Dharma King’s myriad good deeds\nUniversally open boundless merit.\nTurning to deliver the Three Evil Paths,\nThey undergo refinement as the Ten Heavenly Immortals.\nBodies emitting five-colored light,\nAwakening to the wondrous causes of all evils.\nIn one leap, they transcend the Three Paths,\nDwelling leisurely in the Ten Flying Heavens.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: This Jade Chapter is enshrined within the Jade City of the upper-grade Flying Heaven Dharma Wheel. The Jade Lads and Jade Maidens of the Dharma Wheels of the ten directions, each bearing the *Ten Perfected Treasured Writ of Reward*, constantly follow the supreme upper-grade Dharma Wheel, reciting this chapter to turn and deliver the realms of the Three Evil Paths of suffering, refining the stagnant corpses and suffering bones, that all may attain radiance and universally ascend to the halls of blessings in the Ten Heavens. If heaven-dwellers and mortals know this chapter and recite it with sincerity on the day their lives end, their souls will not pass through the Three Evil Paths but will directly ascend to the Dharma Wheel of the ten directions, entering its ranks.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: I open the Dharma Wheel to turn the realms of the Ten Deviant and Unorthodox Paths, the practices of the upper grade. Beings, insatiable in their myriad desires, cast their bodies and lives into the Ten Evils, entangling their forms in suffering and self-inflicting the punishments of their transgressions. Their offenses fill heaven and earth, their names and forms becoming paths, falsely generating unrighteousness, licentiousness, and deviant qi. Born without virtuous teachings, they inevitably face severe judgment in death, their bodies enduring eons of dismemberment, cycling through birth and death, forever dwelling in blind paths. Their lives end in perverse speech, illness, and suffering, ultimately returning to the Eight Gates. I now open the Dharma gates to universally turn them back to the Perfected of the Dao.",
      "overlap_context": "ies. The merit of the upper grade encompasses boundless Dharma gates. When a person’s mind is pure, the Ten Goodnesses descend. When one gives rise to the evil of covetous karma, the mind toward things is impure. If others harbor evil, you should make them good. The Three Primes’ enforcers of the law are close at hand within your own body. Secret transgressions are all recorded, reported above to the heavens. The investigating officials swiftly arrive, and one is afflicted with illness and harm.",
      "start_char": 4981,
      "end_char": 6222,
      "start_sentence": 169,
      "end_sentence": 204,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.86855864524841,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝诚业本行上品妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "天尊言：法轮开度十邪恶道诸场，一品背正入鬼道，终身生邪魅，永婴诸疾苦，受报无穷期。 二品轻毁道法，将入邪径，信顺邪言，谤道欺师。 三品不信道真，舍身入鬼魅。 四品无明倒见，众生常怀五浊，执结魔魅，自称圣名，以乱正道。 五品常生杀害，淫祀鬼魅，诈称神真，贪味甘美，种种无端。 六品因人休否，假称正神，责望天人，受取无厌，啖食无度。 七品魔魅众生，游行世界，或作邪歌鬼语，自称道神，伺人衰厄，妄言占相。 八品众生触法邪见，一心背真入伪，承事鬼神形像，师巫之徒。 九品淫乱宗亲，生邪苦想，行不正法。 十品弃正法，往入魔径邪道，共唝嗃欺诱天人，自称贤圣，放荡非法，阴私逆顺，为人咒誓，魇祷国王，指天画地，杀害众生，真伪无别，以称天真。 夫如斯者，自取十苦八难，集因为恶，烦恼中生，涂炭九幽，执罚无生。 吾开飞天无量之恩，普拔生死一切罪因，同得免脱十邪恶道之根，普登十方，长存福天，身受威光，永超法轮。 无上飞天法轮转十邪恶道上品玉章颂曰： 眇眇飞天堂，焕朗曜上清。 景王降宝乘，策驾十道场。 但见诸邪道，堕坠地狱中。 洋铜以灌口，裸身剑树峰。 巨天飞刀割，铁锥刺心肝。 饥餐流火精，负石践刀山。 不见福乐处，唯闻涂炭声。 仰观十正道，形光负圆明。 安坐宝林内，妙相自然生。 高上转法轮，普度诸邪形。 开津五道界，超步南陵庭。 身诣玉池炼，宝光身中生。 飘飘太虚上，三匝礼真经。 天尊告道君曰：是玉章镇於十方飞天云明上宫，十方丹童玉女各十真保赏灵文，常随法轮转运诵其章，转度十邪道诸场，以解天人积滞之苦，普入法门者也。 天人有知其章者，思念存亡之苦，斋而诵之，苦魂即得超神十方矣。 天尊告道君曰：吾开法轮十正道诸场，上品本行之首，夫广幽理显，有是业力，但澄真甚难物色，不淳受学者精集，因至道玄象者希，合道应真，其理微简，可谓自然，九万劫一降，尔议思焉，吾开真宝，转运法轮，劫灾不动，天地存焉。 天尊言：法轮开十正道诸场，一品远恶离邪道，观行无为，通建福因，执心明争，不行阴贼。 二品寻真求道，信向大经，持诫入法，通行阴德。 三品不邪不伪，常行正法，一心守道。 四品爱念众生，常得安存，同入法轮。 五品慈念万物，恭敬国王，普天隆盛，三宝弘化。 六品修学上道，舍身弃世，一无假想滞惑。 七品起动乘诫，言无假说。 八品开导天人，流畅法音，广宣道教，增广无量。 九品万范同正，普弘十方，慈善一切。 十品法轮开张，普度天人，众生同庆，皆入正道，执心刚明者也。 夫是十正道上品，唯有上德至人，能行之矣。 吾开十方无量法门，普济无偏，一入正道，去邪日远，道真无上，与法结缘者焉。 无上飞天法轮开十正道上品玉章颂曰： 紫虚勃烟，中有玄台。 流明琼阙，七宝自然。 焕朗十方，弥覆诸天。 无上法轮，转度十方。 正道明开，元皇符命。 飞天至真，浮空称善。 玉帝侍身，左右金童。 历观诸缘，玄化大运，齐真道前。 天尊告道君曰：是玉章镇於无上金真玄宫，十方金童玄女各十真保赏灵文，常随大运转十方正道法轮，诵其章，声参十方，九天元皇叉手以称庆，无上玉皇稽首作礼，即大光法门，以度诸天，无极世界，万兆一切众生，悉得身登十正道福堂，皆合道真矣。",
      "translated_text": "The Heavenly Worthy spoke: When the Dharma Wheel opens to deliver the beings in the realms of the Ten Deviant and Evil Paths, those of the first grade turn their backs on the true and enter the ghostly path, their entire lives born into perverse demonic influences, forever afflicted by manifold illnesses and sufferings, receiving retribution without end. Those of the second grade lightly defile the Dao and its Dharma, entering deviant paths, believing and following perverse speech, slandering the Dao and deceiving their masters. Those of the third grade do not believe in the true Dao, casting aside their bodies to become ghostly specters. Those of the fourth grade, deluded by ignorance and inverted views, beings constantly harbor the Five Turbidities, clinging to demonic influences, falsely claiming sacred names to disrupt the true Dao. Those of the fifth grade constantly engage in killing and harming, offering licentious sacrifices to ghosts and demons, fraudulently claiming to be divine and true, gluttonously craving rich flavors, committing boundless transgressions. Those of the sixth grade exploit others’ fortunes and misfortunes, falsely claiming to be true deities, making demands of heavenly and mortal beings, insatiably receiving and devouring without restraint. Those of the seventh grade, demonically possessed beings roaming the world, sometimes singing perverse songs or speaking ghostly tongues, falsely claiming to be Dao deities, lying in wait for others’ misfortunes to recklessly speak of divination and omens. Those of the eighth grade, beings who encounter the Dharma yet cling to deviant views, wholeheartedly turn their backs on the true to embrace the false, serving the forms and images of ghosts and spirits, following the ways of shamans and sorcerers. Those of the ninth grade engage in licentious acts with clan kin, harboring perverse and suffering thoughts, practicing unorthodox Dharma. Those of the tenth grade abandon the true Dharma, entering demonic paths and deviant ways, colluding to deceive and lure heavenly and mortal beings, falsely claiming to be sages and saints, indulging in lawless debauchery, concealing their perverse and rebellious acts, cursing and swearing at others, casting hexes and praying to harm kings, pointing to heaven and drawing on earth, killing and harming beings, making no distinction between true and false, yet claiming to be heavenly and true. Such beings bring upon themselves the Ten Sufferings and Eight Calamities, accumulating causes for evil, born amidst afflictions, mired in the Nine Dark Realms, enduring punishments without end.\n\nI now open the boundless mercy of the Flying Heaven, universally liberating all karmic causes of birth and death, enabling all to escape the roots of the Ten Deviant and Evil Paths, universally ascending the Ten Directions, eternally abiding in the Heaven of Blessings, their bodies receiving majestic radiance, forever transcending the Dharma Wheel.\n\nThe Jade Hymn of the Supreme Flying Heaven Dharma Wheel Turning the Ten Deviant and Evil Paths, Upper Grade, proclaims:\n\nVast and distant, the Flying Heaven’s hall,\nResplendent and radiant, illuminating the Supreme Clarity.\nThe King of Scenery descends in a precious chariot,\nGuiding the ten Dharma realms.\nYet all see the deviant paths,\nPlunging into hell’s abyss.\nMolten bronze poured into mouths,\nNaked bodies upon sword-tree peaks.\nGiant heavenly flying blades sever,\nIron awls pierce hearts and livers.\nHungry, they feast on flowing fire’s essence,\nBearing stones, they tread upon knife mountains.\nNo sight of blessed joy,\nOnly the cries of torment and filth.\nGazing upward at the Ten True Paths,\nTheir forms radiant with perfect clarity.\nSeated serenely within jeweled groves,\nWondrous marks naturally arise.\nOn high, the Dharma Wheel turns,\nUniversally delivering all deviant forms.\nOpening the ford of the Five Paths’ realms,\nTranscending to the Southern Mound’s court.\nTheir bodies refine in the Jade Pool,\nPrecious radiance born within.\nSoaring through the Great Void,\nThrice circling to venerate the true scriptures.\n\nThe Heavenly Worthy addressed the Dao Lord: This Jade Hymn is enshrined in the Flying Heaven’s Cloud Radiance Upper Palace of the Ten Directions. Ten Perfected Youths and Jade Maidens of each direction guard and reward the numinous text, constantly following the Dharma Wheel’s turning to recite this hymn, delivering the beings in the realms of the Ten Deviant Paths, thereby dissolving the accumulated sufferings of heavenly and mortal beings, universally guiding them into the Dharma gates. If heavenly and mortal beings know this hymn, contemplating the sufferings of life and death, fasting and reciting it, their suffering souls shall immediately transcend to the divine realms of the Ten Directions.\n\nThe Heavenly Worthy addressed the Dao Lord: I now open the Dharma Wheel of the Ten True Paths’ realms, the foremost of the upper grade’s fundamental practices. Though the profound is made manifest, it is by the power of karma. Yet to clarify the true is exceedingly difficult; beings do not purely receive the teachings, and those who concentrate their essence to attain the mysterious symbols of the supreme Dao are rare. Those who harmonize with the Dao and respond to the true—its principle is subtle and refined, verily called natural. Once in ninety thousand kalpas it descends; ponder this deeply. I now open the true treasure, turning the Dharma Wheel, so that kalpic disasters remain unmoved and heaven and earth endure.\n\nThe Heavenly Worthy spoke: When the Dharma Wheel opens the realms of the Ten True Paths, those of the first grade distance themselves from evil and depart from deviant ways, observing and practicing non-action, establishing blessed causes, maintaining a luminous and resolute mind, refraining from hidden malice. Those of the second grade seek the true and pursue the Dao, believing in and turning toward the great scriptures, upholding precepts and entering the Dharma, universally practicing hidden virtues. Those of the third grade are neither deviant nor false, constantly practicing the true Dharma, wholeheartedly guarding the Dao. Those of the fourth grade cherish and care for all beings, constantly attaining peace and abiding together within the Dharma Wheel. Those of the fifth grade compassionately regard the myriad things, revering the king, universally flourishing the heavens, broadly propagating the Three Treasures. Those of the sixth grade cultivate and study the supreme Dao, relinquishing the body and abandoning the world, utterly without false thoughts or stagnant delusions. Those of the seventh grade arise and act in accordance with precepts, their words devoid of falsehood. Those of the eighth grade guide heavenly and mortal beings, flowing and spreading the Dharma’s sound, broadly proclaiming the Dao’s teachings, infinitely expanding them. Those of the ninth grade universally rectify the myriad models, broadly propagating the Ten Directions, compassionately benefiting all. Those of the tenth grade, as the Dharma Wheel opens and expands, universally deliver heavenly and mortal beings, all rejoicing together, entering the true path, their minds resolute and luminous.\n\nSuch are the upper grades of the Ten True Paths, which only those of the highest virtue and utmost personhood can practice. I now open the boundless Dharma gates of the Ten Directions, universally and impartially delivering all. Once entering the true path, deviance daily recedes, the supreme truth of the Dao unmatched. Those who form affinities with the Dharma, thus it is.\n\nThe Jade Hymn of the Supreme Flying Heaven Dharma Wheel Opening the Ten True Paths, Upper Grade, proclaims:\n\nWithin the purple void’s surging mist,\nThere stands a mysterious terrace.\nFlowing radiance and jade towers,\nSeven treasures naturally arise.\nResplendent and radiant in the Ten Directions,\nPervading and covering all heavens.\nThe supreme Dharma Wheel,\nTurns to deliver the Ten Directions.\nThe true path clearly opens,\nThe Primordial Sovereign’s mandate aligns.\nThe Flying Heaven’s perfected,\nFloat in the void, extolling goodness.\nJade Thearchs attend their forms,\nGolden youths to left and right.\nSurveying all conditions,\nThe great workings of mysterious transformation,\nAll equal before the true Dao.\n\nThe Heavenly Worthy addressed the Dao Lord: This Jade Hymn is enshrined in the Supreme Golden Perfection Mysterious Palace. Ten Golden Youths and Mystic Maidens of each direction guard and reward the numinous text, constantly following the great turning of the Ten Directions’ true Dharma Wheel, reciting this hymn, its sound pervading the Ten Directions. The Primordial Sovereign of the Nine Heavens clasps hands in celebration, the Supreme Jade Thearch bows in reverence. Thus is the Great Radiance Dharma Gate, delivering all heavens, the boundless worlds, and the myriad multitudes of all beings, enabling all to ascend the Blessed Hall of the Ten True Paths, universally harmonizing with the true Dao.",
      "overlap_context": "aven and earth, their names and forms becoming paths, falsely generating unrighteousness, licentiousness, and deviant qi. Born without virtuous teachings, they inevitably face severe judgment in death, their bodies enduring eons of dismemberment, cycling through birth and death, forever dwelling in blind paths. Their lives end in perverse speech, illness, and suffering, ultimately returning to the Eight Gates. I now open the Dharma gates to universally turn them back to the Perfected of the Dao.",
      "start_char": 6223,
      "end_char": 7500,
      "start_sentence": 205,
      "end_sentence": 255,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.232771158218384,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝诚业本行上品妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "诸天大圣至真有知其章，斋而诵者，皆得开度众生诸苦，亦可保劫不动，安固灵根者焉。 天尊告道君日：吾开法轮十转诸场，上品无量至真之本业，自非法轮，莫能转焉。 存真守道，以期斯众，自始一劫以来，得道者皆入法门，修学上德，位极至真，未见安豪守贵，而望生天者矣。 吾观十方众生，执结甚多，财宝虽贵，终不能使人得道，聚积珍宝，必有余殃，安贫乐道，其实宝真，道成之日，道主降兆矣。 身披九光宝帔，七色飞罗之裙，头戴通天宝冠，足着玉文狮子之履，项负双炎天光，上盖流明宝盖，身登七宝之辇，驾乘金龙，超越无上道界，郁郁羽仪，威光芳饬，梵行太虚，左右天真，手把十绝灵旛，诸天各各奉献自然妓乐，烧香散华，弥翳十方，众真下降迎兆，玉清天宝受位、长存金真。 当尔之时，实自乐焉。 斯人皆是安贫守道，使得如然，世绪华盛，不足贪乎。",
      "translated_text": "The great sages and perfected beings of all heavens who know this hymn, perform purification rites and recite it, may all deliver beings from manifold sufferings, and also preserve the kalpa from disruption, firmly securing their numinous root.\n\nThe Heavenly Worthy addressed the Dao Lord: In my turning of the Dharma Wheel through ten revolutions across all realms, the supreme and boundless foundation of the perfected beings’ original karma cannot be set in motion without the Dharma Wheel. Those who preserve truth and uphold the Dao, awaiting this assembly—from the beginning of this kalpa to the present—all who attain the Dao enter the Dharma Gate, cultivate and study the highest virtue, and ascend to the rank of the utmost perfected. Never have I seen one who, clinging to ease and arrogantly guarding wealth, yet hopes to be reborn in heaven.\n\nI observe that beings throughout the Ten Directions are deeply entangled in attachments. Though wealth and treasures are esteemed, they ultimately cannot enable one to attain the Dao. Hoarding precious treasures will surely bring lingering misfortune, while embracing poverty and delighting in the Dao—this is the true treasure. On the day the Dao is accomplished, the Lord of the Dao will manifest signs.\n\nClad in a nine-rayed treasure mantle and a seven-hued flying silk skirt, wearing a Heaven-piercing treasure crown upon the head and jade-embroidered lion slippers upon the feet, with twin flames of celestial light upon the neck, a canopy of flowing luminous treasure above, ascending a seven-jeweled palanquin, riding a golden dragon—thus do they transcend the supreme Dao realms. Resplendent in feathered regalia, their majestic radiance and fragrant adornments pervade the void. With heavenly perfected ones to left and right, they grasp the Ten Absolute Spirit Banners. All heavens offer up spontaneous celestial music, burning incense and scattering flowers, suffusing the Ten Directions. The host of perfected beings descends to welcome the signs, receiving the rank of Heavenly Treasure in the Jade Clarity Realm, eternally abiding in Golden Perfection.\n\nAt that time, true joy is theirs. Such persons are those who embraced poverty and upheld the Dao, thereby attaining this state. How could the fleeting glory of worldly prosperity be worth coveting?",
      "overlap_context": "us text, constantly following the great turning of the Ten Directions’ true Dharma Wheel, reciting this hymn, its sound pervading the Ten Directions. The Primordial Sovereign of the Nine Heavens clasps hands in celebration, the Supreme Jade Thearch bows in reverence. Thus is the Great Radiance Dharma Gate, delivering all heavens, the boundless worlds, and the myriad multitudes of all beings, enabling all to ascend the Blessed Hall of the Ten True Paths, universally harmonizing with the true Dao.",
      "start_char": 7500,
      "end_char": 7847,
      "start_sentence": 256,
      "end_sentence": 262,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.209035396575928,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝诚业本行上品妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "身役十恶，财即散焉，巨亿之财，终为毒门。 吾开法轮，普告十方，飞天至真，开度十方，无量世界，一切众生，咸得成就斋功十转真人矣。 天尊言：法轮开十转至真诸场，一品受持诫者，即为地仙； 能修行法诫，转位入第二品中，得为游仙； 倍向正心者，转位入第三品中，得为仙人； 奉行诫业者，转位入第四品中，得为飞仙； 常从经诫，不犯众行者，转位入第五品中，得为灵仙； 绝口断贪味，长斋谓经执诫者，转位入第六品中，得为神仙； 若能无色贪欲，平等行诸功德，舍心抱素者，转位入第七品中，得为真仙； 建心广念十方，常行救厄，口无过行，济物无偏者，转位入第八品中，得为飞天真人； 守一不动，持行万善，敬念法诫，常如对神者，转位入第九品中，得为太上真人； 恒能餐霞饮炁，苦行修道，谓经行香，朝真开化十方，普济无量众生，惠润天地，常无怠倦者，转位入第十品中，得为无上上清真人者也。 夫物自无心耳，但能行八诫者， 以得十方飞天齐功，况於持十诫业本行也。 但末劫众生，惟能破诫，岂有能修者乎。 夫人五浊，粗行甚多，至人受持，以将拟终身之宝，粗人受取； 以望世之高位，破灭十善之行，自以拟长还十恶之道，但夫人自负道，非道负人矣，未见有心者求而不得焉。 无上金真法轮十转上品玉章颂曰： 大囿开化，上有宝城，玄虚而治，元一洞明，八方玉树，七宝罗生，灵风应节，众音和声，中有法轮，号曰法王，高上所宝，玉皇高尊，金真妙德，降下飞天，历观十方，无量罪因，转度上品，拔诸苦缘，身免十恶，得入法门，形脱锋刃，爽得真仙，十转无上，妙通自然，至真诸场，长存道真。 无上金真诫业历观十方妙通玉章颂曰： 游观诸天，中有三罗，铁网八据，流火飞车，锋刃楚挞，万痛交行，头首分裂，苦哉自伤，一生一死、轮转恶场，泣涕流血，无复人形，涂炭弥劫，不识命根，命命相对，种种相牵，十善闲静，萧条十天，衣层无为，救诸无缘，金真开法，普放威光，流激天地，照明十方，演诚度人，业力大功，十苦解脱，沐浴金容，通觉本行，三罗豁通，高上转位，身登宝宫，上朝道主，稽首三周。 无上金真诫业本行上品玉章颂曰： 云明郁秀，流焕十方，金晨映发，荫蔼玉堂，七宝凝结，八会澄灵，玄覆三象，自然霐清，天光朗彻，普照诸形，元始万行，诫业为宗，把持法轮，弘化诸功，无量本行，万范因缘，至真通称，众法灵根，乘虚蹑空，与之通津，元皇上宝，故镇法轮，三界开道，驾景紫烟，羽盖垂覆，上谒天尊。 天尊告道君曰：是三偈玉章，镇於无上大有玉都，无上金真童子万二千真保赏灵文，常随劫运转十方诸天十转真人上品法轮。 方诵其章，灵音激响，十方无极世界诸天高真一时设礼，无上至真称善，法王告召，普开法门，品度万生，皆得道真。 诸天大圣至真有知其章，斋而诵之者，十方天真降下，六时朝矣，万结官散，不久道成焉。 天尊告道君曰：吾开无上金真法轮，诫业本行十二无量上品因缘，轮转妙通至真诸场，斯经上业，无所不通，普为法轮，灌顶众渊，十方轮转，开度无量万生罪恶，入诸福场。 金真诫行，致得长存，其道高妙，普救无穷，飞天上宝，不传诸仙，自然应运，其文洞焕，无所不通矣。",
      "translated_text": "Those who serve the ten evils shall see their wealth scatter—even vast fortunes of hundreds of millions become but a gateway to poison.\n\nI now turn the Wheel of the Dharma, proclaiming to the ten directions. Flying immortals and perfected beings open the path to salvation across the ten directions, in boundless worlds, for all sentient beings, that they may perfect the merit of the Tenfold Cyclic Fast and attain the rank of True Persons of the Tenth Transformation.\n\nThe Heavenly Worthy declares: When the Wheel of the Dharma opens the realms of the Tenfold Cyclic Perfected, those who receive and uphold the precepts in the first rank become Earth Immortals. Those who cultivate the precepts and practices, advancing to the second rank, become Wandering Immortals. Those who double their resolve and rectify their minds, advancing to the third rank, become Immortals. Those who uphold the precepts and their karmic duties, advancing to the fourth rank, become Flying Immortals. Those who constantly follow the scriptures and precepts, transgressing no conduct, advancing to the fifth rank, become Spirit Immortals. Those who abstain from gluttony, maintain perpetual fasting, and steadfastly uphold the precepts, advancing to the sixth rank, become Divine Immortals. Those who renounce sensual desire, practice equanimity in all meritorious deeds, and embrace purity with an unclinging heart, advancing to the seventh rank, become True Immortals. Those who set their minds on broadly contemplating the ten directions, constantly aiding those in distress, speak no wrongful words, and relieve beings without partiality, advancing to the eighth rank, become Flying Heavenly True Persons. Those who guard the One without wavering, perform myriad good deeds, revere the precepts as if facing the gods, advancing to the ninth rank, become Supreme True Persons. Those who perpetually consume the radiance and drink the qi, endure austerities in Daoist cultivation, recite scriptures and burn incense, enlighten the ten directions, universally save boundless beings, and bestow blessings upon heaven and earth without weariness, advancing to the tenth rank, become Supreme Shangqing True Persons.\n\nAll things are inherently without intent; those who practice the Eight Precepts may yet achieve the merit of the flying immortals of the ten directions—how much more so those who uphold the Ten Precepts and their fundamental practices! Yet in this final kalpa, beings only break the precepts; who among them can truly cultivate? Mortals, steeped in the Five Turbidities, commit countless coarse deeds. When they receive and uphold the precepts, they treat them as lifelong treasures, while the coarse-minded seize them in hopes of worldly exaltation. They destroy the practice of the Ten Good Deeds, turning instead to the path of the Ten Evils. It is not the Dao that fails humanity, but humanity that fails the Dao. Never has one with true intent sought and not attained.\n\nThe *Jade Hymn of the Supreme Golden Perfection Wheel of the Tenfold Cyclic Upper Rank* proclaims:\n\nThe Great Garden unfolds transformation,\nAbove lies a jeweled city,\nGoverned by the Mysterious Void,\nIllumined by the Primal Unity.\nJade trees of the eight directions,\nSeven treasures arrayed in birth,\nSpirit winds attune to the seasons,\nAll sounds harmonize in voice.\nWithin stands the Wheel of the Dharma,\nCalled the Dharma King,\nCherished by the Most High,\nExalted by the Jade Emperor.\nGolden Perfection’s wondrous virtue\nDescends with the flying immortals,\nSurveying the ten directions,\nCountless karmic causes of sin.\nTransforming the upper ranks,\nDelivering from all苦缘,\nThe body escapes the ten evils,\nEnters the Dharma gate,\nThe form eludes the blade’s edge,\nJoyfully attains True Immortality.\nTenfold cyclic, supreme,\nWondrously penetrating the natural,\nIn the realms of the Perfected,\nEternally abiding in the Dao’s truth.\n\nThe *Jade Hymn of the Supreme Golden Perfection Precepts and Practices, Surveying the Ten Directions and Penetrating the Mysteries* proclaims:\n\nRoaming the heavens,\nWithin lie the Three Nets,\nIron webs in eightfold array,\nFlaming chariots and flying blades,\nScourging whips and lashes,\nMyriad pains conjoined.\nHeads split asunder,\nWoe! Self-inflicted wounds.\nOne birth, one death,\nRevolving in evil realms,\nTears and blood flowing,\nNo longer human in form.\nMired in suffering for kalpas,\nUnknowing of life’s root,\nLives face one another,\nEntangled in myriad ways.\nThe Ten Good Deeds, serene and still,\nDesolate the ten heavens.\nClothed in the layered Non-Action,\nThey save the hopeless.\nGolden Perfection opens the Dharma,\nUniversally radiating majestic light,\nFlowing through heaven and earth,\nIllumining the ten directions.\nExpounding sincerity to deliver beings,\nThe power of karmic merit is vast.\nThe ten sufferings dissolve,\nBathed in the golden countenance.\nAwakening to the fundamental practice,\nThe Three Nets part and clear.\nAdvancing in the supreme ranks,\nThe body ascends to the jeweled palace,\nTo pay homage to the Lord of the Dao,\nBowing thrice in reverence.\n\nThe *Jade Hymn of the Supreme Golden Perfection Precepts, Practices, and Fundamental Conduct of the Upper Rank* proclaims:\n\nClouds luminous and lush,\nRadiant across the ten directions,\nGolden dawn’s glow arises,\nShading the jade halls.\nSeven treasures congeal,\nEight assemblies purify the spirit,\nThe Mysterious covers the Three Images,\nNaturally limpid and clear.\nHeavenly light shines brightly,\nUniversally illuminating all forms.\nThe Primal Beginning’s myriad practices,\nTake the precepts and deeds as their foundation.\nGrasping the Wheel of the Dharma,\nVastly transforming all merits,\nBoundless fundamental conduct,\nMyriad models of karmic conditions.\nThe Perfected universally named,\nThe spiritual root of all dharmas.\nRiding the void, treading the empty,\nCommuning with the ford.\nThe Primal August’s supreme treasure,\nThus establishes the Wheel of the Dharma.\nOpening the Dao of the Three Realms,\nMounting the purple mist,\nFeathered canopies draped in cover,\nAscending to meet the Heavenly Worthy.\n\nThe Heavenly Worthy addressed the Lord of the Dao, saying: These three jade hymns are enshrined in the Supreme Great Possession’s Jade Capital. The twelve thousand Perfected Guardians of the Supreme Golden Perfection Youths eternally follow the kalpic revolutions, turning the Wheel of the Tenfold Cyclic True Persons of the Upper Rank across the ten directions of all heavens.\n\nWherever these hymns are recited, their numinous tones resound with clarity. In the boundless worlds of the ten directions, the exalted perfected of all heavens simultaneously perform obeisance. The Supreme Perfected praise their excellence. The Dharma King proclaims the opening of the Dharma gates, bestowing ranks to deliver myriad beings, that all may attain the truth of the Dao.\n\nIf the great sages and perfected beings of all heavens know these hymns and recite them with fasting, the perfected of the ten directions will descend, paying homage six times daily. Myriad karmic obstructions dissolve, and soon the Dao is perfected.\n\nThe Heavenly Worthy addressed the Lord of the Dao, saying: I now open the Supreme Golden Perfection Wheel of the Dharma, the fundamental practices of the precepts, and the twelve boundless upper-rank karmic conditions. Revolving through the wondrously penetrating realms of the Perfected, this scripture’s supreme merit is universally efficacious. As the Wheel of the Dharma, it pours the consecrated waters upon the abysses of beings, turning across the ten directions to open salvation for boundless beings mired in sin, guiding them into the fields of blessings.\n\nThe precepts and practices of Golden Perfection ensure eternal abiding. Their Dao is lofty and wondrous, universally saving without end. The supreme treasure of the flying immortals is not transmitted to ordinary immortals. It naturally responds to the kalpic revolutions, its text resplendently luminous, universally efficacious.",
      "overlap_context": "pirit Banners. All heavens offer up spontaneous celestial music, burning incense and scattering flowers, suffusing the Ten Directions. The host of perfected beings descends to welcome the signs, receiving the rank of Heavenly Treasure in the Jade Clarity Realm, eternally abiding in Golden Perfection.\n\nAt that time, true joy is theirs. Such persons are those who embraced poverty and upheld the Dao, thereby attaining this state. How could the fleeting glory of worldly prosperity be worth coveting?",
      "start_char": 7847,
      "end_char": 9115,
      "start_sentence": 263,
      "end_sentence": 290,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.3130578994751,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝诚业本行上品妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "天地运化，皆由法轮，其功无上，自非上德至人，莫能奉焉。 上圣转位，以成高真，悉从其文。 万恶回善，解滞拔苦，除罪降福，皆由是经。 广济十方，弘教诸天，其德大通，其道普真，运驾三乘，度诸无量。 吾演是经，以付子之奉行，九劫一降，飞天玉庭，依品开度，不以为难矣。 天尊告道君曰：吾开无上飞天法轮上品诸场，以拟五浊之劫。 一品十方无极世界灾兵杀伐浊； 二品劫运短促，日月亏盈浊； 三品阴阳逆顺，星宿失度，万物不生浊； 四品五方鬼兵交会，杀害天人无量生亡浊； 五品国政凶乱天人，兵甲烦恼浊者矣。 子若见此五浊之世，善当依法轮之品，开度转运，保固万品，咸使天地、日月、星宿各复其位，安镇万国，皆得存焉。 天尊告道君曰：吾开无上飞天法轮上品诸场，以拟三灾之劫，转度十方无极世界万生，皆使得免脱劫难，故以三乘宝藏以度之矣。 一品劫火流行，三界同然； 二品洪水激溢，八极溟合，涌波滔天； 三品暴风弥劫，震裂冲天，十方沦没，万无一遗。 此是大运应期，名曰三灾； 如是之时，子勤用心转法轮，开三乘上品，以度天人之灾，咸使安存，得见太真。 天尊告道君曰； 隐显六尘，触视玄根，魔气形色，听者空生，云门晨昏，夕翳身心，不存物想，最苦招祸。 神童知者不动，彼恶自伤，非法所行，伪黠相同，万善一弃，终身莫及，害一对十，万劫无生，手杀与想，同况於伐人命乎。 金真上品诫业，善当从之矣，万称之由，本行为先也。 天尊告道君曰：夫转法轮开度上品，当用金龙十枚，各重一两，以镇十方，纹缯各随方，东方碧纹九尺，南方绛纹三尺，西方白纹七尺，北方皂纹五尺，四维紫纹各八尺，上方青纹丈二，下方黄纹丈四，十方香案香炉各十枚。 建坛法依三元涂炭，礼谢皆法三元拔罪品，三、重然灯，外坛方各十灯，中坛 方各八灯，上坛方各九灯，皆如法品。 三宝镇坛，三日三夜，法众行香诵经，发露大谢，转飞天法轮明科，以开度十方万生罪根滞苦，十恶诸场，咸使迁进十方飞天无量福堂矣。 天尊告道君曰：夫天人修真上道，可自依法修建，是法开度十方幽广生死苦魂，并及祖考诸罪，皆得转度十福堂也。 若见天地运度，亦当建是大功； 若见日月亏盈，亦当修建是斋； 星宿错度，亦当修建是斋； 诸天国土不宁，亦当修建是斋； 天下鬼兵兴乱，万兆死亡，阴阳不调，亦当修建是斋； 师徒厄急，命过之日，亦当修建是斋者也。 夫是法轮上品斋业，无量大功，十方得道，莫不从之，以得至真诸场。 上圣修行是功，转位得为金真，诸天修建是斋，真仙自然开度万生，普弘法门。 生死因缘，皆由法轮，其法高妙，无上所宝，九劫一转，天地洞明，无量生死，齐得福庆，光明十方，普得长存。 夫天人上德至人有知其法，受持开化法门，修建是功者，道真克成矣。 天尊言：法轮上品，运载十方，无上至真妙道诫业，普会无穷，玄觉一切，无，量本行，万范因缘，洞观天地，普入法门。 业恶行恶，沉形九夜者，吾转法轮，咸使得仙，众生反化，以生人天。 法轮运道，九万劫一传，自非高上玉皇之俦，莫能降真。 吾今相告，封着中宫，谛受奉行，须拟劫灾，依法上品，转度诸天，十方无极世界，一切万生，同得法缘，普见大光开运，觉观道真。",
      "translated_text": "The revolutions of Heaven and Earth all proceed through the Wheel of the Dharma; its merit is supreme, and none but those of utmost virtue and perfected persons may uphold it. The exalted sages ascend in rank to become lofty Perfected Ones, all through its scripture. The myriad evils turn to goodness, obstructions dissolve, suffering is uprooted, sins are eradicated, and blessings descend—all through this sutra. It broadly saves the ten directions, propagates the teachings across the heavens; its virtue is greatly penetrating, its Dao universally true. It drives the three vehicles to ferry boundless beings. I expound this sutra to entrust you with its observance. Once in nine kalpas it descends to the Jade Court of the Flying Immortals, where beings are opened and delivered according to their ranks—this is no difficult task.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: I open the supreme Wheel of the Flying Immortals’ upper-rank realms to counter the five turbid kalpas. The first rank: the ten directions’ boundless worlds beset by calamities of war, slaughter, and turbidity. The second rank: the kalpic cycle shortened, the sun and moon waning and waxing in turbidity. The third rank: yin and yang in inversion and disorder, the stellar lodges losing their degrees, the myriad things failing to grow in turbidity. The fourth rank: the five directions’ demonic armies converging, slaughtering and harming boundless heavenly and human beings in turbidity of life and death. The fifth rank: the governance of nations in chaos, heavenly and human beings in turmoil, weapons and afflictions in turbidity.\n\nWhen you witness these five turbid ages, you should rightly rely on the ranks of the Wheel of the Dharma to open, deliver, and revolve, securing and stabilizing the myriad ranks. Thus shall Heaven and Earth, the sun and moon, and the stellar lodges each return to their proper positions, pacifying and settling the myriad nations, all of which shall abide.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: I open the supreme Wheel of the Flying Immortals’ upper-rank realms to counter the three calamitous kalpas, delivering the ten directions’ boundless worlds and myriad beings, all of whom shall be spared from kalpic tribulations. Thus do I employ the three vehicles’ treasure store to ferry them. The first rank: the kalpic fire flowing through the Three Realms. The second rank: the deluge surging and overflowing, the eight poles merging into one, waves surging to the heavens. The third rank: the violent winds raging for kalpas, shattering and piercing the heavens, the ten directions sinking, not one spared.\n\nThese are the great revolutions responding to the kalpic cycles, called the Three Calamities. At such times, you must diligently apply your mind to turn the Wheel of the Dharma, opening the three vehicles’ upper ranks to deliver heavenly and human beings from calamity, ensuring all abide in peace and behold the Great Perfected.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: The six dusts of concealment and manifestation, the mysterious roots touched by sight and hearing, the demonic qi of forms and colors, the emptiness arising in listeners—cloud gates at dawn and dusk, evening veils upon body and mind, the failure to preserve thoughts of things—these are the most bitter harbingers of misfortune. The divine youths who know remain unmoved; those evils harm themselves. What is not of the Dharma is practiced, deceit and cunning alike. A single abandonment of the myriad virtues is irrecoverable for a lifetime. Harming one repays tenfold; for ten thousand kalpas, there is no rebirth. To kill with the hand or with thought—how much more so to take a life? The upper-rank precepts and karmic practices of Golden Perfection must be rightly followed. The ten thousand praises all arise from conduct as their foundation.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: To turn the Wheel of the Dharma and open the upper ranks for deliverance, one must use ten golden dragons, each weighing one tael, to stabilize the ten directions. The patterned silks should correspond to each direction: nine feet of azure-patterned silk for the east, three feet of crimson-patterned silk for the south, seven feet of white-patterned silk for the west, five feet of black-patterned silk for the north, eight feet of purple-patterned silk for each of the four corners, twelve feet of blue-patterned silk for the upper direction, and fourteen feet of yellow-patterned silk for the lower direction. Ten incense tables and ten incense burners are placed in the ten directions.\n\nThe altar is constructed according to the Three Primes’ method of smearing ashes. The rites of repentance and thanksgiving follow the Three Primes’ method for removing sins. Lamps are lit in three tiers: ten lamps on each side of the outer altar, eight lamps on each side of the middle altar, and nine lamps on each side of the upper altar, all according to the ritual ranks. The Three Treasures stabilize the altar. For three days and three nights, the Dharma assembly burns incense, recites the sutra, confesses and repents, and turns the Wheel of the Flying Immortals’ luminous statutes to open and deliver the ten directions’ myriad beings from the roots of sin, obstructions, and suffering. The ten evils and all realms are thus enabled to advance into the ten directions’ Flying Immortals’ boundless halls of blessings.\n\nThe Heavenly Worthy addressed the Dao Lord, saying: When heavenly and human beings cultivate the supreme Dao and the Way of Perfection, they may rely on this Dharma to establish and practice it. This Dharma opens and delivers the ten directions’ vast and obscure suffering souls in the cycle of life and death, as well as the sins of ancestors, all of whom shall be turned and delivered to the halls of the ten blessings. When you witness the revolutions of Heaven and Earth, you should establish this great merit. When you witness the sun and moon waning and waxing, you should perform this fast. When the stellar lodges lose their degrees, you should perform this fast. When the lands of the heavens and nations are unsettled, you should perform this fast. When demonic armies arise in the world, myriad deaths occur, and yin and yang are disharmonious, you should perform this fast. When master and disciple face crises or the day of passing, you should perform this fast.\n\nThis upper-rank fast of the Wheel of the Dharma’s merit is boundless. All who attain the Dao in the ten directions do so through it, thereby reaching the realms of the utmost Perfected. The exalted sages who cultivate this merit ascend in rank to become Golden Perfected. The heavens’ Perfected Ones who establish this fast naturally open and deliver the myriad beings, universally propagating the Dharma gate. The causes and conditions of life and death all proceed through the Wheel of the Dharma. Its Dharma is lofty and wondrous, treasured beyond all else. Once in nine kalpas it revolves, illuminating Heaven and Earth. The boundless cycles of life and death all attain blessings and felicity, their light shining across the ten directions, universally abiding in perpetuity.\n\nWhen heavenly and human beings of utmost virtue and perfected persons know this Dharma, receive, uphold, and propagate its gate of transformation, and cultivate this merit, they shall surely accomplish the Dao and attain Perfection.\n\nThe Heavenly Worthy said: The upper-rank Wheel of the Dharma carries the ten directions, the supreme, utmost Perfected, wondrous Dharma of precepts and practices. It universally gathers the boundless, awakens all to the mysterious, and perceives the boundless foundational practices and the myriad karmic conditions. It penetrates and observes Heaven and Earth, universally entering the Dharma gate. Those whose karmic and bodily actions are evil, sinking into the nine nights—when I turn the Wheel of the Dharma, all shall attain immortality. Beings reverse their transformations to be reborn in the heavens and among humans. The Wheel of the Dharma revolves the Dao; once in ninety thousand kalpas it is transmitted. None but the exalted companions of the Jade Emperor may descend as Perfected Ones. I now tell you this, sealing it in the Central Palace. Receive and uphold it faithfully. When kalpic calamities approach, rely on the upper-rank Dharma to turn and deliver the heavens, the ten directions’ boundless worlds, and all myriad beings, all of whom shall share in the Dharma’s conditions, universally beholding the great light that opens the revolutions, awakening and perceiving the Perfected Dao.",
      "overlap_context": "ted waters upon the abysses of beings, turning across the ten directions to open salvation for boundless beings mired in sin, guiding them into the fields of blessings.\n\nThe precepts and practices of Golden Perfection ensure eternal abiding. Their Dao is lofty and wondrous, universally saving without end. The supreme treasure of the flying immortals is not transmitted to ordinary immortals. It naturally responds to the kalpic revolutions, its text resplendently luminous, universally efficacious.",
      "start_char": 9115,
      "end_char": 10378,
      "start_sentence": 291,
      "end_sentence": 331,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.528138875961304,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝诚业本行上品妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "其功广明，弘道三乘，众法之母，至真之尊，普为十方之光景，是为天地万道之宗。 其福无上，湛然长存，大劫方降，普见道真，普度众生，皆登十方，常住福天。 尔受法王上位，勤当用心。 於是道君即起，叉手作礼，奉受金真法轮诫业本行上品。 事竟，元一天尊勑诸大圣众策驾而去，诸天复位，亿劫长存。 道言：吾受无上金真法轮诫业本行，长存上品，无量因缘，自从洞明劫始已来，开运度十方无极世界无量恒沙众生生死苦魂，回化十恶，拔诸罪根，解罗出滞，烦恼诸场，咸得同诣玉池炼形，冠带宝服光明，十住福堂。 其功随运而转，自非玄觉，莫能降焉，其文旧典万道势讫，其道方行，晨晖八会，当是其时，云明下降，以保劫灾，若有福德之国，先得道真者矣。 太上洞玄灵宝诫业本行上品妙经竟",
      "translated_text": "Its merit broadly illuminates, magnifying the Dao of the Three Vehicles—the Mother of all dharmas, the Most Perfect and Exalted—universally serving as the radiance and reflection of the ten directions, the宗 of all the myriad Dao of heaven and earth. Its blessings are supreme, abiding in serene constancy; when the great kalpa descends, all shall behold the Perfected Dao, universally delivering beings, all of whom ascend to the ten directions, eternally dwelling in the Heaven of Blessings.\n\nYou, who receive the supreme position of Dharma King, must apply your mind with diligence.\n\nThereupon, the Dao Lord arose, clasped his hands in reverence, and received the Golden Perfected Dharma Wheel’s *Precepts of Karmic and Bodily Actions, Upper Rank*. When the affair was concluded, the Primordial Heavenly Worthy commanded the assembly of great sages to harness their chariots and depart; the hosts of heaven returned to their positions, enduring for a hundred million kalpas.\n\nThe Dao declared: I receive the supreme *Golden Perfected Dharma Wheel’s Precepts of Karmic and Bodily Actions, Upper Rank*, eternally abiding in the highest grade, boundless in karmic conditions. Since the dawn of the kalpic beginning, when the Wheel was set in motion, I have delivered the boundless worlds of the ten directions and the measureless, innumerable beings—suffering souls in the cycle of birth and death—reversing the ten evils, extracting the roots of all sins, untying the nets and freeing the obstructed, liberating them from the fields of affliction. All alike proceed to the Jade Pool to refine their forms, donning jeweled robes and luminous crowns, dwelling in the Hall of Ten Abodes of Blessing. Its merit turns with the revolutions; none but those of profound awakening may descend to it. The texts of the ancient canon, the *Ten Thousand Dao of Power*, are now complete. The Dao shall proceed forth, its morning radiance gathering in eight assemblies—this shall be the time when cloud-brightness descends to preserve against kalpic calamities. The lands of blessed virtue shall first attain the Perfected Dao.\n\nThus concludes the *Supreme Wondrous Scripture of the Upper Rank Precepts of Karmic and Bodily Actions from the Numinous Treasure of the Highest Cavern-Mystery*.",
      "overlap_context": "nsmitted. None but the exalted companions of the Jade Emperor may descend as Perfected Ones. I now tell you this, sealing it in the Central Palace. Receive and uphold it faithfully. When kalpic calamities approach, rely on the upper-rank Dharma to turn and deliver the heavens, the ten directions’ boundless worlds, and all myriad beings, all of whom shall share in the Dharma’s conditions, universally beholding the great light that opens the revolutions, awakening and perceiving the Perfected Dao.",
      "start_char": 10378,
      "end_char": 10697,
      "start_sentence": 332,
      "end_sentence": 339,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.328054428100586,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝诚业本行上品妙经.txt",
        "category": "本文类"
      }
    }
  ]
}