{
  "source_id": "太上三元赐福敖罪解厄消灾延生保命妙经",
  "source_file": "chunked_daozang\\太上三元赐福敖罪解厄消灾延生保命妙经.json",
  "total_chunks": 3,
  "total_original_chars": 3524,
  "total_translated_chars": 23276,
  "total_translation_time": 117.58835792541504,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏续道藏\\太上三元赐福敖罪解厄消灾延生保命妙经.txt",
    "category": "正统道藏续道藏"
  },
  "full_translation": "**The Supreme Three Primordials Scripture on Bestowing Blessings, Pardoning Sins, Resolving Calamities, Dispelling Disasters, Prolonging Life, and Preserving Destiny**\n\n**Scripture Title:** *The Supreme Three Primordials Scripture on Bestowing Blessings, Pardoning Sins, Resolving Calamities, Dispelling Disasters, Prolonging Life, and Preserving Destiny*\n(Author unknown, approximately dated to the Ming dynasty. Attributed to the Salvation-from-Suffering Great Immortal, who entreated the Heavenly Worthy and Dao Lord to expound the method of reciting scriptures and mantras to seek the Three Officials’ bestowal of blessings, pardon of sins, and resolution of calamities. One fascicle. Source: *Wanli Continuation of the Daoist Canon*.)\n\n---\n\n### *The Supreme Three Primordials Scripture on Bestowing Blessings, Pardoning Sins, Resolving Calamities, Dispelling Disasters, Prolonging Life, and Preserving Destiny*\n### *Precious Declarations and Mantras of the Three Officials*\n\nAll who recite this scripture must first purify themselves through abstinence, attire themselves with solemn dignity, compose their minds and regulate their *qi*, strike their teeth and modulate their voices, then recite with clarity. They must not engage in frivolous speech or idle conversation, but maintain reverence and focus, aligning every thought with devotion. Thus, their prayers and supplications shall naturally evoke response.\n\n**First, recite the *Mantra of Purifying the Mind*:**\n*Tai Shang’s Star of the Terrace, ever-responsive to change,*\n*Expels demons, binds specters, preserves life, and guards the body.*\n*Wisdom shines with clarity, the mind and spirit find peace.*\n*The three *hun* endure forever, the *po* never falter.*\n*Hasten! As the Law commands!*\n\n**Mantra of Purifying the Mouth:**\n*Cinnabar Mouth Spirit, expels filth and dispels miasma.*\n*Tongue Spirit rectifies order, connects life and nurtures spirit.*\n*Thousand-Tooth Spirit repels evil and guards the true.*\n*Throat Spirit, Mighty Tiger, guides *qi* and draws fluids.*\n*Heart Spirit, Cinnabar Origin, grants me communion with the true.*\n*Mind Spirit refines essence, the Dao’s *qi* endures forever.*\n*Hasten! As the Law commands!*\n\n**Mantra of Purifying the Body:**\n*Lingbao Heavenly Worthy, pacifies and comforts the body.*\n*Disciple’s *hun* and *po*, the five viscera’s mysteries.*\n*Azure Dragon, White Tiger, arrayed in splendid ranks.*\n*Vermilion Bird, Dark Warrior, attend and guard the form.*\n*Hasten! As the Law commands!*\n\n**Mantra of Pacifying the Local Earth Spirit:**\n*Yuanshi pacifies and stabilizes, proclaiming to the myriad spirits.*\n*True officials of mountains and rivers, earth deities and numina.*\n*Altars of soil to the left, altars of grain to the right—*\n*Let none dare cause reckless alarm.*\n*Turn toward the true Dao, within and without, all is serene.*\n*Each abides in its proper place, guarding home and hearth.*\n*The Supreme issues its decree, hunting down and seizing evil spirits.*\n*Dharma-protecting divine kings, safeguard the recitation of scriptures.*\n*Take refuge in the Great Dao, primal, prosperous, steadfast, and pure.*\n*Hasten! As the Law commands!*\n\n**Mantra of Purifying Heaven and Earth and Dispelling Filth:**\n*Within the cavern’s mystery, the vast and luminous Supreme Primordial.*\n*Mighty spirits of the eight directions, render me natural and free.*\n*Lingbao’s talismanic command, proclaimed to the Nine Heavens.*\n*Qianluo Taina, the cavern’s *gang* and Supreme Mystery.*\n*Slay demons, bind evil, annihilate ten thousand ghosts.*\n*The Zhongshan divine mantra, Yuanshi’s jade script.*\n*Recited once, it repels ghosts and prolongs life.*\n*Traversing the Five Peaks, known to the Eight Seas.*\n*Demon kings bow their heads, attending my chamber.*\n*Malevolence and filth dissolve, the Dao’s *qi* endures forever.*\n*Hasten! As the Law commands!*\n\n**Mantra of Offering Incense:**\n*The Dao arises from the study of the heart; the heart transmits through incense.*\n*Incense burns in the jade censer, the heart abides before the Emperor.*\n*The true numen gazes down, immortal banners descend to my hall.*\n*Now this servant petitions, directly reaching the Nine Heavens.*\n\n**Mantra of the Golden Light:**\n*Root of Heaven and Earth, origin of the myriad *qi*.*\n*Through eons of cultivation, I realize my divine power.*\n*Within and beyond the Three Realms, only I am supreme.*\n*My body radiates golden light, enveloping and illuminating me.*\n*Invisible to sight, inaudible to hearing,*\n*It embraces Heaven and Earth, nurturing all beings.*\n*Recite it ten thousand times, and the body shines with light.*\n*Attended by the Three Realms, welcomed by the Five Emperors.*\n*Myriad spirits pay homage, commanding thunder and lightning.*\n*Ghosts and demons lose their courage, spirits and monsters vanish.*\n*Within, thunder rumbles; the Thunder God conceals his name.*\n*Penetrating wisdom intermingles, the Five *Qi* surge.*\n*Golden light swiftly manifests, shielding the Perfected One.*\n*Hasten! As the Jade Emperor’s Radiant Descent commands!*\n\n**Verse for Opening the Scripture:**\n*Utterly still, it reaches the ultimate void,*\n*Towering through kalpas, vast and boundless.*\n*Profound and luminous, the cavern’s mystery—*\n*Who can fathom its depths?*\n*Entering the Great Vehicle’s path,*\n*Who reckons the kalpas’ span?*\n*Neither born nor destroyed,*\n*Yet born from the lotus.*\n*Transcending the Three Realms’ paths,*\n*Compassionate heart dissolves the world’s snares.*\n*The Perfected One’s supreme virtue—*\n*Lifetimes become immortal families.*\n\n**Hymn to the Three Officials:**\n*Bowing in reverence, I take refuge in Heaven, Earth, and Water,*\n*The Three Officials, Great Emperors of compassion.*\n*Their divine works and wondrous virtues are beyond thought—*\n*With wholehearted devotion, I bow in homage.*\n\n**Precious Declaration of the Upper Primordial Heavenly Official:**\n*With devoted heart, I bow in homage:*\n*In the Purple Tenuity Palace of the Primordial Yang within the Mysterious Capital, leading thirty-six bureaus and nine thousand myriad hosts, they examine the great thousandfold world, recording the registers of the ten directions’ lands. Their blessings extend to the myriad spirits; they oversee the ledgers of beings’ good and evil. Their grace pervades the Three Realms, determining the private matters of immortals’ ascent and descent. They dispel unforeseen calamities, resolve karmic misfortunes, liberate from the paths of life and death, and rescue from hidden suffering. All beings depend on them; the teeming creatures all find peace. Great compassion, great vows, great sage, great mercy—*\n*The Upper Primordial Nine *Qi* Bestower of Blessings, Heavenly Official of Radiant Yang, Supreme Primordial Great Emperor of the Purple Tenuity, Lord of the Purple Tenuity.*\n\n**Precious Declaration of the Middle Primordial Earthly Official:**\n*With devoted heart, I bow in homage:*\n*In the Northern Capital of the Azure Spirit’s Cavern Yang, leading forty-two bureaus and nine thousand myriad hosts, they govern the Three Realms, the ten directions, and the nine lands of Earth. They oversee the Five Peaks, the Eight Poles, and the four extremities, inhaling and exhaling *yin* and *yang*, managing the ledgers of men’s and women’s good and evil in azure and black. They nurture Heaven and Earth, reviewing the registers of beings’ fortunes and misfortunes. Their Dharma-source is vast, enabling escape from the Nine Glooms; their kalpas’ radiance endures, dissolving ten thousand sins. They are the parents of all beings, bestowing grace upon the living and the dead. Great compassion, great vows, great sage, great mercy—*\n*The Middle Primordial Seven *Qi* Pardoner of Sins, Earthly Official of the Cavern Spirit’s Azure Void, Great Emperor of the Azure Spirit.*\n\n**Precious Declaration of the Lower Primordial Water Official:**\n*With devoted heart, I bow in homage:*\n*In the Azure Flower Palace of the Primordial Cavern of Bestowed Valley, leading forty-two bureaus and nine thousand myriad hosts, they oversee the affairs of the myriad spirits of rivers and waters, the appointed times of great water disasters and kalpas. As Rectified Unity Dharma Kings, they manage the registers of ghosts and spirits in the long night of death. As Non-Action Teaching Masters, they record the causes of beings’ merits, transgressions, sins, and blessings. Above, they resolve Heaven’s calamities, delivering spirits whose karmic debts are fulfilled; below, they aid the hidden and confined, distinguishing the paths of humans and ghosts. Both the living and the dead find peace; their power to aid is inexhaustible. Great compassion, great vows, great sage, great mercy—*\n*The Lower Primordial Five *Qi* Resolver of Calamities, Water Official of the Golden Spirit’s Cavern *Yin*, Great Emperor of the Sunlit Valley.*\n\nThe *Precious Declarations of the Three Officials’ Mantras*\n*The Wondrous Scripture of the Most High Three Primordials on Bestowing Blessings, Pardoning Sins, Resolving Calamities, Dispelling Disasters, Prolonging Life, and Preserving Destiny*\n\nAt that time, the Great Immortal Who Saves from Suffering, dwelling in the Great Canopy Heaven upon the Nine *Qi* Purple Tenuity Heavenly Palace, addressed the Lord of the Dao, saying: “The Three Primordials have convened the Heavenly, Earthly, and Water Officials, along with the hosts of sagely officials from the Three Realms and Four Bureaus, the Examiners of Merit, and all the assembled immortals. Together they expound the scriptural Dharma to deliver sentient beings. Radiating great luminosity, they illumine the lands beneath Heaven—all the ten thousand states and nine provinces, the rivers, lakes, and seas, and the world of Jambudvīpa—where suffering beings dwell. These beings commit evil and forsake good, amass deep enmities, and engage in manifold insufficiencies. Their wealth exchanges are unclear, and they disrespect Heaven and Earth, the sun, moon, and Three Luminaries. They curse the wind and revile the rain, deceive spirits and destroy images, conceal from Heaven and deceive Earth, profane the sagely and worthy, and show no reverence for parents, uncles, aunts, or the six relations. They engage in licentiousness, theft, and depravity; they are disloyal and unfilial, improper and unrighteous. They sever the paths of kindness in past relations, disdain the Five Grains, and defile what is pure. They do not walk the upright Way, use large measures for taking and small for giving, openly deceive and secretly cheat, speak perverse words and crooked speech, utter white-mouthed curses, and harbor resentment toward Heaven and Earth. They neglect their own bodies and do not cultivate the slightest good. Heaven cannot contain them, Earth cannot bear them. Thus they engender vicious poisons, multiply pestilences, and invite litigations and disputes, from which there is no escape. The karmic causes they create bring these bitter retributions; calamities and adversities befall them, and there is no one to release them.”\n\nThereupon, the Great Immortal Who Saves from Suffering, holding his tablet, addressed the Three Primordial Heavenly Officials, saying: “Excellent! Excellent! These beings suffer the hardships of punishment and calamity. If there are good men and believing women who take refuge in the Three Primordials, observe the precepts, and complete three years of practice, reciting this scripture with devotion—twenty-five or fifty times, or one thousand five hundred times—eagerly repenting and confessing their transgressions, then the Lord of the Dao declares: ‘The Heavenly Official will bestow blessings, the Earthly Official will pardon sins, and the Water Official will resolve calamities.’”\n\nThereupon, the Three Primordials were informed, and the Heavenly Worthy immediately mounted a five-colored auspicious cloud, riding the nine *qi* of the pure wind to the Capital Assembly Prefecture. Upon Cloud Terrace Mountain, he radiated great light, manifesting boundless compassionate power and limitless Dharma displays to succor the people and save from suffering. The blessings respond to the myriad spirits; the gods of the heavens ascend and descend. They dispel unforeseen disasters, resolve enmities and transgressions, bestow the blessings of a thousand auspicious signs, and deliver from the nine calamities. They free beings from the sufferings of the Three Wretched Paths, ensuring health and peace for the foolish and dull. They erase original sins, uproot karmic entanglements, and forever dissolve transgressions. Both the living and the dead receive grace and escape suffering. The four kinds of birth and six paths of rebirth, hungry ghosts and destitute spirits, solitary and wild ghosts, the nine generations of ancestors and seven generations of forebears—those not yet freed from hell—all sentient beings, whether living or dead, bound in fetters, cangues, and chains, imprisoned and confined—\n\nOn the fifteenth day of the seventh month, the Earthly Official will remove the records of sins from the prisoners and suffering beings in hell. He will eradicate evil roots, strike names from the register of the dead, and inscribe them in the register of the living. Whether already summoned or not yet summoned, whether the summons has arrived or not, whether the case is already adjudicated or not yet adjudicated, whether the transgression is already discovered or not yet discovered—upon encountering this amnesty, all will be pardoned.”\n\nThe Earthly Official declared: “The Five Punishments and Ten Evils shall never be pardoned.”\n\nThe Heavenly Worthy said: “Like geese pecking at jujubes, like serpents’ fangs and tigers’ jaws, their hearts are like awls and knives. These venomous people, with ghostly eyes and ghostly hearts, devise cunning schemes and speak deceptive words. Deluded and foolish, what do these dullards know? They cut the flesh of others, unmindful of their poverty, thinking only of their own wealth, enriching their families and fattening their bodies. They scheme and contrive, only to entangle themselves. Their hearts take root, and the roots of their sins are hard to eradicate. Greedy for wealth and seeking personal gain, they invite the thunderous wrath of Heaven, the spread of pestilential *qi*, and the affliction of their bodies. Enmities and transgressions converge, extending even to their descendants.”\n\nThereupon, the Great Immortal Who Saves from Suffering again addressed the Heavenly Official. The Heavenly Official said: “If one recites this scripture to the full count of one thousand times, making great efforts and repenting transgressions, ceasing evil and cultivating good, then the Earthly Official will pardon all sins. All karmic offenses and transgressions will be entirely absolved. With sincere and earnest devotion, one wholly returns to the correct path. In a state of clarity and tranquility, the ears, eyes, and heart become settled; the spirit and soul are pacified; the essence and spirit return to their former state. Sins are extinguished, and blessings arise. The merit is immeasurable, and the blessings are boundless.”\n\nThe Lord of the Dao said: “The beings of the world invite pestilence and disaster; toxic *qi* spreads, and beings become afflicted. This is all due to committing evil and forsaking good, with enmities converging, thus engendering grave illnesses that linger and do not heal. If one recites this scripture, the illness will immediately be cured. If one recites this scripture on the days of the Dragon Boat Festival and the Middle Primordial, the Three Primordials will recall the hosts of pestilence-spreading spirits, examine the severity of their sins, and pardon them all.”\n\nThe Water Official said: “In the world, when husbands and wives are fated to encounter solitary stars or widowhood, or suffer harm and the severance of descendants, it is all due to their failure to practice generosity in past lives, and thus they receive this retribution in the present. If there are good men and believing women who, morning and evening, cherish stillness, bathe and burn incense, light lamps and recite scriptures, observe purification rituals and make offerings, repent and dissolve their karmic punishments—then they will give birth to upright and handsome sons, intelligent and wealthy children, whose names resound across the five lakes and four seas. For past and present lives, if they have committed errors—scheming for wealth and taking lives—then in this life, their children will repay the debt with their lives, transforming into wealth. If a woman is pregnant and does not perform the proper rituals on the third or fifth day, or if the child dies in the womb, or dies shortly after birth, or at three, six, or nine years of age, or at thirteen or fifteen, dying countless times in a single day and night—all this is due to the convergence of karmic enmities, the transformation of eyes into wealth, and the deception of property. They become beasts of burden. If there are good men and believing women who resolve to give alms, observe purification rituals, bathe, recite this scripture, and repent their transgressions, then their offenses will be forever released, the paths of humans and ghosts will be distinguished, childbirth will be without difficulty, and mother and child will both be safe. The baleful stars will not inflict harm, and the child will grow to adulthood, benefiting both parents. The power of this scripture is profoundly vast. Pray for blessings, and blessings will arrive; avert misfortune, and misfortune will vanish. Enemies will melt like ice, and creditors of past lives will naturally dissolve. The solitary spirits and all the hosts—the nine generations of ancestors, seven generations of forebears, the four kinds of birth, six paths of rebirth, those trapped in the cycles of life and death, and those not yet freed from hell—all sentient beings, whether living or dead, bound in fetters, cangues, and chains, imprisoned and confined—\n\nThe Earthly Official will erase their names from the registers of the dead and inscribe them in the registers of the living. Those already summoned and those not yet summoned, those whose summons has arrived and those whose has not, those whose cases are adjudicated and those whose are not, those whose transgressions are discovered and those whose are not—upon encountering this amnesty, all will be pardoned. They will ascend to the Eastern Ultimate Heavenly Realm, enter the Gate of Salvation from Suffering, and cultivate well upon the Earth of Salvation from Suffering. There is only heaven, no hell. Upon seeing them, King Yama dare not raise his voice. The divine youths and yakṣas clench their fists in respect; the Ox-Head and Horse-Face all take refuge. The eighteen layers of hell become realms of carefree wandering; the thirty-three heavens become palaces of freedom. Transcending the bounds of heaven, there is no sound of hell. Emerging from hell, they forever leave suffering behind, directly ascending to the realms of humans and gods, transcending to the Pure Land. Joy is boundless; coming and going, they are without hindrance or obstruction.”\n\nThe Water Official declares: Among the myriad beings under heaven, when stars and constellations move inauspiciously, when fate lingers and delays, when baleful stars converge and clash, many suffer from illnesses. Some are afflicted by pestilence, others by dysentery and sores, or by swelling, poisons, scabies, and leprosy. Some are stricken by seasonal qi, throat obstructions, or wind-toxin in the throat; others by diarrhea, wind-phlegm, or ancestral tomb miasma. Some are harmed by the fengshui of their dwelling’s foundation, or by false masters who corrupt the sacred. Others suffer from fiery eyes, consumption, vomiting blood, or gu poison; some from curses and hexes, or from blades, fire, and theft. Some are plagued by madness, drowning, or hanging; others by fetters, stagnant gates, or miasmic obstructions. Some are oppressed by inauspicious years, months, days, or hours; others by the felling of altars, temples, or trees. Some are harmed by digging graves or disturbing the earth, or by opening foundations or ponds. Others suffer from renovations, new constructions, or malaria and rashes; some from pestilential fire or miasma, or from official summons and slander. These misfortunes breed malignant illnesses that entangle beings, leading to death and ruin.\n\nYet if one recites this sutra, malignant illnesses will not cling, auspicious stars will guard, baleful stars will disperse, and ten thousand calamities will vanish forever. A thousand blessings will gather like clouds, the sutra will reach the royal realm, and fortune will descend upon the world.\n\nThe Heavenly Worthy speaks: Among the myriad beings under heaven, those who traverse rivers, lakes, and seas by boat—merchants and travelers—face surging waves and are filled with dread and fear. If one recites this sutra and takes refuge in the Water Officials of Heaven and Earth, the saints of the Water Palaces, the winds will grow still, the waves calm, the waterways safe, and the boats steady. Ropes and cables will hold firm, all endeavors will prosper, the myriad saints will protect, and the ten thousand spirits will bestow blessings.\n\nThen the Heavenly Worthy proclaimed this gatha:\nIn the Nine Qi of the Azure Heavens,\nThe sun, moon, and stars are true.\nThe Emperors of Heaven, Earth, and Water,\nWith clouds, thunder, and lightning follow.\nGolden youths hold flowered banners,\nJade maidens bear incense and blossoms.\nWithin five-colored auspicious clouds,\nRadiates the white light of the brow.\nIlluminating all under heaven,\nManifesting to save the multitude.\nAuspicious clouds and fragrant mists protect,\nDelivering from all suffering and hardship.\nRising clouds bring torrential rains,\nDriving thunder and flashing lightning.\nThe Dharma manifests boundless salvation,\nThe limitless, immeasurable Dharma.\nImmeasurably delivering beings,\nLimitless, immeasurable light.\nShining forth for all souls,\nAll vengeful ghosts.\nFully liberated from hell,\nAll living and deceased beings,\nAll freed from suffering and hardship.\n\nThereupon, the Heavenly Worthy concluded the sutra. If one recites this sutra, merit will arise according to one’s effort. Offering water and flowers, blessings will naturally respond. Where this sutra resides, the household will be luminous, and disasters will not intrude. Carrying this sutra, the myriad spirits will protect, malevolent ghosts will be forever vanquished, and one’s thoughts will never be in vain. Blessings will arise naturally, divine power will uphold, and responses will follow one’s words.\n\nThis sutra contains one thousand six hundred and seventy-five characters. Each character holds true meaning, each sentence dissolves transgressions, each line eradicates sins, and each scroll bestows blessings.\n\nAll the Heavenly Emperors, the saints of the Three Realms and the Ten Directions, upon hearing this sutra, rejoiced greatly. They received and upheld it with faith, paid homage, and withdrew.\n\nThus concludes the *Wondrous Sutra of the Most High Three Primordials for Bestowing Blessings, Pardoning Sins, Resolving Calamities, Prolonging Life, and Preserving Destiny*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上三元赐福赦罪解厄消灾延生保命妙经 经名：太上三元赐福赦罪解厄消灾延生保命妙经。 撰人不详，约出於明代。 假托救苦大仙请天尊道君说诵经念咒，求三官赐福赦罪解厄之法。 一卷。 底本出处：《万历续道藏》。 太上三元赐福赦罪解厄消灾延生保命妙经 三官诸咒宝诰 凡诵经者，切须斋戒，严整衣冠，诚心定气，叩齿演音，然后朗诵，慎勿轻慢交谈接语，务在端肃，念念无违，随愿祷祝，自然感应。 先念浄心神咒 太上台星，应变无停。 驱邪缚魅，保命护身。 智慧明净，心神安宁。 三魂永久，魄无丧倾。 急急如律令！ 浄口神咒 丹朱口神，吐秽除氛。 舌神正伦，通命养神。 罗千齿神，却邪卫真。 喉神虎贲，炁神引津。 心神丹元，令我通真。 思神炼液，道炁长存。 急急如律令！ 浄身神咒 灵宝天尊，安慰身形。 弟子魂魄，五脏玄冥。 青龙白虎，队仗纷纭。 朱雀玄武，侍卫身形。 急急如律令！ 安土地神咒 元始安镇，普告万灵。 岳渎真官，土地祇灵。 左社右稷，不得妄惊。 回向正道，内外澄清。 各安方位，备守家庭。 太上有命，搜捕邪精。 护法神王，保卫诵经。 皈依大道，元亨利贞。 急急如律令！ 浄天地解秽咒 洞中玄虚，晃朗太元。 八方威神，使我自然。 灵宝符命，普告九天。 乾罗苔那，洞罡太玄。 斩妖缚邪，杀鬼万千。 中山神咒，元始玉文。 吾诵一遍，却鬼延年。 按行五岳，八海知闻。 魔王束首，侍卫我轩。 凶秽消荡，道炁长存。 急急如律令！ 祝香咒 道由心学，心假香传。 香爇玉炉，心存帝前。 真灵下盻，仙旆临轩。 今臣关告，径达九天。 金光神咒 天地之宗，万炁本根。 广修万劫，证吾神通。 三界内外，惟吾独尊。 体有金光，覆映吾身。 视之不见，听之不闻。 包罗天地，养育群生。 受持万遍，身有光明。 三界侍卫，五帝司迎。 万神朝礼，役使雷霆。 鬼妖丧胆，精怪亡形。 内有霹雳，雷神隐名。 洞慧交彻，五炁腾腾。 金光速现，覆护真人。 急急如玉皇光降律令勑。 开经偈 寂寂至无宗，虚峙劫仞阿。 豁落洞玄文，谁测此幽遐。 一入大乘路，孰计年劫多。 不生亦不灭，欲生因莲花。 超凌三界途，慈心解世罗。 真人无上德，世世为仙家。 三官颂 稽首皈命天地水，三官大帝慈悲主。 神功妙德不思议，谨运一心皈命礼。 上元天官宝诰 志心皈命礼，玄都元阳紫微宫中，部三十六曹，偕九千万众，考较大千世界之内，录籍十方国土之中，福被万灵，主众生善恶之籍，恩覃三界，致诸仙升降之私，除无妄之灾，解释宿殃，脱生死之趣，救拔幽苦，群生是赖，蠢动咸康，大悲大愿大圣大慈上元九炁赐福天官曜灵元阳大帝紫微帝君。 中元地官宝诰 志心皈命礼，青灵洞阳北都宫中，部四十二曹，偕九千万众，主管三界十方九地，掌握五岳八极四维，吐纳阴阳，窍男女善恶青黑之籍，慈育天地，考众生录籍祸福之名，法源浩大，而能离九幽，浩劫垂光，而能消万罪，群生父母，存殁沾恩，大悲大愿大圣大慈中元七炁赦罪地官洞灵青虚大帝青灵帝君。 下元水官宝诰 志心皈命礼，赐谷洞元青华宫中，部四十二曹，偕九千万众，掌管江河水帝万灵之事，水灾大会劫数之期，正一法王，掌长夜死魂鬼神之籍，无为教主，录众生功过罪福之由，上解天灾，度业满之灵，下济幽扃，分人鬼之道，存亡皆泰，力济无穷，大悲大愿大圣大慈下元五炁解厄水官金灵洞阴大帝旸谷帝君。",
      "translated_text": "**The Supreme Three Primordials Scripture on Bestowing Blessings, Pardoning Sins, Resolving Calamities, Dispelling Disasters, Prolonging Life, and Preserving Destiny**\n\n**Scripture Title:** *The Supreme Three Primordials Scripture on Bestowing Blessings, Pardoning Sins, Resolving Calamities, Dispelling Disasters, Prolonging Life, and Preserving Destiny*\n(Author unknown, approximately dated to the Ming dynasty. Attributed to the Salvation-from-Suffering Great Immortal, who entreated the Heavenly Worthy and Dao Lord to expound the method of reciting scriptures and mantras to seek the Three Officials’ bestowal of blessings, pardon of sins, and resolution of calamities. One fascicle. Source: *Wanli Continuation of the Daoist Canon*.)\n\n---\n\n### *The Supreme Three Primordials Scripture on Bestowing Blessings, Pardoning Sins, Resolving Calamities, Dispelling Disasters, Prolonging Life, and Preserving Destiny*\n### *Precious Declarations and Mantras of the Three Officials*\n\nAll who recite this scripture must first purify themselves through abstinence, attire themselves with solemn dignity, compose their minds and regulate their *qi*, strike their teeth and modulate their voices, then recite with clarity. They must not engage in frivolous speech or idle conversation, but maintain reverence and focus, aligning every thought with devotion. Thus, their prayers and supplications shall naturally evoke response.\n\n**First, recite the *Mantra of Purifying the Mind*:**\n*Tai Shang’s Star of the Terrace, ever-responsive to change,*\n*Expels demons, binds specters, preserves life, and guards the body.*\n*Wisdom shines with clarity, the mind and spirit find peace.*\n*The three *hun* endure forever, the *po* never falter.*\n*Hasten! As the Law commands!*\n\n**Mantra of Purifying the Mouth:**\n*Cinnabar Mouth Spirit, expels filth and dispels miasma.*\n*Tongue Spirit rectifies order, connects life and nurtures spirit.*\n*Thousand-Tooth Spirit repels evil and guards the true.*\n*Throat Spirit, Mighty Tiger, guides *qi* and draws fluids.*\n*Heart Spirit, Cinnabar Origin, grants me communion with the true.*\n*Mind Spirit refines essence, the Dao’s *qi* endures forever.*\n*Hasten! As the Law commands!*\n\n**Mantra of Purifying the Body:**\n*Lingbao Heavenly Worthy, pacifies and comforts the body.*\n*Disciple’s *hun* and *po*, the five viscera’s mysteries.*\n*Azure Dragon, White Tiger, arrayed in splendid ranks.*\n*Vermilion Bird, Dark Warrior, attend and guard the form.*\n*Hasten! As the Law commands!*\n\n**Mantra of Pacifying the Local Earth Spirit:**\n*Yuanshi pacifies and stabilizes, proclaiming to the myriad spirits.*\n*True officials of mountains and rivers, earth deities and numina.*\n*Altars of soil to the left, altars of grain to the right—*\n*Let none dare cause reckless alarm.*\n*Turn toward the true Dao, within and without, all is serene.*\n*Each abides in its proper place, guarding home and hearth.*\n*The Supreme issues its decree, hunting down and seizing evil spirits.*\n*Dharma-protecting divine kings, safeguard the recitation of scriptures.*\n*Take refuge in the Great Dao, primal, prosperous, steadfast, and pure.*\n*Hasten! As the Law commands!*\n\n**Mantra of Purifying Heaven and Earth and Dispelling Filth:**\n*Within the cavern’s mystery, the vast and luminous Supreme Primordial.*\n*Mighty spirits of the eight directions, render me natural and free.*\n*Lingbao’s talismanic command, proclaimed to the Nine Heavens.*\n*Qianluo Taina, the cavern’s *gang* and Supreme Mystery.*\n*Slay demons, bind evil, annihilate ten thousand ghosts.*\n*The Zhongshan divine mantra, Yuanshi’s jade script.*\n*Recited once, it repels ghosts and prolongs life.*\n*Traversing the Five Peaks, known to the Eight Seas.*\n*Demon kings bow their heads, attending my chamber.*\n*Malevolence and filth dissolve, the Dao’s *qi* endures forever.*\n*Hasten! As the Law commands!*\n\n**Mantra of Offering Incense:**\n*The Dao arises from the study of the heart; the heart transmits through incense.*\n*Incense burns in the jade censer, the heart abides before the Emperor.*\n*The true numen gazes down, immortal banners descend to my hall.*\n*Now this servant petitions, directly reaching the Nine Heavens.*\n\n**Mantra of the Golden Light:**\n*Root of Heaven and Earth, origin of the myriad *qi*.*\n*Through eons of cultivation, I realize my divine power.*\n*Within and beyond the Three Realms, only I am supreme.*\n*My body radiates golden light, enveloping and illuminating me.*\n*Invisible to sight, inaudible to hearing,*\n*It embraces Heaven and Earth, nurturing all beings.*\n*Recite it ten thousand times, and the body shines with light.*\n*Attended by the Three Realms, welcomed by the Five Emperors.*\n*Myriad spirits pay homage, commanding thunder and lightning.*\n*Ghosts and demons lose their courage, spirits and monsters vanish.*\n*Within, thunder rumbles; the Thunder God conceals his name.*\n*Penetrating wisdom intermingles, the Five *Qi* surge.*\n*Golden light swiftly manifests, shielding the Perfected One.*\n*Hasten! As the Jade Emperor’s Radiant Descent commands!*\n\n**Verse for Opening the Scripture:**\n*Utterly still, it reaches the ultimate void,*\n*Towering through kalpas, vast and boundless.*\n*Profound and luminous, the cavern’s mystery—*\n*Who can fathom its depths?*\n*Entering the Great Vehicle’s path,*\n*Who reckons the kalpas’ span?*\n*Neither born nor destroyed,*\n*Yet born from the lotus.*\n*Transcending the Three Realms’ paths,*\n*Compassionate heart dissolves the world’s snares.*\n*The Perfected One’s supreme virtue—*\n*Lifetimes become immortal families.*\n\n**Hymn to the Three Officials:**\n*Bowing in reverence, I take refuge in Heaven, Earth, and Water,*\n*The Three Officials, Great Emperors of compassion.*\n*Their divine works and wondrous virtues are beyond thought—*\n*With wholehearted devotion, I bow in homage.*\n\n**Precious Declaration of the Upper Primordial Heavenly Official:**\n*With devoted heart, I bow in homage:*\n*In the Purple Tenuity Palace of the Primordial Yang within the Mysterious Capital, leading thirty-six bureaus and nine thousand myriad hosts, they examine the great thousandfold world, recording the registers of the ten directions’ lands. Their blessings extend to the myriad spirits; they oversee the ledgers of beings’ good and evil. Their grace pervades the Three Realms, determining the private matters of immortals’ ascent and descent. They dispel unforeseen calamities, resolve karmic misfortunes, liberate from the paths of life and death, and rescue from hidden suffering. All beings depend on them; the teeming creatures all find peace. Great compassion, great vows, great sage, great mercy—*\n*The Upper Primordial Nine *Qi* Bestower of Blessings, Heavenly Official of Radiant Yang, Supreme Primordial Great Emperor of the Purple Tenuity, Lord of the Purple Tenuity.*\n\n**Precious Declaration of the Middle Primordial Earthly Official:**\n*With devoted heart, I bow in homage:*\n*In the Northern Capital of the Azure Spirit’s Cavern Yang, leading forty-two bureaus and nine thousand myriad hosts, they govern the Three Realms, the ten directions, and the nine lands of Earth. They oversee the Five Peaks, the Eight Poles, and the four extremities, inhaling and exhaling *yin* and *yang*, managing the ledgers of men’s and women’s good and evil in azure and black. They nurture Heaven and Earth, reviewing the registers of beings’ fortunes and misfortunes. Their Dharma-source is vast, enabling escape from the Nine Glooms; their kalpas’ radiance endures, dissolving ten thousand sins. They are the parents of all beings, bestowing grace upon the living and the dead. Great compassion, great vows, great sage, great mercy—*\n*The Middle Primordial Seven *Qi* Pardoner of Sins, Earthly Official of the Cavern Spirit’s Azure Void, Great Emperor of the Azure Spirit.*\n\n**Precious Declaration of the Lower Primordial Water Official:**\n*With devoted heart, I bow in homage:*\n*In the Azure Flower Palace of the Primordial Cavern of Bestowed Valley, leading forty-two bureaus and nine thousand myriad hosts, they oversee the affairs of the myriad spirits of rivers and waters, the appointed times of great water disasters and kalpas. As Rectified Unity Dharma Kings, they manage the registers of ghosts and spirits in the long night of death. As Non-Action Teaching Masters, they record the causes of beings’ merits, transgressions, sins, and blessings. Above, they resolve Heaven’s calamities, delivering spirits whose karmic debts are fulfilled; below, they aid the hidden and confined, distinguishing the paths of humans and ghosts. Both the living and the dead find peace; their power to aid is inexhaustible. Great compassion, great vows, great sage, great mercy—*\n*The Lower Primordial Five *Qi* Resolver of Calamities, Water Official of the Golden Spirit’s Cavern *Yin*, Great Emperor of the Sunlit Valley.*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1357,
      "start_sentence": 0,
      "end_sentence": 86,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.380091428756714,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\太上三元赐福敖罪解厄消灾延生保命妙经.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "三官诸咒宝诰 太上三元赐福赦罪解厄消灾延生保命妙经 尔时救苦大仙，在大罗天上、九炁紫微天宫，上白道君曰：集会三元天地水官，三界四府众圣曹官，考较司同诸仙众，讲说经法，救拔众生，放大光明，照见天下，万国九州之地，江河湖海之内，阎浮世界之中，受苦众生，造恶非善，广结冤雠，多行不足#1，财交不明，不敬天地、日月三光，呵风骂雨，欺神灭像，瞒天昧地，亵渎圣贤，不敬父母、叔伯六亲，奸盗邪淫，不忠不孝，非礼非义，断绝往来恩路，不敬五谷，秽污遭贱，不行正道，大斗小秤，明瞒暗骗，横言曲语，白口咒诅，怨天恨地，不恤己身，不修片善，天不容，地不载，致生恶毒，多起瘟，多招讼非，轻重难逃，故作事因，得此苦报，恶难临身，无虏解释。 於是救苦大仙，端简上告三元天官曰：善哉善哉，此等众生，遭刑苦 难。 若有善男信女，皈依三元斋戒，三年圆满，命道转诵此经，二五十遍，千五百遍，踊跃忏悔、悔过愆尤。 道君曰：即有天官赐福，地官赦罪，水官解厄。 於是告下三元，天尊即驾五色祥云，行九炁清风至都会府，云台山上，放大毫光，广大惠力，无边法显，济民救苦、福应万灵，诸天升降，除无妄之灾，解有雠之愆，赐千祥之福，脱九厄之难，离三途之苦，痴蠢康泰，削去原罪，拔除冤根，永消愆尤，父母存亡，沾恩离苦，四生六道，饿鬼穷魂，孤魂野鬼，九玄七祖，未离地狱之中，存亡众生，杻械枷锁，囹圄闭塞。 於是地官至七月十五日，即与狱囚地狱受苦众生除罪簿，灭恶根，削死名，上生籍，已去提，未去提，已提至，末提至，已结证，未结证，已发觉，未发觉觉，逢赦除之。 地官曰：五刑十恶等，永不赦除。 天尊言：雁入嚼入龃音咀龉音语，蛇牙虎口，心如锥刀，恶毒之人，鬼眼鬼心，多计巧言，唝瞒痴愚，蠢子何知，割他肉，不念他贫，只念己富，肥家润身，使心用心，返累己身，心根结成，罪根难灭，贪财利己，天雷霹雳，瘟气流传，缠害身体，冤愆相并，并及子孙。 於是救苦大仙，再告天官。 天官曰：转诵此经，至满千遍，大作踊跃，悔过愆尤，断恶修善，即有地官赦罪，所有恶孽愆尤，俱一赦除，心心忐音恳忑音祷，尽一皈正，恍恍惚惚，耳目心定，神魂安静，精神伏旧，罪灭福生，无量功德，其福无边。 道君曰：世间众生，招瘟惹灾，毒气流行，众生染着，偕是造恶非善，冤雠相并，致生恶疾，淹延未愈。 若诵此经，病即痊愈。 若诵经者，至端阳中元之日，即有三元追回行瘟等众，考较轻重等罪，俱一赦除。 水官曰：世间夫妇，命犯孤辰寡，刑害绝嗣，皆是前生不施，今生受之。 若有善男信女。 晨夕好静，沐浴烧香，燃灯诵经，修斋布施，悔过消刑，便生端正有相之男，聪明富贵之子，声镇五湖四海。 宿世今生，故作误为，谋财负命，今世为儿，取命化财，女人妊娠，三朝五日不行分，或在身儿亡，生下儿亡，三六九岁儿亡，十三五岁儿亡，一日一夜，万死万生，俱是冤愆相临，化目化财，骗协财物，化为畜生。 若有善男信女，发心施财，斋戒#2沐浴，转诵此经，悔过愆尤，即使愆尤永释，人鬼分离，产生无难，母子双全，关煞无刑，生长成人，利益双亲，经力弘深，祈福福至，禳祸祸消，雠人冰泮，冤家债主，自消自灭，孤魂等众，九玄七祖四生六道，轮回生死，出离地狱，即往东极天界，救苦门庭救苦地上好修行，只有天堂无地狱，阎王一见，不敢高声，童子夜叉，擎拳拱手，牛头马面，总尽皈依，一十八重地狱，狱狱逍遥，三十三天天宫，宫宫自在，超生天之境，即无地狱之声，出离地狱，永离苦难，径往人天，超生浄土，快乐无量，一去一来，无挂无碍。",
      "translated_text": "The *Precious Declarations of the Three Officials’ Mantras*\n*The Wondrous Scripture of the Most High Three Primordials on Bestowing Blessings, Pardoning Sins, Resolving Calamities, Dispelling Disasters, Prolonging Life, and Preserving Destiny*\n\nAt that time, the Great Immortal Who Saves from Suffering, dwelling in the Great Canopy Heaven upon the Nine *Qi* Purple Tenuity Heavenly Palace, addressed the Lord of the Dao, saying: “The Three Primordials have convened the Heavenly, Earthly, and Water Officials, along with the hosts of sagely officials from the Three Realms and Four Bureaus, the Examiners of Merit, and all the assembled immortals. Together they expound the scriptural Dharma to deliver sentient beings. Radiating great luminosity, they illumine the lands beneath Heaven—all the ten thousand states and nine provinces, the rivers, lakes, and seas, and the world of Jambudvīpa—where suffering beings dwell. These beings commit evil and forsake good, amass deep enmities, and engage in manifold insufficiencies. Their wealth exchanges are unclear, and they disrespect Heaven and Earth, the sun, moon, and Three Luminaries. They curse the wind and revile the rain, deceive spirits and destroy images, conceal from Heaven and deceive Earth, profane the sagely and worthy, and show no reverence for parents, uncles, aunts, or the six relations. They engage in licentiousness, theft, and depravity; they are disloyal and unfilial, improper and unrighteous. They sever the paths of kindness in past relations, disdain the Five Grains, and defile what is pure. They do not walk the upright Way, use large measures for taking and small for giving, openly deceive and secretly cheat, speak perverse words and crooked speech, utter white-mouthed curses, and harbor resentment toward Heaven and Earth. They neglect their own bodies and do not cultivate the slightest good. Heaven cannot contain them, Earth cannot bear them. Thus they engender vicious poisons, multiply pestilences, and invite litigations and disputes, from which there is no escape. The karmic causes they create bring these bitter retributions; calamities and adversities befall them, and there is no one to release them.”\n\nThereupon, the Great Immortal Who Saves from Suffering, holding his tablet, addressed the Three Primordial Heavenly Officials, saying: “Excellent! Excellent! These beings suffer the hardships of punishment and calamity. If there are good men and believing women who take refuge in the Three Primordials, observe the precepts, and complete three years of practice, reciting this scripture with devotion—twenty-five or fifty times, or one thousand five hundred times—eagerly repenting and confessing their transgressions, then the Lord of the Dao declares: ‘The Heavenly Official will bestow blessings, the Earthly Official will pardon sins, and the Water Official will resolve calamities.’”\n\nThereupon, the Three Primordials were informed, and the Heavenly Worthy immediately mounted a five-colored auspicious cloud, riding the nine *qi* of the pure wind to the Capital Assembly Prefecture. Upon Cloud Terrace Mountain, he radiated great light, manifesting boundless compassionate power and limitless Dharma displays to succor the people and save from suffering. The blessings respond to the myriad spirits; the gods of the heavens ascend and descend. They dispel unforeseen disasters, resolve enmities and transgressions, bestow the blessings of a thousand auspicious signs, and deliver from the nine calamities. They free beings from the sufferings of the Three Wretched Paths, ensuring health and peace for the foolish and dull. They erase original sins, uproot karmic entanglements, and forever dissolve transgressions. Both the living and the dead receive grace and escape suffering. The four kinds of birth and six paths of rebirth, hungry ghosts and destitute spirits, solitary and wild ghosts, the nine generations of ancestors and seven generations of forebears—those not yet freed from hell—all sentient beings, whether living or dead, bound in fetters, cangues, and chains, imprisoned and confined—\n\nOn the fifteenth day of the seventh month, the Earthly Official will remove the records of sins from the prisoners and suffering beings in hell. He will eradicate evil roots, strike names from the register of the dead, and inscribe them in the register of the living. Whether already summoned or not yet summoned, whether the summons has arrived or not, whether the case is already adjudicated or not yet adjudicated, whether the transgression is already discovered or not yet discovered—upon encountering this amnesty, all will be pardoned.”\n\nThe Earthly Official declared: “The Five Punishments and Ten Evils shall never be pardoned.”\n\nThe Heavenly Worthy said: “Like geese pecking at jujubes, like serpents’ fangs and tigers’ jaws, their hearts are like awls and knives. These venomous people, with ghostly eyes and ghostly hearts, devise cunning schemes and speak deceptive words. Deluded and foolish, what do these dullards know? They cut the flesh of others, unmindful of their poverty, thinking only of their own wealth, enriching their families and fattening their bodies. They scheme and contrive, only to entangle themselves. Their hearts take root, and the roots of their sins are hard to eradicate. Greedy for wealth and seeking personal gain, they invite the thunderous wrath of Heaven, the spread of pestilential *qi*, and the affliction of their bodies. Enmities and transgressions converge, extending even to their descendants.”\n\nThereupon, the Great Immortal Who Saves from Suffering again addressed the Heavenly Official. The Heavenly Official said: “If one recites this scripture to the full count of one thousand times, making great efforts and repenting transgressions, ceasing evil and cultivating good, then the Earthly Official will pardon all sins. All karmic offenses and transgressions will be entirely absolved. With sincere and earnest devotion, one wholly returns to the correct path. In a state of clarity and tranquility, the ears, eyes, and heart become settled; the spirit and soul are pacified; the essence and spirit return to their former state. Sins are extinguished, and blessings arise. The merit is immeasurable, and the blessings are boundless.”\n\nThe Lord of the Dao said: “The beings of the world invite pestilence and disaster; toxic *qi* spreads, and beings become afflicted. This is all due to committing evil and forsaking good, with enmities converging, thus engendering grave illnesses that linger and do not heal. If one recites this scripture, the illness will immediately be cured. If one recites this scripture on the days of the Dragon Boat Festival and the Middle Primordial, the Three Primordials will recall the hosts of pestilence-spreading spirits, examine the severity of their sins, and pardon them all.”\n\nThe Water Official said: “In the world, when husbands and wives are fated to encounter solitary stars or widowhood, or suffer harm and the severance of descendants, it is all due to their failure to practice generosity in past lives, and thus they receive this retribution in the present. If there are good men and believing women who, morning and evening, cherish stillness, bathe and burn incense, light lamps and recite scriptures, observe purification rituals and make offerings, repent and dissolve their karmic punishments—then they will give birth to upright and handsome sons, intelligent and wealthy children, whose names resound across the five lakes and four seas. For past and present lives, if they have committed errors—scheming for wealth and taking lives—then in this life, their children will repay the debt with their lives, transforming into wealth. If a woman is pregnant and does not perform the proper rituals on the third or fifth day, or if the child dies in the womb, or dies shortly after birth, or at three, six, or nine years of age, or at thirteen or fifteen, dying countless times in a single day and night—all this is due to the convergence of karmic enmities, the transformation of eyes into wealth, and the deception of property. They become beasts of burden. If there are good men and believing women who resolve to give alms, observe purification rituals, bathe, recite this scripture, and repent their transgressions, then their offenses will be forever released, the paths of humans and ghosts will be distinguished, childbirth will be without difficulty, and mother and child will both be safe. The baleful stars will not inflict harm, and the child will grow to adulthood, benefiting both parents. The power of this scripture is profoundly vast. Pray for blessings, and blessings will arrive; avert misfortune, and misfortune will vanish. Enemies will melt like ice, and creditors of past lives will naturally dissolve. The solitary spirits and all the hosts—the nine generations of ancestors, seven generations of forebears, the four kinds of birth, six paths of rebirth, those trapped in the cycles of life and death, and those not yet freed from hell—all sentient beings, whether living or dead, bound in fetters, cangues, and chains, imprisoned and confined—\n\nThe Earthly Official will erase their names from the registers of the dead and inscribe them in the registers of the living. Those already summoned and those not yet summoned, those whose summons has arrived and those whose has not, those whose cases are adjudicated and those whose are not, those whose transgressions are discovered and those whose are not—upon encountering this amnesty, all will be pardoned. They will ascend to the Eastern Ultimate Heavenly Realm, enter the Gate of Salvation from Suffering, and cultivate well upon the Earth of Salvation from Suffering. There is only heaven, no hell. Upon seeing them, King Yama dare not raise his voice. The divine youths and yakṣas clench their fists in respect; the Ox-Head and Horse-Face all take refuge. The eighteen layers of hell become realms of carefree wandering; the thirty-three heavens become palaces of freedom. Transcending the bounds of heaven, there is no sound of hell. Emerging from hell, they forever leave suffering behind, directly ascending to the realms of humans and gods, transcending to the Pure Land. Joy is boundless; coming and going, they are without hindrance or obstruction.”",
      "overlap_context": "s, transgressions, sins, and blessings. Above, they resolve Heaven’s calamities, delivering spirits whose karmic debts are fulfilled; below, they aid the hidden and confined, distinguishing the paths of humans and ghosts. Both the living and the dead find peace; their power to aid is inexhaustible. Great compassion, great vows, great sage, great mercy—*\n*The Lower Primordial Five *Qi* Resolver of Calamities, Water Official of the Golden Spirit’s Cavern *Yin*, Great Emperor of the Sunlit Valley.*",
      "start_char": 1358,
      "end_char": 2797,
      "start_sentence": 87,
      "end_sentence": 107,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 51.537067890167236,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\太上三元赐福敖罪解厄消灾延生保命妙经.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "水官曰：天下众生，星辰不顺，运限迟留，凶曜冲并，多生疾病，或瘟病相侵，或痢疾疮毒相侵，或肿毒疥癞相 侵，气候喉相侵，咽喉风毒相侵，泄泻风痰相侵，祖冢瘟气相侵，住基风水相侵，邪师败圣相侵，火眼劳瘵相侵，吐血蛊毒相侵，白口咒咀相侵，刀兵火盗相侵，身渰颠狂相侵，吊颈枷锁相侵，秽门闭瘴相侵，年月日时不利相侵，斫伐坛庙树木相侵，乞坑动土相侵，开基开沼相侵，添新换旧相侵，修前整后相侵，疟疾疹疾相侵，瘟火瘟气相侵，官符口舌相侵，致生恶疾来缠，众生染者，致於丧亡。 若诵此经，即使恶疾不缠，吉星相护，凶曜退散，万祸水#3消，千祥云集，经通王界，福临人间。 天尊言：天下众生，江河湖海，舟航商贾，风波汹涌，惊惶忧惧。 若诵此经，皈依天地水官、水府众圣，即使风恬浪静，水途安妥，舟航稳载，绳缆坚牢，所谋顺遂，诸圣拥护，万神锡福。 於是天尊而说偈曰： 九炁青天上，日月星斗真。 天地水官帝，云雷电鼓随。 金童执华旛，玉女捧香花。 五色祥云内，放出白毫光。 照一切天下，显身救众生。 庆云祥烟护，拔离诸苦难。 兴云布洪雨，驱雷掣电行。 法显无边济，无极无量法。 无量度众生，无极无量光。 照出诸魂众，一切冤家鬼。 尽离地狱中，存亡诸众生，一切离苦难。 天尊说经已毕，若诵此经，随力见功，酌水献花，其福自应。 家有此经，宅舍光明，灾难无侵。 佩带此经，万神拥护，鬼祟永灭，心念不空，福力自然，神力扶持，随心应口。 此经共计一千六百七十五字，字字真诠，句句消愆，行行灭罪，卷卷赐福。 一切诸天上帝、三界十方众圣，闻说此经，皆大欢喜，信受奉行，作礼而退。 太上三元赐福赦罪解厄消灾延生保命妙经竟 #1『不足』，疑当作『不义』。 #2『戒』，疑漏一『斋』字,当作『斋戒』 。 #3『水』，疑当为『永』。",
      "translated_text": "The Water Official declares: Among the myriad beings under heaven, when stars and constellations move inauspiciously, when fate lingers and delays, when baleful stars converge and clash, many suffer from illnesses. Some are afflicted by pestilence, others by dysentery and sores, or by swelling, poisons, scabies, and leprosy. Some are stricken by seasonal qi, throat obstructions, or wind-toxin in the throat; others by diarrhea, wind-phlegm, or ancestral tomb miasma. Some are harmed by the fengshui of their dwelling’s foundation, or by false masters who corrupt the sacred. Others suffer from fiery eyes, consumption, vomiting blood, or gu poison; some from curses and hexes, or from blades, fire, and theft. Some are plagued by madness, drowning, or hanging; others by fetters, stagnant gates, or miasmic obstructions. Some are oppressed by inauspicious years, months, days, or hours; others by the felling of altars, temples, or trees. Some are harmed by digging graves or disturbing the earth, or by opening foundations or ponds. Others suffer from renovations, new constructions, or malaria and rashes; some from pestilential fire or miasma, or from official summons and slander. These misfortunes breed malignant illnesses that entangle beings, leading to death and ruin.\n\nYet if one recites this sutra, malignant illnesses will not cling, auspicious stars will guard, baleful stars will disperse, and ten thousand calamities will vanish forever. A thousand blessings will gather like clouds, the sutra will reach the royal realm, and fortune will descend upon the world.\n\nThe Heavenly Worthy speaks: Among the myriad beings under heaven, those who traverse rivers, lakes, and seas by boat—merchants and travelers—face surging waves and are filled with dread and fear. If one recites this sutra and takes refuge in the Water Officials of Heaven and Earth, the saints of the Water Palaces, the winds will grow still, the waves calm, the waterways safe, and the boats steady. Ropes and cables will hold firm, all endeavors will prosper, the myriad saints will protect, and the ten thousand spirits will bestow blessings.\n\nThen the Heavenly Worthy proclaimed this gatha:\nIn the Nine Qi of the Azure Heavens,\nThe sun, moon, and stars are true.\nThe Emperors of Heaven, Earth, and Water,\nWith clouds, thunder, and lightning follow.\nGolden youths hold flowered banners,\nJade maidens bear incense and blossoms.\nWithin five-colored auspicious clouds,\nRadiates the white light of the brow.\nIlluminating all under heaven,\nManifesting to save the multitude.\nAuspicious clouds and fragrant mists protect,\nDelivering from all suffering and hardship.\nRising clouds bring torrential rains,\nDriving thunder and flashing lightning.\nThe Dharma manifests boundless salvation,\nThe limitless, immeasurable Dharma.\nImmeasurably delivering beings,\nLimitless, immeasurable light.\nShining forth for all souls,\nAll vengeful ghosts.\nFully liberated from hell,\nAll living and deceased beings,\nAll freed from suffering and hardship.\n\nThereupon, the Heavenly Worthy concluded the sutra. If one recites this sutra, merit will arise according to one’s effort. Offering water and flowers, blessings will naturally respond. Where this sutra resides, the household will be luminous, and disasters will not intrude. Carrying this sutra, the myriad spirits will protect, malevolent ghosts will be forever vanquished, and one’s thoughts will never be in vain. Blessings will arise naturally, divine power will uphold, and responses will follow one’s words.\n\nThis sutra contains one thousand six hundred and seventy-five characters. Each character holds true meaning, each sentence dissolves transgressions, each line eradicates sins, and each scroll bestows blessings.\n\nAll the Heavenly Emperors, the saints of the Three Realms and the Ten Directions, upon hearing this sutra, rejoiced greatly. They received and upheld it with faith, paid homage, and withdrew.\n\nThus concludes the *Wondrous Sutra of the Most High Three Primordials for Bestowing Blessings, Pardoning Sins, Resolving Calamities, Prolonging Life, and Preserving Destiny*.",
      "overlap_context": " divine youths and yakṣas clench their fists in respect; the Ox-Head and Horse-Face all take refuge. The eighteen layers of hell become realms of carefree wandering; the thirty-three heavens become palaces of freedom. Transcending the bounds of heaven, there is no sound of hell. Emerging from hell, they forever leave suffering behind, directly ascending to the realms of humans and gods, transcending to the Pure Land. Joy is boundless; coming and going, they are without hindrance or obstruction.”",
      "start_char": 2798,
      "end_char": 3537,
      "start_sentence": 108,
      "end_sentence": 133,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.67119860649109,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\太上三元赐福敖罪解厄消灾延生保命妙经.txt",
        "category": "正统道藏续道藏"
      }
    }
  ]
}