{
  "source_id": "太上太清天童护命妙经注",
  "source_file": "chunked_daozang\\太上太清天童护命妙经注.json",
  "total_chunks": 4,
  "total_original_chars": 2617,
  "total_translated_chars": 16082,
  "total_translation_time": 92.7900242805481,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上太清天童护命妙经注.txt",
    "category": "玉诀类"
  },
  "full_translation": "**Commentary on the Supreme and Most Pure *Heavenly Youth’s Wondrous Scripture for Protecting Life***\n\n*Commentary on the Supreme and Most Pure Heavenly Youth’s Wondrous Scripture for Protecting Life*. Composed by the Jin-dynasty Daoist Hou Shanyuan. One scroll. Source text: *Daoist Canon of the Zhengtong Era*, *Wondrous Decisions* section of the *Dongshen* division.\n\n**Preface to the Commentary on the Supreme and Most Pure *Heavenly Youth’s Wondrous Scripture for Protecting Life***\n\nThe Supreme (*Taishang*) is the sovereign of the Mysterious Origin, the master of all sages, most exalted without peer, most lofty without rank. Above, it encompasses all images; in the middle, it universally succors all beings; below, it nurtures the myriad things. In ceaseless generation and transformation, it receives *qi* from the midst of the Great Beginning; in the individuation of each thing, it endows the Dao within the realm of emptiness and non-being. In its thousand changes and ten thousand transformations, none exist beyond the Supreme.\n\nThus, the Dao of Heaven operates as the *qi* of pure yang; the virtue of the Youth aligns with the perfection of the true. When these two mechanisms harmonize, their wondrous function becomes one—protecting life and nurturing vitality. With the numinous aid of spirit, rhinoceroses and tigers cannot harm, venomous creatures cannot injure. What, then, could be more steadfast? The ultimate efficacy lies in the mechanism of the spirit.\n\n**Commentary on the Supreme and Most Pure *Heavenly Youth’s Wondrous Scripture for Protecting Life***\nAnnotated by Hou Shanyuan, the Great Mystery Master of Mount Guye.\n\nThe Supreme and Most Pure Heavenly Youth,\nHigh Perfection gathers and transforms,\nTheir divine function boundless.\n\n**Hymn:**\nThe Supreme, Mysterious Origin, First Honored One,\nSeated high upon the lotus in the Jade Clarity Palace,\nThe Heavenly Youth’s wondrous transformation—perfect luminous body,\nIts radiance illumines the world, all phenomena dissolved in emptiness.\n\n*The Wondrous Scripture for Protecting Life.*\nThose who recite it dispel evil,\nThose who cultivate it gather rectitude.\n\n**Hymn:**\nThe Supreme personally transmitted *The Scripture for Protecting Life*,\nIts profound words and direct speech most clear.\nSilently chant it thrice at dawn’s first light,\nCountless demons all lose their terror.\n\nHeaven above births me,\nGolden Lord, Dao Father,\nShelters my true nature.\n\n**Hymn:**\nThe ten thousand things arise from the *qi* of the Dao,\nHeaven nurtures me, my spirit and *qi* purified.\nWithin the crucible, the dragon stirs fire,\nIn the cauldron, the golden elixir gradually coalesces.\n\nEarth below bears me,\nYellow Dame, Receptive Mother,\nMoves my form.\n\n**Hymn:**\nOne *qi*, harmonious and surging, manifests the ten thousand things,\nOriginally born and produced at the center.\nThe elixir of immortality nurtured in the cinnabar field,\nOnly then does one realize the spirit’s journey into the imperial realm.\n\nSun and moon illuminate me,\nEssence of Heaven and Earth,\nStirring pure yang.\n\n**Hymn:**\nWhere paths cross, the crow flies and the hare courses the waves,\nThe twin wheels gleam bright, surpassing the celestial river.\nThe enlightened one, here, opens their clear eyes—\nDare I ask the common person: do you recognize this?\n\nThe Northern Dipper assists me,\nHeart connected to the seven apertures,\nThe Dipper’s handle distinct and clear.\n\n**Hymn:**\nTurning the Dipper’s mouth, it governs the celestial gate,\nTwin meteors flow freely to and fro.\nThe cauldron’s eye brims, silver waves surge,\nThe furnace’s door—one expanse of crystal waters churning.\n\nThe stars and constellations honor me,\nThe sky’s essence and refinement,\nIllumine my spirit’s concentration.\n\n**Hymn:**\nGazing afar, the yang essence—countless points of radiance,\nRising and descending swiftly as flight.\nNurtured in emptiness, the immortal embryo forms,\nSteadily riding the golden dragon into the Supreme Subtlety.\n\nThe rivers and streams ferry me,\nWinding river of golden waters,\nSteadily steering the divine boat.\n\n**Hymn:**\nSpiritual waves surge, joining the eastern flow,\nPouring into the vast ocean of the Dharma sea.\nSteadily steering the divine boat, traversing all obstacles,\nFrom the water’s heart, directly casting the dragon hook.\n\nThe Northern Asterism serves me,\nThe Northern Asterism first appears,\nServes me, sharing its brilliance.\n\n**Hymn:**\nThe Northern Culmen’s mysterious subtlety anchors the azure vault,\nHeart opened, sudden awakening—no distance too far.\nWhere the fetal radiance, one point, settles and congeals,\nMyriad streams of rosy clouds drift beyond the mundane.\n\nWind and rain escort me,\nThe world’s emptiness and stillness,\nRain passed, wind cleared.\n\n**Hymn:**\nThin mist, light smoke, fine rain falls,\nDistant peaks, verdant and serene, harmonize.\nWhere do they escort me?\nStriking the sword, riding the dragon, ascending the Purple Tenuity.\n\nThe host of immortals lift me,\nThe assembly of perfected ones aids,\nOne body, undivided.\n\n**Hymn:**\nThe host of immortals lifts me to pay homage in the Three Realms,\nThe assembly of sages supports me into the imperial capital.\nWithin the Golden Watchtower’s gate, they summon the feathered guest,\nOn the Jade Empyrean’s roster, the immortal’s name is inscribed.\n\nThe Director of Destinies is with me,\nHeaven’s Director of Destinies,\nShares my origin.\n\n**Hymn:**\nThe Director of Destinies, composed, their intent naturally clear,\nCalmly with me, nurturing the spirit infant.\nThe infant grows vast, utterly without thing,\nOne luminous pearl of spirit-light, shining everywhere.\n\nThe Great One empowers me,\nThe Great One’s mysterious mechanism,\nEmpowers my divine transformations.\n\n**Hymn:**\nThe Great One’s crucible opens with a lion’s roar,\nThe Primordial Cauldron shatters as fire-dragons soar.\nLight and flame fill the heavens, scorching the void,\nMyriad streams of refined gold gleam with solar radiance.\n\nThe Six Ding advance me,\nSix gates unobstructed and serene,\nAdvancing my spirit’s wandering.\n\n**Hymn:**\nThe Six Ding advance me, free to roam,\nHair unbound, robes flowing, astride a fire-ox,\nGrasping my sword, teeth clenched, I devour sun and moon,\nFlying talismans pursue and seize the living heads.\n\nJade Maidens follow me,\nGolden Lads lead the way,\nJade Maidens trail behind.\n\n**Hymn:**\nJade Maidens follow me into the grotto’s wanderings,\nPipes and song guide me to the Crystal Tower.\nLeaning on the balustrade, the red dust’s affairs vanish,\nOnly the empty void remains, floating with the sun.\n\nThe Five Emperors guard me,\nFivefold radiance of mist,\nGathered into the spirit palace.\n\n**Hymn:**\nFive qi ascend to the origin, entering the jeweled palace,\nThree flowers scatter like petals through the void.\nThe Mystic Pearl harmonizes, generating luminous light,\nIlluminating the cosmos above and below, all-pervading.\n\nHeaven’s gates open for me,\nAscending to the Golden Watchtower,\nEntering and exiting the Gate of Peace.\n\n**Hymn:**\nLeisurely riding a white horse through Heaven’s gates,\nStrolling at ease to wander the Moon Palace.\nThe Jade Maiden in the jeweled hall issues a new decree,\nBestowing upon me a sprig of red cinnamon.\n\nEarth’s portals align with me,\nThe heart connects two apertures,\nThe spirit’s attainment knows no bounds.\n\n**Hymn:**\nA single strike opens the Mystic Pass, Earth’s portals part,\nCrimson Palace immortals ascend the Spirit Terrace.\nGazing far, jade flowers bloom in full,\nAll planted within the red crucible’s fiery heart.\n\nMy destiny claims me,\nNature and life both complete,\nEssence, qi, and spirit whole.\n\n**Hymn:**\nCultivating qi and preserving spirit follows another Way,\nCalming the hun and settling the po, they do not scatter.\nThe elixir perfected, the heart already attains the sacred,\nBoring through walls, piercing mountains, penetrating the sea’s depths.\n\nThe Supreme Clarity’s Mystic Register.\nThe Way of Supreme Clarity,\nMystic Register of the Myriad Spirits.\n\n**Hymn:**\nSupreme Clarity eternally guards the Gate of Peace,\nMyriad transformations arise within it.\nOne nature threads through heaven and earth,\nThe Golden Infant returns to the Jade Dawn Palace.\n\nThe Three Palaces ascend and descend,\nRising and falling,\nThe Three Ones float and sink.\n\n**Hymn:**\nThe Three Palaces’ ascent and descent determine floating and sinking,\nThe enlightened heart opens, nature deepens.\nThe Great One’s crucible adds civil and martial fire,\nWithin the cinnabar cauldron, refining refined gold.\n\nEndless ascent and descent.\nNear and far, intimate and estranged,\nThe great reckoning knows no end.\n\n**Hymn:**\nEndless ascent and descent, form unseen,\nThe formless body is naturally pure.\nGently refined, the crucible fills with numinous cinnabar,\nBrilliant radiance dazzles the eyes.\n\nGolden grain and jade nectar,\nAll sought-after things arrive.\nA single, natural flavor,\nThose who partake extend their years.\n\n**Hymn:**\nA platter of golden grain steeped in jade nectar,\nAfter sipping, the spirit clears, entering the Great Granary.\nAmid five-colored clouds, I pay homage to the Sage Lord,\nWithin the Purple Tenuity’s hall, I present myself to the Luminous August One.\n\nThe Void and Brahman, sun and moon,\nThe precious mirror suspended,\nThe Dao-eye lofty and bright.\n\n**Hymn:**\nThe Void and Brahman resplendent, illuminating the Great Net,\nHigh-hung sun and moon shine upon the mundane world.\nWithin the crucible, mercury drips drop by drop,\nForging red cinnabar until the cauldron overflows.\n\nI swear by Heaven.\nHeaven’s nature is human,\nThe human heart is the mechanism.\n\n**Hymn:**\nHeaven’s nature is human, humanity mirrors Heaven,\nHeaven and humanity unite, establishing the root.\nWhere does the root merge into oneness?\nVast and boundless, before the myriad transformations.\n\nGhosts and goblins, demons and specters,\nThe title of the Northern Culmen,\nReceiving the orthodox, expelling the perverse.\n\n**Hymn:**\nThe Northern Culmen’s Primordial Lord guards the upper realm,\nTeeth clenched, sword in hand, slaying demon kings.\nGoblins, specters, and demons all perish,\nTransformed entirely into formless blood-light.\n\nWhat is pursued is accomplished,\nThose who turn away die,\nThose who turn toward live.\n\n**Hymn:**\nThe elixir, once refined, never withers,\nIn the void of the Mysterious Female, breath flows free.\nThe White Tiger ever devours the Golden Phoenix’s marrow,\nThe Black Dragon constantly drinks the Sun’s butter.\n\nWhat spirit does it not command?\nEvery person has a share,\nEvery thing follows its course.\n\n**Hymn:**\nThe myriad spirits rejoice as the Three Lights gather,\nThe supreme Dao, unborn, attains eternal endurance.\nEver invert mercury and lead in their use,\nAnd naturally the elixir coalesces into pure yang.\n\nWhat decree goes unfulfilled?\nHeaven and earth, the ten thousand things,\nAre born by receiving qi.\n\n**Hymn:**\nAt the first stirring of yang, the yellow sprout flourishes,\nThe two qi intertwine, the white snow clarifies.\nThe two flavors blend in sixteen ounces,\nPerfecting the form of a single luminous pearl.\n\nAbove, the Vermilion Bird,\nThe Fire Dragon coils atop the crown,\nThe Cinnabar Phoenix congeals yang.\n\n**Hymn:**\nThe Vermilion Bird leaves its nest, chasing the sun in flight,\nAscending to the Celestial Valley, piercing the clouds.\nSpreading its golden wings, it grinds the stars,\nPushing the sunlight to fill the Grand Tenuity.\n\nBelow, the Dark Warrior,\nThe Black Tortoise of the Water Palace,\nThe essence of the Great Yin.\n\n**Hymn:**\nThe Dark Warrior moves through the Water Palace’s halls,\nA crimson serpent entwines it, born in fire.\nIn an instant, a well of golden waves surges,\nPouring into the red crucible, filling the cauldron for refining.\n\nTo the left, the Azure Dragon,\nThe dragon from the Thunder position,\nMercury born in the west.\n\n**Hymn:**\nThe Azure Dragon leaps forth from the eastern isles,\nUnfurling red clouds to shroud the Jade Capital.\nTwin bolts of lightning crackle like thunder,\nThe Three Heavens tremble, subduing rivers and lakes.\n\nTo the right, the White Tiger,\nThe tiger from the Lake position,\nLead born in the east.\n\n**Hymn:**\nThe White Tiger retreats deep into the Lake’s domain,\nSeated in stillness upon Mount Sumeru, it radiates dragon-light.\nPiercing the cosmos, all demons retreat,\nIt alone rules mountains and rivers, guarding the seas.\n\nThose who love me live,\nNurturing spirit and cultivating qi,\nPreserving life to attain longevity.\n\n**Hymn:**\nLet not the fire-timing of yin and yang err,\nAs lead in the crucible flies frost and spits emerald sand.\nA single luminous pearl rolls in inversion,\nIts essence illuminating the heavens with crimson radiance.\n\nThose who despise me meet misfortune,\nGreed and wrath deplete qi,\nJealousy harms the spirit.\n\n**Hymn:**\nLet not greed, wrath, or jealousy arise,\nTrust in the world’s freedom to roam at ease.\nWhen stillness encounters the clamor of corpse-ghosts,\nDraw the sword from your sleeve to slay the Three Corpses.\n\nThose who scheme against me die,\nWealth, beauty, profit, and fame—\nThose who cling to them perish.\n\n**Hymn:**\nDo not contend for fame or fortune,\nFor love and desire deepen karmic debt.\nThe enlightened transcend and keep their distance,\nWhile the deluded remain forever entangled.\n\nThose who hate me perish.\nThe mind-monkey and intent-horse—\nIf indulged, they bring ruin.\n\n**Hymn:**\nWhen demonic ghosts and yin spirits stir in chaos,\nGrasp firmly and preserve the spirit, allowing no intrusion.\nWhen stillness is disturbed by worldly affairs,\nRelease the moon of the heart to illuminate the void.\n\nThree thousand six hundred Jade Maidens\nEver attend me,\nThe myriad spirits gather,\nNever leaving my body.\n\n**Hymn:**\nA throng of immortals, their qi pure and refined,\nIn the depths of rosy clouds, they celebrate peace.\nA celestial melody resounds in the void,\nAs they escort the Perfected One into the Grotto-Heaven.\n\nHolding talismans and bearing commands,\nThey wander with me.\nIn walking, standing, sitting, or lying,\nThey follow my every movement.\n\n**Hymn:**\nThe Jade Maidens wander with me in the land of eternal night,\nPhoenixes and simurghs welcome the chariot into the Hall of Light.\nThe Golden Lads offer nectar of jade,\nIts fragrance so pure it cools the crown of the head.\n\nThe Most High presides over the capital,\nThe Lofty Perfected assume their ranks,\nThe host of sages comes to pay homage.\n\n**Hymn:**\nThe Most High, suspended in emptiness, sits upon the jeweled lotus,\nUnfurling the sun of wisdom to illuminate boundlessly.\nAll immortals are gathered in the ranks of the Lofty Perfected,\nThe host of sages comes to pay homage before the throne.\n\nHeaven’s great fortune prospers.\nVast and empty, tranquil and still,\nProfound and serene, full and void.\n\n**Hymn:**\nThe Primordial qi of the Chaos determines rise and fall,\nAlone in the boundless void, the myriad forms begin.\nBeyond the thousand kalpas, in the distant and mysterious,\nClear and still, it pervades the formless.\n\nThe twenty-four talismans,\nDivine talismans dispel illness,\nThe heart-seal expels perversity.\n\n**Hymn:**\nDivine talismans sever misfortune, yin evils vanish,\nThe heart-seal expels perversity, the Dao naturally arises.\nThe golden register and mysterious rites are personally transmitted,\nAiding the people and assisting the nation in eternal peace.\n\nIn accord with the stars and calendar.\nThe starry river gleams like jade,\nThe moon of the heart is pure as ice.\n\n**Hymn:**\nThe starry river gleams, piercing the silver toad,\nThe Supreme Perfected One is revered in worship.\nThe Jade Maidens draw open the halls of autumn waters,\nThe Golden Lads raise the curtains of night’s radiance.\n\nSwiftly, swiftly, as in the law’s command!\nGrasp the meaning within the scripture,\nHasten to cultivate and uphold it.\n\n**Hymn:**\nCultivating merit and conduct, both tasks complete,\nSuddenly one ascends lightly, transformed into a flying immortal.\nThe Azure Lads lead the way to the Court of the Origin,\nThe crane-drawn chariot and fragrant winds enter the Grotto-Heaven.\n\nHere ends the commentary on *The Wondrous Scripture of the Heavenly Lads Protecting Life, from the Supreme Clarity of the Great High*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上太清天童护命妙经注 太上太清天童护命妙经注。 金朝道士侯善渊撰 。 一卷。 底本出处：（正统道藏）洞神部玉诀类。 太上太清天童护命妙经注序 夫太上者，玄元之王，万圣之师，至上无尊，至高无位。 上则包罗众象，中则普济群生，下则长养万物。 生生化化，受炁於太始之中，物物头头，禀道在虚无之内，千变万化，无不太上矣。 故天道者，运为清阳之炁也，童德者，动合纯粹之真也，两机相契，妙用为一，护命养生。 神明佑助，兕虎无由所伤，毒虫焉能所害，何为坚固，至在於神之机也。 太上太清天童护命妙注 姑射山太玄子侯善渊注",
      "translated_text": "**Commentary on the Supreme and Most Pure *Heavenly Youth’s Wondrous Scripture for Protecting Life***\n\n*Commentary on the Supreme and Most Pure Heavenly Youth’s Wondrous Scripture for Protecting Life*. Composed by the Jin-dynasty Daoist Hou Shanyuan. One scroll. Source text: *Daoist Canon of the Zhengtong Era*, *Wondrous Decisions* section of the *Dongshen* division.\n\n**Preface to the Commentary on the Supreme and Most Pure *Heavenly Youth’s Wondrous Scripture for Protecting Life***\n\nThe Supreme (*Taishang*) is the sovereign of the Mysterious Origin, the master of all sages, most exalted without peer, most lofty without rank. Above, it encompasses all images; in the middle, it universally succors all beings; below, it nurtures the myriad things. In ceaseless generation and transformation, it receives *qi* from the midst of the Great Beginning; in the individuation of each thing, it endows the Dao within the realm of emptiness and non-being. In its thousand changes and ten thousand transformations, none exist beyond the Supreme.\n\nThus, the Dao of Heaven operates as the *qi* of pure yang; the virtue of the Youth aligns with the perfection of the true. When these two mechanisms harmonize, their wondrous function becomes one—protecting life and nurturing vitality. With the numinous aid of spirit, rhinoceroses and tigers cannot harm, venomous creatures cannot injure. What, then, could be more steadfast? The ultimate efficacy lies in the mechanism of the spirit.\n\n**Commentary on the Supreme and Most Pure *Heavenly Youth’s Wondrous Scripture for Protecting Life***\nAnnotated by Hou Shanyuan, the Great Mystery Master of Mount Guye.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 258,
      "start_sentence": 0,
      "end_sentence": 12,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.479613065719604,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上太清天童护命妙经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "太上太清天童 高真摄化，神用无方。 颂曰：太上玄元第一尊，趺莲高坐玉清官，天童妙化圆明体，光鉴寰瀛万象空。 护命妙经。 诵者除邪，修之摄正。 颂曰：太上亲传护命经，玄言直语甚分明，清晨默念持三徧，无限群魔尽失惊。 皇天生我， 金公道父，覆我之真。 颂曰：万物因从道炁生，皇天育我气神清，壶中逗引龙行火，鼎内金丹渐结成。 皇地载我， 黄婆牝母，运我之形。 颂曰：一炁冲和万物彰，本因生产在中央，丹田养就灵仙药，始觉神游入帝乡。 日月照我， 天地之精，感而纯阳。 颂曰：交径乌飞兔走波，二轮晶耀越天河，达人到此开青眼，试问凡夫认得么。 北斗辅我， 心通七窍，斗柄分明。 颂曰：斡开斗口运天关，两点流星任往还，鼎眼满倾银浪滚，炉门一派水晶翻。 星辰荣我。 满天精秀，照我神凝。 颂曰：极目阳精数点辉，往来升降疾如飞，空中颐养胎仙就，稳跨金龙入太微。 江河渡我， 曲江金水，稳驾神舟。 颂曰：灵波滚滚接东流，倾入汪洋法海收，稳驾神舟淤历徧，水心直下钓龙钧。 北辰侍我， 北辰初显，侍我同明。 颂曰：北极玄微镇碧霄，心开顿悟亦非遥，胎光一点澄凝处，万道流霞物外飘。 风雨送我， 寰中虚静，雨过风清。 颂曰：薄雾轻烟细雨霏，远岚凝翠可相宜，送我归何处，拍剑骑龙上紫微。 诸仙举我， 众真相助，一体无分。 颂曰：诸仙举我朝三界，众圣相扶入帝京，金阙门中呼羽客，玉霄榜上列仙名。 司命与我， 天中司命，与我同源。 颂曰：司命从容意自清，介然与我育神婴，婴儿长大浑无物，一颗灵光处处明。 太一任我， 太一玄机，任我神通。",
      "translated_text": "The Supreme and Most Pure Heavenly Youth,\nHigh Perfection gathers and transforms,\nTheir divine function boundless.\n\n**Hymn:**\nThe Supreme, Mysterious Origin, First Honored One,\nSeated high upon the lotus in the Jade Clarity Palace,\nThe Heavenly Youth’s wondrous transformation—perfect luminous body,\nIts radiance illumines the world, all phenomena dissolved in emptiness.\n\n*The Wondrous Scripture for Protecting Life.*\nThose who recite it dispel evil,\nThose who cultivate it gather rectitude.\n\n**Hymn:**\nThe Supreme personally transmitted *The Scripture for Protecting Life*,\nIts profound words and direct speech most clear.\nSilently chant it thrice at dawn’s first light,\nCountless demons all lose their terror.\n\nHeaven above births me,\nGolden Lord, Dao Father,\nShelters my true nature.\n\n**Hymn:**\nThe ten thousand things arise from the *qi* of the Dao,\nHeaven nurtures me, my spirit and *qi* purified.\nWithin the crucible, the dragon stirs fire,\nIn the cauldron, the golden elixir gradually coalesces.\n\nEarth below bears me,\nYellow Dame, Receptive Mother,\nMoves my form.\n\n**Hymn:**\nOne *qi*, harmonious and surging, manifests the ten thousand things,\nOriginally born and produced at the center.\nThe elixir of immortality nurtured in the cinnabar field,\nOnly then does one realize the spirit’s journey into the imperial realm.\n\nSun and moon illuminate me,\nEssence of Heaven and Earth,\nStirring pure yang.\n\n**Hymn:**\nWhere paths cross, the crow flies and the hare courses the waves,\nThe twin wheels gleam bright, surpassing the celestial river.\nThe enlightened one, here, opens their clear eyes—\nDare I ask the common person: do you recognize this?\n\nThe Northern Dipper assists me,\nHeart connected to the seven apertures,\nThe Dipper’s handle distinct and clear.\n\n**Hymn:**\nTurning the Dipper’s mouth, it governs the celestial gate,\nTwin meteors flow freely to and fro.\nThe cauldron’s eye brims, silver waves surge,\nThe furnace’s door—one expanse of crystal waters churning.\n\nThe stars and constellations honor me,\nThe sky’s essence and refinement,\nIllumine my spirit’s concentration.\n\n**Hymn:**\nGazing afar, the yang essence—countless points of radiance,\nRising and descending swiftly as flight.\nNurtured in emptiness, the immortal embryo forms,\nSteadily riding the golden dragon into the Supreme Subtlety.\n\nThe rivers and streams ferry me,\nWinding river of golden waters,\nSteadily steering the divine boat.\n\n**Hymn:**\nSpiritual waves surge, joining the eastern flow,\nPouring into the vast ocean of the Dharma sea.\nSteadily steering the divine boat, traversing all obstacles,\nFrom the water’s heart, directly casting the dragon hook.\n\nThe Northern Asterism serves me,\nThe Northern Asterism first appears,\nServes me, sharing its brilliance.\n\n**Hymn:**\nThe Northern Culmen’s mysterious subtlety anchors the azure vault,\nHeart opened, sudden awakening—no distance too far.\nWhere the fetal radiance, one point, settles and congeals,\nMyriad streams of rosy clouds drift beyond the mundane.\n\nWind and rain escort me,\nThe world’s emptiness and stillness,\nRain passed, wind cleared.\n\n**Hymn:**\nThin mist, light smoke, fine rain falls,\nDistant peaks, verdant and serene, harmonize.\nWhere do they escort me?\nStriking the sword, riding the dragon, ascending the Purple Tenuity.\n\nThe host of immortals lift me,\nThe assembly of perfected ones aids,\nOne body, undivided.\n\n**Hymn:**\nThe host of immortals lifts me to pay homage in the Three Realms,\nThe assembly of sages supports me into the imperial capital.\nWithin the Golden Watchtower’s gate, they summon the feathered guest,\nOn the Jade Empyrean’s roster, the immortal’s name is inscribed.\n\nThe Director of Destinies is with me,\nHeaven’s Director of Destinies,\nShares my origin.\n\n**Hymn:**\nThe Director of Destinies, composed, their intent naturally clear,\nCalmly with me, nurturing the spirit infant.\nThe infant grows vast, utterly without thing,\nOne luminous pearl of spirit-light, shining everywhere.\n\nThe Great One empowers me,\nThe Great One’s mysterious mechanism,\nEmpowers my divine transformations.",
      "overlap_context": "tion of the true. When these two mechanisms harmonize, their wondrous function becomes one—protecting life and nurturing vitality. With the numinous aid of spirit, rhinoceroses and tigers cannot harm, venomous creatures cannot injure. What, then, could be more steadfast? The ultimate efficacy lies in the mechanism of the spirit.\n\n**Commentary on the Supreme and Most Pure *Heavenly Youth’s Wondrous Scripture for Protecting Life***\nAnnotated by Hou Shanyuan, the Great Mystery Master of Mount Guye.",
      "start_char": 258,
      "end_char": 949,
      "start_sentence": 13,
      "end_sentence": 50,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.340492963790894,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上太清天童护命妙经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "颂曰：太一炉开师子吼，混元鼎破火龙飞，满天光焰烧空界，万派精金照日辉。 六丁进我， 六门通泰，进我神游。 颂曰：六丁进我任遨游，散发披襟跨火牛，仗剑咬牙吞日月，飞符追下活人头。 玉女从我， 金童前引，玉女后随。 颂曰：玉女相随入洞游，笙歌引上水晶楼，凭栏不见红尘事，唯有虚空浮日头。 五帝卫我， 五般霞彩，聚入神宫。 颂曰：五炁朝元入宝宫，三花片片落空中，玄珠配合生光莹，遍照乾坤上下通。 天门开我， 上朝金阙，出入夷门。 颂曰：闲骑白马上天门，信步因游玩月宫，宝殿姮娥新有令，赐余丹桂一枝红。 地户通我， 心通两窍，神致无方。 颂曰：一击玄关地户开，绛官仙子上灵台，遍观极目琼花绽，尽向红炉火里栽。 我命着我， 性命俱备，精炁神全。 颂曰：养炁全神别有方，安魂定魄不飞扬，丹成已觉心通圣，凿壁穿山透海沧。 太清玄籍。 太清之道，玄籍万神。 颂曰； 太清永劫镇夷门，万化生乎在彼中，一性贯穿天地匝，金婴还返玉晨宫。 三宫升降， 上升下降，三一浮沉。 颂曰：三宫升降定浮沉，达者心开性自深，太一炉添文武火，朱砂鼎裹炼精金。 上下往来无穷。 亲远疏近，大计无穷。 颂曰：上下无穷不见形，无形之体自然清，蠲蠲赠得灵砂满，灿灿交光照眼明。 金饭玉浆，向求皆至。 天然一味，食者延年。 颂曰：一盘金饭浸琼浆，啜罢神清入太仓，五色云中朝圣主，紫微殿裹奏明皇。 虚梵日月， 虚悬宝鉴，道眼高明。 颂曰：虚梵煌煌映大罗，高悬日月照婆娑，鼎中汞水涓涓滴，铸就红砂满鼎多。 与天为誓 。 天性人也，人心机也。 颂曰：天性人兮人象天，天人相契立根元，根元混一归何处，荡荡茫茫万化前。 鬼雚魒鬼行魁， 北极之号，受正除邪。 颂曰：北极元君镇上方，咬牙执剑斩魔王，妖精魍魉全俱灭，总化无形变血光。 所为者成， 背之者死，向之则生。",
      "translated_text": "**Hymn:**\nThe Great One’s crucible opens with a lion’s roar,\nThe Primordial Cauldron shatters as fire-dragons soar.\nLight and flame fill the heavens, scorching the void,\nMyriad streams of refined gold gleam with solar radiance.\n\nThe Six Ding advance me,\nSix gates unobstructed and serene,\nAdvancing my spirit’s wandering.\n\n**Hymn:**\nThe Six Ding advance me, free to roam,\nHair unbound, robes flowing, astride a fire-ox,\nGrasping my sword, teeth clenched, I devour sun and moon,\nFlying talismans pursue and seize the living heads.\n\nJade Maidens follow me,\nGolden Lads lead the way,\nJade Maidens trail behind.\n\n**Hymn:**\nJade Maidens follow me into the grotto’s wanderings,\nPipes and song guide me to the Crystal Tower.\nLeaning on the balustrade, the red dust’s affairs vanish,\nOnly the empty void remains, floating with the sun.\n\nThe Five Emperors guard me,\nFivefold radiance of mist,\nGathered into the spirit palace.\n\n**Hymn:**\nFive qi ascend to the origin, entering the jeweled palace,\nThree flowers scatter like petals through the void.\nThe Mystic Pearl harmonizes, generating luminous light,\nIlluminating the cosmos above and below, all-pervading.\n\nHeaven’s gates open for me,\nAscending to the Golden Watchtower,\nEntering and exiting the Gate of Peace.\n\n**Hymn:**\nLeisurely riding a white horse through Heaven’s gates,\nStrolling at ease to wander the Moon Palace.\nThe Jade Maiden in the jeweled hall issues a new decree,\nBestowing upon me a sprig of red cinnamon.\n\nEarth’s portals align with me,\nThe heart connects two apertures,\nThe spirit’s attainment knows no bounds.\n\n**Hymn:**\nA single strike opens the Mystic Pass, Earth’s portals part,\nCrimson Palace immortals ascend the Spirit Terrace.\nGazing far, jade flowers bloom in full,\nAll planted within the red crucible’s fiery heart.\n\nMy destiny claims me,\nNature and life both complete,\nEssence, qi, and spirit whole.\n\n**Hymn:**\nCultivating qi and preserving spirit follows another Way,\nCalming the hun and settling the po, they do not scatter.\nThe elixir perfected, the heart already attains the sacred,\nBoring through walls, piercing mountains, penetrating the sea’s depths.\n\nThe Supreme Clarity’s Mystic Register.\nThe Way of Supreme Clarity,\nMystic Register of the Myriad Spirits.\n\n**Hymn:**\nSupreme Clarity eternally guards the Gate of Peace,\nMyriad transformations arise within it.\nOne nature threads through heaven and earth,\nThe Golden Infant returns to the Jade Dawn Palace.\n\nThe Three Palaces ascend and descend,\nRising and falling,\nThe Three Ones float and sink.\n\n**Hymn:**\nThe Three Palaces’ ascent and descent determine floating and sinking,\nThe enlightened heart opens, nature deepens.\nThe Great One’s crucible adds civil and martial fire,\nWithin the cinnabar cauldron, refining refined gold.\n\nEndless ascent and descent.\nNear and far, intimate and estranged,\nThe great reckoning knows no end.\n\n**Hymn:**\nEndless ascent and descent, form unseen,\nThe formless body is naturally pure.\nGently refined, the crucible fills with numinous cinnabar,\nBrilliant radiance dazzles the eyes.\n\nGolden grain and jade nectar,\nAll sought-after things arrive.\nA single, natural flavor,\nThose who partake extend their years.\n\n**Hymn:**\nA platter of golden grain steeped in jade nectar,\nAfter sipping, the spirit clears, entering the Great Granary.\nAmid five-colored clouds, I pay homage to the Sage Lord,\nWithin the Purple Tenuity’s hall, I present myself to the Luminous August One.\n\nThe Void and Brahman, sun and moon,\nThe precious mirror suspended,\nThe Dao-eye lofty and bright.\n\n**Hymn:**\nThe Void and Brahman resplendent, illuminating the Great Net,\nHigh-hung sun and moon shine upon the mundane world.\nWithin the crucible, mercury drips drop by drop,\nForging red cinnabar until the cauldron overflows.\n\nI swear by Heaven.\nHeaven’s nature is human,\nThe human heart is the mechanism.\n\n**Hymn:**\nHeaven’s nature is human, humanity mirrors Heaven,\nHeaven and humanity unite, establishing the root.\nWhere does the root merge into oneness?\nVast and boundless, before the myriad transformations.\n\nGhosts and goblins, demons and specters,\nThe title of the Northern Culmen,\nReceiving the orthodox, expelling the perverse.\n\n**Hymn:**\nThe Northern Culmen’s Primordial Lord guards the upper realm,\nTeeth clenched, sword in hand, slaying demon kings.\nGoblins, specters, and demons all perish,\nTransformed entirely into formless blood-light.\n\nWhat is pursued is accomplished,\nThose who turn away die,\nThose who turn toward live.",
      "overlap_context": "he feathered guest,\nOn the Jade Empyrean’s roster, the immortal’s name is inscribed.\n\nThe Director of Destinies is with me,\nHeaven’s Director of Destinies,\nShares my origin.\n\n**Hymn:**\nThe Director of Destinies, composed, their intent naturally clear,\nCalmly with me, nurturing the spirit infant.\nThe infant grows vast, utterly without thing,\nOne luminous pearl of spirit-light, shining everywhere.\n\nThe Great One empowers me,\nThe Great One’s mysterious mechanism,\nEmpowers my divine transformations.",
      "start_char": 949,
      "end_char": 1743,
      "start_sentence": 51,
      "end_sentence": 93,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.024801015853882,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上太清天童护命妙经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "颂曰：修成丹药永无枯，玄牝空中任吸呼，白虎每吞金凤髓，乌龙常饮太阳酥。 何神不使， 人人有分，物物皆从。 颂曰：万神同喜聚三光，至道无生得久长，常使 汞铅颠倒用，自然丹就得纯阳。 何令不行， 天地万物，受炁而生。 颂曰：一阳初动黄芽秀，二炁相交白雪清，两味合和十六两，完容一粒宝珠明。 上有朱雀， 火龙蟠顶，丹凤凝阳。 颂曰：朱雀离巢趁日飞，上侵天谷彻云霓，展开金翅磨星斗推落阳光满太微。 下有玄武， 乌龟水府，太阴之精。 颂曰：玄武交宫水府行，赤蛇相绕火中生，剎那一井金波涌，倾入红炉满鼎烹。 左有青龙， 龙从震位，汞自西生。 颂曰：青龙一踊出东渝，舒展红霞罩玉都，两道电光昕霹雳，三天惊动镇江湖。 右有白虎。 虎从兑位，铅自东生。 颂曰：白虎深藏入兑方，须弥静坐泛龙光，射开宇宙群魔退，独霸山川镇海沧。 爱我者生， 全神养炁，保命长生。 颂曰：阴阳火候勿令差，铅鼎飞霜吐翠砂，一粒明珠颠倒滚，满天精耀放红霞。 恶我者殃， 贪嗔损炁，嫉妬伤神。 颂曰：贪嗔嫉妬勿交生，信任寰中自在行，清静若逢尸鬼闹，袖中携剑斩三彭。 谋我者死， 财色利名，亲之者死。 颂曰：功名富贵莫争罗，爱欲恩深业转多，达士超然俱远避，迷人不悟永耽砣。 憎我者亡。 心猿意马，纵之则亡。 颂曰：邪魔阴鬼乱交纷，握固存神意不容，寂静若逢尘事挠，放开心月照虚空。 玉女三千六百，常在我傍， 万神聚会，不离我身。 颂曰：一簇神仙秀炁清，彩云深处贺升平，空中一派仙音奏，捧个真人入洞庭。 执节奉符，与我同游。 行住坐外，动止相随。 颂曰：玉女同游不夜乡，凤鸾迎驾入明堂，金童劝琼浆液，味觉清香透顶凉。 太上摄京， 高真摄位，众圣来朝。 颂曰：太上扶空坐宝莲，放开惠日照无边，诸仙总摄高真位，众圣来朝御坐前。 天大吉昌。 寥寥空静，湛湛盈虚。 颂曰：混元一炁定沉浮，独立寥空万象初，渺渺玄玄千劫外，澄澄湛湛覆虚无。 二十四符， 神符去病，心印除邪。 颂曰：神符断祟阴消灭，心印除邪道自生，金簶玄科亲授诀，济民助国永清平。 与星历俱。 星河玉洁，心月冰清。 颂曰：星河皎洁透银蟾，无上真人至仰瞻，玉女掣开秋水殿，金童舒起夜明帘。 急急如律令！ 经中得意，急急修持。 颂曰：功行齐修两事全，焕然轻举化飞仙，青童引至朝元去，鹤驾香风入洞天。 太上太清天童护命妙经注竟",
      "translated_text": "**Hymn:**\nThe elixir, once refined, never withers,\nIn the void of the Mysterious Female, breath flows free.\nThe White Tiger ever devours the Golden Phoenix’s marrow,\nThe Black Dragon constantly drinks the Sun’s butter.\n\nWhat spirit does it not command?\nEvery person has a share,\nEvery thing follows its course.\n\n**Hymn:**\nThe myriad spirits rejoice as the Three Lights gather,\nThe supreme Dao, unborn, attains eternal endurance.\nEver invert mercury and lead in their use,\nAnd naturally the elixir coalesces into pure yang.\n\nWhat decree goes unfulfilled?\nHeaven and earth, the ten thousand things,\nAre born by receiving qi.\n\n**Hymn:**\nAt the first stirring of yang, the yellow sprout flourishes,\nThe two qi intertwine, the white snow clarifies.\nThe two flavors blend in sixteen ounces,\nPerfecting the form of a single luminous pearl.\n\nAbove, the Vermilion Bird,\nThe Fire Dragon coils atop the crown,\nThe Cinnabar Phoenix congeals yang.\n\n**Hymn:**\nThe Vermilion Bird leaves its nest, chasing the sun in flight,\nAscending to the Celestial Valley, piercing the clouds.\nSpreading its golden wings, it grinds the stars,\nPushing the sunlight to fill the Grand Tenuity.\n\nBelow, the Dark Warrior,\nThe Black Tortoise of the Water Palace,\nThe essence of the Great Yin.\n\n**Hymn:**\nThe Dark Warrior moves through the Water Palace’s halls,\nA crimson serpent entwines it, born in fire.\nIn an instant, a well of golden waves surges,\nPouring into the red crucible, filling the cauldron for refining.\n\nTo the left, the Azure Dragon,\nThe dragon from the Thunder position,\nMercury born in the west.\n\n**Hymn:**\nThe Azure Dragon leaps forth from the eastern isles,\nUnfurling red clouds to shroud the Jade Capital.\nTwin bolts of lightning crackle like thunder,\nThe Three Heavens tremble, subduing rivers and lakes.\n\nTo the right, the White Tiger,\nThe tiger from the Lake position,\nLead born in the east.\n\n**Hymn:**\nThe White Tiger retreats deep into the Lake’s domain,\nSeated in stillness upon Mount Sumeru, it radiates dragon-light.\nPiercing the cosmos, all demons retreat,\nIt alone rules mountains and rivers, guarding the seas.\n\nThose who love me live,\nNurturing spirit and cultivating qi,\nPreserving life to attain longevity.\n\n**Hymn:**\nLet not the fire-timing of yin and yang err,\nAs lead in the crucible flies frost and spits emerald sand.\nA single luminous pearl rolls in inversion,\nIts essence illuminating the heavens with crimson radiance.\n\nThose who despise me meet misfortune,\nGreed and wrath deplete qi,\nJealousy harms the spirit.\n\n**Hymn:**\nLet not greed, wrath, or jealousy arise,\nTrust in the world’s freedom to roam at ease.\nWhen stillness encounters the clamor of corpse-ghosts,\nDraw the sword from your sleeve to slay the Three Corpses.\n\nThose who scheme against me die,\nWealth, beauty, profit, and fame—\nThose who cling to them perish.\n\n**Hymn:**\nDo not contend for fame or fortune,\nFor love and desire deepen karmic debt.\nThe enlightened transcend and keep their distance,\nWhile the deluded remain forever entangled.\n\nThose who hate me perish.\nThe mind-monkey and intent-horse—\nIf indulged, they bring ruin.\n\n**Hymn:**\nWhen demonic ghosts and yin spirits stir in chaos,\nGrasp firmly and preserve the spirit, allowing no intrusion.\nWhen stillness is disturbed by worldly affairs,\nRelease the moon of the heart to illuminate the void.\n\nThree thousand six hundred Jade Maidens\nEver attend me,\nThe myriad spirits gather,\nNever leaving my body.\n\n**Hymn:**\nA throng of immortals, their qi pure and refined,\nIn the depths of rosy clouds, they celebrate peace.\nA celestial melody resounds in the void,\nAs they escort the Perfected One into the Grotto-Heaven.\n\nHolding talismans and bearing commands,\nThey wander with me.\nIn walking, standing, sitting, or lying,\nThey follow my every movement.\n\n**Hymn:**\nThe Jade Maidens wander with me in the land of eternal night,\nPhoenixes and simurghs welcome the chariot into the Hall of Light.\nThe Golden Lads offer nectar of jade,\nIts fragrance so pure it cools the crown of the head.\n\nThe Most High presides over the capital,\nThe Lofty Perfected assume their ranks,\nThe host of sages comes to pay homage.\n\n**Hymn:**\nThe Most High, suspended in emptiness, sits upon the jeweled lotus,\nUnfurling the sun of wisdom to illuminate boundlessly.\nAll immortals are gathered in the ranks of the Lofty Perfected,\nThe host of sages comes to pay homage before the throne.\n\nHeaven’s great fortune prospers.\nVast and empty, tranquil and still,\nProfound and serene, full and void.\n\n**Hymn:**\nThe Primordial qi of the Chaos determines rise and fall,\nAlone in the boundless void, the myriad forms begin.\nBeyond the thousand kalpas, in the distant and mysterious,\nClear and still, it pervades the formless.\n\nThe twenty-four talismans,\nDivine talismans dispel illness,\nThe heart-seal expels perversity.\n\n**Hymn:**\nDivine talismans sever misfortune, yin evils vanish,\nThe heart-seal expels perversity, the Dao naturally arises.\nThe golden register and mysterious rites are personally transmitted,\nAiding the people and assisting the nation in eternal peace.\n\nIn accord with the stars and calendar.\nThe starry river gleams like jade,\nThe moon of the heart is pure as ice.\n\n**Hymn:**\nThe starry river gleams, piercing the silver toad,\nThe Supreme Perfected One is revered in worship.\nThe Jade Maidens draw open the halls of autumn waters,\nThe Golden Lads raise the curtains of night’s radiance.\n\nSwiftly, swiftly, as in the law’s command!\nGrasp the meaning within the scripture,\nHasten to cultivate and uphold it.\n\n**Hymn:**\nCultivating merit and conduct, both tasks complete,\nSuddenly one ascends lightly, transformed into a flying immortal.\nThe Azure Lads lead the way to the Court of the Origin,\nThe crane-drawn chariot and fragrant winds enter the Grotto-Heaven.\n\nHere ends the commentary on *The Wondrous Scripture of the Heavenly Lads Protecting Life, from the Supreme Clarity of the Great High*.",
      "overlap_context": "merge into oneness?\nVast and boundless, before the myriad transformations.\n\nGhosts and goblins, demons and specters,\nThe title of the Northern Culmen,\nReceiving the orthodox, expelling the perverse.\n\n**Hymn:**\nThe Northern Culmen’s Primordial Lord guards the upper realm,\nTeeth clenched, sword in hand, slaying demon kings.\nGoblins, specters, and demons all perish,\nTransformed entirely into formless blood-light.\n\nWhat is pursued is accomplished,\nThose who turn away die,\nThose who turn toward live.",
      "start_char": 1743,
      "end_char": 2760,
      "start_sentence": 94,
      "end_sentence": 147,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.945117235183716,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上太清天童护命妙经注.txt",
        "category": "玉诀类"
      }
    }
  ]
}