{
  "source_id": "太上泰清拔罪升天宝忏",
  "source_file": "chunked_daozang\\太上泰清拔罪升天宝忏.json",
  "total_chunks": 2,
  "total_original_chars": 2461,
  "total_translated_chars": 14613,
  "total_translation_time": 71.00079917907715,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\威仪类\\太上泰清拔罪升天宝忏.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Supreme Taiqing Precious Repentance for Expiating Sins and Ascending to Heaven*\n\nAt that time, the Most High Lord of the Primordial Beginning was seated upon a terrace of jade and precious lotus, towering myriad fathoms high within the Azure Heaven of the Beginning. Surrounded by an immeasurable assembly of sagely beings, he expounded the wondrous and subtle Dharma of Serene Quiescence and Primordial Embrace, radiating great luminosity that universally illumined the ten directions. In boundless worlds, boundless beings—whether with karmic affinity or none—all attained deliverance.\n\nThen, the radiance beheld the great hells of Mount Fengdu in the northern darkness, where all multitudes of beings endured the sufferings of their sins. First, he saw the Hell of Boiling Cauldrons, where ox-headed jailers drove countless sinners into the seething vats. As they entered, their bodies dissolved into pulp. After an eon had passed, their names were called—whether man or woman—and they emerged at the sound, their limbs restored, their forms as before. Yet again, the jailers drove them into another hell, called the Iron Bed. Above, iron spikes pressed down; below, great fires raged. All the sinners were forced upon it, and in an instant, their flesh and bones were scorched to ashes. After another eon, the hell wardens called their names, and they arose once more, their bodies whole, their forms as before.\n\nAgain, the jailers drove them into another hell, called the City of Fire. Surrounding it were iron walls, and above, iron nets. Fierce smoke and poisonous flames blazed within, while bronze dogs and iron serpents spewed forth great fires. Suddenly, the gates opened, and flames surged forth. The sinners entered, and the gates closed behind them. Their flesh and bones were scorched to ashes as they were tossed about by the flames, leaping and striking the nets. Their cries shook heaven and earth, louder than thunder. After another eon, the hell gates opened again, and the wardens called their names, and they emerged whole once more.\n\nAgain, the jailers drove them into another hell, called the Hell of Sawing. The sinners were clamped between iron plates and sawed apart, blood flowing like rivers. From head to foot, they were split in two. After another eon, the wardens called their names, and they were rejoined as one.\n\nAgain, the jailers drove them beneath the pestles, where they were pounded into ten thousand pieces, or impaled on iron forks and ground into bloody pulp. After another eon, the wardens called their names, and they were restored as before.\n\nAgain, the jailers drove them into another hell, called the Hell of Knife Mountains and Sword Trees. There stood a great mountain, jagged and towering, its peaks all blades. Above grew a great tree, its branches, leaves, roots, and trunk all sword edges. When the sinners entered, the blade-tips pierced their feet, and the sword-edges sliced their bodies, their skin torn from their flesh, blood flowing like rivers. After enduring such torment for another eon, the wardens called their names, and they were restored whole once more.\n\nAs the jailers drove them onward, among the multitude there was one sinner who, in his past life, had studied the Daoist scriptures and thus knew something of past lives, karmic conditions, and retribution. Beholding this radiance, he silently thought: *Our suffering here is all due to the evil karma we created in former lives, which has brought this retribution. In the hells, through countless eons, we have languished in endless darkness. This light must be the great luminosity of the Most High Lord of the Primordial Beginning, come to deliver us.* Thereupon, he said to the others: \"You all, in your past lives, accumulated heavy evil karma, ignorant of the scriptures, unaware of the true and real, believing in perverse and inverted views, deceiving both the seen and unseen. Thus, you suffer these torments with no means of escape. But now, by good fortune, you have beheld this light. Follow me in invoking the sacred name of the Most High Lord of the Primordial Beginning with utmost sincerity, and pray to escape this suffering.\"\n\nAll the sinners, hearing these words, gazed reverently upon the light and, as one, began to chant the name. The dark officials and hell wardens could not restrain them, and the ox-headed jailers transformed into benevolent beings. In an instant, the countless sinners’ shackles fell away of themselves. Riding the radiance, they departed and were reborn into the human realm.\n\nThe Most High said: \"When living beings commit sins and die, they enter the northern Fengdu, where ghostly wardens examine their sinful souls, and their karmic adversaries are inescapable. The fierce flames of the Iron City, the dismemberment of the cauldrons, the roasting and burning, the Knife Mountains, the poisonous serpents, the grinding pestles, the freezing ice, the towering Sword Trees—even to hear of these torments is heartrending; how much worse to endure them oneself! In the endless darkness, like ants in a cycle, they dwell perpetually in hell. If they do not awaken to the causes of their suffering and repent in advance, their sins will deepen day by day, and they will surely fall into these torments. Through ten thousand eons and a thousand lives, how will they ever attain liberation? You must wholeheartedly pray and take refuge in the Perfected Ones above, vowing that in future lives you will not fall into these hells, that you may always hear the Daoist scriptures, awaken to the Daoist Dharma, behold the compassionate light, and suddenly attain deliverance.\"\n\nWith bowed heads and utmost sincerity, they paid homage and took refuge, invoking the sacred names of the Venerable Ones of the Taiqing, the Universal Compassion, and the Protectors of the World:\n\nHomage and refuge to the Heavenly Worthy of the Taiqing Immortal Realm,\nHomage and refuge to the Heavenly Worthy Who Dissolves Grievances and Looses Bonds,\nHomage and refuge to the Heavenly Worthy Adorned with Blessings and Splendor,\nHomage and refuge to the Heavenly Worthy of Wondrous Joy and Non-Action,\nHomage and refuge to the Heavenly Worthy of Unobstructed Concealment and Manifestation,\nHomage and refuge to the Heavenly Worthy of True Wandering and Self-Mastery,\nHomage and refuge to the Heavenly Worthy of Supreme Clarity and Perfect Culmination,\nHomage and refuge to the Heavenly Worthy of the Torch of Wisdom, Radiant and Resplendent,\nHomage and refuge to the Heavenly Worthy of the Supreme Ultimate and Boundless,\nHomage and refuge to the Heavenly Worthy Who Opens Heaven and Initiates Virtue,\nHomage and refuge to the Heavenly Worthy of the August Ultimate and Distant Lineage,\nHomage and refuge to the Heavenly Worthy Who Reveals the Great Plan,\nHomage and refuge to the Heavenly Worthy of Perfect Mirroring and Penetrating Illumination,\nHomage and refuge to the Heavenly Worthy Who Expands the Treasure of Vastness,\nHomage and refuge to the Heavenly Worthy Who Upholds the Jade Wheel and Gathers the Celestial Assembly.\n\nHomage and refuge to the Heavenly Worthy Who Harmonizes and Bestows Blessings,\nHomage and refuge to the Heavenly Worthy Who Transcends and Delivers Beyond Limits,\nHomage and refuge to the Heavenly Worthy of Purple Emptiness and Supreme Radiance,\nHomage and refuge to the Heavenly Worthy Who Reveres Benevolence and Transforms with Grace,\nHomage and refuge to the Heavenly Worthy of Vast Stillness and Supreme Tranquility,\nHomage and refuge to the Perfected One of Great Compassion and Great Kindness,\nHomage and refuge to the Perfected One Who Delivers from Suffering and Saves from Calamity.\n\nThis disciple, so-and-so, relying on the true scriptures, reverently pays homage to the Supreme Perfected, earnestly praying with utmost sincerity, repenting wholeheartedly.\n\nConsider the profound and singular truth: though mountains and valleys shift, it remains unchanged. Behold the vast sun and moon: though kalpas crumble, they scarcely pause. Yet within the illusory shadows of human life, who can escape the suffering of sinking and drowning?\n\nAlas, worldly people, pursuing the trivial while forgetting the fundamental, chasing things and indulging emotions. Like ants clinging to a cauldron, they greedily cling to life; like moths fluttering into flame, they heedlessly rush to death. Thus, suffering arises from desire—without desire, there is no wheel of suffering. Sins are committed, and with sins come hells. All who create karmic offenses do so through the three actions and six senses, turning from truth to delusion, their deluded minds inverted, ever foolish and confused. Adrift in the cycle of birth and death, they sink into the realms of suffering.\n\nThus, the eyes gaze upon alluring beauty, the ears listen to frivolous laughter, the mouth recites unorthodox texts, the body dwells near wicked companions, and one indulges in the pleasures of hunting. They offend the Supreme Perfected, disparage sacred scriptures, disrespect rulers and teachers, neglect reverence for elders and parents, covet others’ wealth without satiety, kill sentient beings without pity. Their actions lack foundation, their minds are obscured, they consider only themselves and ignore others’ suffering, seize others’ possessions without thought of their hardship. In movement and stillness, they violate proper conduct, indulging the three actions—killing, stealing, and licentiousness—along with perverse desires, greed, anger, ignorance, cruelty, jealousy, deceitful speech, frivolous words, divisive talk, and vicious curses. For such sins, they shall fall into hell.\n\nNow, before the sacred presence, I sincerely confess: the sins already committed, I dare not conceal; the evil deeds yet to come, I vow never to commit again.\n\nHomage and refuge to the sacred titles of the universally compassionate protectors of the world:\nHomage and refuge to the Heavenly Worthy Who Reveres Truth and Universally Shelters,\nHomage and refuge to the Heavenly Worthy of Far-Reaching Wondrous Virtue,\nHomage and refuge to the Heavenly Worthy Whose Meritorious Works Grace the World,\nHomage and refuge to the Heavenly Worthy of Boundless Virtue,\nHomage and refuge to the Heavenly Worthy Who Transforms and Guides with Goodness,\nHomage and refuge to the Heavenly Worthy of Universal Illumination,\nHomage and refuge to the Heavenly Worthy Who Delivers the World from Suffering,\nHomage and refuge to the Heavenly Worthy Who Dissolves Karmic Obstructions,\nHomage and refuge to the Heavenly Worthy Who Perfects Blessings and Salvation,\nHomage and refuge to the Heavenly Worthy Whose Light Embraces All Existence,\nHomage and refuge to the Heavenly Worthy Who Cherishes All Beings,\nHomage and refuge to the Heavenly Worthy Who Saves the World,\nHomage and refuge to the Heavenly Worthy Who Embodies All Forms,\nHomage and refuge to the Heavenly Worthy Who Encompasses and Sustains All,\nHomage and refuge to the Heavenly Worthy Who Illuminates and Ends Suffering,\nHomage and refuge to the Heavenly Worthy Who Unfolds Light and Rescues from Distress,\nHomage and refuge to the Heavenly Worthy of Supreme Emptiness and Limitlessness,\nHomage and refuge to the Heavenly Worthy Who Nurtures the Origin and Nourishes Purity,\nHomage and refuge to the Heavenly Worthy Who Eliminates Disasters and Dispels Wrath,\nHomage and refuge to the Heavenly Worthy Who Responds to Cries and Bestows Blessings,\nHomage and refuge to the Heavenly Worthy Who Bestows Boundless Grace and Kindness,\nHomage and refuge to the Heavenly Worthy Whose Merits Naturally Transform,\nHomage and refuge to the Perfected One of Great Compassion and Great Kindness,\nHomage and refuge to the Perfected One Who Delivers from Suffering and Saves from Calamity.\n\nThis disciple, so-and-so, relying on the true scriptures, reverently pays homage to the Supreme Perfected, earnestly praying with utmost sincerity, repenting wholeheartedly.\n\nConsider the tiny flame that, if unchecked, can burn a great forest; the trickling stream that, if dammed, can float a mighty vessel. The sins of ordinary beings arise from the mind—if the source is not cut off, they can never be restrained. Habits formed through proximity become ingrained; a few daily transgressions accumulate into thousands. Beginning with a moment’s confusion in the heart, they grow into towering karmic offenses. They deceive heaven, cheat others, dismiss the consequences of good and evil as mere fables. Day by day, month by month, the ghostly ledgers secretly record their deeds. When sins overflow and resentment mounts, heaven’s courts erase their names, and hell’s registers add to their tally. For sins committed in the human realm, the unseen world does not forgive. Across ten thousand kalpas and a thousand lives, the debt remains to be repaid. Some fall as hungry ghosts, others become beasts, tormented by hunger, thirst, exhaustion, whips, and lashes. Without the saving power of the Supreme Perfected, they remain forever mired in suffering, with no hope of liberation. Even if blessed with fortunate causes, how can they repent?\n\nThis disciple, so-and-so, fortunate to be born in the human realm, has encountered this sacred cause, dwelling securely between heaven and earth, nurtured by their benevolent care. Yet, though I strive diligently and remain vigilant, I fear dwelling near evil neighbors, adopting wicked ways, hearing and seeing corrupt things, harboring impure thoughts, and acting without self-awareness—unwittingly accumulating sins. Ignorant of how to purge them, I cannot escape the calamity of falling. Thus, I now prostrate before the Dao, offering this repentance.\n\nI humbly pray that past transgressions and deep-seated impurities may be washed away with a single bow; that reciting the sacred names and jade scriptures may instantly dispel worldly toils. May blessings descend from heaven, and good fortune be cultivated through human effort. May my body abide in purity and emptiness, my gates and thresholds filled with joy and peace.\n\nFor the living: may their years be long and flourishing, their blessings and fortune ever-increasing.\nFor the departed: may their spirits not wander, but roam freely on the clouded paths.\nMay the names of sins be erased from the black ledgers, and virtuous deeds inscribed on the cinnabar tablets.\nFor every prayer offered, may the ten thousand spirits grant their protection.\n\nThis disciple, so-and-so, bows with utmost sincerity and earnest supplication.\n\nThus concludes *The Precious Repentance of the Supreme Clarity for Deliverance from Sin and Ascension to Heaven*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上泰清拔罪升天宝忏 经名：太上泰清拔罪升天宝忏。 一卷。 底本出处：《正统道藏》洞真部威仪类。 太上泰清拔罪升天宝忏 尔时，元始天尊於始青天中，座碧玉宝莲劫仞之台，与无鞅音养圣众，说凝寂含元微妙之法，放大光明，普照十方。 无量世界，无量众生，有缘无绿，悉皆得度。 尔时，光明照见北方酆都罗山诸大地狱，一切群生受诸罪苦。 始见镬汤地狱，牛头狱卒，驱无量罪人，入於镬中、其汤沸涌，入则糜溃，经其一劫，呼其姓名，是男是女，应声而出，肢体复完，形状如初。 又被狱卒驱入一狱，名曰铁床，上有铁銏所谏切，下有大火，无量罪人悉皆而上，须臾之间，骨肉焦烂，又经一劫，复为狱吏呼其姓名，是男是女，应声而起，肢体复完，形亦如初。 又被狱卒驱入一狱，名曰火城，周匝围绕，悉是铁垣，上有铁网，猛烟毒焰，炎炽其间，铜狗铁蛇，口吐大火，忽闻其门，火焰流迸，罪人悉入，门亦复闭，一切罪人，骨肉焦烂，随焰上下，飞踊触网，声振天地，过於雷霆，又经一劫，狱门又启，狱吏呼之，完而复出。 又被狱卒驱入一狱，名曰锯解，将此罪人，铁板夹之，一一锯解，血流成河，自顶至足，解之为二，又经一劫，狱吏呼之，复合为一。 又被狱卒驱于碓下，锉斩万段，及以铁叉，叉入磨内，皆成血泥，又经一劫，狱吏呼之，完具如初。 又被狱卒驱入一狱，名曰刀山剑树之狱，有一大山，崔鬼嵯峨，皆是刀尖，上有大树，枝叶根干，悉是剑刃，罪人入者，刃锋刺足，剑刃割身，皮肤异处，流血成河，如斯受苦，又经一劫，复为狱吏，呼其姓名，一一复完。 又被狱卒驱之而行。 於其众中，有一罪人，在世之日曾看道典，稍知宿命、因缘、果报，睹此光明，心中默念：我等受苦，皆因前世造诸恶业，招此苦报。 於地狱中，经无量劫，冥冥长夜，应无此光，必是元始天尊放大光明，拔度於我。 遂谓众曰：尔等生世恶业深重，不知道典，不识正真，信邪倒见，欺罔幽明，故受此苦，无由出离。 尔等幸会，获瞻此光，可随吾念元始天尊圣号，恳切至诚，愿离此苦。 一切罪人闻是说已、瞻礼光明，应声齐念。 冥官狱吏不能禁止，牛头狱卒变成善人。 须臾之间，无量罪人，枷锁自解，乘光明而去，皆生人道。 太上曰：众生造罪，死入北酆，鬼考罪魂，冤对难抵。 铁城猛焰，车裂镬汤，炮炙刀山，毒蛇碓音对硙音外，寒冰凛冽、剑树嵯峨，闻者悲酸，那堪自受。 冥冥长夜，似蚁循环，常居地狱，若不悟其苦因，预修忏涤，则罪垢日深，当罹此苦。 万劫千生，何由解脱。 汝等自当一心恳祷，归依上真，愿当来世不堕此中，常闻道典，得悟道法，获睹慈光，顿蒙超度，稽首虔诚，归命信礼，太清普慈护世诸尊圣号： 归命信礼太清仙境天尊， 归命信礼解冤释缚天尊， 归命信礼福聚装严天尊， 归命信礼妙乐无为天尊， 归命信礼隐显无碍天尊， 归命信礼真游自在天尊， 归命信礼太明圆极天尊， 归命信礼智炬赫奕天尊， 归命信礼太极无量天尊， 归命信礼开天启德天尊， 归命信礼皇极遐裔天尊， 归命信礼显示丕图天尊， 归命信礼圆鉴洞照天尊， 归命信礼恢弘宝胃天尊， 归命信礼持璇景会天尊，",
      "translated_text": "*The Supreme Taiqing Precious Repentance for Expiating Sins and Ascending to Heaven*\n\nAt that time, the Most High Lord of the Primordial Beginning was seated upon a terrace of jade and precious lotus, towering myriad fathoms high within the Azure Heaven of the Beginning. Surrounded by an immeasurable assembly of sagely beings, he expounded the wondrous and subtle Dharma of Serene Quiescence and Primordial Embrace, radiating great luminosity that universally illumined the ten directions. In boundless worlds, boundless beings—whether with karmic affinity or none—all attained deliverance.\n\nThen, the radiance beheld the great hells of Mount Fengdu in the northern darkness, where all multitudes of beings endured the sufferings of their sins. First, he saw the Hell of Boiling Cauldrons, where ox-headed jailers drove countless sinners into the seething vats. As they entered, their bodies dissolved into pulp. After an eon had passed, their names were called—whether man or woman—and they emerged at the sound, their limbs restored, their forms as before. Yet again, the jailers drove them into another hell, called the Iron Bed. Above, iron spikes pressed down; below, great fires raged. All the sinners were forced upon it, and in an instant, their flesh and bones were scorched to ashes. After another eon, the hell wardens called their names, and they arose once more, their bodies whole, their forms as before.\n\nAgain, the jailers drove them into another hell, called the City of Fire. Surrounding it were iron walls, and above, iron nets. Fierce smoke and poisonous flames blazed within, while bronze dogs and iron serpents spewed forth great fires. Suddenly, the gates opened, and flames surged forth. The sinners entered, and the gates closed behind them. Their flesh and bones were scorched to ashes as they were tossed about by the flames, leaping and striking the nets. Their cries shook heaven and earth, louder than thunder. After another eon, the hell gates opened again, and the wardens called their names, and they emerged whole once more.\n\nAgain, the jailers drove them into another hell, called the Hell of Sawing. The sinners were clamped between iron plates and sawed apart, blood flowing like rivers. From head to foot, they were split in two. After another eon, the wardens called their names, and they were rejoined as one.\n\nAgain, the jailers drove them beneath the pestles, where they were pounded into ten thousand pieces, or impaled on iron forks and ground into bloody pulp. After another eon, the wardens called their names, and they were restored as before.\n\nAgain, the jailers drove them into another hell, called the Hell of Knife Mountains and Sword Trees. There stood a great mountain, jagged and towering, its peaks all blades. Above grew a great tree, its branches, leaves, roots, and trunk all sword edges. When the sinners entered, the blade-tips pierced their feet, and the sword-edges sliced their bodies, their skin torn from their flesh, blood flowing like rivers. After enduring such torment for another eon, the wardens called their names, and they were restored whole once more.\n\nAs the jailers drove them onward, among the multitude there was one sinner who, in his past life, had studied the Daoist scriptures and thus knew something of past lives, karmic conditions, and retribution. Beholding this radiance, he silently thought: *Our suffering here is all due to the evil karma we created in former lives, which has brought this retribution. In the hells, through countless eons, we have languished in endless darkness. This light must be the great luminosity of the Most High Lord of the Primordial Beginning, come to deliver us.* Thereupon, he said to the others: \"You all, in your past lives, accumulated heavy evil karma, ignorant of the scriptures, unaware of the true and real, believing in perverse and inverted views, deceiving both the seen and unseen. Thus, you suffer these torments with no means of escape. But now, by good fortune, you have beheld this light. Follow me in invoking the sacred name of the Most High Lord of the Primordial Beginning with utmost sincerity, and pray to escape this suffering.\"\n\nAll the sinners, hearing these words, gazed reverently upon the light and, as one, began to chant the name. The dark officials and hell wardens could not restrain them, and the ox-headed jailers transformed into benevolent beings. In an instant, the countless sinners’ shackles fell away of themselves. Riding the radiance, they departed and were reborn into the human realm.\n\nThe Most High said: \"When living beings commit sins and die, they enter the northern Fengdu, where ghostly wardens examine their sinful souls, and their karmic adversaries are inescapable. The fierce flames of the Iron City, the dismemberment of the cauldrons, the roasting and burning, the Knife Mountains, the poisonous serpents, the grinding pestles, the freezing ice, the towering Sword Trees—even to hear of these torments is heartrending; how much worse to endure them oneself! In the endless darkness, like ants in a cycle, they dwell perpetually in hell. If they do not awaken to the causes of their suffering and repent in advance, their sins will deepen day by day, and they will surely fall into these torments. Through ten thousand eons and a thousand lives, how will they ever attain liberation? You must wholeheartedly pray and take refuge in the Perfected Ones above, vowing that in future lives you will not fall into these hells, that you may always hear the Daoist scriptures, awaken to the Daoist Dharma, behold the compassionate light, and suddenly attain deliverance.\"\n\nWith bowed heads and utmost sincerity, they paid homage and took refuge, invoking the sacred names of the Venerable Ones of the Taiqing, the Universal Compassion, and the Protectors of the World:\n\nHomage and refuge to the Heavenly Worthy of the Taiqing Immortal Realm,\nHomage and refuge to the Heavenly Worthy Who Dissolves Grievances and Looses Bonds,\nHomage and refuge to the Heavenly Worthy Adorned with Blessings and Splendor,\nHomage and refuge to the Heavenly Worthy of Wondrous Joy and Non-Action,\nHomage and refuge to the Heavenly Worthy of Unobstructed Concealment and Manifestation,\nHomage and refuge to the Heavenly Worthy of True Wandering and Self-Mastery,\nHomage and refuge to the Heavenly Worthy of Supreme Clarity and Perfect Culmination,\nHomage and refuge to the Heavenly Worthy of the Torch of Wisdom, Radiant and Resplendent,\nHomage and refuge to the Heavenly Worthy of the Supreme Ultimate and Boundless,\nHomage and refuge to the Heavenly Worthy Who Opens Heaven and Initiates Virtue,\nHomage and refuge to the Heavenly Worthy of the August Ultimate and Distant Lineage,\nHomage and refuge to the Heavenly Worthy Who Reveals the Great Plan,\nHomage and refuge to the Heavenly Worthy of Perfect Mirroring and Penetrating Illumination,\nHomage and refuge to the Heavenly Worthy Who Expands the Treasure of Vastness,\nHomage and refuge to the Heavenly Worthy Who Upholds the Jade Wheel and Gathers the Celestial Assembly.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1261,
      "start_sentence": 0,
      "end_sentence": 41,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.9731559753418,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\太上泰清拔罪升天宝忏.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "归命信礼钧和布福天尊， 归命信礼超度无极天尊， 归命信礼紫虚太曜天尊， 归命信礼崇仁惠化天尊， 归命信礼虚凝太寂天尊， 归命信礼大慈大惠真人， 归命信礼拔苦度厄真人。 弟子某式凭真诰，虔礼上真，恳祷至诚，一心忏悔。 原夫湛湛一真，陵谷迁而不易； 茫茫二曜，尘劫坏以难停。 人生幻影之中，孰免沉沦之苦。 嗟乎世人，徇末忘本，逐物纵情。 恋釜之蚁，壤壤贪生； 扑焰之蛾，悠悠赴死。 是则本乎爱欲，无爱欲而无苦轮； 造诸罪愆，有罪愆而有地狱。 造罪业者，莫不由兹，三业六根，背真取妄，妄识颠倒，终始愚迷，流浪生死，漂沈苦趣，是以目视妖艳之色，耳 听优笑之声，口习不经之书，居近恶邪之党，游恣畋猎之乐，唐突上真，轻诬圣典，侮慢君师，不敬尊亲，贪取他财，心无厌足，杀害有情，全无恻隐，事无依据，有昧自心，便於己身，不思他苦，曲取人物，不念他艰，动静有为，殊亏轨则，恣纵三业，杀生偷盗，秽乱邪淫，怪贪嗔患，愚痴狠妬，妄语绮言，两舌恶骂，如是等罪，当堕地狱。 今对圣前，诚心发露，已作之罪，不敢覆藏，未来恶业，更不敢作。 归命信礼，普慈护世诸尊圣号： 归命信礼崇真溥覆天尊， 归命信礼遐臻妙德天尊， 归命信礼善功蔼世天尊， 归命信礼德无量天尊， 归命信礼善化导天尊， 归命信礼普光曜天尊， 归命信礼拔世苦天尊， 归命信礼消罪障天尊， 归命信礼福济圆满天尊， 归命信礼光接万有天尊， 归命信礼爱物天尊， 归命信礼救世天尊， 归命信礼体含万像天尊， 归命信礼包括覆载天尊， 归命信礼开明息苦天尊， 归命信礼舒光拔难天尊， 归命信礼太虚无极天尊， 归命信礼毓元养皓天尊， 归命信礼除灾蠲忿天尊， 归命信礼应号赐福天尊， 归命信礼博施恩惠天尊， 归命信礼源功自化天尊， 归命信礼大慈大惠真人， 归命信礼拔苦度厄真人。 弟子某式凭真诰，虔礼上真，恳祷至诚，一心忏悔。 盖夫荧荧不灭，纵之可以焚大麓； 涓涓不止，壅之可以浮巨舟。 凡夫造罪，源乎一心，若不绝源，终难制止。 相近之性，习以为常，日造一二，遂积万千。 始于方寸之情迷，至此深天之罪业，谓天可罔，谓人可欺。 善恶之惩，以为虚诞。 日就月将，鬼簿潜录，恶贯罪盈，人怨神怒。 天曹之善记削名，地狱之罪籍添字。 人间造罪，阴不赦原，万劫千生，满犹受报。 或堕饿鬼，或为畜生，饥渴焦劳，鞭挞楚痛，不遇上真圣力拯拔，永淹此苦，终无解脱，虽有胜因，竟何忏悔。 弟子某幸生人世，值此圣因，获安覆载之间，得沐亭育之德，竞竞自居，日慎无懈，尚恐居近恶邻，游习恶行，耳闻目视，心念身为，不自省知，暗成罪衅，既昧蠲除之法，难逃坠堕之殃。 是以今对道前，特伸忏悔。 伏愿往愆宿垢，一礼而荡涤无遗； 圣号玉书，一诵而尘劳顿尽。 福自天锡，善假人为，身位清虚，阐阈怡泰。 见存者，寿筠长茂，福禄日增； 亡逝者，神识不迷，逍遥云路。 削罪名於黑簿，注善字於丹台。 一念所祈，万灵咸佑。 某无任志诚恳祷之至。 太上泰清拔罪升天宝忏竟",
      "translated_text": "Homage and refuge to the Heavenly Worthy Who Harmonizes and Bestows Blessings,\nHomage and refuge to the Heavenly Worthy Who Transcends and Delivers Beyond Limits,\nHomage and refuge to the Heavenly Worthy of Purple Emptiness and Supreme Radiance,\nHomage and refuge to the Heavenly Worthy Who Reveres Benevolence and Transforms with Grace,\nHomage and refuge to the Heavenly Worthy of Vast Stillness and Supreme Tranquility,\nHomage and refuge to the Perfected One of Great Compassion and Great Kindness,\nHomage and refuge to the Perfected One Who Delivers from Suffering and Saves from Calamity.\n\nThis disciple, so-and-so, relying on the true scriptures, reverently pays homage to the Supreme Perfected, earnestly praying with utmost sincerity, repenting wholeheartedly.\n\nConsider the profound and singular truth: though mountains and valleys shift, it remains unchanged. Behold the vast sun and moon: though kalpas crumble, they scarcely pause. Yet within the illusory shadows of human life, who can escape the suffering of sinking and drowning?\n\nAlas, worldly people, pursuing the trivial while forgetting the fundamental, chasing things and indulging emotions. Like ants clinging to a cauldron, they greedily cling to life; like moths fluttering into flame, they heedlessly rush to death. Thus, suffering arises from desire—without desire, there is no wheel of suffering. Sins are committed, and with sins come hells. All who create karmic offenses do so through the three actions and six senses, turning from truth to delusion, their deluded minds inverted, ever foolish and confused. Adrift in the cycle of birth and death, they sink into the realms of suffering.\n\nThus, the eyes gaze upon alluring beauty, the ears listen to frivolous laughter, the mouth recites unorthodox texts, the body dwells near wicked companions, and one indulges in the pleasures of hunting. They offend the Supreme Perfected, disparage sacred scriptures, disrespect rulers and teachers, neglect reverence for elders and parents, covet others’ wealth without satiety, kill sentient beings without pity. Their actions lack foundation, their minds are obscured, they consider only themselves and ignore others’ suffering, seize others’ possessions without thought of their hardship. In movement and stillness, they violate proper conduct, indulging the three actions—killing, stealing, and licentiousness—along with perverse desires, greed, anger, ignorance, cruelty, jealousy, deceitful speech, frivolous words, divisive talk, and vicious curses. For such sins, they shall fall into hell.\n\nNow, before the sacred presence, I sincerely confess: the sins already committed, I dare not conceal; the evil deeds yet to come, I vow never to commit again.\n\nHomage and refuge to the sacred titles of the universally compassionate protectors of the world:\nHomage and refuge to the Heavenly Worthy Who Reveres Truth and Universally Shelters,\nHomage and refuge to the Heavenly Worthy of Far-Reaching Wondrous Virtue,\nHomage and refuge to the Heavenly Worthy Whose Meritorious Works Grace the World,\nHomage and refuge to the Heavenly Worthy of Boundless Virtue,\nHomage and refuge to the Heavenly Worthy Who Transforms and Guides with Goodness,\nHomage and refuge to the Heavenly Worthy of Universal Illumination,\nHomage and refuge to the Heavenly Worthy Who Delivers the World from Suffering,\nHomage and refuge to the Heavenly Worthy Who Dissolves Karmic Obstructions,\nHomage and refuge to the Heavenly Worthy Who Perfects Blessings and Salvation,\nHomage and refuge to the Heavenly Worthy Whose Light Embraces All Existence,\nHomage and refuge to the Heavenly Worthy Who Cherishes All Beings,\nHomage and refuge to the Heavenly Worthy Who Saves the World,\nHomage and refuge to the Heavenly Worthy Who Embodies All Forms,\nHomage and refuge to the Heavenly Worthy Who Encompasses and Sustains All,\nHomage and refuge to the Heavenly Worthy Who Illuminates and Ends Suffering,\nHomage and refuge to the Heavenly Worthy Who Unfolds Light and Rescues from Distress,\nHomage and refuge to the Heavenly Worthy of Supreme Emptiness and Limitlessness,\nHomage and refuge to the Heavenly Worthy Who Nurtures the Origin and Nourishes Purity,\nHomage and refuge to the Heavenly Worthy Who Eliminates Disasters and Dispels Wrath,\nHomage and refuge to the Heavenly Worthy Who Responds to Cries and Bestows Blessings,\nHomage and refuge to the Heavenly Worthy Who Bestows Boundless Grace and Kindness,\nHomage and refuge to the Heavenly Worthy Whose Merits Naturally Transform,\nHomage and refuge to the Perfected One of Great Compassion and Great Kindness,\nHomage and refuge to the Perfected One Who Delivers from Suffering and Saves from Calamity.\n\nThis disciple, so-and-so, relying on the true scriptures, reverently pays homage to the Supreme Perfected, earnestly praying with utmost sincerity, repenting wholeheartedly.\n\nConsider the tiny flame that, if unchecked, can burn a great forest; the trickling stream that, if dammed, can float a mighty vessel. The sins of ordinary beings arise from the mind—if the source is not cut off, they can never be restrained. Habits formed through proximity become ingrained; a few daily transgressions accumulate into thousands. Beginning with a moment’s confusion in the heart, they grow into towering karmic offenses. They deceive heaven, cheat others, dismiss the consequences of good and evil as mere fables. Day by day, month by month, the ghostly ledgers secretly record their deeds. When sins overflow and resentment mounts, heaven’s courts erase their names, and hell’s registers add to their tally. For sins committed in the human realm, the unseen world does not forgive. Across ten thousand kalpas and a thousand lives, the debt remains to be repaid. Some fall as hungry ghosts, others become beasts, tormented by hunger, thirst, exhaustion, whips, and lashes. Without the saving power of the Supreme Perfected, they remain forever mired in suffering, with no hope of liberation. Even if blessed with fortunate causes, how can they repent?\n\nThis disciple, so-and-so, fortunate to be born in the human realm, has encountered this sacred cause, dwelling securely between heaven and earth, nurtured by their benevolent care. Yet, though I strive diligently and remain vigilant, I fear dwelling near evil neighbors, adopting wicked ways, hearing and seeing corrupt things, harboring impure thoughts, and acting without self-awareness—unwittingly accumulating sins. Ignorant of how to purge them, I cannot escape the calamity of falling. Thus, I now prostrate before the Dao, offering this repentance.\n\nI humbly pray that past transgressions and deep-seated impurities may be washed away with a single bow; that reciting the sacred names and jade scriptures may instantly dispel worldly toils. May blessings descend from heaven, and good fortune be cultivated through human effort. May my body abide in purity and emptiness, my gates and thresholds filled with joy and peace.\n\nFor the living: may their years be long and flourishing, their blessings and fortune ever-increasing.\nFor the departed: may their spirits not wander, but roam freely on the clouded paths.\nMay the names of sins be erased from the black ledgers, and virtuous deeds inscribed on the cinnabar tablets.\nFor every prayer offered, may the ten thousand spirits grant their protection.\n\nThis disciple, so-and-so, bows with utmost sincerity and earnest supplication.\n\nThus concludes *The Precious Repentance of the Supreme Clarity for Deliverance from Sin and Ascension to Heaven*.",
      "overlap_context": "nd refuge to the Heavenly Worthy Who Opens Heaven and Initiates Virtue,\nHomage and refuge to the Heavenly Worthy of the August Ultimate and Distant Lineage,\nHomage and refuge to the Heavenly Worthy Who Reveals the Great Plan,\nHomage and refuge to the Heavenly Worthy of Perfect Mirroring and Penetrating Illumination,\nHomage and refuge to the Heavenly Worthy Who Expands the Treasure of Vastness,\nHomage and refuge to the Heavenly Worthy Who Upholds the Jade Wheel and Gathers the Celestial Assembly.",
      "start_char": 1261,
      "end_char": 2515,
      "start_sentence": 42,
      "end_sentence": 107,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.02764320373535,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\太上泰清拔罪升天宝忏.txt",
        "category": "威仪类"
      }
    }
  ]
}