{
  "source_id": "太上老君开天经",
  "source_file": "chunked_daozang\\太上老君开天经.json",
  "total_chunks": 3,
  "total_original_chars": 2897,
  "total_translated_chars": 15777,
  "total_translation_time": 75.31759715080261,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏续道藏\\太上老君开天经.txt",
    "category": "正统道藏续道藏"
  },
  "full_translation": "**The Scripture of the Most High Lord Lao on the Opening of Heaven**\n\n**Scripture Title:** *The Scripture of the Most High Lord Lao on the Opening of Heaven* (abbreviated as *The Opening of Heaven Scripture*). The original text does not specify an author, but it likely emerged during the Northern and Southern Dynasties. Tang dynasty monk Mingchai’s *Memorial on the Decision to Suppress Buddhist Monks and Abolish Buddhism* states that *The Opening of Heaven Scripture* was composed by Zhang Fu—this likely refers to the present text. It comprises one scroll.\n\n**Source of Base Text:** *The Wanli Continuation of the Daoist Canon*.\n**Collated Edition:** *The Seven Bamboo Tablets of the Cloudy Satchel*, Scroll 2.\n\n---\n\n**The Scripture of the Most High Lord Lao on the Opening of Heaven**\n\nIt is heard that before the existence of Heaven and Earth, beyond the Great Clarity, beyond reckoning or measure, within the boundless Void, there was utter stillness and formlessness. No Heaven, no Earth; no yin, no yang; no sun, no moon; no radiance, no light; no east, no west; no blue, no yellow; no south, no north; no softness, no hardness; no covering, no bearing; no decay, no concealment; no worthies, no sages; no loyalty, no goodness; no going, no coming; no birth, no death; no before, no after; no roundness, no squareness. A hundred million transformations, vast and boundless, without form or image, naturally empty and mysterious—inexhaustible, immeasurable, without height or depth, without equal or bias, without left or right, high and low in natural harmony.\n\nOnly I, Lord Lao, dwelled beyond the empty mystery and stillness, within the profound Void. Though unseen and unheard, if one speaks of existence, no form is visible; if one speaks of nonexistence, the myriad things arise from it. Beyond the eight directions, gradual differentiation began, descending into subtlety to form the world, giving rise to the Hongyuan.\n\nDuring the Hongyuan, Heaven and Earth had not yet taken shape. The Void remained undivided, and the clear and turbid were yet unseparated, existing within the profound stillness. The Hongyuan endured for ten thousand kalpas. When the Hongyuan ended, the Hunyuan began. The Hunyuan endured for ten thousand kalpas, culminating in a hundred completions—each completion spanning eighty-one myriad years—before the Taihu arose.\n\nIn the Taihu, Lord Lao descended from the Void to become the teacher of the Taihu. From his mouth issued *The Scripture on the Opening of Heaven*, comprising 480,000 scrolls, each containing 480,000 characters, with each character spanning a hundred *li*. With this, he instructed the Taihu.\n\nThe Taihu began to distinguish Heaven and Earth, separating the clear from the turbid. The primordial chaos took shape, establishing forms and images, solidifying north and south, regulating east and west, revealing brightness, illuminating the four directions and the realms above and below, within and without, long and short, coarse and fine, male and female, black and white, great and small, noble and base—all as if wandering in darkness.\n\nHaving received this scripture from Lord Lao on the opening of Heaven, the clear and turbid were now divided: the clear *qi* ascended to form Heaven, while the turbid *qi* descended to form Earth. The Three Principles were established, and from this, Heaven and Earth came into being. Yet the sun and moon did not yet exist. When Heaven desired to transform things but found no means to do so, it placed the sun and moon within, illuminating the darkness below.\n\nThough the Taihu had sun and moon, there were no people. Gradually, life began to emerge: above, it drew the essence of Heaven; below, the essence of Earth; and in the middle, these harmonized to form a spirit—called *human*. Heaven and Earth being empty, the Three Powers began to take shape. All living things, though formless in appearance, each received a single *qi* to come into being. Some arose from the *qi* of stillness—such as mountains and stones; some from the *qi* of movement—such as birds and beasts; and some from the *qi* of essence—such as humans. Among the myriad things, humans were the most noble.\n\nThe Taihu endured for ten thousand kalpas. The first people emerged during this time, hence it was called the Taihu. At this stage, there were only Heaven, Earth, sun, moon, and people—yet no names or knowledge existed.\n\nWhen the Taihu ended, the Taishi began. During the Taishi, Lord Lao descended to become its teacher. From his mouth issued *The Scripture of the Taishi*, with which he instructed the Taishi, establishing ninety-one kalpas for the world. These ninety-one kalpas culminated in a hundred completions—each completion spanning eighty-one myriad years.\n\nThe Taishi marked the beginning of the myriad things, hence it was called the Taishi. Through circulation and refinement, images appeared within, and *qi* became visible. From this transformation, yin and yang took form.\n\nWhen the Taishi ended, the Taisu began. During the Taisu, Lord Lao descended to become its teacher, instructing the Taisu in the ways of governing the world. It endured for eighty-one kalpas, culminating in a hundred completions—each completion spanning eighty-one myriad years.\n\nThe Taisu was the essence of the myriad things, hence it was called the Taisu. From the Taihu onward to the Taisu, Heaven produced sweet dew, and Earth yielded sweet springs. The people consumed them and attained longevity. Death came without burial; corpses were abandoned in distant wilds—this was called the High Antiquity.\n\nWhen the Taisu ended, the Hundun began. During the Hundun, mountains and rivers first appeared. Lord Lao descended to become its teacher, instructing the Hundun in governing the world for seventy-two kalpas. As the Hundun flowed and transformed, mountains and rivers took shape—the Five Peaks and Four Waterways, with their heights and depths, noble and base—all began at this time.\n\nFrom the Hundun onward, names and knowledge emerged. The Hundun gave birth to two sons: the elder, Hu Chen, and the younger, Hu Ling. When Hu Chen died, he became the spirit of mountains and peaks; when Hu Ling died, he became the spirit of waters. Thus, the Five Peaks and Four Waterways were named, and the heights and depths of mountains and rivers were established. When the Hundun ended, the Nine Palaces arose.\n\nDuring the Nine Palaces, Lord Lao descended to become its teacher. From his mouth issued *The Scripture of Qian and Kun*, with which he structured the Nine Palaces, imparting names to Heaven and Earth. The clear *qi* became Heaven, and the turbid *qi* became Earth. From the Nine Palaces onward, Heaven was yang, and Earth was yin. Yang was firm and strong, difficult to perceive from afar. In Heaven, it formed images—such as the sun, moon, and stars; on Earth, it formed shapes—such as the Five Peaks and Four Waterways; in humans, it gave rise to life—such as the heart, liver, and five viscera. Though their names differed, in essence, they were one.\n\nAfter the Nine Palaces ended, the Primordial Sovereign arose. During the reign of the Primordial Sovereign, Lord Lao descended to become his teacher, issuing from his mouth *The Scripture of the Primordial Sovereign*. He instructed the Primordial Sovereign in governing the world, and from that time onward, imperial transformation began to flow through later generations, gradually taking form.\n\nAfter the Primordial Sovereign came the Supreme Sovereign. During the reign of the Supreme Sovereign, Lord Lao descended to become his teacher, instructing him in the governance of the world. After the Supreme Sovereign came the Earthly Sovereign, then the Human Sovereign, followed by Zunlu, Julou, Hexu, and Tailian. From Tailian backward to the time of Hundun was called the Middle Antiquity. In that era, Heaven produced the Five Blacks, and Earth yielded the Five Flavors. The people consumed them and thus prolonged their years.\n\nAfter Tailian came Fuxi, born at the origin of the One Source, succeeding Heaven in birth. He harmonized and practiced yin and yang, establishing the Eight Trigrams. Before Fuxi, the Five Classics did not record, and written texts did not transmit. Only Lord Lao, from the boundless emptiness beyond the Great Clarity—numberless as the sands of the Ganges—had existed. Since the Dao divided and Heaven and Earth came into being, he established imperial transformation, aiding the Heavenly Thearch and transmitting it to later generations, recording it himself.\n\nDuring Fuxi’s reign, Lord Lao descended to become his teacher, known as the Master of Non-Transformation, also called Master Yuhua. He taught Fuxi to extend the old methods, expound yin and yang, rectify the eight directions, and establish the Eight Trigrams, composing *The Scripture of Primordial Yang* to instruct him. Before Fuxi, there were no surnames or given names, only personal names. At that time, the people were simple and honest, without the Five Grains. Fuxi taught them to cast nets and snares to capture birds and beasts for food. They clothed themselves in fur and drank blood, their diet rank and foul. Men and women made no distinctions, bore no jealousy or resentment. In winter, they dwelled in caves; in summer, they nested in trees.\n\nAfter Fuxi came Nüwa. After Nüwa came Shennong. During Shennong’s reign, Lord Lao descended to become his teacher, known as Master Dacheng. He composed *The Scripture of the Great Subtlety* to teach Shennong to taste the hundred herbs, obtain the Five Grains, and plant them for the people to consume, thus replacing the lives of birds and beasts.\n\nAfter Shennong came Suiren. During Suiren’s time, Lord Lao descended to become his teacher, instructing him to drill wood to produce fire, continuing the light of the sun, transforming raw into cooked, and eliminating rankness and foulness.\n\nAfter Suiren came Zhurong. During Zhurong’s reign, Lord Lao descended to become his teacher, known as Master Guangshou. He taught the cultivation of the Three Bonds, the regulation of the Seven Governances, and the practice of the Dao by the Three Sovereigns, so that all people were free from illness. He composed *The Scripture of Massage and Qi Circulation*.\n\nNext came three generations: Gaoyuan, Gaoyang, and Gaoxin. Then came Cangjie and Zhongshuo, who taught writing and literature.\n\nAfter the Three Sovereigns came the Yellow Thearch, Xuanyuan. During the Yellow Thearch’s reign, Lord Lao descended to become his teacher, known as Master Guangcheng. He regulated yin and yang, composing *The Scripture of Daoist Precepts* and *The Scripture of the Dao*. From the Yellow Thearch onward, distinctions arose between ruler and subject, father and son, noble and base.\n\nAfter the Yellow Thearch came Shaohao. During Shaohao’s reign, Lord Lao descended to become his teacher, known as Master Suiying. He composed *The Scripture of the Mysterious Treasury*. At that time, the world was at peace: auspicious grain grew, sweet springs flowed, qilin appeared, phoenixes arrived, and propitious stars shone.\n\nAfter Shaohao came Emperor Zhuanxu. During Zhuanxu’s reign, Lord Lao descended to become his teacher, known as Master Chijing. He composed *The Scripture of Subtle Words*.\n\nAfter Zhuanxu came Emperor Ku. After Emperor Ku came Emperor Yao. During Emperor Yao’s reign, Lord Lao descended to become his teacher, known as Master Wucheng. He composed *The Scripture of Governance*.\n\nAfter Emperor Yao came Emperor Shun. During Emperor Shun’s reign, Lord Lao descended to become his teacher, known as Master Yinshou. He composed *The Scripture of the Great Clarity*.\n\nAfter Emperor Shun came Yu of Xia. During Yu’s reign, Lord Lao descended to become his teacher, known as Master Zhenxing. He composed *The Scripture of Virtue and Sincerity*.\n\nAfter Yu came Tang of Yin. After Tang came the beginning of Zhou. During the early Zhou, Lord Lao descended to become the teacher, known as Master Xieyi. He composed *The Scripture of Red Essence*.\n\nLord Lao said: \"At the beginning of secret transformation, my form was emptiness and nothingness. I passed through endless eons, undergoing myriad transformations. First descending to become the teacher, before the Three Sovereigns, I was the root of divine transformation. Thereafter, I transformed to become the teacher of the Three Sovereigns and Five Thearchs, as well as the Three Kings, all of whom I exhorted to cultivate goodness.\n\nHeaven is one, Earth two, humans three, seasons four, sounds five, pitch pipes six, stars seven, winds eight, and provinces nine—together they number forty-five. Zi, Mao, and You.\n\nAt the center, each has nine calculations: wearing nine and treading one, three on the left and seven on the right, two and four as shoulders, six and eight as feet, with five at the center like a tortoise. The body forms the Eight Trigrams.\n\nWater flows to its end, dividing eight to reach Chou. Leaves fall to return to their root, dividing six to reach Hai. Metal and wood are strong in their essence, dividing two to reach Wei. Earth reigns in the four seasons, dividing four to reach Ji. Kan laments its solitary course, Li’s brightness numbers four. Gen’s eight are lofty and scattered. Three follow Kun’s position. Qian faces Kun, pursuing the one. Xun sighs at the Gate of Heaven, borrowing one from Qian. Zhen’s thunder shakes the marsh, reduced by Dui. Chen, Wu, You, and Hai are the trigrams of self-formed images, each containing its eight. When the trigrams are complete, the remaining nine counting rods form the character *yi* (change).\n\nLord Lao then expounded the method of the Moving Cycle and its guard: \"The method of the Moving Cycle has its own guard. First, raise Kan [one] to join Kun [two]. In the southwest is the Queen Mother of the West; in the east, the Azure Dragon. Cultivate *qi* to send forth its descendants, inquiring at the Earthly Gate. Xun’s four cycles enter the Central Palace, then emerge from the Central Palace to ascend to Qian. In the west lies the Great Marsh, the peak of Mount Hua. In the northeast, inquire at Yin and Gen. In the south, the fiery blaze of Li and Mount Huo. Suddenly transforming, enter the mystery in the north.\"\n\nThe *Scripture of the Most High Lord Lao on the Opening of Heaven* concludes here. (Variant: *wu pian* [“without partiality”], recorded as *wu pian* [“without bias”] in *Seven Bamboo Tablets of the Cloudy Satchel*, fascicle 2, *Scripture of Lord Lao on the Opening of Heaven*.) This is correct. (Variant: *ling* [“numinous”]; according to the preceding text, should be *Hu Ling* [“Barbarian Numinous One”].) (Variant: *er jiu gong* [“and the Nine Palaces”]; according to the *Seven Bamboo Tablets* version, should be *er you jiu gong* [“and there are the Nine Palaces”].) (Before this sentence, the *Seven Bamboo Tablets* version includes the phrase “taking the name of the Three Rigids.”) (Variant: *Jin* [“Jin dynasty”]; the *Seven Bamboo Tablets* version reads *chang* [“once”].) (Variant: *Guangchengzi*; the *Seven Bamboo Tablets* version reads *Limuzi*.) (Variant: *Daojing* [“Scripture of the Dao”]; the *Seven Bamboo Tablets* version reads *Daokang Jing* [“Scripture of the Health of the Dao”].) (Variant: *Chijingzi*; the *Seven Bamboo Tablets* version reads *Yuanyangzi Yi*.) (Variant: *Zhenxingzi*; the *Seven Bamboo Tablets* version reads *Zhiyuzi*.) (Variant: *Xieyizi*; the *Seven Bamboo Tablets* version reads *Guoshuzi*.) (Variant: *zi-mao-you* [“zi, mao, and you”]; the *Seven Bamboo Tablets* version reads *zi-wu-mao-you* [“zi, wu, mao, and you”].) (Variant: *Gaoshan*; the *Seven Bamboo Tablets* version reads *Gaocan*.) (Variant: *zixing* [“self-formed”]; the *Seven Bamboo Tablets* version reads *zixing* [“self-punishment”].)",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上老君开天经 经名：太上老君开天经。 简称《开天经》。 原不题撰人，约出朴南北朝。 唐释明柴《决对传奕废佛僧事表》称：《开天经》账浮所造。 当即指此经。 一卷。 底本出处：《万历续道藏》。 参校本：《云笈七签》卷二。 太上老君开天经 盖闻未有天地之问，太清之外，不可称计，虚无之裹，寂寞无表，无天无地，无阴无阳，无日无月，无晶无光，无东无西，无青无黄，无南无北，无柔无刚，无覆无载，无坏无藏，无贤无圣，无忠无良，无去无来，无生无亡，无前无后，无圆无方，百亿变化，浩浩荡荡，无形无象，自然空玄，穷之难极，无量无边，无高无下，无等无偏#1，无左无右，高下自然。 唯吾老君犹处空玄寂寥之外，玄虚之中，视之不见，听之不闻，若言有，不见其形，若言无，万物从之而生，八表之外，渐渐始分，下成微妙，以为世界，而有洪元。 洪元之时，亦未有天地，虚空未分，清浊未判，玄虚寂寥之裹。 洪元一治至於万劫，洪元既判，而有混元。 混元一治万劫，至于百成，百成亦八十一万年，而有太初。 太初之时，老君从虚空而下，为太初之师，口吐《开天经》一部，四十八万卷，一卷有四十八万字，一字辟方一百里，以教太初。 太初始分别天地，清浊剖判，淇津洪蒙，置立形象，安坚南北，制正东西，开间显明，光格四维上下，内外表裹，长短粗细，雌雄白黑，大小尊卑，常如夜行。 太初得此老君开天之经，清浊已分，清气上升为天，浊气下沉为地，三纲既分，从此始有天地，犹未有日月，天欲化物，无方可变，便乃置生日月在其中，下照间冥。 太初时虽有日月，未有人民，渐始初生，上取天精，下取地精，中问和合，以成一神，名曰人也。 天地既空，三分始有，生生之类，无形之象，各受一气而生，或有朴气而生者，山石是也，动气而生者，飞走是也，精气而生者，人是也，万物之中，人最为贵。 太初一治至于万劫，人民之初，故日太初，是时唯有天地日月人民，都未有识名。 太初既没而有太始。 太始之时，老君下为师，口吐《太始经》一部，教其太始，置立天下九十一劫，九十一劫者，至于百成，百成者，亦八十一万年。 太始者，万物之始也，故曰太始，流转成练素，象於中而见气，实自变得成阴阳。 太始既没，而有太素。 太素之时，老君下降为师，教示太素，以法天下，八十一劫，至于百成，亦八十一万年。 太素者，万物之素，故曰太素。 太初已下，太素已来，天生甘露，地生醴泉，人民食之，乃得长生，死不知葬埋，弃尸於远野，名日上古。 太素既没，而有混沌。 混沌之时，始有山川。 老君下为师，教示混沌，以治天下七十二劫，混沌流行，成其山川，五岳四渎，高下尊卑，乃其始起也。 混沌已来，始有识名，混沌号生二子，大者胡臣，小者胡灵，胡臣死为山岳神，灵#2死为水神，因即名为五岳四渎，山川高下，混沌既没，而九宫#3。 九宫之时，老君下为师，口吐《乾坤经》一部，结其九宫，识名天地，清气为天，浊气为地，从九宫已来，天是阳，地是阴，阳者刚强，远视难睹，在天成象，日月星辰是也，在地成形，五岳四读是也，在人成生，心肝五脏是也，分别名之有异，总而名之是一也#4。",
      "translated_text": "**The Scripture of the Most High Lord Lao on the Opening of Heaven**\n\n**Scripture Title:** *The Scripture of the Most High Lord Lao on the Opening of Heaven* (abbreviated as *The Opening of Heaven Scripture*). The original text does not specify an author, but it likely emerged during the Northern and Southern Dynasties. Tang dynasty monk Mingchai’s *Memorial on the Decision to Suppress Buddhist Monks and Abolish Buddhism* states that *The Opening of Heaven Scripture* was composed by Zhang Fu—this likely refers to the present text. It comprises one scroll.\n\n**Source of Base Text:** *The Wanli Continuation of the Daoist Canon*.\n**Collated Edition:** *The Seven Bamboo Tablets of the Cloudy Satchel*, Scroll 2.\n\n---\n\n**The Scripture of the Most High Lord Lao on the Opening of Heaven**\n\nIt is heard that before the existence of Heaven and Earth, beyond the Great Clarity, beyond reckoning or measure, within the boundless Void, there was utter stillness and formlessness. No Heaven, no Earth; no yin, no yang; no sun, no moon; no radiance, no light; no east, no west; no blue, no yellow; no south, no north; no softness, no hardness; no covering, no bearing; no decay, no concealment; no worthies, no sages; no loyalty, no goodness; no going, no coming; no birth, no death; no before, no after; no roundness, no squareness. A hundred million transformations, vast and boundless, without form or image, naturally empty and mysterious—inexhaustible, immeasurable, without height or depth, without equal or bias, without left or right, high and low in natural harmony.\n\nOnly I, Lord Lao, dwelled beyond the empty mystery and stillness, within the profound Void. Though unseen and unheard, if one speaks of existence, no form is visible; if one speaks of nonexistence, the myriad things arise from it. Beyond the eight directions, gradual differentiation began, descending into subtlety to form the world, giving rise to the Hongyuan.\n\nDuring the Hongyuan, Heaven and Earth had not yet taken shape. The Void remained undivided, and the clear and turbid were yet unseparated, existing within the profound stillness. The Hongyuan endured for ten thousand kalpas. When the Hongyuan ended, the Hunyuan began. The Hunyuan endured for ten thousand kalpas, culminating in a hundred completions—each completion spanning eighty-one myriad years—before the Taihu arose.\n\nIn the Taihu, Lord Lao descended from the Void to become the teacher of the Taihu. From his mouth issued *The Scripture on the Opening of Heaven*, comprising 480,000 scrolls, each containing 480,000 characters, with each character spanning a hundred *li*. With this, he instructed the Taihu.\n\nThe Taihu began to distinguish Heaven and Earth, separating the clear from the turbid. The primordial chaos took shape, establishing forms and images, solidifying north and south, regulating east and west, revealing brightness, illuminating the four directions and the realms above and below, within and without, long and short, coarse and fine, male and female, black and white, great and small, noble and base—all as if wandering in darkness.\n\nHaving received this scripture from Lord Lao on the opening of Heaven, the clear and turbid were now divided: the clear *qi* ascended to form Heaven, while the turbid *qi* descended to form Earth. The Three Principles were established, and from this, Heaven and Earth came into being. Yet the sun and moon did not yet exist. When Heaven desired to transform things but found no means to do so, it placed the sun and moon within, illuminating the darkness below.\n\nThough the Taihu had sun and moon, there were no people. Gradually, life began to emerge: above, it drew the essence of Heaven; below, the essence of Earth; and in the middle, these harmonized to form a spirit—called *human*. Heaven and Earth being empty, the Three Powers began to take shape. All living things, though formless in appearance, each received a single *qi* to come into being. Some arose from the *qi* of stillness—such as mountains and stones; some from the *qi* of movement—such as birds and beasts; and some from the *qi* of essence—such as humans. Among the myriad things, humans were the most noble.\n\nThe Taihu endured for ten thousand kalpas. The first people emerged during this time, hence it was called the Taihu. At this stage, there were only Heaven, Earth, sun, moon, and people—yet no names or knowledge existed.\n\nWhen the Taihu ended, the Taishi began. During the Taishi, Lord Lao descended to become its teacher. From his mouth issued *The Scripture of the Taishi*, with which he instructed the Taishi, establishing ninety-one kalpas for the world. These ninety-one kalpas culminated in a hundred completions—each completion spanning eighty-one myriad years.\n\nThe Taishi marked the beginning of the myriad things, hence it was called the Taishi. Through circulation and refinement, images appeared within, and *qi* became visible. From this transformation, yin and yang took form.\n\nWhen the Taishi ended, the Taisu began. During the Taisu, Lord Lao descended to become its teacher, instructing the Taisu in the ways of governing the world. It endured for eighty-one kalpas, culminating in a hundred completions—each completion spanning eighty-one myriad years.\n\nThe Taisu was the essence of the myriad things, hence it was called the Taisu. From the Taihu onward to the Taisu, Heaven produced sweet dew, and Earth yielded sweet springs. The people consumed them and attained longevity. Death came without burial; corpses were abandoned in distant wilds—this was called the High Antiquity.\n\nWhen the Taisu ended, the Hundun began. During the Hundun, mountains and rivers first appeared. Lord Lao descended to become its teacher, instructing the Hundun in governing the world for seventy-two kalpas. As the Hundun flowed and transformed, mountains and rivers took shape—the Five Peaks and Four Waterways, with their heights and depths, noble and base—all began at this time.\n\nFrom the Hundun onward, names and knowledge emerged. The Hundun gave birth to two sons: the elder, Hu Chen, and the younger, Hu Ling. When Hu Chen died, he became the spirit of mountains and peaks; when Hu Ling died, he became the spirit of waters. Thus, the Five Peaks and Four Waterways were named, and the heights and depths of mountains and rivers were established. When the Hundun ended, the Nine Palaces arose.\n\nDuring the Nine Palaces, Lord Lao descended to become its teacher. From his mouth issued *The Scripture of Qian and Kun*, with which he structured the Nine Palaces, imparting names to Heaven and Earth. The clear *qi* became Heaven, and the turbid *qi* became Earth. From the Nine Palaces onward, Heaven was yang, and Earth was yin. Yang was firm and strong, difficult to perceive from afar. In Heaven, it formed images—such as the sun, moon, and stars; on Earth, it formed shapes—such as the Five Peaks and Four Waterways; in humans, it gave rise to life—such as the heart, liver, and five viscera. Though their names differed, in essence, they were one.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1253,
      "start_sentence": 0,
      "end_sentence": 32,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.243647575378418,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\太上老君开天经.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "九宫没后，而有元皇。 元皇之时，老君下为师，口吐《元皇经》一部，教元皇治於天下，始有皇化通流后代，以渐成之，元皇之后，次有太上皇。 太上皇之时，老君下为师，教示太上皇以治天下，太上皇之后，而有地皇，地皇之后，而有人皇，人皇之后，而有尊卢，尊卢之后，而有句娄，句娄之后，而有赫胥，赫胥之后，而有太连，太连已前，混沌己来，名曰中古。 余时天生五黑，地生五味，人民食之，乃得延年。 太连之后，而有伏羲，生於一源之始，继天而生，调习阴阳，以定八卦，自伏羲已前，五经不载，书文不达，唯有老君，从天虚空无亿河沙，在太清之外，不可称计，大道既分，天地已来，开置皇化，转佐天帝，通流后世，以自记之。 伏羲之时，老君下为师，号日无化子，一名郁华子，教示伏羲，推旧法，演阴阳，正八方，定八卦，作《元阳经》以教。 伏羲以前未有姓字，直有其名，余时人民朴直，未有五谷，伏羲乃教以张罗网捕禽兽而食之，皆衣毛茹血，腥躁臭秽，男女无别，不相嫉拓，冬则穴处，夏则巢居。 伏羲没后，而有女娲，女娲〔殁后〕，而有神农。 神农之时，老君下为师，号曰大成子，作《太微经》教神农晋#5百草，得五谷，与人民播植，遂食之，以代禽兽之命也，神农没后，而有燧人。 燧人时，老君下为师，教示燧人钻木出火，续日之光，变生为熟，以除腥躁。 燧人没后，而有祝融。 祝融之时，老君下为师，号广寿子，教修三纲，齐七政，三皇修道，人皆不病，作《按摩通精经》。 次有高原、高阳、高辛三世，次有苍颉、仲说，教书学文。 三皇之后，而有轩辕黄帝。 黄帝之时，老君下为师，号曰广成子#6，消息阴阳，作《道戒经》道经#7。 黄帝以来，始有君臣父子，尊卑以别，贵贱有殊。 黄帝之后，次有少昊。 少昊之时，老君下为师，号曰随应子，作《玄藏经》，伞时升平，嘉禾生，醴泉出，麒麟至，凤凰来，景星照。 少昊之后，次有帝颛顼。 颛项之时，老君下为师，号日赤精子#8，作《微言经》。 颛顼没后，而有帝誉。 帝誉之后，而有帝尧。 帝尧之时，老君下为师，号曰务成子，作《政事经》。 帝尧之后，而有帝舜。 帝舜之时，老君下为师，号曰尹寿子，作《太清经》。 帝舜之后，而有夏禹。 夏禹之时，老君下为师，号日真行子#9，作《德诚经》。 夏禹之后而有殷汤，殷汤之后，而至周初。 周初时，老君下为师，号曰燮邑子#10，作《赤精经》。 老君曰：秘化之初，吾体虚无，经历无穷，千变万化，先下为师，三皇已前，为神化之本，吾后化三皇五帝为师，并及三王，皆劝令修善。 天不地二、人三、时四、音五、律六、星七、风八、州九，合有四十五。 子卯酉#11。 中央各有九算，戴九履一，左三右七，二四为肩，六八为足，中有五龟，体成八卦。 水流归末，分八至丑，叶落归本，分六至亥，金刚本强，分二至未，土王四季，分四至己，坎怨独走，离明数四，艮八高掺#12，三从坤位，乾当城坤，与一相逐，巽吁天门，从乾贷一，震雷动泽，从兑所减，辰午酉亥，自形#13之卦，各内其八，卦以成，余有九筹成易字。 老君即演行期卫曰：行期之法自有卫，先举坎［一〕就坤二，西南王母东青龙，习气发裔地户问，巽上四期入中宫，等出中宫升於乾，西之大泽华山颠，东北之上寅艮问，南之炎火离霍山，番然变化北入玄。",
      "translated_text": "After the Nine Palaces ended, the Primordial Sovereign arose. During the reign of the Primordial Sovereign, Lord Lao descended to become his teacher, issuing from his mouth *The Scripture of the Primordial Sovereign*. He instructed the Primordial Sovereign in governing the world, and from that time onward, imperial transformation began to flow through later generations, gradually taking form.\n\nAfter the Primordial Sovereign came the Supreme Sovereign. During the reign of the Supreme Sovereign, Lord Lao descended to become his teacher, instructing him in the governance of the world. After the Supreme Sovereign came the Earthly Sovereign, then the Human Sovereign, followed by Zunlu, Julou, Hexu, and Tailian. From Tailian backward to the time of Hundun was called the Middle Antiquity. In that era, Heaven produced the Five Blacks, and Earth yielded the Five Flavors. The people consumed them and thus prolonged their years.\n\nAfter Tailian came Fuxi, born at the origin of the One Source, succeeding Heaven in birth. He harmonized and practiced yin and yang, establishing the Eight Trigrams. Before Fuxi, the Five Classics did not record, and written texts did not transmit. Only Lord Lao, from the boundless emptiness beyond the Great Clarity—numberless as the sands of the Ganges—had existed. Since the Dao divided and Heaven and Earth came into being, he established imperial transformation, aiding the Heavenly Thearch and transmitting it to later generations, recording it himself.\n\nDuring Fuxi’s reign, Lord Lao descended to become his teacher, known as the Master of Non-Transformation, also called Master Yuhua. He taught Fuxi to extend the old methods, expound yin and yang, rectify the eight directions, and establish the Eight Trigrams, composing *The Scripture of Primordial Yang* to instruct him. Before Fuxi, there were no surnames or given names, only personal names. At that time, the people were simple and honest, without the Five Grains. Fuxi taught them to cast nets and snares to capture birds and beasts for food. They clothed themselves in fur and drank blood, their diet rank and foul. Men and women made no distinctions, bore no jealousy or resentment. In winter, they dwelled in caves; in summer, they nested in trees.\n\nAfter Fuxi came Nüwa. After Nüwa came Shennong. During Shennong’s reign, Lord Lao descended to become his teacher, known as Master Dacheng. He composed *The Scripture of the Great Subtlety* to teach Shennong to taste the hundred herbs, obtain the Five Grains, and plant them for the people to consume, thus replacing the lives of birds and beasts.\n\nAfter Shennong came Suiren. During Suiren’s time, Lord Lao descended to become his teacher, instructing him to drill wood to produce fire, continuing the light of the sun, transforming raw into cooked, and eliminating rankness and foulness.\n\nAfter Suiren came Zhurong. During Zhurong’s reign, Lord Lao descended to become his teacher, known as Master Guangshou. He taught the cultivation of the Three Bonds, the regulation of the Seven Governances, and the practice of the Dao by the Three Sovereigns, so that all people were free from illness. He composed *The Scripture of Massage and Qi Circulation*.\n\nNext came three generations: Gaoyuan, Gaoyang, and Gaoxin. Then came Cangjie and Zhongshuo, who taught writing and literature.\n\nAfter the Three Sovereigns came the Yellow Thearch, Xuanyuan. During the Yellow Thearch’s reign, Lord Lao descended to become his teacher, known as Master Guangcheng. He regulated yin and yang, composing *The Scripture of Daoist Precepts* and *The Scripture of the Dao*. From the Yellow Thearch onward, distinctions arose between ruler and subject, father and son, noble and base.\n\nAfter the Yellow Thearch came Shaohao. During Shaohao’s reign, Lord Lao descended to become his teacher, known as Master Suiying. He composed *The Scripture of the Mysterious Treasury*. At that time, the world was at peace: auspicious grain grew, sweet springs flowed, qilin appeared, phoenixes arrived, and propitious stars shone.\n\nAfter Shaohao came Emperor Zhuanxu. During Zhuanxu’s reign, Lord Lao descended to become his teacher, known as Master Chijing. He composed *The Scripture of Subtle Words*.\n\nAfter Zhuanxu came Emperor Ku. After Emperor Ku came Emperor Yao. During Emperor Yao’s reign, Lord Lao descended to become his teacher, known as Master Wucheng. He composed *The Scripture of Governance*.\n\nAfter Emperor Yao came Emperor Shun. During Emperor Shun’s reign, Lord Lao descended to become his teacher, known as Master Yinshou. He composed *The Scripture of the Great Clarity*.\n\nAfter Emperor Shun came Yu of Xia. During Yu’s reign, Lord Lao descended to become his teacher, known as Master Zhenxing. He composed *The Scripture of Virtue and Sincerity*.\n\nAfter Yu came Tang of Yin. After Tang came the beginning of Zhou. During the early Zhou, Lord Lao descended to become the teacher, known as Master Xieyi. He composed *The Scripture of Red Essence*.\n\nLord Lao said: \"At the beginning of secret transformation, my form was emptiness and nothingness. I passed through endless eons, undergoing myriad transformations. First descending to become the teacher, before the Three Sovereigns, I was the root of divine transformation. Thereafter, I transformed to become the teacher of the Three Sovereigns and Five Thearchs, as well as the Three Kings, all of whom I exhorted to cultivate goodness.\n\nHeaven is one, Earth two, humans three, seasons four, sounds five, pitch pipes six, stars seven, winds eight, and provinces nine—together they number forty-five. Zi, Mao, and You.\n\nAt the center, each has nine calculations: wearing nine and treading one, three on the left and seven on the right, two and four as shoulders, six and eight as feet, with five at the center like a tortoise. The body forms the Eight Trigrams.\n\nWater flows to its end, dividing eight to reach Chou. Leaves fall to return to their root, dividing six to reach Hai. Metal and wood are strong in their essence, dividing two to reach Wei. Earth reigns in the four seasons, dividing four to reach Ji. Kan laments its solitary course, Li’s brightness numbers four. Gen’s eight are lofty and scattered. Three follow Kun’s position. Qian faces Kun, pursuing the one. Xun sighs at the Gate of Heaven, borrowing one from Qian. Zhen’s thunder shakes the marsh, reduced by Dui. Chen, Wu, You, and Hai are the trigrams of self-formed images, each containing its eight. When the trigrams are complete, the remaining nine counting rods form the character *yi* (change).\n\nLord Lao then expounded the method of the Moving Cycle and its guard: \"The method of the Moving Cycle has its own guard. First, raise Kan [one] to join Kun [two]. In the southwest is the Queen Mother of the West; in the east, the Azure Dragon. Cultivate *qi* to send forth its descendants, inquiring at the Earthly Gate. Xun’s four cycles enter the Central Palace, then emerge from the Central Palace to ascend to Qian. In the west lies the Great Marsh, the peak of Mount Hua. In the northeast, inquire at Yin and Gen. In the south, the fiery blaze of Li and Mount Huo. Suddenly transforming, enter the mystery in the north.\"",
      "overlap_context": "e Palaces, imparting names to Heaven and Earth. The clear *qi* became Heaven, and the turbid *qi* became Earth. From the Nine Palaces onward, Heaven was yang, and Earth was yin. Yang was firm and strong, difficult to perceive from afar. In Heaven, it formed images—such as the sun, moon, and stars; on Earth, it formed shapes—such as the Five Peaks and Four Waterways; in humans, it gave rise to life—such as the heart, liver, and five viscera. Though their names differed, in essence, they were one.",
      "start_char": 1253,
      "end_char": 2579,
      "start_sentence": 33,
      "end_sentence": 67,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.70323324203491,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\太上老君开天经.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "太上老君开天经竟 #1『无褊』，《云笈七签》卷二《老子开天经》作『无偏』。 是。 #2『灵』，按前文，当作『胡灵』。 #3『而九宫』，据《云笈七签》本，应为『而有九宫』。 #4此句之前，《云笈七签》本，尚有『取三刚名也」一句。 #5『晋』，《云笈七签》本作『尝』。 #6『广成子』，《云笈七签》本作『力牧子』。 #7『道经』，《云笈七签》本作《道康经》。 #8『赤精子』，《云笈七签》本作『元阳子弋 #9『真行子』，《云笈七签》本作『直育子』。 #10『燮邑子』，《云笈七签》本作『郭叔子』。 #11『子卯酉』，《云笈七签》本作『子午卯酉』。 #12『高椮』，《云笈七签》本作『高掺』。 #13『自形』，《云岌七签》本作『自刑』。",
      "translated_text": "The *Scripture of the Most High Lord Lao on the Opening of Heaven* concludes here. (Variant: *wu pian* [“without partiality”], recorded as *wu pian* [“without bias”] in *Seven Bamboo Tablets of the Cloudy Satchel*, fascicle 2, *Scripture of Lord Lao on the Opening of Heaven*.) This is correct. (Variant: *ling* [“numinous”]; according to the preceding text, should be *Hu Ling* [“Barbarian Numinous One”].) (Variant: *er jiu gong* [“and the Nine Palaces”]; according to the *Seven Bamboo Tablets* version, should be *er you jiu gong* [“and there are the Nine Palaces”].) (Before this sentence, the *Seven Bamboo Tablets* version includes the phrase “taking the name of the Three Rigids.”) (Variant: *Jin* [“Jin dynasty”]; the *Seven Bamboo Tablets* version reads *chang* [“once”].) (Variant: *Guangchengzi*; the *Seven Bamboo Tablets* version reads *Limuzi*.) (Variant: *Daojing* [“Scripture of the Dao”]; the *Seven Bamboo Tablets* version reads *Daokang Jing* [“Scripture of the Health of the Dao”].) (Variant: *Chijingzi*; the *Seven Bamboo Tablets* version reads *Yuanyangzi Yi*.) (Variant: *Zhenxingzi*; the *Seven Bamboo Tablets* version reads *Zhiyuzi*.) (Variant: *Xieyizi*; the *Seven Bamboo Tablets* version reads *Guoshuzi*.) (Variant: *zi-mao-you* [“zi, mao, and you”]; the *Seven Bamboo Tablets* version reads *zi-wu-mao-you* [“zi, wu, mao, and you”].) (Variant: *Gaoshan*; the *Seven Bamboo Tablets* version reads *Gaocan*.) (Variant: *zixing* [“self-formed”]; the *Seven Bamboo Tablets* version reads *zixing* [“self-punishment”].)",
      "overlap_context": "t, raise Kan [one] to join Kun [two]. In the southwest is the Queen Mother of the West; in the east, the Azure Dragon. Cultivate *qi* to send forth its descendants, inquiring at the Earthly Gate. Xun’s four cycles enter the Central Palace, then emerge from the Central Palace to ascend to Qian. In the west lies the Great Marsh, the peak of Mount Hua. In the northeast, inquire at Yin and Gen. In the south, the fiery blaze of Li and Mount Huo. Suddenly transforming, enter the mystery in the north.\"",
      "start_char": 2580,
      "end_char": 2922,
      "start_sentence": 68,
      "end_sentence": 82,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.370716333389282,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\太上老君开天经.txt",
        "category": "正统道藏续道藏"
      }
    }
  ]
}