{
  "source_id": "太上虚皇天尊四十九章经",
  "source_file": "chunked_daozang\\太上虚皇天尊四十九章经.json",
  "total_chunks": 6,
  "total_original_chars": 4620,
  "total_translated_chars": 25737,
  "total_translation_time": 120.37738800048828,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\本文类\\太上虚皇天尊四十九章经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Forty-Nine Chapters Sutra of the Supreme Void Sovereign Heavenly Worthy**\n\n**Chapter One: Establishing Merit**\nThe Heavenly Worthy said: Those who seek to cultivate the Dao must first establish merit. Thus, all the Celestial Emperors, exalted deities, perfected beings, and divine immortals of the heavens have ascended to the ranks of sagely transcendence through diligent merit. The heavens record their merits and assign them ranks accordingly. When merit accumulates to a thousand, both form and spirit attain immortality. If merit falls short of a thousand, the form perishes while the spirit becomes immortal. When merit extends to the ten thousand people, one becomes a guest of the Jade Clarity. Mortals shed their forms to become immortals; immortals transform to become perfected beings. The perfected move without obstruction, merging with the natural. Dissolving, they become qi; resting, they become human. With spiritual penetrations and self-mastery, they transform without form, soaring through the Three Realms, emerging from darkness into light. When I dwelt in the world, I established merit for the world; when I roamed the heavens, the heavens reported my merit. All sentient beings, desiring deliverance, must not waver in their resolve—they will naturally attain the true Dao.\n\n**Chapter Two: Fasting and Precepts**\nThe Heavenly Worthy said: Fasting and precepts are the root of the Dao and the bridge of the Dharma. If you wish to study the Dao, observe pure fasting and uphold the precepts, maintaining right mindfulness in every thought—then delusion and falsehood will naturally vanish. All sentient beings abandon the realm of purity, indulging in the stench of meat and fish, thereby violating the Dharma. They are like hungry ghosts devouring corpses, their bellies ablaze with hunger, never sated. Or like flies swarming over filth, mistaking foulness for fragrance, thus violating the Dharma. The Three Palaces are defiled, the Six Viscera impure; the corpse-soul thrives, delighting in the realm of death. You must sever the roots of desire, enter the realm of purity, refrain from all suffering, commit no evil, generate no views, and arouse no perversity. Regard the precepts as the laws of the world—if you contemplate transgression, fear the punishments of metal and wood. Hold the precepts with utmost sincerity, standing in awe as if facing something dreadful. Maintain a solemn and upright mind, extinguish all thoughts, listen single-mindedly without duality—only then may you unite with the true and become my disciple.\n\n**Chapter Three: Recognizing the Original Nature**\nThe Heavenly Worthy said: The Void and the Natural are the source of the Dao. The True One is non-dual, its essence serene and luminous, self-sufficient and complete, free from all views. Distant from the dust and defilements, learning is no-learning, cultivation is no-cultivation—within this, all is clearly understood. Neither departing nor abiding, neither grasping nor rejecting, neither joyful nor afflicted, neither dying nor living, neither past nor present—this is true awakening. Observe all forms and appearances as equal to emptiness; extinguish worldly illusions and merge with the natural.\n\n**Chapter Four: Responding with Virtue**\nThe Heavenly Worthy said: If a person has one virtue, a hundred spirits are at peace. If one has ten virtues, the Registrar of Life records their years. If one has a hundred virtues, the Eastern Florescence inscribes their name. If one has a thousand virtues, blessings extend to the seven ancestors, and the deceased souls become immortals. When ten thousand virtues are complete, a jade talisman descends to welcome them, a thousand spirits pay homage, and they ascend to the celestial court in broad daylight.\n\n**Chapter Five: The Dharma’s Power to Protect**\nThe Heavenly Worthy said: You pity others but cannot pity yourself. Earth, water, fire, and wind—these Four Great Elements combine temporarily. Clay is molded into a vessel and fired to become firm. Your body is like the vessel; the Dharma is like the fire. It can protect your body, forming an indestructible essence.\n\n**Chapter Six: Accumulating Virtue as Treasure**\nThe Heavenly Worthy addressed the Wondrous Practice Perfected One: When you ascend a mountain of treasures, walking left and right, myriad treasures lie scattered, all lovely to behold. As you descend the mountain, can you bear to carry none away?\nThe Wondrous Practice Perfected One replied: To return empty-handed is to abandon oneself.\nThe Heavenly Worthy said: Well said! Human life in the world is like dwelling on a mountain of treasures—all manner of good affinities are treasures. If you do not cultivate goodness, when you depart this world, it is like ascending that mountain of treasures and returning empty-handed, carrying nothing. Will you have no regrets later?\n\n**Chapter Seven: Removing Defilements**\nThe Heavenly Worthy said: Your form is impure, subject to all attachments. When defilements accumulate in the body, you must seek gradual purification. If the mind’s defilements are unclean, the six senses become tainted. Failing to cleanse them is delusion. Thus, when the body’s defilements are unclean, they are washed with worldly water; when the mind’s defilements are unclean, they are washed with the Dharma’s words. When the six senses are pure, inside and out become luminously clear, without the slightest contamination—only then may you attain the formless.\n\n**Chapter Eight: Tasting the Dao**\nThe Heavenly Worthy said: When you eat honey, your entire mouth is sweet, and the flavor lingers on your tongue. The taste of my words surpasses this.\n\n**Chapter Nine: Severing Causes and Conditions**\nThe Heavenly Worthy said: All sentient beings arise from causes and give rise to causes, arise from conditions and give rise to conditions. Due to causes and conditions, they bind themselves in afflictions, create immeasurable karma, and fall into birth and death, endlessly revolving. Like bubbles in waves, they form and dissolve repeatedly. You must awaken to the fact that all is originally empty. You yourself generate views, cling to everything, and all manner of attachments become the roots of affliction, equal to a prison. If this mind does not awaken, it is like a great criminal, bound since beginningless time, with no liberation. Now, I extinguish your past and future causes, sever all conditions, recognize causes as non-causes, conditions as non-conditions. Neither caused nor conditioned, serene and eternally still, without going or coming, without separation or attachment—all is liberated, transcending the Three Realms.\n\n**Chapter Ten: Renewing Oneself**\nThe Heavenly Worthy said: All men and women, bowing their heads before the Three Treasures and taking refuge, wash away defilements to purify the mind-ground. Repenting past transgressions and renewing themselves, they vow never to repeat them—such may become my disciples.\n\n**Chapter Eleven: Almsgiving**\nThe Heavenly Worthy said: Those men and women who, since dwelling in the world, inwardly reflect before the Three Treasures and find nothing to repent—these are my true disciples.\n\n**Chapter Eleven: Almsgiving**\nThe Heavenly Worthy said: To give from abundance is not difficult; to give when lacking is difficult. To give what one does not desire is not difficult; to give what one deeply cherishes is difficult. All blessings arise from joy; all almsgiving is born of a joyful heart. All wealth and treasures belong to the lives of beings. Some give material goods, dedicating them to the Three Treasures; some give the Dharma, awakening all beings. The manifold good fruits bring boundless karmic reward.\n\n**Chapter Twelve: Diligence**\nThe Heavenly Worthy said: Those who know my Dao yet fail to practice it; those who practice my Dao yet cannot persist—rare indeed is one who attains the Dao, who knows and yet is diligent, who endures without slackening. Like crossing the vast sea, daily seeking the shore, steadfast from beginning to end, the Dao shall be yours.\n\n**Chapter Thirteen: Refining the Impure into the Real**\nThe Heavenly Worthy addressed the Perfected One of Wondrous Conduct, saying: Before you were born, in undifferentiated chaos, fundamentally nothing existed—sight and hearing were unattainable, yet you merged with the true and constant, without name or form. What then was wondrous conduct? Now I shall expound for you the principle of the unborn. All forms and appearances are but illusory and false; clinging to this illusory body becomes a burden to me.\n\nJust as forging a sword—smelting away dross and impurity—only then does refined steel appear; fierce and unyielding, it becomes a wondrous instrument.\n\n**Chapter Fourteen: Transforming and Evolving**\nThe Heavenly Worthy addressed the Perfected One of Wondrous Conduct, saying: Those who follow my Dao engage in virtuous action; those who depart from my Dao engage in evil action. The Most High establishes virtue, next establishes merit, and next establishes teachings. Though their accomplishments differ in degree, all return to the Dao. All sentient beings, deluded by inverted false thoughts, create karmic deeds leading to hell, unaware of their own plight, eagerly rushing forward to plunge into the river of desire. You, for the sake of sentient beings, expound the teachings, employing skillful means to guide them—thus shall you gain blessed retribution and together realize the unconditioned.\n\n**Chapter Fifteen: Attaining True Perfection**\nThe Perfected One of Wondrous Conduct asked the Heavenly Worthy: What is called a true person? And what Dao must one cultivate to attain this fruition?\nThe Heavenly Worthy replied: With concentrated mind and ascetic practice, renounce worldly desires, cease false thoughts, and remain unstained. Refine form to transform into qi, refine qi to transform into spirit, refine spirit to merge with the Dao, and embody spontaneity. Gather the myriad dharmas into one body, and with that one body transform the myriad realms. Unattached to existence or nonexistence, forever transcending birth and death—this is called a true person.\n\n**Chapter Sixteen: The Three Vehicles and Their Distinctions**\nThe Heavenly Worthy said: Those of lesser learning restrain their eyes from reckless seeing, their ears from reckless hearing, their minds from reckless knowing, and suppress all things to extinguish the myriad states in order to attain the Dao. Those of profound learning see yet perceive nothing, hear yet apprehend nothing, know yet cognize nothing, act without pursuit, thus observing the wondrous. Those of the Great Vehicle, though seeing nothing, miss nothing; though hearing nothing, miss nothing; though knowing nothing, miss nothing. Within and without, all is luminously clear, penetrating the unobstructed—thus they partake of the cosmos and roam the boundless realm.\n\n**Chapter Seventeen: Exhorting Goodness Through Words**\nThe Heavenly Worthy said: To give another wealth is not as good as giving them good words.\n\n**Chapter Seventeen: Exhorting Goodness Through Words (continued)**\nThough gold be precious, its use will exhaust it; good words treasured in the heart remain a lifelong jewel. All divine immortals and perfected beings attained the fruit of the Dao through these supreme and essential words. If you can uphold and widely proclaim this teaching to all beings, enabling them to practice it, their merit will be boundless.\n\n**Chapter Eighteen: Suffering and Joy in Sequence**\nThe Heavenly Worthy said: Those who study the Dao sever all attachments and desires, forsake rich and savory foods, maintain long fasts and pure contemplation, and savor the profound Dao—this is seeking joy within suffering. If one knows its joy, one perceives no suffering. All sentient beings, clinging to glory and splendor, deluded by sounds and sights, indulge their passions and pursue pleasures—yet these are the very causes of suffering. My Dao brings suffering first, then joy; sentient beings know joy first, then suffering. I now tell you this: be clear and cautious.\n\n**Chapter Nineteen: The Non-Dual Gate**\nThe Heavenly Worthy said: My Dao makes no distinction of near or far; my gaze sees no high or low. All sentient beings are viewed with equal regard. Those with a nature for goodness, I aid in perfecting their goodness; those with a nature for the Dao, I aid in realizing their Dao. If there is any partiality, it is a dual gate.\n\n**Chapter Twenty: Non-Killing**\nThe Heavenly Worthy said: If you wish to study my Dao, be ever mindful not to harbor thoughts of killing. All sentient beings cherish life and fear death. My life is their life—do not treat theirs lightly. The mouth delights in rich flavors, yet slaughter fills the feast. If you hold a heart of compassion, imagining their terror, then you will refrain from eating them, thus embodying the practice of mercy and kindness.\n\n**Chapter Twenty-One: Purity**\nThe Heavenly Worthy said: Those who study the Dao take purity as their foundation. They maintain long fasts and subtle contemplation, chanting the Great Void, regarding all deviant paths as enemies; they shun all desires as if avoiding foul stench. By uprooting the sources of suffering and severing the bonds of attachment, they emerge from the murky sea to attain a realm of purity—like the white lotus rising from the mire, unsullied by the water. With the five viscera cleansed and the three fields radiant, the Perfected of the Great Mystery will naturally draw near.\n\n**Chapter Twenty-Two: Non-Deception**\nThe Heavenly Worthy addressed the Perfected of Wondrous Conduct, saying: The Great Vehicle can transcend the Three Realms. If one does not practice my Dao, it is to deem me false. I attained this through non-deception. Thus, faith is the treasure of the heart; all perfected beings realized the fruit of the Dao through the power of faith.\n\n**Chapter Twenty-Three: Compassion**\nThe Heavenly Worthy said: You, all beings, take compassion as your foundation. When seeing any creature, always act with forbearance. The suffering of worldly people is as if it were your own; you should vow to save and protect them, bringing universal peace and happiness. All sentient beings, through ignorance, fall into sin and suffering. If you do not rescue them, you are equally ignorant. By constantly practicing the heart of great compassion, you will perfect the supreme Dao.\n\n**Chapter Twenty-Four: The Myriad Dharmas Return to One**\nThe Heavenly Worthy said: A thousand streams and branches flow into the sea; the myriad dharmas, though diverse, return to the Dao. Sentient beings, through attachment, create distinctions. There should be perfect comprehension without obstruction, a single thread running through all meanings.\n\n**Chapter Twenty-Five: Severing Defilement**\nThe Heavenly Worthy said: All sentient beings arise from defilement and return to defilement. If one can purely believe my precepts, remain unstained, and sever distracting thoughts, one will escape the waves of impurity, enter my Dharma-gate, and transcend the cycle of birth and death, forever beyond the dust of kalpas.\n\n**Chapter Twenty-Six: Washing the Heart**\nThe Heavenly Worthy said: If the six senses are impure, wash the heart. When the heart does not receive filth, all defilements vanish. Thus, the heart is the sovereign, governing all. To subdue the heart is like taming a fierce tiger; if you indulge it, it will turn and harm you.\n\n**Chapter Twenty-Seven: Realizing the Real**\nThe Heavenly Worthy said: Those who study the Dao are serene and receptive. They do not merely rescue the imperiled or aid the distressed but extend kindness to all things, eradicating thoughts of malice. They regard all sentient beings as their kin—those who hunger or freeze, they think to clothe and feed; those who are sick, they think to heal; those entangled in enmity, they think to reconcile. Such a heart of compassion, immeasurable in its manifestations, in this life and the next, will realize the conduct of the perfected.\n\n**Chapter Twenty-Eight: Wealth as the Root of Calamity**\nThe Heavenly Worthy said: Wealth is the root of calamity; to amass wealth is to amass karma. Wealth is the root of desire, giving rise to all sins. Only when one regards wealth as no-wealth can one enter the realm of the Dao.\n\n**Chapter Twenty-Nine: The Universal Moistening of Supreme Words**\nThe Heavenly Worthy said: All sentient beings are bound by love and attachment, as if treading upon raging fire, finding no respite from youth to old age, unaware of their plight. My words are like sweet dew, able to sprinkle all, so that their hearts may naturally attain cool clarity.\n\n**Chapter Thirty: Forbearance**\nThe Heavenly Worthy said: Forbearance is the treasure of the body; be ever mindful not to contend with others. When all demons come, I conquer them through forbearance, not by competing with them. Those who come will turn their weapons back; harming others harms oneself, while I remain at peace. All perfected beings attained their state through forbearance.\n\n**Chapter Thirty-One: Cultivating the Field of Merit**\n\n**Chapter Thirty-One: Cultivating the Field of Merit (continued)**\n\nThe Heavenly Worthy said: A human life in this world is like a flash of lightning—swift and fleeting. From infancy to decrepit old age, it passes in the blink of an eye, as if a spring dream. If one does not boldly advance in goodness, one will later grieve for having fallen short. Those who live without sowing the field of merit—what will they rely upon when their eyes close in death?\n\n**Chapter Thirty-Two: Right Mindfulness**\nThe Heavenly Worthy said: Let your mind be free of perverse thoughts; a single thought pierces the empty sky. Within all the emptiness of space, there are sages and worthies. Always maintain the vision of equality, diligently cultivate the supreme practice, and you will naturally perceive the Eternal Venerable One. With time, you will enter the Great Vehicle.\n\n**Chapter Thirty-Three: Transcending Being and Non-Being**\nThe Heavenly Worthy said: Sentient beings, deluded and confused, falsely perceive existence. The Dao is fundamentally non-being, yet sentient beings, in their inversion, falsely perceive non-existence. The Dao is also beyond this—neither being nor non-being, yet both being and non-being. Those who comprehend this can transcend all.\n\n**Chapter Thirty-Four: Bestowing Words Without Fault**\nThe Perfected One of Wondrous Conduct asked the Heavenly Worthy: What kind of almsgiving yields the greatest merit?\nThe Heavenly Worthy said: To bestow my words upon others yields the greatest merit.\nThe Perfected One of Wondrous Conduct asked: What is the most precious thing in this world?\nThe Heavenly Worthy said: To bear no fault in one’s person—this is the supreme treasure.\n\n**Chapter Thirty-Five: Receiving Karmic Retribution According to Conditions**\nThe Perfected One of Wondrous Conduct asked the Heavenly Worthy: Can past-life causes and conditions be known?\nThe Heavenly Worthy said: If you contemplate the causes and conditions of this present life, you will know those of past lives. If you cultivate the causes and conditions of this present life, you will know those of future lives.\nThe qi is impartial and vast; what you sow, you shall reap.\nIf you plant the roots of thorns, how can you hope for a flourishing grove?\n\n**Chapter Thirty-Six: The Power of Great Strength**\nThe Perfected One of Wondrous Conduct asked the Heavenly Worthy: What power in the world is greatest?\nThe Heavenly Worthy said: The power of compassion is the most vast.\nThe heart of compassion can transform all; the practice of compassion can subdue all.\nDo not contend with the wicked, nor oppose the violent.\nWherever it turns, it is invincible—such is its power, boundless and immeasurable.\n\n**Chapter Thirty-Seven: Accord with the Dao**\nThe Heavenly Worthy said to the Perfected One of Wondrous Conduct: If you wish to learn my Dao, let your mouth be free of words of right and wrong, your mind free of the marks of self and others, and your body free of defilement and attachment. Only then can you accord with the Dao of non-action.\nAll sentient beings are but illusions, fallen into the causes of form.\nThough they know pleasure is suffering, a single thought can realize non-being.\n\n**Chapter Thirty-Eight: The Arising of Sorrow and Joy in the Mind**\nThe Heavenly Worthy said: Do not harbor a mind that brings calamity, harming all beings.\nThough sentient beings may not yet perceive it, the divine spirits already know.\nTo endanger others is to endanger oneself; to wrong others is to wrong oneself.\nHeaven and hell—all are created by the mind.\n\n**Chapter Thirty-Nine: The Dharma of the Dao**\n\nMy Dao is like a torch’s flame—take from it endlessly, and as you share it, it can cook and ripen all things. My Dharma is like a spring’s source—it can irrigate the withered and parched, moistening all things.\n\nYour body’s hindrances and afflictions set you apart from the Dao.\n\n**Chapter Forty: Entering the Wondrous**\nThe Heavenly Worthy said: Those who enter my Dharma-gate study until there is nothing left to study, practice until there is nothing left to practice, and realize until there is nothing left to realize—this is called entering the gate of all wonders, seeing without obstruction.\n\nSentient beings cling and deludedly seek beginnings and ends, claiming to have attained the supreme. This is like falsely perceiving forms.\n\n**Chapter Forty-One: Casting Off Ornament**\nThe Heavenly Worthy said: Purity is the root of the Dao; ornament is the Dao’s calamity. Do not despise plainness, for within it lies the highest flavor. The foolish, infatuated with worldly desires, are like moths drawn to firelight—unaware of the harm until they perish.\n\n**Chapter Forty-Two: Shared Likes and Dislikes**\nThe Heavenly Worthy said: Beware of deceit and delusion, misleading sentient beings. Do not harbor malicious intent or scheme in secret. Compare others to yourself—likes and dislikes are fundamentally no different. Those who can hold this thought may attain the supreme Dao.\n\n**Chapter Forty-Three: Cultivate Substance Before Giving**\nThe Wondrous Practice Perfected One asked the Heavenly Worthy: The sagely kings, by benefiting all beings and rescuing them without weariness, thought after thought in succession, thereby attained perfection. If someone can hold such a thought, should their karmic reward be without distinction?\n\nThe Heavenly Worthy said: Do not take this lightly. Diligently cultivate your practice until you inwardly perceive the source of the Dao, and naturally your giving will flow endlessly.\n\n**Chapter Forty-Four: Transcending Form and Appearance**\nThe Wondrous Practice Perfected One said: The sagely kings possess seventy-two marks of wondrous appearance and bear nine-colored radiance. All heavenly immortals, upon seeing the Heavenly Worthy, praise and revere him, bowing in homage—this is the rarest and most supreme.\n\nThe Heavenly Worthy said: I am without form, yet you falsely ascribe form to me; I am without appearance, yet you falsely ascribe appearance to me. All those on the initial stage, because of their fleshly eyes, cannot see clearly. If you perceive me through nine colors and seventy-two marks, you depart from non-attachment and cling to existence, and thus cannot hear the supreme meaning.\n\n**Chapter Forty-Five: All Rely on the Dao**\nThe Wondrous Practice Perfected One asked: All with eyes can see forms, but the subtlest Dharma cannot be seen.\n\nThe Heavenly Worthy said: My Dao is like the sun—its light shines universally, and through its illumination, all forms become distinguishable. Without the sun’s light, even those with eyes cannot see. Be vigilant in your practice of the Dao, and never abandon it midway.\n\n**Chapter Forty-Six: Resolute Study of the Dao**\nThe Heavenly Worthy said: Those who study the Dao must not waver in their resolve. Sever worldly defilements, cut off attachments of love, make your mind like cold ashes, extinguish the raging flames, endure hardship in your practice, and disregard misfortune and peril. Like an arrow loosed, go forth without turning back—I guarantee you will attain the true Dao.\n\n**Chapter Forty-Seven: Warnings Against Demonic Obstruction**\nThe Heavenly Worthy said: Studying the Dao is exceedingly difficult. Ghosts, spirits, and demon kings seek to thwart your success, desiring only your death and disliking the immortal Dao. As you near completion, heavenly immortals will come to test you. When immortals test you, they may do so with what you desire or what you do not desire, with what is difficult or what you fear—all are trials of what your mind does not comprehend and your intent does not conceive. Those who pass are commended by the heavens and welcomed by demon kings—this is called attaining the Dao.\n\n**Chapter Forty-Eight: Turning the Mind Toward the Dao**\nThe Heavenly Worthy said: The superior person covets goodness; the inferior person covets wealth. All sentient beings cannot rest by day or sleep by night, ever anxious that their possessions and wealth are insufficient. If you turn your mind toward the Dao, how could you not attain it?\n\n**Chapter Forty-Nine: Exhortation to Persevere**\nThe Wondrous Practice Perfected One asked: Studying the Dao is bitter, like bearing a heavy load up a mountain—should one grow weary and stop?\n\nThe Heavenly Worthy said: Press onward, and once you reach the summit, the suffering will cease. Looking down upon all things, they will appear minute and insignificant.\n\n*The Forty-Nine Chapters Sutra of the Most High Lord of the Void and Heavenly Worthy of Primordial Beginning is now complete.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上虚皇天尊四十九章经 经名：太上虚皇天尊四十九章经。 撰人不详，似出於隋唐之际。 假天尊为妙行真人等演说教义。 一卷。 底本出处：《正统道藏》洞真部本文类。 太上虚皇天尊四十九章经 立功章第一 天尊曰：凡欲修道，建功为先。 是以诸天上帝、诸天高尊、诸天真人、诸天神仙，咸以功勤超圣真位，诸天记功而为品格。 积功满千，形神俱仙； 功不及千，形灭神仙； 功及兆民，玉清之宾。 凡蜕为仙，仙化为真，真人无碍，洞合自然。 消则为炁，息则为人，神通自在，变化无形，飞行三界，出幽入明。 吾昔在世，立世之功； 吾游天中，诸天奏功。 一切众生，咸愿济拔，心不退转，自得真道。 斋戒章第二 天尊曰：斋戒者，道之根本，法之津梁。 子欲学道，清斋奉戒，念念正真，邪妄自泯。 一切众生，舍清浄域，耽嗜荤膻而以触法。 譬如饿鬼，啖食死尸，火烧饥肠，无有饱满。 又如蝇虫，争夺臭腐，妄为膻香而以触法。 三宫溷浊，六腑不净，尸魄欣昌，乐於死地。 子当割嗜欲根，入清静境，无作诸苦，无造诸恶，无生诸见，无起诸邪。 子观戒文如世法律，欲有所犯，惧金木刑。 子於戒文，精意奉持，凛然在前，如对所畏。 秉心正严，灭一切想，谛听不二，可会正真，是吾弟子。 识本来章第三 天尊曰：虚无自然，道所从出，真一不二，体性湛然，圆明自足，不堕诸见。 远离尘垢，学无所学，修无所修，於中了然。 不去不住，不取不舍，无乐无恼，无死无生，无古无今，是真解悟。 观诸形相，等皆虚空，灭除世幻，体合自然。 善应章第四 天尊曰：人有一善，百神俱泰。 人有十善，司命储算。 人有百善，东华注名。 人有千善，福及七祖，死魂为仙，万善既备，玉符下迎，千神来朝，白日登宸。 法力能捍章第五 天尊曰：子知悲人，不能悲身。 地水火风，假合四大，埏土为器，托炬火中而得坚固。 子身犹器，法犹炬火，能捍子身，成不坏质。 积善为宝章第六 天尊谓妙行真人曰：子登宝山，周行左右，万宝纵横，无不可爱。 当下山际，能勿持乎？ 妙行真人曰：不持以归，是谓自弃。 天尊曰：善哉。 人生於世，如在宝山，种种善缘，皆为宝也。 子不造善，当来离世，是犹登彼宝山空手而归，不持一物，后无悔乎？ 除垢章第七 天尊曰：子形不净，受诸染着，积垢於身，必思澡渐。 心垢不净，六根所染，弗思其澣，兹为迷惑。 是故身垢不净，以世水洗之； 心垢不净，以法语洗之。 六根清净，表裹洞明，无毫发染，方造无为。 味道章第八 天尊曰：子之食蜜，徧口皆甜，舌有余味。 味吾之言，有甚於是。 断因缘章第九 天尊曰：一切众生，从因生因，从缘生缘。 以因缘故，结诸烦恼，成无量业，堕於生灭，轮转不穷。 如浪中沤，几成几坏。 尔须了悟，本来皆空，自生诸见，自着一切，种种眷属，是烦恼根，与牢狱等。 此心不悟，如大罪人，无始以来，身被挚缚，无有解脱。 吾今为汝灭前后因，断一切缘，识因非因，识缘非缘，不因不缘，湛然常定，无去无来，无离无着，一切解脱，超出三界。 自新章第十 天尊曰：一切男女，於三宝前稽首归命，洗涤垢秽，令心地净，悔过自新，誓勿复造，可以为吾弟子。",
      "translated_text": "**The Forty-Nine Chapters Sutra of the Supreme Void Sovereign Heavenly Worthy**\n\n**Chapter One: Establishing Merit**\nThe Heavenly Worthy said: Those who seek to cultivate the Dao must first establish merit. Thus, all the Celestial Emperors, exalted deities, perfected beings, and divine immortals of the heavens have ascended to the ranks of sagely transcendence through diligent merit. The heavens record their merits and assign them ranks accordingly. When merit accumulates to a thousand, both form and spirit attain immortality. If merit falls short of a thousand, the form perishes while the spirit becomes immortal. When merit extends to the ten thousand people, one becomes a guest of the Jade Clarity. Mortals shed their forms to become immortals; immortals transform to become perfected beings. The perfected move without obstruction, merging with the natural. Dissolving, they become qi; resting, they become human. With spiritual penetrations and self-mastery, they transform without form, soaring through the Three Realms, emerging from darkness into light. When I dwelt in the world, I established merit for the world; when I roamed the heavens, the heavens reported my merit. All sentient beings, desiring deliverance, must not waver in their resolve—they will naturally attain the true Dao.\n\n**Chapter Two: Fasting and Precepts**\nThe Heavenly Worthy said: Fasting and precepts are the root of the Dao and the bridge of the Dharma. If you wish to study the Dao, observe pure fasting and uphold the precepts, maintaining right mindfulness in every thought—then delusion and falsehood will naturally vanish. All sentient beings abandon the realm of purity, indulging in the stench of meat and fish, thereby violating the Dharma. They are like hungry ghosts devouring corpses, their bellies ablaze with hunger, never sated. Or like flies swarming over filth, mistaking foulness for fragrance, thus violating the Dharma. The Three Palaces are defiled, the Six Viscera impure; the corpse-soul thrives, delighting in the realm of death. You must sever the roots of desire, enter the realm of purity, refrain from all suffering, commit no evil, generate no views, and arouse no perversity. Regard the precepts as the laws of the world—if you contemplate transgression, fear the punishments of metal and wood. Hold the precepts with utmost sincerity, standing in awe as if facing something dreadful. Maintain a solemn and upright mind, extinguish all thoughts, listen single-mindedly without duality—only then may you unite with the true and become my disciple.\n\n**Chapter Three: Recognizing the Original Nature**\nThe Heavenly Worthy said: The Void and the Natural are the source of the Dao. The True One is non-dual, its essence serene and luminous, self-sufficient and complete, free from all views. Distant from the dust and defilements, learning is no-learning, cultivation is no-cultivation—within this, all is clearly understood. Neither departing nor abiding, neither grasping nor rejecting, neither joyful nor afflicted, neither dying nor living, neither past nor present—this is true awakening. Observe all forms and appearances as equal to emptiness; extinguish worldly illusions and merge with the natural.\n\n**Chapter Four: Responding with Virtue**\nThe Heavenly Worthy said: If a person has one virtue, a hundred spirits are at peace. If one has ten virtues, the Registrar of Life records their years. If one has a hundred virtues, the Eastern Florescence inscribes their name. If one has a thousand virtues, blessings extend to the seven ancestors, and the deceased souls become immortals. When ten thousand virtues are complete, a jade talisman descends to welcome them, a thousand spirits pay homage, and they ascend to the celestial court in broad daylight.\n\n**Chapter Five: The Dharma’s Power to Protect**\nThe Heavenly Worthy said: You pity others but cannot pity yourself. Earth, water, fire, and wind—these Four Great Elements combine temporarily. Clay is molded into a vessel and fired to become firm. Your body is like the vessel; the Dharma is like the fire. It can protect your body, forming an indestructible essence.\n\n**Chapter Six: Accumulating Virtue as Treasure**\nThe Heavenly Worthy addressed the Wondrous Practice Perfected One: When you ascend a mountain of treasures, walking left and right, myriad treasures lie scattered, all lovely to behold. As you descend the mountain, can you bear to carry none away?\nThe Wondrous Practice Perfected One replied: To return empty-handed is to abandon oneself.\nThe Heavenly Worthy said: Well said! Human life in the world is like dwelling on a mountain of treasures—all manner of good affinities are treasures. If you do not cultivate goodness, when you depart this world, it is like ascending that mountain of treasures and returning empty-handed, carrying nothing. Will you have no regrets later?\n\n**Chapter Seven: Removing Defilements**\nThe Heavenly Worthy said: Your form is impure, subject to all attachments. When defilements accumulate in the body, you must seek gradual purification. If the mind’s defilements are unclean, the six senses become tainted. Failing to cleanse them is delusion. Thus, when the body’s defilements are unclean, they are washed with worldly water; when the mind’s defilements are unclean, they are washed with the Dharma’s words. When the six senses are pure, inside and out become luminously clear, without the slightest contamination—only then may you attain the formless.\n\n**Chapter Eight: Tasting the Dao**\nThe Heavenly Worthy said: When you eat honey, your entire mouth is sweet, and the flavor lingers on your tongue. The taste of my words surpasses this.\n\n**Chapter Nine: Severing Causes and Conditions**\nThe Heavenly Worthy said: All sentient beings arise from causes and give rise to causes, arise from conditions and give rise to conditions. Due to causes and conditions, they bind themselves in afflictions, create immeasurable karma, and fall into birth and death, endlessly revolving. Like bubbles in waves, they form and dissolve repeatedly. You must awaken to the fact that all is originally empty. You yourself generate views, cling to everything, and all manner of attachments become the roots of affliction, equal to a prison. If this mind does not awaken, it is like a great criminal, bound since beginningless time, with no liberation. Now, I extinguish your past and future causes, sever all conditions, recognize causes as non-causes, conditions as non-conditions. Neither caused nor conditioned, serene and eternally still, without going or coming, without separation or attachment—all is liberated, transcending the Three Realms.\n\n**Chapter Ten: Renewing Oneself**\nThe Heavenly Worthy said: All men and women, bowing their heads before the Three Treasures and taking refuge, wash away defilements to purify the mind-ground. Repenting past transgressions and renewing themselves, they vow never to repeat them—such may become my disciples.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1267,
      "start_sentence": 0,
      "end_sentence": 67,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.87127447128296,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上虚皇天尊四十九章经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "其有男女，处世以来，於三宝前内省於中，无可忏悔，是吾真弟子。 布施章第十一 天尊曰：有余而施，非难不足，施之为难； 施所不欲，非难施所，甚爱为难。 一切诸福，皆自欢喜中来； 一切布施，生欢喜心； 一切财宝，众生性命。 或施以物，归献三宝； 或施以法，觉悟一切。 种种善果，福报无边。 勤行章第十二 天尊曰：知吾道者，复不能行； 行吾道者，复不能久。 难至於道，知而能勤，久而不怠。 如渡沧海，日求着岸； 终始若一，道为子得。 炼秽成真章第十三 天尊语妙行真人曰：子未生时，混混沌沌，本无一物，视听不得，与真常会，无有名相，孰为妙行？ 吾今为汝，究未生理。 种种形相，俱为幻假，眷此幻身，与我为累。",
      "translated_text": "**Chapter Eleven: Almsgiving**\nThe Heavenly Worthy said: Those men and women who, since dwelling in the world, inwardly reflect before the Three Treasures and find nothing to repent—these are my true disciples.\n\n**Chapter Eleven: Almsgiving**\nThe Heavenly Worthy said: To give from abundance is not difficult; to give when lacking is difficult. To give what one does not desire is not difficult; to give what one deeply cherishes is difficult. All blessings arise from joy; all almsgiving is born of a joyful heart. All wealth and treasures belong to the lives of beings. Some give material goods, dedicating them to the Three Treasures; some give the Dharma, awakening all beings. The manifold good fruits bring boundless karmic reward.\n\n**Chapter Twelve: Diligence**\nThe Heavenly Worthy said: Those who know my Dao yet fail to practice it; those who practice my Dao yet cannot persist—rare indeed is one who attains the Dao, who knows and yet is diligent, who endures without slackening. Like crossing the vast sea, daily seeking the shore, steadfast from beginning to end, the Dao shall be yours.\n\n**Chapter Thirteen: Refining the Impure into the Real**\nThe Heavenly Worthy addressed the Perfected One of Wondrous Conduct, saying: Before you were born, in undifferentiated chaos, fundamentally nothing existed—sight and hearing were unattainable, yet you merged with the true and constant, without name or form. What then was wondrous conduct? Now I shall expound for you the principle of the unborn. All forms and appearances are but illusory and false; clinging to this illusory body becomes a burden to me.",
      "overlap_context": "tions as non-conditions. Neither caused nor conditioned, serene and eternally still, without going or coming, without separation or attachment—all is liberated, transcending the Three Realms.\n\n**Chapter Ten: Renewing Oneself**\nThe Heavenly Worthy said: All men and women, bowing their heads before the Three Treasures and taking refuge, wash away defilements to purify the mind-ground. Repenting past transgressions and renewing themselves, they vow never to repeat them—such may become my disciples.",
      "start_char": 1267,
      "end_char": 1564,
      "start_sentence": 68,
      "end_sentence": 87,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.486098051071167,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上虚皇天尊四十九章经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "譬如铸剑，煅炼滓秽，始见精钢； 勇烈无滞，当成妙器。 演化章第十四 天尊谓妙行真人曰：从吾道者，是名善业； 离吾道者，是名恶业。 太上立德，其次立功，其次立言。 成有等差，同归于道。 一切众生，颠倒妄想，造地狱行，不自觉知，踊跃相进，投於爱河。 汝为众生敷演教法，启方便说而为接引，当得福报，同证无为。 真成章第十五 妙行真人问天尊曰：何者名为真人？ 复修何道，获证此果？ 天尊曰：精心苦行，绝世所欲，不兴妄想，无有染着，炼形化炁，炼炁化神，炼神合道，体入自然。 敛万法归於一身，以一身而化万境。 不滞有无，永绝生灭，是名真人。 三乘等差章第十六 天尊曰：末学之士，目不妄视，耳不妄听，心不妄知，禁约一切，泯绝万态以致於道。 至学之士，视无所见，听无所闻，心无所知，动无所逐，以观众妙。 大乘之士，无见而无不见，无闻而无不闻，无知而无不知，内外洞然，达彼无间，故能参宇宙而游无尽之域。 以言劝善章第十七 天尊曰：赠人以财，不若赠人善言。",
      "translated_text": "Just as forging a sword—smelting away dross and impurity—only then does refined steel appear; fierce and unyielding, it becomes a wondrous instrument.\n\n**Chapter Fourteen: Transforming and Evolving**\nThe Heavenly Worthy addressed the Perfected One of Wondrous Conduct, saying: Those who follow my Dao engage in virtuous action; those who depart from my Dao engage in evil action. The Most High establishes virtue, next establishes merit, and next establishes teachings. Though their accomplishments differ in degree, all return to the Dao. All sentient beings, deluded by inverted false thoughts, create karmic deeds leading to hell, unaware of their own plight, eagerly rushing forward to plunge into the river of desire. You, for the sake of sentient beings, expound the teachings, employing skillful means to guide them—thus shall you gain blessed retribution and together realize the unconditioned.\n\n**Chapter Fifteen: Attaining True Perfection**\nThe Perfected One of Wondrous Conduct asked the Heavenly Worthy: What is called a true person? And what Dao must one cultivate to attain this fruition?\nThe Heavenly Worthy replied: With concentrated mind and ascetic practice, renounce worldly desires, cease false thoughts, and remain unstained. Refine form to transform into qi, refine qi to transform into spirit, refine spirit to merge with the Dao, and embody spontaneity. Gather the myriad dharmas into one body, and with that one body transform the myriad realms. Unattached to existence or nonexistence, forever transcending birth and death—this is called a true person.\n\n**Chapter Sixteen: The Three Vehicles and Their Distinctions**\nThe Heavenly Worthy said: Those of lesser learning restrain their eyes from reckless seeing, their ears from reckless hearing, their minds from reckless knowing, and suppress all things to extinguish the myriad states in order to attain the Dao. Those of profound learning see yet perceive nothing, hear yet apprehend nothing, know yet cognize nothing, act without pursuit, thus observing the wondrous. Those of the Great Vehicle, though seeing nothing, miss nothing; though hearing nothing, miss nothing; though knowing nothing, miss nothing. Within and without, all is luminously clear, penetrating the unobstructed—thus they partake of the cosmos and roam the boundless realm.\n\n**Chapter Seventeen: Exhorting Goodness Through Words**\nThe Heavenly Worthy said: To give another wealth is not as good as giving them good words.",
      "overlap_context": "hirteen: Refining the Impure into the Real**\nThe Heavenly Worthy addressed the Perfected One of Wondrous Conduct, saying: Before you were born, in undifferentiated chaos, fundamentally nothing existed—sight and hearing were unattainable, yet you merged with the true and constant, without name or form. What then was wondrous conduct? Now I shall expound for you the principle of the unborn. All forms and appearances are but illusory and false; clinging to this illusory body becomes a burden to me.",
      "start_char": 1564,
      "end_char": 1986,
      "start_sentence": 88,
      "end_sentence": 108,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.147855997085571,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上虚皇天尊四十九章经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "黄金虽贵，用之则穷； 善言於心，终身为宝。 一切神仙真人，皆以无上要言得成道果。 子能持是说，普告众生，令得奉行，获福无量。 苦乐先后章第十八 天尊曰：学道之士，断诸爱欲，却绝肥鲜，长斋清思，研味至道，是为苦中求乐，能知其乐，不见其苦。 一切众生，贪恋荣华，迷惑声色，肆情纵欲，造诸快乐者，是造诸苦。 吾道苦而后乐，众生乐而后苦。 吾今告子，当明慎之。 不二门章第十九 天尊曰：吾道无亲疏，吾眼无贵贱，一切众生，皆以等观。 有善性者，与成其善； 有道性者，与证其道。 若有所择，是有二门。 不杀章第二十 天尊曰：子欲学吾道，慎勿怀杀想。 一切诸众生，贪生悉惧死。 我命即他命，慎勿轻於彼，口腹乐甘肥，杀戮充啖食。 能怀侧隐心，想念彼惊怖，故当不忍啖，以证慈悲行。 清净章第二十一 天尊曰：学道之士，以清净为本，长斋眇思，啸咏太无，观诸邪道，如睹仇雠； 远诸爱欲，如避臭秽。 除苦恼根，断亲爱缘，冥冥浊海，自得净界。 如白莲花，生淤泥中，亭亭出水，不受污染。 五脏清夷，三田华素，太玄真人，自与子邻。 不妄章第二十二 天尊告妙行真人曰：大乘法可出三界。 如不行吾道，即是以我为妄。 吾以不妄，故得证此。 故信者心之宝，一切真人，皆以信心得成道果。 慈悲章第二十三 天尊曰：汝等众生，以慈悲为本，睹一切物，常行不忍。 世人痛苦，如在我身，当愿救护，普令安乐。 一切众生，以愚痴故，陷诸罪苦。 尔不救拔，等是愚痴。 常行大悲心，自成无上道。 万法归一章第二十四 天尊曰：万派枝流，同归于海； 万法纷纭，同归于道。 众生执着，自生分别。 当有圆通无阂，一贯诸义。 断秽浊章第二十五 天尊曰：一切众生，皆自秽浊中来，复以秽浊而往。 有能清净信吾戒言，不受染着，断除杂想，即得出离浊浪，入我法门，无去无来，永超尘劫。 洗心章第二十六 天尊曰：六根不净，当洗其心，心不受垢，自无诸秽。 故心为宰官，统御一切，降伏其心，犹驭猛虎，如有纵怠，反伤汝身。 证真章第二十七 天尊曰：学道之士，清虚而容，非拯危而济难，慈向万物，灭毒恶想。 观一切众生，如我眷属，有饥寒者，念与衣食； 有疾病者，念与医药； 有冤雠者，念与解释。 如是慈悲心，种种不可量，当来及后世，证彼真人行。 财为患本章第二十八 天尊曰：财为患之本，聚财为聚业； 财为爱欲根，能起一切罪。 若以财非财，始可入道境。 至言普润章第二十九 天尊曰：一切众生，牵於情爱，如蹈猛火，靡得休息，从少至老，不自知觉。 吾言如甘露，能洒一切，使其心地，自得清凉。 忍辱章第三十 天尊曰：忍者身之宝，慎勿与人争。 一切诸魔来，吾以忍坐胜，不与群魔竞； 来者自反戈，损人还自损，我实得安靖。 一切诸真人，皆以忍辱故。 造福田章第三十一",
      "translated_text": "**Chapter Seventeen: Exhorting Goodness Through Words (continued)**\nThough gold be precious, its use will exhaust it; good words treasured in the heart remain a lifelong jewel. All divine immortals and perfected beings attained the fruit of the Dao through these supreme and essential words. If you can uphold and widely proclaim this teaching to all beings, enabling them to practice it, their merit will be boundless.\n\n**Chapter Eighteen: Suffering and Joy in Sequence**\nThe Heavenly Worthy said: Those who study the Dao sever all attachments and desires, forsake rich and savory foods, maintain long fasts and pure contemplation, and savor the profound Dao—this is seeking joy within suffering. If one knows its joy, one perceives no suffering. All sentient beings, clinging to glory and splendor, deluded by sounds and sights, indulge their passions and pursue pleasures—yet these are the very causes of suffering. My Dao brings suffering first, then joy; sentient beings know joy first, then suffering. I now tell you this: be clear and cautious.\n\n**Chapter Nineteen: The Non-Dual Gate**\nThe Heavenly Worthy said: My Dao makes no distinction of near or far; my gaze sees no high or low. All sentient beings are viewed with equal regard. Those with a nature for goodness, I aid in perfecting their goodness; those with a nature for the Dao, I aid in realizing their Dao. If there is any partiality, it is a dual gate.\n\n**Chapter Twenty: Non-Killing**\nThe Heavenly Worthy said: If you wish to study my Dao, be ever mindful not to harbor thoughts of killing. All sentient beings cherish life and fear death. My life is their life—do not treat theirs lightly. The mouth delights in rich flavors, yet slaughter fills the feast. If you hold a heart of compassion, imagining their terror, then you will refrain from eating them, thus embodying the practice of mercy and kindness.\n\n**Chapter Twenty-One: Purity**\nThe Heavenly Worthy said: Those who study the Dao take purity as their foundation. They maintain long fasts and subtle contemplation, chanting the Great Void, regarding all deviant paths as enemies; they shun all desires as if avoiding foul stench. By uprooting the sources of suffering and severing the bonds of attachment, they emerge from the murky sea to attain a realm of purity—like the white lotus rising from the mire, unsullied by the water. With the five viscera cleansed and the three fields radiant, the Perfected of the Great Mystery will naturally draw near.\n\n**Chapter Twenty-Two: Non-Deception**\nThe Heavenly Worthy addressed the Perfected of Wondrous Conduct, saying: The Great Vehicle can transcend the Three Realms. If one does not practice my Dao, it is to deem me false. I attained this through non-deception. Thus, faith is the treasure of the heart; all perfected beings realized the fruit of the Dao through the power of faith.\n\n**Chapter Twenty-Three: Compassion**\nThe Heavenly Worthy said: You, all beings, take compassion as your foundation. When seeing any creature, always act with forbearance. The suffering of worldly people is as if it were your own; you should vow to save and protect them, bringing universal peace and happiness. All sentient beings, through ignorance, fall into sin and suffering. If you do not rescue them, you are equally ignorant. By constantly practicing the heart of great compassion, you will perfect the supreme Dao.\n\n**Chapter Twenty-Four: The Myriad Dharmas Return to One**\nThe Heavenly Worthy said: A thousand streams and branches flow into the sea; the myriad dharmas, though diverse, return to the Dao. Sentient beings, through attachment, create distinctions. There should be perfect comprehension without obstruction, a single thread running through all meanings.\n\n**Chapter Twenty-Five: Severing Defilement**\nThe Heavenly Worthy said: All sentient beings arise from defilement and return to defilement. If one can purely believe my precepts, remain unstained, and sever distracting thoughts, one will escape the waves of impurity, enter my Dharma-gate, and transcend the cycle of birth and death, forever beyond the dust of kalpas.\n\n**Chapter Twenty-Six: Washing the Heart**\nThe Heavenly Worthy said: If the six senses are impure, wash the heart. When the heart does not receive filth, all defilements vanish. Thus, the heart is the sovereign, governing all. To subdue the heart is like taming a fierce tiger; if you indulge it, it will turn and harm you.\n\n**Chapter Twenty-Seven: Realizing the Real**\nThe Heavenly Worthy said: Those who study the Dao are serene and receptive. They do not merely rescue the imperiled or aid the distressed but extend kindness to all things, eradicating thoughts of malice. They regard all sentient beings as their kin—those who hunger or freeze, they think to clothe and feed; those who are sick, they think to heal; those entangled in enmity, they think to reconcile. Such a heart of compassion, immeasurable in its manifestations, in this life and the next, will realize the conduct of the perfected.\n\n**Chapter Twenty-Eight: Wealth as the Root of Calamity**\nThe Heavenly Worthy said: Wealth is the root of calamity; to amass wealth is to amass karma. Wealth is the root of desire, giving rise to all sins. Only when one regards wealth as no-wealth can one enter the realm of the Dao.\n\n**Chapter Twenty-Nine: The Universal Moistening of Supreme Words**\nThe Heavenly Worthy said: All sentient beings are bound by love and attachment, as if treading upon raging fire, finding no respite from youth to old age, unaware of their plight. My words are like sweet dew, able to sprinkle all, so that their hearts may naturally attain cool clarity.\n\n**Chapter Thirty: Forbearance**\nThe Heavenly Worthy said: Forbearance is the treasure of the body; be ever mindful not to contend with others. When all demons come, I conquer them through forbearance, not by competing with them. Those who come will turn their weapons back; harming others harms oneself, while I remain at peace. All perfected beings attained their state through forbearance.\n\n**Chapter Thirty-One: Cultivating the Field of Merit**",
      "overlap_context": "know yet cognize nothing, act without pursuit, thus observing the wondrous. Those of the Great Vehicle, though seeing nothing, miss nothing; though hearing nothing, miss nothing; though knowing nothing, miss nothing. Within and without, all is luminously clear, penetrating the unobstructed—thus they partake of the cosmos and roam the boundless realm.\n\n**Chapter Seventeen: Exhorting Goodness Through Words**\nThe Heavenly Worthy said: To give another wealth is not as good as giving them good words.",
      "start_char": 1986,
      "end_char": 3133,
      "start_sentence": 109,
      "end_sentence": 174,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.90671181678772,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上虚皇天尊四十九章经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "天尊曰：人生一世间，譬如电光速，婴儿化老耄，倏忽春梦中。 勇猛进於善，自己悲不及，处世无福田，瞑目何所恃。 正念章第三十二 天尊曰：子心无邪念，一念彻虚空，一切虚空中，皆有圣与贤。 常作平等观，勤修无上行，自见虚无老，久久入大乘。 出有无章第三十三 天尊曰：众生迷惑，妄见诸有。 吾道本无，有诸众生颠倒，妄见诸无。 吾道亦无，非有非无，即有即无。 作是解者，能超一切。 施言无罪章第三十四 妙行真人问天尊曰：何者布施功德最重？ 天尊曰：以吾言施人，功德最重。 妙行真人曰．； 处世何物为宝？ 天尊曰：无罪於身，是为至宝。 随缘受报章第三十五 妙行真人问天尊曰：宿命因缘，可以知否？ 天尊曰：汝思见世因缘，则知宿命因缘。 汝修见世因缘，则知来世因缘。 一炁无偏阿，所种还自生； 植此荆棘根，何由望骞林？ 大力章第三十六 妙行真人问天尊曰：世间何力为大？ 天尊曰：慈悲之力，最为广大。 慈悲之心，能化一切； 慈悲之行，能伏一切。 恶者无与争，暴者无与抗，所向无敌，是为其力广大无边。 契道章第三十七 天尊谓妙行真人曰：子欲学吾道，口无是非言，心无人我相，身不受染着，方契无为道。 众生俱幻化，堕彼色相因，虽知乐是苦，一念了无为。 心起忧乐章第三十八 天尊曰：子勿包祸心，损害於一切。 众生初未觉，神明悉已知。 危人还自危，枉彼还自枉。 天堂及地狱，一切由心造。 道法章第三十九 天尊曰；",
      "translated_text": "**Chapter Thirty-One: Cultivating the Field of Merit (continued)**\n\nThe Heavenly Worthy said: A human life in this world is like a flash of lightning—swift and fleeting. From infancy to decrepit old age, it passes in the blink of an eye, as if a spring dream. If one does not boldly advance in goodness, one will later grieve for having fallen short. Those who live without sowing the field of merit—what will they rely upon when their eyes close in death?\n\n**Chapter Thirty-Two: Right Mindfulness**\nThe Heavenly Worthy said: Let your mind be free of perverse thoughts; a single thought pierces the empty sky. Within all the emptiness of space, there are sages and worthies. Always maintain the vision of equality, diligently cultivate the supreme practice, and you will naturally perceive the Eternal Venerable One. With time, you will enter the Great Vehicle.\n\n**Chapter Thirty-Three: Transcending Being and Non-Being**\nThe Heavenly Worthy said: Sentient beings, deluded and confused, falsely perceive existence. The Dao is fundamentally non-being, yet sentient beings, in their inversion, falsely perceive non-existence. The Dao is also beyond this—neither being nor non-being, yet both being and non-being. Those who comprehend this can transcend all.\n\n**Chapter Thirty-Four: Bestowing Words Without Fault**\nThe Perfected One of Wondrous Conduct asked the Heavenly Worthy: What kind of almsgiving yields the greatest merit?\nThe Heavenly Worthy said: To bestow my words upon others yields the greatest merit.\nThe Perfected One of Wondrous Conduct asked: What is the most precious thing in this world?\nThe Heavenly Worthy said: To bear no fault in one’s person—this is the supreme treasure.\n\n**Chapter Thirty-Five: Receiving Karmic Retribution According to Conditions**\nThe Perfected One of Wondrous Conduct asked the Heavenly Worthy: Can past-life causes and conditions be known?\nThe Heavenly Worthy said: If you contemplate the causes and conditions of this present life, you will know those of past lives. If you cultivate the causes and conditions of this present life, you will know those of future lives.\nThe qi is impartial and vast; what you sow, you shall reap.\nIf you plant the roots of thorns, how can you hope for a flourishing grove?\n\n**Chapter Thirty-Six: The Power of Great Strength**\nThe Perfected One of Wondrous Conduct asked the Heavenly Worthy: What power in the world is greatest?\nThe Heavenly Worthy said: The power of compassion is the most vast.\nThe heart of compassion can transform all; the practice of compassion can subdue all.\nDo not contend with the wicked, nor oppose the violent.\nWherever it turns, it is invincible—such is its power, boundless and immeasurable.\n\n**Chapter Thirty-Seven: Accord with the Dao**\nThe Heavenly Worthy said to the Perfected One of Wondrous Conduct: If you wish to learn my Dao, let your mouth be free of words of right and wrong, your mind free of the marks of self and others, and your body free of defilement and attachment. Only then can you accord with the Dao of non-action.\nAll sentient beings are but illusions, fallen into the causes of form.\nThough they know pleasure is suffering, a single thought can realize non-being.\n\n**Chapter Thirty-Eight: The Arising of Sorrow and Joy in the Mind**\nThe Heavenly Worthy said: Do not harbor a mind that brings calamity, harming all beings.\nThough sentient beings may not yet perceive it, the divine spirits already know.\nTo endanger others is to endanger oneself; to wrong others is to wrong oneself.\nHeaven and hell—all are created by the mind.\n\n**Chapter Thirty-Nine: The Dharma of the Dao**",
      "overlap_context": "hat their hearts may naturally attain cool clarity.\n\n**Chapter Thirty: Forbearance**\nThe Heavenly Worthy said: Forbearance is the treasure of the body; be ever mindful not to contend with others. When all demons come, I conquer them through forbearance, not by competing with them. Those who come will turn their weapons back; harming others harms oneself, while I remain at peace. All perfected beings attained their state through forbearance.\n\n**Chapter Thirty-One: Cultivating the Field of Merit**",
      "start_char": 3133,
      "end_char": 3737,
      "start_sentence": 175,
      "end_sentence": 212,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.252543687820435,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上虚皇天尊四十九章经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "吾道犹炬火，取之无穷，随其所与，能饪熟一切。 吾法等泉源，能灌溉枯槁，润泽一切。 子身障恼，自与道违。 入妙章第四十 天尊曰：入我法门者，学至於无所学，行至於无所行，了至於无所了，是谓入众妙门，洞观无碍。 众生执着，妄究终始，自谓造於最胜，是犹妄见诸色。 去华章第四十一 天尊曰：清净者，道之本； 荣华者，道之殃。 子勿憎淡泊，是中有至味。 愚痴恋世欲，类蛾投火光，不知其为害，以至於灭亡。 同好恶章第四十二 天尊曰：子慎无锜妄，诳惑诸众生，勿怀毒恶心，阴谋诸一切。 以身譬他人，好恶元无异，能作是念者，可证无上道。 先实后施章第四十三 妙行真人问天尊曰：颇谓圣王，以能利益一切，救拔众生，无有厌倦，念念相因，故能成真。 若复有人，能作是念，当知果报无差？ 天尊曰：汝勿轻用，勤修其行，使中实有见道之源，自然流施无尽。 超色相章第四十四 妙行真人曰：圣王妙相七十二项，负九色光。 诸天仙人以是睹天尊也，靡不赞善，恭敬礼拜，无上希有。 天尊曰：我以非色，汝妄为色； 我以非相，汝妄为相。 一切初地，以肉眼故，不能洞观。 若以九色七十二相观我，即是离无着有，不可与闻无上之义。 一切恃道章第四十五 妙行真人问曰：一切有目，可见诸色； 至於微妙之法，不可得见。 天尊曰：吾道犹日，光明普照，种种色相，人始能别。 废日之光，有目绝视。 子慎为道，无复中辍。 勇决学道章第四十六 天尊曰：学道之士，慎无二心，断绝尘染，割弃爱缘，心如寒灰，灭除猛焰，苦身励行，祸难不顾。 如矢一发，往而不回，吾保子身，必得道真。 魔诫章第四十七 天尊曰：学道甚难。 鬼神魔王，败人成功，但欲其死，不喜仙道。 子将道成，复有诸天仙人来试尔身。 仙人之来试也，或试以所欲，或试以所不欲； 或试以所难，或试以所畏，皆於心之所不悟、意之所不造也试之。 过者诸天保举，魔王奉迎，是谓得道。 易心向道章第四十八 天尊曰：上士贪善，下士贪财； 一切众生，昼不能息，夜不能寐，唯虑货财不足於身。 子易其心而学道，安有不得矣。 勉行章第四十九 妙行真人问曰：学道甚苦，如负重登山，可厌而止？ 天尊曰：子勉於前，既登绝顶，其苦亦息，俯视一切，皆微眇也。 太上虚皇天尊四十九章经竟",
      "translated_text": "My Dao is like a torch’s flame—take from it endlessly, and as you share it, it can cook and ripen all things. My Dharma is like a spring’s source—it can irrigate the withered and parched, moistening all things.\n\nYour body’s hindrances and afflictions set you apart from the Dao.\n\n**Chapter Forty: Entering the Wondrous**\nThe Heavenly Worthy said: Those who enter my Dharma-gate study until there is nothing left to study, practice until there is nothing left to practice, and realize until there is nothing left to realize—this is called entering the gate of all wonders, seeing without obstruction.\n\nSentient beings cling and deludedly seek beginnings and ends, claiming to have attained the supreme. This is like falsely perceiving forms.\n\n**Chapter Forty-One: Casting Off Ornament**\nThe Heavenly Worthy said: Purity is the root of the Dao; ornament is the Dao’s calamity. Do not despise plainness, for within it lies the highest flavor. The foolish, infatuated with worldly desires, are like moths drawn to firelight—unaware of the harm until they perish.\n\n**Chapter Forty-Two: Shared Likes and Dislikes**\nThe Heavenly Worthy said: Beware of deceit and delusion, misleading sentient beings. Do not harbor malicious intent or scheme in secret. Compare others to yourself—likes and dislikes are fundamentally no different. Those who can hold this thought may attain the supreme Dao.\n\n**Chapter Forty-Three: Cultivate Substance Before Giving**\nThe Wondrous Practice Perfected One asked the Heavenly Worthy: The sagely kings, by benefiting all beings and rescuing them without weariness, thought after thought in succession, thereby attained perfection. If someone can hold such a thought, should their karmic reward be without distinction?\n\nThe Heavenly Worthy said: Do not take this lightly. Diligently cultivate your practice until you inwardly perceive the source of the Dao, and naturally your giving will flow endlessly.\n\n**Chapter Forty-Four: Transcending Form and Appearance**\nThe Wondrous Practice Perfected One said: The sagely kings possess seventy-two marks of wondrous appearance and bear nine-colored radiance. All heavenly immortals, upon seeing the Heavenly Worthy, praise and revere him, bowing in homage—this is the rarest and most supreme.\n\nThe Heavenly Worthy said: I am without form, yet you falsely ascribe form to me; I am without appearance, yet you falsely ascribe appearance to me. All those on the initial stage, because of their fleshly eyes, cannot see clearly. If you perceive me through nine colors and seventy-two marks, you depart from non-attachment and cling to existence, and thus cannot hear the supreme meaning.\n\n**Chapter Forty-Five: All Rely on the Dao**\nThe Wondrous Practice Perfected One asked: All with eyes can see forms, but the subtlest Dharma cannot be seen.\n\nThe Heavenly Worthy said: My Dao is like the sun—its light shines universally, and through its illumination, all forms become distinguishable. Without the sun’s light, even those with eyes cannot see. Be vigilant in your practice of the Dao, and never abandon it midway.\n\n**Chapter Forty-Six: Resolute Study of the Dao**\nThe Heavenly Worthy said: Those who study the Dao must not waver in their resolve. Sever worldly defilements, cut off attachments of love, make your mind like cold ashes, extinguish the raging flames, endure hardship in your practice, and disregard misfortune and peril. Like an arrow loosed, go forth without turning back—I guarantee you will attain the true Dao.\n\n**Chapter Forty-Seven: Warnings Against Demonic Obstruction**\nThe Heavenly Worthy said: Studying the Dao is exceedingly difficult. Ghosts, spirits, and demon kings seek to thwart your success, desiring only your death and disliking the immortal Dao. As you near completion, heavenly immortals will come to test you. When immortals test you, they may do so with what you desire or what you do not desire, with what is difficult or what you fear—all are trials of what your mind does not comprehend and your intent does not conceive. Those who pass are commended by the heavens and welcomed by demon kings—this is called attaining the Dao.\n\n**Chapter Forty-Eight: Turning the Mind Toward the Dao**\nThe Heavenly Worthy said: The superior person covets goodness; the inferior person covets wealth. All sentient beings cannot rest by day or sleep by night, ever anxious that their possessions and wealth are insufficient. If you turn your mind toward the Dao, how could you not attain it?\n\n**Chapter Forty-Nine: Exhortation to Persevere**\nThe Wondrous Practice Perfected One asked: Studying the Dao is bitter, like bearing a heavy load up a mountain—should one grow weary and stop?\n\nThe Heavenly Worthy said: Press onward, and once you reach the summit, the suffering will cease. Looking down upon all things, they will appear minute and insignificant.\n\n*The Forty-Nine Chapters Sutra of the Most High Lord of the Void and Heavenly Worthy of Primordial Beginning is now complete.*",
      "overlap_context": "of form.\nThough they know pleasure is suffering, a single thought can realize non-being.\n\n**Chapter Thirty-Eight: The Arising of Sorrow and Joy in the Mind**\nThe Heavenly Worthy said: Do not harbor a mind that brings calamity, harming all beings.\nThough sentient beings may not yet perceive it, the divine spirits already know.\nTo endanger others is to endanger oneself; to wrong others is to wrong oneself.\nHeaven and hell—all are created by the mind.\n\n**Chapter Thirty-Nine: The Dharma of the Dao**",
      "start_char": 3737,
      "end_char": 4668,
      "start_sentence": 213,
      "end_sentence": 261,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.71290397644043,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上虚皇天尊四十九章经.txt",
        "category": "本文类"
      }
    }
  ]
}