{
  "source_id": "太上老君中经珠宫玉历",
  "source_file": "chunked_daozang\\太上老君中经珠宫玉历.json",
  "total_chunks": 17,
  "total_original_chars": 17116,
  "total_translated_chars": 93938,
  "total_translation_time": 458.4928343296051,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太清部\\太上老君中经珠宫玉历.txt",
    "category": "正统道藏太清部"
  },
  "full_translation": "**The Central Scripture of the Most High Lord Lao**\n\n**Scripture Title:** *The Central Scripture of the Most High Lord Lao*. Also known as *The Jade Chronicle of the Pearl Palace*. Author unknown. Likely composed during the Wei or Jin dynasties. It is said that Lord Lao transmitted the *Scripture of Dao and Virtue* in its upper and lower chapters, while this scripture serves as the middle chapter. Originally a single scroll, it was later divided into two. Base text from *The Orthodox Daoist Canon*, Taiqing Section. Collated with *The Seven Bamboo Tablets of the Cloudy Satchel*, fascicles 17–18.\n\n---\n\n### **The Central Scripture of the Most High Lord Lao, Volume One**\n\n#### **First Immortal**\nThe Supreme Great One is the father of the Dao, preceding heaven and earth. He resides above the Nine Heavens, within the Great Clarity, beyond the Eight Darknesses, and within the subtlest of realms. I know not his name—he is simply the Primordial Black. His divine form has the head of a crow and the body of a man, resembling a rooster adorned with the five colors of the phoenix. He wears a pearl robe of dark yellow. He dwells precisely above the crown of the adept’s head, nine feet from the body, ever within purple clouds beneath a canopy of blossoming radiance. When the adept beholds him, he speaks: *\"Supreme Great One, Lord of the Dao, your distant descendant, the humble adept Wang Jia, cultivates the Dao with pure devotion. I wish to attain longevity.\"*\n\n#### **Second Immortal**\nThe Boundless Supreme Primordial Lord is the Lord of the Dao. His single body has nine heads, or he transforms into nine persons, each clad in a five-colored pearl robe and crowned with a Nine-Virtue coronet. He is the son of the Supreme Great One—yet not truly his son, for he is the spontaneous Primordial Black. He dwells above the adept’s head within purple clouds beneath the blossoming canopy. When the adept beholds him, he speaks: *\"August Heavenly Thearch, Supreme Lord of the Dao, your distant descendant, the humble adept Wang Jia, cultivates the Dao and wishes for longevity. Nurture me, rear me, protect me, shield me. May venomous creatures and fierce beasts prostrate before me, ensuring all I undertake succeeds and all I seek is attained.\"*\n\nIn the land of Great Clarity, within the village of Emptiness, there is one named Zhu Yu, styled Guang, called Imperial Minister. He is the star within the Purple Tenuity and the Curved Array of the Supreme Subtlety, known as the Heavenly Thearch Radiant-Soul Treasure. The adept should constantly contemplate him, never forgetting. Humans also possess him, residing between the brows, connecting to the Mud-Pellet Palace, its blackness ascending to join with heaven.\n\n#### **Third Immortal**\nThe Eastern King Father is the Primordial Black of the Azure Yang, the progenitor of the ten thousand spirits. He wears a five-colored pearl robe and a three-seam coronet—some say a coronet of three seams. Above him, the Great Clarity’s clouds shine in five colors. He governs the eastern direction and dwells below on Mount Penglai. His surname is Non-Action, his style is Lord Fresh—some say Lord Liberation. Humans also possess him, residing at the crown of the head. To his left is Wang Ziqiao, to his right is Red Pine Master. He governs within the left eye and plays upon the head. His essence and qi ascend to become the sun, named Fuxi.\n\nIn the land of Great Clarity, within the village of Eastern Brightness.\n\nThe Western Queen Mother, styled Yanchang, manifests in the eyes as the sun and moon. The left eye is the sun, the right eye the moon. Within the eyes, the youth is named Yingming. The King Father resides in the left eye, the Queen Mother in the right, and the youth in the center—both eyes are equal. When the adept seeks to cultivate perfection, they must contemplate the Eastern King Father and Western Queen Mother standing together upon the head, uniting the essence and radiance of the sun and moon. Then, descending, they contemplate the Purple Chamber, the Great One, the Crimson Palace, the Yellow Court, the Great Abyss, and the Cinnabar Field. Circulating true qi five cycles through the abdomen, then twelve cycles throughout the body. When the Dao is complete, halt at the Vermilion Bird Gate. The Gate is the two breasts. The left breast is named Lord A, the right breast is named Nie Zhong. Below the breasts lies the Jade Gate, where the Heavenly Dog and Heavenly Rooster reside, governing the crowing and barking of dawn and night.\n\n#### **Fourth Immortal**\nThe Western Queen Mother is the primordial qi of the Great Yin. Her surname is Spontaneity, her style is Lord Thought. Below, she governs Mount Kunlun, its ninefold golden walls enveloped in five-colored auspicious qi, towering ten thousand *zhang* high. Above, she governs the Northern Dipper, beneath the canopy of the blossoming purple chamber and the Northern Asterism. Humans also possess her, residing within the right eye. Her surname is Great Yin, her name is Mysterious Radiance, her style is Yan Jade. Only when the King Father and Queen Mother guard the two eyes can one walk, see clearly, discern beauty and ugliness, and command the myriad spirits below. Like a mother cherishing her child, the child also cherishes the mother. When essence and qi harmonize, one endures for ten thousand generations.\n\nThe two breasts of a person are the essence and qi of the ten thousand spirits, the fluids of yin and yang. Below the left breast is the sun, below the right breast is the moon—the abodes of the King Father and Queen Mother. Above, they govern within the eyes, play upon the head, and rest below the breasts, lodging in the Crimson Palace and Purple Chamber. These are the qi of yin and yang.\n\n#### **Fifth Immortal**\nThe Lord of the Dao is the One, the August Heavenly Thearch, the Northern Asterism of the Central Ultimate, the central star. He resides above the Nine Heavens, upon a peak ten thousand *zhang* high, within the Purple Chamber of the Great Abyss. He wears a five-colored robe and a Nine-Virtue coronet. Above him, the primordial qi of the Great Clarity shines in five-colored clouds beneath a ninefold blossoming canopy. Lord Lao and the Great Harmony attend him to left and right. His surname is Regulating August, his name is Supreme August Virtue, his style is Han Chang.\n\nHumans also possess him, residing within the Purple Chamber beneath the blossoming canopy. In the land of Primordial Nobility, within the village of Peaceful Joy, his surname is Lingyang, his style is Ziming. His body is yellow, nine *fen* in length, clad in a five-colored pearl robe and a Nine-Virtue coronet. When contemplated, he is three *cun* tall, standing within the Purple Chamber beneath the blossoming canopy. His consort is the Great Yin Mysterious Radiance Jade Maiden, who wears a dark yellow five-colored pearl robe. She is nine *fen* in length, and when contemplated, she is also three *cun* tall. She resides in the Grand Simplicity Palace, nurturing the Perfected One’s cinnabar child. Gradually, it grows until it matches one’s own body. If one can visualize and converse with it, it will summon one to ascend and pay homage to the Lord of the Dao.\n\nThe Lord of the Dao is Unity. He rides a chariot of cloud-qi, pearls, and jade, drawn by nine horses of the Nine Ultimates, and at times harnesses six dragons to govern the world. You should constantly visualize Him, and on the eight solar terms, the last day of the lunar month, the first day of the new moon, at dusk, or at midnight, pray thus: \"O Radiant Numinous Node, Perfected One Wang Jia wishes for longevity. May the Great Mystery’s Unity guard my body and form, and may the lords and marquises of my five viscera enjoy eternal peace and tranquility.\"\n\nThe Sixth Immortal:\nThe Venerable Lord is the celestial hun-soul, the Lord of Spontaneity, who constantly attends the Lord of the Dao on the left. Thus, we nine are the Nine-Headed Lords, and I am the foremost, serving as the King Father, while the others hold no such office. Within humans, He resides in the Golden Mansion Village, Small Hut Hamlet, surnamed Pi, named Ziming, styled Lanlan. He wears a blue-green robe, stands nine *fen* tall, holds a mushroom of immortality, and bears a green banner, attending the Lord of the Dao on the left, accompanied by the immortal Zhong Chengzi. When visualized, He is three *cun* tall, ever present to one’s left, equal in stature to one’s own body. His consort is the Plain Maiden, who wears a yellow robe and stands nine *fen* tall. When visualized, she is also three *cun* tall.\n\nThe Seventh Immortal:\nThe Supreme Harmony is the celestial po-soul, the Lord of Spontaneity, who constantly attends the Lord of the Dao on the right. Within humans, He resides in Crow Terrace Village, surnamed Master Jiaoli, styled Weiwei. He wears a white robe, stands nine *fen* tall, wields a golden sword, and holds a white whetstone, attending the Lord of the Dao on the right, accompanied by the immortal Qu Wenzi. When visualized, He is also three *cun* tall, ever present to one’s right in rising, sitting, walking, or halting. His consort is the Jade Maiden of the Azure Waist, who wears a blue-green robe and stands nine *fen* tall. When visualized, she is also three *cun* tall.\n\nThe Eighth Immortal:\nThe Lord of the Mud-Pill Palace is the spirit of the brain, born within it, the root of kidney essence and heart essence. He dwells in Flowery Canopy Village, Penglai Hamlet, and is the South Pole Elder, the Lord of the Mud-Pill Palace. His style is Yuanxian. He wears a five-colored pearl robe and stands nine *fen* tall, residing within the brain atop one’s head, appearing before the brain’s gate in the field of vision. When visualized, He is nine *fen* tall, yet also three *cun*. Upon seeing Him, one should say: \"O South Pole Elder, grant me, so-and-so, longevity, that I may traverse east, west, south, and north, ascend to heaven and enter the earth, never to perish, decay, or lose my way. Inscribe my name in the register of the living, that I may attend the Lord of the Dao and endure as long as heaven and earth.\"\n\nThe Ninth Immortal:\nThe South Pole is Unity, the foremost of immortals, the Supreme Supreme Great One, the celestial Marquis-King and Grand Commandant. He governs all calamities and changes, determining the fortunes and misfortunes of nations. Above, He is the Star of Mars; below, He presides over Huo Mountain.\n\nWithin the human body, He resides in the Longhao precinct, in the central chamber of the Crimson Palace. His surname is Li, given name Shang, also named Chang, and courtesy name Zengzi. He wears crimson robes, nine *fen* in length; when visualized, He is also three *cun* tall, dwelling within the heart. His consort is a Jade Maiden, clad in white robes, nine *fen* in length; when visualized, She is also three *cun* tall. Constantly visualize within the heart a canopied parasol, beneath which stands a figure wearing a vermilion cap of piled silk, crimson ceremonial robes, and named the Celestial Marquis. He is girded with a jade belt and purple sash, bearing a gold seal with dark-yellow cords. Should one perceive Him, one’s vision will penetrate the eight directions, and after a thousand days, one will ascend as an immortal. At the proper time, visualize the youth within the brain—this is the sign of His presence.\n\nThe Tenth Immortal:\nThe Sun and Moon are the Celestial Minister of Education and Minister of Works. They oversee the transgressions of the Son of Heaven and the sovereigns of men, while the Great White Star and the Chronographic Star govern below at Huayin and Mount Heng. Within the human body, they correspond to the two kidneys. The left kidney is male, clad in black robes; the right kidney is female, clad in white robes, each nine *fen* in length; when visualized, they are also three *cun* tall. They are the essence of the Sun and Moon, the blackness of the Void and Nothingness, the root of man. They reside within the eyes, and thus the left eye is the Minister of Education, the right eye the Minister of Works. Each kidney harbors three persons, making six in total: on the left, the Controller of Destinies and the Commandant of Attendants; on the right, the Recorder and the Minister of Justice. They record human transgressions and memorialize the August Heavenly Thearch and the Supreme Lord of the Dao. Constantly preserve this visualization to expunge one’s name from the register of death and inscribe it in the ledger of longevity. They belong to the Taichu precinct, the Xuanming ward. The Recorder and the Six Ding Jade Maidens, whose courtesy name is Daoming, all reside upon the divine tortoise, riding a chariot of purple and black clouds, drawn by a pair of carp, and named Taichengzi. The Dark Mother, the Mother of the Dao, dwells at the center, the teacher of the body. She governs the nurturing of all spirits within the body, seated beneath a five-colored cloud-canopied parasol, wearing the luminous pearl of the Great White Star and the bright moon, whose radiance illuminates the entire body. Regularly visualize Her on the nights of the eight solar terms, and recite the following prayer:\n\n\"O Controllers of Destinies and Recorders, Six Ding Jade Maidens, expunge my name from the register of death and inscribe it anew in the jade ledger of longevity.\"\n\nThe Eleventh Immortal:\nThe Central Pole Yellow Elder is the Lord of the Dipper within the True Person’s palace, the celestial Marquis-King, who presides over the Palace of the Empress and the Plain Maiden. Within the human body, He is also present. The Yellow Court True Person is the father and mother of the Dao, the source of the Red Child, the very self of one’s being. The Empress is the Great Yin Dark Radiance Jade Maiden, the mother of the Dao, situated at the center of the Dipper above the spleen. She wears robes of five-colored pearls, seated beneath a canopied parasol of yellow clouds, and governs the nourishment of the Red Child. Constantly visualize beneath the two breasts the Sun and Moon, within which reside the yellow essence and the red-black *qi*. These enter the Crimson Palace and then proceed into the Purple Chamber of the Yellow Court, filling the Great Granary to abundance. The Red Child sits facing south within the stomach duct, partaking of the yellow essence and red *qi*, thereby becoming sated. All illnesses depart, and the myriad calamities cannot assail. Constantly preserve this visualization, and above, one will become a True Person.\n\nThus it is said: \"Emerging together yet bearing different names.\" There is a commentary that states: \"The sun and moon emerge together yet bear different names.\"\n\nIn the Great Simplicity Village, within the Central Origin Ward, resides the Central Yellow True Person, styled Yellow Skirt Master, who presides over grain avoidance and causes one’s spirit to become luminous, now small, now great. At cock’s crow and mealtime, recite the incantation: *\"Yellow Skirt Master, Yellow Skirt Master, the Yellow Court True Person resides within me. Procure for me medicinal wine, pine-dried meat, polished grain, and millet cakes—all that may be eaten or drunk—so that they arrive at once.\"* After reciting, close your eyes for a moment, shut your mouth, and swallow thirty-four times; you will then be sated.\n\n**The Twelfth Immortal**\nI am the child of the Dao. This is not unique to me; all people possess it. It resides within the Great Granary of the stomach duct, seated facing south upon a pearl-and-jade bed, covered by a canopy of yellow clouds, and clad in robes of five-colored pearls. The mother stands to its upper right, embracing and nourishing it, while the father stands to its upper left, instructing and protecting it. Thus, the father is called Lingyang, styled Ziming; the mother is called Great Yin, styled Dark Radiance Jade Maiden. One’s own body is the Primordial Yang, styled Zidan. The True Person, styled Zhonghuang, is the teacher of my true self. He constantly imparts the Dao of immortality and long life, ever attending at my left and right, resting in the Great Granary within the spleen, sharing guard duty with Yellow Skirt Master to serve the divine and procure what is due. Thus, constantly visualize the True Person Zidan seated facing south within the stomach duct, consuming yellow essence and red *qi*, drinking from the sweet spring. The Primordial Yang Child Zidan is nine *fen* in height; visualize him to be equal in size to your own body. Nurtured by father and mother, he attains transcendence. Constantly envision your own body as a youth within the stomach duct, clad in five-colored robes, seated upon a pearl-and-jade bed, beneath a canopy of yellow clouds and red *qi*, partaking of golden jade elixirs, consuming divine cinnabar and sacred herbs, drinking from the sweet spring, riding a chariot of yellow clouds and five-colored pearls, drawn by twelve flying dragons, twenty-four white tigers, and thirty-six vermilion crows. After nine years of such visualization, you will ascend upon clouds to depart the world and ascend to pay homage to the Dao Lord. The officials of the five directions, numbering thirty-six thousand spirits in all, will elevate your entire clan to the immortal Dao, ascending to heaven in broad daylight.\n\nAt each of the four seasons, make offerings to your ancestors. On the *hai* day of the first month at cock’s crow, make offerings at the suburban altars and ancestral temples; on the *hai* day of the second month, make offerings to the altars of soil and grain, the Earl of Wind, and the Master of Rain. On the *shen* and *mao* days of the fourth and fifth months, the *si* and *wu* days of the seventh and eighth months, and the *mao* and *xu* days of the tenth and eleventh months, perform these rites. In the intercalary months, do not make offerings, but instead dissolve the Earth Lord and expel the concealed corpse. The suburban altar is within the brain’s gate at the crown of the head; the ancestral temple is upon the bone at the back of the skull. The soil altar is at the left end of the spleen; the grain altar is at the end of the large intestine. The Earl of Wind resides at the Eight Gates. The Eight Gates are located beside the navel, within the Five Cities and Twelve Towers. The Master of Rain is at the end of the small intestine. The four streams of cloud-*qi* emerge from Kunlun; the Weak Water is within the bladder. The divine kitchens of all the spirits are within the Great Granary. Call upon the spirits by name in order, and do not forget.\n\n**The Thirteenth Immortal**\nThe Jade Pivot is the Lord of the Northern Dipper, the sovereign of heaven. He governs the twelve thousand spirits and holds the register of human lives. All people possess him within the navel as the Great One Lord, the sovereign of the human body. The Pillar of Heaven, Grand General, is a specially advanced marquis who governs the twelve thousand spirits within the body.\n\nIn the Central Ultimate Village, Jade Pivot Ward, his surname is Wang, given name Yang, styled Lingzi. He wears a three-seamed cap and a single-layered crimson robe, nine *fen* in length; when visualized, he is three *cun* tall, his size equal to one’s own body. The Great One Lord has eight attendants, the spirits of the Eight Trigrams. The Great One resides at the center, presiding over the review of all spirits, examining and verifying their records to prevent their escape. The eight attendants report to the Great One on the eight seasonal nodes. Thus, the navel is called the Mansion of the Great Abyss, the village of the capital.\n\nConstantly on the autumnal equinox, review this calculation. Bathe and fast, and for three days prior, do not leave the chamber. Call upon him thrice daily for three days, nine times in all. By doing so, none of the spirits may escape, your name will be recorded among the transcendent immortals, and you will be confirmed as a True Person. Thus, the Great One may not rashly ascend to report; if the report is inauspicious, misfortune will follow, but this concerns only the eight attendants.\n\nOn the days of the eight seasonal nodes, the last day of the month, the new moon, the first and last quarters, and the full moon, tap the navel thirty-four times with the right hand and stroke the heart forty-nine times with the left hand, reciting: *\"Heavenly Numinous Splendor True Person, so-and-so wishes to attain long life. May the Great Mysterious True One guard so-and-so’s body. May the lords of the five viscera and all the marquises remain peaceful. Recite the primary incantation seven times, the secondary twenty times.\"* The next morning at dawn, recite again: *\"Great One Lord of the Northern Culmen, I respectfully beseech all the spirits to constantly guard and keep my hun and po souls peaceful, never departing from so-and-so’s body.\"* This is what is meant by restraining the hun and controlling the po.\n\nOn the last day of the twelfth month at the hour of *ren ding*, face the moon’s position in an empty chamber, bow twice, sit upright, close your eyes, and recite: *\"Lords of the five viscera, spirits of the hun and po, so-and-so seeks long life. Do not depart from the body; constantly unite with the form to become one with it.\"* Men and women each recite this three times. On the days of the eight seasonal nodes, within the chamber, face the Jade Pond, bow twice, close your eyes, and recite: *\"Great Dao, Vast Ford, Vast Ford, on the days of the celestial nodes, the hun and po of the myriad beings all ascend to the heavens. The True Person’s body unites with the spirit. So-and-so desires long life, alone in an empty chamber, not listed in the register of the dead.\"* Men and women each recite this three times.\n\nOn the last day of the twelfth month, from the night’s vigil through dawn to morning, within the chamber, face the *yin* direction, bow twice, and recite: *\"Vast Ford, Vast Ford, so-and-so has received the grace of the Great Dao, the Supreme Clarity and Mysterious Summit. I wish to restore the years of so-and-so’s past life. May the hun and po protect the body.\"*\n\nMen and women each recite this three times.\n\n**Fourteenth: The Immortals of the Navel**\nThe navel is the life of man. It is also called the Central Ultimate, the Grand Abyss, Kunlun, the Unique Pivot, and the Five Cities. Within the Five Cities dwell the Five True Persons. The Five Cities are the Five Thearchs. Beyond the Five Cities are the Eight Officers, who are the spirits of the Eight Trigrams. Together with the Great One, they form the Nine Ministers. Beyond the Eight Trigrams are the Twelve Towers, which are the Twelve Great Princes and Twelve Grand Masters. Together with the spirits of the Triple Burner, they form the Twenty-Seven Grand Masters. The spirits of the four limbs are the Eighty-One Primordial Gentlemen.\n\nThus, the True Persons of the Five Cities preside over the reckoning of the four seasons; the Eight Spirits preside over the reckoning of the eight seasonal nodes; and the Twelve Grand Masters preside over the reckoning of the twelve months, submitting their accounts on the last day of each month. If one does not slacken month by month, one will be exempt from the reckoning. Constantly maintain this visualization, and one will attain long life.\n\nTherefore, the Great One always strikes the drum in the Five Cities at midnight on the last day of the month, the first day of the month, and the eight seasonal nodes, assembling and summoning all the spirits to audit merits and transgressions, deliberating good and evil. Those recorded shall have their lives extended, and all the spirits shall endorse them. Those unrecorded shall perish, and the Controller of Destinies shall erase their names from the register of the living.\n\nThus, on the last day of the month, the first day of the month, and the eight seasonal nodes, when about to sleep at night, visualize the Upper Great One, the Middle Great One, the Lower Great One, the True Persons of the Five Cities, and the True Persons of the Twelve Towers, and recite: *\"Celestial Thearch, Great One, Celestial Thearch, Great One, reverently visualize all the spirits, befriending them. Controllers of Records, Controllers of Destinies, the Six Ding Jade Maidens—erase my name from the register of the dead and inscribe it in the records of the living. All shall speak of long life.\"*\n\n**Fifteenth: The Immortals of the Five Cities**\nThe True Persons of the Five Cities are the spirits of the Five Thearchs of the Five Directions. The spirit of the East is named Gou Mangzi, styled Master Hongya of Literary Beginnings, the Azure Thearch and Lord of the Eastern Sea. The spirit of the South is named Zhu Rongzi, styled Master Cheng of Vermilion Radiance, the Vermilion Thearch and Lord of the Southern Sea. The spirit of the West is named Rushouzi, styled Master Huang of Xiali, the White Thearch and Lord of the Western Sea. The spirit of the North is named Yu Qiangzi, styled Master Chang of Dark Mystery, the Black Thearch and Lord of the Northern Sea. These are all later spirits, equal to the spirits of Heaven, Earth, and Man.\n\nThe spirit of the Wind Earl is named Zha Jun, styled Longyu. The spirit of the Rain Master is named Feng Xiu, styled Shude. Constantly visualize these spirits, causing them, together with the Lord Controller of Destinies and the Lord Controller of Records, to erase your name from the register of the dead, and you shall become a True Person and attain long life. If you do not know them or visualize them, they will become fierce winds and violent rains, thunder and lightning, seizing you and carrying you far away, slaying your body, burying you in deep mountains, casting you into deep abysses, or striking you with poisonous qi, while myriad ghosts harm you. If you wish to cultivate the Dao, you must pay them reverence. These spirits can harm people, and those who govern the realm cannot afford to be ignorant of them.\n\nThe spirit of the Central Realm is named Huang Shangzi, styled Huangshen Pengzu, and is the Yellow Emperor Lord of the Center. Together with the Central Grand Unity, they govern the destinies of humanity, nurturing the virtuous and aiding people’s accomplishments, ever attending the True Persons of the Yellow Heaven. Within humans, there also resides one who constantly attends the True Person, named Zidan, granted by the spirits.\n\nIf you aspire to set your mind on the Dao, constantly visualize them, and you shall neither hunger nor thirst, attaining long life and enduring vision. Ascending as a True Person, you will be able to summon the traveling kitchen and command ghosts and spirits.\n\nThe spirits of the Earth Altar and the River Earl are named Feng Yi, styled Yuanliang Messenger.\n\n**The Sixteenth Immortal: The Eight Trigram Heavenly Spirits**\nThe Eight Trigram Heavenly Spirits descend to roam among humanity, guarding the Grand Unity and serving as messengers of the eight directions. They oversee the reckoning of auspicious and inauspicious events on the days of the eight solar terms.\n\n- The Qian spirit is named Zhongni, styled Fuxi.\n- The Kan spirit is named Da Zengzi.\n- The Gen spirit is named Zhaoguang Yu.\n- The Zhen spirit is named Xiao Zengzi.\n- The Xun spirit is named Da Xiahou.\n- The Li spirit is named Wenchang.\n- The Kun spirit is named Yangdi Wang, styled Nüwa.\n- The Dui spirit is named Yishi. (Alternatively, some say Bashì.)\n\nOn the days of the eight solar terms, constantly visualize them, for these spirits all reside within the navel, granting one extended years.\n\n**The Seventeenth Immortal: The Cinnabar Field**\nThe Cinnabar Field is the root of the human body, the repository of essence and spirit, the origin of the five viscera, the palace of the Red Child, where men store essence and women store menstrual blood. It governs the birth of children and is the gateway for the harmony of yin and yang. Located three inches below the navel, attached to the spine, it is the root of the two kidneys.\n\nWithin the Cinnabar Field, the center is red, the left blue-green, the right yellow, the top white, and the bottom black, forming a square of four inches. Its location three inches below the navel follows the model of Heaven, Earth, and Humanity—Heaven as one, Earth as two, Humanity as three, and the seasons as four, hence four inches. It aligns with the five phases, thus bearing five colors.\n\nIt is the Clear Water Village, Aoqiu Hamlet. The Cinnabar Field is named the Palace of Stored Essence. Its spirit’s surname is Kong, given name Qiu, styled Zhongni, transmitted as the master.\n\nConstantly at midnight, visualize the heart’s red and black qi ascending to the Crimson Palace and the Florid Canopy, circling each to the right. The Grand Unity enters the Yellow Court, fills the Great Granary, nourishes the Red Child, and returns to the Great Abyss, suddenly vanishing without trace. Then visualize the Grand Unity’s black qi returning to rest within the Cinnabar Field. Constantly visualize the Grand Unity, the Mysterious Radiance, the Dao Mother, and the True Person Zidan, who rectifies my body—from your own name—without forgetting.\n\n**The Eighteenth Immortal**\nThe large and small intestines serve as the Yuanliang Messengers, expelling and capturing pathogenic qi. The Triple Burner and the Pass of Origin act as the Left Altar and Right Millet spirits, capturing traitors and rebels. The primordial qi of the Upper Burner ascends into the head, forming the ancestral temple, making one’s body equal to Heaven and Earth.\n\nHeaven and Earth, with all their myriad things, must not be violated, for the spirits of Heaven and Earth know all. Likewise, the four limbs of the human body must not be harmed. If there is pain or itching, the spirits also know. From this, it is clearly evident: Heaven cannot be deceived, Earth cannot be betrayed. Cultivate the body and be cautious in conduct, never allowing negligence.\n\nIf you wish to expel pathogenic qi and cure the hundred diseases, knock the teeth together twenty-one times and recite:\n*\"Left Altar, Right Millet, Yuanliang Messengers, expel and capture calamities and misfortunes—hasten as the statutes command!\"*\nSwallow five times, sigh once, and repeat thirty swallows in total. Perform three hundred and sixty swallows in a day and night. After thirty days, pathogenic qi departs; after sixty days, minor illnesses are cured; after a hundred days, major illnesses are healed. The Three Worms all die, the Three Corpses flee, the face and eyes radiate light, and you become a friend to the spirits. After six recitations, pause; twelve recitations complete one cycle.\n\n**The Nineteenth Immortal**\nBetween the two kidneys is named the Great Sea, also called Weak Water, wherein resides a spirit turtle. It breathes primordial black qi, generating wind and rain, circulating qi through the four limbs, knowing all without exception.\n\nAbove it are nine persons, arranged in three groups of three. To the left is Han Zhong, to the right Fan Li, and in the center, Dachengzi. On the left is the Minister of Education, on the right the Minister of Works, and in the center, the Grand Unity Lord.\n\nTo the left is the Azure-Waisted Jade Maiden, to the right the White Water Plain Maiden, and in the center, the Mystic Radiance Jade Maiden. The Mystic Radiance Jade Maiden is the mother of the primordial qi of the Dao. To the left is the Recorder, to the right the Life-Regulator; the Wind Earl and Rain Master escort her, thunder and lightning attend her arrival and departure, while immortals and jade maidens guard the gates and doors—thus it is named the Palace of the Great Abyss.\n\nFormerly, within the Purple Chamber Palace, the Grand Unity’s Mystic Maiden and the Crimson Child resided. Therefore, the Mystic Maiden ever wears the Radiant Star of Venus upon her head and the Luminous Pearl of Supreme Brightness upon her ears, her light illuminating her entire body, thereby prolonging life to immortality.\n\n**The Twentieth Immortal**\nThe stomach is the Great Granary, the kitchen and storehouse of the Three Sovereigns and Five Emperors. The chambers of the heart are the Celestial Son’s palace; all spirits gather in the Great Granary to feast. Thus, the stomach is the Great Granary, where the sun, moon, and three paths traverse. It is also called the Great Sea, wherein resides a spirit turtle. Above the turtle stand the seven stars of the Northern Dipper, positioned at the center. The turtle is yellow, resembling a golden platter, with the sun and moon illuminating it on either side.\n\nThus, below the navel lies the Earth’s Center, where the Five Peaks and Four Seas converge, waters and springs interflow, and the Weak Water of Kunlun sinks deep into the Dark and Profound Abyss. As the sun and moon traverse, heaven’s daylight shines upon the earth below, and all spirits receive its illumination. Humans emulate this: by day, the sun descends into the navel, illuminating the Cinnabar Field, so that all spirits within the navel receive its light. By night, the sun resides in the stomach, shining upward into the chest, where all spirits roam, play, and converse—thus do dreams arise.\n\nHeaven does not conceal, nor do humans remain unprepared; therefore, summon the spirits to inquire of good and ill fortune, that the kidneys may be guarded with vigilance. By night, the moon rests in the navel, shining downward upon all spirits. By day, the moon resides in the stomach, shining upward into the chest. All spirits ascend and descend in turn, without rest.\n\nThus, within the stomach dwell twelve spirits: the Remonstrating Gentlemen named Yellow Skirt Master, Yellow Soaring Master, and Central Yellow Master, who serve as tutors and attendants to the Crown Prince. The Mystic Radiance Jade Maiden presides over the gathering of golden liquid, divine elixirs, magic mushrooms, jade essence, pine resin, and all that may be consumed—all shall arrive at once.\n\n**The Twenty-First Immortal**\nIf you, Zhao, truly seek immortality, you must know the abodes of Heaven and Earth, father and mother, and the Crimson Child. If you pursue the Dao, you cannot be ignorant of these five spirits’ names—you must endure hardship. Know them, practice them, hold fast to them, and constantly contemplate them, and you shall become an immortal. All is contained within the scriptures; you need only comprehend with the heart.\n\nHaving known the spirits, you must then obtain the Grand Unity’s divine elixir and golden liquid to attain immortality. All spirits are of primordial blackness, empty and non-acting, naturally becoming sages—not for the vulgar to employ. If you, Zhao, cannot ingest the divine elixir and golden liquid, exhaust your essence in contemplation, and endure hardship.\n\nThus, I say to you, Zhao: by day, constantly contemplate the sun within the navel, its crimson-yellow essence and black radiance illuminating the navel. Within the stomach is the moon, its white light and crimson-yellow essence filling the stomach with blackness. By night, contemplate the sun within the stomach, its crimson-yellow essence and black radiance illuminating the chest. The moon resides in the navel, its crimson-white light and black essence illuminating the navel. Make this your constant practice, unceasing for ten thousand generations.\n\n**The Twenty-Second Immortal**\n\nThe hair’s spirits are seven, the essence of the Seven Stars. Their name is Lu Zhi. The spirits of the two eyes are six, the essence of the sun and moon. The left eye’s name is Ying Ming, the right eye’s is Xuan Guang. The spirits atop the head are three, the Bound King Father. The spirits within the brain’s chamber are three, the Mud-Pill Lord. The spirits between the brows are three, the South Pole Elder, Yuan Guang, and the Celestial Numinous Lord. The spirits of the two ears are four, the essence of yin and yang, named Jiao Nü. The spirit within the nose’s bridge is one, named Tai Yi, styled Tong Lu, originally of celestial numinosity. The spirits beside the mouth are two, the kitchen stewards and guardians. The spirit within the mouth is one, the Tai Yi Lord, styled Dan Zhu. The spirits beneath the chin are three, the spirits of Great Yin. The spirits outside the neck are two, the Jade Maiden Lord. The spirits within the two hands are two, the essence of Great Yang, styled Hun Yin. The spirits within the nape are two, styled Shang Wen. The spirits of the shoulders and back are two, the essence of Lesser Yin and Lesser Yang, styled Nü Jue. The spirits within the chest are two, the Tiger-Rushing Spirits. Beneath the two breasts are the sun and moon. Within the sun and moon are great spirits, one each, the King Father and Queen Mother. The spirits beneath the two armpits are two, the Hun and Po’s Zhao Spirits. The spirits within the lower abdomen are two, Jade Maidens. The spirits within the two thighs are two, also Jade Maidens, styled Yin Yin. The spirits of the two meridians are two, the spirits of Metal and Wood, styled Sui Kong Zi. The spirits of the two feet are two, the essence of Great Yin, styled Zhu Tian Li Shi.\n\nThe hair’s spirit is styled Lu Zhi. The ear’s spirits are styled Jiao Nü. The eye’s spirits are styled Ying Ming and Xuan Guang. The spirit within the nostrils is styled Tong Lu. The mouth’s spirit is styled Dan Zhu. The shoulder and back’s spirits are styled Zhu Que, also called Nü Jue. The hand’s spirits are styled Po Yin. The Upper Prime’s spirit is styled Wei Cheng Zi. The Middle Prime’s spirit is styled Zhong Huang Zi. The Lower Prime’s spirit is styled Ming Guang Zi, also called Ming Guang. The yin spirit is styled Qiong Ying. The thigh’s spirits are styled Yin Yin. The knee’s spirits are styled Shu Gong.\n\nWhen you, Zhao, wish to lie down, close your eyes and sequentially invoke them three times from the top, ceasing only when finished. If there is pain or illness in any part, invoke its spirit nine times and command it to heal. All ailments will depart, and you shall become an immortal.\n\n**The Twenty-Third Immortal**\n\nThe lung’s spirits are eight, the Tai He Lord, named Jade True Palace, the Ministry of Works. Their retinue numbers three thousand six hundred, riding chariots of white clouds and blackness, drawn by white tigers, or riding white dragons. The heart’s spirits are nine, the Grand Commandant, named Crimson Palace, the South Pole Elder Yuan Guang. Their retinue numbers three thousand six hundred, riding chariots of red clouds and blackness, with vermilion phoenixes as canopies and cinnabar serpents as shafts, drawn by vermilion phoenixes, or riding red dragons. The liver’s spirits are seven, the Lord Lao Zi, named Bright Hall Palace, the Orchid Terrace Ministry. Their retinue numbers three thousand six hundred, riding chariots of blue-green clouds and blackness, drawn by azure dragons, or riding white deer. The gallbladder’s spirits are five, the Tai Yi Dao Lord, residing in the Purple Chamber Palace, riding a chariot of five-colored clouds, a canopy of mysterious yellow and purple, and pearl-and-jade clouds, drawn by six flying dragons. Their retinue numbers three thousand six hundred. The spleen’s spirits are five, the Yuan Guang Jade Maiden, the Mother of Cinnabar Child. They ride a chariot of yellow gold, pearls, and jade clouds, drawn by phoenixes, or riding yellow dragons. Their retinue numbers three thousand six hundred.\n\nThe Perfected One, Cinnabar Child, dwells above, within the outer stomach’s tube, beneath a canopy of yellow clouds and blackness, a forest of pearls and jade. He consumes golden jade elixirs, drinks sweet springs and jade liquids, ingests the Tai Yi divine elixir, and gazes upon jade plums and magic mushrooms. Nurture him through visualization, and in nine years, he shall attain perfection. With a thousand chariots and ten thousand riders, he ascends to pay homage to the Supreme Yellow Dao Lord, eastward to the King Father, westward to the Queen Mother, southward to the Elder Yuan Guang. The Perfected One attains the Dao and unites with heaven and earth.\n\nThe Primordial Yang Cinnabar Child is I. When my Dao is accomplished, I depart, ascending to heaven in broad daylight, or riding a chariot of yellow gold, clouds, and blackness, pearls and jade, drawn by six flying dragons, reins held by boundless horses. A retinue of eighteen thousand attends me. The Celestial Master’s great spirits send down eighteen thousand to reside within my body, combining into thirty-six thousand. Thus, I ascend to heaven in broad daylight.\n\nThe stomach’s spirits are twelve, the blackness of the Five Primes, the Grand Master of Remonstrance. The navel’s spirits are five, the Tai Yi’s eight, totaling thirteen. Combined, they are twenty-five, the spirits of the Five Phases and yin-yang. Atop the divine tortoise are three spirits: Mysterious Maiden, Emptiness, and Dao Mother. The kidney’s spirits are six: Minister of Education, Minister of Works, Controller of Destinies, Recorder, Constable, and Commandant of the Court Gentlemen. They ride a chariot of the divine tortoise, drawn by six carp, also called white fish, with a canopy of mysterious white clouds and blackness.\n\nThe cinnabar field’s spirits are three, the root of the person. The Three Harmonies complete virtue, aligning with the Dao’s numbers. The triple burner’s spirits are six: Left Minister, Right Minister, Wind Earl, Rain Master, thunder, lightning, and thunderbolts. The large and small intestines’ spirits are two, the Envoys of Primordial Beams. The Tiger-Rushing Spirits are two, the Mighty Warriors, stationed at the Vermilion Phoenix Gate, extending years and increasing lifespan, serving below the Perfected One in the Phoenix Pavilion. The Mysterious Valley’s spirits are five, the Grand General and Marshal. The yin spirits are three, the Supreme General, the essence of the myriad spirits. For men, they are styled Qiong Ying; for women, Dan Cheng.\n\nThe celestial spirits number eighteen thousand, the human spirits eighteen thousand, together thirty-six thousand. United, they lift the body to ascend to heaven, and one becomes an immortal.\n\n**The Twenty-Fourth Immortal**\n\nThe goddess of the eastern direction is named Azure-Waisted Jade Maiden; the goddess of the southern direction is named Vermilion Jade Maiden; the goddess of the central direction is named Yellow-Silk Jade Maiden; the goddess of the western direction is named White-Silk Jade Maiden; the goddess of the northern direction is named Mysterious-Light Jade Maiden. To the left is Everlasting Yang, to the right is Receiving Wings—these are all names of the Jade Maidens.\n\nThe Way of the Five Phases takes as wife the element it overcomes. For instance, if today is a *jia-yi* day (Wood), Wood overcomes Earth, so *jia* takes *ji* as wife. Thus, *jia-ji*, *yi-geng*, *bing-xin*, *ding-ren*, and *wu-gui* are the days when husband and wife unite. The Liver and Gallbladder correspond to Wood, and the Wood Emperor takes the Central Palace’s *wu-ji* Yellow-Silk Jade Maiden as wife. The rest follow this pattern.\n\nWhen these two spirit-maidens arrive, serve them with reverence and never take a wife. Taking a wife kills a man, and he will never attain the Dao. If you wish to cultivate the Dao, beware of lust—lust leads to death. These Jade Maidens may be commanded to fetch Jade Nectar and prepare the traveling kitchen.\n\n**The Twenty-Fifth Immortal**\nThe Supreme Divine One is named Primordial Radiance Grand Unity Lord. To attain the spirit of Grand Unity is not the spirit of the heart but the celestial spirit Southern Culmen Elder, Primordial Radiance, who descends into the human heart. At dawn, midday, *jia-wu* days, or *bing-wu* days, invoke him, saying: *\"Southern Culmen Elder, Primordial Radiance Grand Unity Lord, so-and-so wishes to obtain the Grand Unity’s divine elixir and the Way of long life.\"* Then close your eyes and visualize the Grand Unity Child within your heart, clad in a crimson robe, its color a pure vermilion-yellow like the sun. After ninety breaths, cease.\n\nThe spirit within the heart is named Radiant Firmness, the Central Grand Unity Central Culmen Lord, residing in the spleen to nourish your body. At cock’s crow, mealtime, dusk, or on *chen-xu-chou-wei* days, invoke him, saying: *\"Central Culmen Radiant Firmness Grand Unity Lord, so-and-so wishes to obtain the Perfected One’s divine immortality and the Yellow Court’s Way.\"* Then close your eyes and silently visualize a yellow-black figure filling the Great Granary and stomach duct, with a yellow person above the spleen. After fifty breaths, cease.\n\nThe spirit below the heart is named Mysterious Valley, the Northern Culmen Lord, the Mysterious Light’s Way-Mother. At midnight, on *jia-zi*, *bing-zi*, *wu-zi*, *geng-zi*, or *ren-zi* days, invoke her, saying: *\"Northern Culmen Lord, Mysterious Valley Way-Mother, so-and-so wishes to obtain the Golden Liquid and Sweet Spring for sustenance.\"* Then close your eyes and visualize between the kidneys a white-black expanse, within which is a spirit-tortoise. Upon the tortoise is a Mysterious Maiden, with the Director of Destinies to her right and the Recorder of Deeds to her left. Upon seeing them, call out: *\"Director of Destinies, Recorder of Deeds, Six Ding Jade Maidens, erase so-and-so’s name from the register of death and inscribe it in the Jade Calendar of life—all shall speak of long life.\"*\n\nThus it is said: *\"Knowing the names of the Three Spirits, one may restore life and extend years.\"* These Three Spirits are the Heavenly, Earthly, and Divine Way Lords, the Three Primordial Lords of humanity’s origin. Constantly visualize them without forgetfulness. The Three Primordials are the noble spirits of Heaven.\n\n**The Twenty-Sixth Immortal**\nIf you wish to cultivate the Dao, first traverse the viscera and behold their spirits—only then will you have faith. With accumulated faith, the spirits will reveal themselves. First, visualize the Heavenly Numinous Lord: a blue-bodied, white-headed figure residing between the brows. Meditate on him for three days, and you will see his spirit.\n\nVisualize the Mysterious Breast: a radiant vermilion form. Visualize the throat as pure white like silver, encircled by twelve rings. Meditate on each for three days. Then visualize the lungs as pure white, named *Honghong*, for seven days. Visualize the heart as pure red, named *Taowen*, for nine days. Visualize the liver as pure blue, named *Lanlan*, for three days. Visualize the gallbladder as pure blue, named *Huhu*, for three days. Visualize the spleen as pure yellow, named *Bibi*, for five days. Visualize the stomach as pure yellow, named *Riyidan*, for five days. Visualize the kidneys as pure black, named *Weiwei*, for three days. Visualize the Grand Unity within the navel as red, the person named Jade Numinous Child, for three days. Visualize the large intestine as pure white, named *Dongdong*, for seven days. Visualize the small intestine as pure red, named *Qieqie*, for nine days. Visualize the Cinnabar Field as pure red, within which is a red person named *Cangjing*, for three days. Visualize the Mysterious Cubit and Square Cubit, within which a person resides, for seven days. Visualize the Gold and Jade Seal as dry, complete, and firm, for three days. Visualize the Mysterious Flower as pure black, moist and radiant, for three days. Visualize the two flanks—within each flank’s interior is a Jade Maiden, clad in crimson robes and green skirts, standing upright upon the flanks, for three days. Visualize beneath each foot a person, pure white, for three days.\n\nHaving completed the visualization of the Dao, remain in a quiet chamber, renounce worldly affairs, embrace purity and emptiness, first purify yourself, regulate your diet, and then meditate according to the Dao.\n\n**The Twenty-Seventh Immortal**\nIf you truly wish to cultivate the Dao and become an immortal who never dies, first expel the Three Worms and subdue the Lying Corpses. For three days, perform 160 breaths, ingesting *qi* thirty times before pausing, and ninety times before resting. Do this four times daily. At midnight and cock’s crow, recite the following incantation:\n\n*\"Eastern Azure Fang, purple clouds streaming with rosy dawn—consume Azure Fang, ingest the morning’s glory.\"* Swallow thrice.\n\n*\"Southern Vermilion Cinnabar, resplendent and circling—consume Vermilion Cinnabar, drink from the Cinnabar Pool.\"* Swallow thrice.\n\n*\"Central Yellow-Black, Yellow Court’s lofty immortal—consume Yellow-Black, drink the Sweet Spring.\"* Swallow thrice.\n\n*\"Western Bright Stone, luminous golden essence—consume Bright Stone, drink the Golden Liquid.\"* Swallow thrice.\n\n*\"Northern Mysterious Nourishment, Mysterious Pearl’s moistening essence—consume Mysterious Nourishment, drink the Jade Syrup.\"* Swallow thrice.\n\nAfter thirty days of this practice, the Three Worms all perish, their corpses fleeing away. The Three Spirits settle into their proper places, their black essence stabilized, and the corpse-demons dare not return to the adept’s body. Thus, one attains immortality as a transcendent, inscribed with jade script and golden name, ascending upon clouds.\n\nThe *Upper Scroll of the Central Scripture of the Supreme Lord Lao* concludes.\n\n---\n\n**Twenty-Eighth Transcendent**\nOn the days of the six *jia* stems, at the hour of *pingri*, clasp the heart and recite the incantation:\n*\"Verdant Forest, Dark Turtle—how flows the water? Fire blazes around the body. How can others know? The Dao comes to return to oneself, the Dao comes to return to oneself.\"*\nThen visualize the liver’s true color as azure, lustrous and radiant, towering high in the left quadrant. Next, visualize the gallbladder’s true color as azure and round, its interior yellow and exterior green, lustrous and clear, nestled beside the heart and attached to the liver, which covers its crown—this is the beginning of the Dao.\nWhen the visualization is complete, call upon its spirit:\n*\"Flesh—*or *Skin*—*Child Blue-Blue, be my companion and remain as my servant. I desire the Elixir of the Great One to ingest, that I may live long. Do not depart from my body; abide always in the Purple Chamber Palace, merging with the Dao as one.\"*\nThen close the eyes and visualize the azure-black essence of the sun descending upon the body, entering the nostrils. Envision the liver’s azure-black hue uniting with it before your eyes, then drawing it into the mouth and swallowing thirty-seven times. Circulate the azure-black essence throughout the body, pausing after ninety breaths.\nOn *yi* days, again visualize the spirit and call:\n*\"Maiden of the Great One’s Purple Chamber—*or *Purple Palace*—*be my companion and remain as my servant. I desire the Florid Talisman of the Great One to ingest.\"*\nRepeat the visualization on *jia-yin* and *yi-mao* days.\n\n**Twenty-Ninth Transcendent**\nOn the days of the six *bing* stems, at the hour of *yuzhong*, clasp the heart and recite the incantation:\n*\"Vermilion Bird, Cinnabar Liquid—Heaven’s Sea, Earth’s River. I seek deathlessness, ingesting Heaven’s Harmony.\"*\n(*Heaven’s Harmony* may also read *Supreme Harmony*.)\nThen close the eyes and visualize the heart’s true color as crimson like the sun, resting between the lobes of the lungs. Envision the sun’s red-yellow-black essence appearing before the eyes, entering the mouth, and swallowing twenty-seven times. Circulate the red-black essence throughout the body, pausing after one hundred and eighty breaths.\nCall upon its spirit:\n*\"Li Shang—*or *Li Chang*—*Zengzi, be my companion and remain as my servant. I desire the Elixir of the Great One, golden and pure, fit for ingestion, to abide always in the Crimson Palace, merging with me as one.\"*\nOn *ding* days, again visualize the spirit and call:\n*\"Jade Maiden of the Crimson Palace of the Heavenly Sovereign, be my companion and remain as my servant. I desire the Heavenly Sovereign’s Way of Longevity.\"*\nRepeat the visualization on *bing-wu* and *ding-si* days.\n\n**Thirtieth Transcendent**\nOn the days of the six *wu* stems, at the hour of *jiming* or *rixi* (dusk), clasp the heart and recite the incantation:\n*\"Heaven’s Dao, Heaven’s Dao—I wish to never age. My lifespan rivals the Central Sovereign; ascending to Heaven ever early. May my life be prolonged, enduring with the Dao.\"*\nThen close the eyes and visualize the yellow-black essence within the spleen rising to the mouth. Above, envision the yellow-black essence of Heaven’s essence appearing before the eyes, entering the mouth, and swallowing fifteen times. Circulate the yellow-black essence throughout the body, pausing after one hundred and fifty breaths.\nCall upon its spirit:\n*\"Jade Maiden of Mystic Radiance, nurturing the Red Child, the Perfected One’s Child Elixir—ingesting primordial black, feasting on Sweet Springs. Thus, the body’s spirits have three parents in all.\"*\nOn *ji* days, again visualize the spirit and call:\n*\"Jade Maiden of the Yellow Court of the Perfected One, be my companion and remain as my servant. I desire the Perfected One’s Way of the Yellow Court Transcendent.\"*\nRepeat the visualization on *wu-chen*, *ji-wei*, *wu-xu*, and *ji-chou* days.\n\n**Thirty-First Transcendent**\nOn the days of the six *geng* stems, at the hour of *ribu*, clasp the heart and recite the incantation:\n*\"Root Child, Root Child—white clouds suddenly rise, mist veiling ten thousand *li*. May the clouds return to me, ever as my servants, reversing the mandate of transcendence, ending only to begin anew.\"*\nThen close the eyes and visualize the lungs’ true color as white, summoning the white-black essence to rise to the mouth. Envision the white-black essence of Heaven’s essence descending before the eyes, entering the mouth, and swallowing twenty-one times. Circulate the white-black essence throughout the body, pausing after one hundred and forty breaths.\nCall upon its spirit:\n*\"Master Wei-Wei, be my companion and remain as my servant, bearing the Florid Canopy, Golden Liquid, and Jade Blossoms. Never depart; attend me, the Dao Lord, merging as one body.\"*\nOn *xin* days, again visualize the spirit and call:\n*\"Radiant Yellow Jade Hall, Jade Maiden of the Azure Waist, be my companions and remain as my servants. I desire the Elixir of Pengzu’s Longevity and Deathlessness to ingest.\"*\nRepeat the visualization on *geng-shen* and *xin-you* days.\n\n**Thirty-Second Transcendent**\nOn the days of the six *ren* stems, at the hour of midnight, clasp the heart and recite the incantation:\n*\"I wish to behold Heaven’s Mirror, the Mystic Nourishment of the Jade Pool. Returning white to black, ever as an infant. May the spirits return to me, the Five Viscera following in tow.\"*\nThen close the eyes and visualize the white-black essence circulating between the two kidneys, suffusing the entire body in twelve cycles, spreading and flowing through the four limbs.\n\nThen visualize the two kidneys again, towering and arrayed like a pair of carp—black on the right, crimson on the left—flanking the spine where they reside. Their dazzling radiance illuminates the entire body. Next, envision the azure heavens and the Primordial Brilliance of the Great Clarity descending before your eyes, entering your mouth, and swallowing it nine times in succession. Circulate the White Primordial and Black Perfection of the Great Clarity throughout the body, then return and store it in the Cinnabar Field. Call upon its spirit, saying: *\"Controller of Records, Six Ding Jade Maidens, erase my name from the register of death, that I may attain long life, ascend as a Perfected, and the Twelve Celestial Ones all declare me living.\"* Repeat the visualization on *ren-zi* and *gui-hai* days.\n\n**Thirty-Third Transcendent**\nOnce the visualization of the spirits of the Five Viscera is complete, proceed to visualize *Xuanxi*, *Yuying*, and *Jinye*, ensuring they are never forgotten. For *Xuanxi*, envision it as moist and luminous, rising in ordered ranks. For *Yuying*, imagine within it a figure with a large, inverted face, dressed as a young child. Visualize it to strengthen and double its size. For *Jinye*, envision it as dry and unhurried, like purple millet filled with mercury. After completing this full-body circulation, repeat the visualization twelve times. When the spirit settles within, harmony and darkness will naturally arise, all illnesses will depart, and lifespan will align with heaven and earth—attaining boundless longevity, how could one know the hour of death?\n\n**Thirty-Fourth Transcendent**\nIngesting the essence of the sun grants long life. Ascend thus to the heavens and pay homage to the Dao Lord. The method: on the first, second, fifth, seventh, ninth, eleventh, thirteenth, and fifteenth days of the lunar month, at sunrise, face the sun with unbound hair. Close your eyes and visualize a small child within your heart, clad in crimson robes adorned with five-colored patterns, glowing with a brilliant red hue. Both palms are also radiant red. Rub your face with your palms, descending to the heart, repeating this twelve times. Envision the sun’s essence—pure red, yellow, and black—descending before you, entering your mouth, and swallowing it nine times. Guide it with your hands and recite the heartfelt incantation: *\"Radiant Lord of the Sun, unite your power with mine, together nourishing the crimson child within the Crimson Palace.\"* Then visualize it descending from the heart to the Cinnabar Field, guiding it with your hands. Absorb the sun’s essence into your heart, and you shall become an immortal.\n\n**Thirty-Fifth Transcendent**\nIngesting the essence of the moon nourishes the root of the kidneys, turning white hair black again and causing fallen teeth to regrow—thus attaining immortality. At midnight, circulate the white and black essence between the kidneys throughout the body, ascending to the brain’s gate and descending to the soles of the feet. The natural Dao is easy to grasp yet difficult to practice. On the fifteenth day of the lunar month, face the moon and recite: *\"Moon Lord, Radiant Child, unite your power with mine, nourishing the child within my Cinnabar Field.\"* Close your eyes and envision the moon’s white and yellow essence descending before you, entering your mouth, and swallowing it twenty-one times. Guide it with your hands down to the Cinnabar Field. Within the Cinnabar Field, the qi is pure crimson, and within it resides a figure nine fen tall—a young child clad in vermilion robes. Thus, the Cinnabar Field is crimson within and black without, with azure on the left, yellow on the right, and white above—all five qi now complete. Absorb the moon’s essence into your kidneys, and you shall master ascent and descent.\n\nThe crimson within the Cinnabar Field is the essence of the Great Yang, the fire of the heart. The black without is the essence of the Great Yin, the qi of the kidneys. The azure on the left is the essence of the Lesser Yang, the qi of the liver. The yellow on the right is the essence of the Central Harmony, the qi of the spleen. The white above, like a silver plate covering it, is the essence of the Lesser Yin, the qi of the lungs. The five figures within are the heirs of the Five Viscera, the spirits of the Five Phases. Only when the Cinnabar Field is perfected does one become a Perfected.\n\nThus, benevolence arises from the essence of the liver. Propriety and bearing arise from the essence of the heart. Righteousness and wisdom arise from the essence of the lungs. Harmony and joy arise from the essence of the kidneys. Loyalty, trust, sincerity, and thickness arise from the essence of the spleen. Eloquence and courage arise from the essence of the gallbladder. Gentleness and calm arise from the flourishing qi of the gallbladder. Blindness arises from the declining qi of the liver. Cowardice arises from the declining qi of the lungs. Madness arises from the declining qi of the heart. Weakness arises from the declining qi of the kidneys. Ignorance and deafness arise from the declining qi of the spleen. The decline of the Five Viscera manifests in oneself.\n\nGrief and sorrow injure the liver; when the liver is injured, the eyes dim and the head whitens—nourish it with the heart and kidneys. Excessive indulgence injures the kidneys; when the kidneys are injured, the waist aches, the body grows heavy, and urine and stool contain pus and blood—nourish it with the liver and lungs. Anger injures the heart; when the heart is injured, one suffers from stiffness and vomiting blood—nourish it with the liver and spleen. Misfortune and hardship injure the lungs; when the lungs are injured, nourish them with the spleen and kidneys. Overeating and excessive drunkenness injure the spleen; when the spleen is injured, nourish it with the heart and lungs. Let the mother and child organs nourish one another, and illness will be cured and ailments dispelled. Seekers of immortality must avoid injuring the Five Viscera—scholars, take heed and reflect.\n\n**Thirty-Sixth Transcendent**\nIngesting the essence of the Great Ultimate grants long life. On the six *wu* days, at the hour corresponding to the celestial stem (or \"spirit\"), the Daoist, dressed in ritual attire within the chamber, faces north and bows twice, saying: *\"August Heaven, Supreme Lord, and Most High Dao Lord, your humble descendant, Wang Jia, loves the Dao and wishes for long life.\"* Before sleeping at night, visualize the essence of the great bright star at the center of the Northern Dipper and the Great Ultimate—pure yellow and black—descending before you, entering your mouth, and swallowing it fifteen times.\n\nThe yellow essence fills the Great Granary of the Yellow Court, descending into the Cinnabar Field. Then visualize within the Crimson Palace a vermilion person; in the Purple Chamber Palace, five figures—among them the Supreme Unity Lord, with Laozi and the immortal Zhongchengzi to the left, Taihe and Quwenzhi to the right. In the Hall of Light resides the Dark Radiance Jade Maiden, with the Yellow-Robed Youth to her left and the Central Yellow Perfected to her right, all guarding the Perfected Youth Zidan. Next, visualize the Three Dukes of the Jade Hall and invoke: *\"Six Ding Jade Maidens of the Records Office, erase my name from the register of death and grant me long life.\"* When the black essence stabilizes, again visualize the Perfected Youth Zidan within the stomach duct and pray: *\"Dark Radiance Jade Maiden, nourish my Perfected Youth Zidan. Consume the primordial black essence, drink the sweet spring of the Liquor Spring.\"* With the Northern Dipper’s pole star supporting the spleen, the spleen receives the essence of the Dipper’s pole and becomes a Perfected.\n\n**Thirty-Seventh Transcendent**\nThe lungs are the Minister of Works, the liver the Terrace of Orchids, the heart the Grand Commandant, the left kidney the Minister of Education, the right kidney the Minister of Public Works, the spleen the Empress, Noblewoman, and Lady, the gallbladder the Son of Heaven and Great Dao Lord, the stomach the Great Granary—the palace of the Crown Prince, my dwelling. The large and small intestines are the Envoys of the Primordial Beam, the lower primordial qi the Grand Herald, the middle primordial qi the Eighty-One Primordial Scholars, and the upper primordial black essence the High Chariot Envoys, who communicate with the Supreme Sovereign. Thus, the lungs are the Jade Hall Palace, the heart the Crimson Palace and Vermilion Bird Gate, the kidneys the Northern Pole’s Dark Gate and Dark Warrior Side Gate, the spleen the Hall of Light and the Chamberlain’s Pavilion. The stomach is the Upper Sea, where the sun and moon reside. The navel is the Lower Sea, where the sun and moon ascend and descend to the stomach. Therefore, the Great Beginning is the origin of primordial black essence—the Dao, the One. Above the heart is Heaven. The Great Commencement is the origin of the myriad things—mountains and rivers, Earth, the kidneys. The Great Simplicity is the origin of humans—essence, the spleen, Earth. Above, there are also three palaces: the eyes are the Crimson Palace, the ears the Jade Hall Palace, the nose and mouth the Hall of Light. The space between the eyebrows is the Suburban Mountain; by harmonizing the Three Primordials to nurture the Perfected Youth, one’s vision becomes clear and penetrating. Lord Lao said: *\"Though the myriad Dao are numerous, simply preserve the thought of the Youth Zidan.\"* The One is the Dao. That which resides in the Purple Chamber Palace is the gallbladder. The Youth Zidan is the self. The self is the true body. Here the Dao is complete.\n\n**Thirty-Eighth Transcendent**\nWhen Daoists refine mercury to dissolve sands, liquids, pearls, jades, and the Eight Stones into divine elixirs, consuming a single *daogui* allows one to ascend to the celestial palaces. By constantly absorbing qi, one attains long life as a divine immortal. Cultivating spirit and consuming the elixir makes one a Perfected. The Perfected who attain the Dao assist the Supreme Sovereign in governance. Thus, the Perfected, with water and earth, vast and boundless, like the heavens and earth—profound and obscure—know not where they abide, yet after eighteen thousand years, they form Heaven, Earth, and humanity. Therefore, the Perfected use earth to create humans, breathing, eating, riding, and commanding, so that earth does not exist alone, nor humans remain solitary. Thus, it is said that yellow earth is humanity’s origin. The Perfected depart, ascending to the Nine Heavens. The worldly, lacking the Dao, descend into the Yellow Springs. Add three *sheng* of earth—*zi* here means \"complete.\" Without bones or sinews—alternatively, \"ribs.\" Thus, the Nine Heavens’ Venerable One said: *\"Those who feed on Heaven repay Heaven with their bodies, ascending as Perfected, divine immortals at play. Those who feed on Earth repay Earth with their bodies, descending as corpses and ghosts. Those who feed on humans repay humans with their bodies, their bones and hair discarded and abandoned.\"* If you seek the Dao, do not eat flying birds, for they are born of Heaven; killing them repeatedly shortens your lifespan. Humans and livestock may consume them, serving as butchers for the six domestic animals. Avoid the Six Ding spirits—beastly creatures—do not eat them. Ding-mao is the rabbit, Ding-chou the ox, Ding-hai the pig, Ding-you the rooster, Ding-wei the sheep, and Ding-si the snake; these are strictly forbidden, as they are the taboos of the Six Ding spirits. When riding the black essence and ingesting the elixir to enter the chamber, do not eat living beings; abstain from the meat of the five livestock. The five livestock are horses, oxen, sheep, pigs, and dogs. Only consume chicken eggs and fish. Avoid the Five Pungent foods, foul-smelling or self-dead creatures; be cautious not to eat them. Even when ingesting the elixir, these are forbidden during the refinement period.\n\n**Thirty-Ninth Transcendent**\nThe Dao is the self, the Supreme Sovereign of the Uppermost Central Pole. At sunrise, noon, dusk, and midnight—alternatively, at *shen* and *you*—constantly visualize the great yellow star at the center of the Great Ultimate. Its essence descends to rest between your eyebrows, radiant in vermilion, yellow, and white like the sun. With intention, guide it into your mouth and swallow it, allowing its qi to descend into the Crimson Palace, Purple Chamber, and Yellow Court. Swallow it fifteen times and pray: *\"August Heaven, Supreme Lord, and Most High Dao Lord, your humble descendant, [your name], loves the Dao and wishes for long life.\"* This is my qi, from which I was born. Visualize it ten thousand times without ceasing, granting you long life, ascending as a Perfected. Cloud chariots descend to welcome you, flying to the celestial palaces to pay homage before the Supreme Elder of the Southern Pole and the Primordial Radiance. Lord Lao said: *\"The sage dissolves pearls, the worthy refines water-jade. Dissolving pearls and refining water-jade follow the same method.\"* Dissolving pearls means consuming the essence of the sun—your left eye is the sun. Refining water-jade means consuming the essence of the moon—your right eye is the moon. Lie supine with hair unbound, close your eyes, and constantly visualize the yellow essence and vermilion qi from both eyes descending into your mouth. Swallow it twenty-seven times.\n\n\"Granting one divine clarity, penetrating vision in all eight directions. Consume the essence of the lungs: constantly visualize the white qi within the lungs ascending to the throat, entering the mouth, and swallow it twenty-one times. This grants divine clarity, radiant complexion, repels evil, and attracts spirits. Jade maidens attend you, bestowing longevity and warding off all ghosts.\n\nConstantly visualize a youth in crimson robes within your body, dwelling in the heart’s center. The center is where divine clarity resides. At times, visualize a purple canopy within the heart, beneath which stands a figure wearing a red headdress and crimson robes, holding an arrow and drawing a bow, fierce and wrathful—this repels weapons and commands ghosts and spirits.\n\nThe Fortieth Perfected Immortal:\nConstantly envision purple clouds emerging from the crown of the head like a chariot canopy, resembling fiery qi with five-colored patterns, ascending to connect with heaven. With focused intention, guide them to descend in unison with the heavens. Visualize the yellow qi within the stomach like a tangerine, suddenly growing and expanding until the body’s form resembles the sun. Envision the red and yellow persons of primordial qi beneath the eyes, the Dao-qi circulating through the four limbs, ascending high into the sun (or ascending a terrace). Rise to the Crimson Palace, the Purple Chamber, and the Great One.\n\nRecite the incantation:\"\n\nThe Great One of the Northern Culmen, reverently addressing all gods, constantly ensures the hun and po remain peaceful, never departing from so-and-so’s body. This is called the formless natural state.\n\nThe Forty-First Perfected Immortal:\nTwelve ghost-arrows can repel weapons. Constantly envision twelve stalks of lingzhi within the heart, ascending to connect with the lungs. With focused intention, embrace them—this is called the ghost-arrow. Practitioners who regularly perform this will naturally repel the five weapons, and evil will vanish of itself. Use them to strike the four barbarians, casting away false lightning. Simply inquire of weapon-warding talismans, blades, halberds, gold, and silver—heavenly gods will all aid the true. The Thunder Duke drums, Venus radiates light, the White Emperor draws his crossbow, Chiyou repels weapons, the Azure Dragon guards the gate, the Martial Yi stand in the courtyard, the Victorious Serpent and Dark Warrior dispel misfortune, the White Rabbit pounds medicine, the Toad lingers nearby, the Great One harmonizes the elixir, and Pengzu was ever the first. Consume a knife-tip’s measure, and the face and eyes will radiate light. The body sprouts feathers and plumage, ascending to pay homage to the Supreme Sovereign. This Dao causes all spirit-qi to unite with you—be diligent and do not slacken.\n\nThe Forty-Second Perfected Immortal:\nOn Gengshen days during the shen hour, loosen the hair, lie supine with the head toward the southwest, stretch the body, close the eyes, and envision the lungs as pure white, moist and luminous, containing a stalk of lingzhi as thick as a little finger, hollow and bright within, descending to connect with the heart. Within it, green and red qi ascend and descend, flowing between heart and lungs. Sustain this visualization until the evening hour. The lungs are humanity’s heaven; the heart is humanity’s sun. The sun’s qi ascends like the essence of cinnabar, never ceasing—humans must obtain this qi to live. Losing this qi means death. This is called the Dao of spontaneity. The Dao communicates with the divine.\n\nThe Forty-Third Perfected Immortal:\nConstantly envision the heart’s red qi like the sun, inwardly green and outwardly black, the three combining into virtue to accord with the Dao’s numerology. The master says: At dawn, constantly envision the heart’s true redness like the sun. Within the sun is a person wearing a grand crown and red silk robes. When the practitioner sees this, call out: “Celestial Sovereign Great One, make so-and-so long-lived as a Perfected Immortal.”\n\nThe Forty-Fourth Perfected Immortal:\nThe method of returning essence to the Crimson Palace: On the first, fifteenth, and last days of the month, at sunrise, loosen the hair, bind the head, lie facing the sun, and rub between the breasts with both hands, descending to the heart—repeat nine times and stop. Press the heart and say: “Divine head, divine return to the Crimson Palace, never leave this body.” The spirit will be at peace, dwelling in stillness and speaking with you. Do this thrice and cease. The master says: Rubbing between the breasts allows qi to ascend and descend freely. Rubbing the heart while visualizing a youth—this is called emptiness and non-being. Returning essence to the Crimson Palace is performed on the third day of the month—this is the Dao of spirit immortals.\n\nThe Forty-Fifth Perfected Immortal:\nThe Primordial Yang Red Person is the Great One. The Primordial Yang Dao Lord is the Central Great One. The Primordial Yang Vermilion Child is one’s own body. The Primordial Yang Mysterious Radiance Jade Maiden is the mother of the Dao. The Primordial Yang Sovereign Person is the King of the Great One. The Primordial Yang Cinnabar Field is the palace that stores essence. The master says: *Yuan* means qi; *yang* means the sun. Envision the heart containing a sun, and within the sun a red person wearing a grand crimson crown and red silk robes. Next, envision the gallbladder containing the bright star of Venus, its threefold radiance illuminating all. Above the star is a person wearing crimson robes and a nine-virtue crown. The Dao Lord stands at the center, with Laozi and Zhongchengzi to the left, Taihe and Quwenzhi to the right—five in all, yet one. Next, envision the spleen’s true yellow, containing a sun with three persons: the Dao Mother Mysterious Radiance Jade Maiden at the center, Yellow Robe Child to the left, and Central Yellow Upright to the right. Next, envision the stomach duct containing the Perfected Vermilion Child seated upon a pearl-and-jade lung, with golden qi forming a canopy and jade maidens and youths attending. Next, envision the Great One within the navel, wearing five-colored crimson robes and a three-crimson crown, with a green person to the left, a white person to the right, a red person in front, and a black person behind. Next, envision the Cinnabar Field containing red qi, and within the red qi three persons: a red person at the center, a green person to the left, and a yellow person to the right, the red qi encircling them, inwardly green and outwardly black, white above and yellow within. After completing this visualization, external apparitions may appear, and spirit-qi will come to speak with you.\n\nThe Forty-Sixth Perfected Immortal:\nConstantly envision yellow qi within the spleen ascending to the mouth, swallow it three to five times and cease—this will satiate. It can dispel grains, allowing one to sit in disappearance and stand in vanishing. The master says: Constantly envision the spleen containing a sun, and within the sun a golden coffer sealed with a yellow jade seal three inches wide, inscribed with the characters *Wei Xi*. Focus intently, and evil will depart of itself. If the practitioner can see and read it, the heart will open and the eyes brighten, instantly becoming a spirit immortal.\n\nThe Forty-Seventh Perfected Immortal:\nConstantly envision the stomach’s true white like congealed fat, containing yellow qi filling the Great Granary, ascending to the mouth—swallowing it brings satiety. The master says: The stomach is the Great Granary. All gods come to the Great Granary to eat and drink. Within it is a golden cauldron, golden rice, and jade maidens and youths who serve—thus it is called Yellow Robe Child, summoning the traveling kitchen.\n\nThe Forty-Eighth Perfected Immortal:\nThe kidneys are the root of primordial qi. Constantly envision white qi between the kidneys ascending to the head, descending to the soles of the feet and the tips of the ten toes, circulating throughout the body twelve times before ceasing. When hands and feet grow warm, one can be free from hunger, thirst, and cold, remain ageless, and white hair turn black again.\n\nThe adept should constantly practice this.\n\nThe Forty-Ninth Perfected Immortal:\nOn the new and full moons, envision white qi between the kidneys ascending to the crown of the head and descending to the soles of the feet. The divine tortoise’s five-colored shell bears patterns like intertwined cords. Above it sits the Jade Maiden of Mystic Radiance, with two elders facing each other. Before them stands the Great One, and behind them, the Dark Obscurity, the Registrar, and the Lord of Destiny, who together deliberate over the life and death of humans. Focus the essence of this vision for thirty breaths before ceasing.\n\nRecite: \"Lord Registrar, Lord of Destiny, Six Ding Jade Maidens—erase my name from the register of death and inscribe it in the record of life. This is what is meant by longevity.\" The divine tortoise breathes, exhaling the old and inhaling the new, acting as it pleases. The spirit of the white tortoise spreads primordial qi, warming the four limbs. Humans must obtain kidney qi, for only through the divine tortoise’s breath does life arise. Practice this on *jiǎzǐ* and *rénzǐ* days, and you will attain longevity.\n\nThe Fiftieth Perfected Immortal:\nOn *jiǎwǔ* days at noon, let your hair down, lie facing south with eyes closed, and visualize within the cinnabar field three inches below the navel a yellow qi, its core a true red the size of a palm, surrounded by black, and beyond that, green. Above the navel, white qi covers it—this is the qi of the lungs. To the left is green qi, to the right yellow qi, each the size of a palm. These three are the qi of the liver, spleen, and lungs.\n\nThe master says: The red within the cinnabar field is the qi of Greater Yang. The black surrounding it is the qi of Greater Yin. The green beyond is the qi of Lesser Yang. When the Three Powers unite in virtue and the Three Qi guard them, one attains longevity.\n\nThe Fifty-First Perfected Immortal:\nThe heart is emptiness; the kidneys are the root. The qi of emptiness ascends, clear, to become heaven; the qi of the root descends, tranquil, to become earth, entering the Great Abyss. Thus, the qi of emptiness generates exhalation, and the qi of the root generates inhalation. The heart is the sun; the kidneys are the moon; the spleen is the Dipper. When the qi of the heart descends and the qi of the kidneys ascends, they unite as one, spreading through the four limbs without cease. Thus, the heart governs blood, the kidneys govern qi, and their union creates circulation—this is called the vessels. The vessels are the dwelling of the hun and po souls, the countenance of humans. When the hun and po depart, the master becomes still. When all vessels are exhausted, qi ceases, and with its cessation, death follows.\n\nTherefore, those who pursue the Dao must not fail to preserve their spirit, nourish their root, and augment their qi. Adept, strive with all your might, for I shall soon depart. When a Perfected One attains the Dao, they meet once every eighteen thousand years. When a Daoist attains the Dao, they meet once every thousand years. Thus, I compose *The Central Scripture* to bequeath to later generations. Originally hidden in the Golden Casket of the Supreme Sovereign, when a Daoist obtains it, it is worth a thousand gold pieces—do not transmit it lightly.\n\nThe Fifty-Second Perfected Immortal:\nThe Three Origins converge on *jǐhài* days. The Three Origins are the Great One, Greater Yin, and Palace Qi. All three arise on *jǐhài*. The Great One moves left, advancing one celestial stem per year. Harmful qi moves right, passing through the four first months of the seasons, one per year. Greater Yin moves right, advancing one celestial stem every three years, completing a cycle in nine years, and a full revolution in thirty-six years. When the Three Origins converge on *hài*, floods, droughts, warfare, and famine arise, and disasters strike together.\n\nIn years when the Three Origins converge, yin and yang are blocked and disordered, shaking heaven and earth. Harmful qi spreads—when it moves by day, it damages crops; when it strikes people, epidemics arise; when it strikes grain, famine and scarcity follow. If you dwell in such times, you cannot survive on your own. How can you not strive with all your might to study the Dao in due time?\n\nIn this destined age, floods, droughts, locusts, and crop failures will bring famine and scarcity. Warfare will erupt, people will suffer epidemics, roads will be impassable, and the old and young will scatter, fleeing to other lands. When the calamity strikes, parents, wives, children, and siblings will be torn apart, their livers shattered and bowels severed. Some will be reduced to slavery, not knowing their own county or village. If you only seek to study the Dao then, is it not too late? Is it not too late?\n\nI deeply warn you: preserve your spirit and refine the elixir. Prepare early, and when chaos comes, flee far and hide deeply. In the age of a sagely and enlightened ruler, the Dao may be practiced openly. Thus, the conjunctions of heaven and earth occur: a minor scarcity every forty-five years, a minor famine every ninety years, a great scarcity every one hundred eighty years, and a great famine every three hundred sixty years. Every five hundred years, the worthy gather in small numbers; every thousand years, sages gather in small numbers; every thirty-six hundred years, sages convene in great assembly. Every eighteen thousand years, a Perfected One emerges to govern briefly. Every thirty-six thousand years, a Supreme Immortal emerges to govern; every three million six hundred thousand years, heaven and earth undergo a great conjunction.\n\nPrimordial qi surges like a flood, and the Great Beginning takes form. Humans become one of the myriad things, unaware of east, west, south, or north. Humans transform into birds and beasts, and birds and beasts transform into humans. Perfected Ones dwell above primordial qi, while Immortals reside at the edge of the boundless. Daoists who retreat into seclusion may yet attain honor and esteem.\n\nThe Fifty-Third Perfected Immortal:\nThe Heavenly Capital of the Capital Prefecture lies at the left tip of the Curved Array, named Lord An De. He, together with the Northern Lord of the Great One of Heaven, calculates and discusses the affairs of all spirits, governing the hun and po souls, which assemble at the Southern Culmen. Those whose names are recorded in the registers have their lives extended, and all spirits support them. Those whose names are not recorded meet their end—the Lord of Destiny severs their fate, and their hun and po souls assemble at the Northern Culmen.\n\nThose who have performed meritorious deeds for humans, heaven, earth, and the myriad things will see their descendants prosper, live long, and enjoy clarity and brilliance. Their bodies may be enfeoffed as marquises, and they may be reborn as humans. Those lacking virtue fall into three categories:\nFirst, those who are cruel, oppressive, and tyrannical, harming heaven, earth, and the four seasons;\nSecond, those who curse, envy, indulge in licentiousness, and show contempt for heaven, earth, and the gods;\nThird, those who are unfilial, disloyal, thieving, treacherous, or who bury and kill others.\n\nThose who commit these three transgressions will see their descendants cut off. Humans are born with three destinies, and when they marry or give their daughters in marriage, one more destiny is determined.\n\nWhen relocating graves or conducting burials, another destiny is determined. Those who secure an auspicious site will live long, and their descendants will prosper. Those who secure an inauspicious site will die, and their descendants will suffer poverty and hardship.\n\nHow, then, do you stand before heaven and earth in this world? The gods are to be feared. Thus, heaven has set the sun and moon, the Northern Dipper, the twenty-eight constellations, and the five planets to govern, while the Six Jia and Six Ding spirits, along with all other deities, oversee the affairs of the people. If you remain ignorant of this, you should indeed fear them.\n\nMoreover, malevolent ghosts, spectral beings, ancestral spirits, inauspicious village deities, the earth and water spirits who control life, the gatekeepers of households, well spirits, the pure and profound, the Taiyin waterways—all these can kill. If you wish to repel evil and ward off ghosts, you must wear talismans and then ingest divine medicines. Talismans are the pledges of heaven and earth. Medicines are the cinnabar of humans, strengthening qi and vitality, lightening the body, and fortifying it. Then, evil qi and spectral beings cannot harm you, and you will become an immortal.\n\nGhosts are the messengers of the gods. When they see the pledge of heaven, they depart. Humans also possess this—within the dwellings of the capital’s outskirts, in the wandering hamlet of Youji, there is the Summer Official, the Yellow Elder, styled Dehuang, residing at the center of the navel. This is the Great One, also called the Jade Spirit Child, clad in five-colored vermilion robes, overseeing the Yellow Gods. On the day of the autumn equinox, he conducts his review and reckoning.\n\nFor three days—one day before, the day of, and one day after the equinox—you must remain secluded indoors. At cock’s crow, contemplate him, and from dawn until midday, invoke him thrice daily for three days, totaling nine invocations. Lie with your hair unbound, facing northwest, body relaxed, ensuring no one sees you. Instruct your household to remain silent. First, purify yourself through fasting and bathing. On the appointed day, enter a quiet chamber, calm your mind, and settle your spirit. Begin with this prayer:\n\n*\"Great-grandson, humble initiate [your name], devoted to the Dao, wishes for longevity. On this autumn equinox, may the Heavenly Emperor’s messenger, the Summer Official Yellow Elder, descend into my body to conduct his review and reckoning. May all spirits assemble without fail.\"*\n\nInvoke him thrice from above, repeating this three times daily for three days, ceasing at midday. Then declare:\n\n*\"Recorder of the Six Ding Jade Maidens, erase my name from the register of death and inscribe it in the jade records of long-life immortals. Hasten, as decreed by the statutes!\"*\n\nOn that day, the Heavenly Emperor’s Boundless Lord will respond: *\"So be it.\"* Bow twice toward the grove, prostrating in gratitude to the celestial gods. Thus, the Dao is fulfilled within you.\n\n---\n\n**Fifty-Fourth: Immortals**\nIf you wish to know the types of perfected ones and immortals: Immortals wear feathered robes and grow plumage, while perfected ones cast no shadow and don their five-colored vermilion garments. Their dwellings are not fixed—they roam east in spring, south in summer, west in autumn, and north in winter, drifting above famous mountains like Kunlun, Penglai, and Dayi, or the Nine Regions, occasionally ascending to pay homage to the Supreme August One.\n\nThus, perfected ones who attain the Dao live for eighty million years. They ride chariots of pearl, jade, and cloud qi, drawn by boundless horses, sometimes harnessing six flying dragons to assist the Supreme August One in governance. Middle immortals ascend to the middle heavens, traveling on clouds across seas and rivers. Lesser immortals undergo liberation through simulated death; on dark moons, they gather for rites and must not slacken, for they serve as divine messengers.\n\nThe Dao is not inherently different—only the rank of their conveyances sets them apart. Thus, those who live a hundred years develop yellow hair; at three hundred, their temples rise; at four hundred, their faces show vertical lines; at five hundred, their pupils become square; at six hundred, their ribs thicken; at seven hundred, their bones fill out; at eight hundred, their sinews transform; at nine hundred, their ears elongate; and at a thousand, they ascend to heaven to pay homage to the Supreme August One and the Great One as immortals. Perfected ones have double pupils, enabling them to see clearly in all eight directions. Consuming mushrooms and elixirs prevents aging. After eighteen thousand years, humans revert to childhood—males at eight, females at seven—beginning anew.\n\n---\n\n**Fifty-Fifth: Immortals**\nTo subdue the hundred evils, the hundred ghosts, and ancient spectral beings, always carry talismans, a sharp sword, and a jar of water. Observe their reflections within. In all your comings and goings, if you suddenly encounter strange apparitions, examine their forms in the light of the sun or moon to discern them.\n\nUse cinnabar to inscribe talismans for subduing the hundred evils, placing them upon the water’s surface. When evil ghosts see them, they will naturally dissipate. All manner of spectral beings—dragons, snakes, tigers, leopards, the six livestock, foxes, fish, perch, turtles, flying birds, elk, deer, and ancient trees—can become spirits. If they harm humans, inscribe talismans to sever them and consign them to the River Earl and the Village Deity. Summon the current day’s talisman-bearing messenger, guarded by the Six Ding spirits for protection.\n\nThe left script resides within the *Eighty-One Mysterious Diagrams of the Six Jia Palaces and the Forty-Nine Perfected Ones*. There are also the *Seven Mechanisms of the Pearl Womb*, the *Canopy of Floral Brilliance*, and the *Pure Contemplation*—all capable of subduing the hundred evils. These four talismans must not be worn by the impure.\n\nInstead, wear the *Majestic Joy*, *Giant Victory*, *Left Contract*, *Right Archer*, *Great Ultimate*, *Great Clarity*, *Great Mystery*, *Yang Chapter*, *Participating in Heaven*, *Enveloping Primordial Qi*, and *Great Void*—these are the supreme Dao. Wear them always, and nothing will be beyond defense, nor will there be any prohibitions.\n\nThe upper inscription reads:\n*\"August Heavenly Emperor, Supreme Dao Lord, great-grandson humble initiate Wang [your name], devoted to the Dao, wishes for longevity. May all desires arise from the heart, residing naturally within, without excess words.\"*\n\nThe sealed inscription reads:\n*\"August Heavenly Emperor, Supreme Dao Lord, Heavenly One, Great One, Northern Thousand Lords, Sun and Moon Yin-Yang Lords, Life Controller Lord, Record Keeper Lord, great-grandson humble initiate Wang [your name], devoted to the Dao, wishes for longevity. Only the Life Controller and Record Keeper Lords can erase the register of death and inscribe the jade records of long-life immortals, designating me as a perfected one. Hasten, as decreed by the statutes!\"*\n\nYour humble servant [your name] is hereby appointed as the Messenger of the Great One. Bowing twice, I receive the mandate from the Supreme August Dao Lord and the Yellow Court Youth. Bowing twice again, I inscribe the covenant, seal the talisman, and transmit it.\n\nFirst, purify yourself and dissolve past transgressions. Regularly, on the days of seasonal renewal and the eight solar terms, offer wine and dried meat upon the waters of an eastward-flowing stream to dissolve transgressions—southward-flowing waters are also acceptable.\n\nThe *Mysterious Charts of Divine Immortals* states: The fifty-five chapters of the Jade Register, along with the name-tally and authenticating tokens, are stored within the Golden Coffer, Jade Pedestal, and Jade Bamboo Case of the Supreme August One. The sealing power is weighty. Should you obtain these, guard them carefully and do not transmit them recklessly. Be cautious, my disciple, and do not accept payment for them. Transmit them only to the worthy, and you may attain divine immortality.\n\nI frequently examine these two scrolls of the *Central Scripture* myself. I have commanded the Life Controller to dispatch spirits to guard you. Do not recklessly alter or conceal my texts. Should even a single character be missing, I will know. Be vigilant, my disciple, be vigilant.\n\nFollow my words precisely when inscribing talismans and characters, using cinnabar and ink—this is my authenticating mark. If you truly desire divine immortality, first ingest the Returned Elixir and Golden Fluid, cultivate spirit, and you will immediately ascend as an immortal, becoming a perfected one.\n\nIf you do not ingest the divine elixir and golden fluid, you will suffer hardship, struck by cold, heat, and malevolent winds, and the Life Controller will not save you. The Dao spirits will be powerless to aid you. If you practice the Dao, wear warm clothing, eat suitably, abide in emptiness, and follow nature, even ghosts will be unable to harm you. Yet if your years reach their end, you will die naturally.\n\nWhy is this so? Because you have not steadfastly guarded the spirit. It is like the growth of the myriad things—they do not seek death, yet naturally wither, decay, and perish. You are no different.\n\nI offer this analogy: seek a master with the urgency of a crossbow’s tension. Of my eighty-one disciples, all became immortals; ten now wander among the people as reclusive valley immortals. I did not emerge to deliver Qin or Xiang, but appeared for the Han, aligning with the Yellow Epoch. This is my great fortune.\n\nHere ends the lower scroll of the *Central Scripture* of the Supreme Venerable Lord.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上老君中经 经名：太上老君中经。 又名《珠宫玉历》。 撰人不详。 约出朴魏晋。 据称老子传《道德经》上下篇，而此经为中篇。 原本一卷，徒分为二卷。 底本出处：《正统道藏》太清部。 参校本：《云笈七签》卷十七至十八。 太上老君中经卷上 第－神仙 上上太一者，道之父也，天地之先也，乃在九天之上，太清之中，八冥之外，细微之内。 吾不知其名也，元黑是耳。 其神人头乌身，状如雄鸡，凤凰五色，珠衣玄黄。 正在兆头上，去兆身九尺，常在紫云之中，华盖之下住。 兆见之，言曰：上上太一道君，曾孙小兆王甲洁志好道，愿得长生。 第二神仙 无极太上元君者，道君也，一身九头，或化为九人，皆衣五色珠衣，冠九德之冠，上上太一之子也。 非其子也，元黑自然耳。 正在兆头上紫云之中，华盖之下住。 兆见之，言曰：皇天上帝，太上道君，曾孙小兆王甲好道，愿得长生。 养我育我，保我护我，毒虫猛兽，见我皆垫伏，令某所为之成，所求之得。 太清乡，虚无里，姓朱愚，名光，字帝卿，乃在太微勾陈之内一星是也，号曰天皇大帝耀魄宝。 兆常念之，勿忘也。 人亦有之，常存之眉问，通於泥丸，黑上与天连。 第三神仙 东王父者，青阳之元黑也，万神之先也。 衣五色珠衣，冠三缝，一云三缝之冠。 上有太清云曜五色，治於东方，下在蓬莱山。 姓无为，字君鲜，一云君解。 人亦有之，在头上顶巅，左有王子乔，右有赤松子，治在．左目中，戏在头上。 其精气上为日，名曰伏羲。 太清乡，东明里。 西王母，字偃昌，在目为日月，左目为日，右目为月。 目中童子字英明，王父在左目，王母在右目，童子在中央，两目等也。 兆欲修真，当念东王父、西王母正在头上，有三人并立，乃合日月精光，下念紫房、太一、绛宫、黄庭、太渊、丹田，行其真气五周，施于腹中，复行气十二周，施于一身中。 道毕，即止朱雀阙门。 阙门，两乳是也。 左乳日君阿，右乳日聂仲。 当两乳下有玉阙，天狗、天鸡在其上，主晨夜呜吠。 第四神仙 西王母者，太阴之元气也，姓自然，字君思。 下治昆仑之山，金城九重，蕾买气五色，万丈之巅。 上治北斗，华盖紫房，北辰之下。 人亦有之，在人右目之中，姓太阴，名玄光，字偃玉。 人须得王父王母护之两目，乃能行步，瞻视聪明，别知好丑，下流诸神，如母念子，子亦念母也。 精气相得，万世长存。 ．夫人两乳者，万神之精气，阴阳之津洵也。 左乳下有日，右乳下有月，王父王母之宅也。 上治目中，戏於头上，止於乳下，宿於绛宫、紫房，此阴阳之气也。 第五神仙 道君者，一也，皇天上帝，中极北辰，中央星是也。 乃在九天之上，万丈之巅，太渊紫房宫中，衣五色之衣，冠九德之冠。 上有太清元气，云曜五色，华盖九重之下。 老子、太和侍之友右。 姓制皇氏，名上皇德，字汉昌。 人亦有之，在紫房宫中，华盖之下，元贵乡，平乐里，姓陵阳，字子明，身黄色，长九分，衣五色珠衣，冠九德之冠。 思之长三寸，正在紫房宫中，华盖之下。 其妻太阴玄光玉女，衣玄黄五色珠衣，长九分，思之亦长三寸，在太素宫中，养真人子丹。 稍稍盛大，自与己身等也。 子能存之，与之语言，即呼子上谒道君。",
      "translated_text": "**The Central Scripture of the Most High Lord Lao**\n\n**Scripture Title:** *The Central Scripture of the Most High Lord Lao*. Also known as *The Jade Chronicle of the Pearl Palace*. Author unknown. Likely composed during the Wei or Jin dynasties. It is said that Lord Lao transmitted the *Scripture of Dao and Virtue* in its upper and lower chapters, while this scripture serves as the middle chapter. Originally a single scroll, it was later divided into two. Base text from *The Orthodox Daoist Canon*, Taiqing Section. Collated with *The Seven Bamboo Tablets of the Cloudy Satchel*, fascicles 17–18.\n\n---\n\n### **The Central Scripture of the Most High Lord Lao, Volume One**\n\n#### **First Immortal**\nThe Supreme Great One is the father of the Dao, preceding heaven and earth. He resides above the Nine Heavens, within the Great Clarity, beyond the Eight Darknesses, and within the subtlest of realms. I know not his name—he is simply the Primordial Black. His divine form has the head of a crow and the body of a man, resembling a rooster adorned with the five colors of the phoenix. He wears a pearl robe of dark yellow. He dwells precisely above the crown of the adept’s head, nine feet from the body, ever within purple clouds beneath a canopy of blossoming radiance. When the adept beholds him, he speaks: *\"Supreme Great One, Lord of the Dao, your distant descendant, the humble adept Wang Jia, cultivates the Dao with pure devotion. I wish to attain longevity.\"*\n\n#### **Second Immortal**\nThe Boundless Supreme Primordial Lord is the Lord of the Dao. His single body has nine heads, or he transforms into nine persons, each clad in a five-colored pearl robe and crowned with a Nine-Virtue coronet. He is the son of the Supreme Great One—yet not truly his son, for he is the spontaneous Primordial Black. He dwells above the adept’s head within purple clouds beneath the blossoming canopy. When the adept beholds him, he speaks: *\"August Heavenly Thearch, Supreme Lord of the Dao, your distant descendant, the humble adept Wang Jia, cultivates the Dao and wishes for longevity. Nurture me, rear me, protect me, shield me. May venomous creatures and fierce beasts prostrate before me, ensuring all I undertake succeeds and all I seek is attained.\"*\n\nIn the land of Great Clarity, within the village of Emptiness, there is one named Zhu Yu, styled Guang, called Imperial Minister. He is the star within the Purple Tenuity and the Curved Array of the Supreme Subtlety, known as the Heavenly Thearch Radiant-Soul Treasure. The adept should constantly contemplate him, never forgetting. Humans also possess him, residing between the brows, connecting to the Mud-Pellet Palace, its blackness ascending to join with heaven.\n\n#### **Third Immortal**\nThe Eastern King Father is the Primordial Black of the Azure Yang, the progenitor of the ten thousand spirits. He wears a five-colored pearl robe and a three-seam coronet—some say a coronet of three seams. Above him, the Great Clarity’s clouds shine in five colors. He governs the eastern direction and dwells below on Mount Penglai. His surname is Non-Action, his style is Lord Fresh—some say Lord Liberation. Humans also possess him, residing at the crown of the head. To his left is Wang Ziqiao, to his right is Red Pine Master. He governs within the left eye and plays upon the head. His essence and qi ascend to become the sun, named Fuxi.\n\nIn the land of Great Clarity, within the village of Eastern Brightness.\n\nThe Western Queen Mother, styled Yanchang, manifests in the eyes as the sun and moon. The left eye is the sun, the right eye the moon. Within the eyes, the youth is named Yingming. The King Father resides in the left eye, the Queen Mother in the right, and the youth in the center—both eyes are equal. When the adept seeks to cultivate perfection, they must contemplate the Eastern King Father and Western Queen Mother standing together upon the head, uniting the essence and radiance of the sun and moon. Then, descending, they contemplate the Purple Chamber, the Great One, the Crimson Palace, the Yellow Court, the Great Abyss, and the Cinnabar Field. Circulating true qi five cycles through the abdomen, then twelve cycles throughout the body. When the Dao is complete, halt at the Vermilion Bird Gate. The Gate is the two breasts. The left breast is named Lord A, the right breast is named Nie Zhong. Below the breasts lies the Jade Gate, where the Heavenly Dog and Heavenly Rooster reside, governing the crowing and barking of dawn and night.\n\n#### **Fourth Immortal**\nThe Western Queen Mother is the primordial qi of the Great Yin. Her surname is Spontaneity, her style is Lord Thought. Below, she governs Mount Kunlun, its ninefold golden walls enveloped in five-colored auspicious qi, towering ten thousand *zhang* high. Above, she governs the Northern Dipper, beneath the canopy of the blossoming purple chamber and the Northern Asterism. Humans also possess her, residing within the right eye. Her surname is Great Yin, her name is Mysterious Radiance, her style is Yan Jade. Only when the King Father and Queen Mother guard the two eyes can one walk, see clearly, discern beauty and ugliness, and command the myriad spirits below. Like a mother cherishing her child, the child also cherishes the mother. When essence and qi harmonize, one endures for ten thousand generations.\n\nThe two breasts of a person are the essence and qi of the ten thousand spirits, the fluids of yin and yang. Below the left breast is the sun, below the right breast is the moon—the abodes of the King Father and Queen Mother. Above, they govern within the eyes, play upon the head, and rest below the breasts, lodging in the Crimson Palace and Purple Chamber. These are the qi of yin and yang.\n\n#### **Fifth Immortal**\nThe Lord of the Dao is the One, the August Heavenly Thearch, the Northern Asterism of the Central Ultimate, the central star. He resides above the Nine Heavens, upon a peak ten thousand *zhang* high, within the Purple Chamber of the Great Abyss. He wears a five-colored robe and a Nine-Virtue coronet. Above him, the primordial qi of the Great Clarity shines in five-colored clouds beneath a ninefold blossoming canopy. Lord Lao and the Great Harmony attend him to left and right. His surname is Regulating August, his name is Supreme August Virtue, his style is Han Chang.\n\nHumans also possess him, residing within the Purple Chamber beneath the blossoming canopy. In the land of Primordial Nobility, within the village of Peaceful Joy, his surname is Lingyang, his style is Ziming. His body is yellow, nine *fen* in length, clad in a five-colored pearl robe and a Nine-Virtue coronet. When contemplated, he is three *cun* tall, standing within the Purple Chamber beneath the blossoming canopy. His consort is the Great Yin Mysterious Radiance Jade Maiden, who wears a dark yellow five-colored pearl robe. She is nine *fen* in length, and when contemplated, she is also three *cun* tall. She resides in the Grand Simplicity Palace, nurturing the Perfected One’s cinnabar child. Gradually, it grows until it matches one’s own body. If one can visualize and converse with it, it will summon one to ascend and pay homage to the Lord of the Dao.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1250,
      "start_sentence": 0,
      "end_sentence": 60,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.67783522605896,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\太上老君中经珠宫玉历.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "道君者，一也。 乘云气珠玉之车，胶驾九极之马，时乘六龙以御天下。 子常思之，以八节之日及晦朔日，日暮夜半时祝曰： 天灵节荣，真人王甲愿得长生，太玄之一，守某甲身形，五藏君侯，愿长安宁。 第六神仙 老君者，天之魂也，自然之君也，常侍道君在左方。 故吾等九人九头君也，吾为上首，作王父，余人无所作也。 人亦有之，金楼乡，小庐里，姓皮，名子明，字蓝蓝，衣青衣，长九分，把芝草，持青幡，侍道君在左方，从仙人仲成子。 思之长三寸，常在己左方，正与己身等也。 其妻素女，衣黄衣，长九分，思之亦长三寸。 第七神仙 太和者，天之魄也，自然之君也，常侍道君在右方。 人亦有之，乌台乡，姓角里先生，字尉尉，衣白衣，长九分，持金剑，捧白磨，侍道君在右方，从仙人曲文子。 思之亦长三寸，起坐行止，常在己右。 其妻青腰玉女，衣青衣，长九分，思之亦长三寸。 第八神仙 泥丸君者，脑神也，乃生於脑，肾根心精之元也。 华盖乡，蓬莱里，南极老人泥丸．君也。 字元先，衣五色珠衣，长九分，正在兆头上脑中，出见於脑户目前。 思之长九分，亦长三寸。 兆见之，言曰：南极老人，使某甲长生，束西南北，入地上天，终不死坏、迷惑。 上某甲生籍，侍於道君，与天地无极。 第九神仙 南极者，一也，仙人之首出也，上上太一也，天之侯王太尉公也。 主诸灾变，国祚吉凶之期。 上为荧惑星，下治霍山。",
      "translated_text": "The Lord of the Dao is Unity. He rides a chariot of cloud-qi, pearls, and jade, drawn by nine horses of the Nine Ultimates, and at times harnesses six dragons to govern the world. You should constantly visualize Him, and on the eight solar terms, the last day of the lunar month, the first day of the new moon, at dusk, or at midnight, pray thus: \"O Radiant Numinous Node, Perfected One Wang Jia wishes for longevity. May the Great Mystery’s Unity guard my body and form, and may the lords and marquises of my five viscera enjoy eternal peace and tranquility.\"\n\nThe Sixth Immortal:\nThe Venerable Lord is the celestial hun-soul, the Lord of Spontaneity, who constantly attends the Lord of the Dao on the left. Thus, we nine are the Nine-Headed Lords, and I am the foremost, serving as the King Father, while the others hold no such office. Within humans, He resides in the Golden Mansion Village, Small Hut Hamlet, surnamed Pi, named Ziming, styled Lanlan. He wears a blue-green robe, stands nine *fen* tall, holds a mushroom of immortality, and bears a green banner, attending the Lord of the Dao on the left, accompanied by the immortal Zhong Chengzi. When visualized, He is three *cun* tall, ever present to one’s left, equal in stature to one’s own body. His consort is the Plain Maiden, who wears a yellow robe and stands nine *fen* tall. When visualized, she is also three *cun* tall.\n\nThe Seventh Immortal:\nThe Supreme Harmony is the celestial po-soul, the Lord of Spontaneity, who constantly attends the Lord of the Dao on the right. Within humans, He resides in Crow Terrace Village, surnamed Master Jiaoli, styled Weiwei. He wears a white robe, stands nine *fen* tall, wields a golden sword, and holds a white whetstone, attending the Lord of the Dao on the right, accompanied by the immortal Qu Wenzi. When visualized, He is also three *cun* tall, ever present to one’s right in rising, sitting, walking, or halting. His consort is the Jade Maiden of the Azure Waist, who wears a blue-green robe and stands nine *fen* tall. When visualized, she is also three *cun* tall.\n\nThe Eighth Immortal:\nThe Lord of the Mud-Pill Palace is the spirit of the brain, born within it, the root of kidney essence and heart essence. He dwells in Flowery Canopy Village, Penglai Hamlet, and is the South Pole Elder, the Lord of the Mud-Pill Palace. His style is Yuanxian. He wears a five-colored pearl robe and stands nine *fen* tall, residing within the brain atop one’s head, appearing before the brain’s gate in the field of vision. When visualized, He is nine *fen* tall, yet also three *cun*. Upon seeing Him, one should say: \"O South Pole Elder, grant me, so-and-so, longevity, that I may traverse east, west, south, and north, ascend to heaven and enter the earth, never to perish, decay, or lose my way. Inscribe my name in the register of the living, that I may attend the Lord of the Dao and endure as long as heaven and earth.\"\n\nThe Ninth Immortal:\nThe South Pole is Unity, the foremost of immortals, the Supreme Supreme Great One, the celestial Marquis-King and Grand Commandant. He governs all calamities and changes, determining the fortunes and misfortunes of nations. Above, He is the Star of Mars; below, He presides over Huo Mountain.",
      "overlap_context": "hin the Purple Chamber beneath the blossoming canopy. His consort is the Great Yin Mysterious Radiance Jade Maiden, who wears a dark yellow five-colored pearl robe. She is nine *fen* in length, and when contemplated, she is also three *cun* tall. She resides in the Grand Simplicity Palace, nurturing the Perfected One’s cinnabar child. Gradually, it grows until it matches one’s own body. If one can visualize and converse with it, it will summon one to ascend and pay homage to the Lord of the Dao.",
      "start_char": 1250,
      "end_char": 1821,
      "start_sentence": 61,
      "end_sentence": 86,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.498645782470703,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\太上老君中经珠宫玉历.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "人亦有之，在长昊乡，绛宫中元里，姓李，名尚，、一名常，字曾子。 衣绛衣，长九分，思之亦长三寸，在心中。 其妻，玉女也，衣白衣，长九分，思之亦长三寸。 常思心中有华盖，下有人，赤积大冠，绛章单衣，名日天侯，玉带紫绶，金印玄黄。 子能见之，彻视八方，千日登仙。 时候视脑中小童子，见之是也。 第十神仙 日月者，天之司徒、司空公也。 主司天子人君之罪过，使太白辰星下治华阴、恒山。 人亦有之，两肾是也。 左肾男，衣皂衣，右肾女，衣白衣，长九分，思之亦长三寸，为日月之精，虚无之黑，人之根也。 在目中，故人之目，左为司徒公，右为司空公。 两肾各有三人，凡有六人，左为司命，右为司录，左为司隶校尉，右为廷尉卿。 主记人罪过，上奏皇天上帝太上道君。 兆常存之，令削去死籍，着某长生。 属太初乡，玄冥里。 司录六丁玉女，字道明，皆在神龟上，乘紫云黑之车，胶驾双鲤鱼，字太成子。 玄母，道母也，在中央，身之师也。 主生养身中诸神，在五色云黑华盖之下，坐戴太白明星明月之珠，光曜照一身中。 常存以八节之夜，外祝曰： 司命司录，六丁玉女，削去某甲死籍，更着某甲长生玉历。 第十一神仙 中极黄老者，真人之府中斗君也，天之侯王，主皇后素女宫也。 人亦有之。 黄庭真人，道之父母也，赤子之所生也，已吾身也。 皇后者，太阴玄光玉女，道之母也，正在脾上中斗中也。 衣五色珠衣，黄云黑华盖之下坐，主哺养赤子。 常思两乳下有日月，日月中有黄精赤黑，来入绛宫，复来入黄庭紫房中。 黄精赤黑填满太仓中。 赤子当胃管中，正南面坐，饮食黄精赤气，即饱矣。 百病除去，万灾不干。 兆常思存之，上为真人。",
      "translated_text": "Within the human body, He resides in the Longhao precinct, in the central chamber of the Crimson Palace. His surname is Li, given name Shang, also named Chang, and courtesy name Zengzi. He wears crimson robes, nine *fen* in length; when visualized, He is also three *cun* tall, dwelling within the heart. His consort is a Jade Maiden, clad in white robes, nine *fen* in length; when visualized, She is also three *cun* tall. Constantly visualize within the heart a canopied parasol, beneath which stands a figure wearing a vermilion cap of piled silk, crimson ceremonial robes, and named the Celestial Marquis. He is girded with a jade belt and purple sash, bearing a gold seal with dark-yellow cords. Should one perceive Him, one’s vision will penetrate the eight directions, and after a thousand days, one will ascend as an immortal. At the proper time, visualize the youth within the brain—this is the sign of His presence.\n\nThe Tenth Immortal:\nThe Sun and Moon are the Celestial Minister of Education and Minister of Works. They oversee the transgressions of the Son of Heaven and the sovereigns of men, while the Great White Star and the Chronographic Star govern below at Huayin and Mount Heng. Within the human body, they correspond to the two kidneys. The left kidney is male, clad in black robes; the right kidney is female, clad in white robes, each nine *fen* in length; when visualized, they are also three *cun* tall. They are the essence of the Sun and Moon, the blackness of the Void and Nothingness, the root of man. They reside within the eyes, and thus the left eye is the Minister of Education, the right eye the Minister of Works. Each kidney harbors three persons, making six in total: on the left, the Controller of Destinies and the Commandant of Attendants; on the right, the Recorder and the Minister of Justice. They record human transgressions and memorialize the August Heavenly Thearch and the Supreme Lord of the Dao. Constantly preserve this visualization to expunge one’s name from the register of death and inscribe it in the ledger of longevity. They belong to the Taichu precinct, the Xuanming ward. The Recorder and the Six Ding Jade Maidens, whose courtesy name is Daoming, all reside upon the divine tortoise, riding a chariot of purple and black clouds, drawn by a pair of carp, and named Taichengzi. The Dark Mother, the Mother of the Dao, dwells at the center, the teacher of the body. She governs the nurturing of all spirits within the body, seated beneath a five-colored cloud-canopied parasol, wearing the luminous pearl of the Great White Star and the bright moon, whose radiance illuminates the entire body. Regularly visualize Her on the nights of the eight solar terms, and recite the following prayer:\n\n\"O Controllers of Destinies and Recorders, Six Ding Jade Maidens, expunge my name from the register of death and inscribe it anew in the jade ledger of longevity.\"\n\nThe Eleventh Immortal:\nThe Central Pole Yellow Elder is the Lord of the Dipper within the True Person’s palace, the celestial Marquis-King, who presides over the Palace of the Empress and the Plain Maiden. Within the human body, He is also present. The Yellow Court True Person is the father and mother of the Dao, the source of the Red Child, the very self of one’s being. The Empress is the Great Yin Dark Radiance Jade Maiden, the mother of the Dao, situated at the center of the Dipper above the spleen. She wears robes of five-colored pearls, seated beneath a canopied parasol of yellow clouds, and governs the nourishment of the Red Child. Constantly visualize beneath the two breasts the Sun and Moon, within which reside the yellow essence and the red-black *qi*. These enter the Crimson Palace and then proceed into the Purple Chamber of the Yellow Court, filling the Great Granary to abundance. The Red Child sits facing south within the stomach duct, partaking of the yellow essence and red *qi*, thereby becoming sated. All illnesses depart, and the myriad calamities cannot assail. Constantly preserve this visualization, and above, one will become a True Person.",
      "overlap_context": "nd enter the earth, never to perish, decay, or lose my way. Inscribe my name in the register of the living, that I may attend the Lord of the Dao and endure as long as heaven and earth.\"\n\nThe Ninth Immortal:\nThe South Pole is Unity, the foremost of immortals, the Supreme Supreme Great One, the celestial Marquis-King and Grand Commandant. He governs all calamities and changes, determining the fortunes and misfortunes of nations. Above, He is the Star of Mars; below, He presides over Huo Mountain.",
      "start_char": 1821,
      "end_char": 2484,
      "start_sentence": 87,
      "end_sentence": 118,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.27474045753479,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\太上老君中经珠宫玉历.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "故曰同出而异名也。 有注云：日月同出异名。 太素乡，中元里，中黄真人，字黄裳子，主辟谷，令人神明乍小乍大。 常以鸡呜，食时祝曰： 黄裳子，黄裳子，黄庭真人在于己。 为我致药酒、松脯、粳粮、黍跃，诸可食饮者，令立至。 祝讫，暝目有顷，闭口咽之二七过，即饱矣。 第十二神仙 吾者，道子之也。 人亦有之，非独吾也。 正在太仓胃管中，正南面坐珠玉床上，黄云华盖覆之，衣五彩珠衣。 母在其右上，抱而养之，父在其左上，教而护之。 故父曰陵阳，字子明，母日太阴，字玄光玉女。 己身为元阳，字子丹。 真人字仲黄，真吾之师也。 常教吾神仙长生之道，常侍吾左右，休舍太仓，在脾中与黄裳子共宿卫吾，给事神所当得，主致行厨。 故常思真人子丹正在太仓胃管中，正南面坐，食黄精赤气，饮服醴泉。 元阳子丹长九分，思之令与己身等也。 父母养之，乃得仙仙。 常自念己身在胃管中童子，服五色彩衣，坐珠玉之床，黄云赤气为帐，食黄金玉饵，服神丹芝草，饮醴泉，乘黄云气五色珠玉之车，驾十二飞龙，二十四白虎，三十六朱乌，思之九年，乘云去世，上谒道君。 五方从官，凡三万六千神，举吾宗族，皆得仙道，白日升天。 常以四时祠吾祖先，正月亥日鸡呜时祠郊庙，二月亥日祠社稷、风伯、雨师，四月五月申卯日，七月八月巳午日，十月十一月卯戌日，四季月不祠。 但解垮土公，逐去伏尸耳。 郊在头上脑户中，庙在顶后骨之上，社在脾左端，稷在大肠穷，风伯在八门。 八门者，在脐旁五城十二楼也。 雨师在小肠穷，四渍云气出昆仑，弱水在胞中，诸神食厨在於太仓中。 以次呼神名召之，勿忘也。 第十三神仙 游玑者，北斗君也，天之侯王也。 主制万二千神，持人命籍。 人亦有之，在脐中，太一君，人之侯王也。 柱天大将军，特进侯也。 主身中万二千神。 中极乡，游玑里，姓王名阳，字灵子。 冠三缝之冠，衣绛章单衣，长九分，思之亦长三寸，其大与自身等也。 太一君有八使者，八卦神也。 太一在中央，主总阅诸神，案比定录，不得通亡。 八使者以八节之日上对太一，故脐中名为太渊都乡之府也。 常以秋分之日案此＃１算之。 斋戒沐浴，瑞＃２外三日勿出，日三呼之，三日九呼之。 常如此，诸神不得通亡，名上仙录，定为真人。 故太一不得妄上白事，不吉则凶，但八使者耳。 故以八节之日、晦朔弦望日，右手村脐二七，左手批心三七，祝曰： 天灵节荣真人，某甲愿得长生，太玄真一守某甲身形，五藏诸君侯愿且安宁，公兆七遍，庶兆二十。 明日平旦，复祝曰： 太一北极君，敬守告诸神，常令魂魄安宁，无离某甲身形。 此所谓拘魂制魄者也。 常以十二月晦日人定时，向月建太一於空室中，再拜正坐，暝目祝曰： 五藏之君，魂魄诸神，某乞长生，无得离身，常与形合，同成为一身。 男女各三通，常以八节日於室中，向其王池＃３再拜，暝目祝曰： 大道鸿津鸿津，天节之日，万兆魂魄皆上诸天，真人身与神合，某甲欲得长生，独在空室之中，不豫死籍数。 男女各三遍。 常以十二月晦日宿夜昼朝至平旦，於室中向寅地再拜，祝曰： 鸿津鸿津，某受大道之恩，太清玄巅，愿还某甲去岁之年，魂魄保身。",
      "translated_text": "Thus it is said: \"Emerging together yet bearing different names.\" There is a commentary that states: \"The sun and moon emerge together yet bear different names.\"\n\nIn the Great Simplicity Village, within the Central Origin Ward, resides the Central Yellow True Person, styled Yellow Skirt Master, who presides over grain avoidance and causes one’s spirit to become luminous, now small, now great. At cock’s crow and mealtime, recite the incantation: *\"Yellow Skirt Master, Yellow Skirt Master, the Yellow Court True Person resides within me. Procure for me medicinal wine, pine-dried meat, polished grain, and millet cakes—all that may be eaten or drunk—so that they arrive at once.\"* After reciting, close your eyes for a moment, shut your mouth, and swallow thirty-four times; you will then be sated.\n\n**The Twelfth Immortal**\nI am the child of the Dao. This is not unique to me; all people possess it. It resides within the Great Granary of the stomach duct, seated facing south upon a pearl-and-jade bed, covered by a canopy of yellow clouds, and clad in robes of five-colored pearls. The mother stands to its upper right, embracing and nourishing it, while the father stands to its upper left, instructing and protecting it. Thus, the father is called Lingyang, styled Ziming; the mother is called Great Yin, styled Dark Radiance Jade Maiden. One’s own body is the Primordial Yang, styled Zidan. The True Person, styled Zhonghuang, is the teacher of my true self. He constantly imparts the Dao of immortality and long life, ever attending at my left and right, resting in the Great Granary within the spleen, sharing guard duty with Yellow Skirt Master to serve the divine and procure what is due. Thus, constantly visualize the True Person Zidan seated facing south within the stomach duct, consuming yellow essence and red *qi*, drinking from the sweet spring. The Primordial Yang Child Zidan is nine *fen* in height; visualize him to be equal in size to your own body. Nurtured by father and mother, he attains transcendence. Constantly envision your own body as a youth within the stomach duct, clad in five-colored robes, seated upon a pearl-and-jade bed, beneath a canopy of yellow clouds and red *qi*, partaking of golden jade elixirs, consuming divine cinnabar and sacred herbs, drinking from the sweet spring, riding a chariot of yellow clouds and five-colored pearls, drawn by twelve flying dragons, twenty-four white tigers, and thirty-six vermilion crows. After nine years of such visualization, you will ascend upon clouds to depart the world and ascend to pay homage to the Dao Lord. The officials of the five directions, numbering thirty-six thousand spirits in all, will elevate your entire clan to the immortal Dao, ascending to heaven in broad daylight.\n\nAt each of the four seasons, make offerings to your ancestors. On the *hai* day of the first month at cock’s crow, make offerings at the suburban altars and ancestral temples; on the *hai* day of the second month, make offerings to the altars of soil and grain, the Earl of Wind, and the Master of Rain. On the *shen* and *mao* days of the fourth and fifth months, the *si* and *wu* days of the seventh and eighth months, and the *mao* and *xu* days of the tenth and eleventh months, perform these rites. In the intercalary months, do not make offerings, but instead dissolve the Earth Lord and expel the concealed corpse. The suburban altar is within the brain’s gate at the crown of the head; the ancestral temple is upon the bone at the back of the skull. The soil altar is at the left end of the spleen; the grain altar is at the end of the large intestine. The Earl of Wind resides at the Eight Gates. The Eight Gates are located beside the navel, within the Five Cities and Twelve Towers. The Master of Rain is at the end of the small intestine. The four streams of cloud-*qi* emerge from Kunlun; the Weak Water is within the bladder. The divine kitchens of all the spirits are within the Great Granary. Call upon the spirits by name in order, and do not forget.\n\n**The Thirteenth Immortal**\nThe Jade Pivot is the Lord of the Northern Dipper, the sovereign of heaven. He governs the twelve thousand spirits and holds the register of human lives. All people possess him within the navel as the Great One Lord, the sovereign of the human body. The Pillar of Heaven, Grand General, is a specially advanced marquis who governs the twelve thousand spirits within the body.\n\nIn the Central Ultimate Village, Jade Pivot Ward, his surname is Wang, given name Yang, styled Lingzi. He wears a three-seamed cap and a single-layered crimson robe, nine *fen* in length; when visualized, he is three *cun* tall, his size equal to one’s own body. The Great One Lord has eight attendants, the spirits of the Eight Trigrams. The Great One resides at the center, presiding over the review of all spirits, examining and verifying their records to prevent their escape. The eight attendants report to the Great One on the eight seasonal nodes. Thus, the navel is called the Mansion of the Great Abyss, the village of the capital.\n\nConstantly on the autumnal equinox, review this calculation. Bathe and fast, and for three days prior, do not leave the chamber. Call upon him thrice daily for three days, nine times in all. By doing so, none of the spirits may escape, your name will be recorded among the transcendent immortals, and you will be confirmed as a True Person. Thus, the Great One may not rashly ascend to report; if the report is inauspicious, misfortune will follow, but this concerns only the eight attendants.\n\nOn the days of the eight seasonal nodes, the last day of the month, the new moon, the first and last quarters, and the full moon, tap the navel thirty-four times with the right hand and stroke the heart forty-nine times with the left hand, reciting: *\"Heavenly Numinous Splendor True Person, so-and-so wishes to attain long life. May the Great Mysterious True One guard so-and-so’s body. May the lords of the five viscera and all the marquises remain peaceful. Recite the primary incantation seven times, the secondary twenty times.\"* The next morning at dawn, recite again: *\"Great One Lord of the Northern Culmen, I respectfully beseech all the spirits to constantly guard and keep my hun and po souls peaceful, never departing from so-and-so’s body.\"* This is what is meant by restraining the hun and controlling the po.\n\nOn the last day of the twelfth month at the hour of *ren ding*, face the moon’s position in an empty chamber, bow twice, sit upright, close your eyes, and recite: *\"Lords of the five viscera, spirits of the hun and po, so-and-so seeks long life. Do not depart from the body; constantly unite with the form to become one with it.\"* Men and women each recite this three times. On the days of the eight seasonal nodes, within the chamber, face the Jade Pond, bow twice, close your eyes, and recite: *\"Great Dao, Vast Ford, Vast Ford, on the days of the celestial nodes, the hun and po of the myriad beings all ascend to the heavens. The True Person’s body unites with the spirit. So-and-so desires long life, alone in an empty chamber, not listed in the register of the dead.\"* Men and women each recite this three times.\n\nOn the last day of the twelfth month, from the night’s vigil through dawn to morning, within the chamber, face the *yin* direction, bow twice, and recite: *\"Vast Ford, Vast Ford, so-and-so has received the grace of the Great Dao, the Supreme Clarity and Mysterious Summit. I wish to restore the years of so-and-so’s past life. May the hun and po protect the body.\"*",
      "overlap_context": "he two breasts the Sun and Moon, within which reside the yellow essence and the red-black *qi*. These enter the Crimson Palace and then proceed into the Purple Chamber of the Yellow Court, filling the Great Granary to abundance. The Red Child sits facing south within the stomach duct, partaking of the yellow essence and red *qi*, thereby becoming sated. All illnesses depart, and the myriad calamities cannot assail. Constantly preserve this visualization, and above, one will become a True Person.",
      "start_char": 2484,
      "end_char": 3724,
      "start_sentence": 119,
      "end_sentence": 172,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.75898051261902,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\太上老君中经珠宫玉历.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "男女各三通。 第十四神仙 脐者，人之命也，一名中极，一名太渊，一名昆仑，一名特枢，一名五城。 五城中有五真人。 五城者，五帝也。 五城之外有八吏者，八卦神也。 并太一为九卿。 八卦之外有十二楼者，十二太子，十二大夫也。 并三焦神合为二十七大夫。 四支神为八十一元士。 故五城真人主四时上计，八神主八节日上计，十二大夫主十二月，以晦日上计。 月月不得懈息，即免计上事。 常当存念留之，即长生矣。 故太一常以晦朔、八节日夜半时，五城击鼓，集召诸神，校定功德，谋议善恶，有录者延命，众神共举，无录者终亡，司命绝去生籍。 故常以晦朔、八节之日夜欲卧时，念上太一、中太一、下太一、五城、十二楼真人，祝曰： 天帝太一君，天帝太一君，敬存诸神，与之相亲，司录司命，六丁玉女，削去某死籍，着某生文，皆当言长生。 第十五神仙 五城真人者，五方五帝之神名也。 束方之神名曰句芒子，号曰文始洪崖先生，束方苍帝束海君也。 南方之神名曰祝融子，号日赤精成子，南方赤帝南海君也。 西方之神名日募收子，号日夏里黄公，西方白帝西海君也。 北方之神名曰禺强子，号曰玄冥子昌，北方黑帝北海君也。 此皆后神也，天地人神等耳。 风伯神名咤君，号曰长育。 雨师神名冯修，号日树德。 诸神常当存念之，令与司命君、司录君共削去某死籍，即为真人长生矣。 不与相知存念之，即为疾风暴雨、雷电霹雳持子远去，杀子之身，埋子深山，投子深渊，或为毒气所中，众鬼害人。 子欲为道，宜致敬之。 此神能害人，王者之治，不可不知也。",
      "translated_text": "Men and women each recite this three times.\n\n**Fourteenth: The Immortals of the Navel**\nThe navel is the life of man. It is also called the Central Ultimate, the Grand Abyss, Kunlun, the Unique Pivot, and the Five Cities. Within the Five Cities dwell the Five True Persons. The Five Cities are the Five Thearchs. Beyond the Five Cities are the Eight Officers, who are the spirits of the Eight Trigrams. Together with the Great One, they form the Nine Ministers. Beyond the Eight Trigrams are the Twelve Towers, which are the Twelve Great Princes and Twelve Grand Masters. Together with the spirits of the Triple Burner, they form the Twenty-Seven Grand Masters. The spirits of the four limbs are the Eighty-One Primordial Gentlemen.\n\nThus, the True Persons of the Five Cities preside over the reckoning of the four seasons; the Eight Spirits preside over the reckoning of the eight seasonal nodes; and the Twelve Grand Masters preside over the reckoning of the twelve months, submitting their accounts on the last day of each month. If one does not slacken month by month, one will be exempt from the reckoning. Constantly maintain this visualization, and one will attain long life.\n\nTherefore, the Great One always strikes the drum in the Five Cities at midnight on the last day of the month, the first day of the month, and the eight seasonal nodes, assembling and summoning all the spirits to audit merits and transgressions, deliberating good and evil. Those recorded shall have their lives extended, and all the spirits shall endorse them. Those unrecorded shall perish, and the Controller of Destinies shall erase their names from the register of the living.\n\nThus, on the last day of the month, the first day of the month, and the eight seasonal nodes, when about to sleep at night, visualize the Upper Great One, the Middle Great One, the Lower Great One, the True Persons of the Five Cities, and the True Persons of the Twelve Towers, and recite: *\"Celestial Thearch, Great One, Celestial Thearch, Great One, reverently visualize all the spirits, befriending them. Controllers of Records, Controllers of Destinies, the Six Ding Jade Maidens—erase my name from the register of the dead and inscribe it in the records of the living. All shall speak of long life.\"*\n\n**Fifteenth: The Immortals of the Five Cities**\nThe True Persons of the Five Cities are the spirits of the Five Thearchs of the Five Directions. The spirit of the East is named Gou Mangzi, styled Master Hongya of Literary Beginnings, the Azure Thearch and Lord of the Eastern Sea. The spirit of the South is named Zhu Rongzi, styled Master Cheng of Vermilion Radiance, the Vermilion Thearch and Lord of the Southern Sea. The spirit of the West is named Rushouzi, styled Master Huang of Xiali, the White Thearch and Lord of the Western Sea. The spirit of the North is named Yu Qiangzi, styled Master Chang of Dark Mystery, the Black Thearch and Lord of the Northern Sea. These are all later spirits, equal to the spirits of Heaven, Earth, and Man.\n\nThe spirit of the Wind Earl is named Zha Jun, styled Longyu. The spirit of the Rain Master is named Feng Xiu, styled Shude. Constantly visualize these spirits, causing them, together with the Lord Controller of Destinies and the Lord Controller of Records, to erase your name from the register of the dead, and you shall become a True Person and attain long life. If you do not know them or visualize them, they will become fierce winds and violent rains, thunder and lightning, seizing you and carrying you far away, slaying your body, burying you in deep mountains, casting you into deep abysses, or striking you with poisonous qi, while myriad ghosts harm you. If you wish to cultivate the Dao, you must pay them reverence. These spirits can harm people, and those who govern the realm cannot afford to be ignorant of them.",
      "overlap_context": "o desires long life, alone in an empty chamber, not listed in the register of the dead.\"* Men and women each recite this three times.\n\nOn the last day of the twelfth month, from the night’s vigil through dawn to morning, within the chamber, face the *yin* direction, bow twice, and recite: *\"Vast Ford, Vast Ford, so-and-so has received the grace of the Great Dao, the Supreme Clarity and Mysterious Summit. I wish to restore the years of so-and-so’s past life. May the hun and po protect the body.\"*",
      "start_char": 3724,
      "end_char": 4344,
      "start_sentence": 173,
      "end_sentence": 201,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.363865613937378,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\太上老君中经珠宫玉历.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "中央之神名日黄裳子，号日黄神彭组＃４，中央黄帝君也。 与中太一并治度人命，爱养善人，成就人，常侍黄天真人。 人亦有之，常侍真人，名日子丹，给神所得。 兆欲志道，常思念之，即不饥渴，长生久视，上为真人，能致行厨，役使鬼神。 社稷、河伯之神，名日冯夷，号日元梁使者。 第十六神仙 八卦天神下游於人问，宿卫太一，为八方使者，主八节日上计，校定吉凶。 乾神字仲尼，号日伏羲。 坎神字大曾子。 艮神字照光玉。 震神字小曾子。 巽神字大夏侯。 离神字文昌。 坤神字杨翟王，号曰女娲。 兑神字一世。 注：一云字八世。 常以八节之日存念之，其神皆在脐中，令人延年。 第十七神仙 丹田者，人之根也，精神之所藏也，五黑之元也，赤子之府，男子以藏精，女子以藏月水。 主生子，合和阴阳之门户也。 在脐下三寸，附着脊膂，两肾根也。 丹田之中，中赤，左青，右黄，上白，下黑，方圆四寸之中。 所以在脐下三寸者，言法天地人。 天一、地二、人三、时四，故曰四寸。 法五行，故有五色。 清水乡，敖丘里。 丹田名藏精宫，神姓孔，名丘，字仲尼，传之为师也。 兆常以夜半存心之，赤黑上行至绛宫、华盖，各右绕之。 太一入黄庭，满太仓，养赤子，复入太渊，忽忽不知所在。 复念太一，黑还入丹田中止。 常念太一玄光道母养真人子丹，正吾身也，自兆名也，勿忘之。 第十八神仙 大肠、小肠为元梁使者，主逐捕邪气。 三焦关元为左社右稷，主捕奸贼。 上焦元气上入头中为宗庙，兆身与天地等也。 天地万物不可犯触也，天地之神则知之矣，而人身体四支亦不可伤也。 有痛痒者，神亦知之。 由是言之，昭然明矣。 天不可欺，地不可负，修身慎行，勿令懈怠也。 兆欲除邪气、治百病，啄齿三七过，祝曰： 左社右稷，元梁使者，逐捕灾殃，急急如律令。 五咽一叹，三十咽止。 一日一夜三百＃５六十咽。 三十日邪气去，六十日小病愈，百日大病愈，三虫皆死，三尸走出，面目生光，与神为友。 六祝一止，十二为之一周。 第十九神仙 两肾问名日大海，一名弱水，中有神龟，呼吸元黑，流行作为风雨，通气四支，无不知者。 上有九人，三三为位，左有韩众，右有范蠡，中有大城子； 左为司徒公，右为司空公，中有太一君；",
      "translated_text": "The spirit of the Central Realm is named Huang Shangzi, styled Huangshen Pengzu, and is the Yellow Emperor Lord of the Center. Together with the Central Grand Unity, they govern the destinies of humanity, nurturing the virtuous and aiding people’s accomplishments, ever attending the True Persons of the Yellow Heaven. Within humans, there also resides one who constantly attends the True Person, named Zidan, granted by the spirits.\n\nIf you aspire to set your mind on the Dao, constantly visualize them, and you shall neither hunger nor thirst, attaining long life and enduring vision. Ascending as a True Person, you will be able to summon the traveling kitchen and command ghosts and spirits.\n\nThe spirits of the Earth Altar and the River Earl are named Feng Yi, styled Yuanliang Messenger.\n\n**The Sixteenth Immortal: The Eight Trigram Heavenly Spirits**\nThe Eight Trigram Heavenly Spirits descend to roam among humanity, guarding the Grand Unity and serving as messengers of the eight directions. They oversee the reckoning of auspicious and inauspicious events on the days of the eight solar terms.\n\n- The Qian spirit is named Zhongni, styled Fuxi.\n- The Kan spirit is named Da Zengzi.\n- The Gen spirit is named Zhaoguang Yu.\n- The Zhen spirit is named Xiao Zengzi.\n- The Xun spirit is named Da Xiahou.\n- The Li spirit is named Wenchang.\n- The Kun spirit is named Yangdi Wang, styled Nüwa.\n- The Dui spirit is named Yishi. (Alternatively, some say Bashì.)\n\nOn the days of the eight solar terms, constantly visualize them, for these spirits all reside within the navel, granting one extended years.\n\n**The Seventeenth Immortal: The Cinnabar Field**\nThe Cinnabar Field is the root of the human body, the repository of essence and spirit, the origin of the five viscera, the palace of the Red Child, where men store essence and women store menstrual blood. It governs the birth of children and is the gateway for the harmony of yin and yang. Located three inches below the navel, attached to the spine, it is the root of the two kidneys.\n\nWithin the Cinnabar Field, the center is red, the left blue-green, the right yellow, the top white, and the bottom black, forming a square of four inches. Its location three inches below the navel follows the model of Heaven, Earth, and Humanity—Heaven as one, Earth as two, Humanity as three, and the seasons as four, hence four inches. It aligns with the five phases, thus bearing five colors.\n\nIt is the Clear Water Village, Aoqiu Hamlet. The Cinnabar Field is named the Palace of Stored Essence. Its spirit’s surname is Kong, given name Qiu, styled Zhongni, transmitted as the master.\n\nConstantly at midnight, visualize the heart’s red and black qi ascending to the Crimson Palace and the Florid Canopy, circling each to the right. The Grand Unity enters the Yellow Court, fills the Great Granary, nourishes the Red Child, and returns to the Great Abyss, suddenly vanishing without trace. Then visualize the Grand Unity’s black qi returning to rest within the Cinnabar Field. Constantly visualize the Grand Unity, the Mysterious Radiance, the Dao Mother, and the True Person Zidan, who rectifies my body—from your own name—without forgetting.\n\n**The Eighteenth Immortal**\nThe large and small intestines serve as the Yuanliang Messengers, expelling and capturing pathogenic qi. The Triple Burner and the Pass of Origin act as the Left Altar and Right Millet spirits, capturing traitors and rebels. The primordial qi of the Upper Burner ascends into the head, forming the ancestral temple, making one’s body equal to Heaven and Earth.\n\nHeaven and Earth, with all their myriad things, must not be violated, for the spirits of Heaven and Earth know all. Likewise, the four limbs of the human body must not be harmed. If there is pain or itching, the spirits also know. From this, it is clearly evident: Heaven cannot be deceived, Earth cannot be betrayed. Cultivate the body and be cautious in conduct, never allowing negligence.\n\nIf you wish to expel pathogenic qi and cure the hundred diseases, knock the teeth together twenty-one times and recite:\n*\"Left Altar, Right Millet, Yuanliang Messengers, expel and capture calamities and misfortunes—hasten as the statutes command!\"*\nSwallow five times, sigh once, and repeat thirty swallows in total. Perform three hundred and sixty swallows in a day and night. After thirty days, pathogenic qi departs; after sixty days, minor illnesses are cured; after a hundred days, major illnesses are healed. The Three Worms all die, the Three Corpses flee, the face and eyes radiate light, and you become a friend to the spirits. After six recitations, pause; twelve recitations complete one cycle.\n\n**The Nineteenth Immortal**\nBetween the two kidneys is named the Great Sea, also called Weak Water, wherein resides a spirit turtle. It breathes primordial black qi, generating wind and rain, circulating qi through the four limbs, knowing all without exception.\n\nAbove it are nine persons, arranged in three groups of three. To the left is Han Zhong, to the right Fan Li, and in the center, Dachengzi. On the left is the Minister of Education, on the right the Minister of Works, and in the center, the Grand Unity Lord.",
      "overlap_context": "e a True Person and attain long life. If you do not know them or visualize them, they will become fierce winds and violent rains, thunder and lightning, seizing you and carrying you far away, slaying your body, burying you in deep mountains, casting you into deep abysses, or striking you with poisonous qi, while myriad ghosts harm you. If you wish to cultivate the Dao, you must pay them reverence. These spirits can harm people, and those who govern the realm cannot afford to be ignorant of them.",
      "start_char": 4344,
      "end_char": 5227,
      "start_sentence": 202,
      "end_sentence": 250,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.821395874023438,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\太上老君中经珠宫玉历.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "左有青腰玉女，右有白水素女，中有玄光玉女。 玄光玉女者，道元气之母也。 左有司录，右有司命，风伯雨师，雷电送迎，仙人玉女，宿卫门户，故名日太渊之宫。 先正紫房宫太一玄女赤子，故玄女常戴太白明星，耳着太明之珠，光照一身中，即延年而不死也。 第二十神仙 胃为太仓，三皇五帝之厨府也。 房心为天子之宫，诸神皆就太仓中饮食，故胃为太仓，日月三道之所行也。 又为大海，中有神龟。 神龟上有七星北斗，正在中央。 其龟黄色，状如黄金盘，左右日月照之。 故脐下为地中，中有五岳四渍，水泉交通，昆仑弱水，沈沈况况，玄冥之渊也。 日月之行，故天昼日照於．地下，万神皆得其明。 人亦法之，昼日下在脐中，照於丹田，脐中万神皆得其明也。 夜日在胃中，上照於胸中，万神行游嬉戏，相与言语，故令人有梦也。 天不掩人不备，故召其神问善恶吉凶之事，令肾者自慎也。 夜月在脐中，下照於万神。 昼月在胃中，上照胸中。 万神更相上下，无有休息。 故胃中神十二人，谏议大夫名日黄裳子、黄腾子、中黄子，主傅相太子。 玄光玉女主取金液、神丹、芝草、玉液、松脯，诸可饮食者立至矣。 第二十一神仙 兆审欲得神仙，当知天地、父母、赤子处。 兆汝为道，不可不知此五神名也，当自苦耳。 知之行之，坚守之，常念之，即神仙矣。 经中俱有，但当心解耳。 既知其神，当须得太一神丹金液，乃得神仙耳。 诸神元黑，虚无无为，自然为圣人耳，不为俗人所施也。 兆不能服神丹金液，劳精思念，当自苦耳。 故谓兆汝昼日常念脐中有日，赤黄精黑光明照于脐中。 胃中有月，白光赤黄精黑填满胃中。 暮外念日在胃中，赤黄精黑光明照於胸中。 月在脐中，赤黄白光精黑照於脐中。 以此为常，万世无止。 第二十二神仙",
      "translated_text": "To the left is the Azure-Waisted Jade Maiden, to the right the White Water Plain Maiden, and in the center, the Mystic Radiance Jade Maiden. The Mystic Radiance Jade Maiden is the mother of the primordial qi of the Dao. To the left is the Recorder, to the right the Life-Regulator; the Wind Earl and Rain Master escort her, thunder and lightning attend her arrival and departure, while immortals and jade maidens guard the gates and doors—thus it is named the Palace of the Great Abyss.\n\nFormerly, within the Purple Chamber Palace, the Grand Unity’s Mystic Maiden and the Crimson Child resided. Therefore, the Mystic Maiden ever wears the Radiant Star of Venus upon her head and the Luminous Pearl of Supreme Brightness upon her ears, her light illuminating her entire body, thereby prolonging life to immortality.\n\n**The Twentieth Immortal**\nThe stomach is the Great Granary, the kitchen and storehouse of the Three Sovereigns and Five Emperors. The chambers of the heart are the Celestial Son’s palace; all spirits gather in the Great Granary to feast. Thus, the stomach is the Great Granary, where the sun, moon, and three paths traverse. It is also called the Great Sea, wherein resides a spirit turtle. Above the turtle stand the seven stars of the Northern Dipper, positioned at the center. The turtle is yellow, resembling a golden platter, with the sun and moon illuminating it on either side.\n\nThus, below the navel lies the Earth’s Center, where the Five Peaks and Four Seas converge, waters and springs interflow, and the Weak Water of Kunlun sinks deep into the Dark and Profound Abyss. As the sun and moon traverse, heaven’s daylight shines upon the earth below, and all spirits receive its illumination. Humans emulate this: by day, the sun descends into the navel, illuminating the Cinnabar Field, so that all spirits within the navel receive its light. By night, the sun resides in the stomach, shining upward into the chest, where all spirits roam, play, and converse—thus do dreams arise.\n\nHeaven does not conceal, nor do humans remain unprepared; therefore, summon the spirits to inquire of good and ill fortune, that the kidneys may be guarded with vigilance. By night, the moon rests in the navel, shining downward upon all spirits. By day, the moon resides in the stomach, shining upward into the chest. All spirits ascend and descend in turn, without rest.\n\nThus, within the stomach dwell twelve spirits: the Remonstrating Gentlemen named Yellow Skirt Master, Yellow Soaring Master, and Central Yellow Master, who serve as tutors and attendants to the Crown Prince. The Mystic Radiance Jade Maiden presides over the gathering of golden liquid, divine elixirs, magic mushrooms, jade essence, pine resin, and all that may be consumed—all shall arrive at once.\n\n**The Twenty-First Immortal**\nIf you, Zhao, truly seek immortality, you must know the abodes of Heaven and Earth, father and mother, and the Crimson Child. If you pursue the Dao, you cannot be ignorant of these five spirits’ names—you must endure hardship. Know them, practice them, hold fast to them, and constantly contemplate them, and you shall become an immortal. All is contained within the scriptures; you need only comprehend with the heart.\n\nHaving known the spirits, you must then obtain the Grand Unity’s divine elixir and golden liquid to attain immortality. All spirits are of primordial blackness, empty and non-acting, naturally becoming sages—not for the vulgar to employ. If you, Zhao, cannot ingest the divine elixir and golden liquid, exhaust your essence in contemplation, and endure hardship.\n\nThus, I say to you, Zhao: by day, constantly contemplate the sun within the navel, its crimson-yellow essence and black radiance illuminating the navel. Within the stomach is the moon, its white light and crimson-yellow essence filling the stomach with blackness. By night, contemplate the sun within the stomach, its crimson-yellow essence and black radiance illuminating the chest. The moon resides in the navel, its crimson-white light and black essence illuminating the navel. Make this your constant practice, unceasing for ten thousand generations.\n\n**The Twenty-Second Immortal**",
      "overlap_context": "ortal**\nBetween the two kidneys is named the Great Sea, also called Weak Water, wherein resides a spirit turtle. It breathes primordial black qi, generating wind and rain, circulating qi through the four limbs, knowing all without exception.\n\nAbove it are nine persons, arranged in three groups of three. To the left is Han Zhong, to the right Fan Li, and in the center, Dachengzi. On the left is the Minister of Education, on the right the Minister of Works, and in the center, the Grand Unity Lord.",
      "start_char": 5227,
      "end_char": 5920,
      "start_sentence": 251,
      "end_sentence": 284,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.38280153274536,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\太上老君中经珠宫玉历.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "头发神七人，七星精也。 神字禄之。 两目神六人，日月精也。 左目字英明，右目字玄光。 头上神三人，束王父也。 脑户中神三人，泥丸君也。 眉间神三人，南极老人元光天灵君也。 两耳神四人，阴阳之精也，字娇女。 鼻人中神一人，名太一，字通卢，本天灵也。 口旁神二人，厨宰守神也。 口中神一人，太一君也，字丹朱。 颐下神三人，太阴神也。 颈外神二人，玉女君也。 两手中神二人，太阳之精也，字魂阴。 项中神二人，字上问也。 肩背神二人，少阴少阳之精也，字女爵。 胸中神二人，虎贲神也。 两乳下，日月也。 日月中有大神各一人，王父母也。 两腋下神二人，魂魄兆神也。 小腹中神二人，玉女也。 两腔内神二人，亦玉女也，字阴隐。 两经神二人，金木神也，字随孔子。 两足神二人，太阴之精也，字柱天力士。 头发神，字禄之。 两耳神，字娇女。 两目神，字英明玄光。 鼻孔中神，字通卢。 口神，字丹朱。 肩背神，字朱雀，一云字女爵。 两手神，字魄阴。 上元神，字威成子。 中元神，字中黄子。 下元神，字明光子，一云字命光。 阴神，字穷英。 两腔神，字阴隐。 两膝神，字枢公。 兆欲卧，暝目，从上次三呼之，竟，乃止。 其有病痛处，即九呼其神，令治之。 百病悉去，即为神仙矣。 第二十三神仙 肺神八人，太和君也，名日玉真宫，尚书府也。 其从官三千六百人，乘白云黑之车，胶驾白虎，或乘白龙。 心神九人，太尉公也，名日绛宫，太始南极老人元光也。 其从官三千六百人，乘赤云黑之车，朱雀为盖，丹蛇为柄，胶驾朱雀，或乘赤龙。 肝神七人，老子君也，名日明堂宫，兰台府也。 其从官三千六百人，乘青云黑之车，胶驾青龙，或乘白鹿。 胆神五人，太一道君也，居紫房宫，乘五彩玄黄紫盖珠玉云黑之车，胶驾六飞龙。 从官三千六百人。 脾神五人，玄光玉女，子丹母也。 乘黄金珠玉云黑之车，胶驾凤凰，或乘黄龙。 从官三千六百人。 真人子丹在上，外胃管中，黄云黑为帐，珠玉为林，食黄金玉饵，饮醴泉玉液，服太一神丹，瞰玉李芝草，存而养之，九年成真矣。 千乘万骑，上谒太上黄道君，东谒王父，西谒王母，南谒老人元光之前，真人得道，与天地合。 元阳子丹者，吾也。 吾道成乃去，白日升天，或乘黄金云黑珠玉之车，胶驾六飞龙，辔无极之马，从官凡万八千人。 天师大神使万八千人来下着吾身，合三万六千人，故能白日升天也。 胃神十二人，五元之黑，谏议大夫也。 脐中神五人，太一八人，凡十三人。 合二十五人，五行阴阳之神也。 神龟之上神三人，玄女、虚无、道母也。 肾神六人，司徒、司空、司命、司录、司隶、校尉廷尉卿也。 乘神龟之车，驾六鲤鱼，一云白鱼，玄白云黑之盖。 丹田神三人，人之根也，三合成德，以应道数也。 三焦神六人，左社右稷，风伯雨师，雷电霹雳也。 大肠、小肠神二人，为元梁使者。 虎贲神二人，为力士，在朱雀阙门，延年益等为龄，下侍真人凤凰阁。 玄谷神五人，大将军司马也。 阴神三人，上将军也，万神之精也。 男子字穷英，女子字丹城。 天之神万八千人，人之神万八千人，都合三万六千人，共举一身升天，即神仙矣。 第二十四神仙",
      "translated_text": "The hair’s spirits are seven, the essence of the Seven Stars. Their name is Lu Zhi. The spirits of the two eyes are six, the essence of the sun and moon. The left eye’s name is Ying Ming, the right eye’s is Xuan Guang. The spirits atop the head are three, the Bound King Father. The spirits within the brain’s chamber are three, the Mud-Pill Lord. The spirits between the brows are three, the South Pole Elder, Yuan Guang, and the Celestial Numinous Lord. The spirits of the two ears are four, the essence of yin and yang, named Jiao Nü. The spirit within the nose’s bridge is one, named Tai Yi, styled Tong Lu, originally of celestial numinosity. The spirits beside the mouth are two, the kitchen stewards and guardians. The spirit within the mouth is one, the Tai Yi Lord, styled Dan Zhu. The spirits beneath the chin are three, the spirits of Great Yin. The spirits outside the neck are two, the Jade Maiden Lord. The spirits within the two hands are two, the essence of Great Yang, styled Hun Yin. The spirits within the nape are two, styled Shang Wen. The spirits of the shoulders and back are two, the essence of Lesser Yin and Lesser Yang, styled Nü Jue. The spirits within the chest are two, the Tiger-Rushing Spirits. Beneath the two breasts are the sun and moon. Within the sun and moon are great spirits, one each, the King Father and Queen Mother. The spirits beneath the two armpits are two, the Hun and Po’s Zhao Spirits. The spirits within the lower abdomen are two, Jade Maidens. The spirits within the two thighs are two, also Jade Maidens, styled Yin Yin. The spirits of the two meridians are two, the spirits of Metal and Wood, styled Sui Kong Zi. The spirits of the two feet are two, the essence of Great Yin, styled Zhu Tian Li Shi.\n\nThe hair’s spirit is styled Lu Zhi. The ear’s spirits are styled Jiao Nü. The eye’s spirits are styled Ying Ming and Xuan Guang. The spirit within the nostrils is styled Tong Lu. The mouth’s spirit is styled Dan Zhu. The shoulder and back’s spirits are styled Zhu Que, also called Nü Jue. The hand’s spirits are styled Po Yin. The Upper Prime’s spirit is styled Wei Cheng Zi. The Middle Prime’s spirit is styled Zhong Huang Zi. The Lower Prime’s spirit is styled Ming Guang Zi, also called Ming Guang. The yin spirit is styled Qiong Ying. The thigh’s spirits are styled Yin Yin. The knee’s spirits are styled Shu Gong.\n\nWhen you, Zhao, wish to lie down, close your eyes and sequentially invoke them three times from the top, ceasing only when finished. If there is pain or illness in any part, invoke its spirit nine times and command it to heal. All ailments will depart, and you shall become an immortal.\n\n**The Twenty-Third Immortal**\n\nThe lung’s spirits are eight, the Tai He Lord, named Jade True Palace, the Ministry of Works. Their retinue numbers three thousand six hundred, riding chariots of white clouds and blackness, drawn by white tigers, or riding white dragons. The heart’s spirits are nine, the Grand Commandant, named Crimson Palace, the South Pole Elder Yuan Guang. Their retinue numbers three thousand six hundred, riding chariots of red clouds and blackness, with vermilion phoenixes as canopies and cinnabar serpents as shafts, drawn by vermilion phoenixes, or riding red dragons. The liver’s spirits are seven, the Lord Lao Zi, named Bright Hall Palace, the Orchid Terrace Ministry. Their retinue numbers three thousand six hundred, riding chariots of blue-green clouds and blackness, drawn by azure dragons, or riding white deer. The gallbladder’s spirits are five, the Tai Yi Dao Lord, residing in the Purple Chamber Palace, riding a chariot of five-colored clouds, a canopy of mysterious yellow and purple, and pearl-and-jade clouds, drawn by six flying dragons. Their retinue numbers three thousand six hundred. The spleen’s spirits are five, the Yuan Guang Jade Maiden, the Mother of Cinnabar Child. They ride a chariot of yellow gold, pearls, and jade clouds, drawn by phoenixes, or riding yellow dragons. Their retinue numbers three thousand six hundred.\n\nThe Perfected One, Cinnabar Child, dwells above, within the outer stomach’s tube, beneath a canopy of yellow clouds and blackness, a forest of pearls and jade. He consumes golden jade elixirs, drinks sweet springs and jade liquids, ingests the Tai Yi divine elixir, and gazes upon jade plums and magic mushrooms. Nurture him through visualization, and in nine years, he shall attain perfection. With a thousand chariots and ten thousand riders, he ascends to pay homage to the Supreme Yellow Dao Lord, eastward to the King Father, westward to the Queen Mother, southward to the Elder Yuan Guang. The Perfected One attains the Dao and unites with heaven and earth.\n\nThe Primordial Yang Cinnabar Child is I. When my Dao is accomplished, I depart, ascending to heaven in broad daylight, or riding a chariot of yellow gold, clouds, and blackness, pearls and jade, drawn by six flying dragons, reins held by boundless horses. A retinue of eighteen thousand attends me. The Celestial Master’s great spirits send down eighteen thousand to reside within my body, combining into thirty-six thousand. Thus, I ascend to heaven in broad daylight.\n\nThe stomach’s spirits are twelve, the blackness of the Five Primes, the Grand Master of Remonstrance. The navel’s spirits are five, the Tai Yi’s eight, totaling thirteen. Combined, they are twenty-five, the spirits of the Five Phases and yin-yang. Atop the divine tortoise are three spirits: Mysterious Maiden, Emptiness, and Dao Mother. The kidney’s spirits are six: Minister of Education, Minister of Works, Controller of Destinies, Recorder, Constable, and Commandant of the Court Gentlemen. They ride a chariot of the divine tortoise, drawn by six carp, also called white fish, with a canopy of mysterious white clouds and blackness.\n\nThe cinnabar field’s spirits are three, the root of the person. The Three Harmonies complete virtue, aligning with the Dao’s numbers. The triple burner’s spirits are six: Left Minister, Right Minister, Wind Earl, Rain Master, thunder, lightning, and thunderbolts. The large and small intestines’ spirits are two, the Envoys of Primordial Beams. The Tiger-Rushing Spirits are two, the Mighty Warriors, stationed at the Vermilion Phoenix Gate, extending years and increasing lifespan, serving below the Perfected One in the Phoenix Pavilion. The Mysterious Valley’s spirits are five, the Grand General and Marshal. The yin spirits are three, the Supreme General, the essence of the myriad spirits. For men, they are styled Qiong Ying; for women, Dan Cheng.\n\nThe celestial spirits number eighteen thousand, the human spirits eighteen thousand, together thirty-six thousand. United, they lift the body to ascend to heaven, and one becomes an immortal.\n\n**The Twenty-Fourth Immortal**",
      "overlap_context": " crimson-yellow essence and black radiance illuminating the navel. Within the stomach is the moon, its white light and crimson-yellow essence filling the stomach with blackness. By night, contemplate the sun within the stomach, its crimson-yellow essence and black radiance illuminating the chest. The moon resides in the navel, its crimson-white light and black essence illuminating the navel. Make this your constant practice, unceasing for ten thousand generations.\n\n**The Twenty-Second Immortal**",
      "start_char": 5920,
      "end_char": 7133,
      "start_sentence": 285,
      "end_sentence": 356,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.58680009841919,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\太上老君中经珠宫玉历.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "东方之神女名日青腰玉女，南方之神女名曰赤圭玉女，中央之神女名日黄素玉女，西方之神女名日白素玉女，北方之神女名日玄光玉女。 左为常阳，右为承翼，此皆玉女之名也。 五行之道，常以所胜好者为妻。 假令今日甲乙木，木胜土，则甲以己为妻。 故言甲己、乙庚、丙辛、丁壬、戊癸，此皆夫妻合会之日也。 言肝胆木也，木帝以中宫戊己素玉＃６为妻。 他皆效此。 此二神玉女之来，敬而侍之，慎无妻也。 妻之杀人，终不得道也。 兆欲为道，慎勿淫，淫即死矣。 此玉女可使取玉浆，致行厨也。 第二十五神仙 太上神字元光太一君。 其欲得太一之神也，非心神也，乃天神南极老人元光也，下在人心中。 常以平旦、日中、甲午日、丙午日、呼之曰：南极老人元光太一君，某甲欲愿得太一神丹长生之道。 因瞑目念心中太一童子衣绛章单衣，其色正赤黄如日，九十息顿止。 心中神字光坚，中太一中极君也。 在脾中，主养兆身。 常以鸡呜、食时、日西黄昏时、辰戌丑未日呼之曰：中极光坚太一君，某甲欲得真人神仙黄庭之道。 因暝目默念黄黑满太仓胃管中，脾上有一黄人，五十息顿止。 心下神字玄谷，北极君也，玄光道母也。 常以夜半时二、甲子、丙子、戊子、庚子、壬子日，呼之曰：北极君玄谷道母，某甲愿欲得金液醴泉可饮食者。 因瞑目念肾问有白黑，中有神龟，龟上有玄女，女右有司命，左有司录，见之呼曰：司命司录，六丁玉女，削去某甲死籍，着玉历生录，皆当言长生。 故曰：能知三神字，可以还命延年。 此三神者，乃天地神道君三元君字也，人之先也。 常念勿忘也。 三元，天之贵神是也。 第二十六神仙 子欲为道，当先历藏，皆见其神，乃有信。 有信之积，神自告之也。 先念天灵君。 天灵君青身白头，正在眉问，思之三日，即见其神。 念玄膺，状正赤生光，念咽喉中正白如银，环十二重。 凡三日，念遍。 乃念肺色正白，名曰鸿鸿，七日。 念心色正赤，名曰陶吻，九日。 念肝色正青，名曰蓝蓝，三日。 念胆色正青，名曰护护，三日。 念脾色正黄，名日俾俾，五日。 念胃色正黄，名曰日一旦，五日。 念肾色正黑，名曰尉尉，三日。 念脐中太一色赤，人名日玉灵子，三日。 念大肠正白色，名日胴胴，一作洞洞，七日。 念小肠色正赤，名日契契，九日。 念丹田色正赤，中有赤人，名曰藏精，三日。 念玄丈方丈，其中有人到住，七日。 念金玉印乾燥完坚，三日。 念玄英正黑，润泽有光，三日。 念两脾，一作腔，左右脾内各有一玉女，衣绛被懦、青裙，正立两腔上，三日。 念两足下各有一人，正白，三日。 念为道竟矣，不出静室，辞庶俗，赴清虚，先斋戒，节饮食，乃依道而思之。 第二十七神仙 子审欲为道，神仙不死，当先去三虫，下伏尸。 三日百六十息，食气三十通一止，九十通一休息，日四为之。 常夜半鸡呜时祝曰： 东方青牙，紫云流霞，饮食青牙，服食朝华。 三咽之。 南方朱丹，焕惧徘徊，服食朱丹，饮以丹池。 三咽之。 中央黄黑，黄庭高仙，服食黄黑，饮之醴泉。 三咽之。 西方明石，皓灵金质，服食明石，饮以金液。 三咽之。 北方玄滋，玄珠润滋，服食玄滋，饮以玉饴。 三咽之。",
      "translated_text": "The goddess of the eastern direction is named Azure-Waisted Jade Maiden; the goddess of the southern direction is named Vermilion Jade Maiden; the goddess of the central direction is named Yellow-Silk Jade Maiden; the goddess of the western direction is named White-Silk Jade Maiden; the goddess of the northern direction is named Mysterious-Light Jade Maiden. To the left is Everlasting Yang, to the right is Receiving Wings—these are all names of the Jade Maidens.\n\nThe Way of the Five Phases takes as wife the element it overcomes. For instance, if today is a *jia-yi* day (Wood), Wood overcomes Earth, so *jia* takes *ji* as wife. Thus, *jia-ji*, *yi-geng*, *bing-xin*, *ding-ren*, and *wu-gui* are the days when husband and wife unite. The Liver and Gallbladder correspond to Wood, and the Wood Emperor takes the Central Palace’s *wu-ji* Yellow-Silk Jade Maiden as wife. The rest follow this pattern.\n\nWhen these two spirit-maidens arrive, serve them with reverence and never take a wife. Taking a wife kills a man, and he will never attain the Dao. If you wish to cultivate the Dao, beware of lust—lust leads to death. These Jade Maidens may be commanded to fetch Jade Nectar and prepare the traveling kitchen.\n\n**The Twenty-Fifth Immortal**\nThe Supreme Divine One is named Primordial Radiance Grand Unity Lord. To attain the spirit of Grand Unity is not the spirit of the heart but the celestial spirit Southern Culmen Elder, Primordial Radiance, who descends into the human heart. At dawn, midday, *jia-wu* days, or *bing-wu* days, invoke him, saying: *\"Southern Culmen Elder, Primordial Radiance Grand Unity Lord, so-and-so wishes to obtain the Grand Unity’s divine elixir and the Way of long life.\"* Then close your eyes and visualize the Grand Unity Child within your heart, clad in a crimson robe, its color a pure vermilion-yellow like the sun. After ninety breaths, cease.\n\nThe spirit within the heart is named Radiant Firmness, the Central Grand Unity Central Culmen Lord, residing in the spleen to nourish your body. At cock’s crow, mealtime, dusk, or on *chen-xu-chou-wei* days, invoke him, saying: *\"Central Culmen Radiant Firmness Grand Unity Lord, so-and-so wishes to obtain the Perfected One’s divine immortality and the Yellow Court’s Way.\"* Then close your eyes and silently visualize a yellow-black figure filling the Great Granary and stomach duct, with a yellow person above the spleen. After fifty breaths, cease.\n\nThe spirit below the heart is named Mysterious Valley, the Northern Culmen Lord, the Mysterious Light’s Way-Mother. At midnight, on *jia-zi*, *bing-zi*, *wu-zi*, *geng-zi*, or *ren-zi* days, invoke her, saying: *\"Northern Culmen Lord, Mysterious Valley Way-Mother, so-and-so wishes to obtain the Golden Liquid and Sweet Spring for sustenance.\"* Then close your eyes and visualize between the kidneys a white-black expanse, within which is a spirit-tortoise. Upon the tortoise is a Mysterious Maiden, with the Director of Destinies to her right and the Recorder of Deeds to her left. Upon seeing them, call out: *\"Director of Destinies, Recorder of Deeds, Six Ding Jade Maidens, erase so-and-so’s name from the register of death and inscribe it in the Jade Calendar of life—all shall speak of long life.\"*\n\nThus it is said: *\"Knowing the names of the Three Spirits, one may restore life and extend years.\"* These Three Spirits are the Heavenly, Earthly, and Divine Way Lords, the Three Primordial Lords of humanity’s origin. Constantly visualize them without forgetfulness. The Three Primordials are the noble spirits of Heaven.\n\n**The Twenty-Sixth Immortal**\nIf you wish to cultivate the Dao, first traverse the viscera and behold their spirits—only then will you have faith. With accumulated faith, the spirits will reveal themselves. First, visualize the Heavenly Numinous Lord: a blue-bodied, white-headed figure residing between the brows. Meditate on him for three days, and you will see his spirit.\n\nVisualize the Mysterious Breast: a radiant vermilion form. Visualize the throat as pure white like silver, encircled by twelve rings. Meditate on each for three days. Then visualize the lungs as pure white, named *Honghong*, for seven days. Visualize the heart as pure red, named *Taowen*, for nine days. Visualize the liver as pure blue, named *Lanlan*, for three days. Visualize the gallbladder as pure blue, named *Huhu*, for three days. Visualize the spleen as pure yellow, named *Bibi*, for five days. Visualize the stomach as pure yellow, named *Riyidan*, for five days. Visualize the kidneys as pure black, named *Weiwei*, for three days. Visualize the Grand Unity within the navel as red, the person named Jade Numinous Child, for three days. Visualize the large intestine as pure white, named *Dongdong*, for seven days. Visualize the small intestine as pure red, named *Qieqie*, for nine days. Visualize the Cinnabar Field as pure red, within which is a red person named *Cangjing*, for three days. Visualize the Mysterious Cubit and Square Cubit, within which a person resides, for seven days. Visualize the Gold and Jade Seal as dry, complete, and firm, for three days. Visualize the Mysterious Flower as pure black, moist and radiant, for three days. Visualize the two flanks—within each flank’s interior is a Jade Maiden, clad in crimson robes and green skirts, standing upright upon the flanks, for three days. Visualize beneath each foot a person, pure white, for three days.\n\nHaving completed the visualization of the Dao, remain in a quiet chamber, renounce worldly affairs, embrace purity and emptiness, first purify yourself, regulate your diet, and then meditate according to the Dao.\n\n**The Twenty-Seventh Immortal**\nIf you truly wish to cultivate the Dao and become an immortal who never dies, first expel the Three Worms and subdue the Lying Corpses. For three days, perform 160 breaths, ingesting *qi* thirty times before pausing, and ninety times before resting. Do this four times daily. At midnight and cock’s crow, recite the following incantation:\n\n*\"Eastern Azure Fang, purple clouds streaming with rosy dawn—consume Azure Fang, ingest the morning’s glory.\"* Swallow thrice.\n\n*\"Southern Vermilion Cinnabar, resplendent and circling—consume Vermilion Cinnabar, drink from the Cinnabar Pool.\"* Swallow thrice.\n\n*\"Central Yellow-Black, Yellow Court’s lofty immortal—consume Yellow-Black, drink the Sweet Spring.\"* Swallow thrice.\n\n*\"Western Bright Stone, luminous golden essence—consume Bright Stone, drink the Golden Liquid.\"* Swallow thrice.\n\n*\"Northern Mysterious Nourishment, Mysterious Pearl’s moistening essence—consume Mysterious Nourishment, drink the Jade Syrup.\"* Swallow thrice.",
      "overlap_context": "an, serving below the Perfected One in the Phoenix Pavilion. The Mysterious Valley’s spirits are five, the Grand General and Marshal. The yin spirits are three, the Supreme General, the essence of the myriad spirits. For men, they are styled Qiong Ying; for women, Dan Cheng.\n\nThe celestial spirits number eighteen thousand, the human spirits eighteen thousand, together thirty-six thousand. United, they lift the body to ascend to heaven, and one becomes an immortal.\n\n**The Twenty-Fourth Immortal**",
      "start_char": 7133,
      "end_char": 8357,
      "start_sentence": 357,
      "end_sentence": 421,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.56833338737488,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\太上老君中经珠宫玉历.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "如此三十日，三虫皆死，伏尸走去，而三神正黑自安定，伏尸不敢复还兆身中，即神仙不死，玉字金名，乘云而上升。 太上老君中经卷上竟 ＃１『此』，《云笈七签》卷十八《老子中经》作『比』。 ＃２『瑞』，《云笈七签》本作『静』。 ＃３『池』，《云笈七签》本作『地』。 ＃４『组』，《云笈七签》本作『祖』。 ＃５『百』，原作『日』，据《云笈七签》本改。 ＃６『玉』，《云笈七签》本作『女』。 太上老君中经卷下 第二十八神仙 常以六甲之日平日一时扮心祝曰：苍林玄龟，流水如何＃１，炎火周身，身，一作官。 安能知他，道来归己，道来归己。 因念肝色正青，润泽生光，其上高危，在左方。 次念胆色正青圆，中黄外青，润泽清汶，傍生批心，着肝，肝覆其巅，此道之始也。 念之既毕，乃呼其神曰：肉一本作皮。 子蓝蓝，与己为友，留为己使。 某欲得太一神丹服食之，令某甲· 长生，勿去某身，常在紫房宫中，与道合同也。 因暝目念日精青黑来下着身，入鼻孔中，念肝色青黑与之合於目前，来入口中，咽之三七而止。 思行青黑周褊一身中，九十息止。 至乙日复存其神，呼曰：太一紫宫一作紫房素女，与己为友，留为己使。 某甲欲得太一华符服之。 至甲寅、乙卯之日，复存之。 第二十九神仙 常以六丙之日禺中时，批心祝曰：朱雀丹液，天海地河，愿求不死，服食天和。 天和，一作至和。 因暝目念心色正赤如日，在肺叶问，乃止。 念日精赤黄黑来在目＇前，入口中，咽之三九而止。 思行赤黑周褊一身中，百八十息止。 呼其神曰：李尚、李尚，一作李常。 曾子，与己为友，留为己使。 某甲愿求太一神丹，如金洵可饮食者，常在绛宫中，与己合同。 至丁日复存其神，呼曰：天皇绛宫玉女，与己为友，留为己使。 某甲欲得天皇长生之道。 至丙午、丁巳之日，复存之。 第三十神仙 常以六戊之日鸡呜时，日西黄昏时，批心祝曰＃２： 天道天道，愿得不老。 寿比中皇，升天常早。 愿延某命，与道长久。 因螟目念脾中黄黑来上至口中，上念天精黄黑来在目前，入口中咽之，三五而止。 思行黄黑周褊一身中，百五十息止。 呼其神曰：玄光玉女，养子赤子，真人子丹，服食元黑，饮宴醴泉。 故言一身神有父母凡三人。 至己日复存之，呼其神曰：真人黄庭玉女，与己为友，留为己使。 某甲欲求真人黄庭神仙之道。 至戊辰、己未、戊戌、己丑之日，复存之。 第三十一神仙 常以六庚之日日哺时，批心祝曰： 本子本子，白云卒起，雾合万里，愿云来归己，常为我使，反复仙命，终而复始。 因暝目念肺色正白，令白黑来上至口中，念曰：天精白黑，来下在目前，入口中咽之，三七而止。 思行白黑周褊一身中，百四十息止。 呼其神曰：先生尉尉，与己为友，留为己使，奉持华盖，金液玉英，常在勿出，侍我道君，共合为一身。 至辛日复存其神曰：光黄玉堂，青腰玉女，与己为友，留为己使。 某甲欲得彭祖长生不死之药服之。 至庚申、辛酉之日，复存之。 第三十二神仙 常以六壬之日夜半时，批心祝曰： 愿睹天镜，玄滋玉池，还白使黑，常为婴儿。 神来归己，五藏相随。 因瞑目念两肾问白黑周行一身中十二褊，翕然布散，流行四肢。",
      "translated_text": "After thirty days of this practice, the Three Worms all perish, their corpses fleeing away. The Three Spirits settle into their proper places, their black essence stabilized, and the corpse-demons dare not return to the adept’s body. Thus, one attains immortality as a transcendent, inscribed with jade script and golden name, ascending upon clouds.\n\nThe *Upper Scroll of the Central Scripture of the Supreme Lord Lao* concludes.\n\n---\n\n**Twenty-Eighth Transcendent**\nOn the days of the six *jia* stems, at the hour of *pingri*, clasp the heart and recite the incantation:\n*\"Verdant Forest, Dark Turtle—how flows the water? Fire blazes around the body. How can others know? The Dao comes to return to oneself, the Dao comes to return to oneself.\"*\nThen visualize the liver’s true color as azure, lustrous and radiant, towering high in the left quadrant. Next, visualize the gallbladder’s true color as azure and round, its interior yellow and exterior green, lustrous and clear, nestled beside the heart and attached to the liver, which covers its crown—this is the beginning of the Dao.\nWhen the visualization is complete, call upon its spirit:\n*\"Flesh—*or *Skin*—*Child Blue-Blue, be my companion and remain as my servant. I desire the Elixir of the Great One to ingest, that I may live long. Do not depart from my body; abide always in the Purple Chamber Palace, merging with the Dao as one.\"*\nThen close the eyes and visualize the azure-black essence of the sun descending upon the body, entering the nostrils. Envision the liver’s azure-black hue uniting with it before your eyes, then drawing it into the mouth and swallowing thirty-seven times. Circulate the azure-black essence throughout the body, pausing after ninety breaths.\nOn *yi* days, again visualize the spirit and call:\n*\"Maiden of the Great One’s Purple Chamber—*or *Purple Palace*—*be my companion and remain as my servant. I desire the Florid Talisman of the Great One to ingest.\"*\nRepeat the visualization on *jia-yin* and *yi-mao* days.\n\n**Twenty-Ninth Transcendent**\nOn the days of the six *bing* stems, at the hour of *yuzhong*, clasp the heart and recite the incantation:\n*\"Vermilion Bird, Cinnabar Liquid—Heaven’s Sea, Earth’s River. I seek deathlessness, ingesting Heaven’s Harmony.\"*\n(*Heaven’s Harmony* may also read *Supreme Harmony*.)\nThen close the eyes and visualize the heart’s true color as crimson like the sun, resting between the lobes of the lungs. Envision the sun’s red-yellow-black essence appearing before the eyes, entering the mouth, and swallowing twenty-seven times. Circulate the red-black essence throughout the body, pausing after one hundred and eighty breaths.\nCall upon its spirit:\n*\"Li Shang—*or *Li Chang*—*Zengzi, be my companion and remain as my servant. I desire the Elixir of the Great One, golden and pure, fit for ingestion, to abide always in the Crimson Palace, merging with me as one.\"*\nOn *ding* days, again visualize the spirit and call:\n*\"Jade Maiden of the Crimson Palace of the Heavenly Sovereign, be my companion and remain as my servant. I desire the Heavenly Sovereign’s Way of Longevity.\"*\nRepeat the visualization on *bing-wu* and *ding-si* days.\n\n**Thirtieth Transcendent**\nOn the days of the six *wu* stems, at the hour of *jiming* or *rixi* (dusk), clasp the heart and recite the incantation:\n*\"Heaven’s Dao, Heaven’s Dao—I wish to never age. My lifespan rivals the Central Sovereign; ascending to Heaven ever early. May my life be prolonged, enduring with the Dao.\"*\nThen close the eyes and visualize the yellow-black essence within the spleen rising to the mouth. Above, envision the yellow-black essence of Heaven’s essence appearing before the eyes, entering the mouth, and swallowing fifteen times. Circulate the yellow-black essence throughout the body, pausing after one hundred and fifty breaths.\nCall upon its spirit:\n*\"Jade Maiden of Mystic Radiance, nurturing the Red Child, the Perfected One’s Child Elixir—ingesting primordial black, feasting on Sweet Springs. Thus, the body’s spirits have three parents in all.\"*\nOn *ji* days, again visualize the spirit and call:\n*\"Jade Maiden of the Yellow Court of the Perfected One, be my companion and remain as my servant. I desire the Perfected One’s Way of the Yellow Court Transcendent.\"*\nRepeat the visualization on *wu-chen*, *ji-wei*, *wu-xu*, and *ji-chou* days.\n\n**Thirty-First Transcendent**\nOn the days of the six *geng* stems, at the hour of *ribu*, clasp the heart and recite the incantation:\n*\"Root Child, Root Child—white clouds suddenly rise, mist veiling ten thousand *li*. May the clouds return to me, ever as my servants, reversing the mandate of transcendence, ending only to begin anew.\"*\nThen close the eyes and visualize the lungs’ true color as white, summoning the white-black essence to rise to the mouth. Envision the white-black essence of Heaven’s essence descending before the eyes, entering the mouth, and swallowing twenty-one times. Circulate the white-black essence throughout the body, pausing after one hundred and forty breaths.\nCall upon its spirit:\n*\"Master Wei-Wei, be my companion and remain as my servant, bearing the Florid Canopy, Golden Liquid, and Jade Blossoms. Never depart; attend me, the Dao Lord, merging as one body.\"*\nOn *xin* days, again visualize the spirit and call:\n*\"Radiant Yellow Jade Hall, Jade Maiden of the Azure Waist, be my companions and remain as my servants. I desire the Elixir of Pengzu’s Longevity and Deathlessness to ingest.\"*\nRepeat the visualization on *geng-shen* and *xin-you* days.\n\n**Thirty-Second Transcendent**\nOn the days of the six *ren* stems, at the hour of midnight, clasp the heart and recite the incantation:\n*\"I wish to behold Heaven’s Mirror, the Mystic Nourishment of the Jade Pool. Returning white to black, ever as an infant. May the spirits return to me, the Five Viscera following in tow.\"*\nThen close the eyes and visualize the white-black essence circulating between the two kidneys, suffusing the entire body in twelve cycles, spreading and flowing through the four limbs.",
      "overlap_context": " Vermilion Cinnabar, resplendent and circling—consume Vermilion Cinnabar, drink from the Cinnabar Pool.\"* Swallow thrice.\n\n*\"Central Yellow-Black, Yellow Court’s lofty immortal—consume Yellow-Black, drink the Sweet Spring.\"* Swallow thrice.\n\n*\"Western Bright Stone, luminous golden essence—consume Bright Stone, drink the Golden Liquid.\"* Swallow thrice.\n\n*\"Northern Mysterious Nourishment, Mysterious Pearl’s moistening essence—consume Mysterious Nourishment, drink the Jade Syrup.\"* Swallow thrice.",
      "start_char": 8357,
      "end_char": 9634,
      "start_sentence": 422,
      "end_sentence": 481,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.187530517578125,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\太上老君中经珠宫玉历.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "乃复念两肾巍陈，状如双鲤鱼，右黑左赤，侠脊而居，炫惧光明，相照一身中。 乃念青天太清元熙下在目前，入口中，咽之，一九而止。 思行太清白元黑周褊一身，还藏丹田中，呼其神曰：司录六丁玉女，削去某死籍，使某甲长生，上为真人，十二太一皆当言生。 至壬子、癸亥之日，复存之。 第三十三神仙 所存念五脏神皆毕，乃更念玄厘、玉英、金液，但勿忘也。 更念玄厘，欲其润泽而起行列也。 别念玉英，其中有一人，大面倒坚，小童子服饰也。 存之欲令坚强，长大自倍也。 念金液，欲令其乾燥而缓也，如紫谷盛水银也。 念此尽褊，而复存之，法十二周，精神处之，和黑自来，百病去除，寿命与天地期，长生无极，安知死时？ 第三十四神仙 食日之精，可以长生。 绿兹上天，上谒道君。 其法常以月一日、二日、五日、七日、九日、十一日、十三日、十五日，日初出时，披发向日，暝目念心中有一小童子，衣绛衣，文彩五色，灼灼正赤，两手掌中亦正赤，以两手掌摩面，下至心止，十二反为之。 念天日精正赤黄黑来下在目前，存入口中咽之一九。 以手摩送之，村心祝曰： 景君元阳，与我合德，俱养绛宫中小童子？ 须臾复念心下至丹田中止，以手摩送之，以日托心，心得日精，己乃神仙矣。 第三十五神仙 食月之精，以养肾根，白发复黑，齿落更生，己乃得神仙。 常以夜半时思肾问白黑周行一身中，上至脑户，下至足心。 自然之道，易至难行。 常以月十五日，向月祝日： 月君子光，与我合德，养我丹田中小童子。 因暝目念月白黄精气来下在目前，入口中咽之，三七而止。 以手摩送之，下至丹田之中。 丹田中气正赤，气中有一人，长九分，小童子也。 衣朱衣，故丹田中赤外黑，左青右黄，上白，五色气已俱。 但以其月托肾，肾得月精，乃得升沉。 －丹田中赤者，太阳之精也，心火之黑也。 其外黑者，太阴之精也，肾水之气也。 其左青者，少阳之精也，肝木之气也。 其右黄者，中和之精也，脾土之气也。 其上白者，如银盘而照覆之者，少阴之精也，肺金之黑也。 其中有五人，即五脏之太子也，五行之精神也。 人须得丹田成，乃为真人。 故生子仁者，肝之精也。 礼容者，心之精也。 义慧者，肺之精也。 和乐者，肾之精也。 忠信笃厚者，脾之精也。 辩勇者，胆之精也。 缓和者，胆之黑衰也。 盲者，肝之黑衰也。 懦者，肺之黑衰也。 癫者，心之气衰也。 濡者，肾之气衰也。 不肖暗聋者，脾之气衰也。 其五脏衰者，皆自见於己也。 忧悲不乐则伤肝，伤肝则目暝头白，当思肾心以养之。 淫乐过度即伤肾，伤肾则腰疼痛，身沉重，大小便脓血，思肝肺＃３以养之。 患怒则伤心，伤心则病强＃４吐血，思肝脾以养之。 遭患忧难则伤肺，伤肺则思脾肾以养之。 饮食绝饱，酒醉过度则伤脾，伤脾则思心肺以养之。 令其子母相养之，即病愈疾除。 求神仙之人，恶伤五藏，学士明照之。 第三十六神仙 食太极之精，乃得长生。 常以六戊之日，时加其辰，辰一作神。 道士於室中冠带，北向再拜，曰：皇天上帝，太上道君，曾孙小兆王甲好道，愿得长生。 暮夜卧，上念北斗太极中央大明星精，正黄黑来下在兆目前，入口中咽之，三五而止。",
      "translated_text": "Then visualize the two kidneys again, towering and arrayed like a pair of carp—black on the right, crimson on the left—flanking the spine where they reside. Their dazzling radiance illuminates the entire body. Next, envision the azure heavens and the Primordial Brilliance of the Great Clarity descending before your eyes, entering your mouth, and swallowing it nine times in succession. Circulate the White Primordial and Black Perfection of the Great Clarity throughout the body, then return and store it in the Cinnabar Field. Call upon its spirit, saying: *\"Controller of Records, Six Ding Jade Maidens, erase my name from the register of death, that I may attain long life, ascend as a Perfected, and the Twelve Celestial Ones all declare me living.\"* Repeat the visualization on *ren-zi* and *gui-hai* days.\n\n**Thirty-Third Transcendent**\nOnce the visualization of the spirits of the Five Viscera is complete, proceed to visualize *Xuanxi*, *Yuying*, and *Jinye*, ensuring they are never forgotten. For *Xuanxi*, envision it as moist and luminous, rising in ordered ranks. For *Yuying*, imagine within it a figure with a large, inverted face, dressed as a young child. Visualize it to strengthen and double its size. For *Jinye*, envision it as dry and unhurried, like purple millet filled with mercury. After completing this full-body circulation, repeat the visualization twelve times. When the spirit settles within, harmony and darkness will naturally arise, all illnesses will depart, and lifespan will align with heaven and earth—attaining boundless longevity, how could one know the hour of death?\n\n**Thirty-Fourth Transcendent**\nIngesting the essence of the sun grants long life. Ascend thus to the heavens and pay homage to the Dao Lord. The method: on the first, second, fifth, seventh, ninth, eleventh, thirteenth, and fifteenth days of the lunar month, at sunrise, face the sun with unbound hair. Close your eyes and visualize a small child within your heart, clad in crimson robes adorned with five-colored patterns, glowing with a brilliant red hue. Both palms are also radiant red. Rub your face with your palms, descending to the heart, repeating this twelve times. Envision the sun’s essence—pure red, yellow, and black—descending before you, entering your mouth, and swallowing it nine times. Guide it with your hands and recite the heartfelt incantation: *\"Radiant Lord of the Sun, unite your power with mine, together nourishing the crimson child within the Crimson Palace.\"* Then visualize it descending from the heart to the Cinnabar Field, guiding it with your hands. Absorb the sun’s essence into your heart, and you shall become an immortal.\n\n**Thirty-Fifth Transcendent**\nIngesting the essence of the moon nourishes the root of the kidneys, turning white hair black again and causing fallen teeth to regrow—thus attaining immortality. At midnight, circulate the white and black essence between the kidneys throughout the body, ascending to the brain’s gate and descending to the soles of the feet. The natural Dao is easy to grasp yet difficult to practice. On the fifteenth day of the lunar month, face the moon and recite: *\"Moon Lord, Radiant Child, unite your power with mine, nourishing the child within my Cinnabar Field.\"* Close your eyes and envision the moon’s white and yellow essence descending before you, entering your mouth, and swallowing it twenty-one times. Guide it with your hands down to the Cinnabar Field. Within the Cinnabar Field, the qi is pure crimson, and within it resides a figure nine fen tall—a young child clad in vermilion robes. Thus, the Cinnabar Field is crimson within and black without, with azure on the left, yellow on the right, and white above—all five qi now complete. Absorb the moon’s essence into your kidneys, and you shall master ascent and descent.\n\nThe crimson within the Cinnabar Field is the essence of the Great Yang, the fire of the heart. The black without is the essence of the Great Yin, the qi of the kidneys. The azure on the left is the essence of the Lesser Yang, the qi of the liver. The yellow on the right is the essence of the Central Harmony, the qi of the spleen. The white above, like a silver plate covering it, is the essence of the Lesser Yin, the qi of the lungs. The five figures within are the heirs of the Five Viscera, the spirits of the Five Phases. Only when the Cinnabar Field is perfected does one become a Perfected.\n\nThus, benevolence arises from the essence of the liver. Propriety and bearing arise from the essence of the heart. Righteousness and wisdom arise from the essence of the lungs. Harmony and joy arise from the essence of the kidneys. Loyalty, trust, sincerity, and thickness arise from the essence of the spleen. Eloquence and courage arise from the essence of the gallbladder. Gentleness and calm arise from the flourishing qi of the gallbladder. Blindness arises from the declining qi of the liver. Cowardice arises from the declining qi of the lungs. Madness arises from the declining qi of the heart. Weakness arises from the declining qi of the kidneys. Ignorance and deafness arise from the declining qi of the spleen. The decline of the Five Viscera manifests in oneself.\n\nGrief and sorrow injure the liver; when the liver is injured, the eyes dim and the head whitens—nourish it with the heart and kidneys. Excessive indulgence injures the kidneys; when the kidneys are injured, the waist aches, the body grows heavy, and urine and stool contain pus and blood—nourish it with the liver and lungs. Anger injures the heart; when the heart is injured, one suffers from stiffness and vomiting blood—nourish it with the liver and spleen. Misfortune and hardship injure the lungs; when the lungs are injured, nourish them with the spleen and kidneys. Overeating and excessive drunkenness injure the spleen; when the spleen is injured, nourish it with the heart and lungs. Let the mother and child organs nourish one another, and illness will be cured and ailments dispelled. Seekers of immortality must avoid injuring the Five Viscera—scholars, take heed and reflect.\n\n**Thirty-Sixth Transcendent**\nIngesting the essence of the Great Ultimate grants long life. On the six *wu* days, at the hour corresponding to the celestial stem (or \"spirit\"), the Daoist, dressed in ritual attire within the chamber, faces north and bows twice, saying: *\"August Heaven, Supreme Lord, and Most High Dao Lord, your humble descendant, Wang Jia, loves the Dao and wishes for long life.\"* Before sleeping at night, visualize the essence of the great bright star at the center of the Northern Dipper and the Great Ultimate—pure yellow and black—descending before you, entering your mouth, and swallowing it fifteen times.",
      "overlap_context": "Second Transcendent**\nOn the days of the six *ren* stems, at the hour of midnight, clasp the heart and recite the incantation:\n*\"I wish to behold Heaven’s Mirror, the Mystic Nourishment of the Jade Pool. Returning white to black, ever as an infant. May the spirits return to me, the Five Viscera following in tow.\"*\nThen close the eyes and visualize the white-black essence circulating between the two kidneys, suffusing the entire body in twelve cycles, spreading and flowing through the four limbs.",
      "start_char": 9634,
      "end_char": 10875,
      "start_sentence": 482,
      "end_sentence": 543,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.717023372650146,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\太上老君中经珠宫玉历.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "黄精黑填满太仓黄庭中，下至丹田中。 乃念绛官中有一赤人，紫房宫中有五人，太一君在其中，老子、仙人仲成子在左，太和、曲文子在右，明堂官中有玄光玉女，左有黄裳子，右有中黄真人，俱宿卫真人子丹也。 乃复下念玉堂三公，呼曰：司录六丁玉女，削去某甲死籍，令某甲长生。 黑定，乃复念真人子丹在胃管中，祝曰： 玄光玉女，养我真人子丹，服食元黑，饮咽醴泉。 以北斗中极托脾，脾得斗极之精，乃为真人。 第三十七神仙 肺为尚书，肝为兰台，心为太尉公，左肾为司徒公，右肾为司空公，脾为皇后、贵人、夫人，胆为天子、大道君，胃为太仓，太子之府也，吾之舍也，大肠小肠为元梁使者，下元气为大鸿胪，中元气为八十一元士，上元黑为高车使者，通神於上皇。 故肺为玉堂宫，心为绛宫朱雀阙门，肾为北极幽阙玄武掖门，脾为明堂侍中省阁也。 胃为上海，日月之所宿也。 脐为下海，日月更相上下至胃中。 故太初者，元黑之始也，道也，一也。 心上为天。 太始者，为万物之始也，山川也，地也，为肾。 太素者，人之始也，精也，脾也，土也。 上亦有三宫，两目为绛官，两耳为玉堂宫，鼻口为明堂宫。 眉问为郊山，能合三元熙以养其真人小童子，则列然彻视矣。 老君曰：万道众多，但存一念子丹耳。 一，道也。 在紫房宫中者，胆也。 子丹者，吾也。 吾者，正己身也。 道毕此矣。 第三十八神仙 道士炼水银，消沙液、珠玉、八石，以作神丹，服一刀圭，飞升天官。 身常食气，乃得长生神仙。 存神食丹，乃为真人。 真人得道，上佐上皇治。 故真人以水土瞑瞑浩浩，天地溃溃蒙蒙，不知所存藏，万八千岁，乃成天地人。 故真人以土作人，呼吸饮食，从骑伏使，令土不得独处，人不得独存，故言黄土本人之先也。 真人去之，上升九天。 世人无道，下入黄泉。 益土三升，子一作了。 无骨筋。 一本作肋。 故九天丈人有言曰：食於天者，以身报天，上为真人。 神仙戏游。 食於地者，以身报地，下为尸鬼。 食於人者，以身报人，骨毛弃捐。 兆欲为道，勿食飞乌，天之所生，杀之数数，臧子寿年。 人畜食之，可以为厨宰六畜也。 避六丁神，兽类也，勿食。 丁卯兔也，丁丑牛也，丁亥堵也，丁酉鸡也，丁未羊也，丁巳蛇也，此大禁之，六丁神之讳也。 乘黑服丹入室之时，无食生物，禁食五畜肉。 五畜肉者，马牛羊堵狗也。 但得食鸡子、鱼耳。 禁食五辛，臭恶自死之物，慎勿食。 服丹尚可，乘娇禁之。 第三十九神仙 道者，吾也，上上中极君也。 兆常以日出时、日中时、酉时、夜半时，一云日申酉。 上念太极中央太黄星，其精气来下在兆额上眉问止，正赤黄白如日状，以意致之下入口中，咽之，令其气下入绛宫紫房黄庭中，咽之三五而止。 祝曰：皇天上帝，太上道君，曾孙小兆某甲好道，愿得长生。 此吾之气也，吾从此气生。 念之万遍，无止也。 令兆长生，上为真人，云车下迎，飞升天宫，上谒上帝南极老人元光之前。 老君曰：圣人销珠，贤人水玉。 销珠、水玉，其道同法。 销珠者，服日之精。 左目，日也。 水玉者，食月之精。 右目，月也。 被发正偃外，暝目，常念两目中黄精赤气来下入口中，咽之，三九而止。",
      "translated_text": "The yellow essence fills the Great Granary of the Yellow Court, descending into the Cinnabar Field. Then visualize within the Crimson Palace a vermilion person; in the Purple Chamber Palace, five figures—among them the Supreme Unity Lord, with Laozi and the immortal Zhongchengzi to the left, Taihe and Quwenzhi to the right. In the Hall of Light resides the Dark Radiance Jade Maiden, with the Yellow-Robed Youth to her left and the Central Yellow Perfected to her right, all guarding the Perfected Youth Zidan. Next, visualize the Three Dukes of the Jade Hall and invoke: *\"Six Ding Jade Maidens of the Records Office, erase my name from the register of death and grant me long life.\"* When the black essence stabilizes, again visualize the Perfected Youth Zidan within the stomach duct and pray: *\"Dark Radiance Jade Maiden, nourish my Perfected Youth Zidan. Consume the primordial black essence, drink the sweet spring of the Liquor Spring.\"* With the Northern Dipper’s pole star supporting the spleen, the spleen receives the essence of the Dipper’s pole and becomes a Perfected.\n\n**Thirty-Seventh Transcendent**\nThe lungs are the Minister of Works, the liver the Terrace of Orchids, the heart the Grand Commandant, the left kidney the Minister of Education, the right kidney the Minister of Public Works, the spleen the Empress, Noblewoman, and Lady, the gallbladder the Son of Heaven and Great Dao Lord, the stomach the Great Granary—the palace of the Crown Prince, my dwelling. The large and small intestines are the Envoys of the Primordial Beam, the lower primordial qi the Grand Herald, the middle primordial qi the Eighty-One Primordial Scholars, and the upper primordial black essence the High Chariot Envoys, who communicate with the Supreme Sovereign. Thus, the lungs are the Jade Hall Palace, the heart the Crimson Palace and Vermilion Bird Gate, the kidneys the Northern Pole’s Dark Gate and Dark Warrior Side Gate, the spleen the Hall of Light and the Chamberlain’s Pavilion. The stomach is the Upper Sea, where the sun and moon reside. The navel is the Lower Sea, where the sun and moon ascend and descend to the stomach. Therefore, the Great Beginning is the origin of primordial black essence—the Dao, the One. Above the heart is Heaven. The Great Commencement is the origin of the myriad things—mountains and rivers, Earth, the kidneys. The Great Simplicity is the origin of humans—essence, the spleen, Earth. Above, there are also three palaces: the eyes are the Crimson Palace, the ears the Jade Hall Palace, the nose and mouth the Hall of Light. The space between the eyebrows is the Suburban Mountain; by harmonizing the Three Primordials to nurture the Perfected Youth, one’s vision becomes clear and penetrating. Lord Lao said: *\"Though the myriad Dao are numerous, simply preserve the thought of the Youth Zidan.\"* The One is the Dao. That which resides in the Purple Chamber Palace is the gallbladder. The Youth Zidan is the self. The self is the true body. Here the Dao is complete.\n\n**Thirty-Eighth Transcendent**\nWhen Daoists refine mercury to dissolve sands, liquids, pearls, jades, and the Eight Stones into divine elixirs, consuming a single *daogui* allows one to ascend to the celestial palaces. By constantly absorbing qi, one attains long life as a divine immortal. Cultivating spirit and consuming the elixir makes one a Perfected. The Perfected who attain the Dao assist the Supreme Sovereign in governance. Thus, the Perfected, with water and earth, vast and boundless, like the heavens and earth—profound and obscure—know not where they abide, yet after eighteen thousand years, they form Heaven, Earth, and humanity. Therefore, the Perfected use earth to create humans, breathing, eating, riding, and commanding, so that earth does not exist alone, nor humans remain solitary. Thus, it is said that yellow earth is humanity’s origin. The Perfected depart, ascending to the Nine Heavens. The worldly, lacking the Dao, descend into the Yellow Springs. Add three *sheng* of earth—*zi* here means \"complete.\" Without bones or sinews—alternatively, \"ribs.\" Thus, the Nine Heavens’ Venerable One said: *\"Those who feed on Heaven repay Heaven with their bodies, ascending as Perfected, divine immortals at play. Those who feed on Earth repay Earth with their bodies, descending as corpses and ghosts. Those who feed on humans repay humans with their bodies, their bones and hair discarded and abandoned.\"* If you seek the Dao, do not eat flying birds, for they are born of Heaven; killing them repeatedly shortens your lifespan. Humans and livestock may consume them, serving as butchers for the six domestic animals. Avoid the Six Ding spirits—beastly creatures—do not eat them. Ding-mao is the rabbit, Ding-chou the ox, Ding-hai the pig, Ding-you the rooster, Ding-wei the sheep, and Ding-si the snake; these are strictly forbidden, as they are the taboos of the Six Ding spirits. When riding the black essence and ingesting the elixir to enter the chamber, do not eat living beings; abstain from the meat of the five livestock. The five livestock are horses, oxen, sheep, pigs, and dogs. Only consume chicken eggs and fish. Avoid the Five Pungent foods, foul-smelling or self-dead creatures; be cautious not to eat them. Even when ingesting the elixir, these are forbidden during the refinement period.\n\n**Thirty-Ninth Transcendent**\nThe Dao is the self, the Supreme Sovereign of the Uppermost Central Pole. At sunrise, noon, dusk, and midnight—alternatively, at *shen* and *you*—constantly visualize the great yellow star at the center of the Great Ultimate. Its essence descends to rest between your eyebrows, radiant in vermilion, yellow, and white like the sun. With intention, guide it into your mouth and swallow it, allowing its qi to descend into the Crimson Palace, Purple Chamber, and Yellow Court. Swallow it fifteen times and pray: *\"August Heaven, Supreme Lord, and Most High Dao Lord, your humble descendant, [your name], loves the Dao and wishes for long life.\"* This is my qi, from which I was born. Visualize it ten thousand times without ceasing, granting you long life, ascending as a Perfected. Cloud chariots descend to welcome you, flying to the celestial palaces to pay homage before the Supreme Elder of the Southern Pole and the Primordial Radiance. Lord Lao said: *\"The sage dissolves pearls, the worthy refines water-jade. Dissolving pearls and refining water-jade follow the same method.\"* Dissolving pearls means consuming the essence of the sun—your left eye is the sun. Refining water-jade means consuming the essence of the moon—your right eye is the moon. Lie supine with hair unbound, close your eyes, and constantly visualize the yellow essence and vermilion qi from both eyes descending into your mouth. Swallow it twenty-seven times.",
      "overlap_context": "ponding to the celestial stem (or \"spirit\"), the Daoist, dressed in ritual attire within the chamber, faces north and bows twice, saying: *\"August Heaven, Supreme Lord, and Most High Dao Lord, your humble descendant, Wang Jia, loves the Dao and wishes for long life.\"* Before sleeping at night, visualize the essence of the great bright star at the center of the Northern Dipper and the Great Ultimate—pure yellow and black—descending before you, entering your mouth, and swallowing it fifteen times.",
      "start_char": 10875,
      "end_char": 12111,
      "start_sentence": 544,
      "end_sentence": 606,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.31256675720215,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\太上老君中经珠宫玉历.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "令人神明，彻视八方。 食肺之精，常念肺中白气来上出至咽喉，入口中，咽之，三七而止。 令人神明，身生光泽，辟邪致神，玉女侍之，即长生，辟百鬼矣。 常念身中小童子衣绛衣，在心中央。 中央即神明也。 时念心中有紫华盖，下有一人，着赤积大冠，绛单衣，衔箭引弩，愤然而瞋，即能辟兵，役使鬼神矣。 第四十神仙 常思顶中紫云出如车盖，状如火气，文彩五色，上与天连，以意极布之，与天相率下。 念胃中黄气如橘，忽长稍大，身形如日。 念目下元气赤人、黄人，道气行布四肢，登高入日中，登高一作登台。 上至绛宫紫房太一。 祝曰：",
      "translated_text": "\"Granting one divine clarity, penetrating vision in all eight directions. Consume the essence of the lungs: constantly visualize the white qi within the lungs ascending to the throat, entering the mouth, and swallow it twenty-one times. This grants divine clarity, radiant complexion, repels evil, and attracts spirits. Jade maidens attend you, bestowing longevity and warding off all ghosts.\n\nConstantly visualize a youth in crimson robes within your body, dwelling in the heart’s center. The center is where divine clarity resides. At times, visualize a purple canopy within the heart, beneath which stands a figure wearing a red headdress and crimson robes, holding an arrow and drawing a bow, fierce and wrathful—this repels weapons and commands ghosts and spirits.\n\nThe Fortieth Perfected Immortal:\nConstantly envision purple clouds emerging from the crown of the head like a chariot canopy, resembling fiery qi with five-colored patterns, ascending to connect with heaven. With focused intention, guide them to descend in unison with the heavens. Visualize the yellow qi within the stomach like a tangerine, suddenly growing and expanding until the body’s form resembles the sun. Envision the red and yellow persons of primordial qi beneath the eyes, the Dao-qi circulating through the four limbs, ascending high into the sun (or ascending a terrace). Rise to the Crimson Palace, the Purple Chamber, and the Great One.\n\nRecite the incantation:\"",
      "overlap_context": "nce. Lord Lao said: *\"The sage dissolves pearls, the worthy refines water-jade. Dissolving pearls and refining water-jade follow the same method.\"* Dissolving pearls means consuming the essence of the sun—your left eye is the sun. Refining water-jade means consuming the essence of the moon—your right eye is the moon. Lie supine with hair unbound, close your eyes, and constantly visualize the yellow essence and vermilion qi from both eyes descending into your mouth. Swallow it twenty-seven times.",
      "start_char": 12111,
      "end_char": 12359,
      "start_sentence": 607,
      "end_sentence": 618,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.081841230392456,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\太上老君中经珠宫玉历.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "太一北极，敬告诸神，常令魂魄安宁，无离某甲身。 是谓自然无形者也 第四十一神仙 鬼箭十二，可以辟兵。 常思心中十二芝茎，上与肺连。 以意抱之，名曰鬼箭。 兆常行之，五兵自辟，凶恶自亡。 以击四夷，捐伪电光。 但问兵楣、刀戟、金银，天神皆助真也，雷公击鼓也。 太白扬光，白帝持弩，蚩尤辟兵，青龙守门，武夷在庭，胜蛇玄武，主辟凶殃，白兔梼药，蟾赊在傍，太一和剂，彭祖先常＃５。 服一刀圭，面目生光。 身出毛羽，上谒上皇。 此道也，使诸神气与子合同，慎之，勿解殆也。 第四十二神仙 常以庚申之日申时，被发，西南首，申地偃卧，纵体，暝目，念肺正白，润泽光明，中有芝草，茎大如小指，其中空而明，下与心相连。 其中有青赤气上下交通，出心入肺之中。 念之至下，哺时止。 肺者，人之天也。 心者，人之日也。 日气上出如赤丹之精，未尝有之时，人须得此气以生耳。 失此气者，则死矣。 名日自然之道。 道通神灵矣。 第四十三神仙 常念心中赤气如日，内青外黑，三合成德，以应道数。 师曰：常以平旦，念心中正赤如日。 日中有人，着大冠赤啧，衣绛单衣。 兆见之，呼曰：天皇太一君，使某甲长生为真人。 第四十四神仙 还精绛宫之中法：常以月一日、十五日、晦日，以日初出时，被发，束首向日卧，以两手摩两乳问，下至心，九反而止。 柑心言曰：神首神还绛宫，无离己身。 神乎安，居静处，与己言语。 如此三，乃止。 师曰：每摩两乳问者，使气上下通也。 村摩其心，存小童子，此名虚无。 还精绛官者，月三日为之也，神仙之道也。 第四十五神仙 元阳赤人，太一也。 元阳道君，中太一也。 元阳子丹，己吾身也。 元阳玄光玉女，道之母也。 元阳皇人，太一王也。 元阳丹田，藏精宫也。 师曰：元者，气也。 阳者，日也。 当思心中有日，日有赤人，着赤积大冠，衣绛单衣。 次思胆中有太白明星，三光耀而相照。 星上各有一人，衣绛朱衣，冠九德之冠。 道君在中央，左有老子、仲成子，右有太和、曲文子，凡五人，是一也。 次念脾上正黄，中有日，日中有三人，道母玄光玉女在中央，左有黄裳子，右有中黄直。 次念胃管中有真人子丹，坐珠玉之肺上，黄金色云气为帐，玉女小童子侍之。 次念脐中太一，衣五彩朱衣，冠三绛之冠，左青人，右有白人，前有赤人，后有黑人。 次念丹田中有赤气，赤气中有三人，赤人在中央，左有青人，右有黄人，赤气绕之，内青外黑，上白中黄。 念此毕，外有所见，神气来语人也。 第四十六神仙 常念脾中有黄气，升上至口中，咽之，三五而止，即饱矣。 可以辟谷，坐在立亡。 师曰：常思脾中有日，日中有黄金匮，匮中有书，封之以黄玉印，印广三寸，字日威喜。 精而思之，则邪自出。 兆能见而读之，心开目明，即时神仙矣。 第四十七神仙 常思念胃中正白如凝脂，中有黄气，填满太仓，上至口中，咽之即饱。 师曰：胃者，太仓也。 诸神皆就太仓中饮食。 中黄金釜，金饭，玉女小童，主给使之。 故呼日黄裳子，致行厨矣。 第四十八神仙 肾者，元气之根也。 常思肾问白气，上升至头中，下至足心十指之端，周行一身中十二遍而止。 手足皆热，可以不饥、不渴、不寒，令人不老，白发复黑。",
      "translated_text": "The Great One of the Northern Culmen, reverently addressing all gods, constantly ensures the hun and po remain peaceful, never departing from so-and-so’s body. This is called the formless natural state.\n\nThe Forty-First Perfected Immortal:\nTwelve ghost-arrows can repel weapons. Constantly envision twelve stalks of lingzhi within the heart, ascending to connect with the lungs. With focused intention, embrace them—this is called the ghost-arrow. Practitioners who regularly perform this will naturally repel the five weapons, and evil will vanish of itself. Use them to strike the four barbarians, casting away false lightning. Simply inquire of weapon-warding talismans, blades, halberds, gold, and silver—heavenly gods will all aid the true. The Thunder Duke drums, Venus radiates light, the White Emperor draws his crossbow, Chiyou repels weapons, the Azure Dragon guards the gate, the Martial Yi stand in the courtyard, the Victorious Serpent and Dark Warrior dispel misfortune, the White Rabbit pounds medicine, the Toad lingers nearby, the Great One harmonizes the elixir, and Pengzu was ever the first. Consume a knife-tip’s measure, and the face and eyes will radiate light. The body sprouts feathers and plumage, ascending to pay homage to the Supreme Sovereign. This Dao causes all spirit-qi to unite with you—be diligent and do not slacken.\n\nThe Forty-Second Perfected Immortal:\nOn Gengshen days during the shen hour, loosen the hair, lie supine with the head toward the southwest, stretch the body, close the eyes, and envision the lungs as pure white, moist and luminous, containing a stalk of lingzhi as thick as a little finger, hollow and bright within, descending to connect with the heart. Within it, green and red qi ascend and descend, flowing between heart and lungs. Sustain this visualization until the evening hour. The lungs are humanity’s heaven; the heart is humanity’s sun. The sun’s qi ascends like the essence of cinnabar, never ceasing—humans must obtain this qi to live. Losing this qi means death. This is called the Dao of spontaneity. The Dao communicates with the divine.\n\nThe Forty-Third Perfected Immortal:\nConstantly envision the heart’s red qi like the sun, inwardly green and outwardly black, the three combining into virtue to accord with the Dao’s numerology. The master says: At dawn, constantly envision the heart’s true redness like the sun. Within the sun is a person wearing a grand crown and red silk robes. When the practitioner sees this, call out: “Celestial Sovereign Great One, make so-and-so long-lived as a Perfected Immortal.”\n\nThe Forty-Fourth Perfected Immortal:\nThe method of returning essence to the Crimson Palace: On the first, fifteenth, and last days of the month, at sunrise, loosen the hair, bind the head, lie facing the sun, and rub between the breasts with both hands, descending to the heart—repeat nine times and stop. Press the heart and say: “Divine head, divine return to the Crimson Palace, never leave this body.” The spirit will be at peace, dwelling in stillness and speaking with you. Do this thrice and cease. The master says: Rubbing between the breasts allows qi to ascend and descend freely. Rubbing the heart while visualizing a youth—this is called emptiness and non-being. Returning essence to the Crimson Palace is performed on the third day of the month—this is the Dao of spirit immortals.\n\nThe Forty-Fifth Perfected Immortal:\nThe Primordial Yang Red Person is the Great One. The Primordial Yang Dao Lord is the Central Great One. The Primordial Yang Vermilion Child is one’s own body. The Primordial Yang Mysterious Radiance Jade Maiden is the mother of the Dao. The Primordial Yang Sovereign Person is the King of the Great One. The Primordial Yang Cinnabar Field is the palace that stores essence. The master says: *Yuan* means qi; *yang* means the sun. Envision the heart containing a sun, and within the sun a red person wearing a grand crimson crown and red silk robes. Next, envision the gallbladder containing the bright star of Venus, its threefold radiance illuminating all. Above the star is a person wearing crimson robes and a nine-virtue crown. The Dao Lord stands at the center, with Laozi and Zhongchengzi to the left, Taihe and Quwenzhi to the right—five in all, yet one. Next, envision the spleen’s true yellow, containing a sun with three persons: the Dao Mother Mysterious Radiance Jade Maiden at the center, Yellow Robe Child to the left, and Central Yellow Upright to the right. Next, envision the stomach duct containing the Perfected Vermilion Child seated upon a pearl-and-jade lung, with golden qi forming a canopy and jade maidens and youths attending. Next, envision the Great One within the navel, wearing five-colored crimson robes and a three-crimson crown, with a green person to the left, a white person to the right, a red person in front, and a black person behind. Next, envision the Cinnabar Field containing red qi, and within the red qi three persons: a red person at the center, a green person to the left, and a yellow person to the right, the red qi encircling them, inwardly green and outwardly black, white above and yellow within. After completing this visualization, external apparitions may appear, and spirit-qi will come to speak with you.\n\nThe Forty-Sixth Perfected Immortal:\nConstantly envision yellow qi within the spleen ascending to the mouth, swallow it three to five times and cease—this will satiate. It can dispel grains, allowing one to sit in disappearance and stand in vanishing. The master says: Constantly envision the spleen containing a sun, and within the sun a golden coffer sealed with a yellow jade seal three inches wide, inscribed with the characters *Wei Xi*. Focus intently, and evil will depart of itself. If the practitioner can see and read it, the heart will open and the eyes brighten, instantly becoming a spirit immortal.\n\nThe Forty-Seventh Perfected Immortal:\nConstantly envision the stomach’s true white like congealed fat, containing yellow qi filling the Great Granary, ascending to the mouth—swallowing it brings satiety. The master says: The stomach is the Great Granary. All gods come to the Great Granary to eat and drink. Within it is a golden cauldron, golden rice, and jade maidens and youths who serve—thus it is called Yellow Robe Child, summoning the traveling kitchen.\n\nThe Forty-Eighth Perfected Immortal:\nThe kidneys are the root of primordial qi. Constantly envision white qi between the kidneys ascending to the head, descending to the soles of the feet and the tips of the ten toes, circulating throughout the body twelve times before ceasing. When hands and feet grow warm, one can be free from hunger, thirst, and cold, remain ageless, and white hair turn black again.",
      "overlap_context": "ding to connect with heaven. With focused intention, guide them to descend in unison with the heavens. Visualize the yellow qi within the stomach like a tangerine, suddenly growing and expanding until the body’s form resembles the sun. Envision the red and yellow persons of primordial qi beneath the eyes, the Dao-qi circulating through the four limbs, ascending high into the sun (or ascending a terrace). Rise to the Crimson Palace, the Purple Chamber, and the Great One.\n\nRecite the incantation:\"",
      "start_char": 12359,
      "end_char": 13630,
      "start_sentence": 619,
      "end_sentence": 688,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.415139198303223,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\太上老君中经珠宫玉历.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "兆常念行之。 第四十九神仙 常以月朔、望日，思两肾问白气，上顶中，下至足心。 神龟五彩为甲，文若总系。 上有玄光玉女，二公相对坐，前有太一，后有玄冥司录、司命，共议死生人。 精念之，三十息止。 呎曰：司录君，司命君，六丁玉女，削去某死籍，着上生文，此当言长生。 神龟呼吸，吐故纳新，恣意所为。 白龟之神，元气布行，四肢皆温。 人须得肾气，神龟呼吸乃生耳。 常以甲子日及壬子日存行之，即长生矣。 第五十神仙 常以甲午之日日中时，被发，南首，偃外，暝目，念脐下三寸丹田中黄，其气正赤，大如手掌，其外黑，次其外青。 脐上有白气覆之，肺气也。 左有青，右有黄，各大如手掌。 此三者，肝气、脾气、肺气。 师曰：丹田中赤者，太阳气。 其外黑者，太阴气。 次外青者，少阳气。 三合成德，三气守之，即长生矣。 第五十一神仙 心为虚，肾为元。 虚气以清上为天，元气以宁下为地，入於太渊。 故虚气生为呼，元气生为嗡。 心为日，肾为月，脾为斗。 心气下，肾气上，合即为一，布行四肢，不休息。 故心为血，肾为气，合即流行，名曰脉。 脉者，魂魄，人之容也。 魂魄以去，主人寂寂。 故百脉尽，即气绝，气绝即死矣。 是以为道者，不可不存其神，养其根，益其气。 兆汝弩力弩力，将去矣。 真人得道，万八千岁一会。 道士得道，千岁一会。 故作《中经》，以遗后世。 本上皇藏之金匮，道人得，千金勿传出也。 第五十二神仙 三元之日会合於己亥。 三元者，太一、太阴、宫气是也。 三元俱起己亥。 太一左行，岁一辰。 害气右行，四孟，岁行一孟。 太阴右行，三岁一辰，九年行方，四九三十六年。 三元俱合於亥。 三合之岁，水旱兵饥，灾害并起。 三合之岁，阴阳隔并，感天动地，害气流行，昼行则伤谷，中有人即疾疫，中谷即饥贵。 兆汝居其问，不能自生也。 可不弩力勉时学道哉！ ．当期之世，水旱蝗虫，五谷饥贵，兵革并起，人民疾疫，道路不通，负老提幼，散流他方，其父母妻子兄弟，一及气内发，摧肝绝肠，略为奴婢，不知县乡。 於期乃欲学道，岂不晚哉，岂不晚哉。 吾深戒子，存神作丹，早自防，即遭乱世，远去深藏。 圣主明世，道可照而行也。 故天地之会，四十五岁一小贵，九十岁一小饥，一百八十岁一大贵，三百六十岁一大饥。 五百岁，贤者一小聚＃６，千岁，圣人一小聚，三千六百岁，圣大会。 万八千岁，真人一小出治。 三万六千岁，至极仙人一出治，三百六十万岁，天地一大合。 元气淇津，蒙鸿元形，人为万物，不知束西南北。 人化为禽兽，禽兽化为人。 真人乃在元气之上，仙人乃在绝域无崖之际，道人隐居，可以贵重也。 第五十三神仙 天都京兆，合在勾陈之左端，号日安德君，主与天太一北君共算计说诸神，主人魂魄，会於南极。 有录者延寿，众神共举之。 无录者终矣，司命绝去＃７之人，魂魄会於北极。 有功德於人、天地、万物者，子孙富贵、寿考、鲜明，身得封侯，复出为人。 无德者有三：一曰残贼酷虐，害逆天地四时； 二曰呎诅、嫉拓、淫泱，慢易天地神灵； 三日不孝不忠，盗窃阴贼，推埋杀人。 犯此三者，子孙绝灭。 人生自有三命，至聚＃８妇嫁女，复定其一命。",
      "translated_text": "The adept should constantly practice this.\n\nThe Forty-Ninth Perfected Immortal:\nOn the new and full moons, envision white qi between the kidneys ascending to the crown of the head and descending to the soles of the feet. The divine tortoise’s five-colored shell bears patterns like intertwined cords. Above it sits the Jade Maiden of Mystic Radiance, with two elders facing each other. Before them stands the Great One, and behind them, the Dark Obscurity, the Registrar, and the Lord of Destiny, who together deliberate over the life and death of humans. Focus the essence of this vision for thirty breaths before ceasing.\n\nRecite: \"Lord Registrar, Lord of Destiny, Six Ding Jade Maidens—erase my name from the register of death and inscribe it in the record of life. This is what is meant by longevity.\" The divine tortoise breathes, exhaling the old and inhaling the new, acting as it pleases. The spirit of the white tortoise spreads primordial qi, warming the four limbs. Humans must obtain kidney qi, for only through the divine tortoise’s breath does life arise. Practice this on *jiǎzǐ* and *rénzǐ* days, and you will attain longevity.\n\nThe Fiftieth Perfected Immortal:\nOn *jiǎwǔ* days at noon, let your hair down, lie facing south with eyes closed, and visualize within the cinnabar field three inches below the navel a yellow qi, its core a true red the size of a palm, surrounded by black, and beyond that, green. Above the navel, white qi covers it—this is the qi of the lungs. To the left is green qi, to the right yellow qi, each the size of a palm. These three are the qi of the liver, spleen, and lungs.\n\nThe master says: The red within the cinnabar field is the qi of Greater Yang. The black surrounding it is the qi of Greater Yin. The green beyond is the qi of Lesser Yang. When the Three Powers unite in virtue and the Three Qi guard them, one attains longevity.\n\nThe Fifty-First Perfected Immortal:\nThe heart is emptiness; the kidneys are the root. The qi of emptiness ascends, clear, to become heaven; the qi of the root descends, tranquil, to become earth, entering the Great Abyss. Thus, the qi of emptiness generates exhalation, and the qi of the root generates inhalation. The heart is the sun; the kidneys are the moon; the spleen is the Dipper. When the qi of the heart descends and the qi of the kidneys ascends, they unite as one, spreading through the four limbs without cease. Thus, the heart governs blood, the kidneys govern qi, and their union creates circulation—this is called the vessels. The vessels are the dwelling of the hun and po souls, the countenance of humans. When the hun and po depart, the master becomes still. When all vessels are exhausted, qi ceases, and with its cessation, death follows.\n\nTherefore, those who pursue the Dao must not fail to preserve their spirit, nourish their root, and augment their qi. Adept, strive with all your might, for I shall soon depart. When a Perfected One attains the Dao, they meet once every eighteen thousand years. When a Daoist attains the Dao, they meet once every thousand years. Thus, I compose *The Central Scripture* to bequeath to later generations. Originally hidden in the Golden Casket of the Supreme Sovereign, when a Daoist obtains it, it is worth a thousand gold pieces—do not transmit it lightly.\n\nThe Fifty-Second Perfected Immortal:\nThe Three Origins converge on *jǐhài* days. The Three Origins are the Great One, Greater Yin, and Palace Qi. All three arise on *jǐhài*. The Great One moves left, advancing one celestial stem per year. Harmful qi moves right, passing through the four first months of the seasons, one per year. Greater Yin moves right, advancing one celestial stem every three years, completing a cycle in nine years, and a full revolution in thirty-six years. When the Three Origins converge on *hài*, floods, droughts, warfare, and famine arise, and disasters strike together.\n\nIn years when the Three Origins converge, yin and yang are blocked and disordered, shaking heaven and earth. Harmful qi spreads—when it moves by day, it damages crops; when it strikes people, epidemics arise; when it strikes grain, famine and scarcity follow. If you dwell in such times, you cannot survive on your own. How can you not strive with all your might to study the Dao in due time?\n\nIn this destined age, floods, droughts, locusts, and crop failures will bring famine and scarcity. Warfare will erupt, people will suffer epidemics, roads will be impassable, and the old and young will scatter, fleeing to other lands. When the calamity strikes, parents, wives, children, and siblings will be torn apart, their livers shattered and bowels severed. Some will be reduced to slavery, not knowing their own county or village. If you only seek to study the Dao then, is it not too late? Is it not too late?\n\nI deeply warn you: preserve your spirit and refine the elixir. Prepare early, and when chaos comes, flee far and hide deeply. In the age of a sagely and enlightened ruler, the Dao may be practiced openly. Thus, the conjunctions of heaven and earth occur: a minor scarcity every forty-five years, a minor famine every ninety years, a great scarcity every one hundred eighty years, and a great famine every three hundred sixty years. Every five hundred years, the worthy gather in small numbers; every thousand years, sages gather in small numbers; every thirty-six hundred years, sages convene in great assembly. Every eighteen thousand years, a Perfected One emerges to govern briefly. Every thirty-six thousand years, a Supreme Immortal emerges to govern; every three million six hundred thousand years, heaven and earth undergo a great conjunction.\n\nPrimordial qi surges like a flood, and the Great Beginning takes form. Humans become one of the myriad things, unaware of east, west, south, or north. Humans transform into birds and beasts, and birds and beasts transform into humans. Perfected Ones dwell above primordial qi, while Immortals reside at the edge of the boundless. Daoists who retreat into seclusion may yet attain honor and esteem.\n\nThe Fifty-Third Perfected Immortal:\nThe Heavenly Capital of the Capital Prefecture lies at the left tip of the Curved Array, named Lord An De. He, together with the Northern Lord of the Great One of Heaven, calculates and discusses the affairs of all spirits, governing the hun and po souls, which assemble at the Southern Culmen. Those whose names are recorded in the registers have their lives extended, and all spirits support them. Those whose names are not recorded meet their end—the Lord of Destiny severs their fate, and their hun and po souls assemble at the Northern Culmen.\n\nThose who have performed meritorious deeds for humans, heaven, earth, and the myriad things will see their descendants prosper, live long, and enjoy clarity and brilliance. Their bodies may be enfeoffed as marquises, and they may be reborn as humans. Those lacking virtue fall into three categories:\nFirst, those who are cruel, oppressive, and tyrannical, harming heaven, earth, and the four seasons;\nSecond, those who curse, envy, indulge in licentiousness, and show contempt for heaven, earth, and the gods;\nThird, those who are unfilial, disloyal, thieving, treacherous, or who bury and kill others.\n\nThose who commit these three transgressions will see their descendants cut off. Humans are born with three destinies, and when they marry or give their daughters in marriage, one more destiny is determined.",
      "overlap_context": "ns and youths who serve—thus it is called Yellow Robe Child, summoning the traveling kitchen.\n\nThe Forty-Eighth Perfected Immortal:\nThe kidneys are the root of primordial qi. Constantly envision white qi between the kidneys ascending to the head, descending to the soles of the feet and the tips of the ten toes, circulating throughout the body twelve times before ceasing. When hands and feet grow warm, one can be free from hunger, thirst, and cold, remain ageless, and white hair turn black again.",
      "start_char": 13630,
      "end_char": 14873,
      "start_sentence": 689,
      "end_sentence": 757,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.55335259437561,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\太上老君中经珠宫玉历.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "移徒葬埋，复定其一命。 得吉身者，寿考，子孙富贵。 得凶者死，子孙贫困屯。 汝居世问，当何着于天地？ 神可畏也。 故天置日月、北斗、二十八宿，五星主之，六甲六丁诸神主行民问。 兆汝不知，汝甚可畏之。 常复有邪鬼精魅，至於家鬼，不祥里社，水土公司命门户、井宠、清涵、太阴水渎，皆能杀人者。 兆汝欲却邪辟鬼，当被符，次服神药。 符者，天地之信也。 药者，人之丹也，益其气力，身轻坚强，即邪气官鬼不能中人也，即成神仙矣。 鬼者，神之使也。 鬼见天信，即去矣。 人亦有之，京兆舍中极乡游玑里，夏里黄公，字德皇，正在脐中央，太一是也。 一名玉灵子，衣五彩朱衣，总阅黄神。 常以八月秋分之日，案比计等。 常先之一日，后之一日，正节之日，凡三日，入室勿出。 常以鸡呜时思之，平日一召说之，至日禺中时止。 为之三日。 被发，西北向，偃外，纵体，无令他人见之，豫敕家中人无得有声。 先斋戒沐浴，至其日，入静室中，安心自定，先祝之曰：曾孙小兆某甲好道，愿得长生。 今日秋分之日，天帝使者夏里黄公来下入吾身中，案比总阅，诸神不得通亡，皆当来会。 从上三呼之，比为之‘，日三呼之，三日九呼之，日中乃止。 即言曰：司录六丁玉女，削去某死籍，更着某长生神仙玉历，急急如律令。 即日有天帝无极君，教自应曰：诺。 下林回向再拜，谢天神。 一身道毕此矣。 第五十四神仙 子欲知真人、仙人何类，仙人衣搽衣，生毛羽，真人无影，衣五彩朱衣。 其居无常处，束春，南夏，西秋，北冬，浮游名山昆仑、蓬莱、大郢、九域之上，时上谒上皇。 故真人得道，八千万岁。 乘珠玉云气之车，驾无极之马，时乘六飞龙，佐上皇治。 中仙之士，中天而上，乘云往来，历越海江。 下仙之士，法当尸解，晦日朝会拜礼，不得懈息，当为神使。 道非有所异也，但有尊车之故耳。 故百岁之人黄头发，三百岁之人两权起，三百岁之人，万物耳。 四百岁之人，面纵理，五百岁之人，方瞳子，六百岁之人，胁助胼，七百岁之人，骨体填，八百岁之人，殇为筋，九百岁之人，延耳生，千岁之人，飞上天，上谒上皇太一为仙。 真人重瞳子，故能彻视八方。 食芝服丹，即不老。 人万八千岁更为童子，男八女七，从此始。 第五十五神仙 子欲制百邪百鬼及老精魅，常持符、利剑、亭水瓷上，’於中视其形影。 凡行出入，卒逢非常怪物，於日月光中视其形影，皆可知也。 以丹书制百邪符，置于瓷水上，邪鬼见之，皆自然消去矣。 诸邪鬼魅，龙蛇、虎豹、六畜、狐狸、鱼鲈龟、飞乌、磨鹿、老木，皆能为精物。 犯人者，符刻之，斩之，付河伯、社令。 当召今日直符使，六丁神守之宿卫。 左文字，在八十一首玄图六甲宫四十九真中。 亦有珠胎七机，华盖清观，皆能制百邪。 此四符者，恶秽人不可服也。 当被服威喜、巨胜、左契、右射、太极、太清、太玄、阳章、参天、包元气、太虚，此太道也。 可常被服，无所不防，亦无禁忌也。 上制文曰：皇天上帝，太上道君、曾孙小兆王甲好道，愿得长生，所愿从心来，自在心也，不多言。 上封文曰：皇天上帝、太上道君，天一、太一、北千＃９君、日月阴阳君、司命君、司录君，曾孙小兆王甲好道，愿得长生，唯司命司录君能去死籍，更着长生玉历仙籍，定为真人。",
      "translated_text": "When relocating graves or conducting burials, another destiny is determined. Those who secure an auspicious site will live long, and their descendants will prosper. Those who secure an inauspicious site will die, and their descendants will suffer poverty and hardship.\n\nHow, then, do you stand before heaven and earth in this world? The gods are to be feared. Thus, heaven has set the sun and moon, the Northern Dipper, the twenty-eight constellations, and the five planets to govern, while the Six Jia and Six Ding spirits, along with all other deities, oversee the affairs of the people. If you remain ignorant of this, you should indeed fear them.\n\nMoreover, malevolent ghosts, spectral beings, ancestral spirits, inauspicious village deities, the earth and water spirits who control life, the gatekeepers of households, well spirits, the pure and profound, the Taiyin waterways—all these can kill. If you wish to repel evil and ward off ghosts, you must wear talismans and then ingest divine medicines. Talismans are the pledges of heaven and earth. Medicines are the cinnabar of humans, strengthening qi and vitality, lightening the body, and fortifying it. Then, evil qi and spectral beings cannot harm you, and you will become an immortal.\n\nGhosts are the messengers of the gods. When they see the pledge of heaven, they depart. Humans also possess this—within the dwellings of the capital’s outskirts, in the wandering hamlet of Youji, there is the Summer Official, the Yellow Elder, styled Dehuang, residing at the center of the navel. This is the Great One, also called the Jade Spirit Child, clad in five-colored vermilion robes, overseeing the Yellow Gods. On the day of the autumn equinox, he conducts his review and reckoning.\n\nFor three days—one day before, the day of, and one day after the equinox—you must remain secluded indoors. At cock’s crow, contemplate him, and from dawn until midday, invoke him thrice daily for three days, totaling nine invocations. Lie with your hair unbound, facing northwest, body relaxed, ensuring no one sees you. Instruct your household to remain silent. First, purify yourself through fasting and bathing. On the appointed day, enter a quiet chamber, calm your mind, and settle your spirit. Begin with this prayer:\n\n*\"Great-grandson, humble initiate [your name], devoted to the Dao, wishes for longevity. On this autumn equinox, may the Heavenly Emperor’s messenger, the Summer Official Yellow Elder, descend into my body to conduct his review and reckoning. May all spirits assemble without fail.\"*\n\nInvoke him thrice from above, repeating this three times daily for three days, ceasing at midday. Then declare:\n\n*\"Recorder of the Six Ding Jade Maidens, erase my name from the register of death and inscribe it in the jade records of long-life immortals. Hasten, as decreed by the statutes!\"*\n\nOn that day, the Heavenly Emperor’s Boundless Lord will respond: *\"So be it.\"* Bow twice toward the grove, prostrating in gratitude to the celestial gods. Thus, the Dao is fulfilled within you.\n\n---\n\n**Fifty-Fourth: Immortals**\nIf you wish to know the types of perfected ones and immortals: Immortals wear feathered robes and grow plumage, while perfected ones cast no shadow and don their five-colored vermilion garments. Their dwellings are not fixed—they roam east in spring, south in summer, west in autumn, and north in winter, drifting above famous mountains like Kunlun, Penglai, and Dayi, or the Nine Regions, occasionally ascending to pay homage to the Supreme August One.\n\nThus, perfected ones who attain the Dao live for eighty million years. They ride chariots of pearl, jade, and cloud qi, drawn by boundless horses, sometimes harnessing six flying dragons to assist the Supreme August One in governance. Middle immortals ascend to the middle heavens, traveling on clouds across seas and rivers. Lesser immortals undergo liberation through simulated death; on dark moons, they gather for rites and must not slacken, for they serve as divine messengers.\n\nThe Dao is not inherently different—only the rank of their conveyances sets them apart. Thus, those who live a hundred years develop yellow hair; at three hundred, their temples rise; at four hundred, their faces show vertical lines; at five hundred, their pupils become square; at six hundred, their ribs thicken; at seven hundred, their bones fill out; at eight hundred, their sinews transform; at nine hundred, their ears elongate; and at a thousand, they ascend to heaven to pay homage to the Supreme August One and the Great One as immortals. Perfected ones have double pupils, enabling them to see clearly in all eight directions. Consuming mushrooms and elixirs prevents aging. After eighteen thousand years, humans revert to childhood—males at eight, females at seven—beginning anew.\n\n---\n\n**Fifty-Fifth: Immortals**\nTo subdue the hundred evils, the hundred ghosts, and ancient spectral beings, always carry talismans, a sharp sword, and a jar of water. Observe their reflections within. In all your comings and goings, if you suddenly encounter strange apparitions, examine their forms in the light of the sun or moon to discern them.\n\nUse cinnabar to inscribe talismans for subduing the hundred evils, placing them upon the water’s surface. When evil ghosts see them, they will naturally dissipate. All manner of spectral beings—dragons, snakes, tigers, leopards, the six livestock, foxes, fish, perch, turtles, flying birds, elk, deer, and ancient trees—can become spirits. If they harm humans, inscribe talismans to sever them and consign them to the River Earl and the Village Deity. Summon the current day’s talisman-bearing messenger, guarded by the Six Ding spirits for protection.\n\nThe left script resides within the *Eighty-One Mysterious Diagrams of the Six Jia Palaces and the Forty-Nine Perfected Ones*. There are also the *Seven Mechanisms of the Pearl Womb*, the *Canopy of Floral Brilliance*, and the *Pure Contemplation*—all capable of subduing the hundred evils. These four talismans must not be worn by the impure.\n\nInstead, wear the *Majestic Joy*, *Giant Victory*, *Left Contract*, *Right Archer*, *Great Ultimate*, *Great Clarity*, *Great Mystery*, *Yang Chapter*, *Participating in Heaven*, *Enveloping Primordial Qi*, and *Great Void*—these are the supreme Dao. Wear them always, and nothing will be beyond defense, nor will there be any prohibitions.\n\nThe upper inscription reads:\n*\"August Heavenly Emperor, Supreme Dao Lord, great-grandson humble initiate Wang [your name], devoted to the Dao, wishes for longevity. May all desires arise from the heart, residing naturally within, without excess words.\"*\n\nThe sealed inscription reads:\n*\"August Heavenly Emperor, Supreme Dao Lord, Heavenly One, Great One, Northern Thousand Lords, Sun and Moon Yin-Yang Lords, Life Controller Lord, Record Keeper Lord, great-grandson humble initiate Wang [your name], devoted to the Dao, wishes for longevity. Only the Life Controller and Record Keeper Lords can erase the register of death and inscribe the jade records of long-life immortals, designating me as a perfected one. Hasten, as decreed by the statutes!\"*",
      "overlap_context": "se who are cruel, oppressive, and tyrannical, harming heaven, earth, and the four seasons;\nSecond, those who curse, envy, indulge in licentiousness, and show contempt for heaven, earth, and the gods;\nThird, those who are unfilial, disloyal, thieving, treacherous, or who bury and kill others.\n\nThose who commit these three transgressions will see their descendants cut off. Humans are born with three destinies, and when they marry or give their daughters in marriage, one more destiny is determined.",
      "start_char": 14873,
      "end_char": 16138,
      "start_sentence": 758,
      "end_sentence": 811,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.136043071746826,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\太上老君中经珠宫玉历.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "臣某即日除为太一使者，再拜受命上皇道君、中黄门子，再拜着契封符传。 当清洁先解过。 常以岁四时除日及八节之日，以酒脯於束流水上解过，南流亦可。 神仙玄图曰：玉历五十五章，姓名符信本在上皇金匮玉岌玉笋中，封之力重。 兆得之，慎勿妄传。 子慎之，勿受钱之，得其人即传之，可得神仙。 吾时时自案行此二篇上下《中经》也。 吾常使司命教鬼守汝，勿妄增臧吾文。 一字不具，吾即知之，兆汝慎之，慎之。 如吾言符与下字，以丹青之，此吾之信也。 兆汝审欲神仙，当先服还丹金液，存神，即时仙矣，上为真人。 兆汝不服神丹金液，当自苦耳，为寒温风鬼所击，司命不救汝也，道神无奈汝何。 兆为道，温衣适食，守虚无，为自然，鬼亦不能救杀也。 年寿终竟，自死矣。 何以言之？ 以其不坚守神故也。 譬犹万物之生，非欲求死，但自然老枯槁腐死，其人亦如此矣。 吾以喻汝，弩力求师，吾教八十一弟皆仙，其十人布在民间，游邀谷仙。 吾越度秦项不出，为汉出，合於黄世，见吾大吉。 太上老君中经卷下竟 ＃１『何』，《云笈七签》本作『河』。 ＃２『日』，原缺，据《云笈七签》本补。 ＃３『肺』，原作『肝』，据《云笈七签》本改。 ＃４『强』，《云笈七签》本作『狂』。 ＃５『常』，《云笈七签》本作『当』。 ＃６『聚』，原缺，据文义补。 ＃７『去』，原作『云』，据《云笈七签》本改。 ＃８『聚』，《云笈七签》本作『娶』。 ＃９『千』，《云笈七签》本作『斗』。",
      "translated_text": "Your humble servant [your name] is hereby appointed as the Messenger of the Great One. Bowing twice, I receive the mandate from the Supreme August Dao Lord and the Yellow Court Youth. Bowing twice again, I inscribe the covenant, seal the talisman, and transmit it.\n\nFirst, purify yourself and dissolve past transgressions. Regularly, on the days of seasonal renewal and the eight solar terms, offer wine and dried meat upon the waters of an eastward-flowing stream to dissolve transgressions—southward-flowing waters are also acceptable.\n\nThe *Mysterious Charts of Divine Immortals* states: The fifty-five chapters of the Jade Register, along with the name-tally and authenticating tokens, are stored within the Golden Coffer, Jade Pedestal, and Jade Bamboo Case of the Supreme August One. The sealing power is weighty. Should you obtain these, guard them carefully and do not transmit them recklessly. Be cautious, my disciple, and do not accept payment for them. Transmit them only to the worthy, and you may attain divine immortality.\n\nI frequently examine these two scrolls of the *Central Scripture* myself. I have commanded the Life Controller to dispatch spirits to guard you. Do not recklessly alter or conceal my texts. Should even a single character be missing, I will know. Be vigilant, my disciple, be vigilant.\n\nFollow my words precisely when inscribing talismans and characters, using cinnabar and ink—this is my authenticating mark. If you truly desire divine immortality, first ingest the Returned Elixir and Golden Fluid, cultivate spirit, and you will immediately ascend as an immortal, becoming a perfected one.\n\nIf you do not ingest the divine elixir and golden fluid, you will suffer hardship, struck by cold, heat, and malevolent winds, and the Life Controller will not save you. The Dao spirits will be powerless to aid you. If you practice the Dao, wear warm clothing, eat suitably, abide in emptiness, and follow nature, even ghosts will be unable to harm you. Yet if your years reach their end, you will die naturally.\n\nWhy is this so? Because you have not steadfastly guarded the spirit. It is like the growth of the myriad things—they do not seek death, yet naturally wither, decay, and perish. You are no different.\n\nI offer this analogy: seek a master with the urgency of a crossbow’s tension. Of my eighty-one disciples, all became immortals; ten now wander among the people as reclusive valley immortals. I did not emerge to deliver Qin or Xiang, but appeared for the Han, aligning with the Yellow Epoch. This is my great fortune.\n\nHere ends the lower scroll of the *Central Scripture* of the Supreme Venerable Lord.",
      "overlap_context": "s.\"*\n\nThe sealed inscription reads:\n*\"August Heavenly Emperor, Supreme Dao Lord, Heavenly One, Great One, Northern Thousand Lords, Sun and Moon Yin-Yang Lords, Life Controller Lord, Record Keeper Lord, great-grandson humble initiate Wang [your name], devoted to the Dao, wishes for longevity. Only the Life Controller and Record Keeper Lords can erase the register of death and inscribe the jade records of long-life immortals, designating me as a perfected one. Hasten, as decreed by the statutes!\"*",
      "start_char": 16138,
      "end_char": 16742,
      "start_sentence": 812,
      "end_sentence": 840,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.155939102172852,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\太上老君中经珠宫玉历.txt",
        "category": "正统道藏太清部"
      }
    }
  ]
}