{
  "source_id": "太上洞玄灵宝五显观华光本行妙经",
  "source_file": "chunked_daozang\\太上洞玄灵宝五显观华光本行妙经.json",
  "total_chunks": 3,
  "total_original_chars": 3430,
  "total_translated_chars": 21784,
  "total_translation_time": 108.5557427406311,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏续道藏\\太上洞玄灵宝五显观华光本行妙经.txt",
    "category": "正统道藏续道藏"
  },
  "full_translation": "**The Marvelous Scripture of the Original Conduct of Hua Guang, the Five Manifestations of Lingguan from the Cavernous Mystery of the Numinous Treasure**\n\nAt that time, the Celestial Venerable of Original Commencement, during the dawn of the Crimson Clarity Kalpa, resided in the Jade Purity Sagely Realm of the Clear Tenuity Heaven within the Great Brahma Heaven. Seated upon the Ninefold Dragon-Phoenix Throne in the Palace of Ninefold Primordial Yang Radiance, he was accompanied by the Jade Dawn Dao Lord, the Supreme Elder Lord of Mysterious Origin, and the Divine Sovereigns of all Heavens. Nine-tiered numinous banners and feathered canopies draped around them, while jade lads and maidens scattered celestial incense and precious blossoms, suffusing the ten directions.\n\nThen, nine phoenixes sang in unison, eight simurghs cried in harmony, celestial music resounded spontaneously, and numinous phoenixes gathered in mist. Lions and white cranes roared and chanted in melodious chorus, the heavens free of defilement, mountains veiled in clouds.\n\nThe Celestial Venerable of Original Commencement manifested his divine and wondrous power, casting nine-colored auspicious radiance. The Mysterious Capital of the Celestial Palace shone resplendently, its light descending to illumine the boundless worlds of the ten directions, all assuming a single aspect—clear as lapis lazuli, penetrating without obstruction, distinct within and without.\n\nThe Flying Heavenly Divine Kings and Supreme Great Spirits of the ten boundless directions assembled as one. Then, the Azure Emperor of the Nine Qi of the East, with his innumerable attendant perfected numinous officials, arrived floating through the void. The Vermilion Emperor of the Three Qi of the South, with his innumerable attendant perfected numinous officials, arrived floating through the void. The White Emperor of the Seven Qi of the West, with his innumerable attendant perfected numinous officials, arrived floating through the void. The Black Emperor of the Five Qi of the North, with his innumerable attendant perfected numinous officials, arrived floating through the void. The Yellow Emperor of the One Qi of the Center, with his innumerable attendant perfected numinous officials, arrived floating through the void.\n\nGathering at the Dharma assembly, they bowed in reverence and listened as the Celestial Venerable of Original Commencement expounded the wondrous Dharma of the Supreme Mysterious Primordial True One. The divine immortals of all heavens circumambulated in void-stepping procession, while the three realms’ attendants joined in unison to praise and chant.\n\nAt this moment, joy and celebration were beyond words. The gates of darkness opened anew, all receiving illumination. The suffering souls of the netherworld were liberated in that instant.\n\nThen, from the assembly emerged the Perfected of Longevity and Salvation, the Perfected of Myriad Blessings and Love for Life, and the Perfected of Compassionate Universal Salvation. Adjusting their sashes and holding tablets, they bowed and addressed the Celestial Venerable:\n\n“O Celestial Venerable of Great Compassion, Celestial Venerable of Great Sagacity, who first opened heaven and earth, who governs the revolutions of yin and yang, teacher of all numinous beings, father of all living creatures—we, by virtue of past karmic blessings, have been privileged to attend upon the Perfected. Though unworthy, we stand among the ranks of the true. Today, we have been granted the fortune to join this grand assembly, to reverently listen to the Dharma’s sound, to expound the profound mystery, and to receive enlightenment—an immeasurable grace.\n\nWe have observed that in the world below, demonic spirits run rampant, harming the people. The three disasters arise in competition, the five poisons spread unchecked, and calamities of flood, fire, blade, and warfare, along with famine and plague, cause countless deaths. This is most pitiable. We know not by what karmic causes they suffer such afflictions.\n\nWe humbly beseech the Celestial Venerable, whose benevolence and kindness extend to all, to open the gate of vast deliverance and broadly bestow the transformation of compassion.”\n\nThe Celestial Venerable replied: “Compose your thoughts and concentrate your sincerity. I shall expound for you the karmic causes of good and evil.”\n\nAfter a long pause, he continued: “In the Upper Kalpa, people were simple and unadorned, their bodies one with heaven and earth. They cultivated only the Dao, teaching and transforming living beings to return to the true path. Unmoved by external things, their minds were expansive and their forms at ease. Unharmed, they fulfilled their allotted lifespans.\n\nThe people of the Middle Kalpa were endowed with humility, harmony, and generosity. They practiced the virtues of kindness, benevolence, warmth, and goodness, aiding orphans and widows, relieving the hungry and poor. They placed others before themselves and diligently performed acts of convenience.\n\nThe people of the Lower Kalpa, born into the world, persist in evil without repentance, neglecting virtuous conduct. The Dao and virtue have long been abandoned; benevolence and righteousness are no longer practiced. They disrespect heaven and earth, pay no reverence to the Three Luminaries, fear no divine spirits, are unfilial to parents, disloyal to rulers, and unmindful of their teachers. They follow perverse views, forget their origins, harm beings, deceive their own hearts, and betray the Dao. Greedy and insatiable, they accumulate evil and incur transgressions, indulging the six senses without restraint.\n\nThe Youths of Good and Evil, the Four Upright Merit Recorders, and the Investigating Messengers record their sins and report them day and night to the celestial court. Thus, the Three Officials wield their brushes, the Five Emperors examine the records, erasing names from the Azure Register and inscribing them in the Black Book. Thereupon, the Directors of Destiny, Records, Merit, and Execution reduce their allotted years and lifespans.\n\nSome, while still alive, suffer prolonged misfortune due to perverse intentions, thwarted plans, and endless frustrations. Epidemics spread, causing many premature deaths. Others, after their lives have ended, sink into the Nine Dark Hells of the Underworld, devoid of virtuous thoughts, unable to escape the gates of darkness. All these karmic causes arise from the mind.”\n\nUpon hearing these words, the perfected ones were filled with sorrow and compassion. Bowing again, they addressed the Celestial Venerable: “We wish to rely upon the power of your compassionate majesty and radiance, to divide our bodies and descend into the human realm to save living beings. May men and women dwell in peace, free from perverse misfortune, enjoying wealth, honor, and longevity, untouched by calamity. May demonic spirits vanish in concealment, the Dao’s transformation daily manifest, rulers be enlightened and ministers virtuous, the nation’s destiny endure, weapons be laid aside, the world know peace, the seasons harmonious, the years abundant, and all people delight in their livelihoods. We humbly implore the Celestial Venerable to grant this aspiration.”\n\nThe Celestial Venerable replied: “You now wish to benefit the living beings of the latter age, raising timely questions and making such vows—excellent, excellent! All things are born of me; all spirits are transformed by me. To save living beings is indeed as it should be. Yet there is no need for your true and ardent efforts. Compose your thoughts and hold this in your hearts. I shall now expound for you the gate of benefiting and saving living beings.”\n\nThe Celestial Venerable said: “Within the Three Heavens’ realms dwell the Divine Officials and Great Saints, the Five Celestial Marshals of Splendent Radiance. They have made vast and solemn vows to save and deliver living beings, subdue and tame the hordes of demons, and propagate the transformations of the Dao. Their majesty and numinous power blaze forth, their merit and virtue towering high. They unite with the Dao in truth, delivering countless souls. Responding to cries for aid, they hasten to succor the distressed and sustain the failing. No prayer goes unanswered; they prolong life and bestow blessings.\n\nAt times they manifest as a single body, at others they display five aspects. They may transform into the Heavenly Emperors of the various heavens, or into the bodies of Brahmā Kings. They may appear as the Auspicious Tathāgata, or as the Lord of Sun and Dew, or as the Bodhisattva of Splendent Radiance, or as the Heavenly Soldiers and Mightiest Warriors, or as the Perfected of Wondrous Conduct. Through these manifold divine powers, they adapt to circumstances and convert and deliver living beings.”\n\nThe Perfected One further inquired: “By what karmic conditions do these Divine Observers and Great Saints hold the rank of Celestial Marshals and manifest the wondrous forms of their divine powers in the ten directions?”\n\nThe Celestial Venerable replied: “These Five Celestial Marshals of the Divine Observer are endowed with the essence of the Five Stars and the qi of the Five Phases. They nurture the finest spirits of the Five Directions, transform their bodies throughout the Three Realms, and respond and appear in the ten directions. They hold authority over the weal and woe of the Three Realms and wield the handle of life and death for all things. Fortune and misfortune, regret and shame—all are shaped by their molding. Should anyone but once invoke their names, saying, ‘Divine Observer, Great Saint, Celestial Lord Hua Guang of Vast Transformation,’ know that their divine powers will instantly manifest, fulfilling the heart’s desire as surely as a shadow follows form or an echo answers sound. The response is luminous and unfailing, beyond all measure.”\n\nThe Perfected One again inquired: “Reverently considering the Celestial Venerable’s virtue of cherishing life, whose blessings extend to the Three Paths and whose grace moistens the ten thousand kinds, who bestows fortune upon gods and humans and serves as the bridge for delivering people, who opens the path to returning to truth—we humbly beseech you to issue a sacred decree, dispatching them to the human realm to bless the nation and pacify the people, and to proclaim the mysterious transformations.”\n\nThereupon, the Celestial Venerable inscribed golden tablets and jade talismans, sending the Golden Youths and Jade Maidens to summon the Five Celestial Marshals of the Divine Observer. In an instant, the Five Celestial Marshals of the Divine Observer arrived reverently at the Dharma assembly, kneeling long before the Dao.\n\nThey addressed the Celestial Venerable, saying: “We, your servants, have been nurtured by your life-giving grace and unworthily occupy the ranks of the Perfected. Today, on this great and joyous occasion, we have been specially summoned by decree and have come to this jeweled pavilion, where we gaze upon your celestial countenance and listen to the proclamation of the wondrous Dharma.”\n\nThe Celestial Venerable said: “Among the men and women of the world, many do not revere the true transformations. They commit evil and do not repent, taking deceit as their fundamental nature and greed as their conduct. They indulge their passions and desires, turning their backs on the true and inclining toward the perverse. They accumulate all manner of karmic roots of sin, unaware of the need for repentance. This causes the earth spirits to report their deeds, the heavenly statutes to condemn and punish them, summoning misfortune and inviting calamity. Grievances and enmities become entangled, and retribution is manifest, not a hair’s breadth amiss.\n\nMoreover, there are the ghostly soldiers of those who fell in battle, the demonic and perverse beings of the lower paths, who lie in wait for gaps in human defenses. They seize people’s lifespans, pursue their souls, and seize their essence and qi, joining with their demonic cohorts to harm the good and innocent. Some die before their time is due, while others suffer plagues that afflict entire households. Looking down upon these beings, one can only feel pity and compassion.\n\nYou should descend to the human realm, dividing your bodies and transforming your qi, responding and appearing in the ten directions to gather and subdue the hordes of demons, guiding them to return to the true Dao. Thus, may the people of the lower realm be delivered from all afflictions and calamities. May their living families and dependents all attain peace and security, and may their departed ancestors and kin all be delivered and uplifted.”\n\nAt that time, the Celestial Venerable pronounced the Divine Observer Mantra:\n\nPrimal Ancestor of the Mysterious,\nThree qi intermingling.\nIlluminating the Three Luminaries,\nAtop stands Heaven and Earth.\nPreserving and regulating the kalpas,\nEnsuring the heavens endure long.\nThe Lord Emperors of the Three Heavens,\nHighest Perfected of the Supreme.\nCultivating truth and propagating the teachings,\nBenefiting beings and aiding people.\nHarmonizing and regulating the primal transformations,\nBlessing the nation and pacifying the people.\nDivine Official, Great Saint,\nCelestial Lord of Splendent Radiance.\nDivine powers boundless,\nAssisting the Celestial Throne on high.\nDividing bodies and transforming qi,\nPatrolling the Three Realms.\nAiding the living and delivering the dead,\nBlessing the good and punishing the licentious.\nAverting calamities and delivering from distress,\nRepelling poisons and dispelling fevers.\nProclaiming commands far and wide,\nCommanding the thunder gods.\nWielding a golden spear,\nTreading upon wheels of fire.\nFire gourds and fire crows,\nFlying flames and shooting stars.\nGolden bricks in myriad layers,\nThunder and fire gleaming.\nA single glance from the Heavenly Eye,\nAll in the Three Realms bow in reverence.\nWith the wind at their backs for a thousand miles,\nGood and evil alike are heard.\nThe Six Dings and Six Jias,\nThe Generals of Three and Five.\nLord Thunder and Mother Lightning,\nHurling fire and molten metal.\nMaster Wind and Master Rain,\nSpreading rain and raising clouds.\nHeavenly Soldiers and Mightiest Warriors,\nTheir retinues in splendid array.\nSealing mountains and breaking caves,\nSlaying and annihilating demonic hordes.\nDemon spirits utterly subdued,\nHiding their traces by the sea’s edge.\nShould any dare resist,\nTheir souls and spirits shall be seized.\nGolden hammers shatter brains,\nIron halberds pierce hearts.\nThe great axe that cleaves Heaven,\nSevering their bodies.\nA single sweep of the Black Wind,\nReducing them to fine dust.\nThe Earthly Deities of the Nine Provinces,\nGuests who partake of blood sacrifices,\nThe City God and his attendants,\nHear our commands and directives.\nAssist the mysterious teachings,\nAccumulating extraordinary merit.\nThe Jade Script of the Primal Beginning,\nThe Eight Mighty Dragon Scripts.\nProclaimed throughout the Three Realms,\nAll spirits everywhere comply.\nSwiftly, swiftly, as in the statutes and decrees!”\n\nThe Celestial Worthy then addressed the Perfected One, saying: “In the world, among men and women, there may be demonic spirits—*wangliang*, mountain *xiaos*, tree-dwelling *ke*, ancient vessels harboring lingering corpses, earthbound specters, stone essences, water veins teeming with malevolent *mei*, and other unorthodox deities. These entities alter their forms and essences, hurl bricks and set fires, seize human souls, and occupy dwellings, manifesting in a hundred guises to harass and disturb living beings.\n\nWhenever such afflictions arise, devout men and women should swiftly purify themselves with fasting, ablutions, and ritual bathing. Whether at an ancient Daoist abbey or a sacred altar, or within the purity of their own homes, they should establish the precious thrones of the Three Clarities and the numinous altars of the Five Emperors. They must light incense, kindle lamps, offer flowers and libations of water, present sincere petitions, bow in reverence, and submit memorials. They should take refuge in the lofty Perfected Ones, the numinous officials, and the great sages of the Three Realms, recite the true scriptures, chant divine incantations, confess their transgressions, seek forgiveness, and pray for blessings and longevity.\n\nThe Great Sage of Numinous Observation will respond at once, leading the Five Hundred Great Sages of Numinous Observation—wielding golden bricks and golden spears, fire ladles and fire chariots, the Fire Crow Generals, the Faceless Great General, the White Snake Great General, the Thousand-Mile Favorable Wind Messenger, the thunder gods and celestial generals of the Five Directions, the bronze-headed and iron-faced officers of the Six Heavens, and the hosts of the Fire Department. They will cast molten metal, hurl fire, unleash lightning and thunder, and descend in unison to sweep away demonic miasmas, expel inauspicious omens, purify the realm, separate humans from ghosts, and restore peace to the people.\n\nThe Marshal of Numinous Observation and the mighty divine officers are beyond measure in their power. All who witness or hear of them should show utmost reverence.\n\nShould the world suffer from excessive yang turning to pestilence, or accumulated yin festering into plague; should the Fire Deity Zhu Rong fan disaster, or rivers and seas overflow their bounds; should warfare erupt and people be displaced, or locusts swarm to devour crops—whenever such calamities arise, one must perform rites to offer thanks to Heaven and Earth, recite the true scriptures, take refuge in the Supreme Mystery, and pray for grace and blessings. Thus shall the land be pacified, winds harmonized, rains timely, all things flourish, and rivers and seas be serene.\n\nMoreover, if mortals suffer from celestial bodies in conflict, their fortunes waning or imprisoned; if illness lingers with no path to relief; if ancestral tombs or homes offend the Earth Sovereign; if legal entanglements or unjust imprisonment persist; if epidemics spread and people languish; if rivers and seas churn with perilous waves; if wild beasts surge through mountains and forests; if spouses are separated by fate and descendants few; if journeys by land or water encounter wicked men; if curses and oppression afflict one’s kin; if a woman with child struggles in labor; if one lives in poverty with all endeavors thwarted; if households stagnate and livestock fail to thrive; if moving or felling trees scatters wealth; or if lawsuits and spectral cries entangle the departed—all such misfortunes stem from the deep accumulation of evil, bringing disaster while blessings rarely descend.\n\nYet if one follows the rites, practices the Dao with wholehearted sincerity, bares one’s heart in repentance, and takes refuge in the Three Treasures, peace shall be restored. Divine guardians will protect the home, the Dao’s qi will nurture and support, and all calamities shall dissipate at once.\n\nFurthermore, if men and women, moved by filial devotion for their departed ancestors, parents, or kin, seek to deliver them, their pious thoughts shall reach the spirits, freeing them from the dark prisons of the underworld to roam in joy, forever released from suffering, and ascend to the celestial realms. The merit of this scripture is inconceivable, bestowing boundless blessings upon both the living and the dead.”\n\nUpon hearing these words, the Perfected One vowed to propagate them, extolling the Great Sage of Numinous Observation with this hymn of praise:\n\n“In the Supreme Great Tenuity,\nThe Mysterious Void abides.\nFive forms perfected in wonder,\nMyriad dharmas rare among mortals.\nManifesting through the Three Realms,\nAppearing in the Ten Directions.\nIn harmony with the natural Dao,\nThe land is at peace, the people prosper.”\n\nAfter this hymn was recited, the assembly of Perfected Ones, the countless immortals and sages, all voiced their approval.\n\nThe Celestial Worthy then addressed the Perfected One again: “Men and women of the world who follow my teachings with devotion possess profound Dao-heart and karmic affinity from past lives. By venerating and making offerings, they shall be untouched by the ten thousand calamities, blessed with good fortune, their wishes fulfilled, all virtues descending, and no evils arising.\n\nIf they further observe the four seasons, the eight solar terms, the Three Primes, the Three Assemblies, the Five La Festivals, the Ten Straight Days, the *jiazi* and *gengshen* days, the first of the month, and their own birthdays—all these auspicious times—and uphold the precepts with diligence, they shall naturally align with the myriad truths. Their fortune and longevity shall extend, their seven generations of ancestors and nine lineages of kin shall all attain liberation. If they also transmit these teachings to others, inspiring reverence and recitation, their blessings shall be boundless.\n\nThe merit of this scripture and its karmic rewards are luminously evident, beyond all conception.”\n\nAfter the Celestial Worthy had spoken this scripture, the Great Sage of Numinous Observation respectfully received the divine decree and descended to the mortal realm to widely propagate the mysterious transformation. The Perfected Ones and countless immortals of the Ten Directions praised and rejoiced, bowing in reverence to the Most High, the Boundless August One, the True Three Treasures. They paid their respects and withdrew, dutifully transmitting the divine command for posterity.\n\nHere ends *The Wondrous Scripture of the Five Manifestations of Numinous Observation and the Radiant Flower of Hua Guang’s Original Conduct from the Cavernous Mystery of the Numinous Treasure*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝五显灵观华光本行妙经 经名：太上洞玄灵宝五显灵观华光本行妙经。 撰人不祥，约出於宋代。 念诵召请华光天师忏罪消灾。 一卷。 底本出处：《续道藏》。 太上洞玄灵宝五显灵观华光本行妙经 尔时，元始天尊於赤明劫初，在大罗天上玉清圣境清微天中，九光元阳之殿，与太上玉晨道君、太上玄元老君、诸天上帝，坐九色龙凤宝座，垂十绝灵旛羽盖，玉童玉女散诸天香宝花，遍满十方。 是时九凤齐唱，八鸾同鸣，天乐自响，灵凤聚烟，狮子白鹤，啸歌雕雕，天无氛秽，山岳藏云。 元始天尊现神通妙力，垂九色祥光，天宫玄都莫不焕然，下烛十方无极世界，俱同一相，琉璃清莹，洞彻无碍，表裹分明。 十方无极飞天神王、至尊大神，一时同会。 于时东方九炁青帝天君、侍真灵官无鞅数众，浮空而至； 南方三炁赤帝天君、侍真灵官无鞅数众，浮空而至； 西方七炁白帝天君、侍真灵官无鞅数众，浮空而至； 北方五炁黑帝天君、侍真灵官无鞅数众，浮空而至； 中央一炁黄帝天君、侍真灵官无鞅数众，浮空而至。 云集法会，稽首恭敬，咸听元始天尊说无上玄元真一妙法。 诸天神仙，步虚旋绕，三界侍轩，同声赞咏。 当此之时，喜庆难言，幽关重开，并受光明，苦爽幽魂，一时解脱。 时，会中有长生度世真人，万福好生真人，慈悲普济真人，越班整佩，执简而出，稽首上白天尊言：天尊大慈，天尊大圣，肇开天地，运度阴阳，为万灵师，为群生父。 臣等宿缘流庆，得侍至真，忝居真列，今者得预大会，拱听法音，宣演重玄，俱蒙开化，恩不可量。 臣等伏睹下方世界，魔鬼流行，侵害生民，三灾竞起，五毒兴行，水火刀兵，凶年饥馑，死亡至众，甚可哀伤。 未审以何因缘，遭罹此苦。 恭惟天尊至仁善贷，开度群迷，大宏济度之门，广布慈悲之化。 天尊曰：汝当摄念存诚，吾当为汝演说善恶因缘。 良久曰：原夫上元之时，人多淳朴，与天地同体，惟道是修，教化众生，使归正道，不为物触，心广体胖，无有损伤，克终寿命。 中元之人，禀谦和美厚之人，施慈惠温良之德，存恤孤寡，拯济饥贫，后己先人，务行方便。 下元之人，生处世间，造恶不悛，不修善行，道德久废，仁义不行，不敬天地，不礼三光，不畏神明，不孝父母，不忠君主，不念师尊，信从邪见，不省本源，损物害人，欺心罔道，贪婪无厌，积恶招愆，恣纵六情，莫知已极。 善恶童子、四直功曹、紏察使者，录其罪目，日夜上奏天庭。 由是三官鼓笔，五帝考书，削字青编，注名黑簿，遂使司命司录、司功司杀，减算除年。 或在世非横连绵，运意乖错，所谋不遂，轗轲竞生，疫疠流行，致多夭丧。 或命过之后，沦没九幽地狱之中，无有善念，得脱幽关。 凡此罪因，皆由心造。 诸真人闻是语已，不胜哀悯，再拜上白天尊言：臣等欲仗慈悲威光之力，分身下降人间，救度众生，俾令男女处世安稳，去离邪横，富贵长寿，灾害不生，魔鬼潜消，道化日显，君明臣良，国祚延永，干戈屏息，天下太平，时和岁丰，万民乐业。 伏望至尊俯从志愿。 天尊曰：汝今欲令利益末世众生，方便启问，发如是愿，善哉善哉。 且万物吾生，万灵无化，救度众生，固当如是，然不劳汝真烈，汝当静念在心，吾即为汝演说利益众生救度之门。",
      "translated_text": "**The Marvelous Scripture of the Original Conduct of Hua Guang, the Five Manifestations of Lingguan from the Cavernous Mystery of the Numinous Treasure**\n\nAt that time, the Celestial Venerable of Original Commencement, during the dawn of the Crimson Clarity Kalpa, resided in the Jade Purity Sagely Realm of the Clear Tenuity Heaven within the Great Brahma Heaven. Seated upon the Ninefold Dragon-Phoenix Throne in the Palace of Ninefold Primordial Yang Radiance, he was accompanied by the Jade Dawn Dao Lord, the Supreme Elder Lord of Mysterious Origin, and the Divine Sovereigns of all Heavens. Nine-tiered numinous banners and feathered canopies draped around them, while jade lads and maidens scattered celestial incense and precious blossoms, suffusing the ten directions.\n\nThen, nine phoenixes sang in unison, eight simurghs cried in harmony, celestial music resounded spontaneously, and numinous phoenixes gathered in mist. Lions and white cranes roared and chanted in melodious chorus, the heavens free of defilement, mountains veiled in clouds.\n\nThe Celestial Venerable of Original Commencement manifested his divine and wondrous power, casting nine-colored auspicious radiance. The Mysterious Capital of the Celestial Palace shone resplendently, its light descending to illumine the boundless worlds of the ten directions, all assuming a single aspect—clear as lapis lazuli, penetrating without obstruction, distinct within and without.\n\nThe Flying Heavenly Divine Kings and Supreme Great Spirits of the ten boundless directions assembled as one. Then, the Azure Emperor of the Nine Qi of the East, with his innumerable attendant perfected numinous officials, arrived floating through the void. The Vermilion Emperor of the Three Qi of the South, with his innumerable attendant perfected numinous officials, arrived floating through the void. The White Emperor of the Seven Qi of the West, with his innumerable attendant perfected numinous officials, arrived floating through the void. The Black Emperor of the Five Qi of the North, with his innumerable attendant perfected numinous officials, arrived floating through the void. The Yellow Emperor of the One Qi of the Center, with his innumerable attendant perfected numinous officials, arrived floating through the void.\n\nGathering at the Dharma assembly, they bowed in reverence and listened as the Celestial Venerable of Original Commencement expounded the wondrous Dharma of the Supreme Mysterious Primordial True One. The divine immortals of all heavens circumambulated in void-stepping procession, while the three realms’ attendants joined in unison to praise and chant.\n\nAt this moment, joy and celebration were beyond words. The gates of darkness opened anew, all receiving illumination. The suffering souls of the netherworld were liberated in that instant.\n\nThen, from the assembly emerged the Perfected of Longevity and Salvation, the Perfected of Myriad Blessings and Love for Life, and the Perfected of Compassionate Universal Salvation. Adjusting their sashes and holding tablets, they bowed and addressed the Celestial Venerable:\n\n“O Celestial Venerable of Great Compassion, Celestial Venerable of Great Sagacity, who first opened heaven and earth, who governs the revolutions of yin and yang, teacher of all numinous beings, father of all living creatures—we, by virtue of past karmic blessings, have been privileged to attend upon the Perfected. Though unworthy, we stand among the ranks of the true. Today, we have been granted the fortune to join this grand assembly, to reverently listen to the Dharma’s sound, to expound the profound mystery, and to receive enlightenment—an immeasurable grace.\n\nWe have observed that in the world below, demonic spirits run rampant, harming the people. The three disasters arise in competition, the five poisons spread unchecked, and calamities of flood, fire, blade, and warfare, along with famine and plague, cause countless deaths. This is most pitiable. We know not by what karmic causes they suffer such afflictions.\n\nWe humbly beseech the Celestial Venerable, whose benevolence and kindness extend to all, to open the gate of vast deliverance and broadly bestow the transformation of compassion.”\n\nThe Celestial Venerable replied: “Compose your thoughts and concentrate your sincerity. I shall expound for you the karmic causes of good and evil.”\n\nAfter a long pause, he continued: “In the Upper Kalpa, people were simple and unadorned, their bodies one with heaven and earth. They cultivated only the Dao, teaching and transforming living beings to return to the true path. Unmoved by external things, their minds were expansive and their forms at ease. Unharmed, they fulfilled their allotted lifespans.\n\nThe people of the Middle Kalpa were endowed with humility, harmony, and generosity. They practiced the virtues of kindness, benevolence, warmth, and goodness, aiding orphans and widows, relieving the hungry and poor. They placed others before themselves and diligently performed acts of convenience.\n\nThe people of the Lower Kalpa, born into the world, persist in evil without repentance, neglecting virtuous conduct. The Dao and virtue have long been abandoned; benevolence and righteousness are no longer practiced. They disrespect heaven and earth, pay no reverence to the Three Luminaries, fear no divine spirits, are unfilial to parents, disloyal to rulers, and unmindful of their teachers. They follow perverse views, forget their origins, harm beings, deceive their own hearts, and betray the Dao. Greedy and insatiable, they accumulate evil and incur transgressions, indulging the six senses without restraint.\n\nThe Youths of Good and Evil, the Four Upright Merit Recorders, and the Investigating Messengers record their sins and report them day and night to the celestial court. Thus, the Three Officials wield their brushes, the Five Emperors examine the records, erasing names from the Azure Register and inscribing them in the Black Book. Thereupon, the Directors of Destiny, Records, Merit, and Execution reduce their allotted years and lifespans.\n\nSome, while still alive, suffer prolonged misfortune due to perverse intentions, thwarted plans, and endless frustrations. Epidemics spread, causing many premature deaths. Others, after their lives have ended, sink into the Nine Dark Hells of the Underworld, devoid of virtuous thoughts, unable to escape the gates of darkness. All these karmic causes arise from the mind.”\n\nUpon hearing these words, the perfected ones were filled with sorrow and compassion. Bowing again, they addressed the Celestial Venerable: “We wish to rely upon the power of your compassionate majesty and radiance, to divide our bodies and descend into the human realm to save living beings. May men and women dwell in peace, free from perverse misfortune, enjoying wealth, honor, and longevity, untouched by calamity. May demonic spirits vanish in concealment, the Dao’s transformation daily manifest, rulers be enlightened and ministers virtuous, the nation’s destiny endure, weapons be laid aside, the world know peace, the seasons harmonious, the years abundant, and all people delight in their livelihoods. We humbly implore the Celestial Venerable to grant this aspiration.”\n\nThe Celestial Venerable replied: “You now wish to benefit the living beings of the latter age, raising timely questions and making such vows—excellent, excellent! All things are born of me; all spirits are transformed by me. To save living beings is indeed as it should be. Yet there is no need for your true and ardent efforts. Compose your thoughts and hold this in your hearts. I shall now expound for you the gate of benefiting and saving living beings.”",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1263,
      "start_sentence": 0,
      "end_sentence": 36,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.08360147476196,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\太上洞玄灵宝五显观华光本行妙经.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "天尊曰：三天境内有灵官大圣，华光五大天帅，发弘誓愿，救度众生，摄伏群魔，阐扬道化，威灵烜赫，功德巍巍，与道合真，度人无量，随声赴感，捍厄扶衰，无愿不从，延生赐福。 或现一身，或显五相，或化为诸天天帝，或化为梵王帝身，或化为吉祥如来，或化为日露天主，或化为华光菩萨，或化为天丁力士，或化为妙行真人。 以此种种神通，随机摄化，救度众生。 真人复问：此灵观大圣，以何因缘位居天帅，现十方种种神通妙相。 天尊曰：此灵观五大天帅，禀五星五炁之精，毓五方五灵之秀，化身三界，应现十方，掌三界祸福之权，持万物生杀之柄。 吉凶悔吝，悉属陶镕。 若或有人一称其名号，曰灵观大圣华光广化天君，当知神通立现，克副愿心，如影随形，似声应响，昭然感格，莫可称量。 真人复问曰：仰惟天尊好生之德，泽被三途，恩沾万汇，广福天人，作度人之津梁，启归真之径路。 伏愿特垂勑旨，遣降人间，福国安民，宣扬玄化。 天尊於是以金简玉符，遣金童玉女，勑召灵观五大天帅。 倏忽之间，灵观五大天帅恭临法会，长跪道前。 上言：臣等仰沐生成，忝居真列，今日大庆，特蒙勑召，得诣琼轩，仰睹天颜，听宣妙法。 天尊曰：世间男女，不崇正化，造恶不悛，以矫诈为本心，以贪婪为己行，放纵情欲，背正向邪，积种种罪源，莫知忏悔。 致使地祇效奏，天律谴诛，召恶招殃，冤雠缠结，报对昭然，毫分不失。 又复有阵亡鬼兵，下道妖邪，伺人间隙，把人年命，追人魂魄，摄人精气，与其邪党，侵害良民。 或命未尽而遽亡，或有全家而疾疫。 俯观此辈，良可悯怜。 汝宜下降人间，分身化氛，应现十方，收摄群魔，使归正道，俾下元之人，离诸患难，见存眷属，悉获安宁，已往先亲，咸皆超度。 尔时天尊即说灵观咒曰： 玄元始祖，三炁氤氲。 开明三景，顶立乾坤。 保制劫运，使天长存。 三天主帝，上帝高真。 修真阐教，利物济人。 燮调元化，福国安民，灵官大圣，华光之君。 神通无极，上佐帝宸。 分身化气，三界游巡。 济生度死，福善祸淫。 禳灾度厄，辟毒驱温。 广宣号令，役使雷神。 手持金枪，足踏火轮。 火瓢火鸦，飞焰星奔。 金砖万迭，雷火磷磷。 天目一视，三界齐钦。 顺风千里，善恶皆闻。 六丁六甲，三五将军。 雷公电母，掷火流金。 风伯雨师，播雨兴云。 天丁力士，队仗纷纭。 封山破洞，馘灭鬼群。 魔精最伏，潜迹海滨。 敢有拒送，摄魄收魂。 金锤裂脑，铁戟穿心。 镢天大斧，斩截其身。 乌风一扫，化作微尘。 九州社令，血食之宾，城隍主者，听吾指陈。 佐助玄教，积累殊勋。 元始玉字，八威龙文。 普告三界，万灵咸遵。 急急如律令。",
      "translated_text": "The Celestial Venerable said: “Within the Three Heavens’ realms dwell the Divine Officials and Great Saints, the Five Celestial Marshals of Splendent Radiance. They have made vast and solemn vows to save and deliver living beings, subdue and tame the hordes of demons, and propagate the transformations of the Dao. Their majesty and numinous power blaze forth, their merit and virtue towering high. They unite with the Dao in truth, delivering countless souls. Responding to cries for aid, they hasten to succor the distressed and sustain the failing. No prayer goes unanswered; they prolong life and bestow blessings.\n\nAt times they manifest as a single body, at others they display five aspects. They may transform into the Heavenly Emperors of the various heavens, or into the bodies of Brahmā Kings. They may appear as the Auspicious Tathāgata, or as the Lord of Sun and Dew, or as the Bodhisattva of Splendent Radiance, or as the Heavenly Soldiers and Mightiest Warriors, or as the Perfected of Wondrous Conduct. Through these manifold divine powers, they adapt to circumstances and convert and deliver living beings.”\n\nThe Perfected One further inquired: “By what karmic conditions do these Divine Observers and Great Saints hold the rank of Celestial Marshals and manifest the wondrous forms of their divine powers in the ten directions?”\n\nThe Celestial Venerable replied: “These Five Celestial Marshals of the Divine Observer are endowed with the essence of the Five Stars and the qi of the Five Phases. They nurture the finest spirits of the Five Directions, transform their bodies throughout the Three Realms, and respond and appear in the ten directions. They hold authority over the weal and woe of the Three Realms and wield the handle of life and death for all things. Fortune and misfortune, regret and shame—all are shaped by their molding. Should anyone but once invoke their names, saying, ‘Divine Observer, Great Saint, Celestial Lord Hua Guang of Vast Transformation,’ know that their divine powers will instantly manifest, fulfilling the heart’s desire as surely as a shadow follows form or an echo answers sound. The response is luminous and unfailing, beyond all measure.”\n\nThe Perfected One again inquired: “Reverently considering the Celestial Venerable’s virtue of cherishing life, whose blessings extend to the Three Paths and whose grace moistens the ten thousand kinds, who bestows fortune upon gods and humans and serves as the bridge for delivering people, who opens the path to returning to truth—we humbly beseech you to issue a sacred decree, dispatching them to the human realm to bless the nation and pacify the people, and to proclaim the mysterious transformations.”\n\nThereupon, the Celestial Venerable inscribed golden tablets and jade talismans, sending the Golden Youths and Jade Maidens to summon the Five Celestial Marshals of the Divine Observer. In an instant, the Five Celestial Marshals of the Divine Observer arrived reverently at the Dharma assembly, kneeling long before the Dao.\n\nThey addressed the Celestial Venerable, saying: “We, your servants, have been nurtured by your life-giving grace and unworthily occupy the ranks of the Perfected. Today, on this great and joyous occasion, we have been specially summoned by decree and have come to this jeweled pavilion, where we gaze upon your celestial countenance and listen to the proclamation of the wondrous Dharma.”\n\nThe Celestial Venerable said: “Among the men and women of the world, many do not revere the true transformations. They commit evil and do not repent, taking deceit as their fundamental nature and greed as their conduct. They indulge their passions and desires, turning their backs on the true and inclining toward the perverse. They accumulate all manner of karmic roots of sin, unaware of the need for repentance. This causes the earth spirits to report their deeds, the heavenly statutes to condemn and punish them, summoning misfortune and inviting calamity. Grievances and enmities become entangled, and retribution is manifest, not a hair’s breadth amiss.\n\nMoreover, there are the ghostly soldiers of those who fell in battle, the demonic and perverse beings of the lower paths, who lie in wait for gaps in human defenses. They seize people’s lifespans, pursue their souls, and seize their essence and qi, joining with their demonic cohorts to harm the good and innocent. Some die before their time is due, while others suffer plagues that afflict entire households. Looking down upon these beings, one can only feel pity and compassion.\n\nYou should descend to the human realm, dividing your bodies and transforming your qi, responding and appearing in the ten directions to gather and subdue the hordes of demons, guiding them to return to the true Dao. Thus, may the people of the lower realm be delivered from all afflictions and calamities. May their living families and dependents all attain peace and security, and may their departed ancestors and kin all be delivered and uplifted.”\n\nAt that time, the Celestial Venerable pronounced the Divine Observer Mantra:\n\nPrimal Ancestor of the Mysterious,\nThree qi intermingling.\nIlluminating the Three Luminaries,\nAtop stands Heaven and Earth.\nPreserving and regulating the kalpas,\nEnsuring the heavens endure long.\nThe Lord Emperors of the Three Heavens,\nHighest Perfected of the Supreme.\nCultivating truth and propagating the teachings,\nBenefiting beings and aiding people.\nHarmonizing and regulating the primal transformations,\nBlessing the nation and pacifying the people.\nDivine Official, Great Saint,\nCelestial Lord of Splendent Radiance.\nDivine powers boundless,\nAssisting the Celestial Throne on high.\nDividing bodies and transforming qi,\nPatrolling the Three Realms.\nAiding the living and delivering the dead,\nBlessing the good and punishing the licentious.\nAverting calamities and delivering from distress,\nRepelling poisons and dispelling fevers.\nProclaiming commands far and wide,\nCommanding the thunder gods.\nWielding a golden spear,\nTreading upon wheels of fire.\nFire gourds and fire crows,\nFlying flames and shooting stars.\nGolden bricks in myriad layers,\nThunder and fire gleaming.\nA single glance from the Heavenly Eye,\nAll in the Three Realms bow in reverence.\nWith the wind at their backs for a thousand miles,\nGood and evil alike are heard.\nThe Six Dings and Six Jias,\nThe Generals of Three and Five.\nLord Thunder and Mother Lightning,\nHurling fire and molten metal.\nMaster Wind and Master Rain,\nSpreading rain and raising clouds.\nHeavenly Soldiers and Mightiest Warriors,\nTheir retinues in splendid array.\nSealing mountains and breaking caves,\nSlaying and annihilating demonic hordes.\nDemon spirits utterly subdued,\nHiding their traces by the sea’s edge.\nShould any dare resist,\nTheir souls and spirits shall be seized.\nGolden hammers shatter brains,\nIron halberds pierce hearts.\nThe great axe that cleaves Heaven,\nSevering their bodies.\nA single sweep of the Black Wind,\nReducing them to fine dust.\nThe Earthly Deities of the Nine Provinces,\nGuests who partake of blood sacrifices,\nThe City God and his attendants,\nHear our commands and directives.\nAssist the mysterious teachings,\nAccumulating extraordinary merit.\nThe Jade Script of the Primal Beginning,\nThe Eight Mighty Dragon Scripts.\nProclaimed throughout the Three Realms,\nAll spirits everywhere comply.\nSwiftly, swiftly, as in the statutes and decrees!”",
      "overlap_context": "ial Venerable to grant this aspiration.”\n\nThe Celestial Venerable replied: “You now wish to benefit the living beings of the latter age, raising timely questions and making such vows—excellent, excellent! All things are born of me; all spirits are transformed by me. To save living beings is indeed as it should be. Yet there is no need for your true and ardent efforts. Compose your thoughts and hold this in your hearts. I shall now expound for you the gate of benefiting and saving living beings.”",
      "start_char": 1264,
      "end_char": 2298,
      "start_sentence": 37,
      "end_sentence": 86,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.23016428947449,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\太上洞玄灵宝五显观华光本行妙经.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "天尊复谓真人曰：世间男女，或有妖邪魍魉、山魈木客、古器伏尸、土怪石精、水脉旺魅、不正等神，变易形质，抛砖放火，摄人魂魄，占人宅舍，百种形状，恼乱众生。 凡有是诸患难，善信男女，速宜斋戒沐浴。 或於古观灵坛，或於本居净室，建立三清宝座，五帝灵坛，然香点灯，献花酌水，投词露恳，拜表上章，皈命三界高真灵官大圣，持念真经，诵咏神咒，首愆谢过，请福延生。 灵观大圣应时感格，部领五百灵观大圣，金砖金枪、火瓢火车、火鸦大将，无面目大将军，白蛇大将军，顺风千里使者，五方雷神天将，铜头铁面六天吏兵，火部率众，流金掷火，掣电轰雷，一合下降，扫荡妖氛，驱逐不祥，肃清境界，人鬼分离，生民安泰。 灵观元帅、威神之吏，莫可称量，凡有见闻，各宜恭敬。 若复世间亢阳为沴，积阴为疠，祝融扇祸，江海失经，或干戈互起，人民流亡，虫蝗为妖，蠹食禾秽。 如是灾难，皆当依仪醮谢天地，转念真经，皈命上玄，祈恩请福，即得国土清平，风调雨顺，百物清润，河清海晏。 又若世人星辰冲战，禄马休囚，疾病缠绵，求安无路。 或修坟立宅，干犯土皇。 或官司牢狱，冤枉不伸。 或疫疠流行，人民困弊。 或江河转运，波浪惊危。 或旷野山林，恶兽奔突。 或夫妻刑隔，嗣续未蕃。 或水陆经营，恶人值遇。 或咒诅相仍，侵凌眷属。 或身怀六甲，母子未分。 或在世孤贫，谋为阻晦。 或门户闭塞，畜养不生。 或买迁经木，财物散耗。 或冢讼微呼，先亡复连。 如是等种种灾难，皆缘世人积恶深厚，以致祸患来钟，福瑞希降。 若能依仪行道，罄志投诚，剖露腹心，皈依忏悔，即获平安，神明护门，道气滋扶，一切灾难，应时消散。 又若世间男女，为先祖宗亲父母亡没，起心荐拔，冀彻孝思，即得魂出幽关，逍遥快乐，永辞沉结，上生天堂。 是经功德，不可思议，存亡获福，善利无边。 於是，真人得闻语已，誓愿流传，赞叹灵观大圣，而献颂曰： 高上太微，中有玄虚。 五形全妙，万法希民。 化身三界，变现十方。 道合自然，国泰民康。 说是颂已，法会众真，无鞅仙圣，咸皆称善。 天尊再告真人曰：世间男女，能依吾所授，奉教而行者，皆道心深重，宿有善缘，尊崇供养，万灾不干，吉祥如意，众善齐降，诸恶不生。 更能於四时八节、三元三会、五腊十直、甲子庚申、月旦本命，是诸良辰吉日，如法自持，自然千真万合，福寿延长，七祖九玄，均获超度，更能传授世人，敬信读诵，福利无边。 是经功德，果报照然，不可思议。 天尊说是经已，灵观大圣敬奉教旨，下降人间，广宣玄化。 十方天真大圣，无鞅仙众，称扬赞叹，欢喜踊跃，稽首礼谢无上虚皇正真三宝，作礼而退，谨奉道旨，敬为流传。 太上洞玄灵宝五显灵观华光本行妙经竟",
      "translated_text": "The Celestial Worthy then addressed the Perfected One, saying: “In the world, among men and women, there may be demonic spirits—*wangliang*, mountain *xiaos*, tree-dwelling *ke*, ancient vessels harboring lingering corpses, earthbound specters, stone essences, water veins teeming with malevolent *mei*, and other unorthodox deities. These entities alter their forms and essences, hurl bricks and set fires, seize human souls, and occupy dwellings, manifesting in a hundred guises to harass and disturb living beings.\n\nWhenever such afflictions arise, devout men and women should swiftly purify themselves with fasting, ablutions, and ritual bathing. Whether at an ancient Daoist abbey or a sacred altar, or within the purity of their own homes, they should establish the precious thrones of the Three Clarities and the numinous altars of the Five Emperors. They must light incense, kindle lamps, offer flowers and libations of water, present sincere petitions, bow in reverence, and submit memorials. They should take refuge in the lofty Perfected Ones, the numinous officials, and the great sages of the Three Realms, recite the true scriptures, chant divine incantations, confess their transgressions, seek forgiveness, and pray for blessings and longevity.\n\nThe Great Sage of Numinous Observation will respond at once, leading the Five Hundred Great Sages of Numinous Observation—wielding golden bricks and golden spears, fire ladles and fire chariots, the Fire Crow Generals, the Faceless Great General, the White Snake Great General, the Thousand-Mile Favorable Wind Messenger, the thunder gods and celestial generals of the Five Directions, the bronze-headed and iron-faced officers of the Six Heavens, and the hosts of the Fire Department. They will cast molten metal, hurl fire, unleash lightning and thunder, and descend in unison to sweep away demonic miasmas, expel inauspicious omens, purify the realm, separate humans from ghosts, and restore peace to the people.\n\nThe Marshal of Numinous Observation and the mighty divine officers are beyond measure in their power. All who witness or hear of them should show utmost reverence.\n\nShould the world suffer from excessive yang turning to pestilence, or accumulated yin festering into plague; should the Fire Deity Zhu Rong fan disaster, or rivers and seas overflow their bounds; should warfare erupt and people be displaced, or locusts swarm to devour crops—whenever such calamities arise, one must perform rites to offer thanks to Heaven and Earth, recite the true scriptures, take refuge in the Supreme Mystery, and pray for grace and blessings. Thus shall the land be pacified, winds harmonized, rains timely, all things flourish, and rivers and seas be serene.\n\nMoreover, if mortals suffer from celestial bodies in conflict, their fortunes waning or imprisoned; if illness lingers with no path to relief; if ancestral tombs or homes offend the Earth Sovereign; if legal entanglements or unjust imprisonment persist; if epidemics spread and people languish; if rivers and seas churn with perilous waves; if wild beasts surge through mountains and forests; if spouses are separated by fate and descendants few; if journeys by land or water encounter wicked men; if curses and oppression afflict one’s kin; if a woman with child struggles in labor; if one lives in poverty with all endeavors thwarted; if households stagnate and livestock fail to thrive; if moving or felling trees scatters wealth; or if lawsuits and spectral cries entangle the departed—all such misfortunes stem from the deep accumulation of evil, bringing disaster while blessings rarely descend.\n\nYet if one follows the rites, practices the Dao with wholehearted sincerity, bares one’s heart in repentance, and takes refuge in the Three Treasures, peace shall be restored. Divine guardians will protect the home, the Dao’s qi will nurture and support, and all calamities shall dissipate at once.\n\nFurthermore, if men and women, moved by filial devotion for their departed ancestors, parents, or kin, seek to deliver them, their pious thoughts shall reach the spirits, freeing them from the dark prisons of the underworld to roam in joy, forever released from suffering, and ascend to the celestial realms. The merit of this scripture is inconceivable, bestowing boundless blessings upon both the living and the dead.”\n\nUpon hearing these words, the Perfected One vowed to propagate them, extolling the Great Sage of Numinous Observation with this hymn of praise:\n\n“In the Supreme Great Tenuity,\nThe Mysterious Void abides.\nFive forms perfected in wonder,\nMyriad dharmas rare among mortals.\nManifesting through the Three Realms,\nAppearing in the Ten Directions.\nIn harmony with the natural Dao,\nThe land is at peace, the people prosper.”\n\nAfter this hymn was recited, the assembly of Perfected Ones, the countless immortals and sages, all voiced their approval.\n\nThe Celestial Worthy then addressed the Perfected One again: “Men and women of the world who follow my teachings with devotion possess profound Dao-heart and karmic affinity from past lives. By venerating and making offerings, they shall be untouched by the ten thousand calamities, blessed with good fortune, their wishes fulfilled, all virtues descending, and no evils arising.\n\nIf they further observe the four seasons, the eight solar terms, the Three Primes, the Three Assemblies, the Five La Festivals, the Ten Straight Days, the *jiazi* and *gengshen* days, the first of the month, and their own birthdays—all these auspicious times—and uphold the precepts with diligence, they shall naturally align with the myriad truths. Their fortune and longevity shall extend, their seven generations of ancestors and nine lineages of kin shall all attain liberation. If they also transmit these teachings to others, inspiring reverence and recitation, their blessings shall be boundless.\n\nThe merit of this scripture and its karmic rewards are luminously evident, beyond all conception.”\n\nAfter the Celestial Worthy had spoken this scripture, the Great Sage of Numinous Observation respectfully received the divine decree and descended to the mortal realm to widely propagate the mysterious transformation. The Perfected Ones and countless immortals of the Ten Directions praised and rejoiced, bowing in reverence to the Most High, the Boundless August One, the True Three Treasures. They paid their respects and withdrew, dutifully transmitting the divine command for posterity.\n\nHere ends *The Wondrous Scripture of the Five Manifestations of Numinous Observation and the Radiant Flower of Hua Guang’s Original Conduct from the Cavernous Mystery of the Numinous Treasure*.",
      "overlap_context": "n,\nSevering their bodies.\nA single sweep of the Black Wind,\nReducing them to fine dust.\nThe Earthly Deities of the Nine Provinces,\nGuests who partake of blood sacrifices,\nThe City God and his attendants,\nHear our commands and directives.\nAssist the mysterious teachings,\nAccumulating extraordinary merit.\nThe Jade Script of the Primal Beginning,\nThe Eight Mighty Dragon Scripts.\nProclaimed throughout the Three Realms,\nAll spirits everywhere comply.\nSwiftly, swiftly, as in the statutes and decrees!”",
      "start_char": 2299,
      "end_char": 3370,
      "start_sentence": 87,
      "end_sentence": 123,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.24197697639465,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\太上洞玄灵宝五显观华光本行妙经.txt",
        "category": "正统道藏续道藏"
      }
    }
  ]
}