{
  "source_id": "太上洞玄灵宝天尊说救苦妙经批注",
  "source_file": "chunked_daozang\\太上洞玄灵宝天尊说救苦妙经批注.json",
  "total_chunks": 9,
  "total_original_chars": 10047,
  "total_translated_chars": 62096,
  "total_translation_time": 300.15596985816956,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上洞玄灵宝天尊说救苦妙经批注.txt",
    "category": "玉诀类"
  },
  "full_translation": "**The Supreme Cavernous Mystery Numinous Treasure Heavenly Worthy’s Explication of the Wondrous Scripture of Salvation from Suffering**\n\n**Title:** *Explication of the Supreme Cavernous Mystery Numinous Treasure Heavenly Worthy’s Wondrous Scripture of Salvation from Suffering*\nComposed by the Daoist Master Dongyangzi during the Song-Yuan transition. One fascicle.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Section, Jade Instructions Category.\n\n---\n\n**Explication of the Supreme Cavernous Mystery Numinous Treasure Heavenly Worthy’s Wondrous Scripture of Salvation from Suffering**\nAnnotated by Dongyangzi of Daoshen Hermitage\n\n**The Supreme (Taishang):**\n*Tai* (Supreme) denotes utmost greatness; *shang* (above) signifies the most exalted. As it originates beyond the *Taiyi* (Supreme Beginning) and *Taiyi* (Supreme Simplicity), it is called *Taishang* (The Supreme).\n\nNow, the *Taiyi* (Supreme Simplicity) is the state before *qi* manifests—the primordial *qi* of the Origin’s inception, yet unseen. The *Taiyi* transforms into the *Taichu* (Supreme Beginning), where *qi* first arises, and the precelestial primordial *qi* begins to reveal faint traces. The *Taichu* transforms into the *Taishi* (Supreme Commencement), where form first emerges, and the primordial *qi* gradually takes shape. The *Taishi* transforms into the *Taisu* (Supreme Simplicity), where substance first appears, and the primordial *qi* attains both form and essence. The *Taisu* transforms into the *Taiji* (Supreme Ultimate), which is the undifferentiated chaos—vast and boundless, resembling an egg. Within it lies essence, pervading without limit, as the primordial *qi* congeals yet remains undivided into purity and turbidity.\n\nWhen the *Taiji* transforms, chaos unfolds, and the primordial vastness splits. Thus, the pure yang *qi* ascends to become Heaven, while the turbid yin *qi* descends to become Earth. As the *Yijing* states: *\"The Supreme Ultimate generates the Two Modes\"*—this is the principle. The Two Modes generate the Three Powers, which are neither turbid nor pure but the harmonious *qi* that coalesces to form humanity. This is called: *\"The Dao gives birth to the One\"*—the undifferentiated *qi* of chaos; *\"The One generates the Two\"*—the purity and turbidity of the Two Modes; *\"The Two generate the Three\"*—the Three Powers of humanity. Thereafter, the Three give rise to the myriad things.\n\nThe myriad things originate from Heaven and Earth, yet Heaven and Earth cannot exist of themselves—they are possessed by the *Taiji*. The *Taiji* cannot generate itself—it is born of the *Taisu*. The *Taisu* cannot nurture itself—it is nurtured by the *Taishi*. The *Taishi* cannot conceive itself—it is conceived by the *Taichu*. Before the *Taichu* exists, there is the *Taiyi*. Thus, the *Taishang* refers to that which originates beyond the *Taichu* and *Taiyi*—the greatness beyond all greatness, hence *tai* (supreme), and the height beyond the eight poles, hence *shang* (above).\n\nMoreover, *tai* means \"utmost,\" and *shang* means \"lofty,\" signifying that the wondrous meaning of this scripture is so exalted that nothing surpasses it. In ancient times, the sages crafted the character *tai* (太) from *ren* (人, person), *yi* (一, one), and a dot, for when a person attains the One, they are called great. The great person, standing alone and upright, ever preserving this single point, may embody the entirety of the *Taishang*.\n\nThis single point spans past and present, neither arising nor ceasing. In the Dao, it is called the *yuanshen* (primordial spirit); in Confucianism, the *zhenxing* (true nature); in Buddhism, the *benlai* (original face). In the eye, it enables sight; in the ear, hearing; in the nose, smell; in the tongue, taste; in the hand, grasping; in the foot, walking. From speech to silence, movement to stillness, through myriad transformations, it never fails to communicate its numinosity through this single point.\n\nThus, Lord Lao’s refinement and nurturance concern only this point; Zhuang Zhou’s parables speak only of this point; the Duke of Zhou’s contemplation ponders only this point; Confucius’s profound absorption delves only into this point; the Tathāgata’s great awakening awakens only to this point; the ancestral masters’ transmission passes down only this point.\n\nThe common folk use it daily yet remain unaware. Externally, they are swayed by sounds and sights; internally, they are drowned by cravings and desires. By day, they follow passions and affections; by night, they chase dreams in flight. Their thoughts cling and grasp, never ceasing for even a moment. When this single point is not aligned, the heart’s reflection remains askew. Seduced by emotions and desires, it strays outward—thus forming the character *da* (大, \"great\"), signifying the wandering and turning of the wheel, or even rebirth as beasts.\n\nNow, the character *shang* (上, \"above\") is composed of *bu* (卜) and *yi* (一). *Bu* means \"to divine\" or \"to measure\"; *yi* is \"nature.\" To divine and measure one’s own nature, and to dwell humbly below—this is to be an *upper scholar* (上士). The rivers and seas, by lowering themselves beneath the hundred valleys, become their king; a small state, by humbling itself before a great one, wins its allegiance. This is why Confucius deferred to the fisherman.\n\nYet if one’s humility is not refined, one cannot grasp its truth. Though a well be a thousand fathoms deep, drawing water from its surface yields nothing. Thus, the sage does not descend without ascending. Hence it is said: \"Nobility takes lowliness as its root; height takes lowness as its foundation.\" Know then that one who never seeks to precede others yet always follows them, who places the self last yet finds the self foremost—such a one is revered in humility and radiant in light. This is the Way of the *zhenren* (true person) in responding to the world.\n\nThus it is said: \"Divine and measure your nature to dwell below, and you become an upper scholar.\" The principle is luminously clear. But if one is self-aggrandizing, self-promoting, self-righteous, and self-displaying, delighting in standing above others—such a one is truly a *lower person* (下人).\n\nAs for one who embodies the Great Void, vast and egoless—where this single point is concerned, both inner and outer are forgotten, above and below are transcended. This is the Way of the utmost sage, wherein one attains the Three Clarities on one’s own. Why gaze upward in longing? One’s own Supreme Purity is already present—why seek it externally?\n\n*Dongxuan* (洞玄): *Dong* means \"to penetrate.\" Above, it connects to Heaven; below, to Earth; within, immortals and spirits traverse in hidden communion. The world has ten great *dong* (caverns) and thirty-six lesser ones, all residing within the boundless expanse of the Great Void. Each is interconnected, penetrating one another. Only when immortals and sages gather do they take form; when they disperse, they become qi, naturally traversing the void without obstruction.\n\nThus, the sage draws lessons from afar in things and from nearness in the self. Within the human body, too, there are *dong*. The head has nine palaces, above which lies the *Liaotian* (寥天), together forming the ten great *dongtian* (cavern-heavens). The spinal column has twenty-four joints, forming the twelve-storied tower. Together, these make thirty-six *dong*, ascending to the nine heavens of *Nijiu* (泥九) and descending to the nine earths of *Weixian* (尾闲). Within, the true qi traverses in hidden communion.\n\nThus, in the midst of extreme emptiness and profound stillness, the sage turns the *xuanji* (璇玑, celestial pivot), spiritually penetrating the qi’s caverns, communing above with Heaven. This is what is meant by the three palaces ascending and descending, the endless coming and going. Moreover, the character *dong* (洞) is composed of *shui* (水, \"water\") and *tong* (同, \"same\")—meaning the cavern is one with water.\n\nThe vast sea’s waters gather the flows of the eight directions and nine wilds, the celestial rivers. Scoop from it, and it is never exhausted; pour into it, and it is never full. Boundless and immeasurable, its depths cannot be fathomed. Therefore, those who cultivate the Dao all proceed from the coarse to the fine, from the fine to the subtle. When subtlety reaches its limit, it attains the wondrous; when the wondrous reaches its limit, it attains the mysterious. When the Dao is mysterious, there is nothing it does not penetrate.\n\nThus, *dong* signifies its profound depth, unfathomable; *xuan* (玄, \"mysterious\") signifies its subtlety, inexhaustible. These teachings are arcane and far-reaching, deep as the *Dongxuan*. Without innate excellence from the Jade Void, who could penetrate them?\n\n*The Marvelous Scripture of Salvation Spoken by the Numinous Treasure Heavenly Worthy*\n\nThe Numinous Treasure Heavenly Worthy is the Supreme Dao Lord. In terms of the body: *ling* (灵, \"numinous\") is spirit; *bao* (宝, \"treasure\") is qi; form is the dwelling of the numinous treasure.\n\nHumans have ears and eyes, the gates of the primordial spirit. By day, when the heart is awake, the spirit roams through the ears; by night, when the eyes sleep, the spirit returns to the Crimson Palace. The common folk direct their seeing and hearing outward, so the spirit wanders externally. Encountering sights and sounds, it is stirred within. The spirit’s nature transforms into emotion; emotion is entangled, giving rise to thoughts. By day, there are thoughts; by night, dreams—endlessly chasing, scattering in pursuit of boundless desires. The hundred spirits grow weary and dissipate; the dwelling, bereft of treasure, collapses. This is all due to using the spirit externally rather than guarding it within.\n\nAs for the *zhenren* (perfected person), all dharmas are forgotten, and only the spirit is guarded. The eyes turn inward, and the spirit’s light illumines the Jade Tower; the ears reverse their hearing, and the wondrous tones resound in the Jasper Chamber. The spirit’s abode is profoundly settled, not a single thought arises. Wisdom and tranquility nurture one another; over time, the Dao becomes numinous. Above, it reaches Heaven; below, it coils upon Earth. The six penetrations and four openings manifest boundless wondrous function. Creation cannot alter it; yin and yang cannot fathom it. Thus, one can ride the light and mount the whirlwind, ascend to truth and merge with the Dao—all through the spirit’s nature. How can this not be called *ling* (numinous)?\n\nHumans have nose and mouth, the gates through which the treasure of life enters and exits. With every breath, they commune with Heaven and Earth, the comings and goings of primordial qi. With each exhalation, valley qi departs; with each inhalation, primordial qi enters. The mechanism of immortality and the essence of longevity lie hidden here.\n\nThe common folk’s hearts and spirits stray outward; their emotions are restless, their qi hurried. Their breath is confined to the throat, the fetal origin scatters, true qi withers, and when qi is exhausted, life ends. How lamentable!\n\nOnly the *zhenren* profoundly comprehends the source of creation, breathing the qi of Great Harmony. They seize the root and return to the origin, reverting to the mandate and restoring life. Their breath reaches the heels. There is no treasure greater than qi. Those who grasp this principle know that the Mud Pill Palace and Jade Tower are where the spirit dwells, while the Mysterious Gate and Female Portal are where qi is gathered. Qi governs the spirit; the spirit commands qi. Mother and child guard one another; nature and life merge. Then the myriad spirits do not scatter, and one becomes *ling* (numinous). When a single qi congeals, it forms the treasure—this is the numinous treasure of the body.\n\nThe suffering of sentient beings is none greater than the cycle of rebirth and death. The Heavenly Worthy, in great compassion, expounded the profound and wondrous teachings, opening the gate of stagnation and pointing the way of radiant light. Those who awaken through these teachings escape birth and death, forever freed from the wheel of rebirth—hence it is called \"deliverance from suffering.\"\n\nThe *jing* (scripture) is the path, the constant. It is meant for those who pursue the higher learning to follow this path and practice it unceasingly. At that time, the Heavenly Worthy of Deliverance from Suffering—the Heavenly Worthy is none other than primordial qi. The Dharma-body is formless; accumulated qi becomes the true. It is the most revered in heaven. When gathered, it takes form; when dispersed, it returns to qi. Pervading the ten directions, primordial qi is vast enough to encompass all, subtle enough to penetrate all. In valleys, it fills valleys; in pits, it fills pits. It suffuses the eight extremities, present wherever one turns—hence it is said to pervade the ten directions.\n\nEver through its numinous power, it delivers and uplifts all sentient beings. No power is greater than primordial qi, for its movement alone holds the authority of creation. Sentient beings—whether born from womb, egg, moisture, or transformation; whether flowers, grasses, trees, birds, beasts, fish, or turtles; whether crawling, flying, or wriggling; whether endowed with consciousness or not—all are nurtured and brought to life by primordial qi. Where primordial qi abides, the soft and weak flourish and grow; where it departs, the hard and strong wither and die. Laozi said: \"The soft and weak belong to the realm of life; the hard and strong belong to the realm of death.\" All things possessing form, sound, or appearance are but phenomena, and all arise only after receiving primordial qi—hence it is said to deliver all sentient beings from suffering, guiding them to depart from the path of delusion.\n\nSentient beings, unaware and unenlightened, are like the blind beholding the sun and moon. They cling to sensory pleasures and desires, lost in the labyrinth of delusion, unaware that fish dwell in water while water dwells in fish, and humans dwell in qi while qi dwells in humans. Fish perish when parted from water; humans die when parted from qi. A fish large enough to swallow a boat, once stranded on dry land, may be tormented by ants—thus it is said that fish cannot leave the depths, nor humans depart from qi. If fish can inhale and exhale to transform water, they do not die; if humans can inhale and exhale to transform qi, they attain longevity.\n\nThe world knows only to consume grains, meats, fruits, and vegetables to sustain life, yet does not realize that these are but forms of slain beings. All that possesses form belongs to yin, being the essence of earth, while only primordial qi belongs to yang. With each exhalation, qi extends three inches; with each inhalation, qi retreats three inches. One exhalation and one inhalation make a single breath. In a day and night, there are thirteen thousand five hundred breaths, and true qi traverses eight hundred ten *zhang* in ascent and descent through the nostrils and mouth. The common person cannot grasp this, and all qi scatters into emptiness. If a single breath does not return, life ends abruptly.\n\nThis scripture contains the secret of nurturing qi and preserving spirit to attain immortality, yet the foolish of the world fail to grasp its essence, like the blind who, though the sun and moon shine with great brilliance, cannot see them—hence it is said they are like the blind beholding the sun and moon.\n\nI originate from the Great Nothingness, lifting the tassel beyond all bounds. Primordial qi resides in the vast emptiness of the Great Void, like a bellows ever expanding and contracting. Because it is nothing, it can enter the unbroken; thus it is said to be formless yet possessing essence. To lose it is death; to obtain it is life. From ancient times to the present, those who attained the Dao and ascended as immortals are beyond count, all having mastered the use of primordial qi to become true—hence it is said to lift the tassel beyond all bounds.\n\nAuspicious clouds open the Gate of Life; propitious mists seal the Portal of Death. Herein lies the eye of this scripture and the pivot of deliverance from suffering. Auspicious clouds and propitious mists are alternate names for the wondrous qi of Great Harmony. The Gate of Life and Portal of Death are designations for the Mysterious Gate and Female Portal. Some call them the Gate of Heaven and Earth, or the Portals of Qian and Kun. Wherever gates and portals are mentioned, there must be something that enters and exits through them.\n\nTo open is to part; to close is to seal. The *Book of Changes* says: \"Closing the portal is called Kun; opening the portal is called Qian.\" One closing and one opening make a transformation; ceaseless coming and going is called the Dao. That by which heaven and earth endure long and unceasing is this very principle. Those who wish to attain longevity and eternal vision, to equal heaven and earth in years, must within the Gate of Life and Portal of Death thoroughly investigate the origins of passage and obstruction, and fathom the wonders of creation. They must ensure the ceaseless circulation of the yin and yang qi of heaven and earth in ascent and descent—this is called \"exiting the sun and entering the moon,\" or \"exiting the pure and entering the mysterious.\"\n\nWithout encountering the guidance of a perfected one, even the most learned cannot hear of this, for its nature requires personal awakening, and its destiny depends on transmission by a teacher. I, having formerly received my master’s profound instructions, now dare to reveal the unspoken true mechanism of the Most High and display the sacred secret. Scholars should study it diligently. The secret states:\n\nThe Gate of Life and Portal of Death—under a thousand names they vary,\nOne called the Crimson Abyss, another the Spirit Hut.\nThe lesser adept does not comprehend—nose inhales, mouth exhales,\nYet the key to immortality lies in this, unmatched by all things.\nAuspicious clouds and propitious mists—now ascending, now descending,\nOpening and filling, obstructing and sealing—cloud essence and purple marrow.\nGather the white blossoms—soaring scenes in empty space,\nQi enters the body—its savor surpasses ghee.\nLike the tortoise drawing breath—communing with the numinous, never dying,\nLike the clam absorbing moonlight—nurturing and congealing the pearl.\nThe celestial mechanism is now revealed—those who encounter it must keep it secret.\nWhen merit is complete, one ascends lightly, riding the jade chariot.\n\nFirst, the Primordial Origin arises, communicating with the auspicious and responsive mechanism. The Great Dao first emerges from a single qi. This single qi initially becomes the Three Qi of the Primordial Origin—hence it is said, \"First, the Primordial Origin arises.\" The Three Qi coalesce to form the Three Pure Ones. The three colors intermingle in chaos, illuminating the vast emptiness. Each of the Three Qi then generates three luminosities, and three times three make nine, forming the Nine Heavens.\n\nThe *Chapter on Generating Spirit* states: \"One must extend and unite the Three Spirits, as the qi of the Primordial Origin divides.\" The *Yellow Court Scripture* says: \"The Three Qi revolve to the right, and the nine paths shine clearly,\" and also: \"The Nine Qi radiate brilliance, emerging between the heavens.\" Thus, the Three Qi are the lords of heaven and earth, and the Nine Qi are the roots of the myriad things.\n\nOne who can refine and explore the Three Primordial Qi of the Mysterious Origin, penetrating the auspicious mists and felicitous clouds, is said to grasp the pivot of creation—hence it is called \"to penetrate the auspicious and respond to the mechanism.\" This saves all sins and delivers all calamities.\n\nVast and boundless, one transcends the immortal source; vast and unobstructed, one attains natural purity. All this is borne of the power of the Great Dao, subduing all demonic essences.\n\nOf all sins, none is greater than the sin of death; of all calamities, none is greater than the calamity of death. Though human deaths may differ in ten thousand ways, they all converge into three paths. The death of the sage is called *spirit*; the death of the worthy is called *return*; the death of the common person is called *thing*.\n\nWhat is meant by the sage’s death being called *spirit*? The sage nurtures the sacred embryo within the chamber of spirit, giving birth to a body within the body. The yang spirit sheds its form, dying yet not perishing, transcending the embryo to become spirit—this is called an immortal.\n\nWhat is meant by the worthy’s death being called *return*? The worthy, while in the world, does not engage with things, their nature unattached. They regard life as a temporary abode and death as a return—*return* meaning *reversion*. Spirit and essence enter their gate, bones and skeletal frame return to their root. What remains of the self? They empty all that is possessed, and their numinous awareness, luminous and transcendent, emerges beyond things. Unbound by cyclic rebirth, unrestrained by the officials of the shades, they abide in serene freedom—even the joy of a king facing south cannot compare. Those who illuminate the mind and realize the nature—worthy ones, noble persons, and those of the Chan lineage—attain and verify the true and constant, forever free from entanglements. Yet if their insight remains unclear or their cultivation incomplete, if they cling to empty discourse or stagnate in visualization, they may ultimately be called *yin spirits*, *suffering souls*, or *ghostly immortals*. Should they seek liberation, they may seize a new vessel or enter a womb.\n\nWhat is meant by the common person’s death being called *thing*? The common person, while in the world, is ever entangled in dreams, thoughts, and attachments, constantly engaging with things, unable to transcend them. Thus, when their life is about to end, form and spirit cannot part—like a live turtle shedding its shell or a crab plunged into boiling water, their agony is manifold. After death, their realm is darkness, like a bird flying at midnight, bewildered and recklessly alighting, unaware of where they are bound. They are molded by the Creator, reborn according to their karmic consciousness, or transformed into other species without self-awareness. For the heart’s transformations are inescapable—just as the fiercest become tigers, the most lustful become women, or others become beasts, livestock, birds, or insects. Even if they regain human form, they are still called *things*. Thus, it is said the common person’s death is called *thing*.\n\nIf, at the moment of death, all parts of the body grow cold yet the crown of the head remains warm, this person has attained the Dao and directly ascends to the pure realm. If all parts grow cold yet the heart remains warm, they may regain a human body.\n\nThose who do not aspire to cultivate the Dao, who rush about in anxiety, chasing profit and fame, mired in sensual pleasures, day after day—are like oxen and sheep led to the slaughterhouse, each step bringing them nearer to death. Before death comes, should one not swiftly seek the supreme Dao, diligently practice it, perfect the true and deliver the world, and strive to escape the sins and calamities of life and death? Hence it is said: *This saves all sins and delivers all calamities.*\n\nWhen the Dao is perfected, one’s name is inscribed in the golden register, and one’s rank is listed among the immortal ministers. Jade maidens wield banners, immortal youths beat time, and one roams freely in the Upper Clarity. In the highest and most distant realms of the Great Veil, amidst the qi of the myriad heavens, vast and unobstructed, one attains ultimate purity. Thus it is said: *Vast and boundless, one transcends the immortal source; vast and unobstructed, one attains natural purity.*\n\nWearing the talisman, a thousand demons lose their courage; casting flowing gold, ten thousand spirits are destroyed in form. Thus it is said: *All this is borne of the power of the Great Dao, subduing all demonic essences.*\n\nWhat is that radiance in the void? It is called the Immortal of the Muddy Pellet. Emptiness encompasses the myriad dharmas, yet wondrous function resides within—hence it is called *in the void*. The inner landscape shines brilliantly, and in returning vision, one sees it alone—thus it is said: *What radiance!* The Muddy Pellet lies three inches directly inward between the brows. It is the chamber of brain blood, the jade chamber of the soul’s essence, the life-dwelling of the hundred spirits, the mountain source of fluids. It is also called the *Uppermost Red Child*, the supreme spirit of the bodily form—hence it is called the *Immortal of the Muddy Pellet*.\n\nPurple clouds cover the Yellow and the Old. When the qi of Metal and Wood intermingle, green and white merge to form azure mist; when the qi of Water and Fire harmonize in mutual completion, black and red transform into purple clouds. To refine one’s form and substance, nothing precedes true Water and true Fire. True Water is not the turbid water of saliva, fluids, or grain qi—it is the mysterious spring found within the wondrous qi of Great Harmony, the true Water of the One. One must discern the clarity or turbidity of its source.\n\nFire has no form; it arises from things. Without method, its calamity will surely strike. The fires of the immortals’ practice vary in degree. When employed, they extinguish the corpse and refine the po, transforming the body into pure yang. There are talismanic numbers and correspondences, the cycles of the celestial stems and branches, the revolutions of the sun and moon—all transmitted mouth-to-mouth, difficult to inscribe on bamboo or silk. The immortals have said: *\"The secrets of the immortals are easy to conceal but hard to transmit; the sages pass on the medicine but not the fire.\"*\n\nIf one practices Water but not Fire, qi cannot ascend; if one practices Fire but not Water, it cannot steam and pervade. Only when Water and Fire are mutually completed does the misty qi transform into purple clouds. Where spirit gathers, qi must attend—thus, purple clouds, lush and verdant, ascend to the Muddy Pellet, covering the Central Yellow and Old Lord. Thus it is said: *Purple clouds cover the Yellow and the Old.*\n\nThis is called the *Lord of the Three Treasures*. The Lord of the Three Treasures arises from the congealing and transformation of spirit, qi, and essence. Spirit has yin and yang; qi has purity and turbidity; essence has inversion and compliance.\n\nWhat is meant by spirit having yin and yang? If one relies on visualization and contemplation to achieve numinous communication, able to enter and exit the heavenly gates and foresee the unseen, this is called *yin spirit*. But if one accumulates the qi of yin and yang, coalescing them to form an auspicious body—a body born within the body, an immortal embryo that sheds its husk—this is called *yang spirit*.\n\nThe yang spirit becomes an immortal, while the yin spirit becomes a ghost.\n\nWhat is meant by qi having purity and turbidity? Heaven possesses form and substance; those containing blood and qi—such as grains, meats, fruits, and vegetables—grow by nourishing earthly roots. The character for *qi* (炁) is composed of *wu* (旡) and *fire* (火), signifying *grain qi*, also called *earthly qi*, hence it is called turbid. The wondrous qi of Great Harmony generates heaven and earth, spirits and gods, emperors and lords. Forcibly named as the Dao, it is qi; qi is the Dao. Invisible to the eye, inaudible to the ear, intangible to the touch—formless yet possessing form, imageless yet embodying image—it penetrates metal and stone, fills the eight wilds. The character for *qi* (炁) is composed of *wu* (旡) and *fire* (火), and fire is yang. Thus, it is the pure yang qi within the void and nonexistence.\n\nAccumulating yin qi leads to death; ingesting yang qi leads to life.\n\nWhat is meant by essence having inversion and compliance? Compliance gives rise to human form; inversion becomes the *Mother of the Elixir*. All these depend on the firing process, which involves ascent and descent. The union of husband and wife is called *kalpa fire*, which also passes through the Three Passes and penetrates the *Weilü*. Thus, following the natural course results in human birth. But if one contracts the *Golden Turtle*, this is called *civil fire*; closing the breath and circulating it is called *martial fire*; harmonizing with the sun and moon is called *tally fire*. Therefore, immortals and Daoists open the *Golden Lock*, pierce the *Jade Gate*, revolve the *Xuanji*, turn the sun and moon, allowing golden essence to penetrate the crown and silver waves to surge to heaven—this is called *counterflow*, hence it is said: *inversion becomes the Mother of the Elixir*. Compliance leads to bodily decay; inversion strengthens the bones.\n\nThe eyes are the gates of spirit; the nose and mouth are the doors of qi; the *Weilü* is the path of essence. The subtle and wondrous workings of the celestial and true sagely arts are all concealed within these. Thus, the perfected person inwardly gazes and reverses hearing to concentrate the spirit, inhales and exhales the Great Harmony to absorb its qi, and reverses the flow of the *Pearl Stream* to gather essence. The Three Treasures congeal and accumulate within the *Chamber of Spirit*, all transforming into spirit. Hence, it is called the *Lord of the Three Treasures*.\n\nReturning with the black of the upper heavens to restrain the nine heavens’ souls. The human head contains the *Nine Heavens*, also called the *Celestial Valley*, where the soul-spirit resides in the *Yellow Court*—what is meant by *above lies the soul-spirit, below the Pass of Origin*. The body delights in flavors; the spirit delights in qi. Heavenly qi is the sustenance of the yang spirit. The *Chapter on Generating Spirit* states: *The soul is born, roaming qi, drifting to refine the pristine essence.* Truly, the roaming qi is the heavenly qi of the upper heavens, which the soul-spirit seizes, for it delights in consuming qi. Thus, the qi of the upper heavens restrains the nine heavens’ souls. If the spirit does not obtain this single qi to restrain it, it cannot become numinous; if the valley does not obtain this single qi to fill it, it cannot become full. Without numinosity, the spirit will fear dissipation and depart from the body; without fullness, the valley will fear exhaustion and the *Celestial Valley* will become empty. Once the *Valley Spirit* departs, human life ends.\n\nIn the past, before encountering the primordial qi, it drifted away in boundless emptiness. Now, having awakened to the truth, it departs but has a place to return. Thus, it is called the *Great Return*. Returning with the qi of the upper heavens to restrain the nine heavens’ soul-spirits, only then does the *Valley Spirit* not die. Hence, it is said: *The spirit obtains the One and becomes numinous; the valley obtains the One and becomes full.*\n\nThe wondrous spirits of salvation see the time of deliverance. In the heavens above, all is undivided. Those who cultivate the supreme Dao must preserve their spirit whole. The spirit-whole person shines without dazzling, veiled to nurture correctness, thus able to return to the Great Uncarved Block, embrace emptiness and tranquility, merge into oneness, and stand alone. Their nature roams the boundless, utterly still realm, without the slightest stirring of knowledge—thus their spirit does not depart. Without the faintest arising of thought—thus their spirit does not scatter.\n\nMaster Meng said: *Preserving one’s heaven whole, the spirit does not retreat.* Guarding one’s heaven, the spirit’s radiance lingers, giving birth to the myriad spirits. Hence, they are called the *wondrous spirits*. As for deliverance from suffering, one must first deliver oneself. If suffering does not deliver itself, who can deliver it? When my Dao nears completion, even the great floods reaching the heavens cannot drown me; the great drought scorching mountains cannot burn me. Life and death hold no change for me—how much less the deaths of great cycles and kalpas? Beyond calamity and adversity, thus it is said: *they see the time of deliverance.*\n\nThis is the Dao of the *Returning Wind* merging with the *Emperor’s Unity*—unifying the hundred spirits within one’s own heaven, indivisible. Hence, it is said: *In the heavens above, all is undivided.*\n\nThe heavenly qi returns to the one body, all becoming *natural persons*. The heavenly qi arises before the *Great Simplicity*, transcending the myriad forms. It emerges and enters in clarity and brightness, abides in the divine mechanism to roll and unfold, purifying the azure of the high heavens, lightening the red of the setting sun. Unaffected by wind and rain, unstained by dust, it breathes through the *Mysterious Female’s Gate*, washes in the realm of the *Inaudible and Invisible*. It relieves hunger and thirst, removes filth and impurities, expels the *Three Corpses*, and dissolves the hundred diseases—this is the qi of the clear void and the possessed Dao.\n\nThe *Secret Formula of the Jade Emperor’s Divine Workings* states: *Those who know the supreme Dao are not killed by heaven; those who ingest primordial qi are not destroyed by earth.* Understanding the principles of exhalation and inhalation, one can daily absorb the sun’s radiance and essence, the moon’s brilliance and bloom, the *Three Primes*, the *Five Sprouts*, and the *Primordial Emperor’s Upright Qi*—all these are heavenly qi. When the Great Harmony enters the body, bones and flesh become light and clear, a round image appears at the nape, and concealment and manifestation occur naturally. Only then can one become a *natural person*. Hence, it is said: *The heavenly qi returns to the one body, all becoming natural persons.*\n\nIf it arises from unclean places, affected by dryness and dampness, mixed with foul and putrid food and drink, or tainted by the vapors of tombs and graveyards, this is the turbid, foul, stagnant *dead qi*—shunned by the Dao of immortals. Thus, immortals often dwell in lofty towers to be nearer to heavenly qi. The *Yellow Court Scripture* states: *Most taboo is the dead qi and all foul impurities.*\n\nThe natural has a distinct body, originally within the empty and cavernous. The empty and cavernous leave no trace, yet the entire body is void. Laozi said: *Heaven follows the Dao; the Dao follows the natural.*\n\nThe Dao of Heaven models itself upon the *natural person*—how could one not embody this? The body without form is originally the unblemished infant, self-rooted and self-originating, existing thus since ancient times. Laozi said: *Profound and still, it seems to endure—unknown whose child it is, appearing before the Lord of Heaven.* This is what is called the *distinct body*. Moreover, the brain palace is round and void, perfectly attuned to the real; thus the Lord of Heaven resides there, and the *Mud Pill* becomes the mansion of the empty and cavernous. The *Yellow Court Scripture* states: *Ask whose child dwells within my body, where has this one gone to enter the Mud Pill?* This speaks precisely of this.\n\nTherefore, guarding the spirit means restraining the restless heart. If one guards the spirit without loss, becoming one with it, one forgets even the traces of what is guarded—hence it is said: *The empty and cavernous leave no trace, yet the entire body is void.* When the essence of oneness penetrates, one transcends the realm of the ten thousand images. The spirit roams the boundless expanse of true emptiness, and the entire body becomes vast and void.\n\nFirst, the *commissioned qi* takes its place.\nSecond, the *qi of compliance* arises.\nThird, the ten thousand laws are completed.\nFourth, one presides over light and illumination.\n\nLiezi said: *Life is not my possession; it is the commission of harmony from Heaven and Earth.* Examining its origin, the body was originally non-existent; it stands only through the commission of the two *qi* of Heaven and Earth as parents—hence it is said: *First, the commissioned qi takes its place.* Knowing this body is born of *qi*, one should not violently oppose it, causing its premature obstruction. One must urgently return the heavenly *qi* to the body, making it continuous and unbroken. Embryonic breathing returns to the root, and *qi* is received in compliance—naturally, one attains longevity. Hence it is said: *Second, the qi of compliance arises.*\n\nThe *perfected person* lifts and carries Heaven and Earth, grasps and wields yin and yang. The cosmos lies within their hands, and the ten thousand transformations arise within their body. They can transform form into *qi*, thus becoming inexhaustible. Without transformation, one becomes spirit; the spirit’s inexhaustibility lies in its merging with the Dao. The Dao merges with the natural. Following the law to enter the Dao, the law is easily attained; following the Dao to enter the law, the law is easily accomplished. If one law is grasped, then all laws are mastered—hence it is said: *Third, the ten thousand laws are completed.* When the Dao is accomplished, one’s crown bears the round image, and the body radiates light—hence it is said: *Fourth, one presides over light and illumination.*\n\nThe *Essentials of the Five Classics* further states: *The Wondrous Scripture for Saving from Suffering originates from the Hidden Writ of the Azure Empyrean—it is the secret text of refinement and deliverance.* Its guiding principles number four, with the essence lying in presiding over light and illumination:\n\nFirst, the *commissioned qi* takes its place. At the beginning, the Primordial One divided the one *qi* to distinguish Heaven and Earth, circulating and transforming yin and yang, becoming the root of the ten thousand things. This is what Master Zhou meant when he said: *The Supreme Ultimate moves and generates yang; it is still and generates yin. Yang transforms and yin unites, giving rise to wood, fire, metal, water, and earth.*\n\nSecond, the *qi of compliance* arises. Once Heaven and Earth are distinguished and yin and yang established, humans receive their harmonious *qi* to come into being. This is what Master Zhou meant when he said: *The essence of the two and five wondrously unite and congeal. The way of Qian becomes male; the way of Kun becomes female. The ten thousand things are transformed and born.*\n\nThird, the ten thousand laws are completed. Once the human way is established, sages and worthies emerge among them, setting forth guiding principles and establishing systems—what is called *rectifying virtue, enhancing utility, and enriching life.* Thus the human way is inexhaustible. This is what Master Zisi meant when he said: *Cultivating the Dao is called teaching.*\n\nFourth, one presides over light and illumination. Light and illumination are the essence of nature. *Presiding* means honoring it as lord. If one honors this light and illumination, always making it the master of the body, then in movement and stillness, speech and silence, all obey its command. Naturally, within the numinous terrace, all is open and unobstructed; nothing can obscure it, and the embodiment of the Dao is complete. This is what *The Doctrine of the Mean* calls *revering the power of virtue*, what *The Great Learning* calls *illuminating the luminous virtue*, and what Zhuangzi calls *the true lord.*\n\nThis light and illumination is possessed by all. It does not exist because of Yao nor perish because of Jie; it is not increased by Yan nor extinguished by Zhi. Grasping it, one becomes worthy; abandoning it, one becomes foolish. Attaining it, one ascends to heaven; losing it, one sinks into hell. All the myriad torments of hell—burning, boiling, slaughter, and dismemberment—arise from losing this light and illumination.\n\nThe heavens above hold thirty-six; the earth below holds thirty-six. The Great Mystery is boundless—wondrous indeed is the *Great Cavern Scripture.* These words refer to the thirty-six revered scriptures of the Three Caverns and Three Vehicles. In the first kalpa of the Dragon Han era, the Celestial Worthy of Primordial Beginning revealed the twelve divisions of the *Cavern-Real Scripture*, expounding the Dao of the Nine Sages. In the first kalpa of the Crimson Brightness era, the Dao Lord of the Supreme revealed the twelve divisions of the *Cavern-Mystery Scripture*, expounding the Dao of the Nine Perfected. In the first kalpa of the High Sovereign era, the Supreme Lord Lao revealed the twelve divisions of the *Cavern-Spirit Scripture*, expounding the Dao of the Nine Immortals. In total, over eight thousand scrolls were composed, weaving the *qi* of soaring mystery. The Five Directions’ Purple Scripts blazed in the Great Empyrean; their eight-cornered radiance shone in the Azure Vault. The Heavenly Perfected and August Person took up the brush to inscribe them.\n\nThe thirty-six divisions were concealed in the Purple Tenuity’s Golden Portal in the heavens above. The peerless lofty perfected, together with the Ten Spirits and Five Elders, jointly guarded and protected them. The Celestial Worthy of Primordial Beginning and the sagely beings of the heavens above all paid homage to their sacred texts thrice each month. They were never transmitted to the world below—hence it is said: *The heavens above hold thirty-six.* The Primordial Beginning further concealed the thirty-six divisions in the Dragon Palace to guard the grotto-heavens of seas and mountains—hence it is said: *The earth below holds thirty-six.* Thus, the Great Mystery is boundless—wondrous indeed is the *Great Cavern Scripture.*\n\nThe foolish and benighted speculate, some saying it refers to the yang number four times nine or the yin number six times six, others invoking the seventy-two seasonal markers. Such interpretations stray far from the profound purport—how could they be so deluded? The scriptures of the supreme vehicle have never spoken of derivative numbers.\n\nI take refuge in the Supreme Worthy, who can dissolve all sins.\nTaking refuge in spirit and life with the Supreme means never for a moment parting from the Dao. If one does not part from the Dao even for a moment, then the divine luminaries protect one, great fortune follows, and all actions meet with auspiciousness—what sins could there be?\n\nThe Celestial Worthy of the Treasure of the King of the Eastern Realm, Supreme in Heaven,\n\nThe Celestial Worthy of the Myriad Blessings of the Mysterious Perfection of the Southern Realm,\nThe Celestial Worthy of the Supreme Mystery of the Western Realm,\nThe Celestial Worthy of the Jade Dawn of the Mysterious Above of the Northern Realm,\nThe Celestial Worthy of the Deliverance of Immortals and Supreme Sages of the Northeastern Realm,\nThe Celestial Worthy of the Nurturing of Life and Deliverance of Destiny of the Southeastern Realm,\nThe Celestial Worthy of the Supreme Numinous Emptiness of the Southwestern Realm,\nThe Celestial Worthy of the Boundless Great Splendor of the Northwestern Realm,\nThe Celestial Worthy of the Jade Emptiness and Luminous Sovereign of the Upper Realm,\nThe Celestial Worthy of the True Sovereign and Cavern Spirit of the Lower Realm.\n\nThe Dao declares: The Celestial Worthies of the ten directions are as numerous as grains of sand. Manifesting forms throughout the ten directions, they universally deliver and save the celestial and human.\n\nThe Celestial Worthies of the ten directions are the Numinous Treasure Celestial Worthies of the ten directions. Whenever the term \"Dao declares\" appears, it refers to the words of the Lord of the Dao. This scripture was spoken by the Numinous Treasure Celestial Worthy, who is the ancestral master of the myriad heavens, the healing king of the three realms, the Jade Sovereign of the Supreme Great Dao. Dwelling in the Perfected Realm of Supreme Purity, within the Palace of the Elixir Pearl and the Sun, he transforms his form into auspicious light and numinous qi, flowing throughout the realms of the ten directions to universally deliver celestial and human beings.\n\nNow, those of celestial and human nature are humble, reverent, and broadly giving; their virtue is magnanimous and tolerant. Serene and gentle, their demeanor is harmonious. They cherish and respect their teachers and friends, and upon hearing the Dao, they firmly believe. These are those endowed with the qualities of celestial and human beings. The Celestial Worthy then transforms his body to descend, bestowing upon them the supreme Dao, delivering and perfecting them—thus it is said, \"universally delivering celestial and human beings.\"\n\nAs for those whose roots are impure and evil, who do not uphold precepts and conduct, whose nature delights in slander and killing, and who laugh upon hearing the Dao—these are like those who have lost their way. It is not that the Dao has failed them, but that they have failed the Dao.\n\nAccumulating qi and amassing merit,\nLiezi said: \"When qi gathers, life arises; when qi scatters, death ensues.\" Knowing that qi gathering brings life, one cannot prevent it; knowing that qi scattering brings death, one cannot halt it. Since primordial qi cannot be restrained, life belongs to the creator and not to oneself. The perfected attain its essential pivot and can grasp the breath of inhalation and exhalation. As the breath enters and exits under their control, their life rests with them and not with heaven. What the vulgar call \"nurturing breath\" is in truth the transmitted sacred teaching of the immortals, enlightening the foolish—who can awaken to it? Those who awaken can guide their breath to prevent its scattering, naturally accumulating harmonious qi within a single breath. Over time, as merit and virtue accumulate, they naturally attain perfection—thus it is said, \"accumulating qi and amassing merit.\"\n\nResonating in harmony to save sinners,\nLaozi said: \"Those who harmonize with the Dao, the Dao also attains.\" If one diligently seeks the gate of the master, delights in the profound principle, and exhaustively studies the scriptures and teachings with an undivided mind devoted to the Dao, this is called \"resonating in harmony\" and \"seeking those of the same qi.\" Only then can one speak of the supreme Dao and deliver them—thus it is said, \"resonating in harmony to save sinners.\"\n\nSinners are truly pitiable; I now expound this wondrous scripture.\nWhen a person is conceived in the womb, for ten continuous months, they breathe as their mother breathes, inhale as she inhales. With qi complete and spirit intact, they emerge from the womb to be born, startling heaven and earth to become human—this is called infancy. The heart of an infant values only the mother’s milk, knowing nothing else. This is the time of embracing the true and holding to simplicity. After a hundred days, they are enticed by external things, emotions manifest outwardly, and soon they can smile—transforming from infancy to childhood. From this point begins the loss of the Dao and the departure from simplicity. Then, at fifteen, they become youths; at twenty, they come of age. Their eyes are dazzled by the five colors, their ears confused by the five sounds. The seven emotions usurp their nature, the six desires muddy their authenticity, and their pure simplicity is entirely lost. Day and night, they die and are reborn ten thousand times, driving and exhausting their ethereal and corporeal souls without a moment’s rest. Such is the plight of worldly people, enduring the torments of the unceasing hells in their embodied existence, sinking and drowning without hope of escape. Without attaining the Dao, who can be freed? These sinners are truly pitiable. Therefore, the Celestial Worthy widely opens the gate of salvation from suffering, broadly revealing the subtle and wondrous scriptures. The sacred domains of the Three Clarities lie open for return.\n\nRecite without ceasing, return the body without pause.\nWith a single thought devoted to the Dao, recitation never ceases; delving into the immortal scriptures, contemplation never halts. Since recitation knows no rest, profound mysteries and hidden wonders merge with the natural. The *Scripture of Inner Observation* states: \"When qi enters the body, it is called life; when spirit departs from form, it is called death.\" Thus, the sage steals and gathers celestial qi, returning it to the body. The sagely work is subtly employed, reversing the cycle of day and night without pause—thus it is said, \"return the body without pause.\"\n\nHeavenly halls enjoy great fortune; hells are silent of suffering.\nHeavenly immortals do not depart from heaven, divine immortals do not depart from the divine, earthly immortals do not depart from earth, alchemical immortals do not depart from ingesting elixirs and minerals, and ghostly immortals do not depart from yin spirits. These are the results of the paths they practice, just as water flows to the damp, fire to the dry, clouds follow the dragon, and wind the tiger. Those who cultivate the higher studies concentrate spirit and refine qi, return to life and restore the root, transform their bodies into pure yang, and transcend the kalpas of the dust. Chewing the morning mist, swallowing the nocturnal dew, the two luminaries entwine, the six qi converge upon the body. Inhaling the cloud essence of the Great Brahmā, their wondrous work fully partakes of the celestial kitchen. Naturally, they attain longevity and return to the heavenly halls—thus it is said, \"heavenly halls enjoy great fortune.\" Not consuming the grains of the hundred crops or the essence of the earth, their bodies do not die. Returning to earth, they are free from the suffering of descent—thus it is said, \"hells are silent of suffering.\"\n\nThe fire-obscuration transforms into pure clarity.\nThe fire-obscuration is the name of a southern hell. Sentient beings are constantly scorched by the fire of desire, their eyes veiled by delusion—thus it is called the fire-obscuration. When the eyes move and the heart stirs, hell immediately appears. Yet upon awakening to the true teaching, the nature of heaven becomes radiant and clear. With a single thought profoundly still, the so-called fire-obscuration is transformed into a realm of purity.\n\nThe sword-trees transform into towering canopies.\nThe sword-trees are the name of a hell, where sentient beings vie for fame and profit, contend over self and others, and engage with things as if wielding blades and grinding edges. Their exchanges are like spear and halberd, their faces like those of sworn enemies—thus they suffer the hell of sword-trees. When the perfected one embodies the Dao, embracing vast luminosity and greatness, acting without contention, the thorns in their breast all transform into jade trees and towering forests.\n\nAscend above to the Vermilion Mansion, descend below into the Gate of Radiant Opening.\nThis speaks of circulating the fire. The heart is the Vermilion Mansion, called the sovereign fire of upper darkness. By closing the breath and sitting in repose, guiding it with the heart, there is nowhere it does not burn. The kidneys are the Dark and Mysterious Mansion, called the ministerial fire of middle darkness. Rising through the waist, flanks, and abdomen while closing the breath and circulating it, there is nowhere it does not reach. The bladder is called the civil fire of samādhi. By activating the mechanism, the golden tortoise exhales flames, and there is nowhere it does not ascend. Refining the upper corpse, the fire-qi ascends to the Crimson Palace—thus it is said, \"ascend above to the Vermilion Mansion.\" Burning the lower corpse, the fire-qi penetrates the Gate of Tailbone—thus it is said, \"descend below into the Gate of Radiant Opening.\"\n\nTranscend the trials of the Three Realms.\nPeople of the world have their heads beneath the heavens of desire and their feet upon the earth of desire, their bodies dwelling in the Realm of Desire, endlessly revolving within the karmic wheel of the six desires. Never forgetting desire, if one can constantly be without desire, the trials of the Three Realms’ transmigration are instantly transcended.\n\nDirectly ascend to the Heaven of Original Beginning.\nThe Heaven of Original Beginning is the sacred realm of Jade Clarity. When the supreme Dao is accomplished, the spirit ascends to Jade Clarity, attaining the rank of Perfected One. Emerging, all heavens attend their carriage, and the ten thousand spirits stand guard—elevated above the Perfected of Great Clarity and Highest Clarity.\n\nThen, the flying heavenly perfected ones, countless in number, gaze upon the honored countenance and offer this ode:\nThe eight pieces of the human skull are called the Eight Heavens, also known as the Eight Gates. Within them lie golden towers, jeweled halls, jade pavilions, and purple chambers. Though formless in oneself, the Perfected One presides over all, and the ten thousand spirits dwell therein. When the Dao is accomplished, the divine light illumines within, and the heavenly gates open of themselves. The Infant and Maiden shed their forms, and thus the Perfected One flies forth from the heavenly gates—hence the name \"flying heavenly perfected ones.\" The thousand perfected and ten thousand spirits within the body are the countless multitude.\n\nThe *Scripture of Salvation* states: \"Above, the Eight Gates open, and the flying heavenly Dharma-wheel turns.\" The *Chapter on Generating the Spirit* says: \"Rejoice in this shedding of the Infant’s form\"—this is precisely what it refers to. The spirit ascends to the Dark Capital, ascending to pay homage to the Celestial Venerable—thus it is said, \"gaze upon the honored countenance and offer songs,\" praising the virtue of the Great Sage.\n\nThe Heavenly Worthy expounds the scriptural teachings, guiding and receiving the floating lives.\nThe office of heaven is to cover, the office of earth is to bear, and the office of the sage is to transform through teaching. Thus, the Heavenly Worthy broadly disseminates scriptural teachings to guide and receive the floating lives of the world—this is the duty of the sage.\n\nDiligently cultivate and study non-action.\nNon-action that acts is called the Dao; non-action that speaks is called virtue. Heaven is non-active in its clarity, earth is non-active in its tranquility. The two non-actions combine, and the ten thousand things are born—how can humans not practice non-action? Thus it is said: \"Serene, tranquil, empty, and non-active—this is the equilibrium of heaven and earth and the essence of the Dao and virtue.\" The diligent cultivator, the lofty person who abandons learning, can align with non-action, harmonizing with the equilibrium of heaven and earth and conforming to the essence of the Dao and virtue—is this not grand?\n\nAwaken to the true Dao and naturally attain accomplishment.\nTo awaken to the truth is to realize that the ten thousand conditions are all illusory, and only the Dao is real. Embracing and guarding the real, one naturally attains the Dao.\n\nNeither deluded nor dissipated.\nWorldly people are deluded by fame, profit, emotions, and desires, and dissipated by sounds, colors, flavors, and pleasures. Deluded again and again, they reach dissipation—dissipation meaning their spirit is unclear, their heart-mind follows things, drifting away without return. Laozi said: \"So dissipated! It has not yet reached its center\"—this decisively speaks of never having guarded the center. The perfected one treads the level and easy, walks the serene and joyful, calmly and alone, their spirit and brightness united in vision. All under heaven are but toil and illusion, like wind-blown lamps, foam, lightning, and bubbles—neither enduring nor substantial, unworthy of attachment. Entering the realm of supreme stability and true constancy, where not a single thought arises and the ten thousand conditions cease—at this境界, how could there be any dissipation or delusion?\n\nNeither self nor name.\nNot esteeming worthies or abilities, casting aside the self and emptying the body to depart the world—thus it is said, \"no self.\" The Dao is eternally nameless, and thus the sage conceals their light and hides their body, fearing that the Dao is not yet accomplished while their name surpasses their reality. Name is the guest of reality; when empty fame arises, the Dao and virtue are complete—thus it is said, \"endlessly, it cannot be named.\" Zhuangzi said: \"The spirit-person is without merit, the perfected one is without self, the sage is without name.\"\n\nClearly chant the verses on sin and fortune,\nProclaiming transformation through teaching.\nTen thousand times, the filth of the heart is cleansed.\nThrough profound study of the sacred canon, the numinous palace becomes empty and bright.\n\nThen, the flying heavenly spirit-kings and all the immortals, having recited this ode, bow their heads to the Heavenly Worthy, take their leave, and withdraw.\nThe flying heavenly spirit-kings are the original sovereign spirits of our inherent nature. The divine transformations, though many, unite as one—not transforming due to insufficiency but manifesting as the ten thousand, not due to excess. The various immortals are the ten thousand spirits of oneself. Bowing their heads to the Heavenly Worthy, they eternally follow the great Dao. Taking their leave and withdrawing, they return to the Ultimate Non-Being.\n\n*Commentary on the Wondrous Scripture of Salvation Spoken by the Heavenly Worthy of the Numinous Treasure of Supreme Mystery and Cavernous Mystery* concludes.\n\n*Commentary on the Wondrous Scripture of Salvation Spoken by the Heavenly Worthy of the Numinous Treasure of Supreme Mystery and Cavernous Mystery*\nScripture Title: *Commentary on the Wondrous Scripture of Salvation Spoken by the Heavenly Worthy of the Numinous Treasure of Supreme Mystery and Cavernous Mystery*. Composed by Dongyangzi, a Daoist of the Song-Yuan period. One fascicle. Source of the base text: *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Section, Jade Instructions Category.\n\n*Preface to the Wondrous Scripture of Salvation of the Numinous Treasure of Supreme Mystery and Cavernous Mystery*\nThose who study the Dao of long life and enduring vision must refine qi and nurture spirit, practicing both simultaneously.\n\nYet the work of refinement and nurturance fundamentally resides in the One Mind. If the mind can diligently cultivate itself, then what hindrance remains to attaining immortality? As the *Declarations of the Perfected* states: \"Immortality is the study of the heart—profound indeed is this principle.\"\n\nI have long admired the pursuit of true reality, though I have yet to encounter a perfected master. Should there be one who can clarify life and death, who penetrates the nature of destiny, I would kneel at their footsteps to seek instruction. Recently, while traveling between Mount Wuyi and West Lake, I chanced upon Master Lü of Siming. At our first meeting, we rejoiced, and soon formed a bond as friends of the misty groves. Together, we returned, and he took residence in my quiet abode.\n\nMaster Lü, styled Dongyangzi, early in life met a perfected being and devoted himself to the teachings of Zhuangzi and Laozi. His mastery of immortal scriptures is vast, and no question lies beyond his understanding. One day, he said to me: \"There exists in the world a *Scripture of Salvation*—truly the esoteric essence of the Great Cavern, the secret words of the Supreme Dao. Yet its depths are obscure and its subtleties profound, making its wondrous principles difficult to fathom. Though transmitted since ancient times, its annotations remain unilluminated. I wish to exhaust my store of knowledge to expound its meaning.\"\n\nBefore long, his work was complete—a flowing ten thousand words. It begins by clarifying the single luminous point, identifying auspicious clouds and propitious mists as the Great Harmony. It distinguishes the Gate of Life and the Door of Death as the Mysterious Female, separates the purity and turbidity of the Two Qi, and discerns the fire talismans of the Three Meditations. It reveals the Cavern Chamber as the destination of the enlightened true nature, and the return of celestial qi as the gathering of the treasure of destiny. In sum, it discusses the pivotal essentials of the Supreme Dao, encompassing all within its scope. This is not merely to awaken the unenlightened and aid later learners, but also to enable practitioners to thoroughly comprehend the workings of refinement and silently grasp the celestial mechanism—how could it be compared to empty words or vain rhetoric?\n\nAlas! The wondrous Dao and ultimate teachings of this scripture, long obscured, are now made manifest. The Heavenly Worthy, supreme among the heavens, expounds the Dharma to broadly deliver all beings. This so-called \"salvation from suffering\" is not solely established for the tormented souls of the departed; rather, its salvation extends to all living beings beneath the heavens. For it aims to guide every person to embody the Dao, to universally depart from delusion, to perceive the clarity of the celestial realm, and to awaken to the non-action of the true nature. Only then may one ingest celestial qi, steal from the void, congeal the sacred embryo, and commune with the numinous. When form and spirit unite in subtlety, one ascends in broad daylight—this is what it means to be a great person transcending the world, escaping the trials of the Three Realms’ cycle of rebirth. Only then is it called true salvation from suffering.\n\nHow vast! To transcend death and ferry across life—nothing surpasses this scripture. Those who encounter this commentary and attend to it without ceasing will surely witness their attainment of the Dao.\n\nRespectfully inscribed by Zhou Zhun, the Preserver of Authenticity of the Brocade River.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝天尊说救苦妙经注解 经名：太上洞玄灵宝天尊说救苦妙经注解。 宋元间道士洞阳子撰。 一卷。 底本出处：《正统道藏》洞玄部玉诀类。 太上洞玄灵宝天尊说救苦妙经注解 道神庵洞阳子注解 太上 太者至大之称，上者尊崇之号。 以其始乎太初太易之上，故曰太上。 夫太易者，未见炁也，元始之初炁未之见也。 太易变而为太初，太初者，炁之始也，先天元炁始见微芒。 太初变而为太始，太始者，形之始也，渐有元炁之形矣。 太始变而为太素，太素者，质之始也，元炁之形质具矣。 太素变而为太极，太极者，混沌也，溟涬鸿蒙，状如鸡子，其中有精，弥纶无外，元炁凝而清浊未分也。 太极既变则混沌开，而鸿蒙裂，於是清阳之炁升而为天，浊阴之炁降而为地。 《易》曰：太极生两仪，是也。 两仪生三才，即非浊非清，中和之炁，结而成人伦也。 是谓道生一，一炁之混沌也； 一生二，二仪之清浊也； 二生三，三才之人伦也，然后三生万物。 万物始之於天地，天地不能自有，有天地者太极也； 太极不能自生，生太极者太素也； 太素不能自育，育太素者太始也； 太始不能自孕，孕太始者太初也。 未有太初，先有太易。 夫太上者，谓始乎太初太易之上，是无大之大，故曰太，高出乎八极之表，故曰上也。 又太者甚也，上者高也，言是经妙义甚高，则无以过矣。 昔者圣人制此太字，其文从人从一从一点者，盖人得一谓之大，大人能卓然独存，常正此一点者，可与太上全体也。 此一点亘古亘今，不生不灭，在道则谓之元神，在儒则谓之真性，在释则谓之本来； 在眼能视，在耳能听，在鼻能嗅，在舌能尝，在手能执持，在足能步履。 以致语默动静，千转万变，未尝不因此一点而通灵也。 是以老君之炼养，养此一点而已； 庄周之寓言，言此一点而已； 周公仰思，思此一点而已； 孔子之潜心，潜此一点而已； 如来之大觉，觉此一点而已； 祖师之相传，传此一点而已。",
      "translated_text": "**The Supreme Cavernous Mystery Numinous Treasure Heavenly Worthy’s Explication of the Wondrous Scripture of Salvation from Suffering**\n\n**Title:** *Explication of the Supreme Cavernous Mystery Numinous Treasure Heavenly Worthy’s Wondrous Scripture of Salvation from Suffering*\nComposed by the Daoist Master Dongyangzi during the Song-Yuan transition. One fascicle.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Section, Jade Instructions Category.\n\n---\n\n**Explication of the Supreme Cavernous Mystery Numinous Treasure Heavenly Worthy’s Wondrous Scripture of Salvation from Suffering**\nAnnotated by Dongyangzi of Daoshen Hermitage\n\n**The Supreme (Taishang):**\n*Tai* (Supreme) denotes utmost greatness; *shang* (above) signifies the most exalted. As it originates beyond the *Taiyi* (Supreme Beginning) and *Taiyi* (Supreme Simplicity), it is called *Taishang* (The Supreme).\n\nNow, the *Taiyi* (Supreme Simplicity) is the state before *qi* manifests—the primordial *qi* of the Origin’s inception, yet unseen. The *Taiyi* transforms into the *Taichu* (Supreme Beginning), where *qi* first arises, and the precelestial primordial *qi* begins to reveal faint traces. The *Taichu* transforms into the *Taishi* (Supreme Commencement), where form first emerges, and the primordial *qi* gradually takes shape. The *Taishi* transforms into the *Taisu* (Supreme Simplicity), where substance first appears, and the primordial *qi* attains both form and essence. The *Taisu* transforms into the *Taiji* (Supreme Ultimate), which is the undifferentiated chaos—vast and boundless, resembling an egg. Within it lies essence, pervading without limit, as the primordial *qi* congeals yet remains undivided into purity and turbidity.\n\nWhen the *Taiji* transforms, chaos unfolds, and the primordial vastness splits. Thus, the pure yang *qi* ascends to become Heaven, while the turbid yin *qi* descends to become Earth. As the *Yijing* states: *\"The Supreme Ultimate generates the Two Modes\"*—this is the principle. The Two Modes generate the Three Powers, which are neither turbid nor pure but the harmonious *qi* that coalesces to form humanity. This is called: *\"The Dao gives birth to the One\"*—the undifferentiated *qi* of chaos; *\"The One generates the Two\"*—the purity and turbidity of the Two Modes; *\"The Two generate the Three\"*—the Three Powers of humanity. Thereafter, the Three give rise to the myriad things.\n\nThe myriad things originate from Heaven and Earth, yet Heaven and Earth cannot exist of themselves—they are possessed by the *Taiji*. The *Taiji* cannot generate itself—it is born of the *Taisu*. The *Taisu* cannot nurture itself—it is nurtured by the *Taishi*. The *Taishi* cannot conceive itself—it is conceived by the *Taichu*. Before the *Taichu* exists, there is the *Taiyi*. Thus, the *Taishang* refers to that which originates beyond the *Taichu* and *Taiyi*—the greatness beyond all greatness, hence *tai* (supreme), and the height beyond the eight poles, hence *shang* (above).\n\nMoreover, *tai* means \"utmost,\" and *shang* means \"lofty,\" signifying that the wondrous meaning of this scripture is so exalted that nothing surpasses it. In ancient times, the sages crafted the character *tai* (太) from *ren* (人, person), *yi* (一, one), and a dot, for when a person attains the One, they are called great. The great person, standing alone and upright, ever preserving this single point, may embody the entirety of the *Taishang*.\n\nThis single point spans past and present, neither arising nor ceasing. In the Dao, it is called the *yuanshen* (primordial spirit); in Confucianism, the *zhenxing* (true nature); in Buddhism, the *benlai* (original face). In the eye, it enables sight; in the ear, hearing; in the nose, smell; in the tongue, taste; in the hand, grasping; in the foot, walking. From speech to silence, movement to stillness, through myriad transformations, it never fails to communicate its numinosity through this single point.\n\nThus, Lord Lao’s refinement and nurturance concern only this point; Zhuang Zhou’s parables speak only of this point; the Duke of Zhou’s contemplation ponders only this point; Confucius’s profound absorption delves only into this point; the Tathāgata’s great awakening awakens only to this point; the ancestral masters’ transmission passes down only this point.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 755,
      "start_sentence": 0,
      "end_sentence": 37,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.05976963043213,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上洞玄灵宝天尊说救苦妙经批注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "百姓日用而不知，外为声色所荡，内为嗜欲所汨，昼随情爱，夜逐梦飞，念想攀缘，未尝暂息，此一点不正，心影常偏，为情欲诱之，使出於外，故成大字，以言乎流浪轮转，或为畜类也。 夫上字之文，从卜从一。 卜，度也； ，一，性也。 卜尔之一性，能谦逊居下者，则为上士矣。 江海以下百谷，则为百谷王； 小国以下大国，则取大国。 此孔子所以下渔父也。 夫下人不精，不得其真，井虽千仞，汲之水上，是以圣人不降则不升。 故曰贵以贱为本，高以下为基。 是知未尝先人而常随人，后其身而身先者，谦尊而光，此真人应世之道也。 故曰卜尔之一居下，则为上士，其理昭然，卜尔之一性，若乃自矜自伐，自是自彰，而好居人上者，斯则下人矣。 若夫体合太虚，廓然无我，所为一点者，内外俱忘，上下双遣，斯则至圣之道，可谓自己三清，何劳仰望，自己太上，何劳外求也。 洞玄 洞者通也，上通於天，下通於地，中有神仙，幽相往来。 天下十大洞、三十六小洞，居乎太虚磅砖之中，莫不洞洞相通，惟仙圣聚则成形，散则为气，自然往来虚通，而无窒碍。 是以圣人远取诸物，近取诸身。 则人一身之中，亦有洞者。 头有九宫，上有寥天，共为十大洞天； 柱骨二十四节，共十二重楼。 共三十六洞，上通泥九之九天，下彻尾闲之九地，中有真炁幽相往来。 是以圣人於虚极静笃之中，斡转璇玑，神通炁洞，上与天通，所谓三宫升降，上下往来，无穷者也。 且洞之一字，从水从同，即是洞与水同也。 夫巨海之水，八纮九野天汉之流，酌焉而不竭，注焉而不满，渺渺漫漫，无垠无际，不可得而测其渊深也。 故造道者，皆自粗至细，自细至微，微极而后至於妙，妙极而后至於玄，道之玄则无乎不通矣。 故洞也者，以其幽深而不可测也； 玄也者，以其微妙而不可穷也。 言是奥旨远邈，深如洞玄，非玉虚之夙挺，其孰能通之哉。 灵宝天尊说救苦妙经 灵宝天尊即太上道君也。 以身言之，灵者神也，宝者炁也，形者灵宝之宅舍也。 夫人有耳目，乃元神之门，昼则心寤，神游於耳，夜而目寐，则神归绛宫。 众人视听於外，则神游於外，见闻声色，动荡乎中，神性化而为情，情受牵缠，故心有念，动有着，昼有想，夜有梦，薾然驰逐。 驰逐於无涯之欲，百灵疲役而消散，宅舍无宝而崩颓。 此皆用神於外，而不能守之於内者也。 若夫至人，万法俱忘，惟神是守，目内视而神光炊於玉阙，耳返听而妙韵响於琼房，神宇泰定，一念不生，智恬交养，久而道灵，上际於天，下蟠於地，六通四辟，妙用无穷，造化莫移，阴阳莫测，故能驾景乘飙，登真合道，莫不由於神性者也，得不谓之灵乎。 夫人有鼻口，乃命宝出入之户，息息通於天地，元炁之所往来，凡一呼则谷炁出，一吸则元炁入，不死之机，长生之要，实隐於此矣。 众人心灵外驰，情躁炁促，息之以喉，胎元荡散，真炁凋零，炁竭命终，可不惜哉。 惟至人深达造化之源，呼吸太和之炁，夺本还元，归根复命，息之以踵，宝莫宝於炁，达斯理者，泥丸玉阙所以栖其神，玄门牝户所以袭其炁，炁以制神，神以摄炁，母子相守，性命混融，然后万神不散，故能灵，一炁凝结则成宝，是谓一身之灵宝也。",
      "translated_text": "The common folk use it daily yet remain unaware. Externally, they are swayed by sounds and sights; internally, they are drowned by cravings and desires. By day, they follow passions and affections; by night, they chase dreams in flight. Their thoughts cling and grasp, never ceasing for even a moment. When this single point is not aligned, the heart’s reflection remains askew. Seduced by emotions and desires, it strays outward—thus forming the character *da* (大, \"great\"), signifying the wandering and turning of the wheel, or even rebirth as beasts.\n\nNow, the character *shang* (上, \"above\") is composed of *bu* (卜) and *yi* (一). *Bu* means \"to divine\" or \"to measure\"; *yi* is \"nature.\" To divine and measure one’s own nature, and to dwell humbly below—this is to be an *upper scholar* (上士). The rivers and seas, by lowering themselves beneath the hundred valleys, become their king; a small state, by humbling itself before a great one, wins its allegiance. This is why Confucius deferred to the fisherman.\n\nYet if one’s humility is not refined, one cannot grasp its truth. Though a well be a thousand fathoms deep, drawing water from its surface yields nothing. Thus, the sage does not descend without ascending. Hence it is said: \"Nobility takes lowliness as its root; height takes lowness as its foundation.\" Know then that one who never seeks to precede others yet always follows them, who places the self last yet finds the self foremost—such a one is revered in humility and radiant in light. This is the Way of the *zhenren* (true person) in responding to the world.\n\nThus it is said: \"Divine and measure your nature to dwell below, and you become an upper scholar.\" The principle is luminously clear. But if one is self-aggrandizing, self-promoting, self-righteous, and self-displaying, delighting in standing above others—such a one is truly a *lower person* (下人).\n\nAs for one who embodies the Great Void, vast and egoless—where this single point is concerned, both inner and outer are forgotten, above and below are transcended. This is the Way of the utmost sage, wherein one attains the Three Clarities on one’s own. Why gaze upward in longing? One’s own Supreme Purity is already present—why seek it externally?\n\n*Dongxuan* (洞玄): *Dong* means \"to penetrate.\" Above, it connects to Heaven; below, to Earth; within, immortals and spirits traverse in hidden communion. The world has ten great *dong* (caverns) and thirty-six lesser ones, all residing within the boundless expanse of the Great Void. Each is interconnected, penetrating one another. Only when immortals and sages gather do they take form; when they disperse, they become qi, naturally traversing the void without obstruction.\n\nThus, the sage draws lessons from afar in things and from nearness in the self. Within the human body, too, there are *dong*. The head has nine palaces, above which lies the *Liaotian* (寥天), together forming the ten great *dongtian* (cavern-heavens). The spinal column has twenty-four joints, forming the twelve-storied tower. Together, these make thirty-six *dong*, ascending to the nine heavens of *Nijiu* (泥九) and descending to the nine earths of *Weixian* (尾闲). Within, the true qi traverses in hidden communion.\n\nThus, in the midst of extreme emptiness and profound stillness, the sage turns the *xuanji* (璇玑, celestial pivot), spiritually penetrating the qi’s caverns, communing above with Heaven. This is what is meant by the three palaces ascending and descending, the endless coming and going. Moreover, the character *dong* (洞) is composed of *shui* (水, \"water\") and *tong* (同, \"same\")—meaning the cavern is one with water.\n\nThe vast sea’s waters gather the flows of the eight directions and nine wilds, the celestial rivers. Scoop from it, and it is never exhausted; pour into it, and it is never full. Boundless and immeasurable, its depths cannot be fathomed. Therefore, those who cultivate the Dao all proceed from the coarse to the fine, from the fine to the subtle. When subtlety reaches its limit, it attains the wondrous; when the wondrous reaches its limit, it attains the mysterious. When the Dao is mysterious, there is nothing it does not penetrate.\n\nThus, *dong* signifies its profound depth, unfathomable; *xuan* (玄, \"mysterious\") signifies its subtlety, inexhaustible. These teachings are arcane and far-reaching, deep as the *Dongxuan*. Without innate excellence from the Jade Void, who could penetrate them?\n\n*The Marvelous Scripture of Salvation Spoken by the Numinous Treasure Heavenly Worthy*\n\nThe Numinous Treasure Heavenly Worthy is the Supreme Dao Lord. In terms of the body: *ling* (灵, \"numinous\") is spirit; *bao* (宝, \"treasure\") is qi; form is the dwelling of the numinous treasure.\n\nHumans have ears and eyes, the gates of the primordial spirit. By day, when the heart is awake, the spirit roams through the ears; by night, when the eyes sleep, the spirit returns to the Crimson Palace. The common folk direct their seeing and hearing outward, so the spirit wanders externally. Encountering sights and sounds, it is stirred within. The spirit’s nature transforms into emotion; emotion is entangled, giving rise to thoughts. By day, there are thoughts; by night, dreams—endlessly chasing, scattering in pursuit of boundless desires. The hundred spirits grow weary and dissipate; the dwelling, bereft of treasure, collapses. This is all due to using the spirit externally rather than guarding it within.\n\nAs for the *zhenren* (perfected person), all dharmas are forgotten, and only the spirit is guarded. The eyes turn inward, and the spirit’s light illumines the Jade Tower; the ears reverse their hearing, and the wondrous tones resound in the Jasper Chamber. The spirit’s abode is profoundly settled, not a single thought arises. Wisdom and tranquility nurture one another; over time, the Dao becomes numinous. Above, it reaches Heaven; below, it coils upon Earth. The six penetrations and four openings manifest boundless wondrous function. Creation cannot alter it; yin and yang cannot fathom it. Thus, one can ride the light and mount the whirlwind, ascend to truth and merge with the Dao—all through the spirit’s nature. How can this not be called *ling* (numinous)?\n\nHumans have nose and mouth, the gates through which the treasure of life enters and exits. With every breath, they commune with Heaven and Earth, the comings and goings of primordial qi. With each exhalation, valley qi departs; with each inhalation, primordial qi enters. The mechanism of immortality and the essence of longevity lie hidden here.\n\nThe common folk’s hearts and spirits stray outward; their emotions are restless, their qi hurried. Their breath is confined to the throat, the fetal origin scatters, true qi withers, and when qi is exhausted, life ends. How lamentable!\n\nOnly the *zhenren* profoundly comprehends the source of creation, breathing the qi of Great Harmony. They seize the root and return to the origin, reverting to the mandate and restoring life. Their breath reaches the heels. There is no treasure greater than qi. Those who grasp this principle know that the Mud Pill Palace and Jade Tower are where the spirit dwells, while the Mysterious Gate and Female Portal are where qi is gathered. Qi governs the spirit; the spirit commands qi. Mother and child guard one another; nature and life merge. Then the myriad spirits do not scatter, and one becomes *ling* (numinous). When a single qi congeals, it forms the treasure—this is the numinous treasure of the body.",
      "overlap_context": "to silence, movement to stillness, through myriad transformations, it never fails to communicate its numinosity through this single point.\n\nThus, Lord Lao’s refinement and nurturance concern only this point; Zhuang Zhou’s parables speak only of this point; the Duke of Zhou’s contemplation ponders only this point; Confucius’s profound absorption delves only into this point; the Tathāgata’s great awakening awakens only to this point; the ancestral masters’ transmission passes down only this point.",
      "start_char": 755,
      "end_char": 1983,
      "start_sentence": 38,
      "end_sentence": 76,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.62430214881897,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上洞玄灵宝天尊说救苦妙经批注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "夫众生之苦，莫大於轮回生死，天尊大慈，演说洞妙，开滞塞之门，指光明之路，解悟之者，得脱生死，永免轮回，故曰救苦也。 经者径也，常也，欲令上学之人依此径路常行之也。 尔时救苦天尊， 天尊则元炁是也，法身无相，积炁成真，为天中之尊，聚则成形，散复为炁。 徧满十方界， 元炁大无不包，细无不入，在谷满谷，在坑满坑，弥满八极，无往不在，故曰徧满十方界。 常以威神力，救拔诸众生， 夫威神力莫大於元炁，元炁之运，独秉造化之权。 众生者所谓胎卵湿化之四生，至於花卉草木，禽兽鱼鳌，蠕飞蠢动，有情无情，皆含育元炁而生，故元炁在则柔弱滋养而生，元炁去则坚强枯槁而死。 老子曰：柔弱者生之徒，坚强者死之徒。 凡有貌象声色者，皆物也，悉得元炁而后生，故曰救技诸众生。 得离於迷途。 众生不知觉，如盲见日月。 众生就染声色嗜欲，因於迷途之中，殊不知鱼在水中，水在鱼中，人在炁中，炁在人中，鱼失水死，人失炁亡。 吞舟之鱼砀而失水，则蚁能苦之，故曰鱼不可脱於渊，人不可离於炁，鱼能吐纳而化水则不死，人能吐纳而化炁则长生。 举世但知日食谷肉果菜以养命，而不知谷肉果菜乃戮形之物也，夫有故以其有形者属於阴，乃土地之精也，惟元炁属阳，且人一呼则炁出三寸，一吸则炁入三寸，一呼一吸为一息，一日一夜一万三千五百息，真炁计八百一十丈，升降於鼻口呼吸之间，凡夫不能掌握，皆归空而散，则一息不返，人命卒矣。 此经有养炁留神不死之诀，世愚不达其旨，譬如盲者虽有日月之大明，莫能见之，故日如盲见日月。 我本太无中，拔领无边际。 元炁在太空虚无之中，其犹橐钥嗡张不息，以其无有，能入於无间，故日有而无形，无而有精，失之则死，得之则生。 亘古通今，得道升仙者，莫计其数，皆得冲炁以为用始成真，故曰拔领无边际。 庆云开生门，祥烟塞死户。 一经之眼目，救苦之枢机，在於此也。 庆云祥烟乃太和妙炁之异名，生门死户乃玄门牝户之列号，或曰天门地户，或曰乾坤门户，凡言门户者，必有物从兹而出入也。 开者辟也，阖者塞也，易曰阖户谓之坤，辟户谓之乾，一阖一辟谓之变，往来不穷谓之道，天地所以能长且久者，以此也。 人欲长生久视，与天地齐其年，当於生门死户之中，穷通塞之端，究造化之妙，使通天地阴阳二炁，往来升降之不穷，谓之出日入月，亦曰出清入玄也。 不遇至人所指，非硕学之所能闻，以其性须自悟，命假师传也。 仆曩承师旨决以渊微，辄将太上不泄真机显露圣诀，学者宜精究之，诀曰： 生门死户兮千般异呼，一曰朱渊兮一曰神庐，下士不达兮鼻吸口吐，上仙枢要兮万类莫如，庆云祥烟兮既升且降，开通充塞兮云英紫腴，采集素英兮飞空之景，炁来入身兮味胜醍醐，像龟引息兮通灵不死，效蚌吸月兮涵养结珠，天机斯泄兮遇者秘密，功成轻举兮驾驭琼舆。 初发玄元始，以通祥感机。 大道始初发生乎一炁，一炁初为玄元始三炁，故曰初发玄元始。 三炁结而为三清，三色混沌，焕烂太空，三炁复各生三熙，迭三成九，即成九霄，而为九天也。 《生神章》云：须延总三灵，玄元始炁分。 《黄庭经》所谓三炁右回九道明，又曰九炁映明出霄间，即是三炁为天地之尊，九炁为万物之根。",
      "translated_text": "The suffering of sentient beings is none greater than the cycle of rebirth and death. The Heavenly Worthy, in great compassion, expounded the profound and wondrous teachings, opening the gate of stagnation and pointing the way of radiant light. Those who awaken through these teachings escape birth and death, forever freed from the wheel of rebirth—hence it is called \"deliverance from suffering.\"\n\nThe *jing* (scripture) is the path, the constant. It is meant for those who pursue the higher learning to follow this path and practice it unceasingly. At that time, the Heavenly Worthy of Deliverance from Suffering—the Heavenly Worthy is none other than primordial qi. The Dharma-body is formless; accumulated qi becomes the true. It is the most revered in heaven. When gathered, it takes form; when dispersed, it returns to qi. Pervading the ten directions, primordial qi is vast enough to encompass all, subtle enough to penetrate all. In valleys, it fills valleys; in pits, it fills pits. It suffuses the eight extremities, present wherever one turns—hence it is said to pervade the ten directions.\n\nEver through its numinous power, it delivers and uplifts all sentient beings. No power is greater than primordial qi, for its movement alone holds the authority of creation. Sentient beings—whether born from womb, egg, moisture, or transformation; whether flowers, grasses, trees, birds, beasts, fish, or turtles; whether crawling, flying, or wriggling; whether endowed with consciousness or not—all are nurtured and brought to life by primordial qi. Where primordial qi abides, the soft and weak flourish and grow; where it departs, the hard and strong wither and die. Laozi said: \"The soft and weak belong to the realm of life; the hard and strong belong to the realm of death.\" All things possessing form, sound, or appearance are but phenomena, and all arise only after receiving primordial qi—hence it is said to deliver all sentient beings from suffering, guiding them to depart from the path of delusion.\n\nSentient beings, unaware and unenlightened, are like the blind beholding the sun and moon. They cling to sensory pleasures and desires, lost in the labyrinth of delusion, unaware that fish dwell in water while water dwells in fish, and humans dwell in qi while qi dwells in humans. Fish perish when parted from water; humans die when parted from qi. A fish large enough to swallow a boat, once stranded on dry land, may be tormented by ants—thus it is said that fish cannot leave the depths, nor humans depart from qi. If fish can inhale and exhale to transform water, they do not die; if humans can inhale and exhale to transform qi, they attain longevity.\n\nThe world knows only to consume grains, meats, fruits, and vegetables to sustain life, yet does not realize that these are but forms of slain beings. All that possesses form belongs to yin, being the essence of earth, while only primordial qi belongs to yang. With each exhalation, qi extends three inches; with each inhalation, qi retreats three inches. One exhalation and one inhalation make a single breath. In a day and night, there are thirteen thousand five hundred breaths, and true qi traverses eight hundred ten *zhang* in ascent and descent through the nostrils and mouth. The common person cannot grasp this, and all qi scatters into emptiness. If a single breath does not return, life ends abruptly.\n\nThis scripture contains the secret of nurturing qi and preserving spirit to attain immortality, yet the foolish of the world fail to grasp its essence, like the blind who, though the sun and moon shine with great brilliance, cannot see them—hence it is said they are like the blind beholding the sun and moon.\n\nI originate from the Great Nothingness, lifting the tassel beyond all bounds. Primordial qi resides in the vast emptiness of the Great Void, like a bellows ever expanding and contracting. Because it is nothing, it can enter the unbroken; thus it is said to be formless yet possessing essence. To lose it is death; to obtain it is life. From ancient times to the present, those who attained the Dao and ascended as immortals are beyond count, all having mastered the use of primordial qi to become true—hence it is said to lift the tassel beyond all bounds.\n\nAuspicious clouds open the Gate of Life; propitious mists seal the Portal of Death. Herein lies the eye of this scripture and the pivot of deliverance from suffering. Auspicious clouds and propitious mists are alternate names for the wondrous qi of Great Harmony. The Gate of Life and Portal of Death are designations for the Mysterious Gate and Female Portal. Some call them the Gate of Heaven and Earth, or the Portals of Qian and Kun. Wherever gates and portals are mentioned, there must be something that enters and exits through them.\n\nTo open is to part; to close is to seal. The *Book of Changes* says: \"Closing the portal is called Kun; opening the portal is called Qian.\" One closing and one opening make a transformation; ceaseless coming and going is called the Dao. That by which heaven and earth endure long and unceasing is this very principle. Those who wish to attain longevity and eternal vision, to equal heaven and earth in years, must within the Gate of Life and Portal of Death thoroughly investigate the origins of passage and obstruction, and fathom the wonders of creation. They must ensure the ceaseless circulation of the yin and yang qi of heaven and earth in ascent and descent—this is called \"exiting the sun and entering the moon,\" or \"exiting the pure and entering the mysterious.\"\n\nWithout encountering the guidance of a perfected one, even the most learned cannot hear of this, for its nature requires personal awakening, and its destiny depends on transmission by a teacher. I, having formerly received my master’s profound instructions, now dare to reveal the unspoken true mechanism of the Most High and display the sacred secret. Scholars should study it diligently. The secret states:\n\nThe Gate of Life and Portal of Death—under a thousand names they vary,\nOne called the Crimson Abyss, another the Spirit Hut.\nThe lesser adept does not comprehend—nose inhales, mouth exhales,\nYet the key to immortality lies in this, unmatched by all things.\nAuspicious clouds and propitious mists—now ascending, now descending,\nOpening and filling, obstructing and sealing—cloud essence and purple marrow.\nGather the white blossoms—soaring scenes in empty space,\nQi enters the body—its savor surpasses ghee.\nLike the tortoise drawing breath—communing with the numinous, never dying,\nLike the clam absorbing moonlight—nurturing and congealing the pearl.\nThe celestial mechanism is now revealed—those who encounter it must keep it secret.\nWhen merit is complete, one ascends lightly, riding the jade chariot.\n\nFirst, the Primordial Origin arises, communicating with the auspicious and responsive mechanism. The Great Dao first emerges from a single qi. This single qi initially becomes the Three Qi of the Primordial Origin—hence it is said, \"First, the Primordial Origin arises.\" The Three Qi coalesce to form the Three Pure Ones. The three colors intermingle in chaos, illuminating the vast emptiness. Each of the Three Qi then generates three luminosities, and three times three make nine, forming the Nine Heavens.\n\nThe *Chapter on Generating Spirit* states: \"One must extend and unite the Three Spirits, as the qi of the Primordial Origin divides.\" The *Yellow Court Scripture* says: \"The Three Qi revolve to the right, and the nine paths shine clearly,\" and also: \"The Nine Qi radiate brilliance, emerging between the heavens.\" Thus, the Three Qi are the lords of heaven and earth, and the Nine Qi are the roots of the myriad things.",
      "overlap_context": "hes the heels. There is no treasure greater than qi. Those who grasp this principle know that the Mud Pill Palace and Jade Tower are where the spirit dwells, while the Mysterious Gate and Female Portal are where qi is gathered. Qi governs the spirit; the spirit commands qi. Mother and child guard one another; nature and life merge. Then the myriad spirits do not scatter, and one becomes *ling* (numinous). When a single qi congeals, it forms the treasure—this is the numinous treasure of the body.",
      "start_char": 1983,
      "end_char": 3266,
      "start_sentence": 77,
      "end_sentence": 109,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.6864447593689,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上洞玄灵宝天尊说救苦妙经批注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "人能探炼玄元始三素之炁，通感祥烟庆云之际，是谓得造化之枢机，故言以通祥感机。 救一切罪，度一切厄。 渺渺超仙源，荡荡自然清。 皆承大道力，以伏诸魔精。 一切罪莫大於死罪，一切厄莫大於死厄，人死虽有万殊，总归三路，圣人死之曰神，贤人死之曰复，众人死之曰物。 何谓圣人死之曰神，圣人养圣胎於神室，身内生身，阳神脱质，死而不亡，脱胎神化者，谓之神仙也。 何谓贤人死之日复，贤人在世，不与物交，性无所着，以生为寄，以死为归，归者复也，精神入其门，骨骸返其根，我尚何存，盖能虚诸所有，而神识灵明出乎物外，轮回不入，阴官莫拘，修然自在，虽南面王乐，亦不及也，明心达性，贤人君子，禅伯之流，超证真常，永无系累，稍或见地未明，修为有缺，着於谈空，滞於观想，终则谓之阴灵苦爽鬼仙是也，或欲出世，则能夺舍投胎。 何谓众人死之曰物，众人在世，魂梦念想，常与物交，不能外物，安出物外一，故命将绝时，形神不能相离，如生龟说壳，螃蟹入汤，疼痛苦楚，万状千般，既死之后，境界黑暗，犹如夜半之禽飞，懵然妄投，不知所归何地，在造物之陶铸，随业识以受生，或化异类而不自觉，盖心之所化而不得不化也，亦犹至暴者化为猛虎，至淫者化为妇人，或为傍生六畜禽虫之类，及再得为人，皆谓之物也，故曰众人死之曰物。 若人临终之时，诸处俱冷，惟顶门尚自温暖者，此人得道，径归净域。 诸处俱冷，心头尚温，再得为人身。 不慕修道，惶惶汲汲，奔逐利名，沉滞声色，日复一日，如牵牛羊赴於屠肆，步行一步去死转近。 未死之前，可不速求至道，勤而行之，成真度世，求免生死之罪厄，故曰救一切罪，度一切厄。 道成则名刊金箓，位列仙卿，玉女麾幢，仙童鼓节，逍遥上清，上上渺渺，大罗之乡，诸天梵炁，荡荡至清，故曰渺渺超仙源，荡荡自然清。 佩符则 千魔丧胆，流金则万精灭形，故曰皆承大道力，以伏诸魔精。 空中何灼灼，名曰泥丸仙。 空彼万法，而妙用在中，故曰空中。 内景焕烂，返视独见，故曰何灼灼。 泥丸在两眉间直入三寸，为脑血之琼房，魂精之玉室，百灵之命宅，津液之山源，一名上一赤子，乃形躯之上神，故曰泥丸仙。 紫云覆黄老， 金木之炁，青白交会，则化碧霞，水火之炁，黑赤既济，则化紫云。 夫受炼形质，莫先於真水真火也，真水非涕唾津液谷炁，所以化之浊水，在乎采太和，妙炁之中自有真一之水，谓之玄泉，要当明其水源之清浊也。 火本无形，因物而生，用无法则祸发必克，仙家行火，亦有数等，用之则灭尸炼魄，体变纯阳，则有符数契合周天日月之缠度，皆口口相传，难书竹帛。 仙彦有之曰：神仙秘易不秘难，圣人传药不传火。 夫行水不行火，则气难上腾，行火不行水，则不能熏蒸，是以水火既济，而氤氲炁乃化为紫云，神聚处气必朝之，故紫云苍郁，上朝於泥丸，覆盖於中央黄老君，故曰紫云覆黄老。 是名三宝君。 三宝君者，因神炁精凝化而有也。 神有阴阳，炁有清浊，精有逆顺。 何谓神有阴阳，若因存思念想而后通灵者，亦能出入天门，预知未然，谓之阴神也。 若夫积阴阳之炁，结而成祥身内生身胎仙舞蜕者，是谓阳神也。",
      "translated_text": "One who can refine and explore the Three Primordial Qi of the Mysterious Origin, penetrating the auspicious mists and felicitous clouds, is said to grasp the pivot of creation—hence it is called \"to penetrate the auspicious and respond to the mechanism.\" This saves all sins and delivers all calamities.\n\nVast and boundless, one transcends the immortal source; vast and unobstructed, one attains natural purity. All this is borne of the power of the Great Dao, subduing all demonic essences.\n\nOf all sins, none is greater than the sin of death; of all calamities, none is greater than the calamity of death. Though human deaths may differ in ten thousand ways, they all converge into three paths. The death of the sage is called *spirit*; the death of the worthy is called *return*; the death of the common person is called *thing*.\n\nWhat is meant by the sage’s death being called *spirit*? The sage nurtures the sacred embryo within the chamber of spirit, giving birth to a body within the body. The yang spirit sheds its form, dying yet not perishing, transcending the embryo to become spirit—this is called an immortal.\n\nWhat is meant by the worthy’s death being called *return*? The worthy, while in the world, does not engage with things, their nature unattached. They regard life as a temporary abode and death as a return—*return* meaning *reversion*. Spirit and essence enter their gate, bones and skeletal frame return to their root. What remains of the self? They empty all that is possessed, and their numinous awareness, luminous and transcendent, emerges beyond things. Unbound by cyclic rebirth, unrestrained by the officials of the shades, they abide in serene freedom—even the joy of a king facing south cannot compare. Those who illuminate the mind and realize the nature—worthy ones, noble persons, and those of the Chan lineage—attain and verify the true and constant, forever free from entanglements. Yet if their insight remains unclear or their cultivation incomplete, if they cling to empty discourse or stagnate in visualization, they may ultimately be called *yin spirits*, *suffering souls*, or *ghostly immortals*. Should they seek liberation, they may seize a new vessel or enter a womb.\n\nWhat is meant by the common person’s death being called *thing*? The common person, while in the world, is ever entangled in dreams, thoughts, and attachments, constantly engaging with things, unable to transcend them. Thus, when their life is about to end, form and spirit cannot part—like a live turtle shedding its shell or a crab plunged into boiling water, their agony is manifold. After death, their realm is darkness, like a bird flying at midnight, bewildered and recklessly alighting, unaware of where they are bound. They are molded by the Creator, reborn according to their karmic consciousness, or transformed into other species without self-awareness. For the heart’s transformations are inescapable—just as the fiercest become tigers, the most lustful become women, or others become beasts, livestock, birds, or insects. Even if they regain human form, they are still called *things*. Thus, it is said the common person’s death is called *thing*.\n\nIf, at the moment of death, all parts of the body grow cold yet the crown of the head remains warm, this person has attained the Dao and directly ascends to the pure realm. If all parts grow cold yet the heart remains warm, they may regain a human body.\n\nThose who do not aspire to cultivate the Dao, who rush about in anxiety, chasing profit and fame, mired in sensual pleasures, day after day—are like oxen and sheep led to the slaughterhouse, each step bringing them nearer to death. Before death comes, should one not swiftly seek the supreme Dao, diligently practice it, perfect the true and deliver the world, and strive to escape the sins and calamities of life and death? Hence it is said: *This saves all sins and delivers all calamities.*\n\nWhen the Dao is perfected, one’s name is inscribed in the golden register, and one’s rank is listed among the immortal ministers. Jade maidens wield banners, immortal youths beat time, and one roams freely in the Upper Clarity. In the highest and most distant realms of the Great Veil, amidst the qi of the myriad heavens, vast and unobstructed, one attains ultimate purity. Thus it is said: *Vast and boundless, one transcends the immortal source; vast and unobstructed, one attains natural purity.*\n\nWearing the talisman, a thousand demons lose their courage; casting flowing gold, ten thousand spirits are destroyed in form. Thus it is said: *All this is borne of the power of the Great Dao, subduing all demonic essences.*\n\nWhat is that radiance in the void? It is called the Immortal of the Muddy Pellet. Emptiness encompasses the myriad dharmas, yet wondrous function resides within—hence it is called *in the void*. The inner landscape shines brilliantly, and in returning vision, one sees it alone—thus it is said: *What radiance!* The Muddy Pellet lies three inches directly inward between the brows. It is the chamber of brain blood, the jade chamber of the soul’s essence, the life-dwelling of the hundred spirits, the mountain source of fluids. It is also called the *Uppermost Red Child*, the supreme spirit of the bodily form—hence it is called the *Immortal of the Muddy Pellet*.\n\nPurple clouds cover the Yellow and the Old. When the qi of Metal and Wood intermingle, green and white merge to form azure mist; when the qi of Water and Fire harmonize in mutual completion, black and red transform into purple clouds. To refine one’s form and substance, nothing precedes true Water and true Fire. True Water is not the turbid water of saliva, fluids, or grain qi—it is the mysterious spring found within the wondrous qi of Great Harmony, the true Water of the One. One must discern the clarity or turbidity of its source.\n\nFire has no form; it arises from things. Without method, its calamity will surely strike. The fires of the immortals’ practice vary in degree. When employed, they extinguish the corpse and refine the po, transforming the body into pure yang. There are talismanic numbers and correspondences, the cycles of the celestial stems and branches, the revolutions of the sun and moon—all transmitted mouth-to-mouth, difficult to inscribe on bamboo or silk. The immortals have said: *\"The secrets of the immortals are easy to conceal but hard to transmit; the sages pass on the medicine but not the fire.\"*\n\nIf one practices Water but not Fire, qi cannot ascend; if one practices Fire but not Water, it cannot steam and pervade. Only when Water and Fire are mutually completed does the misty qi transform into purple clouds. Where spirit gathers, qi must attend—thus, purple clouds, lush and verdant, ascend to the Muddy Pellet, covering the Central Yellow and Old Lord. Thus it is said: *Purple clouds cover the Yellow and the Old.*\n\nThis is called the *Lord of the Three Treasures*. The Lord of the Three Treasures arises from the congealing and transformation of spirit, qi, and essence. Spirit has yin and yang; qi has purity and turbidity; essence has inversion and compliance.\n\nWhat is meant by spirit having yin and yang? If one relies on visualization and contemplation to achieve numinous communication, able to enter and exit the heavenly gates and foresee the unseen, this is called *yin spirit*. But if one accumulates the qi of yin and yang, coalescing them to form an auspicious body—a body born within the body, an immortal embryo that sheds its husk—this is called *yang spirit*.",
      "overlap_context": " three luminosities, and three times three make nine, forming the Nine Heavens.\n\nThe *Chapter on Generating Spirit* states: \"One must extend and unite the Three Spirits, as the qi of the Primordial Origin divides.\" The *Yellow Court Scripture* says: \"The Three Qi revolve to the right, and the nine paths shine clearly,\" and also: \"The Nine Qi radiate brilliance, emerging between the heavens.\" Thus, the Three Qi are the lords of heaven and earth, and the Nine Qi are the roots of the myriad things.",
      "start_char": 3266,
      "end_char": 4510,
      "start_sentence": 110,
      "end_sentence": 139,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.44268298149109,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上洞玄灵宝天尊说救苦妙经批注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "阳神为仙，阴神为鬼也。 何谓炁有清浊，天有形质，含血气者谷肉果菜之类，滋地根而生长，其字从旡从火，是谓谷炁，亦名地炁，故曰浊也。 夫太和妙炁生天生地，神鬼神帝，强名为道即炁也，炁即道也，视之不见，听之不闻，搏之不得，无形之形，无物之象，透金贯石，充塞八荒，其字从旡从火，火阳也，乃虚无之中清阳之炁也。 积阴炁者则死，服阳炁者则生。 何谓精有逆顺，顺则成人，逆为丹母，斯皆行火而有升降也。 凡夫妇之接名为劫火，亦通三关而透尾闾，故顺出则成人，若乃提缩金龟，是谓文火，闭息而行，是谓武火，契合日月，谓之符火，故仙人道士开金锁，彻玉关，运璇玑，斡日月，金精贯顶，银浪冲天，是谓泝流，故曰逆为丹母也，顺则形毙，逆则骨坚也。 夫人有眼目者，乃神之门，鼻口者炁之户，尾闾者精之路，神微妙用天真圣功尽隐於此矣，於是至人内视返听凝其神，呼吸太和袭其炁，逆运流珠聚其精，三宝凝积於神室之内，皆化为神，故曰是名三宝君。 还将上天黑，以制九天魂。 人头有九天亦曰天谷，魂神居之黄庭，所谓上有魂灵下关元是也。 形好食味，神好食炁，天炁乃阳神之饭食也。 《生神章》云：魂生摄游炁，飘飘炼素华。 夫信游炁者乃上天炁也，魂神所摄者盖好食炁，而故以上天之炁制於九天魂也，神不得一炁以制之则不能灵，谷不得一炁以充之则不能盈，神无以灵而将恐歇，而神去於身矣，谷无以盈将恐竭，而天谷空虚矣，谷神既逝，则人命终矣。 昔之未遇元炁，荡荡而去，今既明真，去而有所复来，故曰大还也，还将上天之炁以制九天魂神，始得其谷神不死，故谓神得一而灵，谷得一而盈。 救苦诸妙神，善见救苦时。 天上混无分， 夫修上道，要在全神，神全之士，光而不耀，蒙以养正，故能复太朴，抱虚恬，混成独立，一性游乎寂寞静极之境，不萌纤芥之知，故其神不离，不起毫厘之念，故其神不散。 蒙庄曰：其天守全，其神不却，守其天者神光缠绵，化生万神，故曰诸妙神也。 凡言救苦者，自救之也，苦不自救，孰能救之，我道将成，则大浸稽天而不溺，大旱山焦而不热，死生无变於己，而况大数大劫之死乎，超越厄难之外，故曰善见救苦时也。 所谓回风混合帝一之道，一混百神於 自己天上而不可分，故曰天上混无分。 天炁归一身，皆成自然人。 夫天炁者起於太易之先，超乎万象之外，应清明以出入，伫神机以卷舒，澄清碧於高天，淡轻红於落日，不干风雨，不犯尘埃，呼吸玄牝之门，澡雪希夷之域，止饥渴，除滓秽，去三尸，消百病，此乃清虚有道之炁也。 玉皇神用秘诀曰：知至道者天不杀，服元炁者地不灭。 能明吐纳之理，即使日霞日精月华月英三素五芽元皇正炁来合我身，此皆天炁也，太和入体则骨肉轻清，项生圆象，隐显自然，始能为自然人也，故曰天炁归一身，皆成自然人。 如起於不洁之地，因於燥湿之处，杂腥秽之饮馔，混尸冢之蒸郁，斯乃浊恶沉滞之死炁，仙道忌焉，所以仙人多楼居者，以其近天炁也。 《黄庭经》云：至忌死炁诸秽贱。 自然有别体，本在空洞中，空洞迹非迹，徧体皆虚空。 老子曰：天法道，道法自然。",
      "translated_text": "The yang spirit becomes an immortal, while the yin spirit becomes a ghost.\n\nWhat is meant by qi having purity and turbidity? Heaven possesses form and substance; those containing blood and qi—such as grains, meats, fruits, and vegetables—grow by nourishing earthly roots. The character for *qi* (炁) is composed of *wu* (旡) and *fire* (火), signifying *grain qi*, also called *earthly qi*, hence it is called turbid. The wondrous qi of Great Harmony generates heaven and earth, spirits and gods, emperors and lords. Forcibly named as the Dao, it is qi; qi is the Dao. Invisible to the eye, inaudible to the ear, intangible to the touch—formless yet possessing form, imageless yet embodying image—it penetrates metal and stone, fills the eight wilds. The character for *qi* (炁) is composed of *wu* (旡) and *fire* (火), and fire is yang. Thus, it is the pure yang qi within the void and nonexistence.\n\nAccumulating yin qi leads to death; ingesting yang qi leads to life.\n\nWhat is meant by essence having inversion and compliance? Compliance gives rise to human form; inversion becomes the *Mother of the Elixir*. All these depend on the firing process, which involves ascent and descent. The union of husband and wife is called *kalpa fire*, which also passes through the Three Passes and penetrates the *Weilü*. Thus, following the natural course results in human birth. But if one contracts the *Golden Turtle*, this is called *civil fire*; closing the breath and circulating it is called *martial fire*; harmonizing with the sun and moon is called *tally fire*. Therefore, immortals and Daoists open the *Golden Lock*, pierce the *Jade Gate*, revolve the *Xuanji*, turn the sun and moon, allowing golden essence to penetrate the crown and silver waves to surge to heaven—this is called *counterflow*, hence it is said: *inversion becomes the Mother of the Elixir*. Compliance leads to bodily decay; inversion strengthens the bones.\n\nThe eyes are the gates of spirit; the nose and mouth are the doors of qi; the *Weilü* is the path of essence. The subtle and wondrous workings of the celestial and true sagely arts are all concealed within these. Thus, the perfected person inwardly gazes and reverses hearing to concentrate the spirit, inhales and exhales the Great Harmony to absorb its qi, and reverses the flow of the *Pearl Stream* to gather essence. The Three Treasures congeal and accumulate within the *Chamber of Spirit*, all transforming into spirit. Hence, it is called the *Lord of the Three Treasures*.\n\nReturning with the black of the upper heavens to restrain the nine heavens’ souls. The human head contains the *Nine Heavens*, also called the *Celestial Valley*, where the soul-spirit resides in the *Yellow Court*—what is meant by *above lies the soul-spirit, below the Pass of Origin*. The body delights in flavors; the spirit delights in qi. Heavenly qi is the sustenance of the yang spirit. The *Chapter on Generating Spirit* states: *The soul is born, roaming qi, drifting to refine the pristine essence.* Truly, the roaming qi is the heavenly qi of the upper heavens, which the soul-spirit seizes, for it delights in consuming qi. Thus, the qi of the upper heavens restrains the nine heavens’ souls. If the spirit does not obtain this single qi to restrain it, it cannot become numinous; if the valley does not obtain this single qi to fill it, it cannot become full. Without numinosity, the spirit will fear dissipation and depart from the body; without fullness, the valley will fear exhaustion and the *Celestial Valley* will become empty. Once the *Valley Spirit* departs, human life ends.\n\nIn the past, before encountering the primordial qi, it drifted away in boundless emptiness. Now, having awakened to the truth, it departs but has a place to return. Thus, it is called the *Great Return*. Returning with the qi of the upper heavens to restrain the nine heavens’ soul-spirits, only then does the *Valley Spirit* not die. Hence, it is said: *The spirit obtains the One and becomes numinous; the valley obtains the One and becomes full.*\n\nThe wondrous spirits of salvation see the time of deliverance. In the heavens above, all is undivided. Those who cultivate the supreme Dao must preserve their spirit whole. The spirit-whole person shines without dazzling, veiled to nurture correctness, thus able to return to the Great Uncarved Block, embrace emptiness and tranquility, merge into oneness, and stand alone. Their nature roams the boundless, utterly still realm, without the slightest stirring of knowledge—thus their spirit does not depart. Without the faintest arising of thought—thus their spirit does not scatter.\n\nMaster Meng said: *Preserving one’s heaven whole, the spirit does not retreat.* Guarding one’s heaven, the spirit’s radiance lingers, giving birth to the myriad spirits. Hence, they are called the *wondrous spirits*. As for deliverance from suffering, one must first deliver oneself. If suffering does not deliver itself, who can deliver it? When my Dao nears completion, even the great floods reaching the heavens cannot drown me; the great drought scorching mountains cannot burn me. Life and death hold no change for me—how much less the deaths of great cycles and kalpas? Beyond calamity and adversity, thus it is said: *they see the time of deliverance.*\n\nThis is the Dao of the *Returning Wind* merging with the *Emperor’s Unity*—unifying the hundred spirits within one’s own heaven, indivisible. Hence, it is said: *In the heavens above, all is undivided.*\n\nThe heavenly qi returns to the one body, all becoming *natural persons*. The heavenly qi arises before the *Great Simplicity*, transcending the myriad forms. It emerges and enters in clarity and brightness, abides in the divine mechanism to roll and unfold, purifying the azure of the high heavens, lightening the red of the setting sun. Unaffected by wind and rain, unstained by dust, it breathes through the *Mysterious Female’s Gate*, washes in the realm of the *Inaudible and Invisible*. It relieves hunger and thirst, removes filth and impurities, expels the *Three Corpses*, and dissolves the hundred diseases—this is the qi of the clear void and the possessed Dao.\n\nThe *Secret Formula of the Jade Emperor’s Divine Workings* states: *Those who know the supreme Dao are not killed by heaven; those who ingest primordial qi are not destroyed by earth.* Understanding the principles of exhalation and inhalation, one can daily absorb the sun’s radiance and essence, the moon’s brilliance and bloom, the *Three Primes*, the *Five Sprouts*, and the *Primordial Emperor’s Upright Qi*—all these are heavenly qi. When the Great Harmony enters the body, bones and flesh become light and clear, a round image appears at the nape, and concealment and manifestation occur naturally. Only then can one become a *natural person*. Hence, it is said: *The heavenly qi returns to the one body, all becoming natural persons.*\n\nIf it arises from unclean places, affected by dryness and dampness, mixed with foul and putrid food and drink, or tainted by the vapors of tombs and graveyards, this is the turbid, foul, stagnant *dead qi*—shunned by the Dao of immortals. Thus, immortals often dwell in lofty towers to be nearer to heavenly qi. The *Yellow Court Scripture* states: *Most taboo is the dead qi and all foul impurities.*\n\nThe natural has a distinct body, originally within the empty and cavernous. The empty and cavernous leave no trace, yet the entire body is void. Laozi said: *Heaven follows the Dao; the Dao follows the natural.*",
      "overlap_context": "it has yin and yang; qi has purity and turbidity; essence has inversion and compliance.\n\nWhat is meant by spirit having yin and yang? If one relies on visualization and contemplation to achieve numinous communication, able to enter and exit the heavenly gates and foresee the unseen, this is called *yin spirit*. But if one accumulates the qi of yin and yang, coalescing them to form an auspicious body—a body born within the body, an immortal embryo that sheds its husk—this is called *yang spirit*.",
      "start_char": 4510,
      "end_char": 5739,
      "start_sentence": 140,
      "end_sentence": 167,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.24686241149902,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上洞玄灵宝天尊说救苦妙经批注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "天道犹法於自然人也，可不体之哉。 夫无身之身，本来赤子，自本自根，自古以固存。 老子曰：湛兮似若存，吾不知谁之子，象帝之先。 此所谓别体也，且夫脑宫圆虚而适真，是以帝君居之，故泥丸为空洞之府也。 《黄庭经》云：问谁家子在我身，此人何去入泥丸。 正言此尔。 所以守神者摄动心也，守神不失，与神为一，则忘其所守之迹矣，故曰空洞迹非迹。 一之精通，超乎万象之表，神游太漠真空之境，则廓然徧体皆虚空也。 第一委炁立，第二顺炁生，第三成万法，第四主光明。 列子曰：生非我有，是天地之委和也。 察其始也，本无我体，因委天地父母二炁而立，故曰第一委炁立。 知夫此身乃炁之所生，不当暴逆其炁，使之夭阏，急宜运天炁以归身，使绵绵而不绝，胎息归根，顺受其炁，自然久视，故曰第二顺炁生。 夫至人者提挈天地，把握阴阳，宇宙在乎手，万化生乎身，能使形化於炁，所以无穷，无化成神，神之所以无尽，神化合道，道合自然，以法入道，法固易达，以道入法，法固易成，一法苟得，则万法俱成，故曰第三成万 法。 道成则顶负圆象，身有光明，故曰第四主光明。 又《五经提纲》云：救苦妙经本於青霄隐书，盖炼度之秘文也，经中纲领有四，其要在於主光明而已。 一曰委炁立，盖元始以一炁分判天地，运化阴阳，为万物之本，周子所谓太极动而生阳，静而生阴，阳变阴合，而生木火金水土者，此也。 二曰顺炁生，盖天地既判，阴阳既立，则人受其冲和之气以生，周子所谓二五之精妙合而凝，乾道成男，坤道成女，万物化生者，此也。 三曰成万法，人道既立，叉有圣贤出於其间，陈纲纪，立制度，谓之正德利用厚生，而后人道不穷焉，子思子所谓修道之谓教，亦此意也。 四曰主光明，光明者性体也，主云者奉之如君也，人能奉此光明，常为一身之主，动静语默，皆听命焉，自然灵台之间，轩豁洞达，物莫能蔽，而道体全矣，《中庸》所谓尊德性，《大学》所谓在明德，庄子所谓真君，皆指此也。 夫此光明，人人具有，不为尧存，不为桀亡，不为颜增，不为跖灭，操之则贤，舍之则愚，得之则升天堂，失之则沉地狱，凡地狱中烧煮屠割苦毒万状，皆失此光明也。 天上三十六，地下三十六，太玄无边际，妙哉大洞经。 斯言三洞三乘三十六部尊经也，元始天尊於龙汉元年出洞真十二部经，演九圣之道，太上道君於赤明元年出洞玄十二部经，演九真之道，太上老君於上皇元年出洞神十二部经，演九仙之道，计八千余篇，结飞玄之炁，五方紫篆，焕於太霄，八角垂芒，耀於碧落，天真皇人按笔书之。 三十六部秘於上天紫微金阙，无极高真与十神五老共相翊卫，元始天尊与诸天上圣皆月三朝其灵文，未传下世，故曰天上三十六。 元始复以三十六部秘於龙宫，以镇海岳洞天，故曰地下三十六，乃太玄无边际，妙哉大洞经也。 愚暗臆揣，或云阳数四九，阴数六六，或云七十二候之说，殊乖玄旨，何昧如斯，盖上乘经典，未尝言於衍数。 归命太上尊，能消一切罪。 归神归命於太上，盖言不可须臾离道也，须臾不离於道，则神明护之，大福随之，动与吉会，何罪之有。 东方王宝皇上天尊，",
      "translated_text": "The Dao of Heaven models itself upon the *natural person*—how could one not embody this? The body without form is originally the unblemished infant, self-rooted and self-originating, existing thus since ancient times. Laozi said: *Profound and still, it seems to endure—unknown whose child it is, appearing before the Lord of Heaven.* This is what is called the *distinct body*. Moreover, the brain palace is round and void, perfectly attuned to the real; thus the Lord of Heaven resides there, and the *Mud Pill* becomes the mansion of the empty and cavernous. The *Yellow Court Scripture* states: *Ask whose child dwells within my body, where has this one gone to enter the Mud Pill?* This speaks precisely of this.\n\nTherefore, guarding the spirit means restraining the restless heart. If one guards the spirit without loss, becoming one with it, one forgets even the traces of what is guarded—hence it is said: *The empty and cavernous leave no trace, yet the entire body is void.* When the essence of oneness penetrates, one transcends the realm of the ten thousand images. The spirit roams the boundless expanse of true emptiness, and the entire body becomes vast and void.\n\nFirst, the *commissioned qi* takes its place.\nSecond, the *qi of compliance* arises.\nThird, the ten thousand laws are completed.\nFourth, one presides over light and illumination.\n\nLiezi said: *Life is not my possession; it is the commission of harmony from Heaven and Earth.* Examining its origin, the body was originally non-existent; it stands only through the commission of the two *qi* of Heaven and Earth as parents—hence it is said: *First, the commissioned qi takes its place.* Knowing this body is born of *qi*, one should not violently oppose it, causing its premature obstruction. One must urgently return the heavenly *qi* to the body, making it continuous and unbroken. Embryonic breathing returns to the root, and *qi* is received in compliance—naturally, one attains longevity. Hence it is said: *Second, the qi of compliance arises.*\n\nThe *perfected person* lifts and carries Heaven and Earth, grasps and wields yin and yang. The cosmos lies within their hands, and the ten thousand transformations arise within their body. They can transform form into *qi*, thus becoming inexhaustible. Without transformation, one becomes spirit; the spirit’s inexhaustibility lies in its merging with the Dao. The Dao merges with the natural. Following the law to enter the Dao, the law is easily attained; following the Dao to enter the law, the law is easily accomplished. If one law is grasped, then all laws are mastered—hence it is said: *Third, the ten thousand laws are completed.* When the Dao is accomplished, one’s crown bears the round image, and the body radiates light—hence it is said: *Fourth, one presides over light and illumination.*\n\nThe *Essentials of the Five Classics* further states: *The Wondrous Scripture for Saving from Suffering originates from the Hidden Writ of the Azure Empyrean—it is the secret text of refinement and deliverance.* Its guiding principles number four, with the essence lying in presiding over light and illumination:\n\nFirst, the *commissioned qi* takes its place. At the beginning, the Primordial One divided the one *qi* to distinguish Heaven and Earth, circulating and transforming yin and yang, becoming the root of the ten thousand things. This is what Master Zhou meant when he said: *The Supreme Ultimate moves and generates yang; it is still and generates yin. Yang transforms and yin unites, giving rise to wood, fire, metal, water, and earth.*\n\nSecond, the *qi of compliance* arises. Once Heaven and Earth are distinguished and yin and yang established, humans receive their harmonious *qi* to come into being. This is what Master Zhou meant when he said: *The essence of the two and five wondrously unite and congeal. The way of Qian becomes male; the way of Kun becomes female. The ten thousand things are transformed and born.*\n\nThird, the ten thousand laws are completed. Once the human way is established, sages and worthies emerge among them, setting forth guiding principles and establishing systems—what is called *rectifying virtue, enhancing utility, and enriching life.* Thus the human way is inexhaustible. This is what Master Zisi meant when he said: *Cultivating the Dao is called teaching.*\n\nFourth, one presides over light and illumination. Light and illumination are the essence of nature. *Presiding* means honoring it as lord. If one honors this light and illumination, always making it the master of the body, then in movement and stillness, speech and silence, all obey its command. Naturally, within the numinous terrace, all is open and unobstructed; nothing can obscure it, and the embodiment of the Dao is complete. This is what *The Doctrine of the Mean* calls *revering the power of virtue*, what *The Great Learning* calls *illuminating the luminous virtue*, and what Zhuangzi calls *the true lord.*\n\nThis light and illumination is possessed by all. It does not exist because of Yao nor perish because of Jie; it is not increased by Yan nor extinguished by Zhi. Grasping it, one becomes worthy; abandoning it, one becomes foolish. Attaining it, one ascends to heaven; losing it, one sinks into hell. All the myriad torments of hell—burning, boiling, slaughter, and dismemberment—arise from losing this light and illumination.\n\nThe heavens above hold thirty-six; the earth below holds thirty-six. The Great Mystery is boundless—wondrous indeed is the *Great Cavern Scripture.* These words refer to the thirty-six revered scriptures of the Three Caverns and Three Vehicles. In the first kalpa of the Dragon Han era, the Celestial Worthy of Primordial Beginning revealed the twelve divisions of the *Cavern-Real Scripture*, expounding the Dao of the Nine Sages. In the first kalpa of the Crimson Brightness era, the Dao Lord of the Supreme revealed the twelve divisions of the *Cavern-Mystery Scripture*, expounding the Dao of the Nine Perfected. In the first kalpa of the High Sovereign era, the Supreme Lord Lao revealed the twelve divisions of the *Cavern-Spirit Scripture*, expounding the Dao of the Nine Immortals. In total, over eight thousand scrolls were composed, weaving the *qi* of soaring mystery. The Five Directions’ Purple Scripts blazed in the Great Empyrean; their eight-cornered radiance shone in the Azure Vault. The Heavenly Perfected and August Person took up the brush to inscribe them.\n\nThe thirty-six divisions were concealed in the Purple Tenuity’s Golden Portal in the heavens above. The peerless lofty perfected, together with the Ten Spirits and Five Elders, jointly guarded and protected them. The Celestial Worthy of Primordial Beginning and the sagely beings of the heavens above all paid homage to their sacred texts thrice each month. They were never transmitted to the world below—hence it is said: *The heavens above hold thirty-six.* The Primordial Beginning further concealed the thirty-six divisions in the Dragon Palace to guard the grotto-heavens of seas and mountains—hence it is said: *The earth below holds thirty-six.* Thus, the Great Mystery is boundless—wondrous indeed is the *Great Cavern Scripture.*\n\nThe foolish and benighted speculate, some saying it refers to the yang number four times nine or the yin number six times six, others invoking the seventy-two seasonal markers. Such interpretations stray far from the profound purport—how could they be so deluded? The scriptures of the supreme vehicle have never spoken of derivative numbers.\n\nI take refuge in the Supreme Worthy, who can dissolve all sins.\nTaking refuge in spirit and life with the Supreme means never for a moment parting from the Dao. If one does not part from the Dao even for a moment, then the divine luminaries protect one, great fortune follows, and all actions meet with auspiciousness—what sins could there be?\n\nThe Celestial Worthy of the Treasure of the King of the Eastern Realm, Supreme in Heaven,",
      "overlap_context": "tainted by the vapors of tombs and graveyards, this is the turbid, foul, stagnant *dead qi*—shunned by the Dao of immortals. Thus, immortals often dwell in lofty towers to be nearer to heavenly qi. The *Yellow Court Scripture* states: *Most taboo is the dead qi and all foul impurities.*\n\nThe natural has a distinct body, originally within the empty and cavernous. The empty and cavernous leave no trace, yet the entire body is void. Laozi said: *Heaven follows the Dao; the Dao follows the natural.*",
      "start_char": 5739,
      "end_char": 6970,
      "start_sentence": 168,
      "end_sentence": 196,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.70038628578186,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上洞玄灵宝天尊说救苦妙经批注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "南方玄真万福天尊， 西方太妙至极天尊， 北方玄上玉晨天尊， 东北方度仙上圣天尊， 东南方好生度命天尊， 西南方太灵虚皇天尊， 西北方无量太华天尊， 上方玉虚明皇天尊， 下方真皇洞神天尊。 道言：十方诸天尊，其数如沙尘。 化形十方界，普济度天人。 十方天尊即十方灵宝天尊。 凡有道言二字，即道君所言。 此经乃灵宝天尊所说，即是万天之宗师，三界之医王，太上大道玉宸君，居上清真境，治药珠日阙之内，化形为祥光瑞炁，流布十方之界，普度於天人。 夫天人者，谦恭博施，仁德宽容，虚恬柔静，相貌为和，爱敬师友，闻道笃信，此为有天人资质，天尊则化身下降，授以上道，济度成真，故曰普济度天人。 若夫根器浊恶，不持戒行，性耽谣杀，闻道大笑者，此为同於失者也，非道负人，人自负道。 委炁聚功德， 列子曰：凡炁聚则生，炁散则死。 知炁聚则生，人不能禁也，知炁散则死，人不能止也，元炁既无禁止，则是命属造物而不属於我也。 至人得其枢要，能掌握呼吸之息，息之出入，由吾掌握，则是我命在我，不属於天。 俗喭所谓将息者，实仙真流传，点化凡愚之圣语也，孰能悟之。 悟之者自能将其息而使不散，则自然委和之炁锺聚於一息，久而积功累德，自然成真，故曰委炁聚功德。 同声救罪人。 老子曰：同於道者，道亦得之。 若乃勤求师门，耽味至理，研穷典诰，一心念道，用志不分者，是之谓同声相应，同气相求，始可与言至道，而救度之，故曰同声救罪人。 罪人实可哀，我今说妙经。 夫人受生胞胎之中，绵绵十月，母呼亦呼，母吸亦吸，炁足神备，解胎而生，惊天骇地，而得为人，谓之婴儿，婴兄之心，但贵食母之乳，余无所知，此乃含真抱朴之时也。 既生百日，为物所诱，情见於外，俄而能笑，则变婴以为孩，自此乃为丧道失朴之始也。 然后十五为童，二十弱冠，目眩五色，耳惑五音，七情夺其性，六欲汨其真，纯朴荡而尽矣。 一日一夜，万死万生，驱役魂神，不闭一息，此乃处世之人，生身受罪於无间地狱，湮沦汨没，无有出期，苟非得道，孰能免离，若此罪人，实可哀也，是以天尊大开救苦之门，广阐微妙之典，三清圣域，坦然可归。 念诵无休息，归身不暂停。 一念在道而不休诵，究仙经而不息念，诵既无休息，则渊明奥赜，契合自然。 《内观经》曰：炁来入身谓之生，神去离形谓之死。 是以圣人盗采天炁，归乎一身，圣功冲用，三返昼夜，不欲暂停，故曰归身不暂停。 天堂享大福，地狱无苦声。 天仙不离於天，神仙不离於神，地仙不离於地，药石仙不离於服饵药石，鬼仙不离阴灵之鬼，此皆所行之道类使之然，亦犹水之就湿，火就燥，云从龙，风从虎也。 上学之士凝神炼炁，复命归根，体变纯阳，身超尘劫，至於咀嚼朝雾，咽嗽沆瀣，二景缠络，六炁臻身，呼吸大梵之云英，妙用悉享於天厨，自然长生，归於天堂矣，故曰天堂享大福。 不食百谷之实，土地之精，故身不死，归於地而无沦坠之苦，故曰无苦声。 火翳成清署， 火翳者南方地狱之名也，众生常为欲火焚心而色翳目，故曰火翳。 触目动心，地狱即现，既悟真诠，性天朗彻，一念湛然，所谓火翳者皆化为清净之域也。",
      "translated_text": "The Celestial Worthy of the Myriad Blessings of the Mysterious Perfection of the Southern Realm,\nThe Celestial Worthy of the Supreme Mystery of the Western Realm,\nThe Celestial Worthy of the Jade Dawn of the Mysterious Above of the Northern Realm,\nThe Celestial Worthy of the Deliverance of Immortals and Supreme Sages of the Northeastern Realm,\nThe Celestial Worthy of the Nurturing of Life and Deliverance of Destiny of the Southeastern Realm,\nThe Celestial Worthy of the Supreme Numinous Emptiness of the Southwestern Realm,\nThe Celestial Worthy of the Boundless Great Splendor of the Northwestern Realm,\nThe Celestial Worthy of the Jade Emptiness and Luminous Sovereign of the Upper Realm,\nThe Celestial Worthy of the True Sovereign and Cavern Spirit of the Lower Realm.\n\nThe Dao declares: The Celestial Worthies of the ten directions are as numerous as grains of sand. Manifesting forms throughout the ten directions, they universally deliver and save the celestial and human.\n\nThe Celestial Worthies of the ten directions are the Numinous Treasure Celestial Worthies of the ten directions. Whenever the term \"Dao declares\" appears, it refers to the words of the Lord of the Dao. This scripture was spoken by the Numinous Treasure Celestial Worthy, who is the ancestral master of the myriad heavens, the healing king of the three realms, the Jade Sovereign of the Supreme Great Dao. Dwelling in the Perfected Realm of Supreme Purity, within the Palace of the Elixir Pearl and the Sun, he transforms his form into auspicious light and numinous qi, flowing throughout the realms of the ten directions to universally deliver celestial and human beings.\n\nNow, those of celestial and human nature are humble, reverent, and broadly giving; their virtue is magnanimous and tolerant. Serene and gentle, their demeanor is harmonious. They cherish and respect their teachers and friends, and upon hearing the Dao, they firmly believe. These are those endowed with the qualities of celestial and human beings. The Celestial Worthy then transforms his body to descend, bestowing upon them the supreme Dao, delivering and perfecting them—thus it is said, \"universally delivering celestial and human beings.\"\n\nAs for those whose roots are impure and evil, who do not uphold precepts and conduct, whose nature delights in slander and killing, and who laugh upon hearing the Dao—these are like those who have lost their way. It is not that the Dao has failed them, but that they have failed the Dao.\n\nAccumulating qi and amassing merit,\nLiezi said: \"When qi gathers, life arises; when qi scatters, death ensues.\" Knowing that qi gathering brings life, one cannot prevent it; knowing that qi scattering brings death, one cannot halt it. Since primordial qi cannot be restrained, life belongs to the creator and not to oneself. The perfected attain its essential pivot and can grasp the breath of inhalation and exhalation. As the breath enters and exits under their control, their life rests with them and not with heaven. What the vulgar call \"nurturing breath\" is in truth the transmitted sacred teaching of the immortals, enlightening the foolish—who can awaken to it? Those who awaken can guide their breath to prevent its scattering, naturally accumulating harmonious qi within a single breath. Over time, as merit and virtue accumulate, they naturally attain perfection—thus it is said, \"accumulating qi and amassing merit.\"\n\nResonating in harmony to save sinners,\nLaozi said: \"Those who harmonize with the Dao, the Dao also attains.\" If one diligently seeks the gate of the master, delights in the profound principle, and exhaustively studies the scriptures and teachings with an undivided mind devoted to the Dao, this is called \"resonating in harmony\" and \"seeking those of the same qi.\" Only then can one speak of the supreme Dao and deliver them—thus it is said, \"resonating in harmony to save sinners.\"\n\nSinners are truly pitiable; I now expound this wondrous scripture.\nWhen a person is conceived in the womb, for ten continuous months, they breathe as their mother breathes, inhale as she inhales. With qi complete and spirit intact, they emerge from the womb to be born, startling heaven and earth to become human—this is called infancy. The heart of an infant values only the mother’s milk, knowing nothing else. This is the time of embracing the true and holding to simplicity. After a hundred days, they are enticed by external things, emotions manifest outwardly, and soon they can smile—transforming from infancy to childhood. From this point begins the loss of the Dao and the departure from simplicity. Then, at fifteen, they become youths; at twenty, they come of age. Their eyes are dazzled by the five colors, their ears confused by the five sounds. The seven emotions usurp their nature, the six desires muddy their authenticity, and their pure simplicity is entirely lost. Day and night, they die and are reborn ten thousand times, driving and exhausting their ethereal and corporeal souls without a moment’s rest. Such is the plight of worldly people, enduring the torments of the unceasing hells in their embodied existence, sinking and drowning without hope of escape. Without attaining the Dao, who can be freed? These sinners are truly pitiable. Therefore, the Celestial Worthy widely opens the gate of salvation from suffering, broadly revealing the subtle and wondrous scriptures. The sacred domains of the Three Clarities lie open for return.\n\nRecite without ceasing, return the body without pause.\nWith a single thought devoted to the Dao, recitation never ceases; delving into the immortal scriptures, contemplation never halts. Since recitation knows no rest, profound mysteries and hidden wonders merge with the natural. The *Scripture of Inner Observation* states: \"When qi enters the body, it is called life; when spirit departs from form, it is called death.\" Thus, the sage steals and gathers celestial qi, returning it to the body. The sagely work is subtly employed, reversing the cycle of day and night without pause—thus it is said, \"return the body without pause.\"\n\nHeavenly halls enjoy great fortune; hells are silent of suffering.\nHeavenly immortals do not depart from heaven, divine immortals do not depart from the divine, earthly immortals do not depart from earth, alchemical immortals do not depart from ingesting elixirs and minerals, and ghostly immortals do not depart from yin spirits. These are the results of the paths they practice, just as water flows to the damp, fire to the dry, clouds follow the dragon, and wind the tiger. Those who cultivate the higher studies concentrate spirit and refine qi, return to life and restore the root, transform their bodies into pure yang, and transcend the kalpas of the dust. Chewing the morning mist, swallowing the nocturnal dew, the two luminaries entwine, the six qi converge upon the body. Inhaling the cloud essence of the Great Brahmā, their wondrous work fully partakes of the celestial kitchen. Naturally, they attain longevity and return to the heavenly halls—thus it is said, \"heavenly halls enjoy great fortune.\" Not consuming the grains of the hundred crops or the essence of the earth, their bodies do not die. Returning to earth, they are free from the suffering of descent—thus it is said, \"hells are silent of suffering.\"\n\nThe fire-obscuration transforms into pure clarity.\nThe fire-obscuration is the name of a southern hell. Sentient beings are constantly scorched by the fire of desire, their eyes veiled by delusion—thus it is called the fire-obscuration. When the eyes move and the heart stirs, hell immediately appears. Yet upon awakening to the true teaching, the nature of heaven becomes radiant and clear. With a single thought profoundly still, the so-called fire-obscuration is transformed into a realm of purity.",
      "overlap_context": " of the supreme vehicle have never spoken of derivative numbers.\n\nI take refuge in the Supreme Worthy, who can dissolve all sins.\nTaking refuge in spirit and life with the Supreme means never for a moment parting from the Dao. If one does not part from the Dao even for a moment, then the divine luminaries protect one, great fortune follows, and all actions meet with auspiciousness—what sins could there be?\n\nThe Celestial Worthy of the Treasure of the King of the Eastern Realm, Supreme in Heaven,",
      "start_char": 6970,
      "end_char": 8250,
      "start_sentence": 197,
      "end_sentence": 237,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.454413175582886,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上洞玄灵宝天尊说救苦妙经批注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "剑树化为骞。 剑树乃地狱名也，众生竞名利，争人我，与物相刃相摩，交谈如矛戟，对面如寇雠，见受剑树之狱也。 至人体道，含洪光大，为而不争，胸中之荆棘悉化玉树骞林也。 上登朱陵府，下入开光门。 此言行火也，心为朱陵府，谓之上昧君火，闭息宴坐，以心引之，则无乎不焚。 肾为玄冥府，谓之中昧臣火，升腰胁腹，闭息行之，则无乎不达。 膀胱谓之三昧民火，提动机关，金龟吐焰，则无乎不升。 炼上尸则火炁腾陟於绛宫，故曰上登朱陵府，焚下尸则火炁透彻尾闾，故曰下入开光门。 超度三界难， 世之人头顶欲天，足履欲地，身处欲界，轮转於六欲业轮之中，无有休息者，不忘於欲也，能常无欲，则三界轮回之难顿超之矣。 径上元始天。 元始天即玉清圣境也，上道既成，神升玉清，位为真人，出则诸天侍轩，万神备卫，高出乎太清上清之真也。 於是飞天真人无鞅数众，瞻仰尊颜，而作颂曰： 人之顶骨八片，谓之八天，亦曰八门，中有金楼宝殿玉阙紫房，自己无相，真人总领，万神居之，道成则神光内烛，天门自开，婴兄蜕质，於是真人飞从天门而出，故曰飞天真人。 身中之千真万灵，即无鞅数众也。 《度人经》曰：上开八门，飞天法轮。 《生神章》云：庆此婴儿蜕，正此谓也。 神升玄都，上朝虚皇，故曰瞻仰尊颜，而作谣歌，颂咏大圣之德也。 天尊说经教，引接於浮生。 天职覆，地职载，圣职教化，天尊所以广敷经教，接引浮世众生者，乃圣人之职也。 勤修学无为， 无为为之之谓道，无为言之之为德，天无为以清，地无为以宁，二无为相合而万物生，人安得无为哉。 故曰恬淡寂寞，虚无无为，此天地之平而道德之质也，勤修上士，绝学高人，能依无为，是配合天地之平准，符契道德之质实，不亦大哉。 悟真道自成。 悟其真者，始觉万缘俱假，惟道是真，抱守其真，自然成道。 不迷亦不荒， 世人迷於名利情欲，荒於声色滋味，迷之又迷，以至於荒，荒者言其神不明，而心灵逐物，荡荡逝去而不返也。 老子曰荒兮其未央哉，决以言其未尝守中也。 夫至人履乎平易，践乎恬愉，澹然独与，神明俱视，天下皆为尘劳妄幻，风灯众沬，露电泡影，既不坚久，无足倾恋，入乎泰定真常之域，一念不生，万缘俱息，至此境界，何荒迷之有哉。 无我亦无名。 不尚贤能外其身而虚己以逝世，故曰无我。 道常无名，是以圣人韬其光而隐其身者，恐其道未成而名胜於实也，名者实之宾，虚名出而道德备矣，故曰绳绳兮不可名。 庄子云：神人无功，至人无己，圣人无名也。 朗咏罪福句， 扬教化也。 万徧心垢清。 精研圣典，灵府虚明。 於是飞天神王及诸仙众，说是颂毕，稽首天尊，奉辞而退。 飞天神王乃我本来之帝真也。 夫神通变化，众而为一，不为不足化而为万，不为有余，及诸仙众，则自己之万神也。 稽首天尊，永遵依大道也。 奉辞而退，复归於无极也。 太上洞玄灵宝天尊说救苦妙经注解竟 太上洞玄灵宝天尊说救苦妙经注解 经名：太上洞玄灵宝天尊说救苦妙经注解。 宋元间道士洞阳子撰。 一卷。 底本出处：《正统道藏》洞玄部玉诀类。 太上洞玄灵宝救苦妙经序 夫学长生久视之道，在乎炼炁养神，兼施并行。",
      "translated_text": "The sword-trees transform into towering canopies.\nThe sword-trees are the name of a hell, where sentient beings vie for fame and profit, contend over self and others, and engage with things as if wielding blades and grinding edges. Their exchanges are like spear and halberd, their faces like those of sworn enemies—thus they suffer the hell of sword-trees. When the perfected one embodies the Dao, embracing vast luminosity and greatness, acting without contention, the thorns in their breast all transform into jade trees and towering forests.\n\nAscend above to the Vermilion Mansion, descend below into the Gate of Radiant Opening.\nThis speaks of circulating the fire. The heart is the Vermilion Mansion, called the sovereign fire of upper darkness. By closing the breath and sitting in repose, guiding it with the heart, there is nowhere it does not burn. The kidneys are the Dark and Mysterious Mansion, called the ministerial fire of middle darkness. Rising through the waist, flanks, and abdomen while closing the breath and circulating it, there is nowhere it does not reach. The bladder is called the civil fire of samādhi. By activating the mechanism, the golden tortoise exhales flames, and there is nowhere it does not ascend. Refining the upper corpse, the fire-qi ascends to the Crimson Palace—thus it is said, \"ascend above to the Vermilion Mansion.\" Burning the lower corpse, the fire-qi penetrates the Gate of Tailbone—thus it is said, \"descend below into the Gate of Radiant Opening.\"\n\nTranscend the trials of the Three Realms.\nPeople of the world have their heads beneath the heavens of desire and their feet upon the earth of desire, their bodies dwelling in the Realm of Desire, endlessly revolving within the karmic wheel of the six desires. Never forgetting desire, if one can constantly be without desire, the trials of the Three Realms’ transmigration are instantly transcended.\n\nDirectly ascend to the Heaven of Original Beginning.\nThe Heaven of Original Beginning is the sacred realm of Jade Clarity. When the supreme Dao is accomplished, the spirit ascends to Jade Clarity, attaining the rank of Perfected One. Emerging, all heavens attend their carriage, and the ten thousand spirits stand guard—elevated above the Perfected of Great Clarity and Highest Clarity.\n\nThen, the flying heavenly perfected ones, countless in number, gaze upon the honored countenance and offer this ode:\nThe eight pieces of the human skull are called the Eight Heavens, also known as the Eight Gates. Within them lie golden towers, jeweled halls, jade pavilions, and purple chambers. Though formless in oneself, the Perfected One presides over all, and the ten thousand spirits dwell therein. When the Dao is accomplished, the divine light illumines within, and the heavenly gates open of themselves. The Infant and Maiden shed their forms, and thus the Perfected One flies forth from the heavenly gates—hence the name \"flying heavenly perfected ones.\" The thousand perfected and ten thousand spirits within the body are the countless multitude.\n\nThe *Scripture of Salvation* states: \"Above, the Eight Gates open, and the flying heavenly Dharma-wheel turns.\" The *Chapter on Generating the Spirit* says: \"Rejoice in this shedding of the Infant’s form\"—this is precisely what it refers to. The spirit ascends to the Dark Capital, ascending to pay homage to the Celestial Venerable—thus it is said, \"gaze upon the honored countenance and offer songs,\" praising the virtue of the Great Sage.\n\nThe Heavenly Worthy expounds the scriptural teachings, guiding and receiving the floating lives.\nThe office of heaven is to cover, the office of earth is to bear, and the office of the sage is to transform through teaching. Thus, the Heavenly Worthy broadly disseminates scriptural teachings to guide and receive the floating lives of the world—this is the duty of the sage.\n\nDiligently cultivate and study non-action.\nNon-action that acts is called the Dao; non-action that speaks is called virtue. Heaven is non-active in its clarity, earth is non-active in its tranquility. The two non-actions combine, and the ten thousand things are born—how can humans not practice non-action? Thus it is said: \"Serene, tranquil, empty, and non-active—this is the equilibrium of heaven and earth and the essence of the Dao and virtue.\" The diligent cultivator, the lofty person who abandons learning, can align with non-action, harmonizing with the equilibrium of heaven and earth and conforming to the essence of the Dao and virtue—is this not grand?\n\nAwaken to the true Dao and naturally attain accomplishment.\nTo awaken to the truth is to realize that the ten thousand conditions are all illusory, and only the Dao is real. Embracing and guarding the real, one naturally attains the Dao.\n\nNeither deluded nor dissipated.\nWorldly people are deluded by fame, profit, emotions, and desires, and dissipated by sounds, colors, flavors, and pleasures. Deluded again and again, they reach dissipation—dissipation meaning their spirit is unclear, their heart-mind follows things, drifting away without return. Laozi said: \"So dissipated! It has not yet reached its center\"—this decisively speaks of never having guarded the center. The perfected one treads the level and easy, walks the serene and joyful, calmly and alone, their spirit and brightness united in vision. All under heaven are but toil and illusion, like wind-blown lamps, foam, lightning, and bubbles—neither enduring nor substantial, unworthy of attachment. Entering the realm of supreme stability and true constancy, where not a single thought arises and the ten thousand conditions cease—at this境界, how could there be any dissipation or delusion?\n\nNeither self nor name.\nNot esteeming worthies or abilities, casting aside the self and emptying the body to depart the world—thus it is said, \"no self.\" The Dao is eternally nameless, and thus the sage conceals their light and hides their body, fearing that the Dao is not yet accomplished while their name surpasses their reality. Name is the guest of reality; when empty fame arises, the Dao and virtue are complete—thus it is said, \"endlessly, it cannot be named.\" Zhuangzi said: \"The spirit-person is without merit, the perfected one is without self, the sage is without name.\"\n\nClearly chant the verses on sin and fortune,\nProclaiming transformation through teaching.\nTen thousand times, the filth of the heart is cleansed.\nThrough profound study of the sacred canon, the numinous palace becomes empty and bright.\n\nThen, the flying heavenly spirit-kings and all the immortals, having recited this ode, bow their heads to the Heavenly Worthy, take their leave, and withdraw.\nThe flying heavenly spirit-kings are the original sovereign spirits of our inherent nature. The divine transformations, though many, unite as one—not transforming due to insufficiency but manifesting as the ten thousand, not due to excess. The various immortals are the ten thousand spirits of oneself. Bowing their heads to the Heavenly Worthy, they eternally follow the great Dao. Taking their leave and withdrawing, they return to the Ultimate Non-Being.\n\n*Commentary on the Wondrous Scripture of Salvation Spoken by the Heavenly Worthy of the Numinous Treasure of Supreme Mystery and Cavernous Mystery* concludes.\n\n*Commentary on the Wondrous Scripture of Salvation Spoken by the Heavenly Worthy of the Numinous Treasure of Supreme Mystery and Cavernous Mystery*\nScripture Title: *Commentary on the Wondrous Scripture of Salvation Spoken by the Heavenly Worthy of the Numinous Treasure of Supreme Mystery and Cavernous Mystery*. Composed by Dongyangzi, a Daoist of the Song-Yuan period. One fascicle. Source of the base text: *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Section, Jade Instructions Category.\n\n*Preface to the Wondrous Scripture of Salvation of the Numinous Treasure of Supreme Mystery and Cavernous Mystery*\nThose who study the Dao of long life and enduring vision must refine qi and nurture spirit, practicing both simultaneously.",
      "overlap_context": "he fire-obscuration transforms into pure clarity.\nThe fire-obscuration is the name of a southern hell. Sentient beings are constantly scorched by the fire of desire, their eyes veiled by delusion—thus it is called the fire-obscuration. When the eyes move and the heart stirs, hell immediately appears. Yet upon awakening to the true teaching, the nature of heaven becomes radiant and clear. With a single thought profoundly still, the so-called fire-obscuration is transformed into a realm of purity.",
      "start_char": 8251,
      "end_char": 9551,
      "start_sentence": 238,
      "end_sentence": 287,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.23271179199219,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上洞玄灵宝天尊说救苦妙经批注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "然炼养之功，本乎一心，心能勤修，则学仙何患乎不得。 《真诰》曰：仙者心学，奥哉斯旨也。 仆夙慕修真，未逢上士，有果能明生死，达性命者，仆将跪履而问焉。 比游武夷西湖，与四明吕君邂逅，一见欢然，遂定交为烟萝友，因俱载以归，馆于静舍。 吕君号洞阳子，蚤遇至人，刻意庄老之学，博极仙书，问靡不知。 一日谓愚曰：世有所谓《救苦经》者，实大洞之密旨，上道之秘言也。 以其隐奥玄微，难穷妙理，所以传自往古，而诠注未彰，思欲殚所蕴，发挥其义。 未几书成，滔滔万言，首明一点，指庆云祥烟为泰和，辩生门死户为玄牝，分二炁之清浊，判三昧之火符，以泥丸仙明真性之所归，还上天炁为命宝之所集，总谈上道之枢要，集然包括其中，不惟 警未闻裨后学而已，抑亦使人洞明修炼，默识天机，岂架空言衒虚文之比哉。 噫，此经之妙道至言，晦久而未明，今日显矣。 夫天中之尊，演教法弘济，所谓救苦者，非独为幽魂苦爽而设，其所救者，普天之下生灵耳。 盖欲使人人体道，咸离迷途，湛壶天之朗彻，悟真性之无为，然后服天气，盗虚无，结圣胎，通神明，使形与神妙，白日飞升，是谓大丈夫越世表，出三界轮回之难，始名真救苦耳。 大矣哉，超死度生，无出是经，有遇斯解，留神不舍者，必见其得道矣。 锦江葆真子周准谨序。",
      "translated_text": "Yet the work of refinement and nurturance fundamentally resides in the One Mind. If the mind can diligently cultivate itself, then what hindrance remains to attaining immortality? As the *Declarations of the Perfected* states: \"Immortality is the study of the heart—profound indeed is this principle.\"\n\nI have long admired the pursuit of true reality, though I have yet to encounter a perfected master. Should there be one who can clarify life and death, who penetrates the nature of destiny, I would kneel at their footsteps to seek instruction. Recently, while traveling between Mount Wuyi and West Lake, I chanced upon Master Lü of Siming. At our first meeting, we rejoiced, and soon formed a bond as friends of the misty groves. Together, we returned, and he took residence in my quiet abode.\n\nMaster Lü, styled Dongyangzi, early in life met a perfected being and devoted himself to the teachings of Zhuangzi and Laozi. His mastery of immortal scriptures is vast, and no question lies beyond his understanding. One day, he said to me: \"There exists in the world a *Scripture of Salvation*—truly the esoteric essence of the Great Cavern, the secret words of the Supreme Dao. Yet its depths are obscure and its subtleties profound, making its wondrous principles difficult to fathom. Though transmitted since ancient times, its annotations remain unilluminated. I wish to exhaust my store of knowledge to expound its meaning.\"\n\nBefore long, his work was complete—a flowing ten thousand words. It begins by clarifying the single luminous point, identifying auspicious clouds and propitious mists as the Great Harmony. It distinguishes the Gate of Life and the Door of Death as the Mysterious Female, separates the purity and turbidity of the Two Qi, and discerns the fire talismans of the Three Meditations. It reveals the Cavern Chamber as the destination of the enlightened true nature, and the return of celestial qi as the gathering of the treasure of destiny. In sum, it discusses the pivotal essentials of the Supreme Dao, encompassing all within its scope. This is not merely to awaken the unenlightened and aid later learners, but also to enable practitioners to thoroughly comprehend the workings of refinement and silently grasp the celestial mechanism—how could it be compared to empty words or vain rhetoric?\n\nAlas! The wondrous Dao and ultimate teachings of this scripture, long obscured, are now made manifest. The Heavenly Worthy, supreme among the heavens, expounds the Dharma to broadly deliver all beings. This so-called \"salvation from suffering\" is not solely established for the tormented souls of the departed; rather, its salvation extends to all living beings beneath the heavens. For it aims to guide every person to embody the Dao, to universally depart from delusion, to perceive the clarity of the celestial realm, and to awaken to the non-action of the true nature. Only then may one ingest celestial qi, steal from the void, congeal the sacred embryo, and commune with the numinous. When form and spirit unite in subtlety, one ascends in broad daylight—this is what it means to be a great person transcending the world, escaping the trials of the Three Realms’ cycle of rebirth. Only then is it called true salvation from suffering.\n\nHow vast! To transcend death and ferry across life—nothing surpasses this scripture. Those who encounter this commentary and attend to it without ceasing will surely witness their attainment of the Dao.\n\nRespectfully inscribed by Zhou Zhun, the Preserver of Authenticity of the Brocade River.",
      "overlap_context": "thy of the Numinous Treasure of Supreme Mystery and Cavernous Mystery*. Composed by Dongyangzi, a Daoist of the Song-Yuan period. One fascicle. Source of the base text: *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Section, Jade Instructions Category.\n\n*Preface to the Wondrous Scripture of Salvation of the Numinous Treasure of Supreme Mystery and Cavernous Mystery*\nThose who study the Dao of long life and enduring vision must refine qi and nurture spirit, practicing both simultaneously.",
      "start_char": 9551,
      "end_char": 10066,
      "start_sentence": 288,
      "end_sentence": 301,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.708396673202515,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上洞玄灵宝天尊说救苦妙经批注.txt",
        "category": "玉诀类"
      }
    }
  ]
}