{
  "source_id": "太上老君说常清静经注（前蜀杜光庭）",
  "source_file": "chunked_daozang\\太上老君说常清静经注（前蜀杜光庭）.json",
  "total_chunks": 12,
  "total_original_chars": 13532,
  "total_translated_chars": 78173,
  "total_translation_time": 352.20334482192993,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静经注（前蜀杜光庭）.txt",
    "category": "玉诀类"
  },
  "full_translation": "**Commentary on the Supreme Lord Lao’s Scripture of Constant Purity and Tranquility (Fascicle Five)**\n\n**Scripture Title:** *Commentary on the Supreme Lord Lao’s Scripture of Constant Purity and Tranquility*\n**Commentator:** Du Guangting, a Daoist of the late Tang and Five Dynasties period.\n**Volume:** One.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Washen* Section, *Jade Instructions* Category.\n\n**Commentary on the Supreme Lord Lao’s Scripture of Constant Purity and Tranquility (Fascicle Five)**\n**Annotated by:** Du Guangting, Grand Master of Propagating the Dao, Transmitted Perfected Reality, Celestial-Bestowed Purple Robe, and Vast Accomplishment.\n\n**The Supreme Lord Lao**\n*\"Tai\"* (Supreme) signifies greatness. *\"Shang\"* (Above) signifies reverence. None among the lofty Perfected precede Him, and all sages hold Him in shared veneration. Thus, He is called the *Supreme Lord Lao*.\n*\"Lao\"* (Old) denotes longevity, for the Lord Lao cultivates Heaven and Earth, naturally attaining long life—hence, *Lao*.\n*\"Jun\"* (Lord) is a title of honor, for His Dao is pure and His virtue perfect—thus, *Jun*.\nThis clarifies that the Lord Lao is the Ancestor of all sages, the Origin of true spirits, and that all myriad things are fashioned by Him. Therefore, He is the Primordial Ancestor.\n\n**The Scripture of Constant Purity and Tranquility**\nThis elucidates the principle of purity and tranquility.\n*\"Chang\"* (Constant) means *dharma* (law). By constantly adhering to this law, the scripture embodies purity and tranquility.\n*\"Qing\"* (Pure) is the primordial. *\"Jing\"* (Tranquil) is *qi*.\n*\"Jing\"* (Scripture) is the *dharma* (law): first, it is the path of the sages; second, it is the ladder of the immortals. All who study the Dao attain true sageliness through scripture and precepts.\nNo sage arises without relying on scripture and precepts, nor does any achieve the Dao without the primordial *qi*.\nThis chapter’s verses are divided into three sections: first, clarifying the formless Dao; next, expounding the principle of its movement; and last, elucidating the nameless *dharma*.\n\n1. **Clarifying the Formless Dao**\n2. **Clarifying the Unfeeling Dao**\n3. **Clarifying the Nameless Dao**\n\n**First: Clarifying the Formless Dao, Which Shapes Heaven and Earth, Dividing and Judging the Pure and Turbid**\nThe Lord Lao said: *\"The Great Dao is formless, giving birth to Heaven and Earth.\"*\n*\"Dao\"* is the term uttered when the mouth opens and the tongue moves. It is also said: *\"Dao\"* is the *qi* of emptiness and nothingness, the origin of primordial chaos, the ancestor of *Qian* and *Kun*, capable of being and non-being, encompassing Heaven and Earth.\nThe Dao is fundamentally formless, defying all names.\nThe form of the formless is called the *true form*; the image of the imageless is called the *true image*.\nIt precedes Heaven and Earth yet is not ancient; it follows Heaven and Earth yet is not old.\nIt manifests without form, stands without image, and transforms without action. Thus, it is called the *Great Dao*.\nThe scripture says: *\"Look for it, and it cannot be seen.\"* Hence, it is *formless*.\nVast and obscure, within it lies essence; chaotic and undifferentiated, it divides into *yin* and *yang*, thus forming Heaven and Earth.\n*\"Yu\"* (Nurture) means to nourish. It fosters *yin* and *yang*, hence *giving birth and nurturing*.\n*Yang* is pure, ascending to become Heaven. *Yin* is turbid, sinking to become Earth. Heaven and Earth are the children of the Great Dao.\nThis section clarifies the unfeeling yet operative nature of the Dao, the function of *yin* and *yang*.\n\nThe sun and moon are the essence-*qi* of *yin* and *yang*. The Great Dao is unfeeling, yet it moves the sun and moon.\nFrom non-being, it generates being, shaping and transforming to form all things.\nWithout the essence-*qi* of Heaven, there would be nothing to govern the brightness of the sun and moon; without the essence-*qi* of Earth, there would be nothing to stabilize the mountains and peaks; without the essence-*qi* of humans, there would be nothing to sustain the body’s existence.\nThus, the sun and moon receive their movement from *yin* and *yang*.\nTherefore, the Dao’s lack of feeling follows the mechanism of transformation.\nIt is also said: *\"What does Heaven say? The four seasons proceed.\"* *\"What does Earth say? The myriad things are born.\"*\nThe scripture says: *\"Its use is inexhaustible.\"* It is unfeeling yet moves the sun and moon.\nThe sun and moon are the functions of the Great Dao.\n\n**This section clarifies the nameless Dao, which spontaneously gives life to and nurtures the myriad things.**\nThe Great Dao is nameless, nurturing the myriad things.\nThe primordial *qi* is formless and cannot be named.\nThe scripture says: *\"The Dao is hidden and nameless.\"*\nIt is born of Heaven and Earth.\nThus it is said: *\"The Dao gives birth to the One, the One gives birth to the Two, the Two gives birth to the Three, and the Three gives birth to the myriad things.\"*\nThe myriad things are the descendants of the Five Phases.\nThe Three Powers (*Heaven, Earth, Humanity*) are the parents of the myriad things.\nThe Dao is the ancestor of the Three Powers.\nThus, the primordial *qi* is pure and tranquil, and cannot be constantly named.\nThose who study the Dao must observe the origin and examine conduct. If one’s wisdom and nature are unimpeded, one may ascend the path of the Great Dao, roam beyond the Three Powers—something ordinary people cannot comprehend.\n\nThe preceding chapter clarifies the formless and nameless nature of the Dao, enabling it to move the sun and moon.\nThese two phrases are the Supreme Lord’s self-designation, a name for the nameless, forcibly called the *Dao*.\n*\"I do not know its name; forcibly, I call it Dao.\"*\n*\"Wu\"* (I) means *me*. This shows the Supreme Lord saying: *\"I do not know its name; forcibly, I call it Dao.\"*\nThis also clarifies that the highest virtue does not act as virtue, hence the meaning of *having virtue*.\nThe Lord Lao shapes Heaven and Earth, opens *Qian* and *Kun*, transforms the myriad things, yet does not say *\"I am the cause.\"*\nThe Dao follows spontaneity and cannot be named.\nAt times, it moves from being to non-being, or from non-being to being; its concealment and manifestation are boundless, its existence and cessation are free—how could it have a constant name?\nThus, the scripture says: *\"I do not know whose child it is; it seems to have existed before the Lord of Heaven.\"*\nIt also says: *\"I do not know its name; I style it the Dao.\"*\n\nThe first two phrases clarify the Supreme Lord’s self-designation, for the Dao is nameless.\nThe following nine phrases elucidate the exalted and humble nature of the Great Dao, using the primordial *qi*’s purity and tranquility and the analogy of Heaven, Earth, male, and female.\nWithin this chapter, it is divided into three sections:\n1. **Clarifying the Dao’s division into pure and turbid, movement and stillness by analogy;**\n2. **Clarifying the mechanism of movement and stillness in Heaven, Earth, male, and female;**\n3. **Clarifying the origin and end of the myriad things.**\n\n*\"The Dao has purity and turbidity, movement and stillness.\"*\n\nThe pure is Heaven, for the *qi* of true Yang ascends and forms Heaven. The turbid is Earth, for the *qi* of true Yin descends and congeals into Earth. *Fu* is an introductory particle. The Dao can be pure or turbid, active or still—so vast and unfathomable is the Great Dao that the terms \"pure,\" \"turbid,\" \"active,\" and \"still\" all serve as its functions. Thus, those who study the Dao: if they can comprehend the *qi* of activity and stillness, stabilize their position, then the Great Dao will naturally return to them. When activity and stillness are in harmony, this is called the correct state.\n\nThese four phrases, together with the preceding three, all elucidate the principles of purity and turbidity, activity and stillness. Combined with the following two phrases, they form a single chapter, revealing the exalted and humble positions of the Great Dao, as well as the origin and end of all things.\n\nWithin these three sections, the second clarifies the functions of purity and turbidity, activity and stillness in male and female. Heaven is pure, Earth is turbid; Heaven is active, Earth is still. Male is pure, female is turbid; male is active, female is still. *Liezi* says: \"Heaven is but accumulated *qi*; Earth is but accumulated masses.\" Heaven and Earth are joined, never to be separated. All above Earth is Heaven. There are many Heavens and many Earths, each with different names. On all four sides and eight directions, above lie the Thirty-Two Heavens and Thirty-Two Emperors, all composed of pure *qi*. Below lie the Nine Earths, and beneath the Nine Earths are the winds and waters. Beneath winds and waters, darkness unfathomable. From the Nine Earths upward to the various Heavens, all emerge from the *Hunyuan* Diagram. *The Upper Clarity Scripture* states: \"In every direction, there are fifty-five myriad, five thousand, five hundred and fifty layers of Heaven, and the number of Earths is the same.\" This demonstrates the supremacy of the Great Dao, vast enough to embrace all, subtle enough to contain all.\n\nMale is Yang; female is Yin. When a person is in the mother’s womb at the moment of conception, they receive the *qi* of Heaven and Earth’s Yin and Yang to form their body. Those who receive the pure Yang *qi* of Heaven and Earth become male. During the ten months, if they remain beneath the mother’s left armpit, it is a male. Those who receive the pure Yin *qi* of Heaven and Earth become female. During the ten months, if they remain beneath the mother’s right armpit, it is a female. The water-nature of the female is the *qi* of extreme Yin, thus she is still. The fire-nature of the male is the *qi* of extreme Yang, thus he is active. The active ascends and corresponds to Heaven; the still is turbid and sluggish, corresponding to Earth. Thus it is said: \"Heaven is exalted, Earth is humble; Qian and Kun are established. Male is exalted, female is humble; Yin and Yang are divided.\" Hence, \"male is active, female is still.\"\n\nThese two phrases clarify the origin and end. Together with the preceding seven phrases, they form a single chapter, divided into three parts. The origin flows into the end, giving birth to the myriad things. The origin is the primordial; the primordial is the Dao. The Dao originally encompasses primordial *qi*; primordial *qi* divides into the Two Modes; the Two Modes divide into the Three Powers; the Three Powers divide into the Five Phases; the Five Phases transform into the myriad things. The myriad things are the end. If one can embrace the primordial and guard the One, return to the Great Dao, and revert to the root, they do not return to the end. The end is transformation; the origin is generation. If one can return to the root, this is called the Dao of regulating and restoring life and nature. *The True Scripture of Southern Florescence* says: \"Life is the congealing of spirit; death is the transformation of things.\" If one can return to true spirit, returning to true spirit is called reverting to the origin and returning to the source—one must not pursue things.\n\nThis section of four phrases clarifies the source of purity and turbidity, the foundation of activity and stillness. If one possesses the Dao, the Dao naturally returns. The pure is the source of the turbid; the active is the foundation of the still. If one can always be pure and still, Heaven and Earth will all return. The pure is the *qi* of Heaven; the turbid is the *qi* of Earth. All things are born from the *qi* of purity and turbidity. If worldly people seek the Dao of longevity, refining Yin into Yang, refining to near-perfection and becoming a sage, it is all because the pure arises from the turbid, and the active arises from the still. Purity and turbidity are alternate names for the Dao. Those who study immortality, if they can firmly guard the Great Dao, all things will naturally return to them. Thus, *The Western Ascension Scripture* says: \"The Yangtze, the Yellow River, the Huai, and the seas do not desire fish, turtles, or dragons—yet fish, turtles, and dragons naturally return to them. If one can be pure and empty, desireless and non-active, though they do not seek the Great Dao, the Great Dao will naturally return to them.\" Simply guard the primordial *qi* of Great Harmony, embody the Dao and unite with the true, and all things will return.\n\nThese four phrases clarify that the heart and spirit are originally pure and still, but are disturbed by worldly desires. The spirit delights in purity, yet the heart disturbs it; the heart delights in stillness, yet desires entangle it. Spirit is wondrous and unfathomable—it is called spirit. The heart is spirit; spirit is the heart. When the heart is disturbed, the spirit moves; when the spirit moves, the heart floats; when the heart floats, desires arise; when desires arise, the spirit is harmed; when the spirit is harmed, the Dao is lost. If one can subdue the heart, inwardly stabilize the spirit, and outwardly eliminate desires, they will naturally become pure and still. This refers to the following text.\n\nThis section of four phrases clarifies the effort of cultivation: dispelling desires and settling the heart to naturally attain purity and stillness. If one can constantly dispel desires, the heart will naturally become still; if one can settle the heart, the spirit will naturally become pure. *Dispel* is a metaphor for removal. If one can eliminate emotions and desires, inwardly guard primordial harmony, the heart and spirit will naturally be at peace. When the heart is at peace, how can worldly desires arise? Thus, citing *The Western Ascension Scripture*: \"To teach people to cultivate the Dao is to cultivate the heart; to teach people to cultivate the heart is to cultivate the Dao.\" Therefore, one must cut off the single source of profit, cultivate truth and nurture nature, then preserve the heart and spirit in peace and joy. Thus, the sages say: \"Cultivate truth and nurture nature, carry the spirit and support life—then one can leave suffering and ascend to joy, blessings and fortune will flow, and the true Dao is accomplished.\"\n\nThese two lines form a single passage, elucidating that through the cultivation of truth to the point of spiritual attainment, the six desires and three poisons naturally dissipate. Naturally, the six desires do not arise, and the three poisons are extinguished.\n\nThe six desires refer to the six roots. The six roots are the eye, ear, mouth, nose, heart, and intent. *Desire* signifies the appearance of attachment and the metaphor of emotional love. Perceiving external phenomena and becoming defiled is called desire—thus, the eye sees, the ear hears, the intent knows, and the heart perceives. If one can sever emotional attachments, dispel desires, settle the heart, forget anxieties, and stabilize the spirit, the six desires will naturally vanish—how could they arise? When the inner spirit does not stray outward and the six consciousnesses remain unmoved, the six roots naturally attain purity and thus do not generate.\n\nThe three poisons are extinguished. The three poisons are the roots of the three paths and the ancestors of the three karmas. The three are the body, heart, and mouth. When one possesses a body, the body engages in deluded actions; the heart harbors deluded thoughts; and the mouth utters deluded speech. These three karmas constitute the three poisons. It is also said that the three poisons are the three corpses: Peng Ju, Peng Zan, and Peng Jiao. The upper corpse delights in adornments, the middle corpse in rich flavors, and the lower corpse in lust. If one can sever attachment to adornments, distance oneself from rich flavors, and cut off lust, abandoning these three matters, it is called the extinction of the three poisons. Once the three poisons are extinguished, the spirit harmonizes, qi flows smoothly, essence solidifies, the three origins attain tranquility, the three karmas do not arise, and purity naturally ensues.\n\nThe three origins are the upper origin, middle origin, and lower origin. The upper governs the three realms, giving rise to all things, and the three origins under heaven oversee human nature and life. The upper origin presides over the Niwan Palace in the brain, forming the upper cinnabar field; the middle origin governs the Crimson Palace in the heart, constituting the middle cinnabar field; the lower origin rules the Sea of Qi, belonging to the Kidney Palace, forming the lower cinnabar field. These three origins—upper governing spirit, middle governing qi, and lower governing essence—thus oversee human nature and life. If one can sever the three karmas, preserve these three palaces, further refine the qi of the four seasons, circulate essence and vitality endlessly, then the three cinnabar fields will solidify, all harmonies will be gentle and compliant. The heart, like the great void, will be inwardly and outwardly pure and untainted—all due to the extinction of the three corpses, the removal of the false and retention of the true, which is the Dao of purity.\n\nThe preceding elucidates that cultivating truth to the point of spiritual attainment naturally extinguishes the six desires and three poisons. Here, it clarifies that if delusions remain unsevered and the heart becomes attached, one cannot exhaust wondrous function. The reason one cannot is that the heart is unsettled and desires remain undispelled. If one can eliminate the prior three karmas, the three corpses will be extinguished; when the three corpses are extinguished, the three cinnabar fields are preserved; when the three cinnabar fields solidify, qi flows unimpeded in endless circulation—then worldly desires cannot entangle the heart, and this is the Dao of purity. If one cannot single-mindedly devote effort, settle the heart, and sever anxieties, the heart cannot inwardly cultivate the supreme Dao, nor can it exhaust the principles of wondrous function. Without mastery over the monkey-mind, spirit and essence gradually dissipate. Once spirit and essence are lost, the six roots arise in delusion, and worldly desires entangle. This is what it means to be unable to extricate oneself from the net of birth and death, to struggle to escape the web of samsara.\n\nThe previous chapter clarifies the ability or inability to cultivate. This chapter uniquely elucidates that one can cultivate without attachment, break fixations, and attain truth. Nine essential sentences divide into three distinct meanings, forming a single passage.\n\nFor those who can dispel: inwardly observe the heart, and the heart has no heart. If one can sever emotions, abstain from excessive indulgence, and dispel desires, then the sins of the three karmas vanish. Without single-minded devotion to inner cultivation and guarding the Crimson Palace, one naturally observes one’s own heart inwardly. The heart is fire. Thus, citing *The Scripture of Inward Observation*: \"The heart is fire, the essence of the great yang in the south, governing fire. It corresponds above to Mars and below to the heart.\" The heart as the Crimson Palace is spirit—its wondrous function unfathomable, its transformations without fixed form. Spirit relies upon it, its three leaves like a lotus. It is also said: when restrained, it is upright; when unrestrained, it is wild. In purity, it lives; in turbidity and agitation, it perishes. It illuminates the eight directions yet may darken in one. Therefore, those who study must observe it: the heart resides within form, yet one must not observe the heart through form. If one observes through form, it becomes a duality. Form is the dwelling; the heart is the master. The dwelling cannot observe the master, hence it must not be observed thus. One may cause the spirit to observe the heart. Spirit is the child of qi; qi is the mother of spirit. When the heart and intent guide qi and preserve spirit to observe, resonance naturally occurs. How does one know this? An ancient virtuous one said: \"To cause qi and spirit to unite, spirit and heart, qi and the Dao, do not stray far from one another.\" Thus, the sages established methods to teach people: to cultivate the Dao is to cultivate the heart; to cultivate the heart is to cultivate the Dao.\n\nWhen the heart has no attachments, there is no heart to observe. With no heart to observe, there is nothing to employ, nothing to cultivate—then one coalesces with the Dao in stillness. Thus, the heart having no heart is the Dao of purity.\n\nExternally observe form, and form has no form. The heart is the master of form; form is the dwelling of the heart. Form without a master is unstable; the heart without a dwelling cannot stand. The heart resides within, form appears without. Inner and outer mutually sustain one another and cannot be separated. Heart and form both function yet must not be observed with fixation. Coalescing in primordial chaos, seemingly formless yet not nonexistent—if not for the absence of heart, how could one forget the body? Forgetting the body is called having no heart. This scripture states: \"I have a great affliction, for I have a body. When I have no body, what affliction do I have?\" Heart and form, in motion without defilement, at rest without attachment—this is what it means for form to have no form.\n\nObserve things from afar, and things have no thingness.\nThe five phases give rise to transformation—this is called \"things.\"\nIt is also said: that which congeals into solidity is called \"form.\"\nWhatever possesses form and substance is called a \"thing.\"\nThat things have no thingness is called \"the real,\" the true emptiness.\n\nThis scripture states: \"Vague and indistinct, yet within it there is something.\"\nThat \"something\" is the marvelous functioning of the Dao—it is not the ordinary things of this world.\nOnce these three are awakened to, only emptiness is seen.\nThe three are heart, form, and things.\nWithin, without, and in between—all are without attachment: this is called non-action.\nHaving entered non-action, this is called the Dharma of emptiness.\nEmptiness is the functioning of the Dao.\nWhere there is functioning and attachment, it cannot be called the Dao.\n\nThe preceding section discusses three matters.\nThis section alone clarifies the principle of non-emptiness and non-quiescence.\nThough it bears the name of emptiness and quiescence, if all are without attachment, this is the true Dao.\nThese six lines form a single passage.\n\nTo observe emptiness as empty—emptiness has no emptiness.\nEmptiness is true emptiness.\nThe characteristics of the Dharma of emptiness manifest in two kinds:\nThere is great emptiness, and there is small emptiness.\nGreat emptiness is the principle of non-action and non-non-action.\nSmall emptiness is the breaking of being to return to non-being, taking non-being as non-being—this is called small emptiness.\nWhen both these emptinesses are absent, one naturally does not defile the true nature, and thus accomplishes the true Dao.\n\nEmptiness has no great or small, nor any departure.\nWith attachment, it becomes manifest; without attachment, it remains hidden.\nThe characteristics of the Dharma of emptiness appear like a shadow following form.\nTo say there is no seeing is annihilation.\nThis Dharma abides eternally, like water or a mirror.\nWithin the human body, it governs life and nature.\nAll that dwells in substance relies on the Dao to complete its form.\nEvery kind of thing arises from the Dao without exception.\n\nThe great Dao is level and ever-present in things—it is not annihilation.\nWhat is emptied is already without, and the without is also without.\nEmptiness is neither great nor small, like the nature of the Dao, which has no length or shortness, nor any dust or defilement.\nWhen awakened to, it is called true emptiness; when unawakened, it is called illusory appearance—it is not the supreme Dao.\n\nThe *Shangqing Scripture* states: \"The characteristics of emptiness and illusion return again to illusion.\"\nThe Heavenly Worthy, in compassion, established the characteristics of emptiness and illusion as skillful means,\nresponding to conditions and transforming in accordance with the moment,\nteaching and guiding humans and heavenly beings to return to the supreme Dao.\nThe emptiness spoken of is not emptiness itself.\nThe characteristic of emptiness is the marvelous functioning of the Dao.\nWhen the Dao functions, it is present; when it does not, it is absent.\nIt is neither absent nor present—this is not called the Dao.\n\nThe Dao is originally the formless form, the true that can be named.\nVirtue is originally the imageless image—this is called the true image.\nVast and obscure, within it there is essence.\nThat essence is most true—it is not non-action.\nWhen the ten thousand dharmas are all absent, this is called empty absence.\nThe Dao of empty absence is also not natural.\nBreaking through this empty absence, one returns to the absence of absence.\n\nWhen the absence of absence is absent, it is profoundly and eternally quiescent.\nThe absence of absence is the absence of attachment.\nThough there is no attachment to views, one returns to the Dharma of quiescence.\nThe Dharma of quiescence is also absent—it is not quiescence, nor emptiness, nor absence.\nTo take non-emptiness as emptiness is called true emptiness.\nTo take non-absence as absence is the Dharma within absence.\nThe Dharma is also entirely absent, returning to true quiescence.\nTrue quiescence is also absent—it is not the absence of Dharma.\nIt is neither being nor non-being, neither emptiness nor form.\nProvisional names and appearances are used to transform and guide sentient beings.\nAll kinds of distinctions are attachments to views.\nWhen attachments to views are absent, this is called the natural.\n\nPurity and quiescence are not the Dharma of emptiness and quiescence.\nWhen emptiness and quiescence are absent, then it is profoundly and eternally abiding, open and unobstructed—this is called the true and constant Dao.\n\nThe preceding six lines clarify the principle of emptiness and quiescence.\nThese four lines clarify that when emptiness and quiescence are both absent, the natural is without desire, and thus the true Dao is accomplished.\n\nQuiescence has no quiescence—how could desire arise?\nThis clarifies that all dharma-characteristics return to quiescent extinction.\nThe true Dao is natural, eternally abiding and unchanging.\nWithout attachment or desire, one naturally accomplishes the Dao.\n\nWhen desire does not arise, this is true stillness.\nTrue stillness is the natural absence of desire.\nWith desire, affliction arises; without desire, the Dao arises.\nThis scripture states: \"I have a great affliction, for I have a fivefold embodied self.\nWhen I have no self, what affliction do I have?\"\nNo self is no desire; no desire is called the true self.\nThe true self is the Dao-body.\n\nThe preceding four lines clarify the absence of desire and quiescence.\nThese four lines clarify the Dao of true nature, which responds to conditions and things without fail, naturally pure and still.\nThe true and constant respond to things.\n\"True\" means the essence is without increase or decrease—this is called true.\n\"Constant\" is the Dharma.\nTo constantly embody the Dharma is called the true and constant Dharma.\nWhen the Dharma is true and constant, it responds to things and conditions, transforming and guiding sentient beings without fail—this is the thingness of the Dao.\n\"Constant\" is the Dharma of the Dao.\n\"Responding\" is the functioning of the Dao.\nWhen Dharma and functioning are absent, both are the constant Dao.\nWithin the constant Dao, there is naturally the Dao of true response.\nThus it is said: the true and constant respond to things—this is the marvelous functioning of the Dao.\n\nThe true and constant attain nature.\nTo attain true nature, one must cultivate constant nature.\nThat which attains the nature of the Dao is movement.\nTo move one’s fundamental nature is to attain nature.\nConstantly responding, constantly still, one is constantly pure and still.\nBeing in the nature of the Dao, one originally seeks purity and stillness.\nNaturally responding to things, constantly functioning in the world,\nwithout defilement or attachment, without filth or dust, one transforms in accordance with conditions.\n\nThis scripture states: \"The highest good is like water.\"\nWater benefits the ten thousand things.\nIt also states: \"Harmonize its light, blend with its dust, profound and seemingly abiding.\"\nThat which abides is the Dao.\nOriginally pure and still, it constantly responds without fail,\nadapting to all directions and remaining still without exception.\n\nThus it is said: \"constant purity and stillness.\"\nThese six sentences mark the nature of prior purity and stillness.\nAs the nature of the Dao is pure and still, one attains true nature;\nhaving attained true nature, one returns to the principle of non-attainment.\nThrough such purity and stillness, one gradually enters the true Dao.\nThis pure and still nature is called the true Dao.\nThe scripture does not speak of it, yet urges people to cultivate through nature,\ngradually advancing to become true.\nThat which is true is able to endure and persist, neither increasing nor decreasing,\ncoexisting with heaven and earth in longevity—thus it is the true Dao.\nHaving entered the true Dao is called attaining the Dao.\nHaving entered the true Dao is called awakening to the cultivation of truth.\nRefining the mundane into truth, refining truth into spirit,\nthat which is spirit and truth is the Dao.\nThus it coexists with heaven and earth in longevity, matches the sun and moon in brightness,\nand transforms the ten thousand things—hence it is called attaining the Dao.\nThough called attaining the Dao, in reality there is nothing attained.\nThe Dao is without attainment or loss, and also without constant form.\nThis scripture states: \"The Dao is originally formless, beyond all naming.\"\nThus it is said: though called attaining the Dao, in reality there is nothing attained.\nThe great Dao abides constantly, without departure or dwelling.\n\nIt further states: \"The highest virtue does not act as virtue, thus it possesses virtue.\"\nEarlier, the principle of true nature’s Dao returning to non-attainment was clarified.\nHere, the great sage establishes teachings with the nameless name,\nforcibly naming it the Dao to instruct humans and devas,\nresponding to all beings. Though without fixed form, the awakened will surely attain it.\nFor the transformation of sentient beings, it is called attaining the Dao.\nTransformation means returning to preserve truth—this is transformation.\nTransformation signifies the meaning of change, altering appearances in response to conditions.\nTransformations vary in kind, manifesting in forms and demeanors,\nunfathomable in their presence or absence, guiding and transforming the people of the time.\nTo guide and transform is to point to matters as metaphors,\nconstantly exhorting and awakening—this is the name of teaching the Dao.\nIt universally urges later learners to abandon evil and follow goodness,\ncherish the body and preserve life.\nThus it is essential to return to the sagely teachings.\nFor example, when the Most High transformed the eighty-one kingdoms west of the Flowing Sands,\nhe manifested in dharmic forms and appearances:\nsometimes appearing as a giant, a thousand *zhang* tall,\nsometimes as a small person, eighteen *chi* in height,\nchanging appearances without limit, altering forms and names.\nSometimes as a golden immortal, sometimes as a solar or brahmanic immortal,\nhe adapted his transformations to each region, sharing the same essence under different names.\nTeaching people to cultivate the Dao, abandon delusion and become true,\nhe established the teaching of purity and stillness—all for transformation.\nManifesting his birth in the Grand Clarity, to the right of the Vortex Waters,\nto the left of the True Source, where the Nine Wells endure and the Twin Cypresses remain,\nhe revealed the marks of the Dao to transform humans and devas.\n\nThe *Scripture of the Sage’s Chronicle* states:\nFrom the primordial chaos of remote antiquity, whether undivided or just divided,\nthe Old Lord opened heaven and earth, arranged the sun, moon, and stars,\ndistributed the Five Phases, and transformed the ten thousand things, ceaselessly through the ages.\nAs the teacher of heavenly kings, he was unknown to the people of his time,\nyet his transformations were not limited to the western lands.\nThe Dao is originally spontaneous, pervading all without exception;\nin the ten directions and all heavens, none do not propagate the supreme Dao.\nThroughout the cosmos, all is transformation.\nEven the dullest creatures possessing life bear the nature of the Dao.\nThose who can understand and comprehend it are called attainers of the Dao.\nThose who awaken to it may transmit the sagely Dao.\nAwakening is enlightenment, like penetration.\nPenetration is attainment.\nFor all students of immortality, if they awaken to the true principle,\nthey will not regard the West or the East as distinct,\nnor differentiate within the six directions, between heaven above and earth below—\nthe transformation of the Dao is one.\nIf one awakens and comprehends it, one does not exalt the supreme Dao,\nnor regard the teachings of images as different, nor separate the Confucian school.\nThe three teachings of the sages differ in expression, yet their principle is one.\nThis scripture states: \"Emerging together yet bearing different names.\"\nIt further states: \"The Dao gives birth to the One, the One gives birth to the Two,\nthe Two gives birth to the Three, and the Three gives birth to the ten thousand things.\"\nAwakening to one’s fundamental nature is not attained through differentiation.\nOnly by embodying emptiness and nothingness can one constantly attain the supreme Dao returning to the self.\nCultivating purity and stillness within, one follows heaven and aligns with correctness;\nharmonizing with human affairs externally, one can relieve suffering and dispel misfortune.\nThrough such cultivation, purity and stillness arise naturally.\n\nTransmission is the name for bestowal and empowerment.\nWhen one is pure and still, the supreme Dao comes of itself,\nattained without seeking, accomplished without learning.\nThis scripture states: \"The Way of Heaven is impartial, yet it constantly aligns with the good.\"\nPurity and stillness arise naturally, and the sagely Dao returns to the self.\nThus it is said: one may transmit the sagely Dao.\n\nIn this passage, the earlier emphasis on non-contention and non-virtue\nis followed by the observation that later learners, clinging to partial views,\nare deluded by false emotions, losing the Dao and straying from the source.\nThe Old Lord thoroughly clarifies this earlier meaning:\nas there are distinctions between high and low, he breaks through clinging to nature.\nThe Old Lord says: \"The superior person does not contend; the inferior person loves contention.\"\nContention is the pursuit of stillness.\nThe superior person seeks tranquility amid contention, calming the fundamental nature to attain stillness.\nContention is clinging to existence.\nThe superior person does not cling to views of existence, nor is it about noisy strife.\nBecause the inferior person seeks to comprehend the fundamental nature,\nthey love contention in pursuit of stillness, clinging to views in their search.\nThis is called embodying the Dao and uniting with truth—\nnot attaching to the illnesses of the ears, eyes, nose, mouth, body, or mind,\nnor to the flavors of saltiness, bitterness, spiciness, sweetness,\nnor to the sounds of *gong*, *shang*, *jue*, *zhi*, or *yu*.\nAll such clinging to views is not the fundamental nature.\nThis is the principle of the inferior person’s love of contention.\nWith no mind in any view, how can there be contention?\nIf one has no contention, one is pure and still.\n\nThe highest virtue does not act as virtue; the lower virtue clings to virtue.\nVirtue is nobility, possessing a name.\nThe highest virtue refers to the lords of remote antiquity who originally had no titles,\nnor any designations—thus it is said they did not act as virtue.\nThis scripture states: \"The highest virtue is non-action, which is what the Dao and virtue designate.\"\n\nIt further states: \"What exists seems not to exist; what is real seems empty.\" If one clings to views of existence or to names in the Way, this is not the highest virtue. Fundamentally, there is neither being nor non-being, neither emptiness nor fullness. In application, it is present; when obscured, it is absent. Thus it is said: \"The knowing do not speak; the speaking do not know.\" Those who know yet do not speak conceal it. Moreover, to know as if not knowing is superior; to know without knowing is a flaw—hence it is said the knowing cannot be spoken of. Therefore, the highest virtue does not act as virtue, while the lower virtue clings to virtue. Those of lower virtue who cling to virtue possess names, traces, and meritorious deeds, thereby establishing reputations and self-display. All views that arise give birth to discrimination.\n\nThe scripture also states: \"When you meet it, you do not see its head; when you follow it, you do not see its rear.\" How can there be discrimination? Once discrimination arises, one clings to virtue. If one can eliminate the mind of duality, this is called the natural Way. Duality refers to the dharmas of action and non-action. Some establish non-action as right and refute action as wrong; others cling to action as right and refute non-action as wrong. This is the mind of duality. The supreme Way is natural—neither action nor non-action. Thus, the supreme Way is naturally profound, still, and pure, blended yet unstained, harmonious yet distinct, neither being nor non-being.\n\nThose who study immortality must not cling to negation. If all clinging views are absent, one naturally attains the true Way, transcends the Three Vehicles, and returns to the One Vehicle. The Way does not descend to the inferior, so those who cling to virtue cannot be called the Way. Those who cling cannot be called the Dao and virtue. As previously stated, clinging to virtue is the lower virtue. Thus, clinging to forms and engaging in action is not called Dao and virtue. Dao and virtue are boundless in transformation, free in existence and cessation, manifest in application, able to honor and ennoble—all naturally so, not for those who cling to views. How could those who cling to views know it?\n\nThis passage clarifies why sentient beings fail to attain the true Way and perpetual purity. The reason sentient beings do not attain the true Way is the presence of deluded mind. Delusion is movement. When emotions float and intentions stir, the mind generates delusion. Movement is thinking, and delusion is the root of chaos. All sentient beings fail to attain the true Way because they are stained by emotions, moved by intentions, and deluded by thoughts. Thoughts give rise to feelings, and feelings stir emotions, deluding the mind. If the deluded mind does not arise, one is naturally pure and still.\n\nIt is also said: \"Deluded movement is loss.\" All lose their inherent nature of the Way, following circumstances to stir emotions and delude the mind, thus failing to attain the true Way. Once the deluded mind arises, it startles the spirit. Startling is the extreme fear of the heart, called *jing*. This is not merely the heart’s alarm. There are two explanations for startling: first, in inner cultivation of purity, one forgets the form and startles the spirit; second, in external engagement with affairs, one wearies the mind and startles the body. Externally startling the body internally seduces and startles the spirit. If the heart and spirit are at peace, external desires do not arise. Once desires do not arise, one is naturally pure and still.\n\nWhen the spirit is startled, one clings to the myriad things. If a person startles the spirit, externally they cling to circumstances, and internally they lose their true nature. The myriad things are a name for multiplicity. The Way values guarding the One; one must not cling to the myriad things and startle the spirit. Humans are born into the world, endowed within the four great elements of earth, water, fire, and wind, harmonized by qi, nurtured by the Three Powers—this is indeed difficult to surpass. If one can remain unshaken, inwardly guarding primordial harmony, thoughts will not be confused, and one will be naturally pure and still.\n\nOnce clinging to the myriad things, desire and seeking arise. Desire is the appearance of attachment. Though called attachment, it has two distinctions: first, desire for worldly affairs, seeking external adornments to delight the emotions—this is a yin fault, not in accord with yang teachings. Belonging to yin, it cannot be pure and still, becoming turbid and stagnant. Second, desire for progress in cultivation, exhaustively seeking true teachings and resolutely pursuing the supreme Way—this is inner desire. Though called desire, its principle accords with yang teachings, being light and pure, while yin is turbid and deviant. If one can embody the Way and unite with the real, one is naturally light and still.\n\nOnce desire and seeking arise, affliction follows. Yet desire for external affairs can gradually be severed; desire for inner cultivation should be encouraged with diligent progress. Even in seeking the supreme Way, one must not cling firmly, for this too generates affliction. Affliction has two kinds, distinguished by weight: minor affliction and major affliction. Minor affliction arises from desiring the supreme Way and clinging to it; major affliction arises from seeking worldly dharmas. Minor affliction accords with yang and is called purity; major affliction accords with yin and is called turbidity. Though distinguished by weight, one must not cling to either. Clinging is attachment. Once there is attachment, delusion arises.\n\nBy relinquishing the heavy and embracing the light, inwardly guarding primordial harmony, profoundly unmoving, this is called \"cherishing the Way and embracing virtue,\" naturally simple and unadorned. The Way of longevity lies entirely in nurturing the spirit. If one guards primordial harmony without loss, the spirit abides within. When the spirit abides, the heart is greatly at peace, joyful and content, naturally pure and still—how could affliction arise? Affliction and delusion distress body and mind, leading to turbidity and disgrace, drifting through birth and death, forever sinking in the sea of suffering, eternally losing the true Way. When body and mind are attached to external circumstances, sorrow and suffering arise within.\n\nThe turbid is defilement; disgrace is pollution. When body and mind are defiled and polluted, one inevitably drifts and wanders—this is the cycle of rebirth. Trapped in the wheel of rebirth, one cannot escape the sea of suffering. The sea of suffering is the ocean of sorrow and affliction. \"Sea\" signifies vastness, for the sorrows and afflictions of life cannot be avoided. This is not because the supreme Way lacks compassion, but because the human heart creates its own suffering.\n\nThose who study the Way must inwardly guard their unity while outwardly eliminating delusions. \"Unity\" refers to the body. The sages all speak of preserving the Three and guarding the One. The Three are essence, qi, and spirit. To guard the body is necessarily to preserve the Three. Thus, the *Scripture of Western Ascension* states: \"Guard the body without loss, and it will abide constantly.\" By focusing solely on this unity and refraining from delusive thoughts, one avoids sinking into the sea of suffering. Sorrow and affliction will no longer cling to body and mind, and one naturally attains liberation, merging with purity and stillness.\n\nThus, the sages bequeathed their scriptures to rectify meaning, erecting the great bridge of the Dharma to close the paths of error. They taught and transformed those yet to awaken, guiding them into the wondrous gate. This makes clear that all people lose their true origin themselves—it is not that the supreme Way lacks compassion. The eternal and constant Way is attained by those who awaken. Those who awaken to the Way abide in constant purity and stillness. The true Way is ever-present, neither ancient nor modern, neither born nor destroyed. Externally, it encompasses heaven and earth; internally, it enters the finest hair. It is the law that governs all things and is ever employed in the world. Those who comprehend and awaken attain it for themselves, not for the sake of transforming others.\n\nWhat the Most High speaks of is human awakening. To awaken is to return to one’s original nature—this is called attaining the Way. It is neither that the supreme Way is difficult to seek nor that it is easily obtained. This scripture states: \"The Way of Heaven is impartial, yet it constantly bestows upon the good.\" It also says: \"The Way is originally formless; nothing can name it.\" Those who attain awakening know it for themselves. The good constantly guard purity and stillness, and thus all are those who have attained the true Way.\n\nThis chapter is recorded in its entirety as one section. First, it clarifies that the Immortal Elder recited and upheld this method. Next, it recounts its transmission to the Lord of the Eastern Florescence. The celestial palaces and grotto-heavens all hold it in secret seclusion, for it is not to be lightly shared. The Immortal Ge Xuan said: \"I attained the true Way after reciting this scripture ten thousand times.\" The Immortal’s surname was Ge, his given name Xuan, and his courtesy name Xiaoxian. When he first studied the Way, he constantly recited this scripture. Later, he attained the Way of immortality and now holds the rank of Left Immortal Elder.\n\nThe Immortal Elder had a grandson named Hong, courtesy name Zhichuan, whom the people of this world know as Baopuzi. Their ancestral line sought immortality, and all became perfected beings. When the Immortal Elder first entered the Way, he resided on Mount Changbai or on the Eastern Peak. Later, he traveled through all the famous mountains, diligently seeking the Way. After attaining the Way, he concealed his traces and transformed his form, leaving this scripture in the world to exhort and awaken later learners.\n\nTo speak of reciting the scripture ten thousand times means that ten thousand practices are perfected and complete. The *Scripture of Numinous Treasure* states that \"the ten thousand models unfold,\" clarifying that the celestial Brahma-qi pervades all without exception. \"Model\" means method. All ten thousand methods are the same, responding both internally and externally. When dispersed, they become the forms of the ten thousand phenomena; when gathered, they form the bodies of the ten thousand spirits—this is the meaning of perfection.\n\nIt also says that when the ten thousand recitations are complete, the Way is perfected, and one ascends to the great void, the ten thousand spirits fulfilled. When the ten thousand recitations are complete, the Way of purity and stillness is achieved. It is not merely about reciting the scripture’s words—why should one exhaust the body and weary the spirit? This scripture is practiced by the Heavenly People and not transmitted to the unworthy. The Heavenly People are the immortals of utmost yang. The Heavenly Immortals soar through the azure vault, roaming freely, their armpits bearing feathers—they are also called Feathered Guests. All Heavenly Immortals and Feathered Guests dwell above the Three Clarities, constantly practicing the scriptures and methods, which are not lightly transmitted to the unworthy.\n\nIf worldly people cultivate the practices of the Heavenly People, they are called Heavenly Beings. For those who wish to study and learn, why not recite and practice this scripture daily, advancing in cultivation? Without a mind of laziness or retreat, one becomes a person of progress without regression. It is also not to be lightly transmitted to the unworthy. The sages also said: \"When the scriptures and methods circulate in the world, if learners encounter them, they must treasure and honor them, not lightly disclose them. If one meets a worthy person with a sincere heart, then transmit; if one meets a good person, then pass it on.\" This is for the sake of widespread salvation, so that those who awaken may comprehend. Whether to transmit or teach depends on the person.\n\nI formerly received it from the Lord of the Eastern Florescence. \"I\" is the Immortal Elder’s self-reference. According to the *Scripture of Supreme Purity*, in the east there is the Azure Cloud Realm, the Jasper Radiance Kingdom, and within the Emerald Feather City stands the Azure Dragon Palace. Its halls and towers are all constructed from dragon and phoenix treasures and precious pearls. Above, five-colored azure clouds cover it, hence it is called the Azure Dragon Palace. It is the dwelling place of the Lord of the Eastern Florescence, the Youthful Sovereign. This clarifies that the Immortal Elder himself said that he encountered that Lord and received this scripture from him—it is not lightly transmitted to the unworthy.\n\nThe Lord of the Eastern Florescence received it from the Lord of the Golden Portal. The Golden Portal refers to the west, where there is the Coral Realm, the Jasper Radiance Kingdom, and within the Lapis Lazuli Palace. Its halls and towers are all constructed from coral, precious jades, and lapis lazuli, hence it is called the Lapis Lazuli Palace. There is a Lord within this palace who also treasures and secretes this scripture. He is also called the Lord of the Golden Portal. Depending on his name and title, or the Most High’s manifestations and transformations, the names and titles may differ.\n\nThe *Scripture of Supreme Purity* states: \"The Later Sage, the Lord of the Golden Portal, the Mysterious Origin, the Yellow Emperor, the Venerable Lord\"—this is the Most High. The *Master Yin’s Record of the Mysterious* says: \"The Most High Lord Lao constantly resides in the Purple Tenuity Palace. Sometimes he is called the Heavenly Sovereign Great Emperor, sometimes the Supreme One, the Heavenly Worthy Who Saves from Suffering, or the Sacred Lord of the Golden Portal.\"\n\nThus we know the Most High manifests transformations according to place, and his appellations are boundless. It is known that the Lord Emperor of the Golden Portal, ruler of the Lapis Lazuli Realm in the West, is none other than the Former Sage. All the exalted lord emperors have treasured and secreted this scripture—how much more should later students, in receiving and transmitting it, in cultivating, upholding, and reciting it, revere and esteem it, practicing it with utmost gravity?\n\nThe Lord of the Golden Portal received it from the Queen Mother of the West. The Queen Mother is the mother of all heavenly deities, divine kings, and lord emperors, and she resides on Kunlun. According to the *Treatise on Heaven and Earth*, \"The Queen Mother dwells on the western side of Kunlun, where the Yellow River issues forth.\" She is the mother of heaven and earth. It is also said that the Heavenly Father and Earthly Mother govern all perfected beings, presiding over the Three Realms—above in heaven and below on earth—making the Queen Mother the Most Honored Mother. When the Lord of the Golden Portal received this scripture from the Queen Mother, it was not lightly transmitted to those of lesser attainment. The Queen Mother passed it down orally, without committing it to writing.\n\nNow, in this world, I have recorded it in written form. The oral transmission of ancient sages, in passing down scriptures and methods, always relied on the inner treasury of the heart and mind to secretly receive the scriptural texts. In circulating and propagating them to teach and guide humans and devas, they did not commit them to writing—unlike what is seen in the present age. Since the time of the immortal elders, this scripture has been written down and transmitted to later generations, widely disseminated to universally deliver and elevate later students.\n\nFirst, the transmission by former sages is clarified; next, the hierarchy of later students is explained. If one can awaken to and comprehend the true Dao, one will attain fruition according to one’s merit.\n\nThe superior practitioner, upon awakening, ascends to become a celestial official. The superior practitioner externally refines the bodily form and internally nurtures the spirit. Externally, they harmonize their radiance and merge with the dust; internally, they cultivate merit and preserve their primordial essence. This *primordial essence* is the primordial qi. Primordial qi is the mother of spirit. If one can constantly abide in primordial qi, safeguarding it below in the Cinnabar Field, securing it above in the Mud Pill Palace, and guarding it at the center in the Crimson Palace, cherishing and preserving the Three Origins—this is called internally nurturing the spirit. Spirit is the child of qi; form is the dwelling of spirit. Spirit is the master of the body; without a master, the body is not at peace. Without spirit, form cannot stand.\n\nThe advanced practitioner constantly absorbs the essence of the sun, preserving it in the lower Cinnabar Field, and drinks the radiance of the moon, preserving it in the Brain Palace. The Brain Palace is the upper Cinnabar Field of the Mud Pill, belonging to yang, and thus the essence and qi of the Great Yin are preserved there. The lower Cinnabar Field, the Qi Sea of the Kidney Palace, belongs to yin, and thus the essence and qi of the Great Yang are preserved there. As the *Book of Changes* states: \"The interplay of one yin and one yang is called the Dao.\" If one can await the dual luminaries of the sun and moon to support the bodily form in practice, one will ascend to become a celestial official.\n\nThe *five clouds and five qi* are the true qi of the Five Phases. For those who tread the Dao above, once the five viscera are perfected, the qi of the five viscera naturally arises. The true qi of the Five Phases transforms into five clouds, supporting the bodily form as it ascends through the Three Realms. The Three Realms are the Realm of Desire, the Realm of Form, and the Formless Realm. It descends to roam the Ten Directions. The Ten Directions are the four cardinal directions, four intermediate directions, above, and below. Once free from all obstructions in the Three Realms and Ten Directions, one ascends into the Supreme Purity and attains the title of celestial official.\n\nThe middling practitioner, upon awakening, is ranked among the immortals of the Southern Palace. Gold corresponds to the lungs; jade corresponds to the bones. Those who study the Dao must first refine their bones, calling them *precious jade*, and refine their lungs to preserve fluids, calling them *qi gold*. Stone corresponds to the kidneys; cinnabar corresponds to the heart. Calming the heart and regulating the breath to preserve the kidney viscera enables longevity—this is not the gold, stone, jewels, or jade of the mundane world. This *gold and stone* can preserve one’s life.\n\nAs the *Nanzi Tu* states: \"How can external treasures compare to the preservation of internal treasures?\" This is the meaning. If one can internally preserve one’s nature and life, one may ascend to partake in the sacred texts of Supreme Purity. The *sacred texts* are all the secret treasures of Supreme Purity. Those who attain the profound and subtle below reach the lower origin of the kidneys. The *Scripture of Supreme Purity* states: \"In the south is the Cinnabar Spirit Heaven, within which lies the Palace of Medicinal Pearls. There resides a perfected lord named the Spirit Heaven Lord.\" It is also said that the Vermilion Yang Palace, or Vermilion Mound Palace, contains within its heavens a scorching refining pool, within which are palaces of the seven treasures, also called the Purple Yang Palace. If a practitioner who has attained the profound below succeeds in their studies, the True Lord of Life and Destiny records their name and petitions the Southern Palace, where they receive the title of immortal official.\n\nThe inferior practitioner, upon attainment, enjoys long life in the world. The inferior practitioner cannot sever the root of desire and seeks only methods to sustain the body and prolong life. Some ingest numinous medicines, some consume cinnabar, some renounce fame and abandon rank, some cultivate tranquility to pacify the spirit, some rely on forests and springs, some conceal their traces in the marketplace, internally cultivating the supreme Dao while externally harmonizing with the Five Constants. Whether hidden or revealed, they embody the Dao and unite with the real. If they persist without regression, they may still preserve longevity—how much more so for lofty scholars and worthy sages who seclude themselves in mountain valleys, study the arts of divine immortality, cultivate elixirs, and ascend to heaven in broad daylight?\n\nWhy are later people unable to achieve such single-minded devotion? Even now, the mountain-dwelling recluses Ding and Chen of Mount Hua in the Western Peak enjoy longevity in the world. Their names are recorded to enter the ranks of immortals—how can later people fail to emulate them? Thus, these examples are cited to illustrate that the supreme Dao is impartial, and those who seek it will surely attain it. As this scripture states: \"The Dao of heaven is impartial; it constantly accords with the good.\" All paths ultimately converge as one. Roaming through the Three Realms, one ascends into the Golden Gate.\n\nThe *Scripture of Numinous Treasure* states: \"Among the thirty-two heavens and thirty-two emperors, the sixth is named the Heavenly Emperor of the Luminous Seven Luminaries, Shangming Qiyao Moye, which belongs to the Realm of Desire.\" Though such accounts exist, those who study the Dao need only eliminate desire to be called true persons. The Realm of Form comprises twenty-four heavens, with the Heaven of Boundless Vows as its highest, ruled by the Heavenly Emperor named Piaonu Qionglong.\n\nMoreover, the Heaven of Supreme Primordial Radiant Joy and Forbidden Ascents serves as the Heavenly Emperor of the Formless Realm, named Longluo Juechang.\n\nThese Three Realms refer to heaven and earth, constituting the external framework in broad terms. Yet when likened to the human body, the Three Realms correspond to the three cinnabar fields: the lower cinnabar field as the Realm of Desire, the middle cinnabar field as the Realm of Form, and the upper cinnabar field as the Formless Realm. Should one preserve the three cinnabar fields, essence, qi, and spirit abide within the bounds of the upper, middle, and lower cinnabar fields—thus does the true person roam through the Three Realms. If the spirits of the three cinnabar fields are all complete, one naturally ascends to heaven. Hence the scripture states: \"When form and spirit are both wondrous, they unite with the Dao in truth\"—this is what it means.\n\nThe *Scripture of Supreme Clarity* states: \"The Great Canopy Heaven lies above the thirty-two heavens.\" The *Scripture of Numinous Treasure* also says: \"Above the Three Realms stretches the vast Great Canopy.\" Within the bounds of the Great Canopy exist only the palaces of the Three Clarities, where all the exalted sages and lofty venerables wander above. It further states: \"There are fifty-five myriad, five thousand five hundred and fifty layers of heavens.\" These are not recorded in full here.\n\nMoreover, the Tang dynasty worthy Le Penggui stated: \"The eighty-one heavens are but half the lifespan of the Most High.\" This is spoken in broad terms. If the practitioner of the Dao first cultivates inner conduct and preserves the three primordial spirits within the Three Origins, once the three primordial spirits are all complete, one naturally ascends to heaven, roaming through the realms of the Three Clarities, entering and exiting before the Golden Gates, and paying homage to the Most High—thus becoming a true person. Hence it is said: \"Ascending into the Golden Gate.\"\n\nEarlier, the writings of the immortal masters distinguished the hierarchy of the most exalted studies. Here, what the true persons expound is the guidance of all beings, universally instructing them to recite and uphold the true scriptures, so that benevolent spirits may shield their bodies and they may gradually ascend the ranks of the immortals.\n\nThe Left Mystery True Person said: \"Left is yang. Mystery is the One. The Dao Lord is titled 'Attainer of the One,' and the true persons stand to his left and right—this is the unity of yin and yang.\" Hence the name Left Mystery True Person. The Left Mystery True Person is titled \"Dharma Interpreter.\" Out of great compassion, this true person responds to the many inquiries of the benevolent, descending into the Five Turbidities to rescue and deliver all beings. Upon returning to the Three Realms, he attends the Most High with reverence, and the Most High protects him, proclaiming his name.\n\nFor those who study immortality, simply preserving the One and guarding the yin and yang qi makes one a true person. What is meant by \"guarding the One\"? The One is the fundamental nature of the Dao. The One is the Great. It is also said to be the body. Thus, the *Scripture of Western Ascension* states: \"Loving others is not as good as loving the body; loving the body is not as good as loving the spirit; loving the spirit is not as good as relinquishing the spirit; relinquishing the spirit is not as good as guarding the body. Guarding the body ensures longevity and eternal existence.\"\n\nIf learners have not yet grasped the subtle mysteries, they should first protect their form and cherish their qi, disdaining material things and despising fame, ensuring their thoughts are free from confusion. Thus, their blood and qi will be harmonious, and this alone is the One they may preserve. The yin and yang qi are the functions of Kan and Li, and thus they constitute the body of the true person. Thereafter, paying homage to the Most High, all may become ministers of the Dao. Above, they may partake in the Three Realms; below, they may wander the ten directions, guiding and instructing all beings, teaching and transforming the unenlightened, leading and uplifting the multitude, universally enabling them to attain the Dao—this is the work of the true person.\n\nFor those who study the Dao and recite this scripture—\"reciting\" means reading from the text, while \"upholding\" means reciting from memory. If practitioners of the Dao maintain a righteous heart, their devotion to the Dao unwavering, and cultivate in accordance with the method as if facing the Most High, whether walking, standing, sitting, or lying down, always holding fast to singular focus—this is what is meant by \"reciting and upholding.\" They will then be protected by the ten heavenly benevolent spirits.\n\nThis explains that if scholars constantly contemplate the Dao and recite the true scriptures, they will be shielded by benevolent spirits. The \"ten heavens\" refer to the eight directions, above and below. The *Sutra of Causes and Conditions* states: \"Each month, on the ten straight days of purification, benevolent spirits preside over each day—these are also benevolent spirits.\"\n\nMoreover, humans possess the three karmas of body, speech, and mind, as well as the six roots of the sensory faculties—thus the ten evils arise. The ten evils are: lust, killing, stealing, jealousy, deceit, anger, harsh speech, divisive speech, false speech, and frivolous speech. The ten virtues are: the body does not act recklessly, the heart does not stir recklessly, the mind does not think recklessly, the nature is not recklessly disturbed, the ears do not recklessly listen to improper sounds, the mouth does not recklessly utter frivolous speech, the eyes do not recklessly gaze upon improper sights, the nose does not recklessly inhale foul odors, the tongue does not recklessly taste improper flavors, and the consciousness does not recklessly entertain fear—these are called the twelve virtues.\n\nWhen the ten virtues arise, the ten evils naturally vanish, and one is protected by the true sages. When the ten practices are complete, one naturally attains purity. With purity, there is no affliction. Without affliction, one accomplishes the true Dao. Then, the jade talismans and treasure spirits refine the form with golden liquid, and when form and spirit are both wondrous, they unite with the Dao in truth.\n\nThe \"jade talisman\" refers to the talisman of the Jade Emperor. When a practitioner of the Dao perfects their merit and fulfills their conduct, ascending the ranks of immortality, they first receive the Jade Emperor’s talismanic decree before ascending as an immortal. Regarding the jade talisman in relation to the body, it clarifies the affairs of the Middle Origin. The Middle Origin is the heart. If the practitioner’s heart can remain tranquil, it will naturally be unstained by worldly defilements, preserving purity and securing the form and spirit.\n\nIf those of the highest rank awaken to the Dao of refining golden liquid, they may solidify their physical form. Those of middling attainment, not yet awakened, seek elixirs outside the body, compounding and refining them to preserve their nature and life. As for the Dao of exiting and entering, one must first secure the physical form, then nurture the spirit and consciousness. When the form is secure, even if the body grows emaciated and strength wanes, the spirit remains its master. When the master is at peace, the exterior is secure. For example, a house in the world without occupants cannot remain intact—such is the principle of inner and outer affairs.\n\nThus, the *Scripture of Western Ascension* states: \"My body is the chariot of the spirit, the abode of the spirit, the master of the spirit. When the master is tranquil, the spirit dwells within; when restless, the spirit departs.\" It further says: \"The spirit gives birth to the form, and the form completes the spirit. Without the spirit, the form cannot live; without the form, the spirit cannot be perfected. When form and spirit unite, they mutually generate and mutually complete one another.\" This is the principle of inner and outer correspondence.\n\nIt also states: \"The spirit constantly loves humanity, but humanity does not love the spirit.\" The spirit constantly loves humanity because it wishes for their life. Humanity does not love the spirit because the heart is disturbed. The heart is also spirit, and this spirit is called the \"Numinous Youth.\" It can be evil or good, dull or bright, joyful or angry, upright or crooked. It drives the mind like a horse in the wind and the heart like an arrow in flight, crafting a thousand schemes and devising ten thousand strategies—all within this spirit.\n\nThe *Scripture of Inner Contemplation* also states: \"The heart is the spirit. It is neither blue nor white, neither red nor yellow, neither large nor small, neither short nor long, neither curved nor straight, neither soft nor hard, neither thick nor thin, neither round nor square. Its transformations are unfathomable, blending yin and yang.\"\n\nThe vast encompasses heaven and earth, the minute enters the tip of a hair. Restrain it and it halts; release it and it rages. In clarity and stillness it lives, in turbidity and agitation it perishes. If one can attain clarity and stillness, cultivate the supreme Dao within, and subdue the heart, the heart becomes tranquil, and the spirit is born. When the spirit is born, the form is stabilized; when the form is stabilized, the spirit is perfected. The spirit relies on the form to be perfected, and the form relies on the spirit to be born. Form and spirit depend on each other—through tranquil cultivation and practice, the form is stabilized and the spirit is preserved. Thus it is said: when form and spirit are both wondrous, inner and outer correspond, and one naturally unites with the Dao in truth.\n\nThe preceding elucidates the power of recitation and upholding, refining and attaining perfection. This clarifies the preciousness of the true scripture’s virtue and power—when worldly people comprehend its profound subtleties, they transcend the Three Realms in body.\n\nThe Perfected of Orthodox Unity states: \"Orthodox\" means true; \"Unity\" means great, and also refers to the heart. The heart is the symbol of the southern great yang, yet its origin lies in the northern direction. Why does the great yang reside in the north? Because within Kan and Li there is a single line, thus it is called the one yang—this is the heart. One is the yang position within yin, and two is the yin position within yang. This is the principle of the Five Phases’ reversal and the function of yin-yang transformation—this is called Orthodox Unity.\n\nThe Perfected of Orthodox Unity is the Celestial Master of the Han, surnamed Zhang, named Daoling. Today, he serves as the Great Dharma Master of the Three Heavens, holding the position of the Perfected of Orthodox Unity, and also as the Master of Salvation of the Three Clarities. This Perfected now resides in the rank of sagely perfected ones. He once refined the Five Phases, cultivated merit for the state, supported the declining, rescued the suffering, eliminated harm, fostered life, and benefited the common people. With merits complete and conduct fulfilled, he transcended the near and attained sagehood, occupying the exalted position of the Perfected of Orthodox Unity.\n\nIf one can refine the heart, naturally the palaces of the body will be unobstructed, the spirit harmonized, and qi unimpeded—all through the practice of Orthodox Unity. Today, there exist the Celestial Master’s methods of Orthodox Unity for slaying demons, the Three-Five Flying Steps, bronze talismans and iron charters, the precious scriptures of the Golden Elixir, secret formulas and numinous chapters, and the twenty-four ranks of registers—these are not enumerated one by one here.\n\nWhen a household possesses this scripture, those who comprehend it will be untouched by calamities and obstructions, and all sages will guard the gate. The \"household\" is the body; the \"scripture\" is the heart. External learning is likened to the household residence.\n\nThe Perfected says: If a household possesses this scripture and one can comprehend its profound subtleties, still the body and heart, cultivate and uphold the Dao, and recite without retreat, then all sagely spirits and divine beings will protect the gate. With divine beings guarding the gate, calamities and obstructions will not afflict the household, and evil demons will not invade the dwelling—all because the master is clear and still, thus the divine luminaries guard the gate.\n\nThis inner analogy likens the household to the body, and the heart to the scripture. If one can attain clarity and stillness, practicing the supreme Dao within the heart, this is called possessing this scripture. \"Comprehension\" means awakening; \"attainment\" means understanding; \"penetration\" means realization. Awakening and realization mean the heart possesses the scripture. Without the scripture, one has not awakened or understood, hence calamities and obstructions arise from afflictions. If the heart is enlightened and attains understanding, there are no afflictions. With afflictions gone, clarity and stillness naturally prevail, calamities and obstructions do not arise, and thus they do not intrude.\n\nWhen all sages guard the gate, within the human body there are thirty-six thousand spirits: three hun on the left, seven po on the right. The body has twelve thousand forms and shadows, the frame possesses twenty-four thousand essences of radiance, and the five viscera and six bowels have twenty-four spirits—even the ears, eyes, mouth, and nose each have their own. Each resides in its own palace. If one is clear and still, all spirits return to the body and each dwells in its palace—thus it is said that all sages guard the gate. Moreover, the thirty-six thousand spirits each reside in jade palaces, confirming that the words of Master Yanluo are not empty.\n\nWhen the spirit ascends to the upper realms, it pays homage to the exalted ones. The spirit is the heart. The Daoist canon states: \"Intelligent, bright, upright, and direct is called spirit; unfathomable in yin and yang is called sage.\" Thus, when the heart is numinous, the Dao descends; when the Dao descends, the spirit is numinous; when the spirit is numinous, it is sagely. When the spirit is sagely and luminous, it can ascend. \"Ascend\" means to ascend and reach the upper realms. The \"upper realms\" refer to the Three Clarities’ realm above the Three Realms, the Great Canopy Heaven.\n\nIf one can preserve essence, nurture qi, cherish the spirit, harmonize with primordial qi, replenish the brain, refine the spirit-water, transform and refine the spirit, and when spirit and qi are complete, one will ascend beyond the Three Realms to pay homage to the Most High and Exalted. Among those who study immortality, what is called \"paying homage to the origin\" has two aspects: one concerns heaven and earth, the other the human body.\n\nThis clarifies the three cinnabar fields. As for \"paying homage to the origin\" in the Three Realms, these are the upper, middle, and lower origins. The upper origin corresponds to Jade Clarity, transformed by the primordial qi, named the Heavenly Treasure Lord. It governs the Jade Clarity Sagely Realm of the Clear and Subtle Heaven, presiding over the twelve divisions of sagely conduct scriptures as the Master of the Cavern of Truth. Within the human body, it corresponds to the upper cinnabar field, the Palace of the Brain, also called the Palace of Muddy Pellet, ruled by the Sovereign Lord, governing qi.\n\nThe middle origin corresponds to Upper Clarity, transformed by the original qi, named the Numinous Treasure Lord. It governs the Upper Clarity Realm of the Yu-Yu Heaven, presiding over the twelve divisions of true conduct scriptures as the Master of the Cavern of Mystery. Within the human body, it corresponds to the middle cinnabar field, the Scarlet Palace of the Heart, ruled by the Sovereign Lord, governing the spirit.\n\nThe lower origin corresponds to Supreme Clarity, transformed by the mysterious qi, named the Divine Treasure Lord. It governs the Supreme Clarity Immortal Realm of the Great Red Heaven, presiding over the twelve divisions of immortal conduct scriptures as the Master of the Cavern of Spirit. Within the human body, it corresponds to the lower cinnabar field, the Sea of Qi in the Kidney Palace, ruled by the Sovereign Lord, governing life.\n\nThese three origins, three palaces, and three treasures—heaven and earth obtain them to be established and lose them to collapse; the human body obtains them to live and loses them to die. Thus, the *Scripture of the Yellow Court* states: \"The spirit and essence of the body—guard them carefully, never lose them.\"\n\nThus, one must cherish and protect them.\n\nIt is also said: \"Immortal adepts and Daoist masters are not divine by nature—they accumulate essence and amass qi to attain perfection.\" For all who study the Dao, if they can refine and employ their vital essence, visualize spirit and qi, pay homage to the Three Origins, and persist in their practice without retreat, they will naturally attain the true Dao after long cultivation. Thus, the sages declare: \"The heart commands qi and spirit; if one knows how to guide the master of qi, one becomes an immortal.\" This clarifies the method of visualization, wherein all is directed by the heart.\n\nWhen merit is complete and virtue perfected, one resonates with the Sovereign Lords. Through unwavering recitation and devotion, the body ascends upon purple clouds. This describes the fruition of Daoist practice.\n\nWhen merit reaches eight hundred and conduct fulfills three thousand—merit and conduct here refer to the achievements of cultivation—if a practitioner can master the art of embryonic breathing, performing eight hundred cycles daily, they may ascend to heaven. Through the resonance of merit and conduct, they will naturally rise.\n\nThe ancients said: \"When merit is complete and conduct fulfilled, one ascends as a minister of the Golden Towers, walking alone upon the Jade Capital as a perfected adept.\"\n\nIf a practitioner can focus on the Three Palaces, pay homage to the True Origin, the hundred joints and gates of the body will naturally open and harmonize, while the myriad spirits will be at peace.\n\nResonating with the Sovereign Lords occurs when one guards and visualizes the Three Origins, each of which is presided over by a Sovereign Lord. Unwavering recitation and devotion ensure the mind remains aligned with the true Dao—this is the practice of recitation.\n\nAscending upon purple clouds follows the proper method of inner contemplation. Humans possess five viscera corresponding to the five phases. If one cultivates the five phases, true qi permeates the five viscera, filling the abdomen. Once the true qi of the five viscera is perfected, one naturally undergoes liberation from the corpse, moving freely between existence and non-existence, transformation and spontaneity, presence and absence—this is the attainment of the Dao.\n\nPurple clouds are formed from the coalescence of the five phases' true qi, embodying the celestial decree of ascent. Thus, all who attain the Dao depart riding purple clouds, ascending to the Three Realms to pay homage to the Most High and Exalted One, signifying the noble realization of the perfected adept.\n\n*Annotation of the* Classic of Supreme Purity and Tranquility *by the Most High Lord Lao concludes here.*\n\n*(Note: The line \"静者动之基\" in the versions by Hou Shanyuan and Liu Tongwei does not align with the preceding text.)*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上老君说常清静经注(五) 经名：太上老君说常清静经注。 唐末五代道士杜光庭注。 一卷。 底本出处：《正统道藏》洞神部玉诀类。 太上老君说常清静经注(五) 左右街弘教大师传真天赐紫广成先生杜光庭注 太上老君 太者，大也。 上者，尊也。 高真莫先，众圣共尊。 故曰太上老君。 老者，寿也，明老君修天修地，自然长寿，故曰老也。 君者，尊号也，道清德极，故曰君也。 以明老君为众圣之祖，真神之宗，一切万物莫不皆因老君所制，故为宗祖也。 说常清静经 此明清静之理。 且常者，法也。 常能法则此经清静也。 清者，元也。 静者，气也。 经则法也，一则为圣人之径路，二则为神仙之梯凳。 凡学道之人皆因经戒而成真圣。 圣人未＊有不假经戒而立，不因元气而成道者也。 此一章之句分为三段，先明无形之道，次说运行之理，下明无名之法。 第一明大道无形，第二明大道无情，第三明大道无名。 第一明大道无形，能匠成天地，分判清浊。 老君曰：大道无形，生育天地。 道者，开口动舌、发言之词也。 又云：道者，虚无之炁也，混沌之宗，乾坤之祖，能有能无，包罗天地。 道本无形，莫之能名。 无形之形，是谓真形； 无象之象，是谓真象。 先天地而不为长，后天地而不为老； 无形而自彰，无象而自立，无为而自化。 故曰大道。 经云：视之不见。 故曰无形。 杳杳冥冥，其中有精； 混混沌沌，分为阴阳，故为天地也。 育者，养也。 长养阴阳，故为生育也。 阳者，清也，上腾为天。 阴者，浊也，下潜为地。 天地者乃大道之子也。 此一段明无情而运行，阴阳之用也。 日月者，是阴阳之精气也。 大道无情，运行日月。 自无而生有，造化以成形。 故天无精气，无以制日月之明； 地无精气，无以制山岳镇焉； 人无精气，无以制身形之存焉。 故曰日月禀阴阳之所运行。 故知道之无情，随机而所化。 又云：天何言哉？ 四时行焉； 地何言哉？ 万物生焉。 经云：用之不可既，无情而运行日月也。 日月者，大道之用也。 此一段明无名，而万物自生，长养万物。 大道无名，长养万物。 故元气无形，不可名也。 经云：道隐无名。 乃生於天地。 故曰：道生一，一生二，二生三，三生万物。 万物者，五行之子孙也。 三才者，万物之父母也。 道者，三才之祖宗也。 故元气清静，不可常名也。 凡学道之人且在观宗察行，若能智性无碍，可以登涉大道之径，游於三才之外，常人无所能知也。 前章明无形无名，故能运行於日月。 此两句乃是太上之自称，无名之名，强名为道也。 吾不知其名，强名曰道。 吾者，我也。 此明太上自言，吾不知其名，强名曰道。 此故亦明上德不德，是以有德之义也。 老君匠成天地，开辟乾坤，变化万物，不言我为缘。 道法自然，不能名号。 一则从有入无，或从无入有，隐显无方，存亡自在，岂有常名之称焉。 故经云：吾不知谁之子，象帝之先。 又云：吾不知其名，字之曰道。 前两句明太上之所自称，缘道无名。 此后九句明大道尊卑之体，以元炁清静，以天地男女为喻。 就此章中，分为三段：第一明道分清浊动静之喻； 第二明天地男女动静之机； 第三明万物本末之由。 夫道者，有清有浊，有动有静。",
      "translated_text": "**Commentary on the Supreme Lord Lao’s Scripture of Constant Purity and Tranquility (Fascicle Five)**\n\n**Scripture Title:** *Commentary on the Supreme Lord Lao’s Scripture of Constant Purity and Tranquility*\n**Commentator:** Du Guangting, a Daoist of the late Tang and Five Dynasties period.\n**Volume:** One.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Washen* Section, *Jade Instructions* Category.\n\n**Commentary on the Supreme Lord Lao’s Scripture of Constant Purity and Tranquility (Fascicle Five)**\n**Annotated by:** Du Guangting, Grand Master of Propagating the Dao, Transmitted Perfected Reality, Celestial-Bestowed Purple Robe, and Vast Accomplishment.\n\n**The Supreme Lord Lao**\n*\"Tai\"* (Supreme) signifies greatness. *\"Shang\"* (Above) signifies reverence. None among the lofty Perfected precede Him, and all sages hold Him in shared veneration. Thus, He is called the *Supreme Lord Lao*.\n*\"Lao\"* (Old) denotes longevity, for the Lord Lao cultivates Heaven and Earth, naturally attaining long life—hence, *Lao*.\n*\"Jun\"* (Lord) is a title of honor, for His Dao is pure and His virtue perfect—thus, *Jun*.\nThis clarifies that the Lord Lao is the Ancestor of all sages, the Origin of true spirits, and that all myriad things are fashioned by Him. Therefore, He is the Primordial Ancestor.\n\n**The Scripture of Constant Purity and Tranquility**\nThis elucidates the principle of purity and tranquility.\n*\"Chang\"* (Constant) means *dharma* (law). By constantly adhering to this law, the scripture embodies purity and tranquility.\n*\"Qing\"* (Pure) is the primordial. *\"Jing\"* (Tranquil) is *qi*.\n*\"Jing\"* (Scripture) is the *dharma* (law): first, it is the path of the sages; second, it is the ladder of the immortals. All who study the Dao attain true sageliness through scripture and precepts.\nNo sage arises without relying on scripture and precepts, nor does any achieve the Dao without the primordial *qi*.\nThis chapter’s verses are divided into three sections: first, clarifying the formless Dao; next, expounding the principle of its movement; and last, elucidating the nameless *dharma*.\n\n1. **Clarifying the Formless Dao**\n2. **Clarifying the Unfeeling Dao**\n3. **Clarifying the Nameless Dao**\n\n**First: Clarifying the Formless Dao, Which Shapes Heaven and Earth, Dividing and Judging the Pure and Turbid**\nThe Lord Lao said: *\"The Great Dao is formless, giving birth to Heaven and Earth.\"*\n*\"Dao\"* is the term uttered when the mouth opens and the tongue moves. It is also said: *\"Dao\"* is the *qi* of emptiness and nothingness, the origin of primordial chaos, the ancestor of *Qian* and *Kun*, capable of being and non-being, encompassing Heaven and Earth.\nThe Dao is fundamentally formless, defying all names.\nThe form of the formless is called the *true form*; the image of the imageless is called the *true image*.\nIt precedes Heaven and Earth yet is not ancient; it follows Heaven and Earth yet is not old.\nIt manifests without form, stands without image, and transforms without action. Thus, it is called the *Great Dao*.\nThe scripture says: *\"Look for it, and it cannot be seen.\"* Hence, it is *formless*.\nVast and obscure, within it lies essence; chaotic and undifferentiated, it divides into *yin* and *yang*, thus forming Heaven and Earth.\n*\"Yu\"* (Nurture) means to nourish. It fosters *yin* and *yang*, hence *giving birth and nurturing*.\n*Yang* is pure, ascending to become Heaven. *Yin* is turbid, sinking to become Earth. Heaven and Earth are the children of the Great Dao.\nThis section clarifies the unfeeling yet operative nature of the Dao, the function of *yin* and *yang*.\n\nThe sun and moon are the essence-*qi* of *yin* and *yang*. The Great Dao is unfeeling, yet it moves the sun and moon.\nFrom non-being, it generates being, shaping and transforming to form all things.\nWithout the essence-*qi* of Heaven, there would be nothing to govern the brightness of the sun and moon; without the essence-*qi* of Earth, there would be nothing to stabilize the mountains and peaks; without the essence-*qi* of humans, there would be nothing to sustain the body’s existence.\nThus, the sun and moon receive their movement from *yin* and *yang*.\nTherefore, the Dao’s lack of feeling follows the mechanism of transformation.\nIt is also said: *\"What does Heaven say? The four seasons proceed.\"* *\"What does Earth say? The myriad things are born.\"*\nThe scripture says: *\"Its use is inexhaustible.\"* It is unfeeling yet moves the sun and moon.\nThe sun and moon are the functions of the Great Dao.\n\n**This section clarifies the nameless Dao, which spontaneously gives life to and nurtures the myriad things.**\nThe Great Dao is nameless, nurturing the myriad things.\nThe primordial *qi* is formless and cannot be named.\nThe scripture says: *\"The Dao is hidden and nameless.\"*\nIt is born of Heaven and Earth.\nThus it is said: *\"The Dao gives birth to the One, the One gives birth to the Two, the Two gives birth to the Three, and the Three gives birth to the myriad things.\"*\nThe myriad things are the descendants of the Five Phases.\nThe Three Powers (*Heaven, Earth, Humanity*) are the parents of the myriad things.\nThe Dao is the ancestor of the Three Powers.\nThus, the primordial *qi* is pure and tranquil, and cannot be constantly named.\nThose who study the Dao must observe the origin and examine conduct. If one’s wisdom and nature are unimpeded, one may ascend the path of the Great Dao, roam beyond the Three Powers—something ordinary people cannot comprehend.\n\nThe preceding chapter clarifies the formless and nameless nature of the Dao, enabling it to move the sun and moon.\nThese two phrases are the Supreme Lord’s self-designation, a name for the nameless, forcibly called the *Dao*.\n*\"I do not know its name; forcibly, I call it Dao.\"*\n*\"Wu\"* (I) means *me*. This shows the Supreme Lord saying: *\"I do not know its name; forcibly, I call it Dao.\"*\nThis also clarifies that the highest virtue does not act as virtue, hence the meaning of *having virtue*.\nThe Lord Lao shapes Heaven and Earth, opens *Qian* and *Kun*, transforms the myriad things, yet does not say *\"I am the cause.\"*\nThe Dao follows spontaneity and cannot be named.\nAt times, it moves from being to non-being, or from non-being to being; its concealment and manifestation are boundless, its existence and cessation are free—how could it have a constant name?\nThus, the scripture says: *\"I do not know whose child it is; it seems to have existed before the Lord of Heaven.\"*\nIt also says: *\"I do not know its name; I style it the Dao.\"*\n\nThe first two phrases clarify the Supreme Lord’s self-designation, for the Dao is nameless.\nThe following nine phrases elucidate the exalted and humble nature of the Great Dao, using the primordial *qi*’s purity and tranquility and the analogy of Heaven, Earth, male, and female.\nWithin this chapter, it is divided into three sections:\n1. **Clarifying the Dao’s division into pure and turbid, movement and stillness by analogy;**\n2. **Clarifying the mechanism of movement and stillness in Heaven, Earth, male, and female;**\n3. **Clarifying the origin and end of the myriad things.**\n\n*\"The Dao has purity and turbidity, movement and stillness.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1250,
      "start_sentence": 0,
      "end_sentence": 87,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.11997199058533,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静经注（前蜀杜光庭）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "清者，天也，正阳之炁上腾为天。 浊者，地也，正阴之炁下结为地。 夫者，发语之词也。 夫道能清能浊，能动能静，以至大道无测，常名清浊动静，皆为至道之用。 几曰学道之士，若能明动静之炁，安其位，则至道自来归之。 动静合宜，故为正色也。 此四句与前三句俱明清浊、动静之理。 并后二句，共成一章，以契至道尊卑之位、本末之由。 於三段之中，第二段明男女清浊之用、动静之机。 天清地浊，天动地静。 男清女浊，男动女静。 《列子》曰：天积炁尔，地积块尔。 天地相连，终不相离。 自地以上皆是天也。 有诸天诸地，其名不一。 四面八天，上有三十二天、三十二帝，皆清炁也。 下有九地，九地之下谓之风水。 风水之下，冥冥不测。 自九地之上，上至诸天，皆出混元之图也。 《上清经》云：诸方各有五亿五万五千五百五十重天，天地之数亦然。 此乃以彰至道之尊，大无不包，细无不纳也。 男者，阳也； 女者，阴也。 夫人在於母腹之中受胎之日，皆禀天地阴阳之炁，以成其形，禀天地纯阳之炁者，以成其男。 十月之中，常在母左腋下者，男也。 禀天地纯阴之炁者，以成其女。 十月之中，常在母右腋下者，女也。 女之水性，极阴之炁，故为静也。 男之火性，极阳之炁，故为动也。 动者飞升，上应於天。 静者浊滞，下应於地。 故云天尊地卑，乾坤定矣； 男尊女卑，阴阳分矣。 故曰男动女静。 此二句明本末之由。 与前七句合为一章，义分三别。 降本流末，而生万物。 本者，元也； 元者，道也。 道本包於元炁，元炁分为二仪，二仪分为三才，三才分为五行，五行化为万物。 万物者，末也。 人能抱元守一，，归於至道，复於根元，非返於末。 末者化也； 本者，生也。 人能归於根本，是谓调复性命之道者也。 《南华真经》云：生者，神凝也； 死者，物化也。 人能归真神，归真神是谓返本还源，不可逐物也。 此一段四句明清浊之源、动静之基，人能有道，道自然皆归。 清者浊之源，动者静之基．。 人能常清静，天地悉皆归。 清者，天之炁也； 浊者，地之炁也。 皆因清浊之炁生育万物。 世人若求长生之道，炼阴为阳，炼几成圣，皆因清自浊之所生，动因静之所起。 清浊者，道之别名也。 学仙之人能坚守於至道，一切万物自然归之。 故《西升经》云：江河淮海，非欲於鱼鳌、蛟龙，鱼氅蛟龙自来归之。 人能清虚，寡欲无为，非欲於至道，至道自来归之於人。 但能守太和元炁，体道合真，万物悉皆归耳。 此四句明心神本来清静，皆因世欲之所牵也。 夫人神好清而心扰之，人心好静而欲牵之。 神者，妙而不测谓之神。 心者，神也； 神者，心也。 心扰则神动，神动则心浮，心浮则欲生，欲生则伤神，伤神则失道。 人能调伏其心，内安其神，外除其欲，则自然清静。 谓下文也。 此一段四句，明修行之功，遣欲澄心，自然清静也。 常能遣其欲而心自静，澄其心而神自清。 遣者，去除之喻也。 人能去其情欲，内守元和，自然心神安静。 心既安静，世欲岂能生焉？ 故引《西升经》之言，所谓教人修道，即修心也； 教人修心，即修道也。 故以令人绝利一源，修真养性，次保心神安乐。 故圣人云：修真养性，载神扶命，则离苦升乐，福庆延流，而成真道矣。",
      "translated_text": "The pure is Heaven, for the *qi* of true Yang ascends and forms Heaven. The turbid is Earth, for the *qi* of true Yin descends and congeals into Earth. *Fu* is an introductory particle. The Dao can be pure or turbid, active or still—so vast and unfathomable is the Great Dao that the terms \"pure,\" \"turbid,\" \"active,\" and \"still\" all serve as its functions. Thus, those who study the Dao: if they can comprehend the *qi* of activity and stillness, stabilize their position, then the Great Dao will naturally return to them. When activity and stillness are in harmony, this is called the correct state.\n\nThese four phrases, together with the preceding three, all elucidate the principles of purity and turbidity, activity and stillness. Combined with the following two phrases, they form a single chapter, revealing the exalted and humble positions of the Great Dao, as well as the origin and end of all things.\n\nWithin these three sections, the second clarifies the functions of purity and turbidity, activity and stillness in male and female. Heaven is pure, Earth is turbid; Heaven is active, Earth is still. Male is pure, female is turbid; male is active, female is still. *Liezi* says: \"Heaven is but accumulated *qi*; Earth is but accumulated masses.\" Heaven and Earth are joined, never to be separated. All above Earth is Heaven. There are many Heavens and many Earths, each with different names. On all four sides and eight directions, above lie the Thirty-Two Heavens and Thirty-Two Emperors, all composed of pure *qi*. Below lie the Nine Earths, and beneath the Nine Earths are the winds and waters. Beneath winds and waters, darkness unfathomable. From the Nine Earths upward to the various Heavens, all emerge from the *Hunyuan* Diagram. *The Upper Clarity Scripture* states: \"In every direction, there are fifty-five myriad, five thousand, five hundred and fifty layers of Heaven, and the number of Earths is the same.\" This demonstrates the supremacy of the Great Dao, vast enough to embrace all, subtle enough to contain all.\n\nMale is Yang; female is Yin. When a person is in the mother’s womb at the moment of conception, they receive the *qi* of Heaven and Earth’s Yin and Yang to form their body. Those who receive the pure Yang *qi* of Heaven and Earth become male. During the ten months, if they remain beneath the mother’s left armpit, it is a male. Those who receive the pure Yin *qi* of Heaven and Earth become female. During the ten months, if they remain beneath the mother’s right armpit, it is a female. The water-nature of the female is the *qi* of extreme Yin, thus she is still. The fire-nature of the male is the *qi* of extreme Yang, thus he is active. The active ascends and corresponds to Heaven; the still is turbid and sluggish, corresponding to Earth. Thus it is said: \"Heaven is exalted, Earth is humble; Qian and Kun are established. Male is exalted, female is humble; Yin and Yang are divided.\" Hence, \"male is active, female is still.\"\n\nThese two phrases clarify the origin and end. Together with the preceding seven phrases, they form a single chapter, divided into three parts. The origin flows into the end, giving birth to the myriad things. The origin is the primordial; the primordial is the Dao. The Dao originally encompasses primordial *qi*; primordial *qi* divides into the Two Modes; the Two Modes divide into the Three Powers; the Three Powers divide into the Five Phases; the Five Phases transform into the myriad things. The myriad things are the end. If one can embrace the primordial and guard the One, return to the Great Dao, and revert to the root, they do not return to the end. The end is transformation; the origin is generation. If one can return to the root, this is called the Dao of regulating and restoring life and nature. *The True Scripture of Southern Florescence* says: \"Life is the congealing of spirit; death is the transformation of things.\" If one can return to true spirit, returning to true spirit is called reverting to the origin and returning to the source—one must not pursue things.\n\nThis section of four phrases clarifies the source of purity and turbidity, the foundation of activity and stillness. If one possesses the Dao, the Dao naturally returns. The pure is the source of the turbid; the active is the foundation of the still. If one can always be pure and still, Heaven and Earth will all return. The pure is the *qi* of Heaven; the turbid is the *qi* of Earth. All things are born from the *qi* of purity and turbidity. If worldly people seek the Dao of longevity, refining Yin into Yang, refining to near-perfection and becoming a sage, it is all because the pure arises from the turbid, and the active arises from the still. Purity and turbidity are alternate names for the Dao. Those who study immortality, if they can firmly guard the Great Dao, all things will naturally return to them. Thus, *The Western Ascension Scripture* says: \"The Yangtze, the Yellow River, the Huai, and the seas do not desire fish, turtles, or dragons—yet fish, turtles, and dragons naturally return to them. If one can be pure and empty, desireless and non-active, though they do not seek the Great Dao, the Great Dao will naturally return to them.\" Simply guard the primordial *qi* of Great Harmony, embody the Dao and unite with the true, and all things will return.\n\nThese four phrases clarify that the heart and spirit are originally pure and still, but are disturbed by worldly desires. The spirit delights in purity, yet the heart disturbs it; the heart delights in stillness, yet desires entangle it. Spirit is wondrous and unfathomable—it is called spirit. The heart is spirit; spirit is the heart. When the heart is disturbed, the spirit moves; when the spirit moves, the heart floats; when the heart floats, desires arise; when desires arise, the spirit is harmed; when the spirit is harmed, the Dao is lost. If one can subdue the heart, inwardly stabilize the spirit, and outwardly eliminate desires, they will naturally become pure and still. This refers to the following text.\n\nThis section of four phrases clarifies the effort of cultivation: dispelling desires and settling the heart to naturally attain purity and stillness. If one can constantly dispel desires, the heart will naturally become still; if one can settle the heart, the spirit will naturally become pure. *Dispel* is a metaphor for removal. If one can eliminate emotions and desires, inwardly guard primordial harmony, the heart and spirit will naturally be at peace. When the heart is at peace, how can worldly desires arise? Thus, citing *The Western Ascension Scripture*: \"To teach people to cultivate the Dao is to cultivate the heart; to teach people to cultivate the heart is to cultivate the Dao.\" Therefore, one must cut off the single source of profit, cultivate truth and nurture nature, then preserve the heart and spirit in peace and joy. Thus, the sages say: \"Cultivate truth and nurture nature, carry the spirit and support life—then one can leave suffering and ascend to joy, blessings and fortune will flow, and the true Dao is accomplished.\"",
      "overlap_context": "humble nature of the Great Dao, using the primordial *qi*’s purity and tranquility and the analogy of Heaven, Earth, male, and female.\nWithin this chapter, it is divided into three sections:\n1. **Clarifying the Dao’s division into pure and turbid, movement and stillness by analogy;**\n2. **Clarifying the mechanism of movement and stillness in Heaven, Earth, male, and female;**\n3. **Clarifying the origin and end of the myriad things.**\n\n*\"The Dao has purity and turbidity, movement and stillness.\"*",
      "start_char": 1251,
      "end_char": 2505,
      "start_sentence": 88,
      "end_sentence": 164,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.127861499786377,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静经注（前蜀杜光庭）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "此两句为一段，明修真至神，六欲、三毒自然消灭。 自然六欲不生，三毒消灭。 六欲者，六根也。 六根者，是眼、耳、口、鼻、心、意也。 欲者，染着之貌、情爱之喻。 观境而染谓之欲，故眼见耳闻，意知心觉。 世人若能断其情，去其欲，澄其心，忘其虑而安其神，则六欲自然消灭，岂能生乎？ 内神不出，六识不动，则六根自然清静，故不生也。 三毒消灭。 三毒者，三涂之根、三业之祖也。 三者，身、心、口也。 人有身时，身有妄动之业，心有妄思之业，口有妄语之业。 此三业又为三毒。 又云，三毒者，乃三尸也，彭琚、彭瓒、彭矫。 上尸好华饰，中尸好滋味，下尸好淫欲。 人若能断得其华饰，远其滋味，绝其淫欲，去此三事，谓之日三毒消灭。 三毒既灭，则神和、炁畅、精固，三元安静，三业不生，自然清静。 三元者，上元、中元、下元也。 上为三境，生於万物，天下三元掌人性命。 且上元主泥九脑官，为上丹田； 中元主心府绛官，则为中丹田； 下元主炁海，属肾官，为下丹田。 此之三元，上主於神，中主於炁，下主於精，故乃掌人之性命也。 人若能绝其三业，保此三官，更辫四时之炁，运转精华，往来无穷，则三丹田固实，万和柔顺。 心若太虚，内外贞白，皆因三尸消灭，除假留真，乃为清静之道矣。 前明修真至神，六欲三毒自然消灭。 此明迷惑未断，而心有所染着，故未能穷於妙用。 所以不能者，为心未澄、欲未遣也。 人若能去前三业，则三尸灭，三尸灭则保其三丹田，三丹田固实则炁通畅，往来无穷，即无世欲牵心，故为清静之道。 若未能专勤志意，澄心绝虑，则心不能内修至道，难穷妙用之理，则无所制伏於心猿，即渐失精神。 精神既失，则六根妄起，世欲牵缠。 此谓自不能解於生死之罗，难出轮回之网者也。 前章明能与不能修习。 此章独明能修而不着，破执而成真。 九句正经，义分三别，合为一段。 能遣之者，内观其心，心无其心； 人能断情，绝食去欲，即无三业之罪。 不以专志，修於内行，守於绛官，自内观己心。 心者，火也。 故引《内观经》之言，心者，火也，南方太阳之精，主於火也。 上应荧惑，下应心也。 心为绛官者，神也，妙用不测，变化无定，神明依泊，三叶如莲花。 又云，制之则正，放之则狂，清静则生，浊躁则亡。 明照八表，暗迷一方。 故使学人可以观之者，心处於形内，不以形观心。 既使形观，则为二义。 形者舍也，心者主也，舍不能观主，故不可观也。 可使神观心。 神者炁之子，炁者神之母。 但心意引炁，存神而观之，自然感应。 何以知之？ 古德云：为使炁神，神之与心，炁之与道，不相远离。 故圣人设法教人，修道即修心也，修心即修道也。 心无所着，即无心可观； 既无心可观，则无所用、无所修，即凝然合道。 故心无其心，乃为清静之道矣。 外观其形，形无其形； 心者形之主，形者心之舍。 形无主则不安，心无舍则不立。 心处於内，形见於外。 内外相承，不可相离。 心形俱用，不可观执。 凝然混沌，有若无形，亦非无也。 若非无心，岂能忘於形体乎？ 心忘形体，故曰无心。 本经云：吾有大患，为吾有身。 及吾无身，吾有何患？ 心之与形，动无所染，静而无着，此谓形无其形也。",
      "translated_text": "These two lines form a single passage, elucidating that through the cultivation of truth to the point of spiritual attainment, the six desires and three poisons naturally dissipate. Naturally, the six desires do not arise, and the three poisons are extinguished.\n\nThe six desires refer to the six roots. The six roots are the eye, ear, mouth, nose, heart, and intent. *Desire* signifies the appearance of attachment and the metaphor of emotional love. Perceiving external phenomena and becoming defiled is called desire—thus, the eye sees, the ear hears, the intent knows, and the heart perceives. If one can sever emotional attachments, dispel desires, settle the heart, forget anxieties, and stabilize the spirit, the six desires will naturally vanish—how could they arise? When the inner spirit does not stray outward and the six consciousnesses remain unmoved, the six roots naturally attain purity and thus do not generate.\n\nThe three poisons are extinguished. The three poisons are the roots of the three paths and the ancestors of the three karmas. The three are the body, heart, and mouth. When one possesses a body, the body engages in deluded actions; the heart harbors deluded thoughts; and the mouth utters deluded speech. These three karmas constitute the three poisons. It is also said that the three poisons are the three corpses: Peng Ju, Peng Zan, and Peng Jiao. The upper corpse delights in adornments, the middle corpse in rich flavors, and the lower corpse in lust. If one can sever attachment to adornments, distance oneself from rich flavors, and cut off lust, abandoning these three matters, it is called the extinction of the three poisons. Once the three poisons are extinguished, the spirit harmonizes, qi flows smoothly, essence solidifies, the three origins attain tranquility, the three karmas do not arise, and purity naturally ensues.\n\nThe three origins are the upper origin, middle origin, and lower origin. The upper governs the three realms, giving rise to all things, and the three origins under heaven oversee human nature and life. The upper origin presides over the Niwan Palace in the brain, forming the upper cinnabar field; the middle origin governs the Crimson Palace in the heart, constituting the middle cinnabar field; the lower origin rules the Sea of Qi, belonging to the Kidney Palace, forming the lower cinnabar field. These three origins—upper governing spirit, middle governing qi, and lower governing essence—thus oversee human nature and life. If one can sever the three karmas, preserve these three palaces, further refine the qi of the four seasons, circulate essence and vitality endlessly, then the three cinnabar fields will solidify, all harmonies will be gentle and compliant. The heart, like the great void, will be inwardly and outwardly pure and untainted—all due to the extinction of the three corpses, the removal of the false and retention of the true, which is the Dao of purity.\n\nThe preceding elucidates that cultivating truth to the point of spiritual attainment naturally extinguishes the six desires and three poisons. Here, it clarifies that if delusions remain unsevered and the heart becomes attached, one cannot exhaust wondrous function. The reason one cannot is that the heart is unsettled and desires remain undispelled. If one can eliminate the prior three karmas, the three corpses will be extinguished; when the three corpses are extinguished, the three cinnabar fields are preserved; when the three cinnabar fields solidify, qi flows unimpeded in endless circulation—then worldly desires cannot entangle the heart, and this is the Dao of purity. If one cannot single-mindedly devote effort, settle the heart, and sever anxieties, the heart cannot inwardly cultivate the supreme Dao, nor can it exhaust the principles of wondrous function. Without mastery over the monkey-mind, spirit and essence gradually dissipate. Once spirit and essence are lost, the six roots arise in delusion, and worldly desires entangle. This is what it means to be unable to extricate oneself from the net of birth and death, to struggle to escape the web of samsara.\n\nThe previous chapter clarifies the ability or inability to cultivate. This chapter uniquely elucidates that one can cultivate without attachment, break fixations, and attain truth. Nine essential sentences divide into three distinct meanings, forming a single passage.\n\nFor those who can dispel: inwardly observe the heart, and the heart has no heart. If one can sever emotions, abstain from excessive indulgence, and dispel desires, then the sins of the three karmas vanish. Without single-minded devotion to inner cultivation and guarding the Crimson Palace, one naturally observes one’s own heart inwardly. The heart is fire. Thus, citing *The Scripture of Inward Observation*: \"The heart is fire, the essence of the great yang in the south, governing fire. It corresponds above to Mars and below to the heart.\" The heart as the Crimson Palace is spirit—its wondrous function unfathomable, its transformations without fixed form. Spirit relies upon it, its three leaves like a lotus. It is also said: when restrained, it is upright; when unrestrained, it is wild. In purity, it lives; in turbidity and agitation, it perishes. It illuminates the eight directions yet may darken in one. Therefore, those who study must observe it: the heart resides within form, yet one must not observe the heart through form. If one observes through form, it becomes a duality. Form is the dwelling; the heart is the master. The dwelling cannot observe the master, hence it must not be observed thus. One may cause the spirit to observe the heart. Spirit is the child of qi; qi is the mother of spirit. When the heart and intent guide qi and preserve spirit to observe, resonance naturally occurs. How does one know this? An ancient virtuous one said: \"To cause qi and spirit to unite, spirit and heart, qi and the Dao, do not stray far from one another.\" Thus, the sages established methods to teach people: to cultivate the Dao is to cultivate the heart; to cultivate the heart is to cultivate the Dao.\n\nWhen the heart has no attachments, there is no heart to observe. With no heart to observe, there is nothing to employ, nothing to cultivate—then one coalesces with the Dao in stillness. Thus, the heart having no heart is the Dao of purity.\n\nExternally observe form, and form has no form. The heart is the master of form; form is the dwelling of the heart. Form without a master is unstable; the heart without a dwelling cannot stand. The heart resides within, form appears without. Inner and outer mutually sustain one another and cannot be separated. Heart and form both function yet must not be observed with fixation. Coalescing in primordial chaos, seemingly formless yet not nonexistent—if not for the absence of heart, how could one forget the body? Forgetting the body is called having no heart. This scripture states: \"I have a great affliction, for I have a body. When I have no body, what affliction do I have?\" Heart and form, in motion without defilement, at rest without attachment—this is what it means for form to have no form.",
      "overlap_context": "sion Scripture*: \"To teach people to cultivate the Dao is to cultivate the heart; to teach people to cultivate the heart is to cultivate the Dao.\" Therefore, one must cut off the single source of profit, cultivate truth and nurture nature, then preserve the heart and spirit in peace and joy. Thus, the sages say: \"Cultivate truth and nurture nature, carry the spirit and support life—then one can leave suffering and ascend to joy, blessings and fortune will flow, and the true Dao is accomplished.\"",
      "start_char": 2505,
      "end_char": 3749,
      "start_sentence": 165,
      "end_sentence": 232,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.584721565246582,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静经注（前蜀杜光庭）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "远观其物，物无其物。 五行造化谓之物。 又云，块然有凝谓之形。 几有形质者，俱谓之物也。 物无其物者，谓之真，真空也。 本经云：恍兮惚兮，其中有物。 物者，道之妙用也，非世之常物。 三者既悟，唯见於空。 三者，心、形、物也。 内外中问，俱无所着，是名无为。 既入无为，是名空法。 空者，道之用也。 有用有着，不名於道矣。 前一段分三事。 此一段独明无空寂，虽名空寂之理，则俱无所着，即为真道也。 此一章六句，合为一段。 观空亦空，空无所空。 空者，真空也。 空法之相，乃有二种：有大空，有小空。 大空者，无为不为之理。 小空者，破有归无，以无为为无，是名小空。 此二空俱无，即自然不染正性，乃成真道也。 空无大小，亦无所去，有着即显，无着即隐。 空法之相，即随影而见形，若言无见即断灭。 其法长存，如水似镜，在人之身，掌人之性命。 凡居有质，皆藉道以成形。 一切物类，无不从道而生。 大道坦然，常存於物，非为断灭者也。 所空既无，无无亦无。 空者，亦非大非小，喻如道性，本无长短，亦无尘垢； 悟即谓之真空，不悟谓之假相，非为至道。 《上清经》云：空假之相，还复成假，天尊慈悲，乃立空假之相，善巧方便，随机应化，教导人天，皆归至道。 所说空相，亦非空相。 空相是道之妙用，应道用即有，不用即无。 非无非有，非名为道。 道本无形之形，真之能名； 德本无象之象，是谓真象。 杳杳冥冥，其中有精，其精甚真，非无为也。 万法俱无，是为空无。 空无之道，亦非自然。 破此空无，还归於无无也。 无无既无，湛然常寂。 无无者，无执也。 虽无执见，归於寂法。 寂法亦无，非为寂也，亦非空也，亦非无也。 非空为空，谓之真空。 非无为无，是无中之法。 法亦俱无，归於真寂。 真寂亦无，非为无法，不有不无，非空非色。 假名称见，化导众生。 种种分别，皆为执见。 执见既无，名曰自然。 清静非为空寂之法，空寂既无，则湛然常存，豁然无碍，即谓之真常之道也。 前六句明空寂之理。 此一段四句，明空寂俱无，自然无欲，即成真道也。 寂无所寂，欲岂能生？ 此明法相皆归寂灭，真道自然，长存不去，无着无欲，自然成道也。 欲既不生，即是真静。 真静者，自然无欲也。 有欲则患生，无欲则道生。 本经云：吾有大患，谓五有身。 及吾无身，吾有何患？ 无身者，无欲也，无欲谓之真身。 真身者，道身也。 前四句明无欲无寂。 此四句明真性之道，随机应物，无所不应，自然清静。 真常应物， 真者，体无增减，谓之真。 常者，法也。 常能法则，谓之真常之法也。 法则真常，应物随机，而化导众生，无所不应於物，道之物也。 常者，道之法也。 应者，道之用也。 法用无有，皆为常道，常道之中，自有真应之道。 故云真常应物，道之妙用也。 真常得性。 凡欲得成真性，须修常性。 而为道性得者，动也。 动其本性，谓其得性也。 常应常静，常清静矣。 既在道性，本求清静，自然应物，常用於世，无染无着，无垢无尘，随机而化。 本经云：上善若水。 水善利万物。 又云：和其光，同其尘，湛兮似或存。 存者，道也。 本清静常应，而无所不应，随方而无所不静。",
      "translated_text": "Observe things from afar, and things have no thingness.\nThe five phases give rise to transformation—this is called \"things.\"\nIt is also said: that which congeals into solidity is called \"form.\"\nWhatever possesses form and substance is called a \"thing.\"\nThat things have no thingness is called \"the real,\" the true emptiness.\n\nThis scripture states: \"Vague and indistinct, yet within it there is something.\"\nThat \"something\" is the marvelous functioning of the Dao—it is not the ordinary things of this world.\nOnce these three are awakened to, only emptiness is seen.\nThe three are heart, form, and things.\nWithin, without, and in between—all are without attachment: this is called non-action.\nHaving entered non-action, this is called the Dharma of emptiness.\nEmptiness is the functioning of the Dao.\nWhere there is functioning and attachment, it cannot be called the Dao.\n\nThe preceding section discusses three matters.\nThis section alone clarifies the principle of non-emptiness and non-quiescence.\nThough it bears the name of emptiness and quiescence, if all are without attachment, this is the true Dao.\nThese six lines form a single passage.\n\nTo observe emptiness as empty—emptiness has no emptiness.\nEmptiness is true emptiness.\nThe characteristics of the Dharma of emptiness manifest in two kinds:\nThere is great emptiness, and there is small emptiness.\nGreat emptiness is the principle of non-action and non-non-action.\nSmall emptiness is the breaking of being to return to non-being, taking non-being as non-being—this is called small emptiness.\nWhen both these emptinesses are absent, one naturally does not defile the true nature, and thus accomplishes the true Dao.\n\nEmptiness has no great or small, nor any departure.\nWith attachment, it becomes manifest; without attachment, it remains hidden.\nThe characteristics of the Dharma of emptiness appear like a shadow following form.\nTo say there is no seeing is annihilation.\nThis Dharma abides eternally, like water or a mirror.\nWithin the human body, it governs life and nature.\nAll that dwells in substance relies on the Dao to complete its form.\nEvery kind of thing arises from the Dao without exception.\n\nThe great Dao is level and ever-present in things—it is not annihilation.\nWhat is emptied is already without, and the without is also without.\nEmptiness is neither great nor small, like the nature of the Dao, which has no length or shortness, nor any dust or defilement.\nWhen awakened to, it is called true emptiness; when unawakened, it is called illusory appearance—it is not the supreme Dao.\n\nThe *Shangqing Scripture* states: \"The characteristics of emptiness and illusion return again to illusion.\"\nThe Heavenly Worthy, in compassion, established the characteristics of emptiness and illusion as skillful means,\nresponding to conditions and transforming in accordance with the moment,\nteaching and guiding humans and heavenly beings to return to the supreme Dao.\nThe emptiness spoken of is not emptiness itself.\nThe characteristic of emptiness is the marvelous functioning of the Dao.\nWhen the Dao functions, it is present; when it does not, it is absent.\nIt is neither absent nor present—this is not called the Dao.\n\nThe Dao is originally the formless form, the true that can be named.\nVirtue is originally the imageless image—this is called the true image.\nVast and obscure, within it there is essence.\nThat essence is most true—it is not non-action.\nWhen the ten thousand dharmas are all absent, this is called empty absence.\nThe Dao of empty absence is also not natural.\nBreaking through this empty absence, one returns to the absence of absence.\n\nWhen the absence of absence is absent, it is profoundly and eternally quiescent.\nThe absence of absence is the absence of attachment.\nThough there is no attachment to views, one returns to the Dharma of quiescence.\nThe Dharma of quiescence is also absent—it is not quiescence, nor emptiness, nor absence.\nTo take non-emptiness as emptiness is called true emptiness.\nTo take non-absence as absence is the Dharma within absence.\nThe Dharma is also entirely absent, returning to true quiescence.\nTrue quiescence is also absent—it is not the absence of Dharma.\nIt is neither being nor non-being, neither emptiness nor form.\nProvisional names and appearances are used to transform and guide sentient beings.\nAll kinds of distinctions are attachments to views.\nWhen attachments to views are absent, this is called the natural.\n\nPurity and quiescence are not the Dharma of emptiness and quiescence.\nWhen emptiness and quiescence are absent, then it is profoundly and eternally abiding, open and unobstructed—this is called the true and constant Dao.\n\nThe preceding six lines clarify the principle of emptiness and quiescence.\nThese four lines clarify that when emptiness and quiescence are both absent, the natural is without desire, and thus the true Dao is accomplished.\n\nQuiescence has no quiescence—how could desire arise?\nThis clarifies that all dharma-characteristics return to quiescent extinction.\nThe true Dao is natural, eternally abiding and unchanging.\nWithout attachment or desire, one naturally accomplishes the Dao.\n\nWhen desire does not arise, this is true stillness.\nTrue stillness is the natural absence of desire.\nWith desire, affliction arises; without desire, the Dao arises.\nThis scripture states: \"I have a great affliction, for I have a fivefold embodied self.\nWhen I have no self, what affliction do I have?\"\nNo self is no desire; no desire is called the true self.\nThe true self is the Dao-body.\n\nThe preceding four lines clarify the absence of desire and quiescence.\nThese four lines clarify the Dao of true nature, which responds to conditions and things without fail, naturally pure and still.\nThe true and constant respond to things.\n\"True\" means the essence is without increase or decrease—this is called true.\n\"Constant\" is the Dharma.\nTo constantly embody the Dharma is called the true and constant Dharma.\nWhen the Dharma is true and constant, it responds to things and conditions, transforming and guiding sentient beings without fail—this is the thingness of the Dao.\n\"Constant\" is the Dharma of the Dao.\n\"Responding\" is the functioning of the Dao.\nWhen Dharma and functioning are absent, both are the constant Dao.\nWithin the constant Dao, there is naturally the Dao of true response.\nThus it is said: the true and constant respond to things—this is the marvelous functioning of the Dao.\n\nThe true and constant attain nature.\nTo attain true nature, one must cultivate constant nature.\nThat which attains the nature of the Dao is movement.\nTo move one’s fundamental nature is to attain nature.\nConstantly responding, constantly still, one is constantly pure and still.\nBeing in the nature of the Dao, one originally seeks purity and stillness.\nNaturally responding to things, constantly functioning in the world,\nwithout defilement or attachment, without filth or dust, one transforms in accordance with conditions.\n\nThis scripture states: \"The highest good is like water.\"\nWater benefits the ten thousand things.\nIt also states: \"Harmonize its light, blend with its dust, profound and seemingly abiding.\"\nThat which abides is the Dao.\nOriginally pure and still, it constantly responds without fail,\nadapting to all directions and remaining still without exception.",
      "overlap_context": "eparated. Heart and form both function yet must not be observed with fixation. Coalescing in primordial chaos, seemingly formless yet not nonexistent—if not for the absence of heart, how could one forget the body? Forgetting the body is called having no heart. This scripture states: \"I have a great affliction, for I have a body. When I have no body, what affliction do I have?\" Heart and form, in motion without defilement, at rest without attachment—this is what it means for form to have no form.",
      "start_char": 3750,
      "end_char": 5011,
      "start_sentence": 233,
      "end_sentence": 318,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.61098837852478,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静经注（前蜀杜光庭）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "故云常清静矣。 此一段六句，标前清静之性，道性既清静，乃得真性； 既得真性，返归於无得之理也。 如此清静，渐入真道。 此言清静之性，名为真道。 经中不言，令人须假性修，渐进而成真也。 真者，能长能久，不增不减，与天地齐寿，故为真道也。 既入真道，名为得道。 既入真道，名悟修真。 炼凡成真，炼真成神，神真者，道也。 故与天地同寿，日月齐明，造化万物，故名为得道也。 虽名得道，实无所得。 道者，无得无失，亦无常形。 本经云：道本无形，莫之能名。 故云虽名得道，实无所得也。 大道常存，亦无去住。 又云：上德不德，是以有德。 前明真性之道返归无得之理。 此明大圣立教，以无名之名，强名为道，教导人天，应接群品，虽无正形，悟者必得。 为化众生，名为得道。 化者，返以守真谓之化。 化者是迁变之义，逐换应见之名。 化别种种，应见容仪，有无莫测，诱化时人。 诱化者，指事为喻，恒劝开悟教道之名。 普令后学之人拾恶从善，惜身保命。 故要归於圣教，只如太上西化流沙八十一国，亦法视相； 或见大人，身长千丈，或见小人，身长丈八，变见无方，易形改号。 或为金仙，或日梵仙，随方设化，同体异名。 教人修道，去妄成真，乃立清静之教，皆为化也。 应见降生於太清，涡水之右，真源之左，九井长存，双桧犹在，见其道相，以化人天。 又《圣纪经》云：老君自上古混沌初分，或以未分，开辟天地，安置日月星辰，分配五行，造化万物，代代不休。 为天王之师，时人莫能知之，非独为西国演化。 所言道本自然，无所不入，十方诸天，莫不皆弘至道。 普天之内，皆为造化。 蠢动含生，皆有道性。 若能明解，即名为得道者也。 能悟之者，可传圣道。 悟者，觉也，犹通也。 通者，达也。 凡学仙之士，若悟真理，则不以西竺、东土为名，分别六合之内，天上地下，道化一也。 若悟解之者，亦不以至道为尊，亦不以象教为异，亦不以儒宗为别也。 三教圣人，所说各异，其理一也。 本经云：同出而异名。 又云：道生一，一生二，二生三，三生万物。 能悟本性，非分别所得也。 但能体似虚无，常得至道归身，内修清静，则顺天从正，外合人事，可以救苦技衰。 以此修持，自然清静。 传者，付度之名也。 人能清静，至道自来，不求而得，不学而成。 本经云：天道无亲，常与善人。 清静自然，圣道归身。 所以言可传圣道也。 凡此一段，前独标无争无德。 后学众生皆执偏见，妄情所起，失道迷源。 老君又彻其前意，以上下有殊，乃破执性。 老君曰：上士无争，下士好争。 争，求静也。 所言上士好争处而求安，静本性而自静。 争者，执有也。 上士不执有见，非为喧争也。 缘下士求达本性，故好争而求静，以其执见而求之者也。 是名能体道合真者，不着於耳、目、鼻、口、身、意之病，亦不着於咸、苦、辛、甜之味，亦不着於官、商、角、征、羽之音。 此之执见皆非本性。 此者下士好争之理，诸见无心，岂有争乎？ 人若无争，为清静也。 上德不德，下德执德。 德者，贵也，有名称也。 上德者，明上古之君本无名号，亦无所称，故言不德。 本经云，上德无为者，道德所称也。",
      "translated_text": "Thus it is said: \"constant purity and stillness.\"\nThese six sentences mark the nature of prior purity and stillness.\nAs the nature of the Dao is pure and still, one attains true nature;\nhaving attained true nature, one returns to the principle of non-attainment.\nThrough such purity and stillness, one gradually enters the true Dao.\nThis pure and still nature is called the true Dao.\nThe scripture does not speak of it, yet urges people to cultivate through nature,\ngradually advancing to become true.\nThat which is true is able to endure and persist, neither increasing nor decreasing,\ncoexisting with heaven and earth in longevity—thus it is the true Dao.\nHaving entered the true Dao is called attaining the Dao.\nHaving entered the true Dao is called awakening to the cultivation of truth.\nRefining the mundane into truth, refining truth into spirit,\nthat which is spirit and truth is the Dao.\nThus it coexists with heaven and earth in longevity, matches the sun and moon in brightness,\nand transforms the ten thousand things—hence it is called attaining the Dao.\nThough called attaining the Dao, in reality there is nothing attained.\nThe Dao is without attainment or loss, and also without constant form.\nThis scripture states: \"The Dao is originally formless, beyond all naming.\"\nThus it is said: though called attaining the Dao, in reality there is nothing attained.\nThe great Dao abides constantly, without departure or dwelling.\n\nIt further states: \"The highest virtue does not act as virtue, thus it possesses virtue.\"\nEarlier, the principle of true nature’s Dao returning to non-attainment was clarified.\nHere, the great sage establishes teachings with the nameless name,\nforcibly naming it the Dao to instruct humans and devas,\nresponding to all beings. Though without fixed form, the awakened will surely attain it.\nFor the transformation of sentient beings, it is called attaining the Dao.\nTransformation means returning to preserve truth—this is transformation.\nTransformation signifies the meaning of change, altering appearances in response to conditions.\nTransformations vary in kind, manifesting in forms and demeanors,\nunfathomable in their presence or absence, guiding and transforming the people of the time.\nTo guide and transform is to point to matters as metaphors,\nconstantly exhorting and awakening—this is the name of teaching the Dao.\nIt universally urges later learners to abandon evil and follow goodness,\ncherish the body and preserve life.\nThus it is essential to return to the sagely teachings.\nFor example, when the Most High transformed the eighty-one kingdoms west of the Flowing Sands,\nhe manifested in dharmic forms and appearances:\nsometimes appearing as a giant, a thousand *zhang* tall,\nsometimes as a small person, eighteen *chi* in height,\nchanging appearances without limit, altering forms and names.\nSometimes as a golden immortal, sometimes as a solar or brahmanic immortal,\nhe adapted his transformations to each region, sharing the same essence under different names.\nTeaching people to cultivate the Dao, abandon delusion and become true,\nhe established the teaching of purity and stillness—all for transformation.\nManifesting his birth in the Grand Clarity, to the right of the Vortex Waters,\nto the left of the True Source, where the Nine Wells endure and the Twin Cypresses remain,\nhe revealed the marks of the Dao to transform humans and devas.\n\nThe *Scripture of the Sage’s Chronicle* states:\nFrom the primordial chaos of remote antiquity, whether undivided or just divided,\nthe Old Lord opened heaven and earth, arranged the sun, moon, and stars,\ndistributed the Five Phases, and transformed the ten thousand things, ceaselessly through the ages.\nAs the teacher of heavenly kings, he was unknown to the people of his time,\nyet his transformations were not limited to the western lands.\nThe Dao is originally spontaneous, pervading all without exception;\nin the ten directions and all heavens, none do not propagate the supreme Dao.\nThroughout the cosmos, all is transformation.\nEven the dullest creatures possessing life bear the nature of the Dao.\nThose who can understand and comprehend it are called attainers of the Dao.\nThose who awaken to it may transmit the sagely Dao.\nAwakening is enlightenment, like penetration.\nPenetration is attainment.\nFor all students of immortality, if they awaken to the true principle,\nthey will not regard the West or the East as distinct,\nnor differentiate within the six directions, between heaven above and earth below—\nthe transformation of the Dao is one.\nIf one awakens and comprehends it, one does not exalt the supreme Dao,\nnor regard the teachings of images as different, nor separate the Confucian school.\nThe three teachings of the sages differ in expression, yet their principle is one.\nThis scripture states: \"Emerging together yet bearing different names.\"\nIt further states: \"The Dao gives birth to the One, the One gives birth to the Two,\nthe Two gives birth to the Three, and the Three gives birth to the ten thousand things.\"\nAwakening to one’s fundamental nature is not attained through differentiation.\nOnly by embodying emptiness and nothingness can one constantly attain the supreme Dao returning to the self.\nCultivating purity and stillness within, one follows heaven and aligns with correctness;\nharmonizing with human affairs externally, one can relieve suffering and dispel misfortune.\nThrough such cultivation, purity and stillness arise naturally.\n\nTransmission is the name for bestowal and empowerment.\nWhen one is pure and still, the supreme Dao comes of itself,\nattained without seeking, accomplished without learning.\nThis scripture states: \"The Way of Heaven is impartial, yet it constantly aligns with the good.\"\nPurity and stillness arise naturally, and the sagely Dao returns to the self.\nThus it is said: one may transmit the sagely Dao.\n\nIn this passage, the earlier emphasis on non-contention and non-virtue\nis followed by the observation that later learners, clinging to partial views,\nare deluded by false emotions, losing the Dao and straying from the source.\nThe Old Lord thoroughly clarifies this earlier meaning:\nas there are distinctions between high and low, he breaks through clinging to nature.\nThe Old Lord says: \"The superior person does not contend; the inferior person loves contention.\"\nContention is the pursuit of stillness.\nThe superior person seeks tranquility amid contention, calming the fundamental nature to attain stillness.\nContention is clinging to existence.\nThe superior person does not cling to views of existence, nor is it about noisy strife.\nBecause the inferior person seeks to comprehend the fundamental nature,\nthey love contention in pursuit of stillness, clinging to views in their search.\nThis is called embodying the Dao and uniting with truth—\nnot attaching to the illnesses of the ears, eyes, nose, mouth, body, or mind,\nnor to the flavors of saltiness, bitterness, spiciness, sweetness,\nnor to the sounds of *gong*, *shang*, *jue*, *zhi*, or *yu*.\nAll such clinging to views is not the fundamental nature.\nThis is the principle of the inferior person’s love of contention.\nWith no mind in any view, how can there be contention?\nIf one has no contention, one is pure and still.\n\nThe highest virtue does not act as virtue; the lower virtue clings to virtue.\nVirtue is nobility, possessing a name.\nThe highest virtue refers to the lords of remote antiquity who originally had no titles,\nnor any designations—thus it is said they did not act as virtue.\nThis scripture states: \"The highest virtue is non-action, which is what the Dao and virtue designate.\"",
      "overlap_context": "to things, constantly functioning in the world,\nwithout defilement or attachment, without filth or dust, one transforms in accordance with conditions.\n\nThis scripture states: \"The highest good is like water.\"\nWater benefits the ten thousand things.\nIt also states: \"Harmonize its light, blend with its dust, profound and seemingly abiding.\"\nThat which abides is the Dao.\nOriginally pure and still, it constantly responds without fail,\nadapting to all directions and remaining still without exception.",
      "start_char": 5011,
      "end_char": 6253,
      "start_sentence": 319,
      "end_sentence": 387,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.92302656173706,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静经注（前蜀杜光庭）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "又云，有若无，实若虚。 道者若执有见、有名，即非上德也。 本不有不无，不虚不实，应用即有，昧用即无。 故云：知者不言，言者不知。 知而不言者，隐也。 又知可如不知，知不知上，不知知病，故云知者不可言也。 故云上德不德，下德执德也。 下德执德者，有名迹功业，以成称名自见。 凡诸有见，皆生分别。 又本经云：迎之不见其首，随之不见其后。 何以分别？ 既有分别，即为执德。 若能除两件之心，乃名为自然之道。 两件者，有为、无为之法。 或立无为为是，破有为为非； 或执有为为是，乃破无为为非。 此是两件之心。 至道自然，亦非有为，亦非无为。 故至道自然，湛寂清静，混而不染，和而不同，非有非无。 几学仙之士无以执非，但俱无执见，则自达真道，超越三乘，悉归一乘。 道不为下，故执德者不名为道矣。 执着之者，不名道德。 前说执德以为下德，故执诸相，行流涉于有为，不名道德也。 道德者，通变无方，存亡自在，应用即见，能尊能贵，悉皆自然，非执见之人。 若执见之人，岂能知之乎？ 此一段明众生所以不得真道．至常清静矣。 众生所以不得真道者，为有妄心。 妄者，动也。 情浮意动，心生所妄，动者思之，因妄者，乱之本也。 一切众生不得真道者，皆为情染意动，妄有所思，思有所感，感者感其情而妄动於意，意动其思而妄生於心。 人若妄心不生，自然清静。 又云，妄动者，亡也。 皆亡失其道性，故逐境而感情，妄动其心，故不得真道。 既有妄心，即惊其神。 惊者，心之极畏，名曰惊也。 非祗指於心惊也。 惊有二说．一则内修清静，乃忘於形而惊其神。 二则外习事业，乃劳於心，而惊其形； 外既惊其形体，内诱则惊於其神。 若得心神安静，则外欲不生＂，欲既不生，自然清静也。 既惊其神，即着万物。 凡人若惊其神，则外有所着於境，内则失於正性。 万物者，众多之名也。 缘道贵守一，不可着於万物而惊其神也。 夫人得生於世，故禀地、水、火、风四大之中，和炁而生，按三才而所育，贵亦难胜。 若能安然不动，内守元和，则思虑不惑，自然清静也。 既着万物，即生贪求。 贪者，是爱着之貌。 虽名爱着，亦有二种分别之义：一者贪於世事，外求华饰，欲乐其情，则为阴咎，不合於阳教。 既属於阴，即不能清静，乃为浊滞也。 二者贪於进修，穷寻真教，坚求至道。 此为内贪。 名为贪，其理合於阳教，即轻清而为正，阴即浊滞而归邪。 若能体道合真，自然轻静也。 既生贪求，即是烦恼。 然贪外事，渐渐断除； 贪求内事，劝勤修进。 虽即内求至道，不可坚执之，亦乃生烦恼。 凡言烦恼，亦有二一种，分别轻重：一者轻烦恼，二者重烦恼。 一轻则是贪求至道，执之亦生烦恼。 二则是外求世法，名重烦恼。 轻即合阳，是名为清； 重即合阴，是名为浊。 虽分轻重，则不可执之。 执犹着也。 既贪着即生迷惑。 但以拾重弃轻，内守元和，湛然不动，故谓之怀道抱德，自然淳朴。 夫长生之道全在养神，若守元和不失，神即居之，神若居则心大安，忻忻而若喜，自然清静，岂有烦恼生乎？ 烦恼妄想，忧苦身心，便遭浊辱，流浪生死，常沉苦海，永失真道。 身心耽着外境，忧苦自生於内。",
      "translated_text": "It further states: \"What exists seems not to exist; what is real seems empty.\" If one clings to views of existence or to names in the Way, this is not the highest virtue. Fundamentally, there is neither being nor non-being, neither emptiness nor fullness. In application, it is present; when obscured, it is absent. Thus it is said: \"The knowing do not speak; the speaking do not know.\" Those who know yet do not speak conceal it. Moreover, to know as if not knowing is superior; to know without knowing is a flaw—hence it is said the knowing cannot be spoken of. Therefore, the highest virtue does not act as virtue, while the lower virtue clings to virtue. Those of lower virtue who cling to virtue possess names, traces, and meritorious deeds, thereby establishing reputations and self-display. All views that arise give birth to discrimination.\n\nThe scripture also states: \"When you meet it, you do not see its head; when you follow it, you do not see its rear.\" How can there be discrimination? Once discrimination arises, one clings to virtue. If one can eliminate the mind of duality, this is called the natural Way. Duality refers to the dharmas of action and non-action. Some establish non-action as right and refute action as wrong; others cling to action as right and refute non-action as wrong. This is the mind of duality. The supreme Way is natural—neither action nor non-action. Thus, the supreme Way is naturally profound, still, and pure, blended yet unstained, harmonious yet distinct, neither being nor non-being.\n\nThose who study immortality must not cling to negation. If all clinging views are absent, one naturally attains the true Way, transcends the Three Vehicles, and returns to the One Vehicle. The Way does not descend to the inferior, so those who cling to virtue cannot be called the Way. Those who cling cannot be called the Dao and virtue. As previously stated, clinging to virtue is the lower virtue. Thus, clinging to forms and engaging in action is not called Dao and virtue. Dao and virtue are boundless in transformation, free in existence and cessation, manifest in application, able to honor and ennoble—all naturally so, not for those who cling to views. How could those who cling to views know it?\n\nThis passage clarifies why sentient beings fail to attain the true Way and perpetual purity. The reason sentient beings do not attain the true Way is the presence of deluded mind. Delusion is movement. When emotions float and intentions stir, the mind generates delusion. Movement is thinking, and delusion is the root of chaos. All sentient beings fail to attain the true Way because they are stained by emotions, moved by intentions, and deluded by thoughts. Thoughts give rise to feelings, and feelings stir emotions, deluding the mind. If the deluded mind does not arise, one is naturally pure and still.\n\nIt is also said: \"Deluded movement is loss.\" All lose their inherent nature of the Way, following circumstances to stir emotions and delude the mind, thus failing to attain the true Way. Once the deluded mind arises, it startles the spirit. Startling is the extreme fear of the heart, called *jing*. This is not merely the heart’s alarm. There are two explanations for startling: first, in inner cultivation of purity, one forgets the form and startles the spirit; second, in external engagement with affairs, one wearies the mind and startles the body. Externally startling the body internally seduces and startles the spirit. If the heart and spirit are at peace, external desires do not arise. Once desires do not arise, one is naturally pure and still.\n\nWhen the spirit is startled, one clings to the myriad things. If a person startles the spirit, externally they cling to circumstances, and internally they lose their true nature. The myriad things are a name for multiplicity. The Way values guarding the One; one must not cling to the myriad things and startle the spirit. Humans are born into the world, endowed within the four great elements of earth, water, fire, and wind, harmonized by qi, nurtured by the Three Powers—this is indeed difficult to surpass. If one can remain unshaken, inwardly guarding primordial harmony, thoughts will not be confused, and one will be naturally pure and still.\n\nOnce clinging to the myriad things, desire and seeking arise. Desire is the appearance of attachment. Though called attachment, it has two distinctions: first, desire for worldly affairs, seeking external adornments to delight the emotions—this is a yin fault, not in accord with yang teachings. Belonging to yin, it cannot be pure and still, becoming turbid and stagnant. Second, desire for progress in cultivation, exhaustively seeking true teachings and resolutely pursuing the supreme Way—this is inner desire. Though called desire, its principle accords with yang teachings, being light and pure, while yin is turbid and deviant. If one can embody the Way and unite with the real, one is naturally light and still.\n\nOnce desire and seeking arise, affliction follows. Yet desire for external affairs can gradually be severed; desire for inner cultivation should be encouraged with diligent progress. Even in seeking the supreme Way, one must not cling firmly, for this too generates affliction. Affliction has two kinds, distinguished by weight: minor affliction and major affliction. Minor affliction arises from desiring the supreme Way and clinging to it; major affliction arises from seeking worldly dharmas. Minor affliction accords with yang and is called purity; major affliction accords with yin and is called turbidity. Though distinguished by weight, one must not cling to either. Clinging is attachment. Once there is attachment, delusion arises.\n\nBy relinquishing the heavy and embracing the light, inwardly guarding primordial harmony, profoundly unmoving, this is called \"cherishing the Way and embracing virtue,\" naturally simple and unadorned. The Way of longevity lies entirely in nurturing the spirit. If one guards primordial harmony without loss, the spirit abides within. When the spirit abides, the heart is greatly at peace, joyful and content, naturally pure and still—how could affliction arise? Affliction and delusion distress body and mind, leading to turbidity and disgrace, drifting through birth and death, forever sinking in the sea of suffering, eternally losing the true Way. When body and mind are attached to external circumstances, sorrow and suffering arise within.",
      "overlap_context": "s love of contention.\nWith no mind in any view, how can there be contention?\nIf one has no contention, one is pure and still.\n\nThe highest virtue does not act as virtue; the lower virtue clings to virtue.\nVirtue is nobility, possessing a name.\nThe highest virtue refers to the lords of remote antiquity who originally had no titles,\nnor any designations—thus it is said they did not act as virtue.\nThis scripture states: \"The highest virtue is non-action, which is what the Dao and virtue designate.\"",
      "start_char": 6253,
      "end_char": 7502,
      "start_sentence": 388,
      "end_sentence": 457,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.205904006958008,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静经注（前蜀杜光庭）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "浊者，染也； 辱者，污也。 身心染污，自归流浪者，返复也。 返复生死，不离轮回，流浪於苦海之中。 苦海者，忧苦之海也。 海者，大也，忧苦事不能免也。 非干至道不慈，自为人心造作。 夫学道之士，但内守其一，外除其想。 一者，身也。 圣人皆云存三守一。 三者，精炁神也。 但守其身，必存於三也。 故《西升经》云：守身不失，常存也。 专守其一，不生妄想，即免於苦海沉沦，忧苦不着於身心，自然解脱，合於清静。 故圣人遗其经文，以正其义，施大法桥，闭其径路，教化未悟，令入妙门。 此明人皆自失真元，故非为至道不慈者也。 真常之道，悟者自得。 得悟道者，常清静矣。 真道者常存，非古非今，非生非灭，外包天地，内入毫芒，法则万物，常用於世。 人能悟解，虽己自得，非为化物也。 夫太上所言，人能觉悟，悟则本性，谓之得道也。 亦非至道难求，亦非易得也。 本经云：天道无亲，常与善人。 又云：道本无形，莫之能名。 得悟之者，唯己自知。 善人常能守於清静，即皆为得其真道者也。 此一章至书而录之，总为一段。 先明仙翁诵持此法，次明传授帝君，天官洞府，悉皆秘隐，非为常轻者也。 仙人葛玄曰：吾得真道，曾诵此经万遍。 仙人姓葛讳玄，字孝先。 初学道之时，常诵此经，后得神仙之道，今位登左仙翁者是也。 仙翁有孙，名洪字稚川，今之世人皆只乎朴抱子。 祖代求仙，皆成真人矣。 仙翁初入道之时，居长白山，或居东岳。 自后遍历名山，殷懃求道。 成道之后，隐迹潸形，为留经教於世，劝悟后学之途。 凡言诵经万遍者，万遍即万行圆备也。 又《灵宝经》云，万范开张者，乃明诸天梵炁弥罗，无不周遍也。 范者，法也。 万法皆同，内外俱应。 分即为万象之形，聚为万神之体，此乃为圆满之义也。 又云，万遍道备，飞升太空，万神之备。 万遍既周，乃成清静之道，非祗为诵持经文，何必苦於形而劳其神者也。 此经是天人所习，不传下士。 天人者，极阳之仙也。 天仙者，碧落飞腾，游行自在，两腋有毛羽，亦名羽客也。 凡是天仙羽客，住於三清之上，常行於经法，亦非轻传下士。 世人若修天人之行，即谓天上人也。 凡欲修学之士，何不诵习此经，日有进修之业，若无退慢之心，是谓有进无退之士也。 亦不令轻传下士。 又圣人云，经法流行於世，学人若遇，须当宝而贵之，不可轻泄。 如逢贤士，有心即授，有善即传。 此盖流通救度，要其悟解者也。 可传可授，弘在人矣。 吾昔受之於东华帝君。 吾者，仙翁自称也。 东华者，按《上清经》云：东方有飘云世界碧霞之国，翠羽城中苍龙官，其中官阙，并是龙凤宝珠合就，上有五色苍云覆盖其上，故号苍龙宫也。 乃是东华小童君所居之处。 此明仙翁自云吾逢彼帝君，即传受此经，且非轻传於下士也。 东华帝君受之於金阙帝君， 金阙者，西方有琅玕世界琼瑶之国，瑠璃官内，其中官阙，并是琅玗宝珍瑠璃合就，故号曰瑠璃宫也。 有一帝君於宫内亦宝秘此经。 又云金阙帝君者也。 应其名号，或太上分形化体，名号有殊。 《上清经》云：后圣金阙玄元黄帝老君，太上是也。 又《尹氏玄中记》曰：太上老君常居紫微官，或号天皇大帝，或曰太一救苦天尊，或号金阙圣君。",
      "translated_text": "The turbid is defilement; disgrace is pollution. When body and mind are defiled and polluted, one inevitably drifts and wanders—this is the cycle of rebirth. Trapped in the wheel of rebirth, one cannot escape the sea of suffering. The sea of suffering is the ocean of sorrow and affliction. \"Sea\" signifies vastness, for the sorrows and afflictions of life cannot be avoided. This is not because the supreme Way lacks compassion, but because the human heart creates its own suffering.\n\nThose who study the Way must inwardly guard their unity while outwardly eliminating delusions. \"Unity\" refers to the body. The sages all speak of preserving the Three and guarding the One. The Three are essence, qi, and spirit. To guard the body is necessarily to preserve the Three. Thus, the *Scripture of Western Ascension* states: \"Guard the body without loss, and it will abide constantly.\" By focusing solely on this unity and refraining from delusive thoughts, one avoids sinking into the sea of suffering. Sorrow and affliction will no longer cling to body and mind, and one naturally attains liberation, merging with purity and stillness.\n\nThus, the sages bequeathed their scriptures to rectify meaning, erecting the great bridge of the Dharma to close the paths of error. They taught and transformed those yet to awaken, guiding them into the wondrous gate. This makes clear that all people lose their true origin themselves—it is not that the supreme Way lacks compassion. The eternal and constant Way is attained by those who awaken. Those who awaken to the Way abide in constant purity and stillness. The true Way is ever-present, neither ancient nor modern, neither born nor destroyed. Externally, it encompasses heaven and earth; internally, it enters the finest hair. It is the law that governs all things and is ever employed in the world. Those who comprehend and awaken attain it for themselves, not for the sake of transforming others.\n\nWhat the Most High speaks of is human awakening. To awaken is to return to one’s original nature—this is called attaining the Way. It is neither that the supreme Way is difficult to seek nor that it is easily obtained. This scripture states: \"The Way of Heaven is impartial, yet it constantly bestows upon the good.\" It also says: \"The Way is originally formless; nothing can name it.\" Those who attain awakening know it for themselves. The good constantly guard purity and stillness, and thus all are those who have attained the true Way.\n\nThis chapter is recorded in its entirety as one section. First, it clarifies that the Immortal Elder recited and upheld this method. Next, it recounts its transmission to the Lord of the Eastern Florescence. The celestial palaces and grotto-heavens all hold it in secret seclusion, for it is not to be lightly shared. The Immortal Ge Xuan said: \"I attained the true Way after reciting this scripture ten thousand times.\" The Immortal’s surname was Ge, his given name Xuan, and his courtesy name Xiaoxian. When he first studied the Way, he constantly recited this scripture. Later, he attained the Way of immortality and now holds the rank of Left Immortal Elder.\n\nThe Immortal Elder had a grandson named Hong, courtesy name Zhichuan, whom the people of this world know as Baopuzi. Their ancestral line sought immortality, and all became perfected beings. When the Immortal Elder first entered the Way, he resided on Mount Changbai or on the Eastern Peak. Later, he traveled through all the famous mountains, diligently seeking the Way. After attaining the Way, he concealed his traces and transformed his form, leaving this scripture in the world to exhort and awaken later learners.\n\nTo speak of reciting the scripture ten thousand times means that ten thousand practices are perfected and complete. The *Scripture of Numinous Treasure* states that \"the ten thousand models unfold,\" clarifying that the celestial Brahma-qi pervades all without exception. \"Model\" means method. All ten thousand methods are the same, responding both internally and externally. When dispersed, they become the forms of the ten thousand phenomena; when gathered, they form the bodies of the ten thousand spirits—this is the meaning of perfection.\n\nIt also says that when the ten thousand recitations are complete, the Way is perfected, and one ascends to the great void, the ten thousand spirits fulfilled. When the ten thousand recitations are complete, the Way of purity and stillness is achieved. It is not merely about reciting the scripture’s words—why should one exhaust the body and weary the spirit? This scripture is practiced by the Heavenly People and not transmitted to the unworthy. The Heavenly People are the immortals of utmost yang. The Heavenly Immortals soar through the azure vault, roaming freely, their armpits bearing feathers—they are also called Feathered Guests. All Heavenly Immortals and Feathered Guests dwell above the Three Clarities, constantly practicing the scriptures and methods, which are not lightly transmitted to the unworthy.\n\nIf worldly people cultivate the practices of the Heavenly People, they are called Heavenly Beings. For those who wish to study and learn, why not recite and practice this scripture daily, advancing in cultivation? Without a mind of laziness or retreat, one becomes a person of progress without regression. It is also not to be lightly transmitted to the unworthy. The sages also said: \"When the scriptures and methods circulate in the world, if learners encounter them, they must treasure and honor them, not lightly disclose them. If one meets a worthy person with a sincere heart, then transmit; if one meets a good person, then pass it on.\" This is for the sake of widespread salvation, so that those who awaken may comprehend. Whether to transmit or teach depends on the person.\n\nI formerly received it from the Lord of the Eastern Florescence. \"I\" is the Immortal Elder’s self-reference. According to the *Scripture of Supreme Purity*, in the east there is the Azure Cloud Realm, the Jasper Radiance Kingdom, and within the Emerald Feather City stands the Azure Dragon Palace. Its halls and towers are all constructed from dragon and phoenix treasures and precious pearls. Above, five-colored azure clouds cover it, hence it is called the Azure Dragon Palace. It is the dwelling place of the Lord of the Eastern Florescence, the Youthful Sovereign. This clarifies that the Immortal Elder himself said that he encountered that Lord and received this scripture from him—it is not lightly transmitted to the unworthy.\n\nThe Lord of the Eastern Florescence received it from the Lord of the Golden Portal. The Golden Portal refers to the west, where there is the Coral Realm, the Jasper Radiance Kingdom, and within the Lapis Lazuli Palace. Its halls and towers are all constructed from coral, precious jades, and lapis lazuli, hence it is called the Lapis Lazuli Palace. There is a Lord within this palace who also treasures and secretes this scripture. He is also called the Lord of the Golden Portal. Depending on his name and title, or the Most High’s manifestations and transformations, the names and titles may differ.\n\nThe *Scripture of Supreme Purity* states: \"The Later Sage, the Lord of the Golden Portal, the Mysterious Origin, the Yellow Emperor, the Venerable Lord\"—this is the Most High. The *Master Yin’s Record of the Mysterious* says: \"The Most High Lord Lao constantly resides in the Purple Tenuity Palace. Sometimes he is called the Heavenly Sovereign Great Emperor, sometimes the Supreme One, the Heavenly Worthy Who Saves from Suffering, or the Sacred Lord of the Golden Portal.\"",
      "overlap_context": "ring the spirit. If one guards primordial harmony without loss, the spirit abides within. When the spirit abides, the heart is greatly at peace, joyful and content, naturally pure and still—how could affliction arise? Affliction and delusion distress body and mind, leading to turbidity and disgrace, drifting through birth and death, forever sinking in the sea of suffering, eternally losing the true Way. When body and mind are attached to external circumstances, sorrow and suffering arise within.",
      "start_char": 7502,
      "end_char": 8753,
      "start_sentence": 458,
      "end_sentence": 523,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.53637671470642,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静经注（前蜀杜光庭）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "故知太上随方设化，应号无穷。 即知先圣金阙西方琼瑶国主帝君是也。 上圣帝君尽皆宝秘此经，何况后学传受，修持讽诵，岂不钦崇，重而行之者乎？ 金阙帝君受之於西王母。 王母者，诸天神王帝主之母，居於昆仑。 按《天地论》曰：王母居昆仑西侧黄河出水之处。 王母者，是天地之母。 又云，天公、地母主统众真，总摄三界，天上天下，是王母为至尊之母也。 昔於金阙帝君受得此经，其帝君受此经於西王母之时，亦非轻传於下士也。 西王母皆口口相传，不记文字。 吾今於世书而录之。 口口相传者，古圣人传受经法，皆以内藏心腹秘受经文，流通行化，教导人天，并不记文字，即不以今世所见也。 自仙翁后来，故书此经，传於下世，普遍流行，即要拔度后学之徒者也。 前明先圣传受，次明后学尊卑，若能悟解真道，则随功而获果矣。 上士悟之，升为天官。 上士者，外炼形质，内养精神，外和其光而同其尘，内修功而保其元也。 元者，元炁也。 元炁是神之母。 人能常存於元炁，下保於丹田，上固於泥丸，中守於绛官，如此爱重，保於三元，是谓内养於神。 神者，炁之子； 形者，神之舍。 神是身之主，身无主则不安； 形无神而不立。 上达之士常服日精，保於下丹田，饮於月华，保於脑户。 脑户者，泥九上丹田也，属阳，故使太阴精炁保之。 下丹田肾官气海属阴，故使太阳精炁保之。 又《易》曰：一阴一阳之谓道也。 且能待日月二景扶身形而行之，叉升为天官也。 是五云五炁者，是五行之正炁也。 凡上道之人，五脏既真，五脏炁自生，五行真炁化成五云，扶其形质，上游三界。 三界者，欲界、色界、无色界也。 下游十方。 十方者，四维上下是也。 三界十方俱无滞碍，然后升入上清，得位为天官之号也。 中士悟之，南宫列仙。 金者，肺也。 玉者，骨也。 凡学道之士先须炼骨，谓之宝玉； 炼肺保津，谓之炁金。 石者，肾也； 丹者，心也。 安心息炁，保於肾脏，乃得延年，非为世间金石宝玉也。 此之金石能保其命。 又图南子云：外宝如何内宝存。 此之谓也。 若能内保於性命，然上参於上清圣文。 圣文者，皆上清秘宝之书。 下达玄微者，下元肾也。 又《上清经》云：南方有丹灵天，内有药珠宫，内有一真君号曰灵天君。 又云，朱阳宫或云朱陵宫，其天中内有炎炎火炼池，池有七宝宫殿，亦号曰紫阳宫。 若有下达之士学道成功者，乃同司命真君录其姓名，奏上南宫，得为仙官之号也。 下士得之，在世长年， 下士者，未能绝利一源，皆求资身益命之道； 或服灵药，或饵丹砂，或休名弃位，或淡静安神，或依倚林泉，或藏迹於朝市，内修至道，外合五常。 或隐或见，体道合真。 如斯不退，尚保延年，何况高士英贤隐於岩谷，学神仙养药，而得白日升天。 何故后人不能专至？ 即今西岳华山山居隐士丁、陈二人在世延年？ 注名以入仙位，况后人不能相效。 故举此数喻，乃明至道无偏，求者必达。 故本经云：天道无亲，常与善人也。 又参同归一。 游行三界，升入金门。 《灵宝经》 云：三十二天三十二帝，第六名上明七曜摩夷天帝，名恬懀延，此是欲界也。 虽有此说，凡学道但去其欲，即名真人。 又色界在二十四重天，无极昙誓天为色界，其帝君号名飘弩穹隆。",
      "translated_text": "Thus we know the Most High manifests transformations according to place, and his appellations are boundless. It is known that the Lord Emperor of the Golden Portal, ruler of the Lapis Lazuli Realm in the West, is none other than the Former Sage. All the exalted lord emperors have treasured and secreted this scripture—how much more should later students, in receiving and transmitting it, in cultivating, upholding, and reciting it, revere and esteem it, practicing it with utmost gravity?\n\nThe Lord of the Golden Portal received it from the Queen Mother of the West. The Queen Mother is the mother of all heavenly deities, divine kings, and lord emperors, and she resides on Kunlun. According to the *Treatise on Heaven and Earth*, \"The Queen Mother dwells on the western side of Kunlun, where the Yellow River issues forth.\" She is the mother of heaven and earth. It is also said that the Heavenly Father and Earthly Mother govern all perfected beings, presiding over the Three Realms—above in heaven and below on earth—making the Queen Mother the Most Honored Mother. When the Lord of the Golden Portal received this scripture from the Queen Mother, it was not lightly transmitted to those of lesser attainment. The Queen Mother passed it down orally, without committing it to writing.\n\nNow, in this world, I have recorded it in written form. The oral transmission of ancient sages, in passing down scriptures and methods, always relied on the inner treasury of the heart and mind to secretly receive the scriptural texts. In circulating and propagating them to teach and guide humans and devas, they did not commit them to writing—unlike what is seen in the present age. Since the time of the immortal elders, this scripture has been written down and transmitted to later generations, widely disseminated to universally deliver and elevate later students.\n\nFirst, the transmission by former sages is clarified; next, the hierarchy of later students is explained. If one can awaken to and comprehend the true Dao, one will attain fruition according to one’s merit.\n\nThe superior practitioner, upon awakening, ascends to become a celestial official. The superior practitioner externally refines the bodily form and internally nurtures the spirit. Externally, they harmonize their radiance and merge with the dust; internally, they cultivate merit and preserve their primordial essence. This *primordial essence* is the primordial qi. Primordial qi is the mother of spirit. If one can constantly abide in primordial qi, safeguarding it below in the Cinnabar Field, securing it above in the Mud Pill Palace, and guarding it at the center in the Crimson Palace, cherishing and preserving the Three Origins—this is called internally nurturing the spirit. Spirit is the child of qi; form is the dwelling of spirit. Spirit is the master of the body; without a master, the body is not at peace. Without spirit, form cannot stand.\n\nThe advanced practitioner constantly absorbs the essence of the sun, preserving it in the lower Cinnabar Field, and drinks the radiance of the moon, preserving it in the Brain Palace. The Brain Palace is the upper Cinnabar Field of the Mud Pill, belonging to yang, and thus the essence and qi of the Great Yin are preserved there. The lower Cinnabar Field, the Qi Sea of the Kidney Palace, belongs to yin, and thus the essence and qi of the Great Yang are preserved there. As the *Book of Changes* states: \"The interplay of one yin and one yang is called the Dao.\" If one can await the dual luminaries of the sun and moon to support the bodily form in practice, one will ascend to become a celestial official.\n\nThe *five clouds and five qi* are the true qi of the Five Phases. For those who tread the Dao above, once the five viscera are perfected, the qi of the five viscera naturally arises. The true qi of the Five Phases transforms into five clouds, supporting the bodily form as it ascends through the Three Realms. The Three Realms are the Realm of Desire, the Realm of Form, and the Formless Realm. It descends to roam the Ten Directions. The Ten Directions are the four cardinal directions, four intermediate directions, above, and below. Once free from all obstructions in the Three Realms and Ten Directions, one ascends into the Supreme Purity and attains the title of celestial official.\n\nThe middling practitioner, upon awakening, is ranked among the immortals of the Southern Palace. Gold corresponds to the lungs; jade corresponds to the bones. Those who study the Dao must first refine their bones, calling them *precious jade*, and refine their lungs to preserve fluids, calling them *qi gold*. Stone corresponds to the kidneys; cinnabar corresponds to the heart. Calming the heart and regulating the breath to preserve the kidney viscera enables longevity—this is not the gold, stone, jewels, or jade of the mundane world. This *gold and stone* can preserve one’s life.\n\nAs the *Nanzi Tu* states: \"How can external treasures compare to the preservation of internal treasures?\" This is the meaning. If one can internally preserve one’s nature and life, one may ascend to partake in the sacred texts of Supreme Purity. The *sacred texts* are all the secret treasures of Supreme Purity. Those who attain the profound and subtle below reach the lower origin of the kidneys. The *Scripture of Supreme Purity* states: \"In the south is the Cinnabar Spirit Heaven, within which lies the Palace of Medicinal Pearls. There resides a perfected lord named the Spirit Heaven Lord.\" It is also said that the Vermilion Yang Palace, or Vermilion Mound Palace, contains within its heavens a scorching refining pool, within which are palaces of the seven treasures, also called the Purple Yang Palace. If a practitioner who has attained the profound below succeeds in their studies, the True Lord of Life and Destiny records their name and petitions the Southern Palace, where they receive the title of immortal official.\n\nThe inferior practitioner, upon attainment, enjoys long life in the world. The inferior practitioner cannot sever the root of desire and seeks only methods to sustain the body and prolong life. Some ingest numinous medicines, some consume cinnabar, some renounce fame and abandon rank, some cultivate tranquility to pacify the spirit, some rely on forests and springs, some conceal their traces in the marketplace, internally cultivating the supreme Dao while externally harmonizing with the Five Constants. Whether hidden or revealed, they embody the Dao and unite with the real. If they persist without regression, they may still preserve longevity—how much more so for lofty scholars and worthy sages who seclude themselves in mountain valleys, study the arts of divine immortality, cultivate elixirs, and ascend to heaven in broad daylight?\n\nWhy are later people unable to achieve such single-minded devotion? Even now, the mountain-dwelling recluses Ding and Chen of Mount Hua in the Western Peak enjoy longevity in the world. Their names are recorded to enter the ranks of immortals—how can later people fail to emulate them? Thus, these examples are cited to illustrate that the supreme Dao is impartial, and those who seek it will surely attain it. As this scripture states: \"The Dao of heaven is impartial; it constantly accords with the good.\" All paths ultimately converge as one. Roaming through the Three Realms, one ascends into the Golden Gate.\n\nThe *Scripture of Numinous Treasure* states: \"Among the thirty-two heavens and thirty-two emperors, the sixth is named the Heavenly Emperor of the Luminous Seven Luminaries, Shangming Qiyao Moye, which belongs to the Realm of Desire.\" Though such accounts exist, those who study the Dao need only eliminate desire to be called true persons. The Realm of Form comprises twenty-four heavens, with the Heaven of Boundless Vows as its highest, ruled by the Heavenly Emperor named Piaonu Qionglong.",
      "overlap_context": "s and titles may differ.\n\nThe *Scripture of Supreme Purity* states: \"The Later Sage, the Lord of the Golden Portal, the Mysterious Origin, the Yellow Emperor, the Venerable Lord\"—this is the Most High. The *Master Yin’s Record of the Mysterious* says: \"The Most High Lord Lao constantly resides in the Purple Tenuity Palace. Sometimes he is called the Heavenly Sovereign Great Emperor, sometimes the Supreme One, the Heavenly Worthy Who Saves from Suffering, or the Sacred Lord of the Golden Portal.\"",
      "start_char": 8753,
      "end_char": 10016,
      "start_sentence": 524,
      "end_sentence": 589,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.46760272979736,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静经注（前蜀杜光庭）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "，又太素秀乐禁上天为无色界帝君，名龙罗觉长。 此名三界，乃指天地而言，此为外，约大纲之说也。 若喻人身而言之，三界即三丹田也。 下丹田为欲界，中丹田为色界，上丹田为无色界。 人若保守於三丹田，则精气神存上中下三丹田之境，真人游於三界也。 若得三丹田神俱足，则自然升天矣。 故经云，形神俱妙，与道合真，此之谓也。 《上清经》云：大罗天在三十二天之上。 又《灵宝经》云：三界之上，渺渺大罗。 大罗之境唯有三清宫阙，莫不上圣高尊游於其上。 又云，有五亿五万五千五百五十重天。 此不具载。",
      "translated_text": "Moreover, the Heaven of Supreme Primordial Radiant Joy and Forbidden Ascents serves as the Heavenly Emperor of the Formless Realm, named Longluo Juechang.\n\nThese Three Realms refer to heaven and earth, constituting the external framework in broad terms. Yet when likened to the human body, the Three Realms correspond to the three cinnabar fields: the lower cinnabar field as the Realm of Desire, the middle cinnabar field as the Realm of Form, and the upper cinnabar field as the Formless Realm. Should one preserve the three cinnabar fields, essence, qi, and spirit abide within the bounds of the upper, middle, and lower cinnabar fields—thus does the true person roam through the Three Realms. If the spirits of the three cinnabar fields are all complete, one naturally ascends to heaven. Hence the scripture states: \"When form and spirit are both wondrous, they unite with the Dao in truth\"—this is what it means.\n\nThe *Scripture of Supreme Clarity* states: \"The Great Canopy Heaven lies above the thirty-two heavens.\" The *Scripture of Numinous Treasure* also says: \"Above the Three Realms stretches the vast Great Canopy.\" Within the bounds of the Great Canopy exist only the palaces of the Three Clarities, where all the exalted sages and lofty venerables wander above. It further states: \"There are fifty-five myriad, five thousand five hundred and fifty layers of heavens.\" These are not recorded in full here.",
      "overlap_context": "Gate.\n\nThe *Scripture of Numinous Treasure* states: \"Among the thirty-two heavens and thirty-two emperors, the sixth is named the Heavenly Emperor of the Luminous Seven Luminaries, Shangming Qiyao Moye, which belongs to the Realm of Desire.\" Though such accounts exist, those who study the Dao need only eliminate desire to be called true persons. The Realm of Form comprises twenty-four heavens, with the Heaven of Boundless Vows as its highest, ruled by the Heavenly Emperor named Piaonu Qionglong.",
      "start_char": 10016,
      "end_char": 10245,
      "start_sentence": 590,
      "end_sentence": 601,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.674620866775513,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静经注（前蜀杜光庭）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "又唐贤乐朋龟云：原夫八十一天，比太上之半寿。 此者大约而言也。 学道人若先修内行，保固守於三元神，三元神俱备，自得升天，游於三清之境，出入金阙之前，朝拜太上，得为真人。 故曰升入金门也。 前仙翁书录乃标至学尊卑。 此明真人所说，导引群生，普令诵持真经，得善神拥护其身，渐入仙真之阶。 左玄真人曰： 左者，阳也。 玄者，一也。 道君号得一，真人乃立其左右，阴阳一是也。 故言左玄真人。 左玄真人者号法解。 为此真人大慈，仁者多请问因缘，下游五浊，救拔一切； 复归三境，侍从尊慈，太上保之，称其名号。 学仙之士但能存一，守於阴阳二炁，则为真人。 何为守一？ 一者，道之本性。 一为大也。 又云身也。 故引《西升经》云：爱人不如爱身，爱身不如爱神，爱神不如舍神，舍神不如守身，守身长久，长存也。 学人未悟玄微，但且护形爱炁，轻物贱名，思虑不惑，则血气和平，如此即其一可存也。 阴阳二炁即坎离之用也。 故谓为真人之身。 然后朝於太上，皆得为道之臣也。 上则参於三境，下则游於十方，开导众生，教化未悟，引接群生，普令得其道，此即为真人之所作也。 学道之士，持诵此经， 持诵者，依本曰读，离本曰诵。 学道之士，若能心正，道念不退，依法奉修，如对太上，行住坐立，常持专一，是谓诵持者也。 即得十天善神拥护其人。 此明学士心常念道，持诵真经，即得善神拥护。 十天者，八方上下是也。 《因缘经》云：每月十直斋，各有善神直日，亦为善神也。 且人有三业、六根身形之业，故有十恶。 十恶者，淫、杀、盗、嫉、妇、恚、恶口、两舌、妄言、绮语，此为十恶。 十善者，身不妄行，心不妄动，意不妄思，性不妄乱，耳不妄听邪声，口不妄言绮语，目不妄视邪色，鼻不妄受邪秽，舌不妄食邪味，识不妄受於惊怖，即名十二善。 十善既生，十恶自灭，乃得真圣相护。 十行既周，自然清静。 既生清静，则无烦恼。 烦恼既无，乃成真道。 然后玉符宝神，金液炼形，形神俱妙，与道合真。 玉符者，玉皇之符也。 令人学道功圆行满，升入仙阶者。 先得玉皇符命，然后升仙也。 玉符於身而论之，可明中元之事。 中元者，心也。 学人之心若能安静，自然无染於尘垢，清静而保固形神。 若上等之人悟炼金液之道，以固形质。 中士未悟，身外求药，合和修炼，以伫性命。 若论出入之道，亦先固形体，然后养於神识而形体固，形瘦力倦，神者为彼之主，主安则外固。 假如世之屋宅无人，则不能全矣。 内外之事如此也。 故引《西升经》之言：我身乃神之车、神之舍、神之主，主人安静，神既居之； 躁动，神即去之。 又云：神生形，形成神。 形不得神，不能自生； 神不得形，不能自成。 形神合同，更相生，更相成。 此事表裹相应之道。 又云，神常爱人，人不爱神。 神常爱人者，愿其人生。 人不爱神者，为心所扰也。 心亦神也，其神名曰灵童，能恶能善，能昧能明，能喜能怒，能正能邪。 使意马如风驱，心猿如箭疾，巧生千种，机出万端，皆在此神。 又《内观经》云：心者神也，非青非白，非赤非黄，非大非小，非短非长，非曲非直，非柔非刚，非厚非薄，非圆非方，变化莫测，混合阴阳。",
      "translated_text": "Moreover, the Tang dynasty worthy Le Penggui stated: \"The eighty-one heavens are but half the lifespan of the Most High.\" This is spoken in broad terms. If the practitioner of the Dao first cultivates inner conduct and preserves the three primordial spirits within the Three Origins, once the three primordial spirits are all complete, one naturally ascends to heaven, roaming through the realms of the Three Clarities, entering and exiting before the Golden Gates, and paying homage to the Most High—thus becoming a true person. Hence it is said: \"Ascending into the Golden Gate.\"\n\nEarlier, the writings of the immortal masters distinguished the hierarchy of the most exalted studies. Here, what the true persons expound is the guidance of all beings, universally instructing them to recite and uphold the true scriptures, so that benevolent spirits may shield their bodies and they may gradually ascend the ranks of the immortals.\n\nThe Left Mystery True Person said: \"Left is yang. Mystery is the One. The Dao Lord is titled 'Attainer of the One,' and the true persons stand to his left and right—this is the unity of yin and yang.\" Hence the name Left Mystery True Person. The Left Mystery True Person is titled \"Dharma Interpreter.\" Out of great compassion, this true person responds to the many inquiries of the benevolent, descending into the Five Turbidities to rescue and deliver all beings. Upon returning to the Three Realms, he attends the Most High with reverence, and the Most High protects him, proclaiming his name.\n\nFor those who study immortality, simply preserving the One and guarding the yin and yang qi makes one a true person. What is meant by \"guarding the One\"? The One is the fundamental nature of the Dao. The One is the Great. It is also said to be the body. Thus, the *Scripture of Western Ascension* states: \"Loving others is not as good as loving the body; loving the body is not as good as loving the spirit; loving the spirit is not as good as relinquishing the spirit; relinquishing the spirit is not as good as guarding the body. Guarding the body ensures longevity and eternal existence.\"\n\nIf learners have not yet grasped the subtle mysteries, they should first protect their form and cherish their qi, disdaining material things and despising fame, ensuring their thoughts are free from confusion. Thus, their blood and qi will be harmonious, and this alone is the One they may preserve. The yin and yang qi are the functions of Kan and Li, and thus they constitute the body of the true person. Thereafter, paying homage to the Most High, all may become ministers of the Dao. Above, they may partake in the Three Realms; below, they may wander the ten directions, guiding and instructing all beings, teaching and transforming the unenlightened, leading and uplifting the multitude, universally enabling them to attain the Dao—this is the work of the true person.\n\nFor those who study the Dao and recite this scripture—\"reciting\" means reading from the text, while \"upholding\" means reciting from memory. If practitioners of the Dao maintain a righteous heart, their devotion to the Dao unwavering, and cultivate in accordance with the method as if facing the Most High, whether walking, standing, sitting, or lying down, always holding fast to singular focus—this is what is meant by \"reciting and upholding.\" They will then be protected by the ten heavenly benevolent spirits.\n\nThis explains that if scholars constantly contemplate the Dao and recite the true scriptures, they will be shielded by benevolent spirits. The \"ten heavens\" refer to the eight directions, above and below. The *Sutra of Causes and Conditions* states: \"Each month, on the ten straight days of purification, benevolent spirits preside over each day—these are also benevolent spirits.\"\n\nMoreover, humans possess the three karmas of body, speech, and mind, as well as the six roots of the sensory faculties—thus the ten evils arise. The ten evils are: lust, killing, stealing, jealousy, deceit, anger, harsh speech, divisive speech, false speech, and frivolous speech. The ten virtues are: the body does not act recklessly, the heart does not stir recklessly, the mind does not think recklessly, the nature is not recklessly disturbed, the ears do not recklessly listen to improper sounds, the mouth does not recklessly utter frivolous speech, the eyes do not recklessly gaze upon improper sights, the nose does not recklessly inhale foul odors, the tongue does not recklessly taste improper flavors, and the consciousness does not recklessly entertain fear—these are called the twelve virtues.\n\nWhen the ten virtues arise, the ten evils naturally vanish, and one is protected by the true sages. When the ten practices are complete, one naturally attains purity. With purity, there is no affliction. Without affliction, one accomplishes the true Dao. Then, the jade talismans and treasure spirits refine the form with golden liquid, and when form and spirit are both wondrous, they unite with the Dao in truth.\n\nThe \"jade talisman\" refers to the talisman of the Jade Emperor. When a practitioner of the Dao perfects their merit and fulfills their conduct, ascending the ranks of immortality, they first receive the Jade Emperor’s talismanic decree before ascending as an immortal. Regarding the jade talisman in relation to the body, it clarifies the affairs of the Middle Origin. The Middle Origin is the heart. If the practitioner’s heart can remain tranquil, it will naturally be unstained by worldly defilements, preserving purity and securing the form and spirit.\n\nIf those of the highest rank awaken to the Dao of refining golden liquid, they may solidify their physical form. Those of middling attainment, not yet awakened, seek elixirs outside the body, compounding and refining them to preserve their nature and life. As for the Dao of exiting and entering, one must first secure the physical form, then nurture the spirit and consciousness. When the form is secure, even if the body grows emaciated and strength wanes, the spirit remains its master. When the master is at peace, the exterior is secure. For example, a house in the world without occupants cannot remain intact—such is the principle of inner and outer affairs.\n\nThus, the *Scripture of Western Ascension* states: \"My body is the chariot of the spirit, the abode of the spirit, the master of the spirit. When the master is tranquil, the spirit dwells within; when restless, the spirit departs.\" It further says: \"The spirit gives birth to the form, and the form completes the spirit. Without the spirit, the form cannot live; without the form, the spirit cannot be perfected. When form and spirit unite, they mutually generate and mutually complete one another.\" This is the principle of inner and outer correspondence.\n\nIt also states: \"The spirit constantly loves humanity, but humanity does not love the spirit.\" The spirit constantly loves humanity because it wishes for their life. Humanity does not love the spirit because the heart is disturbed. The heart is also spirit, and this spirit is called the \"Numinous Youth.\" It can be evil or good, dull or bright, joyful or angry, upright or crooked. It drives the mind like a horse in the wind and the heart like an arrow in flight, crafting a thousand schemes and devising ten thousand strategies—all within this spirit.\n\nThe *Scripture of Inner Contemplation* also states: \"The heart is the spirit. It is neither blue nor white, neither red nor yellow, neither large nor small, neither short nor long, neither curved nor straight, neither soft nor hard, neither thick nor thin, neither round nor square. Its transformations are unfathomable, blending yin and yang.\"",
      "overlap_context": "The *Scripture of Supreme Clarity* states: \"The Great Canopy Heaven lies above the thirty-two heavens.\" The *Scripture of Numinous Treasure* also says: \"Above the Three Realms stretches the vast Great Canopy.\" Within the bounds of the Great Canopy exist only the palaces of the Three Clarities, where all the exalted sages and lofty venerables wander above. It further states: \"There are fifty-five myriad, five thousand five hundred and fifty layers of heavens.\" These are not recorded in full here.",
      "start_char": 10245,
      "end_char": 11482,
      "start_sentence": 602,
      "end_sentence": 665,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.546995878219604,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静经注（前蜀杜光庭）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "大包天地，细入毫芒。 制之则止，放之则狂。 清静则生，浊躁则亡。 人能清静，内修至道，制伏其心，心既安静，其神则生，神生则形固，形固成神。 神藉形而成，形藉神而生，形神相藉，安静修功，形固神全。 故云形神俱妙，内外相应，自然与道合真也。 前明诵持威力，修炼成真。 此明真经道德贵重，世人悟解玄微，即得身超三界也。 正一真人曰： 正者，真也； 一者，大也，亦为心也。 心者，南方太阳之象，元处北方。 因何太阳处於北方？ 为坎离中有一画，故为一阳，是谓心也。 一是阴中阳位，二是阳中阴位。 此是五行返复之理，阴阳变化之用，是谓正一也。 正一真人者，汉天师也，姓张讳道陵也。 今为三天大法师，位任正一真人。 又为三清度师。 其真人今居圣真之位，亦曾炼五行，修功为国，扶衰救苦，除害兴物，利济庶民，功圆行满，超几成圣，位居高上正一真人。 人若能修炼其心，自然关府通泰，神和气畅，皆由正一之事。 今有天师所行正一斩邪三五飞步之道、铜符铁券、金丹宝经、秘诀灵章、二十四阶品箓，此不一一载也。 人家有此经，悟解之者，灾障不干，众圣护门， 家者，身也。 经者，心也。 外学喻则家宅也。 真人曰：家有此经，若能悟解玄微，静身心，修行念道，持诵不退，即得众圣神人护卫其门。 既得神人护门，则灾障干於家庭，邪魔无犯於住止。 皆因主人清静，故得神明护门。 内举此喻，则家犹身也。 心则经也。 人能清静，行其至道於心，则谓之有此经也。 悟者，觉也； 达者，解也； 通者，了也。 觉了则谓心有经也。 无经则未悟解，故有灾障，烦恼所生。 若心了达，则无烦恼。 烦恼既无，自然清静，灾障不生，故不干也。 众圣护门者，人身中有三万六千神，左三魂，右七魄。 身有一万二千形影，体有二万四千精光，五脏六腑二十四神，耳、眼、口、鼻皆有也。 一一各有宫阙所居人若清静，众神归身，各居宫阙，故云众圣护门。 又三万六千神各居琼宫，即知烟萝先生语不虚也。 神升上界，朝拜高尊。 神者，心也。 道典云：聪明正直谓之神，阴阳不测谓之圣。 故云心灵则道降，道降则神灵，神灵则圣也。 神明既圣，即可升也。 升者，登也，升登於上界。 上界者，则三界之上三清之境大罗天也。 人能保精、养炁、爱神，调和於元炁，填补於脑，烹炼神水，变化精神，神炁若全，即得上升三界，朝礼太上高尊。 凡学仙之士，所说朝元，即有二种：一论天地，二论人身。 即明三丹田、且三界朝元者，即上中下是三元也。 上元者，上应玉清，始炁所化，号天宝君，理玉清圣境清微天，总一十二部圣行之经，为洞真教主，下於人身中为上丹田脑工，亦号泥丸工帝君，以主於炁； 中元者，上应上清，元炁所化，号灵宝君，理上清境禹余天，总一十二部真行之经，为洞玄教主，下於人身中为中丹田心府绛官帝君，主於神； 下元者，上应太清，玄炁所化，号神宝君，理太清仙境大赤天，总一十二部仙行之经，为洞神教主，下於人身中为下丹田炁海肾宫帝君，主於命。 此三元三宫三宝者，天地得之以成，失之以倾，人身得之以生，失之以死。 故《黄庭经》云：一身精神慎勿失。",
      "translated_text": "The vast encompasses heaven and earth, the minute enters the tip of a hair. Restrain it and it halts; release it and it rages. In clarity and stillness it lives, in turbidity and agitation it perishes. If one can attain clarity and stillness, cultivate the supreme Dao within, and subdue the heart, the heart becomes tranquil, and the spirit is born. When the spirit is born, the form is stabilized; when the form is stabilized, the spirit is perfected. The spirit relies on the form to be perfected, and the form relies on the spirit to be born. Form and spirit depend on each other—through tranquil cultivation and practice, the form is stabilized and the spirit is preserved. Thus it is said: when form and spirit are both wondrous, inner and outer correspond, and one naturally unites with the Dao in truth.\n\nThe preceding elucidates the power of recitation and upholding, refining and attaining perfection. This clarifies the preciousness of the true scripture’s virtue and power—when worldly people comprehend its profound subtleties, they transcend the Three Realms in body.\n\nThe Perfected of Orthodox Unity states: \"Orthodox\" means true; \"Unity\" means great, and also refers to the heart. The heart is the symbol of the southern great yang, yet its origin lies in the northern direction. Why does the great yang reside in the north? Because within Kan and Li there is a single line, thus it is called the one yang—this is the heart. One is the yang position within yin, and two is the yin position within yang. This is the principle of the Five Phases’ reversal and the function of yin-yang transformation—this is called Orthodox Unity.\n\nThe Perfected of Orthodox Unity is the Celestial Master of the Han, surnamed Zhang, named Daoling. Today, he serves as the Great Dharma Master of the Three Heavens, holding the position of the Perfected of Orthodox Unity, and also as the Master of Salvation of the Three Clarities. This Perfected now resides in the rank of sagely perfected ones. He once refined the Five Phases, cultivated merit for the state, supported the declining, rescued the suffering, eliminated harm, fostered life, and benefited the common people. With merits complete and conduct fulfilled, he transcended the near and attained sagehood, occupying the exalted position of the Perfected of Orthodox Unity.\n\nIf one can refine the heart, naturally the palaces of the body will be unobstructed, the spirit harmonized, and qi unimpeded—all through the practice of Orthodox Unity. Today, there exist the Celestial Master’s methods of Orthodox Unity for slaying demons, the Three-Five Flying Steps, bronze talismans and iron charters, the precious scriptures of the Golden Elixir, secret formulas and numinous chapters, and the twenty-four ranks of registers—these are not enumerated one by one here.\n\nWhen a household possesses this scripture, those who comprehend it will be untouched by calamities and obstructions, and all sages will guard the gate. The \"household\" is the body; the \"scripture\" is the heart. External learning is likened to the household residence.\n\nThe Perfected says: If a household possesses this scripture and one can comprehend its profound subtleties, still the body and heart, cultivate and uphold the Dao, and recite without retreat, then all sagely spirits and divine beings will protect the gate. With divine beings guarding the gate, calamities and obstructions will not afflict the household, and evil demons will not invade the dwelling—all because the master is clear and still, thus the divine luminaries guard the gate.\n\nThis inner analogy likens the household to the body, and the heart to the scripture. If one can attain clarity and stillness, practicing the supreme Dao within the heart, this is called possessing this scripture. \"Comprehension\" means awakening; \"attainment\" means understanding; \"penetration\" means realization. Awakening and realization mean the heart possesses the scripture. Without the scripture, one has not awakened or understood, hence calamities and obstructions arise from afflictions. If the heart is enlightened and attains understanding, there are no afflictions. With afflictions gone, clarity and stillness naturally prevail, calamities and obstructions do not arise, and thus they do not intrude.\n\nWhen all sages guard the gate, within the human body there are thirty-six thousand spirits: three hun on the left, seven po on the right. The body has twelve thousand forms and shadows, the frame possesses twenty-four thousand essences of radiance, and the five viscera and six bowels have twenty-four spirits—even the ears, eyes, mouth, and nose each have their own. Each resides in its own palace. If one is clear and still, all spirits return to the body and each dwells in its palace—thus it is said that all sages guard the gate. Moreover, the thirty-six thousand spirits each reside in jade palaces, confirming that the words of Master Yanluo are not empty.\n\nWhen the spirit ascends to the upper realms, it pays homage to the exalted ones. The spirit is the heart. The Daoist canon states: \"Intelligent, bright, upright, and direct is called spirit; unfathomable in yin and yang is called sage.\" Thus, when the heart is numinous, the Dao descends; when the Dao descends, the spirit is numinous; when the spirit is numinous, it is sagely. When the spirit is sagely and luminous, it can ascend. \"Ascend\" means to ascend and reach the upper realms. The \"upper realms\" refer to the Three Clarities’ realm above the Three Realms, the Great Canopy Heaven.\n\nIf one can preserve essence, nurture qi, cherish the spirit, harmonize with primordial qi, replenish the brain, refine the spirit-water, transform and refine the spirit, and when spirit and qi are complete, one will ascend beyond the Three Realms to pay homage to the Most High and Exalted. Among those who study immortality, what is called \"paying homage to the origin\" has two aspects: one concerns heaven and earth, the other the human body.\n\nThis clarifies the three cinnabar fields. As for \"paying homage to the origin\" in the Three Realms, these are the upper, middle, and lower origins. The upper origin corresponds to Jade Clarity, transformed by the primordial qi, named the Heavenly Treasure Lord. It governs the Jade Clarity Sagely Realm of the Clear and Subtle Heaven, presiding over the twelve divisions of sagely conduct scriptures as the Master of the Cavern of Truth. Within the human body, it corresponds to the upper cinnabar field, the Palace of the Brain, also called the Palace of Muddy Pellet, ruled by the Sovereign Lord, governing qi.\n\nThe middle origin corresponds to Upper Clarity, transformed by the original qi, named the Numinous Treasure Lord. It governs the Upper Clarity Realm of the Yu-Yu Heaven, presiding over the twelve divisions of true conduct scriptures as the Master of the Cavern of Mystery. Within the human body, it corresponds to the middle cinnabar field, the Scarlet Palace of the Heart, ruled by the Sovereign Lord, governing the spirit.\n\nThe lower origin corresponds to Supreme Clarity, transformed by the mysterious qi, named the Divine Treasure Lord. It governs the Supreme Clarity Immortal Realm of the Great Red Heaven, presiding over the twelve divisions of immortal conduct scriptures as the Master of the Cavern of Spirit. Within the human body, it corresponds to the lower cinnabar field, the Sea of Qi in the Kidney Palace, ruled by the Sovereign Lord, governing life.\n\nThese three origins, three palaces, and three treasures—heaven and earth obtain them to be established and lose them to collapse; the human body obtains them to live and loses them to die. Thus, the *Scripture of the Yellow Court* states: \"The spirit and essence of the body—guard them carefully, never lose them.\"",
      "overlap_context": "d like a horse in the wind and the heart like an arrow in flight, crafting a thousand schemes and devising ten thousand strategies—all within this spirit.\n\nThe *Scripture of Inner Contemplation* also states: \"The heart is the spirit. It is neither blue nor white, neither red nor yellow, neither large nor small, neither short nor long, neither curved nor straight, neither soft nor hard, neither thick nor thin, neither round nor square. Its transformations are unfathomable, blending yin and yang.\"",
      "start_char": 11482,
      "end_char": 12701,
      "start_sentence": 666,
      "end_sentence": 723,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.62181067466736,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静经注（前蜀杜光庭）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "故要保爱也。 又云：仙人道士非有神，积精累炁以成真。 凡学道之人，若能运用精华，存想神炁，朝拜三元，修功不退，久而行之，自得真道。 故圣人云：心为使炁神，若知行炁主，便是得仙人。 此明存想之道，皆以心而使之也。 功满德就，相感帝君。 诵持不退，身腾紫云。 此明修道得果也。 功满八百，行满三千。 功行者，乃是修炼之功行也。 学人若能行胎息之道者，日行八百，即可以升天，功行感应，自然升举也。 古德云：功圆行满，升为金阙之臣，独步玉京之上道也。 学人若能专守三宫，朝拜真元，百节关府自然通泰，万神和畅。 相感帝君者，既存守三元，三元各有帝君也。 诵持不退，则心念正道。 谓诵持也。 身腾紫云者，内观之道乃有正说。 人有五脏属於五行，人若修炼五行，真炁传於五脏，故为实腹。 五脏真炁既成，自然尸解，出有入无，变化自在，存亡恍惚，此为得道之中也。 紫云者，五行真炁结成紫云，乃是上天之诰命之炁。 故凡得道之人皆乘紫云而去，上升三境，朝拜太上高尊，以表得道人证於尊贵之貌也。 太上老君说常清静经注竟 ● 此句与以下文义不符，侯善渊、刘通微本为『静者动之基』 。",
      "translated_text": "Thus, one must cherish and protect them.\n\nIt is also said: \"Immortal adepts and Daoist masters are not divine by nature—they accumulate essence and amass qi to attain perfection.\" For all who study the Dao, if they can refine and employ their vital essence, visualize spirit and qi, pay homage to the Three Origins, and persist in their practice without retreat, they will naturally attain the true Dao after long cultivation. Thus, the sages declare: \"The heart commands qi and spirit; if one knows how to guide the master of qi, one becomes an immortal.\" This clarifies the method of visualization, wherein all is directed by the heart.\n\nWhen merit is complete and virtue perfected, one resonates with the Sovereign Lords. Through unwavering recitation and devotion, the body ascends upon purple clouds. This describes the fruition of Daoist practice.\n\nWhen merit reaches eight hundred and conduct fulfills three thousand—merit and conduct here refer to the achievements of cultivation—if a practitioner can master the art of embryonic breathing, performing eight hundred cycles daily, they may ascend to heaven. Through the resonance of merit and conduct, they will naturally rise.\n\nThe ancients said: \"When merit is complete and conduct fulfilled, one ascends as a minister of the Golden Towers, walking alone upon the Jade Capital as a perfected adept.\"\n\nIf a practitioner can focus on the Three Palaces, pay homage to the True Origin, the hundred joints and gates of the body will naturally open and harmonize, while the myriad spirits will be at peace.\n\nResonating with the Sovereign Lords occurs when one guards and visualizes the Three Origins, each of which is presided over by a Sovereign Lord. Unwavering recitation and devotion ensure the mind remains aligned with the true Dao—this is the practice of recitation.\n\nAscending upon purple clouds follows the proper method of inner contemplation. Humans possess five viscera corresponding to the five phases. If one cultivates the five phases, true qi permeates the five viscera, filling the abdomen. Once the true qi of the five viscera is perfected, one naturally undergoes liberation from the corpse, moving freely between existence and non-existence, transformation and spontaneity, presence and absence—this is the attainment of the Dao.\n\nPurple clouds are formed from the coalescence of the five phases' true qi, embodying the celestial decree of ascent. Thus, all who attain the Dao depart riding purple clouds, ascending to the Three Realms to pay homage to the Most High and Exalted One, signifying the noble realization of the perfected adept.\n\n*Annotation of the* Classic of Supreme Purity and Tranquility *by the Most High Lord Lao concludes here.*\n\n*(Note: The line \"静者动之基\" in the versions by Hou Shanyuan and Liu Tongwei does not align with the preceding text.)*",
      "overlap_context": " the Master of the Cavern of Spirit. Within the human body, it corresponds to the lower cinnabar field, the Sea of Qi in the Kidney Palace, ruled by the Sovereign Lord, governing life.\n\nThese three origins, three palaces, and three treasures—heaven and earth obtain them to be established and lose them to collapse; the human body obtains them to live and loses them to die. Thus, the *Scripture of the Yellow Court* states: \"The spirit and essence of the body—guard them carefully, never lose them.\"",
      "start_char": 12701,
      "end_char": 13167,
      "start_sentence": 724,
      "end_sentence": 746,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.783463954925537,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静经注（前蜀杜光庭）.txt",
        "category": "玉诀类"
      }
    }
  ]
}