{
  "source_id": "太上洞玄灵宝宿命因缘明经",
  "source_file": "chunked_daozang\\太上洞玄灵宝宿命因缘明经.json",
  "total_chunks": 4,
  "total_original_chars": 4291,
  "total_translated_chars": 25146,
  "total_translation_time": 127.82003259658813,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝宿命因缘明经.txt",
    "category": "本文类"
  },
  "full_translation": "The *Supreme Cavernous Mystery Numinous Treasure Sutra of Illuminating Karmic Causes and Conditions*\n\n**Title:** *The Supreme Cavernous Mystery Numinous Treasure Sutra of Illuminating Karmic Causes and Conditions*. Author unknown, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. Not recorded in the *Catalogue of Numinous Treasure Scriptures*. One scroll. Base text from the *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Division, Textual Category.\n\n---\n\nAt that time, the Supreme Dao Lord was seated in repose atop the Great Rosy Clouds, addressing the assembled perfected beings:\n\n\"The great virtue of Heaven and Earth is called the Primordial Dao. The precious virtue of Heaven and Earth is called the Originating Dao. The connecting virtue of Heaven and Earth is called the Human Dao. When these Three Daos unite in virtue, the treasures of transformation lie hidden and preserved within the primordial void, preceding the imperial transformations.\n\nNüwa had the body of a serpent; Fuxi, the form of a scaled being. Yin and Yang were in chaos, and the workings of creation had not yet divided. The Three Sages succeeded one another; the Five Emperors initiated the beginnings. The Dao was accomplished, virtue was established, and the divisions of fortune and misfortune were set.\n\nAs radiant transformations spread and flowed, karmic causes and conditions gradually arose. The tokens of good and evil shifted and moved, already manifest. In the Great Antiquity, simplicity and purity prevailed, and moral teachings were easily followed. By the Middle Antiquity, falsity gradually arose, and harm and treachery flooded the world. Oaths and trust were no longer upheld, and the root of the Dao was abandoned.\n\nYu’s virtue governed with clarity. He was famed for his merit in overseeing the waters, was recommended by Shun, and labored to regulate the mountains and rivers. He dredged and opened the Four Great Rivers, delivering and saving the myriad people. During his life, he received the abdication; after his death, he was entombed on Mount Zhong. As the Lord of the Palace of Great Yin and the Illuminating Overseer of the Water Officials, he was bestowed with the celestial talisman, and thus his drowning was averted.\n\nThe teachings of the Three Treasures ascended and transformed at this time. Excellent! Excellent! Thus was the Dao proclaimed.\"\n\nThe Dao Lord said: \"My Dao is lofty and wondrous, easily traversing the hidden and the manifest. It transforms in accordance with goodness and descends to bestow precious scriptures. Yet later generations have turned to evil, stubbornly lacking trustworthy words. They drift and stagnate together, deeply misleading their descendants, who suffer the Three Paths and Five Pains in death, enduring agonies beyond description.\n\nI ever deeply ponder this: good and evil must be distinguished. If one does not cultivate virtuous power, one will unjustly incur transgressions and resentment. You must diligently perform purification rites and forever seek liberation, passing through all calamities in body and long preserving joy. By following the teachings and transformations, prosperity and peace may be attained.\"\n\nThe Dao Lord said: \"I grieve for the future, for the karmic entanglements of life and death, sin and blessing. Only through the accumulation of goodness does one receive felicity, for the rewards of fortune arise naturally. Those who attain the essence of the Dao may also ascend as immortals.\"\n\nYin-sheng bowed his head and said: \"Excellent! Excellent! Now that I have received the precepts, may they be proclaimed and disseminated without end.\n\nWhen Yao existed, there were Shun and Yu—what karmic causes, what conditions, led them to be born with sagely wisdom, to enjoy long-lasting reigns, and to labor in regulating the waters, their merits manifest in the world? Why do I suffer hardship and distress? Why do I endure such bitterness and sorrow, afflicted with pain and without joy? What profound virtue have I possessed to become a celestial being? What hidden merit have I accumulated to stabilize my ascent as a flying immortal, to avoid the Eight Difficulties, and to protect and deliver my descendants?\n\nNow, with my head bowed and tears flowing, I beseech you to reveal these causes and conditions.\"\n\nThe Dao Lord said: \"Excellent! Excellent! Your question is most fitting. You may fully expound the precepts for future generations.\n\nMy precepts on karmic causes and conditions, on life and death, sin and blessing, are resplendently clear. I only wish that later generations will clearly inherit the teachings and transformations. The Dao of Heaven is impartial, yet it bestows its favor upon the good.\n\nBe cautious! Be cautious! Speak as I have spoken.\"\n\nThe Dao Lord said: \"The supreme and unexcelled Dao of the Three Realms transforms all through the numinous, striving to deliver the multitudes and universally save sentient beings. To attain liberation from the Five Turbidities—can such merit be spoken of?\n\nNow, as the Five Poisons arise, driving out the rebellious and wicked throughout the world, distinguishing the worthy from the good, I fear you may fall into evil and be reborn among beasts. For this, I grieve and sorrow—what can be done?\n\nThe Dao Lord said: At that time, rulers and ministers will contend, with no distinction between good and evil, great and small, noble and base, teacher and friend. All will suffer violent misfortune, perishing in body and name, not one in ten thousand spared. Those who cultivate no virtue in life will meet such calamity. Harboring jealousy within, lacking kindness and compliance, slandering one another, their gazes confused and deluded—such people will fall into hells and hungry ghost realms.\n\nSeeking fleeting glory, they neglect to cultivate blessings, failing to guard against future lives of foul stench, humiliation, and torment—can such suffering be spoken of?\n\nYin-sheng asked: \"For those in future generations who face the misfortunes of kalpas, by what method may they be instructed?\"\n\nTruly, I pity all beings. Those who receive good retribution do so by virtue of great merit, attaining favorable conditions. In death, they escape the Three Wretched Realms and Five Sufferings, ascending forever to halls of fortune where clothing and food arise naturally. This may indeed be called excellent! Excellent!\n\nYin-sheng said: \"As Your Sagely Lordship has spoken, I ask: by what causes and conditions does one attain birth as an immortal of noble rank—something most desirable and joyful? By what causes and conditions is one born among ordinary mortals? By what causes and conditions does one fall into the earthly prisons, where suffering defies description? By what causes and conditions is one born among slaves and servants, despised by others, afflicted and joyless? By what causes and conditions is one born among the virtuous and steadfast, their body and speech fragrant and pure, revered by all? By what causes and conditions is one born among the coarse and ugly, constantly enduring scorn and humiliation, their conduct unwholesome? By what causes and conditions is one born in ease and leisure, esteemed by others, constantly receiving offerings, their wishes fulfilled?\n\nI only wish to be enlightened regarding the source of liberation, to attain deliverance, to forever enjoy blessings and treasures, and to dwell in such prosperity that suffering and heat never touch me.\"\n\nThe Dao Lord said: \"Listen carefully to my precepts and ponder my earnest words. Now, for your sake, I shall fully expound the essential and wondrous.\n\nThe response to virtue manifests in six matters:\nFirst, a compassionate heart that does not kill living beings, nurturing all things and universally delivering them to safety.\nSecond, cherishing the worthy and good, refraining from thievery, desiring only to give alms and relieve the destitute.\nThird, maintaining a chaste and pure heart, single-mindedly advancing with diligence, forsaking sensual pleasures, and never violating the precepts.\nFourth, sincerity and integrity, never deceiving others, guarding one’s speech to avoid transgressions, and refraining from greed and impurity.\nFifth, never indulging in drunkenness, which defiles the pure and worthy.\nSixth, revering and believing in the Dao with awe.\n\nPracticing these six matters, one is born among the celestials, roaming freely as a flying immortal, with clothing, food, and attendants provided. Revered by others, one becomes a teacher and friend. At such a time of blessing, the Dao ever praises:\n\n*By not killing, one attains longevity,*\n*Free from pain, ever apart from suffering.*\n*All ascend to heavenly ranks,*\n*Body at peace, finding refuge.*\n\n*By not stealing, one remains noble and pure,*\n*Wealth and treasures naturally gather.*\n*Palaces of seven jewels arise,*\n*Joy and ease abide in tranquility.*\n\n*By not engaging in licentiousness, one avoids disorder,*\n*The body remains perpetually pure.*\n*One’s births are upright and proper,*\n*Cultivating virtue, naturally wise.*\n\n*By not deceiving, one’s breath is fragrant,*\n*Speech ever loyal and true.*\n*Words emerge from the primordial Dao,*\n*Discourse brings accomplishment.*\n\n*By not drinking to excess, one avoids errors,*\n*Ever wishing to behold flowers and fruit,*\n*Attended by celestials.*\n*At life’s end, ascending to heaven,*\n*The twenty-five spirits welcome.*\n*Myriad blessings descend of themselves,*\n*Radiance ever resplendent.*\n\nThe Dao Lord said: \"Next, six further matters lead to birth among humans.\n\nWhat are these six?\nFirst, giving alms to relieve the destitute, ever mindful of the suffering of the poor.\nSecond, upholding the precepts with diligence, never committing the Ten Evils.\nThird, enduring insults with forbearance, never speaking recklessly.\nFourth, exhorting the foolish and obstinate, urging them to reverence and caution.\nFifth, wholeheartedly serving the Dao, practicing kindness and loyalty to the utmost.\nSixth, loving life and hating killing, never acting wrongfully.\n\nPracticing these six matters, one is born among humans, ever prosperous and noble, their wishes fulfilled wherever they turn. Through vast generosity, one is reborn as a human king, revered by all nations. Such virtue is praised by the Dao:\n\n*By giving alms, one attains great fortune,*\n*Wealth and treasures naturally come.*\n*One’s births are ever noble,*\n*Transmitting joy through generations.*\n\n*By upholding precepts, one remains reverent,*\n*Receiving the nine honored ones.*\n*With diligence, never committing evil,*\n*One preserves the body’s longevity.*\n\n*By enduring insults, humbling oneself,*\n*Anger never shapes the mouth.*\n*Though reviled, one bears it in silence,*\n*Blessings and longevity ever natural.*\n\n*By advancing diligently, never lax,*\n*Mindful of the Dao, one attains truth.*\n*Conduct aligning with the Dao,*\n*At life’s end, one becomes a celestial.*\n\n*By mindful truth, never retreating,*\n*Loyal and true, never deceitful,*\n*Honoring all virtuous ones,*\n*One’s births know no hardship.*\n\n*Practicing these six virtues,*\n*One is born as a human,*\n*Countenance upright and proper,*\n*Naturally becoming noble.*\n\nThe Dao Lord said: \"Further, there are seven vile karmic conditions that, upon death, cast one into hell, where one is tortured for kalpas without end.\n\nWhat are these seven?\nFirst, disloyalty and unfiliality, reviling the honored Dao, dying prematurely or maimed, falling into hell to be tortured for tens of thousands of years.\nSecond, falsely invoking spirits and gods, cursing the good, suffering calamities and torments too grievous to speak of.\nThird, destroying sacred halls, disrespecting the Three Honored Ones, enduring severe punishment, agony clinging to the body.\nFourth, skepticism and lack of faith, denying spirits and gods, perversely defiling the Three Luminaries, suffering myriad illnesses, ever bound in heavenly prisons. Moving amidst a hundred evils, their children are born crippled or maimed, falling prematurely into hell to endure ten thousand years of suffering.\"\n\nFifth, those whose bones and blood share no true kinship, whose closest kin betray and harm one another, who slander and defame spirits and gods, who are filthy and insolent, never pure or clean, who cruelly reject the truth at their core—these suffer premature death, never reaching their allotted years, and fall into hell, where myriad torments cling to them.\n\nSixth, those who rebel and defy the law, who shackle and imprison their fathers or lords, who show no reverence or love for elders, whose mouths spew wickedness first, whose bodies are flayed and butchered, who die young without atoning for their transgressions, and whose later lives are torn by tigers—calamity flows to their descendants.\n\nSeventh, those afflicted with jealousy and malice, who are perverse and domineering, whose faults and evils never leave them, who encounter misfortune and disaster, and who die to enter hell, where they fall into cauldrons of boiling liquid for ten thousand kalpas.\n\nSuch are these evil deeds. The Dao intones:\n\nStingy and greedy, refusing to give,\nStealing in secret, neglecting kin.\nHoarding wealth, craving false honor,\nNever aiding the aged or poor.\nWife and children, servants below,\nLeft unclothed, starving in cold.\nSitting idle, guarding their gold,\nThey die to become starving ghosts, maimed.\nNever sated, their bodies break out in sores,\nBegging in vain, their clans all perish.\nGossiping, stirring strife with their tongues,\nIn life and death, flayed and torn.\nMolten bronze poured down their throats,\nTongues ripped out, half their bodies long.\nForced to swallow, burning their mouths,\nTheir guts and stomachs rot within.\nNever thinking of good in life,\nIn death, they sink into ash and flame.\nMalicious, belittling others,\nTortured for tens of thousands of years.\nWhen their sins are exhausted, they emerge,\nOnly to be born as the lowliest of men.\nThe utterly wicked, delighting in slaughter,\nThieves and robbers, violent and cruel—\nMaimed, they enter hell,\nFor ten thousand kalpas, plagued by disaster.\n\nThe Dao Lord says: There are also five evils that cause one to be reborn among beasts.\nFirst, breaking precepts and stealing, refusing to repay debts.\nSecond, lusting after close kin, showing no reverence for Heaven and Earth.\nThird, wrongfully harming the innocent, swearing false oaths without regard for the law.\nFourth, seeing goodness and not rejoicing, hearing of evil and following it—such ones suffer brutal torture in life, and calamity flows to their descendants.\nFifth, deceiving superiors and deluding subordinates, serving their lords without loyalty, abusing their positions and power, framing the loyal and good, delighting in butchery, flaying oxen and sheep alive—pain and torment unbearable, their hearts like jackals and wolves.\n\nFor these five deeds, one falls into the hells of the Five Peaks, reborn among beasts, tormented by the five poisons. Wise and foolish alike share this fate. Such is the retribution. The Dao intones:\n\nEver harboring thieving thoughts,\nRefusing to repay debts.\nKilling for sport, hunting without restraint,\nEngaging in unlawful worldly ties.\nActing without sincerity or faith,\nFlying into rage at the slightest word.\nUnaware of their own sins,\nPreferring evil, disbelieving truth.\nLater, they fall among beasts,\nAs oxen, sheep, donkeys, or horses.\nStinking and foul, forever burdened,\nTormented thus for ten thousand kalpas.\nLusting after kin, committing heinous crimes,\nStruck down by lightning and thunder.\nDead, they sink into hell,\nHung upside down, roasted by fire.\nGossiping, slandering the true Dao,\nLater, enduring extreme suffering.\nMolten bronze poured down their throats,\nForever hungry and cold.\n\nThe Dao Lord says: There are also five virtues that lead to noble birth, earning the respect of all, upheld throughout the world, the heart’s desire of all people.\nWhat are these five virtues?\nFirst, giving without stinginess, bestowing kindness universally, aiding the poor and desperate in their time of need, their merit spreading to the eight directions.\nSecond, reverently serving the supreme Dao, honoring the Three Treasures.\nThird, focusing the mind on fasting and purification, cultivating stillness, gentleness, humility, and deference to others.\nEnduring humiliation without seeking redress, reflecting on oneself in the Dao—such ones ascend to immortality in name.\nFifth, delighting in refining Dao and qi, firmly believing in celestial patterns, entrusting the heart to the Dao, the Dao ever present within, penetrating the nine palaces, attaining earthly immortality. The foolish masses of the world dismiss this as untrue. Yet the proof is thus. The Dao intones:\n\nGiving freely, never stingy,\nAiding all, bringing peace.\nIn this life, receiving purity and nobility,\nIn the world, witnessing ascent to immortality.\nRevering the virtuous and the Dao,\nFasting to see true spirits.\nStill in thought, unwavering in heart,\nSeven generations ascend to heaven.\nEnduring insults without anger,\nIn life, ever upright and true.\nStudying, delighting in virtue and the Dao,\nBecoming the most honored among men.\nCultivating a gentle and yielding heart,\nHumble and modest toward others.\nRescuing the desperate, saving the imperiled,\nAttaining long life.\nReverently upholding the Precepts of the Numinous Treasure,\nClearly refining the Dao of the Nine Palaces.\nEntrusting the heart to emptiness and non-being,\nLiving as long as Heaven itself.\n\nThe Dao Lord says: There are also five evils that cause one to be born as a lowly person, a slave or servant.\nWhat are these five evils?\nFirst, arrogance and disrespect toward parents.\nSecond, stubbornness and defiance, lacking reverence and deference.\nThird, dissipation and disregard for the Three Treasures.\nFourth, self-will and theft.\nFifth, fleeing to evade debts, refusing to repay.\n\nThese five deeds cause one to be born as a lowly person, a slave or servant, beaten and humiliated, forever hungry and cold, never satisfied in life. The Dao intones:\n\nThere are those foolish and ignorant,\nArrogant and disrespectful to parents.\nLacking reverence and deference,\nLater born as lowly people.\nSeeing treasures and showing no respect,\nDefiant toward elders.\nActing without kindness or filial piety,\nLater born as slaves or servants.\nClothing and food dependent on others,\nDriven and beaten day and night.\nBorn to endless suffering,\nIn death, never escaping torment.\nDissolute, delighting in lust,\nUtterly disbelieving in spirits and gods.\nLater, suffering hunger and cold,\nAll their deeds meet with hardship.\nRefusing to repay debts, cursing instead,\nPoor and wretched, reviling ancestors.\nLater, born as oxen or sheep,\nTormented and oppressed by others.\n\nThe Dao Lord says: There are also five virtuous deeds that ensure one encounters good conditions, is born among humans, with fragrant breath and a pure body, ever at peace in heart and mind, respected and honored by all.\nWhat are these five virtues?\nFirst, wholeheartedly believing in truth, never deceiving others in life.\nSecond, reciting scriptures and practicing the Dao, single-minded and unwavering.\nThird, diligently fasting and purifying, delighting in the immortal Dao.\n\nFourth, teaching others to do good, never committing wrong or evil.\nFifth, being sincere and compassionate, aiding those in urgent need, steadfast in faith and free from doubt.\nThese five virtues ensure birth among the noble, with fragrant breath and no reckless transgressions, ever at peace in heart and mind, revered and followed by all. Throughout life, they remain free from poverty. With long accumulation of merit, they gradually attain the rank of celestial immortals.\n\nSuch are the rewards of virtue. The Dao proclaims in verse:\nDevoted to faith, embracing the Way of life,\nA compassionate heart ever mourns for the suffering.\nWith pure meals and a spotless body,\nThey ascend to the celestial mechanism after transformation.\nReverent toward the Three Treasures,\nNever arrogant toward parents.\nUtterly sincere, never deceitful,\nSuch is the person of loyalty and filial piety.\nGuarding the mouth from reckless speech,\nThe mind’s actions encompass all.\nExhorting others to shun sinful sights,\nMindful of the Dharma, never transgressing.\nAiding the destitute and rescuing the desperate,\nTheir merit and virtue are profoundly great.\nThey lengthen their lifespan and increase their years,\nEnjoying lifelong joy and peace.\nForming friendships with magnanimous righteousness,\nRespecting one another as parents.\nSuppressing evil and extolling virtuous power,\nFilial piety and brotherly love move the gods and spirits.\n\nThe Dao Lord says: There are also six inauspicious deeds. Those who practice them lack the Way, their bodies steeped in filth and defilement, their forms base and emaciated, ever meeting with hunger and cold.\nWhat are these six evils?\nFirst, deceitful and lacking sincerity.\nSecond, utterly disbelieving in the true Dao, seeking to destroy the Dharma upon hearing it, inherently devoid of goodness, constantly subjected to slander.\nThird, disregarding virtuous precepts, mocking the perfected.\nFourth, defiling and humiliating elders, their conduct erratic.\nFifth, harboring malicious and rebellious hearts, slandering the virtuous.\nSixth, minds ever fixed on evil, prone to groundless rage.\nBorn among the lowly, they endure constant hunger and cold, driven by others day and night without respite. Their bodies reek, and they never know joy.\n\nThe Dao proclaims in verse:\nDeceitful, fond of reckless speech,\nEver lacking in true sincerity.\nHeart and mouth at odds,\nTheir forms ever steeped in filth and disgrace.\nRebellious and evil, delighting in slander,\nThey fall into hell upon death.\nMolten bronze poured into their mouths,\nEnduring bitter torment in eternal darkness.\nAddicted to wine and fond of cursing,\nDisbelieving in spirits and gods.\nIron hooks seize their tongues,\nTheir agony beyond words.\nIf they are reborn among humans,\nTheir breath is ever foul and rank.\nHated and despised by others,\nBeset by misfortunes on all sides.\nEvil thoughts constantly befall them,\nEvery direction meets with punishment.\nEntangled in unexpected calamities,\nNo torment they do not endure.\nUpon death, they return to hell,\nLater reborn as beasts.\nTrapped in the cycle of the five poisons,\nTheir lives filled with sorrow, shame, and humiliation.\n\nThe Dao Lord says: There are also five virtues that ensure one is born in favorable conditions, ever abiding in the Dao and its teachings, respected by all, their words always heeded. With five hundred merits accumulated, they later encounter immortal lords.\nIn their next life, they become Daoist practitioners, learned and enlightened.\nThe five supreme virtues align with the subtle and imperceptible:\nFirst, delighting in the immortal truth, reverently serving the Three Treasures, chanting scriptures and performing the Dharma Wheel, wandering through kalpas, offering incense and abiding in emptiness, ascending to transcend suffering.\nSecond, journeying with immortal sages, their merit and virtue safeguarding their bodies.\nThird, wishing to be born among humans, refining the Dao of the Three Origins.\nFourth, reciting the Shangqing scriptures, satiated without eating.\nFifth, roaming the void, their karmic obstructions overturned in an instant.\n\nSuch are the rewards of virtue. The Dao proclaims in verse:\nReverently embracing the Three Virtues,\nProclaiming and exhorting good deeds.\nWishing to meet immortal sages,\nEver to be visited by perfected beings.\nWishing to nurture all the worthy,\nEqual to oneself without distinction.\nMy heart purified and serene,\nRadiant with the Dao’s hundred sincerities.\nDay and night diligently cultivating and learning,\nWisdom makes them celestial beings.\nYin Sheng transformed in the western lands,\nUniversally guiding all to know the true Dao.\nDevoted to contemplating the immortal truth,\nTheir accumulated thoughts never differ.\nFirst wishing to ascend and roam the void,\nCommuning with the subtle and imperceptible.\nAccumulating goodness without tiring,\nBestowing kindness without stinginess.\nTheir merit and virtue move the immortal sages,\nWho naturally bestow the elixir.\nThe Dao Lord says: Practicing this Dharma in the world,\nOne transcends the Three Realms.\nThe foremost Dharma is the Shangqing,\nSoaring transformations in harmony with the Cavern Realms.\nNext, through countless kalpas,\nThey manifest as Tathāgatas, their roots the same but teachings slightly varied.\nLater, their teachings reach the farthest barbarians.\nThe ten directions and China,\nThe hardest to transform are those in the west.\nI, the Dao, was Laozi,\nGuiding Yin Sheng at the time,\nUttering the Five Thousand Words,\nRefining the womb for ten years,\nCirculating the heavens thrice,\nCompleting the foundation of perfect fortune.\nOnly my Dao practices goodness,\nSeeing this, deeply take heed.\n\nThe *Supreme Cavern Mystery Numinous Treasure Sutra on Karmic Causes and Conditions of Past Lives* concludes.\n*(Note: \"Ming Jing\" should read \"Miao Jing.\")*\n*(Note: This section appears to be missing the fourth item.)*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝宿命因缘明经 经名：太上洞玄灵宝宿命因缘明经。 撰人不详，约出於南北朝或隋唐。 《灵宝经目》着录未出。 一卷。 底本出处：《正统道藏》洞玄部本文类。 太上洞玄灵宝宿命因缘明经 尔时太上道君宴景太霞之上，喻诸侍真曰：天地之大德曰元道，天地之宝德曰始道，天地之系德曰人道。 三道合德，宝化隐存，虚无之元，皇化之先。 女娲蛇躯，伏羲鳞身，阴阳混沌，造化未分。 三圣相禅，五帝造端，道成德就，吉凶部分。 光化敷流，渐生因缘，善恶之符，变动已然。 太古淳朴，风教易因。 中古渐伪，害贼滔天，表信不行，违道本源。 禹德治明，监水之勋，为舜所举，治劳山川，开通四渎，济度万民，生受禅逊，殁治钟山。 太阴宫主，明监水官，天授宝符，过溺乃全。 三宝之法，於斯升化，善哉善哉，道乃宣焉。 道君曰：吾道高妙，幽显易通，随善而化，降致宝文。 后世转恶，笃无信言，相与流滞，深误子孙，死遭三徒五苦，痛忍难言。 每深念之，善恶当分，善德不修，横罹罪怨。 子勤修斋，永求得脱，身度诸灾，长保欢欣，得顺教化，隆泰可言。 道君曰：吾忧念将来，生死罪福，宿命所缠，积善乃庆，福报自然，有道之精，得之亦仙度也。 尹生稽首曰：善哉善哉。 今受戒文，宣流无亲。 尧存有舜禹，何等宿命，何等因缘，生而圣知，享祚永延，治水之劳，功见世间。 余有何故，屯否悴然。 复何苦恼，楚痛不欢。 复何厚德，乃为天人。 有何阴德，克定飞仙，不遭八难，保度子孙。 今以叩头流涕，请知因缘。 道君曰：善哉，善哉。 子之所问甚是。 来世之戒，子可具说。 吾戒宿命因缘，生死罪福，灼灼甚明，惟愿后世明承教化，天道无亲，唯与善人。 慎之，慎之。 说如吾言。",
      "translated_text": "The *Supreme Cavernous Mystery Numinous Treasure Sutra of Illuminating Karmic Causes and Conditions*\n\n**Title:** *The Supreme Cavernous Mystery Numinous Treasure Sutra of Illuminating Karmic Causes and Conditions*. Author unknown, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. Not recorded in the *Catalogue of Numinous Treasure Scriptures*. One scroll. Base text from the *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Division, Textual Category.\n\n---\n\nAt that time, the Supreme Dao Lord was seated in repose atop the Great Rosy Clouds, addressing the assembled perfected beings:\n\n\"The great virtue of Heaven and Earth is called the Primordial Dao. The precious virtue of Heaven and Earth is called the Originating Dao. The connecting virtue of Heaven and Earth is called the Human Dao. When these Three Daos unite in virtue, the treasures of transformation lie hidden and preserved within the primordial void, preceding the imperial transformations.\n\nNüwa had the body of a serpent; Fuxi, the form of a scaled being. Yin and Yang were in chaos, and the workings of creation had not yet divided. The Three Sages succeeded one another; the Five Emperors initiated the beginnings. The Dao was accomplished, virtue was established, and the divisions of fortune and misfortune were set.\n\nAs radiant transformations spread and flowed, karmic causes and conditions gradually arose. The tokens of good and evil shifted and moved, already manifest. In the Great Antiquity, simplicity and purity prevailed, and moral teachings were easily followed. By the Middle Antiquity, falsity gradually arose, and harm and treachery flooded the world. Oaths and trust were no longer upheld, and the root of the Dao was abandoned.\n\nYu’s virtue governed with clarity. He was famed for his merit in overseeing the waters, was recommended by Shun, and labored to regulate the mountains and rivers. He dredged and opened the Four Great Rivers, delivering and saving the myriad people. During his life, he received the abdication; after his death, he was entombed on Mount Zhong. As the Lord of the Palace of Great Yin and the Illuminating Overseer of the Water Officials, he was bestowed with the celestial talisman, and thus his drowning was averted.\n\nThe teachings of the Three Treasures ascended and transformed at this time. Excellent! Excellent! Thus was the Dao proclaimed.\"\n\nThe Dao Lord said: \"My Dao is lofty and wondrous, easily traversing the hidden and the manifest. It transforms in accordance with goodness and descends to bestow precious scriptures. Yet later generations have turned to evil, stubbornly lacking trustworthy words. They drift and stagnate together, deeply misleading their descendants, who suffer the Three Paths and Five Pains in death, enduring agonies beyond description.\n\nI ever deeply ponder this: good and evil must be distinguished. If one does not cultivate virtuous power, one will unjustly incur transgressions and resentment. You must diligently perform purification rites and forever seek liberation, passing through all calamities in body and long preserving joy. By following the teachings and transformations, prosperity and peace may be attained.\"\n\nThe Dao Lord said: \"I grieve for the future, for the karmic entanglements of life and death, sin and blessing. Only through the accumulation of goodness does one receive felicity, for the rewards of fortune arise naturally. Those who attain the essence of the Dao may also ascend as immortals.\"\n\nYin-sheng bowed his head and said: \"Excellent! Excellent! Now that I have received the precepts, may they be proclaimed and disseminated without end.\n\nWhen Yao existed, there were Shun and Yu—what karmic causes, what conditions, led them to be born with sagely wisdom, to enjoy long-lasting reigns, and to labor in regulating the waters, their merits manifest in the world? Why do I suffer hardship and distress? Why do I endure such bitterness and sorrow, afflicted with pain and without joy? What profound virtue have I possessed to become a celestial being? What hidden merit have I accumulated to stabilize my ascent as a flying immortal, to avoid the Eight Difficulties, and to protect and deliver my descendants?\n\nNow, with my head bowed and tears flowing, I beseech you to reveal these causes and conditions.\"\n\nThe Dao Lord said: \"Excellent! Excellent! Your question is most fitting. You may fully expound the precepts for future generations.\n\nMy precepts on karmic causes and conditions, on life and death, sin and blessing, are resplendently clear. I only wish that later generations will clearly inherit the teachings and transformations. The Dao of Heaven is impartial, yet it bestows its favor upon the good.\n\nBe cautious! Be cautious! Speak as I have spoken.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 686,
      "start_sentence": 0,
      "end_sentence": 35,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.478067636489868,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝宿命因缘明经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "道君曰：三界无上大道，神化一切，勉度群辈，普济众生，得度五浊之世，功可言乎。 今五毒方至，驱除天下逆恶，分别贤善，恐子堕落恶中，后生畜生中，为之哀痛，痛当奈何。 道君曰：当尔之时，君臣相伐，无善无恶，无大无小，无尊无卑，无师无友，悉受横祸，身死名灭，万无一遗。 生不修德，遭此凶灾。 内怀嫉妬，无有顺慈，更相诽谤，相视乱迷，如此之人，堕落地狱饿鬼之中。 生取一时之荣，不勤修福，防后世生臭恶，为人所困辱，屠剥痛酷，当可言乎。 尹生问曰：后生有劫数之殃，以何法训之。 实念群生，是可哀可怜，皆得善报者，由有大功，得生善缘，死离三涂五苦之中，长升福堂，衣食自然，可谓善哉善哉矣。 尹生曰：如圣君之言，请问人生有何因缘，得生仙贵，可愿可乐。 复何因缘，得生凡常人中。 复何因缘，得生地岳之中，苦痛难言。 复何因缘，得生奴婢之中，为人所憎，苦恼不欢。 复何因缘，得生贤贞好人之中，身口香洁，为人所宗。 复何因缘，生粗丑人中，恒受憎辱，触行不善。 复何因缘，得生出优游，为人所贵，常得供养，所愿从心。 如是之行，唯愿告悟解脱之源，善得济度，长受福珍，如此隆泰，苦热不婴。 道君曰：谛听吾戒，思吾苦言，今为汝曹，具说要妙。 其德之应，事唯有六。 一者慈心不杀群生，养活万物，一切济度，令得安全。 二者爱念贤良，不行盗心，唯欲布施，济恤穷贫。 三者执心贞洁，专念精进，弃远声色，不犯法戒。 四者诚信敦笃，不妄欺人，谨口肆过，不为贪浊。 五者不妄醉酒，干秽清贤。 六者执心畏敬，躬信有道。 行此六事，得生天人之上，优游飞仙，衣食行厨，为人所尊，得为师友。 尔时之庆，道常颂曰： 不杀得长寿，无痛常离苦。 一切受天位，身安得所怙。 不盗常清贵，自然钱财聚。 七宝为宫殿，欢乐当安人。 不淫则不乱，身体常洁清。 所生当端正，行德自聪明。 不欺口气香，言语常忠贞。 所说出元道，谈论使功成。 滴酒不过口，无有谬误事。 常愿见华实，得使天人侍。 寿终升天堂，二十五神迎。 万福自来降，光影恒煌煌。 道君曰：次复六事，得生人中。 何谓六事，一者布施救困穷，心念恒苦少。 二者持戒精进，不犯十恶。 三者忍辱含容，不妄宣言。 四者劝化愚顽，趣令敬慎。 五者一心奉法，慈仁尽忠。 六者好生恶杀，不妄为非。 行此六事，得生人中，富贵常遂，所向如愿，施布广大，后世得生人王，万国所宗。 德行如此，道乃颂曰： 布施得大福，钱财自然来。 所生常尊贵，传世受欢欣。 持戒常敦敬，奉受於九尊。 精敬不犯恶，保得身长存。 忍辱谦下人，嗔怒不形口。 骂詈忍不应，禄寿常自然。 精进不怠懈，念道常得真。 所行合於道，寿终为天人。 念真心不退，忠信不妄言。 供养诸道德，所生无艰艰。 能行此六善，辄得生为人。 面色端且正，自然成贵身。 道君曰：复有恶缘七丑，死入地狱，被考亿劫，无有极已。 何谓七丑。 一者不忠不孝，毁辱道尊，夭身伤残，死落地狱中，被考数万年。 二者虚引鬼神，骂詈善人，身被灾考，婴罗可言。 三者毁坏神堂，不敬三尊，身被重责，楚痛在身。 四者多疑少信，谓无鬼神，颠倒无道，裸秽三光，身婴诸苦病，恒系天牢间，动与百恶会，生子辄跛残，夭堕地狱中，万年被恶患。",
      "translated_text": "The Dao Lord said: \"The supreme and unexcelled Dao of the Three Realms transforms all through the numinous, striving to deliver the multitudes and universally save sentient beings. To attain liberation from the Five Turbidities—can such merit be spoken of?\n\nNow, as the Five Poisons arise, driving out the rebellious and wicked throughout the world, distinguishing the worthy from the good, I fear you may fall into evil and be reborn among beasts. For this, I grieve and sorrow—what can be done?\n\nThe Dao Lord said: At that time, rulers and ministers will contend, with no distinction between good and evil, great and small, noble and base, teacher and friend. All will suffer violent misfortune, perishing in body and name, not one in ten thousand spared. Those who cultivate no virtue in life will meet such calamity. Harboring jealousy within, lacking kindness and compliance, slandering one another, their gazes confused and deluded—such people will fall into hells and hungry ghost realms.\n\nSeeking fleeting glory, they neglect to cultivate blessings, failing to guard against future lives of foul stench, humiliation, and torment—can such suffering be spoken of?\n\nYin-sheng asked: \"For those in future generations who face the misfortunes of kalpas, by what method may they be instructed?\"\n\nTruly, I pity all beings. Those who receive good retribution do so by virtue of great merit, attaining favorable conditions. In death, they escape the Three Wretched Realms and Five Sufferings, ascending forever to halls of fortune where clothing and food arise naturally. This may indeed be called excellent! Excellent!\n\nYin-sheng said: \"As Your Sagely Lordship has spoken, I ask: by what causes and conditions does one attain birth as an immortal of noble rank—something most desirable and joyful? By what causes and conditions is one born among ordinary mortals? By what causes and conditions does one fall into the earthly prisons, where suffering defies description? By what causes and conditions is one born among slaves and servants, despised by others, afflicted and joyless? By what causes and conditions is one born among the virtuous and steadfast, their body and speech fragrant and pure, revered by all? By what causes and conditions is one born among the coarse and ugly, constantly enduring scorn and humiliation, their conduct unwholesome? By what causes and conditions is one born in ease and leisure, esteemed by others, constantly receiving offerings, their wishes fulfilled?\n\nI only wish to be enlightened regarding the source of liberation, to attain deliverance, to forever enjoy blessings and treasures, and to dwell in such prosperity that suffering and heat never touch me.\"\n\nThe Dao Lord said: \"Listen carefully to my precepts and ponder my earnest words. Now, for your sake, I shall fully expound the essential and wondrous.\n\nThe response to virtue manifests in six matters:\nFirst, a compassionate heart that does not kill living beings, nurturing all things and universally delivering them to safety.\nSecond, cherishing the worthy and good, refraining from thievery, desiring only to give alms and relieve the destitute.\nThird, maintaining a chaste and pure heart, single-mindedly advancing with diligence, forsaking sensual pleasures, and never violating the precepts.\nFourth, sincerity and integrity, never deceiving others, guarding one’s speech to avoid transgressions, and refraining from greed and impurity.\nFifth, never indulging in drunkenness, which defiles the pure and worthy.\nSixth, revering and believing in the Dao with awe.\n\nPracticing these six matters, one is born among the celestials, roaming freely as a flying immortal, with clothing, food, and attendants provided. Revered by others, one becomes a teacher and friend. At such a time of blessing, the Dao ever praises:\n\n*By not killing, one attains longevity,*\n*Free from pain, ever apart from suffering.*\n*All ascend to heavenly ranks,*\n*Body at peace, finding refuge.*\n\n*By not stealing, one remains noble and pure,*\n*Wealth and treasures naturally gather.*\n*Palaces of seven jewels arise,*\n*Joy and ease abide in tranquility.*\n\n*By not engaging in licentiousness, one avoids disorder,*\n*The body remains perpetually pure.*\n*One’s births are upright and proper,*\n*Cultivating virtue, naturally wise.*\n\n*By not deceiving, one’s breath is fragrant,*\n*Speech ever loyal and true.*\n*Words emerge from the primordial Dao,*\n*Discourse brings accomplishment.*\n\n*By not drinking to excess, one avoids errors,*\n*Ever wishing to behold flowers and fruit,*\n*Attended by celestials.*\n*At life’s end, ascending to heaven,*\n*The twenty-five spirits welcome.*\n*Myriad blessings descend of themselves,*\n*Radiance ever resplendent.*\n\nThe Dao Lord said: \"Next, six further matters lead to birth among humans.\n\nWhat are these six?\nFirst, giving alms to relieve the destitute, ever mindful of the suffering of the poor.\nSecond, upholding the precepts with diligence, never committing the Ten Evils.\nThird, enduring insults with forbearance, never speaking recklessly.\nFourth, exhorting the foolish and obstinate, urging them to reverence and caution.\nFifth, wholeheartedly serving the Dao, practicing kindness and loyalty to the utmost.\nSixth, loving life and hating killing, never acting wrongfully.\n\nPracticing these six matters, one is born among humans, ever prosperous and noble, their wishes fulfilled wherever they turn. Through vast generosity, one is reborn as a human king, revered by all nations. Such virtue is praised by the Dao:\n\n*By giving alms, one attains great fortune,*\n*Wealth and treasures naturally come.*\n*One’s births are ever noble,*\n*Transmitting joy through generations.*\n\n*By upholding precepts, one remains reverent,*\n*Receiving the nine honored ones.*\n*With diligence, never committing evil,*\n*One preserves the body’s longevity.*\n\n*By enduring insults, humbling oneself,*\n*Anger never shapes the mouth.*\n*Though reviled, one bears it in silence,*\n*Blessings and longevity ever natural.*\n\n*By advancing diligently, never lax,*\n*Mindful of the Dao, one attains truth.*\n*Conduct aligning with the Dao,*\n*At life’s end, one becomes a celestial.*\n\n*By mindful truth, never retreating,*\n*Loyal and true, never deceitful,*\n*Honoring all virtuous ones,*\n*One’s births know no hardship.*\n\n*Practicing these six virtues,*\n*One is born as a human,*\n*Countenance upright and proper,*\n*Naturally becoming noble.*\n\nThe Dao Lord said: \"Further, there are seven vile karmic conditions that, upon death, cast one into hell, where one is tortured for kalpas without end.\n\nWhat are these seven?\nFirst, disloyalty and unfiliality, reviling the honored Dao, dying prematurely or maimed, falling into hell to be tortured for tens of thousands of years.\nSecond, falsely invoking spirits and gods, cursing the good, suffering calamities and torments too grievous to speak of.\nThird, destroying sacred halls, disrespecting the Three Honored Ones, enduring severe punishment, agony clinging to the body.\nFourth, skepticism and lack of faith, denying spirits and gods, perversely defiling the Three Luminaries, suffering myriad illnesses, ever bound in heavenly prisons. Moving amidst a hundred evils, their children are born crippled or maimed, falling prematurely into hell to endure ten thousand years of suffering.\"",
      "overlap_context": " you to reveal these causes and conditions.\"\n\nThe Dao Lord said: \"Excellent! Excellent! Your question is most fitting. You may fully expound the precepts for future generations.\n\nMy precepts on karmic causes and conditions, on life and death, sin and blessing, are resplendently clear. I only wish that later generations will clearly inherit the teachings and transformations. The Dao of Heaven is impartial, yet it bestows its favor upon the good.\n\nBe cautious! Be cautious! Speak as I have spoken.\"",
      "start_char": 687,
      "end_char": 1958,
      "start_sentence": 36,
      "end_sentence": 100,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.714858055114746,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝宿命因缘明经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "五者骨血至不亲，孔怀相侵贼，谤诬於鬼神，浊慢不清洁，酷不信中真，以此被夭折，终不得命年，死落地狱中，苦恼婴万端。 六者反逆不顺法，械囚於父君，尊长不敬爱，口诵恶为先，形骸被屠剥，夭折不塞愆，后生被虎伤，殃流逮子孙。 七者疸癞乃嫉妬，逮戾好强梁，咎恶不离身，遭逢被灾殃，死入地狱中，万劫落镬汤。 恶事如此，道为颂曰： 悭贪不布施，私窃不养亲。 藏财贪妄贵，不救老穷人。 妻子及下使，不衣视饥寒。 端坐守财物，殁为饿鬼残。 身不见饱足，苦毒生疮瘢。 东西乞不得，家族悉灭婵。 造作弄口舌，生死被剥残。 洋铜灌其口，拔舌过身半。 沃口强令咽，入腹肠胃烂。 生时不念善，死殁被涂炭。 疽恶轻凌人，被考数万年。 罪毕复身出，便为下贱人。 元恶好杀害，盗窃反强梁。 形残入地狱，万劫被灾殃。 道君曰：又有五恶，生出畜生中。 一者犯戒窃盗，负债拒捍不还。 二者淫爱内亲，不敬天地。 三者枉横无罪人，轻誓不顾法。 四者见彼善不好，闻恶辄相从，即身被酷考，灾殃流子孙。 五者欺上罔下，事君不忠，处位乘势，枉罔忠良，酷好屠鲙，生剥牛羊，痛毒不可忍，内怀如豺狼。 凡此五事，死落地岳中，出生为畜生中，生被五毒害，贤愚一是同。 罪报如斯，道乃颂曰： 常行盗窃心，负债不肯还。 杀生好田猎，非法作俗缘。 执行无诚信，小言辄恚嗔。 罪恶不自觉，好邪不信真。 后生堕畜生，牛羊驴马类。 臭恶恒负重，如是考万劫。 内淫犯干逆，雷电所槌杀。 死没地狱中，倒悬被火粹，弄口谤真道，后生极苦难。 洋铜灌其口，常抱饥且寒。 道君曰：又有五善，得为尊贵，众人所敬，奉行天下，人心所归。 何谓五善。 一者布施无爱惜，恩惠普流通，周济救穷急，功德扬八方。 二者供奉上道，敬事三宝。 三者端意思斋戒，静柔和谦下於人● 。 受人曲辱，不求申论，道乃念己，上名升仙。 五者好炼道气，明信天文，委心任道，道恒在身，洞知九宫，克成地仙，尘俗群愚，谓之不然。 於是之验，道乃颂曰： 布施常不惜，普济令众安。 即身受清贵，世得见升仙。 供养好道德，斋戒见真灵。 静念心不懈，七祖升天堂。 忍辱无嗔怒，生辄得正端。 学问好道德，得为人中尊。 行心能柔和，谦节下於人。 救急度危厄，克得延命长。 敬奉灵宝戒，明练九宫道。 委心信虚无，寿与天同老。 道君曰：又有五恶，常生卑贱人，为人奴婢。 何谓五恶。 一者骄慢，不敬二亲。 二者刚悖，心不恭恪。 三者放荡，不礼三尊。 四者自专，盗窃在身。 五者负债逃隐，违捍不还。 是为五事，常生下贱人，为人奴婢，槌打困辱，恒抱饥寒，生不充足。 道乃颂曰： 正有痴愚者，骄慢於二亲。 无有恭恪心，后生卑贱人。 见宝不恭礼，违突於长者。 执行不慈孝，后生为奴婢。 衣食仰於人，驱打无昼夜。 受生恒苦恼，死不得免度。 放荡好淫色，至不信鬼神。 后生受饥冻，所作逢艰难。 负债反呎诅，贫苦骂先祖。 后生作牛羊，为人所困苦。 道君曰：又有好德五事，常见善缘，得生人中，口气香洁，身心常安，为人所敬贵。 何谓五德。 一者至心好信真，生不欺罔人。 二者诵经行道，专心无二。 三者勤心斋戒，好乐仙道。",
      "translated_text": "Fifth, those whose bones and blood share no true kinship, whose closest kin betray and harm one another, who slander and defame spirits and gods, who are filthy and insolent, never pure or clean, who cruelly reject the truth at their core—these suffer premature death, never reaching their allotted years, and fall into hell, where myriad torments cling to them.\n\nSixth, those who rebel and defy the law, who shackle and imprison their fathers or lords, who show no reverence or love for elders, whose mouths spew wickedness first, whose bodies are flayed and butchered, who die young without atoning for their transgressions, and whose later lives are torn by tigers—calamity flows to their descendants.\n\nSeventh, those afflicted with jealousy and malice, who are perverse and domineering, whose faults and evils never leave them, who encounter misfortune and disaster, and who die to enter hell, where they fall into cauldrons of boiling liquid for ten thousand kalpas.\n\nSuch are these evil deeds. The Dao intones:\n\nStingy and greedy, refusing to give,\nStealing in secret, neglecting kin.\nHoarding wealth, craving false honor,\nNever aiding the aged or poor.\nWife and children, servants below,\nLeft unclothed, starving in cold.\nSitting idle, guarding their gold,\nThey die to become starving ghosts, maimed.\nNever sated, their bodies break out in sores,\nBegging in vain, their clans all perish.\nGossiping, stirring strife with their tongues,\nIn life and death, flayed and torn.\nMolten bronze poured down their throats,\nTongues ripped out, half their bodies long.\nForced to swallow, burning their mouths,\nTheir guts and stomachs rot within.\nNever thinking of good in life,\nIn death, they sink into ash and flame.\nMalicious, belittling others,\nTortured for tens of thousands of years.\nWhen their sins are exhausted, they emerge,\nOnly to be born as the lowliest of men.\nThe utterly wicked, delighting in slaughter,\nThieves and robbers, violent and cruel—\nMaimed, they enter hell,\nFor ten thousand kalpas, plagued by disaster.\n\nThe Dao Lord says: There are also five evils that cause one to be reborn among beasts.\nFirst, breaking precepts and stealing, refusing to repay debts.\nSecond, lusting after close kin, showing no reverence for Heaven and Earth.\nThird, wrongfully harming the innocent, swearing false oaths without regard for the law.\nFourth, seeing goodness and not rejoicing, hearing of evil and following it—such ones suffer brutal torture in life, and calamity flows to their descendants.\nFifth, deceiving superiors and deluding subordinates, serving their lords without loyalty, abusing their positions and power, framing the loyal and good, delighting in butchery, flaying oxen and sheep alive—pain and torment unbearable, their hearts like jackals and wolves.\n\nFor these five deeds, one falls into the hells of the Five Peaks, reborn among beasts, tormented by the five poisons. Wise and foolish alike share this fate. Such is the retribution. The Dao intones:\n\nEver harboring thieving thoughts,\nRefusing to repay debts.\nKilling for sport, hunting without restraint,\nEngaging in unlawful worldly ties.\nActing without sincerity or faith,\nFlying into rage at the slightest word.\nUnaware of their own sins,\nPreferring evil, disbelieving truth.\nLater, they fall among beasts,\nAs oxen, sheep, donkeys, or horses.\nStinking and foul, forever burdened,\nTormented thus for ten thousand kalpas.\nLusting after kin, committing heinous crimes,\nStruck down by lightning and thunder.\nDead, they sink into hell,\nHung upside down, roasted by fire.\nGossiping, slandering the true Dao,\nLater, enduring extreme suffering.\nMolten bronze poured down their throats,\nForever hungry and cold.\n\nThe Dao Lord says: There are also five virtues that lead to noble birth, earning the respect of all, upheld throughout the world, the heart’s desire of all people.\nWhat are these five virtues?\nFirst, giving without stinginess, bestowing kindness universally, aiding the poor and desperate in their time of need, their merit spreading to the eight directions.\nSecond, reverently serving the supreme Dao, honoring the Three Treasures.\nThird, focusing the mind on fasting and purification, cultivating stillness, gentleness, humility, and deference to others.\nEnduring humiliation without seeking redress, reflecting on oneself in the Dao—such ones ascend to immortality in name.\nFifth, delighting in refining Dao and qi, firmly believing in celestial patterns, entrusting the heart to the Dao, the Dao ever present within, penetrating the nine palaces, attaining earthly immortality. The foolish masses of the world dismiss this as untrue. Yet the proof is thus. The Dao intones:\n\nGiving freely, never stingy,\nAiding all, bringing peace.\nIn this life, receiving purity and nobility,\nIn the world, witnessing ascent to immortality.\nRevering the virtuous and the Dao,\nFasting to see true spirits.\nStill in thought, unwavering in heart,\nSeven generations ascend to heaven.\nEnduring insults without anger,\nIn life, ever upright and true.\nStudying, delighting in virtue and the Dao,\nBecoming the most honored among men.\nCultivating a gentle and yielding heart,\nHumble and modest toward others.\nRescuing the desperate, saving the imperiled,\nAttaining long life.\nReverently upholding the Precepts of the Numinous Treasure,\nClearly refining the Dao of the Nine Palaces.\nEntrusting the heart to emptiness and non-being,\nLiving as long as Heaven itself.\n\nThe Dao Lord says: There are also five evils that cause one to be born as a lowly person, a slave or servant.\nWhat are these five evils?\nFirst, arrogance and disrespect toward parents.\nSecond, stubbornness and defiance, lacking reverence and deference.\nThird, dissipation and disregard for the Three Treasures.\nFourth, self-will and theft.\nFifth, fleeing to evade debts, refusing to repay.\n\nThese five deeds cause one to be born as a lowly person, a slave or servant, beaten and humiliated, forever hungry and cold, never satisfied in life. The Dao intones:\n\nThere are those foolish and ignorant,\nArrogant and disrespectful to parents.\nLacking reverence and deference,\nLater born as lowly people.\nSeeing treasures and showing no respect,\nDefiant toward elders.\nActing without kindness or filial piety,\nLater born as slaves or servants.\nClothing and food dependent on others,\nDriven and beaten day and night.\nBorn to endless suffering,\nIn death, never escaping torment.\nDissolute, delighting in lust,\nUtterly disbelieving in spirits and gods.\nLater, suffering hunger and cold,\nAll their deeds meet with hardship.\nRefusing to repay debts, cursing instead,\nPoor and wretched, reviling ancestors.\nLater, born as oxen or sheep,\nTormented and oppressed by others.\n\nThe Dao Lord says: There are also five virtuous deeds that ensure one encounters good conditions, is born among humans, with fragrant breath and a pure body, ever at peace in heart and mind, respected and honored by all.\nWhat are these five virtues?\nFirst, wholeheartedly believing in truth, never deceiving others in life.\nSecond, reciting scriptures and practicing the Dao, single-minded and unwavering.\nThird, diligently fasting and purifying, delighting in the immortal Dao.",
      "overlap_context": "suffering calamities and torments too grievous to speak of.\nThird, destroying sacred halls, disrespecting the Three Honored Ones, enduring severe punishment, agony clinging to the body.\nFourth, skepticism and lack of faith, denying spirits and gods, perversely defiling the Three Luminaries, suffering myriad illnesses, ever bound in heavenly prisons. Moving amidst a hundred evils, their children are born crippled or maimed, falling prematurely into hell to endure ten thousand years of suffering.\"",
      "start_char": 1958,
      "end_char": 3184,
      "start_sentence": 101,
      "end_sentence": 177,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.2277147769928,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝宿命因缘明经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "四者教人行善，不为非恶。 五者敦笃慈仁，周济急难，多信不惑。 斯之五善，并生贵人之中，口气香洁，不妄犯非，心意常安，为人所宗奉，终身不贫，积功之久，渐见天仙。 善报如斯，道以颂曰： 笃信好生道，慈心常哀哀。 素餐身清洁，化后登天机。 恭奉於三宝，不骄於二亲。 至诚不欺诈，是行忠孝人。 谨口不妄语，行心周一切。 劝人远罪目，念法不违戾。 周穷救危急，功德甚重大。 增算益年寿，终身受欣泰。 结友行义弘，相敬如父母。 闭恶扬善德，孝悌感神灵。 道君曰：又有六不祥，所行既无道，恶秽堕在身，形骸卑且悴，出辄逢饥寒。 何谓六恶。 一者期弄无诚信。 二者至不信真道，闻法辄欲坏，素无好善心，恒被诽谤言。 三者不念善戒，调弄真人。 四者秽辱长老，所行多端。 五者毒心凶悖，谗佞善人。 六者心恒念恶，无端恚怒，得生贱人，常抱饥寒，给人驱使，昼夜无宽，身体臭恶，常不得欣。 道乃以颂曰： 欺诈好妄语，常无至信诚。 心口自相反，恒受秽辱形。 悖恶好诽谤，死落地狱中。 洋铜灌其口，苦毒长冥冥。 湎酒好骂詈，不信有鬼神。 铁钩着其舌，痛恼当可言。 脱当生人中，口气常腥臭。 为人所憎恶，众灾所克注。 恶念常遭逢，所向遇罪刑。 无端横婴罗，痛毒靡不经。 死复还地狱，后身作畜生。 辗转五毒中，愁恼憀辱生。 道君曰：又有五德，所生得好处，常在道法中，众人所敬重，所言无不从，积善满五百，后身见仙公。 次生得作道士，好学多开通。 上愿五德者，上与希微同。 一德乐仙真，奉敬事三宝，咏经行法轮，周游还劫老，上香存虚无，升度离苦恼。 二德仙贤游，功德为身保。 三德愿人中，明炼三元道。 四德颂上清，不食自充饱。 五德游虚空，罪滞一时倒。 善报如斯，道以颂曰： 奉敬归三德，宣化劝善事。 愿得见仙贤，长得真人至。 愿抚一切贤，与我等无异。 吾我心平蠲，练练道百诚。 昼夜勤修学，智慧为天人。 尹生西地化，普使知道真。 笃好思仙真，积念无不同。 先愿升虚游，上与希微通。 积善不厌多，布惠勿吝惜。 功德感仙真，自然降丹药。 道君曰：随世行是法，复出三界道，法一为上清，飞化契洞真。 次为无量劫，分身号如来，根同化小异，后教极边夷。 十方法中国，难化是成西，道吾为老氏，携导尹生时，口吐五千言，练胞一十年，周天乃三匝，会合全福基。 唯我道行善，见而深慎之。 太上洞玄灵宝宿命因缘明经竟 ● 明经：当作「妙经」。 ● 案此处当有缺文，缺第四条目。",
      "translated_text": "Fourth, teaching others to do good, never committing wrong or evil.\nFifth, being sincere and compassionate, aiding those in urgent need, steadfast in faith and free from doubt.\nThese five virtues ensure birth among the noble, with fragrant breath and no reckless transgressions, ever at peace in heart and mind, revered and followed by all. Throughout life, they remain free from poverty. With long accumulation of merit, they gradually attain the rank of celestial immortals.\n\nSuch are the rewards of virtue. The Dao proclaims in verse:\nDevoted to faith, embracing the Way of life,\nA compassionate heart ever mourns for the suffering.\nWith pure meals and a spotless body,\nThey ascend to the celestial mechanism after transformation.\nReverent toward the Three Treasures,\nNever arrogant toward parents.\nUtterly sincere, never deceitful,\nSuch is the person of loyalty and filial piety.\nGuarding the mouth from reckless speech,\nThe mind’s actions encompass all.\nExhorting others to shun sinful sights,\nMindful of the Dharma, never transgressing.\nAiding the destitute and rescuing the desperate,\nTheir merit and virtue are profoundly great.\nThey lengthen their lifespan and increase their years,\nEnjoying lifelong joy and peace.\nForming friendships with magnanimous righteousness,\nRespecting one another as parents.\nSuppressing evil and extolling virtuous power,\nFilial piety and brotherly love move the gods and spirits.\n\nThe Dao Lord says: There are also six inauspicious deeds. Those who practice them lack the Way, their bodies steeped in filth and defilement, their forms base and emaciated, ever meeting with hunger and cold.\nWhat are these six evils?\nFirst, deceitful and lacking sincerity.\nSecond, utterly disbelieving in the true Dao, seeking to destroy the Dharma upon hearing it, inherently devoid of goodness, constantly subjected to slander.\nThird, disregarding virtuous precepts, mocking the perfected.\nFourth, defiling and humiliating elders, their conduct erratic.\nFifth, harboring malicious and rebellious hearts, slandering the virtuous.\nSixth, minds ever fixed on evil, prone to groundless rage.\nBorn among the lowly, they endure constant hunger and cold, driven by others day and night without respite. Their bodies reek, and they never know joy.\n\nThe Dao proclaims in verse:\nDeceitful, fond of reckless speech,\nEver lacking in true sincerity.\nHeart and mouth at odds,\nTheir forms ever steeped in filth and disgrace.\nRebellious and evil, delighting in slander,\nThey fall into hell upon death.\nMolten bronze poured into their mouths,\nEnduring bitter torment in eternal darkness.\nAddicted to wine and fond of cursing,\nDisbelieving in spirits and gods.\nIron hooks seize their tongues,\nTheir agony beyond words.\nIf they are reborn among humans,\nTheir breath is ever foul and rank.\nHated and despised by others,\nBeset by misfortunes on all sides.\nEvil thoughts constantly befall them,\nEvery direction meets with punishment.\nEntangled in unexpected calamities,\nNo torment they do not endure.\nUpon death, they return to hell,\nLater reborn as beasts.\nTrapped in the cycle of the five poisons,\nTheir lives filled with sorrow, shame, and humiliation.\n\nThe Dao Lord says: There are also five virtues that ensure one is born in favorable conditions, ever abiding in the Dao and its teachings, respected by all, their words always heeded. With five hundred merits accumulated, they later encounter immortal lords.\nIn their next life, they become Daoist practitioners, learned and enlightened.\nThe five supreme virtues align with the subtle and imperceptible:\nFirst, delighting in the immortal truth, reverently serving the Three Treasures, chanting scriptures and performing the Dharma Wheel, wandering through kalpas, offering incense and abiding in emptiness, ascending to transcend suffering.\nSecond, journeying with immortal sages, their merit and virtue safeguarding their bodies.\nThird, wishing to be born among humans, refining the Dao of the Three Origins.\nFourth, reciting the Shangqing scriptures, satiated without eating.\nFifth, roaming the void, their karmic obstructions overturned in an instant.\n\nSuch are the rewards of virtue. The Dao proclaims in verse:\nReverently embracing the Three Virtues,\nProclaiming and exhorting good deeds.\nWishing to meet immortal sages,\nEver to be visited by perfected beings.\nWishing to nurture all the worthy,\nEqual to oneself without distinction.\nMy heart purified and serene,\nRadiant with the Dao’s hundred sincerities.\nDay and night diligently cultivating and learning,\nWisdom makes them celestial beings.\nYin Sheng transformed in the western lands,\nUniversally guiding all to know the true Dao.\nDevoted to contemplating the immortal truth,\nTheir accumulated thoughts never differ.\nFirst wishing to ascend and roam the void,\nCommuning with the subtle and imperceptible.\nAccumulating goodness without tiring,\nBestowing kindness without stinginess.\nTheir merit and virtue move the immortal sages,\nWho naturally bestow the elixir.\nThe Dao Lord says: Practicing this Dharma in the world,\nOne transcends the Three Realms.\nThe foremost Dharma is the Shangqing,\nSoaring transformations in harmony with the Cavern Realms.\nNext, through countless kalpas,\nThey manifest as Tathāgatas, their roots the same but teachings slightly varied.\nLater, their teachings reach the farthest barbarians.\nThe ten directions and China,\nThe hardest to transform are those in the west.\nI, the Dao, was Laozi,\nGuiding Yin Sheng at the time,\nUttering the Five Thousand Words,\nRefining the womb for ten years,\nCirculating the heavens thrice,\nCompleting the foundation of perfect fortune.\nOnly my Dao practices goodness,\nSeeing this, deeply take heed.\n\nThe *Supreme Cavern Mystery Numinous Treasure Sutra on Karmic Causes and Conditions of Past Lives* concludes.\n*(Note: \"Ming Jing\" should read \"Miao Jing.\")*\n*(Note: This section appears to be missing the fourth item.)*",
      "overlap_context": "oppressed by others.\n\nThe Dao Lord says: There are also five virtuous deeds that ensure one encounters good conditions, is born among humans, with fragrant breath and a pure body, ever at peace in heart and mind, respected and honored by all.\nWhat are these five virtues?\nFirst, wholeheartedly believing in truth, never deceiving others in life.\nSecond, reciting scriptures and practicing the Dao, single-minded and unwavering.\nThird, diligently fasting and purifying, delighting in the immortal Dao.",
      "start_char": 3184,
      "end_char": 4156,
      "start_sentence": 178,
      "end_sentence": 238,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.399392127990723,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝宿命因缘明经.txt",
        "category": "本文类"
      }
    }
  ]
}