{
  "source_id": "太上老君经律",
  "source_file": "chunked_daozang\\太上老君经律.json",
  "total_chunks": 4,
  "total_original_chars": 4977,
  "total_translated_chars": 22368,
  "total_translation_time": 106.42427492141724,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\戒律类\\太上老君经律.txt",
    "category": "戒律类"
  },
  "full_translation": "**The Scripture and Precepts of the Most High Lord Lao**\n\n**Scripture Title:** *The Scripture and Precepts of the Most High Lord Lao*. The compiler is unknown, approximately dating to the Northern and Southern Dynasties. This text gathers four early Heavenly Master Daoist precepts (two of which are missing). One fascicle. Base text from: *Daoist Canon of the Zhengtong Era*, *Dongshen* section, *Precepts and Rules* category. Collated with: *Seven Lots from the Bookcase of the Clouds* (fascicles 38 and 39, hereafter *Qiqian* version).\n\n---\n\n### **The Scripture and Precepts of the Most High Lord Lao**\n\n**The Venerable Scripture of the Dao and Virtue: Precepts**\n**Nine Practices and Twenty-Seven Precepts**\n\n**The One Hundred and Eighty Precepts of Lord Lao** (to be received together by male officials)\n**The Precepts of the Great Clarity for Yin** (missing)\n**The Precepts of the Green Maiden** (missing) (to be received by female officials)\n\n---\n\n### **The *Xianger* Precepts of the Venerable Scripture of the Dao and Virtue**\nPractice non-action, practice softness and weakness, practice holding to the feminine, do not move first.\nThese are the three highest practices.\n\nPractice namelessness, practice purity and stillness, practice all goodness.\nThese are the three middle practices.\n\nPractice desirelessness, practice knowing when to stop and be content, practice yielding and deferring.\nThese are the three lowest practices.\n\nThese nine practices, comprising two fascicles and eighty-one chapters, gather as the abode of the Dao, where the noble and the humble follow the same standards.\nThose who fulfill the highest practices become divine immortals;\nthose who fulfill six practices double their lifespan;\nthose who fulfill three practices extend their years and avoid untimely death.\n\n---\n\n### **The Precepts of the Venerable Scripture of the Dao and Virtue**\n**Precept:** Do not delight in perversity, for delight is the same as anger.\n**Precept:** Do not waste essence and qi.\n**Precept:** Do not harm the royal qi.\n**Precept:** Do not consume beings containing blood, delighting in their fine flavors.\n**Precept:** Do not covet fame and achievement.\n**Precept:** Do not act falsely, for that misleads others in the form and name of the Dao.\n**Precept:** Do not forget the methods of the Dao.\n**Precept:** Do not act impulsively or move without cause.\n**Precept:** Do not kill or speak of killing.\nThese are the nine highest precepts.\n\n**Precept:** Do not study perverse texts.\n**Precept:** Do not greedily seek high rank or forcefully demand.\n**Precept:** Do not seek reputation.\n**Precept:** Do not be misled by the ears, eyes, or mouth.\n**Precept:** Always remain humble and lowly.\n**Precept:** Do not be rash or impetuous.\n**Precept:** When undertaking matters, deliberate carefully; do not let the heart be confused or fearful.\n**Precept:** Do not indulge the body with fine clothes and delicious food.\n**Precept:** Do not be excessive or overflowing.\nThese are the nine middle precepts.\n\n**Precept:** Do not, in poverty and lowliness, forcefully seek wealth and nobility.\n**Precept:** Do not commit any evil.\n**Precept:** Do not be overly superstitious or taboo-ridden.\n**Precept:** Do not pray to or sacrifice to ghosts and spirits.\n**Precept:** Do not be overbearing or violent.\n**Precept:** Do not be self-righteous.\n**Precept:** Do not contend with others over right and wrong; when disputes arise, avoid them first.\n**Precept:** Do not boast of sagely names or greatness.\n**Precept:** Do not delight in warfare.\nThese are the nine lowest precepts.\n\nThese twenty-seven precepts, comprising two fascicles, together form the profound source of the Dao, universally practiced by the noble and the humble.\nThose who fulfill all become divine immortals;\nthose who uphold eighteen precepts double their lifespan;\nthose who uphold nine precepts extend their years and avoid untimely death.\n\n---\n\n### **The One Hundred and Eighty Precepts of Lord Lao, with Preface**\nIn the late Zhou dynasty, during the reign of King Nan, the Dao of Great Peace and the teachings of Great Clarity first emerged. Lord Lao arrived at Langye and transmitted the Dao to Gan Jun. Gan Jun received the methods of the Dao, thereby attaining the Dao, and was appointed as a Perfected One. He was also transmitted the *Scripture of Great Peace* in one hundred seventy fascicles, divided into ten parts, *Jia* and *Yi*. Later, Bo Jun fell gravely ill, and from Gan Jun he received the Dao to protect against illness. His illness was cured, and he too attained the Dao, being appointed as a Perfected One. In Langye, there remains a magnolia tree, the place where Gan and Bo Jun practiced.\n\nDuring the reign of King You, Lord Lao taught the Hu barbarians. On his return, he was to enter Hanzhong, passing through Langye, where Gan Jun was able to meet Lord Lao. Lord Lao said to Gan Jun: \"Previously, I transmitted to you the methods to assist others and save lives, to worry for the myriad people, and to appoint male and female *jijiu* to broadly transform the foolish, distributing the seeds of the *lai* plant, so that above they might move the heart of Heaven, and below stir the will of Earth, thereby pleasing the hearts of kings. Yet from afar, across a thousand myriad *li*, I have observed that the various male and female *jijiu*, relying on the venerable position of Lord Lao, covet wealth and lust after beauty, act arbitrarily, and mutually dispute right and wrong. Each claims their own heart is correct and that others are not true, seeking offerings and desiring others to serve them. They hate and envy those of the same Dao, suppress the worthy and envy the talented, act arrogantly and self-indulgently, and forbid the common people from following others, saying, 'My Dao is the most correct; theirs is not true.' None of this should be so. Therefore, I have come to speak to you.\"\n\nGan Ji bowed his head, prostrated himself, and knocked his head on the ground a hundred times, replying: \"From this day forward, may the Most High instruct us on how to absolve the grave transgressions of the various male and female *jijiu*, allowing the *jijiu* to live, and by the protection of the Dao, ascend as immortals. After their lifespans end, may they not enter the ninefold subterranean prisons of suffering. And not only the *jijiu*, but also the myriad people. The myriad people, ignorant of the laws, bear the sins of the *jijiu*—this is my transgression and fault, truly my own.\"\n\n\"May the Most High pardon past errors and appoint me to cultivate future goodness. Your servant Gan Ji is guilty of death, guilty of death!\"\n\nLord Lao said: \"Sit properly, calm your mind, and settle your thoughts. I fear that the Great Dao has become shallow in this degenerate age, and the myriad people are losing their lives. That one or two *jijiu* die and enter the ninefold darkness below is not what pains me. It is the suffering of the myriad people that pains me! You must listen well and commit this to heart, to establish laws for later generations, and to admonish the various male and female *jijiu* to change their past conduct and follow goodness from this day forward.\"\n\nLord Lao said: \"Though a person may live for ten thousand years, if they do not uphold the precepts and rules, how are they different from an old, rotting tree or a crumbling stone? Better to uphold the precepts for a single day, die as a person of the Dao and virtue, and ascend as an immortal through *shijie*. When worldly people die bearing grave transgressions, it is of no benefit to their *hun* and *shen* spirits, which only suffer punishment! The *jijiu* must clearly follow and practice this.\"\n\nThen he said: \"Let the various *jijiu* listen clearly: Among the myriad people under Heaven, none endure forever. People are born and must die; things form and must decay. The sun rises and sets; the moon waxes and fills, then wanes. From ancient times until now, who has endured forever? Only the Dao and virtue can last! Today is good, this day is good, this hour is good, all the worthy are good, Master Jia is good, the disciples are good, the myriad spirits are all present, and the officers and soldiers have all arrived.\"\n\nNow, for the sake of the various worthy ones, I consider the lives of the myriad people and thus accept the heavy precepts and strict prohibitions of Master Wang Jia.\n\nThe Most High Lord Lao said: Though a person may live ten thousand years, without upholding the precepts and disciplines, how do they differ from tiles and stones? Better to uphold the precepts for a single day, spend one’s life as a person of the Dao and virtue, and die without committing evil. Those who die upholding the precepts will extinguish delusion, refine their form, ascend to fill the celestial offices, and ascend as immortals through *shijie*. Worldly people who do not uphold the precepts die bearing grave transgressions, bringing no benefit to their *hun* and *shen* spirits. Good men and good women, clearly follow and practice these.\n\nThe Precepts state:\n\n1. You shall not keep many servants or concubines.\n2. You shall not commit adultery with another’s wife.\n3. You shall not steal others’ property.\n4. You shall not kill or harm any living being.\n5. You shall not take anything worth one coin or more without just cause.\n6. You shall not recklessly burn or destroy anything worth one coin or more.\n7. You shall not cast food into the fire.\n8. You shall not raise pigs or sheep.\n9. You shall not seek others’ property through deceit.\n10. You shall not eat garlic or the five pungent vegetables.\n11. You shall not write in cursive script when corresponding with others.\n12. You shall not send excessive written correspondence.\n13. You shall not use medicine to induce miscarriage.\n14. You shall not burn wild fields or mountain forests.\n15. You shall not eat from vessels of gold or silver.\n16. You shall not seek knowledge of military or state affairs or divine fortunes.\n17. You shall not recklessly form ties with bandits or soldiers.\n18. You shall not recklessly fell trees.\n19. You shall not recklessly pluck flowers or grasses.\n20. You shall not frequently visit officials or imperial attendants to recklessly form ties with them.\n21. You shall not treat disciples with contempt or favor them falsely to disrupt the truth.\n22. You shall not be greedy or hoard wealth.\n23. You shall not engage in frivolous speech, sow discord, or harbor jealousy.\n24. You shall not drink alcohol or eat meat.\n25. You shall not accumulate wealth or despise the orphaned and poor.\n26. You shall not eat alone.\n27. You shall not buy or sell slaves.\n28. You shall not involve yourself in others’ marriage affairs.\n29. You shall not speak of others’ faults or harbor resentment toward them.\n30. You shall not practice or perform music or entertainment.\n31. You shall not speak of others’ misdeeds or engage in endless suspicion.\n32. You shall not reveal others’ private matters.\n33. You shall not discuss the virtues or vices of others’ parents or ancestors.\n34. You shall not praise others to their face while speaking ill of them in private.\n35. You shall not use filthy or defiled objects to tease others.\n36. You shall not cast poison into deep pools, rivers, or seas.\n37. You shall not form private ties with your own clan or relatives.\n38. You shall not treat others’ elders with disrespect.\n39. You shall not commit suicide.\n40. You shall not encourage others to kill.\n41. You shall not separate members of another’s household.\n42. You shall not kill out of hatred.\n43. You shall not send anonymous letters to slander others.\n44. You shall not act selfishly.\n45. You shall not exalt yourself.\n46. You shall not be arrogant.\n47. You shall not recklessly dig the earth or destroy mountains and rivers.\n48. You shall not curse or revile others.\n49. You shall not kick livestock with your feet.\n50. You shall not cover others’ eyes.\n51. You shall not refuse to treat illness.\n52. You shall not covet others’ property.\n53. You shall not drain water from marshes or lakes.\n54. You shall not criticize your master.\n55. You shall not bathe naked or expose your body.\n56. You shall not treat the scriptures and teachings with disrespect.\n57. You shall not disrespect the elderly.\n58. You shall not watch livestock mate.\n59. You shall not engage in lewd or playful behavior.\n60. You shall not rely on power or status to bully others.\n61. You shall not form cliques with those close to you.\n62. You shall not carry blades or weapons.\n   If in military service, you are not bound by this precept.\n63. You shall not separate households or live apart.\n64. You shall not give rise to anger or resentment.\n65. You shall not insult others by calling them slaves.\n66. You shall not urinate while standing.\n67. You shall not tattoo the faces of slaves.\n68. You shall not curse others to die or suffer ruin.\n69. You shall not rejoice in others’ death or ruin.\n70. You shall not wander recklessly or without restraint.\n71. You shall not stare at others with wide eyes.\n72. You shall not stick out your tongue at others.\n73. You shall not demand property from others.\n74. You shall not forcibly beg or disturb the common people.\n\n75. You shall not impose levies or taxes on behalf of secular persons.\n76. You shall not act as the principal host in secular rites.\n77. You shall not survey mountains for others to establish tombs or residences.\n78. You shall not engage in astrological divination or prognosticate celestial phenomena.\n79. You shall not fish or hunt, harming or killing living beings.\n80. You shall not disrupt proper order, separating husbands and wives.\n81. You shall not show partiality toward disciples.\n   Treat disciples as you would your own children.\n82. You shall not take fire from others in the dark of night.\n83. You shall not gallop about in the secular world to offer condolences for the dead.\n   Mourn in quiet seclusion.\n84. You shall not form factions with secular persons, mocking or slandering one another.\n85. You shall not undermine others’ accomplishments, claiming their virtues as your own.\n86. You shall not select fine dwellings or comfortable beds for rest.\n87. You shall not disparage others, deeming them evil.\n88. You shall not promote your own possessions as superior.\n89. You shall not startle others, causing fear.\n90. You shall not judge others’ food and drink as good or bad.\n91. You shall not convey malicious words between others.\n92. You shall not use official authority to harm others.\n93. You shall not involve yourself in secular disputes over right and wrong.\n94. You shall not forcibly take others’ property under the guise of kindness.\n95. You shall not dig up hibernating creatures in winter.\n96. You shall not wander recklessly, racing about day and night.\n97. You shall not recklessly climb trees to raid nests or break eggs.\n98. You shall not trap birds or beasts with nets or cages.\n99. You shall not bore holes in others’ walls to spy on their womenfolk.\n100. You shall not throw filthy or polluted objects into wells.\n101. You shall not block or fill in ponds or wells.\n102. You shall not deceive the old or the young.\n103. You shall not recklessly open or read others’ letters.\n104. You shall not deceive or coerce good people into becoming slaves.\n105. You shall not hoard wealth and treasures, inviting misfortune.\n106. You shall not cling to household attachments.\n107. You shall not conceal or bury tools or objects.\n108. You shall not destroy or damage found money.\n109. You shall not kindle fires on level ground.\n110. You shall not place thorny branches or spears in pathways.\n111. You shall not engage in excessive or frivolous speech.\n112. You shall not discard written materials by burying them before latrines.\n113. You shall not bow to other spirits or deities.\n114. You shall not keep or study secular divination charts or the Eight Gods diagrams.\n115. You shall not associate with soldiers.\n116. You shall not urinate or defecate on living plants or in water used by others.\n117. You shall not be intimate with widows.\n118. You shall not worship spirits or deities to seek fortune.\n119. You shall not impose excessive taboos on others.\n120. You shall not impose excessive taboos on yourself.\n121. You shall not recklessly bathe in rivers or seas.\n122. You shall not falsely borrow or present others’ possessions as gifts.\n123. You shall not act as a guarantor for others in contracts involving the sale of fields, residences, or slaves.\n124. You shall not associate with licentious households.\n125. You shall not store poison in vessels.\n126. You shall not raise your voice harshly while laughing.\n127. You shall not draft lawsuits for others or mediate official disputes.\n128. You shall not seek out or read books of secret schemes.\n129. You shall not recklessly beat the six domestic animals.\n130. You shall not gallop horses or drive chariots without cause.\n131. You shall not roll the *Scriptures and Precepts of the Most High Lord Lao* into balls with your hands or mix them with leftover food or dishes.\n132. You shall not startle birds or beasts.\n133. You shall not criticize others’ food and drink as good or bad.\n134. You shall not recklessly breach or drain lakes or reservoirs.\n135. You shall not boast of your ability to cure illnesses.\n   Only when a household invites you may you go.\n136. You shall not travel alone.\n   When traveling, go with others.\n137. You shall not scheme for others’ private gain.\n138. You shall not excessively seek treasures.\n139. You shall not bring women into the mountains; they should reside in separate quarters.\n140. You shall not abandon the root to pursue the branch.\n141. Provide only what is appropriate for offerings; do not make things difficult.\n\n142. You shall uphold the Dao of purity and frugality, emulating the noble deer that eats grass and the ox that drinks water.\n143. You shall be cautious in choosing where to stay.\n   First inspect the place, lest you disturb or startle anything.\n144. You shall turn toward the Orthodox Unity, not indulge in worldly affairs.\n145. You shall maintain a grand resolve and steadfast will, not杂ly violate or betray the teachings of the Three Honored Ones.\n146. You shall diligently avoid suspicion, not presume upon parental affection in serving your lord.\n147. You shall diligently seek long life, day and night without weariness.\n148. You shall diligently avoid misfortune and calamity, not covet rank or transient glory.\n149. You shall diligently practice qi absorption and grain avoidance to attain the Dao of immortality.\n150. You shall diligently avoid evil people, not abandon or betray friends.\n151. When eating or drinking, always begin from one side, not hastily commenting on the quality.\n152. Whenever burning incense, you shall make petitions for the myriad people, praying for peace under heaven, not merely for yourself.\n153. Whenever others address you as *jijiu*, you shall respect and fear them, not act lightly or rashly, lest you be mocked by the people.\n154. Whenever you receive food from ten thousand people, always recite prayers to bless the host with fortune and abundance for all.\n155. Without cause, you shall not gather crowds for feasting and disorderly conduct.\n156. Without cause, you shall not recklessly accept others’ gifts or reverence.\n157. When entering a state, you must first inquire after its worthy and virtuous people, and cleave to them.\n158. When entering another state, you must first inquire about its prohibitions and taboos.\n159. When entering a household, you must first ask the names and titles of its elders.\n160. Upon arriving at a household, you shall not expect the host to provide food and drink.\n161. Women shall not travel together with men.\n162. Men shall not speak with women in secluded chambers.\n163. Men’s and women’s clothing shall not exceed three changes.\n164. Men and women shall not sit together to eat or drink, nor exchange items by hand.\n165. When heaven sends disasters—floods or droughts—you shall not complain or grow weary.\n166. Though the world’s evil is great and its goodness small, you shall not be disheartened but guard the Dao.\n167. If others revile you, you shall only submit and not respond.\n168. If others slander or defame you, you shall only cultivate yourself and invoke the Great Dao, not grieve or fear to the detriment of your spirit.\n169. If others treat you with malice, you shall respond with doubled kindness.\n   Kindness dispels evil as water extinguishes fire.\n170. If someone gives an item to person A, person B shall not resent that it was not given to them.\n171. You shall not rejoice in praise for yourself, nor lament over slander.\n172. If others kill birds, beasts, or fish for you, you shall not eat them.\n173. You shall not eat what you see being killed.\n174. You shall not eat what has a strong odor.\n175. If the origin of food is unknown, you may eat it but shall not crave its taste.\n176. To abstain from the flesh of the six livestock is foremost; failing that, you violate the precepts.\n177. Eating vegetables is best, but you shall not do so in the presence of rulers.\n178. If you can honor the worthy, revere the sagely, and emulate the virtuous, I shall deliver you, and you will encounter true immortals.\n179. When traveling without a fixed abode, you may stay wherever convenient, lodging among trees, rocks, or cliffs. Recite the One Hundred Eighty Precepts, and spirits will naturally guard you—triple ranks of soldiers, bandits, ghosts, and tigers will not dare approach.\n180. If you observe the precepts without transgression, or if you transgress but repent, reforming past faults and encouraging others to uphold them, contemplating the precepts and not evil, widely delivering all beings, I shall bow to the divine immortals, and the divine immortals shall perfect you.\n\nHere end the One Hundred Eighty Essential Precepts for Perpetual Abidance.\nThe Most High Lord Lao addressed his disciples: \"In the past, all worthy immortals and sages attained the Dao through these One Hundred Eighty Precepts.\nThe Dao is formless, and through a master it is accomplished.\nThe Dao cannot be transmitted lightly, nor can a master be treated with disrespect.\"\nThe disciples bowed their heads, prostrated themselves, and received the command.\nThus concludes the *Scripture and Precepts of the Most High Lord Lao*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上老君经律 经名：太上老君经律。 撰人不详，约出於南北期。 慕集早期天师道戒律四种（缺二种）。 一卷。 底本出处：《正统道藏》洞神部戒律类。 参校本：《云笈七签》卷三十八、三十九（简称七签本）。 太上老君经律 道德尊经戒　　九行二十七戒。 老君百八十戒　　已上男官同受。 太清阴戒　　阙。 女青律戒　　阙。 已上女官受。 道德尊经想尔戒 行无为，行柔弱，行守雌，勿先动。 此上最三行。 行无名，行清静，行诸善。 此中最三行。 行无欲，行知止足，行推让。 此下最三行。 此九行，二篇八十一章，集会为道舍，尊卑同科。 备上行者，神仙； 六行者，倍寿； 三行者，增年不横夭。 道德尊经戒 戒勿喜邪，喜与怒同。 戒勿费用精气。 · 戒勿伤王气。 戒勿食含血之物，乐其美味。 戒勿慕功名。 戒勿为伪，彼指形名道。 戒勿忘道法。 戒勿为试动。 戒勿杀、言杀。 此上最九戒。 戒勿学邪文。 戒勿贪高荣强求。 戒勿求名誉。 戒勿为耳目口所误。 戒常当处谦下。 戒勿轻躁。 戒举事当详，心勿惚恫。 戒勿恣身，好衣美食。 戒勿盈溢。 此中最九戒。 戒勿以贫贱强求富贵。 戒勿为诸恶。 戒勿多忌讳。 戒勿祷祀鬼神。 戒勿强梁。 戒勿自是。 戒勿与人争曲直，得诤先避之。 戒勿称圣名大。 戒勿乐兵。 此下最九戒。 此二十七戒，二篇共合为道渊，尊卑通行。 上备者，神仙； 持十八戒，倍寿； 九戒者，增年不横夭。 老君说一百八十戒并序 昔周之末，赧王之时，始出太平之道，太清之教。 老君至琅琊，授道与干君。 干君受道法，遂以得道，拜为真人，又传《太平经》一百七十卷，甲乙十部。 后帛君笃病，从干君授道护病，病得除差，遂复得道，拜为真人。 今琅琊有木兰树，干、帛二君所治处也。 幽王时，老君教胡，还当入汉中，过琅琊，干君得见老君。 老君谓干君曰； 吾前授汝，助人救命，忧念万民，拜署男女祭酒，广化愚人，分布莱子，使上感天心，下动地只，当令王者欢心。 而自顷以来，吾遥从千万亿里观之，诸男女祭酒，托老君尊位，贪财好色，擅己自用，更相是非，各谓我心正，言彼非真，利於供养，欲人奉己，僧恶同道，拓贤嫉 才，骄恣自大，禁止百姓，当来从我。 我道最正，彼非真也，皆不当尔，故来相语。 干吉稽首再拜，伏地叩头百下，唯唯告曰：太上从今日已去，不知当何由去诸男女祭酒之重罪，令祭酒辈生活，既蒙道佑，可得升仙，寿终之后，不入九地下牢之苦，非但祭酒，复其万民。 万民无知法则，祭酒之罪，臣之过咎，实在於己也。 唯愿太上赦既往之失，署臣修将来之善耳。 臣干吉死罪死罪。 老君曰：可正安意定坐。 吾恐大道浇季，万民丧命，一二祭酒死入九幽之下，不足痛也。 吾但念万民痛耳！ 汝当善听，记录心中，当为后世作法则，劫诸男女祭酒，令改往行，从今之善。 老君曰：人生虽有寿万年者，若不持戒律，与老树朽石何异？ 宁一日持戒为道德之人而死补天官，尸解升仙。 世人死有重罪，无益魂神，魂神受罪耳！ 祭酒明奉行之。 乃日：诸祭酒，各明听，天下万民，无有长存。 人生有死，物成有败，日出则没，月满则缺，从古至今，谁能长存者？ 唯道德可久耳！ 今月亦善，今日亦善，今时亦善，诸贤亦善，师甲亦善，弟子亦善，万神备具，吏兵皆到。",
      "translated_text": "**The Scripture and Precepts of the Most High Lord Lao**\n\n**Scripture Title:** *The Scripture and Precepts of the Most High Lord Lao*. The compiler is unknown, approximately dating to the Northern and Southern Dynasties. This text gathers four early Heavenly Master Daoist precepts (two of which are missing). One fascicle. Base text from: *Daoist Canon of the Zhengtong Era*, *Dongshen* section, *Precepts and Rules* category. Collated with: *Seven Lots from the Bookcase of the Clouds* (fascicles 38 and 39, hereafter *Qiqian* version).\n\n---\n\n### **The Scripture and Precepts of the Most High Lord Lao**\n\n**The Venerable Scripture of the Dao and Virtue: Precepts**\n**Nine Practices and Twenty-Seven Precepts**\n\n**The One Hundred and Eighty Precepts of Lord Lao** (to be received together by male officials)\n**The Precepts of the Great Clarity for Yin** (missing)\n**The Precepts of the Green Maiden** (missing) (to be received by female officials)\n\n---\n\n### **The *Xianger* Precepts of the Venerable Scripture of the Dao and Virtue**\nPractice non-action, practice softness and weakness, practice holding to the feminine, do not move first.\nThese are the three highest practices.\n\nPractice namelessness, practice purity and stillness, practice all goodness.\nThese are the three middle practices.\n\nPractice desirelessness, practice knowing when to stop and be content, practice yielding and deferring.\nThese are the three lowest practices.\n\nThese nine practices, comprising two fascicles and eighty-one chapters, gather as the abode of the Dao, where the noble and the humble follow the same standards.\nThose who fulfill the highest practices become divine immortals;\nthose who fulfill six practices double their lifespan;\nthose who fulfill three practices extend their years and avoid untimely death.\n\n---\n\n### **The Precepts of the Venerable Scripture of the Dao and Virtue**\n**Precept:** Do not delight in perversity, for delight is the same as anger.\n**Precept:** Do not waste essence and qi.\n**Precept:** Do not harm the royal qi.\n**Precept:** Do not consume beings containing blood, delighting in their fine flavors.\n**Precept:** Do not covet fame and achievement.\n**Precept:** Do not act falsely, for that misleads others in the form and name of the Dao.\n**Precept:** Do not forget the methods of the Dao.\n**Precept:** Do not act impulsively or move without cause.\n**Precept:** Do not kill or speak of killing.\nThese are the nine highest precepts.\n\n**Precept:** Do not study perverse texts.\n**Precept:** Do not greedily seek high rank or forcefully demand.\n**Precept:** Do not seek reputation.\n**Precept:** Do not be misled by the ears, eyes, or mouth.\n**Precept:** Always remain humble and lowly.\n**Precept:** Do not be rash or impetuous.\n**Precept:** When undertaking matters, deliberate carefully; do not let the heart be confused or fearful.\n**Precept:** Do not indulge the body with fine clothes and delicious food.\n**Precept:** Do not be excessive or overflowing.\nThese are the nine middle precepts.\n\n**Precept:** Do not, in poverty and lowliness, forcefully seek wealth and nobility.\n**Precept:** Do not commit any evil.\n**Precept:** Do not be overly superstitious or taboo-ridden.\n**Precept:** Do not pray to or sacrifice to ghosts and spirits.\n**Precept:** Do not be overbearing or violent.\n**Precept:** Do not be self-righteous.\n**Precept:** Do not contend with others over right and wrong; when disputes arise, avoid them first.\n**Precept:** Do not boast of sagely names or greatness.\n**Precept:** Do not delight in warfare.\nThese are the nine lowest precepts.\n\nThese twenty-seven precepts, comprising two fascicles, together form the profound source of the Dao, universally practiced by the noble and the humble.\nThose who fulfill all become divine immortals;\nthose who uphold eighteen precepts double their lifespan;\nthose who uphold nine precepts extend their years and avoid untimely death.\n\n---\n\n### **The One Hundred and Eighty Precepts of Lord Lao, with Preface**\nIn the late Zhou dynasty, during the reign of King Nan, the Dao of Great Peace and the teachings of Great Clarity first emerged. Lord Lao arrived at Langye and transmitted the Dao to Gan Jun. Gan Jun received the methods of the Dao, thereby attaining the Dao, and was appointed as a Perfected One. He was also transmitted the *Scripture of Great Peace* in one hundred seventy fascicles, divided into ten parts, *Jia* and *Yi*. Later, Bo Jun fell gravely ill, and from Gan Jun he received the Dao to protect against illness. His illness was cured, and he too attained the Dao, being appointed as a Perfected One. In Langye, there remains a magnolia tree, the place where Gan and Bo Jun practiced.\n\nDuring the reign of King You, Lord Lao taught the Hu barbarians. On his return, he was to enter Hanzhong, passing through Langye, where Gan Jun was able to meet Lord Lao. Lord Lao said to Gan Jun: \"Previously, I transmitted to you the methods to assist others and save lives, to worry for the myriad people, and to appoint male and female *jijiu* to broadly transform the foolish, distributing the seeds of the *lai* plant, so that above they might move the heart of Heaven, and below stir the will of Earth, thereby pleasing the hearts of kings. Yet from afar, across a thousand myriad *li*, I have observed that the various male and female *jijiu*, relying on the venerable position of Lord Lao, covet wealth and lust after beauty, act arbitrarily, and mutually dispute right and wrong. Each claims their own heart is correct and that others are not true, seeking offerings and desiring others to serve them. They hate and envy those of the same Dao, suppress the worthy and envy the talented, act arrogantly and self-indulgently, and forbid the common people from following others, saying, 'My Dao is the most correct; theirs is not true.' None of this should be so. Therefore, I have come to speak to you.\"\n\nGan Ji bowed his head, prostrated himself, and knocked his head on the ground a hundred times, replying: \"From this day forward, may the Most High instruct us on how to absolve the grave transgressions of the various male and female *jijiu*, allowing the *jijiu* to live, and by the protection of the Dao, ascend as immortals. After their lifespans end, may they not enter the ninefold subterranean prisons of suffering. And not only the *jijiu*, but also the myriad people. The myriad people, ignorant of the laws, bear the sins of the *jijiu*—this is my transgression and fault, truly my own.\"\n\n\"May the Most High pardon past errors and appoint me to cultivate future goodness. Your servant Gan Ji is guilty of death, guilty of death!\"\n\nLord Lao said: \"Sit properly, calm your mind, and settle your thoughts. I fear that the Great Dao has become shallow in this degenerate age, and the myriad people are losing their lives. That one or two *jijiu* die and enter the ninefold darkness below is not what pains me. It is the suffering of the myriad people that pains me! You must listen well and commit this to heart, to establish laws for later generations, and to admonish the various male and female *jijiu* to change their past conduct and follow goodness from this day forward.\"\n\nLord Lao said: \"Though a person may live for ten thousand years, if they do not uphold the precepts and rules, how are they different from an old, rotting tree or a crumbling stone? Better to uphold the precepts for a single day, die as a person of the Dao and virtue, and ascend as an immortal through *shijie*. When worldly people die bearing grave transgressions, it is of no benefit to their *hun* and *shen* spirits, which only suffer punishment! The *jijiu* must clearly follow and practice this.\"\n\nThen he said: \"Let the various *jijiu* listen clearly: Among the myriad people under Heaven, none endure forever. People are born and must die; things form and must decay. The sun rises and sets; the moon waxes and fills, then wanes. From ancient times until now, who has endured forever? Only the Dao and virtue can last! Today is good, this day is good, this hour is good, all the worthy are good, Master Jia is good, the disciples are good, the myriad spirits are all present, and the officers and soldiers have all arrived.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1302,
      "start_sentence": 0,
      "end_sentence": 86,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.08587074279785,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\太上老君经律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "今吾以诸贤故，念万民之命，故受王甲禁戒重律。 老君曰：人生虽有寿万年，不持戒律，与瓦石何异？ 宁一旦持戒，终身为道德之人而死，不犯恶而生。 持戒而死，灭度练形，上备天官，尸解升仙。 世人不持戒律，死有重罪，无益魂神。 善男善女，明奉行之。 戒曰： 第一戒者，不得多畜仆妾。 第二戒者，不得淫他妇女。 第三戒者，不得盗窃人物。 第四戒者，不得杀伤一切。 第五戒者，不得妄取人一钱已上物。 第六戒者，不得妄烧败一钱已上物。 第七戒者，不得以食物掷火中。 第八戒者，不得畜猜羊。 第九戒者，不得邪求一切人物。 第十戒者，不得食大蒜及五辛。 第十一戒者，不得作草书与人。 第十二戒者，不得多以书相闻。 第十三戒者，不得以药落去子。 第十四戒者，不得烧野田山林。 第十五戒者，不得以金银器食。 第十六戒者，不得求知军国事及占吉凶。 第十七戒者，不得妄与兵贼为亲。 第十八戒者，不得妄伐树木。 第十九戒者，不得妄摘草花。 第二十戒者，不得数见天子官人，妄与为亲。 第二十一戒者，不得轻慢弟子，邪宠以乱真。 第二十二戒者，不得贪惜财物。 第二十三戒者，不得妄言绮语，隔戾嫉妬。 第二十四戒者，不得饮酒食肉。 第二十五戒者，不得积财物，侮蔑孤贫。 第二十六戒者，不得独食。 第二十七戒者，不得贩卖奴婢。 第二十八戒者，不得知人婚姻事。 第二十九戒者，不得持人长短，更相嫌恨。 第三十戒者，不得自习伎乐。 第三十一戒者，不得言人恶事，猜疑百端。 第三十二戒者，不得言人阴私。 第三十三戒者，不得说人父母本末善恶。 第三十四戒者，不得面誉人，屏处论人恶。 第三十五戒者，不得以秽污之物调戏人。 第三十六戒者，不得以毒药投渊池及江海中。 第三十七戒者，不得独与宗族私亲。 第三十八戒者，不得轻疏他人之尊。 第三十九戒者，不得自杀。 第四十戒者，不得劝人杀。 第四十一戒者，不得别离他人家口。 第四十二戒者，不得因恨杀人。 第四十三戒者，不得投书读人。 第四十四戒者，不得自用。 第四十五戒者，不得自贵。 第四十六戒者，不得自骄。 第四十七戒者，不得妄凿地毁山川。 第四十八戒者，不得恶言骂詈。 第四十九戒者，不得以足蹋六畜。 第五十戒者，不得揜人目。 第五十一戒者，不得厌治病。 第五十二戒者，不得希望人物。 第五十三戒者，不得竭水泽。 第五十四戒者，不得评论师。 第五十五戒者，不得裸形露浴。 第五十六戒者，不得轻慢经教。 第五十七戒者，不得慢老人。 第五十八戒者，不得观六畜交阴阳。 第五十九戒者，不得调戏。 第六十戒者，不得恃威势凌人。 第六十一戒者，不得阿党所亲。 第六十二戒者，不得带刀仗。 若在军中，不从此律。 第六十三戒者，不得门户别离居。 第六十四戒者，不得起瞋恚。 第六十五戒者，不得骂人作奴婢。 第六十六戒者，不得立小便。 第六十七戒者，不得黥奴婢面。 第六十八戒者，不得咒人命死败。 第六十九戒者，不得快人死败。 第七十戒者，不得乱纵行游。 第七十一戒者，不得张目视人。 第七十二戒者，不得吐舌向人。 第七十三戒者，不得横求人物。 第七十四戒者，不得强乞扰乱百姓。",
      "translated_text": "Now, for the sake of the various worthy ones, I consider the lives of the myriad people and thus accept the heavy precepts and strict prohibitions of Master Wang Jia.\n\nThe Most High Lord Lao said: Though a person may live ten thousand years, without upholding the precepts and disciplines, how do they differ from tiles and stones? Better to uphold the precepts for a single day, spend one’s life as a person of the Dao and virtue, and die without committing evil. Those who die upholding the precepts will extinguish delusion, refine their form, ascend to fill the celestial offices, and ascend as immortals through *shijie*. Worldly people who do not uphold the precepts die bearing grave transgressions, bringing no benefit to their *hun* and *shen* spirits. Good men and good women, clearly follow and practice these.\n\nThe Precepts state:\n\n1. You shall not keep many servants or concubines.\n2. You shall not commit adultery with another’s wife.\n3. You shall not steal others’ property.\n4. You shall not kill or harm any living being.\n5. You shall not take anything worth one coin or more without just cause.\n6. You shall not recklessly burn or destroy anything worth one coin or more.\n7. You shall not cast food into the fire.\n8. You shall not raise pigs or sheep.\n9. You shall not seek others’ property through deceit.\n10. You shall not eat garlic or the five pungent vegetables.\n11. You shall not write in cursive script when corresponding with others.\n12. You shall not send excessive written correspondence.\n13. You shall not use medicine to induce miscarriage.\n14. You shall not burn wild fields or mountain forests.\n15. You shall not eat from vessels of gold or silver.\n16. You shall not seek knowledge of military or state affairs or divine fortunes.\n17. You shall not recklessly form ties with bandits or soldiers.\n18. You shall not recklessly fell trees.\n19. You shall not recklessly pluck flowers or grasses.\n20. You shall not frequently visit officials or imperial attendants to recklessly form ties with them.\n21. You shall not treat disciples with contempt or favor them falsely to disrupt the truth.\n22. You shall not be greedy or hoard wealth.\n23. You shall not engage in frivolous speech, sow discord, or harbor jealousy.\n24. You shall not drink alcohol or eat meat.\n25. You shall not accumulate wealth or despise the orphaned and poor.\n26. You shall not eat alone.\n27. You shall not buy or sell slaves.\n28. You shall not involve yourself in others’ marriage affairs.\n29. You shall not speak of others’ faults or harbor resentment toward them.\n30. You shall not practice or perform music or entertainment.\n31. You shall not speak of others’ misdeeds or engage in endless suspicion.\n32. You shall not reveal others’ private matters.\n33. You shall not discuss the virtues or vices of others’ parents or ancestors.\n34. You shall not praise others to their face while speaking ill of them in private.\n35. You shall not use filthy or defiled objects to tease others.\n36. You shall not cast poison into deep pools, rivers, or seas.\n37. You shall not form private ties with your own clan or relatives.\n38. You shall not treat others’ elders with disrespect.\n39. You shall not commit suicide.\n40. You shall not encourage others to kill.\n41. You shall not separate members of another’s household.\n42. You shall not kill out of hatred.\n43. You shall not send anonymous letters to slander others.\n44. You shall not act selfishly.\n45. You shall not exalt yourself.\n46. You shall not be arrogant.\n47. You shall not recklessly dig the earth or destroy mountains and rivers.\n48. You shall not curse or revile others.\n49. You shall not kick livestock with your feet.\n50. You shall not cover others’ eyes.\n51. You shall not refuse to treat illness.\n52. You shall not covet others’ property.\n53. You shall not drain water from marshes or lakes.\n54. You shall not criticize your master.\n55. You shall not bathe naked or expose your body.\n56. You shall not treat the scriptures and teachings with disrespect.\n57. You shall not disrespect the elderly.\n58. You shall not watch livestock mate.\n59. You shall not engage in lewd or playful behavior.\n60. You shall not rely on power or status to bully others.\n61. You shall not form cliques with those close to you.\n62. You shall not carry blades or weapons.\n   If in military service, you are not bound by this precept.\n63. You shall not separate households or live apart.\n64. You shall not give rise to anger or resentment.\n65. You shall not insult others by calling them slaves.\n66. You shall not urinate while standing.\n67. You shall not tattoo the faces of slaves.\n68. You shall not curse others to die or suffer ruin.\n69. You shall not rejoice in others’ death or ruin.\n70. You shall not wander recklessly or without restraint.\n71. You shall not stare at others with wide eyes.\n72. You shall not stick out your tongue at others.\n73. You shall not demand property from others.\n74. You shall not forcibly beg or disturb the common people.",
      "overlap_context": "us *jijiu* listen clearly: Among the myriad people under Heaven, none endure forever. People are born and must die; things form and must decay. The sun rises and sets; the moon waxes and fills, then wanes. From ancient times until now, who has endured forever? Only the Dao and virtue can last! Today is good, this day is good, this hour is good, all the worthy are good, Master Jia is good, the disciples are good, the myriad spirits are all present, and the officers and soldiers have all arrived.\"",
      "start_char": 1302,
      "end_char": 2728,
      "start_sentence": 87,
      "end_sentence": 168,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.63581681251526,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\太上老君经律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "第七十五戒者，不得为世俗人赋敛。 第七十六戒者，不得为世俗人作礼头主。 第七十七戒者，不得为人图山，立冢宅起屋。 第七十八戒者，不得干知星文，卜相天时。 第七十九戒者，不得渔猎伤杀众生。 第八十戒者，不得淫秩，别离夫妻。 第八十一戒者，不得视弟子偏颇。 视弟子当如其子。 第八十二戒者，不得夺人暝中火。 第八十三戒者，不得驰骋世俗，吊问死丧。 宜密哀邱之。 第八十四戒者，不得与俗人共相群党，更相嘲毁。 第八十五戒者，不得败人成功，言是己德。 第八十六戒者，不得择好室舍，好床卧息。 第八十七戒者，不得訾毁人物以为恶。 第八十八戒者，不得自举己物以为好。 第八十九戒者，不得惊怚令恐怖。 第九十戒者，不得择人饮食为好恶。 第九十一戒者，不得为人往来恶言。 第九十二戒者，不得以县官中伤人。 第九十三戒者，不得预人间论议曲直事。 第九十四戒者，不得强取人物以恩惠。 第九十五戒者，不得冬天发掘地蛰藏。 第九十六戒者，不得轻行妄游，日月驰骋。 第九十七戒者，不得妄上树探巢破卵。 第九十八戒者，不得笼罩乌兽。 第九十九戒者，不得穿人家壁，窥看人家内妇女。 第一百戒者，不得以秽污之物投井中。 第一百一戒者，不得塞池井。 第一百二戒者，不得欺罔老小。 第一百三戒者，不得妄发读人书。 第一百四戒者，不得诱枉良人为奴婢。 第一百五戒者，不得积聚财宝，以招凶祸。 第一百六戒者，不得贪恋居家。 第一百七戒者，不得藏埋器物。 第一百八戒者，不得破坏见钱。 第一百九戒者，不得在平地然火。 第一百一十戒者，不得施枪棘着道中。 第一百十一戒者，不得多言弄口舌。 第一百十二戒者，不得将书字之物，自投埋於厕前。 第一百十三戒者，不得向他鬼神礼拜。 第一百十四戒者，不得畜世俗占事八神图，亦不得习。 第一百十五戒者，不得与兵人为侣。 第一百十六戒者，不得便溺生草上及人所食之水。 第一百十七戒者，不得与寡妇亲。 第一百十八戒者，不得祠祀鬼神以求侥幸。 第一百十九戒者，不得为人多作忌讳。 第一百二十戒者，不得自多忌讳。 第一百二十一戒者，不得妄轻入江海中浴。 第一百二十二戒者，不得妄假举人物以为礼赂。 第一百二十三戒者，不得为人保赁券契，卖田宅奴婢之事。 第一百二十四戒者，不得与淫泆之家相往来。 第一百二十五戒者，不得录毒药着器中。 第一百二十六戒者，不得高厉声每含笑。 第一百二十七戒者，不得为人作词讼，和人官事。 第一百二十八戒者，不得趣求密谋之书读之。 第一百二十九戒者，不得妄鞭打六畜。 第一百三十戒者，不得无故走马驰车。 第一百三十一戒者，不得以手团太上老君经律食残噙众肴。 第一百三十二戒者，不得惊乌兽。 第一百三十三戒者，不得评论人家食饮善恶。 第一百三十四戒者，不得妄开决陂湖。 第一百三十五戒者，不得自衒治病。 病家自来请求，乃可往之。 第一百三十六戒者，不得独行。 行与人俱。 第一百三十七戒者，不得为人谋合私利。 第一百三十八戒者，不得广求宝物。 第一百三十九戒者，不得带女人入山，皆应别岐异室。 第一百四十戒者，不得叛本逐末。 第一百四十一戒者，当随可供养，勿多难。",
      "translated_text": "75. You shall not impose levies or taxes on behalf of secular persons.\n76. You shall not act as the principal host in secular rites.\n77. You shall not survey mountains for others to establish tombs or residences.\n78. You shall not engage in astrological divination or prognosticate celestial phenomena.\n79. You shall not fish or hunt, harming or killing living beings.\n80. You shall not disrupt proper order, separating husbands and wives.\n81. You shall not show partiality toward disciples.\n   Treat disciples as you would your own children.\n82. You shall not take fire from others in the dark of night.\n83. You shall not gallop about in the secular world to offer condolences for the dead.\n   Mourn in quiet seclusion.\n84. You shall not form factions with secular persons, mocking or slandering one another.\n85. You shall not undermine others’ accomplishments, claiming their virtues as your own.\n86. You shall not select fine dwellings or comfortable beds for rest.\n87. You shall not disparage others, deeming them evil.\n88. You shall not promote your own possessions as superior.\n89. You shall not startle others, causing fear.\n90. You shall not judge others’ food and drink as good or bad.\n91. You shall not convey malicious words between others.\n92. You shall not use official authority to harm others.\n93. You shall not involve yourself in secular disputes over right and wrong.\n94. You shall not forcibly take others’ property under the guise of kindness.\n95. You shall not dig up hibernating creatures in winter.\n96. You shall not wander recklessly, racing about day and night.\n97. You shall not recklessly climb trees to raid nests or break eggs.\n98. You shall not trap birds or beasts with nets or cages.\n99. You shall not bore holes in others’ walls to spy on their womenfolk.\n100. You shall not throw filthy or polluted objects into wells.\n101. You shall not block or fill in ponds or wells.\n102. You shall not deceive the old or the young.\n103. You shall not recklessly open or read others’ letters.\n104. You shall not deceive or coerce good people into becoming slaves.\n105. You shall not hoard wealth and treasures, inviting misfortune.\n106. You shall not cling to household attachments.\n107. You shall not conceal or bury tools or objects.\n108. You shall not destroy or damage found money.\n109. You shall not kindle fires on level ground.\n110. You shall not place thorny branches or spears in pathways.\n111. You shall not engage in excessive or frivolous speech.\n112. You shall not discard written materials by burying them before latrines.\n113. You shall not bow to other spirits or deities.\n114. You shall not keep or study secular divination charts or the Eight Gods diagrams.\n115. You shall not associate with soldiers.\n116. You shall not urinate or defecate on living plants or in water used by others.\n117. You shall not be intimate with widows.\n118. You shall not worship spirits or deities to seek fortune.\n119. You shall not impose excessive taboos on others.\n120. You shall not impose excessive taboos on yourself.\n121. You shall not recklessly bathe in rivers or seas.\n122. You shall not falsely borrow or present others’ possessions as gifts.\n123. You shall not act as a guarantor for others in contracts involving the sale of fields, residences, or slaves.\n124. You shall not associate with licentious households.\n125. You shall not store poison in vessels.\n126. You shall not raise your voice harshly while laughing.\n127. You shall not draft lawsuits for others or mediate official disputes.\n128. You shall not seek out or read books of secret schemes.\n129. You shall not recklessly beat the six domestic animals.\n130. You shall not gallop horses or drive chariots without cause.\n131. You shall not roll the *Scriptures and Precepts of the Most High Lord Lao* into balls with your hands or mix them with leftover food or dishes.\n132. You shall not startle birds or beasts.\n133. You shall not criticize others’ food and drink as good or bad.\n134. You shall not recklessly breach or drain lakes or reservoirs.\n135. You shall not boast of your ability to cure illnesses.\n   Only when a household invites you may you go.\n136. You shall not travel alone.\n   When traveling, go with others.\n137. You shall not scheme for others’ private gain.\n138. You shall not excessively seek treasures.\n139. You shall not bring women into the mountains; they should reside in separate quarters.\n140. You shall not abandon the root to pursue the branch.\n141. Provide only what is appropriate for offerings; do not make things difficult.",
      "overlap_context": "t insult others by calling them slaves.\n66. You shall not urinate while standing.\n67. You shall not tattoo the faces of slaves.\n68. You shall not curse others to die or suffer ruin.\n69. You shall not rejoice in others’ death or ruin.\n70. You shall not wander recklessly or without restraint.\n71. You shall not stare at others with wide eyes.\n72. You shall not stick out your tongue at others.\n73. You shall not demand property from others.\n74. You shall not forcibly beg or disturb the common people.",
      "start_char": 2729,
      "end_char": 4143,
      "start_sentence": 169,
      "end_sentence": 239,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.35081148147583,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\太上老君经律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "第一百四十二戒者，当念清俭法，慕清贤鹿食牛饮。 第一百四十三戒者，当慎所投止。 先行视之，勿所惊触。 第一百四十四戒者，当迥向正一，勿得习俗事。 第一百四十五戒者，当有大意秉志，不得杂犯负违三尊教命。 第一百四十六戒者，当勤避嫌疑，勿以父母狎恩事君。 第一百四十七戒者，当勤求长生，昼夜勿倦。 第一百四十八戒者，当勤避恶难，勿贪禄苟荣。 第一百四十九戒者，当勤服气断谷，为不死道。 第一百五十戒者，当勤避凶人，勿弃背朋友。 第一百五十一戒者，每饮食从一边起，勿勤咤言美恶。 第一百五十二戒者，每烧香，当为万姓请愿，令天下太平，勿但为己。 第一百五十三戒者，每人呼汝为祭酒，汝顾畏人，勿自轻躁，为百姓所笑。 第一百五十四戒者，每得万人食，常咒愿令主人得福，一切饱满。 第一百五十五戒者，无事不得多聚会众，饮食狼籍。 第一百五十六戒者，无事不得妄多受人礼敬。 第一百五十七戒者，入国必先问贤人善士，当亲依之。 第一百五十八戒者，入他国必先问其所禁忌。 第一百五十九戒者，入人家必先问人家尊老名讳。 第一百六十戒者，至人家不得希望万姓主人饮食。 第一百六十一戒者，女人不得与男子同行。 第一百六十二戒者，男不得与女人冥室中共语。 第一百六十三戒者，男女衣不得过畜三通。 第一百六十四戒者，男女不得共坐食饮，交手授受。 第一百六十五戒者，天有灾变，水旱不调，勿得患厌。 第一百六十六戒者，世人恶多善少，勿悒悒道自护法。 第一百六十七戒者，人有骂汝，汝但服勿应答。 第一百六十八戒者，人侵谤汝，汝但当自修启大道，勿忧怖以损精神。 第一百六十九戒者，人恶向汝，汝重以善往。 善之禳恶，犹水浇火。 第一百七十戒者，人有持物与甲，而乙不得有恨人不与己。 第一百七十一戒者，人为己声誉勿喜，为己毁辱亦不得啧。 第一百七十二戒者，人为己杀乌兽鱼等，皆不得食。 第一百七十三戒者，见杀不食。 第一百七十四戒者，见膻不食。 第一百七十五戒者，不知所从来，可食不可思美。 第一百七十六戒者，能断众生六畜之肉为第一，不然则犯戒。 第一百七十七戒者，能食菜最佳，而不可向王者。 第一百七十八戒者，能崇贤、重圣、习贤，吾当度汝，汝遇真仙。 第一百七十九戒者，行无居家，可投便止，宿树木岩石间，讽诵百八十戒，神自营卫汝，三重兵、贼、鬼、虎，不敢近汝。 第一百八十戒者，行戒不犯，犯即能悔，改往修来，劝人奉受，念戒不念恶，广度一切，吾拜神真，神真成汝。 右长存要律百八十戒 老君告弟子曰：往昔诸贤仙圣，皆从百八十戒得道； 道无形，从师得成。 道不可度，师不可轻。 弟子稽首，再拜受命矣。 太上老君经律竟",
      "translated_text": "142. You shall uphold the Dao of purity and frugality, emulating the noble deer that eats grass and the ox that drinks water.\n143. You shall be cautious in choosing where to stay.\n   First inspect the place, lest you disturb or startle anything.\n144. You shall turn toward the Orthodox Unity, not indulge in worldly affairs.\n145. You shall maintain a grand resolve and steadfast will, not杂ly violate or betray the teachings of the Three Honored Ones.\n146. You shall diligently avoid suspicion, not presume upon parental affection in serving your lord.\n147. You shall diligently seek long life, day and night without weariness.\n148. You shall diligently avoid misfortune and calamity, not covet rank or transient glory.\n149. You shall diligently practice qi absorption and grain avoidance to attain the Dao of immortality.\n150. You shall diligently avoid evil people, not abandon or betray friends.\n151. When eating or drinking, always begin from one side, not hastily commenting on the quality.\n152. Whenever burning incense, you shall make petitions for the myriad people, praying for peace under heaven, not merely for yourself.\n153. Whenever others address you as *jijiu*, you shall respect and fear them, not act lightly or rashly, lest you be mocked by the people.\n154. Whenever you receive food from ten thousand people, always recite prayers to bless the host with fortune and abundance for all.\n155. Without cause, you shall not gather crowds for feasting and disorderly conduct.\n156. Without cause, you shall not recklessly accept others’ gifts or reverence.\n157. When entering a state, you must first inquire after its worthy and virtuous people, and cleave to them.\n158. When entering another state, you must first inquire about its prohibitions and taboos.\n159. When entering a household, you must first ask the names and titles of its elders.\n160. Upon arriving at a household, you shall not expect the host to provide food and drink.\n161. Women shall not travel together with men.\n162. Men shall not speak with women in secluded chambers.\n163. Men’s and women’s clothing shall not exceed three changes.\n164. Men and women shall not sit together to eat or drink, nor exchange items by hand.\n165. When heaven sends disasters—floods or droughts—you shall not complain or grow weary.\n166. Though the world’s evil is great and its goodness small, you shall not be disheartened but guard the Dao.\n167. If others revile you, you shall only submit and not respond.\n168. If others slander or defame you, you shall only cultivate yourself and invoke the Great Dao, not grieve or fear to the detriment of your spirit.\n169. If others treat you with malice, you shall respond with doubled kindness.\n   Kindness dispels evil as water extinguishes fire.\n170. If someone gives an item to person A, person B shall not resent that it was not given to them.\n171. You shall not rejoice in praise for yourself, nor lament over slander.\n172. If others kill birds, beasts, or fish for you, you shall not eat them.\n173. You shall not eat what you see being killed.\n174. You shall not eat what has a strong odor.\n175. If the origin of food is unknown, you may eat it but shall not crave its taste.\n176. To abstain from the flesh of the six livestock is foremost; failing that, you violate the precepts.\n177. Eating vegetables is best, but you shall not do so in the presence of rulers.\n178. If you can honor the worthy, revere the sagely, and emulate the virtuous, I shall deliver you, and you will encounter true immortals.\n179. When traveling without a fixed abode, you may stay wherever convenient, lodging among trees, rocks, or cliffs. Recite the One Hundred Eighty Precepts, and spirits will naturally guard you—triple ranks of soldiers, bandits, ghosts, and tigers will not dare approach.\n180. If you observe the precepts without transgression, or if you transgress but repent, reforming past faults and encouraging others to uphold them, contemplating the precepts and not evil, widely delivering all beings, I shall bow to the divine immortals, and the divine immortals shall perfect you.\n\nHere end the One Hundred Eighty Essential Precepts for Perpetual Abidance.\nThe Most High Lord Lao addressed his disciples: \"In the past, all worthy immortals and sages attained the Dao through these One Hundred Eighty Precepts.\nThe Dao is formless, and through a master it is accomplished.\nThe Dao cannot be transmitted lightly, nor can a master be treated with disrespect.\"\nThe disciples bowed their heads, prostrated themselves, and received the command.\nThus concludes the *Scripture and Precepts of the Most High Lord Lao*.",
      "overlap_context": " shall not boast of your ability to cure illnesses.\n   Only when a household invites you may you go.\n136. You shall not travel alone.\n   When traveling, go with others.\n137. You shall not scheme for others’ private gain.\n138. You shall not excessively seek treasures.\n139. You shall not bring women into the mountains; they should reside in separate quarters.\n140. You shall not abandon the root to pursue the branch.\n141. Provide only what is appropriate for offerings; do not make things difficult.",
      "start_char": 4144,
      "end_char": 5307,
      "start_sentence": 240,
      "end_sentence": 286,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.351775884628296,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\太上老君经律.txt",
        "category": "戒律类"
      }
    }
  ]
}