{
  "source_id": "太上灵宝天地运度自然妙经",
  "source_file": "chunked_daozang\\太上灵宝天地运度自然妙经.json",
  "total_chunks": 3,
  "total_original_chars": 2580,
  "total_translated_chars": 15452,
  "total_translation_time": 79.77235960960388,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\太上灵宝天地运度自然妙经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Supreme Cavernous Mystery Numinous Treasure Scripture on the Natural Wondrous Rotation of Heaven and Earth**\n\n**Scripture Title:** *The Supreme Cavernous Mystery Numinous Treasure Scripture on the Natural Wondrous Rotation of Heaven and Earth*. Author unknown, likely composed during the Northern and Southern Dynasties. Not recorded in the *Catalogue of Numinous Treasure Scriptures*. One scroll. Base text from the *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Division, *Original Texts* category.\n\nThe Dao speaks: The Supreme Numinous Treasure existed before heaven and earth, and only thereafter did heaven and earth come into being. Numbers arise from one, stand upon three, are completed in five, flourish in seven, and reach their limit in nine. Thus, heaven is ninety thousand *li* from earth, accumulating yang qi. The Dao’s yin forms spread across Kunlun, serving as the earth’s pillar. Where qi ascends to Kunlun is the center of the earth. Kunlun extends eastward one hundred million six thousand five hundred *li*, westward one hundred million six thousand five hundred *li*, southward one hundred million six thousand five hundred *li*, and northward one hundred million six thousand seven hundred fifty *li*. The earth’s circumference traverses four directions, totaling four hundred million two thousand six hundred twenty-five *li*.\n\nThe Dao speaks: The sun and moon each span a thousand *li* in diameter and three thousand *li* in circumference, traversing eighty-one domains in their rotation, alternating between obscurity and darkness. The nine stars of the Northern Dipper—two yin stars unseen—are separated by ninety thousand *li*, sinking and moistening eighty-one provinces and eight hundred ten domains. The Northern Dipper hovers above Kunlun, embracing it, and its qi circulates throughout the world: in spring and summer as dew, in autumn and winter as frost and snow. Humans are akin to heaven and earth. Beyond the eight directions of heaven and earth, the myriad beings receive their natures, all harboring sorrow and suffering, constantly harming the people. Those with blood and breath, wriggling and moving, cannot attain freedom; they contend with heaven and earth for their fate, all destined for death. Bones decay and enter the earth; spirits soar and wander, revolving through the five destinies. Those who do good ascend to heaven; those who do evil sink into the abyss. All the good and evil deeds of a person’s life follow their spirit, soul, and ethereal soul in accordance with their blessings and misfortunes. Only by studying the Dao and seeking life, comprehending the ultimate rotation and deliverance, can one attain long-lasting existence and restore the yang of the ninefold rotation.\n\nThe Dao speaks: Human life begins in the womb, enduring ten months. Death arrives like a great wind, sudden and without warning, striking at any time. One must contend with the heart, doing good without hesitation. Thus, this scripture urges and encourages scholars: what the eye does not see, what the ear does not hear, and rare treasures—what benefit do they bring to the self? All who pursue the Dao must trust the scripture’s sincerity, uphold goodness unto death, and avoid evil in life. The Dao must not be lost; virtue must not be violated. To violate the Dao and lose virtue is like a child born without a mother, like a fish cast from the deep. If one aspires to study, revolving through death and life is like a silkworm in its cocoon, muddled and confused. Thus, when form and fate suddenly transform, the Dao is achieved in subtlety. Prolonged fasting and scripture recitation are the roots of virtue. Naturally, one attains profound comprehension of rotation and deliverance, transcending divine methods, and receives the veneration of the Supreme Jade Capital.\n\nThus, a hymn is composed:\n*In my declining years, a hundred ailments assail me.*\n*Ice melts and fire arises; calamities strike, dissolving my form.*\n*A hundred bones separate; the great kalpa is about to collapse.*\n*I fear this pain and seek the Dao, longing for eternal life.*\n*Leaving behind the burdens of this dusty world,*\n*I join that realm of ultimate stillness and purity.*\n*Lofty conduct aspires to the Great Vehicle;*\n*naturally, the study of the Dao is perfected.*\n*Revolving with unsurpassed virtue,*\n*I forget the self and thus remain nameless.*\n*Serene wisdom crosses the eight difficulties;*\n*carefree, what else is there to seek?*\n\nThe Dao speaks: Of all beings, humans alone are noble. Having received life, one should nurture and fulfill it. Yet, greed for wealth and stinginess prevent generosity. Serving teachers and treasures to seek ascension and deliverance—who reflects upon this? This body is not one’s own; wealth and treasures are not one’s own. Official ranks and salaries are heavy burdens—what benefit do they bring to the self? Old age, illness, and death cannot be averted. Unable to extricate oneself for the Dao, one adorns the self with vanity, believing life is sufficient. This is like a land bird cherishing its tail, only to be captured by the archer. Scholars must diligently align their hearts with the highest, knowing that none of these follow the spirit and soul in death—vainly enduring hardship. One must contemplate the root of deliverance, sever the paths of the three evils, and enter the three paths of goodness: first, no aging; second, no illness; third, no death. Attaining long life and deliverance from the world, escaping calamities, and encountering the rotation, one becomes a guest of the Supreme. Thus, a hymn is composed:\n*Reflecting on old age and illness, the great afflictions of the three realms,*\n*blessings exhausted, life nearing its end, breath ceases, and one enters the coffin.*\n*Darkly becoming dust and ash, spirit and soul find no moment’s peace.*\n*I fear this fate and study the Dao, free from premature decay.*\n*Gathering the mind to preserve true purity,*\n*cultivating the heart, surely it is worthy of contemplation.*\n*Delighting in the garden of the Three Treasures,*\n*I naturally subdue demonic officials.*\n*Thus, I offer my body in alms,*\n*my resolve transcending the shore of life and death.*\n*In utter freedom, without dependence,*\n*I eternally preserve joy for countless ages.*\n\nThe Dao speaks: Those who cultivate long life aspire to ascension and deliverance, seeking the Dao of non-action, transcending the dust and filth, and leaving no trace among the multitudes. They must first understand the great cycle of heaven and earth’s rotation, the disasters of the yang nine and six, and escape calamities to attain peace. If one does not act accordingly, even if one seeks the Dao year after year, hoping for ascension, the effort will be in vain—ultimately, it will be futile labor. Now, I reveal to you the periods of kalpas and rotations, the divisions of expansion and contraction. Preserve the body, seek life, and attain long life—not merely for this single body, but also to return the seven ancestors to the womb.\n\nThe Perfected Immortal says: Those who study the Dao with precision and comprehend the rotation and deliverance of the yang nine and six will surely attain deliverance from the world without peril. The essentials lie in prolonged fasting, deep contemplation, distancing oneself from worldly affairs, and forgetting both thoughts and burdens. Only then can one hope for the ascension of the flesh.\n\nIf even a single flaw remains, one cannot be called eternal. Seek the Ten Admonitions of the Supreme Pole Perfected One:\n\nRed writ emerges from earth’s governance,\nGold and jade return as husband and wife.\nAt the Blue Dragon’s jia-shen conjunction,\nWho can foresee its sudden arrival?\nThough adorned with celestial water script,\nThe treasure awaits the Prince’s appointed hour.\nAt the hour of chen, colors shall transform—\nFirst glimpsed in the eyes of Hu children.\n\nKun-yuan reaches its fullness,\nJishi remains untamed.\nO learned scholars who rise aloft,\nIn the era after Heaven, serve Heaven’s time.\nBlessings do not pass in a single dawn—\nSeven generations lay the foundation of goodness.\nWhen peace aligns at Meng Ford,\nHow joyous and radiant it shall be!\n\nAt the Metal Horse’s end of the Dark Cycle,\nThe Ancient Moon invades the Divine Continent.\nOn land, no sons remain;\nBrothers wander in turn.\nThe sons of River and Luo are spent,\nYan and Zhao become vast floods.\nJingyang’s willows follow in order,\nAt the hour of si, the Central Peak’s talisman appears.\nWhen the awned grain perishes in ten years,\nThe Eastern Sea’s mulberry fields become a realm of roaming.\n\nFirst enter the blessed land,\nRefine the body with the Eight Stones.\nLiu City is the land of rebirth—\nThe Hidden Dragon need not fret.\nJade shoots draw near the world,\nPaulownia and cypress are easily sought.\nDing-hai is not far—\nThe Eight Lords gather as one.\n\nDarkness gives birth to floating purple clouds,\nInstructing the Ninefold Numinous Child.\nBefore the decree can avert calamity’s fullness,\nThunder and lightning cannot be halted.\nIt arises in the years of shen and you,\nPervading and lingering for ten epochs.\nWhen the Water Dragon’s time arrives,\nThe Immortal Lords shall at last rise.\n\nEighteen bow-mouthed youths,\nChanting in harmonious order.\nA hundred officials stand in solemn ranks,\nAll reverent and foremost in virtue.\nDiligently emulate Song and Qiao—\nWhen the kalpa ends, you shall have delivered yourself.\nIn peaceful days, wander belt-loosed,\nEach thread recording your robes’ folds.\n\nMaster Fangping records the Great Bird,\nWhich shall soar to the southeast in days to come.\nThe foolish see not what is to come,\nWhile the wise unfold the divine prescriptions.\nThe outskirts drown at summer’s beginning,\nVenus loses its constant measure.\nClouds and mists all transform—\nFish and turtles swim in boundless seas.\nAll at once, the Eastern Sea is submerged,\nNever again shall the descendants of Zi and Shang rise.\n\nAt the Ren-wu Southern Peak,\nYin is made into yang.\nIn Yangzhou, one may transcend the world—\nRecite the *Life-Generating Chapters* in due time.\nThe Zhang clan’s crane cries,\nDiscerning the weft at the Metal Horse’s end.\nWhite turns to harm within,\nScholars never loosen their sashes.\nOfficials and soldiers all flee,\nBandits grow daily more fierce.\nThough the Ninefold Palace is clad in robes,\nIts palace walls crumble in time.\nThorns grow in the courtyard,\nPrinces and lords perish to barbarian raiders.\nWives and daughters vanish to foreign lands,\nServitude knows no respite.\nTheir plight is truly lamentable—\nAcross a thousand years, shall they ever reunite?\n\nFar better to study the Dao early,\nDwelling in the mists of the empyrean.\nCultivate learning under the Libationers,\nAnd practice the methods with diligence.\nIf one is not vigilant in the one hundred and eighty days,\nWhen the time comes, it will be like being scorched by fire.\nSoon in the Jin clan’s era,\nThis must be spoken of.\nBlades and swords converge from four directions—\nNot a single day can be delayed.\nThen the great calamity shall arrive,\nVast and boundless as the heavens.\nCorpses wander with none to behold them—\nThe sages know this to be true.\n\nFirst study and awaken to the Mystic Capital,\nThen meet the famous mountains in your heart.\nIn the sacred land of gathered hems,\nThe Supreme Dao is the numinous ancestor.\nAt Pingdu, brush and ink are expounded—\nThe blessed land is surely worth journeying to.\nIn geng-chen, Qiang and Hu stir;\nIn ren-wu, rare rewards await.\nFirst dwell in the land of blessings,\nChanting loftily to nurture oneself.\nGazing a myriad leagues, no smoke is seen—\nYet ren-chen’s misfortunes are not yet dispelled.\nWhen the Immortal Lords govern in peace,\nThe eight directions’ nets are stilled.\nAs with my Jade Axe’s grace,\nForever parting from the dust of the world.\n\nWhy covet glory and rank?\nHere, cast aside all dark thoughts.\nConfucius bequeathed the *Luminous Treasury*,\nWood and earth seem to share a cause.\nMount Zeng is a place to wander,\nThe Nine Yi brush away light dust.\nIn a humble hut, guard emptiness and stillness,\nProfound silence steeped in dark mystery.\nSprings surge without replenishing their source—\nMao Metal harms no one.\nCurved blades bring no pain—\nYet in this world, they wound your body.\n\nOne may visit Mount Taihe,\nYanmen reveals its luminous truth.\nThe Deer Hall is truly precious—\nHarmony prevails until ren-chen.\nWhen the Eighteen come to govern,\nThe children shall unite with the luminous truth.\nThe land of Wu abounds in immortals,\nWhile Jing and Xiang suffer the deepest poverty.\nHow can Liu Valley be relied upon?\nThreefold the merit of Yao’s era.\nOnly then shall you know hardship—\nWhen the Sage Emperor emerges to govern.\nThis begins in ren-chen,\nWhen the bright star shines upon the jellyfish.\nAfter shen, ten epochs linger—\nThe Great Bird gathers in the southeast.\n\nBlood fills the city gates,\nSwarming rats climb lofty trees.\nThe multitude cannot be stopped—\nWomen enter the palace and court.\nDragons and clouds have no equal—\nThe foolish say it is not so,\nWhile the wise stand firm in their own right.\n\nThe Dao speaks: The Numinous Treasure naturally operates in cycles—there are the Great Yang-Nine and Great Hundred-Six, the Lesser Yang-Nine and Lesser Hundred-Six. Three thousand three hundred years form the Lesser Yang-Nine and Lesser Hundred-Six; nine thousand nine hundred years form the Great Yang-Nine and Great Hundred-Six. Heaven’s adversity is called Yang-Nine, Earth’s depletion is called Hundred-Six. By the time of the Jin clan, in the jia-shen year, these are the cycles of fortune and misfortune through which Heaven and Earth pass. The Yang-Nine will converge, and when that time comes, the Dao and its virtue shall be made manifest, calamities and evils shall be swiftly eradicated, and the Sage Sovereign shall assume his mandate in the ren-chen year.\n\nThese are the ten discourses of the Supreme Pole Perfected One—divine subtleties flow smoothly, profound principles shine in the void. The reckoning of cyclical destiny and the essentials of departure and arrival may be called thorough; they may be called exhaustive.\n\nThe Dao speaks: If one can constantly recite and meditate upon its hidden rhythms, one shall traverse the great disasters of the Yang-Nine and receive office in the ding-hai year. This requires first observing a prolonged fast in stillness, silently cutting off the clamor of worldly entanglements. Only then may one seek the subtle purport of liberation, uttering pure sounds from the lips. Thus shall the seven ancestors return to the womb, one’s own body endure forever, pass unharmed through the revolutions of the ages, and ascend as an immortal.\n\nWondrous and subtle indeed—beyond what words can express! Should you encounter this, you shall ascend to roam the Jade Capital, serving as the Sage Emperor’s shepherd to govern and order the people.\n\nThe Dao speaks: The protocols for transmission, as I have cited from ancient scriptures, require a twenty-four-day purification fast, along with the separate offering of five taels of refined gold and a hundred feet of cinnabar-ground brocade as a covenant. The recipient must uphold and practice this. Should one recklessly transmit it without following the protocols, the Wind Blade shall mete out punishment. Let the recipient take diligent care and act with utmost caution.\n\nHere ends *The Wondrous Scripture of the Numinous Treasure’s Natural Cycles of Heaven and Earth*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝天地运度自然妙经 经名：太上洞玄灵宝天地运度自然妙经。 撰人不详，约出於南北朝。 灵宝经目着录未出。 一卷。 底本出处：《正统道藏》洞玄部本文类。 道言：太上灵宝，先天地而生，然后有天地。 数起於一，立於三，成於五，盛於七，极於九。 故天去地九万里，积阳气。 道阴形列布昆仑，为地柱。 气上通昆仑者，地之中地。 昆仑直东一亿万六千五百里，昆仑直西一亿万六千五百里，昆仑直南一亿万六千五百里，昆仑直北一亿万六千七百五十里，地周游四匝，四亿二万六千二百五十里焉。 道言：夫日月径上千里，周三千里，运行八十一域，更迭朦朦瞑暝。 北斗九星，二星阴不见，相去九万里，以沈润八十一州、八百一十域。 北斗当昆仑上，抱昆仑，气运注天下，春夏为零露，秋冬为霜雪。 人与天地同也。 天地八方之外，万物受性，皆怀忧苦，常伤人民，含血蠕动，不得自在，与天地争命，皆当归死。 骸骨消入於地，精神飞翔，辗转五道。 为善上天，为恶入渊。 凡人生时所为善恶，精神魂魄随其罪福。 唯学道求生，达运度极，致可以长存，复阳九之运。 道言：人生涉胞胎，当经十月日，死如大风，卒起无期，死至无时。 当与心争，为善勿疑。 故以经道劝励学士，目所不见，耳所不闻，＠琦珍物，亦何益於身。 诸为道者，当信经诚，守善以死，不犯恶而生。 道不可失，德不可违，违道失德，如儿生无母，如鱼脱渊。 若志学，轮转死生，如蚕在茧中，混混沌沌。 故一旦变形易数，道成於微，长斋诵经，为德之根，自然玄解运度，足于神方之外，得礼太上玉京之尊。 乃作颂曰： 我唯年衰时，百病皆当经。 冰消而火起，灾冲解其形。 百骸生分离，大劫要当倾。 吾故畏是痛，求道愿长生。 去此尘中累，会彼至寂贞。 高行期大乘，自然学道成。 轮转无上德，忘我故不名。 静惠度八难，逍遥竟何营。 道言：夫生，惟人为贵。 既有其生，宜奖而成之。 而贪财吝惜，不肯施散。 奉事师宝以求升度，孰自思惟。 今身非我身所有，财宝亦非我有，官爵俸禄，为身重累，将何益於己身。 老病死者皆不能为我却之。 不能自拔为道，厚自文饰，谓生已足。 譬如陆鸟爱其尾，终为射夫之所得。 为学者当勤心上契，知是皆不随人魂神去，空为困苦。 当思拔度之根，绝三恶之道，令入三善道。 一者不老，二者不病，三者不死。 长生度世去厄会，遇运得太上之宾。 乃作颂曰： 自念老病尽，三界之大患。 福讫命将终，气绝入棺椁。 冥冥成灰土，魂魄无暂安。 吾故畏是故，学道无夭残。 摄意存正真，淑心谅可观。 耽成三宝囿，自能伏魔官。 故我损身施，志超生死岸。 混然既无待，永保亿龄欢。 道言：夫修长生，志在升度，求无为之道，身超於尘垢，绝迹于群方者。 当先知天地运度大期之数，阳九百六之灾，去厄即安之。 宜如其不尔，虽自求道终年，而希升腾，将复费其功，夫卒为徒劳也。 今开示尔劫运之期，盈缩之分，保躬求生，以招长命，岂但在一躯而已哉，亦将七祖反胎也。 仙公曰：夫学道精研，能明运度阳九百六之会，亦必得度世无危倾也。 要在长斋久思，远去人事，想累兼忘，然后可期肉飞之举。",
      "translated_text": "**The Supreme Cavernous Mystery Numinous Treasure Scripture on the Natural Wondrous Rotation of Heaven and Earth**\n\n**Scripture Title:** *The Supreme Cavernous Mystery Numinous Treasure Scripture on the Natural Wondrous Rotation of Heaven and Earth*. Author unknown, likely composed during the Northern and Southern Dynasties. Not recorded in the *Catalogue of Numinous Treasure Scriptures*. One scroll. Base text from the *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Division, *Original Texts* category.\n\nThe Dao speaks: The Supreme Numinous Treasure existed before heaven and earth, and only thereafter did heaven and earth come into being. Numbers arise from one, stand upon three, are completed in five, flourish in seven, and reach their limit in nine. Thus, heaven is ninety thousand *li* from earth, accumulating yang qi. The Dao’s yin forms spread across Kunlun, serving as the earth’s pillar. Where qi ascends to Kunlun is the center of the earth. Kunlun extends eastward one hundred million six thousand five hundred *li*, westward one hundred million six thousand five hundred *li*, southward one hundred million six thousand five hundred *li*, and northward one hundred million six thousand seven hundred fifty *li*. The earth’s circumference traverses four directions, totaling four hundred million two thousand six hundred twenty-five *li*.\n\nThe Dao speaks: The sun and moon each span a thousand *li* in diameter and three thousand *li* in circumference, traversing eighty-one domains in their rotation, alternating between obscurity and darkness. The nine stars of the Northern Dipper—two yin stars unseen—are separated by ninety thousand *li*, sinking and moistening eighty-one provinces and eight hundred ten domains. The Northern Dipper hovers above Kunlun, embracing it, and its qi circulates throughout the world: in spring and summer as dew, in autumn and winter as frost and snow. Humans are akin to heaven and earth. Beyond the eight directions of heaven and earth, the myriad beings receive their natures, all harboring sorrow and suffering, constantly harming the people. Those with blood and breath, wriggling and moving, cannot attain freedom; they contend with heaven and earth for their fate, all destined for death. Bones decay and enter the earth; spirits soar and wander, revolving through the five destinies. Those who do good ascend to heaven; those who do evil sink into the abyss. All the good and evil deeds of a person’s life follow their spirit, soul, and ethereal soul in accordance with their blessings and misfortunes. Only by studying the Dao and seeking life, comprehending the ultimate rotation and deliverance, can one attain long-lasting existence and restore the yang of the ninefold rotation.\n\nThe Dao speaks: Human life begins in the womb, enduring ten months. Death arrives like a great wind, sudden and without warning, striking at any time. One must contend with the heart, doing good without hesitation. Thus, this scripture urges and encourages scholars: what the eye does not see, what the ear does not hear, and rare treasures—what benefit do they bring to the self? All who pursue the Dao must trust the scripture’s sincerity, uphold goodness unto death, and avoid evil in life. The Dao must not be lost; virtue must not be violated. To violate the Dao and lose virtue is like a child born without a mother, like a fish cast from the deep. If one aspires to study, revolving through death and life is like a silkworm in its cocoon, muddled and confused. Thus, when form and fate suddenly transform, the Dao is achieved in subtlety. Prolonged fasting and scripture recitation are the roots of virtue. Naturally, one attains profound comprehension of rotation and deliverance, transcending divine methods, and receives the veneration of the Supreme Jade Capital.\n\nThus, a hymn is composed:\n*In my declining years, a hundred ailments assail me.*\n*Ice melts and fire arises; calamities strike, dissolving my form.*\n*A hundred bones separate; the great kalpa is about to collapse.*\n*I fear this pain and seek the Dao, longing for eternal life.*\n*Leaving behind the burdens of this dusty world,*\n*I join that realm of ultimate stillness and purity.*\n*Lofty conduct aspires to the Great Vehicle;*\n*naturally, the study of the Dao is perfected.*\n*Revolving with unsurpassed virtue,*\n*I forget the self and thus remain nameless.*\n*Serene wisdom crosses the eight difficulties;*\n*carefree, what else is there to seek?*\n\nThe Dao speaks: Of all beings, humans alone are noble. Having received life, one should nurture and fulfill it. Yet, greed for wealth and stinginess prevent generosity. Serving teachers and treasures to seek ascension and deliverance—who reflects upon this? This body is not one’s own; wealth and treasures are not one’s own. Official ranks and salaries are heavy burdens—what benefit do they bring to the self? Old age, illness, and death cannot be averted. Unable to extricate oneself for the Dao, one adorns the self with vanity, believing life is sufficient. This is like a land bird cherishing its tail, only to be captured by the archer. Scholars must diligently align their hearts with the highest, knowing that none of these follow the spirit and soul in death—vainly enduring hardship. One must contemplate the root of deliverance, sever the paths of the three evils, and enter the three paths of goodness: first, no aging; second, no illness; third, no death. Attaining long life and deliverance from the world, escaping calamities, and encountering the rotation, one becomes a guest of the Supreme. Thus, a hymn is composed:\n*Reflecting on old age and illness, the great afflictions of the three realms,*\n*blessings exhausted, life nearing its end, breath ceases, and one enters the coffin.*\n*Darkly becoming dust and ash, spirit and soul find no moment’s peace.*\n*I fear this fate and study the Dao, free from premature decay.*\n*Gathering the mind to preserve true purity,*\n*cultivating the heart, surely it is worthy of contemplation.*\n*Delighting in the garden of the Three Treasures,*\n*I naturally subdue demonic officials.*\n*Thus, I offer my body in alms,*\n*my resolve transcending the shore of life and death.*\n*In utter freedom, without dependence,*\n*I eternally preserve joy for countless ages.*\n\nThe Dao speaks: Those who cultivate long life aspire to ascension and deliverance, seeking the Dao of non-action, transcending the dust and filth, and leaving no trace among the multitudes. They must first understand the great cycle of heaven and earth’s rotation, the disasters of the yang nine and six, and escape calamities to attain peace. If one does not act accordingly, even if one seeks the Dao year after year, hoping for ascension, the effort will be in vain—ultimately, it will be futile labor. Now, I reveal to you the periods of kalpas and rotations, the divisions of expansion and contraction. Preserve the body, seek life, and attain long life—not merely for this single body, but also to return the seven ancestors to the womb.\n\nThe Perfected Immortal says: Those who study the Dao with precision and comprehend the rotation and deliverance of the yang nine and six will surely attain deliverance from the world without peril. The essentials lie in prolonged fasting, deep contemplation, distancing oneself from worldly affairs, and forgetting both thoughts and burdens. Only then can one hope for the ascension of the flesh.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1228,
      "start_sentence": 0,
      "end_sentence": 63,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.382832765579224,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上灵宝天地运度自然妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "如其一毫不尽，不可谓永，求太极真人诵法言十首： 赤书土出治，金玉复为夫。 青龙甲申会，奄至谁能知。 虽着天水文，宝候王子期。 辰中色当变，先时睹胡儿。 昆元最其充，积石次不治。 萧萧上学士，后天奉天时。 福非一朝过，七叶积善基。 太平契孟津，乐哉何熙怡。 玄运金马末，古月侵神州。 陆上既无子，兄弟亦迭游。 河洛子空尽，燕赵成洪流。 荆阳柳其次，巳刻中岳符。 芒子尽十载，东海桑中游。 宜先入福地，八石以炼躯。 柳城即生地，伏龙不为悠。 玉笋近世间，桐栢甚易求。 丁亥不云远，八公同会俱。 玄生浮紫云，诲以九灵子。 令未负灾充，雷电不可止。 出在申酉岁，弥漫留十纪。 至于水龙时，仙君乃方起。 弓口十八子，高吟相营理。 百官森列序，穆穆皆首士。 勤心慕松乔，劫尽已度己。 平日解带游，寸毫写衿裹。 方平记大鸟，当来东南翔。 下愚不见事，贤者披神方。 郊境没夏首，太白失度常。 云雾皆变化，鱼鳖游汪洋。 一时沦东海，无复起子商。 壬午之南岳，即阴以为阳。 扬州可度世，时诵生神章。 张氏着鹄呜，识纬金马末。 反白相中伤，娄衿不解带。 官兵悉窜走，贼强日凶大。 九重虽衣裳，宫墙时了坏。 荆棘当庭生，王侯没虏贼。 妻妇亡异域，使役无时泰。 衒卖谅可哀，千载岂复会。 末若早学道，宅志霄雾际。 修学诸祭酒，治法当令勤。 不谨百八十，至时如火煎。 近在金氏世，念此当可言。 兵刀四冲至，一日不可延。 然后洪灾会，浩哉与天连。 行尸无所睹，圣人知信然。 先学悟玄京，方寸会名山。 敛衽之胜地，至道固灵祖。 平都述翰墨，福地谅可往。 庚辰羌胡动，壬午有奇赏。 先当之福乡，高咏以自养。 万里望无烟，壬辰未消殃。 既平仙君治，八方息罗网。 如吾玉斧惠，永谢尘中壤。 华禄岂足贪，於兹绝冥想。 孔生遗明藏，木对若有因。 甑山可游处，九夷拂轻尘。 陋庐守空寂，玄默湛冥绿。 泉涌不继本，卯金无伤人。 刀曲不觉痛，今世伤尔身。 太和山可诣，雁门其明真。 鹿堂信可贵，和民至壬辰。 十八既出治，子来合明真。 昊地偏多仙，荆湘最困贫。 柳谷安可亲，三倍放勋世。 尔乃知苦辛，圣帝既出治。 其在壬辰始，明星焕水母。 申后留十纪，大鸟东南聚。 生血城门裹，群鼠绿高木。 众多不可止，女子入宫府。 云龙无比拟，愚者谓不然，贤者自方峙。",
      "translated_text": "If even a single flaw remains, one cannot be called eternal. Seek the Ten Admonitions of the Supreme Pole Perfected One:\n\nRed writ emerges from earth’s governance,\nGold and jade return as husband and wife.\nAt the Blue Dragon’s jia-shen conjunction,\nWho can foresee its sudden arrival?\nThough adorned with celestial water script,\nThe treasure awaits the Prince’s appointed hour.\nAt the hour of chen, colors shall transform—\nFirst glimpsed in the eyes of Hu children.\n\nKun-yuan reaches its fullness,\nJishi remains untamed.\nO learned scholars who rise aloft,\nIn the era after Heaven, serve Heaven’s time.\nBlessings do not pass in a single dawn—\nSeven generations lay the foundation of goodness.\nWhen peace aligns at Meng Ford,\nHow joyous and radiant it shall be!\n\nAt the Metal Horse’s end of the Dark Cycle,\nThe Ancient Moon invades the Divine Continent.\nOn land, no sons remain;\nBrothers wander in turn.\nThe sons of River and Luo are spent,\nYan and Zhao become vast floods.\nJingyang’s willows follow in order,\nAt the hour of si, the Central Peak’s talisman appears.\nWhen the awned grain perishes in ten years,\nThe Eastern Sea’s mulberry fields become a realm of roaming.\n\nFirst enter the blessed land,\nRefine the body with the Eight Stones.\nLiu City is the land of rebirth—\nThe Hidden Dragon need not fret.\nJade shoots draw near the world,\nPaulownia and cypress are easily sought.\nDing-hai is not far—\nThe Eight Lords gather as one.\n\nDarkness gives birth to floating purple clouds,\nInstructing the Ninefold Numinous Child.\nBefore the decree can avert calamity’s fullness,\nThunder and lightning cannot be halted.\nIt arises in the years of shen and you,\nPervading and lingering for ten epochs.\nWhen the Water Dragon’s time arrives,\nThe Immortal Lords shall at last rise.\n\nEighteen bow-mouthed youths,\nChanting in harmonious order.\nA hundred officials stand in solemn ranks,\nAll reverent and foremost in virtue.\nDiligently emulate Song and Qiao—\nWhen the kalpa ends, you shall have delivered yourself.\nIn peaceful days, wander belt-loosed,\nEach thread recording your robes’ folds.\n\nMaster Fangping records the Great Bird,\nWhich shall soar to the southeast in days to come.\nThe foolish see not what is to come,\nWhile the wise unfold the divine prescriptions.\nThe outskirts drown at summer’s beginning,\nVenus loses its constant measure.\nClouds and mists all transform—\nFish and turtles swim in boundless seas.\nAll at once, the Eastern Sea is submerged,\nNever again shall the descendants of Zi and Shang rise.\n\nAt the Ren-wu Southern Peak,\nYin is made into yang.\nIn Yangzhou, one may transcend the world—\nRecite the *Life-Generating Chapters* in due time.\nThe Zhang clan’s crane cries,\nDiscerning the weft at the Metal Horse’s end.\nWhite turns to harm within,\nScholars never loosen their sashes.\nOfficials and soldiers all flee,\nBandits grow daily more fierce.\nThough the Ninefold Palace is clad in robes,\nIts palace walls crumble in time.\nThorns grow in the courtyard,\nPrinces and lords perish to barbarian raiders.\nWives and daughters vanish to foreign lands,\nServitude knows no respite.\nTheir plight is truly lamentable—\nAcross a thousand years, shall they ever reunite?\n\nFar better to study the Dao early,\nDwelling in the mists of the empyrean.\nCultivate learning under the Libationers,\nAnd practice the methods with diligence.\nIf one is not vigilant in the one hundred and eighty days,\nWhen the time comes, it will be like being scorched by fire.\nSoon in the Jin clan’s era,\nThis must be spoken of.\nBlades and swords converge from four directions—\nNot a single day can be delayed.\nThen the great calamity shall arrive,\nVast and boundless as the heavens.\nCorpses wander with none to behold them—\nThe sages know this to be true.\n\nFirst study and awaken to the Mystic Capital,\nThen meet the famous mountains in your heart.\nIn the sacred land of gathered hems,\nThe Supreme Dao is the numinous ancestor.\nAt Pingdu, brush and ink are expounded—\nThe blessed land is surely worth journeying to.\nIn geng-chen, Qiang and Hu stir;\nIn ren-wu, rare rewards await.\nFirst dwell in the land of blessings,\nChanting loftily to nurture oneself.\nGazing a myriad leagues, no smoke is seen—\nYet ren-chen’s misfortunes are not yet dispelled.\nWhen the Immortal Lords govern in peace,\nThe eight directions’ nets are stilled.\nAs with my Jade Axe’s grace,\nForever parting from the dust of the world.\n\nWhy covet glory and rank?\nHere, cast aside all dark thoughts.\nConfucius bequeathed the *Luminous Treasury*,\nWood and earth seem to share a cause.\nMount Zeng is a place to wander,\nThe Nine Yi brush away light dust.\nIn a humble hut, guard emptiness and stillness,\nProfound silence steeped in dark mystery.\nSprings surge without replenishing their source—\nMao Metal harms no one.\nCurved blades bring no pain—\nYet in this world, they wound your body.\n\nOne may visit Mount Taihe,\nYanmen reveals its luminous truth.\nThe Deer Hall is truly precious—\nHarmony prevails until ren-chen.\nWhen the Eighteen come to govern,\nThe children shall unite with the luminous truth.\nThe land of Wu abounds in immortals,\nWhile Jing and Xiang suffer the deepest poverty.\nHow can Liu Valley be relied upon?\nThreefold the merit of Yao’s era.\nOnly then shall you know hardship—\nWhen the Sage Emperor emerges to govern.\nThis begins in ren-chen,\nWhen the bright star shines upon the jellyfish.\nAfter shen, ten epochs linger—\nThe Great Bird gathers in the southeast.\n\nBlood fills the city gates,\nSwarming rats climb lofty trees.\nThe multitude cannot be stopped—\nWomen enter the palace and court.\nDragons and clouds have no equal—\nThe foolish say it is not so,\nWhile the wise stand firm in their own right.",
      "overlap_context": " attain long life—not merely for this single body, but also to return the seven ancestors to the womb.\n\nThe Perfected Immortal says: Those who study the Dao with precision and comprehend the rotation and deliverance of the yang nine and six will surely attain deliverance from the world without peril. The essentials lie in prolonged fasting, deep contemplation, distancing oneself from worldly affairs, and forgetting both thoughts and burdens. Only then can one hope for the ascension of the flesh.",
      "start_char": 1228,
      "end_char": 2142,
      "start_sentence": 64,
      "end_sentence": 135,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.20101714134216,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上灵宝天地运度自然妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "道言：灵宝自然运度，有大阳九、大百六，小阳九、小百六。 三千三百年为小阳九、小百六； 九千九百年为大阳九、大百六。 天厄谓之阳九，地亏谓之百六。 至金氏之后甲申之岁，是天地运度否泰所经，阳九将会，至时道德方明，凶丑顿除，圣君受任於壬辰之年也。 此太极真人法言十篇，神趣妙畅，微旨朗空，期运之数，去就之要，可谓详矣，可谓尽矣。 道言：若能常讽诵冥韵，则得度洪灾於阳九，受位任於丁亥。 约当先长斋静咏，默绝嚣累，然后求释解之微旨，发清音於唇吻。 则七祖反胎，己身长存，经运周而无害，受仙而登焉。 妙哉微矣，非言所宣。 子若遇之，则得上游玉京，为圣帝牧民理治。 道言：传受之科，如吾称旧典，清斋二十四日，别赍上金五两，丹地锦百尺，以为盟誓。 受者奉而行之，若不依科而妄传，则风刀考罚矣。 受者辛勤详慎之哉。 太上灵宝天地运度自然妙经竟",
      "translated_text": "The Dao speaks: The Numinous Treasure naturally operates in cycles—there are the Great Yang-Nine and Great Hundred-Six, the Lesser Yang-Nine and Lesser Hundred-Six. Three thousand three hundred years form the Lesser Yang-Nine and Lesser Hundred-Six; nine thousand nine hundred years form the Great Yang-Nine and Great Hundred-Six. Heaven’s adversity is called Yang-Nine, Earth’s depletion is called Hundred-Six. By the time of the Jin clan, in the jia-shen year, these are the cycles of fortune and misfortune through which Heaven and Earth pass. The Yang-Nine will converge, and when that time comes, the Dao and its virtue shall be made manifest, calamities and evils shall be swiftly eradicated, and the Sage Sovereign shall assume his mandate in the ren-chen year.\n\nThese are the ten discourses of the Supreme Pole Perfected One—divine subtleties flow smoothly, profound principles shine in the void. The reckoning of cyclical destiny and the essentials of departure and arrival may be called thorough; they may be called exhaustive.\n\nThe Dao speaks: If one can constantly recite and meditate upon its hidden rhythms, one shall traverse the great disasters of the Yang-Nine and receive office in the ding-hai year. This requires first observing a prolonged fast in stillness, silently cutting off the clamor of worldly entanglements. Only then may one seek the subtle purport of liberation, uttering pure sounds from the lips. Thus shall the seven ancestors return to the womb, one’s own body endure forever, pass unharmed through the revolutions of the ages, and ascend as an immortal.\n\nWondrous and subtle indeed—beyond what words can express! Should you encounter this, you shall ascend to roam the Jade Capital, serving as the Sage Emperor’s shepherd to govern and order the people.\n\nThe Dao speaks: The protocols for transmission, as I have cited from ancient scriptures, require a twenty-four-day purification fast, along with the separate offering of five taels of refined gold and a hundred feet of cinnabar-ground brocade as a covenant. The recipient must uphold and practice this. Should one recklessly transmit it without following the protocols, the Wind Blade shall mete out punishment. Let the recipient take diligent care and act with utmost caution.\n\nHere ends *The Wondrous Scripture of the Numinous Treasure’s Natural Cycles of Heaven and Earth*.",
      "overlap_context": " upon?\nThreefold the merit of Yao’s era.\nOnly then shall you know hardship—\nWhen the Sage Emperor emerges to govern.\nThis begins in ren-chen,\nWhen the bright star shines upon the jellyfish.\nAfter shen, ten epochs linger—\nThe Great Bird gathers in the southeast.\n\nBlood fills the city gates,\nSwarming rats climb lofty trees.\nThe multitude cannot be stopped—\nWomen enter the palace and court.\nDragons and clouds have no equal—\nThe foolish say it is not so,\nWhile the wise stand firm in their own right.",
      "start_char": 2143,
      "end_char": 2505,
      "start_sentence": 136,
      "end_sentence": 150,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.188509702682495,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上灵宝天地运度自然妙经.txt",
        "category": "本文类"
      }
    }
  ]
}