{
  "source_id": "太华希夷志",
  "source_file": "chunked_daozang\\太华希夷志.json",
  "total_chunks": 13,
  "total_original_chars": 12005,
  "total_translated_chars": 72507,
  "total_translation_time": 380.2484276294708,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\记传类\\太华希夷志.txt",
    "category": "记传类"
  },
  "full_translation": "**The Record of Master Xiyi of Mount Taihua**\n\n**Title:** *The Record of Master Xiyi of Mount Taihua*\n**Compiled by:** Zhang Xia of the Yuan Dynasty\n**Two fascicles.**\n**Source text:** *Daoist Canon of the Zhengtong Era*, \"Biographies and Records\" section of the *Dongzhen* Department.\n\n---\n\n### **Preface to *The Record of Master Xiyi of Mount Taihua***\n\nWhile serving as a minor official in Jinning, Hezhong Prefecture, I lived in close proximity to Mount Hua and often heard tales of Master Xiyi’s legacy. In my spare time from official duties, I gathered accounts from ancient texts and folk sayings. His lofty conduct and unyielding integrity truly marked him as a singular figure of the former Song dynasty. Thus, I compiled *The Record of Master Xiyi of Mount Taihua* to preserve his memory.\n\nThe Master was well-versed in the *Book of Changes* and delved deeply into its profound mysteries. He perceived the fortunes and misfortunes of men and the auspices of things as clearly as if reading the cracks of a tortoise shell.\n\nDuring the Five Dynasties, he harbored ambitions to restore order and save the world, mastering the Dao of emperors and kings. When he learned of the ascension of Emperor Taizu of Song, knowing the realm was settled, he entered Mount Hua as a Daoist and declined all summons.\n\nUpon Emperor Taizong’s enthronement, the Master was thrice invited to court and received with the courtesy due a guest. Seated beside the emperor, he discoursed on matters of fortune and misfortune, all of which proved accurate. Though offered an official post, he firmly declined.\n\nSoon after, he was permitted to return to his mountain retreat. Though a recluse beyond the mundane world, his conduct aligned with the *Doctrine of the Mean*. He cast off worldly dust, disdaining rank and wealth, and regarded princes and nobles with the ease of peers. His serene withdrawal and lofty seclusion, free from the pursuit of power and profit, served to curb the ambitions of the avaricious. His integrity may be compared to that of the ancient hermits Chao Fu and Xu You, or the recluse Yan Guang. In upholding moral teachings and enriching customs, he rendered no small service to the age.\n\nIn contrast, those who grovel like leeches, flatter like slaves, knock on doors at dusk, or lord over others in broad daylight are but fermented dregs in a jar—what worth have they to speak of?\n\nI, Xia, reside far from the capital in Baojun, having accepted the post of magistrate in Puchuan due to family poverty, journeying two thousand *li* to assume office. Earlier, I served twice as a teaching official and held successive county positions. Though I associated with renowned scholars of the imperial academy and was repeatedly recommended for literary honors, my path was obstructed by those in power, and I was never appointed. Ashamed of self-promotion, I have languished in minor local posts, substituting for the plow while my scholarly aspirations remain unfulfilled, leaving me perpetually discontent.\n\nUpon reading ancient biographies, I was moved by Master Xiyi’s noble character and compiled this record to inspire young scholars. Should errors or vulgar distortions appear—due to the limitations of my sources—I have done my best to correct and supplement them, striving to capture the Master’s lofty spirit. May this work find some merit.\n\n**Written on the day *jiwei* of the seventh month, autumn of the *jiayin* year of the Yanyou era (1334), by Zhang Xia of Nezhai.**\n\n---\n\n### **The Record of Master Xiyi of Mount Taihua, Fascicle One**\n\n**Compiled and supplemented by:** Zhang Xia of Nezhai, *Dengshilang*, Magistrate of Hezhong Prefecture\n\nThe Master’s name was Bo, styled Tunan, a native of Zhenyuan in Bozhou. In his childhood, while playing by the water—some say the Wo River—a green-clad woman cradled him in her arms and nursed him, saying, “Henceforth, you shall be free from desires and surpass others in wisdom.” This green-clad woman was likely the essence of the celestial star Chenxing.\n\nAs he grew, he studied for the imperial examinations. During the *Changxing* era of the Later Tang, he sat for the *jinshi* exams but did not pass. He retreated to the Nine-Chambered Cliff of Mount Wudang, where he practiced *bigu* (abstention from grains) and refined his *qi* for over twenty years.\n\nSome say that on quiet nights, he would burn incense and recite the *Book of Changes*. Five elders would appear—white-browed, hoary-haired, and of strange countenance—listening to his recitations. After many days, Bo questioned them, and the elders replied, “We are the dragons of the Sun and Moon Pond of this mountain. This is the domain of the Dark Warrior. Mount Hua is your destined place of seclusion.”\n\nOne day, as Xiyi sat in silent meditation, the five dragons suddenly arrived. They instructed him to close his eyes, and he was borne aloft by the wind, arriving at Mount Hua by dawn. When he opened his eyes, he found himself seated upon a boulder, with no sign of the elders’ departure. Some say his sleeping method was taught by the dragons, for dragons are skilled in slumber.\n\nHe often remained secluded, sitting motionless for over a hundred days. Emperor Shizong of Zhou summoned him to court and had him confined in the palace, testing his endurance by sealing the door. After more than a month, the door was opened, and he was found in deep slumber as before. The emperor marveled at this and inquired about the arts of alchemy. Bo replied, “Your Majesty rules the realm; you should concern yourself with the people’s welfare. How can you fixate on such trifles?” The emperor was displeased and sent him back to the mountains, bestowing upon him the title “Master of White Clouds” and instructing the local prefect to inquire after him annually.\n\nThe Master possessed the talent to govern the world. During the Five Dynasties, whenever a dynasty fell, he would frown for days. If questioned, he would stare in silence. Gazing into a mirror, he declared, “If not an immortal, then an emperor.” Such was his self-assurance.\n\nWhen Emperor Taizu of Song traveled to Chang’an with Zhao Pu, Xiyi encountered them. Laughing, he dismounted his donkey and said, “A true man is indeed in the world!” Taking Taizu’s hand, he asked, “Shall we drink?” Taizu agreed, and they went with Zhao the scholar. Xiyi glanced at Pu and said, “He’ll do, he’ll do.” Entering a tavern, Pu sat to the left, but Bo grew angry, seizing his hand and saying, “A mere star of the Purple Tenuity—how dare you take the higher seat?” He rebuked Pu and made him sit to the right. Thus, he discerned the imperial destiny.\n\nLater, the Master led hundreds of ruffians into Bianzhou. Upon hearing of Taizu’s enthronement, he burst into joyous laughter. When asked the reason, he laughed again and said, “Now the realm is settled!” He composed a poem:\n\n*Forty years of sound sleep—*\n*Unnoticing, the eastern sky has dawned.*\n\nThereafter, he entered Mount Hua, living as a Daoist. Emperor Taizu repeatedly summoned him, but he refused to come. After Taizu’s death, Emperor Taizong ascended the throne. On the tenth day of the fourth month of the first year of the *Zhidao* era (995), the emperor sat in the *Chuigong* Hall. The season was mild, the harvest abundant, and governance harmonious. The emperor had long heard of the Master’s renown.\n\nDisdaining the world’s splendor, he favored the teachings of purity and seclusion. The emperor dispatched Palace Attendant Chen Zongyan of the Eastern Hall, bearing an imperial edict and a poem, to the Cloud Terrace Abbey in Huayin County, Huazhou, to summon Master Chen Tunan.\n\nOn the fourteenth day of the fourth month, they arrived in Huayin County. The magistrate, Editorial Director Ding Shouming, welcomed them into the county seat. As dusk fell, they lodged there for the night. At dawn the next day, the fourteenth of the month, they proceeded with the imperial envoy to Cloud Terrace Abbey. There, they met the Daoist Zhong Xihui, who led them to the Master. Announcing the emperor’s summons, they said, “His Majesty calls for the Master.”\n\nAfter washing his hands and burning incense, the Master bowed before the imperial seat. He then listened as the edict was read: “Since ascending the throne, We have subdued the eight directions and overawed the myriad states. Far and near have submitted to Our transforming influence; Chinese and barbarian alike have attained great peace. We have learned that you, Master, embrace the Dao amid the mountains, purify your heart beyond the realm of things, nurture the primal qi of great simplicity, and correspond to the Lesser Weaving Star of the upper heavens. Your integrity rivals that of Chao Fu and Xu You; your Way follows that of the Yellow Emperor and Laozi. Though you hold the long-term strategies of governance, you do not seek audience with kings and lords; though you possess the extraordinary talents of generals and ministers, you have not paid court to the Son of Heaven. You do not bend before the lord of ten thousand chariots—why then conceal yourself among the Three Peaks? Yet you come with the wind, and the entire court rejoices. Our poem reads:\n\n*Of Hua Peak much have We heard—*\n*We know your surname is Chen.*\n*You ask the guests of the Three Isles,*\n*A lofty man beyond the world.*\n*Your crucible is your livelihood,*\n*Green mountains your near neighbors.*\n*We long to go in person,*\n*But the altars of state permit no absence.*\n\nAfter hearing the edict and poem, the Master addressed the imperial envoy: “This poor Daoist dwells beyond the world of things, cultivating and refining amid the mountains. I seek no fame, but my heart yearns for the Dao. I have no wish to serve in office.” When the envoy’s courtesies were complete, the Master still refused to come to court. Instead, he presented a reply memorial and a poem:\n\n*I recall my rustic birth beneath the vast heavens,*\n*Raised south of the Han.*\n*In youth, I studied the Confucian classics;*\n*In manhood, I roamed the grottoes and abbeys.*\n*My nature is like the lowly crow;*\n*My heart, like cold ashes.*\n*I know not the depths of benevolence and righteousness,*\n*Nor the right path of action or retreat.*\n*My robe is made of withered lotus;*\n*My cap, of cast-off clogs.*\n*My body sprouts green fur;*\n*My feet lack straw sandals.*\n*I aspire to the Way of Fuxi and the Yellow Emperor,*\n*But have no heart to recite the works of Guan and Yue.*\n*I often read the* Southern Florescence *and the* Dao and Its Virtue*,*\n*While thoughts of the vermilion gates and jade halls fade away.*\n*Several lines of purple edicts*\n*Only trouble the colorful phoenix that bears them.*\n*A single piece of my idle heart*\n*Has already been detained by the white clouds.*\n*If I were to approach the imperial steps,*\n*I would only bring ridicule upon Your Sagely Brilliance.*\n\n*The poem reads:*\n*Ninefold layers send down the purple-sealed summons,*\n*Yet this clumsy hermit delights in quiet seclusion.*\n*Mountain hues fill the court like painted screens;*\n*Pine voices from ten thousand gorges are my zither strings.*\n*I have no heart to enjoy emoluments or ascend the three ducal seats,*\n*But seek the immortal realms of the grotto-heavens.*\n*Floating honors of cap and carriage banish all thoughts—*\n*I beg only to sleep for a thousand years among the Three Peaks.*\n\nSeeing the Master’s firm resolve to decline the summons, the envoy received the reply memorial and poem. On the twenty-fourth day of the fourth month, he returned to the capital and presented them at the Purple Throne Hall. Emperor Taizong read the memorial and poem, and learning that the Master would not come, was deeply displeased. He could not put the matter from his mind.\n\nOn the third day of the sixth month of that year, the emperor sat in the *Chuigong* Hall and summoned Palace Attendant Zhang Suzhen of the Eastern Hall. He entrusted him with another edict and sent him again to summon the Master. On the eighth day of the sixth month, the envoy arrived at Cloud Terrace Abbey on Mount Hua. There, he saw a mountain youth standing with a bamboo scroll in hand. The imperial envoy asked, “Is the Master here?”\n\nThe youth replied, “The Master is fast asleep in his hut.”\n\nThe envoy asked, “How may he be awakened?”\n\nThe youth said, “Strike the golden bell beside his head, and he will wake.”\n\nWhen the bell was struck, the Master awoke. Realizing the imperial envoy had arrived, he hastily rose and adjusted his Daoist robes. He asked the envoy, “Why have you come again?”\n\nThe envoy replied, “When Master Chen Zongyan’s summons went unanswered, the emperor was greatly disappointed. He has specially sent me to summon you once more.”\n\nAfter burning incense and performing the rites, the Master listened as the edict was read: “We reflect that you, Master, are a recluse amid the white clouds, a lofty man of the azure grottoes. You have awakened to the mysterious gate of the Great Dao and penetrated the profound principles of the subtle and tranquil. We lament how swiftly the seasons pass, how fleeting the sun’s shadow. Suddenly, summer yields to the chill of winter; gradually, the face ages and the temples gray. Though We have mastered the strategies of governing the age, We have not yet grasped the mechanism of refining the nature. We neglect sleep and forget meals, thirsting for the worthy as one parched. Temporarily leave your grotto-abbey; mount the simurgh or crane and fly here. Stand in the palace chambers, where the court’s officials in their caps and sashes await you with reverence.”\n\nAfter reading the edict, the Master replied to the envoy: “This poor Daoist is a rustic man, mingling with deer and swine. I climb high to gaze afar, rinse my mouth by the streams. The pine lord and cassia father are my friends; the cloud peaks and rosy ridges, my haunts. Why should I covet the floating honors of wealth and nobility? I beg the imperial envoy to pause his carriage and rest in this mountain hut while I compose a reply memorial and poem to express my gratitude for this extraordinary favor.”\n\n*The memorial reads:*\n*I reflect upon my foolish clumsiness, dwelling deep in the ravines and gullies. By some mistake, I have received Your Heavenly Grace. Your servant lacks the extraordinary talents of Zhuge Liang; Your Majesty surpasses the profound virtue of the Han emperor. Your servant’s nature is that of the mountain elk; his bearing, that of the wild crane. He alone admires the carefree; cap and carriage are far from his fetters. Beyond the Azure Dragon Ridge, his butterfly dreams drift; idly watching the lotuses of the Jade Well, his poetic soul surges. He dines on mist and rosy clouds at the grotto’s mouth, gathers ferns and bracken amid the woods. Staff in hand, sandals on feet, he wanders at ease; body and mind, he is indolent and scattered. Refining the elixir in his crucible, he aspires to ascend as an immortal; shunning the world’s empty fame, he repeatedly guards against calamity. Relying on the fortune of encountering a Yao or Shun, he may roam freely like Chao Fu or Xu You. Happily, he spends his remaining years gazing afar upon this sagely age.*\n\n*Two quatrains read:*\n*Sitting in this sagely age, the age of Yao,*\n*Even a rustic fool from the marshes is summoned.*\n*I laugh at my lazy form—how could it be otherwise?*\n*With my meager talents, how dare I gaze toward the celestial court?*\n\n*Harmonizing the four qi by burning the elixir,*\n*Refining a thousand methods only to seek peace.*\n\nThe lofty halls of the Yellow Gate hold no allure for him; dwelling in leisurely seclusion surpasses holding office. The imperial envoy returned bearing his memorial and poems, yet he lacked the strength to rise and answer the summons. On the sixteenth day of the sixth month, he arrived at the capital and presented his writings to the virtuous Prince. Emperor Taizong, having read the memorial and poems, was deeply displeased that the Master had not come. On the twenty-ninth day of the same month, the Emperor sat in the Hall of Vertical and Horizontal Eaves and summoned the Inner Attendant Shi Bao, asking, \"Among the hundred officials, who is most eloquent in speech?\" Bao replied, \"The Vice Director of the Inner Treasury, Ge Shouzhong, is skilled in persuasion.\" Taizong summoned him and commanded Shouzhong to serve as envoy, bearing the imperial edict and poems to Cloud Terrace Abbey to summon Master Xiyi once more.\n\nOn the seventh day of the seventh month, the envoy arrived at the abbey but did not find the Master. The abbey’s caretaker, Daoist Yang Zixun, said, \"The Master, fearing the Emperor’s repeated summons, has fled to Jade Spring Abbey to sit in silent retreat.\" The envoy instructed Zixun to lead the way. Passing through the winding stone path, they reached the abbey. Announcing the imperial decree, they were received with incense and ritual. The edict read:\n\n*\"I, having received the Mandate of Heaven above and soothed the hearts of the people below, have stilled the blades of war so that the Four Seas are at peace, and spread transformation so that the Eight Directions know no slander. Ascending the throne to govern the multitudes, all rejoice with full mouths and drumming bellies, singing in unison of the Dao’s non-action. They dig wells and till fields to secure their livelihoods, knowing that great worthies are born into the world. With seas calm and rivers clear, I look to the noble man to save the age; though the wind sweeps the grass flat, he has not yet left the cliffs and valleys. His name fills the realm, yet his heart ever wanders the Penglai Isles, his spirit roams the vast and boundless. I have long known of the Yellow Emperor’s virtue in broadly bestowing blessings, and I regret not having mastered the methods of cultivation of Guangchengzi. Though the land be remote, the royal grace reaches even there. Yi Yin answered the call and went to Bo; Mencius followed the summons and came to Liang. Fate has its alignments, and rites allow for no excessive refusal.\"*\n\nThe imperial poem read:\n*Thrice I have summoned you, yet you do not come to court,*\n*Though a thousand li of rivers and passes should not deter your toil.*\n*Jade hewn from mountains must ultimately be obtained;*\n*Iron turned to gold has yet to be forged in the flame.*\n*Your purple robe, ample and flowing, should drape your form;*\n*The golden seal, its cord purple, may hang at your waist.*\n*With you, Master, to aid and counsel me,*\n*Why should I fear the myriad folk ceasing their songs?*\n\nHaving read the edict and poem, the Master was reluctant to answer the summons and sought to decline once more. The imperial envoy Shouzhong said, \"Three times the decree has come—you cannot persist in refusal. Have you not heard the words of the *Analects of Lu*: 'When the lord’s command summons, one does not wait for the carriage to be yoked before setting out'? How can an imperial edict be defied? And the *Book of Zou* says: 'To the shores of the land, none are not the king’s subjects.' You cannot refuse.\" Though unworthy, I have composed a poem for you:\n\n*A guest of the Three Peaks of Mount Hua,*\n*Dwelling in seclusion, you count not the years.*\n*Mist and rosy clouds sustain your livelihood;*\n*Clouds and waters compose your verdant home.*\n*You cultivate herbs by the thatched pavilion,*\n*Plant pines by the ravine’s edge.*\n*Though you but briefly leave your immortal cave,*\n*You may yet answer the Emperor’s call.*\n\nThe Master, having read the poem, was pleased and responded with a verse of his own:\n*In crane-feather cloak, fluttering like a carefree immortal,*\n*How could rush mats bear the pull of profit and fame?*\n*Lingering at Mount Hua, my heart aches at parting;*\n*Gazing back at Cloud Terrace, my eyes strain with longing.*\n*The world’s winds and waves are truly perilous;*\n*Forgetting schemes, gulls and crows are at ease.*\n*Just as I would lie down in my robes on the Three Peaks,*\n*Another celestial missive descends from the sun’s edge.*\n\nHaving composed his poem, the Master set out with the envoy. He left a farewell poem for his hemp-clad Daoist friends in the mountains:\n*Before the peaks of Mount Hua, two paths diverge,*\n*Several thatched huts, a single stream of clouds.*\n*You said my ears were dull—I knew this long ago;*\n*Of people changing, people being wrong, I have heard nothing.*\n\nThe hemp-clad Daoist replied with a poem:\n*Sitting alone in my thatched hut, far removed from the dust,*\n*I carry neither alms bowl nor master, day by day.*\n*Meeting others, I speak not of worldly affairs—*\n*Thus am I one who, when asked, has no business to attend.*\n\nThe Master, receiving the poem, silently grasped its meaning. Taking his leave, he soon arrived at the capital with the imperial envoy and lodged at Establishing Prosperity Abbey. That night, as he lay abed, he heard the palace bell toll and sighed, composing two quatrains:\n\n*A thousand gates, ten thousand doors, locked behind layered barriers,*\n*Stars arrayed in the void, all hushed and still.*\n*As the world’s right and wrong begin to quiet,*\n*The night watch’s drum echoes through the six streets, the first watch announced.*\n\n*The Silver River slants as night wanes,*\n*Pillowed, the heart’s reckonings remain unceasing.*\n*How pitiable are those entangled in the marketplace’s fame and profit—*\n*How many are ensnared, their dream-souls bound in toil?*\n\nThe Master slept until the fifth watch, when the dawn bell rang. He sighed again and composed another poem:\n*The jade clepsydra nears its end, the moon’s light sinks,*\n*A single clear chime pierces the cold note.*\n*It stirs the wanderer’s longing for home,*\n*Stealthily deepens the parting traveler’s sorrow.*\n*At the window, it startles open the eyes of fame and profit;*\n*By the pillow, it awakens the heart of right and wrong.*\n*Kings and emperors have all passed through this,*\n*Dynasties rising and falling, even unto this day.*\n\nHaving composed his poem, he washed and dressed. As dawn broke, he instructed the envoy to enter the palace first and announce, \"The Master has come to see the Emperor.\" The Emperor hastily commanded that he be brought before the palace gates and received in the Hall of Extended Glory. The Master wore a feathered robe, a Huayang cap, straw sandals, and a hanging sash. Received with the rites due a guest, he was granted a seat. The Emperor composed a poem and asked:\n\n*\"I know you have attained the Dao for many years,*\n*Daily swallowing several grains of elixir.*\n*Yet your temples show no white—how strange!*\n*And your face retains its youthful glow—how doubtful!*\n*Where do you lodge each night?*\n*Upon what altar do you fast at dawn?*\n*Would you deign to transmit your wondrous methods to this humble one?*\n*I would fain be as carefree as you.\"*\n\nThe Master replied with a poem:\n*I have attained the Dao for many years now,*\n*Daily swallowing the elixir of the two qi.*\n*When I drink the immortal’s brew, my temples darken;*\n*After eating the peach of Penglai, my youth is restored.*\n*At night, I lodge only at Cloud Terrace Abbey;*\n*At dawn, I fast upon the Altar of Dharma Records.*\n*If Your Majesty asks of my methods of cultivation,*\n*In the depths of Mount Hua, true leisure may be found.*\n\nTaizong, reading the Master’s response, was greatly pleased. At that time, the Emperor was preparing to campaign against Hebei. The Master admonished him to desist, but the army had already been mobilized. The Emperor commanded the Master to rest in the imperial gardens. When the troops returned, the campaign indeed proved fruitless.\n\nAfter sleeping for over a hundred days, the Master finally arose. The Emperor, astonished, bestowed upon him even greater honors and favor. Taizong then spoke to Master Xiyi in a leisurely manner: *\"My elder brother, the late Emperor Taizu, achieved great merit and profound virtue, yet you did not come to him. I, with humble merit and shallow virtue, have troubled you to descend to my vermilion steps.\"*\n\nThe Master replied: *\"The late Emperor had no need for this poor Daoist, but Your Majesty could not avoid summoning me once.\"*\n\nTaizong then asked: *\"In the days when Yao and Shun ruled the world, could such a time be restored?\"*\nThe Master answered: *\"Yao and Shun had earthen steps three feet high and thatched roofs untrimmed—such traces seem unattainable. Yet if one governs with purity and stillness, then even today may become an age of Yao and Shun.\"* The Emperor approved of his words.\n\nTaizong often invited the Master into the palace to converse, and later said to his chief minister Song Qi: *\"Chen Tuan cultivates himself in solitude, untouched by power or profit—truly a man beyond the world.\"* He sent an imperial messenger to escort the Master to the Ministry of State, where Qi and others asked: *\"Master, you have attained the Dao of profound silence and self-cultivation—can you teach it to others?\"*\nThe Master replied: *\"I have withdrawn to the mountains and wilderness, useless to the world. I know nothing of alchemical practices and have nothing to transmit. Even if I were to ascend to immortality in broad daylight, what benefit would it bring to governance? Your Majesty’s dragon countenance is noble and extraordinary, bearing the marks of both heaven and man. He comprehends the principles of order and chaos through the ages—truly a sagely and virtuous ruler. This is a time when ruler and minister unite in virtue to govern the realm. What cultivation could surpass this?\"* Qi and the others recorded his words and presented them to the Emperor, who read them with great delight.\n\nThe Master, summoned by imperial crane-edict to the capital, arrived at court in rustic attire. Taizong, admiring his transcendent demeanor, received him with the rites due a guest rather than a subject, lodging him in the finest quarters. There, in the secluded Western Pavilion, the Emperor engaged him in discourse on the mysteries of the Eight Simplicities and Nine Perfections, the essentials of the Four Awakenings and Seven Verdancies. Yet the profound insights shared in their private conversations remained unheard by others.\n\nTaizong commanded the Master to observe the future Emperor Zhenzong, then the Prince of Shou. Of the Emperor’s eight sons, Zhenzong was the third. The Master was led to the eastern palace, but the prince had not yet risen, so he turned back. When the Emperor inquired, the Master said: *\"At the prince’s gate, even the servants are future ministers and generals. What more need one know?\"* Those he had seen were the future Prime Minister Zhang Qi, Minister Yang Chongxun, and Marshal Guo Chengyou.\n\nWhen the Master was summoned to the palace, he heard that scholar-officials sought him out, wishing only to hear virtuous words for self-improvement. He said: *\"Do not return to places where fortune favors you. Do not linger in realms of ease, nor revisit lands of success.\"* Those who heard this regarded it as profound wisdom. As Master Kangjie’s poem says: *\"Cherish the good words left by the perfected—what seems advantageous is truly a disadvantage.\"*\n\nOne day at leisure, Taizong ascended the Eastern Corner Tower with the Master to idly observe the market below. Seeing a wealthy man in a tower who rose late to wash and dress, the Emperor asked his attendants: *\"Whose household is this?\"*\nSomeone replied: *\"One of the great merchants of the Eastern Capital.\"*\nTaizong then recited a poem:\n*\"Before others rise, I am already awake,\nAt dawn, a thousand affairs weigh on my mind.\nHow enviable is this rich man of the Eastern Capital—\nSleeping till the sun is high, still not yet risen.\"*\n\nThe Master responded with a poem:\n*\"Last night at the third watch, I dreamed in alarm,\nA single bell’s toll set ten thousand in motion.\nMost likely another court assembly at the golden palace—\nI, an officialless man, slept till dawn.\"*\n\nThe Emperor, delighted by the Master’s reply, intended the next day to appoint him as Remonstrance Grand Master. The Master firmly declined and instead composed *\"The Song of Retiring from Office\"* and a quatrain:\n\n*The Song:*\n*The Dao can be clear, the Dao can be still,\nIn clarity and stillness, seek true constancy.\nNeither covet nor cling—let life drift as it will,\nNor learn the folly of the deluded, full of fear and trembling.\nPeople laugh that I seek no office,\nBut office is the world’s greatest affliction.\nLow rank means being controlled by others,\nHigh rank means others groveling for favor.\nNow through Qin, now through Zheng,\nEast and west like a worm on a string.\nUntil a hundred years pass without rest,\nHow does it compare to my pure stillness?\nThe moon as my lamp, water as my mirror,\nA long-handled gourd holds my life’s breath.\nThough none attend me when I come or go,\nTo my left, a golden tortoise; to my right, a crane guides me.\nDrunk at sunrise, never to sober,\nYet again summoned by imperial decree.\nPeople see me and laugh,\nBut my heart holds a different scene.*\n\n*The Poem:*\n*Feeding on primal qi, clad in woven grass,\nI descend the mountain rarely, with nothing to do.\nI do not encroach on the weaver’s or farmer’s gain,\nYet still others whisper of right and wrong.*\n\nSeeing the Master’s firm resolve to refuse office and salary, Taizong asked if he had any strategies to aid the world and pacify the people, hoping to retain him. Master Xiyi replied: *\"From childhood, I admired the Dao; in my prime, I wandered the mountains. My heart abides in tranquility, silently attuned to the subtle winds of the mysterious. As for strategies to aid the world, I have not yet given them thought. I am rather fond of sleep—if Your Majesty would permit, I would return to the mountains.\"*\n\nHe then composed *\"The Lament of Resigning Office and the World\"*:\n*The Southern Dipper and Northern Dipper shift nightly,\nThe sun rises in Fusang, then sets in the west.\nThis world is as fleeting as wild horses,\nThe realm of fame as tumultuous as fermenting wine.\nPines and bamboo flourish, verdant even in winter,\nPeach and plum blossoms scatter, spring’s allure fading.\nSeeing through the dream of this dusty world,\nIn the depths of white clouds, one may dwell in seclusion.*\n\nTaizong said: *\"I summoned you hoping you would harmonize yin and yang, rectify the court’s governance, secure the state, and aid the people. Yet you speak only of the joys of the mountains and your love of sleep—is there truth in this?\"*\nThe Master replied: *\"Indeed.\"* He then presented *\"The Sleep Song\"*:\n*I love sleep, I love sleep,\nNo felt mat, no quilted cover.\nA slab of stone for my pillow,\nA straw cloak spread upon the earth.\nSleeping north or south, east or west—\nWherever I please.\nThunder crashes, lightning splits, Mount Tai collapses,\nThe boundless sea pours into the void.\nThe Black Dragon roars, startling gods and ghosts—\nYet when I am weary, I snore in slumber.*\n\nIdle thoughts drift to Zhang Liang, restless musings to Fan Li—what need to speak of Cao Cao, or mention Liu Bei?\nA handful of gentlemen, quarreling over mere trifles of pride.\nHow could they compare to this servant,\nOn the crest of the Pure Wind Ridge, amid drifts of white clouds,\nBrows unfurled, belly unknotted,\nTaking a single long sleep?\nWhat care if the crimson sun sinks in the west?\n\nHe later composed another verse:\n*Ask what in this world is best—*\n*Nothing surpasses rising late and sleeping early.*\n*Before the hermitage, tangled grasses weave my robe;*\n*Hunger is sated with pine seeds and mulberries, ever enough.*\n*Once tripped by a mountain stone’s edge,*\n*I could not rise, sleeping till dawn.*\n*All call me foolish, lost in slumber—*\n*Yet I pity their folly, burdened with cares.*\n\nIn the early years of Zhou Xiande, when visitors sought his dwelling, they found his door ajar, silence within—only the tracks of beasts and the cries of crows. A woodcutter on the mountainside once came upon his form, dust-shrouded, and drew near to see: it was the Master. Pressing a hand to his chest, he found it faintly warm; after a long while, breath returned, and the Master rose, saying: *\"My sleep was deep and sweet—why disturb me?\"* The prefect Luo Yanwei reported this to the court.\n\nTaizong, knowing the Master would not be swayed from his refusal to serve, sought to send him back to the mountains. The emperor ordered artisans to gather goods before the Jade Gate, their songs and clamor boasting of the realm’s prosperity, then invited the Master to ascend the terrace. *\"The capital’s abundance is thus—how can you bear to abandon me and return to the mountains, refusing to aid in governing the age?\"* The Master replied: *\"Birds and beasts nest in forests and foothills; fish and turtles roam rivers and lakes—each delights in its own way.\"*\n\nTaizong pointed to the throngs of people and carriages below, asking: *\"Do you see?\"* *\"I do,\"* said the Master. *\"What do you see?\"* *\"I see the rich clinging to life, the poor scrambling for fate.\"* Taizong fell silent. Soon after, he descended the Jade Gate and returned to the palace.\n\nThe next morning, the Master entered the court and firmly declined to remain, but the emperor earnestly sought his counsel on securing the world and aiding the people. The Master, without hesitation, took up brush and paper and wrote four characters: *\"Far and near, light and heavy.\"* The emperor did not grasp their meaning. The Master explained: *\"‘Far’ means to summon worthy scholars from afar; ‘near,’ to cast out sycophants close at hand; ‘light,’ to lighten the taxes of the people; ‘heavy,’ to heavily reward the three armies.\"* The emperor, hearing this, was greatly pleased.\n\nKnowing the Master could not be detained, Taizong hosted a farewell banquet in the side hall, ordering the two chief ministers to attend and compose poems in his honor. He also commanded Wang Zuo, the prefect of Huazhou, to visit and inquire after the Master’s needs, ensuring nothing was lacking. From then on, whether wise or unworthy, all within the realm heard of his renown and admired him; countless wished to take up staff and mat to study under him.\n\nAs he prepared to leave the capital, the Master composed *\"Parting from Court\"*:\n*Ten years of footsteps trod the red dust,*\n*Longing for green mountains, I dreamed of them often.*\n*Though the purple paths flourish, what compares to sleep?*\n*Though vermilion gates be noble, poverty is better.*\n*Grieved to hear swords and spears propping up a troubled lord,*\n*Weary of listening to pipes and songs clamoring to intoxicate men.*\n*I take my old books back to my old retreat—*\n*Wildflowers, singing birds, the same spring as ever.*\n\nTaizong, determined to see the Master return to the mountains, could not press him to stay. The emperor bestowed upon him a saddle adorned with tortoise and crane motifs, along with fine horses and other lavish gifts, but the Master firmly declined all but tea and medicine. He ordered an envoy to convey the Master in a comfortable carriage to the Cloud Terrace Abbey on Mount Hua, bestowing upon him the title *\"Master of Rare Serenity.\"*\n\nThe imperial edict read:\n*\"To the Daoist Chen Tuan, a man of lofty virtue in this age, a guest of successive dynasties: drawn by the flourishing culture of our reign, you came to pay homage. Without a fitting title, how could your pure example be made known? Let it be decreed that you be granted the title ‘Master of Rare Serenity.’\"*\n\nBefore parting, the Master left a quatrain:\n*High on Mount Hua is my palace,*\n*Stepping out, I ride the dawn wind through empty skies.*\n*No need to lock the gates of its halls with golden bolts—*\n*When I return, white clouds will seal them for me.*\n\nIn the early years of Taiping Xingguo, Taizong dispatched an envoy with a poem to summon him once more, but the Master declined, refusing to rise. Privately, he had foretold that the Mandate of Heaven truly rested with Emperor Zhangsheng. The imperial poem read:\n*Once you emerged from white clouds of a former court,*\n*Later news of you faded into silence.*\n*If now you would heed the summons,*\n*I would grant you all Three Peaks.*\n\nThe Master ultimately declined and did not go. The emperor then sent two women to attend him, to hold his towel and comb, but the Master refused them, replying with a poem:\n*Snow for flesh, jade for cheeks—*\n*Deep thanks to the lord for sending them to me.*\n*This hermit never dreamed of Wu Gorge,*\n*Vainly laboring clouds and rain to descend from Sunny Terrace.*\n\nAnother account holds that Emperor Xizong of Tang enfeoffed him as *\"Recluse of Pure Emptiness\"* and sent three palace women to tend to his needs, prompting him to compose a poem.\n\nTaizong’s *\"Ode to Master of Rare Serenity\"*:\n*The stalwart Daoist Chen Tuan of Mount Hua mingled in the world yet dwelled beyond it,*\n*Nurturing the vast, uncarved qi, aligning with the Lesser Weaving Star of the recluse.*\n*Unbowed before kings and lords, he kept his resolve in forests and valleys,*\n*Delighting in our harmonious rule, rejoicing in this era of sagely succession.*\n*Yet he journeyed far across rivers and roads, briefly visiting the capital,*\n*Where for ten days he was received with warmth, his presence a great boon.*\n*White clouds cannot linger in the imperial city,*\n*Fine titles are hard to tempt a man of attainment.*\n*Of old, the sagest Tang Yao had his external ministers in Chao and Xu;*\n*Though my virtue is meager, I would follow this precedent.*\n*Fearing some lack in the mountains, I have ordered Wang Zuo, prefect of Huazhou, to supply all your needs.*\n*Now you return to your old peaks as spring begins—*\n*Cherishing your lofty integrity, may you find all as it should be.*\n*Thus I send this message of care—may you take it to heart.*\n*The spring is cold—how have you been of late?*\n*This letter cannot say all that is in my heart.\"*\n\nThe *\"Edict Granting Tea and Silk\"*:\n*\"Ah! I, enthroned as the Nine-Five, though I have waged war for years, do so with a heart set on benefiting all things. Recently, my phoenix banners marched south, and the lands beyond the Yangtze came to court. Sincerity was repeatedly pledged before the army, and tribute of rare goods was laid at the palace steps. Having shown their allegiance, I ordered the troops to disband.\"*\n\nHaving long since left the dusty world behind, you dwell high above mundane things, naturally attaining the joy of carefree wandering, your heart unshaken by favor or disgrace. In stilling the clamor of the fleeting, you are truly worthy of praise. Thus, I bestow these gifts equally to honor your reclusive life. Now I grant you the following:\n\nThe air of Hetong is crisp, the spirit of Lian Peak numinous. Having embraced the Dao and known your proper place, you surely enjoy abundant blessings. As I gaze from the palace terrace, my waking thoughts turn to you. May you take this to heart.\n\nThe summer heat—how have you been of late? This letter cannot say all that is in my heart.\n\nI grant you thirty bolts of fine white silk, ten catties of wax-sealed tea, twenty catties of研膏 tea, and twenty catties of Yashan tea. Upon receipt of this edict, you may claim them.\n\nOnce, as you stood in the palace courtyard, you saw a golden figure holding a sword who cried out: \"Your Dao is complete—you shall have a place of return.\" For autumn is the season when the myriad things gather and return, and so I shall withdraw to the west. At that time, you were already over seventy. You then journeyed to Mount Hua, where you found the ruined foundations of the ancient Yuntai Temple. Clearing away the brambles, you made your dwelling there to fulfill the prophecy of \"return.\"\n\nYou composed *Fifty Stray Words from Three Peaks*. In those days, tigers preyed on people within the region. When you arrived at the place, you rebuked the tigers and ordered them to leave. From then on, they ceased their harm.\n\nDuring the Yongxi era, as you chanted verses gazing at the Immortal’s Palm Peak and sat facing the cascading stream, you pointed to a patch of ground and said: \"This was once the site of the North Star’s ancient abode. I once saw a divine being at night, clad in black robes and a crown, holding in his palm a vermilion script that read: *‘Here the Hall of Kai Tong, Palace of the Purple Tenuity Emperor.’*\" You then explained: \"Kai Tong arises from heaven and earth, and thus becomes the North Star.\" You ordered your disciples to construct it.\n\nHou Can and Zhang Guan, preparing for the imperial examinations, sought your counsel.\n\nYou said: \"For the two scholars Hou and Zhang, success in the imperial examinations this year will not compare to next year.\" That spring, their names were struck from the examination roster, but the following year, both passed—just as you had foretold.\n\n*Here ends Volume One of* The Record of the Recluse of Mount Taihua. *(Note: The character following* 竟 *appears as* 口 *in the original; the text is unclear, resembling* 碌*.)*\n\n---\n\n**Volume Two of** *The Record of the Recluse of Mount Taihua*\n*Compiled and supplemented by Zhang Xia of Nezhai, Registrar of Hezhong Prefecture, with the honorary title of Dengshilang*\n\nEarlier, when the loyal and upright Lord Zhang Guaiya visited Chen Tunan on Mount Hua to pay his respects, he expressed a desire to retire together on the mountain. Master Xiyi replied: \"For others, this may not be possible—but for one such as yourself, I would gladly yield half my place. Yet you hold an official post, and such matters cannot be discussed. If a household were ablaze, would you not rush to its aid?\" Lord Zhang took his leave, and Xiyi presented him with ten sticks of Xuanhao ink, a cake of Baiyuntai ink, and a corner of Shu zhan as parting gifts. To his disciple Bo, the lord remarked: \"This meeting has driven my poetic impulses into the bustling world.\" Xiyi replied: \"Take care, take care.\"\n\nAfter seeing Lord Zhang off, Bo said to his fellow disciples: \"This man is indifferent to worldly things. If he prospers, he will become a high minister; if not, he will lead armies.\" He then composed a quatrain for him:\n\n*Seeking the heavens in Shu is but commonplace,*\n*While feasts of song and dance rush to quell the flames.*\n*If granted leisure in Jinling to age in peace,*\n*Still must you tend the frost at your temples’ trace.*\n\nAt first, Lord Zhang did not grasp his meaning. Later, when he was reassigned to govern western Shu, he passed through Huayin in haste and had no time to visit Xiyi. He sent a poem to the master instead:\n\n*Foolish, I refused to dwell in woods and springs,*\n*Yet sought to place you in a stream so clear.*\n*Now hurrying southward beneath the stars’ bright wings,*\n*I turn my head, ashamed of Hua’s clouds so near.*\n\nUpon his return from western Shu, Lord Zhang wrote another poem:\n\n*Most men revere rank and glory’s sheen,*\n*Crowding the roads to greet my eastern return.*\n*Yet Hua’s high hermit must surely scorn me,*\n*Who’ve lost all truth to chase a fleeting name.*\n\nIn his later years, Lord Zhang developed a sore on his temple that resisted treatment. He eventually petitioned to retire to Jinling, where he died of the affliction—just as Xiyi had foretold.\n\nWhen the scholar Qian Ruoshui, later known as Lord Wenxi, was young, he visited Xiyi and sought to be invited into his mountain retreat. By the stove, he saw an elderly monk wrapped in tattered robes, eyes closed, warming himself by the fire. Qian bowed, but the monk only opened his eyes slightly. After a long while, Xiyi asked: \"What do you think?\" The monk shook his head and said: \"He lacks such bones.\" Later, when Xiyi saw Qian again, he said: \"At first, I saw your spirit and appearance were pure and refined, and thought you might cultivate the Dao of immortality. But this monk says you lack the bones of a transcendent—you are fit only to become a noble minister.\" Qian asked: \"Who was that monk?\" Xiyi replied: \"The Daoist of the Hemp Robe.\"\n\n*According to* The Record of Things Seen and Heard, *when Ruoshui was a candidate for the imperial examinations, he visited Xiyi on Mount Hua. Xiyi said: \"Come again tomorrow.\" Ruoshui returned at the appointed time and saw an old monk sitting by the stove with Xiyi. The monk studied Ruoshui intently for a long while without speaking, then drew in the ashes with a fire poker, writing the characters* \"cannot achieve\" *(做不得). Slowly, he said: \"A man swept back in the surging current.\"* Ruoshui took his leave, and Xiyi did not detain him. Later, Ruoshui passed the examinations, became Vice Minister of the Bureau of Military Affairs, and retired at the age of forty. Initially, Xiyi had seen in Ruoshui the bearing of an immortal, but his fate remained undecided. The monk, observing him, declared he \"could not achieve\" it—and so Xiyi did not keep him. Yet in being \"swept back in the surging current,\" the path to transcendence was not far off. The monk was the Daoist of the Hemp Robe.\n\nThe recluse Li Qi of Huayang claimed: \"During the Kaiyuan era of the Tang, few officials were ever seen. The hermit Lü Dongbin of Guanzhong possessed sword arts—able to traverse hundreds of *li* in an instant—and was regarded by the world as a divine immortal. He visited Xiyi’s abode several times, exchanging poems and songs as friends. People marveled at this.\" These are all accounts from old histories.\n\nWhen Chen Yaozuo governed Huazhou, he paid a visit to Master Xiyi. After they had settled and begun talking, a Daoist with a striking presence—his eyes like dots of lacquer, truly a man among immortals—entered and took a seat. Xiyi hastily yielded his place of honor. They exchanged a few words, all concerning matters beyond the world. Soon, the Daoist took a jujube from his leopard-skin pouch and offered it to Yaozuo, who declined. Xiyi rose to accept and ate it. Shortly after, the Daoist took his leave, and Xiyi saw him out beyond the temple gates. When they resumed their seats, Yaozuo asked: \"Who was that?\" Xiyi replied: \"Lü Dongbin.\" Yaozuo was filled with regret and astonishment.\n\nWhen Wang Shize of Qingyuan and others visited the master, Shize, who had been a servant, bowed at the foot of the steps. Xiyi smiled and descended, saying: \"He who humiliates others humiliates himself.\" He then invited Shize to sit to the right of the other scholars, declaring: \"In the future, you will surpass all these gentlemen.\" The following year, Shize indeed ranked first in the imperial examinations.\n\nOne day, Xiyi remarked: \"I once met the scholar Sun Junfang and the hermit Kang Pi. They told me: 'The Nine-Chambered Cliff on Mount Wudang is a suitable place for seclusion.' I went and dwelled there.\" When the remonstrance official Xu Zhongxuan, who had been dismissed from his post as governor of Chengdu, passed by his hut, Xiyi said: \"Before long, you will be appointed to an external post again.\"\n\nSoon after, Xu was promoted to Gentleman for Attendance and appointed Prefect of Henan. Yu, who had entered the capital for his annual audience, again sent a messenger bearing a letter and gifts to inquire about his fortunes. Xiyi said to his disciple Jia Desheng: \"Write a reply for me to the Gentleman for Attendance. From this point on, he will never emerge from seclusion again.\" Before long, Yu indeed passed away.\n\nGuo Hang, who in his youth had lived in Huayin, once lodged beneath the Daoist abbey. In the middle of the night, the master called out to him, urging him to return home at once. Hang, daunted by the distance, was reluctant to leave. The master accompanied him on the journey. After traveling one or two *li*, they heard someone crying out, bearing the news of his mother’s death. Only then did Hang realize that the master had given him medicine, and that if he had left promptly, he might have saved her. Upon arriving, he found that she had indeed died, but after administering the medicine, she revived.\n\nIn the oratory hung a large gourd from the wall. A Daoist named Jia Xiufu coveted it but dared not speak of it. Xiyi said to him: \"You have come with no other purpose—you merely desire my gourd.\" He ordered his attendant to take it down and give it to him.\n\nShen Fang, styled Mingyi, had secluded himself in Baolin Valley on Mount Zhongnan. Hearing of the master’s reputation, he went to meet him. One day, Xiyi instructed him to sweep the courtyard, saying: \"An esteemed guest will arrive.\" Sure enough, Mingyi appeared, dressed as a woodcutter, and bowed at the foot of the steps. Xiyi drew him up, saying: \"You are no woodcutter. In the future, you will hold a prominent office, and your name will resound throughout the realm.\" Mingyi replied: \"I have come for the sake of the Dao and virtue; official rank and emolument are not my concern.\" Xiyi smiled and said: \"A person’s nobility or lowliness is determined by fate. Your bones are destined for such things. Though you may hide in the mountains and forests, I fear you will not find peace. In time, you will come to know this yourself.\"\n\nLater, during the reign of Emperor Zhenzong, Mingyi was summoned to serve as *Sijian* and was led by the emperor’s own hand into the Dragon Diagram Pavilion to discuss matters of state. Upon resigning and returning to the mountains, he was appointed *Jianyidafu*, then later transferred to *Gongbu Shilang*. Xiyi also told Mingyi: \"If you do not marry, you may attain a middling lifespan.\" Mingyi followed his advice. He died at the age of sixty.\n\nEarlier, Xiyi had divined for Mingyi an ancestral burial site at the foot of Baolin Valley, but the grave’s precise location remained undetermined. After the burial, Xiyi remarked: \"The land is indeed excellent, but the grave’s placement is slightly too far back. For generations to come, it will produce renowned generals.\" Though Mingyi never married and had no sons, from his nephew Heng onward, his lineage produced celebrated military commanders to this day.\n\nAfter Xiyi’s passing, Mingyi erected a stele in praise of his master’s teachings, declaring: \"The Way of emperors and kings is as fleeting as clouds. Master Xiyi possessed profound insight. He once admonished me: ‘One day, you will encounter a wise ruler. Without seeking office, your name will resound at the celestial gates and echo across the realm.’ A name is the finest vessel of past and present, yet the Creator guards against its perfection. Between heaven and earth, no name remains unblemished. When your fame rises, something will surely tarnish it—beware of this.\"\n\nIn his later years, Mingyi indulged in excessive adornment, amassing wealth around Feng and Hao. His disciples, relatives, and dependents also exploited their influence to expand their holdings, increasing their annual income. Thus, he lost his reputation for purity. At the time, Wang Sizong, the prefect of Jingzhao, drunkenly insulted him, and a formal impeachment was submitted to the court—only to be halted by a general amnesty.\n\nIn the eighth year of the Xiangfu era, one morning, Mingyi rose from his mountain retreat, gathered his disciples for a feast, and burned all his writings and medicinal texts. After several rounds of wine, he passed away—an extraordinary man to the end.\n\nMaster Xiyi was fond of studying the *Book of Changes* and transmitted his numerological teachings to Mu Xiu, whose name was Bolong. Mu taught Li Zhicai, whose name was Tingzhi. Tingzhi taught Shao Yaofu of Kangjie, who passed the teachings on to Shen Fang. Fang transmitted them to Xu Jian of Lujiang, who in turn taught Yi Kuachang—a lineage that spread southward. Yet the world only regarded Xiyi as a divine immortal or a master of physiognomy, unaware of his true depth.\n\nOne day, Xiyi suddenly told his disciple Jia Desheng: \"A distinguished guest will arrive today. Go quickly and announce his coming.\" Soon after, a man in a short hemp robe and a green headscarf knocked at the door. Before Jia could report, the visitor vanished. Xiyi rushed out and pursued him for over a *li*, where he encountered an old man in deerskin. He asked: \"Has the one ahead gone far?\" The old man replied: \"That was the immortal Li Babai. When he moves, he covers eight hundred *li*.\" Xiyi then realized the deerskin-clad figure was the Perfected White Deer of Great Clarity, a Daoist adept. Though he could not catch Li, the deer-clad master also disappeared without a trace.\n\nXiyi said: \"I shall not remain in this world much longer.\" At the beginning of the *Duangong* era, he told his disciples: \"Next year, after the Zhongyuan Festival, I will journey to Mount Emei. Have lamps lit day and night in the stone chamber.\" His disciples reverently received his writings and solemnly accepted his instructions, weeping in sorrow. Xiyi said: \"Do not disrupt the natural order with your emotions—it would disturb my transformation.\"\n\nAs his end approached, Xiyi drafted a memorial, the contents of which no one saw. He sent his disciple Jia Desheng to the imperial court bearing the turtle and crane bestowed upon him, along with a dark-green horse. The emperor alone read the memorial for a long time, then returned the gifts to Desheng, further bestowing upon him a purple robe and the title *Wuzhen Xiansheng* (Perfected Awakened Master).\n\nAt the start of the *Duangong* era, Xiyi instructed Desheng: \"You must carve a stone chamber in Zhangchao Valley.\" By the second year, on the seventh day of the seventh month, the chamber was completed. Xiyi joyfully rode his horse straight to the valley. Upon reaching the winding path where dawn broke over the bowl-shaped rock, he dismounted and climbed by grasping vines and creepers. By dusk, he arrived at the chamber, laughing heartily several times before telling his disciples: \"This cliff rivals Mount Taihua in grandeur, its *qi* pure and its scenery sublime—this is where I shall return.\" He then wrote a memorial of several hundred words, the gist of which read: \"The great cycle has ended; the sagely court is hard to leave. On the twenty-second day of this month, I shall transform my form beneath Lotus Peak, within Zhangchao Valley.\"\n\nOn the appointed day, lamps were lit. At dusk, he ordered them extinguished and instructed his disciples to rest. At dawn, he was found dead, his left hand propping up his cheek. He had lived one hundred and eighteen years. For seven days afterward, his limbs remained warm. A five-colored cloud shrouded the cave’s entrance, lingering for days without dispersing.\n\nLater, an imperial envoy arrived at Mount Emei, where a visitor sought an audience. The man was imposing in dress and bearing, introducing himself as Dongming Zhuanshi. He spoke at length of matters concerning Mount Hua, and only afterward did the envoy realize this was Master Chen of Mount Hua. He hastily ordered the man summoned, but he had vanished without a trace.\n\nHe styled himself Fuyaozi. His disciples and fellow scholars who had gathered with him were all recorded afterward to inspire later generations.\n\nMaster Huian’s *Comprehensive Register of the Alchemical Furnace* states: During the reign of Emperor Shizong of Zhou, the reclusive Master Chen Tuan of Mount Hua was summoned to court and questioned about the arts of ascending to immortality and transmuting base metals into gold. He replied, “Your Majesty rules as Son of Heaven—should you not devote yourself to governing the realm? What need have you for such things?” The emperor then sent him back to the mountains, decreeing that local officials should regularly inquire after his well-being.\n\nHu Shi remarked: What Chen Tuan possessed was beyond Emperor Shizong’s comprehension. To ask about ascending to immortality and alchemy was indeed crude. Though Chen Tuan’s response about governing the realm hinted at the truth, Shizong failed to inquire further about the Dao of governance.\n\nThe master cleared the brambles and built his chamber atop the peak. During the Taiping Xingguo era, Emperor Taizong repeatedly bestowed edicts, gifts, and imperial poems upon him, summoning Chen Tuan to court. Officials were ordered to expand his hermitage, and funds from the imperial treasury were allocated to construct an altar and halls, the scale of which can still be seen today.\n\nThe master composed *Eighty Chapters on Pointing to the Mystery*, *Fifty Poems on Entering the Chamber and Returning to the Elixir*, and *The Angler’s Pool Collection* of over ten thousand characters. All these works meticulously expound the subtleties of the Dao, encapsulating the ultimate truth. His words are concise yet profound, allowing readers to grasp their meaning intuitively.\n\nThe master enlightened the emperor’s mind and subtly guided his grand designs. Taizong wished to appoint him as Remonstrance Grand Master, but the master firmly declined, and the decree was never issued. In the year of his transformation, he was one hundred and eighteen years old.\n\nHe claimed to perceive the hidden patterns of fate, knowing the future and discerning the past, delving into the profound and exploring the mysterious in ways nearly unfathomable. Yet he never engaged in bizarre or ostentatious practices. Thus, the master’s Dao remained vast and elusive, and those who heard of his renown—regardless of wisdom, foolishness, nobility, or humility—were all delighted by his example.\n\nAfter the master’s passing, his disciple, the Venerable Zunshi Zeng, at the guidance of Minister Fan Wenzheng, obtained *Fifty Poems on Entering the Chamber and Returning to the Elixir* from Jingzhen Abbey in the capital, *Three Peaks’ Allegories* from the recluse Li Ning of Mount Taihua, *Eighty Chapters on Pointing to the Mystery* from Zhang Wumeng of Chicheng, and *The Angler’s Pool Collection* from the scholar Zhang Zhongyong. In total, over three hundred pieces were compiled into the master’s collected works, along with *Essentials of Nourishing Life* and *Li the Perfected One’s Methods of Ingesting Elixirs*.\n\nAn imperial poem bestowed upon him reads:\n*Only within the self lies the great return,*\n*The womb-spirit’s moon-palace hangs in autumn’s sky.*\n*Who can distinguish the three numinous symbols?*\n*The corpse’s purity and clarity arise naturally.*\n\nThe emperor also granted him a seal-script inscription of *Hall of Light* and a flying-white calligraphy of *Purity* and *Stillness*.\n\nWhen Emperor Zhenzong offered sacrifices at Fenyin, he halted his procession at Huayin and twice visited the Cloud Terrace. Gazing upon the master’s portrait, he stood in contemplation for a long while. He then exempted the temple’s fields from taxes and summoned the Daoist Wu Zihua and others, bestowing upon them purple robes.\n\nZhang Fangping, traveling between Qin and Shu, reverently paid homage to the imperial portrait and later venerated the reclusive Master Chen. Reflecting on those who pursued immortality, he said: “The divine is formless, and the Dao is omnipresent. The divine is that which subtly permeates all things. Only through the divine can one achieve speed without haste, arrival without movement, and effortless union—this is the perfected person. Thus, one may transcend life and death, fathom transformations, and return to the primordial origin of *qi*’s cyclical flow, the natural essence and function of the four images. The profound principles of *Pointing to the Mystery* have already taken shape. How could the nine chambers below be merely a gathering place for deer and companionship with trees and stones?”\n\nThe master possessed a purple complexion and green veins, with striking features, square pupils, and a pure voice. His learning encompassed the Nine Schools and the Hundred Masters, all of which he saw through with penetrating clarity. His Dao was profound and inexhaustible, elusive and unpredictable. Truly, he would ride the clouds and mount the sun and moon, roaming beyond the four seas—how could he be compared to those who indulge in bizarre tricks and deceptive marvels to deceive the world and seek fame? What need had he for such things?\n\nWhen the master was summoned as a recluse and granted an audience, he was offered the post of remonstrance official. Emperor Zhenzong treated him with exceptional courtesy, and his name resounded throughout the realm. Later, he requested to return to Mount Zhongnan, where he grew arrogant and insolent due to imperial favor.\n\nWhen Wang Sizong governed Chang’an, the master arrived, and all officials from the vice-prefect downward bowed to him. The master merely inclined his head slightly and received them with hands lowered. Sizong inwardly resented this. When the master summoned his nephew to bow, Sizong remained seated to receive the obeisance. The master grew angry, but Sizong said, “Earlier, the vice-prefect and others bowed to you, and you supported them. This is but a commoner, yet I, a *zhuangyuan* graduate of high rank, am unworthy of your sitting to receive my bow?” The master replied, “You won your *zhuangyuan* by wrestling—what is there to boast of?” Enraged, Sizong submitted a memorial stating that the master’s talents and knowledge were unremarkable, that he was a fraud who stole empty fame, and that the emperor’s esteem and promotion of him to high office would invite ridicule and foster deceit. He also mentioned that when the emperor had summoned Wei Ye, Ye had shut his door to avoid the summons, whereas the master had secretly curried favor with powerful officials to recommend himself. He further exposed several of the master’s clandestine affairs. Though the emperor did not pursue either side, his regard for the master gradually waned.\n\nWhen Zhong Fang retired to his estate on Mount Zhongnan, many disciples and scholars gathered around him. He was fond of wine and personally cultivated fields and forests to brew his own. His residence boasted the beauty of forests and springs, secluded and exquisite. Hearing of this, Emperor Zhenzong dispatched an imperial envoy with painters to depict the scene. When the painting was unveiled, the emperor summoned his ministers to view it, sighing in admiration.\n\nLater, when Gantang Wei Ye’s dwelling was found to have a similarly secluded charm, the emperor sent artists to capture it as well. Thus, Wei Ye wrote a poem:\n*Mu Xiu, Bozhang of Wenyang,*\n*Later resided in Caizhou, learning from Tu Nan.*\n\nMu Xiu was bold and unrestrained in his youth, his temperament narrow and seldom agreeable, often traveling between the capital and Luoyang. Someone once inscribed his verses on a palace wall, and when Emperor Zhenzong saw them, he sighed in deep admiration, asking his attending ministers, \"Whose poetry is this?\" One replied, \"It is Mu Xiu’s.\" The emperor said, \"With writing like this, why have the ministers not recommended him?\" Ding Jinqong, who was present, remarked, \"This man’s conduct does not match his words.\" Thereafter, the emperor no longer inquired about him.\n\nIn truth, Bozhang and Jinqong had been friends in their commoner days. When Jinqong was appointed as an official to Kuizhou, Bozhang was still without office. They met at Hanshang, where Jinqong expected Bozhang to offer formal greetings first, but Bozhang left without even a bow. Jinqong bore a grudge, and thus spoke ill of him before the emperor. Later, when Jinqong was demoted to Zhuhai and passed through Daozhou, Bozhang wrote a poem:\n\n*I marvel that under the virtuous Yu, governance failed,*\n*Why were the Four Fiends not exiled to distant lands?*\n\nThis revealed their mutual enmity.\n\nIn the second year of Xiangfu, Bozhang passed the imperial examination under Liang Gu’s sponsorship and was appointed as a legal assistant in Haizhou. For composing a document as vice-prefect, he was stripped of his rank and banished to Chizhou. His collected works include the poem *\"Autumn Gathering at Qiupu\"* which recounts these events in detail. Later, upon receiving amnesty, he was assigned as a literary aide in Yingzhou, and thus was known in his time as Military Aide Mu.\n\nIn his old age, he grew increasingly impoverished. His family possessed Tang editions of the collected works of Han Yu and Liu Zongyuan, so he begged funds from close acquaintances, raised money to hire craftsmen to carve printing blocks, and printed several hundred copies. He carried them to the Xiangguo Temple in the capital, where he set up a stall to sell them. Bozhang sat beside the stall, and when several scholars approached to browse, he would snatch the books away, glaring and saying, \"If any of you can recite a single piece without missing a word, I shall gift you an entire set.\" As a result, the books remained unsold for over a year.\n\nScholars of the time were preoccupied with tonal patterns and prosody, unaware of ancient-style prose. Bozhang was the first to advocate for it, followed later by Yin Yuan and the Zi brothers, Shi and Ru. He also transmitted his *Spring and Autumn* scholarship to Li Zhicai, styled Tingzhi, a native of Qingzhou, who was unconventional and unconstrained. Tingzhi studied under Bozhang with reverence, his nature stern and impatient—if slightly displeased, he would scold or reprimand. Yet Tingzhi served him with deference, as one would a father or elder brother, never showing weariness.\n\nAfter passing the imperial examination, Tingzhi was appointed as a judicial officer in Mengzhou. Unrestrained and indifferent to formalities, he often clashed with the prefect, Lord Fan Zhongxian, who grew displeased. Yet Tingzhi remained unperturbed. Later, when Zhongxian was transferred to Yan’an as a military commissioner, many officials saw him off beyond the city limits, but Tingzhi only bid farewell in the outskirts. When others reproached him, he said, \"If I were to see off the prefect in such a manner another time, it would be excessive. Sincerity should match propriety. Lord Fan does not truly know me, so to send him off beyond the borders would be insincere. How could I act insincerely toward him?\"\n\nSoon after, Zhongxian was demoted to governor of Anlu and passed through Luoyang. None of his former subordinates from the Three Cities visited him—only Tingzhi called on him. Zhongxian then began to praise him, and thus came to value him.\n\nShao Yaofu’s son once said: Tingzhi had served as magistrate of Gongcheng, under the jurisdiction of Weizhou. At the time, my late father, Kangjie, was observing the mourning period for his grandmother. He built a hut atop Baiyuan on Mount Sumen, living in plain clothes and coarse food for three years, tending the hearth himself to care for his grandfather. Tingzhi, hearing of my father’s diligent study and resolve, visited his cottage and asked, \"What are you studying?\" My father replied, \"The learning for imperial examinations.\" Tingzhi said, \"Beyond the imperial examinations lies the learning of principle and righteousness—do you know of it?\" My father said, \"I do not. I would gladly receive your instruction.\" Tingzhi said, \"Beyond the learning of principle lies the learning of the patterns of things—do you know of it?\" My father said, \"I do not. I would gladly receive your instruction.\" Tingzhi said, \"Beyond the learning of the patterns of things lies the learning of nature and destiny—do you know of it?\" My father said, \"I do not. I would gladly receive your instruction.\" Thereupon, my father transmitted his learning.\n\nTingzhi later served as Palace Attendant and Acting Judicial Officer of Zezhou. Liu Yisou of Ze, though late in joining his school, studied calendrical astronomy under him and became renowned as a scholar. As for the study of the *Yijing*, only my father truly mastered it.\n\nIn his youth, Kangjie (Shao Yong) was self-assured in talent, ardent and ambitious. As his learning deepened, he aspired to lofty heights, believing the affairs of the former kings could surely be realized. Yet as his years advanced and his virtue matured, he turned his mind to the sublime and luminous. Observing the movements of Heaven and Earth, the waxing and waning of yin and yang, he grasped the transformations of the myriad things. Thereafter, he yielded in compliance, his spirit vast in return. For thirty years in Luoyang, he dwelt in a thatched hut with walls of woven reeds, barely shielding him from wind and rain, tending the stove himself to care for his parents. Yet he lived with ease, lecturing at home, never forcing his teachings upon others. Still, those who sought his counsel grew daily. The villages and towns were transformed by his influence, and his renown spread near and far. Scholars traveling to Luoyang would bypass the official residences to visit his humble abode.\n\nThe Master’s virtue and qi were pure and unadulterated. In speech, he always grounded himself in benevolence, righteousness, loyalty, and trust. He delighted in extolling others’ virtues but never spoke of their faults. Thus, the worthy rejoiced in his virtue, while even the unworthy were transformed by his influence. His contributions to enriching customs and cultivating talent were immense.\n\nThe Master’s learning came from Li Tingzhi, who received it from Mu Bochang. Tracing its origins, its lineage was long and well-founded. Yet the Master’s learning was pure and untainted, vast and boundless—much of it was his own attainment. Though summoned to office, he declined, responding to his fellow villagers with this poem:\n\n*Through life I’ve done no knitted-brow deeds,*\n*The world should harbor no gnashing teeth.*\n*Why need rain to send off falling blossoms?*\n*Must spring adorn old things anew?*\n*Fortunate to live under Yao and Shun as true sovereigns,*\n*I leave the recluses to their hermitage beyond court.*\n*A sick man of sixty knows his place—*\n*Why trouble the overseers with vain pleas?*\n\nZhang Shizheng’s teeth had grown sparse and loose by age fifty. More than a decade later, Chen Hong recorded in *Dai Li Ruo Dao* that he once obtained a medicinal formula, which his uncle said: \"During the *Tian Sheng* era of the Yuan and Heng reigns, I ascended Mount Hua’s summit and reached the old foundation of the Bright Star Shrine, where I found a broken stele. Its inscription bore an ancient text—a song for a remedy to blacken hair and strengthen teeth:\n\n*Soap pods, ginger fresh, and wild guess,*\n*Shengma from the West, Shu dihuang from the land of Shu.*\n*Mulberry twigs, eclipta, and pagoda-tree fruit,*\n*Asarum, lotus stems, and lotus leaf hearts—all in equal measure.*\n*Burn with green salt in equal parts, then grind to fine powder,*\n*And use it well to firm teeth and darken hair.*\n*Who would know the world holds such an immortal’s formula?*\n\nThis was the formula of Master Xiyi.\n\nThe scholar-recluse Wei Ye, styled Zhongxian, was a native of Shanzhou. He lived in a thatched cottage in the eastern outskirts, where water and bamboo created a scene of refined beauty. Fond of playing the zither and composing poetry, he lived in austere simplicity yet was widely known in his time. The prefects before and after all treated him with respect. When the emperor offered sacrifices at Fenyin and passed his dwelling, he saw Wei Ye from afar beneath the pines, teaching cranes to dance. The True Ancestor said, \"I must visit this place.\" He sent word ahead, but as the imperial carriage drew near, Wei Ye carried his zither and led the cranes over the wall to depart. The emperor arrived at the mountain hermitage but did not find him. He left a note on the door, saying: \"I came with Kou Zhun.\"\n\nLater, an envoy was sent to summon him, but he declined on grounds of illness. Wei Ye wrote a poem in praise of Minister Kou:\n\n*All former ministers came and went in haste,*\n*Yet you alone remained in office for fifteen autumns.*\n*Having completed rites at Mount Tai and Fenyin,*\n*Now you may well accompany Red Pine on his wanderings.*\n\nKou read it and beamed with delight, responding with gifts of wine, tea, and medicinal herbs.\n\n*The Plain Compilation* states: My late father’s letters contained several copies of this poem in Kou’s own hand. At dawn, upon receiving the poem, he was moved to reflection. Though he repeatedly declined due to illness, he was eventually promoted to Grand Commandant and Supervisor of the Jade Purity Luminous Response Abbey.\n\n*Accounts of the Late Wang Wenzheng* records Wei Ye’s words to Kou Zhun: \"Since ancient times, those whose merit and fame shook the world have seldom met a good end.\" He then presented this poem:\n\n*Go well to heaven and renounce wealth and honor,*\n*Then return to the earth to become a divine immortal.*\n\nWhen Kou was later demoted, he regretted not heeding Wei Ye’s advice.\n\n*Collected Works of Master Wen* notes: Wei Ye’s son, named Xian, also declined office. During the *Huang You* era, he was granted the title \"Recluse of Pure Leisure.\"\n\nThus concludes *Records of Mount Hua and Master Xiyi*, Volume Two.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太华希夷志 经名：太华希夷志。 元账辖编撰。 二卷。 底本出处：《正统道藏》洞真部记传类。 太华希夷志序 愚除晋宁河中府之幕职，密迩华山，稔闻希夷先生遗事，公务之暇，采古书所录，或谚语之谈，其高风峻节，信乎前宋一代之异人也，故作《太华希夷志》，以纪之。 先生明易，深造玄妙之理，视人之祸福、物之休咎，其应有如曹龟。 当五代之时，有拨乱济世之志，所学得皇王帝伯之道，闻宋太祖登极，知天下已定，遂入华山为道士，征召不至。 及太宗即位，三宣至阙下，待以宾礼，，赐坐与语，所论事之凶吉，靡不征验，欲拜官，坚辞弗受。 不久，放还山迹。 虽方外之士，胳合中庸之道，其脱落尘世，泥滓轩冕，傲睨公侯，视万乘若僚友，恬退高隐，不尚势利，足抑奔竞之流，可追配巢由严陵之节，其崇名教，厚风俗，以助万一云。 回顾吮瘫舐痔，奴颜婢膝，昏暮扣人之门户，骄人於白日者，犹酱瓶之酝鹦，奚足论哉．辖远居保郡，官除蒲川，为家贫不免二千里来之任。 初，两任教官，连仕县职，馆阁名公巨儒，累举词翰之选，当路龃龉，不果用。 仆耻於奔竞，故碌碌居州县之职，以代耕未能展平生读书之志，恒郁郁不遂。 因阅古传记，感希夷先生之高节，编次成一书，俾新学之士激励其志，内有差讹，鄙俗传者之误，志其固陋，就撰以补缀之，以写高远之趣，庶几有取焉。 延佑甲寅秋七月己未日，讷斋张辖序。 太华希夷志卷上 登仕郎河中府知事讷斋张辖纂集补撰 先生名搏，字图南，亳州贞源人。 幼岁戏渴水，一作涡水一青衣媪抱置怀中，乳之曰：令汝更无嗜欲，聪悟过人。 青衣媪者疑辰星之精及长，习举业。 后唐长兴中，试进士，不第。 隐居武当山九室岩，辟谷炼气，二十余年。 或传夜静焚香读《易》，有五老人至，应眉皓发，容貌古怪，常来听诵，居日久，搏问之，老人对曰：吾侪即兹山日月池龙也，此问玄武据临之地，华山是先生栖隐之所也。 异日，希夷默坐，五龙忽诣，令先生闭目，凌空驭风，终宵至华山，置坐於盘石之上，开目视之，不见五老人去向。 或云睡法即龙教也。 龙善睡，故云。 多闭门不出，独坐至百余日不起。 周世宗召至阙下，令於禁中肩户以试之，月余，始开，熟寝如故，始异之。 因问以黄白之术，搏曰：陛下为天下君，当以苍生为念，岂宜留意於此乎？ 世宗不悦，放还山，赐号白云先生，令长史岁时存问。 先生负经济才，初五代问自晋汉之际，每闻一朝革命，辄颦蹙数日，人有问者，瞪目不答。 先生揽镜自照曰：非仙而即帝，其自任如此。 宋太祖与赵普游长安，希夷逢之，笑而堕驴曰：真人亦在世矣。 辄握太祖之手曰：可市饮乎？ 太祖曰：可。 与赵学究同往。 希夷睥睨普曰：也得，也得。 相随入酒肆，普坐席左，搏怒，一手引之曰：紫微帝垣一小星，辄据上次，可乎？ 斥之，使居席右。 已知帝王有征矣。 后先生引恶少数百，入汴州中，路闻太祖登极，惊喜大笑，问其故，又大笑曰：自此定矣。 诗曰：够够四十年来睡，不觉束方日已明。 先生即入华山，隐居为道士，宋太祖累征不至。 及太祖崩，太宗即位，至道元年四月十日，帝坐垂拱殿，时和岁稔，化理均平，闻先生之名久矣。",
      "translated_text": "**The Record of Master Xiyi of Mount Taihua**\n\n**Title:** *The Record of Master Xiyi of Mount Taihua*\n**Compiled by:** Zhang Xia of the Yuan Dynasty\n**Two fascicles.**\n**Source text:** *Daoist Canon of the Zhengtong Era*, \"Biographies and Records\" section of the *Dongzhen* Department.\n\n---\n\n### **Preface to *The Record of Master Xiyi of Mount Taihua***\n\nWhile serving as a minor official in Jinning, Hezhong Prefecture, I lived in close proximity to Mount Hua and often heard tales of Master Xiyi’s legacy. In my spare time from official duties, I gathered accounts from ancient texts and folk sayings. His lofty conduct and unyielding integrity truly marked him as a singular figure of the former Song dynasty. Thus, I compiled *The Record of Master Xiyi of Mount Taihua* to preserve his memory.\n\nThe Master was well-versed in the *Book of Changes* and delved deeply into its profound mysteries. He perceived the fortunes and misfortunes of men and the auspices of things as clearly as if reading the cracks of a tortoise shell.\n\nDuring the Five Dynasties, he harbored ambitions to restore order and save the world, mastering the Dao of emperors and kings. When he learned of the ascension of Emperor Taizu of Song, knowing the realm was settled, he entered Mount Hua as a Daoist and declined all summons.\n\nUpon Emperor Taizong’s enthronement, the Master was thrice invited to court and received with the courtesy due a guest. Seated beside the emperor, he discoursed on matters of fortune and misfortune, all of which proved accurate. Though offered an official post, he firmly declined.\n\nSoon after, he was permitted to return to his mountain retreat. Though a recluse beyond the mundane world, his conduct aligned with the *Doctrine of the Mean*. He cast off worldly dust, disdaining rank and wealth, and regarded princes and nobles with the ease of peers. His serene withdrawal and lofty seclusion, free from the pursuit of power and profit, served to curb the ambitions of the avaricious. His integrity may be compared to that of the ancient hermits Chao Fu and Xu You, or the recluse Yan Guang. In upholding moral teachings and enriching customs, he rendered no small service to the age.\n\nIn contrast, those who grovel like leeches, flatter like slaves, knock on doors at dusk, or lord over others in broad daylight are but fermented dregs in a jar—what worth have they to speak of?\n\nI, Xia, reside far from the capital in Baojun, having accepted the post of magistrate in Puchuan due to family poverty, journeying two thousand *li* to assume office. Earlier, I served twice as a teaching official and held successive county positions. Though I associated with renowned scholars of the imperial academy and was repeatedly recommended for literary honors, my path was obstructed by those in power, and I was never appointed. Ashamed of self-promotion, I have languished in minor local posts, substituting for the plow while my scholarly aspirations remain unfulfilled, leaving me perpetually discontent.\n\nUpon reading ancient biographies, I was moved by Master Xiyi’s noble character and compiled this record to inspire young scholars. Should errors or vulgar distortions appear—due to the limitations of my sources—I have done my best to correct and supplement them, striving to capture the Master’s lofty spirit. May this work find some merit.\n\n**Written on the day *jiwei* of the seventh month, autumn of the *jiayin* year of the Yanyou era (1334), by Zhang Xia of Nezhai.**\n\n---\n\n### **The Record of Master Xiyi of Mount Taihua, Fascicle One**\n\n**Compiled and supplemented by:** Zhang Xia of Nezhai, *Dengshilang*, Magistrate of Hezhong Prefecture\n\nThe Master’s name was Bo, styled Tunan, a native of Zhenyuan in Bozhou. In his childhood, while playing by the water—some say the Wo River—a green-clad woman cradled him in her arms and nursed him, saying, “Henceforth, you shall be free from desires and surpass others in wisdom.” This green-clad woman was likely the essence of the celestial star Chenxing.\n\nAs he grew, he studied for the imperial examinations. During the *Changxing* era of the Later Tang, he sat for the *jinshi* exams but did not pass. He retreated to the Nine-Chambered Cliff of Mount Wudang, where he practiced *bigu* (abstention from grains) and refined his *qi* for over twenty years.\n\nSome say that on quiet nights, he would burn incense and recite the *Book of Changes*. Five elders would appear—white-browed, hoary-haired, and of strange countenance—listening to his recitations. After many days, Bo questioned them, and the elders replied, “We are the dragons of the Sun and Moon Pond of this mountain. This is the domain of the Dark Warrior. Mount Hua is your destined place of seclusion.”\n\nOne day, as Xiyi sat in silent meditation, the five dragons suddenly arrived. They instructed him to close his eyes, and he was borne aloft by the wind, arriving at Mount Hua by dawn. When he opened his eyes, he found himself seated upon a boulder, with no sign of the elders’ departure. Some say his sleeping method was taught by the dragons, for dragons are skilled in slumber.\n\nHe often remained secluded, sitting motionless for over a hundred days. Emperor Shizong of Zhou summoned him to court and had him confined in the palace, testing his endurance by sealing the door. After more than a month, the door was opened, and he was found in deep slumber as before. The emperor marveled at this and inquired about the arts of alchemy. Bo replied, “Your Majesty rules the realm; you should concern yourself with the people’s welfare. How can you fixate on such trifles?” The emperor was displeased and sent him back to the mountains, bestowing upon him the title “Master of White Clouds” and instructing the local prefect to inquire after him annually.\n\nThe Master possessed the talent to govern the world. During the Five Dynasties, whenever a dynasty fell, he would frown for days. If questioned, he would stare in silence. Gazing into a mirror, he declared, “If not an immortal, then an emperor.” Such was his self-assurance.\n\nWhen Emperor Taizu of Song traveled to Chang’an with Zhao Pu, Xiyi encountered them. Laughing, he dismounted his donkey and said, “A true man is indeed in the world!” Taking Taizu’s hand, he asked, “Shall we drink?” Taizu agreed, and they went with Zhao the scholar. Xiyi glanced at Pu and said, “He’ll do, he’ll do.” Entering a tavern, Pu sat to the left, but Bo grew angry, seizing his hand and saying, “A mere star of the Purple Tenuity—how dare you take the higher seat?” He rebuked Pu and made him sit to the right. Thus, he discerned the imperial destiny.\n\nLater, the Master led hundreds of ruffians into Bianzhou. Upon hearing of Taizu’s enthronement, he burst into joyous laughter. When asked the reason, he laughed again and said, “Now the realm is settled!” He composed a poem:\n\n*Forty years of sound sleep—*\n*Unnoticing, the eastern sky has dawned.*\n\nThereafter, he entered Mount Hua, living as a Daoist. Emperor Taizu repeatedly summoned him, but he refused to come. After Taizu’s death, Emperor Taizong ascended the throne. On the tenth day of the fourth month of the first year of the *Zhidao* era (995), the emperor sat in the *Chuigong* Hall. The season was mild, the harvest abundant, and governance harmonious. The emperor had long heard of the Master’s renown.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1235,
      "start_sentence": 0,
      "end_sentence": 45,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.24358367919922,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\太华希夷志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "厌纷华之世，喜清争之教，差殿束头供奉官陈宗颜为使，资昭书并御诗往华州华阴县华山云台观，宣陈图南先生至。 四月十四日抵华阴县，县宰着作郎丁寿明迎接入县，时薄暮，止宿焉。 来晓同天使四月望日，至云台观，与道士锺希晦相见，引导见先生，报曰：皇帝宣师父先生。 盥手焚香，拜橙毕，听韶曰：朕自即位以来，克服八方，威临万国，遐迩悉归於皇化，华夷亦致於隆平。 知卿抱道山中，洗心物外，养太素浩然之气，应上界少微之星，节配巢由，道遵黄老，怀经纶之长策，不谒王侯； 蕴将相之奇才，未朝天子，卿不屈於万乘，身奚隐於三峰，乘风犹来，举朝称贺。 御诗曰：华岳多闻说，知卿是姓陈。 云问三岛客，物外一高人。 丹鼎为活计，青山作近邻。 朕思亲欲往，社稷去无因。 先生听罢韶书并诗，对天使曰：贫道栖真物外，修炼山问，无意求．名，有心慕道，不愿仕也。 待天使礼毕，未肯来朝，即答回表并诗云：伏念山野生居昊地，长自汉南，成童以习业儒林，壮岁而褊游洞府，性同猥乌，心若土灰，不晓仁义之浅深，安识行藏之去就。 败荷作服，脱摔为冠，体有青毛，足无草履，有意慕羲轩之道，无心诵管乐之篇，《南华》、《道德》频看，黄阁玉堂绝念，数行紫诏，徒烦彩凤衔来，一片闲心，已被白云留住。 苟临轩陛，贻笑圣明。 诗曰：九重特降紫泥宣，才拙探居乐静绿。 山色满庭供画障，松声万壑即琴弦。 无心享禄登台鼎，有意求仙到洞天。 轩冕浮荣绝念虑，三峰只乞睡千年。 使见先生坚意不肯应召，得回表并诗，於四月二十四日至京师，进呈於紫宸殿。 太宗读表与诗毕，知先生不来，甚弗悦，念念不已。 即当年六月三日，帝坐垂拱殿，召殿束头供奉官张素真，资诏书再往宣先生。 至六月八日到华山云台观，见山童拥筠篇而立，天使问曰：师父在否？ 山童日； 师父於庵中熟睡正浓。 使臣曰：何以得觉？ 山童曰：击头边金钟便觉。 击之即悟，先生知天使至，忙起整道服，问使臣曰：何故复来？ 答曰：皇帝为陈宗颜宣先生弗至，甚为失望，特遗吾再来召。 先生焚香礼毕，听读韶曰：朕伏惟先生白云隐士，碧洞高人，悟大道之玄门，达希夷之奥理。 朕叹韶光甚速，迅景难留，忽暑往以寒催，渐颜衰而鬓改，虽达治世之略，未谙炼性之机，废寝忘餐，思贤若渴，暂离洞府，跨鸾鹤以飞来，仁立官闱，列簪缨以敬待。 先生读罢韶书，答使臣曰：贫道山野之人，鹿豕同群，登高望远，临流漱齿，松君桂父，吾之友也，云峰霞岭，吾所游也，熟羡浮荣之富贵哉？ 请天使暂停轩辔，止歇山庵，作回表并诗，以谢殊渥。 表云：伏念愚拙，深潜涧壑，误蒙天恩，臣无诸葛之奇才，君迈汉皇之厚德。 臣山麋之性，野鹤之姿，冠簪独羡乎逍遥，轩冕离禁乎羁束，高外苍龙之岭，蝶梦悠扬； 闲看玉井之莲，诗魂浩汤，餐姻霞於洞口，采薇蕨於林问，杖屦徜徉，身心懒散，炼炉中之丹药，远拟登仙，避世上之虚名，屡防嫁祸。 赖遭逢乎尧舜，可疏放其巢由，幸尽余生，遐瞻圣代。 诗二绝云：坐逢圣代即尧年，草泽愚人也被宣。 自笑形骸元懒散，才疏安敢望朝天。 调和四气凭烧药，修炼千方只要安。",
      "translated_text": "Disdaining the world’s splendor, he favored the teachings of purity and seclusion. The emperor dispatched Palace Attendant Chen Zongyan of the Eastern Hall, bearing an imperial edict and a poem, to the Cloud Terrace Abbey in Huayin County, Huazhou, to summon Master Chen Tunan.\n\nOn the fourteenth day of the fourth month, they arrived in Huayin County. The magistrate, Editorial Director Ding Shouming, welcomed them into the county seat. As dusk fell, they lodged there for the night. At dawn the next day, the fourteenth of the month, they proceeded with the imperial envoy to Cloud Terrace Abbey. There, they met the Daoist Zhong Xihui, who led them to the Master. Announcing the emperor’s summons, they said, “His Majesty calls for the Master.”\n\nAfter washing his hands and burning incense, the Master bowed before the imperial seat. He then listened as the edict was read: “Since ascending the throne, We have subdued the eight directions and overawed the myriad states. Far and near have submitted to Our transforming influence; Chinese and barbarian alike have attained great peace. We have learned that you, Master, embrace the Dao amid the mountains, purify your heart beyond the realm of things, nurture the primal qi of great simplicity, and correspond to the Lesser Weaving Star of the upper heavens. Your integrity rivals that of Chao Fu and Xu You; your Way follows that of the Yellow Emperor and Laozi. Though you hold the long-term strategies of governance, you do not seek audience with kings and lords; though you possess the extraordinary talents of generals and ministers, you have not paid court to the Son of Heaven. You do not bend before the lord of ten thousand chariots—why then conceal yourself among the Three Peaks? Yet you come with the wind, and the entire court rejoices. Our poem reads:\n\n*Of Hua Peak much have We heard—*\n*We know your surname is Chen.*\n*You ask the guests of the Three Isles,*\n*A lofty man beyond the world.*\n*Your crucible is your livelihood,*\n*Green mountains your near neighbors.*\n*We long to go in person,*\n*But the altars of state permit no absence.*\n\nAfter hearing the edict and poem, the Master addressed the imperial envoy: “This poor Daoist dwells beyond the world of things, cultivating and refining amid the mountains. I seek no fame, but my heart yearns for the Dao. I have no wish to serve in office.” When the envoy’s courtesies were complete, the Master still refused to come to court. Instead, he presented a reply memorial and a poem:\n\n*I recall my rustic birth beneath the vast heavens,*\n*Raised south of the Han.*\n*In youth, I studied the Confucian classics;*\n*In manhood, I roamed the grottoes and abbeys.*\n*My nature is like the lowly crow;*\n*My heart, like cold ashes.*\n*I know not the depths of benevolence and righteousness,*\n*Nor the right path of action or retreat.*\n*My robe is made of withered lotus;*\n*My cap, of cast-off clogs.*\n*My body sprouts green fur;*\n*My feet lack straw sandals.*\n*I aspire to the Way of Fuxi and the Yellow Emperor,*\n*But have no heart to recite the works of Guan and Yue.*\n*I often read the* Southern Florescence *and the* Dao and Its Virtue*,*\n*While thoughts of the vermilion gates and jade halls fade away.*\n*Several lines of purple edicts*\n*Only trouble the colorful phoenix that bears them.*\n*A single piece of my idle heart*\n*Has already been detained by the white clouds.*\n*If I were to approach the imperial steps,*\n*I would only bring ridicule upon Your Sagely Brilliance.*\n\n*The poem reads:*\n*Ninefold layers send down the purple-sealed summons,*\n*Yet this clumsy hermit delights in quiet seclusion.*\n*Mountain hues fill the court like painted screens;*\n*Pine voices from ten thousand gorges are my zither strings.*\n*I have no heart to enjoy emoluments or ascend the three ducal seats,*\n*But seek the immortal realms of the grotto-heavens.*\n*Floating honors of cap and carriage banish all thoughts—*\n*I beg only to sleep for a thousand years among the Three Peaks.*\n\nSeeing the Master’s firm resolve to decline the summons, the envoy received the reply memorial and poem. On the twenty-fourth day of the fourth month, he returned to the capital and presented them at the Purple Throne Hall. Emperor Taizong read the memorial and poem, and learning that the Master would not come, was deeply displeased. He could not put the matter from his mind.\n\nOn the third day of the sixth month of that year, the emperor sat in the *Chuigong* Hall and summoned Palace Attendant Zhang Suzhen of the Eastern Hall. He entrusted him with another edict and sent him again to summon the Master. On the eighth day of the sixth month, the envoy arrived at Cloud Terrace Abbey on Mount Hua. There, he saw a mountain youth standing with a bamboo scroll in hand. The imperial envoy asked, “Is the Master here?”\n\nThe youth replied, “The Master is fast asleep in his hut.”\n\nThe envoy asked, “How may he be awakened?”\n\nThe youth said, “Strike the golden bell beside his head, and he will wake.”\n\nWhen the bell was struck, the Master awoke. Realizing the imperial envoy had arrived, he hastily rose and adjusted his Daoist robes. He asked the envoy, “Why have you come again?”\n\nThe envoy replied, “When Master Chen Zongyan’s summons went unanswered, the emperor was greatly disappointed. He has specially sent me to summon you once more.”\n\nAfter burning incense and performing the rites, the Master listened as the edict was read: “We reflect that you, Master, are a recluse amid the white clouds, a lofty man of the azure grottoes. You have awakened to the mysterious gate of the Great Dao and penetrated the profound principles of the subtle and tranquil. We lament how swiftly the seasons pass, how fleeting the sun’s shadow. Suddenly, summer yields to the chill of winter; gradually, the face ages and the temples gray. Though We have mastered the strategies of governing the age, We have not yet grasped the mechanism of refining the nature. We neglect sleep and forget meals, thirsting for the worthy as one parched. Temporarily leave your grotto-abbey; mount the simurgh or crane and fly here. Stand in the palace chambers, where the court’s officials in their caps and sashes await you with reverence.”\n\nAfter reading the edict, the Master replied to the envoy: “This poor Daoist is a rustic man, mingling with deer and swine. I climb high to gaze afar, rinse my mouth by the streams. The pine lord and cassia father are my friends; the cloud peaks and rosy ridges, my haunts. Why should I covet the floating honors of wealth and nobility? I beg the imperial envoy to pause his carriage and rest in this mountain hut while I compose a reply memorial and poem to express my gratitude for this extraordinary favor.”\n\n*The memorial reads:*\n*I reflect upon my foolish clumsiness, dwelling deep in the ravines and gullies. By some mistake, I have received Your Heavenly Grace. Your servant lacks the extraordinary talents of Zhuge Liang; Your Majesty surpasses the profound virtue of the Han emperor. Your servant’s nature is that of the mountain elk; his bearing, that of the wild crane. He alone admires the carefree; cap and carriage are far from his fetters. Beyond the Azure Dragon Ridge, his butterfly dreams drift; idly watching the lotuses of the Jade Well, his poetic soul surges. He dines on mist and rosy clouds at the grotto’s mouth, gathers ferns and bracken amid the woods. Staff in hand, sandals on feet, he wanders at ease; body and mind, he is indolent and scattered. Refining the elixir in his crucible, he aspires to ascend as an immortal; shunning the world’s empty fame, he repeatedly guards against calamity. Relying on the fortune of encountering a Yao or Shun, he may roam freely like Chao Fu or Xu You. Happily, he spends his remaining years gazing afar upon this sagely age.*\n\n*Two quatrains read:*\n*Sitting in this sagely age, the age of Yao,*\n*Even a rustic fool from the marshes is summoned.*\n*I laugh at my lazy form—how could it be otherwise?*\n*With my meager talents, how dare I gaze toward the celestial court?*\n\n*Harmonizing the four qi by burning the elixir,*\n*Refining a thousand methods only to seek peace.*",
      "overlap_context": " a poem:\n\n*Forty years of sound sleep—*\n*Unnoticing, the eastern sky has dawned.*\n\nThereafter, he entered Mount Hua, living as a Daoist. Emperor Taizu repeatedly summoned him, but he refused to come. After Taizu’s death, Emperor Taizong ascended the throne. On the tenth day of the fourth month of the first year of the *Zhidao* era (995), the emperor sat in the *Chuigong* Hall. The season was mild, the harvest abundant, and governance harmonious. The emperor had long heard of the Master’s renown.",
      "start_char": 1235,
      "end_char": 2440,
      "start_sentence": 46,
      "end_sentence": 84,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.330944299697876,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\太华希夷志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "黄阁高官无意恋，闲居佳境胜为官。 使臣得回表并诗，力不能强起。 至六月十六日至京师，进呈文德殿下，太宗读罢表并诗，宣先生不至，龙颜大不乐。 即当年六月二十九日，帝坐垂拱殿，宣内都知石宝问曰：百官中有谁言辨者。 宝奏曰：有内藏库副使葛守中能言。 太宗宣至，令守中为使，再宣希夷先生，宝韶书并御诗往云台观。 七月七日到观，不见先生，有知观道人杨子遵言：先生恐皇帝再来，宣上玉泉观，遁逃坐静去了。 使臣俾子遵前导，历□#1碗石径，至观所。 报先生接诏，迎使焚香礼毕，听读韶曰：朕上承天命，下抚民心，兵消而四海咸宁，化行而八方无讪，位临有众，含哺鼓腹，以同歌道体无为，凿井耕田，以安业知大贤之生世。 海晏河清，望君子以救时，风行草偃，身未离於岩壑，名满寰区，志恒想於蓬瀛，心游寥廓。 朕素知轩后博施之德，实歉广成修养之方，地僻虽深，王泽所及，伊尹就征而适亳，孟轲随聘以至梁，命有相从，礼无多让。 御诗曰：三度宣卿不赴朝，关河千里莫辞劳。 凿山选玉终须得，点铁成金未见烧。 紫袍绰绰宜披体，金印囊紫可挂腰。 朕赖先生相辅佐，何忧万姓辍歌谣。 先生读罢诏并诗，意懒赴征骋，言复辞谢。 天使守中曰：宣命三次，先生不可固辞，岂不闻《鲁论》云：君命召，不俟驾行矣。 诏旨岂宜抗拒？ 又《邹书》云：率土之滨，莫非王臣。 不可辞也。 仆虽不才，为先生赋诗一首，诗曰：华岳三峰客，幽居不记年。 姻霞为活计，云水作家绿。 种药茅亭畔，栽松涧壑边。 暂离仙洞去，可应帝王宣。 先生读罢其喜，随答诗曰：鹤氅翩翩即散仙，蒲输争忍利名牵。 留连华岳伤心别，回顾云台望眼穿。 涉世风波真险恶，忘机鸥乌自悠然。 三峰才欲和衣倒，又被天书下日边。 先生赋诗毕，与使者同行，留别山中麻衣道友诗一绝：华岳峰前两路分，数问茅屋一溪云。 师言耳赎持知久，人是人非闻未闻。 麻衣道者答诗曰：独坐茅庵迥出尘，亦无主钵日随身。 逢人不话人问事，便是人问无事人。 先生得诗，默喻其旨，相别讫，与天使不久至京师，於建隆观安歇。 夜寝偶闻禁钟响，昤叹世诗二绝：千门万户锁重关，星斗排空静悄然。 尘世是非方欲歇，六街禁鼓漏初传。 银河斜转夜将阑，枕上人心算未闲。 堪叹市鏖名利者，多应牵役梦魂问。 先生睡至五更，闻晓钟响，复昤诗曰：玉漏将残月色沉，一声清响透寒音。 能催野客思乡切，暗送离人起恨深。 窗下惊开名利眼，枕前唤觉是非心。 皇王帝溜皆经此，历代兴亡直至今。 先生赋诗毕，盥漱巾栉，时已昧爽，令使臣先入内奏言：先生宣来见帝。 帝急命宣至阙下，见於延英殿。 先生服羽衣，戴华阳巾，草履垂绦，以宾礼见，赐坐。 上赋诗问曰：知卿得道数余年，镇日常吞几粒丹。 可讶鬓边无白发，还疑脸上有红颜。 终宵寝向何方观，清晓斋登甚处坛。 肯为眇躬传妙诀，寡人拟欲似卿闲。 先生答诗曰：臣今得道几经年，每日常吞二气丹。 仙酿饮时添漆鬓，蟠桃食后注童颜。 夜深只宿云台观，晓起斋登法录坛。 陛下问臣修养法，华山深处可清闲。 太宗览先生所答诗，大悦。 时上方欲征河束，先生谏止之，会军已兴，命先生寝於御园，兵还，果无功。",
      "translated_text": "The lofty halls of the Yellow Gate hold no allure for him; dwelling in leisurely seclusion surpasses holding office. The imperial envoy returned bearing his memorial and poems, yet he lacked the strength to rise and answer the summons. On the sixteenth day of the sixth month, he arrived at the capital and presented his writings to the virtuous Prince. Emperor Taizong, having read the memorial and poems, was deeply displeased that the Master had not come. On the twenty-ninth day of the same month, the Emperor sat in the Hall of Vertical and Horizontal Eaves and summoned the Inner Attendant Shi Bao, asking, \"Among the hundred officials, who is most eloquent in speech?\" Bao replied, \"The Vice Director of the Inner Treasury, Ge Shouzhong, is skilled in persuasion.\" Taizong summoned him and commanded Shouzhong to serve as envoy, bearing the imperial edict and poems to Cloud Terrace Abbey to summon Master Xiyi once more.\n\nOn the seventh day of the seventh month, the envoy arrived at the abbey but did not find the Master. The abbey’s caretaker, Daoist Yang Zixun, said, \"The Master, fearing the Emperor’s repeated summons, has fled to Jade Spring Abbey to sit in silent retreat.\" The envoy instructed Zixun to lead the way. Passing through the winding stone path, they reached the abbey. Announcing the imperial decree, they were received with incense and ritual. The edict read:\n\n*\"I, having received the Mandate of Heaven above and soothed the hearts of the people below, have stilled the blades of war so that the Four Seas are at peace, and spread transformation so that the Eight Directions know no slander. Ascending the throne to govern the multitudes, all rejoice with full mouths and drumming bellies, singing in unison of the Dao’s non-action. They dig wells and till fields to secure their livelihoods, knowing that great worthies are born into the world. With seas calm and rivers clear, I look to the noble man to save the age; though the wind sweeps the grass flat, he has not yet left the cliffs and valleys. His name fills the realm, yet his heart ever wanders the Penglai Isles, his spirit roams the vast and boundless. I have long known of the Yellow Emperor’s virtue in broadly bestowing blessings, and I regret not having mastered the methods of cultivation of Guangchengzi. Though the land be remote, the royal grace reaches even there. Yi Yin answered the call and went to Bo; Mencius followed the summons and came to Liang. Fate has its alignments, and rites allow for no excessive refusal.\"*\n\nThe imperial poem read:\n*Thrice I have summoned you, yet you do not come to court,*\n*Though a thousand li of rivers and passes should not deter your toil.*\n*Jade hewn from mountains must ultimately be obtained;*\n*Iron turned to gold has yet to be forged in the flame.*\n*Your purple robe, ample and flowing, should drape your form;*\n*The golden seal, its cord purple, may hang at your waist.*\n*With you, Master, to aid and counsel me,*\n*Why should I fear the myriad folk ceasing their songs?*\n\nHaving read the edict and poem, the Master was reluctant to answer the summons and sought to decline once more. The imperial envoy Shouzhong said, \"Three times the decree has come—you cannot persist in refusal. Have you not heard the words of the *Analects of Lu*: 'When the lord’s command summons, one does not wait for the carriage to be yoked before setting out'? How can an imperial edict be defied? And the *Book of Zou* says: 'To the shores of the land, none are not the king’s subjects.' You cannot refuse.\" Though unworthy, I have composed a poem for you:\n\n*A guest of the Three Peaks of Mount Hua,*\n*Dwelling in seclusion, you count not the years.*\n*Mist and rosy clouds sustain your livelihood;*\n*Clouds and waters compose your verdant home.*\n*You cultivate herbs by the thatched pavilion,*\n*Plant pines by the ravine’s edge.*\n*Though you but briefly leave your immortal cave,*\n*You may yet answer the Emperor’s call.*\n\nThe Master, having read the poem, was pleased and responded with a verse of his own:\n*In crane-feather cloak, fluttering like a carefree immortal,*\n*How could rush mats bear the pull of profit and fame?*\n*Lingering at Mount Hua, my heart aches at parting;*\n*Gazing back at Cloud Terrace, my eyes strain with longing.*\n*The world’s winds and waves are truly perilous;*\n*Forgetting schemes, gulls and crows are at ease.*\n*Just as I would lie down in my robes on the Three Peaks,*\n*Another celestial missive descends from the sun’s edge.*\n\nHaving composed his poem, the Master set out with the envoy. He left a farewell poem for his hemp-clad Daoist friends in the mountains:\n*Before the peaks of Mount Hua, two paths diverge,*\n*Several thatched huts, a single stream of clouds.*\n*You said my ears were dull—I knew this long ago;*\n*Of people changing, people being wrong, I have heard nothing.*\n\nThe hemp-clad Daoist replied with a poem:\n*Sitting alone in my thatched hut, far removed from the dust,*\n*I carry neither alms bowl nor master, day by day.*\n*Meeting others, I speak not of worldly affairs—*\n*Thus am I one who, when asked, has no business to attend.*\n\nThe Master, receiving the poem, silently grasped its meaning. Taking his leave, he soon arrived at the capital with the imperial envoy and lodged at Establishing Prosperity Abbey. That night, as he lay abed, he heard the palace bell toll and sighed, composing two quatrains:\n\n*A thousand gates, ten thousand doors, locked behind layered barriers,*\n*Stars arrayed in the void, all hushed and still.*\n*As the world’s right and wrong begin to quiet,*\n*The night watch’s drum echoes through the six streets, the first watch announced.*\n\n*The Silver River slants as night wanes,*\n*Pillowed, the heart’s reckonings remain unceasing.*\n*How pitiable are those entangled in the marketplace’s fame and profit—*\n*How many are ensnared, their dream-souls bound in toil?*\n\nThe Master slept until the fifth watch, when the dawn bell rang. He sighed again and composed another poem:\n*The jade clepsydra nears its end, the moon’s light sinks,*\n*A single clear chime pierces the cold note.*\n*It stirs the wanderer’s longing for home,*\n*Stealthily deepens the parting traveler’s sorrow.*\n*At the window, it startles open the eyes of fame and profit;*\n*By the pillow, it awakens the heart of right and wrong.*\n*Kings and emperors have all passed through this,*\n*Dynasties rising and falling, even unto this day.*\n\nHaving composed his poem, he washed and dressed. As dawn broke, he instructed the envoy to enter the palace first and announce, \"The Master has come to see the Emperor.\" The Emperor hastily commanded that he be brought before the palace gates and received in the Hall of Extended Glory. The Master wore a feathered robe, a Huayang cap, straw sandals, and a hanging sash. Received with the rites due a guest, he was granted a seat. The Emperor composed a poem and asked:\n\n*\"I know you have attained the Dao for many years,*\n*Daily swallowing several grains of elixir.*\n*Yet your temples show no white—how strange!*\n*And your face retains its youthful glow—how doubtful!*\n*Where do you lodge each night?*\n*Upon what altar do you fast at dawn?*\n*Would you deign to transmit your wondrous methods to this humble one?*\n*I would fain be as carefree as you.\"*\n\nThe Master replied with a poem:\n*I have attained the Dao for many years now,*\n*Daily swallowing the elixir of the two qi.*\n*When I drink the immortal’s brew, my temples darken;*\n*After eating the peach of Penglai, my youth is restored.*\n*At night, I lodge only at Cloud Terrace Abbey;*\n*At dawn, I fast upon the Altar of Dharma Records.*\n*If Your Majesty asks of my methods of cultivation,*\n*In the depths of Mount Hua, true leisure may be found.*\n\nTaizong, reading the Master’s response, was greatly pleased. At that time, the Emperor was preparing to campaign against Hebei. The Master admonished him to desist, but the army had already been mobilized. The Emperor commanded the Master to rest in the imperial gardens. When the troops returned, the campaign indeed proved fruitless.",
      "overlap_context": "e fortune of encountering a Yao or Shun, he may roam freely like Chao Fu or Xu You. Happily, he spends his remaining years gazing afar upon this sagely age.*\n\n*Two quatrains read:*\n*Sitting in this sagely age, the age of Yao,*\n*Even a rustic fool from the marshes is summoned.*\n*I laugh at my lazy form—how could it be otherwise?*\n*With my meager talents, how dare I gaze toward the celestial court?*\n\n*Harmonizing the four qi by burning the elixir,*\n*Refining a thousand methods only to seek peace.*",
      "start_char": 2440,
      "end_char": 3658,
      "start_sentence": 85,
      "end_sentence": 138,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.15562844276428,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\太华希夷志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "睡百余日方起，帝惊异，加号恩礼特厚。 太宗从容谓希夷曰：先兄太祖，功高德厚，宣先生弗至。 寡从功卑德薄，烦先生降临丹陛。 搏曰：先帝不须贫道来，陛下不免臣一遭耳。 太宗又问曰：昔在尧舜之为天下，今可致否？ 对曰：尧舜土阶三尺，茅茨不剪，其迹似不可及。 然能以清静为治，即今之尧舜也。 上善之。 太宗多延入宫中与语，谓宰相宋琪曰：陈搏独善其身，不干势利，真方外之士。 遣中使送至中书，琪等问曰：先生得玄默修养之道，可以授人乎？ 曰：搏遁迹山野，无用於世，修炼之事不知，无所传授。 然设使白日飞升，何益於治。 圣上龙颜秀异，有天人之表，洞达古今治乱之旨，真有道仁圣之君，正是君臣合德，以治天下，勤行修炼，无以加此。 琪等表上其言，上览甚喜。 先生以鹤书赴陇，野服来廷，太宗喜其拔俗之标，待以不臣之礼，处之直馆，幽延西清，靡劳襄野之游，自契崆峒之问，八素九真之要诀，四觉七绿之妙门，故其造膝沃心之旨，莫得而闻也。 太宗命先生相真宗，即寿王也。 太宗八子，真宗第三，使左右引导至束官，王未起而回。 帝问之，先生曰：王门厮养皆将相，王可知矣。 所见乃张相耆、杨相崇勋、郭大尉承佑也。 先生被召至阙下，闻有士大夫诣其所，止愿闻善言以自规。 搏曰：得便宜事不可再去。 优游之所勿久恋，得志之地勿再往。 闻者以为至言。 康节诗曰：珍重至人留好语，得便宜是落便宜。 太宗暇日，与先生同登束角楼，闲观市肆，见楼下富人，日高才起洗漱，问左右：是谁之家？ 或奏曰：此束京豪富民耳。 即吟诗曰：人人未起朕先起，朝来万事钻心里。 可羡东京豪富民，睡至日高．犹未起。 先生答诗曰：昨夜三更梦裹惊，一声钟响万人行。 多应又是朝金阙，臣自无官睡到明。 太宗见先生所答诗，大喜？ 来日早朝，上欲以为谏议大夫，先生坚辞不受。 乃作《退官歌》并诗一绝。 歌曰：道能，清，道能静，清静之中求正定。 不贪不爱任浮生，不学愚迷多惶恪。 时人笑臣不求官，官是人问一大病。 官卑又被人管辖，官高亦有人趋佞。 或经秦，或经郑，东来西去似绳蚓。 直至百年不曾歇，算来争似臣清静。 月为灯，水为镜，长柄葫芦作气命。 出入虽无从者扶，左有金龟右鹤引。 朝日醉，长不醒，每每又被天书请。 时人见臣笔呵呵，臣自心中别有景。 又诗曰：元气充餐草结衣，等闲无事下山稀。 不侵织女耕夫利，犹自傍人说是非。 太宗见先生坚意不肯就官禄，问先生有济世安民良策，留之可也。 希夷曰：臣总角慕道，壮岁游山，处心澹泊，默悟玄风，济世良策，未暇知也。 臣颇好睡，幸放还山可也。 随赋《辞职叹世诗》一首云：南辰北斗夜频移，日出扶桑又落西。 人世轻飘真野马，名场争扰似酝鹦。 松篁郁郁冬犹秀，桃李纷纷春渐迷。 识破邓邓尘世梦，白云深处可幽栖。 太宗曰：寡人召卿来，方期阴阳燮理。 朝纲整治，安国家，济人民。 不意先生只说山中之乐，惟睡为念，信有说乎。 先生曰：然。 进《睡歌》一首云：臣爱睡，臣爱睡，不外毡，不盖被。 片石枕头，蓑衣覆地，南北任眠，束西随睡。 轰雷掣电泰山摧，万丈海水空裹坠。 骊龙叫感鬼神惊，臣当怠时正鼾睡。",
      "translated_text": "After sleeping for over a hundred days, the Master finally arose. The Emperor, astonished, bestowed upon him even greater honors and favor. Taizong then spoke to Master Xiyi in a leisurely manner: *\"My elder brother, the late Emperor Taizu, achieved great merit and profound virtue, yet you did not come to him. I, with humble merit and shallow virtue, have troubled you to descend to my vermilion steps.\"*\n\nThe Master replied: *\"The late Emperor had no need for this poor Daoist, but Your Majesty could not avoid summoning me once.\"*\n\nTaizong then asked: *\"In the days when Yao and Shun ruled the world, could such a time be restored?\"*\nThe Master answered: *\"Yao and Shun had earthen steps three feet high and thatched roofs untrimmed—such traces seem unattainable. Yet if one governs with purity and stillness, then even today may become an age of Yao and Shun.\"* The Emperor approved of his words.\n\nTaizong often invited the Master into the palace to converse, and later said to his chief minister Song Qi: *\"Chen Tuan cultivates himself in solitude, untouched by power or profit—truly a man beyond the world.\"* He sent an imperial messenger to escort the Master to the Ministry of State, where Qi and others asked: *\"Master, you have attained the Dao of profound silence and self-cultivation—can you teach it to others?\"*\nThe Master replied: *\"I have withdrawn to the mountains and wilderness, useless to the world. I know nothing of alchemical practices and have nothing to transmit. Even if I were to ascend to immortality in broad daylight, what benefit would it bring to governance? Your Majesty’s dragon countenance is noble and extraordinary, bearing the marks of both heaven and man. He comprehends the principles of order and chaos through the ages—truly a sagely and virtuous ruler. This is a time when ruler and minister unite in virtue to govern the realm. What cultivation could surpass this?\"* Qi and the others recorded his words and presented them to the Emperor, who read them with great delight.\n\nThe Master, summoned by imperial crane-edict to the capital, arrived at court in rustic attire. Taizong, admiring his transcendent demeanor, received him with the rites due a guest rather than a subject, lodging him in the finest quarters. There, in the secluded Western Pavilion, the Emperor engaged him in discourse on the mysteries of the Eight Simplicities and Nine Perfections, the essentials of the Four Awakenings and Seven Verdancies. Yet the profound insights shared in their private conversations remained unheard by others.\n\nTaizong commanded the Master to observe the future Emperor Zhenzong, then the Prince of Shou. Of the Emperor’s eight sons, Zhenzong was the third. The Master was led to the eastern palace, but the prince had not yet risen, so he turned back. When the Emperor inquired, the Master said: *\"At the prince’s gate, even the servants are future ministers and generals. What more need one know?\"* Those he had seen were the future Prime Minister Zhang Qi, Minister Yang Chongxun, and Marshal Guo Chengyou.\n\nWhen the Master was summoned to the palace, he heard that scholar-officials sought him out, wishing only to hear virtuous words for self-improvement. He said: *\"Do not return to places where fortune favors you. Do not linger in realms of ease, nor revisit lands of success.\"* Those who heard this regarded it as profound wisdom. As Master Kangjie’s poem says: *\"Cherish the good words left by the perfected—what seems advantageous is truly a disadvantage.\"*\n\nOne day at leisure, Taizong ascended the Eastern Corner Tower with the Master to idly observe the market below. Seeing a wealthy man in a tower who rose late to wash and dress, the Emperor asked his attendants: *\"Whose household is this?\"*\nSomeone replied: *\"One of the great merchants of the Eastern Capital.\"*\nTaizong then recited a poem:\n*\"Before others rise, I am already awake,\nAt dawn, a thousand affairs weigh on my mind.\nHow enviable is this rich man of the Eastern Capital—\nSleeping till the sun is high, still not yet risen.\"*\n\nThe Master responded with a poem:\n*\"Last night at the third watch, I dreamed in alarm,\nA single bell’s toll set ten thousand in motion.\nMost likely another court assembly at the golden palace—\nI, an officialless man, slept till dawn.\"*\n\nThe Emperor, delighted by the Master’s reply, intended the next day to appoint him as Remonstrance Grand Master. The Master firmly declined and instead composed *\"The Song of Retiring from Office\"* and a quatrain:\n\n*The Song:*\n*The Dao can be clear, the Dao can be still,\nIn clarity and stillness, seek true constancy.\nNeither covet nor cling—let life drift as it will,\nNor learn the folly of the deluded, full of fear and trembling.\nPeople laugh that I seek no office,\nBut office is the world’s greatest affliction.\nLow rank means being controlled by others,\nHigh rank means others groveling for favor.\nNow through Qin, now through Zheng,\nEast and west like a worm on a string.\nUntil a hundred years pass without rest,\nHow does it compare to my pure stillness?\nThe moon as my lamp, water as my mirror,\nA long-handled gourd holds my life’s breath.\nThough none attend me when I come or go,\nTo my left, a golden tortoise; to my right, a crane guides me.\nDrunk at sunrise, never to sober,\nYet again summoned by imperial decree.\nPeople see me and laugh,\nBut my heart holds a different scene.*\n\n*The Poem:*\n*Feeding on primal qi, clad in woven grass,\nI descend the mountain rarely, with nothing to do.\nI do not encroach on the weaver’s or farmer’s gain,\nYet still others whisper of right and wrong.*\n\nSeeing the Master’s firm resolve to refuse office and salary, Taizong asked if he had any strategies to aid the world and pacify the people, hoping to retain him. Master Xiyi replied: *\"From childhood, I admired the Dao; in my prime, I wandered the mountains. My heart abides in tranquility, silently attuned to the subtle winds of the mysterious. As for strategies to aid the world, I have not yet given them thought. I am rather fond of sleep—if Your Majesty would permit, I would return to the mountains.\"*\n\nHe then composed *\"The Lament of Resigning Office and the World\"*:\n*The Southern Dipper and Northern Dipper shift nightly,\nThe sun rises in Fusang, then sets in the west.\nThis world is as fleeting as wild horses,\nThe realm of fame as tumultuous as fermenting wine.\nPines and bamboo flourish, verdant even in winter,\nPeach and plum blossoms scatter, spring’s allure fading.\nSeeing through the dream of this dusty world,\nIn the depths of white clouds, one may dwell in seclusion.*\n\nTaizong said: *\"I summoned you hoping you would harmonize yin and yang, rectify the court’s governance, secure the state, and aid the people. Yet you speak only of the joys of the mountains and your love of sleep—is there truth in this?\"*\nThe Master replied: *\"Indeed.\"* He then presented *\"The Sleep Song\"*:\n*I love sleep, I love sleep,\nNo felt mat, no quilted cover.\nA slab of stone for my pillow,\nA straw cloak spread upon the earth.\nSleeping north or south, east or west—\nWherever I please.\nThunder crashes, lightning splits, Mount Tai collapses,\nThe boundless sea pours into the void.\nThe Black Dragon roars, startling gods and ghosts—\nYet when I am weary, I snore in slumber.*",
      "overlap_context": "*\n*At dawn, I fast upon the Altar of Dharma Records.*\n*If Your Majesty asks of my methods of cultivation,*\n*In the depths of Mount Hua, true leisure may be found.*\n\nTaizong, reading the Master’s response, was greatly pleased. At that time, the Emperor was preparing to campaign against Hebei. The Master admonished him to desist, but the army had already been mobilized. The Emperor commanded the Master to rest in the imperial gardens. When the troops returned, the campaign indeed proved fruitless.",
      "start_char": 3658,
      "end_char": 4869,
      "start_sentence": 139,
      "end_sentence": 198,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.797263383865356,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\太华希夷志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "闲想张良，闷思范蠡，说甚曹操，休言刘备。 两三个君子，只争些小闲气。 争似臣，向清风岭头，白云堆裹，展放眉头，解开肚皮，打一觉睡。 更管甚红轮西坠。 后又口号云：问君世上何事好，无过晓起睡当早。 庵前乱草结成衣，饥餐松梧常令饱。 因骯山石脚绊倒，不能起得睡到晓。 时人尽道臣慈痴，臣自愍痴无烦恼。 先生初在周显德中，人访其居，窥其户闻然，惟兽迹乌声而已。 有樵於山麓者，见其遗骸尘翳，迫而视之，乃先生也，扪其心独暖，良久，气还而起曰：睡适酣矣，奚为扰我。 州将罗彦威以闻。 太宗知先生坚辞不仕，欲求还山。 帝命百工，聚集货物於玉门前，歌呼喧闹以夸万民之富庶，约先生登骯，谓先生曰：京师丰盛若是，安忍弃寡人还山，不同治世乎？ 先生曰：乌兽栖於林麓，鱼鳖游于江湖，各有所乐耳。 太宗指示人姻辏集处，问先生曰：见否？ 曰：见。 帝曰：见甚？ 先生曰：见富者贪生，贫者竞命。 太宗默然。 须臾，下玉门还殿。 请朝，先生入内，坚辞还山，帝恳求济世安民之术，先生不兔索纸笔书四字：远近轻重。 帝不谕其意。 先生解之曰：远者，远招贤士； 近者，近去佞臣； 轻者，轻赋万民； 重者，重赏三军。 帝听罢大悦。 上知其不可留，即赐宴便殿，诏宰臣两禁赴宴赋诗，以宠其行。 又诏华州刺史王祚时就存问，以凛其阙。 由是，海内无贤不肖闻其风而慕之，其愿操几杖以师事之者不可胜数。 将出京师，先生赋《辞朝诗》云：十年踪迹踏红尘，为忆青山入梦频。 紫陌纵荣争及睡，朱门虽贵不如贫。 愁闻剑戟扶危主，闷听笙歌聒醉人。 携取旧书归旧隐，野花啼乌一般春。 太宗为先生坚要还山，不能苦留，上赐龟鹤鞍马等物，余重物坚辞不受，惟荼药而已。 令使臣以安车送先生至华山云台观，赐号希夷。 诏曰：赐诏陈搏，一代高人，累朝通客，慕我隆平之化，来修观谒之仪，不有嘉名，何彰贞范。 宜赐号希夷先生。 先生临别，留诗一绝云：华山高处是吾宫，出即凌空跨晓风。 台殿不将金锁闭，来时自有白云封。 太平兴国初，太宗差天使持诗再召，先生辞谢不起。 先生密陈天命，实在章圣，御诗曰：曾向前朝出白云，后来消息杳无闻。 如今若肯随征诏，总把三峰乞与君。 先生竟辞不至。 帝令使臣赐二女与先生，以备执巾栉。 先生却之，回诗曰：雪为肌体玉为腮，深谢君王送到来。 处士不生巫峡梦，虚劳云雨下阳台。 一说唐僖宗封为清虚处士，仍赐宫女三人以备洒扫，故赋诗云。 太宗《赐希夷先生韶》：劲华山道士陈搏混迹寰中，栖心物外，养太素浩然之气，应少微处士之星。 既不屈於王侯，但守志於林壑，乐我中和之化，庆予下武之期，而能远涉川途，暂来城阙，浃旬延遇，弘溢居多。 白云莫驻於帝乡，好爵难摩於达士，昔唐尧之至圣，有巢由为外臣，朕虽寡薄，庶遵前事。 或恐山中所阙，已令华州刺史王祚每事供须。 乍返故山，履兹春序，缅怀高尚，当适所宜。 故兹抚问，想宜知悉。 春寒，汝比好否？ 遣书指不多及。 《赐荼绢诏》曰：劝：朕居九五之尊，虽数年用兵，而一心利物。 乃者，鸾旌南狩，江表来庭，款诚屡罄於军前，方物咸陈於阙下，既能效顺，遂命班师。",
      "translated_text": "Idle thoughts drift to Zhang Liang, restless musings to Fan Li—what need to speak of Cao Cao, or mention Liu Bei?\nA handful of gentlemen, quarreling over mere trifles of pride.\nHow could they compare to this servant,\nOn the crest of the Pure Wind Ridge, amid drifts of white clouds,\nBrows unfurled, belly unknotted,\nTaking a single long sleep?\nWhat care if the crimson sun sinks in the west?\n\nHe later composed another verse:\n*Ask what in this world is best—*\n*Nothing surpasses rising late and sleeping early.*\n*Before the hermitage, tangled grasses weave my robe;*\n*Hunger is sated with pine seeds and mulberries, ever enough.*\n*Once tripped by a mountain stone’s edge,*\n*I could not rise, sleeping till dawn.*\n*All call me foolish, lost in slumber—*\n*Yet I pity their folly, burdened with cares.*\n\nIn the early years of Zhou Xiande, when visitors sought his dwelling, they found his door ajar, silence within—only the tracks of beasts and the cries of crows. A woodcutter on the mountainside once came upon his form, dust-shrouded, and drew near to see: it was the Master. Pressing a hand to his chest, he found it faintly warm; after a long while, breath returned, and the Master rose, saying: *\"My sleep was deep and sweet—why disturb me?\"* The prefect Luo Yanwei reported this to the court.\n\nTaizong, knowing the Master would not be swayed from his refusal to serve, sought to send him back to the mountains. The emperor ordered artisans to gather goods before the Jade Gate, their songs and clamor boasting of the realm’s prosperity, then invited the Master to ascend the terrace. *\"The capital’s abundance is thus—how can you bear to abandon me and return to the mountains, refusing to aid in governing the age?\"* The Master replied: *\"Birds and beasts nest in forests and foothills; fish and turtles roam rivers and lakes—each delights in its own way.\"*\n\nTaizong pointed to the throngs of people and carriages below, asking: *\"Do you see?\"* *\"I do,\"* said the Master. *\"What do you see?\"* *\"I see the rich clinging to life, the poor scrambling for fate.\"* Taizong fell silent. Soon after, he descended the Jade Gate and returned to the palace.\n\nThe next morning, the Master entered the court and firmly declined to remain, but the emperor earnestly sought his counsel on securing the world and aiding the people. The Master, without hesitation, took up brush and paper and wrote four characters: *\"Far and near, light and heavy.\"* The emperor did not grasp their meaning. The Master explained: *\"‘Far’ means to summon worthy scholars from afar; ‘near,’ to cast out sycophants close at hand; ‘light,’ to lighten the taxes of the people; ‘heavy,’ to heavily reward the three armies.\"* The emperor, hearing this, was greatly pleased.\n\nKnowing the Master could not be detained, Taizong hosted a farewell banquet in the side hall, ordering the two chief ministers to attend and compose poems in his honor. He also commanded Wang Zuo, the prefect of Huazhou, to visit and inquire after the Master’s needs, ensuring nothing was lacking. From then on, whether wise or unworthy, all within the realm heard of his renown and admired him; countless wished to take up staff and mat to study under him.\n\nAs he prepared to leave the capital, the Master composed *\"Parting from Court\"*:\n*Ten years of footsteps trod the red dust,*\n*Longing for green mountains, I dreamed of them often.*\n*Though the purple paths flourish, what compares to sleep?*\n*Though vermilion gates be noble, poverty is better.*\n*Grieved to hear swords and spears propping up a troubled lord,*\n*Weary of listening to pipes and songs clamoring to intoxicate men.*\n*I take my old books back to my old retreat—*\n*Wildflowers, singing birds, the same spring as ever.*\n\nTaizong, determined to see the Master return to the mountains, could not press him to stay. The emperor bestowed upon him a saddle adorned with tortoise and crane motifs, along with fine horses and other lavish gifts, but the Master firmly declined all but tea and medicine. He ordered an envoy to convey the Master in a comfortable carriage to the Cloud Terrace Abbey on Mount Hua, bestowing upon him the title *\"Master of Rare Serenity.\"*\n\nThe imperial edict read:\n*\"To the Daoist Chen Tuan, a man of lofty virtue in this age, a guest of successive dynasties: drawn by the flourishing culture of our reign, you came to pay homage. Without a fitting title, how could your pure example be made known? Let it be decreed that you be granted the title ‘Master of Rare Serenity.’\"*\n\nBefore parting, the Master left a quatrain:\n*High on Mount Hua is my palace,*\n*Stepping out, I ride the dawn wind through empty skies.*\n*No need to lock the gates of its halls with golden bolts—*\n*When I return, white clouds will seal them for me.*\n\nIn the early years of Taiping Xingguo, Taizong dispatched an envoy with a poem to summon him once more, but the Master declined, refusing to rise. Privately, he had foretold that the Mandate of Heaven truly rested with Emperor Zhangsheng. The imperial poem read:\n*Once you emerged from white clouds of a former court,*\n*Later news of you faded into silence.*\n*If now you would heed the summons,*\n*I would grant you all Three Peaks.*\n\nThe Master ultimately declined and did not go. The emperor then sent two women to attend him, to hold his towel and comb, but the Master refused them, replying with a poem:\n*Snow for flesh, jade for cheeks—*\n*Deep thanks to the lord for sending them to me.*\n*This hermit never dreamed of Wu Gorge,*\n*Vainly laboring clouds and rain to descend from Sunny Terrace.*\n\nAnother account holds that Emperor Xizong of Tang enfeoffed him as *\"Recluse of Pure Emptiness\"* and sent three palace women to tend to his needs, prompting him to compose a poem.\n\nTaizong’s *\"Ode to Master of Rare Serenity\"*:\n*The stalwart Daoist Chen Tuan of Mount Hua mingled in the world yet dwelled beyond it,*\n*Nurturing the vast, uncarved qi, aligning with the Lesser Weaving Star of the recluse.*\n*Unbowed before kings and lords, he kept his resolve in forests and valleys,*\n*Delighting in our harmonious rule, rejoicing in this era of sagely succession.*\n*Yet he journeyed far across rivers and roads, briefly visiting the capital,*\n*Where for ten days he was received with warmth, his presence a great boon.*\n*White clouds cannot linger in the imperial city,*\n*Fine titles are hard to tempt a man of attainment.*\n*Of old, the sagest Tang Yao had his external ministers in Chao and Xu;*\n*Though my virtue is meager, I would follow this precedent.*\n*Fearing some lack in the mountains, I have ordered Wang Zuo, prefect of Huazhou, to supply all your needs.*\n*Now you return to your old peaks as spring begins—*\n*Cherishing your lofty integrity, may you find all as it should be.*\n*Thus I send this message of care—may you take it to heart.*\n*The spring is cold—how have you been of late?*\n*This letter cannot say all that is in my heart.\"*\n\nThe *\"Edict Granting Tea and Silk\"*:\n*\"Ah! I, enthroned as the Nine-Five, though I have waged war for years, do so with a heart set on benefiting all things. Recently, my phoenix banners marched south, and the lands beyond the Yangtze came to court. Sincerity was repeatedly pledged before the army, and tribute of rare goods was laid at the palace steps. Having shown their allegiance, I ordered the troops to disband.\"*",
      "overlap_context": "untains and your love of sleep—is there truth in this?\"*\nThe Master replied: *\"Indeed.\"* He then presented *\"The Sleep Song\"*:\n*I love sleep, I love sleep,\nNo felt mat, no quilted cover.\nA slab of stone for my pillow,\nA straw cloak spread upon the earth.\nSleeping north or south, east or west—\nWherever I please.\nThunder crashes, lightning splits, Mount Tai collapses,\nThe boundless sea pours into the void.\nThe Black Dragon roars, startling gods and ghosts—\nYet when I am weary, I snore in slumber.*",
      "start_char": 4869,
      "end_char": 6077,
      "start_sentence": 199,
      "end_sentence": 256,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.59359931945801,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\太华希夷志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "以汝早弃尘寰，高居物外，自得逍遥之趣，不惊宠辱之心，镇彼嚣浮，有足嘉尚，俾均赐责，用奖隐沦，今赐汝云云。 河潼气爽，莲岳地灵，摄道知方，谅多休祉，临轩翘瞩，寤思在怀，想宜知悉。 夏热，汝比好否？ 遣书指不多及。 赐汝细白绢三十匹，蜡面茶一十斤，研膏茶二十斤，鸦山荼二十斤，诏至可领也。 先生尝立於庭问，见金人持剑呼曰：子道成矣，当有归成之地。 盖秋为万物之所敛而归者也，吾其隐於西方乎？ 是时年已七十余，遂抵华山，得古云台观故基，辟刑榛而居之，以契归成之语。 着《三峰寓言》五十首。 时境内有虎食人，先生至其处，叱虎令去，自是虎不为害。 雍熙中，先生因吟望仙掌，坐对瀑流，指隙地曰：此北极之旧地也，吾尝夜见神人，衣黑衣顶冠，掌中有朱书字，示吾，其文曰：此极开同紫微帝君之殿。 先生因曰：开同者，因天地而生，故为北辰也。 乃命弟子构之。 侯璨、张观将举进士，以问先生。",
      "translated_text": "Having long since left the dusty world behind, you dwell high above mundane things, naturally attaining the joy of carefree wandering, your heart unshaken by favor or disgrace. In stilling the clamor of the fleeting, you are truly worthy of praise. Thus, I bestow these gifts equally to honor your reclusive life. Now I grant you the following:\n\nThe air of Hetong is crisp, the spirit of Lian Peak numinous. Having embraced the Dao and known your proper place, you surely enjoy abundant blessings. As I gaze from the palace terrace, my waking thoughts turn to you. May you take this to heart.\n\nThe summer heat—how have you been of late? This letter cannot say all that is in my heart.\n\nI grant you thirty bolts of fine white silk, ten catties of wax-sealed tea, twenty catties of研膏 tea, and twenty catties of Yashan tea. Upon receipt of this edict, you may claim them.\n\nOnce, as you stood in the palace courtyard, you saw a golden figure holding a sword who cried out: \"Your Dao is complete—you shall have a place of return.\" For autumn is the season when the myriad things gather and return, and so I shall withdraw to the west. At that time, you were already over seventy. You then journeyed to Mount Hua, where you found the ruined foundations of the ancient Yuntai Temple. Clearing away the brambles, you made your dwelling there to fulfill the prophecy of \"return.\"\n\nYou composed *Fifty Stray Words from Three Peaks*. In those days, tigers preyed on people within the region. When you arrived at the place, you rebuked the tigers and ordered them to leave. From then on, they ceased their harm.\n\nDuring the Yongxi era, as you chanted verses gazing at the Immortal’s Palm Peak and sat facing the cascading stream, you pointed to a patch of ground and said: \"This was once the site of the North Star’s ancient abode. I once saw a divine being at night, clad in black robes and a crown, holding in his palm a vermilion script that read: *‘Here the Hall of Kai Tong, Palace of the Purple Tenuity Emperor.’*\" You then explained: \"Kai Tong arises from heaven and earth, and thus becomes the North Star.\" You ordered your disciples to construct it.\n\nHou Can and Zhang Guan, preparing for the imperial examinations, sought your counsel.",
      "overlap_context": "ow have you been of late?*\n*This letter cannot say all that is in my heart.\"*\n\nThe *\"Edict Granting Tea and Silk\"*:\n*\"Ah! I, enthroned as the Nine-Five, though I have waged war for years, do so with a heart set on benefiting all things. Recently, my phoenix banners marched south, and the lands beyond the Yangtze came to court. Sincerity was repeatedly pledged before the army, and tribute of rare goods was laid at the palace steps. Having shown their allegiance, I ordered the troops to disband.\"*",
      "start_char": 6077,
      "end_char": 6447,
      "start_sentence": 257,
      "end_sentence": 270,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.633759260177612,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\太华希夷志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "曰：侯张二生，今年登科不如来年。 是年春省黜其名，明年中第，皆如其言。 太华希夷志卷上竟 #1『口』，底本不清，似『碌』。 太华希夷志卷下 登仕郎河中府知事讷斋张辖纂集补撰 初，张忠定公乖崖咏谒华山陈图南，欲同隐华山。 希夷曰：他人即不可，如公者，吾当分一半相奉。 然公有官职，未可议此，如失火家待公救，岂可不赴也？ 公别搏，搏以宣毫十枝、白云台墨一剂、蜀栈一角为赠，公谓搏曰：会得先生意驱咏入闹处去。 曰：珍重、珍重。 搏送公回，谓弟了曰：斯人无情於物，达则为公卿，不达为帅。 乃赠诗一绝云； 征昊入蜀是寻常，歌舞筵中救火忙。 乞得金陵闲养老，也须忧恤鬓边苍。 公始不谕其意，后更镇西蜀，驰驿过华阴，不暇与希夷相见。 寄诗与先生曰：性愚不肯林泉住，刚欲清流拟置君。 今日星驰剑南去，回头惭愧华山云。 后公西蜀回，有诗云：世人大抵重官荣，见我东归夹道迎。 应被华山高士笑，天真丧尽得浮名。 公晚年有疮发於鬓，治久不差，遂自请金陵养老，以鬓疮卒。 果如其言。 钱文禧公若水，少谒希夷，求相邀入山斋地，炉畔见老僧拥坏瞑目，附火钱揖之，僧微开目而已。 良久，希夷问曰：如何？ 僧摆头曰：无此等骨。 后见希夷，曰…吾始见子神貌清粹，谓子可学神仙，而此僧言子无仙骨，但可作贵公卿耳。 钱曰：其僧何人耶？ 希夷曰：麻衣道者。 《闻见录》一说若水为举子时，见希夷於华山。 希夷曰：明日当再来。 若水如期往，见有一老僧与希夷拥地炉坐，僧熟视若水，久之不语，以火箸画灰，作做不得三字。 徐曰：急流中涌退人也。 若水辞去，希夷不复留。 后若水登科，为枢密副使，年才四十致仕。 希夷初谓若水有仙风道骨，意未决命。 僧观之，做不得，故不复留。 然急流中涌退去，神仙不远矣。 僧麻衣道者也。 华阳隐士李琪自言：唐开元中，郎官人罕有见者。 关中逸人吕洞宾有剑术，虽数百里，顷刻辄至，世以为神仙。 数至希夷斋馆，与之唱酬如交友。 时人异之。 此皆旧史之丈也。 陈尧佐知华州，一日谒希夷先生，坐定与语。 少顷，有一道士风姿英爽，目如点漆，真神仙中人也。 径入坐次，希夷急避尊位，略话数语，皆方外之事。 须臾，豹囊中取枣一枚与尧佐，却而不受，希夷起接啖之。 不久辞去，送於观外。 复会坐，尧佐曰：此何人？ 希夷曰：即洞宾也。 尧佐悔愕不已。 清源王世则等同诣先生，世则为仆隶，拜於阶下，先生笑而降阶曰：侮人者，自侮也。 揖世则坐诸生之右，曰：将来君冠诸公。 明年，世则果第一人及第。 一日，先生自言：尝遇高士孙君仿、康皮处士，二人语余曰：武当山九室岩可以隐居。 因往栖焉。 许谏议仲宣罢成都牧，过其庐，先生曰：非久再当补外。",
      "translated_text": "You said: \"For the two scholars Hou and Zhang, success in the imperial examinations this year will not compare to next year.\" That spring, their names were struck from the examination roster, but the following year, both passed—just as you had foretold.\n\n*Here ends Volume One of* The Record of the Recluse of Mount Taihua. *(Note: The character following* 竟 *appears as* 口 *in the original; the text is unclear, resembling* 碌*.)*\n\n---\n\n**Volume Two of** *The Record of the Recluse of Mount Taihua*\n*Compiled and supplemented by Zhang Xia of Nezhai, Registrar of Hezhong Prefecture, with the honorary title of Dengshilang*\n\nEarlier, when the loyal and upright Lord Zhang Guaiya visited Chen Tunan on Mount Hua to pay his respects, he expressed a desire to retire together on the mountain. Master Xiyi replied: \"For others, this may not be possible—but for one such as yourself, I would gladly yield half my place. Yet you hold an official post, and such matters cannot be discussed. If a household were ablaze, would you not rush to its aid?\" Lord Zhang took his leave, and Xiyi presented him with ten sticks of Xuanhao ink, a cake of Baiyuntai ink, and a corner of Shu zhan as parting gifts. To his disciple Bo, the lord remarked: \"This meeting has driven my poetic impulses into the bustling world.\" Xiyi replied: \"Take care, take care.\"\n\nAfter seeing Lord Zhang off, Bo said to his fellow disciples: \"This man is indifferent to worldly things. If he prospers, he will become a high minister; if not, he will lead armies.\" He then composed a quatrain for him:\n\n*Seeking the heavens in Shu is but commonplace,*\n*While feasts of song and dance rush to quell the flames.*\n*If granted leisure in Jinling to age in peace,*\n*Still must you tend the frost at your temples’ trace.*\n\nAt first, Lord Zhang did not grasp his meaning. Later, when he was reassigned to govern western Shu, he passed through Huayin in haste and had no time to visit Xiyi. He sent a poem to the master instead:\n\n*Foolish, I refused to dwell in woods and springs,*\n*Yet sought to place you in a stream so clear.*\n*Now hurrying southward beneath the stars’ bright wings,*\n*I turn my head, ashamed of Hua’s clouds so near.*\n\nUpon his return from western Shu, Lord Zhang wrote another poem:\n\n*Most men revere rank and glory’s sheen,*\n*Crowding the roads to greet my eastern return.*\n*Yet Hua’s high hermit must surely scorn me,*\n*Who’ve lost all truth to chase a fleeting name.*\n\nIn his later years, Lord Zhang developed a sore on his temple that resisted treatment. He eventually petitioned to retire to Jinling, where he died of the affliction—just as Xiyi had foretold.\n\nWhen the scholar Qian Ruoshui, later known as Lord Wenxi, was young, he visited Xiyi and sought to be invited into his mountain retreat. By the stove, he saw an elderly monk wrapped in tattered robes, eyes closed, warming himself by the fire. Qian bowed, but the monk only opened his eyes slightly. After a long while, Xiyi asked: \"What do you think?\" The monk shook his head and said: \"He lacks such bones.\" Later, when Xiyi saw Qian again, he said: \"At first, I saw your spirit and appearance were pure and refined, and thought you might cultivate the Dao of immortality. But this monk says you lack the bones of a transcendent—you are fit only to become a noble minister.\" Qian asked: \"Who was that monk?\" Xiyi replied: \"The Daoist of the Hemp Robe.\"\n\n*According to* The Record of Things Seen and Heard, *when Ruoshui was a candidate for the imperial examinations, he visited Xiyi on Mount Hua. Xiyi said: \"Come again tomorrow.\" Ruoshui returned at the appointed time and saw an old monk sitting by the stove with Xiyi. The monk studied Ruoshui intently for a long while without speaking, then drew in the ashes with a fire poker, writing the characters* \"cannot achieve\" *(做不得). Slowly, he said: \"A man swept back in the surging current.\"* Ruoshui took his leave, and Xiyi did not detain him. Later, Ruoshui passed the examinations, became Vice Minister of the Bureau of Military Affairs, and retired at the age of forty. Initially, Xiyi had seen in Ruoshui the bearing of an immortal, but his fate remained undecided. The monk, observing him, declared he \"could not achieve\" it—and so Xiyi did not keep him. Yet in being \"swept back in the surging current,\" the path to transcendence was not far off. The monk was the Daoist of the Hemp Robe.\n\nThe recluse Li Qi of Huayang claimed: \"During the Kaiyuan era of the Tang, few officials were ever seen. The hermit Lü Dongbin of Guanzhong possessed sword arts—able to traverse hundreds of *li* in an instant—and was regarded by the world as a divine immortal. He visited Xiyi’s abode several times, exchanging poems and songs as friends. People marveled at this.\" These are all accounts from old histories.\n\nWhen Chen Yaozuo governed Huazhou, he paid a visit to Master Xiyi. After they had settled and begun talking, a Daoist with a striking presence—his eyes like dots of lacquer, truly a man among immortals—entered and took a seat. Xiyi hastily yielded his place of honor. They exchanged a few words, all concerning matters beyond the world. Soon, the Daoist took a jujube from his leopard-skin pouch and offered it to Yaozuo, who declined. Xiyi rose to accept and ate it. Shortly after, the Daoist took his leave, and Xiyi saw him out beyond the temple gates. When they resumed their seats, Yaozuo asked: \"Who was that?\" Xiyi replied: \"Lü Dongbin.\" Yaozuo was filled with regret and astonishment.\n\nWhen Wang Shize of Qingyuan and others visited the master, Shize, who had been a servant, bowed at the foot of the steps. Xiyi smiled and descended, saying: \"He who humiliates others humiliates himself.\" He then invited Shize to sit to the right of the other scholars, declaring: \"In the future, you will surpass all these gentlemen.\" The following year, Shize indeed ranked first in the imperial examinations.\n\nOne day, Xiyi remarked: \"I once met the scholar Sun Junfang and the hermit Kang Pi. They told me: 'The Nine-Chambered Cliff on Mount Wudang is a suitable place for seclusion.' I went and dwelled there.\" When the remonstrance official Xu Zhongxuan, who had been dismissed from his post as governor of Chengdu, passed by his hut, Xiyi said: \"Before long, you will be appointed to an external post again.\"",
      "overlap_context": "a patch of ground and said: \"This was once the site of the North Star’s ancient abode. I once saw a divine being at night, clad in black robes and a crown, holding in his palm a vermilion script that read: *‘Here the Hall of Kai Tong, Palace of the Purple Tenuity Emperor.’*\" You then explained: \"Kai Tong arises from heaven and earth, and thus becomes the North Star.\" You ordered your disciples to construct it.\n\nHou Can and Zhang Guan, preparing for the imperial examinations, sought your counsel.",
      "start_char": 6447,
      "end_char": 7501,
      "start_sentence": 271,
      "end_sentence": 327,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.436068534851074,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\太华希夷志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "寻迁给事中，尹河南。 瑜年入觐，又遣人致书币以问休咎。 谓门人贾德升曰：为我答书给事，此去更不出矣。 未几果卒。 郭沆者，少居华阴，尝宿观下，中夜先生呼令趣归，沆惮其远，不欲去。 先生与之俱往，行一二里，有人号呼，以报母卒。 沆始悟先生遗药，急去可救。 既至，果卒，饵其药遂愈。 斋中有大瓢挂壁上，有道士贾休复欲之，未敢言。 希夷谓之曰：子来非有他意，盖欲吾瓢耳。 命侍者取而与之。 神放，字明逸，隐居终南豹林谷，闻先生之风，往见之。 先生一日令洒扫庭除：有佳客至。 明逸果至，作樵夫拜庭下，希夷挽之而上曰：君岂樵夫者，后当有显官，声名闻天下。 明逸曰：放以道义来，官禄非所问也。 希夷笑曰：人之贵贱，莫不有命。 君骨相当耳。 虽晦山林，恐不能安，异日自知之。",
      "translated_text": "Soon after, Xu was promoted to Gentleman for Attendance and appointed Prefect of Henan. Yu, who had entered the capital for his annual audience, again sent a messenger bearing a letter and gifts to inquire about his fortunes. Xiyi said to his disciple Jia Desheng: \"Write a reply for me to the Gentleman for Attendance. From this point on, he will never emerge from seclusion again.\" Before long, Yu indeed passed away.\n\nGuo Hang, who in his youth had lived in Huayin, once lodged beneath the Daoist abbey. In the middle of the night, the master called out to him, urging him to return home at once. Hang, daunted by the distance, was reluctant to leave. The master accompanied him on the journey. After traveling one or two *li*, they heard someone crying out, bearing the news of his mother’s death. Only then did Hang realize that the master had given him medicine, and that if he had left promptly, he might have saved her. Upon arriving, he found that she had indeed died, but after administering the medicine, she revived.\n\nIn the oratory hung a large gourd from the wall. A Daoist named Jia Xiufu coveted it but dared not speak of it. Xiyi said to him: \"You have come with no other purpose—you merely desire my gourd.\" He ordered his attendant to take it down and give it to him.\n\nShen Fang, styled Mingyi, had secluded himself in Baolin Valley on Mount Zhongnan. Hearing of the master’s reputation, he went to meet him. One day, Xiyi instructed him to sweep the courtyard, saying: \"An esteemed guest will arrive.\" Sure enough, Mingyi appeared, dressed as a woodcutter, and bowed at the foot of the steps. Xiyi drew him up, saying: \"You are no woodcutter. In the future, you will hold a prominent office, and your name will resound throughout the realm.\" Mingyi replied: \"I have come for the sake of the Dao and virtue; official rank and emolument are not my concern.\" Xiyi smiled and said: \"A person’s nobility or lowliness is determined by fate. Your bones are destined for such things. Though you may hide in the mountains and forests, I fear you will not find peace. In time, you will come to know this yourself.\"",
      "overlap_context": "ll these gentlemen.\" The following year, Shize indeed ranked first in the imperial examinations.\n\nOne day, Xiyi remarked: \"I once met the scholar Sun Junfang and the hermit Kang Pi. They told me: 'The Nine-Chambered Cliff on Mount Wudang is a suitable place for seclusion.' I went and dwelled there.\" When the remonstrance official Xu Zhongxuan, who had been dismissed from his post as governor of Chengdu, passed by his hut, Xiyi said: \"Before long, you will be appointed to an external post again.\"",
      "start_char": 7501,
      "end_char": 7814,
      "start_sentence": 328,
      "end_sentence": 345,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.125640153884888,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\太华希夷志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "后真宗朝召为司谏，帝担其手登龙图阁，论天下事，辞归山，拜谏议大夫，后改工部侍郎。 又谓明逸曰：君不娶，可得中寿。 明逸从之。 至六十岁卒。 先是希夷为明逸卜上世葬地於豹林谷下，不定穴既葬，希夷见之言：地固佳，安穴稍后，世世当出名将。 明逸不娶无子，自其侄衡至今，为将帅有声。 后希夷解化，明逸立碑叔希夷之学曰：皇王帝伯之道，云希夷先生有高识，尝诚某曰：子他日遭逢明主，不假取迹，动天阙名驰寰海。 名者，古今之美器，造物者探忌之，天地问无完名，子名将起，必有物败，可戒之。 放晚节侈饰过度，营产满丰、镐问，门人戚属亦估势强并，岁入益厚，遂丧清节。 时王嗣宗守京兆，醉慢骂，条奏於朝，会赦方止。 祥符八年一旦，山斋起服，聚诸生列饮，取平生文药悉焚之，酒数行而逝，亦奇男子。 希夷先生好读《易》，以数学授穆修伯长，修授李之才挺之，挺之授康节邵尧夫，尧夫以象授神放，放授芦江许坚，坚授艺夸昌，一枝传於南方也。 世但以为神仙卫善人伦风鉴而已，非知希夷先生也。 先生忽谓弟子贾德升曰：今日有佳客至，当速见报。 少顷，一人衣短褐青巾，扣门，贾未及报，其人忽尔而去。 先生遽出追之一里余，遇老人衣鹿皮，因问曰：前去远否？ 老人曰：此神仙李八百也，动则八百里。 又悟鹿衣者乃太清得道白鹿先生也，李即不及，而鹿衣者亦失所在。 希夷先生曰：吾不久留此世矣。 端拱初，语门人曰：吾来岁中元后，当游峨眉，使昼夜然烛於石室中。 弟子等恭受文翰，虔奉约束，皆呜咽流涕。 先生曰：无乱示情，以怛我化也。 先生临卒，草奏疏，人莫见其言，遣弟子贾德升持所赐龟鹤并青综马，诣阙以进。 上独览久之，以所献物复赐德升，仍加紫服，号曰悟真先生。 希夷端拱初命德升曰：汝可於张超谷凿石为室。 二年七月初室成，先生乃欣然策马，径造其谷，至盘石晓碗处，舍马而徒，攀藤引萝，暮抵其室，大笑数四，谓弟子曰：才岩太华，气清景秀，吾之所归乎。 即书数百言为表，其略曰：大数有终，圣朝难恋，已於今月二十二日化形於莲华峰下，张超谷中。 至期以烛，及夕命灭之，令弟子各休息。 既曙，则以左手支颐而终，寿一百一十八岁。 经七日，肢体犹温。 有五色云蔽塞洞口，累日不散。",
      "translated_text": "Later, during the reign of Emperor Zhenzong, Mingyi was summoned to serve as *Sijian* and was led by the emperor’s own hand into the Dragon Diagram Pavilion to discuss matters of state. Upon resigning and returning to the mountains, he was appointed *Jianyidafu*, then later transferred to *Gongbu Shilang*. Xiyi also told Mingyi: \"If you do not marry, you may attain a middling lifespan.\" Mingyi followed his advice. He died at the age of sixty.\n\nEarlier, Xiyi had divined for Mingyi an ancestral burial site at the foot of Baolin Valley, but the grave’s precise location remained undetermined. After the burial, Xiyi remarked: \"The land is indeed excellent, but the grave’s placement is slightly too far back. For generations to come, it will produce renowned generals.\" Though Mingyi never married and had no sons, from his nephew Heng onward, his lineage produced celebrated military commanders to this day.\n\nAfter Xiyi’s passing, Mingyi erected a stele in praise of his master’s teachings, declaring: \"The Way of emperors and kings is as fleeting as clouds. Master Xiyi possessed profound insight. He once admonished me: ‘One day, you will encounter a wise ruler. Without seeking office, your name will resound at the celestial gates and echo across the realm.’ A name is the finest vessel of past and present, yet the Creator guards against its perfection. Between heaven and earth, no name remains unblemished. When your fame rises, something will surely tarnish it—beware of this.\"\n\nIn his later years, Mingyi indulged in excessive adornment, amassing wealth around Feng and Hao. His disciples, relatives, and dependents also exploited their influence to expand their holdings, increasing their annual income. Thus, he lost his reputation for purity. At the time, Wang Sizong, the prefect of Jingzhao, drunkenly insulted him, and a formal impeachment was submitted to the court—only to be halted by a general amnesty.\n\nIn the eighth year of the Xiangfu era, one morning, Mingyi rose from his mountain retreat, gathered his disciples for a feast, and burned all his writings and medicinal texts. After several rounds of wine, he passed away—an extraordinary man to the end.\n\nMaster Xiyi was fond of studying the *Book of Changes* and transmitted his numerological teachings to Mu Xiu, whose name was Bolong. Mu taught Li Zhicai, whose name was Tingzhi. Tingzhi taught Shao Yaofu of Kangjie, who passed the teachings on to Shen Fang. Fang transmitted them to Xu Jian of Lujiang, who in turn taught Yi Kuachang—a lineage that spread southward. Yet the world only regarded Xiyi as a divine immortal or a master of physiognomy, unaware of his true depth.\n\nOne day, Xiyi suddenly told his disciple Jia Desheng: \"A distinguished guest will arrive today. Go quickly and announce his coming.\" Soon after, a man in a short hemp robe and a green headscarf knocked at the door. Before Jia could report, the visitor vanished. Xiyi rushed out and pursued him for over a *li*, where he encountered an old man in deerskin. He asked: \"Has the one ahead gone far?\" The old man replied: \"That was the immortal Li Babai. When he moves, he covers eight hundred *li*.\" Xiyi then realized the deerskin-clad figure was the Perfected White Deer of Great Clarity, a Daoist adept. Though he could not catch Li, the deer-clad master also disappeared without a trace.\n\nXiyi said: \"I shall not remain in this world much longer.\" At the beginning of the *Duangong* era, he told his disciples: \"Next year, after the Zhongyuan Festival, I will journey to Mount Emei. Have lamps lit day and night in the stone chamber.\" His disciples reverently received his writings and solemnly accepted his instructions, weeping in sorrow. Xiyi said: \"Do not disrupt the natural order with your emotions—it would disturb my transformation.\"\n\nAs his end approached, Xiyi drafted a memorial, the contents of which no one saw. He sent his disciple Jia Desheng to the imperial court bearing the turtle and crane bestowed upon him, along with a dark-green horse. The emperor alone read the memorial for a long time, then returned the gifts to Desheng, further bestowing upon him a purple robe and the title *Wuzhen Xiansheng* (Perfected Awakened Master).\n\nAt the start of the *Duangong* era, Xiyi instructed Desheng: \"You must carve a stone chamber in Zhangchao Valley.\" By the second year, on the seventh day of the seventh month, the chamber was completed. Xiyi joyfully rode his horse straight to the valley. Upon reaching the winding path where dawn broke over the bowl-shaped rock, he dismounted and climbed by grasping vines and creepers. By dusk, he arrived at the chamber, laughing heartily several times before telling his disciples: \"This cliff rivals Mount Taihua in grandeur, its *qi* pure and its scenery sublime—this is where I shall return.\" He then wrote a memorial of several hundred words, the gist of which read: \"The great cycle has ended; the sagely court is hard to leave. On the twenty-second day of this month, I shall transform my form beneath Lotus Peak, within Zhangchao Valley.\"\n\nOn the appointed day, lamps were lit. At dusk, he ordered them extinguished and instructed his disciples to rest. At dawn, he was found dead, his left hand propping up his cheek. He had lived one hundred and eighteen years. For seven days afterward, his limbs remained warm. A five-colored cloud shrouded the cave’s entrance, lingering for days without dispersing.",
      "overlap_context": "im up, saying: \"You are no woodcutter. In the future, you will hold a prominent office, and your name will resound throughout the realm.\" Mingyi replied: \"I have come for the sake of the Dao and virtue; official rank and emolument are not my concern.\" Xiyi smiled and said: \"A person’s nobility or lowliness is determined by fate. Your bones are destined for such things. Though you may hide in the mountains and forests, I fear you will not find peace. In time, you will come to know this yourself.\"",
      "start_char": 7814,
      "end_char": 8685,
      "start_sentence": 346,
      "end_sentence": 376,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.670794010162354,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\太华希夷志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "后有中使至峨眉，有客入谒，衣冠甚伟，自称东明专相，多说华山事，后方悟华山陈先生，遽令召之，不知所往。 自号扶摇子，其先生门弟子，并高人胜士同至者，咸录於后，以激励后学云。 晦庵先生《通炉纲目》曰：周世宗召华山隐士陈搏诣阙，问以飞升黄白之术。 对曰：陛下为天子，当以治天下为务，安用此乎？ 乃遣还山，诏州县长吏常存问之。 胡氏曰：陈搏所蕴，非世宗所知也，飞升黄白之问，不亦陋乎。 搏以治天下对，已发其端，世宗不能访以治道也。 先生披刑榛筑室於上方。 太平兴国中，太宗累赐诏资御诗，召搏赴阙，乃救有司增积隐庐，复给内府金钱经始，坛殿规模方备，今观是也。 先生着《指玄篇》八十章，《入室还丹诗》五十首，又作《钓潭集》万余字，皆腼缕道妙，包括至真，其言简而理深，使观者有所自得。 先生启沃上意，幽赞远图，太宗欲以为谏议大夫，先生恳辞，命遂不下。 委化之年，盖百一十八岁。 自谓先机逆数，知来识往，精微探妙，殆不可测。 至诸奇说吆曜之事，则未尝为也。 故先生之道，浩然莫得，而揭厉之者，无贤愚贵贱，莫不闻其风而悦之。 先生没后，有弟子曾孙武尊师，因文正范公指教，得《入室还丹诗》於京师凝真院，得《三峰寓言》於太华李宁处士，得《指玄篇》於赤城张无梦，得《钓潭集》於张中庸进士，共三百篇余，乃纂先生传集并《养生要旨》及《李真人服饵法》。 御赐诗曰：只向身边有大还，胎神月殿在秋天。 三灵密象谁分别，尸质清虚本自然。 又御赐篆明堂及飞白清静二字。 真宗祀汾阴，驻跸华阴，再幸云台，阅先生遗像，伫立凝思久之，命除其观田租，召对道士武子华等赐紫服。 张方平往来秦蜀，恭谒神御，既而瞻礼希夷，推神仙者之云：盖神本无方，道无不在。 神也者妙万物而为言者也，惟神也，故不疾而速，不行而至，漠然与合，谓至人。 由是后可以出死生而穷变化，至于一气返复之元本四象自然之体用指玄理精婉已成章彼九室下方，岂徒与麋鹿为群，木石为伍而已哉。 先生紫胞绿络眉目伟异方瞳粹音九流百氏之学咸彻视洞观，先生之道，窈乎其深而不可穷，恍乎其变而不可测，固将乘云气，骑日月，以游乎四海之外，岂与吆奇怪尚诡谲以欺世取誉者同？ 年而语哉？ 神放以处士召见，拜谏官，真宗待以殊礼，名动海内，后请归终南山，恃恩骄倨甚。 王嗣宗知长安，放至，通判以下群拜谒，放小倪垂手接之而已，嗣宗内不平，放召其侄出拜，嗣宗坐受之。 放怒，嗣宗曰：曩者通判以下拜君，君扶之，此白丁耳，嗣宗状元及第，名位不轻，胡为不得坐受其拜。 放曰：君以手搏得状元，何足道也。 嗣宗怒，遂上疏，言放才识无以瑜人，专饰诈巧，盗虚名，陛下尊礼擢为显官，恐天下窃笑，益长浇伪之风。 且陛下召魏野，野闭门避匿，而放阴结权贵，以自荐达。 因扶值言放阴事数条。 上虽两不问，待放之意寝衰。 种放别业在终南山，后生徒学者甚众，性颇嗜酒，躬耕种林以自酿。 所居有林泉之胜，殊为幽绝，真宗闻之，遣中使擭画工图之，开图召辅臣观焉，上叹赏之。 其后甘棠魏野居有幽致，帝以遣人图之，故野有诗曰：穆修伯长汶阳人，后居蔡州师图南。",
      "translated_text": "Later, an imperial envoy arrived at Mount Emei, where a visitor sought an audience. The man was imposing in dress and bearing, introducing himself as Dongming Zhuanshi. He spoke at length of matters concerning Mount Hua, and only afterward did the envoy realize this was Master Chen of Mount Hua. He hastily ordered the man summoned, but he had vanished without a trace.\n\nHe styled himself Fuyaozi. His disciples and fellow scholars who had gathered with him were all recorded afterward to inspire later generations.\n\nMaster Huian’s *Comprehensive Register of the Alchemical Furnace* states: During the reign of Emperor Shizong of Zhou, the reclusive Master Chen Tuan of Mount Hua was summoned to court and questioned about the arts of ascending to immortality and transmuting base metals into gold. He replied, “Your Majesty rules as Son of Heaven—should you not devote yourself to governing the realm? What need have you for such things?” The emperor then sent him back to the mountains, decreeing that local officials should regularly inquire after his well-being.\n\nHu Shi remarked: What Chen Tuan possessed was beyond Emperor Shizong’s comprehension. To ask about ascending to immortality and alchemy was indeed crude. Though Chen Tuan’s response about governing the realm hinted at the truth, Shizong failed to inquire further about the Dao of governance.\n\nThe master cleared the brambles and built his chamber atop the peak. During the Taiping Xingguo era, Emperor Taizong repeatedly bestowed edicts, gifts, and imperial poems upon him, summoning Chen Tuan to court. Officials were ordered to expand his hermitage, and funds from the imperial treasury were allocated to construct an altar and halls, the scale of which can still be seen today.\n\nThe master composed *Eighty Chapters on Pointing to the Mystery*, *Fifty Poems on Entering the Chamber and Returning to the Elixir*, and *The Angler’s Pool Collection* of over ten thousand characters. All these works meticulously expound the subtleties of the Dao, encapsulating the ultimate truth. His words are concise yet profound, allowing readers to grasp their meaning intuitively.\n\nThe master enlightened the emperor’s mind and subtly guided his grand designs. Taizong wished to appoint him as Remonstrance Grand Master, but the master firmly declined, and the decree was never issued. In the year of his transformation, he was one hundred and eighteen years old.\n\nHe claimed to perceive the hidden patterns of fate, knowing the future and discerning the past, delving into the profound and exploring the mysterious in ways nearly unfathomable. Yet he never engaged in bizarre or ostentatious practices. Thus, the master’s Dao remained vast and elusive, and those who heard of his renown—regardless of wisdom, foolishness, nobility, or humility—were all delighted by his example.\n\nAfter the master’s passing, his disciple, the Venerable Zunshi Zeng, at the guidance of Minister Fan Wenzheng, obtained *Fifty Poems on Entering the Chamber and Returning to the Elixir* from Jingzhen Abbey in the capital, *Three Peaks’ Allegories* from the recluse Li Ning of Mount Taihua, *Eighty Chapters on Pointing to the Mystery* from Zhang Wumeng of Chicheng, and *The Angler’s Pool Collection* from the scholar Zhang Zhongyong. In total, over three hundred pieces were compiled into the master’s collected works, along with *Essentials of Nourishing Life* and *Li the Perfected One’s Methods of Ingesting Elixirs*.\n\nAn imperial poem bestowed upon him reads:\n*Only within the self lies the great return,*\n*The womb-spirit’s moon-palace hangs in autumn’s sky.*\n*Who can distinguish the three numinous symbols?*\n*The corpse’s purity and clarity arise naturally.*\n\nThe emperor also granted him a seal-script inscription of *Hall of Light* and a flying-white calligraphy of *Purity* and *Stillness*.\n\nWhen Emperor Zhenzong offered sacrifices at Fenyin, he halted his procession at Huayin and twice visited the Cloud Terrace. Gazing upon the master’s portrait, he stood in contemplation for a long while. He then exempted the temple’s fields from taxes and summoned the Daoist Wu Zihua and others, bestowing upon them purple robes.\n\nZhang Fangping, traveling between Qin and Shu, reverently paid homage to the imperial portrait and later venerated the reclusive Master Chen. Reflecting on those who pursued immortality, he said: “The divine is formless, and the Dao is omnipresent. The divine is that which subtly permeates all things. Only through the divine can one achieve speed without haste, arrival without movement, and effortless union—this is the perfected person. Thus, one may transcend life and death, fathom transformations, and return to the primordial origin of *qi*’s cyclical flow, the natural essence and function of the four images. The profound principles of *Pointing to the Mystery* have already taken shape. How could the nine chambers below be merely a gathering place for deer and companionship with trees and stones?”\n\nThe master possessed a purple complexion and green veins, with striking features, square pupils, and a pure voice. His learning encompassed the Nine Schools and the Hundred Masters, all of which he saw through with penetrating clarity. His Dao was profound and inexhaustible, elusive and unpredictable. Truly, he would ride the clouds and mount the sun and moon, roaming beyond the four seas—how could he be compared to those who indulge in bizarre tricks and deceptive marvels to deceive the world and seek fame? What need had he for such things?\n\nWhen the master was summoned as a recluse and granted an audience, he was offered the post of remonstrance official. Emperor Zhenzong treated him with exceptional courtesy, and his name resounded throughout the realm. Later, he requested to return to Mount Zhongnan, where he grew arrogant and insolent due to imperial favor.\n\nWhen Wang Sizong governed Chang’an, the master arrived, and all officials from the vice-prefect downward bowed to him. The master merely inclined his head slightly and received them with hands lowered. Sizong inwardly resented this. When the master summoned his nephew to bow, Sizong remained seated to receive the obeisance. The master grew angry, but Sizong said, “Earlier, the vice-prefect and others bowed to you, and you supported them. This is but a commoner, yet I, a *zhuangyuan* graduate of high rank, am unworthy of your sitting to receive my bow?” The master replied, “You won your *zhuangyuan* by wrestling—what is there to boast of?” Enraged, Sizong submitted a memorial stating that the master’s talents and knowledge were unremarkable, that he was a fraud who stole empty fame, and that the emperor’s esteem and promotion of him to high office would invite ridicule and foster deceit. He also mentioned that when the emperor had summoned Wei Ye, Ye had shut his door to avoid the summons, whereas the master had secretly curried favor with powerful officials to recommend himself. He further exposed several of the master’s clandestine affairs. Though the emperor did not pursue either side, his regard for the master gradually waned.\n\nWhen Zhong Fang retired to his estate on Mount Zhongnan, many disciples and scholars gathered around him. He was fond of wine and personally cultivated fields and forests to brew his own. His residence boasted the beauty of forests and springs, secluded and exquisite. Hearing of this, Emperor Zhenzong dispatched an imperial envoy with painters to depict the scene. When the painting was unveiled, the emperor summoned his ministers to view it, sighing in admiration.\n\nLater, when Gantang Wei Ye’s dwelling was found to have a similarly secluded charm, the emperor sent artists to capture it as well. Thus, Wei Ye wrote a poem:\n*Mu Xiu, Bozhang of Wenyang,*\n*Later resided in Caizhou, learning from Tu Nan.*",
      "overlap_context": "ourt is hard to leave. On the twenty-second day of this month, I shall transform my form beneath Lotus Peak, within Zhangchao Valley.\"\n\nOn the appointed day, lamps were lit. At dusk, he ordered them extinguished and instructed his disciples to rest. At dawn, he was found dead, his left hand propping up his cheek. He had lived one hundred and eighteen years. For seven days afterward, his limbs remained warm. A five-colored cloud shrouded the cave’s entrance, lingering for days without dispersing.",
      "start_char": 8685,
      "end_char": 9903,
      "start_sentence": 377,
      "end_sentence": 412,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.00776124000549,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\太华希夷志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "修少豪爽，性褊少合，多游京洛问。 人尝书其诗句于禁中壁问，真宗见之，深加叹赏，问侍臣曰：此为谁诗？ 或以穆修对。 上曰：有文如是，公卿何不荐？ 丁晋公在侧曰：此人行不及言。 由是上不复问。 盖伯长与晋公有布衣旧，晋公顷赴夔漕，伯长犹未仕，相遇汉上，晋公意欲伯长先致其礼，伯长竟不一揖而去。 晋公憾之，由是短於上前。 后晋公贬朱崖，途道州，伯长诗曰：却讶有虞刑政失，四凶何事不移量。 可见其不相善也。 伯长祥符二年梁固榜登进士及第，调海州理橡，以作通判，遂为削籍，隶池州。 其集中《秋浦会遇》诗自叔其详。 后遇赦，署颖州文学参军，故当时呼之日穆参军。 老益贫，家有唐本《韩》《柳》集，乃下丐於亲厚者，得金募工镂板，印数百帐，携入京师相国寺设肆斋之。 伯长坐其傍，有儒生数辈至其肆，辄取阅。 伯长夺取，怒视谓曰：先辈能读一篇，不失一字，当以一部为赠。 自是经年不售。 学者方从事声律，未知为古文，伯长首为之倡，其后尹源子渐。 沬师鲁兄弟始从之学古文。 又传其春秋学李之才，字挺之，青州人，惆傥不群，师事伯长，性严急，稍不如意，或至呵叱。 挺之左右承顺，如事父兄，略无倦意。 登科任孟州司户，挺之坦率，不事仪矩，时太守范忠献公以此颇不悦，挺之自若也。 后忠献建节移镇延安，郡僚多送至境外，挺之但别於近郊，众或让之，挺之曰：异时送太守至如是，且情贵称礼，范公实不我知，而出疆远送非情，岂敢不情事范公。 未几，忠献谪守安陆，过洛，三城故吏无一人往者，独挺之往省之，忠献始称叹，遂受知焉。 邵尧夫子某云：挺之尝为共城令，属卫州。 时先君康节居祖母丧，筑室苏门山百源之上，布衣疏食，三年，躬爨以养先祖。 挺之闻先君好学苦志，自造其庐，问，先君曰：为科举进取之学耳。 挺之曰：科举之外有义理之学，子知之乎？ 先君曰：未也，愿受教。 挺之曰：义理之外有物理之学，子知之乎？ 先君曰：未也，愿受教。 挺之曰：物理之外有性命之学，子知之乎？ 先君曰：未也，愿受教。 於是先君传其学。",
      "translated_text": "Mu Xiu was bold and unrestrained in his youth, his temperament narrow and seldom agreeable, often traveling between the capital and Luoyang. Someone once inscribed his verses on a palace wall, and when Emperor Zhenzong saw them, he sighed in deep admiration, asking his attending ministers, \"Whose poetry is this?\" One replied, \"It is Mu Xiu’s.\" The emperor said, \"With writing like this, why have the ministers not recommended him?\" Ding Jinqong, who was present, remarked, \"This man’s conduct does not match his words.\" Thereafter, the emperor no longer inquired about him.\n\nIn truth, Bozhang and Jinqong had been friends in their commoner days. When Jinqong was appointed as an official to Kuizhou, Bozhang was still without office. They met at Hanshang, where Jinqong expected Bozhang to offer formal greetings first, but Bozhang left without even a bow. Jinqong bore a grudge, and thus spoke ill of him before the emperor. Later, when Jinqong was demoted to Zhuhai and passed through Daozhou, Bozhang wrote a poem:\n\n*I marvel that under the virtuous Yu, governance failed,*\n*Why were the Four Fiends not exiled to distant lands?*\n\nThis revealed their mutual enmity.\n\nIn the second year of Xiangfu, Bozhang passed the imperial examination under Liang Gu’s sponsorship and was appointed as a legal assistant in Haizhou. For composing a document as vice-prefect, he was stripped of his rank and banished to Chizhou. His collected works include the poem *\"Autumn Gathering at Qiupu\"* which recounts these events in detail. Later, upon receiving amnesty, he was assigned as a literary aide in Yingzhou, and thus was known in his time as Military Aide Mu.\n\nIn his old age, he grew increasingly impoverished. His family possessed Tang editions of the collected works of Han Yu and Liu Zongyuan, so he begged funds from close acquaintances, raised money to hire craftsmen to carve printing blocks, and printed several hundred copies. He carried them to the Xiangguo Temple in the capital, where he set up a stall to sell them. Bozhang sat beside the stall, and when several scholars approached to browse, he would snatch the books away, glaring and saying, \"If any of you can recite a single piece without missing a word, I shall gift you an entire set.\" As a result, the books remained unsold for over a year.\n\nScholars of the time were preoccupied with tonal patterns and prosody, unaware of ancient-style prose. Bozhang was the first to advocate for it, followed later by Yin Yuan and the Zi brothers, Shi and Ru. He also transmitted his *Spring and Autumn* scholarship to Li Zhicai, styled Tingzhi, a native of Qingzhou, who was unconventional and unconstrained. Tingzhi studied under Bozhang with reverence, his nature stern and impatient—if slightly displeased, he would scold or reprimand. Yet Tingzhi served him with deference, as one would a father or elder brother, never showing weariness.\n\nAfter passing the imperial examination, Tingzhi was appointed as a judicial officer in Mengzhou. Unrestrained and indifferent to formalities, he often clashed with the prefect, Lord Fan Zhongxian, who grew displeased. Yet Tingzhi remained unperturbed. Later, when Zhongxian was transferred to Yan’an as a military commissioner, many officials saw him off beyond the city limits, but Tingzhi only bid farewell in the outskirts. When others reproached him, he said, \"If I were to see off the prefect in such a manner another time, it would be excessive. Sincerity should match propriety. Lord Fan does not truly know me, so to send him off beyond the borders would be insincere. How could I act insincerely toward him?\"\n\nSoon after, Zhongxian was demoted to governor of Anlu and passed through Luoyang. None of his former subordinates from the Three Cities visited him—only Tingzhi called on him. Zhongxian then began to praise him, and thus came to value him.\n\nShao Yaofu’s son once said: Tingzhi had served as magistrate of Gongcheng, under the jurisdiction of Weizhou. At the time, my late father, Kangjie, was observing the mourning period for his grandmother. He built a hut atop Baiyuan on Mount Sumen, living in plain clothes and coarse food for three years, tending the hearth himself to care for his grandfather. Tingzhi, hearing of my father’s diligent study and resolve, visited his cottage and asked, \"What are you studying?\" My father replied, \"The learning for imperial examinations.\" Tingzhi said, \"Beyond the imperial examinations lies the learning of principle and righteousness—do you know of it?\" My father said, \"I do not. I would gladly receive your instruction.\" Tingzhi said, \"Beyond the learning of principle lies the learning of the patterns of things—do you know of it?\" My father said, \"I do not. I would gladly receive your instruction.\" Tingzhi said, \"Beyond the learning of the patterns of things lies the learning of nature and destiny—do you know of it?\" My father said, \"I do not. I would gladly receive your instruction.\" Thereupon, my father transmitted his learning.",
      "overlap_context": "d the beauty of forests and springs, secluded and exquisite. Hearing of this, Emperor Zhenzong dispatched an imperial envoy with painters to depict the scene. When the painting was unveiled, the emperor summoned his ministers to view it, sighing in admiration.\n\nLater, when Gantang Wei Ye’s dwelling was found to have a similarly secluded charm, the emperor sent artists to capture it as well. Thus, Wei Ye wrote a poem:\n*Mu Xiu, Bozhang of Wenyang,*\n*Later resided in Caizhou, learning from Tu Nan.*",
      "start_char": 9903,
      "end_char": 10700,
      "start_sentence": 413,
      "end_sentence": 446,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.70444369316101,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\太华希夷志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "挺之后终殿中丞签书泽州判官厅公事，泽人刘义叟晚出其门，受历法，以为名士。 易学则惟先君得之也。 康节少时自雄其才，慷慨有大志，既学力慕高远，谓先王之事为可必致。 及其学益老德益邵，玩心高明，观於天地之运化，阴阳之消长，以达乎万物之变，然后颓然其顺，浩然其归，在洛三十年始至蓬草环堵，不蔽风雨，躬爨以养其父母。 居之裕如，讲学於家，未尝强以语人，而就问者日众，乡里化之，远近尊之，士人之道洛者，有不之公府而必之先生之庐。 先生德气粹然，与人言必依於仁义忠信，乐道人之善，而未尝及其恶，故贤者悦其德，不贤者服其化，所以厚风俗，成人材者，先生之功多矣。 先生之学得之於李挺之，挺之得之於穆伯长，推其源流，远有端绪，而先生淳一不杂，汪洋浩大，其所自得者多矣。 受命不起，以诗答乡人：平生不作皱眉事，天下应无切齿人。 断送落花安用雨，装添旧物岂须春。 幸逢尧舜为真主，且放巢由作外臣。 六十病夫宜揣分，监司无用苦开陈。",
      "translated_text": "Tingzhi later served as Palace Attendant and Acting Judicial Officer of Zezhou. Liu Yisou of Ze, though late in joining his school, studied calendrical astronomy under him and became renowned as a scholar. As for the study of the *Yijing*, only my father truly mastered it.\n\nIn his youth, Kangjie (Shao Yong) was self-assured in talent, ardent and ambitious. As his learning deepened, he aspired to lofty heights, believing the affairs of the former kings could surely be realized. Yet as his years advanced and his virtue matured, he turned his mind to the sublime and luminous. Observing the movements of Heaven and Earth, the waxing and waning of yin and yang, he grasped the transformations of the myriad things. Thereafter, he yielded in compliance, his spirit vast in return. For thirty years in Luoyang, he dwelt in a thatched hut with walls of woven reeds, barely shielding him from wind and rain, tending the stove himself to care for his parents. Yet he lived with ease, lecturing at home, never forcing his teachings upon others. Still, those who sought his counsel grew daily. The villages and towns were transformed by his influence, and his renown spread near and far. Scholars traveling to Luoyang would bypass the official residences to visit his humble abode.\n\nThe Master’s virtue and qi were pure and unadulterated. In speech, he always grounded himself in benevolence, righteousness, loyalty, and trust. He delighted in extolling others’ virtues but never spoke of their faults. Thus, the worthy rejoiced in his virtue, while even the unworthy were transformed by his influence. His contributions to enriching customs and cultivating talent were immense.\n\nThe Master’s learning came from Li Tingzhi, who received it from Mu Bochang. Tracing its origins, its lineage was long and well-founded. Yet the Master’s learning was pure and untainted, vast and boundless—much of it was his own attainment. Though summoned to office, he declined, responding to his fellow villagers with this poem:\n\n*Through life I’ve done no knitted-brow deeds,*\n*The world should harbor no gnashing teeth.*\n*Why need rain to send off falling blossoms?*\n*Must spring adorn old things anew?*\n*Fortunate to live under Yao and Shun as true sovereigns,*\n*I leave the recluses to their hermitage beyond court.*\n*A sick man of sixty knows his place—*\n*Why trouble the overseers with vain pleas?*",
      "overlap_context": " know of it?\" My father said, \"I do not. I would gladly receive your instruction.\" Tingzhi said, \"Beyond the learning of principle lies the learning of the patterns of things—do you know of it?\" My father said, \"I do not. I would gladly receive your instruction.\" Tingzhi said, \"Beyond the learning of the patterns of things lies the learning of nature and destiny—do you know of it?\" My father said, \"I do not. I would gladly receive your instruction.\" Thereupon, my father transmitted his learning.",
      "start_char": 10700,
      "end_char": 11094,
      "start_sentence": 447,
      "end_sentence": 457,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.61093521118164,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\太华希夷志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "张师正年五十齿已疏摇，后十余年臣黉大载利若刀截尝得药方，叔曰：元亨在天圣中，登岳顶，至明星绾故基下，得断碑，髻鬃有古文，乃治口齿乌髭药方歌一首：猜牙皂角及生姜，西国升麻蜀地黄。 木律旱莲槐角子，细辛荷蒂剪荷叶心子也要相当。 青盐等分同烧毁，研细将来使最良。 揩齿牢牙髭鬓黑，谁知世上有仙方。 此希夷先生之方也。 处士魏野，字仲先，陕州人也。 、居于东郊架草堂，有水竹之胜，好弹琴作诗，清苦多闻於时，前后郡守皆所礼遇。 上祀汾阴，过其庐，遥望魏野松下教鹤舞，真宗曰：寡人须到此中，使报之，将近，魏野搀琴引鹤脸垣而去，驾至山庵不遇，随书於门曰：朕与寇准同来。 后使人召之，辞疾不至。 野以诗赞寇公曰：从前辅相皆频出，独在中书十五秋。 泰岳汾阴俱礼毕，这回好伴赤松游。 公览之，喜形於色，以酒茗药物为答。 《素编》云：先公遗札有公自写此诗数本，旦得诗感悟，以疾屡辞，改柄遂拜太尉、玉清昭应使。 《王文正遗事》：魏野谓寇准曰：自古功名盖世，少有全者。 因与诗曰：好去上天辞富贵，却来平地作神仙。 公及贬，始悔不用野之言。 《温公集言》：野之子名闲，亦不仕，皇佑中赐清逸处士号。 出归田录 太华希夷志卷下竟",
      "translated_text": "Zhang Shizheng’s teeth had grown sparse and loose by age fifty. More than a decade later, Chen Hong recorded in *Dai Li Ruo Dao* that he once obtained a medicinal formula, which his uncle said: \"During the *Tian Sheng* era of the Yuan and Heng reigns, I ascended Mount Hua’s summit and reached the old foundation of the Bright Star Shrine, where I found a broken stele. Its inscription bore an ancient text—a song for a remedy to blacken hair and strengthen teeth:\n\n*Soap pods, ginger fresh, and wild guess,*\n*Shengma from the West, Shu dihuang from the land of Shu.*\n*Mulberry twigs, eclipta, and pagoda-tree fruit,*\n*Asarum, lotus stems, and lotus leaf hearts—all in equal measure.*\n*Burn with green salt in equal parts, then grind to fine powder,*\n*And use it well to firm teeth and darken hair.*\n*Who would know the world holds such an immortal’s formula?*\n\nThis was the formula of Master Xiyi.\n\nThe scholar-recluse Wei Ye, styled Zhongxian, was a native of Shanzhou. He lived in a thatched cottage in the eastern outskirts, where water and bamboo created a scene of refined beauty. Fond of playing the zither and composing poetry, he lived in austere simplicity yet was widely known in his time. The prefects before and after all treated him with respect. When the emperor offered sacrifices at Fenyin and passed his dwelling, he saw Wei Ye from afar beneath the pines, teaching cranes to dance. The True Ancestor said, \"I must visit this place.\" He sent word ahead, but as the imperial carriage drew near, Wei Ye carried his zither and led the cranes over the wall to depart. The emperor arrived at the mountain hermitage but did not find him. He left a note on the door, saying: \"I came with Kou Zhun.\"\n\nLater, an envoy was sent to summon him, but he declined on grounds of illness. Wei Ye wrote a poem in praise of Minister Kou:\n\n*All former ministers came and went in haste,*\n*Yet you alone remained in office for fifteen autumns.*\n*Having completed rites at Mount Tai and Fenyin,*\n*Now you may well accompany Red Pine on his wanderings.*\n\nKou read it and beamed with delight, responding with gifts of wine, tea, and medicinal herbs.\n\n*The Plain Compilation* states: My late father’s letters contained several copies of this poem in Kou’s own hand. At dawn, upon receiving the poem, he was moved to reflection. Though he repeatedly declined due to illness, he was eventually promoted to Grand Commandant and Supervisor of the Jade Purity Luminous Response Abbey.\n\n*Accounts of the Late Wang Wenzheng* records Wei Ye’s words to Kou Zhun: \"Since ancient times, those whose merit and fame shook the world have seldom met a good end.\" He then presented this poem:\n\n*Go well to heaven and renounce wealth and honor,*\n*Then return to the earth to become a divine immortal.*\n\nWhen Kou was later demoted, he regretted not heeding Wei Ye’s advice.\n\n*Collected Works of Master Wen* notes: Wei Ye’s son, named Xian, also declined office. During the *Huang You* era, he was granted the title \"Recluse of Pure Leisure.\"\n\nThus concludes *Records of Mount Hua and Master Xiyi*, Volume Two.",
      "overlap_context": "uch of it was his own attainment. Though summoned to office, he declined, responding to his fellow villagers with this poem:\n\n*Through life I’ve done no knitted-brow deeds,*\n*The world should harbor no gnashing teeth.*\n*Why need rain to send off falling blossoms?*\n*Must spring adorn old things anew?*\n*Fortunate to live under Yao and Shun as true sovereigns,*\n*I leave the recluses to their hermitage beyond court.*\n*A sick man of sixty knows his place—*\n*Why trouble the overseers with vain pleas?*",
      "start_char": 11094,
      "end_char": 11578,
      "start_sentence": 458,
      "end_sentence": 476,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.93800640106201,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\太华希夷志.txt",
        "category": "记传类"
      }
    }
  ]
}