{
  "source_id": "太古土兑经",
  "source_file": "chunked_daozang\\太古土兑经.json",
  "total_chunks": 8,
  "total_original_chars": 8723,
  "total_translated_chars": 44938,
  "total_translation_time": 220.61008548736572,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\太古土兑经.txt",
    "category": "众术类"
  },
  "full_translation": "**The Supreme Ancient Scripture of Earthly Alchemy**\n\n**Scripture Title:** *The Supreme Ancient Scripture of Earthly Alchemy*. The original text does not specify an author, but it likely dates to the Tang dynasty. It comprises three scrolls. The base text is derived from the *Daoist Canon of the Zhengtong Era*, under the category of \"Miscellaneous Arts\" in the *Dongshen* section.\n\n### **Scroll One of *The Supreme Ancient Scripture of Earthly Alchemy***\n\nEarthly alchemy is the essence of Heaven and Earth, the spirit of mountains and rivers. These two entities are either nurtured by yin qi and born of yang qi, or born of yin qi and nurtured by yang qi. Through profound study and deep contemplation, one discerns the causes of transformation. Moreover, gold is born within water and earth, while silver emerges from arsenolite and orpiment. Though their material forms and Dao share similarities, tin and lead differ in nature. When applied to copper and iron, their behaviors diverge, and the outcome depends on human skill and discernment of their tendencies.\n\nThose who study the Dao must first transmute arsenolite, then examine the furnace and fire, thirdly understand the nature of medicinal substances, and fourthly master the methods of refinement and subjugation. Without clarity on these four matters, one’s efforts will be in vain.\n\nGold, silver, copper, iron, and tin are called the Five Metals. Cinnabar, orpiment, realgar, and sulfur are known as the Four Yellows. Cinnabar, mercury, borax, saltpeter, salt, alum, and chalcanthite are termed the Eight Stones. Some yang medicines are subdued by yin, while some yin medicines are controlled by yang. The regulation of qi and timing is like human breath—all follow a measured rhythm.\n\nThose who study the Dao must first regulate their qi, then discuss medicinal substances. When these two support one another, it is called the true Dao. Only those with accumulated merit and past cultivation will encounter divine texts. Guard them in secrecy, and store them deep within a golden casket.\n\n### **The Yellow Sprout Method**\nRealgar, orpiment, arsenolite, red halloysite, hematite, cinnabar, azurite, coptis, phellodendron, and cow dung juice.\n\n### **The Dyeing Method**\nRoasted cinnabar, chalcanthite (all of the above corrode qi), dragon’s blood, luminous cinnabar (preserves color), sulfur (removes tarnish), hemp ash juice, halite, gardenia decoction (for color), millet wine, perilla oil (moistens with mulberry), and floating sea foam (removes impurities). The above are used for yellowing. If employed in elixir-making, adjustments depend on the practitioner.\n\n### **The White Medicine Method**\nCurcuma, poplar resin (enhances luster), gardenia (enhances luster), chalcanthite (removes tarnish), bittern, glue solution, lime, and roasted cinnabar (the above corrode qi and also remove tarnish).\n\n### **Copper Medicines**\nRealgar, orpiment, arsenolite, mirabilite, halite, cinnabar, roasted cinnabar, kaolin, oyster shell, lime, five alums, copper acetate, calcite, azurite, iron essence, powdered boy’s feces, and old cow urine. The above are used for copper, and white medicines are also applied.\n\nThe above medicinal methods are used in the creation of white substances. The body of mercury can enter the Five Metals, and through refinement, it becomes gold powder. Thus, Master Hu Gangzi said:\n\n*\"When gold powder is added, yellow and white may be sought.\nSilver refined with mercury brings no worry.\nCopper refined with mercury transforms in one cycle.\nTin refined with mercury becomes harmonious and thick.\nIron refined with mercury allows the Five Metals to be cultivated.\nGold refined with subdued realgar flows smoothly in all matters.\nSilver refined with subdued realgar has a clear beginning and end.\nCopper refined with subdued realgar harmonizes differing natures.\nTin refined with subdued realgar completes its work.\nIron refined with subdued realgar averts danger.\nGold refined with subdued orpiment is controlled in an instant.\nSilver refined with subdued orpiment transforms without doubt.\nCopper refined with subdued orpiment resolves truth and falsehood.\nTin refined with subdued orpiment naturally holds firm.\nIron refined with subdued orpiment remains inseparable.\nGold refined with subdued arsenolite reveals its gate in the west.\nSilver refined with subdued arsenolite unites without separation.\nCopper refined with subdued arsenolite becomes soft and yielding.\nTin refined with subdued arsenolite forms furrows and ridges.\nIron refined with subdued arsenolite follows hardness and softness.\"*\n\nThe above discusses the Five Metals and the Dao of the Three Yellows entering them. Without the Three Yellows, one cannot speak of their harmonizing natures.\n\nThe Five Metals must be smelted to merge with one another. The marvels of yellow and white, and the additions and subtractions in refinement, reveal their authenticity when understood.\n\n### **The Natures of Yellow, White, Red, and Black, and the Properties of Softness and Hardness**\nGold becomes hollow with silver, silver becomes porous with copper, copper contracts with iron, and iron expands with strength. Contraction yields less liquid, while expansion yields more.\n\nCopper diverges with tin, and tin unites with iron. These are the categories of the Five Metals merging or failing to merge. Only those enlightened in the Dao, skilled in refinement methods, can artfully combine them to produce treasures like jade.\n\nGold is soft yet heavy. When placed in a crucible and fired three hundred times, it resembles ox dung—excellent. Silver requires no more than two hundred firings with charcoal. Copper requires no more than three hundred firings with charcoal. Iron requires no more than five hundred firings, best with coal. Lead has no fixed limit.\n\n*\"Chui\"* (炊) means to blow, as in fanning the flames.\n\nTo transform silver into gold, one may use the dyeing method with subdued realgar. Touching raw mercury also turns it yellow. To introduce raw mercury into silver, first use turmeric root, red halloysite, and perilla oil to decoct the above medicines along with equal parts mercury and silver. After two or three days, it will turn yellow. The mercury can then be drawn out to make vessels. Further medicinal additions are detailed in the middle scroll. The process takes no more than twenty-one days, with adjustments made as needed.\n\nTo transform copper, dye its color and touch it with mercury to achieve a fine white. If introducing raw mercury, decoct it with sal ammoniac, clear glue, poplar resin, chalcanthite, and bittern for three to five days. Then place it in a crucible and fire it, returning it to the previous copper medicine decoction. After four or five repetitions, it becomes authentic. Adjustments depend on the practitioner’s discretion.\n\nIn the above silver medicines, the sovereign and ministers clearly interact. Among the hundred methods for the Five Metals, no more than seven or eight medicines are typically used.\n\nTin is inherently brittle, but when properly refined, it becomes one of the finest methods.\n\nTo subdue tin, use only asbestos, sal ammoniac, aged ox urine, and a decoction of sal ammoniac, subduing it for thirty days. If it remains unsubdued, add bittern and decoct it over a fierce fire until it is subdued—this yields a supreme treasure. Lead cannot be subdued, but if one wishes to do so, use the same medicines as for subduing tin, decocting until it is subdued—both become true treasures. If subdued male lead is introduced, it transforms into authentic yellow.\n\nAmong the Five Metals, this is not yet the great Daoist method. Only when one comprehends the Five Phases and their mutual restraint can one discuss the art of transmutation. Mastery of the Five Phases marks a person of true attainment, with the Three Corpses expelled. Thus, Master Zhang first attained the Dao before expounding these three scrolls of sacred methods, intending them for the salvation of the world and the nurturing of life. Hence, he stated this is not the ultimate great method.\n\nTo subdue mercury and transmute it into gold, first subdue lead. Once lead is subdued, mercury must also be subdued with male lead. With these substances, producing yellow is effortless, requiring no other medicines. Modern practitioners, unable to subdue mercury, resort to various medicines to assist it.\n\nAmong medicines for refining the Five Metals, none surpass subdued cinnabar; next is subdued male and female lead, and the lowest is subdued pyrite. Thus, one part cinnabar counters seven parts male lead, three parts female lead counter one part male lead, and one hundred pounds of pyrite counter one part cinnabar. When male, female, and pyrite are subdued in proper proportions, transformations manifest: silver becomes gold, iron becomes copper, and tin becomes silver. If tin is subdued by fire, it ranks among the finest methods for producing yellow.\n\nMedicines possess the nature of *juhuo*: when burned, if they do not ascend, they are *juhuo*; if they ascend, they are unsubdued. Some mineral medicines, when burned without alteration, exert five times the potency of those that melt. Among herbal medicines, those that are firm and heavy can match three times the potency of mineral medicines.\n\nRegarding *wenfu* (gentle subduing), mercury can stabilize herbs and minerals without requiring a single method of transformation. For *ganfu* (dry subduing), one must understand the nature of medicines and *juhuo*. If it is *juhuo*, it should remain unchanged for the duration of a meal. This is the standard for *juhuo*.\n\nIron can be refined a hundred times: with each refinement and forging, it becomes supple and moist, never scorched. Copper can be refined fifteen times, with each refinement followed by immersion in medicine, allowing up to twenty cycles. If the furnace fire is mastered, it can endure a hundred refinements without scorching; those without such knowledge will scorch it in three to five cycles. Silver can be refined two or three times without losing its inherent nature. Copper-silver alloys must be smelted according to copper’s method. For all true substances, such measures are unnecessary.\n\n**Method for Subduing Mercury to Transform It into White**\n- Mercury: 1 jin\n- Lead from cinnabar: ½ jin\n- Refined iron powder (thirty refinements): ½ jin\n- Tin: ½ jin\n- *Shiguan* (alum): 1 liang\n- Hematite: 1 liang\n- Five alums: 1 liang\n- *Tesheng yushi* (a type of mineral): 1 liang\n- Chalcanthite: 1 liang\n- Salt: 1 jin\n\nMelt the mercury, lead, and tin together, then add the iron powder to the crucible, cover, and heat until the mercury, lead, and tin dissolve. Remove the lid, stir to combine, then extract and grind the medicines into powder. Mix with vinegar to form a paste, place in an iron cylinder, and add the mercury. Seal the mercury with the paste, ensuring the top is firmly packed—if loose, it will burn. Coat with *liuyi* mud (a six-to-one mixture) on all sides, following the proper method. Once dry, place in a double-layered furnace and heat with a gentle fire. When the furnace glows red, seal the opening. Once moisture from the crucible lid’s vent hole dissipates, seal the hole with *liuyi* mud, applying thin layers gradually. Once dry, slightly open the draft door and apply a mild fire for three cycles, then fully open the draft door and apply a fierce fire for four cycles to complete the subduing. This mercury can be used with the Five Metals but is not yet edible.\n\nThis subdued mercury becomes true white sand; externally compounded medicines will revert over time.\n\n**Hu Gangzi’s Method for Subduing Male Lead to Transform Yellow**\n*(The method for subduing female pyrite is the same.)*\n- Realgar: 1 jin\n- White alum: ½ jin\n- *Xuanjing* (selenite): ½ jin\n- Halite: 5 liang\n- Asbestos: 2 jin\n- Mercury: 1 jin\n\nFirst, boil the realgar and mercury in honey water for five cycles. Then, boil in ox knee ash juice for two days. Grind the remaining four medicines into fine powder, sift through silk, and mix with vinegar to form a paste of appropriate consistency. Wrap the realgar in the paste to form cakes, two *cun* wide and one *cun* thick. Once dry, coat again with the paste and dry. Place in a flat-bottomed pan: first spread dry salt powder to a depth of about two *cun*, then arrange the cakes side by side without touching, separating them with salt powder. After layering, cover with an iron lid, seal with *liuyi* mud, leaving a one-*cun* vent. Once dry, place in the furnace and heat gently until moisture dissipates, then seal. First apply three mild fires, then four fierce fires, cooling for one cycle. This subduing method is excellent. If only wet subduing is used, the color will not manifest. This subdued male lead is the finest for producing yellow. Medicines compounded from multiple substances will revert over time.\n\n**Method for Subduing Cinnabar to Reveal Its Treasure**\n- Fine cinnabar: 1 jin\n- Halite: 1 liang\n- Chalcanthite: 1 liang\n- Alum: 1 liang\n- Mirabilite: 1 liang\n\nGrind the above into powder. Wrap the cinnabar in silk and place it in a pan atop the medicines, ensuring it does not touch the bottom. Boil in lard for five days, then in bittern for five days, and finally in vinegar for five days. Mix two jin of dry salt powder with vinegar to form a paste, and coat the cinnabar with vinegar-mixed paste.\n\nThen take the dregs of the medicines and form them into a paste, encasing the cinnabar at its center. Next, apply a layer of salt-clay over the medicinal paste and allow it to dry. Place it in fierce fire and burn for two days—once subdued without fumes, it is successfully refined. If this method is used for subjugation, it may be employed to produce yellow, serve as supreme alchemical cinnabar, or even be consumed as an elixir. Medicines compounded from other substances will revert over time. Wait until the medicine is dry, then heat it with fire, gradually increasing to fierce fire until the surface wrinkles and cracks, revealing its treasure.\n\n**Method for Subduing Fool’s Mercury with Cinnabar**\n- Tin: 5 jin (refined to 1 jin; for each addition of mercury, incorporate lard once to complete the refinement)\n- Mercury: 1 jin\n- White alum: 2 liang\n- Roasted cinnabar: 2 liang\n- Sulfur: 2 liang\n\nGrind finely and boil in vinegar for three to five days.\nFor the \"one white, two fools\" method, use:\n- Red alum: 1 jin\n- Realgar: 0.5 liang\n- Selenspar: 0.5 liang\n- Mirabilite: 2 liang\n\nGrind each separately into powder. Take the tin and mercury, mix with 1 jin of salt, and pound the mercury until it scatters like fish eyes, then it will be subdued into powder. Add more salt frost to a thickness of three to four cun. Spread 2 liang of mirabilite over the salt, then layer the realgar and other medicines, followed by the tin. Press firmly, then cover with the remaining medicinal powder, pressing again to compact. Seal the vessel. Using the method for volatilizing cinnabar—four mild fires and three fierce fires—cool for one cycle, then volatilize again. Grind finely, mix with 1 jin of salt, and pound together with red alum, selenspar, mirabilite, and other medicines. Volatilize once more as before—two mild fires and three fierce fires—cooling for one cycle. Remove and grind into powder. Each liang can transmute one jin into supreme alchemical silver. The tin and mercury are volatilized together. Divide the remaining medicines evenly and volatilize in two batches; the medicines will disperse during the process. To form pills, use 1 liang of jujube pulp. For powders, burn asbestos, mix with clay, and encase the powder. When applying the medicine, first refine the copper. Place three to five pills into the marrow cavity of a sheep’s shin bone and insert it into the crucible, stirring. If the medicine does not emerge, use a peach branch to stir; if it does not disperse, continue stirring evenly.\n\n**Wei Jun’s Five Metals Formula** states: To transmute iron, one must incorporate subdued lead and tin. Medicines compounded from other substances are inferior to those using tin. Take thirty-refined iron and lead extracted from cinnabar to produce tin, then boil with fool’s mercury, adjusting quantities as needed—this will yield silver. If white mercury is obtained, it becomes supreme alchemical silver, though it is unsuitable for consumption.\n\n**The Scripture of the Great Ancient Earth Exchange (Volume One) concludes here.**\n\n**The Scripture of the Great Ancient Earth Exchange (Volume Two)**\nThe five metals are treasures of the world, prized by all. I have observed that those who study the Dao often seek myriad methods, wandering mountains and forests, indulging in leisure, taking delight in such pursuits, and claiming immortality is attainable. Yet true cultivation of the Dao does not lie in retreating to remote places but in profound contemplation to grasp its principles. Within the span of morning and evening, one may harmonize with the light, without reckless pursuit or excessive toil, thus aligning with the supreme Way. Some, upon receiving a single word or method, slander it in unison; others, possessing divine formulas, seek yellow and white alchemy. Initially, their intent was to pursue the Dao in hopes of attaining it, yet they abandon the Way, seeking fleeting gains. While this may bring temporary glory, how can it alleviate the hidden sufferings of the unseen? Countless such cases abound—this esoteric knowledge of the five metals must not be casually transmitted. The subjugation and volatilization of the five metals are the foundation of refining minerals and harmonizing the body’s qi. Here, their secrets are fully expounded. Those who seek the Dao and cultivate their nature may inherit this precious learning. It shall not be imparted to the unworthy. This volume is selected for those of like mind who share a passion for learning.\n\nA few words on gold medicines: A single medicine requires gold. If prepared according to this method, it will suffice. For secondary yellow, if subdued male and female cinnabar are obtained, no gold nature is needed. In the methods of the middle volume, simply add subdued male lead to silver to produce true yellow. If female cinnabar is added, it can also subdue male and female cinnabar. For secondary purple, adding subdued cinnabar to yellow instantly yields supreme purple alchemical silver, though it is inedible.\n\nFor silver medicines, employ the \"three-one\" method: remove impurities, soften, and consume. Following this method will also succeed. For secondary white, if subdued male and female cinnabar are obtained, transmutation will yield true yellow and white. To subdue mercury, use arsenolite powder to form a paste and encase the mercury. First melt the copper, then add the arsenolite-wrapped mercury to the copper—it will turn white. Next, soften it with medicines of silver nature to produce the true substance.\n\nIron’s nature is foremost; it requires subdued tin and lead. Without this method, other compounded medicines may be used, though they are inferior to subdued lead and tin.\n\n**Method for Subduing and Refining Iron**\n- Lead from cinnabar: 5 liang\n- Boiled fool’s mercury: 2.5 liang\n- Cinnabar refined with ox knee: 1 liang\n- Tin refined with ox urine: 3 liang\n- Arsenolite: 1.5 liang\n\nFirst melt the iron, then add the combined lead, tin, and mercury. Stir with a sheep’s shin bone for a long time, then add the cinnabar. After some time, add arsenolite to cover the surface. Heat and forge repeatedly five or six times, then pour into a mold—it will become white. One jin is the limit for refining iron.\n\n**Method for Refining Iron Essence**\nTake 4 liang of raw iron and refine it. Melt it once and quench it in millet wine. Reheat and add a rice-grain-sized amount of cinnabar and 0.5 liang of arsenolite. Stir vigorously for some time, then quench again in wine. Repeat this process thirty times to obtain the essence.\n\n**Method for Refining Iron**\n\nMelt and quench in ox urine fifty times to obtain the essence.\n\n**Method for Subduing Tin**\nTake tin and refine it in fermented milk ten times, then in dark essence ten times. For every jin of tin, use three liang of dark essence. Melt the tin and dark essence powder together in a crucible, stirring vigorously. Then add one liang of raw cinnabar and half a liang of refined iron, covering the surface. Place in the previous nourishing and subduing tin formula, boil with the medicinal ingredients, and it will become fine silver.\n\n**Method for Transmuting Yellow and White with Medicinal Ingredients**\nIf using subdued mercury for white transmutation, it is most excellent. If using raw mercury with silver, take half a jin each of realgar and cinnabar, place in a crucible, add one liang of raw lead, and boil together in wine for one day. Pour out, then add realgar powder and mix with mercury medicinals. Pound together, then boil in millet wine for fifteen days—the mercury will turn yellow.\n\n**Method for Subduing Mercury**\n- Mercury: 1 jin\n- Lead from cinnabar: 10 liang\n\nMelt these two together. Then add:\n- Fine cinnabar: 2 liang\n- True *gen*: 3 liang\n- Dark essence stone: 5 liang\n- Sal ammoniac: 2 liang\n\nCombine the molten lead-mercury with the above medicinals in an iron tube, seal tightly, and heat for thirty days. The subdued mercury may then be used with the five metals to produce true results.\n\n**Method for Subduing Cinnabar** *(same method applies to realgar and orpiment)*\nTake one jin of each. Grind five liang of unrefined nitre into powder, boil with vinegar for five days, then add one jin of white alum and half a liang of dark essence, along with three liang of arsenolite. Combine with the previous medicinals, boil in honey-water for twenty days, then in brine for three days to subdue.\n\n**Method for Subduing White Alum**\nFirst place in a salt crucible, add white alum, and heat together for one day—it will be subdued.\n\n**Method for Subduing Sal Ammoniac** *(same method as for chalcanthite)*\n- Sal ammoniac: 2 jin\n- Dark essence: 2 jin\n- Nitre: 3 liang\n\nGrind into powder, add five *sheng* of brine, and boil for fourteen days—it will be subdued. When the brine evaporates, replenish it.\n\n**Method for Flying Magnetite** *(same method applies to arsenolite, malachite, and azurite; arsenolite is also written as alum)*\nFor every jin of these medicinals, use two liang of mercury. Pound and grind together, then fly for three days and nights. Cool for one day, and it may be used with the five metals. Normally, for one jin of medicinal, use only half a jin.\n\n**Method for Subduing Sulphur**\n- Sulphur: 1 jin\n\nBoil in brine for one day, then place the sulphur in a silk bag. Boil in ox knee ash juice for one day, then in honey-water for one day, then in mulberry ash juice for five days. Boil again in ox knee ash juice for one day, then add half a jin of mercury. Follow the previous method for three three-day cycles to complete. Remove and grind into powder. Take one *sheng* of fine cow’s milk, boil, then add the previously boiled half-jin of mercury, and boil together for three days—it will be subdued. Effective for a hundred uses, and even better for internal consumption.\n\n**Method for Restraining Metal (Geng)**\nTake ten liang of fine mountain *gen* powder, mix with one liang of subdued realgar and orpiment, and grind together. Add one liang of raw mercury and grind until no mercury globules remain. Place in a *gaoche* crucible (a small crucible used in carts, filled with oil or grease). Seal the crucible with Six-One Mud, then nurture with chaff fire for twenty-one days. Gradually increase the fire until red-hot, then allow to cool naturally without removing from the fire. The next day, break the crucible. Grind the contents into a paste, then melt in a crucible until clear. Remove—this is a supreme treasure.\n\n**Alternative Method**\n\n**Method for Refining Sulfur and Mercury**\n\nTake ten *liang* of sulfur, one *jin* of mercury, and four *liang* of cinnabar-lead. Grind them together, place in a new iron crucible, and nurture for forty-five days. Then apply intense fire for two days. Remove when it turns a reddish-purple hue, grind into powder, and add one *liang* each of raw realgar and chalcanthite. Grind finely, mix with cow urine to form a paste resembling a crucible, fill with mercury, and place over fire. When three *liang* of mercury remain, it will naturally transmute into *geng*.\n\n**Essential Secrets from the *Tai Gu Tu Dui Jing***\n\nThe methods of various schools differ in their approaches. For instance, the *Tai Qing Dan Jing* is rarely encountered—its depths elude most. Yet with the jade instructions, even the worthy like the Yellow Emperor and the Prince of Huainan abandoned their thrones in pursuit of truth. Lord Mao and Yin Xi attained the Dao and forgot worldly schemes. The *Fox Manifestation’s Powdered Charts* were passed down in three scrolls, while Master Zhang’s *Metal and Stone* was bestowed in five chapters. The mysteries of nurturing life begin with understanding *qi* and seasons. Master Tao’s discourse on medicinal properties lacked clarity on the sovereign and minister. Once this origin is grasped, the essential subtleties become known.\n\nThe confusion among schools arises thus: some expound on medicinal properties but fail to comprehend refinement; others understand refinement but not ingestion; still others grasp furnace and fire yet remain ignorant of hardness and softness in substance. If these secrets are mastered, nothing will prove discordant. Here, the arcane essentials of various classics are revealed—guard them well.\n\n**Method for Transmuting Cinnabar into Yellow and White (for Ingestion)**\n\nTake one *jin* of cinnabar-sulfur, three *liang* of magnetite, five *liang* of yellow lead, and five *liang* of cinnabar-lead. Prepare the mineral medicines, then add three *liang* each of white alum and arsenolite, and grind into powder. Combine the aforementioned lead, yellow lead, magnetite, and cinnabar-sulfur, and boil together for seven days until white. Next, take three *liang* each of rock salt from Yanzhou, Glauber’s salt from Guazhou, arsenolite from Songshan, and cinnabar from Beiting. Boil these with the white mercury and magnetite in vinegar for two days, then remove—this is called *liuzhu* (sulfur-cinnabar). Mercury flows like pearls, and though the name differs, the substance is the same. Add this to cinnabar-lead to form an ingot. Crush it, boil in lard for thirty days to subdue it. If it remains hard, add two *liang* of true *gen* and boil again in lard—it will be subdued. When added to the five metals, mix with saltpeter powder and realgar, then refine into cinnabar for ingestion to prolong life.\n\nThe method: First melt mercury powder, cover with salt, and refine with fire—two days of gentle fire, two days of fierce fire, then cool for one day before removing. Add five *liang* of realgar—this completes the *geng*. In the *Tai Qing Dan Jing*, the first method is for transmuting the five metals, while the second is fit for ingestion. The jade instructions clarify: refine with realgar for three more days, alternating gentle and fierce fire—it will become frost.\n\n**Lord Mao’s Method for Subduing Mercury**\n\nTake one *jin* of mercury, three *liang* of selenite, two *liang* each of the five alums, three *liang* of Glauber’s salt, three *liang* of halite, five *liang* of yellow lead, five *liang* of gold-tooth mineral, and three *liang* of cinnabar. Grind all into powder, then boil the mercury and medicines in an iron crucible with good vinegar, maintaining a simmer like fish eyes. Replenish the vinegar as it evaporates, adding gradually over five days. After twenty days of boiling with the medicines, the mercury will be subdued and ready for use with the five metals.\n\n**Fox Manifestation’s *Mysterious Pearl* Method** *(This method is absent in the *Wu* text)*\n\nTake one *jin* of *xuanzhu* (mysterious pearl), five *liang* of unrefined lead powder, and two *liang* each of true *gen* and selenite. First melt the lead in a vessel, then add the *xuanzhu* and mix. Melt the *gen* and mercury separately, then combine with selenite. Grind one hundred times, boil in vinegar for thirty days, then remove. If not subdued, add one *he* of *heche* (human placenta) to ensure subjugation. Next, take two *liang* of iron essence powder, mix with four *liang* of tin, and stir together. Grind into powder, add to the previous mercury, and boil for five days—it will be subdued.\n\n**Method for Subduing Realgar** *(Applies also to orpiment and cinnabar)*\n\nTake one *jin* of realgar, three *liang* of chalcanthite, one *jin* of white alum, five *liang* of selenite, and three *liang* of asbestos. Grind all into powder. Break the realgar into wheat-grain-sized pieces, place in a silk bag, and boil in vinegar with the other medicinal powders for twenty days. Remove, mix the realgar with vinegar, and shape into cakes. Use the boiled medicinal residue as mud to wrap the realgar cakes. Place in a salt cauldron and fire for ten days—this subdues it well, similar to subduing the five metals. It may be used interchangeably with them.\n\n**Method for *Xuanhuang* Ointment**\n\nUse subdued mercury, subdued realgar, subdued orpiment, subdued cinnabar, and subdued malachite. After refining each three times, further refine with water and wine. Use processed *fu ling* from Shangdang, ginseng, and pine resin; boil with ash water from mulberry firewood, coptis, and honey; and harden with apricot kernels. Boil in water for seven days, replenishing with warm water as needed. This is the method.\n\nAlternatively, combine the subdued medicines with raw medicines: for every two *sheng* of honey, use half a *jin* each of herbal and mineral medicines. Avoid excessive fire, which blackens the medicine. Apply gentle heat and refine for fifteen days, stirring with a dry willow stick until it forms a paste. Grind all medicines into powder and place in a cauldron. If the honey is exhausted, add more. After the allotted days, take one spoonful on an empty stomach with wine—after a hundred days, one becomes an immortal. Avoid the five pungent foods, the meat of the twelve animals, and unclean places.\n\nFor transmuting into gold, add half a spoonful of this ointment to one *jin* of mercury—it will become superior gold, also fit for ingestion. Place mercury in a green bamboo tube without a lid, boil continuously with vinegar for four days and nights until the black smoke dissipates, then remove and shape into cakes.\n\nWhen introduced to fire, this ointment subjugates mercuric frost. By refining this paste, both mercury and its male-female forms are stabilized.\n\n**Coptis and Apricot Kernel Ointment**\nGrind equal parts coptis, apricot kernels, and black soybeans into powder. Mix with one *sheng* of honey and half a *jin* of each medicine. Refine over gentle fire for fifteen days, following the previous method. Take one spoonful with wine on an empty stomach. It may also be used for transmutation, possessing wondrous alchemical properties.\n\n**Verse:**\nReturn my two pastes,\nSpare me divine toil.\nDestroy my two pastes,\nCondemn me to celestial courts.\n\nThe Greater and Lesser Elixirs, with their transmutative power, share a single principle—thus, no further elaboration is needed.\n\n**The Great Elixir**\nWhen mercury is subjugated, the eight minerals are likewise subdued. Knowing the roles of sovereign and minister, and refining with intent, one follows ancient methods with minor variations. Though schools differ in number, success lies in careful adjustment—thus, the Reverted Elixir is achieved.\n\n**Verse:**\nWith three reversions at home,\nHeaven and earth resound in glory.\nIf refining one mineral,\nTwo persons craft the wondrous elixir,\nWhich also bears transmutative power.\n\nPerusing these three volumes of sacred methods, one may, through thoughtful adaptation, produce gold and silver.\n\n**The Thirty-Six Waters of the Great Elixir**\nWith saltpeter alone, nothing is unattainable.\n\n**Mica Water Method**\nCombine one *jin* of mica, half a *sheng* of scallion juice, half a *sheng* of honey, and half a *jin* of cassia juice. Seal the mixture in a bamboo tube with lacquer, bury it for seven days, and it will liquefy. If not fully dissolved, steam for one more day, then suspend it in a well—it will transform into water.\n\n**Jade Water Method**\nGrind one *jin* of jade and one *fen* of magnetite into powder, then mix with one *fen* of cloud liquid. Seal and bury for ten days as before to form water.\n\n**Stabilizing Male-Female Elixir Liquid**\nFor each *sheng* of mica, blend one *jin* of saltpeter with one *jin* each of male and female mercury powder. Seal and bury following the above method to produce elixir liquid.\n\n**Purple Oil Elixir Method**\nCombine one *jin* each of mercury and male mercury. Grind and knead them together, wrap in dough, and steam with millet. Replace the mixture in the crucible three times daily for one day. Then grind the mercury three times, place it in a copper vessel with half a *jin* of saltpeter, and bury it for ten days. Add another *jin* of saltpeter, boil in a double boiler for four days—it will become a paste. To refine it into Purple Oil Elixir, grind with mercury, place in a copper vessel, and heat gently for three days and nights until the color subtly shifts. Then increase the fire for nine days and nights; though the hue changes frequently, do not be alarmed. On the ninth day, it will turn purple. After stabilizing it for a full day, heat it intensely for six days and nights—it will blaze crimson, signaling completion. When used to transmute lead, it yields a lustrous, five-colored metal.\n\n**Fire-Subduing Purple Powder Method**\nCombine one *jin* of mercury with half a *jin* of sulfur. Refine using the method for subjugating minerals, then skim off the resulting purple powder. It may also be heated in an iron bowl until smoke dissipates before use.\n\n**Purple Oil Elixir’s Subjugation of Mercury**\nAfter extracting lead essence, place two to three *liang* of raw mercury in a crucible with a small amount of ash. Add Purple Oil Elixir mixed with lead and tin powder, cover with more ash, and place in an ash furnace. Heat five times, lifting and lowering the crucible, then finally heat until the crucible glows red. Pour onto the ground—it will become gold.\n\n**Iron Powder Water Method**\nFile iron into powder, soak in black cow’s urine overnight, then layer in an earthen vessel with emblic myrobalan powder—thirty-one layers in total. Seal tightly and bury in the northern shade of a house for twenty-one days to complete.\n\n**Refining Lead Bloom Method**\nMelt one hundred *jin* of lead in an iron furnace, stirring constantly with an iron spoon as in the yellow lead method. Each hundred *jin* yields ten *jin* of bloom.\n\n**Transmuting White into Yellow Method**\nPlace dried mercury in a Gong County crucible, mix with fire-subdued male and female yellow, and seal. Coat with medicinal mud in three layers, then refine with gentle and strong fire for twenty-one days. When the fire’s color stabilizes, the yellow will be complete.\n\n**Purple Mud Method**\nCombine one *jin* each of yellow lead and realgar with five *sheng* of vinegar. Soak the medicines briefly, then sun-dry. Repeat until the vinegar is fully absorbed. Place in a crucible and heat with gentle fire until the color turns red—stop then. If the fire turns white, its potency is lost. If it becomes ashen, it is unusable.\n\n**Gold Powder Method**\nMelt one *liang* of *dui* with five *liang* of mercury. Grind with three *liang* of *diwei* into a paste, place in a crucible, and refine. Wash away the *diwei* and grind the residue into powder for use.\n\n**Refining Yellow Washing Powder Method**\nCombine one *jin* each of *diwei* and yellow fat with one lump of bloom powder. Mix with one *sheng* of coarse ash and refine over fire for ten days to complete.\n\n**Excerpts on Minerals and Metals**\nClarifying Sovereign and Minister.\n\nLead and mercury serve as the sovereign and minister of minerals and metals. Lead acts as the sovereign, governing the five viscera, while mercury acts as the minister, expelling the Three Corpses. Azurite serves as the messenger, brightening the eyes. Cinnabar acts as the general, subduing the four barbarians. Refining these four divine medicines and ingesting them grants longevity.\n\n**On Ascension and Subjugation**\nThere exists yin ascension, yang subjugation, yang ascension, and yin subjugation. Lead can restrain mercury, hence \"yin subjugates yang.\" Mercury can subdue lead, hence \"yang restrains yin.\" One *liang* of sulfur can subjugate five *liang* of mercury—this is yang subjugating yang. Thus, it is known that mercury’s power is not equal to lead’s. When sulfur enters mercury, it is called ascension; when lead is added to mercury, it is called subjugation.\n\n**On Yin and Yang**\nThat which ascends is yang; that which restrains is yin. Ascension that becomes subjugation reverts to yin. Subjugation that becomes ascension returns to yang. When yang is subjugated and ascends, yin reaches its extreme and yang is born. When yin ascends and is subjugated, yang reaches its extreme and yin is born. To subjugate minerals and metals, one yin and one yang must harmonize. To subjugate yang with yang or yin with yin will never succeed. When sulfur and mercury form frost, blend it with one *liang* of nine-times-refined lead essence and ascend it again. Ingesting one *daogui* transforms a person. Adding raw mercury to lead and ascending it for nine days produces frost, which must settle upon the subjugation vessel. Each *liang* transforms into a *jin* of treasure, and ingestion prolongs life.\n\n**On Hardness and Softness**\nWhen lead is added to mercury, it becomes hard; when mercury is added to lead, it becomes soft. Though mercury is soft, when combined, hardness and softness subjugate each other. Mercury and lead can soften the nature of hardness and the properties of other substances. When softness is attained, it becomes hard; when hardness is attained, it becomes soft. Without lead and mercury, the transmutation of the five metals will never succeed.\n\n**On Floating and Sinking**\nGold is heavy and sinks; minerals are light and float. When ingested, they paradoxically ascend, and when gold is obtained and fused, it cannot float. Thus, it is said that one mineral can pierce one gold—this is also called the name of *huandan*.\n\n**On Resemblance**\nLead and realgar share kinship, both deriving from the class of metals. Cinnabar and realgar resemble *paosha*; without *paosha*, their color does not manifest. Lead is the sovereign of metals, and realgar is the sovereign of minerals; thus, lead can transform minerals and metals. Without realgar and lead, transmutation will never be wondrous. Without the four yellows to catalyze transmutation, it will also never succeed. Cinnabar can also subjugate and transform the five metals and eight minerals, appearing in honey water like a mother. When sulfur is properly subjugated, its original color remains unchanged, yet it can transform and dye minerals and metals. It can be melted with magnetite into a liquid, resembling *shitingzhi*; *pi* resembles *shinao*; it solidifies instantly and does not ascend. Cinnabar resembles fermented wine; lead resembles mulberry ash; tin resembles *mituoseng*; azurite resembles *daizhe*. In discussing resemblance, when yin and yang harmonize, transformation proceeds smoothly.\n\n**On Incompatibility**\nGold detests mercury; silver detests raw iron and *paosha*. Gold is weakened by silver; silver is loosened by copper; copper is strengthened by iron but ruined by tin. The five metals and eight minerals all detest *yuganzi* and *daizhe buhuimu*, which can dissolve all metals and minerals into water. Without saltpeter, transmutation will never succeed. When lead, mercury, cinnabar, realgar, and all fire-subjugated minerals and metals are tested by fire, if the fire does not move them, if they do not flow when fanned, and if their color lacks luster, they cannot transform other metals and minerals.\n\n**On Nature and Spirit**\nCinnabar is the essence of the Great Yang, the child of the sun, and possesses generative power. It can cause all metals and minerals to ascend. Without mercury, none can ascend; with *daohang shengu*, they ascend together instantly. Use chalcanthite, yellow vitriol, and white vitriol as messengers; gold and silver as the mother; azurite as the general; and the four yellows as the sovereign. Among the four yellows, none surpasses realgar. Among the three blues, none surpasses azurite. Realgar communicates with the divine; azurite brightens the eyes. The finest method involves steaming the three flowers of *dajiezi*; next, boiling it with lard, which also moistens it, is wondrous. Avoid cold and heat clashing, as this can reduce it to powder.\n\nThe finest cinnabar, when placed with red *guan* and yellow salt, covered and nurtured in a ceramic vessel over fire for ten days, is called *lizhi shenfen*. It can transmute mercury into *zigeng*, soften the five minerals into soft gold, and is also called divine and wondrous. It can further transmute superior *geng* to solidify the spirit. Sulfur, when combined with Tibetan purple vitriol, instantly transmutes mercury into gold. Persian red salt does the same. Without other medicines, both yield supreme treasures.\n\nTo create *geng*, first refine lead and subjugate realgar and mercury, then subjugate the four yellows. Subjugating just realgar and mercury suffices to produce true treasure. Without other medicines, blending these two and combining them like earth and gold, covering them with yellow and red salts, and refining them with clear, gentle fire for fifty days yields *ziguang dan*, which can transmute the five metals. To transmute silver, use azurite and *daizhe*. Subjugating *jingong* can be swiftly achieved with *feishuang tang*; combining *shitingzhi* and *dinüxue* with mercury and silver sand, then nurturing with fire for a hundred days, produces *geng*. Boiling one *jin* each of *huangtong* and *dinü* into a liquid for thirty days preserves their nature. This can also subjugate mercury. When mercury is born of sulfur and refined with the six spirits, it becomes red frost.\n\nFor impure metals, adding *paosha* reveals their authenticity and equalizes their color. *Qilinjie* can also fix color. Millet wine softens; gardenia dyes; *yuganzi* purifies impurities; *daizhe* enhances color and beauty; yellow vitriol can dye all metals, minerals, and cinnabar. When *touzhi* is added a thousand times, it becomes silver, soft as mud. Ingesting it prolongs life, greatly strengthens sinews and bones. Cinnabar refined with *paosha* becomes pure.\n\nRefined Silver Mercury—Lead undergoes nine transformations, while mercury is called the sevenfold return. When combined and boiled with *qiang*, after sixty days it becomes like dust, then sublimated like molten silver, forming the cyclically returning elixir. It can enter the five metals, preserve youthful complexion, slay the Three Corpses, expel the Nine Worms, harden its nature, and soften its substance. When lead and mercury are conjoined, their body becomes hard; when entering the five metals, their nature turns supple. It can subdue gold and lead, and react with mercury and lead. When lead and mercury merge, it is also called the sevenfold return. If sulfur is added and sublimated, it becomes the ninefold lead. When refined nine times with *qiang*, it is also called the nine-five-seven return. Use three *sheng* of *huachi*. Two *sheng* of grass and wood ash, repeatedly leached five times, then decocted for a day. After boiling with *caizhi* for three days, pour it out, then boil it in soapberry ash liquid until purified—only then can it be used.\n\nLuminous Yellow Sprout—Take the ninefold lead and sevenfold return, combine and sublimate them seven times to form subdued frost, then gather the frost and mix it with *hua*, kneading it into moistened balls. Place them in a three-tiered crucible and smelt them until they resemble silver, though hard and unable to withstand fire. They can enter the five metals but are not yet fit for ingestion. Smelt them seven more times, then refine them with *ziming* until silver, lead, and mercury merge and become fire-subdued—this is called medicinal lead. Further refine this medicinal lead in an underground crucible to produce the yellow sprout. Grind this yellow sprout with raw mercury and sublimate it: the portion that rises is called *Light Ascension*, while the portion that does not rise is called *Water Mother*. The rising portion clings to its mother, thus remaining above; the non-rising portion is the mother clinging to its child, hence the division into upper and lower sublimates. Without distinguishing their use, they are applied alike.\n\n*Tai Gu Tu Dui Jing*, Scroll the Lower, concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太古土兑经 经名：太古土兑经。 原不题撰人，约出於唐代。 三卷。 底本出处：《正统道藏》洞神部众术类。 太古土兑经卷上 土兑者，天地之精，山川之灵。 此二体者，或阴气所养，阳气所生。 或阴气所生，阳气所养。 研精覃思，乃变化之由，且金生水土之中，银产铆石之内，据其质体道颇同，其锡与铅本性各异，施於铜铁，行止道殊，事在人情，察其去就。 学道之士，先变铆石，次审炉火，三明药性，四达制伏。 不晓四事，徒劳神思。 金银铜铁锡，谓之五金。 雌雄硫毗，名曰四黄。 朱汞鹏袖硝盐矾胆，命云八石。 或阳药阴伏，或阴药阳制，明达气侯，如人呼吸，皆有节度。 学道之人，先调气，次论药物，二者相扶，是日道真。 宿习积庆，方遇神文，保秘勿泄，深藏金匮云耳。 黄芽术 雄黄　雌黄　础黄　赤石脂　代赭石　丹砂　曾青　黄莲　黄蘗　牛粪汁 染药术 炮砂　石胆已上皆俱蚀气　麒麟竭　光明砂驻颜色　硫黄去晕　麻灰汁　戎盐　栀子煎汁色　黍米酒　紫苏油桑润　浮海末去诸恶，已上是入黄，若用为丹，添减在人 白药术 蔚金　胡桐律润色　栀子润色　石胆去晕　盐卤　胶清　石灰　炮砂已上蚀气亦去晕 铜药 雄黄　雌黄　毗黄　朴硝　戎盐　丹砂　炮砂　白石脂　牡蛎　石灰　五矾　铜黄　凝水石　曾青　铁精并末童子粪老牛尿已上入铜外，及白并用之 右如此药法，是作白中用药。 夫水银之体，能入五金，以伏炼成金粉。 故狐刚子日：金粉相投，黄白可求。 银得伏汞，所作无忧。 铜得伏汞，不过一周。 锡得伏汞，其性和稠。 铁得伏汞，五金可修。 金得伏雄，万事流通。 银得伏雄，叉有始终。 铜得伏雄，异性和同。 锡得伏雄，毕了其功。 铁得伏雄，能去危凶。 金得伏雌，制之一时。 银得伏雌，变转无疑。 铜得伏雌，成真是非。 锡得伏雌，自合坚持。 铁得伏雌，自合无离。 金得伏毗，变见门西，银得伏毗，有合无睽。 铜得伏毗，柔弱自低。 锡得伏毗，有畎成畦。 铁得伏毗，刚柔自随。 右件前五金，皆论三黄相入之道，若中不得三黄，未可论其调和之性也。 夫五金之物，须炼治而自相入，添喊之衍，黄白之妙，以此明之，铃见真伪。 黄白赤黑，柔坚之性，具件如左。 金得银而虚，银得铜而疏，铜得铁而缩，铁得强而舒，缩为汁少，舒为汁多。 铜得锡而殊，锡得铁而俱。 右此是五金相入，与不相入之类。 但有明道之士，闲制伏之方，即巧以相入，亦得成於玉宝矣。 金性柔而实重，入锅与火同色炊三百下，丑粪妙。 银不过二百下，木炭。 铜不过三百下，木炭。 铁不过五百下，石炭乃妙铅不在下限。 炊音吹，鼓也。 若以银变为金，以色染之法可伏雄，点生汞亦为黄矣。 若将生汞入银，先用蔚金根、赤石脂，紫苏油煎上件药，及汞银之等，三二日爻成黄色，其物抽汞，可作器。 须更入诸药，具在中卷。 不过二十一日，以意消息。 夫变铜，以色染之，以汞点之，亦得白妙。 若以生汞入之，莫过石脑、清胶、同律、石胆、盐卤汁中煎三五日，然后入锅鼓之，还入前煎者铜药汁中，不过四五度，成其真矣，消息任隐顷。 上件银药中，君臣相使明了。 五金百法，百中不过七八味之药矣。 夫锡性烂，能制伏得之者，亦为上法之中最佳也。",
      "translated_text": "**The Supreme Ancient Scripture of Earthly Alchemy**\n\n**Scripture Title:** *The Supreme Ancient Scripture of Earthly Alchemy*. The original text does not specify an author, but it likely dates to the Tang dynasty. It comprises three scrolls. The base text is derived from the *Daoist Canon of the Zhengtong Era*, under the category of \"Miscellaneous Arts\" in the *Dongshen* section.\n\n### **Scroll One of *The Supreme Ancient Scripture of Earthly Alchemy***\n\nEarthly alchemy is the essence of Heaven and Earth, the spirit of mountains and rivers. These two entities are either nurtured by yin qi and born of yang qi, or born of yin qi and nurtured by yang qi. Through profound study and deep contemplation, one discerns the causes of transformation. Moreover, gold is born within water and earth, while silver emerges from arsenolite and orpiment. Though their material forms and Dao share similarities, tin and lead differ in nature. When applied to copper and iron, their behaviors diverge, and the outcome depends on human skill and discernment of their tendencies.\n\nThose who study the Dao must first transmute arsenolite, then examine the furnace and fire, thirdly understand the nature of medicinal substances, and fourthly master the methods of refinement and subjugation. Without clarity on these four matters, one’s efforts will be in vain.\n\nGold, silver, copper, iron, and tin are called the Five Metals. Cinnabar, orpiment, realgar, and sulfur are known as the Four Yellows. Cinnabar, mercury, borax, saltpeter, salt, alum, and chalcanthite are termed the Eight Stones. Some yang medicines are subdued by yin, while some yin medicines are controlled by yang. The regulation of qi and timing is like human breath—all follow a measured rhythm.\n\nThose who study the Dao must first regulate their qi, then discuss medicinal substances. When these two support one another, it is called the true Dao. Only those with accumulated merit and past cultivation will encounter divine texts. Guard them in secrecy, and store them deep within a golden casket.\n\n### **The Yellow Sprout Method**\nRealgar, orpiment, arsenolite, red halloysite, hematite, cinnabar, azurite, coptis, phellodendron, and cow dung juice.\n\n### **The Dyeing Method**\nRoasted cinnabar, chalcanthite (all of the above corrode qi), dragon’s blood, luminous cinnabar (preserves color), sulfur (removes tarnish), hemp ash juice, halite, gardenia decoction (for color), millet wine, perilla oil (moistens with mulberry), and floating sea foam (removes impurities). The above are used for yellowing. If employed in elixir-making, adjustments depend on the practitioner.\n\n### **The White Medicine Method**\nCurcuma, poplar resin (enhances luster), gardenia (enhances luster), chalcanthite (removes tarnish), bittern, glue solution, lime, and roasted cinnabar (the above corrode qi and also remove tarnish).\n\n### **Copper Medicines**\nRealgar, orpiment, arsenolite, mirabilite, halite, cinnabar, roasted cinnabar, kaolin, oyster shell, lime, five alums, copper acetate, calcite, azurite, iron essence, powdered boy’s feces, and old cow urine. The above are used for copper, and white medicines are also applied.\n\nThe above medicinal methods are used in the creation of white substances. The body of mercury can enter the Five Metals, and through refinement, it becomes gold powder. Thus, Master Hu Gangzi said:\n\n*\"When gold powder is added, yellow and white may be sought.\nSilver refined with mercury brings no worry.\nCopper refined with mercury transforms in one cycle.\nTin refined with mercury becomes harmonious and thick.\nIron refined with mercury allows the Five Metals to be cultivated.\nGold refined with subdued realgar flows smoothly in all matters.\nSilver refined with subdued realgar has a clear beginning and end.\nCopper refined with subdued realgar harmonizes differing natures.\nTin refined with subdued realgar completes its work.\nIron refined with subdued realgar averts danger.\nGold refined with subdued orpiment is controlled in an instant.\nSilver refined with subdued orpiment transforms without doubt.\nCopper refined with subdued orpiment resolves truth and falsehood.\nTin refined with subdued orpiment naturally holds firm.\nIron refined with subdued orpiment remains inseparable.\nGold refined with subdued arsenolite reveals its gate in the west.\nSilver refined with subdued arsenolite unites without separation.\nCopper refined with subdued arsenolite becomes soft and yielding.\nTin refined with subdued arsenolite forms furrows and ridges.\nIron refined with subdued arsenolite follows hardness and softness.\"*\n\nThe above discusses the Five Metals and the Dao of the Three Yellows entering them. Without the Three Yellows, one cannot speak of their harmonizing natures.\n\nThe Five Metals must be smelted to merge with one another. The marvels of yellow and white, and the additions and subtractions in refinement, reveal their authenticity when understood.\n\n### **The Natures of Yellow, White, Red, and Black, and the Properties of Softness and Hardness**\nGold becomes hollow with silver, silver becomes porous with copper, copper contracts with iron, and iron expands with strength. Contraction yields less liquid, while expansion yields more.\n\nCopper diverges with tin, and tin unites with iron. These are the categories of the Five Metals merging or failing to merge. Only those enlightened in the Dao, skilled in refinement methods, can artfully combine them to produce treasures like jade.\n\nGold is soft yet heavy. When placed in a crucible and fired three hundred times, it resembles ox dung—excellent. Silver requires no more than two hundred firings with charcoal. Copper requires no more than three hundred firings with charcoal. Iron requires no more than five hundred firings, best with coal. Lead has no fixed limit.\n\n*\"Chui\"* (炊) means to blow, as in fanning the flames.\n\nTo transform silver into gold, one may use the dyeing method with subdued realgar. Touching raw mercury also turns it yellow. To introduce raw mercury into silver, first use turmeric root, red halloysite, and perilla oil to decoct the above medicines along with equal parts mercury and silver. After two or three days, it will turn yellow. The mercury can then be drawn out to make vessels. Further medicinal additions are detailed in the middle scroll. The process takes no more than twenty-one days, with adjustments made as needed.\n\nTo transform copper, dye its color and touch it with mercury to achieve a fine white. If introducing raw mercury, decoct it with sal ammoniac, clear glue, poplar resin, chalcanthite, and bittern for three to five days. Then place it in a crucible and fire it, returning it to the previous copper medicine decoction. After four or five repetitions, it becomes authentic. Adjustments depend on the practitioner’s discretion.\n\nIn the above silver medicines, the sovereign and ministers clearly interact. Among the hundred methods for the Five Metals, no more than seven or eight medicines are typically used.\n\nTin is inherently brittle, but when properly refined, it becomes one of the finest methods.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1288,
      "start_sentence": 0,
      "end_sentence": 67,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.20707035064697,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\太古土兑经.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "夫伏锡不过不灰木、石脑、老牛溺、石脑煎之，三十日的伏。 如未伏，更加卤汁，猛火煎之，铃得伏之，可为至宝。 夫铅不可伏，若欲伏之，不过前伏锡药也，煎而得伏之，皆真宝也。 若将伏雄入之，即成真黄矣。 夫论五金，未是真道大法。 若明达五行，次论制伏，乃可与言点化之道，五行尽晓，乃是正真之人，三尸外出。 故张先生先得道，而后论此三卷圣法，以为济世养生之衍，故言非正真大法。 若欲伏汞作金，先且伏铅。 铅伏而汞炬亦须伏雄。 但得此物，作黄不难，无劳诸药为。 时人伏汞不得，乃以诸药助之。 夫五金成色之药，莫越伏朱，其次伏雄雌，最下伏毗。 故朱一分敌雄七分，雌三分敌雄一分，毗一斤敌朱一分。 若得雌雄毗依倍加之变见，皆以银为金，铁为铜，锡为银。 若得锡伏火，为黄中之上法。 夫药有炬火，烧之不飞上谓之炬火，飞上谓之不伏。 又石药几烧而不变动者，一两可敌烧而化药五倍之力。 若草木之药坚实而重者，亦一两可敌石药三倍。 若言温伏，汞可安草石药等，不在无姻变用一种。 若言乾伏，须明药性，知炬火，若是炬火，须是一食久不变。 如一为炬火。 夫铁物炼之可百遍，其物一炼一打，亦柔润不焦。 铜物可炼十五裒，一炼一入药中，亦可二十度。 如明了炉火，可百遍不焦。 不可知者，三五度即焦。 银可炼三两度，不失变常性。 若是铜银，亦须依铜法销炼，如是诸真者不假如此。 伏汞法变白 汞一斤　丹中铅半斤　铁精半斤，三十炼者　锡半斤　石盥一两　代赭　五矾　特生誉石　石胆已上各一两　盐一斤 右取汞及铅锡和镕了，然将铁精粉入锅，着盖洋了，即消汞铅锡等，投孔子讫，即去盖搅之，令相得。 即取出，以捣药作末，和苦酒为泥，置铁筒中。 即入前汞於筒，还以药泥泥，汞上入药，泥头坚实，按之不得宽，．宽即烧着，盖以六一泥，四向上下如法。 泥乾了，即入两重炉中，着微火烧，其炉微剥，赤色热彻，即闭封门，候锅盖孔子中湿气尽，即以六一泥泥孔，细心旋旋薄泥。 泥乾更上，不得一向厚泥。 泥乾了，即微关受门，着文火三周，须尽开风门，武火四周，爻伏也。 将此汞入五金俱得，唯未中所食用。 此伏汞为真白砂，自外药成者，久而还变。 狐刚子伏雄法 变黄雌毗，同上法。 一本无狐冈子字。 雄黄一斤　白矾半斤　玄精半斤　石盐五两　不灰木二斤　汞一斤 右以蜜水，煮雄汞五周。 次入牛膝灰汁，煮二日了。 将前件四味药捣为末，下绢筛令细，苦酒和为泥，令硬软得所。 即下雄黄裹为饼，阔二寸，厚一寸，待乾。 即更将前件药泥，重裹乾了，即入平底铛中。 入铛法先以乾盐末布之，令厚实可二寸许。 次下饼子，侧累之，不得相合，中问亦以盐末隔之。 每安一重饼子，更安一重盐末了，更即着铁盖蜜固济，着六一泥封之，留一寸许地泄气。 乾泥了，入炉，着微火烧，湿气尽即泥，却先三文，后四武，寒一周。 此伏法最佳。 单湿伏即无色。 若将此伏雄入，为黄用法中最佳。 若用众药合成者，久而还变。 伏丹砂法见宝 好丹砂一斤　戎盐　石胆　矾石　朴硝已上各一两为末 右取丹砂，甩绵裹了，先布诸药於铛中，上安砂裹，勿令着底。 将猪脂煮五日，即入卤汁中煮五日，又入醋中煮五日，即取乾盐末二斤，和苦酒为泥，沙亦以苦酒拌和好泥。",
      "translated_text": "To subdue tin, use only asbestos, sal ammoniac, aged ox urine, and a decoction of sal ammoniac, subduing it for thirty days. If it remains unsubdued, add bittern and decoct it over a fierce fire until it is subdued—this yields a supreme treasure. Lead cannot be subdued, but if one wishes to do so, use the same medicines as for subduing tin, decocting until it is subdued—both become true treasures. If subdued male lead is introduced, it transforms into authentic yellow.\n\nAmong the Five Metals, this is not yet the great Daoist method. Only when one comprehends the Five Phases and their mutual restraint can one discuss the art of transmutation. Mastery of the Five Phases marks a person of true attainment, with the Three Corpses expelled. Thus, Master Zhang first attained the Dao before expounding these three scrolls of sacred methods, intending them for the salvation of the world and the nurturing of life. Hence, he stated this is not the ultimate great method.\n\nTo subdue mercury and transmute it into gold, first subdue lead. Once lead is subdued, mercury must also be subdued with male lead. With these substances, producing yellow is effortless, requiring no other medicines. Modern practitioners, unable to subdue mercury, resort to various medicines to assist it.\n\nAmong medicines for refining the Five Metals, none surpass subdued cinnabar; next is subdued male and female lead, and the lowest is subdued pyrite. Thus, one part cinnabar counters seven parts male lead, three parts female lead counter one part male lead, and one hundred pounds of pyrite counter one part cinnabar. When male, female, and pyrite are subdued in proper proportions, transformations manifest: silver becomes gold, iron becomes copper, and tin becomes silver. If tin is subdued by fire, it ranks among the finest methods for producing yellow.\n\nMedicines possess the nature of *juhuo*: when burned, if they do not ascend, they are *juhuo*; if they ascend, they are unsubdued. Some mineral medicines, when burned without alteration, exert five times the potency of those that melt. Among herbal medicines, those that are firm and heavy can match three times the potency of mineral medicines.\n\nRegarding *wenfu* (gentle subduing), mercury can stabilize herbs and minerals without requiring a single method of transformation. For *ganfu* (dry subduing), one must understand the nature of medicines and *juhuo*. If it is *juhuo*, it should remain unchanged for the duration of a meal. This is the standard for *juhuo*.\n\nIron can be refined a hundred times: with each refinement and forging, it becomes supple and moist, never scorched. Copper can be refined fifteen times, with each refinement followed by immersion in medicine, allowing up to twenty cycles. If the furnace fire is mastered, it can endure a hundred refinements without scorching; those without such knowledge will scorch it in three to five cycles. Silver can be refined two or three times without losing its inherent nature. Copper-silver alloys must be smelted according to copper’s method. For all true substances, such measures are unnecessary.\n\n**Method for Subduing Mercury to Transform It into White**\n- Mercury: 1 jin\n- Lead from cinnabar: ½ jin\n- Refined iron powder (thirty refinements): ½ jin\n- Tin: ½ jin\n- *Shiguan* (alum): 1 liang\n- Hematite: 1 liang\n- Five alums: 1 liang\n- *Tesheng yushi* (a type of mineral): 1 liang\n- Chalcanthite: 1 liang\n- Salt: 1 jin\n\nMelt the mercury, lead, and tin together, then add the iron powder to the crucible, cover, and heat until the mercury, lead, and tin dissolve. Remove the lid, stir to combine, then extract and grind the medicines into powder. Mix with vinegar to form a paste, place in an iron cylinder, and add the mercury. Seal the mercury with the paste, ensuring the top is firmly packed—if loose, it will burn. Coat with *liuyi* mud (a six-to-one mixture) on all sides, following the proper method. Once dry, place in a double-layered furnace and heat with a gentle fire. When the furnace glows red, seal the opening. Once moisture from the crucible lid’s vent hole dissipates, seal the hole with *liuyi* mud, applying thin layers gradually. Once dry, slightly open the draft door and apply a mild fire for three cycles, then fully open the draft door and apply a fierce fire for four cycles to complete the subduing. This mercury can be used with the Five Metals but is not yet edible.\n\nThis subdued mercury becomes true white sand; externally compounded medicines will revert over time.\n\n**Hu Gangzi’s Method for Subduing Male Lead to Transform Yellow**\n*(The method for subduing female pyrite is the same.)*\n- Realgar: 1 jin\n- White alum: ½ jin\n- *Xuanjing* (selenite): ½ jin\n- Halite: 5 liang\n- Asbestos: 2 jin\n- Mercury: 1 jin\n\nFirst, boil the realgar and mercury in honey water for five cycles. Then, boil in ox knee ash juice for two days. Grind the remaining four medicines into fine powder, sift through silk, and mix with vinegar to form a paste of appropriate consistency. Wrap the realgar in the paste to form cakes, two *cun* wide and one *cun* thick. Once dry, coat again with the paste and dry. Place in a flat-bottomed pan: first spread dry salt powder to a depth of about two *cun*, then arrange the cakes side by side without touching, separating them with salt powder. After layering, cover with an iron lid, seal with *liuyi* mud, leaving a one-*cun* vent. Once dry, place in the furnace and heat gently until moisture dissipates, then seal. First apply three mild fires, then four fierce fires, cooling for one cycle. This subduing method is excellent. If only wet subduing is used, the color will not manifest. This subdued male lead is the finest for producing yellow. Medicines compounded from multiple substances will revert over time.\n\n**Method for Subduing Cinnabar to Reveal Its Treasure**\n- Fine cinnabar: 1 jin\n- Halite: 1 liang\n- Chalcanthite: 1 liang\n- Alum: 1 liang\n- Mirabilite: 1 liang\n\nGrind the above into powder. Wrap the cinnabar in silk and place it in a pan atop the medicines, ensuring it does not touch the bottom. Boil in lard for five days, then in bittern for five days, and finally in vinegar for five days. Mix two jin of dry salt powder with vinegar to form a paste, and coat the cinnabar with vinegar-mixed paste.",
      "overlap_context": " three to five days. Then place it in a crucible and fire it, returning it to the previous copper medicine decoction. After four or five repetitions, it becomes authentic. Adjustments depend on the practitioner’s discretion.\n\nIn the above silver medicines, the sovereign and ministers clearly interact. Among the hundred methods for the Five Metals, no more than seven or eight medicines are typically used.\n\nTin is inherently brittle, but when properly refined, it becomes one of the finest methods.",
      "start_char": 1288,
      "end_char": 2580,
      "start_sentence": 68,
      "end_sentence": 125,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.4425528049469,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\太古土兑经.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "后将药滓作泥，裹朱砂在中心。 次即取盐泥裹药泥上，待乾置猛火中，烧之两日。 即伏无姻，即伏矣。 若用此法伏之，可作黄，可为上真，亦堪服食。 自外药成者，久而还变。 待药乾，用火炊之，渐渐转入猛火，即皱皮坼，乃见宝也。 痴汞伏丹法 锡五斤，炼冷者一斤，凡入汞一遍，入脂一遍成炼也　汞一斤　白矾　炮砂　硫黄各二两，细研，入醋煮三五日。 一白二痴，又以绛矾一斤　雄黄　玄精各半两　朴硝二两，已上各别杵为末 右取锡及汞，和盐一斤，捣汞一斤，谓洒出、如鱼目，即伏成粉了。 更加盐籍，可厚三四寸。 又以朴硝二两布盐上，次布雄黄等药，次布锡，按之令实，乃以残药末覆上令实，即按盖之。 如飞丹法，四文三武，寒一周，又重飞之，细研，以盐一斤，和捣绛矾、玄精、朴硝等药，一如前法飞之，二文三武，寒一周，出研为粉。 每两可点一斤成上真，其锡及汞，一时入飞之。 自余药中勾分，取作两度飞之，其药九散在作。 如作九，用枣肉一两为九。 如作散，即用不灰木烧之，作泥裹散。 其下药时，先洋铜了，将丸药三五丸，内羊经骨头孔子内，入锅搅之，如药不出，以桃枝，如不散，亦须匀搅之。 《魏君五金诀》：化铁要须入伏铅，及锡余药物所成，不叉如入锡所成者，取三十炼铁，及丹中铅抽成锡，与煮痴汞，以意量之，亦成白银。 如得白汞，即成上真，惟不堪服食也。 太古土兑经卷上竟 太古土兑经卷中 夫五金之宝者，世之贵物也。 切见学道之人，广求方法，放性岔岭，逸志林泉，将此为欢，言仙可就。 夫真修道者，不在憩於深远，贵在冥心悟理。 且旦暮之内，足以和光，不得妄求，广说辛苦，将此招携，以求至道。 或受一言一法，便谤同声，或将神方，广求黄白。 当时本心求道，望得其道，返以忘道，苟求非利，且救目前之荣，岂能息冥中之苦，举目所验，万万千千如此之流，不可辄录此五金妙要而授之。 夫五金飞伏，炼治石物之宗，调合和气之体，具陈其诀，罄之此篇。 若有求治道养性之人，可贻此养学贵宝。 贱身之士，叉不传授与之。 今择此篇，以寄同声好学之士。 几言金药，一色药须金，若依此作之，亦得。 次黄若得伏雄雌朱枇，都不须金性。 上卷中法药，但投上伏雄於银中，亦成真黄。 若投雌枇，亦可伏雄雌。 次耳若投伏朱於黄中，立成紫上真物，即不可服食也。 几银药，须三一去晕，二柔三食。 若依此法，亦成。 次白若得伏雄雌枇，即抽点得成真黄白矣。 夫伏汞，用誉石末作泥，裹伏汞。 先须销铜，令洋誉末裹伏汞，投於铜内，即成白矣。 即须以银性中药柔之，乃成真物也。 几铁性第一，须伏锡及铅。 若不得此法，亦有余药物所成之法，即不及伏铅锡耳。 伏炼铁法 丹中铅五两　煮成痴汞二两半　牛膝炼炮砂一两　牛尿炼锡三两　誉石一两半 右先下铁令洋，取铅锡汞合销，投於铁中，乃取羊经骨搅之，良久即下袖砂，食久更下誉末覆面，及热打之，如此五六度，即倾槽匣中，自成白矣。 一斤炼铁限也。 炼铁精法 右取生铁四两炼之，一销一入黍米酒中，又洋投之，米许袖砂，半两誉石，食久急搅，又倾酒中洋之，如此三十遍，得精矣。 炼铁法",
      "translated_text": "Then take the dregs of the medicines and form them into a paste, encasing the cinnabar at its center. Next, apply a layer of salt-clay over the medicinal paste and allow it to dry. Place it in fierce fire and burn for two days—once subdued without fumes, it is successfully refined. If this method is used for subjugation, it may be employed to produce yellow, serve as supreme alchemical cinnabar, or even be consumed as an elixir. Medicines compounded from other substances will revert over time. Wait until the medicine is dry, then heat it with fire, gradually increasing to fierce fire until the surface wrinkles and cracks, revealing its treasure.\n\n**Method for Subduing Fool’s Mercury with Cinnabar**\n- Tin: 5 jin (refined to 1 jin; for each addition of mercury, incorporate lard once to complete the refinement)\n- Mercury: 1 jin\n- White alum: 2 liang\n- Roasted cinnabar: 2 liang\n- Sulfur: 2 liang\n\nGrind finely and boil in vinegar for three to five days.\nFor the \"one white, two fools\" method, use:\n- Red alum: 1 jin\n- Realgar: 0.5 liang\n- Selenspar: 0.5 liang\n- Mirabilite: 2 liang\n\nGrind each separately into powder. Take the tin and mercury, mix with 1 jin of salt, and pound the mercury until it scatters like fish eyes, then it will be subdued into powder. Add more salt frost to a thickness of three to four cun. Spread 2 liang of mirabilite over the salt, then layer the realgar and other medicines, followed by the tin. Press firmly, then cover with the remaining medicinal powder, pressing again to compact. Seal the vessel. Using the method for volatilizing cinnabar—four mild fires and three fierce fires—cool for one cycle, then volatilize again. Grind finely, mix with 1 jin of salt, and pound together with red alum, selenspar, mirabilite, and other medicines. Volatilize once more as before—two mild fires and three fierce fires—cooling for one cycle. Remove and grind into powder. Each liang can transmute one jin into supreme alchemical silver. The tin and mercury are volatilized together. Divide the remaining medicines evenly and volatilize in two batches; the medicines will disperse during the process. To form pills, use 1 liang of jujube pulp. For powders, burn asbestos, mix with clay, and encase the powder. When applying the medicine, first refine the copper. Place three to five pills into the marrow cavity of a sheep’s shin bone and insert it into the crucible, stirring. If the medicine does not emerge, use a peach branch to stir; if it does not disperse, continue stirring evenly.\n\n**Wei Jun’s Five Metals Formula** states: To transmute iron, one must incorporate subdued lead and tin. Medicines compounded from other substances are inferior to those using tin. Take thirty-refined iron and lead extracted from cinnabar to produce tin, then boil with fool’s mercury, adjusting quantities as needed—this will yield silver. If white mercury is obtained, it becomes supreme alchemical silver, though it is unsuitable for consumption.\n\n**The Scripture of the Great Ancient Earth Exchange (Volume One) concludes here.**\n\n**The Scripture of the Great Ancient Earth Exchange (Volume Two)**\nThe five metals are treasures of the world, prized by all. I have observed that those who study the Dao often seek myriad methods, wandering mountains and forests, indulging in leisure, taking delight in such pursuits, and claiming immortality is attainable. Yet true cultivation of the Dao does not lie in retreating to remote places but in profound contemplation to grasp its principles. Within the span of morning and evening, one may harmonize with the light, without reckless pursuit or excessive toil, thus aligning with the supreme Way. Some, upon receiving a single word or method, slander it in unison; others, possessing divine formulas, seek yellow and white alchemy. Initially, their intent was to pursue the Dao in hopes of attaining it, yet they abandon the Way, seeking fleeting gains. While this may bring temporary glory, how can it alleviate the hidden sufferings of the unseen? Countless such cases abound—this esoteric knowledge of the five metals must not be casually transmitted. The subjugation and volatilization of the five metals are the foundation of refining minerals and harmonizing the body’s qi. Here, their secrets are fully expounded. Those who seek the Dao and cultivate their nature may inherit this precious learning. It shall not be imparted to the unworthy. This volume is selected for those of like mind who share a passion for learning.\n\nA few words on gold medicines: A single medicine requires gold. If prepared according to this method, it will suffice. For secondary yellow, if subdued male and female cinnabar are obtained, no gold nature is needed. In the methods of the middle volume, simply add subdued male lead to silver to produce true yellow. If female cinnabar is added, it can also subdue male and female cinnabar. For secondary purple, adding subdued cinnabar to yellow instantly yields supreme purple alchemical silver, though it is inedible.\n\nFor silver medicines, employ the \"three-one\" method: remove impurities, soften, and consume. Following this method will also succeed. For secondary white, if subdued male and female cinnabar are obtained, transmutation will yield true yellow and white. To subdue mercury, use arsenolite powder to form a paste and encase the mercury. First melt the copper, then add the arsenolite-wrapped mercury to the copper—it will turn white. Next, soften it with medicines of silver nature to produce the true substance.\n\nIron’s nature is foremost; it requires subdued tin and lead. Without this method, other compounded medicines may be used, though they are inferior to subdued lead and tin.\n\n**Method for Subduing and Refining Iron**\n- Lead from cinnabar: 5 liang\n- Boiled fool’s mercury: 2.5 liang\n- Cinnabar refined with ox knee: 1 liang\n- Tin refined with ox urine: 3 liang\n- Arsenolite: 1.5 liang\n\nFirst melt the iron, then add the combined lead, tin, and mercury. Stir with a sheep’s shin bone for a long time, then add the cinnabar. After some time, add arsenolite to cover the surface. Heat and forge repeatedly five or six times, then pour into a mold—it will become white. One jin is the limit for refining iron.\n\n**Method for Refining Iron Essence**\nTake 4 liang of raw iron and refine it. Melt it once and quench it in millet wine. Reheat and add a rice-grain-sized amount of cinnabar and 0.5 liang of arsenolite. Stir vigorously for some time, then quench again in wine. Repeat this process thirty times to obtain the essence.\n\n**Method for Refining Iron**",
      "overlap_context": "*Method for Subduing Cinnabar to Reveal Its Treasure**\n- Fine cinnabar: 1 jin\n- Halite: 1 liang\n- Chalcanthite: 1 liang\n- Alum: 1 liang\n- Mirabilite: 1 liang\n\nGrind the above into powder. Wrap the cinnabar in silk and place it in a pan atop the medicines, ensuring it does not touch the bottom. Boil in lard for five days, then in bittern for five days, and finally in vinegar for five days. Mix two jin of dry salt powder with vinegar to form a paste, and coat the cinnabar with vinegar-mixed paste.",
      "start_char": 2580,
      "end_char": 3834,
      "start_sentence": 126,
      "end_sentence": 177,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.38748335838318,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\太古土兑经.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "右销投牛尿中，五十遍即成精也。 伏锡法 右取锡於酪中，抽之十遍，又投玄精中十遍。 凡锡一斤，玄精三两，依法销锡及玄精末，一时投锅中，急搅之。 次又投生朱一两，炼铁半两，覆上，即入前养伏锡方中药煮，即成上好白银。 变换黄白入药法 右如入白将伏汞，入白最佳。 若将生汞入银，用雄黄半斤，朱砂半斤，投锅中，又投一两生铅，同入酒中，煮之一日，倾出。 又入雄黄末，和汞药捣之。 又入粟米酒中，煮十五日，其汞即成黄也。 伏汞法 汞一斤　丹中铅十两，二味一处销　好朱砂二两　真艮三两　玄精石五两　石脑二两 右取销成铅汞，和诸药入铁筒子，固济，烧之三十日，的伏任入五金，用之即成真也。 伏朱砂法雄雌础等并同法 右件各一斤。 朴梢五两为末，加醋煮之五日，又下白矾一斤，玄精半两，誉石三两。 又与前药，同入蜜水，煮二十日。 又入卤汁中，煮三日，的伏也。 伏白矾法 右先以入盐锅中，内白矾於锅内，同烧之一日，可伏矣。 伏石脑法与石胆同法 石脑二斤玄精二斤炮砂三两右为末，加卤五升，同煮二七日，即伏也。 其卤汁侯尽，即更添之。 飞磁石法 誉石、曾青、石碌等并同法，誉石，一本作矾石也。 右诸药一斤，用汞二两，捣研相入，飞三日三夜，寒一日，任入五金中用。 常时一斤者，可用半斤耳。 伏硫黄法 硫黄一斤 右入卤汁中煮一日，乃取黄入绢袋贮之。 又入牛膝灰汁中煮一日，又入蜜水煮一日，又入桑灰汁煮五日，又更入牛膝灰汁煮一日，即下汞半斤，准前三三日以成，出之作散。 又取好牛乳一升煮之，还取前煮汞半斤，和乳煮三日，即伏。 百种用得，服食更佳。 制庚法昊本已下无 右以好山泽艮十两为末，用伏雄雌共一两，与艮末一处研，更入生汞一两研之，直待不见星子，即入告车鉼子内，大车以小鉼贮油脂，辖其鉼小而有顷者也。 以六一泥固济罐子了，下糠火养三七日，满渐渐进火暖之通赤，候自玲，不得括出火。 次日打破罐子。 其实碎为泥，则用甘锅内猫之，候澄清出之。 为上宝也。 又法",
      "translated_text": "Melt and quench in ox urine fifty times to obtain the essence.\n\n**Method for Subduing Tin**\nTake tin and refine it in fermented milk ten times, then in dark essence ten times. For every jin of tin, use three liang of dark essence. Melt the tin and dark essence powder together in a crucible, stirring vigorously. Then add one liang of raw cinnabar and half a liang of refined iron, covering the surface. Place in the previous nourishing and subduing tin formula, boil with the medicinal ingredients, and it will become fine silver.\n\n**Method for Transmuting Yellow and White with Medicinal Ingredients**\nIf using subdued mercury for white transmutation, it is most excellent. If using raw mercury with silver, take half a jin each of realgar and cinnabar, place in a crucible, add one liang of raw lead, and boil together in wine for one day. Pour out, then add realgar powder and mix with mercury medicinals. Pound together, then boil in millet wine for fifteen days—the mercury will turn yellow.\n\n**Method for Subduing Mercury**\n- Mercury: 1 jin\n- Lead from cinnabar: 10 liang\n\nMelt these two together. Then add:\n- Fine cinnabar: 2 liang\n- True *gen*: 3 liang\n- Dark essence stone: 5 liang\n- Sal ammoniac: 2 liang\n\nCombine the molten lead-mercury with the above medicinals in an iron tube, seal tightly, and heat for thirty days. The subdued mercury may then be used with the five metals to produce true results.\n\n**Method for Subduing Cinnabar** *(same method applies to realgar and orpiment)*\nTake one jin of each. Grind five liang of unrefined nitre into powder, boil with vinegar for five days, then add one jin of white alum and half a liang of dark essence, along with three liang of arsenolite. Combine with the previous medicinals, boil in honey-water for twenty days, then in brine for three days to subdue.\n\n**Method for Subduing White Alum**\nFirst place in a salt crucible, add white alum, and heat together for one day—it will be subdued.\n\n**Method for Subduing Sal Ammoniac** *(same method as for chalcanthite)*\n- Sal ammoniac: 2 jin\n- Dark essence: 2 jin\n- Nitre: 3 liang\n\nGrind into powder, add five *sheng* of brine, and boil for fourteen days—it will be subdued. When the brine evaporates, replenish it.\n\n**Method for Flying Magnetite** *(same method applies to arsenolite, malachite, and azurite; arsenolite is also written as alum)*\nFor every jin of these medicinals, use two liang of mercury. Pound and grind together, then fly for three days and nights. Cool for one day, and it may be used with the five metals. Normally, for one jin of medicinal, use only half a jin.\n\n**Method for Subduing Sulphur**\n- Sulphur: 1 jin\n\nBoil in brine for one day, then place the sulphur in a silk bag. Boil in ox knee ash juice for one day, then in honey-water for one day, then in mulberry ash juice for five days. Boil again in ox knee ash juice for one day, then add half a jin of mercury. Follow the previous method for three three-day cycles to complete. Remove and grind into powder. Take one *sheng* of fine cow’s milk, boil, then add the previously boiled half-jin of mercury, and boil together for three days—it will be subdued. Effective for a hundred uses, and even better for internal consumption.\n\n**Method for Restraining Metal (Geng)**\nTake ten liang of fine mountain *gen* powder, mix with one liang of subdued realgar and orpiment, and grind together. Add one liang of raw mercury and grind until no mercury globules remain. Place in a *gaoche* crucible (a small crucible used in carts, filled with oil or grease). Seal the crucible with Six-One Mud, then nurture with chaff fire for twenty-one days. Gradually increase the fire until red-hot, then allow to cool naturally without removing from the fire. The next day, break the crucible. Grind the contents into a paste, then melt in a crucible until clear. Remove—this is a supreme treasure.\n\n**Alternative Method**",
      "overlap_context": "te to cover the surface. Heat and forge repeatedly five or six times, then pour into a mold—it will become white. One jin is the limit for refining iron.\n\n**Method for Refining Iron Essence**\nTake 4 liang of raw iron and refine it. Melt it once and quench it in millet wine. Reheat and add a rice-grain-sized amount of cinnabar and 0.5 liang of arsenolite. Stir vigorously for some time, then quench again in wine. Repeat this process thirty times to obtain the essence.\n\n**Method for Refining Iron**",
      "start_char": 3834,
      "end_char": 4674,
      "start_sentence": 178,
      "end_sentence": 217,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.942712545394897,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\太古土兑经.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "硫黄十两　汞一斤　丹中铅四两 右一处都研，入新铁鼎中，养四十五日满，以大火毁两日，取出红紫色，孺为末，用生雄黄一两，胆子矾一两。 一处研细，用牛尿搜为埚子相似，内满添汞，底着火。 三两已来，自成庚矣。 太古土兑经卷中竟 太古土兑经卷下 诸方家合炼，皆有异同。 只如《太清丹经》，罕闻。 几流莫测。 加之玉诀，贤者故黄帝、淮南，寻真弃位。 茅君、尹喜，得道忘机。 狐呈子粉图流传三卷。 张君金石，题授五篇。 玄妙养生，先论气候。 陶公药性，不达君臣。 若了此原，即知要妙。 且诸家所迷者，或说药性，不晓飞治。 或说飞治，不明合饵。 或说炉火，不解坚柔体性。 若明斯诀无事不谐。 今迷诸经之秘要诀，列之於后，授者，秘之。 伏流朱作黄白并服食 硫朱一斤　磁石三两　黄丹五两　丹中铅五两 右治石药了，入白矾、誉石三两，并捣为末。 取前铅黄丹磁石硫朱等，同下诣祈下煮七日，即白。 次取岩州朴硝，瓜州黄矾，嵩山誉石，北庭袖砂，已上各三两。 又取前白汞及磁石，同入醋煮两日，即出，号日硫朱。 汞专流珠，此云硫朱，字异名同。 取朱投丹中铅，合成挺子。 却捣碎，入褚脂煮三十日即伏。 如不伏坚硬，加二两真艮，亦入褚脂煮之，即伏也。 将此入五金，亦要和硝石作粉，和雄朱飞成丹。 服之延年。 其法先销汞粉，入盐覆籍飞之，二日文火，二日武火，一日寒之，即出。 投朱雄五两，即成庚矣。 《太清丹经》中，第一法能入五金，全用第二堪服食。 玉诀释如此入雄，更飞三日，文中武，武中文，即成霜也。 茅君伏汞法 汞一斤　玄精三两　五矾等各二两　朴硝三两　戎盛三两　黄丹五两　金牙五两　炮砂三两 右已上并捣罗为末，以好左味，煮汞及药於铁鼎中，常令如鱼目沸耗，即暖左味，渐渐添之，经五日一度，安药尽前药煮之二十日，其汞伏也，任入五金。 狐呈子玄珠法昊无此法 玄珠一斤　铅白末成炼者五两　玄精真艮各二两 右先销铅入器中，即投玄珠相和，别处销入艮入汞，中和玄精，研之百下，醋中煎三十日，取出。 若不伏，即下河车一合，的伏也。 乃取铁精末二两，和锡四两，相投搅之，即出。 醋为末入前汞中，五日煎之，的伏也。 伏雄黄法雌毗朱并同此法 雄黄一斤　石胆三两　白矾一斤　玄精五两　不灰木三两　誉石五两 右并螂为粉，乃取雄打破，如小麦许，以绢袋子贮之，入醋煮，和其诸药末，同煮二十日，出之。 取雄与醋相和，捻作饼子，取煮了，药滓还作泥，将裹前雄饼，入盐铛中烧之十日，伏火亦好，与五金伏相似，用一种也，任入五金用之。 玄黄膏法 用伏汞　伏雄　伏雌　伏朱　伏硫　伏曾青 右已上并飞三遍后，用水酒炼伏。 上党伏苓、人参、松桥炼成者，桑柴灰汁霜、黄连、蜜炼煮水坚杏仁子，以水煮之七日，时时添暖水日足，用之是也。 又以上伏药与生药，每蜜二升，草石药各半斤，火不得大猛，猛即药黑色。 微微着火，炼之十五日，以乾柳木篦子搅之成膏，其药尽作末入铛。 如蜜尽加蜜。 至日足，空腹酒下一匕，百日神仙。 但勿食五辛、十二兽肉，勿向秽处。 若作黄用，每汞一斤，可投此膏半匙，即成上黄，亦堪服食。 以青竹筒盛汞，不盖上以左味煮之无歇，四日夜侯黑姻尽，出之，可饼。",
      "translated_text": "**Method for Refining Sulfur and Mercury**\n\nTake ten *liang* of sulfur, one *jin* of mercury, and four *liang* of cinnabar-lead. Grind them together, place in a new iron crucible, and nurture for forty-five days. Then apply intense fire for two days. Remove when it turns a reddish-purple hue, grind into powder, and add one *liang* each of raw realgar and chalcanthite. Grind finely, mix with cow urine to form a paste resembling a crucible, fill with mercury, and place over fire. When three *liang* of mercury remain, it will naturally transmute into *geng*.\n\n**Essential Secrets from the *Tai Gu Tu Dui Jing***\n\nThe methods of various schools differ in their approaches. For instance, the *Tai Qing Dan Jing* is rarely encountered—its depths elude most. Yet with the jade instructions, even the worthy like the Yellow Emperor and the Prince of Huainan abandoned their thrones in pursuit of truth. Lord Mao and Yin Xi attained the Dao and forgot worldly schemes. The *Fox Manifestation’s Powdered Charts* were passed down in three scrolls, while Master Zhang’s *Metal and Stone* was bestowed in five chapters. The mysteries of nurturing life begin with understanding *qi* and seasons. Master Tao’s discourse on medicinal properties lacked clarity on the sovereign and minister. Once this origin is grasped, the essential subtleties become known.\n\nThe confusion among schools arises thus: some expound on medicinal properties but fail to comprehend refinement; others understand refinement but not ingestion; still others grasp furnace and fire yet remain ignorant of hardness and softness in substance. If these secrets are mastered, nothing will prove discordant. Here, the arcane essentials of various classics are revealed—guard them well.\n\n**Method for Transmuting Cinnabar into Yellow and White (for Ingestion)**\n\nTake one *jin* of cinnabar-sulfur, three *liang* of magnetite, five *liang* of yellow lead, and five *liang* of cinnabar-lead. Prepare the mineral medicines, then add three *liang* each of white alum and arsenolite, and grind into powder. Combine the aforementioned lead, yellow lead, magnetite, and cinnabar-sulfur, and boil together for seven days until white. Next, take three *liang* each of rock salt from Yanzhou, Glauber’s salt from Guazhou, arsenolite from Songshan, and cinnabar from Beiting. Boil these with the white mercury and magnetite in vinegar for two days, then remove—this is called *liuzhu* (sulfur-cinnabar). Mercury flows like pearls, and though the name differs, the substance is the same. Add this to cinnabar-lead to form an ingot. Crush it, boil in lard for thirty days to subdue it. If it remains hard, add two *liang* of true *gen* and boil again in lard—it will be subdued. When added to the five metals, mix with saltpeter powder and realgar, then refine into cinnabar for ingestion to prolong life.\n\nThe method: First melt mercury powder, cover with salt, and refine with fire—two days of gentle fire, two days of fierce fire, then cool for one day before removing. Add five *liang* of realgar—this completes the *geng*. In the *Tai Qing Dan Jing*, the first method is for transmuting the five metals, while the second is fit for ingestion. The jade instructions clarify: refine with realgar for three more days, alternating gentle and fierce fire—it will become frost.\n\n**Lord Mao’s Method for Subduing Mercury**\n\nTake one *jin* of mercury, three *liang* of selenite, two *liang* each of the five alums, three *liang* of Glauber’s salt, three *liang* of halite, five *liang* of yellow lead, five *liang* of gold-tooth mineral, and three *liang* of cinnabar. Grind all into powder, then boil the mercury and medicines in an iron crucible with good vinegar, maintaining a simmer like fish eyes. Replenish the vinegar as it evaporates, adding gradually over five days. After twenty days of boiling with the medicines, the mercury will be subdued and ready for use with the five metals.\n\n**Fox Manifestation’s *Mysterious Pearl* Method** *(This method is absent in the *Wu* text)*\n\nTake one *jin* of *xuanzhu* (mysterious pearl), five *liang* of unrefined lead powder, and two *liang* each of true *gen* and selenite. First melt the lead in a vessel, then add the *xuanzhu* and mix. Melt the *gen* and mercury separately, then combine with selenite. Grind one hundred times, boil in vinegar for thirty days, then remove. If not subdued, add one *he* of *heche* (human placenta) to ensure subjugation. Next, take two *liang* of iron essence powder, mix with four *liang* of tin, and stir together. Grind into powder, add to the previous mercury, and boil for five days—it will be subdued.\n\n**Method for Subduing Realgar** *(Applies also to orpiment and cinnabar)*\n\nTake one *jin* of realgar, three *liang* of chalcanthite, one *jin* of white alum, five *liang* of selenite, and three *liang* of asbestos. Grind all into powder. Break the realgar into wheat-grain-sized pieces, place in a silk bag, and boil in vinegar with the other medicinal powders for twenty days. Remove, mix the realgar with vinegar, and shape into cakes. Use the boiled medicinal residue as mud to wrap the realgar cakes. Place in a salt cauldron and fire for ten days—this subdues it well, similar to subduing the five metals. It may be used interchangeably with them.\n\n**Method for *Xuanhuang* Ointment**\n\nUse subdued mercury, subdued realgar, subdued orpiment, subdued cinnabar, and subdued malachite. After refining each three times, further refine with water and wine. Use processed *fu ling* from Shangdang, ginseng, and pine resin; boil with ash water from mulberry firewood, coptis, and honey; and harden with apricot kernels. Boil in water for seven days, replenishing with warm water as needed. This is the method.\n\nAlternatively, combine the subdued medicines with raw medicines: for every two *sheng* of honey, use half a *jin* each of herbal and mineral medicines. Avoid excessive fire, which blackens the medicine. Apply gentle heat and refine for fifteen days, stirring with a dry willow stick until it forms a paste. Grind all medicines into powder and place in a cauldron. If the honey is exhausted, add more. After the allotted days, take one spoonful on an empty stomach with wine—after a hundred days, one becomes an immortal. Avoid the five pungent foods, the meat of the twelve animals, and unclean places.\n\nFor transmuting into gold, add half a spoonful of this ointment to one *jin* of mercury—it will become superior gold, also fit for ingestion. Place mercury in a green bamboo tube without a lid, boil continuously with vinegar for four days and nights until the black smoke dissipates, then remove and shape into cakes.",
      "overlap_context": "f raw mercury and grind until no mercury globules remain. Place in a *gaoche* crucible (a small crucible used in carts, filled with oil or grease). Seal the crucible with Six-One Mud, then nurture with chaff fire for twenty-one days. Gradually increase the fire until red-hot, then allow to cool naturally without removing from the fire. The next day, break the crucible. Grind the contents into a paste, then melt in a crucible until clear. Remove—this is a supreme treasure.\n\n**Alternative Method**",
      "start_char": 4674,
      "end_char": 5963,
      "start_sentence": 218,
      "end_sentence": 278,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.97439765930176,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\太古土兑经.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "入火即伏汞霜，飞此膏，伏汞伏雄雌皆住。 黄连杏仁　乌豆并令为末，以蜜糖一升，药各半斤 右炼十五日，微火一如前法。 服一匙匕，亦以酒下。 亦可作黄白，妙得点化之性。 歌日： 还我二膏，废我神劳。 毁我二膏，戮我天曹。 夫大小二丹，点化与其，一意可见，故不尽述。 有大丹，但伏得汞，即伏得八石。 知君臣在，人意修理，亦与古方大同小异。 数家皆别，在人意斟酌消息，即伏成还丹矣。 歌日： 家有三还，天地声颜。 若修一石，二人妙丹，亦有点化之性。 览此三卷圣法，以意消息，自成黄白。 凡大丹有三十六水，但得硝石，无事不办。 水云母法 云母一斤　葱汁半升　蜜半升　桂汁半斤 右并相和，并内竹筒中，以漆固济口，埋七日即化为水。 如未化，更蒸煮一日，悬井中及水，自化。 水玉法 玉一斤末之　磁石一分末之　云液一分 右如前固埋十日，成水。 欲住雄雌丹液，每云母一升，水和硝石一斤，拌雄雌末各一斤，准上法固埋之，成丹液。 紫油丹法 汞　雄各一斤 右二味相和研搜，如面裹之，入饭以黍。 右先下骯中，一日换夜三度毕，将加汞研三，铜器下硝石半斤，和埋治下十日。 又以硝石一斤投中，重汤煮之，四日即为浆矣。 欲为紫油丹，即和汞研，便於铜器中，加微火煎三日夜，颜色微微变，即加大火煎之九日夜，时时变色，即勿怪之，九日当为紫色。 即以定平日烽之，六日夜赫然赤色，乃成也。 将以点铅，即五色肥矣。 伏火紫粉法 汞一斤　硫黄半斤 右以伏诸药石法浮出，即掠取已成紫粉，亦可以铁碗熬，令姻尽用之。 紫油丹成伏汞法 右取铅精讫，每生汞二三两，入甘埚子，下少许灰，内汞粉紫油丹，其上所和铅锡者末，更以灰覆上，入灰炉良久，五上五下，最后令一度埚赤，即泻地上，为黄矣。 铁粉法成水 右取铁错为末，以乌牛尿中浸一宿，出之，内甍器中，一重铁末，一重余甘子末，如是三十一重，密盖埋屋北阴下，三七日成矣。 炼铅华法 右取铅一百斤，入铁炉中镕，以铁匙搅之，一依炒黄丹法，每一百掠得华一十斤矣。 转白入黄法 右取乾汞，入巩县鉼子中，裹雄雌黄伏火者，和汞，内鉼中固济。 又以药泥裹三重，文武火养三七日，候火色同，即黄成矣。 紫泥法 黄丹一斤　雄黄一斤　醋五升 右取上药，以醋中浸少时，日乾，如此数遍，令渗尽醋为度。 乃内埚中，以文火烧之。 候色赤即止。 如火色过白，即失力。 如土成灰，不堪用也。 金粉法 兑一两　汞五两 右镕相入讫，以帝味三两，和研成泥，内埚中倒抽之讫，淘去帝味，研为粉，任用也。 炼黄盥粉法 帝味一斤　黄脂一斤　华粉一团 右以恶灰一升，已上相和，火养十日，成矣。 金石抄录 明君臣",
      "translated_text": "When introduced to fire, this ointment subjugates mercuric frost. By refining this paste, both mercury and its male-female forms are stabilized.\n\n**Coptis and Apricot Kernel Ointment**\nGrind equal parts coptis, apricot kernels, and black soybeans into powder. Mix with one *sheng* of honey and half a *jin* of each medicine. Refine over gentle fire for fifteen days, following the previous method. Take one spoonful with wine on an empty stomach. It may also be used for transmutation, possessing wondrous alchemical properties.\n\n**Verse:**\nReturn my two pastes,\nSpare me divine toil.\nDestroy my two pastes,\nCondemn me to celestial courts.\n\nThe Greater and Lesser Elixirs, with their transmutative power, share a single principle—thus, no further elaboration is needed.\n\n**The Great Elixir**\nWhen mercury is subjugated, the eight minerals are likewise subdued. Knowing the roles of sovereign and minister, and refining with intent, one follows ancient methods with minor variations. Though schools differ in number, success lies in careful adjustment—thus, the Reverted Elixir is achieved.\n\n**Verse:**\nWith three reversions at home,\nHeaven and earth resound in glory.\nIf refining one mineral,\nTwo persons craft the wondrous elixir,\nWhich also bears transmutative power.\n\nPerusing these three volumes of sacred methods, one may, through thoughtful adaptation, produce gold and silver.\n\n**The Thirty-Six Waters of the Great Elixir**\nWith saltpeter alone, nothing is unattainable.\n\n**Mica Water Method**\nCombine one *jin* of mica, half a *sheng* of scallion juice, half a *sheng* of honey, and half a *jin* of cassia juice. Seal the mixture in a bamboo tube with lacquer, bury it for seven days, and it will liquefy. If not fully dissolved, steam for one more day, then suspend it in a well—it will transform into water.\n\n**Jade Water Method**\nGrind one *jin* of jade and one *fen* of magnetite into powder, then mix with one *fen* of cloud liquid. Seal and bury for ten days as before to form water.\n\n**Stabilizing Male-Female Elixir Liquid**\nFor each *sheng* of mica, blend one *jin* of saltpeter with one *jin* each of male and female mercury powder. Seal and bury following the above method to produce elixir liquid.\n\n**Purple Oil Elixir Method**\nCombine one *jin* each of mercury and male mercury. Grind and knead them together, wrap in dough, and steam with millet. Replace the mixture in the crucible three times daily for one day. Then grind the mercury three times, place it in a copper vessel with half a *jin* of saltpeter, and bury it for ten days. Add another *jin* of saltpeter, boil in a double boiler for four days—it will become a paste. To refine it into Purple Oil Elixir, grind with mercury, place in a copper vessel, and heat gently for three days and nights until the color subtly shifts. Then increase the fire for nine days and nights; though the hue changes frequently, do not be alarmed. On the ninth day, it will turn purple. After stabilizing it for a full day, heat it intensely for six days and nights—it will blaze crimson, signaling completion. When used to transmute lead, it yields a lustrous, five-colored metal.\n\n**Fire-Subduing Purple Powder Method**\nCombine one *jin* of mercury with half a *jin* of sulfur. Refine using the method for subjugating minerals, then skim off the resulting purple powder. It may also be heated in an iron bowl until smoke dissipates before use.\n\n**Purple Oil Elixir’s Subjugation of Mercury**\nAfter extracting lead essence, place two to three *liang* of raw mercury in a crucible with a small amount of ash. Add Purple Oil Elixir mixed with lead and tin powder, cover with more ash, and place in an ash furnace. Heat five times, lifting and lowering the crucible, then finally heat until the crucible glows red. Pour onto the ground—it will become gold.\n\n**Iron Powder Water Method**\nFile iron into powder, soak in black cow’s urine overnight, then layer in an earthen vessel with emblic myrobalan powder—thirty-one layers in total. Seal tightly and bury in the northern shade of a house for twenty-one days to complete.\n\n**Refining Lead Bloom Method**\nMelt one hundred *jin* of lead in an iron furnace, stirring constantly with an iron spoon as in the yellow lead method. Each hundred *jin* yields ten *jin* of bloom.\n\n**Transmuting White into Yellow Method**\nPlace dried mercury in a Gong County crucible, mix with fire-subdued male and female yellow, and seal. Coat with medicinal mud in three layers, then refine with gentle and strong fire for twenty-one days. When the fire’s color stabilizes, the yellow will be complete.\n\n**Purple Mud Method**\nCombine one *jin* each of yellow lead and realgar with five *sheng* of vinegar. Soak the medicines briefly, then sun-dry. Repeat until the vinegar is fully absorbed. Place in a crucible and heat with gentle fire until the color turns red—stop then. If the fire turns white, its potency is lost. If it becomes ashen, it is unusable.\n\n**Gold Powder Method**\nMelt one *liang* of *dui* with five *liang* of mercury. Grind with three *liang* of *diwei* into a paste, place in a crucible, and refine. Wash away the *diwei* and grind the residue into powder for use.\n\n**Refining Yellow Washing Powder Method**\nCombine one *jin* each of *diwei* and yellow fat with one lump of bloom powder. Mix with one *sheng* of coarse ash and refine over fire for ten days to complete.\n\n**Excerpts on Minerals and Metals**\nClarifying Sovereign and Minister.",
      "overlap_context": "ays, take one spoonful on an empty stomach with wine—after a hundred days, one becomes an immortal. Avoid the five pungent foods, the meat of the twelve animals, and unclean places.\n\nFor transmuting into gold, add half a spoonful of this ointment to one *jin* of mercury—it will become superior gold, also fit for ingestion. Place mercury in a green bamboo tube without a lid, boil continuously with vinegar for four days and nights until the black smoke dissipates, then remove and shape into cakes.",
      "start_char": 5963,
      "end_char": 7086,
      "start_sentence": 279,
      "end_sentence": 338,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.44265389442444,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\太古土兑经.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "右铅汞为金石之主。 铅为君，汞为臣。 铅能理五藏，汞能去三尸。 曾青为使者，能明目。 来雄为将军，能诤四夷。 炼此四神之药，服之而得长生。 明飞伏 右有阴飞，有阳伏，有阳飞，有阴伏。 铅能制汞，故日阴伏阳。 汞能伏铅，故曰阳制阴。 夫硫黄一两，制汞五两，是阳伏阳也。 信知汞力不如铅力也。 且硫入汞日飞，铅投汞日伏。 明阴阳 居飞曰阳，居制日阴。 飞而伏者，却居其阴。 伏而飞者，反入其阳。 阳伏而飞者，阴极即阳生。 阴飞而伏者，阳极即阴生。 夫制伏金石，以一阴一阳，乃得合和。 以阳伏阳，以阴伏阴，终无得理。 硫汞成霜，和九转铅精一两，又飞之。 服一刀圭，令人变易。 又投生汞於铅中，飞之九日出霜，必伏盘之上。 每一两变宝一斤，人服延龄也。 明刚柔 铅投於汞即刚，汞投於铅即柔。 其物柔，若得之，则刚柔相伏矣。 夫汞与铅，能柔刚其性，能柔其物。 柔若得之则刚，刚若得之则柔。 夫变化五金，不得铅汞，终无得理也。 明浮沉 金性沉，石性浮，服之返有投上功，得金而相贯，而不能浮。 故云一石而贯一金，亦号还丹之名也。 明相类 夫铅与雄同，舍化受於金之类。 雌雄类炮砂，雄不得炮砂相和，而其色不行。 夫铅者，金之主。 雄者，石之主，故铅能变金石。 夫欲变金石，不得雄铅，终不妙也。 夫变五金，无四黄变蒸，亦终不妙也。 夫雌亦能变伏五金八石类，於蜜水见母。 夫硫黄伏得，本色不移，亦能变伏，染金石类，入磁石作汁，汞类石亭脂，毗类石脑，立凝不飞，朱酝醇酒铅类，桑柴之灰锡类，蜜陀僧曾青类，於代赭夫论相类者，阴阳和合，即变化顺宜也。 明相恶 金恶水银，银恶生铁及炮砂。 金得银而虚，银得铜而疏，铜得铁而强，得锡而俱。 夫五金八石，皆恶余甘子，及代赭不灰木，化一切金石为水。 若不得硝石，终无得理。 夫铅汞雌雄，兼一切金石伏火药物，将火试之，火之不动，鼓之不流，色无精光，并不能变诸金石。 明性灵 夫朱砂者，太阳之精，日之子，而能生。 生者能飞一切金石。 若不得汞皆飞不上，得倒行神骨则立而并飞。 用石胆、黄矾、白矾为使，用金银以为母，用曾青为将，用四黄以为君。 夫四黄之中，不如雄也。 三青之内，不如曾也，雄能通於神，曾能明於目。 大结子三华煮之为上，次以猜脂煮之，兼以滋润，妙也。 切忌玲热相淘，亦能变为末也。 夫朱砂好者，入赤盥黄盐，覆藉磁器，火养十日，名日立制神粉。 点汞成紫庚，五石为软金，亦号曰神妙，又点上真庚合之固神。 夫硫黄用吐番紫矾一味，立制汞为黄金。 波斯赤盐亦然。 俱不用诸药，并成上宝。 夫欲作庚，先须炼铅及伏雄汞，即伏四黄。 但伏得雄汞二味，自成其真宝。 不劳诸药，两味相和合，作土金相和，用黄赤二盐覆藉，以清虚薪火，烧之五十日，成紫光丹，点化五金。 点白金，以青与代赭。 阴伏金公，可修忽於飞霜汤制立，要石亭脂、帝女血，和汞砂银，火养百日成庚。 又黄童一斤，帝女一斤，作汁煮三十日，不失本性。 亦以制汞，汞生硫黄，火之六神，生为赤霜也。 又五金有不真物，但投炮砂，则真伪自见，亦能均色也。 麒麟竭亦能驻色。 黍米酒能柔软，栀子能染色，余甘子能去不净，代赭亦能润色，兼能美质，黄矾能出染一切金石汞砂，投堵脂千遍，而成银，烂如泥，服之长生，大坚筋骨，朱砂以炮砂煮用之，清矣。",
      "translated_text": "Lead and mercury serve as the sovereign and minister of minerals and metals. Lead acts as the sovereign, governing the five viscera, while mercury acts as the minister, expelling the Three Corpses. Azurite serves as the messenger, brightening the eyes. Cinnabar acts as the general, subduing the four barbarians. Refining these four divine medicines and ingesting them grants longevity.\n\n**On Ascension and Subjugation**\nThere exists yin ascension, yang subjugation, yang ascension, and yin subjugation. Lead can restrain mercury, hence \"yin subjugates yang.\" Mercury can subdue lead, hence \"yang restrains yin.\" One *liang* of sulfur can subjugate five *liang* of mercury—this is yang subjugating yang. Thus, it is known that mercury’s power is not equal to lead’s. When sulfur enters mercury, it is called ascension; when lead is added to mercury, it is called subjugation.\n\n**On Yin and Yang**\nThat which ascends is yang; that which restrains is yin. Ascension that becomes subjugation reverts to yin. Subjugation that becomes ascension returns to yang. When yang is subjugated and ascends, yin reaches its extreme and yang is born. When yin ascends and is subjugated, yang reaches its extreme and yin is born. To subjugate minerals and metals, one yin and one yang must harmonize. To subjugate yang with yang or yin with yin will never succeed. When sulfur and mercury form frost, blend it with one *liang* of nine-times-refined lead essence and ascend it again. Ingesting one *daogui* transforms a person. Adding raw mercury to lead and ascending it for nine days produces frost, which must settle upon the subjugation vessel. Each *liang* transforms into a *jin* of treasure, and ingestion prolongs life.\n\n**On Hardness and Softness**\nWhen lead is added to mercury, it becomes hard; when mercury is added to lead, it becomes soft. Though mercury is soft, when combined, hardness and softness subjugate each other. Mercury and lead can soften the nature of hardness and the properties of other substances. When softness is attained, it becomes hard; when hardness is attained, it becomes soft. Without lead and mercury, the transmutation of the five metals will never succeed.\n\n**On Floating and Sinking**\nGold is heavy and sinks; minerals are light and float. When ingested, they paradoxically ascend, and when gold is obtained and fused, it cannot float. Thus, it is said that one mineral can pierce one gold—this is also called the name of *huandan*.\n\n**On Resemblance**\nLead and realgar share kinship, both deriving from the class of metals. Cinnabar and realgar resemble *paosha*; without *paosha*, their color does not manifest. Lead is the sovereign of metals, and realgar is the sovereign of minerals; thus, lead can transform minerals and metals. Without realgar and lead, transmutation will never be wondrous. Without the four yellows to catalyze transmutation, it will also never succeed. Cinnabar can also subjugate and transform the five metals and eight minerals, appearing in honey water like a mother. When sulfur is properly subjugated, its original color remains unchanged, yet it can transform and dye minerals and metals. It can be melted with magnetite into a liquid, resembling *shitingzhi*; *pi* resembles *shinao*; it solidifies instantly and does not ascend. Cinnabar resembles fermented wine; lead resembles mulberry ash; tin resembles *mituoseng*; azurite resembles *daizhe*. In discussing resemblance, when yin and yang harmonize, transformation proceeds smoothly.\n\n**On Incompatibility**\nGold detests mercury; silver detests raw iron and *paosha*. Gold is weakened by silver; silver is loosened by copper; copper is strengthened by iron but ruined by tin. The five metals and eight minerals all detest *yuganzi* and *daizhe buhuimu*, which can dissolve all metals and minerals into water. Without saltpeter, transmutation will never succeed. When lead, mercury, cinnabar, realgar, and all fire-subjugated minerals and metals are tested by fire, if the fire does not move them, if they do not flow when fanned, and if their color lacks luster, they cannot transform other metals and minerals.\n\n**On Nature and Spirit**\nCinnabar is the essence of the Great Yang, the child of the sun, and possesses generative power. It can cause all metals and minerals to ascend. Without mercury, none can ascend; with *daohang shengu*, they ascend together instantly. Use chalcanthite, yellow vitriol, and white vitriol as messengers; gold and silver as the mother; azurite as the general; and the four yellows as the sovereign. Among the four yellows, none surpasses realgar. Among the three blues, none surpasses azurite. Realgar communicates with the divine; azurite brightens the eyes. The finest method involves steaming the three flowers of *dajiezi*; next, boiling it with lard, which also moistens it, is wondrous. Avoid cold and heat clashing, as this can reduce it to powder.\n\nThe finest cinnabar, when placed with red *guan* and yellow salt, covered and nurtured in a ceramic vessel over fire for ten days, is called *lizhi shenfen*. It can transmute mercury into *zigeng*, soften the five minerals into soft gold, and is also called divine and wondrous. It can further transmute superior *geng* to solidify the spirit. Sulfur, when combined with Tibetan purple vitriol, instantly transmutes mercury into gold. Persian red salt does the same. Without other medicines, both yield supreme treasures.\n\nTo create *geng*, first refine lead and subjugate realgar and mercury, then subjugate the four yellows. Subjugating just realgar and mercury suffices to produce true treasure. Without other medicines, blending these two and combining them like earth and gold, covering them with yellow and red salts, and refining them with clear, gentle fire for fifty days yields *ziguang dan*, which can transmute the five metals. To transmute silver, use azurite and *daizhe*. Subjugating *jingong* can be swiftly achieved with *feishuang tang*; combining *shitingzhi* and *dinüxue* with mercury and silver sand, then nurturing with fire for a hundred days, produces *geng*. Boiling one *jin* each of *huangtong* and *dinü* into a liquid for thirty days preserves their nature. This can also subjugate mercury. When mercury is born of sulfur and refined with the six spirits, it becomes red frost.\n\nFor impure metals, adding *paosha* reveals their authenticity and equalizes their color. *Qilinjie* can also fix color. Millet wine softens; gardenia dyes; *yuganzi* purifies impurities; *daizhe* enhances color and beauty; yellow vitriol can dye all metals, minerals, and cinnabar. When *touzhi* is added a thousand times, it becomes silver, soft as mud. Ingesting it prolongs life, greatly strengthens sinews and bones. Cinnabar refined with *paosha* becomes pure.",
      "overlap_context": "old Powder Method**\nMelt one *liang* of *dui* with five *liang* of mercury. Grind with three *liang* of *diwei* into a paste, place in a crucible, and refine. Wash away the *diwei* and grind the residue into powder for use.\n\n**Refining Yellow Washing Powder Method**\nCombine one *jin* each of *diwei* and yellow fat with one lump of bloom powder. Mix with one *sheng* of coarse ash and refine over fire for ten days to complete.\n\n**Excerpts on Minerals and Metals**\nClarifying Sovereign and Minister.",
      "start_char": 7086,
      "end_char": 8414,
      "start_sentence": 339,
      "end_sentence": 411,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.19564390182495,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\太古土兑经.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "明银汞 铅为九返，汞曰七还。 合呛煮之，六十日如埃尘，又飞如烂银，住还丹。 能入五金，驻红颜，煞三尸，去九虫，能刚其性，柔其物，铅汞相投，其体则刚。 入於五金，其性则柔。 能煞金铅，能呛汞铅。 铅汞相入，亦号七还。 加硫飞之，即号九铅。 令呛九炼，亦号九五七还。 用华池三升。 草西灰二升，五度重淋，淘煮一日。 又猜脂煮三日后倾出讫，又於皂荚灰汁中煮之，令诤，乃可使之。 明黄芽 取九铅七还，和飞成伏盘霜七遍，收取霜和华，搜之浥浥作团，安三台釜上，鼓之如银，亦硬，唯不炬火，能入五金、未堪服食。 更鼓七遍，用子明下，如银铅汞一相入伏火，名之药铅。 又将此药铅重入地下釜烹炼，出黄芽。 将此黄芽和生汞研飞之，上者名日轻举，不上者名日水母。 飞上者，子恋其母，故处其上。 不飞上者，亦母恋其子，故有飞上下之药，用之不别涂也。 太古土兑经卷下竟",
      "translated_text": "Refined Silver Mercury—Lead undergoes nine transformations, while mercury is called the sevenfold return. When combined and boiled with *qiang*, after sixty days it becomes like dust, then sublimated like molten silver, forming the cyclically returning elixir. It can enter the five metals, preserve youthful complexion, slay the Three Corpses, expel the Nine Worms, harden its nature, and soften its substance. When lead and mercury are conjoined, their body becomes hard; when entering the five metals, their nature turns supple. It can subdue gold and lead, and react with mercury and lead. When lead and mercury merge, it is also called the sevenfold return. If sulfur is added and sublimated, it becomes the ninefold lead. When refined nine times with *qiang*, it is also called the nine-five-seven return. Use three *sheng* of *huachi*. Two *sheng* of grass and wood ash, repeatedly leached five times, then decocted for a day. After boiling with *caizhi* for three days, pour it out, then boil it in soapberry ash liquid until purified—only then can it be used.\n\nLuminous Yellow Sprout—Take the ninefold lead and sevenfold return, combine and sublimate them seven times to form subdued frost, then gather the frost and mix it with *hua*, kneading it into moistened balls. Place them in a three-tiered crucible and smelt them until they resemble silver, though hard and unable to withstand fire. They can enter the five metals but are not yet fit for ingestion. Smelt them seven more times, then refine them with *ziming* until silver, lead, and mercury merge and become fire-subdued—this is called medicinal lead. Further refine this medicinal lead in an underground crucible to produce the yellow sprout. Grind this yellow sprout with raw mercury and sublimate it: the portion that rises is called *Light Ascension*, while the portion that does not rise is called *Water Mother*. The rising portion clings to its mother, thus remaining above; the non-rising portion is the mother clinging to its child, hence the division into upper and lower sublimates. Without distinguishing their use, they are applied alike.\n\n*Tai Gu Tu Dui Jing*, Scroll the Lower, concludes.",
      "overlap_context": "ix spirits, it becomes red frost.\n\nFor impure metals, adding *paosha* reveals their authenticity and equalizes their color. *Qilinjie* can also fix color. Millet wine softens; gardenia dyes; *yuganzi* purifies impurities; *daizhe* enhances color and beauty; yellow vitriol can dye all metals, minerals, and cinnabar. When *touzhi* is added a thousand times, it becomes silver, soft as mud. Ingesting it prolongs life, greatly strengthens sinews and bones. Cinnabar refined with *paosha* becomes pure.",
      "start_char": 8415,
      "end_char": 8780,
      "start_sentence": 412,
      "end_sentence": 431,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.017570972442627,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\太古土兑经.txt",
        "category": "众术类"
      }
    }
  ]
}