{
  "source_id": "太极真人敷灵宝紫戒威仪诸经要诀",
  "source_file": "chunked_daozang\\太极真人敷灵宝紫戒威仪诸经要诀.json",
  "total_chunks": 8,
  "total_original_chars": 8933,
  "total_translated_chars": 55163,
  "total_translation_time": 254.31966614723206,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\太极真人敷灵宝紫戒威仪诸经要诀.txt",
    "category": "威仪类"
  },
  "full_translation": "**The Supreme Perfected One’s Essential Precepts on the Ritual Dignity of the Numinous Treasure Purification and Precepts**\n\nThe Supreme Perfected One states: Those who study the Dao of the Perfected Immortals and ascend in broad daylight all take purification and precepts as the foundation for establishing virtue. The *Numinous Treasure Scriptures* contain great methods: the first, third, fifth, seventh, ninth, and eleventh months are the six purification months of the year. The first, eighth, fourteenth, fifteenth, eighteenth, twenty-third, twenty-fourth, twenty-eighth, twenty-ninth, and thirtieth days are the ten purification days of the month. Long purifications and prolonged contemplation are practiced in order to attain the Dao of soaring through the void. Thus, the Supreme Purification of the Numinous Treasure, revered by the August Elder Heavenly Worthy and the Great Sage, is constantly observed without weariness—how much more should Daoists and immortals yearn for it with reverence?\n\nSince ancient times, those who ascend the Dao of immortality must invoke the Most High and teach the essential precepts of purification, precepts, ritual dignity, and regulation. This scripture is profound and wondrous; you must listen with a tranquil mind.\n\nThe Supreme Perfected One states: Upon entering the purification hall, face east. Addressing the incense burner, pray:\n\n*\"August Numinous Treasure Lord Lao, summon the Perfected Officials, the Merit Officers, the Messengers, the Left and Right Dragon-Tiger Direct Attendants, and the Incense-Bearing Messengers to report to the Supreme Three Heavens of the Mysterious Origin of the Great Dao. We now enter stillness, burn incense, and pay homage to the Perfected. May the upright qi of the Ten Directions of the Most High enter our bodies, so that our prayers may be heard at once and ascend before the Jade Emperor’s throne of the True Unity.\"*\n\nNext, kneel lengthily and strike the Heavenly Drum twenty-four times. Respectfully summon from within our bodies the Perfected Officials and Merit Officers of the Five Agents, the Enforcing and Transforming Yin-Yang Merit Officers of the Supreme Three Heavens, the Officers of the Way who Deliver from Disaster and Dispel Calamities, the Lords who Resolve Adversities—twelve each. Summon from our bodies the Governing Lords, the Great Generals who Establish Standards and Oversee Merit, the Front Merit-Reporting and Rear Execution-Commissioning Commanders of the Post Station, the Post Station Assistants, and the Inspecting Envoys of the Four Quarters.\n\nFrom within our bodies, summon two each of the following: the Transcendent Spirits, Direct Messengers, Orthodox Unity Merit Officers, Healing Merit Officers, Left and Right Official Messengers, Yin-Yang Divine Decision Officers, Chariot-Commanding Scarlet Talisman Officers, Gale-Riding Courier Officers, Post-Horse Memorial Officers, and Flying Dragon Riders. Let those summoned don their solemn attire, caps, and pendent tassels, and compose their ritual dignity. The Direct Merit Officers wear the Heaven-Piercing Cap and plain black silk robes. The Orthodox Unity Merit Officers wear the Vermilion Yang Headband and crimson ceremonial robes. The Messengers wear the Nine Virtues Cap, multicolored longevity robes, tiger talisman belts, and hold jade tablets.\n\nThe Direct Merit Officers stand at the four directions, the Orthodox Unity Merit Officers stand at the center, and the Healing Merit Officers guard our bodies. The Left Official Messengers hold standards at the front, the Right Official Messengers bear banners at the rear, the Yang Divine Decision Officers stand to the left, the Yin Divine Decision Officers to the right. The Upper Merit Officers gaze toward the heavens, the Middle Merit Officers survey the eight directions, and the Qi-Urging Merit Officers hasten the Ten Directions’ Official Messengers to encircle our bodies.\n\nThe Gentleman-Officers, Tiger Warriors, Deceit-Detecting Hook Riders, the Directors of the Assembly of Officials, the Heavenly Couriers, Armored Soldiers, Heavenly Ding Warriors, Qi-Gathering and Qi-Consuming Officers, Spirit-Gathering and Spirit-Consuming Officers, Ghost-Gathering and Ghost-Consuming Officers, Evil-Gathering and Evil-Consuming Officers, Essence-Gathering and Essence-Consuming Officers, Poison-Gathering and Poison-Consuming Officers, Talisman-Executing and Shrine-Destroying Officers, Chariot-Commanding Scarlet Talisman Officers, Gale-Riding Courier Officers, Post-Horse Memorial Officers, and Flying Dragon Riders—station themselves around us, front and back, left and right.\n\nOnce the Merit Officers and Messengers have arrayed themselves in solemn attire, they arrange the ceremonial regalia and report to the Numinous Treasure Officials, leading the Perfected Ones who oversee the purification, along with the generals and officers. From the Heavenly Master’s twenty-four established dioceses, the thirty-six sacred retreats, the seventy-two blessed lands, the three hundred sixty-five renowned mountains including Kunlun, the thirty-six thousand spirits of the Upper Palaces, the sun, moon, and constellations, the Jade Armillary Sphere, the Five Emperors of Heaven and Earth, the officials, generals, and officers of the Three Realms, the Two Mysteries, Three Origins, Four Beginnings, and the four cardinal directions’ winds and qi, the Officers of the Celestial Stems and Earthly Branches, the Lords of Summoning and Investigation, the Elder Lords of the Eastern Nine Yi and Hu, the Southern Eight Man and Yue, the Western Six Rong and Di, the Northern Five Di and Qiang, the Central Three Qin and Cang, the Lords of the Five Peaks, Four Waterways, Mounds, and Marshes, the deities of all temples, the spirits of mountains, rivers, streams, valleys, forests, and the Twelve Stream Maidens of Mengchang, the original and fundamental local earth gods, and the officers of the altars of soil and grain—let all don solemn attire at once and, together with the Merit Officers, Messengers, and Flying Dragon Riders from within our bodies, report to the Supreme Boundless Great Dao, the Supreme Lord of the Great Dao, the Supreme Lord Lao, the Supreme Elder, the Boundless Mysterious Elder, the Ten Directions’ Boundless Great Dao, the Heavenly Worthies of the Multitude of Sages of the Dao and Virtue, the Perfected August Emperors, the Heavenly Emperors, the Heavenly Master Lords, the Numinous Treasure Overseers of the Great Dharma of Purification, and all the lords and officials.\n\nWe, born and raised in the world of demons and customs, have sunk into the final age, indulging in pleasure and glory. By karmic conditions of past lives, we have suddenly been awakened and delivered, able to serve the Great Dao. Yet, due to our foolish fondness for the true Dao of ascending as immortals, our accumulated sins are deep, and our bonds remain unbroken. Today, we gather to perform the Supreme Purification of the Numinous Treasure, burning incense and reciting scriptures to seek the fulfillment of our wishes. Let the Merit Officers, Messengers, and Flying Dragon Riders separately report and transmit our prayers upward in due time.\n\nOnce the report is complete, let all return into our bodies and resume their positions in the palaces.\n\nWhen the summons is again issued, proceed as before. After sounding the celestial drum three times in succession, the Immortal Duke declares: This is called the Rite of Initiating the Fast’s Petition.\n\nAt each of the six daily periods, burn incense and direct your prayers solely toward the incense burner, then perform the prostration. Address the incense burner with these sacred words:\n\nIncense Officials and Messengers, Lords of the Left and Right Dragon-Tiger, Bearers of the Fragrant Offering—may this place of fasting and this hall of purification spontaneously generate golden liquid, cinnabar, azure mushrooms, and numinous herbs. May the hundred spirits assemble here before this incense burner, that we may attain the Dao, achieve transcendence as immortals, bring blessing to our households, and bestow grace upon the world.\n\nMay the jade maidens and immortal youths of the ten directions attend the rising incense smoke and transmit our words directly to the golden gates and jade throne of the Most High Jade Emperor.\n\nNext, at each period, those observing the fast kneel in reverence. The fast’s sponsor declares his name: I, So-and-so, Master of Sacrifices and Preceptor, along with my fellow devotees, now burn incense. Taking the incense, he ignites it and offers his prayer. Three incense sticks are burned, and three prayers are uttered.\n\nThe first prayer:\nWe burn this incense, dedicating our bodies, spirits, and lives to the Great Dao. Prostrating ourselves, we dedicate our lives to the Three Venerables of the Most High. May this merit flow to our seven generations of parents, delivering them from the ten sufferings and eight difficulties, ascending to the celestial halls where clothing and sustenance arise naturally, and abiding forever in non-action. Today, we burn incense and take refuge in the virtue of our Preceptors, the Great Sages, and the Perfected. After attaining the Dao, may we ascend into formlessness and unite with the True.\n\nThe Three Venerables are: the Venerable Dao, the Venerable Scriptures, and the Venerable Perfected. The Three Ones are venerated within the human body.\n\nThe second prayer:\nWe burn this incense, dedicating our bodies, spirits, and lives to the Great Dao. Prostrating ourselves, we dedicate our lives to the Three Venerables of the Most High. May this merit flow to the Emperor, the Lords of the Realm, and their ministers. May we, our Dharma-teachers, parents, fellow students, and all worthy Daoists be delivered from the ten sufferings and eight difficulties, preserving their blessed destinies and ultimately entering non-action. Today, we burn incense and take refuge in the virtue of our Preceptors, the Great Sages, and the Perfected. After attaining the Dao, may we ascend into formlessness and unite with the True.\n\nThe third prayer:\nWe burn this incense, dedicating our bodies, spirits, and lives to the Great Dao. Prostrating ourselves, we dedicate our lives to the Three Venerables of the Most High. May this merit flow to our own bodies, granting us immortal deliverance, ascent into non-action, and union with the virtue of the Four Great Ones. May all people under heaven—creeping, flying, and wriggling beings, all sentient life—be delivered from the ten sufferings and eight difficulties, the five poisons, water and fire, bandits, plagues, demonic harms, and all calamities. May each preserve their blessings and emoluments, dwelling in peace and non-action. Today, we burn incense and take refuge in the virtue of our Preceptors, the Great Sages, and the Perfected. After attaining the Dao, may we ascend into formlessness and unite with the True.\n\nDuring each incense-burning period, participants take turns offering incense. One of high virtue is chosen as the fast’s sponsor, known as the Dharma-teacher. It is not necessary for each person to recite the prayers.\n\nWhen the incense-burning and prayers are complete, announce that the offering is finished. All participants turn to the east and bow, declaring:\nWe now dedicate our lives to the Boundless Most High Numinous Treasure Heavenly Worthy of the East, beseeching that our wishes be granted and our desires fulfilled.\n\nNext, turn to the south, then the west, then the north, then the east again, followed by the southeast, southwest, northwest, above, and below. This is called the Ten Directions’ Aspiration. For each direction, perform three prostrations—or one, as previously instructed.\n\nAfterward, face due west and bow twice, declaring:\nWe now dedicate our lives to the Great Sages, the Perfected, and the Venerable Lords of the West who have attained the Dao, beseeching that our wishes be granted.\n\nNext, face north, then east, then south. Turn toward the scriptures and recite the prayers three times as before.\n\nAll these actions are directed toward the incense burner, ensuring proper orientation. This is the Rite of the Ten Directions in the Numinous Treasure Fast, wondrous and profound in the Great Law of the Most High.\n\nAll should proceed with calm and graceful steps, maintaining proper order. Men and women must not intermingle, so that the dignity of the rites accords with celestial statutes. Thus shall they be beheld by gods and spirits, admired by flying immortals, and serve as a model for the Three Realms.\n\nEven immortals practice this fast without ceasing—how much more should ordinary worthies do so.\n\nWhen the prostrations are complete, the participants move in sequence to the left, circumambulating the incense burner three times. At this time, they should chant the *Step Through the Void* and *Tread the Empty Firmament* verses.\n\nThe purpose of circumambulating the incense burner is to emulate the Primordial Root of the Supreme Jade Grotto Heaven, the Seven-Treasure Spontaneous Terrace where the Most High Great Dao Lord resides in the Great Canopy Heaven. There, the supreme Perfected Ones observe the fast, recite scriptures, and circumambulate the Most High’s Seven-Treasure Terrace—this rite follows their example.\n\nMoreover, all disciples of the Three Caverns who practice fasting should burn incense and chant hymns, emulating the Perfected Ones and Great Sages as they circumambulate the terrace of the Most High Dao Lord.\n\nThose who seek the Supreme Orthodox and True Great Dao may also circumambulate the high seat of the *Highest Clarity Numinous Treasure Scriptures*.\n\nThe reason for circumambulating the incense burner is that worldly scholars are often superficial and unable to receive the supreme scriptures. Thus, the fast’s method is demonstrated through the sincerity of the incense smoke. Where the heart’s devotion reaches, the incense smoke follows, ascending to the Most High. The Dao-eye of the Most High ever perceives the good and evil of all under heaven, leaving nothing unobserved. How can one not tremble with reverence?\n\nThe Immortal Duke says: Always visualize the Most High Perfected Ones upon the high seat, turning the scriptures and expounding the Dharma.\n\n**Method for Turning the Scriptures**\nSet up a small platform facing east for the recitation and transmission of scriptures. According to the Numinous Treasure method, the platform should be five feet high, five feet wide, and five feet long.\n\nAlternatively: the platform should be four feet five inches high, five feet wide, and five feet long.\n\nA quiet chamber may suffice for a temporary retreat, serving as a provisional space for the observance of the fast on the appointed day. Yet if one seeks to maintain a perpetual fast and aspire to the immortal Dao over time, a separate hall for fasting should be established—immaculate, serene, and solemn—where scripture tables, incense burners, and a high seat are arranged within. Then, facing the high seat, bow three times in full prostration and declare:\n\n*\"We now take refuge in the Most High, the Boundless and Supreme Dao, the Perfected Ones; in the thirty-six divisions of the sacred scriptures and talismanic seals; and in the Three Supreme Ones of the Most High. As we burn incense and turn the scriptures, we reverently beseech the grace of the Most High to deliver us. We pray for the liberation of our seven generations of ancestors, for emperors and common folk, for all sentient beings, and for ourselves and our households—great and small—hoping to be absolved of the grave sins and transgressions of past and present lives. These may include: regicide or patricide; disobedience to parents; betrayal of teachers or deceit toward friends; forsaking truth for falsehood; banditry or the invasion of kingdoms; the slaughter of other nations; the killing of beings for pleasure; adultery or illicit relations within clans; the severing of mother and child or the seizure of another’s beloved; the murder of sages or Daoist priests; tyranny as a ruler or disloyalty as a minister; oppressing subordinates and cruelly abusing the people while seeking personal glory; the mutual destruction of kin; the desecration of sacred halls or altars; the theft or burning of scriptures; the defilement of sacred texts; the mockery of the Dao and virtue as mere delusion; the ridicule of others’ good deeds while claiming superiority; envy of the worthy and resentment of those more capable; the failure to honor the virtuous, respect the elderly, or care for the six afflictions; cursing the wind and rain, or reviling heaven and earth, the sun and moon, stars and constellations, emperors and lords, teachers and Daoist priests; contempt for the Four Great Elements; blasphemy against spirits and gods, dismissing them as ignorant; or hypocrisy—speaking one thing while thinking another, deceiving even one’s own shadow. Such sins, too numerous to recall, accumulate across lifetimes, binding us inextricably, perpetuating karmic grievances without end. We now burn incense and perform the Dao, seeking self-deliverance. Henceforth, we repent and submit to the precepts, vowing never to transgress again. Whatever sins we confess, we prostrate ourselves fully, hearts filled with joy. Thus, the sages will surely release us from the eight sufferings and all hardships, guiding us to the realm of non-action and the Dao.\"*\n\nThe Perfected One of the Great Ultimate says: *\"In the Numinous Treasure fast, ten lamps are lit to correspond to the ten directions. Ten is the supreme number, for humans are born after ten months. Light lamps beside the door. For the seven generations of ancestors, light seven lamps before the hall; in the quiet chamber, keep one lamp always lit; and place two lamps beside the door. Where talismans are affixed to the door and gate, spirits and demons strike at people—how could they not enter through the door? The Six Divisions of Heavenly Envoys constantly descend to patrol the world, observing the good and evil of humanity. When spirits and demons see the talismans and lamps, they say, ‘This is the gate of a virtuous person—we cannot act wantonly here.’ Thus, distinctions are made, and the living and dead receive their due blessings.\"*\n\nFor the sun, moon, stars, constellations, the patient’s year of fate, and their natal destiny, each is honored with a lamp. During the fast, incense is burned and repentance offered at dawn, noon, and dusk—three times daily—with wholehearted devotion to receiving the profound mysteries of the scriptures and the Dharma. The turning of scriptures and expounding of the Dharma mirror the teachings of the ancient Perfected Ones. The sages transmitted these scriptures to instruct later generations, that the unheard might hear and the unknowing might know. Through this Dharma-bridge, all beings are universally delivered.\n\nDuring the performance of the Dao, no idle chatter or discussion of worldly affairs is permitted. One may only inquire of the Dharma-master regarding the meaning of the scriptures and precepts, and the master shall elucidate the true essentials. If one maintains inner and outer composure and reverently receives even a single sentence of the scriptures, the Registrar of Destiny adds ten years to their lifespan. But if one is restless within and without and disparages even a single sentence, the Registrar deducts ten years. Thus, the Perfected Ones do not speak idly; their words always strike the mark. Their words establish the Dharma, for it is people who uphold the Dao, not the Dao that upholds people. This is the meaning.\n\nThe Immortal Duke says: *\"The Great Fast, when combined with the Cavern Realms, enables the seven generations of ancestors to escape hell and ascend to heaven. If a participant in the fast engages in frivolous speech or vulgar discourse, they shall be penalized with one *jin* of incense, five *sheng* of oil, and three *liang* of cinnabar. These are to be offered to the host of the fast and distributed to the people, then used for public purposes. The fast is the foundation of seeking the Dao—none achieve it without this practice. Its merit is towering, beyond compare. Above, it leads to immortality and the attainment of the Dao; in the middle, it brings peace to the nation, prolongs life, and secures blessings and prosperity, attaining the Dao of non-action; below, it eradicates past sins, absolves present transgressions, rescues those in peril, dispels disasters, cures illnesses, liberates the dead from suffering, and delivers all beings—nothing is beyond its efficacy. After a thousand days of practicing the Dao with a heart devoted to the mysterious, one will surely summon Perfected Ones, behold the sacred, and attain the Dao.\"*\n\nDay and night, bow six times in the six periods; in three of these, expound the scriptures, and in the other three, meditate on the gods within the body.\n\nThe Perfected One of the Great Ultimate says: *\"When a worthy person suffers misfortune or illness, Daoist priests should establish a Numinous Treasure fast, turn the scriptures, burn incense, repent of sins, and pray for longevity, with the duration determined by their intent. The host must devote themselves wholeheartedly, both inwardly and outwardly, in faith and reverence, offering the master a modest amount of incense, oil, cinnabar, and paper as tokens of utmost sincerity, demonstrating their unwavering commitment. If the person is frivolous and superficial, this great Dharma must not be recklessly performed. The great Dharma is subtle and profound—it is not the domain of the shallow. Only those with a deep love for the refined, an affinity for the mysterious, and a reverence for the profound can truly uphold it.\"*\n\nThe Perfected One of the Great Ultimate says: *\"During the Numinous Treasure fast, the Most High Perfected Ones, the Great Sages of the Ten Directions, the Heavenly Emperors and Kings, and the flying immortals—numbering in the thousands of millions, beyond count—arrive with a thousand chariots and ten thousand riders. Their jeweled canopies gleam resplendently; flying flowers scatter like snow; incense smoke drifts like clouds; the ten sacred banners flutter in the wind; their harmonious songs and whistles fill the air; phoenixes sing in unison; ten thousand dragons draw their chariots, soaring through the sky in grand procession. They come to witness and listen to the performance of the Dao.\"*\n\nThe heavens and humans rejoice, ghosts and spirits praise its goodness, demon kings clasp their hands in reverence, delighting in the great Dharma. The myriad sages of the Three Realms and the Great Thousand Worlds together sigh in admiration. The spirits guarding every place stand watch at the gates, all protecting the practitioner—none dare act with malice or defiance.\n\nWhen reciting the scriptural verses, all must wholeheartedly exclaim, *\"Excellent! Excellent!\"* The demon kings shall issue proclamations, saying: *\"These virtuous and worthy Daoists of non-action possess towering merit, revered by the Great Sages. We must each protect them, erasing their names from the registers of death under the Three Officials of Mount Tai. Thus shall they ascend to heaven in broad daylight, their seven generations of ancestors receive blessings, return to the celestial halls as reborn spirits, and their own bodies forever preserve the steadfast blessings of kalpas.\"*\n\nThe Perfected One of the Great Ultimate says: *\"Kings and nobles enjoy their wealth and nobility due to the accumulated blessings of past lives, their talents and wisdom refined, their merit and virtue fulfilled. Only then do they come to favor the Dao—this is because their past transgressions have been exhausted. When past transgressions are exhausted, such a person will naturally devote themselves to fasting and abstinence, studying the great scriptures and great Dharma, and thus draw near to immortality. If they cultivate the precepts without negligence, they shall attain the rank of Upper Immortal. Daoists who delight in fasting are all those whose past transgressions have been exhausted. If past transgressions remain unexhausted, they will ultimately have no affinity for it. Such a one remains far from the sages and immortals. Those who study the Dao of immortality seek long life and enduring vision, to enjoy boundless kalpas, secure their ancestral temples, prosper their clans, deliver their seven generations of parents from suffering and peril, ascend to the celestial halls, and in later generations produce wise and enlightened descendants—let them receive the true texts of the Numinous Treasure. By practicing this fast, they shall attain this great blessing. The greatest blessing is to deliver others first; thus, one puts others before oneself, forgets both dependence and opposition, and forgets even what is to be forgotten, aligning one’s will with the mysterious. The superior person, upon hearing the Dao, diligently practices it; the middling person wavers between belief and doubt; the inferior person laughs at the Dao.\"*\n\nThe Perfected One of the Great Ultimate says: *\"To move heaven and earth, summon the host of spirits, penetrate the Dao of immortality, fathom the utmost truth, dissolve the sins of past lives, dispel misfortune, repel vengeful foes, cultivate abundant virtue, cure illnesses, and aid all beings—nothing is closer than the practice of fasting in stillness and reciting the scriptures. We have heard of such words in ancient times, yet rarely see such people today.\"*\n\nThe Perfected One of the Great Ultimate says: *\"Those worthy ones who wish to cultivate the great Dharma of non-action may recite this scripture, as well as the transmitted texts of the various Perfected Ones—all are excellent. Yet the *Five Thousand Character Scripture of the Dao and Its Virtue* is the supreme, unsurpassed, and perfectly true great scripture. It encompasses the vast without omission and penetrates the minute without exception—it is the great foundation of the Dao and its virtue. Surveying all those Perfected Ones who have attained the Dao, none have not studied the *Five Thousand Character Scripture*. Yin Xi, Song Xian, and their like are examples. This is what is called the scripture of the Great Vehicle. Furthermore, the *Thirty-Nine Chapters of the Great Cavern True Scripture* must not be recited among ordinary people. The reason is that it is the scripture of the subtle ascent of the true Dao. When it is chanted, the Heavenly Emperors and Kings descend to welcome the practitioner, scattering incense and flowers; the officials and attendants of the Six Heavenly Demon Kings rejoice and come to bow in submission, ready to serve. The spirits of mountains and seas will all be at one’s command. Even a single verse chanted invokes the heavens to perform rites—how much more so for ghosts and spirits! Thus, it must not be recklessly practiced among ordinary people.\"*\n\nThe Numinous Treasure scriptures are the supreme scriptures of the Daoist tradition, the mysterious foundation of the Great Vehicle, possessing ranks of reverence both high and low. The Perfected Ones of the Ten Directions who have attained the Dao constantly perform rites before them, burning incense and scattering flowers—this is the root and truth of all Daoist practices. When Daoists revere the Numinous Treasure, prostrating in fasting and abstinence, and cultivate it according to the methods, all shall attain the Dao—how could it be otherwise? If this scripture cannot lead one toward long life, ascension as an immortal, and deliverance from the world, then there are no immortals under heaven and earth. The key lies in extinguishing external distractions and inwardly focusing on the mysterious truth—only then can one soar beyond the Milky Way and preserve long life.\n\nThe *Five Thousand Character Scripture* gathers and harmonizes the myriad wonders, its great return being equal to all others—yet it surpasses all worldly practices. All fasting methods ultimately trace their origin to the fundamental fast of the Numinous Treasure.\n\nThe Immortal Duke says: *\"This great fast is the path of the Upper Immortals, by which the seven generations of ancestors are released from the nets of karma, ascend to the Great Mystery Palace, and the practitioner’s body first obtains the Five Mushrooms resembling hibiscus. The Five Mushrooms also grow naturally.\"*\n\nThe Perfected One of the Great Ultimate says: *\"The *Five Thousand Character Scripture* follows the transmission protocols of the immortals, originally sharing the same requirements as the Numinous Treasure. For those of exceptional talent and aspiration who seek the Dao of spontaneous flight as an immortal, they must prepare the ritual offerings: five thousand feet of silk and written pledges, presented simultaneously with the Numinous Treasure scriptures. They shall receive them atop a named mountain peak. The master stands facing south, the disciple facing north, bowing three times. Each breaks a gold ring in half, wearing one piece while receiving the scriptures. Afterward, the disciple bows once more, beginning from the north and circumambulating the ten directions. When reciting the scriptures, one must first bow to the ten directions—this is the method. It is an ancient protocol of the Great Mystery Capital. You must now clearly understand it and transmit it to worthy descendants in later generations according to the method. The oral instructions of the Most High should be kept secret. You should constantly contemplate the Void-and-None Perfected One, the Supreme Great Dharma King, the Worthy One of the Great Thousand Vehicles, known in the world as Laozi. Laozi is the great Dharma master within the mysterious. With the eye of the Dao, he observes the good and evil of all heavenly beings. You must propagate this Dao, and you shall surely become a flying immortal. On the day you attain the wondrous, you will know that this scripture is not false. Resplendent are the writings of the Cavernous Silence—here lies the essence of the Great Dao.\"*\n\nThe Immortal Duke says: *\"In the world, those of lofty virtue who wish to recite the scriptures in pursuit of ascension as immortals should receive the Numinous Treasure and the *Five Thousand Character Scripture* simultaneously. The ritual offerings are the pledges of devotion to the scriptures. Thus it is said: 'Without leaving one’s door or window, one may know the Dao of heaven'—this is what it means. Such people will be rare in the world. Those who wish to discourse on emptiness and transcendence, holding themselves above their age, need not follow this method of transmission. The Perfected Ones teach only to those who seek immortality. Daoists who study these texts to attain immortality yet do not receive them from a master will find the Dao unfulfilled.\"*\n\nThe Perfected of the Great Ultimate says: *\"The Perfected embody the Dao in emptiness and nothingness, fearing nothing. The defilements of the mundane world concern only the sages, who grieve for the souls and spirits of the people. When one encounters filth and impurity without bathing in fragrant waters, illness and harm befall them—this is to teach the people the distinction between purity and pollution. The way of ghosts and spirits is doubly prone to defilement; when defiled, their power ceases. Even gold cannot withstand corruption and decay—how much less the supreme Dao? The great methods and true Dao are inherently free from defilement.\"*\n\nThe Perfected of the Great Ultimate says: *\"When people encounter defilement, regardless of its magnitude, they should immediately perform the rite of release. Afterward, they must burn incense and perform the Dao-circuits, with no fixed time limit.\"*\n\nThe Perfected of the Great Ultimate says: *\"The meals offered to the worthy and the blessings of the feast have their allotted numbers. Visiting guests should also partake first. When the Perfected of Orthodox Unity, the Three Heavens’ Dharma Master, was about to ascend to heaven, he saw the people impoverished and suffering, so he reduced the number of offerings, sometimes preparing meals for ten. If more than ten guests arrived unexpectedly, there would be nothing to offer them. If the feast were not fully shared, even one person left unserved would mean the blessing was not universal. Thus, the ritual was established so that once all matters were complete, the remaining food would be distributed to all people and beings, thereby praying for the host’s fortune. Later generations, unaware of this, are now instructed in it. Wine should not be entirely forbidden but regulated in quantity, adjusted according to the number of people, without enforcing strict limits. As the worldly teaching says: ‘Only with wine is there no measure—yet it must not lead to disorder.’ Excessive wine muddles the upright qi and drives the Three Perfected from their palaces; thus, one must not overindulge, and officials should examine this—prudence is essential.\"*\n\nThe Perfected of the Great Ultimate says: *\"There are those who do not study the Dao. When they hear Daoists discourse on the profound and abstruse meanings of the supreme scriptures—vast and far-reaching principles—they do not believe or apply them. Instead, they slander the sacred texts as false and absurd, dismissing the scriptural teachings as mere fabrication, unworthy of study. Having no faith themselves, they envy others who study the scriptures and the methods of nurturing life, claiming all of it to be untrue. Such people, in their past lives, formed no karmic ties with the immortals and sages, nor did they cultivate connections with the worthy. In this life, they lack great wisdom and thus cannot partake in the profound resonance of the sages. They reject the teachings of the supreme Dao and scriptures, preferring to study the arts of shamans and miscellaneous, inauthentic texts. When they gather, they prioritize wine and meat, their words contradicting their hearts. They deceive and attack one another, indulging in lust and desire, following their whims without restraint, insatiable in their cravings. Some even take on the role of teachers, yet harbor no intention of teaching goodness. They bully the weak, constantly seeking to indulge their cruel impulses. Their minds are filled with greed, jealousy, slander, harm, lewdness, theft, deceit, and treachery—violent, perverse, and rebellious. Such people embody the ten evils in their conduct. How can one know that such individuals, despite their actions, do not fall into the net of retribution and live in apparent peace? There are others who have never transgressed the law, always following the scriptural teachings, yet suffer hardship and distress. When a person dies, their body decays, but their soul and spirit endure, facing consequences based on the good and evil of their past deeds. Thus, when people commit evil, act perversely, or even murder their rulers or fathers—heinous and unparalleled crimes—yet do not immediately face judgment, it is because they are still drawing on the blessings of past lives. When those blessings are exhausted, their sins will arrive. In life, they may be punished by the authorities; in death, they enter hell, enduring unspeakable torments. If good people do not see their rewards in this life, it is because their past sins are not yet exhausted. Once they are, blessings will come: they may achieve high status in this life, be reborn into the families of kings or nobles, ascend to heaven, or become spirits. Evil follows evil, and good follows good—this is the root of destiny. Those who study the Dao should understand this. If one studies the Dao until death yet fails to attain it, it is because their merit and virtue are incomplete, and their past karmic ties are weak. There is no one in later generations who does not rely on this merit to achieve immortality and transcendence. If one studies the Dao for several years and then expects to ascend as an immortal, yet falters midway, grows lazy, or succumbs to worldly desires, they will revert to the common flow. Their body will perish, their name will fade, and they will be trapped in the cycle of death, enduring endless suffering. They may lose their human form, departing from the human realm without hope of return. Some are born with innate intelligence yet do not teach or transform others, leaving later generations ignorant and foolish. Even slaves and servants have no fixed nature—they are repaying debts from past lives when they deceived and took from others, now serving as labor to compensate. The six livestock are repaid with their flesh. When people do not believe in the Daoist scriptures, doubting the true teachings, they will suffer these cruel fates—how tragic! If a Daoist encounters evil while practicing goodness, yet endures with patience and steadfastness, upholding these precepts and laws, they will preserve their present merit. To remain steadfast in adversity without transgressing the Dao—this is the mark of a Daoist. In life and death, they will dwell in the households of kings and nobles. If you attain the Dao in this way, you will naturally perceive the roots of your past lives. It is because you practiced great generosity and studied the Dao tirelessly in former lives that you now achieve immortality.\"*\n\nThe Perfected Lord of the Left says: *\"Strive diligently, for there has never been one who attained immortality without study. The key to studying immortality lies in exhausting the heart-mind. If the heart-mind is not exhausted, that is why one studies yet fails to attain. The sages do not deceive.\"*\n\nThe Perfected of the Great Ultimate says: *\"Those who serve as Libationers must uphold the One Hundred and Eighty Great Precepts of Lord Lao. Only then can they be called Libationers. Thus, it is said: ‘Without receiving the great precepts, one may not accept the bows of the people or disciples.’ Those who receive these precepts must hold them in their hearts and practice them—only then do they become Libationers. Libationers must sever distracting thoughts, abandon all evils, and diligently practice the precepts. Such is the way. The wondrous Dao of the Yellow and the Old is the method for examining the seeds of humanity. Among ten thousand, perhaps one or two are genuine.\"*\n\nThe Perfected of the Great Ultimate says: *\"If a scholar can cast aside worldly burdens and aspire to wander among mountains and rivers, upholding the Dharma-wheel of the Supreme Ultimate, they may be called a Master. They should sit upon a high seat to recite the scriptures, teaching and transforming the foolish and the wise, guiding and delivering all who seek to learn.\"*\n\nShould one’s natal sign be yín or mǎo, belonging to the two celestial stems of the East, they shall be called Master of the Eastern Marchmount. The other three directions follow this precedent. Those born under chén-xū or chǒu-wèi shall be called Master of the Central Marchmount. If one further possesses pure perfection and utmost virtue, and can penetrate the mysteries of the profound, their disciples and fellow students may address them as Such-and-Such Master. If one delves deeply and reaches far, their talent and learning profound and penetrating, their aspiration fixed upon the Great Vehicle, they shall be called Master of the Profound, or Master of Wandering the Profound, or Master of Far Wandering, or Master of Propagating the Dao, or Master of Expounding the Profound. Such titles are but brief examples and cannot be exhaustively listed. When the world produces such a person, scholars shall address them accordingly. The general principle is thus.\n\nTo speak of the name \"Upper Clarity\" requires seven days of pure fasting. The rank of Master is weighty and must not be claimed lightly; ghosts and spirits will not acknowledge one who does so, for Heaven examines all people. The Master is a Daoist. One who studies the Dao of immortality and achieves it is called a Perfected. One who embodies the great Dharma of the Dao is called a Perfected.\n\nThe Perfected of the Great Ultimate says: *\"Those who observe the world as Daoists are rare—those who desire to fast, recite scriptures, seek enlightened teachers to receive and study them, inquire into the principles, and faithfully practice them. Most are frivolous and shallow, their hearts attached to sensual pleasures, their aspirations lacking in true refinement, fond of studying the lesser vehicles. Even if one person desires to fast and study the Dao, there is often no enlightened teacher to encourage and guide them. Though their aspiration lies in the Dao of immortality, seeking to deliver all people, people instead ridicule them, saying: ‘Such useless pursuits! I have never seen many study this way. The scriptures are full of empty and deceptive words. It is not as good as our methods, which can dispel calamities and disperse misfortunes.’ The deaf do not hear the music of Sháo and Wǔ; the blind do not see black and white. How can they claim their own affliction is not a malady? Thus the great Dao is not practiced, the true Dharma does not flourish, the authentic scriptures lie dormant, and perverse and heretical teachings daily increase. Each claims to be a Lady of the Three Palaces, and chaos of demonic delusion arises. The people abandon the true and pursue the false. All this stems from teachers who do not diligently study and thus fail to encourage their disciples to learn the orthodox scriptures and the orthodox Dharma. If the true and orthodox reside in one’s heart, demonic influences will be far removed. Without knowing the great meaning of the supreme scriptures, there is no way to restrain one’s heart. Demonic and ghostly qi enter the heart and stir it to action, leading the mind to every kind of excess. It is like embracing a stone to cross a great river—how could it not be so?\"*\n\nThe Perfected of the Great Ultimate says: *\"Zhuāng Zhōu was the Celestial Immortal Nán Huá of the Supreme. In a former life, when he studied the Dao, he vowed: ‘When I attain the Dao and achieve immortality, my talent and wisdom shall be penetrating and far-reaching. I shall appear in the world among people to expound the* Dàodéjīng *of five thousand characters and propagate the meaning of the Dao.’ Huìzǐ was his disciple, who at that time also said: ‘If the Master attains the Dao and gains freedom in action and stillness, this disciple wishes to attend and follow, to chant and praise the subtle words, to penetrate the profound essence, to gaze deeply into the source of the Dao, and to unravel the snares of the world. I shall examine the competitive and ostentatious hearts of worldly people and guide them with the gateway of naturalness.’ Thus, ‘profound and yet again profound’ is the gateway to all wonders. Later, both achieved their vows, and their writings all conveyed the meaning of the Dao. Yet people today do not know they were Perfected Immortals. They take Zhuāngzǐ’s works as mere allegories. The Great Peng, the Great Tree, and the Dark Spirit are all records of actual things, not empty fabrications. Where things are vast, such great beings arise. In the present day, in the gardens of Làng, on Kūnlún, in Pénglái, and in the Northern Sea, such divine creatures all exist. Where things are small, small beings arise. If one insists that only what the eye sees is real and what it does not see is nonexistent, then much of what exists in the world would be denied. In the parables of Daoist scriptures, when speaking of the vastness of kalpas, there is a stone as large as Mount Kūnlún and a mustard seed within a forty-*lǐ* expanse. Heavenly beings in gauze robes brush this stone once every hundred years, and when the stone is worn away, it is like the end of a kalpa. Who could believe in such vast durations?*\n\n*The* Língbǎo Sūtras *are the root of all scriptures, difficult to express in words. The five thousand characters of the* Dàodéjīng *are subtle and wondrous, and the great meaning of all scriptures ultimately returns to one. The thirty-nine chapters of the* Dòngzhēn *are spoken by thirty-nine Perfected. They are the scriptures of non-birth. These Perfected transmitted them forth. Their virtue, power, and true qi blend and transform naturally into Perfected, peers of Lǎozǐ. They have traversed endless kalpas, not as those who merely study the Dao. Unless one has accumulated profound merit and virtue from past lives, one who obtains the* Dòngzhēn *scriptures cannot comprehend their meaning. What they describe are the natural palaces of the Three Supreme Heavens and the myriad things of mountains and rivers. Though the names of these mountains, rivers, and things may coincide with those of the world, they are not the mountains, rivers, and things of this world. They are all natural entities, audible but difficult to distinguish. The* Dòngzhēn Yùqīng Sūtra *briefly explains their meaning, but cannot exhaust the details—how could they be grasped by mere thought? Those who uphold them gain great fortune, attain longevity, and ensure the peace of their ancestral temples. Those who recite them become kings among Perfected, for their Dao is supreme. In the past, those who attained the Dao of the highest immortality and utmost Perfection all upheld the* Língbǎo Sūtras. *The Three Heavens call them immortals; the Brahmā Heaven calls them Daoists. Heaven and Earth have their ends and beginnings, thus there are great and small kalpas, and all scriptures perish with them. Later sages will produce new Dharmas, but only the five thousand characters of the* Dàodéjīng*, the* Dòngzhēn *scriptures, and the* Língbǎo *are imperishable and endless, transmitted without end. Thus they are called the scriptures of non-birth, the kings of all scriptures. Therefore, those who teach and transform in each generation to achieve the Dao of immortality do not know their source in past lives. Vast and majestic, they are not seen by ghosts and spirits. Only the great demon kings of the Six Heavens come to honor the scripture masters, while the celestial officials of the Three Supreme Heavens oversee and inspect them. This is not something lesser immortals can hear of; only the Perfected can study it. Yet people today do not know that Daoists are immortals, and say that immortals are not Daoists—all because their karmic conditions from past lives are not yet exhausted.\"*\n\nWhen one’s karmic conditions are exhausted, one naturally attains profound understanding and great wisdom, clearly perceiving all—this is knowing, and knowing is attaining the Dao. The *Five Thousand Characters* is most difficult to comprehend, yet those who know it know it fully. Thus it is said: one must grasp the supreme great wisdom.\n\nThe Perfected of the Great Ultimate says: In establishing the *Língbǎo* fast, those of lofty virtue and profound understanding of the scriptures’ meaning are appointed as Dharma Masters. Next are those of keen intelligence and penetrating insight, able to fathom the subtle principles and comprehend the precepts—they serve as Chief Reciters. Then come the Fast Overseers, who correct and penalize improper conduct. Following them are the Scripture Attendants, Incense Attendants, and Lamp Attendants, each with their designated seating. Those who first receive this scripture hold the highest rank; those who receive it later hold a lower one. If one person in a household receives the scripture, others in the family who wish to observe the fast may do so. If at any time a Yellow-Red Grand Unity Libationer, fond of witnessing the fast’s rites, wishes to attend, they may observe the great Dharma transformation—but may not sit on the same platform. Even those of the utmost virtue, renowned in the world, must take their place behind, following the order of their register’s rank. The same applies to the burning of incense. The reason for this is that such individuals have subtle karmic affinities from past lives, and thus are now permitted to participate.\n\nThe Perfected of the Great Ultimate says: During the fast, one’s heart must be fixed on the mysterious and true, with no extraneous thoughts. Direct your thoughts to the Dharma Master, first envisioning the Three Ones residing in their palaces, settled in clarity, with the three *hún* and seven *pò* fully present, and the Grand Unity stationed in the *níwán* within the head, as in the *Huífēng Dìyī* method. Then, together with the initiate, observe the fast and listen to the scripture, receiving it with the mouth while contemplating it with the heart. Thus the Three Corpses flee, perverse *qi* is extinguished, and one receives the true both internally and externally—such is nearness to immortality. Additionally, practice exhalation and inhalation, guide and harmonize the fluids, and cultivate all the sublime Daoist arts. Then the celestial perfected will surely descend upon you. The superior adept attains the Dao within the chamber. Even if dwelling in mountain caves, if the slightest extraneous thought persists, one’s efforts are in vain, labor and strength wasted. In learning the Dao, only the heart’s exhaustion matters—when the heart is exhausted, the immortals will immediately observe and test you. You would do well to examine this carefully.\n\nThe Perfected of the Great Ultimate says: If a Daoist retreats far from human traces, dwelling in seclusion on a famous mountain, observing a perpetual fast and residing alone in a secluded valley, there is no need to select a Dharma Master—only the heart and mouth converse. For those observing the fast in the world, Daoists who consume the five grains may simply abstain from other foods; if taking medicinal substances, they should do so precisely at noon. After noon, they may drink clear liquids but abstain from solid food. At dawn, they may take congee, and at midday, vegetable fare. When the fast’s term concludes, the breaking of the fast should resemble the preparation of a grand feast, with utmost purity. Seasonal fruits should be offered first, accompanied by incense and prayers, wishing the fast’s sponsor to ascend as an immortal and transcend the world.\n\nThe Perfected of the Great Ultimate says: The way of the fast entails constantly cultivating ten virtuous thoughts:\nFirst, for the Dao, contemplate the four great elements, so that the seven generations of one’s parents may be freed from suffering, ascend to the celestial halls, and enjoy natural sustenance.\nSecond, contemplate the flourishing of the Dao’s transformation under the emperor and rulers, with schools thriving, imperial teachings vast, and majestic rites resplendent, admired by all under heaven. May the people praise great peace, the six barbarians submit, evil daily diminish, and sages daily increase.\nThird, contemplate the Dharma Master’s great merit, that their teachings may be luminous and all attain flying immortality.\nFourth, contemplate fellow learners of the Dao, that they may swiftly attain immortality and mutually guide one another.\nFifth, contemplate harmonious kinship, esteeming benevolence and righteousness, valuing the Dao and despising wealth, serving as models for all.\nSixth, contemplate selflessly bestowing alms upon Daoists and the hungry and cold, so that all people under heaven may find their rightful place.\nSeventh, contemplate all crawling and creeping beings, that all sentient life may attain fulfillment.\nEighth, contemplate repenting and making amends for the transgressions of past and present lives, establishing merit to compensate for faults.\nNinth, contemplate the prosperity of the family line, with ancestral temples maintained and worthy descendants born in every generation.\nTenth, contemplate reverently receiving the master’s scripture without negligence, maintaining equanimity and single-mindedness to broadly deliver all beings. May my own body ascend as an immortal, ascend to heaven in broad daylight, pay homage to the Most High, eternally become a Perfected, partake of the five-colored numinous fluid, and merge with the Dao.\n\nMaster Zhèng says: When ascending the mountain to receive the scripture, there is no need to present a memorial—simply make an oral petition. The ode states:\nThe Dao takes the fast as foremost,\nDiligently practiced, one ascends the golden towers.\nThus is the great Dharma bridge established,\nUniversally delivering all beings.\nRepaying the kindness of past lives,\nThe heart of the Dao arises transcendent.\nThe body soars to the Mysterious Capital,\nAnd the seven ancestors are all liberated.\nUpon completion of the transmission, this text must be recited.\n\nMaster Zhèng of Nányuè says: My former master, the Immortal Lord, always kept this book secret, transmitting it only to the utmost Perfected—its value surpasses ten thousand gold. Immortals passed it down orally, and now it is recorded here. The Immortal Lord said: Copy one version to seal and return to a famous mountain, transmit one to a disciple, and entrust one to descendants in the family line, to be recorded and transmitted through generations by those who know the Dao. It should be transmitted together with the original *Língbǎo* scripture—this is the essential subtlety of the Daoist tradition.\n\nBàopǔzǐ says: My humble opinion is that for grand fasts lasting many days, whether for nobles or Daoists, those with inherently frail constitutions may find it difficult to perform the six daily periods of bowing. I suggest that during the day, at the three periods, one may burn incense and bow, while at night, it may be omitted—engaging instead in the recitation of Dharma teachings. Those capable of burning incense during all six periods should naturally uphold the full rite. But for those who have not yet attained the Dao and whose strength is weak, even observing the fast for a single day and night—practicing the Dao during the six periods—is sufficient. Learners would do well to consider and apply this carefully. When establishing the fast, one may eat dried jujubes and dried venison—these are raw and fresh foods, and no other offerings may be made. For those who are not mountain-dwelling Daoists but study the scriptures at home, how can they maintain a perpetual fast and prolonged contemplation? They should observe the fast as appropriate, for at least ten, nine, seven, three, or one day, practicing the Dao. Such merit is vast and universal, the supreme method of learning the Dao. The seven ancestors are freed from suffering, ascend to the halls of blessing—this may be called the way of utmost filial piety.\n\nThe utmost of filial piety and fraternal duty reaches the divine spirits, extending far to the seven mysteries—how could it be limited to one’s ancestors alone? Thus, the perfected immortals keep this secret. The Supreme Ultimate Perfected One expounded the essential precepts of the *Numinous Treasure* fasts, precepts, and ritual decorum across the various scriptures—here concludes the text.\n\n*[Note: \"Five thousand feet\" appears to be a scribal error; it should likely read \"fifty feet.\"]*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太极真人敷灵宝斋戒威仪诸经要诀 经名：太极真人敷灵宝齐戒威仪诸经要诀。 撰人不详，约出於东晋。 系古《灵宝经》之一。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 太极真人敷灵宝斋戒威仪诸经要诀 太极真人曰：夫学真仙白日飞升之道，皆以斋戒为立德之本矣。 灵宝经有大法，正月、三月、五月、七月、九月、十一月，是岁六斋月。 一日、八日、十四日、十五日、十八日、二十三日、二十四日、二十八日、二十九日、三十日，名为月十斋。 长斋久思，以期凌虚之道也。 故灵宝无上斋，皇老天尊大圣，常奉修不倦，而况道士仙人，可不翘慕之乎。 由来仙道之上，要请奉太上，教敷斋戒威仪节度口诀。 此经幽妙，子静心谛听焉。 太极真人曰：入斋堂，东向。 向香炉祝曰： 太上灵宝老君，当召真官功曹使者、左右龙虎直符捧香使者，关启无上 三天玄元大道，臣等正尔入静，烧香朝真，愿得太上十方正气，来入臣等身中，所启时闻，径御真一玉皇几前。 次长跪，鸣天鼓二十四通。 谨出臣等身中五体真官功曹吏、出臣等身中无上三天执法开化阴阳功曹、度道消灾散祸解厄君吏，各十二人。 出臣身治职君吏、治中建节监功大将军、前部效功后部效杀驿庭令、驿庭丞、四部监功谒者。 臣等身中仙灵、直使、正一功曹、治病功曹、左右官使者、阴阳神决吏、科车赤符吏、刚风骑置吏、驿马上章吏、飞龙骑吏等，各二人出。 出者严装显服，冠带垂缨，整其威仪。 直使功曹戴通天之冠，衣皂纨单衣。 正一功曹冠朱阳之帻，绛章单衣。 使者冠九德之冠，五色寿命单衣，腰带虎符，齐执玉板。 直使功曹住立四方，正一功曹住立中央，治病功曹营卫臣等身。 左官使者建节在前，右官使者持幢在后，阳神决吏立左，阴神决吏立右，上部功曹远望上天，中部功曹远瞻八方，促气功曹催促十方都官使者，匝绕臣等身。 郎吏、虎贲、察奸钩骑都官仆射、天驺甲卒、天丁力士、收气食气吏、收神食神吏、收鬼食鬼吏、收邪食邪吏、收精食精吏、收毒食毒吏、诛符破庙吏、科车赤符吏、刚风骑置吏、驿马上章吏，飞龙骑吏，屯住臣等前后左右。 功曹使者严装事竟，罗列卤簿，关启灵宝官属，领仙监斋诸君将吏。 天师所布下二十四治，三十六靖庐、七十二福地、三百六十五名山昆仑等，上宫三万六千神、日月星宿、璇玑玉衡、天地五帝、三界官属君将吏等，及道上二玄三元四始四面方位风气注气、甲子诸官君吏、考召君、东九夷胡老君、南八蛮越老君、西六戎氏老君、北五狄羌老君、中央三秦伧老君、五岳四渎丘沼君、诸庙神祇所在山川溪谷山林孟长十二溪女，根源本始土地之主社稷将吏，一时严装，与臣等身中功曹使者、飞龙骑吏，上启太上无极大道、太上大道君、太上老君、太上丈人、无上玄老，十方无极大道、道德众圣天尊、至真大帝、天帝、天师君、灵宝监斋大法师、诸官君。 臣等生长魔俗，沉沦季叶，玩乐荣华，宿命因缘，忽见启拔，得奉大道。 不以下愚好乐至真升仙之道，而宿罪深积，结缚不解。 今相率共修灵宝无上斋，请烧香转经，以求所愿，功曹使者、飞龙骑吏，分别关奏，以时上达。 关启事竟，各还臣等身中，复於宫室。",
      "translated_text": "**The Supreme Perfected One’s Essential Precepts on the Ritual Dignity of the Numinous Treasure Purification and Precepts**\n\nThe Supreme Perfected One states: Those who study the Dao of the Perfected Immortals and ascend in broad daylight all take purification and precepts as the foundation for establishing virtue. The *Numinous Treasure Scriptures* contain great methods: the first, third, fifth, seventh, ninth, and eleventh months are the six purification months of the year. The first, eighth, fourteenth, fifteenth, eighteenth, twenty-third, twenty-fourth, twenty-eighth, twenty-ninth, and thirtieth days are the ten purification days of the month. Long purifications and prolonged contemplation are practiced in order to attain the Dao of soaring through the void. Thus, the Supreme Purification of the Numinous Treasure, revered by the August Elder Heavenly Worthy and the Great Sage, is constantly observed without weariness—how much more should Daoists and immortals yearn for it with reverence?\n\nSince ancient times, those who ascend the Dao of immortality must invoke the Most High and teach the essential precepts of purification, precepts, ritual dignity, and regulation. This scripture is profound and wondrous; you must listen with a tranquil mind.\n\nThe Supreme Perfected One states: Upon entering the purification hall, face east. Addressing the incense burner, pray:\n\n*\"August Numinous Treasure Lord Lao, summon the Perfected Officials, the Merit Officers, the Messengers, the Left and Right Dragon-Tiger Direct Attendants, and the Incense-Bearing Messengers to report to the Supreme Three Heavens of the Mysterious Origin of the Great Dao. We now enter stillness, burn incense, and pay homage to the Perfected. May the upright qi of the Ten Directions of the Most High enter our bodies, so that our prayers may be heard at once and ascend before the Jade Emperor’s throne of the True Unity.\"*\n\nNext, kneel lengthily and strike the Heavenly Drum twenty-four times. Respectfully summon from within our bodies the Perfected Officials and Merit Officers of the Five Agents, the Enforcing and Transforming Yin-Yang Merit Officers of the Supreme Three Heavens, the Officers of the Way who Deliver from Disaster and Dispel Calamities, the Lords who Resolve Adversities—twelve each. Summon from our bodies the Governing Lords, the Great Generals who Establish Standards and Oversee Merit, the Front Merit-Reporting and Rear Execution-Commissioning Commanders of the Post Station, the Post Station Assistants, and the Inspecting Envoys of the Four Quarters.\n\nFrom within our bodies, summon two each of the following: the Transcendent Spirits, Direct Messengers, Orthodox Unity Merit Officers, Healing Merit Officers, Left and Right Official Messengers, Yin-Yang Divine Decision Officers, Chariot-Commanding Scarlet Talisman Officers, Gale-Riding Courier Officers, Post-Horse Memorial Officers, and Flying Dragon Riders. Let those summoned don their solemn attire, caps, and pendent tassels, and compose their ritual dignity. The Direct Merit Officers wear the Heaven-Piercing Cap and plain black silk robes. The Orthodox Unity Merit Officers wear the Vermilion Yang Headband and crimson ceremonial robes. The Messengers wear the Nine Virtues Cap, multicolored longevity robes, tiger talisman belts, and hold jade tablets.\n\nThe Direct Merit Officers stand at the four directions, the Orthodox Unity Merit Officers stand at the center, and the Healing Merit Officers guard our bodies. The Left Official Messengers hold standards at the front, the Right Official Messengers bear banners at the rear, the Yang Divine Decision Officers stand to the left, the Yin Divine Decision Officers to the right. The Upper Merit Officers gaze toward the heavens, the Middle Merit Officers survey the eight directions, and the Qi-Urging Merit Officers hasten the Ten Directions’ Official Messengers to encircle our bodies.\n\nThe Gentleman-Officers, Tiger Warriors, Deceit-Detecting Hook Riders, the Directors of the Assembly of Officials, the Heavenly Couriers, Armored Soldiers, Heavenly Ding Warriors, Qi-Gathering and Qi-Consuming Officers, Spirit-Gathering and Spirit-Consuming Officers, Ghost-Gathering and Ghost-Consuming Officers, Evil-Gathering and Evil-Consuming Officers, Essence-Gathering and Essence-Consuming Officers, Poison-Gathering and Poison-Consuming Officers, Talisman-Executing and Shrine-Destroying Officers, Chariot-Commanding Scarlet Talisman Officers, Gale-Riding Courier Officers, Post-Horse Memorial Officers, and Flying Dragon Riders—station themselves around us, front and back, left and right.\n\nOnce the Merit Officers and Messengers have arrayed themselves in solemn attire, they arrange the ceremonial regalia and report to the Numinous Treasure Officials, leading the Perfected Ones who oversee the purification, along with the generals and officers. From the Heavenly Master’s twenty-four established dioceses, the thirty-six sacred retreats, the seventy-two blessed lands, the three hundred sixty-five renowned mountains including Kunlun, the thirty-six thousand spirits of the Upper Palaces, the sun, moon, and constellations, the Jade Armillary Sphere, the Five Emperors of Heaven and Earth, the officials, generals, and officers of the Three Realms, the Two Mysteries, Three Origins, Four Beginnings, and the four cardinal directions’ winds and qi, the Officers of the Celestial Stems and Earthly Branches, the Lords of Summoning and Investigation, the Elder Lords of the Eastern Nine Yi and Hu, the Southern Eight Man and Yue, the Western Six Rong and Di, the Northern Five Di and Qiang, the Central Three Qin and Cang, the Lords of the Five Peaks, Four Waterways, Mounds, and Marshes, the deities of all temples, the spirits of mountains, rivers, streams, valleys, forests, and the Twelve Stream Maidens of Mengchang, the original and fundamental local earth gods, and the officers of the altars of soil and grain—let all don solemn attire at once and, together with the Merit Officers, Messengers, and Flying Dragon Riders from within our bodies, report to the Supreme Boundless Great Dao, the Supreme Lord of the Great Dao, the Supreme Lord Lao, the Supreme Elder, the Boundless Mysterious Elder, the Ten Directions’ Boundless Great Dao, the Heavenly Worthies of the Multitude of Sages of the Dao and Virtue, the Perfected August Emperors, the Heavenly Emperors, the Heavenly Master Lords, the Numinous Treasure Overseers of the Great Dharma of Purification, and all the lords and officials.\n\nWe, born and raised in the world of demons and customs, have sunk into the final age, indulging in pleasure and glory. By karmic conditions of past lives, we have suddenly been awakened and delivered, able to serve the Great Dao. Yet, due to our foolish fondness for the true Dao of ascending as immortals, our accumulated sins are deep, and our bonds remain unbroken. Today, we gather to perform the Supreme Purification of the Numinous Treasure, burning incense and reciting scriptures to seek the fulfillment of our wishes. Let the Merit Officers, Messengers, and Flying Dragon Riders separately report and transmit our prayers upward in due time.\n\nOnce the report is complete, let all return into our bodies and resume their positions in the palaces.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1239,
      "start_sentence": 0,
      "end_sentence": 34,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.3833954334259,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太极真人敷灵宝紫戒威仪诸经要诀.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "须召又到，一如故事。 因鸣天鼓三通毕。 仙公曰：此谓初建斋启事仪。 其日夕六时烧香，唯向香炉祝耳，便礼拜。 妙向香炉祝曰： 香官使者、左右龙虎君、捧香使者，当令靖室斋堂之所，自然生金液丹碧芝英，百灵交会，在此香火炉前，使臣等得道，遂获神仙，举家蒙福，天下受恩。 十方仙童玉女，侍卫香烟，传奏臣等所言，径御太上金阙玉皇几前。 次一时持斋者长跪，斋主自称：某治祭酒某先生，臣某甲等今烧香。 因捻香烧之，祝愿。 皆三烧香，三祝愿。 第一烧香愿曰： 臣等烧香，归身归神归命大道。 臣等首体投地，归命太上三尊。 愿以是功德，归流七世父母，乞兔离十苦八难，上登天堂，衣食自然，常居无为。 今故烧香，自归依师尊大圣众至真之德。 得道之后，升入无形，与道合真。 夫三尊者，道尊、经尊、真人尊也。 三一之尊，通乎人身。 第二烧香祝愿曰： 臣等烧香，归身归神归命大道。 臣等首体投地，归命太上三尊，愿以是功德，归流帝王国主君臣。 臣等受道法师，父母同学，诸道士贤者，愿免离十苦八难，各保福祚，终入无为。 今故烧香，自归依师尊大圣众至真之德。 得道之后，升入无形，与道合真。 第三烧香祝愿曰： 臣等烧香，归身归神归命大道。 臣等首体投地，归命太上三尊，愿以是功德，归流臣等身，令得仙度，升入无为，与四大合德。 天下民人，蝖飞蠕动，一切众生，免离十苦八难，五毒水火，贼疫鬼害众厄，各保福禄，安居无为。 今故烧香，自归依师尊大圣众至真之德。 得道之后，升入无形，与道合真。 此一时烧香，以次人人上香，选高德一人为斋主，名曰法师。 祝愿不须人人祝愿也。 烧香祝愿毕，於是白烧香已讫，斋人一时向东拜，自陈言： 臣等今归命东方无极太上灵宝天尊，赐所愿随心，求欲克得。 次向南方，次向西方，次向北方，次向东方，次向东南，次向西南，次向西北，次向上方，次向下方。 是谓十方愿念，如先法，各方三拜，亦可一拜。 毕。 正西向再拜言： 臣等今归命西方已得道大圣众至真诸君丈人，赐所愿者合。 次北向，次东向，次南向。 面向经，三过祝愿如初。 毕。 此皆回向香炉，取其方面之正也。 是为灵宝斋礼十方，太上大法妙赜矣。 皆当安徐雅步，审整庠序，男女不得参杂，令威仪合於天典，则为鬼神之所具瞻，飞仙之所嗟叹，三界之所轨范也。 仙人修此斋，亦无已时，况凡贤者乎。 拜既竟，斋人以次左行，旋绕香炉三匝毕，是时亦当口咏步虚蹑无披空洞章。 所以旋绕香者，上法玄根无上玉洞之天，大罗天上太上大道君所治七宝自然之台，无上诸真人持斋诵咏，旋绕太上七宝之台，今法之焉。 又三洞弟子诸修斋法，皆当烧香歌诵，以上象真人大圣众，绕太上道君台时也。 故求无上正真大道者，亦可绕高座上清灵宝经。 所以绕香炉者，直今世学者多浮浅，不能受至经。 故示斋法，以委心香烟耳。 行道心至，所愿寻香烟，已御太上。 太上道眼恒洞观诸天下人善恶，亦无毫遗也，可不战战慎之哉。 仙公曰：常想见太上真人在高座上，转经而说法也。 转经法 安小床，向东转经传，案灵宝法，床高五尺，广长亦五尺。 又法：床高四尺五寸，广长五尺。",
      "translated_text": "When the summons is again issued, proceed as before. After sounding the celestial drum three times in succession, the Immortal Duke declares: This is called the Rite of Initiating the Fast’s Petition.\n\nAt each of the six daily periods, burn incense and direct your prayers solely toward the incense burner, then perform the prostration. Address the incense burner with these sacred words:\n\nIncense Officials and Messengers, Lords of the Left and Right Dragon-Tiger, Bearers of the Fragrant Offering—may this place of fasting and this hall of purification spontaneously generate golden liquid, cinnabar, azure mushrooms, and numinous herbs. May the hundred spirits assemble here before this incense burner, that we may attain the Dao, achieve transcendence as immortals, bring blessing to our households, and bestow grace upon the world.\n\nMay the jade maidens and immortal youths of the ten directions attend the rising incense smoke and transmit our words directly to the golden gates and jade throne of the Most High Jade Emperor.\n\nNext, at each period, those observing the fast kneel in reverence. The fast’s sponsor declares his name: I, So-and-so, Master of Sacrifices and Preceptor, along with my fellow devotees, now burn incense. Taking the incense, he ignites it and offers his prayer. Three incense sticks are burned, and three prayers are uttered.\n\nThe first prayer:\nWe burn this incense, dedicating our bodies, spirits, and lives to the Great Dao. Prostrating ourselves, we dedicate our lives to the Three Venerables of the Most High. May this merit flow to our seven generations of parents, delivering them from the ten sufferings and eight difficulties, ascending to the celestial halls where clothing and sustenance arise naturally, and abiding forever in non-action. Today, we burn incense and take refuge in the virtue of our Preceptors, the Great Sages, and the Perfected. After attaining the Dao, may we ascend into formlessness and unite with the True.\n\nThe Three Venerables are: the Venerable Dao, the Venerable Scriptures, and the Venerable Perfected. The Three Ones are venerated within the human body.\n\nThe second prayer:\nWe burn this incense, dedicating our bodies, spirits, and lives to the Great Dao. Prostrating ourselves, we dedicate our lives to the Three Venerables of the Most High. May this merit flow to the Emperor, the Lords of the Realm, and their ministers. May we, our Dharma-teachers, parents, fellow students, and all worthy Daoists be delivered from the ten sufferings and eight difficulties, preserving their blessed destinies and ultimately entering non-action. Today, we burn incense and take refuge in the virtue of our Preceptors, the Great Sages, and the Perfected. After attaining the Dao, may we ascend into formlessness and unite with the True.\n\nThe third prayer:\nWe burn this incense, dedicating our bodies, spirits, and lives to the Great Dao. Prostrating ourselves, we dedicate our lives to the Three Venerables of the Most High. May this merit flow to our own bodies, granting us immortal deliverance, ascent into non-action, and union with the virtue of the Four Great Ones. May all people under heaven—creeping, flying, and wriggling beings, all sentient life—be delivered from the ten sufferings and eight difficulties, the five poisons, water and fire, bandits, plagues, demonic harms, and all calamities. May each preserve their blessings and emoluments, dwelling in peace and non-action. Today, we burn incense and take refuge in the virtue of our Preceptors, the Great Sages, and the Perfected. After attaining the Dao, may we ascend into formlessness and unite with the True.\n\nDuring each incense-burning period, participants take turns offering incense. One of high virtue is chosen as the fast’s sponsor, known as the Dharma-teacher. It is not necessary for each person to recite the prayers.\n\nWhen the incense-burning and prayers are complete, announce that the offering is finished. All participants turn to the east and bow, declaring:\nWe now dedicate our lives to the Boundless Most High Numinous Treasure Heavenly Worthy of the East, beseeching that our wishes be granted and our desires fulfilled.\n\nNext, turn to the south, then the west, then the north, then the east again, followed by the southeast, southwest, northwest, above, and below. This is called the Ten Directions’ Aspiration. For each direction, perform three prostrations—or one, as previously instructed.\n\nAfterward, face due west and bow twice, declaring:\nWe now dedicate our lives to the Great Sages, the Perfected, and the Venerable Lords of the West who have attained the Dao, beseeching that our wishes be granted.\n\nNext, face north, then east, then south. Turn toward the scriptures and recite the prayers three times as before.\n\nAll these actions are directed toward the incense burner, ensuring proper orientation. This is the Rite of the Ten Directions in the Numinous Treasure Fast, wondrous and profound in the Great Law of the Most High.\n\nAll should proceed with calm and graceful steps, maintaining proper order. Men and women must not intermingle, so that the dignity of the rites accords with celestial statutes. Thus shall they be beheld by gods and spirits, admired by flying immortals, and serve as a model for the Three Realms.\n\nEven immortals practice this fast without ceasing—how much more should ordinary worthies do so.\n\nWhen the prostrations are complete, the participants move in sequence to the left, circumambulating the incense burner three times. At this time, they should chant the *Step Through the Void* and *Tread the Empty Firmament* verses.\n\nThe purpose of circumambulating the incense burner is to emulate the Primordial Root of the Supreme Jade Grotto Heaven, the Seven-Treasure Spontaneous Terrace where the Most High Great Dao Lord resides in the Great Canopy Heaven. There, the supreme Perfected Ones observe the fast, recite scriptures, and circumambulate the Most High’s Seven-Treasure Terrace—this rite follows their example.\n\nMoreover, all disciples of the Three Caverns who practice fasting should burn incense and chant hymns, emulating the Perfected Ones and Great Sages as they circumambulate the terrace of the Most High Dao Lord.\n\nThose who seek the Supreme Orthodox and True Great Dao may also circumambulate the high seat of the *Highest Clarity Numinous Treasure Scriptures*.\n\nThe reason for circumambulating the incense burner is that worldly scholars are often superficial and unable to receive the supreme scriptures. Thus, the fast’s method is demonstrated through the sincerity of the incense smoke. Where the heart’s devotion reaches, the incense smoke follows, ascending to the Most High. The Dao-eye of the Most High ever perceives the good and evil of all under heaven, leaving nothing unobserved. How can one not tremble with reverence?\n\nThe Immortal Duke says: Always visualize the Most High Perfected Ones upon the high seat, turning the scriptures and expounding the Dharma.\n\n**Method for Turning the Scriptures**\nSet up a small platform facing east for the recitation and transmission of scriptures. According to the Numinous Treasure method, the platform should be five feet high, five feet wide, and five feet long.\n\nAlternatively: the platform should be four feet five inches high, five feet wide, and five feet long.",
      "overlap_context": "fondness for the true Dao of ascending as immortals, our accumulated sins are deep, and our bonds remain unbroken. Today, we gather to perform the Supreme Purification of the Numinous Treasure, burning incense and reciting scriptures to seek the fulfillment of our wishes. Let the Merit Officers, Messengers, and Flying Dragon Riders separately report and transmit our prayers upward in due time.\n\nOnce the report is complete, let all return into our bodies and resume their positions in the palaces.",
      "start_char": 1239,
      "end_char": 2510,
      "start_sentence": 35,
      "end_sentence": 92,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.463489294052124,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太极真人敷灵宝紫戒威仪诸经要诀.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "静舍促可就容雅屋，此谓斋日权时行道耳。 若欲长斋，久思求仙道，当别立斋堂，必令静洁肃整，罗列经案香炉，施安高座於其中也。 次向高座礼经，都三拜。 言： 臣等今归命太上无极大道至真，无上三十六部尊经宝符，太上三尊。 今烧香转经，希仰太上济度之恩，乞七世父母，以及帝王民人，一切众生，臣等身及家门大小，愿得赦除前世今世生死重罪恶过。 或弒君父，或不孝二亲，或背师欺友，或废真就伪，或为劫贼、攻伐家国，或伐他国，或杀害众生，以为快乐，或淫犯他妻，门族交通，或离母子，夺人所爱，或杀贤人道士，或为君无道，或为臣不忠，誷上威下，酷虐百姓，己取荣名，或六亲相残，或败靖舍灵坛，或窃经书，或烧败经书，或污秽圣文，或评论道德以为虚诞，或笑人作善，自言我是，或嫉贤妬能，不欲胜己，或不崇有道，不敬老人，不念六疾，或呵风骂雨，及天地日月星辰、帝王国主、师父道士，轻慢四大，或骂鬼神，呼谓无知，或口是心非，自欺形影。 诸如此等，莫大之罪，不可忆识，积世结固，缠绵不解，冤对不已。 乞今烧香行道，以自度脱，於是改悔，伏从禁戒，不敢又犯。 亦任意所首谢，皆一时头脑顿地，心中欣欣。 如是圣人必得解脱诸苦八难，咸就无为道场矣。 太极真人曰：灵宝斋法，然十灯火，以法十方。 十是数之至，故人十月而生也。 夹门然灯。 七世父母然七灯於堂前，靖舍常然一灯，夹门然二灯，及符着门户者，鬼神击人，岂当不从门户入耶。 天常下六部使者，周行天下，伺人善恶，鬼神见符灯，皆曰善人之门，不可枉滥也。 以此致分别，生死受福故也。 日月星宿，病人行年本命，各然一灯。 斋时，日夕各三时烧香悔过，唯一心听受经法妙赜之义。 故转经说法，象古真人教化时也。 圣人传授经教，教化於后世，使未闻者闻，未知者知。 欲以此法桥，普度一切人也。 行道之时，故不可得乱语，论及世务，唯当请问法师经义禁戒，师当为解说真要。 人能使内外夷然，敬受经一句，司命加十算。 若内外躁竞，毁经一句，司命夺十算。 故真人不言，言必有中。 言皆令作法，言人能弘道，非道弘人，此之谓也。 仙公曰：以大斋法合得洞真，所以七祖致去地狱，升天堂也。 斋人若妄言绮语，论及私鄙，罚香一斤，油五升，朱三两。 送斋主宣示百姓，然后供公家用也。 夫斋直求道之本，莫不由斯成矣。 此功德巍巍，无能比者。 上可升仙得道，中可安居宁国，延年益寿，保於福禄，得无为之道； 下除宿罪，赦见世过，救危难，消灾治病，解脱死人忧苦，度一切物，亦莫有不宜矣。 行道千日，心尽於玄，必能降真人，见圣得道也。 昼夜六时礼拜，三时中讲，三时思身中神。 太极真人曰：贤人有灾疾，道士当为立灵宝斋，转经烧香，悔罪请命，日数随意。 主人当尽心，内外信向，奉师香油、朱纸少许，以效精诚之至，示之不聊也。 若是浮华之人，不得妄施此大法。 大法微远，非浅薄者所为也。 自志无大雅好幽识妙赜，莫能宗矣。 太极真人曰：灵宝斋时也，太上真人、十方大圣、诸天帝王、飞仙仙人，如千亿万众，不可称数，千乘万骑，宝盖炜烨，飞华雪洒，香烟云散，十绝灵旛，随风飘讽，啸歌邕邕，飞凤和鸣，万龙齐驾，洋洋浮空而来，看听行道也。",
      "translated_text": "A quiet chamber may suffice for a temporary retreat, serving as a provisional space for the observance of the fast on the appointed day. Yet if one seeks to maintain a perpetual fast and aspire to the immortal Dao over time, a separate hall for fasting should be established—immaculate, serene, and solemn—where scripture tables, incense burners, and a high seat are arranged within. Then, facing the high seat, bow three times in full prostration and declare:\n\n*\"We now take refuge in the Most High, the Boundless and Supreme Dao, the Perfected Ones; in the thirty-six divisions of the sacred scriptures and talismanic seals; and in the Three Supreme Ones of the Most High. As we burn incense and turn the scriptures, we reverently beseech the grace of the Most High to deliver us. We pray for the liberation of our seven generations of ancestors, for emperors and common folk, for all sentient beings, and for ourselves and our households—great and small—hoping to be absolved of the grave sins and transgressions of past and present lives. These may include: regicide or patricide; disobedience to parents; betrayal of teachers or deceit toward friends; forsaking truth for falsehood; banditry or the invasion of kingdoms; the slaughter of other nations; the killing of beings for pleasure; adultery or illicit relations within clans; the severing of mother and child or the seizure of another’s beloved; the murder of sages or Daoist priests; tyranny as a ruler or disloyalty as a minister; oppressing subordinates and cruelly abusing the people while seeking personal glory; the mutual destruction of kin; the desecration of sacred halls or altars; the theft or burning of scriptures; the defilement of sacred texts; the mockery of the Dao and virtue as mere delusion; the ridicule of others’ good deeds while claiming superiority; envy of the worthy and resentment of those more capable; the failure to honor the virtuous, respect the elderly, or care for the six afflictions; cursing the wind and rain, or reviling heaven and earth, the sun and moon, stars and constellations, emperors and lords, teachers and Daoist priests; contempt for the Four Great Elements; blasphemy against spirits and gods, dismissing them as ignorant; or hypocrisy—speaking one thing while thinking another, deceiving even one’s own shadow. Such sins, too numerous to recall, accumulate across lifetimes, binding us inextricably, perpetuating karmic grievances without end. We now burn incense and perform the Dao, seeking self-deliverance. Henceforth, we repent and submit to the precepts, vowing never to transgress again. Whatever sins we confess, we prostrate ourselves fully, hearts filled with joy. Thus, the sages will surely release us from the eight sufferings and all hardships, guiding us to the realm of non-action and the Dao.\"*\n\nThe Perfected One of the Great Ultimate says: *\"In the Numinous Treasure fast, ten lamps are lit to correspond to the ten directions. Ten is the supreme number, for humans are born after ten months. Light lamps beside the door. For the seven generations of ancestors, light seven lamps before the hall; in the quiet chamber, keep one lamp always lit; and place two lamps beside the door. Where talismans are affixed to the door and gate, spirits and demons strike at people—how could they not enter through the door? The Six Divisions of Heavenly Envoys constantly descend to patrol the world, observing the good and evil of humanity. When spirits and demons see the talismans and lamps, they say, ‘This is the gate of a virtuous person—we cannot act wantonly here.’ Thus, distinctions are made, and the living and dead receive their due blessings.\"*\n\nFor the sun, moon, stars, constellations, the patient’s year of fate, and their natal destiny, each is honored with a lamp. During the fast, incense is burned and repentance offered at dawn, noon, and dusk—three times daily—with wholehearted devotion to receiving the profound mysteries of the scriptures and the Dharma. The turning of scriptures and expounding of the Dharma mirror the teachings of the ancient Perfected Ones. The sages transmitted these scriptures to instruct later generations, that the unheard might hear and the unknowing might know. Through this Dharma-bridge, all beings are universally delivered.\n\nDuring the performance of the Dao, no idle chatter or discussion of worldly affairs is permitted. One may only inquire of the Dharma-master regarding the meaning of the scriptures and precepts, and the master shall elucidate the true essentials. If one maintains inner and outer composure and reverently receives even a single sentence of the scriptures, the Registrar of Destiny adds ten years to their lifespan. But if one is restless within and without and disparages even a single sentence, the Registrar deducts ten years. Thus, the Perfected Ones do not speak idly; their words always strike the mark. Their words establish the Dharma, for it is people who uphold the Dao, not the Dao that upholds people. This is the meaning.\n\nThe Immortal Duke says: *\"The Great Fast, when combined with the Cavern Realms, enables the seven generations of ancestors to escape hell and ascend to heaven. If a participant in the fast engages in frivolous speech or vulgar discourse, they shall be penalized with one *jin* of incense, five *sheng* of oil, and three *liang* of cinnabar. These are to be offered to the host of the fast and distributed to the people, then used for public purposes. The fast is the foundation of seeking the Dao—none achieve it without this practice. Its merit is towering, beyond compare. Above, it leads to immortality and the attainment of the Dao; in the middle, it brings peace to the nation, prolongs life, and secures blessings and prosperity, attaining the Dao of non-action; below, it eradicates past sins, absolves present transgressions, rescues those in peril, dispels disasters, cures illnesses, liberates the dead from suffering, and delivers all beings—nothing is beyond its efficacy. After a thousand days of practicing the Dao with a heart devoted to the mysterious, one will surely summon Perfected Ones, behold the sacred, and attain the Dao.\"*\n\nDay and night, bow six times in the six periods; in three of these, expound the scriptures, and in the other three, meditate on the gods within the body.\n\nThe Perfected One of the Great Ultimate says: *\"When a worthy person suffers misfortune or illness, Daoist priests should establish a Numinous Treasure fast, turn the scriptures, burn incense, repent of sins, and pray for longevity, with the duration determined by their intent. The host must devote themselves wholeheartedly, both inwardly and outwardly, in faith and reverence, offering the master a modest amount of incense, oil, cinnabar, and paper as tokens of utmost sincerity, demonstrating their unwavering commitment. If the person is frivolous and superficial, this great Dharma must not be recklessly performed. The great Dharma is subtle and profound—it is not the domain of the shallow. Only those with a deep love for the refined, an affinity for the mysterious, and a reverence for the profound can truly uphold it.\"*\n\nThe Perfected One of the Great Ultimate says: *\"During the Numinous Treasure fast, the Most High Perfected Ones, the Great Sages of the Ten Directions, the Heavenly Emperors and Kings, and the flying immortals—numbering in the thousands of millions, beyond count—arrive with a thousand chariots and ten thousand riders. Their jeweled canopies gleam resplendently; flying flowers scatter like snow; incense smoke drifts like clouds; the ten sacred banners flutter in the wind; their harmonious songs and whistles fill the air; phoenixes sing in unison; ten thousand dragons draw their chariots, soaring through the sky in grand procession. They come to witness and listen to the performance of the Dao.\"*",
      "overlap_context": "h reverence?\n\nThe Immortal Duke says: Always visualize the Most High Perfected Ones upon the high seat, turning the scriptures and expounding the Dharma.\n\n**Method for Turning the Scriptures**\nSet up a small platform facing east for the recitation and transmission of scriptures. According to the Numinous Treasure method, the platform should be five feet high, five feet wide, and five feet long.\n\nAlternatively: the platform should be four feet five inches high, five feet wide, and five feet long.",
      "start_char": 2510,
      "end_char": 3774,
      "start_sentence": 93,
      "end_sentence": 134,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.8582501411438,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太极真人敷灵宝紫戒威仪诸经要诀.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "天人欢悦，鬼神称善，魔王叉手作礼，欣畅大法，三界大千众圣，同所嗟叹，所在神灵侍卫门户，皆令护人，无敢行恶逆者也。 读经章句，咸当一心称善哉善哉。 魔王当有宣令言曰：此无为贤人道士，功德巍巍，大圣所敬，我等各各当营护之，削其太山三官死名也。 致白日升天，七祖受庆，反胎生天堂，兆身永保历劫之利贞也。 太极真人曰：夫王侯皆受前世宿福，致富贵，才智精明，功德满足，乃当复好道，此皆宿罪已尽。 宿罪已尽者，其人必自笃好斋戒，学大经大法，则去仙近矣。 若学持戒而不怠，克得上仙也。 道士乐斋者，悉是宿罪尽。 宿罪未尽，终亦不好之矣。 此去仙圣犹远。 学仙道欲长生久视，享无期之年劫，安宗庙，兴门族，度七世父母苦厄，升天堂，后世出贤明子孙，当受灵宝真文。 行是斋，自得此大福。 大福度人为先，所以先人后己，倚伏兼忘，忘其所忘，志与玄同。 上士闻道，勤而行之，中士若存若亡，下士大笑道矣。 太极真人曰：夫感天地，致群神，通仙道，洞至真，解积世罪，灭凶咎，却冤家，修盛德，治疾病，济一切物，莫近乎斋静转经者也。 古闻其言，今希见其人矣。 太极真人曰：贤者欲修无为之大法，是经可转，及诸真人经传亦善也。 唯道德五千文，至尊无上正真之大经也。 大无不包，细无不入，道德之大宗矣。 历观夫已得道真人，莫不学五千文者也。 尹喜、松羡之徒是也。 所谓大乘之经矣。 又大洞真经三十九章，不得人间诵之。 所以尔者，是真道幽升之经也。 诸天帝王下迎，散香花，六天大魔王官属侍卫称庆，皆来稽首受事，山海神灵莫不从己役使者也。 咏之一句，诸天为设礼，况鬼神乎。 故不可人间妄施行矣。 灵宝经是道家之至经，大乘之玄宗，有俯仰之品。 十方已得道真人，恒为之作礼，烧香散华，众道之本真矣。 道士奉仰灵宝，朝拜斋戒，案法修之，皆使得道，岂有不然耶。 此经若不能令至向获长生，升仙度世，故堕於尘壤者，天地无有仙人也。 要在外想冥绝，内注玄真，然后景汉可凌也，长生可保矣。 五千文感会众妙，大归等耳，胜得世间行也。 诸斋法皆上宗於灵宝本斋矣。 仙公曰：此大斋上仙之道，所以七祖解脱罗纲，飞升太玄宫，身当先得五芝如芙蓉者也。 五芝亦自生矣。 太极真人曰：五千文，仙人传授之科，素与灵宝同限。 高才至士好讽诵，求自然飞仙之道者，具法信纹缯五千尺#2，与灵宝一时，於名山峰受之。 师南向立，弟子北向之三拜，分金环各半，佩身受经毕。 弟子方各一拜，从北始，周十方。 读经亦先拜十方，如此法。 太玄都旧典也，子今自明识之，子孙按法传之於后世贤人。 太上口诀，宜当秘之。 子应常思虚无真人、高上大法王、大千乘贤、世号老子者也。 老子，玄中大法师矣。 其以道眼观诸天人善恶，子弘此道，恐必飞仙。 得妙之日，当知是经之不虚也。 焕乎洞寂之文，大道之旨，尽於此矣。 仙公曰：世有高德人，欲讽诵期升仙者，当与灵宝同时受之。 法信效奉经之盟也。 故曰：不出户牖，以知天道，此之谓也。 世将希有其人矣。 若欲谈虚无，持高於时者，不须依此法受之也。 真人直以教学仙耳。 道士学之求仙，不师受者，即道不行。",
      "translated_text": "The heavens and humans rejoice, ghosts and spirits praise its goodness, demon kings clasp their hands in reverence, delighting in the great Dharma. The myriad sages of the Three Realms and the Great Thousand Worlds together sigh in admiration. The spirits guarding every place stand watch at the gates, all protecting the practitioner—none dare act with malice or defiance.\n\nWhen reciting the scriptural verses, all must wholeheartedly exclaim, *\"Excellent! Excellent!\"* The demon kings shall issue proclamations, saying: *\"These virtuous and worthy Daoists of non-action possess towering merit, revered by the Great Sages. We must each protect them, erasing their names from the registers of death under the Three Officials of Mount Tai. Thus shall they ascend to heaven in broad daylight, their seven generations of ancestors receive blessings, return to the celestial halls as reborn spirits, and their own bodies forever preserve the steadfast blessings of kalpas.\"*\n\nThe Perfected One of the Great Ultimate says: *\"Kings and nobles enjoy their wealth and nobility due to the accumulated blessings of past lives, their talents and wisdom refined, their merit and virtue fulfilled. Only then do they come to favor the Dao—this is because their past transgressions have been exhausted. When past transgressions are exhausted, such a person will naturally devote themselves to fasting and abstinence, studying the great scriptures and great Dharma, and thus draw near to immortality. If they cultivate the precepts without negligence, they shall attain the rank of Upper Immortal. Daoists who delight in fasting are all those whose past transgressions have been exhausted. If past transgressions remain unexhausted, they will ultimately have no affinity for it. Such a one remains far from the sages and immortals. Those who study the Dao of immortality seek long life and enduring vision, to enjoy boundless kalpas, secure their ancestral temples, prosper their clans, deliver their seven generations of parents from suffering and peril, ascend to the celestial halls, and in later generations produce wise and enlightened descendants—let them receive the true texts of the Numinous Treasure. By practicing this fast, they shall attain this great blessing. The greatest blessing is to deliver others first; thus, one puts others before oneself, forgets both dependence and opposition, and forgets even what is to be forgotten, aligning one’s will with the mysterious. The superior person, upon hearing the Dao, diligently practices it; the middling person wavers between belief and doubt; the inferior person laughs at the Dao.\"*\n\nThe Perfected One of the Great Ultimate says: *\"To move heaven and earth, summon the host of spirits, penetrate the Dao of immortality, fathom the utmost truth, dissolve the sins of past lives, dispel misfortune, repel vengeful foes, cultivate abundant virtue, cure illnesses, and aid all beings—nothing is closer than the practice of fasting in stillness and reciting the scriptures. We have heard of such words in ancient times, yet rarely see such people today.\"*\n\nThe Perfected One of the Great Ultimate says: *\"Those worthy ones who wish to cultivate the great Dharma of non-action may recite this scripture, as well as the transmitted texts of the various Perfected Ones—all are excellent. Yet the *Five Thousand Character Scripture of the Dao and Its Virtue* is the supreme, unsurpassed, and perfectly true great scripture. It encompasses the vast without omission and penetrates the minute without exception—it is the great foundation of the Dao and its virtue. Surveying all those Perfected Ones who have attained the Dao, none have not studied the *Five Thousand Character Scripture*. Yin Xi, Song Xian, and their like are examples. This is what is called the scripture of the Great Vehicle. Furthermore, the *Thirty-Nine Chapters of the Great Cavern True Scripture* must not be recited among ordinary people. The reason is that it is the scripture of the subtle ascent of the true Dao. When it is chanted, the Heavenly Emperors and Kings descend to welcome the practitioner, scattering incense and flowers; the officials and attendants of the Six Heavenly Demon Kings rejoice and come to bow in submission, ready to serve. The spirits of mountains and seas will all be at one’s command. Even a single verse chanted invokes the heavens to perform rites—how much more so for ghosts and spirits! Thus, it must not be recklessly practiced among ordinary people.\"*\n\nThe Numinous Treasure scriptures are the supreme scriptures of the Daoist tradition, the mysterious foundation of the Great Vehicle, possessing ranks of reverence both high and low. The Perfected Ones of the Ten Directions who have attained the Dao constantly perform rites before them, burning incense and scattering flowers—this is the root and truth of all Daoist practices. When Daoists revere the Numinous Treasure, prostrating in fasting and abstinence, and cultivate it according to the methods, all shall attain the Dao—how could it be otherwise? If this scripture cannot lead one toward long life, ascension as an immortal, and deliverance from the world, then there are no immortals under heaven and earth. The key lies in extinguishing external distractions and inwardly focusing on the mysterious truth—only then can one soar beyond the Milky Way and preserve long life.\n\nThe *Five Thousand Character Scripture* gathers and harmonizes the myriad wonders, its great return being equal to all others—yet it surpasses all worldly practices. All fasting methods ultimately trace their origin to the fundamental fast of the Numinous Treasure.\n\nThe Immortal Duke says: *\"This great fast is the path of the Upper Immortals, by which the seven generations of ancestors are released from the nets of karma, ascend to the Great Mystery Palace, and the practitioner’s body first obtains the Five Mushrooms resembling hibiscus. The Five Mushrooms also grow naturally.\"*\n\nThe Perfected One of the Great Ultimate says: *\"The *Five Thousand Character Scripture* follows the transmission protocols of the immortals, originally sharing the same requirements as the Numinous Treasure. For those of exceptional talent and aspiration who seek the Dao of spontaneous flight as an immortal, they must prepare the ritual offerings: five thousand feet of silk and written pledges, presented simultaneously with the Numinous Treasure scriptures. They shall receive them atop a named mountain peak. The master stands facing south, the disciple facing north, bowing three times. Each breaks a gold ring in half, wearing one piece while receiving the scriptures. Afterward, the disciple bows once more, beginning from the north and circumambulating the ten directions. When reciting the scriptures, one must first bow to the ten directions—this is the method. It is an ancient protocol of the Great Mystery Capital. You must now clearly understand it and transmit it to worthy descendants in later generations according to the method. The oral instructions of the Most High should be kept secret. You should constantly contemplate the Void-and-None Perfected One, the Supreme Great Dharma King, the Worthy One of the Great Thousand Vehicles, known in the world as Laozi. Laozi is the great Dharma master within the mysterious. With the eye of the Dao, he observes the good and evil of all heavenly beings. You must propagate this Dao, and you shall surely become a flying immortal. On the day you attain the wondrous, you will know that this scripture is not false. Resplendent are the writings of the Cavernous Silence—here lies the essence of the Great Dao.\"*\n\nThe Immortal Duke says: *\"In the world, those of lofty virtue who wish to recite the scriptures in pursuit of ascension as immortals should receive the Numinous Treasure and the *Five Thousand Character Scripture* simultaneously. The ritual offerings are the pledges of devotion to the scriptures. Thus it is said: 'Without leaving one’s door or window, one may know the Dao of heaven'—this is what it means. Such people will be rare in the world. Those who wish to discourse on emptiness and transcendence, holding themselves above their age, need not follow this method of transmission. The Perfected Ones teach only to those who seek immortality. Daoists who study these texts to attain immortality yet do not receive them from a master will find the Dao unfulfilled.\"*",
      "overlap_context": "ortals—numbering in the thousands of millions, beyond count—arrive with a thousand chariots and ten thousand riders. Their jeweled canopies gleam resplendently; flying flowers scatter like snow; incense smoke drifts like clouds; the ten sacred banners flutter in the wind; their harmonious songs and whistles fill the air; phoenixes sing in unison; ten thousand dragons draw their chariots, soaring through the sky in grand procession. They come to witness and listen to the performance of the Dao.\"*",
      "start_char": 3774,
      "end_char": 5003,
      "start_sentence": 135,
      "end_sentence": 189,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.025458097457886,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太极真人敷灵宝紫戒威仪诸经要诀.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "太极真人曰：真人体道虚无，无所畏忌也。 俗间有污秽者，直圣人为世人魂神忧故耳。 人经污秽，不以香汤沐浴，多病害人，欲示民知清浊故也。 夫鬼神之道，倍多污秽也，污便不行矣。 但金尚不可秽耗，何况至道乎。 大法真道，无所污秽明矣。 太极真人曰：世人经污，不问大小，应即解。 解毕使烧香行道，本无日限也。 太极真人曰：饭贤福食，各有人数。 外来之客，先亦同食。 正一真人三天法师临升天，以百姓贫弊，为复灭损，作福或十人馔。 忽过十人他宾集，无以供之，既不尽周，一人不遍，犹是不普。 故制法悉事毕，余厨施一切人及众生辈，为主人祈福矣。 后世不知之，故以相示也。 酒不可都断使之有数，随人多少，不必令尽限也。 故世教言：唯酒无量不及乱，斯之谓矣。 酒多浊乱正气，三真亡宫，故不可过量，考官司之，宜慎之。 太极真人曰：有人不学道者，闻道士论至经幽赜，妙义弘远之旨，心不信用，而诬毁圣文，谓之虚诞，经教妄作耳，不足学也。 己既不信，便嫉诸人经学，及导养之道，皆言不然。 此人宿命前世时，不与仙圣作缘，贤人结因，今生无大智慧，故不得预贤圣之蕴韵矣。 不信至道经教，而好学巫术杂书不真之事。 其会同之日，唯酒肉为先，口是心非，诡黠相攻，淫欲纵横，放心所为，嗜物无厌。 或复为师，初无教善之怀，．强弱相凌，恒欲肆其虐意，意中贪妬谮害，淫盗诈伪，凶悖乱逆，此人身常有十恶。 何以知其人有如是之行，不遭罹罪网，见世安稳者。 有人从来不履非法，动遵经教，而更婴忧苦者。 夫人死身烂坏，魂神不朽，随生时之行善恶，皆有对。 是以世人为恶颠倒，弒犯君父，酷逆无比，而不即被考者，由受先世宿福，福尽罪至。 生或为阳官所治，死入地狱，覆诸茶毒，楚痛难言也。 若善人今不效者，是其宿世恶罪未尽，尽便福至。 或见世当贵，或死得生王侯之家，或生天上，或作鬼神。 恶恶相缘，善善相因，是曰命根。 学道者亦宜知此也。 夫学道而至死不获者，功德未备，宿无重缘，因缘微薄故也。 后世无不藉此功，以得仙度也。 若复学道数年，便望升仙，未克之间，忽然中怠。 或堕情欲，还随流俗，身没名灭，轮转死道，更诸苦恼。 或失人身，忽去人道，未有还期也。 有挺世聪明，而不教化於人，后生顽痴也。 奴婢亦无种，皆由前生时欺取人物，今以力偿之。 六畜以肉饴之。 世人不信道经，狐疑正教，当受斯酷，岂不悲哉。 道士若履善遇恶，能忍撼轲，守兹法戒者，保不失今之功矣。 穷而不越道，道士也，死生王侯家。 子於此得道，得道自当见宿命之根，由前世大布施，学道不倦，所以得仙矣。 左仙公曰：子其勉焉，历代未有不学而得仙者也。 学仙要在方寸尽，方寸不尽，是以学而不获矣。 圣人不误人也。 太极真人曰：夫祭酒当奉行老君百八十大戒，此可言祭酒也。 故曰不受大戒，不得当百姓及弟子礼拜也。 受此戒者，心念奉行，今为祭酒之人矣。 祭酒当断念，舍众恶，推行戒法，当如是也。 黄老道妙，检种人之法，非不真者，所参万中有一多矣。 太极真人曰：学士若能弃世累，有远游山水之志，宗极法轮，称先生。 常坐高座读经，教化愚贤，开度一切学人也。",
      "translated_text": "The Perfected of the Great Ultimate says: *\"The Perfected embody the Dao in emptiness and nothingness, fearing nothing. The defilements of the mundane world concern only the sages, who grieve for the souls and spirits of the people. When one encounters filth and impurity without bathing in fragrant waters, illness and harm befall them—this is to teach the people the distinction between purity and pollution. The way of ghosts and spirits is doubly prone to defilement; when defiled, their power ceases. Even gold cannot withstand corruption and decay—how much less the supreme Dao? The great methods and true Dao are inherently free from defilement.\"*\n\nThe Perfected of the Great Ultimate says: *\"When people encounter defilement, regardless of its magnitude, they should immediately perform the rite of release. Afterward, they must burn incense and perform the Dao-circuits, with no fixed time limit.\"*\n\nThe Perfected of the Great Ultimate says: *\"The meals offered to the worthy and the blessings of the feast have their allotted numbers. Visiting guests should also partake first. When the Perfected of Orthodox Unity, the Three Heavens’ Dharma Master, was about to ascend to heaven, he saw the people impoverished and suffering, so he reduced the number of offerings, sometimes preparing meals for ten. If more than ten guests arrived unexpectedly, there would be nothing to offer them. If the feast were not fully shared, even one person left unserved would mean the blessing was not universal. Thus, the ritual was established so that once all matters were complete, the remaining food would be distributed to all people and beings, thereby praying for the host’s fortune. Later generations, unaware of this, are now instructed in it. Wine should not be entirely forbidden but regulated in quantity, adjusted according to the number of people, without enforcing strict limits. As the worldly teaching says: ‘Only with wine is there no measure—yet it must not lead to disorder.’ Excessive wine muddles the upright qi and drives the Three Perfected from their palaces; thus, one must not overindulge, and officials should examine this—prudence is essential.\"*\n\nThe Perfected of the Great Ultimate says: *\"There are those who do not study the Dao. When they hear Daoists discourse on the profound and abstruse meanings of the supreme scriptures—vast and far-reaching principles—they do not believe or apply them. Instead, they slander the sacred texts as false and absurd, dismissing the scriptural teachings as mere fabrication, unworthy of study. Having no faith themselves, they envy others who study the scriptures and the methods of nurturing life, claiming all of it to be untrue. Such people, in their past lives, formed no karmic ties with the immortals and sages, nor did they cultivate connections with the worthy. In this life, they lack great wisdom and thus cannot partake in the profound resonance of the sages. They reject the teachings of the supreme Dao and scriptures, preferring to study the arts of shamans and miscellaneous, inauthentic texts. When they gather, they prioritize wine and meat, their words contradicting their hearts. They deceive and attack one another, indulging in lust and desire, following their whims without restraint, insatiable in their cravings. Some even take on the role of teachers, yet harbor no intention of teaching goodness. They bully the weak, constantly seeking to indulge their cruel impulses. Their minds are filled with greed, jealousy, slander, harm, lewdness, theft, deceit, and treachery—violent, perverse, and rebellious. Such people embody the ten evils in their conduct. How can one know that such individuals, despite their actions, do not fall into the net of retribution and live in apparent peace? There are others who have never transgressed the law, always following the scriptural teachings, yet suffer hardship and distress. When a person dies, their body decays, but their soul and spirit endure, facing consequences based on the good and evil of their past deeds. Thus, when people commit evil, act perversely, or even murder their rulers or fathers—heinous and unparalleled crimes—yet do not immediately face judgment, it is because they are still drawing on the blessings of past lives. When those blessings are exhausted, their sins will arrive. In life, they may be punished by the authorities; in death, they enter hell, enduring unspeakable torments. If good people do not see their rewards in this life, it is because their past sins are not yet exhausted. Once they are, blessings will come: they may achieve high status in this life, be reborn into the families of kings or nobles, ascend to heaven, or become spirits. Evil follows evil, and good follows good—this is the root of destiny. Those who study the Dao should understand this. If one studies the Dao until death yet fails to attain it, it is because their merit and virtue are incomplete, and their past karmic ties are weak. There is no one in later generations who does not rely on this merit to achieve immortality and transcendence. If one studies the Dao for several years and then expects to ascend as an immortal, yet falters midway, grows lazy, or succumbs to worldly desires, they will revert to the common flow. Their body will perish, their name will fade, and they will be trapped in the cycle of death, enduring endless suffering. They may lose their human form, departing from the human realm without hope of return. Some are born with innate intelligence yet do not teach or transform others, leaving later generations ignorant and foolish. Even slaves and servants have no fixed nature—they are repaying debts from past lives when they deceived and took from others, now serving as labor to compensate. The six livestock are repaid with their flesh. When people do not believe in the Daoist scriptures, doubting the true teachings, they will suffer these cruel fates—how tragic! If a Daoist encounters evil while practicing goodness, yet endures with patience and steadfastness, upholding these precepts and laws, they will preserve their present merit. To remain steadfast in adversity without transgressing the Dao—this is the mark of a Daoist. In life and death, they will dwell in the households of kings and nobles. If you attain the Dao in this way, you will naturally perceive the roots of your past lives. It is because you practiced great generosity and studied the Dao tirelessly in former lives that you now achieve immortality.\"*\n\nThe Perfected Lord of the Left says: *\"Strive diligently, for there has never been one who attained immortality without study. The key to studying immortality lies in exhausting the heart-mind. If the heart-mind is not exhausted, that is why one studies yet fails to attain. The sages do not deceive.\"*\n\nThe Perfected of the Great Ultimate says: *\"Those who serve as Libationers must uphold the One Hundred and Eighty Great Precepts of Lord Lao. Only then can they be called Libationers. Thus, it is said: ‘Without receiving the great precepts, one may not accept the bows of the people or disciples.’ Those who receive these precepts must hold them in their hearts and practice them—only then do they become Libationers. Libationers must sever distracting thoughts, abandon all evils, and diligently practice the precepts. Such is the way. The wondrous Dao of the Yellow and the Old is the method for examining the seeds of humanity. Among ten thousand, perhaps one or two are genuine.\"*\n\nThe Perfected of the Great Ultimate says: *\"If a scholar can cast aside worldly burdens and aspire to wander among mountains and rivers, upholding the Dharma-wheel of the Supreme Ultimate, they may be called a Master. They should sit upon a high seat to recite the scriptures, teaching and transforming the foolish and the wise, guiding and delivering all who seek to learn.\"*",
      "overlap_context": "votion to the scriptures. Thus it is said: 'Without leaving one’s door or window, one may know the Dao of heaven'—this is what it means. Such people will be rare in the world. Those who wish to discourse on emptiness and transcendence, holding themselves above their age, need not follow this method of transmission. The Perfected Ones teach only to those who seek immortality. Daoists who study these texts to attain immortality yet do not receive them from a master will find the Dao unfulfilled.\"*",
      "start_char": 5004,
      "end_char": 6239,
      "start_sentence": 190,
      "end_sentence": 243,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.5806827545166,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太极真人敷灵宝紫戒威仪诸经要诀.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "假令本命寅卯，属东方二辰，称东岳先生。 四方效此。 辰戌、丑未生，称中岳先生。 若复清真至德，能通玄妙义者，随行弟子同学，为称某先生。 某人钩深致远，才学玄洞，志在大乘，当称玄称先生，或游玄先生，或远游先生，或宣道先生，或畅玄先生。 略言其比，不可逆载。 须世有其人，学者称焉，大都法如是耳。 言名上清，清斋七日。 先生位重，不可妄称，鬼神不承奉，以天考考人。 夫先生者，道士也。 於此学仙道成曰真人，体道大法，谓之真人矣。 太极真人曰：观世为道，希有欲斋戒转经，寻明师受读，请问义理，信用奉行之者。 多是浮华浅薄之人，声色在心，志无大雅，好学小乘法。 或有一人，欲斋戒学道，复无明师共相劝进。 其志在仙道，图济一切人民，人民更非笑之。 皆曰：彼不要之事，我未见人多学其法者，经书多虚妄语也。 故不如我辈，并能消灾散祸也。 夫聋者不闻韶武，瞽者不睹白黑，岂言已病哉。 遂令大道不行，正法不兴，真经寝顿，精邪日滋，各称三宫女郎，妖乱并作，百姓将舍真追伪矣。 悉由师不勤学，以劝弟子学正经、学正法。 正真居其心，则魔魅远矣。 不知上经大义，无以持检其心，邪魔鬼气入心中动作，其意无所不至。 犹抱石济长津，岂不然哉。 太极真人曰：庄周者，太上南华仙人也。 其前世学道时，愿言：我得道成仙，才智洞达，当出世化生人中，敷演道德经五千文，宣畅道意。 惠子是其弟子，尔时亦言：先生若得道，能出处自在，弟子愿侍从，唱赞微言，通达玄旨，洞观道源，以解世罗也。 检俗人华竞之心，导之以自然法门，故玄之又玄，众妙之门也。 后并得所愿，着书皆通道意。 世人于今不知是仙真上人，以庄子所造多寓言。 大鹏、大桩、冥灵，皆实录语也，非虚发矣。 夫大处则生此大物，今阆苑、昆仑、蓬莱、北海中，悉有是神物。 小处则生小物。 若欲皆眼见为有，不见为无，天下之所无多矣。 道家经譬喻法中，说劫数久远，有石乃如昆仑山芥子，四十里中，天人罗衣，百年一度，拂尽此石，取此芥子一枚，譬如一劫之终。 若是之久，谁当信斯者矣。 太极真人曰：灵宝经者，众经之宗，难以言宣。 五千文微妙，众经大归义一也。 洞真三十九篇，三十九真人说之者，盖无生之文矣。 此真人传出之耳。 其人道德真气，混化自然成真人，老子之俦矣。 经历无穷之劫，非学道之人也。 世人非宿恩至功德满足，得洞真经者，莫能知此义。 所道者皆是无上三天自然宫室，万物山川。 其山川万物，名有世上同者，非世之山川万物也，皆自然物，可闻难辩。 洞真玉清经略解其义，不能覼缕，岂可思议也。 奉之致大福，身得长生，宗庙安宁，诵之成真人之王，其道无上。 昔之得上仙至真之道，皆是奉灵宝经者也。 三天称仙，梵天称道。 天地有终始，故有大小劫，诸经亦随之灭尽也。 后代圣人更出法，唯道德五千文、大洞真经、灵宝不灭不尽，传告无穷矣。 故曰无生之篇，众经之王也。 故代代教化应成仙道者，世世莫知其源。 巍巍至尊，非鬼神所见，唯六天大魔王来奉承经师尔，上三天司直仙官监察之矣。 亦非下仙之所闻也，真人乃能学之耳。 世人不知道是仙人，又言仙非道，皆是其宿对未尽故也。",
      "translated_text": "Should one’s natal sign be yín or mǎo, belonging to the two celestial stems of the East, they shall be called Master of the Eastern Marchmount. The other three directions follow this precedent. Those born under chén-xū or chǒu-wèi shall be called Master of the Central Marchmount. If one further possesses pure perfection and utmost virtue, and can penetrate the mysteries of the profound, their disciples and fellow students may address them as Such-and-Such Master. If one delves deeply and reaches far, their talent and learning profound and penetrating, their aspiration fixed upon the Great Vehicle, they shall be called Master of the Profound, or Master of Wandering the Profound, or Master of Far Wandering, or Master of Propagating the Dao, or Master of Expounding the Profound. Such titles are but brief examples and cannot be exhaustively listed. When the world produces such a person, scholars shall address them accordingly. The general principle is thus.\n\nTo speak of the name \"Upper Clarity\" requires seven days of pure fasting. The rank of Master is weighty and must not be claimed lightly; ghosts and spirits will not acknowledge one who does so, for Heaven examines all people. The Master is a Daoist. One who studies the Dao of immortality and achieves it is called a Perfected. One who embodies the great Dharma of the Dao is called a Perfected.\n\nThe Perfected of the Great Ultimate says: *\"Those who observe the world as Daoists are rare—those who desire to fast, recite scriptures, seek enlightened teachers to receive and study them, inquire into the principles, and faithfully practice them. Most are frivolous and shallow, their hearts attached to sensual pleasures, their aspirations lacking in true refinement, fond of studying the lesser vehicles. Even if one person desires to fast and study the Dao, there is often no enlightened teacher to encourage and guide them. Though their aspiration lies in the Dao of immortality, seeking to deliver all people, people instead ridicule them, saying: ‘Such useless pursuits! I have never seen many study this way. The scriptures are full of empty and deceptive words. It is not as good as our methods, which can dispel calamities and disperse misfortunes.’ The deaf do not hear the music of Sháo and Wǔ; the blind do not see black and white. How can they claim their own affliction is not a malady? Thus the great Dao is not practiced, the true Dharma does not flourish, the authentic scriptures lie dormant, and perverse and heretical teachings daily increase. Each claims to be a Lady of the Three Palaces, and chaos of demonic delusion arises. The people abandon the true and pursue the false. All this stems from teachers who do not diligently study and thus fail to encourage their disciples to learn the orthodox scriptures and the orthodox Dharma. If the true and orthodox reside in one’s heart, demonic influences will be far removed. Without knowing the great meaning of the supreme scriptures, there is no way to restrain one’s heart. Demonic and ghostly qi enter the heart and stir it to action, leading the mind to every kind of excess. It is like embracing a stone to cross a great river—how could it not be so?\"*\n\nThe Perfected of the Great Ultimate says: *\"Zhuāng Zhōu was the Celestial Immortal Nán Huá of the Supreme. In a former life, when he studied the Dao, he vowed: ‘When I attain the Dao and achieve immortality, my talent and wisdom shall be penetrating and far-reaching. I shall appear in the world among people to expound the* Dàodéjīng *of five thousand characters and propagate the meaning of the Dao.’ Huìzǐ was his disciple, who at that time also said: ‘If the Master attains the Dao and gains freedom in action and stillness, this disciple wishes to attend and follow, to chant and praise the subtle words, to penetrate the profound essence, to gaze deeply into the source of the Dao, and to unravel the snares of the world. I shall examine the competitive and ostentatious hearts of worldly people and guide them with the gateway of naturalness.’ Thus, ‘profound and yet again profound’ is the gateway to all wonders. Later, both achieved their vows, and their writings all conveyed the meaning of the Dao. Yet people today do not know they were Perfected Immortals. They take Zhuāngzǐ’s works as mere allegories. The Great Peng, the Great Tree, and the Dark Spirit are all records of actual things, not empty fabrications. Where things are vast, such great beings arise. In the present day, in the gardens of Làng, on Kūnlún, in Pénglái, and in the Northern Sea, such divine creatures all exist. Where things are small, small beings arise. If one insists that only what the eye sees is real and what it does not see is nonexistent, then much of what exists in the world would be denied. In the parables of Daoist scriptures, when speaking of the vastness of kalpas, there is a stone as large as Mount Kūnlún and a mustard seed within a forty-*lǐ* expanse. Heavenly beings in gauze robes brush this stone once every hundred years, and when the stone is worn away, it is like the end of a kalpa. Who could believe in such vast durations?*\n\n*The* Língbǎo Sūtras *are the root of all scriptures, difficult to express in words. The five thousand characters of the* Dàodéjīng *are subtle and wondrous, and the great meaning of all scriptures ultimately returns to one. The thirty-nine chapters of the* Dòngzhēn *are spoken by thirty-nine Perfected. They are the scriptures of non-birth. These Perfected transmitted them forth. Their virtue, power, and true qi blend and transform naturally into Perfected, peers of Lǎozǐ. They have traversed endless kalpas, not as those who merely study the Dao. Unless one has accumulated profound merit and virtue from past lives, one who obtains the* Dòngzhēn *scriptures cannot comprehend their meaning. What they describe are the natural palaces of the Three Supreme Heavens and the myriad things of mountains and rivers. Though the names of these mountains, rivers, and things may coincide with those of the world, they are not the mountains, rivers, and things of this world. They are all natural entities, audible but difficult to distinguish. The* Dòngzhēn Yùqīng Sūtra *briefly explains their meaning, but cannot exhaust the details—how could they be grasped by mere thought? Those who uphold them gain great fortune, attain longevity, and ensure the peace of their ancestral temples. Those who recite them become kings among Perfected, for their Dao is supreme. In the past, those who attained the Dao of the highest immortality and utmost Perfection all upheld the* Língbǎo Sūtras. *The Three Heavens call them immortals; the Brahmā Heaven calls them Daoists. Heaven and Earth have their ends and beginnings, thus there are great and small kalpas, and all scriptures perish with them. Later sages will produce new Dharmas, but only the five thousand characters of the* Dàodéjīng*, the* Dòngzhēn *scriptures, and the* Língbǎo *are imperishable and endless, transmitted without end. Thus they are called the scriptures of non-birth, the kings of all scriptures. Therefore, those who teach and transform in each generation to achieve the Dao of immortality do not know their source in past lives. Vast and majestic, they are not seen by ghosts and spirits. Only the great demon kings of the Six Heavens come to honor the scripture masters, while the celestial officials of the Three Supreme Heavens oversee and inspect them. This is not something lesser immortals can hear of; only the Perfected can study it. Yet people today do not know that Daoists are immortals, and say that immortals are not Daoists—all because their karmic conditions from past lives are not yet exhausted.\"*",
      "overlap_context": "ellow and the Old is the method for examining the seeds of humanity. Among ten thousand, perhaps one or two are genuine.\"*\n\nThe Perfected of the Great Ultimate says: *\"If a scholar can cast aside worldly burdens and aspire to wander among mountains and rivers, upholding the Dharma-wheel of the Supreme Ultimate, they may be called a Master. They should sit upon a high seat to recite the scriptures, teaching and transforming the foolish and the wise, guiding and delivering all who seek to learn.\"*",
      "start_char": 6239,
      "end_char": 7472,
      "start_sentence": 244,
      "end_sentence": 298,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.396029472351074,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太极真人敷灵宝紫戒威仪诸经要诀.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "对尽自得玄解大智慧，朗然知之，知之得道矣。 五千文至难知，有知之人皆知之。 故曰当解无上大慧也。 太极真人曰：建灵宝斋法，举高德玄解经义者为法师。 次才智精明，能通妙理，闻见法度为都讲。 次监斋，弹罚非法。 次侍经，次侍香，次侍灯，次第坐处。 先受此经为上，后受为下。 家一人受经，余人有好斋者，听斋。 若时有黄赤太一祭酒，好见斋法者，听斋，观大法化，但不得同床而坐。 纵复至德，人间名望於世，悉当在后行，以其治箓为次第也。 烧香同尔。 所以尔者，其人宿有微缘，故今得预之矣。 太极真人曰：斋时皆心注玄真，永无外想。 想念在经师，先思三一在宫室，安居分明，具三魂七魄，太一镇泥丸中，如回风帝一法。 然后与兆俱斋听经，口受心存，则三尸亡走，邪气灭去，内外受真，如此近仙矣。 傍吐纳导引和液，行上诸妙道，天真恐必降子也。 上士得道於室内矣。 虽处岩穴，而外想一毫不绝，亦徒劳损力尔。 学道唯心尽，心尽，仙人当下观试之也。 子善详察之焉。 太极真人曰：道士远绝人迹，静栖名山，修是长斋，独处幽谷，则不复选法师，唯心与口谈矣。 人间修是斋，道士服食五谷，断无所饵则已，若服药物，正中服之也。 过中听饮，清饮而绝食，平旦饮粥，日中菜食。 斋限竟，解斋，如设大厨状，唯宜洁净尔。 果随时珍，当先行香祝愿也，愿斋主升仙度世。 太极真人曰：修斋之道，常行十善念： 第一为道念四大，令得七世父母免脱忧苦，上升天堂，衣食自然。 第二念帝王国主道化兴隆，庠序济济，皇教恢弘，威仪翼翼，普天所瞻，民称太平，六夷宾伏，妖恶日灭，贤圣日生。 第三念法师功德大建，教化明达，俱获飞仙。 第四念同志学人，早得仙道，更相开度。 第五念亲属和睦，好尚仁义，贵道贱财，行为物范。 第六念损身布施道士及饥寒者，天下民人，各得其所。 第七念蠕动蚑行，一切众生，咸蒙成就。 第八念首谢前世今世生死罪对，立功补过。 第九念家门隆盛，宗庙有人，世生贤才。 第十念尊受师经，无敢中怠，平等一心，广度一切，我身升仙，白日登天，拜见太上，永成真人，服五色灵液，与道合同。 郑先生曰：登山受经时，亦不须拜章，口启之尔。 颂曰： 道以斋为先，勤行登金阙。 故设大法桥，普度诸人物。 宿世恩德报，道心超然发。 身飞升玄都，七祖咸解脱。 受竟，必颂此文。 南岳先生郑君曰：吾先师仙公，常秘此书，非至真不传也，万金不足珍矣。 仙人相授於口，今故书之。 仙公言：书一通封还名山，一通传弟子，一通付家门子孙，世世录传，知道者也。 与灵宝本经俱授之，道家要妙也。 抱朴子曰：洪意谓大斋日数多者，或是贵人，或是道士，体素赢弱不堪，日夕六时礼拜。 愚欲昼三时烧香礼拜，夜可阙也。 为当讲法义而已，能六时烧香者，自当全法尔。 恐人未得道，气力极弱，但欲一日一夜斋此，可六时行道也。 学者其善详用焉。 建斋极，可食乾枣、鹿脯腊，是生鲜之物，一不得享也。 若非山学道士，居家修经者，岂能长斋久思哉。 要当应斋，少可十日、九日、七日、三日、一日行道矣。 斯功德弘普，学道之上法，七祖离苦毒，上升福堂，此可谓至孝之道也。",
      "translated_text": "When one’s karmic conditions are exhausted, one naturally attains profound understanding and great wisdom, clearly perceiving all—this is knowing, and knowing is attaining the Dao. The *Five Thousand Characters* is most difficult to comprehend, yet those who know it know it fully. Thus it is said: one must grasp the supreme great wisdom.\n\nThe Perfected of the Great Ultimate says: In establishing the *Língbǎo* fast, those of lofty virtue and profound understanding of the scriptures’ meaning are appointed as Dharma Masters. Next are those of keen intelligence and penetrating insight, able to fathom the subtle principles and comprehend the precepts—they serve as Chief Reciters. Then come the Fast Overseers, who correct and penalize improper conduct. Following them are the Scripture Attendants, Incense Attendants, and Lamp Attendants, each with their designated seating. Those who first receive this scripture hold the highest rank; those who receive it later hold a lower one. If one person in a household receives the scripture, others in the family who wish to observe the fast may do so. If at any time a Yellow-Red Grand Unity Libationer, fond of witnessing the fast’s rites, wishes to attend, they may observe the great Dharma transformation—but may not sit on the same platform. Even those of the utmost virtue, renowned in the world, must take their place behind, following the order of their register’s rank. The same applies to the burning of incense. The reason for this is that such individuals have subtle karmic affinities from past lives, and thus are now permitted to participate.\n\nThe Perfected of the Great Ultimate says: During the fast, one’s heart must be fixed on the mysterious and true, with no extraneous thoughts. Direct your thoughts to the Dharma Master, first envisioning the Three Ones residing in their palaces, settled in clarity, with the three *hún* and seven *pò* fully present, and the Grand Unity stationed in the *níwán* within the head, as in the *Huífēng Dìyī* method. Then, together with the initiate, observe the fast and listen to the scripture, receiving it with the mouth while contemplating it with the heart. Thus the Three Corpses flee, perverse *qi* is extinguished, and one receives the true both internally and externally—such is nearness to immortality. Additionally, practice exhalation and inhalation, guide and harmonize the fluids, and cultivate all the sublime Daoist arts. Then the celestial perfected will surely descend upon you. The superior adept attains the Dao within the chamber. Even if dwelling in mountain caves, if the slightest extraneous thought persists, one’s efforts are in vain, labor and strength wasted. In learning the Dao, only the heart’s exhaustion matters—when the heart is exhausted, the immortals will immediately observe and test you. You would do well to examine this carefully.\n\nThe Perfected of the Great Ultimate says: If a Daoist retreats far from human traces, dwelling in seclusion on a famous mountain, observing a perpetual fast and residing alone in a secluded valley, there is no need to select a Dharma Master—only the heart and mouth converse. For those observing the fast in the world, Daoists who consume the five grains may simply abstain from other foods; if taking medicinal substances, they should do so precisely at noon. After noon, they may drink clear liquids but abstain from solid food. At dawn, they may take congee, and at midday, vegetable fare. When the fast’s term concludes, the breaking of the fast should resemble the preparation of a grand feast, with utmost purity. Seasonal fruits should be offered first, accompanied by incense and prayers, wishing the fast’s sponsor to ascend as an immortal and transcend the world.\n\nThe Perfected of the Great Ultimate says: The way of the fast entails constantly cultivating ten virtuous thoughts:\nFirst, for the Dao, contemplate the four great elements, so that the seven generations of one’s parents may be freed from suffering, ascend to the celestial halls, and enjoy natural sustenance.\nSecond, contemplate the flourishing of the Dao’s transformation under the emperor and rulers, with schools thriving, imperial teachings vast, and majestic rites resplendent, admired by all under heaven. May the people praise great peace, the six barbarians submit, evil daily diminish, and sages daily increase.\nThird, contemplate the Dharma Master’s great merit, that their teachings may be luminous and all attain flying immortality.\nFourth, contemplate fellow learners of the Dao, that they may swiftly attain immortality and mutually guide one another.\nFifth, contemplate harmonious kinship, esteeming benevolence and righteousness, valuing the Dao and despising wealth, serving as models for all.\nSixth, contemplate selflessly bestowing alms upon Daoists and the hungry and cold, so that all people under heaven may find their rightful place.\nSeventh, contemplate all crawling and creeping beings, that all sentient life may attain fulfillment.\nEighth, contemplate repenting and making amends for the transgressions of past and present lives, establishing merit to compensate for faults.\nNinth, contemplate the prosperity of the family line, with ancestral temples maintained and worthy descendants born in every generation.\nTenth, contemplate reverently receiving the master’s scripture without negligence, maintaining equanimity and single-mindedness to broadly deliver all beings. May my own body ascend as an immortal, ascend to heaven in broad daylight, pay homage to the Most High, eternally become a Perfected, partake of the five-colored numinous fluid, and merge with the Dao.\n\nMaster Zhèng says: When ascending the mountain to receive the scripture, there is no need to present a memorial—simply make an oral petition. The ode states:\nThe Dao takes the fast as foremost,\nDiligently practiced, one ascends the golden towers.\nThus is the great Dharma bridge established,\nUniversally delivering all beings.\nRepaying the kindness of past lives,\nThe heart of the Dao arises transcendent.\nThe body soars to the Mysterious Capital,\nAnd the seven ancestors are all liberated.\nUpon completion of the transmission, this text must be recited.\n\nMaster Zhèng of Nányuè says: My former master, the Immortal Lord, always kept this book secret, transmitting it only to the utmost Perfected—its value surpasses ten thousand gold. Immortals passed it down orally, and now it is recorded here. The Immortal Lord said: Copy one version to seal and return to a famous mountain, transmit one to a disciple, and entrust one to descendants in the family line, to be recorded and transmitted through generations by those who know the Dao. It should be transmitted together with the original *Língbǎo* scripture—this is the essential subtlety of the Daoist tradition.\n\nBàopǔzǐ says: My humble opinion is that for grand fasts lasting many days, whether for nobles or Daoists, those with inherently frail constitutions may find it difficult to perform the six daily periods of bowing. I suggest that during the day, at the three periods, one may burn incense and bow, while at night, it may be omitted—engaging instead in the recitation of Dharma teachings. Those capable of burning incense during all six periods should naturally uphold the full rite. But for those who have not yet attained the Dao and whose strength is weak, even observing the fast for a single day and night—practicing the Dao during the six periods—is sufficient. Learners would do well to consider and apply this carefully. When establishing the fast, one may eat dried jujubes and dried venison—these are raw and fresh foods, and no other offerings may be made. For those who are not mountain-dwelling Daoists but study the scriptures at home, how can they maintain a perpetual fast and prolonged contemplation? They should observe the fast as appropriate, for at least ten, nine, seven, three, or one day, practicing the Dao. Such merit is vast and universal, the supreme method of learning the Dao. The seven ancestors are freed from suffering, ascend to the halls of blessing—this may be called the way of utmost filial piety.",
      "overlap_context": "in past lives. Vast and majestic, they are not seen by ghosts and spirits. Only the great demon kings of the Six Heavens come to honor the scripture masters, while the celestial officials of the Three Supreme Heavens oversee and inspect them. This is not something lesser immortals can hear of; only the Perfected can study it. Yet people today do not know that Daoists are immortals, and say that immortals are not Daoists—all because their karmic conditions from past lives are not yet exhausted.\"*",
      "start_char": 7472,
      "end_char": 8750,
      "start_sentence": 299,
      "end_sentence": 355,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.73170018196106,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太极真人敷灵宝紫戒威仪诸经要诀.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "孝悌之至，通於神明，远延七玄，何但祖考乎。 故上仙秘之也。 太极真人敷灵宝斋戒威仪诸经要诀竟 #1 五千尺：疑当作「五十尺」",
      "translated_text": "The utmost of filial piety and fraternal duty reaches the divine spirits, extending far to the seven mysteries—how could it be limited to one’s ancestors alone? Thus, the perfected immortals keep this secret. The Supreme Ultimate Perfected One expounded the essential precepts of the *Numinous Treasure* fasts, precepts, and ritual decorum across the various scriptures—here concludes the text.\n\n*[Note: \"Five thousand feet\" appears to be a scribal error; it should likely read \"fifty feet.\"]*",
      "overlap_context": " no other offerings may be made. For those who are not mountain-dwelling Daoists but study the scriptures at home, how can they maintain a perpetual fast and prolonged contemplation? They should observe the fast as appropriate, for at least ten, nine, seven, three, or one day, practicing the Dao. Such merit is vast and universal, the supreme method of learning the Dao. The seven ancestors are freed from suffering, ascend to the halls of blessing—this may be called the way of utmost filial piety.",
      "start_char": 8750,
      "end_char": 8816,
      "start_sentence": 356,
      "end_sentence": 359,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.8806607723236084,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太极真人敷灵宝紫戒威仪诸经要诀.txt",
        "category": "威仪类"
      }
    }
  ]
}