{
  "source_id": "太清经断谷法",
  "source_file": "chunked_daozang\\太清经断谷法.json",
  "total_chunks": 7,
  "total_original_chars": 3797,
  "total_translated_chars": 22126,
  "total_translation_time": 109.24054765701294,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\太清经断谷法.txt",
    "category": "方法类"
  },
  "full_translation": "**The *Taiqing Jing* Method of Grain Abstention**\n\n**Text Title:** *Taiqing Jing* Method of Grain Abstention. Author unknown. Likely a pre-Tang or early Tang dynasty work. One scroll. Base text from *Zhengtong Daoist Canon*, *Dongshen* Section, Methods Category.\n\n**Method of Consuming Pine Roots**\nTake the roots of a pine tree growing eastward, peel off the white bark, chop finely, dry in the sun, and pound into powder. Consume to satiety to abstain from grains. When thirsty, drink water.\n\n**Method of Consuming Poria (Fuling)**\nRemove the black skin of poria, pound into powder, and soak thoroughly in pure wine within an earthenware vessel. Cover with another earthenware vessel, seal tightly, and leave for fifteen days before opening. It will then resemble a chewable food. Consume three times daily, like a game piece, or take a square-inch spoonful in powdered form. This dispels hunger and thirst, eliminates illness, and prolongs life.\n\n**Another Method**\nGrind one *jin* each of poria and cinnamon bark into powder, mix with white honey, and form into pills the size of a chicken’s egg yolk. Take three times daily. This is Zhang Chang’s method for transcending the world.\n\n**Another Method**\nThree *jin* of poria powder, two *jin* of white wax, three *jin* of hempseed oil, one *jin* of pine resin, and one *dou* of white honey. First boil the honey three to five times, then add pine resin until it boils, followed by oil until it boils, then wax until it boils. Finally, add the poria powder and stir thoroughly. Form into pills the size of plum pits. Take one pill daily, or twice daily, to attain a thousand years without hunger.\n\n**Another Method**\nThree *sheng* of poria powder, five *jin* of white wax, and three *jin* of white honey. Steam together until cooked like one *shi* of rice, then pour into a vessel and form into pills the size of *wutong* seeds. Take ten pills at a time; if hungry, take another ten. After a hundred days, hunger ceases, and one pill daily suffices. Avoid other foods.\n\nAlternatively, extract juice from cogon grass roots, mix with this medicine, and steam. After a hundred days of consumption, the Jade Maiden will appear.\n\n**Another Method**\nFive *sheng* of poria powder, seven *jin* of oil pine resin, five *jin* of white wax, three *jin* of white honey, and two *sheng* of Sichuan perilla. Steam together until cooked like one *shi* of rice, then remove and form into pills the size of *wutong* seeds. Take ten pills initially, gradually increasing until hunger subsides. After ten days, take one pill daily. Refrain from other foods, but a little wine may be consumed. This is the method used by Master Cifa, who administered it in Chengdu. Many Daoists and laypeople benefited, and those who practiced the Dao or attended lectures could thereby transcend the world.\n\nFrom the *Scripture of the Five Talismans*.\n\n**Another Method**\n\nFirst, take six *dou* of water and boil four *dou* of white rice until cooked. Strain the dregs to yield four *dou* and five *sheng*, then place it in a non-porous vessel. Clarify it thoroughly, then finely grind five *jin* of small wheat grains and add them to the vessel, steaming them again after soaking overnight. Add five *sheng* of glutinous rice while the mixture is still warm, allowing it to ferment for two or three nights until fragrant. Then steam two *sheng* of *lin* rice and add it, letting it sit for one or two nights. Add one *sheng* of fine honey and stir evenly. Next, take five *jin* of finely sifted, high-quality poria and place it in a loose silk bag, submerging it in the liquid without letting it touch the bottom. Knead the bag by hand to ensure the liquid thoroughly permeates it. Seal the vessel with clay for twenty-one days, then remove the contents.\n\nOn the day before consumption, prepare fine food and maintain purity through fasting and abstention. The following morning, consume a portion the size of a pellet, finishing one *jin* by evening. Children may take half a *jin*. Thereafter, one will never suffer hunger or thirst. Drink only cool water, never warm. If grains are consumed, the effects of the medicine will immediately dissipate. From this point onward, take two pellets at midday, increasing to three at most. This wine must not be consumed casually—indeed, all wine is forbidden in this practice. This method is most effective for grain avoidance, and with prolonged use, divine spirits will descend to transmit their teachings.\n\nWhen consuming poria, strictly avoid sour or heating foods.\n\n**Another Method**\nTake one *shi* of *weimao* wood, wash and pound it thoroughly. Soak it in two *shi* of water overnight, then boil until half the liquid remains. Add five *sheng* of clear wine and boil again, reducing it to one *shi*. Strain the dregs and simmer over a low flame. Add two *sheng* of soybean powder and one *sheng* of asparagus root powder, then form into pellets the size of pellets. Take three pellets at dawn, once daily. For those dwelling in mountains or traveling long distances, this serves as a substitute for food, resisting wind and cold while prolonging life and preventing illness. This is the method used by Cui Yazi, where asparagus root is prepared by removing its core and skin.\n\n**Another Method**\nTake one *shi* of *weimao* wood and one *shi* of water, boiling it while gradually adding more water until three *shi* have been used and the wood is thoroughly softened. Strain the dregs and simmer the liquid in a bronze vessel. Form soybean powder into cakes two *cun* in diameter. Consume three cakes daily, holding them in the mouth until dissolved—do not swallow them whole. This will enable grain avoidance and longevity.\n\n**Another Method**\nTake two *shi* of *weimao* wood and boil it in three *shi* of water, gradually adding more until ten *shi* and five *dou* of liquid remain. Strain the dregs and place the liquid in a bronze vessel. Add five *sheng* of white honey, five *jin* of pine resin, and five *jin* of jujube paste, then simmer over a low flame until thickened. Consume one pellet the size of a chicken’s egg, three times daily. This will eliminate hunger, cure all illnesses, and grant longevity. The pine resin must be fully refined.\n\nTake one *shi* of wood, break it into pieces, and place it in a cauldron. Boil until the liquid rises three times, then strain the decoction. Add two *shi* of water and boil thoroughly until softened. Combine with the previous decoction, then add one *sheng* of finely ground broomcorn millet and five *sheng* of white honey. Simmer over a low flame until thickened. Consume two cakes daily as usual—this will eliminate hunger, preserve vitality, and grant longevity.\n\n**Another Method**\nTake one *shi* of wood, break it into pieces, and boil in two *shi* of water until reduced. Add one *shi* of water and boil daily until thoroughly softened. Strain the dregs, then simmer further. Add three *sheng* of rice flour, one *sheng* of malt sugar, and half a *sheng* of fermented soybeans. Cook the rice until done, then transfer to a bronze vessel. Warm over a husk fire until pliable enough to form cakes, each weighing four *liang*. Initially, consume two cakes; when hunger returns, eat five cakes at once. After five days, reduce to four cakes; after ten days, reduce to three; after one month, reduce to two. Thereafter, one may go a year without further eating, eliminating hunger and attaining longevity.\n\n**Another Method**\nTake five *jin* of *zhu* (Atractylodes), pound and press to extract the juice, then mix with three *jin* of ground *fuling* (Poria). Form into pills the size of *wutong* seeds. Swallow three pills at midday and three in the evening—this will eliminate hunger and aging. With prolonged use, the Six Jia and Six Ding spirits will arrive, and one may command them.\n\n**Another Method**\nSteep wood shavings in wine, then steam and dry in the sun. Repeat this process nine times. Consume three *fangcunbi* daily—this will eliminate hunger and extend lifespan. The wood is best gathered in the eleventh, twelfth, first, or second lunar months.\n\nWhen consuming *zhu* (Atractylodes), avoid eating peaches. Also consume *huangjing* (Polygonatum).\n\n**Method for Polygonatum (Huangjing)**\nFinely chop one *shi* of *huangjing* (Polygonatum), then boil with two *shi* five *sheng* of water (some say six *shi*). Simmer over low heat from morning to evening until tender. Remove and cool, then crush by hand. Place in a cloth bag and press to extract the juice. Decoct the liquid, sun-dry the residue, and grind into powder. Combine with the decocted liquid in a cauldron and simmer until it can be formed into pills the size of chicken eggs. Take one pill three times daily to eliminate grain consumption, cure all illnesses, and attain a light, vigorous body free from aging. Consume modestly and regularly—excess or abrupt cessation is unnecessary. If thirsty, drink water. This formula is considered the finest, recorded in *The Five Talismans*.\n\n**Another Method**\nPress *huangjing* to extract three *sheng* of juice. If insufficient, add water and press again. Combine with three *sheng* each of fresh *dihuang* (Rehmannia) juice and *tianmendong* (Asparagus) juice, then simmer over low heat until reduced by half. Add five *jin* of white honey and continue simmering until it can be formed into pills. Take pills the size of a bullet thrice daily to banish hunger and enhance complexion. Alternatively, press to extract three *sheng* of juice and simmer over a water bath until pliable for pill-making. Consume one pill the size of a chicken egg twice daily—after thirty days, one will no longer feel hunger and may run as swiftly as a galloping horse. Remove the heart and skin of *tianmendong* before use.\n\n**Another Method**\nTake one *shi* of *huangjing* roots, wash and scrape clean, then boil in two *shi* of water. Add five *sheng* of wine and continue boiling until the flavor is fully extracted. Press to obtain the juice and store it tightly. Further boil the residue until tender, press again, and combine the two juices. Clarify and retain the finest portion, then place in a copper vessel over a water bath and simmer until it resembles malt sugar. Roast soybeans and grind into powder, then form into pills with the syrup. Take one pill the size of a chicken egg thrice daily to eliminate hunger. After a hundred days, one may run as fast as a galloping horse. Alternatively, roasted sesame may replace soybeans, or rice may be added to create a fragrant, hunger-suppressing gruel. This method is also recorded in *The Five Talismans*. Harvest *huangjing* in winter or the second and third lunar months of spring for best results. When consuming *huangjing*, avoid eating plums and similar fruits.\n\n**Method for Solomon’s Seal (Weiluo)**\nGather the leaves in the second and ninth lunar months, chop, dry, and process. Take one *fangcunbi* thrice daily. Alternatively, prepare as a confection following the *huangjing* method. This guides the flow of *qi* and vessels, strengthens sinews and bones, treats wind-stroke, relaxes contracted sinews and knotted flesh, smooths facial wrinkles, and enhances complexion. Prolonged use bestows longevity and transcendence.\n\n**Method for Asparagus (Tianmendong)**\nGrind ten *jin* of dried *tianmendong* and one *sheng* of apricot kernels into powder, then mix with honey. Take one *fangcunbi* thrice daily and once at night. This was consumed by Gan Shi and is called \"Immortal’s Provisions.\"\n\n**Another Method**\nTake three *shi* of *tianmendong*, remove the heart and skin, then press to extract one *shi* of juice.\n\nGently simmer over low heat until reduced to five *sheng*, then skim off the froth floating on the surface. Add one *sheng* of white honey and two *sheng* of toasted sesame seed powder, blending and stirring continuously until the mixture can be formed into pills. Shape into cakes with powdered *doujuan* (soybean sprouts), each three *cun* in diameter and half a *cun* thick. Consume one cake daily; after a hundred days, hunger ceases, the flesh becomes supple and lustrous, and life is prolonged. Alternatively, add three *sheng* of rehmannia juice and simmer together. This formula is said to be the finest, recorded in *The Five Talismans*.\n\n**Another Method**\nPeel *tianmendong*, steam thoroughly, then press and place in a cauldron. Simmer over low heat, adding one-quarter part powdered soybeans, and blend until it can be formed into cakes. Consume three cakes the size of chicken eggs to sate hunger and enhance complexion. The best time for harvest is the second and eighth lunar months. When consuming *tianmendong*, avoid carp.\n\n**Method for Giant Sesame (Husheng)**\nSelect plump, black sesame seeds in any quantity. Winnow and clean, then steam until thoroughly heated—about the time it takes to cook a meal—before removing and sun-drying. The next day, steam and dry again. Repeat this process nine times. Alternatively, under strong sunlight, steam and dry three times a day for three days, totaling nine cycles, until fully desiccated. Lightly moisten with water in a mortar, pound, then dry again in the sun. Winnow to remove the husks, toast until fragrant, and swiftly grind into fine powder. Consume at will, two to three *sheng* daily. It may also be mixed with honey into pills the size of goose eggs, taking five daily. Alternatively, blend with malt syrup or dissolve in wine. Gradual consumption eliminates all illness within a hundred days; after a year, the skin becomes smooth and lustrous, impervious to water. After five years, one is immune to harm from water or fire and can run as swiftly as a galloping horse.\n\n*Baopuzi* states: \"This formula was originally unknown east of the Yangtze. During the Yong’an reign of Emperor Hui (Year Jiazi), it was obtained amid the chaos in Luoyang. I, residing in seclusion on the first day of the eighth month in the second year of Yongxing, deemed it a vital secret.\"\n\n**Another Method**\n\nTake nine-times-steamed [grain] measuring one *shi*, add three *jin* of *fuling* (Poria cocos), and form into honeyed pills. Consume as above; the effects manifest swiftly.\n\n**Another Method**\nTake fully steamed [grain] measuring one *dou* and two *sheng*, twenty-four *liang* of *fuling*, and eight *liang* of *zexie* (Alisma orientalis). Grind thirty thousand strokes. Take doses the size of hazelnuts, three times daily. Alternatively, form into honeyed pills; these may be prepared in advance for military campaigns. When entering mountains or fording rivers, they prevent fatigue and emaciation, and one may eat whatever is available without restrictions or taboos.\n\n**Another Method**\nTake one *shi* of raw sesame seeds, remove the outer husks, steam for one day, dry in the sun, and grind. Pour one *shi* and five *sheng* of water into a cauldron, steam again until the water reduces by five *sheng*, then mix with cooked rice and spread onto a wooden tray, dousing thoroughly with hot water. Add one *sheng* of toasted wheat bran, stir into malt sugar, and promptly strain the liquid to boil it down to one-third its volume. Further reduce over a copper vessel in a water bath until it can be formed into pills. Consume pills the size of chicken eggs, three at a time. After a hundred days, the flesh becomes full and robust, and lifespan extends indefinitely. For those initially ravenous when first consuming sesame, prepare a single serving of plain rice porridge every five days, then gradually extend to ten days before another serving. Over time, this may cease entirely. When consuming sesame, avoid all foul or raw foods. If persistent diarrhea occurs, boil dried perilla leaves and drink the infusion.\n\n**Miscellaneous Grains for Consumption**\nMix four *sheng* of rice with four *liang* of genuine musk, stirring thoroughly. Cook as one would a *shi* of rice, then eat to satiety; this sustains one for four years.\n\n**Another Method**\nCrush five thousand apricot kernels, extract approximately two *dou* of white juice, and boil down to eight or nine *sheng*. Soak one *sheng* (or up to five *sheng*) of rice—no more—then grind and steam until the steam rises. Add one *fen* of lead powder to the apricot juice, stir well, mix with the rice, and steam again until all liquid is absorbed, yielding a consistency like jujube paste. Prepare the rice the night before and consume the next day. This suffices for two people for a hundred days or one person for a year without hunger. To later purge the medicine, drink mallow soup.\n\n**Another Method**\nTake five *ge* each of polished rice, broomcorn millet, wheat, hemp seeds, and roasted soybeans, add one *jin* of white honey, and bring to a single boil. Form into pills the size of plums in cold water, then swallow them all at once to remain sated for life. One variant omits the broomcorn millet. Recorded in *The Five Talismans*.\n\n**Another Method**\n\n**Another Method**\nTake one *sheng* of fine white rice and three *jin* of red halloysite. Mix them with water until fully submerged, then place in a warm location. After two or three days, a film will form on the surface. Pound this into pills the size of plums. Consume three pills daily to banish hunger and thirst. Drink water as needed to travel a thousand *li* without fatigue. Recorded in *The Five Talismans*.\n\n**Another Method**\nSoak one *shi* of polished rice in water for twenty-one days, then grind into powder and dry in the sun. Prepare as porridge: one *sheng* of powder yields three servings. Consuming this sustains one for a day, preserving strength, complexion, lightness of body, and clarity of vision.\n\n**Another Method**\nTake three *sheng* of finely ground barley, one *jin* of Sichuan perilla, and five *sheng* of hot water. Mix the perilla paste into the water, then soak the barley until saturated. Dry in the sun, lightly roast until fragrant, and repeat the soaking and drying until all liquid is absorbed. Grind finely, then add one *jin* each of licorice and wood shavings, two *jin* of poria powder, and one *sheng* of salt. Mix well and take two *fangcunbi* with water, three or four times daily. If thirsty, increase the dose to five *ge*. When encountering rice, vegetables, or other foods, consume them freely without restriction. In times of peril, famine, or hardship, this sustains life indefinitely, staving off hunger and prolonging years.\n\n**Another Method**\nTake one *shi* of barley and three *jin* of Sichuan perilla paste. Prepare four *sheng* of hot water, dissolve the paste in it, and consume after the initial full meal. Gradually increase intake to eliminate hunger, dispel cold and heat, and extend lifespan.\n\n**Simple and Direct Method for Sustaining the Center**\nSelect three *sheng* of viable soybeans, rub them by hand until glossy and warm. After a hearty meal, swallow them whole at once to stave off hunger for fifty to a hundred days. Drink water when thirsty, but consume no other food. To purge the medicine, drink two *sheng* of hot porridge, and the beans will pass. Another variant: face the sun, bow twice, then take one *sheng*, chewing thoroughly in the mouth before swallowing. Repeat thrice daily. The next day, divide one *sheng* into three doses. For children, halve the amount. Alternatively, swallow two to three *sheng* of red bean meat to sustain oneself for a year. Another method: take three *sheng* of yellow soybean powder in a single dose to go without food for ten or five days. To purge, take one *fangcunbi* of mallow stem ash, followed by lard and fermented milk products.\n\n**Another Method**\nChew a piece of wax the size of a *chuanmu* until soft, then place it inside a plump jujube and chew together until fully dissolved and swallowed. This halts heat, cures illness, and enables grain avoidance. Alternatively, consume one *fangcun* of wax at dawn to ward off hunger for a day.\n\n**Another Method**\nDry and pound black mulberries, then take three *ge* with water thrice daily to banish hunger.\n\n**Another Method**\nCombine three *jin* each of cow’s milk fat, sheep’s milk fat, pine resin, wax, and honey. Boil together and consume to sustain oneself for three years without hunger.\n\n**Another Method**\nMix one *sheng* of asparagus root powder, one *sheng* of pine resin, and one *sheng* each of wax and honey. Boil together and form into pills the size of *wutong* seeds. Take three pills the size of marbles at midday daily to banish hunger and enhance complexion. This is said to be a secret formula from Cui Wen’s own hand. Remove the heart and skin of the asparagus root.\n\n**Methods for Resuming Grain Consumption After Sustaining the Center**\nAfter taking medicines to avoid grain, refrain from consuming miscellaneous foods. If thirsty, drink only a little cold water. To resume grain consumption, first take mallow seed decoction to purge the medicine, then proceed as follows:\nOn the first day, consume porridge made from one *ge* of rice thrice daily. On the second day, increase to two *ge* of rice twice daily. After three more days, take five *ge* of rice. After another three days, take seven *ge*. After yet another three days, consume one *sheng* daily. After a month, return to normal eating.\n\n**Mallow Seed Decoction**\nTake one *sheng* of mallow seeds and one *jin* of pig fat. Boil in five *dou* of water until reduced to two *sheng*. Strain and consume gradually until the medicine is fully purged. Alternatively, mix with rice to make a thin porridge, or add Sichuan perilla for better effect.\n\n**Another Method**\nGrind equal parts mallow seeds and nitre into powder. Take one *fangcunbi* with rice water twice daily for ten days until the medicine is fully purged, then resume grain consumption. Alternatively, take one *sheng* each of mallow seeds and nitre with three *sheng* of rice, boil until reduced to one *sheng*, and consume thrice daily.\n\n**Another Method**\nGrind hemp seeds, boil until soft, and drink five *sheng* to purge the medicine. Alternatively, prepare as a thin gruel and consume with rich, smooth foods for best results.\n\n*The Scripture of the Great Clarity’s Methods for Avoiding Grain* concludes here.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太清经断谷法 经名：太清经断谷法。 未着撰人。 似随唐前故籍。 一卷。 底本出处：《正统道藏》 洞神部方法类。 太清经断谷法 服食松根 取东行松根，剥取白皮，细到曝燥梼提，饱食之＋，可绝谷，渴则饮水。 服食袂苓 袂苓削去黑皮，梼末，以醇酒於瓦器中渍，令足淹。 又瓦器覆上，密封涂，十五日发，当如饵食。 如博暮日三，亦可屑服方寸匕，不饥渴，除病延年。 又法 袂苓、肉桂各一斤，末之，白蜜丸如鸡子黄大，日三服，此张常度世法。 又法 狭苓末三斤，白蜡二斤，麻子油三斤，松脂＝一斤，白蜜一蚪。 先煎蜜三五沸，纳松脂沸，纳油油沸，纳蜡蜡沸，纳袂苓末熟搅匀，丸如李核大，每日服一丸，日可再服，得千岁不饥。 又法 狭苓末三升，白蜡五斤，白蜜三斤，合蒸如炊一石米熟，倾器中丸，丸如梧桐子大，每服十丸，饥者复服十丸，百日后不饥，乃日服一丸，禁杂食。 又取茅根梼取汁，和此药蒸，服之百日后，玉女至。 又法 狭苓末五升，油松脂七斤，白蜡五斤，白蜜三斤，蜀苏二升，合蒸如炊一石米熟，取出丸，丸如梧桐子大。 服十丸，稍增，以不饥为度。 十日后服一丸，勿余食，可饮少酒。 此是慈法大师依方施用，於成都将服．’道俗蒙济者多，行道听讲者众，便可度世也。 出《 五符经》 。 又法",
      "translated_text": "**The *Taiqing Jing* Method of Grain Abstention**\n\n**Text Title:** *Taiqing Jing* Method of Grain Abstention. Author unknown. Likely a pre-Tang or early Tang dynasty work. One scroll. Base text from *Zhengtong Daoist Canon*, *Dongshen* Section, Methods Category.\n\n**Method of Consuming Pine Roots**\nTake the roots of a pine tree growing eastward, peel off the white bark, chop finely, dry in the sun, and pound into powder. Consume to satiety to abstain from grains. When thirsty, drink water.\n\n**Method of Consuming Poria (Fuling)**\nRemove the black skin of poria, pound into powder, and soak thoroughly in pure wine within an earthenware vessel. Cover with another earthenware vessel, seal tightly, and leave for fifteen days before opening. It will then resemble a chewable food. Consume three times daily, like a game piece, or take a square-inch spoonful in powdered form. This dispels hunger and thirst, eliminates illness, and prolongs life.\n\n**Another Method**\nGrind one *jin* each of poria and cinnamon bark into powder, mix with white honey, and form into pills the size of a chicken’s egg yolk. Take three times daily. This is Zhang Chang’s method for transcending the world.\n\n**Another Method**\nThree *jin* of poria powder, two *jin* of white wax, three *jin* of hempseed oil, one *jin* of pine resin, and one *dou* of white honey. First boil the honey three to five times, then add pine resin until it boils, followed by oil until it boils, then wax until it boils. Finally, add the poria powder and stir thoroughly. Form into pills the size of plum pits. Take one pill daily, or twice daily, to attain a thousand years without hunger.\n\n**Another Method**\nThree *sheng* of poria powder, five *jin* of white wax, and three *jin* of white honey. Steam together until cooked like one *shi* of rice, then pour into a vessel and form into pills the size of *wutong* seeds. Take ten pills at a time; if hungry, take another ten. After a hundred days, hunger ceases, and one pill daily suffices. Avoid other foods.\n\nAlternatively, extract juice from cogon grass roots, mix with this medicine, and steam. After a hundred days of consumption, the Jade Maiden will appear.\n\n**Another Method**\nFive *sheng* of poria powder, seven *jin* of oil pine resin, five *jin* of white wax, three *jin* of white honey, and two *sheng* of Sichuan perilla. Steam together until cooked like one *shi* of rice, then remove and form into pills the size of *wutong* seeds. Take ten pills initially, gradually increasing until hunger subsides. After ten days, take one pill daily. Refrain from other foods, but a little wine may be consumed. This is the method used by Master Cifa, who administered it in Chengdu. Many Daoists and laypeople benefited, and those who practiced the Dao or attended lectures could thereby transcend the world.\n\nFrom the *Scripture of the Five Talismans*.\n\n**Another Method**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 542,
      "start_sentence": 0,
      "end_sentence": 27,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.334816217422485,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清经断谷法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "先以水六斗，煮白米四斗令熟，去滓，得四斗五升，置不津器中，澄伶之，细到小麦够五斤，纳中再宿炊。 秣米五升，玲暖随时投之，二三宿视香好，复炊林米二升投之，一二宿。 纳好蜜一升，搅令匀，乃以精狭苓屑五斤，新绢囊宽结口，纳酒中令没，勿使至底，手授没令汁得雨，入囊中，封泥二十一日，取出。 当服饵先日，作佳食，清洁斋戒，明旦服如弹丸，至暮令尽一斤，小儿可半斤，则终身不饥渴。 饮玲水，不可温饮。 ！ 若食谷药立下。 自此以后，日中正服两丸，至三丸耳。 其酒不可自饮。 凡酒亦然，至忌。 此法以断谷最胜，久久神灵降传。 凡服食狭苓，切禁食酸物及热物。 服食卫 成治木一石，诤洗梼之。 水二石渍一宿，煮臧半，加清酒五升重煮，取一石，绞去｀滓，更微火煎熬。 纳大豆末二升勺天门冬末一升，搅和丸如弹丸。 旦服三丸，日一。 或山居远行代食，耐风寒，延寿无病。 此崔野子所服法，天门冬去心皮也。 又法 成治木一石，水一石，煮之稍益，至三石水尽消烂，绞去滓，铜器中煎熬，大豆屑作饼，圆二寸。 日食三枚，纳口中良久令消，勿顿吞之，则断谷而长生。 又法 成治木二石，以水三石煮之稍益，至十石五蚪许，乃绞去滓，出着铜器中，纳白蜜五升，松脂五斤，枣膏五斤，搅和微火煎如精。 服一丸如鸡子大，日三，不饥，除百病长生。 松脂用成炼者。 又法",
      "translated_text": "First, take six *dou* of water and boil four *dou* of white rice until cooked. Strain the dregs to yield four *dou* and five *sheng*, then place it in a non-porous vessel. Clarify it thoroughly, then finely grind five *jin* of small wheat grains and add them to the vessel, steaming them again after soaking overnight. Add five *sheng* of glutinous rice while the mixture is still warm, allowing it to ferment for two or three nights until fragrant. Then steam two *sheng* of *lin* rice and add it, letting it sit for one or two nights. Add one *sheng* of fine honey and stir evenly. Next, take five *jin* of finely sifted, high-quality poria and place it in a loose silk bag, submerging it in the liquid without letting it touch the bottom. Knead the bag by hand to ensure the liquid thoroughly permeates it. Seal the vessel with clay for twenty-one days, then remove the contents.\n\nOn the day before consumption, prepare fine food and maintain purity through fasting and abstention. The following morning, consume a portion the size of a pellet, finishing one *jin* by evening. Children may take half a *jin*. Thereafter, one will never suffer hunger or thirst. Drink only cool water, never warm. If grains are consumed, the effects of the medicine will immediately dissipate. From this point onward, take two pellets at midday, increasing to three at most. This wine must not be consumed casually—indeed, all wine is forbidden in this practice. This method is most effective for grain avoidance, and with prolonged use, divine spirits will descend to transmit their teachings.\n\nWhen consuming poria, strictly avoid sour or heating foods.\n\n**Another Method**\nTake one *shi* of *weimao* wood, wash and pound it thoroughly. Soak it in two *shi* of water overnight, then boil until half the liquid remains. Add five *sheng* of clear wine and boil again, reducing it to one *shi*. Strain the dregs and simmer over a low flame. Add two *sheng* of soybean powder and one *sheng* of asparagus root powder, then form into pellets the size of pellets. Take three pellets at dawn, once daily. For those dwelling in mountains or traveling long distances, this serves as a substitute for food, resisting wind and cold while prolonging life and preventing illness. This is the method used by Cui Yazi, where asparagus root is prepared by removing its core and skin.\n\n**Another Method**\nTake one *shi* of *weimao* wood and one *shi* of water, boiling it while gradually adding more water until three *shi* have been used and the wood is thoroughly softened. Strain the dregs and simmer the liquid in a bronze vessel. Form soybean powder into cakes two *cun* in diameter. Consume three cakes daily, holding them in the mouth until dissolved—do not swallow them whole. This will enable grain avoidance and longevity.\n\n**Another Method**\nTake two *shi* of *weimao* wood and boil it in three *shi* of water, gradually adding more until ten *shi* and five *dou* of liquid remain. Strain the dregs and place the liquid in a bronze vessel. Add five *sheng* of white honey, five *jin* of pine resin, and five *jin* of jujube paste, then simmer over a low flame until thickened. Consume one pellet the size of a chicken’s egg, three times daily. This will eliminate hunger, cure all illnesses, and grant longevity. The pine resin must be fully refined.",
      "overlap_context": " of rice, then remove and form into pills the size of *wutong* seeds. Take ten pills initially, gradually increasing until hunger subsides. After ten days, take one pill daily. Refrain from other foods, but a little wine may be consumed. This is the method used by Master Cifa, who administered it in Chengdu. Many Daoists and laypeople benefited, and those who practiced the Dao or attended lectures could thereby transcend the world.\n\nFrom the *Scripture of the Five Talismans*.\n\n**Another Method**",
      "start_char": 542,
      "end_char": 1093,
      "start_sentence": 28,
      "end_sentence": 54,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.35565447807312,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清经断谷法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "木一石，吹咀着釜中，煮三沸出汁。 又以水二石，熟煮令烂。 乃合向汁，纳青粱米屑一升，白蜜五升，微火煎如精，日食二饼，如常不饥，气力不散，长生。 又法 木一石吹咀之，以水二石煮耗，又以水一石，煮】 日令烂，去滓，更煎，纳稻米末三升，盥一升，豉半升，煮米令熟，出纳铜器中，糠火媪令可饼，饼重四两。 先食两饼，如饥顿食五饼，却五日食四饼，却十日食三饼，却一月食二饼，乃比岁不复食，不饥长生。 又法 术五斤，梼绞取汁，以和狭苓屑三斤，丸如梧桐子，日一中夕各吞三丸，不饥不老。 久服，六甲六丁神至，可役使。 又法 以酒服木屑，蒸曝乾，更没曝，如此九过止。 日服三方寸匕，不饥延年。 以十一月、＇十二月、正月、二月采之为佳。 凡服木，禁食桃也。 服食黄精",
      "translated_text": "Take one *shi* of wood, break it into pieces, and place it in a cauldron. Boil until the liquid rises three times, then strain the decoction. Add two *shi* of water and boil thoroughly until softened. Combine with the previous decoction, then add one *sheng* of finely ground broomcorn millet and five *sheng* of white honey. Simmer over a low flame until thickened. Consume two cakes daily as usual—this will eliminate hunger, preserve vitality, and grant longevity.\n\n**Another Method**\nTake one *shi* of wood, break it into pieces, and boil in two *shi* of water until reduced. Add one *shi* of water and boil daily until thoroughly softened. Strain the dregs, then simmer further. Add three *sheng* of rice flour, one *sheng* of malt sugar, and half a *sheng* of fermented soybeans. Cook the rice until done, then transfer to a bronze vessel. Warm over a husk fire until pliable enough to form cakes, each weighing four *liang*. Initially, consume two cakes; when hunger returns, eat five cakes at once. After five days, reduce to four cakes; after ten days, reduce to three; after one month, reduce to two. Thereafter, one may go a year without further eating, eliminating hunger and attaining longevity.\n\n**Another Method**\nTake five *jin* of *zhu* (Atractylodes), pound and press to extract the juice, then mix with three *jin* of ground *fuling* (Poria). Form into pills the size of *wutong* seeds. Swallow three pills at midday and three in the evening—this will eliminate hunger and aging. With prolonged use, the Six Jia and Six Ding spirits will arrive, and one may command them.\n\n**Another Method**\nSteep wood shavings in wine, then steam and dry in the sun. Repeat this process nine times. Consume three *fangcunbi* daily—this will eliminate hunger and extend lifespan. The wood is best gathered in the eleventh, twelfth, first, or second lunar months.\n\nWhen consuming *zhu* (Atractylodes), avoid eating peaches. Also consume *huangjing* (Polygonatum).",
      "overlap_context": " *shi* of *weimao* wood and boil it in three *shi* of water, gradually adding more until ten *shi* and five *dou* of liquid remain. Strain the dregs and place the liquid in a bronze vessel. Add five *sheng* of white honey, five *jin* of pine resin, and five *jin* of jujube paste, then simmer over a low flame until thickened. Consume one pellet the size of a chicken’s egg, three times daily. This will eliminate hunger, cure all illnesses, and grant longevity. The pine resin must be fully refined.",
      "start_char": 1093,
      "end_char": 1424,
      "start_sentence": 55,
      "end_sentence": 69,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.974318504333496,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清经断谷法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "黄精细切一石，以水二石五升，一云六石，微火煮，日一至夕，熟出使玲，手授碎，布囊笮取汁，煎之，滓曝燥梼末，合向釜中煎熬，可为丸，如鸡子。 服一丸，日三服，绝谷，除百病，身轻健不老。 少服而令有常，不须多而中绝，渴则饮水。 云此方最佳，出《五符》 中。 又法 取黄精梼捩，取汁三升。 若不出，以水浇笮取之。 生地黄汁三升，天门冬汁三升，合微火煎减半，纳白蜜五斤，复煎令可丸。 服如弹丸，日三服，不饥美色，亦可止笮取汁三升，汤上煎可丸，日食如鸡子大一枚，日再服，三十日不饥，行如奔马。 天门冬去心皮。 又法 取黄精根一石，洗刮净，以水二石煮之。 又以五升醉煮令味尽，笮取汁密盛渍之。 更煮滓亦令熟，取汁合二汁，澄取上好者，纳铜器中汤上，煎如饴末，熬大豆，丸如精。 服一鸡子大，日三，不饥，百日走及奔马。 亦可以熬胡麻代豆，亦可加米为精，香美止饥，出《五符》 中。 以冬日及春二、三月采佳，凡服黄精，禁食梅果等。 服食萎萝 常以二月、九月采叶，切乾治服方寸匕，日三，亦依黄精作饵法服之，导气脉，强筋骨，治中风，跌筋结肉，去面皱，好颜色，久服延年神仙。 服食天门冬 乾天门冬十斤，杏仁杳升梼末，蜜搜，服方寸匕，日三夜一。 甘始所服，名曰仙人粮。 又法 天门冬三石，去心皮，铸笮取汁一石。",
      "translated_text": "**Method for Polygonatum (Huangjing)**\nFinely chop one *shi* of *huangjing* (Polygonatum), then boil with two *shi* five *sheng* of water (some say six *shi*). Simmer over low heat from morning to evening until tender. Remove and cool, then crush by hand. Place in a cloth bag and press to extract the juice. Decoct the liquid, sun-dry the residue, and grind into powder. Combine with the decocted liquid in a cauldron and simmer until it can be formed into pills the size of chicken eggs. Take one pill three times daily to eliminate grain consumption, cure all illnesses, and attain a light, vigorous body free from aging. Consume modestly and regularly—excess or abrupt cessation is unnecessary. If thirsty, drink water. This formula is considered the finest, recorded in *The Five Talismans*.\n\n**Another Method**\nPress *huangjing* to extract three *sheng* of juice. If insufficient, add water and press again. Combine with three *sheng* each of fresh *dihuang* (Rehmannia) juice and *tianmendong* (Asparagus) juice, then simmer over low heat until reduced by half. Add five *jin* of white honey and continue simmering until it can be formed into pills. Take pills the size of a bullet thrice daily to banish hunger and enhance complexion. Alternatively, press to extract three *sheng* of juice and simmer over a water bath until pliable for pill-making. Consume one pill the size of a chicken egg twice daily—after thirty days, one will no longer feel hunger and may run as swiftly as a galloping horse. Remove the heart and skin of *tianmendong* before use.\n\n**Another Method**\nTake one *shi* of *huangjing* roots, wash and scrape clean, then boil in two *shi* of water. Add five *sheng* of wine and continue boiling until the flavor is fully extracted. Press to obtain the juice and store it tightly. Further boil the residue until tender, press again, and combine the two juices. Clarify and retain the finest portion, then place in a copper vessel over a water bath and simmer until it resembles malt sugar. Roast soybeans and grind into powder, then form into pills with the syrup. Take one pill the size of a chicken egg thrice daily to eliminate hunger. After a hundred days, one may run as fast as a galloping horse. Alternatively, roasted sesame may replace soybeans, or rice may be added to create a fragrant, hunger-suppressing gruel. This method is also recorded in *The Five Talismans*. Harvest *huangjing* in winter or the second and third lunar months of spring for best results. When consuming *huangjing*, avoid eating plums and similar fruits.\n\n**Method for Solomon’s Seal (Weiluo)**\nGather the leaves in the second and ninth lunar months, chop, dry, and process. Take one *fangcunbi* thrice daily. Alternatively, prepare as a confection following the *huangjing* method. This guides the flow of *qi* and vessels, strengthens sinews and bones, treats wind-stroke, relaxes contracted sinews and knotted flesh, smooths facial wrinkles, and enhances complexion. Prolonged use bestows longevity and transcendence.\n\n**Method for Asparagus (Tianmendong)**\nGrind ten *jin* of dried *tianmendong* and one *sheng* of apricot kernels into powder, then mix with honey. Take one *fangcunbi* thrice daily and once at night. This was consumed by Gan Shi and is called \"Immortal’s Provisions.\"\n\n**Another Method**\nTake three *shi* of *tianmendong*, remove the heart and skin, then press to extract one *shi* of juice.",
      "overlap_context": " will eliminate hunger and aging. With prolonged use, the Six Jia and Six Ding spirits will arrive, and one may command them.\n\n**Another Method**\nSteep wood shavings in wine, then steam and dry in the sun. Repeat this process nine times. Consume three *fangcunbi* daily—this will eliminate hunger and extend lifespan. The wood is best gathered in the eleventh, twelfth, first, or second lunar months.\n\nWhen consuming *zhu* (Atractylodes), avoid eating peaches. Also consume *huangjing* (Polygonatum).",
      "start_char": 1424,
      "end_char": 1971,
      "start_sentence": 70,
      "end_sentence": 93,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.594272136688232,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清经断谷法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "微火煎得五升，出浮汤上，纳白蜜一升，熬胡麻屑二升，合和煎搅勿息，令可丸，以大豆卷屑饼，圆三寸，厚半寸，日服一枚，百日不饥，肌肉润泽，延年。 亦可加地黄汁三升合煎。 此方云最佳，出《五符》 中。 又法 天门冬剥去皮，熟铸纳釜中，微火上煎，纳大豆末四分之一，合黄可饵食，如鸡子三枚，止饥美色。 以二月、八月采为佳。 凡服天门冬，禁食鲤鱼。 服食巨胜 胡麻肥黑者，取无多少，簸治蒸之，今热气周褊，如炊顷便出曝。 明旦又蒸曝。 凡九过止。 烈日亦可一日三蒸曝，三日凡九过燥讫。 以汤水微沾於臼中梼，使白复曝燥，簸去皮熬使香，急手梼下庞筏。 随意服，日二三升。 亦可以蜜丸，丸如鹅子，日服五枚。 亦可饴和之，亦以酒和服，稍稍自臧，百日无复病，一年后身面滑泽，水洗不着肉。 五年水火不害，行及奔马。 抱朴子云：江束本无此方，惠帝永安元年甲子岁洛乱，人得之。 余以永兴二年八月一日寓，以为要秘。 又法",
      "translated_text": "Gently simmer over low heat until reduced to five *sheng*, then skim off the froth floating on the surface. Add one *sheng* of white honey and two *sheng* of toasted sesame seed powder, blending and stirring continuously until the mixture can be formed into pills. Shape into cakes with powdered *doujuan* (soybean sprouts), each three *cun* in diameter and half a *cun* thick. Consume one cake daily; after a hundred days, hunger ceases, the flesh becomes supple and lustrous, and life is prolonged. Alternatively, add three *sheng* of rehmannia juice and simmer together. This formula is said to be the finest, recorded in *The Five Talismans*.\n\n**Another Method**\nPeel *tianmendong*, steam thoroughly, then press and place in a cauldron. Simmer over low heat, adding one-quarter part powdered soybeans, and blend until it can be formed into cakes. Consume three cakes the size of chicken eggs to sate hunger and enhance complexion. The best time for harvest is the second and eighth lunar months. When consuming *tianmendong*, avoid carp.\n\n**Method for Giant Sesame (Husheng)**\nSelect plump, black sesame seeds in any quantity. Winnow and clean, then steam until thoroughly heated—about the time it takes to cook a meal—before removing and sun-drying. The next day, steam and dry again. Repeat this process nine times. Alternatively, under strong sunlight, steam and dry three times a day for three days, totaling nine cycles, until fully desiccated. Lightly moisten with water in a mortar, pound, then dry again in the sun. Winnow to remove the husks, toast until fragrant, and swiftly grind into fine powder. Consume at will, two to three *sheng* daily. It may also be mixed with honey into pills the size of goose eggs, taking five daily. Alternatively, blend with malt syrup or dissolve in wine. Gradual consumption eliminates all illness within a hundred days; after a year, the skin becomes smooth and lustrous, impervious to water. After five years, one is immune to harm from water or fire and can run as swiftly as a galloping horse.\n\n*Baopuzi* states: \"This formula was originally unknown east of the Yangtze. During the Yong’an reign of Emperor Hui (Year Jiazi), it was obtained amid the chaos in Luoyang. I, residing in seclusion on the first day of the eighth month in the second year of Yongxing, deemed it a vital secret.\"\n\n**Another Method**",
      "overlap_context": "flesh, smooths facial wrinkles, and enhances complexion. Prolonged use bestows longevity and transcendence.\n\n**Method for Asparagus (Tianmendong)**\nGrind ten *jin* of dried *tianmendong* and one *sheng* of apricot kernels into powder, then mix with honey. Take one *fangcunbi* thrice daily and once at night. This was consumed by Gan Shi and is called \"Immortal’s Provisions.\"\n\n**Another Method**\nTake three *shi* of *tianmendong*, remove the heart and skin, then press to extract one *shi* of juice.",
      "start_char": 1971,
      "end_char": 2361,
      "start_sentence": 94,
      "end_sentence": 113,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.624056816101074,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清经断谷法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "取九蒸者一石，加狭苓三斤，合蜜丸，服如上，得力速。 又法 取成蒸者一斗二升，狭苓二十四两，泽泻八两，梼三万杵。 每服如浑丸，日三。 亦可密丸，可预作从军。 入山涉水，不令疲瘦，遇食便食。 无所禁忌。 又法 取生胡麻一石，挞去上皮，蒸之一日，曝乾梼之，溉釜中一石五升水，复蒸令水减五升，下饭以写木盘中，悉以汤沃之。 加麦馨屑一升，娘作糖，卒时淋汁煎之，三分余一。 又铜器汤上煎令可丸，服如鸡子大，三丸，百日肌肉充盛，寿命无穷。 初服胡麻饥极者，五日中作一顿白米粥食之，渐至十日，又作。 久久则都断。 凡服胡麻，禁食腥秽、生菜。 若下痢不止。 煮乾苏叶饮之。 服食杂米麦 稻米四升，真麝香四两，合和搅之。 如炊一石米，顿饱食，可支四年。 又法 杏子五千枚，梼碎，取白汁二蚪许，煮取八九升，以渍稻米一升，或五升，勿令多，梼出蒸之气出上。 以胡粉末一分，投杏汁中搅和。 又以搜饭，更蒸尽汁止，熟如枣脂状。 宿作米食，明日食之。 可供两人，亦可百日，一年不饥。 后欲下药，饮葵羹汁则去也。 又法 粳米、黍米、小麦、大麻子，熬大豆各五合，入白蜜一斤，煎一沸，玲水中丸，丸如李子，一顿吞之，则终身不饥。 一方无黍米。 出在《 五符中》 。 又法",
      "translated_text": "Take nine-times-steamed [grain] measuring one *shi*, add three *jin* of *fuling* (Poria cocos), and form into honeyed pills. Consume as above; the effects manifest swiftly.\n\n**Another Method**\nTake fully steamed [grain] measuring one *dou* and two *sheng*, twenty-four *liang* of *fuling*, and eight *liang* of *zexie* (Alisma orientalis). Grind thirty thousand strokes. Take doses the size of hazelnuts, three times daily. Alternatively, form into honeyed pills; these may be prepared in advance for military campaigns. When entering mountains or fording rivers, they prevent fatigue and emaciation, and one may eat whatever is available without restrictions or taboos.\n\n**Another Method**\nTake one *shi* of raw sesame seeds, remove the outer husks, steam for one day, dry in the sun, and grind. Pour one *shi* and five *sheng* of water into a cauldron, steam again until the water reduces by five *sheng*, then mix with cooked rice and spread onto a wooden tray, dousing thoroughly with hot water. Add one *sheng* of toasted wheat bran, stir into malt sugar, and promptly strain the liquid to boil it down to one-third its volume. Further reduce over a copper vessel in a water bath until it can be formed into pills. Consume pills the size of chicken eggs, three at a time. After a hundred days, the flesh becomes full and robust, and lifespan extends indefinitely. For those initially ravenous when first consuming sesame, prepare a single serving of plain rice porridge every five days, then gradually extend to ten days before another serving. Over time, this may cease entirely. When consuming sesame, avoid all foul or raw foods. If persistent diarrhea occurs, boil dried perilla leaves and drink the infusion.\n\n**Miscellaneous Grains for Consumption**\nMix four *sheng* of rice with four *liang* of genuine musk, stirring thoroughly. Cook as one would a *shi* of rice, then eat to satiety; this sustains one for four years.\n\n**Another Method**\nCrush five thousand apricot kernels, extract approximately two *dou* of white juice, and boil down to eight or nine *sheng*. Soak one *sheng* (or up to five *sheng*) of rice—no more—then grind and steam until the steam rises. Add one *fen* of lead powder to the apricot juice, stir well, mix with the rice, and steam again until all liquid is absorbed, yielding a consistency like jujube paste. Prepare the rice the night before and consume the next day. This suffices for two people for a hundred days or one person for a year without hunger. To later purge the medicine, drink mallow soup.\n\n**Another Method**\nTake five *ge* each of polished rice, broomcorn millet, wheat, hemp seeds, and roasted soybeans, add one *jin* of white honey, and bring to a single boil. Form into pills the size of plums in cold water, then swallow them all at once to remain sated for life. One variant omits the broomcorn millet. Recorded in *The Five Talismans*.\n\n**Another Method**",
      "overlap_context": "ed days; after a year, the skin becomes smooth and lustrous, impervious to water. After five years, one is immune to harm from water or fire and can run as swiftly as a galloping horse.\n\n*Baopuzi* states: \"This formula was originally unknown east of the Yangtze. During the Yong’an reign of Emperor Hui (Year Jiazi), it was obtained amid the chaos in Luoyang. I, residing in seclusion on the first day of the eighth month in the second year of Yongxing, deemed it a vital secret.\"\n\n**Another Method**",
      "start_char": 2361,
      "end_char": 2882,
      "start_sentence": 114,
      "end_sentence": 144,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.57888150215149,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清经断谷法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "青梁米一升，赤石脂三斤，合和以水渍之，令足淹，置温处，三二日上生衣，梼丸之，大如李子，日食三丸，则不饥渴，即饮水，可以远行，千里不倦。 出《五符》 中。 又法 梗米一石，以水渍之二十一日，可作粉曝乾。 取作粥，一升粉可三作粥。 取支一日，气力不臧，颜色如故，身轻目明。 又法 成治大麦屑三升，上蜀苏一斤，热汤五升，合膏没麦，曝令乾，微熬黄香，复纳汤曝尽汁止。 乃细磨筏，纳甘草、木屑各一斤，狭苓屑二斤，盐一升，合和，水服二方寸匕，日三四，渴者更服至五合。 若遇饭菜蔬，便食之，元禁。 在处若遇危厄荒饥，可服，终身不饥，延寿。 又法 大麦一石，蜀苏膏三斤，水四升为汤，纳膏汤中膏消，初饱食后，稍进，不饥，除寒热，延年。 守中径易法 取大豆种必生者三升，手授令光明，市体暖。 先美食竟，乃顿吞之，可解五十日，百日不饥，渴则饮水，勿余食。 欲去之，服热粥二升，豆即下。 一法：每向日再拜，一服一升，於口中展转嚼，乃咽之。 日三。 明日乃分一升为三过，小儿则半之。 又赤豆肉吞二升，至三升，亦支一岁。 又取大豆黄末三升，一顿．服，亦可十日、五日不食。 后欲去，当服葵茎灰方寸匕，即服猜膏及酪苏，亦下。 又法 先嚼蜡大如传暮，极令柔，乃内琦氏肥枣，并合嚼之，即皆消而咽之入腹。 止热除病，断谷。 又旦食一方寸蜡，辟一日。 又法 桑档黑者，曝乾梼之，水服三合，日三，则不饥。 又法 牛苏、羊苏、松脂、蜡蜜各三斤，合和煎，食之，支三年不饥。 又法 天门冬末一升，松脂一升，蜡蜜各一升，合和煎，可丸如梧桐子大。 日一中暮服三丸，如弹丸，即不饥美色。 此亦云崔文手中秘方。 天门冬去心皮。 欲还食谷解药 凡服守中药，断谷后，不可食杂物。 若渴，即得饮少玲水耳。 后脱欲还食谷者，当先服葵子汤下药，乃可食也。 初食日作一合米粥，日三。 二日后日二合米，又三日后日五合，又三日后七合，又三日后日一升，如此一月后，乃可复常。 葵子汤 葵子一升，堵膏一斤，以水五斗，煮取二升，去滓，稍稍服之，须乐下尽乃止。 亦可合米作薄粥饮之，蜀苏亦佳。 又法 葵子、消石分等末，以粥清服方寸匕，日再，十日药去尽，乃可食谷。 亦可各取一升，以米三升煮取一升，日三 又法 大麻子研碎，煮令熟，饮五升取下。 亦可合作薄饮，每令食肥滑物为善 太清经断谷法竟",
      "translated_text": "**Another Method**\nTake one *sheng* of fine white rice and three *jin* of red halloysite. Mix them with water until fully submerged, then place in a warm location. After two or three days, a film will form on the surface. Pound this into pills the size of plums. Consume three pills daily to banish hunger and thirst. Drink water as needed to travel a thousand *li* without fatigue. Recorded in *The Five Talismans*.\n\n**Another Method**\nSoak one *shi* of polished rice in water for twenty-one days, then grind into powder and dry in the sun. Prepare as porridge: one *sheng* of powder yields three servings. Consuming this sustains one for a day, preserving strength, complexion, lightness of body, and clarity of vision.\n\n**Another Method**\nTake three *sheng* of finely ground barley, one *jin* of Sichuan perilla, and five *sheng* of hot water. Mix the perilla paste into the water, then soak the barley until saturated. Dry in the sun, lightly roast until fragrant, and repeat the soaking and drying until all liquid is absorbed. Grind finely, then add one *jin* each of licorice and wood shavings, two *jin* of poria powder, and one *sheng* of salt. Mix well and take two *fangcunbi* with water, three or four times daily. If thirsty, increase the dose to five *ge*. When encountering rice, vegetables, or other foods, consume them freely without restriction. In times of peril, famine, or hardship, this sustains life indefinitely, staving off hunger and prolonging years.\n\n**Another Method**\nTake one *shi* of barley and three *jin* of Sichuan perilla paste. Prepare four *sheng* of hot water, dissolve the paste in it, and consume after the initial full meal. Gradually increase intake to eliminate hunger, dispel cold and heat, and extend lifespan.\n\n**Simple and Direct Method for Sustaining the Center**\nSelect three *sheng* of viable soybeans, rub them by hand until glossy and warm. After a hearty meal, swallow them whole at once to stave off hunger for fifty to a hundred days. Drink water when thirsty, but consume no other food. To purge the medicine, drink two *sheng* of hot porridge, and the beans will pass. Another variant: face the sun, bow twice, then take one *sheng*, chewing thoroughly in the mouth before swallowing. Repeat thrice daily. The next day, divide one *sheng* into three doses. For children, halve the amount. Alternatively, swallow two to three *sheng* of red bean meat to sustain oneself for a year. Another method: take three *sheng* of yellow soybean powder in a single dose to go without food for ten or five days. To purge, take one *fangcunbi* of mallow stem ash, followed by lard and fermented milk products.\n\n**Another Method**\nChew a piece of wax the size of a *chuanmu* until soft, then place it inside a plump jujube and chew together until fully dissolved and swallowed. This halts heat, cures illness, and enables grain avoidance. Alternatively, consume one *fangcun* of wax at dawn to ward off hunger for a day.\n\n**Another Method**\nDry and pound black mulberries, then take three *ge* with water thrice daily to banish hunger.\n\n**Another Method**\nCombine three *jin* each of cow’s milk fat, sheep’s milk fat, pine resin, wax, and honey. Boil together and consume to sustain oneself for three years without hunger.\n\n**Another Method**\nMix one *sheng* of asparagus root powder, one *sheng* of pine resin, and one *sheng* each of wax and honey. Boil together and form into pills the size of *wutong* seeds. Take three pills the size of marbles at midday daily to banish hunger and enhance complexion. This is said to be a secret formula from Cui Wen’s own hand. Remove the heart and skin of the asparagus root.\n\n**Methods for Resuming Grain Consumption After Sustaining the Center**\nAfter taking medicines to avoid grain, refrain from consuming miscellaneous foods. If thirsty, drink only a little cold water. To resume grain consumption, first take mallow seed decoction to purge the medicine, then proceed as follows:\nOn the first day, consume porridge made from one *ge* of rice thrice daily. On the second day, increase to two *ge* of rice twice daily. After three more days, take five *ge* of rice. After another three days, take seven *ge*. After yet another three days, consume one *sheng* daily. After a month, return to normal eating.\n\n**Mallow Seed Decoction**\nTake one *sheng* of mallow seeds and one *jin* of pig fat. Boil in five *dou* of water until reduced to two *sheng*. Strain and consume gradually until the medicine is fully purged. Alternatively, mix with rice to make a thin porridge, or add Sichuan perilla for better effect.\n\n**Another Method**\nGrind equal parts mallow seeds and nitre into powder. Take one *fangcunbi* with rice water twice daily for ten days until the medicine is fully purged, then resume grain consumption. Alternatively, take one *sheng* each of mallow seeds and nitre with three *sheng* of rice, boil until reduced to one *sheng*, and consume thrice daily.\n\n**Another Method**\nGrind hemp seeds, boil until soft, and drink five *sheng* to purge the medicine. Alternatively, prepare as a thin gruel and consume with rich, smooth foods for best results.\n\n*The Scripture of the Great Clarity’s Methods for Avoiding Grain* concludes here.",
      "overlap_context": "ces for two people for a hundred days or one person for a year without hunger. To later purge the medicine, drink mallow soup.\n\n**Another Method**\nTake five *ge* each of polished rice, broomcorn millet, wheat, hemp seeds, and roasted soybeans, add one *jin* of white honey, and bring to a single boil. Form into pills the size of plums in cold water, then swallow them all at once to remain sated for life. One variant omits the broomcorn millet. Recorded in *The Five Talismans*.\n\n**Another Method**",
      "start_char": 2882,
      "end_char": 3863,
      "start_sentence": 145,
      "end_sentence": 196,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.778548002243042,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清经断谷法.txt",
        "category": "方法类"
      }
    }
  ]
}