{
  "source_id": "太虚集录",
  "source_file": "chunked_daozang\\太虚集录.json",
  "total_chunks": 15,
  "total_original_chars": 14583,
  "total_translated_chars": 85168,
  "total_translation_time": 433.96877360343933,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\太虚集录.txt",
    "category": "藏外"
  },
  "full_translation": "From the *Suoguan Continued: On the Dual Cultivation of Nature and Destiny* (Collected Works of Taixu)\n\nThe ancient sages declared: \"Cultivation comprises three vehicles—celestial immortals, terrestrial immortals, and aquatic immortals—yet its methods adhere to but three principles. What are these three? Uprightness of form, emptiness of mind, and sincerity of intent.\" (Intent here signifies *zhi*, the master governing inner and outer; hence it is also called the \"host within.\") These three phrases are the unceasing, moment-to-moment foundation of the dual-cultivation school (those who refine both nature and destiny), never to be neglected. (Neglect here means forgetfulness.) The progression or moderation of their practice may be self-assessed and maintained. (For innate dispositions vary in brightness and obscurity, constitutions in thickness and thinness, yin and yang in dominance and subordination, circumstances in busyness and leisure, and seasons in winter and summer.)\n\nThe alchemical texts record nothing but oral instructions for nurturing destiny, yet their application must strike the mean, and their refinement must align with the proper time. For the year has its two solstices, the month its new and full moons, the day its midnight and noon, and the body its natural *qi*-mechanisms. (Mechanism denotes the harbinger of movement, the foreknowledge of ascent and descent.) These manifest in diverse phenomena. (By quietly observing the mechanism, fortune and misfortune may be divined; once manifested, they are already determined. To attempt reversal, one must employ intention at the moment of the mechanism’s inception, awaiting its manifestation to adjust with subtlety—this is the art.)\n\nThe essence of fire-times lies therein. In truth, its secrets reduce to nothing more than ascent and descent, release and gathering. Its benefits and harms hinge on whether one forces or follows nature, whether one flows freely or clings obstinately, and whether one adheres steadfastly or wavers in doubt. The ancients condensed a year into a month, a month into a day, a day into an hour, and an hour into a moment—this they called \"stealing the workings of creation.\" The *Mirror of Ingredient Entry* preserves their method, and all alchemical classics transmit it; none who practice it fail to witness its efficacy.\n\nYet the ancient sages insisted one must follow the body’s rhythms to await the proper time—time here refers to the \"living midnight,\" and the body to the Dao-body. Consider: in winter and spring, the *qi*-mechanism favors delayed penetration. The method begins at the lower extreme, where *qi* pierces the *weilu*, ascends the spine, penetrates the *yuzhen*, and enters the *niwan*, where it lingers briefly before descending. It then flows from the *huachi* down the *chonglou*, pauses at the *jiangong*, and passes through the heart. (The *niwan* is called the Sea of Marrow; when warmth reaches the brain, it transforms into fluid. The *huachi* is the meeting point of the *Ren* and *Du* meridians, hence the brief pause is not confined to the *niwan* alone. The *chonglou* descends directly, while the *jiangong* is the palace storing *qi*; the fluid descending from the brain’s reservoir may here transform into blood.)\n\nAfter passing the heart, it divides into two pathways to reach the lower back and kidneys, where it lingers again. (Behind the heart, two channels connect to the waist and kidneys. When one overtaxes the heart, its blood withers, and the kidneys’ essence reverses upward to rescue it—hence those who overwork the heart invariably deplete their kidneys, giving rise to symptoms of lumbar soreness and pain. By guiding the *qi* downward from the heart, blood follows, transforming into white essence while kidney-*qi* flourishes—thus the need for a brief pause.)\n\nWhen warmth is felt converging toward the abdomen, encircling the navel, one must dwell upon it intently. (This is the wondrous function of refining fluid into *qi*, hence the need for deep focus.) Then, directing intention to the *mingmen*, one must linger there for an extended time. (This is the wondrous function of refining *qi* into *yang*-essence, hence the need for prolonged focus. According to the refinement methods, the *mingmen*, *jiangque*, and *niwan* are the three sacred sites shared by immortals and mortals alike. If one can concentrate here, essence, *qi*, and spirit will flourish; without these three, no immortal practice can begin. Yet the Water Palace is inherently cold, the *jiangque* inherently warm, the lower extreme a gathering place of yin turbidity, and the *niwan* the celestial realm of purity. Water by nature moistens and descends, fire by nature flames upward—how then can water be made to ascend and fire to descend? Without the command of intention, they will not obey. To make cold warm and heat cool, one must rely on true intention to reverse their course, though this also follows an inherent principle.\n\nFor the Water Palace possesses its own *mingmen*, resembling a lapis lazuli lamp before the Buddha, burning day and night without extinguishing. The *jiangque* contains the *huachi*, with the heart’s sprout nestled within, while the Sea of Marrow above and the straight yin below envelop it—this is the innate, heaven-crafted true realm. The ancient sages, within this true realm, silently employed true intention to sustain it.\n\nIf beginning at the Water Palace, at the living midnight when yang arises, one prevents outward leakage while silently gathering the four true fires to enter the *mingmen*. There, yang naturally flourishes, the host of yin delights in refinement, cold transforms into warmth, and true yang is nourished, making ascent effortless. Once ascended, the marvel of \"transformation through passage, preservation through spirit\" ensures unimpeded ascent—this is the natural wonder of the *Du* meridian’s thoroughfare to the extreme.\n\nIf beginning at the *jiangque*, at the living noon when yin arises, one prevents internal stagnation while silently gathering the four true waters to converge in the *huachi*. There, yin naturally flourishes, the host of yang delights in containment, heat transforms into coolness, and true yin is tempered, making descent smooth. As it descends, the same marvel of \"transformation through passage, preservation through spirit\" ensures unimpeded flow. The *jiangque* becomes spiritually clear, its heat forgotten, yielding the effects of blood and *qi* transformation. Thus descending to the Central Yellow, it opens a new realm, pacifying all four boundaries—this is the natural efficacy of the *Ren* meridian’s governance of the world.\n\nThereafter, it pierces the *weilu* and ascends, descends, and lingers as before. The method states that failing to pierce the *weilu* completes one *zhou tian*. (For this practice begins at the lower extreme, and upon returning to it, one full *zhou tian* is accomplished.)\n\nThis was titled by ancient sages as the winter-spring practice. If one encounters summer or autumn, one must attune to the qi dynamic, for then the priority lies in prior penetration. The method proceeds thus: after abiding in the Flowery Pond, one descends the Tower of Nine Stories to reach the Crimson Palace, where one should dwell in this Crimson Palace—its realm vast and profound, its ambience leisurely and serene, as if glimpsing the Water of Nature, its waves shimmering in azure (such is the teaching, yet beware of seeking by rote). Suddenly, one feels a cool liquid dripping from the heavens (in this moment of practice, the adept’s nape and back must remain straight, while the head and face adopt a slightly upturned posture). Upon reaching the Heart Palace, the coolness redoubles (as the method cautions, only now does the adept perceive the Water of Nature, realizing that the foregoing merely expounded its principle). At this juncture, one engages in *great abiding*—(what is called *great abiding* harbors no contrivance; to be wholly present yet wholly forgetful is precisely *great abiding*). Then, following the qi’s movement, it flows downward (savor this word *flow*, for it carries the joy of effortless spontaneity), branching to the heart’s posterior (from the heart’s posterior, the two channels diverge to the lumbar kidneys, where wondrous transformations occur: dew-like liquid transmutes into blood, dew-like blood into essence). As it reaches the abdomen, one feels the entire body suffused with misty vapor (this is the sign of surplus liquid transforming into qi). At the lower extreme, fire and heat arise (this is the sign of refining qi into qi). A faint perspiration emerges across the front and back of the body, evoking the sensation of bathing or immersion (if the effects manifest at this stage before completing one *zhou tian*, one may cease practice without harm. To cease, one must first forget the heat for a time). With a slight intention directed rearward (the word *slight* is used because, in summer, the inner landscape favors coolness; if the adept harbors no internal accumulations of cold or stagnation and has attained perspiration, the practice is already sufficient. To add further intention would defy the season), it penetrates the *weilu* and ascends to the crown (though in summer, once the practice has breached the passes and traversed the spine, one may intentionally guide the qi inward to dissolve latent yin accumulations—this too is a key technique). Upon reaching the Muddy Pellet, one must engage in *great abiding* once more (this act of abiding is subtly profound; the adept must not treat it as mere routine. It is the ultimate verification of the *Du* meridian’s penetration, the foundation for the *Ren* meridian’s opening, and the origin of central circulation. The Crimson Palace relies on it for tranquility, the Flowery Pond for purity, the Central Yellow for harmonious governance, and the Mysterious Orifice for spiritual coalescence—all growth and fruition depend on its influence. It is the convergence of inner and outer elixirs. Here, the adept must empty the heart, solidify the mind, follow the qi’s ascent without forgetting or forcing, and allow the qi to return fully, the marrow to clarify like the heavens. Then, the Flute Terrace and Jade Pavilion, the Jasper Gardens and Golden Courts, may fleetingly appear. One must abide in reverence and solemnity, avoiding attachment to such visions. When the adept’s practice deepens, these scenes grow clearer, yet they remain mere bodily phenomena, not yet the true attainment. This pure realm is called the *true reflection*, resembling the state one will ultimately realize upon Daoist accomplishment. For now, *great abiding* requires only heightened clarity and vigilance against wayward thoughts).\n\nThereafter, it descends from the brain to the Flowery Pond, reaching the Crimson Palace, where one abides once more (this abiding holds great significance, its method profoundly subtle, yet it remains an act of *wuwei* within practice. The Palace is the mansion of blood transformation; when the heart is cool, blood is generated, hence the need for *wuwei*. Blood must return to the channels, so the qi dynamic must be empty. If intention is not relaxed, the dynamic stagnates; if the center lacks gathering intent, blood flows recklessly. The method calls for guiding the dynamic with subtle assistance, while the chest, back, waist, and abdomen follow fixed postures. Any deviation from these postures, though effects may still manifest, will yield vastly different results, even leading to blood disorders. What are these fixed postures? The chest’s posture must incline rearward—this is the secret of emptying the heart and pacifying the Palace; let the adept take heed).\n\nOne then feels the entire body refreshed and at ease. The ancients called this one *zhou tian*, thus is the summer-autumn practice. (The ancients, aligning their practice with the seasons, followed this method.) Yet the foregoing describes the standard practice for those without illness. If one suffers from illness, there are other methods to be applied at discretion, always ensuring alignment with the Dao’s nature and the season—only then will the effects be divine. Beware of rigid adherence. If, in summer or autumn, one harbors internal accumulations of cold and stagnation, one should first employ the winter-summer interchange method. When practicing the summer-autumn method proper, the focus is on qi descent. If practicing the winter-spring method, after the qi descends to the abdomen, one engages in *great abiding* and circulation to warm the abdomen. When qi subsequently surges, one raises the buttocks, directs the intention to pierce the *weilu*, traverses the spine to the crown, and attains perspiration as the sign of success. Thereafter, the practice involves only the *forgetting heat* technique (when the heart is utterly still, one may even delve into the realm of no hearing and no seeing, and the heat is forgotten). Adjustments are made in sequence, forming the interchange method. If practicing the summer-autumn method exclusively, one must wait until all internal cold accumulations are expelled before proceeding; otherwise, not only will there be no effect, but the illness may worsen. For those with a constitution prone to phlegm, treatment is best undertaken in summer (at this time, the qi dynamic tends outward; the practitioner follows this outward movement, and internal accumulations are expelled with the qi, eradicating the root of the illness. This is the ancient method of aligning with the seasons).\n\nThe method begins by guiding qi downward in sequence. Once the qi has descended, the *sinking and infusing* technique is applied. The practice proceeds only when qi moves within the abdomen and is followed by the warming qi’s subsequent ascent—then the *raising the buttocks* and other formulas may be employed. After practice, if sweat is produced but heat becomes unbearable, the *clearing and descending* technique is added until the qi descends and the chest feels open. Once the qi has descended and the heart is cool, immediately proceed with *spirit-infusion at the Gate of Life*, sensing the qi’s ascent. Then apply the *raising the buttocks* and other formulas, and sweat will naturally permeate. After permeation, continue with the *clearing and descending* method. Practicing in such alternating cycles for one or two seven-day periods will inevitably yield warmth and ascent. Yet one must still apply the *sinking the abdomen* and *spirit-infusion* techniques.\n\nThe *sinking the abdomen* technique involves guiding qi downward from the right side of the chest, circling the navel, turning left, retaining it at the center, and propelling it downward—then phlegm will exit through the bowels. The *spirit-infusion* formula involves guiding qi downward from the left side of the chest, circling the navel, turning right, retaining it at the center, and directing the spirit to adhere to the Gate of Life. For the left-downward method advances fire, while the right-downward method retreats the talisman—each holds its own profound significance.\n\nProceeding thus, after ascent, copious cool fluid will descend from the nape and chest. (When this substance descends, the face must be tilted upward; otherwise, harm may ensue.) Do not mistake this for sweet dew—it is muddy essence, refined by spirit and transformed into descending refined substance. Without undergoing a thorough refinement at the navel wheel, it may still cause harm. The method requires focused infusion at the Gate of Life until fire arises. (This technique involves drawing back the external kidneys with intent when they rise, causing the fire to blaze intensely.) When the heat is like burning charcoal, retain and refine it. Proceed slowly with subsequent permeation techniques, focusing solely on *forgetting heat* while using true intent to horizontally bar the chest, preventing qi from ascending—this is crucial. If carelessness allows permeation, direct intent upward with the eyes to draw in the celestial qi for descent and suppression, causing the qi to return downward. Swiftly follow its momentum to guide it through the posterior pass, where the refined substance will break through. Then lead it with intent to the crown, and profuse sweat will pour like rain. (This is the transformation of accumulated yin into sweat; do not mistakenly fear excessive sweating as yang depletion.) Gradually, it will descend from the crown to the Crimson Palace. If a single drop descends swiftly and feels extremely cool, it is true fluid. If it descends slowly and without coolness, it remains a muddy transformation, not sweet dew. Only when sweet dew is achieved is the effect profound, though one must ensure all accumulated yin is expelled before pursuing further results.\n\nFor those suffering from internal heat and restlessness, employ only the *descending formula* or add the *empty-heart* technique, and food will naturally digest. Then practice *guiding fire back to its source*, infusing spirit at the Gate of Life. When qi moves to the lower extreme, follow its momentum in circular motion until turbid fire descends. Gently guide it with intent to release it through the prison gate. Then raise the eyes to the Mud Pill, drawing back pure qi to close the gate, and guide it downward from the Crimson Palace to the navel wheel, permeating the ancestral aperture. Apply the *forgetting* formula to guard it. Once spirit congeals and breath stabilizes, the chest and diaphragm will feel at ease, and the illness will depart. Only then may one proceed to *filling the abdomen*, which must be combined with *spirit-infusion at the Gate of Life*—the abdomen will naturally fill. Thereafter, the *thoroughfare vessel* technique may be practiced. When the thoroughfare vessel is open, fluid will descend, requiring careful discernment between the true and the ordinary—this is also crucial. Only when the descent is genuine may one proceed with formulas such as *refining essence into qi*, *refining qi into spirit*, and *refining spirit to return to emptiness*.\n\nFor those suffering from blood heat, qi stagnation, and chest tightness, first practice the *empty-heart* method, then add the *retreat the back* technique. One will feel two streams of refined substance behind the heart, dividing from the heart’s posterior and reaching the waist and kidneys, hot as boiling water. (For this practice, tilting the chest slightly upward is optimal.) Gradually, this heat will encircle the navel wheel, filling the abdomen with warmth and inducing slight sweat throughout the body. At this time, the heart will feel relaxed and open—this is entirely due to the *retreat the back* formula. The *retreat the back* technique involves guiding qi backward from the *Quepen* with intent. *Quepen* is the mansion where the Crimson Palace transforms blood and is also called the *qi repository*. This method has been rarely known since Li Shaojun. For those suffering from frenzied vomiting of networked blood, this formula must be practiced first. Then proceed to *clearing the central pass*, incorporating the *empty-heart* technique. Alternatively, one may start from the *Flowery Pond*, drawing in celestial metal and applying the *empty-heart* formula—this will also cure the illness. Collectively, these are called the summer-autumn methods. Some suggest waiting until the abdomen is fully warm before applying the *raising the buttocks*, *reaching the spine*, and *ascending to the brain* techniques. Once qi reaches the brain, retain it fully, then reverse the gaze to the Mud Pill, guiding this celestial palace’s true qi downward to meet the Conception and Governing Vessels at the Flowery Pond. Sweet dew will fill the mouth; swallow it repeatedly to steam the Crimson Palace, reaching the Central Yellow. One will feel the Crimson Palace cool and the Central Yellow warm and moist. At this point, practice the *tracing the ancients’ divine technique*—this is called *opening the central pass*, also known as *clearing the primordial chaos*. In alchemical texts, it is termed *opening the mysterious pass*. The method involves nothing more than *forgetting forgetting*. Once this pass is opened, the elixir has a place to grow, and the medicine has a repository. What is the true realm revealed? It is boundless and profound. This single principle is the true technique of *establishing life and destiny*—practitioners must treasure it. Alas! Diligence without encountering a true master is futile—practitioners, strive on.\n\nOne affliction arises when accumulated yin transforms into fire, presenting as if in excess. The method here is first to employ the summer and autumn techniques to address the branch, and once the condition lessens, add the winter and spring practices—this applies when the accumulated yin has not fully transformed into fire. If it has fully transformed into fire, the method is solely to guide the fire back to its source, with a measured addition of summer and autumn descending formulas to assist the fire’s return, thereby achieving resolution. (For this condition, one must take *ease* as the principle, regard this body as already dead, and whenever a thought arises, sweep it away with the Buddha’s name. Swallowing saliva as it wells up will bring relief.)\n\nIf the accumulated yin remains internally stagnant and has not yet transformed into fire, the formula is to internally mobilize the true fire while externally applying rubbing and lifting, circulating without interruption—only then may there be efficacy. (External practices include rubbing the waist and kidneys, abdomen, legs, knees, feet, and hands, as well as repeatedly lifting the shoulders, rotating both arms like a windlass, stretching the legs, swaying the waist, twisting the neck, and pushing upward as if supporting the heavens, washing the face, and swallowing saliva. Internal practices include techniques such as focusing the spirit and breath-holding.)\n\nWait until the abdomen feels warmth (which breath-holding can achieve), then add the *penetrating the posterior* technique. (Only when the breath-holding technique is mastered will the external penetrating technique yield results.) The reason is that the true *qi* in this region is not vigorous (precisely because the accumulated yin is too abundant), and yang cannot overcome yin, making efficacy difficult to attain. (It is like placing a basin of fire in an ice cellar—how can one feel warmth?) The method is to externally apply rubbing and lifting while internally practicing breath-holding (in this way, the *qi* mechanism becomes lively, and external penetration will eventually occur). Wait until yang is abundant, and the true scene of *self-penetration and self-attack* emerges (though called *self-penetration and self-attack*, it is achieved through breath-holding and other methods), then use intention to break through the pass. (This cannot be done unless one applies the technique when yang arises.) Only when yang is abundant can penetration be achieved.\n\nIf the accumulated yin is accompanied by stagnation in the hundred meridians (this condition makes progress even more difficult, as there is much blockage within!), the method is first to practice breath-holding, then add visualization and circulation in the *kun*-abdomen, so that the *qi* naturally penetrates the meridians, achieving signs of free flow. (Only when sweat pours forth like rain over several sessions will this effect be attained.) At this stage (when the practice has reached this point, results begin to appear), one must still apply focused visualization and circulation (if one fears hardship and stops, the furnace will grow cold). Why? The stagnant substances in the hundred meridians, when warmed by *qi*, will naturally follow the *qi* in its movement, converging toward the lower extremity (most people’s practices result in downward leakage for this very reason!). At this lower extremity, the massed yin forces prevail, resembling a basin of fire in a room surrounded by ice walls—warmth cannot overcome the cold. The method is to add more charcoal to the fire, yet even this may not suffice. Thus, one must intensify the effort without regard for time, aiming only for the complete melting of the ice walls—only then will there be great relief. Alas, practitioners often fail to realize this and abandon their efforts at this stage, a common occurrence throughout the ages. The method, therefore, lies in perseverance, diligence, and courage: practice yields results, and even if it does not, one must persist. In this way, though the stagnant substances may be many, they will eventually dissolve—why fear that great efficacy will never be achieved?\n\nSurveying the world, ten or twenty percent of those afflicted with this condition are either merchants or scholars. Why? The condition arises from mental labor and physical idleness. Mental labor depletes the spirit, while physical idleness stagnates the *qi*; a depleted spirit and stagnant *qi* lead one to shun labor and seek ease—this is the origin of yin cold and stagnation. To cure this condition, one must reverse one’s habitual ways. If one can reverse these habits, the illness will naturally heal. Once healed, one may then seek the methods of practice—this is the royal road, to be followed by those who proceed in accord.\n\nAs shown above, the work of transformation is not something those of lesser capacity can sustain without giving up halfway. This is why the *Eight Brocades*, *Twelve Brocades*, *Sixteen Brocades*, *Twenty-Four Brocades*, and other such methods have been compassionately taught. For this yin essence forms due to *qi* stagnation; when *qi* stagnates, essence congeals and blood stasis arises. Without martial arts to stir and grind it, there will never be a time when efficacy appears. Practitioners, failing to understand this, abandon the practice—not out of weariness, but because they deem it a trivial skill unworthy of their effort. Alas! Just as one must ascend from the lowly, how much more so with these martial arts, which are employed to cure illness—when have they ever been relied upon for attaining the Dao? Practitioners, take heed.\n\nA careful note: The ancient sages bequeathed seasonal techniques, condensed into the twelve hours. I now explain the twelve hours as a fixed *qi* configuration for practitioners:\n\nThe natural state of *water and moon mutually reflecting* occurs at midnight;\nThe state of *I am unaware of existence* occurs at the hour of the ox;\nThe state of *awareness of qi flowing* occurs at the hour of the tiger;\nThe state of *qi mechanism overflowing* occurs at the hour of the hare;\nThe work of *abiding in non-being while guarding being* occurs at the hour of the dragon;\nThe *qi* configuration of *hidden and manifest, unfathomable* occurs at the hour of the snake;\nThe *qi* configuration of *ten thousand images arrayed* occurs at noon;\nThe state of *true and illusory, impermanent* occurs at the hour of the sheep;\nThe method of *sweeping away thoughts as they arise* occurs at the hour of the monkey;\nThe omen of *the solitary spirit revealed* occurs at the hour of the rooster;\nThe state of *hearing and seeing suddenly extinguished, awareness without trace* appears only at the hour of the dog;\nOne must strictly guard against surprise or doubt, abiding in the method of the hour of the dog. The state of *profound stillness* occurs at the hour of the pig.\n\n(Though this is a fixed *qi* configuration, only that which arises naturally is true. Thus, the key is indicated at midnight. Practitioners, follow this single profound instruction, and you will naturally align with it, never deviating midway. Know that the mechanism of *water and moon mutually reflecting* is rooted in profound stillness. When practitioners reach this state of profound stillness, with not a single thought arising, their *qi* becomes utterly pure, and the water and moon naturally appear—this is the *heavenly one generating water*, the image of *kan*. The single line within *kan* is the root of the moon’s appearance. With this essence present, its function naturally manifests—hence it is said to arise naturally.)\n\nThe principle is thus, yet it is essential to know that this step arises from the lowest extremity—this is the image of winter. The appearance of water and the rising of the moon are precisely the inner manifestation of *living midnight*, hence it is said that *midnight* holds them. At this time, the practitioner must be as though the body has no body. When one becomes aware of this body’s existence, the *living second* of the human form has already appeared, like heaven possessing earth—this is the image of *Tai* and *Li* in harmonious union. From non-being to being, from emptiness to fullness, this is the natural principle of the Great Dao. Thus it is said: \"I am not aware of existence\"—this is awareness without attachment. Yet once awareness arises, movement and stillness within must be self-perceived, and one then senses the flowing and circulating flavor of *qi*. However, if one merely embodies awareness within the state of *no hearing, no seeing*, this is the initial manifestation of the *Three Powers*, truly the autumn of *third-hour*. When the *qi*-mechanism overflows, it assumes an outward-penetrating momentum—this is the *living fourth-hour* image of the body. It bears the meaning of hearing and seeing about to commence, reaching *fifth-hour*. Here, the *qi*-mechanism is not without differentiation, yet the ancients placed this thought beyond calculation, treating all that is seen and heard as *having yet not having*. The intent is solely to guard the *hunmu* (primordial undifferentiated) image, preserving all existents within—hence it is called *preserving non-being*. In essence, this is the method of *guarding being*, and thus it is the practice of *fifth-hour*. The so-called method of practice is to preserve all existents within absolute non-being, thereby securing all existents. Yet within this, there are two meanings—hidden and manifest. The ancients’ method here was simply to let it be, without adding the slightest effort of maintenance. Thus, at *sixth-hour*, it is merely called *qi-image*, clarifying the meaning of *no need for effort*. *Seventh-hour* is likewise: the method is simply to let it arrange itself, hence it is summarized with the two words *qi-configuration*. Yet this moment marks the beginning of *living noon* and the generation of *yin*—the image of mid-summer. When the world’s course reaches this point, myriad paths open simultaneously, and the heart and eyes are easily dazzled. As the season wanes, emotions arise spontaneously—this is human nature. The ancients regarded this only as a *qi-configuration*, remaining utterly unmoved within, allowing growth and decline to follow their own course, attributing it to the workings of fate. Their discernment of worldly affairs had already penetrated deeply. Thus, when numinous realms appear, they let them flicker in and out of view, regarding them as mirages or sea markets—this is the *qi*-mechanism of *eighth-hour*. The method is simply to guard one’s true nature, though this is not within the capacity of beginners. Yet the more it manifests, the more wondrous it becomes, with shifting steps and changing shadows that stir the heart and eyes. The method is to sweep away thoughts the moment they arise—this accords with the *living ninth-hour* practice. Once this barrier is broken, inner wisdom-light fills the space, and a sign of *solitary spirit revealed* emerges from turbidity, while the *qi*-mechanism rests in tranquility—this is the state of *tenth-hour*. At this time, the practitioner does not abide in brightness but lets the spirit nest in stillness, thereby attaining a realm of *no hearing, no seeing*, where even the slightest trace is concealed. This true realm may be encountered but not sought; true *yang* is nourished therein, and true *yin* is thereby generated—this is *prior to the image of the Emperor*. Correlating with celestial timing, this is the ninth month of the year, the *living eleventh-hour*. Yet beginners, failing to comprehend, may mistake the cessation of hearing and seeing for the absence of all traces, thereby falling into confusion. The ancients, pitying them, marked this as *orthodox method* and *urgent warning*. If one can guard against regression, one attains *profound stillness* and aligns with heaven in virtue—this is the *living twelfth-hour* method. Thus it is said to occur at *midnight*, which is Laozi’s *\"wandering the mind at the origin of things.\"* The marvelous secret lies in the word *\"as\"*—the wondrous meaning of *\"as\"* is the living soul of *\"no abiding\"* and the complete reflection of the Great Dao. If practitioners can continue cultivation from this word, they will alternately manifest, alternately guard, and alternately advance, advancing without end. They will naturally know that the workings of creation are in their hands, and fate is not in heaven. Practicing sincerely, they may, in a matter of days, race abreast with the ancient immortals.\n\nThe foregoing describes precisely the methods by which predecessors condensed years, months, days, hours, and moments, proceeding step by step—such are the numinous realms that manifest. Yet one must grasp them rightly, for the entire practice is complete in its principles. Its great aim lies in *no abiding*, while the essence of this aim depends wholly on the *unmoving* secret. [This secret lies solely in *no abiding* and *unmoving*—if true, practitioners who carefully embody the prior annotations will naturally proceed in perfect accord with the method.]\n\nThus, when practice reaches *midnight*, the method directs the spirit to focus on the lower *dantian*, while the work must be held as if present, as if forgotten. Suddenly, a single red sun appears, emerging from the center of the heavens within the eyes—initially seen no larger than a bean. [Note carefully: this moon first breaks through from the depths of the lower sea, then rides the central *qi* to ascend to the crown. At this moment, the practitioner’s achievement dissolves the body into no-body, and thus the water-moon appears. Know that the lunar essence still resides in the *Kan* position, its radiance shining upward, where the *qi* of *Qian* congeals it, producing this vision. At this time, the waves of *Kan*-water are serene, and the moon’s reflection is contained within them—hence it is called *mutual illumination*. As for its emanation of light, this occurs because the yang of the liver descends, clinging to the moon and halting its wheel, while the *hun*-soul is impregnated by the moon—this is the cause of the moon’s emission of solar brilliance. Yet the solar essence has not yet risen, still concealed in the depths of the sea. Thereafter, when the sun ascends, it should follow the *Du* meridian; the method requires only that intention be directed backward to achieve this. If, however, it ascends along the central *Ren* meridian, the calamity will be immeasurable.]\n\nUtterly guard against the stirring of thought.\n\nThereafter, the moon recedes and the sun emerges in full radiance. The method requires only stilling the heart and awaiting this moment. When the *dantian* feels as though cauterized by moxa, this is the effect of the sun bathing in the depths of the sea—thus the entire body becomes suffused with harmony. One then senses the internal *qi* surging from behind, swiftly piercing the *Weilu* and ascending in a soaring current—this is free of harm.\n\nYet while the sea-bathing has not yet fully penetrated, one must guard against sudden arousal. Otherwise, there will arise an unfathomable peril, its symptoms resembling flowing fire. The remedy lies solely in repeatedly applying the *forgetting* technique until recovery.\n\nThe ancient sages, at this stage, subtly shifted their spirit to guide the breakthrough from behind, naturally shattering the barrier and ascending. Once reaching the *Yuzhen* (Jade Pillow), intention is employed to draw it through. For this *Yuzhen*, alchemical texts name it the \"Iron Wall,\" and in the heavens, it is called the \"Edge of the Big Dipper’s Handle\"—without this true *qi*, none can penetrate it. Only by using this true *qi* to draw and guide it through does one achieve the *Du* meridian’s opening.\n\nWhen the *Du* is opened, half the work is accomplished. Yet in practicing this method, one must use only the word *draw*—never resort to force. Any admixture of force will result in sounds like thunder or claps of lightning. Should the practitioner, through loss of discipline, encounter such phenomena, they must not be alarmed. [The technique involves clasping the *canghun* mudra with both hands while seated; even if startled, this prevents the peril of spirit-flight.] The method requires only deepening stillness and composure, maintaining it for the duration of half an incense stick’s burning. Then, a drop like a spring will descend from the void. In savoring its essence, one feels profound coolness or extreme sweetness. Whether this descending drop has form is good, but its formlessness is even more wondrous—beyond words.\n\n[It must be understood that this state of stillness, from heightened attention to utter forgetfulness, requires half an incense stick’s time to attain, hence the subsequent phrase \"then there is.\" This clarifies that the *sweet dew* is obtained only through forgetfulness, and such attainment is genuine. At this stage, the work has ascended to the realm of no-body, hence the phrase \"from the void,\" and so on. Yet the practitioner should note that the words \"in savoring\" do not refer to meaning in the moment but to retrospective reflection after the event. The method at this point—whether from the void, discerning coolness or sweetness, form or formlessness—must be entirely set aside and not dwelled upon, for only then is the work complete. For before the drop descends, one feels only emptiness; when it descends, one naturally senses it falling from the void. Self-awareness at this point is not recklessness, but unawareness of its descent from the void borders on scatteredness—this is not the proper method. Merely adding interpretive meaning risks falling into emotional obstruction, entering the realm of consciousness, which must be guarded against. Thus this annotation is provided.]\n\nThe ancient sages called this drop the one that falls directly into the *Jianggong*—this can be swiftly understood.\n\nThis is called the *True Yin*. Whether its descent appears gradual or swift, both are acceptable—(the two \"also\"s here instruct later students to set aside such distinctions, for this is the ancient sages' method of preventing the intrusion of consciousness). Only when the drop falls unimpeded, point by point reaching the heart, is it most rare and precious. (Here one may realize that swiftness is the true sign.)\n\nIt is also said: when manifest in form and swift, it is called *Jade Liquid*; when formless and swift, it is called *Golden Liquid*. [This is an esoteric teaching not passed down; I received it in my youth from Master Taixu. Now in my old age, fearing it may be lost forever, I record it here in detail for those with karmic affinity.]\n\nMaster Taixu said: \"Whether manifest and swift, or formless and gradual, all belong to the wondrous existence—one must recognize the true nature of the method.\" For when this drop reaches the heart, it is intensely cool; when it passes the heart, it is scorchingly hot, as if scalded by boiling water—only then is it the *True Liquid*. If the drop lacks these qualities, it remains within the postnatal realm, merely moistening the qi mechanism and not to be regarded as the elixir of immortality.\n\nYet in the moment of practice, one must strictly guard against the arising of conceptual thought. The method lies solely in proceeding step by step, which will yield beneficial effects. The ancient sages' practice encompassed aligning with the four seasons of heaven and the twelve divisions of the year and day. Their method was supremely fluid and profound, for what was discussed earlier—the four seasons and the twelve hours' spiritual realm—is condensed into a single moment. Its circumstances and scenery can indeed be depicted step by step. However, the student must ask: can one truly proceed without attachment, without straying into partiality or fixation?\n\nIf one proceeds without attachment, there will be no deviation; if attachment arises, deviation follows, and the manifested circumstances and scenery will differ greatly. How could the ancient sages have been anything but precise in their instructions? Master Taixu said: \"If a student, in the midst of practice, clings to a single investigative thought, entertains a single conjecture, or falls into a single moment of consciousness, the incoming circumstances and scenery will shift unpredictably, diverging greatly from the ancient teachings. One should immediately cease practice and rest, waiting until thoughts settle and qi evens. Then resume the current step—or even retreat to an earlier stage—until one re-enters the initial spiritual realm of the first step, experiencing it without duality, before proceeding further. Otherwise, it is better to abandon all previous efforts and begin anew. The ancients' principle that 'practice must attain the mean, and celestial timing must align' refers to condensing the spiritual realm of a year, a month, a day, and an hour, gathering and arranging them in sequence, all manifesting within a single moment—encompassing the four seasons, twelve months, each month with its waxing and waning, thirty days, each day with its twelve hours, and each hour with its natural scenery. The method is supremely profound and true, yet only by stilling the heart, embodying the practice without doubt, and proceeding step by step can one align with the ancient teachings.\n\nAlas! Know that in condensing a year’s scenery into a single moment, the method lies in activating the qi mechanism while quieting the heart and intent—thus naturally conforming to the ancient way. To practice for the duration of an incense stick’s burning is to seize a hundred years of transformation. The ancients therefore called this *the practice of seizing transformation*—difficult yet easy. Students, take heed!\"\n\nOriginally, in the *zi* and *wu* hours, there is the *living zi* and the *living wu*.\n\nAt the year’s two solstices lie the living *zi* and *wu* of Heaven and Earth; the cyclical progression of years, months, days, and hours constitutes their fixed *zi* and *wu*. Considering the human realm, the two solstices of Heaven and Earth, along with the *zi* and *wu* of the cyclical progression of years, months, days, and hours, all belong to the fixed *zi* and *wu*. Only the *zi* and *wu* of these two hours are the living *zi* and *wu* within the human body. Yet even these are but the living *zi* and *wu* reluctantly revealed in alchemical texts—the so-called living *zi* and *wu* of the first stirring of yang. To discern their true essence, one must seek deeper still. The genuine living *zi* and *wu* must be pursued where form and image dissolve.\n\nWhat then is the method? When practice reaches the point of stillness beyond stillness, one suddenly senses an inner mechanism stirring faintly—this marks the inception of the living *zi*. As the stirring grows vigorous, the living *zi* manifests in full; when qi wells up within and surges toward the male root, the living *zi*’s inner qi reaches fullness. The method employs the celestial eye to concentrate, guiding the qi to ascend the Governor Vessel in reverse to Kunlun. With a subtle intent to retain it, one feels the marrow sea’s waves settle, and the qi flows downward, generating a breeze in the Flower Pool that gathers at the Crimson Palace. At this moment, the Celestial Lord is at peace, and all realms are tranquil—this is called \"drawing from Kan to fill Li.\"\n\nShould the external kidneys rise and thoughts arise simultaneously, the external kidneys will surge further. The ancient sages swiftly guide the qi back with intent, reversing its course from the sea bottom to the crown, storing it in the Qian cauldron—neither forgetting nor forcing. As qi is nurtured by marrow, it transforms into jade dew, flowing naturally into the pool and descending to the Quepen. When the dew is retained in the basin, it transmutes into crimson fluid, streaming behind the heart. There, it meets the ascending yang of Kan, yielding a profound, spring-like savor. Yet one must merely comprehend this, strictly guarding against emotional entanglement. Should the heart stir, swiftly direct the true qi of the Qian palace downward to suppress it, instantly restoring clarity. Alternatively, envelop the phenomenon with intent and press it into the lower field, refining it thoroughly before guiding it to ascend the crown and store it in the Niwan, engaging in a grand purification—this \"purification\" means placing all perceptions and sensations beyond the reach of intent.\n\nThereafter, as the Flower Pool’s fluid surges, swallow it repeatedly, sensing the Crimson Palace gleam with golden splendor, expanding boundlessly. A mirage-like vision appears, shifting between near and far. Here, the practitioner first recognizes that the work of nature is the fortress preserving life. The method lies in setting it aside without attachment; otherwise, lascivious scenes may arise, unsettling the heart and will. Instead, envelop and gather it with intent, then dismiss it without scrutiny, swiftly directing the gaze and hearing into a state of no-seeing and no-hearing. In this act of preservation, one enters a realm where the self and world dissolve.\n\nOnce more, one perceives a misty, vaporous atmosphere emerging within profound stillness. Again, set it aside without interference, and one attains the state where both self and dharma are forgotten. At this stage, should a sense of the body arise, direct intent to examine the aperture within the aperture and halt. Alchemical texts call this \"gathering the medicine into the furnace\" or \"practicing the living *zi* work\"—such is its effect.\n\nYet alchemical texts often speak in metaphors, employing broad analogies without direct exposition, as if their intent were not fully conveyed. How could the verification of the living *wu* not be encompassed within the discourse on the living *zi*? This is because the ancient sages taught by guiding rather than explaining. Nevertheless, such ambiguity risks misdirection. Out of compassion, Tai Xu here reiterates the awakening secrets, wherein the work of gathering, extracting, refining, and congealing is inherently complete.\n\nIf one follows the alchemical texts, the external kidneys rise without thought—this is indeed the living *zi*’s yang arising. Yet one must further guide and draw it to the brain, retaining it there before directing it to the Central Yellow to commence gathering. Employing the \"no-thought\" technique once more, seal the furnace. Compared to other teachings, this method simplifies the process, yet the explanation merely completes the living *zi*’s work—it is incomplete. The alchemical texts’ account of what follows the living *zi* is left for practitioners to discern, but they often cling to a single interpretation, growing increasingly confused and ultimately sighing in despair. Yet this too reflects the ancient sages’ own journey; they never anticipated later students’ lack of insight, nor the pitfalls of over-interpretation. Moved by compassion, Tai Xu now offers this revelation.\n\nWhat is called the living *wu* is, in essence, the continuation of the ancient sages’ work after the living *zi*—it is not a separate path. The ancient sages’ practice began with the living *zi*, whereas Tai Xu’s teaching emphasizes the living *wu*, introducing the \"Twelve Hours of the Central Work.\" When the golden world manifests, this is the supreme realm of the living *wu*, where the work of gathering is appropriate. The gathering method employs the *Qingjing Jing*’s threefold contemplation. The highest practice involves engaging with the formless, yet without abiding in emptiness. Upon returning, one still rests in the formless, cycling thus until qi gathers into form and disperses into qi.\n\nSome aspects of this method may be disclosed, yet one must grasp and embody it inwardly, holding it in secrecy—like seeking a steed with a diagram, or catching a fish and forgetting the trap. What then is the principle? Upon witnessing the golden world, swiftly rise with the supreme spiritual qi from behind, extending to the utmost height and distance, where light does not reach, and descend. Envelop the spiritual realm entirely, condensing it into a millet grain, either drawing it in through the precious vase or gathering it into the abdomen with intent. Alternatively, harnessing the enveloping force, sweep from the farthest point before oneself to the deepest below, ascending to the highest above, gazing down upon the spiritual realm where one’s colored body sits or stands within flames. Swiftly apply the \"forgetting heat\" technique, and the colored body melts away, revealing only radiance. With intent, gather and contract it, and a pea-sized pearl appears, suspended in the void.\n\nSwiftly gather with intent, settling it within the serene and mysterious aperture of emptiness and quiescence, whereupon one attains a state of profound clarity, stillness, and mystery—here, let it rest.\n\nAlternatively, when the spiritual realm manifests, gently employ true intent to draw this realm toward the rear of the body. Silently apply the \"lifting\" technique, raising it from behind, and with both eyes, gaze upward to the *niwan* (mud-pellet palace). Sense the true qi of one’s *niwan* suffusing and swirling. Then, with intent, guide it downward, feeling the qi overflowing a realm—vaguely beholding a pool of brimming water. This marks arrival at the *Huachi* (Flowery Pond), where jade-like and golden fluids abundantly flow. Swallow them, descending through the *Chonglou* (Weighty Tower) to the *Jianggong* (Crimson Palace), where supreme coolness is naturally attained. Proceeding further downward to the *Zhonghuang* (Central Yellow), another realm of delight unfolds, suffusing the entire body with harmony.\n\nAt this moment, one senses two qi spiraling left and right. Another qi ascends, while another descends. Once their tips align precisely, they rise to meet and descend to welcome, now chasing, now retreating, now intertwining without release. At this juncture, strictly guard against attachment and mundane thoughts. Should even a trace of emotion arise, these two qi will wage a fierce battle of engulfment, and the three families, once refined beyond the posterior heaven, will cause the body to tremble, breath to roughen, and the external kidneys to burn with fire—ushering in an ordeal nearly impossible to renew.\n\nThe remedy lies solely in raising both eyes upward to draw down true yin, suppressing the flames of emotion. Yet this supreme treasure has already transformed into the posterior heaven. The method requires summoning the true person in utmost urgency, fiercely refining and forging it anew, compelling it to once more penetrate the *Weilü* (Tail Gate), ascend to the *Niwan*, descend again through the *Chonglou* to the *Jiangque* (Crimson Palace), thereby attaining a grand renewal. Otherwise, this treasure cannot be restored. Thus, the ancients dared not disclose this stage, for few practitioners retain the purity of youth. Once the passions of the body are breached, how can one avoid stirring emotional thoughts when the work reaches this point? Moreover, this path is well-trodden—escaping its grasp without seizing the pass is exceedingly difficult.\n\nOnly those of unblemished youth, whose treasure remains unopened and who know nothing of this matter, when practicing to this stage, will merely sense the great spring of life, their spiritual mechanism ascending without descending—utterly free from such transformations. The ancients, with their pure and thorough cultivation of inherent nature, upon reaching this stage, swiftly drew true yin to suppress the turbid fire, relying on the coolness of the *Jianggong* to transform the qi, condensing it downward and storing it in the *qi* cavity. With intent, they sealed it, abiding in profound stillness for a moment before ceasing.\n\nGenerally, for those whose practice begins with the *huowu* (living noon), the *Qian* (Heavenly) palace is the most critical work. Refine this qi mechanism, directing it downward to the *Huachi*, irrigating the *Jianggong*. When the *huozi* (living midnight) arrives, rely solely on spiritual discernment. The union of *zi* and *wu* depends on the tranquility of inherent nature, with the work culminating in renewal as the proper measure.\n\nFor those whose practice begins with the *huozi* (living midnight), the *Kun* (Earthly) abdomen is the most critical work. Refine this fluid-qi, ascending it to the *Niwan*, descending it to the *Huachi*, and purifying the *Jianggong*. When the *huowu* (living noon) arrives, strictly guard against leakage of emotion. The union of *wu* and *zi* also depends on the tranquility of inherent nature, culminating in harmony as the proper measure.\n\nWhen closing the eyes for inner observation, myriad spiritual realms may manifest—here, the method values non-attachment. As one advances step by step, the scenery shifts with each movement, and the realms are beyond enumeration. The method lies solely in non-abiding.\n\nUpon the qi reaching the *Kun* position, warmth is the sign of achievement. When the qi subsequently penetrates to the crown and *Jianggong*, coolness is the sign of achievement. Such is the general principle. Only those who merge inner observation into oneness, embodying the spirit in its entirety, practice the method of celestial immortals—let the capable follow it. (The \"two\" refer to the two eyes; the \"one\" is the celestial eye.)\n\nMaster Taixu said: In our cultivation, it is indeed vital to harmonize with celestial timing. Yet the preceding discussion of *huowu* is because, without clarity on *huowu*, true yin is lost in vain. Even if one engages in *huozi*, without true yin to contain it, the work may refine the spirit, but its ascent cannot be assured. The elixir texts speak of coolness, gold, and jade, alluding to the work following *huozi*, hence the term \"true yin.\" This refers to refining yang to obtain yin, yet within it lies the secret of refining yin to obtain yang—a method not omitted but simply not spoken aloud.\n\nAs for the twelve-hour secrets, the ancients guarded them closely. I now reveal them openly, for the true Dao has long been obscured, and practitioners often merely follow traces without understanding the landmarks of the journey. Proceeding without guidance is like a blind man without a staff—prone to confusion and retreat. Moreover, knowing your karmic affinity is profound and your capacity for selflessness great, if I withhold this method, this gathering would be in vain, and the true Dao would be lost.\n\nShould one of great root and capacity encounter you and learn the twelve-hour secrets, inquiring into the *huosui* (living year), *huoyue* (living month), *huori* (living day), and *huoshi* (living hour), and practice them with precision, even if later interrupted by affairs, upon resuming the work, they will know the steps and the scenery to expect, proceeding without doubt or hesitation. Thus, they will advance unimpeded. To have previously heard of the *huosui*, *huoyue*, *huori*, and *huoshi* and now see them clearly—is this not a joyous matter?\n\nThis living principle cannot be grasped through effortful action, yet it is often lost in effortless non-action. Only those who comprehend the meaning of \"employing the effortless within effort, practicing the effortful within non-action\" will never err, and their attainment will surely be genuine.\n\nWhy not verify this with the elixir classics? \"When the external kidneys rise without thought, it is yang arising,\" and it is also called \"living midnight.\" From this, one may realize: \"When the external kidneys rise greatly without thought, it coincides with the living noon within the body.\" Only then should one proceed with gathering—otherwise, what is obtained is not true yang. Using it for nourishing life may suffice, but relying on it to attain the Dao—is this not difficult?\n\nHere the learner remains ignorant of the initial stirrings and first appearances of the inner mechanism, failing to nurture yang at its earliest resurgence. Waiting until the living noon to gather it, they ultimately err in their approach—unaware of the ancient sages’ \"contraction\" formula, still clinging to fixed midnight timing. Thus they err without realizing, and even if they apply effort according to instruction, they have already fallen into mid-course error.\n\nThose timid and rigid in their views may even abandon the effort entirely, believing the yang of an overripe hour cannot be gathered. Little do they know this is still the waxing moon of true noon—discarding it is but another error compounded upon error.\n\nAlas! To heedlessly squander the living noon is to miss the great pivot of Dao cultivation. Without thorough understanding of its nature, one will err ten times in ten encounters. Reviewing the refined practices of past masters, I find that while they often succeeded at the living midnight, their failures invariably occurred at the living noon. Why? Because their nature-work was insufficient, and nature was swayed by emotion.\n\n*(Note: The error is not merely in losing control when numinous visions appear. Learners commonly falter when stray thoughts suddenly arise. For when thoughts surge like clouds during meditation, this is precisely the verification that the living noon has arrived within the body. To abandon the sitting, or to sit without restraint, or to restrain without settling—all are failures of preservation.)*\n\nAt the moment of true noon, myriad paths open simultaneously—nothing wondrous fails to appear, no subtlety remains hidden. All that belongs to the domain of destiny manifests without concealment. Generally, those with sufficient life-cultivation will witness ever more exquisite marvels. *(The ancient sages, endowed with self-knowing clarity, would half-lower their inner curtains at noon during practice. Though they had eyes, they acted as if sightless, relying solely on spiritual resonance to harmonize the qi mechanism, returning it to a state of pure harmony until the qi found its hidden abode and came to rest.)* Their experiences were not merely sounds or colors: above, celestial palaces of jade towers and rosy pavilions; in the middle realm, jade maidens and golden youths, rare flowers and sacred herbs—countless wonders. Even in the lower visions, one would encounter famous mountains and scenic lands, or be presented with celestial maidens and immortal feasts. Even the most modest numinous realms transcended the mundane, with such beauty in figures and such refinement in furnishings that one could easily be captivated.\n\nShould emotion cling even slightly, one becomes mired and unable to transcend, delaying ascent and verification—like lingering in Tuṣita Heaven. Next, the spirit stagnates in the Mud Pill Palace, and the hope of rebirth vanishes. Worse still, if one abandons the practice to demonic occupation, the spirit may be devoured—all due to ignorance of the living noon’s functional secrets.\n\nMaster Taixu further said: When practice reaches the stage where true and illusory are indistinguishable, even if the hour is not yet noon, one may, by rousing the qi and will and applying concentrated stabilization, restore the living noon within half an incense’s time. A golden world then appears, illuminating the mind’s eye—this is the technique of Li Shaojun, who achieved a second noon at the hour of *rize*. The medicinal substance is most abundant then; gathered with intention, it transforms into true qi. Further condensed with intention and drawn into the ancestral aperture, this is called \"obtaining the medicine\"—the great accomplishment of the Southern Lineage’s patriarchs. The Prince of Huainan, Wei Boyang, and the two Perfected Ones Ge and Xu, through additional practices like *baoti* and other formulas, ascended bodily into immortality.\n\nMy teacher, Master Mud Pill, practiced without attachment, and I too have personally verified the six celestial tremors. The Master cautioned: \"Do not practice this to completion. You should treasure and conceal it, awaiting the right person to transmit it to.\"\n\nIf, however, one’s practice reveals collapsing walls and ruined houses—various signs of decay—this indicates the learner’s yang is waning and yin is damaged. The method then is to venerate the true in every thought, align every action with proper measure, focus on preserving the Gate of Life, and combine emptiness of mind with fullness of the abdomen. Above all, guard against the arising of anxious or evil thoughts—this too is an oral formula from the ancient sages for entering practice through the living noon.\n\nThe Master further said: In our cultivation, we must follow the ancient sages and buddhas—refining nature in activity and life in stillness. Do not be like worldly learners who apply effort only during cross-legged sitting. Such practitioners invariably fail ten out of ten times, whereas the ancients succeeded a hundred times in a hundred attempts. I urge learners to begin by equating the body with empty space, using the vastness of heaven and earth as the Dharmakāya, this physical form as the divine chamber of the celestial heart, and this fleshly heart as the sovereign of the celestial heart. Let there be no preferences, no grasping or rejecting, no seeking or avoiding—no entanglements whatsoever, no wandering thoughts. Only maintain a state of utter emptiness, neither bright nor dark, what is called \"vast and boundless, neither partial nor biased.\" Upright in body, empty in mind, sincere in thought—only then will you not waste this precious opportunity. When practice reaches the living midnight, do not fail to nurture it; when it reaches the living noon, master the formula for gathering and containing.\n\nAlas! If this body is not liberated in this lifetime, in what future life will it be liberated? The ancient sages said: \"When the front barrier is closed, subdue the heart and qi—success comes from summer and autumn practice.\" They also said: \"When the rear barrier is opened, half the work is done—the true practice is contracting *gen* and opening *qian*.\"\n\nKnow that qi fails to ascend posteriorly because of congealed essence blocking the channels and apertures. The method is to direct the spirit to the Kun abdomen and return the qi to the Gate of Life. When the fire is vigorous, the qi becomes warm; congealed essence, meeting warmth, melts like water. Channels and apertures are no longer obstructed, and the qi naturally penetrates posteriorly.\n\nOriginally, qi circulates through the channels; if channels are blocked, qi stagnates. Know that the substance blocking the channels is the very essence that once coursed through them under qi’s guidance. Thus, qi’s failure to ascend stems from stagnation within essence; stagnation within essence arises from insufficient warmth in qi; qi’s lack of warmth stems from decline in the Gate of Life; decline in the Gate of Life’s fire stems from the spirit’s failure to guard it. For essence moves by means of qi, and qi is warmed by the spirit. When the spirit flourishes, qi is warm; when the spirit wanes, qi cools. Cool qi causes essence to congeal and fail to transform, internally becoming phlegm that fills the meridians and obstructs the apertures.\n\nThe consequences of this are dire: not only does the great Dao become difficult to practice, but even one’s life may scarcely be preserved. The only remedy lies in intensely warming the earthly abdomen to reverse the condition.\n\nKnow that essence, as a substance, when guided by flourishing qi, moves like clouds borne on dry winds—ascending to form rosy dawn, descending as gentle dew. Yet when guided by declining qi, it becomes like mist carried on damp winds, forming stagnant clouds that descend as heavy rain. Moreover, when this yin essence flows downward and lingers in the bladder, an occasional flare of ministerial fire may cause it to seep outward in an oily discharge—this is the gravest harm of stagnation below. If, however, it is guided by channel qi and dispersed throughout the hundred vessels, a single drying by wind-fire may transform it into abscesses or paralysis. Over time, it may accumulate and generate fire, leading to bone steaming; the consumptive ailments of the world all arise from this substance.\n\nThe sages of old feared this, hence their teachings on cultivating fire. The method of cultivating fire lies solely in focusing the mind on the earthly abdomen and returning qi to the Gate of Life. The fire of the Gate of Life is invisible to the eye, yet its presence is tangible—it is the root of the spirit-fire. When the fire of the Gate of Life flourishes, the essence of food and drink can be transformed into qi. Further, by directing intention to the earthly abdomen, dryness is nurtured into true earth, while moisture nourishes the hundred bones, invigorates the qi mechanism, and sustains the thunderous yang. The function of true fire is indeed vast!\n\nIn our daily lives, as food and drink are transformed day by day, we often neglect the teaching of cultivating fire. Thus, among the hundred vessels, few escape affliction, and in the bladder, this substance accumulates in abundance. Yin fails to transform yang, and the consequences unfold as described above—how can one remain unaware of where to direct their focus? If qi fails to ascend posteriorly, disaster is not far off. Moreover, if qi does not ascend posteriorly, it will inevitably rise anteriorly; should qi penetrate forward, the harm is even greater. (At best, it manifests as liver qi surging; at worst, as leg qi rushing upward.) The onset of illness invariably occurs in spring; spring outbreaks are manageable, but summer outbreaks are severe.\n\nFor this phlegm-like essence first obstructs the central palace, blocking qi from descending. Occasionally, some may follow qi downward, but with the Gate of Life’s fire weakened, the descending substance congeals below. When the coccyx point is obstructed, the governing and conception vessels along the spine, crown, and occiput become equally blocked—both the Ren and Du channels are sealed, and the calamity is beyond measure.\n\nTo remedy and reverse this, the method must combine the restraint of the Gen technique, gathering the ministers to assist and cultivate. Only then will the true fire of the Gate of Life flourish, warming and steaming the middle and lower regions. Yin essence will daily melt away, and true qi will grow in power, breaking through blockages and unobstructing the channels. Practicing thus for one seven-day period, then two, up to seven seven-day periods without interruption, the stagnations before and behind will dissolve, and the Ren and Du channels will open. Not only will illness be cured, but more shall be achieved.\n\nYet if one merely seeks to unblock without cultivating and assisting, the old stagnant sludge will remain in the vessels and apertures. Temporary relief may occur, but the root cause—weak yang, feeble qi, and the difficulty of rousing oneself—will persist. Deep-seated habits are hard to reverse, and this is the lamentable outcome. We, as aspiring scholars, must take heed and strictly avoid this.\n\nOnce the qi mechanism is unblocked, yin essence transformed, and chronic ailments resolved, one may proceed to the threefold practice of cultivation. Within this, there are further techniques:\n\nFrom midnight to noon, the practice should involve raising the buttocks, bowing the body, straightening the neck, and contracting the Gen. Perform twenty-four breaths. Then, draw upward to the Qian position, visualize the spirit in the mud pill, and hold for six breaths without exhaling. Straighten the body, relax the abdomen, and sit with six breaths. In total, perform thirty-six breaths, repeating this cycle for six periods.\n\nFrom noon to midnight, the practice should involve pressing the abdomen, straightening the waist, lifting the neck, and emptying the heart. Perform sixteen breaths. Then, visualize the spirit in the earthly abdomen for four breaths, and as before, straighten the body, with each breath returning to the navel for four breaths. In total, perform twenty-four breaths, repeating this cycle for six periods.\n\nThe sages have said: “From midnight to noon, one should advance the yang fire; when yang flourishes, it ascends, and when it ascends, the mechanism is lively. From noon to midnight, one should retreat the yin tally; when yin melts, it descends, and when it descends, stagnation dissolves.” They also said: “The head is the Qian cauldron, the heart the chamber of spirit, and the abdomen the Kun furnace. The heart is the palace storing qi, the abdomen the palace where life and nature converge, the land where medicine is born. The heart should be empty, the abdomen full. If the heart is not empty, thoughts scatter and qi becomes chaotic; old accumulations fail to transform below, congealing into phlegm-rheum. If the abdomen is not full, qi is deficient and stagnant; fluids and essence fail to melt, congealing into seminal leakage.” Let the learner take note.\n\nWhy must the body be upright? Know that for the Ren and Du channels, if the body is not upright, the qi mechanism becomes obstructed; when the body is upright, the qi mechanism flows unimpeded, and the hundred vessels are free. This is no minor matter.\n\nHowever, when first practicing this technique, qi may not descend easily, often causing counterflow or surging, or sensations of distension, stagnation, or soreness in the front or back of the body. These arise from residual sludge in the vessels that has not yet dissolved, as channel qi penetrates and rushes through. Such discomfort is a sign of unblocking. One must urgently apply the technique of raising the buttocks to press the Du channel, and empty the heart while filling the abdomen to press the Ren channel. Once the Ren and Du are fully open, previous afflictions will naturally resolve.\n\nAfter the Ren and Du channels are open, aside from the major methods of circulation and absorption practiced during the midnight and noon periods, one must, after obtaining the medicine, continue the techniques of raising the buttocks and emptying the heart, incorporating the upright practice to refine and nourish. With three years of practice, success will be achieved.\n\nWhy must the heart be emptied? If the heart is not empty, qi and spirit scatter with thoughts, principles lose their order, and practice lacks coherence—success is difficult. When the heart is empty, qi unifies, and even if stagnation remains, qi will dissolve it upon arrival. The practice becomes effective, and further subtleties reside within.\n\nIf one practices the technique of unblocking the Ren channel, upon completion, one must perform the technique of relaxing the abdomen and settling the spirit. Without this, there is a risk of yang sinking into yin, leading to dullness and torpor.\n\nThose who master this technique will find their qi settled and spirit clear. At this juncture, one must also attain the singular practice of \"a single spirit revealed.\" Without this, ascent becomes mixed with turbidity, often leading to distended brain, reddened eyes, restlessness, and stirred thoughts—invoking the thunderous yang and risking the peril of \"thunderclap spirit-flight.\" With this technique in place, such afflictions are entirely avoided. Even if slight distension or dizziness arises, applying the methods of emptiness, relaxation, and unobstructed flow will resolve it instantly. The subtleties of this phrase are beyond description!\n\nMaster Taixu further states: After a full meal, one must strictly avoid abruptly performing the technique of relaxing the abdomen; the method lies solely in emptying the heart. Once the food has settled somewhat, one should only maintain spirit within the heart and abdomen, avoiding vigorous practice—the method is to walk slowly while gently caressing the abdomen. Only after digestion is complete may one engage in martial practice.\n\nThe ancients said: \"After eating, practice with civility,\" and also: \"After eating, add emptiness of heart—with an empty heart, food digests easily.\" For humans, food is paramount, yet the root of illness often lies in stagnant food within the central palace, transforming into phlegm and rheum, giving rise to conditions like regurgitation. Practicing vigorously after eating causes grain to follow qi downward, stagnating in the lower extreme—this is the origin of anal abscesses and hemorrhoids. When turbid qi stagnates in the channels, it leads to paralysis and other ailments. If this substance adheres to the joints and bones over time, it generates fire, eventually causing consumptive diseases like bone steaming. The \"civility\" of the ancients refers to maintaining spirit in the central palace and directing intention to the Gate of Life. If one forcibly relaxes the abdomen, the practice becomes martial, which only invites illness—hence the prohibition.\n\nWhat is the method of emptying the heart? It is simply to relax the qi mechanism. Walking slowly aids the spleen in transforming food, while caressing the abdomen gathers and returns grain qi, guiding it to be refined by fire into qi. Once the food is digested, one must add the practice of \"contracting Gen.\" What is the method of contracting Gen? It is akin to restraining the urge to defecate or urinate, preventing grain qi from stagnating externally while also ensuring it does not descend and stagnate below. For this substance, the pure aspect ascends with qi to transform into blood, dispersing and filling the hundred channels; the turbid aspect descends with qi to moisten the intestines and stomach. If spirit is not properly regulated, it readily congeals into yin fluids, bringing harm to the entire body. Thus, the ancients paid particular attention to this in three ways.\n\nWhen one maintains spirit in the central palace and senses fullness and distension in the chest, respectfully guide intention to descend from the right side of the chest, circling around the navel wheel, then ascending from the left to encircle the navel and descend on the right—this is the \"Retreat Yin Talisman.\" Since grain qi is overly abundant, one must employ the retreat method. Once slightly relaxed, cease the practice and simply apply the method of emptiness of heart, naturally attaining a sense of release. Gradually, one perceives a misty, vaporous phenomenon before the eyes—this is the initial effect of grain qi steaming. Next, this scene pervades the entire body, indicating that grain qi is riding the central qi to circulate throughout—this is the effect of its flow within. Eventually, the chest and diaphragm feel clear, though the abdomen remains full.\n\nAt this point, the food has descended, and one may add the practices of left, center, and right circulation. Carefully follow this method: align the body with nasal breathing—inhale left, then left; inhale center, then center; inhale right, then right. The principle is exquisitely subtle, yet the practice remains civil. The ancients, though not explicitly explaining the mechanism, simply instructed to follow the method in circulation.\n\n[The ancient method relies on the qi of nasal breathing, moving left or right as it exits. However, the nose has only two nostrils—how can there be a \"center\" exit? The \"center\" refers to when both nostrils exhale simultaneously, forming the central qi. Human nasal breathing aligns with celestial timing, a truth long verified. The ancient method does not deceive: the cycle of exhalation and inhalation follows the twelve earthly branches—*zi* left, *chou* right, *yin* left, *mao* right—alternating precisely without deviation. At the transition between two hours, both nostrils exhale together. The count of exhalations increases notably at *zi* and *wu*, while other times are roughly similar.\n\nIn the circulation method: when qi exits the left nostril, descend from the left side of the chest, circle the abdomen to the right, then push inward at approximately two *cun* above the navel, directly attaching to the Gate of Life—this is called \"Advancing Yang Fire.\" For those deficient in yang, perform up to thirty-six rotations. When qi exits the right nostril, descend from the right side of the chest, circle the abdomen to the left, then push inward at approximately two *cun* above the navel, reaching the lower field without attaching to the Gate of Life—this is called \"Retreating Yin Talisman.\" For those deficient in yin, perform up to twenty-four rotations. When both nostrils exhale together as central qi, proceed straight from the Crimson Palace to the Central Yellow, rotating left thirty-six times and right twenty-four times around the navel wheel, then push inward at approximately two *cun* above the navel, entering the mysterious aperture. Remain thoughtless for a moment—this is called \"Sealing the Crucible.\"\n\nPracticing this method in accordance with the twelve hours without interruption is a great secret technique.]\n\nIf one inadvertently enters the *tun* and *meng* qi phase, this signals the spirit’s journey to the Water Palace. At this moment, the practitioner must swiftly apply the \"Clear Emptiness\" technique, further directing spirit to the Kun abdomen while employing the contraction of Gen—this will ignite the fire of the lower field. When the upper and central qi respond, strictly avoid premature ascent. The practice must continue its descent, aiding qi to press forward. Once the barrier is broken and transcended, qi surges up the spine, passes through the pillow, and ascends. After lingering for a moment, it naturally descends to the Flowery Pond. At this time, double the effort to still the heart, and one will surely receive a copious outpouring of sweet dew, filling the mouth to be swallowed in portions. The Crimson Palace feels as though true qi has congealed. Then, proceed with the \"Forgetting\" technique, attaining the wonder of a body without substance. Suddenly, one senses a drop descending from the void, straight into the heart—only an immense coolness is felt. Then, it descends further into the Central Yellow, evoking extreme warmth and moisture, as if spring pervades the entire body. This signifies that grain qi has transformed into the supreme treasure.\n\nAt this moment, the method lies solely in silently awaiting the state of \"not knowing, not perceiving\"—this is called \"receiving the treasure and returning to the furnace,\" and in alchemical texts, it is termed *\"Treasure Returns to Chaos.\"* For all practitioners, before reaching the stage of grain avoidance, how could this phase of cultivation be neglected? For herein lies the attainment of achievement—and herein, too, lies the risk of calamity.\n\nWhy must the initial step of Dao cultivation begin with the technique of *\"making the self equal to the void\"*? Because this void is the fundamental substance of Heaven and Earth, the ultimate realization of one’s own body. By employing this true image as the starting point, all subsequent methods and techniques will align with the Dao. Those who conduct themselves with utmost care, modeling their every action after Heaven and Earth, ultimately refine their practice by expanding their qi mechanism. Only when the qi mechanism is expansive can there be no stagnation within; then, one may take the body as lead, the heart as mercury, stillness as water, and wisdom as fire—without encountering the slightest difficulty.\n\nMoreover, the void within the body corresponds to Heaven, while the solid corresponds to Earth. The heart, liver, spleen, lungs, and kidneys within are none other than essence, spirit, ethereal soul, corporeal soul, and intent. In the realm of Heaven and Earth, they manifest as metal, wood, water, fire, and earth; in the Dao, they become benevolence, righteousness, propriety, wisdom, and trust. Their functions serve but to remedy deficiencies and correct imbalances, yet all ultimately fall within the two principles of stillness and wisdom.\n\nSome claim that stillness is the substance of the Dao, while wisdom is its function—this view appears plausible but is mistaken. For stillness is spoken of in contrast to restlessness, just as wisdom is contrasted with ignorance. In their profound meaning, both stillness and wisdom belong to the *function* of the Dao. The Dao as Dao is naturally pure and unified, yet encompasses the myriad existences; it spans past and present, appearing as if utterly quiescent and devoid of form—comparable to the Supreme Ultimate.\n\nResponding to phenomena as they arise is the meaning of wisdom; not being carried away as they depart is the meaning of stillness—yet only the sage can achieve this. For us practitioners, we strive to approximate such mastery: at first, it is difficult; then, it becomes possible; finally, it becomes spontaneous.\n\nThe method of cultivation is nothing other than self-mastery. The practice of self-mastery lies in: when at rest, purifying the constant; when in action, purifying the changing. My teacher, the Venerable Tai Xu, said: *\"If one takes the void as the Dharma-body yet fails to regard the physical body as the divine chamber of the Heavenly Heart, one falls into the emptiness of reckless nihilism, lacking any governing principle—this is the path of heterodoxy. Thus, the ancient sages invariably followed this technique with another, fearing the descent into the lifeless heterodoxy of non-sentience, and so further designated the fleshly heart as the heart of the Heavenly Heart.\"*\n\nFor the Heavenly Heart is never obscured, ever perfectly pure and awakened; thus, it responds to all things without bias, yet arises entirely from spontaneity. The qi mechanism naturally flourishes, and by following this, one engages in the alchemy of body and heart, lead and mercury, stillness and wisdom, water and fire—beyond this thought, no other thought intrudes. This is what is meant by *\"no-thought within thought.\"* If one were to eliminate even this thought, it would be like boiling an empty cauldron with water and fire—this is the lifeless heterodoxy of non-sentience. Those who aspire to the rank of Heavenly Immortal must jointly investigate this.\n\nThe ancient sages began with *\"non-delusion\"* as their entry point. For us practitioners, we provisionally employ stillness and wisdom as distinct methods. The practice likewise begins with non-delusion: taking non-delusion as stillness, and the arising of delusion as the occasion for its eradication as wisdom. The stages proceed thus: first, eliminating coarse delusion; then, subtle delusion; finally, the delusion within non-delusion—culminating in natural purity and perfect completion.\n\nFirst, establish this true thought as the seed of one’s Heavenly Heart—this is called *\"directly refining the upper barrier.\"* For now, set aside concerns about *\"conceiving the embryo, nurturing the embryo, and shedding the embryo,\"* for these terms, as used by the ancient sages, contain profound meanings. They serve merely to delineate the stages in detail, preventing the error of skipping steps or hasty progression. The ultimate aim is nothing other than *\"eliminating delusion and preserving the real.\"* The method of practice is simply *\"using one to eliminate the myriad.\"*\n\nThe method of practice proceeds from the shallow to the deep. By tracing names to their realities, refining further and further, and verifying the subtle with the subtle, its ultimate manifestation culminates in *\"non-abiding.\"* Yet this *\"non-abiding\"* is the very principle that sustains one from beginning to end. The true seed within the bow lies in *nature* as its essence and *life* as its function. Concentrate and preserve it, fuse it into oneness, refine it with spirit, and through deep cultivation, merge directly with the unmanifested origin—then there is no duality. With this Dao-body, its function becomes wondrous of itself. Yet how could this not begin and end with *\"non-delusion\"*?\n\nThis was the earnest intent behind the ancient sages' establishment of names and terms. Alas, later students failed to comprehend, instead clinging to delusion and fostering all manner of perverse views, leading them astray. Only those who grasp this principle may take up the alchemical texts to affirm and verify; otherwise, it is better to leave them untouched upon the high shelf.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "溯古神功性命双修琐言续（太虚集录） 古哲有言曰：修炼有三乘，（天仙地仙水仙也。 ）而炼法惟三则。 三则惟何？ 端直其体，空洞其心，真实其念。 （念即志，志乃主宰内外者，故又名曰主人翁。 ）此三句是双修家（性命双修之家也）彻终彻始、片时片刻，莫可或遗者，（遗忘也）其功法增减，第可自审而维持之。 （秉性有明暗，体质有厚薄，阴阳有偏胜，境地有忙闲，天时有冬夏。 ）丹书所载，无非培命口诀，而行贵得中，又炼须合时。 盖一年有二至，一月有朔望，一日有子午，体有自然气机，（机者动之兆，升降之先觉者也。 ）现有不同景象，（静观其机，吉凶可卜，及其已现，吉凶已定，窃欲挽回，还于机兆时以意维之，俟其已现酌加增损乃妙。 ）而火候寓焉。 究其秘要，不过升降放收而已； 其利弊，不过勉强自然、通泰塞执，与夫确遵疑间焉而已。 古之人，以一年缩一月，以一月缩一日，以一日缩一时，以一时缩一刻，名曰功夺造化。 《入药镜》寿其诀，诸丹经承述之，行无不验。 而古哲谓须循体以待时——时乃活子，体乃道体也。 原夫冬春气机贵后透。 法自下极，气穿尾闾、上夹脊、透玉枕、入泥丸，略存而降； 又自华池下重楼，由绛宫一停，乃过心，（泥丸名髓海，暖气达脑乃化液，华池乃任督会，故须略停，非仅止泥丸也。 重楼乃直下，至如绛宫乃藏气之府，脑池所降之液便可于此化血者。 ）或经心后分两路达下腰肾，又略存之； （心后有两络通腰肾，人用心太劳而心血枯，两肾之精逆上以救，故劳心者其肾必亏，此腰酸疼之症所由致也。 今于心后退降其羔，其血随下，血便化白而肾气充足，故须略存之。 ）觉此暖各向腹兜，环拱至脐轮，须大存之； （此又炼液化气之妙用，故须大存。 ）乃以意注命门，又须久存； （此乃炼气化羔之妙用，故须久存。 余按炼诀，其于命门、绛阙、泥丸三处为仙凡共宝之要地，凡人于此能着意，精、气、神充足，事仙舍此三地，无从下手。 然水府本冷，绛阙本暖，而下极又系阴浊会地，泥丸为清会之天。 盖水性润下、火性炎上，乃欲令水上升、火使下达，非意指使不从命也。 究其寒能令暖、热能令凉，固必藉夫真意以挽回之，然亦内有自然之义焉。 盖此水府自有命门，状若佛前琉璃灯，昼夜不熄； 绛阚有华池，而心苗涵其中，上下髓海布下直阴以覆之，此天造地设现成真境。 古哲于此真境中，默令真意以维持之。 若从水府入手，则于活子阳生时，维不外透，而又默集夫四家真火附入命门，厥阳自旺、群阴恋炼，寒且化暖而真阳亦藉以润，升透自易。 及其既透，又有过化存神之妙，而升透自无稍阻，此督通御极自然之妙义。 若从绛阙入手，则于活午阴生时，维不内滞，而又默集夫四家真水汇注华池，厥阴自旺，群阳乐涵，热且化凉而真阴亦藉以熔，降灌自利。 且其下灌，亦有过化存神之妙，而降灌自无或滞，绛阙神清，境忘其热，得有化血化羔之验，因而下注中黄，辟开生面，四境咸宁，此任通抚世、自然妙验之义。 ）然后下穿尾闾，如前法升而降而存。 按功诀谓以未穿尾闾为一周天，（盖此功法乃自下极起手，行到下极已满一周天耳！",
      "translated_text": "From the *Suoguan Continued: On the Dual Cultivation of Nature and Destiny* (Collected Works of Taixu)\n\nThe ancient sages declared: \"Cultivation comprises three vehicles—celestial immortals, terrestrial immortals, and aquatic immortals—yet its methods adhere to but three principles. What are these three? Uprightness of form, emptiness of mind, and sincerity of intent.\" (Intent here signifies *zhi*, the master governing inner and outer; hence it is also called the \"host within.\") These three phrases are the unceasing, moment-to-moment foundation of the dual-cultivation school (those who refine both nature and destiny), never to be neglected. (Neglect here means forgetfulness.) The progression or moderation of their practice may be self-assessed and maintained. (For innate dispositions vary in brightness and obscurity, constitutions in thickness and thinness, yin and yang in dominance and subordination, circumstances in busyness and leisure, and seasons in winter and summer.)\n\nThe alchemical texts record nothing but oral instructions for nurturing destiny, yet their application must strike the mean, and their refinement must align with the proper time. For the year has its two solstices, the month its new and full moons, the day its midnight and noon, and the body its natural *qi*-mechanisms. (Mechanism denotes the harbinger of movement, the foreknowledge of ascent and descent.) These manifest in diverse phenomena. (By quietly observing the mechanism, fortune and misfortune may be divined; once manifested, they are already determined. To attempt reversal, one must employ intention at the moment of the mechanism’s inception, awaiting its manifestation to adjust with subtlety—this is the art.)\n\nThe essence of fire-times lies therein. In truth, its secrets reduce to nothing more than ascent and descent, release and gathering. Its benefits and harms hinge on whether one forces or follows nature, whether one flows freely or clings obstinately, and whether one adheres steadfastly or wavers in doubt. The ancients condensed a year into a month, a month into a day, a day into an hour, and an hour into a moment—this they called \"stealing the workings of creation.\" The *Mirror of Ingredient Entry* preserves their method, and all alchemical classics transmit it; none who practice it fail to witness its efficacy.\n\nYet the ancient sages insisted one must follow the body’s rhythms to await the proper time—time here refers to the \"living midnight,\" and the body to the Dao-body. Consider: in winter and spring, the *qi*-mechanism favors delayed penetration. The method begins at the lower extreme, where *qi* pierces the *weilu*, ascends the spine, penetrates the *yuzhen*, and enters the *niwan*, where it lingers briefly before descending. It then flows from the *huachi* down the *chonglou*, pauses at the *jiangong*, and passes through the heart. (The *niwan* is called the Sea of Marrow; when warmth reaches the brain, it transforms into fluid. The *huachi* is the meeting point of the *Ren* and *Du* meridians, hence the brief pause is not confined to the *niwan* alone. The *chonglou* descends directly, while the *jiangong* is the palace storing *qi*; the fluid descending from the brain’s reservoir may here transform into blood.)\n\nAfter passing the heart, it divides into two pathways to reach the lower back and kidneys, where it lingers again. (Behind the heart, two channels connect to the waist and kidneys. When one overtaxes the heart, its blood withers, and the kidneys’ essence reverses upward to rescue it—hence those who overwork the heart invariably deplete their kidneys, giving rise to symptoms of lumbar soreness and pain. By guiding the *qi* downward from the heart, blood follows, transforming into white essence while kidney-*qi* flourishes—thus the need for a brief pause.)\n\nWhen warmth is felt converging toward the abdomen, encircling the navel, one must dwell upon it intently. (This is the wondrous function of refining fluid into *qi*, hence the need for deep focus.) Then, directing intention to the *mingmen*, one must linger there for an extended time. (This is the wondrous function of refining *qi* into *yang*-essence, hence the need for prolonged focus. According to the refinement methods, the *mingmen*, *jiangque*, and *niwan* are the three sacred sites shared by immortals and mortals alike. If one can concentrate here, essence, *qi*, and spirit will flourish; without these three, no immortal practice can begin. Yet the Water Palace is inherently cold, the *jiangque* inherently warm, the lower extreme a gathering place of yin turbidity, and the *niwan* the celestial realm of purity. Water by nature moistens and descends, fire by nature flames upward—how then can water be made to ascend and fire to descend? Without the command of intention, they will not obey. To make cold warm and heat cool, one must rely on true intention to reverse their course, though this also follows an inherent principle.\n\nFor the Water Palace possesses its own *mingmen*, resembling a lapis lazuli lamp before the Buddha, burning day and night without extinguishing. The *jiangque* contains the *huachi*, with the heart’s sprout nestled within, while the Sea of Marrow above and the straight yin below envelop it—this is the innate, heaven-crafted true realm. The ancient sages, within this true realm, silently employed true intention to sustain it.\n\nIf beginning at the Water Palace, at the living midnight when yang arises, one prevents outward leakage while silently gathering the four true fires to enter the *mingmen*. There, yang naturally flourishes, the host of yin delights in refinement, cold transforms into warmth, and true yang is nourished, making ascent effortless. Once ascended, the marvel of \"transformation through passage, preservation through spirit\" ensures unimpeded ascent—this is the natural wonder of the *Du* meridian’s thoroughfare to the extreme.\n\nIf beginning at the *jiangque*, at the living noon when yin arises, one prevents internal stagnation while silently gathering the four true waters to converge in the *huachi*. There, yin naturally flourishes, the host of yang delights in containment, heat transforms into coolness, and true yin is tempered, making descent smooth. As it descends, the same marvel of \"transformation through passage, preservation through spirit\" ensures unimpeded flow. The *jiangque* becomes spiritually clear, its heat forgotten, yielding the effects of blood and *qi* transformation. Thus descending to the Central Yellow, it opens a new realm, pacifying all four boundaries—this is the natural efficacy of the *Ren* meridian’s governance of the world.\n\nThereafter, it pierces the *weilu* and ascends, descends, and lingers as before. The method states that failing to pierce the *weilu* completes one *zhou tian*. (For this practice begins at the lower extreme, and upon returning to it, one full *zhou tian* is accomplished.)",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1217,
      "start_sentence": 0,
      "end_sentence": 40,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.47201466560364,
      "metadata": {
        "source_file": "dao\\藏外\\太虚集录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "）古哲题为冬春功法。 若值夏秋，体其气机，乃贵前通。 其功法乃自华池一存后，方下重楼，抵绛宫，法当存此绛宫——局境宽邃，趣味悠闲，恍见性水，波光蓝如（说法如是，然戒按图索骥。 ）——顿觉得有凉液自天滴下，（按功法，学者斯时项背须直，而头面须带仰势。 ）一到心宫，倍觉清凉，（谨按功法，学者斯时方见性水，可悟上所述，第言其理耳！ ）斯时大存之； （所谓大存者，并无作用寓焉，从事忘忘，是即大存也。 ）继乃随机溜下，（味斯溜字，有油然自得之趣。 ）分达心后，（此由心后两络，分达腰肾，藏有露液化血、露血化精等等妙验。 ）及腹，又觉遍体氤氲，（是又余液化气之验。 ）下极火热，（是又炼气化气之验。 ）身前身后微微汗透，得有如沐如浴景象； （按功法未满一周而效至此节，欲停功亦无不可。 第欲停功，须加忘热片时也。 ）微以意向后注，（曰微者，以时值夏令，内景贵凉，学者内无积寒淤滞，而功到汗透，功已足矣。 若再加意，便违天时。 ）自透尾闾而升巅顶，（功到透关达脊，虽值夏令，不妨加意内透以达内伏积阴，亦口诀也。 ）一到泥丸，须大存之； （此一存也，其理微妙，学者慎毋认作故事行去，是乃督通之竟验，又为通任之初基、中通之元始，绛阙赖以安宁，华池藉以清洁，黄中通理、玄窍神凝，以生以成，咸叨其荫，是内药，外药分金之通会。 学者于此惟空洞其心，真实其念，顺其羔腾，勿忘勿助，透足羔回，髓澄天际，即有箫台琼馆，阆苑金庭，隐现于斯。 惟存敬肃，戒住欣赏。 学者功足，现益清澈，要知犹系身具，未足为真。 第此净境，是名真影，日后道成所造证者实似之。 目前大存，法惟益加清省，戒起妄念而已。 ）乃复自脑下华池、达绛宫，又大存之； （此存有大关系，其功法玄矣，然不外夫无为功里施功也。 盖阙乃化血之府，心凉生血，故须无为。 血须归络，故机气须虚。 意不加松，其机尚滞，中无敛意，血又妄行，法宜向机以佐导之，而胸背腰腹，法有定制，苟或违制，功到验至，竟大悬殊，致有因成血症者。 定制惟何？ 胸势惟向后而已，是虚心靖阙之秘旨，学者识之。 ）自觉遍体清快，古哲谓为一周天，夏秋功法乃如此。 （古哲之行合天时者，功法乃尔。 ） 然上所述，乃行功之常法，为身无疾病者言之。 苟有疾病，其中另有功法，须自酌施，总以行合道体而又得时，厥验乃神，慎毋固必焉。 一值夏秋，而病患积寒内滞，还宜先事冬夏互行功诀。 其行夏秋本法，惟主气降。 若行冬春，于气得降腹后，大加存运，能得腹暖； 有气后攻，乃加翘臀，注穿尾闾，透脊达巅，以得汗透为得功。 其后行动，但存忘热一诀，（心静之极，且能从无闻无见处深入，其热乃忘。 ）次第加减，即为互行功诀。 若专行夏秋，必俟积寒尽出后，乃可行焉。 不尔，不惟无效，适能增病。 一患素体多痰者，宜于夏令治之。 （其时气机向外透，行功者顺攻，其内积随气外透，则病根除。 此正行合天时之古法也。",
      "translated_text": "This was titled by ancient sages as the winter-spring practice. If one encounters summer or autumn, one must attune to the qi dynamic, for then the priority lies in prior penetration. The method proceeds thus: after abiding in the Flowery Pond, one descends the Tower of Nine Stories to reach the Crimson Palace, where one should dwell in this Crimson Palace—its realm vast and profound, its ambience leisurely and serene, as if glimpsing the Water of Nature, its waves shimmering in azure (such is the teaching, yet beware of seeking by rote). Suddenly, one feels a cool liquid dripping from the heavens (in this moment of practice, the adept’s nape and back must remain straight, while the head and face adopt a slightly upturned posture). Upon reaching the Heart Palace, the coolness redoubles (as the method cautions, only now does the adept perceive the Water of Nature, realizing that the foregoing merely expounded its principle). At this juncture, one engages in *great abiding*—(what is called *great abiding* harbors no contrivance; to be wholly present yet wholly forgetful is precisely *great abiding*). Then, following the qi’s movement, it flows downward (savor this word *flow*, for it carries the joy of effortless spontaneity), branching to the heart’s posterior (from the heart’s posterior, the two channels diverge to the lumbar kidneys, where wondrous transformations occur: dew-like liquid transmutes into blood, dew-like blood into essence). As it reaches the abdomen, one feels the entire body suffused with misty vapor (this is the sign of surplus liquid transforming into qi). At the lower extreme, fire and heat arise (this is the sign of refining qi into qi). A faint perspiration emerges across the front and back of the body, evoking the sensation of bathing or immersion (if the effects manifest at this stage before completing one *zhou tian*, one may cease practice without harm. To cease, one must first forget the heat for a time). With a slight intention directed rearward (the word *slight* is used because, in summer, the inner landscape favors coolness; if the adept harbors no internal accumulations of cold or stagnation and has attained perspiration, the practice is already sufficient. To add further intention would defy the season), it penetrates the *weilu* and ascends to the crown (though in summer, once the practice has breached the passes and traversed the spine, one may intentionally guide the qi inward to dissolve latent yin accumulations—this too is a key technique). Upon reaching the Muddy Pellet, one must engage in *great abiding* once more (this act of abiding is subtly profound; the adept must not treat it as mere routine. It is the ultimate verification of the *Du* meridian’s penetration, the foundation for the *Ren* meridian’s opening, and the origin of central circulation. The Crimson Palace relies on it for tranquility, the Flowery Pond for purity, the Central Yellow for harmonious governance, and the Mysterious Orifice for spiritual coalescence—all growth and fruition depend on its influence. It is the convergence of inner and outer elixirs. Here, the adept must empty the heart, solidify the mind, follow the qi’s ascent without forgetting or forcing, and allow the qi to return fully, the marrow to clarify like the heavens. Then, the Flute Terrace and Jade Pavilion, the Jasper Gardens and Golden Courts, may fleetingly appear. One must abide in reverence and solemnity, avoiding attachment to such visions. When the adept’s practice deepens, these scenes grow clearer, yet they remain mere bodily phenomena, not yet the true attainment. This pure realm is called the *true reflection*, resembling the state one will ultimately realize upon Daoist accomplishment. For now, *great abiding* requires only heightened clarity and vigilance against wayward thoughts).\n\nThereafter, it descends from the brain to the Flowery Pond, reaching the Crimson Palace, where one abides once more (this abiding holds great significance, its method profoundly subtle, yet it remains an act of *wuwei* within practice. The Palace is the mansion of blood transformation; when the heart is cool, blood is generated, hence the need for *wuwei*. Blood must return to the channels, so the qi dynamic must be empty. If intention is not relaxed, the dynamic stagnates; if the center lacks gathering intent, blood flows recklessly. The method calls for guiding the dynamic with subtle assistance, while the chest, back, waist, and abdomen follow fixed postures. Any deviation from these postures, though effects may still manifest, will yield vastly different results, even leading to blood disorders. What are these fixed postures? The chest’s posture must incline rearward—this is the secret of emptying the heart and pacifying the Palace; let the adept take heed).\n\nOne then feels the entire body refreshed and at ease. The ancients called this one *zhou tian*, thus is the summer-autumn practice. (The ancients, aligning their practice with the seasons, followed this method.) Yet the foregoing describes the standard practice for those without illness. If one suffers from illness, there are other methods to be applied at discretion, always ensuring alignment with the Dao’s nature and the season—only then will the effects be divine. Beware of rigid adherence. If, in summer or autumn, one harbors internal accumulations of cold and stagnation, one should first employ the winter-summer interchange method. When practicing the summer-autumn method proper, the focus is on qi descent. If practicing the winter-spring method, after the qi descends to the abdomen, one engages in *great abiding* and circulation to warm the abdomen. When qi subsequently surges, one raises the buttocks, directs the intention to pierce the *weilu*, traverses the spine to the crown, and attains perspiration as the sign of success. Thereafter, the practice involves only the *forgetting heat* technique (when the heart is utterly still, one may even delve into the realm of no hearing and no seeing, and the heat is forgotten). Adjustments are made in sequence, forming the interchange method. If practicing the summer-autumn method exclusively, one must wait until all internal cold accumulations are expelled before proceeding; otherwise, not only will there be no effect, but the illness may worsen. For those with a constitution prone to phlegm, treatment is best undertaken in summer (at this time, the qi dynamic tends outward; the practitioner follows this outward movement, and internal accumulations are expelled with the qi, eradicating the root of the illness. This is the ancient method of aligning with the seasons).",
      "overlap_context": ", yielding the effects of blood and *qi* transformation. Thus descending to the Central Yellow, it opens a new realm, pacifying all four boundaries—this is the natural efficacy of the *Ren* meridian’s governance of the world.\n\nThereafter, it pierces the *weilu* and ascends, descends, and lingers as before. The method states that failing to pierce the *weilu* completes one *zhou tian*. (For this practice begins at the lower extreme, and upon returning to it, one full *zhou tian* is accomplished.)",
      "start_char": 1217,
      "end_char": 2375,
      "start_sentence": 41,
      "end_sentence": 87,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 58.05064249038696,
      "metadata": {
        "source_file": "dao\\藏外\\太虚集录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "）其法，先以顺气下降，得气既降，加行坠注功法，总以腹有气行，更得暖气后攻，方行翘臀等诀。 行后得汗，倘不耐热，加行清降之功，以气降胸宽为度。 既得气降心凉，立即嗣行神注命门，觉有气攻，加行翘臀等诀，其汗自透。 于既透后，即续行清降法。 如是循环间行，一七、二七后，必易暖易升。 犹须加坠腹、注神等功。 （坠腹功法，乃胸右降下、兜脐、转左、中存，推迸下达，则痰自大便而出。 注神功诀，乃自胸左降下、兜脐、转右、中存，推进神附命门。 盖左下法进火，右下法退符，各有妙义存焉。 ）如是行去，其于升后必多凉液，自项自胸而下。 （此物降时，必须面带仰势，否则有流弊。 ）切勿认作甘露，此乃泥精，经神烘活，又为羔御下降之物，不得脐轮大炼一番，犹能为祸。 法当加意柙注命门，得逢火发，（此法得于外肾举时，以意兜回，厥火乃大发。 ）热若炭灸，存而炼之。 且缓行透后功法，惟循行忘热，加用真意横栏臆下，禁气上透，此为要嘱。 如或疏虞致透，意用两目上视，兜引乾气降压，其气便自回下，须急随其机向后关注透，其羔必破关后透。 仍以意引透至顶，又必大汗如雨。 （此积阴化汗而出，切勿热汗多亡阳等说自误。 ）渐渐复自顶下降绛阙。 倘得有一点滴下，甚捷而极凉者，乃是真液。 若有滴下，不捷亦不凉，尚是泥物所化，不是甘露。 必行得有甘露，方为大效，然总以积阴尽除再图后效是嘱。 一患内热发躁者，惟甩降诀，或加行虚心功法，有食自消。 再行引火归源，神注命门，得有气行下极，随机旋运，得有浊火下注，微以意送，放出狱门。 随以两目上视泥丸，收回清气，门闭，仍由绛阙下注脐轮，透入祖窍，加以忘字诀守之。 既得神凝息定，而胸膈必舒，病已去矣。 乃可续行实腹，须兼神注命门，其腹自实。 此后可行通督法，督通则必有液下，而须细辨真凡，此亦要嘱。 其降既真，方可循行炼精化气、炼气化神、炼神还虚等等功诀。 一患血热气滞、胸膈板满者，先行虚心法，继加退背功，便觉心后有羔二股，从心后际分达腰肾，热如汤注。 （行此功者，胸势带仰乃妙。 ）渐觉此热兜脐轮，满腹大热，遍体微汗。 斯时心地必觉松宽，是全赖退背一决也。 退背功法，乃于阙盆，以意后导。 阙盆即绛关化血之府，又名炁藏。 此法自李少君后，世鲜知之。 有患络血狂吐者，亦须先行此诀。 继行辟豁中关，而虚心功法寓焉。 或有功自华池，引加乾金，加行虚心功决，厥病亦痊。 统名夏秋功法。 或谓俟腹大热，行加翘臀、达脊抵脑等功法。 俟炁达脑，乃大存之，加用返视泥丸，引此乾宫真炁下会任督于华池，自得甘露满口，咽咽送至绛阙一蒸，乃达中黄。 觉此绛阙清凉而中黄温润，学者于此加行溯古神功——是名开中关，又名辟混沌，丹书谓之开玄关——其法诀，从事忘忘而已。 此关辟后，生药有地、藏药有所矣。 得开真境惟何？ 宽广无涯，深邃如之。 盖此一则，乃造命立命之真功，学者须宝志之。 噫！ 勤而不遇，必遇至人，学者勉之。",
      "translated_text": "The method begins by guiding qi downward in sequence. Once the qi has descended, the *sinking and infusing* technique is applied. The practice proceeds only when qi moves within the abdomen and is followed by the warming qi’s subsequent ascent—then the *raising the buttocks* and other formulas may be employed. After practice, if sweat is produced but heat becomes unbearable, the *clearing and descending* technique is added until the qi descends and the chest feels open. Once the qi has descended and the heart is cool, immediately proceed with *spirit-infusion at the Gate of Life*, sensing the qi’s ascent. Then apply the *raising the buttocks* and other formulas, and sweat will naturally permeate. After permeation, continue with the *clearing and descending* method. Practicing in such alternating cycles for one or two seven-day periods will inevitably yield warmth and ascent. Yet one must still apply the *sinking the abdomen* and *spirit-infusion* techniques.\n\nThe *sinking the abdomen* technique involves guiding qi downward from the right side of the chest, circling the navel, turning left, retaining it at the center, and propelling it downward—then phlegm will exit through the bowels. The *spirit-infusion* formula involves guiding qi downward from the left side of the chest, circling the navel, turning right, retaining it at the center, and directing the spirit to adhere to the Gate of Life. For the left-downward method advances fire, while the right-downward method retreats the talisman—each holds its own profound significance.\n\nProceeding thus, after ascent, copious cool fluid will descend from the nape and chest. (When this substance descends, the face must be tilted upward; otherwise, harm may ensue.) Do not mistake this for sweet dew—it is muddy essence, refined by spirit and transformed into descending refined substance. Without undergoing a thorough refinement at the navel wheel, it may still cause harm. The method requires focused infusion at the Gate of Life until fire arises. (This technique involves drawing back the external kidneys with intent when they rise, causing the fire to blaze intensely.) When the heat is like burning charcoal, retain and refine it. Proceed slowly with subsequent permeation techniques, focusing solely on *forgetting heat* while using true intent to horizontally bar the chest, preventing qi from ascending—this is crucial. If carelessness allows permeation, direct intent upward with the eyes to draw in the celestial qi for descent and suppression, causing the qi to return downward. Swiftly follow its momentum to guide it through the posterior pass, where the refined substance will break through. Then lead it with intent to the crown, and profuse sweat will pour like rain. (This is the transformation of accumulated yin into sweat; do not mistakenly fear excessive sweating as yang depletion.) Gradually, it will descend from the crown to the Crimson Palace. If a single drop descends swiftly and feels extremely cool, it is true fluid. If it descends slowly and without coolness, it remains a muddy transformation, not sweet dew. Only when sweet dew is achieved is the effect profound, though one must ensure all accumulated yin is expelled before pursuing further results.\n\nFor those suffering from internal heat and restlessness, employ only the *descending formula* or add the *empty-heart* technique, and food will naturally digest. Then practice *guiding fire back to its source*, infusing spirit at the Gate of Life. When qi moves to the lower extreme, follow its momentum in circular motion until turbid fire descends. Gently guide it with intent to release it through the prison gate. Then raise the eyes to the Mud Pill, drawing back pure qi to close the gate, and guide it downward from the Crimson Palace to the navel wheel, permeating the ancestral aperture. Apply the *forgetting* formula to guard it. Once spirit congeals and breath stabilizes, the chest and diaphragm will feel at ease, and the illness will depart. Only then may one proceed to *filling the abdomen*, which must be combined with *spirit-infusion at the Gate of Life*—the abdomen will naturally fill. Thereafter, the *thoroughfare vessel* technique may be practiced. When the thoroughfare vessel is open, fluid will descend, requiring careful discernment between the true and the ordinary—this is also crucial. Only when the descent is genuine may one proceed with formulas such as *refining essence into qi*, *refining qi into spirit*, and *refining spirit to return to emptiness*.\n\nFor those suffering from blood heat, qi stagnation, and chest tightness, first practice the *empty-heart* method, then add the *retreat the back* technique. One will feel two streams of refined substance behind the heart, dividing from the heart’s posterior and reaching the waist and kidneys, hot as boiling water. (For this practice, tilting the chest slightly upward is optimal.) Gradually, this heat will encircle the navel wheel, filling the abdomen with warmth and inducing slight sweat throughout the body. At this time, the heart will feel relaxed and open—this is entirely due to the *retreat the back* formula. The *retreat the back* technique involves guiding qi backward from the *Quepen* with intent. *Quepen* is the mansion where the Crimson Palace transforms blood and is also called the *qi repository*. This method has been rarely known since Li Shaojun. For those suffering from frenzied vomiting of networked blood, this formula must be practiced first. Then proceed to *clearing the central pass*, incorporating the *empty-heart* technique. Alternatively, one may start from the *Flowery Pond*, drawing in celestial metal and applying the *empty-heart* formula—this will also cure the illness. Collectively, these are called the summer-autumn methods. Some suggest waiting until the abdomen is fully warm before applying the *raising the buttocks*, *reaching the spine*, and *ascending to the brain* techniques. Once qi reaches the brain, retain it fully, then reverse the gaze to the Mud Pill, guiding this celestial palace’s true qi downward to meet the Conception and Governing Vessels at the Flowery Pond. Sweet dew will fill the mouth; swallow it repeatedly to steam the Crimson Palace, reaching the Central Yellow. One will feel the Crimson Palace cool and the Central Yellow warm and moist. At this point, practice the *tracing the ancients’ divine technique*—this is called *opening the central pass*, also known as *clearing the primordial chaos*. In alchemical texts, it is termed *opening the mysterious pass*. The method involves nothing more than *forgetting forgetting*. Once this pass is opened, the elixir has a place to grow, and the medicine has a repository. What is the true realm revealed? It is boundless and profound. This single principle is the true technique of *establishing life and destiny*—practitioners must treasure it. Alas! Diligence without encountering a true master is futile—practitioners, strive on.",
      "overlap_context": "hod exclusively, one must wait until all internal cold accumulations are expelled before proceeding; otherwise, not only will there be no effect, but the illness may worsen. For those with a constitution prone to phlegm, treatment is best undertaken in summer (at this time, the qi dynamic tends outward; the practitioner follows this outward movement, and internal accumulations are expelled with the qi, eradicating the root of the illness. This is the ancient method of aligning with the seasons).",
      "start_char": 2375,
      "end_char": 3538,
      "start_sentence": 88,
      "end_sentence": 136,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.129465103149414,
      "metadata": {
        "source_file": "dao\\藏外\\太虚集录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "一患积阴化火、状若有余者，法惟先行夏秋功法，以治其标，病减，加行冬春——此指积阴未全化火者。 若已全化火，法惟引火归源，而酌加夏秋降诀，助火归源，乃得济。 （此症当以潇洒为宗，置此身于已死，念起即以佛号扫之，有津濒咽乃济。 ） 若其积阴内滞、尚未化火者，诀惟内运真火，而外加擦耸，循环无间，庶几有效。 （外功加擦腰肾及腹、腿、膝、足、手，与夫迭耸两肩，辘轳双转，撤腿摆腰，纽颈托天，浴面咽津。 内功如注神闭息之类。 ）俟腹知暖，（闭息乃能。 ）再加透后功。 （亦惟闭息功熟，乃得外透功验。 ）盖以此中真炁不旺，（亦正此中积阴太富。 ）阳不胜阴，见效甚难。 （如置盆火于冰窖中，如何觉暖。 ）法惟外加擦耸，而内行闭息，（如是则气机活而外透有期。 ）俟其阳充，得有自透自攻真景，（虽曰自透自攻，然仗闭息等法而得。 ）始用意通破关。 （非于阳生时加功不得也。 ）其阳已充，故能得透。 若其积阴兼滞百络者，（此症加功更不容易，以中多窒塞耳！ ）亦惟先行闭息，次加存运于坤腹，始其炁自透络，得征通泰。 （惟得汗透如雨，数次乃有是效。 ）法于此际，（行功到此，方有收效。 ）尚须加意存运，（苟一畏劳停功，便有炉冷之弊。 ）以培真火。 何以故？ 百络向滞之物，得炁以烘，理必随炁以行，汇趋下极，（世人行功，每多下泄，职是故耳！ ）则斯下极，群阴势旺，譬如盆火室中围以冰墙，有暖不胜寒之象。 法惟大加炭火，犹恐不济，故惟加炭功勤，不计时日，总以冰墙尽化，乃为大济。 无如学者不悟，每撒废于斯时，古今不少，故法惟恒且勤，勤且勇，行效其然，不效亦然，则滞物虽伙而尽化有期，何患终不大效哉。 旷观斯世之患斯症者十有二三，大抵非商即儒，何以故？ 其症成于心劳身逸。 盖心劳者神必衰，身不劳者气必滞，神衰气滞者，愈恶劳而喜逸，此阴寒积滞之由。 欲愈斯症，须反素习，素习能反，厥病自痊，病痊，再求功法，此乃王道，顺者行之。 如上所示化功也，非大根器人，未有不半途而废，此八段、十二段、十六段、二十四段等等锦法，所以慈示也。 盖此阴精成于气滞，气滞则精泥血淤，不得武功以荡以磨，万无见效之期。 学者不察，竟弃勿事，非厌烦也，殆以伎小不屑为，噫！ 譬如登高必自卑，况夫等等武功，藉以治病，何尝取藉成道者哉！ 学者其省之。 谨按：古哲遗有四时功法，而缩行于十二时中，余今以十二时一定气象为学者言之。 凡夫水月交映得之自然者，子正有之； 我无觉有，丑正有之； 觉气通流，寅正也； 气机洋溢，卯正也； 存无守有，辰正之功； 隐现莫测，巳正气象； 万象罗列，午正气局； 真幻无常，未正如之； 念起即扫，申正功法； 一灵独露，是酉正兆； 闻见顿泯，觉无端倪，非戌不现； 切戒惊疑，守戌正法，湛如寂如，是值亥正。 [此虽一定气局，而惟得之自然为真，是故即于子正时标示。 学者准此一句玄谕，循而行之，自然吻合，万无中变。 要知水月交映，其机根于湛寂，学者于此湛如寂如之际，一念不生，其气清极，而水月自现，此天一生水坎象也。 坎中一画，即月现之本，有是体存，自有用现，故日得之自然。",
      "translated_text": "One affliction arises when accumulated yin transforms into fire, presenting as if in excess. The method here is first to employ the summer and autumn techniques to address the branch, and once the condition lessens, add the winter and spring practices—this applies when the accumulated yin has not fully transformed into fire. If it has fully transformed into fire, the method is solely to guide the fire back to its source, with a measured addition of summer and autumn descending formulas to assist the fire’s return, thereby achieving resolution. (For this condition, one must take *ease* as the principle, regard this body as already dead, and whenever a thought arises, sweep it away with the Buddha’s name. Swallowing saliva as it wells up will bring relief.)\n\nIf the accumulated yin remains internally stagnant and has not yet transformed into fire, the formula is to internally mobilize the true fire while externally applying rubbing and lifting, circulating without interruption—only then may there be efficacy. (External practices include rubbing the waist and kidneys, abdomen, legs, knees, feet, and hands, as well as repeatedly lifting the shoulders, rotating both arms like a windlass, stretching the legs, swaying the waist, twisting the neck, and pushing upward as if supporting the heavens, washing the face, and swallowing saliva. Internal practices include techniques such as focusing the spirit and breath-holding.)\n\nWait until the abdomen feels warmth (which breath-holding can achieve), then add the *penetrating the posterior* technique. (Only when the breath-holding technique is mastered will the external penetrating technique yield results.) The reason is that the true *qi* in this region is not vigorous (precisely because the accumulated yin is too abundant), and yang cannot overcome yin, making efficacy difficult to attain. (It is like placing a basin of fire in an ice cellar—how can one feel warmth?) The method is to externally apply rubbing and lifting while internally practicing breath-holding (in this way, the *qi* mechanism becomes lively, and external penetration will eventually occur). Wait until yang is abundant, and the true scene of *self-penetration and self-attack* emerges (though called *self-penetration and self-attack*, it is achieved through breath-holding and other methods), then use intention to break through the pass. (This cannot be done unless one applies the technique when yang arises.) Only when yang is abundant can penetration be achieved.\n\nIf the accumulated yin is accompanied by stagnation in the hundred meridians (this condition makes progress even more difficult, as there is much blockage within!), the method is first to practice breath-holding, then add visualization and circulation in the *kun*-abdomen, so that the *qi* naturally penetrates the meridians, achieving signs of free flow. (Only when sweat pours forth like rain over several sessions will this effect be attained.) At this stage (when the practice has reached this point, results begin to appear), one must still apply focused visualization and circulation (if one fears hardship and stops, the furnace will grow cold). Why? The stagnant substances in the hundred meridians, when warmed by *qi*, will naturally follow the *qi* in its movement, converging toward the lower extremity (most people’s practices result in downward leakage for this very reason!). At this lower extremity, the massed yin forces prevail, resembling a basin of fire in a room surrounded by ice walls—warmth cannot overcome the cold. The method is to add more charcoal to the fire, yet even this may not suffice. Thus, one must intensify the effort without regard for time, aiming only for the complete melting of the ice walls—only then will there be great relief. Alas, practitioners often fail to realize this and abandon their efforts at this stage, a common occurrence throughout the ages. The method, therefore, lies in perseverance, diligence, and courage: practice yields results, and even if it does not, one must persist. In this way, though the stagnant substances may be many, they will eventually dissolve—why fear that great efficacy will never be achieved?\n\nSurveying the world, ten or twenty percent of those afflicted with this condition are either merchants or scholars. Why? The condition arises from mental labor and physical idleness. Mental labor depletes the spirit, while physical idleness stagnates the *qi*; a depleted spirit and stagnant *qi* lead one to shun labor and seek ease—this is the origin of yin cold and stagnation. To cure this condition, one must reverse one’s habitual ways. If one can reverse these habits, the illness will naturally heal. Once healed, one may then seek the methods of practice—this is the royal road, to be followed by those who proceed in accord.\n\nAs shown above, the work of transformation is not something those of lesser capacity can sustain without giving up halfway. This is why the *Eight Brocades*, *Twelve Brocades*, *Sixteen Brocades*, *Twenty-Four Brocades*, and other such methods have been compassionately taught. For this yin essence forms due to *qi* stagnation; when *qi* stagnates, essence congeals and blood stasis arises. Without martial arts to stir and grind it, there will never be a time when efficacy appears. Practitioners, failing to understand this, abandon the practice—not out of weariness, but because they deem it a trivial skill unworthy of their effort. Alas! Just as one must ascend from the lowly, how much more so with these martial arts, which are employed to cure illness—when have they ever been relied upon for attaining the Dao? Practitioners, take heed.\n\nA careful note: The ancient sages bequeathed seasonal techniques, condensed into the twelve hours. I now explain the twelve hours as a fixed *qi* configuration for practitioners:\n\nThe natural state of *water and moon mutually reflecting* occurs at midnight;\nThe state of *I am unaware of existence* occurs at the hour of the ox;\nThe state of *awareness of qi flowing* occurs at the hour of the tiger;\nThe state of *qi mechanism overflowing* occurs at the hour of the hare;\nThe work of *abiding in non-being while guarding being* occurs at the hour of the dragon;\nThe *qi* configuration of *hidden and manifest, unfathomable* occurs at the hour of the snake;\nThe *qi* configuration of *ten thousand images arrayed* occurs at noon;\nThe state of *true and illusory, impermanent* occurs at the hour of the sheep;\nThe method of *sweeping away thoughts as they arise* occurs at the hour of the monkey;\nThe omen of *the solitary spirit revealed* occurs at the hour of the rooster;\nThe state of *hearing and seeing suddenly extinguished, awareness without trace* appears only at the hour of the dog;\nOne must strictly guard against surprise or doubt, abiding in the method of the hour of the dog. The state of *profound stillness* occurs at the hour of the pig.\n\n(Though this is a fixed *qi* configuration, only that which arises naturally is true. Thus, the key is indicated at midnight. Practitioners, follow this single profound instruction, and you will naturally align with it, never deviating midway. Know that the mechanism of *water and moon mutually reflecting* is rooted in profound stillness. When practitioners reach this state of profound stillness, with not a single thought arising, their *qi* becomes utterly pure, and the water and moon naturally appear—this is the *heavenly one generating water*, the image of *kan*. The single line within *kan* is the root of the moon’s appearance. With this essence present, its function naturally manifests—hence it is said to arise naturally.)",
      "overlap_context": "primordial chaos*. In alchemical texts, it is termed *opening the mysterious pass*. The method involves nothing more than *forgetting forgetting*. Once this pass is opened, the elixir has a place to grow, and the medicine has a repository. What is the true realm revealed? It is boundless and profound. This single principle is the true technique of *establishing life and destiny*—practitioners must treasure it. Alas! Diligence without encountering a true master is futile—practitioners, strive on.",
      "start_char": 3540,
      "end_char": 4783,
      "start_sentence": 137,
      "end_sentence": 191,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.06008505821228,
      "metadata": {
        "source_file": "dao\\藏外\\太虚集录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "其理则如是，然要知此一步起自下极，乃冬象也。 水之现、月之升，是即活子之内现，故曰子正有之。 学者斯时，盖必身无其身也。 及至此身觉有，已是人身之活丑景现，一如天之有地，所谓逮洽台离之象。 自无而有、自虚而实，大道自然之义，故曰我无觉有，是觉而未着也。 然既觉有，则此中动静必自觉，是于其既乃觉气通流趣味。 然仅体觉于无闻无见中，乃三才初现，的是寅正之秋。 及其气机洋溢，乃有透外之势，洵是此身活卯气象。 有闻见将启之义，既至辰正。 不无具有，分别气机，古哲于此，惟置此念于不计，且将见见闻闻有而不有，意惟守夫混穆气象，此中保夫诸有，故曰存无。 核即所以守有之意，是有功法在，故曰辰正之功。 所谓功法，乃存诸有于绝无之中，而诸有得守焉而已。 然其中有隐现两义，古哲于此，法惟听之，不加一毫维持作用，故于巳正，但曰气象，明夫无庸作用之义。 午正亦然，法惟听其自罗自列焉，故但以气局二字该之。 然此一时乃活午阴生之始，仲夏气象。 世运到此，万路齐开，心目易眩。 及其季也，感慨自生，此是人情。 古哲于此，惟以气局视之。 中无一动，听其长消，归诸数运。 其于世事，参勘已透。 故于灵境现前，听其隐隐现现，一如蜃楼海市焉视之，此是未正之气机。 法惟自守其真，然非初学所能。 而又愈现愈奇，有移步换影之幻触动心目，法惟念起即扫，乃合活申功法。 此关破后，内慧光充，乃有一灵独露之兆现于浊滞，而机趣晏安，酉正其然。 学者斯时不住于明而神栖于寂，便造一无见闻而端倪亦隐之境。 此种真境，可遇而不可求，真阳得以养，真阴藉以生，是为象帝之先。 核诸天时，是岁九秋，活时戌正。 无如初学未悟，行功至此，翻以闻见俱泯为觉无端倪，因生惶惑，古哲悯之，标日正法，又日切戒。 能妯戒迸，便得湛如寂如，与天合德，为亥活法，故曰是值亥正，是即老子之游心于物之初。 其妙诀在一如字，如字妙义乃无住二字之生魂、大道之全影，学者能仍从此字进修，则复递现递守而递迸，迸而无穷，自知造化在手、命不在天。 诚而行之，计日可与古仙齐驱并驾。 ]",
      "translated_text": "The principle is thus, yet it is essential to know that this step arises from the lowest extremity—this is the image of winter. The appearance of water and the rising of the moon are precisely the inner manifestation of *living midnight*, hence it is said that *midnight* holds them. At this time, the practitioner must be as though the body has no body. When one becomes aware of this body’s existence, the *living second* of the human form has already appeared, like heaven possessing earth—this is the image of *Tai* and *Li* in harmonious union. From non-being to being, from emptiness to fullness, this is the natural principle of the Great Dao. Thus it is said: \"I am not aware of existence\"—this is awareness without attachment. Yet once awareness arises, movement and stillness within must be self-perceived, and one then senses the flowing and circulating flavor of *qi*. However, if one merely embodies awareness within the state of *no hearing, no seeing*, this is the initial manifestation of the *Three Powers*, truly the autumn of *third-hour*. When the *qi*-mechanism overflows, it assumes an outward-penetrating momentum—this is the *living fourth-hour* image of the body. It bears the meaning of hearing and seeing about to commence, reaching *fifth-hour*. Here, the *qi*-mechanism is not without differentiation, yet the ancients placed this thought beyond calculation, treating all that is seen and heard as *having yet not having*. The intent is solely to guard the *hunmu* (primordial undifferentiated) image, preserving all existents within—hence it is called *preserving non-being*. In essence, this is the method of *guarding being*, and thus it is the practice of *fifth-hour*. The so-called method of practice is to preserve all existents within absolute non-being, thereby securing all existents. Yet within this, there are two meanings—hidden and manifest. The ancients’ method here was simply to let it be, without adding the slightest effort of maintenance. Thus, at *sixth-hour*, it is merely called *qi-image*, clarifying the meaning of *no need for effort*. *Seventh-hour* is likewise: the method is simply to let it arrange itself, hence it is summarized with the two words *qi-configuration*. Yet this moment marks the beginning of *living noon* and the generation of *yin*—the image of mid-summer. When the world’s course reaches this point, myriad paths open simultaneously, and the heart and eyes are easily dazzled. As the season wanes, emotions arise spontaneously—this is human nature. The ancients regarded this only as a *qi-configuration*, remaining utterly unmoved within, allowing growth and decline to follow their own course, attributing it to the workings of fate. Their discernment of worldly affairs had already penetrated deeply. Thus, when numinous realms appear, they let them flicker in and out of view, regarding them as mirages or sea markets—this is the *qi*-mechanism of *eighth-hour*. The method is simply to guard one’s true nature, though this is not within the capacity of beginners. Yet the more it manifests, the more wondrous it becomes, with shifting steps and changing shadows that stir the heart and eyes. The method is to sweep away thoughts the moment they arise—this accords with the *living ninth-hour* practice. Once this barrier is broken, inner wisdom-light fills the space, and a sign of *solitary spirit revealed* emerges from turbidity, while the *qi*-mechanism rests in tranquility—this is the state of *tenth-hour*. At this time, the practitioner does not abide in brightness but lets the spirit nest in stillness, thereby attaining a realm of *no hearing, no seeing*, where even the slightest trace is concealed. This true realm may be encountered but not sought; true *yang* is nourished therein, and true *yin* is thereby generated—this is *prior to the image of the Emperor*. Correlating with celestial timing, this is the ninth month of the year, the *living eleventh-hour*. Yet beginners, failing to comprehend, may mistake the cessation of hearing and seeing for the absence of all traces, thereby falling into confusion. The ancients, pitying them, marked this as *orthodox method* and *urgent warning*. If one can guard against regression, one attains *profound stillness* and aligns with heaven in virtue—this is the *living twelfth-hour* method. Thus it is said to occur at *midnight*, which is Laozi’s *\"wandering the mind at the origin of things.\"* The marvelous secret lies in the word *\"as\"*—the wondrous meaning of *\"as\"* is the living soul of *\"no abiding\"* and the complete reflection of the Great Dao. If practitioners can continue cultivation from this word, they will alternately manifest, alternately guard, and alternately advance, advancing without end. They will naturally know that the workings of creation are in their hands, and fate is not in heaven. Practicing sincerely, they may, in a matter of days, race abreast with the ancient immortals.",
      "overlap_context": "idway. Know that the mechanism of *water and moon mutually reflecting* is rooted in profound stillness. When practitioners reach this state of profound stillness, with not a single thought arising, their *qi* becomes utterly pure, and the water and moon naturally appear—this is the *heavenly one generating water*, the image of *kan*. The single line within *kan* is the root of the moon’s appearance. With this essence present, its function naturally manifests—hence it is said to arise naturally.)",
      "start_char": 4783,
      "end_char": 5602,
      "start_sentence": 192,
      "end_sentence": 223,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.923516750335693,
      "metadata": {
        "source_file": "dao\\藏外\\太虚集录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "上所述，核即前辈缩年、缩月、缩日、缩时、缩刻，按部行去，所现灵境有如此。 然须善会，而功法咸备。 其大旨在无住，而旨脑全凭不动一诀。 [其诀法惟在无住与不动，信然，学者细体前注，自能步步合法。 ] 故凡行至亥正，法惟神注下田，而功须若存若忘。 忽得红日一轮，透自天心目中，初见大如豆许， [谨按：此月乃于下极海底透出，已乘中炁升巅。 斯时学者功到身无其身，故得现有水月。 要知月魄仍藏坎位，光华上射，乾气凝之，现有是象。 其时坎水波澄，月影波涵，故曰交映。 至其放光，乃因肝阳下注、恋月停轮、魂为月孕，此又月吐日辉之由。 而日精未升。 尚潜海底。 此后日升，宜循督透，法惟以意后注乃得。 倘或升循中任，其祸盖莫测也。 ] 切戒念动。",
      "translated_text": "The foregoing describes precisely the methods by which predecessors condensed years, months, days, hours, and moments, proceeding step by step—such are the numinous realms that manifest. Yet one must grasp them rightly, for the entire practice is complete in its principles. Its great aim lies in *no abiding*, while the essence of this aim depends wholly on the *unmoving* secret. [This secret lies solely in *no abiding* and *unmoving*—if true, practitioners who carefully embody the prior annotations will naturally proceed in perfect accord with the method.]\n\nThus, when practice reaches *midnight*, the method directs the spirit to focus on the lower *dantian*, while the work must be held as if present, as if forgotten. Suddenly, a single red sun appears, emerging from the center of the heavens within the eyes—initially seen no larger than a bean. [Note carefully: this moon first breaks through from the depths of the lower sea, then rides the central *qi* to ascend to the crown. At this moment, the practitioner’s achievement dissolves the body into no-body, and thus the water-moon appears. Know that the lunar essence still resides in the *Kan* position, its radiance shining upward, where the *qi* of *Qian* congeals it, producing this vision. At this time, the waves of *Kan*-water are serene, and the moon’s reflection is contained within them—hence it is called *mutual illumination*. As for its emanation of light, this occurs because the yang of the liver descends, clinging to the moon and halting its wheel, while the *hun*-soul is impregnated by the moon—this is the cause of the moon’s emission of solar brilliance. Yet the solar essence has not yet risen, still concealed in the depths of the sea. Thereafter, when the sun ascends, it should follow the *Du* meridian; the method requires only that intention be directed backward to achieve this. If, however, it ascends along the central *Ren* meridian, the calamity will be immeasurable.]\n\nUtterly guard against the stirring of thought.",
      "overlap_context": "us secret lies in the word *\"as\"*—the wondrous meaning of *\"as\"* is the living soul of *\"no abiding\"* and the complete reflection of the Great Dao. If practitioners can continue cultivation from this word, they will alternately manifest, alternately guard, and alternately advance, advancing without end. They will naturally know that the workings of creation are in their hands, and fate is not in heaven. Practicing sincerely, they may, in a matter of days, race abreast with the ancient immortals.",
      "start_char": 5603,
      "end_char": 5920,
      "start_sentence": 224,
      "end_sentence": 241,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.913188934326172,
      "metadata": {
        "source_file": "dao\\藏外\\太虚集录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "已而月隐日彰，法惟息心以俟，得有腹田若灸，乃是日浴海底之效，故得遍体充和。 又觉内炁后攻，旋复炁穿尾闾，腾腾上透，乃无弊焉。 方其海浴未透时，切戒惊提。 否则立有莫测、状若流火，法惟迭用忘诀乃痊。 古哲于此，微移其神导之后透，自必破关上达。 既已抵枕，乃以意引。 盖此玉枕，丹书名为铁壁，在天即名罡际，非此真炁莫能透也。 得此真气，以引透之，乃为通督。 修至督通，一半功矣。 第行此功，惟用引字，切戒用武。 一杂武功，便致有声若雷、若霹雳。 学者即或失戒致有此种，切戒惊怖。 [诀用两手掐藏魂诀以坐，即循大惊，不致神飞之险] 法惟益加定静，守过半晌功夫，随有一滴如泉，从空滴下，体其趣味，觉大清凉，或极甘美，体其滴下，有形亦好，无形更妙不可言。 [要知此一定静，从加意至忘忘，须得半晌乃能，故下接曰“随有”，此明夫甘露须自忘忘中得，其得乃真。 此时功已造至无身界，故曰“自空”云云。 然学者要知“体其”两字，非当时之意义，乃事竣之追思。 法于此时从空，不辨清凉甘美，有形无形概置勿间，其功乃足。 盖当未有滴下。 但觉空无； 及有滴下，自觉从空滴下。 自觉方非莽荡，不觉从空，功邻昏散，非正功法，第加体义，便堕情障，已着意识界，不可不戒，注故及此。 ] 古哲谓此一滴，直落绛宫，（速可知矣。",
      "translated_text": "Thereafter, the moon recedes and the sun emerges in full radiance. The method requires only stilling the heart and awaiting this moment. When the *dantian* feels as though cauterized by moxa, this is the effect of the sun bathing in the depths of the sea—thus the entire body becomes suffused with harmony. One then senses the internal *qi* surging from behind, swiftly piercing the *Weilu* and ascending in a soaring current—this is free of harm.\n\nYet while the sea-bathing has not yet fully penetrated, one must guard against sudden arousal. Otherwise, there will arise an unfathomable peril, its symptoms resembling flowing fire. The remedy lies solely in repeatedly applying the *forgetting* technique until recovery.\n\nThe ancient sages, at this stage, subtly shifted their spirit to guide the breakthrough from behind, naturally shattering the barrier and ascending. Once reaching the *Yuzhen* (Jade Pillow), intention is employed to draw it through. For this *Yuzhen*, alchemical texts name it the \"Iron Wall,\" and in the heavens, it is called the \"Edge of the Big Dipper’s Handle\"—without this true *qi*, none can penetrate it. Only by using this true *qi* to draw and guide it through does one achieve the *Du* meridian’s opening.\n\nWhen the *Du* is opened, half the work is accomplished. Yet in practicing this method, one must use only the word *draw*—never resort to force. Any admixture of force will result in sounds like thunder or claps of lightning. Should the practitioner, through loss of discipline, encounter such phenomena, they must not be alarmed. [The technique involves clasping the *canghun* mudra with both hands while seated; even if startled, this prevents the peril of spirit-flight.] The method requires only deepening stillness and composure, maintaining it for the duration of half an incense stick’s burning. Then, a drop like a spring will descend from the void. In savoring its essence, one feels profound coolness or extreme sweetness. Whether this descending drop has form is good, but its formlessness is even more wondrous—beyond words.\n\n[It must be understood that this state of stillness, from heightened attention to utter forgetfulness, requires half an incense stick’s time to attain, hence the subsequent phrase \"then there is.\" This clarifies that the *sweet dew* is obtained only through forgetfulness, and such attainment is genuine. At this stage, the work has ascended to the realm of no-body, hence the phrase \"from the void,\" and so on. Yet the practitioner should note that the words \"in savoring\" do not refer to meaning in the moment but to retrospective reflection after the event. The method at this point—whether from the void, discerning coolness or sweetness, form or formlessness—must be entirely set aside and not dwelled upon, for only then is the work complete. For before the drop descends, one feels only emptiness; when it descends, one naturally senses it falling from the void. Self-awareness at this point is not recklessness, but unawareness of its descent from the void borders on scatteredness—this is not the proper method. Merely adding interpretive meaning risks falling into emotional obstruction, entering the realm of consciousness, which must be guarded against. Thus this annotation is provided.]\n\nThe ancient sages called this drop the one that falls directly into the *Jianggong*—this can be swiftly understood.",
      "overlap_context": "alting its wheel, while the *hun*-soul is impregnated by the moon—this is the cause of the moon’s emission of solar brilliance. Yet the solar essence has not yet risen, still concealed in the depths of the sea. Thereafter, when the sun ascends, it should follow the *Du* meridian; the method requires only that intention be directed backward to achieve this. If, however, it ascends along the central *Ren* meridian, the calamity will be immeasurable.]\n\nUtterly guard against the stirring of thought.",
      "start_char": 5920,
      "end_char": 6457,
      "start_sentence": 242,
      "end_sentence": 265,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.749086618423462,
      "metadata": {
        "source_file": "dao\\藏外\\太虚集录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "）是名真阴。 其降景象，缓亦好，捷亦好，（味两\"亦\"字，乃教后学置此种于勿问，是古哲教杜意识之功诀。 ）惟能滴下无阻，点点到心，（于此可悟究以捷者为真。 ）更为难得。 又云，有形而速名玉液，无形而速名金液。 [此说不传之秘，余昔得之于太虚翁，今年已老，虑终失传，述于编扎详授有缘。 ] 太虚翁曰：\"有形而速，无形而缓，总属妙有，法当体认得真者。 \"盖以此点，到心极凉，过心极热，热若汤泼，斯乃真液。 若点无上说，尚属后天，不过得润气机而已，不可视为仙品。 然于当时，切戒拟议念起，法惟循次行去，亦为有益功验。 诚以古哲功法，有参天时之四时，有参岁日之二六，其法至活而至玄，如前所议之四时，与夫十二时之灵境，乃缩得片刻之间，其情其景确可逐步绘示。 然须学者自问，可果能步步如戒，中无或着、或有中着否耳？ 若行无或着，自无中变，倘有或着，便有中变，所现情景便自大异。 夫岂古哲示有未真者哉？ 太虚翁有言曰：\"学者于中，着一察念、起一拟议、落一意识，来情来景变更莫测，便与古议大殊。 急宜停功勿事，少顷，念静气平。 仍行本步不如退行本步前程，总以得合入手初步灵境，体无二焉，方许顺循下行。 否则宁将前功尽舍、另起入手为妙。 古哲所谓行贵得中，而天时须合者，乃缩一年一月一日一时之灵境，汇而按次，统现于片刻之中，而具有四时十二月，而月月有朔望三十日、日日有十二时，时时有自然光景。 其法至玄至真，然惟能息心体认，循行不惑，方能步步合古说法。 噫！ 要知既缩岁景于一刻者，法惟活其气机、寂其心意以行，自合古法。 能行炷香，已夺百年造化，古哲故名此为功夺造化，是难而易者，学者勉之。 \" 原夫子午，子有活子，午有活午。",
      "translated_text": "This is called the *True Yin*. Whether its descent appears gradual or swift, both are acceptable—(the two \"also\"s here instruct later students to set aside such distinctions, for this is the ancient sages' method of preventing the intrusion of consciousness). Only when the drop falls unimpeded, point by point reaching the heart, is it most rare and precious. (Here one may realize that swiftness is the true sign.)\n\nIt is also said: when manifest in form and swift, it is called *Jade Liquid*; when formless and swift, it is called *Golden Liquid*. [This is an esoteric teaching not passed down; I received it in my youth from Master Taixu. Now in my old age, fearing it may be lost forever, I record it here in detail for those with karmic affinity.]\n\nMaster Taixu said: \"Whether manifest and swift, or formless and gradual, all belong to the wondrous existence—one must recognize the true nature of the method.\" For when this drop reaches the heart, it is intensely cool; when it passes the heart, it is scorchingly hot, as if scalded by boiling water—only then is it the *True Liquid*. If the drop lacks these qualities, it remains within the postnatal realm, merely moistening the qi mechanism and not to be regarded as the elixir of immortality.\n\nYet in the moment of practice, one must strictly guard against the arising of conceptual thought. The method lies solely in proceeding step by step, which will yield beneficial effects. The ancient sages' practice encompassed aligning with the four seasons of heaven and the twelve divisions of the year and day. Their method was supremely fluid and profound, for what was discussed earlier—the four seasons and the twelve hours' spiritual realm—is condensed into a single moment. Its circumstances and scenery can indeed be depicted step by step. However, the student must ask: can one truly proceed without attachment, without straying into partiality or fixation?\n\nIf one proceeds without attachment, there will be no deviation; if attachment arises, deviation follows, and the manifested circumstances and scenery will differ greatly. How could the ancient sages have been anything but precise in their instructions? Master Taixu said: \"If a student, in the midst of practice, clings to a single investigative thought, entertains a single conjecture, or falls into a single moment of consciousness, the incoming circumstances and scenery will shift unpredictably, diverging greatly from the ancient teachings. One should immediately cease practice and rest, waiting until thoughts settle and qi evens. Then resume the current step—or even retreat to an earlier stage—until one re-enters the initial spiritual realm of the first step, experiencing it without duality, before proceeding further. Otherwise, it is better to abandon all previous efforts and begin anew. The ancients' principle that 'practice must attain the mean, and celestial timing must align' refers to condensing the spiritual realm of a year, a month, a day, and an hour, gathering and arranging them in sequence, all manifesting within a single moment—encompassing the four seasons, twelve months, each month with its waxing and waning, thirty days, each day with its twelve hours, and each hour with its natural scenery. The method is supremely profound and true, yet only by stilling the heart, embodying the practice without doubt, and proceeding step by step can one align with the ancient teachings.\n\nAlas! Know that in condensing a year’s scenery into a single moment, the method lies in activating the qi mechanism while quieting the heart and intent—thus naturally conforming to the ancient way. To practice for the duration of an incense stick’s burning is to seize a hundred years of transformation. The ancients therefore called this *the practice of seizing transformation*—difficult yet easy. Students, take heed!\"\n\nOriginally, in the *zi* and *wu* hours, there is the *living zi* and the *living wu*.",
      "overlap_context": "ends, one naturally senses it falling from the void. Self-awareness at this point is not recklessness, but unawareness of its descent from the void borders on scatteredness—this is not the proper method. Merely adding interpretive meaning risks falling into emotional obstruction, entering the realm of consciousness, which must be guarded against. Thus this annotation is provided.]\n\nThe ancient sages called this drop the one that falls directly into the *Jianggong*—this can be swiftly understood.",
      "start_char": 6457,
      "end_char": 7151,
      "start_sentence": 266,
      "end_sentence": 291,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.8147189617157,
      "metadata": {
        "source_file": "dao\\藏外\\太虚集录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "岁之二至，乃天地之活子午； 运年月日时，乃天地之定子午。 即人而论，天地之二至，运年月日之子午，皆属定子午。 惟二时之子午，乃人身之活子午也。 然犹属丹书不得已示人之活子午，所谓一阳初动之活子午是也。 究其真正之活子午，犹有辨焉。 其真正者，须于无形无象中求之。 其说惟何？ 乃于功到寂无所寂，忽觉内机有若得得焉，此是活子之初； 继觉勃然机现，乃是活子正象； 油然内透，将达男根，已是活子内炁充盈。 法用天目凝之，其炁自循督脉逆上昆仑； 微以意留，觉此髓海波宁，油然下注，华池生风，汇临绛阙。 斯时天君泰定，万国咸安，是名取坎填离。 若至外肾已举，更值念生，斯时外肾必大举，古哲于此急以意引回，乃循海底逆透上巅，存于乾鼎，勿忘勿助； 气得髓涵，自化玉露，油然注池，下降阙盆； 露得盆存，自化赤液，分注心后，得遇坎阳应升而上者，另有一种春深趣味得尝。 但可领会，切戒情牵，倘一心动，急引乾宫真炁降压，立自新清； 或以意包现象，敛下下田，大煅一番，引其后透达巅，存于泥丸，大行淘汰——所谓淘汰者，置此见见闻闻于意外耳！ 已而华池液涌，咽咽咽下，觉此绛阙金碧辉煌，旋更宽广无涯，现有海市蜃楼气局，而有乍远乍近情形。 学者于此，始悉性功为保命之鄞墉也。 法惟置而勿着，否必现有淫席，荡吾心志。 法惟以意一包一敛，置之勿审，急将目光耳神做入无见无闻之处。 如是一存，即造身世咸亡之境。 已复觉有氤氲气象，现于湛如寂如之中，法亦置而勿间，则又造夫人法双忘。 到此地位，忽觉有身，乃以意审窍中窍而止。 丹书名曰采药入炉，又曰活子行功，其效乃尔。 第味丹书，其说吞吐，广设譬喻，未迳直陈，似属运心未溥。 岂知活午用验，具于活子言下，咸备述有？ 此盖古哲令由不令知耳！ 然足误事，太虚悯之，故此一节翻复示以觉诀，而功采、功取、功炼、功凝，井然内具。 若照丹书所示，外肾无念而举，洵是活子阳生，然须加行引提到脑，脑中一存，引下中黄方始事采，而用加无念一诀，再示封炉，于中手法，较诸师示，作用详减不符，而说法仅完活子功诀——非也。 丹书所言，活子后事，学者自失体认，而自泥一见，是以愈行愈惑，卒有望洋之叹。 然亦古哲自道所造； 初不料后学识窒若斯，而病染穿凿，太虚悯之，遂有今日之示。 盖其所谓活午者，核即古哲活子后事，并非别开生面也。 但古哲之行动，起自活子，而太虚说法，重在活午，其创中十二时诀，谓到现有黄金世界，此正活午上上真境，功宜事采。 究其采诀，为用《清静经》三观功法，其最上者，从事无无，而又不住于空寂，及其归缩，仍寄于无，如是循环，炼至聚则成形、散则成炁而止。 其中功法，有可揭示者，第宜会而体之、密而持之，一若按图而索骏、实复得鱼而忘筌。 其则维何？ 学者于得见黄金世界，急起身后无上灵炁，透至极上极远、光不照处落下，统将灵境一罩，敛成黍米，或由宝瓶吸入，或以意收入腹。 或乘罩劲，由我身前极远处兜下极深，透上极高，下瞩灵境，有我色身坐立焰中，急存忘热一诀，顿觉色身熔化，惟见光明一急以意收意歙，转见一珠如豆，悬于太虚？",
      "translated_text": "At the year’s two solstices lie the living *zi* and *wu* of Heaven and Earth; the cyclical progression of years, months, days, and hours constitutes their fixed *zi* and *wu*. Considering the human realm, the two solstices of Heaven and Earth, along with the *zi* and *wu* of the cyclical progression of years, months, days, and hours, all belong to the fixed *zi* and *wu*. Only the *zi* and *wu* of these two hours are the living *zi* and *wu* within the human body. Yet even these are but the living *zi* and *wu* reluctantly revealed in alchemical texts—the so-called living *zi* and *wu* of the first stirring of yang. To discern their true essence, one must seek deeper still. The genuine living *zi* and *wu* must be pursued where form and image dissolve.\n\nWhat then is the method? When practice reaches the point of stillness beyond stillness, one suddenly senses an inner mechanism stirring faintly—this marks the inception of the living *zi*. As the stirring grows vigorous, the living *zi* manifests in full; when qi wells up within and surges toward the male root, the living *zi*’s inner qi reaches fullness. The method employs the celestial eye to concentrate, guiding the qi to ascend the Governor Vessel in reverse to Kunlun. With a subtle intent to retain it, one feels the marrow sea’s waves settle, and the qi flows downward, generating a breeze in the Flower Pool that gathers at the Crimson Palace. At this moment, the Celestial Lord is at peace, and all realms are tranquil—this is called \"drawing from Kan to fill Li.\"\n\nShould the external kidneys rise and thoughts arise simultaneously, the external kidneys will surge further. The ancient sages swiftly guide the qi back with intent, reversing its course from the sea bottom to the crown, storing it in the Qian cauldron—neither forgetting nor forcing. As qi is nurtured by marrow, it transforms into jade dew, flowing naturally into the pool and descending to the Quepen. When the dew is retained in the basin, it transmutes into crimson fluid, streaming behind the heart. There, it meets the ascending yang of Kan, yielding a profound, spring-like savor. Yet one must merely comprehend this, strictly guarding against emotional entanglement. Should the heart stir, swiftly direct the true qi of the Qian palace downward to suppress it, instantly restoring clarity. Alternatively, envelop the phenomenon with intent and press it into the lower field, refining it thoroughly before guiding it to ascend the crown and store it in the Niwan, engaging in a grand purification—this \"purification\" means placing all perceptions and sensations beyond the reach of intent.\n\nThereafter, as the Flower Pool’s fluid surges, swallow it repeatedly, sensing the Crimson Palace gleam with golden splendor, expanding boundlessly. A mirage-like vision appears, shifting between near and far. Here, the practitioner first recognizes that the work of nature is the fortress preserving life. The method lies in setting it aside without attachment; otherwise, lascivious scenes may arise, unsettling the heart and will. Instead, envelop and gather it with intent, then dismiss it without scrutiny, swiftly directing the gaze and hearing into a state of no-seeing and no-hearing. In this act of preservation, one enters a realm where the self and world dissolve.\n\nOnce more, one perceives a misty, vaporous atmosphere emerging within profound stillness. Again, set it aside without interference, and one attains the state where both self and dharma are forgotten. At this stage, should a sense of the body arise, direct intent to examine the aperture within the aperture and halt. Alchemical texts call this \"gathering the medicine into the furnace\" or \"practicing the living *zi* work\"—such is its effect.\n\nYet alchemical texts often speak in metaphors, employing broad analogies without direct exposition, as if their intent were not fully conveyed. How could the verification of the living *wu* not be encompassed within the discourse on the living *zi*? This is because the ancient sages taught by guiding rather than explaining. Nevertheless, such ambiguity risks misdirection. Out of compassion, Tai Xu here reiterates the awakening secrets, wherein the work of gathering, extracting, refining, and congealing is inherently complete.\n\nIf one follows the alchemical texts, the external kidneys rise without thought—this is indeed the living *zi*’s yang arising. Yet one must further guide and draw it to the brain, retaining it there before directing it to the Central Yellow to commence gathering. Employing the \"no-thought\" technique once more, seal the furnace. Compared to other teachings, this method simplifies the process, yet the explanation merely completes the living *zi*’s work—it is incomplete. The alchemical texts’ account of what follows the living *zi* is left for practitioners to discern, but they often cling to a single interpretation, growing increasingly confused and ultimately sighing in despair. Yet this too reflects the ancient sages’ own journey; they never anticipated later students’ lack of insight, nor the pitfalls of over-interpretation. Moved by compassion, Tai Xu now offers this revelation.\n\nWhat is called the living *wu* is, in essence, the continuation of the ancient sages’ work after the living *zi*—it is not a separate path. The ancient sages’ practice began with the living *zi*, whereas Tai Xu’s teaching emphasizes the living *wu*, introducing the \"Twelve Hours of the Central Work.\" When the golden world manifests, this is the supreme realm of the living *wu*, where the work of gathering is appropriate. The gathering method employs the *Qingjing Jing*’s threefold contemplation. The highest practice involves engaging with the formless, yet without abiding in emptiness. Upon returning, one still rests in the formless, cycling thus until qi gathers into form and disperses into qi.\n\nSome aspects of this method may be disclosed, yet one must grasp and embody it inwardly, holding it in secrecy—like seeking a steed with a diagram, or catching a fish and forgetting the trap. What then is the principle? Upon witnessing the golden world, swiftly rise with the supreme spiritual qi from behind, extending to the utmost height and distance, where light does not reach, and descend. Envelop the spiritual realm entirely, condensing it into a millet grain, either drawing it in through the precious vase or gathering it into the abdomen with intent. Alternatively, harnessing the enveloping force, sweep from the farthest point before oneself to the deepest below, ascending to the highest above, gazing down upon the spiritual realm where one’s colored body sits or stands within flames. Swiftly apply the \"forgetting heat\" technique, and the colored body melts away, revealing only radiance. With intent, gather and contract it, and a pea-sized pearl appears, suspended in the void.",
      "overlap_context": "ow that in condensing a year’s scenery into a single moment, the method lies in activating the qi mechanism while quieting the heart and intent—thus naturally conforming to the ancient way. To practice for the duration of an incense stick’s burning is to seize a hundred years of transformation. The ancients therefore called this *the practice of seizing transformation*—difficult yet easy. Students, take heed!\"\n\nOriginally, in the *zi* and *wu* hours, there is the *living zi* and the *living wu*.",
      "start_char": 7151,
      "end_char": 8372,
      "start_sentence": 292,
      "end_sentence": 333,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.74718356132507,
      "metadata": {
        "source_file": "dao\\藏外\\太虚集录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "急以意收，安于虚寂玄窍之中，仍得湛如寂如玄境而止。 或于灵境现时，微用真意摄此灵境、纳向身后，默用提诀，由身后提，加用两眼，上视泥丸，觉我泥丸真炁氤氲； 仍以意引下注，觉有炁溢一境，恍见池水盈盈，此则已到华池，便有玉液金液沛注、咽下，由重楼抵绛宫，自得无上清凉； 继复下注中黄，另有一番趣味，而遍体充和； 此时觉有二炁左右盘旋。 又有一炁上升、一炁下降，一旦针锋准对，乃有上就下迎，又复此追彼退、此退彼追，更有相纽莫放之情。 斯时切戒贪着、戒动凡思，略染夫情，此二炁战吞情肆，三家纯化后天，体必发颤，呼吸必粗，外肾火热，便有万难自新之厄。 此时救法，惟凭两目上视，引降真阴，以压情焰。 然此至宝已化后天，法惟大集真人，下极猛烹而猛煅之，令其重透尾闾、达泥丸，重下重楼、下绛阙，得大清新一番，否则此宝不得复原。 故古哲于此一节不敢泄漏，盖以学者极少童真，其身情窦既已开破，功行到此，如何不动情思？ 且此一径乃是熟路，欲不夺关而出，难乎其难。 惟彼童真，此宝未启、此事不知，行功到此，不过觉大春生，而神机上透，自不下达，万无此变。 古哲性功淳澈，功行至此，急引真阴以压浊火，赖此绛阙清凉，化炁下凝，藏于炁穴，以意封之，湛寂片刻而止。 大凡功从活午入手者，乾宫为至要之功，淘此炁机，下注华池、灌夫绛阙，活子到来，但凭神审，子午会交，惟凭性靖，功以终造清新为合度。 若从活子入手者，坤腹为至要之功，炼此液气，上达泥丸、下灌华池、清乎绛阙，活午到来，切戒情漏，午子会交，亦凭性靖，以终造充和为合度。 若夫闭目内观，自有种种灵境得现，法贵无着； 逐步进功，而移步换影、境不胜述，法惟毋住焉而已。 及至炁到坤位，总以得暖为功，俟炁后透，达巅绛阙，总以得凉为功，大旨如此，惟能内观不二而一者，全以神体而神会之，此天仙功法，能者从之。 （二乃二目，一则天目也。 ） 太虚翁曰：我辈修持，固贵一合天时，而前详言活午者，以此活午不明，则真阴坐失，纵得从事活子，苟无真阴以涵，功足化神，其飞可必。 凡夫丹书所言清凉金玉等等，寄在活子功后，故标曰\"真阴\"二字，此乃言炼阳得阴，而中藏却炼阴得阳一诀，非遗而不令行也，惟已令行而不与言耳！ 至夫十二时诀，古哲却秘之，余今直泄者，诚以真道久晦、学者每仅循迹而行，昧此程途定景，行无把握，如盲无明仗，不无中惑而退弃，又知汝缘广厚，更能舍己，此诀不授，虚此法会而真道失传）倘得有大根大　器者遇汝，得闻十二时诀，进叩活岁活月活日活时，循而精行一过，后因事故间断，日后加功，亦知下手功步，以及下手景象，行无惑疑，则自前行无阻，进事前闻活岁活月活日活时，了了心目，岂非快事乎！ 第斯活义，固不得于有为，而又每失于无为，惟能会夫“有用用中无用、无为功里施功”两句意义者，万无或失，而所得必真。 汝曷不证诸丹经：“外肾无念而举为阳生”，又曰：“是乃活子。 ”于此可悟“外肾无念而大举，已值身中活正午”，此而方事夫取，则所得已非真阳，窃欲藉以养生则可，欲藉成道不其难乎？",
      "translated_text": "Swiftly gather with intent, settling it within the serene and mysterious aperture of emptiness and quiescence, whereupon one attains a state of profound clarity, stillness, and mystery—here, let it rest.\n\nAlternatively, when the spiritual realm manifests, gently employ true intent to draw this realm toward the rear of the body. Silently apply the \"lifting\" technique, raising it from behind, and with both eyes, gaze upward to the *niwan* (mud-pellet palace). Sense the true qi of one’s *niwan* suffusing and swirling. Then, with intent, guide it downward, feeling the qi overflowing a realm—vaguely beholding a pool of brimming water. This marks arrival at the *Huachi* (Flowery Pond), where jade-like and golden fluids abundantly flow. Swallow them, descending through the *Chonglou* (Weighty Tower) to the *Jianggong* (Crimson Palace), where supreme coolness is naturally attained. Proceeding further downward to the *Zhonghuang* (Central Yellow), another realm of delight unfolds, suffusing the entire body with harmony.\n\nAt this moment, one senses two qi spiraling left and right. Another qi ascends, while another descends. Once their tips align precisely, they rise to meet and descend to welcome, now chasing, now retreating, now intertwining without release. At this juncture, strictly guard against attachment and mundane thoughts. Should even a trace of emotion arise, these two qi will wage a fierce battle of engulfment, and the three families, once refined beyond the posterior heaven, will cause the body to tremble, breath to roughen, and the external kidneys to burn with fire—ushering in an ordeal nearly impossible to renew.\n\nThe remedy lies solely in raising both eyes upward to draw down true yin, suppressing the flames of emotion. Yet this supreme treasure has already transformed into the posterior heaven. The method requires summoning the true person in utmost urgency, fiercely refining and forging it anew, compelling it to once more penetrate the *Weilü* (Tail Gate), ascend to the *Niwan*, descend again through the *Chonglou* to the *Jiangque* (Crimson Palace), thereby attaining a grand renewal. Otherwise, this treasure cannot be restored. Thus, the ancients dared not disclose this stage, for few practitioners retain the purity of youth. Once the passions of the body are breached, how can one avoid stirring emotional thoughts when the work reaches this point? Moreover, this path is well-trodden—escaping its grasp without seizing the pass is exceedingly difficult.\n\nOnly those of unblemished youth, whose treasure remains unopened and who know nothing of this matter, when practicing to this stage, will merely sense the great spring of life, their spiritual mechanism ascending without descending—utterly free from such transformations. The ancients, with their pure and thorough cultivation of inherent nature, upon reaching this stage, swiftly drew true yin to suppress the turbid fire, relying on the coolness of the *Jianggong* to transform the qi, condensing it downward and storing it in the *qi* cavity. With intent, they sealed it, abiding in profound stillness for a moment before ceasing.\n\nGenerally, for those whose practice begins with the *huowu* (living noon), the *Qian* (Heavenly) palace is the most critical work. Refine this qi mechanism, directing it downward to the *Huachi*, irrigating the *Jianggong*. When the *huozi* (living midnight) arrives, rely solely on spiritual discernment. The union of *zi* and *wu* depends on the tranquility of inherent nature, with the work culminating in renewal as the proper measure.\n\nFor those whose practice begins with the *huozi* (living midnight), the *Kun* (Earthly) abdomen is the most critical work. Refine this fluid-qi, ascending it to the *Niwan*, descending it to the *Huachi*, and purifying the *Jianggong*. When the *huowu* (living noon) arrives, strictly guard against leakage of emotion. The union of *wu* and *zi* also depends on the tranquility of inherent nature, culminating in harmony as the proper measure.\n\nWhen closing the eyes for inner observation, myriad spiritual realms may manifest—here, the method values non-attachment. As one advances step by step, the scenery shifts with each movement, and the realms are beyond enumeration. The method lies solely in non-abiding.\n\nUpon the qi reaching the *Kun* position, warmth is the sign of achievement. When the qi subsequently penetrates to the crown and *Jianggong*, coolness is the sign of achievement. Such is the general principle. Only those who merge inner observation into oneness, embodying the spirit in its entirety, practice the method of celestial immortals—let the capable follow it. (The \"two\" refer to the two eyes; the \"one\" is the celestial eye.)\n\nMaster Taixu said: In our cultivation, it is indeed vital to harmonize with celestial timing. Yet the preceding discussion of *huowu* is because, without clarity on *huowu*, true yin is lost in vain. Even if one engages in *huozi*, without true yin to contain it, the work may refine the spirit, but its ascent cannot be assured. The elixir texts speak of coolness, gold, and jade, alluding to the work following *huozi*, hence the term \"true yin.\" This refers to refining yang to obtain yin, yet within it lies the secret of refining yin to obtain yang—a method not omitted but simply not spoken aloud.\n\nAs for the twelve-hour secrets, the ancients guarded them closely. I now reveal them openly, for the true Dao has long been obscured, and practitioners often merely follow traces without understanding the landmarks of the journey. Proceeding without guidance is like a blind man without a staff—prone to confusion and retreat. Moreover, knowing your karmic affinity is profound and your capacity for selflessness great, if I withhold this method, this gathering would be in vain, and the true Dao would be lost.\n\nShould one of great root and capacity encounter you and learn the twelve-hour secrets, inquiring into the *huosui* (living year), *huoyue* (living month), *huori* (living day), and *huoshi* (living hour), and practice them with precision, even if later interrupted by affairs, upon resuming the work, they will know the steps and the scenery to expect, proceeding without doubt or hesitation. Thus, they will advance unimpeded. To have previously heard of the *huosui*, *huoyue*, *huori*, and *huoshi* and now see them clearly—is this not a joyous matter?\n\nThis living principle cannot be grasped through effortful action, yet it is often lost in effortless non-action. Only those who comprehend the meaning of \"employing the effortless within effort, practicing the effortful within non-action\" will never err, and their attainment will surely be genuine.\n\nWhy not verify this with the elixir classics? \"When the external kidneys rise without thought, it is yang arising,\" and it is also called \"living midnight.\" From this, one may realize: \"When the external kidneys rise greatly without thought, it coincides with the living noon within the body.\" Only then should one proceed with gathering—otherwise, what is obtained is not true yang. Using it for nourishing life may suffice, but relying on it to attain the Dao—is this not difficult?",
      "overlap_context": "h the precious vase or gathering it into the abdomen with intent. Alternatively, harnessing the enveloping force, sweep from the farthest point before oneself to the deepest below, ascending to the highest above, gazing down upon the spiritual realm where one’s colored body sits or stands within flames. Swiftly apply the \"forgetting heat\" technique, and the colored body melts away, revealing only radiance. With intent, gather and contract it, and a pea-sized pearl appears, suspended in the void.",
      "start_char": 8372,
      "end_char": 9587,
      "start_sentence": 334,
      "end_sentence": 359,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.354801416397095,
      "metadata": {
        "source_file": "dao\\藏外\\太虚集录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "此因学者昧夫内机初动初现、继动继现情景，阳复之初不加培养，俟到正午而采之，故究其所以致误，乃昧夫古哲缩字诀，而仍泥夫定子，故误而不悟，纵能按说加功，已致中误也。 其胆怯而复泥见者，竟且置而勿取，以为过时之阳不可采，岂知尚是望正之月，置而勿采，是又误而再误矣。 吁，要知津津泄夫活午者，诚以活午，乃修道之大关键，若不了悉其情，则十遇而十误。 我按前辈精修，每得于活子，计其所失，莫不失于活午者，何哉？ 性功未足，性为情移。 （按非仅于灵境现时失也，学者恒失于杂念骤起。 盖坐至杂念云起，即是身中之活午到验，弃而勿坐，与坐而勿制、制而勿定，皆为失守。 ） 方到正午之际，万路齐开，无奇不现、无巧不彰，命之有者，咸呈勿隐。 大凡命功足者，所现必愈精妙，（古哲产自知之明者，行功至午，半垂其帘，有目若无目，一凭神会以调气机，归以清和，炁得藏处而止。 ）非仅得声得色：上而天宫琼楼霞馆，中凡玉女金童、琪花瑶草，莫可数述； 即现中下，亦必名山胜地，或献女乐，或供仙馔； 最下灵境，亦自超尘，人物之美、铺陈之精，大足令人顾惑。 偶一情系，便滞勿超，迟其升证，如恋兜率，次则神滞泥丸，脱胎无望； 更或舍为魔踞，而神遭啖，是皆昧却活午功诀所致也。 太虚又曰：功到真幻无常，虽已未正，苟能督率气志，而加功凝定，半晌之间，运返正午，现有黄金世界，照耀心目，是即李少君日昃再中之功，药物最足，乃以意收，自化真炁； 仍以意凝，收入祖窍，乃谓得药，南宗列宗此大成者。 淮南王、魏伯阳，葛、许二真，加行包提等诀，拔宅飞升。 我师泥丸翁，行而勿用，吾亦身试，得有六天震动之验。 师止：“勿终习，汝宜宝秘，待时授之人。 ”若夫功见一坍墙败屋，种种衰象，乃是学者阳衰阴损之验，法惟念念祟真、行行合度，加以存守命门，兼事虚心，致乎实腹，切戒忧恶念生，此亦古哲功从活午入手之口诀。 翁又曰：我辈用功，须法古圣仙佛，必于动处炼性、静处炼命； 毋若世之学者，但于趺坐时，方加功法。 若辈其然，故十人十不就； 古哲不然，故百炼百成。 我愿学者，先从身等虚空入手，以天地虚空作法身，以此色身作天心之神室，以此肉心作天心之宰，一无好恶、取舍、趋避等等识念，一无所系，绝无游思； 惟存一空空洞洞、无明无暗，所谓浩浩荡荡、不偏不倚； 端直其体、空洞其心、真实其念，方不负此良会。 而功至活子，不失培养，功至活午，收包得诀焉。 呜呼！ 此身不向今生度，更向何生度此身？ 古哲有言曰：“前关闭，降心炁，功从夏秋功乃济。 ”又曰：“后关通，一半功，缩艮开乾是正功。 ” 要知气不后升，皆因泥精塞络及窍之故，法惟神注坤腹，炁归命门。 火旺则炁暖，泥精遇暖则融如水，络窍不为滞塞，厥气自能后透。 原夫气行循络，络塞则气滞。 要知塞络之物，即昔气御以行之精。 然则气之不升，精中淤故； 精之中淤，气不暖故； 气之不暖，命门衰故； 命门火衰，神失守故。 盖精得行以气，气之得暖以神。 神旺则气暖，神衰则气凉，气凉则精凝不化，中变成痰，充塞经络，而孔窍咸塞。",
      "translated_text": "Here the learner remains ignorant of the initial stirrings and first appearances of the inner mechanism, failing to nurture yang at its earliest resurgence. Waiting until the living noon to gather it, they ultimately err in their approach—unaware of the ancient sages’ \"contraction\" formula, still clinging to fixed midnight timing. Thus they err without realizing, and even if they apply effort according to instruction, they have already fallen into mid-course error.\n\nThose timid and rigid in their views may even abandon the effort entirely, believing the yang of an overripe hour cannot be gathered. Little do they know this is still the waxing moon of true noon—discarding it is but another error compounded upon error.\n\nAlas! To heedlessly squander the living noon is to miss the great pivot of Dao cultivation. Without thorough understanding of its nature, one will err ten times in ten encounters. Reviewing the refined practices of past masters, I find that while they often succeeded at the living midnight, their failures invariably occurred at the living noon. Why? Because their nature-work was insufficient, and nature was swayed by emotion.\n\n*(Note: The error is not merely in losing control when numinous visions appear. Learners commonly falter when stray thoughts suddenly arise. For when thoughts surge like clouds during meditation, this is precisely the verification that the living noon has arrived within the body. To abandon the sitting, or to sit without restraint, or to restrain without settling—all are failures of preservation.)*\n\nAt the moment of true noon, myriad paths open simultaneously—nothing wondrous fails to appear, no subtlety remains hidden. All that belongs to the domain of destiny manifests without concealment. Generally, those with sufficient life-cultivation will witness ever more exquisite marvels. *(The ancient sages, endowed with self-knowing clarity, would half-lower their inner curtains at noon during practice. Though they had eyes, they acted as if sightless, relying solely on spiritual resonance to harmonize the qi mechanism, returning it to a state of pure harmony until the qi found its hidden abode and came to rest.)* Their experiences were not merely sounds or colors: above, celestial palaces of jade towers and rosy pavilions; in the middle realm, jade maidens and golden youths, rare flowers and sacred herbs—countless wonders. Even in the lower visions, one would encounter famous mountains and scenic lands, or be presented with celestial maidens and immortal feasts. Even the most modest numinous realms transcended the mundane, with such beauty in figures and such refinement in furnishings that one could easily be captivated.\n\nShould emotion cling even slightly, one becomes mired and unable to transcend, delaying ascent and verification—like lingering in Tuṣita Heaven. Next, the spirit stagnates in the Mud Pill Palace, and the hope of rebirth vanishes. Worse still, if one abandons the practice to demonic occupation, the spirit may be devoured—all due to ignorance of the living noon’s functional secrets.\n\nMaster Taixu further said: When practice reaches the stage where true and illusory are indistinguishable, even if the hour is not yet noon, one may, by rousing the qi and will and applying concentrated stabilization, restore the living noon within half an incense’s time. A golden world then appears, illuminating the mind’s eye—this is the technique of Li Shaojun, who achieved a second noon at the hour of *rize*. The medicinal substance is most abundant then; gathered with intention, it transforms into true qi. Further condensed with intention and drawn into the ancestral aperture, this is called \"obtaining the medicine\"—the great accomplishment of the Southern Lineage’s patriarchs. The Prince of Huainan, Wei Boyang, and the two Perfected Ones Ge and Xu, through additional practices like *baoti* and other formulas, ascended bodily into immortality.\n\nMy teacher, Master Mud Pill, practiced without attachment, and I too have personally verified the six celestial tremors. The Master cautioned: \"Do not practice this to completion. You should treasure and conceal it, awaiting the right person to transmit it to.\"\n\nIf, however, one’s practice reveals collapsing walls and ruined houses—various signs of decay—this indicates the learner’s yang is waning and yin is damaged. The method then is to venerate the true in every thought, align every action with proper measure, focus on preserving the Gate of Life, and combine emptiness of mind with fullness of the abdomen. Above all, guard against the arising of anxious or evil thoughts—this too is an oral formula from the ancient sages for entering practice through the living noon.\n\nThe Master further said: In our cultivation, we must follow the ancient sages and buddhas—refining nature in activity and life in stillness. Do not be like worldly learners who apply effort only during cross-legged sitting. Such practitioners invariably fail ten out of ten times, whereas the ancients succeeded a hundred times in a hundred attempts. I urge learners to begin by equating the body with empty space, using the vastness of heaven and earth as the Dharmakāya, this physical form as the divine chamber of the celestial heart, and this fleshly heart as the sovereign of the celestial heart. Let there be no preferences, no grasping or rejecting, no seeking or avoiding—no entanglements whatsoever, no wandering thoughts. Only maintain a state of utter emptiness, neither bright nor dark, what is called \"vast and boundless, neither partial nor biased.\" Upright in body, empty in mind, sincere in thought—only then will you not waste this precious opportunity. When practice reaches the living midnight, do not fail to nurture it; when it reaches the living noon, master the formula for gathering and containing.\n\nAlas! If this body is not liberated in this lifetime, in what future life will it be liberated? The ancient sages said: \"When the front barrier is closed, subdue the heart and qi—success comes from summer and autumn practice.\" They also said: \"When the rear barrier is opened, half the work is done—the true practice is contracting *gen* and opening *qian*.\"\n\nKnow that qi fails to ascend posteriorly because of congealed essence blocking the channels and apertures. The method is to direct the spirit to the Kun abdomen and return the qi to the Gate of Life. When the fire is vigorous, the qi becomes warm; congealed essence, meeting warmth, melts like water. Channels and apertures are no longer obstructed, and the qi naturally penetrates posteriorly.\n\nOriginally, qi circulates through the channels; if channels are blocked, qi stagnates. Know that the substance blocking the channels is the very essence that once coursed through them under qi’s guidance. Thus, qi’s failure to ascend stems from stagnation within essence; stagnation within essence arises from insufficient warmth in qi; qi’s lack of warmth stems from decline in the Gate of Life; decline in the Gate of Life’s fire stems from the spirit’s failure to guard it. For essence moves by means of qi, and qi is warmed by the spirit. When the spirit flourishes, qi is warm; when the spirit wanes, qi cools. Cool qi causes essence to congeal and fail to transform, internally becoming phlegm that fills the meridians and obstructs the apertures.",
      "overlap_context": "ly be genuine.\n\nWhy not verify this with the elixir classics? \"When the external kidneys rise without thought, it is yang arising,\" and it is also called \"living midnight.\" From this, one may realize: \"When the external kidneys rise greatly without thought, it coincides with the living noon within the body.\" Only then should one proceed with gathering—otherwise, what is obtained is not true yang. Using it for nourishing life may suffice, but relying on it to attain the Dao—is this not difficult?",
      "start_char": 9587,
      "end_char": 10812,
      "start_sentence": 360,
      "end_sentence": 403,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.60915517807007,
      "metadata": {
        "source_file": "dao\\藏外\\太虚集录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "其流弊，非惟大道难行，性命亦难暂保。 法惟坤腹极热以挽之。 要知精之为物，旺气御之，如云乘燥风，升则成霞，降则如露； 衰气御之，如雾乘湿风生成滞云，降化尤雨。 况此阴精下注，逗留膀胱，偶经相火一烘，油然外泄，此又滞下之大弊； 若经气御，散至百络，一干风火，变作痈疽，或成瘫痪，更或积久化火，便成骨蒸，世之劳瘵等证，皆此物以酿成者。 古哲忧之，此所以谕有培火之说也。 培火之说，惟有意存坤腹，炁归命门。 命门之火，视之不见，体之则有——神火之根。 命门火旺，饮食之精便可化气，更得意注坤腹，燥者培真土，润者泽百骸、滋气机，以涵雷阳，真火之用大矣哉！ 我辈平时，饮食日化，向昧培火一说，百络之间，或鲜被累，膀胱一地，此物尤多，阴不化阳，其流弊，必致如上说也，可不知所加注乎？ 气不后升，其去斯祸不远矣。 且气不后升，升必自前，气若前透，其祸更大。 （小则肝气发，大则脚气冲。 ）而病发必春，春发犹可，夏发乃烈。 盖此泥精成痰，先塞中宫，阻气下注； 间有随气下流，而命门火衰，降物凝塞于下； 而尾闾穴壅，则其夹脊顶枕必咸壅塞，是已任督咸闭，祸岂能测？ 欲顸救挽，法兼勒缩艮功，汇集臣民，以助以培，命门真火乃旺，用以烘灸中下，阴精日自熔销，真炁势大，用以破关通络； 如是一七、二七，行至七七不间，则其前滞后滞之物化而任督通，不惟病愈已也。 若但求通，不事培助，往昔淤泥，仍留络窍，不过瞬暂或安，究其所致，志在苟安，实因阳衰气弱、振率觉难耳！ 积习难挽，乃至于此，可慨也夫！ 我侪志士，可切戒之。 若夫气机既通，阴精既化、宿疾既除，人可从事修炼三则。 第其中尚有功诀，盖凡子至巳，功宜翘臀俯躬、直项缩艮，二十四息； 引提至乾，存神泥丸，一有六不息； 平直其体，坠腹而坐，一有六息。 共行三十六息，如是循行六时。 若自午至亥，功宜抚腹直腰、仰项虚心，一十六息； 存神坤腹，一有四息； 如前平直，息息归脐，一有四息。 共行二十四息，如是循行六时。 先哲有言曰：“自子至巳，宜进阳火，阳旺则升，阳升则机灵； 自午至亥，宜退阴符，阴熔则降，降则滞活。 ”又曰：“首为乾鼎，心乃神室，腹日坤炉。 心乃藏气之府，腹为性命交宫，生药之地； 心宜虚，腹宜实，心不虚则念杂炁乱，宿积不化下，酿成痰饮； 腹不实则炁虚气滞，液精不熔化，酿成精漏。 ”学者念之。 何以端直其体？ 要知任督二脉，体不端直则气机塞，体一端直则气机无阻，百络通利，关系非细。 但初行此诀，气不易降，每有气翻逆涌，或觉身前身后胀滞发酸，皆因络有淤泥，尚滞未销，经炁透冲。 现此不舒，正是通兆。 急须加行翘臀等诀以逼督、虚心实腹以逼任，任督大通，前患自平。 任督既通，除午子两时循行取采大法外，须于得药之后，循行翘臀虚心等功，加行平直功法，以炼以养，三年有成。 何以空洞其心？ 心不空洞，气神随念散注，理失其端治无其绪，厥功难行。 心一空洞，炁统于一，纵有淤滞，炁到立化，厥功易效，且犹有妙用寓焉。 若或从事通任一功，其既，必行坠腹澄神一诀。 此功失备，有坎阳陷阴之象，易落昏沉。",
      "translated_text": "The consequences of this are dire: not only does the great Dao become difficult to practice, but even one’s life may scarcely be preserved. The only remedy lies in intensely warming the earthly abdomen to reverse the condition.\n\nKnow that essence, as a substance, when guided by flourishing qi, moves like clouds borne on dry winds—ascending to form rosy dawn, descending as gentle dew. Yet when guided by declining qi, it becomes like mist carried on damp winds, forming stagnant clouds that descend as heavy rain. Moreover, when this yin essence flows downward and lingers in the bladder, an occasional flare of ministerial fire may cause it to seep outward in an oily discharge—this is the gravest harm of stagnation below. If, however, it is guided by channel qi and dispersed throughout the hundred vessels, a single drying by wind-fire may transform it into abscesses or paralysis. Over time, it may accumulate and generate fire, leading to bone steaming; the consumptive ailments of the world all arise from this substance.\n\nThe sages of old feared this, hence their teachings on cultivating fire. The method of cultivating fire lies solely in focusing the mind on the earthly abdomen and returning qi to the Gate of Life. The fire of the Gate of Life is invisible to the eye, yet its presence is tangible—it is the root of the spirit-fire. When the fire of the Gate of Life flourishes, the essence of food and drink can be transformed into qi. Further, by directing intention to the earthly abdomen, dryness is nurtured into true earth, while moisture nourishes the hundred bones, invigorates the qi mechanism, and sustains the thunderous yang. The function of true fire is indeed vast!\n\nIn our daily lives, as food and drink are transformed day by day, we often neglect the teaching of cultivating fire. Thus, among the hundred vessels, few escape affliction, and in the bladder, this substance accumulates in abundance. Yin fails to transform yang, and the consequences unfold as described above—how can one remain unaware of where to direct their focus? If qi fails to ascend posteriorly, disaster is not far off. Moreover, if qi does not ascend posteriorly, it will inevitably rise anteriorly; should qi penetrate forward, the harm is even greater. (At best, it manifests as liver qi surging; at worst, as leg qi rushing upward.) The onset of illness invariably occurs in spring; spring outbreaks are manageable, but summer outbreaks are severe.\n\nFor this phlegm-like essence first obstructs the central palace, blocking qi from descending. Occasionally, some may follow qi downward, but with the Gate of Life’s fire weakened, the descending substance congeals below. When the coccyx point is obstructed, the governing and conception vessels along the spine, crown, and occiput become equally blocked—both the Ren and Du channels are sealed, and the calamity is beyond measure.\n\nTo remedy and reverse this, the method must combine the restraint of the Gen technique, gathering the ministers to assist and cultivate. Only then will the true fire of the Gate of Life flourish, warming and steaming the middle and lower regions. Yin essence will daily melt away, and true qi will grow in power, breaking through blockages and unobstructing the channels. Practicing thus for one seven-day period, then two, up to seven seven-day periods without interruption, the stagnations before and behind will dissolve, and the Ren and Du channels will open. Not only will illness be cured, but more shall be achieved.\n\nYet if one merely seeks to unblock without cultivating and assisting, the old stagnant sludge will remain in the vessels and apertures. Temporary relief may occur, but the root cause—weak yang, feeble qi, and the difficulty of rousing oneself—will persist. Deep-seated habits are hard to reverse, and this is the lamentable outcome. We, as aspiring scholars, must take heed and strictly avoid this.\n\nOnce the qi mechanism is unblocked, yin essence transformed, and chronic ailments resolved, one may proceed to the threefold practice of cultivation. Within this, there are further techniques:\n\nFrom midnight to noon, the practice should involve raising the buttocks, bowing the body, straightening the neck, and contracting the Gen. Perform twenty-four breaths. Then, draw upward to the Qian position, visualize the spirit in the mud pill, and hold for six breaths without exhaling. Straighten the body, relax the abdomen, and sit with six breaths. In total, perform thirty-six breaths, repeating this cycle for six periods.\n\nFrom noon to midnight, the practice should involve pressing the abdomen, straightening the waist, lifting the neck, and emptying the heart. Perform sixteen breaths. Then, visualize the spirit in the earthly abdomen for four breaths, and as before, straighten the body, with each breath returning to the navel for four breaths. In total, perform twenty-four breaths, repeating this cycle for six periods.\n\nThe sages have said: “From midnight to noon, one should advance the yang fire; when yang flourishes, it ascends, and when it ascends, the mechanism is lively. From noon to midnight, one should retreat the yin tally; when yin melts, it descends, and when it descends, stagnation dissolves.” They also said: “The head is the Qian cauldron, the heart the chamber of spirit, and the abdomen the Kun furnace. The heart is the palace storing qi, the abdomen the palace where life and nature converge, the land where medicine is born. The heart should be empty, the abdomen full. If the heart is not empty, thoughts scatter and qi becomes chaotic; old accumulations fail to transform below, congealing into phlegm-rheum. If the abdomen is not full, qi is deficient and stagnant; fluids and essence fail to melt, congealing into seminal leakage.” Let the learner take note.\n\nWhy must the body be upright? Know that for the Ren and Du channels, if the body is not upright, the qi mechanism becomes obstructed; when the body is upright, the qi mechanism flows unimpeded, and the hundred vessels are free. This is no minor matter.\n\nHowever, when first practicing this technique, qi may not descend easily, often causing counterflow or surging, or sensations of distension, stagnation, or soreness in the front or back of the body. These arise from residual sludge in the vessels that has not yet dissolved, as channel qi penetrates and rushes through. Such discomfort is a sign of unblocking. One must urgently apply the technique of raising the buttocks to press the Du channel, and empty the heart while filling the abdomen to press the Ren channel. Once the Ren and Du are fully open, previous afflictions will naturally resolve.\n\nAfter the Ren and Du channels are open, aside from the major methods of circulation and absorption practiced during the midnight and noon periods, one must, after obtaining the medicine, continue the techniques of raising the buttocks and emptying the heart, incorporating the upright practice to refine and nourish. With three years of practice, success will be achieved.\n\nWhy must the heart be emptied? If the heart is not empty, qi and spirit scatter with thoughts, principles lose their order, and practice lacks coherence—success is difficult. When the heart is empty, qi unifies, and even if stagnation remains, qi will dissolve it upon arrival. The practice becomes effective, and further subtleties reside within.\n\nIf one practices the technique of unblocking the Ren channel, upon completion, one must perform the technique of relaxing the abdomen and settling the spirit. Without this, there is a risk of yang sinking into yin, leading to dullness and torpor.",
      "overlap_context": "on within essence; stagnation within essence arises from insufficient warmth in qi; qi’s lack of warmth stems from decline in the Gate of Life; decline in the Gate of Life’s fire stems from the spirit’s failure to guard it. For essence moves by means of qi, and qi is warmed by the spirit. When the spirit flourishes, qi is warm; when the spirit wanes, qi cools. Cool qi causes essence to congeal and fail to transform, internally becoming phlegm that fills the meridians and obstructs the apertures.",
      "start_char": 10812,
      "end_char": 12047,
      "start_sentence": 404,
      "end_sentence": 453,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.53362226486206,
      "metadata": {
        "source_file": "dao\\藏外\\太虚集录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "备是诀者，气静神清，于斯之际，且必得有一灵独露之功。 此功失备，升已杂浊，每有脑胀目赤，因动躁念，引起雷阳，致召雷震神飞之险。 备斯一诀，万无等等患，纵或但犯胀眩，略加虚松通透等诀，患自立失。 此句妙用，可胜述哉！ 太虚又曰：大凡饱食，切戒坠腹骤行，诀惟虚心； 食既略落，亦惟神存心腹，勿事武功，诀加缓步抚腹而已； 食坠既消，方可用武。 古哲有言日：“食后功用文”，又曰：“食后加虚心，心虚食易消。 ”盖人以食为天，而致病之由基于食滞中宫，化成痰饮，翻胃等症所由发也。 食后加武，谷随气行，降滞下极，肛痈痔漏之由； 浊气滞络，则又瘫痪等症之由。 此物滞附于骨节者，积久化火、又成痨瘵骨蒸等症，古哲所谓文者，神存中极，意注命门而已。 若加坠，其用乃武，适以致病，故戒之。 虚心之诀惟何？ 虚松其气机焉而已。 曰缓步，寓有助脾化食之功； 曰抚腹，寓有兜回谷气、导令藉火化炁之义。 及食既化，又须加行缩艮一功。 缩艮之诀惟何？ 如忍大小便然，所以防闲谷气不令外滞、又使不能下滞之义。 盖此一物，清者随炁上升而化血，散充百络； 浊者随气下行而润肠胃，一失神烘便成阴液，为祸一身。 故古哲于此，必三留意焉。 方其神存中宫，觉此胸臆满胀，敬以意运，从胸右降下，绕兜脐轮，自左上兜，绕脐到右而下——此是退阴符。 盖以谷气太旺，故须从退诀。 稍松即止功，但行虚于心一诀，自得松落之趣，渐觉得有氤氲气象现于心目，是乃谷气熏蒸初现之效； 次觉此景遍周，乃是谷气乘我中炁流行一身之效，既而胸臆气爽，惟腹尚充。 此时食已下落，可加左中右运等功。 谨按斯法：行体鼻息，息左则左，息中则中，息右则有，厥理精妙，而功法惟文。 古哲泄未明泄，惟云但循诀运。 [古法盖依鼻息之气，出左出右而行。 然鼻只两孔，出惟左右哪有中出之气？ 所谓中者，乃是两孔并出时，即为中炁也。 人之鼻息，一合天时，验之有素。 古法不我欺者，其息出入，乃是子左丑有，寅左卯右，按时递更，一一不爽，其于两时相界，则两孔并出。 息出之数，惟子午较增，余时皆彷佛。 其运法，气从左出者，即从胸左而下，兜腹转右，随转至脐上二寸许，向内一推，直附命门，此名迸阳火。 阳亏者，多运至三十六转而止。 气从右出者，即从胸右而下，兜腹转左，随转至脐上二寸许，向内一推，直至下田，不附命门，此名退阴符。 阴亏者，多运至二十四转而止。 两孔并出为中炁，则自绛阙直抵中黄，于脐轮左旋三十六，右旋二十四，亦于脐上二寸许向内一推。 直入玄窍中，无思无虑一刻而止，是名封炉。 按此功法，能按十二时不间断者，却是大秘法。 ] 已忽造入屯蒙气局，此是神游水府之验。 学者此际，急用清空功诀，转加神注坤腹、兼事缩艮，便得下田火发； 逮至上中炁应，切戒前提。 功惟前降，须助炁后攻，一旦破关后透，腾腾过脊，透枕而上，停凝半响，自能下达华池。 法于斯时，倍加息心，必得甘露沛澍，口满分咽，觉吾绛阙，真炁凝如； 旋即从事忘诀，得有身无其身之妙，忽复觉有一滴，降自虚无，直滴到心，惟觉得大清凉； 忽又下滴中黄，觉极温润，遍体春如，此是谷气已化至宝。",
      "translated_text": "Those who master this technique will find their qi settled and spirit clear. At this juncture, one must also attain the singular practice of \"a single spirit revealed.\" Without this, ascent becomes mixed with turbidity, often leading to distended brain, reddened eyes, restlessness, and stirred thoughts—invoking the thunderous yang and risking the peril of \"thunderclap spirit-flight.\" With this technique in place, such afflictions are entirely avoided. Even if slight distension or dizziness arises, applying the methods of emptiness, relaxation, and unobstructed flow will resolve it instantly. The subtleties of this phrase are beyond description!\n\nMaster Taixu further states: After a full meal, one must strictly avoid abruptly performing the technique of relaxing the abdomen; the method lies solely in emptying the heart. Once the food has settled somewhat, one should only maintain spirit within the heart and abdomen, avoiding vigorous practice—the method is to walk slowly while gently caressing the abdomen. Only after digestion is complete may one engage in martial practice.\n\nThe ancients said: \"After eating, practice with civility,\" and also: \"After eating, add emptiness of heart—with an empty heart, food digests easily.\" For humans, food is paramount, yet the root of illness often lies in stagnant food within the central palace, transforming into phlegm and rheum, giving rise to conditions like regurgitation. Practicing vigorously after eating causes grain to follow qi downward, stagnating in the lower extreme—this is the origin of anal abscesses and hemorrhoids. When turbid qi stagnates in the channels, it leads to paralysis and other ailments. If this substance adheres to the joints and bones over time, it generates fire, eventually causing consumptive diseases like bone steaming. The \"civility\" of the ancients refers to maintaining spirit in the central palace and directing intention to the Gate of Life. If one forcibly relaxes the abdomen, the practice becomes martial, which only invites illness—hence the prohibition.\n\nWhat is the method of emptying the heart? It is simply to relax the qi mechanism. Walking slowly aids the spleen in transforming food, while caressing the abdomen gathers and returns grain qi, guiding it to be refined by fire into qi. Once the food is digested, one must add the practice of \"contracting Gen.\" What is the method of contracting Gen? It is akin to restraining the urge to defecate or urinate, preventing grain qi from stagnating externally while also ensuring it does not descend and stagnate below. For this substance, the pure aspect ascends with qi to transform into blood, dispersing and filling the hundred channels; the turbid aspect descends with qi to moisten the intestines and stomach. If spirit is not properly regulated, it readily congeals into yin fluids, bringing harm to the entire body. Thus, the ancients paid particular attention to this in three ways.\n\nWhen one maintains spirit in the central palace and senses fullness and distension in the chest, respectfully guide intention to descend from the right side of the chest, circling around the navel wheel, then ascending from the left to encircle the navel and descend on the right—this is the \"Retreat Yin Talisman.\" Since grain qi is overly abundant, one must employ the retreat method. Once slightly relaxed, cease the practice and simply apply the method of emptiness of heart, naturally attaining a sense of release. Gradually, one perceives a misty, vaporous phenomenon before the eyes—this is the initial effect of grain qi steaming. Next, this scene pervades the entire body, indicating that grain qi is riding the central qi to circulate throughout—this is the effect of its flow within. Eventually, the chest and diaphragm feel clear, though the abdomen remains full.\n\nAt this point, the food has descended, and one may add the practices of left, center, and right circulation. Carefully follow this method: align the body with nasal breathing—inhale left, then left; inhale center, then center; inhale right, then right. The principle is exquisitely subtle, yet the practice remains civil. The ancients, though not explicitly explaining the mechanism, simply instructed to follow the method in circulation.\n\n[The ancient method relies on the qi of nasal breathing, moving left or right as it exits. However, the nose has only two nostrils—how can there be a \"center\" exit? The \"center\" refers to when both nostrils exhale simultaneously, forming the central qi. Human nasal breathing aligns with celestial timing, a truth long verified. The ancient method does not deceive: the cycle of exhalation and inhalation follows the twelve earthly branches—*zi* left, *chou* right, *yin* left, *mao* right—alternating precisely without deviation. At the transition between two hours, both nostrils exhale together. The count of exhalations increases notably at *zi* and *wu*, while other times are roughly similar.\n\nIn the circulation method: when qi exits the left nostril, descend from the left side of the chest, circle the abdomen to the right, then push inward at approximately two *cun* above the navel, directly attaching to the Gate of Life—this is called \"Advancing Yang Fire.\" For those deficient in yang, perform up to thirty-six rotations. When qi exits the right nostril, descend from the right side of the chest, circle the abdomen to the left, then push inward at approximately two *cun* above the navel, reaching the lower field without attaching to the Gate of Life—this is called \"Retreating Yin Talisman.\" For those deficient in yin, perform up to twenty-four rotations. When both nostrils exhale together as central qi, proceed straight from the Crimson Palace to the Central Yellow, rotating left thirty-six times and right twenty-four times around the navel wheel, then push inward at approximately two *cun* above the navel, entering the mysterious aperture. Remain thoughtless for a moment—this is called \"Sealing the Crucible.\"\n\nPracticing this method in accordance with the twelve hours without interruption is a great secret technique.]\n\nIf one inadvertently enters the *tun* and *meng* qi phase, this signals the spirit’s journey to the Water Palace. At this moment, the practitioner must swiftly apply the \"Clear Emptiness\" technique, further directing spirit to the Kun abdomen while employing the contraction of Gen—this will ignite the fire of the lower field. When the upper and central qi respond, strictly avoid premature ascent. The practice must continue its descent, aiding qi to press forward. Once the barrier is broken and transcended, qi surges up the spine, passes through the pillow, and ascends. After lingering for a moment, it naturally descends to the Flowery Pond. At this time, double the effort to still the heart, and one will surely receive a copious outpouring of sweet dew, filling the mouth to be swallowed in portions. The Crimson Palace feels as though true qi has congealed. Then, proceed with the \"Forgetting\" technique, attaining the wonder of a body without substance. Suddenly, one senses a drop descending from the void, straight into the heart—only an immense coolness is felt. Then, it descends further into the Central Yellow, evoking extreme warmth and moisture, as if spring pervades the entire body. This signifies that grain qi has transformed into the supreme treasure.",
      "overlap_context": "principles lose their order, and practice lacks coherence—success is difficult. When the heart is empty, qi unifies, and even if stagnation remains, qi will dissolve it upon arrival. The practice becomes effective, and further subtleties reside within.\n\nIf one practices the technique of unblocking the Ren channel, upon completion, one must perform the technique of relaxing the abdomen and settling the spirit. Without this, there is a risk of yang sinking into yin, leading to dullness and torpor.",
      "start_char": 12047,
      "end_char": 13282,
      "start_sentence": 454,
      "end_sentence": 504,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.694071531295776,
      "metadata": {
        "source_file": "dao\\藏外\\太虚集录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "于斯时也，法惟寂俟于不识不知之境，是名袭宝归炉，丹书名曰“宝归混沌”。 凡我学者，未到辟谷地位，此段功夫，岂可日忽？ 诚以得功在此，而得祸亦在此也。 修道人初步，何以必自身等虚空一诀始？ 盖斯虚空乃天地之本体、吾身之究竟，假此真象以入手，则后持功诀，头头合道。 谨按行动，无不以天地为法身者，究其功法，乃自宽其气机。 气机宽，始无中滞，乃得以身为铅、以心为汞、以定为水、以慧为火，而一无或难。 况吾身虚处即天、实处即地，其中心肝脾肺肾，乃既精神魂魄意； 其在天地间，既为金木水火土； 而于道，则为仁义礼智信。 体其作用，无非补偏救弊，而不外夫定慧两义。 有谓定乃道体，慧乃道用，其说似是而非者。 盖定对不定而言，慧亦对夫不慧也。 按其精义，定慧两字，皆属道用。 夫道之为道，自然纯一而具万有，该古今先后而有若寂无，彷之太极，庶几似之。 物来顺应，慧之义也； 物往勿随，定之义也，然惟圣人能之。 我辈修持，亦致修及似——始而难，继而能，终至自似焉而已。 其功法，不外克已，克已功法：无事净其常、有事净其变。 吾师太虚翁曰：“若以虚空为法身而不以色身为天心神室，则落莽荡之虚无而中乏主宰，是为外道，故古哲必以此诀续之，而又虑入无情外道，故更以肉心为天心之心。 ”盖明夫天心无时或昧而圆净圆觉，故能应拂无偏而又出诸自然，气机自充，循是以行夫身心铅汞、定慧水火，此念而外不杂一念，是既所谓念中无念。 若并此念而去之，是为水火煮空铛，乃无情之外道。 景仰天仙者，须共参之。 谨按古哲，先从无妄入手，我辈行动，姑假定慧别解行之。 其功法亦从无妄入手，惟以无妄为定，以妄起立除为慧。 其次第：初除粗妄，继除微妄，终除无妄之妄，造至自然纯一为了当。 谨先立此真念，为吾天心真种子，是名径炼上关，且置夫结胎养胎脱胎等等勿问，盖以此种名目，古哲寓有玄意，正以藉详节次，使无躐等躁迸之弊而已。 究竟趋向，不外除妄存真； 参其功诀，无非假一除万；",
      "translated_text": "At this moment, the method lies solely in silently awaiting the state of \"not knowing, not perceiving\"—this is called \"receiving the treasure and returning to the furnace,\" and in alchemical texts, it is termed *\"Treasure Returns to Chaos.\"* For all practitioners, before reaching the stage of grain avoidance, how could this phase of cultivation be neglected? For herein lies the attainment of achievement—and herein, too, lies the risk of calamity.\n\nWhy must the initial step of Dao cultivation begin with the technique of *\"making the self equal to the void\"*? Because this void is the fundamental substance of Heaven and Earth, the ultimate realization of one’s own body. By employing this true image as the starting point, all subsequent methods and techniques will align with the Dao. Those who conduct themselves with utmost care, modeling their every action after Heaven and Earth, ultimately refine their practice by expanding their qi mechanism. Only when the qi mechanism is expansive can there be no stagnation within; then, one may take the body as lead, the heart as mercury, stillness as water, and wisdom as fire—without encountering the slightest difficulty.\n\nMoreover, the void within the body corresponds to Heaven, while the solid corresponds to Earth. The heart, liver, spleen, lungs, and kidneys within are none other than essence, spirit, ethereal soul, corporeal soul, and intent. In the realm of Heaven and Earth, they manifest as metal, wood, water, fire, and earth; in the Dao, they become benevolence, righteousness, propriety, wisdom, and trust. Their functions serve but to remedy deficiencies and correct imbalances, yet all ultimately fall within the two principles of stillness and wisdom.\n\nSome claim that stillness is the substance of the Dao, while wisdom is its function—this view appears plausible but is mistaken. For stillness is spoken of in contrast to restlessness, just as wisdom is contrasted with ignorance. In their profound meaning, both stillness and wisdom belong to the *function* of the Dao. The Dao as Dao is naturally pure and unified, yet encompasses the myriad existences; it spans past and present, appearing as if utterly quiescent and devoid of form—comparable to the Supreme Ultimate.\n\nResponding to phenomena as they arise is the meaning of wisdom; not being carried away as they depart is the meaning of stillness—yet only the sage can achieve this. For us practitioners, we strive to approximate such mastery: at first, it is difficult; then, it becomes possible; finally, it becomes spontaneous.\n\nThe method of cultivation is nothing other than self-mastery. The practice of self-mastery lies in: when at rest, purifying the constant; when in action, purifying the changing. My teacher, the Venerable Tai Xu, said: *\"If one takes the void as the Dharma-body yet fails to regard the physical body as the divine chamber of the Heavenly Heart, one falls into the emptiness of reckless nihilism, lacking any governing principle—this is the path of heterodoxy. Thus, the ancient sages invariably followed this technique with another, fearing the descent into the lifeless heterodoxy of non-sentience, and so further designated the fleshly heart as the heart of the Heavenly Heart.\"*\n\nFor the Heavenly Heart is never obscured, ever perfectly pure and awakened; thus, it responds to all things without bias, yet arises entirely from spontaneity. The qi mechanism naturally flourishes, and by following this, one engages in the alchemy of body and heart, lead and mercury, stillness and wisdom, water and fire—beyond this thought, no other thought intrudes. This is what is meant by *\"no-thought within thought.\"* If one were to eliminate even this thought, it would be like boiling an empty cauldron with water and fire—this is the lifeless heterodoxy of non-sentience. Those who aspire to the rank of Heavenly Immortal must jointly investigate this.\n\nThe ancient sages began with *\"non-delusion\"* as their entry point. For us practitioners, we provisionally employ stillness and wisdom as distinct methods. The practice likewise begins with non-delusion: taking non-delusion as stillness, and the arising of delusion as the occasion for its eradication as wisdom. The stages proceed thus: first, eliminating coarse delusion; then, subtle delusion; finally, the delusion within non-delusion—culminating in natural purity and perfect completion.\n\nFirst, establish this true thought as the seed of one’s Heavenly Heart—this is called *\"directly refining the upper barrier.\"* For now, set aside concerns about *\"conceiving the embryo, nurturing the embryo, and shedding the embryo,\"* for these terms, as used by the ancient sages, contain profound meanings. They serve merely to delineate the stages in detail, preventing the error of skipping steps or hasty progression. The ultimate aim is nothing other than *\"eliminating delusion and preserving the real.\"* The method of practice is simply *\"using one to eliminate the myriad.\"*",
      "overlap_context": "mouth to be swallowed in portions. The Crimson Palace feels as though true qi has congealed. Then, proceed with the \"Forgetting\" technique, attaining the wonder of a body without substance. Suddenly, one senses a drop descending from the void, straight into the heart—only an immense coolness is felt. Then, it descends further into the Central Yellow, evoking extreme warmth and moisture, as if spring pervades the entire body. This signifies that grain qi has transformed into the supreme treasure.",
      "start_char": 13282,
      "end_char": 14077,
      "start_sentence": 505,
      "end_sentence": 533,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.086828231811523,
      "metadata": {
        "source_file": "dao\\藏外\\太虚集录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "推其功法，乃是由浅入深； 循名责实，与夫精而求精、妙以征妙，详其极着，归于无住。 而无住一诀，实又终始持之者。 彀中真种，以性为体，以命为用，凝而存之，熔以一之，炼以神之，而又循以深造，直与无朕之先合则无二。 有是道体，厥用自神，然岂有不自无妄而终而始哉！ 此先哲立名标目之苦衷，无如后学不悟，翻因着妄致增种种邪见，导入歧途。 能悟是旨者，始可取诸丹书以印以证，否则宁可置诸高阁。",
      "translated_text": "The method of practice proceeds from the shallow to the deep. By tracing names to their realities, refining further and further, and verifying the subtle with the subtle, its ultimate manifestation culminates in *\"non-abiding.\"* Yet this *\"non-abiding\"* is the very principle that sustains one from beginning to end. The true seed within the bow lies in *nature* as its essence and *life* as its function. Concentrate and preserve it, fuse it into oneness, refine it with spirit, and through deep cultivation, merge directly with the unmanifested origin—then there is no duality. With this Dao-body, its function becomes wondrous of itself. Yet how could this not begin and end with *\"non-delusion\"*?\n\nThis was the earnest intent behind the ancient sages' establishment of names and terms. Alas, later students failed to comprehend, instead clinging to delusion and fostering all manner of perverse views, leading them astray. Only those who grasp this principle may take up the alchemical texts to affirm and verify; otherwise, it is better to leave them untouched upon the high shelf.",
      "overlap_context": "ed *\"directly refining the upper barrier.\"* For now, set aside concerns about *\"conceiving the embryo, nurturing the embryo, and shedding the embryo,\"* for these terms, as used by the ancient sages, contain profound meanings. They serve merely to delineate the stages in detail, preventing the error of skipping steps or hasty progression. The ultimate aim is nothing other than *\"eliminating delusion and preserving the real.\"* The method of practice is simply *\"using one to eliminate the myriad.\"*",
      "start_char": 14077,
      "end_char": 14261,
      "start_sentence": 534,
      "end_sentence": 540,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.830392837524414,
      "metadata": {
        "source_file": "dao\\藏外\\太虚集录.txt",
        "category": "藏外"
      }
    }
  ]
}