{
  "source_id": "学仙辨真诀",
  "source_file": "chunked_daozang\\学仙辨真诀.json",
  "total_chunks": 2,
  "total_original_chars": 2251,
  "total_translated_chars": 12828,
  "total_translation_time": 63.00845503807068,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\玉诀类\\学仙辨真诀.txt",
    "category": "玉诀类"
  },
  "full_translation": "**The Jade Instructions on Discerning the True in Learning Immortality**\n\n**Text Title:** *Juexian Bianzhen Jue* (*Instructions on Discerning the True in Learning Immortality*)\n**Author:** Zhang Wumeng of the Northern Song Dynasty\n**Volume:** One\n**Source:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, Jade Instructions Category\n\n---\n\n**The Instructions on Discerning the True in Learning Immortality**\n\nThose who seek to return to the root and restore simplicity, to revert the hun-soul and restore the primordial, and to attain longevity by securing the foundation—none surpass the art of the Golden Elixir. Those who obtain this art flourish; those who lose it perish. Thus, it is the utmost mystery of the perfected, not something the common or hasty can glimpse. Without accumulated cultivation and sincere practice, one cannot attain it. Its essentials lie within the *Jinbi* and *Cantong*, yet without the oral transmission of its secrets from a master, one remains as one adrift on a dark sea without a vessel.\n\nMaster Zuo once encountered an adept who imparted its hidden essentials, revealing that the supreme Dao is utterly simple, and its words most vital. This is the celestial mechanism, not to be lightly disclosed. Here, I briefly set forth what I have obtained as the *Five Instructions on Discerning the True*, to clarify the reality of right and wrong.\n\n---\n\n**Discerning the True**\n\nOf old, the Yellow Emperor ascended Mount Emei and inquired of the White Jade Perfected regarding the Dao of the True One. The Perfected said: \"For attaining longevity and ascending as an immortal, only the Golden Elixir suffices; for preserving form and averting death, the True One will do. Thus, the ancients kept it secret.\"\n\nThe True One is lead. Externally black, it embodies the north, belongs to *Kan* (☵), and *Kan* is water, its number one. Internally white, the white pertains to the west and *Dui* (☱), *Dui* is metal, its number four. If one cultivates it according to principle, yin is exhausted and yang arises—this is the transformation of the essence of metal into the One, where the Azure Dragon receives the tally.\n\nThe position of the Azure Dragon is the east and *Zhen* (☳), *Zhen* pertains to wood, its number three. Thus, it may be called the Dao of the Three and the One. Therefore, the *Cantong Qi* states:\n\n> *\"At the initial rectification, cultivation begins,\n> Yet the dry cannot be grasped too soon.\n> The One is concealed,\n> The vulgar cannot know it.\"*\n\nThe *Golden Elixir* clarifies this: the method of the elixir first requires the initial rectification. The initial rectification is the true and unchanging One, and by attaining its principle, one succeeds.\n\n---\n\n**Discerning the Treasure**\n\nGold is the True One, and through transformation, one obtains its true essence. Within the True One lies *qing* (emotion) and *xing* (nature), which are the lead and the white. Through transmutation, they may be called cinnabar and mercury.\n\nCarefully considering: gold is the mother of water, the mother conceals the child in the womb, and water is the child of gold, the child nestles in the mother’s belly. This speaks of gold and water containing each other, rolling within the mother’s womb. Through transformation, lead is born, and in accordance with the qi and seasons, it arises.\n\n---\n\n**Discerning Mercury**\n\nMercury is not what is extracted from cinnabar today. It is refined from the white lead within the Water Palace, also called lead-mercury.\n\nAccording to Master Tao’s *Huánjīn Shù* (*Art of Returning Gold*): \"The black is mercury, not the mercury of the world.\" Moreover, those who claim mercury can be made into the Golden Elixir are deluded; those who say cinnabar can prolong years are utterly ignorant of the Dao. Misled by ignorance and the words of the deluded, one drifts ever farther from the true.\n\n---\n\n**Discerning Mercury (Continued)**\n\nMercury is another name for the Alchemical Maiden, and cinnabar is the supreme treasure within lead. The so-called \"cinnabar-mercury\" in the scriptures is this true instruction.\n\nThe text below states: \"Lead contains cinnabar-mercury, just as humans possess *qing* and *xing*. *Qing* and *xing* in humans are not external things; cinnabar-mercury in lead is not a foreign substance.\" If one introduces external things as *qing*, then *xing* cannot unite; if one substitutes mercury for cinnabar-mercury, then lead cannot be embraced.\n\nIt further states: \"The red marrow flows as mercury, and mercury is the radiant essence of the firmament.\" This clarifies that mercury does not enter from without. From the union of heaven and earth, it receives qi and is born. Thus, the scripture says:\n\n> *\"The sage is not born in vain,\n> Gazing above, he beholds the celestial tally.\"*\n\nThe celestial tally is trust: when heavenly qi descends, earthly qi responds. This is the union of yin and yang, the flowing pearl descending. The flowing pearl is also called mercury!\n\nIt further states:\n\n> *\"Cinnabar flows as the father of mercury,\n> Wu and Ji are the mother of yellow gold.\"*\n\nThus, the mercury within cinnabar cannot be called mercury. The red marrow of the learner is the essence within lead. The perfected refer to mercury as \"quicksilver\" merely as a metaphorical name. Later generations, not understanding, mistakenly call the mercury within cinnabar \"mercury\"—a grave error!\n\nFrom this, it is clear that lead-mercury is the Alchemical Maiden. The \"Maiden of the River’s Edge\" refers to common mercury, not that derived from cinnabar.\n\n---\n\n**Comprehensive Discernment**\n\nMaster Tao said: \"The ancients borrowed the images of the *Yijing* to compose their scriptures because the supreme Dao aligns with heaven and earth. Just as the Most High first divided the One Qi into the Two Modes, and after the Two Modes were distinguished, the Three Powers emerged—whereby *Qian* and *Kun* operate and the myriad beings are upright, *Kan* and *Li* function and metal and water unite—this is the pivot of the Dao.\n\nMale and female differ, yet yin and yang unite; qi intermingles and forms harmonize, responding to change endlessly—this is the function of the Dao. The sun and moon move! The cold and heat follow their seasons! Moisture and nourishment flow, transformation and circulation proceed—this is the verification of the Dao. Yin extends and yang contracts, yang acts and yin conceals; going and coming, they push *qing* to unite with *xing*—this is the return of the Dao.\n\nThis clarifies the division of the One Qi, modeling heaven and emulating earth, naturally uniting the active with the inactive. How could it rely on other things to achieve this? Thus, one thing transforms into yin and yang, into metal and water, into earth and wood, into *qing* and *xing*, into dragon and tiger. Though they share a single origin, their names differ. They must unite with their kind; if there is deviation, they cannot interact.\n\nTherefore, the *Cantong Qi* states:\n\n> *\"Plant millet with millet,\n> Tame the sparrowhawk with its young.\"*\n\nThis illustrates that lead and mercury cannot be used interchangeably. Moreover, *qing* divides from *xing*, yet *xing* is bound to *qing*; *qing* and *xing* depend on each other, returning to the principle of nature. This is called transformation arising from the true, where beginning and end follow one another.\"\n\nKnow then that true mercury is the *qing* and *xing* of lead, and primordial *qi* is the root of the human being. The Dao of the Three-in-One refines *qing* to unite with *xing*, thereby returning to the root and restoring simplicity.\n\nThe art of golden liquid nurtures mercury with gold, enabling the soul to return to its origin. Thus, the two matters of dragon and tiger share a single source. Mercury does not occupy the proper position among the Five Phases, and cinnabar is not the counterpart of dragon and tiger. Hence it is said:\n\n> *\"Mixed kinds are not of the same seed,\n> How can they dwell together in one body?\"*\n\nThis clearly distinguishes it from common cinnabar and mercury.\n\nIt is further said: Some claim to use lead, others mercury. The text below asks: If mercury is taken as the primary agent, how can Heaven and Earth be established? How can hardness and softness be divided?\n\nIf lead is not incorporated, how can metal and water arise? How can the return and reversal proceed? How then can transformation arise from the true? Should millet be planted with anything but millet?\n\nSince ancient times, songs and verses have praised only the efficacy of lead and never extolled the marvels of mercury. How then could common cinnabar and mercury be used? If mercury is made the primary agent, merely borrowing the *qi* of lead to achieve completion, how can the root be abandoned for the branch? How can one fail to refine the treasure within gold?\n\nFrom this, it is sufficiently clear that the mercury and gold here are not common mercury and ordinary gold. This mercury is not the mercury of the common world. Its purport is profound, its calculations abstruse, extending to the principles of the Five Phases generating and overcoming one another—matters beyond the comprehension of contemporary scholars.\n\nThe *Jinbi* and *Cantong Qi* draw upon the sixty-four hexagrams of the *Zhouyi*, the lunar phases and degrees, the dark and bright moons, the two crescents, the twelve earthly branches, the pitch-pipes and calendars, the stars, the directions of east, west, south, and north, and the principles of the sun and moon, each assigned its correspondence as a standard. Their meaning is recondite and difficult to fathom; without oral transmission from a master, their profound principles cannot be fully grasped.\n\nThe uses of the yang and yin crucibles, the names of cinnabar sand and golden sand—these teachings are widely disseminated yet ultimately difficult to exhaust. Thus, the *Cantong Qi* states:\n\n> *\"The Three, the Five, and the One—\n> The essence of Heaven and Earth.\n> They may be transmitted orally,\n> But cannot be conveyed in writing.\"*\n\nHeaven is spontaneity; when spontaneity is attained, it becomes Heaven and Earth. Externally, one should act with tranquility and non-action; internally, one should cultivate with effort and action.\n\n**Song of the Mother and Child**\nOne mother bears two children—\nThe Dao gives birth to yin and yang.\nOne boy and one girl—\nThe boy is the ancestor of yin,\nFor when yin reaches its extreme, yang is born.\nThe girl is the master of yang,\nFor when yang reaches its extreme, yin is born.\nYin comes and yang returns,\nNever losing their ancestral origin.\nThe two *qi* secretly unite and reciprocate,\nNever departing from the original source.\nThe spleen grinds and food digests itself—\nTogether they return to the earth behind.\nThe *qi* of the central palace stirs, and food is digested.\nScholars are as numerous as hemp,\nYet the deluded span all ages.\nThey see the dragon but do not recognize it,\nMeet the tiger but do not know it.\nThe dragon is not in the eastern river,\nThe tiger is not among the western barbarians.\nThe enlightened see it before their eyes,\nThe deluded seek it a thousand miles away.\nIf you seek it in the one source,\nYou will clearly know the viscera.\nIf you seek it in east and west,\nYou will be as blind as one with two sightless eyes.\nYin resides in the womb of yang,\nYang dwells in the belly of yin.\nThe male is white, the female red—\nNaturally they become husband and wife.\nThe male’s white is the essence of yin, forming bones and marrow;\nThe female’s red is the essence of yang, forming blood and flesh—\nSuch is the natural principle, the female of *li* and the male of *kan*.\nPlant hemp and you reap hemp,\nPlant millet and you reap millet.\nIf you do not recognize lead for what it is,\nYour hands will labor in vain.\nThe magpie does not hatch a phoenix,\nThe fox and hare do not nurse a horse.\nIf you use other substances to refine the returning elixir,\nYou will never succeed.\n\nDimly, dimly—yet how hard is it to see the two things?\nObscurely, obscurely—yet the three natures naturally harmonize.\nThe *Hunyuan* says:\n> *\"Vague, yet within it there is something;\n> Obscure, yet within it there is essence.\n> That essence is most true,\n> Within it there is sincerity.\"*\n\nThe three natures are metal, water, and earth. These three form a single family, beginning and ending with the same source.\n\n*Qing* unites without the need for many medicines, nor does it employ the eight stones or the five metals and mixed kinds. *Qi* harmonizes without words; when *qi* is the same, it naturally unites, not to be sought through sacrificial rites.\n\nIf you can restrain lead as a cat pounces on a mouse, knowing lead and mercury, water and silver, keeping the Dao unadulterated—it is as easy as a cat seizing a mouse.\n\nThe *True Instructions for Discerning Immortality* concludes here.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "学仙辨真诀 经名：学仙辨真诀。 北宋账无梦撰。 一卷。 底本出处：《正统道藏》洞真部玉诀类。 学仙辨真诀 夫欲归根复朴，返魂还元，长生固本者，莫出於金液之术。 此术得之者昌，失之者亡，则是真人至妙，非人问造次所能窥也。 非积修累行，至诚有感，则不可得。 其要并在《金碧》《参同》之中，非至人口授秘奥，财茫然若无航而济瞑海也。 左公曾遇达者，授其密要，方知至道极易，至言甚要。 此天机也，固不可显。 今略述所得为《辨真诀》五篇，用明是非之实也。 辨真 昔轩辕至峨媚山，问白玉真人真一之道，真人日：夫长生飞仙，则唯金丹，守形却死，犹真一也。 故古仙秘焉．真一者，铋也，外黑，禀北方，属坎，坎为水，其数一。 其内白，白属西方兑，兑为金，其数四。 若修之合理，阴尽阳生，便是金精化一，青龙受符。 青龙之位，为束方震，震属木，其数三，则可谓三一之道也。 故《参同契》云：初正则修修，干立未可持。 一者以掩蔽，俗人莫能知。 金液明此，则明为丹之法，先须其初正。 初正者，则是实，真一而终之，得其理也。 辨宝 金者，即真一也，造化而取其真一。 真一之中，情性也，情性即铅白也，变化则可谓砂汞矣。 谨按金为水母，母隐子胎，水者金子，子藏母胞。 此言金水自相含孕，辊椟於母腹中，须造化而生铅，应气候而生也。 辨水银 水银者，非今朱砂中所出者也，并是於水宫之中修铅白也，亦谓之铅汞。 谨按陶君《还金术》云：黑者水银，非世问水银也。 又凡言水银可以为金丹者，人妄也； 言朱砂可驻年者，殊不知道也。 以不知道惑妄人之言，则去真日远矣。 辨汞 夫汞者，诧女之别名，砂者，铅中之至宝。 经所谓砂汞者，此真诀也。 下文云铅之有砂汞，犹人之有情性，情性於人，非外物也； 砂汞於铅，非杂类也。 若引外物为情，则性不可合，以水银代汞，则铅不可亲。 又云赤髓流为汞，汞者弄明当，此明汞非外入也。 自乾坤交媾，受气而生，故经云：圣人不空生，上观显天符。 天符者，信也，天气降，地气应，是阴阳交媾，流珠下也。 流珠亦谓之汞矣！ ．又云：丹砂流汞父，戊己黄金母。 是则朱砂中水银，不可谓之汞也。 今学人赤髓，则铅中之精也。 至人谓汞为水银者，盖是仿像之名耳。 后人不晓，便谓朱砂中水银为汞，深为谬矣！ ．据此言之，则铅汞是姥女也。 夫言河上姥女，则是寻常水银，非丹砂之所。 通辩 陶君云：古人所以假易象而为经者，谓至道与天地配合，如太上始分一气为二仪，二仪判然后有三才，俾乾坤运而品汇贞，坎离用而金水并，此道之枢也。 男冠女异，牝牡相得，气交体合，应变无穷，此道之用也。 日月运矣！ ．寒暑节矣！ ．滋液润泽，施化流通，此道之验也。 阴伸阳屈，阳用阴潜，一往一来，推情合性，此道之返也。 此乃明剖一气，以法天象地，自有为合於无为者也。 岂假他物成之乎？ 则知一物变化，而为之牝牡也，为之金水也，为之土木也，为之情性也，为之龙虎也。 虽同出异名，须与类合，如其差谬，不相涉入矣！ ．故《参同契》云：植禾当以栗，伏鹦用其子。 此朋铅与水银不相为用也。 且情分於性，性纽乎情，情性相依，还返自然之理，是谓变化由其真，，终始自相因矣！",
      "translated_text": "**The Jade Instructions on Discerning the True in Learning Immortality**\n\n**Text Title:** *Juexian Bianzhen Jue* (*Instructions on Discerning the True in Learning Immortality*)\n**Author:** Zhang Wumeng of the Northern Song Dynasty\n**Volume:** One\n**Source:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, Jade Instructions Category\n\n---\n\n**The Instructions on Discerning the True in Learning Immortality**\n\nThose who seek to return to the root and restore simplicity, to revert the hun-soul and restore the primordial, and to attain longevity by securing the foundation—none surpass the art of the Golden Elixir. Those who obtain this art flourish; those who lose it perish. Thus, it is the utmost mystery of the perfected, not something the common or hasty can glimpse. Without accumulated cultivation and sincere practice, one cannot attain it. Its essentials lie within the *Jinbi* and *Cantong*, yet without the oral transmission of its secrets from a master, one remains as one adrift on a dark sea without a vessel.\n\nMaster Zuo once encountered an adept who imparted its hidden essentials, revealing that the supreme Dao is utterly simple, and its words most vital. This is the celestial mechanism, not to be lightly disclosed. Here, I briefly set forth what I have obtained as the *Five Instructions on Discerning the True*, to clarify the reality of right and wrong.\n\n---\n\n**Discerning the True**\n\nOf old, the Yellow Emperor ascended Mount Emei and inquired of the White Jade Perfected regarding the Dao of the True One. The Perfected said: \"For attaining longevity and ascending as an immortal, only the Golden Elixir suffices; for preserving form and averting death, the True One will do. Thus, the ancients kept it secret.\"\n\nThe True One is lead. Externally black, it embodies the north, belongs to *Kan* (☵), and *Kan* is water, its number one. Internally white, the white pertains to the west and *Dui* (☱), *Dui* is metal, its number four. If one cultivates it according to principle, yin is exhausted and yang arises—this is the transformation of the essence of metal into the One, where the Azure Dragon receives the tally.\n\nThe position of the Azure Dragon is the east and *Zhen* (☳), *Zhen* pertains to wood, its number three. Thus, it may be called the Dao of the Three and the One. Therefore, the *Cantong Qi* states:\n\n> *\"At the initial rectification, cultivation begins,\n> Yet the dry cannot be grasped too soon.\n> The One is concealed,\n> The vulgar cannot know it.\"*\n\nThe *Golden Elixir* clarifies this: the method of the elixir first requires the initial rectification. The initial rectification is the true and unchanging One, and by attaining its principle, one succeeds.\n\n---\n\n**Discerning the Treasure**\n\nGold is the True One, and through transformation, one obtains its true essence. Within the True One lies *qing* (emotion) and *xing* (nature), which are the lead and the white. Through transmutation, they may be called cinnabar and mercury.\n\nCarefully considering: gold is the mother of water, the mother conceals the child in the womb, and water is the child of gold, the child nestles in the mother’s belly. This speaks of gold and water containing each other, rolling within the mother’s womb. Through transformation, lead is born, and in accordance with the qi and seasons, it arises.\n\n---\n\n**Discerning Mercury**\n\nMercury is not what is extracted from cinnabar today. It is refined from the white lead within the Water Palace, also called lead-mercury.\n\nAccording to Master Tao’s *Huánjīn Shù* (*Art of Returning Gold*): \"The black is mercury, not the mercury of the world.\" Moreover, those who claim mercury can be made into the Golden Elixir are deluded; those who say cinnabar can prolong years are utterly ignorant of the Dao. Misled by ignorance and the words of the deluded, one drifts ever farther from the true.\n\n---\n\n**Discerning Mercury (Continued)**\n\nMercury is another name for the Alchemical Maiden, and cinnabar is the supreme treasure within lead. The so-called \"cinnabar-mercury\" in the scriptures is this true instruction.\n\nThe text below states: \"Lead contains cinnabar-mercury, just as humans possess *qing* and *xing*. *Qing* and *xing* in humans are not external things; cinnabar-mercury in lead is not a foreign substance.\" If one introduces external things as *qing*, then *xing* cannot unite; if one substitutes mercury for cinnabar-mercury, then lead cannot be embraced.\n\nIt further states: \"The red marrow flows as mercury, and mercury is the radiant essence of the firmament.\" This clarifies that mercury does not enter from without. From the union of heaven and earth, it receives qi and is born. Thus, the scripture says:\n\n> *\"The sage is not born in vain,\n> Gazing above, he beholds the celestial tally.\"*\n\nThe celestial tally is trust: when heavenly qi descends, earthly qi responds. This is the union of yin and yang, the flowing pearl descending. The flowing pearl is also called mercury!\n\nIt further states:\n\n> *\"Cinnabar flows as the father of mercury,\n> Wu and Ji are the mother of yellow gold.\"*\n\nThus, the mercury within cinnabar cannot be called mercury. The red marrow of the learner is the essence within lead. The perfected refer to mercury as \"quicksilver\" merely as a metaphorical name. Later generations, not understanding, mistakenly call the mercury within cinnabar \"mercury\"—a grave error!\n\nFrom this, it is clear that lead-mercury is the Alchemical Maiden. The \"Maiden of the River’s Edge\" refers to common mercury, not that derived from cinnabar.\n\n---\n\n**Comprehensive Discernment**\n\nMaster Tao said: \"The ancients borrowed the images of the *Yijing* to compose their scriptures because the supreme Dao aligns with heaven and earth. Just as the Most High first divided the One Qi into the Two Modes, and after the Two Modes were distinguished, the Three Powers emerged—whereby *Qian* and *Kun* operate and the myriad beings are upright, *Kan* and *Li* function and metal and water unite—this is the pivot of the Dao.\n\nMale and female differ, yet yin and yang unite; qi intermingles and forms harmonize, responding to change endlessly—this is the function of the Dao. The sun and moon move! The cold and heat follow their seasons! Moisture and nourishment flow, transformation and circulation proceed—this is the verification of the Dao. Yin extends and yang contracts, yang acts and yin conceals; going and coming, they push *qing* to unite with *xing*—this is the return of the Dao.\n\nThis clarifies the division of the One Qi, modeling heaven and emulating earth, naturally uniting the active with the inactive. How could it rely on other things to achieve this? Thus, one thing transforms into yin and yang, into metal and water, into earth and wood, into *qing* and *xing*, into dragon and tiger. Though they share a single origin, their names differ. They must unite with their kind; if there is deviation, they cannot interact.\n\nTherefore, the *Cantong Qi* states:\n\n> *\"Plant millet with millet,\n> Tame the sparrowhawk with its young.\"*\n\nThis illustrates that lead and mercury cannot be used interchangeably. Moreover, *qing* divides from *xing*, yet *xing* is bound to *qing*; *qing* and *xing* depend on each other, returning to the principle of nature. This is called transformation arising from the true, where beginning and end follow one another.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1266,
      "start_sentence": 0,
      "end_sentence": 64,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.90452289581299,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\学仙辨真诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "．是知真汞者，铅之情性也，元气者，人之根本也。 三一之道，修情合性，则可以归根复朴矣！ ．金液之术，以金养汞，可以返魂还元。 则所以龙虎二事，本乎一物者也。 其水银不在五行正位，朱砂非龙虎之配合，故日：杂类不同种，安能合体居。 此则不同人问朱砂水银，明矣！ ．又日：或云用铅耶，或云用水银耶，下文云若以水银为主，乾坤其可立乎？ 刚柔其可分乎！ ．必杂铅而为之，则金水何由而生？ 还返何由而行？ 又焉得变化由其真欤？ 植禾当以粟欤！ 古来歌诀，唯赞铅之功效，不说水银精妙，验此又安得用人问朱砂水银乎？ 必以水银为主，但假铅气而成，何得遗本存末乎？ 又焉得不修金中宝乎？ 据此足明水银与金，非人问水银与常金也。 汞非人问之汞，其旨远，其筹探，至於五行相生相杀之理，并非时人学者所能知也。 其《金碧》《参同》引用《周易》六十四卦，并月节度数，晦朔两弦，十二辰，律历星辰，束西南北，日月之义，各有所配，以为凭准，其义隐而难晓，非至人口授，难可尽其奥理。 其阳鼎阴鼎之用，丹砂金砂之名，其说广传，卒难究议，故《参同》云：三五与一，天地至精，可以口诀，难以书传。 天者，自然也，自然合得，则为天地也。 外当恬怆作无为，内当修行作有为也。 子母歌 一母生两子，道生阴阳。 一男复一女，男是阴之宗，阴极生阳。 女是阳之主。 阳极生阴。 阴来阳复往，不失本宗祖。 二气潜交合相返，不离本源也。 脾磨食自消，相将归后土。 脾中宫之气，脾动则食消。 学者亦如麻，迷者自今古。 见龙不识龙，逢虎不识虎，龙不在束淇，虎不在西虏。 知者目前，迷者千里。 若向一源求，昭昭知脏腑，若向束西求，有目如双瞽。 阴在阳之胞，阳在阴之肚，男白女还赤，自然为夫妇。 男白阴精为骨髓，女赤阳精为血肉，自然之理，为离女坎男也。 种麻只收麻，种黍只收黍，向铅不识铅，白手成辛苦。 鸶雀不生凤，狐兔不乳马，若以他物修炼还丹，终无成功。 恍恍复惚惚，二物何难睹，杳杳复冥冥，三性自亲倡。 混元日：恍兮惚，其中有物； 杳兮冥，其中有精。 其精甚真，其中有信。 三性者，金水土也。 此三物自为一家，终始同其源。 情交无众药，不使八石五金杂类。 气合无言语，气同自合，非于祭际而求得也。 若能铅自拘，亦如狸伏鼠。 知铅知汞，知水知银，其道不杂，如狸伏鼠，言易也。 学仙辨真诀竟",
      "translated_text": "Know then that true mercury is the *qing* and *xing* of lead, and primordial *qi* is the root of the human being. The Dao of the Three-in-One refines *qing* to unite with *xing*, thereby returning to the root and restoring simplicity.\n\nThe art of golden liquid nurtures mercury with gold, enabling the soul to return to its origin. Thus, the two matters of dragon and tiger share a single source. Mercury does not occupy the proper position among the Five Phases, and cinnabar is not the counterpart of dragon and tiger. Hence it is said:\n\n> *\"Mixed kinds are not of the same seed,\n> How can they dwell together in one body?\"*\n\nThis clearly distinguishes it from common cinnabar and mercury.\n\nIt is further said: Some claim to use lead, others mercury. The text below asks: If mercury is taken as the primary agent, how can Heaven and Earth be established? How can hardness and softness be divided?\n\nIf lead is not incorporated, how can metal and water arise? How can the return and reversal proceed? How then can transformation arise from the true? Should millet be planted with anything but millet?\n\nSince ancient times, songs and verses have praised only the efficacy of lead and never extolled the marvels of mercury. How then could common cinnabar and mercury be used? If mercury is made the primary agent, merely borrowing the *qi* of lead to achieve completion, how can the root be abandoned for the branch? How can one fail to refine the treasure within gold?\n\nFrom this, it is sufficiently clear that the mercury and gold here are not common mercury and ordinary gold. This mercury is not the mercury of the common world. Its purport is profound, its calculations abstruse, extending to the principles of the Five Phases generating and overcoming one another—matters beyond the comprehension of contemporary scholars.\n\nThe *Jinbi* and *Cantong Qi* draw upon the sixty-four hexagrams of the *Zhouyi*, the lunar phases and degrees, the dark and bright moons, the two crescents, the twelve earthly branches, the pitch-pipes and calendars, the stars, the directions of east, west, south, and north, and the principles of the sun and moon, each assigned its correspondence as a standard. Their meaning is recondite and difficult to fathom; without oral transmission from a master, their profound principles cannot be fully grasped.\n\nThe uses of the yang and yin crucibles, the names of cinnabar sand and golden sand—these teachings are widely disseminated yet ultimately difficult to exhaust. Thus, the *Cantong Qi* states:\n\n> *\"The Three, the Five, and the One—\n> The essence of Heaven and Earth.\n> They may be transmitted orally,\n> But cannot be conveyed in writing.\"*\n\nHeaven is spontaneity; when spontaneity is attained, it becomes Heaven and Earth. Externally, one should act with tranquility and non-action; internally, one should cultivate with effort and action.\n\n**Song of the Mother and Child**\nOne mother bears two children—\nThe Dao gives birth to yin and yang.\nOne boy and one girl—\nThe boy is the ancestor of yin,\nFor when yin reaches its extreme, yang is born.\nThe girl is the master of yang,\nFor when yang reaches its extreme, yin is born.\nYin comes and yang returns,\nNever losing their ancestral origin.\nThe two *qi* secretly unite and reciprocate,\nNever departing from the original source.\nThe spleen grinds and food digests itself—\nTogether they return to the earth behind.\nThe *qi* of the central palace stirs, and food is digested.\nScholars are as numerous as hemp,\nYet the deluded span all ages.\nThey see the dragon but do not recognize it,\nMeet the tiger but do not know it.\nThe dragon is not in the eastern river,\nThe tiger is not among the western barbarians.\nThe enlightened see it before their eyes,\nThe deluded seek it a thousand miles away.\nIf you seek it in the one source,\nYou will clearly know the viscera.\nIf you seek it in east and west,\nYou will be as blind as one with two sightless eyes.\nYin resides in the womb of yang,\nYang dwells in the belly of yin.\nThe male is white, the female red—\nNaturally they become husband and wife.\nThe male’s white is the essence of yin, forming bones and marrow;\nThe female’s red is the essence of yang, forming blood and flesh—\nSuch is the natural principle, the female of *li* and the male of *kan*.\nPlant hemp and you reap hemp,\nPlant millet and you reap millet.\nIf you do not recognize lead for what it is,\nYour hands will labor in vain.\nThe magpie does not hatch a phoenix,\nThe fox and hare do not nurse a horse.\nIf you use other substances to refine the returning elixir,\nYou will never succeed.\n\nDimly, dimly—yet how hard is it to see the two things?\nObscurely, obscurely—yet the three natures naturally harmonize.\nThe *Hunyuan* says:\n> *\"Vague, yet within it there is something;\n> Obscure, yet within it there is essence.\n> That essence is most true,\n> Within it there is sincerity.\"*\n\nThe three natures are metal, water, and earth. These three form a single family, beginning and ending with the same source.\n\n*Qing* unites without the need for many medicines, nor does it employ the eight stones or the five metals and mixed kinds. *Qi* harmonizes without words; when *qi* is the same, it naturally unites, not to be sought through sacrificial rites.\n\nIf you can restrain lead as a cat pounces on a mouse, knowing lead and mercury, water and silver, keeping the Dao unadulterated—it is as easy as a cat seizing a mouse.\n\nThe *True Instructions for Discerning Immortality* concludes here.",
      "overlap_context": "y must unite with their kind; if there is deviation, they cannot interact.\n\nTherefore, the *Cantong Qi* states:\n\n> *\"Plant millet with millet,\n> Tame the sparrowhawk with its young.\"*\n\nThis illustrates that lead and mercury cannot be used interchangeably. Moreover, *qing* divides from *xing*, yet *xing* is bound to *qing*; *qing* and *xing* depend on each other, returning to the principle of nature. This is called transformation arising from the true, where beginning and end follow one another.\"",
      "start_char": 1266,
      "end_char": 2188,
      "start_sentence": 65,
      "end_sentence": 113,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.10393214225769,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\学仙辨真诀.txt",
        "category": "玉诀类"
      }
    }
  ]
}