{
  "source_id": "宋西太乙宫碑铭",
  "source_file": "chunked_daozang\\宋西太乙宫碑铭.json",
  "total_chunks": 3,
  "total_original_chars": 1778,
  "total_translated_chars": 11593,
  "total_translation_time": 59.12154984474182,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\记传类\\宋西太乙宫碑铭.txt",
    "category": "记传类"
  },
  "full_translation": "**Inscription for the Western Taiyi Palace of the Song**\n\n*Scripture Title:* \"Inscription on the Bricks of the Eastern and Western Taiyi Palaces\"\n*Composed by:* Song Shou of the Song Dynasty\n*One chapter.*\n*Source:* *Daoist Canon of the Zhengtong Era*, \"Records and Biographies\" section of the *Dongshen* Department.\n\n**Inscription for the Western Taiyi Palace of the Song**\nComposed by Minister Song Shou, Hanlin Academician, Concurrent Reader-in-Waiting, and Judge of the Jade Clarity Luminous Response Palace\n\nIn the fourth generation of the Song, the sixth year of the Tiansheng reign, third month of spring, a Taiyi Palace was erected at the southwestern corner of the capital.\n\nAccording to the astrologers’ tradition, Taiyi resides to the right of the Gate of the Purple Palace, as the spirit of the Northern Asterism. It governs the laws of the sixteen spirits, weighing and balancing their authority to establish the imperial standard.\n\nThe masters of yin-yang declare Taiyi the emissary of the Primordial Sovereign, wielding the reckoning rod and upholding firmness to rectify the constancy of Heaven and Earth. It unifies the eight trigrams and solemnly completes the myriad things.\n\nThe Daoist tradition holds that the primordial *qi* originates from the One, which transforms into the Nine. Thus, Taiyi traverses the Nine Palaces. Its altars and ritual platforms for prayer and offering encompass the ranks of perfected immortals and their divine retinue. In ancient times, the Yellow Emperor governed the five *qi*, communed with the ten thousand spirits, and first devised the double divination template, exhaustively mastering its permutations. He established gates and appointed generals—harmonizing the signs of radiance and disturbance, determining the auspices of transverse and longitudinal lodgings, and the portents of fortune and misfortune. Posterity revered and illuminated these mysteries.\n\nThe invocations and titles of the deities number eighty-one in total, yet the revered spirits are ten, their names derived from the Ten Origins and Six Cycles, the Five Phases and Three Governances. Generally, they rest above in the stellar enclosure and follow below the palace origins; wherever they descend, their oversight is unwavering. They govern human affairs to foresee the future, aid the divine Dao to punish excess, ensuring none fail to prosper and flourish, while those who follow the Way receive no favor—scholars such as Zhang Heng, Li Yun, and Xiao Zixian have expounded upon this in detail.\n\nAmong the Five Fortunes, the first moves as Wood, embodies virtue as Benevolence, traverses the Five Palaces, and originates with the Five Celestial Stems. Every two hundred seventy cycles of the *jiazi*, it shifts its position. The palace begins at the *qian* position, rotating left through the three corners, arriving at the center, then circling anew. Beneath its path, there are no sounds of metal, armor, or the clatter of war; all things flourish abundantly, and the people live in joy.\n\nIn the eighth year of Taizong’s reign, the court astronomers calculated that in the *jiashen* year, the deity would depart the wilds of Liaojie and enter the lodge of *Dou-Niu*. Thus, a palace was constructed in the *xun* direction to await the arrival of the governing *qi*. The images of the Two Wanderers, Four Spirits, and Three Boards were set forth, demonstrating the rites of response. This was recorded in prior accounts and entrusted to the relevant offices.\n\nConsider how Emperor Wu of Han established the sacrifices to the Three Ones, adorning the halls and chambers. This practice extended to the Tang people, and after the *Qianyuan* era, altars were built in the capital’s outskirts, with the emperor personally conducting the rites. During the *Dali* era, an abbey was founded in Shicheng, its years commemorated in records—all these were clearly documented in official annals.\n\nAfter examining and refining these precedents, the rites were established as appropriate. On the days of the Four Outskirts’ Welcoming of *Qi*, sacrifices were conducted: the sacrificial animals were prepared, silk and jade offerings measured, and the invocators and scribes recited their words, while attending ministers bore witness. The ceremony was half the scale of the Grand Sacrifice.\n\nAt the Three Origins, elaborate offerings were made: incense burners, floral lamps, patterned silks, and blue-green banners. The ritual codes were proclaimed by the ritual leaders, and eunuchs assisted. The rites followed those of the *Lingbao* tradition.\n\nWhen Zhenzong ascended the throne, for all major state affairs, he first reported to the deities; for every court celebration, he personally paid homage. The emperor diligently upheld these grand rites, never neglecting the regular offerings. By the *wuchen* year of the dragon cycle, he departed from the Yellow Chamber, journeyed west to *kun-ou*, and acceded to the local petition to augment the sacrificial texts. At the outskirts, a separate altar was constructed. After divining the orientation and timing, it was situated a day’s journey near the Gate of Auspicious Autumn. To protect the state’s artisans and gather the laborers, materials were assembled, and all necessary items prepared.\n\nThe emperor appointed Zhang Huaide, Director of the Imperial Pharmacy, to oversee the project. Palace attendants Huangfu Jihe and Chen Yanda, of high and inner ranks respectively, supervised the construction. Skilled craftsmen applied their artistry, and the work was swiftly completed with divine efficacy. Four halls were built, each adorned with inscribed plaques. The Yellow Court stood at the center to honor the Great Wanderer, the Five Fortunes, and the Five Boards. Behind it, the Ningxi Hall was established to serve the Lesser Wanderer. To the east, the Yanji Hall housed the Celestial One and the Four Spirit Ministers’ Boards. To the west, the Ziyou Hall accommodated the Earthly One and the Direct Alignment Board. Additionally, the sacred and perfected spirits, the luminous constellations, and the mountain and river deities were depicted in intricate murals along the corridors for the accompanying sacrifices.\n\nThe main gates were named *Xianzhen*, *Yanhui*, and *Jingji*, while the separate hall was called *Qingxiu*, serving as the fasting quarters. Beyond these, auxiliary halls and lodgings totaled over four hundred. Thirty meticulously selected Daoist priests, including the *Yuanjing* Master Xu Sijian, were stationed there. The rituals and offerings followed the precedents of the *Yongxi* era.\n\nPreviously, the site had been confined to the *zhen* palace. After carefully transcribing the memorials, on the *renyin* day of late autumn, with the Three Caverns’ solemn rites and the Nine Divisions’ inner music, the images of the Wanderer Boards and deities were escorted to their respective halls.\n\nThe following day, the imperial carriage arrived. The emperor prostrated himself in reverence before the images. At dawn the next day, he personally attended to the empress dowager, joining her in paying homage. He appointed Zhang Shixun, Minister of Rites and Chief Councilor, as his emissary, outfitting him with the yellow banner and ceremonial regalia. The imperial guard, ten thousand strong, escorted the procession on foot to the palace gates. The assisting ministers saw them off beyond the palace gates. The two august personages then ascended the Chongguan Tower, and the imperial procession circled back, the imperial road cleared as they returned.\n\nThat evening, they rested at the New Inn. As the night watch ended and the sun began to rise, the emperor’s lodgings were prepared, and the fasting and offerings commenced. At the first light of the following month, the emperor returned again.\n\nOn the *dinghai* day of the second month in the seventh year, the empress dowager’s carriage followed. Wherever she passed, she inspected the fields and accompanied the ministers, issuing decrees to spread beneficence. She humbled herself without regard for personal loss, journeyed far without fear of toil, ever reverent and solemn.\n\nWhat is here recorded is this: our dynasty, descended from the enlightened, upholds sincerity and reverence, deepening its greatness. Our imperial ancestors, Taizu and Taizong, both received the bright mandate, diligently honoring the rites and cherishing the people. They bore the sum of all blessings, secured the favor of the myriad origins, and extended their vast legacy to our emperor. He inherits the august spirit of his ancestors, receives the virtuous teachings of the empress dowager, and governs with reverence and awe, ensuring peace and harmony—this has been so for many years.\n\nAs for the empress dowager’s illustrious sagacity, benevolence, and compassion, she shields and supports the emperor, upholding the trust of her predecessors. The emperor, in his wisdom, filial piety, and love, honors her maternal dignity, harmonizing all state affairs. In action, he considers precedent; in repose, he contemplates longevity. He purifies and elevates the Dao, illuminates and esteems culture. Thus, his fragrant virtue reaches above and below, rare treasures are offered in abundance, and auspicious omens respond. Yet he remains meticulous in assembling grand offerings, carefully observing the exorcisms, harmonizing the deities, and ordering the hundred rites. Where rites are due, they are fitting; what the spirits receive is abundant. Therefore, this magnificent and profound edifice is erected to manifest reverence, and its rich splendor is presented as tribute.\n\nThe old histories state: “The spirits of heaven and earth follow the king’s presence.” The sacrifices to the Four Directions are not fixed in name but adapt to their location—what difference is there between near and far?\n\nThe construction of these two temple-palaces invariably adheres to auspicious sites—could this not be because the king, ruling the Four Seas, cherishes the myriad clans, and in serving the Three Impartial Ones, acts without partiality? The breadth of blessings sought knows no bounds; how could the response of hidden truths and the descent of retribution be confined to one corner? Even the lands of *Chunwei* and *Jingluo*, though remote, stand to the right of the imperial domain. When timely bestowals are distributed, none is deemed unworthy. In serving the spirits and protecting the people, this is the utmost—thus, the institutions of the True Ancestor and the models of the Cultured Ancestor are those who excel in continuation and succession.\n\nThe subtle and wondrous workings of the profound are extended through the silent establishment of protection and support, while the utmost sincerity in reverence and esteem is proclaimed. The historian, following the imperial decree and relying on the texts, inscribes the stone, saying:\n\nBehold the majestic new palace, so solemn!\nThe wilds lie level, the qi lush and verdant.\nVast and resplendent, its glory blazes—\nThe spirits abide here in ease and delight.\n\nRoofs like clouds, tiles like scales, span the crimson heavens;\nDeep-hued curtains serve as mats, jade feasts spread wide.\nThe empty songs and feathered dances proceed in fragrant harmony,\nAll things complete, the sincerity pure and auspicious.\n\nThis abode of the celestial pivot faces the purple cosmos,\nEmbracing the myriad states under its blessed protection.\nMay our lord serve the Cultured Mother,\nAnd his longevity and prosperity equal the boundless heavens.\n\nThe *Stele Inscription of the Western Taiyi Palace of Song* is complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "宋西太乙宫碑铭 经名：东西太乙官砖铭。 宋代宋绶撰。 一篇。 底本出处：《正统道藏》洞神部记传类。 宋西太乙宫碑铭 翰林学士兼侍读学士玉清昭应官判官臣宋绶奉就撰 维宋四叶，天圣六年春三月，作太乙官于京城之西南陬。 星家之说，太乙在紫宫门右，北辰之神也。 掌十有六神之法度，参居权衡，以建皇极。 阴阳家之说，太乙为元皇之使，执计秉刚，正天地之常，兼统八卦，肃成万物。 道家之说，元气本於一，一变而之九，故太乙行九宫，其坛场祈醮，具真仙官属之品，在昔帝轩辕治五气，接万灵，肇创重式，究极其变，立门置将？ 与辉扰之候，纵横所舍，吉凶所主。 后世悉神而明之。",
      "translated_text": "**Inscription for the Western Taiyi Palace of the Song**\n\n*Scripture Title:* \"Inscription on the Bricks of the Eastern and Western Taiyi Palaces\"\n*Composed by:* Song Shou of the Song Dynasty\n*One chapter.*\n*Source:* *Daoist Canon of the Zhengtong Era*, \"Records and Biographies\" section of the *Dongshen* Department.\n\n**Inscription for the Western Taiyi Palace of the Song**\nComposed by Minister Song Shou, Hanlin Academician, Concurrent Reader-in-Waiting, and Judge of the Jade Clarity Luminous Response Palace\n\nIn the fourth generation of the Song, the sixth year of the Tiansheng reign, third month of spring, a Taiyi Palace was erected at the southwestern corner of the capital.\n\nAccording to the astrologers’ tradition, Taiyi resides to the right of the Gate of the Purple Palace, as the spirit of the Northern Asterism. It governs the laws of the sixteen spirits, weighing and balancing their authority to establish the imperial standard.\n\nThe masters of yin-yang declare Taiyi the emissary of the Primordial Sovereign, wielding the reckoning rod and upholding firmness to rectify the constancy of Heaven and Earth. It unifies the eight trigrams and solemnly completes the myriad things.\n\nThe Daoist tradition holds that the primordial *qi* originates from the One, which transforms into the Nine. Thus, Taiyi traverses the Nine Palaces. Its altars and ritual platforms for prayer and offering encompass the ranks of perfected immortals and their divine retinue. In ancient times, the Yellow Emperor governed the five *qi*, communed with the ten thousand spirits, and first devised the double divination template, exhaustively mastering its permutations. He established gates and appointed generals—harmonizing the signs of radiance and disturbance, determining the auspices of transverse and longitudinal lodgings, and the portents of fortune and misfortune. Posterity revered and illuminated these mysteries.",
      "overlap_context": "",
      "start_char": 1,
      "end_char": 277,
      "start_sentence": 0,
      "end_sentence": 13,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.761317729949951,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\宋西太乙宫碑铭.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "韶于祝号，总八十有一，而尊神则十，本乎十元六纪，五行三政而为其名。 大抵上憩於星垣，下循於宫元，所至之分，监观不武，统人事以知来，辅神道以祸淫，罔弗淑而克昌，畴惠迪而靡佑，则张衡、李云、萧子显之流，又言之详矣。 惟五福於行为木，於德为仁，其游五宫，其元五子，凡甲子二百七十而一徙。 宫起乾位，左旋历三隅，临中央，周而复始，行棋之下，无金革札痒之沙，物以丰阜，民用愉乐。 初太宗御极之八年，日官推策，当以甲申岁去辽碣之野，适斗牛之次，乃筑宫巽，维候气驭之来，并设二游四神三棋之像，示裒对之仪，度於前闻，志于有司。 粤若汉孝武立三一之祀，画诸台室，施及唐民，乾元后为坛於国郊，申之亲祭，太历中置观于石城，表以年纪，是皆章章於荣牍者。 稽参而损益之，制定其当，每四郊迎气之日，则展祠事，缅牲苑值，量币絮樽，祝史陈其辞，侍臣承焉，其礼半太杞分。 至三元，又备醮献，熏炉华灯，纹素青章，法倡宣其科，中人淮焉，其仪视灵宝。 真宗之嗣统也，国有大事，必先告之，朝有成庆，亦亲款之。 皇帝率循丕法，无废常荐，逮兹龙集戊辰，又自黄室，西趣坤噢，复乃从居乡之请，用增杞之文，就如其郊，别营坛治，审面吋卜，距宜秋门一舍而近，庇国工，搜蒸徒，聋材合土，备物致用。 上御药张怀德总其事，入内殿头皇甫继和、入内高品陈延达护其作，执技婵乎目巧，视成底乎神速，作为四殿，分揭华榜，黄庭峙于中，以尊五福君棋大游，宁禧绎于后，以奉小游，延既峨于东，以寓天一四神臣棋，资佑炼于西，以宅地一，直符民棋。 又采圣真景宿山川神灵，绩形缭廊，列於从杞，署重扉日显真、延辉、景集，标别殿日清修，为斋枝之所。 其外堂应众舍，总四百余区，择精炼道士，得元靖大师徐思简等三十人处之，祠醮仪法，率用雍熙之旧。 先时祇被震宫，审摹碎表，季秋壬寅，以三洞威仪，九部内乐，导君棋诸像，分真本殿。 翌日，乘舆临造，稽首瞻对，天正景至五福，移御之辰，乃近其像焉。 前一日之昕，上亲侍慈颜，同申谒拜，命礼部尚书、平章事张士逊持节充使，增以黄麾氅盹，武部辰旅，万乘步送至宫门，辅臣趋饯出阙外，二尊复升重观吗仙卫城回仗转清跸始还。 是夕，顿於新店，夜漏既尽，阳莆肇升，馆御即安，嗣以斋献。 来月生明之旦，帝又辈如。 七年二月丁亥，皇太后车驾继，往莫不省农扈，觞从臣，发禁则敷丽泽，屈己而不辞其损，涉远而无惮於劳，渠渠祇祗。 所敢述者，恭惟国家，神明之后，淳惧惇太，皇祖二宗，皆顾提明命，勤礼恤祖，荷百禄之总，介群元之祉，延洪于我皇，仰席祖考之宠灵，内禀太后之德训，虔巩寅畏，绥靖辑睦，累年于兹矣。 若太后之懿圣慈仁，拥佑帝躬，以承荷於先托，皇上之钦明孝爱，尊事母仪，以讲和於庶政，动必虑宪，居必思永，清冷以崇道，光华以右文，用能昭其馨香而格于上下，珍物荐至，嘉生乃报，而犹洁集盛，谨候禳，和诸神，秩百礼，礼所从者宜称，神所享者优裕，县是壮丽说深以表之，芯芬庶侈以羞之。 旧史云：天地之神，随．王所在。 又四望之祭，乃不即之名，因其方焉，奚有远迩之异。",
      "translated_text": "The invocations and titles of the deities number eighty-one in total, yet the revered spirits are ten, their names derived from the Ten Origins and Six Cycles, the Five Phases and Three Governances. Generally, they rest above in the stellar enclosure and follow below the palace origins; wherever they descend, their oversight is unwavering. They govern human affairs to foresee the future, aid the divine Dao to punish excess, ensuring none fail to prosper and flourish, while those who follow the Way receive no favor—scholars such as Zhang Heng, Li Yun, and Xiao Zixian have expounded upon this in detail.\n\nAmong the Five Fortunes, the first moves as Wood, embodies virtue as Benevolence, traverses the Five Palaces, and originates with the Five Celestial Stems. Every two hundred seventy cycles of the *jiazi*, it shifts its position. The palace begins at the *qian* position, rotating left through the three corners, arriving at the center, then circling anew. Beneath its path, there are no sounds of metal, armor, or the clatter of war; all things flourish abundantly, and the people live in joy.\n\nIn the eighth year of Taizong’s reign, the court astronomers calculated that in the *jiashen* year, the deity would depart the wilds of Liaojie and enter the lodge of *Dou-Niu*. Thus, a palace was constructed in the *xun* direction to await the arrival of the governing *qi*. The images of the Two Wanderers, Four Spirits, and Three Boards were set forth, demonstrating the rites of response. This was recorded in prior accounts and entrusted to the relevant offices.\n\nConsider how Emperor Wu of Han established the sacrifices to the Three Ones, adorning the halls and chambers. This practice extended to the Tang people, and after the *Qianyuan* era, altars were built in the capital’s outskirts, with the emperor personally conducting the rites. During the *Dali* era, an abbey was founded in Shicheng, its years commemorated in records—all these were clearly documented in official annals.\n\nAfter examining and refining these precedents, the rites were established as appropriate. On the days of the Four Outskirts’ Welcoming of *Qi*, sacrifices were conducted: the sacrificial animals were prepared, silk and jade offerings measured, and the invocators and scribes recited their words, while attending ministers bore witness. The ceremony was half the scale of the Grand Sacrifice.\n\nAt the Three Origins, elaborate offerings were made: incense burners, floral lamps, patterned silks, and blue-green banners. The ritual codes were proclaimed by the ritual leaders, and eunuchs assisted. The rites followed those of the *Lingbao* tradition.\n\nWhen Zhenzong ascended the throne, for all major state affairs, he first reported to the deities; for every court celebration, he personally paid homage. The emperor diligently upheld these grand rites, never neglecting the regular offerings. By the *wuchen* year of the dragon cycle, he departed from the Yellow Chamber, journeyed west to *kun-ou*, and acceded to the local petition to augment the sacrificial texts. At the outskirts, a separate altar was constructed. After divining the orientation and timing, it was situated a day’s journey near the Gate of Auspicious Autumn. To protect the state’s artisans and gather the laborers, materials were assembled, and all necessary items prepared.\n\nThe emperor appointed Zhang Huaide, Director of the Imperial Pharmacy, to oversee the project. Palace attendants Huangfu Jihe and Chen Yanda, of high and inner ranks respectively, supervised the construction. Skilled craftsmen applied their artistry, and the work was swiftly completed with divine efficacy. Four halls were built, each adorned with inscribed plaques. The Yellow Court stood at the center to honor the Great Wanderer, the Five Fortunes, and the Five Boards. Behind it, the Ningxi Hall was established to serve the Lesser Wanderer. To the east, the Yanji Hall housed the Celestial One and the Four Spirit Ministers’ Boards. To the west, the Ziyou Hall accommodated the Earthly One and the Direct Alignment Board. Additionally, the sacred and perfected spirits, the luminous constellations, and the mountain and river deities were depicted in intricate murals along the corridors for the accompanying sacrifices.\n\nThe main gates were named *Xianzhen*, *Yanhui*, and *Jingji*, while the separate hall was called *Qingxiu*, serving as the fasting quarters. Beyond these, auxiliary halls and lodgings totaled over four hundred. Thirty meticulously selected Daoist priests, including the *Yuanjing* Master Xu Sijian, were stationed there. The rituals and offerings followed the precedents of the *Yongxi* era.\n\nPreviously, the site had been confined to the *zhen* palace. After carefully transcribing the memorials, on the *renyin* day of late autumn, with the Three Caverns’ solemn rites and the Nine Divisions’ inner music, the images of the Wanderer Boards and deities were escorted to their respective halls.\n\nThe following day, the imperial carriage arrived. The emperor prostrated himself in reverence before the images. At dawn the next day, he personally attended to the empress dowager, joining her in paying homage. He appointed Zhang Shixun, Minister of Rites and Chief Councilor, as his emissary, outfitting him with the yellow banner and ceremonial regalia. The imperial guard, ten thousand strong, escorted the procession on foot to the palace gates. The assisting ministers saw them off beyond the palace gates. The two august personages then ascended the Chongguan Tower, and the imperial procession circled back, the imperial road cleared as they returned.\n\nThat evening, they rested at the New Inn. As the night watch ended and the sun began to rise, the emperor’s lodgings were prepared, and the fasting and offerings commenced. At the first light of the following month, the emperor returned again.\n\nOn the *dinghai* day of the second month in the seventh year, the empress dowager’s carriage followed. Wherever she passed, she inspected the fields and accompanied the ministers, issuing decrees to spread beneficence. She humbled herself without regard for personal loss, journeyed far without fear of toil, ever reverent and solemn.\n\nWhat is here recorded is this: our dynasty, descended from the enlightened, upholds sincerity and reverence, deepening its greatness. Our imperial ancestors, Taizu and Taizong, both received the bright mandate, diligently honoring the rites and cherishing the people. They bore the sum of all blessings, secured the favor of the myriad origins, and extended their vast legacy to our emperor. He inherits the august spirit of his ancestors, receives the virtuous teachings of the empress dowager, and governs with reverence and awe, ensuring peace and harmony—this has been so for many years.\n\nAs for the empress dowager’s illustrious sagacity, benevolence, and compassion, she shields and supports the emperor, upholding the trust of her predecessors. The emperor, in his wisdom, filial piety, and love, honors her maternal dignity, harmonizing all state affairs. In action, he considers precedent; in repose, he contemplates longevity. He purifies and elevates the Dao, illuminates and esteems culture. Thus, his fragrant virtue reaches above and below, rare treasures are offered in abundance, and auspicious omens respond. Yet he remains meticulous in assembling grand offerings, carefully observing the exorcisms, harmonizing the deities, and ordering the hundred rites. Where rites are due, they are fitting; what the spirits receive is abundant. Therefore, this magnificent and profound edifice is erected to manifest reverence, and its rich splendor is presented as tribute.\n\nThe old histories state: “The spirits of heaven and earth follow the king’s presence.” The sacrifices to the Four Directions are not fixed in name but adapt to their location—what difference is there between near and far?",
      "overlap_context": "nks of perfected immortals and their divine retinue. In ancient times, the Yellow Emperor governed the five *qi*, communed with the ten thousand spirits, and first devised the double divination template, exhaustively mastering its permutations. He established gates and appointed generals—harmonizing the signs of radiance and disturbance, determining the auspices of transverse and longitudinal lodgings, and the portents of fortune and misfortune. Posterity revered and illuminated these mysteries.",
      "start_char": 277,
      "end_char": 1494,
      "start_sentence": 14,
      "end_sentence": 36,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.53749465942383,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\宋西太乙宫碑铭.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "是二祠宫之建也，率不离於吉土，得非王者域四海，子兆姓，在奉三无私而已。 提福之广，靡不欲其遍及，冥真报降，岂局於一隅哉。 彼鹑味井络之疆，犹黄图之右，剑时敷锡，罄无弗宜，事神保民，厥惟至矣，则真祖之制法，文祖之相宇，其善述善继者欤。 精微之妙用，推保右之默定，扬钦崇之克诚，歌轮奂之全盛，史臣承诏据文，铭石曰：瞻穆穆兮新宫，野平夷兮气郁葱。 邈鸿纷兮赫妒，神之留兮安以豫。 云甍鳞瓦盘朱天，沈褕为席敷琼筵。 空歌羽被事熏然，物纯备兮诚吉镯。 宅璇枢兮临．紫宙，括万邦兮蒙福佑。 祚吾君兮奉文母，寿而昌兮等穹厚。 宋西太乙宫碑铭竟",
      "translated_text": "The construction of these two temple-palaces invariably adheres to auspicious sites—could this not be because the king, ruling the Four Seas, cherishes the myriad clans, and in serving the Three Impartial Ones, acts without partiality? The breadth of blessings sought knows no bounds; how could the response of hidden truths and the descent of retribution be confined to one corner? Even the lands of *Chunwei* and *Jingluo*, though remote, stand to the right of the imperial domain. When timely bestowals are distributed, none is deemed unworthy. In serving the spirits and protecting the people, this is the utmost—thus, the institutions of the True Ancestor and the models of the Cultured Ancestor are those who excel in continuation and succession.\n\nThe subtle and wondrous workings of the profound are extended through the silent establishment of protection and support, while the utmost sincerity in reverence and esteem is proclaimed. The historian, following the imperial decree and relying on the texts, inscribes the stone, saying:\n\nBehold the majestic new palace, so solemn!\nThe wilds lie level, the qi lush and verdant.\nVast and resplendent, its glory blazes—\nThe spirits abide here in ease and delight.\n\nRoofs like clouds, tiles like scales, span the crimson heavens;\nDeep-hued curtains serve as mats, jade feasts spread wide.\nThe empty songs and feathered dances proceed in fragrant harmony,\nAll things complete, the sincerity pure and auspicious.\n\nThis abode of the celestial pivot faces the purple cosmos,\nEmbracing the myriad states under its blessed protection.\nMay our lord serve the Cultured Mother,\nAnd his longevity and prosperity equal the boundless heavens.\n\nThe *Stele Inscription of the Western Taiyi Palace of Song* is complete.",
      "overlap_context": "he exorcisms, harmonizing the deities, and ordering the hundred rites. Where rites are due, they are fitting; what the spirits receive is abundant. Therefore, this magnificent and profound edifice is erected to manifest reverence, and its rich splendor is presented as tribute.\n\nThe old histories state: “The spirits of heaven and earth follow the king’s presence.” The sacrifices to the Four Directions are not fixed in name but adapt to their location—what difference is there between near and far?",
      "start_char": 1494,
      "end_char": 1753,
      "start_sentence": 37,
      "end_sentence": 46,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.822737455368042,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\宋西太乙宫碑铭.txt",
        "category": "记传类"
      }
    }
  ]
}