{
  "source_id": "延陵先生集新旧服气经",
  "source_file": "chunked_daozang\\延陵先生集新旧服气经.json",
  "total_chunks": 12,
  "total_original_chars": 11724,
  "total_translated_chars": 63746,
  "total_translation_time": 313.8874840736389,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\延陵先生集新旧服气经.txt",
    "category": "方法类"
  },
  "full_translation": "**Collected New and Old Qi-Absorption Classics by Master Yanling**\n\n*With Commentary by Sangyuzi*\n\n**General Principles of Cultivation**\n\nThe *Scripture of Immortal Perfected Ones* states: When a person nears death, they begin to cherish their body; when guilt is already determined, they think of reforming; when illness has taken hold, they turn to medicine. Yet the net of Heaven has already been cast—how can one escape? Thus, the wise and superior persons cherish life before it is imperiled, fear calamity before it sprouts, and remedy illness before it arises.\n\nThere are three grades in the cultivation of the Dao: the upper years, the middle years, and the lower years.\n- The *upper years* refer to ages twenty and thirty. Those in their upper years awaken early to the Great Dao, discern its profound mysteries, and possess robust marrow, sturdy bones, full sinews, and plump flesh. Proceeding with ease along the Way, they achieve success without fail.\n- The *middle years* refer to ages forty and fifty. Those in their middle years awaken to the Dao belatedly, with sinews, flesh, bones, and marrow each diminished by half. Their progress is uncertain, like laboring at midday.\n- The *lower years* refer to ages sixty and seventy. Those in their lower years retain but two or three parts of their bones, marrow, sinews, and vessels. Yet they may still be restored through cultivation, like working at dusk.\n\nThose above eighty have already settled their karmic fate, and no method can save them. Their brains are exhausted, their marrow spent, their myriad gates desiccated, their spirit departed, and their qi extinguished—they walk like corpses and move like ghosts.\n\nSangyuzi remarks: A corpse is likened to one without awareness; a ghost, to one with awareness yet devoid of human sentiment. To walk like a corpse, to move like a ghost—who, then, animates them? One knows that the primordial qi still lingers, though diminished and nearing its end. If such a one encounters a perfected being and obtains the Great Elixir, it is like holding a cartload of withered reeds to the last flicker of a dying flame—yet it may still blaze forth in brilliance. Thus, when it is said that none can be saved, it refers only to those for whom qi cultivation has come too late; their own affairs are beyond remedy. But if a transcendent sage intervenes to preserve their life, even the dead may rise, their flesh and bones reviving from withered husks—what is there that cannot be done? Even in death, they remain part of the realm of things.\n\nThe ancient worthies and superior persons, knowing the fleeting nature of life like a candle in the wind, restrained their wills and mastered their emotions. Forsaking glory and abandoning worldly attachments, they dedicated their bodies to the Dao, refusing to let external things cause harm.\n\nThe Dao is qi. Qi is the root of the body. As fish die when parted from water, how can humans endure when severed from the Dao? Therefore, those who preserve life must devote themselves to cultivating qi; those who cherish qi must devote themselves to preserving essence. When both essence and qi are preserved, this is called safeguarding the True.\n\nHumans possess three cinnabar fields: the Upper, Middle, and Lower Elixir Fields.\n- The *Upper Elixir Field* is the brain, also called the Muddy Pellet.\n- The *Middle Elixir Field* is the heart, also called the Crimson Palace.\n- The *Lower Elixir Field* is the Sea of Qi, also called the Gate of Essence.\n\nWithin each of the Three Origins resides a spirit.\n\nSangyuzi remarks: Essence transforms into qi, and when qi takes form, spirit gathers therein. What is spirit? It is the name for numinous illumination. When one fully comprehends the transformation of qi, and qi is whole, then spirit is whole. If primordial qi fills the body, the hundred bones and myriad apertures will naturally be replete with spirit. This repletion is nothing other than qi arriving and spirit following. When people today face worries and hardships, their awareness momentarily falters when distress strikes—this is because qi is obstructed and fails to arrive. If the mind is serene and qi harmonious, how could spirit be confined to the Three Origins alone?\n\nEssence is the root of the body; the root is the abode of qi. When essence is whole, qi is whole; when essence is depleted, qi is depleted. When qi is depleted, spirit departs, riding upon it. Thus, essence and qi must both be preserved.\n\nThe *Yellow Court Scripture* states:\n*For long life, be most cautious in the chamber’s haste,*\n*Why cause death and make the spirits weep?*\n*Instead, absorb qi and gather the essence of the child,*\n*An inch of field, a foot of dwelling—thus govern life.*\n*If you drain the sea and empty the hundred streams,*\n*The leaves fall, the tree withers, and verdure is lost.*\n\nThus, the ancient worthies who attained the Dao all succeeded by cherishing qi and preserving essence.\n\nQi absorption is fundamentally called *embryonic breathing*. Embryonic breathing resembles an infant in the womb: for ten months, it does not eat yet grows and matures, receiving the upright qi. Without thought or念, utterly still and serene, it takes in primordial qi, transforming its joints and viscera, all naturally accomplished. How could it require the protection of a nurse or preparations for hunger and thirst? Upon emerging from the womb, it immediately inhales external qi, and with its cries, experiences dryness and dampness, hunger and satiety—seeming to harbor thoughts—and thus loses its primordial qi.\n\nIf one can emulate an infant in the womb, absorbing internal qi, grasping firmness and guarding unity, this is called *embryonic breathing*.\n\nSangyuzi remarks: To say that inhaling external qi results in the loss of primordial qi is incorrect. If this were so, no living persons would remain in the world.\n\nThe *Lotus Sutra* states: *Whether walking, standing, sitting, or lying down, let body and mind be undisturbed.* It also speaks of qi as the master of the mind: when the mind is perverse, qi is perverse; when the mind is upright, qi is upright. All human actions—raising a hand, moving a foot, joy, anger, sorrow, and delight—arise from the mind. The mind’s movements and stillness are all responses of qi to intention. Intention follows the mind; when the mind is harmonious, qi is whole, and when qi is whole, spirit is whole. When qi is cut off, spirit perishes; when spirit perishes, one becomes mere dust.\n\nThus, physicians first examine the pulse to assess the qi of the five viscera and four seasons, investigate the sources of illness, and only then prescribe remedies. If one can discern the signs of qi, regulating inhalation and exhalation through the mouth and nose without momentary lapse, the five viscera will naturally harmonize, the pulse will regulate, and qi will flow smoothly.\n\nThe human body aligns with heaven and earth, blending yin and yang in its qi. From skin and bone marrow to the viscera and the constructive and defensive systems, from the rhythms of breath to the shifts of cold and heat, all correspond to the Two Modes and resonate with the Five Phases.\n\nThus, when heaven and earth are in disharmony, the qi of yin and yang becomes disordered, the viscera fall out of balance, and the signs in the meridians manifest as illness. External afflictions arise from wind, while internal disorders stem from qi. As it is said: \"In serenity and emptiness, true qi follows; with spirit guarded within, whence can illness come?\" Truly so!\n\nTherefore, one must understand the principles of form and spirit, nurturing and preserving them, discerning internal and external ailments, and cultivating them with care. Qi Bo the Eminent said: \"Those who consume qi become numinous and long-lived; those who consume grain gain wisdom but shorten their lives.\"\n\nWhat, then, do practitioners of qi cultivation seek? Through their efforts, qi transforms into blood, blood into essence, and essence into marrow. In one year, qi is renewed; in two, blood; in three, the meridians; in four, the flesh; in five, the marrow; in six, the sinews; in seven, the bones; in eight, the hair; in nine, the form. Then, the thirty-six thousand spirits within the body transmute into a true immortal, known as a *zhenren*.\n\nThus, the subtleties of intention lie in the profound and unfathomable. Those who cultivate the true are of three ranks, each differing in their approach and disposition.\n\nThe highest rank consists of those whose nature is empty and at ease, whose will is pure and refined, whose words align with the Dao, and whose conduct is flawless. Such individuals possess the innate capacity of past ages—like a stone cast into water, they are beyond comparison.\n\nThe middle rank includes those who may hold high office or live in remote places, who enjoy wealth or prestige, or who waver between advancement and retreat. When they hear the Dao, they are restless even in sleep; when they pursue fame, their thoughts race all day. As their two minds contend, the victor prevails, but in hesitation, six or seven out of ten are lost.\n\nBelow the middle rank are those whose time has passed, whose twilight years bring frailty, whose sinews weaken, and whose spirit fades. Though they may still enjoy wealth, the sun nears its setting, and in hindsight, they gnaw their navels in regret, only then seeking the right path. Even at this stage, if they rouse their will with precision, they may yet salvage one or two parts of themselves. These are the sorrows the sages of old bequeathed to later generations—may you examine their roots and cultivate true faith.\n\n**Master Zhang Guo’s Qi-Absorption Method**\nLie supine daily, calm the mind, and banish thoughts. Hold the breath, clench the fists, inhale through the nose, and exhale through the mouth, ensuring no sound reaches the ears. The breath should be fine and subtle; when full, close it off until sweat appears on the soles of the feet. Begin with one or two breaths, then increase to a hundred or more. When stifled, draw in a slight breath and resume closure. Use hot exhalations (*he*) and cold exhalations (*ling* or *chui*) to regulate. With one or two thousand breaths, one may cease taking grain and dispense with medicine. Occasionally drink a cup or two of good wine or fresh water to clear the intestines. At five thousand breaths, one gains efficacy in all endeavors and will know it intuitively—then one may sleep in water!\n\nIn the practice of qi-absorption for longevity, consistency is paramount. Only when true qi descends can resonance occur. How can one indulge in desires and yet hope for transcendence as a feathered immortal? Such a thing does not exist. Even immortals whose merit and conduct are incomplete cannot achieve this—how much less can ordinary mortals? Yet if you trust in the old master and practice diligently, you will come to know it for yourself.\n\nWhen qi does not flow smoothly, it may be too cold, too hot, too slow, or too rapid—adjust it until harmony is achieved.\n\n**Master Luan’s Qi-Absorption Method**\nFirst, sit on a broad seat, place both hands on the knees, loosen clothing and belt, and relax the limbs. Contemplate the equal nature of dharmata and the non-duality of life and death. After half a meal’s duration, close the eyes, raise the tongue to the palate, and slowly exhale long breaths—one, then two. Initially, others may hear the sound of the breath entering and leaving, but gradually it becomes finer. After ten or more breaths, one may hear it oneself.\n\nWhenever pain or itching arises, visualize it exiting from that spot. If any abnormality is sensed, gradually lengthen the exhalation, refining it from coarse to fine. After ten breaths, return to the initial state.\n\nSomeone asked: \"Why begin with coarse breaths that gradually refine, and at the end, return from fine to coarse?\"\n\nMaster Luan replied: \"All movement, sight, food, and speech are coarse. As Sangyuzi said: 'For those learning qi cultivation, whether before practice or after, eating, drinking, and speaking are ordinary matters.' I wish to ensure continuity, preventing abrupt disjunction between beginning and end.\"\n\nAfter waking from sleep, resume the practice as before, like a tiger carrying its cub—neither too urgent nor too slow. Regardless of cold or heat, first purify the room to prevent distractions and quiet the mind.\n\nHe also said: \"How to discern disharmony in the Four Great Elements? Observe the lips and mouth: cold indicates excess wind; heat, excess fire; roughness, excess earth; slipperiness, excess water. If neither cold nor hot, neither rough nor slippery, they are in harmony.\n\nOr listen to the voice: sound indicates excess wind; movement, excess panting; itching, excess heat; drool, excess water. If there is no sound, no movement, no itching, no drool, they are in harmony.\n\nOr observe the mind: vexation indicates heat binding; confusion, wind binding; anxiety and palpitations, panting binding; restlessness, water binding. If there is no vexation, no confusion, no palpitations, no restlessness, they are in harmony.\n\nDisharmony in the Four Great Elements arises from two sources: external or internal. Cold, heat, hunger, satiety, fatigue, and exhaustion are external causes; fame, profit, joy, anger, sound, color, flavor, and contemplation are internal causes.\n\nIn regulating qi, follow nature, maintaining it as if it were continuous yet not forced. Simply not taking life as life is wiser than nurturing life.\"\n\nSangyuzi said: \"All scriptures advise that in exhalation and inhalation, one should not hear one’s own breath. Yet Master Luan speaks of exhaling coarsely and gradually refining, then refining and gradually coarsening—I was deeply puzzled. Upon reading further, where it says 'follow nature,' I realized that the gradual progression from coarse to fine is the lowest level of practice, designed to avoid forcing it to compete with nature.\"\n\nYet the highest attainment lies in subtlety so refined that one no longer hears one’s own breath—proceeding from the finest subtlety to the point of no-breath, this is the full realization of fetal respiration. I fear that even after learners reach this stage, they may remain bound by the written word, fixating on the sequence of coarse and fine, and thus turn against the natural Way—how lamentable! In this matter, how could one fail to discern clearly?\n\n**Li Fengshi’s Mountain Recluse Qi-Swallowing Method**\nWhenever you wish to swallow qi, do so as an infant suckling milk: when the breath feels stifled, swallow it; then continue suckling and swallowing. If the stifling becomes severe, release it through the mouth, but always keep it exceedingly subtle. With each swallow, use the mind to guide it down to the navel; if there is illness, direct it to the afflicted area.\n\nWhen practicing, first close the eyes and focus the mind, clench the fists to stabilize spirit and qi, then begin. First perform *daoyin* to relax the four limbs, and only then proceed. For external qi-swallowing, do not use a pillow; stretch out the hands and feet, and remain composed. If the illness is severe and the qi feels extremely stifled, repeatedly raise it to the utmost, then clench the fists again, swallow the qi, and take one more breath. When the qi flows smoothly and sound emerges from the ears, success is achieved. Guard this! Guard this well!\n\nThis is internal qi—practice it regardless of early or late, clear or overcast weather. Generally, clear days yield the greatest essence; if swallowing external qi, one encounters both life-giving and death-dealing qi. Know this: if you practice for ten years but skip five days, it will be of no benefit.\n\nEach day at dawn and noon, take the first dose, then refine and compress it, pressing with the hands to prevent hardness below the heart and abdomen.\n\n**The Sage of Mount Meng’s Qi-Swallowing Method**\nLie on your right side, with the right flank resting on the mat, slightly drawing in the feet and aligning the head to face south. Clench both fists and place them beside the cheeks. Close your eyes, inhale internal qi, forcefully open the throat, and swallow—seven swallows, then exhale once. When ill, swallow once or twice, then exhale once. Once adept, you may swallow seven or fourteen times before exhaling.\n\nNext, regulate the breath to ensure even inhalation and exhalation, then swallow again as before, for a total of forty-nine swallows. Then rise and sit upright. Sit with knees bent, clasp the hands together and hold the knees, hold the breath, and distend the abdomen—fourteen or twenty-one times. When the qi is full, exhale, then regulate the breath again, taking care not to become breathless or weak. Once regulated, hold the breath again—fourteen or twenty-one times—before exhaling, until the abdomen feels harmonious and comfortable. Rest when done.\n\nIf sweat emerges and both head and feet grow warm, the qi has circulated throughout. Then you will always feel sated and full, the Three Passes and hundred joints will flow freely and comfortably. Practice this for ten years, and you will ascend as an immortal, growing old yet retaining a youthful countenance.\n\nThe ancient scriptures all employ visualization, but this may prove laborious and hinder the mind’s progress. Qi-swallowing originates in fetal respiration—simply free yourself from thoughts, and you will naturally align with the transformative power of the primordial. Practice long enough, and you will come to know its wonders for yourself.\n\nWhile traveling on Mount Meng, I encountered this sage, who appeared to be under fifty, yet his spirit was clear and luminous, quite unlike ordinary folk. When I asked, he said he had roamed this mountain before the *Zhenguan* era, refusing to give his name and calling himself simply \"Old Man.\" I bowed earnestly and entreated him, and he graciously imparted this secret. Practicing it has brought me great benefit. Wondrous indeed!\n\nAh! For those who wish to attain deathlessness, let the intestines be free of waste, and in an instant, impurities will vanish. To achieve long life, let the five viscera be radiant with essence. Thus, the *Huangting* states: \"Why not consume the qi of Great Harmony and its essence? Then you may enter the Yellow Tranquility and never die.\" The *Yin Fu* says: \"Accumulated fire can burn away the Five Poisons.\" The Five Poisons are the five flavors, and mastering the five flavors can lead to long life. The Queen Mother of the West told Emperor Wu: \"Those who can augment and transform are recorded in the registers of the highest immortals. Those who neither augment nor transform cannot escape the calamity of death.\" This augmentation and transformation mean the ability to replenish essence and renew the form. By constantly cherishing essence, grasping firmness, closing the breath, and swallowing fluids, qi transforms into blood, blood into essence, essence into fluid, and fluid into bone. Practicing this without weariness, the spirit becomes full and abundant. In the first year, the qi is renewed; in the second, the bones; one text says the blood. In the third year, the blood is renewed; one text says the vessels. In the fourth, the flesh; in the fifth, the sinews; one text says the marrow. In the sixth, the marrow; in the seventh, the bones; in the eighth, the hair; in the ninth, the form. After ten years, the Dao is accomplished, and one attains the rank of Perfected. With free transformation, spirit officials and jade maidens will attend you.\n\nWang’s *New Methods of Qi-Swallowing for Mountain Recluses*:\nZixia said: \"Those who consume qi become spiritually luminous and long-lived.\" The *Huangting* states: \"The Jade Pool’s pure water irrigates the numinous root; if you can cultivate this, you may endure forever.\" In Buddhist *śamatha-vipaśyanā*, there is a method using qi to heal illness, showing that qi and fluids mutually nourish one another. Ancient scriptures prescribed specific times for practice, but now, in discussing qi consumption, we no longer adhere to fixed times. Fluids should constantly assist qi to keep it smooth and harmonious. What is called \"consuming qi\" refers to internal qi, swallowing it in place of food. Fluids are swallowed in place of drink. Above, one consumes fresh qi; below, one expels old qi, pushing out the stale and taking in the new. Swallowing qi need not be to fullness, nor must the expulsion be constant—simply ensure it is odorless, and equilibrium will naturally be achieved. Swallowing qi need not be frequent; when the qi is clear, the abdomen will naturally settle. Thus, there is no need for fullness. When beginning, eat when hungry, and stop when not. While eating, always follow with one or two swallows of qi to aid digestion. As food gradually diminishes, increase the number of swallows until the food is gone and the qi naturally descends. If you feel the qi slightly obstructed in the abdomen, either walk or stand, turning to the west, and use intention to drive it downward. If it does not descend, do not rush or force it; simply use intention to dissolve it, and soon it will naturally be expelled. When consuming qi, if you need to belch, let it come freely—do not suppress it. Sangyuzi said: \"Those with shallow practice belch often, for they have just begun and obtained little true qi, so the new qi is abundant but unrefined. The life-officials cannot receive it, so it should be gradually refined.\" Moreover, when first practicing, the swallowed qi often fails to reach the *qi* sea, leaving it nowhere to settle, so it rises back up as belching. If the internal qi enters the *qi* sea, belching naturally ceases. If, after practicing for a long time, belching suddenly recurs, it is either due to overeating or the accidental intake of external qi. If you need to expel it downward, let it go—do not hold it back. Proceed with careful attention, adjusting for fullness and emptiness, and in time, you will grasp its wonders.\n\nIt is advisable to walk and perform gentle *daoyin* exercises, but do not do so too frequently. In all worldly matters, proceed with thoughtful deliberation. For illnesses, fast for three to several days; for mild cases, one or two days suffice, or even just a short while. If the illness is in the upper body, use intention to drive it upward; if below, drive it downward. For ailments in the limbs or on the left or right sides, use intention to expel them, and you will recover. Above all, do not hold the breath, for doing so will generate illness. The foods consumed should be moist and smooth, suitable for all seasons. During miasmic fevers, simply fast for several days and rest quietly to recover.\n\n*Methods of Qi Utilization by the Great Dignitary Master Xuan Su, the Perfected*:\nIn all methods of using qi, first perform *daoyin* exercises to the left and right, loosening the joints, softening the sinews, and relaxing the body. Then sit upright, exhale and inhale three times to eliminate blockages, calm the mind, and forget the body, allowing the breath to settle. After a long while, slowly exhale turbid qi through the mouth and draw in clear qi through the nose, repeating this six or seven times—this is called \"regulating the qi.\" Once regulated, close both mouth and nose, hold the breath lightly, and fill the mouth with qi. Swish it in the mouth fifteen times or more for better results. Swallow it as if taking a large gulp of water, directing it with the mind to the *qi* sea. After a long while, swallow again in the same manner, continuing until the abdomen is full, without limiting the number of swallows. Then empty the mind and fill the abdomen, close the mouth, and massage the abdomen with both hands to circulate the qi. Gently release the breath through the nose, ensuring it does not become labored, lest harmony be lost. Then lie flat on your back, keeping the body level, with the pillow at the same height as the body. Clench the fists, extend the arms four or five inches from the body, and space the feet four or five inches apart. Then inhale through the nose, close both mouth and nose, and focus the mind on the qi circulating throughout the body—this is called \"circulating the qi.\" If there is illness, direct the qi to the affected area. If the qi becomes urgent, gently release the breath through the nose without opening the mouth. Once the breath is calm, close it again as before. Shake the toes and fingers, along with the joints, until sweat appears—this is called \"qi passage.\" Then slowly roll onto your side, draw up the legs, first lying on the left side for ten breaths, then turning to the right side for another ten breaths—this is called \"repairing deficiencies.\"\n\nAfter practicing this method for a month, whether standing or sitting at any time, whenever the abdomen feels empty, perform the swallowing technique without regard to time or season. After eating, take one or two mouthfuls of plain rice, mix it with water, and swallow—this is called \"washing the five viscera.\" Then rinse the mouth thoroughly with clean water, keeping the mind empty and the abdomen full, allowing the visceral leaves to unfold. Swallowing in this way prevents the five viscera from retaining the qi of the five flavors. Once done, first exhale turbid qi through the mouth, then draw in clear qi through the nose, without limit to the amount, until fully released. If a turbid qi is expelled downward, immediately replenish it by swallowing a mouthful of harmonized qi. When eating cakes or drinking tea, external qi enters; as soon as it does, close the mouth. Once closed, the external qi that entered the mouth should be expelled through the nose. The qi drawn in through the nose is then clear qi. Always keep the mouth closed while eating to prevent external qi—dead qi—from entering. Whenever speaking, qi exits through the mouth, so it must be drawn back in through the nose—this is the constant practice of exhalation and inhalation.\n\nIn all postures—walking, standing, or sitting—constantly wiggle the toes, for this is called \"allowing the qi to flow downward.\" Persist in this practice, whether in motion or stillness. If, due to imprecise timing, external qi enters the abdomen and causes slight pain, close the breath and rub the abdomen one hundred times to guide the qi downward. If the qi rises and must not be expelled, press it downward—this is called \"regulating and harmonizing.\"\n\nAvoid foods that disrupt qi, as well as raw, cold, dry, or greasy items. If this method is practiced without interruption, after nine years of cultivation, one will walk on emptiness as if on solid ground and tread upon water as if on land.\n\n**Preface and Secret Instructions on Embryonic Breathing**\n\n**Preface:**\nWhile in the womb, one is an infant; at birth, a child. The infant in the womb, its mouth filled with earth, breathes not through the nose or mouth but draws qi through the navel to nourish its form, thus achieving completion. Therefore, the navel is the Gate of Life. If a newborn appears alive but then suddenly fails, simply soak the umbilical cord in warm water and apply it to the abdomen three to five times to revive it. This confirms that the navel is indeed the Gate of Life, a truth beyond doubt.\n\nThose who seek embryonic breathing must first understand its root. By following this principle, one’s breathing becomes like that of an infant in the womb—hence the name \"embryonic breathing.\" Thus, returning to the origin and reverting to infancy has its reason. With unbroken practice, the Dao of the embryonic immortal is achieved. Therefore, the preface clarifies both the essence and application.\n\n**Instructions:**\nTo practice embryonic breathing, first enter a quiet chamber where no one may disturb you. Sit upright, place the left foot over the right, loosen the clothing and belt, and gently press and stretch the joints. Clench the fists and rest them on the thighs. Perform three to five cycles of exhalation and inhalation to eliminate stagnation. Calm the mind, empty the heart, and fill the abdomen. Slowly sway the body left and right to unfold the visceral leaves. Once done, return to a steady posture. Then strike the \"Heavenly Drum\" thirty-six times, rinse the mouth with the \"Flower Pool,\" and begin visualization.\n\nImagine the Vermilion Bird above the head, the Dark Warrior beneath the feet, the Azure Dragon on the left shoulder, and the White Tiger on the right. Next, visualize a point one inch behind the space between the eyebrows as the \"Hall of Light,\" two inches inward as the \"Cavern Chamber,\" and three inches inward as the \"Palace of the Cinnabar Field,\" also called the \"Mud Pill Palace.\" Within this palace resides a spirit two inches tall, wearing a green crown, clad in red-brown robes, and holding a crimson tablet.\n\nNext, visualize the Middle Cinnabar Field—the heart, also called the \"Crimson Palace.\" Within it dwells a spirit similarly robed in red-brown. Then visualize the Lower Cinnabar Field, located two and a half inches below the navel in the \"Purple Tenuity Palace,\" also known as the \"Sea of Qi.\" Within it resides another spirit, also clad in red-brown.\n\nNext, visualize the five viscera, beginning with the heart, and extend the visualization to the five viscera and six bowels. From each viscus, emit its corresponding directional qi, merging with the white clouds from the three cinnabar fields into a single qi that rises from the crown, radiating nine-colored light to a height of three *zhang*. Envision the body within this luminous sphere.\n\nAt this point, close both mouth and nose, focusing the mind on the Sea of Qi. Let the embryonic qi enter and exit, with breathing confined to the navel. If the qi becomes urgent, gently release the breath through the nose, and once the qi is calm, resume the practice as before. Sweating marks the completion of one cycle, though the number of cycles is not fixed. If the body feels hot or stifled, direct the qi to flow throughout the body like steam rising from rice—this is called \"full breathing.\"\n\nWith prolonged practice, one enters profound stillness and emerges into wondrous silence, clearly perceiving the five viscera and six bowels within the body, as well as the upper and lower abdomen. The stomach, filled with dispersed fat, appears yellow like earth. The spleen, one foot two inches long, lies above the stomach, constantly grinding back and forth; if it stops, harmony is lost, and food is not digested—this indicates it is not grinding. In such cases, close the breath and rub the abdomen one hundred times to restore its natural movement.\n\nNext, visualize the heart: it resembles an unopened red lotus, three inches long, hanging downward, with nine orifices—two at the back—and seven black hairs, two and a half inches long, on its front. Then visualize the lungs: they resemble an open white lotus with five hanging petals, covered by white veins and membranes, resting above the heart. Next, visualize the liver: located behind the heart, it has seven purple-green leaves with yellow veins and membranes, with the third leaf on the left side being its position. The gallbladder is green-yellow and two and a half inches long. Then visualize the kidneys: shaped like an inverted cup, black in color, attached to the spine three inches from the navel, smaller above and larger below, with the left kidney above and the right below.\n\nSurvey the entire body—thirty-six positions and three hundred sixty joints—all bound by sinews. The bones are jade-like in their blue-white hue, the sinews yellow-white, and the marrow like ice and snow. There are three hundred sixty acupoints, each filled with fresh blood like rivers, lakes, and ponds.\n\nObserve further that the second joint of the middle toe on the left foot is the source of the bloodstream. From there, it surges forth, flowing through the body in a single day and night, circling thirty-six thousand times before reaching the second joint of the middle toe on the right foot, where it is fully transformed. Thus, when one sleeps, one must lie on the side with limbs curled—this preserves the yin *po*. Upon awakening, one should stretch the feet and hands, allowing the *qi* to permeate the entire body, thereby spreading the yang *qi*.\n\nBy practicing thus, one aligns with the meaning of \"acting in accord with the good times\" as spoken in the classics. With prolonged practice, both mouth and nose cease their breathing, as if one were an infant in the womb, drawing *qi* through the navel—this is called \"embryonic breathing.\" Uninterrupted, after thirty years, one may bind a cord around the neck without obstructing breath, nor will there be any panting. The breath remains in the navel, and one may sit underwater for ten days—or five days—with equal ease. Having mastered this, the effects are as described above. Once the truth of this is realized, one must further cultivate the Dao; this practice is but one gateway and cannot be neglected.\n\n*The Subtleties of Embryonic Breathing*\nThe Old Lord said: \"One who knows the Dao is not slain by Heaven; one who embodies virtue is not harmed by Earth. Embracing both Dao and virtue, the body does not decay. Internally nourishing the Great Harmony, with primordial *qi* as the foundation, refining oneself in stillness, relinquishing the body and releasing the form, the mind free of thoughts and cares, the viscera settled and stable—thus one penetrates the Great Harmony. Long life and enduring vision arise when the *qi* lies hidden and unmoving, the mind like flowing water, where the preceding wave departs and the succeeding wave follows without return. Practicing without cease, one attains the true Dao.\"\n\nEach day, enter a quiet chamber to guard the Mysterious Origin. The Mysterious Origin refers to preserving the Mysterious Gate. Within the Mysterious lies the yet more Mysterious—this is my life. Within life lies life—this is my form. Within form lies form—this is my essence. Within essence lies essence—this is my *qi*. Within *qi* lies *qi*—this is my spirit. Within spirit lies spirit—this is my spontaneity.\n\nVirtue rides the chariot of form; the Dao rides the steed of *qi*. The *hun* is rooted in essence; the *po* dwells in the eyes. When the form is wearied, virtue scatters; when *qi* strays, the Dao rebels. When essence wanes, the *hun* is harmed; when the eyes stir, the *po* weakens. Thus, one guards stillness and cherishes *qi*, preserves essence and treasures spirit, so that Dao and virtue congeal and coalesce, while *hun* and *po* remain steadfast.\n\nTherefore, one who embodies the Dao speaks not, yet grasps the truth of *qi*; the skin becomes lustrous, the root of attaining the Dao. Hands and feet perspire, essence and *qi* overflow, hunger and thirst vanish—like the tortoise and dragon, one achieves embryonic breathing, ceaseless and enduring, effortlessly sustained. One drinks from the Mysterious Spring and ascends to the Great Clarity, returning to youth and reverting to infancy—such is the spontaneity of the Dao.\n\nThe Supreme Dao is not distant; it lies within one’s own body. With a mind refined and subtle, life is eternally preserved. As for the Dao, some transmit the practice of ingesting the Five Sprouts—the Five Sprouts being the generative *qi* of the Five Phases. *The Yellow Court Inner Scene* states: \"Preserve and rinse with the Five Sprouts to banish hunger and thirst.\" Absorb the *qi* of the eight directions, four seasons, sun, moon, and stars, envisioning it entering through the crown and exiting through the nose. Though ancient classics record this, few who practice it achieve success, nor is it attainable for those who consume grains.\n\nThus, many who practice *qi*-ingestion fail to grasp its secrets, laboring in vain. Once the gateway is found and the secrets comprehended, success lies in diligent and unrelenting practice. Sang Yuzi said: \"To crane like a crow or seagull, aspiring to Heaven and Earth, is to overreach—those teachings on the Five Sprouts, eight directions, four seasons, sun, moon, and stars are not meant for beginners. Without attainment, they are futile; one must wait until one has drawn somewhat nearer.\"\n\nFor embryonic breathing and *qi*-ingestion, begin after midnight, swallowing the internal *qi* seven times. With each swallow, regulate the breath for six or seven cycles before swallowing again. Each swallow should sound like water flowing over rapids—this indicates the *qi* is unobstructed. Direct it straight down to the *qi* Sea, where it congeals in the abdomen, filling it like a womb with child. The breath then arises from within this \"embryo,\" and only when the *qi* Sea is replete does the Way of embryonic breathing take form. When the *qi* is perfected, the pure *qi* congeals into an embryo, while the turbid *qi* disperses outward—through the hands, feet, and hair.\n\nOnce the embryo is formed, all illnesses naturally depart, and one gradually communes with the immortals. Those who study *qi*-ingestion today may obtain ancient methods or receive instruction from unorthodox sources, merely closing the mouth and constricting the nose, prizing long breaths while remaining ignorant of the blockages in the five viscera, which damage the upright *qi*. Such practices are far from natural breathing, only wearying body and spirit without benefit.\n\nWhen ingesting *qi*, the joints must be open, the Stomach Sea receptive to primordial *qi*. Once the *qi* is firmly gathered, the joints close again, and one slowly exhales and inhales external *qi* through the nose, ensuring no mingling of internal and external *qi*, nor any leakage of the embryonic *qi*. Silently count the breaths by curling the fingers, from ten to a hundred, then from a hundred to two hundred, three hundred—this is the \"lesser circulation.\" The ears and eyes become keen, and all illnesses are cured. To forcibly block the mouth and nose in an attempt to practice embryonic breathing is entirely misguided. If the mouth and nose are obstructed, the viscera are harmed—what benefit could there be?\n\nFor those who ingest internal *qi*, little effort yields great results. The key lies in calming the spirit and quieting the mind, free from disturbance—then the *qi* pathways become unobstructed, the joints open, and primordial harmony is contained within, never dissipating. The body becomes moist and lustrous, hands and feet perspire—the secret of the Way to longevity lies herein.\n\nAfter midnight, swallow seven times and hold the breath, keeping the internal *qi* within while slowly exhaling and inhaling external *qi* through the nose and mouth, ensuring no mingling of internal and external. At the fifth watch, swallow seven more times, and again at dawn, totaling twenty-one swallows. Those who have severed their roots are not bound by this number; when the stomach is empty, they swallow internal *qi*, keeping it constantly full, naturally free from hunger and thirst. Initially, this may seem difficult, but with long practice, the internal and external *qi* naturally cease to mingle.\n\nGradually, the joints open fully, the hair and pores become unobstructed, and *qi* moves freely of its own accord—no longer requiring the slow passage of external *qi* through the nose. The subtlety of fetal breathing culminates here.\n\nA classic on fetal breathing states: \"Simply draw *qi* in and out gently, and primordial *qi* will not escape. Naturally, internal and external *qi* do not mingle—this is called fetal breathing.\" Yet for beginners, after sealing the internal *qi*, one must still allow a faint exchange of *qi* through the nose, ensuring it does not reach the throat. If the breath reverses and surges upward, unable to be restrained, release it slowly until it flows smoothly, then resume closure once the *qi* is regulated. The key lies in the gentle passage of *qi* through the nose, never allowing it to reach the throat, and restraining it with utmost effort. After a brief practice, harmony suddenly arises, and internal and external *qi* become serene. This occurs because the joints open and the pores unblock. At this stage, even a thousand breaths bring no fatigue.\n\nThe subtlety of fetal breathing lies in thoughtlessness and carefreeness, the body merging with nature, the mind like dead ashes, the form like withered wood—then the hundred vessels flow freely, and the joints open. If worries and distractions arise ceaselessly, seeking the ultimate Dao will be in vain, despite arduous effort. Master Sangyuzi said: \"There is the *qi* of suffering and vexation, the *qi* of greed and malice—all such perverse *qi* obstructs the primordial *qi*, just as petty men block the path, leaving gentlemen no room to display their talents.\" This Dao is most subtle and wondrous; only those who have transcended the mundane may practice it. Those still entangled in fame and profit labor in vain. Master Sangyuzi said: \"Even if one has not transcended the mundane, as long as the mind remains undisturbed and free from desire, it suffices.\"\n\nA classic states: \"After swallowing *qi* to fullness, close the breath and visualize the mind like flowing water—where the preceding wave departs, the succeeding wave follows.\" Once fetal breathing is mastered and the joints open while the pores become unobstructed, proceed thus: gently draw *qi* through the nose, imagining it exiting through the four limbs and the pores of the body, flowing outward without return. When the next breath arrives, draw it in without exhaling. The practice lies in gradualness; though it is said to draw without exhaling, the *qi* drawn does not enter the throat but disperses faintly. In this way, internal *qi* does not dissipate.\n\n**Secret Oral Instructions:**\nThe mouth is the Celestial Pass for internal *qi*, the gateway of the divine mechanism;\nThe hands are the Human Pass, grasping prosperity and decline;\nThe feet are the Earthly Pass, the threshold of life.\nAs the *Huangting Neijing* states.\n\nThe nose is the abode of external *qi*.\nThe nose is the \"divine hut,\" which must be cultivated.\nAs the *Huangting Neijing* states.\n\nFor all *qi*-swallowing practices, choose yang hours—from midnight to dawn—face southeast, sit upright in stillness, knock the teeth three times, rinse the mouth with saliva three times, and swallow. Rub the hands together until the palms grow warm, then wipe the face and eyes. Use the thumbs to rub the kidney meridian seven times, clench the fists, and fill the Celestial Pass with *qi* to a harmonious degree, then close the mouth and swallow. Expand the abdomen, then slowly exhale through the nose, ensuring the \"divine hut\" is well-regulated. Each expansion and swallow should correspond—one expansion, one swallow, one expansion of the abdomen. While expanding and swallowing, do not open the Celestial Pass, lest external *qi* enter the abdomen and cause illness.\n\nWhen swallowing *qi*, calm the spirit and steady the mind, swallowing gently. If done hastily, the *qi* in the chest will not disperse, causing pain and congestion. Begin with fifty swallows, gradually increasing to a hundred, two hundred, or three hundred. If other matters arise, reduce to twenty or thirty swallows, practicing while walking or standing as needed, adjusting as circumstances allow. Consistency is paramount; do not skip days. If belching occurs at the outset, expand the abdomen and swallow again, preventing the *qi* from escaping. Master Sangyuzi said: \"When primordial *qi* is harmonious, it does not cause harm. If belching arises, how can it be the *qi* of primordial harmony?\" Initially, the *qi* pathway may not be fully unobstructed, requiring restraint and accommodation, but one must rely on primordial *qi*. If after two or three attempts the *qi* sea cannot receive it, it may stir the turbid *qi* lingering in the five viscera. In such cases, do not cling to it; if lower abdominal *qi* arises, release it without hesitation.\n\nWhen expanding and swallowing *qi*, regulate it gently and slowly, ensuring no sound emerges from the Celestial Pass. If swallowing is too rapid, the lower *qi* may become blocked, causing rectal prolapse—beware. With prolonged practice, internal *qi* will flow freely, and one may swallow at any time. Swallow when hungry, cease when full. During each expansion and swallow, visualize the *qi* entering the five viscera and circulating, then exiting through the palms, soles, the three passes of the crown, the nine orifices, and the joints. If illness arises, direct the *qi* to attack the afflicted area—what ailment will not be cured?\n\nTo practice *qi*-swallowing for fasting, do not fixate on the number of expansions, swallows, or abdominal exertions; simply keep the abdomen full without overburdening the intestines. When hungry, swallow three to five times, adjusting naturally without seeking external *qi*, which may hinder descent and harm the chest. When *qi* harmonizes, the abdomen may rumble—some mistakenly call this \"intestinal emptiness\" and believe it harms the body, but this is far from true. It is like thunder and lightning refining yin *qi*, nourishing the hundred vessels in a single flow—truly the profound gate of the Dao.\n\nThough there are many methods of *qi*-swallowing, none surpass the technique of expansion and swallowing for true subtlety. Some, failing to grasp the single breath or unobstructed *qi* flow, empty their minds and forget their bodies, claiming the efficacy of seated forgetfulness. Yet this yields no achievement and often leads to exhaustion.\n\nThe *one-expansion swallowing* method fundamentally draws upon the natural primordial *qi*, circulating it through the viscera—once this is achieved, one attains enduring existence and does not die. Why then would one waste time on external thoughts or the absorption of external *qi*? When a person’s *qi* is exhausted, the spirit perishes; when the spirit departs, the body decays. Thus, preserving the primordial *qi* without loss and forming the spiritual embryo are secrets transmitted through esoteric teachings—scholars must not doubt this.\n\nWhen practicing *qi*-circulation, choose a leisurely moment: expand and swallow ten times, twenty times, or more, filling the intestines, then direct the *qi* through visualization, guiding it into the four limbs. During activity, swallow once and circulate *qi* once, ensuring the hands and feet remain in contact with something. When *qi* flows unimpeded, empty the mind and forget the body, allowing the turbid, steaming *qi* to disperse through the limbs while the essence of *qi* condenses and returns to the *qi* sea. With prolonged practice, the embryo naturally forms, sealing and fortifying the joints, resonating like thunder. When expanding and turning the abdomen, ensure the *qi* flows smoothly and harmoniously.\n\nFor *qi*-swallowing and Dao-yin (guiding and pulling), first stretch the hands and feet, bending and extending the body left and right, then focus the mind to guide *qi* into the bones and joints, ensuring continuous, unbroken circulation—this is called *qi*-circulation and Dao-yin. Alternatively, coil and revolve the body, visualizing *qi* dispersing from the joints of the hands and feet. As the ancient scriptures say: \"There are methods of *qi*-circulation and Dao-yin, but unless transmitted orally by a master of the supreme Dao, few know them.\"\n\nWhen practicing *qi*-circulation, if hungry, swallow *qi* until the abdomen is full before proceeding; if practicing after a meal, do so immediately. Sang Yuzi remarked: \"The character for 'full' (*bao*) is likely a miswriting of 'drink' (*yin*).\" For cultivators, daily life should not be one of satiety—how could one practice *qi*-circulation only in autumn? If unable to practice *qi*-swallowing and Dao-yin regularly, train during leisure moments, for this is no ordinary endeavor.\n\nWhen practicing *qi*-swallowing and Dao-yin, retreat to a quiet, secluded chamber, avoiding high rooms exposed to wind. If encountering violent winds, heavy rain, dampness, cold, or heat, or if returning from afar, rest until the body is dry and *qi* harmonized before resuming. If the limbs are often weak, practice Dao-yin frequently; if the skin is plump and radiant, practice it more. By practicing *qi*-swallowing and Dao-yin without missing the proper times, the spirit and *qi* remain clear, the complexion does not age prematurely, flabby flesh does not form, and all illnesses are averted.\n\nSome mistakenly claim that *qi*-swallowing and embryonic breathing are entirely distinct—this is a grave error. The embryo forms within *qi*-swallowing, and breathing arises from the embryo. With prolonged practice, pure *qi* condenses into the embryo while turbid *qi* disperses from it, enabling one to walk through water and fire. Some follow inferior methods, forcibly holding their breath, prizing prolonged respiration—is this not misguided? They fail to realize that the five viscera cannot sustain a single *qi* indefinitely; forcibly closing the gates of the body is hardly the natural intent of the embryonic state. Such efforts only exhaust the body and spirit, yielding no benefit.\n\nMany practitioners of *qi*-swallowing constrict their mouths and noses, forcibly restraining their breath in pursuit of prolonged respiration, unaware that this causes harm. Someone asked: \"Both internal and external *qi* emerge from the five viscera—why are inhalation and exhalation treated differently?\" Sang Yuzi replied: \"To say both *qi* emerge from the five viscera is a gross error. The *qi* of panting and breathing is not the *qi* of the viscera; it merely enters the constructive and protective *qi*, not originating from within. How can it be said to emerge from the five viscera?\"\n\nWhen swallowing internal *qi* and expanding, the stomach sea opens to receive true *qi*, then seals after absorption. Exhaling external *qi* proceeds slowly and naturally, each with its distinct purpose. Forcibly blocking the mouth and nose obstructs *qi* flow, causing stagnation and harm to the five viscera—this is seeking benefit but inviting harm. When healthy, holding the breath is easy, but during illness or weakness, it becomes difficult to control—is this not an extreme mistake? Practicing internal *qi* requires minimal effort yet yields great results; one should diligently cultivate it.\n\nSomeone asked: \"Why do superior practitioners first perform Dao-yin before exhaling and inhaling, while inferior practitioners do so afterward?\" The answer: \"Superior practitioners first perform Dao-yin, expelling impure *qi* through movement; inferior practitioners perform Dao-yin afterward, fearing impure *qi* may enter the limbs and fail to disperse. This distinguishes those who succeed in *qi*-circulation and Dao-yin from those who do not.\" Sang Yuzi remarked: \"Superior and inferior refer to the order of practice, reflecting the depth of attainment, not a hierarchy of worth. Could this Dao be practiced by the foolish? Only the wise may fail to achieve it.\"\n\nThe Heavenly Master said: \"Inhalation has one method, exhalation has six. Only when the *qi* pathway is mastered can one practice them.\" The six exhalations are: *chui* (blowing), *hu* (breathing), *xi* (sighing), *xu* (warming), *xu* (dispersing), and *si* (hissing). Sang Yuzi noted: \"In some texts, *xu* (warming) is written as *he* (exhaling). The application of the six *qi* differs from other methods.\" When cold, use *chui* to dispel it; when warm, use *hu* to cool; *xi* dispels wind, *xu* (or *he*) dispels vexation and lower *qi*; *xu* (dispersing) scatters stagnation; *si* resolves heat. Ordinary people often use *hu* and *si*, but Daoist *qi*-circulation avoids *xu* and *si*, as they disrupt prolonged respiration.\n\nThose who attain mastery of the six *qi* ascend as celestial immortals. Sang Yuzi said: \"Ordinary people are constantly afflicted by the *qi* of joy, anger, sorrow, and desire, and their mouths never depart from the flavors of spicy, salty, sweet, and sour. If they forcibly restrain prolonged respiration, turbid *qi* will never be fully expelled. Those who attain the Dao are free from thoughts, worries, pursuits, and desires; they embody the vast primordial *qi*—why would they need *xu* or *si*? To them, *xu* and *si* are as insignificant as a broken dike.\"\n\nAfter completing *qi*-absorption, immediately visualize the Fire Star of the southern quadrant as a crimson *qi*, vast as a pearl, entering the Celestial Pass and flowing into the viscera, until the entire body is transformed into *qi*. Perform this once daily—this is refining yin with yang, dispelling the Three Worms’ affliction.\n\nAncient Master Juezi left an oral formula instructing one to imagine fire refining the body into charcoal. Daoist practitioners have debated this, for fire-*qi* is not innate yang essence, and they fear it may harm the spirit—thus it cannot be adopted. The refined method, transmitted in secret by perfected beings, demands focused practice without doubt.\n\nSang Yuzi said: \"This debate reflects the view of Lord Yanling. In the midst of visualization, must one distinguish between the natural and the unnatural? If so, are visualization and contemplation themselves natural? Moreover, in alchemical refinement, fire is also used—then are fire and the Fire Star not both a single entity within heaven and earth? What need is there for discrimination?\"\n\nDuring *qi*-guiding and absorption, clothing and sashes should always be loose; if tight, they obstruct *qi* and cause stagnation in the *qi*-sea. Sang Yuzi said: \"Obstruction means constraint, not destruction.\"\n\nIn summer and winter, sleeping quarters and diet should remain warm; avoid sour, salty, oily, or greasy foods, for they harm the five viscera. When the five viscera are harmed, the spirit becomes unsettled. Dog meat and raw fruits are especially forbidden.\n\n**Essential Formula for Gathering *Qi* and Spirit**\nThe spirit gathers in emptiness.\nSang Yuzi said: \"Emptiness is but an image of the formless.\"\n\nYet to settle in fullness—fullness meaning essence. The spirit is the knowing within the heart. When settled and desireless, the spirit flourishes and *qi* knows rectitude. At such times, let it be as it will; the longer, the better. Persist without cease, and the body’s *qi* attains tranquility—this is called \"rejoicing in Heaven.\" Heaven is emptiness and spontaneity. Rejoicing in Heaven brings longevity.\n\nThe emptiness beyond the body is also Heaven; the emptiness within the body is also Heaven. With long practice, clarity arises therein. Within emptiness, whiteness is born. Through inner awareness, with prolonged practice, essence ascends to merge with luminosity, and luminosity inwardly radiates from essence. Thus one attains the Dao, the Dao responds to virtue, and virtue is perfected. Applied, it becomes benevolence; distributed, it becomes righteousness.\n\nEssence-*qi* emerges from the head by day and rests in the abdomen by night. One should honor the head and value the abdomen, maintain dignity in appearance and reverence within, respond to circumstances without thought, and align only with goodness. This is the substance of spirit and *qi*, uniting as one with the self—called \"great compliance.\" Heaven protects such a one; fortune is boundless, no misfortune befalls.\n\nIn essence, the wondrous origin resides in the emptiness within the heart, where the spirit connects upward through its thread; *qi* accumulates in the fullness of the intestines—fullness meaning essence—stored above the anterior water bladder. It must always be warmed and nurtured. Sang Yuzi said: \"Warmth is life’s companion, but one must not overheat and lose balance.\"\n\nIn daily life, one should often close the eyes and inwardly gaze upon the *qi*-source, the lower *dantian*. With every act that benefits living beings, joyfully close the eyes, inwardly behold the heart, and give thanks, as if saying: \"The spirit and *qi* of my body shine forth from my form, enabling me to attain the Dao.\" Thus Heaven bestows good fortune.\n\nFor Heaven is the numinous spirit of emptiness and *qi*; if one can employ it, the Dao reaches its ultimate. Sang Yuzi said: \"What is called Heaven is spontaneity itself, not merely the azure vault!\"\n\n**Method for Refining *Qi***\nFor every session of swallowing *qi*, find a quiet, secluded room in spare moments. Loosen the hair, remove clothing, cover the body, lie supine with limbs outstretched, and do not clench the fists. Use a clean mat, its edges touching the ground. Comb the hair to smooth it, letting it spread upon the mat, then regulate the breath. When the breath is properly attuned, swallow it and hold it until discomfort arises.\n\nStill the mind and banish thoughts, allowing *qi* to move as it will. When discomfort from holding *qi* arises, open the mouth to release it. If the breath is newly expelled and panting is rapid, regulate it seven or eight times until settled. Once settled, refine it again. When time permits, refine it ten times to begin the practice. Fear not that *qi* may fail to circulate and become lodged in the skin, causing illness instead.\n\nWith further leisure, refine it again, adding five or six repetitions, increasing to twenty, thirty, or even forty or fifty—there is no fixed limit. What is the standard? As the practice of swallowing *qi* gradually succeeds, the joints open, the pores unblock, and upon refining twenty or thirty times, one feels the body suffused with moisture, or sweat emerges. This is the sign of new efficacy. Cease refining once *qi* flows smoothly; gradual sweating is beneficial. Rest the mind and body calmly, avoiding early rising or exposure to drafts. Like a patient who has just perspired, rest a long while before dressing, then walk slowly, speak little, conserve *qi*, reduce activity, and calm the thoughts. Thus the body becomes light, the eyes bright, the hundred vessels flow, and the four limbs move freely.\n\nAs the *Huangting Jing* says:\n*A thousand ills dispelled, a hundred maladies healed,*\n*Fearless of tigers’ ferocity or sharks’ jaws.*\n*Thus aging is averted, and years prolonged.*\n\nIn refining *qi*, one may practice at midnight or noon, whenever convenient, when the spirit is clear and refreshed. Sit upright and swallow *qi* in the prescribed sequence, applying oneself diligently without laziness. If drowsiness arises, sleep when inclined; do not force practice while dull or sleepy, lest the mind be disturbed by perverse thoughts. A disturbed mind and chaotic *qi* lose the true Dao.\n\nIf newly practicing and lacking proper *qi*, one may feel drowsy, but after drowsiness passes, no torpor remains. Sang Yuzi said: \"One must be diligent—never lazy or careless.\"\n\nIt further states that one should follow convenience and not force practice; the subtlety of harmonizing lies precisely here. Thus, diligence does not lie in forcing, but in refining breath and riding its natural flow, as if borne by a chariot—then *qi* circulates.\n\nIn refining *qi*, one need not practice daily; if after ten or five days one has leisure and senses obstruction or discomfort in the four limbs, then practice. On ordinary days when no benefit is felt, frequent practice is unnecessary.\n\nSang Yuzi said: \"When yin and yang align with the seasons, no disasters arise.\" Yet here it speaks of \"ordinary days without benefit\"—if practiced as described, what harm could there be? But if one does not cease even when no benefit is gained, it may lead to fault. How so? Consider the example of the Flame Emperor: excessive diligence in plowing and weeding may yield double the harvest, yet it may also bring great drought. The same applies to massage.\n\n**The Method of Entrusting *Qi***\n\nFor those who cultivate *qi*: when the four limbs are harmonious and the mind free of thoughts, whether sitting or otherwise, let *qi* follow its natural pathways. Regulate the breath until still, entrusting the body as one would a discarded garment—smoothly settled, without sinew or bone, without spirit or consciousness. Let the heart and body be unrestrained, profoundly tranquil.\n\nWhen entrusting, do not seek to control. Sang Yuzi said: \"Without the marks of self or others—how could this apply merely to self and others? All myriad things dissolve.\"\n\nThen, with spirit settled and *qi* refined, the hundred joints open, sinews and vessels flow freely, and fluids circulate. At this point, one may swallow and hold ten or twenty breaths. With each swallow, remain steadfast and let *qi* move without contention from the mind. After a long while, *qi* will exit through the pores of the skin, no longer expelled through the mouth. Of what remains, scarcely one or two parts in ten linger.\n\nAdjust and regulate, counting to ten, a hundred, or more breaths. If panting arises, gently draw in breath and swallow, then regulate the breath again. After prolonged regulation, the skin, flesh, and joints of the four limbs will feel as if bathed.\n\nAt leisure, whether lying supine, on one’s side, standing, or sitting, entrust *qi* and the body to the practice. Progress will come daily: essence fills, *qi* is complete, spirit is at peace, the *po* is settled, the mind is closed to distant thoughts, the Dao is flourishing, and virtue is serene. The Three Worms perish, and the Six Dusts vanish.\n\nThe *Huangting Jing* says:\n*At ease, with nothing to do, the body is at peace,*\n*Dwelling in emptiness within the curtains.*\n\nSimply nurture life through non-action, entrusting body and heart, releasing form and thought, merging with the Dao—then one will recognize extraordinary signs.\n\nThe *Huangting Jing* further says:\n*Sitting upright in non-action, the hun and po are at peace,*\n*In purity, the spirit appears and speaks to me.*\n\nThis is the meaning.\n\n**The Method of Holding the Breath**\n\n**The Method of Holding the Breath**\n\nWhen *qi* is obstructed and the body’s rhythms are disordered, proceed as follows. Those of superior wisdom, with steadfast resolve and far-reaching thought, if they cultivate without the slightest lapse, will settle the spirit and harmonize *qi*, cutting off external illness. Those of middling wisdom, however, may be hindered by public or private affairs, their minds wavering between advance and retreat, or their practice may stray from what is fitting, causing *qi* to stagnate and lose harmony, thereby inviting affliction.\n\nIf discomfort arises, enter a quiet chamber, lie supine, and carefully regulate the breath. Extend the hands and feet, each separated by four or five inches. Ensure the bedding is thick and soft; in winter, keep warm with covers. Calm the heart and relax the body, then swallow *qi*. Once swallowed, hold the breath, keeping the mouth and nose still. Focus the mind on the afflicted area, directing intention and visualization to attack it. When *qi* reaches its limit, exhale, then swallow again, holding the breath anew. If panting or urgency arises, regulate the breath with six or seven measured breaths until *qi* is smooth and even, then resume holding the breath, concentrating the mind to attack the affliction. This may be done ten, twenty, thirty, or fifty times, until the troubled area sweats and feels unblocked—then cease. If relief is not yet complete, repeat the practice at dawn or midnight, directing intention to attack the affliction until it is cured.\n\nIf the ailment is in the left hand, direct *qi* straight into the left hand; if in the right, into the right; if in the head, into the head. Only when clear results are seen will one know that the heart commands *qi*, and *qi* follows the heart—its response is as swift as the divine.\n\n*Master Yanling’s Compilation of New and Old Qi-Absorption Scriptures Concludes*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞神部方法类 延陵先生集新旧服气经 经名：延陵先生集新旧服气经。 又名《新旧服气经》。 延陵先生编，朵榆子评。 一卷。 底本出处《正统道藏》洞神部方法类。 参校版本：《云夏七签》，收入该书卷五十八、五十九及卷六十一。 延陵先生集新旧服气经 桑榆子评 修养大略 《仙真经》云：夫人临终而始惜身，罪定而思迁善，病成方功於药，天网已挂，胡可这耶？ 故贤人上士，惜未危之命，惧未萌之祸，理未至之病也。 修真品有三：上年、中年、下年。 上年者，二十、三十也。 中年者，四十、五十也。 下年者，六十、七十也。 上年者早悟大道，识达玄微，髓壮骨坚，筋全肉满，从容履道，无不成功。 中年者悟道已晚，筋肉骨髓各有其半，处在进退，如日中之功。 下年者骨髓筋脉，十有二三，犹可补修，如日暮功矣。 八十已上者，罪位已定，无可救之法。 脑竭髓尽，万关乾枯，神谢气亡，尸行鬼步。 桑榆子曰：尸以喻无知，鬼以喻有知而非人情者。 惟尸行，惟鬼步，且行且步，运之者谁？ 则知元气尚在，但以减耗，邻於个矣。 若逢至人，成得大药，譬持盈车之焦蓬，热将烬之余焰，亦可致其赫然而炽矣。 此言无可救者，只谓气功已晚； 自我之事不及矣。 若遇玄圣而救其生，死则肉骨起仆荚枯，何为而不可？ 死彼尚为物也。 先贤上士知风烛之倏忽，乃摄志持情，舍荣弃俗，奉身归道，不与物伤。 道者，气也。 气者，身之根也。 鱼离水必死，人失道岂存？ 是以保生者，务修於气，爱气者，务保於精。 精气两存，是名保真也。 人有三丹田：上元、中元、下元是也。 上元丹田，脑也，亦名泥丸。 中元丹田，心也，亦名绛宫。 下元丹田，气海也，亦名精门。 三元之中，各有一神。 桑榆子曰：精化为气，气胚而神集焉。 神何物也？ 灵照之名也。 知化气全，气全则神全，若元气充满，百骸孔家神必备矣。 必备者无他，气至则神到。 今人有忧患，动中则知见因而暂亏，盖气拥有不至者耳。 苟心冥气和。 其神岂独三元之中而已哉！ 精者，身之根，根者，气之位。 精全则气全，精泄即气泄，气泄则神乘而去之，唯精与气须全耳。 《黄庭》云：长生至慎房中急，何为死作令神泣？ 但当吸气录子精，寸田尺宅可治生。 若当决海百渎倾，叶去树枯失青青。 故先贤至於道者，莫不因爱气保精而能全也。 夫服气本名胎息，胎息者，如婴儿在腹中，十个月不食而能长养成就，为新受正气，无思无念，兀然凝寂，受元气，变化关节藏府，皆自然而成。 岂有傅保之卫，饥渴之备耶？ 及出母腹，即吸纳外气，而有啼叫之声，即乾湿饥饱，似有所念，即失元气。 人能依婴儿在母腹中自服内气，握固守一，是名曰胎息。 桑榆子曰：此言失元气者，非也。 苟纳外气，便失元气，即世问无复有生人矣。 《法华经》云：须行住坐卧，身心不乱者，亦言气主心，心邪则气邪，心正则气正。 今人所举手动足，喜怒哀乐，莫不由心。 心之动息，莫不是气气感意，意从心，心和则气全，气全即神全； 气绝即神灭，神灭即为委土矣。 故医家先诊脉者，测候五藏四时之气，察诸病源，始寻方药。 人但能察得气候，口鼻取舍，斯须不忘，自然五藏和，而脉调气顺也。",
      "translated_text": "**Collected New and Old Qi-Absorption Classics by Master Yanling**\n\n*With Commentary by Sangyuzi*\n\n**General Principles of Cultivation**\n\nThe *Scripture of Immortal Perfected Ones* states: When a person nears death, they begin to cherish their body; when guilt is already determined, they think of reforming; when illness has taken hold, they turn to medicine. Yet the net of Heaven has already been cast—how can one escape? Thus, the wise and superior persons cherish life before it is imperiled, fear calamity before it sprouts, and remedy illness before it arises.\n\nThere are three grades in the cultivation of the Dao: the upper years, the middle years, and the lower years.\n- The *upper years* refer to ages twenty and thirty. Those in their upper years awaken early to the Great Dao, discern its profound mysteries, and possess robust marrow, sturdy bones, full sinews, and plump flesh. Proceeding with ease along the Way, they achieve success without fail.\n- The *middle years* refer to ages forty and fifty. Those in their middle years awaken to the Dao belatedly, with sinews, flesh, bones, and marrow each diminished by half. Their progress is uncertain, like laboring at midday.\n- The *lower years* refer to ages sixty and seventy. Those in their lower years retain but two or three parts of their bones, marrow, sinews, and vessels. Yet they may still be restored through cultivation, like working at dusk.\n\nThose above eighty have already settled their karmic fate, and no method can save them. Their brains are exhausted, their marrow spent, their myriad gates desiccated, their spirit departed, and their qi extinguished—they walk like corpses and move like ghosts.\n\nSangyuzi remarks: A corpse is likened to one without awareness; a ghost, to one with awareness yet devoid of human sentiment. To walk like a corpse, to move like a ghost—who, then, animates them? One knows that the primordial qi still lingers, though diminished and nearing its end. If such a one encounters a perfected being and obtains the Great Elixir, it is like holding a cartload of withered reeds to the last flicker of a dying flame—yet it may still blaze forth in brilliance. Thus, when it is said that none can be saved, it refers only to those for whom qi cultivation has come too late; their own affairs are beyond remedy. But if a transcendent sage intervenes to preserve their life, even the dead may rise, their flesh and bones reviving from withered husks—what is there that cannot be done? Even in death, they remain part of the realm of things.\n\nThe ancient worthies and superior persons, knowing the fleeting nature of life like a candle in the wind, restrained their wills and mastered their emotions. Forsaking glory and abandoning worldly attachments, they dedicated their bodies to the Dao, refusing to let external things cause harm.\n\nThe Dao is qi. Qi is the root of the body. As fish die when parted from water, how can humans endure when severed from the Dao? Therefore, those who preserve life must devote themselves to cultivating qi; those who cherish qi must devote themselves to preserving essence. When both essence and qi are preserved, this is called safeguarding the True.\n\nHumans possess three cinnabar fields: the Upper, Middle, and Lower Elixir Fields.\n- The *Upper Elixir Field* is the brain, also called the Muddy Pellet.\n- The *Middle Elixir Field* is the heart, also called the Crimson Palace.\n- The *Lower Elixir Field* is the Sea of Qi, also called the Gate of Essence.\n\nWithin each of the Three Origins resides a spirit.\n\nSangyuzi remarks: Essence transforms into qi, and when qi takes form, spirit gathers therein. What is spirit? It is the name for numinous illumination. When one fully comprehends the transformation of qi, and qi is whole, then spirit is whole. If primordial qi fills the body, the hundred bones and myriad apertures will naturally be replete with spirit. This repletion is nothing other than qi arriving and spirit following. When people today face worries and hardships, their awareness momentarily falters when distress strikes—this is because qi is obstructed and fails to arrive. If the mind is serene and qi harmonious, how could spirit be confined to the Three Origins alone?\n\nEssence is the root of the body; the root is the abode of qi. When essence is whole, qi is whole; when essence is depleted, qi is depleted. When qi is depleted, spirit departs, riding upon it. Thus, essence and qi must both be preserved.\n\nThe *Yellow Court Scripture* states:\n*For long life, be most cautious in the chamber’s haste,*\n*Why cause death and make the spirits weep?*\n*Instead, absorb qi and gather the essence of the child,*\n*An inch of field, a foot of dwelling—thus govern life.*\n*If you drain the sea and empty the hundred streams,*\n*The leaves fall, the tree withers, and verdure is lost.*\n\nThus, the ancient worthies who attained the Dao all succeeded by cherishing qi and preserving essence.\n\nQi absorption is fundamentally called *embryonic breathing*. Embryonic breathing resembles an infant in the womb: for ten months, it does not eat yet grows and matures, receiving the upright qi. Without thought or念, utterly still and serene, it takes in primordial qi, transforming its joints and viscera, all naturally accomplished. How could it require the protection of a nurse or preparations for hunger and thirst? Upon emerging from the womb, it immediately inhales external qi, and with its cries, experiences dryness and dampness, hunger and satiety—seeming to harbor thoughts—and thus loses its primordial qi.\n\nIf one can emulate an infant in the womb, absorbing internal qi, grasping firmness and guarding unity, this is called *embryonic breathing*.\n\nSangyuzi remarks: To say that inhaling external qi results in the loss of primordial qi is incorrect. If this were so, no living persons would remain in the world.\n\nThe *Lotus Sutra* states: *Whether walking, standing, sitting, or lying down, let body and mind be undisturbed.* It also speaks of qi as the master of the mind: when the mind is perverse, qi is perverse; when the mind is upright, qi is upright. All human actions—raising a hand, moving a foot, joy, anger, sorrow, and delight—arise from the mind. The mind’s movements and stillness are all responses of qi to intention. Intention follows the mind; when the mind is harmonious, qi is whole, and when qi is whole, spirit is whole. When qi is cut off, spirit perishes; when spirit perishes, one becomes mere dust.\n\nThus, physicians first examine the pulse to assess the qi of the five viscera and four seasons, investigate the sources of illness, and only then prescribe remedies. If one can discern the signs of qi, regulating inhalation and exhalation through the mouth and nose without momentary lapse, the five viscera will naturally harmonize, the pulse will regulate, and qi will flow smoothly.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1226,
      "start_sentence": 0,
      "end_sentence": 66,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.22371220588684,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\延陵先生集新旧服气经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "夫人与天地合体，阴阳混气，皮肤骨髓，藏府及荣卫，呼吸进退，寒暑变异，莫不均乎二仪，应乎五行也。 是知天地否泰，阴阳之气，乱焉藏府不调，经脉之候，病焉因外所中者，百病起於风，因内所致者，百病起於气也。 故曰：恬淡虚无，真气从之，精神内守，病安从来？ 信哉！ 是故须知形神之理，养而全之，审内外之病，慎而修之。 歧伯高曰：食气者则灵而寿延，食谷者多智而促命。 凡服气者何求也？ 以其功至，则气化为血，血化为精，精化为髓。 一年易气，二年易血，三年易脉，四年易肉，五年易髓，六年易筋，七年易骨，八年易发，九年易形，即三万六千神在於身，化为真仙，号为真人矣。 是以意在玄微，理生不测。 修真之人又有三等，任时分理，其状不一。 上等之士，本性虚闲，用志清雅，发言合道，履行无瑕。 如此之人有前代之资，以石投水，无所比之也。 中等之人，或身居荣禄，或地势高远，或巨叶厚姻，或有名有望，二疑进退，倏忽虚捐，闻道即寤寐不安，思名则终朝不息，两心交战，胜者即全，遗巡之问十失六七矣。 中等已降，二时既遏，蹉跎暮年，筋力衰微，心神已丧，虽食厚禄，白日将倾，追惟噬脐，方即正路。 此时若能精心励志，尚乃救其一二焉。 此皆先贤所悲，表示於后，幸察根柢，生实信心。 张果先生服气法 每日常偃外，摄心绝想，闭气握固，鼻引口吐，无令耳闻，唯是细微，满即闭之，使足心汗出，一至二，数至百已上，闷极微引少气，还闭，热呵玲吹，能至一二千即不用粮食，不须药物。 时饮一两盏好酒或新水通肠耳。 数至五千则随处出入有功，当自知也。 则可入水卧矣！ 夫服食养生，贵其有常，真气既降，方有通感。 岂有纵心嗜欲，而望灵仙羽化？ 无此事也。 且仙人功行未满尚不可致，而况凡俗乎？ 但信老人谨勤行之，则当自知。 凡气不通，玲热迟疾耳！ 审调之，以通和为妙也。 鸾法师服气法 初宽大座，伸两手置膝上，解衣带，放纵支体，念法性平等，生死不二。 经半食顷，即闭目举舌奉愕，徐徐长吐气，一息二息，傍人闻气出入声，初庞渐细。 十余息后，乃得自闻声。 凡觉有痛痒处，便想从中而出，但觉有异，渐渐长吐气，从细至庞，十息后还如初。 或问曰：初调气何意从庞而渐细？ 将罢何意从细而入赢？ 鸾答曰：凡行动视陌，饮食言语，是庞也。 桑榆子曰：凡修气学者，未服及服罢，於饮食言语盖常事也。 鸾公欲使两相接会，不令其首尾陡异也。 凡睡寤后，复如前击念，如虎衔子，莫急莫缓，不问寒温，室中先诤所住，使心不乱，静其剩耳。 又曰：四大不调，何以察之？ 当於唇口察之，玲为风增，热为火增； 涩为地增，滑为水增； 不玲不热，不涩不滑为调和。 又声为风增，动为喘增，痒为热增，涎为水增，不声不动，不痒不涎为调和。 又心烦为热结，意乱为风结，忧悸为喘结，志荡为水结，不烦不乱，不悸不荡为调和。 四大不调有二：或外或内，寒热饥虚，饱妖疲劳为外起； 名利喜怒，声色滋味，念虑为内起。 凡气节量，一任自然，绵绵若存，用之不勤而已。 但能不以生为生，乃贤於养生也。 桑榆子曰：诸经皆言吐纳不欲自闻其声，而鸾口言吐厅而渐细，后细而渐厅，始甚疑之，及睹下文云，一任自然，则知辟厅细之渐行，是为最下乘者，设不欲使之与自然争力也。",
      "translated_text": "The human body aligns with heaven and earth, blending yin and yang in its qi. From skin and bone marrow to the viscera and the constructive and defensive systems, from the rhythms of breath to the shifts of cold and heat, all correspond to the Two Modes and resonate with the Five Phases.\n\nThus, when heaven and earth are in disharmony, the qi of yin and yang becomes disordered, the viscera fall out of balance, and the signs in the meridians manifest as illness. External afflictions arise from wind, while internal disorders stem from qi. As it is said: \"In serenity and emptiness, true qi follows; with spirit guarded within, whence can illness come?\" Truly so!\n\nTherefore, one must understand the principles of form and spirit, nurturing and preserving them, discerning internal and external ailments, and cultivating them with care. Qi Bo the Eminent said: \"Those who consume qi become numinous and long-lived; those who consume grain gain wisdom but shorten their lives.\"\n\nWhat, then, do practitioners of qi cultivation seek? Through their efforts, qi transforms into blood, blood into essence, and essence into marrow. In one year, qi is renewed; in two, blood; in three, the meridians; in four, the flesh; in five, the marrow; in six, the sinews; in seven, the bones; in eight, the hair; in nine, the form. Then, the thirty-six thousand spirits within the body transmute into a true immortal, known as a *zhenren*.\n\nThus, the subtleties of intention lie in the profound and unfathomable. Those who cultivate the true are of three ranks, each differing in their approach and disposition.\n\nThe highest rank consists of those whose nature is empty and at ease, whose will is pure and refined, whose words align with the Dao, and whose conduct is flawless. Such individuals possess the innate capacity of past ages—like a stone cast into water, they are beyond comparison.\n\nThe middle rank includes those who may hold high office or live in remote places, who enjoy wealth or prestige, or who waver between advancement and retreat. When they hear the Dao, they are restless even in sleep; when they pursue fame, their thoughts race all day. As their two minds contend, the victor prevails, but in hesitation, six or seven out of ten are lost.\n\nBelow the middle rank are those whose time has passed, whose twilight years bring frailty, whose sinews weaken, and whose spirit fades. Though they may still enjoy wealth, the sun nears its setting, and in hindsight, they gnaw their navels in regret, only then seeking the right path. Even at this stage, if they rouse their will with precision, they may yet salvage one or two parts of themselves. These are the sorrows the sages of old bequeathed to later generations—may you examine their roots and cultivate true faith.\n\n**Master Zhang Guo’s Qi-Absorption Method**\nLie supine daily, calm the mind, and banish thoughts. Hold the breath, clench the fists, inhale through the nose, and exhale through the mouth, ensuring no sound reaches the ears. The breath should be fine and subtle; when full, close it off until sweat appears on the soles of the feet. Begin with one or two breaths, then increase to a hundred or more. When stifled, draw in a slight breath and resume closure. Use hot exhalations (*he*) and cold exhalations (*ling* or *chui*) to regulate. With one or two thousand breaths, one may cease taking grain and dispense with medicine. Occasionally drink a cup or two of good wine or fresh water to clear the intestines. At five thousand breaths, one gains efficacy in all endeavors and will know it intuitively—then one may sleep in water!\n\nIn the practice of qi-absorption for longevity, consistency is paramount. Only when true qi descends can resonance occur. How can one indulge in desires and yet hope for transcendence as a feathered immortal? Such a thing does not exist. Even immortals whose merit and conduct are incomplete cannot achieve this—how much less can ordinary mortals? Yet if you trust in the old master and practice diligently, you will come to know it for yourself.\n\nWhen qi does not flow smoothly, it may be too cold, too hot, too slow, or too rapid—adjust it until harmony is achieved.\n\n**Master Luan’s Qi-Absorption Method**\nFirst, sit on a broad seat, place both hands on the knees, loosen clothing and belt, and relax the limbs. Contemplate the equal nature of dharmata and the non-duality of life and death. After half a meal’s duration, close the eyes, raise the tongue to the palate, and slowly exhale long breaths—one, then two. Initially, others may hear the sound of the breath entering and leaving, but gradually it becomes finer. After ten or more breaths, one may hear it oneself.\n\nWhenever pain or itching arises, visualize it exiting from that spot. If any abnormality is sensed, gradually lengthen the exhalation, refining it from coarse to fine. After ten breaths, return to the initial state.\n\nSomeone asked: \"Why begin with coarse breaths that gradually refine, and at the end, return from fine to coarse?\"\n\nMaster Luan replied: \"All movement, sight, food, and speech are coarse. As Sangyuzi said: 'For those learning qi cultivation, whether before practice or after, eating, drinking, and speaking are ordinary matters.' I wish to ensure continuity, preventing abrupt disjunction between beginning and end.\"\n\nAfter waking from sleep, resume the practice as before, like a tiger carrying its cub—neither too urgent nor too slow. Regardless of cold or heat, first purify the room to prevent distractions and quiet the mind.\n\nHe also said: \"How to discern disharmony in the Four Great Elements? Observe the lips and mouth: cold indicates excess wind; heat, excess fire; roughness, excess earth; slipperiness, excess water. If neither cold nor hot, neither rough nor slippery, they are in harmony.\n\nOr listen to the voice: sound indicates excess wind; movement, excess panting; itching, excess heat; drool, excess water. If there is no sound, no movement, no itching, no drool, they are in harmony.\n\nOr observe the mind: vexation indicates heat binding; confusion, wind binding; anxiety and palpitations, panting binding; restlessness, water binding. If there is no vexation, no confusion, no palpitations, no restlessness, they are in harmony.\n\nDisharmony in the Four Great Elements arises from two sources: external or internal. Cold, heat, hunger, satiety, fatigue, and exhaustion are external causes; fame, profit, joy, anger, sound, color, flavor, and contemplation are internal causes.\n\nIn regulating qi, follow nature, maintaining it as if it were continuous yet not forced. Simply not taking life as life is wiser than nurturing life.\"\n\nSangyuzi said: \"All scriptures advise that in exhalation and inhalation, one should not hear one’s own breath. Yet Master Luan speaks of exhaling coarsely and gradually refining, then refining and gradually coarsening—I was deeply puzzled. Upon reading further, where it says 'follow nature,' I realized that the gradual progression from coarse to fine is the lowest level of practice, designed to avoid forcing it to compete with nature.\"",
      "overlap_context": "n qi is whole, spirit is whole. When qi is cut off, spirit perishes; when spirit perishes, one becomes mere dust.\n\nThus, physicians first examine the pulse to assess the qi of the five viscera and four seasons, investigate the sources of illness, and only then prescribe remedies. If one can discern the signs of qi, regulating inhalation and exhalation through the mouth and nose without momentary lapse, the five viscera will naturally harmonize, the pulse will regulate, and qi will flow smoothly.",
      "start_char": 1226,
      "end_char": 2499,
      "start_sentence": 67,
      "end_sentence": 117,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.71721124649048,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\延陵先生集新旧服气经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "然必以微细自不闻声为上，从细微而至无息即胎息之理尽矣。 恐学者功至之后，犹拘牵文字，着於厅细先后之问，返与自然为敌，良可衰也。 如此，人焉得不为之明辩矣？ 李奉时山人服气法 每欲服气，如婴儿吮乳，气息似闷，即咽之，依前吮咽，大闷即放令口出，甚须微细。 每咽使心送之至脐下，有病亦使心送至病处。 当服之时，第一须闭目专意，握固安定神气，然后为之先须导引，令四体舒缓，然后为之。 外服勿枕，舒手足，安定如病重，气甚闷，频蹙上至极，仍更握固，咽气又咽一气，气正声从耳中出，即得矣。 秘之！ 秘之！ 此为内气，无问早晚晴明阴晦，须服即服。 大都得晴明时大精，若服外气即有生死气。 知之，十年服之，五日不服，即无益矣。 每日五更午时服第一服了，须摄炼，兼以手按之，勿令心腹下硬。 蒙山贤者服气法 侧外，右胁着状，微缩两足，并着头向南面束，两手握固，傍其颐，闭取内气，极力开喉咽之，如此七咽一吐气。 病时服气，一咽两咽一吐。 功成，然后一七咽、二七咽一吐气，可也。 又调息令出入气匀，准前又咽，都四十九咽，然复起坐之。 坚膝座，两手相叉抱膝，闭气鼓腹二七或三七，气满即吐，更调息，特不得令喘赢，调讫又闭气，或二七三七一吐气，使腹调适乃休。 或汗出，头足皆热，此气遍也。 即常饱满，三关百节宣通畅适，行之十年登仙，老有少容。 夫《旧经》皆存想，恐为劳烦，却使心意难行，服气本於胎息，但无思念，自合元化之功，久久行之，当自知其妙矣。 仆游蒙山，遇此贤者，年可五十已下，其精神清明，颇异於俗。 因问，云：贞观已前游此山，不道姓名，自称老夫。 仆遂殷勤拜之，蒙授此诀，行之颇甚弘益。 妙哉！",
      "translated_text": "Yet the highest attainment lies in subtlety so refined that one no longer hears one’s own breath—proceeding from the finest subtlety to the point of no-breath, this is the full realization of fetal respiration. I fear that even after learners reach this stage, they may remain bound by the written word, fixating on the sequence of coarse and fine, and thus turn against the natural Way—how lamentable! In this matter, how could one fail to discern clearly?\n\n**Li Fengshi’s Mountain Recluse Qi-Swallowing Method**\nWhenever you wish to swallow qi, do so as an infant suckling milk: when the breath feels stifled, swallow it; then continue suckling and swallowing. If the stifling becomes severe, release it through the mouth, but always keep it exceedingly subtle. With each swallow, use the mind to guide it down to the navel; if there is illness, direct it to the afflicted area.\n\nWhen practicing, first close the eyes and focus the mind, clench the fists to stabilize spirit and qi, then begin. First perform *daoyin* to relax the four limbs, and only then proceed. For external qi-swallowing, do not use a pillow; stretch out the hands and feet, and remain composed. If the illness is severe and the qi feels extremely stifled, repeatedly raise it to the utmost, then clench the fists again, swallow the qi, and take one more breath. When the qi flows smoothly and sound emerges from the ears, success is achieved. Guard this! Guard this well!\n\nThis is internal qi—practice it regardless of early or late, clear or overcast weather. Generally, clear days yield the greatest essence; if swallowing external qi, one encounters both life-giving and death-dealing qi. Know this: if you practice for ten years but skip five days, it will be of no benefit.\n\nEach day at dawn and noon, take the first dose, then refine and compress it, pressing with the hands to prevent hardness below the heart and abdomen.\n\n**The Sage of Mount Meng’s Qi-Swallowing Method**\nLie on your right side, with the right flank resting on the mat, slightly drawing in the feet and aligning the head to face south. Clench both fists and place them beside the cheeks. Close your eyes, inhale internal qi, forcefully open the throat, and swallow—seven swallows, then exhale once. When ill, swallow once or twice, then exhale once. Once adept, you may swallow seven or fourteen times before exhaling.\n\nNext, regulate the breath to ensure even inhalation and exhalation, then swallow again as before, for a total of forty-nine swallows. Then rise and sit upright. Sit with knees bent, clasp the hands together and hold the knees, hold the breath, and distend the abdomen—fourteen or twenty-one times. When the qi is full, exhale, then regulate the breath again, taking care not to become breathless or weak. Once regulated, hold the breath again—fourteen or twenty-one times—before exhaling, until the abdomen feels harmonious and comfortable. Rest when done.\n\nIf sweat emerges and both head and feet grow warm, the qi has circulated throughout. Then you will always feel sated and full, the Three Passes and hundred joints will flow freely and comfortably. Practice this for ten years, and you will ascend as an immortal, growing old yet retaining a youthful countenance.\n\nThe ancient scriptures all employ visualization, but this may prove laborious and hinder the mind’s progress. Qi-swallowing originates in fetal respiration—simply free yourself from thoughts, and you will naturally align with the transformative power of the primordial. Practice long enough, and you will come to know its wonders for yourself.\n\nWhile traveling on Mount Meng, I encountered this sage, who appeared to be under fifty, yet his spirit was clear and luminous, quite unlike ordinary folk. When I asked, he said he had roamed this mountain before the *Zhenguan* era, refusing to give his name and calling himself simply \"Old Man.\" I bowed earnestly and entreated him, and he graciously imparted this secret. Practicing it has brought me great benefit. Wondrous indeed!",
      "overlap_context": "mply not taking life as life is wiser than nurturing life.\"\n\nSangyuzi said: \"All scriptures advise that in exhalation and inhalation, one should not hear one’s own breath. Yet Master Luan speaks of exhaling coarsely and gradually refining, then refining and gradually coarsening—I was deeply puzzled. Upon reading further, where it says 'follow nature,' I realized that the gradual progression from coarse to fine is the lowest level of practice, designed to avoid forcing it to compete with nature.\"",
      "start_char": 2499,
      "end_char": 3170,
      "start_sentence": 118,
      "end_sentence": 144,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.71517324447632,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\延陵先生集新旧服气经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "哉！ 凡欲得不死，肠中无屎，立曰滓欲得长生，五藏精明。 故《黄庭》云：何不食气太和精，故能不死入黄宁。 《阴符》云：积火可以焚五毒。 五毒则五味，五味尽可以长生。 西王母谓武帝曰：能益能易，名上仙籍。 不益不易，不离死厄。 所谓益易者，能益精易形也。 常能爱精握固，闭气吞液，则气化为血，血化为精，精化为液，液化为骨，行之不倦，精神充满。 为之，一年易气，二年易骸，一本为易血也。 三年易血，一本为易脉。 四年易肉，五年易筋，一云易髓。 六年易髓，七年易骨，八年易发，九年易形，十年道成，位居真人。 变化自由，即灵官玉女而侍焉。 王说山人服气新诀 子夏曰：食气者神明而寿。 《黄庭》云：玉池清水灌灵根，审能修之可长存。 释氏止观，其有用气疗疾法，是知气之与液，递相通润也。 古经法皆有时节行之，今议食气，不复以时节也。 液则时时助气，使调滑也。 所论食气，皆内气也，咽之代食耳！ 液者，咽之代浆耳。 上食新气，下泄旧气，使推陈而纳新也。 咽气不必饱满，下泄不必常出，但得无臭，即自平定。 咽气不必常咽，但气清则腹内自平。 夫然不须饱矣！ 初学之时，觉饥即食，不觉饥即止矣。 若食时，常以一咽两咽压之，则食易消，食渐消，加咽数，至食消，气自调下。 若觉腹中气小妨，即或行或外，束转西侧，以意想驱逐之使下。 若未下，不得急性忙迫，但以意冲融之，不久自泄也。 食气时若欲上噫，但任噫出，必不得抑之也。 桑榆子曰：夫功浅多噫，盖由乍服之得真气尚少，新气必多，不正而多，命官不受则宜徐徐攻之。 又初服之时，所咽者往往不到气海，则无所归投，返上为噫也。 若得内气又入到气海，自然无噫。 如着功多时，忽复噫者； 不是伤多，即是外气误入也哉。 欲下出，任下出，必不得闭之，在细意自审也。 消息盈虚，久而自得其妙矣！ 宜行步，兼小导引，引亦不得频为之，世问诸事，皆自细意斟酌之。 有诸疾，则绝粒三数日，轻则一日两日，更轻即绝一顷亦得。 若疾在上，以意想上驱之，在下，以意想下驱之，若在四支及左右侧，并以意想驱逐之，则愈矣。 大都不得闭之，若闭气即疾生。 所食物宜润畅，寒暑皆适宜也。 瘴疟时但绝粒数日，静居则差矣。 大威仪先生玄素真人用气诀 凡用气法，先须左右导引，令骨节开通，筋柔体弱。 然后正身端坐，吐纳三过，使无结滞，静虑忘形，令气平息。 良久徐徐先以口吐浊气，鼻引清气，凡此六七过，此名调气。 调气毕，即口鼻俱闭，虚含，令气满口，即鼓口十五过已上更佳。 如咽一大口水入腹，直以心存至气海中，良久，更依前法咽之，但以腹饱为度，亦不限过数。 然后虚心实腹，闭口以手左右摩腹上，令气流行，即鼻中细细放通，息勿令喘厅，恐失中和。 然后正身仰外，四平着状，枕高低与身平，两手握固，展臂离身四五寸，两脚亦相去四五寸。 然后鼻中息收，即口鼻俱闭，心存气行遍身，此名运气。 如有病，即心存气偏注病处，如气急，即鼻中细细放通息，口不开，候气息平，还依前法闭之，摇动两足指及手指并骨节，以汗出为度。 此名气通。 即徐徐收身侧卧，拳两脚，先左边侧外，经十息，即转右边侧外，亦十息，此名补损。",
      "translated_text": "Ah! For those who wish to attain deathlessness, let the intestines be free of waste, and in an instant, impurities will vanish. To achieve long life, let the five viscera be radiant with essence. Thus, the *Huangting* states: \"Why not consume the qi of Great Harmony and its essence? Then you may enter the Yellow Tranquility and never die.\" The *Yin Fu* says: \"Accumulated fire can burn away the Five Poisons.\" The Five Poisons are the five flavors, and mastering the five flavors can lead to long life. The Queen Mother of the West told Emperor Wu: \"Those who can augment and transform are recorded in the registers of the highest immortals. Those who neither augment nor transform cannot escape the calamity of death.\" This augmentation and transformation mean the ability to replenish essence and renew the form. By constantly cherishing essence, grasping firmness, closing the breath, and swallowing fluids, qi transforms into blood, blood into essence, essence into fluid, and fluid into bone. Practicing this without weariness, the spirit becomes full and abundant. In the first year, the qi is renewed; in the second, the bones; one text says the blood. In the third year, the blood is renewed; one text says the vessels. In the fourth, the flesh; in the fifth, the sinews; one text says the marrow. In the sixth, the marrow; in the seventh, the bones; in the eighth, the hair; in the ninth, the form. After ten years, the Dao is accomplished, and one attains the rank of Perfected. With free transformation, spirit officials and jade maidens will attend you.\n\nWang’s *New Methods of Qi-Swallowing for Mountain Recluses*:\nZixia said: \"Those who consume qi become spiritually luminous and long-lived.\" The *Huangting* states: \"The Jade Pool’s pure water irrigates the numinous root; if you can cultivate this, you may endure forever.\" In Buddhist *śamatha-vipaśyanā*, there is a method using qi to heal illness, showing that qi and fluids mutually nourish one another. Ancient scriptures prescribed specific times for practice, but now, in discussing qi consumption, we no longer adhere to fixed times. Fluids should constantly assist qi to keep it smooth and harmonious. What is called \"consuming qi\" refers to internal qi, swallowing it in place of food. Fluids are swallowed in place of drink. Above, one consumes fresh qi; below, one expels old qi, pushing out the stale and taking in the new. Swallowing qi need not be to fullness, nor must the expulsion be constant—simply ensure it is odorless, and equilibrium will naturally be achieved. Swallowing qi need not be frequent; when the qi is clear, the abdomen will naturally settle. Thus, there is no need for fullness. When beginning, eat when hungry, and stop when not. While eating, always follow with one or two swallows of qi to aid digestion. As food gradually diminishes, increase the number of swallows until the food is gone and the qi naturally descends. If you feel the qi slightly obstructed in the abdomen, either walk or stand, turning to the west, and use intention to drive it downward. If it does not descend, do not rush or force it; simply use intention to dissolve it, and soon it will naturally be expelled. When consuming qi, if you need to belch, let it come freely—do not suppress it. Sangyuzi said: \"Those with shallow practice belch often, for they have just begun and obtained little true qi, so the new qi is abundant but unrefined. The life-officials cannot receive it, so it should be gradually refined.\" Moreover, when first practicing, the swallowed qi often fails to reach the *qi* sea, leaving it nowhere to settle, so it rises back up as belching. If the internal qi enters the *qi* sea, belching naturally ceases. If, after practicing for a long time, belching suddenly recurs, it is either due to overeating or the accidental intake of external qi. If you need to expel it downward, let it go—do not hold it back. Proceed with careful attention, adjusting for fullness and emptiness, and in time, you will grasp its wonders.\n\nIt is advisable to walk and perform gentle *daoyin* exercises, but do not do so too frequently. In all worldly matters, proceed with thoughtful deliberation. For illnesses, fast for three to several days; for mild cases, one or two days suffice, or even just a short while. If the illness is in the upper body, use intention to drive it upward; if below, drive it downward. For ailments in the limbs or on the left or right sides, use intention to expel them, and you will recover. Above all, do not hold the breath, for doing so will generate illness. The foods consumed should be moist and smooth, suitable for all seasons. During miasmic fevers, simply fast for several days and rest quietly to recover.\n\n*Methods of Qi Utilization by the Great Dignitary Master Xuan Su, the Perfected*:\nIn all methods of using qi, first perform *daoyin* exercises to the left and right, loosening the joints, softening the sinews, and relaxing the body. Then sit upright, exhale and inhale three times to eliminate blockages, calm the mind, and forget the body, allowing the breath to settle. After a long while, slowly exhale turbid qi through the mouth and draw in clear qi through the nose, repeating this six or seven times—this is called \"regulating the qi.\" Once regulated, close both mouth and nose, hold the breath lightly, and fill the mouth with qi. Swish it in the mouth fifteen times or more for better results. Swallow it as if taking a large gulp of water, directing it with the mind to the *qi* sea. After a long while, swallow again in the same manner, continuing until the abdomen is full, without limiting the number of swallows. Then empty the mind and fill the abdomen, close the mouth, and massage the abdomen with both hands to circulate the qi. Gently release the breath through the nose, ensuring it does not become labored, lest harmony be lost. Then lie flat on your back, keeping the body level, with the pillow at the same height as the body. Clench the fists, extend the arms four or five inches from the body, and space the feet four or five inches apart. Then inhale through the nose, close both mouth and nose, and focus the mind on the qi circulating throughout the body—this is called \"circulating the qi.\" If there is illness, direct the qi to the affected area. If the qi becomes urgent, gently release the breath through the nose without opening the mouth. Once the breath is calm, close it again as before. Shake the toes and fingers, along with the joints, until sweat appears—this is called \"qi passage.\" Then slowly roll onto your side, draw up the legs, first lying on the left side for ten breaths, then turning to the right side for another ten breaths—this is called \"repairing deficiencies.\"",
      "overlap_context": " long enough, and you will come to know its wonders for yourself.\n\nWhile traveling on Mount Meng, I encountered this sage, who appeared to be under fifty, yet his spirit was clear and luminous, quite unlike ordinary folk. When I asked, he said he had roamed this mountain before the *Zhenguan* era, refusing to give his name and calling himself simply \"Old Man.\" I bowed earnestly and entreated him, and he graciously imparted this secret. Practicing it has brought me great benefit. Wondrous indeed!",
      "start_char": 3170,
      "end_char": 4406,
      "start_sentence": 145,
      "end_sentence": 200,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.4333598613739,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\延陵先生集新旧服气经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "依此法服经一月，后行立坐外时，但腹空，即鼓咽之，不限时节。 如吃饭了即吃空饭一两口，和水咽下，此名洗五藏，即以清水熟漱口，虚心实腹，令脏叶舒展，咽之，令五藏不停五味气。 讫，即以口先吐浊气，鼻引清气，不限多少，尽须放之。 如下泄一浊气出，还鼓炼一口，和气补之。 若寻常吃饼饮茶，皆外气入，当须入口，便合口，口既合，口中所入外气，即於鼻中出也。 鼻中却入气，即是清气也。 常须合口吃食，不令口中有气入，入即是死气。 凡人言语。 口中气出，必须却於鼻中入，此常行吐纳也。 行住坐外，常须摇动脚指，此名常令气得下流。 常行此事，动静念之，如节候不精，忽有外气入腹，即觉微痛，可闭气摩腹一百下，气即t 下泄也。 气或上，必不得出，抑之使下，此名理顺。 忌破气物及生玲枯腻等物，如依此法，不阙常行，九年功成，履空如履实，履水如履地。 胎息口诀并序 序曰：在胎为婴，初生曰孩，婴儿在腹中，口含泥土，喘息不通，以脐咽气，养育形兆，故得成全。 是以脐为命门，凡孩或有初生尚活，少顷辄不收者，但以暖水浸脐带，向腹暖三五过即苏，则知脐为命门，信然不谬。 道者欲求胎息，先须知胎息之根源，按而行之，喘息如婴儿在腹中，故名胎息矣。 乃知返本还源，却老归婴，自有由矣。 绵绵不问，胎仙之道成焉。 故先序经纪，体用兼明备矣。 凡欲胎息，先须於静室中，勿令人入，正身端坐，以左脚搭右脚上，解缓衣带，徐徐按捺支节，两手握固於两腿上，即吐纳三五过，令无结滞。 涤虑清闲，虚心实腹，左右徐徐摇身，令脏叶舒展。 讫，还徐徐放着实，即呜天鼓三十六通，漱满华池，然后存。 头戴朱雀，脚履玄武，左肩有青龙，右肩有白虎。 然后想眉问却入一寸为明堂，却入二寸为洞房，却入三寸为丹田宫。 亦名泥丸宫。 宫中有神人长二寸，戴青冠，披朱褐，执绛简。 次存中丹田，中丹田，心也。 亦名绛官。 中有神人亦披朱褐。 次存下丹田，在脐下二寸半紫微宫，亦名气海也。 中有神人，亦披朱褐。 次存五藏，从心起首，遍存五藏六府。 存五藏中各出本方气，及三丹田中素云合为一气，於顶中出，焕焕分光九色，上腾可长三丈。 余想身在其中，此时即口鼻俱闭，心存气海中，胎气出入，喘息只在脐中。 如气急，即鼻中细细放通息，候气平，还依前用心为之，以汗出为一过，亦不限过数。 如体热闷，即心存气遍身出，如饭饭中气，此名满息。 久久行之，入玄寂中，出妙默中，再明洞观形中五藏六府，及大小腹，胃受散膏如黄土色，脾长一尺二寸，在胃上，前后磨动不停，停则不和，饭食不消，即是不磨矣。 当须闭气，以手摩腹一百下，即自然转磨矣。 次存心，心似红莲华未开，下垂，长三寸，上有九窍，二窍在后，正面有黑毛七叶，长二寸半。 次存肺，肺似白莲华开，五叶下垂，上有白脉膜，在心上覆心。 次存肝，肝在心后，七叶紫苍色，上有黄脉膜，从左边第三叶下，在此也。 其胆色青黄，长二寸半。 次胆存肾，肾状如覆杯，黑色，却着脊，去脐三寸，上小下大，左为上，右为下。 遍观一形三十六位，及三百六十骨节，皆有筋缠，骨青白如玉色，筋色黄白，髓若冰雪，有三百六十穴，穴穴之中皆有鲜血，如江河池潭也。",
      "translated_text": "After practicing this method for a month, whether standing or sitting at any time, whenever the abdomen feels empty, perform the swallowing technique without regard to time or season. After eating, take one or two mouthfuls of plain rice, mix it with water, and swallow—this is called \"washing the five viscera.\" Then rinse the mouth thoroughly with clean water, keeping the mind empty and the abdomen full, allowing the visceral leaves to unfold. Swallowing in this way prevents the five viscera from retaining the qi of the five flavors. Once done, first exhale turbid qi through the mouth, then draw in clear qi through the nose, without limit to the amount, until fully released. If a turbid qi is expelled downward, immediately replenish it by swallowing a mouthful of harmonized qi. When eating cakes or drinking tea, external qi enters; as soon as it does, close the mouth. Once closed, the external qi that entered the mouth should be expelled through the nose. The qi drawn in through the nose is then clear qi. Always keep the mouth closed while eating to prevent external qi—dead qi—from entering. Whenever speaking, qi exits through the mouth, so it must be drawn back in through the nose—this is the constant practice of exhalation and inhalation.\n\nIn all postures—walking, standing, or sitting—constantly wiggle the toes, for this is called \"allowing the qi to flow downward.\" Persist in this practice, whether in motion or stillness. If, due to imprecise timing, external qi enters the abdomen and causes slight pain, close the breath and rub the abdomen one hundred times to guide the qi downward. If the qi rises and must not be expelled, press it downward—this is called \"regulating and harmonizing.\"\n\nAvoid foods that disrupt qi, as well as raw, cold, dry, or greasy items. If this method is practiced without interruption, after nine years of cultivation, one will walk on emptiness as if on solid ground and tread upon water as if on land.\n\n**Preface and Secret Instructions on Embryonic Breathing**\n\n**Preface:**\nWhile in the womb, one is an infant; at birth, a child. The infant in the womb, its mouth filled with earth, breathes not through the nose or mouth but draws qi through the navel to nourish its form, thus achieving completion. Therefore, the navel is the Gate of Life. If a newborn appears alive but then suddenly fails, simply soak the umbilical cord in warm water and apply it to the abdomen three to five times to revive it. This confirms that the navel is indeed the Gate of Life, a truth beyond doubt.\n\nThose who seek embryonic breathing must first understand its root. By following this principle, one’s breathing becomes like that of an infant in the womb—hence the name \"embryonic breathing.\" Thus, returning to the origin and reverting to infancy has its reason. With unbroken practice, the Dao of the embryonic immortal is achieved. Therefore, the preface clarifies both the essence and application.\n\n**Instructions:**\nTo practice embryonic breathing, first enter a quiet chamber where no one may disturb you. Sit upright, place the left foot over the right, loosen the clothing and belt, and gently press and stretch the joints. Clench the fists and rest them on the thighs. Perform three to five cycles of exhalation and inhalation to eliminate stagnation. Calm the mind, empty the heart, and fill the abdomen. Slowly sway the body left and right to unfold the visceral leaves. Once done, return to a steady posture. Then strike the \"Heavenly Drum\" thirty-six times, rinse the mouth with the \"Flower Pool,\" and begin visualization.\n\nImagine the Vermilion Bird above the head, the Dark Warrior beneath the feet, the Azure Dragon on the left shoulder, and the White Tiger on the right. Next, visualize a point one inch behind the space between the eyebrows as the \"Hall of Light,\" two inches inward as the \"Cavern Chamber,\" and three inches inward as the \"Palace of the Cinnabar Field,\" also called the \"Mud Pill Palace.\" Within this palace resides a spirit two inches tall, wearing a green crown, clad in red-brown robes, and holding a crimson tablet.\n\nNext, visualize the Middle Cinnabar Field—the heart, also called the \"Crimson Palace.\" Within it dwells a spirit similarly robed in red-brown. Then visualize the Lower Cinnabar Field, located two and a half inches below the navel in the \"Purple Tenuity Palace,\" also known as the \"Sea of Qi.\" Within it resides another spirit, also clad in red-brown.\n\nNext, visualize the five viscera, beginning with the heart, and extend the visualization to the five viscera and six bowels. From each viscus, emit its corresponding directional qi, merging with the white clouds from the three cinnabar fields into a single qi that rises from the crown, radiating nine-colored light to a height of three *zhang*. Envision the body within this luminous sphere.\n\nAt this point, close both mouth and nose, focusing the mind on the Sea of Qi. Let the embryonic qi enter and exit, with breathing confined to the navel. If the qi becomes urgent, gently release the breath through the nose, and once the qi is calm, resume the practice as before. Sweating marks the completion of one cycle, though the number of cycles is not fixed. If the body feels hot or stifled, direct the qi to flow throughout the body like steam rising from rice—this is called \"full breathing.\"\n\nWith prolonged practice, one enters profound stillness and emerges into wondrous silence, clearly perceiving the five viscera and six bowels within the body, as well as the upper and lower abdomen. The stomach, filled with dispersed fat, appears yellow like earth. The spleen, one foot two inches long, lies above the stomach, constantly grinding back and forth; if it stops, harmony is lost, and food is not digested—this indicates it is not grinding. In such cases, close the breath and rub the abdomen one hundred times to restore its natural movement.\n\nNext, visualize the heart: it resembles an unopened red lotus, three inches long, hanging downward, with nine orifices—two at the back—and seven black hairs, two and a half inches long, on its front. Then visualize the lungs: they resemble an open white lotus with five hanging petals, covered by white veins and membranes, resting above the heart. Next, visualize the liver: located behind the heart, it has seven purple-green leaves with yellow veins and membranes, with the third leaf on the left side being its position. The gallbladder is green-yellow and two and a half inches long. Then visualize the kidneys: shaped like an inverted cup, black in color, attached to the spine three inches from the navel, smaller above and larger below, with the left kidney above and the right below.\n\nSurvey the entire body—thirty-six positions and three hundred sixty joints—all bound by sinews. The bones are jade-like in their blue-white hue, the sinews yellow-white, and the marrow like ice and snow. There are three hundred sixty acupoints, each filled with fresh blood like rivers, lakes, and ponds.",
      "overlap_context": "i.\" If there is illness, direct the qi to the affected area. If the qi becomes urgent, gently release the breath through the nose without opening the mouth. Once the breath is calm, close it again as before. Shake the toes and fingers, along with the joints, until sweat appears—this is called \"qi passage.\" Then slowly roll onto your side, draw up the legs, first lying on the left side for ten breaths, then turning to the right side for another ten breaths—this is called \"repairing deficiencies.\"",
      "start_char": 4406,
      "end_char": 5654,
      "start_sentence": 201,
      "end_sentence": 245,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.838990926742554,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\延陵先生集新旧服气经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "及见左脚中指第二节是血液上源，其中涌出，通流一日一夜，绕身三万六千匝，至右脚中指第二节，则化尽，所以人若睡，必须侧卧拳局，阴魄全也。 亦觉，即须展两脚及两手，令－气遍身，阳气布也。 若如此修行，即与经所言动善时之义合矣。 久久行之，口鼻俱无喘息，如婴儿在胎，以脐通气，故谓之胎息矣。 绵绵不问，经三十年，以绳勒项，不令通气，亦不喘息。 喘息常在脐中，水底坐经十日、五日亦可矣。 以能行此事，功效如前，若觉得真，更须修道，此事乃是一门，不可不作。 胎息精微论 老君曰：知道者天不杀，含德者地不害，道德相抱身不衰老。 内食太和，元气为首，清静自炼，委身放体，志无念虑，安定藏府，洞极太和。 长生久视，潜气不动，意如流水，前波已去，而后波续处不返也。 行之不休，得道真矣。 每日入静室守玄元。 玄元谓存玄门。 玄中有玄是我命，命中有命是我形，形中有形是我精，精中有精是我气，气中有气是我神，神中有神是我自然。 德以形为车，道以气为马，魂以精为根，魄以目为户。 形劳则德散，气越即道叛，精销魂损，目动魄微。 是以守静爱气，全精宝神，道德凝密，魂魄固守。 所以含道不言，得气之真，肌肤润泽，得道之根。 手足流汗，精气充溢，不饥不渴，龟龙胎息，绵绵长存，用之不勤，饮於玄泉，登於太清。 还年返婴，道之自然。 至道不远，近在已身。 用心精微，命乃永存。 夫道者，或传服五牙，五牙者五行之生气。 （黄庭内景》 云：存漱五牙不饥渴。 八方四时、日月星辰等气，思自顶而入，自鼻而出。 虽古经所载，为之者少见成遂，亦非食谷者所能行致耳。 是以服气者多不得其诀，徒劳精勤矣。 既得其门，复悟其诀，即在精勤不懈耳。 桑榆子曰：乌鸥而志乎天地，是不知量，彼五牙、八方、四时、日月、星辰等教不为初地者设，无成也。 当俟其稍近之时可也。 凡胎息服气，从夜半后服内气，七咽，每一咽既调气六七息，即更咽之。 每咽如水流过坎声，是气通也。 直下气海中，凝结腹中，充满如含胎之状。 气从有胎中息，气海中有气充然后为胎息之道也。 气成即清气凝为胎，浊气散而出。 散从手足及毛发而出也。 胎成即万病自遣，渐通仙灵，今之学其气也，或得古方，或授自非道，皆闭口缩鼻，但贵息长，而不知五藏壅闭，畜损正气，殊非自然之息。 但烦劳形神，无所裨益，凡服气之时，即须关节通，胃海开纳元气，固纳毕，即关节还闭，徐徐鼻出纳外气，自然外内不杂，胎中气亦不出。 但潜屈指数息，从十至百数，从一百至二百、三百，此为小通，即耳目聪明，百疾皆愈。 若抑塞口鼻，拟习胎息，殊无此理也。 口鼻气既不通，即畜损藏府，有何益哉！ 凡饵内气者，用力寡而见功多，唯在安神静虑，不烦不扰，即气道疏畅，关节开通，内含元和，终日不散，肤体润泽，手足汗出，长生之道，诀在此矣。 从夜半后，服七咽即闭气者，但内气不出，鼻口常徐徐出纳外气，内外都不相杂，至五更又服七咽，平旦又服七咽，三七都二十一咽，止。 若休根者，即不限此数，肚空即咽内气，咽内气常满，自元饥渴也。 初似小难，久久习惯，自然内外之气不相混释也。",
      "translated_text": "Observe further that the second joint of the middle toe on the left foot is the source of the bloodstream. From there, it surges forth, flowing through the body in a single day and night, circling thirty-six thousand times before reaching the second joint of the middle toe on the right foot, where it is fully transformed. Thus, when one sleeps, one must lie on the side with limbs curled—this preserves the yin *po*. Upon awakening, one should stretch the feet and hands, allowing the *qi* to permeate the entire body, thereby spreading the yang *qi*.\n\nBy practicing thus, one aligns with the meaning of \"acting in accord with the good times\" as spoken in the classics. With prolonged practice, both mouth and nose cease their breathing, as if one were an infant in the womb, drawing *qi* through the navel—this is called \"embryonic breathing.\" Uninterrupted, after thirty years, one may bind a cord around the neck without obstructing breath, nor will there be any panting. The breath remains in the navel, and one may sit underwater for ten days—or five days—with equal ease. Having mastered this, the effects are as described above. Once the truth of this is realized, one must further cultivate the Dao; this practice is but one gateway and cannot be neglected.\n\n*The Subtleties of Embryonic Breathing*\nThe Old Lord said: \"One who knows the Dao is not slain by Heaven; one who embodies virtue is not harmed by Earth. Embracing both Dao and virtue, the body does not decay. Internally nourishing the Great Harmony, with primordial *qi* as the foundation, refining oneself in stillness, relinquishing the body and releasing the form, the mind free of thoughts and cares, the viscera settled and stable—thus one penetrates the Great Harmony. Long life and enduring vision arise when the *qi* lies hidden and unmoving, the mind like flowing water, where the preceding wave departs and the succeeding wave follows without return. Practicing without cease, one attains the true Dao.\"\n\nEach day, enter a quiet chamber to guard the Mysterious Origin. The Mysterious Origin refers to preserving the Mysterious Gate. Within the Mysterious lies the yet more Mysterious—this is my life. Within life lies life—this is my form. Within form lies form—this is my essence. Within essence lies essence—this is my *qi*. Within *qi* lies *qi*—this is my spirit. Within spirit lies spirit—this is my spontaneity.\n\nVirtue rides the chariot of form; the Dao rides the steed of *qi*. The *hun* is rooted in essence; the *po* dwells in the eyes. When the form is wearied, virtue scatters; when *qi* strays, the Dao rebels. When essence wanes, the *hun* is harmed; when the eyes stir, the *po* weakens. Thus, one guards stillness and cherishes *qi*, preserves essence and treasures spirit, so that Dao and virtue congeal and coalesce, while *hun* and *po* remain steadfast.\n\nTherefore, one who embodies the Dao speaks not, yet grasps the truth of *qi*; the skin becomes lustrous, the root of attaining the Dao. Hands and feet perspire, essence and *qi* overflow, hunger and thirst vanish—like the tortoise and dragon, one achieves embryonic breathing, ceaseless and enduring, effortlessly sustained. One drinks from the Mysterious Spring and ascends to the Great Clarity, returning to youth and reverting to infancy—such is the spontaneity of the Dao.\n\nThe Supreme Dao is not distant; it lies within one’s own body. With a mind refined and subtle, life is eternally preserved. As for the Dao, some transmit the practice of ingesting the Five Sprouts—the Five Sprouts being the generative *qi* of the Five Phases. *The Yellow Court Inner Scene* states: \"Preserve and rinse with the Five Sprouts to banish hunger and thirst.\" Absorb the *qi* of the eight directions, four seasons, sun, moon, and stars, envisioning it entering through the crown and exiting through the nose. Though ancient classics record this, few who practice it achieve success, nor is it attainable for those who consume grains.\n\nThus, many who practice *qi*-ingestion fail to grasp its secrets, laboring in vain. Once the gateway is found and the secrets comprehended, success lies in diligent and unrelenting practice. Sang Yuzi said: \"To crane like a crow or seagull, aspiring to Heaven and Earth, is to overreach—those teachings on the Five Sprouts, eight directions, four seasons, sun, moon, and stars are not meant for beginners. Without attainment, they are futile; one must wait until one has drawn somewhat nearer.\"\n\nFor embryonic breathing and *qi*-ingestion, begin after midnight, swallowing the internal *qi* seven times. With each swallow, regulate the breath for six or seven cycles before swallowing again. Each swallow should sound like water flowing over rapids—this indicates the *qi* is unobstructed. Direct it straight down to the *qi* Sea, where it congeals in the abdomen, filling it like a womb with child. The breath then arises from within this \"embryo,\" and only when the *qi* Sea is replete does the Way of embryonic breathing take form. When the *qi* is perfected, the pure *qi* congeals into an embryo, while the turbid *qi* disperses outward—through the hands, feet, and hair.\n\nOnce the embryo is formed, all illnesses naturally depart, and one gradually communes with the immortals. Those who study *qi*-ingestion today may obtain ancient methods or receive instruction from unorthodox sources, merely closing the mouth and constricting the nose, prizing long breaths while remaining ignorant of the blockages in the five viscera, which damage the upright *qi*. Such practices are far from natural breathing, only wearying body and spirit without benefit.\n\nWhen ingesting *qi*, the joints must be open, the Stomach Sea receptive to primordial *qi*. Once the *qi* is firmly gathered, the joints close again, and one slowly exhales and inhales external *qi* through the nose, ensuring no mingling of internal and external *qi*, nor any leakage of the embryonic *qi*. Silently count the breaths by curling the fingers, from ten to a hundred, then from a hundred to two hundred, three hundred—this is the \"lesser circulation.\" The ears and eyes become keen, and all illnesses are cured. To forcibly block the mouth and nose in an attempt to practice embryonic breathing is entirely misguided. If the mouth and nose are obstructed, the viscera are harmed—what benefit could there be?\n\nFor those who ingest internal *qi*, little effort yields great results. The key lies in calming the spirit and quieting the mind, free from disturbance—then the *qi* pathways become unobstructed, the joints open, and primordial harmony is contained within, never dissipating. The body becomes moist and lustrous, hands and feet perspire—the secret of the Way to longevity lies herein.\n\nAfter midnight, swallow seven times and hold the breath, keeping the internal *qi* within while slowly exhaling and inhaling external *qi* through the nose and mouth, ensuring no mingling of internal and external. At the fifth watch, swallow seven more times, and again at dawn, totaling twenty-one swallows. Those who have severed their roots are not bound by this number; when the stomach is empty, they swallow internal *qi*, keeping it constantly full, naturally free from hunger and thirst. Initially, this may seem difficult, but with long practice, the internal and external *qi* naturally cease to mingle.",
      "overlap_context": "alize the kidneys: shaped like an inverted cup, black in color, attached to the spine three inches from the navel, smaller above and larger below, with the left kidney above and the right below.\n\nSurvey the entire body—thirty-six positions and three hundred sixty joints—all bound by sinews. The bones are jade-like in their blue-white hue, the sinews yellow-white, and the marrow like ice and snow. There are three hundred sixty acupoints, each filled with fresh blood like rivers, lakes, and ponds.",
      "start_char": 5654,
      "end_char": 6873,
      "start_sentence": 246,
      "end_sentence": 291,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.771875619888306,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\延陵先生集新旧服气经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "惭渐关节开通，毛发疏畅，气自来往，亦不假鼻中徐徐通外气也。 胎息之妙，穷於此也。 胎息杂诀 一经云：但徐徐引气出纳，则元气亦不出也。 自然内外之气不杂，此名胎息。 然初甩功之人，闭固内气讫，一亦鼻中微微通气往来，使令不到咽喉，一而返气即逆满上冲，不可抑塞，如此即徐徐放令通畅，候气调，即复闭之，切在徐徐鼻中出入，勿令至喉，极力抑忍。 为之须臾，忽然自调畅，内外泰矣。 此盖关节开毛孔通故也。 到此，即千息亦不倦矣。 又胎息之妙，功在无思无虑，体合自然，心如死灰，形如枯木，即百脉畅，关节通矣。 若忧虑百端，起灭相继，欲求至道，徒卖艰勤，终无成功。 桑榆子曰：有苦恼之气虑，有贪恶之气，诸如此类，皆邪气横中，能为元气之关防，亦犹小人当路，则君子无所逞其才也。 此道至微至妙，出尘之士，方可为之。 未离名利之问，徒劳介意。 桑榆子曰：纵未出尘，但能使心不乱，不见可欲，则可矣。 一经云：咽气满讫，便闭气存想，意如流水，前波已去，后浪续处。 凡胎息用功后，关节开通，毛发疏畅，即依此，但鼻中微微引气，想从四支百毛孔出，往而不返也。 后气续到，但引之而不吐也。 功在於徐徐，虽云引而不吐，所引亦不入於喉中，微微而散，如此内气亦不流散矣。 秘要口诀 天关中为内气，口为天关生神机，手为人关把盛衰； 足为地关生命扉。 并《黄庭内景》云。 神庐中为外气。 神庐，鼻也。 神庐之中欲修治。 《黄庭内景》云。 凡服气，皆取阳时。 自夜半平旦也，即东南向，静端坐，叩齿三通，三漱津咽之。 则两手相摩，令掌心热，揩拭面目。 便以大拇指上下揩其肾骨七遍，即握固鼓气，以满天关，调匀为度，合闭口而咽之。 即努腹讫，徐徐出神庐中气，其神庐中当修治之，鼓努每须相应，一鼓一咽一努，为相应也。 其鼓咽之时，天关莫开，恐生气入腹而为疾也。 夫服气，须安神定志，徐徐咽之，急即心胸中气不散，结痛，每咽五十服，渐加至百服，二百三百服，有他故，即二十三十服，行住服之，并得，临时自消息也。 所贵常行，不欲阙日。 如初服有噫气上，即鼓而却咽，无使气出。 桑榆子曰：元气融和，不为厅厉，必若噫上，岂元和之气耶？ 然初始之时，特以气道未得全畅，事须抑就，但以元气待之也。 若至再至三，气海不受，必惹着五藏之中旧有浊气，如此固亦不宜爱惜，宜也。 忽下部有气，即泄之不妨，每一鼓咽气，须调和徐缓，不欲天关中有一声，若咽急，恐下部气闭，令人脱肛，慎之。 如服内气，久而自通，通即服，无时矣。 但饥即服之，饱即止之。 每鼓咽之际，常存思气入五藏流行，即从手足心及顶三关九窍支节而出，忽有疾？ 即思以气攻其痛处。 何疾不愈？ 如要服气休粮，即不论咽鼓努多少，常令腹满为度，勿令肠厌，若饥即时服三五一一咽，以意自调息，勿须仰外即气难下，一一损人心胸。 凡气相应； 即腹中有声，愚一者谓之肠空即有声，有声即损人，甚不一然矣！ 此犹雷呜电击，陶炼阴气，百关一流润，真要深门也。 夫服气多方，若非一鼓努之法，不为真妙。 或有人未解服一气，气未通流，便虚其心，忘其形，虽曰一效其坐忘，必无所成，多令困弊也。",
      "translated_text": "Gradually, the joints open fully, the hair and pores become unobstructed, and *qi* moves freely of its own accord—no longer requiring the slow passage of external *qi* through the nose. The subtlety of fetal breathing culminates here.\n\nA classic on fetal breathing states: \"Simply draw *qi* in and out gently, and primordial *qi* will not escape. Naturally, internal and external *qi* do not mingle—this is called fetal breathing.\" Yet for beginners, after sealing the internal *qi*, one must still allow a faint exchange of *qi* through the nose, ensuring it does not reach the throat. If the breath reverses and surges upward, unable to be restrained, release it slowly until it flows smoothly, then resume closure once the *qi* is regulated. The key lies in the gentle passage of *qi* through the nose, never allowing it to reach the throat, and restraining it with utmost effort. After a brief practice, harmony suddenly arises, and internal and external *qi* become serene. This occurs because the joints open and the pores unblock. At this stage, even a thousand breaths bring no fatigue.\n\nThe subtlety of fetal breathing lies in thoughtlessness and carefreeness, the body merging with nature, the mind like dead ashes, the form like withered wood—then the hundred vessels flow freely, and the joints open. If worries and distractions arise ceaselessly, seeking the ultimate Dao will be in vain, despite arduous effort. Master Sangyuzi said: \"There is the *qi* of suffering and vexation, the *qi* of greed and malice—all such perverse *qi* obstructs the primordial *qi*, just as petty men block the path, leaving gentlemen no room to display their talents.\" This Dao is most subtle and wondrous; only those who have transcended the mundane may practice it. Those still entangled in fame and profit labor in vain. Master Sangyuzi said: \"Even if one has not transcended the mundane, as long as the mind remains undisturbed and free from desire, it suffices.\"\n\nA classic states: \"After swallowing *qi* to fullness, close the breath and visualize the mind like flowing water—where the preceding wave departs, the succeeding wave follows.\" Once fetal breathing is mastered and the joints open while the pores become unobstructed, proceed thus: gently draw *qi* through the nose, imagining it exiting through the four limbs and the pores of the body, flowing outward without return. When the next breath arrives, draw it in without exhaling. The practice lies in gradualness; though it is said to draw without exhaling, the *qi* drawn does not enter the throat but disperses faintly. In this way, internal *qi* does not dissipate.\n\n**Secret Oral Instructions:**\nThe mouth is the Celestial Pass for internal *qi*, the gateway of the divine mechanism;\nThe hands are the Human Pass, grasping prosperity and decline;\nThe feet are the Earthly Pass, the threshold of life.\nAs the *Huangting Neijing* states.\n\nThe nose is the abode of external *qi*.\nThe nose is the \"divine hut,\" which must be cultivated.\nAs the *Huangting Neijing* states.\n\nFor all *qi*-swallowing practices, choose yang hours—from midnight to dawn—face southeast, sit upright in stillness, knock the teeth three times, rinse the mouth with saliva three times, and swallow. Rub the hands together until the palms grow warm, then wipe the face and eyes. Use the thumbs to rub the kidney meridian seven times, clench the fists, and fill the Celestial Pass with *qi* to a harmonious degree, then close the mouth and swallow. Expand the abdomen, then slowly exhale through the nose, ensuring the \"divine hut\" is well-regulated. Each expansion and swallow should correspond—one expansion, one swallow, one expansion of the abdomen. While expanding and swallowing, do not open the Celestial Pass, lest external *qi* enter the abdomen and cause illness.\n\nWhen swallowing *qi*, calm the spirit and steady the mind, swallowing gently. If done hastily, the *qi* in the chest will not disperse, causing pain and congestion. Begin with fifty swallows, gradually increasing to a hundred, two hundred, or three hundred. If other matters arise, reduce to twenty or thirty swallows, practicing while walking or standing as needed, adjusting as circumstances allow. Consistency is paramount; do not skip days. If belching occurs at the outset, expand the abdomen and swallow again, preventing the *qi* from escaping. Master Sangyuzi said: \"When primordial *qi* is harmonious, it does not cause harm. If belching arises, how can it be the *qi* of primordial harmony?\" Initially, the *qi* pathway may not be fully unobstructed, requiring restraint and accommodation, but one must rely on primordial *qi*. If after two or three attempts the *qi* sea cannot receive it, it may stir the turbid *qi* lingering in the five viscera. In such cases, do not cling to it; if lower abdominal *qi* arises, release it without hesitation.\n\nWhen expanding and swallowing *qi*, regulate it gently and slowly, ensuring no sound emerges from the Celestial Pass. If swallowing is too rapid, the lower *qi* may become blocked, causing rectal prolapse—beware. With prolonged practice, internal *qi* will flow freely, and one may swallow at any time. Swallow when hungry, cease when full. During each expansion and swallow, visualize the *qi* entering the five viscera and circulating, then exiting through the palms, soles, the three passes of the crown, the nine orifices, and the joints. If illness arises, direct the *qi* to attack the afflicted area—what ailment will not be cured?\n\nTo practice *qi*-swallowing for fasting, do not fixate on the number of expansions, swallows, or abdominal exertions; simply keep the abdomen full without overburdening the intestines. When hungry, swallow three to five times, adjusting naturally without seeking external *qi*, which may hinder descent and harm the chest. When *qi* harmonizes, the abdomen may rumble—some mistakenly call this \"intestinal emptiness\" and believe it harms the body, but this is far from true. It is like thunder and lightning refining yin *qi*, nourishing the hundred vessels in a single flow—truly the profound gate of the Dao.\n\nThough there are many methods of *qi*-swallowing, none surpass the technique of expansion and swallowing for true subtlety. Some, failing to grasp the single breath or unobstructed *qi* flow, empty their minds and forget their bodies, claiming the efficacy of seated forgetfulness. Yet this yields no achievement and often leads to exhaustion.",
      "overlap_context": "nd inhaling external *qi* through the nose and mouth, ensuring no mingling of internal and external. At the fifth watch, swallow seven more times, and again at dawn, totaling twenty-one swallows. Those who have severed their roots are not bound by this number; when the stomach is empty, they swallow internal *qi*, keeping it constantly full, naturally free from hunger and thirst. Initially, this may seem difficult, but with long practice, the internal and external *qi* naturally cease to mingle.",
      "start_char": 6873,
      "end_char": 8105,
      "start_sentence": 292,
      "end_sentence": 342,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.481173992156982,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\延陵先生集新旧服气经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "夫一鼓努法，本服自然元气，流布藏府，即一长存，人即不死，何暇於外思虑吸引外－气？ 夫人气尽即神亡，神去则身谢。 故知守元气不失，胎成，皆秘诀所传，. llll 学者幸勿疑也。 夫行气，候闲时，鼓十（咽、二十咽、咽，令肠满，然后存思，行－. l . llll . . 入四支，有事之时，即一咽、一行气，手足俱须着物，候气通流，必虚心忘形，一然得烦蒸之气散出四支，精华之气凝归气海。 久而自然胎成，封固支节，得雷呜相应。 当鼓转具腹，令气调畅也。 夫服气导引，先舒手足很彭呕驯缅身左右，精思气入骨节行，引相应，令通不断，谓之行气导引。 又宛转盘回，存思气从手足关节散出。 古经云：有行气导引，非至道口传，罕有知者。 夫行气，若饥时服，候腹满乃行之，若食饱后旋行。 桑榆子曰：饱宜为饮字之误也。 修养者，平居无饱，倪行气之秋乎？ 若无服气导引，当候闲时习之，非寻常可作也。 夫服气导引，当居静密房室，不欲处高屋当风，如遇暴风疾雨，沾湿冲寒，冒热远来，皆须歇息，候其体乾气和，方可为之。 若欲四支常瘦，即数导引，谓肌肤充悦，即多导引。 服气导引，不失其时，则一神气常清，形容不易暴脂，虚肉不生，永无诸疾矣。 世人或谓服气与胎息殊一误之深矣！ 胎从服气中结，气从有胎一中息。 久服则清气凝而为胎，浊气散一而出胎，成可以入水蹈火。 世人或依一甘方，戈受作直昔，以闭数之，贵其息长，不亦谬乎？ 殊不知五藏无常服之一气，一时闭塞关门，岂是胎中自然之一意？ 但烦劳形神，终无所益。 时人服一气多闭口缩鼻，皆抑忍之，但须取息一长，不知反损。 问曰：夫服内气外气，二气俱出五藏，焉得内外吐纳不同？ 桑榆子曰：些言二气俱出五藏，即大谬也。 且外气喘息之气，即非府气也。 但入至荣卫，非自中而有者也。 焉得谓之出於五藏乎？ 答曰：服内气鼓努之时，即胃海开，纳真气，封固纳讫，即还闭，徐徐出外气，自然有殊。 夫抑塞口鼻，气俱不通，不通即蓄损五藏，此乃求益而返损也。 且人健时闭气息即易，忽有疾力微即难制，岂不失之极也。 若服内气，用力甚少而功即多，当勤行之也。 问曰：夫上士先导引后出一入，下士先出入后导引者，何也？ 答曰：上士先导引，则秽气随举动散出； 下士后导引，恐其秽气入支节不散。 此则学气导引得与不得有殊也。 桑榆子曰：上下，犹言先后进也。 系於功用浅深，非贤愚品第之谓。 斯道也，岂愚者之可为乎哉？ 但有贤而不能者也。 天师云：纳气有一，吐气有六，气道成乃可为之。 吐气六者，吹、呼、嘻、煦、嘘、咽，皆出气也。 桑榆子曰：煦，一本为呵，大抵六气之用，与他本有五不同也。 时寒可吹以去寒，时温可呼以去热，嘻以去风，煦以去烦，又以去下气，嘘以散滞，咽丑利、许气二切以解热，凡人者则多呼咽，道家行气不欲嘘咽，长息之忌也。 悉能六气，位为天仙。 桑榆子曰：凡人者，喜怒哮欲众邪之气不绝於中，辛咸甘酸外物之味未离於口，若即便禁长息，则秽浊之气无洞尽之期，彼得道者无思无虑，无营无欲； 含其浩然之气，又焉取於嘘咽哉！ 彼视嘘咽犹央堤耳。",
      "translated_text": "The *one-expansion swallowing* method fundamentally draws upon the natural primordial *qi*, circulating it through the viscera—once this is achieved, one attains enduring existence and does not die. Why then would one waste time on external thoughts or the absorption of external *qi*? When a person’s *qi* is exhausted, the spirit perishes; when the spirit departs, the body decays. Thus, preserving the primordial *qi* without loss and forming the spiritual embryo are secrets transmitted through esoteric teachings—scholars must not doubt this.\n\nWhen practicing *qi*-circulation, choose a leisurely moment: expand and swallow ten times, twenty times, or more, filling the intestines, then direct the *qi* through visualization, guiding it into the four limbs. During activity, swallow once and circulate *qi* once, ensuring the hands and feet remain in contact with something. When *qi* flows unimpeded, empty the mind and forget the body, allowing the turbid, steaming *qi* to disperse through the limbs while the essence of *qi* condenses and returns to the *qi* sea. With prolonged practice, the embryo naturally forms, sealing and fortifying the joints, resonating like thunder. When expanding and turning the abdomen, ensure the *qi* flows smoothly and harmoniously.\n\nFor *qi*-swallowing and Dao-yin (guiding and pulling), first stretch the hands and feet, bending and extending the body left and right, then focus the mind to guide *qi* into the bones and joints, ensuring continuous, unbroken circulation—this is called *qi*-circulation and Dao-yin. Alternatively, coil and revolve the body, visualizing *qi* dispersing from the joints of the hands and feet. As the ancient scriptures say: \"There are methods of *qi*-circulation and Dao-yin, but unless transmitted orally by a master of the supreme Dao, few know them.\"\n\nWhen practicing *qi*-circulation, if hungry, swallow *qi* until the abdomen is full before proceeding; if practicing after a meal, do so immediately. Sang Yuzi remarked: \"The character for 'full' (*bao*) is likely a miswriting of 'drink' (*yin*).\" For cultivators, daily life should not be one of satiety—how could one practice *qi*-circulation only in autumn? If unable to practice *qi*-swallowing and Dao-yin regularly, train during leisure moments, for this is no ordinary endeavor.\n\nWhen practicing *qi*-swallowing and Dao-yin, retreat to a quiet, secluded chamber, avoiding high rooms exposed to wind. If encountering violent winds, heavy rain, dampness, cold, or heat, or if returning from afar, rest until the body is dry and *qi* harmonized before resuming. If the limbs are often weak, practice Dao-yin frequently; if the skin is plump and radiant, practice it more. By practicing *qi*-swallowing and Dao-yin without missing the proper times, the spirit and *qi* remain clear, the complexion does not age prematurely, flabby flesh does not form, and all illnesses are averted.\n\nSome mistakenly claim that *qi*-swallowing and embryonic breathing are entirely distinct—this is a grave error. The embryo forms within *qi*-swallowing, and breathing arises from the embryo. With prolonged practice, pure *qi* condenses into the embryo while turbid *qi* disperses from it, enabling one to walk through water and fire. Some follow inferior methods, forcibly holding their breath, prizing prolonged respiration—is this not misguided? They fail to realize that the five viscera cannot sustain a single *qi* indefinitely; forcibly closing the gates of the body is hardly the natural intent of the embryonic state. Such efforts only exhaust the body and spirit, yielding no benefit.\n\nMany practitioners of *qi*-swallowing constrict their mouths and noses, forcibly restraining their breath in pursuit of prolonged respiration, unaware that this causes harm. Someone asked: \"Both internal and external *qi* emerge from the five viscera—why are inhalation and exhalation treated differently?\" Sang Yuzi replied: \"To say both *qi* emerge from the five viscera is a gross error. The *qi* of panting and breathing is not the *qi* of the viscera; it merely enters the constructive and protective *qi*, not originating from within. How can it be said to emerge from the five viscera?\"\n\nWhen swallowing internal *qi* and expanding, the stomach sea opens to receive true *qi*, then seals after absorption. Exhaling external *qi* proceeds slowly and naturally, each with its distinct purpose. Forcibly blocking the mouth and nose obstructs *qi* flow, causing stagnation and harm to the five viscera—this is seeking benefit but inviting harm. When healthy, holding the breath is easy, but during illness or weakness, it becomes difficult to control—is this not an extreme mistake? Practicing internal *qi* requires minimal effort yet yields great results; one should diligently cultivate it.\n\nSomeone asked: \"Why do superior practitioners first perform Dao-yin before exhaling and inhaling, while inferior practitioners do so afterward?\" The answer: \"Superior practitioners first perform Dao-yin, expelling impure *qi* through movement; inferior practitioners perform Dao-yin afterward, fearing impure *qi* may enter the limbs and fail to disperse. This distinguishes those who succeed in *qi*-circulation and Dao-yin from those who do not.\" Sang Yuzi remarked: \"Superior and inferior refer to the order of practice, reflecting the depth of attainment, not a hierarchy of worth. Could this Dao be practiced by the foolish? Only the wise may fail to achieve it.\"\n\nThe Heavenly Master said: \"Inhalation has one method, exhalation has six. Only when the *qi* pathway is mastered can one practice them.\" The six exhalations are: *chui* (blowing), *hu* (breathing), *xi* (sighing), *xu* (warming), *xu* (dispersing), and *si* (hissing). Sang Yuzi noted: \"In some texts, *xu* (warming) is written as *he* (exhaling). The application of the six *qi* differs from other methods.\" When cold, use *chui* to dispel it; when warm, use *hu* to cool; *xi* dispels wind, *xu* (or *he*) dispels vexation and lower *qi*; *xu* (dispersing) scatters stagnation; *si* resolves heat. Ordinary people often use *hu* and *si*, but Daoist *qi*-circulation avoids *xu* and *si*, as they disrupt prolonged respiration.\n\nThose who attain mastery of the six *qi* ascend as celestial immortals. Sang Yuzi said: \"Ordinary people are constantly afflicted by the *qi* of joy, anger, sorrow, and desire, and their mouths never depart from the flavors of spicy, salty, sweet, and sour. If they forcibly restrain prolonged respiration, turbid *qi* will never be fully expelled. Those who attain the Dao are free from thoughts, worries, pursuits, and desires; they embody the vast primordial *qi*—why would they need *xu* or *si*? To them, *xu* and *si* are as insignificant as a broken dike.\"",
      "overlap_context": "s is far from true. It is like thunder and lightning refining yin *qi*, nourishing the hundred vessels in a single flow—truly the profound gate of the Dao.\n\nThough there are many methods of *qi*-swallowing, none surpass the technique of expansion and swallowing for true subtlety. Some, failing to grasp the single breath or unobstructed *qi* flow, empty their minds and forget their bodies, claiming the efficacy of seated forgetfulness. Yet this yields no achievement and often leads to exhaustion.",
      "start_char": 8105,
      "end_char": 9312,
      "start_sentence": 343,
      "end_sentence": 390,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.93092679977417,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\延陵先生集新旧服气经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "凡服气毕，即思存南方荧惑星，为赤气，大如珠，入其天关中，流入藏府，存身尽为气。 每日一遍，此为以阳炼阴，去三尸之患。 又古涓子留口诀，令想火炼身为炭，道者商量，火气非自然阳精，但恐伤神未可为也。 其精者，真人密传至妙，精思行之勿疑。 桑榆子曰：云商量者，延陵君之意也。 夫存想之中，宁假分别其自然与非自然乎？ 若如所言，则存之与想得为自然否？ 况仙问炼丹亦用火，则火与荧惑； 同是天地之中一物耳。 亦何择焉乎？ 凡导引服气之时，衣带常欲宽，若紧急即损气，气海中闷。 桑榆子曰：损谓限滞之也，非能损之。 夏冬寝处饮食，常欲温，勿食酸咸油腻之物，食之损五藏，五藏损，即神不安。 猜狗肉及生果子尤宜切忌。 用气神集诀 神集於虚，桑榆子曰：虚无盖为象也。",
      "translated_text": "After completing *qi*-absorption, immediately visualize the Fire Star of the southern quadrant as a crimson *qi*, vast as a pearl, entering the Celestial Pass and flowing into the viscera, until the entire body is transformed into *qi*. Perform this once daily—this is refining yin with yang, dispelling the Three Worms’ affliction.\n\nAncient Master Juezi left an oral formula instructing one to imagine fire refining the body into charcoal. Daoist practitioners have debated this, for fire-*qi* is not innate yang essence, and they fear it may harm the spirit—thus it cannot be adopted. The refined method, transmitted in secret by perfected beings, demands focused practice without doubt.\n\nSang Yuzi said: \"This debate reflects the view of Lord Yanling. In the midst of visualization, must one distinguish between the natural and the unnatural? If so, are visualization and contemplation themselves natural? Moreover, in alchemical refinement, fire is also used—then are fire and the Fire Star not both a single entity within heaven and earth? What need is there for discrimination?\"\n\nDuring *qi*-guiding and absorption, clothing and sashes should always be loose; if tight, they obstruct *qi* and cause stagnation in the *qi*-sea. Sang Yuzi said: \"Obstruction means constraint, not destruction.\"\n\nIn summer and winter, sleeping quarters and diet should remain warm; avoid sour, salty, oily, or greasy foods, for they harm the five viscera. When the five viscera are harmed, the spirit becomes unsettled. Dog meat and raw fruits are especially forbidden.\n\n**Essential Formula for Gathering *Qi* and Spirit**\nThe spirit gathers in emptiness.\nSang Yuzi said: \"Emptiness is but an image of the formless.\"",
      "overlap_context": "mortals. Sang Yuzi said: \"Ordinary people are constantly afflicted by the *qi* of joy, anger, sorrow, and desire, and their mouths never depart from the flavors of spicy, salty, sweet, and sour. If they forcibly restrain prolonged respiration, turbid *qi* will never be fully expelled. Those who attain the Dao are free from thoughts, worries, pursuits, and desires; they embody the vast primordial *qi*—why would they need *xu* or *si*? To them, *xu* and *si* are as insignificant as a broken dike.\"",
      "start_char": 9312,
      "end_char": 9626,
      "start_sentence": 391,
      "end_sentence": 406,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.99588418006897,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\延陵先生集新旧服气经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "而安於实。 实谓精也。 神，心中知者也。 安而无欲，则神王而气知正，如此之时，则一任之，唯久弥善，行之不已，体气至安，谓之乐天，天者虚而自然也。 乐天则寿。 身外虚空亦天也，身内虚通亦天也，习之久久乃明生焉。 虚中生白。 密自内知，久习弥广，而精上合於明，明内发於精，如是乃至於道，道应於德，德成矣！ 用而为仁，分而为义。 精气昼出於首，夜栖於腹，当自尊其首，重其腹，色庄於外，敬直於中，应机无想，唯善是与。 此神气事质，合吾一体，谓之大顺。 天保佑之，吉元不利。 凡妙本有所，神在心中之虚，上通其系，气蕴肠中之实，实精，藏之前水胞之上也。 恒宜温养之。 桑榆子曰：凡温者，生之徒，但不得自温而失於热也。 平居常宜闭目内视气源，下丹田也。 每行一事利於生灵，则欣然闭目内视其心，谢之，若日吾身之神气，明发於吾形，使吾达道也。 如是则天降之吉。 故天者，虚气之灵，吾能用之，道极於斯矣。 桑榆子曰：所谓天者，自然之谓也，非苍苍之谓乎！ 炼气法 每咽服气功，余暇取一静室无人处，散发脱衣，覆被正身，仰卧展脚及手，勿握固，净席一领，边垂着地，其发梳以理之，令散垂席上，即便调气。 气候得所，咽之，便闭气，尽今闷。 又冥心无思，任气所之，气闷即开口放出，气新出喘息急，即且调气七八气已来，急即定，定又炼之。 如此有暇，且十炼之，止为新功。 恐气未通，拥在皮肤，反至疾也。 更有余暇，又炼之，即更加五六，炼至二十、三十或四十、五十，并无定限，何以为则？ 如服气，功渐成，关节通，毛孔开，炼到二十、三十，即觉遍身润，或汗出，如得此状，即是功效新。 炼得通润则止，渐渐汗出即好，且安心稳外，不得早起冲风等，如病人得汗，良久将息，即可着衣，徐徐行步，少言爱气，省事澄思，则身轻目明，百脉流注，四支通畅。 故《黄庭》云：千灾已销百疾痊，不惮虎狼之凶鳃。 亦以却老年永延。 夫炼气者，每夜问及午时，任自方便，候神情清爽，即依前次第，峻坐修咽，勤勤致之，不得惰慢，忽有昏问，欲睡即睡，不得昏闷欲睡之时强为，即却邪乱其意。 意邪气乱，失正道也。 如新服未有正气，即校昏，昏已后，亦无昏沉矣。 桑榆子曰：所当．须勤。 勤，不得惰慢。",
      "translated_text": "Yet to settle in fullness—fullness meaning essence. The spirit is the knowing within the heart. When settled and desireless, the spirit flourishes and *qi* knows rectitude. At such times, let it be as it will; the longer, the better. Persist without cease, and the body’s *qi* attains tranquility—this is called \"rejoicing in Heaven.\" Heaven is emptiness and spontaneity. Rejoicing in Heaven brings longevity.\n\nThe emptiness beyond the body is also Heaven; the emptiness within the body is also Heaven. With long practice, clarity arises therein. Within emptiness, whiteness is born. Through inner awareness, with prolonged practice, essence ascends to merge with luminosity, and luminosity inwardly radiates from essence. Thus one attains the Dao, the Dao responds to virtue, and virtue is perfected. Applied, it becomes benevolence; distributed, it becomes righteousness.\n\nEssence-*qi* emerges from the head by day and rests in the abdomen by night. One should honor the head and value the abdomen, maintain dignity in appearance and reverence within, respond to circumstances without thought, and align only with goodness. This is the substance of spirit and *qi*, uniting as one with the self—called \"great compliance.\" Heaven protects such a one; fortune is boundless, no misfortune befalls.\n\nIn essence, the wondrous origin resides in the emptiness within the heart, where the spirit connects upward through its thread; *qi* accumulates in the fullness of the intestines—fullness meaning essence—stored above the anterior water bladder. It must always be warmed and nurtured. Sang Yuzi said: \"Warmth is life’s companion, but one must not overheat and lose balance.\"\n\nIn daily life, one should often close the eyes and inwardly gaze upon the *qi*-source, the lower *dantian*. With every act that benefits living beings, joyfully close the eyes, inwardly behold the heart, and give thanks, as if saying: \"The spirit and *qi* of my body shine forth from my form, enabling me to attain the Dao.\" Thus Heaven bestows good fortune.\n\nFor Heaven is the numinous spirit of emptiness and *qi*; if one can employ it, the Dao reaches its ultimate. Sang Yuzi said: \"What is called Heaven is spontaneity itself, not merely the azure vault!\"\n\n**Method for Refining *Qi***\nFor every session of swallowing *qi*, find a quiet, secluded room in spare moments. Loosen the hair, remove clothing, cover the body, lie supine with limbs outstretched, and do not clench the fists. Use a clean mat, its edges touching the ground. Comb the hair to smooth it, letting it spread upon the mat, then regulate the breath. When the breath is properly attuned, swallow it and hold it until discomfort arises.\n\nStill the mind and banish thoughts, allowing *qi* to move as it will. When discomfort from holding *qi* arises, open the mouth to release it. If the breath is newly expelled and panting is rapid, regulate it seven or eight times until settled. Once settled, refine it again. When time permits, refine it ten times to begin the practice. Fear not that *qi* may fail to circulate and become lodged in the skin, causing illness instead.\n\nWith further leisure, refine it again, adding five or six repetitions, increasing to twenty, thirty, or even forty or fifty—there is no fixed limit. What is the standard? As the practice of swallowing *qi* gradually succeeds, the joints open, the pores unblock, and upon refining twenty or thirty times, one feels the body suffused with moisture, or sweat emerges. This is the sign of new efficacy. Cease refining once *qi* flows smoothly; gradual sweating is beneficial. Rest the mind and body calmly, avoiding early rising or exposure to drafts. Like a patient who has just perspired, rest a long while before dressing, then walk slowly, speak little, conserve *qi*, reduce activity, and calm the thoughts. Thus the body becomes light, the eyes bright, the hundred vessels flow, and the four limbs move freely.\n\nAs the *Huangting Jing* says:\n*A thousand ills dispelled, a hundred maladies healed,*\n*Fearless of tigers’ ferocity or sharks’ jaws.*\n*Thus aging is averted, and years prolonged.*\n\nIn refining *qi*, one may practice at midnight or noon, whenever convenient, when the spirit is clear and refreshed. Sit upright and swallow *qi* in the prescribed sequence, applying oneself diligently without laziness. If drowsiness arises, sleep when inclined; do not force practice while dull or sleepy, lest the mind be disturbed by perverse thoughts. A disturbed mind and chaotic *qi* lose the true Dao.\n\nIf newly practicing and lacking proper *qi*, one may feel drowsy, but after drowsiness passes, no torpor remains. Sang Yuzi said: \"One must be diligent—never lazy or careless.\"",
      "overlap_context": "se stagnation in the *qi*-sea. Sang Yuzi said: \"Obstruction means constraint, not destruction.\"\n\nIn summer and winter, sleeping quarters and diet should remain warm; avoid sour, salty, oily, or greasy foods, for they harm the five viscera. When the five viscera are harmed, the spirit becomes unsettled. Dog meat and raw fruits are especially forbidden.\n\n**Essential Formula for Gathering *Qi* and Spirit**\nThe spirit gathers in emptiness.\nSang Yuzi said: \"Emptiness is but an image of the formless.\"",
      "start_char": 9626,
      "end_char": 10500,
      "start_sentence": 407,
      "end_sentence": 442,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.37765073776245,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\延陵先生集新旧服气经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "又说任方便，不得勉强，消息之妙，在於此矣。 则知勤勤不在勉强，修息游乘，自然以车，则气行矣。 夫炼气者，即不得每日行之，十日五日有余暇，觉不通畅，四体烦问，即为之。 常日无功，不用频也。 桑榆子曰：阴阳合节则不为灾珍，此云常日无功，若如所言，为之何害？ 但以不止於无功，将臻乎有咎，何以言之？ 借如炎帝勤害而并功倍功，必反为大旱也哉！ 按摩亦然。 委气法 夫养气者，四体清和，志无思念，或因坐，或因外，任气依门户，调息凝然，委身如彼委衣，帖然在状，无筋无骨，无神无识，纵心纵身，寂沉寂沉。 如委时，亦勿为主，桑榆子曰：无我相无人相，岂徒人我而已哉！ ．则万有都无也。 然后澄神炼气，则百节开张，筋脉通畅，津液流注也。 乘此便咽闭十气或二十气，亦得。 每一咽皆须兀然任，气不得与意相争，良久则气从百毛孔出，不复更口吐也。 纵其留者十无一二焉。 复更调理，数至十息、百息已上，因有喘息，便又微含气咽入，即便调息，调息稍久，觉四支皮肉及关节，一如沐浴然。 每暇，不问仰外侧卧，或立或坐，即委气委身以行之，其功日进，精满气全，神安魄定，志闭思远，道泰德宁，三尸自亡，六尘俱丧。 《黄庭》云：闲暇无事身体安，虚无之居在帷问。 但无为养生，委身委心，放形放思，与道合体，即知异候。 又《黄庭》云：高拱无为魂魄安，清净神见与我言。 此之谓也。 闭气法",
      "translated_text": "It further states that one should follow convenience and not force practice; the subtlety of harmonizing lies precisely here. Thus, diligence does not lie in forcing, but in refining breath and riding its natural flow, as if borne by a chariot—then *qi* circulates.\n\nIn refining *qi*, one need not practice daily; if after ten or five days one has leisure and senses obstruction or discomfort in the four limbs, then practice. On ordinary days when no benefit is felt, frequent practice is unnecessary.\n\nSang Yuzi said: \"When yin and yang align with the seasons, no disasters arise.\" Yet here it speaks of \"ordinary days without benefit\"—if practiced as described, what harm could there be? But if one does not cease even when no benefit is gained, it may lead to fault. How so? Consider the example of the Flame Emperor: excessive diligence in plowing and weeding may yield double the harvest, yet it may also bring great drought. The same applies to massage.\n\n**The Method of Entrusting *Qi***\n\nFor those who cultivate *qi*: when the four limbs are harmonious and the mind free of thoughts, whether sitting or otherwise, let *qi* follow its natural pathways. Regulate the breath until still, entrusting the body as one would a discarded garment—smoothly settled, without sinew or bone, without spirit or consciousness. Let the heart and body be unrestrained, profoundly tranquil.\n\nWhen entrusting, do not seek to control. Sang Yuzi said: \"Without the marks of self or others—how could this apply merely to self and others? All myriad things dissolve.\"\n\nThen, with spirit settled and *qi* refined, the hundred joints open, sinews and vessels flow freely, and fluids circulate. At this point, one may swallow and hold ten or twenty breaths. With each swallow, remain steadfast and let *qi* move without contention from the mind. After a long while, *qi* will exit through the pores of the skin, no longer expelled through the mouth. Of what remains, scarcely one or two parts in ten linger.\n\nAdjust and regulate, counting to ten, a hundred, or more breaths. If panting arises, gently draw in breath and swallow, then regulate the breath again. After prolonged regulation, the skin, flesh, and joints of the four limbs will feel as if bathed.\n\nAt leisure, whether lying supine, on one’s side, standing, or sitting, entrust *qi* and the body to the practice. Progress will come daily: essence fills, *qi* is complete, spirit is at peace, the *po* is settled, the mind is closed to distant thoughts, the Dao is flourishing, and virtue is serene. The Three Worms perish, and the Six Dusts vanish.\n\nThe *Huangting Jing* says:\n*At ease, with nothing to do, the body is at peace,*\n*Dwelling in emptiness within the curtains.*\n\nSimply nurture life through non-action, entrusting body and heart, releasing form and thought, merging with the Dao—then one will recognize extraordinary signs.\n\nThe *Huangting Jing* further says:\n*Sitting upright in non-action, the hun and po are at peace,*\n*In purity, the spirit appears and speaks to me.*\n\nThis is the meaning.\n\n**The Method of Holding the Breath**",
      "overlap_context": "spirit is clear and refreshed. Sit upright and swallow *qi* in the prescribed sequence, applying oneself diligently without laziness. If drowsiness arises, sleep when inclined; do not force practice while dull or sleepy, lest the mind be disturbed by perverse thoughts. A disturbed mind and chaotic *qi* lose the true Dao.\n\nIf newly practicing and lacking proper *qi*, one may feel drowsy, but after drowsiness passes, no torpor remains. Sang Yuzi said: \"One must be diligent—never lazy or careless.\"",
      "start_char": 10500,
      "end_char": 11056,
      "start_sentence": 443,
      "end_sentence": 465,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.311253786087036,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\延陵先生集新旧服气经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "拥塞气候不调即为之 夫上智之人，志坚思远，若能修理无少遗功，神定气调，绝於外病。 中智之人，或缘公私所千，或心生进退，或修摄乖宜，气拥不和，反生其患。 如有苦处，可入一静室，仰外熟调气，展足及手，各相去四五寸，仍须外处厚软，冬月暖盖被，静心坦然，即便咽气。 咽毕，便闭之，口鼻不动，以心念所苦之处，以意注想攻之，气极而吐之，讫复咽，闭气新吐，必喘急时，声厅可调气六七息，气即调顺，又更闭气，想念攻之，或十攻、二十攻、三十、五十攻，觉所苦处汗出通润，即止。 如未可，即每日五更或夜半频意攻之，以差为限。 如病在左手，直入左手，如在右手，直入右手，如在头，直入头。 分明见验，方知心能使气，气之从心，其应如神矣。 延陵先生集新旧服气经竟",
      "translated_text": "**The Method of Holding the Breath**\n\nWhen *qi* is obstructed and the body’s rhythms are disordered, proceed as follows. Those of superior wisdom, with steadfast resolve and far-reaching thought, if they cultivate without the slightest lapse, will settle the spirit and harmonize *qi*, cutting off external illness. Those of middling wisdom, however, may be hindered by public or private affairs, their minds wavering between advance and retreat, or their practice may stray from what is fitting, causing *qi* to stagnate and lose harmony, thereby inviting affliction.\n\nIf discomfort arises, enter a quiet chamber, lie supine, and carefully regulate the breath. Extend the hands and feet, each separated by four or five inches. Ensure the bedding is thick and soft; in winter, keep warm with covers. Calm the heart and relax the body, then swallow *qi*. Once swallowed, hold the breath, keeping the mouth and nose still. Focus the mind on the afflicted area, directing intention and visualization to attack it. When *qi* reaches its limit, exhale, then swallow again, holding the breath anew. If panting or urgency arises, regulate the breath with six or seven measured breaths until *qi* is smooth and even, then resume holding the breath, concentrating the mind to attack the affliction. This may be done ten, twenty, thirty, or fifty times, until the troubled area sweats and feels unblocked—then cease. If relief is not yet complete, repeat the practice at dawn or midnight, directing intention to attack the affliction until it is cured.\n\nIf the ailment is in the left hand, direct *qi* straight into the left hand; if in the right, into the right; if in the head, into the head. Only when clear results are seen will one know that the heart commands *qi*, and *qi* follows the heart—its response is as swift as the divine.\n\n*Master Yanling’s Compilation of New and Old Qi-Absorption Scriptures Concludes*",
      "overlap_context": "ish.\n\nThe *Huangting Jing* says:\n*At ease, with nothing to do, the body is at peace,*\n*Dwelling in emptiness within the curtains.*\n\nSimply nurture life through non-action, entrusting body and heart, releasing form and thought, merging with the Dao—then one will recognize extraordinary signs.\n\nThe *Huangting Jing* further says:\n*Sitting upright in non-action, the hun and po are at peace,*\n*In purity, the spirit appears and speaks to me.*\n\nThis is the meaning.\n\n**The Method of Holding the Breath**",
      "start_char": 11056,
      "end_char": 11373,
      "start_sentence": 466,
      "end_sentence": 474,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.090271472930908,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\延陵先生集新旧服气经.txt",
        "category": "方法类"
      }
    }
  ]
}