{
  "source_id": "张真人金石灵砂论",
  "source_file": "chunked_daozang\\张真人金石灵砂论.json",
  "total_chunks": 4,
  "total_original_chars": 4044,
  "total_translated_chars": 22762,
  "total_translation_time": 113.29984903335571,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\张真人金石灵砂论.txt",
    "category": "众术类"
  },
  "full_translation": "**The Venerable Master Zhang’s Treatise on Alchemical Minerals and Cinnabar**\n\n**Title:** *The Venerable Master Zhang’s Treatise on Alchemical Minerals and Cinnabar*\n**Author:** Zhang Jiugai of the Tang Dynasty\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Section on Miscellaneous Arts* under the *Dongshen* Department\n\n---\n\n### *The Venerable Master Zhang’s Treatise on Alchemical Minerals and Cinnabar*\n**By Zhang Yinju of Mengshan**\n\n#### **The Yellow Gold Chapter**\nYellow gold is the essence of the sun and serves as the sovereign. Ingesting it enables communion with spirits, lightens the body, benefits the five viscera, expels pathogenic qi, and slays demonic influences. Prolonged consumption turns the skin golden.\n\nGold forms within mountain stones, accumulating the qi of the great yang, refined by steaming until its nature is fixed. It is intensely hot and highly toxic, such that stones several feet around it are transformed into a golden hue—how much more so for those who refine and ingest it?\n\nGold that grows near its source is called *Golden Bloom*; that which follows is *Golden Splendor*; that which grows farther is *Golden Bandit*; and that which emerges a hundred paces away is *Golden Sprout*. If this gold is ground into powder and consumed, it will corrode the bones and marrow, causing withering and death.\n\nYellow gold is the true qi of the great yang, the soul of the sun, symbolizing the three hun-souls. White mercury is the true qi of the great yin, the spirit of the moon, symbolizing the seven po-souls. Consuming them together confers immortality.\n\nYellow gold corresponds to the west, the metal of *geng* and *xin*; white mercury corresponds to the north, the water of *ren* and *gui*. Water is the child of metal.\n\nThe ancients said: *\"To consume gold is to become like gold; to consume jade is to become like jade.\"* Gold’s nature is unyielding—boiling does not soften it, burial does not rot it, burning does not char it—thus it can sustain life. When medicinal gold is ingested, the flesh does not decay, the hair does not wither, yin and yang remain unaltered, and ghosts and spirits cannot invade; hence, longevity is boundless.\n\nThe finest golds include *Old Sage’s Meteor Gold*, *Yellow Emperor’s Cauldron Gold*, *Master Ma’s Crimson Gold*, *Lord Yin’s Horseshoe Gold*, *Fox Venerable’s River Chariot Gold*, *Master Anqi’s Vermilion Gold*, *Master Jinlou’s Returned Elixir Gold*, *Liu An’s Horseshoe Gold*, *Lord Mao’s Purple Lead Gold*, *Eastern Garden Elder’s Upper Field Azure Dragon Gold*, *Li Shaojun’s Smelted Mud Gold*, *Fan Li’s Purple Elixir Gold*, and *Master Xu’s Transmuted Gold*—all divine alchemical transformations rivaling the great work of creation, embodying the mysteries of the Dao and the marvels of the yellow and white. They must not be used lightly, lest one incur divine censure.\n\nGold that forms in mountains, rivers, and streams is of inferior grade.\n\n#### **The White Gold Formula**\nSilver is white gold, the essence of lesser yang born of yin, serving as the minister. Ingesting it enables communion with spirits and confers deathlessness, strengthens the sinews and bones, and is mildly hot with slight toxicity. It is produced within lead.\n\nIts position corresponds to the west, the essence of Venus. *The Dragon-Tiger Classic* states: *\"The lofty maiden is the sun; the abyssal youth is the moon.\"* The Lord of the Nine Heavens says: *\"The water of the south, the fire of the north—yin dwells within yang, yang within yin. Their movements follow principle, now floating, now sinking. As husband and wife, their intentions are as one. When the year ends, their natures dissolve, and they share the same pillow and mat.\"*\n\nThis is the position of *zi* and *wu*, where the dragon and tiger reside. It must not be consumed alone. *The Dragon-Tiger Classic* says: *\"The White Tiger is the pivot; the Azure Dragon accompanies it. Yellow gold is the sovereign, white silver the minister, malachite the messenger, and realgar the general.\"* When refined together, they form the golden elixir.\n\nThe scriptures say: *\"When the golden elixir enters the five viscera, its mist scatters like wind and rain. Steaming through the four limbs, it reverses aging and restores youth.\"* It is also said: *\"Jade liquid blackens the hair; golden elixir preserves the complexion.\"* When white gold is transmuted into yellow or red gold, this is the great principle of the returned elixir.\n\n#### **The Black Lead Chapter**\nLead is black, a metal and water, belonging to the north. Its completion number is one, and it serves as the minister. Ingesting it enables communion with spirits, treats the three barriers, blackens the beard and hair, restores youthful complexion, regulates the blood vessels, heals sores and paralysis, kills the nine worms, and benefits the five viscera—yet it is born of yang.\n\nWhite silver is its mother. Its nature is slightly cold and toxic; it can be made into *yellow lead*, *lead powder*, *white lead*, and *litharge*.\n\n*The Scripture of the Nine Capitals* states: *\"In refining the Nine Radiance Divine Elixir, lead is drawn out, undergoing a thousand transformations without losing its constant nature—only lead and mercury are thus.\"*\n\n*The Dragon-Tiger Classic* says: *\"Nine returns, seven reversions, eight reunions, six residences—male white, female red, gold and fire together.\"* The male white is lead. Extracting the essence of lead nine times mirrors the nine blacks, for nine is the extreme of yang numbers. The female red is mercury. The seven reversions mirror the seven blacks, for seven is the extreme of yin numbers. Refining the essence of lead and combining it into medicinal gold yields a deep yellow hue; ingesting it confers deathlessness.\n\n#### **The Realgar Chapter**\nRealgar serves as the sovereign. Ingesting it enables communion with spirits. That which grows facing the sun is called *male realgar*; that which grows in shadow is called *female realgar*. Born as one body, they intermingle within mountain stones.\n\nIt is intensely hot and toxic, the essence of lesser yang. When used in elixirs, it supplements the mud pill, solidifies the brain chamber, and nourishes the three palaces. Taking two ounces each of male and female realgar, mixing with one catty of mercury and four ounces of lead essence, and subduing with fire yields gold. When liquefied and ingested, it enables ascension to heaven.\n\n*The Dragon-Tiger Classic* states: *\"That from Wudu is finest; other stones are unusable.\"* Only realgar can repel all evil influences, hence its name, *the General*.\n\n#### **The Cinnabar Chapter**\nThere are *Radiant Cinnabar* and *Purple Cinnabar*. Many sages of old consumed them, yet none attained transcendence or longevity. I clarify the principle here.\n\nWhen *Radiant Cinnabar* and *Purple Cinnabar* are ingested with fire, they expel pathogenic qi and treat febrile diseases, but they cannot restore youthful complexion or blacken the hair. Why? From one catty of *Radiant Cinnabar*, sublimation yields twelve ounces of mercury, and firing yields one pinch of black ash. This black ash is the original substance of cinnabar, which, when placed in the furnace, releases its essence as mercury. Ingesting it prolongs life.\n\nBlack ash cannot be taken as an elixir to achieve transcendence. Thus, those who ingest *Radiant Cinnabar* or *Purple Cinnabar* without proper refinement and firing retain its residual ash, which is why they fail to attain longevity.\n\nIn ancient times, Lord Lao served as the Archivist of Zhou. Foreseeing the dynasty’s decline, he journeyed west to cross the pass, fearing the Way of the Golden Elixir would be lost. He entrusted the method of cinnabar to Yin Xi. Later generations, however, distorted the teachings, producing what they called *Spiritual Cinnabar*—also named *Radiant Cinnabar*—and compounding it for ingestion. Only then could one transcend mortality, avoid death, and transmute base metals into gold. It is also called *Medicinal Cinnabar*, *Cinnabar*, *Spiritual Cinnabar*, or *Returned Elixir*.\n\nIf one consumes *Radiant Cinnabar* or *Purple Cinnabar* alone, without proper compounding or method, the pursuit of immortality strays ever farther from the Dao. The *Spiritual Cinnabar* of nine transformations is not passed from father to son; it naturally transmutes into yellow and white. Why, then, does ingesting *Radiant Cinnabar* or *Purple Cinnabar* fail to grant transcendence?\n\nThe *Returned Elixir* gathers the essence of yin and yang, emulating the creative power of Heaven and Earth. Water and fire harmonize, transforming the insubstantial into substance to form its body. How can mere cinnabar and mercury—embodying only yin, lacking yang’s generative pairing—unite the Four Symbols or circulate the Five Phases? Solitary yin cannot nurture, and solitary yang cannot generate. Only when yin and yang unite is the *Returned Elixir* achieved.\n\nFor over twenty years since the Kaiyuan era, I have devoted myself to the golden crucible, gaining some insight into its mysteries. I have witnessed how people consume these two cinnabars, mistaking them for the *Seven-Returned Spiritual Elixir*, only to meet untimely deaths.\n\n#### **The True Mercury Chapter**\nMercury is the essence of the moon, born of yang, and serves as minister. Ingesting it lightens the body to avoid death, repels spectral influences, connects with divine clarity, slays the Three Corpses, purifies the Five Viscera, expels the Nine Worms, and severs pathogenic qi—yet it originates from cinnabar.\n\nCinnabar belongs to the southern fire, and fire, as wood’s child, gives birth to mercury. Mercury is the grandson of the Azure Dragon and the mother of water. Its nature is cold, with slight toxicity, and it arises from earth and stone as the soul and spirit of cinnabar. It is averse to red ochre and the nine leads, and fears elm and licorice. If women consume it raw, it harms the fetus; if men do so, it depletes yang.\n\nThe *Classic of the Dragon and Tiger* states: *\"Cinnabar is the essence of wood; only when united with metal does it coalesce.\"* The Perfected One said: *\"Not prizing yellow and white, but valuing the Returned Elixir.\"* Thus, to transcend mortality and avoid death, one must begin with mercury, compounding and refining it with yellow and white to sublimate and subdue it into an elixir. The transformations of divine immortals all rely on cinnabar and mercury, enriched by the Three Metals and harmonized with the Four Stones.\n\nThe *Secret Transmission* states: *\"Mercury generates the myriad things; only the sage comprehends it.\"* The virtue of water is most revered. Mercury, as water’s mother, becomes mist and dew in the heavens and springs upon the earth. It adapts to all shapes without contending with things, skillfully governing the myriad forms and giving life to all beings.\n\nWater’s nature is supremely still, never vying with other things. Thus, mercury is another name for liquid silver. It is also called *Luminous Pearl of the Great Yang*, *Eldest Son*, *Riverbank’s Marvelous Maiden*, or *Flying Light Powder* when refined, and is used as *Matured Pearl*.\n\n#### **The Orpiment Chapter**\nOrpiment arises among mountain stones. Ingesting it connects with the divine. It is the essence of lesser yang, intensely hot, and highly toxic. People refine it into pills to treat cold diseases, but its effects are fierce, and it must not be taken with hot foods. If one consumes one or two pills, frost-like qi emerges, causing facial swelling and bodily weakness. The common folk, unaware, mistake it for an elixir—this is a grave error. It is also called *Frost* due to its white color and is used in the art of transmuting yellow and white.\n\n#### **The Gold-Forming Chapter**\nOne catty of mercury, eight ounces of *White Tiger*, and eight ounces of *Male-Female White Snow*, fired for sixty days, form an elixir. Ingesting it ensures immortality, and this gold can be liquified. Consuming it turns the body golden. Stored in a jar buried underground for two hundred days, then warmed with fire for a hundred days, it becomes a liquid. Ingesting it ascends one to the Great Clarity.\n\nMaster Yin states: *\"The Golden Liquid and Returned Elixir give rise to feathered robes; their thousand transformations and myriad changes are without limit.\"* The Dao is the interplay of one yin and one yang. The sage models yin and yang, seizing the power of creation.\n\nThus, yang medicines number seven: two metals and five stones—gold, silver, male and female [mercury], orpiment, azurite, and sulfur—all belong to yang medicines. Yin medicines also number seven: three metals and four stones—mercury, black lead, saltpeter, and mirabilite—all belong to yin medicines. Each yin and yang medicine embodies its nature, and ingesting them holds the promise of transcendence and the principle of immortality.\n\n#### **The Purple Powder Chapter**\nMercury and sulfur, burned into the *Lesser Returned Elixir* and subdued by fire, are called *Purple Powder of the Lesser Returned Elixir*. Ingesting it relieves deficiency heat and suppresses fright and itching. It cannot grant transcendence or transmute metals.\n\nWhen mercury and orpiment are burned, they vanish—hence, they are called *nonbeing*. Gold and silver, when burned, retain their substance—hence, they are called *being*. This is like the human body’s three hun souls and seven po souls: the divine luminosity comes and goes unseen, but when manifested in the five qi, bodily form, and nine orifices, it is called *being*. Thus, being and nonbeing give rise to one another and are established within the body.\n\nThe *True Classic* states: *\"Sounds harmonize, things resonate, being and nonbeing interweave, yin and yang embrace—and the Dao resides therein.\"* Thus, yellow gold becomes red gold, and red gold becomes purple powder. When yin and yang harmonize and the two qi generate one another, the Golden Elixir is achieved.\n\nThe Golden Elixir governs nonbeing to restrain being and uses nonbeing to generate being. The *Secret Transmission* states: *\"Two nonbeings are the origin of one being; the numinous transformation is wondrous and difficult to fathom.\"*\n\nThis is the meaning of it.\n\n**Explaining the Returned Elixir**\n\nTo speak of the Returned Elixir: cinnabar generates mercury, and mercury reverts to cinnabar; cinnabar in turn produces mercury. It is also said that white gold and yellow stone combine to form gold, and when this gold turns crimson, it returns to the likeness of true gold—hence the name *Returned Elixir*. The *Scripture of the Dragon and Tiger* states: *\"When gold returns to its original state, it may then be called the Returned Elixir.\"* Mercury, evenly blended with metal and stone, forms crimson gold—this is the proper name for the Returned Elixir. Transformed from yellow gold into purple gold, it is called the *Purple Gold Returned Elixir*, and therein the Dao is complete. When stone and mercury flow into one another, producing gold of a true crimson hue, it is also named the *Golden Liquid Returned Elixir*. There are also scattered fragments, refined and called *Golden Elixir*; ground into powder, they are named *Gold Powder*. The scripture says: *\"When gold powder is cast in, yellow and white may be sought.\"*\n\nYet世 people, not understanding the principle of the Returned Elixir, some claim that a single grain can transmute ten pounds, or that one *zhū* can transform into a hundred *liǎng*—exaggerating quantities without grasping the essence, spreading false methods, and propping up deceit with flattery. They disparage the subtle Way of Yellow and White, expounding grandly on the Great Elixir, swaying intentions with dazzling words, and deluding the unwary with fragile, baseless claims. Pointing to emptiness as substance, they turn falsehood into truth, abandoning the true lineage of Yellow and White, unaware of how the Great Elixir could ever arise.\n\nAn ancient appraisal states: *\"If yellow gold is achieved, the world may be delivered. If yellow gold is not achieved, one only misleads oneself.\"* This Yellow and White is the marrow of the Returned Elixir, the true origin of the Great Medicine. Without understanding Yellow and White, one labors in vain. Some gather wealth to undertake the work, following the text but misjudging the timing, uncertain in measurements—such errors lead to failure. Thus, the sages kept it secret, unable to speak plainly, often resorting to veiled language. From this, false and contradictory methods arose, with practitioners mocking one another, neglecting the true principle and letting the method fall into ruin.\n\nThe ancients sometimes concealed names within symbolic forms, or entrusted them to yin and yang, subtly conveying secret teachings—yet their subtlety made them difficult to grasp, and confusion naturally arose. Hence the saying:\n*\"Atop the purple clouds it is born,\nThe White Tiger holds true qi.\nBeyond these idle texts,\nNone compare to the *Triple Concordance Canon*.\"*\n\nAnother verse marvels:\n*\"The White Tiger embraces the Crimson Dragon,\nOne soars, one sinks.\nA single thing threads five hues,\nForever the immortal’s bounty.\"*\n\nThe *Tortoise Shell Scripture* states: *\"My life is in my hands, not in Heaven and Earth. Heaven and Earth possess gold—I can make it. Two yellows and one red, swiftly accomplished without doubt.\"* The Perfected One said: *\"Within the Return there is gold; within gold, there is Return.\"* Thus it is said: *\"See gold and regard it as earth and stone.\"* It is also called *Heaven-Bearing Dragon and Tiger* and *Taiyi’s Yin Talisman*. The *Scripture of the Dragon and Tiger* says: *\"Lest the Heavenly One’s talisman be revealed.\"* The *Secret Transmission* states: *\"Three Lights and Six Sinks.\"* The Three Lights are water, earth, and metal. The Three and Five: the Dao generates yin, yin generates yang, and yin and yang generate the Five Phases. Through refinement and sublimation, the Returned Elixir is achieved, becoming one.\n\nThe Three Honored Ones of the Returned Elixir are water, earth, and metal. Heaven’s Three Honored Ones are the sun, moon, and stars. Earth’s Three Honored Ones are mountains, seas, and rivers. Man’s Three Honored Ones are ruler, father, and teacher. The body’s Three Honored Ones are the Three Elixir Fields. The Perfected One Zhang Daoling said: *\"Within your body lies the Way of yellow and red, the methods of yin and yang, Three, Five, Seven, and Nine. If you attain this, you may receive the teaching of immortality.\"* The Three pertain to the three *hun* souls, belonging to the left. The Seven pertain to the seven *po* souls, belonging to the right. The Azure Rainbow is Heaven’s *hun* soul, appearing in the east. The White Rainbow is Heaven’s *po* soul, appearing in the west. The head has nine palaces; the Hall of Light has one—whoever perceives it becomes a divine immortal. Man mirrors Heaven and Earth, hence the method of Three, Five, Seven, and Nine.\n\nThe *Scripture of the Dragon and Tiger* states: *\"Three, Five, and One—the essence of Heaven and Earth.\"* The three substances—water, earth, and metal—through transformation, sublimation, and refinement, become the Great Returned Elixir. Beyond these three, auxiliary ingredients are not the primary agents and need not be discussed.\n\n**Explaining the Golden Liquid**\n\nTo refine the Golden Liquid, one must first achieve Yellow and White. Only when Yellow and White are accomplished does one grasp the principle of metal and stone. If Yellow and White are not achieved, how can one refine the Golden Liquid? Stone gold is hard and hot, toxic—difficult to liquefy. If by chance it is achieved, it resembles glue and is unfit for ingestion, corroding the bones and marrow. When medicinal gold is achieved, it may then be made into Golden Liquid—yellow and crimson as water. Ingesting it, one soars to Heaven. Like a man drinking wine, it permeates the body, dispersing like wind and rain. All these are the essences of various medicines, gathered and transformed. Thus, when the divine liquid is achieved, metal and stone are transmuted.\n\nTo ingest the Golden Liquid: on a *jiǎzǐ* day, sit like a crane, facing the sun, and meditate on the Heavenly Perfection. Upon ingestion, the body turns golden. Feathered banners and dragon chariots coil down to welcome one’s ascent—one ascends lightly in broad daylight.\n\n**Explaining Yin and Yang**\n\nThe Great Dao is empty and harmonious, embracing Heaven and Earth, driving yin and yang to form the cosmos. Heaven’s form is yang, revolving leftward; Earth’s substance is yin, turning rightward. The sun is the essence of yang, moving by day; the moon is the spirit of yin, flowing by night. Sun and moon hang their radiance, and man is born between them, embracing yang and carrying yin. The sage models Heaven and Earth, discerning yin and yang, externally harmonizing with creation to achieve the Returned Elixir, and internally nurturing essence and qi to secure the body. Then the intestines are free of residue, the nine orifices open and close, and one practices stillness. Not partaking of the five flavors, the five viscera remain pure. Not listening to the five sounds, the spirit can transform. Wearing plain robes and simple sashes, one tempers the body; dwelling alone, one seals the essence. Thus, qi transforms into blood, and blood is yin.\n\nBlood transforms into essence, and essence is yang. Essence is the numinous spirit that guards the bones; when essence is exhausted, the bones wither, and when the bones wither, the spirit grieves—grief of the spirit leads to death. Refining the spirit and guarding essence is the principle of longevity.\n\nThe *Changsheng cheng* states:\n*\"I urge you to study the Dao and hold fast to integrity,\nFirst sever the five grains and forsake the six passions.\nIngest primordial qi to fill the five forms,\nRoam freely and follow the wind’s path.\"*\n\nThe *Neijing Jing* says: *\"Those who seek immortality must be most cautious in the chamber of desire—why court death and make the spirit weep?\"* The spirit is yang, and the body is yin; the living are yang, while ghosts are yin. When yang is exhausted, it vanishes; yang shines while yin conceals. Thus, the Great Medicine transcends the world, summoning yang by calling yin, with azure lads in attendance and spirits at command.\n\nWhen cold, contemplate the Great Yang to grow warm; when hot, contemplate the Great Yin to grow cool. Whistling, one summons wind and clouds; treading, one crosses seas and mountains. Sitting or standing, one appears and vanishes, moving between yin and yang—being yet not being, neither existing nor non-existing.\n\n*The Treatise on Gold, Stone, and Numinous Cinnabar by Master Zhang* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "张真人金石灵砂论 经名：张真人金石灵砂论。 唐账九垓撰。 一春。 底本出处：《正统道藏》洞神部众街类。 张真人金石灵砂论 蒙山张隐居撰 黄金篇 黄金者，日之精也，为君。 服之，通神轻身，能利五藏，逐邪气，杀鬼魅。 久服者皮肤金色。 金生山石中，积太阳之气，熏蒸而成性，大热，有大毒，傍蒸数尺石，皆尽黄化为金色，况缎炼服之者乎。 近金生者，名日金英。 次而生者，名曰金华。 远而生者，名日金贼。 百步而生者，名日金芽。 若以此金作粉屑，服之销人骨髓，焦缩而死也。 黄金者，太阳之正气，日之魂，象三魂也。 白汞者，太阴之正气，月之魄，象七魄也。 合而服之，即不死。 黄金是西方庚辛金，白汞是北方壬癸水，水乃金之子也。 古人日：食金如金，食玉如玉，金之性坚。 煮之不烂，埋之不腐，烧之不焦，所以能生人。 药金服之，肌肤不坏，毛发不焦，而阴阳不易，鬼神不侵，故寿无穷也。 上金有老聪流星金，黄帝楼鼎金，马君红金，阴君马蹄金，狐刚子河车金，安期先生赤黄金，金娄先生还丹金，刘安马蹄金，茅君紫铅金，束园公上田青龙金，李少君煎泥金，范蠡紫丹金，徐君点化金，皆神仙药化，与大造争功，洞神明之旨，契黄白之妙，不可轻用，而有谴责。 外有生於山川溪涧者，是下金也。 白金诀 银者，白金也。 少阳之精，而生於阴，为臣。 服之通神不死，坚筋骨，微热，有小毒，即铅中所产也。 位属西方，太白之精。 《龙虎经》日：高女为日，坎男为月。 九霄君曰：南方之水，北方之火，阴以处阳，阳以处阴。 往来有则，一浮一沉。 为夫为妇，并意齐心。 年终性毁，共枕同袅。 是子午之位，龙虎列居者也，不可单服，《龙虎经》日：白虎为敖枢，青龙与之俱。 黄金为君，白银为臣，曾青为使，雄黄为将军，合炼成金丹。 经云，金丹入五内，雾散若风雨。 熏蒸达四肢，却老返婴孩。 又曰：玉液黑发，金丹驻颜。 但白金成黄金，成赤金，是还丹之大义也。 黑铅篇 铅者黑，金也，水也，属北方，成数一，为臣。 服之通神。 治三关，黑髭发，少颜色，调血脉，治疮瘫，杀九虫，利五藏，而生於阳。 白银是其母，性微玲，有毒，可作黄丹胡粉蜜陀僧也。 《九都丹经》云：修炼九光神丹，将铅抽作，千变万化，不失常性，唯铅与汞。 《龙虎经》曰：九还七返，八归六居，男白女赤，金火相俱。 男白者，铅也。 抽取铅精九数，象九黑，阳数极九也。 女赤者，水银也。 作七返，象七黑，阴数七，阴极於七者也，o炼取铅精，合炼成药金，其色甚黄，服之不死。 雄黄篇 雄黄为君，服之通神。 向阳生日雄，背阳生曰雌，一体同产，故夹错而生山石中。 至热，有毒，乃少阳之精，作丹服，补泥丸，实脑户，养三宫。 用雄雌各二两，和汞一斤，铅精四两，火伏之成黄金，作液，服之能冲天。 《龙虎经》日：出武都者佳，诸石不可用。 唯雄黄能辟众邪，故名之为将军。 朱砂篇 光明砂，紫砂。 昔贤服之者甚众，而求度世长生者，未之有也。 余明其理。 夫光明砂紫砂，以火服之，逐邪气，治热病，未能童颜钳发，何者。 光明砂一斤，飞淘得汞十二两，火炼得黑灰一抄。 黑灰者，朱砂。 本质入炉，飞精英为汞，饵之延年。",
      "translated_text": "**The Venerable Master Zhang’s Treatise on Alchemical Minerals and Cinnabar**\n\n**Title:** *The Venerable Master Zhang’s Treatise on Alchemical Minerals and Cinnabar*\n**Author:** Zhang Jiugai of the Tang Dynasty\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Section on Miscellaneous Arts* under the *Dongshen* Department\n\n---\n\n### *The Venerable Master Zhang’s Treatise on Alchemical Minerals and Cinnabar*\n**By Zhang Yinju of Mengshan**\n\n#### **The Yellow Gold Chapter**\nYellow gold is the essence of the sun and serves as the sovereign. Ingesting it enables communion with spirits, lightens the body, benefits the five viscera, expels pathogenic qi, and slays demonic influences. Prolonged consumption turns the skin golden.\n\nGold forms within mountain stones, accumulating the qi of the great yang, refined by steaming until its nature is fixed. It is intensely hot and highly toxic, such that stones several feet around it are transformed into a golden hue—how much more so for those who refine and ingest it?\n\nGold that grows near its source is called *Golden Bloom*; that which follows is *Golden Splendor*; that which grows farther is *Golden Bandit*; and that which emerges a hundred paces away is *Golden Sprout*. If this gold is ground into powder and consumed, it will corrode the bones and marrow, causing withering and death.\n\nYellow gold is the true qi of the great yang, the soul of the sun, symbolizing the three hun-souls. White mercury is the true qi of the great yin, the spirit of the moon, symbolizing the seven po-souls. Consuming them together confers immortality.\n\nYellow gold corresponds to the west, the metal of *geng* and *xin*; white mercury corresponds to the north, the water of *ren* and *gui*. Water is the child of metal.\n\nThe ancients said: *\"To consume gold is to become like gold; to consume jade is to become like jade.\"* Gold’s nature is unyielding—boiling does not soften it, burial does not rot it, burning does not char it—thus it can sustain life. When medicinal gold is ingested, the flesh does not decay, the hair does not wither, yin and yang remain unaltered, and ghosts and spirits cannot invade; hence, longevity is boundless.\n\nThe finest golds include *Old Sage’s Meteor Gold*, *Yellow Emperor’s Cauldron Gold*, *Master Ma’s Crimson Gold*, *Lord Yin’s Horseshoe Gold*, *Fox Venerable’s River Chariot Gold*, *Master Anqi’s Vermilion Gold*, *Master Jinlou’s Returned Elixir Gold*, *Liu An’s Horseshoe Gold*, *Lord Mao’s Purple Lead Gold*, *Eastern Garden Elder’s Upper Field Azure Dragon Gold*, *Li Shaojun’s Smelted Mud Gold*, *Fan Li’s Purple Elixir Gold*, and *Master Xu’s Transmuted Gold*—all divine alchemical transformations rivaling the great work of creation, embodying the mysteries of the Dao and the marvels of the yellow and white. They must not be used lightly, lest one incur divine censure.\n\nGold that forms in mountains, rivers, and streams is of inferior grade.\n\n#### **The White Gold Formula**\nSilver is white gold, the essence of lesser yang born of yin, serving as the minister. Ingesting it enables communion with spirits and confers deathlessness, strengthens the sinews and bones, and is mildly hot with slight toxicity. It is produced within lead.\n\nIts position corresponds to the west, the essence of Venus. *The Dragon-Tiger Classic* states: *\"The lofty maiden is the sun; the abyssal youth is the moon.\"* The Lord of the Nine Heavens says: *\"The water of the south, the fire of the north—yin dwells within yang, yang within yin. Their movements follow principle, now floating, now sinking. As husband and wife, their intentions are as one. When the year ends, their natures dissolve, and they share the same pillow and mat.\"*\n\nThis is the position of *zi* and *wu*, where the dragon and tiger reside. It must not be consumed alone. *The Dragon-Tiger Classic* says: *\"The White Tiger is the pivot; the Azure Dragon accompanies it. Yellow gold is the sovereign, white silver the minister, malachite the messenger, and realgar the general.\"* When refined together, they form the golden elixir.\n\nThe scriptures say: *\"When the golden elixir enters the five viscera, its mist scatters like wind and rain. Steaming through the four limbs, it reverses aging and restores youth.\"* It is also said: *\"Jade liquid blackens the hair; golden elixir preserves the complexion.\"* When white gold is transmuted into yellow or red gold, this is the great principle of the returned elixir.\n\n#### **The Black Lead Chapter**\nLead is black, a metal and water, belonging to the north. Its completion number is one, and it serves as the minister. Ingesting it enables communion with spirits, treats the three barriers, blackens the beard and hair, restores youthful complexion, regulates the blood vessels, heals sores and paralysis, kills the nine worms, and benefits the five viscera—yet it is born of yang.\n\nWhite silver is its mother. Its nature is slightly cold and toxic; it can be made into *yellow lead*, *lead powder*, *white lead*, and *litharge*.\n\n*The Scripture of the Nine Capitals* states: *\"In refining the Nine Radiance Divine Elixir, lead is drawn out, undergoing a thousand transformations without losing its constant nature—only lead and mercury are thus.\"*\n\n*The Dragon-Tiger Classic* says: *\"Nine returns, seven reversions, eight reunions, six residences—male white, female red, gold and fire together.\"* The male white is lead. Extracting the essence of lead nine times mirrors the nine blacks, for nine is the extreme of yang numbers. The female red is mercury. The seven reversions mirror the seven blacks, for seven is the extreme of yin numbers. Refining the essence of lead and combining it into medicinal gold yields a deep yellow hue; ingesting it confers deathlessness.\n\n#### **The Realgar Chapter**\nRealgar serves as the sovereign. Ingesting it enables communion with spirits. That which grows facing the sun is called *male realgar*; that which grows in shadow is called *female realgar*. Born as one body, they intermingle within mountain stones.\n\nIt is intensely hot and toxic, the essence of lesser yang. When used in elixirs, it supplements the mud pill, solidifies the brain chamber, and nourishes the three palaces. Taking two ounces each of male and female realgar, mixing with one catty of mercury and four ounces of lead essence, and subduing with fire yields gold. When liquefied and ingested, it enables ascension to heaven.\n\n*The Dragon-Tiger Classic* states: *\"That from Wudu is finest; other stones are unusable.\"* Only realgar can repel all evil influences, hence its name, *the General*.\n\n#### **The Cinnabar Chapter**\nThere are *Radiant Cinnabar* and *Purple Cinnabar*. Many sages of old consumed them, yet none attained transcendence or longevity. I clarify the principle here.\n\nWhen *Radiant Cinnabar* and *Purple Cinnabar* are ingested with fire, they expel pathogenic qi and treat febrile diseases, but they cannot restore youthful complexion or blacken the hair. Why? From one catty of *Radiant Cinnabar*, sublimation yields twelve ounces of mercury, and firing yields one pinch of black ash. This black ash is the original substance of cinnabar, which, when placed in the furnace, releases its essence as mercury. Ingesting it prolongs life.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1254,
      "start_sentence": 0,
      "end_sentence": 67,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.33634901046753,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\张真人金石灵砂论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "不可以黑灰为药，服之得度世。 故知服光明紫砂者，未经法度制炼，则灰质犹存，所以不能长生者也。 老君昔为周柱史，知周室微弱，西游度关，恐金丹道绝，乃以丹砂法付尹喜。 后世人得之，因兹伪谬，以炼成灵砂，名之为丹，亦日光明砂，配合饵之，方得度世不死，点化黄金。 一名药砂，一名丹砂，一名灵砂，一名还丹。 世人若纯服光明砂紫砂，别无配合制度，以求不死，去道弥远。 灵砂九转，父不传子，化为黄白，自然相使。 夫光明砂紫砂，服之不得度世，何也。 还丹者，取阴阳之精，法天地造化之功，水火相济，自无入有，以成其形，岂若砂汞独阴为体，无阳配生，不能合四象，运五行，所以孤阴不育，寡阳不生，阴肠配合，方成还丹。 余自开元问二十余年，专心金鼎，颇悟幽微，窃见世人以此二砂服饵，以为七返灵丹，服之无不夭横者也。 真汞篇 水银者，月之精也。 生於阳，为臣。 服之轻身不死，辟精魅，通神明，杀三尸，清五藏，除九虫，断邪气，而生於丹砂。 丹砂属南方火，火是木之子，而生水银。 水银是青龙之孙，水之母也。 性玲，微有毒，而生於土石，是丹砂魂魄也。 垩代赭及九铅，畏榆甘。 妇人生服之，伤胎。 丈夫生服之，阳销。 《龙虎经》曰：丹砂木精，得金乃并。 真人云：不贵黄白，而重还丹。 所以度世不死，必基於汞，合炼黄白，飞伏成丹，神仙变化，皆犹砂汞，添贯三金，傍通四石者矣。 《潜通诀》曰：水银生万物，圣人独知之。 水德最尊，汞是水之母，而在天为雾露，在地为泉源，方圆随形，不与物竞，善治万品，而生群类也。 夫水性至静，而不匀物竞。 是以汞者，水银之异名也。 亦日太阳流珠，亦日长子，亦曰河上诧女，今人飞成轻粉，亦作熟珠用之。 础黄篇 毗黄生於山石问，服之通神。 少阳之精，至热，有大毒。 世人流飞之作丸，疗玲病。 甚武烈，忌热钙。 若人服一丸，或二丸，霜气透出，而面肿身虚。 流俗不晓，以为丹，兹乃大恨。 亦名曰霜，以其色白，故曰霜也。 作黄白术者用之。 成金篇 汞一斤，白虎八两，雄雌白雪八两，火伏六十日，成丹，服之必不死，以此金作液。 服之，身如金色。 用瓶盛藏於土二百日后，以火温百日，成液，服之，上升太清。 阴君讶曰：金液还丹生羽衣，千变万化无不宜。 一阴一阳日道，圣人法阴阳，夺造化。 故阳药有七，金二石五，黄金、白银、雄雌、毗黄、曾青、石硫黄，皆属阳药也。 阴药有七，金三石四，水银、黑铅、硝石、朴硝，皆属阴药也。 阴阳之药，各禀其性，而服之，所以有度世之期，不死之理者也。 释紫粉篇 水银、硫黄，烧成小还丹，伏火名紫粉小还丹。 服之，止虚热，压惊痒。 未得度世，不堪点化。 夫水银、雄黄，烧之即飞，故言无也。 黄金、白银，烧之质在，乃日有焉。 譬犹人身三魂七魄。 神明往来，不见其形，应之以五气形骸九窍，则日有矣。 故有无所以相生，而立乎身。 真经日：音声相和，物类相感，有无综贯，阴阳负抱，而道在其中矣。 故黄金成而为赤金，赤金就而为紫粉，则阴阳和合，二气相生，而成金丹。 金丹者以有制无，以无生有。 故《潜通论》曰：两无宗一有，灵化妙难窥。",
      "translated_text": "Black ash cannot be taken as an elixir to achieve transcendence. Thus, those who ingest *Radiant Cinnabar* or *Purple Cinnabar* without proper refinement and firing retain its residual ash, which is why they fail to attain longevity.\n\nIn ancient times, Lord Lao served as the Archivist of Zhou. Foreseeing the dynasty’s decline, he journeyed west to cross the pass, fearing the Way of the Golden Elixir would be lost. He entrusted the method of cinnabar to Yin Xi. Later generations, however, distorted the teachings, producing what they called *Spiritual Cinnabar*—also named *Radiant Cinnabar*—and compounding it for ingestion. Only then could one transcend mortality, avoid death, and transmute base metals into gold. It is also called *Medicinal Cinnabar*, *Cinnabar*, *Spiritual Cinnabar*, or *Returned Elixir*.\n\nIf one consumes *Radiant Cinnabar* or *Purple Cinnabar* alone, without proper compounding or method, the pursuit of immortality strays ever farther from the Dao. The *Spiritual Cinnabar* of nine transformations is not passed from father to son; it naturally transmutes into yellow and white. Why, then, does ingesting *Radiant Cinnabar* or *Purple Cinnabar* fail to grant transcendence?\n\nThe *Returned Elixir* gathers the essence of yin and yang, emulating the creative power of Heaven and Earth. Water and fire harmonize, transforming the insubstantial into substance to form its body. How can mere cinnabar and mercury—embodying only yin, lacking yang’s generative pairing—unite the Four Symbols or circulate the Five Phases? Solitary yin cannot nurture, and solitary yang cannot generate. Only when yin and yang unite is the *Returned Elixir* achieved.\n\nFor over twenty years since the Kaiyuan era, I have devoted myself to the golden crucible, gaining some insight into its mysteries. I have witnessed how people consume these two cinnabars, mistaking them for the *Seven-Returned Spiritual Elixir*, only to meet untimely deaths.\n\n#### **The True Mercury Chapter**\nMercury is the essence of the moon, born of yang, and serves as minister. Ingesting it lightens the body to avoid death, repels spectral influences, connects with divine clarity, slays the Three Corpses, purifies the Five Viscera, expels the Nine Worms, and severs pathogenic qi—yet it originates from cinnabar.\n\nCinnabar belongs to the southern fire, and fire, as wood’s child, gives birth to mercury. Mercury is the grandson of the Azure Dragon and the mother of water. Its nature is cold, with slight toxicity, and it arises from earth and stone as the soul and spirit of cinnabar. It is averse to red ochre and the nine leads, and fears elm and licorice. If women consume it raw, it harms the fetus; if men do so, it depletes yang.\n\nThe *Classic of the Dragon and Tiger* states: *\"Cinnabar is the essence of wood; only when united with metal does it coalesce.\"* The Perfected One said: *\"Not prizing yellow and white, but valuing the Returned Elixir.\"* Thus, to transcend mortality and avoid death, one must begin with mercury, compounding and refining it with yellow and white to sublimate and subdue it into an elixir. The transformations of divine immortals all rely on cinnabar and mercury, enriched by the Three Metals and harmonized with the Four Stones.\n\nThe *Secret Transmission* states: *\"Mercury generates the myriad things; only the sage comprehends it.\"* The virtue of water is most revered. Mercury, as water’s mother, becomes mist and dew in the heavens and springs upon the earth. It adapts to all shapes without contending with things, skillfully governing the myriad forms and giving life to all beings.\n\nWater’s nature is supremely still, never vying with other things. Thus, mercury is another name for liquid silver. It is also called *Luminous Pearl of the Great Yang*, *Eldest Son*, *Riverbank’s Marvelous Maiden*, or *Flying Light Powder* when refined, and is used as *Matured Pearl*.\n\n#### **The Orpiment Chapter**\nOrpiment arises among mountain stones. Ingesting it connects with the divine. It is the essence of lesser yang, intensely hot, and highly toxic. People refine it into pills to treat cold diseases, but its effects are fierce, and it must not be taken with hot foods. If one consumes one or two pills, frost-like qi emerges, causing facial swelling and bodily weakness. The common folk, unaware, mistake it for an elixir—this is a grave error. It is also called *Frost* due to its white color and is used in the art of transmuting yellow and white.\n\n#### **The Gold-Forming Chapter**\nOne catty of mercury, eight ounces of *White Tiger*, and eight ounces of *Male-Female White Snow*, fired for sixty days, form an elixir. Ingesting it ensures immortality, and this gold can be liquified. Consuming it turns the body golden. Stored in a jar buried underground for two hundred days, then warmed with fire for a hundred days, it becomes a liquid. Ingesting it ascends one to the Great Clarity.\n\nMaster Yin states: *\"The Golden Liquid and Returned Elixir give rise to feathered robes; their thousand transformations and myriad changes are without limit.\"* The Dao is the interplay of one yin and one yang. The sage models yin and yang, seizing the power of creation.\n\nThus, yang medicines number seven: two metals and five stones—gold, silver, male and female [mercury], orpiment, azurite, and sulfur—all belong to yang medicines. Yin medicines also number seven: three metals and four stones—mercury, black lead, saltpeter, and mirabilite—all belong to yin medicines. Each yin and yang medicine embodies its nature, and ingesting them holds the promise of transcendence and the principle of immortality.\n\n#### **The Purple Powder Chapter**\nMercury and sulfur, burned into the *Lesser Returned Elixir* and subdued by fire, are called *Purple Powder of the Lesser Returned Elixir*. Ingesting it relieves deficiency heat and suppresses fright and itching. It cannot grant transcendence or transmute metals.\n\nWhen mercury and orpiment are burned, they vanish—hence, they are called *nonbeing*. Gold and silver, when burned, retain their substance—hence, they are called *being*. This is like the human body’s three hun souls and seven po souls: the divine luminosity comes and goes unseen, but when manifested in the five qi, bodily form, and nine orifices, it is called *being*. Thus, being and nonbeing give rise to one another and are established within the body.\n\nThe *True Classic* states: *\"Sounds harmonize, things resonate, being and nonbeing interweave, yin and yang embrace—and the Dao resides therein.\"* Thus, yellow gold becomes red gold, and red gold becomes purple powder. When yin and yang harmonize and the two qi generate one another, the Golden Elixir is achieved.\n\nThe Golden Elixir governs nonbeing to restrain being and uses nonbeing to generate being. The *Secret Transmission* states: *\"Two nonbeings are the origin of one being; the numinous transformation is wondrous and difficult to fathom.\"*",
      "overlap_context": ". I clarify the principle here.\n\nWhen *Radiant Cinnabar* and *Purple Cinnabar* are ingested with fire, they expel pathogenic qi and treat febrile diseases, but they cannot restore youthful complexion or blacken the hair. Why? From one catty of *Radiant Cinnabar*, sublimation yields twelve ounces of mercury, and firing yields one pinch of black ash. This black ash is the original substance of cinnabar, which, when placed in the furnace, releases its essence as mercury. Ingesting it prolongs life.",
      "start_char": 1254,
      "end_char": 2481,
      "start_sentence": 68,
      "end_sentence": 126,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.490983963012695,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\张真人金石灵砂论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "此之谓也。 释还丹篇 言还丹者，朱砂生汞，汞返成砂，砂返出汞。 又曰白金黄石，合而成金，金成赤色，还如真金，故名还丹。 《龙虎经》日：金来返本初，乃得称还丹。 汞匀金石相贯，而成赤金，是曰还丹之正名，从黄金而转之成紫金，名日紫金还丹，其道毕矣。 石流相注，成金色正赤，亦名金液还丹。 亦有散屑，鼓之名曰金丹。 错之为屑，研成粉，名日金粉。 经日：金粉相投，黄白可求。 世人不了还丹之理，或论谓一粒点成十斤，或说一铢化成百两，虚张分数，未了端倪，广施门户，谄诈相扶。 但嫌黄白道微，阔演大丹，荡漾其意，眩惑旱公，危脆之词，何益之有，指空作实，麾假成真，而弃黄白正宗，不知大丹从何而有。 古评云：黄金成，世可度。 黄金不成，徒自误。 此黄白者，乃还丹之骨髓，大药之真宗。 若不了黄白，徒劳勤苦。 有聚财同造，按本看方，节度非时，铢两不定，固兹差舛，所作难成，是以圣人秘密，不能正论，多有隐语，从此经方伪谬，互相嗤眩，又不思其真理，荒芜其法。 古人所以或隐名於形象，或托附於阴阳，潜说人间秘言，微妙有此难晓，草惑自生。 故谣日：紫云顶上生，白虎含真气。 自外闲文书，不及《参同契》。 又讶日：白虎含赤龙，一飞还一伏。 一物贯五彩，永作仙人禄。 《龟甲经》日：我命在我，不在天地。 天地有金，我能作之。 二黄一赤，立成不疑。 真人曰：还中复有金，金中复有还。 故云：见金视之如土石也。 一名天持龙虎，一名太一阴符。 《龙虎经》曰：恐泄天一之符。 《潜通》日：三光六沉。 三光即水土金也。 三五者，道生阴，阴生阳，阴阳生五行，伏炼还丹，成其一也。 还丹三尊，水土金也。 天有三尊，日月星也。 地有三尊，山海河也。 人有三尊，君父师也。 身有三尊，三丹田也。 真人张道陵·日：汝身有黄赤之道，阴阳三五七九之法。 子得不死，可受之。 三者，三魂，而属左。 七者，七魄，而属右。 青虹者，天之魂，而见於束。 白虹者，天之魄，而见於西。 头有九宫，明堂有一，思见之则神仙也。 人象天地，乃言三五七九之法。 《龙虎经》日：三五与一，天地至精。 水土金三物，由变化飞腾伏炼，成大还丹。 除三物之外，傍助药物，不是正用，故不足论也。 释金液篇 若修金液，先炼黄白。 黄白得成，乃达金石之理。 黄白若不成，何修金液乎。 石金性坚而热，有毒，作液而难成。 忽有成者，如钙糊，亦不堪服食，销人骨髓。 药金若成，乃作金液，黄赤如水，服之冲天。 如人饮酒，注身体散如风雨。 此皆诸药之精。 聚而为之。 所以神液就而金石化。 如服金液，以甲子日，鹤坐，向日，心念天真，服之，其身金色，羽节龙车蟠蜿而下，迎之上升，白日轻举也。 释阴阳篇 大道冲融，而包天地，驱策阴阳，成乎宇宙。 天形阳而左旋，地质阴而右转。 日为阳精而昼行，月为阴灵而夜流，日月垂曜，而人生乎其中，抱阳而负阴。 圣人法象天地，辩别阴阳，外合造化，以成还丹。 内养精气，以固形体。 然后使肠无滓，开闭九窍，习而静也。 不纳五味，五藏清也。 不听五音，神能化也。 庞裘素带而练身也，孤居独处而闭精也。 是以气变为血，血为阴也。",
      "translated_text": "This is the meaning of it.\n\n**Explaining the Returned Elixir**\n\nTo speak of the Returned Elixir: cinnabar generates mercury, and mercury reverts to cinnabar; cinnabar in turn produces mercury. It is also said that white gold and yellow stone combine to form gold, and when this gold turns crimson, it returns to the likeness of true gold—hence the name *Returned Elixir*. The *Scripture of the Dragon and Tiger* states: *\"When gold returns to its original state, it may then be called the Returned Elixir.\"* Mercury, evenly blended with metal and stone, forms crimson gold—this is the proper name for the Returned Elixir. Transformed from yellow gold into purple gold, it is called the *Purple Gold Returned Elixir*, and therein the Dao is complete. When stone and mercury flow into one another, producing gold of a true crimson hue, it is also named the *Golden Liquid Returned Elixir*. There are also scattered fragments, refined and called *Golden Elixir*; ground into powder, they are named *Gold Powder*. The scripture says: *\"When gold powder is cast in, yellow and white may be sought.\"*\n\nYet世 people, not understanding the principle of the Returned Elixir, some claim that a single grain can transmute ten pounds, or that one *zhū* can transform into a hundred *liǎng*—exaggerating quantities without grasping the essence, spreading false methods, and propping up deceit with flattery. They disparage the subtle Way of Yellow and White, expounding grandly on the Great Elixir, swaying intentions with dazzling words, and deluding the unwary with fragile, baseless claims. Pointing to emptiness as substance, they turn falsehood into truth, abandoning the true lineage of Yellow and White, unaware of how the Great Elixir could ever arise.\n\nAn ancient appraisal states: *\"If yellow gold is achieved, the world may be delivered. If yellow gold is not achieved, one only misleads oneself.\"* This Yellow and White is the marrow of the Returned Elixir, the true origin of the Great Medicine. Without understanding Yellow and White, one labors in vain. Some gather wealth to undertake the work, following the text but misjudging the timing, uncertain in measurements—such errors lead to failure. Thus, the sages kept it secret, unable to speak plainly, often resorting to veiled language. From this, false and contradictory methods arose, with practitioners mocking one another, neglecting the true principle and letting the method fall into ruin.\n\nThe ancients sometimes concealed names within symbolic forms, or entrusted them to yin and yang, subtly conveying secret teachings—yet their subtlety made them difficult to grasp, and confusion naturally arose. Hence the saying:\n*\"Atop the purple clouds it is born,\nThe White Tiger holds true qi.\nBeyond these idle texts,\nNone compare to the *Triple Concordance Canon*.\"*\n\nAnother verse marvels:\n*\"The White Tiger embraces the Crimson Dragon,\nOne soars, one sinks.\nA single thing threads five hues,\nForever the immortal’s bounty.\"*\n\nThe *Tortoise Shell Scripture* states: *\"My life is in my hands, not in Heaven and Earth. Heaven and Earth possess gold—I can make it. Two yellows and one red, swiftly accomplished without doubt.\"* The Perfected One said: *\"Within the Return there is gold; within gold, there is Return.\"* Thus it is said: *\"See gold and regard it as earth and stone.\"* It is also called *Heaven-Bearing Dragon and Tiger* and *Taiyi’s Yin Talisman*. The *Scripture of the Dragon and Tiger* says: *\"Lest the Heavenly One’s talisman be revealed.\"* The *Secret Transmission* states: *\"Three Lights and Six Sinks.\"* The Three Lights are water, earth, and metal. The Three and Five: the Dao generates yin, yin generates yang, and yin and yang generate the Five Phases. Through refinement and sublimation, the Returned Elixir is achieved, becoming one.\n\nThe Three Honored Ones of the Returned Elixir are water, earth, and metal. Heaven’s Three Honored Ones are the sun, moon, and stars. Earth’s Three Honored Ones are mountains, seas, and rivers. Man’s Three Honored Ones are ruler, father, and teacher. The body’s Three Honored Ones are the Three Elixir Fields. The Perfected One Zhang Daoling said: *\"Within your body lies the Way of yellow and red, the methods of yin and yang, Three, Five, Seven, and Nine. If you attain this, you may receive the teaching of immortality.\"* The Three pertain to the three *hun* souls, belonging to the left. The Seven pertain to the seven *po* souls, belonging to the right. The Azure Rainbow is Heaven’s *hun* soul, appearing in the east. The White Rainbow is Heaven’s *po* soul, appearing in the west. The head has nine palaces; the Hall of Light has one—whoever perceives it becomes a divine immortal. Man mirrors Heaven and Earth, hence the method of Three, Five, Seven, and Nine.\n\nThe *Scripture of the Dragon and Tiger* states: *\"Three, Five, and One—the essence of Heaven and Earth.\"* The three substances—water, earth, and metal—through transformation, sublimation, and refinement, become the Great Returned Elixir. Beyond these three, auxiliary ingredients are not the primary agents and need not be discussed.\n\n**Explaining the Golden Liquid**\n\nTo refine the Golden Liquid, one must first achieve Yellow and White. Only when Yellow and White are accomplished does one grasp the principle of metal and stone. If Yellow and White are not achieved, how can one refine the Golden Liquid? Stone gold is hard and hot, toxic—difficult to liquefy. If by chance it is achieved, it resembles glue and is unfit for ingestion, corroding the bones and marrow. When medicinal gold is achieved, it may then be made into Golden Liquid—yellow and crimson as water. Ingesting it, one soars to Heaven. Like a man drinking wine, it permeates the body, dispersing like wind and rain. All these are the essences of various medicines, gathered and transformed. Thus, when the divine liquid is achieved, metal and stone are transmuted.\n\nTo ingest the Golden Liquid: on a *jiǎzǐ* day, sit like a crane, facing the sun, and meditate on the Heavenly Perfection. Upon ingestion, the body turns golden. Feathered banners and dragon chariots coil down to welcome one’s ascent—one ascends lightly in broad daylight.\n\n**Explaining Yin and Yang**\n\nThe Great Dao is empty and harmonious, embracing Heaven and Earth, driving yin and yang to form the cosmos. Heaven’s form is yang, revolving leftward; Earth’s substance is yin, turning rightward. The sun is the essence of yang, moving by day; the moon is the spirit of yin, flowing by night. Sun and moon hang their radiance, and man is born between them, embracing yang and carrying yin. The sage models Heaven and Earth, discerning yin and yang, externally harmonizing with creation to achieve the Returned Elixir, and internally nurturing essence and qi to secure the body. Then the intestines are free of residue, the nine orifices open and close, and one practices stillness. Not partaking of the five flavors, the five viscera remain pure. Not listening to the five sounds, the spirit can transform. Wearing plain robes and simple sashes, one tempers the body; dwelling alone, one seals the essence. Thus, qi transforms into blood, and blood is yin.",
      "overlap_context": "gs resonate, being and nonbeing interweave, yin and yang embrace—and the Dao resides therein.\"* Thus, yellow gold becomes red gold, and red gold becomes purple powder. When yin and yang harmonize and the two qi generate one another, the Golden Elixir is achieved.\n\nThe Golden Elixir governs nonbeing to restrain being and uses nonbeing to generate being. The *Secret Transmission* states: *\"Two nonbeings are the origin of one being; the numinous transformation is wondrous and difficult to fathom.\"*",
      "start_char": 2481,
      "end_char": 3705,
      "start_sentence": 127,
      "end_sentence": 197,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.03422808647156,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\张真人金石灵砂论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "血变为精，精为阳也。 精者，守骨之灵神，精竭则骨枯，骨枯则神悲，神悲而后死矣。 炼神守精，长生之理矣。 长生诚日：劝子学道事须贞，先断五谷离六情。 服食元气充五形，逍遥自在随风行。 《内景经》日：学仙至慎房中急，何为死作令神泣。 神为阳而形为阴，生人为阳，而鬼为阴，阳尽不见，阳耀而阴藏，所以大药度世，而呼阴召阳，青腰侍卫，役使鬼神。 寒思太阳而热，热思太阴而寒，啸吃风云，涉海外山，坐在立亡，而出入阴阳，不有而有，不无而无者也。 张真人金石灵砂论竟",
      "translated_text": "Blood transforms into essence, and essence is yang. Essence is the numinous spirit that guards the bones; when essence is exhausted, the bones wither, and when the bones wither, the spirit grieves—grief of the spirit leads to death. Refining the spirit and guarding essence is the principle of longevity.\n\nThe *Changsheng cheng* states:\n*\"I urge you to study the Dao and hold fast to integrity,\nFirst sever the five grains and forsake the six passions.\nIngest primordial qi to fill the five forms,\nRoam freely and follow the wind’s path.\"*\n\nThe *Neijing Jing* says: *\"Those who seek immortality must be most cautious in the chamber of desire—why court death and make the spirit weep?\"* The spirit is yang, and the body is yin; the living are yang, while ghosts are yin. When yang is exhausted, it vanishes; yang shines while yin conceals. Thus, the Great Medicine transcends the world, summoning yang by calling yin, with azure lads in attendance and spirits at command.\n\nWhen cold, contemplate the Great Yang to grow warm; when hot, contemplate the Great Yin to grow cool. Whistling, one summons wind and clouds; treading, one crosses seas and mountains. Sitting or standing, one appears and vanishes, moving between yin and yang—being yet not being, neither existing nor non-existing.\n\n*The Treatise on Gold, Stone, and Numinous Cinnabar by Master Zhang* concludes.",
      "overlap_context": "lly harmonizing with creation to achieve the Returned Elixir, and internally nurturing essence and qi to secure the body. Then the intestines are free of residue, the nine orifices open and close, and one practices stillness. Not partaking of the five flavors, the five viscera remain pure. Not listening to the five sounds, the spirit can transform. Wearing plain robes and simple sashes, one tempers the body; dwelling alone, one seals the essence. Thus, qi transforms into blood, and blood is yin.",
      "start_char": 3705,
      "end_char": 3926,
      "start_sentence": 198,
      "end_sentence": 206,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.438287973403931,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\张真人金石灵砂论.txt",
        "category": "众术类"
      }
    }
  ]
}