{
  "source_id": "慈明瑞象灯仪",
  "source_file": "chunked_daozang\\慈明瑞象灯仪.json",
  "total_chunks": 5,
  "total_original_chars": 2604,
  "total_translated_chars": 17188,
  "total_translation_time": 87.21084475517273,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\威仪类\\慈明瑞象灯仪.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Rite of the Radiant Auspicious Lamp of Li Ming*\n\n**Scripture Title:** *The Rite of the Radiant Auspicious Lamp of Li Ming* (1 juan).\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Weiyi* Category.\n\n**The Rite of the Radiant Auspicious Lamp of Li Ming**\n\nWe reverently recall: the Great Dao shines resplendent, its silent virtue ever-responsive; with utmost reverence and care, every prayer finds its way.\n\nWe, your humble servants, now kindle the true incense and devoutly invoke:\nThe August Sage of the Southern Quarter, the True Lord of the Three Qi’s Fiery Virtue and Punitive Justice, Mars the Enforcer;\nThe Vermilion Heaven’s Crimson Sovereign, the Supreme Daoist True Lord;\nThe Enforcer of the Southern Palace, the Lord of Longevity Extension and Record-Keeping;\nThe Fire Ancestor, the Lord-Emperor Suiren;\nThe Fire Minister, King Xuanming of Shangqiu;\nThe Fire Minister, the Great Spirit Yanbo;\nThe Spirit Lord of the Great Fire, the Star-Splitting Wood;\nThe Blessed Lord Zhurong, the True Official Aiding the Flame Emperor;\nThe Spirit Lord Huilu;\nThe Six Celestial Officials of the Left;\nThe Six Celestial Officials of the Right;\nThe Fire Spirit Consort within the Palace of Li Ming;\nGeneral Song of the Flowing Gold Fire Bell;\nThe Fire Calamity Envoys of the Five Directions;\nThe Spirit Lords of the Fire Mules, Fire Horses, Fire Bows, and Fire Arrows;\nAnd all the mighty spirits of the Fire Department under your command.\n\nMay your sagely compassion descend in profound response. By the power of this true incense, may all be equally offered in reverence.\n\n*(Brief statement of intent follows.)*\n\n---\n\nOf old, the vast expanse flows and circulates—great skill remains impartial in the molding of clay;\nAll that is born, nurtured, and grown, every formed thing, belongs to the radiant Li.\nRoots and fibers rely entirely upon lush growth; all species receive the nurturing warmth of the Dao.\nThe sage rides the wind to grasp its patterns; the noble one issues commands to govern the people.\nIn times of peace, they stand firm without shifting direction; in times of abundance, they reflect upon their faults and amend them.\nDare we lay bare our sincere devotion, humbly beseeching the imperial grace.\nFollowing the rites, we kindle lamps, resplendent in the heavens, shining brightly.\n\nOn this day, as we establish the jiao rite for peace, we, the faithful, certain ones among us, having witnessed the warning of fiery destruction, turn in reverence to the office that metes out punishment.\nWe invite the stellar companions to the jade altar, gazing in hope toward the azure vault.\nReverently beneath the gleaming rays, we humbly present our petty concerns, praying that your essence may be moved, and that all may equally receive your vast blessings.\nThe assembly of the dharma raises its sincerity, extolling the sacred titles.\n\n**Invoke the Southern Crimson Longevity Heavenly Worthy**\nWe, your servants, with devoted hearts, take refuge in the Southern Supreme Perfected and Most Sacred Fire Star Lord, Enforcer of the Law; the divine immortals of the Li Palace and all the spirit officials.\nWe have heard: The wondrous Dao stores its essence, concentrating the true qi of the Southern Crimson; the radiant Li nurtures all things, embodying the majestic power of the Flame Emperor.\nWe look up to the Southern Fire Virtue Fire Star Lord, Enforcer of the Law—your virtue aligns with the true Yang, your position surpasses all celestial bodies, you assist the boundless heavens, and your hidden merit nurtures living beings.\nYou secretly hold the power of creation and transformation, silently enacting the most impartial of transformations.\nYou circulate and reveal your signs, manifesting and withdrawing in due time.\nAll within your illumination dare not forget reverence and devotion.\nOn this day, as we establish the jiao rite and kindle lamps, we, the faithful, certain ones among us, dwell in the imperial domain, our lives bound to the celestial paths.\nIn our conduct, we fear negligence of heavenly constancy; in our movements, we stray from daily propriety.\nEver mindful of self-cultivation, we are truly filled with awe and vigilance.\nRelying on the Daoist priest to convey our sincerity, we hope for the divine light to grant us respite.\nTo retreat and yield, we have heard the words of ancient precedent; to pardon faults and dissolve transgressions, deign to regard the prayers of this present time.\nThe multitudes of the people, sheltered by your protection, avert evil and dispel calamity; the myriad households, bathed in your illumination, receive your grace and bestow blessings.\nFrom the noble to the young, all dwell in peace and harmony.\nWe bow our heads in reverence, offering sincere praise.\n\n**Invoke the Fire Virtue Star Lord**\nThe radiant Li fosters virtue; the Fire Lodge stores its spirit.\nYour divine majesty shines with serene splendor, and all species flourish.\nA hundred spans of fiery lightning scorch and annihilate evil spirits.\nYou bind the Nine Fiends and crush demonic hordes.\nUpholding your mighty commands, you steadfastly guard the celestial scriptures.\nAll living beings look up to you, forever preserving peace and tranquility.\nWe, your servants, with devoted hearts, take refuge in the Southern Crimson Heavenly True Sovereign of the Dao; the Great Fire Star-Splitting Wood Spirit Lord; the divine immortals of the Li Palace and all the spirit officials.\nWe have heard: In shaping form and spirit, the Fire Star governs the palace of radiant Li; in the intermingling warmth of all species, the Vermilion Brightness presides over the palace of jade pupils.\nYou dispense fortune and misfortune, discerning good and evil, with nothing left unilluminated by your light, and all sentient beings entrusted to your radiance.\nTo all who make entreaties, you equally grant response.\nOn this day, as we establish the jiao rite and offer lamps, we, the faithful, certain ones among us, reflect that, though sated with warmth and comfort, our transgressions are many.\nWe fear that as our fortune wanes, calamity will arise and misfortune befall.\nThus, we cry out to heaven to plead for life, seeking to atone for our faults and pray for grace.\nDispel and avert the disasters of Huilu; drive away and annihilate the malevolence of Bifang.\nTogether in the dust and sharing wells, may we forever escape the dread of scorched brows; beneath joined roofs and connected eaves, may we not suffer the disaster of raging wildfires.\nMay all people dwell in safety, and all things flourish in spring.\nWe bow our heads in reverence, offering sincere praise.\n\n**Invoke the Crimson Sovereign True Lord of the Dao**\nThe Crimson Sovereign responds to the celestial signs, his virtue rooted in the Crimson Heaven.\nHe wields the law of heaven, exercising this authority.\nHe determines the seasons of withdrawal and manifestation, his flowing bells ever present.\nHis banners sweep across ten thousand li, exposing treachery and transgressions.\nHis oaths are firm, his reverence profound; the divine and true show compassion.\nEver mindful of our devotion, he bestows blessings without end.\nWe, your servants, with devoted hearts, take refuge in the Southern Enforcer of the Law, Longevity and Emolument Bestowing True Lord; the Six Celestial Officials of the Left; the divine immortals of the Fire Department and all the spirit officials.\nWe have heard: The Crimson Emperor holds the tally, riding the flourishing fortune of the Fire Balance; the August Heaven cherishes all things, coinciding with the universal prosperity of summer.\nHe rectifies the imperial mandate with resplendent glory, responding to the three qi of radiant Li.\nAll things appear before him, entering their season of lush fruition; the hundred flourishing lives thrive in the domain of Bing and Ding.\nLooking up, we rely on your clarity; looking down, you regard our crimson devotion.\nWe offer these humble offerings, briefly halting the wind-borne steeds.\nOn this day, as we establish the jiao rite and offer lamps, we, the faithful, certain ones among us, reflect that, though we share in the blessings of the blue-green multitudes, we are pressed by the urgency of our endeavors.\nHow could we be without accumulated transgressions?\nKnowing the peril of dryness, we dare cry out to heaven with our pleas.\nWe present this jiao rite, reverently welcoming your swift chariot, hoping for your gracious regard and the bestowal of peace and blessings.\nFire, ever rising, may it never bring the dread of sudden conflagration; humanity, dwelling within, may it forever harmonize with the great advent of fortune.\nNesting swallows rest securely; calamity is annihilated, and pond fish spared.\nWe bow our heads in reverence, offering sincere praise.\n\n**Invoke the Enforcer of the Law, Longevity Bestowing True Lord**\nThe true qi of radiant Li, the Enforcer of the Law holds exclusive office.\nYou manifest warnings and admonitions, your daily scrutiny ever present.\nYour divine majesty blazes fiercely, upright and impartial.\nYou bring misfortune to the excessive and fortune to the good; prosperity and adversity arise from you.\nOur crimson sincerity ascends; we hope your compassion may be moved.\nThe efficacy of the Dao forever delivers from peril.\nWe, your servants, with devoted hearts, take refuge in the Fire Ancestor, Suiren the Emperor Lord; the Fire Minister, the Great Spirit Yanbo; the Six Celestial Officials of the Right; the divine immortals of the Li Palace and all the spirit officials.\nWe have heard: Fire, ever rising, spreads disaster when its nature is lost.\nYet the lofty heavens, moved by sincerity, must respond.\nWe sorrow for the multitudes of living beings, whose movements become entangled in the transgressions of attachment.\nThus, the ignorant among the lower ranks incur the punishments of the true office.\nVast conflagrations and raging flames melt jade and stone alike;\nScorched brows and charred heads move neighbors to mutual rescue.\n\nBy silent reliance on the divine protection, we have fortunately escaped the peril of smoldering furnaces. Thus, we reverently serve the true standards, humbly offering our gratitude. Today, as we establish this offering of lamps, we, the faithful devotees led by so-and-so, gather the multitude of those who have purified themselves in fasting and solemnity, turning our hearts to the origin of creation. Following the customary sincerity, we together seek blessings and grace. May the heat and affliction we pray for be cooled, dispelling the scorching and aridity. May our daily lives and generations to come find joy in coolness and purity. May the four borders know no fear of barking dogs, and the ten thousand households share the joy of crowing roosters. May all things be free from blight and pestilence, and disasters of wildfire and conflagration be averted. With bowed heads, we take refuge and reverently offer our praises.\n\nWe invoke the Fire Ancestor, Suiren the Emperor Lord:\nHis crimson *gang* manifests in symbol, the Fire Ancestor responds in truth.\nHe holds the mandate of heaven, and the people revere him with awe.\nIn the south is the *Ji* constellation, and all things flourish.\nHe seizes and drives away evil, his subtlety too profound to fathom.\nEncompassing the myriad transformations, he wields the balance of mechanism.\nThe household and the state depend on him, forever securing peace and tranquility.\n\nWe, your servants, with devoted hearts, take refuge in the Blazing Minister, the True Fire Official Zhurong; the Fire Spirit Jun Hui Lu; the Generals of *Bing* and *Ding*; the Fire Bell Envoys; the divine immortals of the Li Palace and all the spirit officials.\n\nWe have heard: When the fire phase governs the heavens, the myriad things rely on its nurturing growth. When the yang spirit ascends the throne, the hundred flourishing beings are all shaped by its molding. Looking up, we observe the waxing and waning of the celestial patterns; looking down, we examine the prosperity and adversity of the earth. Its movements follow no constant measure, and none can perceive the signs of its expansion or contraction. Its numbers differ in celestial paths, and who can fathom the omens of its mechanisms? As we dwell within its illumination, how dare we forget our reverent devotion?\n\nToday, as we establish this offering of lamps, we, the faithful devotees led by so-and-so, gathered before the altar, reflect: Our endowment of life is meager, and our nature is foolish and dull. We know only to pursue profit for our livelihood, unaware of examining ourselves to distance our sins. Thus, in this humble corner of the universe, we reveal our sincere hearts, looking up to implore your benevolent forgiveness, to redeem the faults of many lifetimes.\n\nMay households and dwellings harmonize, flourishing in utmost peace and harmony; may neighborhoods and neighbors be spared from unforeseen calamities that spread and endure. From morning’s cooking to evening’s hearth, may we forever heed the warning to \"move the firewood\" and avoid disaster; from night’s rest to dawn’s rise, may we ever abide in the steadfastness of bedrock. All look up to the impartial illumination, all equally receive the perfect governance of benevolence. With bowed heads, we take refuge and reverently offer praise.\n\nWe invoke the aid of the Fire Spirit, assistant to the True Lord of Flame, and look up in veneration to the Flame Emperor, whose mighty power shines resplendent. As the ancestral master of fire-making, he bestows blessings upon this people. His oversight is never distant, his warnings ever clear. He rewards only goodness and punishes only evil. With purified hearts, we offer sacrifice, that all may be granted peace and prosperity. Wherever his majestic power holds sway, none dare disobey. With devoted hearts, we take refuge in his command, praying to preserve health and tranquility.\n\n**Chant of the Divine Incantation**\nIn the Vermilion Heaven of the South, the Red Spirit reigns supreme.\nHis mighty radiance and blazing flames transform all without partiality.\nWhen the Fire Dragon takes flight, its brilliance shines boundless.\nWhen the Fire Steed leaps forth, it spirals across ten thousand leagues.\nWhen the Fire Hawk darts swift, its wings beat without hindrance.\nWhen the Fire Bell resounds, its mighty sound echoes afar.\nWhen the Fire Ladle is cast, smoke arises wherever it lands.\nWhen the Fire Sword descends, all demons submit in reverence.\nWhen the Fire Rope is raised, a hundred evils entangle themselves.\nWhen the Fire Banner unfurls, commands are obeyed with solemnity.\nWhen the Fire Staff points from afar, who dares seize authority?\nHis great virtue extends to all things, nurturing and preserving life.\nThose who defy his decrees are corrected; scorching disasters blaze across the heavens.\nHe perceives goodness without fail, erasing transgressions and removing faults.\n\n**Prayer of the Lamp Offering**\nOnce, by the Celestial Worthy’s decree, we received the command to guard the Southern Flame.\nNow, by the Celestial Worthy’s salvation, we hear that goodness brings forth auspiciousness.\nWhere the Celestial Worthy’s incantation resides, the Fire Department brings no calamity.\nWhere the Celestial Worthy’s incantation resides, the fire’s might and radiance are stilled.\nWhere the Celestial Worthy’s incantation resides, fire spirits conceal themselves.\nWhere the Celestial Worthy’s incantation resides, all demons perish.\nWhere the Celestial Worthy’s incantation resides, disasters and misfortunes dissolve.\nWhere the Celestial Worthy’s incantation resides, wealth and possessions flourish.\nWhere the Celestial Worthy’s incantation resides, households abide in safety and well-being.\n\n**Recitation of Scriptures and Proclamation of Petitions**\nHumbly we consider: though we bend the chimney and move the firewood, how dare we neglect the teachings of admonition...\n\nBearing punishment and pleading for absolution, one must proceed with utmost sincerity in prayer.\nAs the beacon’s flames withdraw and smoke recedes, the people dwell in peace.\nThe lamp-offerings made heretofore bestow boundless merit and virtue.\nThrough reverent devotion, we now redirect these blessings upward in offering:\nTo the Fire Virtue of the South, the True Lord Mars Who Upholds the Law,\nTo the Cinnabar Heaven Fire Department and all divine immortals,\nTo the host of numinous officials—\nBy the power of this lamp-offering, we universally extend our reverence.\n\nMay they bestow upon us pure blessings, received in accord with our sincerity.\nMay the Fire God avert calamity, forever sparing us scorched heads and blistered brows;\nMay the Pyre Spirit dissolve karmic hindrances, ever granting each household secure repose.\nMay the scourge of conflagration never encroach, and the blessings of well-being fully arrive.\nMay the four classes of people delight in their livelihoods, and all things partake in felicity.\nFor this supreme cause, with wholehearted devotion we intone:\n*Nan Dan Ji Shou Heavenly Worthy, Dispeller of Disasters and Dissolver of Misfortunes,*\n*Whose merit and virtue are boundless and inconceivable.*\n\nThe Rite of the Lamp of Radiant Clarity concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "离明瑞象灯仪 经名：离明瑞象灯仪。 一卷。 底本出处：《正统道藏》洞真部威仪类。 离明瑞象灯仪 法事 恭闻大道昭昭，不言善应； 小心翼翼，有祷必通。 臣等谨炷真香，虔诚上启：南方大圣三炁火德荧惑执法真君，丹天赤皇上道真君，南宫执法延寿司录君，火祖燧人帝君，火正商丘宣明王，火正阏伯大神，大火析木神君，祝融炎帝辅炎真官，回禄神君，左六位仙官，右六位仙官，离明宫内主火灵妃，流金火铃宋将军，五方火殃使者，火骡、火马、火弓、火箭神君，火部合属威灵。 恭望圣慈，俯垂洞格，普仗真香，悉同供养。 略入意",
      "translated_text": "*The Rite of the Radiant Auspicious Lamp of Li Ming*\n\n**Scripture Title:** *The Rite of the Radiant Auspicious Lamp of Li Ming* (1 juan).\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Weiyi* Category.\n\n**The Rite of the Radiant Auspicious Lamp of Li Ming**\n\nWe reverently recall: the Great Dao shines resplendent, its silent virtue ever-responsive; with utmost reverence and care, every prayer finds its way.\n\nWe, your humble servants, now kindle the true incense and devoutly invoke:\nThe August Sage of the Southern Quarter, the True Lord of the Three Qi’s Fiery Virtue and Punitive Justice, Mars the Enforcer;\nThe Vermilion Heaven’s Crimson Sovereign, the Supreme Daoist True Lord;\nThe Enforcer of the Southern Palace, the Lord of Longevity Extension and Record-Keeping;\nThe Fire Ancestor, the Lord-Emperor Suiren;\nThe Fire Minister, King Xuanming of Shangqiu;\nThe Fire Minister, the Great Spirit Yanbo;\nThe Spirit Lord of the Great Fire, the Star-Splitting Wood;\nThe Blessed Lord Zhurong, the True Official Aiding the Flame Emperor;\nThe Spirit Lord Huilu;\nThe Six Celestial Officials of the Left;\nThe Six Celestial Officials of the Right;\nThe Fire Spirit Consort within the Palace of Li Ming;\nGeneral Song of the Flowing Gold Fire Bell;\nThe Fire Calamity Envoys of the Five Directions;\nThe Spirit Lords of the Fire Mules, Fire Horses, Fire Bows, and Fire Arrows;\nAnd all the mighty spirits of the Fire Department under your command.\n\nMay your sagely compassion descend in profound response. By the power of this true incense, may all be equally offered in reverence.\n\n*(Brief statement of intent follows.)*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 249,
      "start_sentence": 0,
      "end_sentence": 10,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.32888913154602,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\慈明瑞象灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "伏以坱圠流行，大巧无私於埏埴； 生育长养，有形尽属於明离。 根荄允赖於蕃滋，品汇悉沾於亭毒。 圣人乘风而取象，君子申命以治民。 居常，则立不易方； 在益，则过而思改。 敢摅素悃，上渎皇钧。 辄依法以然灯，俨在天而炳耀。 今辰建醮祈安，信士某等，比睹焚如之警，皈依主罚之司。 延星侣於瑶坛，仰灵终於碧落。 恭对荧芒之下，特陈蝼蚁之私，冀格精衷，均膺洪贶。 法众运诚，赞扬圣号。 举南丹纪寿天尊 臣等志心皈命，南方至真大圣荧惑执法星君，离宫神仙众和诸灵官。 臣闻：妙道储精，锺南丹之正炁； 离明育物，总炎帝之威灵。 仰惟南方火德荧惑执法真君，德合正阳，位尊众曜，赞襄穹昊，阴骘生灵。 密持造化之权，默运至公之化。 周流示象，现伏有时。 凡属照临，敢忘钦向。 今辰建醮然灯，信士某等生居帝土，命系星躔。 行藏恐慢於天常，动止有乖於日用。 每怀修省，实切畏兢。 凭羽士以传诚，冀神光而容与。 移宫退舍，既闻前古之言； 宥过消愆，俯鉴今时之祷。 群黎百姓，蒙荫佑而弭恶消灾； 万户千门，沐照临而覃恩锡庆。 尊卑长幼，安靖和平。 稽首皈依，虔诚赞咏。 举南方火德星君 明离毓德，火宿储灵。 神威霁景，品汇咸荣。 百寻火电，馘灼邪精。 束缚九丑，摧灭魔群。 奉行威令，备守天经。 群生倾仰，永保安宁。 臣等志心皈命，南方丹天赤皇上真道君，大火析木神君、离宫神仙众和诸灵官。 臣闻：陶铸形神，荧惑治离明之府； 交蒸品汇，朱明宰玉眸之宫。 推运灾祥，鉴明善恶，无物不承於照烛，有情皆托於辉光。 凡有请祈，均蒙感应。 今辰建醮祝灯，信士某等言念，饱温自适，过咎惟多，恐运去以时乖，致灾生而祸至。 辄吁天而请命，庸谢过以祈恩。 消禳回禄之灾，驱殄毕方之孽。 同尘共井，永逃烂额之虞； 按屋连甍，不罹燎原之祸。 人人按堵，物物皆春，稽首皈依，虔诚赞咏。 举赤皇上真道君 赤皇应象，德秉丹天。 执天之法，宰制斯权。 留伏分野，流铃当前。 麾旌万里，察奸紏愆。 誓坚寅畏，神真矜怜。 永怀皈仰，赐福绵绵。 臣等志心皈命，南方执法延寿司禄真君，左六位仙官、火部神仙众和诸灵官。 臣闻：赤帝握符，乘火衡之昌运； 皇天爱物，当夏日之咸亨。 正国祚之重光，应离明之三炁。 万物相见，适当茂实之期； 百昌嘉生，旺以丙丁之地。 仰凭昭晰，俯鉴丹衷，式荐溪毛，暂停风马。 今辰建醮祝灯，信士某等言念，忝与苍生，均叨洪化。 例切经营之急，宁无稔积之愆。 兹知就燥以为忧，辄敢吁天而有请。 式陈醮礼，祗迓飙轮，觊垂降鉴之私，诞锡安宁之祉。 火曰炎上，永无直突之虞； 人在其中，常协大来之庆。 巢安幕燕，殃殄池鱼。 稽首皈依，虔诚赞咏。 举执法延寿真君 离明正炁，执法专司。 显垂警诫，日鉴在兹。 威神赫烈，正直无私。 祸淫福善，否泰由斯。 丹诚上达，觊格回慈。 道之功用，永度屯危。 臣等志心皈命，火祖燧人帝君，火正阏伯大神，右六位仙官、离宫神仙众和诸灵官。 臣闻：炎上曰火，由失性以延灾。 盖高者天，感以诚而必达。 轸念有生之众，动成爱累之愆。 故下士之无知，致真司而行罚。 巨焚烈焰，嘅玉石以俱消； 烂额焦头，感比邻而相救。",
      "translated_text": "---\n\nOf old, the vast expanse flows and circulates—great skill remains impartial in the molding of clay;\nAll that is born, nurtured, and grown, every formed thing, belongs to the radiant Li.\nRoots and fibers rely entirely upon lush growth; all species receive the nurturing warmth of the Dao.\nThe sage rides the wind to grasp its patterns; the noble one issues commands to govern the people.\nIn times of peace, they stand firm without shifting direction; in times of abundance, they reflect upon their faults and amend them.\nDare we lay bare our sincere devotion, humbly beseeching the imperial grace.\nFollowing the rites, we kindle lamps, resplendent in the heavens, shining brightly.\n\nOn this day, as we establish the jiao rite for peace, we, the faithful, certain ones among us, having witnessed the warning of fiery destruction, turn in reverence to the office that metes out punishment.\nWe invite the stellar companions to the jade altar, gazing in hope toward the azure vault.\nReverently beneath the gleaming rays, we humbly present our petty concerns, praying that your essence may be moved, and that all may equally receive your vast blessings.\nThe assembly of the dharma raises its sincerity, extolling the sacred titles.\n\n**Invoke the Southern Crimson Longevity Heavenly Worthy**\nWe, your servants, with devoted hearts, take refuge in the Southern Supreme Perfected and Most Sacred Fire Star Lord, Enforcer of the Law; the divine immortals of the Li Palace and all the spirit officials.\nWe have heard: The wondrous Dao stores its essence, concentrating the true qi of the Southern Crimson; the radiant Li nurtures all things, embodying the majestic power of the Flame Emperor.\nWe look up to the Southern Fire Virtue Fire Star Lord, Enforcer of the Law—your virtue aligns with the true Yang, your position surpasses all celestial bodies, you assist the boundless heavens, and your hidden merit nurtures living beings.\nYou secretly hold the power of creation and transformation, silently enacting the most impartial of transformations.\nYou circulate and reveal your signs, manifesting and withdrawing in due time.\nAll within your illumination dare not forget reverence and devotion.\nOn this day, as we establish the jiao rite and kindle lamps, we, the faithful, certain ones among us, dwell in the imperial domain, our lives bound to the celestial paths.\nIn our conduct, we fear negligence of heavenly constancy; in our movements, we stray from daily propriety.\nEver mindful of self-cultivation, we are truly filled with awe and vigilance.\nRelying on the Daoist priest to convey our sincerity, we hope for the divine light to grant us respite.\nTo retreat and yield, we have heard the words of ancient precedent; to pardon faults and dissolve transgressions, deign to regard the prayers of this present time.\nThe multitudes of the people, sheltered by your protection, avert evil and dispel calamity; the myriad households, bathed in your illumination, receive your grace and bestow blessings.\nFrom the noble to the young, all dwell in peace and harmony.\nWe bow our heads in reverence, offering sincere praise.\n\n**Invoke the Fire Virtue Star Lord**\nThe radiant Li fosters virtue; the Fire Lodge stores its spirit.\nYour divine majesty shines with serene splendor, and all species flourish.\nA hundred spans of fiery lightning scorch and annihilate evil spirits.\nYou bind the Nine Fiends and crush demonic hordes.\nUpholding your mighty commands, you steadfastly guard the celestial scriptures.\nAll living beings look up to you, forever preserving peace and tranquility.\nWe, your servants, with devoted hearts, take refuge in the Southern Crimson Heavenly True Sovereign of the Dao; the Great Fire Star-Splitting Wood Spirit Lord; the divine immortals of the Li Palace and all the spirit officials.\nWe have heard: In shaping form and spirit, the Fire Star governs the palace of radiant Li; in the intermingling warmth of all species, the Vermilion Brightness presides over the palace of jade pupils.\nYou dispense fortune and misfortune, discerning good and evil, with nothing left unilluminated by your light, and all sentient beings entrusted to your radiance.\nTo all who make entreaties, you equally grant response.\nOn this day, as we establish the jiao rite and offer lamps, we, the faithful, certain ones among us, reflect that, though sated with warmth and comfort, our transgressions are many.\nWe fear that as our fortune wanes, calamity will arise and misfortune befall.\nThus, we cry out to heaven to plead for life, seeking to atone for our faults and pray for grace.\nDispel and avert the disasters of Huilu; drive away and annihilate the malevolence of Bifang.\nTogether in the dust and sharing wells, may we forever escape the dread of scorched brows; beneath joined roofs and connected eaves, may we not suffer the disaster of raging wildfires.\nMay all people dwell in safety, and all things flourish in spring.\nWe bow our heads in reverence, offering sincere praise.\n\n**Invoke the Crimson Sovereign True Lord of the Dao**\nThe Crimson Sovereign responds to the celestial signs, his virtue rooted in the Crimson Heaven.\nHe wields the law of heaven, exercising this authority.\nHe determines the seasons of withdrawal and manifestation, his flowing bells ever present.\nHis banners sweep across ten thousand li, exposing treachery and transgressions.\nHis oaths are firm, his reverence profound; the divine and true show compassion.\nEver mindful of our devotion, he bestows blessings without end.\nWe, your servants, with devoted hearts, take refuge in the Southern Enforcer of the Law, Longevity and Emolument Bestowing True Lord; the Six Celestial Officials of the Left; the divine immortals of the Fire Department and all the spirit officials.\nWe have heard: The Crimson Emperor holds the tally, riding the flourishing fortune of the Fire Balance; the August Heaven cherishes all things, coinciding with the universal prosperity of summer.\nHe rectifies the imperial mandate with resplendent glory, responding to the three qi of radiant Li.\nAll things appear before him, entering their season of lush fruition; the hundred flourishing lives thrive in the domain of Bing and Ding.\nLooking up, we rely on your clarity; looking down, you regard our crimson devotion.\nWe offer these humble offerings, briefly halting the wind-borne steeds.\nOn this day, as we establish the jiao rite and offer lamps, we, the faithful, certain ones among us, reflect that, though we share in the blessings of the blue-green multitudes, we are pressed by the urgency of our endeavors.\nHow could we be without accumulated transgressions?\nKnowing the peril of dryness, we dare cry out to heaven with our pleas.\nWe present this jiao rite, reverently welcoming your swift chariot, hoping for your gracious regard and the bestowal of peace and blessings.\nFire, ever rising, may it never bring the dread of sudden conflagration; humanity, dwelling within, may it forever harmonize with the great advent of fortune.\nNesting swallows rest securely; calamity is annihilated, and pond fish spared.\nWe bow our heads in reverence, offering sincere praise.\n\n**Invoke the Enforcer of the Law, Longevity Bestowing True Lord**\nThe true qi of radiant Li, the Enforcer of the Law holds exclusive office.\nYou manifest warnings and admonitions, your daily scrutiny ever present.\nYour divine majesty blazes fiercely, upright and impartial.\nYou bring misfortune to the excessive and fortune to the good; prosperity and adversity arise from you.\nOur crimson sincerity ascends; we hope your compassion may be moved.\nThe efficacy of the Dao forever delivers from peril.\nWe, your servants, with devoted hearts, take refuge in the Fire Ancestor, Suiren the Emperor Lord; the Fire Minister, the Great Spirit Yanbo; the Six Celestial Officials of the Right; the divine immortals of the Li Palace and all the spirit officials.\nWe have heard: Fire, ever rising, spreads disaster when its nature is lost.\nYet the lofty heavens, moved by sincerity, must respond.\nWe sorrow for the multitudes of living beings, whose movements become entangled in the transgressions of attachment.\nThus, the ignorant among the lower ranks incur the punishments of the true office.\nVast conflagrations and raging flames melt jade and stone alike;\nScorched brows and charred heads move neighbors to mutual rescue.",
      "overlap_context": "elestial Officials of the Right;\nThe Fire Spirit Consort within the Palace of Li Ming;\nGeneral Song of the Flowing Gold Fire Bell;\nThe Fire Calamity Envoys of the Five Directions;\nThe Spirit Lords of the Fire Mules, Fire Horses, Fire Bows, and Fire Arrows;\nAnd all the mighty spirits of the Fire Department under your command.\n\nMay your sagely compassion descend in profound response. By the power of this true incense, may all be equally offered in reverence.\n\n*(Brief statement of intent follows.)*",
      "start_char": 249,
      "end_char": 1504,
      "start_sentence": 11,
      "end_sentence": 94,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.544822216033936,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\慈明瑞象灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "默赖神明之佑，幸逃煨炉之虞。 爰祗事於真斿，庸少伸於谢臆。 今辰建醮祝灯，信士某等，率励斋庄之众，皈心造化之宗。 例秉忱诚，同徼福惠。 热恼祈冰，消於烜燥。 起居冀世，乐於清凉。 四境无犬吠之忧，万井协鸡鸣之喜。 物消疵疠，灾免燎焚。 稽首皈依，虔诚赞咏。 举火祖燧人帝君 丹罡示象，火祖应真。 执天之令，民之畏寅。 维南有箕，庶物咸荣。 搀抢去恶，至妙难明。 总括万化，秉以机衡。 家邦是赖，永镇清平。 臣等志心皈命，祝融辅炎真官回禄神君，丙丁将军、火铃使者、离宫神仙和诸灵官。 臣闻：火运司天，万物成资於长养； 阳灵御极，百昌悉自於陶成。 仰周乾象之盈虚，俯察坤舆之否泰。 行无常度，莫窥盈缩之端； 数异躔经，孰究机祥之兆。 科在照临之内，敢忘钦奉之勤。 遥睇明威，式徼繁嘏。 今辰建醮祝灯，信士某在坛众信人等言念，禀生谫薄，赋性愚蒙。 惟知逐利以谋生，罔悟省躬而远罪。 特涓尘宇，昭露丹忱，仰祈善贷之仁，用赎多生之咎。",
      "translated_text": "By silent reliance on the divine protection, we have fortunately escaped the peril of smoldering furnaces. Thus, we reverently serve the true standards, humbly offering our gratitude. Today, as we establish this offering of lamps, we, the faithful devotees led by so-and-so, gather the multitude of those who have purified themselves in fasting and solemnity, turning our hearts to the origin of creation. Following the customary sincerity, we together seek blessings and grace. May the heat and affliction we pray for be cooled, dispelling the scorching and aridity. May our daily lives and generations to come find joy in coolness and purity. May the four borders know no fear of barking dogs, and the ten thousand households share the joy of crowing roosters. May all things be free from blight and pestilence, and disasters of wildfire and conflagration be averted. With bowed heads, we take refuge and reverently offer our praises.\n\nWe invoke the Fire Ancestor, Suiren the Emperor Lord:\nHis crimson *gang* manifests in symbol, the Fire Ancestor responds in truth.\nHe holds the mandate of heaven, and the people revere him with awe.\nIn the south is the *Ji* constellation, and all things flourish.\nHe seizes and drives away evil, his subtlety too profound to fathom.\nEncompassing the myriad transformations, he wields the balance of mechanism.\nThe household and the state depend on him, forever securing peace and tranquility.\n\nWe, your servants, with devoted hearts, take refuge in the Blazing Minister, the True Fire Official Zhurong; the Fire Spirit Jun Hui Lu; the Generals of *Bing* and *Ding*; the Fire Bell Envoys; the divine immortals of the Li Palace and all the spirit officials.\n\nWe have heard: When the fire phase governs the heavens, the myriad things rely on its nurturing growth. When the yang spirit ascends the throne, the hundred flourishing beings are all shaped by its molding. Looking up, we observe the waxing and waning of the celestial patterns; looking down, we examine the prosperity and adversity of the earth. Its movements follow no constant measure, and none can perceive the signs of its expansion or contraction. Its numbers differ in celestial paths, and who can fathom the omens of its mechanisms? As we dwell within its illumination, how dare we forget our reverent devotion?\n\nToday, as we establish this offering of lamps, we, the faithful devotees led by so-and-so, gathered before the altar, reflect: Our endowment of life is meager, and our nature is foolish and dull. We know only to pursue profit for our livelihood, unaware of examining ourselves to distance our sins. Thus, in this humble corner of the universe, we reveal our sincere hearts, looking up to implore your benevolent forgiveness, to redeem the faults of many lifetimes.",
      "overlap_context": "Palace and all the spirit officials.\nWe have heard: Fire, ever rising, spreads disaster when its nature is lost.\nYet the lofty heavens, moved by sincerity, must respond.\nWe sorrow for the multitudes of living beings, whose movements become entangled in the transgressions of attachment.\nThus, the ignorant among the lower ranks incur the punishments of the true office.\nVast conflagrations and raging flames melt jade and stone alike;\nScorched brows and charred heads move neighbors to mutual rescue.",
      "start_char": 1504,
      "end_char": 1902,
      "start_sentence": 95,
      "end_sentence": 121,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.220594644546509,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\慈明瑞象灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "家庭宅舍，谐滋至泰和之休； 闾里比邻，免连延不测之患。 晨炊暮爨，戒永服於徙薪； 夜寐夙兴，安常叨於盘石。 咸仰无私之照，均蒙至治之仁。 稽首皈依，虔诚赞咏。 举祝融辅炎真官 仰崇炎帝，赫赫厥灵。 维燧命祖，福我斯民。 监临不远，警戒昭明。 惟善是修，惟恶是惩。 斋心以祀，普锡安荣。 威灵所主，莫敢不承。 志心皈命，愿保康宁。 众讽神咒 南方丹天，赤灵所专。 威光烈焰，施化不偏。 火龙一飞，照耀无边。 火马一跃，万里盘旋。 火鹰一迅，鼓翼无前。 火铃一撼，洪音远宣。 火瓢一发，到处生烟。 火剑一下，诸魔伏虔。 火索一举，百邪自缠。 火旗一展，号令肃然。 火节遥指，孰敢当权。 盛德及物，长养生全。 逆令返正，炎灾灼天。 鉴善不遗，削罪除愆。 祝灯愒 昔奉天尊教，禀令守炎方。 今奉天尊救，闻善降吉祥。 家有天尊咒，火部不为殃。 家有天尊咒，火势息威光。 家有天尊咒，火怪自潜藏。 家有天尊咒，诸魔自灭亡。 家有天尊咒，灾厄自消禳。 家有天尊咒，财物得阜昌。 家有天尊咒，宅舍得安康。 讽经　宣疏 伏以曲突徙薪，敢昧格言之训；",
      "translated_text": "May households and dwellings harmonize, flourishing in utmost peace and harmony; may neighborhoods and neighbors be spared from unforeseen calamities that spread and endure. From morning’s cooking to evening’s hearth, may we forever heed the warning to \"move the firewood\" and avoid disaster; from night’s rest to dawn’s rise, may we ever abide in the steadfastness of bedrock. All look up to the impartial illumination, all equally receive the perfect governance of benevolence. With bowed heads, we take refuge and reverently offer praise.\n\nWe invoke the aid of the Fire Spirit, assistant to the True Lord of Flame, and look up in veneration to the Flame Emperor, whose mighty power shines resplendent. As the ancestral master of fire-making, he bestows blessings upon this people. His oversight is never distant, his warnings ever clear. He rewards only goodness and punishes only evil. With purified hearts, we offer sacrifice, that all may be granted peace and prosperity. Wherever his majestic power holds sway, none dare disobey. With devoted hearts, we take refuge in his command, praying to preserve health and tranquility.\n\n**Chant of the Divine Incantation**\nIn the Vermilion Heaven of the South, the Red Spirit reigns supreme.\nHis mighty radiance and blazing flames transform all without partiality.\nWhen the Fire Dragon takes flight, its brilliance shines boundless.\nWhen the Fire Steed leaps forth, it spirals across ten thousand leagues.\nWhen the Fire Hawk darts swift, its wings beat without hindrance.\nWhen the Fire Bell resounds, its mighty sound echoes afar.\nWhen the Fire Ladle is cast, smoke arises wherever it lands.\nWhen the Fire Sword descends, all demons submit in reverence.\nWhen the Fire Rope is raised, a hundred evils entangle themselves.\nWhen the Fire Banner unfurls, commands are obeyed with solemnity.\nWhen the Fire Staff points from afar, who dares seize authority?\nHis great virtue extends to all things, nurturing and preserving life.\nThose who defy his decrees are corrected; scorching disasters blaze across the heavens.\nHe perceives goodness without fail, erasing transgressions and removing faults.\n\n**Prayer of the Lamp Offering**\nOnce, by the Celestial Worthy’s decree, we received the command to guard the Southern Flame.\nNow, by the Celestial Worthy’s salvation, we hear that goodness brings forth auspiciousness.\nWhere the Celestial Worthy’s incantation resides, the Fire Department brings no calamity.\nWhere the Celestial Worthy’s incantation resides, the fire’s might and radiance are stilled.\nWhere the Celestial Worthy’s incantation resides, fire spirits conceal themselves.\nWhere the Celestial Worthy’s incantation resides, all demons perish.\nWhere the Celestial Worthy’s incantation resides, disasters and misfortunes dissolve.\nWhere the Celestial Worthy’s incantation resides, wealth and possessions flourish.\nWhere the Celestial Worthy’s incantation resides, households abide in safety and well-being.\n\n**Recitation of Scriptures and Proclamation of Petitions**\nHumbly we consider: though we bend the chimney and move the firewood, how dare we neglect the teachings of admonition...",
      "overlap_context": "e we forget our reverent devotion?\n\nToday, as we establish this offering of lamps, we, the faithful devotees led by so-and-so, gathered before the altar, reflect: Our endowment of life is meager, and our nature is foolish and dull. We know only to pursue profit for our livelihood, unaware of examining ourselves to distance our sins. Thus, in this humble corner of the universe, we reveal our sincere hearts, looking up to implore your benevolent forgiveness, to redeem the faults of many lifetimes.",
      "start_char": 1902,
      "end_char": 2351,
      "start_sentence": 122,
      "end_sentence": 162,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.902274370193481,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\慈明瑞象灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "负刑请罪，必从至祷之诚。 炎燧收烟，人民按堵。 向来祝灯，功德无限。 良因敬用，回向上奉：南方火德荧惑执法真君，丹天火部、一切神仙，诸灵官众。 仗此灯功，普伸回奉。 伏愿锡之纯嘏，享于克诚。 回禄除殃，永免焦头而烂额； 毕方消孽，常臻列屋以安居。 焚燎之灾不侵，康宁之福毕至。 四民乐业，万物蒙休，为上因缘，志心称念：南丹纪寿天尊，消灾解厄天尊，功德无量不可思议。 离明端象灯仪竟",
      "translated_text": "Bearing punishment and pleading for absolution, one must proceed with utmost sincerity in prayer.\nAs the beacon’s flames withdraw and smoke recedes, the people dwell in peace.\nThe lamp-offerings made heretofore bestow boundless merit and virtue.\nThrough reverent devotion, we now redirect these blessings upward in offering:\nTo the Fire Virtue of the South, the True Lord Mars Who Upholds the Law,\nTo the Cinnabar Heaven Fire Department and all divine immortals,\nTo the host of numinous officials—\nBy the power of this lamp-offering, we universally extend our reverence.\n\nMay they bestow upon us pure blessings, received in accord with our sincerity.\nMay the Fire God avert calamity, forever sparing us scorched heads and blistered brows;\nMay the Pyre Spirit dissolve karmic hindrances, ever granting each household secure repose.\nMay the scourge of conflagration never encroach, and the blessings of well-being fully arrive.\nMay the four classes of people delight in their livelihoods, and all things partake in felicity.\nFor this supreme cause, with wholehearted devotion we intone:\n*Nan Dan Ji Shou Heavenly Worthy, Dispeller of Disasters and Dissolver of Misfortunes,*\n*Whose merit and virtue are boundless and inconceivable.*\n\nThe Rite of the Lamp of Radiant Clarity concludes.",
      "overlap_context": "elestial Worthy’s incantation resides, all demons perish.\nWhere the Celestial Worthy’s incantation resides, disasters and misfortunes dissolve.\nWhere the Celestial Worthy’s incantation resides, wealth and possessions flourish.\nWhere the Celestial Worthy’s incantation resides, households abide in safety and well-being.\n\n**Recitation of Scriptures and Proclamation of Petitions**\nHumbly we consider: though we bend the chimney and move the firewood, how dare we neglect the teachings of admonition...",
      "start_char": 2351,
      "end_char": 2535,
      "start_sentence": 163,
      "end_sentence": 173,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.214264392852783,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\慈明瑞象灯仪.txt",
        "category": "威仪类"
      }
    }
  ]
}