{
  "source_id": "摄生纂录",
  "source_file": "chunked_daozang\\摄生纂录.json",
  "total_chunks": 10,
  "total_original_chars": 11140,
  "total_translated_chars": 60318,
  "total_translation_time": 284.59765434265137,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\众术类\\摄生纂录.txt",
    "category": "众术类"
  },
  "full_translation": "**Compendium of Nurturing Life**\n\n**Title:** *She Sheng Mu Lu* (*Admiration for the Records of Nurturing Life*). Author unknown. One fascicle. The *New Tang Catalogue* records *Wang Zhongzhi’s She Sheng Mu Lu* in one fascicle, which may be this text.\n\n**Source of Base Text:** *Zhengtong Daoist Canon*, *Dongxuan Section*, *Zhongyan Category*.\n\n---\n\n### **Compendium of Nurturing Life**\n\n#### **Guiding and Pulling (Dao Yin) Chapter**\n\n**Red Pine Master’s Seated Pulling Method**\nKneel upright, both hands extended forward.\nSeparate them, fingers pointing outward.\nNext, kneel upright, hands clasped at the waist.\nThen kneel upright again, right hand pulling backward, left hand clasped before the abdomen.\nNext, slowly kneel upright, alternating hands pulling forward and clasping the waist.\nThen kneel upright, stretching both hands behind the back.\nFinally, sit evenly, knees spread apart, feet turned outward, hands clasped at the waist.\nRegular practice of this method sharpens hearing and vision, prolongs life, and prevents all illness.\nAfter completing this method, stand and rub the body thoroughly with the hands. Avoid practicing during extreme cold, heat, windy dryness, drunkenness, or after a heavy meal.\n\nThe *Essential Collection of Nurturing Life* states: The *Dao Yin Classic* says: On a clear day, before rising, first tap the teeth thirty-four times, close the eyes, clench the fists, rinse the mouth with saliva, swallow once, then hold the breath to its limit before exhaling slowly.\nStamp the heels three times, then raise the hands, clasping them behind the neck, and twist the body left and right without breathing, repeating three times. Extend both legs, reach forward and backward with the hands, stretching fully three times. Perform these at dawn and dusk; frequent practice is especially beneficial.\nAlso, at dawn upon rising, clasp both ears with the hands and pull them up and down fourteen times to prevent deafness.\nNext, contract the nose, hold the breath, and use the right hand to pull the left ear from above the head fourteen times, then repeat with the left hand pulling the right ear fourteen times.\nThen pull the temples upward.\nThis promotes the flow of blood and qi, preventing gray hair.\nAlso, rub the hands until warm and massage the face upward and downward fourteen times to dispel evil qi and give the face a radiant glow.\nRub the hands until warm and massage the body from top to bottom—this is called \"dry bathing.\"\nIt strengthens resistance to cold, heat, headaches, and all illnesses.\n\n**Brahmin Guiding and Pulling Method**\n1. **Dragon Pulling:** Push both hands upward, as if drawing a bow, alternating left and right. Then clasp the hands and raise them above the head.\n2. **Tortoise Pulling:** Sit upright, feet positioned like the character \"八,\" hands pressing the knees, swaying the body, and turning the head left and right.\n3. **Unicorn Coiling:** Lie on the side, support the head with a bent hand, bring the knees close, then stretch the legs upward and outward, bending the feet forward. Repeat on both sides.\n4. **Tiger Gazing:** Place both hands on the ground, arch the back, and look backward. Repeat on both sides.\n5. **Crane Rising:** Stand, slowly twist the neck backward, pulling left and right.\n6. **Phoenix Striding:** Stand, slowly step forward, clench the fists, and swing the arms forward and backward.\n7. **Mandarin Duck Soaring:** Clasp the hands behind the back, lower the body, and gently twist.\n8. **Bear Thrashing:** Quickly clasp the hands, flip them over the chest, hug the knees to the head, and twist.\n9. **Winter Pine in Empty Snow:** Sit upright, hands pressing the knees, gradually lower the head, and sway left and right, slowly turning.\n10. **Winter Cypress Defying Wind:** Press the hands down, alternately lowering and raising them, pulling and twisting gently.\n11. **Immortal Pushing the Sky:** Sit upright, lean the body to one side, hands pressing the ground as if pushing the sky. Repeat on both sides.\n12. **Phoenix Flapping Wings:** Cross the hands and strike the shoulders, then strike the back, waist, and legs, repeating several times. Perform with gentle pulling and twisting, prioritizing comfort and avoiding overexertion or fatigue.\n\n#### **Regulating Qi Chapter**\n\n**Exhalation and Inhalation for Qi Refinement**\nAll things between heaven and earth take form through qi. Thus, qi resides within humans, and humans reside within qi. When qi gathers, life begins; when qi dissipates, death follows. Those skilled in guiding qi nurture the body internally and ward off harm externally, though the common people use it daily without awareness. Therefore, proper regulation and care dissolve all illnesses; if blockages persist, ailments arise. Those who nurture life must first master this Dao.\n\nThe *Immortal Classics* state: Those who ingest qi gain spiritual clarity and longevity. Yet even those who consume medicinal foods but do not regulate qi will see delayed effects. If one specializes in regulating qi to treat illness, the results surpass acupuncture and stone needles. Those who constantly cultivate this attain the Dao of immortality.\n\n*Baopuzi* says: The human body resembles a kingdom. Spirit is like the ruler, blood like the ministers, and qi like the people. Governing the people enables governance of the state; regulating qi enables regulation of the body. When the people scatter, the state falls; when qi is exhausted, the body dies. The dead cannot be revived, nor can the fallen be restored. Thus, the sage eliminates incipient harm, treats illness before it arises, and heals before matters escalate—not after they have passed. Humans are difficult to nurture yet easy to endanger; qi is hard to purify yet easy to pollute. Therefore, scrutinizing virtue preserves the state, and curbing desires strengthens blood and qi. Only then are all harms dispelled, and longevity attained.\n\nEvery clear morning upon rising, face south, extend both hands upon the knees, and visualize qi entering the neck and descending to the *yongquan* (bubbling spring) acupoint. Doing this daily is called \"sending qi.\" Always inhale through the nose and exhale through the mouth, ensuring exhalation is less than inhalation. Before eating, first send qi into the abdomen, allowing it to govern the food.\n\nThe *Immortals’ Classics* state: \"There are twelve times for consuming qi, which begins at midnight. From nine nines to eight eights, seven sevens, six sixes, and five fives, receive it with the heart. In the four seasons, draw the yellow qi of Saturn and receive it with the spleen. In autumn, draw the white qi of Venus and receive it with the lungs. In winter, draw the black qi of Mercury and receive it with the kidneys. There is also the method of consuming the essence of the six *wu* days, which yields great efficacy. For example, during the *jiazi*旬, if there is a *wuchen* day, face the *chen* direction throughout the旬 to swallow qi; afterward, when the next *jia* day arrives, face the *wu* direction of that旬. All these methods are recorded in the *Immortals’ Classics*, yet they may not be practiced by the common folk—how could a gentleman devoted to the Dao forget them?\"\n\nVarious *Qi-Consuming Classics* state: \"From midnight to noon is the time of living qi; from noon to midnight is the time of dead qi. Always during the living qi hour, lie perfectly still, close the eyes, clench the fists, hold the breath without exhaling, and count silently to two hundred before exhaling through the mouth. Daily increase the count in this manner, and the body’s spirits will be complete while the five viscera are at peace. If one can hold the breath to two hundred fifty, the *huagai* (canopy) will brighten, the ears and eyes will grow sharp, the entire body will be free of illness, and evil will not invade.\n\n\"Treasure qi is also called refining qi, circulating qi, or long breathing. Its method: lie perfectly still, slowly rinse the mouth with *liquan* (sweet spring) and swallow it. While circulating qi, only exhale through the mouth and only inhale through the nose, gently contracting the nostrils to draw it in. Do not overfill, for excess makes it difficult to return. After five breaths, one may exhale. Count each breath to ninety; if possible, stretch frequently. After stretching, repeat the practice, completing four nines. Four nines make three hundred sixty breaths, constituting one full cycle. When swallowing, with each exhalation, pause to swallow once before inhaling through the nose again—otherwise, it may cause coughing.\n\n\"When qi is inhaled, it ascends; when exhaled, it descends, circulating throughout the body. In practicing qi circulation, on the first day of the month, visualize qi exiting through the ten fingertips, continuing until the sixteenth day. On the last day of the month, visualize qi exiting through the ten toes. With prolonged practice, one will naturally feel qi flowing through the hands and feet, enabling breath-holding without exhalation—thus attaining longevity. The spiritual tortoise lives a thousand years without eating because it does not stir its nasal breath.\n\n\"The *Great Clarity* method of circulating through the gates and doors is called *Heavenly Strength and Earthly Strength* in the *Nine Capitals Classic*. When qi flows through Heavenly and Earthly Strength, one can achieve lightness of body. The hands are the Gate of Heaven; the feet are the Door of Earth. The hands are Heavenly Strength; the feet are Earthly Strength.\n\n\"When practicing qi circulation, always do so with the hair bound tightly. During the living qi hour at dawn, lie perfectly still, clench the fists, keep the feet five inches apart, and hold the arms five inches from the body. Remove the pillow, breathe gently, and complete four nines—three hundred sixty breaths—until the body feels as limp as discarded clothing, with all joints relaxed. Initially, after three hundred sixty breaths, one will gradually sense clouds moving within the body, circulating throughout, moistening the form, irrigating the skin, and filling the five viscera and six bowels, gradually dispelling old illnesses.\n\n\"When first practicing qi circulation, first stabilize the body and harmonize the breath, avoiding conflict with intention. If not at ease, pause and resume only when harmonized, maintaining consistency without weariness. Little practice yields little benefit; great practice yields great benefit. When qi arrives, the body is at peace; when the body is at peace, nasal breathing becomes harmonious. When nasal breathing is harmonious, essence and qi arrive; when essence and qi arrive, the body naturally grows warm. When the body grows warm, slight sweating occurs—do not rise immediately but rest calmly, prolonging the state as much as possible.\n\n\"Eliminate anger, resentment, and sorrow. By doing so, qi remains unconfused, and true qi arrives. When true qi arrives, the mouth becomes sweet and fragrant, saliva increases, nasal breathing lengthens subtly, the five viscera are at peace, and qi harmonizes. Naturally, all illnesses depart, food tastes delicious, the three qi are regulated, the body feels light, and one attains longevity.\n\n\"In qi circulation, inhale through the nose and exhale through the mouth, gently drawing it in—this is called long breathing. There is one method of inhalation and six methods of exhalation. The one method of inhalation is *absorption*. The six methods of exhalation are *chui* (blowing), *hu* (exhaling), *xi* (sighing), *he* (expelling), *xu* (hissing), and *si* (whispering)—all are ways of expelling qi.\n\n\"Human breathing consists of one exhalation and one inhalation, without this count, it is long breathing. The method of exhaling qi: when cold, use *chui*; when warm, use *xi*. For treating illnesses, *chui* dispels heat, *xi* dispels wind, *he* dispels vexation, and for those with deficient lower qi, use more *xu* and *si*. Daoists practicing qi circulation should avoid *xu* and *si* abruptly, as they are taboos in long breathing. Both men and women can practice this method.\" (From the *Imitating Immortals Classic*)\n\n**Breath-Holding Method:**\nAlso inhale through the nose, then hold the breath internally for as long as possible before slightly exhaling through the mouth. Exhale gently, then inhale slightly through the nose again. Repeat this two or three times before fully exhaling, following the above methods of *chui*, *hu*, *xi*, and *he*. When holding the breath to one thousand five hundred, one should only inhale without exhaling—qi enters through the nose and flows to the hands and feet without exiting through the mouth. To release it through the mouth, exhale from there. Like flowing water, where the preceding current departs and the following current continues without reversal, the Dao of longevity culminates here.\n\n**Refining Qi Method:**\nLie perfectly still, slowly rinse the mouth with *liquan* and swallow it. Do not close the mouth while circulating qi—only exhale through the mouth and inhale through the nose, avoiding the entry of foul qi. Gently contract the nostrils, but do not overfill, for excess makes it difficult to return. After five breaths, one may exhale, but not to the extreme.\n\nBegin by counting from one to ten breaths, then bend the fingers to tally up to ninety breaths—one may stretch intermittently. At four nines, three hundred sixty breaths, envision within the brain a yellow qi, vast as an egg, and dwell upon it constantly. Should the mind grow weary, first perform two hundred ten breaths of \"refining qi to return qi,\" filling the liver; if the qi does not swell greatly, allow it to exit. Hold the breath for seventy breaths before swallowing, and if the breath feels insufficient, replenish it with another seventy breaths—do not force a sudden surge. The qi, once struck, should rise and flow outward, suffusing the four limbs, warming from above downward to the feet. Gradually regulate the qi to return to the stomach duct, then guide it through the throat and swallow, directing it downward past the navel—one, two, three, four—and back to the duct. For all refining qi methods, perform them externally, sitting at dawn and dusk.\n\nAs with the previous supine refining qi method, proceed to seventy breaths, four or five cycles. Initially, the qi may feel slightly unregulated, but with prolonged practice, it becomes effortless. When guiding qi back to the stomach, one will sense its arrival upon swallowing. Then coil it around the navel, counting one through nine, and cease—do not forcefully exhale or swallow. Instead, turn the qi downward, ensuring it does not rise. If the qi in the minor meridians ascends, guide it back down to strengthen the body’s true qi. After a slight exhale, inhale two or three times, and it will descend naturally.\n\nTo treat dizziness and deafness, guide qi to harmonize the five viscera—recovery should take no more than ten days. For \"yielding qi,\" perform three hundred sixty breaths in four nines while lying perfectly still, fists clenched. First harmonize the breath, hold saliva in the mouth without swallowing, and every nine breaths, shift position slightly, drawing the feet five inches apart. As the qi gently returns, the body should feel as supple as discarded clothing, the joints entirely loosened. After ninety breaths, cease, keeping one finger unclenched. Initially, warmth will arise; by three hundred sixty breaths, it will recur. By the third nine, focus the mind without allowing thoughts to scatter. To resume, sit upright—men on the left side, women on the right. Swallow once every seventy breaths. This is the method by which both men and women attain immortality through refining qi.\n\nThough holding and refining qi are essential for cultivating the body, one must first thoroughly grasp their principles. The space within should remain empty and unfilled. If qi becomes stagnant and fails to circulate, it may cause sores—like a spring’s source, it must not be dammed. Consuming raw vegetables or meat, or harboring joy, anger, sorrow, or worry while refining qi, may induce counterflow qi. Those who wish to practice this must proceed gradually.\n\nAnother method states: To regulate qi, face south at dawn, extend both hands upon the knees, and gently press the joints. Exhale turbid qi through the mouth and inhale pure qi through the nose—this is what is meant by \"expelling the old and absorbing the new.\" After each inhalation, hold the breath for a long moment, then exhale slowly. Use the hands to press upward, downward, forward, and backward. While drawing qi, visualize it entering through the pores, flowing into the five viscera and four limbs, nourishing them all—like mountains receiving clouds, like earth absorbing moisture. When the qi flows smoothly, one will feel a warm, rolling sensation in the abdomen. After achieving ten or more cycles, the body will become moist and radiant, the ears and eyes sharp, appetite and strength increase, and all illnesses vanish.\n\nThere is also an internal qi-regulation method similar to the above. With gradual practice up to a thousand breaths, even the aged will grow younger, reversing time day by day, until they naturally cease eating. The method of regulating qi has no fixed count—only that more is better. Generally, perform twenty-four cycles after midnight, eighteen at cockcrow, twelve at dawn, and twelve after noon. If one can practice more, adding thirty or forty cycles per session is also acceptable.\n\nThe *Scripture of Immortals* states: On days of heavy fog, rain, or wind, do not refine qi—simply remain still without regulating. Before regulating qi, first remove the hairs from the nostrils, for they are the path to communion with the spirits. To refine qi and cure illness, direct the mind to the afflicted area. For head ailments, focus on the head; for foot ailments, focus on the feet. Harmonize the qi to attack the illness, and from one hour to the next, it will dissipate. For seasonal colds, hold the breath to induce sweating, and when it covers the body, the illness will resolve.\n\n**Therapeutic Method:**\nFollow the seated qi-regulation posture. For sudden afflictions like chills, fever, or swelling, regulate qi on the same day—if not cured, recovery will come within one or two days. For cold illnesses of the heart, blow the qi out; for heat illnesses, exhale with *he*; for liver ailments, exhale with *xu*; for lung ailments, exhale with *yi*; for spleen ailments, exhale with *xi*; for kidney ailments, blow the qi out. Perform each thirty-six times, and always incorporate guiding and pulling exercises.\n\nFor heat illnesses, use a strong *chui* fifty times and a gentle *chui* ten times. For heart distress, use a strong *xu* thirty times and a gentle *xu* ten times. For liver ailments, use a strong *he* thirty times and a gentle *he* ten times. For heart ailments, use a strong *xu* thirty times and a gentle *xu* ten times. For kidney ailments, use a strong *yi* fifty times and a gentle *yi* thirteen times. With diligent practice, there is no illness that will not be cured.\n\nHow does one recognize the illnesses of the five viscera? If the body experiences alternating cold and heat, and one dreams of red-clad figures wielding red blades, it is an illness of the heart. If the chest and diaphragm feel distended and full, the limbs restless, and one dreams of beautiful women, family, or spouses, it is an illness of the lungs. If one feels sorrowful and joyless, with frequent head and eye pain, and dreams of green-clad figures, or those wielding green blades, or lions and wolves threatening, it is an illness of the liver. If the body feels wandering winds or itching, with oppression and pain, and one dreams of children striking the armpits or whirlwinds encircling them, it is an illness of the spleen.\n\nIf the body feels cold and the yin is deficient, or one dreams of black-clad figures wielding black blades to frighten them, it is an illness of the kidneys. Extrapolating from this, none will fail to be accurate.\n\nMaster Le’s Qi-Regulating Method is largely similar to the previous method. It states: within a quiet chamber, arrange a pillow of proper height, level with the body. Extend the hands three or four inches from the body, and space the feet likewise. First, one must contemplate: the Dharma-nature is equanimous; life and death are not delusive. Bind the hun and restrain the po. Strike the Heavenly Drum thirty-two times, rinse the Jade Spring three to five swallows, and draw breath through the nose into the abdomen, counting the breaths—more is better—without letting the ears hear the sound of the incoming breath. When first drawing breath, if one can manage only twenty or thirty breaths before feeling stifled, hold the breath without letting it escape through the nose, then gently release it through the mouth, exhaling just enough to feel the body grow warm and a slight sweat appear—this is the sign that the qi is circulating. For qi-ingestion, at night, one may complete the practice between the hours of *zi* and *chou*; during the day, between *si* and *wu*. After ingesting qi, kneel firmly and use the qi to draw up the intestines, then expel it downward, repeating this thirty to fifty times—this is called \"qi-refinement.\" All illnesses in the abdomen and the four limbs will thus be cured.\n\nThe number of breaths to be taken is set forth below. For qi-ingestion, first draw the black qi of the north, called the \"Mysterious Sprout.\" Contemplate the Seven Stars of the Northern Dipper and their victorious affairs, continuing until settled—whether five, fifty, or five hundred breaths—to supplement the kidneys, then transmit the qi to the liver, for the Water viscus of the north governs the kidneys. Next, draw the green qi of the east, the \"Azure Sprout.\" Contemplate the Seven Stars of the Eastern Dipper and their victorious affairs to supplement the liver—whether nine, ninety, or nine hundred breaths—then transmit the qi to the heart, for the Wood viscus of the east governs the liver. Next, draw the cinnabar qi of the south, the \"Vermilion Sprout.\" Contemplate the Seven Stars of the Southern Dipper and their victorious affairs—whether three, thirty, or three hundred breaths—to supplement the heart, then transmit the qi to the spleen, for the Fire viscus of the south governs the heart. Next, draw the yellow qi of the central palace, the \"Yellow Sprout.\" Contemplate the Seven Stars of the Central Dipper and their victorious affairs—whether one, ten, or one hundred breaths—to supplement the spleen, then transmit the qi to the lungs, for the Earth viscus of the center governs the spleen. Finally, draw the white qi of the west, the \"Pristine Sprout.\" Contemplate the Seven Stars of the Western Dipper and their victorious affairs—whether seven, seventy, or seven hundred breaths—to supplement the lungs, then transmit the qi to the kidneys, for the Metal viscus of the west governs the lungs.\n\nThere is also a method of exhaling qi to cure all illnesses, which complements qi-ingestion. If the qi becomes full and does not circulate, one may exhale it. The method of exhalation is as follows: *he* (1), *hu* (2), *xu* (3), *xi* (4), *yan* (5), *chui* (6). Exhaling with *he* expels the qi of the lungs, for Metal governs Venus, and the lungs, being Metal, do not receive guest qi. The guest is Fire; when the guest is strong, it harms the host, so one expels it with *he*. Exhaling with *chui* expels the qi of the heart, for Fire governs Mars, and the heart, being Fire, does not receive guest qi. The guest is Water; when the guest is strong, it harms the host, so one expels it with *chui*. Exhaling with *yan* expels the qi of the liver, for Wood governs Jupiter, and the liver, being Wood, does not receive guest qi. The guest is Metal; when the guest is strong, it harms the host, so one expels it with *yan*. Exhaling with *xu* expels the qi of the spleen, for Earth governs Saturn, and the spleen, being Earth, does not receive guest qi. The guest is Wood; when the guest is strong, it harms the host, so one expels it with *xu*. Exhaling with *hu* expels the qi of the kidneys, for Water governs Mercury, and the kidneys, being Water, do not receive guest qi. The guest is Earth; when the guest is strong, it harms the host, so one expels it with *hu*. Exhaling with *xi* expels the qi of the bladder. The Triple Burner is the palace of water and grain; when injured by cold, it causes dysentery, and when injured by heat, it causes oppression. Oppression leads to illness in the small intestine, while dysentery leads to illness in the large intestine. Exhaling with *xi* restores harmony.\n\nThe liver stores the *hun*, the lungs store the *po*, the spleen stores the will, the heart stores the spirit, and the kidneys store the essence. If the six bowels are disharmonious, the five viscera are harmed by guest qi. The gallbladder is the first, the large intestine the second, the small intestine the third, and the Triple Burner, though formless, is counted as the sixth bowel. If the six bowels are disharmonious, the five viscera do not communicate; if the five viscera do not communicate, the five qi are not transmitted, and both the five and six become diseased. If one can dissolve and settle them, one may remain free of illness.\n\n**Embryonic Breathing and Embryonic Nourishment Method**\nOne must constantly quiet the heart, dispel thoughts, and make the breath subtle. Breathe through the nose, not the mouth, so that the qi is always stored—this is called \"embryonic breathing.\" Rinse the spring beneath the tongue and swallow it, continuing for several tens of breaths without interruption—this is called \"embryonic nourishment.\" By practicing these two without ceasing, one may avoid hunger and illness.\n\n**Ingesting the Essence of the Sun and Moon**\nAt sunrise, noon, and sunset, stand facing the sun, extend both hands, and hold the breath nine times. Tilt the head back, draw in the sunlight, and swallow it nine times to replenish essence and qi, making one strong and preventing the decline of the six and eight (i.e., aging). At moonrise, midnight, and moonset, stand facing the moon, extend both hands, and hold the breath nine times. Tilt the head back, draw in the moonlight, and swallow it to strengthen the yin qi. Women who do this will conceive.\n\n**Dwelling and Abiding**\n\n**Methods of Regulating and Nurturing**\n\nThe art of regulating and nurturing begins with adapting to the water and soil of one’s environment, which must be a high and dry place. As the *Zuo Zhuan* states: *\"Where the soil is thick and the water deep, dwelling there brings no illness.\"* Low and damp places, however, are certain to harm one’s health. This is evident in the fact that southerners often die young, while northerners tend to live long. As the *Huainanzi* observes: *\"Firm soil breeds resolute people; weak soil breeds plump people. Clay soil breeds large people; sandy soil breeds delicate people. Fertile soil breeds beautiful people; barren soil breeds ugly people. Mountainous qi yields many sons; marsh qi yields many daughters. Water qi yields many sores; wind qi yields many deaf. Forest qi yields many malarial fevers; wood qi yields many retchings. Damp qi yields many convulsions; stone qi yields great strength. Yin qi yields many thin people; summer heat yields many early deaths; cold qi yields long life. Valley qi yields many numbnesses; hill qi yields many madmen. Vast qi yields many benevolent people; mound qi yields many greedy people. Light soil yields agile people; heavy soil yields slow people. Clear water yields soft voices; turbid water yields loud voices. Rapid water yields light people; sluggish water yields heavy people. Central soil yields many sages.\"* Since all people are shaped by the water and soil of their land, determining good or ill fortune, how can one fail to choose one’s dwelling with care?\n\nIn ancient times, people lived in nests or caves and enjoyed long lives—why? Was it not because nest-dwellers were elevated and cave-dwellers secluded, shielding them from the winds of their abodes? Since the advent of raised beams and tiled roofs, however, nest- and cave-dwellers have suffered myriad illnesses, meeting early deaths and shortening their lifespans. Modern dwellings must not be excessively tall, spacious, or drafty, for not only are wind and mist difficult to guard against, but such spaces also scatter the spirit. As the *Master Lü’s Spring and Autumn Annals* warns: *\"High terraces breed excess yang; large chambers breed atrophy; excess yang breeds collapse.\"* Moreover, the admonition against extravagant houses should not be taken lightly.\n\nThe ancients chose dwellings solely for their enclosed walls and secluded courtyards, ensuring that even the faintest breeze could not penetrate. In this way, illnesses naturally did not arise. If one senses a draft, one must avoid it. Even the slightest crevice can cause grave harm—since ancient times, sudden wind-strokes, paralysis, arched-back convulsions, and loss of speech have all stemmed from neglecting this. Once the body is struck by wind, a host of ailments gather, and malevolent spirits seize the opportunity, leading to untimely death. There was once an innkeeper in Luoyang whose pillar had a hole the size of a coin; neither he nor his successors noticed it, and all died of the same affliction—proof of this principle.\n\nOne’s dwelling must be kept clean and orderly. Burning incense morning and evening ensures that one does not inhale foul qi but instead enjoys harmonious qi. Those who cultivate life should also keep mirrors aligned with the sun and moon, along with stone essence, a golden-light sword, raw rhinoceros horn, musk, realgar, cinnabar, and other protective talismans—greatly auspicious.\n\nThe *Scripture of the Immortals* further advises: Place a large basin of clear water at the entrance, lay a broadsword across it with the blade facing outward, and hang a bright mirror above. Inscribe a demon-subduing talisman beside the mirror, and no evil will dare approach; if they do, their blood will appear in the water. Alternatively, simply hang a nine-inch mirror of fine quality behind you, and no demonic entity will dare reveal its form.\n\n**Ding Gong’s Demon-Slaying Pill (Formula Bestowed by an Immortal)**\n- Tiger bone\n- Cinnabar\n- True pearl\n- Realgar\n- Orpiment\n- Azurite\n- Female green (a mineral)\n- Ghost’s umbrella (a plant)\n- Gleditsia fruit\n- Platycodon root\n- Peony root\n- Angelica root\n- Atractylodes\n- Lindera root\n- Ghost’s arrow (a plant)\n- Ghost’s overseer (a plant)\n- Flowering reed\n- Sweet flag\n\nGrind each of the eighteen ingredients into powder (two parts each), mix with honey, and form into pills the size of a bullet. Carry one: men on the left, women on the right. No evil will dare approach, dreams will be undisturbed, and the hun and po souls will remain at peace.\n\nFor all matters of dwelling, movement, or illness avoidance, there are auspicious locations—gentlemen who nurture life should employ them. The most significant are the virtues of the year, month, day, and hour.\n\n**Method for Determining the Year’s Virtue**\nIn a *jia* year, virtue resides in *jia*; in a *yi* year, in *geng*. In a *bing* year, virtue resides in *bing*; in a *ding* year, in *ren*. In a *wu* year, virtue resides in *wu*; in a *ji* year, in *jia*. In a *geng* year, virtue resides in *geng*; in a *xin* year, in *bing*. In a *ren* year, virtue resides in *ren*; in a *gui* year, in *wu*.\n\n**Method for Determining the Month’s Virtue**\nIn the first month, virtue is in *ding*; in the second, in *kun*; in the third, in *ren*; in the fourth, in *xin*; in the fifth, in *qian*; in the sixth, in *jia*; in the seventh, in *gui*; in the eighth, in *gen*; in the ninth, in *bing*; in the tenth, in *yi*; in the eleventh, in *xun*; in the twelfth, in *geng*.\n\n**Method for Determining the Day’s Virtue**\nThis follows the year’s virtue: on a *jia* day, virtue resides in *jia*; on a *yi* day, in *geng*, and so on.\n\n**Method for Determining the Hour’s Virtue**\nThis follows the month’s virtue: in the *yin* hour, virtue is in *ding*; in the *mao* hour, in *kun*, and so forth.\n\nThere is also the **Method of Calculating the Wandering Year**:\nBegin with *li* (9), but *qian* (6) does not accept 8, so proceed to *li* (9), then to *dui* (10), *kan* (20), *zhen* (30), *li* (40). *Kun* (2) does not accept 1, so return to *li* (9), then to *dui* (50), continuing in this manner up to 120 years.\n\nWherever the Wandering Year arrives:\n- The first change brings misfortune.\n- A complete change brings the Five Ghosts.\n- A second change brings the Cut-off Life.\n- A complete change of Cut-off Life brings the Six Harms.\n- A third change brings Generative Qi.\n- A complete change of Generative Qi brings the Heavenly Physician’s Return.\n- A complete change of the Wandering Year brings Blessed Virtue.\n\nFor dwelling or relocation, prioritize Generative Qi and Blessed Virtue. To avoid illness, also seek the Heavenly Physician, while considering the correspondences of the myriad things for auspiciousness. Avoid Cut-off Life, Misfortune, the Five Ghosts, and the Six Harms at all costs.\n\nAnother saying holds: *\"Men should avoid Misfortune; women should avoid Cut-off Life.\"*\n\nIf a dwelling has fire, construction, or disturbances in the locations of the Grand Year, Grand Yin, Great General, Monthly Punishment, or Monthly Killing, dig a pit five feet square at the Heavenly Granary, place a thousand catties of stone inside, stack a thousand tiles atop them, and seal with mud—greatly auspicious.\n\nFor yang dwellings, the Heavenly Granary is at *ding*; remedy it on *bing* or *xin* days in the first month. For yin dwellings, the Heavenly Granary is at *gui*; remedy it on *ding* or *ren* days in the seventh month.\n\nIf afflicted in the south, bury one black stone weighing eleven catties and one *dou* of black soybeans beneath the southern wall—disasters will not arise, greatly auspicious. If afflicted in the east, bury one white stone weighing ten catties and one *dou* of white rice beneath the eastern wall—disasters will vanish, greatly auspicious. If afflicted in the west, bury one red stone weighing twelve catties and one *dou* of red adzuki beans beneath the western wall—calamities will not arise, securing great auspiciousness. If afflicted in the north, bury one yellow stone weighing ten catties, five *liang* of realgar, and one *dou* of millet beneath the northern wall—greatly auspicious. If afflicted within the central palace of the dwelling, bury one green stone weighing thirteen catties and one *dou* of green rice in the central courtyard—greatly auspicious.\n\nIf the dwelling suffers frequent epidemics, bury one hundred and twenty catties of stone in front of the hall, one *zhang* and six *chi* from the door—auspicious. If the dwelling is haunted by ghosts, bury eighty catties of stone in the *ren* sector—auspicious. If excavation risks depleting the earth’s qi and harming people, bury one hundred and ten catties of stone at each of the four corners—greatly auspicious. If the dwelling suffers frequent illnesses, bury one hundred catties of stone in the *mao* sector—greatly auspicious. Additionally, bury ninety catties of yellow stone beneath the horse post to benefit horses—greatly auspicious. Bury fifty catties of green stone within the cattle pen to benefit oxen—auspicious.\n\nIn late summer, bury ninety catties of yellow stone in the courtyard—auspicious. On the day of *Lichun*, bury thirty catties of green stone beneath the eastern wall; on the day of *Lixia*, bury twenty catties of red stone beneath the southern wall; on the day of *Liqiu*, bury forty catties of white stone beneath the western wall; on the day of *Lidong*, bury one hundred catties of black stone beneath the northern wall—all securing great auspiciousness.\n\nFor all stone burials, use the day of Monthly Virtue corresponding to the direction. The stones must be whole, buried three *chi* deep, and the site anointed with wine and dried meat as an offering. The master of the house should personally recite a prayer.\n\n**Method of Burying Sand**\nIf the Grand Year resides in *yin*, *wu*, or *xu*, the Harmful Qi is in *hai*; if in *si*, *you*, or *chou*, the Harmful Qi is in *yin*; if in *hai*, *mao*, or *wei*, the Harmful Qi is in *shen*; if in *shen*, *zi*, or *chen*, the Harmful Qi is in *si*. At the location of Harmful Qi, dig a pit three *chi* square and deep, place three *dou* of fine sand from an east-flowing stream into the pit, pour three *dou* of pure wine over it, then cover with earth. All household members, young and old, should tread upon it, tamping it down with a pestle—fourteen strokes each. The Harmful Qi will dissipate, and the household will be free from disasters and illnesses. This method may also be applied to cities, provinces, and temples, preferably on the *wu* day of the first month—greatly auspicious.\n\n**Affliction by Earth Causing Illness**\nSuch illness often manifests as bodily heaviness and aching limbs. At dawn on an empty stomach, burn chaff to produce smoke, fumigate the nose and mouth, and inhale a small amount—recovery will follow within three attempts.\n\n**Lao Jun’s Method for River Bend Father to Thank Heaven and Earth**\nRegularly, on *chen* or *si* days at dusk during clear weather, sweep the *jia*, *wu*, *bing*, and *ren* sectors of the dwelling. Burn incense facing north, bow three times, and remain silent, reciting inwardly: *\"Your descendant [Name] has repeatedly failed the Yellow Heaven and urgently seeks the governance of the Supreme Emperor. May all transgressions committed by every member of this household, past and present, be dissolved in advance, and may goodness be cultivated henceforth. Grant peace to the body-spirits of all in this household.\"*\n\nPracticing this Dao regularly brings great fortune.\n\n**Method to Ward Off Thieves and Bandits**\nTake earth from a market gate and soil from the Destructive Month of the Grand Year’s Establishment, mold them into a figurine, and place it in the Vermilion Bird sector—greatly auspicious.\n\n**Miscellaneous Methods for Dwellings to Ward Off Evil**\nOn *Lichun*, apply soil from a wealthy household’s field to the threshold—greatly auspicious and prosperous. On *liuding* days, sweep the house; regular maintenance brings great auspiciousness. On the *shangsi* day of the first month, apply soil from the center of a wealthy household’s gate to the threshold—also greatly auspicious. On the *ren* day of the second month, mix roadside soil with well water drawn at dawn and apply it to the threshold—also greatly auspicious.\n\nOn Establishment days, hang a broken cart yoke above the door to avert slander. Bury deer antlers within the gate, in the latrine, or elsewhere to attract wealth. Bury ox hooves at the four corners of the dwelling—also greatly auspicious. On *Lichun*, apply a two-*cun* square of soil outside the dwelling’s forest to avert disasters. On a Full Moon day, brew wine with water from three households—great wealth will follow. On a *dinghai* day, scoop rice with the left hand and cast it into the threshold—all wishes will be granted, greatly auspicious.\n\nOn the Establishment day of the first month, place peach-wood axe handles and old cart wheels inside the door, and peach wood outside the door—ghosts will never return. At night, pull a single stalk of straw from the bedding, leaving three *cun* exposed—ghosts and demons will not approach.\n\n**Taboos**\nBurying worn shoes in the courtyard brings official rank and nobility to descendants—greatly auspicious. Do not place foul or filthy things in the auspicious sector of the dwelling’s surname. The northwest corner is the Heavenly Gate; do not defile it with excrement or filth, nor install wells or latrines there. Keep it immaculate—greatly auspicious. Do not fell the largest tree in the dwelling; if it dies naturally, remove it.\n\nDo not plant peach trees in the southwest or near wells—peach blossoms falling into wells are inauspicious. Do not plant mulberry or peach trees in the center of the dwelling, nor plant *momu* trees. Do not use winnowing baskets to hold excrement. Do not discard broken utensils into latrines. Do not block wells or roads. Do not kindle fire and carry it through the gate—all are inauspicious.\n\nWhen constructing a house, do not join wood to make pillars, nor use naturally fallen wood as pillars—both are inauspicious.\n\n*The Dragon Head Classic* states: In spring, do not fell wood in the east on *jia* or *yi* days; in summer, do not produce lime or charcoal on *bing* or *ding* days; in late summer, do not undertake construction or excavation on *wu* or *ji* days; in autumn, do not cast or inscribe on *geng* or *xin* days; in winter, do not dig ditches or canals on *ren* or *gui* days. Violating these brings misfortune to the household’s elders—greatly inauspicious.\n\nSpring and summer belong to yang; do not carry out executions or punishments. Autumn and winter belong to yin; do not undertake excavation. Violating these brings misfortune upon oneself.\n\nThe School of Yin-Yang further states: Money from selling a house must not be used to purchase livestock; money from selling donkeys or horses must not be used to take a wife—both are greatly inauspicious and bring harm. Moreover, do not ride a horse with a *dilu* marking. Do not raise a yellow horse with white hind legs, nor a dog with a yellow chest and black ears. Do not raise a black calf born to a yellow horse or cow. For all construction, repairs, or undertakings, one must select an auspicious time and day. Following the *Six Ren Yellow and Black Dao Chart* is most effective:\n\n- In *yin-shen* and *yi-xin* years: *yi* and *xin* are Yellow; *ding* and *gui* are Yellow.\n- In *mao-you* years: *qian* and *xun* are Yellow; *kun* and *gen* are Yellow.\n- In *chen-xu* years: *bing* and *ren* are Yellow; *jia* and *geng* are Yellow.\n- In *si-hai* years: *ding* and *gui* are Yellow; *yi* and *xin* are Yellow.\n- In *zi-wu* years: *kun* and *gen* are Yellow; *qian* and *xun* are Yellow.\n- In *chou-wei* years: *jia* and *geng* are Yellow; *bing* and *ren* are Yellow.\n\nThese are the Yellow Dao of the year. For construction, following these directions ensures great auspiciousness; all other directions are inauspicious. For long journeys, relocation, marriage, childbirth, or medical treatment for the sick, these directions are also auspicious.\n\nThe method of the Monthly Yellow Dao is most reliable and is applied according to the solar terms:\n\n- In the first and seventh months: *chou*, *chen*, *si*, and *wei* are Yellow Dao; all others are Black Dao.\n- In the second and eighth months: *mao*, *wu*, *wei*, and *you* are Yellow Dao; all others are Black Dao.\n- In the third and ninth months: *si*, *shen*, *you*, and *hai* are Yellow Dao; all others are Black Dao.\n- In the fourth and tenth months: *wei*, *xu*, *hai*, and *chou* are Yellow Dao; all others are Black Dao.\n- In the fifth and eleventh months: *you*, *zi*, *chou*, and *mao* are Yellow Dao; all others are Black Dao.\n- In the sixth and twelfth months: *hai*, *yin*, *mao*, and *si* are Yellow Dao; all others are Black Dao.\n\nFor construction, renovation, relocation, travel, marriage, official appointments, childbirth, or seeking medical treatment, acting on Yellow Dao days brings great auspiciousness, while Black Dao days bring great misfortune. Even on Yellow Dao days, if the *General*, *Grand Year*, *Punishment*, *Calamity*, or *Earth Duke* resides in the direction, one should avoid it.\n\nOne account states: If the Yellow Dao has no taboos, it is entirely auspicious. Another states: For all undertakings, if one acts on a *Heavenly Amnesty Day*, when the five hundred earthly spirits ascend to heaven, the day is free of taboos. If one further aligns with the *Virtue* of the year, month, day, and hour, as well as the Yellow Dao of the year and month, one will receive great blessings. If unable to fulfill all conditions, even one or two auspicious factors will suffice. If one violates the Black Dao of the year or month or incurs other offenses that have not yet manifested, one must remedy the transgression at the site of the violation. Offenses involving five *gong* or fewer are minor; those exceeding five *gong* are major. On a Yellow Dao day or a day of *Virtue* for the year or month, dig soil from the central courtyard to a depth of one *chi* or more, taking five *sheng* of soil from each location. Sift the soil finely, then mix it with five *sheng* of wine, one *liang* each of *xunlu*, white sandalwood, *lingling* fragrance, *qingmu*, and *chenxiang* (all finely chopped). Boil the mixture in water (no fixed amount), then blend it with the wine and soil to form a paste like a pancake. Using a new broom, sweep this paste onto the walls and beams of the Yellow Dao and *Virtue* locations for the year and month, as well as the main hall and rooms. For major offenses, sweep from two *zhang* down to one *zhang*; for minor offenses, from three *chi* up to one *zhang*. Adjust according to height; if sweeping a wall, cover its full height. Only family members—children or the household head—should perform the sweeping. On this day, avoid loud voices and anger.\n\nFor yang residences, the husband sweeps the exterior; for yin residences, the wife sweeps the interior. Both must wear new clothes. If yin and yang are unclear, sweep both inside and outside. After sweeping, also sweep the *ao* (threshold). When mixing the paste, take care not to kill any insects. This method is profoundly efficacious, and its subtleties cannot be fully explained—gentlemen must not treat it lightly.\n\nWhen first entering a new residence or official quarters, avoid mourning, visiting the sick, speaking of ill fortune, climbing heights or gazing into depths, peering into wells or latrines, indulging in sorrow or anger, or witnessing punishments or construction—all are inauspicious.\n\nWhen assuming office, one must also select an auspicious day. For the day of appointment:\n- In spring: *yin*, *mao*, *si*, and *xu* are auspicious.\n- In summer: *si*, *wu*, *shen*, and *chou* are auspicious.\n- In autumn: *shen*, *you*, *hai*, and *chen* are auspicious.\n- In winter: *hai*, *zi*, *yin*, and *wei* are auspicious.\n\nDays such as *Jian*, *Man*, *Ping*, *Ding*, and *Cheng* are also auspicious. When appointing an official, avoid clashing days: if appointed on a *jia* or *yi* day, do not assume office on a *geng* or *xin* day; if appointed on a *geng* or *xin* day, do not assume office on a *bing* or *ding* day; if appointed on a *bing* or *ding* day, do not assume office on a *ren* or *gui* day; if appointed on a *ren* or *gui* day, do not assume office on a *wu* or *ji* day; if appointed on a *wu* or *ji* day, do not assume office on a *jia* or *yi* day.\n\nAnother method: In spring, avoid *geng* and *xin* days\n\nThe third, ninth, fifteenth, and thirtieth days of the month are *Cai Men* (Wealth Gate) days, auspicious for assuming office, marriage, and all undertakings. The sixteenth, twenty-second, twenty-fifth, and tenth days are *Yang Men* (Yang Gate) days, auspicious for all activities. The seventeenth, twenty-first, and twenty-sixth days are *Guan Men* (Official Gate) days, auspicious for assuming office and all undertakings. The twelfth, eighteenth, twenty-fourth, and twenty-seventh days are *Hou Men* (Waiting Gate) days, during which travel may invite disputes and misfortune. All days of mourning are inauspicious.\n\nOn *zi* days: traveling south is highly inauspicious; traveling north brings minor fortune; traveling east yields wealth; traveling west brings joy.\nOn *chou* days: traveling south brings gains; traveling north brings minor fortune; traveling east is highly auspicious; traveling west fails.\nOn *yin* days: traveling south is highly auspicious; traveling north brings minor fortune; traveling east leads to delays; traveling west is highly auspicious.\nOn *mao* days: traveling south brings gains; traveling north is highly auspicious; traveling east invites reprimands and delays; traveling west is highly auspicious.\nOn *chen* days: traveling south brings feasts; traveling north invites reprimands and delays; traveling east is highly auspicious; traveling west is inauspicious.\nOn *si* days: traveling south is moderately auspicious; traveling north yields wealth; traveling east encounters misfortune; traveling west brings minor fortune.\nOn *wei* days: traveling south encounters officials; traveling north is inauspicious; traveling east is auspicious; traveling west fails.\nOn *shen* and *you* days: traveling south is inauspicious; traveling north is auspicious; traveling east is highly auspicious; traveling west is highly auspicious.\nOn *xu* days: traveling south yields wealth; traveling north fails; traveling east is inauspicious; traveling west is inauspicious.\nOn *hai* days: traveling south yields wealth; traveling north fails; traveling east brings minor fortune; traveling west is highly inauspicious.\n\nThough travel days are determined by this chart, one should also consult the annual almanac. Days of *Jian* (Establishing), *Man* (Full), *Ping* (Level), *Ding* (Stable), and *Kai* (Opening) are especially auspicious. During the hours of *chou*, *yin*, *mao*, *chen*, *si*, *wu*, *wei*, and *shen*, traveling south is highly auspicious. During the hours of *chou*, *yin*, *mao*, *si*, *wei*, *shen*, *you*, and *hai*, traveling north is highly auspicious. During the hours of *zi*, *chou*, *mao*, *wu*, *wei*, and *xu*, traveling west is highly auspicious and yields wealth. During the hours of *zi*, *chou*, *yin*, *wu*, and *wei*, traveling east is auspicious. All travel days and hours should be carefully considered.\n\nAnother method for warding off directional taboos:\nFor those traveling east: carry nine coins, walk nine *li*, then discard them and depart.\nFor those traveling south: carry a vessel of water, walk six *li*, then discard it and depart.\nFor those traveling west: carry seven *jin* of charcoal, walk seven *li*, then discard it and depart.\nFor those traveling north: carry five *jin* of earth, walk five *li*, then discard it and depart.\nThis ensures great fortune and the fulfillment of all wishes.\n\nIt is also said: Before traveling, take a handful of rice in the left hand and cast it into a well—this brings great fortune.\nAdditionally: The *Wu Li* (Five Separations) days are inauspicious for long journeys.\n\nIf, while traveling, one encounters strong winds, fog, thunder, or lightning, it is the passage of dragon spirits. One should enter a dwelling to avoid them; failure to do so may result in prolonged illness. Traveling at dawn through mountains, waters, or wind and dew is highly harmful. Drinking wine and wearing realgar (*xiong huang*) is advisable.\n\nThe scripture states: Those embarking on long journeys should recite the following incantation:\n*\"The Six Jia of the Nine Chapters, heaven is round and earth is square.\nThe four seasons and five phases, the sun and moon give light.\nYu ordered the roads, Chi You warded off weapons.\nThe Azure Dragon guards, the White Tiger accompanies.\nMars leads the way, dispelling misfortune.\nThe Northern Dipper executes punishment, removing calamities.\nFive spirits follow me, roaming the four directions.\nLeft, the gods of soil; right, the gods of grain—bandits and thieves are suppressed.\nTravelers rejoice, users gain fortune.\nThe five phases obey me, all wishes are fulfilled.\nSwiftly, swiftly, as in law and decree!\"*\n\nRecite this incantation three times, then spit water toward the direction of travel—this brings great fortune.\n\nWhen traveling, avoid entering temples. If one must enter, do so with reverence, refraining from casual observation, as if facing a stern lord—this ensures blessings. When passing through a place of mourning, riding a white horse followed by a bearded servant brings great fortune. If one encounters a beautiful woman on the road, avoid gazing at her, for she may be a ghostly apparition.\n\nThe Sixty *Jiazi*:\n*Jiazi*, Wang Wenqing, accompanied by eighteen officials...\n\n**Yichou**, Long Jiqing, accompanied by sixteen officials—Metal.\n**Bingyin**, Zhang Zhongqing, accompanied by fourteen officials.\n**Dingmao**, Sima Qing, accompanied by twelve officials—Fire.\n**Wuchen**, Ji Chuqing, accompanied by eighteen officials.\n**Jisi**, He Wenchang, accompanied by twelve officials—Wood.\n**Gengwu**, Feng Zhongqing, accompanied by seventeen officials.\n**Xinwei**, Wang Wenzhang, accompanied by fifteen officials—Earth.\n**Renshen**, Hou Boqing, accompanied by thirteen officials.\n**Guiyou**, Sun Zhongfang, accompanied by eleven officials—Metal.\n** Jiaxu**, Zhan Zijiang, accompanied by fourteen officials.\n**Yihai**, Pang Minggong, accompanied by twelve officials—Fire.\n**Bingzi**, Xing Sunqing, accompanied by sixteen officials.\n**Dingchou**, Zhao Ziyu, accompanied by fourteen officials—Water.\n**Wuyin**, Yu Ziqing, accompanied by twelve officials.\n**Jimao**, Shi Wenyang, accompanied by fifteen officials—Earth.\n**Gengchen**, Yin Jiaqing, accompanied by twelve officials.\n**Xinsi**, Yang Zhonggong, accompanied by eleven officials—Metal.\n**Renwu**, Ma Ziming, accompanied by twelve officials.\n**Guiwei**, Lü Weiming, accompanied by twelve officials—Wood.\n**Jiashen**, Hu Wenchang, accompanied by sixteen officials.\n**Yiyou**, Kong Ligong, accompanied by fourteen officials—Water.\n**Bingxu**, Che Yuansheng, accompanied by twelve officials.\n**Dinghai**, Zhang Wentong, accompanied by ten officials—Earth.\n**Wuzi**, Yue Shiyang, accompanied by ten officials.\n**Jichou**, Fan Heqing, accompanied by fourteen officials—Fire.\n**Gengyin**, Chu Jinqing, accompanied by fifteen officials.\n**Xinmao**, Guo Ziliang, accompanied by thirteen officials—Wood.\n**Renchen**, Wu Zhiqing, accompanied by eleven officials.\n**Guisi**, Shi Gonglai, accompanied by nine officials—Water.\n**Jiawu**, Wei Shangqing, accompanied by eighteen officials.\n**Yiwei**, Du Zhongyang, accompanied by sixteen officials—Metal.\n**Bingshen**, Zhu Bozhong, accompanied by fourteen officials.\n**Dingyou**, Zang Wengong, accompanied by twelve officials—Fire.\n**Wuxu**, Fan Shaoqing, accompanied by ten officials.\n**Jihai**, Deng Duqing, accompanied by twelve officials—Wood.\n**Gengzi**, Yang Zhongshu, accompanied by seventeen officials.\n**Xinchou**, Lin Weigong, accompanied by fifteen officials—Earth.\n**Renyin**, Qiu Mengqing, accompanied by thirteen officials.\n**Guimao**, Su Tajia, accompanied by eleven officials—Metal.\n**Jiachen**, Meng Feiqing, accompanied by fourteen officials.\n**Yisi**, Tang Wenqing, accompanied by twelve officials—Fire.\n**Bingwu**, Wei Wengong, accompanied by sixteen officials.\n**Dingwei**, Shi Shutong, accompanied by fourteen officials—Water.\n**Wushen**, Fan Boyang, accompanied by twelve officials.\n**Jiyou**, Cheng Wenchang, accompanied by fifteen officials—Earth.\n**Gengxu**, Shi Ziren, accompanied by thirteen officials.\n**Xinhai**, Zuo Zixing, accompanied by eleven officials—Metal.\n**Renzi**, Su Shangqing, accompanied by fifteen officials.\n**Guichou**, Jiang Hanqing, accompanied by one official—Wood.\n**Jiayin**, Ming Wenzhang, accompanied by sixteen officials.\n**Yimao**, Dai Gongyang, accompanied by fourteen officials—Water.\n**Bingchen**, Huo Shuying, accompanied by twelve officials.\n**Dingsi**, Cui Juqing, accompanied by nine officials—Earth.\n**Wuwu**, Cong Yuanguang, accompanied by fourteen officials.\n**Jiwei**, Shi Tongqing, accompanied by seventeen officials—Fire.\n**Gengshen**, Hua Wenyang, accompanied by fifteen officials.\n**Xinyou**, You Yuanyu, accompanied by twelve officials—Wood.\n**Renxu**, Yue Jinqing, accompanied by two officials.\n**Guihai**, Zuo Shisong, accompanied by nine officials—Water.\n\nWhen traveling to foreign lands, ascending mountains, or crossing waters, one must fear the harm of tigers and wolves and dread the scourge of miasmic pestilence. Whether paying respects to lords and nobles or facing bandits in battle, one should invoke the names of the gods corresponding to each day and keep them close for self-protection—thus, all evils will submit, and every journey will be greatly auspicious. If one encounters misfortune in a given year, one should clench the teeth and call upon the spirit of the year’s own celestial stem-branch and the god of the present day, invoking them throughout the year. All calamities will depart, and by maintaining this practice without cease, one will surely attain longevity.\n\nThose who follow this Way must, on the appointed day, refrain from eating the flesh of the creature governed by that day—this brings great fortune.\n\nTo ward off weapons, one need only know the names of the Northern Dipper and the characters of the sun and moon, and one will fear no blade. Merely reciting the names of the Five Weapons will also yield divine efficacy. The sword is called *Great Chamber*, governed by the Void Star; the bow, *Curved Bow*, governed by the Earth Star; the arrow, *Fleeting Panic*, governed by the Sparkling Deluder Star; the spear, *Piercing Wound*, governed by the Horn Star; the crossbow, *Distant Gaze*, governed by the Spread Star; the halberd, *Great General*, governed by the Three Stars. Whispering these invocations before battle brings manifest results.\n\nAlternatively, during a lunar eclipse, one may inscribe the blade with the eight characters found beneath the three-year-old toad’s tongue, using its blood—this is highly effective. Or, in the heat of combat, one may tread upon the *Kui* and *Gang* stars while calling upon the Lords of the Four Directions—this, too, proves efficacious.\n\nAnother method: On the fifth day of the fifth month, inscribe the *Red Spirit Talisman* and several dozen *Queen Mother of the West’s Military Dispatch Talismans*—all are ways to repel weapons.\n\nMountains, regardless of height, are inhabited by spirits. To ascend them, one must choose an auspicious time and day, hanging five-inch squares of five-colored silk from a large stone—thus, all requests will be granted. To ward off tigers, wolves, and mountain spirits, carry the *Yellow Spirit Chapter* and *Jade Spirit Talisman*, or burn ox and sheep horns. To repel vipers and serpents, wear centipedes and musk, or carry at least three *liang* of Wudu realgar—then they will not dare approach. Reciting *Yi Kang’s* verse *\"Entering the mountains, I meet no tiger\"* in one’s heart, or *Yi Fang’s* *\"Entering the marshes, I meet no snake,\"* and burning ox or sheep horns while traveling will keep tigers and wolves at bay—greatly auspicious.\n\nAnother method: Before reaching the mountain, retreat a hundred paces, then walk backward a hundred paces before ascending—all evil spirits will flee. If bitten by a snake, insert a small amount of realgar powder into the wound, and it will heal immediately.\n\nTo guard against the myriad ghosts of mountain and river shrines, always carry the *Scripture of the Three Sovereigns*, the *True Forms of the Five Peaks*, the *Heavenly Water Talisman*, the *Supreme Sovereign’s Bamboo Messenger Talisman*, the *White Marsh Chart*, and the *Record of the Nine Tripods*—thus, evil will retreat of its own accord. If one constantly preserves the *True One*, no talismans or medicines are needed.\n\nWaters, regardless of size, are perilous to cross—whether rivers, the Huai, or the sea. To fear no dragons, first break a magpie’s egg by the water’s edge, mix a small amount of its powder with incense, and stir it into the water to wash oneself—then one will fear no wind or waves. By practicing breath-holding until one can sustain a thousand breaths, one may remain underwater for long periods. Alternatively, obtain a piece of *tongtian* rhinoceros horn at least an inch long, carve it into the shape of a fish’s mouth, and hold it in the mouth when entering water—the water will part three feet, allowing one to breathe beneath the surface.\n\nIn the damp sands of the south, creatures like sand fleas and water crossbows pose great harm. Carry raw musk, spirit talismans, or golden elixirs to repel them. If one constantly preserves the *True One*, no poisons will assail them.\n\n*The Record of Yearning for Life and Longing for Longevity* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "摄生纂录 经名：摄生慕录。 不着撰人。 一卷。 《新唐志》着录有『王仲止《摄生慕录》一卷』，疑即此书。 底本出处：《正统道藏》洞玄部众衍类。 摄生纂录 导引篇 赤松子坐引法 长跪，两手向前。 各分开，以指向外。 次长跪，两手叉腰。 次复长跪，右手曳后去，左手叉腹前。 次复缓形长跪，左右手更曳向前，更从叉腰。 次复长跪，伸两手着背后。 次复平坐，以膝相张，两足向外，两手叉腰。 能常为此法，令人耳目聪明，延年益寿，百病不生。 为此法讫，当立以手摩身令遍，勿大寒、大热、风燥、醉饱时作之。 《养生要集》曰：《导引经》云：清日一未起，先啄齿二七，闭目握固，漱津唾，一咽气，寻闭息，极乃徐徐。 顿踵三，还上状，叉手顿项上，左右自引捩，不息复三，伸两足，返手前却，自极复三，皆当朝暮为之，能数尤善。 又清旦初起，以两手叉两耳，极上下之二七，令人耳不聋。 次缩鼻闭气，右手从头上引左耳二七止。 次复以左手从头上引右二七。 次引两鬓举之。 令人血气流通，头不白。 又摩手令热以摩面，从上下二七止，去邪气，令面有光。 又摩手令热以摩身体，从上至下，名乾浴。 令人胜风寒时热，头痛疾病并皆除也。 婆罗门导引法 第一，龙引：以两手向上拓，兼似挽弓势，右左同。 又叉手相捉头上过。 第二，龟引：峻坐，两足如八字，以手拓膝，行摇动，又左顾右顾。 第三，麟盘：侧外，屈手承头，将近将脚，屈向上，傍脏展上，脚向前拗。 左右同。 第四，虎视：两手据状，拔身向背后视。 左右同。 第五，鹤举：起立，徐徐返拗引颈，左右挽。 第六，鸾趋：起立，以脚徐徐前踏，又握固，以手前后策。 第七，鸳翔：以手向背上相捉，低身，徐徐宛转。 第八，熊奋：迅以两手相叉，翻覆向胸臆，抱膝头上，宛转。 第九，寒松空雪：大坐，手据膝，渐低头，左右摇动，徐徐回转。 第十，冬柏凌风：两手据将，或低或举，左右引，细拔回旋。 第十一，仙人排天：大坐，斜身偏倚，两手据林，如排天。 左右同。 第十二，凤凰鼓翅：两手交捶膊井连臂，返捶背上连腰脚，各三数度。 为之细拔回旋，但取使快为上，不得过度，更至疲顿。 调气篇 吐纳炼气法 夫天地万物皆因气以成形。 故知气在人中，人在气中。 气聚即生，气亡则死。 善行气者，内以养身，外以却患，然百姓日用而不知焉。 故善加调摄，必销众疾，苟有壅滞，便即生疗。 养生者当先存此道矣。 仙经云：服气者神明而寿。 虽能服食而不知调气，效乃运。 若专调气而疗疾者，效速於缄石矣。 人能常存之，不死之道也。 抱朴子曰：一人之身，一国之象也。 神犹君也，血犹臣也，气犹百姓也。 能理民则能理国，能理气则能理身。 民散则国亡，气竭则身死。 死者不可以生也，亡者不可以存也。 是以至人消未起之患，治未病之疾，医之於无事之前，不可於既逝之后。 人难养而易危，气难清而易浊。 故审德所以保社稷，割嗜欲所以固血气，然后众害却焉，寿命长焉。 每清朝初起，面向午展两手於膝上，心眼观气入项，下达涌泉。 朝朝如此，名日送气。 常以鼻引气，口吐气，常欲出气少，入气多。 每欲食，先须送气入腹，令与食为主。",
      "translated_text": "**Compendium of Nurturing Life**\n\n**Title:** *She Sheng Mu Lu* (*Admiration for the Records of Nurturing Life*). Author unknown. One fascicle. The *New Tang Catalogue* records *Wang Zhongzhi’s She Sheng Mu Lu* in one fascicle, which may be this text.\n\n**Source of Base Text:** *Zhengtong Daoist Canon*, *Dongxuan Section*, *Zhongyan Category*.\n\n---\n\n### **Compendium of Nurturing Life**\n\n#### **Guiding and Pulling (Dao Yin) Chapter**\n\n**Red Pine Master’s Seated Pulling Method**\nKneel upright, both hands extended forward.\nSeparate them, fingers pointing outward.\nNext, kneel upright, hands clasped at the waist.\nThen kneel upright again, right hand pulling backward, left hand clasped before the abdomen.\nNext, slowly kneel upright, alternating hands pulling forward and clasping the waist.\nThen kneel upright, stretching both hands behind the back.\nFinally, sit evenly, knees spread apart, feet turned outward, hands clasped at the waist.\nRegular practice of this method sharpens hearing and vision, prolongs life, and prevents all illness.\nAfter completing this method, stand and rub the body thoroughly with the hands. Avoid practicing during extreme cold, heat, windy dryness, drunkenness, or after a heavy meal.\n\nThe *Essential Collection of Nurturing Life* states: The *Dao Yin Classic* says: On a clear day, before rising, first tap the teeth thirty-four times, close the eyes, clench the fists, rinse the mouth with saliva, swallow once, then hold the breath to its limit before exhaling slowly.\nStamp the heels three times, then raise the hands, clasping them behind the neck, and twist the body left and right without breathing, repeating three times. Extend both legs, reach forward and backward with the hands, stretching fully three times. Perform these at dawn and dusk; frequent practice is especially beneficial.\nAlso, at dawn upon rising, clasp both ears with the hands and pull them up and down fourteen times to prevent deafness.\nNext, contract the nose, hold the breath, and use the right hand to pull the left ear from above the head fourteen times, then repeat with the left hand pulling the right ear fourteen times.\nThen pull the temples upward.\nThis promotes the flow of blood and qi, preventing gray hair.\nAlso, rub the hands until warm and massage the face upward and downward fourteen times to dispel evil qi and give the face a radiant glow.\nRub the hands until warm and massage the body from top to bottom—this is called \"dry bathing.\"\nIt strengthens resistance to cold, heat, headaches, and all illnesses.\n\n**Brahmin Guiding and Pulling Method**\n1. **Dragon Pulling:** Push both hands upward, as if drawing a bow, alternating left and right. Then clasp the hands and raise them above the head.\n2. **Tortoise Pulling:** Sit upright, feet positioned like the character \"八,\" hands pressing the knees, swaying the body, and turning the head left and right.\n3. **Unicorn Coiling:** Lie on the side, support the head with a bent hand, bring the knees close, then stretch the legs upward and outward, bending the feet forward. Repeat on both sides.\n4. **Tiger Gazing:** Place both hands on the ground, arch the back, and look backward. Repeat on both sides.\n5. **Crane Rising:** Stand, slowly twist the neck backward, pulling left and right.\n6. **Phoenix Striding:** Stand, slowly step forward, clench the fists, and swing the arms forward and backward.\n7. **Mandarin Duck Soaring:** Clasp the hands behind the back, lower the body, and gently twist.\n8. **Bear Thrashing:** Quickly clasp the hands, flip them over the chest, hug the knees to the head, and twist.\n9. **Winter Pine in Empty Snow:** Sit upright, hands pressing the knees, gradually lower the head, and sway left and right, slowly turning.\n10. **Winter Cypress Defying Wind:** Press the hands down, alternately lowering and raising them, pulling and twisting gently.\n11. **Immortal Pushing the Sky:** Sit upright, lean the body to one side, hands pressing the ground as if pushing the sky. Repeat on both sides.\n12. **Phoenix Flapping Wings:** Cross the hands and strike the shoulders, then strike the back, waist, and legs, repeating several times. Perform with gentle pulling and twisting, prioritizing comfort and avoiding overexertion or fatigue.\n\n#### **Regulating Qi Chapter**\n\n**Exhalation and Inhalation for Qi Refinement**\nAll things between heaven and earth take form through qi. Thus, qi resides within humans, and humans reside within qi. When qi gathers, life begins; when qi dissipates, death follows. Those skilled in guiding qi nurture the body internally and ward off harm externally, though the common people use it daily without awareness. Therefore, proper regulation and care dissolve all illnesses; if blockages persist, ailments arise. Those who nurture life must first master this Dao.\n\nThe *Immortal Classics* state: Those who ingest qi gain spiritual clarity and longevity. Yet even those who consume medicinal foods but do not regulate qi will see delayed effects. If one specializes in regulating qi to treat illness, the results surpass acupuncture and stone needles. Those who constantly cultivate this attain the Dao of immortality.\n\n*Baopuzi* says: The human body resembles a kingdom. Spirit is like the ruler, blood like the ministers, and qi like the people. Governing the people enables governance of the state; regulating qi enables regulation of the body. When the people scatter, the state falls; when qi is exhausted, the body dies. The dead cannot be revived, nor can the fallen be restored. Thus, the sage eliminates incipient harm, treats illness before it arises, and heals before matters escalate—not after they have passed. Humans are difficult to nurture yet easy to endanger; qi is hard to purify yet easy to pollute. Therefore, scrutinizing virtue preserves the state, and curbing desires strengthens blood and qi. Only then are all harms dispelled, and longevity attained.\n\nEvery clear morning upon rising, face south, extend both hands upon the knees, and visualize qi entering the neck and descending to the *yongquan* (bubbling spring) acupoint. Doing this daily is called \"sending qi.\" Always inhale through the nose and exhale through the mouth, ensuring exhalation is less than inhalation. Before eating, first send qi into the abdomen, allowing it to govern the food.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1294,
      "start_sentence": 0,
      "end_sentence": 69,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.751755952835083,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\摄生纂录.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "仙经云：食有十二时，气从夜半始。 自九九至八八、七七、六六、五五，以心受之。 四季引镇星黄气，以脾受之。 秋引太白，白气以肺受之。 冬引辰星，黑气以肾受之。 又有食六戊之精，亦有大效。 假令甲子旬有戊辰，则竟其旬常向辰地而吞气，后则到甲复向其旬之戊也。 凡此诸法，备在仙经，恐非流俗所能行用，好道君子安可忘？ 诸《服气经》云：从夜半至日中为生气，日中至夜半为死气，常以生气时正僵#1外瞑目，握固，闭气不息，於心中数至二百，乃口吐气出之。 日增息如此，则身神具，五脏安。 能闭气至二百五十，华盖明，耳．目聪，举身无病，邪不干人矣。 宝气一名炼气，一名行气，一名长息。 其法，正僵外，徐漱醴泉而咽之。 因行气，口但吐气，鼻但纳气，徐缩鼻引之，莫太极者，难还入。 五息已息，自可吐也。 一息数之至九十息，若然可频伸。 频伸讫，复为之，满四九。 四九三百六十息为一竟。 咽之者每吐气，欲止辄一咽之。 乃鼻纳气也，不尔或令人嗽。 凡气纳则气上升，吐气则气下流，自觉周身也。 凡行气常以月一日，念令气从手十指出，以十六日尽。 月晦念令气从足十指出，久久自觉气从手足通，即能闭气不息，便长生矣。 灵龟所以千岁不食者，能不兴鼻息故也。 太清行门户之道，《九都经》谓之天壮地壮。 天地壮，气通即能轻举矣。 手为天门，足为地户； 手为天壮，足为地壮者也。 凡行气当髻实为之，常以鹦呜生气时正僵外，握固，两足问相去五寸，两臂去体相去亦各五寸，去枕，微息，四九三百六十息，身如委衣，骨节皆解。 初为势至三百六十息，转觉藏云行体中，经营周身，湍润形体，浇灌皮肤，五脏六腑皆悉充满，旧疾稍去矣。 凡初行气，先安稳其身，而和其气，无与意争。 若不安和，即且止，和乃为之，常守勿倦也。 少行即少得之，大行即大得之。 气至即形安，形安则鼻息和调，鼻息和调财精气来至，精气来至则自觉形热，形热即颇汗出，汗出且勿便起，安安养之，务欲其久。 当即去忿怒忧愁，能去忿怒忧愁即气不乱，气不乱即正气来至，正气来至即口中甘香，口中甘香即多唾，而鼻息微长即五脏安而气和，其理自然百病去，饮食美，三气调，形轻而老寿矣。 凡行气，以鼻纳气，以口吐气，微引之名曰长息。 纳气有一，吐气有六。 纳气有一者，谓吸也。 吐气有六者，谓吹、呼、嘻、呵、虚、咽，皆出气也。 凡人之息，一呼一吸，无有此数为长息。 吐气之法，时寒可吹，时温可吸，委曲疗病，吹以去热，嘻以去风，呵以去烦，又以下气虚者则多嘘咽。 道家行气，卒不欲嘘咽者，长息之忌也。 此男女俱可行此法。 出《仿仙经》。 闭气法：亦以鼻纳气，便闭之於内，为可久极乃开口微吐之，口小吐之，鼻复小纳，如此再三，乃长吐之，亦如上吐、呼、嘻、呵之法。 闭气致至千五百，复当但入不出者，但从鼻入通手足，不复从口出也。 欲自通之於口，乃从口出耳。 譬如水流，前水过去后水续处，不复往反，长生之道央於斯矣。 炼气法：正偃卧，徐漱醴泉咽之，莫闭口因行气，口但得吐气，鼻但得纳气，不欲恶气入也。 徐缩鼻，莫太极满，太极满难还入，五息可吐，莫至极。",
      "translated_text": "The *Immortals’ Classics* state: \"There are twelve times for consuming qi, which begins at midnight. From nine nines to eight eights, seven sevens, six sixes, and five fives, receive it with the heart. In the four seasons, draw the yellow qi of Saturn and receive it with the spleen. In autumn, draw the white qi of Venus and receive it with the lungs. In winter, draw the black qi of Mercury and receive it with the kidneys. There is also the method of consuming the essence of the six *wu* days, which yields great efficacy. For example, during the *jiazi*旬, if there is a *wuchen* day, face the *chen* direction throughout the旬 to swallow qi; afterward, when the next *jia* day arrives, face the *wu* direction of that旬. All these methods are recorded in the *Immortals’ Classics*, yet they may not be practiced by the common folk—how could a gentleman devoted to the Dao forget them?\"\n\nVarious *Qi-Consuming Classics* state: \"From midnight to noon is the time of living qi; from noon to midnight is the time of dead qi. Always during the living qi hour, lie perfectly still, close the eyes, clench the fists, hold the breath without exhaling, and count silently to two hundred before exhaling through the mouth. Daily increase the count in this manner, and the body’s spirits will be complete while the five viscera are at peace. If one can hold the breath to two hundred fifty, the *huagai* (canopy) will brighten, the ears and eyes will grow sharp, the entire body will be free of illness, and evil will not invade.\n\n\"Treasure qi is also called refining qi, circulating qi, or long breathing. Its method: lie perfectly still, slowly rinse the mouth with *liquan* (sweet spring) and swallow it. While circulating qi, only exhale through the mouth and only inhale through the nose, gently contracting the nostrils to draw it in. Do not overfill, for excess makes it difficult to return. After five breaths, one may exhale. Count each breath to ninety; if possible, stretch frequently. After stretching, repeat the practice, completing four nines. Four nines make three hundred sixty breaths, constituting one full cycle. When swallowing, with each exhalation, pause to swallow once before inhaling through the nose again—otherwise, it may cause coughing.\n\n\"When qi is inhaled, it ascends; when exhaled, it descends, circulating throughout the body. In practicing qi circulation, on the first day of the month, visualize qi exiting through the ten fingertips, continuing until the sixteenth day. On the last day of the month, visualize qi exiting through the ten toes. With prolonged practice, one will naturally feel qi flowing through the hands and feet, enabling breath-holding without exhalation—thus attaining longevity. The spiritual tortoise lives a thousand years without eating because it does not stir its nasal breath.\n\n\"The *Great Clarity* method of circulating through the gates and doors is called *Heavenly Strength and Earthly Strength* in the *Nine Capitals Classic*. When qi flows through Heavenly and Earthly Strength, one can achieve lightness of body. The hands are the Gate of Heaven; the feet are the Door of Earth. The hands are Heavenly Strength; the feet are Earthly Strength.\n\n\"When practicing qi circulation, always do so with the hair bound tightly. During the living qi hour at dawn, lie perfectly still, clench the fists, keep the feet five inches apart, and hold the arms five inches from the body. Remove the pillow, breathe gently, and complete four nines—three hundred sixty breaths—until the body feels as limp as discarded clothing, with all joints relaxed. Initially, after three hundred sixty breaths, one will gradually sense clouds moving within the body, circulating throughout, moistening the form, irrigating the skin, and filling the five viscera and six bowels, gradually dispelling old illnesses.\n\n\"When first practicing qi circulation, first stabilize the body and harmonize the breath, avoiding conflict with intention. If not at ease, pause and resume only when harmonized, maintaining consistency without weariness. Little practice yields little benefit; great practice yields great benefit. When qi arrives, the body is at peace; when the body is at peace, nasal breathing becomes harmonious. When nasal breathing is harmonious, essence and qi arrive; when essence and qi arrive, the body naturally grows warm. When the body grows warm, slight sweating occurs—do not rise immediately but rest calmly, prolonging the state as much as possible.\n\n\"Eliminate anger, resentment, and sorrow. By doing so, qi remains unconfused, and true qi arrives. When true qi arrives, the mouth becomes sweet and fragrant, saliva increases, nasal breathing lengthens subtly, the five viscera are at peace, and qi harmonizes. Naturally, all illnesses depart, food tastes delicious, the three qi are regulated, the body feels light, and one attains longevity.\n\n\"In qi circulation, inhale through the nose and exhale through the mouth, gently drawing it in—this is called long breathing. There is one method of inhalation and six methods of exhalation. The one method of inhalation is *absorption*. The six methods of exhalation are *chui* (blowing), *hu* (exhaling), *xi* (sighing), *he* (expelling), *xu* (hissing), and *si* (whispering)—all are ways of expelling qi.\n\n\"Human breathing consists of one exhalation and one inhalation, without this count, it is long breathing. The method of exhaling qi: when cold, use *chui*; when warm, use *xi*. For treating illnesses, *chui* dispels heat, *xi* dispels wind, *he* dispels vexation, and for those with deficient lower qi, use more *xu* and *si*. Daoists practicing qi circulation should avoid *xu* and *si* abruptly, as they are taboos in long breathing. Both men and women can practice this method.\" (From the *Imitating Immortals Classic*)\n\n**Breath-Holding Method:**\nAlso inhale through the nose, then hold the breath internally for as long as possible before slightly exhaling through the mouth. Exhale gently, then inhale slightly through the nose again. Repeat this two or three times before fully exhaling, following the above methods of *chui*, *hu*, *xi*, and *he*. When holding the breath to one thousand five hundred, one should only inhale without exhaling—qi enters through the nose and flows to the hands and feet without exiting through the mouth. To release it through the mouth, exhale from there. Like flowing water, where the preceding current departs and the following current continues without reversal, the Dao of longevity culminates here.\n\n**Refining Qi Method:**\nLie perfectly still, slowly rinse the mouth with *liquan* and swallow it. Do not close the mouth while circulating qi—only exhale through the mouth and inhale through the nose, avoiding the entry of foul qi. Gently contract the nostrils, but do not overfill, for excess makes it difficult to return. After five breaths, one may exhale, but not to the extreme.",
      "overlap_context": "rbing desires strengthens blood and qi. Only then are all harms dispelled, and longevity attained.\n\nEvery clear morning upon rising, face south, extend both hands upon the knees, and visualize qi entering the neck and descending to the *yongquan* (bubbling spring) acupoint. Doing this daily is called \"sending qi.\" Always inhale through the nose and exhale through the mouth, ensuring exhalation is less than inhalation. Before eating, first send qi into the abdomen, allowing it to govern the food.",
      "start_char": 1295,
      "end_char": 2541,
      "start_sentence": 70,
      "end_sentence": 119,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.898220539093018,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\摄生纂录.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "自一数之十息，屈指至九十息数，可频伸，四九三百六十息，意脑中黄气大如鹦子，常念之。 意中疲倦，当先陈#2三七二百一十息，炼气还气，令肝满，气不大，令出，闭气七十息一咽，含不足复满七十息，莫致大顿，击击之气当随发上出，及流四肢，自热#3下至足脚，徐调气还至胃管，喉咽，使下脐一二三四即还管矣。 凡炼气法，外为之，日瞳咙便当坐为。 如前头卧炼气法，至七十息四五通。 凡初行气小不调，久行易耳。 行气还至胃中，咽气自觉至胃中矣。 便缠着脐，心数一二三四五六七八九，缠已，不欲大嘘咽也。 却亦当转气下去气，终不上气，小经屈气经上去欲令转下，壮事实气，已复小嘘，再三吸，便自下。 治头眩、耳聋，欲还气五脏问，至不过十日愈。 委气，四九三百六十息，正僵外，握固，先调和，口中含唾莫咽，九息一展转，令足间相去五寸挽之，微还气时身如委衣，骨节俱解。 徐九十息止，当违一指不开。 初为当热，至三百六十息复为，至三九但系意不欲使思散，欲还自坐为，男子左边，妇人右边。 七十息一咽。 此炼气男女俱仙之法也。 凡行气闭气虽是治身之要，然要先达解其理。 空又宜虚，不可饱满。 若气有结滞，不得宣流，或致发疮，譬如泉源不可壅遏。 若食生菜服肉，及喜怒忧患不除，而以行气，令人发上气。 凡欲修此，皆当以渐。 又别法云：调气者，平明面向午，展两手於膝上，徐徐按捺支节，口吐浊气，鼻引清气，所谓吐故纳新者也。 每引气讫，闭气良久，徐徐吐之。 仍以手左拓，上拓，下拓，前拓，后拓。 取气之时，意想气入毛际，流於五脏四肢，皆受其润，如山之纳云，如地之纳泽。 若气通即觉腹中汨汨热转动，若得十通已上，则身体润泽而光今，耳目聪明，令人能食有力，百病不生矣。 又有内调气之法与前法略同云。 渐习至千息，即老者更少，日还一日，自然不食矣。 调气之法亦无定数，唯多益善。 大约夜半后二十四调之，鹦呜时一十八调之，平明一十二调之，日中后一十二调之。 若能多调，每时加三十四十回亦得。 《仙经》云：若大雾、大雨、大风之日，不得行气，但闭而勿调。 凡将调气者，先除鼻中毛，所谓通神之路也。 凡欲行气，欲除百病，随病所在念之。 头病念头，足病念足，和气往攻之，从时至时，便自消矣。 时气中玲可闭气以取汗，辄周身则解矣。 疗病法：一准调气坐外，若卒患寒热及瘫肿等，当日调之，不愈，一两日必差。 若心中玲病吹而出之，热病呵而出之，肝病嘘而出之，肺病咽而出之，脾病嘻而出之，肾病吹而出之。 每作皆三十六遍，仍须行导引之法。 又热病用大吹五十遍，细吹十遍。 心闷者用大嘘三十遍，细嘘十遍。 肝病者，用大呵三十遍，细呵十遍。 心病者，用大嘘三十遍，细嘘十遍。 肾病，用大咽五十遍，细咽十三遍。 若能用心行之，无有不差。 何以知五脏之病？ 体有冷热，多梦赤衣人持赤刀仗者，心之病也。 胸膈胀满，四肢烦问，梦见美女妇人及父母妻子者，肺病也。 忧愁不乐，头眼时痛，梦青衣人或持青刀或狮子虫狼来怖人，肝病也体上游风习习，体闷疼痛，梦见小儿击腋或如旋风绕人者，脾病也。",
      "translated_text": "Begin by counting from one to ten breaths, then bend the fingers to tally up to ninety breaths—one may stretch intermittently. At four nines, three hundred sixty breaths, envision within the brain a yellow qi, vast as an egg, and dwell upon it constantly. Should the mind grow weary, first perform two hundred ten breaths of \"refining qi to return qi,\" filling the liver; if the qi does not swell greatly, allow it to exit. Hold the breath for seventy breaths before swallowing, and if the breath feels insufficient, replenish it with another seventy breaths—do not force a sudden surge. The qi, once struck, should rise and flow outward, suffusing the four limbs, warming from above downward to the feet. Gradually regulate the qi to return to the stomach duct, then guide it through the throat and swallow, directing it downward past the navel—one, two, three, four—and back to the duct. For all refining qi methods, perform them externally, sitting at dawn and dusk.\n\nAs with the previous supine refining qi method, proceed to seventy breaths, four or five cycles. Initially, the qi may feel slightly unregulated, but with prolonged practice, it becomes effortless. When guiding qi back to the stomach, one will sense its arrival upon swallowing. Then coil it around the navel, counting one through nine, and cease—do not forcefully exhale or swallow. Instead, turn the qi downward, ensuring it does not rise. If the qi in the minor meridians ascends, guide it back down to strengthen the body’s true qi. After a slight exhale, inhale two or three times, and it will descend naturally.\n\nTo treat dizziness and deafness, guide qi to harmonize the five viscera—recovery should take no more than ten days. For \"yielding qi,\" perform three hundred sixty breaths in four nines while lying perfectly still, fists clenched. First harmonize the breath, hold saliva in the mouth without swallowing, and every nine breaths, shift position slightly, drawing the feet five inches apart. As the qi gently returns, the body should feel as supple as discarded clothing, the joints entirely loosened. After ninety breaths, cease, keeping one finger unclenched. Initially, warmth will arise; by three hundred sixty breaths, it will recur. By the third nine, focus the mind without allowing thoughts to scatter. To resume, sit upright—men on the left side, women on the right. Swallow once every seventy breaths. This is the method by which both men and women attain immortality through refining qi.\n\nThough holding and refining qi are essential for cultivating the body, one must first thoroughly grasp their principles. The space within should remain empty and unfilled. If qi becomes stagnant and fails to circulate, it may cause sores—like a spring’s source, it must not be dammed. Consuming raw vegetables or meat, or harboring joy, anger, sorrow, or worry while refining qi, may induce counterflow qi. Those who wish to practice this must proceed gradually.\n\nAnother method states: To regulate qi, face south at dawn, extend both hands upon the knees, and gently press the joints. Exhale turbid qi through the mouth and inhale pure qi through the nose—this is what is meant by \"expelling the old and absorbing the new.\" After each inhalation, hold the breath for a long moment, then exhale slowly. Use the hands to press upward, downward, forward, and backward. While drawing qi, visualize it entering through the pores, flowing into the five viscera and four limbs, nourishing them all—like mountains receiving clouds, like earth absorbing moisture. When the qi flows smoothly, one will feel a warm, rolling sensation in the abdomen. After achieving ten or more cycles, the body will become moist and radiant, the ears and eyes sharp, appetite and strength increase, and all illnesses vanish.\n\nThere is also an internal qi-regulation method similar to the above. With gradual practice up to a thousand breaths, even the aged will grow younger, reversing time day by day, until they naturally cease eating. The method of regulating qi has no fixed count—only that more is better. Generally, perform twenty-four cycles after midnight, eighteen at cockcrow, twelve at dawn, and twelve after noon. If one can practice more, adding thirty or forty cycles per session is also acceptable.\n\nThe *Scripture of Immortals* states: On days of heavy fog, rain, or wind, do not refine qi—simply remain still without regulating. Before regulating qi, first remove the hairs from the nostrils, for they are the path to communion with the spirits. To refine qi and cure illness, direct the mind to the afflicted area. For head ailments, focus on the head; for foot ailments, focus on the feet. Harmonize the qi to attack the illness, and from one hour to the next, it will dissipate. For seasonal colds, hold the breath to induce sweating, and when it covers the body, the illness will resolve.\n\n**Therapeutic Method:**\nFollow the seated qi-regulation posture. For sudden afflictions like chills, fever, or swelling, regulate qi on the same day—if not cured, recovery will come within one or two days. For cold illnesses of the heart, blow the qi out; for heat illnesses, exhale with *he*; for liver ailments, exhale with *xu*; for lung ailments, exhale with *yi*; for spleen ailments, exhale with *xi*; for kidney ailments, blow the qi out. Perform each thirty-six times, and always incorporate guiding and pulling exercises.\n\nFor heat illnesses, use a strong *chui* fifty times and a gentle *chui* ten times. For heart distress, use a strong *xu* thirty times and a gentle *xu* ten times. For liver ailments, use a strong *he* thirty times and a gentle *he* ten times. For heart ailments, use a strong *xu* thirty times and a gentle *xu* ten times. For kidney ailments, use a strong *yi* fifty times and a gentle *yi* thirteen times. With diligent practice, there is no illness that will not be cured.\n\nHow does one recognize the illnesses of the five viscera? If the body experiences alternating cold and heat, and one dreams of red-clad figures wielding red blades, it is an illness of the heart. If the chest and diaphragm feel distended and full, the limbs restless, and one dreams of beautiful women, family, or spouses, it is an illness of the lungs. If one feels sorrowful and joyless, with frequent head and eye pain, and dreams of green-clad figures, or those wielding green blades, or lions and wolves threatening, it is an illness of the liver. If the body feels wandering winds or itching, with oppression and pain, and one dreams of children striking the armpits or whirlwinds encircling them, it is an illness of the spleen.",
      "overlap_context": "eceding current departs and the following current continues without reversal, the Dao of longevity culminates here.\n\n**Refining Qi Method:**\nLie perfectly still, slowly rinse the mouth with *liquan* and swallow it. Do not close the mouth while circulating qi—only exhale through the mouth and inhale through the nose, avoiding the entry of foul qi. Gently contract the nostrils, but do not overfill, for excess makes it difficult to return. After five breaths, one may exhale, but not to the extreme.",
      "start_char": 2541,
      "end_char": 3783,
      "start_sentence": 120,
      "end_sentence": 166,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.763213872909546,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\摄生纂录.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "体玲阴衰，或梦黑衣人持黑刀怖人者，肾病也。 推此以定之，无不验矣。 又乐先生调气法：大约与前法略同。 云於争室内施状枕，与身平布，展手，去身，各三四寸，两足相去亦然。 当先念：法性平等，死生不妄，拘魂制魄。 呜天鼓三十二通，漱玉泉三五咽，以鼻吸入腹，数多为良，勿使耳闻气入声。 气初入时有得三十、二十息即闷，可闭气勿令鼻中却出，开口轻轻放，微出多少，觉体热微汗是气行之验。 服气，夜取子时至丑时可了，昼可取巳时至午时可了。 服讫，可坚两膝，用气抽上肠，吐向下，顿掣三五十度，此谓炼气。 腹中及四肢中病皆得除愈。 取气之数，具之於后。 凡服气，先取北黑气，谓之玄牙。 思北方七星胜事，以安为度，或五或五十或五百，补肾，传气於肝，比北方水藏主肾故也。 次取东方青牙，思东方中华道藏第二十三册 七星胜事，以补肝，其数九或九十或九百，传气於心，以束方木藏主肝故也。 次取南方丹牙，思南方七星胜事，其数三或三十或三百，补心，传气於脾，以南方火藏主心故也。 次取中宫黄牙，思中宫七星胜事，其数一或一十或一百，补脾，传气於肺，以中宫土藏主脾故也。 次取西方素牙，思西方七星胜事，其数七或七十或七百，以补肺，传气於肾，以西方金藏主肺故也。 又有吐气疗一切病，亦与服气相须，如气满不行亦可吐气出。 吐之法：呵一，呼二，嘘三，嘻四，咽五，吹六。 凡呵而出肺气者，以金主太白，成肺不受客气。 客，火也。 客壮伤主，是以呵而出之。 凡吹出心气者，以火主荧惑，成心不受客气。 客，水也。 客壮伤主，是以吹而出之。 凡咽出肝气者，以木主岁星，成肝不受客气。 客，金也。 客壮伤主，是以咽而出之。 凡嘘出脾气者，以土主镇星，成脾不受客气。 客，木也。 客壮伤主，是以嘘而泌之。 凡呼出肾气者，以水主辰星，成肾不受客气。 客，土也。 客壮伤主，是以呼而出之。 凡嘻出膀胱气者，三焦水谷宫，伤玲则痢，伤热则闷，闷则病在小肠，痢则病在大肠，嘻而出之则和矣。 凡人肝藏魂，肺藏魄，脾藏志，心藏神，肾藏精。 若六腑不和，则五藏伤客气。 胆一，大肠二，小肠三，三焦通为六腑。 凡三焦在膀胱，有其处无其形，是为六腑。 六腑不和，则五藏不通，五藏不通，则五气不传，而五六皆病。 若能消而息之，可以无病矣。 胎食胎息法 常须闭其心，去其思，微其息。 息以鼻，无以口，使气常有储，名之日胎息。 漱其舌下泉咽之，数十息之问一相继，名之日胎食。 为二者不息，可以不饥，可以不病。 食日月精法 取日初出时、日中时、日入时，正立向日，展两手，闭气九遍，仰天喻日光而咽之，九度，益精气，令人强壮不六八。 老。 又以月初出时、月正中时、月入时，正立向月，展两手，闭气九遍，仰天嗡月光咽之，令人阴气盛。 妇人有子。 居处篇",
      "translated_text": "If the body feels cold and the yin is deficient, or one dreams of black-clad figures wielding black blades to frighten them, it is an illness of the kidneys. Extrapolating from this, none will fail to be accurate.\n\nMaster Le’s Qi-Regulating Method is largely similar to the previous method. It states: within a quiet chamber, arrange a pillow of proper height, level with the body. Extend the hands three or four inches from the body, and space the feet likewise. First, one must contemplate: the Dharma-nature is equanimous; life and death are not delusive. Bind the hun and restrain the po. Strike the Heavenly Drum thirty-two times, rinse the Jade Spring three to five swallows, and draw breath through the nose into the abdomen, counting the breaths—more is better—without letting the ears hear the sound of the incoming breath. When first drawing breath, if one can manage only twenty or thirty breaths before feeling stifled, hold the breath without letting it escape through the nose, then gently release it through the mouth, exhaling just enough to feel the body grow warm and a slight sweat appear—this is the sign that the qi is circulating. For qi-ingestion, at night, one may complete the practice between the hours of *zi* and *chou*; during the day, between *si* and *wu*. After ingesting qi, kneel firmly and use the qi to draw up the intestines, then expel it downward, repeating this thirty to fifty times—this is called \"qi-refinement.\" All illnesses in the abdomen and the four limbs will thus be cured.\n\nThe number of breaths to be taken is set forth below. For qi-ingestion, first draw the black qi of the north, called the \"Mysterious Sprout.\" Contemplate the Seven Stars of the Northern Dipper and their victorious affairs, continuing until settled—whether five, fifty, or five hundred breaths—to supplement the kidneys, then transmit the qi to the liver, for the Water viscus of the north governs the kidneys. Next, draw the green qi of the east, the \"Azure Sprout.\" Contemplate the Seven Stars of the Eastern Dipper and their victorious affairs to supplement the liver—whether nine, ninety, or nine hundred breaths—then transmit the qi to the heart, for the Wood viscus of the east governs the liver. Next, draw the cinnabar qi of the south, the \"Vermilion Sprout.\" Contemplate the Seven Stars of the Southern Dipper and their victorious affairs—whether three, thirty, or three hundred breaths—to supplement the heart, then transmit the qi to the spleen, for the Fire viscus of the south governs the heart. Next, draw the yellow qi of the central palace, the \"Yellow Sprout.\" Contemplate the Seven Stars of the Central Dipper and their victorious affairs—whether one, ten, or one hundred breaths—to supplement the spleen, then transmit the qi to the lungs, for the Earth viscus of the center governs the spleen. Finally, draw the white qi of the west, the \"Pristine Sprout.\" Contemplate the Seven Stars of the Western Dipper and their victorious affairs—whether seven, seventy, or seven hundred breaths—to supplement the lungs, then transmit the qi to the kidneys, for the Metal viscus of the west governs the lungs.\n\nThere is also a method of exhaling qi to cure all illnesses, which complements qi-ingestion. If the qi becomes full and does not circulate, one may exhale it. The method of exhalation is as follows: *he* (1), *hu* (2), *xu* (3), *xi* (4), *yan* (5), *chui* (6). Exhaling with *he* expels the qi of the lungs, for Metal governs Venus, and the lungs, being Metal, do not receive guest qi. The guest is Fire; when the guest is strong, it harms the host, so one expels it with *he*. Exhaling with *chui* expels the qi of the heart, for Fire governs Mars, and the heart, being Fire, does not receive guest qi. The guest is Water; when the guest is strong, it harms the host, so one expels it with *chui*. Exhaling with *yan* expels the qi of the liver, for Wood governs Jupiter, and the liver, being Wood, does not receive guest qi. The guest is Metal; when the guest is strong, it harms the host, so one expels it with *yan*. Exhaling with *xu* expels the qi of the spleen, for Earth governs Saturn, and the spleen, being Earth, does not receive guest qi. The guest is Wood; when the guest is strong, it harms the host, so one expels it with *xu*. Exhaling with *hu* expels the qi of the kidneys, for Water governs Mercury, and the kidneys, being Water, do not receive guest qi. The guest is Earth; when the guest is strong, it harms the host, so one expels it with *hu*. Exhaling with *xi* expels the qi of the bladder. The Triple Burner is the palace of water and grain; when injured by cold, it causes dysentery, and when injured by heat, it causes oppression. Oppression leads to illness in the small intestine, while dysentery leads to illness in the large intestine. Exhaling with *xi* restores harmony.\n\nThe liver stores the *hun*, the lungs store the *po*, the spleen stores the will, the heart stores the spirit, and the kidneys store the essence. If the six bowels are disharmonious, the five viscera are harmed by guest qi. The gallbladder is the first, the large intestine the second, the small intestine the third, and the Triple Burner, though formless, is counted as the sixth bowel. If the six bowels are disharmonious, the five viscera do not communicate; if the five viscera do not communicate, the five qi are not transmitted, and both the five and six become diseased. If one can dissolve and settle them, one may remain free of illness.\n\n**Embryonic Breathing and Embryonic Nourishment Method**\nOne must constantly quiet the heart, dispel thoughts, and make the breath subtle. Breathe through the nose, not the mouth, so that the qi is always stored—this is called \"embryonic breathing.\" Rinse the spring beneath the tongue and swallow it, continuing for several tens of breaths without interruption—this is called \"embryonic nourishment.\" By practicing these two without ceasing, one may avoid hunger and illness.\n\n**Ingesting the Essence of the Sun and Moon**\nAt sunrise, noon, and sunset, stand facing the sun, extend both hands, and hold the breath nine times. Tilt the head back, draw in the sunlight, and swallow it nine times to replenish essence and qi, making one strong and preventing the decline of the six and eight (i.e., aging). At moonrise, midnight, and moonset, stand facing the moon, extend both hands, and hold the breath nine times. Tilt the head back, draw in the moonlight, and swallow it to strengthen the yin qi. Women who do this will conceive.\n\n**Dwelling and Abiding**",
      "overlap_context": "ed and full, the limbs restless, and one dreams of beautiful women, family, or spouses, it is an illness of the lungs. If one feels sorrowful and joyless, with frequent head and eye pain, and dreams of green-clad figures, or those wielding green blades, or lions and wolves threatening, it is an illness of the liver. If the body feels wandering winds or itching, with oppression and pain, and one dreams of children striking the armpits or whirlwinds encircling them, it is an illness of the spleen.",
      "start_char": 3783,
      "end_char": 4897,
      "start_sentence": 167,
      "end_sentence": 219,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.92300271987915,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\摄生纂录.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "摄理法 夫摄理者，先在水土所习，必欲高燥之处。 《左传》云：土厚水深，居之不疾。 若下湿之地，必能损人。 今南人多夭，北人多寿，此其验也。 《淮南》云：坚土人刚，弱土人肥； 炉土人大，沙土人细； 息土人美； 耗土人丑； 山气多男，泽气多女； 水气多疮，风气多聋； 林气多疟，木气多呕； 湿气多痉，石气多力，阴气多瘦； 暑气多夭，寒气多寿； 谷气多痹，丘气多狂； 广气多仁，陵气多贪。 轻土人利，重土人迟； 清水音小，浊水音大； 湍水人轻，迟水人重； 中土多圣。 凡人皆牵水土以为善恶，从此观之，安可不择地而居耳？ 古者巢居穴处，人皆长寿者，何也？ 岂非巢居则迥，穴处则密，人不受巢穴之风故也。 自上栋下宇，巢穴便生众疾，咸臻夭，寿日促。 今之居处房屋不可高大虚敞，非唯风雾难防，亦使精神恍散。 《吕氏春秋》云：台高则多阳，室大则生痿，阳则生蹶。 且亦有丰屋之诚，可不慎哉？ 古人之所居，但取门墙周密。 墙宇幽深，使纤毫之风无所从入，自然众疾不生矣。 觉有风穴，即须避之。 凡细隙之风为害尤切，古来忽中风，四肢不遂，角弓反张，失音，皆由忽此。 身既中风，众病总集，邪鬼得便，以致夭枉。 古者，洛阳市青店店主，坐处柱上有孔如缄头，而前后店主不悟，皆同病而死，此其验也。 所居之室必令洁序，朝夕怛欲焚香，则人不受恶气，常得和气。 又养生之人，须有日月规镜，及石精、金光剑，及生犀、麝香、雄黄、丹砂，以自卫，大吉。 又《仙经》云：以大盆盛清水当户安之，拔大刀横上，令刃向外，悬明镜於上，书制邪符於镜傍，则百邪不敢犯，犯者皆见血在水中。 又说，但悬孔好九寸明镜於背后，则邪魅不敢隐形矣。 丁公杀鬼丸仙人所授方 虎头骨 丹砂 真珠 雄黄 雌黄 曾青 女青 鬼臼 皂荚桔梗 芍翁 白芷 苍木 芜萸 鬼箭 鬼督邮 华芦 莒蒲 右十八味，各二分，捣筛，蜜和如弹丸。 带之，男左女右，百邪不敢近人，梦寐不乱，魂魄常安。 凡人居止、移动、避病，皆有吉处，摄生君子皆宜用之。 假令岁德、月德、日德、时德，最为大者#4。 推岁德法 谓甲岁德自处，乙德在庚； 丙德自处，丁德在壬； 戊德自处，己德在甲； 庚德自处，辛德在丙； 壬德自处，癸德在戊。 推月德法 正月德在丁，二月在坤，三月在壬，四月在辛，五月在乾，六月在甲，七月在癸，八月在艮，九月在丙，十月在乙，十一月在巽，十二月在庚。 推日德与岁德同，谓甲日德自处，乙日德在庚也。 时德与月德同，谓寅时德在丁，卯时德在坤，他皆推所在。 又有推游年法，先从离数，而乾不受八，前就离，至兑为十，坎为二十，震为三十，离为四十； 坤不受一，却就离，复至兑为五十，乃至百二十岁，皆准此。 凡游年所至之处，从下一变为祸害，全变祸害为五鬼，再变为绝命，全变绝命为六害，三变为生气，全变生气为天医复位，全变游年为福德。 凡居止移转皆就生气福德为上，若避病兼就天医，仍类其万物以为吉凶。 其绝命、祸害、五鬼、六害，皆宜避之。 一说云：男忌祸害，女忌绝命。 凡居宅有火，起土造作及在太岁、太阴、大将军、月刑杀上者，宜於天仓上掘坑方深五尺，坑内安石千斤，石上累堑千枚，并泥其上，大吉。",
      "translated_text": "**Methods of Regulating and Nurturing**\n\nThe art of regulating and nurturing begins with adapting to the water and soil of one’s environment, which must be a high and dry place. As the *Zuo Zhuan* states: *\"Where the soil is thick and the water deep, dwelling there brings no illness.\"* Low and damp places, however, are certain to harm one’s health. This is evident in the fact that southerners often die young, while northerners tend to live long. As the *Huainanzi* observes: *\"Firm soil breeds resolute people; weak soil breeds plump people. Clay soil breeds large people; sandy soil breeds delicate people. Fertile soil breeds beautiful people; barren soil breeds ugly people. Mountainous qi yields many sons; marsh qi yields many daughters. Water qi yields many sores; wind qi yields many deaf. Forest qi yields many malarial fevers; wood qi yields many retchings. Damp qi yields many convulsions; stone qi yields great strength. Yin qi yields many thin people; summer heat yields many early deaths; cold qi yields long life. Valley qi yields many numbnesses; hill qi yields many madmen. Vast qi yields many benevolent people; mound qi yields many greedy people. Light soil yields agile people; heavy soil yields slow people. Clear water yields soft voices; turbid water yields loud voices. Rapid water yields light people; sluggish water yields heavy people. Central soil yields many sages.\"* Since all people are shaped by the water and soil of their land, determining good or ill fortune, how can one fail to choose one’s dwelling with care?\n\nIn ancient times, people lived in nests or caves and enjoyed long lives—why? Was it not because nest-dwellers were elevated and cave-dwellers secluded, shielding them from the winds of their abodes? Since the advent of raised beams and tiled roofs, however, nest- and cave-dwellers have suffered myriad illnesses, meeting early deaths and shortening their lifespans. Modern dwellings must not be excessively tall, spacious, or drafty, for not only are wind and mist difficult to guard against, but such spaces also scatter the spirit. As the *Master Lü’s Spring and Autumn Annals* warns: *\"High terraces breed excess yang; large chambers breed atrophy; excess yang breeds collapse.\"* Moreover, the admonition against extravagant houses should not be taken lightly.\n\nThe ancients chose dwellings solely for their enclosed walls and secluded courtyards, ensuring that even the faintest breeze could not penetrate. In this way, illnesses naturally did not arise. If one senses a draft, one must avoid it. Even the slightest crevice can cause grave harm—since ancient times, sudden wind-strokes, paralysis, arched-back convulsions, and loss of speech have all stemmed from neglecting this. Once the body is struck by wind, a host of ailments gather, and malevolent spirits seize the opportunity, leading to untimely death. There was once an innkeeper in Luoyang whose pillar had a hole the size of a coin; neither he nor his successors noticed it, and all died of the same affliction—proof of this principle.\n\nOne’s dwelling must be kept clean and orderly. Burning incense morning and evening ensures that one does not inhale foul qi but instead enjoys harmonious qi. Those who cultivate life should also keep mirrors aligned with the sun and moon, along with stone essence, a golden-light sword, raw rhinoceros horn, musk, realgar, cinnabar, and other protective talismans—greatly auspicious.\n\nThe *Scripture of the Immortals* further advises: Place a large basin of clear water at the entrance, lay a broadsword across it with the blade facing outward, and hang a bright mirror above. Inscribe a demon-subduing talisman beside the mirror, and no evil will dare approach; if they do, their blood will appear in the water. Alternatively, simply hang a nine-inch mirror of fine quality behind you, and no demonic entity will dare reveal its form.\n\n**Ding Gong’s Demon-Slaying Pill (Formula Bestowed by an Immortal)**\n- Tiger bone\n- Cinnabar\n- True pearl\n- Realgar\n- Orpiment\n- Azurite\n- Female green (a mineral)\n- Ghost’s umbrella (a plant)\n- Gleditsia fruit\n- Platycodon root\n- Peony root\n- Angelica root\n- Atractylodes\n- Lindera root\n- Ghost’s arrow (a plant)\n- Ghost’s overseer (a plant)\n- Flowering reed\n- Sweet flag\n\nGrind each of the eighteen ingredients into powder (two parts each), mix with honey, and form into pills the size of a bullet. Carry one: men on the left, women on the right. No evil will dare approach, dreams will be undisturbed, and the hun and po souls will remain at peace.\n\nFor all matters of dwelling, movement, or illness avoidance, there are auspicious locations—gentlemen who nurture life should employ them. The most significant are the virtues of the year, month, day, and hour.\n\n**Method for Determining the Year’s Virtue**\nIn a *jia* year, virtue resides in *jia*; in a *yi* year, in *geng*. In a *bing* year, virtue resides in *bing*; in a *ding* year, in *ren*. In a *wu* year, virtue resides in *wu*; in a *ji* year, in *jia*. In a *geng* year, virtue resides in *geng*; in a *xin* year, in *bing*. In a *ren* year, virtue resides in *ren*; in a *gui* year, in *wu*.\n\n**Method for Determining the Month’s Virtue**\nIn the first month, virtue is in *ding*; in the second, in *kun*; in the third, in *ren*; in the fourth, in *xin*; in the fifth, in *qian*; in the sixth, in *jia*; in the seventh, in *gui*; in the eighth, in *gen*; in the ninth, in *bing*; in the tenth, in *yi*; in the eleventh, in *xun*; in the twelfth, in *geng*.\n\n**Method for Determining the Day’s Virtue**\nThis follows the year’s virtue: on a *jia* day, virtue resides in *jia*; on a *yi* day, in *geng*, and so on.\n\n**Method for Determining the Hour’s Virtue**\nThis follows the month’s virtue: in the *yin* hour, virtue is in *ding*; in the *mao* hour, in *kun*, and so forth.\n\nThere is also the **Method of Calculating the Wandering Year**:\nBegin with *li* (9), but *qian* (6) does not accept 8, so proceed to *li* (9), then to *dui* (10), *kan* (20), *zhen* (30), *li* (40). *Kun* (2) does not accept 1, so return to *li* (9), then to *dui* (50), continuing in this manner up to 120 years.\n\nWherever the Wandering Year arrives:\n- The first change brings misfortune.\n- A complete change brings the Five Ghosts.\n- A second change brings the Cut-off Life.\n- A complete change of Cut-off Life brings the Six Harms.\n- A third change brings Generative Qi.\n- A complete change of Generative Qi brings the Heavenly Physician’s Return.\n- A complete change of the Wandering Year brings Blessed Virtue.\n\nFor dwelling or relocation, prioritize Generative Qi and Blessed Virtue. To avoid illness, also seek the Heavenly Physician, while considering the correspondences of the myriad things for auspiciousness. Avoid Cut-off Life, Misfortune, the Five Ghosts, and the Six Harms at all costs.\n\nAnother saying holds: *\"Men should avoid Misfortune; women should avoid Cut-off Life.\"*\n\nIf a dwelling has fire, construction, or disturbances in the locations of the Grand Year, Grand Yin, Great General, Monthly Punishment, or Monthly Killing, dig a pit five feet square at the Heavenly Granary, place a thousand catties of stone inside, stack a thousand tiles atop them, and seal with mud—greatly auspicious.",
      "overlap_context": "nd facing the sun, extend both hands, and hold the breath nine times. Tilt the head back, draw in the sunlight, and swallow it nine times to replenish essence and qi, making one strong and preventing the decline of the six and eight (i.e., aging). At moonrise, midnight, and moonset, stand facing the moon, extend both hands, and hold the breath nine times. Tilt the head back, draw in the moonlight, and swallow it to strengthen the yin qi. Women who do this will conceive.\n\n**Dwelling and Abiding**",
      "start_char": 4897,
      "end_char": 6174,
      "start_sentence": 220,
      "end_sentence": 279,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.66968512535095,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\摄生纂录.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "阳宅天仓在丁，正月丙辛日治。 阴宅天仓在癸，七月丁壬日治。 若犯南方，以黑石一枚重十一斤，大豆一斗，埋南墙下，灾祸不起，大吉。 犯东方，以白石一枚，重一十斤，白米一斗，埋束墙下，灾祸消灭，大吉。 犯西方，以赤石一枚，重十二斤，赤小豆一斗，埋西墙，灾害不起，获大吉。 犯北方，以黄石十斤，及雄黄五两，黍米一斗，埋北墙下，大吉。 若犯宅内宫，以青石一枚，重十三斤，青米一斗，埋中庭，大吉。 宅多瘟病，以石百二十斤，埋堂前，去户一丈六尺，吉。 宅内有鬼，以石八十斤，埋壬地，吉。 若动土恐干土气，伤人，埋石於四角各一百一十斤，大吉。 宅多病患，以石一百斤，埋卯地，大吉。 又以黄石九十斤，埋马极下，宜马，获大吉。 又以青石五十斤，埋牛栏内，宜牛，吉。 又季夏，以黄石九十斤，埋庭内，吉。 立春日，以青石三十斤，埋於束壁下，立夏日，以赤石二十斤，埋於南壁下，立秋日，以白石四十斤，埋於西壁下，立冬日，以黑石一百斤，埋於北壁下，皆获大吉。 凡埋石各用当方月德日，其石皆用完全者，皆埋入地三尺，却以酒脯祭其地，主人躬自咒愿。 埋沙法 若太岁在寅午戌，害气在亥； 岁在巳酉丑，害气在寅； 岁在亥卯未，害气在申； 岁在申子辰，害气在巳。 当於害气之地，作坑方深三尺，取束流水内好沙三斗置坑内，内醇酒三斗灌之，然后以土覆之，家人大小各踏其上，以杵筑之，各二七杵，即害气消除，人无灾病。 国邑省寺皆可为之，皆用正月上戊日为之，大吉。 犯土以致病，病多使身体沉重，四肢烦疼，以平旦空腹烧糠，使烟熏鼻及口，吸取少烟，不过三次愈。 老君说河曲父谢天地法 常以辰巳日黄昏晴明时，争扫宅内甲戊丙壬之地，烧香北向，稽首三过，口勿语，但心中默言曰：曾孙某数负黄天，亟蒙上帝之治，愿合家男女大小前后所犯罪过，请为在前消凶，在后进善，令某家大小身神平安。 常行此道，大吉利。 辟盗贼法 取市门土及岁建破月建土和为人，安朱雀地，大吉。 居家辟邪杂用方法立春以富人家田中土涂鳌，令人大吉，富。 六丁日，扫舍，常修之大吉。 正月上巳日，取富人家当门中土涂鳌，亦大吉。 二月上壬日，取道中土和井华水涂鳌，亦大吉。 建日取折车轭悬户上，辟口舌。 埋鹿角於门中及厕中、令人得财。 埋牛蹄於宅四角，亦大吉。 立春日涂所外林前方圆二寸，辟灾。 满日取三家水作酒，大富。 丁亥日左手撮米投鳌中，所愿皆得，大吉。 正月建日，取桃斧枝及故车辗置户内，桃置户外，即鬼永不来。 夜外以所卧状荐上草抽一茎出，可三寸，即鬼魅不来。 忌讳法：埋破履於庭中，子孙有印绶之贵，大吉。 又宅中姓上利地不得安熏秽，西北隅为天门，亦不可粪秽，不可安井厕，务使清洁，大吉，又宅内最大树勿伐之，如自死即除之。 西南种桃，井上勿种桃，桃花入井不祥。 又宅心无种桑种桃，勿种木模，勿簸箕盛粪，勿令破食器入厕中，勿塞井，勿断道路，无故燃火入门皆不祥。 凡作屋，勿续木为柱，及自倒木为柱，皆不祥。 《龙首经》云：春甲乙不伐束方木，夏丙丁不作灰炭，季夏戊己不兴工，动土，秋庚辛不铸写，冬壬癸不穿沟渠，犯此殃家长，大凶。",
      "translated_text": "For yang dwellings, the Heavenly Granary is at *ding*; remedy it on *bing* or *xin* days in the first month. For yin dwellings, the Heavenly Granary is at *gui*; remedy it on *ding* or *ren* days in the seventh month.\n\nIf afflicted in the south, bury one black stone weighing eleven catties and one *dou* of black soybeans beneath the southern wall—disasters will not arise, greatly auspicious. If afflicted in the east, bury one white stone weighing ten catties and one *dou* of white rice beneath the eastern wall—disasters will vanish, greatly auspicious. If afflicted in the west, bury one red stone weighing twelve catties and one *dou* of red adzuki beans beneath the western wall—calamities will not arise, securing great auspiciousness. If afflicted in the north, bury one yellow stone weighing ten catties, five *liang* of realgar, and one *dou* of millet beneath the northern wall—greatly auspicious. If afflicted within the central palace of the dwelling, bury one green stone weighing thirteen catties and one *dou* of green rice in the central courtyard—greatly auspicious.\n\nIf the dwelling suffers frequent epidemics, bury one hundred and twenty catties of stone in front of the hall, one *zhang* and six *chi* from the door—auspicious. If the dwelling is haunted by ghosts, bury eighty catties of stone in the *ren* sector—auspicious. If excavation risks depleting the earth’s qi and harming people, bury one hundred and ten catties of stone at each of the four corners—greatly auspicious. If the dwelling suffers frequent illnesses, bury one hundred catties of stone in the *mao* sector—greatly auspicious. Additionally, bury ninety catties of yellow stone beneath the horse post to benefit horses—greatly auspicious. Bury fifty catties of green stone within the cattle pen to benefit oxen—auspicious.\n\nIn late summer, bury ninety catties of yellow stone in the courtyard—auspicious. On the day of *Lichun*, bury thirty catties of green stone beneath the eastern wall; on the day of *Lixia*, bury twenty catties of red stone beneath the southern wall; on the day of *Liqiu*, bury forty catties of white stone beneath the western wall; on the day of *Lidong*, bury one hundred catties of black stone beneath the northern wall—all securing great auspiciousness.\n\nFor all stone burials, use the day of Monthly Virtue corresponding to the direction. The stones must be whole, buried three *chi* deep, and the site anointed with wine and dried meat as an offering. The master of the house should personally recite a prayer.\n\n**Method of Burying Sand**\nIf the Grand Year resides in *yin*, *wu*, or *xu*, the Harmful Qi is in *hai*; if in *si*, *you*, or *chou*, the Harmful Qi is in *yin*; if in *hai*, *mao*, or *wei*, the Harmful Qi is in *shen*; if in *shen*, *zi*, or *chen*, the Harmful Qi is in *si*. At the location of Harmful Qi, dig a pit three *chi* square and deep, place three *dou* of fine sand from an east-flowing stream into the pit, pour three *dou* of pure wine over it, then cover with earth. All household members, young and old, should tread upon it, tamping it down with a pestle—fourteen strokes each. The Harmful Qi will dissipate, and the household will be free from disasters and illnesses. This method may also be applied to cities, provinces, and temples, preferably on the *wu* day of the first month—greatly auspicious.\n\n**Affliction by Earth Causing Illness**\nSuch illness often manifests as bodily heaviness and aching limbs. At dawn on an empty stomach, burn chaff to produce smoke, fumigate the nose and mouth, and inhale a small amount—recovery will follow within three attempts.\n\n**Lao Jun’s Method for River Bend Father to Thank Heaven and Earth**\nRegularly, on *chen* or *si* days at dusk during clear weather, sweep the *jia*, *wu*, *bing*, and *ren* sectors of the dwelling. Burn incense facing north, bow three times, and remain silent, reciting inwardly: *\"Your descendant [Name] has repeatedly failed the Yellow Heaven and urgently seeks the governance of the Supreme Emperor. May all transgressions committed by every member of this household, past and present, be dissolved in advance, and may goodness be cultivated henceforth. Grant peace to the body-spirits of all in this household.\"*\n\nPracticing this Dao regularly brings great fortune.\n\n**Method to Ward Off Thieves and Bandits**\nTake earth from a market gate and soil from the Destructive Month of the Grand Year’s Establishment, mold them into a figurine, and place it in the Vermilion Bird sector—greatly auspicious.\n\n**Miscellaneous Methods for Dwellings to Ward Off Evil**\nOn *Lichun*, apply soil from a wealthy household’s field to the threshold—greatly auspicious and prosperous. On *liuding* days, sweep the house; regular maintenance brings great auspiciousness. On the *shangsi* day of the first month, apply soil from the center of a wealthy household’s gate to the threshold—also greatly auspicious. On the *ren* day of the second month, mix roadside soil with well water drawn at dawn and apply it to the threshold—also greatly auspicious.\n\nOn Establishment days, hang a broken cart yoke above the door to avert slander. Bury deer antlers within the gate, in the latrine, or elsewhere to attract wealth. Bury ox hooves at the four corners of the dwelling—also greatly auspicious. On *Lichun*, apply a two-*cun* square of soil outside the dwelling’s forest to avert disasters. On a Full Moon day, brew wine with water from three households—great wealth will follow. On a *dinghai* day, scoop rice with the left hand and cast it into the threshold—all wishes will be granted, greatly auspicious.\n\nOn the Establishment day of the first month, place peach-wood axe handles and old cart wheels inside the door, and peach wood outside the door—ghosts will never return. At night, pull a single stalk of straw from the bedding, leaving three *cun* exposed—ghosts and demons will not approach.\n\n**Taboos**\nBurying worn shoes in the courtyard brings official rank and nobility to descendants—greatly auspicious. Do not place foul or filthy things in the auspicious sector of the dwelling’s surname. The northwest corner is the Heavenly Gate; do not defile it with excrement or filth, nor install wells or latrines there. Keep it immaculate—greatly auspicious. Do not fell the largest tree in the dwelling; if it dies naturally, remove it.\n\nDo not plant peach trees in the southwest or near wells—peach blossoms falling into wells are inauspicious. Do not plant mulberry or peach trees in the center of the dwelling, nor plant *momu* trees. Do not use winnowing baskets to hold excrement. Do not discard broken utensils into latrines. Do not block wells or roads. Do not kindle fire and carry it through the gate—all are inauspicious.\n\nWhen constructing a house, do not join wood to make pillars, nor use naturally fallen wood as pillars—both are inauspicious.\n\n*The Dragon Head Classic* states: In spring, do not fell wood in the east on *jia* or *yi* days; in summer, do not produce lime or charcoal on *bing* or *ding* days; in late summer, do not undertake construction or excavation on *wu* or *ji* days; in autumn, do not cast or inscribe on *geng* or *xin* days; in winter, do not dig ditches or canals on *ren* or *gui* days. Violating these brings misfortune to the household’s elders—greatly inauspicious.",
      "overlap_context": "usness. Avoid Cut-off Life, Misfortune, the Five Ghosts, and the Six Harms at all costs.\n\nAnother saying holds: *\"Men should avoid Misfortune; women should avoid Cut-off Life.\"*\n\nIf a dwelling has fire, construction, or disturbances in the locations of the Grand Year, Grand Yin, Great General, Monthly Punishment, or Monthly Killing, dig a pit five feet square at the Heavenly Granary, place a thousand catties of stone inside, stack a thousand tiles atop them, and seal with mud—greatly auspicious.",
      "start_char": 6174,
      "end_char": 7447,
      "start_sentence": 280,
      "end_sentence": 326,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.454479694366455,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\摄生纂录.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "春夏为阳，不行刑戮，秋冬为阴，不可开凿。 犯者殃及其身。 又阴阳家云：卖宅钱不可买生口，卖驴马钱不可取妇，皆大凶妨。 又马有的卢，勿乘之。 黄马后足白，并犬胸黄耳黑，并勿畜之。 又黄马牛生黑犊，勿畜。 凡欲修造运为皆须选择时日，但依六壬黄黑道图最妙，寅申岁、乙辛黄，丁癸黄。 卯酉岁、乾巽黄，坤艮黄。 辰戍岁、丙壬黄，甲庚黄。 己亥岁、丁癸黄，乙辛黄。 子午岁、坤艮黄，乾巽黄。 丑未岁。 甲庚黄，丙壬黄。 右此为岁黄道。 若修造当依此地皆吉，余地皆凶。 若远行、移徙、嫁娶、产妇、病人疗医，此地吉。 又月黄道法最验，皆依节气用之。 正月、七月，丑辰巳未为黄道，余并为黑道。 二月、八月，卯午未酒为黄道，余并为黑道。 三月、九月，巳申酉亥为黄道，余并为黑道，四月、十月，未戌亥丑为黄道，余并为黑道。 五月、十一月，酉子丑卯为黄道，余并为黑道。 六月、十二月，亥寅卯巳为黄道，余并为黑道。 凡营造起动、政故造新、移徙远行、嫁娶临官、产妇、避病逐医，得黄道即大吉，黑道大凶。 虽是黄道，若此年将军、太岁、刑祸、土公在道，亦宜避之。 一说云：若黄道诸无所忌。 又说云：凡一切运为但得天赦日，地上五百神皆上天，日无所忌，兼用岁月日时德仍与岁月黄道有合处，其人大受福德。 若须举动，不能全具者，但得一两处吉即好。 若犯岁月黑道及诸犯触未发，即须治之所犯之处，五功已下为小犯，五功已上为大犯，即取黄道及岁月＇德上，及中庭可掘土深一尺已上，各取土五升相和，筛之令细，以酒五升、熏陆、白檀、零陵、青木、沉香等，各一两许细切，水煮之，水无限，以酒和之，将所取土共搅和，作泥如煎饼。 泥以新曹帚将此泥扫，岁月黄及岁月德，墙壁上及堂屋房舍皆扫之。 若大犯则扫二丈已下，一丈已上； 小犯则扫三尺已上，一丈已来。 随其高下，若是墙则尽高下，须是家中子弟及家长自扫。 此日不得高声慎怒。 凡阳宅丈夫扫外，阴宅妇人扫内，皆须着新争衣，若不知阴阳则内外俱扫。 扫讫仍须扫鳌。 凡和泥水慎无杀虫。 此法神奥，卒难言尽，君子勿可轻也。 凡人初入宅及入官舍，皆不欲吊丧问疾，不欲言恶事，不欲登高临深，不欲窥井厕，不欲悲哀忿怒，亦不欲亲刑戮，兴工动土并不吉。 凡临官视事亦须择日。 拜官日，春用寅、卯、巳、戌，夏用巳、午、申、丑，秋用申、酉、亥、辰，冬用亥、子、寅、未。 及遇建满平定成等日中华道藏第二十三册 并吉。 授官拜日相克，若甲乙授官不以庚辛日上，庚辛日授官不以丙丁日上，丙丁日授官不以壬癸日上，壬癸日授官不以戊己日上，戊己日授官不以甲乙日上。 又法，春忌庚辛，夏忌壬癸，秋忌甲乙，冬忌丙丁，是四废日，不可临官视事。 又不用正月、二月、三月下旬，四月、七月、九月上旬，十月中旬，十二月下旬，十一月上旬，五月三旬，悉不可临官视事，皆大凶妨，设有福德犹遇他灾患。 行旅篇 凡人欲辞家行动，先须选择良日，不可率然，以托其福。 每月一日、十一日、十三日、十九日，二十三日、二十八日号为石门日，宜行，入官所求皆得，大吉。 二日、八日、十四日、二十日、二十九日为盗门日，行有大忧，遇盗，大凶。",
      "translated_text": "Spring and summer belong to yang; do not carry out executions or punishments. Autumn and winter belong to yin; do not undertake excavation. Violating these brings misfortune upon oneself.\n\nThe School of Yin-Yang further states: Money from selling a house must not be used to purchase livestock; money from selling donkeys or horses must not be used to take a wife—both are greatly inauspicious and bring harm. Moreover, do not ride a horse with a *dilu* marking. Do not raise a yellow horse with white hind legs, nor a dog with a yellow chest and black ears. Do not raise a black calf born to a yellow horse or cow. For all construction, repairs, or undertakings, one must select an auspicious time and day. Following the *Six Ren Yellow and Black Dao Chart* is most effective:\n\n- In *yin-shen* and *yi-xin* years: *yi* and *xin* are Yellow; *ding* and *gui* are Yellow.\n- In *mao-you* years: *qian* and *xun* are Yellow; *kun* and *gen* are Yellow.\n- In *chen-xu* years: *bing* and *ren* are Yellow; *jia* and *geng* are Yellow.\n- In *si-hai* years: *ding* and *gui* are Yellow; *yi* and *xin* are Yellow.\n- In *zi-wu* years: *kun* and *gen* are Yellow; *qian* and *xun* are Yellow.\n- In *chou-wei* years: *jia* and *geng* are Yellow; *bing* and *ren* are Yellow.\n\nThese are the Yellow Dao of the year. For construction, following these directions ensures great auspiciousness; all other directions are inauspicious. For long journeys, relocation, marriage, childbirth, or medical treatment for the sick, these directions are also auspicious.\n\nThe method of the Monthly Yellow Dao is most reliable and is applied according to the solar terms:\n\n- In the first and seventh months: *chou*, *chen*, *si*, and *wei* are Yellow Dao; all others are Black Dao.\n- In the second and eighth months: *mao*, *wu*, *wei*, and *you* are Yellow Dao; all others are Black Dao.\n- In the third and ninth months: *si*, *shen*, *you*, and *hai* are Yellow Dao; all others are Black Dao.\n- In the fourth and tenth months: *wei*, *xu*, *hai*, and *chou* are Yellow Dao; all others are Black Dao.\n- In the fifth and eleventh months: *you*, *zi*, *chou*, and *mao* are Yellow Dao; all others are Black Dao.\n- In the sixth and twelfth months: *hai*, *yin*, *mao*, and *si* are Yellow Dao; all others are Black Dao.\n\nFor construction, renovation, relocation, travel, marriage, official appointments, childbirth, or seeking medical treatment, acting on Yellow Dao days brings great auspiciousness, while Black Dao days bring great misfortune. Even on Yellow Dao days, if the *General*, *Grand Year*, *Punishment*, *Calamity*, or *Earth Duke* resides in the direction, one should avoid it.\n\nOne account states: If the Yellow Dao has no taboos, it is entirely auspicious. Another states: For all undertakings, if one acts on a *Heavenly Amnesty Day*, when the five hundred earthly spirits ascend to heaven, the day is free of taboos. If one further aligns with the *Virtue* of the year, month, day, and hour, as well as the Yellow Dao of the year and month, one will receive great blessings. If unable to fulfill all conditions, even one or two auspicious factors will suffice. If one violates the Black Dao of the year or month or incurs other offenses that have not yet manifested, one must remedy the transgression at the site of the violation. Offenses involving five *gong* or fewer are minor; those exceeding five *gong* are major. On a Yellow Dao day or a day of *Virtue* for the year or month, dig soil from the central courtyard to a depth of one *chi* or more, taking five *sheng* of soil from each location. Sift the soil finely, then mix it with five *sheng* of wine, one *liang* each of *xunlu*, white sandalwood, *lingling* fragrance, *qingmu*, and *chenxiang* (all finely chopped). Boil the mixture in water (no fixed amount), then blend it with the wine and soil to form a paste like a pancake. Using a new broom, sweep this paste onto the walls and beams of the Yellow Dao and *Virtue* locations for the year and month, as well as the main hall and rooms. For major offenses, sweep from two *zhang* down to one *zhang*; for minor offenses, from three *chi* up to one *zhang*. Adjust according to height; if sweeping a wall, cover its full height. Only family members—children or the household head—should perform the sweeping. On this day, avoid loud voices and anger.\n\nFor yang residences, the husband sweeps the exterior; for yin residences, the wife sweeps the interior. Both must wear new clothes. If yin and yang are unclear, sweep both inside and outside. After sweeping, also sweep the *ao* (threshold). When mixing the paste, take care not to kill any insects. This method is profoundly efficacious, and its subtleties cannot be fully explained—gentlemen must not treat it lightly.\n\nWhen first entering a new residence or official quarters, avoid mourning, visiting the sick, speaking of ill fortune, climbing heights or gazing into depths, peering into wells or latrines, indulging in sorrow or anger, or witnessing punishments or construction—all are inauspicious.\n\nWhen assuming office, one must also select an auspicious day. For the day of appointment:\n- In spring: *yin*, *mao*, *si*, and *xu* are auspicious.\n- In summer: *si*, *wu*, *shen*, and *chou* are auspicious.\n- In autumn: *shen*, *you*, *hai*, and *chen* are auspicious.\n- In winter: *hai*, *zi*, *yin*, and *wei* are auspicious.\n\nDays such as *Jian*, *Man*, *Ping*, *Ding*, and *Cheng* are also auspicious. When appointing an official, avoid clashing days: if appointed on a *jia* or *yi* day, do not assume office on a *geng* or *xin* day; if appointed on a *geng* or *xin* day, do not assume office on a *bing* or *ding* day; if appointed on a *bing* or *ding* day, do not assume office on a *ren* or *gui* day; if appointed on a *ren* or *gui* day, do not assume office on a *wu* or *ji* day; if appointed on a *wu* or *ji* day, do not assume office on a *jia* or *yi* day.\n\nAnother method: In spring, avoid *geng* and *xin* days",
      "overlap_context": "fallen wood as pillars—both are inauspicious.\n\n*The Dragon Head Classic* states: In spring, do not fell wood in the east on *jia* or *yi* days; in summer, do not produce lime or charcoal on *bing* or *ding* days; in late summer, do not undertake construction or excavation on *wu* or *ji* days; in autumn, do not cast or inscribe on *geng* or *xin* days; in winter, do not dig ditches or canals on *ren* or *gui* days. Violating these brings misfortune to the household’s elders—greatly inauspicious.",
      "start_char": 7447,
      "end_char": 8709,
      "start_sentence": 327,
      "end_sentence": 375,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.126911640167236,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\摄生纂录.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "三日、九日、十五日、三十日为财门日，宜入官嫁娶，百事吉。 十六日、二十二日、二十五日、十日为阳门日，宜行百事，吉。 十七日、二十一日、二十六日为官门日，宜行入官，百事吉。 十二日、十八日、二十四日、二十七日为侯门，日行有口舌大凶。 凡遇死丧大凶。 子日南行大凶，北行小吉，东行得财，西行有喜； 丑日，南行有所得，北行小吉，束行大好，西行不成； 寅日，南行大好，北行小吉，束行留滞，西行大吉； 卯日南行有所得，北行大吉，束行呵留，西行大吉； 辰日南行有酒食，北行见呵留，束行大吉，西行凶。 巳日，南行小好，北行得财，束行逢凶，西行小吉； 未日，南行逢吏，北行凶，束行好，西行不成。 申酉日南行不吉，北行好，束行大吉，西行大吉。 戌日南行得财，北行不成，束行凶，西行凶。 亥日南行得财，北行不成，束行小吉，西行大凶。 凡行日虽据此图，亦看当年历日，遇建满平定开日弥吉，丑、寅、卯、辰、巳、午、未、申时南行大吉，丑、寅、卯、巳、未、申、酉、亥时北行大吉。 子、丑、卯、午、未、戌时，西行大吉，得财。 子、丑、寅、午、未时束行，皆吉。 凡行日时皆可审推按之。 又四方相厌法：束行者，持钱九文，行九里弃之而去。 南行者，持水一器，行六里弃之而去。 西行者，持炭七斤，行七里弃之而去。 北行者，持土五斤，行五里弃之而去。 大吉，所求如愿。 又云：凡欲行者，以左把米投井中，大吉。 又说：五离日不可远行。 忽行在路遇大风、雾、雷、电，当是龙神所过之处，当入室避之，不尔久必重病。 若凌晨在山水中及风露中行，大损人，不得不饮酒佩雄黄为佳。 经云：人出门远行皆诵咒曰： 六甲九章，天圆地方。 四时五行，日月为光。 禹为治道，蚩尤辟兵。 苍龙挟卫，白虎扶行。 荧惑先引，辟除不 祥。 北斗诛罚，除去凶殃。 五神从我，周游四方。 左社右稷，寇贼厌伏。 行者有喜，用者得福。 五行从我，所愿皆得。 急急如律令！ 诵此咒三遍，乃以水嘤所去之方，大吉利。 凡出行遇神庙之所，勿入之，若入必须恭敬，不得举月恣意顾瞻，如对严君，必获其福。 凡行旅适丧孝之所，必当乘白马，从髯奴，大吉。 若行路见美女，慎勿熟视之，或是鬼魅之异物也。 六十甲子 甲子王文卿从官十八人",
      "translated_text": "The third, ninth, fifteenth, and thirtieth days of the month are *Cai Men* (Wealth Gate) days, auspicious for assuming office, marriage, and all undertakings. The sixteenth, twenty-second, twenty-fifth, and tenth days are *Yang Men* (Yang Gate) days, auspicious for all activities. The seventeenth, twenty-first, and twenty-sixth days are *Guan Men* (Official Gate) days, auspicious for assuming office and all undertakings. The twelfth, eighteenth, twenty-fourth, and twenty-seventh days are *Hou Men* (Waiting Gate) days, during which travel may invite disputes and misfortune. All days of mourning are inauspicious.\n\nOn *zi* days: traveling south is highly inauspicious; traveling north brings minor fortune; traveling east yields wealth; traveling west brings joy.\nOn *chou* days: traveling south brings gains; traveling north brings minor fortune; traveling east is highly auspicious; traveling west fails.\nOn *yin* days: traveling south is highly auspicious; traveling north brings minor fortune; traveling east leads to delays; traveling west is highly auspicious.\nOn *mao* days: traveling south brings gains; traveling north is highly auspicious; traveling east invites reprimands and delays; traveling west is highly auspicious.\nOn *chen* days: traveling south brings feasts; traveling north invites reprimands and delays; traveling east is highly auspicious; traveling west is inauspicious.\nOn *si* days: traveling south is moderately auspicious; traveling north yields wealth; traveling east encounters misfortune; traveling west brings minor fortune.\nOn *wei* days: traveling south encounters officials; traveling north is inauspicious; traveling east is auspicious; traveling west fails.\nOn *shen* and *you* days: traveling south is inauspicious; traveling north is auspicious; traveling east is highly auspicious; traveling west is highly auspicious.\nOn *xu* days: traveling south yields wealth; traveling north fails; traveling east is inauspicious; traveling west is inauspicious.\nOn *hai* days: traveling south yields wealth; traveling north fails; traveling east brings minor fortune; traveling west is highly inauspicious.\n\nThough travel days are determined by this chart, one should also consult the annual almanac. Days of *Jian* (Establishing), *Man* (Full), *Ping* (Level), *Ding* (Stable), and *Kai* (Opening) are especially auspicious. During the hours of *chou*, *yin*, *mao*, *chen*, *si*, *wu*, *wei*, and *shen*, traveling south is highly auspicious. During the hours of *chou*, *yin*, *mao*, *si*, *wei*, *shen*, *you*, and *hai*, traveling north is highly auspicious. During the hours of *zi*, *chou*, *mao*, *wu*, *wei*, and *xu*, traveling west is highly auspicious and yields wealth. During the hours of *zi*, *chou*, *yin*, *wu*, and *wei*, traveling east is auspicious. All travel days and hours should be carefully considered.\n\nAnother method for warding off directional taboos:\nFor those traveling east: carry nine coins, walk nine *li*, then discard them and depart.\nFor those traveling south: carry a vessel of water, walk six *li*, then discard it and depart.\nFor those traveling west: carry seven *jin* of charcoal, walk seven *li*, then discard it and depart.\nFor those traveling north: carry five *jin* of earth, walk five *li*, then discard it and depart.\nThis ensures great fortune and the fulfillment of all wishes.\n\nIt is also said: Before traveling, take a handful of rice in the left hand and cast it into a well—this brings great fortune.\nAdditionally: The *Wu Li* (Five Separations) days are inauspicious for long journeys.\n\nIf, while traveling, one encounters strong winds, fog, thunder, or lightning, it is the passage of dragon spirits. One should enter a dwelling to avoid them; failure to do so may result in prolonged illness. Traveling at dawn through mountains, waters, or wind and dew is highly harmful. Drinking wine and wearing realgar (*xiong huang*) is advisable.\n\nThe scripture states: Those embarking on long journeys should recite the following incantation:\n*\"The Six Jia of the Nine Chapters, heaven is round and earth is square.\nThe four seasons and five phases, the sun and moon give light.\nYu ordered the roads, Chi You warded off weapons.\nThe Azure Dragon guards, the White Tiger accompanies.\nMars leads the way, dispelling misfortune.\nThe Northern Dipper executes punishment, removing calamities.\nFive spirits follow me, roaming the four directions.\nLeft, the gods of soil; right, the gods of grain—bandits and thieves are suppressed.\nTravelers rejoice, users gain fortune.\nThe five phases obey me, all wishes are fulfilled.\nSwiftly, swiftly, as in law and decree!\"*\n\nRecite this incantation three times, then spit water toward the direction of travel—this brings great fortune.\n\nWhen traveling, avoid entering temples. If one must enter, do so with reverence, refraining from casual observation, as if facing a stern lord—this ensures blessings. When passing through a place of mourning, riding a white horse followed by a bearded servant brings great fortune. If one encounters a beautiful woman on the road, avoid gazing at her, for she may be a ghostly apparition.\n\nThe Sixty *Jiazi*:\n*Jiazi*, Wang Wenqing, accompanied by eighteen officials...",
      "overlap_context": "al, avoid clashing days: if appointed on a *jia* or *yi* day, do not assume office on a *geng* or *xin* day; if appointed on a *geng* or *xin* day, do not assume office on a *bing* or *ding* day; if appointed on a *bing* or *ding* day, do not assume office on a *ren* or *gui* day; if appointed on a *ren* or *gui* day, do not assume office on a *wu* or *ji* day; if appointed on a *wu* or *ji* day, do not assume office on a *jia* or *yi* day.\n\nAnother method: In spring, avoid *geng* and *xin* days",
      "start_char": 8710,
      "end_char": 9627,
      "start_sentence": 376,
      "end_sentence": 422,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.36949896812439,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\摄生纂录.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "乙丑龙季卿从官十六人金 丙寅张仲卿从官十四人 丁卯司马卿从官十二人火 戊辰季楚卿从官十八人 己巳何文昌从官十二人木 庚午冯仲卿从官十七人 辛未王文章从官十五人土 壬申侯博卿从官十三人 癸酉孙仲房从官十一人金 甲戌展子江从官十四人 乙亥庞明公从官十二人火 丙子邢孙卿从官十六人 丁丑赵子玉从官十四人 水戊寅虞子卿从官十二人 己卯石文阳从官＋五人 土庚辰尹佳卿从官士二人 辛巳阳仲公从官十一人金 壬午马子明从官十二人 癸未吕威明从官士二人木 甲申扈文长从官十六人 乙酉孔利公从官十四人水 丙戌车元升从官十二人 丁亥张文通从官十人土 戊子乐石阳从官十人 己丑范和卿从官十四人火 庚寅楮进卿从官＋五人 辛卯郭子良从官十三人木 壬辰武稚卿从官十一人 癸巳史公来从官九人水 甲午卫上卿从官＋八人 乙未杜仲阳从官十六人金 丙申朱伯众从官十四人 丁酉臧文公从官十二人火 戊戌范少卿从官十人 己亥邓都卿从官士二人木 庚子阳仲叔从官十七人 辛丑林卫公从官十五人土 壬寅丘孟卿从官十三人 癸卯苏他家从官十一人金 甲辰孟非卿从官十四人 乙巳唐文卿从官十二人火 丙午魏文公从官十六人 丁未石叔通从官十四人水 戊申范伯阳从官十二人 己酉成文长从官＋五人土 庚戌史子仁从官十三人 辛亥左子行从官十一人金 壬子宿上卿从官十五人 癸丑江汉卿从官士1 一人木 甲寅明文章从官十六人 乙卯戴公阳从官十四人水 丙辰霍叔英从官十二人 丁巳崔巨卿从官九人土 戊午从元光从官十四人 己未时通卿从官十七人火 庚申华文阳从官＋五人 辛酉邮元玉从官十二人木 壬戌乐进卿从官士二人 癸亥左石松从官九人水",
      "translated_text": "**Yichou**, Long Jiqing, accompanied by sixteen officials—Metal.\n**Bingyin**, Zhang Zhongqing, accompanied by fourteen officials.\n**Dingmao**, Sima Qing, accompanied by twelve officials—Fire.\n**Wuchen**, Ji Chuqing, accompanied by eighteen officials.\n**Jisi**, He Wenchang, accompanied by twelve officials—Wood.\n**Gengwu**, Feng Zhongqing, accompanied by seventeen officials.\n**Xinwei**, Wang Wenzhang, accompanied by fifteen officials—Earth.\n**Renshen**, Hou Boqing, accompanied by thirteen officials.\n**Guiyou**, Sun Zhongfang, accompanied by eleven officials—Metal.\n** Jiaxu**, Zhan Zijiang, accompanied by fourteen officials.\n**Yihai**, Pang Minggong, accompanied by twelve officials—Fire.\n**Bingzi**, Xing Sunqing, accompanied by sixteen officials.\n**Dingchou**, Zhao Ziyu, accompanied by fourteen officials—Water.\n**Wuyin**, Yu Ziqing, accompanied by twelve officials.\n**Jimao**, Shi Wenyang, accompanied by fifteen officials—Earth.\n**Gengchen**, Yin Jiaqing, accompanied by twelve officials.\n**Xinsi**, Yang Zhonggong, accompanied by eleven officials—Metal.\n**Renwu**, Ma Ziming, accompanied by twelve officials.\n**Guiwei**, Lü Weiming, accompanied by twelve officials—Wood.\n**Jiashen**, Hu Wenchang, accompanied by sixteen officials.\n**Yiyou**, Kong Ligong, accompanied by fourteen officials—Water.\n**Bingxu**, Che Yuansheng, accompanied by twelve officials.\n**Dinghai**, Zhang Wentong, accompanied by ten officials—Earth.\n**Wuzi**, Yue Shiyang, accompanied by ten officials.\n**Jichou**, Fan Heqing, accompanied by fourteen officials—Fire.\n**Gengyin**, Chu Jinqing, accompanied by fifteen officials.\n**Xinmao**, Guo Ziliang, accompanied by thirteen officials—Wood.\n**Renchen**, Wu Zhiqing, accompanied by eleven officials.\n**Guisi**, Shi Gonglai, accompanied by nine officials—Water.\n**Jiawu**, Wei Shangqing, accompanied by eighteen officials.\n**Yiwei**, Du Zhongyang, accompanied by sixteen officials—Metal.\n**Bingshen**, Zhu Bozhong, accompanied by fourteen officials.\n**Dingyou**, Zang Wengong, accompanied by twelve officials—Fire.\n**Wuxu**, Fan Shaoqing, accompanied by ten officials.\n**Jihai**, Deng Duqing, accompanied by twelve officials—Wood.\n**Gengzi**, Yang Zhongshu, accompanied by seventeen officials.\n**Xinchou**, Lin Weigong, accompanied by fifteen officials—Earth.\n**Renyin**, Qiu Mengqing, accompanied by thirteen officials.\n**Guimao**, Su Tajia, accompanied by eleven officials—Metal.\n**Jiachen**, Meng Feiqing, accompanied by fourteen officials.\n**Yisi**, Tang Wenqing, accompanied by twelve officials—Fire.\n**Bingwu**, Wei Wengong, accompanied by sixteen officials.\n**Dingwei**, Shi Shutong, accompanied by fourteen officials—Water.\n**Wushen**, Fan Boyang, accompanied by twelve officials.\n**Jiyou**, Cheng Wenchang, accompanied by fifteen officials—Earth.\n**Gengxu**, Shi Ziren, accompanied by thirteen officials.\n**Xinhai**, Zuo Zixing, accompanied by eleven officials—Metal.\n**Renzi**, Su Shangqing, accompanied by fifteen officials.\n**Guichou**, Jiang Hanqing, accompanied by one official—Wood.\n**Jiayin**, Ming Wenzhang, accompanied by sixteen officials.\n**Yimao**, Dai Gongyang, accompanied by fourteen officials—Water.\n**Bingchen**, Huo Shuying, accompanied by twelve officials.\n**Dingsi**, Cui Juqing, accompanied by nine officials—Earth.\n**Wuwu**, Cong Yuanguang, accompanied by fourteen officials.\n**Jiwei**, Shi Tongqing, accompanied by seventeen officials—Fire.\n**Gengshen**, Hua Wenyang, accompanied by fifteen officials.\n**Xinyou**, You Yuanyu, accompanied by twelve officials—Wood.\n**Renxu**, Yue Jinqing, accompanied by two officials.\n**Guihai**, Zuo Shisong, accompanied by nine officials—Water.",
      "overlap_context": "vel—this brings great fortune.\n\nWhen traveling, avoid entering temples. If one must enter, do so with reverence, refraining from casual observation, as if facing a stern lord—this ensures blessings. When passing through a place of mourning, riding a white horse followed by a bearded servant brings great fortune. If one encounters a beautiful woman on the road, avoid gazing at her, for she may be a ghostly apparition.\n\nThe Sixty *Jiazi*:\n*Jiazi*, Wang Wenqing, accompanied by eighteen officials...",
      "start_char": 9627,
      "end_char": 10420,
      "start_sentence": 423,
      "end_sentence": 481,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.877921104431152,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\摄生纂录.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "凡人出游异方，登山涉水，忧虎狼之害，惧瘴疠之灾，或进谒公侯，或伏兵对寇，皆当随日呼其神名，与己俱行以自卫，则百恶皆伏，所行大吉。 若其年有厄，即叩齿呼行年本命之辰及今日之神，竟年并呼之，百凶自去，常行不绝，必致长生。 行此道者，至其日勿食所属之肉，大吉。 辟兵之道，但能知北斗及日月字，则不畏白刃，但常诵五兵之名，亦神验。 刀名大房，虚星主之； 弓名曲张，土星主之； 矢名仿惶，荧惑星主之； 矛名矢伤，角星主之； 弩名远望，张星主之； 戟名大将，参星主之。 临敌细祝之，大有明效。 或以月蚀时刻，三岁蟾赊下有八字者，以其血书所持之刀剑，大效。 或以交锋之际，乘魁履刚呼四方之长，亦有效也。 ， 又法：五月五日书赤灵符，及西王母兵信神符数十符，皆辟兵之道也。 山无高下，皆有神灵。 若欲升之，必选时日，皆以五色缯各五寸悬大石，所求必得。 若畏虎狼山精之属，当佩黄神章及玉神符，或烧牛羊角。 畏虺蛇之属，必佩蜈蚣、麝香，又佩武都雄黄三两已上，则不敢近人矣。 又诵仪康入山不逢虎，心念仪方入泽不逢蛇，又烧牛羊角，行则虎狼不敢近人，大吉。 又法：未至山，百步先却，百步反足，乃登之，百邪皆走。 若已为蛇所中，则以少许雄黄末纳疮中，亦立愈矣。 若畏山川庙座百鬼之法，常带三皇文、五岳真形图、天水符及上皇竹使符、及白泽图、九鼎记则邪自却。 若常存真一，则不须符药也。 又水无大小，皆难冒涉，若江河淮海。 畏蛟龙者，皆当先於水次破鹦子一枚，以少许粉杂香末合搅器水中，以自洗惧，则不畏风波。 又习闭气至千息，久能居水中。 又得通天犀角长寸已上，刻为鱼口衔之，以入水。 水常开三尺，人得水中气息。 若江南沙湿之处，有沙虱水弩之属，大为人害，可带生麝香及神符、金丹皆辟之，若能常存真一，则百毒不犯者矣。 摄生慕录竟 #1僵：疑为『偃』之误。 #2陈：疑为『炼』之误。 #3热：疑为『然』之误。 #4 者：疑为『吉』之误。 #5以下诸『 僵一字均疑误。",
      "translated_text": "When traveling to foreign lands, ascending mountains, or crossing waters, one must fear the harm of tigers and wolves and dread the scourge of miasmic pestilence. Whether paying respects to lords and nobles or facing bandits in battle, one should invoke the names of the gods corresponding to each day and keep them close for self-protection—thus, all evils will submit, and every journey will be greatly auspicious. If one encounters misfortune in a given year, one should clench the teeth and call upon the spirit of the year’s own celestial stem-branch and the god of the present day, invoking them throughout the year. All calamities will depart, and by maintaining this practice without cease, one will surely attain longevity.\n\nThose who follow this Way must, on the appointed day, refrain from eating the flesh of the creature governed by that day—this brings great fortune.\n\nTo ward off weapons, one need only know the names of the Northern Dipper and the characters of the sun and moon, and one will fear no blade. Merely reciting the names of the Five Weapons will also yield divine efficacy. The sword is called *Great Chamber*, governed by the Void Star; the bow, *Curved Bow*, governed by the Earth Star; the arrow, *Fleeting Panic*, governed by the Sparkling Deluder Star; the spear, *Piercing Wound*, governed by the Horn Star; the crossbow, *Distant Gaze*, governed by the Spread Star; the halberd, *Great General*, governed by the Three Stars. Whispering these invocations before battle brings manifest results.\n\nAlternatively, during a lunar eclipse, one may inscribe the blade with the eight characters found beneath the three-year-old toad’s tongue, using its blood—this is highly effective. Or, in the heat of combat, one may tread upon the *Kui* and *Gang* stars while calling upon the Lords of the Four Directions—this, too, proves efficacious.\n\nAnother method: On the fifth day of the fifth month, inscribe the *Red Spirit Talisman* and several dozen *Queen Mother of the West’s Military Dispatch Talismans*—all are ways to repel weapons.\n\nMountains, regardless of height, are inhabited by spirits. To ascend them, one must choose an auspicious time and day, hanging five-inch squares of five-colored silk from a large stone—thus, all requests will be granted. To ward off tigers, wolves, and mountain spirits, carry the *Yellow Spirit Chapter* and *Jade Spirit Talisman*, or burn ox and sheep horns. To repel vipers and serpents, wear centipedes and musk, or carry at least three *liang* of Wudu realgar—then they will not dare approach. Reciting *Yi Kang’s* verse *\"Entering the mountains, I meet no tiger\"* in one’s heart, or *Yi Fang’s* *\"Entering the marshes, I meet no snake,\"* and burning ox or sheep horns while traveling will keep tigers and wolves at bay—greatly auspicious.\n\nAnother method: Before reaching the mountain, retreat a hundred paces, then walk backward a hundred paces before ascending—all evil spirits will flee. If bitten by a snake, insert a small amount of realgar powder into the wound, and it will heal immediately.\n\nTo guard against the myriad ghosts of mountain and river shrines, always carry the *Scripture of the Three Sovereigns*, the *True Forms of the Five Peaks*, the *Heavenly Water Talisman*, the *Supreme Sovereign’s Bamboo Messenger Talisman*, the *White Marsh Chart*, and the *Record of the Nine Tripods*—thus, evil will retreat of its own accord. If one constantly preserves the *True One*, no talismans or medicines are needed.\n\nWaters, regardless of size, are perilous to cross—whether rivers, the Huai, or the sea. To fear no dragons, first break a magpie’s egg by the water’s edge, mix a small amount of its powder with incense, and stir it into the water to wash oneself—then one will fear no wind or waves. By practicing breath-holding until one can sustain a thousand breaths, one may remain underwater for long periods. Alternatively, obtain a piece of *tongtian* rhinoceros horn at least an inch long, carve it into the shape of a fish’s mouth, and hold it in the mouth when entering water—the water will part three feet, allowing one to breathe beneath the surface.\n\nIn the damp sands of the south, creatures like sand fleas and water crossbows pose great harm. Carry raw musk, spirit talismans, or golden elixirs to repel them. If one constantly preserves the *True One*, no poisons will assail them.\n\n*The Record of Yearning for Life and Longing for Longevity* concludes.",
      "overlap_context": "icials—Water.\n**Bingchen**, Huo Shuying, accompanied by twelve officials.\n**Dingsi**, Cui Juqing, accompanied by nine officials—Earth.\n**Wuwu**, Cong Yuanguang, accompanied by fourteen officials.\n**Jiwei**, Shi Tongqing, accompanied by seventeen officials—Fire.\n**Gengshen**, Hua Wenyang, accompanied by fifteen officials.\n**Xinyou**, You Yuanyu, accompanied by twelve officials—Wood.\n**Renxu**, Yue Jinqing, accompanied by two officials.\n**Guihai**, Zuo Shisong, accompanied by nine officials—Water.",
      "start_char": 10420,
      "end_char": 11226,
      "start_sentence": 482,
      "end_sentence": 517,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.762964725494385,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\摄生纂录.txt",
        "category": "众术类"
      }
    }
  ]
}