{
  "source_id": "无上大乘要诀妙经",
  "source_file": "chunked_daozang\\无上大乘要诀妙经.json",
  "total_chunks": 5,
  "total_original_chars": 4264,
  "total_translated_chars": 22859,
  "total_translation_time": 117.75978136062622,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\本文类\\无上大乘要诀妙经.txt",
    "category": "本文类"
  },
  "full_translation": "*The Supreme Mahāyāna Esoteric Sūtra of Essential Precepts*\n\nThus have I heard: In the Dragon-Han era, the Heavenly Worthy manifested within the Land of Great Blessing Hall, transforming into a spontaneous seven-jeweled mystic terrace adorned with myriad precious grains. Banners and flowered canopies enveloped the entire realm. Seated in equipoise at its center, he radiated boundless luminosity, illumining the ten directions and all worlds without limit, so that all became resplendently clear.\n\nAt that time, the assembly of great holy deities, Flying Heavenly Spirit-Kings, Cinnabar Numinous Perfected Elders, the Three Qi Heavenly Lords of the Supreme, the Jade Dawn Highest August Perfected Ones, the Left and Right Two Perfected, and immeasurable hosts gathered as one. The Great Demon Kings of the Three Realms, Dragon Kings of the Ten Thousand Seas, and Immortals of the ten directions arrived upon beams of light, offering priceless treasures. Incense of a hundred harmonies perfumed the air without burning, and celestial music resounded in unison.\n\nThe Primordial Heavenly King addressed the Supreme Great Dao Lord, saying: \"You have accumulated vast merit, attained the wisdom of the Dao, and instructed sentient beings, delivering all without exception. The Three Expedients are now mastered, and the lineage of the myriad sages is complete. Yet you have not yet received this Supreme Mahāyāna Esoteric Precept—the ultimate, eternally abiding Dharma of boundless profundity. Through kalpas of accumulated virtue, the fruit is now ripe.\"\n\nThereupon, he bestowed the Supreme Mahāyāna Esoteric Precept: \"The supreme Dharma transcends form above and depth below. Through it, the ultimate Dharma-body attains irreversible realization, its station equal to mine. I entrust you with the Three Vehicles’ teachings to deliver sentient beings. You must diligently cultivate the mind of great compassion, enabling all beings to escape affliction, transcend the Three Realms, and cross the bridge you provide.\"\n\nThen, the Supreme Dao Lord rose from his seat, bowed deeply, and received the prophecy, declaring: \"Today, hearing this Dharma-sound, my heart leaps with joy—such has never been before! Why is this? Since first studying the Dao, I have dwelled alone in mountains and forests, sitting or walking, ever pondering: *I too have entered the Dharma-nature—why then has the Heavenly Worthy delivered me with the lesser vehicle?* Yet this is my own fault, not the Heavenly Worthy’s. Why is this?\"\n\n\"If I had resolved my mind to cultivate the profound wisdom of the Cavernous Illightenment, I would surely have been delivered by the Great Vehicle. Yet our wisdom was shallow—upon hearing of the Daoist teachings, we merely believed and accepted them, thus attaining immortality and dwelling for eons, never once hearing of this boundless Great Vehicle Dharma. Today, by your gracious instruction, my doubts and misgivings dissolve entirely. Only now do I realize I am a true child of the Dao, born of the Dao, transformed by the Dharma.\"\n\nThereupon, the Supreme Dao Lord, overcome with joy and relief, extolled in verse:\n\nI hear this Dharma-sound,\nAttaining what was never before.\nMy heart brims with boundless joy,\nAll doubts crumble to dust.\nNow I shall not lose the Great Vehicle,\nMy life undying, everlasting.\nIt dispels the afflictions of beings—\nHearing it, all my leaks are healed.\nOnce clinging to the lesser vehicle,\nI reproached myself for the gravest fault.\nToday I receive the supreme prophecy,\nUtterly freed from all suffering.\nTogether in this single Dharma,\nThis truth I never knew before.\nHow can afflicted beings\nEver overcome their clinging?\nBy accumulated virtue and practice,\nNow I am bathed in sweet dew.\nGolden-hued, thirty-two marks,\nEighty subtle signs adorn my form.\nMy merit is profound and weighty—\nNo demon king can slander me.\nIn the emptiness of Dharma, I attain realization,\nAll doubts and regrets are washed away.\nThe waves of illusion now subdued,\nI bow in deepest reverence.\n\nThe Dao declared: \"In countless kalpas past, I have expounded the supreme Dao, ever teaching and transforming you. You have followed me through long nights of study, and as each was fit to be delivered, I guided you into the Dao and Dharma, desiring that your aspirations ascend to my highest Way. Yet you were content with the lesser vehicle, deeming it sufficient. Now I proclaim to you the Great Vehicle sutra, named *The Supreme Numinous Treasure Teachings of All Perfected Dharmas*.\"\n\nThe Heavenly Worthy said: \"You have amassed deep and weighty practice, and now attain your wish—ascending to the supreme station, your wisdom complete, your celestial palace adorned with the seven treasures, resplendent with heavenly blossoms. You too shall teach the Three Vehicles’ Dharma to transform beings.\"\n\nThereupon, the assembly of sages and the hosts of heavens gathered, witnessing the Supreme Dao Lord receive the prophecy of the supreme fruit. Their hearts overflowed with joy, leaping boundlessly, and each removed their celestial robes, exquisite blossoms, and fragrant offerings to make obeisance. Countless heavenly musicians played myriad instruments in the void, all at once, and the entire great assembly aroused the mind of the supreme, true, and correct Dao.\n\nAt that time, the Supreme Dao Lord, having received the prophecy of the supreme Dao, addressed the Heavenly Worthy: \"Formerly, following your teachings, I attained the Dharma of transcending birth, old age, sickness, death, and abiding eternally. I now wish to expound its causes and conditions to the fourfold assembly, having dispelled all doubts and regrets.\"\n\nThe Heavenly Worthy replied: \"Those of wisdom comprehend through analogy. Consider an elder, advanced in years, possessing vast wealth and a vast estate. His home has but one gate, within which dwell over a hundred people. The halls and pavilions, decayed and crumbling, suddenly burst into flame, causing great alarm. Though I escape, my children remain inside the burning house, playing heedlessly, unaware of danger. The fire closes in, yet they do not perceive the peril. I call to them: *This is a burning house—you will soon perish! I have small carts, medium carts, and great ox-carts waiting outside. Come forth and play as you wish; I shall grant whatever you desire.* Overjoyed, the children rush out in competition.\"\n\nThe elder, seeing his children safely emerged and no longer obstructed on any side, felt his heart at ease, filled with joy and exultation. Then each of the children addressed their father, saying: *\"The playthings you promised earlier—the small carts, the medium carts, and the great ox-carts—we now wish to receive them as you pledged.\"* Thereupon, the elder bestowed upon each child a single great cart. These carts were tall and wide, adorned with manifold treasures, their sides encircled by railings and balustrades, with bells hanging on all four sides. Above, canopies were spread, embellished with rare and wondrous jewels, while jeweled cords intertwined, garlands of flowers hung down, and layers of fine silken drapes were laid, with crimson pillows set in place. They were drawn by white oxen, their hides lustrous and full, their forms comely and strong, possessed of great vigor, walking with steady gait, swift as the wind. Many attendants and guards accompanied them. The elder declared: *\"These young ones are all my children. Since I am so abundantly wealthy, with countless treasure-carts, I should treat them all equally, granting each one without distinction. Why? Even if I were to distribute all my treasures to an entire kingdom, they would not be exhausted—how much less for my own children!\"* Each child, riding in a great cart, rejoiced exceedingly, for this was beyond their original hopes.\n\nThe Dao said: *\"This elder rescued my children from the peril of the burning house and further bestowed upon them these seven-jeweled carts. My practice of great compassion is likewise. I am the father of all in the world, having forever extinguished all fear, decay, sorrow, affliction, and the darkness of ignorance, ever employing good deeds to deliver beings. The Three Realms are but a burning house; all beings are scorched by birth, old age, sickness, death, grief, sorrow, suffering, and the obscurity of delusion—the fires of the Three Poisons. I teach them to enter the supreme, most true Dao. Seeing beings seared by birth, old age, sickness, death, grief, sorrow, and suffering, and further tormented by the pursuit of the five desires and wealth, enduring manifold afflictions—yet still clinging and craving, presently suffering in this life and later in the hells, as beasts, or as hungry ghosts—even if born in heaven or among humans, they face poverty, hardship, the pain of separation from the beloved, and the harm of hatred. Such are the sufferings in which beings are submerged, playing heedlessly, unaware and unknowing, not seeking liberation. Within this burning house of the Three Realms, they run to and fro, though beset by great suffering, yet do not perceive the peril. Seeing this plight, I declare: I am the father of beings; I must rescue them from suffering and grant them boundless wisdom, the limitless Dao-ground, that they may play freely and find ease. The Dao said: If I were to refrain from speaking of their fears through spiritual power, beings could not thereby be delivered. Why? These beings, though spared birth, old age, sickness, death, grief, sorrow, and suffering, are still scorched by the burning house of the Three Realms—how could they attain the wisdom of the sages? Just as that elder, though strong in body and hand, did not employ force, but with earnest skillful means rescued his children from the burning house and later gave each a great treasure-cart, so too do I employ the skillful means of wisdom to deliver beings from the burning house of the Three Realms, establishing them in the Three Vehicles: the earthly immortals, the heavenly immortals, and the supreme Dao Vehicle. You must not delight in dwelling within the burning house of the Three Realms, nor cling to coarse and base sounds, forms, fragrances, and tastes. If you cling and generate attachment, you will be burned by the fire. Swiftly depart the Three Realms and attain the Three Vehicles: the lesser immortals, the middle immortals, and the supreme Dao Vehicle. These words are true and shall never be false. You who understand these Three Vehicles, praised by the sages, should pity beings who seek nothing, abide in stillness and contemplation, and find joy in themselves, thereby attaining peace, security, and the bliss of non-action. If there are beings who hear this Dharma, believe and accept it, cultivate diligently, and seek omniscience, pitying and delivering all beings, this is called the Great Vehicle. Those who seek this Vehicle are called the supreme and ultimate ones. Just as those children, seeking the ox-carts, emerged from the burning house, I wish to free beings from the sufferings of the Three Realms and grant them the joy of the unending. Thus, the Dao teaches the Three Vehicles to guide beings, but ultimately delivers them solely through the Great Vehicle. This Dharma is inexhaustible, yet not all can receive it. For this reason, know that the sages teach according to what is fitting.\"*\n\nThereupon, the Dao Lord, having received this prophecy and rejoiced, spoke these verses:\n\n*The Heavenly Worthy expounds the wondrous teaching,\nNow heard as never before.\nAttaining the Dao’s great power of wisdom,\nLife spans become immeasurable.\nAll rejoice together,\nHearing the Dao-ground of the sutra.\nDiligently cultivate the Six Perfections,\nHold fast to your resolve and be courageous.\nThe profound chapters spread through the Three Realms,\nTheir wondrous resonance flowing in the ten directions.\nAscending beyond the Great Veil,\nSoaring in the realm of non-action.\nWith great compassion for beings,\nAgain proclaiming long life.\nAll possess good roots,\nLeaks extinguished, they turn toward coolness.\nIf you seek omniscience,\nPractice the Six Great Perfections.\nGuard the precepts and remain pure,\nFirm in resolve for the supreme endeavor.\nOffer treasures and make offerings,\nDevoting your heart without stinginess.\nHolding to this single-minded merit,\nAspire to the supreme virtue.\nI attain omniscience,\nAll the powers of divine concentration.\nScattering incense and making vows,\nAccumulating merit in the billions.\nBelieve and accept the Great Vehicle Dharma,\nMindful of the Dao, casting off attachments.\nRoaming the spirit through the empty vastness,\nTen thousand vows without obstruction.\nSince I attained the immortal Dao,\nCountless kalpas have passed.\nEver expounding the Dharma to teach,\nAll the myriad beings.\nMindful of entering the mysterious true path,\nDivine methods surpassing your form.\nRefining the body with the art of enduring vision,\nAbiding in spirit in the Upper Clarity.\nI ever dwell here,\nWisdom and power in harmony.\nDiligently ascending the Great Veil,\nRoaming and delighting in the Jade Capital.\nAll immortals are my companions,\nSpirit and soul attain ease and glory.\"*\n\nAlas, all sentient beings,\nSunk deep in suffering and affliction.\nThus I do not manifest this body,\nThat they may contemplate the wondrous Dao.\nFor in their hearts they yearn and long,\nI expound for them the Numinous Treasure.\nAscending in spirit to the Jade Capital,\nIts palaces most rare and fine.\nWhen kalpas end, fire and water sweep,\nThat land follows its course in vastness.\nJade groves gleam with blossoming fruit,\nDharma pools where one may bathe and refine.\nAbiding in non-action, the Cavern of Non-action,\nNo need to eat, yet fully sated.\nEnjoying life without end,\nFulfilling the vow to guard the Three Treasures.\nPity these sentient beings,\nWhose evil karma is the cause and condition.\nFor ten thousand kalpas they suffer in anguish,\nNever hearing the Numinous Treasure scriptures.\nThe wise cultivate merit and virtue,\nGentle and harmonious, their nature firm and steadfast.\nSeeking the place of the Dao’s arising,\nConceived and born within the lotus blossom.\nDharma sounds awaken ear and eye,\nAll hosts and all devas together.\nAscending as immortals, their lives boundless,\nThe virtuous should turn to the worthy.\nThrough long-cultivated karma they attain this,\nBreaking through demonic forces, uprooting defilement.\nTheir lifespan spans countless kalpas,\nTheir nature striving for long life.\nAll afflictions utterly extinguished,\nSwiftly they become the Supreme Perfected.\n\nThe Heavenly Worthy says: This Great Vehicle sutra\nIs most profound and mysterious.\nThose of shallow understanding,\nBewildered, cannot comprehend it.\nOther lesser immortals,\nBelieving the words of the Dao, follow this sutra,\nYet it is not their own wisdom.\nThose filled with anger, arrogance, sloth, and indolence,\nShould not believe this sutra.\nOrdinary beings of shallow understanding,\nDeeply attached to the five desires,\nHearing it, cannot grasp its meaning—\nDo not teach it to them.\nIf there are those who do not believe this sutra,\nYet hear of others receiving, upholding, offering, and observing fasts,\nReading and reciting it, and then slander it,\nDespising, envying, and harboring resentment,\nThe sin of such a person is most grave and heavy.\nWhen their life ends, they fall into hell,\nPassing through countless kalpas,\nEnduring great and bitter suffering.\nEmerging from hell, they yet fall among beasts,\nAssuming leaky forms—scabies, leprosy,\nMyriad poisonous sores—all borne upon their bodies.\nThough they may be said to live, their suffering is extreme.\nFor slandering this sutra, such is the retribution they incur.\nIf such a sinner is later reborn among humans,\nTheir faculties dull and dim,\nLame, crippled, hunchbacked, or bent,\nBlind, deaf, or stooped.\nWhatever they say, none will believe,\nTheir breath ever foul, possessed by ghosts and spirits.\nPoor, lowly, and servile,\nUsed by others, sickly and emaciated.\nLacking clothing,\nThough they cling to others, none regard them.\nIf they gain anything, it soon vanishes.\nShould they practice medicine, following prescriptions to treat illness,\nThey only worsen the ailments, or even cause death.\nIf they themselves fall ill, none will heal them,\nAnd though they take fine medicines, their condition only worsens.\nRebellious, they fall prey to bandits,\nRepeatedly suffering calamity.\nSuch sinners will never\nBehold the assembly of sacred divine kings expounding the wondrous sutras.\nOnly those who uphold precepts and maintain purity,\nWho yearn for the Dao with earnest hearts,\nAspiring to the Great Vehicle—\nOnly such people may be taught the Numinous Treasure’s wondrous sutra.\n\nThe Dao Lord bows his head and asks the Heavenly Worthy:\nIn this latter age, if there are good men and good women\nWho hear this Numinous Treasure sutra,\nAnd according to their wishes, offer gold and treasures in faith,\nOr go to listen to it,\nHow much merit will they gain?\n\nThen the Primordial Heavenly Worthy tells the Dao Lord:\nIn this latter age, if there are faithful Daoists or other wise ones,\nRegardless of age, who suddenly hear this sutra,\nAnd can receive, uphold, and savor its teachings for good,\nExpounding its matters in places of merit and virtue,\nAnd those who hear it then generate faith,\nTheir merit is most great.\nIt is like a wealthy householder,\nWho, moved by great vows, distributes treasures to aid the needy,\nAnd with the Dao’s methods teaches and guides sentient beings,\nEnabling them to become lesser immortals,\nSoaring over the Five Peaks.\nIs their merit not vast?\n\nThe Dao Lord bows his head and says: It is vast.\n\nThe Heavenly Worthy says: That person merely distributes treasures to aid sentient beings—\nTheir merit is already immeasurable.\nHow much more so if they teach them divine methods,\nEnabling them to ascend as immortals.\nThough this merit is weighty,\nIt does not compare to hearing this Numinous Treasure sutra with joy—\nThat merit is far greater, surpassing the benefactor’s,\nBeyond calculation or analogy.\nYet this person’s deeds are few,\nYet they gain such merit—\nHow much more so for those who offer and receive it with devotion.\nIf there are those at the place of Dharma exposition,\nOr those who have entered the fast,\nAnd tell their friends:\n“There is this Numinous Treasure’s venerable sutra,\nIts words profound and wondrous—\nLet us go together to listen and receive it.”\nThe merit of such a person,\nIn their next life, will attain the path of the Great Vehicle,\nSharp in wisdom and insight,\nFor a hundred thousand kalpas never mute or dumb.\nTheir breath not foul, their tongue never first to ail,\nNor their mouth diseased.\nTheir teeth not filthy or black,\nNot yellow or sparse, nor missing or fallen.\nTheir lips not drooping or shriveled,\nTheir mouth not crooked, thick, or large,\nNor dark and sallow, with no repulsive traits.\nTheir nose not flat or sunken,\nNor crooked or bent.\nTheir complexion not dark or twisted,\nWithout any unpleasing features.\nLips, tongue, and teeth all refined and fine,\nNose high and straight,\nFace full and round,\nEyebrows high and long,\nForehead broad and level—\nPossessing all the marks of a noble person.\nIn life after life, they will always encounter good fortune,\nAnd meet with the sutras and teachings.\nTo encourage others to listen brings such merit—\nHow much more so for those who wholeheartedly observe the fast,\nReceive, read, and recite it?\nTheir merit is boundless, beyond conception.\n\nThen the Heavenly Worthy spoke in verse:\n\nIf one, during the fast,\nHears the sound of this sutra,\nThat person’s merit is weighty,\nGaining blessings profound and deep.\nLike a great benefactor,\nProviding for countless guests,\nAnd further expounding the Dharma,\nGuiding them to enter immortality—\nFleeting as a bubble on water,\nSwiftly they awaken the mind of weariness and renunciation.\nAttaining the rank of Perfected One,\nMastering the Three Clarities and the Six Spirits.\nYet it does not compare to a single line of this sutra,\nTeaching and transforming those of the same Dharma.\n\nThis person’s blessings run deep and thick,\nTheir merit beyond all reckoning.\nThey attain a body complete in marks,\nLofty as the noble saintly guests.\nTheir breath holds no foulness or decay,\nBut exhales fragrant smoke with every breath.\nIn later lives among gods and humans,\nThey dwell in palaces adorned with rare treasures.\nExhorting others to sit and hear the sutra,\nThe true Dao remains ever their neighbor.\nHow much more for those who receive and uphold it—\nTheir blessings defy all description.\n\nSuppose there were one who,\nWith a kingdom’s cities, wives and children,\nAnd boundless treasures of rare goods,\nMade offerings of them all—\nThe merit gained by such a person\nWould not equal that of one who receives and upholds\nThis sacred scripture of the Numinous Treasure,\nWhose blessings are the greatest of all.\n\nJust as among all flowing rivers and streams,\nThe sea stands first,\nSo too this sutra,\nAmong all sutras, is supreme.\n\nJust as among all the stars,\nThe moon stands first,\nSo too this sutra,\nAmong the billions of sutras and teachings,\nShines most brightly.\n\nJust as the radiant sun\nDispels all darkness,\nSo too this sutra\nShatters all the darkness of unwholesomeness.\n\nJust as among all lesser kings,\nThe sagely emperor is first,\nSo too this sutra,\nAmong all sutras, is most exalted.\n\nJust as the Great Brahmā Deva King\nIs father to all beings,\nSo too this sutra\nIs father to all the worthy sages and immortals.\n\nThis sutra can save all beings,\nFreeing them from every suffering and affliction.\nThis sutra can greatly benefit all beings,\nFulfilling all their aspirations.\n\nLike a cool, clear pool\nThat slakes the thirst of all who drink,\nLike fire for one who is cold,\nLike clothing for one who is naked,\nLike a mother for her child,\nLike a ship for one who must cross,\nLike a physician for the sick,\nLike a lamp for one in darkness,\nLike treasure for the poor—\nSo too this Great Vehicle sutra\nCan liberate all beings\nFrom every suffering and the bonds of birth and death.\n\nIf one carries gold and treasures\nTo receive, uphold, and make offerings to it,\nOr if one merely hears it,\nThe merit of such a person\nCannot be reckoned even by the saintly spirit-kings\nOr the kings of the heavenly emperors.\n\nThe Heavenly Worthy addressed the Lord of the Dao, saying:\n“Beings are pitiable,\nEnsnared in suffering and affliction—\nHow deeply sorrowful!\nFor this reason, I earnestly expound this sutra again.\nYou must diligently and widely proclaim it,\nTo deliver and save all beings.”\n\nThe Lord of the Dao bowed his head,\nReverently receiving the command.\n\nAt that time, all those gathered in the assembly\nAwakened the mind of the natural, true, and correct Dao.\nThe fourfold assembly of spirit-kings bowed in homage and withdrew.\n\nThus concludes the *Supreme Great Vehicle Essential Teachings Wondrous Sutra*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "无上大乘要诀妙经 经名：无上大来要诀妙经。 撰人不详，似出於隋唐之际。 一卷。 底本出处：《正统道藏》洞真部本文类。 无上大乘要诀妙经 尔时，天尊以龙汉之年，於大福堂国化作自然七宝玄台，众宝粒饰，悬缯华盖周覆一国； 於中平坐，放大光明遍照十方无极世界，一切朗然。 当是其时，大圣众神、飞天神王、丹灵真老、太上三炁天君、玉晨上皇诸真人、左右二真、无量大众一时同会。 三界大魔王、万海中龙王、十方仙人乘光来至，奉献珍宝价直无量，百和之香不焚自熏，天钧妓乐同时俱作。 元始天王告太上大道君曰：子积勋重大，神智得道，教化众生，开度一切，三便已达，万圣之宗，悉为备矣。 然未得此无上大乘要诀，究竟常住无量大法。 累劫积德，今果之矣。 因授以无上大乘要诀：至法上无复色，下无复渊，究竟法身得不退转，位如我也。 拜以三乘之法，济度众生：汝当勤行大慈之心，令诸众生得离烦恼，超拔三界，为之桥梁。 於是，太上道君避座稽首，前受记旨，而作此言：今闻此法音，心怀踊跃，得未曾有。 所以者何？ 我昔学道以来，独处山林，或坐或行，每作是念：我亦同入法性，云何天尊以小乘法而见济度？ 然是我咎，非天尊也。 所以者何？",
      "translated_text": "*The Supreme Mahāyāna Esoteric Sūtra of Essential Precepts*\n\nThus have I heard: In the Dragon-Han era, the Heavenly Worthy manifested within the Land of Great Blessing Hall, transforming into a spontaneous seven-jeweled mystic terrace adorned with myriad precious grains. Banners and flowered canopies enveloped the entire realm. Seated in equipoise at its center, he radiated boundless luminosity, illumining the ten directions and all worlds without limit, so that all became resplendently clear.\n\nAt that time, the assembly of great holy deities, Flying Heavenly Spirit-Kings, Cinnabar Numinous Perfected Elders, the Three Qi Heavenly Lords of the Supreme, the Jade Dawn Highest August Perfected Ones, the Left and Right Two Perfected, and immeasurable hosts gathered as one. The Great Demon Kings of the Three Realms, Dragon Kings of the Ten Thousand Seas, and Immortals of the ten directions arrived upon beams of light, offering priceless treasures. Incense of a hundred harmonies perfumed the air without burning, and celestial music resounded in unison.\n\nThe Primordial Heavenly King addressed the Supreme Great Dao Lord, saying: \"You have accumulated vast merit, attained the wisdom of the Dao, and instructed sentient beings, delivering all without exception. The Three Expedients are now mastered, and the lineage of the myriad sages is complete. Yet you have not yet received this Supreme Mahāyāna Esoteric Precept—the ultimate, eternally abiding Dharma of boundless profundity. Through kalpas of accumulated virtue, the fruit is now ripe.\"\n\nThereupon, he bestowed the Supreme Mahāyāna Esoteric Precept: \"The supreme Dharma transcends form above and depth below. Through it, the ultimate Dharma-body attains irreversible realization, its station equal to mine. I entrust you with the Three Vehicles’ teachings to deliver sentient beings. You must diligently cultivate the mind of great compassion, enabling all beings to escape affliction, transcend the Three Realms, and cross the bridge you provide.\"\n\nThen, the Supreme Dao Lord rose from his seat, bowed deeply, and received the prophecy, declaring: \"Today, hearing this Dharma-sound, my heart leaps with joy—such has never been before! Why is this? Since first studying the Dao, I have dwelled alone in mountains and forests, sitting or walking, ever pondering: *I too have entered the Dharma-nature—why then has the Heavenly Worthy delivered me with the lesser vehicle?* Yet this is my own fault, not the Heavenly Worthy’s. Why is this?\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 490,
      "start_sentence": 0,
      "end_sentence": 19,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.920544624328613,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\无上大乘要诀妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "若我发心，修行洞慧，必以大乘而得度脱。 我等智浅，闻有道法而便信受，遂获仙度，支年而住，不闻有此无极大乘之法。 今蒙告诲，疑嫌泰然，今日乃知是道真子，从道中生，从法化生。 於是道君不胜欣释，以偈颂曰： 我闻是法音，得所未曾有。 心怀太欢喜，疑纲皆夷朽。 令不失大乘，无灭寿长久。 能除众生恼，我闻诸漏愈。 情断住小乘，自责最上咎。 今获无上记，至极诸苦解。 同共一法中，我昔未知此。 烦恼诸众生，孰能达伏倚？ 积德行所招，今蒙甘露洒。 金色三十二，八十种妙体。 功德甚深重，魔王莫能訾。 於空法得证，疑悔悉已洗。 波巡并降伏，今为稽首礼。 道言：我昔於无数劫所说无上道，常教化汝等，汝亦长夜随我受学，随所应度，引导汝等生道法中，欲令汝志造我上道。 而汝弥委得小乘法，而谓已足。 我今为汝说大乘经，名无上灵宝教诸真法。 天尊曰：汝积行厚重，今得所愿，位登无上，智慧具足，台阙七宝，天华辉烨。 汝亦当以三乘法教化众生。 於是众圣共会，诸天并集，见道君获无上果记，心大欢喜，踊跃无量，各脱天衣及妙华香而以供养。 诸天妓乐百千万种，於虚空中一时俱作，一切大众皆发无上正真道意。 尔时，道君得无上道记，白天尊言：昔随教法，能离众中生老病死常住之法，愿为四众说其因缘，今离疑悔。 天尊曰：诸有智者，以譬喻得解。 譬若丈人，其年衰迈，财富无量，其家广大。 唯有一门百余许人，住止其中。 堂阁朽故，欻然火起，即大惊怖。 我虽得出，而诸子等火宅嬉戏，不知怖畏，火来切已，不知为患。 告诸子曰：此为火宅，垂应烧死，其可怖畏。 我有下车、中车、大牛之车，今在门外，可以游戏。 汝等出来，随所欲得，随意相给。 诸子欢喜，竞驰走出。",
      "translated_text": "\"If I had resolved my mind to cultivate the profound wisdom of the Cavernous Illightenment, I would surely have been delivered by the Great Vehicle. Yet our wisdom was shallow—upon hearing of the Daoist teachings, we merely believed and accepted them, thus attaining immortality and dwelling for eons, never once hearing of this boundless Great Vehicle Dharma. Today, by your gracious instruction, my doubts and misgivings dissolve entirely. Only now do I realize I am a true child of the Dao, born of the Dao, transformed by the Dharma.\"\n\nThereupon, the Supreme Dao Lord, overcome with joy and relief, extolled in verse:\n\nI hear this Dharma-sound,\nAttaining what was never before.\nMy heart brims with boundless joy,\nAll doubts crumble to dust.\nNow I shall not lose the Great Vehicle,\nMy life undying, everlasting.\nIt dispels the afflictions of beings—\nHearing it, all my leaks are healed.\nOnce clinging to the lesser vehicle,\nI reproached myself for the gravest fault.\nToday I receive the supreme prophecy,\nUtterly freed from all suffering.\nTogether in this single Dharma,\nThis truth I never knew before.\nHow can afflicted beings\nEver overcome their clinging?\nBy accumulated virtue and practice,\nNow I am bathed in sweet dew.\nGolden-hued, thirty-two marks,\nEighty subtle signs adorn my form.\nMy merit is profound and weighty—\nNo demon king can slander me.\nIn the emptiness of Dharma, I attain realization,\nAll doubts and regrets are washed away.\nThe waves of illusion now subdued,\nI bow in deepest reverence.\n\nThe Dao declared: \"In countless kalpas past, I have expounded the supreme Dao, ever teaching and transforming you. You have followed me through long nights of study, and as each was fit to be delivered, I guided you into the Dao and Dharma, desiring that your aspirations ascend to my highest Way. Yet you were content with the lesser vehicle, deeming it sufficient. Now I proclaim to you the Great Vehicle sutra, named *The Supreme Numinous Treasure Teachings of All Perfected Dharmas*.\"\n\nThe Heavenly Worthy said: \"You have amassed deep and weighty practice, and now attain your wish—ascending to the supreme station, your wisdom complete, your celestial palace adorned with the seven treasures, resplendent with heavenly blossoms. You too shall teach the Three Vehicles’ Dharma to transform beings.\"\n\nThereupon, the assembly of sages and the hosts of heavens gathered, witnessing the Supreme Dao Lord receive the prophecy of the supreme fruit. Their hearts overflowed with joy, leaping boundlessly, and each removed their celestial robes, exquisite blossoms, and fragrant offerings to make obeisance. Countless heavenly musicians played myriad instruments in the void, all at once, and the entire great assembly aroused the mind of the supreme, true, and correct Dao.\n\nAt that time, the Supreme Dao Lord, having received the prophecy of the supreme Dao, addressed the Heavenly Worthy: \"Formerly, following your teachings, I attained the Dharma of transcending birth, old age, sickness, death, and abiding eternally. I now wish to expound its causes and conditions to the fourfold assembly, having dispelled all doubts and regrets.\"\n\nThe Heavenly Worthy replied: \"Those of wisdom comprehend through analogy. Consider an elder, advanced in years, possessing vast wealth and a vast estate. His home has but one gate, within which dwell over a hundred people. The halls and pavilions, decayed and crumbling, suddenly burst into flame, causing great alarm. Though I escape, my children remain inside the burning house, playing heedlessly, unaware of danger. The fire closes in, yet they do not perceive the peril. I call to them: *This is a burning house—you will soon perish! I have small carts, medium carts, and great ox-carts waiting outside. Come forth and play as you wish; I shall grant whatever you desire.* Overjoyed, the children rush out in competition.\"",
      "overlap_context": " provide.\"\n\nThen, the Supreme Dao Lord rose from his seat, bowed deeply, and received the prophecy, declaring: \"Today, hearing this Dharma-sound, my heart leaps with joy—such has never been before! Why is this? Since first studying the Dao, I have dwelled alone in mountains and forests, sitting or walking, ever pondering: *I too have entered the Dharma-nature—why then has the Heavenly Worthy delivered me with the lesser vehicle?* Yet this is my own fault, not the Heavenly Worthy’s. Why is this?\"",
      "start_char": 490,
      "end_char": 1196,
      "start_sentence": 20,
      "end_sentence": 53,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.070766925811768,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\无上大乘要诀妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "丈人见子安稳得出，於四座无复障阂，其心泰然，欢喜踊跃。 时诸子等各白父言； 先父所许玩好之具，下车、中车、大牛之车，愿特赐与。 时丈人各赐诸子等一大车，其车高广，众宝装铰，周匝栏楯，四面悬铃。 又於其上张设轩盖，亦以珍奇杂宝而严饰之，宝绳交络，垂诸华璎，重敷綩綖，安置丹枕。 驾以白牛，肤色充梁，形体姝好，有大筋力，行步平正，其疾如风。 又多仆从，而使侍卫。 丈人言：此诸幼童，皆是我子，我既丰富，宝车无数，应当等心，各各与之，不宜差别。 所以者何？ 我众宝周给一国，犹尚不匮，何况诸子。 各乘大车，甚为欢喜，非本所望。 道言：而此丈人济我子命火宅之难，兼又赐之七宝之车。 我行大慈，亦复如此。 我为一切世间之父，於诸怖畏、衰恼忧患、无明暗蔽，永尽无余，恒以善事度脱众生。 三界烦恼，皆是火宅； 而诸众生，生老病死，忧悲苦恼，愚痴暗蔽，三毒之火。 教化令入无上至真之道。 见诸众生为生老病死、忧悲苦恼之所烧煮； 亦以五欲财利，故受种种苦恼； 又以贪着追求，故现受众苦，后受地狱畜生饿鬼之苦； 若生天上，及在人间，贫穷困苦，爱别离苦，怨憎害苦。 如是等苦，众生没在其中，欢喜游戏，不觉不知，不求解脱； 於此三界火宅，东西驰走，虽遭大苦，不以为患。 道见此厄，便作此言：我为众生之父，应拔其苦，与其无量智慧，无极道场，命其游戏，以自夷释。 道言：若以神力不说怖畏者，众生不能以是得度。 所以者何？ 是诸众生，免生老病死、忧悲苦恼，而为三界火宅所烧，何由能解圣之智慧？ 如彼长者，虽复身手有力，而不用之，但以殷懃方便，济诸子等火宅之难，后各与珍宝大车。 我亦复如此，但以智慧方便，於三界火宅拔济众生，为三乘地仙、天仙、无上道乘。 汝等莫得乐住三界火宅，贪着粗弊声色香味之类； 若贪着生爱，则为火所烧。 汝速出三界，当得三乘下仙、中仙、上道之乘。 此言信矣，终不虚也。 汝等明此三乘，圣所称赞，唯愍众生无所哀求，静定存思而自娱乐，便得安稳无为快乐。 若有众生闻法信受，勤修精进，求一切智，愍伤众生，度脱一切，是名大乘； 求此乘者，名为无上至极之士。 如彼诸子为求牛车，出於火宅，我欲令众生兔三界苦，得不灭乐，道说三乘引导众生。 然后，但以大乘而度脱之。 此法无穷，但不能尽受。 以是因缘，当知圣人随宜说法。 於是，道君既受记欢喜，而说偈颂曰： 天尊说妙诀，今闻昔未曾。 得道大智力，寿命不可量。 一切皆欢喜，闻经之道场。 勤修六度行，执志当勇猛。 洞章布三界，妙响流十方。 腾身大罗外，翱游无为乡。 大慈愍众生，重告寿命长。 一切具善根，除漏趣清凉。 若求一切慧，行六大度行。 守戒常清浄，坚志无上业。 施宝设供养，尽心无吝惜。 持此一心福，愿求无上德。 我得一切智，悉诸神定力。 散香陈上愿，累功在万亿。 信受大乘法，念道遣所着。 遨神升空洞，万愿无坚塞。 自我成仙道，无数劫已经。 常演法教化，一切诸众生。 念入玄真迹，神方过尔形。 炼体久视法，停神在上清。 我常住於此，智慧力和平。 勤行升大罗，游乐造玉京。 众仙为知识，神爽得夷荣。",
      "translated_text": "The elder, seeing his children safely emerged and no longer obstructed on any side, felt his heart at ease, filled with joy and exultation. Then each of the children addressed their father, saying: *\"The playthings you promised earlier—the small carts, the medium carts, and the great ox-carts—we now wish to receive them as you pledged.\"* Thereupon, the elder bestowed upon each child a single great cart. These carts were tall and wide, adorned with manifold treasures, their sides encircled by railings and balustrades, with bells hanging on all four sides. Above, canopies were spread, embellished with rare and wondrous jewels, while jeweled cords intertwined, garlands of flowers hung down, and layers of fine silken drapes were laid, with crimson pillows set in place. They were drawn by white oxen, their hides lustrous and full, their forms comely and strong, possessed of great vigor, walking with steady gait, swift as the wind. Many attendants and guards accompanied them. The elder declared: *\"These young ones are all my children. Since I am so abundantly wealthy, with countless treasure-carts, I should treat them all equally, granting each one without distinction. Why? Even if I were to distribute all my treasures to an entire kingdom, they would not be exhausted—how much less for my own children!\"* Each child, riding in a great cart, rejoiced exceedingly, for this was beyond their original hopes.\n\nThe Dao said: *\"This elder rescued my children from the peril of the burning house and further bestowed upon them these seven-jeweled carts. My practice of great compassion is likewise. I am the father of all in the world, having forever extinguished all fear, decay, sorrow, affliction, and the darkness of ignorance, ever employing good deeds to deliver beings. The Three Realms are but a burning house; all beings are scorched by birth, old age, sickness, death, grief, sorrow, suffering, and the obscurity of delusion—the fires of the Three Poisons. I teach them to enter the supreme, most true Dao. Seeing beings seared by birth, old age, sickness, death, grief, sorrow, and suffering, and further tormented by the pursuit of the five desires and wealth, enduring manifold afflictions—yet still clinging and craving, presently suffering in this life and later in the hells, as beasts, or as hungry ghosts—even if born in heaven or among humans, they face poverty, hardship, the pain of separation from the beloved, and the harm of hatred. Such are the sufferings in which beings are submerged, playing heedlessly, unaware and unknowing, not seeking liberation. Within this burning house of the Three Realms, they run to and fro, though beset by great suffering, yet do not perceive the peril. Seeing this plight, I declare: I am the father of beings; I must rescue them from suffering and grant them boundless wisdom, the limitless Dao-ground, that they may play freely and find ease. The Dao said: If I were to refrain from speaking of their fears through spiritual power, beings could not thereby be delivered. Why? These beings, though spared birth, old age, sickness, death, grief, sorrow, and suffering, are still scorched by the burning house of the Three Realms—how could they attain the wisdom of the sages? Just as that elder, though strong in body and hand, did not employ force, but with earnest skillful means rescued his children from the burning house and later gave each a great treasure-cart, so too do I employ the skillful means of wisdom to deliver beings from the burning house of the Three Realms, establishing them in the Three Vehicles: the earthly immortals, the heavenly immortals, and the supreme Dao Vehicle. You must not delight in dwelling within the burning house of the Three Realms, nor cling to coarse and base sounds, forms, fragrances, and tastes. If you cling and generate attachment, you will be burned by the fire. Swiftly depart the Three Realms and attain the Three Vehicles: the lesser immortals, the middle immortals, and the supreme Dao Vehicle. These words are true and shall never be false. You who understand these Three Vehicles, praised by the sages, should pity beings who seek nothing, abide in stillness and contemplation, and find joy in themselves, thereby attaining peace, security, and the bliss of non-action. If there are beings who hear this Dharma, believe and accept it, cultivate diligently, and seek omniscience, pitying and delivering all beings, this is called the Great Vehicle. Those who seek this Vehicle are called the supreme and ultimate ones. Just as those children, seeking the ox-carts, emerged from the burning house, I wish to free beings from the sufferings of the Three Realms and grant them the joy of the unending. Thus, the Dao teaches the Three Vehicles to guide beings, but ultimately delivers them solely through the Great Vehicle. This Dharma is inexhaustible, yet not all can receive it. For this reason, know that the sages teach according to what is fitting.\"*\n\nThereupon, the Dao Lord, having received this prophecy and rejoiced, spoke these verses:\n\n*The Heavenly Worthy expounds the wondrous teaching,\nNow heard as never before.\nAttaining the Dao’s great power of wisdom,\nLife spans become immeasurable.\nAll rejoice together,\nHearing the Dao-ground of the sutra.\nDiligently cultivate the Six Perfections,\nHold fast to your resolve and be courageous.\nThe profound chapters spread through the Three Realms,\nTheir wondrous resonance flowing in the ten directions.\nAscending beyond the Great Veil,\nSoaring in the realm of non-action.\nWith great compassion for beings,\nAgain proclaiming long life.\nAll possess good roots,\nLeaks extinguished, they turn toward coolness.\nIf you seek omniscience,\nPractice the Six Great Perfections.\nGuard the precepts and remain pure,\nFirm in resolve for the supreme endeavor.\nOffer treasures and make offerings,\nDevoting your heart without stinginess.\nHolding to this single-minded merit,\nAspire to the supreme virtue.\nI attain omniscience,\nAll the powers of divine concentration.\nScattering incense and making vows,\nAccumulating merit in the billions.\nBelieve and accept the Great Vehicle Dharma,\nMindful of the Dao, casting off attachments.\nRoaming the spirit through the empty vastness,\nTen thousand vows without obstruction.\nSince I attained the immortal Dao,\nCountless kalpas have passed.\nEver expounding the Dharma to teach,\nAll the myriad beings.\nMindful of entering the mysterious true path,\nDivine methods surpassing your form.\nRefining the body with the art of enduring vision,\nAbiding in spirit in the Upper Clarity.\nI ever dwell here,\nWisdom and power in harmony.\nDiligently ascending the Great Veil,\nRoaming and delighting in the Jade Capital.\nAll immortals are my companions,\nSpirit and soul attain ease and glory.\"*",
      "overlap_context": "halls and pavilions, decayed and crumbling, suddenly burst into flame, causing great alarm. Though I escape, my children remain inside the burning house, playing heedlessly, unaware of danger. The fire closes in, yet they do not perceive the peril. I call to them: *This is a burning house—you will soon perish! I have small carts, medium carts, and great ox-carts waiting outside. Come forth and play as you wish; I shall grant whatever you desire.* Overjoyed, the children rush out in competition.\"",
      "start_char": 1196,
      "end_char": 2447,
      "start_sentence": 54,
      "end_sentence": 117,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.842613697052002,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\无上大乘要诀妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "哀哉诸众生，弥没於苦恼。 故不为现身，令其思妙道。 因心有翘慕，为之敷灵宝。 跻神达玉京，宫殿甚珍好。 劫尽水火荡，其土随运浩。 玉林耀华果，法池可练澡。 无为洞无为，不餐亦充饱。 自享无终寿，毕契卫三宝。 念罪诸众生，恶业为因缘。 万劫更痛恼，不闻灵宝篇。 贤者修功德，柔和质保坚。 求得道场处，托孕入华莲。 法音悟耳目，群旅并诸天。 升仙寿无量，仁者当归贤。 久修业所得，破魔拔秽尘。 寿命无数劫，挺质求长生。 烦恼悉已尽，速成无上真。 天尊曰：是大乘经，甚为深奥，浅识之人，迷惑不解。 其余下仙，信道语故，随顺此经，非己智慧。 忿憍慢怠者，莫信此经。 凡夫浅识，深着五欲，闻不能解，亦勿为说。 设复有人，不信是经，闻有受持供养、斋戒读诵而毁谤之，轻贱憎嫉而怀结恨，是人之罪，甚为巨重：命终之日，堕地狱中，经无数劫，婴大徒苦； 从地狱出，还堕畜生之中，受诸漏形疥癞、万毒恶疮，皆以身受，虽云得生，其苦颇重。 谤斯经故，获罪如是。 若此罪人，后生人中，诸根暗钝，偏曳挛癖，盲聋背伛； 其有所言，人不信受，口气常臭，鬼魅所着； 贫穷下贱，为人所使，多病消瘦； 又无衣服，虽亲附人，人不在意； 若有所得，寻复亡失； 或为医道，顺方治病，更增他疾，或复致死； 若自有病，无人救疗，设服良药，而复增剧； 反逆劫盗，重辄横罹其殃。 如斯罪人，永不得见众圣神王说法妙经。 若有持戒清洁之人，翘心信道，希求大乘，此诸人等，乃可为说灵宝妙经。 道君稽首，请问天尊：自此末世，若有善男子、善女人，闻是灵宝经，随所愿欲赍金宝信受，及往观听，得几许福？ 尔时，元始天尊告道君曰：当今末世，若有清信道士及余智者，不问长幼，忽闻是经，若能受持餐味为善者，乃於功德之处，敷演此事，其中闻者，又发信心，功德甚大。 譬如一人，家室富盛，心发大愿，布施财宝以给众乏； 又以道法教导众生，令得下仙，飞腾五岳。 其福多不？ 道君稽首曰：甚多。 天尊曰：其人但施珍宝给与众生，其功无量； 况复教之神方，令得升仙。 此功虽重，故不如闻此灵宝经而为欢喜，其功甚大，倍於施主，非可算计、譬喻得知。 而此之人，所为不多，乃获此功，况复赍受而为供养者耶。 若复有人，於讲法处； 若复有人，曾入斋戒，乃语友人：有此灵宝尊经，言辞深妙，共往听受。 是人功德，转身得於大乘之迹，利根智慧，百千万世终不喑痖； 口气不臭，舌常先病，口亦无病； 齿不垢黑，不黄不疏，亦不缺落； 唇不下垂，亦不搴缩； 口不喎斜，不厚不大，亦不黧黑，无诸可恶； 鼻不月扁月弟，亦不曲戾； 面色不黑，亦不屈曲。 无有一切不可喜相，唇舌牙齿悉皆严好，鼻隆高直，面貌圆满，眉高而长，额广平直，人相具足； 世世所生，常与福会，亦与经教相遇。 令人往听，功德如此，何况一心斋戒，承受读诵，其福无量，不可思议。 尔时 ，天尊以偈颂曰： 若人於斋戒，得闻是经音。 斯人功为重，获福陪#1 为深。 如有大施主，供给无量宾。 乃复为演法，令其入仙真。 暂生若水泡，疾生厌离心。 得道位真人，三明通六神。 不如一句经，教化同法人。",
      "translated_text": "Alas, all sentient beings,\nSunk deep in suffering and affliction.\nThus I do not manifest this body,\nThat they may contemplate the wondrous Dao.\nFor in their hearts they yearn and long,\nI expound for them the Numinous Treasure.\nAscending in spirit to the Jade Capital,\nIts palaces most rare and fine.\nWhen kalpas end, fire and water sweep,\nThat land follows its course in vastness.\nJade groves gleam with blossoming fruit,\nDharma pools where one may bathe and refine.\nAbiding in non-action, the Cavern of Non-action,\nNo need to eat, yet fully sated.\nEnjoying life without end,\nFulfilling the vow to guard the Three Treasures.\nPity these sentient beings,\nWhose evil karma is the cause and condition.\nFor ten thousand kalpas they suffer in anguish,\nNever hearing the Numinous Treasure scriptures.\nThe wise cultivate merit and virtue,\nGentle and harmonious, their nature firm and steadfast.\nSeeking the place of the Dao’s arising,\nConceived and born within the lotus blossom.\nDharma sounds awaken ear and eye,\nAll hosts and all devas together.\nAscending as immortals, their lives boundless,\nThe virtuous should turn to the worthy.\nThrough long-cultivated karma they attain this,\nBreaking through demonic forces, uprooting defilement.\nTheir lifespan spans countless kalpas,\nTheir nature striving for long life.\nAll afflictions utterly extinguished,\nSwiftly they become the Supreme Perfected.\n\nThe Heavenly Worthy says: This Great Vehicle sutra\nIs most profound and mysterious.\nThose of shallow understanding,\nBewildered, cannot comprehend it.\nOther lesser immortals,\nBelieving the words of the Dao, follow this sutra,\nYet it is not their own wisdom.\nThose filled with anger, arrogance, sloth, and indolence,\nShould not believe this sutra.\nOrdinary beings of shallow understanding,\nDeeply attached to the five desires,\nHearing it, cannot grasp its meaning—\nDo not teach it to them.\nIf there are those who do not believe this sutra,\nYet hear of others receiving, upholding, offering, and observing fasts,\nReading and reciting it, and then slander it,\nDespising, envying, and harboring resentment,\nThe sin of such a person is most grave and heavy.\nWhen their life ends, they fall into hell,\nPassing through countless kalpas,\nEnduring great and bitter suffering.\nEmerging from hell, they yet fall among beasts,\nAssuming leaky forms—scabies, leprosy,\nMyriad poisonous sores—all borne upon their bodies.\nThough they may be said to live, their suffering is extreme.\nFor slandering this sutra, such is the retribution they incur.\nIf such a sinner is later reborn among humans,\nTheir faculties dull and dim,\nLame, crippled, hunchbacked, or bent,\nBlind, deaf, or stooped.\nWhatever they say, none will believe,\nTheir breath ever foul, possessed by ghosts and spirits.\nPoor, lowly, and servile,\nUsed by others, sickly and emaciated.\nLacking clothing,\nThough they cling to others, none regard them.\nIf they gain anything, it soon vanishes.\nShould they practice medicine, following prescriptions to treat illness,\nThey only worsen the ailments, or even cause death.\nIf they themselves fall ill, none will heal them,\nAnd though they take fine medicines, their condition only worsens.\nRebellious, they fall prey to bandits,\nRepeatedly suffering calamity.\nSuch sinners will never\nBehold the assembly of sacred divine kings expounding the wondrous sutras.\nOnly those who uphold precepts and maintain purity,\nWho yearn for the Dao with earnest hearts,\nAspiring to the Great Vehicle—\nOnly such people may be taught the Numinous Treasure’s wondrous sutra.\n\nThe Dao Lord bows his head and asks the Heavenly Worthy:\nIn this latter age, if there are good men and good women\nWho hear this Numinous Treasure sutra,\nAnd according to their wishes, offer gold and treasures in faith,\nOr go to listen to it,\nHow much merit will they gain?\n\nThen the Primordial Heavenly Worthy tells the Dao Lord:\nIn this latter age, if there are faithful Daoists or other wise ones,\nRegardless of age, who suddenly hear this sutra,\nAnd can receive, uphold, and savor its teachings for good,\nExpounding its matters in places of merit and virtue,\nAnd those who hear it then generate faith,\nTheir merit is most great.\nIt is like a wealthy householder,\nWho, moved by great vows, distributes treasures to aid the needy,\nAnd with the Dao’s methods teaches and guides sentient beings,\nEnabling them to become lesser immortals,\nSoaring over the Five Peaks.\nIs their merit not vast?\n\nThe Dao Lord bows his head and says: It is vast.\n\nThe Heavenly Worthy says: That person merely distributes treasures to aid sentient beings—\nTheir merit is already immeasurable.\nHow much more so if they teach them divine methods,\nEnabling them to ascend as immortals.\nThough this merit is weighty,\nIt does not compare to hearing this Numinous Treasure sutra with joy—\nThat merit is far greater, surpassing the benefactor’s,\nBeyond calculation or analogy.\nYet this person’s deeds are few,\nYet they gain such merit—\nHow much more so for those who offer and receive it with devotion.\nIf there are those at the place of Dharma exposition,\nOr those who have entered the fast,\nAnd tell their friends:\n“There is this Numinous Treasure’s venerable sutra,\nIts words profound and wondrous—\nLet us go together to listen and receive it.”\nThe merit of such a person,\nIn their next life, will attain the path of the Great Vehicle,\nSharp in wisdom and insight,\nFor a hundred thousand kalpas never mute or dumb.\nTheir breath not foul, their tongue never first to ail,\nNor their mouth diseased.\nTheir teeth not filthy or black,\nNot yellow or sparse, nor missing or fallen.\nTheir lips not drooping or shriveled,\nTheir mouth not crooked, thick, or large,\nNor dark and sallow, with no repulsive traits.\nTheir nose not flat or sunken,\nNor crooked or bent.\nTheir complexion not dark or twisted,\nWithout any unpleasing features.\nLips, tongue, and teeth all refined and fine,\nNose high and straight,\nFace full and round,\nEyebrows high and long,\nForehead broad and level—\nPossessing all the marks of a noble person.\nIn life after life, they will always encounter good fortune,\nAnd meet with the sutras and teachings.\nTo encourage others to listen brings such merit—\nHow much more so for those who wholeheartedly observe the fast,\nReceive, read, and recite it?\nTheir merit is boundless, beyond conception.\n\nThen the Heavenly Worthy spoke in verse:\n\nIf one, during the fast,\nHears the sound of this sutra,\nThat person’s merit is weighty,\nGaining blessings profound and deep.\nLike a great benefactor,\nProviding for countless guests,\nAnd further expounding the Dharma,\nGuiding them to enter immortality—\nFleeting as a bubble on water,\nSwiftly they awaken the mind of weariness and renunciation.\nAttaining the rank of Perfected One,\nMastering the Three Clarities and the Six Spirits.\nYet it does not compare to a single line of this sutra,\nTeaching and transforming those of the same Dharma.",
      "overlap_context": "ince I attained the immortal Dao,\nCountless kalpas have passed.\nEver expounding the Dharma to teach,\nAll the myriad beings.\nMindful of entering the mysterious true path,\nDivine methods surpassing your form.\nRefining the body with the art of enduring vision,\nAbiding in spirit in the Upper Clarity.\nI ever dwell here,\nWisdom and power in harmony.\nDiligently ascending the Great Veil,\nRoaming and delighting in the Jade Capital.\nAll immortals are my companions,\nSpirit and soul attain ease and glory.\"*",
      "start_char": 2448,
      "end_char": 3694,
      "start_sentence": 118,
      "end_sentence": 181,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.15890455245972,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\无上大乘要诀妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "此人福深厚，功德不可论。 得具足身相，峨峨上圣宾。 口气无臭秽，吐纳出烟馨。 后生天人中，宫殿玩奇珍。 劝人坐听经，真道常为邻。 何况受持者，其福不可陈。 设复有人，以国城、妻子、无量珍宝之物而供养者，是人所得功德，不如受持此灵宝真经，其福最多。 譬如一切川流江河诸水之中，海为第一，此经亦复如是，於诸经中最为其上。 又如众星之中，月为第一，此经亦复如是，於千万亿诸经法中最为照明。 又如白日耀光，能除诸暗，此经亦复如是，能破一切不善之暗。 又如诸小王，圣帝之王最为第一，此经亦复如是，於众经中最为其尊。 又如大梵天王，一切众生之父，此经亦复如是，一切贤圣众仙之父。 此经能救一切众生，离诸苦恼； 此经能大饶益一切众生，充满其愿。 如清凉池能济一切诸渴之者，如寒者得火，如裸者得衣，如子得母，如渡得船，如病得医，如暗得灯，如贫得宝，此大乘经，亦复如是，能令众生等离一切苦、生死之缚。 若人能赍金宝受持供养，若复闻者，其人功德，诸圣神王、天帝之王莫能筹计。 天尊告道君曰：众生可愍，婴诸苦恼，甚在可哀。 吾故殷懃，重说是经。 汝勤广开演，济度一切。 道君稽首，伏受命旨。 当是之时，诸来会者咸皆发自然正真道意，四座神王作礼而退。 无上大乘要诀妙经竟 #1 陪：疑当作『倍』。",
      "translated_text": "This person’s blessings run deep and thick,\nTheir merit beyond all reckoning.\nThey attain a body complete in marks,\nLofty as the noble saintly guests.\nTheir breath holds no foulness or decay,\nBut exhales fragrant smoke with every breath.\nIn later lives among gods and humans,\nThey dwell in palaces adorned with rare treasures.\nExhorting others to sit and hear the sutra,\nThe true Dao remains ever their neighbor.\nHow much more for those who receive and uphold it—\nTheir blessings defy all description.\n\nSuppose there were one who,\nWith a kingdom’s cities, wives and children,\nAnd boundless treasures of rare goods,\nMade offerings of them all—\nThe merit gained by such a person\nWould not equal that of one who receives and upholds\nThis sacred scripture of the Numinous Treasure,\nWhose blessings are the greatest of all.\n\nJust as among all flowing rivers and streams,\nThe sea stands first,\nSo too this sutra,\nAmong all sutras, is supreme.\n\nJust as among all the stars,\nThe moon stands first,\nSo too this sutra,\nAmong the billions of sutras and teachings,\nShines most brightly.\n\nJust as the radiant sun\nDispels all darkness,\nSo too this sutra\nShatters all the darkness of unwholesomeness.\n\nJust as among all lesser kings,\nThe sagely emperor is first,\nSo too this sutra,\nAmong all sutras, is most exalted.\n\nJust as the Great Brahmā Deva King\nIs father to all beings,\nSo too this sutra\nIs father to all the worthy sages and immortals.\n\nThis sutra can save all beings,\nFreeing them from every suffering and affliction.\nThis sutra can greatly benefit all beings,\nFulfilling all their aspirations.\n\nLike a cool, clear pool\nThat slakes the thirst of all who drink,\nLike fire for one who is cold,\nLike clothing for one who is naked,\nLike a mother for her child,\nLike a ship for one who must cross,\nLike a physician for the sick,\nLike a lamp for one in darkness,\nLike treasure for the poor—\nSo too this Great Vehicle sutra\nCan liberate all beings\nFrom every suffering and the bonds of birth and death.\n\nIf one carries gold and treasures\nTo receive, uphold, and make offerings to it,\nOr if one merely hears it,\nThe merit of such a person\nCannot be reckoned even by the saintly spirit-kings\nOr the kings of the heavenly emperors.\n\nThe Heavenly Worthy addressed the Lord of the Dao, saying:\n“Beings are pitiable,\nEnsnared in suffering and affliction—\nHow deeply sorrowful!\nFor this reason, I earnestly expound this sutra again.\nYou must diligently and widely proclaim it,\nTo deliver and save all beings.”\n\nThe Lord of the Dao bowed his head,\nReverently receiving the command.\n\nAt that time, all those gathered in the assembly\nAwakened the mind of the natural, true, and correct Dao.\nThe fourfold assembly of spirit-kings bowed in homage and withdrew.\n\nThus concludes the *Supreme Great Vehicle Essential Teachings Wondrous Sutra*.",
      "overlap_context": "nd of this sutra,\nThat person’s merit is weighty,\nGaining blessings profound and deep.\nLike a great benefactor,\nProviding for countless guests,\nAnd further expounding the Dharma,\nGuiding them to enter immortality—\nFleeting as a bubble on water,\nSwiftly they awaken the mind of weariness and renunciation.\nAttaining the rank of Perfected One,\nMastering the Three Clarities and the Six Spirits.\nYet it does not compare to a single line of this sutra,\nTeaching and transforming those of the same Dharma.",
      "start_char": 3694,
      "end_char": 4223,
      "start_sentence": 182,
      "end_sentence": 204,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.766951560974121,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\无上大乘要诀妙经.txt",
        "category": "本文类"
      }
    }
  ]
}