{
  "source_id": "无上三元镇宅灵箓",
  "source_file": "chunked_daozang\\无上三元镇宅灵箓.json",
  "total_chunks": 7,
  "total_original_chars": 7721,
  "total_translated_chars": 51189,
  "total_translation_time": 223.34879517555237,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\神符类\\无上三元镇宅灵箓.txt",
    "category": "神符类"
  },
  "full_translation": "**The Supreme Three Primordials Talisman for Pacifying the Household**\n\n**Scripture Title:** *The Supreme Three Primordials Talisman for Pacifying the Household*. The author is unknown, roughly dating to the late Northern and Southern Dynasties or the Sui-Tang period. It falsely attributes its revelation to the Jade Emperor’s descent to the Seven Perfected of Golden Radiance. One scroll. Base text from the *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Shenfu* Category.\n\n---\n\n**The Supreme Three Primordials Talisman for Pacifying the Household**\n\nOn the fifteenth day of the tenth month in the *renshen* year, at the *yin* hour, the Supreme Jade Emperor of the Utmost Non-Polarity, the Great Dao Lord of the Primordial Beginning of the Supreme Three Primordials, descended to the Upper Palace of the Layered City upon Kunlun Mountain. At that time, the assembled Perfected hovered in the void, their majestic radiance resplendent above the ethereal clouds. The Lord issued a luminous decree to the Seven Perfected of Golden Radiance, saying: \"You shall serve as the true Dharma masters of the ten directions for the coming kalpa. Those who aspire to perfection must first prioritize saving the world, widely accumulating merit to deliver all celestial and human beings. Such merit is supreme; when merit is perfected and virtue universal, the Dao is naturally attained.\"\n\nThereupon, the Seven Perfected preserved their true nature, observing the ten contemplations. Golden radiance and primordial light dissolved into stillness, and the Mysterious Heavenly Worthy appeared in the wondrous realm of the Utmost Non-Being of the Supreme Three Primordials. They bowed their heads in reverence and inquired of the Heavenly Worthy: \"In recent years, the Three Realms have collapsed, and between heaven and earth, the *qi* of humans, ghosts, and warfare clamors day and night. In this age of the final kalpa, how could we, the Seven Perfected, in our ignorance and delusion, know how to bring salvation? We humbly beseech your enlightenment, that we may attain right awakening in this realm and serve as a bridge of Dharma to save the world—not only bestowing blessings in this life but also delivering future generations and broadly guiding those yet to come. We implore the Heavenly Worthy to reveal the truth and pardon our inadequacies.\"\n\nThen the Heavenly Worthy addressed the Seven Perfected of Golden Radiance, saying: \"You are destined to receive the prophecy and become the true Dharma masters of the ten directions, the great sages of the orthodox Dharma. You shall turn the Wheel of the Golden Perfected Dharma. This Dharma Wheel is the supreme, wondrous, and orthodox king among the great vehicles of the true Dharma. Its merit is towering and vast, encompassing all phenomena, possessing boundless virtue beyond comparison. Only the loftiest and most noble of beings could establish such merit and lay this foundation of blessings. Yet the sentient beings of the Three Realms are drowning in the sea of suffering. The dead lie buried in the dark night, their souls enduring myriad torments, while the living, unfortunate to encounter this final kalpa, suffer under the cycles of the Three Calamities and Five Defilements. A hundred evils converge, and disasters and warfare persist—how can this not evoke sorrow?\n\nHowever, the great merit of the supreme vehicle is not something the multitudes of the world can ordinarily cultivate. Therefore, I now bestow upon you the *Great Register of the Upper Primordial Heavenly Officials, the Divine Tallies for Restraining Ghosts, Subduing Demons, and Seizing Spirits*, entrusting it to you under the name *The Supreme Three Primordials Talisman for Pacifying the Household*. With this, you may assist the upright *qi* of heaven and earth, aid the state and the times, and align with the mandates of the Three Primordials, thereby delivering the world. It is sealed with the seal of the Supreme Three Primordials. When placed above the halls and doorways of celestial and human dwellings, it will drive away the malevolent spirits, plagues, epidemics, and disasters of the ten and five directions, the *qi* of a hundred poisons, inauspicious omens, demonic apparitions, and anomalous phenomena, restraining them all. It will prevent the leakage of myriad calamities, warfare, ghosts, and spirits, forever preserving the household in effortless tranquility. Those who obtain it will be safeguarded from the Three Calamities and the great tribulations of the Five Defilements. If a virtuous ruler of a nation encounters this Dao, their reign will be peaceful, and as the ruler and ministers practice the Dao, the state will endure long.\n\nThe Seven Perfected then bowed their heads and prostrated themselves, receiving the sacred register. The Heavenly Worthy declared: \"Now I shall universally proclaim this to heaven and earth, that all may bear witness to this covenant.\" At the head of the pacifying talisman, it commands the restraint of all improper *qi*, guiding them into the orthodox Dharma. The Seven Perfected bowed in reverence and received it, pledging to the Heavenly Worthy: \"We shall diligently follow the Dharma as prescribed.\" Upon the completion of the rite, the Heavenly Worthy ascended into the void and vanished.\n\n---\n\n**The Supreme Three Primordials Talisman for Pacifying the Household**\n\nThe Supreme Jade Emperor of the Utmost Non-Polarity, the Great Dao Lord of the Primordial Beginning of the Supreme Three Primordials, now descends to bestow upon the Seven Perfected of Golden Radiance *The Supreme Three Primordials Talisman for Pacifying the [Recipient’s] Household*. On the fifteenth day of the tenth month in the *renshen* year, at the *yin* hour, it is universally proclaimed to:\n\nThe True Sovereigns of the Three Heavens—Qingwei, Yuyu, and Dachi—the Heavenly Officials of the Jade Controller of Heaven; the Highest Officials of the Nine Heavens under the Jade Emperor; the Life-Commanding Officials of the Thirty-Two Heavens; the Recording Officials of the Flying Celestial Divine Sovereigns of the Ten Directions; the Lords of the Supreme Jade Emperor, the Great Emperor, the Heavenly Emperor, and the Great Unity who command life, record deeds, hold the reckoning, and extend lifespan; the Heavenly Officials of the Nine Heavens and Nine Earths; the Celestial Bodies—the Sun, Moon, Stars, the Jade Armillary Sphere, the Seven Stars of the Northern Dipper, and the Five Emperors of the Four Controllers; the Boundless, Unfathomable, and Utterly Mysterious Perfected Sages and Venerable Divinities of the Ten Directions; all the infinite divine officials and spirits of the Three Realms; the myriad divine lords, generals, and functionaries of the Three Primordials, Nine Palaces, Eight Trigrams, and Six *Jia* of Heaven, Earth, and Water; the divine spirits of the Five Sacred Mountains, the great marshes, the Three Rivers, the Four Watercourses, the Nine Rivers, the Huai, the Ji, the vast oceans, and the nine provinces and their domains; the mountain forests and the Twelve Streams of Mengchang; the Root-Source and Primordial Earth Gods; the true officials, generals, and functionaries of the altars of soil and grain; and all the divine spirits of heaven, regardless of rank—all shall convene with the Seven Perfected of Golden Radiance to swear this covenant.\n\nFrom this day forth, after the sealing of *The Supreme Three Primordials Talisman for Pacifying the Household*, none shall violate this pact by unleashing demonic soldiers, ghosts, spirits, plagues, pestilences, or calamities to invade the household’s gates, chambers, men, women, elders, or children. Should any evil seek to disrupt the upright, the Three Primordials’ Nine Divisions of the Supreme Divine Generals and Soldiers guarding the household shall apprehend them and dispatch them to the northern reaches of Fengdu, the Great Yin, to the courtyard of the Nine Nights of Ice. There, they shall be handed over to the officials of wind, blades, water, and fire, to be judged according to the laws of the Nine Capital Offices and tormented for ninety thousand kalpas without reprieve.\"\n\nSwiftly, swiftly, in accordance with the statutes and decrees of the Primordial Celestial Worthy of the Jade Emperor of the Supreme Dao.\n\nThe Supreme Upper Prime of the Qingwei Heaven’s Orthodox Dharma Jade Canon Bureau’s Rectifying Supreme Numinous Guarding and Defending Great General, one, with his official generals and household-guarding soldiers, three hundred sixty myriad in number.\nThe Supreme Upper Prime of the Qingwei Heaven’s Capital Orthodox Jade Bureau’s Supreme Numinous Guarding and Defending Great General, one, with his official generals and household-guarding soldiers, three hundred sixty myriad in number.\nThe Supreme Upper Prime of the Qingwei Heaven’s Orthodox Dharma Jade Bureau’s Grand Supervisory Supreme Numinous Guarding and Defending Great General, one, with his official generals and household-guarding soldiers, three hundred sixty myriad in number.\n\nThe Primordial Celestial Worthy of the Jade Emperor of the Supreme Limitless Dao commands the Supreme Upper Prime of the Qingwei Heaven’s Orthodox Dharma Jade Bureau’s Three Guarding and Defending Generals, each with their household-guarding soldiers, three hundred sixty myriad in number, to strictly marshal their troops and guard and defend the residence of the Orthodox Dharma Disciple of the Great Dao’s Pure and True Upright Teachings, [Name]’s household, in the four directions, eight quarters, above, below, and center, with thirty-six myriad layers of defense.\n\nShould any seek to invade [Name]’s gates and chambers or violate the Orthodox Dharma Disciple, the generals and soldiers shall rouse the majesty of Heaven and instantly apprehend all treacherous ghosts and thieves, pestilential and unrighteous spirits, and immediately dispatch them to the officials of wind, blades, water, and fire in the northern reaches of Fengdu for interrogation. Should any of the generals or soldiers conceal such malefactors, they shall share in the same punishment.\n\nNone but the ancestral spirits of [Name]’s lineage shall be permitted entry. After the sealing of the residence, may the registers of [Name]’s household, young and old, men and women, be eternally safeguarded, enabling them to transcend the tribulations of the Three Calamities.\n\nSwiftly, swiftly, in accordance with the statutes and decrees.\n\nThe Supreme Middle Prime of the Yuyu Heaven’s Bureau of Rectifying Illustrious Might’s Supreme Numinous Guarding and Defending Great General, one, with his official generals and household-guarding soldiers and cavalry, three hundred sixty myriad in number.\nThe Supreme Middle Prime of the Yuyu Heaven’s Bureau of Dharma Illustrious Might’s Supreme Numinous Guarding and Defending Great General, one, with his official generals and household-guarding soldiers and cavalry, three hundred sixty myriad in number.\nThe Supreme Middle Prime of the Yuyu Heaven’s Bureau of Non-Illustrious Might’s Supreme Numinous Guarding and Defending Great General, one, with his official generals and household-guarding soldiers and cavalry, three hundred sixty myriad in number.\n\nThe Primordial Celestial Worthy of the Jade Emperor of the Supreme Dao commands the Supreme Middle Prime of the Yuyu Heaven’s Bureaus of Rectifying, Dharma, and Non-Illustrious Might’s Three Generals, each with their household-guarding soldiers and cavalry, three hundred sixty myriad in number, to strictly marshal their divine officials and troops, guarding and defending the residence of the Orthodox Dharma Disciple of the Great Dao’s Pure and True Upright Teachings, [Name]’s household, in the four directions, four corners, and twelve earthly branches, inspecting and restraining the household at all hours.\n\nThe Azure Dragon, White Tiger, Vermilion Bird, Dark Warrior, Hook Star, and Hidden Dragon shall jointly provide defense, each with thirty-six myriad layers, encircling [Name]’s residence to repel all malevolence, overseeing the five directions’ pestilential disasters, epidemic poisons, and specters; the wandering ghosts of the void; the sunken corpses and concealed slayings of the earth; the spirits of gold, silver, copper, iron, jade, and stone; the residual qi of the Six Heavens; the numina of shamans, shrines, and household temples; and any spirits or demons within [Name]’s household or its surroundings. The generals and soldiers shall rouse the majesty of Heaven, display their divine might, apprehend and dispatch them to the Nine Dark Prisons of Fengdu’s northern reaches, expelling all inauspicious influences. Henceforth, in the sealing of [Name]’s household registers, none but the spirits of the ancestral lineage shall be permitted entry. Should any of the generals or soldiers harbor malevolence or bring harm to [Name], they shall be seized and interrogated alongside the wicked without reprieve.\n\nSwiftly, swiftly, in accordance with the statutes and decrees.\n\nThe Supreme Lower Prime of the Great Red Heaven’s Orthodox Dharma’s Four Guardians’ Direct Numinous Guarding and Defending Great General, one, with his official generals and household-guarding officers and soldiers, three hundred sixty myriad in number.\nThe Supreme Lower Prime of the Great Red Heaven’s Orthodox Dharma’s Four Bureaus’ Direct Numinous Guarding and Defending Great General, one, with his official generals and household-guarding officers and soldiers, three hundred sixty myriad in number.\nThe Supreme Lower Prime of the Great Red Heaven’s Orthodox Dharma’s Four Prospects’ Direct Numinous Guarding and Defending Great General, one, with his official generals and household-guarding officers and soldiers, three hundred sixty myriad in number.\n\nThe Primordial Celestial Worthy of the Jade Emperor of the Supreme Dao commands the Supreme Lower Prime of the Great Red Heaven’s Four Guardians, Four Bureaus, and Four Prospects’ Direct Numinous Generals, each with their Lower Prime household-guarding officers and soldiers, three hundred sixty myriad in number, to strictly guard and defend the residence of the Orthodox Dharma Disciple of the Great Dao’s Pure and True Upright Teachings, [Name]’s household, with thirty-six myriad layers of defense, restraining [Name]’s household at all hours.\n\nAll taboos, the Great General of the Year Star, the Gate Marshal, the Door Warden, the Well and Hearth Spirits, along with [Name]’s ancestral spirits of past generations and the local earth deities, shall abide by this pact. The Seven Perfected now adhere to the Mysterious Regulations.\n\nThe Primordial Celestial Worthy of the Jade Emperor of the Supreme Dao’s Supreme Wondrous Mahāyāna Orthodox Dharma seals the residence for [Name] with the *Supreme Three Primes’ Numinous Register for Guarding the Household*.\n\n[Name], bowing reverently, declares himself a disciple of the Great Dao’s Pure and True Teachings and seals this with the seal of the Supreme Three Primes. On this day, the hidden and manifest are equally illuminated; the Jade Bureaus of the various heavens witness the covenant. The Three Heavens proclaim the mandate, heard in no darkness, answered in no obscurity, obeyed by no heaven, unsupported by no earth.\n\nFrom this day forth, none shall cause [Name]’s gates and chambers to be afflicted by calamities, misfortunes, or sudden adversities; by the dualities of yin and yang, water and fire; by the residual qi of the Six Heavens; by demonic spirits, ghostly thieves, or any wandering dead who are not of the ancestral lineage; or by any malevolent forces violating [Name]’s household, young and old, men and women. Those who do not submit to the Orthodox Dharma shall be seized by the generals and officers, who shall rouse their might in the eight directions, apprehend the multitude of spirits, and dispatch them to the Water Palace of Fengdu’s Courtyard of the Nine Nights of Ice, where the Nine Capital Offices shall detain and interrogate them for endless kalpas without reprieve.\n\nSwiftly, swiftly, in accordance with the statutes and decrees of the Nine Capitals.\n\nRespectfully recorded, the names of [Name]’s deceased ancestors are as follows:\nDeceased great-grandfather [Name], deceased great-grandmother [Name],\nDeceased grandfather [Name], deceased grandmother [Name],\nDeceased father [Name], deceased mother [Name].\n\nTo the right, the three generations of [Name]’s ancestral spirits are now sealed and entrusted to the generals, soldiers, and officers of the Supreme Three Heavens.\n\nThese are the bounds of the ancestral shrine of [Name], not to be transgressed on ordinary occasions. None shall rashly demand sustenance from the living, nor bring about misfortunes, hauntings, illnesses, or afflictions upon descendants and posterity. Should any violate this, they shall be dispatched together to the Nine Capitals and forever consigned to the law officials. If, however, they bring blessings and benefit to [Name]’s household, the Jade Bureau of the Three Heavens and the Generals of Household Protection shall promote and elevate them, reporting their names to the Three Heavens and memorializing their merits, raising them to the Primordial Life and Blessing Hall of the Nine Heavens, where they shall be granted natural garments and sustenance, dwelling in carefree non-action. They shall abide long in the realm of blessings, aiding and benefiting the living, all in accordance with the statutes and decrees.\n\n**Supreme, Supreme, Supreme Primordial Most High Jade Emperor of the Boundless Dao, Pure and True Orthodox Dharma.**\n\nDisciple [Name], of [Prefecture], [County], [Village], aged [Number] years, male [Name], female [Name]. To the right, this household of [Number] persons is now sealed with the talisman of the Supreme Three Origins and entrusted to the orthodox dharma officials of the Jade Bureau of the Supreme Three Heavens, along with the Three Generals of the Supreme Three Origins, to safeguard the lifespans of [Name]’s household, to secure and defend [Name]’s palace and residence. Each shall command the soldiers, cavalry, officers, and troops under their jurisdiction, encircling and protecting [Name]’s residence with thirty-six myriad layers, all in accordance with the statutes and decrees of the Supreme Primordial Most High Jade Emperor of the Dao.\n\nIn the year [Year], month [Month], day [Day] of the Great Year Star [Name], at the midnight hour, the Seven Perfected of Golden Radiance sealed this in [Village].\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Upon sealing the *Supreme Three Origins Talisman of Household Protection and Upper Numinous Register*, when the three celestial talismans within the register are activated, one shall visualize the Supreme, Supreme, Supreme Primordial Most High Jade Emperor of the Dao, his golden countenance radiant and luminous, descending together with the Three Venerables of Golden Radiance, coalescing and abiding in the cloudy void above. One shall further visualize the Three Generals of the Three Heavens, each with thirty-six myriad soldiers, cavalry, officers, and troops, filling the ten directions, all coming to secure and defend [Name]’s residence with thirty-six myriad layers, no different from mortal armies.\n\nThe talismanic incantation is as follows:\n*\"Void and Jade Emperor, the Jade Heaven opens forthwith,\nThe Jade Clarity issues its decree, named Golden Perfection.\nThe Jade Void’s luminous might, the Three Heavens generate spirits,\nOrthodox dharma’s mysterious model, the talisman commands the Nine Heavens.\nGather qi to assist the omen, inspect the essence as flowing smoke,\nCommand ghosts and summon demons, sweep away all impurities.\nSpiritual generals secure the defense, celestial soldiers as neighbors,\nThe orthodox Dao moves in motion, protecting the omen this dawn.\nMyriad spirits crushed and destroyed, dare not encroach upon the omen’s body.\nI command the divine lords, universally brushing away demonic dust.\nThose who do good shall be promoted, those who rebel shall be expelled.\"*\n\nSwiftly, swiftly, in accordance with the statutes and decrees.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: For all celestial, human, and terrestrial beings who first receive the *Supreme Three Origins Talisman of Household Protection and Upper Numinous Register*, they shall offer two *shi* and four *dou* of life-sustaining rice from the Mysterious Capital’s Register of Destiny, along with five-colored silks corresponding to the five directions in appropriate quantities, one bolt each of purple-woven and plain white silk, and two strings and four hundred cash. These shall be presented with the twenty-four life-generating qi of the Upper Origin, corresponding to the twenty-four life-generating spirits’ primordial destiny, also symbolizing the twenty-four grottoes of primordial generation, and below, the twenty-four spirits representing the numbers of the Three Origins. All shall comply with the statutory provisions without violation.\n\nThe Seven Perfected state: For celestial, human, and terrestrial beings first undertaking this rite, they may also offer one *shi* and two *dou* of rice, one string and two hundred cash, and twelve bolts of silk; or eight bolts of silk, eight hundred cash, and eight bolts of silk. The twelve numbers correspond to the twelve perfected spirits, and the eight numbers accord with the eight trigrams.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: For all celestial, human, and terrestrial beings who receive the *Supreme Three Origins Talisman of Household Protection and Upper Numinous Register*, they shall annually deliver two *shi* and four *dou* of life-sustaining rice from the Mysterious Capital’s Upper Origin, along with five-colored silks, plain white silks, and cash, to the master’s gate. The master, having received the disciple’s life-sustaining rice, silks, and cash, shall allocate eight portions for meritorious deeds, to be offered to the emperors and sovereigns of the ten directions and all heavens, as well as the local imperial lords and kings, for the establishment of grand feasts of the Golden Perfection Dharma Wheel. Another eight portions shall be used to establish the Three Origins, promoting and rewarding the generals, soldiers, and officers of household protection for the disciple, reporting their merits and advancing their ranks. Eight portions shall be used to provide for the impoverished throughout the world and the Daoist recluses dwelling in the mountains. Violators shall be judged according to the penal statutes of the Nine Capitals.\n\nThe Seven Perfected state: For celestial beings who are impoverished, they may also offer rice, silk, and cash without fixed quantities, to fulfill the master’s requirements for meritorious deeds.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: For all celestial, human, and terrestrial beings who receive the *Supreme Three Origins Talisman of Household Protection and Upper Numinous Register*, if they fail to deliver the life-sustaining rice within the prescribed time, the Three Heavens’ Bureau of Destiny shall deduct ten years from the omen’s lifespan. If they comply with the annual offerings to the master’s gate, the Bureau of Destiny shall add ten years to the omen’s lifespan, all in accordance with the statutes.\n\nDisciples shall cultivate themselves, purify their conduct, establish natural fasts, burn incense, practice the Dao, recite scriptures, perform repentance rites, and illuminate the night with lamps. They shall pray for blessings six times daily and nightly, promoting and rewarding the celestial officials of household protection. If no master is present in the disciple’s dwelling to perform the rites, household members may also visualize Golden Radiance in their hearts and maintain equilibrium—this, too, is essential. On the Three Origins’ days, if disciples do not observe fasts and uphold precepts, the Upper Origin’s Jade Bureau celestial officials shall not inscribe the omen’s name in the Register of Primordial Life, and they shall be judged according to the Three Punishments statutes.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Should the Son of Heaven, kings, or feudal lords seek to pacify the state, secure the people, and enjoy boundless prosperity while safeguarding the altars of soil and grain, they shall all seal this numinous register to secure the gates of the imperial palace and the kingdom’s halls.\n\nThe Seven Perfected state: The emperors, supreme emperors, and celestial lords of the ten directions and all heavens shall each seal this register upon the jade caskets and gates of their celestial palaces.\n\nMoreover, how much more does this apply to the Son of Heaven, kings, and feudal lords of the lower realms?\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The flying celestial emperors of the ten directions, all Brahma-heaven kings, and the celestial lords of the Five Directions and Five Emperors shall each seal this numinous register to secure the movements of Heaven and Earth, to safeguard the proper measure of the primordial celestial origin, to harmonize and regulate the qi of yin and yang, thereby attaining the transformations of spontaneity and ruling through the spontaneity of natural order.\n\nThe Seven Perfected state: If even the supreme emperors and perfected sages of the ten directions’ heavens revere and uphold this numinous register, how much more should the people of the world below do so?\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Should a Dharma-master, when sealing the numinous register for a disciple, collect the life-rice, sealing offerings, or faith tokens, yet fail to employ them according to the three-grade standards for merit-bestowing purposes, the Dharma-master shall be bound and examined by the officials of the Nine Capitals and judged according to the Nine Kalpas’ penal statutes.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: If a Dharma-master collects from a disciple the yearly repayment of life-rice, sealing offerings, or faith tokens for personal use or to provide for his family, yet fails to establish merit and blessings for the disciple, his offense shall be examined by the officials of the Nine Capitals and his name recorded under the statutes of the Three Punishments and Five Kalpas.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Should a Dharma-master, on the great celebratory days of the Three Origins, fail to establish merit for his disciple or promote and reward the generals, soldiers, and officers, the Dharma-master shall incur misfortune and punishment in the capital of the Dead King and his name recorded under the statutes of the Three Punishments and examination laws.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Should a Dharma-master, on the days of the Three Origins, be unable to petition the Jade Bureau of the Three Heavens on behalf of a disciple’s household to inscribe their names in the Register of Life of the Upper Office of Divine Birth, the Dharma-master shall suffer various calamities in this life and, upon death, be judged under the statutes of the Nine Dark Prisons and Nine Punishments.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: In all the boundless worlds of the ten directions’ heavens and earths, should any household among the common people—men or women—encounter disasters, strange omens, or monstrous anomalies; should malevolent spirits summon hordes of misfortune; or should they perpetually bring harm to the celestial and human realms, they must, in accordance with the Orthodox Dharma, present life-rice, life-silks, life-plain cloth, and spirit money to the Dharma-master to seal the numinous register.\n\nThe Seven Perfected state: Those who obtain the numinous register shall not only be protected from disasters and calamities but also avert the great and minor Yang-Nine and great and minor Hundred-Six catastrophes in years of water, fire, wind, or blade.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Should the Orthodox Dharma disciples of the ten directions’ heavens and earths seal this numinous register upon the gates and doors of their palaces and residences, it shall render the qi of humans and spirits pure and clear, the palace and residence solemn and serene. The heavens shall send protection, the officials of the Three Realms shall all come to guard the gates, and the celestial and terrestrial deities shall serve the Orthodox Dharma disciples, perpetually paying homage and bowing before the numinous register while defending the gates and courtyards, none daring to harbor harmful intent.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Should the Orthodox Dharma disciples of the ten directions’ heavens and earths encounter illnesses, calamities, or misfortunes in their households; should yin perils, water, fire, bandits, or thieves threaten harm; or should they perpetually suffer invasions or disturbances, the head of the household may bathe, don solemn attire, maintain a fast, burn incense beneath the numinous register, perform nine bows, and then declare the severity of the disaster or calamity, petitioning for relief while concentrating the mind upon the Three Departments.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Should the households of the Orthodox Dharma disciples of the ten directions’ heavens and earths gain a member after three years, they must reseal the numinous register. If a household loses fortune and a member after three years, they must also reseal the numinous register. If there is neither gain nor loss after three years, resealing is unnecessary, but the register must be renewed and resealed after nine years. Should the register not be renewed, the generals, soldiers, and officers shall receive merit and ascend to heaven, and thus the register must be renewed and resealed. Should the disciple fail to renew it after nine years, he shall be judged according to the Three Punishments statutes.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The Orthodox Dharma disciples of the ten directions’ heavens and earths who seal the numinous register must not worship talismanic temples, ghostly deities, heterodox masters, or shamans, nor seek blessings through fragile offerings. Those who violate this shall be judged according to the Three Punishments statutes.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: After sealing the numinous register, the Orthodox Dharma disciples of the ten directions’ heavens and earths must not summon non-human entities, nor invite qi-manipulators, female mediums, or entertainers to perform songs and dances within their residences. Those who engage in such non-Orthodox practices shall be judged under the statutes of the Three Punishments of the Dark Prisons.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The Orthodox Dharma disciples of the ten directions’ heavens and earths who seal the numinous register must not betray their master or violate their covenant. Those who do so shall have their generals and soldiers ascend to the celestial palaces, never again to guard their residences. Their offense shall be judged under the statutes of the Great Yin penal laws.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: After sealing the numinous register, the Orthodox Dharma disciples of the ten directions’ heavens and earths must assist their Dharma-master in establishing three thousand virtuous deeds, enlightening celestial and human beings, and cultivating fields of supreme merit, thereby attaining the true tenth rank and ascending to the position of Upper Immortal.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The households of the Orthodox Dharma disciples of the ten directions’ heavens and earths who seal the numinous register shall, on the fifteenth day of the first, seventh, and tenth months—the days when the celestial, terrestrial, and water officials of the Three Origins examine and record the names of humans and ghosts to determine the registers of life and death, merit and sin—have their sealing-register generals, soldiers, officers, and troops, totaling 360,000 each, manifest visibly, encircling the palace and residence to display their might, defend, and capture and restrain all malevolent forces.\n\nThe Seven Perfected state: Those who act thus shall find no disaster unaverted, no calamity unendured, no misfortune undispelled, no blessing unborn, no banditry undestroyed, no virtue unsuited, no evil unremoved, no spirit unrepelled, no wickedness unsubdued, and no fortune unattained.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Should the Orthodox Dharma disciples of the ten directions’ heavens and earths wish to dispel disasters, eliminate spirits, and eradicate misfortune, they must strike the celestial drum thirty-six times and recite the incantation:\n\nThe Three Generals, Officers, and Soldiers of the Supreme Upper Qingwei Heaven—Qingwei Heaven—Qingwei Heaven, each numbering 360,000, shall be dispatched for [the disciple] to restrain and suppress the qi of weaponry disasters. The Three Generals, Officers, and Soldiers of the Supreme Yuanyu Heaven—Supreme Yuanyu Heaven—Supreme Yuanyu Heaven, each numbering 360,000, shall be dispatched for [the disciple] to eliminate the inauspicious qi of the Five Directions, the six harms, and the unruly qi of demonic spirits. The Three Generals, Officers, and Soldiers of the Supreme Great Red Heaven—Great Red Heaven—Great Red Heaven, each numbering 360,000, shall be dispatched for [the disciple] to eradicate the qi of plague, pestilence, weaponry disasters, water and fire calamities, and all afflictions, thereby ensuring their immediate annihilation.\n\nFor [the disciple], they shall muster their might, mobilize their forces, and establish layered defenses—each layer comprising 360,000 troops—fortifying the residence with encampments on all four sides and eight directions, ensuring strict vigilance and protection. This is done in accordance with the decrees of the Supreme Most High, the Jade Emperor, the Great Dao Lord.\n\nThe Seven Perfected state: Should the disciple’s household be gripped by fear, encountering ominous lights, strange apparitions, or demonic influences, or if the family suffers from various disasters and misfortunes, or if neighboring households bring harm through mutual destruction, or if dreams at night are unsettling, or if there is dread of plagues, floods, fires, bandits, or any who seek to inflict harm—all such afflictions shall be addressed by reciting this incantation. The calamities will vanish instantly, and you shall be safeguarded, remaining untroubled.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: When a Dharma Master seals and consecrates the Spirit Register for the disciples of the ten directions’ heavens and earths, they must strictly adhere to the procedures and rituals of transmitting the Mysterious Register, presenting the memorial in proper order. Once the memorial is presented, the Dharma Master and the disciple shall stand facing each other—north and south—before the sacred altar. The Dharma Master shall then recite the names of the generals and soldiers of the Spirit Register, and the disciple shall repeat them aloud. After the disciple has received the register, the Dharma Master shall empower the register with incantations and seals, subsequently sealing it with the chapters of the Supreme Three Origins. The Dharma Master shall then bestow the Spirit Register upon the disciple, who shall bow deeply before the Dharma Master, declaring: \"I, [disciple’s name], a disciple of the Orthodox Dharma of the Pure and True Dao, hereby pay homage with nine prostrations.\"\n\nThe Seven Perfected state: The sealing of the Spirit Register, the submission of official memorials, and all related procedures must adhere to the rituals of transmitting and administering the register. There shall be no deviation, save for minor adjustments in the wording of the chapters.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: After receiving the Spirit Register, the disciples of the ten directions’ heavens and earths must not engage in robbery, plunder, or collusion with malevolent individuals, nor allow such persons to enter their households. Should they violate this, as registered disciples under the jurisdiction of the Heavenly Officials, they shall be subject to the Three Punishments of the Nine Capital Laws.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: After receiving the Spirit Register, the disciples of the ten directions’ heavens and earths must not profane the register with impure qi or show disrespect toward the spirits. Violations shall be judged under the laws of the Nine Dark Realms.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The disciples of the ten directions’ heavens and earths shall place the Spirit Register above the main hall or household entrance to suppress all unruly and inauspicious qi of the myriad spirits.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The disciples of the ten directions’ heavens and earths must not treat the Spirit Register with contempt. Violations shall be subject to the same penalties as the Nine Capital Laws.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The disciples of the ten directions’ heavens and earths must not discard or abandon the Spirit Register in another’s household. Violations shall be judged under the laws of the Three Punishments for disrespect.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Whenever the disciples of the ten directions’ heavens and earths enter or exit their households, they must meditate upon the divine images, envisioning the generals and soldiers arrayed around their residence, never forgetting their presence. Thus, disasters shall vanish instantly, and the spirit’s qi shall remain ever-present.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The Three Generals of the Upper Realm stand 3,600 *zhang* in height, their forms resembling vajra, wielding the Nine-Colored Summoning Spirit and Eight Slaying Spirit Staffs of the Jade Emperor. They ride three-colored poisonous dragons, suspended in the void of the Great Emptiness a thousand *zhang* above the earth, leading their troops. Through their divine power and mysterious descent, even if a hundred blades pierce the heart, all malevolence shall be dispelled in an instant. The disciples of the ten directions’ heavens and earths must always envision them thus.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The Three Generals of the Middle Realm stand 3,400 *zhang* in height, their forms resembling those of the Upper Generals. They wield the Seven-Colored Divine Tiger and Great Slaying Spirit Staffs of the Nine Heavens, riding creatures that ward off evil. Suspended five hundred *zhang* above the earth, they lead their divine troops in mysterious descent. Even if a thousand poisons assail, all wickedness shall flee. The disciples of the ten directions’ heavens and earths must always envision their forms thus.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The Three Generals of the Lower Realm stand 3,200 *zhang* in height, their forms identical to those above. They wield the Three-Colored Divine Gold and Demon-Subduing Three Slaying Spirit Staffs of the Three Heavens, riding creatures that guard against inauspiciousness. The generals hover five *zhang* above the earth, while their officers and soldiers stand upon it, their presence enveloping the entire household from above and below. Leading their troops in mysterious descent, they drive the five directions’ plagues, pestilences, and poisons into uninhabited lands, annihilating demonic spirits and ensuring the peace and prosperity of the household. The disciples of the ten directions’ heavens and earths must always envision the forms of these spirit generals and soldiers thus.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The Orthodox Dao gives rise to the Orthodox Dharma; the Orthodox Dharma gives rise to the Orthodox Teachings; the Orthodox Teachings give rise to Orthodox Awakening. Once the disciples of the ten directions’ heavens and earths have entered the Orthodox Unity Dao, they shall transform others through the Orthodox Dharma without coercion, thereby aligning with the proper path of the Heavenly Disciples.\n\nThe Seven Perfected state: \"Transforming without coercion\" refers to the Dao’s wondrous and formless origin, which wondrously responds to the Great Void. Its true emptiness is the utmost emptiness, and the utmost emptiness is the utmost Dao. It transcends the subtle and the true, beyond the reach of human intellect or wisdom. It points to the Great Void, which is itself unfathomable—how much more so the utmost Dao? The Dao’s wondrousness lies in its wondrous non-being, and from this non-being arises its natural efficacy, bringing forth this great existence.\n\nThus, the summation of wisdom constitutes the numinous, and the summation of the numinous returns to insight. This may be called the wondrous center of great illumination, wherein natural and orthodox wisdom arises. Orthodox wisdom is none other than the Orthodox Dao. Its operation stems from inherent efficacy, and its transformation arises from spontaneous function—hence the Four Symbols serve as its foundation, the most wondrous of the wondrous. Therefore, it stands supreme above the myriad Dao; what need is there for coercion?\n\nThe Perfected Great Saints of the ten directions’ heavens all revere and bow their heads in homage, calling themselves disciples. Even the Celestial Perfected and the Great Numinous Ones of the Supreme Emperor act likewise—how much more so the celestial and terrestrial beings, how much more the earthly spirits, how much more the ghosts and gods, who would not desire to take them as masters? Once the Orthodox Transformation has set its pattern, what need is there for coercion?\n\nThose who bow their heads before the Dharma Master are all disciples of the Pure and Orthodox Dharma. Having called themselves disciples, they may be said to have achieved transformation without coercion—this is already inherent within it.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: After the disciples of the ten directions’ heavens and earths receive the Register of Numinous Spirits, they shall not conspire together to forge weapons, plot against the rulers of their dwelling lands, rebel against the imperial sovereign, or deceive heaven and earth. Those who do so shall be judged according to the statutes of the Nine Dark Hells’ *Nüqing* Eight Slayers.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: After the disciples of the ten directions’ heavens and earths receive the Register, they shall not harbor deceit in their hearts while speaking falsely, nor bully the orphaned and weak. They must maintain an impartial mind, and the celestial spirits will come to their protection. Those who commit evil shall be judged according to the statutes of the Nine Dark Hells’ *Nüqing* Three Punishments.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: After the disciples of the ten directions’ heavens and earths receive the Register, they shall not kill or harm living beings, nor act with reckless defiance, nor disobey the laws and sincerity of the Dao. Those who violate this shall be judged according to the statutes of the Nine Dark Hells’ Three Punishments of the Capital Bureau.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: After the disciples of the ten directions’ heavens and earths receive the Register, they shall not betray their masters or deceive their lords. Those who violate this shall be judged according to the statutes of the Nine Dark Hells’ Eternal Punishment.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: After the disciples of the ten directions’ heavens and earths receive the Register, if the Dharma Master is distant, they are permitted to offer rice as commanded, in accordance with the birthdays of the male and female members of the disciple’s household during the eight seasonal festivals, to support the disciple’s observance of fasts and rituals. Those who neither observe the fast nor send offerings to the Dharma Master’s gate shall be judged according to the statutes of the Nine Dark Hells’ Eight Slayers.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: Dharma Masters who receive commanded rice shall not hoard it in granaries, intending to lend it at exorbitant prices during famine years. All such Dharma Masters shall be judged according to the Three Thousand Nine Punishments.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: Dharma Masters who collect commanded rice, money, or silk from disciples shall not hoard them in granaries without distributing them. Those who violate this shall be judged according to the statutes of the Three Thousand Nine Dark Hells’ Slayer Officials.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: Dharma Masters who collect commanded rice shall not store it in granaries for three years without performing meritorious deeds. Those who violate this shall be judged according to the statutes of the Three Thousand Dark Capital’s Eight Slayers.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: If disciples of the ten directions’ heavens and earths lose their Register of Numinous Spirits, they shall be penalized with one hall of *Lingbao* rituals to atone for their transgressions. Only after this may they approach the Dharma Master to receive the Register anew. If a Dharma Master hastily reissues the Register without the disciple observing the fast, both the Dharma Master and the disciple shall be judged according to the Three Punishments.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: If disciples of the ten directions’ heavens and earths encounter disasters such as war, flood, fire, or other calamities and lose their Register of Numinous Spirits, they are permitted to approach the Dharma Master to receive the Register anew without the labor of fasting. If the disciple does not seek reissuance, they shall be judged according to the Nine Punishments of the Dark *Nüqing* Statutes.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: Dharma Masters shall not deceive their disciples, make false demands, or greedily seek profit without end. All such offenses shall be judged according to the Three Punishments.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: If disciples of the ten directions’ heavens and earths become aware of their transgressions, they shall immediately approach the Dharma Master to confess and repent, thereby atoning for their sins. If they do not, they shall be judged according to the Three Punishments.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: Dharma Masters shall not exploit the fortunes or misfortunes of their disciples to extort gains. Those who do so shall be judged according to the Nine Punishments of the Dark Capital.\n\n**Preface of the Seven Perfected of Golden Clarity**\n\nThe Orthodox Dharma is none other than the Orthodox Dao. Thus, it can illuminate awakening to the point of Great Awakening, ascend to Orthodox Awakening, and enter Wondrous Awakening—truly the utmost of the wondrous. The subtlest profundity of the wondrous, the most wondrous of the subtle, how can it be discussed in terms of words or images? Unless one is a Mystic Sage, who would dare to point beyond forms and guide within them?\n\nThe Register of Numinous Spirits originally derives from the transmission of the Supreme August Jade Emperor of the Primordial Beginning of the Utmost Supreme Three Heavens, having come from the kalpas without end. It has always been practiced during the final kalpas, emerging into the world to deliver beings, relieving suffering during the *yangjiu* and *bailiu* catastrophes, and preserving all without harm. Thus, the transformation of the Dao Lord is not for His own sake.\n\nMoreover, the Orthodox Teaching is truly like a compassionate mother, ever mindful of her children, just as a skilled physician treats illness—how could it not be effective? Yet the Dharma of worldly salvation is like this. The sentient beings of the Three Realms dwell amidst afflictions, hardships, and calamities, their lives like flickering lamps—how can they know their suffering? They may speak of joy within it, but I observe the deluded masses and see that they are truly not joyful. Their years and lifespans pass like lightning, ultimately sinking into the Eight Difficulties, drifting through endless kalpas, enduring the Five Poisons, and suffering the Ten Torments in the dark prisons—what joy is there in this?\n\nBefore their bodies have perished, they witness the turmoil of the world, unaware of impending disasters and wars—how much more so when their bones have already sunk into the depths? This may be called the compassionate teaching of the Perfected descending to illuminate the dark paths, dispelling the obscurity of the Nine Nights, opening the gate of wisdom’s mirror to illuminate the beginnings of the unenlightened masses, enabling them to penetrate the Six Insights and awaken without obstruction.\n\nMay the living secure auspicious harmony for their households, and the deceased ascend to transform in the heavens, their spirits roaming freely—thus ensuring the peace and preservation of descendants for generations to come. Such is the true teaching of this sacred register, by which the multitudes are protected and delivered from the Five Turbidities, and the Three Calamities and Six Harms are kept from afflicting their bodies. Its power can regulate the movements of heaven and earth—how much more so the ghosts and spirits, that they should not perish or fade?\n\nYet only the Supreme Three Heavens’ Jade Bureau of the Orthodox Dao possesses such majestic numinosity, for these are the natural spirit-generals. The divine soldiers are likewise—only we believe in them; how could the common people awaken to this truth?\n\nHere ends the *Supreme Three Primes’ Spirit Register for Pacifying the Household*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "无上三元镇宅灵箓 经名：无上三元镇宅灵箓。 撰人不详，约出於南北朝末或隋唐之际。 假托玉皇降授金明七真。 一卷。 底本出处：《正统道藏》洞神部神符类。 无上三元镇宅灵箓 无上上上元始太上玉皇无极大道君，以岁在壬申十月十五日寅时，道君临降於昆仑山层城上宫。 尔时列真於虚空之中，威光伟灿虚凝霄景之上，明命告金明七真曰：尔当为来运十方天人正法中师，以不若欲为真者，先当以救世为急，即应广加功德，开度天人也。 其功 无上，功成德普，自得道矣。 是时七真存真，具相十观，金元飞景入寂，玄朝天尊於无无无上上上大寂上妙，稽首作礼，请问天尊：自顷年以来，三界崩沦，天地之间人鬼兵戈之气，日夜讻讻，末劫之世，岂七真下愚冥昧能知所济也。 伏愿开示未悟，令七真於斯方登正觉，以为救世法桥，不但今生蒙惠，亦当济后，惟广度来生。 唯愿天尊赐见，哀原七真不及之愆也。 尔时，天尊即告金明七真曰：子运应受记，当来为十方至真大圣正法中师，转是金真正法轮也。 且法轮之功，则无上上妙正法中真大乘中之王也。 其功德巍巍，大焉广囿，盖斯万象之·上，实有 无量功德无能比者。 自非至人高尚之子，焉能建其功德，树斯福基也。 但三界苍生沦溺苦海，亡者骸沉幽夜，魂爽受诸涂炭，生者不幸。 值此末劫，在於三灾五浊之运，百恶臻趣，灾兵并行，为日已久，岂不为之哀哉。 但大乘上业功德，故非天下兆民之、所恒修是功也。 今故以上元天官上灵检神筑鬼收魔摄精大箓，以持相付，即名曰《 无上三元安镇宅箓》也。 以持助天地正气，辅国佐时符命三元，以此可持济世矣。 封以太上三元之章也，镇於天人堂户之上，以持驱除十方五方天地妖精鬼疫瘟灾，百毒凶害不祥之气，魔邪魍魉变异之象，并使制之，使万殃兵灾鬼精不泄，永保兆之 无为矣。 有得之者，则保尔曹得度三灾，及於五浊之中大难也。 若其国有道之君当值吾道，其祚太平，君臣行道，即社稷长存也。 七真於是稽首再拜，请受灵箓。 尔时天尊告七真曰：今当为尔普告天地，共来证盟也。 以镇灵箓之首，即使检摄不正之气，以来入正法也。 七真作礼奉受，上启天尊：谨当依法奉行。 受事毕竟，天尊腾虚隐形而去。 无上三元镇宅灵箓 无上上上元始太上玉皇无极大道君，今降金明七真无上三元安镇某宅灵箓，则以岁在壬申十月十五日寅时，普告 无上清微禹余大赤三天真皇玉司天官、高上九天玉皇玉司之官、三十二天上帝司命之官、十方飞天神皇司录之官、无上玉帝太帝天帝太一司命司录把算生神度命延年益寿之君、九天九地诸司天官、诸天日月星宿璇玑玉衡七星北斗五帝四司、 无上无下无幽无隐无深无浅无极无穷十方冥寂凝住无量至真大圣尊神、三界一切官属无量神明、居天地水三元九宫八卦六甲诸官君将吏、五岳灵山大泽三河四渎九江淮济溟律大海九州里域山林孟长十二溪女、根源本始土地之王、社稷真官将吏、 无高无卑天真大神，俱与金明七真对盟告誓。 自今封兆《无上三无镇宅灵箓》之后，不得又犯违约，放纵魔兵鬼神灾毒疫煞，侵害兆之门户家室，男女长幼。 若有邪来干正之者，则付守宅三 无九部上灵大将军吏兵，收部送北酆太阴之北，寒冰九夜之庭，以付风刀水火诸官，依九都官律，考九万劫无原。",
      "translated_text": "**The Supreme Three Primordials Talisman for Pacifying the Household**\n\n**Scripture Title:** *The Supreme Three Primordials Talisman for Pacifying the Household*. The author is unknown, roughly dating to the late Northern and Southern Dynasties or the Sui-Tang period. It falsely attributes its revelation to the Jade Emperor’s descent to the Seven Perfected of Golden Radiance. One scroll. Base text from the *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Shenfu* Category.\n\n---\n\n**The Supreme Three Primordials Talisman for Pacifying the Household**\n\nOn the fifteenth day of the tenth month in the *renshen* year, at the *yin* hour, the Supreme Jade Emperor of the Utmost Non-Polarity, the Great Dao Lord of the Primordial Beginning of the Supreme Three Primordials, descended to the Upper Palace of the Layered City upon Kunlun Mountain. At that time, the assembled Perfected hovered in the void, their majestic radiance resplendent above the ethereal clouds. The Lord issued a luminous decree to the Seven Perfected of Golden Radiance, saying: \"You shall serve as the true Dharma masters of the ten directions for the coming kalpa. Those who aspire to perfection must first prioritize saving the world, widely accumulating merit to deliver all celestial and human beings. Such merit is supreme; when merit is perfected and virtue universal, the Dao is naturally attained.\"\n\nThereupon, the Seven Perfected preserved their true nature, observing the ten contemplations. Golden radiance and primordial light dissolved into stillness, and the Mysterious Heavenly Worthy appeared in the wondrous realm of the Utmost Non-Being of the Supreme Three Primordials. They bowed their heads in reverence and inquired of the Heavenly Worthy: \"In recent years, the Three Realms have collapsed, and between heaven and earth, the *qi* of humans, ghosts, and warfare clamors day and night. In this age of the final kalpa, how could we, the Seven Perfected, in our ignorance and delusion, know how to bring salvation? We humbly beseech your enlightenment, that we may attain right awakening in this realm and serve as a bridge of Dharma to save the world—not only bestowing blessings in this life but also delivering future generations and broadly guiding those yet to come. We implore the Heavenly Worthy to reveal the truth and pardon our inadequacies.\"\n\nThen the Heavenly Worthy addressed the Seven Perfected of Golden Radiance, saying: \"You are destined to receive the prophecy and become the true Dharma masters of the ten directions, the great sages of the orthodox Dharma. You shall turn the Wheel of the Golden Perfected Dharma. This Dharma Wheel is the supreme, wondrous, and orthodox king among the great vehicles of the true Dharma. Its merit is towering and vast, encompassing all phenomena, possessing boundless virtue beyond comparison. Only the loftiest and most noble of beings could establish such merit and lay this foundation of blessings. Yet the sentient beings of the Three Realms are drowning in the sea of suffering. The dead lie buried in the dark night, their souls enduring myriad torments, while the living, unfortunate to encounter this final kalpa, suffer under the cycles of the Three Calamities and Five Defilements. A hundred evils converge, and disasters and warfare persist—how can this not evoke sorrow?\n\nHowever, the great merit of the supreme vehicle is not something the multitudes of the world can ordinarily cultivate. Therefore, I now bestow upon you the *Great Register of the Upper Primordial Heavenly Officials, the Divine Tallies for Restraining Ghosts, Subduing Demons, and Seizing Spirits*, entrusting it to you under the name *The Supreme Three Primordials Talisman for Pacifying the Household*. With this, you may assist the upright *qi* of heaven and earth, aid the state and the times, and align with the mandates of the Three Primordials, thereby delivering the world. It is sealed with the seal of the Supreme Three Primordials. When placed above the halls and doorways of celestial and human dwellings, it will drive away the malevolent spirits, plagues, epidemics, and disasters of the ten and five directions, the *qi* of a hundred poisons, inauspicious omens, demonic apparitions, and anomalous phenomena, restraining them all. It will prevent the leakage of myriad calamities, warfare, ghosts, and spirits, forever preserving the household in effortless tranquility. Those who obtain it will be safeguarded from the Three Calamities and the great tribulations of the Five Defilements. If a virtuous ruler of a nation encounters this Dao, their reign will be peaceful, and as the ruler and ministers practice the Dao, the state will endure long.\n\nThe Seven Perfected then bowed their heads and prostrated themselves, receiving the sacred register. The Heavenly Worthy declared: \"Now I shall universally proclaim this to heaven and earth, that all may bear witness to this covenant.\" At the head of the pacifying talisman, it commands the restraint of all improper *qi*, guiding them into the orthodox Dharma. The Seven Perfected bowed in reverence and received it, pledging to the Heavenly Worthy: \"We shall diligently follow the Dharma as prescribed.\" Upon the completion of the rite, the Heavenly Worthy ascended into the void and vanished.\n\n---\n\n**The Supreme Three Primordials Talisman for Pacifying the Household**\n\nThe Supreme Jade Emperor of the Utmost Non-Polarity, the Great Dao Lord of the Primordial Beginning of the Supreme Three Primordials, now descends to bestow upon the Seven Perfected of Golden Radiance *The Supreme Three Primordials Talisman for Pacifying the [Recipient’s] Household*. On the fifteenth day of the tenth month in the *renshen* year, at the *yin* hour, it is universally proclaimed to:\n\nThe True Sovereigns of the Three Heavens—Qingwei, Yuyu, and Dachi—the Heavenly Officials of the Jade Controller of Heaven; the Highest Officials of the Nine Heavens under the Jade Emperor; the Life-Commanding Officials of the Thirty-Two Heavens; the Recording Officials of the Flying Celestial Divine Sovereigns of the Ten Directions; the Lords of the Supreme Jade Emperor, the Great Emperor, the Heavenly Emperor, and the Great Unity who command life, record deeds, hold the reckoning, and extend lifespan; the Heavenly Officials of the Nine Heavens and Nine Earths; the Celestial Bodies—the Sun, Moon, Stars, the Jade Armillary Sphere, the Seven Stars of the Northern Dipper, and the Five Emperors of the Four Controllers; the Boundless, Unfathomable, and Utterly Mysterious Perfected Sages and Venerable Divinities of the Ten Directions; all the infinite divine officials and spirits of the Three Realms; the myriad divine lords, generals, and functionaries of the Three Primordials, Nine Palaces, Eight Trigrams, and Six *Jia* of Heaven, Earth, and Water; the divine spirits of the Five Sacred Mountains, the great marshes, the Three Rivers, the Four Watercourses, the Nine Rivers, the Huai, the Ji, the vast oceans, and the nine provinces and their domains; the mountain forests and the Twelve Streams of Mengchang; the Root-Source and Primordial Earth Gods; the true officials, generals, and functionaries of the altars of soil and grain; and all the divine spirits of heaven, regardless of rank—all shall convene with the Seven Perfected of Golden Radiance to swear this covenant.\n\nFrom this day forth, after the sealing of *The Supreme Three Primordials Talisman for Pacifying the Household*, none shall violate this pact by unleashing demonic soldiers, ghosts, spirits, plagues, pestilences, or calamities to invade the household’s gates, chambers, men, women, elders, or children. Should any evil seek to disrupt the upright, the Three Primordials’ Nine Divisions of the Supreme Divine Generals and Soldiers guarding the household shall apprehend them and dispatch them to the northern reaches of Fengdu, the Great Yin, to the courtyard of the Nine Nights of Ice. There, they shall be handed over to the officials of wind, blades, water, and fire, to be judged according to the laws of the Nine Capital Offices and tormented for ninety thousand kalpas without reprieve.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1284,
      "start_sentence": 0,
      "end_sentence": 33,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.22933864593506,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\神符类\\无上三元镇宅灵箓.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "急急一如元始太上玉皇大道君律令。 无上上元清微天正法玉典司正上灵镇防大将军一人，官将守宅兵士三十六万人。 无上上元清微天都正玉司上灵镇防大将军一人，官将守宅兵士三十六万人。 无上上无清微天正法玉司大都监上灵镇防大将军一人，官将守宅兵士三十六万人。 无上上上元始太上玉皇无极大道君，命无上上元清微天正夫玉司镇防三将军等，各都守宅兵士各三十六万人，精押所部兵士，镇防大道清真正法弟子某宅，四面八方上下中央，守卫各三十六万重。 若有欲来侵害某家门户，干犯正法弟子之者，将军兵士当振动天威，一时收取群奸鬼贼，瘟灾不正之神，即迁逐部送北酆风刀水火之官拷。 若将军兵士众等有容隐之者，亦同其罪。 自非某家宗祠之鬼，一不得进。 封宅之后，永保兆家大小男女箓籍，令得度三灾之运。 急急一如律令。 无上中元禹余天司正明威上灵镇防大将军一人，官将守宅兵马三十六万人。 无上中元禹余天司法明威上灵镇防大将军一人，官将守宅兵马三十六万人。 无上中元禹余天司非明威上灵镇防大将军一人，官将守宅兵马三十六万人。 无上上上元始太上玉皇大道君，命无上中元禹余天司正司法司非明威三将军等，各部守宅兵马各三十六万人，精押所部兵马神官，镇防大道清真正法弟子某宅，四方四维汰甲，十二时上检勒宅中。 青龙白虎朱雀玄武勾陈伏龙，共相营卫，各三十六万重，周匝兆宅，外防众非，司察五方瘟灾疫毒魍魉，空中俘游鬼魅，地中沉尸伏杀金银铜铁玉石之精，六天故气，巫祝房庙之灵，在某宅内或在四面为精为祟之者，将军兵马即动天威，振烈神功，收取部送北酆九幽之狱，驱除不祥，今兆封宅箓之浪，非亲祠之鬼，一不得进。 将军兵马若有容非，为某作祸害，同与邪伍执拷 无原。 急急一如律令。 无上下元大赤天正法四镇直灵镇防大将军一人，官将守宅吏兵三十六万人。 无上下元大赤天正法四司直灵镇防大将军一人，官将守宅吏兵三十六万人。 无上下元大赤天正法四望直灵镇防大将军一人，官将守宅吏兵三十六万人。 无上上上元始太上玉皇大道君，命无上下元大赤天四镇四司四望直灵大将军等，各部下元守宅吏兵各三十六万人，精加守防大道清真正法弟子某家宅舍，防卫各三十六万重，勅勒某家宅内。 十二时上所有禁忌太岁大将军，门丞户尉井灶，并某家上世先亡及土地真官，并同今约，七真今依玄科， 无上上上元始太上玉皇大道君上妙大乘正法，为某封宅， 无上三元镇宅上灵大箓。 某即稽首，称大道清真弟子，即封以太上三元之章。 是日幽显共明，诸天玉司监盟，三天告命， 无幽不闻，无冥不应，无天不奉，无地不承。 自今以去，不得使某门户，更相招引灾殃横厄，阴阳水火，六天故气，魔精鬼贼，非亲祠而一切客死鬼神，为凶祸侵害某门户，大小男女。 而不臣正法之者，将军吏兵即振威八方，收取群精，部送北酆寒冰夜庭水府，九都考士执系，长劫 无原。 急急一如九都律令。 谨条某甲先亡名目如左： 亡曾祖父某、亡曾祖母某、亡祖父某、亡祖母某、亡父某、亡母某。 右某家三世先亡，今封以付 无上三天天官将军兵士等。",
      "translated_text": "Swiftly, swiftly, in accordance with the statutes and decrees of the Primordial Celestial Worthy of the Jade Emperor of the Supreme Dao.\n\nThe Supreme Upper Prime of the Qingwei Heaven’s Orthodox Dharma Jade Canon Bureau’s Rectifying Supreme Numinous Guarding and Defending Great General, one, with his official generals and household-guarding soldiers, three hundred sixty myriad in number.\nThe Supreme Upper Prime of the Qingwei Heaven’s Capital Orthodox Jade Bureau’s Supreme Numinous Guarding and Defending Great General, one, with his official generals and household-guarding soldiers, three hundred sixty myriad in number.\nThe Supreme Upper Prime of the Qingwei Heaven’s Orthodox Dharma Jade Bureau’s Grand Supervisory Supreme Numinous Guarding and Defending Great General, one, with his official generals and household-guarding soldiers, three hundred sixty myriad in number.\n\nThe Primordial Celestial Worthy of the Jade Emperor of the Supreme Limitless Dao commands the Supreme Upper Prime of the Qingwei Heaven’s Orthodox Dharma Jade Bureau’s Three Guarding and Defending Generals, each with their household-guarding soldiers, three hundred sixty myriad in number, to strictly marshal their troops and guard and defend the residence of the Orthodox Dharma Disciple of the Great Dao’s Pure and True Upright Teachings, [Name]’s household, in the four directions, eight quarters, above, below, and center, with thirty-six myriad layers of defense.\n\nShould any seek to invade [Name]’s gates and chambers or violate the Orthodox Dharma Disciple, the generals and soldiers shall rouse the majesty of Heaven and instantly apprehend all treacherous ghosts and thieves, pestilential and unrighteous spirits, and immediately dispatch them to the officials of wind, blades, water, and fire in the northern reaches of Fengdu for interrogation. Should any of the generals or soldiers conceal such malefactors, they shall share in the same punishment.\n\nNone but the ancestral spirits of [Name]’s lineage shall be permitted entry. After the sealing of the residence, may the registers of [Name]’s household, young and old, men and women, be eternally safeguarded, enabling them to transcend the tribulations of the Three Calamities.\n\nSwiftly, swiftly, in accordance with the statutes and decrees.\n\nThe Supreme Middle Prime of the Yuyu Heaven’s Bureau of Rectifying Illustrious Might’s Supreme Numinous Guarding and Defending Great General, one, with his official generals and household-guarding soldiers and cavalry, three hundred sixty myriad in number.\nThe Supreme Middle Prime of the Yuyu Heaven’s Bureau of Dharma Illustrious Might’s Supreme Numinous Guarding and Defending Great General, one, with his official generals and household-guarding soldiers and cavalry, three hundred sixty myriad in number.\nThe Supreme Middle Prime of the Yuyu Heaven’s Bureau of Non-Illustrious Might’s Supreme Numinous Guarding and Defending Great General, one, with his official generals and household-guarding soldiers and cavalry, three hundred sixty myriad in number.\n\nThe Primordial Celestial Worthy of the Jade Emperor of the Supreme Dao commands the Supreme Middle Prime of the Yuyu Heaven’s Bureaus of Rectifying, Dharma, and Non-Illustrious Might’s Three Generals, each with their household-guarding soldiers and cavalry, three hundred sixty myriad in number, to strictly marshal their divine officials and troops, guarding and defending the residence of the Orthodox Dharma Disciple of the Great Dao’s Pure and True Upright Teachings, [Name]’s household, in the four directions, four corners, and twelve earthly branches, inspecting and restraining the household at all hours.\n\nThe Azure Dragon, White Tiger, Vermilion Bird, Dark Warrior, Hook Star, and Hidden Dragon shall jointly provide defense, each with thirty-six myriad layers, encircling [Name]’s residence to repel all malevolence, overseeing the five directions’ pestilential disasters, epidemic poisons, and specters; the wandering ghosts of the void; the sunken corpses and concealed slayings of the earth; the spirits of gold, silver, copper, iron, jade, and stone; the residual qi of the Six Heavens; the numina of shamans, shrines, and household temples; and any spirits or demons within [Name]’s household or its surroundings. The generals and soldiers shall rouse the majesty of Heaven, display their divine might, apprehend and dispatch them to the Nine Dark Prisons of Fengdu’s northern reaches, expelling all inauspicious influences. Henceforth, in the sealing of [Name]’s household registers, none but the spirits of the ancestral lineage shall be permitted entry. Should any of the generals or soldiers harbor malevolence or bring harm to [Name], they shall be seized and interrogated alongside the wicked without reprieve.\n\nSwiftly, swiftly, in accordance with the statutes and decrees.\n\nThe Supreme Lower Prime of the Great Red Heaven’s Orthodox Dharma’s Four Guardians’ Direct Numinous Guarding and Defending Great General, one, with his official generals and household-guarding officers and soldiers, three hundred sixty myriad in number.\nThe Supreme Lower Prime of the Great Red Heaven’s Orthodox Dharma’s Four Bureaus’ Direct Numinous Guarding and Defending Great General, one, with his official generals and household-guarding officers and soldiers, three hundred sixty myriad in number.\nThe Supreme Lower Prime of the Great Red Heaven’s Orthodox Dharma’s Four Prospects’ Direct Numinous Guarding and Defending Great General, one, with his official generals and household-guarding officers and soldiers, three hundred sixty myriad in number.\n\nThe Primordial Celestial Worthy of the Jade Emperor of the Supreme Dao commands the Supreme Lower Prime of the Great Red Heaven’s Four Guardians, Four Bureaus, and Four Prospects’ Direct Numinous Generals, each with their Lower Prime household-guarding officers and soldiers, three hundred sixty myriad in number, to strictly guard and defend the residence of the Orthodox Dharma Disciple of the Great Dao’s Pure and True Upright Teachings, [Name]’s household, with thirty-six myriad layers of defense, restraining [Name]’s household at all hours.\n\nAll taboos, the Great General of the Year Star, the Gate Marshal, the Door Warden, the Well and Hearth Spirits, along with [Name]’s ancestral spirits of past generations and the local earth deities, shall abide by this pact. The Seven Perfected now adhere to the Mysterious Regulations.\n\nThe Primordial Celestial Worthy of the Jade Emperor of the Supreme Dao’s Supreme Wondrous Mahāyāna Orthodox Dharma seals the residence for [Name] with the *Supreme Three Primes’ Numinous Register for Guarding the Household*.\n\n[Name], bowing reverently, declares himself a disciple of the Great Dao’s Pure and True Teachings and seals this with the seal of the Supreme Three Primes. On this day, the hidden and manifest are equally illuminated; the Jade Bureaus of the various heavens witness the covenant. The Three Heavens proclaim the mandate, heard in no darkness, answered in no obscurity, obeyed by no heaven, unsupported by no earth.\n\nFrom this day forth, none shall cause [Name]’s gates and chambers to be afflicted by calamities, misfortunes, or sudden adversities; by the dualities of yin and yang, water and fire; by the residual qi of the Six Heavens; by demonic spirits, ghostly thieves, or any wandering dead who are not of the ancestral lineage; or by any malevolent forces violating [Name]’s household, young and old, men and women. Those who do not submit to the Orthodox Dharma shall be seized by the generals and officers, who shall rouse their might in the eight directions, apprehend the multitude of spirits, and dispatch them to the Water Palace of Fengdu’s Courtyard of the Nine Nights of Ice, where the Nine Capital Offices shall detain and interrogate them for endless kalpas without reprieve.\n\nSwiftly, swiftly, in accordance with the statutes and decrees of the Nine Capitals.\n\nRespectfully recorded, the names of [Name]’s deceased ancestors are as follows:\nDeceased great-grandfather [Name], deceased great-grandmother [Name],\nDeceased grandfather [Name], deceased grandmother [Name],\nDeceased father [Name], deceased mother [Name].\n\nTo the right, the three generations of [Name]’s ancestral spirits are now sealed and entrusted to the generals, soldiers, and officers of the Supreme Three Heavens.",
      "overlap_context": " children. Should any evil seek to disrupt the upright, the Three Primordials’ Nine Divisions of the Supreme Divine Generals and Soldiers guarding the household shall apprehend them and dispatch them to the northern reaches of Fengdu, the Great Yin, to the courtyard of the Nine Nights of Ice. There, they shall be handed over to the officials of wind, blades, water, and fire, to be judged according to the laws of the Nine Capital Offices and tormented for ninety thousand kalpas without reprieve.\"",
      "start_char": 1284,
      "end_char": 2532,
      "start_sentence": 34,
      "end_sentence": 63,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.75063180923462,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\神符类\\无上三元镇宅灵箓.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "此皆某所宗祠之限，自非常节，皆不得妄生责望生人饮食，作诸祸祟，疾病子孙后胤生人。 若有犯者，俱同部送九都，永付律官。 若为福者利某家门，三天玉司生官并镇宅将军，即当为举迁，言名上三天，奏其功德，升上九天元生福堂，给以自然衣饭，逍遥 无为也。 长居福界，佑利生人，一如律令。 无上上上元始太上玉皇无极大道清真正法。 弟子某甲，属某郡县乡里，某甲年若干岁，男某女某。 右一户男女若干口，七真今封以太上三元之章，以付无上三天玉司正法神生之官，以无上三元各三将军，保赏某家男女年命，以镇防某宫宅，各领守宅兵马吏兵所部，营卫某宅各三十六万重。 一如 无上元始太上玉皇大道君律令。 太岁某年某月日朔子时，真师金明七真於某里封。 无上三天玉司正法律曰：封无上三元镇宅上灵大箓，当勅箓中三部天符之时，即存象见无上上上元始太上玉皇大道君，形相金容朗彻，与金明三尊俱来降也，凝住云空上。 又存见三天各三将军、兵士兵马吏兵等，各三十六万人，布满十方，俱来镇防，营卫某宅三十六万重，皆如人中兵马 无异也。 而勅符咒曰： 虚无玉皇，玉天开便，玉清出号，号曰金真，玉虚明威，三天生神，正法玄范，符命九天，摄气辅兆，检精流烟，策鬼召魔，扫除无蠲，灵将镇防，天兵为邻，正道运行，保兆今晨，万精摧灭，敢干兆身，吾命神公，普拂妖尘，有善者迁，有逆者槟。 急急一如律令。 无上三天玉司正法律曰：十方天人地兆，初封无上三元镇宅上灵箓，当送玄都系命籍之米二石四斗，五方镇彩随方疋数，紫纹命素各一疋，钱二贯四百文。 持法上元二十四生气，以应二十四生神之元命，亦象二十四洞混生之府，下为二十四神以表三元之数也。 皆如律品不得有违。 七真曰：天人地兆，初及此科者，亦可一石二斗，钱一贯二百文，绢一十二疋； 亦可八疋，钱八百文，绢八疋也。 一十二数，以应十二神真，八数以法八卦也。 无上三天玉司正法律曰：十方天人地兆，封无上三元镇宅上灵箓者，年输玄都上元生气命米二石四斗，五方镇彩命纹命素绢钱等，以付法师门下也。 法师得弟子命米绢钱等，则当出八数以供功德，为十方诸天帝皇、所在帝主国王，修建金真转法轮大斋。 又以八数准建三元，为弟子迁赏镇防将军兵士，言功进秩； 八数准以供施天下贫穷，及山栖道士也。 若有违者，准九都刑律论。 七真曰：天人多有贫穷者，亦可输钱绢米等，不计多少，以充法师供功德限明也。 无上三天玉司正法律日：十方天人地兆，封无上三元镇宅上灵箓者，若不输命信米限，则三天司命减兆算十。 若依年限奉送法师门下，则司命加兆算十。 皆如律准。 弟子皆当修身洁己，建自然斋，烧香行道，转经礼忏，然灯照夜，一日一夕六时请福，并迁赏镇防上天天官也。 兆居所若无法师行道者，亦许家男女，止可心存金明，持中而已，其亦要矣。 是三元日弟子不修斋持戒者，上元玉司天官不上兆名於生元之箓，法准三刑律论。 无上三天玉司正法律曰：夫天子王侯，若欲宁国安民，以享无穷之祚，保於社稷者，皆封是灵箓，以镇帝主国王宫合之门上也。 七真曰：十方及诸上天天帝、太帝、上帝，并各各封是灵箓，於诸天琼门玉合之上也。",
      "translated_text": "These are the bounds of the ancestral shrine of [Name], not to be transgressed on ordinary occasions. None shall rashly demand sustenance from the living, nor bring about misfortunes, hauntings, illnesses, or afflictions upon descendants and posterity. Should any violate this, they shall be dispatched together to the Nine Capitals and forever consigned to the law officials. If, however, they bring blessings and benefit to [Name]’s household, the Jade Bureau of the Three Heavens and the Generals of Household Protection shall promote and elevate them, reporting their names to the Three Heavens and memorializing their merits, raising them to the Primordial Life and Blessing Hall of the Nine Heavens, where they shall be granted natural garments and sustenance, dwelling in carefree non-action. They shall abide long in the realm of blessings, aiding and benefiting the living, all in accordance with the statutes and decrees.\n\n**Supreme, Supreme, Supreme Primordial Most High Jade Emperor of the Boundless Dao, Pure and True Orthodox Dharma.**\n\nDisciple [Name], of [Prefecture], [County], [Village], aged [Number] years, male [Name], female [Name]. To the right, this household of [Number] persons is now sealed with the talisman of the Supreme Three Origins and entrusted to the orthodox dharma officials of the Jade Bureau of the Supreme Three Heavens, along with the Three Generals of the Supreme Three Origins, to safeguard the lifespans of [Name]’s household, to secure and defend [Name]’s palace and residence. Each shall command the soldiers, cavalry, officers, and troops under their jurisdiction, encircling and protecting [Name]’s residence with thirty-six myriad layers, all in accordance with the statutes and decrees of the Supreme Primordial Most High Jade Emperor of the Dao.\n\nIn the year [Year], month [Month], day [Day] of the Great Year Star [Name], at the midnight hour, the Seven Perfected of Golden Radiance sealed this in [Village].\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Upon sealing the *Supreme Three Origins Talisman of Household Protection and Upper Numinous Register*, when the three celestial talismans within the register are activated, one shall visualize the Supreme, Supreme, Supreme Primordial Most High Jade Emperor of the Dao, his golden countenance radiant and luminous, descending together with the Three Venerables of Golden Radiance, coalescing and abiding in the cloudy void above. One shall further visualize the Three Generals of the Three Heavens, each with thirty-six myriad soldiers, cavalry, officers, and troops, filling the ten directions, all coming to secure and defend [Name]’s residence with thirty-six myriad layers, no different from mortal armies.\n\nThe talismanic incantation is as follows:\n*\"Void and Jade Emperor, the Jade Heaven opens forthwith,\nThe Jade Clarity issues its decree, named Golden Perfection.\nThe Jade Void’s luminous might, the Three Heavens generate spirits,\nOrthodox dharma’s mysterious model, the talisman commands the Nine Heavens.\nGather qi to assist the omen, inspect the essence as flowing smoke,\nCommand ghosts and summon demons, sweep away all impurities.\nSpiritual generals secure the defense, celestial soldiers as neighbors,\nThe orthodox Dao moves in motion, protecting the omen this dawn.\nMyriad spirits crushed and destroyed, dare not encroach upon the omen’s body.\nI command the divine lords, universally brushing away demonic dust.\nThose who do good shall be promoted, those who rebel shall be expelled.\"*\n\nSwiftly, swiftly, in accordance with the statutes and decrees.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: For all celestial, human, and terrestrial beings who first receive the *Supreme Three Origins Talisman of Household Protection and Upper Numinous Register*, they shall offer two *shi* and four *dou* of life-sustaining rice from the Mysterious Capital’s Register of Destiny, along with five-colored silks corresponding to the five directions in appropriate quantities, one bolt each of purple-woven and plain white silk, and two strings and four hundred cash. These shall be presented with the twenty-four life-generating qi of the Upper Origin, corresponding to the twenty-four life-generating spirits’ primordial destiny, also symbolizing the twenty-four grottoes of primordial generation, and below, the twenty-four spirits representing the numbers of the Three Origins. All shall comply with the statutory provisions without violation.\n\nThe Seven Perfected state: For celestial, human, and terrestrial beings first undertaking this rite, they may also offer one *shi* and two *dou* of rice, one string and two hundred cash, and twelve bolts of silk; or eight bolts of silk, eight hundred cash, and eight bolts of silk. The twelve numbers correspond to the twelve perfected spirits, and the eight numbers accord with the eight trigrams.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: For all celestial, human, and terrestrial beings who receive the *Supreme Three Origins Talisman of Household Protection and Upper Numinous Register*, they shall annually deliver two *shi* and four *dou* of life-sustaining rice from the Mysterious Capital’s Upper Origin, along with five-colored silks, plain white silks, and cash, to the master’s gate. The master, having received the disciple’s life-sustaining rice, silks, and cash, shall allocate eight portions for meritorious deeds, to be offered to the emperors and sovereigns of the ten directions and all heavens, as well as the local imperial lords and kings, for the establishment of grand feasts of the Golden Perfection Dharma Wheel. Another eight portions shall be used to establish the Three Origins, promoting and rewarding the generals, soldiers, and officers of household protection for the disciple, reporting their merits and advancing their ranks. Eight portions shall be used to provide for the impoverished throughout the world and the Daoist recluses dwelling in the mountains. Violators shall be judged according to the penal statutes of the Nine Capitals.\n\nThe Seven Perfected state: For celestial beings who are impoverished, they may also offer rice, silk, and cash without fixed quantities, to fulfill the master’s requirements for meritorious deeds.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: For all celestial, human, and terrestrial beings who receive the *Supreme Three Origins Talisman of Household Protection and Upper Numinous Register*, if they fail to deliver the life-sustaining rice within the prescribed time, the Three Heavens’ Bureau of Destiny shall deduct ten years from the omen’s lifespan. If they comply with the annual offerings to the master’s gate, the Bureau of Destiny shall add ten years to the omen’s lifespan, all in accordance with the statutes.\n\nDisciples shall cultivate themselves, purify their conduct, establish natural fasts, burn incense, practice the Dao, recite scriptures, perform repentance rites, and illuminate the night with lamps. They shall pray for blessings six times daily and nightly, promoting and rewarding the celestial officials of household protection. If no master is present in the disciple’s dwelling to perform the rites, household members may also visualize Golden Radiance in their hearts and maintain equilibrium—this, too, is essential. On the Three Origins’ days, if disciples do not observe fasts and uphold precepts, the Upper Origin’s Jade Bureau celestial officials shall not inscribe the omen’s name in the Register of Primordial Life, and they shall be judged according to the Three Punishments statutes.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Should the Son of Heaven, kings, or feudal lords seek to pacify the state, secure the people, and enjoy boundless prosperity while safeguarding the altars of soil and grain, they shall all seal this numinous register to secure the gates of the imperial palace and the kingdom’s halls.\n\nThe Seven Perfected state: The emperors, supreme emperors, and celestial lords of the ten directions and all heavens shall each seal this register upon the jade caskets and gates of their celestial palaces.",
      "overlap_context": "y, swiftly, in accordance with the statutes and decrees of the Nine Capitals.\n\nRespectfully recorded, the names of [Name]’s deceased ancestors are as follows:\nDeceased great-grandfather [Name], deceased great-grandmother [Name],\nDeceased grandfather [Name], deceased grandmother [Name],\nDeceased father [Name], deceased mother [Name].\n\nTo the right, the three generations of [Name]’s ancestral spirits are now sealed and entrusted to the generals, soldiers, and officers of the Supreme Three Heavens.",
      "start_char": 2532,
      "end_char": 3802,
      "start_sentence": 64,
      "end_sentence": 97,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.79326939582825,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\神符类\\无上三元镇宅灵箓.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "况复下界天子王侯乎。 无上三天玉司正法律曰：十方飞天帝皇，及诸梵天天王，并五方五帝天君，并各封是灵箓，以镇天地之运，以保固天元之正度，和适阴阳之气，致得用自然之化，君乎自然之运也。 七真曰：灵箓者，十方诸天上帝、至真大圣中尚奉之，况复天下人乎。 无上三天玉司正法律曰：法师为弟子封灵箓，收命米镇信等限，若不为三品准用，施散入功德用者，法师结考九都之官，即入九劫刑律论。 无上三天玉司正法律曰：法师收弟子年偿命米镇信等，自入己身供於父子，而不为弟子建功立福者，罪准九都考官，名入三刑五劫律论。 无上三天玉司正法律曰：法师三元大庆之日，若不为弟子建功，迁赏将军兵士者，法师身收殃罚於死王之都，名入三刑考律论。 无上三天玉司正法律曰：法师三元日不得为弟子家言名三天玉司生神上官者，法师身见世受诸灾害，死入九幽九刑律论。 无上三天玉司正法律曰：十方诸天诸地无极世界，百姓男女人家门，若有灾□变怪，妖异猖亡，客鬼招引群凶，恒为天人作诸祸祟者，则应依正法，赍命米命彩命素钱等，诣法师封於灵箓也。 七真曰：若得灵箓者，保兆不但止辟灾厄也，亦辟大小阳九、大小百六於水火风刀之穷年。 无上三天玉司正法律曰：十方天人正法弟子，封是灵箓镇於官宅门户上者，则使人神澄气清，宫宅肃然，诸天拥护，三界之官俱来卫门，天神地祇奉承正法弟子，恒来稽首朝拜灵箓，并营卫门庭， 无敢生害心者。 无上三天玉司正法律曰：十方天人正法弟子，若家门有诸疾患厄会，阴肠水火盗贼欲来加害，或恒有为侵乱者，弟子家长一人，可沐浴整肃衣服，持斋烧香於灵箓之下，礼九拜，即而启言灾厄轻重，随由请乞，心存三部。 无上三天玉司正法律曰：十方天人地兆，若家门增口三年之后，则应更封灵箓。 若家门失福，减口三年之后，亦当更封灵箓。 若三年元增元减，即不用封也，可至九年改箓更封。 若不改箓，将军兵士则应受功升天而去，是以应顶改箓。 若九年不改，弟子即准入三刑律论。 无上三天玉司正法律曰：十方天人地兆封灵箓，不得礼拜符庙鬼神邪师巫祝，并脆物求福，有犯者准三刑律论。 无上三天玉司正法律曰：十方天人地兆封灵箓之后，弟子家门不得招引非人，故气师姑女郎歌舞宅内。 非真之事，准罪幽都三刑律论。 无上三天玉司正法律曰：十方天人地兆封灵箓，不得违师背约，若有犯者，将军兵士则升天宫，终不复镇防守人宫宅也。 准罪太阴刑律论。 无上三天玉司正法律曰：十方天人地兆封灵箓之后，当助法师立三千善功，开化天人，树胜福田，即加真十品，位登上仙。 无上三天玉司正法律曰：十方天人地兆封灵箓之家，当以正月十五日、七月十五日、十月十五日，此则诸天三元校试天地水官人鬼名目，以定生死簿箓罪福之日，封箓将军兵士兵马吏兵，各三十六万人，其象如见，了然有也。 围绕宫宅，振威镇防，收检摄捕群凶也。 七真曰：有能如是者，未见无灾不消，无厄不度，无祸不灭，无福不生，无盗不灭，无善不宜，无凶不除，无精不却，无恶不伏， 无吉不臻。 无上三天玉司正法律曰：十方天人正法弟子，若欲除却灾害，消精灭祸者，当呜天鼓三十六通，而咒曰：",
      "translated_text": "Moreover, how much more does this apply to the Son of Heaven, kings, and feudal lords of the lower realms?\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The flying celestial emperors of the ten directions, all Brahma-heaven kings, and the celestial lords of the Five Directions and Five Emperors shall each seal this numinous register to secure the movements of Heaven and Earth, to safeguard the proper measure of the primordial celestial origin, to harmonize and regulate the qi of yin and yang, thereby attaining the transformations of spontaneity and ruling through the spontaneity of natural order.\n\nThe Seven Perfected state: If even the supreme emperors and perfected sages of the ten directions’ heavens revere and uphold this numinous register, how much more should the people of the world below do so?\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Should a Dharma-master, when sealing the numinous register for a disciple, collect the life-rice, sealing offerings, or faith tokens, yet fail to employ them according to the three-grade standards for merit-bestowing purposes, the Dharma-master shall be bound and examined by the officials of the Nine Capitals and judged according to the Nine Kalpas’ penal statutes.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: If a Dharma-master collects from a disciple the yearly repayment of life-rice, sealing offerings, or faith tokens for personal use or to provide for his family, yet fails to establish merit and blessings for the disciple, his offense shall be examined by the officials of the Nine Capitals and his name recorded under the statutes of the Three Punishments and Five Kalpas.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Should a Dharma-master, on the great celebratory days of the Three Origins, fail to establish merit for his disciple or promote and reward the generals, soldiers, and officers, the Dharma-master shall incur misfortune and punishment in the capital of the Dead King and his name recorded under the statutes of the Three Punishments and examination laws.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Should a Dharma-master, on the days of the Three Origins, be unable to petition the Jade Bureau of the Three Heavens on behalf of a disciple’s household to inscribe their names in the Register of Life of the Upper Office of Divine Birth, the Dharma-master shall suffer various calamities in this life and, upon death, be judged under the statutes of the Nine Dark Prisons and Nine Punishments.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: In all the boundless worlds of the ten directions’ heavens and earths, should any household among the common people—men or women—encounter disasters, strange omens, or monstrous anomalies; should malevolent spirits summon hordes of misfortune; or should they perpetually bring harm to the celestial and human realms, they must, in accordance with the Orthodox Dharma, present life-rice, life-silks, life-plain cloth, and spirit money to the Dharma-master to seal the numinous register.\n\nThe Seven Perfected state: Those who obtain the numinous register shall not only be protected from disasters and calamities but also avert the great and minor Yang-Nine and great and minor Hundred-Six catastrophes in years of water, fire, wind, or blade.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Should the Orthodox Dharma disciples of the ten directions’ heavens and earths seal this numinous register upon the gates and doors of their palaces and residences, it shall render the qi of humans and spirits pure and clear, the palace and residence solemn and serene. The heavens shall send protection, the officials of the Three Realms shall all come to guard the gates, and the celestial and terrestrial deities shall serve the Orthodox Dharma disciples, perpetually paying homage and bowing before the numinous register while defending the gates and courtyards, none daring to harbor harmful intent.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Should the Orthodox Dharma disciples of the ten directions’ heavens and earths encounter illnesses, calamities, or misfortunes in their households; should yin perils, water, fire, bandits, or thieves threaten harm; or should they perpetually suffer invasions or disturbances, the head of the household may bathe, don solemn attire, maintain a fast, burn incense beneath the numinous register, perform nine bows, and then declare the severity of the disaster or calamity, petitioning for relief while concentrating the mind upon the Three Departments.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Should the households of the Orthodox Dharma disciples of the ten directions’ heavens and earths gain a member after three years, they must reseal the numinous register. If a household loses fortune and a member after three years, they must also reseal the numinous register. If there is neither gain nor loss after three years, resealing is unnecessary, but the register must be renewed and resealed after nine years. Should the register not be renewed, the generals, soldiers, and officers shall receive merit and ascend to heaven, and thus the register must be renewed and resealed. Should the disciple fail to renew it after nine years, he shall be judged according to the Three Punishments statutes.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The Orthodox Dharma disciples of the ten directions’ heavens and earths who seal the numinous register must not worship talismanic temples, ghostly deities, heterodox masters, or shamans, nor seek blessings through fragile offerings. Those who violate this shall be judged according to the Three Punishments statutes.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: After sealing the numinous register, the Orthodox Dharma disciples of the ten directions’ heavens and earths must not summon non-human entities, nor invite qi-manipulators, female mediums, or entertainers to perform songs and dances within their residences. Those who engage in such non-Orthodox practices shall be judged under the statutes of the Three Punishments of the Dark Prisons.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The Orthodox Dharma disciples of the ten directions’ heavens and earths who seal the numinous register must not betray their master or violate their covenant. Those who do so shall have their generals and soldiers ascend to the celestial palaces, never again to guard their residences. Their offense shall be judged under the statutes of the Great Yin penal laws.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: After sealing the numinous register, the Orthodox Dharma disciples of the ten directions’ heavens and earths must assist their Dharma-master in establishing three thousand virtuous deeds, enlightening celestial and human beings, and cultivating fields of supreme merit, thereby attaining the true tenth rank and ascending to the position of Upper Immortal.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The households of the Orthodox Dharma disciples of the ten directions’ heavens and earths who seal the numinous register shall, on the fifteenth day of the first, seventh, and tenth months—the days when the celestial, terrestrial, and water officials of the Three Origins examine and record the names of humans and ghosts to determine the registers of life and death, merit and sin—have their sealing-register generals, soldiers, officers, and troops, totaling 360,000 each, manifest visibly, encircling the palace and residence to display their might, defend, and capture and restrain all malevolent forces.\n\nThe Seven Perfected state: Those who act thus shall find no disaster unaverted, no calamity unendured, no misfortune undispelled, no blessing unborn, no banditry undestroyed, no virtue unsuited, no evil unremoved, no spirit unrepelled, no wickedness unsubdued, and no fortune unattained.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Should the Orthodox Dharma disciples of the ten directions’ heavens and earths wish to dispel disasters, eliminate spirits, and eradicate misfortune, they must strike the celestial drum thirty-six times and recite the incantation:",
      "overlap_context": "ecrees: Should the Son of Heaven, kings, or feudal lords seek to pacify the state, secure the people, and enjoy boundless prosperity while safeguarding the altars of soil and grain, they shall all seal this numinous register to secure the gates of the imperial palace and the kingdom’s halls.\n\nThe Seven Perfected state: The emperors, supreme emperors, and celestial lords of the ten directions and all heavens shall each seal this register upon the jade caskets and gates of their celestial palaces.",
      "start_char": 3802,
      "end_char": 5093,
      "start_sentence": 98,
      "end_sentence": 123,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.51602864265442,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\神符类\\无上三元镇宅灵箓.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "无上上清微天清微天清微天三将军官将兵士各三十六万人，为某检摄兵灾之气。 无上禹余天无上禹余天无上禹余天三将军官将兵马各三十六万人，为某消除五方非灾六害鬼精不正之气。 无上大赤天大赤天大赤天三将军官将吏兵各三十六万人，为某收除瘟灾毒疫兵灾水火疾害之气，即得殄灭。 为某振威动兵，镇防各三十六万重，守固某宅，四面八方营卫禁备。 一如 无上上上元始太上玉皇大道君律令。 七真曰：弟子若家门怖畏，并有不祥光异怪魅，家室忧诸灾厄，或邻家有凶更相破害，或夜中梦想不真，或惧怖瘟灾水火盗贼，诸欲加害者，皆当如是咒也。 其祸立消，即保尔曹 无为者也。 无上三天玉司正法律曰：法师为十方天人弟子封镇宅灵箓，当一依付度玄箓章仪典次序，以奏言表事也。 言奏事竟，即与弟子於灵坛上南北相对，说度灵箓上将军兵士，弟子皆称名。 受度官毕，法师即勅箓符咒，次封以太上三元之章也。 法师而授灵箓与弟子，弟子即稽首作礼於法师前，称言大道清真正法弟子某甲，而礼九拜。 七真曰：封灵箓事出官章表刺事，并依付度治箓仪典也。 此更 无差别，唯改易章中小小回用。 无上三天玉司正法律曰：十方天人弟子封灵箓之后，不得作诸劫盗抄略，与凶人更相招引，出入门户。 若为天官司札弟子家宗，即入九都煞律三刑罪论。 无上三天玉司正法律曰：十方天人弟子封箓之后，不得泄慢灵箓，以秽神气，罪入九幽律论。 无上三天玉司正法律曰：十方天人弟子安置灵箓，并镇堂户之上，以制万灵非正诸气。 无上三天玉司正法律曰：十方天人弟子，不得以灵箓贱除，罪同准九都煞律论。 无上三天玉司正法律曰：十方天人弟子，不得取灵箓弃置非己之家，罪准三刑不敬律论。 无上三天玉司正法律曰：十方天人出入门户，皆当存心思神像，见将军兵士列於宫宅，恒不忘之者，灾害立消，神气常存也。 无上三天玉司正法律曰：上部三将军，形长三千六百丈，身相金刚之状，手握玉皇九色召神八煞灵节，乘三色毒龙，虚凝太空之中，去地千丈，将领兵马，神功玄降，即使百刃摧心，万凶时消也。 十方天人弟子，常当象见如是矣。 无上三天玉司正法律曰：中部三将军，形长三千四百丈，身相与上将军形状相似，手握九天七色神虎大煞灵节，乘辟邪之兽，虚凝去地五百丈，将领神兵玄降，即使千毒摧刃，万奸逃亡。 十方天人弟子，常当存见形状如是也。 无上三天玉司正法律曰：下部三将军，形长三千二百丈，身相同一相似也，手握三天三色神金制魔三煞灵节，乘防非之兽，将军虚凝，去地五丈，吏兵在地，从上至下弥罗盖覆一宅，将领兵马玄降，即使五方瘟灾疫毒奔逸 无民之地，妖精殄却，保兆平存而得吉贞。 十方天人弟子，常当存见灵将神兵之状如是也。 无上三天玉司正法律曰：正道则正法，正法则正教，正教则正觉。 十方天人弟子，既登正一道，则无民而化正法，是与天人弟子、可不同归正范也。 七真曰： 无民而化者，道本妙无之宗，而妙应於大无，其真空无，至空即至道，通真上妙，岂仁智能所大量也。 以指太虚也，太虚以自难究，何况至道乎。 道妙有妙 无，无中自然之功用，致此大有焉。",
      "translated_text": "The Three Generals, Officers, and Soldiers of the Supreme Upper Qingwei Heaven—Qingwei Heaven—Qingwei Heaven, each numbering 360,000, shall be dispatched for [the disciple] to restrain and suppress the qi of weaponry disasters. The Three Generals, Officers, and Soldiers of the Supreme Yuanyu Heaven—Supreme Yuanyu Heaven—Supreme Yuanyu Heaven, each numbering 360,000, shall be dispatched for [the disciple] to eliminate the inauspicious qi of the Five Directions, the six harms, and the unruly qi of demonic spirits. The Three Generals, Officers, and Soldiers of the Supreme Great Red Heaven—Great Red Heaven—Great Red Heaven, each numbering 360,000, shall be dispatched for [the disciple] to eradicate the qi of plague, pestilence, weaponry disasters, water and fire calamities, and all afflictions, thereby ensuring their immediate annihilation.\n\nFor [the disciple], they shall muster their might, mobilize their forces, and establish layered defenses—each layer comprising 360,000 troops—fortifying the residence with encampments on all four sides and eight directions, ensuring strict vigilance and protection. This is done in accordance with the decrees of the Supreme Most High, the Jade Emperor, the Great Dao Lord.\n\nThe Seven Perfected state: Should the disciple’s household be gripped by fear, encountering ominous lights, strange apparitions, or demonic influences, or if the family suffers from various disasters and misfortunes, or if neighboring households bring harm through mutual destruction, or if dreams at night are unsettling, or if there is dread of plagues, floods, fires, bandits, or any who seek to inflict harm—all such afflictions shall be addressed by reciting this incantation. The calamities will vanish instantly, and you shall be safeguarded, remaining untroubled.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: When a Dharma Master seals and consecrates the Spirit Register for the disciples of the ten directions’ heavens and earths, they must strictly adhere to the procedures and rituals of transmitting the Mysterious Register, presenting the memorial in proper order. Once the memorial is presented, the Dharma Master and the disciple shall stand facing each other—north and south—before the sacred altar. The Dharma Master shall then recite the names of the generals and soldiers of the Spirit Register, and the disciple shall repeat them aloud. After the disciple has received the register, the Dharma Master shall empower the register with incantations and seals, subsequently sealing it with the chapters of the Supreme Three Origins. The Dharma Master shall then bestow the Spirit Register upon the disciple, who shall bow deeply before the Dharma Master, declaring: \"I, [disciple’s name], a disciple of the Orthodox Dharma of the Pure and True Dao, hereby pay homage with nine prostrations.\"\n\nThe Seven Perfected state: The sealing of the Spirit Register, the submission of official memorials, and all related procedures must adhere to the rituals of transmitting and administering the register. There shall be no deviation, save for minor adjustments in the wording of the chapters.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: After receiving the Spirit Register, the disciples of the ten directions’ heavens and earths must not engage in robbery, plunder, or collusion with malevolent individuals, nor allow such persons to enter their households. Should they violate this, as registered disciples under the jurisdiction of the Heavenly Officials, they shall be subject to the Three Punishments of the Nine Capital Laws.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: After receiving the Spirit Register, the disciples of the ten directions’ heavens and earths must not profane the register with impure qi or show disrespect toward the spirits. Violations shall be judged under the laws of the Nine Dark Realms.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The disciples of the ten directions’ heavens and earths shall place the Spirit Register above the main hall or household entrance to suppress all unruly and inauspicious qi of the myriad spirits.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The disciples of the ten directions’ heavens and earths must not treat the Spirit Register with contempt. Violations shall be subject to the same penalties as the Nine Capital Laws.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The disciples of the ten directions’ heavens and earths must not discard or abandon the Spirit Register in another’s household. Violations shall be judged under the laws of the Three Punishments for disrespect.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Whenever the disciples of the ten directions’ heavens and earths enter or exit their households, they must meditate upon the divine images, envisioning the generals and soldiers arrayed around their residence, never forgetting their presence. Thus, disasters shall vanish instantly, and the spirit’s qi shall remain ever-present.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The Three Generals of the Upper Realm stand 3,600 *zhang* in height, their forms resembling vajra, wielding the Nine-Colored Summoning Spirit and Eight Slaying Spirit Staffs of the Jade Emperor. They ride three-colored poisonous dragons, suspended in the void of the Great Emptiness a thousand *zhang* above the earth, leading their troops. Through their divine power and mysterious descent, even if a hundred blades pierce the heart, all malevolence shall be dispelled in an instant. The disciples of the ten directions’ heavens and earths must always envision them thus.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The Three Generals of the Middle Realm stand 3,400 *zhang* in height, their forms resembling those of the Upper Generals. They wield the Seven-Colored Divine Tiger and Great Slaying Spirit Staffs of the Nine Heavens, riding creatures that ward off evil. Suspended five hundred *zhang* above the earth, they lead their divine troops in mysterious descent. Even if a thousand poisons assail, all wickedness shall flee. The disciples of the ten directions’ heavens and earths must always envision their forms thus.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The Three Generals of the Lower Realm stand 3,200 *zhang* in height, their forms identical to those above. They wield the Three-Colored Divine Gold and Demon-Subduing Three Slaying Spirit Staffs of the Three Heavens, riding creatures that guard against inauspiciousness. The generals hover five *zhang* above the earth, while their officers and soldiers stand upon it, their presence enveloping the entire household from above and below. Leading their troops in mysterious descent, they drive the five directions’ plagues, pestilences, and poisons into uninhabited lands, annihilating demonic spirits and ensuring the peace and prosperity of the household. The disciples of the ten directions’ heavens and earths must always envision the forms of these spirit generals and soldiers thus.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: The Orthodox Dao gives rise to the Orthodox Dharma; the Orthodox Dharma gives rise to the Orthodox Teachings; the Orthodox Teachings give rise to Orthodox Awakening. Once the disciples of the ten directions’ heavens and earths have entered the Orthodox Unity Dao, they shall transform others through the Orthodox Dharma without coercion, thereby aligning with the proper path of the Heavenly Disciples.\n\nThe Seven Perfected state: \"Transforming without coercion\" refers to the Dao’s wondrous and formless origin, which wondrously responds to the Great Void. Its true emptiness is the utmost emptiness, and the utmost emptiness is the utmost Dao. It transcends the subtle and the true, beyond the reach of human intellect or wisdom. It points to the Great Void, which is itself unfathomable—how much more so the utmost Dao? The Dao’s wondrousness lies in its wondrous non-being, and from this non-being arises its natural efficacy, bringing forth this great existence.",
      "overlap_context": "dured, no misfortune undispelled, no blessing unborn, no banditry undestroyed, no virtue unsuited, no evil unremoved, no spirit unrepelled, no wickedness unsubdued, and no fortune unattained.\n\nThe Orthodox Dharma of the Jade Bureau of the Supreme Three Heavens decrees: Should the Orthodox Dharma disciples of the ten directions’ heavens and earths wish to dispel disasters, eliminate spirits, and eradicate misfortune, they must strike the celestial drum thirty-six times and recite the incantation:",
      "start_char": 5093,
      "end_char": 6354,
      "start_sentence": 124,
      "end_sentence": 154,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.75033211708069,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\神符类\\无上三元镇宅灵箓.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "故总智以为神，总神以归慧也。 可谓智慧而成此大明之妙中，自然之正智也。 正智者则正道矣。 其运自功，其化自用，是以四象用之而为主，妙之上妙也。 故弘焉万道之上，更何民哉。 十方诸天至真大圣，莫不尊仰稽首，称乎弟子，上帝天真大神亦复如是，况复天人乎，况复地兆乎，况复鬼神乎，而不欲师之矣。 正化既范，更何民之有也。 有稽首於法师者，皆是清真正法弟子也。 既称弟子，可谓 无民而致化道也。 即在其中矣。 无上三天玉司正法律曰：十方天人弟子封灵箓之后，不得共相合进，造立兵仗，谋图所住国主，反逆帝皇，欺天罔地。 有如此者，罪准九幽地下女青八煞律论。 无上三天玉司正法律曰：十方天人弟子封箓之后，不得口是心非，欺陵孤弱，当平等心识，天神来护。 若造恶者，法准九幽女青三刑律论。 无上三天玉司正法律曰：十方天人弟子封箓之后，不得煞害人命，凶悖自任，不臣法诚。 有犯者，准罪九幽都官三刑律论。 无上三天玉司正法律曰：十方天人弟子封箓录之后，不得背师欺君。 有犯者，准罪九幽长劫律论。 无上三天玉司正法律曰：十方天人弟子封箓之后，法师相去既远，即许命米，准弟子家门男女八节本命之日，以供弟子持斋功用也。 若不准斋，又不送法师门下，准罪九幽八煞律论。 无上三天玉司正法律曰：法师封箓命米，不得居仓聚积，以拟荒年贷取贵直，法师皆准三千九刑律论。 无上三天玉司正法律曰：法师收弟子命米命钱命绢限，不得聚在仓库而不施散。 有犯者法师，准罪三千九幽煞官律论。 无上三天玉司正法律曰：法师收弟子命米，不得居仓库，三年不作功德。 有犯者，准罪三千幽都八煞律论。 无上三天玉司正法律曰：十方天人弟子，若失灵箓者，皆罚灵宝一堂谢愆，事竟，然后方许诣法师更封。 若不斋而法师辄为封箓者，法师与弟子罪同三刑律论。 无上三天玉司正法律曰：十方天人弟子，若遇灾兵水火厄会，去失灵箓者，则许不劳斋正，诣法师封箓而已。 弟子若不更封，准罪九刑阴女青律论。 无上三天玉司正法律曰：法师不得欺罔弟子，妄有所责望，贪利无已，罪皆准三刑律论。 无上三天玉司正法律曰：十方天人弟子自觉有衅，即当诣法师，发露忏悔谢罪也。 其愆自除。 若不尔者，准罪三刑律论。 无上三天玉司正法律曰：法师不得因弟子休否，有所贪索，罪同幽都九刑律论。 金明七真序 盖正法者，则正道也。 故能朗觉至於大觉，乃登正觉，入乎妙觉，的然大妙矣。 实妙之穷微微之上妙，岂以言象能论之哉。 自非玄圣，谁敢指之於象外，而引之於象内也。 夫灵箓者，本出 无上上上元始太上玉皇君传，从无穷劫中来，常於季劫行焉。 出世度人，济苦於阳九，保百六而无伤。 是以道君眷眷之化，岂为已哉。 且正教实犹慈母，念念於赤子，亦如良医之治病，岂愿之而不有效也。 但救世法乘也，复如之者矣。 故三界苍生，在斯烦热患难之中，命若灯烛，焉知其苦，亦言乐在其中耳。 我观群迷，真不乐也。 所以年寿只如电转，终沦八难，悠悠长劫，五毒备经，十苦幽徒，将何乐哉。 身未谢之间，见世讻讻，灾兵莫察，况复此沉骸也。 可谓慈真下教，则使幽途朗觉，九夜方明冥昧，发其智镜之门，以照群生未悟之始，令之通此六慧，晓然 无滞。",
      "translated_text": "Thus, the summation of wisdom constitutes the numinous, and the summation of the numinous returns to insight. This may be called the wondrous center of great illumination, wherein natural and orthodox wisdom arises. Orthodox wisdom is none other than the Orthodox Dao. Its operation stems from inherent efficacy, and its transformation arises from spontaneous function—hence the Four Symbols serve as its foundation, the most wondrous of the wondrous. Therefore, it stands supreme above the myriad Dao; what need is there for coercion?\n\nThe Perfected Great Saints of the ten directions’ heavens all revere and bow their heads in homage, calling themselves disciples. Even the Celestial Perfected and the Great Numinous Ones of the Supreme Emperor act likewise—how much more so the celestial and terrestrial beings, how much more the earthly spirits, how much more the ghosts and gods, who would not desire to take them as masters? Once the Orthodox Transformation has set its pattern, what need is there for coercion?\n\nThose who bow their heads before the Dharma Master are all disciples of the Pure and Orthodox Dharma. Having called themselves disciples, they may be said to have achieved transformation without coercion—this is already inherent within it.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: After the disciples of the ten directions’ heavens and earths receive the Register of Numinous Spirits, they shall not conspire together to forge weapons, plot against the rulers of their dwelling lands, rebel against the imperial sovereign, or deceive heaven and earth. Those who do so shall be judged according to the statutes of the Nine Dark Hells’ *Nüqing* Eight Slayers.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: After the disciples of the ten directions’ heavens and earths receive the Register, they shall not harbor deceit in their hearts while speaking falsely, nor bully the orphaned and weak. They must maintain an impartial mind, and the celestial spirits will come to their protection. Those who commit evil shall be judged according to the statutes of the Nine Dark Hells’ *Nüqing* Three Punishments.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: After the disciples of the ten directions’ heavens and earths receive the Register, they shall not kill or harm living beings, nor act with reckless defiance, nor disobey the laws and sincerity of the Dao. Those who violate this shall be judged according to the statutes of the Nine Dark Hells’ Three Punishments of the Capital Bureau.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: After the disciples of the ten directions’ heavens and earths receive the Register, they shall not betray their masters or deceive their lords. Those who violate this shall be judged according to the statutes of the Nine Dark Hells’ Eternal Punishment.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: After the disciples of the ten directions’ heavens and earths receive the Register, if the Dharma Master is distant, they are permitted to offer rice as commanded, in accordance with the birthdays of the male and female members of the disciple’s household during the eight seasonal festivals, to support the disciple’s observance of fasts and rituals. Those who neither observe the fast nor send offerings to the Dharma Master’s gate shall be judged according to the statutes of the Nine Dark Hells’ Eight Slayers.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: Dharma Masters who receive commanded rice shall not hoard it in granaries, intending to lend it at exorbitant prices during famine years. All such Dharma Masters shall be judged according to the Three Thousand Nine Punishments.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: Dharma Masters who collect commanded rice, money, or silk from disciples shall not hoard them in granaries without distributing them. Those who violate this shall be judged according to the statutes of the Three Thousand Nine Dark Hells’ Slayer Officials.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: Dharma Masters who collect commanded rice shall not store it in granaries for three years without performing meritorious deeds. Those who violate this shall be judged according to the statutes of the Three Thousand Dark Capital’s Eight Slayers.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: If disciples of the ten directions’ heavens and earths lose their Register of Numinous Spirits, they shall be penalized with one hall of *Lingbao* rituals to atone for their transgressions. Only after this may they approach the Dharma Master to receive the Register anew. If a Dharma Master hastily reissues the Register without the disciple observing the fast, both the Dharma Master and the disciple shall be judged according to the Three Punishments.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: If disciples of the ten directions’ heavens and earths encounter disasters such as war, flood, fire, or other calamities and lose their Register of Numinous Spirits, they are permitted to approach the Dharma Master to receive the Register anew without the labor of fasting. If the disciple does not seek reissuance, they shall be judged according to the Nine Punishments of the Dark *Nüqing* Statutes.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: Dharma Masters shall not deceive their disciples, make false demands, or greedily seek profit without end. All such offenses shall be judged according to the Three Punishments.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: If disciples of the ten directions’ heavens and earths become aware of their transgressions, they shall immediately approach the Dharma Master to confess and repent, thereby atoning for their sins. If they do not, they shall be judged according to the Three Punishments.\n\nThe Orthodox Statutes of the Jade Bureau of the Three Supreme Heavens state: Dharma Masters shall not exploit the fortunes or misfortunes of their disciples to extort gains. Those who do so shall be judged according to the Nine Punishments of the Dark Capital.\n\n**Preface of the Seven Perfected of Golden Clarity**\n\nThe Orthodox Dharma is none other than the Orthodox Dao. Thus, it can illuminate awakening to the point of Great Awakening, ascend to Orthodox Awakening, and enter Wondrous Awakening—truly the utmost of the wondrous. The subtlest profundity of the wondrous, the most wondrous of the subtle, how can it be discussed in terms of words or images? Unless one is a Mystic Sage, who would dare to point beyond forms and guide within them?\n\nThe Register of Numinous Spirits originally derives from the transmission of the Supreme August Jade Emperor of the Primordial Beginning of the Utmost Supreme Three Heavens, having come from the kalpas without end. It has always been practiced during the final kalpas, emerging into the world to deliver beings, relieving suffering during the *yangjiu* and *bailiu* catastrophes, and preserving all without harm. Thus, the transformation of the Dao Lord is not for His own sake.\n\nMoreover, the Orthodox Teaching is truly like a compassionate mother, ever mindful of her children, just as a skilled physician treats illness—how could it not be effective? Yet the Dharma of worldly salvation is like this. The sentient beings of the Three Realms dwell amidst afflictions, hardships, and calamities, their lives like flickering lamps—how can they know their suffering? They may speak of joy within it, but I observe the deluded masses and see that they are truly not joyful. Their years and lifespans pass like lightning, ultimately sinking into the Eight Difficulties, drifting through endless kalpas, enduring the Five Poisons, and suffering the Ten Torments in the dark prisons—what joy is there in this?\n\nBefore their bodies have perished, they witness the turmoil of the world, unaware of impending disasters and wars—how much more so when their bones have already sunk into the depths? This may be called the compassionate teaching of the Perfected descending to illuminate the dark paths, dispelling the obscurity of the Nine Nights, opening the gate of wisdom’s mirror to illuminate the beginnings of the unenlightened masses, enabling them to penetrate the Six Insights and awaken without obstruction.",
      "overlap_context": "rs to the Dao’s wondrous and formless origin, which wondrously responds to the Great Void. Its true emptiness is the utmost emptiness, and the utmost emptiness is the utmost Dao. It transcends the subtle and the true, beyond the reach of human intellect or wisdom. It points to the Great Void, which is itself unfathomable—how much more so the utmost Dao? The Dao’s wondrousness lies in its wondrous non-being, and from this non-being arises its natural efficacy, bringing forth this great existence.",
      "start_char": 6354,
      "end_char": 7644,
      "start_sentence": 155,
      "end_sentence": 203,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.17632985115051,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\神符类\\无上三元镇宅灵箓.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "使生者家门吉贞，亡者升化天堂，游神自在，以利后世子孙之安存者，则此灵箓之正教，而致保兆得度五浊，至於三灾六害不使加身，其功能制天地之运，况复鬼神乎，而不灭爽。 但 无上三天玉司正法，所部如是威神，乃自然之灵将也。 兵士亦然唯我信矣，兆民岂能悟哉。 无上三元镇宅灵箓竟",
      "translated_text": "May the living secure auspicious harmony for their households, and the deceased ascend to transform in the heavens, their spirits roaming freely—thus ensuring the peace and preservation of descendants for generations to come. Such is the true teaching of this sacred register, by which the multitudes are protected and delivered from the Five Turbidities, and the Three Calamities and Six Harms are kept from afflicting their bodies. Its power can regulate the movements of heaven and earth—how much more so the ghosts and spirits, that they should not perish or fade?\n\nYet only the Supreme Three Heavens’ Jade Bureau of the Orthodox Dao possesses such majestic numinosity, for these are the natural spirit-generals. The divine soldiers are likewise—only we believe in them; how could the common people awaken to this truth?\n\nHere ends the *Supreme Three Primes’ Spirit Register for Pacifying the Household*.",
      "overlap_context": "efore their bodies have perished, they witness the turmoil of the world, unaware of impending disasters and wars—how much more so when their bones have already sunk into the depths? This may be called the compassionate teaching of the Perfected descending to illuminate the dark paths, dispelling the obscurity of the Nine Nights, opening the gate of wisdom’s mirror to illuminate the beginnings of the unenlightened masses, enabling them to penetrate the Six Insights and awaken without obstruction.",
      "start_char": 7644,
      "end_char": 7778,
      "start_sentence": 204,
      "end_sentence": 207,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.132864713668823,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\神符类\\无上三元镇宅灵箓.txt",
        "category": "神符类"
      }
    }
  ]
}