{
  "source_id": "无量度人上品妙经旁通图",
  "source_file": "chunked_daozang\\无量度人上品妙经旁通图.json",
  "total_chunks": 6,
  "total_original_chars": 4645,
  "total_translated_chars": 28485,
  "total_translation_time": 138.3951871395111,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\灵图类\\无量度人上品妙经旁通图.txt",
    "category": "灵图类"
  },
  "full_translation": "**The Supreme Wondrous Scripture of the Numinous Treasure for Salvation of Humanity: The Comprehensive Diagram**\n\n**Scripture Title:** *The Supreme Wondrous Scripture of the Numinous Treasure for Salvation of Humanity: The Comprehensive Diagram*\nCompiled by Daoist Liu Yuandao of the late Northern Song dynasty. Originally in three scrolls, now only the middle and lower scrolls remain.\n**Source Text:** *Zhengtong Daoist Canon*, *Dongzhen* Section, *Lingtu* (Numinous Diagrams) Category.\n\n---\n\n**The Supreme Wondrous Scripture of the Numinous Treasure for Salvation of Humanity: The Comprehensive Diagram, Middle Scroll**\nCompiled by Liu Yuandao, Purple-Robed Daoist of the Taiqing Chuqing Abbey and Guardian of the One\n\n### **Thirty-Five Divisions: The Primordial Qi of the Upper Origin**\nThe Seven Stars of the Northern Dipper and the Twenty-Eight Constellations of the Four Directions together form the Thirty-Five Divisions. They govern the primordial *qi* of the Upper Heavens, presiding over creation and transformation.\n\nThe Northern Dipper is the Central Dipper. As stated in the *Records of the Grand Historian: Treatise on the Celestial Offices*: \"The Dipper is the Emperor’s chariot, revolving at the center and overseeing the four quarters. It divides yin and yang, establishes the four seasons, harmonizes the Five Phases, shifts the nodal measures, and determines all celestial reckonings—all pivot upon the Dipper.\" This diagram is drawn to observe the directional configurations. I have arranged the constellations to clarify this chapter, depicting the Thirty-Five Divisions of the Primordial *Qi* of the Upper Origin.\n\n### **The Thirty-Two Heavens: A Comprehensive Summary of Hidden Mysteries**\nFrom the Great Yellow Emperor’s *Huang* Heaven to the *Shangming* and Seven Luminaries’ *Moye* Six Heavens form the Desire Realm.\nFrom the *Xuwu Yueheng* Heaven to the *Wuji Tanshi* Eighteen Heavens form the Form Realm.\nFrom the *Haoting Xiaodu* Heaven to the *Taisu Xiule Jin* Four Heavens form the Formless Realm.\nThese constitute the Three Realms.\n\nFrom the *Taixu Wushang Changrong* Heaven to the *Taiji Pingyu Jiayi* Four Heavens are the Heavens of the Seed People.\n\nUpon examining this scripture, I have divided it into ten matters:\n1. **Heavenly Names** – The names established at the beginning of the kalpa.\n2. **Imperial Titles** – The titles bestowed by the Primordial Beginning.\n3. **Imperial Taboo Names** – The names of the Heavenly Emperors.\n4. **Heavenly Emperor’s Governance** – The office of the Eternal Dao.\n5. **Constellation Qi** – The *qi* descending in connection with the Twenty-Eight Constellations.\n6. **Qi Names** – The names of the primordial *qi* as received.\n7. **Qi Colors** – The colors of the primordial *qi* as divided by direction.\n8. **Great Brahma’s Hidden Speech** – Established internally, composed by the Dao Lord. The details are explained in the chapter on the origin of inner sounds in the lower scroll.\n9. **Divisional Boundaries** – The ascent and descent between upper and lower.\n10. **Lifespans of Heavenly People** – The measures of longevity and brevity.\n\nThis diagram is the essence of the precious scripture; those who recite and uphold it should study it in detail and practice accordingly. I have synthesized the commentaries of Chen Jingyuan, Xuan Ying’s *Subtle Exegesis*, Li Shaowei, Xue Youqi, and Yan Dong, along with the *Hunyuan Tu Yi* and *Kongdong Lingzhang Jing*, to establish this chapter.\n\n**Heavenly Names, Imperial Titles, Imperial Taboo Names, Heavenly Emperor’s Governance, Constellation Qi, Qi Names, Qi Colors, Great Brahma’s Hidden Speech, Divisional Boundaries, Lifespans of Heavenly People**\n\n### **Explanation of Constellation Qi**\nThe twenty-eight heavens of the cardinal directions each correspond to the *qi* of one constellation. The four heavens of the intercardinal directions each correspond to the *qi* between two constellations. Furthermore, the descending and intersecting *qi* cause the northeast heaven to also connect with the northwest constellation, for the generative *qi* ascends in a spiral like a ram’s horn. Though the profound principles are thoroughly understood, confusion may arise regarding the directions and intercardinal points; thus, this diagram is made to clarify them.\n\n### **Names and Taboo Names of the Five Directions’ Five Emperors and Their Governance**\nAccording to the scriptural meaning, the Five Heavens—endowed with the *qi* of the Five Spirits—reside in the midst of the Great Void. Above them are the Five Dippers, and below stand the Five Peaks, governed by the Five Emperors. These are the heavens of directional colors, not the heavens of formed images.\n\nThe names, taboo names, and governance of the Five Elders, Five Emperors, Five Dippers, Five Heavenly Demon Kings, and Five Great Demon Kings must be known by those who recite the scripture. I have synthesized the commentaries of Chen Jingyuan, Xuan Ying’s *Subtle Exegesis*, Li Shaowei, the *Shangshu Zhiyao Tu*, and the *Wupian Zhenwen Jing* to establish this chapter.\n\n**Names and Taboo Names of the Five Directions’ Five Emperors:**\n- **Eastern Azure Heaven**: Azure Numinous Beginning Elder, Azure Emperor, surname *Lan*, taboo name *Kaiming*, titled *Lingweiyang*.\n- **Southern Vermilion Heaven**: Cinnabar Numinous Perfected Elder, Vermilion Emperor, surname *Dongfu*, taboo name *Liuyan*, titled *Chibiaonu*.\n- **Western White Heaven**: Radiant Numinous August Elder, White Emperor, surname *Shangjin*, taboo name *Changkai*, titled *Baizhaoju*.\n- **Northern Black Heaven**: Dark Numinous Mystic Elder, Black Emperor, surname *Heijie*, taboo name *Linghui*, titled *Yeguangji*.\n- **Central Yellow Heaven**: Mysterious Numinous Primordial Elder, Yellow Emperor, surname *Tongban*, taboo name *Yuancheng*, titled *Hanshuniu*.\n\n**The Five Dippers:**\n- **East**: Horn, Neck, Root, Chamber, Heart, Tail, Winnower.\n- **South**: Well, Ghost, Willow, Star, Spread, Wings, Axletree.\n- **West**: Straddler, Bond, Stomach, Hairy Head, Net, Turtle Beak, Three Stars.\n- **North**: Dipper, Ox, Girl, Emptiness, Rooftop, Encampment, Wall.\n- **Center**: Greedy Wolf, Great Gate, Store of Fortune, Literary Brilliance, Integrity and Chastity, Martial Brilliance, Breaker of Armies.\n\n**Names and Taboo Names of the Five Heavenly Demon Kings:**\n- Azure Heaven Demon King: surname *Fu*, taboo name *Chichengba*.\n- Vermilion Heaven Demon King: surname *Fu*, taboo name *Yousu*.\n- White Heaven Demon King: surname *Chi*, taboo name *Zhangshi*.\n- Black Heaven Demon King: surname *Xu*, taboo name *Zhishi*.\n- Yellow Heaven Demon King: surname *Tianmen*, taboo name *Bokuang*.\n\n**Names and Taboo Names of the Five Great Demon Kings:**\n- Great Demon of the Azure Emperor: surname *Poluo*, taboo name *Wanxing*.\n- Great Demon of the Vermilion Emperor: surname *Zhe*, taboo name *Shangbai*.\n- Great Demon of the White Emperor: surname *Deng*, taboo name *Xuni*.\n- Great Demon of the Black Emperor: surname *Xiao*, taboo name *Gongsun*.\n- Great Demon of the Yellow Emperor: surname *Wangong*, taboo name *Chansheng*.\n\n**Governance of the Five Emperors:**\n- The Azure Emperor guards the *hun*.\n- The Vermilion Emperor nurtures the *qi*.\n- The White Emperor attends the *po*.\n- The Black Emperor circulates the blood.\n- The Yellow Emperor, as the Central Lord, governs all spirits.\n\n**Governance of the Five Dippers:**\n- The Eastern Dipper controls destiny.\n- The Southern Dipper bestows life.\n- The Western Dipper records names.\n- The Northern Dipper decrees death.\n\nThe Central Dipper’s Great Chief oversees and monitors all spirits.\n\n**Governance of the Five Heavenly Demon Kings:**\n- The Azure Heavenly Demon King: *Bayuan Choubo*\n- The Vermilion Heavenly Demon King: *Futian Danshi* (Bearer of Heaven and Stone)\n- The White Heavenly Demon King: *Fanshan Liumu* (Six-Eyed Mountain-Reverser)\n- The Black Heavenly Demon King: *Jianchou Langfu*\n- The Yellow Heavenly Demon King: *Hengtian Danli* (Heaven-Bearer of Strength)\n\n**The Eight Numerals**\nThe eight numerals correspond to the number eight, here fully enumerated.\nI, following Yan Dongzhu, have harmonized this chapter with the *Dharma Wheel Sutra*.\n\n**The Eight Awes:**\nDragon, *qilin*, tiger, leopard, lion, cinnabar serpent, heavenly steed, and fierce beast.\n\n**The Eight Luminaries:**\nSun, moon, Jupiter (Wood Virtue), Mars (Fire Virtue), Venus (Metal Virtue), Mercury (Water Virtue), Saturn (Earth Virtue), and the stars of the Five Dippers.\n\n**The Eight Nether Extremes:**\nEastern Pole, Southeastern Pole, Southern Pole, Southwestern Pole, Western Pole, Northwestern Pole, Northern Pole, Northeastern Pole.\n\n**The Eight Gates:**\nEastern Gate of the Heavenly Dharma Wheel,\nSoutheastern Gate of the Heavenly Dharma Wheel,\nSouthern Gate of the Heavenly Dharma Wheel,\nSouthwestern Gate of the Heavenly Dharma Wheel,\nWestern Gate of the Heavenly Dharma Wheel,\nNorthwestern Gate of the Heavenly Dharma Wheel,\nNorthern Gate of the Heavenly Dharma Wheel,\nNortheastern Gate of the Heavenly Dharma Wheel.\n\n**Division of Scripture’s Beginning and End**\nThe Heavenly Worthy expounded two chapters of scripture, each with a preface and postface.\nThe *Great Brahma Hidden Speech* likewise has a preface and postface.\nAll were composed by the Dao Lord.\nThe details are recorded in the lower scroll’s *Chapter on the Descent of the Bright Treasure Scripture’s Sealed Treasury* and the *Chapter on the Causes of the Inner Sounds’ Manifestation*.\nHere, the beginning and end are separated, the sections divided, and the character count fixed according to the canon.\nIncluding the titles, the total is 4,574 characters. Following Chen Jingyuan’s exegesis and integrating Zhang Wanfu’s oral instructions, I have established this chapter.\n\n**Section Titles:**\n*Two Chapters of the Supreme Dao Lord*,\n*Preface*,\n*Former Chapter of the Heavenly Worthy of Primordial Beginning’s Treasure Scripture*,\n*Latter Chapter of the Heavenly Worthy of Primordial Beginning’s Treasure Scripture*,\n*Postface to the Two Chapters of the Supreme Dao Lord*,\n*Preface to the Great Brahma Hidden Speech*,\n*Postface to the Great Brahma Hidden Speech*.\n\n**Character Count of Scripture’s Beginning, End, and Sections:**\nFrom *The Dao spoke of old in the Primordial Azure Heaven* to *recite the scripture facing east*: 1,595 characters.\nFrom *The Primordial Beginning’s Cavernous Mystery Numinous Treasure Original Chapter* to *the Five Emperors of the Three Realms declare to Supreme Clarity*: 1,278 characters.\nFrom *The Primordial Cavern’s Jade Calendar* to *those who leak secrets fall into hell, their calamity extending to seven generations of ancestors*: 786 characters.\nFrom *The Dao spoke of these two chapters* to *thus shall the profound and ultimate words be thoroughly illuminated*: 440 characters.\nFrom *Among the heavens* to *the middle section of the Numinous Writ*: 19 characters.\nFrom *Danlou Ahui* to *deliver beings in the dark and tranquil*: 256 characters.\nFrom *The Dao spoke of these great Brahma hidden sounds among the heavens, the boundless tones* to *the boundless and mysterious, the mysterious and profound*: 186 characters.\n\n**End of the Middle Scroll of the *Illustrated Companion to the Wondrous Scripture of the Uppermost Numinous Treasure for the Limitless Deliverance of Beings***\n**Lower Scroll of the *Illustrated Companion to the Wondrous Scripture of the Uppermost Numinous Treasure for the Limitless Deliverance of Beings***\n\nCompiled by Liu Yuandao, Purple-Robed Daoist and *Guardian of Unity* at the Supreme Clarity Repository of Blessings Abbey\n\n**Oral Instructions for Reciting the Two Principal Scripture Chapters**\nOn days appointed for scripture recitation, within a purified chamber, set up an altar facing east with a scripture stand and seating. Enter the chamber, turn your back to the mat, and face east to perform the three bows.\nAfter bowing, withdraw and sit facing north upon the mat.\nOnce the *qi* settles, gradually turn left to sit facing east.\n\nRecite the incantation:\n*Silent, it reaches the ultimate source,*\n*Vastly erect, beyond kalpas’ blade, Ah.*\n*Profound and cavernous, the mysterious writ—*\n*Who fathoms this hidden distance?*\n*Entering the Great Vehicle’s path,*\n*Who reckons the kalpas’ span?*\n*Neither born nor extinguished,*\n*Yet born from the lotus’ cause.*\n*Transcending the Three Realms’ way,*\n*Compassionate heart unbinds the world’s net.*\n*Perfected One of supreme virtue,*\n*Generation upon generation, a family of immortals.*\n\nUpon completing the incantation, place your hands upon your knees and strike the teeth thirty-two times.\nClose your eyes and visualize the thirty-two heavens, each with its Emperor Lord.\nContemplate one heaven’s name and bow in your heart to its Heavenly Emperor.\nBeginning with *Huangceng Heaven*, follow the sun’s course, circling the four directions, gradually ascending to *Jiayi Heaven*.\nIn all, thirty-two bows—though the body remains still, the heart prostrates.\nAfter bowing, envision yourself enveloped in clouds of azure, yellow, and white *qi*, filling the chamber with dense, misty radiance.\nTo your left, the Azure Dragon; to your right, the White Tiger; before you, the Vermilion Bird; behind you, the Dark Warrior.\nSixteen lions sit in two rows facing one another; an equal number of white cranes stand beyond them.\nThe sun shines before you, the moon behind, illuminating the chamber. A nine-colored halo arises from your crown, shining through all heavens.\nSurveying all you have visualized, it stands vividly before your eyes.\n\nRecite silently the incantation:\n\nThe Most High Mysterious Primordial Supreme Dao Lord, summon forth from within this servant’s body the Three and Five Merit Officers, the Left and Right Attendants, the Jade Lads of Incense, the Jade Maidens of Transmission, the Direct Talismans of the Five Thearchs, and the Daily Incense Officials—thirty-two of each—opening the passage for the words to be spoken.\n\nThe words to be spoken are those supplications for Heaven and Earth, sun and moon, the stellar lodges, the sovereign, teachers and friends, ancestors, oneself, and the multitudes of the people. When the incantation reaches the phrase \"opening the passage,\" these are to be declared.\n\nToday is an auspicious and joyous occasion; the hall is pure, the fast unbroken, the scripture recited for the boundless salvation of beings. This servant, together with [name or \"so-and-so\"], [name or \"such-and-such matter\"]—here state the same aspiration as above—prays that the petition ascend directly to the presence of the Most August Primordial Celestial Venerable of the Thirty-Two Heavens.\n\nUpon completing the incantation, slowly draw in one breath of *qi* from each of the Thirty-Two Heavens, swallowing it in turn. Proceed as before. Cease.\n\nThen open the eyes and recite the two chapters. Upon completing the recitation, face south and descend from the mat, bowing twice before withdrawing.\n\nFollowing the interpretations of Chen Jingyuan and the methods of Zhang Wanfu, these chapters are established.\n\n**Quiet Chamber Diagram**\nThe Great Elixir is thus; the affairs within the illuminated chamber need not face south to open the door.\n\n**Recitation of the Inner Sounds Formula**\n\nRecite the sixty-four characters of the East:\nFrom *\"Danlou Ahui\"* to *\"Four Images Xuyuan.\"*\nSit upright, click the teeth nine times, and visualize nine-colored dragons guiding before and behind, with nine layers of azure clouds enveloping the body.\n\nSilently intone the incantation:\n*\"Vermilion brightness unfolds the diagram, eight qi return to the true.\nGoverning the Mysterious Gate, Great Azure Deity.\nFlowing transformation beyond the nine, entwining my body.\nSacred sounds of eight writings, sixty-four chapters.\nPenetrating Heaven and Earth, uniting with me as immortal.\nSummoning the dragon chariot, ascending to the imperial axis.\"*\n\nConclude, draw in *qi* nine times and swallow it, then recite.\n\nRecite the sixty-four characters of the South:\nFrom *\"Nanyan Dongfu\"* to *\"Divine tassels from the palace.\"*\nSit upright, click the teeth three times, and visualize a vermilion phoenix soaring before you, with three layers of crimson clouds enveloping the body.\n\nSilently intone the incantation:\n*\"Three qi linger, the sacred phoenix arrives in flight.\nJade sounds of eight characters, resplendent in the Purple Tenuity.\nAuspicious day, great celebration—my Dao opens wide.\nCrimson cinnabar as sweet nectar, I gaze upward to absorb the sacred radiance.\nBody born of water and fire, clad in crimson feathered robes.\nAscending the void with mystic steps, feet treading the phoenix ladder.\nCircling the eight heavens, seven ancestors follow.\nConclude, draw in *qi* three times and swallow it, then recite.\"*\n\nRecite the sixty-four characters of the West:\nFrom *\"Daoli Huiyou\"* to *\"Cypress Void Transcendent.\"*\nSit upright, click the teeth seven times, and visualize the White Tiger and lions guarding before and behind, with seven layers of white clouds enveloping the body.\n\nSilently intone the incantation:\n*\"Seven qi of golden numen, honored deities of the eight heavens.\nWhite Tiger steers the chariot, lions bear the shaft.\nSeven qi entwine, refining me into an immortal.\nBody ascends in golden light, illuminating the white clouds.\nInner and outer transformations, rising into the cavernous gate.\nSeven ancestors escape the night, nine dark realms revolve their souls.\nEons of deliverance, enduring with the turning of fate.\"*\n\nConclude, draw in *qi* seven times and swallow it, then recite.\n\nRecite the sixty-four characters of the North:\nFrom *\"Juewu Ziyu\"* to *\"Secluded Tranquility Delivers Beings.\"*\nSit upright, click the teeth five times, and visualize flying dragons and the Dark Warrior, their feathered canopies lush; divine youths and jade maidens in feathered robes and flying garments. Five layers of black clouds envelop the body.\n\nSilently intone the incantation:\n*\"Mysterious Heaven lingers, flowing radiance ascends to the Upper Clarity.\nGreat Possession initiates the turning, eight characters exalted in brightness.\nFlying darkness stills the void, the hidden yin spontaneously generates.\nFive qi entwine, irrigating my form.\nCrowned and girded in the Northern Loneliness, receiving refinement in the cavernous numen.\nKidney palace emerges from the north, inner and outer luminous essence.\nSoaring through the Three Realms, roaming and feasting in the Purple Court.\nSeven ancestors share fortune, rejoicing in kalpas of age.\nWithin the Forest of Seven Treasures, reborn in a returned womb.\nEmerging from eternal night, names recorded in the Southern Palace.\nYellow Registers and White Tallies—lifetimes of immortals.\"*\n\nConclude, draw in *qi* five times and swallow it, then recite.\n\n**Verification of Reciting the Two Chapters of the Orthodox Scripture**\n\nDuring the long fast of the first month, recite and chant this scripture to sever the earthly bonds of ancestral spirits, delivering them to the Southern Palace.\n\nDuring the long fast of the seventh month, recite and chant this scripture to attain divine transcendence, with names inscribed in the heavens.\n\nYellow Registers and White Tallies erase death and grant rebirth.\n\nDuring the long fast of the tenth month, recite and chant this scripture for the emperor and sovereign, ruler and ministers, father and son, to stabilize the nation’s destiny and preserve Heaven’s enduring existence. Dynasties shall never cease, perpetually ruling as sovereigns. Stabilizing their realm, the people shall praise great peace.\n\nOn the eight seasonal nodes, recite and chant this scripture to become a Perfected of the Nine Palaces. On one’s natal day, recite and chant this scripture to purify the soul and spirit, preserving the myriad *qi* eternally, avoiding suffering, and radiating light from the body. Guarded by the Three Realms, welcomed by the Five Emperors, myriad deities pay homage, and names are inscribed in the heavens above. With merits fulfilled and virtue perfected, ascend to the Upper Clarity.\n\nRecite ten times, and the heavens record the merit; recite a hundred times, and names are delivered to the Southern Palace; recite a thousand times, and demon kings provide escort; recite ten thousand times, and the Dao is complete—ascend to the Great Void.\n\nIf one encounters such an occasion and adheres to the formula in recitation, above it dispels celestial disasters and safeguards the emperor; below it wards off poison and harm to deliver the multitudes; in the middle, it liberates ancestors and grants oneself the Dao. This may be called the majestic and vast Great Brahma, the unparalleled one who strides the Jade Capital.\n\n**Verification of Reciting the Inner Sounds**\n\nThe Great Brahma sounds of the East: recite for nine years, and the eight heavens each send eight Azure-Waisted Jade Maidens and Azure-Flora Jade Lads to attend and guard the body, descending the essence of Azure Teeth. The body radiates light, perceiving the formless. After ten thousand recitations, the Dao is achieved—soaring to the Upper Clarity, seven ancestors share fortune, all ascending to the Southern Palace.\n\nThe Great Brahma sounds of the South: recite for three years, and the eight heavens each send eight Great Cinnabar Jade Maidens and Great Yang Jade Lads to attend and guard the body, descending the essence of the three crimson *qi*. White returns to the complexion, enduring for ten thousand kalpas. Seven ancestors transcend and ascend, entering the Hall of Fortune, reborn in the immortal lineage—thus attaining renewal.\n\nThe Great Brahma sounds of the West: recite for seven years, and the eight heavens each send eight Luminous Jade Lads to attend and guard the body, descending the essence of the seven primordial *qi*. Age halts, countenance preserved—youthful for ten thousand kalpas. Blessings extend to seven ancestors, ascending and delivered to the Southern Palace, reborn in renewal, lifetimes of immortals.\n\nThe Great Brahma sounds of the North: recite for five years, and the eight heavens each send eight Great Primordial Jade Lads to attend and guard the body, descending the essence of the five nourishing *qi*. Years return, radiance preserved—lifespan secured in the Three Clarities. Fortune extends to the nine lineages, lifetimes of ascension.\n\nIf one adheres to the formula in reciting the inner sounds of the four directions, there is nothing that cannot be averted, nothing that cannot be warded, nothing that cannot be delivered, nothing that cannot be accomplished.\n\nThe Flying Celestials descend in observation, the Supreme Emperor chants from afar, myriad spirits pay homage in reverence, and the Three Realms attend in solemn procession. Subduing the host of spirits, purifying the ten directions, the Dao perfected and merits accomplished—one serves as minister to the Three Bounds.\n\nI, in my foolishness, have arranged this fixed chapter of the *Zhang Wanfu Jue*.\n\n**The Precious Scripture Sealed and Bestowed Upon the World**\nThe Heavenly Worthy, in the Azure Prime of Heaven, expounded this scripture and conferred it upon the Dao Lord. Later, in the Great Cinnabar Heaven, he bestowed the Great Brahma Sounds. After the Dao Lord had compiled and ordered it, the heavens treasured it as a sacred relic, secreting it within the Purple Tenuity Palace of the Jade Capital in the Mysterious Metropolis. Its sealing and concealment are of the utmost gravity—none but the sagely may transmit it. Later, the Queen Mother of the West petitioned the Heavenly Emperor to descend it for averting the calamity of the *jiashen* year, entrusting it to the adepts of perfected truth, whence it thereafter circulated among mortals.\n\nThis scripture comprises the hidden hymns of the Celestial Emperors of all heavens and the arcane chants of the Demon Kings. Within it are expounded the kalpic destinies of heaven and earth, the names and titles of the myriad spirits, the intercourse of *yin* and *yang*, and the generation and transformation of primordial *qi*. Its meanings cannot be fully fathomed, nor its principles fully unraveled. Those who attain enlightenment in the Dao shall naturally achieve profound clarity.\n\nIn the heavens, it is transmitted but once every forty thousand kalpas; among mortals, but once every forty years. To leak or profane it lightly brings misfortune upon nine generations, condemning them to eternal servitude in the dark nether realms. How can one not be cautious? How can one not be cautious?\n\nI, Li Shaowei, in my foolishness, have annotated and fixed this chapter.\n\n**The Origin of the Inner Sounds**\nThe Heavenly Worthy, seated in the Cypress Mound of the Vermilion Radiance World, was enveloped in dense clouds and mist for three days and nights, the gloom unrelieved. The Five Elder Thearchs addressed the Heavenly Worthy, saying: \"Such has never been seen in our attendance today.\" When the Heavenly Worthy expounds the teachings, mountains and seas fall silent, and heaven and earth grow solemn and clear. Yet now, in broad daylight, darkness prevails, and the celestial and mortal realms are filled with dread. We, your ministers, are perplexed and know not the cause.\n\nThe Heavenly Worthy replied: \"Today, the manifold heavens have manifested auspicious signs, and numinous responses arise spontaneously. Jade characters blaze with brilliance, obscuring the light of life. Let all present close their eyes and await the revelation.\" In an instant, the celestial *qi* surged forth, the gloom dissolved, and five-colored radiance illuminated the ten directions. Each bore a spirit-script, its characters a *zhang* in breadth, manifesting in the void. Their splendor dazzled, eight-cornered rays trailing, their luminous essence so blinding they could not be gazed upon directly.\n\nThe Heavenly Worthy proclaimed to the assembled spirits: \"This is the *Lingshu Bahui*, its characters devoid of fixed form, its purport profound and recondite—difficult for you to fathom in detail.\" Thereupon, he commanded the Heavenly Perfected Sovereign to transcribe the characters and elucidate their sounds, bestowing them upon the Dao Lord, totaling two hundred fifty-six characters. The Dao Lord arranged and composed them into text, calling it the *Great Brahma Hidden Speech*. It was appended to the two preceding chapters in sequence.\n\nThe Sovereign was one who, in the time of the Yellow Emperor, descended upon Mount Emei to confer upon him the method of the Three Ones and Five Sprouts, later ascending to heaven.\n\nI, in my foolishness, have collated the *Inner Sounds Scripture* with the *Biographies of the Immortals* to fix this chapter.\n\n**Citations**\n*The Scripture of the Jade Capital Mountain of the Most High*\n\n*The Scripture of the Five Chapters of the Vermilion Writ of Numinous Treasure*\n*The Scripture of the Nine Heavens’ Engendering of the Divine*\n*The Most High’s Scripture of the Dragon-Steed Opening Heaven*\n*The Scripture of the Cavernous Numinous Chapters*\n*The Scripture of the Jade Characters of the Inner Sounds of the Myriad Heavens*\n*The Scripture of the Inner Writ of the Azure Lad*\n*The Wondrous Scripture of the Dharma-Wheel of Admonitions of the True One*\n*The Most High’s Scripture of the Three Primes’ Precepts*\n*The Scripture of the Golden Mirror and Numinous Pivot of Heavenly Treasure*\n*The Regulations of the Perfected*\n*Sima Qian’s* Records of the Grand Historian: *Treatise on the Celestial Offices*\n*The Repentance for Dissolving Calamities*\n*Liu Xiang’s* Biographies of the Immortals\n*Du Guangting’s* Diagram of the Primordial Origin\n*The Diagram of the Adjacent Connections of the Sacred Stations of the Northern Dipper*\n*Zhang Songchen’s* Diagram of the Arrayed Lodgings\n*Shu Bing’s* Essential Diagrams from the *Governance of the Book of Documents*\n*Chen Jingyuan’s* Diagram of the Sacred Stations of All Under Heaven\n*Li Sicong’s* *Anthology of the Cavernous Abyss*\n*Zhang Wanfu’s* Oral Instructions on the *Scriptures of Numinous Treasure*\n*The Revised Oral Instructions on the* Scriptures of Numinous Treasure\n*Yan Dong’s* Commentary on the *Scriptures of Numinous Treasure*\n*Xue Youqi’s* Commentary on the *Scriptures of Numinous Treasure*\n*Li Shaowei’s* Commentary on the *Scriptures of Numinous Treasure*\n*Cheng Xuanying’s* Subcommentary on the *Scripture of Salvation*\n*Chen Jingyuan’s* *Subtle Meaning of the Precious Pearl*\n*The Lower Scroll of the Diagram of Adjacent Connections to the* Wondrous Scripture of the Supreme Prime of Salvation for the Boundless",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "灵宝度人上品妙经旁通图 经名：灵宝度人上品妙经旁通图。 北宋末道士刘元道编。 原本三卷，现残冉中下二卷。 底本出处：《正统道藏》洞真部灵图类。 无量度人上品妙经旁通图卷上（原缺） 无量度人上品妙经旁通图卷中 太清储庆宫守一大师赐紫道士刘元道编次 三十五分总炁上元 北斗七元星君，与四方二十八宿，为三十五分。 总元炁於上天，以司造化也。 北斗者，中斗也。 《史记天官书》曰：斗为帝车，运于中央，临制四乡。 分阴阳、建四时、均五行、移节度、定诸纪，皆击於斗。 今画此以观方象。 愚以列宿图定此章。 仰图三十五分总炁上元。 三十二天总括隐秘 大黄皇曾至上明七曜摩夷六天，为欲界； 虚无越衡至无极昙誓一十八天，为色界； 皓庭霄度至太素秀乐禁上四天，为无色界。 是谓三界也。 太虚无上常融，至太极平育贾奕四天为种民。 今考本经，分为十事：一曰天名，劫初分定之名。 二曰帝号，元始所命之号。 三曰帝讳，天帝之名也。 四曰天帝所主，常道之职也。 五曰系宿炁，降连二十八宿之炁。 六曰炁名，元炁禀受之名。 七曰炁色，元炁分方之色。 八日大梵隐语，内立。 也，道君撰成。 事具下卷明内音所因章中。 九曰分界，上下升降也。 十日天民寿数。 短长之数也。 此图最为宝经之要，诵持者宜详而行焉。 愚以陈景元义，合成玄英疏、李少微、薛幽栖、严东注。 混元图翼空洞灵章经。 内音玉字经定此章。 天名帝号帝讳天帝所土系宿然炁名炁色人梵隐语分界天民寿数 系宿炁说 正方二十八天，一天系一宿之炁。 四维四天，各系二宿之间梵炁。 又等降相交，东北之天复系西北之宿，盖生炁上转如羊角而升者也。 赜理之流，虽洞其义趣而虑惑於方维，因作此图以明之。 五方五帝所主名讳 经义所载五天、五天者，禀五神之炁，居太空之中。 上列五斗，下立五岳，五帝治之。 盖方色之天，非成象之天也。 五老、五帝、五斗、五天魔王、五大魔王名讳，及所掌，诵经者固当知之。 愚以陈景元义合成玄英疏、李少微注，《尚书治要图》、《五篇真文经》定此章。 五方五帝姓讳：东方青天，青灵始老青帝，姓烂，讳开明，号灵威仰。 南方赤天，丹灵真老赤帝，姓洞浮，讳柳炎，号赤熛弩。 西方白天，皓灵皇老白帝，姓上金，讳昌开，号白招拒。 北方黑天，五灵玄老黑帝，姓黑节，讳灵会，号叶光纪。 中央黄天，玄灵元老黄帝，姓通班，讳元成，号含枢纽。 五斗：东方：角、亢、氐、房、心、尾、箕。 南方：井、鬼、柳、星、张、翼、轸。 西方：奎、娄、胃、勖、毕、赀、参。 北方：斗、牛、女、虚、危、室、壁。 中央：贪狼、巨门、禄存、文曲、廉贞、武曲、破军。 五天魔王姓讳：青天魔王姓赋，讳齿成巴。 赤天魔王姓弗，讳由肃。 白天魔王姓赤，讳张市。 黑天魔王姓徐，讳直事。 黄天魔王姓天门，讳波狂。 五天魔王姓讳：青帝大魔姓迫落，讳万刑。 赤帝大魔姓赭，讳上柏。 白帝大魔姓邓，讳吁倪。 黑帝大魔姓枭，讳公孙。 黄帝大魔姓宛躬，讳产生。 五帝所主：青帝护魂，赤帝养炁， 白帝侍魄，黑帝通血，黄帝中主，主领万神。 五斗所主：东斗主算，南斗上生，西斗记名，北斗落死；",
      "translated_text": "**The Supreme Wondrous Scripture of the Numinous Treasure for Salvation of Humanity: The Comprehensive Diagram**\n\n**Scripture Title:** *The Supreme Wondrous Scripture of the Numinous Treasure for Salvation of Humanity: The Comprehensive Diagram*\nCompiled by Daoist Liu Yuandao of the late Northern Song dynasty. Originally in three scrolls, now only the middle and lower scrolls remain.\n**Source Text:** *Zhengtong Daoist Canon*, *Dongzhen* Section, *Lingtu* (Numinous Diagrams) Category.\n\n---\n\n**The Supreme Wondrous Scripture of the Numinous Treasure for Salvation of Humanity: The Comprehensive Diagram, Middle Scroll**\nCompiled by Liu Yuandao, Purple-Robed Daoist of the Taiqing Chuqing Abbey and Guardian of the One\n\n### **Thirty-Five Divisions: The Primordial Qi of the Upper Origin**\nThe Seven Stars of the Northern Dipper and the Twenty-Eight Constellations of the Four Directions together form the Thirty-Five Divisions. They govern the primordial *qi* of the Upper Heavens, presiding over creation and transformation.\n\nThe Northern Dipper is the Central Dipper. As stated in the *Records of the Grand Historian: Treatise on the Celestial Offices*: \"The Dipper is the Emperor’s chariot, revolving at the center and overseeing the four quarters. It divides yin and yang, establishes the four seasons, harmonizes the Five Phases, shifts the nodal measures, and determines all celestial reckonings—all pivot upon the Dipper.\" This diagram is drawn to observe the directional configurations. I have arranged the constellations to clarify this chapter, depicting the Thirty-Five Divisions of the Primordial *Qi* of the Upper Origin.\n\n### **The Thirty-Two Heavens: A Comprehensive Summary of Hidden Mysteries**\nFrom the Great Yellow Emperor’s *Huang* Heaven to the *Shangming* and Seven Luminaries’ *Moye* Six Heavens form the Desire Realm.\nFrom the *Xuwu Yueheng* Heaven to the *Wuji Tanshi* Eighteen Heavens form the Form Realm.\nFrom the *Haoting Xiaodu* Heaven to the *Taisu Xiule Jin* Four Heavens form the Formless Realm.\nThese constitute the Three Realms.\n\nFrom the *Taixu Wushang Changrong* Heaven to the *Taiji Pingyu Jiayi* Four Heavens are the Heavens of the Seed People.\n\nUpon examining this scripture, I have divided it into ten matters:\n1. **Heavenly Names** – The names established at the beginning of the kalpa.\n2. **Imperial Titles** – The titles bestowed by the Primordial Beginning.\n3. **Imperial Taboo Names** – The names of the Heavenly Emperors.\n4. **Heavenly Emperor’s Governance** – The office of the Eternal Dao.\n5. **Constellation Qi** – The *qi* descending in connection with the Twenty-Eight Constellations.\n6. **Qi Names** – The names of the primordial *qi* as received.\n7. **Qi Colors** – The colors of the primordial *qi* as divided by direction.\n8. **Great Brahma’s Hidden Speech** – Established internally, composed by the Dao Lord. The details are explained in the chapter on the origin of inner sounds in the lower scroll.\n9. **Divisional Boundaries** – The ascent and descent between upper and lower.\n10. **Lifespans of Heavenly People** – The measures of longevity and brevity.\n\nThis diagram is the essence of the precious scripture; those who recite and uphold it should study it in detail and practice accordingly. I have synthesized the commentaries of Chen Jingyuan, Xuan Ying’s *Subtle Exegesis*, Li Shaowei, Xue Youqi, and Yan Dong, along with the *Hunyuan Tu Yi* and *Kongdong Lingzhang Jing*, to establish this chapter.\n\n**Heavenly Names, Imperial Titles, Imperial Taboo Names, Heavenly Emperor’s Governance, Constellation Qi, Qi Names, Qi Colors, Great Brahma’s Hidden Speech, Divisional Boundaries, Lifespans of Heavenly People**\n\n### **Explanation of Constellation Qi**\nThe twenty-eight heavens of the cardinal directions each correspond to the *qi* of one constellation. The four heavens of the intercardinal directions each correspond to the *qi* between two constellations. Furthermore, the descending and intersecting *qi* cause the northeast heaven to also connect with the northwest constellation, for the generative *qi* ascends in a spiral like a ram’s horn. Though the profound principles are thoroughly understood, confusion may arise regarding the directions and intercardinal points; thus, this diagram is made to clarify them.\n\n### **Names and Taboo Names of the Five Directions’ Five Emperors and Their Governance**\nAccording to the scriptural meaning, the Five Heavens—endowed with the *qi* of the Five Spirits—reside in the midst of the Great Void. Above them are the Five Dippers, and below stand the Five Peaks, governed by the Five Emperors. These are the heavens of directional colors, not the heavens of formed images.\n\nThe names, taboo names, and governance of the Five Elders, Five Emperors, Five Dippers, Five Heavenly Demon Kings, and Five Great Demon Kings must be known by those who recite the scripture. I have synthesized the commentaries of Chen Jingyuan, Xuan Ying’s *Subtle Exegesis*, Li Shaowei, the *Shangshu Zhiyao Tu*, and the *Wupian Zhenwen Jing* to establish this chapter.\n\n**Names and Taboo Names of the Five Directions’ Five Emperors:**\n- **Eastern Azure Heaven**: Azure Numinous Beginning Elder, Azure Emperor, surname *Lan*, taboo name *Kaiming*, titled *Lingweiyang*.\n- **Southern Vermilion Heaven**: Cinnabar Numinous Perfected Elder, Vermilion Emperor, surname *Dongfu*, taboo name *Liuyan*, titled *Chibiaonu*.\n- **Western White Heaven**: Radiant Numinous August Elder, White Emperor, surname *Shangjin*, taboo name *Changkai*, titled *Baizhaoju*.\n- **Northern Black Heaven**: Dark Numinous Mystic Elder, Black Emperor, surname *Heijie*, taboo name *Linghui*, titled *Yeguangji*.\n- **Central Yellow Heaven**: Mysterious Numinous Primordial Elder, Yellow Emperor, surname *Tongban*, taboo name *Yuancheng*, titled *Hanshuniu*.\n\n**The Five Dippers:**\n- **East**: Horn, Neck, Root, Chamber, Heart, Tail, Winnower.\n- **South**: Well, Ghost, Willow, Star, Spread, Wings, Axletree.\n- **West**: Straddler, Bond, Stomach, Hairy Head, Net, Turtle Beak, Three Stars.\n- **North**: Dipper, Ox, Girl, Emptiness, Rooftop, Encampment, Wall.\n- **Center**: Greedy Wolf, Great Gate, Store of Fortune, Literary Brilliance, Integrity and Chastity, Martial Brilliance, Breaker of Armies.\n\n**Names and Taboo Names of the Five Heavenly Demon Kings:**\n- Azure Heaven Demon King: surname *Fu*, taboo name *Chichengba*.\n- Vermilion Heaven Demon King: surname *Fu*, taboo name *Yousu*.\n- White Heaven Demon King: surname *Chi*, taboo name *Zhangshi*.\n- Black Heaven Demon King: surname *Xu*, taboo name *Zhishi*.\n- Yellow Heaven Demon King: surname *Tianmen*, taboo name *Bokuang*.\n\n**Names and Taboo Names of the Five Great Demon Kings:**\n- Great Demon of the Azure Emperor: surname *Poluo*, taboo name *Wanxing*.\n- Great Demon of the Vermilion Emperor: surname *Zhe*, taboo name *Shangbai*.\n- Great Demon of the White Emperor: surname *Deng*, taboo name *Xuni*.\n- Great Demon of the Black Emperor: surname *Xiao*, taboo name *Gongsun*.\n- Great Demon of the Yellow Emperor: surname *Wangong*, taboo name *Chansheng*.\n\n**Governance of the Five Emperors:**\n- The Azure Emperor guards the *hun*.\n- The Vermilion Emperor nurtures the *qi*.\n- The White Emperor attends the *po*.\n- The Black Emperor circulates the blood.\n- The Yellow Emperor, as the Central Lord, governs all spirits.\n\n**Governance of the Five Dippers:**\n- The Eastern Dipper controls destiny.\n- The Southern Dipper bestows life.\n- The Western Dipper records names.\n- The Northern Dipper decrees death.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1263,
      "start_sentence": 0,
      "end_sentence": 74,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.17314171791077,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\无量度人上品妙经旁通图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "中斗大魁，总监众灵。 五天魔王所主：青天魔王巴元丑伯，赤天魔王负天担石，白天魔王反山六目，黑天魔王监丑朗馥，黄天魔王横天担力。 八数 八数者，应八之数，备之於此也。 愚以严东注合《法轮经》定此章。 八威：龙、麟、虎、豹、狮子、丹蛇、天马、猛兽。 八景：日、月、木德岁星、火德荧惑星、金德太白星、水德辰星、土德镇星、五斗诸星。 八冥：东极，东南极，南极，西南极，西极，西北极，北极，东北极。 八门：东天法轮之门，东南天法轮之门，南天法轮之门，西南天法轮之 门，西天法轮之门，西北天法轮之门，北天法轮之门，东北天法轮之门。 分经首尾 天尊说经二章，前后有序。 大梵隐语，前后亦有序。 皆道君所作也。 事具下卷《明宝经缄藏降世章》中，及《明内音所因》章中。 今则离其首尾，分其篇目，依藏本以定字数。 并题目，其四千五百七十四字，愚以陈景元义，合张万福诀，定此章。 篇目：太上道君二章、前序、元始天尊宝经前章、元始天尊宝经后章、太上道君二章后序、大梵隐语前序、大梵隐语后序。 经之首尾并字数：自道言昔於始青天中，至东向诵经，一千五百九十五字。 自元始洞玄灵宝本章，至三界五帝列言上清，一千二百七十八字。 自元洞玉历，至泄慢堕地狱祸及七祖翁，七百八十六字。 自道言此二章，至乃当洞明至言也，四百四十字。 自诸天中，至灵书中篇，十九字。 自亶娄阿荟，至幽寂度人，二百五十六字。 自道言此诸天中大梵隐语无量之音，至大量玄玄也，一百八十六字。 无量度人上品妙经旁通图卷中竟 无量度人上品妙经旁通图卷下 太清储庆宫守一大师赐紫道士刘元道编次 诵二章正经诀 凡遇诵经之日，於净室中东向设经案坐具，次入室，背席面东，三礼。 礼毕，退身面北就席坐。 炁定即渐渐左转，面东平坐。 咒曰： 寂寂至无宗，虚峙劫刃阿。 豁落洞玄文，谁测此幽遐。 一入大乘路，孰计年劫多。 不生亦不灭，欲生因莲花。 超凌三界途，慈心解世罗。 真人无上德，世世为仙家。 咒毕，即接手於膝上，叩齿三十二通。 闭目存三十二天，天中各见一帝君。 思念一天名，心拜一天帝。 从皇曾天为始，随日而转，周回四方，渐渐向上至贾奕天。 总三十二拜，形虽不动，随心屈伏。 拜毕，即思身在青、黄、白三色云炁之中，须央满室郁郁蔼蔼，左有青龙，右有白虎，前有朱雀，后有玄武。 狮子二八，在前两行相望而坐； 白鹤之数，亦同，又在狮子之外。 日在前，月在后，明耀室内，项生九色圆象，照彻诸天。 更览所存，森然在目。 默咒曰：",
      "translated_text": "The Central Dipper’s Great Chief oversees and monitors all spirits.\n\n**Governance of the Five Heavenly Demon Kings:**\n- The Azure Heavenly Demon King: *Bayuan Choubo*\n- The Vermilion Heavenly Demon King: *Futian Danshi* (Bearer of Heaven and Stone)\n- The White Heavenly Demon King: *Fanshan Liumu* (Six-Eyed Mountain-Reverser)\n- The Black Heavenly Demon King: *Jianchou Langfu*\n- The Yellow Heavenly Demon King: *Hengtian Danli* (Heaven-Bearer of Strength)\n\n**The Eight Numerals**\nThe eight numerals correspond to the number eight, here fully enumerated.\nI, following Yan Dongzhu, have harmonized this chapter with the *Dharma Wheel Sutra*.\n\n**The Eight Awes:**\nDragon, *qilin*, tiger, leopard, lion, cinnabar serpent, heavenly steed, and fierce beast.\n\n**The Eight Luminaries:**\nSun, moon, Jupiter (Wood Virtue), Mars (Fire Virtue), Venus (Metal Virtue), Mercury (Water Virtue), Saturn (Earth Virtue), and the stars of the Five Dippers.\n\n**The Eight Nether Extremes:**\nEastern Pole, Southeastern Pole, Southern Pole, Southwestern Pole, Western Pole, Northwestern Pole, Northern Pole, Northeastern Pole.\n\n**The Eight Gates:**\nEastern Gate of the Heavenly Dharma Wheel,\nSoutheastern Gate of the Heavenly Dharma Wheel,\nSouthern Gate of the Heavenly Dharma Wheel,\nSouthwestern Gate of the Heavenly Dharma Wheel,\nWestern Gate of the Heavenly Dharma Wheel,\nNorthwestern Gate of the Heavenly Dharma Wheel,\nNorthern Gate of the Heavenly Dharma Wheel,\nNortheastern Gate of the Heavenly Dharma Wheel.\n\n**Division of Scripture’s Beginning and End**\nThe Heavenly Worthy expounded two chapters of scripture, each with a preface and postface.\nThe *Great Brahma Hidden Speech* likewise has a preface and postface.\nAll were composed by the Dao Lord.\nThe details are recorded in the lower scroll’s *Chapter on the Descent of the Bright Treasure Scripture’s Sealed Treasury* and the *Chapter on the Causes of the Inner Sounds’ Manifestation*.\nHere, the beginning and end are separated, the sections divided, and the character count fixed according to the canon.\nIncluding the titles, the total is 4,574 characters. Following Chen Jingyuan’s exegesis and integrating Zhang Wanfu’s oral instructions, I have established this chapter.\n\n**Section Titles:**\n*Two Chapters of the Supreme Dao Lord*,\n*Preface*,\n*Former Chapter of the Heavenly Worthy of Primordial Beginning’s Treasure Scripture*,\n*Latter Chapter of the Heavenly Worthy of Primordial Beginning’s Treasure Scripture*,\n*Postface to the Two Chapters of the Supreme Dao Lord*,\n*Preface to the Great Brahma Hidden Speech*,\n*Postface to the Great Brahma Hidden Speech*.\n\n**Character Count of Scripture’s Beginning, End, and Sections:**\nFrom *The Dao spoke of old in the Primordial Azure Heaven* to *recite the scripture facing east*: 1,595 characters.\nFrom *The Primordial Beginning’s Cavernous Mystery Numinous Treasure Original Chapter* to *the Five Emperors of the Three Realms declare to Supreme Clarity*: 1,278 characters.\nFrom *The Primordial Cavern’s Jade Calendar* to *those who leak secrets fall into hell, their calamity extending to seven generations of ancestors*: 786 characters.\nFrom *The Dao spoke of these two chapters* to *thus shall the profound and ultimate words be thoroughly illuminated*: 440 characters.\nFrom *Among the heavens* to *the middle section of the Numinous Writ*: 19 characters.\nFrom *Danlou Ahui* to *deliver beings in the dark and tranquil*: 256 characters.\nFrom *The Dao spoke of these great Brahma hidden sounds among the heavens, the boundless tones* to *the boundless and mysterious, the mysterious and profound*: 186 characters.\n\n**End of the Middle Scroll of the *Illustrated Companion to the Wondrous Scripture of the Uppermost Numinous Treasure for the Limitless Deliverance of Beings***\n**Lower Scroll of the *Illustrated Companion to the Wondrous Scripture of the Uppermost Numinous Treasure for the Limitless Deliverance of Beings***\n\nCompiled by Liu Yuandao, Purple-Robed Daoist and *Guardian of Unity* at the Supreme Clarity Repository of Blessings Abbey\n\n**Oral Instructions for Reciting the Two Principal Scripture Chapters**\nOn days appointed for scripture recitation, within a purified chamber, set up an altar facing east with a scripture stand and seating. Enter the chamber, turn your back to the mat, and face east to perform the three bows.\nAfter bowing, withdraw and sit facing north upon the mat.\nOnce the *qi* settles, gradually turn left to sit facing east.\n\nRecite the incantation:\n*Silent, it reaches the ultimate source,*\n*Vastly erect, beyond kalpas’ blade, Ah.*\n*Profound and cavernous, the mysterious writ—*\n*Who fathoms this hidden distance?*\n*Entering the Great Vehicle’s path,*\n*Who reckons the kalpas’ span?*\n*Neither born nor extinguished,*\n*Yet born from the lotus’ cause.*\n*Transcending the Three Realms’ way,*\n*Compassionate heart unbinds the world’s net.*\n*Perfected One of supreme virtue,*\n*Generation upon generation, a family of immortals.*\n\nUpon completing the incantation, place your hands upon your knees and strike the teeth thirty-two times.\nClose your eyes and visualize the thirty-two heavens, each with its Emperor Lord.\nContemplate one heaven’s name and bow in your heart to its Heavenly Emperor.\nBeginning with *Huangceng Heaven*, follow the sun’s course, circling the four directions, gradually ascending to *Jiayi Heaven*.\nIn all, thirty-two bows—though the body remains still, the heart prostrates.\nAfter bowing, envision yourself enveloped in clouds of azure, yellow, and white *qi*, filling the chamber with dense, misty radiance.\nTo your left, the Azure Dragon; to your right, the White Tiger; before you, the Vermilion Bird; behind you, the Dark Warrior.\nSixteen lions sit in two rows facing one another; an equal number of white cranes stand beyond them.\nThe sun shines before you, the moon behind, illuminating the chamber. A nine-colored halo arises from your crown, shining through all heavens.\nSurveying all you have visualized, it stands vividly before your eyes.\n\nRecite silently the incantation:",
      "overlap_context": " Emperor: surname *Wangong*, taboo name *Chansheng*.\n\n**Governance of the Five Emperors:**\n- The Azure Emperor guards the *hun*.\n- The Vermilion Emperor nurtures the *qi*.\n- The White Emperor attends the *po*.\n- The Black Emperor circulates the blood.\n- The Yellow Emperor, as the Central Lord, governs all spirits.\n\n**Governance of the Five Dippers:**\n- The Eastern Dipper controls destiny.\n- The Southern Dipper bestows life.\n- The Western Dipper records names.\n- The Northern Dipper decrees death.",
      "start_char": 1263,
      "end_char": 2294,
      "start_sentence": 75,
      "end_sentence": 124,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.850666284561157,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\无量度人上品妙经旁通图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "无上玄元太上道君，召出臣身中三五功曹、左右官使者、侍香玉童、传言玉女、五帝直符、直日香官各三十二人，关启所言。 所言者，谓天地、日月、星宿、国主、师友、祖先、自身、兆民所祈之事。 咒至关启字下当称之也。 今日吉庆，长斋清堂，修行至经，无量度人。 臣及甲乙、甲乙当称所愿同上，即云臣及某人或某事。 转经受生，愿所启上彻，径御无上三十二天元始上帝至尊几前。 咒毕，徐徐於三十二天中之中，一天引炁一口咽之。 依前法。 止。",
      "translated_text": "The Most High Mysterious Primordial Supreme Dao Lord, summon forth from within this servant’s body the Three and Five Merit Officers, the Left and Right Attendants, the Jade Lads of Incense, the Jade Maidens of Transmission, the Direct Talismans of the Five Thearchs, and the Daily Incense Officials—thirty-two of each—opening the passage for the words to be spoken.\n\nThe words to be spoken are those supplications for Heaven and Earth, sun and moon, the stellar lodges, the sovereign, teachers and friends, ancestors, oneself, and the multitudes of the people. When the incantation reaches the phrase \"opening the passage,\" these are to be declared.\n\nToday is an auspicious and joyous occasion; the hall is pure, the fast unbroken, the scripture recited for the boundless salvation of beings. This servant, together with [name or \"so-and-so\"], [name or \"such-and-such matter\"]—here state the same aspiration as above—prays that the petition ascend directly to the presence of the Most August Primordial Celestial Venerable of the Thirty-Two Heavens.\n\nUpon completing the incantation, slowly draw in one breath of *qi* from each of the Thirty-Two Heavens, swallowing it in turn. Proceed as before. Cease.",
      "overlap_context": "th dense, misty radiance.\nTo your left, the Azure Dragon; to your right, the White Tiger; before you, the Vermilion Bird; behind you, the Dark Warrior.\nSixteen lions sit in two rows facing one another; an equal number of white cranes stand beyond them.\nThe sun shines before you, the moon behind, illuminating the chamber. A nine-colored halo arises from your crown, shining through all heavens.\nSurveying all you have visualized, it stands vividly before your eyes.\n\nRecite silently the incantation:",
      "start_char": 2294,
      "end_char": 2499,
      "start_sentence": 125,
      "end_sentence": 133,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.875961542129517,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\无量度人上品妙经旁通图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "则开目诵二章。 诵经毕，南向下席，再礼而退。 愚以陈景元义，合张万福诀，定此章。 静室图 大药如此，明室内之事，不必面南启户也。 诵内音诀 诵东方六十四字。 自亶娄阿荟，至四象吁员。 平坐叩齿九通，思九色之龙导引前后，青云九重，覆匝身形。 默咒曰： 赤明开图，八炁回真。 总统玄门，青帝大神。 流化九外，缠绵我身。 灵音八书，六十四篇。 洞明天地，与我合仙。 运致龙驾，上升帝辕。 毕，引炁九咽，诵之。 诵南方六十四字。 自南阎洞浮，至神缨自宫。 平坐叩齿三通，思朱凤翱翔其前，绛云三重覆匝身形。 默咒曰： 三炁徘徊，灵凤来飞。 玉音八字，烂焕紫微。 吉日大庆，我道洞开。 朱丹哺饴，仰吸灵晖。 身生水火，绛被羽衣。 登空玄步，足践凤梯。 周旋八天，七祖相随。 毕，引气三咽，诵之。 诵西方六十四字。 自刀利挥猷，至柏空度仙。 平坐，叩齿七通，思白虎、狮子卫护前后，素云七重，覆匝身形。 默咒曰： 七炁金灵，八天尊神。 白虎策辇，狮子捧辕。 七炁缠绵，炼我成仙。 身登金光，映照素云。 内外变化，升入洞门。 七祖出夜，九幽旋魂。 亿劫开度，随运长存。 毕，引炁七咽，诵之。 诵北方六十四字。 自玃无自育，至幽寂度人。 平坐，叩齿五通，思飞龙、玄武，羽盖蓊郁； 神童玉女，羽衣飞裳。 黑云五重，覆匝身形。 默咒曰： 玄天徘徊，流景上清。 大有启运，八字高明。 飞玄澄空，洞阴自生。 五炁缠绵，灌我身形。 冠带北单，受炼洞灵。 肾府北出，内外光精。 飞行三界，游宴紫庭。 七祖同福，欢乐劫龄。 七宝林中，返胎更生。 长夜出离，南宫记名。 黄箓白简，世世生仙。 毕，引炁五咽，诵之。 诵二章正经验 正月长齐，诵咏是经，为上世亡魂断地逮役，度上南宫。 七月长齐，诵咏是经，身得神仙，诸天书名。 黄箓白简，削死上生。 十月长齐，诵咏是经，为国王帝主，君臣父子，安镇国祚，保天长存。 世世不绝，长为人君。 安镇其方，民称太平。 八节之日诵咏是经，得为九宫真人； 本命之日诵咏是经，魂神澄正，万炁长存，不经苦恼，身有光明。 三界侍卫，五帝司迎，万神朝礼，名书上天。 功满德就，飞升上清。 诵之十遍，诸天记功； 诵之百遍，名度南宫； 诵之千遍，魔王保迎； 诵之万遍，道既备矣，飞升太空。 若能遇斯辰，依诀持诵，上消天灾，保镇帝王，下禳毒害，以度兆民； 中拔祖先，己身得道。 可谓巍巍大梵，独步玉京者矣。 诵内音验 东方大梵之音，诵之九年，八天各以青腰玉女、青华玉童各八人，侍卫身形，降致青牙之精，身生光明，彻见虚无。 万遍道成，飞行上清，七祖同福，皆升南宫也。 南方大梵之音，诵之三年，八天各以太丹玉女、太阳玉童各八人，侍卫身形，降致朱丹三炁之精，返白留容。 万劫不倾，七祖超升，上入福堂，返胎仙家，即得更生也。 西方大梵之音，诵之七年，八天各以素灵玉童八人侍卫身形，降致太素七炁之精，停年留貌，万劫童颜。 庆及七祖，升度南宫，返胎更生，世世神仙。 北方大梵之音，诵之五年，八天各以太元玉童八人侍卫身形，降致元滋五炁之精，还年留景，保命三清，福及九玄，世世飞升。 四方内音若能依诀持诵，无所不辟，无所不禳，无所不度，无所不成。",
      "translated_text": "Then open the eyes and recite the two chapters. Upon completing the recitation, face south and descend from the mat, bowing twice before withdrawing.\n\nFollowing the interpretations of Chen Jingyuan and the methods of Zhang Wanfu, these chapters are established.\n\n**Quiet Chamber Diagram**\nThe Great Elixir is thus; the affairs within the illuminated chamber need not face south to open the door.\n\n**Recitation of the Inner Sounds Formula**\n\nRecite the sixty-four characters of the East:\nFrom *\"Danlou Ahui\"* to *\"Four Images Xuyuan.\"*\nSit upright, click the teeth nine times, and visualize nine-colored dragons guiding before and behind, with nine layers of azure clouds enveloping the body.\n\nSilently intone the incantation:\n*\"Vermilion brightness unfolds the diagram, eight qi return to the true.\nGoverning the Mysterious Gate, Great Azure Deity.\nFlowing transformation beyond the nine, entwining my body.\nSacred sounds of eight writings, sixty-four chapters.\nPenetrating Heaven and Earth, uniting with me as immortal.\nSummoning the dragon chariot, ascending to the imperial axis.\"*\n\nConclude, draw in *qi* nine times and swallow it, then recite.\n\nRecite the sixty-four characters of the South:\nFrom *\"Nanyan Dongfu\"* to *\"Divine tassels from the palace.\"*\nSit upright, click the teeth three times, and visualize a vermilion phoenix soaring before you, with three layers of crimson clouds enveloping the body.\n\nSilently intone the incantation:\n*\"Three qi linger, the sacred phoenix arrives in flight.\nJade sounds of eight characters, resplendent in the Purple Tenuity.\nAuspicious day, great celebration—my Dao opens wide.\nCrimson cinnabar as sweet nectar, I gaze upward to absorb the sacred radiance.\nBody born of water and fire, clad in crimson feathered robes.\nAscending the void with mystic steps, feet treading the phoenix ladder.\nCircling the eight heavens, seven ancestors follow.\nConclude, draw in *qi* three times and swallow it, then recite.\"*\n\nRecite the sixty-four characters of the West:\nFrom *\"Daoli Huiyou\"* to *\"Cypress Void Transcendent.\"*\nSit upright, click the teeth seven times, and visualize the White Tiger and lions guarding before and behind, with seven layers of white clouds enveloping the body.\n\nSilently intone the incantation:\n*\"Seven qi of golden numen, honored deities of the eight heavens.\nWhite Tiger steers the chariot, lions bear the shaft.\nSeven qi entwine, refining me into an immortal.\nBody ascends in golden light, illuminating the white clouds.\nInner and outer transformations, rising into the cavernous gate.\nSeven ancestors escape the night, nine dark realms revolve their souls.\nEons of deliverance, enduring with the turning of fate.\"*\n\nConclude, draw in *qi* seven times and swallow it, then recite.\n\nRecite the sixty-four characters of the North:\nFrom *\"Juewu Ziyu\"* to *\"Secluded Tranquility Delivers Beings.\"*\nSit upright, click the teeth five times, and visualize flying dragons and the Dark Warrior, their feathered canopies lush; divine youths and jade maidens in feathered robes and flying garments. Five layers of black clouds envelop the body.\n\nSilently intone the incantation:\n*\"Mysterious Heaven lingers, flowing radiance ascends to the Upper Clarity.\nGreat Possession initiates the turning, eight characters exalted in brightness.\nFlying darkness stills the void, the hidden yin spontaneously generates.\nFive qi entwine, irrigating my form.\nCrowned and girded in the Northern Loneliness, receiving refinement in the cavernous numen.\nKidney palace emerges from the north, inner and outer luminous essence.\nSoaring through the Three Realms, roaming and feasting in the Purple Court.\nSeven ancestors share fortune, rejoicing in kalpas of age.\nWithin the Forest of Seven Treasures, reborn in a returned womb.\nEmerging from eternal night, names recorded in the Southern Palace.\nYellow Registers and White Tallies—lifetimes of immortals.\"*\n\nConclude, draw in *qi* five times and swallow it, then recite.\n\n**Verification of Reciting the Two Chapters of the Orthodox Scripture**\n\nDuring the long fast of the first month, recite and chant this scripture to sever the earthly bonds of ancestral spirits, delivering them to the Southern Palace.\n\nDuring the long fast of the seventh month, recite and chant this scripture to attain divine transcendence, with names inscribed in the heavens.\n\nYellow Registers and White Tallies erase death and grant rebirth.\n\nDuring the long fast of the tenth month, recite and chant this scripture for the emperor and sovereign, ruler and ministers, father and son, to stabilize the nation’s destiny and preserve Heaven’s enduring existence. Dynasties shall never cease, perpetually ruling as sovereigns. Stabilizing their realm, the people shall praise great peace.\n\nOn the eight seasonal nodes, recite and chant this scripture to become a Perfected of the Nine Palaces. On one’s natal day, recite and chant this scripture to purify the soul and spirit, preserving the myriad *qi* eternally, avoiding suffering, and radiating light from the body. Guarded by the Three Realms, welcomed by the Five Emperors, myriad deities pay homage, and names are inscribed in the heavens above. With merits fulfilled and virtue perfected, ascend to the Upper Clarity.\n\nRecite ten times, and the heavens record the merit; recite a hundred times, and names are delivered to the Southern Palace; recite a thousand times, and demon kings provide escort; recite ten thousand times, and the Dao is complete—ascend to the Great Void.\n\nIf one encounters such an occasion and adheres to the formula in recitation, above it dispels celestial disasters and safeguards the emperor; below it wards off poison and harm to deliver the multitudes; in the middle, it liberates ancestors and grants oneself the Dao. This may be called the majestic and vast Great Brahma, the unparalleled one who strides the Jade Capital.\n\n**Verification of Reciting the Inner Sounds**\n\nThe Great Brahma sounds of the East: recite for nine years, and the eight heavens each send eight Azure-Waisted Jade Maidens and Azure-Flora Jade Lads to attend and guard the body, descending the essence of Azure Teeth. The body radiates light, perceiving the formless. After ten thousand recitations, the Dao is achieved—soaring to the Upper Clarity, seven ancestors share fortune, all ascending to the Southern Palace.\n\nThe Great Brahma sounds of the South: recite for three years, and the eight heavens each send eight Great Cinnabar Jade Maidens and Great Yang Jade Lads to attend and guard the body, descending the essence of the three crimson *qi*. White returns to the complexion, enduring for ten thousand kalpas. Seven ancestors transcend and ascend, entering the Hall of Fortune, reborn in the immortal lineage—thus attaining renewal.\n\nThe Great Brahma sounds of the West: recite for seven years, and the eight heavens each send eight Luminous Jade Lads to attend and guard the body, descending the essence of the seven primordial *qi*. Age halts, countenance preserved—youthful for ten thousand kalpas. Blessings extend to seven ancestors, ascending and delivered to the Southern Palace, reborn in renewal, lifetimes of immortals.\n\nThe Great Brahma sounds of the North: recite for five years, and the eight heavens each send eight Great Primordial Jade Lads to attend and guard the body, descending the essence of the five nourishing *qi*. Years return, radiance preserved—lifespan secured in the Three Clarities. Fortune extends to the nine lineages, lifetimes of ascension.\n\nIf one adheres to the formula in reciting the inner sounds of the four directions, there is nothing that cannot be averted, nothing that cannot be warded, nothing that cannot be delivered, nothing that cannot be accomplished.",
      "overlap_context": " is pure, the fast unbroken, the scripture recited for the boundless salvation of beings. This servant, together with [name or \"so-and-so\"], [name or \"such-and-such matter\"]—here state the same aspiration as above—prays that the petition ascend directly to the presence of the Most August Primordial Celestial Venerable of the Thirty-Two Heavens.\n\nUpon completing the incantation, slowly draw in one breath of *qi* from each of the Thirty-Two Heavens, swallowing it in turn. Proceed as before. Cease.",
      "start_char": 2499,
      "end_char": 3788,
      "start_sentence": 134,
      "end_sentence": 219,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.801581144332886,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\无量度人上品妙经旁通图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "飞天下观，上帝遥唱，万神朝礼，三界侍轩。 振伏群灵，肃清十方，道备功成，臣事三境矣。 愚以张万福诀此定章。 明宝经缄藏降世 天尊於始青天中敷说此经，以授道君。 又於太丹天中赐大梵之音。 道君序成之后，上天为宝，秘於玄都玉京紫微上宫。 缄藏至重，非圣不传。 后西王母上请於天帝降保甲申之灾，以付修真之士，因此遂流於人间。 此经并是诸天上帝及至灵魔王隐秘歌音，内说天地劫运，万神名讳，交会阴阳，元炁生化，其义不可得而尽通，其理不可得而尽解。 得悟道者，自能洞明。 上天四万劫一传，人间四十年一授。 轻泄漏慢，殃及九祖，长役幽阴，可不慎欤，可不慎欤！ 愚以李少微注定此章。 明内音所因 天尊於赤明世界栢陵舍座，是时云雾郁勃，三日三夜，冥阴不解。 五老上帝上奏天尊曰：今日侍座，所未曾见。 天尊敷教，则致山海静默，天地肃清。 今白日阴暝，天人惶惧，臣等有疑，不审何故？ 天尊告曰：今日诸天发瑞，灵应自然，玉字焕烂，障蔽生光。 咸令四座暝目以俟。 俄顷，天炁顿启，冥暗豁消，五色光明洞照十方。 各有灵书，字方一丈，现於空虚之中。 文彩焕赫，八角垂芒，精光晃目，不可得看。 天尊普告众灵曰：此灵书八会，字无正形，其趣宛奥，尔等难可寻详。 乃命天真皇人注书其字解释其音，以赐道君，总二百五十六字。 道君撰次成文。 是谓大梵隐语。 因序而附二章之后。 皇人者，尝於黄帝时下降峨媚山，授帝以三一五牙之法，复升於天也。 愚以《内音经》，合《列仙传》定此章。 引证 太上玉京山经",
      "translated_text": "The Flying Celestials descend in observation, the Supreme Emperor chants from afar, myriad spirits pay homage in reverence, and the Three Realms attend in solemn procession. Subduing the host of spirits, purifying the ten directions, the Dao perfected and merits accomplished—one serves as minister to the Three Bounds.\n\nI, in my foolishness, have arranged this fixed chapter of the *Zhang Wanfu Jue*.\n\n**The Precious Scripture Sealed and Bestowed Upon the World**\nThe Heavenly Worthy, in the Azure Prime of Heaven, expounded this scripture and conferred it upon the Dao Lord. Later, in the Great Cinnabar Heaven, he bestowed the Great Brahma Sounds. After the Dao Lord had compiled and ordered it, the heavens treasured it as a sacred relic, secreting it within the Purple Tenuity Palace of the Jade Capital in the Mysterious Metropolis. Its sealing and concealment are of the utmost gravity—none but the sagely may transmit it. Later, the Queen Mother of the West petitioned the Heavenly Emperor to descend it for averting the calamity of the *jiashen* year, entrusting it to the adepts of perfected truth, whence it thereafter circulated among mortals.\n\nThis scripture comprises the hidden hymns of the Celestial Emperors of all heavens and the arcane chants of the Demon Kings. Within it are expounded the kalpic destinies of heaven and earth, the names and titles of the myriad spirits, the intercourse of *yin* and *yang*, and the generation and transformation of primordial *qi*. Its meanings cannot be fully fathomed, nor its principles fully unraveled. Those who attain enlightenment in the Dao shall naturally achieve profound clarity.\n\nIn the heavens, it is transmitted but once every forty thousand kalpas; among mortals, but once every forty years. To leak or profane it lightly brings misfortune upon nine generations, condemning them to eternal servitude in the dark nether realms. How can one not be cautious? How can one not be cautious?\n\nI, Li Shaowei, in my foolishness, have annotated and fixed this chapter.\n\n**The Origin of the Inner Sounds**\nThe Heavenly Worthy, seated in the Cypress Mound of the Vermilion Radiance World, was enveloped in dense clouds and mist for three days and nights, the gloom unrelieved. The Five Elder Thearchs addressed the Heavenly Worthy, saying: \"Such has never been seen in our attendance today.\" When the Heavenly Worthy expounds the teachings, mountains and seas fall silent, and heaven and earth grow solemn and clear. Yet now, in broad daylight, darkness prevails, and the celestial and mortal realms are filled with dread. We, your ministers, are perplexed and know not the cause.\n\nThe Heavenly Worthy replied: \"Today, the manifold heavens have manifested auspicious signs, and numinous responses arise spontaneously. Jade characters blaze with brilliance, obscuring the light of life. Let all present close their eyes and await the revelation.\" In an instant, the celestial *qi* surged forth, the gloom dissolved, and five-colored radiance illuminated the ten directions. Each bore a spirit-script, its characters a *zhang* in breadth, manifesting in the void. Their splendor dazzled, eight-cornered rays trailing, their luminous essence so blinding they could not be gazed upon directly.\n\nThe Heavenly Worthy proclaimed to the assembled spirits: \"This is the *Lingshu Bahui*, its characters devoid of fixed form, its purport profound and recondite—difficult for you to fathom in detail.\" Thereupon, he commanded the Heavenly Perfected Sovereign to transcribe the characters and elucidate their sounds, bestowing them upon the Dao Lord, totaling two hundred fifty-six characters. The Dao Lord arranged and composed them into text, calling it the *Great Brahma Hidden Speech*. It was appended to the two preceding chapters in sequence.\n\nThe Sovereign was one who, in the time of the Yellow Emperor, descended upon Mount Emei to confer upon him the method of the Three Ones and Five Sprouts, later ascending to heaven.\n\nI, in my foolishness, have collated the *Inner Sounds Scripture* with the *Biographies of the Immortals* to fix this chapter.\n\n**Citations**\n*The Scripture of the Jade Capital Mountain of the Most High*",
      "overlap_context": "ight heavens each send eight Great Primordial Jade Lads to attend and guard the body, descending the essence of the five nourishing *qi*. Years return, radiance preserved—lifespan secured in the Three Clarities. Fortune extends to the nine lineages, lifetimes of ascension.\n\nIf one adheres to the formula in reciting the inner sounds of the four directions, there is nothing that cannot be averted, nothing that cannot be warded, nothing that cannot be delivered, nothing that cannot be accomplished.",
      "start_char": 3788,
      "end_char": 4403,
      "start_sentence": 220,
      "end_sentence": 252,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.638243675231934,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\无量度人上品妙经旁通图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "灵宝赤书五篇真文经 九天生神章经 太上开天龙蹻经 空洞灵章经 诸天内音自然玉字经 青童内文经 真一劝戒法轮妙经 太上三元品戒经 天宝金鉴灵枢经 太真科 司马迁史记天官书 消灾忏 刘向列仙传 杜光庭混元图 北斗圣位傍通图 张宋臣列宿图 舒禀尚书治要图 陈景元普天圣位图 李思聪洞渊集 张万福灵宝经诀 重修灵宝经诀 严东灵宝经注 薛幽栖灵宝经注 李少微灵宝经注 成玄英度人经疏 陈景元宝珠妙义 无量度人上品妙经旁通图卷下",
      "translated_text": "*The Scripture of the Five Chapters of the Vermilion Writ of Numinous Treasure*\n*The Scripture of the Nine Heavens’ Engendering of the Divine*\n*The Most High’s Scripture of the Dragon-Steed Opening Heaven*\n*The Scripture of the Cavernous Numinous Chapters*\n*The Scripture of the Jade Characters of the Inner Sounds of the Myriad Heavens*\n*The Scripture of the Inner Writ of the Azure Lad*\n*The Wondrous Scripture of the Dharma-Wheel of Admonitions of the True One*\n*The Most High’s Scripture of the Three Primes’ Precepts*\n*The Scripture of the Golden Mirror and Numinous Pivot of Heavenly Treasure*\n*The Regulations of the Perfected*\n*Sima Qian’s* Records of the Grand Historian: *Treatise on the Celestial Offices*\n*The Repentance for Dissolving Calamities*\n*Liu Xiang’s* Biographies of the Immortals\n*Du Guangting’s* Diagram of the Primordial Origin\n*The Diagram of the Adjacent Connections of the Sacred Stations of the Northern Dipper*\n*Zhang Songchen’s* Diagram of the Arrayed Lodgings\n*Shu Bing’s* Essential Diagrams from the *Governance of the Book of Documents*\n*Chen Jingyuan’s* Diagram of the Sacred Stations of All Under Heaven\n*Li Sicong’s* *Anthology of the Cavernous Abyss*\n*Zhang Wanfu’s* Oral Instructions on the *Scriptures of Numinous Treasure*\n*The Revised Oral Instructions on the* Scriptures of Numinous Treasure\n*Yan Dong’s* Commentary on the *Scriptures of Numinous Treasure*\n*Xue Youqi’s* Commentary on the *Scriptures of Numinous Treasure*\n*Li Shaowei’s* Commentary on the *Scriptures of Numinous Treasure*\n*Cheng Xuanying’s* Subcommentary on the *Scripture of Salvation*\n*Chen Jingyuan’s* *Subtle Meaning of the Precious Pearl*\n*The Lower Scroll of the Diagram of Adjacent Connections to the* Wondrous Scripture of the Supreme Prime of Salvation for the Boundless",
      "overlap_context": "into text, calling it the *Great Brahma Hidden Speech*. It was appended to the two preceding chapters in sequence.\n\nThe Sovereign was one who, in the time of the Yellow Emperor, descended upon Mount Emei to confer upon him the method of the Three Ones and Five Sprouts, later ascending to heaven.\n\nI, in my foolishness, have collated the *Inner Sounds Scripture* with the *Biographies of the Immortals* to fix this chapter.\n\n**Citations**\n*The Scripture of the Jade Capital Mountain of the Most High*",
      "start_char": 4403,
      "end_char": 4666,
      "start_sentence": 253,
      "end_sentence": 279,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.055592775344849,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\无量度人上品妙经旁通图.txt",
        "category": "灵图类"
      }
    }
  ]
}