{
  "source_id": "析疑指迷论",
  "source_file": "chunked_daozang\\析疑指迷论.json",
  "total_chunks": 9,
  "total_original_chars": 6816,
  "total_translated_chars": 36719,
  "total_translation_time": 175.77353739738464,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\众术类\\析疑指迷论.txt",
    "category": "众术类"
  },
  "full_translation": "**Disquisition on Resolving Doubts and Guiding the Lost**\n\n**Sutra Title:** *Disquisition on Resolving Doubts and Guiding the Lost*\nComposed by Master Shenfeng Xiaoyao, Niu Daochun of the Yuan dynasty. One fascicle.\nSource of the base text: *Daoist Canon of the Zhengtong Era*, \"Comprehensive Arts\" section of the *Dongzhen* Department.\n\n**Preface to the *Disquisition on Resolving Doubts and Guiding the Lost***\n\nMaster Shenfeng Xiaoyao presented two profound treatises, entitled *Disquisition on Resolving Doubts and Guiding the Lost*. In them, his pure discourse flows freely from the heart, and abstruse mysteries are expounded through brush and ink—here, the cultivation of his entire life is revealed. By the good fortune of a single reading, I was left standing alone in the thoroughfare, so utterly absorbed that I forgot the very existence of my limbs. Thus may it serve as a ladder and ferry for later learners to scale the walls and moats of the Mysterious Gate.\n\nRespectfully inscribed by Liu Daozhen of Runan, Master of Double Mystery, on the first day of the second lunar month in the *wuxu* year of the Dade era.\n\nThe fire passes from prior flame to later flame; though the kindling differs, the blaze is the same. The sagely successors of today follow the ancient sages; though the times change, the Dao remains one. Thus it is fitting that since the days of Ma, Tan, Liu, and Qiu, true persons who propagate the subtle wind and spread the wondrous transformation have emerged in unbroken succession.\n\nMaster Shenfeng Xiaoyao, the Perfected Lord Niu, has newly produced two volumes of extraordinary discourse, titled *Disquisition on Resolving Doubts and Guiding the Lost*. He entrusted me with composing an introductory text, and upon reading it once, I forgot both self and world, as if riding a pure breeze through the azure vault. In guiding others, his method is measured and orderly, never disordered, dissolving the confusions of the mind and bringing clarity. In advancing others, a single utterance of his solemn words sets them forth on a boundless journey, never to linger.\n\nIts words are concise, its principles subtle; its instruction profound, its intent earnest—this may truly be called the transmission of the flame and the succession of the sagely. Fearing that these subtle teachings might fade into obscurity, his disciples have gathered and recorded them to aid those who come after. Such is the magnanimity of a master’s Way, and this too may be called the depth of devoted care.\n\nWritten on the third day before the Mid-Autumn Festival in the third year of the Dade era by Wang Daoheng, the Recluse of Serene Emptiness.\n\nThe Master of Carefree Wandering, in leisurely seclusion within his quiet chamber, sat alone by the window, leaning against his desk in forgetfulness. Just then, Wu Zhenzi Li Zhiheng rose from his seat, respectfully stood, and with paper in hand, bowed and said: \"Dare I ask of the wondrous principles of the Perfect Realization, the subtleties of the supreme Dao, the meaning of nature and destiny, and the sequence of cultivation? I wish for the Master to expound and resolve these doubts.\"\n\nThe Master of Carefree Wandering replied: \"The supreme Dao is subtle indeed—formless and nameless, difficult to expound, difficult to speak of, and not something that can be grasped through acceptance or rejection. Thus the mind is confounded and cannot know it; the mouth opens yet cannot express it. It lies in the empty treasury of the self to be realized. Yet as you persist in inquiry and your resolve grows ever more sincere, I cannot but respond to your request.\"\n\nThereupon, he set forth this discourse, titled *Disquisition on Resolving Doubts and Guiding the Lost*, in the hope that it might serve as a gradual awakening for beginners.\n\nComposed on the Lantern Festival of the second year of the Yuanzhen era.\n\n*Disquisition on Resolving Doubts and Guiding the Lost*\n\n*Resolving Doubts*\n\nShould one ask, \"What is *quanzhen* (Perfect Realization)?\" I would reply: It is that which precedes the arising of even a single thought within you. Before a single thought stirs, it is equal to the Great Void—seen yet without color, heard yet without sound, grasped yet without form. Above, it has no covering; below, no base; at its sides, no gate; at its center, no substance. Vast, it has no exterior; minute, it has no interior. Dim and unfathomable, elusive and obscure, it is not a thing to be embodied, yet in function it is never absent. Concealing the boundless, it harbors the subtlest in abundance. Still and unmoving, it responds when stimulated and pervades all. It embraces the ten thousand images yet clings not to a single thread. I know not its name, so I style it *quanzhen*. The Buddhist teachings call it *perfect enlightenment* or *perfect emptiness*; the Most High speaks of it as *the undifferentiated* or *perfect penetration*. Thus the *Nanhua Sutra* says: \"That which has never yet given rise to things—this is the ultimate, the exhaustive, beyond which nothing can be added.\" This is what is meant.\n\nShould one ask, \"What are *mind* and *nature*?\" I would reply: The relationship of mind and nature is like that of waves and water. Water is fundamentally pure, but when stirred by sensation, waves arise and wind-driven waves muddy it so that it cannot reflect principles. When the wind and waves subside, the water clears and the waves cease. Thus, water is waves, and waves are water. By this analogy, mind is the function of nature, and nature is the substance of mind. When both substance and function are forgotten, there is only *quanzhen*.\n\nShould one ask, \"What are *nature* and *life*?\" I would reply: The principle of nature and life is but another name for the interplay of *yin-yang* and *spirit-qi*. The terms *spirit* and *qi* are invoked endlessly, so let me briefly outline their general meaning. They may be called *movement and stillness*, *dragon and tiger*, *water and fire*, *Kan and Li*, *east and west*, *south and north*, *spring and autumn*, *warmth and coolness*, *winter and summer*, *cold and heat*, *adversity and prosperity*, *rise and fall*, *ascent and descent*, *coming and going*, *being and non-being*, *void and full*, *above and below*, *floating and sinking*, *high and low*, *deep and shallow*, *metal and wood*, *firm and yielding*, *heaven and earth*, *sun and moon*, *Zhen and Dui*, *dusk and dawn*, *husband and wife*, *infant and maiden*, *Golden Elder and Yellow Dame*, *crimson snow and dark frost*, *purple sprout and red powder*, *true lead and true mercury*. Other names and designations are innumerable, and all such forms and appearances must not be clung to—they are but *spirit* and *qi* in sum. To fully nurture spirit and cultivate qi, one must clarify substance and function, host and guest, banish all entanglements, remain unstained by even a speck of dust, and maintain purity within and without. Through long and sincere practice, qi will coalesce and spirit congeal, nature will settle and life abide. When nature and life are both preserved, qi and spirit become one, and that oneness merges with the Dao. Then the work of cultivation is complete.\n\nShould one ask, \"What are *substance and function, host and guest*?\" I would reply: If one seeks to cultivate the Real, one must first understand what is meant by *substance and function, host and guest*. Without clarity on substance and function, the passions and desires cannot be dispelled. Without discerning yin-yang and the roles of host and guest, one cannot unite with the supreme spirit of emptiness and non-being. What, then, are *substance and function*? Emptiness and stillness are the substance; awareness and illumination are the function. When substance and function are both complete, they merge with the origin of the Dao. And what are *host and guest*? The preceding thought is the guest; the succeeding thought is the host. When a thought arises, do not cling to it, for it has no root or origin. Thus Master Dongming said: \"When a thought arises, awaken and let it rest.\" This single phrase encompasses both substance and function, host and guest. What does it mean to *encompass* them? The arising thought is the guest; awareness is the host. The host’s rectitude is the function; rest is the substance. Thus, substance is function, and function is substance. When both substance and function dissolve, there is only *quanzhen*.\n\nShould one ask, \"Many speak of *transmitting the foundation of life*—what does this mean?\" I would reply: *Life* is qi; *foundation* is origin. The origin of the single qi is the Dao. The Dao is formless and nameless, not something that can be grasped through acceptance or rejection. If it cannot be accepted or rejected, how can it be transmitted? Thus Master Guanyin said: \"The sage cannot go beyond the Dao to reveal it to others.\" And Master Liezi said: \"That which is so without knowing why it is so is called *life*.\" This is what is meant.\n\nShould one ask, \"The patriarchs speak of *where the five phases do not reach, before the single qi arises*—what does this mean?\" I would reply: The *five phases* are our five senses; the *single qi* is but a single thought within you. Where the five senses do not stir and before a single thought arises—that is the same as the earlier meaning of *that which has never yet given rise to things*. Since it has never yet given rise to things, it is forcibly named the Dao.\n\nShould one ask, \"If *that which has never yet given rise to things* is called the Dao, then once things exist, is the Dao present within them?\" I would reply: Things arise from the Dao, so things *are* the Dao—just as mind arises from nature, so mind *is* nature. Or as waves arise from water, so waves *are* water. Thus Master Dongming said: \"The master transmits secret words, the mind awakens; the family style beyond things is cultivated within things.\" And Master Guanyin said: \"The principles of heaven and earth are contained within a single thing.\" And again: \"Within a single thing, one may know heaven and exhaust spirit, align with life and enter the mysterious.\" If this is so for things, how could it not be so for humans? The Most High also said: \"There is a thing, undifferentiated, born before heaven and earth. Silent and empty, it stands alone and does not change; it circulates without cease and may be called the Mother of all under heaven. I know not its name, so I style it the Dao.\" This is precisely what is meant.\n\nSomeone asked: \"Qinghe the Perfected once said: 'To stop thoughts and subdue the mind—yet the more you subdue, the more thoughts arise; if you neither subdue nor stop, you drift with the waves and follow the current.' What does this mean?\"\n\nI replied: \"For those who first embark on the Dao, they must first awaken to their true mind. This true mind is originally without a single thing, equal to the great emptiness, inherently pure. Within this purity, if a single thought suddenly arises, one must instantly turn the light inward, return to the root and revert to the origin—then clarity and purity will naturally abide. Thus the scripture says: 'When the mind is settled, the spirit becomes clear of itself; naturally, the six desires do not arise, and the three poisons vanish.' Once the three poisons are extinguished, one merges with the Dao. If one does not understand this principle, when a thought arises, one generates another thought to suppress it; if suppression fails, one uses the mind to dispel it. Yet suppression and dispelling never cease, and one becomes further entangled. If one does not suppress or dispel, indulging in delusion, one drifts ever further from alignment. Thus, if one constantly knows and constantly awakens, one grasps at oneself; if one neither knows nor awakens, one slips into another shell—just like being reborn. Only when one’s karmic retribution is exhausted does one return, weary as a spent horse and exhausted traveler, yet still failing to awaken. Is this not lamentable?\"\n\nSomeone asked: \"How can one attain perfect communion with the myriad dharmas?\"\n\nI replied: \"Those who cultivate the Dao must first clarify the mind and awaken to their nature, then sever all doubts before they can nurture the Dao. The mind is the source of the myriad dharmas, and nature is the essence of all scriptures. Thus, when the mind arises, the myriad dharmas arise; when the mind ceases, the myriad dharmas cease. If not a single thought arises, one transcends birth and death. In this state of thoughtlessness, one sees one’s original face. With long and deep cultivation, roundness, luminosity, and vastness grow—then no dharma is unpenetrated, no scripture is ungrasped. This is called the perfection of the Dharma-eye. All the vast scriptures of the canon merely expound these principles. What the sages and worthies of past and present attained, they attained this alone. What the past masters and perfected ones taught, they taught this alone. What the Five Patriarchs and Seven Perfected Ones realized, they realized this alone. I exhort fellow seekers: if you can awaken to this, cast aside all doubt—this is the pivotal mechanism of Dao-cultivation, the secret essence of immortal practice.\"\n\nSomeone asked: \"Long ago, Master Shen’guang sought the method of pacifying the mind before Bodhidharma. The Patriarch replied: 'Bring me your mind, and I will pacify it for you.' After a long pause, Shen’guang said: 'I have searched for my mind but cannot find it.' The Patriarch said: 'I have already pacified it for you.' At these words, Shen’guang instantly awakened and severed all doubt. What is the principle here?\"\n\nI replied: \"The mind is originally no-mind; it appears only when stimulated by things. Thus, Master Ziyang said: 'When you see a thing, you see the mind; without things, the mind is not seen. Throughout the ten directions, in all that is open or obstructed, the true mind pervades everywhere.' The true mind has no form—it is like a precious mirror holding radiance: when an object comes, it reflects the object; when a person comes, it reflects the person. When both person and object vanish, the mirror becomes perfectly luminous and transparent. Thus, when one searches for the mind, nothing is found. As Master Guanyin said: 'The power of ordinary people lies in evil; the power of the worthy lies in goodness; the power of the sage lies in having nothing to attain.' Only those who attain nothing thereby attain the Dao. If one has awakened to the Dao, how could doubt not be severed?\"\n\nSomeone asked: \"Master Changchun said: 'Without the fortune of immortals, it is difficult to fathom the mechanism of creation.' What is the mechanism of creation?\"\n\nI replied: \"Creation is another name for the alternation of yin and yang, blockage and openness. The pivotal mechanism of yin and yang is another designation for the Dao. Blockage means obstruction; openness means flow. Thus, the *Book of Transformations* says: 'Therefore, the ancient sages thoroughly investigated the ends of obstruction and flow and grasped the source of creation.' This source of creation is none other than the wondrous Dao. Since this is the principle, without the fortune of immortals, how could one fathom the Dao?\"\n\nSomeone asked: \"Though the Dao is without direction, learning it follows an order. What is this order?\"\n\nI replied: \"For those who first embark on the Dao, they must first cast aside worldly entanglements, eliminate love and desire, seek out enlightened teachers, and delve deeply into the wondrous principles. Once the wondrous principles are thoroughly understood, one must further establish firm resolve. Next, one must cultivate the three practices of precepts, concentration, and wisdom—this is the essential sequence of progress. Precepts are the ladder to heaven, the boat that crosses the sea of suffering, the foundation of the Dao-path, and the gradual road to immortal practice. Without precepts, one cannot enter the gate of concentration; without entering the gate of concentration, one cannot give rise to wisdom. Thus, *Zhuangzi* says: 'When the chamber is empty, brightness arises; auspiciousness abides where it abides.' And again: 'When the dwelling is at peace and settled, celestial radiance is emitted.' When celestial radiance is emitted, one shares the same source as the Dao. Sharing the same source as the Dao, even spirits and gods cannot fathom one; yin and yang cannot mold one. One whom molding cannot reach—how perfect the person! How perfect the person!\"\n\nSomeone asked: \"Those who leave home to cultivate the Dao speak of the Dao as having no cultivation. What does this mean?\"\n\nI replied: \"Though the Dao itself requires no cultivation, the mind must be refined. The Dao within a person is like gold within ore. The ore contains gold, but if it is not refined, it remains stone; when the stone is refined away, it becomes gold. Once it is gold, it is no longer ore. The person contains the Dao, but if it is not refined, one remains ordinary; when the ordinary mind is refined away, one becomes an immortal. Once one is an immortal, one is no longer ordinary. If it is already gold, no further forging is needed; once the immortal Dao is attained, what further cultivation is required?\"\n\nSomeone asked: \"Master Danyang said: 'Quickly cast me into the mountains and lay me flat; urgently break open the dragon-tiger cave.' What does this mean?\"\n\nI replied: \"If 'me' is cast into the mountains and laid flat, the dragon-tiger cave naturally opens. What does this mean? 'Me' refers to the mind...\"\n\nThe person is the realm. When both mind and realm are forgotten, then the person and the self, the mountain, are overturned. The dragon and tiger are the mind of arising and ceasing in movement and stillness. The mind of arising and ceasing begins in the nature of true emptiness. The nature of true emptiness is vast, empty, and still—hence it is called the \"cave.\" It is also called the \"palace of emptiness.\" The Most High spoke of it as the \"gate of all wonders,\" and also as the \"gate of the mysterious female.\" *Zhuangzi* calls it the \"celestial palace\"—this is the meaning of the dragon-tiger cave. \"Breaking it open\" describes the state of having no obstructions. Once there are no obstructions, the Dao is contained therein.\n\nSomeone asked: \"What is the Golden Elixir?\"\nI replied: \"The 'gold' is like something that has undergone forging—truly firm, hard, sharp, clear, and pure. The 'elixir' is like something perfectly round and luminous, its axis responding to change, revolving endlessly from beginning to end without limit. The meaning of the elixir is that if one ingests it, one will surely transcend the illness of life and death. Thus, it is called the Golden Elixir.\"\n\nSomeone asked: \"At the beginning of cultivation, one must reduce meals, eliminate desires, and combat sleep. Yet it is also said: 'When hungry, eat; when tired, sleep.' What is the principle here?\"\nI replied: \"The principle has two explanations.\"\n\nFirst, for the beginner entering the Dao, familiar realms are hard to forget, and the mind’s horse and monkey stir easily—thus, clothing, food, sleep, and desires cannot be as one wishes. The ancients said: *\"To learn the Dao, do not expect things to go as you wish; if things go as you wish, do not expect to learn the Dao.\"* They also said: *\"Warmth and fullness breed lust; hunger and cold preserve naturalness.\"* If the dusty mind is utterly extinguished and the Dao-eye suddenly opens, then one acts without acting, yet nothing is left undone. When one acts without acting yet nothing is left undone, how could eating, sleeping, and rest be impediments?\n\nSomeone asked: *\"Master Li Feng said: 'Having form is illness; lacking form is illness. Neither having nor lacking—where then to settle body and life?' What is the principle here?\"*\nI replied: *\"Having form is attachment to appearances; lacking form is fixation on empty nothingness. Neither having nor lacking—this falls into reckless agitation.\"*\nHe asked: *\"How then to transcend these three layers of obstruction?\"*\nI replied: *\"Neither side is established; the Middle Way is also not a refuge. Turn your gaze beyond the Two Vehicles—spiritual light shines upon the vast cold moon.\"*\n\n**Guiding the Lost**\nMaster Guangmo was at leisure in his chamber, sitting in tranquil repose, his mind serene and carefree, at ease and content, following nature’s course in carefree wandering, freely indulging in the realm of self-attainment. At that moment, Zhaoranzi rose from his seat, bowed respectfully, and stood before him, saying: *\"Your disciple has long served you, yet has not received the transmission of the wondrous Dao. Today, in this moment of leisure, I dare ask: what is the Dao like?\"*\n\nMaster Guangmo shifted closer, remained silent for a long while, then changed his expression and, looking up to the sky, laughed: *\"What Dao is there to transmit?\"*\nZhaoranzi said: *\"Master, do not delay—your disciple earnestly wishes to hear it.\"*\nMaster Guangmo said: *\"The Dao originally has no questions; questions also have no answers. As soon as words are uttered, one falls into secondary meaning. Thus it is said: 'The Dao cannot be transmitted; to transmit it is not the Dao.' It cannot be seen, cannot be heard, cannot be grasped, cannot be known through thought. Gazing ahead, it is suddenly behind—this is called the form of the formless, the image of the imageless, what is called 'dim and indistinct.' Dim and indistinct, yet within it there is something; deep and obscure, yet within it there is essence. Its essence is utterly true, and within it there is reliability. From ancient times to the present, it stands alone and does not change, circulating without cease—it may be called the Mother of all under heaven. I do not know its name, so I style it the Dao. Thus, the mind is confounded and cannot know it; the mouth is at a loss and cannot describe it. It resides in the spirit’s abode—one must awaken to it oneself.\"*\n\nZhaoranzi said: *\"If the Dao cannot be transmitted, then what do Daoist patriarchs pass down through successive generations, and what do masters and disciples transmit to one another?\"*\nHe replied: *\"They transmit the mysterious teaching, passing down the wondrous Dharma.\"*\nZhaoranzi asked: *\"Does the mysterious teaching and wondrous Dharma also contain the Dao?\"*\nHe replied: *\"It is neither identical nor separate—it is like the fish-trap and rabbit-snare. The trap is for catching fish; once the fish is caught, the trap is forgotten. The snare is for catching rabbits; once the rabbit is caught, the snare is forgotten. Words are for conveying meaning; once the meaning is grasped, the words are forgotten. How can one speak with those who have forgotten words? Those who have forgotten words speak without speaking, speaking all day yet never having spoken; they act without acting, acting all day yet never having acted. Thus it is said: 'Without speaking, nothing is left unspoken; without acting, nothing is left undone.'\"*\n\nZhaoranzi said: *\"Before catching the fish or rabbit, one must use the trap and snare. Before grasping the meaning, one must rely on verbal teachings. I only hope the Master, in his compassion, will offer a few words to lift the veil from my understanding.\"* Thereupon, he bowed again, prostrating himself and standing with bent back.\n\nMaster Guangmo said: *\"Sit. I will tell you. The Dao has no before or after, yet teaching has sudden and gradual approaches. Human natures differ in sharpness and dullness, and awakening varies in depth. Endowed with different qi, the wise and foolish differ—yet tracing back to the source, all begin with the Dao. Thus it is said: 'Different paths lead to the same destination.' Those who attain sudden awakening do not rely on cultivation—they directly transcend to the other shore and immediately realize non-arising. Thereafter, the eye is like the ear, the ear like the nose, the nose like the mouth—all are the same. The mind congeals, the form dissolves, bones and flesh completely merge. They can reverse mountains and rivers, move cities and towns, tread upon water and fire, enter metal and stone, move freely without obstruction, and transform without limit.*\n\n*Those who attain gradual awakening must first clarify the mind and awaken to their nature, and only then nurture their life. Next, they must accumulate merit, amass practice, and seek it through years and months. Over long years and many months, in haste or turmoil, in movement or stillness, in sitting or lying down, they must preserve it continuously, as if it were always present yet not forced. Without interruption, their cultivation bears fruit. Their form becomes like withered wood, their mind like cold ashes. In the profound depths, they alone perceive the dawn; in the dark obscurity, they alone hear the harmony. They attain unity of body and mind, mind and qi, qi and spirit, spirit and nothingness. They can hold heaven and earth in their palm, carry the sun and moon before their lapel, roll up and unfurl the eight directions, gather and disperse the three luminaries, enter existence and non-existence, control life and death at will—yin and yang cannot fathom them.\"*\n\nZhaoranzi said: *\"I have respectfully heard the principle of sudden and gradual awakening. May I ask: what is the meaning of mind and nature? Your disciple is dull—may the Master explain it in detail.\"*\nMaster Guangmo said: *\"Alas, how foolish you are in your difficulty to awaken! Consider this: when you ask me, it is the mind. When I answer you, it is also the mind. What difference is there between mind and mind?\"*\n\nAnd what need is there to ask? What need is there to explain? Your question and my answer—both belong to the deluded mind. When the deluded mind is extinguished, one does not know who or what remains. Thus it is said: *\"It has never departed from our宗.\"* 宗 is nature. Nature is endowed by the Dao, and the Dao is endowed by spontaneity.\n\nZhaoranzi said: *\"I have respectfully heard the meaning of mind and nature. May I ask: in the principle of nurturing life, should one act or refrain from acting? Which is better?\"*\nMaster Guangmo answered: *\"Refrain from acting—yet in refraining from acting, nothing is left undone. Thus it is said: 'Those who act fail; those who grasp lose.' Therefore the sage refrains from acting and so does not fail, refrains from grasping and so does not lose.\"*\n\nZhaoranzi said: *\"If this is so, why did the past perfected masters speak of reducing meals, battling sleep, restraining the ape and seizing the horse, moderating flavors and guarding speech—as if these were acts?\"*\nMaster Guangmo answered: *\"The Dao is fundamentally non-action, yet the mind must be refined. Refinement is reduction—shedding old habits to renew one’s nature. Reduce and reduce again, until one reaches non-action, and in non-action, nothing is left undone. Thus it is said: 'Act through non-action, and nothing will be ungoverned.' Non-action is how one nurtures life.\"*\n\nZhaoranzi asked: *\"What is life?\"*\nMaster Guangmo answered: *\"It is the primordial true qi. Thus it is said: 'What beings receive is called life; what heaven bestows is called nature; following nature is called the Dao.' It is also said: 'That which is so without knowing why is called life.' Is this not the same?\"*\n\nZhaoranzi said: *\"The ancients said, 'One who does not understand life cannot be a noble person.' Yet here it is said, 'That which is so without knowing why is called life.' Are these two statements not different?\"*\nMaster Guangmo answered: *\"The words differ, but the principle is the same. 'One who does not understand life cannot be a noble person' means one does not know how to preserve one’s allotted life. Those who covet beyond their portion and lose their root are not noble. For humans, essence is the root, life is the foundation, and nature is the宗. Life is qi; nature is spirit. Spirit, qi, and essence all originate from the One and are never separate. Those who separate them transgress their portion.\"*\n\nZhaoranzi asked: *\"What does it mean to transgress one’s portion?\"*\nMaster Guangmo answered: *\"Human nature and allotment lack nothing and have no excess—they are originally complete. All methods of nurturing life are but last resorts. Such measures should be undertaken without attachment. Without attachment, one may nurture life. Those who do not understand this principle chase after deluded conditions, scheming and accumulating as if for eternity, indulging in excess and dissipation, drifting in the realm of fame and profit, never returning, never awakening—how can they be noble?\"*\n\nZhaoranzi said: *\"When essence, qi, and spirit are undivided, there is no question. But once divided, how can they be reunited?\"*\nMaster Guangmo answered: *\"Their division arises from the mind. Where the mind goes, qi follows; where qi goes, the body responds. Thus, when the mind is stirred by externals—grief brings tears, pungency brings mucus, dryness brings sweat, sourness brings saliva, and lust brings essence. If one can still the mind in the realm of utter emptiness and quiet the thoughts in the domain of non-action, then it remains unmoved. Though responsive, it does not stir—thus essence is preserved. Essence transforms into qi, qi into spirit, spirit into emptiness. Emptiness and reality interpenetrate—this is called Great Unity. In Great Unity, there is nothing to unite, yet nothing is not united.\"*\n\nZhaoranzi said: *\"I have respectfully heard the principle of nurturing life. May I ask: what are the essentials of internal alchemy?\"*\nMaster Guangmo said: *\"The essential methods of internal alchemy are many, with distinctions between orthodoxy and heterodoxy, as well as differences in scale.\"*\n\nZhaoranzi asked: *\"What is heterodoxy?\"*\nMaster Guangmo answered: *\"Some refine the five metals or eight minerals; some gather solar essence and lunar radiance; some swallow mist and ingest qi; some practice sexual arts to retain essence; some use water and fire to return to the origin; some exhale the old and inhale the new; some practice massage and breath-counting; some imitate the bear’s climb and the bird’s stretch; some shake the sinews and sway the marrow; some swallow saliva and absorb qi; some guard the lower dantian or the Hall of Light; some silently pay homage to the Celestial Emperor while circulating qi; some invert Kunlun or lie atop the Yellow River; some fly golden essence behind the elbow or engage in visualization; some fast to avoid grains; some ingest elixirs to prolong form. The so-called methods are countless—I cannot enumerate them all. These few examples are but minor heterodox practices. Alas! Many are misled by side doors and fail to awaken to the true Dao.\"*\n\nThus, those who study the Dao are as numerous as ox hairs, yet those who attain the Dao are as rare as unicorn horns.\n\nOne asks: Why are they so few?\nOne answers: It is because they do not encounter the true teacher’s secret transmission but are instead deluded by false masters, leading them to cling stubbornly to their errors without awakening.\n\nHence it is said: The deeply deluded never turn back in their lifetimes; the profoundly foolish never awaken in their lifetimes. As ice cannot be carved and the foolish cannot become wise, so it is indeed.\n\nThe *Hymn of the True Yang* states:\n*\"Three thousand six hundred gates of wondrous methods—\neach learner clings to one as their root.\nPitiable are these scraps of immortal arts,\nfor none lie within the three thousand six hundred gates.\"*\n\nIt further says:\n*\"The immortals see you as too stubborn and dull,\nleaving behind ten thousand volumes of alchemical scriptures.\nEvery line and chapter is but metaphor—\nthe true Dao was never bound to books.\"*\n\nThis is precisely what is meant.\n\nThereupon, Master Zhaoran bowed again, rose, and stood with hands reverently clasped.\nHe asked: What is the proper method of refining the elixir?\n\nThe master replied: The proper method of refining the elixir has three gates, divided into nine grades: three superior, three middle, and three inferior. The spirits, too, have three names: the Supreme is the spirit of emptiness and non-being; the Heaven and Earth are the spirits of yin and yang; and humans and creatures are the spirits of blood and flesh.\n\nThe immortals likewise have nine grades: the immortals of emptiness and non-being, celestial immortals, terrestrial immortals, divine immortals, ghost immortals, mountain immortals, water immortals, human immortals, and object immortals—these are the nine grades.\n\nThe immortals of emptiness and non-being cannot be discussed. Thus, celestial immortals do not depart from Heaven, terrestrial immortals do not depart from Earth, divine immortals do not depart from the divine, ghost immortals do not depart from ghosts, mountain immortals do not depart from mountains, water immortals do not depart from water, human immortals do not depart from humans, and object immortals do not depart from objects.\n\nTracing their origins, there was originally no division into three or nine. Yet because awakening varies in depth, endowment varies in purity, and effort varies in abundance, such differences arise.\n\nOne asks: What is the superior-grade elixir refinement?\nOne answers: The superior-grade refinement of the superior elixir uses the Great Void as the crucible, true emptiness as the cauldron, perfect clarity as the medicinal ingredients, celestial light as the firing process, deluded emotions as leakage, non-contention as safeguard, purity and stillness as bathing, non-action as external protection, vagueness and indistinctness as withdrawal and replenishment, and non-defilement as purification. It is attained in a single breath and completed within a hundred days.\n\nOne asks: What is the middle-grade elixir refinement?\nOne answers: The superior-grade refinement of the middle elixir uses Qian and Kun as the furnace, yin and yang as the cauldron, true lead and true mercury as the medicinal ingredients, pure yang as the firing process, desire and thoughts as leakage, non-delusion as safeguard, sobriety as bathing, gentleness and weakness as external protection, concentration and wisdom as withdrawal and replenishment, and forgetfulness of scheming as purification. It is attained within a hundred days and completed beyond three years.\n\nOne asks: What is the inferior-grade elixir refinement?\nOne answers: The superior-grade refinement of the inferior elixir uses the body as the furnace, the heart as the cauldron, spirit and qi as the medicinal ingredients, awareness and illumination as the firing process, pursuit of external realms as leakage, sleeplessness as safeguard, cleansing of thoughts as bathing, modesty and harmony as external protection, ascent and descent as withdrawal and replenishment, and purity and simplicity as purification. It is attained within three years and completed within nine.\n\nAs for the inferior-grade refinement of the inferior elixir, it also uses the body as the furnace, the five viscera and six bowels as the cauldron, essence and blood as the medicinal ingredients, qi circulation as the firing process, essence leakage as leakage, moderation in drink as safeguard, saliva rinsing as bathing, cultivation of goodness as external protection, daoyin as withdrawal and replenishment, and abstention from lust as purification. Yet after a full year, no achievement is made, and cultivation must span successive lifetimes. This can prolong life but cannot transcend the cycle of rebirth.\n\nYet compared to those who feign virtue, this still marks a distinction as vast as mud and sky.\n\nMaster Zhaoran said: \"The principles of elixir refinement—I have reverently received your instruction. May I ask: as the *Qingjing Jing* states, 'Those who awaken to this may transmit the sagely Dao'—is this so?\"\n\nThereupon, Master Guangmo set down his whisk, composed himself, and lay down. After a long while, he said: \"Do you grasp it?\"\n\nAt these words, Master Zhaoran experienced a great awakening. Leaping with joy, he smiled radiantly, then bowed three times, prostrating himself and standing respectfully beside him.\n\nMaster Guangmo rose with a frown and asked: \"What principle have you seen that makes you bow thus?\"\n\nMaster Zhaoran replied: \"What principle could you, Master, possess?\"\n\nMaster Guangmo said: \"Just so, just so. Safeguard this well.\"\n\nA verse says:\nOriginally there was no teaching, no transmission—\nOnly for learners clinging stubbornly to the snare.\nShould you fathom its true meaning,\nA cold pool’s autumn moon sinks deep into still waters.\n\n*On Resolving Doubts and Pointing the Way* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "析疑指迷论 经名：析疑指迷论。 元代神峰逍遥大师牛道淳撰。 一卷。 底本出处：《正统道藏》洞真部众街类。 析疑指迷论序 神峰逍遥大师，出示高论二编，名曰《析疑指迷》。 清谈不吝於胸怀，奥妙发挥於翰墨，平生所养，於兹见矣。 幸缘一览，俾予泠泠然独立於通衢，不知四肢之有无，则可以墙堑玄门，梯航后学者。 大德戊戌仲春朔，汝南重玄子刘道真谨跋。 前火传后火，薪异而焰同。 今圣嗣古圣，时殊而道一。 故宜乎马、谭、刘、丘已来，演玄风敷妙化之真人，继继而出也。 神峰逍遥先生牛君练师，新出奇论二卷。 目曰《析疑指迷》，属余以文开卷，一阅不觉身世两忘，若驭清飙而游乎碧落矣。 其诱人也，循循然有条而不紊，使人惑志顿消而朗彻。 其进人也，端语一发，使人浩然长往而不留。",
      "translated_text": "**Disquisition on Resolving Doubts and Guiding the Lost**\n\n**Sutra Title:** *Disquisition on Resolving Doubts and Guiding the Lost*\nComposed by Master Shenfeng Xiaoyao, Niu Daochun of the Yuan dynasty. One fascicle.\nSource of the base text: *Daoist Canon of the Zhengtong Era*, \"Comprehensive Arts\" section of the *Dongzhen* Department.\n\n**Preface to the *Disquisition on Resolving Doubts and Guiding the Lost***\n\nMaster Shenfeng Xiaoyao presented two profound treatises, entitled *Disquisition on Resolving Doubts and Guiding the Lost*. In them, his pure discourse flows freely from the heart, and abstruse mysteries are expounded through brush and ink—here, the cultivation of his entire life is revealed. By the good fortune of a single reading, I was left standing alone in the thoroughfare, so utterly absorbed that I forgot the very existence of my limbs. Thus may it serve as a ladder and ferry for later learners to scale the walls and moats of the Mysterious Gate.\n\nRespectfully inscribed by Liu Daozhen of Runan, Master of Double Mystery, on the first day of the second lunar month in the *wuxu* year of the Dade era.\n\nThe fire passes from prior flame to later flame; though the kindling differs, the blaze is the same. The sagely successors of today follow the ancient sages; though the times change, the Dao remains one. Thus it is fitting that since the days of Ma, Tan, Liu, and Qiu, true persons who propagate the subtle wind and spread the wondrous transformation have emerged in unbroken succession.\n\nMaster Shenfeng Xiaoyao, the Perfected Lord Niu, has newly produced two volumes of extraordinary discourse, titled *Disquisition on Resolving Doubts and Guiding the Lost*. He entrusted me with composing an introductory text, and upon reading it once, I forgot both self and world, as if riding a pure breeze through the azure vault. In guiding others, his method is measured and orderly, never disordered, dissolving the confusions of the mind and bringing clarity. In advancing others, a single utterance of his solemn words sets them forth on a boundless journey, never to linger.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 323,
      "start_sentence": 0,
      "end_sentence": 16,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.010053634643555,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\析疑指迷论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "其言简，其理微，其示教也深，其用心也切，此可谓火传而圣继者也。 门人恐其微言将没，裒而录之，以裨后进。 其弘师之道如是，此亦可谓用心之厚者焉。 时大德三年中秋前三日，静安冲漠道人王道亨书。 神峰逍遥子闲居幽室，倚轩块坐，隐几忘怀。 适有悟真子李志恒，从座而起，恭然而立，携笺作礼，拜而谓曰：敢问全真妙理，至道精微，性命之义，修行次序？ 愿师演而析疑矣。 逍遥子答曰：夫至道精微，无形无名，难演难言，非容取舍而可得也。 故心困焉而不能知，口辟焉而不能辞，在人虚府自悟耳。 其人叩之不已，志之愈诚，由是不得已而应命。 辄述是论，名曰《析疑指迷》，庶资初学之渐悟耳。 时元贞二年孟春上元日题。 析疑指迷论 析疑",
      "translated_text": "Its words are concise, its principles subtle; its instruction profound, its intent earnest—this may truly be called the transmission of the flame and the succession of the sagely. Fearing that these subtle teachings might fade into obscurity, his disciples have gathered and recorded them to aid those who come after. Such is the magnanimity of a master’s Way, and this too may be called the depth of devoted care.\n\nWritten on the third day before the Mid-Autumn Festival in the third year of the Dade era by Wang Daoheng, the Recluse of Serene Emptiness.\n\nThe Master of Carefree Wandering, in leisurely seclusion within his quiet chamber, sat alone by the window, leaning against his desk in forgetfulness. Just then, Wu Zhenzi Li Zhiheng rose from his seat, respectfully stood, and with paper in hand, bowed and said: \"Dare I ask of the wondrous principles of the Perfect Realization, the subtleties of the supreme Dao, the meaning of nature and destiny, and the sequence of cultivation? I wish for the Master to expound and resolve these doubts.\"\n\nThe Master of Carefree Wandering replied: \"The supreme Dao is subtle indeed—formless and nameless, difficult to expound, difficult to speak of, and not something that can be grasped through acceptance or rejection. Thus the mind is confounded and cannot know it; the mouth opens yet cannot express it. It lies in the empty treasury of the self to be realized. Yet as you persist in inquiry and your resolve grows ever more sincere, I cannot but respond to your request.\"\n\nThereupon, he set forth this discourse, titled *Disquisition on Resolving Doubts and Guiding the Lost*, in the hope that it might serve as a gradual awakening for beginners.\n\nComposed on the Lantern Festival of the second year of the Yuanzhen era.\n\n*Disquisition on Resolving Doubts and Guiding the Lost*\n\n*Resolving Doubts*",
      "overlap_context": " extraordinary discourse, titled *Disquisition on Resolving Doubts and Guiding the Lost*. He entrusted me with composing an introductory text, and upon reading it once, I forgot both self and world, as if riding a pure breeze through the azure vault. In guiding others, his method is measured and orderly, never disordered, dissolving the confusions of the mind and bringing clarity. In advancing others, a single utterance of his solemn words sets them forth on a boundless journey, never to linger.",
      "start_char": 323,
      "end_char": 622,
      "start_sentence": 17,
      "end_sentence": 30,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.439480066299438,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\析疑指迷论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "或问曰：何谓全真？ 答曰：即尔之一念未萌之前也。 夫一念未萌，等同太虚，视之不见其色，听之不闻其声，搏之不得其形。 其上无盖，其下无底，其傍无门，其正无体，其大无外，其 小无内。 杳冥莫测，恍惚难明，体之非有，随用不无，隐大无外，藏微有余。 寂然不动，感而遂通，包含万象体，不挂一丝头。 吾不知其名，字之曰全真。 释教谓之圆觉，又云圆空。 太上所谓混成，又云圆通。 故《南华经》云：未始有物者，至矣尽矣，不可以加矣。 此之谓欤。 或问曰：何谓心性？ 答曰：夫心性之义，譬犹沤水，水本至清，有感沤起风浪，浑浊不能鉴理，风浪息时，水澄沤止。 以此论之，水即是沤，沤即是水。 由是言之，心即性用，性即心体，体用俱忘，全真而已。 或问曰：何谓性命？ 对曰：夫性命之理，乃阴阳神气之异名也。 夫神气二字，呼唤无穷，今略言其大槩。 或谓动静、龙虎、水火、坎离、东西、南北、春秋、温凉、冬夏、寒暑、否泰、穷通、升降、往来、有无、虚实、上下、浮沉、高低、探浅、金木、刚柔、天地、日月、震兑、昏明、夫妇、婴姹、金翁黄婆、绛雪玄霜、紫芽红粉、真铅真汞。 其他殊名异呼，不可穷极，种种名相，不可着止，总名神气而已。 夫欲全神养气，当明体用宾主，屏尽万缘，一尘不染，表裹清浄，久久精诚，自然气结神凝，性停命住，性命双全，气神为一，一与道同，功行圆毕。 或问曰：何名体用宾主？ 答曰：若要修真，须明体用宾主何谓也？ 若不明体用者，情欲不能遣也。 如未晓阴阳宾主，则不能契於虚无之至神。 奚谓体用？ 曰：虚寂为体，觉照为用。 体用两全，洞合道原。 曰：何名宾主？ 答曰：前念为宾，后念为主。 念起不着，本无根绪。 故洞明真人云：念头起，觉时休。 此一句体用宾主俱全也。 何谓俱全？ 曰：夫念头起者为宾，觉者是主，主正为用，休歇是体。 由是言之，体即用也，用即体也，体用双泯，全真者也。 或问曰：人多说传命基，其义如何？ 答曰：夫命者，气也。 基者，本也。 一气之本，即道是也。 夫道者无形无名，非容取舍而可得也。 取舍不容，有何传哉。 故关尹子曰：圣人竟不能出道以示人。 又子列子云：不知所以然而然，谓之命。 此之谓欤。 或问曰：祖师言五行不到处，一气未生前，其义奚若？ 应曰：夫五行者，乃吾之五识也； 一气者，即尔之一念也。 若五识不起处，一念未萌前者，即与向之所谓未始有物之义同也。 既未始有物者，强名曰道矣。 或问曰：且未始有物者谓道，既已为物矣，物中有道乎？ 对曰：夫物从道生，物即是道，亦犹心从性生，心即是性。 又如沤从水生，沤即是水也。 故洞明云：师传秘语悟心开，物外家风物裹培。 又关尹子云：天地成理，一物包焉。 又云：即一物中知天尽神，致命造玄，物既如此，人岂不然。 又太上云：有物混成，先天地生，寂兮寥兮，独立而不改，周行而不殆，可以为天下母。 吾不知其名，字之曰道。 正谓此也。",
      "translated_text": "Should one ask, \"What is *quanzhen* (Perfect Realization)?\" I would reply: It is that which precedes the arising of even a single thought within you. Before a single thought stirs, it is equal to the Great Void—seen yet without color, heard yet without sound, grasped yet without form. Above, it has no covering; below, no base; at its sides, no gate; at its center, no substance. Vast, it has no exterior; minute, it has no interior. Dim and unfathomable, elusive and obscure, it is not a thing to be embodied, yet in function it is never absent. Concealing the boundless, it harbors the subtlest in abundance. Still and unmoving, it responds when stimulated and pervades all. It embraces the ten thousand images yet clings not to a single thread. I know not its name, so I style it *quanzhen*. The Buddhist teachings call it *perfect enlightenment* or *perfect emptiness*; the Most High speaks of it as *the undifferentiated* or *perfect penetration*. Thus the *Nanhua Sutra* says: \"That which has never yet given rise to things—this is the ultimate, the exhaustive, beyond which nothing can be added.\" This is what is meant.\n\nShould one ask, \"What are *mind* and *nature*?\" I would reply: The relationship of mind and nature is like that of waves and water. Water is fundamentally pure, but when stirred by sensation, waves arise and wind-driven waves muddy it so that it cannot reflect principles. When the wind and waves subside, the water clears and the waves cease. Thus, water is waves, and waves are water. By this analogy, mind is the function of nature, and nature is the substance of mind. When both substance and function are forgotten, there is only *quanzhen*.\n\nShould one ask, \"What are *nature* and *life*?\" I would reply: The principle of nature and life is but another name for the interplay of *yin-yang* and *spirit-qi*. The terms *spirit* and *qi* are invoked endlessly, so let me briefly outline their general meaning. They may be called *movement and stillness*, *dragon and tiger*, *water and fire*, *Kan and Li*, *east and west*, *south and north*, *spring and autumn*, *warmth and coolness*, *winter and summer*, *cold and heat*, *adversity and prosperity*, *rise and fall*, *ascent and descent*, *coming and going*, *being and non-being*, *void and full*, *above and below*, *floating and sinking*, *high and low*, *deep and shallow*, *metal and wood*, *firm and yielding*, *heaven and earth*, *sun and moon*, *Zhen and Dui*, *dusk and dawn*, *husband and wife*, *infant and maiden*, *Golden Elder and Yellow Dame*, *crimson snow and dark frost*, *purple sprout and red powder*, *true lead and true mercury*. Other names and designations are innumerable, and all such forms and appearances must not be clung to—they are but *spirit* and *qi* in sum. To fully nurture spirit and cultivate qi, one must clarify substance and function, host and guest, banish all entanglements, remain unstained by even a speck of dust, and maintain purity within and without. Through long and sincere practice, qi will coalesce and spirit congeal, nature will settle and life abide. When nature and life are both preserved, qi and spirit become one, and that oneness merges with the Dao. Then the work of cultivation is complete.\n\nShould one ask, \"What are *substance and function, host and guest*?\" I would reply: If one seeks to cultivate the Real, one must first understand what is meant by *substance and function, host and guest*. Without clarity on substance and function, the passions and desires cannot be dispelled. Without discerning yin-yang and the roles of host and guest, one cannot unite with the supreme spirit of emptiness and non-being. What, then, are *substance and function*? Emptiness and stillness are the substance; awareness and illumination are the function. When substance and function are both complete, they merge with the origin of the Dao. And what are *host and guest*? The preceding thought is the guest; the succeeding thought is the host. When a thought arises, do not cling to it, for it has no root or origin. Thus Master Dongming said: \"When a thought arises, awaken and let it rest.\" This single phrase encompasses both substance and function, host and guest. What does it mean to *encompass* them? The arising thought is the guest; awareness is the host. The host’s rectitude is the function; rest is the substance. Thus, substance is function, and function is substance. When both substance and function dissolve, there is only *quanzhen*.\n\nShould one ask, \"Many speak of *transmitting the foundation of life*—what does this mean?\" I would reply: *Life* is qi; *foundation* is origin. The origin of the single qi is the Dao. The Dao is formless and nameless, not something that can be grasped through acceptance or rejection. If it cannot be accepted or rejected, how can it be transmitted? Thus Master Guanyin said: \"The sage cannot go beyond the Dao to reveal it to others.\" And Master Liezi said: \"That which is so without knowing why it is so is called *life*.\" This is what is meant.\n\nShould one ask, \"The patriarchs speak of *where the five phases do not reach, before the single qi arises*—what does this mean?\" I would reply: The *five phases* are our five senses; the *single qi* is but a single thought within you. Where the five senses do not stir and before a single thought arises—that is the same as the earlier meaning of *that which has never yet given rise to things*. Since it has never yet given rise to things, it is forcibly named the Dao.\n\nShould one ask, \"If *that which has never yet given rise to things* is called the Dao, then once things exist, is the Dao present within them?\" I would reply: Things arise from the Dao, so things *are* the Dao—just as mind arises from nature, so mind *is* nature. Or as waves arise from water, so waves *are* water. Thus Master Dongming said: \"The master transmits secret words, the mind awakens; the family style beyond things is cultivated within things.\" And Master Guanyin said: \"The principles of heaven and earth are contained within a single thing.\" And again: \"Within a single thing, one may know heaven and exhaust spirit, align with life and enter the mysterious.\" If this is so for things, how could it not be so for humans? The Most High also said: \"There is a thing, undifferentiated, born before heaven and earth. Silent and empty, it stands alone and does not change; it circulates without cease and may be called the Mother of all under heaven. I know not its name, so I style it the Dao.\" This is precisely what is meant.",
      "overlap_context": "s it. It lies in the empty treasury of the self to be realized. Yet as you persist in inquiry and your resolve grows ever more sincere, I cannot but respond to your request.\"\n\nThereupon, he set forth this discourse, titled *Disquisition on Resolving Doubts and Guiding the Lost*, in the hope that it might serve as a gradual awakening for beginners.\n\nComposed on the Lantern Festival of the second year of the Yuanzhen era.\n\n*Disquisition on Resolving Doubts and Guiding the Lost*\n\n*Resolving Doubts*",
      "start_char": 622,
      "end_char": 1774,
      "start_sentence": 31,
      "end_sentence": 90,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.0246741771698,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\析疑指迷论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "或问曰：清和真人有云：止念降心越念多，不降不止，逐浪随波。 如何即是？ 答曰：凡初学道者，必先悟其真心。 夫真心者，元无一物，等同太虚，本来清净，於此浄中，一念忽起，顿然回光，返本归元，则湛然清浄矣。 故经云：澄其心而神自清，自然六欲不生，三毒消灭。 既得三毒消灭，即合於道矣。 若不明此理者，一念既起，又起念降之，降之不下，生心遣之，降遣不已，还自缠缚。 若不降遣，纵欲昏迷，转不相应。 故常知常觉，还自把捉，不知不觉，透入别壳。 亦与托生的一般也。 直待报尽方归，马乏人困，终不悟矣。 岂不悲哉。 或问曰：如何得万法圆通？ 答曰：修行之士，必先明心悟性，然后绝疑，方能养道。 夫心者是万法之源，性者是群经之要。 故心生则种种法生，心灭则种种法灭。 若一念不生，即脱生死，向这一念不生处，即见本来面目也。 久久涵养，圆明光大，则无法不通，无经不解，此名法眼圆通矣。 至如一大藏经，只是说这些理趣也。 古今圣贤所得者，得此而已。 过去师真所演者，演此而已。 五祖七真所了者，了此而已。 奉劝同流，若能悟此，更莫狐疑，斯为学道枢机，正是修真之秘诀。 或问曰：昔神光大师向达磨祖师前求安心之法，祖师答云：将汝心来，吾与汝安。 神光良久曰：弟子觅心无所得。 祖师曰：吾与汝安心已竟矣。 其神光言下大悟绝疑矣。 其理何如？ 对曰：夫心本无心，心因物感而见。 故紫阳云：见物便见心，无物心不见，十方通塞中，真心无不遍。 夫真心无象，喻如宝鉴含辉，若物来则见物，人来则见人，人物俱泯，则圆明莹彻矣。 如是言之，觅心无所得也。 关尹子云：众人之权归於恶，贤人之权归於善，圣人之权归於无所得。 唯无所得者，所以为道。 既是悟道者，岂不绝疑哉。 或问曰：长春真人云：不有神仙福，难明造化机。 何名造化机？ 答曰：夫造化者，乃阴阳否泰之异名也。 阴阳机要，即道之别称也。 夫否者，塞也。 泰者，通也。 故《化书》云：是以古圣人穷通塞之，端得造化之源。 造化之源者，即妙道而已矣。 理既如此，不有神仙福，安能明道哉。 或问曰：道虽无方，学则有序。 何谓有序？ 应曰：凡初学道者，必先抛弃尘缘，屏除爱欲，遍访明师，究研妙理，妙理精明，更要端的志节。 次须朋戒定慧三者，此序进之要妙也。 夫戒者，是上天之梯凳，渡苦海之舟航，陟道之初基，乃修仙之渐路也。 若无戒则不能入於定门也。 不入定门者，无由发於慧也。 故《庄子》云：虚室生白，吉祥止止。 又云：宇泰定者，发乎天光。 天光若发，则与道同其源矣。 与道同则鬼神难以测度，阴阳不能陶铸，陶铸不得者，至人哉！ 至人哉！ 或问曰：出家修道，又言道本无修，其意何如？ 对曰：夫道本无修，心即有炼。 夫道之在人，如金在矿。 矿内有金，不炼而为石，石若炼去，即名为金。 既已为金，不复为矿也。 人中有道，不炼而为凡，凡心炼尽，即名为仙。 既已为仙，不复为凡也。 若已为金，不须锻炼，既成仙道，复何修哉。 或问曰：丹阳真人云：速把我人山放倒，急将龙虎穴冲开。 其义何如？ 应曰：若我人山放倒，财龙虎穴便开也。 何谓也？ 夫我者，心即是也；",
      "translated_text": "Someone asked: \"Qinghe the Perfected once said: 'To stop thoughts and subdue the mind—yet the more you subdue, the more thoughts arise; if you neither subdue nor stop, you drift with the waves and follow the current.' What does this mean?\"\n\nI replied: \"For those who first embark on the Dao, they must first awaken to their true mind. This true mind is originally without a single thing, equal to the great emptiness, inherently pure. Within this purity, if a single thought suddenly arises, one must instantly turn the light inward, return to the root and revert to the origin—then clarity and purity will naturally abide. Thus the scripture says: 'When the mind is settled, the spirit becomes clear of itself; naturally, the six desires do not arise, and the three poisons vanish.' Once the three poisons are extinguished, one merges with the Dao. If one does not understand this principle, when a thought arises, one generates another thought to suppress it; if suppression fails, one uses the mind to dispel it. Yet suppression and dispelling never cease, and one becomes further entangled. If one does not suppress or dispel, indulging in delusion, one drifts ever further from alignment. Thus, if one constantly knows and constantly awakens, one grasps at oneself; if one neither knows nor awakens, one slips into another shell—just like being reborn. Only when one’s karmic retribution is exhausted does one return, weary as a spent horse and exhausted traveler, yet still failing to awaken. Is this not lamentable?\"\n\nSomeone asked: \"How can one attain perfect communion with the myriad dharmas?\"\n\nI replied: \"Those who cultivate the Dao must first clarify the mind and awaken to their nature, then sever all doubts before they can nurture the Dao. The mind is the source of the myriad dharmas, and nature is the essence of all scriptures. Thus, when the mind arises, the myriad dharmas arise; when the mind ceases, the myriad dharmas cease. If not a single thought arises, one transcends birth and death. In this state of thoughtlessness, one sees one’s original face. With long and deep cultivation, roundness, luminosity, and vastness grow—then no dharma is unpenetrated, no scripture is ungrasped. This is called the perfection of the Dharma-eye. All the vast scriptures of the canon merely expound these principles. What the sages and worthies of past and present attained, they attained this alone. What the past masters and perfected ones taught, they taught this alone. What the Five Patriarchs and Seven Perfected Ones realized, they realized this alone. I exhort fellow seekers: if you can awaken to this, cast aside all doubt—this is the pivotal mechanism of Dao-cultivation, the secret essence of immortal practice.\"\n\nSomeone asked: \"Long ago, Master Shen’guang sought the method of pacifying the mind before Bodhidharma. The Patriarch replied: 'Bring me your mind, and I will pacify it for you.' After a long pause, Shen’guang said: 'I have searched for my mind but cannot find it.' The Patriarch said: 'I have already pacified it for you.' At these words, Shen’guang instantly awakened and severed all doubt. What is the principle here?\"\n\nI replied: \"The mind is originally no-mind; it appears only when stimulated by things. Thus, Master Ziyang said: 'When you see a thing, you see the mind; without things, the mind is not seen. Throughout the ten directions, in all that is open or obstructed, the true mind pervades everywhere.' The true mind has no form—it is like a precious mirror holding radiance: when an object comes, it reflects the object; when a person comes, it reflects the person. When both person and object vanish, the mirror becomes perfectly luminous and transparent. Thus, when one searches for the mind, nothing is found. As Master Guanyin said: 'The power of ordinary people lies in evil; the power of the worthy lies in goodness; the power of the sage lies in having nothing to attain.' Only those who attain nothing thereby attain the Dao. If one has awakened to the Dao, how could doubt not be severed?\"\n\nSomeone asked: \"Master Changchun said: 'Without the fortune of immortals, it is difficult to fathom the mechanism of creation.' What is the mechanism of creation?\"\n\nI replied: \"Creation is another name for the alternation of yin and yang, blockage and openness. The pivotal mechanism of yin and yang is another designation for the Dao. Blockage means obstruction; openness means flow. Thus, the *Book of Transformations* says: 'Therefore, the ancient sages thoroughly investigated the ends of obstruction and flow and grasped the source of creation.' This source of creation is none other than the wondrous Dao. Since this is the principle, without the fortune of immortals, how could one fathom the Dao?\"\n\nSomeone asked: \"Though the Dao is without direction, learning it follows an order. What is this order?\"\n\nI replied: \"For those who first embark on the Dao, they must first cast aside worldly entanglements, eliminate love and desire, seek out enlightened teachers, and delve deeply into the wondrous principles. Once the wondrous principles are thoroughly understood, one must further establish firm resolve. Next, one must cultivate the three practices of precepts, concentration, and wisdom—this is the essential sequence of progress. Precepts are the ladder to heaven, the boat that crosses the sea of suffering, the foundation of the Dao-path, and the gradual road to immortal practice. Without precepts, one cannot enter the gate of concentration; without entering the gate of concentration, one cannot give rise to wisdom. Thus, *Zhuangzi* says: 'When the chamber is empty, brightness arises; auspiciousness abides where it abides.' And again: 'When the dwelling is at peace and settled, celestial radiance is emitted.' When celestial radiance is emitted, one shares the same source as the Dao. Sharing the same source as the Dao, even spirits and gods cannot fathom one; yin and yang cannot mold one. One whom molding cannot reach—how perfect the person! How perfect the person!\"\n\nSomeone asked: \"Those who leave home to cultivate the Dao speak of the Dao as having no cultivation. What does this mean?\"\n\nI replied: \"Though the Dao itself requires no cultivation, the mind must be refined. The Dao within a person is like gold within ore. The ore contains gold, but if it is not refined, it remains stone; when the stone is refined away, it becomes gold. Once it is gold, it is no longer ore. The person contains the Dao, but if it is not refined, one remains ordinary; when the ordinary mind is refined away, one becomes an immortal. Once one is an immortal, one is no longer ordinary. If it is already gold, no further forging is needed; once the immortal Dao is attained, what further cultivation is required?\"\n\nSomeone asked: \"Master Danyang said: 'Quickly cast me into the mountains and lay me flat; urgently break open the dragon-tiger cave.' What does this mean?\"\n\nI replied: \"If 'me' is cast into the mountains and laid flat, the dragon-tiger cave naturally opens. What does this mean? 'Me' refers to the mind...\"",
      "overlap_context": "n a single thing.\" And again: \"Within a single thing, one may know heaven and exhaust spirit, align with life and enter the mysterious.\" If this is so for things, how could it not be so for humans? The Most High also said: \"There is a thing, undifferentiated, born before heaven and earth. Silent and empty, it stands alone and does not change; it circulates without cease and may be called the Mother of all under heaven. I know not its name, so I style it the Dao.\" This is precisely what is meant.",
      "start_char": 1775,
      "end_char": 3002,
      "start_sentence": 91,
      "end_sentence": 159,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.63658928871155,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\析疑指迷论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "人者，境即是也。 若心境两忘，则人我山倒矣。 夫龙虎者，即人动静生灭之心也。 生灭之心始於真空之性，真空之性，寥廓虚寂，故名谓穴也。 又云虚府也。 太上所谓众妙之门，又云玄牝之门矣。 又《庄子》名谓天府，此乃龙虎穴之义也。 云冲开者，是无遮障之貌。 既无辽障者，即道蕴於此矣。 或问曰：如何是金丹？ 答曰：夫金者，喻如曾经锻炼，真坚刚利，明白莹素也。 丹者，譬若圆成光大，环枢应变，反覆无穷於本末端倪也。 丹之为义，若人服之，定超生死之病矣。 故曰：金丹也。 或问曰：凡初修炼，必须减饭、除情、战睡。 又云饥来吃饭困时睡。 其理何如？ 答曰：其理两说。",
      "translated_text": "The person is the realm. When both mind and realm are forgotten, then the person and the self, the mountain, are overturned. The dragon and tiger are the mind of arising and ceasing in movement and stillness. The mind of arising and ceasing begins in the nature of true emptiness. The nature of true emptiness is vast, empty, and still—hence it is called the \"cave.\" It is also called the \"palace of emptiness.\" The Most High spoke of it as the \"gate of all wonders,\" and also as the \"gate of the mysterious female.\" *Zhuangzi* calls it the \"celestial palace\"—this is the meaning of the dragon-tiger cave. \"Breaking it open\" describes the state of having no obstructions. Once there are no obstructions, the Dao is contained therein.\n\nSomeone asked: \"What is the Golden Elixir?\"\nI replied: \"The 'gold' is like something that has undergone forging—truly firm, hard, sharp, clear, and pure. The 'elixir' is like something perfectly round and luminous, its axis responding to change, revolving endlessly from beginning to end without limit. The meaning of the elixir is that if one ingests it, one will surely transcend the illness of life and death. Thus, it is called the Golden Elixir.\"\n\nSomeone asked: \"At the beginning of cultivation, one must reduce meals, eliminate desires, and combat sleep. Yet it is also said: 'When hungry, eat; when tired, sleep.' What is the principle here?\"\nI replied: \"The principle has two explanations.\"",
      "overlap_context": " an immortal. Once one is an immortal, one is no longer ordinary. If it is already gold, no further forging is needed; once the immortal Dao is attained, what further cultivation is required?\"\n\nSomeone asked: \"Master Danyang said: 'Quickly cast me into the mountains and lay me flat; urgently break open the dragon-tiger cave.' What does this mean?\"\n\nI replied: \"If 'me' is cast into the mountains and laid flat, the dragon-tiger cave naturally opens. What does this mean? 'Me' refers to the mind...\"",
      "start_char": 3002,
      "end_char": 3267,
      "start_sentence": 160,
      "end_sentence": 177,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.672811508178711,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\析疑指迷论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "一者初心进道，熟境难忘，马猿易动，所以衣食睡欲不教如意。 古人云：学道休望如意，如意休望学道。 又云：饱暖生淫欲，饥寒守自然。 若以尘心绝尽，道眼冲开，则无为而无不为也。 无为而无不为者，又岂妨於饭食睡眠也哉。 或问曰：离峰真人云：有体亦是病，无体亦是病，有无俱不用，何处安身命。 其理奚若？ 答曰：有体则着於色相，无体则滞於顽空。 有无俱不用，则落於沸荡矣。 曰：如何出得三重障碍去？ 答曰：二边俱不立，中道亦非安，回首二乘外，灵光射广寒。 指迷 广漠先生闲居於丈室，恬然而宴坐，澹漠而忘怀，委蛇而自适，任运而逍遥，恣放情於自得之乡矣。 时有昭然子，越坐而起，恭然而稽首，立侍乎前。 曰：弟子得为役久矣，未获夫子传吾妙道而已。 今日宴闲，敢问其道若何？ 广漠先生移位近前，默然良久，动容有间，仰天而笑曰：道奚传哉。 昭然子曰：夫子勿稽，弟子终愿闻之。 广漠先生曰：道本无问，问亦无答。 才涉有言，即堕於第二义也。 故曰：道不可传，传而非也。 视之不见，听之不闻，搏之不得，思之不知，瞻之在前，忽焉在后。 是谓无状之状，无物之象，是谓惚恍。 恍兮惚兮，其中有物； 窈兮冥兮，其中有精； 其精甚真，其中有信。 自古及今，独立而不改，周行而不殆，可以为天下母。 吾不知其名，字之曰道。 故心困焉而不能知，口辟焉而不能辞，在人灵府自悟耳。 昭然子曰：道既无传，弟子尝闻，道家者祖宗递授，师资相承，递授相承个什么？ 答曰：递授玄教，相承妙法也。 曰：玄教妙法而亦有道否？ 答曰：不即不离，譬犹筌蹄也。 夫筌者所以在鱼，得鱼而忘筌； 蹄者所以在兔，得兔而忘蹄。 言者所以在意，得意而忘言矣。 安得夫忘言之人，而与言哉？ 夫忘言之人者，言无言，终日言而未尝言； 为无为，终日为而未尝为也。 故曰：无言而无所不言，无为而无所不为矣。 昭然子曰：未得鱼兔，必用筌蹄，不能悟意，须假言教。 惟愿夫子慈愍，少垂微言，发吾之覆也。 於是再拜稽首，曲躬而立。 广漠先生曰：居，吾语汝。 夫道无后先，而教有顿渐； 人性有利钝，而悟有浅深。 禀气不同，而贤愚有异，循之於本也，咸始於道矣。 故曰异途而同归也。 夫顿悟之者，不假修持，则直超彼岸，立证无生矣。 而后眼如耳，耳如鼻，鼻如口，口无不同也。 心凝形释，骨肉都融，而能反山川，移城邑，蹈水火，入金石，纵横无碍，而变化无方者也。 夫渐悟之者，先要明其心，悟其性，而后养其命也。 次须累其功，积其行，而以岁月求之也。 岁之深也，月之久也，而造次必於是，颠沛必於是，行住必於是，坐卧必於是。 绵绵若存，用之不勤，如是无间，锻炼功着也。 而形如槁木，心类寒灰，窈窈之中，独见晓焉； 冥冥之内，独闻和焉。 而得体合於心，心合於气，气合於神，神合於无也。 而能摄乾坤於掌上，传日月於襟前，卷舒八景，聚散三辰，出有入无，存亡自在，而阴阳不能测矣。 昭然子曰：顿渐之理，敬闻命矣。 敢问心性之义若何？ 弟子性钝，愿夫子细细释之。 广漠先生曰：嘻，愚矣，子之难悟也。 且若问吾者，心也。 吾答若者，亦心也。 心之与心，有何异哉。",
      "translated_text": "First, for the beginner entering the Dao, familiar realms are hard to forget, and the mind’s horse and monkey stir easily—thus, clothing, food, sleep, and desires cannot be as one wishes. The ancients said: *\"To learn the Dao, do not expect things to go as you wish; if things go as you wish, do not expect to learn the Dao.\"* They also said: *\"Warmth and fullness breed lust; hunger and cold preserve naturalness.\"* If the dusty mind is utterly extinguished and the Dao-eye suddenly opens, then one acts without acting, yet nothing is left undone. When one acts without acting yet nothing is left undone, how could eating, sleeping, and rest be impediments?\n\nSomeone asked: *\"Master Li Feng said: 'Having form is illness; lacking form is illness. Neither having nor lacking—where then to settle body and life?' What is the principle here?\"*\nI replied: *\"Having form is attachment to appearances; lacking form is fixation on empty nothingness. Neither having nor lacking—this falls into reckless agitation.\"*\nHe asked: *\"How then to transcend these three layers of obstruction?\"*\nI replied: *\"Neither side is established; the Middle Way is also not a refuge. Turn your gaze beyond the Two Vehicles—spiritual light shines upon the vast cold moon.\"*\n\n**Guiding the Lost**\nMaster Guangmo was at leisure in his chamber, sitting in tranquil repose, his mind serene and carefree, at ease and content, following nature’s course in carefree wandering, freely indulging in the realm of self-attainment. At that moment, Zhaoranzi rose from his seat, bowed respectfully, and stood before him, saying: *\"Your disciple has long served you, yet has not received the transmission of the wondrous Dao. Today, in this moment of leisure, I dare ask: what is the Dao like?\"*\n\nMaster Guangmo shifted closer, remained silent for a long while, then changed his expression and, looking up to the sky, laughed: *\"What Dao is there to transmit?\"*\nZhaoranzi said: *\"Master, do not delay—your disciple earnestly wishes to hear it.\"*\nMaster Guangmo said: *\"The Dao originally has no questions; questions also have no answers. As soon as words are uttered, one falls into secondary meaning. Thus it is said: 'The Dao cannot be transmitted; to transmit it is not the Dao.' It cannot be seen, cannot be heard, cannot be grasped, cannot be known through thought. Gazing ahead, it is suddenly behind—this is called the form of the formless, the image of the imageless, what is called 'dim and indistinct.' Dim and indistinct, yet within it there is something; deep and obscure, yet within it there is essence. Its essence is utterly true, and within it there is reliability. From ancient times to the present, it stands alone and does not change, circulating without cease—it may be called the Mother of all under heaven. I do not know its name, so I style it the Dao. Thus, the mind is confounded and cannot know it; the mouth is at a loss and cannot describe it. It resides in the spirit’s abode—one must awaken to it oneself.\"*\n\nZhaoranzi said: *\"If the Dao cannot be transmitted, then what do Daoist patriarchs pass down through successive generations, and what do masters and disciples transmit to one another?\"*\nHe replied: *\"They transmit the mysterious teaching, passing down the wondrous Dharma.\"*\nZhaoranzi asked: *\"Does the mysterious teaching and wondrous Dharma also contain the Dao?\"*\nHe replied: *\"It is neither identical nor separate—it is like the fish-trap and rabbit-snare. The trap is for catching fish; once the fish is caught, the trap is forgotten. The snare is for catching rabbits; once the rabbit is caught, the snare is forgotten. Words are for conveying meaning; once the meaning is grasped, the words are forgotten. How can one speak with those who have forgotten words? Those who have forgotten words speak without speaking, speaking all day yet never having spoken; they act without acting, acting all day yet never having acted. Thus it is said: 'Without speaking, nothing is left unspoken; without acting, nothing is left undone.'\"*\n\nZhaoranzi said: *\"Before catching the fish or rabbit, one must use the trap and snare. Before grasping the meaning, one must rely on verbal teachings. I only hope the Master, in his compassion, will offer a few words to lift the veil from my understanding.\"* Thereupon, he bowed again, prostrating himself and standing with bent back.\n\nMaster Guangmo said: *\"Sit. I will tell you. The Dao has no before or after, yet teaching has sudden and gradual approaches. Human natures differ in sharpness and dullness, and awakening varies in depth. Endowed with different qi, the wise and foolish differ—yet tracing back to the source, all begin with the Dao. Thus it is said: 'Different paths lead to the same destination.' Those who attain sudden awakening do not rely on cultivation—they directly transcend to the other shore and immediately realize non-arising. Thereafter, the eye is like the ear, the ear like the nose, the nose like the mouth—all are the same. The mind congeals, the form dissolves, bones and flesh completely merge. They can reverse mountains and rivers, move cities and towns, tread upon water and fire, enter metal and stone, move freely without obstruction, and transform without limit.*\n\n*Those who attain gradual awakening must first clarify the mind and awaken to their nature, and only then nurture their life. Next, they must accumulate merit, amass practice, and seek it through years and months. Over long years and many months, in haste or turmoil, in movement or stillness, in sitting or lying down, they must preserve it continuously, as if it were always present yet not forced. Without interruption, their cultivation bears fruit. Their form becomes like withered wood, their mind like cold ashes. In the profound depths, they alone perceive the dawn; in the dark obscurity, they alone hear the harmony. They attain unity of body and mind, mind and qi, qi and spirit, spirit and nothingness. They can hold heaven and earth in their palm, carry the sun and moon before their lapel, roll up and unfurl the eight directions, gather and disperse the three luminaries, enter existence and non-existence, control life and death at will—yin and yang cannot fathom them.\"*\n\nZhaoranzi said: *\"I have respectfully heard the principle of sudden and gradual awakening. May I ask: what is the meaning of mind and nature? Your disciple is dull—may the Master explain it in detail.\"*\nMaster Guangmo said: *\"Alas, how foolish you are in your difficulty to awaken! Consider this: when you ask me, it is the mind. When I answer you, it is also the mind. What difference is there between mind and mind?\"*",
      "overlap_context": "d and luminous, its axis responding to change, revolving endlessly from beginning to end without limit. The meaning of the elixir is that if one ingests it, one will surely transcend the illness of life and death. Thus, it is called the Golden Elixir.\"\n\nSomeone asked: \"At the beginning of cultivation, one must reduce meals, eliminate desires, and combat sleep. Yet it is also said: 'When hungry, eat; when tired, sleep.' What is the principle here?\"\nI replied: \"The principle has two explanations.\"",
      "start_char": 3267,
      "end_char": 4492,
      "start_sentence": 178,
      "end_sentence": 243,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.89338254928589,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\析疑指迷论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "又奚问乎，亦奚说哉。 若之问也，吾之答也，总属妄心，妄心灭处，而不知其谁何。 故曰：未始出吾宗。 宗者，性也。 性禀於道，道禀於自然矣。 曰：心性之义，敬闻命矣。 敢问养命之理，而有为乎，无为乎，奚若？ 答曰：而无为乎，无为而无不为也。 故曰：为者败之，执者失之，是以圣人无为故无败，无执故无失也。 曰：既是无为者，过去师真而谓曰减饭也，战睡也，擒猿而捉马也，薄滋味而慎言也。 而似有为乎。 其理何如？ 答曰：夫道本无为也，而心即有炼也。 炼者，损也。 损其旧习而新染也。 损之又损之，以至於无为，无为而无不为也。 故曰：为无为，则无不治矣。 夫无为可养命也。 曰：命者，何谓也？ 答曰：即混元真气也。 故曰：物受之谓命，天赋之谓性，率性之谓道。 又曰：不知所以然而然，谓之命。 此之谓欤？ 昭然子曰：古云不知命无以为君子，此云不知所以然而然谓之命。 是两也，而不同乎？ 答曰：而言异而理同也。 夫不知命无以为君子者，谓不知守其命分也。 分外贪生而失其本者，非君子也。 夫人以精为根，以命为本，以性为宗，命者气也，性者神也。 夫神、气、精三者咸原於一，而未尝离也。 而离之者，皆越於分也。 曰：何谓越分？ 答曰：夫人性分，无欠无余，本来具足，凡养生之物，皆是不得已而为之。 夫不得已之类，可为无心矣。 无心而可以养命也。 人而不知此理，心慕於妄缘，而以为其预谋，积聚而以为久，恣纵於骄淫之地，流荡於名利之场，往而不返，迷而不悟，岂能为君子哉。 昭然子曰：夫精气神未分，则不问。 既已分矣，奚复为一邪？ 答曰：夫三者分离，皆因其有心也。 心之所之，则气从之，气之所之，则形应之。 是故心感於外者，感於悲则泪出，感於辛则涕出，感於燥则汗出，感於酸则液出，是故感於淫则精出也。 人能宁心於虚极之乡，息虑於无为之域，则寂然不动，感而遂通，而心不动也，而精自秘也。 精化为气，气化为神，神化为虚，虚实相通，是谓大同。 大同而无所同也，而无所不同矣。 昭然子曰：养命之理，敬闻命矣。 敢问炼丹之要，亦可得而闻乎。 广漠先生曰：炼丹之要法有多门，而有邪正，亦有大小不同也。 曰：奚谓邪？ 答曰：有炼五金者、八石者，有采日精而月华者，有吞霞而服气者，有采战而闭精者，或服水火而还元者，吐故而纳新者，按摩而数息者，熊经而乌伸者，摇筋而摆髓者，咽津而纳气者，守下丹田而明堂者，默朝上帝而运气者，倒卓昆仑而偃黄河者，肘后飞金精而存想者，休粮而辟谷者，服饵而延形者神向之所谓法有多门，而不能尽述也。 略言数端，皆是小乘之邪法也。 於戏，多迷於傍门，而不能悟其真道矣。",
      "translated_text": "And what need is there to ask? What need is there to explain? Your question and my answer—both belong to the deluded mind. When the deluded mind is extinguished, one does not know who or what remains. Thus it is said: *\"It has never departed from our宗.\"* 宗 is nature. Nature is endowed by the Dao, and the Dao is endowed by spontaneity.\n\nZhaoranzi said: *\"I have respectfully heard the meaning of mind and nature. May I ask: in the principle of nurturing life, should one act or refrain from acting? Which is better?\"*\nMaster Guangmo answered: *\"Refrain from acting—yet in refraining from acting, nothing is left undone. Thus it is said: 'Those who act fail; those who grasp lose.' Therefore the sage refrains from acting and so does not fail, refrains from grasping and so does not lose.\"*\n\nZhaoranzi said: *\"If this is so, why did the past perfected masters speak of reducing meals, battling sleep, restraining the ape and seizing the horse, moderating flavors and guarding speech—as if these were acts?\"*\nMaster Guangmo answered: *\"The Dao is fundamentally non-action, yet the mind must be refined. Refinement is reduction—shedding old habits to renew one’s nature. Reduce and reduce again, until one reaches non-action, and in non-action, nothing is left undone. Thus it is said: 'Act through non-action, and nothing will be ungoverned.' Non-action is how one nurtures life.\"*\n\nZhaoranzi asked: *\"What is life?\"*\nMaster Guangmo answered: *\"It is the primordial true qi. Thus it is said: 'What beings receive is called life; what heaven bestows is called nature; following nature is called the Dao.' It is also said: 'That which is so without knowing why is called life.' Is this not the same?\"*\n\nZhaoranzi said: *\"The ancients said, 'One who does not understand life cannot be a noble person.' Yet here it is said, 'That which is so without knowing why is called life.' Are these two statements not different?\"*\nMaster Guangmo answered: *\"The words differ, but the principle is the same. 'One who does not understand life cannot be a noble person' means one does not know how to preserve one’s allotted life. Those who covet beyond their portion and lose their root are not noble. For humans, essence is the root, life is the foundation, and nature is the宗. Life is qi; nature is spirit. Spirit, qi, and essence all originate from the One and are never separate. Those who separate them transgress their portion.\"*\n\nZhaoranzi asked: *\"What does it mean to transgress one’s portion?\"*\nMaster Guangmo answered: *\"Human nature and allotment lack nothing and have no excess—they are originally complete. All methods of nurturing life are but last resorts. Such measures should be undertaken without attachment. Without attachment, one may nurture life. Those who do not understand this principle chase after deluded conditions, scheming and accumulating as if for eternity, indulging in excess and dissipation, drifting in the realm of fame and profit, never returning, never awakening—how can they be noble?\"*\n\nZhaoranzi said: *\"When essence, qi, and spirit are undivided, there is no question. But once divided, how can they be reunited?\"*\nMaster Guangmo answered: *\"Their division arises from the mind. Where the mind goes, qi follows; where qi goes, the body responds. Thus, when the mind is stirred by externals—grief brings tears, pungency brings mucus, dryness brings sweat, sourness brings saliva, and lust brings essence. If one can still the mind in the realm of utter emptiness and quiet the thoughts in the domain of non-action, then it remains unmoved. Though responsive, it does not stir—thus essence is preserved. Essence transforms into qi, qi into spirit, spirit into emptiness. Emptiness and reality interpenetrate—this is called Great Unity. In Great Unity, there is nothing to unite, yet nothing is not united.\"*\n\nZhaoranzi said: *\"I have respectfully heard the principle of nurturing life. May I ask: what are the essentials of internal alchemy?\"*\nMaster Guangmo said: *\"The essential methods of internal alchemy are many, with distinctions between orthodoxy and heterodoxy, as well as differences in scale.\"*\n\nZhaoranzi asked: *\"What is heterodoxy?\"*\nMaster Guangmo answered: *\"Some refine the five metals or eight minerals; some gather solar essence and lunar radiance; some swallow mist and ingest qi; some practice sexual arts to retain essence; some use water and fire to return to the origin; some exhale the old and inhale the new; some practice massage and breath-counting; some imitate the bear’s climb and the bird’s stretch; some shake the sinews and sway the marrow; some swallow saliva and absorb qi; some guard the lower dantian or the Hall of Light; some silently pay homage to the Celestial Emperor while circulating qi; some invert Kunlun or lie atop the Yellow River; some fly golden essence behind the elbow or engage in visualization; some fast to avoid grains; some ingest elixirs to prolong form. The so-called methods are countless—I cannot enumerate them all. These few examples are but minor heterodox practices. Alas! Many are misled by side doors and fail to awaken to the true Dao.\"*",
      "overlap_context": "on-existence, control life and death at will—yin and yang cannot fathom them.\"*\n\nZhaoranzi said: *\"I have respectfully heard the principle of sudden and gradual awakening. May I ask: what is the meaning of mind and nature? Your disciple is dull—may the Master explain it in detail.\"*\nMaster Guangmo said: *\"Alas, how foolish you are in your difficulty to awaken! Consider this: when you ask me, it is the mind. When I answer you, it is also the mind. What difference is there between mind and mind?\"*",
      "start_char": 4492,
      "end_char": 5525,
      "start_sentence": 244,
      "end_sentence": 294,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.390954732894897,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\析疑指迷论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "所以学道者如牛毛，而了道者若麟角也。 曰：何由如是之寡也？ 曰：皆为不遭遇於真师之所诀，而被邪师之所惑，以致於自执固而不悟也。 故曰：大迷者终身不反，大愚者终身不灵也。 所谓冰不可镂，愚不可贤，此固然矣。 故正阳颂云：妙法三千六百门，学人各执一为根。 可怜些子神仙法，不在三千六百门。 又云：神仙见汝太顽愚，留下丹经万卷余。 句句章章皆譬喻，元来真道不关书。 正谓此也。 於是昭然子再拜而起，稽首而立。 曰：正炼丹之法若何？ 先生答曰：夫正炼丹之法者，而有三门，上中下而分为九品，上三品、中三品、下三品。 而神亦有三名，太上者，虚无之神； 天地者，阴阳之神； 人虫者，血肉之神也。 而仙亦有九品，有虚无之仙、天仙、地仙、神仙、鬼仙、山仙、水仙、人仙、物仙，是为九品也。 夫虚无之仙，不可论也。 故天仙不离於天，地仙不离於地，神仙不离於神，鬼仙不离于鬼，山仙不离於山，水仙不离於水，人仙不离於人，物仙不离於物也。 夫原其所始，本无三九之分也。 为其悟有深浅，禀有清浊，而功有多寡，故有如是之异也。 曰：上乘炼丹者若何？ 答曰：夫上乘上品炼丹者，以太虚为罐，以真空为鼎，以圆明为药物，以天光为进火，以妄情为渗漏，以不争为防危，以清浄为沐浴，以无为为外护，以恍惚为抽添，以不染为革秽也。 而得之於一息之间，而了在於百日之内矣。 曰：中乘炼丹者何如？ 答曰：夫中乘上品炼丹者，以乾坤为垆，以阴阳为鼎，以真铅真汞为药物，以纯阳为进火，以欲念为渗漏，以不昧为防危，以消洒为沐浴，以柔弱为外护，以定慧为抽添，以忘机为革秽也。 而得在於百日之中，而了在於三年之外矣。 曰：下乘炼丹者若何？ 答曰：下乘上，品炼丹者，以身为垆，以心为鼎，以神气为药物，以觉照为进火，以逐境为渗漏，以不睡为防危，以涤虑为沐浴，以谦和为外护，以升降为抽添，以纯素为革秽也。 而得之於三年之内，而了在於九载之中矣。 夫下乘下品炼丹者，亦以身为垆，以五脏六腑为鼎，以精血为药物，以运气为进火，以精泄为渗漏，以节饮为防危，以漱津为沐浴，以修善为外护，以导引为抽添，以不淫为革秽也。 而终年无成，而修之於累世矣。 此可以延年，而不能出离输回耳。",
      "translated_text": "Thus, those who study the Dao are as numerous as ox hairs, yet those who attain the Dao are as rare as unicorn horns.\n\nOne asks: Why are they so few?\nOne answers: It is because they do not encounter the true teacher’s secret transmission but are instead deluded by false masters, leading them to cling stubbornly to their errors without awakening.\n\nHence it is said: The deeply deluded never turn back in their lifetimes; the profoundly foolish never awaken in their lifetimes. As ice cannot be carved and the foolish cannot become wise, so it is indeed.\n\nThe *Hymn of the True Yang* states:\n*\"Three thousand six hundred gates of wondrous methods—\neach learner clings to one as their root.\nPitiable are these scraps of immortal arts,\nfor none lie within the three thousand six hundred gates.\"*\n\nIt further says:\n*\"The immortals see you as too stubborn and dull,\nleaving behind ten thousand volumes of alchemical scriptures.\nEvery line and chapter is but metaphor—\nthe true Dao was never bound to books.\"*\n\nThis is precisely what is meant.\n\nThereupon, Master Zhaoran bowed again, rose, and stood with hands reverently clasped.\nHe asked: What is the proper method of refining the elixir?\n\nThe master replied: The proper method of refining the elixir has three gates, divided into nine grades: three superior, three middle, and three inferior. The spirits, too, have three names: the Supreme is the spirit of emptiness and non-being; the Heaven and Earth are the spirits of yin and yang; and humans and creatures are the spirits of blood and flesh.\n\nThe immortals likewise have nine grades: the immortals of emptiness and non-being, celestial immortals, terrestrial immortals, divine immortals, ghost immortals, mountain immortals, water immortals, human immortals, and object immortals—these are the nine grades.\n\nThe immortals of emptiness and non-being cannot be discussed. Thus, celestial immortals do not depart from Heaven, terrestrial immortals do not depart from Earth, divine immortals do not depart from the divine, ghost immortals do not depart from ghosts, mountain immortals do not depart from mountains, water immortals do not depart from water, human immortals do not depart from humans, and object immortals do not depart from objects.\n\nTracing their origins, there was originally no division into three or nine. Yet because awakening varies in depth, endowment varies in purity, and effort varies in abundance, such differences arise.\n\nOne asks: What is the superior-grade elixir refinement?\nOne answers: The superior-grade refinement of the superior elixir uses the Great Void as the crucible, true emptiness as the cauldron, perfect clarity as the medicinal ingredients, celestial light as the firing process, deluded emotions as leakage, non-contention as safeguard, purity and stillness as bathing, non-action as external protection, vagueness and indistinctness as withdrawal and replenishment, and non-defilement as purification. It is attained in a single breath and completed within a hundred days.\n\nOne asks: What is the middle-grade elixir refinement?\nOne answers: The superior-grade refinement of the middle elixir uses Qian and Kun as the furnace, yin and yang as the cauldron, true lead and true mercury as the medicinal ingredients, pure yang as the firing process, desire and thoughts as leakage, non-delusion as safeguard, sobriety as bathing, gentleness and weakness as external protection, concentration and wisdom as withdrawal and replenishment, and forgetfulness of scheming as purification. It is attained within a hundred days and completed beyond three years.\n\nOne asks: What is the inferior-grade elixir refinement?\nOne answers: The superior-grade refinement of the inferior elixir uses the body as the furnace, the heart as the cauldron, spirit and qi as the medicinal ingredients, awareness and illumination as the firing process, pursuit of external realms as leakage, sleeplessness as safeguard, cleansing of thoughts as bathing, modesty and harmony as external protection, ascent and descent as withdrawal and replenishment, and purity and simplicity as purification. It is attained within three years and completed within nine.\n\nAs for the inferior-grade refinement of the inferior elixir, it also uses the body as the furnace, the five viscera and six bowels as the cauldron, essence and blood as the medicinal ingredients, qi circulation as the firing process, essence leakage as leakage, moderation in drink as safeguard, saliva rinsing as bathing, cultivation of goodness as external protection, daoyin as withdrawal and replenishment, and abstention from lust as purification. Yet after a full year, no achievement is made, and cultivation must span successive lifetimes. This can prolong life but cannot transcend the cycle of rebirth.",
      "overlap_context": "i; some guard the lower dantian or the Hall of Light; some silently pay homage to the Celestial Emperor while circulating qi; some invert Kunlun or lie atop the Yellow River; some fly golden essence behind the elbow or engage in visualization; some fast to avoid grains; some ingest elixirs to prolong form. The so-called methods are countless—I cannot enumerate them all. These few examples are but minor heterodox practices. Alas! Many are misled by side doors and fail to awaken to the true Dao.\"*",
      "start_char": 5525,
      "end_char": 6397,
      "start_sentence": 295,
      "end_sentence": 327,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.857429027557373,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\析疑指迷论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "虽然，比於诬善之人，亦云泥有间矣。 昭然子曰：炼丹之理，敬闻命矣。 敢问《清净经》云：能悟之者，可传圣道乎？ 於是广漠先生放下拂子，敛身而卧，良久曰：会么？ 昭然子於言下大悟，踊跃而喜，怡然而笑，遂礼三拜，稽首立侍乎傍。 广漠先生蹙然而起曰：子见个什么道理，而便拜乎？ 昭然子曰：夫子是何道理之有哉？ 广漠先生曰：如是如是，子善护持矣。 颂曰： 本来无说亦无传，只为学人酷殢筌。 若会其中端的意，寒潭秋月冷沉渊。 析疑指迷论竟",
      "translated_text": "Yet compared to those who feign virtue, this still marks a distinction as vast as mud and sky.\n\nMaster Zhaoran said: \"The principles of elixir refinement—I have reverently received your instruction. May I ask: as the *Qingjing Jing* states, 'Those who awaken to this may transmit the sagely Dao'—is this so?\"\n\nThereupon, Master Guangmo set down his whisk, composed himself, and lay down. After a long while, he said: \"Do you grasp it?\"\n\nAt these words, Master Zhaoran experienced a great awakening. Leaping with joy, he smiled radiantly, then bowed three times, prostrating himself and standing respectfully beside him.\n\nMaster Guangmo rose with a frown and asked: \"What principle have you seen that makes you bow thus?\"\n\nMaster Zhaoran replied: \"What principle could you, Master, possess?\"\n\nMaster Guangmo said: \"Just so, just so. Safeguard this well.\"\n\nA verse says:\nOriginally there was no teaching, no transmission—\nOnly for learners clinging stubbornly to the snare.\nShould you fathom its true meaning,\nA cold pool’s autumn moon sinks deep into still waters.\n\n*On Resolving Doubts and Pointing the Way* concludes.",
      "overlap_context": "era and six bowels as the cauldron, essence and blood as the medicinal ingredients, qi circulation as the firing process, essence leakage as leakage, moderation in drink as safeguard, saliva rinsing as bathing, cultivation of goodness as external protection, daoyin as withdrawal and replenishment, and abstention from lust as purification. Yet after a full year, no achievement is made, and cultivation must span successive lifetimes. This can prolong life but cannot transcend the cycle of rebirth.",
      "start_char": 6397,
      "end_char": 6615,
      "start_sentence": 328,
      "end_sentence": 339,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.848162412643433,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\析疑指迷论.txt",
        "category": "众术类"
      }
    }
  ]
}