{
  "source_id": "梅仙观记",
  "source_file": "chunked_daozang\\梅仙观记.json",
  "total_chunks": 11,
  "total_original_chars": 9662,
  "total_translated_chars": 57718,
  "total_translation_time": 326.0078876018524,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\记传类\\梅仙观记.txt",
    "category": "记传类"
  },
  "full_translation": "**Record of Plum Immortal Abbey**\n\n**Title:** *Record of Plum Immortal Abbey*\n**Compiler:** Yang Zhiyuan of the Southern Song, Daoist of the Xiantan Abbey\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, Dongxuan Section, Records and Biographies Category\n\n---\n\n**Account of Plum Immortal’s Deeds**\n\nPlum Immortal, a native of Shouchun Prefecture in Henan, bore the name Fu and the style Zizhen. During the reign of Emperor Cheng of the Western Han, he was appointed magistrate of Nanchang County in Hongzhou. In office, he upheld purity and integrity, disdaining ostentation, and ever mindful of relieving the people’s burdens—never once resorting to the lash or cudgel.\n\nAt the time, Wang Mang usurped the imperial throne, while Wang Feng’s power grew unchecked. Omens of disaster multiplied, yet none among the court dared speak. Unable to bear the suffering of the realm’s people, Fu roused his loyal and righteous qi and submitted the *Memorial on Disasters and Portents* to expound on order and chaos.\n\nThe memorial read:\n\n*\"Your servant has heard that when Jizi feigned madness under the Shang, he later presented the* Hongfan *to the Zhou. Shusun Tong fled Qin to serve Han, where he devised rituals and regulations. Yet Shusun was no traitor, nor did Jizi forsake his kin to rebel—they simply could not speak freely. In former days, the High Ancestor heeded good counsel as if fearing delay, accepting remonstrance as readily as turning a millstone. He judged men not by their past but by their merit: Chen Ping, risen from outlawry, became chief strategist; Han Xin, plucked from the ranks, was named supreme general. Thus, the realm’s scholars flocked to Han, vying to offer their rarest insights. The wise exhausted their schemes, the dull their thoughts; the brave gave their all, the timid their lives. By uniting the realm’s wisdom and might, the High Ancestor overthrew Qin as lightly as plucking a feather and seized Chu as easily as gathering a lost item—this was how he became invincible.*\n\n*Emperor Wen arose from the frontier, lacking the ministers of Zhou or the counselors Yi and Lü. Yet by following the High Ancestor’s ways and adding frugality and reverence, he nearly pacified the realm. From this, we see: adherence to the High Ancestor’s path brings order; deviation brings chaos. Why? The Qin, devoid of the Dao, erased Confucius’s traces and obliterated the Duke of Zhou’s institutions. They destroyed the well-field system, abolished the five ranks, and let ritual and music collapse, blocking the royal Way. Thus, none who sought to restore it could succeed.*\n\n*Emperor Wu valued loyal remonstrance, rewarding forthright speech with rank. He did not wait for merit or favor to elevate men, so the realm’s commoners sharpened their resolve and exhausted their talents to serve the court. Petitioners thronged the streets in numbers beyond count. The Han’s flourishing of worthy men reached its peak under him. Had Emperor Wu heeded their counsel, supreme peace might have been achieved. Instead, corpses piled and bones lay exposed, as his heart delighted in distant conquests—spurring the rebellion of the Prince of Huainan. His plans failed and his schemes were leaked because the court’s assembled worthies left his ministers no room to dissent.*\n\n*Now, commoners perceive the state’s vulnerabilities and rise upon hearing rumors—witness the uprising in Shu Commandery, or the bandit Su Ling of Shanyang, who trampled great cities and commanderies, seeking allies without fear of capture. All this stems from their contempt for high ministers and lack of awe for authority. When the state’s power wanes, even a commoner dares challenge the throne.*\n\n*Scholars are the state’s treasures. Gain them, and the state grows weighty; lose them, and it grows light. As the* Book of Songs *says: ‘Abundant are the scholars, by whom King Wen found peace.’ Yet court deliberations are not matters for rustics like your servant to address. I fear my corpse may lie among the weeds and common soldiers, so I have repeatedly submitted memorials seeking an audience, only to be rebuffed each time.*\n\n*I have heard that when a man presented the nine-times-nine multiplication table to Duke Huan of Qi, the duke did not dismiss him, hoping to attract greater talent. What I offer is no mere arithmetic. Your Majesty has rejected me thrice—this is why the realm’s scholars do not come. In former times, King Wu of Qin prized strength, yet Ren Bi’s feat of lifting the gate bar and Duke Mu of Qin’s hegemony through You Yu’s counsel show that to attract the realm’s scholars, one must act: when commoners submit memorials seeking audience, let them be sent to the Ministry of State. Question them on their proposals; if their words are worthy, grant them even a meager stipend or a bundle of silk. Then the realm’s scholars will vent their frustrations, voice loyal words, and offer fine strategies, which will daily reach Your Majesty’s ears. The realm’s systems and the state’s inner and outer workings will become clear as day.*\n\n*With the vastness of the four seas and the multitude of scholars and people, those capable of speech are countless. Yet those who are truly outstanding—who can diagnose the age’s ills, craft words into enduring texts that align with the sages and suit the times—are few indeed. Thus, ranks, emoluments, and silk are the whetstones of the realm, by which the High Ancestor honed the dull and sharpened the blunt.*\n\n*Confucius said: ‘A craftsman who wishes to do good work must first sharpen his tools.’ The Qin did otherwise. They forged a law against slander to ensnare the Han, wielding the sword Tai’e upside down and handing its hilt to Chu. Yet if one does not lose the hilt, even if the realm resists, none can blunt its edge—this was how Emperor Wu expanded the realm and built his legacy as the Han’s martial paragon.*\n\n*Now, instead of following the hegemons’ path, you seek to employ the Three Dynasties’ methods of selecting scholars, as if examining Bo Le’s paintings to find a qilin in the marketplace—clearly impossible. Thus, the High Ancestor overlooked Chen Ping’s past to gain his strategies; Duke Wen of Jin summoned the Son of Heaven; Duke Huan of Qi employed Yi Ya, though it brought no immediate benefit. They disregarded propriety to seize opportunity—this is the hegemons’ Way.*\n\n*When a single hue forms the whole, it is called pure; when black and white mingle, it is called motley. To govern the Qin’s violent legacy with the laws of a peaceful age is like using the village drinking ceremony to manage a military camp. Now, Your Majesty neither heeds the realm’s words nor merely rejects them—you punish them as well.\"*\n\nWhen the osprey suffers harm, the benevolent crows scatter in flight; when fools are punished, the wise withdraw in silence. Of late, the ignorant commoners who submit memorials often violate laws of no urgent consequence, and many have been sent to the Minister of Justice to die. Since the Yangshuo era, the realm has treated speech as taboo, and the court most of all. All officials comply with the imperial will, none dare uphold what is right—how can this be demonstrated? Take the memorials the people submit, even those Your Majesty approves of, and submit them to the Minister of Justice. He will surely declare: *\"This is improper speech, a grave act of disrespect.\"* Thus we see the proof.\n\nTherefore, Wang Zhang, the Metropolitan Governor, was by nature loyal and upright, daring to confront the throne in open remonstrance. Emperor Xiaoyuan of Han promoted him to encourage forthright ministers and correct the court’s crooked ways. Yet under Your Majesty’s rule, his punishment extended even to his wife and children. Even if one’s hatred were great, it should have stopped at his person. Wang Zhang committed no crime of rebellion, yet calamity befell his family. This broke the resolve of upright scholars and sealed the tongues of remonstrating ministers. All officials know this is wrong, yet none dare dispute it. When the realm takes speech as a warning, it becomes the state’s greatest peril.\n\nMay Your Majesty follow the High Ancestor’s path, block the road to Qin’s ruin, and heed the songs of the tenth month—let them be a lesson. Abolish laws of no urgent consequence and issue an edict removing all taboos, widely seeking counsel. Consult even the lowly and distant, neither concealing nor rejecting those far removed—this is what is meant by *\"opening the four gates and illuminating the four directions.\"* Moreover, laws of no urgent consequence are but the slightest form of slander. What is past cannot be recovered, but what lies ahead may yet be pursued.\n\nHere the imperial mandate is violated and the sovereign’s authority usurped, while the power of the empress’s kin grows daily more exalted. Though Your Majesty may not perceive its form, I pray you discern its shadow. Since the Jianshi era, solar eclipses and earthquakes have tripled in frequency, while the Springs and Autumns record floods rising without number. Yin waxes strong and yang wanes; bronze and iron take flight—what shadow is this?\n\nSince the founding of Han, the altars of state have thrice been imperiled: by the Lü, the Huo, and the Shangguan—all houses of the empress dowager. The Way of kinship holds preservation as its highest principle; one should appoint them worthy tutors and virtuous mentors, instructing them in the Dao of loyalty and filial piety. Yet now they are exalted in rank and entrusted with the reins of power, bred to arrogance and rebellion, until they are exterminated—this is the gravest failure of kinship.\n\nEven the worthy Huo Guang could not secure his descendants; thus, when power passes to a new generation, ministers become perilous. The *Book of Documents* says: *\"Do not let fire begin as a mere spark, lest its force overmaster the lord.\"* When power surpasses the sovereign’s, then to block it comes too late. It also states: *\"I have heard that one not in office does not meddle in its governance.\"* Governance is a charge; for one of low station to speak of lofty matters is a crime. To overstep one’s charge and incur guilt, to utter perilous words though the age’s ills lie hidden and fate’s threads are tangled—this is my wish. To guard one’s charge and remain silent, to live out one’s days in bodily safety, to die and have one’s name perish before the corpse decays—even were I offered Duke Jing’s rank, a thousand chariots in submission, I would not covet it.\n\nThus I long to ascend the steps of carved stone, tread the vermilion path, sit in judgment at the court’s gate, and pour forth my lifelong folly. Though it may bring no benefit to the times, if it leaves some trace for the world, this is why my sleep is restless and my meals tasteless. I pray Your Majesty examine my words.\n\nI have heard that to preserve others is to establish oneself, while to stifle others is to block one’s own path. The retribution of good and evil follows their deeds. Of old, Qin destroyed the Two Zhous and annihilated the Six States, leaving recluses unrecognized and hermits unraised. It severed the Three Sequences and extinguished the Heavenly Dao, and so its ruler perished, his son was slain, and his grandson left no heir—this was stifling others to block its own path.\n\nThus when King Wu conquered Yin, before descending from his chariot he preserved the descendants of the Five Emperors, enfeoffed Yin at Song, and continued Xia at Qi, making the Three Sequences manifest to show he did not hold them alone. Thus the Ji clan ruled half the realm, and the ancestral tablets of dethroned houses flowed out through the doors—this was preserving others to establish oneself. Now Cheng Tang is unvenerated, and the Yin people have no descendants; Your Majesty’s line has long been diminished, and this is likely the cause.\n\nThe *Spring and Autumn Annals* states: *\"Song executed its grandee.\"* The *Guliang Commentary* notes that his name and lineage were not recorded because he held an ancestral position and was thus honored. This shows that Confucius, though not of the orthodox line, enfeoffed the descendants of Yin as its heirs. The rites should follow this precedent—why? When feudal lords usurp their clans, when the worthy and the base contest the succession, the *Commentary* says: *\"The descendants of the worthy should hold land—how much more so the descendants of sages, and moreover those of Yin?\"*\n\nOf old, King Cheng buried the Duke of Zhou with the rites of a feudal lord, and august Heaven displayed its might with thunder and wind, revealing its displeasure. Yet now the temple of Confucius does not stand beyond the gates of Queli, and the descendants of the Kong clan, though sages, are not spared the status of commoners, offering sacrifices as mere common folk—this is not the will of august Heaven. If Your Majesty could truly honor Confucius’s enduring merit by enfeoffing his descendants, the state would surely reap its blessings.\n\nMoreover, Your Majesty’s name would be boundless as Heaven—why? To honor a sage’s enduring merit by enfeoffing his descendants is without precedent. Future sages will surely take this as their model; can an undying name not be pursued? The emperor did not respond, and so he harbored thoughts of retreat.\n\nAlas! The saying goes: *\"When a minister remonstrates two or three times and is not heeded, he should flee.\"* Was this empty words? He removed his robes, hung his cap at the capital’s eastern gate, resigned his office, abandoned his wife and children, and departed for Jiujiang. Fearing the empress’s kin would seize him, he changed his name and became a gatekeeper in Wu. Later, he sought teachers and pursued the Dao, wandering mountains and valleys in search of herbs. Once, he joined Zhang Liang’s descendant, Lord Zifang, holding a tablet and chanting the *\"Song of No-Birth\"* to delight his heart.\n\nHe visited the Yaodang Mountains—south of Kuaiji—and traveled to southern Min, entering Zhiti Mountain to cultivate himself for years without success. When a nun disturbed him, he exclaimed in frustration: *\"The elixir of nine refinements grows purer with time—why begrudge the lateness of its perfection?\"* He then entered Xianxia Mountain, east of Wuyi. Wandering where no man dwelt, roaming beyond the dust of the world, he heard apes cry in ancient trees and tigers roar in secluded crags. There were bamboos called *\"Slender Waist\"* and herbs named *\"Yellow Sprout,\"* rare shoots and strange plants too numerous to know. He built a hut by the cliffs, steadfast in resolve, fasting and eating pine nuts, aspiring to the immortals’ arts, accumulating years in this pursuit.\n\nOften gazing toward Min and Yue, he saw a strange purple vapor and returned to Jiancheng to establish an altar and refine his practice. Before long, one day the mountains were veiled in mist, rosy clouds filled the chamber, auspicious vapors floated in the air, and purple mists shrouded the peak. Heavenly music resounded, and a divine voice declared: *\"The Cavernous Immortal Lord approaches.\"* Soon the immortal music drew near, and the Immortal Lord descended. He bowed in welcome, and the Immortal Lord said: *\"Moved by your steadfast resolve in seeking the Dao, I have descended to grant you the method of external refinement and internal cultivation, the Great Elixir of Return, and the *Nine Elders’ Writ of the Immortal Capital for Saving the World*. Choose a sacred mountain and cultivate according to this method, and you will attain immortality.\"* When he finished speaking, Mei bowed in gratitude. The colored clouds dispersed, the heavenly music faded, and the Immortal Lord vanished into the distance.\n\nMei studied the celestial patterns and numbers, descended the mountain, and practiced the arts of saving the world—all proved efficacious.\n\nAt first, he arrived at Parrot Cage Mountain to cultivate, but was plagued by corpse-demons and malevolent spirits. Next, he came to Mao Bamboo Grotto, where in a nighttime dream a divine being said: *\"This mountain is not the place for your cultivation.\"* He then entered Perfected Immortal Mountain to cultivate, only to have his retreat burned by wildfire. Proceeding to Jade Flower Mountain to cultivate, he found that immortals had once dwelt there, but just as he began his practice, bandits arose on all sides due to drought. He next went to Black Stone Mountain to cultivate, where he was disturbed by a woodcutter’s wife.\n\nMei sighed and said: *\"My karmic affinity with the Dao is shallow and vast, while obstacles and demons arise in throngs.\"* He then resumed his arts of saving the world for several years, until he reached the western ridge of Sword River to cultivate. One day, auspicious clouds and propitious qi gathered over the mountain’s peak. Opening his chamber to look, he saw his Dao-master, the Cavernous Immortal Lord, descending. Mei bowed in welcome and addressed his master: *\"Your disciple has reverently followed your instructions, widely practicing the arts of saving the world and traveling through famous mountains to cultivate, yet I have suffered many demonic afflictions and have only now arrived here.\"*\n\nThe Dao-master said: *\"Your karmic affinity with the Dao lies at Flying Swan Mountain. I now grant you the Eight Spirit Demon-Repelling Elixir.\"* He then summoned two Radiant Lads, who led a crimson steed and a white horse before the mountain. *\"Hasten to mount the horse and lead the lads to Flying Swan Mountain for dedicated cultivation. On the day of your success, I shall raise you up, that your bones and form may ascend together.\"*\n\nWhen he finished speaking, the Dao-master vanished into the clouds. Mei then mounted the horse and led the lads to Flying Swan Mountain, where he established a hermitage to cultivate. After a thousand days, his spirit wandered beyond his body, and the radiance of his elixir illuminated the heavens—his Dao was accomplished. He then opened the furnace and took out the elixir: one pellet he offered to Heaven, and the celestial spirits received it; one pellet he offered to Earth, and the earth spirits guarded it; one pellet he consumed himself. After ingesting it, he bowed in thanks to Heaven and Earth. The earth spirits reported to the Three Officials, who in turn memorialized the Heavenly Palace, announcing that Mei Fu of the Western Han had attained the Dao on Flying Swan Mountain.\n\nMei then mounted his white horse and led the lads, intending to return to Jiujiang. The two lads clapped their hands before the horse and chanted a poem, then concealed themselves beneath a massive boulder by the mountain stream. In an instant, a red glow shot toward the sun, purple mist suffused the sky, sweet dew and heavenly flowers descended all at once. From the clouds, immortal music resounded, golden lads bearing tablets and jade maidens holding sashes appeared, while mighty immortals drove phoenix chariots and attendants bore the imperial edict. They addressed Mei: *\"The Heavenly Palace has issued a decree, commanding you to mount the phoenix and ascend.\"*\n\nMei bowed in gratitude for the celestial grace, abandoned his horse to mount the phoenix, and ascended into the heavens. The white horse fell into the waters below. Thereafter, Flying Swan Mountain was called Plum Immortal Mountain. To its west lay the Sinking Horse Shoals; thirty *li* away stood the Whip-Dropping Cao Mountain; below the mountain was the Ascent-to-Immortality Hamlet. To the east of the mountain’s stream were the Runaway Lad Stone and the Glue-Horse Waves. Beside the mountain was the Sweet Dew Spring; behind it, the Heavenly Flower Ridge, where flower traces remained on the stones. The locals thereafter called it Ridge Stone Ridge.\n\nTo this day, the elixir’s radiance lingers hidden at the mountain’s root. There stands the Plum Contemplating Dao Abbey, where incense and offerings are reverently maintained. Later, Buddhist monks occupied it as their dwelling, discarded the immortal statues to sculpt Buddha images, and renamed it Guanyin Abbey, moving the statue of Plum Immortal into the Founder’s Hall. The people of the prefecture, however, continued to call it Plum Immortal Abbey, ignoring the new name. Within the abbey, the Five Guardian Saints manifested their numinous power and established a temple beside it, which people simply called the Lord Mei Temple. Lord Mei’s name and the traces of his immortality remain sacred.\n\nFrom the Han to the present, twenty-two *bingyin* years have passed. From the Yuan Shi era to the present, in the second year of the Zhenyuan reign, the *bingshen* year, one thousand two hundred and fifty-nine years have elapsed without fading. At the time, this account followed the transmission of the Plum Immortal Hall in Jianning Prefecture, where the Plum Mountain Elixir-Refining Site was located—hence its inclusion.\n\n**Stele Inscription: The Stele of Master Mei**\n\n**Composed by Luo Yin, Tang Dynasty Inspector of the Eastern Circuit of Zhejiang, Concurrently Supervisor of the Ministry of Revenue and Palace Censor-in-Chief, Bestowed with the Purple Gold Fish Bag**\n\nDuring the reign of Emperor Cheng of Han, when the governance of the realm had fallen into decay, Master Mei repeatedly submitted memorials to admonish the Son of Heaven. The fire of governance demanded extinguishing, yet those who inquired after the vigor of swords and boots still numbered in the hundreds—yet they could not muster the strength to sever the heads of treacherous ministers for the state. How much less could the former subordinates of Nanchang, seething in their lowly stations below, achieve? Was it not because Nanchang was a distant land, and its constables mere petty officials? Had they but brushed against the imperial net or provoked the fangs of favored courtiers, they would have succeeded only in hastening the ruin of a madman and the annihilation of a single clan.\n\nAs for the high ministers and great officials—those entrusted with the power over life and death, joy and wrath, and burdened with the weight of cliques and transgressions—when they spoke a word or undertook a deed, they first consulted their wives and children. If it displeased their household, even the lowliest concubine or maidservant would obstruct and restrain them, let alone their relatives or kin. Thus, though they might harbor concern for the altars of soil and grain, they sealed their lips and uttered nothing.\n\nAlas! Those who are shamed by favor and emolument, who occupy high office, yet dare not speak of court affairs—this is why, when the realm follows the Dao, upright men hold high positions, and when the realm strays from the Dao, upright men are cast down.\n\nReading Master Mei’s writings, I have never failed to lament for the Han court. Now, on my southern journey, I pass once more through the Master’s homeland—how abundant is the Dao here! I inscribe this on the reverse of the Stele of Master Mei.\n\n**Inscribed by Ming Fengshan of Dashan in Xiaoshan**\n\nThe Daoist Abbey of Plum Immortal Mountain in Fengcheng possesses the Stele of Master Mei, composed by the Tang poet Luo Yin. Recently, upon revisiting the stele, I found it accompanied by an inscription. The Daoist Xiong Yingxiang exerted himself to renovate it, and the stele was re-erected. My friend Luo Yongzhi came and entrusted me with this inscription.\n\nPondering this, I ask: You, Zhaojian’s distant descendant, have so diligently preserved the calligraphy of former scholars and men of letters—why then do you still dwell upon the affairs of Han, sighing in lament?\n\nAlas! When Heaven willed the downfall of Han’s realm, it first raised up a single boundary of worthy men. Yet Han spurned Heaven’s blessing, and thus spurned the blessing of men—abandoning both, it brought ruin upon itself. Though bronze and iron clashed in flight, what could Heaven do for Han? Though an aged phoenix turned monstrous, what could Han do to resist Xin’s usurpation?\n\nAlas! To lose the worthy is to perish; to gain the worthy is to endure. Survival comes through heeding remonstrance; ruin comes through indulging flattery. How majestic the integrity—piercing heaven and earth! Compared to such men, we are but mud and dust; beside them, we are buried in humble graves.\n\nWhen he left his seat to depart from Han, he concealed himself at the market gate of Hao; when he set his tracks upon the immortal’s path, he poured out his grievances before the Celestial Threshold. The House of Liu faded into obscurity, leaving no trace in the vast sky; the legacy of Mei endures forever, honored in shrines far and wide. Though the shrine’s stele may crumble to ash, the immortal’s Dao cannot be buried. Now, with fresh carving on green jade, its words may once more be read and traced by hand.\n\nIf Zhaojian’s spirit yet lingers, may it awaken like ice-clear soul. If Master Mei yet lives, may sun and moon remain undimmed.\n\nInscribed in the sixth month of the first day of the *gengwu* year of the Xianchun reign [1270].\n\n**Inscribed on the reverse of the Stele of Master Mei by Xiaoshan Huang Tailai**\n\nReading the Stele of Zhaojian, one not only grasps the Master’s heart but also feels his *qi* grow stronger. Today, Plum Altars exist wherever his name is revered, and his shrines multiply in honor of the man. As Su Changong once said: “The spirit pervades the world like water in the earth—is there any place it does not reach?”\n\n**Official Document of the Ministry of Rites, Song Dynasty**\n\nThe Ministry of State Affairs petitions the Ministry of Rites regarding the document forwarded by the Ministry’s Bureau of Sacrifices: According to a report from the Court of Imperial Sacrifices, and in accordance with the memorial submitted by Zhen’nanjun, an investigation by Fengcheng County confirms that the Plum Immortal’s Altar Daoist Abbey in Nanqi Village, Xuanfeng Township, has been the site of annual state sacrifices for generations. Whenever floods or droughts afflict the people, their prayers here are invariably answered with efficacy. The matter has been verified and recorded by the prefectural authorities.\n\nPreviously, Daoist Yang Zhiyuan of the Plum Immortal’s Altar Abbey submitted a report stating that the abbey originally stood upon the former dwelling of Mei Fu of the Han dynasty. The ancient altar, cinnabar well, and hermitage foundations remain extant, and the abbey itself was first established in the Han era. Its name has long been enshrined in canonical sacrifices, and he now petitions that the throne bestow upon it the honorific title of *Zhenjun*.\n\nThe prefectural authorities, having reviewed the foregoing submission, note that Mei Fu’s towering integrity and loyal remonstrances are recorded in the historical annals for all to see. In his later years, he fled the usurper Wang Mang, abandoning wife and children to vanish into the marketplace of Wu, where he preserved his nature in obscurity. The world has since transmitted his story as that of an immortal, and his legacy endures in the very site of his retreat. The abbey stands in solemn order, and in times of flood, drought, or pestilence, prayers offered here are met with swift response. It is humbly hoped that a special honorific title may be conferred to accord with the distant people’s gratitude and devotion.\n\nThe prefecture has hitherto addressed the site only as “Master Mei the Realized One.” This Court, having deliberated, proposes that the Han dynasty’s Mei Fu the Realized One be granted an additional enfeoffment, pending imperial instruction.\n\nThis Bureau now submits the report of the Court of Imperial Sacrifices for the imperial decision.\n\n*Enfeoffment granted in the Yuanfeng reign [1078–1085].*\n\nBy imperial decree:\n\nDuring the Han dynasty, Mei Fu repeatedly voiced solitary yet far-reaching admonitions on the affairs of the realm—how resolute was his spirit! In later years, he retired to his home, devoting himself to study and the cultivation of his nature, ultimately transcending worldly custom in lofty withdrawal. The world has since transmitted his story as that of an immortal. To this day, west of the Great River, his temple image and shrine remain, where prayers are met with swift response, bringing blessings to our people. The local authorities having reported this, We now bestow this illustrious title to honor his enduring spiritual power. We deem it fitting to specially enfeoff him as the Realized One of Shouchun.\n\nThis decree is hereby issued for implementation.\n\n*Fifth year of the Yuanfeng reign, seventh month.*\n\n---\n\nThe Ministry of Rites has examined the recent submission from the Secretariat-Chancellery, which forwarded the imperial rescript from Zhen’nanjun concerning Fengcheng County’s Mei Immortal Abbey. The rescript commands the enfeoffment of Mei Fu of the Han as the Realized One of Shouchun. The decree is to be entrusted to the abbey for safekeeping, and an official shall be dispatched to conduct a solemn sacrificial rite and install the inscribed plaque. The local authorities have reported compliance and custody of the decree. However, though the rescript was submitted to the Secretariat-Chancellery long ago, no reply has been received. It is now ordered that the authorities of Zhen’nanjun be urgently pressed to expedite the matter in accordance with the rescript’s directives, ensuring prompt execution without delay.\n\n*Fifth year of the Yuanfeng reign, eighth month, tenth day.*\n\n---\n\nOn the twenty-third day of the eighth month of the fifth year of the Yuanfeng reign, Hongzhou received a decree from the Court of Imperial Sacrifices, dated the twenty-ninth day of the seventh month, in accordance with a directive from the Ministry of Rites. The directive followed an imperial rescript, dated the eighteenth day of the seventh month, sent down by the Secretariat-Chancellery, which transmitted a memorial from the Bureau of Sacrifices. The memorial, based on a report from the Court of Imperial Sacrifices, cited a petition from Zhen’nanjun, which in turn referenced an investigation by Fengcheng County into the Mei Immortal Altar Abbey at Nanqi Village in Xuanfeng. The abbey has long been the site of annual state sacrifices, and in times of flood or drought, the people’s prayers have invariably been answered. The facts were verified by the local authorities.\n\nPreviously, the Daoist Yang Zhiyuan of Shousheng Mei Immortal Abbey petitioned that the abbey, originally the retreat of Mei Fu of the Han, preserves ancient relics—an altar, cinnabar well, and hermitage foundations—with its structures dating to the Han dynasty. Its renown endures in canonical sacrifices. He requested that the throne be memorialized to grant the title of Realized One. The local authorities, having reviewed the petition, noted Mei Fu’s towering integrity and loyal remonstrance, recorded in the historical annals for posterity. In his later years, he fled the usurper Wang Mang, abandoning his wife and children, departing from Jiujiang, and preserving his nature in reclusion. The world has since transmitted his story as that of an immortal. His legacy endures in the very site of his retreat, where the abbey stands in solemn order, and prayers in times of flood, drought, or pestilence are met with swift response. It is humbly hoped that a special honorific title may be conferred to accord with the distant people’s gratitude and devotion. The prefecture has hitherto addressed the site only as “Master Mei the Realized One.” This Court, having deliberated, proposes that Mei Fu the Realized One of the Han be granted an additional enfeoffment, pending imperial instruction.\n\nThe Court of Imperial Sacrifices now submits the report for the imperial decision. On the fourteenth day of this month, We issued the following decree: “Let all matters proceed in accordance with precedent.” The decree, as recorded, was transmitted to the Ministry of Rites on the eighteenth day of the seventh month at the hour of *wei*.\n\nIn accordance with the imperial decree, the Ministry of Rites is to ensure all relevant offices execute the directive without delay. Upon receipt of this decree, let the details be reviewed and implemented as commanded.\n\nDuring the Han dynasty, Mei Fu repeatedly voiced solitary yet far-reaching admonitions on the affairs of the realm—how resolute was his spirit! In later years, he retired to his home, devoting himself to study and the cultivation of his nature, ultimately transcending worldly custom in lofty withdrawal. The world has since transmitted his story as that of an immortal. To this day, west of the Great River, his temple image remains, where prayers are met with swift response, bringing blessings to our people. The local authorities having reported this, We now bestow this illustrious title to honor his enduring spiritual power. We deem it fitting to specially enfeoff him as the Realized One of Shouchun.\n\n*Ninth month of the fifth year of the Yuanfeng reign.*\n\n---\n\nIn accordance with the Ministry of Rites’ directive and imperial rescript, an official shall be dispatched to Fengcheng County’s Shousheng Mei Immortal Altar Abbey to conduct a solemn sacrificial rite, proclaim the enfeoffment of the Realized One of Shouchun, and install the inscribed plaque. The decree is to be entrusted to the abbey for safekeeping. The local authorities are to report compliance to the Secretariat-Chancellery.\n\nThe plaque, inscribed with gilded characters, was commissioned by the prefectural authorities and completed on the nineteenth day of this month. It has been entrusted to the abbey’s Daoist and the dispatched official, along with the sacrificial text.\n\nThe magistrate of Fengcheng County, Officer Zhang, is hereby instructed to proceed to the abbey upon receipt of this directive, conduct the solemn sacrificial rite, and install the plaque as commanded. A report of compliance shall be submitted to the prefecture.\n\n*Ninth day of the tenth month of the fifth year of the Yuanfeng reign.*\n\n---\n\nDecree:\n\nOn Our recent southern progress, with Yuzhang as the eastern boundary, We accompanied the Empress Dowager and the palace retinue by boat, braving the perils of wind and wave. At every place We passed, divine protection was manifest. In gratitude for these blessings, We now confer honors to reciprocate the deities’ favor.\n\nThe Realized One of Shouchun at the Mei Fu Ascension Altar Abbey on the north bank of the Great River in Fengcheng, Hongzhou—his forthright remonstrance unheeded, his lofty name alone endured. Moved by the Han dynasty’s decline, he departed for Wushi and never returned. His shrine now stands in solemn dignity, and We have already bestowed a title upon him. To further enhance his honor, We now augment his designation with a new grace, deepening Our exceptional regard and honoring his lifelong devotion. Let him be specially enfeoffed as the Recluse-Realized One of Shouchun.\n\nThis decree is hereby issued for implementation.\n\n*Eighteenth day of the intercalary fourth month of the second year of the Shaosheng reign.*\n\n*Eulogy.*\n\n**Eulogy for Master Mei**\n\nMaster Mei, the Perfected One, once served as a minor official in Nanchang. He sought leave to present a memorial, bearing his early writings in a sack. He admonished the world on governance, steeling his resolve and exhausting his essence. His noble aspirations were thwarted in Qin, yet his censure of the phoenix spread his renown. It was said that when the sun’s light waned, he lost his rightful place—how true this proved. Many scholars are the state’s treasures, and when worthies gather at court, men grow envious and wary. How then to summon them? The Dao lies in mutual refinement.\n\nThe magpie met harm, while the benevolent crow soared away. Do not seek a steed by studying its likeness in the marketplace. Thus, I recount the lineage of Confucius, that later generations may emulate Cheng Tang. To honor virtue and exalt the worthy rests with Us. From the phoenix’s reign to Wang Mang’s usurpation, the Han’s guiding ropes unraveled. Prevention came too late—My words bear witness. Resolved to journey afar, he rode the clouds to the Emperor’s realm.\n\n---\n\n**Inscribed at Mei the Immortal’s Abbey**\n*Meng, Water Bureau Attendant of Bin*\n\nThe immortal’s path stretches distant, clouds wisp-thin;\nThe ancient altar’s wind sighs through rustling leaves.\nHow could later men speak of lingering long?\nA single constable ascended—his Dao supreme.\n\n---\n\n**Former Residence of Master Mei**\n*Huang, Grand Scribe Tingjian*\n\nHad he not served as Nanchang’s constable,\nHis memorials submitted, he would have returned to an empty court and market.\nLaughing, he brushed the cliffside blossoms, asking of the dusty world:\n“Is your old friend now the state’s preceptor?”\n\n---\n\n**Sent to Daoist Master Yang of Mei the Immortal’s Abbey**\n*Su, Yellow Gate Attendant Zhe*\n\nThe Daoist master dwells on Perfected One Peak,\nYet when I seek him, no path remains.\nLast year, he promised to enter the city,\nBut dust darkened the skies, and he never arrived.\n\nDo not come, do not go—you weary my heart.\nInstead, you send me Daoist scriptures worth a thousand gold pieces.\nClad in fine robes, sated with meat, my schemes are shallow;\nTexts pile before me, yet I see nothing.\n\nOral teachings and direct instruction come in their time—\nCast off the net, and you shall be known.\nMei the Elder, Han’s constable of Nanchang,\nStroked the dragon’s scales to speak of worldly affairs.\n\nOne morning, he brushed his robes and departed, never to return,\nRiding a white qilin, veiled by red simurghs.\nThough I now wallow in the dust of the world,\nWhy does the Daoist master not speak to me?\n\nOne day, when my glory is complete, I shall retreat to a famous mountain,\nAnd when we meet, we’ll clap hands and break into smiles.\n\n---\n\n**Inscribed at Mei the Immortal’s Abbey**\n*Yang Cigong Jie*\n\nThe hearts of all under heaven cherish utmost loyalty;\nHeaven’s heart, too, aligns with the people’s.\nOnce he grew wings and ascended to the Three Clarities,\nNot solely through ninefold-cycled cinnabar.\n\nIn the Han, he changed his name and wandered Yue;\nThe Daoists left his image to Xiao Gong.\nThe stone altar marks where he ascended—\nAn old crane’s cry, the wind in the pines and cypresses.\n\n---\n\n**Inscribed at Mei the Immortal’s Abbey**\n*Hong Guifu Peng*\n\nThe fiery spirit of the sovereign waned,\nAnd the Four Seas knew no peace.\nAlas, Mei of Nanchang,\nCast off his sandals in the first year of his era.\n\nA minor official, he bared his liver and gall,\nYet palace affairs were shrouded in secrecy.\nHis memorial vanished into obscurity,\nDiscarded beyond rivers and lakes.\n\nOne morning, weary of the snail’s-horn strife,\nHe entrusted his fate to the roc’s back.\nIn times past, on bamboo slips,\nHis deeds shone unmatched.\n\nNow, in the Jasper Pool’s realm,\nPhoenixes and kingfishers soar through wind and dew.\nGazing up at the divine realm’s wanderings,\nFor a thousand years, I imagine his living qi.\n\nI wish to cling to the dragon’s scales,\nNot shed my body like a cicada’s husk.\n\n---\n\n**Inscribed at Mount Mei**\n*Chen Chan*\n\nThe master, a recluse-official in Nanchang,\nTraveled a thousand li to seek a realm beyond things.\nDrawing water, he pitied the spring well’s dry lips;\nHiding elixirs, the night altar still gleamed.\n\nThe crane returned to the decorated pillar—where is its master?\nThe dog barked in deep clouds, the days lengthened.\nI intend to return and trace his vestiges,\nStaff in hand, to wander awhile.\n\n---\n\n**Inscribed at Mei the Immortal’s Abbey**\n*Zhu Lingcui*\n\nHis memorials cast before the northern gate were blindly ignored;\nA recluse-official in Nanchang, he lodged this question here.\nHis body soared through the nine skies to the Purple Palace;\nHis name endures through the ages, entrusted to green mountains.\n\nWho now gazes upon the starry altar at night?\nAt dawn, mist and clouds drift to and fro.\nThe high peaks, seldom trod by men,\nReveal a true realm apart from the mortal world.\n\n---\n\n**Praying for Rain at Mei’s Altar, Yimao Year**\n*Yan Lingzhuangling*\n\nThe great recluse’s pure name matched the Emperor’s will;\nThe Perfected One’s new favor was gathered in the royal words.\nThough Nanchang’s constable was a minor post,\nHis Dao, linked to the Northern Culmen, grew more exalted.\n\nHis remonstrances could not save the crumbling Han court;\nHis immortal’s mien briefly graced Wu Gate.\nI come to seek the place of morning audience—\nThe mountain defies the starry altar, the waters reject my staff.\n\n---\n\n**Inscribed at Mei’s Altar**\n*Lü Fang, Prefect of Linchuan*\n\nHis memorials hung unheeded—then he doffed his cap.\nBlue mists and ancient trees seal the empty altar.\nHad they known then he was a guest of Penglai,\nThey would not have seen him as merely Nanchang’s constable.\n\n---\n\n**Inscribed at Mei the Immortal’s Abbey**\n*(Excerpt from a longer poem)*\n\nI once read Master Zizhen’s biography,\nAnd closed the scroll with repeated sighs.\nHow could such loyal and upright talent\nHave appeared in the Yuan and Cheng eras?\n\nHis perilous words addressed the times’ governance,\nHis proposals thorough, tracing roots to sources.\nHis unyielding integrity shattered the traitors’ gall,\nHis indignant spirit shook the Confucian’s cap.\n\nHis memorials were repeatedly rejected.\nNine nines aligned with the maple’s leaves.\nAt that time, the court’s ministers\nUniversally lacked thick skins.\n\nHis brilliant writings gleam in the annals,\nEnduring as the stars and sun.\nHe probed the mechanisms, foreseeing disaster,\nThen brushed his robes and left—nine rivers, a thousand li.\n\nHe abandoned wife and children in one stroke,\nChanged his name, and embraced Wu Pass.\nTo speak truth while holding high office—\nSince ancient times, this has been most difficult.\n\nThis man preserved himself—\nHow arduous his path of withdrawal and engagement!\nFan Zi briefly held a post,\nAnd drove his carriage to the immortal’s altar.\n\nBeside the altar, a thousand-zhang pine,\nIts icy branches cleansed by returning winds.\nFrom Shouchun came new melodies,\nHis lofty steps treading jasper and jade.\n\nThe walls bear Luo Yin’s inscriptions,\nTheir principles profound and worthy of contemplation.\nIn those years, Lord Kangle\nTraveled to renowned mountains.\n\nWhy then has this fine site\nNot been recorded in metal or stone?\nThe flying simurgh...\n\n---\n\n**Inscribed at Mei the Immortal’s Abbey**\n*Ma Neihan Zicai*\n\nThe Han’s guiding ropes slackened,\nAnd the state’s fate shifted to powerful ministers.\nThe divine edge of Grand Marshal’s sword\nWas inverted, its hilt in others’ hands.\n\nCourtiers crowded the hall,\nEach swallowing their words.\nZhang Yu, the Emperor’s tutor,\nWas the root of this chaos.\n\nThe Son of Heaven’s attendants\nDecided matters with a single word.\nNot for the altars’ sake,\nBut to beg for a child’s favor.\n\nThe sword meant to slay horses\nFailed even Zhu Yun.\nGu Yong’s forthright counsel\nWas met with ominous portents at court.\n\nDark schemes aided the chief villain,\nBlame cast upon Zhao Yang’s consort.\nFrom then on, jackals and wolves roamed free,\nStrutting in broad daylight.\n\nAt that time, the Master\nKnocked upon the imperial gates with memorials.\nHis loyalty burned bright as maple’s vexing flames,\nAs radiant as stars and constellations.\n\nThe nine-fold gates of heaven were locked,\nA single gate garrisoned by ten thousand men.\nA minor official with a heart for rivers and lakes—\nHow could his words reach the Son of Heaven?\n\nThe traitor Wang Mang indeed usurped the state,\nWhile the loyal and upright met burning and boiling.\nThe Master changed his surname,\nBecame a soldier at Wu Market’s gate.\n\nFloating clouds left no trace,\nThe world willingly called him immortal.\nWhere lies Penglai Mountain?\nLet such matters rest unspoken.\n\nYet he loved the lofty, pure wind,\nIts chill majesty ever renewed.\nI come to bow before his portrait,\nHis old abode’s foundations still standing.\n\nIn the Yuanfeng era, a new dawn arose,\nThe jade registers sealed Shouchun’s blessings.\nThe ancient pines grow ever more vigorous,\nTheir trunks bearing the marks of frost’s yearly toll.\n\nStraight to the summit altar I ascend,\nHeaven’s wind whips my robes and headscarf.\nCarefully reading the inscriptions on the walls,\nI delight in Luo Yin’s writings.\n\nSome regretful, blunt words\nStir my spirit to greater heights.\nLooking back at those sated with ease,\nThey seem as fleeting as dust.\n\n**Inscribed at Mei Altar**\n*Jiang Zhiqi, Imperial Censor*\n\nOnce I served in Jiangxi,\nVisiting every sacred trace in Yuzhang.\nHow could I bear this lingering regret—\nThat I alone had not come to Mei Immortal’s Altar?\n\nMei Immortal’s Altar lies in Fengcheng’s bounds,\nWhere true wind and refreshing qi dwell beyond the world’s dust.\nIn those years, he served as deputy magistrate in Nanchang,\nHis talent renowned, though his rank remained modest.\n\nWhen the Han’s Cheng Emperor saw the state’s discipline crumble,\nThe Master submitted his remonstrance again and again.\nEarlier, Wang Zhang had been promoted to correct the court’s crooked ways,\nBut his execution—wife and children, allies and kin—brought vengeful satisfaction.\n\nGuilty ministers dared not protest,\nAnd so the realm took his words as warning.\nAlas, such speech was perilous indeed!\nHow fiercely he rebuked the powerful and strong.\n\nHad he merely grazed a favored courtier’s fangs,\nA single setback would not have been ruinous.\nYet high ministers and nobles held their tongues,\nPursuing private schemes—no wonder.\n\nThe righteous below sighed in sorrow,\nChanging his name, working in Wu Market—who knew?\nIn the Yuanfeng era, imperial decrees honored him,\nHis old hermitage and cinnabar well’s foundations preserved.\n\nShouchun’s Perfected One was granted a noble title,\nCelebrating his lofty withdrawal from the vulgar world.\nThough the Master met no favor in his time,\nToday he is honored and commended.\n\nThe magistrate’s records praise his loyalty and integrity,\nHis hidden virtue and obscured brilliance shining boundlessly.\n\n**Inscribed at Mei Mountain**\n*Zhang Jingxian, Heavenly Master*\n\nWhen he served as deputy in Nanchang,\nHe sent memorials to the northern palace time and again.\nLoyal words failed to awaken the lord,\nHis unyielding integrity shamed him as a subject.\n\nThe Han court teemed with omens and calamities,\nYet Wu Gate longed for reclusion.\nHe hung up his cap, forgetting favor and disgrace,\nCovering his face, he left the world’s dust behind.\n\nThe rainbow’s arc bent his heroic qi,\nThe gull’s drought left him at ease.\nEver mindful of the Three Caverns’ secrets,\nHe bid farewell to the springs of the Nine Rivers.\n\nChoosing a place, he opened his immortal abode,\nGazing at clouds, he trimmed his longevity scarf.\nOn the dark terrace, he paced beneath autumn’s moon,\nIn the empty chamber, night congealed his true nature.\n\nNo dreams sprouted fragrant grasses,\nHe nurtured great vitality to extend his years.\nVerdant moss exhaled unbroken fragrance,\nThe azure steed’s nature remained docile.\n\nThe Taiye elixir’s blade and mortar were complete,\nThe Central Yellow’s path renewed.\nWuyi’s fallen horse was in vain,\nThe dense trees of Yu finally cradled his spirit.\n\nThough his crimson tally once summoned him to court,\nHis numinous waves still aided the people.\nA single stone tablet transmits his old history,\nA thousand years of affairs lie within Yan’s precincts.\n\nAuspicious qi births immortal medicines,\nPure wind is entrusted to feathered ones.\nThe altar preserves the golden tripod’s image,\nThe well seals the jade-bright ford.\n\nThe land adjoins Hongya’s mansion,\nThe stream flows to the Sword Water’s shore.\nCranes return, clouds stirring,\nDragons rise, stone scales wrinkling.\n\nHe awakened to the body as affliction,\nHis original hope was virtue’s neighbors.\nGreen mountains do not forget me—\nToday, this is heaven’s kinship.\n\n**Two Poems Inscribed at Mei Mountain**\n*Fan Renzhong*\n\nHis sleeve chilled, he brandished his anti-treason sword,\nYet how could it not avenge the three memorials?\nWhen the deputy of Nanchang stood alone in loyalty,\nThe Han’s many kings boiled like a hundred cauldrons.\n\nHe sought Red Pine as companion and left,\nWhat need had he for fame in the green histories?\nI wonder if, after refining the nine-fold elixir,\nHis indignant spirit spat its essence to the Jade Emperor.\n\nThe matter of immortals is distant and vague,\nYet Shouchun’s sacred site endures through the ages.\nBy the pines, a white crane has hidden for a thousand years,\nBeyond the ridges, red sunsets trail through countless evenings.\n\nThe rosy chariot plays with shadows in moonlit cold,\nThe Dipper Altar’s wind chimes ring with night’s fragrance.\nThe Master need not be called a Perfected One—\nHe endures as long as heaven and earth.\n\n**Inscribed at Mei Immortal’s Abbey**\n*Chen Cangyi*\n\nHe advanced loyal words, concealing his name,\nThis mountain’s spirit enjoys ten thousand years of incense.\nPity those drunk on fame and fortune—\nTheir blood stains Xianyang, yet they cannot be roused.\n\n**Inscribed at Mei Altar**\n*Zuo Shu, Wang Shiyan*\n\nMei’s deputy’s solitary loyalty shines,\nHis fragrant name transmitted through the ages.\nThough his rank was low, why hide his intent?\nA heart upright is itself an immortal.\n\nDaring to admonish, his concern for the times was urgent,\nAs a subject, he wished his lord to be worthy.\nLingyang was called a fine magistrate,\nFacing the Crimson Spring, they stand in opposition.\n\n**Inscribed at Mei Immortal’s Altar**\n*Liu Tingwu of Qingjiang*\n\nFor centuries, the pure wind of reclusive officials,\nTall pines and slender bamboo fill the altar’s front.\nHad the Han emperor heeded his three memorials,\nThe Master might not have become an immortal.\n\n**Inscribed at Mei Altar**\n*Wang Bofan*\n\nThe Fire Virtue waned, decline not yet overthrown,\nA single memorial from the court’s phoenix cried out first.\nHad the lord listened to such loyal counsel,\nThat traitor Wang’s schemes would not have succeeded.\n\nThe immortal’s name fragrantly fills the cosmos,\nHow many leave a stench to rot the nobles?\nEven now, the wind howls, the pines roar in anger,\nAs if pleading injustice for the Master.\n\n**Staying Overnight at Mei Immortal’s Altar**\n*Zhang Guangyang*\n\nI lodge for the night at Mei Altar’s precinct,\nThe mountain cold, all sounds stilled.\nLacking talent for reclusive office,\nI dream of recalling the immortal’s grace.\n\nStone teeth hold lingering snow,\nPine beards bristle in the fierce wind.\nIf the smoke of favor could be licked,\nI would mount a crane to ask the primordial chaos.\n\n**Inscribed at Mei Altar**\n*Zhong Jiu*\n\nTen thousand pines guard the ridge, towering to the sky,\nWithin, the Perfected One once dwelled in reclusion.\nThe well’s chimes still warm with cinnabar’s mercury,\nThe altar’s height brings the Dipper’s stars near.\n\nReflecting on Han affairs stirs melancholy,\nHow vainly men today compose their praises.\nI long to follow, yet no path leads there—\nNot like Xu’s immortal crane, soaring together.\n\n**Hu Fa**\nA speck of loyal liver burns moon-bright,\nYet worldly matters defy the Dao-eye’s gaze.\nRiding cloud-cakes to the Dipper’s palace,\nOnly cliffs and gorges bow to the immortal’s altar.\n\n**Musing While Visiting Mei Altar**\n*Linchuan Wu Jiguang*\n\nI stand briefly at the immortal’s altar, embracing the Dipper,\nClimbing high, the sky itself seems low.\nThe pure wind of Nanchang’s reclusive officials lingers—\nIt awakens those lost in worldly delusions.\n\n**Matching Rhymes on Mei Mountain’s Wall**\n*Gu Xu Deng Mengjie*\n\nAshamed my name and self have fallen to humble garb,\nWith no means to reach the immortal’s altar.\nThough Zi Zhen hid, his fame could not be hidden—\nHis lofty virtue chills through the ages.\n\n**Inscribed at Mei Mountain**\n*Shu Jia Zhao Chazhuang*\n\nI came to this mountain seeking seclusion at Wu Gate,\nGrieving that the Han tripod still faces such trials.\nIf but a single word could turn the celestial ear,\nThe immortal’s name need not fill the world’s inquiries.\n\n**Inscribed at Mei Altar**\n*Cao Xianjia*\n\nHere in Han times, Master Mei refined his elixir,\nThe ancient altar mottled with moss and lichen.\nThe eye strains along the crow’s path to distant azure,\nWhile beneath shifting pine shadows, the white sun idles.\nMist veils towers beyond the realm of forms,\nWind carries bells and chimes into mortal ears.\nSince his ascent on the Shao melody,\nHow many times has his flying simurgh returned to these old peaks?\n\n**Zhang Yi of Xinchang**\nReturning from memorials, the sun already west,\nIn the mountains, I swiftly fashioned a robe of creeping fig.\nNot for the secrets of golden elixirs did I plan my retreat—\nLeaving court, I knew the fiery mandate had shifted.\nWind and dew fill the grove, cicadas shed their skins,\nPines and firs stretch far, a lone crane takes flight.\nBurning incense in humble devotion was never my wish—\nMy loyalty is known to heaven and earth.\n\nAncient trees, withered vines—how many years have passed?\nThose who come here in robes and caps do not do so in vain.\nWaves rising from level ground are hard to turn back,\nYet in the mountain’s wind and rain, one sleeps soundly.\nIf the Dao has spirit, it will find its use in the world,\nThis heart, unashamed, can reach the heavens.\nFate’s allotment of fame and rank follows my desire—\nI will not be driven to serve as a whip-bearer.\n\n**Sending to Yang Yilao of Mei Altar on the Beginning of Spring**\n*Fan Taizhong*\n\nThe official path wears on, another spring arrives,\nI deeply loathe the dusty red of worldly striving.\nUnable to untangle endless affairs,\nI long recall the carefree, self-possessed man.\nMorning draws water from a clay jar to water herbs,\nNight dons feathered robes to greet the Perfected.\nBeyond things, in the realm of purity and emptiness,\nI breathe the pure primordial qi to nurture spirit.\n\n**Inscribed on Mao Qingfu’s Yunyue Tower at Mei Altar**\n*Xiao Tailai*\n\nThe tower stands at Mei Peak’s highest point,\nDay by day drifting with the primordial qi.\nThe heart of Dao is as joyful as the heart of clouds—\nFlying away, flying back, all is freedom.\nGathering the two hundred li of clouds,\nPoems and zither windows all turn toward you.\nWhy delight alone when shared delight is better?\nThe balustrade lacks only this old man’s share.\n\n**Inscribed on Mei Mountain’s Yunyue Tower**\n*Yueshan Zhu Xingfu*\n\nClad in robes, I ascend the white cloud’s summit,\nThe gate, entrusted to clouds, opens not idly.\nLet it remain in the mountains for self-amusement—\nDo not allow a single wisp to leave the peaks.\n\n**Zitang Chen Jie**\nWhite robes and gray dogs—heartless things,\nWith a flip of the hand, they mourn or rejoice, altering past and present.\nI yield to the Daoist, ever carefree,\nWatching their rise and fall without concern.\n\n**Houlin Li Yishan**\nClouds, originally without intent—who delights in them?\nSince Hua Yang’s departure, few have known.\nWishing to share half a mat, yet no way to arrive,\nA single piece flies here in search of poetry.\n\n**Wang Shiyan of Shu**\nA lifetime’s livelihood is a body at leisure,\nDaily wandering with the white clouds.\nFive hundred years later, who knows this taste?\nAfter Hua Mountain, one comes to Mei Mountain.\n\n**Lin Yin Luo Yongzhi**\nOnce reading Yang’s poem, I knew the lazy clouds,\nNow Yunyue is but the cloud’s descendant.\nThe dragon, without wrath, always returns to its casket,\nThe crane, fearful, alone guards the gate.\nSpring’s mood delights in the company of chanting guests,\nA tranquil heart gladly speaks with rustics.\nTo know clouds are best when leaving the peaks in clear weather—\nBeyond the tower, misty rain blurs the scene.\n\n**Chutang Hu Hongzi**\nWhat delights the world\nLies in the bustle of splendor.\nMaster Mao’s joy\nIs white clouds filling green mountains.\nThe flying tower overlooks vast emptiness,\nAscending, the face ever brightens.\nEdges soaring with the clouds,\nThe heart at ease with the clouds.\nThe Eight Poles’ Perfected Mei\nRides clouds to and fro.\nI, too lazy to leave the peaks,\nAt times return to sit at the cloud’s gate.\nIn pure chanting, embracing solitude,\nWhen shall we together find refuge?\n\n**Cui Cizhou**\nImmortals favor dwelling in towers,\nIn heaven, many are jade towers.\nAuspicious mists coil in purple and black,\nEver swirling in boundless flow.\nThe Daoist, descendant of immortals,\nDwells at Mei Mountain’s summit.\nThe summit soars a hundred feet,\nDaily roaming with the clouds.\nIn silence, observing inner visions,\nCloud qi swirls and floats.\nThe pavilion embraces the western breeze,\nThe cold sky gathers the cloud’s shadows.\nLeaning on the railing, emotions flow,\nBrush and ink thick with cloud and mist.\nInviting guests to discourse on the mysterious,\nFully inhaling the cloud’s rich essence.\nNo need to divide or question,\nEntwined as they may be.\nJoyful, all is at ease,\nSerene, what more is sought?\nDelighted, movement and stillness follow,\nBreathing in and out, going and staying as they please.\nI long to ride them, knocking at the Great Void,\nTogether ascending the celestial heights.\nBelow, pursuing the immortal’s whip,\nSimurghs and phoenixes roam boundlessly.\nLooking down upon the eight wilds,\nCommanding the nine provinces with a wave.\n**Zhong Shuo**\nNot I who delight in clouds—clouds delight in me,\nClouds and I, both without intent.\nKnowing you love hiding in the clouds,\nUnwilling to leave the mountains, nowhere to be found.\n\n**Li Junshi**\nWithout intent, leaving the peaks, the Daoist at leisure,\nBody in the void, drifting in the ethereal.\nPity the cloud’s rainbow, longed for by men,\nIt rolls up the clouds and rain into Mei Mountain.\n\n**Inscribed at Mei Mountain**\n*Xue Xiuzhu*\n\nThe altar of creeping fig stands high in autumn’s fullness,\nThe Han’s phoenix pipes and cranes are heard no more.\nAt dawn’s awakening from a west wind dream,\nHalf the mortal world is blown into clouds.\n\n*Record of Mei Immortal’s Temple Concluded*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "梅仙观记 经名：梅仙观记。 南宋场智远编。 一卷。 底本出处：《正统道藏》洞玄部记传类。 梅仙观记 梅仙事实 仙坛观道士杨智远编 昔梅仙君，河南寿春府人，名福，字子真。 乃西汉成帝时受命洪州南昌县尉，居官清节，志厌浮华，每以恤民为念，未尝加鞭朴於民。 时值王莽作乱，僭窃神器，王凤专政浸盛，灾异数见，群下莫不言。 福不忍天下生灵坐於涂炭，乃奋忠义之气，上《灾异书》以陈治乱。 书日：臣闻箕子佯狂於商而为周陈洪范，叔孙通遁秦归汉，制作仪品。 夫叔孙先非不忠也。 箕子非疏其家而畔其亲也，不可与言也。 昔高祖纳善，如不及从谏，若转园，听言不求其能，举功不考其素。 陈平起於亡命而为谋主，韩信拔於行陈而建上将，故天下之士云合归汉，争进奇异。 知者竭其策，愚者尽其虑，勇士极共节，怯夫勉其死。 合天下之知，并天下之威，是以举秦如鸿毛，取楚如拾遗，此高祖所以无敌於天下也。 孝文皇帝起於代谷，非有周召之师，伊吕之佐也。 循高祖之法加以恭俭。 当此之时，天下几平，县是言之，循高祖之法则治，不循则乱，何者？ 泰为无道，削仲尼之迹，灭周公之轨，坏井田，除五等，礼废乐崩，王道不通，故欲行王道者，莫能致其功也。 武帝好忠谏说，至言出爵，不待廉茂庆赐不须显中，是以天下布衣各厉志竭精以赴阙庭，自街斋者不可胜数。 汉家得贤於此为盛，使武帝听用其计，升平可致。 於是积尸暴骨，快心胡越，故淮南王安绿间而起。 所以计虑不成而谋议泄者，以众贤聚於本朝，故其大臣势陵，不敢和从也。 方今布衣乃窥国家之隙，见闻而起者，蜀郡是也，及山阳亡徒苏令之草蹈名都大郡，求党与索随和而无逃匿之意。 此皆轻量大臣，亡所畏忌。 国家之权轻，故匹夫欲与上争衡也。 士者，国之重器。 得士则重，失士则轻。 《诗》云：济济多士，文王以宁。 庙堂之议，非草茅所当言也。 臣诚恐身涂草野，尸并卒伍，故数上书求见，辄报罢。 臣闻齐桓之时有以九九见者，桓公不逆，欲以致大也。 今臣所言非特九九也，陛下距臣者三矣，此天下士所以不至也。 昔秦武王好力，任鄙叩关，自斋缪公行伯由余归德。 今欲致天下之士，民有上书求见者，辄使诣尚书，问其所言，言可采取者，秩以斗升之禄，赐以一束之帛，若此，则天下之士发愤懑吐忠言嘉谋，日闻於上，天下条贯，国家表裹，灿然可睹矣。 夫以四海之广，士民之数，能言之类至众多也。 然其俊杰指世陈政，言成文章质之先圣而不谬，施之当世合时务。 若此者，亦无几人。 故爵禄束帛者，天下之砥石，高祖所以厉世磨钝也。 孔子曰：工欲善其事，必先利其器。 至秦则不然。 张诽谤之钢以为汉，欧除倒持太阿，授楚其柄，故诚能勿失其柄。 天下虽有不顺，莫败调其锋，此武帝所以辟地建功为汉世宗也。 今不循伯者之道，乃欲以三代选举之法，取当世之士犹察伯乐之图，求麒骥於市而不可得，亦以明矣。 故高祖弃陈平之过而获其谋，晋文公召天王，齐桓用其佛，无益於时，不顾逆顺，此所谓伯道者也。 一色成体谓之醇，黑白杂合谓之驳，欲以承平之法治暴秦之绪，犹以乡饮酒之礼理军市也。 今陛下既不·纳天下之言，又加戮焉。",
      "translated_text": "**Record of Plum Immortal Abbey**\n\n**Title:** *Record of Plum Immortal Abbey*\n**Compiler:** Yang Zhiyuan of the Southern Song, Daoist of the Xiantan Abbey\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, Dongxuan Section, Records and Biographies Category\n\n---\n\n**Account of Plum Immortal’s Deeds**\n\nPlum Immortal, a native of Shouchun Prefecture in Henan, bore the name Fu and the style Zizhen. During the reign of Emperor Cheng of the Western Han, he was appointed magistrate of Nanchang County in Hongzhou. In office, he upheld purity and integrity, disdaining ostentation, and ever mindful of relieving the people’s burdens—never once resorting to the lash or cudgel.\n\nAt the time, Wang Mang usurped the imperial throne, while Wang Feng’s power grew unchecked. Omens of disaster multiplied, yet none among the court dared speak. Unable to bear the suffering of the realm’s people, Fu roused his loyal and righteous qi and submitted the *Memorial on Disasters and Portents* to expound on order and chaos.\n\nThe memorial read:\n\n*\"Your servant has heard that when Jizi feigned madness under the Shang, he later presented the* Hongfan *to the Zhou. Shusun Tong fled Qin to serve Han, where he devised rituals and regulations. Yet Shusun was no traitor, nor did Jizi forsake his kin to rebel—they simply could not speak freely. In former days, the High Ancestor heeded good counsel as if fearing delay, accepting remonstrance as readily as turning a millstone. He judged men not by their past but by their merit: Chen Ping, risen from outlawry, became chief strategist; Han Xin, plucked from the ranks, was named supreme general. Thus, the realm’s scholars flocked to Han, vying to offer their rarest insights. The wise exhausted their schemes, the dull their thoughts; the brave gave their all, the timid their lives. By uniting the realm’s wisdom and might, the High Ancestor overthrew Qin as lightly as plucking a feather and seized Chu as easily as gathering a lost item—this was how he became invincible.*\n\n*Emperor Wen arose from the frontier, lacking the ministers of Zhou or the counselors Yi and Lü. Yet by following the High Ancestor’s ways and adding frugality and reverence, he nearly pacified the realm. From this, we see: adherence to the High Ancestor’s path brings order; deviation brings chaos. Why? The Qin, devoid of the Dao, erased Confucius’s traces and obliterated the Duke of Zhou’s institutions. They destroyed the well-field system, abolished the five ranks, and let ritual and music collapse, blocking the royal Way. Thus, none who sought to restore it could succeed.*\n\n*Emperor Wu valued loyal remonstrance, rewarding forthright speech with rank. He did not wait for merit or favor to elevate men, so the realm’s commoners sharpened their resolve and exhausted their talents to serve the court. Petitioners thronged the streets in numbers beyond count. The Han’s flourishing of worthy men reached its peak under him. Had Emperor Wu heeded their counsel, supreme peace might have been achieved. Instead, corpses piled and bones lay exposed, as his heart delighted in distant conquests—spurring the rebellion of the Prince of Huainan. His plans failed and his schemes were leaked because the court’s assembled worthies left his ministers no room to dissent.*\n\n*Now, commoners perceive the state’s vulnerabilities and rise upon hearing rumors—witness the uprising in Shu Commandery, or the bandit Su Ling of Shanyang, who trampled great cities and commanderies, seeking allies without fear of capture. All this stems from their contempt for high ministers and lack of awe for authority. When the state’s power wanes, even a commoner dares challenge the throne.*\n\n*Scholars are the state’s treasures. Gain them, and the state grows weighty; lose them, and it grows light. As the* Book of Songs *says: ‘Abundant are the scholars, by whom King Wen found peace.’ Yet court deliberations are not matters for rustics like your servant to address. I fear my corpse may lie among the weeds and common soldiers, so I have repeatedly submitted memorials seeking an audience, only to be rebuffed each time.*\n\n*I have heard that when a man presented the nine-times-nine multiplication table to Duke Huan of Qi, the duke did not dismiss him, hoping to attract greater talent. What I offer is no mere arithmetic. Your Majesty has rejected me thrice—this is why the realm’s scholars do not come. In former times, King Wu of Qin prized strength, yet Ren Bi’s feat of lifting the gate bar and Duke Mu of Qin’s hegemony through You Yu’s counsel show that to attract the realm’s scholars, one must act: when commoners submit memorials seeking audience, let them be sent to the Ministry of State. Question them on their proposals; if their words are worthy, grant them even a meager stipend or a bundle of silk. Then the realm’s scholars will vent their frustrations, voice loyal words, and offer fine strategies, which will daily reach Your Majesty’s ears. The realm’s systems and the state’s inner and outer workings will become clear as day.*\n\n*With the vastness of the four seas and the multitude of scholars and people, those capable of speech are countless. Yet those who are truly outstanding—who can diagnose the age’s ills, craft words into enduring texts that align with the sages and suit the times—are few indeed. Thus, ranks, emoluments, and silk are the whetstones of the realm, by which the High Ancestor honed the dull and sharpened the blunt.*\n\n*Confucius said: ‘A craftsman who wishes to do good work must first sharpen his tools.’ The Qin did otherwise. They forged a law against slander to ensnare the Han, wielding the sword Tai’e upside down and handing its hilt to Chu. Yet if one does not lose the hilt, even if the realm resists, none can blunt its edge—this was how Emperor Wu expanded the realm and built his legacy as the Han’s martial paragon.*\n\n*Now, instead of following the hegemons’ path, you seek to employ the Three Dynasties’ methods of selecting scholars, as if examining Bo Le’s paintings to find a qilin in the marketplace—clearly impossible. Thus, the High Ancestor overlooked Chen Ping’s past to gain his strategies; Duke Wen of Jin summoned the Son of Heaven; Duke Huan of Qi employed Yi Ya, though it brought no immediate benefit. They disregarded propriety to seize opportunity—this is the hegemons’ Way.*\n\n*When a single hue forms the whole, it is called pure; when black and white mingle, it is called motley. To govern the Qin’s violent legacy with the laws of a peaceful age is like using the village drinking ceremony to manage a military camp. Now, Your Majesty neither heeds the realm’s words nor merely rejects them—you punish them as well.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1230,
      "start_sentence": 0,
      "end_sentence": 50,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.04229378700256,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\梅仙观记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "夫戴鹊遭害，则仁乌争逝，愚者蒙戮，则知士深退。 闻者愚民上疏多触不急之法，或下廷尉而死者众。 自阳朔‘以来，天下以言为讳，朝廷尤甚。 群臣皆顺承上旨，莫有执正，何以明其然也？ 取民之所上书，陛下之所善，试下之廷尉，廷尉必日：非所宜言，大不敬。 以此卜之一矣。 故京兆尹王章，资质忠直，敢面引廷争，孝元皇帝擢之以厉，直臣而娇曲朝，众至陛下戮及妻子，且恶，恶止其身，王章非有反畔之辜而殃及家，折直士之节，结谏臣之舌，旱臣皆知其非，然不敢争。 天下以言为戒，最国家之大患也。 愿陛下循高祖之轨，杜亡秦之路，数御十月之歌，逸之，戒除不急之法，下无讳之诏博。 谋及疏贱令深者、，不隐远者，不塞所谓辟四门明四目也。 且不急之法，诽谤之微者也。 往者。 不可及，来者犹可追。",
      "translated_text": "When the osprey suffers harm, the benevolent crows scatter in flight; when fools are punished, the wise withdraw in silence. Of late, the ignorant commoners who submit memorials often violate laws of no urgent consequence, and many have been sent to the Minister of Justice to die. Since the Yangshuo era, the realm has treated speech as taboo, and the court most of all. All officials comply with the imperial will, none dare uphold what is right—how can this be demonstrated? Take the memorials the people submit, even those Your Majesty approves of, and submit them to the Minister of Justice. He will surely declare: *\"This is improper speech, a grave act of disrespect.\"* Thus we see the proof.\n\nTherefore, Wang Zhang, the Metropolitan Governor, was by nature loyal and upright, daring to confront the throne in open remonstrance. Emperor Xiaoyuan of Han promoted him to encourage forthright ministers and correct the court’s crooked ways. Yet under Your Majesty’s rule, his punishment extended even to his wife and children. Even if one’s hatred were great, it should have stopped at his person. Wang Zhang committed no crime of rebellion, yet calamity befell his family. This broke the resolve of upright scholars and sealed the tongues of remonstrating ministers. All officials know this is wrong, yet none dare dispute it. When the realm takes speech as a warning, it becomes the state’s greatest peril.\n\nMay Your Majesty follow the High Ancestor’s path, block the road to Qin’s ruin, and heed the songs of the tenth month—let them be a lesson. Abolish laws of no urgent consequence and issue an edict removing all taboos, widely seeking counsel. Consult even the lowly and distant, neither concealing nor rejecting those far removed—this is what is meant by *\"opening the four gates and illuminating the four directions.\"* Moreover, laws of no urgent consequence are but the slightest form of slander. What is past cannot be recovered, but what lies ahead may yet be pursued.",
      "overlap_context": "Heaven; Duke Huan of Qi employed Yi Ya, though it brought no immediate benefit. They disregarded propriety to seize opportunity—this is the hegemons’ Way.*\n\n*When a single hue forms the whole, it is called pure; when black and white mingle, it is called motley. To govern the Qin’s violent legacy with the laws of a peaceful age is like using the village drinking ceremony to manage a military camp. Now, Your Majesty neither heeds the realm’s words nor merely rejects them—you punish them as well.\"*",
      "start_char": 1230,
      "end_char": 1551,
      "start_sentence": 51,
      "end_sentence": 63,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.896289348602295,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\梅仙观记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "＇方今君命犯而主威夺，外戚之权日以益隆。 陛下不见其形，愿察其景。 建始以来，日蚀、地震，以率言之三倍，春秋水灾妄兴比数，阴盛阳微，金铁为飞，此何景也。 汉兴以来，社稷三危，吕霍上官，皆母后之家也。 亲亲之道，全之为右，当与之贤师良传，教以忠孝之道。 今乃尊宠其位，授以魁柄，使之骄逆，至於夷灭，此失亲亲之大者也。 自霍光之贤，不能为子孙虑，故权臣易世则危。 《书》日：无若火始庸庸，势陵於君。 权隆於主，然后防之，亦无及已。 又言：国舅王曼事，帝俱不纳，复建三统。 《书》曰：臣闻不在其位，不谋其政。 政者，职也。 位卑而言高者，罪也。 越职触罪，危言世患虽伏质横分，臣之愿也。 守职不言．’没齿身全，死之、日，尸未腐而名灭，虽有景公之位，伏柜千驷，臣不贪也。 故愿壹登文石之陛，涉赤墀之涂，当户牖之法坐，尽平生之愚虑，无益於时； 有遗於世，此臣寝所以不安，食所以忘味也。 愿陛下探省臣言。 臣闻存人所以自立也，壅人所以自塞也，善恶之报各如其事。 昔者秦灭二周，夷六国，隐士不显，逸民不举，绝三统，灭天道，是以身危子杀，厥孙不嗣，所谓壅人以自塞也。 故武王克殷，未下车存五帝之后，封殷於宋，绍夏於杞，明着三统，示不独有也。 是以姬姓半天下，迁庙之主流出於户，所谓存人以自立者也。 今成汤不祀，殷人无后，陛下继嗣久微，殆为此也。 《春秋经》日：宋杀其大夫。 《谷、梁传》言其不称名姓，以其在祖位，尊之也。 此言孔子故殷后，虽不正统，封其子孙以为殷，后礼亦宜之，何者？ 诸侯夺宗，圣庶夺嫡。 《传》曰：贤者子孙宜有土，而况圣人，又殷之后哉？ 昔成王以诸侯礼葬周公而皇天动威，雷风着灾，今仲尼之庙不出阙里，今孔氏子孙不免编户以圣人而饮匹夫之祀，非皇天之意也。 今陛下诚能据仲尼之素功以封其子系，则国家必获其福。 又陛下之名与天无极，何者？ 追圣人素功，封其子孙，未有法也。 后圣必以为，则不灭之名可不勉哉。 帝亦不报，於是有归休之志。 乌乎！ ．所谓臣之於君再三谏而不从则逃之，此岂虚言哉。 遂解衣挂冠束都门，纳官弃妻子，去九江，恐国舅摄之，易姓名为昊门市卒，以保其身。 厥后求师慕道，访山采药，多隐名山广谷之间，尝与张留侯子房，执版唱《无生曲》，以快其情也。 访鸦荡诸山，即会稽之南也。 游南闽，入支提山修炼数年未就，为尼所触，愤然曰：灵丹九转，愈久愈精，何厌成功之晚。 遂入仙霞山即武夷之东也。 彷徨乎无人之境，逍遥乎尘埃之外。 猿啼古木，虎啸幽岩，有竹曰瘦腰，有草名黄芽，灵苗异种，杂然莫能尽识，遂依岩结庵，坚心苦志，辟谷餐松，慕学神仙，积有年矣。 每望闽粤问有紫气，颇异，复往建城立坛修炼。 未几，一日山色淇蒙，烟霞满室，瑞气浮空，紫云盖覆於山顶。 天乐嘹晓，有一神人语福日：空洞仙君至。 须央，仙乐近，仙君临，福拜而迎之。 仙君日：念子学道志坚，吾故下临，授汝外烧内炼还返大丹之法，九老仙都济世之文，汝可择名山依法修炼，方得成仙。 言竟而梅君谢焉。 彩云散空，天乐自呜，仙君乃隐隐而去，梅君精视天文数目，下山行济世之法，无不灵验。",
      "translated_text": "Here the imperial mandate is violated and the sovereign’s authority usurped, while the power of the empress’s kin grows daily more exalted. Though Your Majesty may not perceive its form, I pray you discern its shadow. Since the Jianshi era, solar eclipses and earthquakes have tripled in frequency, while the Springs and Autumns record floods rising without number. Yin waxes strong and yang wanes; bronze and iron take flight—what shadow is this?\n\nSince the founding of Han, the altars of state have thrice been imperiled: by the Lü, the Huo, and the Shangguan—all houses of the empress dowager. The Way of kinship holds preservation as its highest principle; one should appoint them worthy tutors and virtuous mentors, instructing them in the Dao of loyalty and filial piety. Yet now they are exalted in rank and entrusted with the reins of power, bred to arrogance and rebellion, until they are exterminated—this is the gravest failure of kinship.\n\nEven the worthy Huo Guang could not secure his descendants; thus, when power passes to a new generation, ministers become perilous. The *Book of Documents* says: *\"Do not let fire begin as a mere spark, lest its force overmaster the lord.\"* When power surpasses the sovereign’s, then to block it comes too late. It also states: *\"I have heard that one not in office does not meddle in its governance.\"* Governance is a charge; for one of low station to speak of lofty matters is a crime. To overstep one’s charge and incur guilt, to utter perilous words though the age’s ills lie hidden and fate’s threads are tangled—this is my wish. To guard one’s charge and remain silent, to live out one’s days in bodily safety, to die and have one’s name perish before the corpse decays—even were I offered Duke Jing’s rank, a thousand chariots in submission, I would not covet it.\n\nThus I long to ascend the steps of carved stone, tread the vermilion path, sit in judgment at the court’s gate, and pour forth my lifelong folly. Though it may bring no benefit to the times, if it leaves some trace for the world, this is why my sleep is restless and my meals tasteless. I pray Your Majesty examine my words.\n\nI have heard that to preserve others is to establish oneself, while to stifle others is to block one’s own path. The retribution of good and evil follows their deeds. Of old, Qin destroyed the Two Zhous and annihilated the Six States, leaving recluses unrecognized and hermits unraised. It severed the Three Sequences and extinguished the Heavenly Dao, and so its ruler perished, his son was slain, and his grandson left no heir—this was stifling others to block its own path.\n\nThus when King Wu conquered Yin, before descending from his chariot he preserved the descendants of the Five Emperors, enfeoffed Yin at Song, and continued Xia at Qi, making the Three Sequences manifest to show he did not hold them alone. Thus the Ji clan ruled half the realm, and the ancestral tablets of dethroned houses flowed out through the doors—this was preserving others to establish oneself. Now Cheng Tang is unvenerated, and the Yin people have no descendants; Your Majesty’s line has long been diminished, and this is likely the cause.\n\nThe *Spring and Autumn Annals* states: *\"Song executed its grandee.\"* The *Guliang Commentary* notes that his name and lineage were not recorded because he held an ancestral position and was thus honored. This shows that Confucius, though not of the orthodox line, enfeoffed the descendants of Yin as its heirs. The rites should follow this precedent—why? When feudal lords usurp their clans, when the worthy and the base contest the succession, the *Commentary* says: *\"The descendants of the worthy should hold land—how much more so the descendants of sages, and moreover those of Yin?\"*\n\nOf old, King Cheng buried the Duke of Zhou with the rites of a feudal lord, and august Heaven displayed its might with thunder and wind, revealing its displeasure. Yet now the temple of Confucius does not stand beyond the gates of Queli, and the descendants of the Kong clan, though sages, are not spared the status of commoners, offering sacrifices as mere common folk—this is not the will of august Heaven. If Your Majesty could truly honor Confucius’s enduring merit by enfeoffing his descendants, the state would surely reap its blessings.\n\nMoreover, Your Majesty’s name would be boundless as Heaven—why? To honor a sage’s enduring merit by enfeoffing his descendants is without precedent. Future sages will surely take this as their model; can an undying name not be pursued? The emperor did not respond, and so he harbored thoughts of retreat.\n\nAlas! The saying goes: *\"When a minister remonstrates two or three times and is not heeded, he should flee.\"* Was this empty words? He removed his robes, hung his cap at the capital’s eastern gate, resigned his office, abandoned his wife and children, and departed for Jiujiang. Fearing the empress’s kin would seize him, he changed his name and became a gatekeeper in Wu. Later, he sought teachers and pursued the Dao, wandering mountains and valleys in search of herbs. Once, he joined Zhang Liang’s descendant, Lord Zifang, holding a tablet and chanting the *\"Song of No-Birth\"* to delight his heart.\n\nHe visited the Yaodang Mountains—south of Kuaiji—and traveled to southern Min, entering Zhiti Mountain to cultivate himself for years without success. When a nun disturbed him, he exclaimed in frustration: *\"The elixir of nine refinements grows purer with time—why begrudge the lateness of its perfection?\"* He then entered Xianxia Mountain, east of Wuyi. Wandering where no man dwelt, roaming beyond the dust of the world, he heard apes cry in ancient trees and tigers roar in secluded crags. There were bamboos called *\"Slender Waist\"* and herbs named *\"Yellow Sprout,\"* rare shoots and strange plants too numerous to know. He built a hut by the cliffs, steadfast in resolve, fasting and eating pine nuts, aspiring to the immortals’ arts, accumulating years in this pursuit.\n\nOften gazing toward Min and Yue, he saw a strange purple vapor and returned to Jiancheng to establish an altar and refine his practice. Before long, one day the mountains were veiled in mist, rosy clouds filled the chamber, auspicious vapors floated in the air, and purple mists shrouded the peak. Heavenly music resounded, and a divine voice declared: *\"The Cavernous Immortal Lord approaches.\"* Soon the immortal music drew near, and the Immortal Lord descended. He bowed in welcome, and the Immortal Lord said: *\"Moved by your steadfast resolve in seeking the Dao, I have descended to grant you the method of external refinement and internal cultivation, the Great Elixir of Return, and the *Nine Elders’ Writ of the Immortal Capital for Saving the World*. Choose a sacred mountain and cultivate according to this method, and you will attain immortality.\"* When he finished speaking, Mei bowed in gratitude. The colored clouds dispersed, the heavenly music faded, and the Immortal Lord vanished into the distance.\n\nMei studied the celestial patterns and numbers, descended the mountain, and practiced the arts of saving the world—all proved efficacious.",
      "overlap_context": "’s ruin, and heed the songs of the tenth month—let them be a lesson. Abolish laws of no urgent consequence and issue an edict removing all taboos, widely seeking counsel. Consult even the lowly and distant, neither concealing nor rejecting those far removed—this is what is meant by *\"opening the four gates and illuminating the four directions.\"* Moreover, laws of no urgent consequence are but the slightest form of slander. What is past cannot be recovered, but what lies ahead may yet be pursued.",
      "start_char": 1551,
      "end_char": 2770,
      "start_sentence": 64,
      "end_sentence": 113,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.31615614891052,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\梅仙观记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "初至鹦笼山修炼被尸鬼相魔。 次至毛竹洞，夜梦神人日：此山非先生修炼之所。 遂入演仙山修炼，又为野火所烧。 继往玉华山修炼，昔神人居焉。 方欲修炼而旱贼四起。 次至乌石山修炼，樵妇触之。 梅君叹日：道缘浅博，障魔掌起。 遂再行济世之法数年，至剑江西岭修炼。 一日祥云瑞气，覆於山巅，开房视之，乃道师空洞君降。 梅君拜而迎之，告道师日：弟子恭依师旨，广行济世之法，游历名山修炼，多为魔苦，适至於此。 道师日：汝之道绿在飞鸿山也。 再授汝八神却魔灵丹。 乃召二光童子，控赤骊白马於山前，君可急乘马领童，至飞鸿山精修，成功之日，吾当举汝，使汝骨像同升也。 言讫，道师隐於云中。 梅君遂乘马领童，至飞鸿山卓庵修炼。 千日，神游体外，丹光烛天而道成矣。 遂开炉出丹，一丸祭天，天神收之； 一丸祭地，地神护之； 一丸自服，服讫拜谢天地毕，地神奏於三官，三官奏闻天阙，言西汉梅福成道於飞鸿山。 梅君乃乘白马领童欲回九江，二童马前抚掌吟诗。 隐於山溪巨石之下。 须臾，红光射日，紫雾漫＇空，甘露天花，一时飞降。 云中仙乐嘹晓，金童持节，玉女执婶，力士控鸾，侍仙捧诏，向梅君日：天阙诏下，令汝乘鸾上升。 梅君拜谢天恩，弃马乘鸾升天而去，白马坠於水中。 自后飞鸿山号日梅仙山是也。 山之西有坠马州，三十里有遗鞭曹山，山之下有登仙里，山之东溪有逃童石、胶马波．山之侧有甘露源，山之后有天，花岭，石上有花迹。 自后乡人号日岭石岭是也。 至今丹光隐伏犹存山根，有梅看道院，崇奉香火？ 自后浮屠占之为居址，弃仙像塑佛像，改名观音院，将梅仙像移入开山堂。 安奉郡之民相传只呼梅仙院，不从其额。 其院中有护法五圣公显灵立庙院侧，人只呼作梅君庙。 梅君同其名乃仙圣迹也。 自汉至今，一历二十二丙寅矣。 自元始中至今，真元二年丙申计壹千二百五十九年不泯矣。 ＇时依建宁府梅仙堂传本，彼有梅山炼丹之所，故云尔。 碑文 梅先生碑",
      "translated_text": "At first, he arrived at Parrot Cage Mountain to cultivate, but was plagued by corpse-demons and malevolent spirits. Next, he came to Mao Bamboo Grotto, where in a nighttime dream a divine being said: *\"This mountain is not the place for your cultivation.\"* He then entered Perfected Immortal Mountain to cultivate, only to have his retreat burned by wildfire. Proceeding to Jade Flower Mountain to cultivate, he found that immortals had once dwelt there, but just as he began his practice, bandits arose on all sides due to drought. He next went to Black Stone Mountain to cultivate, where he was disturbed by a woodcutter’s wife.\n\nMei sighed and said: *\"My karmic affinity with the Dao is shallow and vast, while obstacles and demons arise in throngs.\"* He then resumed his arts of saving the world for several years, until he reached the western ridge of Sword River to cultivate. One day, auspicious clouds and propitious qi gathered over the mountain’s peak. Opening his chamber to look, he saw his Dao-master, the Cavernous Immortal Lord, descending. Mei bowed in welcome and addressed his master: *\"Your disciple has reverently followed your instructions, widely practicing the arts of saving the world and traveling through famous mountains to cultivate, yet I have suffered many demonic afflictions and have only now arrived here.\"*\n\nThe Dao-master said: *\"Your karmic affinity with the Dao lies at Flying Swan Mountain. I now grant you the Eight Spirit Demon-Repelling Elixir.\"* He then summoned two Radiant Lads, who led a crimson steed and a white horse before the mountain. *\"Hasten to mount the horse and lead the lads to Flying Swan Mountain for dedicated cultivation. On the day of your success, I shall raise you up, that your bones and form may ascend together.\"*\n\nWhen he finished speaking, the Dao-master vanished into the clouds. Mei then mounted the horse and led the lads to Flying Swan Mountain, where he established a hermitage to cultivate. After a thousand days, his spirit wandered beyond his body, and the radiance of his elixir illuminated the heavens—his Dao was accomplished. He then opened the furnace and took out the elixir: one pellet he offered to Heaven, and the celestial spirits received it; one pellet he offered to Earth, and the earth spirits guarded it; one pellet he consumed himself. After ingesting it, he bowed in thanks to Heaven and Earth. The earth spirits reported to the Three Officials, who in turn memorialized the Heavenly Palace, announcing that Mei Fu of the Western Han had attained the Dao on Flying Swan Mountain.\n\nMei then mounted his white horse and led the lads, intending to return to Jiujiang. The two lads clapped their hands before the horse and chanted a poem, then concealed themselves beneath a massive boulder by the mountain stream. In an instant, a red glow shot toward the sun, purple mist suffused the sky, sweet dew and heavenly flowers descended all at once. From the clouds, immortal music resounded, golden lads bearing tablets and jade maidens holding sashes appeared, while mighty immortals drove phoenix chariots and attendants bore the imperial edict. They addressed Mei: *\"The Heavenly Palace has issued a decree, commanding you to mount the phoenix and ascend.\"*\n\nMei bowed in gratitude for the celestial grace, abandoned his horse to mount the phoenix, and ascended into the heavens. The white horse fell into the waters below. Thereafter, Flying Swan Mountain was called Plum Immortal Mountain. To its west lay the Sinking Horse Shoals; thirty *li* away stood the Whip-Dropping Cao Mountain; below the mountain was the Ascent-to-Immortality Hamlet. To the east of the mountain’s stream were the Runaway Lad Stone and the Glue-Horse Waves. Beside the mountain was the Sweet Dew Spring; behind it, the Heavenly Flower Ridge, where flower traces remained on the stones. The locals thereafter called it Ridge Stone Ridge.\n\nTo this day, the elixir’s radiance lingers hidden at the mountain’s root. There stands the Plum Contemplating Dao Abbey, where incense and offerings are reverently maintained. Later, Buddhist monks occupied it as their dwelling, discarded the immortal statues to sculpt Buddha images, and renamed it Guanyin Abbey, moving the statue of Plum Immortal into the Founder’s Hall. The people of the prefecture, however, continued to call it Plum Immortal Abbey, ignoring the new name. Within the abbey, the Five Guardian Saints manifested their numinous power and established a temple beside it, which people simply called the Lord Mei Temple. Lord Mei’s name and the traces of his immortality remain sacred.\n\nFrom the Han to the present, twenty-two *bingyin* years have passed. From the Yuan Shi era to the present, in the second year of the Zhenyuan reign, the *bingshen* year, one thousand two hundred and fifty-nine years have elapsed without fading. At the time, this account followed the transmission of the Plum Immortal Hall in Jianning Prefecture, where the Plum Mountain Elixir-Refining Site was located—hence its inclusion.\n\n**Stele Inscription: The Stele of Master Mei**",
      "overlap_context": ", the Great Elixir of Return, and the *Nine Elders’ Writ of the Immortal Capital for Saving the World*. Choose a sacred mountain and cultivate according to this method, and you will attain immortality.\"* When he finished speaking, Mei bowed in gratitude. The colored clouds dispersed, the heavenly music faded, and the Immortal Lord vanished into the distance.\n\nMei studied the celestial patterns and numbers, descended the mountain, and practiced the arts of saving the world—all proved efficacious.",
      "start_char": 2770,
      "end_char": 3534,
      "start_sentence": 114,
      "end_sentence": 150,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.053220748901367,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\梅仙观记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "唐浙钥东道观察判官检校户部郎中兼御史中丞赐紫金鱼袋罗隐撰 汉成帝时，纲纪头壤，先生以书谏天子者再三。 夫火政须去，而剑履问健者犹数百位，尚不能为国家出力以断佞臣头，复何南昌故吏，愤愤於其下。 得非南昌远地也，尉下僚也苟触天子纲，突幸臣牙，止於趣一狂人侳一单族而已。 彼公卿大臣．有生杀喜怒之任，有朋党蕃愆之大，至於出一言，作一事，必与妻子谋。 －苟不便其家，虽妾人婢子亦樱挽相制，而况亲戚乎？ 况骨肉乎？ 故虽有忧社穗心，亦噤而不吐也。 乌乎！ 宠禄所耻劝功，而位大者，不语朝廷事，是以天下有道则正人在上，天下无道则正人在下。 予读先生书，未尝不为汉朝公恤很。 今南游复过先生里，吁何为道之多也。 书梅先生碑阴　　　大山萧山明 丰城梅仙山道观、有梅先生碑，唐诗人罗隐文也。 昨观与碑俱会，道士熊应祥升力鼎新之，碑再立。 、友罗永之来，委予书之。",
      "translated_text": "**Composed by Luo Yin, Tang Dynasty Inspector of the Eastern Circuit of Zhejiang, Concurrently Supervisor of the Ministry of Revenue and Palace Censor-in-Chief, Bestowed with the Purple Gold Fish Bag**\n\nDuring the reign of Emperor Cheng of Han, when the governance of the realm had fallen into decay, Master Mei repeatedly submitted memorials to admonish the Son of Heaven. The fire of governance demanded extinguishing, yet those who inquired after the vigor of swords and boots still numbered in the hundreds—yet they could not muster the strength to sever the heads of treacherous ministers for the state. How much less could the former subordinates of Nanchang, seething in their lowly stations below, achieve? Was it not because Nanchang was a distant land, and its constables mere petty officials? Had they but brushed against the imperial net or provoked the fangs of favored courtiers, they would have succeeded only in hastening the ruin of a madman and the annihilation of a single clan.\n\nAs for the high ministers and great officials—those entrusted with the power over life and death, joy and wrath, and burdened with the weight of cliques and transgressions—when they spoke a word or undertook a deed, they first consulted their wives and children. If it displeased their household, even the lowliest concubine or maidservant would obstruct and restrain them, let alone their relatives or kin. Thus, though they might harbor concern for the altars of soil and grain, they sealed their lips and uttered nothing.\n\nAlas! Those who are shamed by favor and emolument, who occupy high office, yet dare not speak of court affairs—this is why, when the realm follows the Dao, upright men hold high positions, and when the realm strays from the Dao, upright men are cast down.\n\nReading Master Mei’s writings, I have never failed to lament for the Han court. Now, on my southern journey, I pass once more through the Master’s homeland—how abundant is the Dao here! I inscribe this on the reverse of the Stele of Master Mei.\n\n**Inscribed by Ming Fengshan of Dashan in Xiaoshan**\n\nThe Daoist Abbey of Plum Immortal Mountain in Fengcheng possesses the Stele of Master Mei, composed by the Tang poet Luo Yin. Recently, upon revisiting the stele, I found it accompanied by an inscription. The Daoist Xiong Yingxiang exerted himself to renovate it, and the stele was re-erected. My friend Luo Yongzhi came and entrusted me with this inscription.",
      "overlap_context": "immortality remain sacred.\n\nFrom the Han to the present, twenty-two *bingyin* years have passed. From the Yuan Shi era to the present, in the second year of the Zhenyuan reign, the *bingshen* year, one thousand two hundred and fifty-nine years have elapsed without fading. At the time, this account followed the transmission of the Plum Immortal Hall in Jianning Prefecture, where the Plum Mountain Elixir-Refining Site was located—hence its inclusion.\n\n**Stele Inscription: The Stele of Master Mei**",
      "start_char": 3534,
      "end_char": 3902,
      "start_sentence": 151,
      "end_sentence": 166,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.630539894104004,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\梅仙观记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "问之日：君昭谏远孙，扬前文人文勤如是为楷书，竟思汉事，追叹之。 乌乎！ 天欲枫亡汉之天下，故生一福之贤界之。 汉弃天福，乃弃人之福，两自弃，是自祸也。 金铁交飞，天无如汉何？ 老凤变妖，汉亦无如新之移汉何？ 乌乎！ ．失士则亡，得士则存，存以从诤，亡以玩言。 壮哉气节，贯于乾坤，视我泥土，藏我琪墦。 辞汉去坐，隐昊市门，驰迹仙路，诉情帝合。 泯泯者刘，长空无痕，永永者梅，褊祠共尊。 祠碑可灰，仙道不墦，青瑶重镌，可字可扪。 昭谏有知，醒如冰魂。 子真如生，日月不昏。 咸淳六年岁在庚午六月朔。 书梅先生碑后　　　小山荒泰来 读昭谏碑，非惟得先生心，抑增先生气。 今梅坛在处有之，尊其人故多其祠。 苏长公有云：神在天下，如水之在地中，无所往而不在耶。 宋勃诰 尚书省牒",
      "translated_text": "Pondering this, I ask: You, Zhaojian’s distant descendant, have so diligently preserved the calligraphy of former scholars and men of letters—why then do you still dwell upon the affairs of Han, sighing in lament?\n\nAlas! When Heaven willed the downfall of Han’s realm, it first raised up a single boundary of worthy men. Yet Han spurned Heaven’s blessing, and thus spurned the blessing of men—abandoning both, it brought ruin upon itself. Though bronze and iron clashed in flight, what could Heaven do for Han? Though an aged phoenix turned monstrous, what could Han do to resist Xin’s usurpation?\n\nAlas! To lose the worthy is to perish; to gain the worthy is to endure. Survival comes through heeding remonstrance; ruin comes through indulging flattery. How majestic the integrity—piercing heaven and earth! Compared to such men, we are but mud and dust; beside them, we are buried in humble graves.\n\nWhen he left his seat to depart from Han, he concealed himself at the market gate of Hao; when he set his tracks upon the immortal’s path, he poured out his grievances before the Celestial Threshold. The House of Liu faded into obscurity, leaving no trace in the vast sky; the legacy of Mei endures forever, honored in shrines far and wide. Though the shrine’s stele may crumble to ash, the immortal’s Dao cannot be buried. Now, with fresh carving on green jade, its words may once more be read and traced by hand.\n\nIf Zhaojian’s spirit yet lingers, may it awaken like ice-clear soul. If Master Mei yet lives, may sun and moon remain undimmed.\n\nInscribed in the sixth month of the first day of the *gengwu* year of the Xianchun reign [1270].\n\n**Inscribed on the reverse of the Stele of Master Mei by Xiaoshan Huang Tailai**\n\nReading the Stele of Zhaojian, one not only grasps the Master’s heart but also feels his *qi* grow stronger. Today, Plum Altars exist wherever his name is revered, and his shrines multiply in honor of the man. As Su Changong once said: “The spirit pervades the world like water in the earth—is there any place it does not reach?”\n\n**Official Document of the Ministry of Rites, Song Dynasty**",
      "overlap_context": "abundant is the Dao here! I inscribe this on the reverse of the Stele of Master Mei.\n\n**Inscribed by Ming Fengshan of Dashan in Xiaoshan**\n\nThe Daoist Abbey of Plum Immortal Mountain in Fengcheng possesses the Stele of Master Mei, composed by the Tang poet Luo Yin. Recently, upon revisiting the stele, I found it accompanied by an inscription. The Daoist Xiong Yingxiang exerted himself to renovate it, and the stele was re-erected. My friend Luo Yongzhi came and entrusted me with this inscription.",
      "start_char": 3902,
      "end_char": 4230,
      "start_sentence": 167,
      "end_sentence": 187,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.382070541381836,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\梅仙观记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "中书省奏尚书省送到柯部奏：据太常寺状、准送下镇南军奏状，据丰城县申勘会到宣风乡南岐里梅仙坛观，委是国家逐年祭醮，每遇水早，人民祈梼，皆有感应。 委得诣实州司检会。 昨据梅仙坛观道士杨智远状，本观元系汉朝梅福遗迹之所，古坛、丹井、庵基见存，观宇已是汉代兴建，名垂典祀，乞奏闻赐真君名号。 州司所据前项申述，切以福之伟节忠论，布在史策，可考而见。 晚避逆莽，弃妻子，去一九江，全性昊市门，世传以为仙，今遗迹具存，观宇严饬，水旱疾疠，有梼即应。 伏望特赐宠号，以称远民祈报之意。 会到本州自来只称呼梅真人，当寺参详，汉朝梅福真人加封申候指挥。 本部今据太常寺状伏候劫旨。 元丰年。 加封",
      "translated_text": "The Ministry of State Affairs petitions the Ministry of Rites regarding the document forwarded by the Ministry’s Bureau of Sacrifices: According to a report from the Court of Imperial Sacrifices, and in accordance with the memorial submitted by Zhen’nanjun, an investigation by Fengcheng County confirms that the Plum Immortal’s Altar Daoist Abbey in Nanqi Village, Xuanfeng Township, has been the site of annual state sacrifices for generations. Whenever floods or droughts afflict the people, their prayers here are invariably answered with efficacy. The matter has been verified and recorded by the prefectural authorities.\n\nPreviously, Daoist Yang Zhiyuan of the Plum Immortal’s Altar Abbey submitted a report stating that the abbey originally stood upon the former dwelling of Mei Fu of the Han dynasty. The ancient altar, cinnabar well, and hermitage foundations remain extant, and the abbey itself was first established in the Han era. Its name has long been enshrined in canonical sacrifices, and he now petitions that the throne bestow upon it the honorific title of *Zhenjun*.\n\nThe prefectural authorities, having reviewed the foregoing submission, note that Mei Fu’s towering integrity and loyal remonstrances are recorded in the historical annals for all to see. In his later years, he fled the usurper Wang Mang, abandoning wife and children to vanish into the marketplace of Wu, where he preserved his nature in obscurity. The world has since transmitted his story as that of an immortal, and his legacy endures in the very site of his retreat. The abbey stands in solemn order, and in times of flood, drought, or pestilence, prayers offered here are met with swift response. It is humbly hoped that a special honorific title may be conferred to accord with the distant people’s gratitude and devotion.\n\nThe prefecture has hitherto addressed the site only as “Master Mei the Realized One.” This Court, having deliberated, proposes that the Han dynasty’s Mei Fu the Realized One be granted an additional enfeoffment, pending imperial instruction.\n\nThis Bureau now submits the report of the Court of Imperial Sacrifices for the imperial decision.\n\n*Enfeoffment granted in the Yuanfeng reign [1078–1085].*",
      "overlap_context": "he Xianchun reign [1270].\n\n**Inscribed on the reverse of the Stele of Master Mei by Xiaoshan Huang Tailai**\n\nReading the Stele of Zhaojian, one not only grasps the Master’s heart but also feels his *qi* grow stronger. Today, Plum Altars exist wherever his name is revered, and his shrines multiply in honor of the man. As Su Changong once said: “The spirit pervades the world like water in the earth—is there any place it does not reach?”\n\n**Official Document of the Ministry of Rites, Song Dynasty**",
      "start_char": 4230,
      "end_char": 4517,
      "start_sentence": 188,
      "end_sentence": 197,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.055747985839844,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\梅仙观记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "牒奉劝：梅福在汉之际，数以孤远极言天下之事，其志壮哉。 晚而家居，读书养性，卒於遗俗高蹈，世传为仙。 今大江之西，实存庙像梼祠，辄应能泽吾民。 有司上闻，是用锡兹显号，光灵不泯其服。 朕恩宜特封寿春真人，牒至准劫，故牒。 元丰五年七月。 尚书礼部 勘会近据尚书省送下录黄镇南军丰城县梅仙观汉朝梅福劫：特封寿春真人，其劫牒令本观收掌及差官往彼，精虔祭告，及造牌额安挂，已符本处，具已施行及收管。 劫：牒文状申省去讫，今来多日未见回申。 须议催促镇南军主者，详前去今来符内事理，疾速回申，不管准前稽迟，符到奉行。 元丰五年八月士百。 洪州 元丰五年八月二十三日，准本年七月二十九日太常寺牒，准尚书礼部符，准元丰五年七月十八日尚书省送下画黄，中书省奏尚书省送到祠部奏，据太常寺状，准送下镇南军奏状，据丰城县申勘到宣风南岐里梅仙坛观，委是国家逐年祭醮，每遇水旱，人民祈梼，皆有感应。 委是诣实州司检会。 昨据寿圣梅仙观道士杨智远状，本观元系汉朝梅福遗迹之所，古坛、丹井、庵基见存，观宇乃是汉代兴建，名垂典祀，乞奏闻赐真君名号，州司所据前项申述，切以福之伟节忠论，布在史策，可玫而知，晚避逆莽，弃妻子，去九江，全性昊市门，世传以为仙。 今遗迹具存，观宇严饰，水旱疾疠，有梼辄应。 伏望特赐宠号，以称远民祈报之意。 会到本州自来只称号梅真人，当寺参详。 汉朝梅福真人加封申候指挥，本部今据太常寺状，伏候劫旨，今月十四日奉圣旨，如前应有合行事件检会旧例施行，奉劫如右牒到奉行前批已降劫命封号，讫七月十八日未时付礼部。 依圣旨，指挥施行仍关合属去处，太常寺主者详画黄指挥应有合行事件，疾速施行，符到奉行，牒到请详前项，尚书礼部符内圣旨指挥施行者。 劲梅福在汉朝之际，数以孤远极言天下之事，其志壮哉，晚而家居，读书养性，卒於遗俗高蹈，世传为仙。 今大江之西实存庙像，祷祠辄应，能泽吾民，有司上闻，是用锡兹显号，光灵不泯其服，朕思宜特封寿春真人。 元丰五年九月。 洪州 所准尚书礼部符内详画黄指挥差官往丰城县寿圣梅仙坛观，精虔祭告，劫封寿春真人，及造牌额安挂。 其所降到劫牒，令本观收掌，讫具已施行收管文状申省者，右具上件牌额，州司制造，用金贴字号，已於今月十九日了当，交付本观道士归观及差人责祭文，一道前去外帖。 丰城知县张长官仰照会候到依时尚书礼部符内前项指挥，速便前去本观，精虔祭告及安挂牌额，讫具事状申州。 元丰五年十月九日。 劫：朕向巡狩於南国，以豫章为束，朝母后率掖庭而行舟楫，冒风波之险，凡所经涉，必有护持，爰锡褒恩，以答神既。 洪州丰城大江北岸梅福升仙坛观寿春真人，正谏不用，高名独存，悯汉室之不纲，去昊市而不返，既严祠馆亦赐封名，兹复益於美称，益少敷於新渥，其饮异眷，用慰平生，可特封寿春吏隐真人，奉劫如右牒到奉行。 绍与二年闰四月十八日。 题咏",
      "translated_text": "By imperial decree:\n\nDuring the Han dynasty, Mei Fu repeatedly voiced solitary yet far-reaching admonitions on the affairs of the realm—how resolute was his spirit! In later years, he retired to his home, devoting himself to study and the cultivation of his nature, ultimately transcending worldly custom in lofty withdrawal. The world has since transmitted his story as that of an immortal. To this day, west of the Great River, his temple image and shrine remain, where prayers are met with swift response, bringing blessings to our people. The local authorities having reported this, We now bestow this illustrious title to honor his enduring spiritual power. We deem it fitting to specially enfeoff him as the Realized One of Shouchun.\n\nThis decree is hereby issued for implementation.\n\n*Fifth year of the Yuanfeng reign, seventh month.*\n\n---\n\nThe Ministry of Rites has examined the recent submission from the Secretariat-Chancellery, which forwarded the imperial rescript from Zhen’nanjun concerning Fengcheng County’s Mei Immortal Abbey. The rescript commands the enfeoffment of Mei Fu of the Han as the Realized One of Shouchun. The decree is to be entrusted to the abbey for safekeeping, and an official shall be dispatched to conduct a solemn sacrificial rite and install the inscribed plaque. The local authorities have reported compliance and custody of the decree. However, though the rescript was submitted to the Secretariat-Chancellery long ago, no reply has been received. It is now ordered that the authorities of Zhen’nanjun be urgently pressed to expedite the matter in accordance with the rescript’s directives, ensuring prompt execution without delay.\n\n*Fifth year of the Yuanfeng reign, eighth month, tenth day.*\n\n---\n\nOn the twenty-third day of the eighth month of the fifth year of the Yuanfeng reign, Hongzhou received a decree from the Court of Imperial Sacrifices, dated the twenty-ninth day of the seventh month, in accordance with a directive from the Ministry of Rites. The directive followed an imperial rescript, dated the eighteenth day of the seventh month, sent down by the Secretariat-Chancellery, which transmitted a memorial from the Bureau of Sacrifices. The memorial, based on a report from the Court of Imperial Sacrifices, cited a petition from Zhen’nanjun, which in turn referenced an investigation by Fengcheng County into the Mei Immortal Altar Abbey at Nanqi Village in Xuanfeng. The abbey has long been the site of annual state sacrifices, and in times of flood or drought, the people’s prayers have invariably been answered. The facts were verified by the local authorities.\n\nPreviously, the Daoist Yang Zhiyuan of Shousheng Mei Immortal Abbey petitioned that the abbey, originally the retreat of Mei Fu of the Han, preserves ancient relics—an altar, cinnabar well, and hermitage foundations—with its structures dating to the Han dynasty. Its renown endures in canonical sacrifices. He requested that the throne be memorialized to grant the title of Realized One. The local authorities, having reviewed the petition, noted Mei Fu’s towering integrity and loyal remonstrance, recorded in the historical annals for posterity. In his later years, he fled the usurper Wang Mang, abandoning his wife and children, departing from Jiujiang, and preserving his nature in reclusion. The world has since transmitted his story as that of an immortal. His legacy endures in the very site of his retreat, where the abbey stands in solemn order, and prayers in times of flood, drought, or pestilence are met with swift response. It is humbly hoped that a special honorific title may be conferred to accord with the distant people’s gratitude and devotion. The prefecture has hitherto addressed the site only as “Master Mei the Realized One.” This Court, having deliberated, proposes that Mei Fu the Realized One of the Han be granted an additional enfeoffment, pending imperial instruction.\n\nThe Court of Imperial Sacrifices now submits the report for the imperial decision. On the fourteenth day of this month, We issued the following decree: “Let all matters proceed in accordance with precedent.” The decree, as recorded, was transmitted to the Ministry of Rites on the eighteenth day of the seventh month at the hour of *wei*.\n\nIn accordance with the imperial decree, the Ministry of Rites is to ensure all relevant offices execute the directive without delay. Upon receipt of this decree, let the details be reviewed and implemented as commanded.\n\nDuring the Han dynasty, Mei Fu repeatedly voiced solitary yet far-reaching admonitions on the affairs of the realm—how resolute was his spirit! In later years, he retired to his home, devoting himself to study and the cultivation of his nature, ultimately transcending worldly custom in lofty withdrawal. The world has since transmitted his story as that of an immortal. To this day, west of the Great River, his temple image remains, where prayers are met with swift response, bringing blessings to our people. The local authorities having reported this, We now bestow this illustrious title to honor his enduring spiritual power. We deem it fitting to specially enfeoff him as the Realized One of Shouchun.\n\n*Ninth month of the fifth year of the Yuanfeng reign.*\n\n---\n\nIn accordance with the Ministry of Rites’ directive and imperial rescript, an official shall be dispatched to Fengcheng County’s Shousheng Mei Immortal Altar Abbey to conduct a solemn sacrificial rite, proclaim the enfeoffment of the Realized One of Shouchun, and install the inscribed plaque. The decree is to be entrusted to the abbey for safekeeping. The local authorities are to report compliance to the Secretariat-Chancellery.\n\nThe plaque, inscribed with gilded characters, was commissioned by the prefectural authorities and completed on the nineteenth day of this month. It has been entrusted to the abbey’s Daoist and the dispatched official, along with the sacrificial text.\n\nThe magistrate of Fengcheng County, Officer Zhang, is hereby instructed to proceed to the abbey upon receipt of this directive, conduct the solemn sacrificial rite, and install the plaque as commanded. A report of compliance shall be submitted to the prefecture.\n\n*Ninth day of the tenth month of the fifth year of the Yuanfeng reign.*\n\n---\n\nDecree:\n\nOn Our recent southern progress, with Yuzhang as the eastern boundary, We accompanied the Empress Dowager and the palace retinue by boat, braving the perils of wind and wave. At every place We passed, divine protection was manifest. In gratitude for these blessings, We now confer honors to reciprocate the deities’ favor.\n\nThe Realized One of Shouchun at the Mei Fu Ascension Altar Abbey on the north bank of the Great River in Fengcheng, Hongzhou—his forthright remonstrance unheeded, his lofty name alone endured. Moved by the Han dynasty’s decline, he departed for Wushi and never returned. His shrine now stands in solemn dignity, and We have already bestowed a title upon him. To further enhance his honor, We now augment his designation with a new grace, deepening Our exceptional regard and honoring his lifelong devotion. Let him be specially enfeoffed as the Recluse-Realized One of Shouchun.\n\nThis decree is hereby issued for implementation.\n\n*Eighteenth day of the intercalary fourth month of the second year of the Shaosheng reign.*\n\n*Eulogy.*",
      "overlap_context": "special honorific title may be conferred to accord with the distant people’s gratitude and devotion.\n\nThe prefecture has hitherto addressed the site only as “Master Mei the Realized One.” This Court, having deliberated, proposes that the Han dynasty’s Mei Fu the Realized One be granted an additional enfeoffment, pending imperial instruction.\n\nThis Bureau now submits the report of the Court of Imperial Sacrifices for the imperial decision.\n\n*Enfeoffment granted in the Yuanfeng reign [1078–1085].*",
      "start_char": 4517,
      "end_char": 5685,
      "start_sentence": 198,
      "end_sentence": 229,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.90442872047424,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\梅仙观记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "梅先生赞 梅仙子真补吏南昌，去求假传爰贡早囊，指世陈政，厉志竭精，美高绌秦，斥凤伸章，谓当察景亡，失其柄允矣。 多士为国重器，众贤聚朝，人斯畏忌，何以徕之，道在砥砺。 戏鹊遭害，仁乌增逝，毋为按图求骥於市，爰述孔裔，宜后成汤。 绵嘉崇德，自我推明，由凤及莽，遂解汉纲，防之无及，吾言有征，逝将远游，乘云帝乡。 题梅仙馆　　　孟水部宾于 仙界路遥云缥缈，古坛风玲叶萧骚。 后来岂合言淹滞，一尉升腾道最高。 梅先生故居　　黄太史庭坚 昊门不作南昌尉，上疏归来朝市空。 笑拂岩花问尘世，故人子是国师公。 寄梅仙观杨道师　　苏黄门辙 道师住在真人峰，欲往见之路无踪。 去年许我入城市，尘埃暗天待不至。 莫往莫来劳我心，道书寄我千黄金。 奋衣肉食虑谋短，文字满前看不见。 口传指授要有时，脱去罗网当见知。 梅翁汉朝南昌尉，手摩龙鳞言世事。 一朝拂衣去不还，身骑白麟翳红鸾。 我今虽复堕尘土，道师何不与我语。 他年荣足投名山，相逢拍手一破颜。 题梅仙馆　　　　杨次公杰 天下人心爱至忠，天心还与世人同。 自生羽翼三清去，不独丹砂九转功。 汉代变名游越国，道家遗像立萧公。 石坛正是飞升处，老鹤一声松桧风。 题梅仙观　　　　洪龟父朋 炎灵夫其御，四海无安税。 乌乎梅南昌，脱屦元始岁。 小臣披肝胆，宫掖事严秘。 上书竟渺茫，弃掷江湖外。 一朝厌蜗角，万里寄鹏背。 向来杀青上，此事美无对。 到今瑶池地，风露翔孔翠。 仰瞻神界游，干载想生气。 愿为龙鳞婴，勿学蝉骨蜕。 题梅山　　　　　　　　陈阐 先生吏隐寄南昌，千里来寻物外榔。 汲水尚怜春井喋，藏丹犹发夜坛光。 鹤归华表人何在，犬吠深云日自长。 我拟重来访遗迹，手折竿杖少徜徉。 题梅仙馆　　　朱令粹 书投北阙盲无用，吏隐南昌寄此问。 身陆九霄归紫府，名垂千古寄青山。 夜坛星斗谁瞻仰，晓殿云烟自往还。 赛迭高峰人罕到，分明真境异尘寰。 乙卯梼雨梅坛　　　严令桩龄 大隐清名格帝合，真人新宠集王言。 南昌补吏官虽小，北极通斑道更尊。 谏疏不容强汉室，仙风聊复做昊门。 我来物色朝元处，山违星坛水违杖。 题梅坛　　　　　临川令吕防 封事悠悠即挂冠，苍烟古木锁空坛。 当时不识蓬莱客、祇作南昌一尉看。 题梅仙观 尝读子真传，掩卷屡长叹。 如何忠正资，适在元成间。 危言论时政，条畅穷根源。 ，直节破奸胆、愤气冲儒冠。 上书辄报罢。 九九常齐枫。 是时公卿辈，普不为厚颜。 雄文灿方册，至今日星臜。 一探机识祸搞，拂衣‘九江千。 一辑弃妻子，变姓抱昊关。 位车而言高，自古为尤难。 斯人能保身，出处何其艰。 繁子偶得邑，驾育揭仙坛。 坛侧千丈松，冻凛清风还。 寿春下新韶，高蹈翠瑛啊。 壁问罗隐记，中理极可观。 当年康乐公，游览逼名山。 云何此佳迹，未被金石言。 飞鸾。 题梅仙观　　　　马内翰子才 汉纲懈宏纽，国命移权臣。 太阿有神锋，斯倒柄在人。 公卿雊满前，有语各自吞。 张禹为帝师，此是摄乱根。 天子辟左右，决机在一言。 不为社棱计，祇乞儿女恩。 上方斩马剑，当时负朱云。 谷永对直言，天庭策夹氛。 阴谋助元恶，归咎昭阳嫔。 豺狼自此纵，白昼当路蹲。",
      "translated_text": "**Eulogy for Master Mei**\n\nMaster Mei, the Perfected One, once served as a minor official in Nanchang. He sought leave to present a memorial, bearing his early writings in a sack. He admonished the world on governance, steeling his resolve and exhausting his essence. His noble aspirations were thwarted in Qin, yet his censure of the phoenix spread his renown. It was said that when the sun’s light waned, he lost his rightful place—how true this proved. Many scholars are the state’s treasures, and when worthies gather at court, men grow envious and wary. How then to summon them? The Dao lies in mutual refinement.\n\nThe magpie met harm, while the benevolent crow soared away. Do not seek a steed by studying its likeness in the marketplace. Thus, I recount the lineage of Confucius, that later generations may emulate Cheng Tang. To honor virtue and exalt the worthy rests with Us. From the phoenix’s reign to Wang Mang’s usurpation, the Han’s guiding ropes unraveled. Prevention came too late—My words bear witness. Resolved to journey afar, he rode the clouds to the Emperor’s realm.\n\n---\n\n**Inscribed at Mei the Immortal’s Abbey**\n*Meng, Water Bureau Attendant of Bin*\n\nThe immortal’s path stretches distant, clouds wisp-thin;\nThe ancient altar’s wind sighs through rustling leaves.\nHow could later men speak of lingering long?\nA single constable ascended—his Dao supreme.\n\n---\n\n**Former Residence of Master Mei**\n*Huang, Grand Scribe Tingjian*\n\nHad he not served as Nanchang’s constable,\nHis memorials submitted, he would have returned to an empty court and market.\nLaughing, he brushed the cliffside blossoms, asking of the dusty world:\n“Is your old friend now the state’s preceptor?”\n\n---\n\n**Sent to Daoist Master Yang of Mei the Immortal’s Abbey**\n*Su, Yellow Gate Attendant Zhe*\n\nThe Daoist master dwells on Perfected One Peak,\nYet when I seek him, no path remains.\nLast year, he promised to enter the city,\nBut dust darkened the skies, and he never arrived.\n\nDo not come, do not go—you weary my heart.\nInstead, you send me Daoist scriptures worth a thousand gold pieces.\nClad in fine robes, sated with meat, my schemes are shallow;\nTexts pile before me, yet I see nothing.\n\nOral teachings and direct instruction come in their time—\nCast off the net, and you shall be known.\nMei the Elder, Han’s constable of Nanchang,\nStroked the dragon’s scales to speak of worldly affairs.\n\nOne morning, he brushed his robes and departed, never to return,\nRiding a white qilin, veiled by red simurghs.\nThough I now wallow in the dust of the world,\nWhy does the Daoist master not speak to me?\n\nOne day, when my glory is complete, I shall retreat to a famous mountain,\nAnd when we meet, we’ll clap hands and break into smiles.\n\n---\n\n**Inscribed at Mei the Immortal’s Abbey**\n*Yang Cigong Jie*\n\nThe hearts of all under heaven cherish utmost loyalty;\nHeaven’s heart, too, aligns with the people’s.\nOnce he grew wings and ascended to the Three Clarities,\nNot solely through ninefold-cycled cinnabar.\n\nIn the Han, he changed his name and wandered Yue;\nThe Daoists left his image to Xiao Gong.\nThe stone altar marks where he ascended—\nAn old crane’s cry, the wind in the pines and cypresses.\n\n---\n\n**Inscribed at Mei the Immortal’s Abbey**\n*Hong Guifu Peng*\n\nThe fiery spirit of the sovereign waned,\nAnd the Four Seas knew no peace.\nAlas, Mei of Nanchang,\nCast off his sandals in the first year of his era.\n\nA minor official, he bared his liver and gall,\nYet palace affairs were shrouded in secrecy.\nHis memorial vanished into obscurity,\nDiscarded beyond rivers and lakes.\n\nOne morning, weary of the snail’s-horn strife,\nHe entrusted his fate to the roc’s back.\nIn times past, on bamboo slips,\nHis deeds shone unmatched.\n\nNow, in the Jasper Pool’s realm,\nPhoenixes and kingfishers soar through wind and dew.\nGazing up at the divine realm’s wanderings,\nFor a thousand years, I imagine his living qi.\n\nI wish to cling to the dragon’s scales,\nNot shed my body like a cicada’s husk.\n\n---\n\n**Inscribed at Mount Mei**\n*Chen Chan*\n\nThe master, a recluse-official in Nanchang,\nTraveled a thousand li to seek a realm beyond things.\nDrawing water, he pitied the spring well’s dry lips;\nHiding elixirs, the night altar still gleamed.\n\nThe crane returned to the decorated pillar—where is its master?\nThe dog barked in deep clouds, the days lengthened.\nI intend to return and trace his vestiges,\nStaff in hand, to wander awhile.\n\n---\n\n**Inscribed at Mei the Immortal’s Abbey**\n*Zhu Lingcui*\n\nHis memorials cast before the northern gate were blindly ignored;\nA recluse-official in Nanchang, he lodged this question here.\nHis body soared through the nine skies to the Purple Palace;\nHis name endures through the ages, entrusted to green mountains.\n\nWho now gazes upon the starry altar at night?\nAt dawn, mist and clouds drift to and fro.\nThe high peaks, seldom trod by men,\nReveal a true realm apart from the mortal world.\n\n---\n\n**Praying for Rain at Mei’s Altar, Yimao Year**\n*Yan Lingzhuangling*\n\nThe great recluse’s pure name matched the Emperor’s will;\nThe Perfected One’s new favor was gathered in the royal words.\nThough Nanchang’s constable was a minor post,\nHis Dao, linked to the Northern Culmen, grew more exalted.\n\nHis remonstrances could not save the crumbling Han court;\nHis immortal’s mien briefly graced Wu Gate.\nI come to seek the place of morning audience—\nThe mountain defies the starry altar, the waters reject my staff.\n\n---\n\n**Inscribed at Mei’s Altar**\n*Lü Fang, Prefect of Linchuan*\n\nHis memorials hung unheeded—then he doffed his cap.\nBlue mists and ancient trees seal the empty altar.\nHad they known then he was a guest of Penglai,\nThey would not have seen him as merely Nanchang’s constable.\n\n---\n\n**Inscribed at Mei the Immortal’s Abbey**\n*(Excerpt from a longer poem)*\n\nI once read Master Zizhen’s biography,\nAnd closed the scroll with repeated sighs.\nHow could such loyal and upright talent\nHave appeared in the Yuan and Cheng eras?\n\nHis perilous words addressed the times’ governance,\nHis proposals thorough, tracing roots to sources.\nHis unyielding integrity shattered the traitors’ gall,\nHis indignant spirit shook the Confucian’s cap.\n\nHis memorials were repeatedly rejected.\nNine nines aligned with the maple’s leaves.\nAt that time, the court’s ministers\nUniversally lacked thick skins.\n\nHis brilliant writings gleam in the annals,\nEnduring as the stars and sun.\nHe probed the mechanisms, foreseeing disaster,\nThen brushed his robes and left—nine rivers, a thousand li.\n\nHe abandoned wife and children in one stroke,\nChanged his name, and embraced Wu Pass.\nTo speak truth while holding high office—\nSince ancient times, this has been most difficult.\n\nThis man preserved himself—\nHow arduous his path of withdrawal and engagement!\nFan Zi briefly held a post,\nAnd drove his carriage to the immortal’s altar.\n\nBeside the altar, a thousand-zhang pine,\nIts icy branches cleansed by returning winds.\nFrom Shouchun came new melodies,\nHis lofty steps treading jasper and jade.\n\nThe walls bear Luo Yin’s inscriptions,\nTheir principles profound and worthy of contemplation.\nIn those years, Lord Kangle\nTraveled to renowned mountains.\n\nWhy then has this fine site\nNot been recorded in metal or stone?\nThe flying simurgh...\n\n---\n\n**Inscribed at Mei the Immortal’s Abbey**\n*Ma Neihan Zicai*\n\nThe Han’s guiding ropes slackened,\nAnd the state’s fate shifted to powerful ministers.\nThe divine edge of Grand Marshal’s sword\nWas inverted, its hilt in others’ hands.\n\nCourtiers crowded the hall,\nEach swallowing their words.\nZhang Yu, the Emperor’s tutor,\nWas the root of this chaos.\n\nThe Son of Heaven’s attendants\nDecided matters with a single word.\nNot for the altars’ sake,\nBut to beg for a child’s favor.\n\nThe sword meant to slay horses\nFailed even Zhu Yun.\nGu Yong’s forthright counsel\nWas met with ominous portents at court.\n\nDark schemes aided the chief villain,\nBlame cast upon Zhao Yang’s consort.\nFrom then on, jackals and wolves roamed free,\nStrutting in broad daylight.",
      "overlap_context": "departed for Wushi and never returned. His shrine now stands in solemn dignity, and We have already bestowed a title upon him. To further enhance his honor, We now augment his designation with a new grace, deepening Our exceptional regard and honoring his lifelong devotion. Let him be specially enfeoffed as the Recluse-Realized One of Shouchun.\n\nThis decree is hereby issued for implementation.\n\n*Eighteenth day of the intercalary fourth month of the second year of the Shaosheng reign.*\n\n*Eulogy.*",
      "start_char": 5685,
      "end_char": 7003,
      "start_sentence": 230,
      "end_sentence": 314,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 48.397610664367676,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\梅仙观记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "先生当是时，上书叩帝合。 耿耿祸枫烦，皎皎星与辰。 天门锁九重，一门万夫屯。 小臣江湖心，何由达至尊。 贼莽果盗国，忠烈遭烹焚。 先生变各姓、为卒昊市门。 浮云去无踪，世人甘为仙。 蓬山在何处，此事且勿论，但爱清风高，凛凛久益新。 我来拜遗像，旧宅荒基存。 元丰发新韶，玉牒封寿春。 老松益劲色，岁饱霜当痕。 直上绝顶坛，天风吹衣巾。 细读壁问书，颇喜罗隐文。 恨叹有粳语，使我气益振。 回视饱食徒，茫茫如埃尘。 寄题梅坛　　　御史蒋之奇 昔我承乏江西官，豫章圣迹无不观。 如何复有此遗恨，独我不到梅仙坛。 梅仙坛在丰城界，真风爽气埃尘外。 当年补尉向南昌，才誉虽高官未大。 汉成帝时纲纪壤，先生谏书至于再。 前擢王章娇曲朝，戮及妻子仇党快。 辜臣知非不敢争，遂令天下言为戒。 乌乎此语诚甚危，讥切权强何慷慨。 借令触突幸臣牙，嗜一羁单未为害。 公卿大臣噤不吐，彼为私谋安足怪。 正人在下吁可悲，变名昊市复谁知。 元丰劫书为旌表，故庵丹井存遗基。 寿春真人锡显号，称其高蹈与俗遗。 先生虽不遇於昔，而遇於今蒙奖饬。 令丞作书誉忠直，潜德幽光婵无极。 题梅山　　　天师张景先 作尉南昌日，投书北阙频。 忠言不悟主，直节耻为臣。 汉室多灾异，昊门念隐沦。 挂冠忘宠辱，蒙袂出埃尘。 虹屈英雄气，鸥旱自在身。 永怀三洞诀，高谢九江春。 择地开仙馆，看云剪寿巾。 玄台秋步月，虚室夜凝真。 无梦生芳草，留年养大桩。 碧茸香不断，青马性偏驯。 太液刀圭就，中黄道路新。 武夷空坠马，郁木竟栖神。 绛节虽朝帝，灵波尚济民。 一石传旧史，千古事严里。 瑞气生仙药，清风付羽人。 坛遗金鼎像，井锁玉华津。 地接洪崖府，溪通剑水滨。 鹤归云抖擞，龙起石鳞皴。 已悟身为患，元期德有邻。 青山不忘我，今日是天亲。 题梅山二首　　　　 范仁仲 袖凛摧奸剑拂霜，奈何不报疏三章。 南昌一尉孤忠日，西汉诸王百沸汤。 便觅赤松为伴去，何求青史把名扬。 想疑九转丹成后，愤吐精裹诉玉皇。 说到神仙事渺茫，寿春亘古此灵场。 松边白隐千年鹤，岭外红拖几夕阳。 霞驭月寒时弄影，斗坛风玲夜闻香。 先生不必真人号，自与乾坤共久长。 题梅仙观　　　　　　陈藏一 进了忠言隐姓名，万年香火此山灵。 可怜沉醉功名者，血染咸阳唤不醒。 题梅坛　　　　　　左蜀王时彦 梅尉孤忠揭，芳名千古传。 官卑奚意隐，心正即神仙。 敢谏忧时切，为臣愿主贤。 旌阳称令尹，对峙是丹泉。 题梅仙坛　　　　清江刘霆午 吏隐清风几百年，长松修竹满坛前。 汉皇若听三书谏，未必先生便肯仙。 题梅坛　　　　　　　王伯范 火德中微否未倾，朝阳一疏凤先呜。 如公忠论能旋听，彼莽奸谋未可成。 万古仙名香宇宙，几人遗臭腐公卿。 至今风吼松声怒，似为先生诉不平。 朝暗仗马夕笺天，汉事于今已几年。 一片孤忠应尚在，定须耿耿斗牛边。 宿梅仙坛　　　　张广泱 夜宿梅坛境，山寒万籁空。 无才供吏隐，有梦忆仙爷。 石齿含残雪，松髯奋急风。 宠烟如可舐，跨鹤问鸿蒙。 题梅坛　　　　　　　　锺就 万松护岭与天齐，中有真人旧隐栖。 井玲尚留丹汞暖，坛高近拜斗星低。",
      "translated_text": "At that time, the Master\nKnocked upon the imperial gates with memorials.\nHis loyalty burned bright as maple’s vexing flames,\nAs radiant as stars and constellations.\n\nThe nine-fold gates of heaven were locked,\nA single gate garrisoned by ten thousand men.\nA minor official with a heart for rivers and lakes—\nHow could his words reach the Son of Heaven?\n\nThe traitor Wang Mang indeed usurped the state,\nWhile the loyal and upright met burning and boiling.\nThe Master changed his surname,\nBecame a soldier at Wu Market’s gate.\n\nFloating clouds left no trace,\nThe world willingly called him immortal.\nWhere lies Penglai Mountain?\nLet such matters rest unspoken.\n\nYet he loved the lofty, pure wind,\nIts chill majesty ever renewed.\nI come to bow before his portrait,\nHis old abode’s foundations still standing.\n\nIn the Yuanfeng era, a new dawn arose,\nThe jade registers sealed Shouchun’s blessings.\nThe ancient pines grow ever more vigorous,\nTheir trunks bearing the marks of frost’s yearly toll.\n\nStraight to the summit altar I ascend,\nHeaven’s wind whips my robes and headscarf.\nCarefully reading the inscriptions on the walls,\nI delight in Luo Yin’s writings.\n\nSome regretful, blunt words\nStir my spirit to greater heights.\nLooking back at those sated with ease,\nThey seem as fleeting as dust.\n\n**Inscribed at Mei Altar**\n*Jiang Zhiqi, Imperial Censor*\n\nOnce I served in Jiangxi,\nVisiting every sacred trace in Yuzhang.\nHow could I bear this lingering regret—\nThat I alone had not come to Mei Immortal’s Altar?\n\nMei Immortal’s Altar lies in Fengcheng’s bounds,\nWhere true wind and refreshing qi dwell beyond the world’s dust.\nIn those years, he served as deputy magistrate in Nanchang,\nHis talent renowned, though his rank remained modest.\n\nWhen the Han’s Cheng Emperor saw the state’s discipline crumble,\nThe Master submitted his remonstrance again and again.\nEarlier, Wang Zhang had been promoted to correct the court’s crooked ways,\nBut his execution—wife and children, allies and kin—brought vengeful satisfaction.\n\nGuilty ministers dared not protest,\nAnd so the realm took his words as warning.\nAlas, such speech was perilous indeed!\nHow fiercely he rebuked the powerful and strong.\n\nHad he merely grazed a favored courtier’s fangs,\nA single setback would not have been ruinous.\nYet high ministers and nobles held their tongues,\nPursuing private schemes—no wonder.\n\nThe righteous below sighed in sorrow,\nChanging his name, working in Wu Market—who knew?\nIn the Yuanfeng era, imperial decrees honored him,\nHis old hermitage and cinnabar well’s foundations preserved.\n\nShouchun’s Perfected One was granted a noble title,\nCelebrating his lofty withdrawal from the vulgar world.\nThough the Master met no favor in his time,\nToday he is honored and commended.\n\nThe magistrate’s records praise his loyalty and integrity,\nHis hidden virtue and obscured brilliance shining boundlessly.\n\n**Inscribed at Mei Mountain**\n*Zhang Jingxian, Heavenly Master*\n\nWhen he served as deputy in Nanchang,\nHe sent memorials to the northern palace time and again.\nLoyal words failed to awaken the lord,\nHis unyielding integrity shamed him as a subject.\n\nThe Han court teemed with omens and calamities,\nYet Wu Gate longed for reclusion.\nHe hung up his cap, forgetting favor and disgrace,\nCovering his face, he left the world’s dust behind.\n\nThe rainbow’s arc bent his heroic qi,\nThe gull’s drought left him at ease.\nEver mindful of the Three Caverns’ secrets,\nHe bid farewell to the springs of the Nine Rivers.\n\nChoosing a place, he opened his immortal abode,\nGazing at clouds, he trimmed his longevity scarf.\nOn the dark terrace, he paced beneath autumn’s moon,\nIn the empty chamber, night congealed his true nature.\n\nNo dreams sprouted fragrant grasses,\nHe nurtured great vitality to extend his years.\nVerdant moss exhaled unbroken fragrance,\nThe azure steed’s nature remained docile.\n\nThe Taiye elixir’s blade and mortar were complete,\nThe Central Yellow’s path renewed.\nWuyi’s fallen horse was in vain,\nThe dense trees of Yu finally cradled his spirit.\n\nThough his crimson tally once summoned him to court,\nHis numinous waves still aided the people.\nA single stone tablet transmits his old history,\nA thousand years of affairs lie within Yan’s precincts.\n\nAuspicious qi births immortal medicines,\nPure wind is entrusted to feathered ones.\nThe altar preserves the golden tripod’s image,\nThe well seals the jade-bright ford.\n\nThe land adjoins Hongya’s mansion,\nThe stream flows to the Sword Water’s shore.\nCranes return, clouds stirring,\nDragons rise, stone scales wrinkling.\n\nHe awakened to the body as affliction,\nHis original hope was virtue’s neighbors.\nGreen mountains do not forget me—\nToday, this is heaven’s kinship.\n\n**Two Poems Inscribed at Mei Mountain**\n*Fan Renzhong*\n\nHis sleeve chilled, he brandished his anti-treason sword,\nYet how could it not avenge the three memorials?\nWhen the deputy of Nanchang stood alone in loyalty,\nThe Han’s many kings boiled like a hundred cauldrons.\n\nHe sought Red Pine as companion and left,\nWhat need had he for fame in the green histories?\nI wonder if, after refining the nine-fold elixir,\nHis indignant spirit spat its essence to the Jade Emperor.\n\nThe matter of immortals is distant and vague,\nYet Shouchun’s sacred site endures through the ages.\nBy the pines, a white crane has hidden for a thousand years,\nBeyond the ridges, red sunsets trail through countless evenings.\n\nThe rosy chariot plays with shadows in moonlit cold,\nThe Dipper Altar’s wind chimes ring with night’s fragrance.\nThe Master need not be called a Perfected One—\nHe endures as long as heaven and earth.\n\n**Inscribed at Mei Immortal’s Abbey**\n*Chen Cangyi*\n\nHe advanced loyal words, concealing his name,\nThis mountain’s spirit enjoys ten thousand years of incense.\nPity those drunk on fame and fortune—\nTheir blood stains Xianyang, yet they cannot be roused.\n\n**Inscribed at Mei Altar**\n*Zuo Shu, Wang Shiyan*\n\nMei’s deputy’s solitary loyalty shines,\nHis fragrant name transmitted through the ages.\nThough his rank was low, why hide his intent?\nA heart upright is itself an immortal.\n\nDaring to admonish, his concern for the times was urgent,\nAs a subject, he wished his lord to be worthy.\nLingyang was called a fine magistrate,\nFacing the Crimson Spring, they stand in opposition.\n\n**Inscribed at Mei Immortal’s Altar**\n*Liu Tingwu of Qingjiang*\n\nFor centuries, the pure wind of reclusive officials,\nTall pines and slender bamboo fill the altar’s front.\nHad the Han emperor heeded his three memorials,\nThe Master might not have become an immortal.\n\n**Inscribed at Mei Altar**\n*Wang Bofan*\n\nThe Fire Virtue waned, decline not yet overthrown,\nA single memorial from the court’s phoenix cried out first.\nHad the lord listened to such loyal counsel,\nThat traitor Wang’s schemes would not have succeeded.\n\nThe immortal’s name fragrantly fills the cosmos,\nHow many leave a stench to rot the nobles?\nEven now, the wind howls, the pines roar in anger,\nAs if pleading injustice for the Master.\n\n**Staying Overnight at Mei Immortal’s Altar**\n*Zhang Guangyang*\n\nI lodge for the night at Mei Altar’s precinct,\nThe mountain cold, all sounds stilled.\nLacking talent for reclusive office,\nI dream of recalling the immortal’s grace.\n\nStone teeth hold lingering snow,\nPine beards bristle in the fierce wind.\nIf the smoke of favor could be licked,\nI would mount a crane to ask the primordial chaos.\n\n**Inscribed at Mei Altar**\n*Zhong Jiu*\n\nTen thousand pines guard the ridge, towering to the sky,\nWithin, the Perfected One once dwelled in reclusion.\nThe well’s chimes still warm with cinnabar’s mercury,\nThe altar’s height brings the Dipper’s stars near.",
      "overlap_context": "ded the hall,\nEach swallowing their words.\nZhang Yu, the Emperor’s tutor,\nWas the root of this chaos.\n\nThe Son of Heaven’s attendants\nDecided matters with a single word.\nNot for the altars’ sake,\nBut to beg for a child’s favor.\n\nThe sword meant to slay horses\nFailed even Zhu Yun.\nGu Yong’s forthright counsel\nWas met with ominous portents at court.\n\nDark schemes aided the chief villain,\nBlame cast upon Zhao Yang’s consort.\nFrom then on, jackals and wolves roamed free,\nStrutting in broad daylight.",
      "start_char": 7003,
      "end_char": 8327,
      "start_sentence": 315,
      "end_sentence": 401,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.88908934593201,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\梅仙观记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "回思汉事成惆怅，浪费今人为品题。 我欲从之无路去，同升不似许仙鸡。 胡发 忠肝一点炳如月，世事难将道眼看。 驾取云饼升斗府，惟遗岩壑拱仙坛。 游梅坛有感　　　临川吴季光 小立仙坛抱斗箕，着身高处觉天低。 南昌吏隐清风在，唤醒时人局面迷。 赓梅山壁问韵　　古吁邓梦杰 愧我身名堕褐冠，无因安得到仙坛。 子真虽隐名难隐，万古高风凛凛寒。 题梅山　　　　　束嘉赵叉撞 一隐昊门访此山，深怜汉鼎尚多艰。 片言倘得回天听，未必仙名满世问。 题梅坛　　　　　　曹仙家 汉代梅君此炼丹，古坛翠驳藓花斑。 目穷乌道青天远，榻转松阴白日闲。 烟隔楼台分象外，风吹锺磬落人问。 不知乘韶冲升后，几度飞鸾到旧山。 新昌张异 上疏归来日已西，山中旋制薜萝衣。 谋身岂为金丹秘，去国应知火祚移。 风露满林蝉几蜕，松杉远屋鹤孤飞。 瓣香仆仆非公愿，自有忠诚天地知。 古树枯藤知几年，衣冠来此岂徒然。 波涛平地难回首，风雨深山旦熟眠。 吾道有灵终用世，此心无愧可通天。 功名分定从吾好，未许驱驰效执鞭。 立春寄梅坛杨逸老　　范太中 仕路蹉跎又见春，区区深厌走红尘。 未能解脱无穷事，长忆逍遥自在人。 瓦缶汲泉朝灌药，羽衣檬露夜朝真。 洒然物外清虚境，呼吸淳元养气神。 题梅坛毛庆甫云悦楼　　萧泰来 楼立梅峰最上头，日随元气与浮游。 道心快活云心似，飞去飞来得自由。 一收二百里问云，诗几琴窗总向君。 独乐何如同乐好，阑子欠着老夫分。 题梅山云悦楼　　　约山朱行父 和衣高外白云堆，门倩云封不妄开。 留向山中自娱悦，莫教一片出山来。 自堂陈杰 白衣苍狗无情物，翻手悲惧变古今。 输与道人长快活，看渠起灭不关心。 后林李义山 云本无心悦者谁，华阳去后少人知。 欲分半席无因到，一片飞来是觅诗。 蜀人王时彦 一生活计一身闲，日与白云相往还。 五百年问知此味，华山去后到梅山。 林隐罗永之 曾读杨诗识懒云，只今云悦即云孙。 龙无怒色常归匣，鹤有惧颜独守门。 春态乐寻吟客伴，心闲喜共野人言。 要知出岫晴方好，楼外蒙蒙烟雨昏。 初堂胡宏子 世人之所悦，多在纷华问。 毛仙得趣处，白云满青山。 飞楼俯空旷，登眺长始颜。 边与云俱高，心与云俱闲。 八极梅真人，乘云相往还。 我亦懒出岫，时归坐云关。 清吟抱幽独，何当共托阗 崔次周 仙人好楼居，天上多琼楼。 祥氛结紫黑，磅砖常周流。 道人仙之裔，居然梅山头。 山头耸百尺，日与云从游。 静嘿观内景，缭绕云气浮。 轩豁抱西爽，天冷云影收。 倚阑畅今情，笔砚云烟稠。 领客谭又玄，满吸云腴瓯。 不用分半问，盘结任相谬。 怡然自可悦，澹然亦何求。 悦则动静随，呼吸听去留。 我欲乘之叩，太虚相与上。 下追仙婷鞭，鸾笞凤汗漫。 去下视八表，挥斥浚九州。 锺说 我匪悦云云悦我，云兮与我一无心。 知君只爱云中隐，不肯出山无处寻。 李君式 无心出岫道人闲，身在虚无飘缈问。 可惜云霓人在望，卷将云雨入梅山。 题梅山　　　　　　　　薛修竹 薜荔坛高秋十分，汉时笙鹤杳无闻。 平明一觉西风梦，吹落人问半是云。 梅仙观记竟",
      "translated_text": "Reflecting on Han affairs stirs melancholy,\nHow vainly men today compose their praises.\nI long to follow, yet no path leads there—\nNot like Xu’s immortal crane, soaring together.\n\n**Hu Fa**\nA speck of loyal liver burns moon-bright,\nYet worldly matters defy the Dao-eye’s gaze.\nRiding cloud-cakes to the Dipper’s palace,\nOnly cliffs and gorges bow to the immortal’s altar.\n\n**Musing While Visiting Mei Altar**\n*Linchuan Wu Jiguang*\n\nI stand briefly at the immortal’s altar, embracing the Dipper,\nClimbing high, the sky itself seems low.\nThe pure wind of Nanchang’s reclusive officials lingers—\nIt awakens those lost in worldly delusions.\n\n**Matching Rhymes on Mei Mountain’s Wall**\n*Gu Xu Deng Mengjie*\n\nAshamed my name and self have fallen to humble garb,\nWith no means to reach the immortal’s altar.\nThough Zi Zhen hid, his fame could not be hidden—\nHis lofty virtue chills through the ages.\n\n**Inscribed at Mei Mountain**\n*Shu Jia Zhao Chazhuang*\n\nI came to this mountain seeking seclusion at Wu Gate,\nGrieving that the Han tripod still faces such trials.\nIf but a single word could turn the celestial ear,\nThe immortal’s name need not fill the world’s inquiries.\n\n**Inscribed at Mei Altar**\n*Cao Xianjia*\n\nHere in Han times, Master Mei refined his elixir,\nThe ancient altar mottled with moss and lichen.\nThe eye strains along the crow’s path to distant azure,\nWhile beneath shifting pine shadows, the white sun idles.\nMist veils towers beyond the realm of forms,\nWind carries bells and chimes into mortal ears.\nSince his ascent on the Shao melody,\nHow many times has his flying simurgh returned to these old peaks?\n\n**Zhang Yi of Xinchang**\nReturning from memorials, the sun already west,\nIn the mountains, I swiftly fashioned a robe of creeping fig.\nNot for the secrets of golden elixirs did I plan my retreat—\nLeaving court, I knew the fiery mandate had shifted.\nWind and dew fill the grove, cicadas shed their skins,\nPines and firs stretch far, a lone crane takes flight.\nBurning incense in humble devotion was never my wish—\nMy loyalty is known to heaven and earth.\n\nAncient trees, withered vines—how many years have passed?\nThose who come here in robes and caps do not do so in vain.\nWaves rising from level ground are hard to turn back,\nYet in the mountain’s wind and rain, one sleeps soundly.\nIf the Dao has spirit, it will find its use in the world,\nThis heart, unashamed, can reach the heavens.\nFate’s allotment of fame and rank follows my desire—\nI will not be driven to serve as a whip-bearer.\n\n**Sending to Yang Yilao of Mei Altar on the Beginning of Spring**\n*Fan Taizhong*\n\nThe official path wears on, another spring arrives,\nI deeply loathe the dusty red of worldly striving.\nUnable to untangle endless affairs,\nI long recall the carefree, self-possessed man.\nMorning draws water from a clay jar to water herbs,\nNight dons feathered robes to greet the Perfected.\nBeyond things, in the realm of purity and emptiness,\nI breathe the pure primordial qi to nurture spirit.\n\n**Inscribed on Mao Qingfu’s Yunyue Tower at Mei Altar**\n*Xiao Tailai*\n\nThe tower stands at Mei Peak’s highest point,\nDay by day drifting with the primordial qi.\nThe heart of Dao is as joyful as the heart of clouds—\nFlying away, flying back, all is freedom.\nGathering the two hundred li of clouds,\nPoems and zither windows all turn toward you.\nWhy delight alone when shared delight is better?\nThe balustrade lacks only this old man’s share.\n\n**Inscribed on Mei Mountain’s Yunyue Tower**\n*Yueshan Zhu Xingfu*\n\nClad in robes, I ascend the white cloud’s summit,\nThe gate, entrusted to clouds, opens not idly.\nLet it remain in the mountains for self-amusement—\nDo not allow a single wisp to leave the peaks.\n\n**Zitang Chen Jie**\nWhite robes and gray dogs—heartless things,\nWith a flip of the hand, they mourn or rejoice, altering past and present.\nI yield to the Daoist, ever carefree,\nWatching their rise and fall without concern.\n\n**Houlin Li Yishan**\nClouds, originally without intent—who delights in them?\nSince Hua Yang’s departure, few have known.\nWishing to share half a mat, yet no way to arrive,\nA single piece flies here in search of poetry.\n\n**Wang Shiyan of Shu**\nA lifetime’s livelihood is a body at leisure,\nDaily wandering with the white clouds.\nFive hundred years later, who knows this taste?\nAfter Hua Mountain, one comes to Mei Mountain.\n\n**Lin Yin Luo Yongzhi**\nOnce reading Yang’s poem, I knew the lazy clouds,\nNow Yunyue is but the cloud’s descendant.\nThe dragon, without wrath, always returns to its casket,\nThe crane, fearful, alone guards the gate.\nSpring’s mood delights in the company of chanting guests,\nA tranquil heart gladly speaks with rustics.\nTo know clouds are best when leaving the peaks in clear weather—\nBeyond the tower, misty rain blurs the scene.\n\n**Chutang Hu Hongzi**\nWhat delights the world\nLies in the bustle of splendor.\nMaster Mao’s joy\nIs white clouds filling green mountains.\nThe flying tower overlooks vast emptiness,\nAscending, the face ever brightens.\nEdges soaring with the clouds,\nThe heart at ease with the clouds.\nThe Eight Poles’ Perfected Mei\nRides clouds to and fro.\nI, too lazy to leave the peaks,\nAt times return to sit at the cloud’s gate.\nIn pure chanting, embracing solitude,\nWhen shall we together find refuge?\n\n**Cui Cizhou**\nImmortals favor dwelling in towers,\nIn heaven, many are jade towers.\nAuspicious mists coil in purple and black,\nEver swirling in boundless flow.\nThe Daoist, descendant of immortals,\nDwells at Mei Mountain’s summit.\nThe summit soars a hundred feet,\nDaily roaming with the clouds.\nIn silence, observing inner visions,\nCloud qi swirls and floats.\nThe pavilion embraces the western breeze,\nThe cold sky gathers the cloud’s shadows.\nLeaning on the railing, emotions flow,\nBrush and ink thick with cloud and mist.\nInviting guests to discourse on the mysterious,\nFully inhaling the cloud’s rich essence.\nNo need to divide or question,\nEntwined as they may be.\nJoyful, all is at ease,\nSerene, what more is sought?\nDelighted, movement and stillness follow,\nBreathing in and out, going and staying as they please.\nI long to ride them, knocking at the Great Void,\nTogether ascending the celestial heights.\nBelow, pursuing the immortal’s whip,\nSimurghs and phoenixes roam boundlessly.\nLooking down upon the eight wilds,\nCommanding the nine provinces with a wave.\n**Zhong Shuo**\nNot I who delight in clouds—clouds delight in me,\nClouds and I, both without intent.\nKnowing you love hiding in the clouds,\nUnwilling to leave the mountains, nowhere to be found.\n\n**Li Junshi**\nWithout intent, leaving the peaks, the Daoist at leisure,\nBody in the void, drifting in the ethereal.\nPity the cloud’s rainbow, longed for by men,\nIt rolls up the clouds and rain into Mei Mountain.\n\n**Inscribed at Mei Mountain**\n*Xue Xiuzhu*\n\nThe altar of creeping fig stands high in autumn’s fullness,\nThe Han’s phoenix pipes and cranes are heard no more.\nAt dawn’s awakening from a west wind dream,\nHalf the mortal world is blown into clouds.\n\n*Record of Mei Immortal’s Temple Concluded*",
      "overlap_context": "\nLacking talent for reclusive office,\nI dream of recalling the immortal’s grace.\n\nStone teeth hold lingering snow,\nPine beards bristle in the fierce wind.\nIf the smoke of favor could be licked,\nI would mount a crane to ask the primordial chaos.\n\n**Inscribed at Mei Altar**\n*Zhong Jiu*\n\nTen thousand pines guard the ridge, towering to the sky,\nWithin, the Perfected One once dwelled in reclusion.\nThe well’s chimes still warm with cinnabar’s mercury,\nThe altar’s height brings the Dipper’s stars near.",
      "start_char": 8328,
      "end_char": 9658,
      "start_sentence": 402,
      "end_sentence": 489,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.44044041633606,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\梅仙观记.txt",
        "category": "记传类"
      }
    }
  ]
}