{
  "source_id": "正一法文法箓部仪",
  "source_file": "chunked_daozang\\正一法文法箓部仪.json",
  "total_chunks": 8,
  "total_original_chars": 8497,
  "total_translated_chars": 57378,
  "total_translation_time": 283.872266292572,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\正一法文法箓部仪.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**Zhengyi Ritual Texts of the Registers and Rites Section**\n\n**Title:** *Zhengyi Ritual Texts of the Registers and Rites Section* (*Zhengyi Fawen Falu Buyi*). Author unknown, likely composed during the Northern and Southern Dynasties. One of the surviving fragments of the early Celestial Master Daoist classic *Zhengyi Fawen*. One scroll.\n\n**Source:** *Daoist Canon of the Zhengtong Era* (*Zhengtong Daozang*), Zhengyi Section, Part One.\n\n---\n\n### *Yellow Plain Threefold Alliance Ascension Altar Rite*\n\nOn the first day of the [X] month in the [X] year of the reign of [X] state, at the [X] hour, [X], a Master of the Three Caverns, Wandering Master of the Five Peaks, and Black Prime One Daoist of the [X] Ordinance under Celestial Master [X], residing in the [X] prefecture, [X] county, [X] township, and [X] village, hereby transmits the following:\n\nFormerly, [X], a male official, received from the Master of the Three Caverns and Black Prime One Daoist [X] the primordial mandate of Lord Lao, the unity of Heaven and Earth, the Sun and Moon, and the Five Planets, as well as the Upper Three Heavens, the True One, the Prime One, the Universal Overseer of the Five Hundred Fifty-Five Quintillion, Five Hundred Fifty-Five Billion, Five Hundred Fifty-Five Million Layers of All Heavens, all the sun, moon, and stars, all immortal courts, all worldly and otherworldly mountains and peaks, celestial spirits and earthly deities, the Five Peaks and Four Seas, the Three Rivers and Nine Streams, the Four Seas and Eight Extremities, mountain gods and water spirits, the thousand ghosts and ten thousand spirits—all of which belong to the Upper Three Heavens, the True One, and the Prime One.\n\nNow, at the [X] hour on the first day of the [X] month in the [X] year, [X], a Perfected of the [X] prefecture, [X] county, [X] township, and [X] village, aged [X] years, of pure and sincere disposition, devoted to the Dao and fond of life, harmonious in yin and yang, with the Five Blacks governing the body, having previously received the *Yellow Diagram* and the *True Heaven Red Register*, the *True Heaven Three Ones*, the *True One*, and the *Prime One Plain Contract*, yet after years of cultivation still unable to ascend as an immortal, seeks to advance and receive the talismanic credentials of the Thirty-Two Heavenly Thrones of the Upper Three Heavens, the True One, and the Prime One.\n\n[He] shall hold the Vajra, divide the true form, and cast it into the golden fish, swearing an alliance with the Three Officials of Heaven, Earth, and Water. Together, they shall split the golden contract, carve the arm to drink the cinnabar blood, and bind their hair and lives in oath, becoming one body with [X], united in heart and covenant to uphold the celestial Perfected, cultivate the immortal path, and ascend together to Heaven.\n\n[He] must not indulge in sensual desires or deviate from the Orthodox Unity. After receiving the Dao, for thirty-six years, should an worthy recipient appear, transmission may be granted. No reckless dissemination is permitted. [He] must not seek exalted rank while neglecting the root, nor turn away with false words, harbor dual intentions, slander the Dao of the master, or assault the master’s authority. Any violation of this covenant shall result in [his] body being handed over to the Three Officials, becoming a lowly ghost forever, with [his] name erased from the registers of the living. [He] shall harbor no resentment.\n\n[X], of his own volition and joy in the immortal path, without coercion, hereby marks this as a pledge.\n\n**Right:** The Upper Contract of the True One’s Alliance, inscribed on both sides.\n\n---\n\nIn the [X] year of the reign of [X] state, on the first day of the [X] month, at the [X] hour, [X], a male or female official, Prime One Daoist, and Perfected of the [X] prefecture, [X] county, [X] township, and [X] village, aged [X] years, approaches your servant [X] to receive the Prime One’s altar alliance and covenant, the oral transmission of the True One’s alliance, and deliverance from life and death. No violation is permitted, as per the statutes and decrees of Lord Lao.\n\n**Right:** The Middle Contract of the Prime One’s Alliance.\n\n---\n\n[X], a Wandering Master of the Five Peaks under Celestial Master [X] of the Black [Ordinance], your servant [X], having previously, in the [X] year, on the [X] day of the [X] month, at the [X] hour, received from the Master of the Three Caverns, the Left and Right Black Masters of the Yangping Ordinance and the Five Blacks, and the [X] Peak Master [X], the method of the Prime One’s True Contract and Threefold Alliance, for deliverance from life and death, ascension from the Nine Dark Realms, the registration of the seven generations of ancestors, and the deliverance of [his] own body and three sons, ensuring their attainment of immortality alongside the Prime One, hereby records the following:\n\nThe Prime One Daoist [X], male or female, born [X] in the [X] prefecture, [X] county, [X] township, and [X] village, swears an alliance, receiving the tonsure and binding [his] hair, pledging life and death to the covenant, never betraying the great alliance of the Prime One Emperor Lord and the immortal statutes. The Five Thearchs, demon kings, and all beings of the Three Realms shall be delivered. [X], the Prime One Daoist, shall ascend beyond the Three Realms, [his] name recorded among the ranks of the immortals.\n\n**Right:** The Lower Contract of the Prime One’s Alliance, inscribed on both sides.\n\n---\n\nFor those receiving the Threefold Alliance, five, seven, or nine persons must jointly swear the covenant; fewer is not in accordance with the law. This rite delivers from the sins of a hundred generations above and ensures passage through the palaces of the Three Realms below. The Threefold Alliance is the utmost [method] for transcending life and death to attain immortality, without error or deviation.\n\nAfter receiving the alliance, one must form a covenant with others. Before five days have passed, the reverse upper alliance shall be reported to the twenty-four prisons of the prefecture and county ordinances to deliver [X] and his seven generations of ancestors and parents. After the completion of the five-day purification, this secret oral transmission of the master may be conferred—worth ten thousand gold, transmitted only to the worthy, never to the unworthy.\n\n[X], male or female official of the [X] prefecture, [X] county, [X] township, and [X] village, aged [X] years.\n\n**Right:** [X] persons, having previously received the *Yellow Diagram*, the *Red Register*, the oral transmission of the Three Ones, the True One, and the Prime One, yet after years of cultivation still unable to fathom the mysteries of past karma, now present their credentials and approach your servant to receive the True One and Prime One’s contract and the Threefold Alliance Register.\n\n---\n\nRespectfully submitted by your servant [X], Wandering Master of the [X] Peak under Celestial Master [X] of the Black [Ordinance].\n\nI humbly state: According to the documents, though your servant is of lowly station, with flesh still tainted and bones exposed, I have been graciously favored by this enlightened age and the teachings of the venerable master. Overwhelmed by the burden, my efforts at instruction and transformation have been ineffective, and my exhortations have gone unheeded. Day and night, I tremble as if treading upon ice or a ravine.\n\nNow, the male and female officials and Prime One Daoists [X] and others, [X] persons aged [X] years, having previously received the oral transmission but not the secret method of the Prime One’s Threefold Alliance, each present their ritual credentials and approach your servant to swear the alliance. The primordial cinnabar, the red elixir, moves the divine spirits, though their entreaties are as faint as shadows.\n\nYour servant, having received their credentials, instructed them in the oral transmission. Yet the Dao is weighty, and the people are light—I dared not confer it lightly. Together, we ascended the Yellow Altar, where they received the covenant, swearing by Heaven and Earth, the Sun and Moon as witnesses. They carved their arms, drank the cinnabar, and pledged before the divine spirits never to recklessly transmit it.\n\nAfter receiving the alliance, they must not lightly disseminate or reveal its true essence. They shall uphold the master’s teachings as per this covenant. Any violation shall result in their bodies being handed over to the Three Officials of Heaven, Earth, and Water. After death, they shall harbor no resentment.\n\nI beseech forgiveness for all transgressions committed by [X] before receiving the transmission. May all be pardoned. I humbly implore...\n\nThe Most High Supreme Unity Emperor, the Merciful Father and Sacred Mother, have deigned to review and govern. Herewith, this humble servant confers the Threefold Covenant of the Supreme Unity’s Ascent to the Altar, transmitting its essential instructions.\n\n**Yellow Silk Petition:**\nFrom [X] Prefecture, [X] County, [X] Township, the male official [X], aged [X] years, and others, humbly beseech pardon and present this petition. Born of flesh and blood, I have been fortunate beyond measure to enter the gates of the Dao, belonging to the household under the governance of my master [X], who holds the Mandate of Heaven. In former times, by the grace of an enlightened era, I was permitted to study the secret Yellow Chart and Red Registers, the true and supreme teachings of the Three Ones and the Supreme Unity’s *Returning Chariot and Completed Contract*. Yet, though I have practiced for many years, my merits remain unestablished, and my transgressions are manifold. Day and night, I tremble with dread, as though treading upon ice or crossing a chasm. Though I have cultivated life and nurtured my primordial qi, and though I have received boundless grace, I have yet to fulfill the Nine Sincerities and One Hundred Twenty Deeds, nor have I offered reverence to the Thirty-Two Heavens or sought the method of transcending karmic destiny. The Great Covenant of the Supreme Three Heavens’ True One and Supreme Unity’s Ascent to the Altar is a teaching I have never before encountered. Not only have I been blinded by the Six Obstructions, but I have also known only advancement and forgotten retreat. Thus, I humbly present thirty-two ritual offerings, bringing them to the altar to beseech completion. Should I be deemed worthy of instruction, I swear never to recklessly reveal or betray its essence. Should I attack the root or sever the source, violating this covenant, I shall offer my body in repayment to the Three Officials of Heaven, Earth, and Water. Even in death, I shall harbor no resentment. Respectfully submitted in the year of [Tai Sui’s reign].\n\nFrom [X] Prefecture, [X] County, [X] Township, the male and female officials [X] and others, we respectfully list the ritual offerings as follows:\n\nOne *hu* of raw rice, sixty-four *chi* of fine silk, one bundle of willow firewood, one pair of brushes, two hundred fifty *jin* of iron, one cake of ink, two hundred fifty *chi* of black silk, one writing knife, twelve *liang* of gold, one large mat, two hundred forty *chi* of yellow silk, one *liang* of true pearls, one ritual headscarf, one coarse robe, one pair of gold rings, five ritual tables, one bright mirror, one five-colored ritual pouch for precepts, thirty-two thousand covenant coins, one brocade pouch for scriptures and collected texts, thirty-two *liang* of life-thread silk, one cold-water jar and spoon, one blue-green bronze sword, five sets of blended incense, one male and one female substitute of living flesh, one hundred twenty *chi* of radiant brocade, eighty *jin* of copper, eighty-one *chi* of blue-green silk, sixty-four *liang* of raw cinnabar, twelve *liang* of silver, one hundred sheets of large paper, three hundred sixty bolts of white silk.\n\nThe above thirty-two offerings are respectfully presented to the altar to receive the Threefold Covenant of the Ascent.\n\n**Petition:**\nIn accordance with the scriptural texts, though I am of humble station, I have been entrusted with the exalted duty of the Supreme Unity to seek out and transmit to the worthy and capable. As recorded in the registers, the male and female officials [X] and others, who have cultivated pure and refined qi, delight in the Dao and cherish life, have now received the Five Qi, mastering the yin-yang governance of the body and refining their qi over many years. Their talents qualify them for advancement to the highest ranks of the Supreme Three Heavens’ True One and Supreme Unity. They shall oversee the five hundred fifty-five myriad, five thousand five hundred fifty-five billions of all heavens, all suns, all moons, all provinces, constellations, and starry lodges, all immortal courts, sages, palaces, and mountain peaks, the deities of Heaven and Earth, the Five Peaks and Four Seas, the Three Rivers and Nine Jiang, the Four Seas and Eight Poles, the Nine Palaces and Eight Trigrams, the divine chambers, mountain spirits, and water numina, all myriad ghosts and ten thousand spirits. They shall universally gather the thirty-six thousand spirits, govern all numinous beings, command all officials, attend all immortals, and oversee the three *hun* and seven *po* of their households and states, the three ghosts and five spirits, the one thousand two hundred forms and shadows, and the ten thousand two hundred essences and luminosities—all shall come at once to refine and transform them. From this day forth, having received the Supreme Three Heavens’ True One and Supreme Unity, they must not betray the covenant of the Supreme Three Heavens, attack their master, recklessly transmit, or lightly reveal its teachings. They must select the worthy and transmit but once every thirty-three years, never violating this pact. Should they break this vow, their spirit-bodies shall sink into obscurity, forever becoming lowly ghosts, their lives reduced to dust. Their immortal names shall be erased, and they shall never again be counted among the ranks of immortals. They shall be eternally bound by the Three Officials’ judgment, summoned by the lords and clerks for examination. Only when their karmic debts are repaid may they be reinstated among mortals. Thus, we respectfully present this petition to the Supreme Three Heavens’ Most High Supreme Unity Emperor, the Supreme Three Heavens’ Most High Primordial Sovereign, the Supreme Three Heavens’ Great Dao and Myriad Ways, the Root and Origin of Heaven and Earth, the Primordial Beginning, extending upward to the Most High and downward to the boundless, reaching afar to the infinite and limitless, the subtle and myriad officials and spirits of the Supreme Three Heavens above the five hundred fifty-five myriad, five thousand five hundred fifty-five billions of heavens. We invoke the lords, generals, clerks, functionaries, messengers, scribes, minor officials, generals, officers, cavalry, and all attendant officials—five hundred fifty-five myriad, five thousand five hundred fifty-five billions of hosts—to descend as one from the Supreme Three Heavens above, from the canopy of Heaven to the depths of our bodies, from head to foot, suffusing our bones and joints, the five viscera and six bowels, the nine palaces and twelve spirit-chambers, the four limbs and five bodies, the one hundred eighty mechanisms, the three hundred sixty bone-joints, the orifices, defensive and constructive qi, sinews, bones, blood, and vessels. We beseech you to pacify our three *hun*, stabilize our seven *po*, immortalize our three *hun*, rectify our five spirits, generate our five viscera, align them with the Five Stars, and summon back the thirty-six thousand remaining spirits to their offices. May each be settled in their chambers, that the immortal Dao may be perfected, our forms ascend in flight, and we become True Persons. May our immortal lifespans be fixed at eighteen thousand years. We pray to the Supreme Three Heavens’ Supreme Unity, the Lord of Myriad Ways and Ancestor of Myriad Spirits, to send the Heavenly Immortals to guard our bodies, inspect the registers of the myriad spirits, and grant that the flying immortals, divine immortals, world-transcending immortals, divine humans, True Persons, Primordial Yang, Myriad Lives, Myriad Qi, Guiding Immortals, Embryonic Breath, Primordial Essence, Longevity-Extending, and Supreme Polarity Lords of the Supreme Three Heavens above may descend into our bodies, refining and transforming us without end.\n\nMay the Generals of the Supreme Unity, the Great One, the Lords of the Pure Tenuity Heaven, the Jade Capital Heaven, and the Great Scarlet Heaven descend in unison, leading their hosts of officers, soldiers, cavalry, and chariots, to enter our bodies. May they nurture our lives and cultivate our natures, restore our years and replenish our brains, circulate the generative qi and distribute the primordial breath. May the golden elixir, divine nectar, and jade fluid enter our bodies, accompanied by divine maidens to attend and guard us on left and right. May the Nine Heavens’ Prime Ministers erase our names from the registers of death and inscribe them in the Three Heavens’ records of life, granting us boundless existence with heaven and earth. May we traverse the world, our names inscribed upon the sacred mountains of the Six Directions. May we move freely among people, extending our years and increasing our longevity, warding off the five weapons, quenching fires and floods, dispelling official calumnies, illnesses, deaths, and misfortunes. May tigers, wolves, and fierce beasts, venomous creatures, vengeful foes, thieves, and bandits be submerged in the Yellow Abyss, buried ten thousand fathoms deep, never to emerge or spread falsehoods.\n\nShould any talisman masters, Daoist priests, or miscellaneous spirits of the Six Heavens’ former breath, or those who feast upon ghosts and spirits, attempt to intrude or conceal themselves, may the myriad spirits assist and escort us as we traverse the world. May the earthly deities and celestial spirits descend in every place we tread, manifesting the verification of the immortal Dao. May we surely achieve embryonic breathing, ingesting and guiding the divine breath, illuminating our inner and outer selves. May clouds course through our bodies, ascending to the Pure Heavens. May the Yellow Emperor and Laozi establish their grace, and may we befriend divine immortals, associating with True Persons. May we soar aloft, ascending to replenish the ranks of the Heavenly Immortals, riding clouds and driving dragons to pay homage to the Dao Lord. May we never age unto death, our luminosity equaling that of the sun and moon. May we fly and transcend, concealing or revealing ourselves at will, floating upon the wheel of existence. May our seven generations of parents, extending to the hundred million ancestors of myriad lineages, all ascend to the Three Heavens and be appointed to the ranks of immortal officials.\n\nWe humbly implore the Supreme Venerable, the Boundless Supreme Unity Lord, to bestow mercy and accept our plea.\n\n---\n\n**The Red Writs of the Three Covenants to be Conferred After the Breaking of the Pacts**\n**Rites of the Three Covenants of the Supreme Unity and Yellow Simplicity**\n\nWe reverently present the Yellow Simplicity and Cinnabar Covenant, addressing all disciples:\n\nWe, [Name] and others, affirm our allegiance to the Gate of Boundless Purity of the Supreme Clarity and Supreme Unity, where the True One and the Five Qi, the Supreme Unity and the Nine Palaces, are fully perfected, thereby attaining immortal deliverance. The Supreme Venerable, upon ascending the Heavenly Summit of Kunlun and entering the Seven Treasures Abbey, summoned the Celestial Master Zhang Daoling and declared:\n\n“Our Dao emerged from Non-Being, prior to the Great Beginning, unoriginated and yet nowhere unaccomplished. Formerly, upon this abbey, I received the wondrous Dharma. Through keen wisdom and focused devotion, I practiced and attained subtlety, penetrating the mysteries in pursuit of the Dao. None who ascend as immortals bear the name of negligence. Those who uphold the Dao of the Yellow Emperor and Laozi must master the secrets of life and death, ever fearing the Dharma and revering the precepts. Within the Gate of Life, there is but one path to life and nine paths to death. Tested by the Great Deliverance, one must ever tremble as if treading upon ice and blades, ever wary of poison lest it harm the self. Be humble and yielding, speak modestly, and lower oneself before others. Practice with diligence and endure hardship, never failing in filial piety and reverence. After receiving the precepts, uphold the Dharma and observe the prohibitions, never transgressing the numerical methods of the Nine and the One—the ultimate path of life.”\n\nThe Celestial Master bowed twice, pledged to uphold the covenant, and ascended to the rank of Celestial Master. Later, he transmitted the teachings to Wang Chang, Zhao Sheng, the Three Ladies of Luoyang, and the Three Dukes, all of whom attained ascension in broad daylight. The altar rites are as follows.\n\n---\n\nWe reverently invoke the covenant and oath, presenting them to the Three Officials. We, [Name] and others, who receive this covenant, swear by heaven and earth as our witness, by the sun and moon as our bond, and call upon our three generations of ancestors, five lineages of forebears, seven generations of parents, and ourselves to bear witness. We shall not lightly transmit or divulge the altar precepts, which may be taught to three persons over nine years. Should no worthy recipient exist in the world, we shall report to the Three Officials, open the original covenant, seal the precepts and matters therein, and conceal them within a mountain’s stone chamber, never violating the covenant.\n\nShould we uphold this pact, our seven generations of parents shall ascend to the Mysterious Palace, receive blessings from the Heavenly Officials, and attain immortal deliverance, their fortune flowing through ten thousand generations, their descendants forever honored. Should we recklessly transmit these teachings to the unworthy, our seven generations of parents shall descend to endure the trials of the Wind Blade, our bodies submerged in the River of Accumulated Nights, our misfortunes flowing through ten thousand generations, our descendants suffering eternal torment, drinking blood and consuming cinnabar, their divine hearts laid bare.\n\nWe open the seals of the Three Officials, witnessed by the sun and moon, heard by heaven and earth. After this covenant is sworn, the Controller of Destinies shall erase our names from the registers of death and inscribe them in the records of life. The Heavenly Officials shall register our immortal names, the Earthly Officials shall remove our death records, and the Water Officials shall sever our karmic trials. The Generals and Officers of the Three Officials’ Summoning Courts, along with the generals and officers we bear, shall protect our mortal bodies and ensure our immortal deliverance.\n\nShould our past karma or unresolved grievances prevent immediate ascension, we must undergo temporary corpse liberation, passing through the Great Yin. Having ascended the altar and undergone the Great Deliverance, our sins shall be eradicated, our blessings born, and our ascent assured. The Twenty-Four Spirits of the Divine Chamber and Blessed Hall shall guard our forms, preventing the dispersal of our souls and the decay of our flesh and bones. After twenty-four years, our forms shall transform and emerge. Though our karmic debts demand death, we shall transcend and revive, our withered bones receiving immortality. Though submerged or concealed, we shall be unbound and unrestrained—such is the power of ascending the altar and swearing the Three Officials’ covenant, transcending kalpas and bestowing the fortune of deliverance from death.\n\nWe must cultivate ourselves with clarity and caution, never daring to violate this pact.\n\n---\n\nWe reverently proclaim the covenant, addressing all disciples who share this altar and witness together:\n\nShould our master or parents encounter calamity, we shall collectively aid them. Should they suffer unjust imprisonment, we shall exhaust all means to rescue and deliver them swiftly, never abandoning them lightly or betraying the covenant. Should any fail to respond to such pleas for help, the afflicted shall invoke the covenant and beseech the spirits for deliverance. Those who violate the covenant shall endure trials, while those who uphold it shall receive blessings.\n\nShould we face calamity in perilous places, we shall, whether our master lives or has passed, silently pray at night, baring our cinnabar hearts to seek deliverance. Should we remain unrelieved, we shall report to the spirits of the luminous realm, who shall know our merit and transgression. The Generals and Officers of the Covenant, along with the Three Officials of the Altar, shall guard and protect us, ensuring our safety. We must only reverently uphold the covenant and never violate our oaths, thereby attaining immortal deliverance. The Guardian Generals and Officers shall record our merits and transgressions, while the Three Officials of the Altar shall adjudicate our sins and blessings. We must bear witness with clarity and caution.\n\nOn the first day of the [specific] month in the [regnal year] of the Great Year of [specific state], at [specific] prefecture, commandery, county, and village, under the qi-administering governance of Celestial Master [name] of [specific] Abbey, your servant [name], having received transmission from Daoist [name] of [specific] Abbey, hereby transmits to [name] of [specific] prefecture, commandery, county, and village the Three Covenants of the Yellow Plain Vermilion Alliance of the Most High.\n\nAll who ascend the altar shall inscribe their names in cinnabar upon yellow plain silk, bearing it upon their person. In life, they shall receive the contract of immortality; in death, they shall sever the roots of retribution. The Three Officials shall bear witness to their deliverance, and in every rebirth, they shall receive blessings, free from the entanglements of sin.\n\n**Rite of Transmission for the Three Covenants of the Yellow Plain of the Great One Ascending the Altar**\n\nFace east and strike the teeth twenty-four times.\n\nReverently summon the True Officials of the Five Corpsoreal Deities and the Immortal Qi Functionaries from within your servant’s body, along with the Twenty-Four Qi Functionaries of each: the Direct Envoys of the Great One’s Vajra Primordial Qi, the Divine Communicators, the Five Primordial Qi Functionaries, the Harmonizing Qi Functionaries, the Qi-Directing Functionaries, and the Celestial Functionaries. Also summon the Left Envoys of the Kingly Qi, the Right Envoys of the Balanced Qi, the Yin-Yang Divine Seal Clerks, the Immortal Transformation Clerks, the Scarlet Talisman Chariot Clerks, the Vajra Wind Courier Station Masters, and the Memorial-Presenting Clerks—twenty-four of each.\n\nSummon the True and Upright Officials of [specific] prefecture, commandery, county, and village, the Qi-Recording Overseers, the Examiners and Summoners of the Four Lords, and the various Generals and Officers. Also summon the Left and Right Balanced Qi Lords, the Left and Right Capital Inspectors, the Left and Right Enforcers of Balance, the Left and Right Enforcers of the Law, the Nine Qi Lords of the Nine Heavens of the East, the Three Qi Lords of the Three Poles of the South, the Seven Qi Lords of the Seven Conjunctions of the West, the Five Qi Lords of the Five Primordials of the North, the One Qi Lord of the Center, the Twenty-Four Qi of the Yangping and Lutang Abbeys, the Thirty-Six Quiet Chambers, the Generals and Officers under the Celestial Master’s command, the Officials of the Two Mysteries, Three Primordials, Four Beginnings, Five Powers, Six Harmonies, and Jiazi, the Lords of the Flying Immortals of the Eight Extremities of the Cosmos, the Lords of Nourishing Nature and Longevity, the Azure Dragon and Victorious Serpent Lords, and all others charged with executing this document.\n\nYour servant, acting on behalf of the male and female people, Daoist [name] of the Great One, having completed the Vajra Contract, or having ascended the altar for the Three Covenants of the Yellow Plain, now presents this memorial with one bow, placing the revealed memorial upon the jade table in the central courtyard. The Functionary Envoys, Generals, Officers, and Soldiers are requested to examine this matter. Should the verification of [name] and the conjoined qi of the guarantors be confirmed, summon those required to fulfill their duties. Once the task is accomplished, your servant shall present a memorial to report the completion, after which all shall return to their respective abodes. Awaiting the efficacious response, your servant prostrates himself before the memorial.\n\n**Right: Memorial for the Transmission of the Vajra Completion Contract**\n**Oral Memorial for the Transmission of the Great Contract of the Three Covenants of the Great One**\n\nThe male and female officials [names] of [specific] prefecture, commandery, county, and village, aged [number] years, styled [name], household under the mastership of [name], and the male and female officials of [name] Abbey—all of virtuous and benevolent nature, inherently gentle and refined, having cultivated qi for years, aligned themselves with the secret gates, and delved into the essentials of the true teachings—have ascended the path. Having received the Vajra Contract of the Great One, they now comprehend the secrets of the Three Qi and the Flying Immortals. Though they possess numerous contracts, they have yet to ascend the altar for the great covenant of life and death. Now, in true sincerity, they bind their bodies and pledge their bones, beseeching your servant to transmit the Great Contract of the Three Covenants of the Great One Ascending the Altar, the True and Luminous Great Taboo, the Three Hundred and Sixty Diagram Titles, and the One Thousand Two Hundred Oral Instructions, in accordance with the original methods of the former masters. Respectfully submitted.\n\nYour servant, [name], of the qi-administering governance of Celestial Master [name] of [specific] Abbey, bows twice and reverently addresses the Most High Primordial Great Dao, the Most High Lord Lao, the Most High Elder, the Great One Emperor Lord, the August Heavenly Thearch, the Primordial Lord of the Primordial Ultimate, the Venerable Ones of the Dao and Virtue, the Three Heavens’ Dharma Masters, the Orthodox Unity Perfected Ones, and the Executors under the Flying Immortal Lords:\n\nYour servant, having encountered the celestial communion of destiny and aligned with the Mysterious Teachings, bears the mandate to propagate the Dharma and transform the world. Searching for those of the Dao, I traverse the realms to deliver and elevate both celestial and mortal beings. Now, by virtue of karmic conditions from former lives, emerging from the Void Primordial, [name], male or female official of [specific] prefecture, commandery, county, and village, aged [number] years, has long been steeped in the Mysterious Teachings, mastering the true texts, receiving numerous contracts, and cultivating the true and secret practices. Though possessing the superior methods, they have yet to break the primordial oath. Now, they gather in earnest, binding their bodies and pledging their bones, beseeching your servant to transmit the Great Contract of the Three Covenants of the Great One Ascending the Altar, the Yellow Plain’s Witnessed Oath for Life and Death, and the Dao of Transcendence.\n\nFormerly, your servant received the covenant from the Great Cavern Perfected [name], charged with transmitting to worthy successors. Having observed [names]’s sincere devotion to the Dao and their potential for accomplishment, on the [specific] day of the [specific] month at [specific] mountain, we jointly established the yellow altar, witnessed the oath by the Five Thearchs, divided the talismans, broke the contracts, and pledged before Heaven and Earth. The secret instructions were transmitted, and the oral instructions were imparted.\n\nRespectfully, I first present this revealed memorial at [specific] prefecture, commandery, county, and village to the Celestial Bureaus. May the Great One Emperor Lord and the August Great Dao deign to observe and examine: if [names] possess the requisite bone structure, they shall be transmitted the Mysterious Capital’s methods in accordance with the Dharma. If they lack the bone structure, may they be verified and corrected, their names recorded in the Jade Registers of the Upper Heavens, and enrolled among the Celestial Immortals. On the [specific] day and hour, an auspicious time, at the sacred mountain, upon the yellow altar, we shall bow and pledge before Heaven and Earth, transmitting the Supreme and Mysterious Dao of the Primordial One, the great covenant of life and death, and the attainment of immortality in both life and death.\n\nRespectfully submitted, awaiting the efficacious response. Your servant [name], with utmost reverence and trepidation, bows twice and presents this memorial.\n\nYour servant [surname],\nBefore the August Great Dao, the Primordial Lord of the Three Heavens, the Great One Emperor Lord, and the Jade Emperor of the Grand Clarity,\nIn the [regnal year] of the Great Year.\n\nTo the Right, the Memorial:\n\nWith utmost reverence, this memorial is respectfully submitted by the Five-Body Immortal Officials, the mounted generals, the flying ministers, and the ascending servants. Presented to the Jade Chamber beneath the Supreme Left Lord, it is to be delivered to the Jade Maidens of the Fragrant Waist, and the like. Should any errors, omissions, or deviations from the ancient methods be found in their words, may they be examined and corrected according to the original scriptures. If any violate or intercept official documents, may the immortal officials, mounted generals, and divine riders seize and deliver them to the local prisons, where they shall be punished according to the offense. May the matters herein submitted be conveyed upward, and may a response be awaited in due course. Once the matters presented are concluded, may the immortal officials, officers, and soldiers depart, each returning to their palaces, governing the Five Palaces and Six Treasuries, resuming their posts and duties. On the appointed day, they shall be summoned forth again. Beat the drum twice, sound the three qi-chants, and conclude.\n\n**Ritual for the Transmission of the Three Covenants of the Great One**\n\nFace east and strike the teeth twenty-four times. Reverently summon forth the divine immortals within the servant’s body: the Directing Envoy of the Orthodox Unity Divine Officials, the Functionaries of Yin and Yang, the Radiant Light Envoys of Qi-Circulation, the Left and Right Official Envoys, the Yin-Yang Divine Clerks of the Qi-Chariot, the Scarlet Talisman Clerks, the Courier Riders of the Steadfast Wind, the Flying Dragon Riders, the Left and Right Dragon-Tiger Lords, and the Scarlet Flying Immortal Youths—twenty-four of each. Let those who emerge be clad in solemn attire, arrayed in full regalia. Reverently notify the True Officials of Qi-Registration in such-and-such prefecture, county, and village; the Inspecting and Summoning Four Lords and their officers; the local deities of the communities and hamlets; the Earth Spirits; the supervisory divine immortals of the eight directions; and all officials in their true ranks, bound by the indissoluble contract of the Heavenly Master, the Great One’s Qi, the Boundless Vajra, and the Golden Tablet. The Master of the Sacred Peak, your servant [name], bows twice and respectfully memorializes the Supreme Boundless Dao, the Supreme Venerable Lord Lao; the Lords and Elders; the Great One Emperor Lord; the Heavenly Emperor Lord; the August Great Dao; the Heavenly Master; the Three Masters; the Great One Divine Immortals; the True Statutes of the Jade Registers; the Envoys of Transmission Rituals; and the Directors of Flying Immortal Affairs.\n\nYour servant, through ten thousand kalpas of karmic affinity, has fortuitously encountered the Great Law. By fortunate circumstance, I met the Great Cavern Dharma Master, the Perfected One [name], who transmitted to me the Great Covenant of the Altar, the oaths of life and death, the Dao of ascension, the essential secrets of the Mysterious Origin, and the contracts of the host of Perfected Ones. By the good fortune of past lives’ awakened nature, I have received the Dharma for many years. Though I have yet to perceive the hidden or witness the unseen, to sit in stillness or stand in dissolution, I humbly hope for the descent of the Mysterious, that I may bear its statutes in my person. In accordance with the statutes, I transmit it to worthy successors.\n\nIn such-and-such prefecture, county, and village, [name], aged [number] years, previously received the Yellow Register Covenant and was commanded to uphold the Five Vajra Covenants. Having cultivated qi for many years and mastered the disciplines, he now presents his credentials and sincerity, seeking to receive the Great Secrets of the Three Covenants of the Altar. Witnessing the original methods of my former master, I, together with [name], establish the altar, invoke the Five Emperors as witnesses, divide the gold, break the tablets, and proclaim the cinnabar oath. After [name] receives the Dao, may it forever be his personal treasure. He must not undermine his roots or sever his foundation, revile his master or slander the Dao, reveal essential secrets to the unworthy, or disseminate sacred texts among the worldly. Should he violate this even once, his parents in life and death shall sink into eternal damnation, their sins irredeemable for ten thousand kalpas. Respectfully submitted for your consideration and enactment. Your servant [name], with utmost reverence and trepidation, bows twice.\n\n**Next: Reading of the Tablet**\nRead the Yellow Covenant.\n\n**Next: Drawing the One**\nDraw the One: with the left hand pointing to Heaven, the right hand drawing on Earth, then the left hand pointing to the Center. The master then declares:\n*\"Bound by the Heavenly Master of such-and-such district, [name], from the Great Cavern disciple [name], I transmit the Altar Covenant Tablet of the Great One. Now, in accordance with the Dharma, I transmit it to the disciple [name], who receives this covenant. He shall abide by the great oath of the Perfected Master’s altar, never undermining his roots or severing his foundation, reviling his master or slandering the Dao, or revealing the sacred covenant. Should he violate this even once, he shall perish and bear the guilt, sinking into eternal damnation. Above, he invokes the numinous spirits of Heaven; below, he invokes the deities of Earth; and in the center, he swears before the worthy. The Three Numinous Covenants bear witness, and none shall betray their pledge. Together, we draw the One as a token.\"*\n\n**Next: Tying the Hair**\nMake the first knot, declaring: *\"The Heaven of Pure Tenuity.\"*\nMake the second knot, declaring: *\"The Heaven of Vast Surplus.\"*\nMake the third knot, declaring: *\"The Heaven of Great Redness.\"*\n*\"By the true emperors of the Three Heavens above, we swear anew, tying our hair at the altar of the covenant, never to betray the sacred pact.\"*\n\n**Next: Inscribing the Register**\nDeclare: *\"The Great One of the Mysterious Elder, the Barrier Gate.\"*\nInscribe the center, declaring: *\"The Great Supreme Gate of the Great One, the Stone Gate.\"*\n\n**Next: The Disciple’s Oath over the Cinnabar Water**\n*\"The male/female Daoist of the Great One, [name], of such-and-such prefecture, county, and village, dares to proclaim to the Cinnabar Water: I, [name], delight in the immortals and revere the sacred, and have come to the Boundless Daoist of the Great One, [name], to receive the Great Tablet of the Three Covenants of the Altar, the Luminous True Great Name, the three hundred sixty diagrams, and the one thousand two hundred oral secrets. As a disciple, I must not betray the master’s Dao, recklessly transmit it to the worldly, or violate the covenant, lest my clan be overthrown and I perish for breaking my oath. Together, we swear by the Cinnabar Water, pointing to Heaven and drawing on Earth to invoke the divine spirits. Swiftly, swiftly, in accordance with the statutes!\"*\n\n**Next: The Master’s Command over the Cinnabar Water**\n*\"The Boundless Daoist of the Great One, [name], dares to proclaim to the Cinnabar Water: In such-and-such prefecture, county, and village, [name] seeks to receive from me the secrets of the Great Tablet of the Three Covenants of the Altar and the Luminous True Great Name. May the myriad divine spirits monitor [name] as a disciple, that he never betray the covenant. Above, the Three Heavens and the Venerable Lord Lao bear witness. Swiftly, swiftly, in accordance with the statutes!\"*\n\n**Next: Holding the Cinnabar Water**\nThe master holds the Cinnabar Water with his left hand, the disciple with his right, and together they sip it three times, the disciple first, then the master.\n\n**Ritual of the Offering Altar**\nPrepare five offering trays and five incense burners, with five portions of dates, and face east to sacrifice to the Five Emperors.\nPrepare nine offering trays and nine incense burners, with nine portions of dates, and face east to sacrifice to the Nine Lords of the Great One.\n\n*\"The Perfected One of the Boundless Great One, the Heavenly Master of such-and-such district, your servant [name], respectfully presents this offering to the Azure Emperor of the East, the Vermilion Emperor of the South, the White Emperor of the West, the Qi Emperor of the North, the Yellow Emperor of the Center, the Great One Emperor Lord, the August Great Dao, and the Jade Emperor of the Grand Clarity. With nine billion myriad riders, they shake Heaven and move Earth, descending upon this sacred peak and imperial altar to partake of this humble offering. May their numinous presence deign to grace the world, and in their compassion for the transgressions and shortcomings of living beings, I humbly beseech their forgiveness and pardon. I bow twice.\"*\n\nNext, the recipient of the contract shall first perform five bows. Then, the master shall present the contract to the disciple with his left hand, and the disciple shall receive it with his left hand. After circumambulating the body three times, he shall face east and bow nine times in three sets. Then, he shall face north and bow nine times. He shall bow three times in three sets to the Lord of the Great One, and then bow nine times to the master. Next, both shall rise, and at the earthly gate, they shall point to heaven and trace upon the earth, circling left three times and right to summon the seven generations of the disciple’s ancestors as witnesses, as fully prescribed.\n\n**Next, the Rite of the Weighty Kalpa:**\nRespectfully, from within this servant’s body, the five bodily Perfected Officials and Attendants emerge—two hundred forty Attendants of the Great One’s Vajra Longevity, two hundred forty Attendants of the Great One’s Kalpa-Transcending, two hundred forty Attendants of the Great One’s Life-Prolonging, two hundred forty Jade Maidens of the Great One’s Azure Waist, two hundred forty Jade Maidens of the Great One’s Ehuang, two hundred forty Generals and Attendants of the Five Venerable Lords, two hundred forty Attendants of Eternal Longevity, two hundred forty Generals and Attendants each of the Eastern Nine Yi, Southern Eight Man, Western Six Rong, Northern Five Di, and Central Three Qin, a thousand chariots and ten thousand riders descending from the canopy of heaven, Attendants and couriers of the刚风骑驿马上章, each two hundred forty in number. Now, to bestow upon [name] the Great Secret of the Three Pacts of the Great One’s Ascent to the Altar and the Register of Illuminated Perfection, or the Vajra Single-Word Secret—upon [name]’s reception of the Dao, may he attain longevity and enduring vision, robed in the same vestments as the immortals and sages, bearing the sacred vessel as an equal. May his spirit shine without seeking, and may divine elixirs, golden liquors, numinous mushrooms, and myriad herbs refine his form. May the thousand Dao and ten thousand spirits serve him in sitting, rising, walking, and resting. May the Great Yang stand to his left and the Great Yin to his right, the Azure Dragon and White Tiger flanking him, the Vermilion Bird and Dark Warrior guarding front and rear. May celestial spirits descend and earthly spirits emerge, the Five Venerable Spirit Lords expunging [name]’s name from the register of death, inscribing it in azure script on yellow tablets, and elevating his seven generations of ancestors to the Southern Palace of Rebirth. May his entire household enjoy eternal extension. Should [name] violate this pact even once, may he be punished by the stones of Mount Meng, his bones filling the Three Rivers, forever bound as a lowly ghost and eternal prisoner of the earth. All shall be as the contract decrees, in accordance with the commands of the Most High Lord Lao, the Host of Venerable Ones of the Boundless Dao, the Supreme Mysterious Elder, the Five Qi of Virtue and Power, the Lord of Myriad Lives, Myriad Salvations, and Myriad Blessings, the Heavenly Worthy, the Newly Manifest Lord Lao of the Supreme Clarity, the Primordial Elder of the Three Heavens of the Boundless Dao, the Most High Lord Lao, the Heavenly Worthy of the Three Qi, the Heavenly Emperor, and the Five Qi of the Celestial Mandate.\n\n**From the Terrace of Grand Mystery, the Orthodox Unity, the Master of Balanced Qi, the Celestial Master of such-and-such district, the Great One Daoist, the remote descendant of the Most High, this humble servant [name] bows twice and respectfully declares:**\n\nIn accordance with the scriptures, we, your servants, are but withered bones and crawling insects, yet our descendants for a thousand generations have been fortunate to dwell within the gates of the Dao. By the great grace bestowed upon us, despite our dullness and folly, we have cherished the methods of life. We have been favored by our venerable masters, who granted us the contracts and commands of the Great One. Though our merits are meager, we aspire to the lofty Perfected Ones. On this day of such-and-such month, together with our fellow disciples [names], we approach the Central Palace of the Boundless Great One, the Daoist abbey of such-and-such district, in such-and-such prefecture, county, township, and village, to receive the Supreme Pacts of the Great One’s Ascent to the Three Heavens, the Three Oaths of Life and Death, and the Register of the Altar. First, to deliver the suffering souls of our seven generations of parents from the dark realms, and next, to ascend and deliver the transgressions of life and death for [names], their rotting bones and exposed flesh. Though we have rendered no slight service, we have been granted mountains of favor—gifts beyond the worth of your servants’ foolishness. Overwhelmed by this profound grace, we prostrate ourselves and present this petition in gratitude.\n\nWe humbly pray that the attending officials will take pity on us and inscribe our names in the Jade Register of the Supreme Clarity’s Immortal Capital, that we may be counted among the seed-people of the immortals. We respectfully dispatch the Generals and Attendants of the Three Officials from within our bodies—the Celestial Official’s Examiner, the Terrestrial Official’s Examiner, the Aquatic Official’s Examiner, the Examiners of the Pure Tenuity Heaven, the Jade Clarity Heaven, and the Great Red Heaven—and the Perfected Officials of the four directions in this locale, who oversee the infusion of qi and the scrutiny of all attending Generals and Attendants. We entrust our lives and vital qi to the venerable elders. Having prepared all that is fitting for the wondrous and mysterious Central Mystery Altar upon the mountain’s peak, beneath the Great Yang, we prostrate ourselves and present this vermilion petition to the Most Supreme Great One’s presence.\n\nTogether with your servants [names], we make this solemn declaration to the august spirits above and point to the earthly deities below. Presumptuously, we transmit this grace, having received the favor of the Illuminated Perfected Lord of the Mysterious Ultimate, whose radiance infuses us with qi. We respectfully invite the Perfected Immortals of the Boundless and Natural, the Primordial Heavenly Emperor and the Supreme Primordial Lord, bearing their names and titles, leading their retinues of chariots and riders, the Five Stars and Five Emperors, the Nine Palaces and Five Marchmounts, the Four Seas, the Jade Armillary and Jade Balance, the Three Rivers and Nine Jiang, the divine armies of immortals, the Great One’s chariot of the single shaft, the horses of the Boundless before, and the true spirit and essence behind. May they attend the Five Emperors’ presence, the immortals’ chariots and riders flanking left and right, banishing all inauspicious omens before and all calamities behind. May the Jade Armillary revolve above our heads and the Northern Dipper tread beneath our feet. May the sun, moon, and Five Stars lead before and follow behind, shaking heaven and moving earth as they descend in perfect order to left and right. Together with your servants [names], may we be received in the Palace of the Three Primordials, becoming lords of the divine immortals and emperors. May the life-giving qi of the Three Heavens be extended to us, the divine elixirs of the Great One, the golden liquors and jade nectars entering the eighty-one palaces and twelve spirit chambers of our bodies, the Four Inflows of the Great Mystery. May the five spirits and essence of the Great One, the five qi as adornments, the three elixirs of the Nine Origins, refine our lives and reverse death, ascending to the morning’s zenith. May they infuse the Mysterious Palace, soaring over the Five Marchmounts, rising high and drifting aloft, their radiance illuminating the Golden Gates, their phoenix-like ascent to the Purple Court. May the immortal Dao swiftly be accomplished, feathers sprouting in due time. May we roam the eight wilds, play upon the eight terraces, traverse Hua and Huo, and be granted the cinnabar essence, the ninefold numinous convergence. May our seven generations of ancestors ascend and be delivered, their souls entering the homeland of the Dao, the halls of leisure and joy, where clothing and sustenance arise naturally.\n\nFor all who share this pact, when the day of reckoning arrives, we shall rescue and deliver one another, with the deliverance of our masters as our foremost duty, followed by our fellow initiates. From this day forward, we dare not betray the words of the Three Pacts. We shall revere our masters and hold goodness as our priority. For past sins and transgressions against the pact, we humbly beseech forgiveness and pardon.\n\nWe humbly invoke the boundless grace of the Supreme Venerable Dao, the Most High Mysterious Ancient, the Three Qi Heavenly Emperor Lord. Through the direct envoys of the Two Bureaus, the Orthodox Unity Merit Officers, the Upper Right Bureau Messengers, the yin-yang divine writ officials, the chariot-bearing vermilion talisman officers, the刚风 courier post riders, and the memorial-presenting officials—each pair in their station—we, your servants, having received the Three Pacts of the Great One, now prostrate ourselves for three days to offer this petition of gratitude. One scroll of thanksgiving is hereby submitted to the Celestial Bureaus, awaiting your decree. With utmost reverence and awe, we bow our heads and kowtow twice.\n\n*Memorial of Thanksgiving after Three Days.*\n\n**The Luminous Statutes of the Four Poles: Texts and Precepts for Liberation**\n*Composed by the Assembly of the Ten Thousand Immortals*\n\nTo receive the thirty-six sacred scriptures of the Numinous Treasure without submitting a *huian* is to remain barred from transmission for ten thousand kalpas. Once the *huian* is submitted but the Three Pacts of the Great One—the Golden Perfection of the Altar’s Threefold Alliance—are not fulfilled, the Seven Mysteries shall not depart from Dengdu. How then may one presume to take disciples? Only upon completing the Three Pacts do the Seven Mysteries transcend; life and death become as one with the immortals. Then the *huian* is conferred, and one is ordained as a Master of the Cavernous Mystery.\n\nShould the seven generations of ancestors remain unredeemed or the Three Pacts be broken, to lightly bestow the *huian* is to incur the sins of leaking scriptures and profaning the sacred. By the *Luminous Statutes of the Four Poles*, one shall suffer the trial of the Wind Blade; by the Three Pacts’ covenant, the living and the dead shall be liberated, their names inscribed in the heavens. Thus is one ordained as a Master of the Numinous Treasure.\n\nTo receive the scriptures of the Numinous Treasure’s liberation without manifesting it to one’s master is to leave the register of death unbroken and one’s name absent from the Jade Texts. Though one may hold the sacred scriptures, they shall never be transmitted, and the Great Dao shall remain sealed—bringing only harm to oneself. Upon completing the transmission, one becomes a conduit of liberation, manifest above in the heavens and recorded below upon the earth. One’s name resounds among the perfected as a master; by the upper pact with the Five Emperors, one is a Master of the Cavernous Mystery. Without such merit, to lightly initiate disciples is to incur the sins of reckless transmission and error. The master shall suffer the Wind Blade, bound for ten thousand kalpas without reprieve. Let future generations heed these words and not treat them lightly, lest they be ensnared in the net of transgression, sinking into eternal damnation without pardon. Judgment falls under the Four Poles Bureau.\n\nIn times of urgent peril or affliction, call upon the name of the Great One. Grasp the Dao Father with your left hand, then raise your head and thrice invoke the name of the Boundless Great One. Say: *\"I now face dire straits—pass me through fire and water, beneath the white blade, and deliver me within nine breaths.\"* Know the Dao as divine; know the Dao as true. Turn left, look back twice.\n\n*Officers of the Twelve Branches:*\n- **Zi (Rat) Hunter:** Xu Mingta and two others—rat-headed, human-bodied, clad in qi-robes, bearing a spear.\n- **Chou (Ox) Hunter:** Qin He—ox-headed, human-bodied, clad in qi-robes, bearing a spear.\n- **Yin (Tiger) Hunter:** Xu Fang—tiger-headed, human-bodied, clad in azure robes, bearing a sickle.\n- **Mao (Rabbit) Hunter:** Xu Ze—rabbit-headed, human-bodied, clad in azure robes, bearing a sickle.\n- **Chen (Dragon) Hunter:** Xu Huang—dragon-headed, human-bodied, clad in azure robes, bearing a sickle.\n\n**Si (Snake) Hunter:** Xu Qian—snake-headed, human-bodied, clad in crimson robes, bearing a halberd.\n**Wu (Horse) Hunter:** Sima Ji—horse-headed, human-bodied, clad in crimson robes, bearing a halberd.\n**Wei (Goat) Hunter:** Gongsun Xi—goat-headed, human-bodied, clad in crimson robes, bearing a halberd.\n**Shen (Monkey) Hunter:** Shi Sheng—monkey-headed, human-bodied, clad in white robes, bearing a crossbow.\n**You (Rooster) Hunter:** Shi Shuai—rooster-headed, human-bodied, clad in white robes, bearing a crossbow.\n**Xu (Dog) Hunter:** Xu A—dog-headed, human-bodied, clad in white robes, bearing a crossbow.\n**Hai (Boar) Hunter:** Gongsun Xi—boar-headed, human-bodied, clad in black robes, bearing a spear.\n\nThe true names of the Twelve Branches’ Hunters are listed above. Wear the talisman and invoke them by name; do not transmit this to the unworthy. Guard this secret with care.\n\nMaster Dai transmitted this to Xie Yingchuan; Xie Yingchuan to Daoist Chen Yi; Daoist Chen Yi to Mother Zhongdu; Du to Liu, the Daoist Attendant-in-Ordinary; Liu to Daoist Ding Xuanzhen.\n\n**Nine Harmonies Incense Method:**\nWhen burned, its fragrance reaches nine *li*, moving the spirits and gods. The ingredients are:\n- One *jin* of aloeswood,\n- Three *liang* of *qingmu* incense,\n- Three *liang* of *jia* incense,\n- One *jin* of frankincense,\n- Three *liang* of *zhantang* incense,\n- One *jin* of *xie* incense,\n- One *jin* of *qingjian* incense,\n- One *jin* of *quetou* incense,\n- Twenty dried *daqian* jujubes.\n\nGrind each of the nine ingredients separately, then blend with white honey until thoroughly combined. Seal in a vessel for three nights; after three days, the incense is ready. Its fragrance carries nine *li*. This method is secret and must not be recklessly transmitted. To summon the gods or compound elixirs, burn it, portioning small amounts into separate containers to prevent the *qi* from dissipating. This is the ancient *Nine Harmonies* incense.\n\nHere ends the *Orthodox Unity Scriptures, Ritual Registers, and Liturgical Texts*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "正一法文法箓部仪 经名：正一法文法箓部仪。 撰人不详，约出於南北朝。 系早期天师道经典《正一法文》残本之一。 一卷。 底本出处：《正统道藏》正一部 正一法文法箓部仪 黄素三盟登坛仪 某国号某年太岁某某月朔日子，某时系天师某治黑太一道士三洞法师五岳游行先生，某郡某县某乡某里真人，男官某昔从三洞法师太一道士，男官某受老君元义天地日月五星，上三天真一太一普督五亿五万五千五百五十五亿万重诸天，诸日月星辰，诸仙府诸世问请地山岳，天神地祇，五岳四读，三河九江，四海八极，山神水灵，千鬼万灵，一切皆属上三天真一太一，今谨以某岁月朔日子某时，传付某郡县乡里真人某甲，年如干岁，禀黑清淳，好道乐生，阴阳中和，五黑治身，先受黄图契令真天赤箓，真天三一真一太一素券，从来积年未能飞仙，今求进受上三天真一太一三十二天帝位符信，受持金刚，分真形投金鱼，称与诸天地水三官结盟，对共分金破契，刻臂喻血饮丹，结发身命为誓，与某甲共为一身，同心合契，奉行天真，修行神仙志同齐举，飞升上天，不得耽染色欲，不专正一，一旦受道之后，三十六年遇贤听传可授之人，不得妄传，不得自欲高位不崇根本，背向异辞，二心两舌，诽谤师道，攻伐师主，一日一违负契，令身谢三官，长为下鬼，削除生名，不得怨恨，甲自好乐神仙，时不拘迫，手共画一为信。 右太一真盟上契左右书之 国号某年太岁某月朔日子，某时某郡县乡里男女官太一道士真人某，甲年如干岁诣臣某度受太一登坛盟约，真一口诀结盟，拔度生死，不得负违，一如老君律令。 右太一中盟契 系天师某治黑五岳游行先生，臣姓某乙，以去某年太岁某月某日某时，从三洞法师阳平治功平五黑左平黑某岳先生，真人姓某乙，受太一真契三盟之法，拔度生死，上迁九幽之中，七祖名籍，下度己身三男之庭，保成上仙太一同辕，太一道士，某郡县乡里男女，生某乙於某郡县乡里中结盟，奉受拔发结发，生死为誓，不负太一帝君神仙大盟律令，五帝魔王过度，太一道士甲，生死三界，名上仙品。 右太一下盟左右书之 夫受三盟者，应须五人七人九人同共结盟，臧此不合法也，上拔度百曾之罪，下过度三界宫真妙之事，极於三盟，生死成仙，无有差违，受者结人为盟，未至五日逆上盟刺条，郡县治位告下二十四狱，拔出甲等，七祖父母迁达沐浴竟五日，然后而授此秘之师口，万金不传，传之后贤，非贤勿泄。 某郡县乡里，男女官某甲，年如干岁。 右如干人，先受黄图赤箓，三一真一太一一言之诀，从来积年，未能幽究宿绿，今资信诣臣，求受太一真一契，三盟都券请授。 谨状系天师某治黑某岳先生，臣姓某乙 上言，谨按文书，臣以人微，肌腥骨见，谬蒙明时，师老布化之际，过泰负荷，教化无效，宣劝通替，夙夜战栗，如履冰谷，有男女官太一道士某甲等，如干人，年如干岁，先受诀言，未受太一三盟秘法，今各资法信，诣臣乞结盟，一兀元丹赤，感於神明求乞之至微於影像，臣辄受法信，教以诀言，道重人轻，不敢便授，共登黄坛，授以盟言，要誓天地，日月为盟，刻臂饮丹，誓告神明，不敢妄传，甲受盟之后，不得轻传，泄露真要，自当奉承师法，皆如今约，一日一负违今誓，甲当以身谢天地水三官，万殁之后，不敢有怨，乞原甲未受诀之前所犯，一切赦贷，恩惟",
      "translated_text": "**Zhengyi Ritual Texts of the Registers and Rites Section**\n\n**Title:** *Zhengyi Ritual Texts of the Registers and Rites Section* (*Zhengyi Fawen Falu Buyi*). Author unknown, likely composed during the Northern and Southern Dynasties. One of the surviving fragments of the early Celestial Master Daoist classic *Zhengyi Fawen*. One scroll.\n\n**Source:** *Daoist Canon of the Zhengtong Era* (*Zhengtong Daozang*), Zhengyi Section, Part One.\n\n---\n\n### *Yellow Plain Threefold Alliance Ascension Altar Rite*\n\nOn the first day of the [X] month in the [X] year of the reign of [X] state, at the [X] hour, [X], a Master of the Three Caverns, Wandering Master of the Five Peaks, and Black Prime One Daoist of the [X] Ordinance under Celestial Master [X], residing in the [X] prefecture, [X] county, [X] township, and [X] village, hereby transmits the following:\n\nFormerly, [X], a male official, received from the Master of the Three Caverns and Black Prime One Daoist [X] the primordial mandate of Lord Lao, the unity of Heaven and Earth, the Sun and Moon, and the Five Planets, as well as the Upper Three Heavens, the True One, the Prime One, the Universal Overseer of the Five Hundred Fifty-Five Quintillion, Five Hundred Fifty-Five Billion, Five Hundred Fifty-Five Million Layers of All Heavens, all the sun, moon, and stars, all immortal courts, all worldly and otherworldly mountains and peaks, celestial spirits and earthly deities, the Five Peaks and Four Seas, the Three Rivers and Nine Streams, the Four Seas and Eight Extremities, mountain gods and water spirits, the thousand ghosts and ten thousand spirits—all of which belong to the Upper Three Heavens, the True One, and the Prime One.\n\nNow, at the [X] hour on the first day of the [X] month in the [X] year, [X], a Perfected of the [X] prefecture, [X] county, [X] township, and [X] village, aged [X] years, of pure and sincere disposition, devoted to the Dao and fond of life, harmonious in yin and yang, with the Five Blacks governing the body, having previously received the *Yellow Diagram* and the *True Heaven Red Register*, the *True Heaven Three Ones*, the *True One*, and the *Prime One Plain Contract*, yet after years of cultivation still unable to ascend as an immortal, seeks to advance and receive the talismanic credentials of the Thirty-Two Heavenly Thrones of the Upper Three Heavens, the True One, and the Prime One.\n\n[He] shall hold the Vajra, divide the true form, and cast it into the golden fish, swearing an alliance with the Three Officials of Heaven, Earth, and Water. Together, they shall split the golden contract, carve the arm to drink the cinnabar blood, and bind their hair and lives in oath, becoming one body with [X], united in heart and covenant to uphold the celestial Perfected, cultivate the immortal path, and ascend together to Heaven.\n\n[He] must not indulge in sensual desires or deviate from the Orthodox Unity. After receiving the Dao, for thirty-six years, should an worthy recipient appear, transmission may be granted. No reckless dissemination is permitted. [He] must not seek exalted rank while neglecting the root, nor turn away with false words, harbor dual intentions, slander the Dao of the master, or assault the master’s authority. Any violation of this covenant shall result in [his] body being handed over to the Three Officials, becoming a lowly ghost forever, with [his] name erased from the registers of the living. [He] shall harbor no resentment.\n\n[X], of his own volition and joy in the immortal path, without coercion, hereby marks this as a pledge.\n\n**Right:** The Upper Contract of the True One’s Alliance, inscribed on both sides.\n\n---\n\nIn the [X] year of the reign of [X] state, on the first day of the [X] month, at the [X] hour, [X], a male or female official, Prime One Daoist, and Perfected of the [X] prefecture, [X] county, [X] township, and [X] village, aged [X] years, approaches your servant [X] to receive the Prime One’s altar alliance and covenant, the oral transmission of the True One’s alliance, and deliverance from life and death. No violation is permitted, as per the statutes and decrees of Lord Lao.\n\n**Right:** The Middle Contract of the Prime One’s Alliance.\n\n---\n\n[X], a Wandering Master of the Five Peaks under Celestial Master [X] of the Black [Ordinance], your servant [X], having previously, in the [X] year, on the [X] day of the [X] month, at the [X] hour, received from the Master of the Three Caverns, the Left and Right Black Masters of the Yangping Ordinance and the Five Blacks, and the [X] Peak Master [X], the method of the Prime One’s True Contract and Threefold Alliance, for deliverance from life and death, ascension from the Nine Dark Realms, the registration of the seven generations of ancestors, and the deliverance of [his] own body and three sons, ensuring their attainment of immortality alongside the Prime One, hereby records the following:\n\nThe Prime One Daoist [X], male or female, born [X] in the [X] prefecture, [X] county, [X] township, and [X] village, swears an alliance, receiving the tonsure and binding [his] hair, pledging life and death to the covenant, never betraying the great alliance of the Prime One Emperor Lord and the immortal statutes. The Five Thearchs, demon kings, and all beings of the Three Realms shall be delivered. [X], the Prime One Daoist, shall ascend beyond the Three Realms, [his] name recorded among the ranks of the immortals.\n\n**Right:** The Lower Contract of the Prime One’s Alliance, inscribed on both sides.\n\n---\n\nFor those receiving the Threefold Alliance, five, seven, or nine persons must jointly swear the covenant; fewer is not in accordance with the law. This rite delivers from the sins of a hundred generations above and ensures passage through the palaces of the Three Realms below. The Threefold Alliance is the utmost [method] for transcending life and death to attain immortality, without error or deviation.\n\nAfter receiving the alliance, one must form a covenant with others. Before five days have passed, the reverse upper alliance shall be reported to the twenty-four prisons of the prefecture and county ordinances to deliver [X] and his seven generations of ancestors and parents. After the completion of the five-day purification, this secret oral transmission of the master may be conferred—worth ten thousand gold, transmitted only to the worthy, never to the unworthy.\n\n[X], male or female official of the [X] prefecture, [X] county, [X] township, and [X] village, aged [X] years.\n\n**Right:** [X] persons, having previously received the *Yellow Diagram*, the *Red Register*, the oral transmission of the Three Ones, the True One, and the Prime One, yet after years of cultivation still unable to fathom the mysteries of past karma, now present their credentials and approach your servant to receive the True One and Prime One’s contract and the Threefold Alliance Register.\n\n---\n\nRespectfully submitted by your servant [X], Wandering Master of the [X] Peak under Celestial Master [X] of the Black [Ordinance].\n\nI humbly state: According to the documents, though your servant is of lowly station, with flesh still tainted and bones exposed, I have been graciously favored by this enlightened age and the teachings of the venerable master. Overwhelmed by the burden, my efforts at instruction and transformation have been ineffective, and my exhortations have gone unheeded. Day and night, I tremble as if treading upon ice or a ravine.\n\nNow, the male and female officials and Prime One Daoists [X] and others, [X] persons aged [X] years, having previously received the oral transmission but not the secret method of the Prime One’s Threefold Alliance, each present their ritual credentials and approach your servant to swear the alliance. The primordial cinnabar, the red elixir, moves the divine spirits, though their entreaties are as faint as shadows.\n\nYour servant, having received their credentials, instructed them in the oral transmission. Yet the Dao is weighty, and the people are light—I dared not confer it lightly. Together, we ascended the Yellow Altar, where they received the covenant, swearing by Heaven and Earth, the Sun and Moon as witnesses. They carved their arms, drank the cinnabar, and pledged before the divine spirits never to recklessly transmit it.\n\nAfter receiving the alliance, they must not lightly disseminate or reveal its true essence. They shall uphold the master’s teachings as per this covenant. Any violation shall result in their bodies being handed over to the Three Officials of Heaven, Earth, and Water. After death, they shall harbor no resentment.\n\nI beseech forgiveness for all transgressions committed by [X] before receiving the transmission. May all be pardoned. I humbly implore...",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1321,
      "start_sentence": 0,
      "end_sentence": 18,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.382399559020996,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\正一法文法箓部仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "太上太一帝君，慈父圣母，则蒙 省理。 右操臣度太一登坛三盟付授诀言。 黄素中章 某郡县乡里，男官某甲，年如干岁等乞恩辞，某素以胎生肉人，千载有幸，得在道门，户属师主某甲治，以系天命，昔蒙明时，得参中秘黄图赤箓、三一真一，太一回车毕券之诀，从积年而善功未立，谴阙非一，夙夜忧惧，若履冰谷，虽复导生养黑，蒙恩无他，未得奉修九诚百二十事，仰谢三十二天，请度宿命之法，无上三天真一太一登坛大盟，实所未闻，不惟六蔽，知进忘退，谨资法物三十二种，奉操诣治，乞丐成就，如蒙教授，不敢泄露，攻根伐本，负违契令，某等以身谢天地水三官，殁命敢恨，谨辞 太岁云云。 某郡县乡里男女官某甲等，谨条法信如左。 生米一斛，腓缯六十四尺，柳薪一束，笔一双，铁二百五十斤，墨一丸，玄缯二百五十尺，书刀一口，黄金十二两，大席一领，黄素二百四十尺，真珠一两，法巾一枚，褐一领，金环一双，法案五枚，明镜一面，盛戒五彩法囊一枚，法信盟钱三万二千，盛经集文锦囊一枚，命丝三十二两，清冷罂盘匕各一枚，青铜剑一枚，和香五奁，生口男女替代各一人，明光锦百二十尺，铜八十斤，青缯八十一尺，生朱砂六十四两，白银十二两，大纸一百张，白绢三百六十疋。 右三十二种，奉操诣治，受登坛三盟。 上言：谨按文书，臣以人微，忝佩太一尊任搜授贤能，应补仙品者有牒，男女官某乙等，禀黑清淳，好道乐生，今奉受五黑，阴阳治身，炼黑积年，材堪进补，上三天真一太一极品，上统五亿五万五千五百五十五亿，诸天诸日诸月诸州星宿，诸仙府诸仙圣诸仙阙诸山岳，天神地祇，五岳四渍，三河九江，四海八极，九宫八卦，神室山神水灵，一切千鬼万神，普摄众神三万六千，普统众灵，总御众官，侍从众仙，及家国三魂七魄，三鬼五神，千二百形影，万二千精光，一时并来更仙练，某等今一旦受 上三天真一太一之后，不得背违上三天盟誓，攻伐师主，轻泄妄传，必须择贤三十三年一传，不得违约，违约之日，某等身神沈翳，长为下鬼，命为土尘，削除仙名饰不得厕预仙品，长殁三官考召君吏所考，事立所召者，诣肉人元元须待拜署，谨为拜章一通，上诣 上三天无上太上一君太上，上三天太正一法文法箓部仪上上帝君，上三天太上元君，三天太元一君，上三天大道万道，根宗天地本始，上至无上，下洞无穷，远至无边无极，幽微众官万灵，上三天之上，五亿五万五千五百五十五亿，诸天君将吏功曹使者，谒者仆射书佐小吏将军吏兵马骑乘各从官，五亿五万五千五百五十五亿万众，一合从上，上上无上，上三天之上，盖天来下，入甲等身中，从头至足，布雨骨节，五藏六府，九宫十二神室，四肢五体，百八十关机，三百六十骨节，孔窍营卫，筋骨血脉，安某等三魂，定某等七魄，仙某等三魂，正五神生五藏，应五星，召还三万六千余神署生官，各安宫室，使仙道毕成，举形飞升，上为真人，更定仙寿万八千岁，愿上三天太一天尊，万道之主，万神之 宗，将从天仙镇某等身中，检箓万神，愿上三天之上，飞仙君将，神仙君将，度世君将，神人君将，真人君将，元阳君将，万生君将，万黑君将，导仙君将，胎息君将，元精君将，延寿君将，太极君",
      "translated_text": "The Most High Supreme Unity Emperor, the Merciful Father and Sacred Mother, have deigned to review and govern. Herewith, this humble servant confers the Threefold Covenant of the Supreme Unity’s Ascent to the Altar, transmitting its essential instructions.\n\n**Yellow Silk Petition:**\nFrom [X] Prefecture, [X] County, [X] Township, the male official [X], aged [X] years, and others, humbly beseech pardon and present this petition. Born of flesh and blood, I have been fortunate beyond measure to enter the gates of the Dao, belonging to the household under the governance of my master [X], who holds the Mandate of Heaven. In former times, by the grace of an enlightened era, I was permitted to study the secret Yellow Chart and Red Registers, the true and supreme teachings of the Three Ones and the Supreme Unity’s *Returning Chariot and Completed Contract*. Yet, though I have practiced for many years, my merits remain unestablished, and my transgressions are manifold. Day and night, I tremble with dread, as though treading upon ice or crossing a chasm. Though I have cultivated life and nurtured my primordial qi, and though I have received boundless grace, I have yet to fulfill the Nine Sincerities and One Hundred Twenty Deeds, nor have I offered reverence to the Thirty-Two Heavens or sought the method of transcending karmic destiny. The Great Covenant of the Supreme Three Heavens’ True One and Supreme Unity’s Ascent to the Altar is a teaching I have never before encountered. Not only have I been blinded by the Six Obstructions, but I have also known only advancement and forgotten retreat. Thus, I humbly present thirty-two ritual offerings, bringing them to the altar to beseech completion. Should I be deemed worthy of instruction, I swear never to recklessly reveal or betray its essence. Should I attack the root or sever the source, violating this covenant, I shall offer my body in repayment to the Three Officials of Heaven, Earth, and Water. Even in death, I shall harbor no resentment. Respectfully submitted in the year of [Tai Sui’s reign].\n\nFrom [X] Prefecture, [X] County, [X] Township, the male and female officials [X] and others, we respectfully list the ritual offerings as follows:\n\nOne *hu* of raw rice, sixty-four *chi* of fine silk, one bundle of willow firewood, one pair of brushes, two hundred fifty *jin* of iron, one cake of ink, two hundred fifty *chi* of black silk, one writing knife, twelve *liang* of gold, one large mat, two hundred forty *chi* of yellow silk, one *liang* of true pearls, one ritual headscarf, one coarse robe, one pair of gold rings, five ritual tables, one bright mirror, one five-colored ritual pouch for precepts, thirty-two thousand covenant coins, one brocade pouch for scriptures and collected texts, thirty-two *liang* of life-thread silk, one cold-water jar and spoon, one blue-green bronze sword, five sets of blended incense, one male and one female substitute of living flesh, one hundred twenty *chi* of radiant brocade, eighty *jin* of copper, eighty-one *chi* of blue-green silk, sixty-four *liang* of raw cinnabar, twelve *liang* of silver, one hundred sheets of large paper, three hundred sixty bolts of white silk.\n\nThe above thirty-two offerings are respectfully presented to the altar to receive the Threefold Covenant of the Ascent.\n\n**Petition:**\nIn accordance with the scriptural texts, though I am of humble station, I have been entrusted with the exalted duty of the Supreme Unity to seek out and transmit to the worthy and capable. As recorded in the registers, the male and female officials [X] and others, who have cultivated pure and refined qi, delight in the Dao and cherish life, have now received the Five Qi, mastering the yin-yang governance of the body and refining their qi over many years. Their talents qualify them for advancement to the highest ranks of the Supreme Three Heavens’ True One and Supreme Unity. They shall oversee the five hundred fifty-five myriad, five thousand five hundred fifty-five billions of all heavens, all suns, all moons, all provinces, constellations, and starry lodges, all immortal courts, sages, palaces, and mountain peaks, the deities of Heaven and Earth, the Five Peaks and Four Seas, the Three Rivers and Nine Jiang, the Four Seas and Eight Poles, the Nine Palaces and Eight Trigrams, the divine chambers, mountain spirits, and water numina, all myriad ghosts and ten thousand spirits. They shall universally gather the thirty-six thousand spirits, govern all numinous beings, command all officials, attend all immortals, and oversee the three *hun* and seven *po* of their households and states, the three ghosts and five spirits, the one thousand two hundred forms and shadows, and the ten thousand two hundred essences and luminosities—all shall come at once to refine and transform them. From this day forth, having received the Supreme Three Heavens’ True One and Supreme Unity, they must not betray the covenant of the Supreme Three Heavens, attack their master, recklessly transmit, or lightly reveal its teachings. They must select the worthy and transmit but once every thirty-three years, never violating this pact. Should they break this vow, their spirit-bodies shall sink into obscurity, forever becoming lowly ghosts, their lives reduced to dust. Their immortal names shall be erased, and they shall never again be counted among the ranks of immortals. They shall be eternally bound by the Three Officials’ judgment, summoned by the lords and clerks for examination. Only when their karmic debts are repaid may they be reinstated among mortals. Thus, we respectfully present this petition to the Supreme Three Heavens’ Most High Supreme Unity Emperor, the Supreme Three Heavens’ Most High Primordial Sovereign, the Supreme Three Heavens’ Great Dao and Myriad Ways, the Root and Origin of Heaven and Earth, the Primordial Beginning, extending upward to the Most High and downward to the boundless, reaching afar to the infinite and limitless, the subtle and myriad officials and spirits of the Supreme Three Heavens above the five hundred fifty-five myriad, five thousand five hundred fifty-five billions of heavens. We invoke the lords, generals, clerks, functionaries, messengers, scribes, minor officials, generals, officers, cavalry, and all attendant officials—five hundred fifty-five myriad, five thousand five hundred fifty-five billions of hosts—to descend as one from the Supreme Three Heavens above, from the canopy of Heaven to the depths of our bodies, from head to foot, suffusing our bones and joints, the five viscera and six bowels, the nine palaces and twelve spirit-chambers, the four limbs and five bodies, the one hundred eighty mechanisms, the three hundred sixty bone-joints, the orifices, defensive and constructive qi, sinews, bones, blood, and vessels. We beseech you to pacify our three *hun*, stabilize our seven *po*, immortalize our three *hun*, rectify our five spirits, generate our five viscera, align them with the Five Stars, and summon back the thirty-six thousand remaining spirits to their offices. May each be settled in their chambers, that the immortal Dao may be perfected, our forms ascend in flight, and we become True Persons. May our immortal lifespans be fixed at eighteen thousand years. We pray to the Supreme Three Heavens’ Supreme Unity, the Lord of Myriad Ways and Ancestor of Myriad Spirits, to send the Heavenly Immortals to guard our bodies, inspect the registers of the myriad spirits, and grant that the flying immortals, divine immortals, world-transcending immortals, divine humans, True Persons, Primordial Yang, Myriad Lives, Myriad Qi, Guiding Immortals, Embryonic Breath, Primordial Essence, Longevity-Extending, and Supreme Polarity Lords of the Supreme Three Heavens above may descend into our bodies, refining and transforming us without end.",
      "overlap_context": "ivine spirits never to recklessly transmit it.\n\nAfter receiving the alliance, they must not lightly disseminate or reveal its true essence. They shall uphold the master’s teachings as per this covenant. Any violation shall result in their bodies being handed over to the Three Officials of Heaven, Earth, and Water. After death, they shall harbor no resentment.\n\nI beseech forgiveness for all transgressions committed by [X] before receiving the transmission. May all be pardoned. I humbly implore...",
      "start_char": 1321,
      "end_char": 2599,
      "start_sentence": 19,
      "end_sentence": 31,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.47212839126587,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\正一法文法箓部仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "将，太一君将，清微天禹余天大赤天君将，吏兵马骑乘一合来下，入某身中，营生养性，还年补脑，行生布黑，金丹神浆玉液，入某等身神玉女，侍卫左右，九天丞相，削除死籍，上名三天生箓，与天地无穷，周旋天下，六合载名山岳，出入人问，延年益寿，辟斥五兵水火灾息，县官口舌疾病丧祸，虎狼猛兽，毒虫冤家，盗贼伏匿黄渊，埋头万丈，不得妄宣，若有符师道士支散杂灵六天故黑，饮食鬼神，一切进匿，登山履睑，万神扶将，周旋天下，地上神明，交降所在，立验仙道，必成胎息，服御导引神黑，内外光明，云行身中，上升清天，黄老立宥，神仙结友，交游真人，飞腾高举，上补天仙，乘云驾龙，拜谒道君，寿终不老，与日月齐明，飞行超越，隐显浮轮，并迁某家七世父母，上至 亿曾万祖皆升三天，列补仙官，恩惟太上无极太一君垂恩省纳，分别求哀。 右破三盟契后付授赤章 太一黄素三盟仪 谨启黄素丹盟，告诸弟子，某甲等应诺太清太一无量清法门下，真一五炁，太一九宫成具满足，便得仙度，太上於昆仑进登天首大治七宝观上，召天师张道陵而告之日，吾道出於无先，太初之前，无所从生，靡所不成，吾昔於此观上，启受妙法，吾以聪明智慧，摄意奉行，便得微妙，玄通求道，上仙莫有疏息之名，奉行黄老之道，生死之诀，当畏法慎戒，生门之中生道有一，死道有九，验於大度，常当战战，如履冰剑，把毒常惧，害及其身，谦谦曲躬，卑辞下物，勤心苦行，无亏孝敬，受诀之后，奉行法戒，无违分数九一之法，生道之极耶，天师再拜，承盟奉修，位登天师，后授王长赵升三夫人洛下三公，皆得白日升天，登坛如左。 谨请盟誓，列启三官，甲等受盟，誓天地为信，指日月为盟，引三曾五祖，七世父母，自身证约，不轻传泄，登坛之诀，九年听传三人，若世无可传者，启宣三官，发先盟书，封诸事诀，藏之深山石室，不违盟约，甲等七祖父母上升玄宫，受福天官，身得仙度，福流万世，世蒙荣宠，若妄传非其人，甲等七祖父母下受风刀之考，身没积夜之河，殃流万世，世世受考，嗡血饮丹，披灵赤心，启封三官，日月所照，天地所闻，结盟之后，司命削某等死籍，度着生箓，使天官注仙名，地官除死籍，水官绝殃考坛，上三官考召君吏，并甲等所佩将军吏，兵保护肉人，必使仙度，若甲等先世因绿，宿对未应即仙，要须尸解暂，经太阴者，甲等以得登坛，大度结盟三官罪灭，福生应升，神室福堂二十四神，自守卫甲等形骸，不使魂魄离散，骨肉臭腐，二十四年举形化出，宿绿应死，超然复生，枯腐之骸，枯骨受仙，沈沦隐见，无所拘闭，此是登坛结盟三官之力，超登殊劫，过死度生之福，明自修慎，不敢违负今约。 谨宣盟约，告诸弟子，同坛共视，师某父母若有息难，当众共济，若横罹缧绁，当审明极穷济之趣，急度疾息，不得轻师负盟，亲相捐弃，若如此而不救告，而不赴者，有息之身，发盟告神，求乞免度，违盟者受考，告灵者得福，若在息难之中，不测之地，向师存亡所在，静夜披露丹心，启求度脱，若未蒙济兔，自当神告景，应知其罪福盟誓君吏，坛上三官自应侍卫营护，必得无他，但当敬承盟约，不违信誓，自得仙度，卫护君吏，考功记过，坛上三官，主偿罪福，明白证慎。",
      "translated_text": "May the Generals of the Supreme Unity, the Great One, the Lords of the Pure Tenuity Heaven, the Jade Capital Heaven, and the Great Scarlet Heaven descend in unison, leading their hosts of officers, soldiers, cavalry, and chariots, to enter our bodies. May they nurture our lives and cultivate our natures, restore our years and replenish our brains, circulate the generative qi and distribute the primordial breath. May the golden elixir, divine nectar, and jade fluid enter our bodies, accompanied by divine maidens to attend and guard us on left and right. May the Nine Heavens’ Prime Ministers erase our names from the registers of death and inscribe them in the Three Heavens’ records of life, granting us boundless existence with heaven and earth. May we traverse the world, our names inscribed upon the sacred mountains of the Six Directions. May we move freely among people, extending our years and increasing our longevity, warding off the five weapons, quenching fires and floods, dispelling official calumnies, illnesses, deaths, and misfortunes. May tigers, wolves, and fierce beasts, venomous creatures, vengeful foes, thieves, and bandits be submerged in the Yellow Abyss, buried ten thousand fathoms deep, never to emerge or spread falsehoods.\n\nShould any talisman masters, Daoist priests, or miscellaneous spirits of the Six Heavens’ former breath, or those who feast upon ghosts and spirits, attempt to intrude or conceal themselves, may the myriad spirits assist and escort us as we traverse the world. May the earthly deities and celestial spirits descend in every place we tread, manifesting the verification of the immortal Dao. May we surely achieve embryonic breathing, ingesting and guiding the divine breath, illuminating our inner and outer selves. May clouds course through our bodies, ascending to the Pure Heavens. May the Yellow Emperor and Laozi establish their grace, and may we befriend divine immortals, associating with True Persons. May we soar aloft, ascending to replenish the ranks of the Heavenly Immortals, riding clouds and driving dragons to pay homage to the Dao Lord. May we never age unto death, our luminosity equaling that of the sun and moon. May we fly and transcend, concealing or revealing ourselves at will, floating upon the wheel of existence. May our seven generations of parents, extending to the hundred million ancestors of myriad lineages, all ascend to the Three Heavens and be appointed to the ranks of immortal officials.\n\nWe humbly implore the Supreme Venerable, the Boundless Supreme Unity Lord, to bestow mercy and accept our plea.\n\n---\n\n**The Red Writs of the Three Covenants to be Conferred After the Breaking of the Pacts**\n**Rites of the Three Covenants of the Supreme Unity and Yellow Simplicity**\n\nWe reverently present the Yellow Simplicity and Cinnabar Covenant, addressing all disciples:\n\nWe, [Name] and others, affirm our allegiance to the Gate of Boundless Purity of the Supreme Clarity and Supreme Unity, where the True One and the Five Qi, the Supreme Unity and the Nine Palaces, are fully perfected, thereby attaining immortal deliverance. The Supreme Venerable, upon ascending the Heavenly Summit of Kunlun and entering the Seven Treasures Abbey, summoned the Celestial Master Zhang Daoling and declared:\n\n“Our Dao emerged from Non-Being, prior to the Great Beginning, unoriginated and yet nowhere unaccomplished. Formerly, upon this abbey, I received the wondrous Dharma. Through keen wisdom and focused devotion, I practiced and attained subtlety, penetrating the mysteries in pursuit of the Dao. None who ascend as immortals bear the name of negligence. Those who uphold the Dao of the Yellow Emperor and Laozi must master the secrets of life and death, ever fearing the Dharma and revering the precepts. Within the Gate of Life, there is but one path to life and nine paths to death. Tested by the Great Deliverance, one must ever tremble as if treading upon ice and blades, ever wary of poison lest it harm the self. Be humble and yielding, speak modestly, and lower oneself before others. Practice with diligence and endure hardship, never failing in filial piety and reverence. After receiving the precepts, uphold the Dharma and observe the prohibitions, never transgressing the numerical methods of the Nine and the One—the ultimate path of life.”\n\nThe Celestial Master bowed twice, pledged to uphold the covenant, and ascended to the rank of Celestial Master. Later, he transmitted the teachings to Wang Chang, Zhao Sheng, the Three Ladies of Luoyang, and the Three Dukes, all of whom attained ascension in broad daylight. The altar rites are as follows.\n\n---\n\nWe reverently invoke the covenant and oath, presenting them to the Three Officials. We, [Name] and others, who receive this covenant, swear by heaven and earth as our witness, by the sun and moon as our bond, and call upon our three generations of ancestors, five lineages of forebears, seven generations of parents, and ourselves to bear witness. We shall not lightly transmit or divulge the altar precepts, which may be taught to three persons over nine years. Should no worthy recipient exist in the world, we shall report to the Three Officials, open the original covenant, seal the precepts and matters therein, and conceal them within a mountain’s stone chamber, never violating the covenant.\n\nShould we uphold this pact, our seven generations of parents shall ascend to the Mysterious Palace, receive blessings from the Heavenly Officials, and attain immortal deliverance, their fortune flowing through ten thousand generations, their descendants forever honored. Should we recklessly transmit these teachings to the unworthy, our seven generations of parents shall descend to endure the trials of the Wind Blade, our bodies submerged in the River of Accumulated Nights, our misfortunes flowing through ten thousand generations, our descendants suffering eternal torment, drinking blood and consuming cinnabar, their divine hearts laid bare.\n\nWe open the seals of the Three Officials, witnessed by the sun and moon, heard by heaven and earth. After this covenant is sworn, the Controller of Destinies shall erase our names from the registers of death and inscribe them in the records of life. The Heavenly Officials shall register our immortal names, the Earthly Officials shall remove our death records, and the Water Officials shall sever our karmic trials. The Generals and Officers of the Three Officials’ Summoning Courts, along with the generals and officers we bear, shall protect our mortal bodies and ensure our immortal deliverance.\n\nShould our past karma or unresolved grievances prevent immediate ascension, we must undergo temporary corpse liberation, passing through the Great Yin. Having ascended the altar and undergone the Great Deliverance, our sins shall be eradicated, our blessings born, and our ascent assured. The Twenty-Four Spirits of the Divine Chamber and Blessed Hall shall guard our forms, preventing the dispersal of our souls and the decay of our flesh and bones. After twenty-four years, our forms shall transform and emerge. Though our karmic debts demand death, we shall transcend and revive, our withered bones receiving immortality. Though submerged or concealed, we shall be unbound and unrestrained—such is the power of ascending the altar and swearing the Three Officials’ covenant, transcending kalpas and bestowing the fortune of deliverance from death.\n\nWe must cultivate ourselves with clarity and caution, never daring to violate this pact.\n\n---\n\nWe reverently proclaim the covenant, addressing all disciples who share this altar and witness together:\n\nShould our master or parents encounter calamity, we shall collectively aid them. Should they suffer unjust imprisonment, we shall exhaust all means to rescue and deliver them swiftly, never abandoning them lightly or betraying the covenant. Should any fail to respond to such pleas for help, the afflicted shall invoke the covenant and beseech the spirits for deliverance. Those who violate the covenant shall endure trials, while those who uphold it shall receive blessings.\n\nShould we face calamity in perilous places, we shall, whether our master lives or has passed, silently pray at night, baring our cinnabar hearts to seek deliverance. Should we remain unrelieved, we shall report to the spirits of the luminous realm, who shall know our merit and transgression. The Generals and Officers of the Covenant, along with the Three Officials of the Altar, shall guard and protect us, ensuring our safety. We must only reverently uphold the covenant and never violate our oaths, thereby attaining immortal deliverance. The Guardian Generals and Officers shall record our merits and transgressions, while the Three Officials of the Altar shall adjudicate our sins and blessings. We must bear witness with clarity and caution.",
      "overlap_context": "Ways and Ancestor of Myriad Spirits, to send the Heavenly Immortals to guard our bodies, inspect the registers of the myriad spirits, and grant that the flying immortals, divine immortals, world-transcending immortals, divine humans, True Persons, Primordial Yang, Myriad Lives, Myriad Qi, Guiding Immortals, Embryonic Breath, Primordial Essence, Longevity-Extending, and Supreme Polarity Lords of the Supreme Three Heavens above may descend into our bodies, refining and transforming us without end.",
      "start_char": 2599,
      "end_char": 3874,
      "start_sentence": 32,
      "end_sentence": 38,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.34815526008606,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\正一法文法箓部仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "某国号太岁某月朔日，於某州郡县乡里中，系天师某治炁，臣某甲从某治道士某，奉受传某郡县乡里某甲。 太上黄素丹盟三条，登坛者各朱书黄素，佩随身，生则受仙之券，死则拔逮之根，三官证拔，生生受福，无复罪绿。 太一登坛黄素三盟逆刺付授仪 东向叩齿二十四通。 谨出臣身中五体真官神仙五炁功曹吏，出太一金刚元炁直使功曹，通神功曹，五元功曹，和合功曹，运炁功曹，统仙功曹，各二十四人，出王炁左官使者，平炁右官使者，阴阳神决吏仙化吏，科车赤符吏，刚风骑置驿马上章吏，官各二十四人。 出某郡县乡里中真正之官监察注炁，考召四君逮召诸君将吏等，左右平炁君，左右都候君，左右执平君，左右执法君，束方九天九炁君，南方三极三炁君，西方七合七炁君，北方五元五炁君，中央一炁君，阳平鹿堂等二十四治炁，三十六静卢，天师门下君将吏兵所布下，道上二玄三元四始五德六合甲子诸官君，周天八极飞仙君，养性长生青龙胜蛇君等，奉行文书事，谨操臣为男女生民，太一道士某乙度金刚毕券，或登坛黄素三盟，拜露刺一通，刺今露在中庭玉案上，请省功曹使者将军吏兵，须考正甲等合炁连名保负须所召者，诣所下者至功成事，立臣拜章报授毕，各还臣宫室中，伏须效应，匍匐当刺。 右授金刚毕券上刺出官 授太一三盟大券口刺 某郡县乡里男女生官某甲等，年如干岁字某乙户属师主，某乙治男女官某乙等，禀性慈仁，素体温良，炼炁积年，厕身秘门，参染真要，阶绿上道，奉受太一金刚契，令晓知三炁飞仙之诀，虽备众契，未遂登坛，生死大盟，今实信仪，连名誓身束骸，告臣求受太一三盟登坛大券，明真大讳，三百六十图号，千二百口诀，依先师本法告传谨状。 具位系天师某治炁，臣某甲稽首再拜，上启太上元极大道太上老君，太上丈人，太一帝君，皇天上帝，元极元君，道德众尊，三天法师正一真人门下，典者施行飞仙君吏，臣运逢天通，系命玄教，衔宣法化，搜索有道，游行世界，拔度天人，今有宿命因绿，从虚元中来，某郡县乡里男女官某甲，年如干岁，甲等素染玄教，练备真文，奉受众契，修行真秘，虽备上法，未破玄誓，今相擭率操，资法仪束骸，诣臣求受太一登坛三盟生死处仙大券黄素证誓，臣昔从大洞真人某奉受约，当传授后贤，察甲等专诚乐道，在可成就辄克，某月某日时於某岳山之中，共立黄坛证誓五帝，分符破契，告盟天地，付授秘局，施行口诀，谨先於此某郡县乡里中，露白刺奏上 天曹，特愿 太一帝君皇上大道留神照察，若甲等有骨法，合便依法付授玄都，无骨法愿为考正，从上玉箓，名备天仙，到某日某时良日吉辰，灵岳之中，黄坛之上，稽首告盟，誓天证地，付授玄一高上之道，生死大盟，存亡成仙，谨以启闻，立须报应，臣甲诚惶诚恐，稽首再拜以闻。 臣姓 太上大道元上三天太一帝君太清玉陛下，太岁。",
      "translated_text": "On the first day of the [specific] month in the [regnal year] of the Great Year of [specific state], at [specific] prefecture, commandery, county, and village, under the qi-administering governance of Celestial Master [name] of [specific] Abbey, your servant [name], having received transmission from Daoist [name] of [specific] Abbey, hereby transmits to [name] of [specific] prefecture, commandery, county, and village the Three Covenants of the Yellow Plain Vermilion Alliance of the Most High.\n\nAll who ascend the altar shall inscribe their names in cinnabar upon yellow plain silk, bearing it upon their person. In life, they shall receive the contract of immortality; in death, they shall sever the roots of retribution. The Three Officials shall bear witness to their deliverance, and in every rebirth, they shall receive blessings, free from the entanglements of sin.\n\n**Rite of Transmission for the Three Covenants of the Yellow Plain of the Great One Ascending the Altar**\n\nFace east and strike the teeth twenty-four times.\n\nReverently summon the True Officials of the Five Corpsoreal Deities and the Immortal Qi Functionaries from within your servant’s body, along with the Twenty-Four Qi Functionaries of each: the Direct Envoys of the Great One’s Vajra Primordial Qi, the Divine Communicators, the Five Primordial Qi Functionaries, the Harmonizing Qi Functionaries, the Qi-Directing Functionaries, and the Celestial Functionaries. Also summon the Left Envoys of the Kingly Qi, the Right Envoys of the Balanced Qi, the Yin-Yang Divine Seal Clerks, the Immortal Transformation Clerks, the Scarlet Talisman Chariot Clerks, the Vajra Wind Courier Station Masters, and the Memorial-Presenting Clerks—twenty-four of each.\n\nSummon the True and Upright Officials of [specific] prefecture, commandery, county, and village, the Qi-Recording Overseers, the Examiners and Summoners of the Four Lords, and the various Generals and Officers. Also summon the Left and Right Balanced Qi Lords, the Left and Right Capital Inspectors, the Left and Right Enforcers of Balance, the Left and Right Enforcers of the Law, the Nine Qi Lords of the Nine Heavens of the East, the Three Qi Lords of the Three Poles of the South, the Seven Qi Lords of the Seven Conjunctions of the West, the Five Qi Lords of the Five Primordials of the North, the One Qi Lord of the Center, the Twenty-Four Qi of the Yangping and Lutang Abbeys, the Thirty-Six Quiet Chambers, the Generals and Officers under the Celestial Master’s command, the Officials of the Two Mysteries, Three Primordials, Four Beginnings, Five Powers, Six Harmonies, and Jiazi, the Lords of the Flying Immortals of the Eight Extremities of the Cosmos, the Lords of Nourishing Nature and Longevity, the Azure Dragon and Victorious Serpent Lords, and all others charged with executing this document.\n\nYour servant, acting on behalf of the male and female people, Daoist [name] of the Great One, having completed the Vajra Contract, or having ascended the altar for the Three Covenants of the Yellow Plain, now presents this memorial with one bow, placing the revealed memorial upon the jade table in the central courtyard. The Functionary Envoys, Generals, Officers, and Soldiers are requested to examine this matter. Should the verification of [name] and the conjoined qi of the guarantors be confirmed, summon those required to fulfill their duties. Once the task is accomplished, your servant shall present a memorial to report the completion, after which all shall return to their respective abodes. Awaiting the efficacious response, your servant prostrates himself before the memorial.\n\n**Right: Memorial for the Transmission of the Vajra Completion Contract**\n**Oral Memorial for the Transmission of the Great Contract of the Three Covenants of the Great One**\n\nThe male and female officials [names] of [specific] prefecture, commandery, county, and village, aged [number] years, styled [name], household under the mastership of [name], and the male and female officials of [name] Abbey—all of virtuous and benevolent nature, inherently gentle and refined, having cultivated qi for years, aligned themselves with the secret gates, and delved into the essentials of the true teachings—have ascended the path. Having received the Vajra Contract of the Great One, they now comprehend the secrets of the Three Qi and the Flying Immortals. Though they possess numerous contracts, they have yet to ascend the altar for the great covenant of life and death. Now, in true sincerity, they bind their bodies and pledge their bones, beseeching your servant to transmit the Great Contract of the Three Covenants of the Great One Ascending the Altar, the True and Luminous Great Taboo, the Three Hundred and Sixty Diagram Titles, and the One Thousand Two Hundred Oral Instructions, in accordance with the original methods of the former masters. Respectfully submitted.\n\nYour servant, [name], of the qi-administering governance of Celestial Master [name] of [specific] Abbey, bows twice and reverently addresses the Most High Primordial Great Dao, the Most High Lord Lao, the Most High Elder, the Great One Emperor Lord, the August Heavenly Thearch, the Primordial Lord of the Primordial Ultimate, the Venerable Ones of the Dao and Virtue, the Three Heavens’ Dharma Masters, the Orthodox Unity Perfected Ones, and the Executors under the Flying Immortal Lords:\n\nYour servant, having encountered the celestial communion of destiny and aligned with the Mysterious Teachings, bears the mandate to propagate the Dharma and transform the world. Searching for those of the Dao, I traverse the realms to deliver and elevate both celestial and mortal beings. Now, by virtue of karmic conditions from former lives, emerging from the Void Primordial, [name], male or female official of [specific] prefecture, commandery, county, and village, aged [number] years, has long been steeped in the Mysterious Teachings, mastering the true texts, receiving numerous contracts, and cultivating the true and secret practices. Though possessing the superior methods, they have yet to break the primordial oath. Now, they gather in earnest, binding their bodies and pledging their bones, beseeching your servant to transmit the Great Contract of the Three Covenants of the Great One Ascending the Altar, the Yellow Plain’s Witnessed Oath for Life and Death, and the Dao of Transcendence.\n\nFormerly, your servant received the covenant from the Great Cavern Perfected [name], charged with transmitting to worthy successors. Having observed [names]’s sincere devotion to the Dao and their potential for accomplishment, on the [specific] day of the [specific] month at [specific] mountain, we jointly established the yellow altar, witnessed the oath by the Five Thearchs, divided the talismans, broke the contracts, and pledged before Heaven and Earth. The secret instructions were transmitted, and the oral instructions were imparted.\n\nRespectfully, I first present this revealed memorial at [specific] prefecture, commandery, county, and village to the Celestial Bureaus. May the Great One Emperor Lord and the August Great Dao deign to observe and examine: if [names] possess the requisite bone structure, they shall be transmitted the Mysterious Capital’s methods in accordance with the Dharma. If they lack the bone structure, may they be verified and corrected, their names recorded in the Jade Registers of the Upper Heavens, and enrolled among the Celestial Immortals. On the [specific] day and hour, an auspicious time, at the sacred mountain, upon the yellow altar, we shall bow and pledge before Heaven and Earth, transmitting the Supreme and Mysterious Dao of the Primordial One, the great covenant of life and death, and the attainment of immortality in both life and death.\n\nRespectfully submitted, awaiting the efficacious response. Your servant [name], with utmost reverence and trepidation, bows twice and presents this memorial.\n\nYour servant [surname],\nBefore the August Great Dao, the Primordial Lord of the Three Heavens, the Great One Emperor Lord, and the Jade Emperor of the Grand Clarity,\nIn the [regnal year] of the Great Year.",
      "overlap_context": " who shall know our merit and transgression. The Generals and Officers of the Covenant, along with the Three Officials of the Altar, shall guard and protect us, ensuring our safety. We must only reverently uphold the covenant and never violate our oaths, thereby attaining immortal deliverance. The Guardian Generals and Officers shall record our merits and transgressions, while the Three Officials of the Altar shall adjudicate our sins and blessings. We must bear witness with clarity and caution.",
      "start_char": 3875,
      "end_char": 5016,
      "start_sentence": 39,
      "end_sentence": 52,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.601961612701416,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\正一法文法箓部仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "右口刺 谨重劫五体仙官骑乘将吏腾臣所上某刺，上诣 太上左君玉合下，付与侍香青腰玉女等，所言倒错越失，不得旧法者，愿为考正，依本法文，若有干截公文者，将吏神仙骑乘收付所在狱中，依事治罪，令臣所启上达，伏须告报，臣所上事讫，向出仙官吏兵，各还宫室，弥纶五宫六府，安官复职，至日呼召复出。 呜鼓士二通，三咽炁，毕。 太一三盟付授仪 束向叩齿二十四通 谨出臣身中神仙，直使正一神官功曹，阴阳运炁明光使者，左右官使者，阴阳神庾吏科车赤符吏，刚风骑置驿马上章吏，飞龙骑吏，左右龙虎君，赤飞仙童官各二十四人出，出者严装显服，具列威仪，谨关某郡县乡里中真官注炁，监察考召四君将吏，社里邑君土地灵祇，八方监察神仙众官，并备真位系天师太一炁无极金刚毕券，某岳先生，臣某稽首再拜，上启 太上无极大道太上老君，诸君丈人太一帝君天帝君，皇上大道天师三师君，太一神仙玉历真科付授威仪使者，典行飞仙事，臣万劫因绿，谬闻大法，运值有幸，遇大洞法师真人某甲授臣登坛大盟，生死证誓，飞升至道，玄元要诀，众真之券，万幸宿生悟性，臣受法以来，积有年载，虽未能察幽睹冥，坐在立亡，重希玄降，於身有科，承科传授，以付后贤，某郡县乡里某甲年如干岁，前蒙黄箓契，令奉受五金刚契，令被炁积年，练悉纪纲，今操资信仪，诣臣求受登坛三盟大诀，目承先师本法，与甲等对共立坛，证誓五帝，分金破券，喻丹告盟，甲等受道之后，永为身宝，不得攻根伐本，指师谤道，唱露要诀传非其人中泄灵文，施布世间一旦有违生死父母沈沦罪由万劫无原，谨以启闻，须可奉行，臣甲诚惶诚恐，稽首再拜。 次读券　读黄盟 次画一 画一，左手指天，右手画地，以左手指中央，师便言：系天师某治陈昔，从大洞弟子某受太一登坛盟券，今依法传授弟子，某甲受此证约，当依真师盟坛大约，不得攻根伐本，指师谤道，泄露灵盟，一日一有违，万殁谢罪，生死沈沦，上告天灵，下示地祇，中誓贤人，三证灵盟，义不相负，谨共画一为信。 次下发 作结一结，言清微天，泓二结言禹余天，澄三结言大赤天，明上三天之帝真重为誓，结发盟坛，不负灵约。 次刻箓，言玄老大一闲阑。 刻中言大上太一门石门也。 次弟子盟丹水 某郡县乡里男女生太一道士某甲，敢告丹水，甲好仙乐圣，诣太一无极道士某甲，受太一三盟登坛大券明真大讳，三百六十图号，千二百口诀，甲为弟子，不得背叛师道，妄传世人，违盟族倾，背誓不生，共喻丹水为盟，指天画地以生神灵，急急如律令。 次师命丹法 太一无极道士姓某乙，敢告丹水，有某郡县乡里某甲，求受臣 太一三盟登坛大券明真大讳之诀，万道之神，甲为弟子，不得背违券契，上监三天老君所明，急急如律令。 次师左手弟子右手共持丹水更嗡之，各三止，弟子先嗡师后嗡。 醮坛法，用醮具五盘，香五炉，用枣五拌，东向祭五帝，醮具九盘，香九炉，用枣九拌。 东向祭太一九君。 系天师太一无极某治真人，臣甲谨上诣束方青帝，南方赤帝，西方白帝，北方炁帝，中央黄帝，太一帝君，皇天大道，太清玉陛下，从官九亿万骑，摇天动地，降此灵岳皇坛之上，临飨微醮，屈灵錾临，谨有男女官某乙等，受黄素太盟长生拔仙大券，施设微心，上请天尊，伏愿神颜曲陌世界，眷欲苍生愆阙不及，以唯乞愿原赦，便再拜。",
      "translated_text": "To the Right, the Memorial:\n\nWith utmost reverence, this memorial is respectfully submitted by the Five-Body Immortal Officials, the mounted generals, the flying ministers, and the ascending servants. Presented to the Jade Chamber beneath the Supreme Left Lord, it is to be delivered to the Jade Maidens of the Fragrant Waist, and the like. Should any errors, omissions, or deviations from the ancient methods be found in their words, may they be examined and corrected according to the original scriptures. If any violate or intercept official documents, may the immortal officials, mounted generals, and divine riders seize and deliver them to the local prisons, where they shall be punished according to the offense. May the matters herein submitted be conveyed upward, and may a response be awaited in due course. Once the matters presented are concluded, may the immortal officials, officers, and soldiers depart, each returning to their palaces, governing the Five Palaces and Six Treasuries, resuming their posts and duties. On the appointed day, they shall be summoned forth again. Beat the drum twice, sound the three qi-chants, and conclude.\n\n**Ritual for the Transmission of the Three Covenants of the Great One**\n\nFace east and strike the teeth twenty-four times. Reverently summon forth the divine immortals within the servant’s body: the Directing Envoy of the Orthodox Unity Divine Officials, the Functionaries of Yin and Yang, the Radiant Light Envoys of Qi-Circulation, the Left and Right Official Envoys, the Yin-Yang Divine Clerks of the Qi-Chariot, the Scarlet Talisman Clerks, the Courier Riders of the Steadfast Wind, the Flying Dragon Riders, the Left and Right Dragon-Tiger Lords, and the Scarlet Flying Immortal Youths—twenty-four of each. Let those who emerge be clad in solemn attire, arrayed in full regalia. Reverently notify the True Officials of Qi-Registration in such-and-such prefecture, county, and village; the Inspecting and Summoning Four Lords and their officers; the local deities of the communities and hamlets; the Earth Spirits; the supervisory divine immortals of the eight directions; and all officials in their true ranks, bound by the indissoluble contract of the Heavenly Master, the Great One’s Qi, the Boundless Vajra, and the Golden Tablet. The Master of the Sacred Peak, your servant [name], bows twice and respectfully memorializes the Supreme Boundless Dao, the Supreme Venerable Lord Lao; the Lords and Elders; the Great One Emperor Lord; the Heavenly Emperor Lord; the August Great Dao; the Heavenly Master; the Three Masters; the Great One Divine Immortals; the True Statutes of the Jade Registers; the Envoys of Transmission Rituals; and the Directors of Flying Immortal Affairs.\n\nYour servant, through ten thousand kalpas of karmic affinity, has fortuitously encountered the Great Law. By fortunate circumstance, I met the Great Cavern Dharma Master, the Perfected One [name], who transmitted to me the Great Covenant of the Altar, the oaths of life and death, the Dao of ascension, the essential secrets of the Mysterious Origin, and the contracts of the host of Perfected Ones. By the good fortune of past lives’ awakened nature, I have received the Dharma for many years. Though I have yet to perceive the hidden or witness the unseen, to sit in stillness or stand in dissolution, I humbly hope for the descent of the Mysterious, that I may bear its statutes in my person. In accordance with the statutes, I transmit it to worthy successors.\n\nIn such-and-such prefecture, county, and village, [name], aged [number] years, previously received the Yellow Register Covenant and was commanded to uphold the Five Vajra Covenants. Having cultivated qi for many years and mastered the disciplines, he now presents his credentials and sincerity, seeking to receive the Great Secrets of the Three Covenants of the Altar. Witnessing the original methods of my former master, I, together with [name], establish the altar, invoke the Five Emperors as witnesses, divide the gold, break the tablets, and proclaim the cinnabar oath. After [name] receives the Dao, may it forever be his personal treasure. He must not undermine his roots or sever his foundation, revile his master or slander the Dao, reveal essential secrets to the unworthy, or disseminate sacred texts among the worldly. Should he violate this even once, his parents in life and death shall sink into eternal damnation, their sins irredeemable for ten thousand kalpas. Respectfully submitted for your consideration and enactment. Your servant [name], with utmost reverence and trepidation, bows twice.\n\n**Next: Reading of the Tablet**\nRead the Yellow Covenant.\n\n**Next: Drawing the One**\nDraw the One: with the left hand pointing to Heaven, the right hand drawing on Earth, then the left hand pointing to the Center. The master then declares:\n*\"Bound by the Heavenly Master of such-and-such district, [name], from the Great Cavern disciple [name], I transmit the Altar Covenant Tablet of the Great One. Now, in accordance with the Dharma, I transmit it to the disciple [name], who receives this covenant. He shall abide by the great oath of the Perfected Master’s altar, never undermining his roots or severing his foundation, reviling his master or slandering the Dao, or revealing the sacred covenant. Should he violate this even once, he shall perish and bear the guilt, sinking into eternal damnation. Above, he invokes the numinous spirits of Heaven; below, he invokes the deities of Earth; and in the center, he swears before the worthy. The Three Numinous Covenants bear witness, and none shall betray their pledge. Together, we draw the One as a token.\"*\n\n**Next: Tying the Hair**\nMake the first knot, declaring: *\"The Heaven of Pure Tenuity.\"*\nMake the second knot, declaring: *\"The Heaven of Vast Surplus.\"*\nMake the third knot, declaring: *\"The Heaven of Great Redness.\"*\n*\"By the true emperors of the Three Heavens above, we swear anew, tying our hair at the altar of the covenant, never to betray the sacred pact.\"*\n\n**Next: Inscribing the Register**\nDeclare: *\"The Great One of the Mysterious Elder, the Barrier Gate.\"*\nInscribe the center, declaring: *\"The Great Supreme Gate of the Great One, the Stone Gate.\"*\n\n**Next: The Disciple’s Oath over the Cinnabar Water**\n*\"The male/female Daoist of the Great One, [name], of such-and-such prefecture, county, and village, dares to proclaim to the Cinnabar Water: I, [name], delight in the immortals and revere the sacred, and have come to the Boundless Daoist of the Great One, [name], to receive the Great Tablet of the Three Covenants of the Altar, the Luminous True Great Name, the three hundred sixty diagrams, and the one thousand two hundred oral secrets. As a disciple, I must not betray the master’s Dao, recklessly transmit it to the worldly, or violate the covenant, lest my clan be overthrown and I perish for breaking my oath. Together, we swear by the Cinnabar Water, pointing to Heaven and drawing on Earth to invoke the divine spirits. Swiftly, swiftly, in accordance with the statutes!\"*\n\n**Next: The Master’s Command over the Cinnabar Water**\n*\"The Boundless Daoist of the Great One, [name], dares to proclaim to the Cinnabar Water: In such-and-such prefecture, county, and village, [name] seeks to receive from me the secrets of the Great Tablet of the Three Covenants of the Altar and the Luminous True Great Name. May the myriad divine spirits monitor [name] as a disciple, that he never betray the covenant. Above, the Three Heavens and the Venerable Lord Lao bear witness. Swiftly, swiftly, in accordance with the statutes!\"*\n\n**Next: Holding the Cinnabar Water**\nThe master holds the Cinnabar Water with his left hand, the disciple with his right, and together they sip it three times, the disciple first, then the master.\n\n**Ritual of the Offering Altar**\nPrepare five offering trays and five incense burners, with five portions of dates, and face east to sacrifice to the Five Emperors.\nPrepare nine offering trays and nine incense burners, with nine portions of dates, and face east to sacrifice to the Nine Lords of the Great One.\n\n*\"The Perfected One of the Boundless Great One, the Heavenly Master of such-and-such district, your servant [name], respectfully presents this offering to the Azure Emperor of the East, the Vermilion Emperor of the South, the White Emperor of the West, the Qi Emperor of the North, the Yellow Emperor of the Center, the Great One Emperor Lord, the August Great Dao, and the Jade Emperor of the Grand Clarity. With nine billion myriad riders, they shake Heaven and move Earth, descending upon this sacred peak and imperial altar to partake of this humble offering. May their numinous presence deign to grace the world, and in their compassion for the transgressions and shortcomings of living beings, I humbly beseech their forgiveness and pardon. I bow twice.\"*",
      "overlap_context": " Mysterious Dao of the Primordial One, the great covenant of life and death, and the attainment of immortality in both life and death.\n\nRespectfully submitted, awaiting the efficacious response. Your servant [name], with utmost reverence and trepidation, bows twice and presents this memorial.\n\nYour servant [surname],\nBefore the August Great Dao, the Primordial Lord of the Three Heavens, the Great One Emperor Lord, and the Jade Emperor of the Grand Clarity,\nIn the [regnal year] of the Great Year.",
      "start_char": 5017,
      "end_char": 6362,
      "start_sentence": 53,
      "end_sentence": 76,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.760804176330566,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\正一法文法箓部仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "次受契者先五拜次，师左手授契与弟子，弟子左手取之，三绕身毕，束向三回九拜，次又北向九拜，太一君三回三拜，又向师九拜，次俱起，於地户指天画地，左行三回，右转召弟子七祖证明如具。 次重劫法 谨出臣身中五体真官功曹吏，出太一金刚长寿功曹二百四十人，太一度世功曹二百四十人，太一度命功曹二百四十人，出太一青腰玉女二百四十人，出太一娥皇玉女二百四十人，出五老君将吏二百四十人，出长生永终吏二百四十人，出东九夷，南八蛮，西六戎，北五狄，中央三秦君将吏，各二百四十人，出千乘亿骑盖天来下，刚风骑置驿马上章吏官，各二百四十人，出今授甲等 太一三盟登坛大券明真大讳之诀，或金刚一言之诀当令甲等受道之后，长生久视，同襟仙圣，齐肩保器，神耀不求，而前佑令神丹金液，灵芝众药，服练身形，千道万神，为甲驱使坐起行住，太阳在左，太阴在右，青龙白虎，朱雀玄武，侠从前后，天神当下，地神并出，五老神君，除甲死籍，青书黄简上，甲生名七玄，父母返胎南宫，合家大小，皆享永延，甲一日一违盟，考甲百曾挞蒙山之石，填塞三河，长充下鬼，永为土囚，一如契令，依如 太上老君，太上众尊无极大道，无上玄老，五炁道德，万生万度万福君丈人，新出老君太清玄元上三天无极大道太上老君，太上丈人，太上三炁君天帝君，太上五炁律令。 泰玄都正一平炁系天师某治太一道士太上曾孙小兆，臣甲稽首再拜 上言：谨按文书，臣等素自虫蚁枯骨，子孙千载有幸，得在道门，被蒙大恩，不以顽愚窃好生法，并蒙师老赐佩太一契令，不唯功少，希慕上真，以今月某日，率同学某甲等，诣无极太一中宫道士某治，郡县乡里某乙，进受无上太一证誓三天登坛死生三盟，上拔七世父母幽魂苦爽，次以升度，某乙等生死之愆，腐骨见肉，未有微勤，荷施山岳，非臣甲等轻愚所享，不胜重杳，谨伏地拜章谢闻，愿上官典者哀矜臣等，乞上生名，太清仙都玉历，得在神仙种民辈中，谨遣臣等身中三官考召君将吏，天官考地官考水官考，清微天考，禹余天考，大赤天考，此里中四面真官注炁，监察考召诸官将吏，臣等投身托命，生炁一节，奉承元老，臣等所备宜毕真妙中玄皇坛，山岑之上，太阳之下，伏地拜赤中章一通，上奏至极太一几前，臣等从臣某乙，共上告皇灵，下指地祇，冒黩以传，受恩惟玄极映明真君，镯明注炁，谨请无极自然神仙，先天帝太元君姓字，率将骑乘日月，五星五帝，九宫五岳四海，游玑玉衡，三河九江，神仙兵马，太一骑乘独辕之车驾，无极之马前，导至真精神后，从五帝陛下，神仙骑乘，侠从左右，前无不祥，后无殃咎，头上游玑，足步北斗，日月五星导前从后，震天动地，一合来下，各按次第左右，从臣某乙等三元会宫中，一为神主仙帝之皇，当为臣等延上三天生炁，太一神丹，金液玉浆，入臣等身中八十一宫，十二神室，太玄四注，臣等五神太一神精，五炁缨珞，九元练命三丹，度生却死，升上晨极，注入玄宫，翱翔五岳，高举飘腾，耀影金阙，凤举紫庭，仙道早成，毛羽时生，遨游八表，戏骯八台，交关华霍，赐与丹精，九灵合华，七祖升迁，魂入道乡，闲乐之堂，衣食自然，臣等同盟之人，有底之日，当更相救济，拔度为先，上存法师，次存同盟人名，自今以后，不敢负三盟约言，宗崇法师，唯善为先，既往之罪，负盟之愆，唯乞原赦。",
      "translated_text": "Next, the recipient of the contract shall first perform five bows. Then, the master shall present the contract to the disciple with his left hand, and the disciple shall receive it with his left hand. After circumambulating the body three times, he shall face east and bow nine times in three sets. Then, he shall face north and bow nine times. He shall bow three times in three sets to the Lord of the Great One, and then bow nine times to the master. Next, both shall rise, and at the earthly gate, they shall point to heaven and trace upon the earth, circling left three times and right to summon the seven generations of the disciple’s ancestors as witnesses, as fully prescribed.\n\n**Next, the Rite of the Weighty Kalpa:**\nRespectfully, from within this servant’s body, the five bodily Perfected Officials and Attendants emerge—two hundred forty Attendants of the Great One’s Vajra Longevity, two hundred forty Attendants of the Great One’s Kalpa-Transcending, two hundred forty Attendants of the Great One’s Life-Prolonging, two hundred forty Jade Maidens of the Great One’s Azure Waist, two hundred forty Jade Maidens of the Great One’s Ehuang, two hundred forty Generals and Attendants of the Five Venerable Lords, two hundred forty Attendants of Eternal Longevity, two hundred forty Generals and Attendants each of the Eastern Nine Yi, Southern Eight Man, Western Six Rong, Northern Five Di, and Central Three Qin, a thousand chariots and ten thousand riders descending from the canopy of heaven, Attendants and couriers of the刚风骑驿马上章, each two hundred forty in number. Now, to bestow upon [name] the Great Secret of the Three Pacts of the Great One’s Ascent to the Altar and the Register of Illuminated Perfection, or the Vajra Single-Word Secret—upon [name]’s reception of the Dao, may he attain longevity and enduring vision, robed in the same vestments as the immortals and sages, bearing the sacred vessel as an equal. May his spirit shine without seeking, and may divine elixirs, golden liquors, numinous mushrooms, and myriad herbs refine his form. May the thousand Dao and ten thousand spirits serve him in sitting, rising, walking, and resting. May the Great Yang stand to his left and the Great Yin to his right, the Azure Dragon and White Tiger flanking him, the Vermilion Bird and Dark Warrior guarding front and rear. May celestial spirits descend and earthly spirits emerge, the Five Venerable Spirit Lords expunging [name]’s name from the register of death, inscribing it in azure script on yellow tablets, and elevating his seven generations of ancestors to the Southern Palace of Rebirth. May his entire household enjoy eternal extension. Should [name] violate this pact even once, may he be punished by the stones of Mount Meng, his bones filling the Three Rivers, forever bound as a lowly ghost and eternal prisoner of the earth. All shall be as the contract decrees, in accordance with the commands of the Most High Lord Lao, the Host of Venerable Ones of the Boundless Dao, the Supreme Mysterious Elder, the Five Qi of Virtue and Power, the Lord of Myriad Lives, Myriad Salvations, and Myriad Blessings, the Heavenly Worthy, the Newly Manifest Lord Lao of the Supreme Clarity, the Primordial Elder of the Three Heavens of the Boundless Dao, the Most High Lord Lao, the Heavenly Worthy of the Three Qi, the Heavenly Emperor, and the Five Qi of the Celestial Mandate.\n\n**From the Terrace of Grand Mystery, the Orthodox Unity, the Master of Balanced Qi, the Celestial Master of such-and-such district, the Great One Daoist, the remote descendant of the Most High, this humble servant [name] bows twice and respectfully declares:**\n\nIn accordance with the scriptures, we, your servants, are but withered bones and crawling insects, yet our descendants for a thousand generations have been fortunate to dwell within the gates of the Dao. By the great grace bestowed upon us, despite our dullness and folly, we have cherished the methods of life. We have been favored by our venerable masters, who granted us the contracts and commands of the Great One. Though our merits are meager, we aspire to the lofty Perfected Ones. On this day of such-and-such month, together with our fellow disciples [names], we approach the Central Palace of the Boundless Great One, the Daoist abbey of such-and-such district, in such-and-such prefecture, county, township, and village, to receive the Supreme Pacts of the Great One’s Ascent to the Three Heavens, the Three Oaths of Life and Death, and the Register of the Altar. First, to deliver the suffering souls of our seven generations of parents from the dark realms, and next, to ascend and deliver the transgressions of life and death for [names], their rotting bones and exposed flesh. Though we have rendered no slight service, we have been granted mountains of favor—gifts beyond the worth of your servants’ foolishness. Overwhelmed by this profound grace, we prostrate ourselves and present this petition in gratitude.\n\nWe humbly pray that the attending officials will take pity on us and inscribe our names in the Jade Register of the Supreme Clarity’s Immortal Capital, that we may be counted among the seed-people of the immortals. We respectfully dispatch the Generals and Attendants of the Three Officials from within our bodies—the Celestial Official’s Examiner, the Terrestrial Official’s Examiner, the Aquatic Official’s Examiner, the Examiners of the Pure Tenuity Heaven, the Jade Clarity Heaven, and the Great Red Heaven—and the Perfected Officials of the four directions in this locale, who oversee the infusion of qi and the scrutiny of all attending Generals and Attendants. We entrust our lives and vital qi to the venerable elders. Having prepared all that is fitting for the wondrous and mysterious Central Mystery Altar upon the mountain’s peak, beneath the Great Yang, we prostrate ourselves and present this vermilion petition to the Most Supreme Great One’s presence.\n\nTogether with your servants [names], we make this solemn declaration to the august spirits above and point to the earthly deities below. Presumptuously, we transmit this grace, having received the favor of the Illuminated Perfected Lord of the Mysterious Ultimate, whose radiance infuses us with qi. We respectfully invite the Perfected Immortals of the Boundless and Natural, the Primordial Heavenly Emperor and the Supreme Primordial Lord, bearing their names and titles, leading their retinues of chariots and riders, the Five Stars and Five Emperors, the Nine Palaces and Five Marchmounts, the Four Seas, the Jade Armillary and Jade Balance, the Three Rivers and Nine Jiang, the divine armies of immortals, the Great One’s chariot of the single shaft, the horses of the Boundless before, and the true spirit and essence behind. May they attend the Five Emperors’ presence, the immortals’ chariots and riders flanking left and right, banishing all inauspicious omens before and all calamities behind. May the Jade Armillary revolve above our heads and the Northern Dipper tread beneath our feet. May the sun, moon, and Five Stars lead before and follow behind, shaking heaven and moving earth as they descend in perfect order to left and right. Together with your servants [names], may we be received in the Palace of the Three Primordials, becoming lords of the divine immortals and emperors. May the life-giving qi of the Three Heavens be extended to us, the divine elixirs of the Great One, the golden liquors and jade nectars entering the eighty-one palaces and twelve spirit chambers of our bodies, the Four Inflows of the Great Mystery. May the five spirits and essence of the Great One, the five qi as adornments, the three elixirs of the Nine Origins, refine our lives and reverse death, ascending to the morning’s zenith. May they infuse the Mysterious Palace, soaring over the Five Marchmounts, rising high and drifting aloft, their radiance illuminating the Golden Gates, their phoenix-like ascent to the Purple Court. May the immortal Dao swiftly be accomplished, feathers sprouting in due time. May we roam the eight wilds, play upon the eight terraces, traverse Hua and Huo, and be granted the cinnabar essence, the ninefold numinous convergence. May our seven generations of ancestors ascend and be delivered, their souls entering the homeland of the Dao, the halls of leisure and joy, where clothing and sustenance arise naturally.\n\nFor all who share this pact, when the day of reckoning arrives, we shall rescue and deliver one another, with the deliverance of our masters as our foremost duty, followed by our fellow initiates. From this day forward, we dare not betray the words of the Three Pacts. We shall revere our masters and hold goodness as our priority. For past sins and transgressions against the pact, we humbly beseech forgiveness and pardon.",
      "overlap_context": "mperor of the North, the Yellow Emperor of the Center, the Great One Emperor Lord, the August Great Dao, and the Jade Emperor of the Grand Clarity. With nine billion myriad riders, they shake Heaven and move Earth, descending upon this sacred peak and imperial altar to partake of this humble offering. May their numinous presence deign to grace the world, and in their compassion for the transgressions and shortcomings of living beings, I humbly beseech their forgiveness and pardon. I bow twice.\"*",
      "start_char": 6363,
      "end_char": 7683,
      "start_sentence": 77,
      "end_sentence": 83,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.52992653846741,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\正一法文法箓部仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "恩惟 太上无极大道无上玄老太上三炁天帝君分别求哀，臣等谨因二官直使正一功曹，上右官使者，阴阳神决吏，科车赤符吏，刚风骑置驿马上章吏官各二人，出操臣等受太一三盟拜上三日，谢恩纸章一通，上诣天曹，伏须告报，臣甲诚惶诚恐，稽首再拜。 右三日谢恩章。 四极明科开度文诀　　万仙公撰 夫受灵宝三十六部尊经，不受回案，即万劫之中不得传受，既受回案，不破太一登坛三盟金真妙契，则七玄不离於邓都，那可便为人师，三盟既竟，即七玄超度； 生死同仙，便拜回案，授为洞玄法师，若七祖未拔； 三盟不破，轻授回案，则师受泄经之罪，贱宝之愆，依四极明科，荷风刀之考，依三盟解释，则存亡超拔，标名诸天，故拜为灵宝法师，夫受灵宝开度，不显於师，则死籍不解，琼文无名，徒受宝经，永无传付，闭塞大法，於身为损，受经既竟，便为开度，上显诸天，下标诸地，名彻诸真为师，上盟五帝为洞玄师，若无此之功，师轻度回案，师则受轻泄违误之罪，身受风刀，万劫无原，后世为明识此言，勿作轻说，考及汝身，沈沦罪网，万劫无原，考属四极曹，有急底灾疾，呼太一名，以左手执道父，便仰头三呼无极太一君讳，我今有某急息，君当过我汤火之中，白刃之下，过度九息之中，知道为神，知道为真，左回还两顾。 子狩士徐名他二名上，鼠头人身，炁衣持镶，丑狩士秦何，牛头人身，炁衣持镶，寅狩士徐方，虎头人身，青衣持镁； 卯狩士徐泽，兔头人身，青衣持镁，辰狩士徐皇，龙头人身，青衣持镁；",
      "translated_text": "We humbly invoke the boundless grace of the Supreme Venerable Dao, the Most High Mysterious Ancient, the Three Qi Heavenly Emperor Lord. Through the direct envoys of the Two Bureaus, the Orthodox Unity Merit Officers, the Upper Right Bureau Messengers, the yin-yang divine writ officials, the chariot-bearing vermilion talisman officers, the刚风 courier post riders, and the memorial-presenting officials—each pair in their station—we, your servants, having received the Three Pacts of the Great One, now prostrate ourselves for three days to offer this petition of gratitude. One scroll of thanksgiving is hereby submitted to the Celestial Bureaus, awaiting your decree. With utmost reverence and awe, we bow our heads and kowtow twice.\n\n*Memorial of Thanksgiving after Three Days.*\n\n**The Luminous Statutes of the Four Poles: Texts and Precepts for Liberation**\n*Composed by the Assembly of the Ten Thousand Immortals*\n\nTo receive the thirty-six sacred scriptures of the Numinous Treasure without submitting a *huian* is to remain barred from transmission for ten thousand kalpas. Once the *huian* is submitted but the Three Pacts of the Great One—the Golden Perfection of the Altar’s Threefold Alliance—are not fulfilled, the Seven Mysteries shall not depart from Dengdu. How then may one presume to take disciples? Only upon completing the Three Pacts do the Seven Mysteries transcend; life and death become as one with the immortals. Then the *huian* is conferred, and one is ordained as a Master of the Cavernous Mystery.\n\nShould the seven generations of ancestors remain unredeemed or the Three Pacts be broken, to lightly bestow the *huian* is to incur the sins of leaking scriptures and profaning the sacred. By the *Luminous Statutes of the Four Poles*, one shall suffer the trial of the Wind Blade; by the Three Pacts’ covenant, the living and the dead shall be liberated, their names inscribed in the heavens. Thus is one ordained as a Master of the Numinous Treasure.\n\nTo receive the scriptures of the Numinous Treasure’s liberation without manifesting it to one’s master is to leave the register of death unbroken and one’s name absent from the Jade Texts. Though one may hold the sacred scriptures, they shall never be transmitted, and the Great Dao shall remain sealed—bringing only harm to oneself. Upon completing the transmission, one becomes a conduit of liberation, manifest above in the heavens and recorded below upon the earth. One’s name resounds among the perfected as a master; by the upper pact with the Five Emperors, one is a Master of the Cavernous Mystery. Without such merit, to lightly initiate disciples is to incur the sins of reckless transmission and error. The master shall suffer the Wind Blade, bound for ten thousand kalpas without reprieve. Let future generations heed these words and not treat them lightly, lest they be ensnared in the net of transgression, sinking into eternal damnation without pardon. Judgment falls under the Four Poles Bureau.\n\nIn times of urgent peril or affliction, call upon the name of the Great One. Grasp the Dao Father with your left hand, then raise your head and thrice invoke the name of the Boundless Great One. Say: *\"I now face dire straits—pass me through fire and water, beneath the white blade, and deliver me within nine breaths.\"* Know the Dao as divine; know the Dao as true. Turn left, look back twice.\n\n*Officers of the Twelve Branches:*\n- **Zi (Rat) Hunter:** Xu Mingta and two others—rat-headed, human-bodied, clad in qi-robes, bearing a spear.\n- **Chou (Ox) Hunter:** Qin He—ox-headed, human-bodied, clad in qi-robes, bearing a spear.\n- **Yin (Tiger) Hunter:** Xu Fang—tiger-headed, human-bodied, clad in azure robes, bearing a sickle.\n- **Mao (Rabbit) Hunter:** Xu Ze—rabbit-headed, human-bodied, clad in azure robes, bearing a sickle.\n- **Chen (Dragon) Hunter:** Xu Huang—dragon-headed, human-bodied, clad in azure robes, bearing a sickle.",
      "overlap_context": "e halls of leisure and joy, where clothing and sustenance arise naturally.\n\nFor all who share this pact, when the day of reckoning arrives, we shall rescue and deliver one another, with the deliverance of our masters as our foremost duty, followed by our fellow initiates. From this day forward, we dare not betray the words of the Three Pacts. We shall revere our masters and hold goodness as our priority. For past sins and transgressions against the pact, we humbly beseech forgiveness and pardon.",
      "start_char": 7683,
      "end_char": 8288,
      "start_sentence": 84,
      "end_sentence": 92,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.27465510368347,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\正一法文法箓部仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "巳狩士徐千，蛇头人身，赤衣持戟； 午狩士司马籍，马头人身，赤衣持戟； 未狩士公孙昔，羊头人身，赤衣持戟； 申狩士石胜，猴头人身，白衣持弩； 酉狩士石衰，鸡头人身，白衣持弩； 戌狩士徐阿，狗头人身，白衣持弩； 亥狩士公孙昔，堵头人身，黑衣持镶。 右十二时狩士真名，服符存呼之，不得传非其人，秘之慎之。 戴先生授谢颖川，谢颖川授道士陈艺，道士陈艺授母仲度，度授刘散骑道符，符授道士丁玄真。 九和香法，烧之香闻九里，感彻神明。 沉木香一斤，青木香三两， 甲香三两，熏陆香一斤， 詹唐香三两，燮香一斤， 青渐香一斤，雀头香一斤， 大乾枣二十枚。 凡九种各异，梼下徒以白蜜和，令相着密器中，封其口三宿，三日香成，闻九里，其法秘不妄传，欲致神明，合诸丹者烧之，稍稍分着别器中，令炁不泄。 此古九和也。 正一法文法箓部仪竟",
      "translated_text": "**Si (Snake) Hunter:** Xu Qian—snake-headed, human-bodied, clad in crimson robes, bearing a halberd.\n**Wu (Horse) Hunter:** Sima Ji—horse-headed, human-bodied, clad in crimson robes, bearing a halberd.\n**Wei (Goat) Hunter:** Gongsun Xi—goat-headed, human-bodied, clad in crimson robes, bearing a halberd.\n**Shen (Monkey) Hunter:** Shi Sheng—monkey-headed, human-bodied, clad in white robes, bearing a crossbow.\n**You (Rooster) Hunter:** Shi Shuai—rooster-headed, human-bodied, clad in white robes, bearing a crossbow.\n**Xu (Dog) Hunter:** Xu A—dog-headed, human-bodied, clad in white robes, bearing a crossbow.\n**Hai (Boar) Hunter:** Gongsun Xi—boar-headed, human-bodied, clad in black robes, bearing a spear.\n\nThe true names of the Twelve Branches’ Hunters are listed above. Wear the talisman and invoke them by name; do not transmit this to the unworthy. Guard this secret with care.\n\nMaster Dai transmitted this to Xie Yingchuan; Xie Yingchuan to Daoist Chen Yi; Daoist Chen Yi to Mother Zhongdu; Du to Liu, the Daoist Attendant-in-Ordinary; Liu to Daoist Ding Xuanzhen.\n\n**Nine Harmonies Incense Method:**\nWhen burned, its fragrance reaches nine *li*, moving the spirits and gods. The ingredients are:\n- One *jin* of aloeswood,\n- Three *liang* of *qingmu* incense,\n- Three *liang* of *jia* incense,\n- One *jin* of frankincense,\n- Three *liang* of *zhantang* incense,\n- One *jin* of *xie* incense,\n- One *jin* of *qingjian* incense,\n- One *jin* of *quetou* incense,\n- Twenty dried *daqian* jujubes.\n\nGrind each of the nine ingredients separately, then blend with white honey until thoroughly combined. Seal in a vessel for three nights; after three days, the incense is ready. Its fragrance carries nine *li*. This method is secret and must not be recklessly transmitted. To summon the gods or compound elixirs, burn it, portioning small amounts into separate containers to prevent the *qi* from dissipating. This is the ancient *Nine Harmonies* incense.\n\nHere ends the *Orthodox Unity Scriptures, Ritual Registers, and Liturgical Texts*.",
      "overlap_context": " (Rat) Hunter:** Xu Mingta and two others—rat-headed, human-bodied, clad in qi-robes, bearing a spear.\n- **Chou (Ox) Hunter:** Qin He—ox-headed, human-bodied, clad in qi-robes, bearing a spear.\n- **Yin (Tiger) Hunter:** Xu Fang—tiger-headed, human-bodied, clad in azure robes, bearing a sickle.\n- **Mao (Rabbit) Hunter:** Xu Ze—rabbit-headed, human-bodied, clad in azure robes, bearing a sickle.\n- **Chen (Dragon) Hunter:** Xu Huang—dragon-headed, human-bodied, clad in azure robes, bearing a sickle.",
      "start_char": 8288,
      "end_char": 8653,
      "start_sentence": 93,
      "end_sentence": 110,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.502235651016235,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\正一法文法箓部仪.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}