{
  "source_id": "正一指教斋仪",
  "source_file": "chunked_daozang\\正一指教斋仪.json",
  "total_chunks": 2,
  "total_original_chars": 1832,
  "total_translated_chars": 11246,
  "total_translation_time": 59.49991965293884,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\威仪类\\正一指教斋仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**Zhengyi Finger-Teaching Fast Ritual**\n*Sutra Title:* *Zhengyi Finger-Teaching Fast Ritual* (Full title: *Zhengyi Finger-Teaching Vigil and Invocation Ritual*)\n\nTradition holds that during the late Han dynasty, the Heavenly Master Dao possessed the *Finger-Teaching Fast Method*, later adapted into the *Finger-Teaching Vigil Ritual*. One scroll.\n\n*Source:* *Daoist Canon of the Zhengtong Era*, *Section of Numinous Writings*, *Category of Dignified Observances*.\n\n---\n\n### **Zhengyi Finger-Teaching Fast Ritual: Vigil and Invocation**\n\n**First, the Furnace is Lit**\nThe Most High Mysterious Origin, the Five Numinous Venerable Lords, shall summon the Merit-Officer Messengers, the Left and Right Dragon-Tiger Lords, and the Three Qi Upright Spirits bearing incense. Hasten to report to the Three Heavens’ Most High Mysterious Origin, the Great Dao Lord: your servants now burn incense and invoke the fast’s vigil. May the Eight Directions’ upright qi enter our bodies, that our prayers swiftly ascend before the Perfected and Boundless Dao.\n\n**Next, Facing West**\nYour disciple [Name], Merit-Officer of the Left Upright Qi of the Heavenly Master’s Yangping Abbey, bows twice and knocks his head thrice, reverently invoking the Heavenly Master, the Lineage Master, the Female Master, and the Three Masters’ Gatekeepers and Clerks. May we receive the upright qi of the Zhengyi to nourish body and spirit, that the Five Viscera bloom and the Six Palaces flow freely. May the disasters of the Four Quarters be dispelled, the calamities of seven generations dissolved. May we attain long life and enduring vision, becoming flying immortals. Bow twice.\n\n**Next, Facing North**\nYour disciple [Name], of the Left Upright Qi of the Heavenly Master’s Yangping Abbey, bows twice and knocks his head, reverently invoking the Supreme August Most High, the Northern Great Dao Lord. This humble one, born of flesh and bone, a withered descendant, beseeches the dissolution of sins—seven generations down to this body—of a thousand transgressions and ten thousand faults, all hidden offenses and secret trespasses against the Three Officials. May they be absolved, that blessings arise in the Five Directions and misfortunes vanish in the Nine Yin. May noxious spirits and malevolent ghosts dare not oppose us. May we envision jade maidens and immortals descending, attaining long life and enduring vision, our years equaling the Three Luminaries. Bow twice.\n\n**Next, Facing East**\nYour disciple [Name], of the Left Upright Qi of the Heavenly Master’s Yangping Abbey, bows twice and knocks his head, reverently invoking the Supreme Clarity’s Mysterious Origin, the Three Heavens’ Boundless Great Dao, the Most High Venerable Lord, the Heavenly Thearch’s Venerable Lord, the Nine Elders of the Immortal Metropolis, the Nine Qi Venerable Lords, the myriad layers of Dao qi, the Twelve Hundred Official Lords, and the Jade Court of Grand Clarity. May our hearts open and minds awaken, our ears and eyes grow keen. May we join the assembly of the Ten Thousand Immortals, be granted jade elixir, dispel disasters, and avert misfortunes. May we attain transcendence, high rank in the world, and golden chariots at our gates. May slanderous tongues and evil calamities, a thousand afflictions and ten thousand woes, be extinguished at once. May our names be recorded by the Three Officials, and may we receive the grace of the Three Heavens’ Venerable Lords. Bow twice.\n\n**Next, Facing South**\nYour disciple [Name], of the Left Upright Qi of the Heavenly Master’s Yangping Abbey, bows twice and knocks his head, reverently invoking the Southern Great Dao Lord and the Lord of Ten Thousand Blessings of the Three Heavens. May our names be inscribed in the Jade Registers and reported to the Lords of Destiny, that long life be decreed. We further beseech the Lord of Ten Thousand Blessings of the Three Heavens to bestow wealth from the Four Quarters and silks from the Eight Directions, amassing great abundance. May our meritorious deeds flourish, our every desire fulfilled, every endeavor accomplished, as our hearts wish and our hands direct. May we attain enduring vision and transcendence, our years equaling Heaven and Earth. Bow twice.\n\n**Next, Facing East and West**\n\nYour disciples [Names], of the Left Upright Qi of the Heavenly Master’s Yangping Abbey, reverently invoke the Supreme and Unsurpassed Great Dao, the August Supreme Northern Great Dao Lord, the Southern Great Dao Lord, the Supreme Three Heavens’ Boundless Great Dao Most High Lord Lao, the Heavenly Emperor Lord of the Supreme Elder, the Nine Elders of the Celestial Immortals’ Capital, the Nine Qi Elders, the myriad hosts of Dao qi and the twelve hundred official lords, the August Jade Court of the Supreme Clarity, and the attendants under the Three Masters—Heavenly Master, Lineage Master, and Female Master—entrusted with the registers.\n\nWe, your disciples, have long served the registers and abbey, adhering to the laws and upholding them, aiding the state and sustaining destiny, as ordained in the scriptures. We propagate the Dao to benefit all beings, following the aspirations of those who came before. Relying on this principle, we dare to present our humble petition. Today, with sincere devotion, we undertake this fast and recitation.\n\n**Recitation of the Petition**\nAs stated herein, it is fitting to grant deliverance. In accordance with the ancient rites of Hanzhong, we humbly establish the *Zhijiao* Fast, lasting one day and one night, with rites conducted at the three watches. Tonight, we gather to present this petition. May the Supreme Great Dao Lord, Master of the Teachings of the Four Quarters, and the efficacious Three Masters deign to look upon us, command the various offices, and instruct the officials in charge, along with the local deities, the true officials of upright qi, and the lords of communities and villages, to shield and protect us. May the altar be purified, evil demons averted, and our prayers transmitted, ensuring resonance. May the fast’s merit be fulfilled, its words rewarded, and our petition heard. We beseech further decrees. Your disciples [Names] bow twice and knock their heads.\n\n**Next, Facing West and Seated, the Twelve Laws of Dignified Conduct Are Expounded**\n\nThe Orthodox Unity Perfected One and Three Heavens’ Dharma Master states: The *Zhijiao* Fast and Precepts comprise twelve laws.\n\n1. One must not consume beings with blood or vital qi, nor pungent spices; only vegetables may be eaten, except during months contrary to life.\n2. At dawn, one drinks congee; at midday, one eats. Thereafter, water does not pass the teeth. By day, incense is burned; by night, lamps are lit. The light of lamps and incense must not falter. One rises and rests without straying from the rules.\n3. One abandons worldly entanglements, devoting oneself solely to the Dao.\n4. One reflects on the scriptures and precepts, purifying the heart and advancing with diligence.\n5. One practices kindness and filial piety toward all, pitying the ignorant, enlightening the foolish, and grieving for them.\n6. One repents and atones for transgressions, ever mindful as if holding poison. One knocks the head and strikes the breast, prostrating in utmost sincerity.\n7. One renounces worldly rank and wealth, treasuring only the Dao.\n8. One toils in body and endures hardship, serving with reverence and devotion, striving for the Dao.\n9. One prays to dispel all illnesses, the ten sufferings and eight adversities, to be spared in this world and become a seed of Great Peace.\n10. One honors the Dao and esteems virtue, aligning heart and speech. One purifies and advances, maintaining inner and outer cleanliness. During the fast, one performs rites and prostrations without rest or weariness.\n11. One recites scriptures and expounds the Dao, calming the heart and settling the mind, with clear intent and no wayward thoughts.\n12. At this time, one must strive to enter the precepts and abide in serene contemplation.\n\n**Next, Appointment of Officiants**\n\n**High Master [Name]**: His duty is to embody virtue and power, inwardly filled with dignified conduct and outwardly adorned with proper bearing. Every movement and pause conforms to the ritual standards, revered by the Three Realms and observed by gods and spirits. He petitions, invokes, and praises, communicating with the perfected and summoning the numinous, resolving doubts and guiding the assembly of worthies.\n\n**Chanter [Name]**: His duty is to be well-versed in ritual forms, mastering the regulations. He clarifies principles and guides the uncertain, ensuring every gesture and posture adheres to the proper measure and model. He must not err in recitation or deviate from the rites.\n\n**Supervisor of the Fast [Name]**: His duty is to be steadfast and discerning, with strict and impartial conduct. He disciplines himself and aligns the assembly, serving as a model. Only then may he correct transgressions and uphold the rules. He must not neglect the statutes or indulge in laxity.\n\n**Scripture Attendant [Name]**: His duty is to maintain solemn and respectful attire, reverently tending the hall and altar. He ensures the inner curtain is orderly, the tables and cases aligned, and the scrolls handled with care. He must not disorder the sequence or neglect the scriptures.\n\n**Incense Attendant [Name]**: His duty is to convey words and clarify principles, relying on incense. He ensures the smoke and qi rise in abundance, wafting fragrance. Only then will the sound reach the Great Void and the voice ascend to the celestial realms. He must not allow the embers to smolder or the fragrance to fade.\n\n**Lamp Attendant [Name]**: His duty is to illuminate the darkest night, entrusted with the lamps. He ensures the flames burn evenly and brightly, their light traversing the moon’s path. Only then can the depths of springs and caves be mirrored and illumined. He must not allow the light to flicker or the radiance to dim.\n\n**Next, Returning to the Brazier**\n\nIncense Officials and Envoys, the Left and Right Dragon-Tiger Lords, and all attending spirit officials: May the quiet chamber where the Dao is practiced and the sacred altar where the registers are exposed naturally generate golden liquid, cinnabar essence, and divine mushrooms. May the hosts of spirits and perfected gather before this incense altar, enabling us to attain the Dao and achieve transcendence. May we, your disciples, receive blessings, and our households be favored. May the jade maidens of the eight directions guard the incense smoke, transmitting our words directly to the presence of the Perfected and Boundless Dao.\n\n**Next, Chanting the *Purple Radiance Hymn* and Exiting the Altar**\n\nThe purple radiance dances in the mysterious hall,\nThe primordial qi is ever formless.\nIt washes the three cinnabar fields,\nThe eight luminaries receive the lofty clarity.\nThe seven luminaries shine brightly in their chambers,\nTranscendent in the profound darkness.\nSerene and meandering by the spring,\nThe divine dragon shares the reins.\nAfter three cycles, resonance is achieved,\nDisasters dispelled, the immortal’s path complete.\n\nThe *Zhijiao* Fast Rites of the Orthodox Unity Tradition are now concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "正一指教斋仪 经名：正一指教斋仪。 全称《正一指教齐宿启仪》。 相传汉末天师道有指教斋法，徒改编为指教齐仪。 一卷。 底本出处：《正统道藏》洞神部威仪类。 正一指教斋仪 宿启仪 先发炉 太上玄元五灵老君，当召功曹使者，左右龙虎君，捧香使者三炁正神，急上关启三天太上玄元大道君，臣等正尔烧香，宿启斋事，愿得八方正炁，来入臣等身中，所启速达径御至真无极道前。 次西向 系天师阳平治左平炁都功臣某甲稽首再拜，各三叩搏谨关启天师嗣师系师女师三师君门下典者君吏，愿得正一生炁，灌养形神，五藏生华，六府宣通，消四方之灾祸，解七世之殃患，长生久视，得为飞仙再拜。 次北向 系天师阳平治左平炁臣姓名稽首再拜，谨关启上皇太上北上大道君，臣某胎生肉人，枯骨子孙，愿得解除七世已下逮及某身，千罪万过，阴私伏匿考犯三官者，皆乞消解，当令福生五方，祸灭九阴，邪精恶鬼，莫敢当向，存思神仙玉女来降，长生久视，寿同三光。 再拜。 次东向 系天师阳平治左平炁臣姓名稽首再拜，谨关启太清玄元上三天无极大道太上老君，太上丈人，天帝君天帝丈人，九老仙都君九炁丈人等，百千万重道炁，千二百官君，泰清玉陛下，臣等愿心开意悟，耳目聪明，万仙会议，赐以玉丹，消灾却祸，遂获神仙，世官高贵，金车入门，口舌恶祸，千殃万患，一时灭绝，记在三官，被受三天丈人之恩。 再拜。 次南向 系天师阳平治左平熙臣姓名稽首再拜，谨关启南上大道君，三天万福君，愿书名玉籍，告诸司命，以长生为定，又乞敕三天万福君，致四方之钱财，八方之谷帛，富积巍巍，施行功德，所向所欲，万事克成，如心所愿，如手所指，久视 神仙，寿同天地。 再拜。",
      "translated_text": "**Zhengyi Finger-Teaching Fast Ritual**\n*Sutra Title:* *Zhengyi Finger-Teaching Fast Ritual* (Full title: *Zhengyi Finger-Teaching Vigil and Invocation Ritual*)\n\nTradition holds that during the late Han dynasty, the Heavenly Master Dao possessed the *Finger-Teaching Fast Method*, later adapted into the *Finger-Teaching Vigil Ritual*. One scroll.\n\n*Source:* *Daoist Canon of the Zhengtong Era*, *Section of Numinous Writings*, *Category of Dignified Observances*.\n\n---\n\n### **Zhengyi Finger-Teaching Fast Ritual: Vigil and Invocation**\n\n**First, the Furnace is Lit**\nThe Most High Mysterious Origin, the Five Numinous Venerable Lords, shall summon the Merit-Officer Messengers, the Left and Right Dragon-Tiger Lords, and the Three Qi Upright Spirits bearing incense. Hasten to report to the Three Heavens’ Most High Mysterious Origin, the Great Dao Lord: your servants now burn incense and invoke the fast’s vigil. May the Eight Directions’ upright qi enter our bodies, that our prayers swiftly ascend before the Perfected and Boundless Dao.\n\n**Next, Facing West**\nYour disciple [Name], Merit-Officer of the Left Upright Qi of the Heavenly Master’s Yangping Abbey, bows twice and knocks his head thrice, reverently invoking the Heavenly Master, the Lineage Master, the Female Master, and the Three Masters’ Gatekeepers and Clerks. May we receive the upright qi of the Zhengyi to nourish body and spirit, that the Five Viscera bloom and the Six Palaces flow freely. May the disasters of the Four Quarters be dispelled, the calamities of seven generations dissolved. May we attain long life and enduring vision, becoming flying immortals. Bow twice.\n\n**Next, Facing North**\nYour disciple [Name], of the Left Upright Qi of the Heavenly Master’s Yangping Abbey, bows twice and knocks his head, reverently invoking the Supreme August Most High, the Northern Great Dao Lord. This humble one, born of flesh and bone, a withered descendant, beseeches the dissolution of sins—seven generations down to this body—of a thousand transgressions and ten thousand faults, all hidden offenses and secret trespasses against the Three Officials. May they be absolved, that blessings arise in the Five Directions and misfortunes vanish in the Nine Yin. May noxious spirits and malevolent ghosts dare not oppose us. May we envision jade maidens and immortals descending, attaining long life and enduring vision, our years equaling the Three Luminaries. Bow twice.\n\n**Next, Facing East**\nYour disciple [Name], of the Left Upright Qi of the Heavenly Master’s Yangping Abbey, bows twice and knocks his head, reverently invoking the Supreme Clarity’s Mysterious Origin, the Three Heavens’ Boundless Great Dao, the Most High Venerable Lord, the Heavenly Thearch’s Venerable Lord, the Nine Elders of the Immortal Metropolis, the Nine Qi Venerable Lords, the myriad layers of Dao qi, the Twelve Hundred Official Lords, and the Jade Court of Grand Clarity. May our hearts open and minds awaken, our ears and eyes grow keen. May we join the assembly of the Ten Thousand Immortals, be granted jade elixir, dispel disasters, and avert misfortunes. May we attain transcendence, high rank in the world, and golden chariots at our gates. May slanderous tongues and evil calamities, a thousand afflictions and ten thousand woes, be extinguished at once. May our names be recorded by the Three Officials, and may we receive the grace of the Three Heavens’ Venerable Lords. Bow twice.\n\n**Next, Facing South**\nYour disciple [Name], of the Left Upright Qi of the Heavenly Master’s Yangping Abbey, bows twice and knocks his head, reverently invoking the Southern Great Dao Lord and the Lord of Ten Thousand Blessings of the Three Heavens. May our names be inscribed in the Jade Registers and reported to the Lords of Destiny, that long life be decreed. We further beseech the Lord of Ten Thousand Blessings of the Three Heavens to bestow wealth from the Four Quarters and silks from the Eight Directions, amassing great abundance. May our meritorious deeds flourish, our every desire fulfilled, every endeavor accomplished, as our hearts wish and our hands direct. May we attain enduring vision and transcendence, our years equaling Heaven and Earth. Bow twice.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 701,
      "start_sentence": 0,
      "end_sentence": 21,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.358232736587524,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一指教斋仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "次还东面西 系天师阳平治左平炁臣姓名等，上启太上无上大道上皇太上北上大道君，南上大道君，泰清玄元上三天无极大道太上老君，太上丈人天帝君，天帝丈人九老仙都君，九炁丈人等，百千万重道炁千二百官君，泰清玉陛下，天师嗣师系师女师三师君门下典者君吏，臣等夙参箓治，依法遵行，助国扶命，出自经旨，宣道利物，前修所尚，敢籍斯义，冒有披陈，今谨有斋忱，用伸宣读。 读辞 具如所言，诚宜拯济，谨依汉中旧典，奉建指教斋，直一日一夜，三时行道，即夕同集，宿启上闻，恩惟 太上大道君，四方教主，三师灵应，俯垂鉴摄，告下群司，宣勒职掌，及土地里域，正炁真官，社里邑君，咸垂拥护，清净座所，遏却邪魔，传祈所愿，必令通感，斋功成就，言功酬赏，谨以奏闻，愿加申勒，臣某等稽首再拜。 次还西向坐，说威仪十二法 正一真人三天法师曰：指教斋戒有十二法。 一者不得食含血有生炁之物，熏辛之属唯得食菜，非向生之月。 二者平旦饮粥，日中则食，自是之后，水不过齿，昼则烧香，夜则然灯，令灯香光不报，须臾坐起，卧息不离法则。 三者弃舍因绿，唯道是务。 四者思经念戒，洗心精进。 五者慈孝一切，愍念不知，开示愚痴，为之痛心。 六者悔谢罪过，恒如持毒，叩头自搏，礼谢竭诚。 七者弃世爵禄，所宝唯道。 八者劳身苦体，恭敬尽节，为道驱驰。 九者愿除众病，十苦八难，得免之世，为太平种民。 十者尊道贵德，心口相副，洗漱精进，内外清洁，斋直礼拜，不敢息倦。 十一者诵经讲道，安心定意，志愿分明，无有邪乱。 十二者当此之时，令争入戒，令入静念。 次补职 高功姓名，其职也道德，内充威仪，外备俯仰，动止莫非法式，三界所尊，鬼神所瞻，关启祝颂，通真召灵，解释疑滞，导达众贤。 都讲姓名，其职也闲习仪范，综括宪章，宣畅诚理，引导疑昧，必令俯仰合度，规矩从式，勿漏越唱违忤礼仪。 监斋姓名，其职也才用贞审，质范严明，励己齐众，取为人则，方可纠察邪违，绳正规轨，勿得轻略科典，纵任息替。 侍经姓名，其职也位服端俨，敬肃堂筵，必令中帐严整，几案齐列，开卷蕴轴，每存祇励，勿使执置乖序，典章亏失。 侍香姓名，其职也通言畅理，所资在香，必令烟炁氛氲，飞馨散馥，然后响闻太空，声传上境，勿使灰炭沈冥，芬芳辍息。 侍灯姓名，其职也洞幽朗夜，寔寄灯浊，必令列焰齐明，通光月路，始能皎镜泉途，炳焕沈穴，勿使烟光扇荡，晖影倾翳。 次复炉 香官使者，左右龙虎君，侍香诸灵官，当令静室行道，灵坛露捆之所，自然生金液丹精芝英，百灵众真交会在此香火案前，使某等得道，克获神仙，臣身受福，合门荷恩，八方玉女，侍卫香烟，传奏所言，径御 至真无极道前。 次咏紫霞颂出坛 紫霞舞玄堂，元炁常无形，洞灌三丹田，八景承高清，七曜房朗朗，超哉郁冥冥，曲静徘徊泉，神龙同辔軿，三周一感会，灾脱仙道成。 正一指教斋仪竟",
      "translated_text": "**Next, Facing East and West**\n\nYour disciples [Names], of the Left Upright Qi of the Heavenly Master’s Yangping Abbey, reverently invoke the Supreme and Unsurpassed Great Dao, the August Supreme Northern Great Dao Lord, the Southern Great Dao Lord, the Supreme Three Heavens’ Boundless Great Dao Most High Lord Lao, the Heavenly Emperor Lord of the Supreme Elder, the Nine Elders of the Celestial Immortals’ Capital, the Nine Qi Elders, the myriad hosts of Dao qi and the twelve hundred official lords, the August Jade Court of the Supreme Clarity, and the attendants under the Three Masters—Heavenly Master, Lineage Master, and Female Master—entrusted with the registers.\n\nWe, your disciples, have long served the registers and abbey, adhering to the laws and upholding them, aiding the state and sustaining destiny, as ordained in the scriptures. We propagate the Dao to benefit all beings, following the aspirations of those who came before. Relying on this principle, we dare to present our humble petition. Today, with sincere devotion, we undertake this fast and recitation.\n\n**Recitation of the Petition**\nAs stated herein, it is fitting to grant deliverance. In accordance with the ancient rites of Hanzhong, we humbly establish the *Zhijiao* Fast, lasting one day and one night, with rites conducted at the three watches. Tonight, we gather to present this petition. May the Supreme Great Dao Lord, Master of the Teachings of the Four Quarters, and the efficacious Three Masters deign to look upon us, command the various offices, and instruct the officials in charge, along with the local deities, the true officials of upright qi, and the lords of communities and villages, to shield and protect us. May the altar be purified, evil demons averted, and our prayers transmitted, ensuring resonance. May the fast’s merit be fulfilled, its words rewarded, and our petition heard. We beseech further decrees. Your disciples [Names] bow twice and knock their heads.\n\n**Next, Facing West and Seated, the Twelve Laws of Dignified Conduct Are Expounded**\n\nThe Orthodox Unity Perfected One and Three Heavens’ Dharma Master states: The *Zhijiao* Fast and Precepts comprise twelve laws.\n\n1. One must not consume beings with blood or vital qi, nor pungent spices; only vegetables may be eaten, except during months contrary to life.\n2. At dawn, one drinks congee; at midday, one eats. Thereafter, water does not pass the teeth. By day, incense is burned; by night, lamps are lit. The light of lamps and incense must not falter. One rises and rests without straying from the rules.\n3. One abandons worldly entanglements, devoting oneself solely to the Dao.\n4. One reflects on the scriptures and precepts, purifying the heart and advancing with diligence.\n5. One practices kindness and filial piety toward all, pitying the ignorant, enlightening the foolish, and grieving for them.\n6. One repents and atones for transgressions, ever mindful as if holding poison. One knocks the head and strikes the breast, prostrating in utmost sincerity.\n7. One renounces worldly rank and wealth, treasuring only the Dao.\n8. One toils in body and endures hardship, serving with reverence and devotion, striving for the Dao.\n9. One prays to dispel all illnesses, the ten sufferings and eight adversities, to be spared in this world and become a seed of Great Peace.\n10. One honors the Dao and esteems virtue, aligning heart and speech. One purifies and advances, maintaining inner and outer cleanliness. During the fast, one performs rites and prostrations without rest or weariness.\n11. One recites scriptures and expounds the Dao, calming the heart and settling the mind, with clear intent and no wayward thoughts.\n12. At this time, one must strive to enter the precepts and abide in serene contemplation.\n\n**Next, Appointment of Officiants**\n\n**High Master [Name]**: His duty is to embody virtue and power, inwardly filled with dignified conduct and outwardly adorned with proper bearing. Every movement and pause conforms to the ritual standards, revered by the Three Realms and observed by gods and spirits. He petitions, invokes, and praises, communicating with the perfected and summoning the numinous, resolving doubts and guiding the assembly of worthies.\n\n**Chanter [Name]**: His duty is to be well-versed in ritual forms, mastering the regulations. He clarifies principles and guides the uncertain, ensuring every gesture and posture adheres to the proper measure and model. He must not err in recitation or deviate from the rites.\n\n**Supervisor of the Fast [Name]**: His duty is to be steadfast and discerning, with strict and impartial conduct. He disciplines himself and aligns the assembly, serving as a model. Only then may he correct transgressions and uphold the rules. He must not neglect the statutes or indulge in laxity.\n\n**Scripture Attendant [Name]**: His duty is to maintain solemn and respectful attire, reverently tending the hall and altar. He ensures the inner curtain is orderly, the tables and cases aligned, and the scrolls handled with care. He must not disorder the sequence or neglect the scriptures.\n\n**Incense Attendant [Name]**: His duty is to convey words and clarify principles, relying on incense. He ensures the smoke and qi rise in abundance, wafting fragrance. Only then will the sound reach the Great Void and the voice ascend to the celestial realms. He must not allow the embers to smolder or the fragrance to fade.\n\n**Lamp Attendant [Name]**: His duty is to illuminate the darkest night, entrusted with the lamps. He ensures the flames burn evenly and brightly, their light traversing the moon’s path. Only then can the depths of springs and caves be mirrored and illumined. He must not allow the light to flicker or the radiance to dim.\n\n**Next, Returning to the Brazier**\n\nIncense Officials and Envoys, the Left and Right Dragon-Tiger Lords, and all attending spirit officials: May the quiet chamber where the Dao is practiced and the sacred altar where the registers are exposed naturally generate golden liquid, cinnabar essence, and divine mushrooms. May the hosts of spirits and perfected gather before this incense altar, enabling us to attain the Dao and achieve transcendence. May we, your disciples, receive blessings, and our households be favored. May the jade maidens of the eight directions guard the incense smoke, transmitting our words directly to the presence of the Perfected and Boundless Dao.\n\n**Next, Chanting the *Purple Radiance Hymn* and Exiting the Altar**\n\nThe purple radiance dances in the mysterious hall,\nThe primordial qi is ever formless.\nIt washes the three cinnabar fields,\nThe eight luminaries receive the lofty clarity.\nThe seven luminaries shine brightly in their chambers,\nTranscendent in the profound darkness.\nSerene and meandering by the spring,\nThe divine dragon shares the reins.\nAfter three cycles, resonance is achieved,\nDisasters dispelled, the immortal’s path complete.\n\nThe *Zhijiao* Fast Rites of the Orthodox Unity Tradition are now concluded.",
      "overlap_context": "ibed in the Jade Registers and reported to the Lords of Destiny, that long life be decreed. We further beseech the Lord of Ten Thousand Blessings of the Three Heavens to bestow wealth from the Four Quarters and silks from the Eight Directions, amassing great abundance. May our meritorious deeds flourish, our every desire fulfilled, every endeavor accomplished, as our hearts wish and our hands direct. May we attain enduring vision and transcendence, our years equaling Heaven and Earth. Bow twice.",
      "start_char": 702,
      "end_char": 1916,
      "start_sentence": 22,
      "end_sentence": 53,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.14168691635132,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一指教斋仪.txt",
        "category": "威仪类"
      }
    }
  ]
}