{
  "source_id": "正一殟司辟毒神灯仪",
  "source_file": "chunked_daozang\\正一殟司辟毒神灯仪.json",
  "total_chunks": 3,
  "total_original_chars": 1904,
  "total_translated_chars": 11502,
  "total_translation_time": 62.296852588653564,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\威仪类\\正一殟司辟毒神灯仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**The Rite of the Orthodox Unity’s Pestilence-Warding Lamp of the Wenchang Bureau**\n*Scripture Title:* *The Rite of the Orthodox Unity’s Pestilence-Warding Lamp of the Wenchang Bureau*. One fascicle.\n*Source Text:* *Zhengtong Daoist Canon*, *Dongzhen* Section, *Weiyi* Category.\n\n---\n\n**The Rite of the Orthodox Unity’s Pestilence-Warding Lamp of the Wenchang Bureau**\n\nThe ritual proceeds according to form.\n\nWe humbly observe: when primal chaos first divided, qi and form were distinguished. Nüwa severed the turtle to establish the axis; Yi and Qi observed the celestial patterns to bestow the seasons. The Three Powers were apportioned into three, the Five Phases disseminated into five. Thus, qi divided into seventy-two seasonal nodes, and the year was fixed at three hundred and sixty days. Through transformation, the spirits and gods act; through subtlety, yin and yang govern cold and heat.\n\nHeaven hangs its signs, and fortune or misfortune becomes visible. Humankind receives its nature, and blessings or calamities arrive of their own accord. Thus, the wellspring of blessings flows to families that accumulate goodness, while disaster and fault inevitably approach those who do evil. Fortunately, there exists the path of prayer and supplication, and the gate of expedient means stands open.\n\nNow, the faithful devotee [Name], dwelling beneath the canopy of heaven and earth, abiding under the shelter of the Dao, rectifies the mind and sincerely offers reverence to Heaven and the gods. Establishing the numinous altar, they perform the pure jiao offering. Incense smoke drifts in ethereal clouds; lamp flames blaze like stars in the azure vault. The jade terrace grows cold beneath the moon, and immortal robes fade into the distance; the azure firmament is swept by clear winds, and cloud-borne chariots soar.\n\nPerceiving this earnest offering of vegetarian repast, may the gods deign to descend in solemn regard.\n\nWe humbly pray that luminous virtue be abundantly bestowed, and vast grace poured down, augmenting future blessings and dispelling past transgressions. May myriad fortunes converge, all demons be vanquished, and no harm or disaster befall, granting ease and peace. May golden script record an imperishable name, and the azure tablets inscribe the method of extended life. We further implore your protection, offering utmost reverence.\n\nBowing in homage, we take refuge in the Boundless Dao.\n\nWe, the assembled, with sincere devotion, take refuge in and offer our lives to the Eastern Plague-Commanding Marshal Zhang.\n\nWe humbly observe: above the Great Void, among the honored of the heavens, the nine-colored radiance arises naturally, unassisted by the illumination of the Three Luminaries. From the sun, moon, and stars above to the seas, mountains, and rivers below, all who incline their hearts to serve the Emperor fulfill the rites of vassalage. Palaces and chambers, halls and pavilions—some are wrought of treasures, others formed of clouds and mist. Vast and indistinct, they are the courts of the insubstantial; pure and boundless, they are the halls of luminous communion.\n\nOn days of fasting, the host of spirits gathers. Winds arise, and the purple heavens resound; incense smoke ascends, and the clear breeze forms talismanic script. Countless immortals, the thirty-two Perfected Lords—none fail to assemble at the Jade Capital and ascend to the Golden Portals.\n\nNow, the faithful devotee [Name]’s silver lamps blaze brilliantly, and sandalwood incense wafts in curling clouds. We earnestly pray for your descent and reverently offer this hymn of praise:\n\nArrayed in silver lamps, they transform into jeweled canopies.\nResplendent with radiance, like falling stars they descend.\nThe celestial retinue of the Nine Heavens lingers in descent,\nEnveloped in five-colored auspicious clouds and misty vapors.\nCommand the Three Officials to dispel calamities,\nThat epidemics and pestilence may all be healed.\nThe Wenchang Bureau and its retinue drive away evil and expel demons.\nBestow blessings, avert disaster—we offer reverence without cease.\n\nWe, the assembled, with sincere devotion, take refuge in and offer our lives to the Southern Plague-Commanding Marshal Tian.\n\nWe humbly observe: the August Thearch, in hidden virtue, watches over the people, and thus commands the divine host of the Pestilence Bureau to apportion Heaven’s decrees of fortune and misfortune. Those who accumulate goodness enjoy abundant blessings and may dwell in peace; those who accumulate evil suffer lingering calamities and cannot escape reproof.\n\nThe Sage of the Wenchang Bureau wields mighty authority. The Marshal of the Primordial Heaven holds great power and exalted office. In the days when King Wu governed the world, it was the time when the Perfected One of Mount Kuang attained the Dao. Riding the wind upon qi, who could pursue his immortal chariot? In secluded valleys and deep ravines, his divine traces remain visible today.\n\nHis honorific title is \"Harmonizer of Pestilence\"; his sacred mandate is \"Serene Clarity.\" Though pestilence arises from the great Dao, it is summoned by human action. Yet the scrutiny of the gods adheres to virtue alone.\n\nNow, the faithful devotee [Name] offers incense like drifting clouds and arranges lamps in the pattern of the stars. We earnestly pray for your descent and reverently offer this hymn of praise:\n\nWe look up to invoke the Five Pestilence Lords, the august and sacred emperors.\nMay they turn their keen perception and broadly bestow saving grace.\nMarshal of the Primordial Heaven, extend your favor to all.\nYour mighty spirits to left and right suffer no obstruction.\nMaster of Mount Kuang, harmonize pestilence and repel plague.\nWithdraw pestilence, gather toxins—blessings extend to descendants.\nEnvision your cloud-borne chariot descending to the altar’s precincts.\nProtect and shelter this household, that they may forever rely on your divine refuge.\n\nWe, the assembled, with sincere devotion, take refuge in and offer our lives to the Western Plague-Commanding Marshal Zhao.\n\nWe humbly observe: the great furnace of creation, in its impartiality, covers and shelters all; the open net of governance watches over humanity, and good and evil receive their due recompense. The warnings of vigilance and introspection, the solemn texts of reverent devotion—these are transmitted in the *Yi* of Fuxi and recorded in the *Book of Zhou*. Fortune and misfortune lie within ourselves; blessings and calamities have no fixed gate.\n\nThose whose years are not prolonged suffer for their past transgressions; those who inherit lingering misfortune do not endure Heaven’s cruelty. If one can repent of wrongdoing, a hundred blessings will naturally arrive; if one does not reform, the six extremes will inevitably follow.\n\nThus, there exists the Pestilence Bureau to uphold Heaven’s mandate.\n\nWithin a twelve-year cycle, the Year Sovereign metes out rewards and punishments; across the five directions, generals are empowered to wield authority. The mighty Fànmó King aids the sagely with fierce might; the divine Tàibǎo Zhāng Kāng ever manifests in wondrous efficacy. May the thunderous might of lightning and storm be concealed, and blessings of felicity be bestowed.\n\nThus does the faithful devotee [Name] now kindle lotus lamps and burn incense whose fragrance fills the lion-thrones. Earnestly we pray for your descent, and reverently chant in praise:\n\nMighty Fànmó King, incline to the great work of creation.\nTàibǎo Zhāng Kāng, may your temple’s visage be honored and serene.\nThe Twelve Year Sovereigns, exalted by the Emperor’s decree.\nThe Envoys of the Five Directions, who expel violence and banish evil.\nUpright and discerning, they commend loyalty and shelter filial piety.\nVast in transformation, cool and clear, they long to shelter and embrace all.\n\nWe, your servants, with devoted hearts submit our lives to the Northern Pestilence Envoy, Shǐ the Messenger.\n\nWe humbly observe: august Heaven shows no partiality, the great Dao does not cling to form. Its power subtly perfects the myriad things; its radiance illumines the four quarters. To prolong fortune and life, there exist rites of exorcism; whether man or woman, all receive the grace of its sheltering embrace. The Pestilence Bureau, descending to the mortal realm, dispatches disease with the ferocity of ghostly kings and induces sweat through the divine efficacy of its envoys. Through fortune and misfortune it transforms humanity; through calamity and blessing it descends upon the world. Ever good at saving beings, it harbors no intent to harm; boundless in delivering people, it possesses the virtue of cherishing life. Thus do yin and yang wax and wane, cold and heat alternate; the twelve pitch-standards remain impartial, the four seasons and six qi follow their measure. Pestilence divides into thirty-six kinds, while seventy-two spirits array the signs. When the heart sprouts goodness, disaster dissipates; when the mind contrives wrong, calamity arrives. Should we offer reverent devotion, health and harmony will surely be granted.\n\nThus does the faithful devotee [Name] now scatter fragrant incense and array glowing lamps. Earnestly we pray for your descent, and reverently chant in praise.\n\nThe thirty-six ten-day periods govern the seasons’ qi,\nThe twenty-four spirits oversee the gates’ clepsydra divisions.\nThe seventy-two spirits receive their mandate in due time,\nThe twelve pitch-standards—Yellow Bell and Great Budding foremost.\n\nBlack banners, flashing blades, fangs long and beasts immense:\nThese are Heaven’s decrees, the protection of all living beings.\nCompassion turns the countenance, divine might stills transgression.\nGuard and bless this household with health, peace, prosperity, and longevity.\n\nWe, your devoted servants, now wholeheartedly submit our lives,\nTo the Central Plague-Quelling Envoy, Master of Pestilence.\n\nThus has it been since the sages of old first established the rites,\nTransmitted through unbroken ages, manifesting divine power,\nThen spreading worship to every region.\nErecting altars and shrines in obedience to Heaven’s command,\nDwelling within the land’s bounds to display majestic might.\n\nFine wine and choice offerings arrayed in cups and platters, rich and pure;\nCrimson eaves and jade-green tiles adorn halls and palaces, solemn and grand.\nSome are Daoist immortals, some great bodhisattvas of the Buddhist gate,\nSome heroes of antiquity, some worthies of ages past.\nSome are rendered in painted likeness, some shaped from clay;\nReceiving offerings from one region, drawing reverence from a thousand leagues.\n\nNow the faithful devotee [Name] kindles crimson candles, their glow undimmed,\nBurns purple sandalwood, its fragrance lingering like mist.\nAll people gaze in awe, scholars and commoners alike turn in devotion.\nThe assembly, with utmost sincerity, reverently chants in praise:\n\nSpirits of prefectures and towns, lords of humanity,\nEarth gods and city gods, receiving blood sacrifices for a thousand years.\nDivine beings of temples and shrines, their fame resplendent,\nWorthies of ages past, traversing the four seas.\nThe rites of this land endure unchanged.\nMay your penetrating gaze descend in joyful presence,\nGuard and bless this household, that it may forever know no terror.\n\nRecitation of scriptures, proclamation of petitions,\nOffering of paper money, dedication of merit—\nThe Rite of the Orthodox Unity’s Pestilence-Dispelling, Toxin-Averting Spirit Lamp is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "正一殟司辟毒神灯仪 经名：正一殟司辟毒神灯仪。 一卷。 底本出处：《正统道藏》洞真部威仪类。 正一殟司辟毒神灯仪 法事如式 伏以混沌既分，气形乃判，女娲断鳌而立极，伊祈历象以授时。 分三才而成三，播五行而为五。 由是气分七十二候，岁定三百六旬。 成变化以行鬼神，妙阴阳而运寒暑。 天垂象，财吉凶可见； 人禀性，而祸福自来。 故庆源乃袭於积善之家，而殃咎必几於作恶之者。 幸有祷祈之路，抑开方便之门。 以今信士某囿形覆焘之间，托迹帡幪之下，正心诚意，尊天敬神，启建玄坛，修崇清醮。 香烟缥缈，霭空洞之云霞； 灯焰荧煌，灿青霄之星斗。 瑶台月冷而仙裾缥渺，碧汉风清而云驭翱翔。 察兹恳恳之斋羞，愿赐迂迂而降监。 伏愿明德诞敷，洪恩下沛，增注方来之庆，蠲消已往之非。 万福攸同，群魔灭试，无灾无害，且逸且安。 金书标不朽之名，青简注延生之法。 更祈加护，是罄恪恭。 稽首归依，无极大道。 臣众等志心归命，东方行瘟张使者。 伏以太虚之上，诸天之尊，自然九色之光华，不假三晨之照烛。 上至日月星宿，下及海岳山川，或倾事帝之心，尽属为臣之礼。 宫室户牖，殿阁楼台。 或珍宝以营成，或云霞而结就。 虚无缥缈，是为恍惚之庭； 森罗净霐，别有通明之殿。 每於斋日，普集群灵，风生而紫宇成音，烟起而清风结篆。 百千万之仙众，三十二之帝君，莫不大会玉京，上朝金阙。 以今信士某银缸灿烂，檀炷氤氲，惟愿降临，谨当赞咏： 布列银缸，化成宝盖。 灿烂光华，流星俯届。 九霄仪仗，徘徊下迈。 五色祥云，氤氲沆瀣。 勑下三官，消除灾害。 疫疾瘟，皆蒙痊瘥。 殟司部从，驱邪除怪。 降福消灾，虔恭匪懈。 臣众等志心归命，南方行瘟田使者。 伏以惟皇上帝，阴骘下民，故敕温部之神明以分天道之祸福。 积善者有余庆，则可保於安宁； 积恶者有余殃，则难逃於谴责。 主殟圣者，威重权高。 都天元帅，势大职尊。 昔武王治世之日，乃匡阜得道之时。 御气乘风，孰可攀於仙驾； 幽岩邃谷，今犹见於灵踪。 尊号和瘟，静明敕赐。 虽大道之瘟疫。 惟人所召； 然神明之紏察，惟德是依。 以今信士某是以香袅轻云，灯排列宿。 惟愿降临，谨当赞咏： 仰启五殟，尊神圣帝。 愿回聪直，广垂济惠。 元帅都天，留恩一切。 左右威灵，无诸凝滞。 匡阜先生，和殟却疠。 收殟摄毒，福及后裔。 驻想云舆，来临坛治。 保佑一家，永依神庇。 臣众等志心归命，西方行瘟赵使者。 伏以洪炉造物，覆焘所以无私； 疏网临人，善恶因而有报。 恐惧修省之戒，严恭夤奉之文。 羲易所传，周书备载，吉凶在我，祸福无门。 降年不永者，惟民宿辜； 不善余殃者，非天作孽。 若能悔过，百祥自此而臻； 苟不悛心，六极自然而至。 故有殟部，以奉 天符。",
      "translated_text": "**The Rite of the Orthodox Unity’s Pestilence-Warding Lamp of the Wenchang Bureau**\n*Scripture Title:* *The Rite of the Orthodox Unity’s Pestilence-Warding Lamp of the Wenchang Bureau*. One fascicle.\n*Source Text:* *Zhengtong Daoist Canon*, *Dongzhen* Section, *Weiyi* Category.\n\n---\n\n**The Rite of the Orthodox Unity’s Pestilence-Warding Lamp of the Wenchang Bureau**\n\nThe ritual proceeds according to form.\n\nWe humbly observe: when primal chaos first divided, qi and form were distinguished. Nüwa severed the turtle to establish the axis; Yi and Qi observed the celestial patterns to bestow the seasons. The Three Powers were apportioned into three, the Five Phases disseminated into five. Thus, qi divided into seventy-two seasonal nodes, and the year was fixed at three hundred and sixty days. Through transformation, the spirits and gods act; through subtlety, yin and yang govern cold and heat.\n\nHeaven hangs its signs, and fortune or misfortune becomes visible. Humankind receives its nature, and blessings or calamities arrive of their own accord. Thus, the wellspring of blessings flows to families that accumulate goodness, while disaster and fault inevitably approach those who do evil. Fortunately, there exists the path of prayer and supplication, and the gate of expedient means stands open.\n\nNow, the faithful devotee [Name], dwelling beneath the canopy of heaven and earth, abiding under the shelter of the Dao, rectifies the mind and sincerely offers reverence to Heaven and the gods. Establishing the numinous altar, they perform the pure jiao offering. Incense smoke drifts in ethereal clouds; lamp flames blaze like stars in the azure vault. The jade terrace grows cold beneath the moon, and immortal robes fade into the distance; the azure firmament is swept by clear winds, and cloud-borne chariots soar.\n\nPerceiving this earnest offering of vegetarian repast, may the gods deign to descend in solemn regard.\n\nWe humbly pray that luminous virtue be abundantly bestowed, and vast grace poured down, augmenting future blessings and dispelling past transgressions. May myriad fortunes converge, all demons be vanquished, and no harm or disaster befall, granting ease and peace. May golden script record an imperishable name, and the azure tablets inscribe the method of extended life. We further implore your protection, offering utmost reverence.\n\nBowing in homage, we take refuge in the Boundless Dao.\n\nWe, the assembled, with sincere devotion, take refuge in and offer our lives to the Eastern Plague-Commanding Marshal Zhang.\n\nWe humbly observe: above the Great Void, among the honored of the heavens, the nine-colored radiance arises naturally, unassisted by the illumination of the Three Luminaries. From the sun, moon, and stars above to the seas, mountains, and rivers below, all who incline their hearts to serve the Emperor fulfill the rites of vassalage. Palaces and chambers, halls and pavilions—some are wrought of treasures, others formed of clouds and mist. Vast and indistinct, they are the courts of the insubstantial; pure and boundless, they are the halls of luminous communion.\n\nOn days of fasting, the host of spirits gathers. Winds arise, and the purple heavens resound; incense smoke ascends, and the clear breeze forms talismanic script. Countless immortals, the thirty-two Perfected Lords—none fail to assemble at the Jade Capital and ascend to the Golden Portals.\n\nNow, the faithful devotee [Name]’s silver lamps blaze brilliantly, and sandalwood incense wafts in curling clouds. We earnestly pray for your descent and reverently offer this hymn of praise:\n\nArrayed in silver lamps, they transform into jeweled canopies.\nResplendent with radiance, like falling stars they descend.\nThe celestial retinue of the Nine Heavens lingers in descent,\nEnveloped in five-colored auspicious clouds and misty vapors.\nCommand the Three Officials to dispel calamities,\nThat epidemics and pestilence may all be healed.\nThe Wenchang Bureau and its retinue drive away evil and expel demons.\nBestow blessings, avert disaster—we offer reverence without cease.\n\nWe, the assembled, with sincere devotion, take refuge in and offer our lives to the Southern Plague-Commanding Marshal Tian.\n\nWe humbly observe: the August Thearch, in hidden virtue, watches over the people, and thus commands the divine host of the Pestilence Bureau to apportion Heaven’s decrees of fortune and misfortune. Those who accumulate goodness enjoy abundant blessings and may dwell in peace; those who accumulate evil suffer lingering calamities and cannot escape reproof.\n\nThe Sage of the Wenchang Bureau wields mighty authority. The Marshal of the Primordial Heaven holds great power and exalted office. In the days when King Wu governed the world, it was the time when the Perfected One of Mount Kuang attained the Dao. Riding the wind upon qi, who could pursue his immortal chariot? In secluded valleys and deep ravines, his divine traces remain visible today.\n\nHis honorific title is \"Harmonizer of Pestilence\"; his sacred mandate is \"Serene Clarity.\" Though pestilence arises from the great Dao, it is summoned by human action. Yet the scrutiny of the gods adheres to virtue alone.\n\nNow, the faithful devotee [Name] offers incense like drifting clouds and arranges lamps in the pattern of the stars. We earnestly pray for your descent and reverently offer this hymn of praise:\n\nWe look up to invoke the Five Pestilence Lords, the august and sacred emperors.\nMay they turn their keen perception and broadly bestow saving grace.\nMarshal of the Primordial Heaven, extend your favor to all.\nYour mighty spirits to left and right suffer no obstruction.\nMaster of Mount Kuang, harmonize pestilence and repel plague.\nWithdraw pestilence, gather toxins—blessings extend to descendants.\nEnvision your cloud-borne chariot descending to the altar’s precincts.\nProtect and shelter this household, that they may forever rely on your divine refuge.\n\nWe, the assembled, with sincere devotion, take refuge in and offer our lives to the Western Plague-Commanding Marshal Zhao.\n\nWe humbly observe: the great furnace of creation, in its impartiality, covers and shelters all; the open net of governance watches over humanity, and good and evil receive their due recompense. The warnings of vigilance and introspection, the solemn texts of reverent devotion—these are transmitted in the *Yi* of Fuxi and recorded in the *Book of Zhou*. Fortune and misfortune lie within ourselves; blessings and calamities have no fixed gate.\n\nThose whose years are not prolonged suffer for their past transgressions; those who inherit lingering misfortune do not endure Heaven’s cruelty. If one can repent of wrongdoing, a hundred blessings will naturally arrive; if one does not reform, the six extremes will inevitably follow.\n\nThus, there exists the Pestilence Bureau to uphold Heaven’s mandate.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1087,
      "start_sentence": 0,
      "end_sentence": 75,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.742894887924194,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\正一殟司辟毒神灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "一纪之中，令年王而行赏罚； 五方之内，假将军以秉威权。 力梵魔王，辅圣每彰於猛烈； 张康太保，随神常显於灵通。 愿藏雷电之威，乞赐禧祥之祉。 以今信士某是以灯开菡萏，香喷狻猊。 惟愿降临，谨当赞咏： 力魔梵王，曲垂大造。 太保张康，尊安庙貌。 十二年王，尊帝所告。 五方使者，除凶去暴。 正直聪明，褒忠佑孝。 广变清凉，思归覆焘。 臣众等志心归命，北方行瘟史使者。 伏以皇天无亲，大道不器，其功可以妙万物，其明可以照四方。 延福延生，俱有修禳之法； 若男若女，咸蒙覆焘之恩。 惟命殟司，下临凡世，行病则有鬼王之猛烈，发汗则有使者之神通。 以祸福化人，以灾祥降世。 常善救物，岂非恶害之心； 无量度人，乃有好生之德。 以致阴阳消息，寒暑往来，十二律之无私，四六气之有准，瘟分三十六种，候列七十二神。 心萌善，则灾消； 意造非，而祸至。 倘伸夤奉，必赐康和。 以今信士某是以香飘馥郁，灯布荧煌。 惟愿降临，谨当赞咏：",
      "translated_text": "Within a twelve-year cycle, the Year Sovereign metes out rewards and punishments; across the five directions, generals are empowered to wield authority. The mighty Fànmó King aids the sagely with fierce might; the divine Tàibǎo Zhāng Kāng ever manifests in wondrous efficacy. May the thunderous might of lightning and storm be concealed, and blessings of felicity be bestowed.\n\nThus does the faithful devotee [Name] now kindle lotus lamps and burn incense whose fragrance fills the lion-thrones. Earnestly we pray for your descent, and reverently chant in praise:\n\nMighty Fànmó King, incline to the great work of creation.\nTàibǎo Zhāng Kāng, may your temple’s visage be honored and serene.\nThe Twelve Year Sovereigns, exalted by the Emperor’s decree.\nThe Envoys of the Five Directions, who expel violence and banish evil.\nUpright and discerning, they commend loyalty and shelter filial piety.\nVast in transformation, cool and clear, they long to shelter and embrace all.\n\nWe, your servants, with devoted hearts submit our lives to the Northern Pestilence Envoy, Shǐ the Messenger.\n\nWe humbly observe: august Heaven shows no partiality, the great Dao does not cling to form. Its power subtly perfects the myriad things; its radiance illumines the four quarters. To prolong fortune and life, there exist rites of exorcism; whether man or woman, all receive the grace of its sheltering embrace. The Pestilence Bureau, descending to the mortal realm, dispatches disease with the ferocity of ghostly kings and induces sweat through the divine efficacy of its envoys. Through fortune and misfortune it transforms humanity; through calamity and blessing it descends upon the world. Ever good at saving beings, it harbors no intent to harm; boundless in delivering people, it possesses the virtue of cherishing life. Thus do yin and yang wax and wane, cold and heat alternate; the twelve pitch-standards remain impartial, the four seasons and six qi follow their measure. Pestilence divides into thirty-six kinds, while seventy-two spirits array the signs. When the heart sprouts goodness, disaster dissipates; when the mind contrives wrong, calamity arrives. Should we offer reverent devotion, health and harmony will surely be granted.\n\nThus does the faithful devotee [Name] now scatter fragrant incense and array glowing lamps. Earnestly we pray for your descent, and reverently chant in praise.",
      "overlap_context": " the *Yi* of Fuxi and recorded in the *Book of Zhou*. Fortune and misfortune lie within ourselves; blessings and calamities have no fixed gate.\n\nThose whose years are not prolonged suffer for their past transgressions; those who inherit lingering misfortune do not endure Heaven’s cruelty. If one can repent of wrongdoing, a hundred blessings will naturally arrive; if one does not reform, the six extremes will inevitably follow.\n\nThus, there exists the Pestilence Bureau to uphold Heaven’s mandate.",
      "start_char": 1087,
      "end_char": 1477,
      "start_sentence": 76,
      "end_sentence": 102,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.830103635787964,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\正一殟司辟毒神灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "三十六旬，主张气候。 二十四神，门差刻漏。 七十二神，时行所受。 十二律吕，黄钟太簇。 皂纛锋刀，长牙巨兽。 天之命令，生灵是佑。 慈造回颜，神威息咎。 保佑一家，康宁富寿。 臣众等志心归命，中央行瘟锺使者。 伏以先圣所制，亘古流传，必须显迹於神通，然后随方而祭祀。 据坛祠而遵天命，居境域以显威灵。 旨酒佳郩，列杯柈而丰洁； 朱甍碧瓦，设堂殿以深严。 或道教之真仙，或释门之大士，或往古之英烈，或上世之贤良，或画绘以作容仪； 或埏土而成相貌，享一方之供献，纳千里之瞻依。 以今信士某是以绛蜡摇红，紫檀凝雾，人皆钦仰，士庶归依。 法众虔诚，谨当赞咏： 郡邑灵神，人之主宰。 社令城隍，血食千载。 祠庙灵祇，名彰英彩。 亘古名贤，周游四海。 一方祭祀，岂容有改。 愿回洞鉴，来临爽恺。 保佑一家，永无惊骇。 讽经　宣疏　化财　回向 正一殟司辟毒神灯仪竟",
      "translated_text": "The thirty-six ten-day periods govern the seasons’ qi,\nThe twenty-four spirits oversee the gates’ clepsydra divisions.\nThe seventy-two spirits receive their mandate in due time,\nThe twelve pitch-standards—Yellow Bell and Great Budding foremost.\n\nBlack banners, flashing blades, fangs long and beasts immense:\nThese are Heaven’s decrees, the protection of all living beings.\nCompassion turns the countenance, divine might stills transgression.\nGuard and bless this household with health, peace, prosperity, and longevity.\n\nWe, your devoted servants, now wholeheartedly submit our lives,\nTo the Central Plague-Quelling Envoy, Master of Pestilence.\n\nThus has it been since the sages of old first established the rites,\nTransmitted through unbroken ages, manifesting divine power,\nThen spreading worship to every region.\nErecting altars and shrines in obedience to Heaven’s command,\nDwelling within the land’s bounds to display majestic might.\n\nFine wine and choice offerings arrayed in cups and platters, rich and pure;\nCrimson eaves and jade-green tiles adorn halls and palaces, solemn and grand.\nSome are Daoist immortals, some great bodhisattvas of the Buddhist gate,\nSome heroes of antiquity, some worthies of ages past.\nSome are rendered in painted likeness, some shaped from clay;\nReceiving offerings from one region, drawing reverence from a thousand leagues.\n\nNow the faithful devotee [Name] kindles crimson candles, their glow undimmed,\nBurns purple sandalwood, its fragrance lingering like mist.\nAll people gaze in awe, scholars and commoners alike turn in devotion.\nThe assembly, with utmost sincerity, reverently chants in praise:\n\nSpirits of prefectures and towns, lords of humanity,\nEarth gods and city gods, receiving blood sacrifices for a thousand years.\nDivine beings of temples and shrines, their fame resplendent,\nWorthies of ages past, traversing the four seas.\nThe rites of this land endure unchanged.\nMay your penetrating gaze descend in joyful presence,\nGuard and bless this household, that it may forever know no terror.\n\nRecitation of scriptures, proclamation of petitions,\nOffering of paper money, dedication of merit—\nThe Rite of the Orthodox Unity’s Pestilence-Dispelling, Toxin-Averting Spirit Lamp is now complete.",
      "overlap_context": "dards remain impartial, the four seasons and six qi follow their measure. Pestilence divides into thirty-six kinds, while seventy-two spirits array the signs. When the heart sprouts goodness, disaster dissipates; when the mind contrives wrong, calamity arrives. Should we offer reverent devotion, health and harmony will surely be granted.\n\nThus does the faithful devotee [Name] now scatter fragrant incense and array glowing lamps. Earnestly we pray for your descent, and reverently chant in praise.",
      "start_char": 1477,
      "end_char": 1845,
      "start_sentence": 103,
      "end_sentence": 128,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.723854064941406,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\正一殟司辟毒神灯仪.txt",
        "category": "威仪类"
      }
    }
  ]
}