{
  "source_id": "汉武帝外传",
  "source_file": "chunked_daozang\\汉武帝外传.json",
  "total_chunks": 10,
  "total_original_chars": 7707,
  "total_translated_chars": 45474,
  "total_translation_time": 223.38297629356384,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝外传.txt",
    "category": "记传类"
  },
  "full_translation": "**The Outer Records of Emperor Wu of Han**\n\n*Category: Biographical and Narrative Works of the Dongzhen Section*\n*Title: The Outer Records of Emperor Wu of Han*\n*One fascicle.*\n*Source text: \"Daoist Canon of the Zhengtong Era,\" Dongzhen Section, Biographical and Narrative Works.*\n\n---\n\nAfter Emperor Wu heard the Queen Mother of the West’s words, he learned that within the vast seas of the eight directions lay the Ten Isles—places untouched by human footsteps. He then realized that Dongfang Shuo was no ordinary mortal. Thus, he summoned him to a secluded chamber and personally inquired about the locations of the Ten Isles and the names of their treasures, which the Emperor recorded.\n\nDongfang Shuo replied: \"Your servant is merely a student of immortality, not one who has attained the Dao. Given the splendor of the imperial court, which summons Confucians and Mohists within the bounds of proper governance while suppressing the Way of the reclusive in favor of empty and strange practices, I concealed my eremitic nature to attend the royal court, hiding my arts of nurturing life to serve the vermilion gates. This was also because Your Majesty favors the Dao and sought to temper the display of imperial majesty.\n\nI once followed my master on his travels, journeying north to Crimson Mound, Fusang, the Clam Sea, the Hills of Dark Night, the Pure Yang Tumulus, beneath the Azure Beginning, and the Abyss of the Moon Palace. I wandered within the Seven Mounds, circled the Ten Zhe Rivers, trod the Red Continent and roamed the Five Peaks, traversed marshes and rested upon renowned mountains. From my youth until now, I have traversed the Six Heavens, and the celestial radiance I have witnessed culminates in these places. Yet I am not like the transcendent beings who soar through the void, the flying immortals of the celestial bureaus, who ascend and descend the Nine Heavens, gazing upon all directions. They roam north to the Pole Star and the Celestial Enclosure, where the Canopy of Hua shines; they soar south to the Great Xia, dwelling in the Cinnabar Dawn. To the east, they reach the Radiant Yang Clouds; to the west, they approach the Frigid Caverns. These are realms beyond the reach of sun and moon, untouched by the Silver River. Above, there is nothing more; below, there is no foundation. How could my humble knowledge compare? I am ashamed that it does not suffice to answer Your Majesty’s broad inquiries.\"\n\nDuring Emperor Wu’s imperial tour, as he passed through Hejian, a purple-blue *qi* rose from the earth and connected with the heavens. The court diviners who observed the omens declared that beneath it must reside an extraordinary woman. The Son of Heaven paid her homage, and the Emperor dispatched envoys to seek her out. They found a woman in an empty pavilion, her beauty unparalleled, both hands clenched into fists. The Emperor ordered her to open her hands, but no matter how many times they were pried apart, they would not unfurl. The Emperor then personally spread her fingers, and they immediately extended. From then on, she received his favor and was titled Lady Fist. Later, she was promoted to Swift Consort and resided in the Gouyi Palace. Skilled in the arts of the Plain Girl, she enjoyed great favor.\n\nAfter fourteen months of pregnancy, she gave birth, and the child was Emperor Zhao. The Emperor remarked: \"In ancient times, Emperor Yao was born after fourteen months—now Lady Gouyi is the same.\" Thus, he named her gate the \"Gate of Yao’s Mother.\"\n\nLater, when the Emperor reached Ganquan Palace, he favored her again. She told him: \"By my fate, I was destined to bear Your Majesty a son. When the boy turns seven, I shall die. This year, I will not return. I pray Your Majesty take care of yourself.\" As her words ended, she suddenly passed away. After her burial, her body vanished, and a fragrance lingered for over ten *li*.\n\nThus, she was buried at Yunling. The Emperor grieved deeply and, suspecting she was no ordinary person, had her tomb opened for inspection. The coffin was empty, with no corpse—only her garments and shoes remained. He then erected the Tongling Terrace at Ganquan. Often, dark crows gathered and came and went upon the terrace, ceasing only in the reign of Emperor Xuan.\n\nWhen Emperor Wu ascended Mount Tai to perform the feng and shan sacrifices, among the Daoist practitioners of Mount Tai was one known as Master Jiqiu, whom those who recognized him claimed had lived a hundred years yet appeared ever younger. On the day of the feng sacrifice, as the Emperor prepared to ascend the mountain, Master Jiqiu donned a *zhangfu* cap, wore yellow robes, and came forth bearing a zither to greet him, saying: \"Do not lightly ascend the mountain, for you will surely injure your foot.\" The Emperor did not heed his words. After traveling several *li*, a stone snapped his toe, forcing him to halt. He performed the sacrifices and returned.\n\nThe Prince of Huainan was fond of learning and the arts, collecting Daoist texts from across the realm and summoning masters of esoteric techniques. All cultivated *qi* and could summon clouds and rain. The common folk spread tales that the prince could summon immortals to keep him company, transforming at will—now a youth, now an elder. The prince himself could conceal his form and fly, subsisting on *qi* without eating. The Emperor, hearing of this, admired his feats and wished to learn his Way. The prince refused to teach him, claiming no such arts existed. Enraged, the Emperor prepared to execute the Prince of Huainan. The prince, learning of this, issued orders to his ministers and vanished, his whereabouts unknown. The people of his state all spoke of him as a divine immortal, and some claimed to have seen him. Fearing unrest among the people, the Emperor ordered the execution of the prince’s household and displayed their heads to pacify the masses, declaring them those of the Prince of Huainan. He confiscated the prince’s esoteric texts, gaining some knowledge of alchemical arts, though not their essential methods. Trials of these techniques often proved ineffective.\n\nHaving been moved by the Way of Huainan, the Emperor summoned masters of esoteric arts from all directions—thousands emerged from Yan and Qi alone. Among them was Li Shaofang of Qi, who at two hundred years of age bore the complexion of a child. He crafted various elixirs, all of which proved efficacious. The Emperor trusted him deeply, appointing him General of Literary Accomplishment and treating him with the courtesy due a guest.\n\nWithin the Palace of Sweet Springs, he commissioned murals of the Supreme One and various deities to be worshipped. Shaoweng claimed: \"First summon the Supreme One, then one may ascend to heaven; only after ascending to heaven may one reach Penglai.\" Yet after more than a year, no sign appeared, and the Emperor grew weary. Shaogong then employed methods to summon ghosts and spirits, all of which proved effective—save for the rites to the Supreme One, which after years yielded no response. The Emperor, impatient and severe by nature, was deeply perplexed, while Shaoweng grew ever more arrogant. Enraged, the Emperor had him executed.\n\nA month after Wencheng’s execution, an envoy returning from the eastern passes with tribute encountered him at the Cao Pavilion. Wencheng said to the envoy: \"Convey my regrets to the Emperor: could he not endure a few more days and thus ruin great matters? Let him take care henceforth. Forty years from now, seek me on Mount Laocheng, and we shall serve together without resentment.\" The envoy returned and reported this in full. The Emperor ordered the coffin opened, but nothing was found inside—only a single bamboo mat. Suspecting Wencheng’s disciples had stolen and concealed his body, he had them arrested and interrogated, yet no trace could be found. The Emperor deeply regretted the execution.\n\nHe once more summoned masters of esoteric arts and resumed the rites to the Supreme One at Sweet Springs. Additionally, he set up a separate altar to worship Wencheng, performing the rites himself. At that time, Dong Commandery presented a dwarf, five inches tall, fully clad in robes and cap. The Emperor suspected it was a mountain spirit. He placed it upon a table and summoned Dongfang Shuo. Shuo arrived and addressed the dwarf: \"Great Spirit, why have you suddenly rebelled and come here? Has your mother not yet returned?\" The dwarf made no reply, whereupon Shuo pointed and said to the Emperor: \"The Queen Mother of the West plants peach trees that bear fruit once every three thousand years. This wretched child has stolen from them three times, displeasing the Queen Mother, and so has been banished here.\"\n\nThe Emperor was greatly astonished, all the more convinced that Shuo was no mortal. The dwarf then said to the Emperor: \"The Queen Mother has sent me to inform Your Majesty that the method of seeking the Dao lies solely in purity and stillness—restlessness is unsuited to it. Five years hence, she shall meet with you.\" With these words, the dwarf vanished.\n\nThe Emperor grew ever more vexed and again summoned Dongfang Shuo to question him. Shuo replied: \"Your Majesty ought to know this yourself; I dare not speak of it.\" In the end, he remained silent. The Emperor, recognizing his numinous nature, dared not press him further.\n\nA man of Qi, Gongsun Qing, said to Suo Zhong: \"I possess esoteric writings from my teacher concerning the matter of the sacred tripods. I wish to present them through you. If I am granted an audience, I shall offer a jade ram as a gift.\" Suo Zhong agreed, but upon examining the text, he harbored doubts and declined, saying: \"The affair of the treasure tripods has already been settled; there is nothing more to be said.\"\n\nGongsun Qing then had it memorialized through the eunuch Ping. The document stated: \"When the Yellow Emperor obtained the sacred tripod, he inquired of Guiyu Qu, who replied: 'The Emperor has gained the tripod and its divine radiance, prolonging his years.' On the first day of the ji-you year, at dawn on the winter solstice, he attained the celestial reckoning, marking the end and the beginning anew. Thereupon, the Emperor tracked the sun’s course and calculated the cycles—after twenty reckonings, totaling one hundred and eighty years, the Yellow Emperor ascended to immortality in the heavens. This year, the winter solstice coincides with the first day of the month, aligning with the time of the Yellow Emperor. Your servant, at risk of death, ventures to memorialize this.\"\n\nEmperor Wu was greatly pleased and summoned Qing to question him.\n\nQing replied: \"I received this text from Master Shen, who has since died, his body dissolved in transcendence.\"\n\nThe Emperor asked: \"Who was Master Shen?\"\n\nQing answered: \"Anqi Xiansheng of Qi, who together with me received the teachings of the Yellow Emperor and this text on the sacred tripod. Master Shen often told me: 'The sage of Han lies among the great-grandsons of Gaozu. When the sacred tripod emerges and communicates with the divine, when the Feng and Shan sacrifices ascend Mount Tai, only the Yellow Emperor and the Lord of Han shall achieve this. When the Feng sacrifice is performed atop the mountain, one may then ascend to heaven. The Yellow Emperor waged war against the hundred ghosts and studied immortality, and only after more than a hundred years did he attain communion with the divine. The Yellow Emperor offered sacrifices to the Supreme Lord at the suburban altar of Yong, fasting in seclusion for three months. Guiyu’s body dissolved in transcendence and departed, whereupon he was buried at Yong. Yong—now the great tomb of Hong is its successor. The Yellow Emperor summoned the ten thousand spirits in the Hall of Light—this is Gansui. The Gate of Cold through which he ascended to immortality—this is Gukou. The Yellow Emperor mined copper from Mount Shou and cast the tripod at Mount Ke. When the tripod was completed, a dragon descended, its whiskers hanging down, to welcome the Emperor onto its back. Over seventy of his ministers and palace ladies followed him onto the dragon, but lesser attendants could not ascend. They grasped the dragon’s whiskers, which tore away, and the Emperor’s bow fell. The people gazed up as the Yellow Emperor ascended to heaven, clutching his bow and the dragon’s whiskers, weeping. Thus, later generations named his tomb Dinghu, and his bow Wuhao.\"\n\nThereupon, Emperor Wu sighed: \"Alas! If I could but reach the Yellow Emperor’s attainment, I would cast aside the world as dust.\"\n\nThe Emperor then sacrificed at the Yellow Emperor’s tomb on Mount Qiao. Turning to Gongsun Qing, he asked: \"The Yellow Emperor became an immortal yet did not die—why then does he have a tomb?\"\n\nQing replied: \"When the Yellow Emperor ascended as an immortal, his ministers longed for him endlessly. Thus, they buried his robes and cap—it is not a true tomb.\"\n\nEmperor Wu sighed again: \"When I ascend to heaven hereafter, will my ministers also long for me, holding my robes and cap to bury them at Dongling?\"\n\nLu Nüsheng was a native of Changle. From youth, she cultivated the Dao, first consuming sesame and water, abstaining from grains for over eighty years. Day by day, she grew younger and more radiant, her complexion like peach blossoms. In a single day, she could travel three hundred *li*, running as swiftly as a deer. The world has transmitted accounts of her for over three hundred years.\"\n\nLater, she gathered herbs on Mount Songgao when she suddenly saw a woman sitting in a mountain stream. Knowing she was a divine being, Nüsheng knelt, bowed twice, and kowtowed, begging for the essentials of longevity. After a long while, the woman said: \"I am an attendant official of the Supreme One of the Three Heavens. You are destined for immortality, which is why you may see me. I shall now transmit to you the secret essentials of the *Precious Writ*, with which you may command the Five Peaks and dispatch the multitude of spirits.\" Thereupon she produced the *True Forms of the Five Peaks Chart* and gave it to her, along with instructions on its application and regulations. Nüsheng achieved the Dao, and one day she bid farewell to her kin and acquaintances, saying she was entering Mount Hua. Fifty years later, those who had known her before encountered her before the shrine of Mount Hua—her complexion had grown even younger. She rode a white deer, accompanied by thirty jade maidens, and sent clear greetings to her hometown kin and acquaintances.\n\nIs the *Chart of the Five Peaks* identical to the *Writ of the Queen Mother*? Those seen in the world today—could they not have descended from Li Shaojun, Dong Zhongshu, and Nüsheng? Before his departure, Zhongshu transmitted it to Yue Ba; initially, Nüsheng transmitted the chart to Ji Zixun, who later passed it to Feng Junda. Before entering Dark Mound Mountain, Junda transmitted it to Zuo Yuanfang. Feng Junda was a native of Longxi. From youth, he cultivated the Dao, first consuming *huanglian* for over fifty years, then entering Wushu Mountain. There, he refined mercury for over a hundred years before returning to his hometown, his age appearing no more than thirty. He often rode a black ox, hence his sobriquet, the Black Ox Daoist. Whenever he heard of someone gravely ill or near death—whether he knew them or not—he would offer medicine from the bamboo tube at his waist. Sometimes he would administer acupuncture, and all recovered at his touch. Many in the world benefited from his efficacy, yet he never revealed his surname or given name. People only recognized him by his black ox, so they called him by that name.\n\nHearing that Nüsheng had obtained the *True Forms of the Five Peaks* from a perfected one, he sought it from her for years. Later, she granted it to him and fully instructed him in its regulations. Junda had already lived among people for over two hundred years before entering Dark Mound Mountain, after which his whereabouts became unknown. Before departing, he transmitted the *True Forms of the Five Peaks* to Zuo Yuanfang, who in turn passed it to Ge Xiaoxian.\n\nThe Black Ox Daoist received Nüsheng’s words: \"In the household possessing the *True Forms of the Five Peaks*, each peak dispatches five spirits to guard and protect the charts and writings. For those dwelling near mountains and rivers, the river and marsh spirits also send attendant officials to safeguard one’s person and household. If malevolent forces seek to harm you, they will instead suffer calamity. If conspirators plot against you, the five spirits will slay the instigator—all verified in dreams. Moreover, it averts the five pestilences of the five directions, as well as disasters of water and fire. One may tread upon blades unharmed. When the true forms are inwardly contemplated with utmost reverence—honoring them even more than one’s lord or father—every action should begin in a quiet place by burning incense and invoking the Lords of the Five Peaks. The Five Lords constantly record the Daoist’s virtuous deeds and also oversee their transgressions and impurities, as well as the unrighteousness of others. The unrighteous bring ruin upon themselves; the impure bring ruin upon their households. Thus, one must deeply guard against and be cautious of these.\n\nWhen a Daoist carries this chart or holds it while traversing mountains and forests, the spirit-lords of all mountains and earthly sources emerge from their domains to bow in welcome, manifesting in radiant forms to guard, repel evil, and honor the sacred peaks. The reverence due to the peak-forms extends even to my person—ghosts and spirits still perform the rites of humble submission, so how could ordinary people dare treat them with disrespect?\"\n\nLi Shaojun, styled Yunyi, was a native of Linzi in Qi. From youth, he loved the Dao, entering Mount Tai to gather herbs and practicing grain abstention and reclusion to preserve his body. Before achieving the Dao, he fell gravely ill in the mountains. Master Anqi happened to pass by and, seeing Shaojun, struck his head and begged for life. Moved by his sincerity and pitying his illness, which would have led to death, Anqi gave him a spoonful of *Divine Tower Powder*. Shaojun immediately rose. Thereafter, he sought to follow Anqi as a servant and disciple. Anqi accepted and took him east to Red City, south to Luofu, north to Great Heng, and west to Jade Gate, roaming the Five Peaks and observing rivers and mountains for several decades.\n\nOne day, Anqi told him: \"I have been summoned by the Dark Continent and must depart today. You should not follow me there yet. We shall part here. Six hundred years from now, I will welcome you at this place.\" He then transmitted the methods of divine elixirs, furnace fires, and flying mysteries, along with sworn oral instructions. In an instant, Anqi mounted a dragon-tiger, leading hundreds of attendants to welcome him. Anqi ascended to heaven in a feathered carriage.\n\nShaojun then returned to purify himself, selling goods in markets and trading across the six states. At times, he served as an official; at others, he practiced medicine or rented out his skills. He changed his surname and given name, traveling in places where none knew he possessed the Dao. By the time of Emperor Wu of Han, hearing the emperor recruited fangshi and revered Daoist arts, yet lacking the means to compound great elixirs, he sighed deeply and said to his disciples: \"Old age approaches, death draws near, yet my resources are insufficient. If I till the land, labor, or trade for money, I will never succeed in compounding the elixir. Moreover, I am clumsy in such matters. I have heard the Son of Heaven loves the Dao and wish to see him, requesting to compound the cinnabar. If granted free rein, no desire will be unfulfilled. If the emperor’s intentions align, he will succeed; if not, I shall depart. I have lived in the world for over five hundred years yet have not gained even temporary power—surely I cannot escape becoming food for worms and ants.\"\n\nThus, he presented his arts to Emperor Wu, saying: \"Your servant can congeal mercury into white silver, transmute cinnabar into flying elixir, and refine it into yellow gold. Consuming the gold grants ascent to heaven in broad daylight, endless immortality, the body sprouting crimson feathers of the sun, and wings of radiant light. Refined, one soars through the heavens; at rest, one enters the unseen. Riding flying dragons, the eight distant realms are traversed; driving white swans, the nine expanses are swiftly circumnavigated. The jujubes of the Dark Sea grow as large as gourds; the plums of Bell Mountain swell like jars. Your servant has already consumed them. Moreover, my former teacher, Master Anqi, transmitted oral instructions to me, ensuring the success of these yellow substances.\"\n\nUpon this, Emperor Wu summoned him for an audience, showing him the utmost reverence and bestowing upon him countless gifts, even constructing a residence for him. The Emperor believed that he could surely enable him to transcend the mortal world. On one occasion, Shaojun attended a feast hosted by the Marquis of Wu’an, where an elderly man of over ninety sat among the guests. Shaojun remarked that he had once hunted with the old man’s grandfather, and the old man, recalling his childhood, confirmed that he had indeed accompanied his grandfather and recognized Shaojun. The entire assembly was astonished. Shaojun then noticed an ancient bronze vessel in Emperor Wu’s possession; upon gazing at it, he identified it, saying, \"This was once displayed in the Wuqin Chamber by Duke Huan of Qi.\" The Emperor verified the inscription, and indeed, it was a relic of Duke Huan of Qi. Thus, it became clear that Shaojun was a man of several hundred years. Yet, he appeared no older than fifty, his complexion radiant, his skin smooth and lustrous, his brows, eyes, mouth, and teeth resembling those of a fifteen-year-old boy. When the feudal lords and nobles heard of his ability to grant immortality and restore youth to the aged, they sent him endless gifts of gold and money.\n\nShaojun secretly prepared an elixir of immortality, but before he could consume it, he approached the Emperor to request the *Five Emperors and Six Jia Spirit Flight Manuals*, comprising twelve scrolls in total. In the seventh month of the fourth year of the Yuanfeng era, the Emperor granted him these texts. By the ninth month of the sixth year of Yuanfeng, Shaojun claimed illness and submitted a memorial, stating: \"Your Majesty’s thoughts are profound and wondrous, earnestly seeking longevity. Thus, you have summoned and attracted Daoist arts from afar, and none have failed to arrive. Truly, the spirits of heaven have descended in response. Yet, if one’s fate is not predestined, who could achieve harmony? However, the alchemical formulas are of grave importance, and one must abstain from the foul and the impure. The Dao of immortality nurtures all things, its benevolence extending even to the lowliest creatures. Yet Your Majesty cannot forsake extravagance, distance yourself from sensual pleasures, cease warfare, or temper your wrath. Across ten thousand li, souls remain unreturned; in the markets and courts, blood still flows. Under such conditions, the great elixir and the supreme Dao cannot be attained. Now, my illness grows with the years, and my feeble attempts at healing have failed. I have not been able to personally observe the fasts and purifications, nor witness the transformations of Pengzu’s cinnabar. Alas, this opportunity is lost. My former teacher, Master Anqi, once bestowed upon me a verified formula for the golden elixir. If one follows the regulations, upholds the precepts, and adheres to the prohibitions, only then may it be cultivated and employed. When the cinnabar smolders and the rainbow soars, when the ninefold cyclical transmutations of the mysterious and the vermilion unfold, when the Six-and-One is split and its essence flows to outshine the sun, when frost and snow are gathered and the moonlight is swept away by the wind—then, amidst the swirling crimson mists, the dragon and tiger seethe and boil. Lead and tin are cast in, and yellow gold is perfected; a knife-tip’s measure enters the throat, and the breath of decay is instantly reversed. Only then may one ride the divine rainbow to ascend, or drive the cloud chariot to traverse the distant realms. This formula’s divine efficacy will then be proven, and my humble words will be shown not to have been false.\"\n\nHe then presented the Emperor with a minor elixir formula, claiming his illness had worsened, though this was not the formula for the great elixir. That night, Emperor Wu dreamed that he and Shaojun ascended Mount Song together. Midway, an emissary in embroidered robes, riding a dragon and bearing a tally, descended from the clouds, announcing, \"The Great One summons Shaojun.\" The Emperor awoke and immediately dispatched messengers to inquire after Shaojun’s condition. He told his close ministers, \"As in my dream, Shaojun is about to leave me.\" The next day, Shaojun’s illness took a grave turn. The Emperor personally visited him and ordered his attendants to receive his alchemical texts, but before the transmission was complete, Shaojun passed away. The Emperor wept, saying, \"Shaojun is not dead; he has merely departed in this manner.\" After his body was encoffined, it suddenly vanished from the casket. Only his outer garments and belt remained, untied, as if he had shed them like a cicada’s molted husk. Thus, they buried his clothing and belongings. Over a hundred days later, travelers reported seeing Shaojun in the market of Puyi in Hedong, riding a blue-gray mule. Upon hearing this, the Emperor had the coffin opened. Inside, there was nothing left—even the nails remained undisturbed—save for a single pair of shoes. The Emperor was deeply remorseful, regretting that he had not pursued Shaojun’s teachings more diligently. The following year, a fire at Liang Terrace destroyed many of the secret and wondrous texts.\n\nEarlier, Shaojun had been close with the Gentleman-in-Attendance Dong Zhong. Seeing that Dong suffered from a chronic ailment, his body withered and his qi depleted, Shaojun gave him two doses of a completed medicine, along with a scroll detailing its formula. The ingredients included *wuji* grass, the essence of *houtu* (Earth’s fat), the marrow of the *gen* beast, the roots of *xianyou*, the nectar of a hundred flowers, and *longxian* grass. The elixir was to be prepared in the first ten days of the tenth month, decocted in a bronze cauldron, with boys and girls who had bathed and purified themselves regulating the fire. The medicine was to be formed into pellets the size of a parrot’s egg, with three taken per dose. After finishing the first dose, the body would feel lighter. After three doses, one’s teeth would fall out and regrow.\n\nAfter completing five doses, Dong’s life was no longer in peril. Dong was a man of unyielding integrity, deeply learned in the Five Classics, yet he did not comprehend the arts of the Dao. He often mocked those who took elixirs or pursued the Way, repeatedly memorializing Emperor Wu to admonish him, arguing that human life was governed by fate, and aging followed its natural course—neither could be prolonged by Daoist arts. Though he witnessed Shaojun’s extraordinary abilities, he dismissed them as innate traits, not the result of any technique. When he received the medicine, he refused to take it and did not inquire further about its formula, merely storing it away.\n\nMonths after Shaojun’s departure, Dong fell gravely ill. Emperor Wu, too, repeatedly recounted dreams of him, lamenting the loss. Only then did Dong recall the medicine Shaojun had given him. He took some as a trial and, before even finishing half a dose, found himself able to walk. His body grew light and robust, and his ailments vanished entirely. Once the medicine was exhausted, his strength returned to what it had been in his thirties. Convinced at last that the world held a path to immortality, he resigned his post and traveled in search of Daoist masters. Though he could not fully grasp the principles of the formula, his white hair turned black again, and his appearance flourished. He lived to over eighty before dying. On his deathbed, he told his son Daosheng: “I obtained Shaojun’s divine formula, yet I failed to believe in its power—my regret will follow me to the Yellow Springs. You must seek out those versed in the arts and ask them to explain it. If you take this medicine for long, you will surely transcend this world.”\n\nMoved by his father’s dying words, Daosheng refused to enter official service. Instead, he wandered the realm in search of someone who could decipher the formula. In Jiangxia, he encountered Master Boze, who said: “This is no divine elixir of gold or jade—it can only grant a few hundred years of life.” He then thoroughly explained the formula’s principles and the true names of its ingredients. Daosheng compounded the medicine and took it, living to the age of 370 before entering Jitou Mountain. It is unknown whether he ultimately attained the Dao.\n\nOthers who took the same medicine—Zhuo Yuancheng, Zhang Ziren, Wu Shisheng, Cai Zisheng, Wei Zhongming, and Zhang Yuanda—lived to three or five hundred years. None fell ill before death; their faces did not sag, their skin remained unwrinkled, their teeth did not fall out, their hair did not turn white, and their virility did not wane. If even this humble formula of Shaojun’s could achieve such effects, what might his superior elixirs have done?\n\nBefore his departure, Shaojun secretly transmitted the *Six Jia Left-and-Right Spirit-Flight Arts* and twelve other techniques to Shuai Guo Yan, while entrusting the *Divine Elixir of Flying Mystery* to his fellow townsman Ji Zixun. Both later studied the Dao and attained immortality. Shaojun also taught Zixun the *True Form of the Kunlun Divine Continent*.\n\nShuai Guo Yan, styled Gongyou, was a native of Shanyang. From youth, he was drawn to the Dao, and upon hearing of Li Shaojun’s mastery, he sought an audience, kowtowing and begging to serve as his attendant—handling his toiletries, sweeping, and other menial tasks. Shaojun granted his request. Observing Yan’s diligence and sincerity, he deemed him capable of success. As his departure neared, he secretly imparted the *Five Emperors’ Six Jia Left-and-Right Spirit-Flight Arts*, the *Twelve Methods of Roaming the Void and Summoning the True*, and said: “These, too, are essential arts of the Dao. Practice them carefully, and you may ascend to heaven.” After delivering the oral instructions, he sent Yan away.\n\nYan returned home and compounded the *Spirit-Flight Powder*, which enabled him to write at night. In his bedchamber, his body emitted a radiance that illuminated his surroundings. Practicing the *Six Jia Left-and-Right Arts*, he could divine the fortunes of the realm. Those destined to die—whether acquaintances or strangers—he knew in advance. He commanded ghosts and spirits, subdued tigers and leopards, and performed feats beyond measure. He lived in his hometown for four hundred years without aging. In the twenty-first year of *Jian’an* during the Han, one day dozens of men arrived riding tigers and leopards to welcome him. His neighbors all witnessed this. He bid farewell to his relatives and departed, saying he was bound for the Kunlun Terrace. Before leaving, he transmitted the *Divine Elixir Formula* and the *Five Emperors’ Spirit-Flight Secrets* to Master Yin.\n\nMaster Yin, whose given name was Gui and style name Gongdu, was a native of Taiyuan. In the first year of *Yuanxi* of the Jin, he entered Taihe Mountain in Nanyang and passed on the essential arts to his disciple Shan Shiyuan of Henei.\n\nEarlier, Yan had received Shaojun’s teachings and first transmitted the *Spirit-Flight Arts* to Ji Zixun, who also received the *Divine Elixir Canon*. Ji Liao, styled Zixun, was a native of Linzi in the Qi state and a townsman of Li Shaojun. In his youth, he served in local and provincial offices, was nominated as a *Filial and Incorrupt* candidate, and appointed Gentleman of the Palace. Later, he joined the military and was enfeoffed as Commandant of the Imperial Carriage.\n\nLater, Ji Zixun realized that managing worldly affairs and holding office brought no benefit to one’s lifespan. He then studied medicine and healing arts under Shaojun. Over time, he witnessed Shaojun’s attainment of the Dao of immortality. Thereupon, he served Shaojun with the reverence due a master. Shaojun, seeing Zixun’s wholehearted devotion and recognizing his potential for accomplishment, gradually revealed to him the affairs of the Daoist school. He taught him the methods of *embryonic breathing*, *embryonic ingestion*, *abiding in years*, and *halting whiteness*. After practicing these for over two hundred years, Zixun’s complexion remained youthful.\n\nIn his hometown, he conducted himself with sincerity and deference toward others. Fond of tranquility, he often secluded himself to study the *Book of Changes* and occasionally composed short essays, all imbued with meaning. Later, Shaojun also transmitted to Zixun the great arts of transformation of Master Wuchangzi. When applied, these arts invariably proved effective.\n\nOnce, he saw a neighbor holding a child and asked to hold it. His grip slipped, and the child fell to the ground and died. The family, who had always held him in high regard, dared not show grief and buried the child, saying it was not fated to live. Days passed, and they gradually ceased thinking of it. Zixun then returned from outside, carrying the child back to the family. The family, fearing it was a ghost, begged him not to trouble them further. Zixun said, “Take the child—it feels no pain. It is truly yours.” The child recognized its mother, laughing and reaching for her. The mother took the child, though still uncertain. After Zixun departed, the father returned and together they dug up the grave. In the coffin, they found only a clay figurine of a child, about six inches long. The child then grew to maturity.\n\nMoreover, when elderly people with entirely white hair sat with Zixun and conversed, by the next morning their hair would turn black—though he had done nothing to effect this. The blackening could be expected to last a year and two hundred days. There were also cases where he did not cause hair to turn black, for these were the greatest transformations of his divine arts.\n\nWhen the nobles of the capital heard of this, none failed to earnestly desire an audience with Zixun, yet none could secure his presence. Zixun had lived in the capital for some years when a young man from his neighborhood became a student at the Imperial Academy. The nobles summoned the student and said to him, “You toil over your studies in hopes of passing the examinations and attaining wealth and rank. If you can bring Ji Zixun to us, we will ensure your success without effort.” The student agreed and returned home to serve Zixun, sweeping and cleaning for him morning and evening, standing by his side in attendance. This continued for nearly two hundred days.\n\nZixun said to the student, “You are no Daoist practitioner—how can you endure this?” The student replied, “Though I am but a humble man from our village, the way of respect between elder and younger demands no less.” Zixun said, “Why feign sincerity when your motives are false? I know full well your intent: the nobles wish to see me. Why should I begrudge the effort of a single journey and deny you honor and position?” He then instructed the student, “Return and tell them I will come on such-and-such a day.”\n\nOverjoyed, the student went to the capital and relayed this to the nobles. On the appointed day, Zixun had not yet set out. The student’s parents grew anxious and went to check on their son. Zixun mocked them, “Do you fear I will not go? To keep your son’s word, I shall depart.” He left his residence at mealtime. The student’s parents said to each other, “Though Ji has not arrived on time, he is surely on his way.” The student returned home the next day and calculated the distance. Zixun had reached the capital by midday—impossible for an ordinary man to cover over a thousand *li* in half a day.\n\nUpon arrival, the student went to see Zixun. Zixun asked, “Who wishes to see me?” The student replied, “Many wish to see you, Master. I dare not trouble you, but if I may know your whereabouts, they will come to you.” Zixun said, “There is no need for them to come. I have traveled over a thousand *li*—why should I now haggle with them over such matters? Today, have each of them dismiss their guests. I will arrive at midday and choose where to go first.”\n\nThe student relayed this to the nobles, who each prepared their homes. At midday, Zixun visited twenty-three households, yet there were twenty-three Zixuns, each appearing at a different place. The nobles were all delighted, each believing Zixun had come to them first. The next day, when they compared notes, they found that at the same time, each had hosted a Zixun—identical in clothing and appearance, yet their conversations varied according to each host’s questions.\n\nEach household prepared wine and food to entertain Zixun, and he accepted their hospitality with full courtesy. The news spread far and wide, and the nobles all wished to visit him. Zixun said to the student, “They believe I must have extraordinary eyes and a radiant countenance, which is why they seek me. But I have nothing to teach. I will not go again.” With that, he departed.\n\nAs he left, the nobles’ carriages and retinues clogged the road. When they reached his door, the student said, “He just left, heading east. The one riding the blue mule is he.” They all galloped after him, but though they saw the mule ambling along, their horses could not catch up. After half a day’s pursuit, they remained about a *li* behind, unable to close the distance, and so they gave up and returned.\n\nZixun, being a fellow townsman and disciple of Shaojun, was discreet and meticulous, deeply pondering the profound mysteries of the Dao. Following and serving a master of illumination, he was on the verge of synthesizing the myriad wonders.\n\nWang Zhen, styled Shujian, was a native of Shangdang. In his youth, he served as a minor official in his commandery. At seventy, he took up the study of the Dao.\n\nSeeking out various immortal scriptures and miscellaneous writings, he came upon an account of the Woodcutter of the Suburbs, a man of the suburbs during the reign of King Xuan of Zhou. As he gathered firewood, he sang this song:\n\n*\"Wrap in golden cloth,\nEnter the Gate of Heaven,\nCall the Long Spirit,\nChant to the Dark Spring,\nDrum the Celestial Drum,\nNurture the Muddy Pellet.\"*\n\nNone of the people of his time could understand it, save the Archivist beneath the Pillars, who said: \"This is a man who dwells within the living kingdom; his words are profound and hidden.\" The woodcutter was in truth an ancient fisherman.\n\nHow is this known? One who has lived eight hundred years has square pupils; one who has lived a thousand years has pupils with vertical patterns. The woodcutter was a man of a thousand years.\n\nZhen read this passage but could not fathom its meaning. He searched far and wide among Daoist masters, and after a year, he encountered one who could explain it. The master said to him: \"This is but a shallow art, sufficient only to prolong life and restore youth.\" He then revealed the secret method:\n\n*\"Wrap in golden cloth\"* means to constantly guide the qi of the lungs into the Muddy Pellet, circulating it slowly around the body, so that the body remains radiant and lustrous.\n\n*\"Chant to the Dark Spring\"* means to rinse the mouth with saliva and swallow it, which prevents aging. Practicing this for seven days yields results.\n\n*\"Drum the Celestial Drum\"* means to tap the teeth thirty-six times each morning upon rising, which calms the spirits of the body.\n\nAt night, one must visualize a crimson qi entering through the Gate of Heaven, suffusing the body inside and out. Within the brain, it transforms into fire, refining the body until it shines with the same light as the fire. This visualization is called *\"refining the form.\"*\n\nThe Muddy Pellet is the brain; the Gate of Heaven is the mouth. Practicing breath-holding and swallowing is called *\"embryonic breathing.\"* Swishing the spring beneath the tongue and swallowing it is called *\"embryonic nourishment.\"* These practices must never cease.\n\nZhen received the method and diligently practiced embryonic breathing, embryonic nourishment, and the refinement of the form. The results were remarkable. He abstained from grains for over two hundred years, yet his complexion remained full and fair. He could walk at a leisurely pace and keep up with a galloping horse, and his strength equaled that of several men. He sighed and said: \"Though this art may keep me from death, how can it compare to the methods of divine elixirs, gold, and jade?\"\n\nHe then became a disciple of Ji Zixun, who taught him the *\"Prescriptions Behind the Elbow.\"* When Emperor Wu of Wei heard of him, he summoned Zhen for an audience. The emperor saw that he appeared no older than thirty and suspected deception. He verified his origins with his fellow townsmen, who all spoke with one voice—many had known Zhen since their youth. Convinced of his mastery of the Dao, the emperor held him in great esteem.\n\nBu Mengjie became Zhen’s disciple for over a decade. Zhen taught him the methods of steaming cinnabar and minor elixirs, enabling him to transcend the mortal world. His hometown reckoned that Zhen had lived four hundred years. One day, he ascended Mount Nüji with three young concubines and told his disciples he was going to compound the elixir. He never returned.\n\nZhen could walk three hundred *li* in a single day. Mengjie could sustain himself by holding a date pit in his mouth without eating, and after ten years, he could hold his breath without exhaling, remaining motionless like a corpse for a hundred days or even half a year. He also had a family. This method was the same as that practiced by the Woodcutter of the Suburbs.\n\nMengjie was a man of integrity, cautious and sparing with his words. Emperor Wu of Wei built him a thatched cottage and appointed him to oversee all masters of esoteric arts. During the reigns of Emperors Hui and Huai of Jin, there were still reports of Mengjie being seen in the markets of Chang’an.\n\nEmperor Wu of Wei was also diligent in seeking out masters of esoteric arts and Daoist practitioners, receiving them with an open mind. Yet none of those who had attained the Dao were willing to reveal their essential teachings.\n\nLiu Jing, styled Taixuan, was a native of Nanyang and had served as a Gentleman-in-Attendance to Emperor Wen of Han. Later, he abandoned worldly life to study the Dao under Zhang Jun of E, receiving the method of the *\"Cinnabar-Essence Pill.\"* After compounding and consuming it, he lived to one hundred thirty years, yet appeared no older than thirty. He later became a disciple of Ji Zixun, who taught him the *\"Five Emperors’ Numinous Flight of the Six Jia and Twelve Arts,\"* the *\"True Forms of the Ten Divine Isles,\"* and other secret essentials. Jing practiced these methods according to the instructions, and they proved highly effective. He could command ghosts and spirits, summon wind and rain, conjure traveling kitchens, and sit or stand at will. He could also foretell the fortunes and lifespans of others, and perform rituals to extend their lives by ten years—those who died at the appointed time had all been fated to do so. Even those who did not believe him would die at the predicted time.\n\nJing wandered among the famous mountains and the Five Peaks, traveling alongside Wang Zhen until they had visited them all. During the reign of Emperor Wu of Wei, he still visited the homes of his disciples. Huangfu Long, hearing of his mastery of the Dao, became his follower. Jing taught him the *\"Ninefold Cloud-Mother Pill\"* and two methods of *\"the Way of Union.\"* Long practiced and consumed them according to the instructions, and his complexion and vitality grew ever more youthful. His hair did not turn white, nor did his teeth fall out. Though he lived over three hundred years, it was unclear whether he had achieved transcendence.\n\nIn the third year of the Huangchu era of Wei, Jing entered Mount Heng and was never seen again. He told Huangfu Long: \"The essentials of cultivating the body lie in swallowing the Jade Spring every morning, which strengthens the body, enhances one’s complexion, expels the Three Worms, and fortifies the teeth. The Jade Spring is the saliva in the mouth. Before rising in the morning, rinse the mouth with saliva until it fills, then swallow it. Tap the teeth thirty-four times, repeating this three times before stopping. This is called *refining the essence* and grants longevity.\n\nThe Way of Union is most difficult; only superior gentlemen can practice it. It is as perilous as riding a galloping ox or a startled horse. Your nature is prone to excess—might this serve as a warning for you?\" Jing feared that Long would not achieve transcendence.\n\nHere ends the *Outer Traditions of Emperor Wu of Han.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真部记传类 汉武帝外传 经名：汉武帝外传。 一卷。 底本出处：《正统道藏》洞真部记传类。 汉武帝外传 武帝既闻王母至言，说八方巨海之中有十洲，并是人迹所不到处。 又始知东方朔非世俗常人，是以延之曲室，亲问十洲所在、所有之物名故，帝书记之。 朔对云：臣学仙者耳，非得道之人。 以国家之盛美，将招儒、墨於名教之内，抑绝俗之道於虚诡之迹，臣故韬隐逸而赴王庭，藏养生而侍朱阙矣。 亦由尊上好道，且复欲抑绝其威仪也。 曾随师主履行，北至朱陵、扶桑、蜃海、冥夜之丘、纯阳之陵、始青之下、月宫之渊，内游七丘，中旋十浙，践赤县而游五岳，行陂泽而息名山。 臣自少及今，周流六天，所涉天光，极於是耳。 未若凌虚之子，飞真之官，上下九天，洞视百方，北极钩陈而并华盖，南翔太丹而栖大夏，东之通阳之霞，西薄寒穴之野，日月所不逮，星汉所不与，其上无复物，其下无复底。 下臣所识，安及於是，愧不足以酬广访矣。 武帝巡狩过河间，有紫青气自地属天。 望气者以为下当有奇女。 天子拜之，帝使求之，见一女子在空馆中，姿貌殊绝，两手皆拳。 帝令开其手，数擘之，手莫能，舒。 帝於是自披手，即伸。 由是得幸，号为拳夫人，进为捷妤，居钩弋官。 解素女之术，大有宠。 有娠十四月，乃产，是为昭帝。 帝日：昔尧十四月而生，今钩弋亦然。 乃命其门日：尧母门。 后至甘泉，因幸，告帝曰：妾相．运正应为陛下生一男，男年七岁，妾当死，今年必不得归，愿陛下自爱。 言终遂卒。 既殡不见，香闻十余里。",
      "translated_text": "**The Outer Records of Emperor Wu of Han**\n\n*Category: Biographical and Narrative Works of the Dongzhen Section*\n*Title: The Outer Records of Emperor Wu of Han*\n*One fascicle.*\n*Source text: \"Daoist Canon of the Zhengtong Era,\" Dongzhen Section, Biographical and Narrative Works.*\n\n---\n\nAfter Emperor Wu heard the Queen Mother of the West’s words, he learned that within the vast seas of the eight directions lay the Ten Isles—places untouched by human footsteps. He then realized that Dongfang Shuo was no ordinary mortal. Thus, he summoned him to a secluded chamber and personally inquired about the locations of the Ten Isles and the names of their treasures, which the Emperor recorded.\n\nDongfang Shuo replied: \"Your servant is merely a student of immortality, not one who has attained the Dao. Given the splendor of the imperial court, which summons Confucians and Mohists within the bounds of proper governance while suppressing the Way of the reclusive in favor of empty and strange practices, I concealed my eremitic nature to attend the royal court, hiding my arts of nurturing life to serve the vermilion gates. This was also because Your Majesty favors the Dao and sought to temper the display of imperial majesty.\n\nI once followed my master on his travels, journeying north to Crimson Mound, Fusang, the Clam Sea, the Hills of Dark Night, the Pure Yang Tumulus, beneath the Azure Beginning, and the Abyss of the Moon Palace. I wandered within the Seven Mounds, circled the Ten Zhe Rivers, trod the Red Continent and roamed the Five Peaks, traversed marshes and rested upon renowned mountains. From my youth until now, I have traversed the Six Heavens, and the celestial radiance I have witnessed culminates in these places. Yet I am not like the transcendent beings who soar through the void, the flying immortals of the celestial bureaus, who ascend and descend the Nine Heavens, gazing upon all directions. They roam north to the Pole Star and the Celestial Enclosure, where the Canopy of Hua shines; they soar south to the Great Xia, dwelling in the Cinnabar Dawn. To the east, they reach the Radiant Yang Clouds; to the west, they approach the Frigid Caverns. These are realms beyond the reach of sun and moon, untouched by the Silver River. Above, there is nothing more; below, there is no foundation. How could my humble knowledge compare? I am ashamed that it does not suffice to answer Your Majesty’s broad inquiries.\"\n\nDuring Emperor Wu’s imperial tour, as he passed through Hejian, a purple-blue *qi* rose from the earth and connected with the heavens. The court diviners who observed the omens declared that beneath it must reside an extraordinary woman. The Son of Heaven paid her homage, and the Emperor dispatched envoys to seek her out. They found a woman in an empty pavilion, her beauty unparalleled, both hands clenched into fists. The Emperor ordered her to open her hands, but no matter how many times they were pried apart, they would not unfurl. The Emperor then personally spread her fingers, and they immediately extended. From then on, she received his favor and was titled Lady Fist. Later, she was promoted to Swift Consort and resided in the Gouyi Palace. Skilled in the arts of the Plain Girl, she enjoyed great favor.\n\nAfter fourteen months of pregnancy, she gave birth, and the child was Emperor Zhao. The Emperor remarked: \"In ancient times, Emperor Yao was born after fourteen months—now Lady Gouyi is the same.\" Thus, he named her gate the \"Gate of Yao’s Mother.\"\n\nLater, when the Emperor reached Ganquan Palace, he favored her again. She told him: \"By my fate, I was destined to bear Your Majesty a son. When the boy turns seven, I shall die. This year, I will not return. I pray Your Majesty take care of yourself.\" As her words ended, she suddenly passed away. After her burial, her body vanished, and a fragrance lingered for over ten *li*.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 610,
      "start_sentence": 0,
      "end_sentence": 27,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.599879503250122,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝外传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "因葬之云陵。 帝甚哀悼，又疑其非常人，乃发冢开视，空棺无尸，唯衣履存焉。 乃为起通灵台於甘泉。 常有青乌集台上往来。 至宣帝时乃止。 武帝至泰山，修封禅。 石间，泰山道士，号稷丘君，识之者云：且百岁而更少。 封日，帝将上山，稷丘君乃冠章甫冠，衣黄衣，拥琴来迎，谓帝曰：勿轻上山，必伤足。 帝不从，行数里，石促指折，乃止，但祠而返。 淮南王好学才艺，集天下道书，招方士，皆策神气，能云雨。 百姓传云：王能致仙人，与游处，变化无常，或童子，或老人。 王又能隐形飞行，服气不食。 帝闻而嘉其事，欲受其道，王不肯传，云无其事。 帝怒，将诛淮南王。 王知之，出令与旱臣，因去，不知所之。 国人皆云神仙，或有见王者。 帝恐动人情，乃令斩王家人首以安百姓，名为淮南王。 收其方书，亦颇得黄白之事，然非其要法，试之多不验。 帝既感淮南之道，乃征四方有术之士，自燕齐而出者数千人矣。 齐人李少访，年二百岁，色若童子。 作诸方卫，皆有验。 帝甚信之，拜为文成将军，以客礼之。",
      "translated_text": "Thus, she was buried at Yunling. The Emperor grieved deeply and, suspecting she was no ordinary person, had her tomb opened for inspection. The coffin was empty, with no corpse—only her garments and shoes remained. He then erected the Tongling Terrace at Ganquan. Often, dark crows gathered and came and went upon the terrace, ceasing only in the reign of Emperor Xuan.\n\nWhen Emperor Wu ascended Mount Tai to perform the feng and shan sacrifices, among the Daoist practitioners of Mount Tai was one known as Master Jiqiu, whom those who recognized him claimed had lived a hundred years yet appeared ever younger. On the day of the feng sacrifice, as the Emperor prepared to ascend the mountain, Master Jiqiu donned a *zhangfu* cap, wore yellow robes, and came forth bearing a zither to greet him, saying: \"Do not lightly ascend the mountain, for you will surely injure your foot.\" The Emperor did not heed his words. After traveling several *li*, a stone snapped his toe, forcing him to halt. He performed the sacrifices and returned.\n\nThe Prince of Huainan was fond of learning and the arts, collecting Daoist texts from across the realm and summoning masters of esoteric techniques. All cultivated *qi* and could summon clouds and rain. The common folk spread tales that the prince could summon immortals to keep him company, transforming at will—now a youth, now an elder. The prince himself could conceal his form and fly, subsisting on *qi* without eating. The Emperor, hearing of this, admired his feats and wished to learn his Way. The prince refused to teach him, claiming no such arts existed. Enraged, the Emperor prepared to execute the Prince of Huainan. The prince, learning of this, issued orders to his ministers and vanished, his whereabouts unknown. The people of his state all spoke of him as a divine immortal, and some claimed to have seen him. Fearing unrest among the people, the Emperor ordered the execution of the prince’s household and displayed their heads to pacify the masses, declaring them those of the Prince of Huainan. He confiscated the prince’s esoteric texts, gaining some knowledge of alchemical arts, though not their essential methods. Trials of these techniques often proved ineffective.\n\nHaving been moved by the Way of Huainan, the Emperor summoned masters of esoteric arts from all directions—thousands emerged from Yan and Qi alone. Among them was Li Shaofang of Qi, who at two hundred years of age bore the complexion of a child. He crafted various elixirs, all of which proved efficacious. The Emperor trusted him deeply, appointing him General of Literary Accomplishment and treating him with the courtesy due a guest.",
      "overlap_context": "ror Yao was born after fourteen months—now Lady Gouyi is the same.\" Thus, he named her gate the \"Gate of Yao’s Mother.\"\n\nLater, when the Emperor reached Ganquan Palace, he favored her again. She told him: \"By my fate, I was destined to bear Your Majesty a son. When the boy turns seven, I shall die. This year, I will not return. I pray Your Majesty take care of yourself.\" As her words ended, she suddenly passed away. After her burial, her body vanished, and a fragrance lingered for over ten *li*.",
      "start_char": 610,
      "end_char": 1025,
      "start_sentence": 28,
      "end_sentence": 49,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.97964358329773,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝外传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "於甘泉宫中画太一诸神像祀之。 少翁云：先致太一，然后可得升天，升天然后可至蓬莱。 岁余未验，帝渐厌倦。 少爷又使鬼神方，皆验。 唯祀太一，积年无应。 帝性急峻，甚惑之，而少翁愈骄矜，帝怒诛之。 文成被诛后月余，使者藉质从关束还，逢於漕亭，谓使者日：为吾谢帝，不能忍少日，而败大事乎？ 帝好自爱，后四十年求我於劳成山，方共事，不相怨也。 使者还，具言之。 乃令发其棺视之，无所见，唯有竹莆一枚。 帝疑其弟子窃其尸而藏之，乃收捕验问，了无踪迹。 帝大悔诛。 复征诸方士，更於甘泉杞太一。 又别设一座，祀文成，帝亲执礼。 会束郡送一短人，长五寸，衣冠具足。 帝疑其山精。 帝令在案上，召方朔。 朔至，呼短人曰：巨灵，汝何忽叛来？ 阿母还未？ 短人不对，因指谓帝日：王母种桃，三千年一作子，此儿不良，已三过偷之，失王母意，故被谪来此。 帝大惊，愈知朔非世上人也。 短人谓帝日：王母使臣来告陛下，求道之法，唯有清诤，不宜躁扰。 后五年与帝会。 言终不见。",
      "translated_text": "Within the Palace of Sweet Springs, he commissioned murals of the Supreme One and various deities to be worshipped. Shaoweng claimed: \"First summon the Supreme One, then one may ascend to heaven; only after ascending to heaven may one reach Penglai.\" Yet after more than a year, no sign appeared, and the Emperor grew weary. Shaogong then employed methods to summon ghosts and spirits, all of which proved effective—save for the rites to the Supreme One, which after years yielded no response. The Emperor, impatient and severe by nature, was deeply perplexed, while Shaoweng grew ever more arrogant. Enraged, the Emperor had him executed.\n\nA month after Wencheng’s execution, an envoy returning from the eastern passes with tribute encountered him at the Cao Pavilion. Wencheng said to the envoy: \"Convey my regrets to the Emperor: could he not endure a few more days and thus ruin great matters? Let him take care henceforth. Forty years from now, seek me on Mount Laocheng, and we shall serve together without resentment.\" The envoy returned and reported this in full. The Emperor ordered the coffin opened, but nothing was found inside—only a single bamboo mat. Suspecting Wencheng’s disciples had stolen and concealed his body, he had them arrested and interrogated, yet no trace could be found. The Emperor deeply regretted the execution.\n\nHe once more summoned masters of esoteric arts and resumed the rites to the Supreme One at Sweet Springs. Additionally, he set up a separate altar to worship Wencheng, performing the rites himself. At that time, Dong Commandery presented a dwarf, five inches tall, fully clad in robes and cap. The Emperor suspected it was a mountain spirit. He placed it upon a table and summoned Dongfang Shuo. Shuo arrived and addressed the dwarf: \"Great Spirit, why have you suddenly rebelled and come here? Has your mother not yet returned?\" The dwarf made no reply, whereupon Shuo pointed and said to the Emperor: \"The Queen Mother of the West plants peach trees that bear fruit once every three thousand years. This wretched child has stolen from them three times, displeasing the Queen Mother, and so has been banished here.\"\n\nThe Emperor was greatly astonished, all the more convinced that Shuo was no mortal. The dwarf then said to the Emperor: \"The Queen Mother has sent me to inform Your Majesty that the method of seeking the Dao lies solely in purity and stillness—restlessness is unsuited to it. Five years hence, she shall meet with you.\" With these words, the dwarf vanished.",
      "overlap_context": " methods. Trials of these techniques often proved ineffective.\n\nHaving been moved by the Way of Huainan, the Emperor summoned masters of esoteric arts from all directions—thousands emerged from Yan and Qi alone. Among them was Li Shaofang of Qi, who at two hundred years of age bore the complexion of a child. He crafted various elixirs, all of which proved efficacious. The Emperor trusted him deeply, appointing him General of Literary Accomplishment and treating him with the courtesy due a guest.",
      "start_char": 1025,
      "end_char": 1424,
      "start_sentence": 50,
      "end_sentence": 73,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.932296752929688,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝外传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "帝愈恨，又召问方朔。 朔曰：陛下自当知，臣不得说。 终已无言。 帝以其神，’不敢逼也。 齐人公孙卿谓所忠日：吾有师说秘书，言鼎事，欲因公奏之。 如得引见，以玉羊一为寿。 所忠许之，视其书而有疑，谢日：宝鼎事已诀矣，无所复言。 公孙卿乃因那人平时奏之。 有札书，言黄帝得宝鼎，究侯问於鬼臾区，对曰：帝得宝鼎神华，延年岁。 己酉朔旦冬至，得天之纪，终而复始。 於是帝迎日推筹，凡二十推，百八十岁，黄帝乃登仙于天。 今年得朔旦冬至，与黄帝时协。 臣昧死奏。 武帝大悦，召卿问。",
      "translated_text": "The Emperor grew ever more vexed and again summoned Dongfang Shuo to question him. Shuo replied: \"Your Majesty ought to know this yourself; I dare not speak of it.\" In the end, he remained silent. The Emperor, recognizing his numinous nature, dared not press him further.\n\nA man of Qi, Gongsun Qing, said to Suo Zhong: \"I possess esoteric writings from my teacher concerning the matter of the sacred tripods. I wish to present them through you. If I am granted an audience, I shall offer a jade ram as a gift.\" Suo Zhong agreed, but upon examining the text, he harbored doubts and declined, saying: \"The affair of the treasure tripods has already been settled; there is nothing more to be said.\"\n\nGongsun Qing then had it memorialized through the eunuch Ping. The document stated: \"When the Yellow Emperor obtained the sacred tripod, he inquired of Guiyu Qu, who replied: 'The Emperor has gained the tripod and its divine radiance, prolonging his years.' On the first day of the ji-you year, at dawn on the winter solstice, he attained the celestial reckoning, marking the end and the beginning anew. Thereupon, the Emperor tracked the sun’s course and calculated the cycles—after twenty reckonings, totaling one hundred and eighty years, the Yellow Emperor ascended to immortality in the heavens. This year, the winter solstice coincides with the first day of the month, aligning with the time of the Yellow Emperor. Your servant, at risk of death, ventures to memorialize this.\"\n\nEmperor Wu was greatly pleased and summoned Qing to question him.",
      "overlap_context": "ery three thousand years. This wretched child has stolen from them three times, displeasing the Queen Mother, and so has been banished here.\"\n\nThe Emperor was greatly astonished, all the more convinced that Shuo was no mortal. The dwarf then said to the Emperor: \"The Queen Mother has sent me to inform Your Majesty that the method of seeking the Dao lies solely in purity and stillness—restlessness is unsuited to it. Five years hence, she shall meet with you.\" With these words, the dwarf vanished.",
      "start_char": 1424,
      "end_char": 1649,
      "start_sentence": 74,
      "end_sentence": 87,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.615710735321045,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝外传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "卿对日：臣受此书於申公，已死，尸解去。 帝曰：申公何人？ 卿日：齐人安期先生，同受黄帝言，有此鼎书。 申公常告臣言：汉之圣者，在高祖之曾孙焉。 宝鼎出而与神通，封禅得上泰山，唯有黄帝、汉主。 当上封，封则能登天矣。 黄帝且与百鬼战，且学仙，百余岁乃得与神通。 黄帝郊雍祠上帝，宿斋三月，鬼区尸解而去，因葬雍。 雍，今大鸿冢是其后。 黄帝接万灵於明庭，甘泉是也。 升仙寒门，谷口是也。 黄帝采首山铜，铸鼎於刻山。 鼎既成，有龙垂胡髯，下迎帝上龙。 草臣及后宫从上龙者七十余人，小臣不得上，乃悉持龙髯，拔，坠帝弓。 百姓仰望黄帝上天，乃抱其弓与龙髯而号，故后世号其冢日鼎湖，其弓日乌号。 武帝於是叹日：嗟乎，吾诚能及黄帝，视去天下如弃土。 帝祠黄帝冢於乔山，顾问公孙卿日：黄帝仙不死，有冢，何也？ 对日：黄帝仙去，草臣思慕无已，乃葬其衣冠，非真冢也。 武帝又叹曰：吾后升天，旱臣亦当思慕，持吾衣冠，葬於束陵乎？ 鲁女生者，长乐人也。 少好道，初服饵胡麻及水，绝谷八十余年，日更少壮，色如桃华。 一日能行三百里，走及庆鹿。 世传见之三百余年。",
      "translated_text": "Qing replied: \"I received this text from Master Shen, who has since died, his body dissolved in transcendence.\"\n\nThe Emperor asked: \"Who was Master Shen?\"\n\nQing answered: \"Anqi Xiansheng of Qi, who together with me received the teachings of the Yellow Emperor and this text on the sacred tripod. Master Shen often told me: 'The sage of Han lies among the great-grandsons of Gaozu. When the sacred tripod emerges and communicates with the divine, when the Feng and Shan sacrifices ascend Mount Tai, only the Yellow Emperor and the Lord of Han shall achieve this. When the Feng sacrifice is performed atop the mountain, one may then ascend to heaven. The Yellow Emperor waged war against the hundred ghosts and studied immortality, and only after more than a hundred years did he attain communion with the divine. The Yellow Emperor offered sacrifices to the Supreme Lord at the suburban altar of Yong, fasting in seclusion for three months. Guiyu’s body dissolved in transcendence and departed, whereupon he was buried at Yong. Yong—now the great tomb of Hong is its successor. The Yellow Emperor summoned the ten thousand spirits in the Hall of Light—this is Gansui. The Gate of Cold through which he ascended to immortality—this is Gukou. The Yellow Emperor mined copper from Mount Shou and cast the tripod at Mount Ke. When the tripod was completed, a dragon descended, its whiskers hanging down, to welcome the Emperor onto its back. Over seventy of his ministers and palace ladies followed him onto the dragon, but lesser attendants could not ascend. They grasped the dragon’s whiskers, which tore away, and the Emperor’s bow fell. The people gazed up as the Yellow Emperor ascended to heaven, clutching his bow and the dragon’s whiskers, weeping. Thus, later generations named his tomb Dinghu, and his bow Wuhao.\"\n\nThereupon, Emperor Wu sighed: \"Alas! If I could but reach the Yellow Emperor’s attainment, I would cast aside the world as dust.\"\n\nThe Emperor then sacrificed at the Yellow Emperor’s tomb on Mount Qiao. Turning to Gongsun Qing, he asked: \"The Yellow Emperor became an immortal yet did not die—why then does he have a tomb?\"\n\nQing replied: \"When the Yellow Emperor ascended as an immortal, his ministers longed for him endlessly. Thus, they buried his robes and cap—it is not a true tomb.\"\n\nEmperor Wu sighed again: \"When I ascend to heaven hereafter, will my ministers also long for me, holding my robes and cap to bury them at Dongling?\"\n\nLu Nüsheng was a native of Changle. From youth, she cultivated the Dao, first consuming sesame and water, abstaining from grains for over eighty years. Day by day, she grew younger and more radiant, her complexion like peach blossoms. In a single day, she could travel three hundred *li*, running as swiftly as a deer. The world has transmitted accounts of her for over three hundred years.\"",
      "overlap_context": "al reckoning, marking the end and the beginning anew. Thereupon, the Emperor tracked the sun’s course and calculated the cycles—after twenty reckonings, totaling one hundred and eighty years, the Yellow Emperor ascended to immortality in the heavens. This year, the winter solstice coincides with the first day of the month, aligning with the time of the Yellow Emperor. Your servant, at risk of death, ventures to memorialize this.\"\n\nEmperor Wu was greatly pleased and summoned Qing to question him.",
      "start_char": 1649,
      "end_char": 2098,
      "start_sentence": 88,
      "end_sentence": 110,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.569381475448608,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝外传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "后采药於嵩高山，忽见一女人坐山涧中。 女生知是神人，因叩头再拜，稽首乞长生之要。 良久，女人日：我三天太上侍官者也。 汝当得仙，故得见我。 我将授汝宝文秘要，可以威制五岳，役使众灵。 乃出《五岳真形图》 以与之，并告其施用节度。 女生道成，一旦与亲知故人别，云入华山中去。 后五十年，先相识者逢女生於华山庙前，颜色更少，乘白鹿，从玉女三十人，并令谢其乡里亲故人，甚分明也。 其《五岳图》与《王母文》正同？ 今得见於世问者，岂不由李少君、董仲舒及女生得之？ 仲舒临去以传乐巴，女生初时以图传蓟子训，训后传封君达，君达后入玄丘山，临去传左元放。 封君达，陇西人也。 少好道，初服黄连五十余年，乃入乌鼠山。 又於山中服炼水银百余年，还乡里，年如三十者。 常乘青牛，故号为青牛道士。 行闻有病殆死者，识与不识，便以腰问竹管中药与服之。 或为下针，应手皆愈。 世多得其效验，都不以姓字语人，人通识乘青牛，因以青牛为名。 闻鲁女生得真人《 五岳图》 ，连年请求之。 女生后见授，并具告节度。 君达先在人问二百余年，乃入玄丘山中，不知所在。 临去，以《五岳真形》传左元放。 元放以传葛孝先也。 青牛道士受鲁女生言：家有《五岳真形》，一岳各遣五神来卫护图书。 所居山川近止者，川泽 神又但遣侍官防身营家，凶逆欲见伤害，皆反受其殃。 有相谋议已者，五神杀凶主，皆亦验应於梦想。 又辟除五方五瘟、水火之灾，可带履锋刃。 此真形冥心，精加奉敬，敬而甚於君父。 每事宜有所施行，皆先於静处烧香，启五岳君也。 五君恒书道士善事，又司道士之奸秽，言人之不正。 不正者祸身，奸秽者祸门。 是以宜深忌慎之。 道士带此文形，及执持以履山林者，百山地源灵主皆出境拜迎，形见光景，防护遏恶，尊贵岳形，信逮我一身，鬼神犹执卑降之礼，何况凡人而可慢之哉？ 李少君字云翼，齐国临淄人也。 少好道，入泰山采药，修绝谷遁世全身之术。 道未成而病困於山林中，遇安期先生经过，见少君。 少君叩头求乞活，安期愍其有至心而被病当死，乃以神楼散一匕与服之，即起。 少君於是求随安期，奉给奴役。 便听师事之。 安期将少君束至赤城，南之罗浮，北至太恒，西游玉门，周流五岳，观看江川，如此数十年。 安斯一旦语之：我被玄洲召，即日当去。 汝未应随我至彼，今当相舍去也。 复六百年当迎汝於此。 因授神丹炉火飞玄之方，誓约口诀毕，须臾遂乘龙虎，导引数百人，迎安期。 安期乘羽车而升天也。 少君於是还斋戒，卖於市，商估六国，或时为吏，或作师医治病，或时煦赁。 易姓改名，游行处所莫知其有道。 逮汉武帝之时，闻帝招募方士，待敬道术，而先贫不办合大药，喟然长叹，语弟子日：老将至矣，死将近矣，而财不足用，躬耕力作，商估求钱，必不致办合药。 又吾亦赢拙於斯事也。 闻天子好道，请欲见之，求为合丹，可得恣意，无求不得。 天子中成者成之，不中教者便舍去。 吾在世上已五百余年，而不为一权者，必不免於虫蚁之粮矣。 乃以方上武帝，言臣能凝汞成白银，飞丹砂，成黄金，金成服之，白日升天，神仙无穷，身生朱阳之羽，体备圆光之翼，炼则凌天，伏入无问，控飞龙而八遐已遍，驾白鸿而九陕立周，冥海之枣大如瓜，钟山之李大如瓶，臣已食之，逮有先师安期先生授臣口诀，是以保黄物之可成也。",
      "translated_text": "Later, she gathered herbs on Mount Songgao when she suddenly saw a woman sitting in a mountain stream. Knowing she was a divine being, Nüsheng knelt, bowed twice, and kowtowed, begging for the essentials of longevity. After a long while, the woman said: \"I am an attendant official of the Supreme One of the Three Heavens. You are destined for immortality, which is why you may see me. I shall now transmit to you the secret essentials of the *Precious Writ*, with which you may command the Five Peaks and dispatch the multitude of spirits.\" Thereupon she produced the *True Forms of the Five Peaks Chart* and gave it to her, along with instructions on its application and regulations. Nüsheng achieved the Dao, and one day she bid farewell to her kin and acquaintances, saying she was entering Mount Hua. Fifty years later, those who had known her before encountered her before the shrine of Mount Hua—her complexion had grown even younger. She rode a white deer, accompanied by thirty jade maidens, and sent clear greetings to her hometown kin and acquaintances.\n\nIs the *Chart of the Five Peaks* identical to the *Writ of the Queen Mother*? Those seen in the world today—could they not have descended from Li Shaojun, Dong Zhongshu, and Nüsheng? Before his departure, Zhongshu transmitted it to Yue Ba; initially, Nüsheng transmitted the chart to Ji Zixun, who later passed it to Feng Junda. Before entering Dark Mound Mountain, Junda transmitted it to Zuo Yuanfang. Feng Junda was a native of Longxi. From youth, he cultivated the Dao, first consuming *huanglian* for over fifty years, then entering Wushu Mountain. There, he refined mercury for over a hundred years before returning to his hometown, his age appearing no more than thirty. He often rode a black ox, hence his sobriquet, the Black Ox Daoist. Whenever he heard of someone gravely ill or near death—whether he knew them or not—he would offer medicine from the bamboo tube at his waist. Sometimes he would administer acupuncture, and all recovered at his touch. Many in the world benefited from his efficacy, yet he never revealed his surname or given name. People only recognized him by his black ox, so they called him by that name.\n\nHearing that Nüsheng had obtained the *True Forms of the Five Peaks* from a perfected one, he sought it from her for years. Later, she granted it to him and fully instructed him in its regulations. Junda had already lived among people for over two hundred years before entering Dark Mound Mountain, after which his whereabouts became unknown. Before departing, he transmitted the *True Forms of the Five Peaks* to Zuo Yuanfang, who in turn passed it to Ge Xiaoxian.\n\nThe Black Ox Daoist received Nüsheng’s words: \"In the household possessing the *True Forms of the Five Peaks*, each peak dispatches five spirits to guard and protect the charts and writings. For those dwelling near mountains and rivers, the river and marsh spirits also send attendant officials to safeguard one’s person and household. If malevolent forces seek to harm you, they will instead suffer calamity. If conspirators plot against you, the five spirits will slay the instigator—all verified in dreams. Moreover, it averts the five pestilences of the five directions, as well as disasters of water and fire. One may tread upon blades unharmed. When the true forms are inwardly contemplated with utmost reverence—honoring them even more than one’s lord or father—every action should begin in a quiet place by burning incense and invoking the Lords of the Five Peaks. The Five Lords constantly record the Daoist’s virtuous deeds and also oversee their transgressions and impurities, as well as the unrighteousness of others. The unrighteous bring ruin upon themselves; the impure bring ruin upon their households. Thus, one must deeply guard against and be cautious of these.\n\nWhen a Daoist carries this chart or holds it while traversing mountains and forests, the spirit-lords of all mountains and earthly sources emerge from their domains to bow in welcome, manifesting in radiant forms to guard, repel evil, and honor the sacred peaks. The reverence due to the peak-forms extends even to my person—ghosts and spirits still perform the rites of humble submission, so how could ordinary people dare treat them with disrespect?\"\n\nLi Shaojun, styled Yunyi, was a native of Linzi in Qi. From youth, he loved the Dao, entering Mount Tai to gather herbs and practicing grain abstention and reclusion to preserve his body. Before achieving the Dao, he fell gravely ill in the mountains. Master Anqi happened to pass by and, seeing Shaojun, struck his head and begged for life. Moved by his sincerity and pitying his illness, which would have led to death, Anqi gave him a spoonful of *Divine Tower Powder*. Shaojun immediately rose. Thereafter, he sought to follow Anqi as a servant and disciple. Anqi accepted and took him east to Red City, south to Luofu, north to Great Heng, and west to Jade Gate, roaming the Five Peaks and observing rivers and mountains for several decades.\n\nOne day, Anqi told him: \"I have been summoned by the Dark Continent and must depart today. You should not follow me there yet. We shall part here. Six hundred years from now, I will welcome you at this place.\" He then transmitted the methods of divine elixirs, furnace fires, and flying mysteries, along with sworn oral instructions. In an instant, Anqi mounted a dragon-tiger, leading hundreds of attendants to welcome him. Anqi ascended to heaven in a feathered carriage.\n\nShaojun then returned to purify himself, selling goods in markets and trading across the six states. At times, he served as an official; at others, he practiced medicine or rented out his skills. He changed his surname and given name, traveling in places where none knew he possessed the Dao. By the time of Emperor Wu of Han, hearing the emperor recruited fangshi and revered Daoist arts, yet lacking the means to compound great elixirs, he sighed deeply and said to his disciples: \"Old age approaches, death draws near, yet my resources are insufficient. If I till the land, labor, or trade for money, I will never succeed in compounding the elixir. Moreover, I am clumsy in such matters. I have heard the Son of Heaven loves the Dao and wish to see him, requesting to compound the cinnabar. If granted free rein, no desire will be unfulfilled. If the emperor’s intentions align, he will succeed; if not, I shall depart. I have lived in the world for over five hundred years yet have not gained even temporary power—surely I cannot escape becoming food for worms and ants.\"\n\nThus, he presented his arts to Emperor Wu, saying: \"Your servant can congeal mercury into white silver, transmute cinnabar into flying elixir, and refine it into yellow gold. Consuming the gold grants ascent to heaven in broad daylight, endless immortality, the body sprouting crimson feathers of the sun, and wings of radiant light. Refined, one soars through the heavens; at rest, one enters the unseen. Riding flying dragons, the eight distant realms are traversed; driving white swans, the nine expanses are swiftly circumnavigated. The jujubes of the Dark Sea grow as large as gourds; the plums of Bell Mountain swell like jars. Your servant has already consumed them. Moreover, my former teacher, Master Anqi, transmitted oral instructions to me, ensuring the success of these yellow substances.\"",
      "overlap_context": "o heaven hereafter, will my ministers also long for me, holding my robes and cap to bury them at Dongling?\"\n\nLu Nüsheng was a native of Changle. From youth, she cultivated the Dao, first consuming sesame and water, abstaining from grains for over eighty years. Day by day, she grew younger and more radiant, her complexion like peach blossoms. In a single day, she could travel three hundred *li*, running as swiftly as a deer. The world has transmitted accounts of her for over three hundred years.\"",
      "start_char": 2098,
      "end_char": 3394,
      "start_sentence": 111,
      "end_sentence": 164,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.95086050033569,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝外传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "於是引见，甚尊敬之，赐遗无数，为立屋第。 武帝自谓必能使我度世者。 少君尝从武安侯饮酒，坐中有老人，年九十余。 少君言与其祖父游射处，老人为小儿时从其祖父识有此人，一座尽惊。 少君见武帝有故铜器，少君望而识之，曰：昔齐桓公尝陈此器於梧寝。 帝按其刻，果齐桓公器，乃知少君数百岁人也。 然视之常如年五十许人，面色甚好，肌肤悦泽，尤有光华。 眉目口齿似十五童子。 诸侯王贵人闻其能令人不死，老更少壮，绩遗之金钱无限。 乃密作神丹，丹成未服。 又就帝求五帝六甲左右灵飞之书．凡十二事，帝以元封四年七月以书授少君。 到元封六年九月少君称疾上表，云陛下思心玄妙，甄长生，於是招诱道术，无远不至，诚感灵天神斯降。 自非宿命所适，熟能谐合？ 然丹方禁重，宜绝臭腥。 仙法养物，仁充蠢动。 而陛下不能绝奢侈，远声色，杀伐不止，喜怒不除，万里有不归之魂、市朝有流血之形，神丹大道，未可得成。 而臣疾与年偕，今者虚疗，又不获躬亲斋戒，预睹彭祖丹砂之变，於此邈矣。 先师安期先生昔所赐金丹之方而有征，若按节度，奉法戒，尔乃可修用之焉。 若郁砂虹飞，玄朱九转，剖六一而流精夺日，探霜雪而月光风卷，徘徊丹霞，腾沸龙虎，投铅锡而黄金克成，刀圭入喉而雕气立反，尔乃驾神虹以上升，骋云车以涉远，当验此方之神，将明小臣之不妄矣。 乃以小丹方与帝，而称疾困，非大丹方也。 其夜武帝梦与少君俱上嵩高山，半道有绣衣使者乘龙持节，从云中下，言太一请少君。 武帝觉，即遣使者问少君消息，且告近臣曰：如朕梦，少君将舍朕去矣。 明日少君临病困，武帝自往，并使左右人受其方书，未竟而少君。 武帝流涕曰：少君不死也，故作此去耳。 既敛之，忽失其所在。 中表衣带不解，如蝉蜕也。 於是为殡其衣物。 百余日，行人有见少君在河束蒲圾市者，乘青骡。 帝闻之，便发其棺。 棺中无所复有，钉亦不脱，唯余履在耳。 武帝殊益懊恨，求少君之不勤也。 明年相梁台火烧，失诸秘书妙文也。 初少君与议郎董仲相亲，见仲宿有困疾，体枯气少，乃与其成药二剂，并其方一篇，用戊己之草，后土脂精，艮兽沉肪，先莠之根，百卉华醴，龙衔之草，亥月上旬，合煎铜鼎，童男童女，沐浴洁清，调其汤火，取使合成，服如鹦子，三枚为程。 服尽一剂，身体便轻。 服尽三剂，落齿更生。",
      "translated_text": "Upon this, Emperor Wu summoned him for an audience, showing him the utmost reverence and bestowing upon him countless gifts, even constructing a residence for him. The Emperor believed that he could surely enable him to transcend the mortal world. On one occasion, Shaojun attended a feast hosted by the Marquis of Wu’an, where an elderly man of over ninety sat among the guests. Shaojun remarked that he had once hunted with the old man’s grandfather, and the old man, recalling his childhood, confirmed that he had indeed accompanied his grandfather and recognized Shaojun. The entire assembly was astonished. Shaojun then noticed an ancient bronze vessel in Emperor Wu’s possession; upon gazing at it, he identified it, saying, \"This was once displayed in the Wuqin Chamber by Duke Huan of Qi.\" The Emperor verified the inscription, and indeed, it was a relic of Duke Huan of Qi. Thus, it became clear that Shaojun was a man of several hundred years. Yet, he appeared no older than fifty, his complexion radiant, his skin smooth and lustrous, his brows, eyes, mouth, and teeth resembling those of a fifteen-year-old boy. When the feudal lords and nobles heard of his ability to grant immortality and restore youth to the aged, they sent him endless gifts of gold and money.\n\nShaojun secretly prepared an elixir of immortality, but before he could consume it, he approached the Emperor to request the *Five Emperors and Six Jia Spirit Flight Manuals*, comprising twelve scrolls in total. In the seventh month of the fourth year of the Yuanfeng era, the Emperor granted him these texts. By the ninth month of the sixth year of Yuanfeng, Shaojun claimed illness and submitted a memorial, stating: \"Your Majesty’s thoughts are profound and wondrous, earnestly seeking longevity. Thus, you have summoned and attracted Daoist arts from afar, and none have failed to arrive. Truly, the spirits of heaven have descended in response. Yet, if one’s fate is not predestined, who could achieve harmony? However, the alchemical formulas are of grave importance, and one must abstain from the foul and the impure. The Dao of immortality nurtures all things, its benevolence extending even to the lowliest creatures. Yet Your Majesty cannot forsake extravagance, distance yourself from sensual pleasures, cease warfare, or temper your wrath. Across ten thousand li, souls remain unreturned; in the markets and courts, blood still flows. Under such conditions, the great elixir and the supreme Dao cannot be attained. Now, my illness grows with the years, and my feeble attempts at healing have failed. I have not been able to personally observe the fasts and purifications, nor witness the transformations of Pengzu’s cinnabar. Alas, this opportunity is lost. My former teacher, Master Anqi, once bestowed upon me a verified formula for the golden elixir. If one follows the regulations, upholds the precepts, and adheres to the prohibitions, only then may it be cultivated and employed. When the cinnabar smolders and the rainbow soars, when the ninefold cyclical transmutations of the mysterious and the vermilion unfold, when the Six-and-One is split and its essence flows to outshine the sun, when frost and snow are gathered and the moonlight is swept away by the wind—then, amidst the swirling crimson mists, the dragon and tiger seethe and boil. Lead and tin are cast in, and yellow gold is perfected; a knife-tip’s measure enters the throat, and the breath of decay is instantly reversed. Only then may one ride the divine rainbow to ascend, or drive the cloud chariot to traverse the distant realms. This formula’s divine efficacy will then be proven, and my humble words will be shown not to have been false.\"\n\nHe then presented the Emperor with a minor elixir formula, claiming his illness had worsened, though this was not the formula for the great elixir. That night, Emperor Wu dreamed that he and Shaojun ascended Mount Song together. Midway, an emissary in embroidered robes, riding a dragon and bearing a tally, descended from the clouds, announcing, \"The Great One summons Shaojun.\" The Emperor awoke and immediately dispatched messengers to inquire after Shaojun’s condition. He told his close ministers, \"As in my dream, Shaojun is about to leave me.\" The next day, Shaojun’s illness took a grave turn. The Emperor personally visited him and ordered his attendants to receive his alchemical texts, but before the transmission was complete, Shaojun passed away. The Emperor wept, saying, \"Shaojun is not dead; he has merely departed in this manner.\" After his body was encoffined, it suddenly vanished from the casket. Only his outer garments and belt remained, untied, as if he had shed them like a cicada’s molted husk. Thus, they buried his clothing and belongings. Over a hundred days later, travelers reported seeing Shaojun in the market of Puyi in Hedong, riding a blue-gray mule. Upon hearing this, the Emperor had the coffin opened. Inside, there was nothing left—even the nails remained undisturbed—save for a single pair of shoes. The Emperor was deeply remorseful, regretting that he had not pursued Shaojun’s teachings more diligently. The following year, a fire at Liang Terrace destroyed many of the secret and wondrous texts.\n\nEarlier, Shaojun had been close with the Gentleman-in-Attendance Dong Zhong. Seeing that Dong suffered from a chronic ailment, his body withered and his qi depleted, Shaojun gave him two doses of a completed medicine, along with a scroll detailing its formula. The ingredients included *wuji* grass, the essence of *houtu* (Earth’s fat), the marrow of the *gen* beast, the roots of *xianyou*, the nectar of a hundred flowers, and *longxian* grass. The elixir was to be prepared in the first ten days of the tenth month, decocted in a bronze cauldron, with boys and girls who had bathed and purified themselves regulating the fire. The medicine was to be formed into pellets the size of a parrot’s egg, with three taken per dose. After finishing the first dose, the body would feel lighter. After three doses, one’s teeth would fall out and regrow.",
      "overlap_context": "un, and wings of radiant light. Refined, one soars through the heavens; at rest, one enters the unseen. Riding flying dragons, the eight distant realms are traversed; driving white swans, the nine expanses are swiftly circumnavigated. The jujubes of the Dark Sea grow as large as gourds; the plums of Bell Mountain swell like jars. Your servant has already consumed them. Moreover, my former teacher, Master Anqi, transmitted oral instructions to me, ensuring the success of these yellow substances.\"",
      "start_char": 3394,
      "end_char": 4297,
      "start_sentence": 165,
      "end_sentence": 199,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.24954652786255,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝外传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "服尽五剂，命不复倾。 仲为人刚直，博学五经，然不达道术，常笑世人服药学道，数上书谏武帝，以为人生有命，衰老有常，非道术所能延益。 虽见其有异，以为天性，非术所致。 得其药，竟不服。 又不解从问其方，为藏去之而已。 少君去后数月，仲躬病甚，又武帝数道其梦，恨惜之，仲乃忆所得少君药，试取服之，未半，能行，身体轻壮，所苦了愈。 药尽，气力如三十时。 乃更信世问有不死之道，即以去官，行求道士。 问以方意，悉不能晓，然白发皆还黑，形容甚盛。 后八十余乃死。 临死谓子道生日：我得少君神方，我不信事，怀恨黄泉，汝后可行求术人，问解之者，若长服此药，必度世也。 道生感父遗言，遂不肯仕，周旋天下，求解此方。 到江夏遇博泽先生，先生曰：此乃非神丹金玉也，可使人得数百年而已耳。 乃具为说解其方意，所用物真名。 道生合药服之，得寿三百七十岁，入鸡头山中，不知竟得道不？ 同时卓元成、张子仁、昊士升、蔡子盛、魏仲明、张元达服之，或得三百岁，或得五百岁，皆至死不病，不偃面，不皱理，齿不落，发不白，房室不废。 此盖少君凡弊方耳，犹使人如此，死其上方邪？ 少君当去时，密以六甲左右灵飞术十二事传束郭延，以神丹飞玄之方授少君乡里人蓟子训者。 此二人后学道，并得仙。 少君又授子训昆仑神州真形也。 束郭延字公游，山阳人也。 少好道，闻李少君有道，求与相见，叩头乞得执侍巾栉洒扫之役。 少君许之。 见延小心，良谨可成，临当去，密以五帝六甲左右灵飞之术、逛虚招真十二事授延，告之曰：此亦要道也，审而行之，亦升天矣。 口诀毕而遣去。 延遂还家，合服灵飞散，能夜书。 在寝室中，身生光，昭一左右。 行六甲左右术，能占吉凶天下。 当死者，识与不识，皆逆知之。 又役使鬼神，收摄虎豹，无所不为。 在乡里四百岁，不老。 汉建安二十一年，一日一有数十人乘虎豹之来迎之。 比邻尽见之，乃与亲节别，而辞去，云诣昆仑台。 临去，先以神丹方、五帝灵飞秘要传尹先生。 尹先生讳轨，字公度，太原人也。 以晋元熙元年入南阳太和山中，以诸要事授其弟子河内山世远。 延先承少君劫，初以灵飞术传蓟子训，子训亦受传神丹经。 蓟辽字子训，齐国临淄人，李少君之邑人也。 少仕州郡，举孝廉，除郎中。 又从军，拜驸马都尉。",
      "translated_text": "After completing five doses, Dong’s life was no longer in peril. Dong was a man of unyielding integrity, deeply learned in the Five Classics, yet he did not comprehend the arts of the Dao. He often mocked those who took elixirs or pursued the Way, repeatedly memorializing Emperor Wu to admonish him, arguing that human life was governed by fate, and aging followed its natural course—neither could be prolonged by Daoist arts. Though he witnessed Shaojun’s extraordinary abilities, he dismissed them as innate traits, not the result of any technique. When he received the medicine, he refused to take it and did not inquire further about its formula, merely storing it away.\n\nMonths after Shaojun’s departure, Dong fell gravely ill. Emperor Wu, too, repeatedly recounted dreams of him, lamenting the loss. Only then did Dong recall the medicine Shaojun had given him. He took some as a trial and, before even finishing half a dose, found himself able to walk. His body grew light and robust, and his ailments vanished entirely. Once the medicine was exhausted, his strength returned to what it had been in his thirties. Convinced at last that the world held a path to immortality, he resigned his post and traveled in search of Daoist masters. Though he could not fully grasp the principles of the formula, his white hair turned black again, and his appearance flourished. He lived to over eighty before dying. On his deathbed, he told his son Daosheng: “I obtained Shaojun’s divine formula, yet I failed to believe in its power—my regret will follow me to the Yellow Springs. You must seek out those versed in the arts and ask them to explain it. If you take this medicine for long, you will surely transcend this world.”\n\nMoved by his father’s dying words, Daosheng refused to enter official service. Instead, he wandered the realm in search of someone who could decipher the formula. In Jiangxia, he encountered Master Boze, who said: “This is no divine elixir of gold or jade—it can only grant a few hundred years of life.” He then thoroughly explained the formula’s principles and the true names of its ingredients. Daosheng compounded the medicine and took it, living to the age of 370 before entering Jitou Mountain. It is unknown whether he ultimately attained the Dao.\n\nOthers who took the same medicine—Zhuo Yuancheng, Zhang Ziren, Wu Shisheng, Cai Zisheng, Wei Zhongming, and Zhang Yuanda—lived to three or five hundred years. None fell ill before death; their faces did not sag, their skin remained unwrinkled, their teeth did not fall out, their hair did not turn white, and their virility did not wane. If even this humble formula of Shaojun’s could achieve such effects, what might his superior elixirs have done?\n\nBefore his departure, Shaojun secretly transmitted the *Six Jia Left-and-Right Spirit-Flight Arts* and twelve other techniques to Shuai Guo Yan, while entrusting the *Divine Elixir of Flying Mystery* to his fellow townsman Ji Zixun. Both later studied the Dao and attained immortality. Shaojun also taught Zixun the *True Form of the Kunlun Divine Continent*.\n\nShuai Guo Yan, styled Gongyou, was a native of Shanyang. From youth, he was drawn to the Dao, and upon hearing of Li Shaojun’s mastery, he sought an audience, kowtowing and begging to serve as his attendant—handling his toiletries, sweeping, and other menial tasks. Shaojun granted his request. Observing Yan’s diligence and sincerity, he deemed him capable of success. As his departure neared, he secretly imparted the *Five Emperors’ Six Jia Left-and-Right Spirit-Flight Arts*, the *Twelve Methods of Roaming the Void and Summoning the True*, and said: “These, too, are essential arts of the Dao. Practice them carefully, and you may ascend to heaven.” After delivering the oral instructions, he sent Yan away.\n\nYan returned home and compounded the *Spirit-Flight Powder*, which enabled him to write at night. In his bedchamber, his body emitted a radiance that illuminated his surroundings. Practicing the *Six Jia Left-and-Right Arts*, he could divine the fortunes of the realm. Those destined to die—whether acquaintances or strangers—he knew in advance. He commanded ghosts and spirits, subdued tigers and leopards, and performed feats beyond measure. He lived in his hometown for four hundred years without aging. In the twenty-first year of *Jian’an* during the Han, one day dozens of men arrived riding tigers and leopards to welcome him. His neighbors all witnessed this. He bid farewell to his relatives and departed, saying he was bound for the Kunlun Terrace. Before leaving, he transmitted the *Divine Elixir Formula* and the *Five Emperors’ Spirit-Flight Secrets* to Master Yin.\n\nMaster Yin, whose given name was Gui and style name Gongdu, was a native of Taiyuan. In the first year of *Yuanxi* of the Jin, he entered Taihe Mountain in Nanyang and passed on the essential arts to his disciple Shan Shiyuan of Henei.\n\nEarlier, Yan had received Shaojun’s teachings and first transmitted the *Spirit-Flight Arts* to Ji Zixun, who also received the *Divine Elixir Canon*. Ji Liao, styled Zixun, was a native of Linzi in the Qi state and a townsman of Li Shaojun. In his youth, he served in local and provincial offices, was nominated as a *Filial and Incorrupt* candidate, and appointed Gentleman of the Palace. Later, he joined the military and was enfeoffed as Commandant of the Imperial Carriage.",
      "overlap_context": "w of the *gen* beast, the roots of *xianyou*, the nectar of a hundred flowers, and *longxian* grass. The elixir was to be prepared in the first ten days of the tenth month, decocted in a bronze cauldron, with boys and girls who had bathed and purified themselves regulating the fire. The medicine was to be formed into pellets the size of a parrot’s egg, with three taken per dose. After finishing the first dose, the body would feel lighter. After three doses, one’s teeth would fall out and regrow.",
      "start_char": 4297,
      "end_char": 5193,
      "start_sentence": 200,
      "end_sentence": 239,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.13660979270935,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝外传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "晚悟治世俗综理官无益於年命也，乃从少君学治病作医法。 渐久，见少君有不死之道，遂以弟子之礼事少君而师焉。 少君亦以子训用心专，知可成就，渐渐告之以道家事。 因教令胎息、胎食、住年、止白之法。 行之二百余年，颜色不老。 在乡里与人信让从事，性好清净，常闲居读《易》，时作小小文疏，皆有意义。 少君晚又授子训无常子大幻化之术，按事施行，皆效。 曾见比舍家抱一儿，从求抱之，失手，儿堕地即死。 其家素尊敬之，不敢有悲哀之色而埋之，谓此儿命应不成人。 行已积日，转不能复思之。 子训因还外，抱儿还家，家人恐是鬼，乞不复用。 子训日：但取无苦，故是汝儿也。 儿识其母，喜笑欲往，母乃取之，意犹不了。 子训既去，夫归共往掘视，所埋死儿定器中有泥儿，长六寸许耳。 此儿遂长大。 又诸老人发毕白者，子训但与之对坐共语，宿昔之问，则明旦皆发黑矣。 亦无所施为，为黑可期一年二百日也。 亦复有不使人发黑者，盖神幻之大变者也。 京师贵人闻之，莫不虚心欲见子训，而无绿致之。 子训比居有年少为太学生，於是诸贵人共呼语之：卿所以勤苦读书者，欲以课试，规富贵耳。 但为吾一致蓟子训来，能使卿不劳而达。 书生许诺，乃归，亲事子训，朝夕洒扫，立侍左右，如此且二百日。 子训语书生日：卿非学道者，何能如此？ 书生日：忝乡里末流，长幼之道，自当尔。 子训曰：何以不道实而作虚饰邪？ 吾以具知卿意，诸贵人欲得见我，我亦何惜一行之劳而不使卿得荣位乎？ 便可还语诸人，吾某月某日当往。 书生甚喜，到京师具向诸贵人说此意。 到期日，子训未行，书生父母忧之，往视子$ ll 。 子讥曰：恐我不行邪？ 不使卿儿失信，当发。 以食时去所居。 书生父母相谓日：蓟先生虽不如期至，要是往也。 定后日书生归，推计之。 子训以其日中时到京师，是不能半日，行千余里。 既至，书生往见子训。 子训问书生曰：谁欲见我者？ 书生日：欲见先生者甚多，不敢枉屈，但乞知先生所止，自当来也。 子训日：不须使来，吾尚千余里来，宁复与诸人计此邪？ 卿今日使人人尽语之，使各绝宾客，吾日中当往临，时自当择所先诣。 书生如其言语贵人，贵人各洒扫。 到日中，子训往凡二十三处，便有二十三子训，各在一处。 诸贵人各各喜，自谓子训先诣之。 定明日相参问，同时各有一子训，其衣服颜色皆如一，而论说随主人谘问，各各答对不同耳。 主人并为设酒食之具以饷子训，皆各家家尽礼饮食之。 於是远近大惊，诸贵人并欲诣之，子训谓书生日：诸人谓我当有重瞳八采，故欲见我。 我亦无所道，我不复往，便尔去矣。 适出门，诸贵人冠盖塞道，到门，书生言适去东陌上，乘青骡者是也。 於是各各走马逐之，望见骡徐徐而行，各马逐之不及。 如此行半日而常相去．一里许，不可及，乃各罢还。 子训既少君乡里弟子，微密谨慎，思证道奥，随＇侍明匠，将足甄综众妙矣。 王真字叔坚，上党人也。 少为郡吏，年七十乃好道。",
      "translated_text": "Later, Ji Zixun realized that managing worldly affairs and holding office brought no benefit to one’s lifespan. He then studied medicine and healing arts under Shaojun. Over time, he witnessed Shaojun’s attainment of the Dao of immortality. Thereupon, he served Shaojun with the reverence due a master. Shaojun, seeing Zixun’s wholehearted devotion and recognizing his potential for accomplishment, gradually revealed to him the affairs of the Daoist school. He taught him the methods of *embryonic breathing*, *embryonic ingestion*, *abiding in years*, and *halting whiteness*. After practicing these for over two hundred years, Zixun’s complexion remained youthful.\n\nIn his hometown, he conducted himself with sincerity and deference toward others. Fond of tranquility, he often secluded himself to study the *Book of Changes* and occasionally composed short essays, all imbued with meaning. Later, Shaojun also transmitted to Zixun the great arts of transformation of Master Wuchangzi. When applied, these arts invariably proved effective.\n\nOnce, he saw a neighbor holding a child and asked to hold it. His grip slipped, and the child fell to the ground and died. The family, who had always held him in high regard, dared not show grief and buried the child, saying it was not fated to live. Days passed, and they gradually ceased thinking of it. Zixun then returned from outside, carrying the child back to the family. The family, fearing it was a ghost, begged him not to trouble them further. Zixun said, “Take the child—it feels no pain. It is truly yours.” The child recognized its mother, laughing and reaching for her. The mother took the child, though still uncertain. After Zixun departed, the father returned and together they dug up the grave. In the coffin, they found only a clay figurine of a child, about six inches long. The child then grew to maturity.\n\nMoreover, when elderly people with entirely white hair sat with Zixun and conversed, by the next morning their hair would turn black—though he had done nothing to effect this. The blackening could be expected to last a year and two hundred days. There were also cases where he did not cause hair to turn black, for these were the greatest transformations of his divine arts.\n\nWhen the nobles of the capital heard of this, none failed to earnestly desire an audience with Zixun, yet none could secure his presence. Zixun had lived in the capital for some years when a young man from his neighborhood became a student at the Imperial Academy. The nobles summoned the student and said to him, “You toil over your studies in hopes of passing the examinations and attaining wealth and rank. If you can bring Ji Zixun to us, we will ensure your success without effort.” The student agreed and returned home to serve Zixun, sweeping and cleaning for him morning and evening, standing by his side in attendance. This continued for nearly two hundred days.\n\nZixun said to the student, “You are no Daoist practitioner—how can you endure this?” The student replied, “Though I am but a humble man from our village, the way of respect between elder and younger demands no less.” Zixun said, “Why feign sincerity when your motives are false? I know full well your intent: the nobles wish to see me. Why should I begrudge the effort of a single journey and deny you honor and position?” He then instructed the student, “Return and tell them I will come on such-and-such a day.”\n\nOverjoyed, the student went to the capital and relayed this to the nobles. On the appointed day, Zixun had not yet set out. The student’s parents grew anxious and went to check on their son. Zixun mocked them, “Do you fear I will not go? To keep your son’s word, I shall depart.” He left his residence at mealtime. The student’s parents said to each other, “Though Ji has not arrived on time, he is surely on his way.” The student returned home the next day and calculated the distance. Zixun had reached the capital by midday—impossible for an ordinary man to cover over a thousand *li* in half a day.\n\nUpon arrival, the student went to see Zixun. Zixun asked, “Who wishes to see me?” The student replied, “Many wish to see you, Master. I dare not trouble you, but if I may know your whereabouts, they will come to you.” Zixun said, “There is no need for them to come. I have traveled over a thousand *li*—why should I now haggle with them over such matters? Today, have each of them dismiss their guests. I will arrive at midday and choose where to go first.”\n\nThe student relayed this to the nobles, who each prepared their homes. At midday, Zixun visited twenty-three households, yet there were twenty-three Zixuns, each appearing at a different place. The nobles were all delighted, each believing Zixun had come to them first. The next day, when they compared notes, they found that at the same time, each had hosted a Zixun—identical in clothing and appearance, yet their conversations varied according to each host’s questions.\n\nEach household prepared wine and food to entertain Zixun, and he accepted their hospitality with full courtesy. The news spread far and wide, and the nobles all wished to visit him. Zixun said to the student, “They believe I must have extraordinary eyes and a radiant countenance, which is why they seek me. But I have nothing to teach. I will not go again.” With that, he departed.\n\nAs he left, the nobles’ carriages and retinues clogged the road. When they reached his door, the student said, “He just left, heading east. The one riding the blue mule is he.” They all galloped after him, but though they saw the mule ambling along, their horses could not catch up. After half a day’s pursuit, they remained about a *li* behind, unable to close the distance, and so they gave up and returned.\n\nZixun, being a fellow townsman and disciple of Shaojun, was discreet and meticulous, deeply pondering the profound mysteries of the Dao. Following and serving a master of illumination, he was on the verge of synthesizing the myriad wonders.\n\nWang Zhen, styled Shujian, was a native of Shangdang. In his youth, he served as a minor official in his commandery. At seventy, he took up the study of the Dao.",
      "overlap_context": "an Shiyuan of Henei.\n\nEarlier, Yan had received Shaojun’s teachings and first transmitted the *Spirit-Flight Arts* to Ji Zixun, who also received the *Divine Elixir Canon*. Ji Liao, styled Zixun, was a native of Linzi in the Qi state and a townsman of Li Shaojun. In his youth, he served in local and provincial offices, was nominated as a *Filial and Incorrupt* candidate, and appointed Gentleman of the Palace. Later, he joined the military and was enfeoffed as Commandant of the Imperial Carriage.",
      "start_char": 5193,
      "end_char": 6334,
      "start_sentence": 240,
      "end_sentence": 292,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.504377841949463,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝外传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "寻见仙经杂言，说郊问人者，周宣王时郊问采薪之人也，采薪而行歌日：巾金巾，入天门，呼长精，嗡玄泉，呜天鼓，养泥丸。 时人莫能知，唯柱下史曰：此是活国中人，其语秘矣。 其人乃古之渔父也。 何以知之？ 八百岁人，目瞳正方，千岁人，目理纵采。 薪者乃千岁之人也。 真读此书而不解其旨，遂搜问诸所在道士，经年而遇有解其旨者，语真曰：此近浅之术也，为可住年反白而已耳。 乃语诀云：巾金巾者，恒存肺气入泥丸中，徐徐以绕身，身常光泽。 嗡玄泉者，漱其口液而服之，使人不老。 行之七日，有效。 呜天鼓者，朝起常叩齿三十六下，使身神安。 又夜怛存赤气，从天门入，周身内外，在脑中变为火，以墦身，身与火同光。 如此存之，亦名曰炼形。 泥丸，脑也。 天门，口也。 习闭气而吞之，名日胎息。 习漱舌下泉而咽之，名曰．胎食。 行之勿休也。 真受诀，施行胎息、胎食、炼形之方，甚有验。 断谷二百余年，肉色充美，徐行及马，力兼数人。 自叹日：我行此术唯可不死，岂及神丹金玉之方邪？ 乃师事蓟子训，子训授其肘后方也。 魏武帝闻之，呼与相见。 见似年可三十许，意嫌其虚诈，定校其乡里，皆异口同辞，多有少小见真者，乃信其有道，甚敬重之。 部孟节师事真十数年，真以蒸丹、小饵法授孟节，得度世。 乡里计真已四百岁。 后一旦将三少妾登女几山，语弟子言合丹去，遂不复还。 真一日行三百里。 孟节能含枣核以不食，至十年又能闭气不息，身不动摇，若死人，可至百日、半岁。 亦有家室。 此法是真所习郊间人之法也。 孟节为人质谨不妄言，魏武帝为立茅舍，使领诸方士。 晋惠、怀之际，人故有见孟节在长安市中者。 魏武帝时亦善招求诸方术道士，皆虚心待之，但诸得道者，莫肯告之以要言耳。 刘京字太玄，南阳人也，汉孝文皇帝侍郎也。 后弃世从那鄂张君学道，受饵朱英丸方，合服之，百三十岁，视之如三十许人。 后师事蓟子训。 子训授京五帝灵飞六甲十二事、神仙十洲真形、诸秘要，京按诀行之，甚效。 能役使鬼神，立起风雨，召致行厨，坐在立亡。 而知人吉凶期日，又能为人祭天益命，或得十年，到期皆死。 其不信者，至期亦死。 周流名山五岳，与王真俱行悉遍也。 魏武帝时故游行诸弟子家，皇甫隆闻其有道，乃随事之。 以云母九子丸及交接之道二方教隆，隆按合行服之，色理日少，发不白，齿不落，年三百余岁，不知能得度世不耳？ 魏黄初三年，京人衡山中去，遂不复见。 京语皇甫隆日：治身之要，当朝朝服玉泉，使人丁壮，有颜色，去三虫而坚齿也。 玉泉者，口中液也。 朝未起，早漱液，满口乃吞之。 琢齿二七过，如此者三，乃止，名日炼精，使人长生也。 夫交接之道至难，非上士不能行之。 乘奔牛惊马，未足谕其睑坠矣。 卿性多淫，得无当用此自戒乎？ 如京言，虑隆不得度世也。 汉武帝外传竟",
      "translated_text": "Seeking out various immortal scriptures and miscellaneous writings, he came upon an account of the Woodcutter of the Suburbs, a man of the suburbs during the reign of King Xuan of Zhou. As he gathered firewood, he sang this song:\n\n*\"Wrap in golden cloth,\nEnter the Gate of Heaven,\nCall the Long Spirit,\nChant to the Dark Spring,\nDrum the Celestial Drum,\nNurture the Muddy Pellet.\"*\n\nNone of the people of his time could understand it, save the Archivist beneath the Pillars, who said: \"This is a man who dwells within the living kingdom; his words are profound and hidden.\" The woodcutter was in truth an ancient fisherman.\n\nHow is this known? One who has lived eight hundred years has square pupils; one who has lived a thousand years has pupils with vertical patterns. The woodcutter was a man of a thousand years.\n\nZhen read this passage but could not fathom its meaning. He searched far and wide among Daoist masters, and after a year, he encountered one who could explain it. The master said to him: \"This is but a shallow art, sufficient only to prolong life and restore youth.\" He then revealed the secret method:\n\n*\"Wrap in golden cloth\"* means to constantly guide the qi of the lungs into the Muddy Pellet, circulating it slowly around the body, so that the body remains radiant and lustrous.\n\n*\"Chant to the Dark Spring\"* means to rinse the mouth with saliva and swallow it, which prevents aging. Practicing this for seven days yields results.\n\n*\"Drum the Celestial Drum\"* means to tap the teeth thirty-six times each morning upon rising, which calms the spirits of the body.\n\nAt night, one must visualize a crimson qi entering through the Gate of Heaven, suffusing the body inside and out. Within the brain, it transforms into fire, refining the body until it shines with the same light as the fire. This visualization is called *\"refining the form.\"*\n\nThe Muddy Pellet is the brain; the Gate of Heaven is the mouth. Practicing breath-holding and swallowing is called *\"embryonic breathing.\"* Swishing the spring beneath the tongue and swallowing it is called *\"embryonic nourishment.\"* These practices must never cease.\n\nZhen received the method and diligently practiced embryonic breathing, embryonic nourishment, and the refinement of the form. The results were remarkable. He abstained from grains for over two hundred years, yet his complexion remained full and fair. He could walk at a leisurely pace and keep up with a galloping horse, and his strength equaled that of several men. He sighed and said: \"Though this art may keep me from death, how can it compare to the methods of divine elixirs, gold, and jade?\"\n\nHe then became a disciple of Ji Zixun, who taught him the *\"Prescriptions Behind the Elbow.\"* When Emperor Wu of Wei heard of him, he summoned Zhen for an audience. The emperor saw that he appeared no older than thirty and suspected deception. He verified his origins with his fellow townsmen, who all spoke with one voice—many had known Zhen since their youth. Convinced of his mastery of the Dao, the emperor held him in great esteem.\n\nBu Mengjie became Zhen’s disciple for over a decade. Zhen taught him the methods of steaming cinnabar and minor elixirs, enabling him to transcend the mortal world. His hometown reckoned that Zhen had lived four hundred years. One day, he ascended Mount Nüji with three young concubines and told his disciples he was going to compound the elixir. He never returned.\n\nZhen could walk three hundred *li* in a single day. Mengjie could sustain himself by holding a date pit in his mouth without eating, and after ten years, he could hold his breath without exhaling, remaining motionless like a corpse for a hundred days or even half a year. He also had a family. This method was the same as that practiced by the Woodcutter of the Suburbs.\n\nMengjie was a man of integrity, cautious and sparing with his words. Emperor Wu of Wei built him a thatched cottage and appointed him to oversee all masters of esoteric arts. During the reigns of Emperors Hui and Huai of Jin, there were still reports of Mengjie being seen in the markets of Chang’an.\n\nEmperor Wu of Wei was also diligent in seeking out masters of esoteric arts and Daoist practitioners, receiving them with an open mind. Yet none of those who had attained the Dao were willing to reveal their essential teachings.\n\nLiu Jing, styled Taixuan, was a native of Nanyang and had served as a Gentleman-in-Attendance to Emperor Wen of Han. Later, he abandoned worldly life to study the Dao under Zhang Jun of E, receiving the method of the *\"Cinnabar-Essence Pill.\"* After compounding and consuming it, he lived to one hundred thirty years, yet appeared no older than thirty. He later became a disciple of Ji Zixun, who taught him the *\"Five Emperors’ Numinous Flight of the Six Jia and Twelve Arts,\"* the *\"True Forms of the Ten Divine Isles,\"* and other secret essentials. Jing practiced these methods according to the instructions, and they proved highly effective. He could command ghosts and spirits, summon wind and rain, conjure traveling kitchens, and sit or stand at will. He could also foretell the fortunes and lifespans of others, and perform rituals to extend their lives by ten years—those who died at the appointed time had all been fated to do so. Even those who did not believe him would die at the predicted time.\n\nJing wandered among the famous mountains and the Five Peaks, traveling alongside Wang Zhen until they had visited them all. During the reign of Emperor Wu of Wei, he still visited the homes of his disciples. Huangfu Long, hearing of his mastery of the Dao, became his follower. Jing taught him the *\"Ninefold Cloud-Mother Pill\"* and two methods of *\"the Way of Union.\"* Long practiced and consumed them according to the instructions, and his complexion and vitality grew ever more youthful. His hair did not turn white, nor did his teeth fall out. Though he lived over three hundred years, it was unclear whether he had achieved transcendence.\n\nIn the third year of the Huangchu era of Wei, Jing entered Mount Heng and was never seen again. He told Huangfu Long: \"The essentials of cultivating the body lie in swallowing the Jade Spring every morning, which strengthens the body, enhances one’s complexion, expels the Three Worms, and fortifies the teeth. The Jade Spring is the saliva in the mouth. Before rising in the morning, rinse the mouth with saliva until it fills, then swallow it. Tap the teeth thirty-four times, repeating this three times before stopping. This is called *refining the essence* and grants longevity.\n\nThe Way of Union is most difficult; only superior gentlemen can practice it. It is as perilous as riding a galloping ox or a startled horse. Your nature is prone to excess—might this serve as a warning for you?\" Jing feared that Long would not achieve transcendence.\n\nHere ends the *Outer Traditions of Emperor Wu of Han.*",
      "overlap_context": "y remained about a *li* behind, unable to close the distance, and so they gave up and returned.\n\nZixun, being a fellow townsman and disciple of Shaojun, was discreet and meticulous, deeply pondering the profound mysteries of the Dao. Following and serving a master of illumination, he was on the verge of synthesizing the myriad wonders.\n\nWang Zhen, styled Shujian, was a native of Shangdang. In his youth, he served as a minor official in his commandery. At seventy, he took up the study of the Dao.",
      "start_char": 6334,
      "end_char": 7429,
      "start_sentence": 293,
      "end_sentence": 346,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.844669580459595,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝外传.txt",
        "category": "记传类"
      }
    }
  ]
}