{
  "source_id": "江淮异人录",
  "source_file": "chunked_daozang\\江淮异人录.json",
  "total_chunks": 21,
  "total_original_chars": 10284,
  "total_translated_chars": 53150,
  "total_translation_time": 272.71859884262085,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
    "category": "记传类"
  },
  "full_translation": "**Records of Extraordinary Individuals of the Jiang-Huai Region**\n\n*Scripture Title:* *Records of Extraordinary Individuals of the Jiang-Huai Region*. One fascicle. Base text from the *Daoist Canon of the Zhengtong Era*, *Section of Mysteries*, *Category of Biographies and Accounts*. The *Comprehensive Treatises* records *Records of Extraordinary Individuals of the Jiang-Huai Region* in three fascicles, attributed to Wu Shu of the Song dynasty. The *History of the Song Dynasty: Biography of Wu Shu* likewise states that Wu Shu authored *Records of Extraordinary Individuals of the Jiang-Huai Region* in three fascicles. Thus, Wu Shu is confirmed as the author of this work.\n\n---\n\n**Sima Jiao**\n\nSima Jiao, also named Ningzheng, and alternatively Shouzhong, wandered through the Jiangnan region. He often wore a hempen cap and coarse cloth, walking in wooden clogs, covering a thousand *li* or more in a day. His garments, though made of coarse cloth, remained perpetually new. His conduct was fierce and abrupt, and none dared approach him. He could feign death, his body turning green and swollen, reeking of decay, only to revive shortly after.\n\nOnce, he stayed at the Kaiyuan Abbey in Xuanzhou. From Xuanzhou to Shezhou, the Daoist Shaoxiu Mo was also traveling to Shezhou. At the city gate, he encountered Sima Jiao and walked alongside him. Shaoxiu Mo, seeking to avoid him, arrived first at a garrison town and rested at an inn. Sima Jiao soon followed. Shaoxiu Mo concealed himself and observed secretly. He saw Sima Jiao enter another shop, summon the innkeeper, and drink with him, only to humiliate the man. The innkeeper initially showed respect and apologized, but Sima Jiao persisted, striking him. They grappled, and Sima Jiao suddenly collapsed to the ground, appearing dead—his body cold, his complexion altered. The entire market gathered to watch. The townspeople were summoned, the innkeeper bound, and the corpse examined for evidence. They prepared to send him to the prefecture, but as evening approached, they decided to wait until the next day.\n\nAt midnight, clamor arose from the inn: \"The Venerable Master Sima has vanished!\" Only then did the people realize he had feigned death and released the innkeeper. The next day, Shaoxiu Mo set out at dawn. After traveling about a hundred *li*, he asked someone, \"When did the Venerable Master Sima pass through here?\" The reply: \"He passed early this morning.\" The following day, after another hundred *li*, he asked again, and was told, \"He passed early yesterday.\" Upon reaching Shezhou, the answer was the same.\n\nWhenever he traveled among the prefectures along the upper Yangtze, he would stay at an inn for an extended period. Before departing, he would tell the innkeeper, \"I cannot take my bamboo utensils with me. Fetch fire to burn them.\" The innkeeper protested, \"The wind is strong, and the bamboo hut is low and cramped—fire cannot be lit here.\" Sima Jiao insisted, and though the crowd knelt and pleaded, he refused to listen. He set fire to the room and stood at the door with a large staff, striking anyone who dared approach. He was strong, and none dared draw near. Soon, the flames raged, shooting through the gaps in the bamboo roof, and the onlookers panicked. When the fire subsided, all of Sima Jiao’s belongings were consumed, the outer bedding scorched, yet the straw mat and bedding beneath remained unburned.\n\nThere was a man named Zhu Ao, a legal officer in Chizhou. Sima Jiao visited him and said, \"Your complexion is grim—you will fall ill. When I leave, if you think of me during your illness or call my name, I may respond.\" Zhu Ao did not believe him. More than ten days later, he indeed fell gravely ill with a fever. After several days, his condition worsened. Suddenly recalling Sima Jiao’s words, he revered him as a divine being and bowed in prayer, seeking his aid.\n\nAt first, Zhu Ao’s illness was severe, and he saw a figure before him—a minor clerk named Chen, who often attended to his needs. He ordered Chen to enter the room and tend to him, but then angrily dismissed him. His family stood guard outside, allowing no one to enter. Yet, in his delirium, Zhu Ao saw Chen holding a bowl of medicine and offering it to him. He drank it and immediately felt his mind clear and his body ease. He called to his family, \"The medicine Chen just brought is most effective—have him bring another dose.\" His family was astonished: \"We did not let anyone enter, how could Chen have come?\" Zhu Ao then realized it was Sima Jiao’s divine assistance. From then on, his illness gradually improved.\n\nSima Jiao once resided at a certain abbey in Shezhou. Stricken with severe dysentery, the abbey’s master wished to report his condition to the authorities and first informed Sima Jiao of his intent. Enraged, Sima Jiao said, \"My illness is nearly cured—why trouble yourself so?\" As his condition worsened, the abbey master had no choice but to report it to the county magistrate, Yao Yun. Yao Yun sent someone to inquire after him. Sima Jiao asked, \"Why does Magistrate Yao know of my illness?\" When the messenger relayed this, Sima Jiao grew furious. Suddenly, he rose, dressed himself, and strode directly into a mountain, moving as swiftly as if he were flying.\n\nMore than ten days later, Sima Jiao returned wielding a large staff, demanding to see the abbey master and threatening to strike him. The Daoist priests of the abbey all bowed and pleaded for mercy, and only then was he spared.\n\nOnce, he went to the market in Hongzhou to buy fresh food. The children in the market called out, \"Daoist eating fresh!\" Enraged, Sima Jiao hurled something at one of the children, drawing blood. The patrolmen seized him and brought him before the military prefect, who, knowing his reputation, gently tried to persuade him. Sima Jiao, however, railed at him furiously. Unable to contain his anger, the prefect had him caned ten times. Sima Jiao said to others, \"If he had struck me fifteen times, I could have lived fifteen more days. Ten strokes mean I shall die in ten days.\" And so it came to pass.\n\nLater, he entered Mount Lu and resided at the Abbey of Simplicity and Silence. There, after drinking himself into a stupor, he lay unconscious for several days before passing away. Before his death, he instructed that a staff be placed in his coffin. When the coffin was later opened, it was found empty—only the staff remained.\n\n---\n\n**Qian the Recluse**\n\nToward the end of the Tianyou era, Qian the Recluse traveled through Jianghuai and once stayed at the home of a certain Yang in Jinling. Earlier, when the Wu dynasty had established Jinling as a prefectural seat, it built a city wall that extended westward into the river and eastward to Chaogou. Qian pointed to a stretch of over a *li* of overgrown and desolate land west of the city and urged Yang to buy it. Yang followed his advice. When the city later became the imperial capital, the land Yang had purchased lay at the heart of the bustling metropolis. There, he constructed a multi-story building and opened a tavern.\n\nOnce, while staying at Yang’s home, Qian suddenly rose in the middle of the night and said to those around him, \"The clamor of troops and horses beneath the earth is deafening—they say they are here to receive the Lord Commander, and their noise keeps me from sleeping.\" No one could fathom his meaning. The next day, Yizu arrived in Jinling from Jingkou, though no one had foreseen his coming.\n\nOn another occasion, Qian saw a man and said to him, \"Heaven’s punishment is about to befall you. You must hasten to repent and take responsibility.\" The man replied, \"I cannot recall any wrongdoing.\" Qian said, \"Reflect deeply.\" After a long while, the man said, \"Yesterday, I was displeased with my meal and, in anger, threw it into the ditch.\" Qian said, \"That is precisely the offense. Retrieve what you discarded at once.\" The man fetched the food and was about to rinse away the filth with water when suddenly thunder and lightning crashed violently. Qian said, \"Quickly, eat the spoiled food.\" The man did as instructed, and the thunder and lightning ceased.\n\nSomeone once painted a portrait of Qian. Upon seeing it, he remarked, \"I am not as composed as this—yet I stand before the sages.\" No one understood his meaning. Later, a monk took the portrait and placed it in the pagoda of Master Zhi. People considered this fitting. Later still, Liezu retrieved the portrait and brought it into the palace, where it was displayed in the inner chambers.\n\nQian also frequently uttered prophecies, foretelling future events. Regarding the fate of the Li dynasty, he said, \"Between the topknot and the beard, one Yang shall double.\" The Wu dynasty had ruled the lands south of the Yangtze for forty-six years, while the Li dynasty reigned for thirty-nine. Some said that the Yang referred to the Yang family, who had proclaimed themselves sovereign and ruled for twenty years before abdicating—thus, the \"topknot\" (Li) was indeed doubled by the \"beard\" (Yang).\n\n---\n\n**Nie Shidao**\n\nNie Shidao, a native of Shezhou, developed an affinity for the Dao in his youth. At the end of the Tang dynasty, Yu Tao served as prefect of Shezhou. His elder brother, Fangwai, was a Daoist priest who lived in the mountains south of the prefecture. Shidao went to study under him. Tao often visited Fangwai, and on matters of governance, he consulted him as well. Thus, the mountain was named Mount Inquiry.\n\nDuring the Wu dynasty, because Shidao had once resided there, he was given the title \"Master of Inquiry.\"\n\nInitially, when Fangwai lived in the mountains, few in the prefecture believed in or supported him. After Shidao arrived, however, the number of devotees increased daily, and the abbey grew prosperous.\n\nOnce, Shidao was traveling with a friend when they stopped at an inn. The friend fell ill with a fever, and the village had no medicine. Someone suggested to the sick man, \"If you can eat something unclean, it may cure you.\" As his condition worsened, they urged him again, but the man hesitated. Shidao said to him, \"The situation is dire—what is there to hesitate about? I will taste it first for you.\" He then took some and ate it. Moved by his sincerity, the man ate as well, and his illness was cured.\n\nLater, when Pei Shu, the Vice Director of the Department of State Affairs, was serving as prefect of Shezhou, the Tang dynasty was nearing its end, and imperial decrees no longer reached the region. Tian Jun of Xuanzhou and Tao Ya of Chizhou raised troops and besieged the city for months. The people of Shezhou repeatedly repelled them. When supplies ran out and reinforcements failed to arrive, the city’s leaders discussed surrender. Yet, as the defenders had already killed many of the besiegers, no one dared to venture out as an envoy. Shidao then volunteered to go. Shu said, \"You are a Daoist priest—how can you traverse a battlefield?\" He urged Shidao to change his clothes. Shidao replied, \"I have received the precepts of the Dao—it is not permissible to alter my attire.\" He then left the city under a banner of truce.\n\nAt first, the two commanders were astonished, but after speaking with him, they were overjoyed, saying, \"A true Daoist priest!\" They swore an oath and sent him back to the city. When the appointed time arrived, Shu had not yet completed his preparations and sought to delay. He sent Shidao out again to negotiate. People feared his vacillation and considered his mission perilous, but Shidao showed no hesitation. When he met the two commanders again, they said, \"There is no objection—only await the Vice Director’s command.\" Thus, the people of the city were spared, thanks to Shidao’s efforts.\n\nWhen Emperor Taizu of Wu heard of his reputation, he summoned him to Guangling and built the Purple Ultimate Abbey for him to reside in. One night, a thief broke into his quarters and took all his belongings, even his household utensils. Shidao said to him, \"You steal to relieve hunger and cold—what use will these things be to you?\" He then led the thief into a secluded chamber, gave him all his gold and silk, and said, \"Leave through the back—avoid the patrols, and you will come to no harm.\" The thief followed his instructions and escaped unscathed.\n\nLater, the Wu court sent Shidao to Mount Longhu to perform a grand ritual. On the way, he was ambushed by bandits who intended to kill him. One of them, however, stared at Shidao and said to his companions, \"Do not harm this master.\" He ordered that all the stolen goods be returned. The bandits complied. Then he said to Shidao, \"I am the thief who once robbed you at the Purple Ultimate Abbey in Yangzhou.\"\n\nMoved by the master’s boundless benevolence, he repaid the kindness in this way. Later, Shidao passed away in Guangling.\n\nAt the time, an envoy was being dispatched to Hunan and Hubei. On his return journey, he encountered Shidao at a certain place and asked, \"How have you come here?\" Shidao replied, \"The court sent me to perform a ritual at Mount Heng.\" The envoy accepted this. Only upon entering Wu territory did he learn that Shidao had already died.\n\nShidao’s grandnephew, Shaoyuan, entered the Dao in his youth. His demeanor was gentle and refined, and he was skilled in composition. He died at just over twenty years of age. Earlier, when Shaoyuan’s illness grew severe, four cranes alighted on the roof of his dwelling. Upon his death, people saw five cranes soar into the sky and vanish.\n\nYu Da resided in the Western Mountains of Hongzhou. He lived beyond the constraints of the four seasons, always holding flowers and avoiding close contact with others. Once, he visited the Ying Sheng Abbey and placed flowers before the Daoist statue. A Daoist prepared tea and set it on the dining table. Only after others had withdrawn did Yu Da approach to drink. After finishing, he placed the teacup back on the table, bowed deeply, and departed. If someone bowed to him, he would return the gesture—but he never spoke.\n\nA young man fond of the Dao wished to become his disciple but could not succeed. One day, the youth bowed and said, \"I wish to serve you, Master.\" Yu Da fled without looking back. The youth pursued him, seizing his robe, and Yu Da could not shake him off. They climbed mountains and crossed streams without pause. Finally, Yu Da sat by a stream and asked the youth, \"Are you thirsty?\" The youth replied, \"Yes.\" Yu Da took something like tea powder from his sleeve and said, \"Place this in your mouth and scoop water to swallow it.\" The youth did as instructed. Soon after, he fell asleep, and upon waking, Yu Da was gone.\n\nLi Mengfu often wandered the markets and streets of Hongzhou.\n\nAged around twenty, he was short and fair, his beauty as refined as jade. Indulging in unbridled freedom, he adorned his hair with flowers in all seasons, wandering through the taverns of the city, singing loudly and drinking to intoxication. Those fond of novelty often invited him to drink, and if asked to compose lyrics, he would improvise on the spot—never giving it a second thought, yet each piece carried its own charm.\n\nWhen Zhong Chuan governed Hongzhou, he deemed Mengfu’s wild and misleading behavior punishable. From prison, Mengfu presented over ten poems, one of which read: *\"Drinking with flowers in my hair—what harm is there? / Woodcutters’ chants and fishermen’s songs—what time do they impair?\"* In the end, Zhong did not punish him.\n\nLater, Li Qiong, the prefect of Guizhou, sent an envoy to Hongzhou, claiming Mengfu was his younger brother and requesting his return. Zhong ordered a search among the city’s inns, but the people said, *\"Mengfu did not return last night.\"* From then on, his whereabouts remained unknown.\n\n---\n\n**Liu Tonggui**\n\nLiu Tonggui lived in Hongzhou and lodged in the house of the Ai family. The household consisted only of an old man and his wife. Each morning, he carried a basket of mushrooms to sell, returning drunk by evening. Over time, neighbors grew suspicious. One night, they bored a hole in the wall to spy on him and saw him take out a jar of soil, sprinkle it with water, and soon mushrooms sprouted. By dawn, he harvested them.\n\nLater, the old man fell ill and told his wife, *\"When I die, place a staff in my coffin.\"* After his death, they followed his instructions. At first, when the coffin was lifted, it felt heavy. But halfway to the burial site, it grew as light as if empty. They opened it to find only the staff inside.\n\n---\n\n**Master Geng**\n\nMaster Geng was the daughter of Geng Qian, a military officer from Jiangbiao. From childhood, she was bright and quick-witted, with a graceful appearance. Fond of books, she occasionally composed poetry, often imbued with fine meaning.\n\nMaster Geng was well-versed in the Daoist arts and could restrain ghosts and spirits. Proficient in the alchemy of yellow and white and matters of strange transformations, her marvels and illusions were so wondrous that none knew their origin. During the Baoda era, when Jianghuai flourished in wealth, the emperor, fond of literature and enamored with the extraordinary, summoned her to the palace to further observe her arts. He did not treat her as one of the ranked courtiers but instead lodged her in a separate residence, addressing her as \"Master.\" Clad in green-tinged rosy clouds, she often appeared before the emperor holding a tablet, her spirit radiant and transcendent, her words clear and flowing. Her hands resembled a crow’s talons, rendering them useless for tasks, so she relied on others for eating and drinking. Disliking walking, the palace attendants often carried her. Whenever she composed poetry, she would inscribe it on the walls, signing herself as \"Master of the Northern Greatness,\" though none understood its meaning. Her guard was not constant, yet her presence was outwardly resplendent; when called upon, she responded with a brilliance both subtle and manifest. The emperor thus held her in even higher regard.\n\nWhen she first entered the palace, the emperor questioned her about alchemical arts, testing her with trials that all proved true. Thereafter, she performed them with even greater ease and simplicity. Once, during a moment of leisure, the emperor remarked to her in advance: \"All these rely on fire to achieve their transformation. Without fire, could they still be done?\" The Master replied: \"Let me attempt it—perhaps it is possible.\" The emperor then took mercury, wrapping it in layer upon layer of paper, sealing it tightly. The Master placed it in her bosom, and after a long while, a sound like tearing silk suddenly arose. Smiling, she said: \"Your Majesty has never believed in my humble arts—today, witnessing it with your own eyes, can you still doubt?\" She took it out and presented it to the emperor. He examined it closely; the seal remained unchanged. When opened, it had turned to silver.\n\nAnother time, during a heavy snowfall, the emperor teased her: \"Can you turn this snow into silver?\" The Master replied: \"It can be done.\" She gathered the snow, packing it tightly, and carved it into the shape of a silver ingot. Then, with her own hands, she cast it into glowing coals. Ash and embers billowed up as she slowly covered it with more charcoal. After the time it takes to eat a meal, she declared: \"It is ready.\" She retrieved it, glowing a brilliant red. Placed upon the ground, as it cooled, it gleamed as a solid silver ingot, its edges and markings intact. Beneath it, the residue resembled dripping lard or trickling milk—this was the snow melted by the fire’s heat. From then on, the Master crafted many such \"snow silvers.\" On the emperor’s birthday, she would fashion vessels and utensils from them as tribute for his longevity.\n\nShe was also full of ingenious ideas, her creations always surpassing those of others. Once, the Southern Sea presented rare treasures: rosewater and dragon-brain nectar. The rosewater was clear yet intensely fragrant, while the dragon-brain nectar strengthened men’s vitality. The emperor treasured them, often mixing the nectar with wine to drink, its fragrance lingering in his mouth for days. He also bestowed some upon his favored ministers. The Master remarked: \"These are not yet the finest.\"\n\nThe emperor asked, \"Can you refine these as well?\"\nShe replied, \"Let me try—it should succeed.\"\nShe took the dragon-brain nectar, placed it in a fine silk pouch, and suspended it within a crystal bottle. The emperor personally sealed it, set wine beside it, and watched. After the time it takes to eat a meal, the Master said, \"The dragon-brain has turned to liquid.\" The emperor rose and pressed his ear close—indeed, he heard the sound of dripping. They drank again, and after a short while, she showed him the bottle: it was now filled with liquid as clear as a ladle of water. The next day, they opened it to find half a bottle full, its fragrance far more potent than before.\n\nLater, the Master conceived. One day, she told the emperor, \"Tonight, I shall give birth. The divine grandson, the sagely child, is truly within me. Please prepare all that is needed for the delivery.\" The emperor arranged everything and ordered palace women to stay with her through the night. At midnight, a violent wind and thunder shook the halls, terrifying all inside. Yet that night, she did not give birth. By dawn, her belly had returned to its usual size. The emperor, astonished, asked what had happened. She said, \"Last night, amid the thunder and lightning, I bore a child—only for a divine being to take him away. He is lost to us now.\"\n\nThe Master loved wine, and her desires for men and women differed little from those of ordinary people. Later, she too died of illness. In ancient times, immortals often concealed their traces among the common folk—was she one of them?\n\nWhen I was once in Jiangnan, I often heard tales of her, though the secrets of the palace were recounted with many variations. After Jiangnan was pacified, I was in the capital and visited Xu Shugeng, who was the grandson of Yi Zu. He knew all the affairs of the palace. I questioned him about these events, and he told me the full account.\n\n---\nPan Yi was the son of Pan Peng, a judicial assessor of the Court of Judicial Review. In his youth, he lived in Hezhou, gathering firewood on Yinglong Mountain to support his parents. Once, he crossed the river to Jinling and moored his boat at the mouth of the Qinhuai.\n\nAn old man once asked to share his boat to cross the river, and Yi, respecting his age, agreed. At the time, a heavy snow was falling, so Yi bought wine for them to drink together. By the time they reached the middle of the river, the wine had run out. Yi deeply regretted not having brought enough to get drunk. The old man said, \"I too have wine.\" He then untied his headscarf, took a small gourd from his topknot, and poured from it—no matter how much they drank, the wine never ran dry. Yi was astonished and held him in even greater reverence. Upon reaching the shore, the old man said to Yi, \"You are filial in serving your parents and also possess the qi of the Dao—you are teachable.\" He then imparted Daoist arts to him. From then on, Yi’s actions became uncanny, and the world called him Immortal Pan. He could scoop mercury into his hands, and when he pressed it, it would turn to silver. Once, entering a household, he saw a pond with many fallen leaves and said to the owner, \"These can be made into a game.\" He had someone scoop them up with a utensil and place them on the ground; as the leaves varied in size, they all turned into fish. When thrown back into the water, the leaves returned to their original state.\n\nThere was a man named Ji Liang who often visited the home of a relative. One day, several guests were seated together when they saw Yi passing by the door. The host called him in, and he entered. Ji then said to Yi, \"Master, please perform a trick to entertain the guests.\" Yi replied, \"Very well.\" Glancing at an iron anvil before the door, he said to the host, \"Lend me this anvil for a game.\" Once it was brought in, Yi took out a small knife and finely chopped it until it was completely minced. The seated guests were stunned. Then Yi said, \"One should not damage borrowed things.\" He gathered the pieces together, and the anvil was restored as before. He also took out an old square kerchief from his sleeve and said to the others, \"Do not underestimate this—unless someone is in dire need, do not borrow it from me. Others simply cannot obtain it.\" He then raised it to cover his face and took several steps backward, vanishing from sight.\n\nHe could recite from memory books he had never seen before. Sometimes a sealed scroll would be placed before him, and upon being given the first character, he would recite the entire volume without error. Even corrections, deletions, or emendations within the text—he knew them all. Many of his feats were of this kind, but they cannot all be recorded here. Later, he too died of illness.\n\nA Recluse of Runzhou\nA recluse of Runzhou, whose name is lost, was lofty in conduct and possessed the Dao/Way. The people all respected and trusted him. When An Renyi rebelled, the people of the prefecture were terrified and all wished to flee. Someone said, \"The recluse remains here in tranquility—surely there will be no harm.\" Thereupon, the people gradually settled. The recluse had a close friend who took his family beyond the prefectural borders to avoid the disaster. His friend had a daughter who was already married and could not accompany them, so he entrusted her to the recluse. The recluse agreed.\n\nLater, as the siege grew urgent, the recluse said to the woman, \"Bring me one item from your household, and I will enable you to escape danger.\" She then fetched a knife from her home and brought it to him. The recluse pressed his hand along the edge of the blade, then returned it to her, saying, \"Simply hold this, standing upright and composed. When troops emerge from the city, follow them out, and you will come to no harm.\" She did as instructed, and though she was among a vast crowd, no one saw her. Several dozen *li* beyond the city, at a village inn, she saw her brother, who was also there.\n\nThe woman approached her brother, yet he did not see her. She then cast the knife into the water and returned, whereupon her brother saw her. Startled, he asked, \"How have you come here?\" She recounted all that had occurred. Her brother bade her retrieve the knife and hold it once more, but she could no longer conceal her form.\n\nLater, the city fell, and the recluse’s whereabouts became unknown.\n\nWhen General Zhong Chuan of Hongzhou was stationed there, he once dispatched a subordinate officer, Yan, on a mission to the Zhe region. Arriving in Hangzhou during the Cold Food Festival, Yan saw the townspeople streaming out of the city, men and women thronging the roads. He too went out to observe and saw an elderly couple drinking together in the wilds. Suddenly, the old man rose upon a cloud, and the crowd erupted in clamor. The old woman looked up and wept bitterly, whereupon the cloud descended some dozen *zhang*. The old man reached down to comfort her, then ascended once more, rising until he vanished from sight. The Ai family of Hongzhou, who had known Yan previously, heard this account directly from him.\n\nShi Gonggao was the younger brother of Shi Gongzhu, a great general of Jiangnan. Of a serene and unassuming nature, he delighted in the Dao and was never seen to express joy or anger. If others troubled him, he took no offense.\n\nHaving attained high rank and prosperity, he wore fine and elegant clothing. Yet whenever he visited others’ homes, he would remove his outer garments and sit without regard for the formalities of host and guest. Upon departing, he might mistakenly don another’s worn and shabby clothes, entirely unaware. If someone pursued him with his proper garment, he would only then realize and exchange them.\n\nMinister of Personnel Zhang Han overs\n\nThe scholar Li Sheng once traveled among the Western Mountains of Hongzhou, where he drank with the recluse Lu Qi and five or six companions on a snowy night. During the gathering, one guest remarked, \"With snow like this, surely none can venture out.\" Sheng replied, \"Where would you wish to go? I can journey there.\" The man then said, \"I have books in Xingzi—could you fetch them for me?\" Sheng answered, \"Certainly,\" and departed. Before the drinking ended, he returned bearing the books on his shoulder. Xingzi lay over three hundred *li* from the Western Mountains.\n\nAt the Youwei Abbey, a Daoist priest had once shown Sheng disrespect. Sheng declared, \"I cannot kill him, but I shall make him fear me.\" One day, as the priest slept behind closed doors, Sheng instructed a servant boy to knock and demand Li the Recluse’s dagger. The priest rose to find the dagger plunged into the pillow before him, its blade still quivering. From then on, he changed his ways and treated Sheng with reverence.\n\nIn Jiankang, a destitute man lived outside the eastern altar gate of the city’s outer wall, near the wild waters. He built a small hut, just large enough to shelter himself, containing only a few household utensils and nothing more. Each day, he entered the city, claiming to beg for alms, yet he did not wander the streets or markets but only roamed the temples at leisure. The people came to know him, and the patrol officer reported his case to the throne. The sovereign ordered his origins investigated and his desires questioned. When asked, he sought nothing. It was bitterly cold at the time, and officials were distributing winter robes to the poor. Seeing his extreme thinness, they offered him a lined garment, but he declined. Pressed to accept, he took it only to pass it on to another. Puzzled, the officials followed him, compelling him to move his dwelling to observe his destination.\n\nHe then demolished the hut and moved to the southwest of Xuanwu Lake, within the orchard of the eunuch Zhang Mouguo. The land was overgrown and desolate, with wild waters as before. Again, he built a hut by the water’s edge and dwelt there. For days, heavy snow fell, and the orchard workers saw no sign of his comings or goings, suspecting he had frozen to death. Upon inspection, they found the hut in ruins and declared, “He must be dead.” They reported this to the authorities. When officials arrived to uncover the hut and investigate, they found him soundly asleep in the snow. Startled, he rose, showing no trace of cold. Then he departed, and none knew where he went.\n\nChen Yunsheng\nChen Yunsheng was a native of Raozhou. People called him \"Chen of a Hundred Years.\" From youth, he was quiet and reticent, fond of the Dao. Though his family had long been hunters, Yunsheng alone refused to eat their meat and would not speak with others. At the age of ten, he journeyed to Longhu Mountain to enter the Dao, dwelling in seclusion so deep that few ever saw him. Even when his family caught sight of him, he would flee without a glance back. During the Tianyou era, he was seen on Magu Mountain in Fuzhou. By then, seventy years had passed since he left home, yet his countenance remained as it was in youth. In the Shengyuan era, the prefect Wei Quanfeng, who had heard of his extraordinary nature, welcomed him to the prefectural seat and provided him a chamber of his own. Yet at times, he would vanish without a trace.\n\nOne night as he sat in meditation, Quanfeng said to him, \"The oranges of Fengcheng are most excellent—I find myself longing for them.\" Yunsheng replied, \"There happens to be a boatload of oranges moored at Laocheng Harbor at this moment. I shall fetch them for you.\" The harbor lay fifteen *li* from the city, yet in but a short while he returned, cradling a cloth sack containing several hundred oranges. They ate them together.\n\nOn another occasion, Quanfeng was preparing a wedding gift for a relative and had purchased gold in the prefectural seat, only to find the amount insufficient. He grew angry and berated his subordinates. Yunsheng said, \"Do not be vexed. I can provide what is needed.\" He took thick paper, coated it with an elixir, and cast it into the fire—whereupon it turned to gold. Thus, the need was met.\n\nLater, when Quanfeng went to war against Wu’s forces, Yunsheng departed, warning him, \"Take care not to enter the pass.\" Quanfeng failed to heed the warning and was indeed defeated at Ivory Pool.\n\n---\n\nChen Shu\n\nChen Shu was a Daoist of Shantan Abbey in Xinzhou. People called him \"Chen of a Hundred Years,\" though in truth no one knew his age. He could walk hundreds of *li* in a day. Whenever the gentry of the prefecture held a banquet, they would always leave an empty seat in anticipation of his arrival, and he never failed to appear, no matter the distance.\n\nWhen Emperor Liezu heard of him and summoned him, the messenger had not yet arrived when Shu suddenly sighed, \"I am old—what benefit could I bring to the state, that I should be troubled with this summons?\" Several days later, the messenger arrived. Though summoned a second time, he refused to go.\n\nDuring the Baoda era, he would often burn incense alone in the courtyard at night, gaze heavenward, bow in prayer, then withdraw and weep bitterly. Soon after, warfare erupted along the Huai River, and people believed he had foreseen it. Later, he crossed the Yangtze and took up residence at the abandoned Jingxing Abbey in Yongxing, where he built a hut and lived in solitude. Tigers and leopards often followed him, though few ever saw him. When he died, his body was not encoffined for several days, yet sweat covered him entirely.\n\nZhang Xun’s Wife\n\nZhang Xun was an officer under the Wu Taizu. His mouth was unusually large, earning him the nickname \"Zhang Big-Mouth.\" While the Wu Taizu was stationed in Xuanzhou, he once distributed armor to his generals. The set Zhang received was old and shabby, and his dissatisfaction showed in his words and expression. His wife said to him, \"This is not worth fretting over. The Minister of Instruction is unaware—had he known, he surely would not have given it to you.\" The next day, the Wu Lord asked Zhang, \"How is the armor you received?\" Zhang told him the truth, and the Lord exchanged it for another. Later, when the Wu Lord moved to Guangling, he bestowed horses upon his generals. The one Zhang received was again weak and slow, and he was once more displeased. His wife repeated her earlier advice. The following day, the Wu Lord asked him again, and Zhang spoke as before. The Lord said, \"...Do you worship spirits at home?\" Zhang replied, \"No.\" The Lord said...\n\n\"When I was in Xuanzhou, I once bestowed armor upon my generals. That night, I dreamed of a woman clad in a pearl-embroidered robe, who said to me: 'The armor you gave Zhang Xun is most shabby—you ought to exchange it for him.' When I questioned you the next day, it proved true, and so I replaced it for you. Now, having bestowed horses upon my generals, I dreamed again of that same pearl-robed woman, who told me: 'The horse given to Zhang Xun is no fine steed.' What is the reason for this? Xun himself could not fathom it.\n\nXun’s wife owned a clothes chest, which she always opened and closed herself, and Xun had never seen inside. One day, when his wife was out, he secretly opened it and found a pearl-embroidered robe within. Upon her return, his wife asked him: 'Did you open my clothes chest?' Initially, she would always wait for her husband before eating. One day, when Xun returned, his wife had already eaten, saying: 'Today the food tasted strange, so I did not wait for you.' Xun entered the kitchen and saw a steamed human head in the rice. His heart turned against her, and he secretly resolved to kill her. His wife said to him: 'Do you mean to betray me? Yet you are soon to be a prefect of several commanderies—I cannot kill you.' Pointing to a maidservant, she added: 'If you wish to kill me, you must kill her first. Otherwise, you will not escape.' Xun then killed both his wife and the maidservant. Later, he indeed became a prefect.\n\nDong Shaoyan\nDong Shaoyan was a man who could discern others’ potential. Once, he visited Li Jian, the military governor of Ezhou, who presented his sons for Shaoyan to meet. At the time, a young servant named He Jingmei stood by Li Jian’s side. Shaoyan said: 'All your sons will attain high rank, yet none will surpass this servant.' Later, He Jingmei rose through the ranks to become a military governor and a renowned general of his time.\n\nWhen the Founding Ancestor was stationed in Runzhou, Shaoyan was in his service. He often assessed the officers in the garrison, ranking their qualities. A certain Lan Yansi said to him: 'Your words often prove accurate.' Shaoyan replied: 'Say no more—our young lord will not meet a good end.' Yansi said: 'I am but a military officer; if I die by the sword, it is my duty. What is there to speak of?' Shaoyan said: 'Would you rather die beneath a fine blade?' Later, when a fire broke out in the city, the garrison made preparations, crafting many buckets to store water. The soldiers, however, seized the opportunity to take up buckets and blades and rebel. Yansi perished in the chaos.\n\nA Soldier of Prince Wei\nPrince Wei, the Founding Ancestor’s son, was stationed in Xuanzhou. Among his soldiers was a man whose name is lost, whose household consisted only of himself and his wife. One day, the husband returned from outside, asked for water to bathe, changed into fresh clothes, and sat upon a rope bed—then died. His wife, seeing this, was greatly startled and said: 'Have you died?' Without weeping, she bathed, changed her clothes, and sat facing her husband—then passed away. Prince Wei buried them together in a single grave.\n\nShen Fen\nAt the end of the Tang, Shen Fen, a censor, retired from office and delighted in the Dao.\"\n\nA man with two concubines once said to them, \"If I should die, would you weep for me?\" The concubines were greatly startled and said, \"How could you speak such inauspicious words?\" He pressed them, and they replied, \"If it were so, how could we not weep?\" Shen Fen said, \"Weep for me now, that I may see.\" At first, they refused, but he insisted without cease. The concubines fled to avoid him, but he seized and steadied them. Unable to resist, one finally said, \"Simply ascend the bed and sit.\" Shen Fen did as she said. The two concubines stood on either side, clutching his sleeves, and wept. When they finished, they looked—Shen Fen had already passed away.\n\nA Youth of Qianzhou\nIn Qianzhou, there was an officer named Zhong who sailed a boat to Guangling. Passing Taihe Garrison, he moored and went ashore, where he saw a youth of refined and elegant appearance. The youth also sought passage to Yangzhou. Zhong agreed, and they traveled together. Once, while ashore by the river, they walked through the market, where Zhong saw a pig’s head at a butcher’s stall. He wished to buy it but had no money. The youth said, \"This is a small matter.\" Upon returning to the boat, he produced the pig’s head from his sleeve and said, \"I took it earlier for lack of coin, but now I shall repay its value.\" He returned to the butcher and said, \"I will pay you first; I will return shortly for the meat.\" The butcher took the money but did not retrieve the meat.\n\nWhen they reached Guangling, Zhong and the youth lodged together at an inn. One day, several roguish young men came to the inn to amuse themselves. The youth pointed to a servant in black and said, \"This one will surely be a thief tonight—guard against him.\" Zhong did not fully believe him. In the middle of the night, he heard the sound of a wall being breached. When the hole was large enough for a head to pass, he thrust his own through with a candle and seized the thief—it was indeed the one the youth had pointed out. He said to the thief, \"You have not yet taken anything, so I will not kill you.\" He let the man go.\n\nLater, the youth suddenly said to Zhong, \"We cannot stay here long.\" He urged him to return home. Zhong did as he said.\n\nWhen they reached Rishao, Zhu Jin killed someone in Changhua City, causing great alarm and disturbance.\n\nThere was a recluse from Minzhong named Zhang Biao, who possessed Daoist arts and could communicate with the netherworld. Sometimes he would lie as if dead for three or five days, yet his body remained warm. Upon reviving, he often spoke of matters in the underworld. Whatever he foretold invariably came to pass, and the people of the prefecture deeply believed in him. A man named Wang Baoyi had served as a general in Min during the late Tang, carrying an imperial edict to the court when the roads became impassable. He took to the sea but drowned. His grandson, Wang Kan, remained in Min and, due to a family member’s illness, asked Zhang Biao to pray to the netherworld on their behalf. Biao complied and said, \"I saw your grandfather in the Water Palace, where he holds an office in the underworld.\" He recounted the details of Wang’s family affairs, all of which were accurate.\n\nIn Hongzhou, a scholar named Cheng Youwen served as Recorder. His residence faced a thoroughfare, with a window overlooking the street. One day, as he sat by the window after the rain had cleared, the ground was muddy with only a narrow path. He saw a young boy selling shoes, looking extremely poor. A wicked youth encountered his elder brother, and in their scuffle, a shoe fell into the mud. The boy wept, begging for its price, but the youth scolded him and refused. The boy said, \"My family has had nothing to eat since morning. I was waiting to sell these shoes for food, but now they’re all ruined.\" A passing scholar took pity on him and compensated him for the shoe. The wicked youth grew angry and said, \"The boy came to me for money—what business is it of yours?\" He then cursed the scholar, who showed signs of anger. Cheng admired the scholar’s righteousness, called him over, and spoke with him, finding him extraordinary. He invited the scholar to stay the night. As they conversed late into the night, Cheng briefly went inside. When he returned, the scholar had vanished. Though all the doors were locked, he could not be found. Moments later, the scholar reappeared and said, \"That evil youth came, and I could not tolerate him. I have already cut off his head.\" He threw it to the ground. Cheng was shocked and said, \"This man was indeed a gentleman, but to cut off someone’s head and leave blood on the ground—won’t this implicate you?\" The scholar replied, \"Do not worry.\" He took out a small amount of medicine, applied it to the head, and rubbed the hair, which turned to water. He then said to Cheng, \"I have nothing to repay you, but I wish to give you this protective art.\" Cheng said, \"I am not a man of the Daoist realm and dare not accept your teaching.\" The scholar bowed deeply and left. Though all the gates were locked, he disappeared without a trace.\n\nDuring the time when Emperor Taizu of Wu was the Commander of the Eight Garrisons of Luzhou, he arrived at Santan and rested on the riverbank. A fisherman rowed his boat directly before him and presented several fish, saying, \"These are the scales of your descendants, generation after generation.\" Then, pointing in all four directions, he said, \"All these are your mountains and rivers.\" The Emperor found this strange and tried to give him something, but the fisherman left without a glance.\n\nQu Tong, styled Wuting, took his style as his name and was a native of Chenxi in Chenzhou. He had arched eyebrows, a broad forehead, a long nose, and bright eyes. He was diligent in his duties but spoke little. In the fourth year of the Dali era, Yang Lin, a defeated general from Xichuan, became the governor of Liyang. He failed to restrain his troops, allowing his subordinate Jia Zihua to lead a thousand men through Wuling to plunder the Five Streams. The people of the Five Streams fled in all directions. At the time, Wuting was fourteen. He accompanied his mother to Wuling and took refuge in the side residence of Daoist Huang Shanbao of Taoyuan Abbey in Chongyi Township. Wuting, through Shanbao, expressed his wish to become a disciple of Huang Dongyuan, a master of the Shangqing Three Caverns. Shanbao introduced him, fully conveying Wuting’s aspirations. Dongyuan declined, saying that Wuting had to care for his mother and needed fine food. Shanbao replied, \"Wuting’s mother is in my care, and I am fortunate to have enough to provide for her. If you would accept him despite his poverty, I hope you will take him in.\" Dongyuan agreed and later occasionally provided Wuting’s mother with clothing and food. After just over two years, in the first month of the sixth year, Wuting’s mother passed away. After the burial, he served Dongyuan diligently and tirelessly. In all tasks, he worked hard without complaint. He would discard poor food, showing care and respect, and then eat. In the seventh month, Dongyuan went to Xiangyang to purchase medicine. Whenever he entered the market, he had Wuting carry his belongings, and Wuting would close his eyes and stand in the crowd. Dongyuan scolded him, saying, \"If you sleep in the crowd, someone will steal your load.\" Wuting replied, \"I am not sleeping; I am just bothered by the noise of the crowd.\" In the ninth month, Dongyuan returned south. When they reached Yicheng, over a hundred *li* from Xiangyang, Dongyuan suddenly said, \"I left the incense burner with the innkeeper—what should we do?\" Wuting asked to retrieve it and told Dongyuan to rest briefly while he waited. In no time, he returned with the burner. Dongyuan asked in surprise, and Wuting replied, \"I feared you would be delayed on the road, so I hurried.\" Dongyuan believed him. In the second month of the seventh year, Hu Shuqing, the prefect of Langzhou, invited Dongyuan to the prefectural seat. Dongyuan went, leaving Wuting in the mountains to plant herbs and fruits. After twenty days, Dongyuan returned and asked Wuting if he had been anywhere. Wuting replied, \"Since you left for the prefecture, I have been searching for a cave in the woods.\" Dongyuan asked what he had seen, and Wuting said, \"I saw a stone chamber with a stone bed and a stone table.\" Dongyuan asked, \"Where is this stone chamber?\" Wuting replied, \"About one and a half *li* away.\" Dongyuan was doubtful but did not press further. Another ten days later, Wuting found a chess piece in the garden. He presented it to Dongyuan and said, \"This is a Qin man’s chess piece.\" Dongyuan found it strange and asked, \"Who told you this? How do you know?\" Wuting insisted, \"It is truly a Qin man’s chess piece.\" Dongyuan examined it closely—it resembled a small turtle, smooth and lustrous like jade—and placed it in his green silk bag. Later, when he opened the bag to check, the seal was still intact, but the chess piece was gone. In the summer of the fourth month, Wuting suddenly told Dongyuan, \"I wish to return to the mountain cave.\" At the time, there had been continuous heavy rain. Though Dongyuan was not entirely convinced, he ultimately did not go.\n\nOn the twenty-seventh day of the fifth month in the eighth year, Wuting rose at first light. Dongyuan sent him to the riverside to inspect a boat, a journey of no more than two *li* round-trip, yet he did not return until noon. Dongyuan reproached him: \"Why so late?\" Wuting replied, \"About fifteen paces southwest of here, there stands a small bridge. On it, I met an elder, staff in hand and burden slung over his shoulder, who called me to follow. I dared not, and so returned late.\"\n\nAt dawn on the thirtieth day, Wuting removed his usual cloth sash and bound his waist with a paper cord. Barefoot, he donned straw sandals and ascended to the hall of veneration, where he burned incense and knelt in prostration before Dongyuan’s altar of cultivation. Then, bidding Dongyuan farewell, he bowed once more. Dongyuan, leaning on his desk, asked, \"Where do you go when you leave me?\" Wuting answered, \"I return to the Transmitted Grotto.\" Dongyuan said, \"May I follow you?\" Wuting replied, \"You may not.\" Dongyuan pressed, \"Why not?\" Wuting explained, \"The venerable master did not summon you before, and so you may not now.\" He then advised Dongyuan to relocate his dwelling in due time. Dongyuan replied, \"To change one’s abode every ten years was the teaching of the ancients—I have long held this intention. But when you leave, when shall I see you again?\" Wuting answered, \"After eighteen years.\"\n\nDongyuan sought to detain him but could not. He then called out to Zhu Lingfou, a Daoist of the same temple: \"Master Zhu, come see the one who transmits the Way.\" Lingfou glanced at Wuting and remarked, \"The boy’s countenance today shines with extraordinary radiance.\" Dongyuan’s disciples—Hu Qinghao, Zhu Shenjing, the novice Chen Jingxin, and Tan Bodi—all watched from the garden. Wuting, clad in a short hemp robe and black silk headscarf, stepped back hesitantly. After three retreating strides, he vanished suddenly. Dongyuan and the Daoist disciples stared in astonishment. Nearby stood a chestnut tree, and they wondered if he had concealed himself behind it. Searching, they found no trace. Dongyuan then struck the bell to gather the temple’s inhabitants, intending to scour the woods. As the gatekeepers reached the northeastern edge of the forest, a great serpent blocked their path.\n\nIn the eleventh year, Wuting’s elder brother, Juanxin, came from Chen Prefecture and heard of his brother’s ascent to the Transmitted Grotto. Journeying to Taoyuan, he became Dongyuan’s disciple and took up the Daoist path. Later, as the cliffs flourished with moss and vines, he traveled to Mount Song but vanished without a trace.\n\nIn the fourth month of the first year of the Jianzhong era, Dongyuan relocated to Mount Lu in Jiang Prefecture. In the eleventh month of the fifth year of the Zhenyuan era, he moved again to Maoshan in Run Prefecture. In the spring of the eighteenth year, a postal courier in Run Prefecture spotted a youth walking ahead of him along the border of Yanling County. Though the courier quickened his pace, he could not close the distance. The youth entered Maoshan, thirty *li* from Yanling, and the courier saw him stride unhurriedly through the mountain gate.\n\nThat day, the Daoist nun Xiao Lingran was at Crane Terrace when she saw a young man carrying a small lacquered box, its lid holding a plain letter. He had not yet reached the gate when he lifted one foot to step over the threshold. Lingran asked, \"Who are you?\"\n\nHe answered, \"Qu Wuting.\"\n\nThen he asked Lingran, \"Where is the Venerable Master Huang?\" Lingran pointed out the way, and Wuting noted the path in his topknot. Suddenly, he seemed not to comprehend, but after a long while, he abruptly understood. Straightaway, he gathered his robes and hastened to Dongyuan, asking, \"Has Qu Wuting arrived?\"\n\nDongyuan merely assented without giving a clear reply.\n\nIn the first decade of the eighth month after the new moon of autumn, Dongyuan addressed his disciples, saying, \"I shall tread the azure sea; prepare my provisions.\" Some entreated him not to depart so soon. A year later, at noon, Dongyuan transformed and manifested in his true form, declaring, \"I have been charged to transmit the traces of the boy Qu’s ascent to execution—all strange and bewildering. Since my youth, when I was demoted to serve as Prefect of Wuling, upon my arrival, I made careful inquiries of the elders, and their accounts were even more absurd. On a day of leisure, I wandered to the Yuan River, where it converges with the Canglang. A fisherman told me, 'Wuting had a fellow student named Chen Jingxin, who has lived in five places. Now he is a Daoist at Peach Blossom Spring Abbey, having changed his name to Tongwei and later to Zhengchang. At first, they shared toils equally, but over time, he refined his conduct.' A hundred dubious tales are not worth a single sighting.\"\n\nHaving obtained the opportunity, I forgot even to eat. I immediately ordered him to approach, yet before he arrived, it seemed I could scarcely bear the wait. When the appointed day came, the gate officer led Jingxin into the front courtyard. He wore a crown of green vine, a robe of jade-green, his countenance like ice, his skin like snow, with a snowy beard and hoary brows. His steps were measured, his bearing solemn, and as he spoke, I knew not whether to count myself fortunate or overjoyed.\n\nOnce he arrived and settled, I slowly recounted all that had perplexed me, and Jingxin provided a full and clear explanation. Thereupon, I tore open a case and recorded his words directly, to dispel future doubts.\n\nComposed on the third day of the fifth month in the second year of Changqing by Wen Zao, Prefect of Langzhou. *A True Account of Chen Tongwei, Daoist of the Three Caverns of Supreme Clarity.*\n\nThis record was originally inscribed on bamboo slips, later effaced by meddlesome enthusiasts and re-engraved. Only a few characters remain on the side of the stele.\n\n*Jiang-Huai Records of Extraordinary Persons* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "江淮异人录 经名：江淮异人录。 一卷。 底本出处：《正统道藏》洞玄部记传类。 《通志》着录《江淮异人录》三卷，题宋朝吴淑撰。 《宋史·吴淑传》亦称淑撰《江淮异人录》三卷。 可知吴淑即该书作者。 江淮异人录 司马郊 司马郊，一名凝‘正，一名守中。 游於江表，常被冠褐，蹑屐而行，日可千百里。 衣褐不改，作而常新。 所为厅暴，人无敢近之者。 能诈死，以至青肿臭腐，俄而复活。 尝止於宣州开元观，自宣之歙，时道士绍修默亦往歙州，至城门遇之，与同行。 修默避之先往，至一镇戍，方息於逆旅，郊续至。 修默隐身潜窥之，见郊入别店中，召主人与饮，因而凌辱之。 主人初亦敬谢，郊不为已，而更击之。 既而互相搏击，郊忽路於地，视之已死，体玲色变，一市皆聚观。 乃召集乡里，缚其主人，检尸责词，将送於州。 时已向夕，欲明日一乃行。 至中夜，复闻店中喧然，曰已失司马尊师矣。 而人方悟郊诈死，释其主人。 修默明日侵晓乃行，至前百里许，问人曰：司马尊师何时过此？ 曰：今早已过矣。 明日复行百里问之，曰：昨日已早过矣。 及到歙州问之，亦然。 每往来上江诸州，至一旅舍，安泊久之，将去，告其主曰：我所有竹器，不能将行，取火焚之。 主人曰：方风高，且竹屋低隘，不可举火。 郊不已，众人共拜劝之，郊怒不听，乃发火於室中，持一大杖立於门侧，敢至者击之。 郊有力，人无敢近之者。 俄而火盛，焰出於竹瓦之隙，人皆惶骇。 既而火灭，郊所有器什皆尽，所外床皆重灼，而荐席无有焦者。 有朱翱者，为池州法橡，郊过诣之，谓朱曰：君色甚恶，当病。 我即去，君病中能念我，或呼我姓名，当有所应。 翱不之信，后十余日果病热疾，数日甚剧。 忽忆郊之言，意甚神之，因稽首思念，求佑。 初朱已病恶，见人在己前，有小吏陈某者常指使如意，令入室侍疾，亦叱去之。 家人守之户外，无得入者。 至是朱恍惚见陈某持一瓯药进之，朱饮之，便觉意爽体佳，呼家人曰：适陈某所持来药甚效，当令更进一服。 家人惊曰：比不令人入室，陈安得至此。 朱乃悟郊之垂佑也。 自是朱疾渐平。 郊尝居歙州某观，病痢困剧，观主欲申白官司，先以意闻郊。 郊怒曰：吾疾方愈，何劳若此。 既渐困笃，观主不得已，乃口白县令姚蕴。 蕴使人候问之，郊曰：姚长官何故知吾病也？ 来者以告。 郊怒，忽起结束，径入某山中，其行如飞。",
      "translated_text": "**Records of Extraordinary Individuals of the Jiang-Huai Region**\n\n*Scripture Title:* *Records of Extraordinary Individuals of the Jiang-Huai Region*. One fascicle. Base text from the *Daoist Canon of the Zhengtong Era*, *Section of Mysteries*, *Category of Biographies and Accounts*. The *Comprehensive Treatises* records *Records of Extraordinary Individuals of the Jiang-Huai Region* in three fascicles, attributed to Wu Shu of the Song dynasty. The *History of the Song Dynasty: Biography of Wu Shu* likewise states that Wu Shu authored *Records of Extraordinary Individuals of the Jiang-Huai Region* in three fascicles. Thus, Wu Shu is confirmed as the author of this work.\n\n---\n\n**Sima Jiao**\n\nSima Jiao, also named Ningzheng, and alternatively Shouzhong, wandered through the Jiangnan region. He often wore a hempen cap and coarse cloth, walking in wooden clogs, covering a thousand *li* or more in a day. His garments, though made of coarse cloth, remained perpetually new. His conduct was fierce and abrupt, and none dared approach him. He could feign death, his body turning green and swollen, reeking of decay, only to revive shortly after.\n\nOnce, he stayed at the Kaiyuan Abbey in Xuanzhou. From Xuanzhou to Shezhou, the Daoist Shaoxiu Mo was also traveling to Shezhou. At the city gate, he encountered Sima Jiao and walked alongside him. Shaoxiu Mo, seeking to avoid him, arrived first at a garrison town and rested at an inn. Sima Jiao soon followed. Shaoxiu Mo concealed himself and observed secretly. He saw Sima Jiao enter another shop, summon the innkeeper, and drink with him, only to humiliate the man. The innkeeper initially showed respect and apologized, but Sima Jiao persisted, striking him. They grappled, and Sima Jiao suddenly collapsed to the ground, appearing dead—his body cold, his complexion altered. The entire market gathered to watch. The townspeople were summoned, the innkeeper bound, and the corpse examined for evidence. They prepared to send him to the prefecture, but as evening approached, they decided to wait until the next day.\n\nAt midnight, clamor arose from the inn: \"The Venerable Master Sima has vanished!\" Only then did the people realize he had feigned death and released the innkeeper. The next day, Shaoxiu Mo set out at dawn. After traveling about a hundred *li*, he asked someone, \"When did the Venerable Master Sima pass through here?\" The reply: \"He passed early this morning.\" The following day, after another hundred *li*, he asked again, and was told, \"He passed early yesterday.\" Upon reaching Shezhou, the answer was the same.\n\nWhenever he traveled among the prefectures along the upper Yangtze, he would stay at an inn for an extended period. Before departing, he would tell the innkeeper, \"I cannot take my bamboo utensils with me. Fetch fire to burn them.\" The innkeeper protested, \"The wind is strong, and the bamboo hut is low and cramped—fire cannot be lit here.\" Sima Jiao insisted, and though the crowd knelt and pleaded, he refused to listen. He set fire to the room and stood at the door with a large staff, striking anyone who dared approach. He was strong, and none dared draw near. Soon, the flames raged, shooting through the gaps in the bamboo roof, and the onlookers panicked. When the fire subsided, all of Sima Jiao’s belongings were consumed, the outer bedding scorched, yet the straw mat and bedding beneath remained unburned.\n\nThere was a man named Zhu Ao, a legal officer in Chizhou. Sima Jiao visited him and said, \"Your complexion is grim—you will fall ill. When I leave, if you think of me during your illness or call my name, I may respond.\" Zhu Ao did not believe him. More than ten days later, he indeed fell gravely ill with a fever. After several days, his condition worsened. Suddenly recalling Sima Jiao’s words, he revered him as a divine being and bowed in prayer, seeking his aid.\n\nAt first, Zhu Ao’s illness was severe, and he saw a figure before him—a minor clerk named Chen, who often attended to his needs. He ordered Chen to enter the room and tend to him, but then angrily dismissed him. His family stood guard outside, allowing no one to enter. Yet, in his delirium, Zhu Ao saw Chen holding a bowl of medicine and offering it to him. He drank it and immediately felt his mind clear and his body ease. He called to his family, \"The medicine Chen just brought is most effective—have him bring another dose.\" His family was astonished: \"We did not let anyone enter, how could Chen have come?\" Zhu Ao then realized it was Sima Jiao’s divine assistance. From then on, his illness gradually improved.\n\nSima Jiao once resided at a certain abbey in Shezhou. Stricken with severe dysentery, the abbey’s master wished to report his condition to the authorities and first informed Sima Jiao of his intent. Enraged, Sima Jiao said, \"My illness is nearly cured—why trouble yourself so?\" As his condition worsened, the abbey master had no choice but to report it to the county magistrate, Yao Yun. Yao Yun sent someone to inquire after him. Sima Jiao asked, \"Why does Magistrate Yao know of my illness?\" When the messenger relayed this, Sima Jiao grew furious. Suddenly, he rose, dressed himself, and strode directly into a mountain, moving as swiftly as if he were flying.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 922,
      "start_sentence": 0,
      "end_sentence": 48,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.886635303497314,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "后十余日，持一大杖，求观主，将捶之。 观中道士共礼拜求救，乃免。 尝至洪州市中探鲜食之，市中小儿呼曰：道士吃鲜。 郊怒，以物击小儿，中流血。 巡人执郊送於虞候，素知其名，方善劝说之。 郊乃极口骂怒，虞候不胜其忿，杖之至十。 郊谓人曰：彼杖我十五，可得十五日活。 杖我十，十日死矣。 既而果然。 后入卢山居简寂观，因醉卧数日而卒。 临终，令置一杖於棺中。 及葬，觉棺空，发之，唯杖在焉。 钱处士 钱处士，天佑末游於江淮。 尝止於金陵杨某家。 初，昊朝以金陵为州，筑城，西抛江，束至潮沟。 钱指城西里余荒秽之地，劝杨买之。 杨从其言。 及建为都邑，而杨氏所买地正在繁会之处，乃构层楼为酒肆焉。 尝宿於杨家，中夜忽起，谓人曰：地下兵马喧阗，云接令公，聒我不得眠。 人皆莫之测也。 明日，义祖自京口至金陵，时人无有预知者。 尝见一人，谓之曰：尔天罚将及，可急告谢自责。 人曰：我未省有过。 钱曰：尔深思之。 人良久乃曰：昨日饮食不如意，因怒其下，弃食於沟中。 钱曰：正是此尔。 可急取所弃食之。 乃取之，将以水汰去其秽。 俄而雷电大震。 钱曰：急取秽食之。 如言而雷电果息。 尝有人图钱之状，钱见之曰：吾反不若此，常对圣人也。 人不之悟。 后有僧取其图置於志公塔中，人以为应。 后烈祖复取之入宫，陈於内寝焉。 又每为谶语，说方来事。 言李氏之祚曰：髻髭之问一倍杨。 初，昊氏有江之地凡四十六年，而李氏三十九年。 或谓杨氏自称尊，至禅代二十年，故髻髭倍之耳。 聂师道 聂师道，歙人，少好道。 唐末于涛为歙州刺史，其兄方外为道士，居於郡南山中，师道往事之。 涛时往诣方外，至於郡政，咸以谘之。 乃名其山为问政山。 昊朝以师道尝居是山，因号为问政先生焉。 初，方外在山中，郡人少信奉者。 及师道至，脆信日至‘而富实。 师道尝与友人同行，至一逆旅，友病热疾，村中无复医药，或教病者曰：能食少不洁，可以解。 及病危，因复劝之，人有难色。 师道谕之曰：事急矣，何难於此，吾为汝先尝之。 乃取喟之。 人感其意，乃食，而病果愈。 后给事中裴枢为歙州，当唐祚之季，诏令不通。 宣州田濒、池州陶雅举兵围之累月，歙人频破之。 后食尽援绝，议以城降。 而城中杀外军已多，无敢将命出者。 师道乃自请行。 枢曰：君乃道士，岂可游兵革中耶？ 请易服以往。 师道曰：吾已受道法科教，不容易服。 乃锤之出城。 二将初亦甚怪，及与之语，乃大喜曰：真道人也。 誓约已定，复遣还城中。 及期枢适有未尽，复欲延期，更令师道出谕之。 人谓其二三，咸为危之。 师道亦无难色。 及复见二将，皆日无不可，唯给事命时。 城中人获全，师道之力也。 昊太祖闻其名，召至广陵，建紫极宫以居之。 一夜有掌盗入其所止，至於什器，皆尽取之。 师道谓之曰：汝为盗，取吾财以救饥寒也，持此将安用之？ 乃引於曲室，尽取金帛与之。 仍谓之曰：尔当从其处出，无巡人，可以无患。 盗如所教，竟以不败。 后昊朝遣师道至龙虎山设醮，道遇群盗劫之，将加害，其中一人熟视师道，谓同党曰：勿犯先生。 令尽以所得还之。 草盗亦皆从其言。 因谓师道曰：某即昔年扬洲紫极宫中为盗者。",
      "translated_text": "More than ten days later, Sima Jiao returned wielding a large staff, demanding to see the abbey master and threatening to strike him. The Daoist priests of the abbey all bowed and pleaded for mercy, and only then was he spared.\n\nOnce, he went to the market in Hongzhou to buy fresh food. The children in the market called out, \"Daoist eating fresh!\" Enraged, Sima Jiao hurled something at one of the children, drawing blood. The patrolmen seized him and brought him before the military prefect, who, knowing his reputation, gently tried to persuade him. Sima Jiao, however, railed at him furiously. Unable to contain his anger, the prefect had him caned ten times. Sima Jiao said to others, \"If he had struck me fifteen times, I could have lived fifteen more days. Ten strokes mean I shall die in ten days.\" And so it came to pass.\n\nLater, he entered Mount Lu and resided at the Abbey of Simplicity and Silence. There, after drinking himself into a stupor, he lay unconscious for several days before passing away. Before his death, he instructed that a staff be placed in his coffin. When the coffin was later opened, it was found empty—only the staff remained.\n\n---\n\n**Qian the Recluse**\n\nToward the end of the Tianyou era, Qian the Recluse traveled through Jianghuai and once stayed at the home of a certain Yang in Jinling. Earlier, when the Wu dynasty had established Jinling as a prefectural seat, it built a city wall that extended westward into the river and eastward to Chaogou. Qian pointed to a stretch of over a *li* of overgrown and desolate land west of the city and urged Yang to buy it. Yang followed his advice. When the city later became the imperial capital, the land Yang had purchased lay at the heart of the bustling metropolis. There, he constructed a multi-story building and opened a tavern.\n\nOnce, while staying at Yang’s home, Qian suddenly rose in the middle of the night and said to those around him, \"The clamor of troops and horses beneath the earth is deafening—they say they are here to receive the Lord Commander, and their noise keeps me from sleeping.\" No one could fathom his meaning. The next day, Yizu arrived in Jinling from Jingkou, though no one had foreseen his coming.\n\nOn another occasion, Qian saw a man and said to him, \"Heaven’s punishment is about to befall you. You must hasten to repent and take responsibility.\" The man replied, \"I cannot recall any wrongdoing.\" Qian said, \"Reflect deeply.\" After a long while, the man said, \"Yesterday, I was displeased with my meal and, in anger, threw it into the ditch.\" Qian said, \"That is precisely the offense. Retrieve what you discarded at once.\" The man fetched the food and was about to rinse away the filth with water when suddenly thunder and lightning crashed violently. Qian said, \"Quickly, eat the spoiled food.\" The man did as instructed, and the thunder and lightning ceased.\n\nSomeone once painted a portrait of Qian. Upon seeing it, he remarked, \"I am not as composed as this—yet I stand before the sages.\" No one understood his meaning. Later, a monk took the portrait and placed it in the pagoda of Master Zhi. People considered this fitting. Later still, Liezu retrieved the portrait and brought it into the palace, where it was displayed in the inner chambers.\n\nQian also frequently uttered prophecies, foretelling future events. Regarding the fate of the Li dynasty, he said, \"Between the topknot and the beard, one Yang shall double.\" The Wu dynasty had ruled the lands south of the Yangtze for forty-six years, while the Li dynasty reigned for thirty-nine. Some said that the Yang referred to the Yang family, who had proclaimed themselves sovereign and ruled for twenty years before abdicating—thus, the \"topknot\" (Li) was indeed doubled by the \"beard\" (Yang).\n\n---\n\n**Nie Shidao**\n\nNie Shidao, a native of Shezhou, developed an affinity for the Dao in his youth. At the end of the Tang dynasty, Yu Tao served as prefect of Shezhou. His elder brother, Fangwai, was a Daoist priest who lived in the mountains south of the prefecture. Shidao went to study under him. Tao often visited Fangwai, and on matters of governance, he consulted him as well. Thus, the mountain was named Mount Inquiry.\n\nDuring the Wu dynasty, because Shidao had once resided there, he was given the title \"Master of Inquiry.\"\n\nInitially, when Fangwai lived in the mountains, few in the prefecture believed in or supported him. After Shidao arrived, however, the number of devotees increased daily, and the abbey grew prosperous.\n\nOnce, Shidao was traveling with a friend when they stopped at an inn. The friend fell ill with a fever, and the village had no medicine. Someone suggested to the sick man, \"If you can eat something unclean, it may cure you.\" As his condition worsened, they urged him again, but the man hesitated. Shidao said to him, \"The situation is dire—what is there to hesitate about? I will taste it first for you.\" He then took some and ate it. Moved by his sincerity, the man ate as well, and his illness was cured.\n\nLater, when Pei Shu, the Vice Director of the Department of State Affairs, was serving as prefect of Shezhou, the Tang dynasty was nearing its end, and imperial decrees no longer reached the region. Tian Jun of Xuanzhou and Tao Ya of Chizhou raised troops and besieged the city for months. The people of Shezhou repeatedly repelled them. When supplies ran out and reinforcements failed to arrive, the city’s leaders discussed surrender. Yet, as the defenders had already killed many of the besiegers, no one dared to venture out as an envoy. Shidao then volunteered to go. Shu said, \"You are a Daoist priest—how can you traverse a battlefield?\" He urged Shidao to change his clothes. Shidao replied, \"I have received the precepts of the Dao—it is not permissible to alter my attire.\" He then left the city under a banner of truce.\n\nAt first, the two commanders were astonished, but after speaking with him, they were overjoyed, saying, \"A true Daoist priest!\" They swore an oath and sent him back to the city. When the appointed time arrived, Shu had not yet completed his preparations and sought to delay. He sent Shidao out again to negotiate. People feared his vacillation and considered his mission perilous, but Shidao showed no hesitation. When he met the two commanders again, they said, \"There is no objection—only await the Vice Director’s command.\" Thus, the people of the city were spared, thanks to Shidao’s efforts.\n\nWhen Emperor Taizu of Wu heard of his reputation, he summoned him to Guangling and built the Purple Ultimate Abbey for him to reside in. One night, a thief broke into his quarters and took all his belongings, even his household utensils. Shidao said to him, \"You steal to relieve hunger and cold—what use will these things be to you?\" He then led the thief into a secluded chamber, gave him all his gold and silk, and said, \"Leave through the back—avoid the patrols, and you will come to no harm.\" The thief followed his instructions and escaped unscathed.\n\nLater, the Wu court sent Shidao to Mount Longhu to perform a grand ritual. On the way, he was ambushed by bandits who intended to kill him. One of them, however, stared at Shidao and said to his companions, \"Do not harm this master.\" He ordered that all the stolen goods be returned. The bandits complied. Then he said to Shidao, \"I am the thief who once robbed you at the Purple Ultimate Abbey in Yangzhou.\"",
      "overlap_context": "t informed Sima Jiao of his intent. Enraged, Sima Jiao said, \"My illness is nearly cured—why trouble yourself so?\" As his condition worsened, the abbey master had no choice but to report it to the county magistrate, Yao Yun. Yao Yun sent someone to inquire after him. Sima Jiao asked, \"Why does Magistrate Yao know of my illness?\" When the messenger relayed this, Sima Jiao grew furious. Suddenly, he rose, dressed himself, and strode directly into a mountain, moving as swiftly as if he were flying.",
      "start_char": 922,
      "end_char": 2147,
      "start_sentence": 49,
      "end_sentence": 127,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.64244604110718,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "感先生至仁之心，今以奉报。 后卒于广陵。 时方遣使於湖湘，使还至某处，见师道，问之曰：何以至此？ 师道曰：朝廷遣我醮南岳。 使者以为然。 及入昊境，方知师道卒矣。 师道侄孙绍元，少入道，风貌和雅，善属文。 年二十余卒。 初，绍元既病剧，有四鹤集於绍元所处屋上。 及其卒，人见五鹤冲天而去。 于大 于大，居洪州西山中，无四时，常持花，不欲近人。 尝至应圣宫，以花置道像前。 道士为设荼，置之食案，须人退，于及取饮。 饮讫，置茶盏於案，长揖而去。 人或揖之，亦复相揖。 但不与人语耳。 有少年好道，欲往事之，而不能得。 一日少年拜曰：愿事先生。 于走不顾。 少年逐之，而持其衣，于驱之不去。 上山渡水，不暂置之。 至一处，临水而坐，问少年曰：颇渴否？ 曰：然。 怀中出物如荼末，与之曰：置此口中，掬水下之。 如言＃１须吏．因睡，及觉，失之矣。 李梦符 李梦符者，常游洪洲市井中。",
      "translated_text": "Moved by the master’s boundless benevolence, he repaid the kindness in this way. Later, Shidao passed away in Guangling.\n\nAt the time, an envoy was being dispatched to Hunan and Hubei. On his return journey, he encountered Shidao at a certain place and asked, \"How have you come here?\" Shidao replied, \"The court sent me to perform a ritual at Mount Heng.\" The envoy accepted this. Only upon entering Wu territory did he learn that Shidao had already died.\n\nShidao’s grandnephew, Shaoyuan, entered the Dao in his youth. His demeanor was gentle and refined, and he was skilled in composition. He died at just over twenty years of age. Earlier, when Shaoyuan’s illness grew severe, four cranes alighted on the roof of his dwelling. Upon his death, people saw five cranes soar into the sky and vanish.\n\nYu Da resided in the Western Mountains of Hongzhou. He lived beyond the constraints of the four seasons, always holding flowers and avoiding close contact with others. Once, he visited the Ying Sheng Abbey and placed flowers before the Daoist statue. A Daoist prepared tea and set it on the dining table. Only after others had withdrawn did Yu Da approach to drink. After finishing, he placed the teacup back on the table, bowed deeply, and departed. If someone bowed to him, he would return the gesture—but he never spoke.\n\nA young man fond of the Dao wished to become his disciple but could not succeed. One day, the youth bowed and said, \"I wish to serve you, Master.\" Yu Da fled without looking back. The youth pursued him, seizing his robe, and Yu Da could not shake him off. They climbed mountains and crossed streams without pause. Finally, Yu Da sat by a stream and asked the youth, \"Are you thirsty?\" The youth replied, \"Yes.\" Yu Da took something like tea powder from his sleeve and said, \"Place this in your mouth and scoop water to swallow it.\" The youth did as instructed. Soon after, he fell asleep, and upon waking, Yu Da was gone.\n\nLi Mengfu often wandered the markets and streets of Hongzhou.",
      "overlap_context": " and you will come to no harm.\" The thief followed his instructions and escaped unscathed.\n\nLater, the Wu court sent Shidao to Mount Longhu to perform a grand ritual. On the way, he was ambushed by bandits who intended to kill him. One of them, however, stared at Shidao and said to his companions, \"Do not harm this master.\" He ordered that all the stolen goods be returned. The bandits complied. Then he said to Shidao, \"I am the thief who once robbed you at the Purple Ultimate Abbey in Yangzhou.\"",
      "start_char": 2147,
      "end_char": 2519,
      "start_sentence": 128,
      "end_sentence": 155,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.783045291900635,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "年可二十余，短小而洁白，美秀如玉人。 以放荡自恣，，四时常插花，褊历城中酒肆，高歌大醉。 好事者多召之与饮。 或令为歌词，应声为之，初不经心，而各有意趣。 锺传之镇洪州也，以其狂妄惑众，将罪之。 梦符於狱中献诗十余首，其略曰：插花饮酒无妨事，樵唱渔歌不碍时。 锺竟亦不罪。 后桂州刺史李琼遣使至洪州，言梦符乃其弟也，请遣之。 锺令求於市中旅舍，人曰：昨梦符不归。 因尔不知所终。 刘同圭 刘同圭者，居洪州，诣艾氏家，赁其屋而居。 家唯翁媪而已。 旦持一筐蕈卖之，夕而醉归。 积久，邻人怪之，夜穴壁窥之，见出一缶土，以水嘤之，须臾蕈生，及晓刈之。 后翁病，谓媪曰：我死必置一杖於棺中。 及卒，如其言。 初举棺以出，人觉其重。 及至半路，渐轻如无。 流荡其棺，唯觉杖在其中。 发之，独得杖耳。 耿先生 耿先生者，江表将校耿谦之女也。 少而明慧，有姿色。 颇好书，稍为诗句，往往有嘉旨。",
      "translated_text": "Aged around twenty, he was short and fair, his beauty as refined as jade. Indulging in unbridled freedom, he adorned his hair with flowers in all seasons, wandering through the taverns of the city, singing loudly and drinking to intoxication. Those fond of novelty often invited him to drink, and if asked to compose lyrics, he would improvise on the spot—never giving it a second thought, yet each piece carried its own charm.\n\nWhen Zhong Chuan governed Hongzhou, he deemed Mengfu’s wild and misleading behavior punishable. From prison, Mengfu presented over ten poems, one of which read: *\"Drinking with flowers in my hair—what harm is there? / Woodcutters’ chants and fishermen’s songs—what time do they impair?\"* In the end, Zhong did not punish him.\n\nLater, Li Qiong, the prefect of Guizhou, sent an envoy to Hongzhou, claiming Mengfu was his younger brother and requesting his return. Zhong ordered a search among the city’s inns, but the people said, *\"Mengfu did not return last night.\"* From then on, his whereabouts remained unknown.\n\n---\n\n**Liu Tonggui**\n\nLiu Tonggui lived in Hongzhou and lodged in the house of the Ai family. The household consisted only of an old man and his wife. Each morning, he carried a basket of mushrooms to sell, returning drunk by evening. Over time, neighbors grew suspicious. One night, they bored a hole in the wall to spy on him and saw him take out a jar of soil, sprinkle it with water, and soon mushrooms sprouted. By dawn, he harvested them.\n\nLater, the old man fell ill and told his wife, *\"When I die, place a staff in my coffin.\"* After his death, they followed his instructions. At first, when the coffin was lifted, it felt heavy. But halfway to the burial site, it grew as light as if empty. They opened it to find only the staff inside.\n\n---\n\n**Master Geng**\n\nMaster Geng was the daughter of Geng Qian, a military officer from Jiangbiao. From childhood, she was bright and quick-witted, with a graceful appearance. Fond of books, she occasionally composed poetry, often imbued with fine meaning.",
      "overlap_context": "youth pursued him, seizing his robe, and Yu Da could not shake him off. They climbed mountains and crossed streams without pause. Finally, Yu Da sat by a stream and asked the youth, \"Are you thirsty?\" The youth replied, \"Yes.\" Yu Da took something like tea powder from his sleeve and said, \"Place this in your mouth and scoop water to swallow it.\" The youth did as instructed. Soon after, he fell asleep, and upon waking, Yu Da was gone.\n\nLi Mengfu often wandered the markets and streets of Hongzhou.",
      "start_char": 2519,
      "end_char": 2897,
      "start_sentence": 156,
      "end_sentence": 180,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.20984435081482,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "而明於道术，能拘制鬼魅。 通於黄白之术、变怪之事。 奇伟恍惚，莫知其何从· 得也。 保大中，江淮富盛，上好文，雅悦奇异之事，召之入宫，益观其术，不以贯鱼之列待，特处之别院，号曰：先生。 先生常被碧霞岐，见上多持简，精彩卓逸，言词朗畅。 手如乌爪，不便於用，饮食皆仰於人。 复不喜行，宫中常使人抱持之。 每为诗句，题於墙壁，自称北大先生，亦莫知其旨也。 先生之卫不常的，然发扬於外，遇事则应，黯然· 而彰。 上益以此重之也。",
      "translated_text": "Master Geng was well-versed in the Daoist arts and could restrain ghosts and spirits. Proficient in the alchemy of yellow and white and matters of strange transformations, her marvels and illusions were so wondrous that none knew their origin. During the Baoda era, when Jianghuai flourished in wealth, the emperor, fond of literature and enamored with the extraordinary, summoned her to the palace to further observe her arts. He did not treat her as one of the ranked courtiers but instead lodged her in a separate residence, addressing her as \"Master.\" Clad in green-tinged rosy clouds, she often appeared before the emperor holding a tablet, her spirit radiant and transcendent, her words clear and flowing. Her hands resembled a crow’s talons, rendering them useless for tasks, so she relied on others for eating and drinking. Disliking walking, the palace attendants often carried her. Whenever she composed poetry, she would inscribe it on the walls, signing herself as \"Master of the Northern Greatness,\" though none understood its meaning. Her guard was not constant, yet her presence was outwardly resplendent; when called upon, she responded with a brilliance both subtle and manifest. The emperor thus held her in even higher regard.",
      "overlap_context": ", place a staff in my coffin.\"* After his death, they followed his instructions. At first, when the coffin was lifted, it felt heavy. But halfway to the burial site, it grew as light as if empty. They opened it to find only the staff inside.\n\n---\n\n**Master Geng**\n\nMaster Geng was the daughter of Geng Qian, a military officer from Jiangbiao. From childhood, she was bright and quick-witted, with a graceful appearance. Fond of books, she occasionally composed poetry, often imbued with fine meaning.",
      "start_char": 2897,
      "end_char": 3099,
      "start_sentence": 181,
      "end_sentence": 190,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.64769721031189,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "始入宫，问以黄白之事，试之皆验。 益复为之，而简易不烦。 上尝因暇，预谓先生曰：此皆因火以成之。 苟不须火，其能乎？ 先生曰：试为之，殆亦可。 上乃取水银，以睡纸重复裹之，封题甚密。 先生内於怀中，良久忽若裂帛声。 先生笑曰：陛下常不信下妾之术，今日面观，可复不信耶？ 持以与上。 上周视，题处如旧。 发之，已为银矣。 又尝大雪，上戏之曰：先生能以雪为银乎？ 先生曰：亦可。 乃取雪实之，削为银蜓状。 先生自投於炽炭中，灰埃堂起，徐以炭周覆之，过食顷，曰：可矣。 乃持以出，赫然洞赤。 置之於地，及玲，烂然为蜓银，而刀迩具在。 反视其下，若垂酥滴乳之状。 盖初为火之所融释也。 因是，先生所作雪银甚多。 上诞日，每作器用，献以为寿。 又多巧思，所作必出於人。 南海尝贡奇物，有蔷薇水、龙脑浆。 蔷薇水清沘郁烈，龙脑浆补益男子。 上宝惜之，每以龙脑浆调酒服之，香气连日不绝於口。 亦以赐近臣。 先生曰：此未为佳也。",
      "translated_text": "When she first entered the palace, the emperor questioned her about alchemical arts, testing her with trials that all proved true. Thereafter, she performed them with even greater ease and simplicity. Once, during a moment of leisure, the emperor remarked to her in advance: \"All these rely on fire to achieve their transformation. Without fire, could they still be done?\" The Master replied: \"Let me attempt it—perhaps it is possible.\" The emperor then took mercury, wrapping it in layer upon layer of paper, sealing it tightly. The Master placed it in her bosom, and after a long while, a sound like tearing silk suddenly arose. Smiling, she said: \"Your Majesty has never believed in my humble arts—today, witnessing it with your own eyes, can you still doubt?\" She took it out and presented it to the emperor. He examined it closely; the seal remained unchanged. When opened, it had turned to silver.\n\nAnother time, during a heavy snowfall, the emperor teased her: \"Can you turn this snow into silver?\" The Master replied: \"It can be done.\" She gathered the snow, packing it tightly, and carved it into the shape of a silver ingot. Then, with her own hands, she cast it into glowing coals. Ash and embers billowed up as she slowly covered it with more charcoal. After the time it takes to eat a meal, she declared: \"It is ready.\" She retrieved it, glowing a brilliant red. Placed upon the ground, as it cooled, it gleamed as a solid silver ingot, its edges and markings intact. Beneath it, the residue resembled dripping lard or trickling milk—this was the snow melted by the fire’s heat. From then on, the Master crafted many such \"snow silvers.\" On the emperor’s birthday, she would fashion vessels and utensils from them as tribute for his longevity.\n\nShe was also full of ingenious ideas, her creations always surpassing those of others. Once, the Southern Sea presented rare treasures: rosewater and dragon-brain nectar. The rosewater was clear yet intensely fragrant, while the dragon-brain nectar strengthened men’s vitality. The emperor treasured them, often mixing the nectar with wine to drink, its fragrance lingering in his mouth for days. He also bestowed some upon his favored ministers. The Master remarked: \"These are not yet the finest.\"",
      "overlap_context": "ns, rendering them useless for tasks, so she relied on others for eating and drinking. Disliking walking, the palace attendants often carried her. Whenever she composed poetry, she would inscribe it on the walls, signing herself as \"Master of the Northern Greatness,\" though none understood its meaning. Her guard was not constant, yet her presence was outwardly resplendent; when called upon, she responded with a brilliance both subtle and manifest. The emperor thus held her in even higher regard.",
      "start_char": 3099,
      "end_char": 3479,
      "start_sentence": 191,
      "end_sentence": 217,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.564536094665527,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "上曰：先生岂能为之？ 曰：试为，应亦可就。 乃取龙脑，以细绢袋之，悬於瑁璃瓶中。 上亲封题之，置酒於其侧而观之。 食顷，先生曰：龙脑已浆矣。 上自起附耳听之，果闻滴沥声。 且复饮，少．选又视之，见瑁璃瓶中湛然如勺水矣。 明日发之，｀已半瓶，香气酷烈，逾於旧者远矣。 先生后有孕，一日谓上曰：妾此夕当产，神孙圣子诚在此耳。 请备生产所用之物。 上悉为设之，益令宫人宿於室中。 夜半烈风震霆，室中人皆震惧。 是夜不复产。 明旦，先生腹已消如常人。 上惊问之。 先生曰：昨夜雷电中生子，已为神物持去，不复得矣。 先生嗜酒，至於男女大欲，亦略同於常。 后亦竟以疾终。 古者神仙多晦迹混俗，先生岂其人乎？ 余顷在江南，常闻其事，而宫掖秘奥，说者多异同。 及江南平，在京师尝诣徐率更游，游即义祖之孙也，宫中之事悉能知之。 因就质其事，备为余言。 潘扆 潘扆者，大理评事潘鹏之子也。 少居於和州，樵采鹦笼山，以供养其亲。 尝过江至金陵，泊舟秦淮口。",
      "translated_text": "The emperor asked, \"Can you refine these as well?\"\nShe replied, \"Let me try—it should succeed.\"\nShe took the dragon-brain nectar, placed it in a fine silk pouch, and suspended it within a crystal bottle. The emperor personally sealed it, set wine beside it, and watched. After the time it takes to eat a meal, the Master said, \"The dragon-brain has turned to liquid.\" The emperor rose and pressed his ear close—indeed, he heard the sound of dripping. They drank again, and after a short while, she showed him the bottle: it was now filled with liquid as clear as a ladle of water. The next day, they opened it to find half a bottle full, its fragrance far more potent than before.\n\nLater, the Master conceived. One day, she told the emperor, \"Tonight, I shall give birth. The divine grandson, the sagely child, is truly within me. Please prepare all that is needed for the delivery.\" The emperor arranged everything and ordered palace women to stay with her through the night. At midnight, a violent wind and thunder shook the halls, terrifying all inside. Yet that night, she did not give birth. By dawn, her belly had returned to its usual size. The emperor, astonished, asked what had happened. She said, \"Last night, amid the thunder and lightning, I bore a child—only for a divine being to take him away. He is lost to us now.\"\n\nThe Master loved wine, and her desires for men and women differed little from those of ordinary people. Later, she too died of illness. In ancient times, immortals often concealed their traces among the common folk—was she one of them?\n\nWhen I was once in Jiangnan, I often heard tales of her, though the secrets of the palace were recounted with many variations. After Jiangnan was pacified, I was in the capital and visited Xu Shugeng, who was the grandson of Yi Zu. He knew all the affairs of the palace. I questioned him about these events, and he told me the full account.\n\n---\nPan Yi was the son of Pan Peng, a judicial assessor of the Court of Judicial Review. In his youth, he lived in Hezhou, gathering firewood on Yinglong Mountain to support his parents. Once, he crossed the river to Jinling and moored his boat at the mouth of the Qinhuai.",
      "overlap_context": "\nShe was also full of ingenious ideas, her creations always surpassing those of others. Once, the Southern Sea presented rare treasures: rosewater and dragon-brain nectar. The rosewater was clear yet intensely fragrant, while the dragon-brain nectar strengthened men’s vitality. The emperor treasured them, often mixing the nectar with wine to drink, its fragrance lingering in his mouth for days. He also bestowed some upon his favored ministers. The Master remarked: \"These are not yet the finest.\"",
      "start_char": 3479,
      "end_char": 3877,
      "start_sentence": 218,
      "end_sentence": 243,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.122842788696289,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "有一老父求同载过江，宸敬其老，许之。 时大雪，宸市酒与同饮。 及江中流，酒已尽。 宸甚恨其少，不得醉。 老父曰：吾亦有酒。 乃解巾，於髻中取一小胡芦子，倾之，极饮不竭。 宸惊，益敬之。 及至岸，谓宸曰：子事亲孝，复有道气，可教也。 乃授以道术。 宸自是所为诡异，世号之为潘仙人。 能掬水银於手中，接之即成银。 尝入人家，见池沼中有落叶甚多，谓主人曰：此可以为戏。 令以物洒取之，置之於地，随叶大小，皆为鱼矣。 更弃於水，叶复如故。 有剂亮者，常至所亲家，同坐者数人，见宸过於门。 主人召之，乃至。 因谓宸曰：请先生出一术以娱宾。 宸曰：可。 顾见门前有铁砧，谓主人曰：得此铁砧，可以为戏。 因就假之。 既至，宸乃出一小刀子，细细切之，至尽。 坐客惊愕。 既而曰：假人物，不可坏之也。 乃合聚之，砧复如故。 又於袖中出一幅旧方巾，谓人曰：勿轻此，非一人有急，不可从余假之。 他人固不能得也。 乃举以蔽面，退行数步，则不复见。",
      "translated_text": "An old man once asked to share his boat to cross the river, and Yi, respecting his age, agreed. At the time, a heavy snow was falling, so Yi bought wine for them to drink together. By the time they reached the middle of the river, the wine had run out. Yi deeply regretted not having brought enough to get drunk. The old man said, \"I too have wine.\" He then untied his headscarf, took a small gourd from his topknot, and poured from it—no matter how much they drank, the wine never ran dry. Yi was astonished and held him in even greater reverence. Upon reaching the shore, the old man said to Yi, \"You are filial in serving your parents and also possess the qi of the Dao—you are teachable.\" He then imparted Daoist arts to him. From then on, Yi’s actions became uncanny, and the world called him Immortal Pan. He could scoop mercury into his hands, and when he pressed it, it would turn to silver. Once, entering a household, he saw a pond with many fallen leaves and said to the owner, \"These can be made into a game.\" He had someone scoop them up with a utensil and place them on the ground; as the leaves varied in size, they all turned into fish. When thrown back into the water, the leaves returned to their original state.\n\nThere was a man named Ji Liang who often visited the home of a relative. One day, several guests were seated together when they saw Yi passing by the door. The host called him in, and he entered. Ji then said to Yi, \"Master, please perform a trick to entertain the guests.\" Yi replied, \"Very well.\" Glancing at an iron anvil before the door, he said to the host, \"Lend me this anvil for a game.\" Once it was brought in, Yi took out a small knife and finely chopped it until it was completely minced. The seated guests were stunned. Then Yi said, \"One should not damage borrowed things.\" He gathered the pieces together, and the anvil was restored as before. He also took out an old square kerchief from his sleeve and said to the others, \"Do not underestimate this—unless someone is in dire need, do not borrow it from me. Others simply cannot obtain it.\" He then raised it to cover his face and took several steps backward, vanishing from sight.",
      "overlap_context": "variations. After Jiangnan was pacified, I was in the capital and visited Xu Shugeng, who was the grandson of Yi Zu. He knew all the affairs of the palace. I questioned him about these events, and he told me the full account.\n\n---\nPan Yi was the son of Pan Peng, a judicial assessor of the Court of Judicial Review. In his youth, he lived in Hezhou, gathering firewood on Yinglong Mountain to support his parents. Once, he crossed the river to Jinling and moored his boat at the mouth of the Qinhuai.",
      "start_char": 3877,
      "end_char": 4262,
      "start_sentence": 244,
      "end_sentence": 270,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.096141338348389,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "能背本诵所未尝见书。 或卷而封之，置之於前，首举一字，则诵之终卷。 其间点窜涂乙，悉能知之。 所为多此类，亦不复尽纪。 后亦以疾卒。 润州处士 润州处士，失姓名，高尚有道术，人皆敬信之。 安仁义之叛也，郡人惶骇，咸欲奔溃。 或曰：处士恬然居此，必无恙也。 於是人稍安堵。 处士有所亲，挈家出郡境以避难。 有女已适人，不克同往，托於处士。 处士许之。 既而围急，处士谓女曰：可持汝家一物来，吾令汝免难。 女乃取家中一刀以往。 处士刀边以手抑按之，复与之，曰：汝但持此，若端简然，伺城中出兵，随之以出，可以无患。 如言，在万众中无有见之者。 至城外数十里村店中，见其兄亦在焉。",
      "translated_text": "He could recite from memory books he had never seen before. Sometimes a sealed scroll would be placed before him, and upon being given the first character, he would recite the entire volume without error. Even corrections, deletions, or emendations within the text—he knew them all. Many of his feats were of this kind, but they cannot all be recorded here. Later, he too died of illness.\n\nA Recluse of Runzhou\nA recluse of Runzhou, whose name is lost, was lofty in conduct and possessed the Dao/Way. The people all respected and trusted him. When An Renyi rebelled, the people of the prefecture were terrified and all wished to flee. Someone said, \"The recluse remains here in tranquility—surely there will be no harm.\" Thereupon, the people gradually settled. The recluse had a close friend who took his family beyond the prefectural borders to avoid the disaster. His friend had a daughter who was already married and could not accompany them, so he entrusted her to the recluse. The recluse agreed.\n\nLater, as the siege grew urgent, the recluse said to the woman, \"Bring me one item from your household, and I will enable you to escape danger.\" She then fetched a knife from her home and brought it to him. The recluse pressed his hand along the edge of the blade, then returned it to her, saying, \"Simply hold this, standing upright and composed. When troops emerge from the city, follow them out, and you will come to no harm.\" She did as instructed, and though she was among a vast crowd, no one saw her. Several dozen *li* beyond the city, at a village inn, she saw her brother, who was also there.",
      "overlap_context": "and finely chopped it until it was completely minced. The seated guests were stunned. Then Yi said, \"One should not damage borrowed things.\" He gathered the pieces together, and the anvil was restored as before. He also took out an old square kerchief from his sleeve and said to the others, \"Do not underestimate this—unless someone is in dire need, do not borrow it from me. Others simply cannot obtain it.\" He then raised it to cover his face and took several steps backward, vanishing from sight.",
      "start_char": 4262,
      "end_char": 4537,
      "start_sentence": 271,
      "end_sentence": 288,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.335932493209839,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "女至兄前，兄不之见也。 乃弃刀於水中，复往，兄乃见之。 惊曰：安得至此？ 女具以告。 兄复令取刀持之，则不能蔽形矣。 后城陷，处士不知所之。 洪州将校 锺传之镇洪州也，尝遣衙中将校晏某使於浙中。 晏至杭州，时方寒食，州人出城，士女阗委。 晏亦出观之，见翁妪二人对饮於野中。 其翁忽尔乘云而上，万众喧呼。 妪仰望恸哭，舫为下十数丈，以手慰止之。 俄而复上，极高而没。 洪州艾氏其先识晏，亲闻其说。 史公镐 史公镐者，江南大将史公铢弟也。 性冲淡，乐道，未尝见其喜怒。 人或干之，亦不以介怀。",
      "translated_text": "The woman approached her brother, yet he did not see her. She then cast the knife into the water and returned, whereupon her brother saw her. Startled, he asked, \"How have you come here?\" She recounted all that had occurred. Her brother bade her retrieve the knife and hold it once more, but she could no longer conceal her form.\n\nLater, the city fell, and the recluse’s whereabouts became unknown.\n\nWhen General Zhong Chuan of Hongzhou was stationed there, he once dispatched a subordinate officer, Yan, on a mission to the Zhe region. Arriving in Hangzhou during the Cold Food Festival, Yan saw the townspeople streaming out of the city, men and women thronging the roads. He too went out to observe and saw an elderly couple drinking together in the wilds. Suddenly, the old man rose upon a cloud, and the crowd erupted in clamor. The old woman looked up and wept bitterly, whereupon the cloud descended some dozen *zhang*. The old man reached down to comfort her, then ascended once more, rising until he vanished from sight. The Ai family of Hongzhou, who had known Yan previously, heard this account directly from him.\n\nShi Gonggao was the younger brother of Shi Gongzhu, a great general of Jiangnan. Of a serene and unassuming nature, he delighted in the Dao and was never seen to express joy or anger. If others troubled him, he took no offense.",
      "overlap_context": ", and I will enable you to escape danger.\" She then fetched a knife from her home and brought it to him. The recluse pressed his hand along the edge of the blade, then returned it to her, saying, \"Simply hold this, standing upright and composed. When troops emerge from the city, follow them out, and you will come to no harm.\" She did as instructed, and though she was among a vast crowd, no one saw her. Several dozen *li* beyond the city, at a village inn, she saw her brother, who was also there.",
      "start_char": 4537,
      "end_char": 4776,
      "start_sentence": 289,
      "end_sentence": 306,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.549858570098877,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "既贵盛，衣服鲜楚。 每至人家，必解衣而坐，不以宾主为意。 及去，误着他人故弊衣，亦不之觉也。 或持其衣逐之，方悟，乃易之。 部尚书张翰典铨，公镐求为杨子令，已除官，不果。 翰见其旷达多可，试谓之曰：且为杨子尉，可乎？ 公镐亦听然从之。 后为瑞昌令，卒於官。 时方晴霁，而所居宅上独云雨，人有望见云雨之上有一人，绊衣乘马，冉冉而上，极高而没。 江处士 歙州江处士，性冲寂，好道，能制鬼魅。 乡里中尝有妇人，鬼所附着，家人或髻佛见之。 一夜其夫觉有人与妇共寝，乃急起持之，呼人取火共缚。 及火至，正见捉己所系腰带也。 广求符禁，终不能绝。 乃往诣江，江曰：吾虽能御之，然意不欲与鬼神为佛。 尔既告我，当为遣之。 令归家洒扫一室，令一童子烹茶，待吾至，无得令人辄窥。 如其言。 江寻至，入室坐，令童子出迎客。 果见一绿衣少年，貌甚端雅，延之入室，见江再拜。 江命坐，乃坐啜茶，不交一言，再拜而去。 自是妇人复常。 有人入山伐木，因为鬼物所着，自言曰：树乃我之所止，汝今见伐，吾将何依，当假汝身为我窟宅。 自是其人觉皮肤之内有物驰逐，自首至足，靡所不至。 人不胜其苦，往诣江。 人未至，鬼已先往。 江所居有楼，楼北有茂竹。 江方坐楼上，觉神在竹林中，呼问之。 鬼且以告，且求赦过。 江曰：吾已知矣。 寻而人至。 谓之曰：汝可於乡里中觅空屋人不居者，复来告吾。 人往寻，得之。 江以方寸纸置名与之，戒之曰：至室屋弃之。 如言而病失。 又尝有人为夔鬼所挠，其家置图画於楼上，皆为秽物所污。 以告之。 江曰：但封闭楼门三日，当使去之。 如言。 三日开之，秽物尽去，图画如故。 余有所知，世居歙州，亲见其事。 李胜",
      "translated_text": "Having attained high rank and prosperity, he wore fine and elegant clothing. Yet whenever he visited others’ homes, he would remove his outer garments and sit without regard for the formalities of host and guest. Upon departing, he might mistakenly don another’s worn and shabby clothes, entirely unaware. If someone pursued him with his proper garment, he would only then realize and exchange them.\n\nMinister of Personnel Zhang Han overs",
      "overlap_context": "d up and wept bitterly, whereupon the cloud descended some dozen *zhang*. The old man reached down to comfort her, then ascended once more, rising until he vanished from sight. The Ai family of Hongzhou, who had known Yan previously, heard this account directly from him.\n\nShi Gonggao was the younger brother of Shi Gongzhu, a great general of Jiangnan. Of a serene and unassuming nature, he delighted in the Dao and was never seen to express joy or anger. If others troubled him, he took no offense.",
      "start_char": 4776,
      "end_char": 5443,
      "start_sentence": 307,
      "end_sentence": 349,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.412557363510132,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "书生李胜，尝游洪州西山中，与处士卢齐及同人五六辈雪夜共饮。 座中一人偶言曰：雪势若此，固不可出门也。 胜曰：欲何所诣，吾能往之。 人因曰：吾有书籍在星子，君能为我取之乎，胜曰：可。 乃出门去。 饮未散，担书而至。 星子距西山凡三百余里也。 游帷观中有道士尝不礼胜，胜曰：吾不能杀之，聊使其惧。 一日道士闭户寝於室，胜令童子叩户，取李处士匕首。 道士起，见所卧枕前插一匕首，劲势犹动。 自是改心礼胜。 建康贫者 建康开城之束郊坛门外，尝有一人，不言姓名，於此面野水构、小屋而居，才可庇身，屋中唯什器一两事，余无他物。 日日入城，云乞丐，亦不历街巷市井，但入寺逍遥游观而已。 人颇知之，巡使以白上。 上令寻迩其出处，而问其所欲。 及问之，亦无所求。 时盛寒，官方施贫者袖衣，见其剧单，以一袖衣与之，辞不受。 强与之，乃转以与人。 益怪之，因逐之，使移所居，且观其所向。",
      "translated_text": "The scholar Li Sheng once traveled among the Western Mountains of Hongzhou, where he drank with the recluse Lu Qi and five or six companions on a snowy night. During the gathering, one guest remarked, \"With snow like this, surely none can venture out.\" Sheng replied, \"Where would you wish to go? I can journey there.\" The man then said, \"I have books in Xingzi—could you fetch them for me?\" Sheng answered, \"Certainly,\" and departed. Before the drinking ended, he returned bearing the books on his shoulder. Xingzi lay over three hundred *li* from the Western Mountains.\n\nAt the Youwei Abbey, a Daoist priest had once shown Sheng disrespect. Sheng declared, \"I cannot kill him, but I shall make him fear me.\" One day, as the priest slept behind closed doors, Sheng instructed a servant boy to knock and demand Li the Recluse’s dagger. The priest rose to find the dagger plunged into the pillow before him, its blade still quivering. From then on, he changed his ways and treated Sheng with reverence.\n\nIn Jiankang, a destitute man lived outside the eastern altar gate of the city’s outer wall, near the wild waters. He built a small hut, just large enough to shelter himself, containing only a few household utensils and nothing more. Each day, he entered the city, claiming to beg for alms, yet he did not wander the streets or markets but only roamed the temples at leisure. The people came to know him, and the patrol officer reported his case to the throne. The sovereign ordered his origins investigated and his desires questioned. When asked, he sought nothing. It was bitterly cold at the time, and officials were distributing winter robes to the poor. Seeing his extreme thinness, they offered him a lined garment, but he declined. Pressed to accept, he took it only to pass it on to another. Puzzled, the officials followed him, compelling him to move his dwelling to observe his destination.",
      "overlap_context": "Having attained high rank and prosperity, he wore fine and elegant clothing. Yet whenever he visited others’ homes, he would remove his outer garments and sit without regard for the formalities of host and guest. Upon departing, he might mistakenly don another’s worn and shabby clothes, entirely unaware. If someone pursued him with his proper garment, he would only then realize and exchange them.\n\nMinister of Personnel Zhang Han overs",
      "start_char": 5443,
      "end_char": 5814,
      "start_sentence": 350,
      "end_sentence": 369,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.827447175979614,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "乃毁屋，移於玄武湖西南内臣张谋果园。 多荒秽，亦有野水。 复於水际构屋居之。 时大雪数日，园人不见其出入，意其冻死。 观之，见屋已坏，曰：果死矣。 遂白官司。 既发屋视之，则方熟寝於雪中。 惊起，了无寒色。 乃去，不知所之。 陈允升 陈允升，饶州人也。 人谓之陈百年。 少而静默，好道。 家世弋猎，允升独不食其肉，亦不与人交言。 十岁诣龙虎山入道，栖隐深邃，人鲜得见之者。 家人或见之，则奔走不顾。 天佑中，人见於抚州麻姑山，计其去家七十年矣，而颜貌如初。 升元中，刺史危全讽少知其异，迎置郡中，独处一室。 时或失之。",
      "translated_text": "He then demolished the hut and moved to the southwest of Xuanwu Lake, within the orchard of the eunuch Zhang Mouguo. The land was overgrown and desolate, with wild waters as before. Again, he built a hut by the water’s edge and dwelt there. For days, heavy snow fell, and the orchard workers saw no sign of his comings or goings, suspecting he had frozen to death. Upon inspection, they found the hut in ruins and declared, “He must be dead.” They reported this to the authorities. When officials arrived to uncover the hut and investigate, they found him soundly asleep in the snow. Startled, he rose, showing no trace of cold. Then he departed, and none knew where he went.\n\nChen Yunsheng\nChen Yunsheng was a native of Raozhou. People called him \"Chen of a Hundred Years.\" From youth, he was quiet and reticent, fond of the Dao. Though his family had long been hunters, Yunsheng alone refused to eat their meat and would not speak with others. At the age of ten, he journeyed to Longhu Mountain to enter the Dao, dwelling in seclusion so deep that few ever saw him. Even when his family caught sight of him, he would flee without a glance back. During the Tianyou era, he was seen on Magu Mountain in Fuzhou. By then, seventy years had passed since he left home, yet his countenance remained as it was in youth. In the Shengyuan era, the prefect Wei Quanfeng, who had heard of his extraordinary nature, welcomed him to the prefectural seat and provided him a chamber of his own. Yet at times, he would vanish without a trace.",
      "overlap_context": "him, and the patrol officer reported his case to the throne. The sovereign ordered his origins investigated and his desires questioned. When asked, he sought nothing. It was bitterly cold at the time, and officials were distributing winter robes to the poor. Seeing his extreme thinness, they offered him a lined garment, but he declined. Pressed to accept, he took it only to pass it on to another. Puzzled, the officials followed him, compelling him to move his dwelling to observe his destination.",
      "start_char": 5814,
      "end_char": 6061,
      "start_sentence": 370,
      "end_sentence": 388,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.364211082458496,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "尝夜坐，危谓之曰：丰城橘美，颇思之。 允升曰：方有一船橘泊牢城港，今为取之。 港距城十五里，少选便还，拥一布囊，可数百颗。 因共食之。 危尝有姻礼，市黄金郡中，少不足用，颇呵责其下。 允升曰：无怒，吾能为之。 乃取厚纸，以药涂之，投於火中，皆成金。 因以足用。 后危与昊师战，允升去之，曰：慎勿入口中。 全讽不知悟，果败於象牙潭。 陈曙 陈曙，薪州善坛观道士也。 人谓为百岁，实亦不知其年。 步行，日数百里。 郡人有宴席，常虚一位以待之，远近必至。 烈祖闻而召之。 使者未至，忽叹息曰：吾老矣，何益於国，而枉见召。 后数日而使者至。 再召，竟不行。",
      "translated_text": "One night as he sat in meditation, Quanfeng said to him, \"The oranges of Fengcheng are most excellent—I find myself longing for them.\" Yunsheng replied, \"There happens to be a boatload of oranges moored at Laocheng Harbor at this moment. I shall fetch them for you.\" The harbor lay fifteen *li* from the city, yet in but a short while he returned, cradling a cloth sack containing several hundred oranges. They ate them together.\n\nOn another occasion, Quanfeng was preparing a wedding gift for a relative and had purchased gold in the prefectural seat, only to find the amount insufficient. He grew angry and berated his subordinates. Yunsheng said, \"Do not be vexed. I can provide what is needed.\" He took thick paper, coated it with an elixir, and cast it into the fire—whereupon it turned to gold. Thus, the need was met.\n\nLater, when Quanfeng went to war against Wu’s forces, Yunsheng departed, warning him, \"Take care not to enter the pass.\" Quanfeng failed to heed the warning and was indeed defeated at Ivory Pool.\n\n---\n\nChen Shu\n\nChen Shu was a Daoist of Shantan Abbey in Xinzhou. People called him \"Chen of a Hundred Years,\" though in truth no one knew his age. He could walk hundreds of *li* in a day. Whenever the gentry of the prefecture held a banquet, they would always leave an empty seat in anticipation of his arrival, and he never failed to appear, no matter the distance.\n\nWhen Emperor Liezu heard of him and summoned him, the messenger had not yet arrived when Shu suddenly sighed, \"I am old—what benefit could I bring to the state, that I should be troubled with this summons?\" Several days later, the messenger arrived. Though summoned a second time, he refused to go.",
      "overlap_context": "seclusion so deep that few ever saw him. Even when his family caught sight of him, he would flee without a glance back. During the Tianyou era, he was seen on Magu Mountain in Fuzhou. By then, seventy years had passed since he left home, yet his countenance remained as it was in youth. In the Shengyuan era, the prefect Wei Quanfeng, who had heard of his extraordinary nature, welcomed him to the prefectural seat and provided him a chamber of his own. Yet at times, he would vanish without a trace.",
      "start_char": 6061,
      "end_char": 6323,
      "start_sentence": 389,
      "end_sentence": 407,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.544173002243042,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "保大中，常至夜独焚香於庭，仰天拜祝，退而恸哭。 俄而淮上兵革，人以为预知也。 后过江，居於永兴景星废观，结庐独居。 常有虎豹随之。 人亦罕有见者。 及卒，数日方棺敛，而遍体发汗焉。 张训妻 张训者，昊太祖之将校也。 口大，时人谓之张大口。 昊太祖在宣州，常给诸将镜甲，训所得故弊，不如意，形於言色。 其妻谓之曰：此不足介意，但司徒不知，苟知之，必不耳。 明日昊公谓张曰：尔所得甲如何？ 张以告。 公乃易之。 后昊公移广陵，尝赐诸将马，训所得复驽弱。 wlI 亦不满意。 妻复言如前。 明日昊公又问之，训复以为言。 公曰… 尔家事神耶？ 训曰：无。 公曰；",
      "translated_text": "During the Baoda era, he would often burn incense alone in the courtyard at night, gaze heavenward, bow in prayer, then withdraw and weep bitterly. Soon after, warfare erupted along the Huai River, and people believed he had foreseen it. Later, he crossed the Yangtze and took up residence at the abandoned Jingxing Abbey in Yongxing, where he built a hut and lived in solitude. Tigers and leopards often followed him, though few ever saw him. When he died, his body was not encoffined for several days, yet sweat covered him entirely.\n\nZhang Xun’s Wife\n\nZhang Xun was an officer under the Wu Taizu. His mouth was unusually large, earning him the nickname \"Zhang Big-Mouth.\" While the Wu Taizu was stationed in Xuanzhou, he once distributed armor to his generals. The set Zhang received was old and shabby, and his dissatisfaction showed in his words and expression. His wife said to him, \"This is not worth fretting over. The Minister of Instruction is unaware—had he known, he surely would not have given it to you.\" The next day, the Wu Lord asked Zhang, \"How is the armor you received?\" Zhang told him the truth, and the Lord exchanged it for another. Later, when the Wu Lord moved to Guangling, he bestowed horses upon his generals. The one Zhang received was again weak and slow, and he was once more displeased. His wife repeated her earlier advice. The following day, the Wu Lord asked him again, and Zhang spoke as before. The Lord said, \"...Do you worship spirits at home?\" Zhang replied, \"No.\" The Lord said...",
      "overlap_context": "eds of *li* in a day. Whenever the gentry of the prefecture held a banquet, they would always leave an empty seat in anticipation of his arrival, and he never failed to appear, no matter the distance.\n\nWhen Emperor Liezu heard of him and summoned him, the messenger had not yet arrived when Shu suddenly sighed, \"I am old—what benefit could I bring to the state, that I should be troubled with this summons?\" Several days later, the messenger arrived. Though summoned a second time, he refused to go.",
      "start_char": 6323,
      "end_char": 6586,
      "start_sentence": 408,
      "end_sentence": 428,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.422937870025635,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "吾顷在宣州，尝赐诸将甲，是夜梦一妇人，衣真珠衣，告予曰：公赐张训甲甚弊，当为易之。 及吾问汝，果然。 乃为汝易之。 今赐诸将马，复梦前珠衣妇人告予曰：张训所得马，非良马也。 其故何哉？ 训亦不能测也。 训妻有衣箱，常自启闭，训未尝见之。 一日妻出，训窃启之，果见珠衣一袭。 及妻归，谓训曰：君开我衣箱耶？ 初，其妻每食必待其夫。 一日训归，妻已先食，谓训曰：今日以食味异常，不待君，先食矣。 训入厨，见饭中蒸一人头。 训心恶之，阴欲杀之。 妻谓曰：君欲负我耶？ 然君方为数郡刺史，我不能杀君。 指一婢曰：杀我必先杀此，不尔，君必不兔。 训遂杀妻及其婢。 后果为刺史。 董绍颜 董绍颜者，能知人。 尝诣鄂州节度使李简，简出诸子以侍绍颜。 时有平头小儿何敬沬侍简侧，绍颜曰：诸子亦皆贵，然不若此平头也。 后敬珠累授节镇，为时名将焉。 义祖镇润州，绍颜在焉。 常阅衙中诸将校品第之。 有蓝彦思者，谓绍颜曰：尔多言或中也。 绍颜曰：君勿言，郎君非善终者。 彦思曰：吾军校，死於锋刃事，吾事也，何足言哉。 绍颜曰：汝宁得好锋刃之下而死乎？ 后郡中稍有火，衙中亦为之备，盛造桶以贮水。 而军人因是持桶刀为乱，彦思死於难焉。 魏王军士 义祖子魏王知证镇宣州，有军士失姓名，家唯夫妻而已。 一日夫自外归，求水沐浴，换新衣，坐绳床而终。 妻见之大惊，曰：君死耶？ 於是不哭，亦沐浴换衣，与夫对坐而卒。 魏王因并冢葬之。 沈汾 唐末沈汾侍御退居，乐道。",
      "translated_text": "\"When I was in Xuanzhou, I once bestowed armor upon my generals. That night, I dreamed of a woman clad in a pearl-embroidered robe, who said to me: 'The armor you gave Zhang Xun is most shabby—you ought to exchange it for him.' When I questioned you the next day, it proved true, and so I replaced it for you. Now, having bestowed horses upon my generals, I dreamed again of that same pearl-robed woman, who told me: 'The horse given to Zhang Xun is no fine steed.' What is the reason for this? Xun himself could not fathom it.\n\nXun’s wife owned a clothes chest, which she always opened and closed herself, and Xun had never seen inside. One day, when his wife was out, he secretly opened it and found a pearl-embroidered robe within. Upon her return, his wife asked him: 'Did you open my clothes chest?' Initially, she would always wait for her husband before eating. One day, when Xun returned, his wife had already eaten, saying: 'Today the food tasted strange, so I did not wait for you.' Xun entered the kitchen and saw a steamed human head in the rice. His heart turned against her, and he secretly resolved to kill her. His wife said to him: 'Do you mean to betray me? Yet you are soon to be a prefect of several commanderies—I cannot kill you.' Pointing to a maidservant, she added: 'If you wish to kill me, you must kill her first. Otherwise, you will not escape.' Xun then killed both his wife and the maidservant. Later, he indeed became a prefect.\n\nDong Shaoyan\nDong Shaoyan was a man who could discern others’ potential. Once, he visited Li Jian, the military governor of Ezhou, who presented his sons for Shaoyan to meet. At the time, a young servant named He Jingmei stood by Li Jian’s side. Shaoyan said: 'All your sons will attain high rank, yet none will surpass this servant.' Later, He Jingmei rose through the ranks to become a military governor and a renowned general of his time.\n\nWhen the Founding Ancestor was stationed in Runzhou, Shaoyan was in his service. He often assessed the officers in the garrison, ranking their qualities. A certain Lan Yansi said to him: 'Your words often prove accurate.' Shaoyan replied: 'Say no more—our young lord will not meet a good end.' Yansi said: 'I am but a military officer; if I die by the sword, it is my duty. What is there to speak of?' Shaoyan said: 'Would you rather die beneath a fine blade?' Later, when a fire broke out in the city, the garrison made preparations, crafting many buckets to store water. The soldiers, however, seized the opportunity to take up buckets and blades and rebel. Yansi perished in the chaos.\n\nA Soldier of Prince Wei\nPrince Wei, the Founding Ancestor’s son, was stationed in Xuanzhou. Among his soldiers was a man whose name is lost, whose household consisted only of himself and his wife. One day, the husband returned from outside, asked for water to bathe, changed into fresh clothes, and sat upon a rope bed—then died. His wife, seeing this, was greatly startled and said: 'Have you died?' Without weeping, she bathed, changed her clothes, and sat facing her husband—then passed away. Prince Wei buried them together in a single grave.\n\nShen Fen\nAt the end of the Tang, Shen Fen, a censor, retired from office and delighted in the Dao.\"",
      "overlap_context": "e next day, the Wu Lord asked Zhang, \"How is the armor you received?\" Zhang told him the truth, and the Lord exchanged it for another. Later, when the Wu Lord moved to Guangling, he bestowed horses upon his generals. The one Zhang received was again weak and slow, and he was once more displeased. His wife repeated her earlier advice. The following day, the Wu Lord asked him again, and Zhang spoke as before. The Lord said, \"...Do you worship spirits at home?\" Zhang replied, \"No.\" The Lord said...",
      "start_char": 6586,
      "end_char": 7182,
      "start_sentence": 429,
      "end_sentence": 467,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.659854650497437,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "家有二妾，一日谓之曰：我若死，尔能哭我乎？ 妾甚愕曰：安得不祥之言？ 因问之。 对曰：苟若此，安得不哭。 汾曰：汝今试哭，吾欲观之。 妾初不从，强之不已，妾走避之。 汾执而扶之，妾不得已，乃曰：君但升榻而坐。 汾如言。 二妾左右拥袂而哭。 毕，视之，汾已卒矣。 虔州少年 虔州将校钟某者，泛舟之广陵，经太和戍，泊舟登岸，见一少年，貌甚端雅，亦求同载往扬州。 锺许之，遂同行。 因江次上岸，共行市中，见屠肆有豕首，欲市之而无钱。 少年曰：此亦小事。 及还船，出豕首於袖中，因曰：适以无钱而取之，今当还其值。 乃复至屠所，谓曰：吾先付尔钱，少顷还取肉。 屠得钱，乃不复取肉。 及至广陵，与锺同舍於逆旅。 一日有轻侠数人，行戏至店中。 少年指一青衣曰：此必今夕为盗耳，宜备之。 锺不甚信。 中夜觉穴壁声，伺其已穿，引首过宝，乃举烛急持之。 果少年所指者。 因谓盗曰：汝未获财，不欲杀汝。 遂听其去。 后忽谓锺曰：不可久处。 促之归去。 锺如言。",
      "translated_text": "A man with two concubines once said to them, \"If I should die, would you weep for me?\" The concubines were greatly startled and said, \"How could you speak such inauspicious words?\" He pressed them, and they replied, \"If it were so, how could we not weep?\" Shen Fen said, \"Weep for me now, that I may see.\" At first, they refused, but he insisted without cease. The concubines fled to avoid him, but he seized and steadied them. Unable to resist, one finally said, \"Simply ascend the bed and sit.\" Shen Fen did as she said. The two concubines stood on either side, clutching his sleeves, and wept. When they finished, they looked—Shen Fen had already passed away.\n\nA Youth of Qianzhou\nIn Qianzhou, there was an officer named Zhong who sailed a boat to Guangling. Passing Taihe Garrison, he moored and went ashore, where he saw a youth of refined and elegant appearance. The youth also sought passage to Yangzhou. Zhong agreed, and they traveled together. Once, while ashore by the river, they walked through the market, where Zhong saw a pig’s head at a butcher’s stall. He wished to buy it but had no money. The youth said, \"This is a small matter.\" Upon returning to the boat, he produced the pig’s head from his sleeve and said, \"I took it earlier for lack of coin, but now I shall repay its value.\" He returned to the butcher and said, \"I will pay you first; I will return shortly for the meat.\" The butcher took the money but did not retrieve the meat.\n\nWhen they reached Guangling, Zhong and the youth lodged together at an inn. One day, several roguish young men came to the inn to amuse themselves. The youth pointed to a servant in black and said, \"This one will surely be a thief tonight—guard against him.\" Zhong did not fully believe him. In the middle of the night, he heard the sound of a wall being breached. When the hole was large enough for a head to pass, he thrust his own through with a candle and seized the thief—it was indeed the one the youth had pointed out. He said to the thief, \"You have not yet taken anything, so I will not kill you.\" He let the man go.\n\nLater, the youth suddenly said to Zhong, \"We cannot stay here long.\" He urged him to return home. Zhong did as he said.",
      "overlap_context": "household consisted only of himself and his wife. One day, the husband returned from outside, asked for water to bathe, changed into fresh clothes, and sat upon a rope bed—then died. His wife, seeing this, was greatly startled and said: 'Have you died?' Without weeping, she bathed, changed her clothes, and sat facing her husband—then passed away. Prince Wei buried them together in a single grave.\n\nShen Fen\nAt the end of the Tang, Shen Fen, a censor, retired from office and delighted in the Dao.\"",
      "start_char": 7182,
      "end_char": 7579,
      "start_sentence": 468,
      "end_sentence": 496,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.403082847595215,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "及至日沙，而朱瑾杀昌化城中，惊扰焉。 闽中处士 闽中处士张标者，有道术，能通於冥府。 或三日、五日卧如死，而体不冷。 既苏，多说冥中事。 或言未来，一一皆验。 郡中大信之。 王保宜者，唐末为闽师，持章赴朝廷，道路不通。 乃泛海，因溺死。 其孙侃留居闽中，因家人疾，请标祷於冥府。 标从之，因曰：见君之先父在水府，有冥职。 言其家事委曲，一一皆是。 洪州书生 成幼文为洪州录事参军，所居临通衢，而有窗。 一日坐窗下，时雨霁，泥泞而微有路。 见一小儿卖鞋，状甚贫窦。 有一恶少年与兄相遇，桂鞋坠泥中。 小儿哭求其价。 少年叱之，不与。 儿曰：吾家旦未有食，待卖鞋营食，而悉为所污。 有书生过，悯之，偿其＃２值。 少年怒曰：儿就我求钱，汝何预焉。 因辱骂之。 生甚有愠色。 成嘉其义，召之与语，大奇之。 因留之宿。 夜共话，成暂入内，及复出，则失书生矣。 外户皆闭，求之不得。 少顷复至前，曰：但来恶子，吾不能容，已断其首。 乃掷之於地。 成惊曰．一此人诚作君子，然断人之首，流血在地，岂不见累乎？ 书生曰：无苦。 乃出少药傅於头上，拌其发摩之，皆化为水。 因谓成曰：无以奉报，愿以此卫授君。 成曰：某非方外之士，不敢奉教。 书生於是长揖而去。 重门皆锁闭，而失所在。 糁潭渔者 昊太祖为庐州八营都巡警，至糁潭，憩於江岸。 有渔父鼓舟直至前，绩鱼数头曰：此犹公子孙鳞次而霸也。 因四指曰：此皆公之山川。 昊公异之，将遗以物，不顾而去。 瞿童 瞿童，字梧庭，以字为名，辰州辰溪人也。 华眉广颗，长准秀目，勤事而寡言。 大历四年西川溃将杨林为澧阳守，不戢部下兵，纵其党贾子华率千人假道武陵劫五溪。 五溪之人逃难四散。 时桥庭十四，侍母走武陵，寓居崇义乡乌头里桃源观道士黄山宝偏宅。 梧庭因山宝愿师事上清三洞法师黄洞源。 山宝引觊，具道梧庭志。 洞源辞以梧庭奉母须甘旨。 山宝曰：梧庭母在山宝庐，幸有继给，倘蒙收拾贫贱，所望容纳。 洞源许之。 后亦时给梧庭母衣食。 仅二周载，六年正月，梧庭丧母。 既葬，服勤事洞源不懈。 凡事役，力办不倦。 抛弃恶食，必兴爱惜，辞而饭之。 七月，洞源买药至襄阳市，每入市，令梧庭持装祟，梧庭必闭目处中。 洞源让曰：处众而睡，人夺汝携。 梧庭曰：非有睡也，闷众之喧喧耳。 九月，洞源南归，行及宜城，去襄阳百余里，洞源遽曰：香炉捐主人，奈何？ 梧庭请复取，白洞源暂休以俟。 不时顷，持炉还。 洞源惊问，答曰：尊师方在途，恐留滞，故疾行。 洞源信然。 七年二月，朗州刺史胡叔清招洞源下郡，赴之。 留桥庭山中植果药。 瑜二十日，洞谅来，相庭一不。 请之，答曰：自尊师去州，祇於传林寻传穴。 洞源问所寻何见。 答曰：见石室石床石几。 洞源曰：石室何许？ 曰：约去一里半。 洞源疑而不穷。 又旬，桥庭於艺圃中得一棋子。 捧呈洞源曰：秦人棋子。 洞源异之，曰：谁为谓汝，乌知其然？ 复曰：是诚秦人棋子。 洞源谛视之，状若小龟，光润如玉，遂贮录囊中。 复因阅录，开囊，缄记如旧，亡棋子矣。 夏四月，忽白洞源：愿屈归岩洞。 时久霖雨责。 洞源既未决信，竟不果行。",
      "translated_text": "When they reached Rishao, Zhu Jin killed someone in Changhua City, causing great alarm and disturbance.\n\nThere was a recluse from Minzhong named Zhang Biao, who possessed Daoist arts and could communicate with the netherworld. Sometimes he would lie as if dead for three or five days, yet his body remained warm. Upon reviving, he often spoke of matters in the underworld. Whatever he foretold invariably came to pass, and the people of the prefecture deeply believed in him. A man named Wang Baoyi had served as a general in Min during the late Tang, carrying an imperial edict to the court when the roads became impassable. He took to the sea but drowned. His grandson, Wang Kan, remained in Min and, due to a family member’s illness, asked Zhang Biao to pray to the netherworld on their behalf. Biao complied and said, \"I saw your grandfather in the Water Palace, where he holds an office in the underworld.\" He recounted the details of Wang’s family affairs, all of which were accurate.\n\nIn Hongzhou, a scholar named Cheng Youwen served as Recorder. His residence faced a thoroughfare, with a window overlooking the street. One day, as he sat by the window after the rain had cleared, the ground was muddy with only a narrow path. He saw a young boy selling shoes, looking extremely poor. A wicked youth encountered his elder brother, and in their scuffle, a shoe fell into the mud. The boy wept, begging for its price, but the youth scolded him and refused. The boy said, \"My family has had nothing to eat since morning. I was waiting to sell these shoes for food, but now they’re all ruined.\" A passing scholar took pity on him and compensated him for the shoe. The wicked youth grew angry and said, \"The boy came to me for money—what business is it of yours?\" He then cursed the scholar, who showed signs of anger. Cheng admired the scholar’s righteousness, called him over, and spoke with him, finding him extraordinary. He invited the scholar to stay the night. As they conversed late into the night, Cheng briefly went inside. When he returned, the scholar had vanished. Though all the doors were locked, he could not be found. Moments later, the scholar reappeared and said, \"That evil youth came, and I could not tolerate him. I have already cut off his head.\" He threw it to the ground. Cheng was shocked and said, \"This man was indeed a gentleman, but to cut off someone’s head and leave blood on the ground—won’t this implicate you?\" The scholar replied, \"Do not worry.\" He took out a small amount of medicine, applied it to the head, and rubbed the hair, which turned to water. He then said to Cheng, \"I have nothing to repay you, but I wish to give you this protective art.\" Cheng said, \"I am not a man of the Daoist realm and dare not accept your teaching.\" The scholar bowed deeply and left. Though all the gates were locked, he disappeared without a trace.\n\nDuring the time when Emperor Taizu of Wu was the Commander of the Eight Garrisons of Luzhou, he arrived at Santan and rested on the riverbank. A fisherman rowed his boat directly before him and presented several fish, saying, \"These are the scales of your descendants, generation after generation.\" Then, pointing in all four directions, he said, \"All these are your mountains and rivers.\" The Emperor found this strange and tried to give him something, but the fisherman left without a glance.\n\nQu Tong, styled Wuting, took his style as his name and was a native of Chenxi in Chenzhou. He had arched eyebrows, a broad forehead, a long nose, and bright eyes. He was diligent in his duties but spoke little. In the fourth year of the Dali era, Yang Lin, a defeated general from Xichuan, became the governor of Liyang. He failed to restrain his troops, allowing his subordinate Jia Zihua to lead a thousand men through Wuling to plunder the Five Streams. The people of the Five Streams fled in all directions. At the time, Wuting was fourteen. He accompanied his mother to Wuling and took refuge in the side residence of Daoist Huang Shanbao of Taoyuan Abbey in Chongyi Township. Wuting, through Shanbao, expressed his wish to become a disciple of Huang Dongyuan, a master of the Shangqing Three Caverns. Shanbao introduced him, fully conveying Wuting’s aspirations. Dongyuan declined, saying that Wuting had to care for his mother and needed fine food. Shanbao replied, \"Wuting’s mother is in my care, and I am fortunate to have enough to provide for her. If you would accept him despite his poverty, I hope you will take him in.\" Dongyuan agreed and later occasionally provided Wuting’s mother with clothing and food. After just over two years, in the first month of the sixth year, Wuting’s mother passed away. After the burial, he served Dongyuan diligently and tirelessly. In all tasks, he worked hard without complaint. He would discard poor food, showing care and respect, and then eat. In the seventh month, Dongyuan went to Xiangyang to purchase medicine. Whenever he entered the market, he had Wuting carry his belongings, and Wuting would close his eyes and stand in the crowd. Dongyuan scolded him, saying, \"If you sleep in the crowd, someone will steal your load.\" Wuting replied, \"I am not sleeping; I am just bothered by the noise of the crowd.\" In the ninth month, Dongyuan returned south. When they reached Yicheng, over a hundred *li* from Xiangyang, Dongyuan suddenly said, \"I left the incense burner with the innkeeper—what should we do?\" Wuting asked to retrieve it and told Dongyuan to rest briefly while he waited. In no time, he returned with the burner. Dongyuan asked in surprise, and Wuting replied, \"I feared you would be delayed on the road, so I hurried.\" Dongyuan believed him. In the second month of the seventh year, Hu Shuqing, the prefect of Langzhou, invited Dongyuan to the prefectural seat. Dongyuan went, leaving Wuting in the mountains to plant herbs and fruits. After twenty days, Dongyuan returned and asked Wuting if he had been anywhere. Wuting replied, \"Since you left for the prefecture, I have been searching for a cave in the woods.\" Dongyuan asked what he had seen, and Wuting said, \"I saw a stone chamber with a stone bed and a stone table.\" Dongyuan asked, \"Where is this stone chamber?\" Wuting replied, \"About one and a half *li* away.\" Dongyuan was doubtful but did not press further. Another ten days later, Wuting found a chess piece in the garden. He presented it to Dongyuan and said, \"This is a Qin man’s chess piece.\" Dongyuan found it strange and asked, \"Who told you this? How do you know?\" Wuting insisted, \"It is truly a Qin man’s chess piece.\" Dongyuan examined it closely—it resembled a small turtle, smooth and lustrous like jade—and placed it in his green silk bag. Later, when he opened the bag to check, the seal was still intact, but the chess piece was gone. In the summer of the fourth month, Wuting suddenly told Dongyuan, \"I wish to return to the mountain cave.\" At the time, there had been continuous heavy rain. Though Dongyuan was not entirely convinced, he ultimately did not go.",
      "overlap_context": "gainst him.\" Zhong did not fully believe him. In the middle of the night, he heard the sound of a wall being breached. When the hole was large enough for a head to pass, he thrust his own through with a candle and seized the thief—it was indeed the one the youth had pointed out. He said to the thief, \"You have not yet taken anything, so I will not kill you.\" He let the man go.\n\nLater, the youth suddenly said to Zhong, \"We cannot stay here long.\" He urged him to return home. Zhong did as he said.",
      "start_char": 7579,
      "end_char": 8803,
      "start_sentence": 497,
      "end_sentence": 580,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.3539981842041,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "八年五月二十七日始昕。 洞源命桥庭河畔视船，往复不二里，及午方回。 洞谅诃之：来何迟？ 梧庭曰：观西南十五步许，有小桥，桥上遇一老尊，负杖挂物，呼令随去。 桥庭不敢，由是晚。 三十早朝，褫常所布带，以一纸绳东腰，胱足，履草屦，升尊殿，及洞源严修之处，各焚香跪拜。 既而辞洞源，又拜。 洞源托几问曰：汝辞吾，安往？ 答曰：归传洞。 洞源曰：吾随汝，可乎？ 曰：不可。 洞源又曰：何为不可？ 桥庭曰：前时尊师不央去，乃今不可。 因谕洞源，当以时迁栖。 洞源曰：十年易居，昔贤遗旨，吾有志矣。 今汝去，何时复见？ 答曰：期十八年。 洞源欲留之，不克，即声命同观道士朱灵否曰：朱老师，看传人来。 灵否睨梧庭曰：童子今日颜色异常光辉。 洞源门人胡清镐、朱神静、童子陈景昕、谭伯地偕园瞩。 桥庭服短布衣、乌缯巾，遗巡却行，三移步，忽然不见。 洞源与道徒皆愕盼。 庭际有一栗树，谓暂旁立。 洞源曰：得无映树乎？ 求之，无综。 即声钟集观户，将遍索林莽。 观户至东北林际，遇一大蛇当路而止。 十一年，兄倦信从辰州来，闻弟登传。 至桃源，又师事洞谅为道士。 岩薜两茂，游嵩山，失所止。 建中元年四月，洞源迁居江州庐山。 贞元五年十一月，复迁居润州茅山。 十八年春，润州邮檄人於延陵县界见一少年前行，行如人。 邮者促步期及，竟不能。 迭延陵，闯茅山三十里，邮人望见徐步入山门。 是日女道士萧玲然在鹤台，见少年持小漆函盖贮素书，直未及门，举一足履闽。 玲然问曰； ．汝为谁？",
      "translated_text": "On the twenty-seventh day of the fifth month in the eighth year, Wuting rose at first light. Dongyuan sent him to the riverside to inspect a boat, a journey of no more than two *li* round-trip, yet he did not return until noon. Dongyuan reproached him: \"Why so late?\" Wuting replied, \"About fifteen paces southwest of here, there stands a small bridge. On it, I met an elder, staff in hand and burden slung over his shoulder, who called me to follow. I dared not, and so returned late.\"\n\nAt dawn on the thirtieth day, Wuting removed his usual cloth sash and bound his waist with a paper cord. Barefoot, he donned straw sandals and ascended to the hall of veneration, where he burned incense and knelt in prostration before Dongyuan’s altar of cultivation. Then, bidding Dongyuan farewell, he bowed once more. Dongyuan, leaning on his desk, asked, \"Where do you go when you leave me?\" Wuting answered, \"I return to the Transmitted Grotto.\" Dongyuan said, \"May I follow you?\" Wuting replied, \"You may not.\" Dongyuan pressed, \"Why not?\" Wuting explained, \"The venerable master did not summon you before, and so you may not now.\" He then advised Dongyuan to relocate his dwelling in due time. Dongyuan replied, \"To change one’s abode every ten years was the teaching of the ancients—I have long held this intention. But when you leave, when shall I see you again?\" Wuting answered, \"After eighteen years.\"\n\nDongyuan sought to detain him but could not. He then called out to Zhu Lingfou, a Daoist of the same temple: \"Master Zhu, come see the one who transmits the Way.\" Lingfou glanced at Wuting and remarked, \"The boy’s countenance today shines with extraordinary radiance.\" Dongyuan’s disciples—Hu Qinghao, Zhu Shenjing, the novice Chen Jingxin, and Tan Bodi—all watched from the garden. Wuting, clad in a short hemp robe and black silk headscarf, stepped back hesitantly. After three retreating strides, he vanished suddenly. Dongyuan and the Daoist disciples stared in astonishment. Nearby stood a chestnut tree, and they wondered if he had concealed himself behind it. Searching, they found no trace. Dongyuan then struck the bell to gather the temple’s inhabitants, intending to scour the woods. As the gatekeepers reached the northeastern edge of the forest, a great serpent blocked their path.\n\nIn the eleventh year, Wuting’s elder brother, Juanxin, came from Chen Prefecture and heard of his brother’s ascent to the Transmitted Grotto. Journeying to Taoyuan, he became Dongyuan’s disciple and took up the Daoist path. Later, as the cliffs flourished with moss and vines, he traveled to Mount Song but vanished without a trace.\n\nIn the fourth month of the first year of the Jianzhong era, Dongyuan relocated to Mount Lu in Jiang Prefecture. In the eleventh month of the fifth year of the Zhenyuan era, he moved again to Maoshan in Run Prefecture. In the spring of the eighteenth year, a postal courier in Run Prefecture spotted a youth walking ahead of him along the border of Yanling County. Though the courier quickened his pace, he could not close the distance. The youth entered Maoshan, thirty *li* from Yanling, and the courier saw him stride unhurriedly through the mountain gate.\n\nThat day, the Daoist nun Xiao Lingran was at Crane Terrace when she saw a young man carrying a small lacquered box, its lid holding a plain letter. He had not yet reached the gate when he lifted one foot to step over the threshold. Lingran asked, \"Who are you?\"",
      "overlap_context": "g insisted, \"It is truly a Qin man’s chess piece.\" Dongyuan examined it closely—it resembled a small turtle, smooth and lustrous like jade—and placed it in his green silk bag. Later, when he opened the bag to check, the seal was still intact, but the chess piece was gone. In the summer of the fourth month, Wuting suddenly told Dongyuan, \"I wish to return to the mountain cave.\" At the time, there had been continuous heavy rain. Though Dongyuan was not entirely convinced, he ultimately did not go.",
      "start_char": 8803,
      "end_char": 9392,
      "start_sentence": 581,
      "end_sentence": 618,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.057286739349365,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "答曰：瞿梧庭。 因问玲然：黄尊师何在？ 玲然指示路处，髻髭记有相庭名。 卒然不悟，久之忽了辨。 即摄衣诣洞源，问：．瞿梧庭来乎？ 洞源唯唯，不明谕。 秋八月既朔之旬，洞源谓门弟子曰：吾将蹈沧海，为备装。 或以未可行为请。 瑜一年，当午，洞源化真造曰：代人传瞿童登僇之迹，皆怪异可惑。 予自幼贬武陵守，至之日，则详询旧老，乃诙诡加甚。 值暇日游沅江，沧浪合流，闻之於渔人曰：梧庭有同学陈景昕，已五从居，今复为桃源观道士，易名通微，又改正长。 始均执劳，久练行事。 传疑百说，不若一见。",
      "translated_text": "He answered, \"Qu Wuting.\"\n\nThen he asked Lingran, \"Where is the Venerable Master Huang?\" Lingran pointed out the way, and Wuting noted the path in his topknot. Suddenly, he seemed not to comprehend, but after a long while, he abruptly understood. Straightaway, he gathered his robes and hastened to Dongyuan, asking, \"Has Qu Wuting arrived?\"\n\nDongyuan merely assented without giving a clear reply.\n\nIn the first decade of the eighth month after the new moon of autumn, Dongyuan addressed his disciples, saying, \"I shall tread the azure sea; prepare my provisions.\" Some entreated him not to depart so soon. A year later, at noon, Dongyuan transformed and manifested in his true form, declaring, \"I have been charged to transmit the traces of the boy Qu’s ascent to execution—all strange and bewildering. Since my youth, when I was demoted to serve as Prefect of Wuling, upon my arrival, I made careful inquiries of the elders, and their accounts were even more absurd. On a day of leisure, I wandered to the Yuan River, where it converges with the Canglang. A fisherman told me, 'Wuting had a fellow student named Chen Jingxin, who has lived in five places. Now he is a Daoist at Peach Blossom Spring Abbey, having changed his name to Tongwei and later to Zhengchang. At first, they shared toils equally, but over time, he refined his conduct.' A hundred dubious tales are not worth a single sighting.\"",
      "overlap_context": "of him along the border of Yanling County. Though the courier quickened his pace, he could not close the distance. The youth entered Maoshan, thirty *li* from Yanling, and the courier saw him stride unhurriedly through the mountain gate.\n\nThat day, the Daoist nun Xiao Lingran was at Crane Terrace when she saw a young man carrying a small lacquered box, its lid holding a plain letter. He had not yet reached the gate when he lifted one foot to step over the threshold. Lingran asked, \"Who are you?\"",
      "start_char": 9392,
      "end_char": 9621,
      "start_sentence": 619,
      "end_sentence": 631,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.6043524742126465,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "予得合。 忘食，遂命近之，未获至，若不克见。 及期而朝门吏导景昕前庭，冠青萝冠，碧绿衣，冰颜雪肤，皓髭苍眉，端简足迹，肃容陈词，予不知幸之喜之至也。 ，既至，休绾，徐徐阅所惑，景为具辨。 因裂椟直纪，用怯后疑。 长庆二年五月三日朗州刺史温造述，上清三洞道士陈通微传实。 此记乃简兴亲剖，曩为好事者磨去重刻，惟存碑侧数字。 江淮异人录竟 ＃１『须夷』原作『须吏』，据上下文义改。 ＃２『其』原作『具』，据上下文义改。",
      "translated_text": "Having obtained the opportunity, I forgot even to eat. I immediately ordered him to approach, yet before he arrived, it seemed I could scarcely bear the wait. When the appointed day came, the gate officer led Jingxin into the front courtyard. He wore a crown of green vine, a robe of jade-green, his countenance like ice, his skin like snow, with a snowy beard and hoary brows. His steps were measured, his bearing solemn, and as he spoke, I knew not whether to count myself fortunate or overjoyed.\n\nOnce he arrived and settled, I slowly recounted all that had perplexed me, and Jingxin provided a full and clear explanation. Thereupon, I tore open a case and recorded his words directly, to dispel future doubts.\n\nComposed on the third day of the fifth month in the second year of Changqing by Wen Zao, Prefect of Langzhou. *A True Account of Chen Tongwei, Daoist of the Three Caverns of Supreme Clarity.*\n\nThis record was originally inscribed on bamboo slips, later effaced by meddlesome enthusiasts and re-engraved. Only a few characters remain on the side of the stele.\n\n*Jiang-Huai Records of Extraordinary Persons* concludes.",
      "overlap_context": "inquiries of the elders, and their accounts were even more absurd. On a day of leisure, I wandered to the Yuan River, where it converges with the Canglang. A fisherman told me, 'Wuting had a fellow student named Chen Jingxin, who has lived in five places. Now he is a Daoist at Peach Blossom Spring Abbey, having changed his name to Tongwei and later to Zhengchang. At first, they shared toils equally, but over time, he refined his conduct.' A hundred dubious tales are not worth a single sighting.\"",
      "start_char": 9621,
      "end_char": 9828,
      "start_sentence": 632,
      "end_sentence": 641,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.229717969894409,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\江淮异人录.txt",
        "category": "记传类"
      }
    }
  ]
}