{
  "source_id": "洗髓经",
  "source_file": "chunked_daozang\\洗髓经.json",
  "total_chunks": 3,
  "total_original_chars": 2240,
  "total_translated_chars": 12726,
  "total_translation_time": 66.99226522445679,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\洗髓经.txt",
    "category": "藏外"
  },
  "full_translation": "Thus have I heard. At one time, the Buddha addressed Subhūti:\n\nOnly after completing the *Yijin* practice may one undertake this. This is called the \"Bell of the Silent Night,\" which does not hinder worldly affairs. By day, one may rush about, busied with clothing and food. After the three meals are finished, one disperses the winds of water and fire. At dusk, when the evening star appears, lamps are lit to illuminate the dark chamber. When the evening’s tasks are done, one rests upon the sleeping mat. The multitude all snore in slumber, forgetting birth and death. The wise alone remain awake, cultivating in the dark of night. Stroking the body, they sigh for this evening—another day has passed. Impermanence comes swiftly; the body is like a fish in scant water. How can one be saved? When will blessings and wisdom suffice?\n\nThe Four Graces remain unrepayed, the Four Conditions unsevered, the Four Wisdoms not yet manifest, the three lives not yet returned to the One. Silently observing the dharmadhātu, the four births and three realms are prepared, the six senses and six dusts entwined, the five aggregates and three paths—gods, humans, and asuras. The six destinies each follow their own course; the Two Truths remain unmerged, the Six Perfections unfulfilled. Seeing is not true seeing; ignorance is not yet stilled. The Dao-eye is not yet clear, the eyebrows have not yet fallen to the ground. How can one know that seeing has departed, attaining the meaning of Nirvāṇa?\n\nIf one could see what is not seen, perceive what cannot be reached—then the great thousand worlds would fit within a snail’s horn, and Mount Sumeru would nestle in a scorched eye. Yet in the stupor of drunken dreams, both light and time are lost. Adrift in the cycle of birth and death, the sea of suffering knows no bounds. Out of great compassion, the Tathāgata expounded this *Xisui Jing*.\n\nAfter the *Yijin* practice, in the stillness of night, let the eyes contain inner light, the breath in the nose be subtle, the abdomen spacious and empty—then is the time to receive the pure and radiant qi. On the new and full moons, the waxing and waning quarters, the equinoxes and solstices, at midnight and noon, guard the stillness; at dawn and dusk, perform the dry ablutions. All is created by the mind; refine the spirit to emptiness and quiescence. Remain ever wakeful and unobscured; let not the demon of sleep bind you. Night after night, thus should it be; day after day, one must persist. Only emptiness can contain; a full stomach is not fitting. Humility and harmony preserve the body; pestilence and evil must be strictly avoided. Temporarily cherish what can be cultivated as real; the four great elements must be secured. Gentleness sustains the body; violence and aggression invite calamity.\n\nTo cross the river, one needs a raft; only upon reaching the shore may it be discarded. The principles of creation and generation proceed from the subtle to the manifest. A single word may reveal the celestial mechanism—advance gradually, pondering carefully. With time, fulfillment comes naturally; one cannot rush to attain it. Success has its fixed term—three years, nine years, or more. Within a twelve-year cycle, it will surely not exceed this span. When the mind is empty, the body transforms of itself, following its inclinations without hindrance. All is unobstructed; one attains the perfection of observation and freedom. Concealed or revealed, one delivers sentient beings, transcending the beginningless in a snap of the fingers. Awaiting repayment of the Fourfold Grace, forever reducing the suffering of the three evil destinies.\n\nThose who come after and receive this sutra should uphold it as their guiding principle. Choose worthy persons for transmission, and admonish them not to take it lightly.\n\n**The First Chapter: The Primordial Qi of the Beginningless Bell**\n\nThe cosmos holds supreme principles, inaccessible to ear and eye. Whatever can be fathomed belongs to the primordial qi. Qi does not move without principle; principle does not manifest without qi. Interwoven, they become one; divided, they cannot be separated. Flowing without obstruction, the myriad things depend upon them for life. They penetrate metal and shape stone, coexisting with water and fire, proceeding together without harm. Principle and qi are thus.\n\n**The Lifeforce Conceals the Mechanism of Death; Within Death Lies the Intent of Life**\n\nWhere life arises, the mechanism of death lies concealed; within death, the intent of life persists. Principle employs qi as its function; qi relies on principle as its substance. Through substance, function is revealed; through function, substance is sought. Yet neither substance nor function stands alone—both dissolve when divided. Neither principle nor qi exists independently; a single phrase unlocks the celestial mechanism.\n\nAdvance beyond the hundred-foot pole’s summit—from the primordial, there is no beginning. Only by grasping this meaning may one speak of marrow-washing.\n\n**The Second Chapter: The Four Great Elements as Provisional Convergence**\n\nThe primordial qi, long suffused in mist, transforms into water, fire, and earth. Water surges from Kunlun’s peak, flowing into valleys and chasms. In stillness, warmth arises; within water, fire resides. Moisture and heat ascend as vapor, becoming rain and dew. They give life to humans and all beings, bestowing benefits upon the world.\n\nWater, when settled long, becomes earth; fire is the warmth of qi. The human body is a microcosm—none can compare. This illusory, mutable form is but the residue of qi. Originally, it was never ours; when dissolved, it returns to the Great Void. Birth was never truly birth; death was never truly death. When does the bodily frame ever endure? Even in old age, it outlasts heaven and earth. Borrowing the provisional to unite with the real, one transcends the mundane.\n\nPenetrate the *Marrow-Washing Classic*, and longevity knows no end. Without the provisional, the real cannot be revealed; real and provisional intermingle without boundary. Thus should one contemplate: the real and the provisional are not two.\n\nThe four great elements converge in form—who can distinguish them?\n\n**The Third Chapter: The Common Return of the Mundane and the Sage**\n\nThe mundane take the provisional for the real, adorning the body with fine garments, seeking only the gaze of others. Daily, they indulge in rich foods—all people live thus. Burdened by the affairs of a single life, they have no leisure to ponder birth and death. Ensnared by fame and profit, one day their spirit and qi scatter. The lamp gutters when the oil is spent; the corpse is buried in the wilds. The startled soul is seized by a dream—endless suffering, ceaseless toil, an illusory realm without respite.\n\nThe sage alone recognizes the real: clad in coarse cloth, subsisting on plain fare, free from greed to maintain integrity, unburdened by the body or speech. They penetrate heaven and earth, seeing them as one with the self. Though forms differ in size, their spiritual vitality is fundamentally the same.\n\nHeaven and earth possess sun and moon; the human body has its two eyes. Sun and moon wax and wane; stars and lamps follow in succession. Even if stars and lamps extinguish, the seeing nature never perishes. Though one may become blind, the hand still finds the nose. The entire body is an eye—touch reveals the object’s presence.\n\nThis is the spirit of the mind, encompassing heaven and earth. It sees without eyes, hears without ears. When the mind is pure and unassailed by desires, it knows its original abode and returns to its source.\n\nThe mundane and the sage share the same eyes, the same straight nose. They come together but do not return the same, for the former scatters outward. If one can gather the scattered mind and contemplate birth and death, seizing this time of robust health, applying diligent effort—washing the marrow to restore the original source—the mundane and the sage become one.\n\n**The Fourth Chapter: The Unity of Self and All Things**\n\nThe myriad things are not myriad things—they share a single body with me. Illusory forms emerge, aiding the intent of life. Where there are people, there must be things: clothing and food, medicine, remedies, and vessels. Lacking even one, completeness is lost.\n\nFlying, swimming, moving, and growing—all beings serve humanity. How vast is creation’s design! Yet wanton killing is cruelty. Mayflies and mosquitoes live but a day; tortoises, cranes, elk, and deer eat little and refine qi, thus enduring many years. Why do humans fall short of creatures? Only because they crave clothing and food, forgetting birth and death.\n\nIf one can sever desire, self and all things become one.\n\n**The Fifth Chapter: Walking, Standing, Sitting, and Reclining**\n\nWalking is like a blind man without his staff—turn inward to illuminate the nature of your being. Lift your feet low and slow, pressing firmly before advancing. Step by step, ever thus, ever wary of haste. The world’s path is fraught with errors in haste; a measured pace ensures peace.\n\nStanding is like a horse at the cliff’s edge, or a boat that has reached the shore. Swiftly turn the light inward, recognizing the ground beneath your feet. Do not stray from the present thought; guard your mind, forsaking all distractions. When stillness is found, know stillness; attend with care, as if guarding an empty valley. Stand firm, without leaning, and your form will naturally stabilize. Ears and eyes follow the heart’s quietude—still water, a bright mirror. Let affairs swirl as they may; all that is before you is already complete.\n\nSitting is like a mountain’s weight—upright, solemn, and dignified. Close your mouth, the tongue deeply concealed; breath enters and leaves through the nose. With each breath, return to the primal sea; when qi is full, spirit abounds. It permeates bone and marrow, and the spirit emerges only after settling into stillness.\n\nReclining is like a winnowing basket’s curve, left or right as suits you. Keep the knees slightly staggered, the feet hooked like clasps. Hands rest upon the abdomen, one feeling the navel, the other the lower body. Gently grasp and rub the testicles, like a dragon playing with a pearl. When weary, turn to your side to sleep; even in sleep, you will not lose awareness. Upon waking, stretch your legs; lying supine is also unconfined. Dream and waking are no different—nine years’ practice confirms this truth. Crossing the gate of birth and death, you fulfill the Tathāgata’s intent.\n\nIn walking, standing, sitting, and reclining—this alone is the true principle.\n\n---\n\n**The Sixth Chapter: Washing the Marrow and Returning to the Origin**\n\nWhen the *Yijin* practice is complete, the body becomes like vajra—unassailable by external influences, undisturbed by food and drink. Yet fear the harm of the seven emotions, lest the primordial spirit lose its hold. Though the form resembles vajra, it remains but flesh and blood. Follow the *Xisui Jing*: eat little, draw in abundant qi. Rub and massage, bathe in dry foam, press the eyes and nose, stroke the face, and rotate the ears—no need to be bound by numbers. Close your eyes and gaze at the nose; let the breath flow naturally through the mouth. Harmonize the count silently; when the body is still, the spirit settles.\n\nRise each day at the fifth watch, expel the turbid and inhale the pure. Open your eyes and stretch, never indulging in deep sleep. Sit cross-legged on a thick mat, loosen the belt at your waist. Right knee over left, regulate the breath, tongue pressed to the palate. Circulate qi through the flanks and abdomen, sway the shoulders, push the belly. Part and press, lift and hold, clench your fists, press both knees. The breath enters and leaves the nose like silk, threading endlessly to the sea’s depths. When saliva gathers, swallow it, guiding it with intent into the abdomen. Knock the teeth, sound the celestial drum, both hands covering the navel. Stretch the feet, grasp the toes, inhale and exhale six times six. When the massage is complete, sit cross-legged for a long while. Straighten the body, stamp both feet—the *xisui* practice is done. Rise slowly, step steadily, and move with care. Haste may bring error; a measured pace is the rule.\n\nAfter three years and nine, quiet the heart and purify the mind. Bone and marrow are thoroughly permeated; the husk is shed, and the body takes flight. Gradually, you merge with heaven; in the end, you reach the ultimate ground.\n\nThus the gāthā says:\nFew words from the mouth,\nFew concerns in the heart,\nLittle food in the belly,\nLittle sleep by nature.\nWith these four fews,\nLongevity is attained.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洗髓经 总义 如是我闻时，佛告须菩提。 易筋功已竟，方可事于此。 此名静夜钟，不碍人间事。 白日任匆匆，务忙衣与食。 三餐食既竟，放风水火讫。 抵暮见明星，燃灯照暗室。 晚夕功课毕，将息临卧具。 大众咸鼾睡，忘却生与死。 明者独惊醒，黑夜暗修为。 抚体叹今夕，过去少一日。 无常来迅速，身同少水鱼。 显然如何救，福慧何日足四恩未能报，四缘未能离，四智未现前，三生未皈一。 默视法界中，四生三有备，六根六尘连，五蕴并三途，，天人阿修罗。 六道各异趋，二谛未能融，六度未能具。 见见非是见，无明未能息。 道眼未精明，眉毛未落地。 如何知见离，得了涅盘意若能见非见，见所不能及。 蜗角大千界，焦眼纳须弥。 昏昏醉梦间，光阴两俱失。 流浪于生死，苦海无边际。 如来大慈悲，演此为《洗髓》。 须侯《易筋》后，每于夜静时，两目内含光，鼻中运息微，腹中宽空虚，正宜纳清熙。 朔望及两弦，二分并二至，子午守静功，卯酉干沐浴。 一切惟心造，炼神竟虚静。 常惺惺不昧，莫被睡魔拘。 夜夜常如此，日日须行持。 惟虚能容纳，饱食非所宜。 谦和保护身，恶疠宜紧避。 假惜可修真，四大须保固。 柔弱可持身，暴戾灾害逼。 渡河须用筏，到岸方弃诸。 造化生成理，从微而至着。 一言透天机，渐进细寻思。 久久自圆满，未可一蹴企。 成功有定限，三年九载余。 从容在一纪，决不逾此期。 心空身自化，随意任所之。 一切无挂碍，圆通观自在。 隐显度众生，弹指超无始。 待报四重恩，永减三途苫。 后人得此经，奉持为宗旨。 择人相授受，叮咛莫轻视。 无始钟气篇第一 宇宙有至理，难以耳目契。 凡可参悟者，即属于元气。 气无理不运，理无气莫着。 交并为一致，分之莫可离。 流行无间滞，万物依为命。 穿金与造①石，水火可与并。 并行不相害。 理与气即是。",
      "translated_text": "Thus have I heard. At one time, the Buddha addressed Subhūti:\n\nOnly after completing the *Yijin* practice may one undertake this. This is called the \"Bell of the Silent Night,\" which does not hinder worldly affairs. By day, one may rush about, busied with clothing and food. After the three meals are finished, one disperses the winds of water and fire. At dusk, when the evening star appears, lamps are lit to illuminate the dark chamber. When the evening’s tasks are done, one rests upon the sleeping mat. The multitude all snore in slumber, forgetting birth and death. The wise alone remain awake, cultivating in the dark of night. Stroking the body, they sigh for this evening—another day has passed. Impermanence comes swiftly; the body is like a fish in scant water. How can one be saved? When will blessings and wisdom suffice?\n\nThe Four Graces remain unrepayed, the Four Conditions unsevered, the Four Wisdoms not yet manifest, the three lives not yet returned to the One. Silently observing the dharmadhātu, the four births and three realms are prepared, the six senses and six dusts entwined, the five aggregates and three paths—gods, humans, and asuras. The six destinies each follow their own course; the Two Truths remain unmerged, the Six Perfections unfulfilled. Seeing is not true seeing; ignorance is not yet stilled. The Dao-eye is not yet clear, the eyebrows have not yet fallen to the ground. How can one know that seeing has departed, attaining the meaning of Nirvāṇa?\n\nIf one could see what is not seen, perceive what cannot be reached—then the great thousand worlds would fit within a snail’s horn, and Mount Sumeru would nestle in a scorched eye. Yet in the stupor of drunken dreams, both light and time are lost. Adrift in the cycle of birth and death, the sea of suffering knows no bounds. Out of great compassion, the Tathāgata expounded this *Xisui Jing*.\n\nAfter the *Yijin* practice, in the stillness of night, let the eyes contain inner light, the breath in the nose be subtle, the abdomen spacious and empty—then is the time to receive the pure and radiant qi. On the new and full moons, the waxing and waning quarters, the equinoxes and solstices, at midnight and noon, guard the stillness; at dawn and dusk, perform the dry ablutions. All is created by the mind; refine the spirit to emptiness and quiescence. Remain ever wakeful and unobscured; let not the demon of sleep bind you. Night after night, thus should it be; day after day, one must persist. Only emptiness can contain; a full stomach is not fitting. Humility and harmony preserve the body; pestilence and evil must be strictly avoided. Temporarily cherish what can be cultivated as real; the four great elements must be secured. Gentleness sustains the body; violence and aggression invite calamity.\n\nTo cross the river, one needs a raft; only upon reaching the shore may it be discarded. The principles of creation and generation proceed from the subtle to the manifest. A single word may reveal the celestial mechanism—advance gradually, pondering carefully. With time, fulfillment comes naturally; one cannot rush to attain it. Success has its fixed term—three years, nine years, or more. Within a twelve-year cycle, it will surely not exceed this span. When the mind is empty, the body transforms of itself, following its inclinations without hindrance. All is unobstructed; one attains the perfection of observation and freedom. Concealed or revealed, one delivers sentient beings, transcending the beginningless in a snap of the fingers. Awaiting repayment of the Fourfold Grace, forever reducing the suffering of the three evil destinies.\n\nThose who come after and receive this sutra should uphold it as their guiding principle. Choose worthy persons for transmission, and admonish them not to take it lightly.\n\n**The First Chapter: The Primordial Qi of the Beginningless Bell**\n\nThe cosmos holds supreme principles, inaccessible to ear and eye. Whatever can be fathomed belongs to the primordial qi. Qi does not move without principle; principle does not manifest without qi. Interwoven, they become one; divided, they cannot be separated. Flowing without obstruction, the myriad things depend upon them for life. They penetrate metal and shape stone, coexisting with water and fire, proceeding together without harm. Principle and qi are thus.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 716,
      "start_sentence": 0,
      "end_sentence": 52,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.546518087387085,
      "metadata": {
        "source_file": "dao\\藏外\\洗髓经.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "生处伏杀机，杀中有生意。 理以气为用，气以理为体。 即体以显用，就用以求体。 非体亦非用，体用两不立。 非理亦非气，一言透天机。 百尺竿头步，原始更无始。 悟得其中意，方可言洗髓。 四大假合篇第二 元气久氤氲，化作水火土，水发昆仑巅，四达坑阱注。 静坐生暖气，水中有火具，湿热乃蒸腾，为雨又为露。 生人又生物，利益满人世。 水久澄为土，火乃气之燠②。 人身小天地，万物莫能比。 具此幻化质，总是气之余。 本来非我有，解散还太虚。 生亦未曾生，死亦未曾死。 形骸何时留，垂老后天地。 假借以合真，超脱离凡类。 参透《洗髓经》，长生无尽期。 无假不显真，真假浑无际。 应作如是观，真与假不二。 四大假合形，谁能分别此。 凡圣同归篇第三 凡夫假作真，美衣为体饰，徒务他人观。 美食日复日，人人皆如此。 碌碌一身事，不暇计生死。 总被名利牵，一朝神气散。 油尽而灯灭，身尸埋圹野。 惊魂一梦摄，万苦与千辛，幻境无休歇。 圣人独认真，布衣而蔬食，不贪以持己，岂为身口累。 参透天与地，与我本一体。 体虽有巨细;灵活原无异。 天地有日月，人身两目具。 日月有晦明，星与灯相继。 纵或星灯灭，见性终不没。 纵成瞽目人，伸手摸着鼻。 通身俱是眼，触着知物倚。 此是心之灵，包罗天与地，能见不以目，能听不以耳。 心若能清净，不为嗜欲逼。 自知原来处，归向原来去。 凡夫与圣人，眼横鼻长直。 同来不同归，因彼多外驰。 若能收放心，提念生与死。 趁此健身驱，精进用心力。 洗髓还本原，凡圣同归一。 物我一致篇第四 万物非万物，与我同一体。 幻出诸形相，辅助成生意。 有人须有物，用作衣与食。 药饵及器皿，缺一即不备。 飞潜与动植，万类为人使。 造化思何鸿，妄杀即暴戾。 蜉蝣与蚊蝇，朝生暮死类。 龟鹤糜与鹿，食少而服气，竟得多历年，人何不如物，只贪衣与食，忘却生与死。 苟能绝嗜欲。 物我皆一致。",
      "translated_text": "**The Lifeforce Conceals the Mechanism of Death; Within Death Lies the Intent of Life**\n\nWhere life arises, the mechanism of death lies concealed; within death, the intent of life persists. Principle employs qi as its function; qi relies on principle as its substance. Through substance, function is revealed; through function, substance is sought. Yet neither substance nor function stands alone—both dissolve when divided. Neither principle nor qi exists independently; a single phrase unlocks the celestial mechanism.\n\nAdvance beyond the hundred-foot pole’s summit—from the primordial, there is no beginning. Only by grasping this meaning may one speak of marrow-washing.\n\n**The Second Chapter: The Four Great Elements as Provisional Convergence**\n\nThe primordial qi, long suffused in mist, transforms into water, fire, and earth. Water surges from Kunlun’s peak, flowing into valleys and chasms. In stillness, warmth arises; within water, fire resides. Moisture and heat ascend as vapor, becoming rain and dew. They give life to humans and all beings, bestowing benefits upon the world.\n\nWater, when settled long, becomes earth; fire is the warmth of qi. The human body is a microcosm—none can compare. This illusory, mutable form is but the residue of qi. Originally, it was never ours; when dissolved, it returns to the Great Void. Birth was never truly birth; death was never truly death. When does the bodily frame ever endure? Even in old age, it outlasts heaven and earth. Borrowing the provisional to unite with the real, one transcends the mundane.\n\nPenetrate the *Marrow-Washing Classic*, and longevity knows no end. Without the provisional, the real cannot be revealed; real and provisional intermingle without boundary. Thus should one contemplate: the real and the provisional are not two.\n\nThe four great elements converge in form—who can distinguish them?\n\n**The Third Chapter: The Common Return of the Mundane and the Sage**\n\nThe mundane take the provisional for the real, adorning the body with fine garments, seeking only the gaze of others. Daily, they indulge in rich foods—all people live thus. Burdened by the affairs of a single life, they have no leisure to ponder birth and death. Ensnared by fame and profit, one day their spirit and qi scatter. The lamp gutters when the oil is spent; the corpse is buried in the wilds. The startled soul is seized by a dream—endless suffering, ceaseless toil, an illusory realm without respite.\n\nThe sage alone recognizes the real: clad in coarse cloth, subsisting on plain fare, free from greed to maintain integrity, unburdened by the body or speech. They penetrate heaven and earth, seeing them as one with the self. Though forms differ in size, their spiritual vitality is fundamentally the same.\n\nHeaven and earth possess sun and moon; the human body has its two eyes. Sun and moon wax and wane; stars and lamps follow in succession. Even if stars and lamps extinguish, the seeing nature never perishes. Though one may become blind, the hand still finds the nose. The entire body is an eye—touch reveals the object’s presence.\n\nThis is the spirit of the mind, encompassing heaven and earth. It sees without eyes, hears without ears. When the mind is pure and unassailed by desires, it knows its original abode and returns to its source.\n\nThe mundane and the sage share the same eyes, the same straight nose. They come together but do not return the same, for the former scatters outward. If one can gather the scattered mind and contemplate birth and death, seizing this time of robust health, applying diligent effort—washing the marrow to restore the original source—the mundane and the sage become one.\n\n**The Fourth Chapter: The Unity of Self and All Things**\n\nThe myriad things are not myriad things—they share a single body with me. Illusory forms emerge, aiding the intent of life. Where there are people, there must be things: clothing and food, medicine, remedies, and vessels. Lacking even one, completeness is lost.\n\nFlying, swimming, moving, and growing—all beings serve humanity. How vast is creation’s design! Yet wanton killing is cruelty. Mayflies and mosquitoes live but a day; tortoises, cranes, elk, and deer eat little and refine qi, thus enduring many years. Why do humans fall short of creatures? Only because they crave clothing and food, forgetting birth and death.\n\nIf one can sever desire, self and all things become one.",
      "overlap_context": "al Qi of the Beginningless Bell**\n\nThe cosmos holds supreme principles, inaccessible to ear and eye. Whatever can be fathomed belongs to the primordial qi. Qi does not move without principle; principle does not manifest without qi. Interwoven, they become one; divided, they cannot be separated. Flowing without obstruction, the myriad things depend upon them for life. They penetrate metal and shape stone, coexisting with water and fire, proceeding together without harm. Principle and qi are thus.",
      "start_char": 716,
      "end_char": 1469,
      "start_sentence": 53,
      "end_sentence": 108,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.767093658447266,
      "metadata": {
        "source_file": "dao\\藏外\\洗髓经.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "行住坐卧篇第五 行如盲无杖，内观照性分，举足低且馒，踏实方更进。 步步皆如此，时时戒急行。 世路忙中错，缓步保平安。 住如临崖马，亦如到岸舟。 回光急返照，认取顿足处。 不离于当念，存心勿外务。 得止宜知止，留神守空谷。 立定勿倾斜，形端身自固。 耳目随心静，止水与明镜。 事物任纷纷，现在皆究竟。 坐如邱山重，端直肃容仪。 闭口深藏舌，出入息与鼻。 息息归元海，气足神自裕。 浃骨并洽髓，出神先入定。 卧如箕形曲，左右随其宜。 两膝常参差，两足如钩鉅。 两手常在腹，扪脐摸下体。 睾丸时挣搓，如龙戏珠势。 倦则侧身睡，睡中自不迷。 醒来方伸脚，仰面亦不拘。 梦觉浑不异，九载征实际。 超出生死关，究竟如来意。 行住坐卧篇，只此是真谛。 洗髓还原篇第六 易筋功已毕，便成金刚体。 外感不能侵，饮食不为积。 犹恐七情伤，元神不自持。 虽具金刚相，犹是血肉驱。 须照《洗髓经》，食少多进气。 搓摩干沫浴，按眼复按鼻。 摸面又旋耳，不必以数拘。 闭眼常观鼻，合口任鼻息。 度数暗调和，身定神即定。 每日五更起，吐浊纳清熙。 开眼即抽解，切勿贪酣睡。 厚褥趺跏坐，宽解腰中系。 右膝包左膝，调息舌抵腭。 胁腹运尾闾，摇肩手推肚。 分合按且举，握固按双膝。 鼻中出入绵，绵绵入海底。 有津续咽之，以意送入腹。 叩牙鸣天鼓，两手俱掩脐。 伸足扳其趾，出入六六息。 两手按摩竟，良久方盘膝。 直身顿两足，洗髓功已毕,徐徐方站起，行稳步方移。 忙中恐有错，缓步为定例。 三年并九载，息心并涤虑。 浃骨更洽髓，脱壳飞身去。 渐几浑化天，末后究竟地。 即说偈曰:口中言少，心头事少，腹里食少，自然睡少，有此四少，长生可了。",
      "translated_text": "**The Fifth Chapter: Walking, Standing, Sitting, and Reclining**\n\nWalking is like a blind man without his staff—turn inward to illuminate the nature of your being. Lift your feet low and slow, pressing firmly before advancing. Step by step, ever thus, ever wary of haste. The world’s path is fraught with errors in haste; a measured pace ensures peace.\n\nStanding is like a horse at the cliff’s edge, or a boat that has reached the shore. Swiftly turn the light inward, recognizing the ground beneath your feet. Do not stray from the present thought; guard your mind, forsaking all distractions. When stillness is found, know stillness; attend with care, as if guarding an empty valley. Stand firm, without leaning, and your form will naturally stabilize. Ears and eyes follow the heart’s quietude—still water, a bright mirror. Let affairs swirl as they may; all that is before you is already complete.\n\nSitting is like a mountain’s weight—upright, solemn, and dignified. Close your mouth, the tongue deeply concealed; breath enters and leaves through the nose. With each breath, return to the primal sea; when qi is full, spirit abounds. It permeates bone and marrow, and the spirit emerges only after settling into stillness.\n\nReclining is like a winnowing basket’s curve, left or right as suits you. Keep the knees slightly staggered, the feet hooked like clasps. Hands rest upon the abdomen, one feeling the navel, the other the lower body. Gently grasp and rub the testicles, like a dragon playing with a pearl. When weary, turn to your side to sleep; even in sleep, you will not lose awareness. Upon waking, stretch your legs; lying supine is also unconfined. Dream and waking are no different—nine years’ practice confirms this truth. Crossing the gate of birth and death, you fulfill the Tathāgata’s intent.\n\nIn walking, standing, sitting, and reclining—this alone is the true principle.\n\n---\n\n**The Sixth Chapter: Washing the Marrow and Returning to the Origin**\n\nWhen the *Yijin* practice is complete, the body becomes like vajra—unassailable by external influences, undisturbed by food and drink. Yet fear the harm of the seven emotions, lest the primordial spirit lose its hold. Though the form resembles vajra, it remains but flesh and blood. Follow the *Xisui Jing*: eat little, draw in abundant qi. Rub and massage, bathe in dry foam, press the eyes and nose, stroke the face, and rotate the ears—no need to be bound by numbers. Close your eyes and gaze at the nose; let the breath flow naturally through the mouth. Harmonize the count silently; when the body is still, the spirit settles.\n\nRise each day at the fifth watch, expel the turbid and inhale the pure. Open your eyes and stretch, never indulging in deep sleep. Sit cross-legged on a thick mat, loosen the belt at your waist. Right knee over left, regulate the breath, tongue pressed to the palate. Circulate qi through the flanks and abdomen, sway the shoulders, push the belly. Part and press, lift and hold, clench your fists, press both knees. The breath enters and leaves the nose like silk, threading endlessly to the sea’s depths. When saliva gathers, swallow it, guiding it with intent into the abdomen. Knock the teeth, sound the celestial drum, both hands covering the navel. Stretch the feet, grasp the toes, inhale and exhale six times six. When the massage is complete, sit cross-legged for a long while. Straighten the body, stamp both feet—the *xisui* practice is done. Rise slowly, step steadily, and move with care. Haste may bring error; a measured pace is the rule.\n\nAfter three years and nine, quiet the heart and purify the mind. Bone and marrow are thoroughly permeated; the husk is shed, and the body takes flight. Gradually, you merge with heaven; in the end, you reach the ultimate ground.\n\nThus the gāthā says:\nFew words from the mouth,\nFew concerns in the heart,\nLittle food in the belly,\nLittle sleep by nature.\nWith these four fews,\nLongevity is attained.",
      "overlap_context": " food, medicine, remedies, and vessels. Lacking even one, completeness is lost.\n\nFlying, swimming, moving, and growing—all beings serve humanity. How vast is creation’s design! Yet wanton killing is cruelty. Mayflies and mosquitoes live but a day; tortoises, cranes, elk, and deer eat little and refine qi, thus enduring many years. Why do humans fall short of creatures? Only because they crave clothing and food, forgetting birth and death.\n\nIf one can sever desire, self and all things become one.",
      "start_char": 1471,
      "end_char": 2134,
      "start_sentence": 109,
      "end_sentence": 159,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.678653478622437,
      "metadata": {
        "source_file": "dao\\藏外\\洗髓经.txt",
        "category": "藏外"
      }
    }
  ]
}