{
  "source_id": "洞渊集（宋李思聪）",
  "source_file": "chunked_daozang\\洞渊集（宋李思聪）.json",
  "total_chunks": 25,
  "total_original_chars": 19620,
  "total_translated_chars": 122036,
  "total_translation_time": 560.5311012268066,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**Preface to the Presentation of *Dongtian Haiyue* (Cavern-Heavens, Seas, and Sacred Mountains)**\n\n*Dongyuan Ji* (Collected Works of the Cavern Abyss)\nCompiled by Li Sicong of the Song Dynasty\nNine fascicles\nSource edition: *Zhengtong Daozang*, Tai Xuan Section\n\n**Memorial Presenting *Dongtian Haiyue Tu* (Charts of Cavern-Heavens, Seas, and Sacred Mountains)**\nYour subject, Daoist Li Sicong of the Dazhong Xiangfu Abbey in Qianzhou, humbly submits:\n\nI observe that the jade tablets and purple scriptures of the Dao, though bound in emerald cases and vermilion seals, have grown vast in their scrolls and boundless in their translations. Consider the profound and wondrous canons of the Three Clarities, or the radiant *Chart of the True Forms of the Five Peaks*—ancient texts once preserved in the gardens of the immortals, now matched by the *Records of the Ten Isles*. The true wind of the Dao stretches far and wide, yet historians have seldom discussed it, and scholars of past dynasties have rarely compiled its records.\n\nIn the intervals of court rituals and the remnants of incense offerings, I have secretly probed its mysteries and arranged its order. Though the cinnabar terraces lie distant and the Purple Courts remain secluded, all are depicted in these charts, as clear as pointing to the palm of one’s hand. May those who revere the highest realms join in praising the imperial virtue, and may those who savor the Dao offer blessings to the celestial designs.\n\nBy the grace of this era of grand tranquility, I have striven to propagate the pure wind of the Dao, gathering the charts of immortals to present to the sagely throne. With awe and trepidation, I bow my head again and again.\n\nI reverently reflect upon Your Majesty, the Emperor who embodies Heaven, models the Dao, and reveres culture, wisdom, divinity, and filial virtue. Grasping the Auspicious Talisman, You govern the realm; wielding the Golden Mirror, You oversee the people. Your Dao surpasses that of a hundred kings, and Your virtue descends through a thousand ages. Like the clouds of Yao sheltering the fields, all things revive; like the sun of Shun illuminating the heavens, the eight directions bask in harmony. Thus, the customs of the eastern Yi and southern Yue bow in reverence, while the northern Hu and western Rong submit in sincerity. All who encounter this sagely reign are utterly devoted.\n\nI have, since my youth, devoted myself to the foundational teachings, yet upon examining the works of former worthies, I found the accounts of Daoist marvels often scattered and their roots seldom explored. Day and night, I have concentrated my mind, searching through scriptures and records, gathering facts and shaping them into chapters. Over the years, these efforts have filled many scrolls. Now, I have compiled the *Chart of the Jade Clarity’s Ultimate Journey*, the *Chart of the Five Peaks of the Cavern-Heavens*, the *Chart of Penglai and the Celestial Gardens*, the *Chart of the Great Qi’s Numinous Tides*, the *Chart of Famous Mountains and Blessed Lands*, and the *Chart of Golden Liquor and the Returned Elixir*. Fortunate to live in this enlightened age, I dare not conceal these works in my humble abode but aspire to present them at the dragon court. Should they merit even a glance from Your Sagely Perusal, my lifelong toil would not have been in vain.\n\nI now take the liberty of submitting them with this memorial, though I tremble at the presumption of approaching the imperial gaze. I am overwhelmed with fear and trembling, prostrate and anxious.\n\nWith utmost awe and reverence, I bow my head again and again.\n\nRespectfully submitted.\nFirst day of the twelfth month, first year of Huangyou, Song Dynasty\nLi Sicong, Daoist of the Xiangfu Abbey in Qianzhou\n\n---\n\n**Memorial Requesting the Presentation of *Dongtian Haiyue Mingshan Tu* (Charts of Cavern-Heavens, Seas, and Sacred Mountains)**\nLi Sicong, Daoist of the Dazhong Xiangfu Abbey in Qianzhou.\n\nYour subject, Li Sicong, a humble figure from the wilds, was born in an era of prosperity. I have long encountered the teachings of non-action and now serve in this court of the Dao. My nature is dull and unsuited to fathoming the scriptures of immortals; my wisdom is shallow and unequal to measuring the depths of the Qi and the seas.\n\nSince the first year of Mingdao, I have delved into the secret canons of the Daoist gate and the true teachings of the sagely lineage, exploring their hidden traces and refining their wondrous essence. I have compiled the *Chart of the Jade Void’s Ultimate Journey*, depicting the divine transformations of the formless and revolving images; the *Chart of the Five Peaks of the Cavern-Heavens*, extolling the numinous realms of the sacred mountains; the *Chart of Penglai and the Celestial Gardens*, celebrating the splendor of the Peng Island and Ten Isles; the *Chart of the Great Qi’s Numinous Tides*, expounding the mysteries of the dragon palaces and sea scriptures; the *Chart of Famous Mountains and Blessed Lands*, chanting the secret scenes of the Purple Courts and cinnabar terraces; and the *Chart of Golden Liquor and the Returned Elixir*, assembling the fire phases of the immortals. Fearing the vastness of these charts might burden the reader, I have also separately compiled the *Scrolls for Casual Perusal*, totaling ten scrolls, all now complete.\n\nI have gathered these facts through years of arduous effort, my sole wish being to praise the imperial way. I dare not seek undue imperial favor. Now, as the Qian Yuan Festival approaches, I humbly request permission to submit these charts in six copies, along with the ten scrolls of the *Scrolls for Casual Perusal*, for presentation to the throne.\n\nAs stated above.\n\nRegarding the memorial of Daoist Li Sicong, beyond the aforementioned matters, I, Liang Gong, along with the officials of this prefecture, have investigated and confirmed that Daoist Li Sicong has long cultivated his Daoist practice and immersed himself in the scriptures of immortals. Over the years, his diligence and contributions have become increasingly evident. His verses on the grotto-heavens of Peng Mountain and the journeys of the Jade Clarity, compiled into charts and accompanied by poems and prefaces, shine with brilliant diction and a refined, fresh style. They are worthy of imperial perusal to invigorate the true teachings. Moreover, as the Qian Yuan Festival nears and tribute fills the court, we wish to present these wondrous works of the lofty immortals, hoping they may align with the sagely designs. Should they be included among the offerings and grace the imperial gaze, our earnest hopes would be fulfilled.\n\nThe *Charts of the Jade Clarity’s Ultimate Journey* and others each include poems and prefaces, their words and intentions truly admirable. These charts are currently in the custody of this prefecture, awaiting imperial decree before daring to present them.\n\nAwaiting Your Majesty’s command.\n\nFrom the Secretariat, Liu Zifu transmits to the昭信军: A memorial from Vanzhou Prefecture reports on Daoist Li Sicong of the Dazhong Xiangfu Abbey. Since the first year of the Mingdao era, he has successively delved into the esoteric canons of the Daoist gate and the true transmissions of successive sages, tracing subtle traces and exhaustively exploring their wondrous origins. He has compiled:\n\n*The Charts of the Jade Clarity’s Ultimate Journey*, expounding the divine transformations of wandering in emptiness;\n*The Charts of the Five Marchmounts and Grotto-Heavens*, extolling the numinous realms of the Five Marchmounts and immortal mountains;\n*The Charts of Penglai and the Yuanyuan Gardens*, praising the sublime vistas of the Penglai Isles and the Ten Continent-Isles;\n*The Charts of the Great Darkness and the Numinous Scriptures*, revealing the profound mysteries of the Dragon Palace and the oceanic depths;\n*The Charts of Famous Mountains and Blessed Lands*, chanting the esoteric canons of the Purple Palace and the Cinnabar Terraces;\n*The Charts of the Golden Liquor and the Returned Elixir*, assembling the alchemical *huohou* of the divine immortals.\n\nSix sets of charts, along with ten scrolls of *The Reclining Figure*, are hereby requested for presentation. The officials of this prefecture have examined them and find them truly worthy of selection. The charts are currently in the custody of this prefecture, awaiting imperial decree before daring to present them. We humbly await your command.\n\nBy imperial edict: Vanzhou Prefecture is ordered to transmit and present them. Transmitted to Vanzhou. As directed.\n\nTwenty-seventh day of the third month, second year of the Huangyou era.\n\n*Anthology of the Abyssal Depths*, Scroll One\n*Collected Works of Master Chongmiao Li Sicong*\n\n**Preface to the *Odes of the Three Realms***\nThe *Odes of the Three Realms* correspond to the Three Powers. Their eighty-one chapters correspond to the number nine squared. The *Odes of the Jade Clarity* praise the divine transformations of the Three Clarities’ revolving images; the *Odes of the Grotto-Heavens* depict the sublime vistas of the Five Marchmounts and grotto-heavens; the *Odes of the Sea and Mountains* describe the immortal landscapes of Penglai and the Yuanyuan Gardens. Thus the Three Powers are complete, and the ninefold numbers arise.\n\nFormerly, Master Xiyi composed the *Pointers to the Mysterious*, expounding the wondrous principles of cultivating the body and nurturing the *qi*. Now, in my *Odes of the Three Realms*, I chant the profound regions of emptiness, grotto-heavens, and island-paradises. Though ancient and modern differ, each speaks its intent. All are based on the immortal scriptures, treasure records, and phoenix-enfolded celestial texts, thoroughly investigating their root sources. I dare not indulge in idle speculation, lest I rashly and superficially probe the abyssal depths. My sole hope is to transmit these to those who cultivate the true and don the feathered robes of immortality. How could I presume to display them to scholars of refined diction or gentlemen who savor the Dao? May they together invigorate the true wind.\n\nWritten on the Shangyuan Festival, second year of the Huangyou era of the Song.\n\n**Preface to the *Odes of the Three Clarities***\nThe *Odes of the Three Clarities* narrate the transmission and descent of the scriptures and precepts of the Three Clarities.\n\nThe Celestial Venerable of Original Beginning is the essence of Heaven and Earth, the primal ancestor of the ultimate Dao. Born of spontaneity, when it disperses, it becomes *qi*; when it rests, it becomes spirit. Without beginning or end, it eternally abides. Dwelling in the Upper Realm, it is the origin of the myriad heavens; in the Middle Realm, the root of the myriad transformations; in the Lower Realm, the sovereign of the myriad emperors. Without a name to revere, it is called the Celestial Venerable, initiating the worlds of humans and gods. It cannot be fathomed by reason or grasped by words. It engenders the myriad things yet does not govern them; it transforms the myriad kinds yet does not speak. Utmost in honor and supremacy, it is called the Celestial Venerable. It resides in the Jade Clarity’s sacred realm, the Celestial Palace of Subtle Radiance.\n\nThe Jade Morning Dao Lord is the incarnate transformation of the great Dao. To speak of its presence is impossible to pursue; to speak of its absence is to still acknowledge its evanescence. Thus, it is neither existent nor non-existent, neither present nor absent. Gazing upon it, no form is seen; listening to it, no sound is heard. Within the interplay of wondrous being and wondrous non-being, the great Dao abides. The Dao Lord is the root of discerning the Dao, the origin of penetrating the Dao, the *qi* of the Dao. As a disciple receiving the Dao, he serves the Celestial Venerable of Original Beginning, just as the Old Lord received and served him. He dwells in the Upper Clarity’s true realm, the Heaven of Yu Remnant, where he descended with the golden regulations, treasure records, and Three Grotto scriptures, entrusting them to the scripture master, the Perfected Yu Luoqiao, to transmit the teachings to the myriad lands.\n\nThe Venerable Lord of Primordial Simplicity is the ancestral founder of primordial *qi*, the root of Heaven and Earth. Across kalpas, he has acted as teacher, transforming through successive eras. At times in the Nine Heavens, at times wandering the Four Seas, there is no teaching without a master, no realm without a sovereign. He serves the Jade Morning Dao Lord as a disciple receiving the Dao. At times, descending among the Six Stars of the Celestial Hook and Celestial Enclosure in the Grand Tenuity, he is called the Celestial August Emperor, the Radiant Soul Treasure. In the Zhou dynasty, he was born, and Confucius once said: \"The Old Master is my teacher,\" and inquired of him about ritual, gazing up to him as to a soaring dragon. Since the beginning of creation, he has descended over fifty times, crossing the Western Flowing Sands to transform China, serving as the patriarch of the Three Teachings and the model for a hundred kings. Through millennia, he has practiced the Dao, his divine transformations boundless. He resides in the Grand Clarity’s immortal realm, the Heaven of Great Vermilion.\n\nThe Five Numinous Lords of the Purple Tenuity’s Northern Culmen hold the central position in the Purple Tenuity Enclosure of the Middle Heaven, serving as the ancestral masters of the myriad images, around whom the host of stars revolves. In the first kalpa of the Dragon Han era, at the Northern Darkness’s Dengdu Luoshan, the demonic spirits of the six grotto-heavens emerged among humanity, slaughtering and harming people beyond measure, with none able to restrain them. The Celestial Emperor summoned the Northern Emperor, who led divine generals and heavenly troops to expel the baleful influences and rescue the multitudes. Upon completing his task, he ascended as emperor to the Middle Heaven, naturally assuming the supreme position of the Purple Tenuity.\n\nThe Seven Perfected Ones said: \"Our ancestral master, the Northern Culmen, has across kalpas diligently offered incense and lamps, making offerings to the Three Clarities. With merit complete and virtue perfected, he ascended to the imperial position of the Purple Tenuity. His comings and goings are ever accompanied by a flowery canopy, resplendent with the seven treasures’ starlight. Above, it reaches the myriad heavens; below, it illuminates the myriad lands. On the twenty-seventh day of each month, he descends to examine the sins and blessings of the world.\"\n\n*The Scripture of Salvation* was expounded by the Celestial Venerable of Original Beginning in the Primordial Azure Heaven, proclaiming the true texts of the Four Directions’ Original Beginning, the secret names of the Five Thearchs and Demon Kings, and the inner sounds of the myriad heavens—words of profound mystery, not of the mundane world, concealed by the myriad heavens’ great sages in the Purple Tenuity’s palace. The Celestial Emperor, pitying that Heaven and Earth’s yin and yang have a destined number of kalpic destructions, and that the hells contain souls suffering the Five Torments and Eight Difficulties, entreated the celestial deities and immortals to expound the numinous sounds to save the multitudes. Above, it dispels celestial disasters; below, it wards off poisonous harms, pacifying and securing the dynastic fortune to preserve Heaven’s eternal endurance. This scripture is revered and wondrous, the ancestral founder of the myriad Daoist teachings.\n\nThe *Huangting Jing* was composed by the Jade Dawn Dao Lord within the Purple Tenuity’s Upper Palace, the Jeweled Tower of the Upper Clarity’s true realm. This scripture arrays the chambers of the gods, revealing the dwelling of the womb spirits—it is the Way of the Perfected’s immortality. It is also called the *Supreme Zither-Heart Text*, the *Golden Writ of the Great Thearch*, and the *Jade Chapters of the Eastern Flower*. The Azure Lad of the Eastern Sea, along with the host of immortals, inscribed it upon white jade tablets in golden characters. Morning and evening, they paid homage to Heaven and Earth before the Divine King of Yang Valley transmitted it to the Purple Void Primordial Lady, Lady Wei, who then passed it into the world.\n\nThe *Daode Jing* was written by the Primal Venerable Lord in the Great Clarity Heaven. Long ago, when Emperor Shun governed with filial piety and fraternal duty, the Venerable Lord descended, styling himself Master Yin Shou, and bestowed upon Shun the Five Thousand Characters. Shun awakened to the subtleties of the formless and soundless, abdicated his throne, and withdrew into the wilderness of Cangwu. This text was kept secret and not transmitted until the reign of King Zhao of Zhou, when the Venerable Lord crossed the Flowing Sands to the west. Yin Xi, then magistrate of the pass, observed purple and black vapors coiling in the sky like dragons and serpents. Knowing a sage would cross the pass, he swept the streets and purified himself in anticipation. When he encountered the Venerable Lord, he prostrated himself in earnest supplication, begging to rescue his rotting corpse and withered bones and entreating the gift of secret teachings. Moved by his anguish, the Venerable Lord halted his chariot and expounded the Five Thousand Characters anew, personally annotating it as *Sectional Exegesis*. Later, the River Earl presented it to Emperor Wen of Han, dividing it into the two scriptures of *Dao* and *Virtue*, arranged into eighty-one chapters, to be preserved in the world.\n\nThe *Qingjing Jing* is the Venerable Lord’s secret discourse. The Left Immortal Duke of the Supreme Ultimate, Ge Xuan, said: \"This scripture is treasured in the heavens and not transmitted to lesser scholars. I once received it from the Eastern Flower Thearch. The Eastern Flower Thearch transmitted it to the Golden Portal Thearch, who passed it to the Queen Mother of the West. All conveyed it as a secret text of immortality. Superior scholars who awaken to it ascend as celestial officials; middling scholars attain it as immortals of the Southern Palace; and lesser scholars who receive it enjoy long life in the world. Roaming the Three Realms, they ascend into the Golden Gate.\"\n\nThe *Yinfu Jing* consists of three hundred words bestowed by the Dark Lady upon the Yellow Thearch. The first hundred contain the Way of embracing the One for immortality; the middle hundred hold the methods for enriching the state and pacifying the people; and the last hundred encompass the arts of strengthening the army and securing victory. The Yellow Thearch obtained it and ascended into the Cloud Han. *Yin* means \"hidden,\" and *fu* means \"accord.\" The celestial mechanism accords with the workings of affairs—hence it is called the *Yinfu Jing*.\n\nThe *Upper Clarity’s Precious Record* is the wondrous Way of the Three Luminaries’ Nine Heavens’ precious writ. Its ultimate truth emerges from the Great Veil. The Jade Capital’s Upper Palace, where the Jade Thearch conceals it, is revered by all sages. Sealed within the Jasper Terrace, those who ascend as lofty immortals and bear names inscribed in the Golden Portal may all wear and bear it, paying homage to the Upper Clarity. This text arose before the Primordial Beginning, weaving the darkness of soaring mystery, its jade characters illuminating the vast firmament, venerated by the myriad spirits. The Supreme Jade Thearch transmitted it to the Grand Tenuity; the Heavenly Thearch transmitted it to the Upper Clarity. The perfected saints who attained the Way received it from the King of Lesser Existence Heaven, who passed it to the Perfected Lord Wang of the Purple Void, Lady Wei. Lady Wei transmitted it to Yang Siming and the Archivist Xu of Mount Mao, who later brought it into the world.\n\nThe *Lingbao Immortal Ledger Scripture* is the text formed from the essence of the Nine Darknesses. Its radiance blazes brilliantly, ascending to the might of the Nine Heavens above and extinguishing the malevolence of the Six Heavens below. This most secret treasure of the Thearch is not casually glimpsed by those whose names are not inscribed on golden tablets or jade writs. The Dao Lord transmitted it to the Heavenly Thearch of the Grand Tenuity; the Heavenly Thearch transmitted it to the Posterior Sage Thearch of the Golden Portal; the Posterior Sage Thearch transmitted it to the Azure Lad, who passed it to the perfected saints who attained the Way. Xu Laile transmitted it to Immortal Duke Ge, and it was later preserved in the world.\n\nThe *Zhengyi Mengwei Record* originated when, during the Later Han, the Jade Dawn Dao Lord descended in a five-colored cloud chariot, his retinue impeccably arrayed. Alighting upon Mount Crane’s Cry, he addressed Celestial Master Zhang Daoling: \"I see the lower realm overrun with demons and ghosts, human affairs in disarray, and the people suffering premature death. I bestow upon you the *Orthodox Unity Register*—one scroll—and two divine swords. You shall eradicate malevolent spirits, return the perverse to rectitude, harmonize Heaven and invert Earth, and safeguard the state and secure the household. Upon accomplishing this, you shall ascend to the Land of No-Where.\" The Celestial Master received his mandate and entered the Western Marchmounts to enact his transformation. He subdued the two demon masters, Wang Chang and Zhao Sheng, as his disciples, converting the Twenty-Four Demon Prisons into Twenty-Four Blessed Courts. Distinguishing day from night, he bound the spirits by oath, ensuring the cosmos’ purity and tranquility and the people’s long life. Thereafter, during the reign of Emperor Huan of Han, he ascended in broad daylight, his rank established as Perfected of Orthodox Unity. The transmission of the register began from this point.\n\nThe *Daoist Golden Regulations and Jade Precepts* recount that in the second year of Han’an, on the fifteenth night of the first month at midnight, the Jade Dawn Dao Lord descended in a nine-dragon jade chariot, his majesty resplendent, filling the firmament. Celestial hymns resounded as he hovered ten thousand *ren* above the earth, circling without descending. The Celestial Master rent his heart in reverent gaze and beheld the Dao Lord admonishing the Perfected: \"Formerly, I dispatched you to the Western Marchmounts to subdue demons, but you did not await the celestial tally, arbitrarily summoning thunder and rain. You overtaxed your officers and soldiers, exceeding proper bounds. You drove the stars and constellations, throwing the sun and moon into chaos.\"\n\nThe transgression shook the Celestial Courts above and terrified the Nether Bureaus below. Blackness filled the sky, and baleful radiance suffused his form. Now the Supreme Emperor holds you accountable for your faults, records your offenses, and I can no longer draw near to you.\n\nThe Celestial Master, grief-stricken, prostrated himself and begged for death before the Dao Lord’s chariot, pleading for deliverance. Moved by his contrition, the Dao Lord dispatched a Merit Clerk Messenger to open the Purple Yang Jade Summit, from which three scrolls of plain script emerged, inscribed: *Jade Regulations and Golden Precepts: Rites for Atonement, Erasure of Black Registers, and Salvation of the Nine Ancestors*. The Celestial Master received the mandate and withdrew to Mount Crane’s Call, where he purified himself and performed the prescribed jiao rites to petition the myriad spirits. His merit ascended through the heavens, and in broad daylight, he rose to the Celestial Dawn, attaining the rank of the Three Heavens’ Great Dharma Master and Upholder of the Teachings. The transmission of the *Jade Regulations and Golden Precepts for Fasting and Jiao Rites* began from this point.\n\nThe Jade Capital Mountain of the Mysterious Metropolis spans ninety thousand *li* in circumference. It coalesced from the congealed essence of Yang radiance, standing rootless and suspended in the Infinite Great Luo Heaven. The mountain’s seven-jeweled palaces and towers gleam across the heavens, its form broad above and narrow below, resembling Kunlun. Along its flanks, twelve celestial realms arise naturally from Yang essence, their expanse boundless. Below, seven-jeweled forests spread in luxuriant cover, encircled by the Eight Heavens. The Eight Paths serve as the avenues where immortals of the eight directions receive their duties. Upon the petals and leaves, all things are born of Mysterious Essence, inscribed with phoenix scripts and dragon sigils—the sacred texts of the inner heavens, the verses of the Dao and the Inaudible. The hymns of the host of sages defy full comprehension, while divine winds stir the celestial music of the Grand Void, the abode of the August Emperor of the Primordial Void. Myriad sages attend his court, for this is the City of the Ultimate Dao, the Mysterious Metropolis of the Loftiest Immortals.\n\nThe Fengdu Luoshan lies in the north, in the *gui* region, the gateway of ghosts and the root of deathly essence. The mountain rises two thousand six hundred *li* high, with a circumference of thirty thousand *li*. Within it lies a cavern palace, the capital of ghosts and spirits. The mountain’s interior and exterior each contain twelve palaces, together forming the Twenty-Four Yin Palaces, where the judgment and punishment of sinful souls take place. The Three Offices, Nine Bureaus, and Twenty-Four Prisons—along with the nether officials and ghostly administrators who oversee the Black Registers—are all formed from turbid, congealed essence, the foundation of the earth and the sovereign of Yin. They constitute the pivot of the Nine Earths. The forests and grasses here are imbued with venomous, malevolent essence. What grows here are blades that flash like lightning, while black smoke billows ceaselessly day and night. Within, punitive divine soldiers constantly interrogate and discipline sinful souls.\n\nOn the days of the Three Primes and Eight Festivals, the Northern Emperor and the nether officials summon forth souls exhausted by kalpas of suffering, demanding an account of their transgressions, the origins of their offenses, their native prefectures, counties, and villages, the locations of their graves, and the eras and places of their lives. If their sins are grave and Heaven has not yet pardoned them, their misfortunes will flow to their descendants in the world, giving rise to calamities. The Northern Emperor governs the ghostly officials who guard this mountain, where all palaces and towers are formed from the congealed essence of yellow essence. The officials here are ancient emperors and kings, loyal ministers, and filial children who performed meritorious deeds, now serving as nether officials clad in yellow robes and plain cinnabar-embroidered garments.\n\nEvery seventh day of the seventh month, they review the good and evil deeds of the living, reporting the offenses recorded in the Black Registers to the Celestial Courts. Those whose hearts remain clouded by dust cannot awaken or guide their ancestors. The ranks of the Earth Offices are graded according to hierarchy.\n\n*Dongyuan Collection, Scroll One, Concluded*\n*Dongyuan Collection, Scroll Two*\n\nMaster Chongmiao Li Sicong’s *Ten Great Grotto-Heavens*\n\n**First:** Wangwu Mountain’s Celestial Altar Peak summit rises one hundred and twenty *li* high, its grotto spanning ten thousand *li* in circumference. Named the Lesser Gathering of Pure Emptiness Heaven, it is governed by Du Chong and Wang Bao as the Lesser Gathering Heavenly King and Pure Emptiness Perfected, located in Wangwu County of Luojing.\n\n**Second:** Weiyu Mountain, its grotto spanning ten thousand *li* in circumference, named the Greater Gathering of Luminous Void Heaven. Governed by Sima Jizhu as the Greater Gathering Perfected, it is said in the *Erya* of Taizhou to lie within the sea.\n\n**Third:** Xicheng Mountain, two thousand *zhang* high, its grotto spanning three thousand *li* in circumference, named the Supreme Mystery Ultimate Perfection Heaven. Governed by Perfected Wang Fangping, it lies one thousand *li* west of Chengdu Prefecture in Liangzhou, entering the western frontier.\n\n**Fourth:** Xixuan Mountain, two thousand seven hundred *zhang* high, its grotto spanning one thousand *li* in circumference, named the Three Mysteries Ultimate Perfection Heaven. Administered by Perfected Pei, it is said to be inaccessible to the people of Huazhou, entering the western frontier.\n\n**Fifth:** Qingcheng’s Great Face Mountain, three thousand six hundred eighty *zhang* and nine *chi* high, its grotto spanning two thousand *li* in circumference, named the Precious Immortal Nine-Chambered Heaven. Governed by Perfected Yu, it is where the Yellow Emperor sought the Dao and Perfected Lord Xiyi transmitted the *Dragon-Riding Scripture* to the emperor. Located in Qingcheng County of Shuzhou.\n\n**Sixth:** Tiantai’s Red Wall Mountain, eighteen thousand *zhang* high, its grotto spanning five hundred *li* in circumference, named the Upper Clarity Jade Level Heaven. Governed by Perfected Wang of Tong Bridge, it is where Immortal Lord Ge Xuan refined the elixir and attained the Dao. Corresponding to the Terrace constellation above, it is thus named Tiantai, located in Tiantai County of Taizhou.\n\n**Seventh:** Luofu Mountain, three thousand six hundred *zhang* high, its grotto spanning five hundred *li* in circumference, named the Vermilion Brilliance Radiant Perfection Heaven. It is the Isle of Penglai, where in the time of Yao, the floodwaters surged from the sea and merged with Luo Mountain—hence the name Luofu. It is where Ge Hong, the Master Who Embraces Simplicity, refined the elixir and attained the Dao, located in Boluo County of Huizhou.\n\n**Eighth:** Mao Mountain, one hundred seventy *zhang* high, its grotto spanning one hundred fifty *li* in circumference, named the Golden Altar Flourishing Yang Heaven. Originally called Goju Mountain, it was renamed Mao Mountain after the Mao Lords refined the elixir and attained the Dao. Records state: The Flourishing Yang Grotto-Heaven gives birth to a golden altar a hundred *zhang* high, with palaces of purple jade, all serving as the wandering and resting places of the Upper Clarity Perfected. Located in Jurong County of Shengzhou.\n\n**Ninth:** Linwu Mountain, its grotto spanning four hundred *li* in circumference, named the Dark Abyss of Hidden Spirits Heaven, also called Baoshan. Situated within Lake Tai, it is where Yu the Great, after regulating the waters, concealed the Five Numinous Talismans within this grotto. Located in Suzhou.\n\n**Tenth:** Kuocang Mountain, its grotto spanning three hundred *li* in circumference, named the Hidden Perfection of Accomplished Virtue Heaven. Administered by Perfected Xu Laile, located in Chuzhou.\n\n---\n\n**Thirty-Six Grotto-Heavens**\n\n**First:** Huotong Mountain, three thousand four hundred *zhang* high, its grotto spanning three thousand *li* in circumference, named the Huolin Heaven. Governed by Perfected Zheng Siyuan, Han Zhong, and Xu Ying as the Lords of Destiny, located in Changxi County of Fuzhou.\n\n**Second:** Eastern Marchmount Tai Mountain, four thousand *zhang* and two *chi* high, its grotto spanning one thousand *li* in circumference, named the Pengxuan Cavernous Void Heaven. Here, Taihao serves as the Green Emperor, governing the Eastern Marchmount, overseeing the generation of all things and examining the souls of the dead and spirits of ghosts. It is the sacred peak where successive emperors reported their merits and performed the feng and shan sacrifices. Corresponding to the essence of the Straddling and Harvester constellations above, it presides over the land of Lu below. Located in Fengfu County of Yanzhou.\n\n**Third:** Southern Marchmount Heng Mountain, four thousand ten *zhang* high, its grotto spanning two thousand *li* in circumference, named the Vermilion Mound Supreme Void Heaven. Here, the Divine Farmer, the Red Emperor, governs the Southern Marchmount. Formerly, the Celestial Thearch descended with a jade tally and treasure seal, bestowing them upon the Perfected Lord of Life, eternally guarding this numinous peak—this is the mountain whose longevity rivals that of Our August Emperor. Corresponding to the essence of the Wings, Crossbar, and Balance constellations above, it is thus named Heng, presiding over the land of Chu below. Located in Hengshan County of Hengzhou.\n\n**Fourth:** Western Marchmount Hua Mountain, seven thousand *zhang* high, its grotto spanning two thousand *li* in circumference, named the Supreme Ultimate Assembly of Immortals Heaven. Here, Shaohao serves as the White Emperor, governing the Western Marchmount. In ancient times, the Spirit of the Mighty Torrent split its summit with his hands and pressed its base with his feet to channel the flow and rescue the people from the calamity of the great flood. The form of the Immortal’s Palm gleams resplendently to this day. Corresponding to the essence of the Well and Ghost constellations above, it presides over the land of Qin below. Located in Huayin County of Huazhou.\n\n**Fifth:** Northern Marchmount Chang Mountain, two thousand nine hundred *zhang* high, its grotto spanning two thousand *li* in circumference, named the Supreme Unity Assembly of Mystery Heaven. Here, Zhuanxu serves as the Black Emperor, governing the Northern Marchmount. It has five names: first, the Orchid Terrace Palace; second, the Palace of the Exemplary Women; third, the Flourishing Yang Terrace; fourth, the Purple Tenuity Terrace; and fifth, the Supreme Unity Palace. Corresponding to the essence of the Net and Turtle Beak constellations above, it presides over the land of Yan below, overseeing the abundant harvest of the Five Grains throughout the world.\n\nSixth: Central Marchmount Song Mountain, seven thousand *zhang* high, its grotto spanning one thousand *li* in circumference, named the Celestial Controller of Authenticity Heaven. Here, the Yellow Emperor governs the Central Lands, where the essence of earth virtue coalesces into the Yellow Elder, whose abode gives rise to immortals. Behold the towering stalks of the *beiduo* tree, the Terrace where Jade Maidens weave brocade, the stone marrow and jade rings, the jade figures and golden statues. Corresponding to the essence of the Willow, Star, and Spread constellations above, it presides over the land of Zhou below, located in Dengfeng County of Luojing.\n\nSeventh: Mount Emei, its grotto spanning three hundred *li* in circumference, named the Vast Numinous Great Mystery Heaven. Here, the Heavenly Perfected Sovereign once resided, and the Yellow Emperor sought the Dao upon this mountain. The Sovereign bestowed upon him the *Scripture of Guarding the Three Ones*, which has been transmitted through the ages. Yan Junping of the Han assisted in this mountain’s governance, located in Emei County of Jiazhou.\n\nEighth: Mount Lu, three thousand nine hundred *zhang* high, its grotto spanning one thousand seven hundred *li* in circumference, named the Immortal Numinous Chanting Authenticity Heaven. In ancient times, it was called the Three Screened Mountain of the Son of Heaven. During the reign of King Wu of Zhou, Master Fangfu, styled Junji, rode a white donkey into the mountain, wove grass into a hut, and refined the elixir to attain the Dao—hence the name Mount Lu. Here, the Perfected Ones Wang Chang and Zhao Sheng govern, located in Deyang County of Jiangzhou.\n\nNinth: Fourfold Brilliance Mountain, comprising two hundred eighty peaks, its grotto spanning one hundred eighty *li* in circumference, named the Cinnabar Mountain and Scarlet Waters Heaven. The mountain has four gates, through which the light of the sun, moon, and stars passes—hence the name Fourfold Brilliance. When the First Emperor of Qin drove the mountains to block the sea, the ghosts and spirits toiled and fled into the Fourfold Brilliance Grotto, refusing to emerge—thus it was also named Ghost Concealment Mountain, located in Mingzhou.\n\nTenth: Mount Yangping, situated within the borders of Fan County in Shu Commandery, one hundred eighty *li* from Chengdu. Its grotto spans three hundred fifty *li* in circumference, named the Utmost Mystery and Great Origin Heaven, where Yu’s cave conceals the scriptures.\n\nEleventh: Mount Taibai, its grotto spanning five hundred *li* in circumference, named the Heaven of True Virtue. Here, Master Guigu transmitted the arts of statecraft to Su Qin, aiding his service to the kingdom. The temple and shrine remain in Chang’an County.\n\nTwelfth: West Mountain, its grotto spanning six hundred *li* in circumference, named the Heaven of Celestial Treasure and Utmost Authenticity. Here, Master Hongya refined the elixir by the well and cultivated the Dao, and the Twelve Perfected Lords Wu and Xu ascended to immortality from their abodes. Located in Nanchang County of Hongzhou.\n\nThirteenth: Great Encompassing Mountain, spanning three hundred *li* in circumference, named the Heaven of Nurturing Life and Mysterious Supremacy, located in Liling County of Tanzhou.\n\nFourteenth: Mount Qian, its grotto spanning eight hundred *li* in circumference and one thousand *zhang* high, named the Heaven of the Celestial Pillar Controller of Mystery. Here, the Perfected Left Ci refined the elixir to attain the Dao. It is governed by the August Ancestor of the Imperial Dynasty, the Great Emperor of the Nine Heavens who Commands Destiny, located in Huaining County of Shuzhou.\n\nFifteenth: Ghost Valley Mountain, its grotto spanning seven thousand *li* in circumference, named the Heaven of Great Origin and Contemplative Authenticity. Here, the Orthodox Unity Perfected Zhang, Celestial Master, refined the elixir and cultivated the Dao, located in Guixi County of Xinzhou.\n\nSixteenth: Mount Wuyi, its grotto spanning one hundred twenty *li* in circumference, named the Heaven of Ascending Transformation and Mysterious Authenticity. Here, the Lord of Wuyi governs. The mountain rises three hundred *ren* high, located in Jianyang County of Jianzhou.\n\nSeventeenth: Jade Bamboo Shoot Mountain, thirty *li* high and four hundred *li* in circumference, named the Heaven of Primordial Simplicity and Lawful Joy. In ancient times, it was called the Clustered Jade Peaks. Emperor Wu of Han established an altar to receive the *Shangqing Record*, whereupon heaven bestowed jade bamboo shoots—hence its name. Here, the Great Eminent Heavenly King governs. The Nine Perfected of Han, Du Tanyong, and Xiao Ziyun refined the elixir and ascended to immortality from this place, located in Xingan County of Linjiang Prefecture.\n\nEighteenth: Flower Canopy Mountain, its grotto spanning four hundred *li* in circumference, named the Heaven of Capacious City and Grand Jade, located in Yongjia County of Wenzhou.\n\nNineteenth: Covering Bamboo Mountain, its grotto spanning one hundred eighty *li* in circumference, named the Heaven of Eternal Radiance and Treasure Origin. Here, Emperor Yu subdued the mountain, and the Perfected Ge Xiaoxian governed. Master Bu attained the Dao in this place, located in Huangyan County of Taizhou.\n\nTwentieth: Mount Dujiao, its grotto spanning one hundred eighty *li* in circumference, named the Heaven of Treasure Mystery, located in Rongzhou.\n\nTwenty-First: White Stone Mountain, its grotto spanning seven hundred *li* in circumference, named the Heaven of Jade Beauty and Eternal Authenticity, located in Rongzhou.\n\nTwenty-Second: Goulou Mountain, its grotto spanning three hundred *li* in circumference, named the Heaven of Jade Gate and Treasure Jade Tablet. Here, the Perfected Ge Hong refined the elixir, located in Beiliu County of Rongzhou.\n\nTwenty-Third: Mount Jiuyi, its grotto spanning three thousand *li* in circumference, named the Heaven of Courted Authenticity and Grand Vacuity. Governed by the Supreme Perfected Lord of the Great Ultimate, Confucius, it is where the Perfected Lord Hehou resided and convened with Shun, parting the golden liquid to ascend to immortality, located in Yankang County of Daozhou.\n\nTwenty-Fourth: Mount Dongyang, its grotto spanning one hundred fifty *li* in circumference, named the Heaven of Dongyang’s Hidden Observation, located in Tanzhou.\n\nTwenty-Fifth: Mount Mofu, its grotto spanning one hundred *li* in circumference, named the Heaven of Grotto Authenticity and Grand Mystery, located in Pingjiang County of Yuezhou.\n\nTwenty-Sixth: Great You Mountain, its grotto spanning one hundred *li* in circumference, named the Heaven of Great You’s Flourishing Mystery. Here, the Recluse Shanjuan of Yao’s time resided, and Master Zhang Guo of the Tang cultivated the Dao, located in Chen Prefecture.\n\nTwenty-Seventh: Golden Court Mountain, its grotto spanning three hundred *li* in circumference, named the Heaven of Golden Court’s Lofty Mystery, located in Kuaiji County of Yuezhou.\n\nTwenty-Eighth: Mount Magu, its grotto spanning one hundred fifty *li* in circumference, named the Heaven of Cinnabar Rosy Clouds. Here, the Perfected Lord Wang Fangping of the Southern Culmen met Magu at Cai Jing’s residence and ascended to immortality, located in Nancheng County of Jianchang Prefecture.\n\nTwenty-Ninth: Immortal Capital Mountain, spanning three hundred *li* in circumference, named the Heaven of Mysterious Capital’s Prayer for Immortals. Here, the Yellow Emperor mounted a fiery dragon to ascend to immortality;\n\nLocated in Chuzhou’s Jinyun County.\n\nThirtieth: Mount Qingtian, spanning five hundred *li* in circumference, named the Heaven of Qingtian’s Great Crane. Here, the Daoist of the Green Ox attained the Dao, located in Chuzhou’s Qingtian County.\n\nThirty-First: Mount Zhong, spanning one hundred *li* in circumference, named the Heaven of Zhuhu’s Supreme Life. Here, Ma Mingsheng resided, located in Shengzhou’s Shangyiwu County.\n\nThirty-Second: Mount Liangchang, spanning thirty *li* in circumference, named the Heaven of Liangchang’s Square Assembly. Here, Mao Zhong, as the Perfected Lord of Life Preservation, resided; the entire family of Attendant Xu and Yang Lang attained the Dao, located north of Maoshan in Runzhou.\n\nThirty-Third: Mount Zigai, its grotto spanning eighty *li* in circumference, named the Heaven of Purple Mystery’s Radiant Grotto, located in Hangzhou’s Yuhang County.\n\nThirty-Fourth: Mount Tianmu, possessing two peaks: the left peak rises three thousand *zhang*, the right two thousand five hundred *zhang*. Its grotto spans one hundred *li* in circumference, named the Heaven of the Supreme Mystery’s Canopy, located in Hangzhou.\n\nThirty-Fifth: Mount Taoyuan, its grotto spanning seventy *li* in circumference, named the Heaven of White Horse’s Mystery and Perfection. During the Qin dynasty, over three thousand people entered the grotto to avoid calamity, all attaining the Dao. Here, the Perfected Lord Huang Qu refined elixirs and attained the Dao, located in Dingzhou’s Wuling County.\n\nThirty-Sixth: Mount Jinhua, rising one thousand *zhang* in height, its grotto spanning five hundred *li* in circumference, named the Heaven of Jinhua’s Grotto Origin. Here, the Perfected Lord Huang Chuping met Red Pine and, by shouting stones into sheep, attained the Dao. Located in Weizhou’s Jinhua County, it corresponds above to the Star of the Beautiful Maiden, hence the name Mount Jinhua.\n\n*Dongyuan Ji*, Scroll Two, concludes.\n*Dongyuan Ji*, Scroll Three.\n\nMaster Chongmiao Li Sicong’s Compilation\n\n**Mount Jiu Xian**\n**Mount Guang Sang** is the Eastern Marchmount of Heaven. Located in the Eastern Sea, it stands as the first of the Five Marchmounts to arise. Above it rise the turquoise palaces of rosy clouds, forests of jasper trees, purple sparrows, and emerald simurghs, while jade lotus and white citrus defy description. Here, the Heavenly Lord of the Azure Emperor, Ling Weiyang, commands ten thousand immortals to guard this mountain, governing the essence of Jupiter and dwelling within the Ninefold Black Azure Heavens.\n\n**Mount Chang Li** is the Southern Marchmount of Heaven. Situated in the Southern Sea, its heights bear crimson palaces, vermilion towers, scarlet chambers, and cinnabar halls, along with vermilion grasses, rainbow mushrooms, rosy ointments, and golden liquors—all beyond description. All newly attained immortals under heaven journey to this palace to refine their forms, bathe their essences, dissolve yin, and temper yang, mastering the Way of longevity and enduring vision. Here, the Heavenly Lord of the Vermilion Emperor, Chi Biaonu, commands ten thousand immortals to guard this mountain, governing the essence of Mars and dwelling within the Threefold Black Cinnabar Heavens.\n\n**Mount Li Nong** is the Western Marchmount of Heaven. Located in the Western Sea, its heights bear the white-flowered palaces, the Triple Simplicity Citadel, the Jade Spring Palace, and groves of jasper trees where unicorns and phoenixes dwell—all beyond description. Here, the Heavenly Lord of the White Emperor, Bai Zhaoqu, commands ten thousand immortals to guard this mountain, governing the essence of Venus and dwelling within the Sevenfold Black Simplicity Heavens.\n\n**Mount Guang Ye** is the Northern Marchmount of Heaven. Situated in the Weak Waters of the Northern Sea, its form resembles Kunlun, joining Mount Dengdu Luo as the sovereign of yin and darkness. Above rise towers of jasper and palaces of treasure, golden liquors and sacred mushrooms—all beyond description. Here, the Heavenly Lord of the Black Emperor, Xu Guangji, commands ten thousand immortals to guard this mountain, governing the essence of Mercury and dwelling within the Fivefold Black Mysterious Heavens.\n\n**Mount Kunlun** is the Central Marchmount of Heaven. Located amid the Eight Seas, its summit aligns with the heart of heaven, its form like an inverted canopy—broad above and narrow below, ascending in three tiers to meet the celestial measurements of ten thousand degrees. The yellow and red paths of the sun and moon intersect upon it, where the Three Luminaries traverse. To the east it is called Kunlun, to the west the Dark Garden, to the north the Board Wind, and to the south it connects with the Accumulated Stones and Great Crags. Springs and waters flow from its Northern Gate, with four faces each spanning ten thousand *li*. Above stand palaces of jasper blossoms and halls of radiant jade, forests of jasper and emerald streams. The Queen Mother of the West governs the assembled perfected ones here. The Four Marchmounts of the seas serve as its branches, encircled by the Ten Continents, Three Isles, Eight Seas, and great rivers. At its summit rise five golden terraces, twelve jade towers, and a golden city spanning a thousand *li*. The earth bears forests of golden roots and jasper boughs, where purple magpies, emerald simurghs, jade peaches, and purple crabapples adorn the land with countless treasures. Here, the Heavenly Lord of the Yellow Emperor, Han Shuniu, commands ten thousand immortals to guard this mountain, governing the grotto heavens and connecting with the Five Marchmounts and famous mountains of the Middle Kingdom. Immortals come and go, examining the registers of the living. Above, it governs the essence of Saturn and dwells within the Central Black Heaven. These five mountains beyond the seas are the Five Pillars of Heaven and Earth, the Five Marchmounts of creation, and the ancestral origins of the Five Black Heavens.\n\n**Mount Penglai** lies in the Eastern Sea, rising a thousand *li* in height and spanning three thousand *li* in circumference. Above stand golden terraces and jade palaces, the capital of immortals and the realm where the Supreme Thearch and transcendent beings wander and rest. The sea’s waters are truly black, called the Qi and Bo. Though windless, towering waves rise a hundred *zhang*, making passage impossible—only flying immortals may reach this place.\n\n**Mount Fusang** lies in the Eastern Sea, spanning ten thousand *li* in circumference and located nine hundred thousand *li* from the Middle Kingdom. It is governed by the Great Perfected Elder and the Azure Lad. The mountain abounds with forests, all of mulberry trees. The tallest reach several thousand *zhang*, the thickest two thousand *wei* in girth, their trunks leaning against one another, growing from the same root—hence the name Fusang. The mulberry’s fruit is sweet, fragrant, and crimson, ripening once every thousand years. Immortals who pluck and eat it radiate golden light, soaring through the vast heavens. Upon the mulberry trees dwell golden phoenixes and nine-colored crows; when one crows, all the world’s roosters respond, and dawn breaks.\n\n**Mount Fangzhang** lies in the Great Sea, rising forty-seven thousand *zhang* in height. Above stands the Palace of the Great Prime, where the Three Heavens’ Lords of Destiny and the assembled perfected ones reside. Above flow jade nectars and golden liquors; drinking them grants longevity. Auspicious birds and wondrous trees defy description. Additionally, the Nine Springs Elder’s palace governs all the water spirits of the world—shark dragons, giant whales, and aquatic beings.\n\n**Mount Canglang** lies in the Great Sea, rising five hundred *li* in height and spanning three thousand five hundred *li* in circumference. The waters on all four sides are deep blue, which immortals call Canglang. The mountain abounds with stone cassia and stone mushrooms, and at its heart lies a chamber of purple jade. Here, the Nine Elders of the Transcendent Capital command tens of thousands of immortal officials and soldiers to govern this mountain together.\n\n**The Eight Divine Continents**\n**Yingzhou** lies in the Eastern Sea, spanning four thousand *li* in circumference and located seven hundred thousand *li* from the shore, directly opposite Kuaiji. Above rise Green Mound and Emerald Water, two mountains, along with ten thousand palaces of jasper and jade chambers. The earth yields jade wine; drinking it grants longevity. It also produces Kunwu iron, which when forged into blades can slice jade like mud. Divine mushrooms and sacred grasses grow upon its cliffs and peaks—all beyond description. Here dwell the highest perfected immortals.\n\n**Zuzhou** lies in the Eastern Sea, spanning ten thousand *li* in circumference and located seventy thousand *li* from the shore. The earth yields the immortal jade-field mushrooms and herbs, also called the Spirit-Nourishing Mushroom. Its form resembles melon vines, growing several *chi* in length. When placed upon the face of the dead, they revive. The First Emperor of Qin once obtained this herb and dispatched envoys to consult Master Guigu of Beiguo, who confirmed its efficacy. He then sent Xu Fu, styled Junfang, with five hundred boys and girls, provisions of gold and silk, and ships to sail into the sea in search of Zuzhou and its herbs. They never returned, and the First Emperor was deeply grieved.\n\nThe isle is home to ten thousand immortal households and the highest perfected transcendents—all beyond description.\n\n**Juku Isle** lies in the Western Sea, spanning three thousand *li* in circumference and located two hundred forty thousand *li* from the shore. Atop it stands a great mountain resembling the form of a human crow, hence named Renwu Mountain. Within lies the Cavernous Mystery Palace, and the mountain bears the Revert-Soul Fragrant Tree. Its form resembles paulownia blossoms, its fragrance detectable for hundreds of *li*. When its sap is refined into incense, it yields six varieties: the first, *Startling Essence Incense*; the second, *Thunder-Spirit Incense*; the third, *Return-Life Incense*; the fourth, *Thunder-Sandalwood Incense*; the fifth, *Phoenix-Essence Incense*; and the sixth, *Death-Repelling Incense*. These six names denote the wondrous treasures of the immortals. When the dead inhale its fragrance, they revive. Here too dwell the highest perfected transcendents within the grotto-heavens and palaces of the immortals. By the Han era, it had become accessible to the Middle Kingdom.\n\n**Yan Isle** lies in the Southern Sea, spanning two thousand *li* in circumference and located ninety thousand *li* from the shore. For thousands of *li* on all sides, the land steams with scorching heat that blazes to the heavens. Birds flying high dare not cross the sea, for its waters boil on all sides. Atop the isle stands the Fire-Mountain Mouse, its fur several *chi* in length. Immortals gather its fur to weave into cloth, called *Fire-Cloak Fabric*. When made into garments and washed with water, they never become bright and clean; but when burned with fire, they turn as white as snow. The isle also produces the Wind-Born Beast, azure as a leopard cat. When piled with kindling and set aflame, its fur remains unchanged. Only when the dead beast is touched by wind does it revive. Above stands the Great Mountain Flowing-Fire Palace, where ten thousand immortal households are governed by the highest perfected transcendents and ranked immortals. By the Han era, it too had become accessible to the Middle Kingdom.\n\n**Fenglin Isle** lies in the Western Sea, spanning one thousand five hundred *li* in circumference, encircled by Weak Waters where even a feather cannot float. The isle abounds with qilins and phoenixes, from which it takes its name. It yields Revert-Soul Incense and *Continuous-String Glue*. Immortals boil phoenix beaks and qilin horns together to make this adhesive, azure as jasper, also called *Linked-Gold Mud*—a divine and wondrous substance. Above stand the Azure Blossom Palace and the White Cinnabar Grove, where the highest perfected transcendents reside. Mortals of this world can never reach this place.\n\n**Mystic Continent** lies in the Northern Sea, spanning two thousand two hundred *li* in circumference, thirty-six thousand *li* from shore. Its land is rich with hills and mountains, where Wind Mountain’s rumblings shake like thunder. Directly aligned with the Gate of Heaven stands the **Mystic Capital Prefecture**, governed by the Transcendent Lords and Perfected Ones. It yields gold, jade, and purple mushrooms. Though no wind stirs, towering waves rise a hundred *zhang*; only flying transcendents traverse its expanse—mortals can never reach it.\n\n**Flowing Continent** lies in the Western Sea, spanning three thousand *li* in circumference, nine hundred thousand *li* from shore. Upon it rises **Flying Rosy Clouds Mountain**, where divine transcendents come and go. Strange blossoms, wondrous fruits, auspicious herbs, and numinous mushrooms defy description. Within its immortal precincts dwell the highest Perfected and Spirit Officials.\n\n**Everlasting Continent** lies in the Southern Sea, spanning five thousand *li* in circumference, two hundred thousand *li* from shore. Upon it stands **Perfected Capital Mountain**, also called **Azure Mound**. The land yields sweet dew, jade blossoms, and the **Purple Jade Palace**, where Heavenly Perfected Maidens and Female Transcendents reside. Mortals can never reach this place.\n\n**Primal Continent** lies in the Northern Sea, spanning three thousand *li* in circumference, one hundred thousand *li* from shore. Upon it stands the **Purple Void Jade Pavilion**, the abode of divine transcendents. It yields sacred medicines and spirit mushrooms; within its **Mystic Gorge**, sweet nectar flows like honey—those who drink it attain longevity. Here, the highest Perfected and Spirit Officials hold governance.\n\n**Living Continent** lies in the Eastern Sea, spanning two thousand five hundred *li* in circumference, two hundred thirty thousand *li* from shore, bordering Penglai. Its mountains abound with divine herbs and numinous mushrooms; those who consume them ascend as flying transcendents. Above dwell ten thousand immortal households, all governed by lofty and reclusive divine transcendents.\n\n*Collected Writings of the Grotto Abyss, Scroll Three*\n*Compiled by Master Chongmiao, Li Sicong*\n\nThe Seventy-Two Blessed Lands of the World’s Renowned Mountains\n\nFirst Blessed Land: **Mount Earth-Lung**, at the heart of Mount Zhongnan in Chang’an, where the Four Hoary Masters cultivated the Dao.\nSecond Blessed Land: **Mount Covering Bamboo**, in Huangyan County, Taizhou.\nThird Blessed Land: **Mount Azure-Distant**, in Nanyang.\nFourth Blessed Land: **Mount Peace**, in Jiaozhou.\nFifth Blessed Land: **Mount Stone-Crag**, in Tiantai County, Taizhou.\nSixth Blessed Land: **Eastern Immortal Source**, in Taizhou.\nSeventh Blessed Land: **Mount Green Islet**, in the Eastern Sea, connecting midway to Fusang Isle.\nEighth Blessed Land: **Yumu Hollow**, at the heart of Jade Bamboo Shoot Mountain, in Xingan County, Linjiang Prefecture.\nNinth Blessed Land: **Mount Red Waters**, in Xiliang Prefecture, Western Barbarian Lands.\nTenth Blessed Land: **Mount Magu**, behind the summit in Jianchang Prefecture.\nEleventh Blessed Land: **Mount Jun**, at the heart of Dongting Lake, in Yuezhou.\nTwelfth Blessed Land: **Cassia Source**, where Perfected Lord Yin attained the Dao, in Jianyang County, Jianzhou.\nThirteenth Blessed Land: **Numinous Ruins**, atop Mount Tiantai, in Tiantai County, Taizhou.\nFourteenth Blessed Land: **Xian Isle**, in Yuezhou.\nFifteenth Blessed Land: **Heavenly Mother Peak**, where Master Li cultivated the Dao, in Kè County, Yuezhou.\nSixteenth Blessed Land: **Ruoye Stream**, in Yuezhou.\nSeventeenth Blessed Land: **Mount Golden Court**, in Mingzhou.\nEighteenth Blessed Land: **Mount Horse-Ridge**, in Bangzhou.\nNineteenth Blessed Land: **Mount Goose-Sheep**, in Tanzhou.\nTwentieth Blessed Land: **True Ruins**, in Changsha.\nTwenty-First Blessed Land: **Altar of Pure Jade**, atop Mount Southern Marchmount.\nTwenty-Second Blessed Land: **Altar of Radiant Heaven**, in Hengzhou, Southern Marchmount.\nTwenty-Third Blessed Land: **Grotto Palace**, where Master Lou Jing cultivated the Dao, in Chang’an.\nTwenty-Fourth Blessed Land: **Mount Pottery**, in Qiongzhou.\nTwenty-Fifth Blessed Land: **Grotto Numinous Source**, in Hengzhou.\nTwenty-Sixth Blessed Land: **Three Sovereigns’ Well**, in Yongjia County, Wenzhou.\nTwenty-Seventh Blessed Land: **Mount Rotten Axe**, in Quzhou.\nTwenty-Eighth Blessed Land: **Le Stream**, in Jianzhou.\nTwenty-Ninth Blessed Land: **Mount Dragon-Tiger**, where Heavenly Master Zhang resides, in Xinzhou.\nThirtieth Blessed Land: **Mount Numinous**, in Xinzhou.\nThirty-First Blessed Land: **White Water Source**, atop Mount Luofu, where Perfected Lord Zheng Siyuan refined the elixir, in Boluo County, Huizhou.\nThirty-Second Blessed Land: **Mount Carefree**, at the heart of Western Mountains, where Perfected Lord Xu tempered his sword, in Hongzhou.\nThirty-Third Blessed Land: **Mount Closed-Thorn**, where Heavenly Master Zhang observed the treasure Black Floating Heaven, and upon excavating a grotto cavern, obtained a jade image of the Heavenly Worthy, thus establishing the grotto; in Xingan County, Linjiang Prefecture.\nThirty-Fourth Blessed Land: **Mount Beginning Abundance**, in Fengcheng County, Hongzhou.\nThirty-Fifth Blessed Land: **Mount Golden Essence**, in Qianhua County, Qianzhou.\nThirty-Sixth Blessed Land: **Eastern White Source**, in Hongzhou.\nThirty-Seventh Blessed Land: **Mount Alms-Bowl Pool**, where Perfected Lord Qiao cultivated the Dao, in Chuzhou.\nThirty-Eighth Blessed Land: **Mount Debate**, in Danyang County, Runzhou.\nThirty-Ninth Blessed Land: **Altar of Master Mao**, where Master Liu Gen cultivated the Dao, in Anhao County.\nFortieth Blessed Land: **Mount Parrot Cage**, in Liyang County, Hezhou.\nForty-First Blessed Land: **Mount Paulownia-Wu**, in Tangzhou.\nForty-Second Blessed Land: **Northern Slope of Mount Pingdu**, where Longevity cultivated the Dao, in Zhongzhou.\nForty-Third Blessed Land: **Mount Green Gauze**, in Wuling County, Dingzhou.\nForty-Fourth Blessed Land: **Mount Manifest Vision**, in Fengling County, Zouzhou.\nForty-Fifth Blessed Land: **Mount Embracing Blessing**, in Jiaozhou, Southern Sea.\nForty-Sixth Blessed Land: **Mount Great Face**, atop Mount Qingcheng, in Qingcheng County, Shuzhou.\nForty-Seventh Blessed Land: **Heart of Mount Lu, Tiger Stream**, residence of Master Five Willows, in De’an County, Jiangzhou.\nForty-Eighth Blessed Land: **Mount Yuanchen**, where Perfected Lord Su ascended, in Duchang County.\nForty-Ninth Blessed Land: **Mount Horse-Track**, where the Supreme Old Lord descended, bestowing the *Treatise on Bone Physiognomy* upon the Azure Lad; the horse’s hoofprints were imprinted upon the stone altar, thus establishing a shrine and palace, in Dantu County, Runzhou.\nFiftieth Blessed Land: **Mount Virtue**, where Master Shanjuan of Yao’s time cultivated the Dao, in Wuling County, Dingzhou.\nFifty-First Blessed Land: **Blue Waters**, in Lantian County, Chang’an.\nFifty-Second Blessed Land: **Mount Jade Peak**, in Hezhong Prefecture.\nFifty-Third Blessed Land: **Mount Heavenly Eye**, in Liyang County, Hezhou.\nFifty-Fourth Blessed Land: **Mount Shang Valley**, where the Four Hoary Masters cultivated the Dao, in Shangzhou.\nFifty-Fifth Blessed Land: **Grotto of Master Zhang**, in Yixing County, Changzhou.\nFifty-Sixth Blessed Land: **Fish Lake Grotto**, where the First Emperor of Qin sought the Dao, on Mount Siming.\nFifty-Seventh Blessed Land: **Mount Central Ridge**, in Hezhong Prefecture.\nFifty-Eighth Blessed Land: **Numinous Ruins**, in Tiantai County, northern Taizhou.\nFifty-Ninth Blessed Land: **Mount Mian Bamboo**, in Mianjiang County, Mianzhou.\nSixtieth Blessed Land: **Mount Sweet**, in Qianzhou.\nSixty-First Blessed Land: **Mount Rare**, in Hanzhou.\nSixty-Second Blessed Land: **Mount Golden City**, in Yunzhong Prefecture.\nSixty-Third Blessed Land: **Mount Numinous**, in Wuwei County.\nSixty-Fourth Blessed Land: **Mount Northern Lang**, in Luoxian.\nSixty-Fifth Blessed Land: **Mount Wudang**, in Wudang County, Junzhou.\nSixty-Sixth Blessed Land: **Mount Woman Howl**, at the mouth of the Three Gorges.\nSixty-Seventh Blessed Land: **Mount Lesser Chamber**, in Nanyang County, Dengzhou.\n\nSixty-Eighth Blessed Land: **Mount Lu**, in De’an County, Jiangzhou.\nSixty-Ninth Blessed Land: **Mount West Source**, in Huangyan County, Taizhou.\nSeventieth Blessed Land: **Mount Southern Field**, in Shengzhou, East Sea.\nSeventy-First Blessed Land: **Mount Jade Flow**, in the Eastern Sea, adjoining Fusang Isle.\nSeventy-Second Blessed Land: **Mount Hold Calf**, in Xuzhou.\n\n*Dongyuan Ji*, Scroll Four ends here\n*Dongyuan Ji*, Scroll Five\n\n**Master Chongmiao Li Sicong’s Compilation**\n\n**Water Palaces**\nThe transcendent officials of the Eastern Sea Water Palace reside in Azure Flower Palace, governed by King Broad Virtue; its temple stands in Laizhou.\nThe transcendent officials of the Southern Sea Water Palace reside in Cinnabar Mound Palace, governed by King Broad Benefit; its temple stands in Guangzhou.\nThe transcendent officials of the Western Sea Water Palace reside in Plain Spirit Palace, governed by King Broad Moisture; its temple stands in Hezhong Prefecture.\nThe transcendent officials of the Northern Sea Water Palace reside in Dark Depths Palace, governed by King Broad Marsh; its temple stands in Mengzhou.\n\nThe **Song River Water Emperor Temple** stands in Suzhou.\nThe **Chu River Water Emperor Temple** stands in Jiangzhou.\nThe **Xiang River Water Emperor Temple** stands in Tanzhou.\nThe **Jing River Water Emperor Temple** stands in Panzhou.\nThe **Han River Water Emperor Temple** stands in Lizhou.\nThe **Southern River Water Emperor Temple** stands in Hongzhou.\nThe **Yangzi River Water Emperor Temple** stands in Runzhou.\nThe **Wu River Water Emperor Temple** stands in Suzhou.\n\nThe **Jiang River** originates from Min Mountain in Mian territory, governed by Duke Broad Source; its temple stands in Jianning County, Yizhou.\nThe **Yellow River** originates from the Kunlun wastes, governed by Duke Manifest Sacred Source; its temple stands in Hezhong Prefecture.\nThe **Huai River** originates from Tongwu Mountain in Nanyang, governed by Duke Long Source; its temple stands in Tangzhou.\nThe **Ji River** originates from Mount Wangwu, named the Shen River, governed by Duke Clear Source; its temple stands in Jiyuan County, Heyang.\n\nThe **Yellow River Earl Temple** stands on the northern frontier.\nThe **Luo River Earl Temple** stands in Luojing.\nThe **Huai River Earl Temple** stands in Sizhou.\nThe **Tai Lake Water Spirit Temple** stands in Suzhou.\nThe **Green Grass Lake Water Spirit Temple** stands in Yuezhou.\nThe **Pengli Lake Water Spirit Temple** stands in Nankang Prefecture.\nThe **Xieyang Lake Water Spirit Temple** stands in Chuzhou.\nThe **Danyang Lake Water Spirit Temple** stands in Taiping Prefecture.\n\nThe **Upper Perfected Temple of Gorge Stream** stands in Wushan County, Kuizhou.\nThe **Upper Perfected Temple of Five Clouds Stream** stands in Yuezhou.\nThe **Upper Perfected Temple of Min Mountain Stream** stands in Jiazhou.\nThe **Upper Perfected Temple of Clear Distant Stream** stands in Guangzhou.\nThe **Upper Perfected Temple of Tongwu Stream** stands in Tiantai County, Taizhou.\nThe **Upper Perfected Temple of Coiling Mound Stream** stands in Jiazhou.\nThe **Upper Perfected Temple of Kunlun Stream** stands in the northern lands.\nThe **Upper Perfected Temple of Wuling Stream** stands in Dingzhou.\nThe **Upper Perfected Temple of Ramie Stream** stands in Yuezhou.\nThe **Upper Perfected Temple of Di Stream** stands in Lizhou.\nThe **Upper Perfected Temple of Yuan Sand Stream** stands in Yuezhou.\nThe **Upper Perfected Temple of Mian Pool Stream** stands in Luojing.\n\nFirst: **King Blessed Peace of the River**, of the Upper Water Palace of Mount Madang; its temple stands in Jiangzhou.\nSecond: **King Pacifying Saint of the River**, of the Central Water Palace of Mount Caishi; its temple stands in Taiping Prefecture.\nThird: **King Illustrious Trust of the Great River**, of the Lower Water Palace of Mount Jin; its temple stands in Runzhou.\n\n*Dongyuan Ji*, Scroll Five ends here\n*Dongyuan Ji*, Scroll Six\n\nThe *Collected Works of Master Chongmiao*, Li Sicong\n\n**The Twenty-Eight Sacred Peaks of the World**\n\nFirst: **Yangping Precinct**.\nCorresponding above to the Horn Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Metal destiny.\nThe Yangping Precinct mountain lies within the borders of Fan County in Shu’s capital, one hundred and eighty *li* from the city. The path follows the Luo River into the bifurcation of the Two Peaks Pass, with a water route of forty *li*. To the east of the precinct’s path stands the Dragon Gate, guarded by divine waters, upon which two parasol trees grow. To the southwest lies a great spring, where waters converge and flow onward.\nThe Celestial Master’s descendant, the Perfected Lord Hui Ziling, ascended here in the second year of *Guanghe* (180 CE) on the fifteenth day of the first month, erecting a pair of steles that remain at the precinct’s gate.\n\nSecond: **Lutang Precinct**.\nCorresponding above to the Neck Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Metal destiny.\nThe Lutang Precinct mountain lies within the borders of Fan County in Shu’s capital, three hundred *li* north of the city. At its summit stand immortal chambers and a terrace, an ancient site where transcendents attained liberation.\n\nThird: **Heming Precinct**.\nCorresponding above to the Root Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Wood destiny.\nThe Heming Precinct mountain’s peak connects with Mount Qingcheng and Mount Tianxiang, two hundred *li* from Chengdu, within the borders of Pi County in Shu’s capital. The direct path spans three hundred *li*, though the world remains unaware that this was once the place where Ma Di and He Dan attained the Dao.\nBefore the precinct, three waters merge into a single stream, where divine dragons reside. Of old, four beast-headed figures stood, with golden nails piercing two stones, and two *hu* of golden and silver silkworms. It is also said that Master Yin Xi presided here.\nThe *Biographies of Divine Immortals* further record that when the Celestial Master Zhang encountered chaos and warfare in the Central Kingdom, he retreated to Heming Mountain to cultivate the Dao and ascend.\n\nFourth: **Liyuan Precinct**.\nCorresponding above to the Chamber Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Earth destiny.\nThe Liyuan Precinct mountain lies within the borders of Fan County in Shu’s capital, connected to the Lutang Precinct. Its ravine extends eighty *li*, two hundred and fifty *li* from Chengdu. At its summit grow a hundred sacred fruits, numinous pines, and divine herbs; those who consume them attain longevity. This is the gateway where the Four Dragon Spirits ride.\nIt was here that Fan Li attained the Dao and ascended.\n\nFifth: **Gexi Precinct**.\n\nCorresponding above to the Heart Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Fire destiny.\nThe Gexi Precinct mountain lies within the borders of Fan County in Shu’s capital, connected to the Liyuan Mountain. It stands two hundred and thirty *li* from Chengdu and forty-eight *li* from the Yangping Precinct’s water gate. Here, the immortal Yang Xian and the adept Lu Nü attained the Dao. At its summit grow golden grains and jade mushrooms; those who consume them attain longevity. The mountain rises six hundred *zhang*.\n\nSixth: **Gengchu Precinct**.\nCorresponding above to the Tail Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Earth destiny.\nThe Gengchu Precinct mountain rises three hundred and ninety *zhang* above the plain, within the borders of Yangquan County in Guanghan Prefecture. It lies five *li* west of the county seat and three hundred and eighty *li* from Chengdu. Here, immortals come and go, offering refuge for those who seek to withdraw from the world and cultivate life. This is where the adept Zhang Lishi and the perfected Zhao Sheng attained the Dao and ascended. The\n\nTenth: **Lishang Precinct**.\nCorresponding above to the Woman Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Fire destiny.\nThe Lishang Precinct mountain lies within the borders of Deyang County in Guanghan Prefecture, one hundred and twenty *li* to the northeast. The mountain holds two stone chambers and one divine well. White deer, white cranes, and white turtledoves come and go like men. The precinct connects with Mianwu, and to the west, above the Stone Creek, three pines mark the site. The mountain rises two thousand nine hundred *zhang* above the plain. Here, Master Jizi and Wei Shuqing attained the Dao and ascended.\n\nEleventh: **Yongquan Precinct**.\nCorresponding above to the Void Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Wood destiny.\nThe Yongquan Precinct mountain once lay in Guanghan. Ma Mingsheng studied the Dao here and encountered the Most High Lord Lao, who bestowed upon him the method of transforming form. The precinct lies within the borders of Xiaohan County in Suining Prefecture. Above it is a spring whose waters cure all ailments; those who drink are instantly healed. Ancient tradition holds: the Blessed Water Precinct lies two *li* from Chengdu. A hundred-*zhang* cliff rises there, where apes and a hundred crows soar. The mountain is small yet lofty, with paths winding in all four directions.\n\nTwelfth: **Chougeng Precinct**.\nCorresponding above to the Rooftop Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Fire destiny.\nThe Chougeng Precinct mountain lies in Nan’an County of Jianwei Prefecture, one hundred and ten *li* from Chengdu. Nine *li* from the Wenkou Mountain River, the peak rises one thousand seven hundred *zhang* above the city. Here, the Yellow Emperor cultivated the Dao and encountered the Nine Heavens Holy Mother, who bestowed upon him the *Canon of Elixirs* and the arts of war. To the left and right of the precinct stand imperial mulberry trees in succession. To the northwest flows the Flavor River. The mountain abounds with magic mushrooms and divine herbs; those who consume them attain longevity.\n\nThirteenth: **Beiping Precinct**.\nCorresponding above to the House Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Metal destiny.\nThe Beiping Precinct mountain lies in Nan’an County of Jianwei Prefecture, one hundred and forty *li* from Chengdu. The mountain holds a pool two hundred *bu* wide, within which grow divine mushrooms and herbs; those who eat them attain long life. Here, Wang Ziqiao of Yue and Lord Yu of Qingcheng once dwelled to cultivate the Dao. It is also called the Ke Mountain Precinct.\n\nFourteenth: **Benzhu Precinct**.\nCorresponding above to the Wall Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Wood destiny.\nThe Benzhu Precinct mountain lies in Nan’an County of Jianwei Prefecture, one hundred and twenty-five *li* from Chengdu. The mountain rises one thousand three hundred *zhang*. Above it is a stream, and to the north of the precinct lies a fragrant grove. A dragon cavern pierces through to Mount Emei. Above stand cassia and parasol trees. Here, Guo Zisheng attained the Dao. Behind it lies a bamboo grove. Fifteen *li* to the west, a tunnel was carved through to Mount Heming. At the tail of the mountain’s waters, dragons often sport within.\n\nFifteenth: **Mengqin Precinct**.\nCorresponding above to the Straddler Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Fire destiny.\nThe Mengqin Precinct mountain lies west of Nadu County in Jun Prefecture, twenty *li* from the prefectural seat and one thousand four hundred *li* from Chengdu. The precinct is separated from Jun Prefecture by a river. Before it stands a small mountain, and behind it, a great mountain rising one thousand *zhang*. Here, Yi Yin studied the Dao and ascended. It produces the Golden Liquid Herb; those who consume it attain long life.\n\nSixteenth: **Pinggai Precinct**.\n\nSixteenth: **Pinggai Precinct**.\nCorresponding above to the Bond Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Earth destiny.\nThe Pinggai Precinct mountain lies in Wuyang County of Jianwei Prefecture, eighty *li* from Chengdu. Beneath the mountain is a grotto, within which stands a jade figure thirteen *chi* tall, and three golden caskets. Here, Cui Xiaotong of Wu Prefecture studied the Dao and ascended. The mountain is traversed by a great river; to its south lies the Longevity Spring, and to its north, the Flat Plain Dragon Gate.\n\nSeventeenth: **Yuntai Precinct**.\nCorresponding above to the Helmet Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Fire destiny.\nThe Yuntai Precinct mountain lies west of Langzhong County in Baxi Prefecture, sixty *li* from the county seat and one thousand three hundred seventy *li* from Chengdu. Four hundred disciples of Heavenly Master Zhang cultivated and refined their practice here. In the second year of Han’an, they ascended in broad daylight. Thereafter, Heavenly Master’s disciples Wang Chang and Zhao Sheng also refined elixirs and consumed them here, ascending to heaven. Before the precinct, Baxi’s great floodwaters once surged; within the mountain’s cliffs grows a peach tree that blooms once every three years and bears fruit once every five. It stands seven hundred *zhang* down a sheer cliff, above a bottomless valley. Only Zhao Sheng cast himself down to pluck the peach and present it to the Heavenly Master; no other could retrieve it. Within the precinct, jade maidens riding white cranes and white deer would suddenly appear to welcome the Heavenly Master’s ascent in broad daylight, witnessed by all the people. This is Mount Tianzhu. Before the Yuntai Precinct stand twin steles, still extant.\n\nEighteenth: **Jinkou Precinct**.\nCorresponding above to the Pleiades Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Wood destiny.\nThe Jinkou Precinct mountain lies in Jiangyang County of Hanzhong Prefecture, two thousand nine hundred twenty *li* from Chengdu. The waters of Hanzhong flow past the mountain, which is also called Pingyuan Mountain. To its west stretches a long ridge, and to its east, a flowing sea. The Water Lord governs here, and it is named the Azure Dragon Gate. Chen Anshi studied the Dao here and ascended as a flying immortal; Anshi was a native of Jingzhao.\n\nNineteenth: **Houcheng Precinct**.\n\nCorresponding above to the Net Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Earth destiny.\nThe Houcheng Precinct mountain lies in Nanzheng County of Hanzhong Prefecture. Before it flows a great river, and behind it rise layered mountains. Here grow divine lingzhi mushrooms that never wither for a thousand years. It is also called Huangling Mountain. To its south stretches a long ridge, to its north stands Qinglong Mountain, and to its east, pines and wutong trees mark the site. Formerly, Xia Ziran studied the Dao here and ascended as a flying immortal.\n\nTwentieth: **Gongmu Precinct**.\nCorresponding above to the Turtle Beak Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Metal destiny.\nThe Gongmu Precinct lies in Nanzheng County of Hanzhong Prefecture, one hundred *li* from the precinct. It is also called Beifengxian. To the south of the mountain lies a stone pit, and to its north, a cascading stream. Formerly, Su Zi studied the Dao here.\n\nTwenty-first: **Pingwai Precinct**.\nCorresponding above to the Three Stars Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Water destiny.\nThe Pingwai Precinct mountain lies in Nan’an County of Jianwei Prefecture, one hundred *li* from Chengdu. To its north flows Caoxi Stream. As recorded in the *Jianwei Annals*, a man of Shu, Li A, attained the Dao and ascended here.\n\nTwenty-second: **Zhubu Precinct**.\nCorresponding above to the Well Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Metal destiny.\nThe Zhubu Precinct mountain lies within the borders of Jianwei County, one hundred fifty *li* from Chengdu. It is also called Qiuchang Mountain. To its south stand stone chambers and a jade hall, with pines and wutong trees growing before them. Formerly, a man of Shu, Wang Xing, cultivated the Dao here.\n\nTwenty-third: **Yuju Precinct**.\nCorresponding above to the Ghost Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Water destiny.\nThe Yuju Precinct mountain lies two *li* to the left of the southern gate of Chengdu. On the seventh day of the first month in the first year of Yongshou, the Most High Lord Lao rode a white deer, and Heavenly Master Zhang rode a white crane to this place. A divine jade table emerged, upon which they ascended to a cloud-borne seat. There, the essential Daoist precepts were transmitted to the Heavenly Master. The four stone legs of the table remain before the Yuju Precinct.\n\nTwenty-fourth: **Beiyu Precinct**.\nCorresponding above to the Willow Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Earth destiny.\n\nThe Beiyu Precinct mountain lies in Luoyang County, Henan Prefecture, with a beam-like tree standing to its left and right. A great yellow spring emerges from the eastern cave, flowing southward. This was the place where Master Wucheng attained the Dao.\n\nThe above twenty-four precincts all have known locations in prefectures and counties. However, the *Map of the Earth* by Heavenly Master Zhang states: these four precinct mountains lie northeast of the capital, though their exact prefectural and county jurisdictions remain undetermined.\n\nTwenty-fifth: **Zhengyu Precinct**, located on Lánwǔ Mountain.\nCorresponding above to the Star Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Water destiny.\n\nTwenty-sixth: **Baishi Mountain Precinct**, located on Zuǒjí Mountain.\nCorresponding above to the Spread Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Metal destiny.\n\nTwenty-seventh: **Zhōngmào Precinct**, located on Fànyáng Mountain.\nCorresponding above to the Wing Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Water destiny.\n\nTwenty-eighth: **Jùshān Precinct**, located on Yuánshù Mountain.\nCorresponding above to the Chariot Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Earth destiny.\n\n*Dongyuan Collection*, Scroll Six concluded.\n*Dongyuan Collection*, Scroll Seven.\n\nMaster Chongmiao Li Sicong’s *Collection of the Ten Celestial Luminaries of the Zhou Tian*\n\nThe Sun is the essence of the Great Yang, the symbol of the sovereign. Within it dwell the Solar Emperor, immortals, divine officials, and myriad beings who cultivate the *Yuyi* path of hastening toward the sun. The Sun is the Palace of Penetrating Yang, naturally giving rise to forests of azure-green jade. Heavenly officials gather and consume its blossoms and fruits, their bodies radiating golden light. The dark essence of the Sun transforms into the Golden Crow. It roosts within these forests, emerging at dawn from the Valley of Yang and setting at dusk in the Crags of Qi, completing one circuit of the heavens each year.\n\nThe Solar Emperor of the Sun Palace governs the twenty-eight stellar sovereigns of the celestial sphere and the celestial bureau that registers life spans and fortunes. At each of the Three Primes, the myriad spirit-officials of heaven all journey to the Sun Palace to review the records of human transgressions and blessings, presenting them to the Supreme Emperor—this is called the *Yang Palace’s Register of Life*.\n\nThe solar soul emits nine rays of darkness, its radiance illuminating the ten thousand lands. The Sun is named *Yuyi*.\n\nThe Moon is the essence of the Great Yin, the symbol of the empress and her ministers. Within it dwell the Lunar Emperor, immortals, divine officials, and myriad beings who cultivate the *Jielin* path of hastening toward the moon. The Moon is the Palace of Vast Cold and Penetrating Yin, naturally giving rise to forests of azure-blossomed purple cassia—also called the Crimson Forest. Its branches and leaves are red as orchids. Immortals gather and consume its blossoms and fruits, their longevity equaling that of the sun and moon, ascending thereafter into the Jade Purity.\n\nThe dark essence of the lunar soul transforms into the Jade Hare. Completing one circuit of the heavens each month, the Lunar Emperor of the Moon Palace governs the Five Peaks, the Four Seas, the Five Lakes, the Twelve Streams, and the water palaces, as well as Fengdu’s Mount Luoshan. At each of the Three Primes, the officials of the underworld and their subordinates all journey to the Moon Palace to review and determine the records of human life, death, transgressions, and blessings, presenting them to the Supreme Emperor—this is called the *Yin Palace’s Register of Death*.\n\nThe lunar soul perpetually suffuses tenfold radiance, its light illuminating the ten thousand lands. The Moon is named *Jielin*.\n\nThe Star Sovereign of Wood Virtue of the East is the essence of Wood, child of the Azure Emperor. His light shines for three hundred thousand *li*, with a diameter of one hundred *li*, completing one circuit of the heavens every twelve years. The Perfected Sovereign wears a star crown, vermilion shoes, and a robe of azure mist and crane-feathered longevity, holding a jade tablet and bearing a seven-jeweled sword, with white jade pendants at his belt. He governs human affairs of mountains, forests, grasses, trees, dragons, serpents, fish, turtles, aquatic creatures, wind, and thunder. The *qi* of Wood moves directly with benevolence and harmony, presiding over those of virtue.\n\nThe Star Sovereign of Fire Virtue of the South, the Flaming Domain, is the essence of Fire, child of the Red Emperor and the star of execution. His essence descends to become the spirit of the Wind Earl. Each tenth month, he enters the Supreme Subtlety to receive his duties. His light shines for eight hundred thousand *li*, with a diameter of approximately one hundred *li*, completing one circuit of the heavens every two years. The Star Sovereign wears a star crown, vermilion shoes, and a robe of vermilion mist and crane-feathered longevity, holding a jade tablet and bearing a seven-star golden sword, with white jade pendants at his belt. He governs human affairs of flames, insects, phoenixes, pheasants, crows, magpies, shrikes, flocks of birds, and sparrows. The virtue of Fire blazes forth, patrolling the world below.\n\nThe Star Sovereign of Metal Virtue of the West is the essence of Metal, child of the White Emperor, wielding the awe of generals and the severity of execution. His essence descends to become the spirit of the Rain Master. His light shines for seven hundred thousand *li*, with a diameter of one hundred *li*, completing one circuit of the heavens each year. The Star Sovereign wears a star crown, vermilion shoes, and a robe of white mist and crane-feathered radiance, holding a jade tablet and bearing a seven-star precious sword, with white jade pendants at his belt. He governs human affairs of gold, silver, copper, iron, jade, stone, hares, oxen, horses, livestock, swine, rats, insects, stone men, stone horses, frost, and snow.\n\nThe Star Sovereign of Water Virtue of the North is the essence of Water, child of the Black Emperor. The virtue of Water is the heart of heaven, the Purple Dawn Star, directly aligned with the summit of Kunlun. The Purple Tenuity Palace is the master of primordial *qi*. His essence descends to become the spirit of the First Farmer, presiding over the generation of beings. His light shines for five hundred thousand *li*, with a diameter of one hundred *li*, completing one circuit of the heavens each year. The Star Sovereign wears a star crown, vermilion shoes, and a robe of black mist and crane-feathered longevity, holding a jade tablet and bearing a seven-star precious sword, with white jade pendants at his belt. He governs human affairs of aquatic creatures, sharks, dragons, schools of fish, snow, hail, and freezing cold. Vast and great, he crowns the Five Phases, root of the myriad beings, and oversees the regulation of seas, rivers, and streams.\n\nThe Star Sovereign of Earth Virtue of the Center is the child of the Yellow Emperor. His essence descends to become the numinous spirit of the stars. His light shines for one hundred twenty thousand *li*, with a diameter of fifty *li*, completing one circuit of the heavens every twenty-nine years. The Star Sovereign wears a star crown, vermilion shoes, and a robe of yellow mist and crane-feathered longevity, holding a jade tablet and bearing a seven-star sword, with white jade pendants at his belt. He governs human affairs of the multitudes, insects, ants, and the like, as well as mist, dew, rainbows, and mirages. The Earth Mansion presides over trustworthiness, generosity, and the affairs of the myriad beings.\n\nThe Star Sovereign of the Demon-Head governs all evils beneath the Nine Heavens. He wears a star crown, vermilion shoes, and a robe of pure dark mist and clouded radiance, holding a jade tablet and bearing a seven-star golden sword, with white jade pendants at his belt. He moves counter to the celestial Way; compliance brings prosperity, defiance brings calamity.\n\nThe Star Sovereign of the Demon-Tail governs all fortunes and misfortunes beneath the Nine Heavens, primarily overseeing disasters of illness and suffering. He wears a star crown, vermilion shoes, and a robe of pure dark auspicious clouded radiance, holding a jade tablet and bearing a seven-star golden sword, with white jade pendants at his belt. He moves counter to the celestial Way, his divine radiance concealed. Compliance brings good fortune, defiance brings misfortune.\n\nThe Star Sovereign of the Celestial Unity and Purple Darkness wears a star crown, vermilion shoes, and a robe of purple mist and auspicious clouds, holding a jade tablet and bearing a seven-star precious sword, with white jade pendants at his belt. He eternally attends the gate of the Purple Tenuity Enclosure, bestowing the hundred blessings upon humanity and overseeing the augmentation of life spans and fortunes.\n\nThe Star Sovereign of the Great Unity and Lunar Comet oversees all violent deaths beneath the Nine Heavens. He wears a star crown, vermilion shoes, and a robe of dark radiance and crane-longevity clouds, holding five jade tablets and bearing a seven-star precious sword, with white jade pendants at his belt. He moves counter to the black Way—compliance brings good fortune, defiance brings misfortune.\n\nHere end the Eleven Luminaries of the Celestial Circuit.\n\nThe Seven Primordial Star Sovereigns of the Northern Dipper\n\nThe First Star of the Northern Dipper, Celestial Pivot, is the Star Sovereign of Greedy Wolf and Celestial Flower. Above, he governs the lodges of Chamber, Roof, House, Heart, Winnowing Basket, Ox, and below, the regions of Yang, Zheng, Yichong, and Xu. He oversees the life, fate, and official fortune of those born in the *zi* hour, recording the worldly affairs of those seeking office or position, and presides over the True Scripture of Prolonged Life through the Northern Dipper’s Yang Brilliance. The Supreme Palace of the Greedy Wolf Star Sovereign governs the sun. He wears a robe of vermilion radiance and crimson clouds, a seven-jeweled star crown, and serves as the Celestial Grand Commandant. His star spans nine hundred *li*, its light illuminating the ten thousand states.\n\nThe Second Star of the Northern Dipper, Celestial Wanderer, is the Star Sovereign of Gigantic Gate and Celestial Task. Above, he governs the lodges of Neck, Straddler, Well, Ghost, Spread Wings, and below, the regions of Lin, Jing, Chu, and Zhou. He oversees the life, fate, and official fortune of those born in the *chou* and *hai* hours, recording the worldly affairs of those seeking immortality and cultivating the Dao, and presides over the True Scripture of Calamity Transcendence through the Northern Dipper’s Yin Essence. The Middle Primordial Palace of the Gigantic Gate Star Sovereign governs the moon. He wears a robe of dark radiance and trailing clouds, a seven-jeweled star crown, and serves as the Celestial Grand Minister. His star spans five hundred *li*, its light illuminating the ten thousand states, and he presides over the court of awakening and Daoist cultivation.\n\nThe Third Star of the Northern Dipper, Celestial Mechanism, is the Star Sovereign of Emolument Storehouse and Celestial Pillar. Above, he governs the lodges of Bond, Stomach, Three Stars, and Willow, and below, the regions of Song and Yu. He oversees the life, fate, and official fortune of those born in the *yin* and *xu* hours, recording the worldly affairs of those seeking wealth and estates, and presides over the True Scripture of Life Preservation through the Northern Dipper’s True Lord. The True Primordial Palace of the Emolument Storehouse Star Sovereign governs fire. He wears a robe of vermilion radiance and auspicious clouds, a seven-jeweled star crown, and serves as the Celestial Minister of Works. His star spans seven hundred and twenty *li*, its light illuminating the ten thousand states.\n\nThe Fourth Star of the Northern Dipper, Celestial Balance, is the Star Sovereign of Literary Curve and Celestial Heart. Above, he governs the lodges of Ox and Rooftop, and below, the regions of Wu and Yue. He oversees the life, fate, and official fortune of those born in the *mao* and *you* hours, recording the worldly affairs of longevity, fortune, and physical appearance, and presides over the True Scripture of Literary Brilliance and Beneficence through the Northern Dipper. The Darkly Twisted Palace of the Literary Curve Star Sovereign governs wood. He wears a robe of blue-green radiance and auspicious clouds, a seven-jeweled star crown, and serves as the Celestial Itinerant Inspector. His star spans eight hundred *li*, its single brilliance illuminating the ten thousand states.\n\nThe Fifth Star of the Northern Dipper, Celestial Impulse, is the Star Sovereign of Integrity and Chastity and Celestial Bird. Above, he governs the lodges of Dark Warrior, Tail, and Woman, and below, the regions of Zhao, Ji, Wei, and Jin. He oversees the official fortune, fate, and blessings of those born in the *chen* and *shen* hours, recording the worldly affairs of marriage and concubines, and presides over the True Scripture of Disaster Dispelling through the Northern Dipper’s Cinnabar Primordium. The Palace of the Webbed Spirit of the Integrity and Chastity Star Sovereign governs earth. He wears a robe of yellow radiance and auspicious clouds, a seven-star precious crown, and serves as the Celestial Dipper Lord. His star spans seven hundred and twenty *li*, its light illuminating the ten thousand states.\n\nThe Sixth Star of the Northern Dipper, Celestial Yang, is the Star Sovereign of Martial Brilliance and Celestial Assistance. Above, he governs the lodges of House, Dipper, and Ox, and below, the region of Yan. He oversees the official fortune and fate of those born in the *si* and *wei* hours, recording the worldly affairs of livelihood, career, and wealth, and presides over the True Scripture of Disaster Dispersal through the Northern Dipper’s Northern Culmen. The Palace of the Bright Record of the Martial Brilliance Star Sovereign governs wood. He wears a robe of blue-green radiance and auspicious clouds, a seven-jeweled star crown, and serves as the Celestial Grand Master of Ceremonies. His star spans seven hundred *li*, its light illuminating the ten thousand states.\n\nThe Seventh Star of the Northern Dipper, Shimmering Brilliance, is the Star Sovereign of Ruptured Army and Celestial Pass. Above, he governs the lodges of Void, Wings, Horn, Straddler, and Base, and below, the regions of Qing, Qi, Wei, and Bingzhou. He oversees the official fortune and fate of those born in the *wu* hour, recording the worldly affairs of fortune, virtue, appearance, wives, concubines, servants, and maids, and presides over the True Scripture of Decline Support through the Northern Dipper’s Celestial Pass. The Palace of the Convergent Pass of the Ruptured Army Star Sovereign governs metal. He wears a robe of plain radiance, a seven-jeweled star crown, and serves as the Celestial Grand Minister. His star spans nine hundred *li*, its light illuminating the ten thousand states.\n\nHere ends Scroll Seven of the *Dongyuan Collection*.\nScroll Eight of the *Dongyuan Collection* begins.\n\nMaster Chongmiao Li Sicong’s Compilation\n*The Descent of the Spirits of the Twenty-Eight Lunar Lodges of the Celestial Circuit*\n\n**The Essence of the Azure Dragon: The Seven Eastern Lodges**\n*Lodge of the Horn, Celestial Gate Star Sovereign* – Above, it aligns with the Supreme Radiance of the Jade Heaven of Great Splendor; below, it illumines the terrestrial domain of Zheng. It governs the outer seas of the kingdoms of Qiemi, Yeshi, Jialing, and nine lesser states, and below, oversees the affairs of human generals, armaments, rainfall, life-prolonging blessings, agriculture, and the cultivation of fields.\n\n*Lodge of the Neck, Celestial Court Star Sovereign* – Above, it aligns with the Dark Luminance of the Reverent Celebration Heaven; below, it illumines the terrestrial domain of Zheng. It governs the outer seas of the Western Heavenly Realm of India, the kingdoms of Gandhara, Luoxie, and nine lesser states, and below, oversees the affairs of human pestilence, gales, flying stones, medicinal herbs, the Three Dukes, the Five Elders, and the official ranks of the hundred officers.\n\n*Lodge of the Root, Celestial Treasury Star Sovereign* – Above, it aligns with the Observant Luminance of the Upright Serenity Heaven; below, it illumines the terrestrial domain of Zheng. It governs the outer seas of the kingdoms of Jiaye, Milo, Xintou, and Pimo, and nine lesser states, and below, oversees the affairs of human empresses, palace bureaus, mountains, forests, grasses, trees, and excessive rainfall.\n\n*Lodge of the Chamber, Celestial Steed Star Sovereign* – Above, it aligns with the Void Luminance of the Hall of Brilliance Heaven; below, it illumines the terrestrial domain of Song. It governs the outer seas of the kingdoms of Huoxun, Bolü, Heiyi, and nine lesser states, and below, oversees the affairs of human empresses’ inner chambers, treasures, jade, keys, startling winds, torrential rains, and the bearing of heavy burdens.\n\n*Lodge of the Heart, Celestial King Star Sovereign* – Above, it aligns with the Twenty-First Heaven of Falling August Cliffs; below, it illumines the terrestrial domain of Song. It governs the outer seas of the kingdoms of Dashi, Duzu, and nine lesser states, and below, oversees the affairs of human emperors, the Hall of Light, rainfall, corvée labor, martial arts, and the hundred crafts.\n\n*Lodge of the Tail, Celestial Phoenix Star Sovereign* – Above, it aligns with the Radiant Luminance of the Ancestral Drifting Heaven; below, it illumines the terrestrial domain of Yan. It governs the outer seas of the kingdoms of Zhenbin, Jiluo, Duowu, and nine lesser states, and below, oversees the affairs of human auspicious clouds, propitious mists, and discord among women.\n\n*Lodge of the Winnowing Basket, Celestial Law Star Sovereign* – Above, it aligns with the Dark Luminance of the Reverent Splendor Heaven; below, it illumines the terrestrial domain of Yan. It governs the outer seas of the kingdoms of Kang, Jiesu, and nine lesser states, and below, oversees the affairs of human slanting winds, fine rains, treachery, flattery, barbarians, foxes, northern tribes, and aquatic creatures of ferries and waterways.\n\n**The Essence of the Dark Warrior: The Seven Northern Lodges**\n*Lodge of the Dipper, Celestial Treasury Star Sovereign* – Above, it aligns with the Supreme Ultimate of the Veiled Heaven; below, it illumines the terrestrial domain of Wu. It governs the outer seas of the kingdoms of Tuhuoluo, Chuanbi, and the Queen Mother of the West, and nine lesser states, and below, oversees the affairs of human examination graduates, official ranks, gentle winds, fine rains, measures of *hu*, *dou*, *sheng*, and *ge*, and scales.\n\n*Lodge of the Ox, Celestial Mechanism Star Sovereign* – Above, it aligns with the Void of the Transcendent Balance Heaven; below, it illumines the terrestrial domain of Wu. It governs the outer seas of the three great tribal kingdoms of the Black Mountains in the northern frontier, and nine lesser states, and below, oversees the affairs of human clouds, fog, frost, snow, cattle, sheep, the six livestock, sacrificial animals, insects, and the hundred beasts, as well as the southern barbarians.\n\n*Lodge of the Maiden, Celestial Maiden Star Sovereign* – Above, it aligns with the Supreme Luminance of the Seven Luminaries of the Majestic Heaven; below, it illumines the terrestrial domain of Wu. It governs the outer seas of the kingdoms of Jianfa, Nüguo, and Gouguo, and nine lesser states, and below, oversees the affairs of human tailoring, clothing, marriages, betrothals, and congealing yin winds.\n\n*Lodge of the Void, Celestial Treasury Star Sovereign* – Above, it aligns with the Primordial Luminance of the Literary Elevation Heaven; below, it illumines the terrestrial domain of Qi. It governs the outer seas of the kingdoms of Fulin, Wuying, and Muzhi, and nine lesser states, and below, oversees the affairs of human palaces, ancestral halls, roofed dwellings, ancestral sacrifices, the Five Depletions, the Six Wastes, and lamentations.\n\n*Lodge of the Rooftop, Celestial Coin Star Sovereign* – Above, it aligns with the Primordial Womb of the Balanced Nurturance Heaven; below, it illumines the terrestrial domain of Qi. It governs the outer seas of the kingdoms of Tufan, Tongguo, and Eastern India, and nine lesser states, and below, oversees the affairs of human hills, graves, lamentations, whirlwinds, sand, stones, dangers, and perils.\n\n*Lodge of the House, Celestial Chill Star Sovereign* – Above, it aligns with the Pure Luminance of the Harmonious Child Heaven; below, it illumines the terrestrial domain of Wei. It governs the outer seas of the kingdoms of the Ten Tribes of Jinshan, the Nine Tribes, and the Three Great Tribal Kingdoms, and nine lesser states, and below, oversees the affairs of human palaces, golden gates, jade halls, literature, archives, military provisions, and congealed yin stagnation.\n\n*Lodge of the Wall, Celestial Market Star Sovereign* – Above, it aligns with the Supreme Luminance of the Jade Perfection Heaven; below, it illumines the terrestrial domain of Wei. It governs the outer seas of the kingdoms of Qiuci, Yutian, and Shule, and nine lesser states, and below, oversees the affairs of human literature, maps, books, secret repositories, cold rains, thunderclaps, and the hundred grains and fruits.\n\n**The Essence of the White Tiger: The Seven Western Lodges**\n*Lodge of the Straddler, Celestial General Star Sovereign* – Above, it aligns with the Supreme Ultimate of the Balanced Nurturance of the Illustrious Heaven; below, it illumines the terrestrial domain of Lu. It governs the outer seas of the kingdoms of Chanyu, Dikang, and Huohu, and nine lesser states, and below, oversees the affairs of human armories, weapons, spears, moats, ponds, pavilions, and wind, rain, thunder, and lightning.\n\n*Lodge of the Bond, Celestial Prison Star Sovereign* – Above, it aligns with the Dragon Transformation of the Brahmanic Attainment Heaven; below, it illumines the terrestrial domain of Lu. It governs the outer seas of the kingdoms of Sanshan and Xianguan, and nine lesser states, and below, oversees the affairs of human temples, monasteries, imperial parks, inner courts, sacrificial offerings, suburban sacrifices, and Daoist fasts.\n\n*Lodge of the Turtle Beak, Celestial Granary Star Sovereign* – Above, it aligns with the Supreme Release of the Jade Dragon Heaven; below, it illumines the terrestrial domain of Zhao. It governs the outer seas of the kingdoms of Gaoli, Fuyu, and Southern India, and nine lesser states, and below, oversees the affairs of human granaries, accumulated gold, silver, treasures, silks, and the Lord of Thunder and the five grains.\n\n*Lodge of the Mane, Celestial Eye Star Sovereign* – Above, it aligns with the Supreme Void of the Unsurpassed Constant Fusion Heaven; below, it illumines the terrestrial domain of Zhao. It governs the outer seas of the kingdoms of Shewei, Huilu, and Northern India, and nine lesser states, and below, oversees the affairs of human celestial clarity, the removal of misfortune, prisons, judicial offices, punishments, imprisonment, interrogation, and execution.\n\n**Lodge of the Net, Celestial Ear Star Sovereign** – Above, it aligns with the Supreme Essence and Joyous Prohibition Heaven; below, it illumines the terrestrial domain of Zhao. It governs the outer seas of the kingdoms of Zhendan, Snow Mountain, and Dragon Central Heavenly Lord, and nine lesser states, and below, oversees the affairs of human celestial-terrestrial harmony, vermilion chariots and jeweled canopies, border troops and frontier defense, and the pacification of territories.\n\n**Lodge of the Turtle Beak, Celestial Screen Star Sovereign** – Above, it aligns with the Supreme Literary Brilliance and Wondrous Completion Heaven; below, it illumines the terrestrial domain of Jin. It governs the outer seas of the kingdoms of Brahmin, Water-Non-Adjacent, and Thorn-Plucking, and nine lesser states, and below, oversees the affairs of human harvest and storage of the myriad things, wind, thunder, rain, and moisture, mountains and rivers, dwellings and ancestral temples, and the suppression of ghosts, demons, and malevolent spirits.\n\n**Lodge of the Three Stars, Celestial Water Star Sovereign** – Above, it aligns with the Abyssal Permeation of the Primordial Grotto Heaven; below, it illumines the terrestrial domain of Jin. It governs the outer seas of the kingdoms of Pihan, Overturned Illumination, and Tattooed Forehead, and nine lesser states, and below, oversees the affairs of human generals, scales of authority, territorial boundaries, executions, grievances, robbery, plunder, and violent disputes.\n\n**Essence of the Vermilion Bird of the Southern Seven Lodges**\n\n**Lodge of the Well, Celestial Well Star Sovereign** – Above, it aligns with the Non-Ultimate Dharma-Oath Heaven; below, it illumines the terrestrial domain of Qin. It governs the outer seas of the kingdoms of True Hunting, Linyi, and Body-Form, and nine lesser states, and below, oversees the affairs of human celestial dimness, ponds, embankments, wells, bridges, great waters, rivers, lakes, and the fish and dragon clans.\n\n**Lodge of the Ghost, Celestial Repository Star Sovereign** – Above, it aligns with the Supreme Butterfly Joy Heaven; below, it illumines the terrestrial domain of Qin. It governs the outer seas of the kingdoms of Jiaozhi, Tattooed Body, and Suiluo, and nine lesser states, and below, oversees the affairs of human accumulation and storage, gold, jade, silks, funerary misfortune, curses, poisonous medicines, and the investigation of treachery and evil.\n\n**Lodge of the Willow, Celestial Kitchen Star Sovereign** – Above, it aligns with the Non-Thought River Origin Heaven; below, it illumines the terrestrial domain of Zhou. It governs the outer seas of the kingdoms of Kunming, Barbarian Tail, and Sweet Dew, and nine lesser states, and below, oversees the affairs of human kitchens and flavors, celestial dimness, thunder, rain, weapons, and banditry.\n\n**Lodge of the Star, Celestial Treasury Star Sovereign** – Above, it aligns with the Supreme August Venerable Floating Countenance Heaven; below, it illumines the terrestrial domain of Zhou. It governs the outer seas of the Twenty-One Eastern Heavenly Kingdoms, Mudha, and Dog-Head, and nine lesser states, and below, oversees the affairs of human tailoring, clothing, embroidery, celestial clarity, swords, and bloodshed.\n\n**Lodge of the Extended Net, Celestial Balance Star Sovereign** – Above, it aligns with the Primordial Filial Purity Heaven; below, it illumines the terrestrial domain of Zhou. It governs the outer seas of the kingdoms of Great Vow, Haling, and Bali, and nine lesser states, and below, oversees the affairs of human ancestral temples, treasures, clothing, banquets, guests, seasonal cold and heat, disharmony of qi, extreme cold and heat, discord between father and son, and strife between brothers.\n\n**Lodge of the Wings, Celestial Capital Star Sovereign** – Above, it aligns with the Manifestly Fixed Ultimate Wind Heaven; below, it illumines the terrestrial domain of Chu. It governs the outer seas of the kingdoms of Lengjia, Bazhong, and Moluo, and nine lesser states, and below, oversees the affairs of human music bureaus, tuning of the five notes and six pitches, aquatic palaces of fish and dragons, and the flying, walking, and feathered multitudes.\n\n**Lodge of the Chariot, Celestial Stair Star Sovereign** – Above, it aligns with the Supreme Peaceful August Cliff Heaven; below, it illumines the terrestrial domain of Chu. It governs the outer seas of the kingdoms of Southern India, Dānshēn, and Lion, and nine lesser states, and below, oversees the affairs of human celestial-terrestrial brightness, weeping and parting, official disputes, and perilous calamities.\n\n*Dongyuan Collection, Scroll Eight Concluded*\n*Dongyuan Collection, Scroll Nine*\n\n**Master Chongmiao Li Sicong’s Compilation of the Divine Palaces of the Thirty-Two Heavens of Supreme Purity**\n\n**Great Yellow August Layered Heaven** – Allotted to the First Heaven of the Eastern Direction, the Heaven of Pure Tenuity, ruled by the Celestial Emperor of Primordial Yang *qi*. The *qi* of this heaven is yellow, linked to the Brahma Heaven of the East. It governs the registers of long life throughout the world, belonging to the Realm of Desire.\n\n**Great Brightness Jade Perfection Heaven** – Allotted to the Second Heaven of the Eastern Direction, the Heaven of Yu Remnant, ruled by the Celestial Emperor of Upper Yang *qi*. The *qi* of this heaven is green, transforming and giving rise to the Wall Mansion. It governs the registers of salvation and deliverance for the souls of the Nine Dark Realms of Eternal Night, and the records of rebirth, belonging to the Realm of Desire.\n\n**Luminous Harmonious Childlike Heaven** – Allotted to the Third Heaven of the Eastern Direction, the Heaven of Great Crimson, ruled by the Celestial Emperor of Grand Yang *qi*. The *qi* of this heaven is blue, transforming and giving rise to the House Mansion. It governs the registers of propagating teachings to deliver humankind, belonging to the Realm of Desire.\n\n**Mysterious Womb Nurturing Heaven** – Allotted to the Fourth Heaven of the Eastern Direction, the Heaven of Immeasurable Vastness, ruled by the Celestial Emperor of the First Green Yang *qi* of the Nine Heavens. The *qi* of this heaven is red, transforming and giving rise to the Rooftop Mansion. It governs the registers of summoning souls to enter immortality, belonging to the Realm of Desire.\n\n**Primordial Brightness Literary Eminence Heaven** – Allotted to the Fifth Heaven of the Eastern Direction, the Heaven of Immeasurable Longevity, ruled by the Celestial Emperor of the Second Cavernous Yang *qi* of the Nine Heavens. The *qi* of this heaven is dark green, transforming and giving rise to the Emptiness Mansion. It governs the registers of circulating primordial *qi* throughout the world, belonging to the Realm of Desire.\n\n**Upper Brightness Seven Luminaries Māyā Heaven** – Allotted to the Sixth Heaven of the Eastern Direction, ruled by the Celestial Emperor of Interpenetrating Yang *qi*. The *qi* of this heaven transforms and gives rise to the Woman Mansion. It governs the registers of opening and delivering those in hidden peril, belonging to the Realm of Desire.\n\n**Void Transcending Balance Heaven** – Allotted to the Seventh Heaven of the Eastern Direction, the Heaven of Tuṣita, ruled by the Celestial Emperor of Established Yang *qi*. The *qi* of this heaven is jade green, transforming and giving rise to the Ox Mansion. It governs the registers of the divine immortals of the stellar palaces of the Central Heaven, belonging to the Realm of Form.\n\n**Supreme Ultimate Veiled Heaven** – Allotted to the Eighth Heaven of the Eastern Direction, the Heaven of Joy Without Arrogance, ruled by the Celestial Emperor of Eastern Ultimate Yang *qi*. The *qi* of this heaven is purple, transforming and giving rise to the Dipper Mansion. It governs the registers of delivering and refining decayed remains, belonging to the Realm of Form.\n\n**Crimson Brightness Harmonious Yang Heaven** – Allotted to the First Heaven of the Southern Direction, the Heaven of Transforming Responsive Sounds, ruled by the Celestial Emperor of Initial Yang *qi*. The *qi* of this heaven is white, linked to the Brahma *qi* of the South. It governs the registers of refining immortals to achieve perfection, belonging to the Realm of Form.\n\n**Mysterious Brightness Reverent Splendor Heaven** – Allotted to the Second Heaven of the Southern Direction, the Heaven of Brahma Assistance, ruled by the Celestial Emperor of Intestinal Radiance *qi*. The *qi* of this heaven is yellow, transforming and giving rise to the Winnowing Basket Mansion. It governs the registers of all transformations of the myriad things, belonging to the Realm of Form.\n\n**Radiant Brightness Ancestral Whirlwind Heaven** – Allotted to the Third Heaven of the Southern Direction, the Heaven of No Love, ruled by the Celestial Emperor of Yang Radiance *qi*. The *qi* of this heaven is green, transforming and giving rise to the Tail Mansion. It governs the records of those who cultivate merit, conduct, and study to attain immortality, belonging to the Realm of Form.\n\n**Bamboo Grove August Gourd Heaven** – Allotted to the Fourth Heaven of the Southern Direction, the Heaven of Responding to Sorrow, ruled by the Celestial Emperor of Yang Brightness *qi*. The *qi* of this heaven is blue, transforming and giving rise to the Heart Mansion. It governs the registers of demon kings and those who study immortality, belonging to the Realm of Form.\n\n**Void Brightness Hall Luminance Heaven** – Allotted to the Fifth Heaven of the Southern Direction, the Heaven of Brahma Brilliance, ruled by the Celestial Emperor of Yang Evolution *qi*. The *qi* of this heaven is red, transforming and giving rise to the Chamber Mansion. It governs the registers of celestial and terrestrial immortals who have achieved success, belonging to the Realm of Form.\n\n**Observant Brightness Upright Tranquility Heaven** – Allotted to the Sixth Heaven of the Southern Direction, the Heaven of Māra’s Varied Thoughts, ruled by the Celestial Emperor of Yang Brightness *qi*. The *qi* of this heaven is dark green, transforming and giving rise to the Clan Mansion. It governs the registers of the names and forms of immortals, belonging to the Realm of Form.\n\n**Mysterious Brightness Reverent Celebration Heaven** – Allotted to the Seventh Heaven of the Southern Direction, the Heaven of Countless Joys, ruled by the Celestial Emperor of Vast Yang *qi*. The *qi* of this heaven is yellow, transforming and giving rise to the Neck Mansion. It governs the registers of those who have attained the Dao, belonging to the Realm of Form.\n\n**Great Radiance Ultimate Jade Heaven** – Allotted to the Eighth Heaven of the Southern Direction, the Heaven of Nurturing Growth, ruled by the Celestial Emperor of Ultimate Yang *qi*. The *qi* of this heaven is jade green, transforming and giving rise to the Horn Mansion. It governs the registers of teaching the Dao to immortals, belonging to the Realm of Form.\n\n**Primordial Support Ascending Aperture Heaven** – Allotted to the First Heaven of the Western Direction, the Heaven of Fragrant Glory, ruled by the Celestial Emperor of Lesser Yang *qi*. The *qi* of this heaven is purple, linked to the Brahma *qi* of the West. It governs the registers of delivering souls to rebirth, belonging to the Realm of Form.\n\n**Supreme Peaceful August Cliff Heaven** – Allotted to the Second Heaven of the Western Direction, the Heaven of Arriving Heads, ruled by the Celestial Emperor of Grand Yang *qi*. The *qi* of this heaven is white, transforming and giving rise to the Wings Mansion. It governs the registers of opening and delivering good people to ascend as immortals, belonging to the Realm of Form.\n\n**Manifest Stability Ultimate Wind Heaven** – Allotted to the Third Heaven of the Western Direction, the Heaven of Investigating Stability, ruled by the Celestial Emperor of Vast Yang *qi*. The *qi* of this heaven is yellow, transforming and giving rise to the Wings Mansion. It governs the registers of suffering souls and good spirits, belonging to the Realm of Form.\n\n**Initial August Filial Awn Heaven** – Allotted to the Fourth Heaven of the Western Direction, the Heaven of Akaniṣṭha, ruled by the Celestial Emperor of Cavernous Yin *qi*. The *qi* of this heaven is green, transforming and giving rise to the Spread Mansion. It governs the registers of the souls and ghosts of the Nine Dark Realms of Eternal Night, belonging to the Realm of Form.\n\n**Great August Visiting Double Floating Countenance Heaven** – Allotted to the Fifth Heaven of the Western Direction, the Heaven of Waves Entwining Separation, ruled by the Celestial Emperor of Interpenetrating Yin *qi*. The *qi* of this heaven is blue, transforming and giving rise to the Star Mansion. It governs the registers of summoning souls to gather perfection, belonging to the Realm of Form.\n\n**No-Thought River Origin Heaven** – Allotted to the Sixth Heaven of the Western Direction, the Heaven of Brahma Brilliance Primordial Yellow, ruled by the Celestial Emperor of Mysterious Yin *qi*. The *qi* of this heaven is red, transforming and giving rise to the Straddling Mansion. It governs the registers of opening and delivering the dead souls of Eternal Night, belonging to the Realm of Form.\n\n**Upper Plate Joyous Heaven** – Allotted to the Seventh Heaven of the Western Direction, the Heaven of Liberating Primordial Origins, ruled by the function of Vast Yin *qi*. The *qi* of this heaven is dark green, transforming and giving rise to the Ghost Mansion. It governs the registers of assessing the merit and conduct of heavenly beings, belonging to the Realm of Form.\n\n**Ultimate Non-Existence Dharma Vow Heaven** – Allotted to the Eighth Heaven of the Western Direction, the Heaven of Ālaya Thought, ruled by the Celestial Emperor of Ultimate Yin *qi*. The *qi* of this heaven transforms and gives rise to the Well Mansion. It governs the registers of all ranks of divine immortals, belonging to the Realm of Form.\n\n**Luminous Court Rosy Transcendence Heaven** – Allotted to the First Heaven of the Northern Direction, the Heaven of Responding Thought, ruled by the Celestial Emperor of Yin Generation *qi*. The *qi* of this heaven is linked to the Brahma *qi* of the North, its *qi* purple. It governs the registers of delivering perfected beings to ascend as immortals, belonging to the Realm of Form.\n\n**Abyssal Permeation Primordial Cavern Heaven** – Allotted to the Second Heaven of the Northern Direction, the Heaven of Radiant Flourishing People, ruled by the Celestial Emperor of Yin Transformation *qi*. The *qi* of this heaven is purple and gives rise to the *Shen* Mansion. It governs the registers of humans ascending to the ranks of heavenly beings, belonging to the Realm of Form.\n\n**Supreme Literary Splendor Marvelous Completion Heaven** – Allotted to the Third Heaven of the Northern Direction, the Heaven of Pearly Brilliance, ruled by the Celestial Emperor of Luminous Yin *qi*. The *qi* of this heaven is fish-white and gives rise to the *Zi* Mansion. It governs the registers of divine kings and ghostly records, belonging to the Formless Realm.\n\n**Great Simplicity Elegant Joy Forbidden Upper Heaven** – Allotted to the Fourth Heaven of the Northern Direction, the Heaven of Brahma-Encompassing Grand Summons, ruled by the Celestial Emperor of Cavernous Yin *qi*. The *qi* of this heaven is yellow and gives rise to the *Bi* Mansion. It governs the registers of demon kings and their ranks, belonging to the Formless Realm.\n\n**Great Void Supreme Eternal Fusion Heaven** – Allotted to the Fifth Heaven of the Northern Direction, the Heaven of Āneṇejya, ruled by the Celestial Emperor of Spirit Yin *qi*. The *qi* of this heaven is purple and gives rise to the *Xu* Mansion. It governs the registers of merit-recording and delivering humans to ascend as immortals, belonging to the Heaven of Seed People.\n\n**Supreme Release Jade Ascension Soaring Victory Heaven** – Allotted to the Sixth Heaven of the Northern Direction, the Heaven of Inclined Attainment, ruled by the Celestial Emperor of Yin-Soul *qi*. The *qi* of this heaven is blue-green and gives rise to the *Wei* Mansion. It governs the registers of immortal perfected beings and great sages, belonging to the Heaven of Seed People.\n\n**Dragon Transformation Brahma Attainment Heaven** – Allotted to the Seventh Heaven of the Northern Direction, the Heaven of Primordial Brahma Inclined Girdle Great Union, ruled by the Celestial Emperor of Yin Convergence *qi*. The *qi* of this heaven is red and gives rise to the *Lou* Mansion. It governs the registers of advancing immortals to achieve sagehood, belonging to the Heaven of Seed People.\n\n**Great Ultimate Level Nurturing Splendid Brilliance Heaven** – Allotted to the Eighth Heaven of the Northern Direction, the Heaven of Radiant Release Naturalness, ruled by the Celestial Emperor of Ultimate Yin *qi*. The *qi* of this heaven is blue-green and gives rise to the *Kui* Mansion. It governs the registers of immortal students’ names and meritorious deeds, belonging to the Heaven of Seed People.\n\nThe thirty-two heavens are now complete.\nAll offices govern the affairs of the Three Realms.\n\nThe Three Realms are known as the Realm of Desire, the Realm of Form, and the Formless Realm—collectively called the Three Realms. The lowest six heavens constitute the Realm of Desire. The middle nineteen heavens form the Realm of Form; these two realms are shaped by kalpas and molded by yin and yang, their *qi* subject to exhaustion. Above them lie three heavens comprising the Formless Realm. Mortals are bound by years, while beyond them exist four heavens of Seed People, extending upward to the Supreme Great Luo Heaven. All are woven from the *qi* of emptiness and purity, transformed and illuminated by the yang radiance, untouched by the transgressions of sun and moon. Beneath this heaven, darkness and light arise—all realms of the Three Purities and Great Luo, neither born nor destroyed, beyond the reckoning of kalpas and the reach of the ninety-six disasters of yang. This is the ultimate domain of the Dao, the realm where all sages gather in homage, the very root from which the Primordial True *Qi* gives rise to the ten thousand things.\n\n*The Ninth Scroll of the Dongyuan Collection is complete.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞渊集 经名：洞渊集。 宋李思聪集。 九卷。 底本出处：《正统道藏》太玄部。 进洞天海岳表 虔州大中祥符宫道士臣李思聪。 臣窃以琅函翠札、玉岌紫书，卷帐颇繁，寻译弥广。 粤若三清奥妙之典，焕乎《五岳真形之图》，古存闱苑之文，今有十洲之记。 真风绵邈，史氏弗论，历代英儒，罕留编录。 臣每因朝修之暇，焚灶之余，密扣幽微，辄排次序。 虽丹台厦远，紫府幽深，具载画图，豁如指掌。 使崇上之士，同赞国风，味道之流，上祝宸筹。 忝遇泰宁之运，式扬清净之风，博采仙图，久归上圣。 臣诚惶诚恐，顿首顿首。 恭惟体天法道钦文聪武神圣孝德皇帝陛下。 执祥符而御历，握金鉴以临民，道冠百王，德降千古。 尧云庇野，万汇昭苏； 舜日丽天，八弦和煦。 遂遣东夷南越之俗，稽颗归仁； 北胡西虏之民，倾心顺化，凡遭圣运，尽罄惟深。 切念臣幼年以来，苦心本教，每览前贤述作，道门异事，率多泛滥，罕究根源。 臣夙夜精心，讨寻经录，采摭事实，形於篇章，久历岁时，颇盈编轴。 今撰成《玉清纵极图》、《洞天五岳图》、《蓬壶闱苑图》、《大淇灵渍图》、《名山福地图》、《金液还丹图》。 幸逢昭代，不敢藏於，蜗室，辄思上达龙庭。 若得少经睿览，即臣生平苦辛，不为虚弃。 辄敢随表进呈，干犯冕旎，无任战汗忧兢、悚惕屏营之至。 臣诚惶诚惧，顿首顿首。 谨言。 宋皇佑元年十二月　日　虔州祥符 官道士臣李思聪状奏 乞进洞天海岳名山图状 虔州大中祥符宫道士李思聪。 右思聪，草野微躯，生逢昌运。 长遇无为之教，叨居有道之朝。 性愚罔究於仙书，智浅曷量於淇渤。 以思聪自明道元年，相次於道门秘典、列圣真诠，探迹幽微，精究妙本，撰成《玉虚游极图》，述虚无旋象之神化； 《洞天五岳图》，赞五岳仙山之灵境； 《蓬壶闱苑图》，颂蓬岛十洲之胜盘； 《大淇灵渍图》，序龙宫海读之奥妙； 《名山福地图》，吟紫府丹台之秘景； 《金液还丹图》，集神仙之火候； 其图广大，虑烦寻绎，又别纂集《卧披图》一十轴，并已了毕。 念以思聪采摭事实，刻苦弥年，柢愿美赞於皇猷，岂敢叨求於帝渥。 今遇乾元节将近，拟乞以前件图子陆本，并《卧披图》一十轴，具状通纳，乞与进呈者。 右具如前。 所据道士李思聪状，陈述前项外，臣良肱与当州众官，体访得道士李思聪，潜精道行，积思仙书，岁纪浸深，功劳备着。 蓬山洞府之咏，玉清游极之言，纂为画图，赞之诗序。 英辞昭灼，妙格清新，宜备睿观，以畅真教。 况乾元庆旦，方贡盈庭，惟妙本於高仙，愿同符於圣筹。 傥随旅币，得观凝旎，倾切之心，庶获闻达。 其《玉清游极》等图，各有诗序，命辞措意，实有可采。 当州见今收掌，未敢进呈。 伏候勃旨。",
      "translated_text": "**Preface to the Presentation of *Dongtian Haiyue* (Cavern-Heavens, Seas, and Sacred Mountains)**\n\n*Dongyuan Ji* (Collected Works of the Cavern Abyss)\nCompiled by Li Sicong of the Song Dynasty\nNine fascicles\nSource edition: *Zhengtong Daozang*, Tai Xuan Section\n\n**Memorial Presenting *Dongtian Haiyue Tu* (Charts of Cavern-Heavens, Seas, and Sacred Mountains)**\nYour subject, Daoist Li Sicong of the Dazhong Xiangfu Abbey in Qianzhou, humbly submits:\n\nI observe that the jade tablets and purple scriptures of the Dao, though bound in emerald cases and vermilion seals, have grown vast in their scrolls and boundless in their translations. Consider the profound and wondrous canons of the Three Clarities, or the radiant *Chart of the True Forms of the Five Peaks*—ancient texts once preserved in the gardens of the immortals, now matched by the *Records of the Ten Isles*. The true wind of the Dao stretches far and wide, yet historians have seldom discussed it, and scholars of past dynasties have rarely compiled its records.\n\nIn the intervals of court rituals and the remnants of incense offerings, I have secretly probed its mysteries and arranged its order. Though the cinnabar terraces lie distant and the Purple Courts remain secluded, all are depicted in these charts, as clear as pointing to the palm of one’s hand. May those who revere the highest realms join in praising the imperial virtue, and may those who savor the Dao offer blessings to the celestial designs.\n\nBy the grace of this era of grand tranquility, I have striven to propagate the pure wind of the Dao, gathering the charts of immortals to present to the sagely throne. With awe and trepidation, I bow my head again and again.\n\nI reverently reflect upon Your Majesty, the Emperor who embodies Heaven, models the Dao, and reveres culture, wisdom, divinity, and filial virtue. Grasping the Auspicious Talisman, You govern the realm; wielding the Golden Mirror, You oversee the people. Your Dao surpasses that of a hundred kings, and Your virtue descends through a thousand ages. Like the clouds of Yao sheltering the fields, all things revive; like the sun of Shun illuminating the heavens, the eight directions bask in harmony. Thus, the customs of the eastern Yi and southern Yue bow in reverence, while the northern Hu and western Rong submit in sincerity. All who encounter this sagely reign are utterly devoted.\n\nI have, since my youth, devoted myself to the foundational teachings, yet upon examining the works of former worthies, I found the accounts of Daoist marvels often scattered and their roots seldom explored. Day and night, I have concentrated my mind, searching through scriptures and records, gathering facts and shaping them into chapters. Over the years, these efforts have filled many scrolls. Now, I have compiled the *Chart of the Jade Clarity’s Ultimate Journey*, the *Chart of the Five Peaks of the Cavern-Heavens*, the *Chart of Penglai and the Celestial Gardens*, the *Chart of the Great Qi’s Numinous Tides*, the *Chart of Famous Mountains and Blessed Lands*, and the *Chart of Golden Liquor and the Returned Elixir*. Fortunate to live in this enlightened age, I dare not conceal these works in my humble abode but aspire to present them at the dragon court. Should they merit even a glance from Your Sagely Perusal, my lifelong toil would not have been in vain.\n\nI now take the liberty of submitting them with this memorial, though I tremble at the presumption of approaching the imperial gaze. I am overwhelmed with fear and trembling, prostrate and anxious.\n\nWith utmost awe and reverence, I bow my head again and again.\n\nRespectfully submitted.\nFirst day of the twelfth month, first year of Huangyou, Song Dynasty\nLi Sicong, Daoist of the Xiangfu Abbey in Qianzhou\n\n---\n\n**Memorial Requesting the Presentation of *Dongtian Haiyue Mingshan Tu* (Charts of Cavern-Heavens, Seas, and Sacred Mountains)**\nLi Sicong, Daoist of the Dazhong Xiangfu Abbey in Qianzhou.\n\nYour subject, Li Sicong, a humble figure from the wilds, was born in an era of prosperity. I have long encountered the teachings of non-action and now serve in this court of the Dao. My nature is dull and unsuited to fathoming the scriptures of immortals; my wisdom is shallow and unequal to measuring the depths of the Qi and the seas.\n\nSince the first year of Mingdao, I have delved into the secret canons of the Daoist gate and the true teachings of the sagely lineage, exploring their hidden traces and refining their wondrous essence. I have compiled the *Chart of the Jade Void’s Ultimate Journey*, depicting the divine transformations of the formless and revolving images; the *Chart of the Five Peaks of the Cavern-Heavens*, extolling the numinous realms of the sacred mountains; the *Chart of Penglai and the Celestial Gardens*, celebrating the splendor of the Peng Island and Ten Isles; the *Chart of the Great Qi’s Numinous Tides*, expounding the mysteries of the dragon palaces and sea scriptures; the *Chart of Famous Mountains and Blessed Lands*, chanting the secret scenes of the Purple Courts and cinnabar terraces; and the *Chart of Golden Liquor and the Returned Elixir*, assembling the fire phases of the immortals. Fearing the vastness of these charts might burden the reader, I have also separately compiled the *Scrolls for Casual Perusal*, totaling ten scrolls, all now complete.\n\nI have gathered these facts through years of arduous effort, my sole wish being to praise the imperial way. I dare not seek undue imperial favor. Now, as the Qian Yuan Festival approaches, I humbly request permission to submit these charts in six copies, along with the ten scrolls of the *Scrolls for Casual Perusal*, for presentation to the throne.\n\nAs stated above.\n\nRegarding the memorial of Daoist Li Sicong, beyond the aforementioned matters, I, Liang Gong, along with the officials of this prefecture, have investigated and confirmed that Daoist Li Sicong has long cultivated his Daoist practice and immersed himself in the scriptures of immortals. Over the years, his diligence and contributions have become increasingly evident. His verses on the grotto-heavens of Peng Mountain and the journeys of the Jade Clarity, compiled into charts and accompanied by poems and prefaces, shine with brilliant diction and a refined, fresh style. They are worthy of imperial perusal to invigorate the true teachings. Moreover, as the Qian Yuan Festival nears and tribute fills the court, we wish to present these wondrous works of the lofty immortals, hoping they may align with the sagely designs. Should they be included among the offerings and grace the imperial gaze, our earnest hopes would be fulfilled.\n\nThe *Charts of the Jade Clarity’s Ultimate Journey* and others each include poems and prefaces, their words and intentions truly admirable. These charts are currently in the custody of this prefecture, awaiting imperial decree before daring to present them.\n\nAwaiting Your Majesty’s command.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1064,
      "start_sentence": 0,
      "end_sentence": 53,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.13251328468323,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "中书刘子付昭信军 虔州奏大中祥符宫道士李思聪状，自明道元年，相次於道门秘典、列圣真诠，采迹幽微，精穷妙本。 撰成《玉清游极图》，述虚无游象之神化； 《洞天五岳图》，赞五岳仙山之灵境； 《蓬壶阅苑图》，颂蓬岛十洲之胜盘； 《大瞑灵读图》，着龙宫海渍之奥妙； 《名山福地图》，吟紫府丹台之秘典； 《金液还丹图》，集神仙之火候。 图子六面，并《卧披图》一十轴，乞与进呈。 当州众官看详实可采，其图见在本州收掌，未敢上进。 伏候劲旨。 右奉圣旨：宜令虔州入递进呈。 付虔州。 准此。 皇佑二年三月二十七日。 洞渊集卷之一 冲妙先生李思聪集 三界咏序 夫三界咏者，应三才也。 列八十一章者，应九九之数也。 玉清咏赞三清旋象之神化，洞天咏着五岳洞天之胜盘，海山咏述蓬壶板苑之仙景，三才备矣，九数生焉。 昔希夷先生着指玄篇，言修身养黑之妙理，臣今昤三界，咏述虚无洞天海岛之奥区，今古异同，各言其志，并按仙经宝录凤蕴霄书，备究根源，非敢臆说，退暂肤浅妄扣渊微，柢期傅修真羽服之流，岂敢示英辞学林之士，味道君子同畅真风，时宋皇佑二年上元日序。 三清咏叙叙三清传降经镰事迹 元始天尊者，即天地之精，极道之祖黑也。 本生乎自然，消即为黑，息即为神。 不始不终，永存绵绵。 居上境为万天之元，居中境为万化之根，居下境为万帝之尊。 无名可宗，故曰天尊，始世人天矣。 不可以理测，不可以言荃，生万物而不宰，化万类而不言，至尊至极，乃曰天尊。 居玉清圣境清微天官焉。 玉晨道君者，乃大道之化身也。 言其有不可以随迎，谓其无复存乎恍惚。 所以不有而有，不无而无，视之无象，听之无声，於妙有妙无之问，大道存焉。 道君即审道之本，洞道之元，为道之黑，即师事元始天尊，称受道弟子焉，犹是老君禀而师之矣。 居上清真境，禹余天中降金科宝录三洞仙经，付经师郁罗翘真人传教於万国焉。 混元老君者，乃元黑之祖宗，天地之根本也。 历劫行化代代为师，或在九天，或游四海，．不可无师教，不可无主。 立乃师事玉晨道君，称受道弟子焉。 或降太微勾陈六星中即号曰天皇大帝曜魄宝至周降生，孔子尝曰：老聪者，吾之师也，而问礼焉，仰之如犹龙。 自开辟以来，五十余度降见，西度流沙，下化中国，为三教宗师，作百王轨范。 千古行道，神变无方。 居太清仙境太赤天中焉。 紫微北极五灵帝君者，位居中天紫微，垣为万象宗师，众星拱之焉。 昔龙汉元年，为北阴邓都罗山，六洞鬼神妖魔，出行人问，杀害生人，尤甚莫能制御。 上帝召北帝，统神将天兵，驱荡氛邪，救护兆庶，功成升帝入中天，自然总极紫微之位。 七真曰：我祖师北极历劫已来，勤苦香灯，供养三清，功满德备，而升入紫微帝位，出入常有华盖相随，星光七宝灿烂。 上彻诸天，下照万国，每月二十七日下降，察世人罪福焉。 《度人经》者，即元始天尊在始青天中演四方元始真文，五帝魔王名讳，诸天内音之辞，真文奥妙非世常辞，诸天大圣所秘於紫微之宫。 上帝悯天地阴阳有劫坏之数，救地狱有五苦八难之魂。 诸天神仙乞演灵音，救度兆庶，上消天灾，下禳毒害，安镇国祚保天长存，斯经尊妙，为万道之宗焉。",
      "translated_text": "From the Secretariat, Liu Zifu transmits to the昭信军: A memorial from Vanzhou Prefecture reports on Daoist Li Sicong of the Dazhong Xiangfu Abbey. Since the first year of the Mingdao era, he has successively delved into the esoteric canons of the Daoist gate and the true transmissions of successive sages, tracing subtle traces and exhaustively exploring their wondrous origins. He has compiled:\n\n*The Charts of the Jade Clarity’s Ultimate Journey*, expounding the divine transformations of wandering in emptiness;\n*The Charts of the Five Marchmounts and Grotto-Heavens*, extolling the numinous realms of the Five Marchmounts and immortal mountains;\n*The Charts of Penglai and the Yuanyuan Gardens*, praising the sublime vistas of the Penglai Isles and the Ten Continent-Isles;\n*The Charts of the Great Darkness and the Numinous Scriptures*, revealing the profound mysteries of the Dragon Palace and the oceanic depths;\n*The Charts of Famous Mountains and Blessed Lands*, chanting the esoteric canons of the Purple Palace and the Cinnabar Terraces;\n*The Charts of the Golden Liquor and the Returned Elixir*, assembling the alchemical *huohou* of the divine immortals.\n\nSix sets of charts, along with ten scrolls of *The Reclining Figure*, are hereby requested for presentation. The officials of this prefecture have examined them and find them truly worthy of selection. The charts are currently in the custody of this prefecture, awaiting imperial decree before daring to present them. We humbly await your command.\n\nBy imperial edict: Vanzhou Prefecture is ordered to transmit and present them. Transmitted to Vanzhou. As directed.\n\nTwenty-seventh day of the third month, second year of the Huangyou era.\n\n*Anthology of the Abyssal Depths*, Scroll One\n*Collected Works of Master Chongmiao Li Sicong*\n\n**Preface to the *Odes of the Three Realms***\nThe *Odes of the Three Realms* correspond to the Three Powers. Their eighty-one chapters correspond to the number nine squared. The *Odes of the Jade Clarity* praise the divine transformations of the Three Clarities’ revolving images; the *Odes of the Grotto-Heavens* depict the sublime vistas of the Five Marchmounts and grotto-heavens; the *Odes of the Sea and Mountains* describe the immortal landscapes of Penglai and the Yuanyuan Gardens. Thus the Three Powers are complete, and the ninefold numbers arise.\n\nFormerly, Master Xiyi composed the *Pointers to the Mysterious*, expounding the wondrous principles of cultivating the body and nurturing the *qi*. Now, in my *Odes of the Three Realms*, I chant the profound regions of emptiness, grotto-heavens, and island-paradises. Though ancient and modern differ, each speaks its intent. All are based on the immortal scriptures, treasure records, and phoenix-enfolded celestial texts, thoroughly investigating their root sources. I dare not indulge in idle speculation, lest I rashly and superficially probe the abyssal depths. My sole hope is to transmit these to those who cultivate the true and don the feathered robes of immortality. How could I presume to display them to scholars of refined diction or gentlemen who savor the Dao? May they together invigorate the true wind.\n\nWritten on the Shangyuan Festival, second year of the Huangyou era of the Song.\n\n**Preface to the *Odes of the Three Clarities***\nThe *Odes of the Three Clarities* narrate the transmission and descent of the scriptures and precepts of the Three Clarities.\n\nThe Celestial Venerable of Original Beginning is the essence of Heaven and Earth, the primal ancestor of the ultimate Dao. Born of spontaneity, when it disperses, it becomes *qi*; when it rests, it becomes spirit. Without beginning or end, it eternally abides. Dwelling in the Upper Realm, it is the origin of the myriad heavens; in the Middle Realm, the root of the myriad transformations; in the Lower Realm, the sovereign of the myriad emperors. Without a name to revere, it is called the Celestial Venerable, initiating the worlds of humans and gods. It cannot be fathomed by reason or grasped by words. It engenders the myriad things yet does not govern them; it transforms the myriad kinds yet does not speak. Utmost in honor and supremacy, it is called the Celestial Venerable. It resides in the Jade Clarity’s sacred realm, the Celestial Palace of Subtle Radiance.\n\nThe Jade Morning Dao Lord is the incarnate transformation of the great Dao. To speak of its presence is impossible to pursue; to speak of its absence is to still acknowledge its evanescence. Thus, it is neither existent nor non-existent, neither present nor absent. Gazing upon it, no form is seen; listening to it, no sound is heard. Within the interplay of wondrous being and wondrous non-being, the great Dao abides. The Dao Lord is the root of discerning the Dao, the origin of penetrating the Dao, the *qi* of the Dao. As a disciple receiving the Dao, he serves the Celestial Venerable of Original Beginning, just as the Old Lord received and served him. He dwells in the Upper Clarity’s true realm, the Heaven of Yu Remnant, where he descended with the golden regulations, treasure records, and Three Grotto scriptures, entrusting them to the scripture master, the Perfected Yu Luoqiao, to transmit the teachings to the myriad lands.\n\nThe Venerable Lord of Primordial Simplicity is the ancestral founder of primordial *qi*, the root of Heaven and Earth. Across kalpas, he has acted as teacher, transforming through successive eras. At times in the Nine Heavens, at times wandering the Four Seas, there is no teaching without a master, no realm without a sovereign. He serves the Jade Morning Dao Lord as a disciple receiving the Dao. At times, descending among the Six Stars of the Celestial Hook and Celestial Enclosure in the Grand Tenuity, he is called the Celestial August Emperor, the Radiant Soul Treasure. In the Zhou dynasty, he was born, and Confucius once said: \"The Old Master is my teacher,\" and inquired of him about ritual, gazing up to him as to a soaring dragon. Since the beginning of creation, he has descended over fifty times, crossing the Western Flowing Sands to transform China, serving as the patriarch of the Three Teachings and the model for a hundred kings. Through millennia, he has practiced the Dao, his divine transformations boundless. He resides in the Grand Clarity’s immortal realm, the Heaven of Great Vermilion.\n\nThe Five Numinous Lords of the Purple Tenuity’s Northern Culmen hold the central position in the Purple Tenuity Enclosure of the Middle Heaven, serving as the ancestral masters of the myriad images, around whom the host of stars revolves. In the first kalpa of the Dragon Han era, at the Northern Darkness’s Dengdu Luoshan, the demonic spirits of the six grotto-heavens emerged among humanity, slaughtering and harming people beyond measure, with none able to restrain them. The Celestial Emperor summoned the Northern Emperor, who led divine generals and heavenly troops to expel the baleful influences and rescue the multitudes. Upon completing his task, he ascended as emperor to the Middle Heaven, naturally assuming the supreme position of the Purple Tenuity.\n\nThe Seven Perfected Ones said: \"Our ancestral master, the Northern Culmen, has across kalpas diligently offered incense and lamps, making offerings to the Three Clarities. With merit complete and virtue perfected, he ascended to the imperial position of the Purple Tenuity. His comings and goings are ever accompanied by a flowery canopy, resplendent with the seven treasures’ starlight. Above, it reaches the myriad heavens; below, it illuminates the myriad lands. On the twenty-seventh day of each month, he descends to examine the sins and blessings of the world.\"\n\n*The Scripture of Salvation* was expounded by the Celestial Venerable of Original Beginning in the Primordial Azure Heaven, proclaiming the true texts of the Four Directions’ Original Beginning, the secret names of the Five Thearchs and Demon Kings, and the inner sounds of the myriad heavens—words of profound mystery, not of the mundane world, concealed by the myriad heavens’ great sages in the Purple Tenuity’s palace. The Celestial Emperor, pitying that Heaven and Earth’s yin and yang have a destined number of kalpic destructions, and that the hells contain souls suffering the Five Torments and Eight Difficulties, entreated the celestial deities and immortals to expound the numinous sounds to save the multitudes. Above, it dispels celestial disasters; below, it wards off poisonous harms, pacifying and securing the dynastic fortune to preserve Heaven’s eternal endurance. This scripture is revered and wondrous, the ancestral founder of the myriad Daoist teachings.",
      "overlap_context": "sent these wondrous works of the lofty immortals, hoping they may align with the sagely designs. Should they be included among the offerings and grace the imperial gaze, our earnest hopes would be fulfilled.\n\nThe *Charts of the Jade Clarity’s Ultimate Journey* and others each include poems and prefaces, their words and intentions truly admirable. These charts are currently in the custody of this prefecture, awaiting imperial decree before daring to present them.\n\nAwaiting Your Majesty’s command.",
      "start_char": 1065,
      "end_char": 2324,
      "start_sentence": 54,
      "end_sentence": 103,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.17436695098877,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "《黄庭经》者，即玉晨道君在上清真境紫微上官药珠阙内而作。 是经皆罗列一神室，处胎神之所在耳，乃真人不死之道焉。 一名太上琴心文，一名太帝金书，一名东华玉篇。 东海青童君，众仙皆以白玉为版，黄金刻书，日夕朝拜天地，然后师授旸谷神王，传紫虚元君魏夫人，因传於世矣。 《道德经》者，即混元老君在太清天中所着焉。 昔虞舜在宥以孝悌治民，感老君下降，称尹寿子以五千文，．授舜悟希夷之妙，退身禅位，隐于苍梧之野。 斯文秘之不传於世，至周昭王时，老君西度流沙。 尹喜为关令，占见紫黑浮天，状若龙蛇之质，知有圣人度关，扫街斋肃以俟真游。 果遇老君，沥恳拜伏，乞救腐尸朽骨，愿赐秘言。 老君悯其哀苦，乃驻驾重演此五千言，并亲注号曰：节解。 又河上公为汉文帝分为《道》《德》二经，列八十一章，用留於世矣。 《清静经》者，即老君之秘言也。 太极左仙公葛玄曰：此经上天所宝，不传下士，吾昔授之於东华帝君。 东华帝君授之於金阙帝君，金阙帝君授之於西王母，皆秘语相传不死之文。 上士悟之升为天官，中士得之南宫列仙，下士受之在世长年。 游行三界，升入金门矣。 《阴符经》者，即玄女授黄帝三百言。 上百言有神仙抱一之道，中百言有富国安民之法，下百言有强兵战胜之术。 黄帝得之，而升云汉。 阴者，暗也。 符者，合也。 天机暗合於事机，故曰：阴符也。 上清宝录者，是九天三景宝文妙道。 极真之黑，出於大罗。 玉京上馆玉皇所秘，众圣所尊，封於瑶台，位升高仙，有金阙玉名者，皆得佩带，朝谒上清，此文生於元始之先，结飞玄之黑，以玉字焕曜太空，万灵尊奉。 高上玉皇传太微，天帝传上清，得道之圣因小有天王，王真人传紫虚元君魏夫人，夫人传茅山杨司命许长史，后下降於世焉。 《灵宝仙筹经》者，是九黑之精结成而文。 光明焕赫，上彻九天之威，下灭六天之凶。 上帝至秘非名刻金简玉书者，不得辄窥此文。 道君传太微天帝，天帝传金阙后圣帝，后圣帝传青童君，青童君传得道之真因太极真人，徐来勒传葛仙公，后留於世矣。 《正一盟威录》者，以后汉时玉晨道君，乘五云绿耕，仪卫甚整，降鹤呜，山告天师张道陵曰：吾见下界鬼魔混杂，人事不分，生民夭伤，赐汝正一法录＝一卷，神剑二张，可为吾斩灭妖凶，返邪归正，和天转地，保国宁家，功成之后，升汝归无何之乡。 天师票命入西川行化，降二鬼师王长、赵升二人於门下，指使夺二十四鬼狱为二十四福庭，分别昼夜，禁誓鬼神，使宇宙清宁，民保遐寿。 以后，汉桓帝时，白日腾书，位为正一真人。 法录留传，自兹而始。 《道教金科玉律》者，以汉安二年正月十五夜半时，玉晨道君降九龙玉舆，威仪甚整，褊满空界，清歌引咏，去地万仞，徘徊不下。 天师剖心仰望，乃见道君告真人曰：昔使汝西蜀降鬼，不候天符，擅兴雷雨。 役使吏兵，失常过度。 驱驰星斗，昏乱日月。",
      "translated_text": "The *Huangting Jing* was composed by the Jade Dawn Dao Lord within the Purple Tenuity’s Upper Palace, the Jeweled Tower of the Upper Clarity’s true realm. This scripture arrays the chambers of the gods, revealing the dwelling of the womb spirits—it is the Way of the Perfected’s immortality. It is also called the *Supreme Zither-Heart Text*, the *Golden Writ of the Great Thearch*, and the *Jade Chapters of the Eastern Flower*. The Azure Lad of the Eastern Sea, along with the host of immortals, inscribed it upon white jade tablets in golden characters. Morning and evening, they paid homage to Heaven and Earth before the Divine King of Yang Valley transmitted it to the Purple Void Primordial Lady, Lady Wei, who then passed it into the world.\n\nThe *Daode Jing* was written by the Primal Venerable Lord in the Great Clarity Heaven. Long ago, when Emperor Shun governed with filial piety and fraternal duty, the Venerable Lord descended, styling himself Master Yin Shou, and bestowed upon Shun the Five Thousand Characters. Shun awakened to the subtleties of the formless and soundless, abdicated his throne, and withdrew into the wilderness of Cangwu. This text was kept secret and not transmitted until the reign of King Zhao of Zhou, when the Venerable Lord crossed the Flowing Sands to the west. Yin Xi, then magistrate of the pass, observed purple and black vapors coiling in the sky like dragons and serpents. Knowing a sage would cross the pass, he swept the streets and purified himself in anticipation. When he encountered the Venerable Lord, he prostrated himself in earnest supplication, begging to rescue his rotting corpse and withered bones and entreating the gift of secret teachings. Moved by his anguish, the Venerable Lord halted his chariot and expounded the Five Thousand Characters anew, personally annotating it as *Sectional Exegesis*. Later, the River Earl presented it to Emperor Wen of Han, dividing it into the two scriptures of *Dao* and *Virtue*, arranged into eighty-one chapters, to be preserved in the world.\n\nThe *Qingjing Jing* is the Venerable Lord’s secret discourse. The Left Immortal Duke of the Supreme Ultimate, Ge Xuan, said: \"This scripture is treasured in the heavens and not transmitted to lesser scholars. I once received it from the Eastern Flower Thearch. The Eastern Flower Thearch transmitted it to the Golden Portal Thearch, who passed it to the Queen Mother of the West. All conveyed it as a secret text of immortality. Superior scholars who awaken to it ascend as celestial officials; middling scholars attain it as immortals of the Southern Palace; and lesser scholars who receive it enjoy long life in the world. Roaming the Three Realms, they ascend into the Golden Gate.\"\n\nThe *Yinfu Jing* consists of three hundred words bestowed by the Dark Lady upon the Yellow Thearch. The first hundred contain the Way of embracing the One for immortality; the middle hundred hold the methods for enriching the state and pacifying the people; and the last hundred encompass the arts of strengthening the army and securing victory. The Yellow Thearch obtained it and ascended into the Cloud Han. *Yin* means \"hidden,\" and *fu* means \"accord.\" The celestial mechanism accords with the workings of affairs—hence it is called the *Yinfu Jing*.\n\nThe *Upper Clarity’s Precious Record* is the wondrous Way of the Three Luminaries’ Nine Heavens’ precious writ. Its ultimate truth emerges from the Great Veil. The Jade Capital’s Upper Palace, where the Jade Thearch conceals it, is revered by all sages. Sealed within the Jasper Terrace, those who ascend as lofty immortals and bear names inscribed in the Golden Portal may all wear and bear it, paying homage to the Upper Clarity. This text arose before the Primordial Beginning, weaving the darkness of soaring mystery, its jade characters illuminating the vast firmament, venerated by the myriad spirits. The Supreme Jade Thearch transmitted it to the Grand Tenuity; the Heavenly Thearch transmitted it to the Upper Clarity. The perfected saints who attained the Way received it from the King of Lesser Existence Heaven, who passed it to the Perfected Lord Wang of the Purple Void, Lady Wei. Lady Wei transmitted it to Yang Siming and the Archivist Xu of Mount Mao, who later brought it into the world.\n\nThe *Lingbao Immortal Ledger Scripture* is the text formed from the essence of the Nine Darknesses. Its radiance blazes brilliantly, ascending to the might of the Nine Heavens above and extinguishing the malevolence of the Six Heavens below. This most secret treasure of the Thearch is not casually glimpsed by those whose names are not inscribed on golden tablets or jade writs. The Dao Lord transmitted it to the Heavenly Thearch of the Grand Tenuity; the Heavenly Thearch transmitted it to the Posterior Sage Thearch of the Golden Portal; the Posterior Sage Thearch transmitted it to the Azure Lad, who passed it to the perfected saints who attained the Way. Xu Laile transmitted it to Immortal Duke Ge, and it was later preserved in the world.\n\nThe *Zhengyi Mengwei Record* originated when, during the Later Han, the Jade Dawn Dao Lord descended in a five-colored cloud chariot, his retinue impeccably arrayed. Alighting upon Mount Crane’s Cry, he addressed Celestial Master Zhang Daoling: \"I see the lower realm overrun with demons and ghosts, human affairs in disarray, and the people suffering premature death. I bestow upon you the *Orthodox Unity Register*—one scroll—and two divine swords. You shall eradicate malevolent spirits, return the perverse to rectitude, harmonize Heaven and invert Earth, and safeguard the state and secure the household. Upon accomplishing this, you shall ascend to the Land of No-Where.\" The Celestial Master received his mandate and entered the Western Marchmounts to enact his transformation. He subdued the two demon masters, Wang Chang and Zhao Sheng, as his disciples, converting the Twenty-Four Demon Prisons into Twenty-Four Blessed Courts. Distinguishing day from night, he bound the spirits by oath, ensuring the cosmos’ purity and tranquility and the people’s long life. Thereafter, during the reign of Emperor Huan of Han, he ascended in broad daylight, his rank established as Perfected of Orthodox Unity. The transmission of the register began from this point.\n\nThe *Daoist Golden Regulations and Jade Precepts* recount that in the second year of Han’an, on the fifteenth night of the first month at midnight, the Jade Dawn Dao Lord descended in a nine-dragon jade chariot, his majesty resplendent, filling the firmament. Celestial hymns resounded as he hovered ten thousand *ren* above the earth, circling without descending. The Celestial Master rent his heart in reverent gaze and beheld the Dao Lord admonishing the Perfected: \"Formerly, I dispatched you to the Western Marchmounts to subdue demons, but you did not await the celestial tally, arbitrarily summoning thunder and rain. You overtaxed your officers and soldiers, exceeding proper bounds. You drove the stars and constellations, throwing the sun and moon into chaos.\"",
      "overlap_context": " yin and yang have a destined number of kalpic destructions, and that the hells contain souls suffering the Five Torments and Eight Difficulties, entreated the celestial deities and immortals to expound the numinous sounds to save the multitudes. Above, it dispels celestial disasters; below, it wards off poisonous harms, pacifying and securing the dynastic fortune to preserve Heaven’s eternal endurance. This scripture is revered and wondrous, the ancestral founder of the myriad Daoist teachings.",
      "start_char": 2325,
      "end_char": 3462,
      "start_sentence": 104,
      "end_sentence": 141,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.47940397262573,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "上惊天府，下怖阴司。 杀黑盈空，邪光遍体。 今上帝责汝之过，录子罪名，吾不得近汝矣。 天师悲告，乞死驾前，愿垂救拔。 道君悯之，乃遣功曹使者，开紫阳玉岌，出素书三卷，题云：玉律金科谢罪灭除黑簿救拔九祖仪式。 天师禀命，退居鹤呜山，道靖依科醮谢万灵，功彻诸天，白日升晨，位为三天，扶教大法师。 斋醮玉律金科留传，自兹而始。 玄都玉京山，周回九万里，即阳华精黑凝结而生，无根而立，据空而停在无极大罗天中焉。 山有七宝城阙，光灿诸天，其山上广下狭，状若昆仑，傍有十二天自然阳黑化生，周远，·其下，复有七宝，骞林弥覆，八天周列。 八行乃八方神仙受事之径，花叶之上，皆玄黑化生，凤篆龙章，诸天内音之文，道德希夷之句。 众圣昤咏，难可寻详灵风振之钧天泛空即虚皇上帝所都。 万圣朝轩，为极道之城，高仙之玄都焉。 邓都罗山者，在北方，癸地为鬼户，死黑之根，山高二千六百里，周回三万里，其山有洞宫，皆鬼神之都。 山内外各有十二宫，合为二十四阴宫。 主考罚罪魂之所。 其三官、九府、二十四狱。 冥官鬼神主黑簿之司，皆浊黑凝滞为地之根，阴黑之主，乃九地枢机焉。 山林草木，皆禀毒恶之黑。 所生为锋刃烁空，黑烟蒙勃，昼夜不停，中有执罚神兵，常考理罪魂。 皆三元八节之日，北帝冥官引出历劫穷魂，责问罪衅端由、州县乡土，坟墓所在，居住年代去处。 或罪法深重，天未原赦者，即流殃见世子孙，灾难自此而生。 乃北帝君统御鬼官镇此山，其中皆结黄精之黑而成官阙，官吏皆是古之帝王。 忠臣孝子有功者，即为冥官，皆黄衣素丹绣服。 常以七月七日，校定世人善恶，黑簿罪名上奏天府，尘心不得警悟追导祖宗矣。 地官品秩，各有等差焉。 洞渊集卷之一竟 洞渊集卷之二",
      "translated_text": "The transgression shook the Celestial Courts above and terrified the Nether Bureaus below. Blackness filled the sky, and baleful radiance suffused his form. Now the Supreme Emperor holds you accountable for your faults, records your offenses, and I can no longer draw near to you.\n\nThe Celestial Master, grief-stricken, prostrated himself and begged for death before the Dao Lord’s chariot, pleading for deliverance. Moved by his contrition, the Dao Lord dispatched a Merit Clerk Messenger to open the Purple Yang Jade Summit, from which three scrolls of plain script emerged, inscribed: *Jade Regulations and Golden Precepts: Rites for Atonement, Erasure of Black Registers, and Salvation of the Nine Ancestors*. The Celestial Master received the mandate and withdrew to Mount Crane’s Call, where he purified himself and performed the prescribed jiao rites to petition the myriad spirits. His merit ascended through the heavens, and in broad daylight, he rose to the Celestial Dawn, attaining the rank of the Three Heavens’ Great Dharma Master and Upholder of the Teachings. The transmission of the *Jade Regulations and Golden Precepts for Fasting and Jiao Rites* began from this point.\n\nThe Jade Capital Mountain of the Mysterious Metropolis spans ninety thousand *li* in circumference. It coalesced from the congealed essence of Yang radiance, standing rootless and suspended in the Infinite Great Luo Heaven. The mountain’s seven-jeweled palaces and towers gleam across the heavens, its form broad above and narrow below, resembling Kunlun. Along its flanks, twelve celestial realms arise naturally from Yang essence, their expanse boundless. Below, seven-jeweled forests spread in luxuriant cover, encircled by the Eight Heavens. The Eight Paths serve as the avenues where immortals of the eight directions receive their duties. Upon the petals and leaves, all things are born of Mysterious Essence, inscribed with phoenix scripts and dragon sigils—the sacred texts of the inner heavens, the verses of the Dao and the Inaudible. The hymns of the host of sages defy full comprehension, while divine winds stir the celestial music of the Grand Void, the abode of the August Emperor of the Primordial Void. Myriad sages attend his court, for this is the City of the Ultimate Dao, the Mysterious Metropolis of the Loftiest Immortals.\n\nThe Fengdu Luoshan lies in the north, in the *gui* region, the gateway of ghosts and the root of deathly essence. The mountain rises two thousand six hundred *li* high, with a circumference of thirty thousand *li*. Within it lies a cavern palace, the capital of ghosts and spirits. The mountain’s interior and exterior each contain twelve palaces, together forming the Twenty-Four Yin Palaces, where the judgment and punishment of sinful souls take place. The Three Offices, Nine Bureaus, and Twenty-Four Prisons—along with the nether officials and ghostly administrators who oversee the Black Registers—are all formed from turbid, congealed essence, the foundation of the earth and the sovereign of Yin. They constitute the pivot of the Nine Earths. The forests and grasses here are imbued with venomous, malevolent essence. What grows here are blades that flash like lightning, while black smoke billows ceaselessly day and night. Within, punitive divine soldiers constantly interrogate and discipline sinful souls.\n\nOn the days of the Three Primes and Eight Festivals, the Northern Emperor and the nether officials summon forth souls exhausted by kalpas of suffering, demanding an account of their transgressions, the origins of their offenses, their native prefectures, counties, and villages, the locations of their graves, and the eras and places of their lives. If their sins are grave and Heaven has not yet pardoned them, their misfortunes will flow to their descendants in the world, giving rise to calamities. The Northern Emperor governs the ghostly officials who guard this mountain, where all palaces and towers are formed from the congealed essence of yellow essence. The officials here are ancient emperors and kings, loyal ministers, and filial children who performed meritorious deeds, now serving as nether officials clad in yellow robes and plain cinnabar-embroidered garments.\n\nEvery seventh day of the seventh month, they review the good and evil deeds of the living, reporting the offenses recorded in the Black Registers to the Celestial Courts. Those whose hearts remain clouded by dust cannot awaken or guide their ancestors. The ranks of the Earth Offices are graded according to hierarchy.\n\n*Dongyuan Collection, Scroll One, Concluded*\n*Dongyuan Collection, Scroll Two*",
      "overlap_context": "hymns resounded as he hovered ten thousand *ren* above the earth, circling without descending. The Celestial Master rent his heart in reverent gaze and beheld the Dao Lord admonishing the Perfected: \"Formerly, I dispatched you to the Western Marchmounts to subdue demons, but you did not await the celestial tally, arbitrarily summoning thunder and rain. You overtaxed your officers and soldiers, exceeding proper bounds. You drove the stars and constellations, throwing the sun and moon into chaos.\"",
      "start_char": 3462,
      "end_char": 4152,
      "start_sentence": 142,
      "end_sentence": 168,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.783273935317993,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "冲妙先生李思聪集 十大洞天 第一，王屋山天坛峰绝顶，高一百二十里，洞周回一万里。 名小有清虚之天，即杜冲王褒为小有天王清虚真人所理，在洛京王屋县。 第二，委羽山，洞周回一万里，名大有空明之天，即司马季主为大有真人所理，系台州尔雅云应在海中。 第三，西城山，高二千丈，洞周回三千里，名太玄极真之天。 此即王方平真人所理，在梁州成都府西一千里，入西界。 第四，西玄山，高二千七百丈，洞周回一千里，名三玄极真之天，即裴真人所治，系华州人不可到入西界。 第五，青城大面山，高三千六百八十丈九尺，洞周迥二千里，名宝仙九室之天，即育真人所理，黄帝曾问道，希夷真君授帝龙娇经之处。 在蜀州青城县。 第六，天台赤城山，高一万八千丈，洞周回五百里，名上清玉平之天，即桐桥王真人所理。 葛玄仙公炼丹得道处，上应台宿，故名曰天台，在台州天台县。 第七，罗浮山，高三千六百丈，洞周回五百里，名朱明耀真之天，即篷莱之岛也。 尧时洪水泛海而来，博於罗山，二山相合，故曰罗浮，抱朴子葛洪炼丹得道处，在惠州博罗县。 第八，茅山，高一百七十丈，洞周回一百五十里，名金坛华阳之天，即古名句曲山。 因茅君炼丹得道，故曰茅山。 记云：华阳洞天，生黄金坛，高百丈，紫玉宫室，皆上清真人游息之地，在升州句容县。 第九，林屋山，洞周回四百里，名尤神幽墟之天，一名包山。 在太湖水中。 夏禹治水平后藏灵宝五符於此洞中，在苏州。 第十，括苍山，洞周回三百里，名成德隐真之天，徐来勒真人所治，在处州。 三十六洞天 第一，霍桐山，高三千四百丈，洞周迥三千里，名霍林之天，即郑思远、韩众、许映真人为司命君所治，在福州长溪县。 第二，东岳泰山，高四千丈二尺，洞周回一千里，名蓬玄空洞之天。 此即太昊为青帝，治东岳，主万物发生，考校死魂鬼神之所。 历代帝王报功封禅之岳，上应奎娄之精，下镇鲁地之分。 系兖州奉符县。 第三，南岳衡山，高四千一十丈，洞周回二千里，名朱陵太虚之天，即神农赤帝治南岳，昔上帝降玉册宝印，赐生真君，永镇灵岳，即吾皇比寿之山。 上应翼翰机衡之精，故为之衡，下镇楚地之分，系衡州衡山县。 第四，西岳华山，高七千丈，洞周回．二千里，名太极总仙之天，即少昊为白帝，治西岳，昔巨灵神手擘其上，足蹈其下，以通流救民洪波之难，仙掌之形，集然莹目，上应井鬼之精，下镇泰地之分，系华州华阴县。 第五，北岳常山，高二千九百丈，洞周迥二千里，名太一总玄之．天，即颛项为黑帝，治北岳山，名有五，一曰兰台府，二曰列女宫，三曰华阳台，四曰紫微台，五曰太一官。 上应毕勖之精，下镇燕地之分。 主天下五谷蕃熟之",
      "translated_text": "Master Chongmiao Li Sicong’s *Ten Great Grotto-Heavens*\n\n**First:** Wangwu Mountain’s Celestial Altar Peak summit rises one hundred and twenty *li* high, its grotto spanning ten thousand *li* in circumference. Named the Lesser Gathering of Pure Emptiness Heaven, it is governed by Du Chong and Wang Bao as the Lesser Gathering Heavenly King and Pure Emptiness Perfected, located in Wangwu County of Luojing.\n\n**Second:** Weiyu Mountain, its grotto spanning ten thousand *li* in circumference, named the Greater Gathering of Luminous Void Heaven. Governed by Sima Jizhu as the Greater Gathering Perfected, it is said in the *Erya* of Taizhou to lie within the sea.\n\n**Third:** Xicheng Mountain, two thousand *zhang* high, its grotto spanning three thousand *li* in circumference, named the Supreme Mystery Ultimate Perfection Heaven. Governed by Perfected Wang Fangping, it lies one thousand *li* west of Chengdu Prefecture in Liangzhou, entering the western frontier.\n\n**Fourth:** Xixuan Mountain, two thousand seven hundred *zhang* high, its grotto spanning one thousand *li* in circumference, named the Three Mysteries Ultimate Perfection Heaven. Administered by Perfected Pei, it is said to be inaccessible to the people of Huazhou, entering the western frontier.\n\n**Fifth:** Qingcheng’s Great Face Mountain, three thousand six hundred eighty *zhang* and nine *chi* high, its grotto spanning two thousand *li* in circumference, named the Precious Immortal Nine-Chambered Heaven. Governed by Perfected Yu, it is where the Yellow Emperor sought the Dao and Perfected Lord Xiyi transmitted the *Dragon-Riding Scripture* to the emperor. Located in Qingcheng County of Shuzhou.\n\n**Sixth:** Tiantai’s Red Wall Mountain, eighteen thousand *zhang* high, its grotto spanning five hundred *li* in circumference, named the Upper Clarity Jade Level Heaven. Governed by Perfected Wang of Tong Bridge, it is where Immortal Lord Ge Xuan refined the elixir and attained the Dao. Corresponding to the Terrace constellation above, it is thus named Tiantai, located in Tiantai County of Taizhou.\n\n**Seventh:** Luofu Mountain, three thousand six hundred *zhang* high, its grotto spanning five hundred *li* in circumference, named the Vermilion Brilliance Radiant Perfection Heaven. It is the Isle of Penglai, where in the time of Yao, the floodwaters surged from the sea and merged with Luo Mountain—hence the name Luofu. It is where Ge Hong, the Master Who Embraces Simplicity, refined the elixir and attained the Dao, located in Boluo County of Huizhou.\n\n**Eighth:** Mao Mountain, one hundred seventy *zhang* high, its grotto spanning one hundred fifty *li* in circumference, named the Golden Altar Flourishing Yang Heaven. Originally called Goju Mountain, it was renamed Mao Mountain after the Mao Lords refined the elixir and attained the Dao. Records state: The Flourishing Yang Grotto-Heaven gives birth to a golden altar a hundred *zhang* high, with palaces of purple jade, all serving as the wandering and resting places of the Upper Clarity Perfected. Located in Jurong County of Shengzhou.\n\n**Ninth:** Linwu Mountain, its grotto spanning four hundred *li* in circumference, named the Dark Abyss of Hidden Spirits Heaven, also called Baoshan. Situated within Lake Tai, it is where Yu the Great, after regulating the waters, concealed the Five Numinous Talismans within this grotto. Located in Suzhou.\n\n**Tenth:** Kuocang Mountain, its grotto spanning three hundred *li* in circumference, named the Hidden Perfection of Accomplished Virtue Heaven. Administered by Perfected Xu Laile, located in Chuzhou.\n\n---\n\n**Thirty-Six Grotto-Heavens**\n\n**First:** Huotong Mountain, three thousand four hundred *zhang* high, its grotto spanning three thousand *li* in circumference, named the Huolin Heaven. Governed by Perfected Zheng Siyuan, Han Zhong, and Xu Ying as the Lords of Destiny, located in Changxi County of Fuzhou.\n\n**Second:** Eastern Marchmount Tai Mountain, four thousand *zhang* and two *chi* high, its grotto spanning one thousand *li* in circumference, named the Pengxuan Cavernous Void Heaven. Here, Taihao serves as the Green Emperor, governing the Eastern Marchmount, overseeing the generation of all things and examining the souls of the dead and spirits of ghosts. It is the sacred peak where successive emperors reported their merits and performed the feng and shan sacrifices. Corresponding to the essence of the Straddling and Harvester constellations above, it presides over the land of Lu below. Located in Fengfu County of Yanzhou.\n\n**Third:** Southern Marchmount Heng Mountain, four thousand ten *zhang* high, its grotto spanning two thousand *li* in circumference, named the Vermilion Mound Supreme Void Heaven. Here, the Divine Farmer, the Red Emperor, governs the Southern Marchmount. Formerly, the Celestial Thearch descended with a jade tally and treasure seal, bestowing them upon the Perfected Lord of Life, eternally guarding this numinous peak—this is the mountain whose longevity rivals that of Our August Emperor. Corresponding to the essence of the Wings, Crossbar, and Balance constellations above, it is thus named Heng, presiding over the land of Chu below. Located in Hengshan County of Hengzhou.\n\n**Fourth:** Western Marchmount Hua Mountain, seven thousand *zhang* high, its grotto spanning two thousand *li* in circumference, named the Supreme Ultimate Assembly of Immortals Heaven. Here, Shaohao serves as the White Emperor, governing the Western Marchmount. In ancient times, the Spirit of the Mighty Torrent split its summit with his hands and pressed its base with his feet to channel the flow and rescue the people from the calamity of the great flood. The form of the Immortal’s Palm gleams resplendently to this day. Corresponding to the essence of the Well and Ghost constellations above, it presides over the land of Qin below. Located in Huayin County of Huazhou.\n\n**Fifth:** Northern Marchmount Chang Mountain, two thousand nine hundred *zhang* high, its grotto spanning two thousand *li* in circumference, named the Supreme Unity Assembly of Mystery Heaven. Here, Zhuanxu serves as the Black Emperor, governing the Northern Marchmount. It has five names: first, the Orchid Terrace Palace; second, the Palace of the Exemplary Women; third, the Flourishing Yang Terrace; fourth, the Purple Tenuity Terrace; and fifth, the Supreme Unity Palace. Corresponding to the essence of the Net and Turtle Beak constellations above, it presides over the land of Yan below, overseeing the abundant harvest of the Five Grains throughout the world.",
      "overlap_context": "deeds, now serving as nether officials clad in yellow robes and plain cinnabar-embroidered garments.\n\nEvery seventh day of the seventh month, they review the good and evil deeds of the living, reporting the offenses recorded in the Black Registers to the Celestial Courts. Those whose hearts remain clouded by dust cannot awaken or guide their ancestors. The ranks of the Earth Offices are graded according to hierarchy.\n\n*Dongyuan Collection, Scroll One, Concluded*\n*Dongyuan Collection, Scroll Two*",
      "start_char": 4152,
      "end_char": 5245,
      "start_sentence": 169,
      "end_sentence": 201,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.535579919815063,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "司，系定州常山县。 第六，中岳嵩山，高七千丈，洞周回一千里，名上帝司真之天，即黄帝治中国，土德分精黄老驻跸生，仙人贝多之株峭，玉女织锦之台，石髓琼环玉人金像、上应柳星张之精，下镇周地分，系洛京登封县。 第七，峨媚山，洞周回三百里，名虚灵大妙之天，即天真皇人所治，黄帝曾问道於此，皇人授帝守三一经，见传於世严君平佐此山，在嘉州峨媚县。 第八，庐山，高三千九百丈，洞周回一千七百里，名仙灵咏真之天，古名天子三幛山，昔周武王时，有方辅先生，字君季，跨白驴入山，结草为庐舍炼丹得道，故曰庐山。 即王长、赵升二真人所治，在江州得阳县。 第九，四明山，二百八十峰，洞周回一百八十里，名丹山赤水之天。 山有四门，通日月星辰之光，故曰四明，秦皇驱山塞海，鬼神劳役奔入四· 明洞不出，因名鬼藏山，在明州。 第十，阳平山，在蜀郡繁县界，去成都一百八十里，其山洞周回三百五十里，名极玄大元之天，禹穴藏书处。 第十一，太白山，洞周回五百里，名真德之天，即鬼谷子授苏秦佐国之卫处，祠庙见在长安县。 第十二，西山。 洞周回六百里，名天宝极真之天，即洪崖先生炼丹井修道，及昊许十二真君扳宅上升处，在洪州南昌县。 第十三，大围山，周回三百里，名好生玄上之天，在潭州醴陵县。 第十四，潜山，洞周回八百里，山高一千丈，名天柱司玄之天，此左慈真人炼丹得道处，即皇朝圣祖九天司命大帝所治，在舒州怀宁县。 第十五，鬼谷山，洞周回七千里，名太元思‘真之天，即正一真人张天师炼丹修道处，在信州贵溪县。 第十六，武夷山，洞周回一百二十里，名升化玄真之天，即武夷君所理，山高三百仞，在建州建阳县。 第十七，玉笋山，高三十里，周回四百里，名太素法乐之天，古名群玉峰。 汉武帝建坛授上清录，天降玉笋，因而名焉。 即大秀天王所治，汉九真人杜昙咏，萧子云炼丹上升处，在临江军新淦县。 第十八，华盖山，洞周回四百里，名容城太玉之天，在温州永嘉县。 第十九，盖竹山，洞周回一百八十里，名长耀宝元之天，即禹帝镇此山，及葛孝先真人所理，部先生得道处，在台州黄岩县。 第二十，都娇山，洞周回一百八十里，名宝玄之天，在容州。 第二十一，白石山，洞周回七百里，名琼秀长真之天，在容州。 第二十二，句漏山，洞周迥三百里，名玉阙宝圭之天，即葛洪真人炼丹处，在容州北流县。 第二十三，九疑山，洞周回三千里，名朝真太虚之天，孔子为太极上真公所治，即何侯真人宅会虞舜，分金液上升处，在道州延康县。 第二十四，洞阳山，洞周回一百五十里，名洞阳隐观之天，在潭州。 第二十五，幕阜山，洞周回一百里，名洞真太玄之天，在岳州平江县。 第二十六，大酉山，洞周回一百里，名大酉华妙之天，即尧时善卷先生宅，唐张果先生修道处，在辰州。 第二十七，金庭山，洞．周回三百里，名金庭崇妙之天，在越州刻县。 第二十八，麻姑山，洞周回一百五十里，名丹霞之天，即南极王方平真人会麻姑於蔡经宅上升处，在建昌军南城县。 第二十九，仙都山，周回三百里，名玄都祈仙之天，即黄帝驾火龙上升处；",
      "translated_text": "Sixth: Central Marchmount Song Mountain, seven thousand *zhang* high, its grotto spanning one thousand *li* in circumference, named the Celestial Controller of Authenticity Heaven. Here, the Yellow Emperor governs the Central Lands, where the essence of earth virtue coalesces into the Yellow Elder, whose abode gives rise to immortals. Behold the towering stalks of the *beiduo* tree, the Terrace where Jade Maidens weave brocade, the stone marrow and jade rings, the jade figures and golden statues. Corresponding to the essence of the Willow, Star, and Spread constellations above, it presides over the land of Zhou below, located in Dengfeng County of Luojing.\n\nSeventh: Mount Emei, its grotto spanning three hundred *li* in circumference, named the Vast Numinous Great Mystery Heaven. Here, the Heavenly Perfected Sovereign once resided, and the Yellow Emperor sought the Dao upon this mountain. The Sovereign bestowed upon him the *Scripture of Guarding the Three Ones*, which has been transmitted through the ages. Yan Junping of the Han assisted in this mountain’s governance, located in Emei County of Jiazhou.\n\nEighth: Mount Lu, three thousand nine hundred *zhang* high, its grotto spanning one thousand seven hundred *li* in circumference, named the Immortal Numinous Chanting Authenticity Heaven. In ancient times, it was called the Three Screened Mountain of the Son of Heaven. During the reign of King Wu of Zhou, Master Fangfu, styled Junji, rode a white donkey into the mountain, wove grass into a hut, and refined the elixir to attain the Dao—hence the name Mount Lu. Here, the Perfected Ones Wang Chang and Zhao Sheng govern, located in Deyang County of Jiangzhou.\n\nNinth: Fourfold Brilliance Mountain, comprising two hundred eighty peaks, its grotto spanning one hundred eighty *li* in circumference, named the Cinnabar Mountain and Scarlet Waters Heaven. The mountain has four gates, through which the light of the sun, moon, and stars passes—hence the name Fourfold Brilliance. When the First Emperor of Qin drove the mountains to block the sea, the ghosts and spirits toiled and fled into the Fourfold Brilliance Grotto, refusing to emerge—thus it was also named Ghost Concealment Mountain, located in Mingzhou.\n\nTenth: Mount Yangping, situated within the borders of Fan County in Shu Commandery, one hundred eighty *li* from Chengdu. Its grotto spans three hundred fifty *li* in circumference, named the Utmost Mystery and Great Origin Heaven, where Yu’s cave conceals the scriptures.\n\nEleventh: Mount Taibai, its grotto spanning five hundred *li* in circumference, named the Heaven of True Virtue. Here, Master Guigu transmitted the arts of statecraft to Su Qin, aiding his service to the kingdom. The temple and shrine remain in Chang’an County.\n\nTwelfth: West Mountain, its grotto spanning six hundred *li* in circumference, named the Heaven of Celestial Treasure and Utmost Authenticity. Here, Master Hongya refined the elixir by the well and cultivated the Dao, and the Twelve Perfected Lords Wu and Xu ascended to immortality from their abodes. Located in Nanchang County of Hongzhou.\n\nThirteenth: Great Encompassing Mountain, spanning three hundred *li* in circumference, named the Heaven of Nurturing Life and Mysterious Supremacy, located in Liling County of Tanzhou.\n\nFourteenth: Mount Qian, its grotto spanning eight hundred *li* in circumference and one thousand *zhang* high, named the Heaven of the Celestial Pillar Controller of Mystery. Here, the Perfected Left Ci refined the elixir to attain the Dao. It is governed by the August Ancestor of the Imperial Dynasty, the Great Emperor of the Nine Heavens who Commands Destiny, located in Huaining County of Shuzhou.\n\nFifteenth: Ghost Valley Mountain, its grotto spanning seven thousand *li* in circumference, named the Heaven of Great Origin and Contemplative Authenticity. Here, the Orthodox Unity Perfected Zhang, Celestial Master, refined the elixir and cultivated the Dao, located in Guixi County of Xinzhou.\n\nSixteenth: Mount Wuyi, its grotto spanning one hundred twenty *li* in circumference, named the Heaven of Ascending Transformation and Mysterious Authenticity. Here, the Lord of Wuyi governs. The mountain rises three hundred *ren* high, located in Jianyang County of Jianzhou.\n\nSeventeenth: Jade Bamboo Shoot Mountain, thirty *li* high and four hundred *li* in circumference, named the Heaven of Primordial Simplicity and Lawful Joy. In ancient times, it was called the Clustered Jade Peaks. Emperor Wu of Han established an altar to receive the *Shangqing Record*, whereupon heaven bestowed jade bamboo shoots—hence its name. Here, the Great Eminent Heavenly King governs. The Nine Perfected of Han, Du Tanyong, and Xiao Ziyun refined the elixir and ascended to immortality from this place, located in Xingan County of Linjiang Prefecture.\n\nEighteenth: Flower Canopy Mountain, its grotto spanning four hundred *li* in circumference, named the Heaven of Capacious City and Grand Jade, located in Yongjia County of Wenzhou.\n\nNineteenth: Covering Bamboo Mountain, its grotto spanning one hundred eighty *li* in circumference, named the Heaven of Eternal Radiance and Treasure Origin. Here, Emperor Yu subdued the mountain, and the Perfected Ge Xiaoxian governed. Master Bu attained the Dao in this place, located in Huangyan County of Taizhou.\n\nTwentieth: Mount Dujiao, its grotto spanning one hundred eighty *li* in circumference, named the Heaven of Treasure Mystery, located in Rongzhou.\n\nTwenty-First: White Stone Mountain, its grotto spanning seven hundred *li* in circumference, named the Heaven of Jade Beauty and Eternal Authenticity, located in Rongzhou.\n\nTwenty-Second: Goulou Mountain, its grotto spanning three hundred *li* in circumference, named the Heaven of Jade Gate and Treasure Jade Tablet. Here, the Perfected Ge Hong refined the elixir, located in Beiliu County of Rongzhou.\n\nTwenty-Third: Mount Jiuyi, its grotto spanning three thousand *li* in circumference, named the Heaven of Courted Authenticity and Grand Vacuity. Governed by the Supreme Perfected Lord of the Great Ultimate, Confucius, it is where the Perfected Lord Hehou resided and convened with Shun, parting the golden liquid to ascend to immortality, located in Yankang County of Daozhou.\n\nTwenty-Fourth: Mount Dongyang, its grotto spanning one hundred fifty *li* in circumference, named the Heaven of Dongyang’s Hidden Observation, located in Tanzhou.\n\nTwenty-Fifth: Mount Mofu, its grotto spanning one hundred *li* in circumference, named the Heaven of Grotto Authenticity and Grand Mystery, located in Pingjiang County of Yuezhou.\n\nTwenty-Sixth: Great You Mountain, its grotto spanning one hundred *li* in circumference, named the Heaven of Great You’s Flourishing Mystery. Here, the Recluse Shanjuan of Yao’s time resided, and Master Zhang Guo of the Tang cultivated the Dao, located in Chen Prefecture.\n\nTwenty-Seventh: Golden Court Mountain, its grotto spanning three hundred *li* in circumference, named the Heaven of Golden Court’s Lofty Mystery, located in Kuaiji County of Yuezhou.\n\nTwenty-Eighth: Mount Magu, its grotto spanning one hundred fifty *li* in circumference, named the Heaven of Cinnabar Rosy Clouds. Here, the Perfected Lord Wang Fangping of the Southern Culmen met Magu at Cai Jing’s residence and ascended to immortality, located in Nancheng County of Jianchang Prefecture.\n\nTwenty-Ninth: Immortal Capital Mountain, spanning three hundred *li* in circumference, named the Heaven of Mysterious Capital’s Prayer for Immortals. Here, the Yellow Emperor mounted a fiery dragon to ascend to immortality;",
      "overlap_context": "sembly of Mystery Heaven. Here, Zhuanxu serves as the Black Emperor, governing the Northern Marchmount. It has five names: first, the Orchid Terrace Palace; second, the Palace of the Exemplary Women; third, the Flourishing Yang Terrace; fourth, the Purple Tenuity Terrace; and fifth, the Supreme Unity Palace. Corresponding to the essence of the Net and Turtle Beak constellations above, it presides over the land of Yan below, overseeing the abundant harvest of the Five Grains throughout the world.",
      "start_char": 5245,
      "end_char": 6525,
      "start_sentence": 202,
      "end_sentence": 231,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.91868472099304,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "在处州晋云县。 第三十，青田山，周迥五百里，名青田大鹤之天，即青牛道士得道处，在处州青田县。 第三十一，锺山，周回一百里，名朱湖太生之天，即马明生所治，在升州上一兀县。 第三十二，良常山，周回三十里，名良常方会之天，即茅衷为保命真君所治，许长史杨廊真人全家得道，在润州茅山北。 第三十三，紫盖山，洞周回八十里，名紫玄洞照之天，在杭州余杭县。 第三十四，天目山，有两目，左目高三千丈，右目高二千五百丈，洞周回一百里，名太微玄盖之天，在杭州。 第三十五，桃源山，洞周回七十里，名白马玄真之天，秦时有三千余人入洞避难，皆云得道，即黄瞿真人炼丹得道处，在鼎州武陵县。 第三十六，金华山，高一千丈，洞周回五百里，名金华洞元之天，即黄初平真人遇赤松子，叱石为羊得道处，在委州金华县，上应姿女星，故曰金华山。 洞渊集卷之二竟 洞渊集卷之三",
      "translated_text": "Located in Chuzhou’s Jinyun County.\n\nThirtieth: Mount Qingtian, spanning five hundred *li* in circumference, named the Heaven of Qingtian’s Great Crane. Here, the Daoist of the Green Ox attained the Dao, located in Chuzhou’s Qingtian County.\n\nThirty-First: Mount Zhong, spanning one hundred *li* in circumference, named the Heaven of Zhuhu’s Supreme Life. Here, Ma Mingsheng resided, located in Shengzhou’s Shangyiwu County.\n\nThirty-Second: Mount Liangchang, spanning thirty *li* in circumference, named the Heaven of Liangchang’s Square Assembly. Here, Mao Zhong, as the Perfected Lord of Life Preservation, resided; the entire family of Attendant Xu and Yang Lang attained the Dao, located north of Maoshan in Runzhou.\n\nThirty-Third: Mount Zigai, its grotto spanning eighty *li* in circumference, named the Heaven of Purple Mystery’s Radiant Grotto, located in Hangzhou’s Yuhang County.\n\nThirty-Fourth: Mount Tianmu, possessing two peaks: the left peak rises three thousand *zhang*, the right two thousand five hundred *zhang*. Its grotto spans one hundred *li* in circumference, named the Heaven of the Supreme Mystery’s Canopy, located in Hangzhou.\n\nThirty-Fifth: Mount Taoyuan, its grotto spanning seventy *li* in circumference, named the Heaven of White Horse’s Mystery and Perfection. During the Qin dynasty, over three thousand people entered the grotto to avoid calamity, all attaining the Dao. Here, the Perfected Lord Huang Qu refined elixirs and attained the Dao, located in Dingzhou’s Wuling County.\n\nThirty-Sixth: Mount Jinhua, rising one thousand *zhang* in height, its grotto spanning five hundred *li* in circumference, named the Heaven of Jinhua’s Grotto Origin. Here, the Perfected Lord Huang Chuping met Red Pine and, by shouting stones into sheep, attained the Dao. Located in Weizhou’s Jinhua County, it corresponds above to the Star of the Beautiful Maiden, hence the name Mount Jinhua.\n\n*Dongyuan Ji*, Scroll Two, concludes.\n*Dongyuan Ji*, Scroll Three.",
      "overlap_context": " grotto spanning one hundred fifty *li* in circumference, named the Heaven of Cinnabar Rosy Clouds. Here, the Perfected Lord Wang Fangping of the Southern Culmen met Magu at Cai Jing’s residence and ascended to immortality, located in Nancheng County of Jianchang Prefecture.\n\nTwenty-Ninth: Immortal Capital Mountain, spanning three hundred *li* in circumference, named the Heaven of Mysterious Capital’s Prayer for Immortals. Here, the Yellow Emperor mounted a fiery dragon to ascend to immortality;",
      "start_char": 6525,
      "end_char": 6906,
      "start_sentence": 232,
      "end_sentence": 241,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.804014921188354,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "冲妙先生李思聪集 九仙山 广桑山者，天之东岳也。 在东海之中，为五岳发生之首。 上有碧霞之阙，琼树骞林，紫雀翠鸾，碧藕白橘莫可名状，即青帝天君灵威仰统仙官万众镇此山上，主岁星之精，居九黑青天之内矣。 长离山者，天之南岳也。 在南海之中，上有朱宫绛阙赤室丹房，朱草、虹芝、霞膏、金醴，莫可名状。 应天下初得道神仙皆诣此宫，莹形浴质，消阴炼阳，长生久视之道即赤帝天君赤标弩统仙官万众镇此山主荧域之精居三黑丹天之内矣。 丽农山者，即天之西岳也。 在西海之中，上有白华之阙，三素之城，王泉之宫，瑶林麟凤莫可名状。 即白帝天君白招矩统仙官万众镇此山主太白之精，居七黑素天之内矣。 广野山者，天之北岳也。 在北海弱水之中，形如昆仑，与邓都罗山合为阴黑之主。 上多琼楼宝阙，金醴灵芝，莫可名状，即黑帝天君吁光纪统仙官万众镇此山主辰星之精，居五黑玄天之内矣。 昆仑山者，天之中岳也。 在八海之中，上当天心，形如偃盖。 上广下狭，三成而上，与天文齐万度之心，日月黄赤二道，交会其上，三光行焉。 东曰昆仑，西曰玄圃，北日板风，南连积石、大岩，水泉，北户四山，四面各一万里，上有琼华之阙，光碧之堂，瑶林翠水。 西王母统众真居焉。 海中四岳为枝干，十洲、三岛、八海、大川围绕其侧，绝顶之上有金台五所，玉楼十二，金城千里，地生金根之林，琼柯之林，紫鹊、翠鸾、碧桃，紫奈，百宝装严，莫可纪述。 即黄帝天君含枢纽，统仙官万众镇此山，主洞府，与中国五岳名山相通，神仙住来，考校生籍，上主镇星之精，居中央一黑天中焉。 其海外五山即天地之五镇，造化之五岳，五黑之祖宗矣。 蓬莱山在东海中，高一千里，地方三千里，上有金台玉阙，是神仙之都，太帝仙乡游息之地。 海水正黑色而谓之淇渤。 无风而洪波百丈，不可往来，唯飞仙能到此矣。 扶桑山在东海中，地方万里，去中国九十万里，即太真丈人青童君所治。 山多林木，皆桑。 长者数千丈，大者二千围，株两相扶倚，同根而生，故日扶桑。 档子甘香赤色，千岁一生其实。 仙人采档食之，体生金光，飞翔太空，桑上有金凤九色乌，一呜即天下群鸡应之，日即晓矣。 方丈山在大海之中，高四万七千丈，上有太元之宫，即三天司命众真所居。 上有玉浆金醴，饮之长生，瑞禽奇木莫可名状。 又别有九源丈人宫府，主领天下水神鲛龙巨鲸水族之类。 沧浪山在大海中，山高五百里，地方三千五百里，四面水皆苍色也，仙人谓之沧浪。 山上多石桂石芝，中有紫玉石室，即九老仙都君统领仙官吏兵数万人同理此山焉。 八神洲 瀛洲在东海中也。 地方四千里，去岸七十万里，正对会稽。 上有青丘，翠水二山，真宫琼室万所，地生玉酒，饮之长生。 又产昆吾之铁，炼之为刀，切玉如泥。 神芝灵草皆异陵岩，莫可纪述，即上真神仙居焉。 祖洲在东海中，地方一万里，去岸七万里，地生不死琼田芝草，又名养神芝。 其状如瓜苗，可长数尺，人死以草盖面即活，秦始皇曾获此草，遣使问北郭鬼谷先生，试果验。 遣徐福字君房将童男女各五百，资金帛，驾舟入海，寻祖洲求草，遂不反，始皇甚怅然。",
      "translated_text": "Master Chongmiao Li Sicong’s Compilation\n\n**Mount Jiu Xian**\n**Mount Guang Sang** is the Eastern Marchmount of Heaven. Located in the Eastern Sea, it stands as the first of the Five Marchmounts to arise. Above it rise the turquoise palaces of rosy clouds, forests of jasper trees, purple sparrows, and emerald simurghs, while jade lotus and white citrus defy description. Here, the Heavenly Lord of the Azure Emperor, Ling Weiyang, commands ten thousand immortals to guard this mountain, governing the essence of Jupiter and dwelling within the Ninefold Black Azure Heavens.\n\n**Mount Chang Li** is the Southern Marchmount of Heaven. Situated in the Southern Sea, its heights bear crimson palaces, vermilion towers, scarlet chambers, and cinnabar halls, along with vermilion grasses, rainbow mushrooms, rosy ointments, and golden liquors—all beyond description. All newly attained immortals under heaven journey to this palace to refine their forms, bathe their essences, dissolve yin, and temper yang, mastering the Way of longevity and enduring vision. Here, the Heavenly Lord of the Vermilion Emperor, Chi Biaonu, commands ten thousand immortals to guard this mountain, governing the essence of Mars and dwelling within the Threefold Black Cinnabar Heavens.\n\n**Mount Li Nong** is the Western Marchmount of Heaven. Located in the Western Sea, its heights bear the white-flowered palaces, the Triple Simplicity Citadel, the Jade Spring Palace, and groves of jasper trees where unicorns and phoenixes dwell—all beyond description. Here, the Heavenly Lord of the White Emperor, Bai Zhaoqu, commands ten thousand immortals to guard this mountain, governing the essence of Venus and dwelling within the Sevenfold Black Simplicity Heavens.\n\n**Mount Guang Ye** is the Northern Marchmount of Heaven. Situated in the Weak Waters of the Northern Sea, its form resembles Kunlun, joining Mount Dengdu Luo as the sovereign of yin and darkness. Above rise towers of jasper and palaces of treasure, golden liquors and sacred mushrooms—all beyond description. Here, the Heavenly Lord of the Black Emperor, Xu Guangji, commands ten thousand immortals to guard this mountain, governing the essence of Mercury and dwelling within the Fivefold Black Mysterious Heavens.\n\n**Mount Kunlun** is the Central Marchmount of Heaven. Located amid the Eight Seas, its summit aligns with the heart of heaven, its form like an inverted canopy—broad above and narrow below, ascending in three tiers to meet the celestial measurements of ten thousand degrees. The yellow and red paths of the sun and moon intersect upon it, where the Three Luminaries traverse. To the east it is called Kunlun, to the west the Dark Garden, to the north the Board Wind, and to the south it connects with the Accumulated Stones and Great Crags. Springs and waters flow from its Northern Gate, with four faces each spanning ten thousand *li*. Above stand palaces of jasper blossoms and halls of radiant jade, forests of jasper and emerald streams. The Queen Mother of the West governs the assembled perfected ones here. The Four Marchmounts of the seas serve as its branches, encircled by the Ten Continents, Three Isles, Eight Seas, and great rivers. At its summit rise five golden terraces, twelve jade towers, and a golden city spanning a thousand *li*. The earth bears forests of golden roots and jasper boughs, where purple magpies, emerald simurghs, jade peaches, and purple crabapples adorn the land with countless treasures. Here, the Heavenly Lord of the Yellow Emperor, Han Shuniu, commands ten thousand immortals to guard this mountain, governing the grotto heavens and connecting with the Five Marchmounts and famous mountains of the Middle Kingdom. Immortals come and go, examining the registers of the living. Above, it governs the essence of Saturn and dwells within the Central Black Heaven. These five mountains beyond the seas are the Five Pillars of Heaven and Earth, the Five Marchmounts of creation, and the ancestral origins of the Five Black Heavens.\n\n**Mount Penglai** lies in the Eastern Sea, rising a thousand *li* in height and spanning three thousand *li* in circumference. Above stand golden terraces and jade palaces, the capital of immortals and the realm where the Supreme Thearch and transcendent beings wander and rest. The sea’s waters are truly black, called the Qi and Bo. Though windless, towering waves rise a hundred *zhang*, making passage impossible—only flying immortals may reach this place.\n\n**Mount Fusang** lies in the Eastern Sea, spanning ten thousand *li* in circumference and located nine hundred thousand *li* from the Middle Kingdom. It is governed by the Great Perfected Elder and the Azure Lad. The mountain abounds with forests, all of mulberry trees. The tallest reach several thousand *zhang*, the thickest two thousand *wei* in girth, their trunks leaning against one another, growing from the same root—hence the name Fusang. The mulberry’s fruit is sweet, fragrant, and crimson, ripening once every thousand years. Immortals who pluck and eat it radiate golden light, soaring through the vast heavens. Upon the mulberry trees dwell golden phoenixes and nine-colored crows; when one crows, all the world’s roosters respond, and dawn breaks.\n\n**Mount Fangzhang** lies in the Great Sea, rising forty-seven thousand *zhang* in height. Above stands the Palace of the Great Prime, where the Three Heavens’ Lords of Destiny and the assembled perfected ones reside. Above flow jade nectars and golden liquors; drinking them grants longevity. Auspicious birds and wondrous trees defy description. Additionally, the Nine Springs Elder’s palace governs all the water spirits of the world—shark dragons, giant whales, and aquatic beings.\n\n**Mount Canglang** lies in the Great Sea, rising five hundred *li* in height and spanning three thousand five hundred *li* in circumference. The waters on all four sides are deep blue, which immortals call Canglang. The mountain abounds with stone cassia and stone mushrooms, and at its heart lies a chamber of purple jade. Here, the Nine Elders of the Transcendent Capital command tens of thousands of immortal officials and soldiers to govern this mountain together.\n\n**The Eight Divine Continents**\n**Yingzhou** lies in the Eastern Sea, spanning four thousand *li* in circumference and located seven hundred thousand *li* from the shore, directly opposite Kuaiji. Above rise Green Mound and Emerald Water, two mountains, along with ten thousand palaces of jasper and jade chambers. The earth yields jade wine; drinking it grants longevity. It also produces Kunwu iron, which when forged into blades can slice jade like mud. Divine mushrooms and sacred grasses grow upon its cliffs and peaks—all beyond description. Here dwell the highest perfected immortals.\n\n**Zuzhou** lies in the Eastern Sea, spanning ten thousand *li* in circumference and located seventy thousand *li* from the shore. The earth yields the immortal jade-field mushrooms and herbs, also called the Spirit-Nourishing Mushroom. Its form resembles melon vines, growing several *chi* in length. When placed upon the face of the dead, they revive. The First Emperor of Qin once obtained this herb and dispatched envoys to consult Master Guigu of Beiguo, who confirmed its efficacy. He then sent Xu Fu, styled Junfang, with five hundred boys and girls, provisions of gold and silk, and ships to sail into the sea in search of Zuzhou and its herbs. They never returned, and the First Emperor was deeply grieved.",
      "overlap_context": "ocated in Dingzhou’s Wuling County.\n\nThirty-Sixth: Mount Jinhua, rising one thousand *zhang* in height, its grotto spanning five hundred *li* in circumference, named the Heaven of Jinhua’s Grotto Origin. Here, the Perfected Lord Huang Chuping met Red Pine and, by shouting stones into sheep, attained the Dao. Located in Weizhou’s Jinhua County, it corresponds above to the Star of the Beautiful Maiden, hence the name Mount Jinhua.\n\n*Dongyuan Ji*, Scroll Two, concludes.\n*Dongyuan Ji*, Scroll Three.",
      "start_char": 6906,
      "end_char": 8151,
      "start_sentence": 242,
      "end_sentence": 285,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.59730243682861,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "上有仙家万众上真居此洲，莫可纪述。 聚窟洲在西海中，地方三千里，去岸二十四万里。 上有大山，形似人乌之象，因名人乌山。 中有洞玄之宫，山返魂香株，．状如桐花，香闻数百里，炼液为香，一日惊精香，二日震灵香，三日返生香，四曰震檀香，五日凤精香，六日却死香。 凡此六名，实神仙之异物也。 人死闻香即活，皆仙宫洞府上真居焉。 至汉之时，通于中国矣。 炎洲在南海中，地方二千里，去岸九万里，洲四面数千里地，蒸炎亘天，飞乌高空而不敢度海水，四面为之沸腾，上有火山鼠，毛长数尺，仙人采毛－为布，名日火院布。 凡为衣，以水洗之终不莹洁，用火焚之其白如雪。 又产风生兽，青色如狸，积薪烧之，其毛如故。 其兽死触风乃活。 上有太山流火之宫，仙家万众皆上真列仙所治，至汉时曾通中国矣。 凤麟洲在西海中，地方一千五百里，四面有弱水。 禽毛不浮，上多麟凤，因以为名。 出返魂香，续弦胶，仙人煮凤喙麟角合煮作胶，青色如碧玉，一名连金泥，此神异物也。 上有青华之宫，素丹林府皆神仙上真居焉。 世人不可到此矣。",
      "translated_text": "The isle is home to ten thousand immortal households and the highest perfected transcendents—all beyond description.\n\n**Juku Isle** lies in the Western Sea, spanning three thousand *li* in circumference and located two hundred forty thousand *li* from the shore. Atop it stands a great mountain resembling the form of a human crow, hence named Renwu Mountain. Within lies the Cavernous Mystery Palace, and the mountain bears the Revert-Soul Fragrant Tree. Its form resembles paulownia blossoms, its fragrance detectable for hundreds of *li*. When its sap is refined into incense, it yields six varieties: the first, *Startling Essence Incense*; the second, *Thunder-Spirit Incense*; the third, *Return-Life Incense*; the fourth, *Thunder-Sandalwood Incense*; the fifth, *Phoenix-Essence Incense*; and the sixth, *Death-Repelling Incense*. These six names denote the wondrous treasures of the immortals. When the dead inhale its fragrance, they revive. Here too dwell the highest perfected transcendents within the grotto-heavens and palaces of the immortals. By the Han era, it had become accessible to the Middle Kingdom.\n\n**Yan Isle** lies in the Southern Sea, spanning two thousand *li* in circumference and located ninety thousand *li* from the shore. For thousands of *li* on all sides, the land steams with scorching heat that blazes to the heavens. Birds flying high dare not cross the sea, for its waters boil on all sides. Atop the isle stands the Fire-Mountain Mouse, its fur several *chi* in length. Immortals gather its fur to weave into cloth, called *Fire-Cloak Fabric*. When made into garments and washed with water, they never become bright and clean; but when burned with fire, they turn as white as snow. The isle also produces the Wind-Born Beast, azure as a leopard cat. When piled with kindling and set aflame, its fur remains unchanged. Only when the dead beast is touched by wind does it revive. Above stands the Great Mountain Flowing-Fire Palace, where ten thousand immortal households are governed by the highest perfected transcendents and ranked immortals. By the Han era, it too had become accessible to the Middle Kingdom.\n\n**Fenglin Isle** lies in the Western Sea, spanning one thousand five hundred *li* in circumference, encircled by Weak Waters where even a feather cannot float. The isle abounds with qilins and phoenixes, from which it takes its name. It yields Revert-Soul Incense and *Continuous-String Glue*. Immortals boil phoenix beaks and qilin horns together to make this adhesive, azure as jasper, also called *Linked-Gold Mud*—a divine and wondrous substance. Above stand the Azure Blossom Palace and the White Cinnabar Grove, where the highest perfected transcendents reside. Mortals of this world can never reach this place.",
      "overlap_context": "-Nourishing Mushroom. Its form resembles melon vines, growing several *chi* in length. When placed upon the face of the dead, they revive. The First Emperor of Qin once obtained this herb and dispatched envoys to consult Master Guigu of Beiguo, who confirmed its efficacy. He then sent Xu Fu, styled Junfang, with five hundred boys and girls, provisions of gold and silk, and ships to sail into the sea in search of Zuzhou and its herbs. They never returned, and the First Emperor was deeply grieved.",
      "start_char": 8151,
      "end_char": 8583,
      "start_sentence": 286,
      "end_sentence": 302,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.059789180755615,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "玄洲在北海中，地方二千二百里，去岸三万六千里，地多山丘，有风山声响如雷，正对天门上有玄都府，仙伯真人所治地。 生金玉紫芝，无风而洪波百丈，唯飞仙往来，世人莫到矣。 流洲在西海中，地方三千里，去岸九十万里，上有飞霞之山，神仙往来。 奇花、异果、瑞草、灵芝、莫可名状。 仙府之中皆上真灵官居焉。 长洲在南海中，地方五千里，去岸二十万里，上有真都之山，一名青丘。 地生甘液，玉英紫琼宫府，天真女仙居焉。 世人不可到矣。 元洲在北海中，地方三千里，去岸十万里，上有紫虚玉馆，神仙所居地。 生灵药神芝，玄涧之中甘醴如蜜，饮之长生。 上真灵官所治焉。 生洲在东海中，地方二千五百里，去岸二十三万里，相接蓬莱，山上多神草灵芝，服之飞仙，上有仙家万众，皆高逸神仙所治此焉。 洞渊集卷之三竟 冲妙先生李思聪集",
      "translated_text": "**Mystic Continent** lies in the Northern Sea, spanning two thousand two hundred *li* in circumference, thirty-six thousand *li* from shore. Its land is rich with hills and mountains, where Wind Mountain’s rumblings shake like thunder. Directly aligned with the Gate of Heaven stands the **Mystic Capital Prefecture**, governed by the Transcendent Lords and Perfected Ones. It yields gold, jade, and purple mushrooms. Though no wind stirs, towering waves rise a hundred *zhang*; only flying transcendents traverse its expanse—mortals can never reach it.\n\n**Flowing Continent** lies in the Western Sea, spanning three thousand *li* in circumference, nine hundred thousand *li* from shore. Upon it rises **Flying Rosy Clouds Mountain**, where divine transcendents come and go. Strange blossoms, wondrous fruits, auspicious herbs, and numinous mushrooms defy description. Within its immortal precincts dwell the highest Perfected and Spirit Officials.\n\n**Everlasting Continent** lies in the Southern Sea, spanning five thousand *li* in circumference, two hundred thousand *li* from shore. Upon it stands **Perfected Capital Mountain**, also called **Azure Mound**. The land yields sweet dew, jade blossoms, and the **Purple Jade Palace**, where Heavenly Perfected Maidens and Female Transcendents reside. Mortals can never reach this place.\n\n**Primal Continent** lies in the Northern Sea, spanning three thousand *li* in circumference, one hundred thousand *li* from shore. Upon it stands the **Purple Void Jade Pavilion**, the abode of divine transcendents. It yields sacred medicines and spirit mushrooms; within its **Mystic Gorge**, sweet nectar flows like honey—those who drink it attain longevity. Here, the highest Perfected and Spirit Officials hold governance.\n\n**Living Continent** lies in the Eastern Sea, spanning two thousand five hundred *li* in circumference, two hundred thirty thousand *li* from shore, bordering Penglai. Its mountains abound with divine herbs and numinous mushrooms; those who consume them ascend as flying transcendents. Above dwell ten thousand immortal households, all governed by lofty and reclusive divine transcendents.\n\n*Collected Writings of the Grotto Abyss, Scroll Three*\n*Compiled by Master Chongmiao, Li Sicong*",
      "overlap_context": " Waters where even a feather cannot float. The isle abounds with qilins and phoenixes, from which it takes its name. It yields Revert-Soul Incense and *Continuous-String Glue*. Immortals boil phoenix beaks and qilin horns together to make this adhesive, azure as jasper, also called *Linked-Gold Mud*—a divine and wondrous substance. Above stand the Azure Blossom Palace and the White Cinnabar Grove, where the highest perfected transcendents reside. Mortals of this world can never reach this place.",
      "start_char": 8584,
      "end_char": 8935,
      "start_sentence": 303,
      "end_sentence": 316,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.618439197540283,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "天下名山七十二福地 第一福地，地肺山，在长安终南山心，四皓先生修炼处。 第二福地盖竹山，在台州黄岩县。 第三福地青远山，在南阳。 第四福地安山，在交州。 第五福地石磕山，在台州天台县。 第六福地东仙源，在台州。 第七福地青屿山，在束海，中接扶桑岛。 第八福地郁木坑，在玉笋山心，系临江军新淦县。 第九福地赤水山，在西番西梁府。 第十福地在麻姑山，顶后建昌军。 第十一福地君山，在洞庭湖心岳州。 第十二福地桂源，尹真人得道处，在建州建阳县。 第十三福地灵墟，在天台山顶，系台州天台县。 第十四福地祆洲，在越州。 第十五福地天姥岑，李先生修道处，在越州刻县。 第十六福地若耶溪，在越州。 第十七福地金庭山，在明州。 第十八福地马岭山，在梆州。 第十九福地鹅羊山，在潭州。 第二　十福地真墟，在长沙。 第二十一福地清玉坛，在南岳顶。 第二十二福地光天坛，在南岳衡州。 第二十三福地洞宫，娄敬先生修道处，在长安。 第二十四福地陶山，在琼州。 第二十五福地洞灵源，在衡州。 第二十六福地三皇井，在温州永嘉县。 第二十七福地烂柯山，在衢州。 第二十八福地勒溪，在建州。 第二十九福地龙虎山，张天师在信州。 第三　十福地灵山，在信州。 第三十一福地白水源，在罗浮山顶，郑思远真人炼丹处，在惠州博罗县。 第三十二福地逍遥山，在西山心，许真君宅淬剑处，在洪州。 第三十三福地合皂山，张天师观宝黑浮天，发洞穴获玉像天尊，因立洞穴，在临江军新淦县。 第三十四福地始丰山，在洪州丰城县。 第三十五福地金精山，在虔州虔化县。 第三十六福地束白源，在洪州。 第三十七福地钵池山，乔真人修道处，在楚州。 第三十八福地论山，在润州丹阳县。 第三十九福地毛公坛，刘根先生修道处，在安昊县。 第四　十福地鹦笼山，在和州历阳县。 第四十一福地桐梧山，在唐州。 第四十· 二福地平都山阴，长生修道处，在忠州。 第四十三福地绿罗山，在鼎州武陵县。 第四十四福地彰观山，在鄹州丰陵县。 第四十五枫地抱福山，在南海交州。 第四十六福地大面山，在青城山顶，系蜀州青城县。 第四十七福地虎溪庐山心，五柳先生宅，在江州德安县。 第四十八福地元辰山，苏真人上升处，在都昌县。 第四十九福地马迹山，老君下降，授青童君《相骨经》，马迹印於石坛上，因立祠宫，在润州丹徒县。 第五　十福地德山，尧时善卷先生修道处，在鼎州武陵县。 第五十一福地蓝水，在长安蓝田县。 第五十二福地玉峰山，在河中府。 第五十三福地天目山，在和州历阳县。 第五十四福地商谷山，四皓先生修道处，在商州。 第五十五福地张公洞，在常州义兴县。 第五十六福地鱼湖洞，秦始皇求道处，在四明山。 第五十七福地中条山，在河中府。 第五十八福地灵墟，在天台北天台县。 第五十九福地绵竹山，在绵州绵江县。 第六　十福地甘山，在黔州。 第六十一福地瑰山，在汉州。 第六十二福地金城山，在云中郡。 第六十三福地灵山，在武歪县。 第六十四福地北郎山，在洛县。 第六十五福地武当山，在均州武当县。 第六十六福地女几山，在三峡口。 第六十七福地少室山，在邓州南阳县。",
      "translated_text": "The Seventy-Two Blessed Lands of the World’s Renowned Mountains\n\nFirst Blessed Land: **Mount Earth-Lung**, at the heart of Mount Zhongnan in Chang’an, where the Four Hoary Masters cultivated the Dao.\nSecond Blessed Land: **Mount Covering Bamboo**, in Huangyan County, Taizhou.\nThird Blessed Land: **Mount Azure-Distant**, in Nanyang.\nFourth Blessed Land: **Mount Peace**, in Jiaozhou.\nFifth Blessed Land: **Mount Stone-Crag**, in Tiantai County, Taizhou.\nSixth Blessed Land: **Eastern Immortal Source**, in Taizhou.\nSeventh Blessed Land: **Mount Green Islet**, in the Eastern Sea, connecting midway to Fusang Isle.\nEighth Blessed Land: **Yumu Hollow**, at the heart of Jade Bamboo Shoot Mountain, in Xingan County, Linjiang Prefecture.\nNinth Blessed Land: **Mount Red Waters**, in Xiliang Prefecture, Western Barbarian Lands.\nTenth Blessed Land: **Mount Magu**, behind the summit in Jianchang Prefecture.\nEleventh Blessed Land: **Mount Jun**, at the heart of Dongting Lake, in Yuezhou.\nTwelfth Blessed Land: **Cassia Source**, where Perfected Lord Yin attained the Dao, in Jianyang County, Jianzhou.\nThirteenth Blessed Land: **Numinous Ruins**, atop Mount Tiantai, in Tiantai County, Taizhou.\nFourteenth Blessed Land: **Xian Isle**, in Yuezhou.\nFifteenth Blessed Land: **Heavenly Mother Peak**, where Master Li cultivated the Dao, in Kè County, Yuezhou.\nSixteenth Blessed Land: **Ruoye Stream**, in Yuezhou.\nSeventeenth Blessed Land: **Mount Golden Court**, in Mingzhou.\nEighteenth Blessed Land: **Mount Horse-Ridge**, in Bangzhou.\nNineteenth Blessed Land: **Mount Goose-Sheep**, in Tanzhou.\nTwentieth Blessed Land: **True Ruins**, in Changsha.\nTwenty-First Blessed Land: **Altar of Pure Jade**, atop Mount Southern Marchmount.\nTwenty-Second Blessed Land: **Altar of Radiant Heaven**, in Hengzhou, Southern Marchmount.\nTwenty-Third Blessed Land: **Grotto Palace**, where Master Lou Jing cultivated the Dao, in Chang’an.\nTwenty-Fourth Blessed Land: **Mount Pottery**, in Qiongzhou.\nTwenty-Fifth Blessed Land: **Grotto Numinous Source**, in Hengzhou.\nTwenty-Sixth Blessed Land: **Three Sovereigns’ Well**, in Yongjia County, Wenzhou.\nTwenty-Seventh Blessed Land: **Mount Rotten Axe**, in Quzhou.\nTwenty-Eighth Blessed Land: **Le Stream**, in Jianzhou.\nTwenty-Ninth Blessed Land: **Mount Dragon-Tiger**, where Heavenly Master Zhang resides, in Xinzhou.\nThirtieth Blessed Land: **Mount Numinous**, in Xinzhou.\nThirty-First Blessed Land: **White Water Source**, atop Mount Luofu, where Perfected Lord Zheng Siyuan refined the elixir, in Boluo County, Huizhou.\nThirty-Second Blessed Land: **Mount Carefree**, at the heart of Western Mountains, where Perfected Lord Xu tempered his sword, in Hongzhou.\nThirty-Third Blessed Land: **Mount Closed-Thorn**, where Heavenly Master Zhang observed the treasure Black Floating Heaven, and upon excavating a grotto cavern, obtained a jade image of the Heavenly Worthy, thus establishing the grotto; in Xingan County, Linjiang Prefecture.\nThirty-Fourth Blessed Land: **Mount Beginning Abundance**, in Fengcheng County, Hongzhou.\nThirty-Fifth Blessed Land: **Mount Golden Essence**, in Qianhua County, Qianzhou.\nThirty-Sixth Blessed Land: **Eastern White Source**, in Hongzhou.\nThirty-Seventh Blessed Land: **Mount Alms-Bowl Pool**, where Perfected Lord Qiao cultivated the Dao, in Chuzhou.\nThirty-Eighth Blessed Land: **Mount Debate**, in Danyang County, Runzhou.\nThirty-Ninth Blessed Land: **Altar of Master Mao**, where Master Liu Gen cultivated the Dao, in Anhao County.\nFortieth Blessed Land: **Mount Parrot Cage**, in Liyang County, Hezhou.\nForty-First Blessed Land: **Mount Paulownia-Wu**, in Tangzhou.\nForty-Second Blessed Land: **Northern Slope of Mount Pingdu**, where Longevity cultivated the Dao, in Zhongzhou.\nForty-Third Blessed Land: **Mount Green Gauze**, in Wuling County, Dingzhou.\nForty-Fourth Blessed Land: **Mount Manifest Vision**, in Fengling County, Zouzhou.\nForty-Fifth Blessed Land: **Mount Embracing Blessing**, in Jiaozhou, Southern Sea.\nForty-Sixth Blessed Land: **Mount Great Face**, atop Mount Qingcheng, in Qingcheng County, Shuzhou.\nForty-Seventh Blessed Land: **Heart of Mount Lu, Tiger Stream**, residence of Master Five Willows, in De’an County, Jiangzhou.\nForty-Eighth Blessed Land: **Mount Yuanchen**, where Perfected Lord Su ascended, in Duchang County.\nForty-Ninth Blessed Land: **Mount Horse-Track**, where the Supreme Old Lord descended, bestowing the *Treatise on Bone Physiognomy* upon the Azure Lad; the horse’s hoofprints were imprinted upon the stone altar, thus establishing a shrine and palace, in Dantu County, Runzhou.\nFiftieth Blessed Land: **Mount Virtue**, where Master Shanjuan of Yao’s time cultivated the Dao, in Wuling County, Dingzhou.\nFifty-First Blessed Land: **Blue Waters**, in Lantian County, Chang’an.\nFifty-Second Blessed Land: **Mount Jade Peak**, in Hezhong Prefecture.\nFifty-Third Blessed Land: **Mount Heavenly Eye**, in Liyang County, Hezhou.\nFifty-Fourth Blessed Land: **Mount Shang Valley**, where the Four Hoary Masters cultivated the Dao, in Shangzhou.\nFifty-Fifth Blessed Land: **Grotto of Master Zhang**, in Yixing County, Changzhou.\nFifty-Sixth Blessed Land: **Fish Lake Grotto**, where the First Emperor of Qin sought the Dao, on Mount Siming.\nFifty-Seventh Blessed Land: **Mount Central Ridge**, in Hezhong Prefecture.\nFifty-Eighth Blessed Land: **Numinous Ruins**, in Tiantai County, northern Taizhou.\nFifty-Ninth Blessed Land: **Mount Mian Bamboo**, in Mianjiang County, Mianzhou.\nSixtieth Blessed Land: **Mount Sweet**, in Qianzhou.\nSixty-First Blessed Land: **Mount Rare**, in Hanzhou.\nSixty-Second Blessed Land: **Mount Golden City**, in Yunzhong Prefecture.\nSixty-Third Blessed Land: **Mount Numinous**, in Wuwei County.\nSixty-Fourth Blessed Land: **Mount Northern Lang**, in Luoxian.\nSixty-Fifth Blessed Land: **Mount Wudang**, in Wudang County, Junzhou.\nSixty-Sixth Blessed Land: **Mount Woman Howl**, at the mouth of the Three Gorges.\nSixty-Seventh Blessed Land: **Mount Lesser Chamber**, in Nanyang County, Dengzhou.",
      "overlap_context": "governance.\n\n**Living Continent** lies in the Eastern Sea, spanning two thousand five hundred *li* in circumference, two hundred thirty thousand *li* from shore, bordering Penglai. Its mountains abound with divine herbs and numinous mushrooms; those who consume them ascend as flying transcendents. Above dwell ten thousand immortal households, all governed by lofty and reclusive divine transcendents.\n\n*Collected Writings of the Grotto Abyss, Scroll Three*\n*Compiled by Master Chongmiao, Li Sicong*",
      "start_char": 8935,
      "end_char": 10344,
      "start_sentence": 317,
      "end_sentence": 384,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.755206823349,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "第六十八福地庐山，在江州德安县。 第六十九福地西源山，在台州黄岩县。 第七　十福地南田山，在东海生州。 第七十一福地玉溜山，在束海，接扶桑岛。 第七十二福地抱犊山，在徐州。 洞渊集卷之四竟 洞渊集卷之五 冲妙先生李思聪集 水府 东海水府仙官，居青华宫，系广德王所理，庙在莱州。 南海水府仙官，居丹陵宫，系广利王所理，庙在广州。 西海水府仙官，居素灵宫，系广润王所理，庙在河中府。 北海水府仙官，居玄冥宫，系广泽王所理，庙在孟州。 松江水帝庙在苏州。 楚江水帝庙在江州。 湘江水帝庙在潭州。 荆江水帝庙在判州。 汉江水帝庙在利州。 南江水帝庙在洪州。 杨子江水帝庙在润州。 昊江水帝庙在苏州。 江渎源出岷山沔地，系广源公所理，庙在益州建宁县。 河渍源山昆仑之墟，系显圣灵源公所理，庙在河中府。 淮渎源出南阳桐梧山，系长源公所理，庙在唐州。 济渍源出王屋山，名沈水，系清源公所理，庙在河阳济源县。 黄河伯庙在北番界。 洛河伯庙在洛京。 淮河伯庙在泗州。 太湖水神庙在苏州。 青草湖水神庙在岳州。 彭蠡湖水神庙在南康军。 谢阳湖水神庙在楚州。 丹阳湖水神庙在太平州。 峡峡溪上真庙在夔州巫山县。 五云溪上真庙在越州。 岷山溪上真庙在嘉州。 清远溪上真庙在广州。 桐梧溪上真庙在台州天台县。 蟠冢溪上真庙在嘉州。 昆仑溪上真庙在北地。 武陵溪上真庙在鼎州。 苎罗溪上真庙在越州。 涤溪上真庙在利州。 院沙溪上真庙在越州。 沔池溪上真庙在洛京。 第一，马当山上水府福善安江王，庙在江州。 第二，采石山中水府顺圣平江王，庙在太平州。 第三，金山下水府昭信大江王庙在润州。 洞渊集卷之五竟 洞渊集卷之六",
      "translated_text": "Sixty-Eighth Blessed Land: **Mount Lu**, in De’an County, Jiangzhou.\nSixty-Ninth Blessed Land: **Mount West Source**, in Huangyan County, Taizhou.\nSeventieth Blessed Land: **Mount Southern Field**, in Shengzhou, East Sea.\nSeventy-First Blessed Land: **Mount Jade Flow**, in the Eastern Sea, adjoining Fusang Isle.\nSeventy-Second Blessed Land: **Mount Hold Calf**, in Xuzhou.\n\n*Dongyuan Ji*, Scroll Four ends here\n*Dongyuan Ji*, Scroll Five\n\n**Master Chongmiao Li Sicong’s Compilation**\n\n**Water Palaces**\nThe transcendent officials of the Eastern Sea Water Palace reside in Azure Flower Palace, governed by King Broad Virtue; its temple stands in Laizhou.\nThe transcendent officials of the Southern Sea Water Palace reside in Cinnabar Mound Palace, governed by King Broad Benefit; its temple stands in Guangzhou.\nThe transcendent officials of the Western Sea Water Palace reside in Plain Spirit Palace, governed by King Broad Moisture; its temple stands in Hezhong Prefecture.\nThe transcendent officials of the Northern Sea Water Palace reside in Dark Depths Palace, governed by King Broad Marsh; its temple stands in Mengzhou.\n\nThe **Song River Water Emperor Temple** stands in Suzhou.\nThe **Chu River Water Emperor Temple** stands in Jiangzhou.\nThe **Xiang River Water Emperor Temple** stands in Tanzhou.\nThe **Jing River Water Emperor Temple** stands in Panzhou.\nThe **Han River Water Emperor Temple** stands in Lizhou.\nThe **Southern River Water Emperor Temple** stands in Hongzhou.\nThe **Yangzi River Water Emperor Temple** stands in Runzhou.\nThe **Wu River Water Emperor Temple** stands in Suzhou.\n\nThe **Jiang River** originates from Min Mountain in Mian territory, governed by Duke Broad Source; its temple stands in Jianning County, Yizhou.\nThe **Yellow River** originates from the Kunlun wastes, governed by Duke Manifest Sacred Source; its temple stands in Hezhong Prefecture.\nThe **Huai River** originates from Tongwu Mountain in Nanyang, governed by Duke Long Source; its temple stands in Tangzhou.\nThe **Ji River** originates from Mount Wangwu, named the Shen River, governed by Duke Clear Source; its temple stands in Jiyuan County, Heyang.\n\nThe **Yellow River Earl Temple** stands on the northern frontier.\nThe **Luo River Earl Temple** stands in Luojing.\nThe **Huai River Earl Temple** stands in Sizhou.\nThe **Tai Lake Water Spirit Temple** stands in Suzhou.\nThe **Green Grass Lake Water Spirit Temple** stands in Yuezhou.\nThe **Pengli Lake Water Spirit Temple** stands in Nankang Prefecture.\nThe **Xieyang Lake Water Spirit Temple** stands in Chuzhou.\nThe **Danyang Lake Water Spirit Temple** stands in Taiping Prefecture.\n\nThe **Upper Perfected Temple of Gorge Stream** stands in Wushan County, Kuizhou.\nThe **Upper Perfected Temple of Five Clouds Stream** stands in Yuezhou.\nThe **Upper Perfected Temple of Min Mountain Stream** stands in Jiazhou.\nThe **Upper Perfected Temple of Clear Distant Stream** stands in Guangzhou.\nThe **Upper Perfected Temple of Tongwu Stream** stands in Tiantai County, Taizhou.\nThe **Upper Perfected Temple of Coiling Mound Stream** stands in Jiazhou.\nThe **Upper Perfected Temple of Kunlun Stream** stands in the northern lands.\nThe **Upper Perfected Temple of Wuling Stream** stands in Dingzhou.\nThe **Upper Perfected Temple of Ramie Stream** stands in Yuezhou.\nThe **Upper Perfected Temple of Di Stream** stands in Lizhou.\nThe **Upper Perfected Temple of Yuan Sand Stream** stands in Yuezhou.\nThe **Upper Perfected Temple of Mian Pool Stream** stands in Luojing.\n\nFirst: **King Blessed Peace of the River**, of the Upper Water Palace of Mount Madang; its temple stands in Jiangzhou.\nSecond: **King Pacifying Saint of the River**, of the Central Water Palace of Mount Caishi; its temple stands in Taiping Prefecture.\nThird: **King Illustrious Trust of the Great River**, of the Lower Water Palace of Mount Jin; its temple stands in Runzhou.\n\n*Dongyuan Ji*, Scroll Five ends here\n*Dongyuan Ji*, Scroll Six",
      "overlap_context": "Qianzhou.\nSixty-First Blessed Land: **Mount Rare**, in Hanzhou.\nSixty-Second Blessed Land: **Mount Golden City**, in Yunzhong Prefecture.\nSixty-Third Blessed Land: **Mount Numinous**, in Wuwei County.\nSixty-Fourth Blessed Land: **Mount Northern Lang**, in Luoxian.\nSixty-Fifth Blessed Land: **Mount Wudang**, in Wudang County, Junzhou.\nSixty-Sixth Blessed Land: **Mount Woman Howl**, at the mouth of the Three Gorges.\nSixty-Seventh Blessed Land: **Mount Lesser Chamber**, in Nanyang County, Dengzhou.",
      "start_char": 10345,
      "end_char": 11141,
      "start_sentence": 385,
      "end_sentence": 434,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.26293420791626,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "冲妙先生李思聪集 天下名山二十八治 第一，阳平治。 上应角宿，下管金命人禄，寿祸福。 阳平治山在蜀都繁县界，去城一百八十里道，由罗江水两岐山口入，水道四十里，治道东有龙门，拒守神水，有二梧生其上。 西南有大泉，央水归束。 天师子嗣师讳自灵真君，以光和二年正月十五日於此山上升立碑一双，见在治门焉。 第二，鹿堂治。 上应亢宿，下管金命人禄寿祸福。 鹿堂山治在蜀都繁县界，北乡去城三百里，上有仙室，仙台，古人度世之处。 第三，鹤呜治。 上应氏宿，下管木命人禄寿祸福。 鹤呜山治，山顶与青城山，天相山相连，去成·都二百里，在蜀郡那县界。 径道三百里，世人不知昔马底何丹得道处。 治前，三水合成一带，神龙居之。 古有四兽头，金钉簪二石上，金银蚕二斛，又云尹喜先生主之。 又《神仙传》云：昔张天师世乱遇中国戈甲，乃於鹤呜山学道上升处。 第四，离沅治。 上应房宿，下管土命人禄寿祸福。 离沅山治在蜀郡繁县界，与鹿堂治相通。 其涧八十里，去成都二百五十里，上有百果灵松神草，服之长生，是四龙神骑之门。 昔范蠡得道上升之处。 第五，葛琐治。",
      "translated_text": "The *Collected Works of Master Chongmiao*, Li Sicong\n\n**The Twenty-Eight Sacred Peaks of the World**\n\nFirst: **Yangping Precinct**.\nCorresponding above to the Horn Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Metal destiny.\nThe Yangping Precinct mountain lies within the borders of Fan County in Shu’s capital, one hundred and eighty *li* from the city. The path follows the Luo River into the bifurcation of the Two Peaks Pass, with a water route of forty *li*. To the east of the precinct’s path stands the Dragon Gate, guarded by divine waters, upon which two parasol trees grow. To the southwest lies a great spring, where waters converge and flow onward.\nThe Celestial Master’s descendant, the Perfected Lord Hui Ziling, ascended here in the second year of *Guanghe* (180 CE) on the fifteenth day of the first month, erecting a pair of steles that remain at the precinct’s gate.\n\nSecond: **Lutang Precinct**.\nCorresponding above to the Neck Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Metal destiny.\nThe Lutang Precinct mountain lies within the borders of Fan County in Shu’s capital, three hundred *li* north of the city. At its summit stand immortal chambers and a terrace, an ancient site where transcendents attained liberation.\n\nThird: **Heming Precinct**.\nCorresponding above to the Root Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Wood destiny.\nThe Heming Precinct mountain’s peak connects with Mount Qingcheng and Mount Tianxiang, two hundred *li* from Chengdu, within the borders of Pi County in Shu’s capital. The direct path spans three hundred *li*, though the world remains unaware that this was once the place where Ma Di and He Dan attained the Dao.\nBefore the precinct, three waters merge into a single stream, where divine dragons reside. Of old, four beast-headed figures stood, with golden nails piercing two stones, and two *hu* of golden and silver silkworms. It is also said that Master Yin Xi presided here.\nThe *Biographies of Divine Immortals* further record that when the Celestial Master Zhang encountered chaos and warfare in the Central Kingdom, he retreated to Heming Mountain to cultivate the Dao and ascend.\n\nFourth: **Liyuan Precinct**.\nCorresponding above to the Chamber Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Earth destiny.\nThe Liyuan Precinct mountain lies within the borders of Fan County in Shu’s capital, connected to the Lutang Precinct. Its ravine extends eighty *li*, two hundred and fifty *li* from Chengdu. At its summit grow a hundred sacred fruits, numinous pines, and divine herbs; those who consume them attain longevity. This is the gateway where the Four Dragon Spirits ride.\nIt was here that Fan Li attained the Dao and ascended.\n\nFifth: **Gexi Precinct**.",
      "overlap_context": "r Perfected Temple of Mian Pool Stream** stands in Luojing.\n\nFirst: **King Blessed Peace of the River**, of the Upper Water Palace of Mount Madang; its temple stands in Jiangzhou.\nSecond: **King Pacifying Saint of the River**, of the Central Water Palace of Mount Caishi; its temple stands in Taiping Prefecture.\nThird: **King Illustrious Trust of the Great River**, of the Lower Water Palace of Mount Jin; its temple stands in Runzhou.\n\n*Dongyuan Ji*, Scroll Five ends here\n*Dongyuan Ji*, Scroll Six",
      "start_char": 11141,
      "end_char": 11625,
      "start_sentence": 435,
      "end_sentence": 457,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.708431243896484,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "上应心宿，下管火命人禄寿祸福。 葛琐山治在蜀都繁县界，与离沅山相连，去成都县二百三十里，去阳平治水口四十八里。 昔杨仙贤鲁女得道处，山上生金粟、玉芝，服之长生，山高六百丈。 第六，庚除治。 上应尾宿，下管土命人禄寿祸福。 庚除山治去平地三百九十丈，在广汉郡阳泉县界，西去县五里，接成都三百八十里。 上有神仙往来，可以避世养生，有张力士，赵升真人得道上升处，山有二石室，三龙口淮水远之。 第七，秦中治。 上应箕宿，下管水命人禄寿祸福。 秦中山治在广汉郡绵竹县东九里，去成都二百里，其山昔韩众真人於此得道，立铁符於山前，有大水，束有道经於汉谷，古有大石铜为铭志见在。 第八，真多治。 上应斗宿，下管金命人禄寿祸福。 真多山治在广汉郡新都县，去成都一百五十里，山有芝草神药，服之长生，寿延千岁。 山高二百八十丈，前有池，水口有神鱼，五头，昔南极真人王方平，於此修道遇金阙老君授以道要。 第九，昌利治。 上应牛宿，下管土命人绿寿祸福。 昌利山治在广汉郡锥县束四十里； 去成都一百五十里，昔成都李八伯、韩千秋学道处。 八伯即唐房卿之师也。 游行蜀中名山，常出戏骯都市，暮宿青城山上，故号日八伯。 山南有一石室，可容百人，前有三龙门，右有石志存焉。 第十，隶上治。",
      "translated_text": "Corresponding above to the Heart Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Fire destiny.\nThe Gexi Precinct mountain lies within the borders of Fan County in Shu’s capital, connected to the Liyuan Mountain. It stands two hundred and thirty *li* from Chengdu and forty-eight *li* from the Yangping Precinct’s water gate. Here, the immortal Yang Xian and the adept Lu Nü attained the Dao. At its summit grow golden grains and jade mushrooms; those who consume them attain longevity. The mountain rises six hundred *zhang*.\n\nSixth: **Gengchu Precinct**.\nCorresponding above to the Tail Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Earth destiny.\nThe Gengchu Precinct mountain rises three hundred and ninety *zhang* above the plain, within the borders of Yangquan County in Guanghan Prefecture. It lies five *li* west of the county seat and three hundred and eighty *li* from Chengdu. Here, immortals come and go, offering refuge for those who seek to withdraw from the world and cultivate life. This is where the adept Zhang Lishi and the perfected Zhao Sheng attained the Dao and ascended. The",
      "overlap_context": "nd blessings of those born under the Earth destiny.\nThe Liyuan Precinct mountain lies within the borders of Fan County in Shu’s capital, connected to the Lutang Precinct. Its ravine extends eighty *li*, two hundred and fifty *li* from Chengdu. At its summit grow a hundred sacred fruits, numinous pines, and divine herbs; those who consume them attain longevity. This is the gateway where the Four Dragon Spirits ride.\nIt was here that Fan Li attained the Dao and ascended.\n\nFifth: **Gexi Precinct**.",
      "start_char": 11626,
      "end_char": 12175,
      "start_sentence": 458,
      "end_sentence": 479,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.667474031448364,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "上应女宿，下管火命人禄寿祸福。 隶上山治在广汉郡德阳县界，东北一百二十里，山有二石室，神井一所，生白鹿、白鹤、白鸠，来往如人。 治与绵毋相连，西石溪上，有三松为记。 山去地高二千九百丈，昔季子先生卫叔卿於此得道上升处。 第十一，涌泉治。 上应虚宿，下管木命人禄寿祸福。 涌泉山治在昔广汉，马明生於此，学道遇太上老君至此，授化形之法。 治在遂宁郡小汉县界，上有泉，能救万病，服之立愈。 古传云：祝水治，去成都二里，有悬崖百丈，猿猴百乌翔翔其问，其山小而高，四向皆游径往来。 第十二，稠梗治。 上应危宿，下管火命人禄寿祸福。 稠梗山治在健为郡南安县，去成都一百一十里，汶口山江水九里，山高去城一千七百丈。 昔轩辕黄帝於此山修道，遇九天圣母下降，授帝丹经兵法。 治左右有皇相续，西北有味江水，山多芝草灵药，服之延年矣。 第十三，北平治。 上应室宿，下管金命人禄寿祸福。 北平山治在健为郡南安县，去成都一百四十里，山有池，水广二百步，中有神芝草药，食之长生。 昔越人王子乔，与青城育真君曾居此修道，一名科山治。 第十四，本竹治。 上应壁宿，下管木命人禄寿祸福。 本竹山治在健为郡南安县，去成都一百二十五里，山高一千三百丈，上有一水，’有香林，在治北。 有龙穴洞中透峨媚山，上有桂梧，昔郭子声得道处。 后有林竹，西去十五里，凿通鹤呜山中，山前水尾常有龙游戏其中焉。 第十五，蒙秦治。 上应奎宿，下管火命人禄寿祸福。 蒙秦山治在隽郡那都县西，去郡城二十里，去成都一千四百里，治与越隽郡隔河水，前有小山，后有大山，高一千丈，昔伊尹於此学道上升处。 产金液草，服之长生。 第十六，平盖治。",
      "translated_text": "Tenth: **Lishang Precinct**.\nCorresponding above to the Woman Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Fire destiny.\nThe Lishang Precinct mountain lies within the borders of Deyang County in Guanghan Prefecture, one hundred and twenty *li* to the northeast. The mountain holds two stone chambers and one divine well. White deer, white cranes, and white turtledoves come and go like men. The precinct connects with Mianwu, and to the west, above the Stone Creek, three pines mark the site. The mountain rises two thousand nine hundred *zhang* above the plain. Here, Master Jizi and Wei Shuqing attained the Dao and ascended.\n\nEleventh: **Yongquan Precinct**.\nCorresponding above to the Void Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Wood destiny.\nThe Yongquan Precinct mountain once lay in Guanghan. Ma Mingsheng studied the Dao here and encountered the Most High Lord Lao, who bestowed upon him the method of transforming form. The precinct lies within the borders of Xiaohan County in Suining Prefecture. Above it is a spring whose waters cure all ailments; those who drink are instantly healed. Ancient tradition holds: the Blessed Water Precinct lies two *li* from Chengdu. A hundred-*zhang* cliff rises there, where apes and a hundred crows soar. The mountain is small yet lofty, with paths winding in all four directions.\n\nTwelfth: **Chougeng Precinct**.\nCorresponding above to the Rooftop Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Fire destiny.\nThe Chougeng Precinct mountain lies in Nan’an County of Jianwei Prefecture, one hundred and ten *li* from Chengdu. Nine *li* from the Wenkou Mountain River, the peak rises one thousand seven hundred *zhang* above the city. Here, the Yellow Emperor cultivated the Dao and encountered the Nine Heavens Holy Mother, who bestowed upon him the *Canon of Elixirs* and the arts of war. To the left and right of the precinct stand imperial mulberry trees in succession. To the northwest flows the Flavor River. The mountain abounds with magic mushrooms and divine herbs; those who consume them attain longevity.\n\nThirteenth: **Beiping Precinct**.\nCorresponding above to the House Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Metal destiny.\nThe Beiping Precinct mountain lies in Nan’an County of Jianwei Prefecture, one hundred and forty *li* from Chengdu. The mountain holds a pool two hundred *bu* wide, within which grow divine mushrooms and herbs; those who eat them attain long life. Here, Wang Ziqiao of Yue and Lord Yu of Qingcheng once dwelled to cultivate the Dao. It is also called the Ke Mountain Precinct.\n\nFourteenth: **Benzhu Precinct**.\nCorresponding above to the Wall Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Wood destiny.\nThe Benzhu Precinct mountain lies in Nan’an County of Jianwei Prefecture, one hundred and twenty-five *li* from Chengdu. The mountain rises one thousand three hundred *zhang*. Above it is a stream, and to the north of the precinct lies a fragrant grove. A dragon cavern pierces through to Mount Emei. Above stand cassia and parasol trees. Here, Guo Zisheng attained the Dao. Behind it lies a bamboo grove. Fifteen *li* to the west, a tunnel was carved through to Mount Heming. At the tail of the mountain’s waters, dragons often sport within.\n\nFifteenth: **Mengqin Precinct**.\nCorresponding above to the Straddler Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Fire destiny.\nThe Mengqin Precinct mountain lies west of Nadu County in Jun Prefecture, twenty *li* from the prefectural seat and one thousand four hundred *li* from Chengdu. The precinct is separated from Jun Prefecture by a river. Before it stands a small mountain, and behind it, a great mountain rising one thousand *zhang*. Here, Yi Yin studied the Dao and ascended. It produces the Golden Liquid Herb; those who consume it attain long life.\n\nSixteenth: **Pinggai Precinct**.",
      "overlap_context": "nd blessings of those born under the Earth destiny.\nThe Gengchu Precinct mountain rises three hundred and ninety *zhang* above the plain, within the borders of Yangquan County in Guanghan Prefecture. It lies five *li* west of the county seat and three hundred and eighty *li* from Chengdu. Here, immortals come and go, offering refuge for those who seek to withdraw from the world and cultivate life. This is where the adept Zhang Lishi and the perfected Zhao Sheng attained the Dao and ascended. The",
      "start_char": 12176,
      "end_char": 12888,
      "start_sentence": 480,
      "end_sentence": 507,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.214300394058228,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "上应娄宿，下管土命人绿寿祸福。 平盖山治在健为郡武阳县，去成都八十里。 山下有洞穴，中有玉人一丈三尺，金匮三所。 昔昊郡崔孝通於此学道上升，山有大江，南有长生泉，北有平川龙门。 第十七，云台治。 上应冑宿，下管火命人禄寿祸福。 云台山治在巴西郡闻中县西，去六十里，山足去成都一千三百七十里，张天师弟子四百人，治中修炼。 汉安二年，白日上升，自后天师门人王长、赵升亦於此修炼丹药，服食升天，治前巴西大水，山崖中有一桃株，三年一花，五年一实。 在悬崖七百丈下，有无底之谷，惟赵升掷身取桃，献天师，余无人取得。 治中常有玉女乘白鹤、白鹿忽至迎天师白日上升，万民皆见，即天柱山也。 於云台治前立双碑见在。 第十八，尽口治。 上应昴宿，下管木命人禄寿祸福。 尽口山治在汉中郡江阳县，去成都二千九百二十里，汉中水过其山，一名平元山，西有长山，束有流海，水帝所治，号日：青龙门。 陈安世於此学道上升飞仙，安世即京兆人也。 第十九，后城治。",
      "translated_text": "Sixteenth: **Pinggai Precinct**.\nCorresponding above to the Bond Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Earth destiny.\nThe Pinggai Precinct mountain lies in Wuyang County of Jianwei Prefecture, eighty *li* from Chengdu. Beneath the mountain is a grotto, within which stands a jade figure thirteen *chi* tall, and three golden caskets. Here, Cui Xiaotong of Wu Prefecture studied the Dao and ascended. The mountain is traversed by a great river; to its south lies the Longevity Spring, and to its north, the Flat Plain Dragon Gate.\n\nSeventeenth: **Yuntai Precinct**.\nCorresponding above to the Helmet Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Fire destiny.\nThe Yuntai Precinct mountain lies west of Langzhong County in Baxi Prefecture, sixty *li* from the county seat and one thousand three hundred seventy *li* from Chengdu. Four hundred disciples of Heavenly Master Zhang cultivated and refined their practice here. In the second year of Han’an, they ascended in broad daylight. Thereafter, Heavenly Master’s disciples Wang Chang and Zhao Sheng also refined elixirs and consumed them here, ascending to heaven. Before the precinct, Baxi’s great floodwaters once surged; within the mountain’s cliffs grows a peach tree that blooms once every three years and bears fruit once every five. It stands seven hundred *zhang* down a sheer cliff, above a bottomless valley. Only Zhao Sheng cast himself down to pluck the peach and present it to the Heavenly Master; no other could retrieve it. Within the precinct, jade maidens riding white cranes and white deer would suddenly appear to welcome the Heavenly Master’s ascent in broad daylight, witnessed by all the people. This is Mount Tianzhu. Before the Yuntai Precinct stand twin steles, still extant.\n\nEighteenth: **Jinkou Precinct**.\nCorresponding above to the Pleiades Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Wood destiny.\nThe Jinkou Precinct mountain lies in Jiangyang County of Hanzhong Prefecture, two thousand nine hundred twenty *li* from Chengdu. The waters of Hanzhong flow past the mountain, which is also called Pingyuan Mountain. To its west stretches a long ridge, and to its east, a flowing sea. The Water Lord governs here, and it is named the Azure Dragon Gate. Chen Anshi studied the Dao here and ascended as a flying immortal; Anshi was a native of Jingzhao.\n\nNineteenth: **Houcheng Precinct**.",
      "overlap_context": "hose born under the Fire destiny.\nThe Mengqin Precinct mountain lies west of Nadu County in Jun Prefecture, twenty *li* from the prefectural seat and one thousand four hundred *li* from Chengdu. The precinct is separated from Jun Prefecture by a river. Before it stands a small mountain, and behind it, a great mountain rising one thousand *zhang*. Here, Yi Yin studied the Dao and ascended. It produces the Golden Liquid Herb; those who consume it attain long life.\n\nSixteenth: **Pinggai Precinct**.",
      "start_char": 12889,
      "end_char": 13312,
      "start_sentence": 508,
      "end_sentence": 523,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.065971851348877,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "上应毕宿，下管土命人禄寿祸福。 后城山治在汉中郡南郑县。 前有大水，后有重山D 生神芝千岁不死，一名黄陵山，南有长山，北有青龙山，束有松梧为记，昔夏子然於此学道上升处。 第二十，公慕治。 上应觜宿，下管金命人禄寿祸福。 公慕治在汉中郡南郑县，去治一百里。 一名北逢仙，山南又有石坎，北有悬流。 昔苏子於此学道处。 第二十一，平歪治。 上应参宿，下管水命人禄寿祸福。 平呈山治在健为郡南安县，去成都一百里，北有曹溪，三重南健为志，昔蜀人李阿於此得道上升处。 第二十二，主簿治。 上应井宿，下管金命人禄寿祸福。 主簿山治在健为县界，去成都一百五十里，一名秋长山，南有石室，玉堂，松梧生其前。 昔蜀人王兴於此修道处。 第二十三，玉局治。 上应鬼宿，下管水命人禄寿祸福。 玉局山治，在成都南门左二里。 永寿元年正月七日太上老君乘白鹿，张天师乘白鹤至此地，神涌出玉局，来乘衬云座授道要诀付天师，局床脚四石，见在玉局治前。 第二十四，北郁治。 上应柳宿，卞管土命人禄寿祸福。",
      "translated_text": "Corresponding above to the Net Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Earth destiny.\nThe Houcheng Precinct mountain lies in Nanzheng County of Hanzhong Prefecture. Before it flows a great river, and behind it rise layered mountains. Here grow divine lingzhi mushrooms that never wither for a thousand years. It is also called Huangling Mountain. To its south stretches a long ridge, to its north stands Qinglong Mountain, and to its east, pines and wutong trees mark the site. Formerly, Xia Ziran studied the Dao here and ascended as a flying immortal.\n\nTwentieth: **Gongmu Precinct**.\nCorresponding above to the Turtle Beak Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Metal destiny.\nThe Gongmu Precinct lies in Nanzheng County of Hanzhong Prefecture, one hundred *li* from the precinct. It is also called Beifengxian. To the south of the mountain lies a stone pit, and to its north, a cascading stream. Formerly, Su Zi studied the Dao here.\n\nTwenty-first: **Pingwai Precinct**.\nCorresponding above to the Three Stars Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Water destiny.\nThe Pingwai Precinct mountain lies in Nan’an County of Jianwei Prefecture, one hundred *li* from Chengdu. To its north flows Caoxi Stream. As recorded in the *Jianwei Annals*, a man of Shu, Li A, attained the Dao and ascended here.\n\nTwenty-second: **Zhubu Precinct**.\nCorresponding above to the Well Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Metal destiny.\nThe Zhubu Precinct mountain lies within the borders of Jianwei County, one hundred fifty *li* from Chengdu. It is also called Qiuchang Mountain. To its south stand stone chambers and a jade hall, with pines and wutong trees growing before them. Formerly, a man of Shu, Wang Xing, cultivated the Dao here.\n\nTwenty-third: **Yuju Precinct**.\nCorresponding above to the Ghost Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Water destiny.\nThe Yuju Precinct mountain lies two *li* to the left of the southern gate of Chengdu. On the seventh day of the first month in the first year of Yongshou, the Most High Lord Lao rode a white deer, and Heavenly Master Zhang rode a white crane to this place. A divine jade table emerged, upon which they ascended to a cloud-borne seat. There, the essential Daoist precepts were transmitted to the Heavenly Master. The four stone legs of the table remain before the Yuju Precinct.\n\nTwenty-fourth: **Beiyu Precinct**.\nCorresponding above to the Willow Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Earth destiny.",
      "overlap_context": "ood destiny.\nThe Jinkou Precinct mountain lies in Jiangyang County of Hanzhong Prefecture, two thousand nine hundred twenty *li* from Chengdu. The waters of Hanzhong flow past the mountain, which is also called Pingyuan Mountain. To its west stretches a long ridge, and to its east, a flowing sea. The Water Lord governs here, and it is named the Azure Dragon Gate. Chen Anshi studied the Dao here and ascended as a flying immortal; Anshi was a native of Jingzhao.\n\nNineteenth: **Houcheng Precinct**.",
      "start_char": 13313,
      "end_char": 13771,
      "start_sentence": 524,
      "end_sentence": 544,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.747663021087646,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "北郁山治在河南府洛阳县，梁木在治左右，有大黄出东穴泉南流。 昔务成子得道处。 已上二十四治，皆有州县去处，又张天师地图云：此四治名山，在京师束北，未详州县所管。 第二十五，正互治，在兰武山。 上应星宿，下管水命人禄寿祸福。 第二十六，白石山治，在左极山。 上应张宿，下管金命人禄寿祸福。 第二十七锺茂治，在饭阳山。 上应翼宿，下管水命人禄寿祸福。 第二十八具山治，在元束山。 上应轸宿，下管土命人绿寿祸福。 洞渊集卷之六竟 洞渊集卷之七",
      "translated_text": "The Beiyu Precinct mountain lies in Luoyang County, Henan Prefecture, with a beam-like tree standing to its left and right. A great yellow spring emerges from the eastern cave, flowing southward. This was the place where Master Wucheng attained the Dao.\n\nThe above twenty-four precincts all have known locations in prefectures and counties. However, the *Map of the Earth* by Heavenly Master Zhang states: these four precinct mountains lie northeast of the capital, though their exact prefectural and county jurisdictions remain undetermined.\n\nTwenty-fifth: **Zhengyu Precinct**, located on Lánwǔ Mountain.\nCorresponding above to the Star Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Water destiny.\n\nTwenty-sixth: **Baishi Mountain Precinct**, located on Zuǒjí Mountain.\nCorresponding above to the Spread Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Metal destiny.\n\nTwenty-seventh: **Zhōngmào Precinct**, located on Fànyáng Mountain.\nCorresponding above to the Wing Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Water destiny.\n\nTwenty-eighth: **Jùshān Precinct**, located on Yuánshù Mountain.\nCorresponding above to the Chariot Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Earth destiny.\n\n*Dongyuan Collection*, Scroll Six concluded.\n*Dongyuan Collection*, Scroll Seven.",
      "overlap_context": "h Lord Lao rode a white deer, and Heavenly Master Zhang rode a white crane to this place. A divine jade table emerged, upon which they ascended to a cloud-borne seat. There, the essential Daoist precepts were transmitted to the Heavenly Master. The four stone legs of the table remain before the Yuju Precinct.\n\nTwenty-fourth: **Beiyu Precinct**.\nCorresponding above to the Willow Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Earth destiny.",
      "start_char": 13772,
      "end_char": 14011,
      "start_sentence": 545,
      "end_sentence": 557,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.679598093032837,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "冲妙先生李思聪集 周天十－曜星君 日者，太阳之精，人君之象，日中帝君、仙官、神吏、万众皆修郁仪奔日之道。 日为洞阳之宫，自然化生空青翠玉之林，天官采食花实，身生金光。 日之精黑，化生金乌。 栖其林，朝出旸谷，夕没崎磁，一年一周天。 日宫太阳帝君，上管周天二十八宿星君，天曹注禄寿之司，常以三元万灵天官皆诣日宫，检校世人罪福之目，进呈 上帝，谓之阳宫生籍。 日魂吐九芒之黑，光莹万国。 日名郁仪。 月者，太阴之精，皇后大臣之象。 月中帝君、仙官、神吏，万众皆修结璘奔月之道。 月为广寒洞阴之官，自然化生，青华紫桂之林，亦日绛林。 枝叶红兰，神仙采食华实，寿同日月，升入玉清。 魄精之黑，化生玉兔。 一月一周天，月宫太阴帝君，下管五岳、四读、五湖、四海、十二溪水府，并邓都罗山。 百司常以三元日，冥官僚佐皆诣月宫，校定世人生死罪福之目，呈进上帝，谓之阴宫死籍。 月魄常泛十华之彩，光莹万国，月名结璘。 东方木德星君，木之精。 苍帝之子，光照三十万里，径一百里，十二年一周天。 真君戴星冠，蹑朱履，衣青霞寿鹤之衣，执玉简，垂七宝剑，白玉环佩。 下管人问山林、草木、龙蛇、鱼鳌、水族风雷之事，木之气直行仁和，司於有德。 南方火德，荧域星君，火之精。 赤帝之子，执法之星。 其精下降，为风伯之神。 常以十月入太微受事，光照八十万里，径约一百里，二年一周天。 星君戴星冠，蹑朱履，衣朱霞鹤寿之衣，执玉简，垂七星金剑，白玉环佩，管人问火焰、众虫、凤凰、鸡雉、乌鹊、百劳、群飞、乌雀之类，火德昭彰，巡行天下。 西方金德星君，金之精，白帝之子，主刀兵将军肃杀之威，其精下降为雨师之神。 光照七十万里，径一百里，一年一周天。 星君戴星冠，蹑朱履，衣皓鹤白霞之衣，执玉简，悬七星宝剑，垂白玉环佩，管人问金银、铜、铁、玉石、兔、牛、马、牲、豕、鼠、虫、石人、石马、霜雪之事。 北方水德星君，水之精。 黑帝之子，水德为天心，紫辰之星，正对昆仑之顶处。 紫微之宫，即元气之主。 其精下降为先农之神，主发生物，光照五十万里，径一百里，一年1 周天○ 星君戴星冠，蹑朱履，衣黑霞鹤寿之衣。 执玉简，悬七星宝剑，垂白玉环佩。 管人问水族鲛龙群鱼雪雹凝寒之事。 博大冠五行之首，生万物之根，海渎江河宰酌之事。 中央土德星君，黄帝之子，其精下降为灵。 星之神，光照十二万里，径五十里，二十九年一周天。 星君戴星冠，蹑朱履，衣黄霞鹤寿之衣，执玉简，悬七星宝剑，垂白玉环佩。 管人问兆庶形踝虫蚁之类，雾露虹蜕之属，土宿主信厚万物之事。 罗神首星君，主九天之下一切诸恶，星君戴星冠，蹑朱履，衣纯玄霞云之被，执玉简，垂七星金剑，带白玉环佩。 逆行天道，顺之则昌，逆之则祸。 计都神尾星君，主九天之下一切罪福，多主疾病困苦之灾。 星君戴星冠，蹑朱履，衣纯玄瑞云霞被，执玉简，垂七星金剑，带白玉环佩，逆行天道，不显神光。 顺之则吉，逆之则凶。 天一紫黑星君，戴星冠，蹑朱履，衣紫霞瑞云之被，执玉简，垂七星宝剑，带白玉环佩，长侍紫微垣门，降人问之百福，添禄算之司。",
      "translated_text": "Master Chongmiao Li Sicong’s *Collection of the Ten Celestial Luminaries of the Zhou Tian*\n\nThe Sun is the essence of the Great Yang, the symbol of the sovereign. Within it dwell the Solar Emperor, immortals, divine officials, and myriad beings who cultivate the *Yuyi* path of hastening toward the sun. The Sun is the Palace of Penetrating Yang, naturally giving rise to forests of azure-green jade. Heavenly officials gather and consume its blossoms and fruits, their bodies radiating golden light. The dark essence of the Sun transforms into the Golden Crow. It roosts within these forests, emerging at dawn from the Valley of Yang and setting at dusk in the Crags of Qi, completing one circuit of the heavens each year.\n\nThe Solar Emperor of the Sun Palace governs the twenty-eight stellar sovereigns of the celestial sphere and the celestial bureau that registers life spans and fortunes. At each of the Three Primes, the myriad spirit-officials of heaven all journey to the Sun Palace to review the records of human transgressions and blessings, presenting them to the Supreme Emperor—this is called the *Yang Palace’s Register of Life*.\n\nThe solar soul emits nine rays of darkness, its radiance illuminating the ten thousand lands. The Sun is named *Yuyi*.\n\nThe Moon is the essence of the Great Yin, the symbol of the empress and her ministers. Within it dwell the Lunar Emperor, immortals, divine officials, and myriad beings who cultivate the *Jielin* path of hastening toward the moon. The Moon is the Palace of Vast Cold and Penetrating Yin, naturally giving rise to forests of azure-blossomed purple cassia—also called the Crimson Forest. Its branches and leaves are red as orchids. Immortals gather and consume its blossoms and fruits, their longevity equaling that of the sun and moon, ascending thereafter into the Jade Purity.\n\nThe dark essence of the lunar soul transforms into the Jade Hare. Completing one circuit of the heavens each month, the Lunar Emperor of the Moon Palace governs the Five Peaks, the Four Seas, the Five Lakes, the Twelve Streams, and the water palaces, as well as Fengdu’s Mount Luoshan. At each of the Three Primes, the officials of the underworld and their subordinates all journey to the Moon Palace to review and determine the records of human life, death, transgressions, and blessings, presenting them to the Supreme Emperor—this is called the *Yin Palace’s Register of Death*.\n\nThe lunar soul perpetually suffuses tenfold radiance, its light illuminating the ten thousand lands. The Moon is named *Jielin*.\n\nThe Star Sovereign of Wood Virtue of the East is the essence of Wood, child of the Azure Emperor. His light shines for three hundred thousand *li*, with a diameter of one hundred *li*, completing one circuit of the heavens every twelve years. The Perfected Sovereign wears a star crown, vermilion shoes, and a robe of azure mist and crane-feathered longevity, holding a jade tablet and bearing a seven-jeweled sword, with white jade pendants at his belt. He governs human affairs of mountains, forests, grasses, trees, dragons, serpents, fish, turtles, aquatic creatures, wind, and thunder. The *qi* of Wood moves directly with benevolence and harmony, presiding over those of virtue.\n\nThe Star Sovereign of Fire Virtue of the South, the Flaming Domain, is the essence of Fire, child of the Red Emperor and the star of execution. His essence descends to become the spirit of the Wind Earl. Each tenth month, he enters the Supreme Subtlety to receive his duties. His light shines for eight hundred thousand *li*, with a diameter of approximately one hundred *li*, completing one circuit of the heavens every two years. The Star Sovereign wears a star crown, vermilion shoes, and a robe of vermilion mist and crane-feathered longevity, holding a jade tablet and bearing a seven-star golden sword, with white jade pendants at his belt. He governs human affairs of flames, insects, phoenixes, pheasants, crows, magpies, shrikes, flocks of birds, and sparrows. The virtue of Fire blazes forth, patrolling the world below.\n\nThe Star Sovereign of Metal Virtue of the West is the essence of Metal, child of the White Emperor, wielding the awe of generals and the severity of execution. His essence descends to become the spirit of the Rain Master. His light shines for seven hundred thousand *li*, with a diameter of one hundred *li*, completing one circuit of the heavens each year. The Star Sovereign wears a star crown, vermilion shoes, and a robe of white mist and crane-feathered radiance, holding a jade tablet and bearing a seven-star precious sword, with white jade pendants at his belt. He governs human affairs of gold, silver, copper, iron, jade, stone, hares, oxen, horses, livestock, swine, rats, insects, stone men, stone horses, frost, and snow.\n\nThe Star Sovereign of Water Virtue of the North is the essence of Water, child of the Black Emperor. The virtue of Water is the heart of heaven, the Purple Dawn Star, directly aligned with the summit of Kunlun. The Purple Tenuity Palace is the master of primordial *qi*. His essence descends to become the spirit of the First Farmer, presiding over the generation of beings. His light shines for five hundred thousand *li*, with a diameter of one hundred *li*, completing one circuit of the heavens each year. The Star Sovereign wears a star crown, vermilion shoes, and a robe of black mist and crane-feathered longevity, holding a jade tablet and bearing a seven-star precious sword, with white jade pendants at his belt. He governs human affairs of aquatic creatures, sharks, dragons, schools of fish, snow, hail, and freezing cold. Vast and great, he crowns the Five Phases, root of the myriad beings, and oversees the regulation of seas, rivers, and streams.\n\nThe Star Sovereign of Earth Virtue of the Center is the child of the Yellow Emperor. His essence descends to become the numinous spirit of the stars. His light shines for one hundred twenty thousand *li*, with a diameter of fifty *li*, completing one circuit of the heavens every twenty-nine years. The Star Sovereign wears a star crown, vermilion shoes, and a robe of yellow mist and crane-feathered longevity, holding a jade tablet and bearing a seven-star sword, with white jade pendants at his belt. He governs human affairs of the multitudes, insects, ants, and the like, as well as mist, dew, rainbows, and mirages. The Earth Mansion presides over trustworthiness, generosity, and the affairs of the myriad beings.\n\nThe Star Sovereign of the Demon-Head governs all evils beneath the Nine Heavens. He wears a star crown, vermilion shoes, and a robe of pure dark mist and clouded radiance, holding a jade tablet and bearing a seven-star golden sword, with white jade pendants at his belt. He moves counter to the celestial Way; compliance brings prosperity, defiance brings calamity.\n\nThe Star Sovereign of the Demon-Tail governs all fortunes and misfortunes beneath the Nine Heavens, primarily overseeing disasters of illness and suffering. He wears a star crown, vermilion shoes, and a robe of pure dark auspicious clouded radiance, holding a jade tablet and bearing a seven-star golden sword, with white jade pendants at his belt. He moves counter to the celestial Way, his divine radiance concealed. Compliance brings good fortune, defiance brings misfortune.\n\nThe Star Sovereign of the Celestial Unity and Purple Darkness wears a star crown, vermilion shoes, and a robe of purple mist and auspicious clouds, holding a jade tablet and bearing a seven-star precious sword, with white jade pendants at his belt. He eternally attends the gate of the Purple Tenuity Enclosure, bestowing the hundred blessings upon humanity and overseeing the augmentation of life spans and fortunes.",
      "overlap_context": "mào Precinct**, located on Fànyáng Mountain.\nCorresponding above to the Wing Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Water destiny.\n\nTwenty-eighth: **Jùshān Precinct**, located on Yuánshù Mountain.\nCorresponding above to the Chariot Mansion, governing below the life, fortune, longevity, misfortune, and blessings of those born under the Earth destiny.\n\n*Dongyuan Collection*, Scroll Six concluded.\n*Dongyuan Collection*, Scroll Seven.",
      "start_char": 14011,
      "end_char": 15260,
      "start_sentence": 558,
      "end_sentence": 604,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.72246599197388,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "太一月孛星君，主九天之下一切凶杀。 星君戴星冠，蹑朱履，衣玄霞鹤寿之被，执五简，带七星宝剑，垂白玉环佩。 逆行黑道，顺之则吉，逆之则凶。 右周天十一曜星君。 北斗七元星君 北斗第一天枢，贪狼天英星君。 上管室、氏、房、心、箕、牛、宿，下管扬、郑、一充、徐等州分野，管天下子生人身命禄，筹注世人求宫觅职之事，掌北斗阳明延生真黑。 太上之宫，贪狼星君主日，披朱霞绛霄之被，戴七宝星冠，贪狼即天之太尉，围阔九百里，光照万国。 北斗第二天游，巨门天任星君。 上管亢勖井鬼张翼等宿下管临、荆、楚、周、分野，管天下丑亥生人命禄，注世人求仙学道之事，掌北斗阴精度厄真黑。 中元之宫，巨门星君主月，披玄霞垂云之被，戴七宝星冠，巨门即天之上宰星，围阔五百里，光照万国，主人问悟道修真之府。 北斗第三天机，禄存天柱星君。 上管娄、胃、参、柳等宿，下临宋、豫分野。 管天下寅戌生人命禄，注世人求财庄宅之事，掌北斗真君保命之黑。 真元之宫，禄存即天之司空星，主火，披朱霞瑞云之被，戴七宝星冠，星围七百二十里，光照万国。 北斗第四天权，文曲天心星君。 上应牛、危等宿，下临昊、越分野。 管天下卯酉生人命禄，注世人寿福身相之事，掌北斗文明益等真黑。 纽幽之宫文曲星，主木，披青霞瑞云之被，戴七宝星冠，文曲即天之游击，星围阔八百里，昭一曜万国。 北斗第五天冲，廉贞天禽星君。 上管玄、尾、女等宿，下临赵、冀、魏、晋等分野，管天下辰申生人官禄福命，注世人婚姻妻妾之事，掌北斗丹元消灾真黑。 纲神之宫，廉贞星君，主土，披黄霞瑞云之被，戴七星宝冠，廉贞即天之斗君，星围七百二十里，光照万国。 北斗第六闻阳，武曲天辅星君。 上管房、斗、牛等宿，下临燕国分野。 管天下巳未生人禄命，注世人兴生业次财帛之事，掌北斗北极散祸真黑。 纪明之宫，武曲主木，披青霞瑞云之被，戴七宝星冠。 武曲即天之太常，星围七百里，光照万国。 北斗第七摇光，破军天关星君。 上管虚、翰、角、奎、赀等宿，下临青、齐、卫、并州等分野。 管天下午生人禄命，注世人福德相貌妻妾奴婢之事，掌北斗天关扶衰真黑。 关会之宫，破军星君主金，披素霞之被，戴七宝星冠，破军即天之上宰，星围九百里，光照万国。 洞渊集卷之七竟 洞渊集卷之八",
      "translated_text": "The Star Sovereign of the Great Unity and Lunar Comet oversees all violent deaths beneath the Nine Heavens. He wears a star crown, vermilion shoes, and a robe of dark radiance and crane-longevity clouds, holding five jade tablets and bearing a seven-star precious sword, with white jade pendants at his belt. He moves counter to the black Way—compliance brings good fortune, defiance brings misfortune.\n\nHere end the Eleven Luminaries of the Celestial Circuit.\n\nThe Seven Primordial Star Sovereigns of the Northern Dipper\n\nThe First Star of the Northern Dipper, Celestial Pivot, is the Star Sovereign of Greedy Wolf and Celestial Flower. Above, he governs the lodges of Chamber, Roof, House, Heart, Winnowing Basket, Ox, and below, the regions of Yang, Zheng, Yichong, and Xu. He oversees the life, fate, and official fortune of those born in the *zi* hour, recording the worldly affairs of those seeking office or position, and presides over the True Scripture of Prolonged Life through the Northern Dipper’s Yang Brilliance. The Supreme Palace of the Greedy Wolf Star Sovereign governs the sun. He wears a robe of vermilion radiance and crimson clouds, a seven-jeweled star crown, and serves as the Celestial Grand Commandant. His star spans nine hundred *li*, its light illuminating the ten thousand states.\n\nThe Second Star of the Northern Dipper, Celestial Wanderer, is the Star Sovereign of Gigantic Gate and Celestial Task. Above, he governs the lodges of Neck, Straddler, Well, Ghost, Spread Wings, and below, the regions of Lin, Jing, Chu, and Zhou. He oversees the life, fate, and official fortune of those born in the *chou* and *hai* hours, recording the worldly affairs of those seeking immortality and cultivating the Dao, and presides over the True Scripture of Calamity Transcendence through the Northern Dipper’s Yin Essence. The Middle Primordial Palace of the Gigantic Gate Star Sovereign governs the moon. He wears a robe of dark radiance and trailing clouds, a seven-jeweled star crown, and serves as the Celestial Grand Minister. His star spans five hundred *li*, its light illuminating the ten thousand states, and he presides over the court of awakening and Daoist cultivation.\n\nThe Third Star of the Northern Dipper, Celestial Mechanism, is the Star Sovereign of Emolument Storehouse and Celestial Pillar. Above, he governs the lodges of Bond, Stomach, Three Stars, and Willow, and below, the regions of Song and Yu. He oversees the life, fate, and official fortune of those born in the *yin* and *xu* hours, recording the worldly affairs of those seeking wealth and estates, and presides over the True Scripture of Life Preservation through the Northern Dipper’s True Lord. The True Primordial Palace of the Emolument Storehouse Star Sovereign governs fire. He wears a robe of vermilion radiance and auspicious clouds, a seven-jeweled star crown, and serves as the Celestial Minister of Works. His star spans seven hundred and twenty *li*, its light illuminating the ten thousand states.\n\nThe Fourth Star of the Northern Dipper, Celestial Balance, is the Star Sovereign of Literary Curve and Celestial Heart. Above, he governs the lodges of Ox and Rooftop, and below, the regions of Wu and Yue. He oversees the life, fate, and official fortune of those born in the *mao* and *you* hours, recording the worldly affairs of longevity, fortune, and physical appearance, and presides over the True Scripture of Literary Brilliance and Beneficence through the Northern Dipper. The Darkly Twisted Palace of the Literary Curve Star Sovereign governs wood. He wears a robe of blue-green radiance and auspicious clouds, a seven-jeweled star crown, and serves as the Celestial Itinerant Inspector. His star spans eight hundred *li*, its single brilliance illuminating the ten thousand states.\n\nThe Fifth Star of the Northern Dipper, Celestial Impulse, is the Star Sovereign of Integrity and Chastity and Celestial Bird. Above, he governs the lodges of Dark Warrior, Tail, and Woman, and below, the regions of Zhao, Ji, Wei, and Jin. He oversees the official fortune, fate, and blessings of those born in the *chen* and *shen* hours, recording the worldly affairs of marriage and concubines, and presides over the True Scripture of Disaster Dispelling through the Northern Dipper’s Cinnabar Primordium. The Palace of the Webbed Spirit of the Integrity and Chastity Star Sovereign governs earth. He wears a robe of yellow radiance and auspicious clouds, a seven-star precious crown, and serves as the Celestial Dipper Lord. His star spans seven hundred and twenty *li*, its light illuminating the ten thousand states.\n\nThe Sixth Star of the Northern Dipper, Celestial Yang, is the Star Sovereign of Martial Brilliance and Celestial Assistance. Above, he governs the lodges of House, Dipper, and Ox, and below, the region of Yan. He oversees the official fortune and fate of those born in the *si* and *wei* hours, recording the worldly affairs of livelihood, career, and wealth, and presides over the True Scripture of Disaster Dispersal through the Northern Dipper’s Northern Culmen. The Palace of the Bright Record of the Martial Brilliance Star Sovereign governs wood. He wears a robe of blue-green radiance and auspicious clouds, a seven-jeweled star crown, and serves as the Celestial Grand Master of Ceremonies. His star spans seven hundred *li*, its light illuminating the ten thousand states.\n\nThe Seventh Star of the Northern Dipper, Shimmering Brilliance, is the Star Sovereign of Ruptured Army and Celestial Pass. Above, he governs the lodges of Void, Wings, Horn, Straddler, and Base, and below, the regions of Qing, Qi, Wei, and Bingzhou. He oversees the official fortune and fate of those born in the *wu* hour, recording the worldly affairs of fortune, virtue, appearance, wives, concubines, servants, and maids, and presides over the True Scripture of Decline Support through the Northern Dipper’s Celestial Pass. The Palace of the Convergent Pass of the Ruptured Army Star Sovereign governs metal. He wears a robe of plain radiance, a seven-jeweled star crown, and serves as the Celestial Grand Minister. His star spans nine hundred *li*, its light illuminating the ten thousand states.\n\nHere ends Scroll Seven of the *Dongyuan Collection*.\nScroll Eight of the *Dongyuan Collection* begins.",
      "overlap_context": "e radiance concealed. Compliance brings good fortune, defiance brings misfortune.\n\nThe Star Sovereign of the Celestial Unity and Purple Darkness wears a star crown, vermilion shoes, and a robe of purple mist and auspicious clouds, holding a jade tablet and bearing a seven-star precious sword, with white jade pendants at his belt. He eternally attends the gate of the Purple Tenuity Enclosure, bestowing the hundred blessings upon humanity and overseeing the augmentation of life spans and fortunes.",
      "start_char": 15261,
      "end_char": 16191,
      "start_sentence": 605,
      "end_sentence": 637,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.221848726272583,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "冲妙先生李思聪集 周天二十八宿星君降灵 东方七宿青龙之精 角宿天门星君，上应太焕极瑶天，照临郑国分野掌海外伽密国、夜市国、迦陵国、并九小国，下管人问将军、兵甲、雨泽、延生、农田、耕稼之司。 亢宿天庭星君，上应玄明恭庆天，照临郑国分野，掌海外西天竺国，乾拖国、罗谢飓国，并九小国，下管人间瘟灾、大风、扬石、百药、国师三公、五老、百官禄秩之司。 氏宿天府星君，上应观明端静天，照临郑国分野，掌海外迦业国、弥罗国、新头国、毗摩国，并九小国，下管人问后妃、宫府、山林、草木、雨水淫泱之司。 房宿天驷星君，上应虚明堂曜天，照临宋国分野，掌海外豁寻国、勃律国、黑衣国、并九小国，下管人问后妃藏内、宝器金玉管钥，惊风骇雨，负重擎骆之司。 心宿天王星君，上应廿一落皇崖天。 照临宋国分野，掌海外大食国、独足国，并九小国，下管人间帝王、明堂、雨泽、工役、仗艺、百巧之司。 尾宿天鹦星君，上应耀明宗飘天，照临燕国分野，掌海外唇宾国、计罗国、多乌国并九小国，下管人问祥云瑞雾、女人不和之司。 箕宿天律星君，上应玄明恭华天，照临燕国分野，掌海外糠国、解苏国，并九小国，下管人问斜风细雨、奸邪谄佞、蛮夷狐格、肤狄、津梁水族之司。 北方七宿玄武之精 斗宿天府星君，上应太极蒙翳天，照临昊国分野，掌海外吐火罗国、穿鼻国、西皇母国，并九小国，下管人问进士登科爵禄微风钿雨斛斗升合秤尺之司。 牛宿天机星君，上应虚无越衡天，照临昊国分野，掌海外北番黑山三大部落国，并九小国，下管人问云雾霜雪、牛羊六畜牺牲、足虫百兽、南越百蛮之司。 女宿天女星君，上应上明七曜摩夷天，昭一临昊国分野，掌海外坚发国、女国、狗国，并九小国，下管人间裁缝衣物、嫁娶娉偶、阴凝大风之司。 虚宿天府星君，上应元明文举天。 照临齐国分野，掌海外拂林国、无影国、木枝国，并九小国，下管人问宫室庙堂盖屋、祭祀考妣、五虚六耗悲泣之司。 危宿天钱星君，上应玄胎平育天。 照临齐国分野，掌海外土番国、同国、束天竺国，并九小国，下管人间丘陵坟墓，悲泣、旋风、砂石、危厄险难之司。 室宿天凛星君，上应清明何童天，照临卫国分野，掌海外金山十姓、九姓、三大部落国，并九小国，下管人问宫室、金户、玉堂、文章、围籍、军料府库阴翳凝滞之司。 璧宿天市星君，上应太明玉完天，照临卫国分野，掌海外龟兹国，于阗国、疏勒国，并九小国，下管人问文章，图书、秘府、阴寒雨泽、霹雳、五谷百果之司。 西方七宿白虎之精 奎宿天将星君，上应太极平育贾奕天，昭一临鲁国分野，掌海外单于国、地亢国、火胡国，并九小国，下管人问武库兵甲戈矛，沟读池亭、风雨雷电之司。 、 娄宿天狱星君，上应龙变梵度天，照临鲁国分野，掌海外三山国、仙官国，并九小国，下管人问宫观寺院、禁苑内庭、供给牺牲、郊杞斋醮之司。 冑宿天仓星君，上应太释玉隆天，照临赵国分野，掌海外高丽国、扶余国、南竺国．并九小‘国，下管人间仓库、积聚金银珍宝疋帛、雷公五谷之司。 昴宿天目星君，上应太虚无上常融天，照临赵国分野，掌海外舍卫国、麾陆国、北天竺国，并九小国，下管人问天地晴明去衰除祸狱典曹吏刑罚囚系考决之司。",
      "translated_text": "Master Chongmiao Li Sicong’s Compilation\n*The Descent of the Spirits of the Twenty-Eight Lunar Lodges of the Celestial Circuit*\n\n**The Essence of the Azure Dragon: The Seven Eastern Lodges**\n*Lodge of the Horn, Celestial Gate Star Sovereign* – Above, it aligns with the Supreme Radiance of the Jade Heaven of Great Splendor; below, it illumines the terrestrial domain of Zheng. It governs the outer seas of the kingdoms of Qiemi, Yeshi, Jialing, and nine lesser states, and below, oversees the affairs of human generals, armaments, rainfall, life-prolonging blessings, agriculture, and the cultivation of fields.\n\n*Lodge of the Neck, Celestial Court Star Sovereign* – Above, it aligns with the Dark Luminance of the Reverent Celebration Heaven; below, it illumines the terrestrial domain of Zheng. It governs the outer seas of the Western Heavenly Realm of India, the kingdoms of Gandhara, Luoxie, and nine lesser states, and below, oversees the affairs of human pestilence, gales, flying stones, medicinal herbs, the Three Dukes, the Five Elders, and the official ranks of the hundred officers.\n\n*Lodge of the Root, Celestial Treasury Star Sovereign* – Above, it aligns with the Observant Luminance of the Upright Serenity Heaven; below, it illumines the terrestrial domain of Zheng. It governs the outer seas of the kingdoms of Jiaye, Milo, Xintou, and Pimo, and nine lesser states, and below, oversees the affairs of human empresses, palace bureaus, mountains, forests, grasses, trees, and excessive rainfall.\n\n*Lodge of the Chamber, Celestial Steed Star Sovereign* – Above, it aligns with the Void Luminance of the Hall of Brilliance Heaven; below, it illumines the terrestrial domain of Song. It governs the outer seas of the kingdoms of Huoxun, Bolü, Heiyi, and nine lesser states, and below, oversees the affairs of human empresses’ inner chambers, treasures, jade, keys, startling winds, torrential rains, and the bearing of heavy burdens.\n\n*Lodge of the Heart, Celestial King Star Sovereign* – Above, it aligns with the Twenty-First Heaven of Falling August Cliffs; below, it illumines the terrestrial domain of Song. It governs the outer seas of the kingdoms of Dashi, Duzu, and nine lesser states, and below, oversees the affairs of human emperors, the Hall of Light, rainfall, corvée labor, martial arts, and the hundred crafts.\n\n*Lodge of the Tail, Celestial Phoenix Star Sovereign* – Above, it aligns with the Radiant Luminance of the Ancestral Drifting Heaven; below, it illumines the terrestrial domain of Yan. It governs the outer seas of the kingdoms of Zhenbin, Jiluo, Duowu, and nine lesser states, and below, oversees the affairs of human auspicious clouds, propitious mists, and discord among women.\n\n*Lodge of the Winnowing Basket, Celestial Law Star Sovereign* – Above, it aligns with the Dark Luminance of the Reverent Splendor Heaven; below, it illumines the terrestrial domain of Yan. It governs the outer seas of the kingdoms of Kang, Jiesu, and nine lesser states, and below, oversees the affairs of human slanting winds, fine rains, treachery, flattery, barbarians, foxes, northern tribes, and aquatic creatures of ferries and waterways.\n\n**The Essence of the Dark Warrior: The Seven Northern Lodges**\n*Lodge of the Dipper, Celestial Treasury Star Sovereign* – Above, it aligns with the Supreme Ultimate of the Veiled Heaven; below, it illumines the terrestrial domain of Wu. It governs the outer seas of the kingdoms of Tuhuoluo, Chuanbi, and the Queen Mother of the West, and nine lesser states, and below, oversees the affairs of human examination graduates, official ranks, gentle winds, fine rains, measures of *hu*, *dou*, *sheng*, and *ge*, and scales.\n\n*Lodge of the Ox, Celestial Mechanism Star Sovereign* – Above, it aligns with the Void of the Transcendent Balance Heaven; below, it illumines the terrestrial domain of Wu. It governs the outer seas of the three great tribal kingdoms of the Black Mountains in the northern frontier, and nine lesser states, and below, oversees the affairs of human clouds, fog, frost, snow, cattle, sheep, the six livestock, sacrificial animals, insects, and the hundred beasts, as well as the southern barbarians.\n\n*Lodge of the Maiden, Celestial Maiden Star Sovereign* – Above, it aligns with the Supreme Luminance of the Seven Luminaries of the Majestic Heaven; below, it illumines the terrestrial domain of Wu. It governs the outer seas of the kingdoms of Jianfa, Nüguo, and Gouguo, and nine lesser states, and below, oversees the affairs of human tailoring, clothing, marriages, betrothals, and congealing yin winds.\n\n*Lodge of the Void, Celestial Treasury Star Sovereign* – Above, it aligns with the Primordial Luminance of the Literary Elevation Heaven; below, it illumines the terrestrial domain of Qi. It governs the outer seas of the kingdoms of Fulin, Wuying, and Muzhi, and nine lesser states, and below, oversees the affairs of human palaces, ancestral halls, roofed dwellings, ancestral sacrifices, the Five Depletions, the Six Wastes, and lamentations.\n\n*Lodge of the Rooftop, Celestial Coin Star Sovereign* – Above, it aligns with the Primordial Womb of the Balanced Nurturance Heaven; below, it illumines the terrestrial domain of Qi. It governs the outer seas of the kingdoms of Tufan, Tongguo, and Eastern India, and nine lesser states, and below, oversees the affairs of human hills, graves, lamentations, whirlwinds, sand, stones, dangers, and perils.\n\n*Lodge of the House, Celestial Chill Star Sovereign* – Above, it aligns with the Pure Luminance of the Harmonious Child Heaven; below, it illumines the terrestrial domain of Wei. It governs the outer seas of the kingdoms of the Ten Tribes of Jinshan, the Nine Tribes, and the Three Great Tribal Kingdoms, and nine lesser states, and below, oversees the affairs of human palaces, golden gates, jade halls, literature, archives, military provisions, and congealed yin stagnation.\n\n*Lodge of the Wall, Celestial Market Star Sovereign* – Above, it aligns with the Supreme Luminance of the Jade Perfection Heaven; below, it illumines the terrestrial domain of Wei. It governs the outer seas of the kingdoms of Qiuci, Yutian, and Shule, and nine lesser states, and below, oversees the affairs of human literature, maps, books, secret repositories, cold rains, thunderclaps, and the hundred grains and fruits.\n\n**The Essence of the White Tiger: The Seven Western Lodges**\n*Lodge of the Straddler, Celestial General Star Sovereign* – Above, it aligns with the Supreme Ultimate of the Balanced Nurturance of the Illustrious Heaven; below, it illumines the terrestrial domain of Lu. It governs the outer seas of the kingdoms of Chanyu, Dikang, and Huohu, and nine lesser states, and below, oversees the affairs of human armories, weapons, spears, moats, ponds, pavilions, and wind, rain, thunder, and lightning.\n\n*Lodge of the Bond, Celestial Prison Star Sovereign* – Above, it aligns with the Dragon Transformation of the Brahmanic Attainment Heaven; below, it illumines the terrestrial domain of Lu. It governs the outer seas of the kingdoms of Sanshan and Xianguan, and nine lesser states, and below, oversees the affairs of human temples, monasteries, imperial parks, inner courts, sacrificial offerings, suburban sacrifices, and Daoist fasts.\n\n*Lodge of the Turtle Beak, Celestial Granary Star Sovereign* – Above, it aligns with the Supreme Release of the Jade Dragon Heaven; below, it illumines the terrestrial domain of Zhao. It governs the outer seas of the kingdoms of Gaoli, Fuyu, and Southern India, and nine lesser states, and below, oversees the affairs of human granaries, accumulated gold, silver, treasures, silks, and the Lord of Thunder and the five grains.\n\n*Lodge of the Mane, Celestial Eye Star Sovereign* – Above, it aligns with the Supreme Void of the Unsurpassed Constant Fusion Heaven; below, it illumines the terrestrial domain of Zhao. It governs the outer seas of the kingdoms of Shewei, Huilu, and Northern India, and nine lesser states, and below, oversees the affairs of human celestial clarity, the removal of misfortune, prisons, judicial offices, punishments, imprisonment, interrogation, and execution.",
      "overlap_context": "servants, and maids, and presides over the True Scripture of Decline Support through the Northern Dipper’s Celestial Pass. The Palace of the Convergent Pass of the Ruptured Army Star Sovereign governs metal. He wears a robe of plain radiance, a seven-jeweled star crown, and serves as the Celestial Grand Minister. His star spans nine hundred *li*, its light illuminating the ten thousand states.\n\nHere ends Scroll Seven of the *Dongyuan Collection*.\nScroll Eight of the *Dongyuan Collection* begins.",
      "start_char": 16191,
      "end_char": 17515,
      "start_sentence": 638,
      "end_sentence": 664,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.12781310081482,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "毕宿天耳星君，上应太素秀乐禁上天，韶一临赵国分野，掌海外震旦国、雪山国、龙中天主国，并九小国、下管人问天地开泰、朱轮宝盖、边兵守境、封疆安静之司。 觜宿天屏星君，上应太文翰宠妙成天，照临晋国分野，掌海外婆罗门国、水不毗耶国、摘棘国，并九小国，下管人间收敛万物、风雷雨泽、山川房庙、鬼魅妖怪之司。 参宿天水星君，上应渊通元洞天，照临晋国分野，掌海外毗汉国，覆照国、雕题国，并九小国，下管人问将军权衡境域杀罚冤条劫夺忿悦之司。 南方七宿朱雀之精 井宿天井星君，上应无极昙誓天，照临秦国分野、掌海外真猎国、林邑国、身形国，并九小国，下管人间天色昏暗池塘陂井桥梁大水江湖鱼龙介族之司。 鬼宿天匮星君，上应上蝶阮乐天，照临秦国分野，掌梅外交趾国、文身国、随罗国，并九小国，下管人问积主、金玉疋帛、丧祸呎诅、毒药司察奸恶之司。 柳宿天厨星君，上应无思江由天，照临周国分野，掌海外昆明国、蛮尾国、甘露国，并九小国，下管人问庖厨食味、天色昏黄、雷雨兵戈草贼之司。 星宿天库星君，上应太皇翁重浮容天，昭一临周国分野，掌海外束天廿一国、泥婆国、狗头国，并九小国，下管人问裁缝、衣装文绣、晴明刀剑血光之司。 张宿天秤星君，上应始皇孝芒天、照临周国分野，掌海外弘誓国、诃陵国、婆利国，并九小国，下管人问宗庙、珍宝、衣服、赐宴、宾客、寒热时、炁不和大寒热、父子不睦、兄弟不和之司。 翼宿天都星君，上应显定极风天，昭一临楚国分野，掌海外棱伽国、婆踵国、没罗国，并九小国，下管人问乐府、调五音六律、水府鱼龙、飞走群毛万类之司。 轸宿天阶星君，上应太安皇崖天，照临楚国分野，掌海外南天竺国、耽身国、师子国，并九小国，下管人问天地明朗、哭泣离别、官府口舌凶恶危难之司。 洞渊集卷之八竟 洞渊集卷之九",
      "translated_text": "**Lodge of the Net, Celestial Ear Star Sovereign** – Above, it aligns with the Supreme Essence and Joyous Prohibition Heaven; below, it illumines the terrestrial domain of Zhao. It governs the outer seas of the kingdoms of Zhendan, Snow Mountain, and Dragon Central Heavenly Lord, and nine lesser states, and below, oversees the affairs of human celestial-terrestrial harmony, vermilion chariots and jeweled canopies, border troops and frontier defense, and the pacification of territories.\n\n**Lodge of the Turtle Beak, Celestial Screen Star Sovereign** – Above, it aligns with the Supreme Literary Brilliance and Wondrous Completion Heaven; below, it illumines the terrestrial domain of Jin. It governs the outer seas of the kingdoms of Brahmin, Water-Non-Adjacent, and Thorn-Plucking, and nine lesser states, and below, oversees the affairs of human harvest and storage of the myriad things, wind, thunder, rain, and moisture, mountains and rivers, dwellings and ancestral temples, and the suppression of ghosts, demons, and malevolent spirits.\n\n**Lodge of the Three Stars, Celestial Water Star Sovereign** – Above, it aligns with the Abyssal Permeation of the Primordial Grotto Heaven; below, it illumines the terrestrial domain of Jin. It governs the outer seas of the kingdoms of Pihan, Overturned Illumination, and Tattooed Forehead, and nine lesser states, and below, oversees the affairs of human generals, scales of authority, territorial boundaries, executions, grievances, robbery, plunder, and violent disputes.\n\n**Essence of the Vermilion Bird of the Southern Seven Lodges**\n\n**Lodge of the Well, Celestial Well Star Sovereign** – Above, it aligns with the Non-Ultimate Dharma-Oath Heaven; below, it illumines the terrestrial domain of Qin. It governs the outer seas of the kingdoms of True Hunting, Linyi, and Body-Form, and nine lesser states, and below, oversees the affairs of human celestial dimness, ponds, embankments, wells, bridges, great waters, rivers, lakes, and the fish and dragon clans.\n\n**Lodge of the Ghost, Celestial Repository Star Sovereign** – Above, it aligns with the Supreme Butterfly Joy Heaven; below, it illumines the terrestrial domain of Qin. It governs the outer seas of the kingdoms of Jiaozhi, Tattooed Body, and Suiluo, and nine lesser states, and below, oversees the affairs of human accumulation and storage, gold, jade, silks, funerary misfortune, curses, poisonous medicines, and the investigation of treachery and evil.\n\n**Lodge of the Willow, Celestial Kitchen Star Sovereign** – Above, it aligns with the Non-Thought River Origin Heaven; below, it illumines the terrestrial domain of Zhou. It governs the outer seas of the kingdoms of Kunming, Barbarian Tail, and Sweet Dew, and nine lesser states, and below, oversees the affairs of human kitchens and flavors, celestial dimness, thunder, rain, weapons, and banditry.\n\n**Lodge of the Star, Celestial Treasury Star Sovereign** – Above, it aligns with the Supreme August Venerable Floating Countenance Heaven; below, it illumines the terrestrial domain of Zhou. It governs the outer seas of the Twenty-One Eastern Heavenly Kingdoms, Mudha, and Dog-Head, and nine lesser states, and below, oversees the affairs of human tailoring, clothing, embroidery, celestial clarity, swords, and bloodshed.\n\n**Lodge of the Extended Net, Celestial Balance Star Sovereign** – Above, it aligns with the Primordial Filial Purity Heaven; below, it illumines the terrestrial domain of Zhou. It governs the outer seas of the kingdoms of Great Vow, Haling, and Bali, and nine lesser states, and below, oversees the affairs of human ancestral temples, treasures, clothing, banquets, guests, seasonal cold and heat, disharmony of qi, extreme cold and heat, discord between father and son, and strife between brothers.\n\n**Lodge of the Wings, Celestial Capital Star Sovereign** – Above, it aligns with the Manifestly Fixed Ultimate Wind Heaven; below, it illumines the terrestrial domain of Chu. It governs the outer seas of the kingdoms of Lengjia, Bazhong, and Moluo, and nine lesser states, and below, oversees the affairs of human music bureaus, tuning of the five notes and six pitches, aquatic palaces of fish and dragons, and the flying, walking, and feathered multitudes.\n\n**Lodge of the Chariot, Celestial Stair Star Sovereign** – Above, it aligns with the Supreme Peaceful August Cliff Heaven; below, it illumines the terrestrial domain of Chu. It governs the outer seas of the kingdoms of Southern India, Dānshēn, and Lion, and nine lesser states, and below, oversees the affairs of human celestial-terrestrial brightness, weeping and parting, official disputes, and perilous calamities.\n\n*Dongyuan Collection, Scroll Eight Concluded*\n*Dongyuan Collection, Scroll Nine*",
      "overlap_context": "e Lord of Thunder and the five grains.\n\n*Lodge of the Mane, Celestial Eye Star Sovereign* – Above, it aligns with the Supreme Void of the Unsurpassed Constant Fusion Heaven; below, it illumines the terrestrial domain of Zhao. It governs the outer seas of the kingdoms of Shewei, Huilu, and Northern India, and nine lesser states, and below, oversees the affairs of human celestial clarity, the removal of misfortune, prisons, judicial offices, punishments, imprisonment, interrogation, and execution.",
      "start_char": 17516,
      "end_char": 18272,
      "start_sentence": 665,
      "end_sentence": 677,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.563309907913208,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 22,
      "original_text": "冲妙先生李思聪集 上清三十二天帝宫神 太黄皇曾天，分东方第一清微天帝，元阳之炁，此天炁黄系东方梵天，管天下长生之籍，系欲界。 大明玉完天，分东方第二禹余天帝，上阳之炁，此天炁绿化生璧宿，管天下救度九幽长夜之魂，更生之籍，系欲界。 清明何童天，分东方第三太赤天帝，太阳之炁，此天炁青化生室宿，管天下演教度人之籍，系欲界。 玄胎平育天，分东方第四无量天帝，系九天第一青阳天炁，此天炁赤化生危宿、管天下召魂入仙之籍，系欲界。 元明文举天，分东方第五无量寿天帝，系九天第二洞阳之炁，此天炁苍色化生虚宿，管天下流通元炁之籍，系欲界。 上明七曜摩夷天，分东方第六梵卧〈 天帝，位通阳之炁，此天炁炁化生女宿，管天下开通幽难之籍，系欲界。 虚无越衡天，分东方第七兜术天帝，位建阳之炁，此天炁碧化生牛宿，管中天星宿宫神仙之籍，系色界。 太极蒙翳天，分东方第八不骄乐天帝，位东极阳之炁，此天炁紫化生斗宿，管天下度炼朽骸之籍，系色界。 赤明和阳天，分南方第一化应声天帝，位始阳之炁，此天炁白系南方梵炁，管天下炼仙成真之籍，系色界。 玄明恭华天，分南方第二梵辅天帝，位肠晖之炁，此天炁黄化生箕宿，管天下一切万物变化之籍，系色界。 耀明宗飘天，分南方第三无爱天帝，位阳晖之炁，此天炁绿化生尾宿，管天下举功行学仙之士文籍，系色界。 竺落皇茄天，分南方第四答愁皇曾天帝，位阳明之炁，此天炁青化生心宿，管天下魔王学仙之人名籍，系色界。 虚明堂曜天，分南方第五梵明天帝，位阳演之炁，此天炁赤化生房宿，管天下天仙地仙成功之籍，系色界。 观明端靖天，分南方第六摩杂想天帝，位阳明之炁，此天炁苍色化生氏宿，管天下仙人身名之籍，系色界。 玄明恭庆天，分南方第七亿罗天帝，位阳浩之炁，此天炁黄色化生亢宿，管天下学道至人之籍，系色界。 太焕极瑶天，分南方第八那育天帝，位阳极之炁，此天炁碧色化生角宿，管天下教道仙人之籍，系色界。 元载孔升天，分西方第一梁梨恭首天帝，位少阳之炁，此天炁紫系西方梵炁，管天下度魂更生之籍，系色界。 太安皇崖天，分西方第二首来天帝，位太阳之炁，此天炁白化生翰宿，管天下开度善人升仙之籍，系色界。 显定极风天，分西方第三首为稽那天帝，位浩阳之炁，此天炁黄化生翼宿，管天下苦魂善魄之籍，系色界。 始皇孝芒天，分西方第四阿那迦波罗天帝，位洞阴之炁，此天炁绿化生张宿，管天下九幽长夜之魂鬼籍，系色界。 太皇访重浮容天，分西方第五波，澜缠罗离和天帝，位通阴之炁，此天为青化, 生星宿，管天下召魂集真之籍，系色界。 无思江由天，分西方第六梵明元黄天帝，位玄阴之炁，此天炁赤化生抑宿，管天下开度长夜死魂之籍，系色界。 上碟阮乐天，分西方第七蔡释元天帝，位浩阴之为，此天炁苍色化生鬼宿，管天下品量天人功行之籍，系色界。 无极昙誓天，、分西方第八阿梨想天帝，位极阴之炁，此天炁炁色化生井宿，管天下一切神仙品位之籍，系色界。 皓庭霄度天，分北方第一答想天帝，位阴生之炁，此天炁系北方梵炁，其炁紫管天下拔度至人升仙之籍，系色界。",
      "translated_text": "**Master Chongmiao Li Sicong’s Compilation of the Divine Palaces of the Thirty-Two Heavens of Supreme Purity**\n\n**Great Yellow August Layered Heaven** – Allotted to the First Heaven of the Eastern Direction, the Heaven of Pure Tenuity, ruled by the Celestial Emperor of Primordial Yang *qi*. The *qi* of this heaven is yellow, linked to the Brahma Heaven of the East. It governs the registers of long life throughout the world, belonging to the Realm of Desire.\n\n**Great Brightness Jade Perfection Heaven** – Allotted to the Second Heaven of the Eastern Direction, the Heaven of Yu Remnant, ruled by the Celestial Emperor of Upper Yang *qi*. The *qi* of this heaven is green, transforming and giving rise to the Wall Mansion. It governs the registers of salvation and deliverance for the souls of the Nine Dark Realms of Eternal Night, and the records of rebirth, belonging to the Realm of Desire.\n\n**Luminous Harmonious Childlike Heaven** – Allotted to the Third Heaven of the Eastern Direction, the Heaven of Great Crimson, ruled by the Celestial Emperor of Grand Yang *qi*. The *qi* of this heaven is blue, transforming and giving rise to the House Mansion. It governs the registers of propagating teachings to deliver humankind, belonging to the Realm of Desire.\n\n**Mysterious Womb Nurturing Heaven** – Allotted to the Fourth Heaven of the Eastern Direction, the Heaven of Immeasurable Vastness, ruled by the Celestial Emperor of the First Green Yang *qi* of the Nine Heavens. The *qi* of this heaven is red, transforming and giving rise to the Rooftop Mansion. It governs the registers of summoning souls to enter immortality, belonging to the Realm of Desire.\n\n**Primordial Brightness Literary Eminence Heaven** – Allotted to the Fifth Heaven of the Eastern Direction, the Heaven of Immeasurable Longevity, ruled by the Celestial Emperor of the Second Cavernous Yang *qi* of the Nine Heavens. The *qi* of this heaven is dark green, transforming and giving rise to the Emptiness Mansion. It governs the registers of circulating primordial *qi* throughout the world, belonging to the Realm of Desire.\n\n**Upper Brightness Seven Luminaries Māyā Heaven** – Allotted to the Sixth Heaven of the Eastern Direction, ruled by the Celestial Emperor of Interpenetrating Yang *qi*. The *qi* of this heaven transforms and gives rise to the Woman Mansion. It governs the registers of opening and delivering those in hidden peril, belonging to the Realm of Desire.\n\n**Void Transcending Balance Heaven** – Allotted to the Seventh Heaven of the Eastern Direction, the Heaven of Tuṣita, ruled by the Celestial Emperor of Established Yang *qi*. The *qi* of this heaven is jade green, transforming and giving rise to the Ox Mansion. It governs the registers of the divine immortals of the stellar palaces of the Central Heaven, belonging to the Realm of Form.\n\n**Supreme Ultimate Veiled Heaven** – Allotted to the Eighth Heaven of the Eastern Direction, the Heaven of Joy Without Arrogance, ruled by the Celestial Emperor of Eastern Ultimate Yang *qi*. The *qi* of this heaven is purple, transforming and giving rise to the Dipper Mansion. It governs the registers of delivering and refining decayed remains, belonging to the Realm of Form.\n\n**Crimson Brightness Harmonious Yang Heaven** – Allotted to the First Heaven of the Southern Direction, the Heaven of Transforming Responsive Sounds, ruled by the Celestial Emperor of Initial Yang *qi*. The *qi* of this heaven is white, linked to the Brahma *qi* of the South. It governs the registers of refining immortals to achieve perfection, belonging to the Realm of Form.\n\n**Mysterious Brightness Reverent Splendor Heaven** – Allotted to the Second Heaven of the Southern Direction, the Heaven of Brahma Assistance, ruled by the Celestial Emperor of Intestinal Radiance *qi*. The *qi* of this heaven is yellow, transforming and giving rise to the Winnowing Basket Mansion. It governs the registers of all transformations of the myriad things, belonging to the Realm of Form.\n\n**Radiant Brightness Ancestral Whirlwind Heaven** – Allotted to the Third Heaven of the Southern Direction, the Heaven of No Love, ruled by the Celestial Emperor of Yang Radiance *qi*. The *qi* of this heaven is green, transforming and giving rise to the Tail Mansion. It governs the records of those who cultivate merit, conduct, and study to attain immortality, belonging to the Realm of Form.\n\n**Bamboo Grove August Gourd Heaven** – Allotted to the Fourth Heaven of the Southern Direction, the Heaven of Responding to Sorrow, ruled by the Celestial Emperor of Yang Brightness *qi*. The *qi* of this heaven is blue, transforming and giving rise to the Heart Mansion. It governs the registers of demon kings and those who study immortality, belonging to the Realm of Form.\n\n**Void Brightness Hall Luminance Heaven** – Allotted to the Fifth Heaven of the Southern Direction, the Heaven of Brahma Brilliance, ruled by the Celestial Emperor of Yang Evolution *qi*. The *qi* of this heaven is red, transforming and giving rise to the Chamber Mansion. It governs the registers of celestial and terrestrial immortals who have achieved success, belonging to the Realm of Form.\n\n**Observant Brightness Upright Tranquility Heaven** – Allotted to the Sixth Heaven of the Southern Direction, the Heaven of Māra’s Varied Thoughts, ruled by the Celestial Emperor of Yang Brightness *qi*. The *qi* of this heaven is dark green, transforming and giving rise to the Clan Mansion. It governs the registers of the names and forms of immortals, belonging to the Realm of Form.\n\n**Mysterious Brightness Reverent Celebration Heaven** – Allotted to the Seventh Heaven of the Southern Direction, the Heaven of Countless Joys, ruled by the Celestial Emperor of Vast Yang *qi*. The *qi* of this heaven is yellow, transforming and giving rise to the Neck Mansion. It governs the registers of those who have attained the Dao, belonging to the Realm of Form.\n\n**Great Radiance Ultimate Jade Heaven** – Allotted to the Eighth Heaven of the Southern Direction, the Heaven of Nurturing Growth, ruled by the Celestial Emperor of Ultimate Yang *qi*. The *qi* of this heaven is jade green, transforming and giving rise to the Horn Mansion. It governs the registers of teaching the Dao to immortals, belonging to the Realm of Form.\n\n**Primordial Support Ascending Aperture Heaven** – Allotted to the First Heaven of the Western Direction, the Heaven of Fragrant Glory, ruled by the Celestial Emperor of Lesser Yang *qi*. The *qi* of this heaven is purple, linked to the Brahma *qi* of the West. It governs the registers of delivering souls to rebirth, belonging to the Realm of Form.\n\n**Supreme Peaceful August Cliff Heaven** – Allotted to the Second Heaven of the Western Direction, the Heaven of Arriving Heads, ruled by the Celestial Emperor of Grand Yang *qi*. The *qi* of this heaven is white, transforming and giving rise to the Wings Mansion. It governs the registers of opening and delivering good people to ascend as immortals, belonging to the Realm of Form.\n\n**Manifest Stability Ultimate Wind Heaven** – Allotted to the Third Heaven of the Western Direction, the Heaven of Investigating Stability, ruled by the Celestial Emperor of Vast Yang *qi*. The *qi* of this heaven is yellow, transforming and giving rise to the Wings Mansion. It governs the registers of suffering souls and good spirits, belonging to the Realm of Form.\n\n**Initial August Filial Awn Heaven** – Allotted to the Fourth Heaven of the Western Direction, the Heaven of Akaniṣṭha, ruled by the Celestial Emperor of Cavernous Yin *qi*. The *qi* of this heaven is green, transforming and giving rise to the Spread Mansion. It governs the registers of the souls and ghosts of the Nine Dark Realms of Eternal Night, belonging to the Realm of Form.\n\n**Great August Visiting Double Floating Countenance Heaven** – Allotted to the Fifth Heaven of the Western Direction, the Heaven of Waves Entwining Separation, ruled by the Celestial Emperor of Interpenetrating Yin *qi*. The *qi* of this heaven is blue, transforming and giving rise to the Star Mansion. It governs the registers of summoning souls to gather perfection, belonging to the Realm of Form.\n\n**No-Thought River Origin Heaven** – Allotted to the Sixth Heaven of the Western Direction, the Heaven of Brahma Brilliance Primordial Yellow, ruled by the Celestial Emperor of Mysterious Yin *qi*. The *qi* of this heaven is red, transforming and giving rise to the Straddling Mansion. It governs the registers of opening and delivering the dead souls of Eternal Night, belonging to the Realm of Form.\n\n**Upper Plate Joyous Heaven** – Allotted to the Seventh Heaven of the Western Direction, the Heaven of Liberating Primordial Origins, ruled by the function of Vast Yin *qi*. The *qi* of this heaven is dark green, transforming and giving rise to the Ghost Mansion. It governs the registers of assessing the merit and conduct of heavenly beings, belonging to the Realm of Form.\n\n**Ultimate Non-Existence Dharma Vow Heaven** – Allotted to the Eighth Heaven of the Western Direction, the Heaven of Ālaya Thought, ruled by the Celestial Emperor of Ultimate Yin *qi*. The *qi* of this heaven transforms and gives rise to the Well Mansion. It governs the registers of all ranks of divine immortals, belonging to the Realm of Form.\n\n**Luminous Court Rosy Transcendence Heaven** – Allotted to the First Heaven of the Northern Direction, the Heaven of Responding Thought, ruled by the Celestial Emperor of Yin Generation *qi*. The *qi* of this heaven is linked to the Brahma *qi* of the North, its *qi* purple. It governs the registers of delivering perfected beings to ascend as immortals, belonging to the Realm of Form.",
      "overlap_context": "\n**Lodge of the Chariot, Celestial Stair Star Sovereign** – Above, it aligns with the Supreme Peaceful August Cliff Heaven; below, it illumines the terrestrial domain of Chu. It governs the outer seas of the kingdoms of Southern India, Dānshēn, and Lion, and nine lesser states, and below, oversees the affairs of human celestial-terrestrial brightness, weeping and parting, official disputes, and perilous calamities.\n\n*Dongyuan Collection, Scroll Eight Concluded*\n*Dongyuan Collection, Scroll Nine*",
      "start_char": 18272,
      "end_char": 19570,
      "start_sentence": 678,
      "end_sentence": 704,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.67038893699646,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 23,
      "original_text": "渊通元洞天，分北方第二扇明民天帝，位阴化之炁，此天炁紫化生参宿，管天下人升度天人品位之籍，系色界。 太文翰宠妙成天，分北方第三梨那天帝，位阴明之炁，此天鱼白化生赀宿，管天下统掌神王鬼录之籍，系无色界。 太素秀乐禁上天，分北方第四梵括太招天帝，位洞阴之炁，此天炁黄化生毕宿，管天下魔王名品之籍，系无色界。 太虚无上常融天，分北方第五阿尼垢天帝，位阴灵之炁，此天炁紫化生勖宿，管天下记功度人升仙之籍，系种民天。 太释玉隆腾胜天，分北方第六顷达天帝，位阴，魂之炁，此天炁青化生胃宿，管天下仙真大圣品位之籍，系种民天。 龙变梵度天，分北方第七元梵顷带大婚天帝，位阴结之炁，此天炁赤化生娄，宿管天下进仙成圣之籍，系种民天。 太极平育贾奕天，分北方第八释辉自然天帝，位乃阴极之炁，此天炁苍色化生奎宿，管天下学仙姓名功绩之籍，系种民天。 右三十二天毕。 具官三界事迹",
      "translated_text": "**Abyssal Permeation Primordial Cavern Heaven** – Allotted to the Second Heaven of the Northern Direction, the Heaven of Radiant Flourishing People, ruled by the Celestial Emperor of Yin Transformation *qi*. The *qi* of this heaven is purple and gives rise to the *Shen* Mansion. It governs the registers of humans ascending to the ranks of heavenly beings, belonging to the Realm of Form.\n\n**Supreme Literary Splendor Marvelous Completion Heaven** – Allotted to the Third Heaven of the Northern Direction, the Heaven of Pearly Brilliance, ruled by the Celestial Emperor of Luminous Yin *qi*. The *qi* of this heaven is fish-white and gives rise to the *Zi* Mansion. It governs the registers of divine kings and ghostly records, belonging to the Formless Realm.\n\n**Great Simplicity Elegant Joy Forbidden Upper Heaven** – Allotted to the Fourth Heaven of the Northern Direction, the Heaven of Brahma-Encompassing Grand Summons, ruled by the Celestial Emperor of Cavernous Yin *qi*. The *qi* of this heaven is yellow and gives rise to the *Bi* Mansion. It governs the registers of demon kings and their ranks, belonging to the Formless Realm.\n\n**Great Void Supreme Eternal Fusion Heaven** – Allotted to the Fifth Heaven of the Northern Direction, the Heaven of Āneṇejya, ruled by the Celestial Emperor of Spirit Yin *qi*. The *qi* of this heaven is purple and gives rise to the *Xu* Mansion. It governs the registers of merit-recording and delivering humans to ascend as immortals, belonging to the Heaven of Seed People.\n\n**Supreme Release Jade Ascension Soaring Victory Heaven** – Allotted to the Sixth Heaven of the Northern Direction, the Heaven of Inclined Attainment, ruled by the Celestial Emperor of Yin-Soul *qi*. The *qi* of this heaven is blue-green and gives rise to the *Wei* Mansion. It governs the registers of immortal perfected beings and great sages, belonging to the Heaven of Seed People.\n\n**Dragon Transformation Brahma Attainment Heaven** – Allotted to the Seventh Heaven of the Northern Direction, the Heaven of Primordial Brahma Inclined Girdle Great Union, ruled by the Celestial Emperor of Yin Convergence *qi*. The *qi* of this heaven is red and gives rise to the *Lou* Mansion. It governs the registers of advancing immortals to achieve sagehood, belonging to the Heaven of Seed People.\n\n**Great Ultimate Level Nurturing Splendid Brilliance Heaven** – Allotted to the Eighth Heaven of the Northern Direction, the Heaven of Radiant Release Naturalness, ruled by the Celestial Emperor of Ultimate Yin *qi*. The *qi* of this heaven is blue-green and gives rise to the *Kui* Mansion. It governs the registers of immortal students’ names and meritorious deeds, belonging to the Heaven of Seed People.\n\nThe thirty-two heavens are now complete.\nAll offices govern the affairs of the Three Realms.",
      "overlap_context": "to the Well Mansion. It governs the registers of all ranks of divine immortals, belonging to the Realm of Form.\n\n**Luminous Court Rosy Transcendence Heaven** – Allotted to the First Heaven of the Northern Direction, the Heaven of Responding Thought, ruled by the Celestial Emperor of Yin Generation *qi*. The *qi* of this heaven is linked to the Brahma *qi* of the North, its *qi* purple. It governs the registers of delivering perfected beings to ascend as immortals, belonging to the Realm of Form.",
      "start_char": 19571,
      "end_char": 19966,
      "start_sentence": 705,
      "end_sentence": 713,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.421120882034302,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 24,
      "original_text": "夫三界者，欲界、色界、无色界，号日三界也。 初下六天为欲界。 中一十九天为色界，此二界劫数所为，阴阳所陶，炁有穷尽。 上有三天为无色界。 人有岁数，外有四种民天，日上至无上大罗之天，皆结虚无清净之炁，化生此天阳光照之，无日月之过焉。 此天之下即有晦明，皆三清大罗之境，不生不灭，无劫运之数，阳九百六灾所不及，为极道之，域，即万圣朝轩，元始真炁化生万物之根本矣。 洞渊集卷之九竟",
      "translated_text": "The Three Realms are known as the Realm of Desire, the Realm of Form, and the Formless Realm—collectively called the Three Realms. The lowest six heavens constitute the Realm of Desire. The middle nineteen heavens form the Realm of Form; these two realms are shaped by kalpas and molded by yin and yang, their *qi* subject to exhaustion. Above them lie three heavens comprising the Formless Realm. Mortals are bound by years, while beyond them exist four heavens of Seed People, extending upward to the Supreme Great Luo Heaven. All are woven from the *qi* of emptiness and purity, transformed and illuminated by the yang radiance, untouched by the transgressions of sun and moon. Beneath this heaven, darkness and light arise—all realms of the Three Purities and Great Luo, neither born nor destroyed, beyond the reckoning of kalpas and the reach of the ninety-six disasters of yang. This is the ultimate domain of the Dao, the realm where all sages gather in homage, the very root from which the Primordial True *Qi* gives rise to the ten thousand things.\n\n*The Ninth Scroll of the Dongyuan Collection is complete.*",
      "overlap_context": "*Great Ultimate Level Nurturing Splendid Brilliance Heaven** – Allotted to the Eighth Heaven of the Northern Direction, the Heaven of Radiant Release Naturalness, ruled by the Celestial Emperor of Ultimate Yin *qi*. The *qi* of this heaven is blue-green and gives rise to the *Kui* Mansion. It governs the registers of immortal students’ names and meritorious deeds, belonging to the Heaven of Seed People.\n\nThe thirty-two heavens are now complete.\nAll offices govern the affairs of the Three Realms.",
      "start_char": 19966,
      "end_char": 20154,
      "start_sentence": 714,
      "end_sentence": 720,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.599205493927002,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞渊集（宋李思聪）.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}