{
  "source_id": "洞玄灵宝自然斋仪（南朝宋陆修静）",
  "source_file": "chunked_daozang\\洞玄灵宝自然斋仪（南朝宋陆修静）.json",
  "total_chunks": 7,
  "total_original_chars": 6696,
  "total_translated_chars": 39987,
  "total_translation_time": 194.5490915775299,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\洞玄灵宝自然斋仪（南朝宋陆修静）.txt",
    "category": "威仪类"
  },
  "full_translation": "**The *Dongxuan Lingbao Rites of the Torch, Candles, Precepts, Penances, Lamps, and Vows***\n\n**Scripture Title:** *Dongxuan Lingbao Explanations on the Torch, Candles, Precepts, Penances, Lamps, and Vows*. Composed by Daoist Lu Xiujing of the Liu-Song dynasty. This text expounds the essentials of Lingbao fasts, precepts, and ritual procedures. One scroll. Base text from the *Zhengtong Daoist Canon*, Dongxuan Section, *Weiyi* (Ritual Propriety) category.\n\n---\n\n**Explanations on the Torch Light Fast**\nBy Lu Xiujing\n\nBefore assembling the fast, one should retire to a private chamber, burn incense, and gird oneself to expound the rites.\n\nThe \"torch light\" (jué guāng) is akin to what Zhuangzi called a \"torch flame\"—a faint illumination. The methods of fasting are most refined, yet practitioners often remain coarse, for the five turbidities and defilements obscure them deeply, as though dwelling in a dark cavern where the sun’s rays never reach. To guide those lost in such gloom, the brightness of lamps and candles is fitting. The \"torch light\" refers precisely to this.\n\nThese explanations outline the main principles of the fast scriptures, presenting the essentials of the ritual body in accessible terms. The intent is to restrain the crude and vulgar while guiding toward profound clarity. It is like a carpenter selecting wood: when the grain is twisted and warped, one must first trim the outer edges before applying the inked line to shape it. I am ashamed of my own clumsiness, which has led to such prolixity. Perhaps the grain of this text is too gnarled for even a master craftsman to work.\n\nWhen preparing for a fast or offering, one should first explain the rites in a private chamber, girding oneself and kindling incense according to proper form.\n\nIn fasting, one must sit in silent seclusion, mastering the passions and closing the gates of the spirit to prevent external burdens from entering. One upholds the Ten Precepts, ensuring worldly thoughts do not arise. One cultivates a heart of courage and vigor, practicing the Ten Daoist Practices. One’s resolve must be firm and unshakable, like a tree deeply rooted. One contemplates the profound and savors the true, ensuring every thought is pure—only then can it be called a fast.\n\n1. **Purifying Bath:** Bathe in fragrant water to cleanse the spirit, qi, and the five limbs, making the nine orifices bright and clear. Clothing must be spotless, both inside and out, suffused with fragrance. This is to welcome the descent of the exalted perfected and to meet the gaze of the numinous and subtle.\n\n2. **Renouncing Worldly Affairs:** Sever all worldly ties, withdraw from internal and external distractions, and abide in tranquil non-action. Body and mind must be at ease, focused and undistracted.\n\n3. **Moderating Diet:** Abstain from rich flavors and curb desires, regulating excess and deficiency so that the organs are harmonized, the spirit and qi purified, and the primordial spring nourished.\n\n4. **Proper Attire and Demeanor:** Maintain solemnity and reverence in dress and bearing. Abandon arrogance and sloth, ensuring no negligence in conduct. Bowing, prostrations, and every act must be performed with utmost propriety.\n\n5. **Silence and Recitation:** Seal the mouth and still the tongue, avoiding idle speech. Regulate the voice and rectify the qi while reciting scriptures. This awakens humans and spirits and resonates with immortals and sages.\n\n6. **Purifying the Mind:** Cleanse the heart and thoughts, banishing perverse imaginings. Subdue the six senses and eradicate the Three Poisons. Focus the spirit on the true, penetrating the profound and subtle.\n\n7. **Incense and Invocation:** Burn incense and waft its smoke, strike the drum to summon the gods. Let the Three Clarities hear above and the Ten Directions know below.\n\n8. **Repentance and Petition:** Confess transgressions and seek forgiveness, making vows with a heart of utmost sincerity, humble and earnest.\n\n9. **Great Compassion:** Extend boundless mercy, pitying all who suffer calamities and afflictions, wishing to deliver them all. May birth and death cease, and sorrow be no more.\n\n10. **Graceful Conduct:** Every movement—advancing, retreating, rising, or bowing—must be refined and unhurried. Encourage one another, confining speech to the Dao, never straying from the Dharma. If one becomes aware of errors or lapses, one must immediately prostrate and repent.\n\nThis is the *Lingbao Natural and Supreme Fast*.\n\n\"Ling\" means \"numinous.\" Its wondrous efficacy transcends thought and imagination, its transformations boundless—hence it is called \"ling.\"\n\n\"Bao\" means \"one.\" It is what the Three Powers (Heaven, Earth, and Humanity) attain, embodying purity, tranquility, and integrity. Since it cannot be lost, it is called \"bao.\" If one embraces it without parting, myriad blessings will naturally arrive. To stray from it even for a moment is to invite chaos and calamity. Fortune and misfortune, benefit and harm, gain and loss—none can compel these outcomes, nor can any prevent them. Thus, it is called \"natural.\"\n\nIt universally aids the Five Paths, delivering all beings, extinguishing the cycle of birth and death, and transcending the Three Realms—hence it is called \"supreme.\"\n\nThough humans are not perfected sages, they dwell in the Five Turbidities, where the Three Corpses thrive, internally generating thieves. The nine orifices and four gates each pursue their own ends, and every action leads toward death, cutting short one’s heavenly years. Failing to fulfill one’s allotted lifespan, one commits evil and accumulates sins in the hidden courts. Thus, in this world, one suffers hardship, never resting from the human path. Hunger, cold, poverty, and lowliness; illness, punishment, and calamity; disasters and misfortunes—all entangle and assail. Only after death does one tread the path of suffering.\n\nThis is why the Most High Heavenly Worthy opened the Purple Tenuity Jade Writ of the Upper Palace of the Mysterious Capital and revealed the wondrous fasts of Lingbao.\n\nHumans are restless in the Three Passes, unable to remain still. Their bodies engage in killing, theft, and lust—thus, they are disciplined through bowing and prostration. Their mouths utter evil words, frivolous speech, and double-tongued deceit—thus, they are tasked with scripture recitation. Their hearts harbor thoughts of greed, desire, anger, and hatred—thus, they are made to contemplate the spirit. Through these three methods, the heart is cleansed, and conduct is purified. When heart and conduct are refined to perfection, this is the meaning of fasting.\n\nOne should widely vow good intentions to expand merit and karma. The resolve to uphold precepts must be like grasping a rope while falling into a well—never letting go for even a moment. The commitment to the Dharma must be like reinforcing a crumbling dam—never allowing laziness. The devotion to practice must be like planting fertile fields—never growing weary. Day and night, one reveres the precepts and honors the Dharma with tireless diligence. Then, one will resonate with the Great Mystery, and the perfected spirits will descend. The Three Corpses will scatter and vanish, and all demons will be subdued. With such vows, nothing will go unfulfilled, and no aspiration will remain unachieved.\n\nThe age of the sages is hard to encounter; the scriptures and Dharma are hard to hear. Favorable times are hard to come by; enlightened teachers are hard to meet. All you worthy ones, in past lives, have accumulated great blessings, bringing this joyous convergence in your present existence. You have encountered the Three Treasures, heard the sounds of the Dharma, and inclined toward purity and emptiness. You have feasted on the flavors of the numinous, and your names are already inscribed in the imperial registers of the celestial archives, written in gold and jade. You are the honored guests of the Heavenly Palace and the immortal companions of the Most High.\n\nNow you have ascended to the Dharma seat, embracing the Dharma’s discipline—having made a virtuous beginning, why not bring it to fulfillment? Let us together steel our resolve, contending with sloth, upholding the Dharma’s teachings, and regarding mindfulness as sublime practice. Strive with earnest sincerity, sparing no effort, counting no toil. A single day of diligence shall bring blessings across lifetimes.\n\nHuman life is perilous; the four elements are unreliable. A century passes in an instant—how much time is truly ours? If decrepitude suddenly arrives—eyes dimmed, ears dulled, afflictions and pains entwined—then even in sleep, sitting, breathing, or movement, one must rely on others’ strength. In such a state, could one still advance in the Dao’s work, or remain in this Dharma seat?\n\nTo lose this auspicious opportunity—when shall we meet again? To sink into the depths of suffering—what use is regret? Ponder these words, each for your own sake. Encourage one another, and together cross the perilous straits.\n\nIf one’s past lives bear heavy sins and karmic debts, they become enshrouded in obscuring veils, the six senses unopened. The mind grows crooked and narrow, the qi perverse and rebellious. Deluded by the five desires, they see nothing beyond. They indulge in rich flavors, sounds, and sights, seeking fleeting pleasure. They resent goodness and envy the worthy, treating them like foes.\n\nSuch people, wherever they turn, form bonds with evil and never encounter the scriptures and teachings—or if they do, they do not believe. Seeing others reverence and follow the Dao and Dharma, they call it delusion and join in mockery. The deaf do not hear the *Shao* and *Wu* melodies; the blind do not see black from white. Can they be said to suffer from their own afflictions?\n\nEven if wise counsel forcibly drags them forward, it is not their nature. They soon repent, turning from truth to falsehood, chasing after demonic illusions. For them, joy is fleeting, while sorrow stretches long. These beings take the three wretched realms as their path, the earth and mountains as their home. Forever lost in darkest night, they never behold the three luminaries. They embrace copper pillars, tread upon knife mountains, walk beneath sword trees, plunge into cauldrons of boiling oil, swallow fire and devour coals—through endless kalpas, no escape.\n\nEven if reborn, they fall into the forms of the six livestock, their bodies subjected to the cruelty of slaughter, their souls trapped in the three evil destinies. Drifting and tossed between lives, how pitiful they are!\n\n*Dharma Lamp Record*, composed by Lu Xiujing.\n\nAt the onset of the evening fast, one burns incense and lodges the initial invocation, then, facing east before the deities, recites the following.\n\n**Dharma Lamp.** *Dharma* signifies the compass and square—collectively termed \"the Dharma.\" The compass draws the circle, the square marks the right angle; all things conform to them and thus attain correctness. *Lamp* denotes an object that emits light, aiding the moon and supplementing the sun, dispelling dusk and illuminating darkness. By its radiance, one gains sight. Crookedness and deceit lack the Dharma and thus cannot rectify themselves; applying the Dharma without illumination fails to reveal gains and losses. To rectify, one cannot be without the Dharma; to apply the Dharma, one cannot be without illumination. To stabilize the self, one must fast; to fast, one cannot be without this text. This text serves as the *Dharma Lamp*, guiding one through the Daoist canon to attain the true treasure.\n\nOf all things, humans are most noble; of humans, life is most precious. Life depends on spirit and *qi*. Spirit and *qi* reside within the body as the life of the four limbs. Humans cannot be without *qi* for even a moment, nor can they lose spirit in bowing or rising. Losing spirit causes the five viscera to collapse; losing *qi* brings sudden death. Spirit and *qi* always move in tandem. Spirit and *qi* rely on each other to strengthen. When spirit departs, *qi* perishes; when *qi* is cut off, the body is lost. All fear death and delight in life, yet fail to recognize that the work of living lies in spirit and *qi*. Instead, they repeatedly harm their minds, offend their *qi*, indulge their spirits, and wither their lives. They do not cherish stillness or preserve their true nature, thus inviting ruin.\n\nHow can one not treasure essence and guard *qi* to seek long-lasting vision, harmonizing and nurturing all things to cultivate the blessings of branches and leaves? The sages, seeing the people rushing after the five desires and unable to stabilize themselves, established the fast. Through affairs, they quell affairs; through precepts, they restrain inner foes; through威仪, they guard against external threats. Ritual recitation engages body and speech, steering movement back to stillness. Meditation on the deities engages the mind, guiding existence toward emptiness. In stillness and emptiness, the *qi* harmonizes with the Dao, like reining in a swift steed to align the chariot returning to truth. Yan Zun said: \"Empty the heart to trace the Dao and virtue; still the *qi* to await the divine.\" This is the meaning.\n\nYet scholars of the degenerate age value ornament over substance. Though blessings lie in stillness, they seek them in motion; though life rests within, they abandon the self for external things. Such people, though eager to practice fasting, do not understand its methods. Or, understanding its methods, they do not recognize its form. Or, recognizing its form, they do not grasp its meaning. Or, grasping its meaning, they do not attain its intent. Confused and disordered, they act without restraint, drifting from their origin, forever unaware—like turning from a fierce wind to follow a swift current, ignorant of how to row back to the source, thus sinking forever in the sea of suffering. How tragic!\n\nI have carefully gathered teachings from various scriptures and compiled them into ten chapters, to be applied during fasting, naming it *Dharma Lamp*. The first chapter concerns the initial evening invocation; six chapters address the six periods of ritual circumambulation; three chapters focus on the three periods of meditation on the deities. If the Dharma Master illuminates these to conduct the fast, and all officials and hosts receive them with empty hearts, then their sight and hearing will become clear, and they may glimpse the gate of the great Dao.\n\nThe *Dao* is the name for the ultimate principle. *Virtue* is acting in accordance with that principle. *Scripture* is the path that leads through. The *Dao* is like a road; *virtue* is good virtue; *scripture* is like a measured path; *practice* is like walking; *Dharma* is like a model. Those who study the Dao must follow the Dharma to seek the scriptures, practice goodness to cultivate virtue, and thus attain the Dao. Without performing meritorious deeds, merely holding to one thing without change will never achieve the Dao—like a person sitting at home without walking, how can they see the road?\n\nThe Dao, when combined threefold, forms virtue. Without completing the three, nothing is achieved. The three are: Dao, virtue, and benevolence. Benevolence is one; performing meritorious deeds is two; virtue sufficient to complete the Dao is three. When these three unite, one attains the Dao. If one only performs meritorious deeds but does not understand the Dao, one does not attain the Dao. If one only understands the Dao but lacks meritorious deeds, one does not attain the Dao. If one possesses Dao and virtue but lacks benevolence, the ultimate principle becomes obscured and returns to nothingness. Like sowing grain by casting seeds into the earth without water to moisten them, how can they grow? With a ruler and ministers but no people, how can they govern? With heaven and earth but no beings, how can they nurture? Thus, the *Five Thousand Words* states: \"The three give birth to the ten thousand things.\"\n\nThe selection of precepts and the imposition of prohibitions and penalties follow the established texts composed by Master Lu.\n\nAfter completing the initial evening invocation, the Ten Precepts of the Highest Grade are conferred, with all facing east and standing evenly. The *Hymn of Wisdom* is recited:\n\nWisdom arises from the originless,\nDarkly transcending the ten directions.\nBinding emptiness, it towers in the mystic firmament,\nWhile all heavens embrace its flowing fragrance.\nIts wonder defies thought,\nIts numinous resonance truly connects.\nBeing is ultimately non-being,\nNon-being contains all without exclusion.\nWisdom constantly observes the body,\nThe foremost task in studying the Dao.\nSubtly entering profound contemplation,\nNaturally it records my spirit.\nThe Heavenly Worthy ever protects,\nThe demon kings pledge their guardianship.\nResplendent is the vajra body,\nLofty before the Most High.\nWisdom engenders the root of precepts,\nThe true Dao takes precepts as its master.\nFrom this the Three Treasures arise,\nRevered and received by the exalted sages.\nRiding this deathless vessel,\nSwiftly it crosses the great expanse.\nAt this moment of preaching the precepts,\nAll heavens come to bow their heads.\n\nAfter the recitation, all turn north, prostrate themselves fully to the ground, and, turning their hearts, pay homage to the ten directions before returning to face east and prostrate again. The Dharma Master turns to face west, and, with dignity, proclaims the precepts.\n\nThe Heavenly Worthy addressed the Most High Lord of the Dao, saying: \"Now I shall universally proclaim the Dharma’s sound to awaken all beings. For all men and women, I shall dissolve disasters and avert calamities, entreat blessings and deliver lives, and eradicate the roots of all suffering.\"\n\nMay the living behold the Dao and escape the eight difficulties of embodiment,\nwhile the dead rejoice, feast in celestial halls,\nand swiftly be reborn among men as Wheel-Turning Sage Kings.\nAll who fast and seek the Dao must single-mindedly request and receive the Ten Precepts,\nattending closely lest they forget.\nFocus the mind in silent contemplation,\npenetrating reflection upon the natural.\nLet no stray thoughts disturb body and spirit.\nThose who can do this shall listen in stillness.\n\nThe First Precept: Let the heart harbor no malice or envy,\ngiving no rise to the thieves of yin.\nGuard the mouth and be cautious of transgressions;\nlet thoughts dwell upon the Dharma.\n\nThe Second Precept: Uphold benevolence and refrain from killing,\nshowing compassion and aiding all beings.\nEmbrace kindness and extend salvation,\nnourishing all things.\n\nThe Third Precept: Maintain chastity and yield to righteousness,\nneither lusting nor stealing.\nEver cultivate good thoughts,\nsacrificing the self to aid others.\n\nThe Fourth Precept: Be free from sensuality and desire,\nkeeping the heart from reckless abandon.\nUphold purity and vigilance,\nensuring conduct remains unstained.\n\nThe Fifth Precept: Let the mouth utter no evil words,\nnor speak with ornate deceit.\nBe upright within and without,\ncommitting no transgressions of speech.\n\nThe Sixth Precept: Abstain from wine and moderate conduct,\nharmonizing qi and temperament.\nLet the spirit remain unharmed,\navoiding all manifold evils.\n\nThe Seventh Precept: Do not envy those who surpass you,\nnor contend for fame and merit.\nIn all matters, yield and withdraw,\nhumbling yourself to deliver others.\n\nThe Eighth Precept: Do not criticize the scriptures and teachings,\nnor slander the sacred texts.\nDevote yourself to the Dharma,\never as though in the presence of the divine.\n\nThe Ninth Precept: Do not engage in quarrels or disputes,\nnor judge the four classes of beings.\nLet neither heaven nor man bear resentment,\nlest spirit and qi be harmed.\n\nThe Tenth Precept: In all actions and deeds,\nmaintain equanimity and single-mindedness.\nLet harmony prevail among people and spirits,\nensuring conduct remains thus.\n\nThe Heavenly Worthy declared: Those who cultivate and uphold the pure precepts\never align with the heart of heaven.\nEver practicing great compassion,\nthey vow to universally deliver all from this world of suffering.\nHumbly revering the teachings,\nthey must not grow lax midway.\nBetter to die upholding goodness\nthan to live in evil.\nThus unwavering,\none may escape the five destinies,\navoid the three evils,\nbe protected by all heavens,\nand revered by the myriad spirits.\nThose who maintain long fasts and uphold the precepts\nshall naturally attain deliverance.\n\nThe Heavenly Worthy declared: The Dao is exalted, the Dharma wondrous,\nand the human body is likewise precious.\nThus the Dao unfolds the Dharma,\nbequeathing precepts and scriptures\nto deliver the human form.\nOnce the human form is delivered,\nit ascends to become one with the Dao.\nOne should practice with diligence,\nmaintaining fasts and upholding precepts,\ncalming the mind in stillness,\nkeeping aspirations clear,\nfocusing intent single-mindedly,\nwithout distraction.\nPurify the six viscera,\navoid rich flavors at meals,\nand maintain inner and outer purity,\never in accord with the natural.\nOn such fasting days,\nlight incense and make vows,\nso that the heart’s sincerity ascends.\nThe patrolling deities of the Four Heavens\nand the mighty spirits of the Ten Divisions\nwill descend to observe,\nlistening to the Dharma’s sound\nand overseeing your heart.\nThose who uphold the precepts and practice the Dao\nshall have their merits recorded in the heavens,\nwhere fortune and misfortune manifest instantly.\nThe Dao does not fail those who practice diligently;\nattend closely and receive without doubt,\nlest demonic words deceive.\n\nThe Heavenly Worthy declared: When establishing fasts and practicing the Dao,\nthe Four Heavenly Kings ride upon flying clouds,\ngreen-canopied eight-jewel jade chariots,\naccompanied by perfected beings and jade maidens,\nholding flower banners,\nleading with phoenix songs,\nfollowed by celestial music.\nWhite cranes and lions\nsing in harmonious chorus,\nburning incense and scattering flowers,\nfloating through the void as they come.\nThey gaze upon those practicing the Dao,\nlistening to the Dharma’s sound.\nThe Heavenly Kings descend,\nand the myriad spirits pay homage.\nHow could one not fully adhere to this Dharma?\nFirst receive the Ten Precepts,\nthen practice the Dao,\nproceeding with refined steps,\ncalming the heart and quieting the mind.\nIn sitting, rising, lying, and resting,\nnever depart from proper decorum.\nThe Heavenly Kings rejoice,\nand names are inscribed in the Upper Clarity.\nThis is truly attaining the Dao within the square inch of the heart.\n\nThe scripture states: To move heaven and earth,\nsummon the hosts of spirits,\ncommunicate with the Dao of immortals,\npenetrate the utmost truth,\ndissolve the sins of past lives,\nextinguish misfortune,\nrepel vengeful foes,\ncultivate great virtue,\nheal illnesses,\nand deliver all beings—\nnothing surpasses the practice of fasting and reciting scriptures.\nFasting is indeed the foundation of seeking the Dao,\nthrough which all accomplishments are achieved.\nIts merit is towering,\nunmatched by any other.\nAbove, it enables ascension to immortality and attainment of the Dao;\nin the middle, it brings peace to nations and families,\nprolongs life and increases longevity,\nand secures blessings and prosperity,\nattaining the Dao of non-action.\nBelow, it erases past transgressions,\npardons present faults,\nrescues from distress and eases hardship,\ndispels disasters and illnesses,\nrelieves the suffering of the dead,\nand delivers all beings—\nnothing is inapt.\n\nThe scripture states: Among the great methods of fasting,\nnone precedes the *Lingbao* Fast of the Most High.\nThe *Lingbao* scriptures\nare the primordial root of heaven and earth,\nthe gateway and window of the divine,\nthe ancestor of all scriptures,\nand the bridge of boundless great Dharma.\nIf one recites but a single sentence,\nits resonance pierces the nine heavens,\nand all heavens pay homage,\nwhile ghosts and spirits stand in awe.\nProfound and wondrous,\nbeyond full declaration—\nonly the utmost goodness in the world\ncan achieve this.\nOnly the utmost sincerity in the world\ncan invoke this.\nOnly the utmost devotion in the world\ncan uphold this.\nOnly the utmost talent in the world\ncan practice this.\n\nThe Most High holds it in the highest regard, and all perfected beings revere it—all cast in golden characters, inscribed upon jade tablets, sealed within the Supreme Great Luotian, the Mystic Capital’s Jade Capital Mountain, the Purple Tenuity’s Upper Palace, upon the Seven Treasures’ Mystic Terrace. This terrace is where the Most High presides. The Five Elders stand in attendance, the Ten Thousand Emperors pay homage to the perfected, jade maidens hold the towels, golden youths waft incense, burning the hundred harmonies’ blended fragrance to suffuse the Purple Court. They exhale the essence of the sun to dispel impurity, scatter the radiance of the moon to brush away dust. Divine lamps shine brightly, their flames merging in brilliance; golden winds scatter in eight directions, auspicious clouds array in four quarters. Flying dragons and poisonous beasts guard the jade gates. The perfected of the ten directions, the great sages of the three thousand great thousand worlds who have attained the Dao, and the spontaneously wondrous and practiced perfected ones—all circumambulate the Upper Palace thrice daily, bowing in reverence, soaring through empty space, scattering flowers and burning incense. In their hands they hold the Ten Absolutes, chanting and intoning the profound chapters, praising the numinous mysteries of the Nine Heavens and honoring the wondrous weight of the Mystic Writ.\n\nNow, when Daoists fast and circumambulate the high seat, chanting and pacing the void, they precisely emulate the ancient root of the Mystic, the assembly of the perfected sages as they pay court in the Jade Capital. In performing the Dao and offering obeisance, all should move with calm and refined steps, their bearing orderly and composed, their bows and gazes aligned, without disorder. As they circumambulate and pace the void, all hold tablets before their hearts. In winter, they must not clasp their hands over their hearts; in summer, they must not fan themselves. They should face forward with upright bodies, their eyes gazing inward, visualizing the Most High upon the high seat, fixing their thoughts upon the Mystic and True, so that heart and form become as cinnabar, in harmony with the celestial canon. Thus shall they be marveled at by flying immortals, serve as the model for the Three Realms, and be beheld with reverence by ghosts and spirits.\n\nThey must not glance left or right, nor jostle one another, nor speak or laugh in jest, nor call out—lest they offend the numinous majesty, be censured by the Four Controllers, or incur the Five Emperors’ penalties. The clear statutes forbid such transgressions; how can one not be cautious?\n\nThe scripture states: During the fast, at dawn and dusk, thrice daily, burn incense and repent transgressions, listening with single-minded devotion to the wondrous and profound meanings of the scriptural Dharma. Thus, when the scriptures are recited and the Dharma expounded, it is as when the ancient perfected ones taught and transformed. The sages transmit the scriptural teachings to the world, that those who have not heard may hear, and those who have not known may know. By this Dharma bridge, they universally deliver all people.\n\nDuring the performance of the Dao, one must not speak idly or discuss worldly affairs; one should only inquire of the Dharma Master regarding the scriptural meanings and precepts. The Dharma Master shall then expound the true essentials. If one can achieve inner and outer tranquility, reverently receiving even a single sentence of the scripture, the Controller of Destinies shall add ten years to one’s lifespan, and thereafter one shall be wise and enlightened. If one is restless within or without, and offends even a single sentence of the scripture, the Controller of Destinies shall deduct ten years, and thereafter one shall follow blind and foolish paths.\n\nThus, the perfected do not speak idly; when they speak, their words strike true, all in accord with the Dharma’s speech. It is said: “Humans can magnify the Dao; the Dao does not magnify humans.”\n\nWhen the precepts have been expounded, the Dharma Master once more selects and appoints the assembly’s officers. The officers kneel to receive their tablets. On the morrow, during the performance of the Dao, each shall oversee their appointed duties.\n\nThe Dharma Master—\nThe scripture states: One should elevate those of lofty virtue, profound in their understanding of the scriptural meanings. Such a person’s virtue fills them within, their majestic bearing manifests without; in every movement and stillness, they embody the Dharma’s model. They are the exemplar of the Three Realms, the gaze of ghosts and spirits. In opening prayers and invoking blessings, they commune with the perfected and summon the numinous, resolving doubts and dispelling obstructions, guiding and enlightening the assembly of worthies.\n\nThe Precentor—\nThe scripture states: One of keen intelligence and clarity, practiced in the Dharma’s disciplines. Their duty is, during the performance of the Dao, in all matters of eating and resting, to follow the Dharma Master’s lead, then guide the assembly of officers in bowing, yielding, and all acts of reverence, which they shall intone and chant.\n\nThe Fasting Supervisor—\nTheir duty is to oversee the assembly’s transgressions, to censure and correct faults, to uphold the statutes and ordinances, and to report all matters as they arise, ensuring all is just and proper, without concealment or leniency.\n\nThe Scripture Attendant—\nTheir duty is to serve the honored scriptures, arranging the cloth wrappings, the high seat and its table, and the seating mats on all four sides, keeping all clean and orderly, without negligence.\n\nThe Incense Attendant—\nTheir duty is to prepare the censer and its implements, ensuring the fire burns and the ash remains clean. During the six periods of the Dao’s performance and the three periods of recitation and lecture, all must be prepared in advance, without last-minute deficiencies.\n\nThe Lamp Attendant—\nTheir duty is, as the sun approaches the western horizon, to prepare the lamp implements, arranging them according to the Dharma, ensuring the flames burn brightly and steadily. If wind or rain prevents the fire from standing, they shall consult the Dharma Master, and only then may the lamps be extinguished. They must not be negligent, nor allow any lapse or omission.\n\nWhen the selection and appointment of officers is complete, they circumambulate to the left to offer incense, facing east to pray, then return to the incense. The officers lead the procession to the hall, arranging themselves in order and taking their seats without loosening their sashes.\n\nThe Dharma Master then proclaims the statutes and precepts, instructing the assembly in the majestic bearing, which all shall listen to in silence.\n\nWhen Daoists enter the fast, each shall bring their own towel, robe, tablet, and footwear; they must not exchange these with others at the last moment, lest there be deficiencies, nor may they borrow garments not their own.\n\nOn the day of the fast, when burning incense or descending from the lecture, the Precentor shall lead the assembly of officers to first descend from their seats and stand facing west. The Dharma Master shall then descend from the high seat, leading the procession in order of seniority, moving with refined and measured steps to the Dharma gate. They must not jostle or overtake one another, nor move too swiftly or slowly, all subject to censure and penalty according to the statutes.\n\nWhen the incense offering is complete, and when descending from the lecture, the Precentor shall lead the assembly of officers to first exit the hall and stand facing west. The Dharma Master shall then ascend to the high seat, whereupon all officers shall bow once in unison before taking their seats.\n\nWhen Daoists enter or leave the fast, they shall report to the Fasting Supervisor, bow once to the Dharma Master, then bow thrice to the incense before departing. Upon returning, they shall do likewise. Transgressions shall be penalized as follows:\n\nArriving at the fasting hall with disheveled footwear: two *sheng* of oil.\nSitting or rising without order: half a *liang* of cinnabar.\nSitting improperly: two *jin* of incense.\nUpsetting the incense or fire: half a *jin* of incense.\n\nSpeaking to outsiders during ritual proceedings: one *jin* of incense.\nAttending to the scriptures with disheveled attire, or touching objects from the high seat: half a *jin* of incense.\nDiscussing worldly affairs: two *sheng* of oil.\nEngaging in frivolous speech or laughter: one *liang* of cinnabar.\nMuttering or dozing off: half a *liang* of cinnabar.\nSpilling lamp oil: five *sheng* of oil.\nWearing headscarves or robes improperly: half a *jin* of incense.\nFailing to maintain mutual discipline, or raising one’s voice harshly: five *sheng* of oil.\nListening to scriptures while leaning or resting without holding a tablet: one *sheng* of oil.\nLacking focused reverence, or allowing the mind to wander—if noticed by others: two *sheng* of oil.\nLeaving the fasting hall without reporting: two *sheng* of oil.\nLetting hair hang loose or walking hurriedly: one *jin* of incense.\nReciting scriptures carelessly, or mispronouncing passages when questioned: five *sheng* of oil.\nChanting out of unison: two *sheng* of oil.\nPerforming the incense ritual without washing hands or rinsing the mouth: two *sheng* of oil.\nFailing to observe proper etiquette in bowing, rising, or yielding: half a *jin* of incense.\nCirculating out of order: half a *jin* of incense.\nAllowing incense smoke to extinguish while tending it: four *sheng* of oil.\nThe Precentor failing to chant or praise with care: one *jin* of incense.\nRising, moving, or returning to one’s seat without bowing thrice to the scriptures before departing: one *jin* of incense.\nAllowing the lamp to extinguish while tending it: one *jin* of incense.\nRushing forward abruptly during the incense offering: one *sheng* of oil.\nThe Fasting Supervisor failing to prepare offerings, or causing shortages: one *jin* of incense.\nThe Enforcer observing transgressions but concealing them out of favoritism: six *sheng* of oil.\nReceiving reports but failing to present them to superiors: three *sheng* of oil.\nLeaving the fast to attend to personal matters and failing to return—if reported by others: one *dou* of oil and one *jin* of incense.\nEngaging in deceitful or vulgar speech, or discussing private improprieties: one *jin* of incense, five *sheng* of oil, and three *liang* of cinnabar.\n\nThe *Golden Register* states: Ascending or descending the fast without fulfilling ritual duties shall be addressed by the Fasting Supervisor according to the offense. For three or more infractions, the offender shall be stripped of their rank and expelled, with their transgressions announced to the assembly, and they shall not be permitted to remain in the ritual seat. If the Fasting Supervisor neglects to enforce these rules, they shall receive the same penalty as the offender. Should the Dharma Master in the high seat fail in their duties, their faults shall be recorded and reported to the Fasting Supervisor. For one to three infractions, they shall be barred from the ritual seat for three hundred days.\n\nThe *Statutes on Dignity* state: Fines shall be delivered to the Fasting Supervisor, announced to the assembly, and then used for public purposes. All these prohibitions derive from the ancient codes of the Supreme Bureau of the Mysterious Capital, serving to curb negligence and enforce discipline. The Heavenly Worthy, in boundless compassion, pities those who incur sin through ritual lapses and thus permits redemption through offerings of incense and oil, that their misfortunes may be dispelled and their offenses dissolved, rather than allowing them to accumulate in the unseen realm. This also awakens remorse in the transgressor, prompting reform and renewal. Though the required offerings of incense and oil may seem modest, they are often difficult to procure at short notice. Moreover, Daoists gathered for a fast are often not regular members of the community; once the ritual concludes, they disperse, and fines may go unpaid, further violating the scriptural intent and compounding their guilt. Even those guilty of grave offenses may seek redemption through fasting and atonement. How much more should those who uphold the precepts strive for reverence in ritual? If minor lapses in decorum are to be penalized with prostrations, this too may be permissible, with the number of bows determined by the severity of the offense. The officiating officers shall assess each case and report to the Fasting Supervisor with due respect.\n\nThe fast is a practice of utmost refinement, governed by strict prohibitions. This is because the Heavenly Perfected, the Great Spirits, the sages of the ten directions, and the myriad spirits of the three realms all descend to the ritual site, observing and witnessing the proceedings. Demon kings bow in reverence, and local deities stand guard at the gates. The Fasting Supervisor must ensure the premises are swept clean. All, great and small, must maintain silence, and the gates must be marked to bar entry, preventing interference from outsiders or the uninitiated. If devout men and women, sincere in their faith, arrive in proper attire to observe the ritual, they shall be seated separately and not intermingled with the assembly. All participants, high and low, must wear sashes and proper footwear, not slouching or shuffling. When giving instructions, voices must be gentle and measured; shouting is forbidden. Harsh voices disturb the Heavenly Perfected and violate the sacred prohibitions. If guests or the Fasting Supervisor are in mourning, even if they have not met, they must maintain composure and avoid expressions of grief or consolation.\n\nIf guests are of lower status than the host, or if worldly distinctions create disparity, they may not fully grasp the reverence due to Daoists. Yet the Dao is supreme, its virtue unmatched; though a Daoist may be humble, their aspirations are lofty. The Fasting Supervisor, seeking divine favor, should humble themselves, yield to the Daoist’s guidance, and empty their pride, that virtue may flow and blessings abound. They must not remain aloof or arrogant, for to slight a Daoist is to sever the unseen currents of grace and block the descent of celestial blessings. Heaven’s rain falls evenly, yet mountain peaks remain dry, for their steep heights leave no place to receive it. The Eastern Sea reigns over all rivers not by force or coercion, but by its nature—vast and lowly, embracing all impurities, drawing the convergence of countless streams. If a child is too young to participate in the fast, they must not be allowed near the ritual hall or disrupt the proceedings.\n\nThe essence of the fast lies in purity and emptiness, its practice in tranquility, its foundation in humility, and its conduct in reverence.\n\nWith trembling caution, as though treading upon ice or crossing a ravine; with solemn dread, as though standing before a stern sovereign. At every verse of the scripture, rise to perform the rites of bowing. In each moment, single-mindedly invoke goodness, following the promptings of one’s intent and aspirations—only let sincerity be pure, and response will surely come. The Most High’s Daoist gaze ever pierces through, surveying all good and evil beneath the heavens, with no detail overlooked.\n\nHere concludes the *Ritual of the Illuminating Lamp for the Precepts and Penalties in the Cavernous Mystery of the Numinous Treasure*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞玄灵宝斋说光烛戒罚灯祝愿仪 经名：洞玄灵宝齐说光烛戒罚灯祝愿仪。 南朝宋道士陆修静撰。 言灵宝斋戒科仪要旨。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 洞玄灵宝斋说光烛戒罚灯祝愿仪 爝光斋外说 陆修静撰。 斋集先於私房，烧香束带说之。 爝光者，犹庄子所谓爝火也，为光之微者。 原夫斋法至精，而行者常粗，实五浊垢障，深蒙难启。 如处曲穴，非太阳所照，延引幽暗者，宜以灯烛之明。 今以爝光，斯之谓也。 皆标斋经大旨，举法体近要，意以约束粗猥，示导玄彻。 又若匠之选木，斜曲甚者，未近绳墨，要先裁其外，然后加以成规。 愧乎余之鄙拙，乃至此之繁芜。 或由木理叉，难为师工邪。 此法造斋醮，先於私房说之，束带香火如法。 夫斋，当拱默幽室，制伏性情，闭固神关，使外累不入。 守持十戒，令俗想不起。 建勇猛心，修十道行。 坚植志意，不可移拔。 注玄味真，念念皆浄，如此可谓之斋。 一香汤沐浴，以精神气使五体清洁，九孔鲜明。 衣服悉浄，内外芳馨。 延降高真，视接虚灵故也。 二废弃世务，断俗因缘，屏隔内外，萧然无为，形心闲静，注念专精。 三中食绝味，挫割嗜欲，使盈虚得节，脏腑调和，神气清夷，含养元泉。 四谨身正服，斋整严肃。 舍离骄慢，无有怠替。 礼拜叩搏，每事尽节。 五闭口息语，不得妄言。 调声正气，诵咏经文。 开悟人鬼，会感仙圣。 六涤除心意，不得邪想。 调伏六根，荡灭三毒。 存神思真，通洞幽微。 七烧香奏烟，鸣鼓召神。 上闻三清，普宣十方。 八忏谢罪咎，请乞求愿。 心丹至诚，谦苦恳恻。 九发大慈悲，愍念一切灾厄恼难，咸愿度脱。 生死休泰，无复忧苦。 十进止俯仰，每尽闲雅，更相开导，言止於道，不得离法。 觉有跌误，便即踰失，稽颡忏悔。 所谓灵宝自然无上斋者。 灵者，神也。 微妙之功，出於思议之表，变化无穷，故谓之灵也。 宝者，一也。 是三才所得，而清宁贞也。 既不可失，故谓之宝。 若抱之不离，则万福自臻，违之俄顷，则灾祸乱集。 吉凶利害，得失所由，无有能使之然，亦无能使之不然，是以谓之自然。 周济五道，度脱一切，绝灭生死，超逸三界，故谓之无上。 夫人体非圣真，而处身五浊，三尸强盛，内生攻贼，九窍四关，各有所趣，施为之向，动入死地，致伤天年，命不终天寿，犯恶为非，结罪幽司。 故居世轗轲，人道不休，饥寒穷贱，疾病刑罚，灾害所缠，凶祸所集，命过之后，方履苦难。 是故太上天尊，开玄都上宫紫微玉笈，出灵宝妙斋。 以人三关躁扰，不能闲停，身为杀盗淫动，故役之以礼拜； 口有恶言，绮妄两舌，故课之以诵经； 心有贪欲嗔恚之念，故使之以思神。 用此三法，洗心净行。 心行精至，斋之义也。 广愿善念，以弘福业。 持戒之心，当如坠井把绠，不可乍失。 务法之意，如壅崩堤，不可闲惰。 习念之情，如种良田，无有厌足。 一日一夜，奉戒尊法，孜孜不倦，则感通太玄，真灵降集，三尸窜灭，众魔摧伏，如此之愿，愿无不获，志无不克也。 夫圣世难遭，经法难闻，良时难值，明师难遇。 诸贤前生，并有大福，致庆会今身，得值三宝，闻见法音，好尚清虚，餐纳灵味，皆已玄名帝图，金书玉箓，为天堂之福宾，太上之仙客。",
      "translated_text": "**The *Dongxuan Lingbao Rites of the Torch, Candles, Precepts, Penances, Lamps, and Vows***\n\n**Scripture Title:** *Dongxuan Lingbao Explanations on the Torch, Candles, Precepts, Penances, Lamps, and Vows*. Composed by Daoist Lu Xiujing of the Liu-Song dynasty. This text expounds the essentials of Lingbao fasts, precepts, and ritual procedures. One scroll. Base text from the *Zhengtong Daoist Canon*, Dongxuan Section, *Weiyi* (Ritual Propriety) category.\n\n---\n\n**Explanations on the Torch Light Fast**\nBy Lu Xiujing\n\nBefore assembling the fast, one should retire to a private chamber, burn incense, and gird oneself to expound the rites.\n\nThe \"torch light\" (jué guāng) is akin to what Zhuangzi called a \"torch flame\"—a faint illumination. The methods of fasting are most refined, yet practitioners often remain coarse, for the five turbidities and defilements obscure them deeply, as though dwelling in a dark cavern where the sun’s rays never reach. To guide those lost in such gloom, the brightness of lamps and candles is fitting. The \"torch light\" refers precisely to this.\n\nThese explanations outline the main principles of the fast scriptures, presenting the essentials of the ritual body in accessible terms. The intent is to restrain the crude and vulgar while guiding toward profound clarity. It is like a carpenter selecting wood: when the grain is twisted and warped, one must first trim the outer edges before applying the inked line to shape it. I am ashamed of my own clumsiness, which has led to such prolixity. Perhaps the grain of this text is too gnarled for even a master craftsman to work.\n\nWhen preparing for a fast or offering, one should first explain the rites in a private chamber, girding oneself and kindling incense according to proper form.\n\nIn fasting, one must sit in silent seclusion, mastering the passions and closing the gates of the spirit to prevent external burdens from entering. One upholds the Ten Precepts, ensuring worldly thoughts do not arise. One cultivates a heart of courage and vigor, practicing the Ten Daoist Practices. One’s resolve must be firm and unshakable, like a tree deeply rooted. One contemplates the profound and savors the true, ensuring every thought is pure—only then can it be called a fast.\n\n1. **Purifying Bath:** Bathe in fragrant water to cleanse the spirit, qi, and the five limbs, making the nine orifices bright and clear. Clothing must be spotless, both inside and out, suffused with fragrance. This is to welcome the descent of the exalted perfected and to meet the gaze of the numinous and subtle.\n\n2. **Renouncing Worldly Affairs:** Sever all worldly ties, withdraw from internal and external distractions, and abide in tranquil non-action. Body and mind must be at ease, focused and undistracted.\n\n3. **Moderating Diet:** Abstain from rich flavors and curb desires, regulating excess and deficiency so that the organs are harmonized, the spirit and qi purified, and the primordial spring nourished.\n\n4. **Proper Attire and Demeanor:** Maintain solemnity and reverence in dress and bearing. Abandon arrogance and sloth, ensuring no negligence in conduct. Bowing, prostrations, and every act must be performed with utmost propriety.\n\n5. **Silence and Recitation:** Seal the mouth and still the tongue, avoiding idle speech. Regulate the voice and rectify the qi while reciting scriptures. This awakens humans and spirits and resonates with immortals and sages.\n\n6. **Purifying the Mind:** Cleanse the heart and thoughts, banishing perverse imaginings. Subdue the six senses and eradicate the Three Poisons. Focus the spirit on the true, penetrating the profound and subtle.\n\n7. **Incense and Invocation:** Burn incense and waft its smoke, strike the drum to summon the gods. Let the Three Clarities hear above and the Ten Directions know below.\n\n8. **Repentance and Petition:** Confess transgressions and seek forgiveness, making vows with a heart of utmost sincerity, humble and earnest.\n\n9. **Great Compassion:** Extend boundless mercy, pitying all who suffer calamities and afflictions, wishing to deliver them all. May birth and death cease, and sorrow be no more.\n\n10. **Graceful Conduct:** Every movement—advancing, retreating, rising, or bowing—must be refined and unhurried. Encourage one another, confining speech to the Dao, never straying from the Dharma. If one becomes aware of errors or lapses, one must immediately prostrate and repent.\n\nThis is the *Lingbao Natural and Supreme Fast*.\n\n\"Ling\" means \"numinous.\" Its wondrous efficacy transcends thought and imagination, its transformations boundless—hence it is called \"ling.\"\n\n\"Bao\" means \"one.\" It is what the Three Powers (Heaven, Earth, and Humanity) attain, embodying purity, tranquility, and integrity. Since it cannot be lost, it is called \"bao.\" If one embraces it without parting, myriad blessings will naturally arrive. To stray from it even for a moment is to invite chaos and calamity. Fortune and misfortune, benefit and harm, gain and loss—none can compel these outcomes, nor can any prevent them. Thus, it is called \"natural.\"\n\nIt universally aids the Five Paths, delivering all beings, extinguishing the cycle of birth and death, and transcending the Three Realms—hence it is called \"supreme.\"\n\nThough humans are not perfected sages, they dwell in the Five Turbidities, where the Three Corpses thrive, internally generating thieves. The nine orifices and four gates each pursue their own ends, and every action leads toward death, cutting short one’s heavenly years. Failing to fulfill one’s allotted lifespan, one commits evil and accumulates sins in the hidden courts. Thus, in this world, one suffers hardship, never resting from the human path. Hunger, cold, poverty, and lowliness; illness, punishment, and calamity; disasters and misfortunes—all entangle and assail. Only after death does one tread the path of suffering.\n\nThis is why the Most High Heavenly Worthy opened the Purple Tenuity Jade Writ of the Upper Palace of the Mysterious Capital and revealed the wondrous fasts of Lingbao.\n\nHumans are restless in the Three Passes, unable to remain still. Their bodies engage in killing, theft, and lust—thus, they are disciplined through bowing and prostration. Their mouths utter evil words, frivolous speech, and double-tongued deceit—thus, they are tasked with scripture recitation. Their hearts harbor thoughts of greed, desire, anger, and hatred—thus, they are made to contemplate the spirit. Through these three methods, the heart is cleansed, and conduct is purified. When heart and conduct are refined to perfection, this is the meaning of fasting.\n\nOne should widely vow good intentions to expand merit and karma. The resolve to uphold precepts must be like grasping a rope while falling into a well—never letting go for even a moment. The commitment to the Dharma must be like reinforcing a crumbling dam—never allowing laziness. The devotion to practice must be like planting fertile fields—never growing weary. Day and night, one reveres the precepts and honors the Dharma with tireless diligence. Then, one will resonate with the Great Mystery, and the perfected spirits will descend. The Three Corpses will scatter and vanish, and all demons will be subdued. With such vows, nothing will go unfulfilled, and no aspiration will remain unachieved.\n\nThe age of the sages is hard to encounter; the scriptures and Dharma are hard to hear. Favorable times are hard to come by; enlightened teachers are hard to meet. All you worthy ones, in past lives, have accumulated great blessings, bringing this joyous convergence in your present existence. You have encountered the Three Treasures, heard the sounds of the Dharma, and inclined toward purity and emptiness. You have feasted on the flavors of the numinous, and your names are already inscribed in the imperial registers of the celestial archives, written in gold and jade. You are the honored guests of the Heavenly Palace and the immortal companions of the Most High.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1276,
      "start_sentence": 0,
      "end_sentence": 69,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.93164539337158,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洞玄灵宝自然斋仪（南朝宋陆修静）.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "今又擢身法座，服膺法轨，已有善始，何不克终。 当共坚持心志，与懈怠竞，禀承法训，念为妙行，努力励诚，勿计疲劳，一日精进，历世受福。 人命危险，四大难保，百年倏忽，何足为多。 如使衰老奄至，眼暗耳聋，加以众疾，痛恼相缠，眠坐呼吸举动，须人气力。 如是当复能道业精进，预此法座以不。 一失善缘，后会何期，沉溺穷道，悔恨何益。 想思此言，各为身计，相与勉励，共济厄难。 夫人先身有重罪恶对，则为荫盖所裹，六蔽不开，心意曲狭，气性逆戾，迷着五欲，莫窥其外。 甘肥声色，取快目前。 憎善嫉贤，甚若怨雠。 如此之人，在所堕向，与恶为缘，终不与经教相遇，遇亦不信。 见人敬顺道法，乃谓妖妄，咸共诽笑。 夫聋者不闻韶武，瞽者不睹白黑，岂言已病哉。 纵有善识，强相牵挽，既非本性，回生悔心，背真向伪，追逐精邪。 夫欢乐暂过，忧苦延长。 斯辈皆以三涂为归道，地岳为居家，永沦幽夜，不睹三光，抱铜柱，履刀山，循剑树，入镬汤，吞火食炭，终劫无脱。 纵更受生，堕六畜形，身被屠割之酷，魂困三恶之中，往反流曳，可不哀哉。 法烛叙 陆修静撰。",
      "translated_text": "Now you have ascended to the Dharma seat, embracing the Dharma’s discipline—having made a virtuous beginning, why not bring it to fulfillment? Let us together steel our resolve, contending with sloth, upholding the Dharma’s teachings, and regarding mindfulness as sublime practice. Strive with earnest sincerity, sparing no effort, counting no toil. A single day of diligence shall bring blessings across lifetimes.\n\nHuman life is perilous; the four elements are unreliable. A century passes in an instant—how much time is truly ours? If decrepitude suddenly arrives—eyes dimmed, ears dulled, afflictions and pains entwined—then even in sleep, sitting, breathing, or movement, one must rely on others’ strength. In such a state, could one still advance in the Dao’s work, or remain in this Dharma seat?\n\nTo lose this auspicious opportunity—when shall we meet again? To sink into the depths of suffering—what use is regret? Ponder these words, each for your own sake. Encourage one another, and together cross the perilous straits.\n\nIf one’s past lives bear heavy sins and karmic debts, they become enshrouded in obscuring veils, the six senses unopened. The mind grows crooked and narrow, the qi perverse and rebellious. Deluded by the five desires, they see nothing beyond. They indulge in rich flavors, sounds, and sights, seeking fleeting pleasure. They resent goodness and envy the worthy, treating them like foes.\n\nSuch people, wherever they turn, form bonds with evil and never encounter the scriptures and teachings—or if they do, they do not believe. Seeing others reverence and follow the Dao and Dharma, they call it delusion and join in mockery. The deaf do not hear the *Shao* and *Wu* melodies; the blind do not see black from white. Can they be said to suffer from their own afflictions?\n\nEven if wise counsel forcibly drags them forward, it is not their nature. They soon repent, turning from truth to falsehood, chasing after demonic illusions. For them, joy is fleeting, while sorrow stretches long. These beings take the three wretched realms as their path, the earth and mountains as their home. Forever lost in darkest night, they never behold the three luminaries. They embrace copper pillars, tread upon knife mountains, walk beneath sword trees, plunge into cauldrons of boiling oil, swallow fire and devour coals—through endless kalpas, no escape.\n\nEven if reborn, they fall into the forms of the six livestock, their bodies subjected to the cruelty of slaughter, their souls trapped in the three evil destinies. Drifting and tossed between lives, how pitiful they are!\n\n*Dharma Lamp Record*, composed by Lu Xiujing.",
      "overlap_context": "u worthy ones, in past lives, have accumulated great blessings, bringing this joyous convergence in your present existence. You have encountered the Three Treasures, heard the sounds of the Dharma, and inclined toward purity and emptiness. You have feasted on the flavors of the numinous, and your names are already inscribed in the imperial registers of the celestial archives, written in gold and jade. You are the honored guests of the Heavenly Palace and the immortal companions of the Most High.",
      "start_char": 1276,
      "end_char": 1723,
      "start_sentence": 70,
      "end_sentence": 88,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.309571981430054,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洞玄灵宝自然斋仪（南朝宋陆修静）.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "建斋暮始，就烧香宿启，未思神前，东向说之。 法烛。 法者，规矩之谓，总称曰法。 规圆矩方，万物从之，得正者也。 烛者，有光之物，佐月辅日，开昏朗暗，用其明，得有所见也。 邪曲无法，则无以自正，用法无明，则莫见得失。 欲正不可无法，用法不可无明。 自定不可不斋，斋不可无此书。 此书为之法烛，乘之以游道藏，故克获於真宝也。 夫万物以人为贵，人以生为宝。 生之所赖，唯神与气。 神气之在人身，为四体之命。 人不可须臾无气，不可俯仰失神，失神则五脏溃坏，失气则颠蹙而亡。 气之与神，常相随而行。 神之与气，常相宗为强。 神去则气亡，气绝则身丧。 一切皆知畏死而乐生，不知生活之功在於神气，而数凶其心，而犯其气，屡淫其神，而凋其命，不爱其静，存守其真，故致於枉残也。 人何可不惜精守气，以要久延之视，和爱育物，为枝叶之福。 圣人以百姓奔竞五欲，不能自定，故立斋法。 因事息事，禁戒以闲内寇，威仪以防外贼。 礼诵役身口，乘动以反静也。 思神役心念，御有以归虚也。 能静能虚，则匀道合，譬回逸骥之足，以整归真之驾。 严遵云：虚心以原道德，静气以期神灵。 此之谓也。 而末世学者，贵华贱实，福在於静而动以求之，命在於我而舍己就物。 若斯之徒，虽欣修斋，不解斋法，或解斋法，不识斋体，或识斋体，不达斋义，或达斋义，不得斋意。 纷纭错乱，靡所不为，流宕失宗，永不自觉，譬背惊风而顺迅流，不知泝徊反源，遂长沦於苦海，可不悲哉。 余谨博采众经，集为十章，以施斋时，名曰法烛。 宿启说一章，六时行道说六章，三时思神说三章。 若法师必炳之以行斋法，众官主人皆能虚心奉受者，则视听明朗，庶睹大道之门也。 夫道者，至理之目。 德者，顺理而行。 经者，由通之径也。 道犹道路也，德谓善德也，经犹径度也，行犹行步也，法犹法式也。 夫人学道，要当依法寻经，行善成德，以至於道。 若不作功德，但守一不移，终不成道。 譬如人坐於家中，而不行步，岂得见道里邪。 夫道三合成德，自不满三，诸事不成。 三者，谓道、德、仁也。 仁，一也。 行功德，二也。 德足成道，三也。 三事合，乃得道也。 若人但作功德而不晓道，亦不得道。 若但晓道而无功德，亦不得道。 若但有道德而无仁，则至理翳没，归於无有。 譬如种谷，投种土中，而无水润，何能生乎。 有君有臣而无民，何宰牧乎。 有天有地而无人物，何成养乎。 故五千文曰：三生万物。 授上品十戒选署禁罚 悉准按采用陆法师所撰立文。 先宿启毕，次授上品十戒，一时东向平立。 诵智慧颂曰： 智慧起本无，玄玄超十方。 结空峙玄霄，诸天抱流芳。 其妙难思议，灵感真实通。 有有竟不有，无无无不容。 智慧恒观身，学道之所先。 眇眇入玄思，自然录我神。 天尊常拥护，魔王为保言。 晃晃金刚躯，迢迢太上前。 智慧生戒根，真道戒为主。 三宝由是兴，高圣所崇受。 泛此不死舟，倏 欻济大有。 当此说戒时，诸天．来稽首。 次诵毕，一时北向，首体投地，回心礼十方、还向东而伏。 法师还东面向西，说戒威仪。 天尊告太上道君曰：今当普宣法音，开悟群生。 为诸男女解灾却患，请福度命，拔诸苦根。",
      "translated_text": "At the onset of the evening fast, one burns incense and lodges the initial invocation, then, facing east before the deities, recites the following.\n\n**Dharma Lamp.** *Dharma* signifies the compass and square—collectively termed \"the Dharma.\" The compass draws the circle, the square marks the right angle; all things conform to them and thus attain correctness. *Lamp* denotes an object that emits light, aiding the moon and supplementing the sun, dispelling dusk and illuminating darkness. By its radiance, one gains sight. Crookedness and deceit lack the Dharma and thus cannot rectify themselves; applying the Dharma without illumination fails to reveal gains and losses. To rectify, one cannot be without the Dharma; to apply the Dharma, one cannot be without illumination. To stabilize the self, one must fast; to fast, one cannot be without this text. This text serves as the *Dharma Lamp*, guiding one through the Daoist canon to attain the true treasure.\n\nOf all things, humans are most noble; of humans, life is most precious. Life depends on spirit and *qi*. Spirit and *qi* reside within the body as the life of the four limbs. Humans cannot be without *qi* for even a moment, nor can they lose spirit in bowing or rising. Losing spirit causes the five viscera to collapse; losing *qi* brings sudden death. Spirit and *qi* always move in tandem. Spirit and *qi* rely on each other to strengthen. When spirit departs, *qi* perishes; when *qi* is cut off, the body is lost. All fear death and delight in life, yet fail to recognize that the work of living lies in spirit and *qi*. Instead, they repeatedly harm their minds, offend their *qi*, indulge their spirits, and wither their lives. They do not cherish stillness or preserve their true nature, thus inviting ruin.\n\nHow can one not treasure essence and guard *qi* to seek long-lasting vision, harmonizing and nurturing all things to cultivate the blessings of branches and leaves? The sages, seeing the people rushing after the five desires and unable to stabilize themselves, established the fast. Through affairs, they quell affairs; through precepts, they restrain inner foes; through威仪, they guard against external threats. Ritual recitation engages body and speech, steering movement back to stillness. Meditation on the deities engages the mind, guiding existence toward emptiness. In stillness and emptiness, the *qi* harmonizes with the Dao, like reining in a swift steed to align the chariot returning to truth. Yan Zun said: \"Empty the heart to trace the Dao and virtue; still the *qi* to await the divine.\" This is the meaning.\n\nYet scholars of the degenerate age value ornament over substance. Though blessings lie in stillness, they seek them in motion; though life rests within, they abandon the self for external things. Such people, though eager to practice fasting, do not understand its methods. Or, understanding its methods, they do not recognize its form. Or, recognizing its form, they do not grasp its meaning. Or, grasping its meaning, they do not attain its intent. Confused and disordered, they act without restraint, drifting from their origin, forever unaware—like turning from a fierce wind to follow a swift current, ignorant of how to row back to the source, thus sinking forever in the sea of suffering. How tragic!\n\nI have carefully gathered teachings from various scriptures and compiled them into ten chapters, to be applied during fasting, naming it *Dharma Lamp*. The first chapter concerns the initial evening invocation; six chapters address the six periods of ritual circumambulation; three chapters focus on the three periods of meditation on the deities. If the Dharma Master illuminates these to conduct the fast, and all officials and hosts receive them with empty hearts, then their sight and hearing will become clear, and they may glimpse the gate of the great Dao.\n\nThe *Dao* is the name for the ultimate principle. *Virtue* is acting in accordance with that principle. *Scripture* is the path that leads through. The *Dao* is like a road; *virtue* is good virtue; *scripture* is like a measured path; *practice* is like walking; *Dharma* is like a model. Those who study the Dao must follow the Dharma to seek the scriptures, practice goodness to cultivate virtue, and thus attain the Dao. Without performing meritorious deeds, merely holding to one thing without change will never achieve the Dao—like a person sitting at home without walking, how can they see the road?\n\nThe Dao, when combined threefold, forms virtue. Without completing the three, nothing is achieved. The three are: Dao, virtue, and benevolence. Benevolence is one; performing meritorious deeds is two; virtue sufficient to complete the Dao is three. When these three unite, one attains the Dao. If one only performs meritorious deeds but does not understand the Dao, one does not attain the Dao. If one only understands the Dao but lacks meritorious deeds, one does not attain the Dao. If one possesses Dao and virtue but lacks benevolence, the ultimate principle becomes obscured and returns to nothingness. Like sowing grain by casting seeds into the earth without water to moisten them, how can they grow? With a ruler and ministers but no people, how can they govern? With heaven and earth but no beings, how can they nurture? Thus, the *Five Thousand Words* states: \"The three give birth to the ten thousand things.\"\n\nThe selection of precepts and the imposition of prohibitions and penalties follow the established texts composed by Master Lu.\n\nAfter completing the initial evening invocation, the Ten Precepts of the Highest Grade are conferred, with all facing east and standing evenly. The *Hymn of Wisdom* is recited:\n\nWisdom arises from the originless,\nDarkly transcending the ten directions.\nBinding emptiness, it towers in the mystic firmament,\nWhile all heavens embrace its flowing fragrance.\nIts wonder defies thought,\nIts numinous resonance truly connects.\nBeing is ultimately non-being,\nNon-being contains all without exclusion.\nWisdom constantly observes the body,\nThe foremost task in studying the Dao.\nSubtly entering profound contemplation,\nNaturally it records my spirit.\nThe Heavenly Worthy ever protects,\nThe demon kings pledge their guardianship.\nResplendent is the vajra body,\nLofty before the Most High.\nWisdom engenders the root of precepts,\nThe true Dao takes precepts as its master.\nFrom this the Three Treasures arise,\nRevered and received by the exalted sages.\nRiding this deathless vessel,\nSwiftly it crosses the great expanse.\nAt this moment of preaching the precepts,\nAll heavens come to bow their heads.\n\nAfter the recitation, all turn north, prostrate themselves fully to the ground, and, turning their hearts, pay homage to the ten directions before returning to face east and prostrate again. The Dharma Master turns to face west, and, with dignity, proclaims the precepts.\n\nThe Heavenly Worthy addressed the Most High Lord of the Dao, saying: \"Now I shall universally proclaim the Dharma’s sound to awaken all beings. For all men and women, I shall dissolve disasters and avert calamities, entreat blessings and deliver lives, and eradicate the roots of all suffering.\"",
      "overlap_context": "ight, they never behold the three luminaries. They embrace copper pillars, tread upon knife mountains, walk beneath sword trees, plunge into cauldrons of boiling oil, swallow fire and devour coals—through endless kalpas, no escape.\n\nEven if reborn, they fall into the forms of the six livestock, their bodies subjected to the cruelty of slaughter, their souls trapped in the three evil destinies. Drifting and tossed between lives, how pitiful they are!\n\n*Dharma Lamp Record*, composed by Lu Xiujing.",
      "start_char": 1723,
      "end_char": 2970,
      "start_sentence": 89,
      "end_sentence": 160,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.92687225341797,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洞玄灵宝自然斋仪（南朝宋陆修静）.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "使生者见道，身脱八难，死者欢乐，饮食天堂，早生人中，转轮圣王。 修斋求道，皆当一心请奉十戒，谛受勿忘。 专情默念，洞思自然。 勿得杂想，挠乱形神。 能如是者，便当静听。 第一戒者，心不恶妬，无生阴贼。 检口慎过，想念在法。 第二戒者，守仁不杀，愍济群生。 慈受广救，润及一切。 第三戒者，守贞让义，不淫不盗。 常行善念，损己济物。 第四戒者，不色不欲，心无放荡。 贞洁守慎，行无点污。 第五戒者，口无恶言，言不华绮。 内外中直，不犯口过。 第六戒者，断酒节行，调和气性。 神不损伤，不犯众恶。 第七戒者，不嫉人胜己，争竞功名。 每事逊让，退身度人。 第八戒者，不得评论经教，訾毁圣文，躬心承法，恒如对神。 第九戒者，不得斗乱口舌，评详四辈，天人咎恨，伤损神气。 第十戒者，举动施为，平等一心。 人和神穆，行常使然。 天尊言：修奉清戒，每合天心。 常行大慈，愿为一切普度厄世。 谦谦尊教，不得中怠。 宁守善而死，不为恶而生。 於是不退，可得拔度五道，不履三恶，诸天所护，万神所敬，长斋奉戒，自得度世。 天尊言：道尊法妙，人身亦贵。 故道开法，遗戒经文，以度人身。 人身既度，上与道同。 宜为精行，持斋奉戒，夷心静默，志念分明，一意归向，专想不贰，涤荡六腑，过中不味，内外清虚，每合自然。 是其斋日，捻香启愿，应心上彻，四天司逻十部威神，即下履行，观听法音，监映尔心。 如戒行道，皆列功诸天，祸福立彰，道不负人，勤行谛受，勿使魔言。 天尊言：建斋行道，四天帝王皆驾飞云绿軿八景玉舆，从真人玉女，手把花旛，前导凤歌，后从天钧，白鹤狮子，啸歌邕邕，烧香散花，浮空而来。 瞻履行道，观听法音，天王下降，万灵朝焉。 是岂可不尽其法耶。 当先授十戒，然后行道，庠序雅步，静心闲意，坐起卧息，不离仪格，天王欢悦，列名上清，可谓得道方寸之间。 经言：夫感天地，致群神，通仙道，洞至真，解积世罪，灭凶咎，却怨家，修盛德，治疾病，济一切，莫过乎斋转经者也。 夫斋直是求道之本，莫不由斯成矣。 此功德巍巍，无能比者。 上可升仙得道，中可安国宁家，延年益寿，保於福禄，得无为之道； 下除宿愆，赦见世过，救厄缓难，消灭灾病，解脱死人忧苦，度一切物，莫有不宜矣。 经言：夫斋法之大者，莫先太上灵宝斋。 灵宝之文，是天地之元根，神明之户牖，众经之祖宗，无量大法桥也。 若诵经一句，则响彻九霄，诸天设礼，鬼神振肃也。 幽深远妙，难以宣言。 夫非天下之至善，莫能致焉。 非天下之至信，莫能请焉。 非天下之至精，莫能奉焉。 非天下之至才，莫能行焉。",
      "translated_text": "May the living behold the Dao and escape the eight difficulties of embodiment,\nwhile the dead rejoice, feast in celestial halls,\nand swiftly be reborn among men as Wheel-Turning Sage Kings.\nAll who fast and seek the Dao must single-mindedly request and receive the Ten Precepts,\nattending closely lest they forget.\nFocus the mind in silent contemplation,\npenetrating reflection upon the natural.\nLet no stray thoughts disturb body and spirit.\nThose who can do this shall listen in stillness.\n\nThe First Precept: Let the heart harbor no malice or envy,\ngiving no rise to the thieves of yin.\nGuard the mouth and be cautious of transgressions;\nlet thoughts dwell upon the Dharma.\n\nThe Second Precept: Uphold benevolence and refrain from killing,\nshowing compassion and aiding all beings.\nEmbrace kindness and extend salvation,\nnourishing all things.\n\nThe Third Precept: Maintain chastity and yield to righteousness,\nneither lusting nor stealing.\nEver cultivate good thoughts,\nsacrificing the self to aid others.\n\nThe Fourth Precept: Be free from sensuality and desire,\nkeeping the heart from reckless abandon.\nUphold purity and vigilance,\nensuring conduct remains unstained.\n\nThe Fifth Precept: Let the mouth utter no evil words,\nnor speak with ornate deceit.\nBe upright within and without,\ncommitting no transgressions of speech.\n\nThe Sixth Precept: Abstain from wine and moderate conduct,\nharmonizing qi and temperament.\nLet the spirit remain unharmed,\navoiding all manifold evils.\n\nThe Seventh Precept: Do not envy those who surpass you,\nnor contend for fame and merit.\nIn all matters, yield and withdraw,\nhumbling yourself to deliver others.\n\nThe Eighth Precept: Do not criticize the scriptures and teachings,\nnor slander the sacred texts.\nDevote yourself to the Dharma,\never as though in the presence of the divine.\n\nThe Ninth Precept: Do not engage in quarrels or disputes,\nnor judge the four classes of beings.\nLet neither heaven nor man bear resentment,\nlest spirit and qi be harmed.\n\nThe Tenth Precept: In all actions and deeds,\nmaintain equanimity and single-mindedness.\nLet harmony prevail among people and spirits,\nensuring conduct remains thus.\n\nThe Heavenly Worthy declared: Those who cultivate and uphold the pure precepts\never align with the heart of heaven.\nEver practicing great compassion,\nthey vow to universally deliver all from this world of suffering.\nHumbly revering the teachings,\nthey must not grow lax midway.\nBetter to die upholding goodness\nthan to live in evil.\nThus unwavering,\none may escape the five destinies,\navoid the three evils,\nbe protected by all heavens,\nand revered by the myriad spirits.\nThose who maintain long fasts and uphold the precepts\nshall naturally attain deliverance.\n\nThe Heavenly Worthy declared: The Dao is exalted, the Dharma wondrous,\nand the human body is likewise precious.\nThus the Dao unfolds the Dharma,\nbequeathing precepts and scriptures\nto deliver the human form.\nOnce the human form is delivered,\nit ascends to become one with the Dao.\nOne should practice with diligence,\nmaintaining fasts and upholding precepts,\ncalming the mind in stillness,\nkeeping aspirations clear,\nfocusing intent single-mindedly,\nwithout distraction.\nPurify the six viscera,\navoid rich flavors at meals,\nand maintain inner and outer purity,\never in accord with the natural.\nOn such fasting days,\nlight incense and make vows,\nso that the heart’s sincerity ascends.\nThe patrolling deities of the Four Heavens\nand the mighty spirits of the Ten Divisions\nwill descend to observe,\nlistening to the Dharma’s sound\nand overseeing your heart.\nThose who uphold the precepts and practice the Dao\nshall have their merits recorded in the heavens,\nwhere fortune and misfortune manifest instantly.\nThe Dao does not fail those who practice diligently;\nattend closely and receive without doubt,\nlest demonic words deceive.\n\nThe Heavenly Worthy declared: When establishing fasts and practicing the Dao,\nthe Four Heavenly Kings ride upon flying clouds,\ngreen-canopied eight-jewel jade chariots,\naccompanied by perfected beings and jade maidens,\nholding flower banners,\nleading with phoenix songs,\nfollowed by celestial music.\nWhite cranes and lions\nsing in harmonious chorus,\nburning incense and scattering flowers,\nfloating through the void as they come.\nThey gaze upon those practicing the Dao,\nlistening to the Dharma’s sound.\nThe Heavenly Kings descend,\nand the myriad spirits pay homage.\nHow could one not fully adhere to this Dharma?\nFirst receive the Ten Precepts,\nthen practice the Dao,\nproceeding with refined steps,\ncalming the heart and quieting the mind.\nIn sitting, rising, lying, and resting,\nnever depart from proper decorum.\nThe Heavenly Kings rejoice,\nand names are inscribed in the Upper Clarity.\nThis is truly attaining the Dao within the square inch of the heart.\n\nThe scripture states: To move heaven and earth,\nsummon the hosts of spirits,\ncommunicate with the Dao of immortals,\npenetrate the utmost truth,\ndissolve the sins of past lives,\nextinguish misfortune,\nrepel vengeful foes,\ncultivate great virtue,\nheal illnesses,\nand deliver all beings—\nnothing surpasses the practice of fasting and reciting scriptures.\nFasting is indeed the foundation of seeking the Dao,\nthrough which all accomplishments are achieved.\nIts merit is towering,\nunmatched by any other.\nAbove, it enables ascension to immortality and attainment of the Dao;\nin the middle, it brings peace to nations and families,\nprolongs life and increases longevity,\nand secures blessings and prosperity,\nattaining the Dao of non-action.\nBelow, it erases past transgressions,\npardons present faults,\nrescues from distress and eases hardship,\ndispels disasters and illnesses,\nrelieves the suffering of the dead,\nand delivers all beings—\nnothing is inapt.\n\nThe scripture states: Among the great methods of fasting,\nnone precedes the *Lingbao* Fast of the Most High.\nThe *Lingbao* scriptures\nare the primordial root of heaven and earth,\nthe gateway and window of the divine,\nthe ancestor of all scriptures,\nand the bridge of boundless great Dharma.\nIf one recites but a single sentence,\nits resonance pierces the nine heavens,\nand all heavens pay homage,\nwhile ghosts and spirits stand in awe.\nProfound and wondrous,\nbeyond full declaration—\nonly the utmost goodness in the world\ncan achieve this.\nOnly the utmost sincerity in the world\ncan invoke this.\nOnly the utmost devotion in the world\ncan uphold this.\nOnly the utmost talent in the world\ncan practice this.",
      "overlap_context": "the ground, and, turning their hearts, pay homage to the ten directions before returning to face east and prostrate again. The Dharma Master turns to face west, and, with dignity, proclaims the precepts.\n\nThe Heavenly Worthy addressed the Most High Lord of the Dao, saying: \"Now I shall universally proclaim the Dharma’s sound to awaken all beings. For all men and women, I shall dissolve disasters and avert calamities, entreat blessings and deliver lives, and eradicate the roots of all suffering.\"",
      "start_char": 2970,
      "end_char": 4020,
      "start_sentence": 161,
      "end_sentence": 211,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.63757634162903,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洞玄灵宝自然斋仪（南朝宋陆修静）.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "太上所重，众真所尊，皆铸金为字，刻书玉篇，封之於无上大罗天玄都玉京山紫微上宫七宝玄台。 此台则是太上所治也。 五老侍卫，万帝朝真，玉女执巾，金童扬烟，焚百和合香，流熏紫庭，吐日精以却秽，散月华以拂尘，神灯朗照，炳烛合明，金风八散，庆云四陈。 飞龙毒兽，备卫玉阙。 十方至真，三千大千已得道大圣众，及自然妙行真人，皆一日三时旋绕上宫，稽首行礼，飞虚浮空，散花烧香，手把十绝，啸咏洞章，赞九天之灵奥，尊玄文之妙重也。 今道士斋时，所以巡绕高座，吟咏步虚者，正是上法玄根众圣真人，朝宴玉京时也。 行道礼拜，皆当安徐雅步，审整庠序，俯仰齐同，不得参差。 巡行步虚，皆执板当心。 冬月不得拱心，夏月不得把扇，唯正身前向，临目内视，存见太上在高座上，注念玄真，使心形同丹，合於天典，则为飞仙之所嗟叹，三界之所轨范，鬼神之所具瞻也。 不得左顾右盻，更相前卸，及言语笑谑，有所呵唤，则触忤威灵，四司纠过，五帝结刑，明科所禁，可不慎哉。 经言：斋时日夕各三时，烧香悔过，唯一心听受经法妙赜之义。 故转经说法，像古真人教化时也。 圣人传授经教，教於世人，使未闻者闻，未知者知。 欲以此法桥，普度一切人也。 行道之时，故不可得乱语，论及世务，唯当请问法师经义禁戒，法师当为解说真要。 能使内外夷然，敬受经一句，则司命延加十算，后皆聪明智慧。 若内外躁竞，毁忤经文一句，则司命夺十算，后随痴愚盲道。 故真人不言，言必有中，言皆合於法言。 人能弘道，非道弘人，此之谓也。 说戒毕，法师依旧选署众官。 众官长跪受简札。 明日行道，各典所署。 法师 经云：当举高德，玄解经义。 斯人也，道德内充，威仪外备，俯仰动止，莫非法式，三界所范，鬼神所瞻，关启祝愿，通真召灵，释疑解滞，导达群贤。 都讲 经云：才智精明，闲炼法度。 其任也，行道时节，上下食息，先自法师，次引众官，礼拜揖让，皆当赞唱。 监斋 其职也，司察众过，弹纠愆失，秉执科宪，随事举白，必使允当，不得隐滥。 侍经 其职也，营侍尊经，整理巾蕴，高座几案，四座席地，拂拭齐整，不得怠懈。 侍香 其职也，当料理炉器，恒令火然灰净。 六时行道，三时讲诵，皆预备办，不得临时有阙。 侍灯 其职也，景临西方，备办灯具，依法安置，光焰火然，恒使明朗。 若遇风雨，火势不立，谘白法师，宜停乃停，不得怠替，辄令阙废。 选署毕，左回上香，东向祝，复香。 众官引行出治，按次列坐，勿解带。 法师更为宣科说禁，告示威仪，众官静听。 道士登斋，皆当各赍巾褐，手板履具，不得临时交换彼我，於事有阙，勿得牵引非己之服。 斋日烧香，上讲都讲，当率众官，先下床，西向倚。 法师然后下座，引行尊卑，以次安行雅步，到於道户。 不得更相越错，迟疾不均，皆依事纠罚。 烧香竟，及下讲，率众官先出治户，还悉西向倚。 法师后至上床，众官一时礼一拜，然后就坐。 道士登斋起居，皆当关白监斋，礼法师一拜，次礼香三拜而去。 还亦如之，有违罚如后条： 到斋堂展履不整，罚油二升。 坐起不庠序，罚朱半两。 不正坐，罚香二斤。 翻覆香火，罚香半斤。",
      "translated_text": "The Most High holds it in the highest regard, and all perfected beings revere it—all cast in golden characters, inscribed upon jade tablets, sealed within the Supreme Great Luotian, the Mystic Capital’s Jade Capital Mountain, the Purple Tenuity’s Upper Palace, upon the Seven Treasures’ Mystic Terrace. This terrace is where the Most High presides. The Five Elders stand in attendance, the Ten Thousand Emperors pay homage to the perfected, jade maidens hold the towels, golden youths waft incense, burning the hundred harmonies’ blended fragrance to suffuse the Purple Court. They exhale the essence of the sun to dispel impurity, scatter the radiance of the moon to brush away dust. Divine lamps shine brightly, their flames merging in brilliance; golden winds scatter in eight directions, auspicious clouds array in four quarters. Flying dragons and poisonous beasts guard the jade gates. The perfected of the ten directions, the great sages of the three thousand great thousand worlds who have attained the Dao, and the spontaneously wondrous and practiced perfected ones—all circumambulate the Upper Palace thrice daily, bowing in reverence, soaring through empty space, scattering flowers and burning incense. In their hands they hold the Ten Absolutes, chanting and intoning the profound chapters, praising the numinous mysteries of the Nine Heavens and honoring the wondrous weight of the Mystic Writ.\n\nNow, when Daoists fast and circumambulate the high seat, chanting and pacing the void, they precisely emulate the ancient root of the Mystic, the assembly of the perfected sages as they pay court in the Jade Capital. In performing the Dao and offering obeisance, all should move with calm and refined steps, their bearing orderly and composed, their bows and gazes aligned, without disorder. As they circumambulate and pace the void, all hold tablets before their hearts. In winter, they must not clasp their hands over their hearts; in summer, they must not fan themselves. They should face forward with upright bodies, their eyes gazing inward, visualizing the Most High upon the high seat, fixing their thoughts upon the Mystic and True, so that heart and form become as cinnabar, in harmony with the celestial canon. Thus shall they be marveled at by flying immortals, serve as the model for the Three Realms, and be beheld with reverence by ghosts and spirits.\n\nThey must not glance left or right, nor jostle one another, nor speak or laugh in jest, nor call out—lest they offend the numinous majesty, be censured by the Four Controllers, or incur the Five Emperors’ penalties. The clear statutes forbid such transgressions; how can one not be cautious?\n\nThe scripture states: During the fast, at dawn and dusk, thrice daily, burn incense and repent transgressions, listening with single-minded devotion to the wondrous and profound meanings of the scriptural Dharma. Thus, when the scriptures are recited and the Dharma expounded, it is as when the ancient perfected ones taught and transformed. The sages transmit the scriptural teachings to the world, that those who have not heard may hear, and those who have not known may know. By this Dharma bridge, they universally deliver all people.\n\nDuring the performance of the Dao, one must not speak idly or discuss worldly affairs; one should only inquire of the Dharma Master regarding the scriptural meanings and precepts. The Dharma Master shall then expound the true essentials. If one can achieve inner and outer tranquility, reverently receiving even a single sentence of the scripture, the Controller of Destinies shall add ten years to one’s lifespan, and thereafter one shall be wise and enlightened. If one is restless within or without, and offends even a single sentence of the scripture, the Controller of Destinies shall deduct ten years, and thereafter one shall follow blind and foolish paths.\n\nThus, the perfected do not speak idly; when they speak, their words strike true, all in accord with the Dharma’s speech. It is said: “Humans can magnify the Dao; the Dao does not magnify humans.”\n\nWhen the precepts have been expounded, the Dharma Master once more selects and appoints the assembly’s officers. The officers kneel to receive their tablets. On the morrow, during the performance of the Dao, each shall oversee their appointed duties.\n\nThe Dharma Master—\nThe scripture states: One should elevate those of lofty virtue, profound in their understanding of the scriptural meanings. Such a person’s virtue fills them within, their majestic bearing manifests without; in every movement and stillness, they embody the Dharma’s model. They are the exemplar of the Three Realms, the gaze of ghosts and spirits. In opening prayers and invoking blessings, they commune with the perfected and summon the numinous, resolving doubts and dispelling obstructions, guiding and enlightening the assembly of worthies.\n\nThe Precentor—\nThe scripture states: One of keen intelligence and clarity, practiced in the Dharma’s disciplines. Their duty is, during the performance of the Dao, in all matters of eating and resting, to follow the Dharma Master’s lead, then guide the assembly of officers in bowing, yielding, and all acts of reverence, which they shall intone and chant.\n\nThe Fasting Supervisor—\nTheir duty is to oversee the assembly’s transgressions, to censure and correct faults, to uphold the statutes and ordinances, and to report all matters as they arise, ensuring all is just and proper, without concealment or leniency.\n\nThe Scripture Attendant—\nTheir duty is to serve the honored scriptures, arranging the cloth wrappings, the high seat and its table, and the seating mats on all four sides, keeping all clean and orderly, without negligence.\n\nThe Incense Attendant—\nTheir duty is to prepare the censer and its implements, ensuring the fire burns and the ash remains clean. During the six periods of the Dao’s performance and the three periods of recitation and lecture, all must be prepared in advance, without last-minute deficiencies.\n\nThe Lamp Attendant—\nTheir duty is, as the sun approaches the western horizon, to prepare the lamp implements, arranging them according to the Dharma, ensuring the flames burn brightly and steadily. If wind or rain prevents the fire from standing, they shall consult the Dharma Master, and only then may the lamps be extinguished. They must not be negligent, nor allow any lapse or omission.\n\nWhen the selection and appointment of officers is complete, they circumambulate to the left to offer incense, facing east to pray, then return to the incense. The officers lead the procession to the hall, arranging themselves in order and taking their seats without loosening their sashes.\n\nThe Dharma Master then proclaims the statutes and precepts, instructing the assembly in the majestic bearing, which all shall listen to in silence.\n\nWhen Daoists enter the fast, each shall bring their own towel, robe, tablet, and footwear; they must not exchange these with others at the last moment, lest there be deficiencies, nor may they borrow garments not their own.\n\nOn the day of the fast, when burning incense or descending from the lecture, the Precentor shall lead the assembly of officers to first descend from their seats and stand facing west. The Dharma Master shall then descend from the high seat, leading the procession in order of seniority, moving with refined and measured steps to the Dharma gate. They must not jostle or overtake one another, nor move too swiftly or slowly, all subject to censure and penalty according to the statutes.\n\nWhen the incense offering is complete, and when descending from the lecture, the Precentor shall lead the assembly of officers to first exit the hall and stand facing west. The Dharma Master shall then ascend to the high seat, whereupon all officers shall bow once in unison before taking their seats.\n\nWhen Daoists enter or leave the fast, they shall report to the Fasting Supervisor, bow once to the Dharma Master, then bow thrice to the incense before departing. Upon returning, they shall do likewise. Transgressions shall be penalized as follows:\n\nArriving at the fasting hall with disheveled footwear: two *sheng* of oil.\nSitting or rising without order: half a *liang* of cinnabar.\nSitting improperly: two *jin* of incense.\nUpsetting the incense or fire: half a *jin* of incense.",
      "overlap_context": "the divine,\nthe ancestor of all scriptures,\nand the bridge of boundless great Dharma.\nIf one recites but a single sentence,\nits resonance pierces the nine heavens,\nand all heavens pay homage,\nwhile ghosts and spirits stand in awe.\nProfound and wondrous,\nbeyond full declaration—\nonly the utmost goodness in the world\ncan achieve this.\nOnly the utmost sincerity in the world\ncan invoke this.\nOnly the utmost devotion in the world\ncan uphold this.\nOnly the utmost talent in the world\ncan practice this.",
      "start_char": 4020,
      "end_char": 5294,
      "start_sentence": 212,
      "end_sentence": 264,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.657705783843994,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洞玄灵宝自然斋仪（南朝宋陆修静）.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "临行事与外人言，罚香一斤。 侍经不整饰，高座触物，罚香半斤。 语及世务，罚油二升。 语言戏笑，罚朱一两。 倚语低睡，罚朱半两。 翻覆灯油，罚油五升。 巾褐不整，罚香半斤。 内外不豫相检饬，音声高厉，罚油五升。 听经倚据不执简，罚油一升。 不注念清虚，心想意倦，为众所觉，罚油二升。 起出斋堂，不相关白，罚油二升。 垂发驰步，罚香一斤。 读经忽乱，请问败句，罚油五升。 唱声不齐，罚油二升。 行香不洗手漱口，罚油二升。 坐起揖让失仪，罚香半斤。 巡行不依次第，罚香半斤。 侍香香烟中绝，罚油四升。 都讲不谨唱赞，罚香一斤。 起行来及还坐，不礼经三拜径去，罚香一斤。 侍灯灯火中灭，罚香一斤。 临烧香突行，罚油一升。 斋主供具不办，触物有阙，罚香一斤。 执纠见过，不弹私隐，罚油六升。 受关不启上，罚油三升。 斋次而因起居，逃遁不返，为众所纠，罚油一斗，香一斤。 妄言绮语，论及私鄙，罚香一斤，油五升，朱三两。 金箓曰：登斋下座，於法事有亏。 从一至三，监斋依事。 弹罚从三以上，当断功削除，宣示同学，不得容在法座。 监斋容纵不纠，亦同生者之罚。 又上座法师，於事有亏，当录愆失，送简监斋，从一至三，断功三百日，不得更在法座。 威仪曰：罚物送斋主，宣示百姓，然后供公家用。 凡此禁制，并出玄都上官明科旧典，戒於惰慢，检肃愆违。 天尊慈仁，曲愍行尸斋而获罪，故开黜罚之科，听以香油输赎，可得灾蒙释散，不欲令结罪冥中。 兼使犯宪之子，知怀愧恻之心，改涂革弊，自新有阶。 又香油乃不为多，然卒难交办。 且道士一日斋会，多非旧众。 法座既毕，各各离散，不得输送，更违经旨，增其咎考。 夫逆恶之身，犯莫大之罪，犹使斋戒请赎，消散衅负。 且斋之所修，尊乎礼拜，而况戒尚之士。 但仪式之失，若以礼拜罚之，亦在可通，其拜数多少，当随目轻重，执事之官，临时详判，敬白斋主。 夫斋法至精，威禁甚严。 所以尔者，天真大神，十方众圣，及三界群灵，皆亲降斋所，观听行道。 魔王叉手作礼，所在神祇，皆来侍卫门户。 斋主当洒扫宅舍，必令净洁。 丁勅大小，使内外静寂，标门断客，不得使异人常俗之徒，往来干冒。 若善男善女，信乐道法，束带清静，听来观化，然当别席坐起，不得参杂。 斋主大小，皆束带蹑履，不得散诞跟履。 若宜处分，每和声下气，不得更相呼唤。 音声高厉，则触作天真，犯干灵禁。 客及斋主，若有哀惨，虽未相见，皆当夷常，不得慰吊，哀声相对。 若宾贱主贵，有瓦玉之殊，世情拘系，多未通达。 虽复凭向道法，不能恭敬道士。 夫道尊德贵，天下莫二。 虽道士卑微，其标心高大。 斋主既希怀幽微，期诚恩佑，法应逊意，屈节指情，虚己则善德归流，福喜交集。 不得凝抗倨傲。 轻忽道士，则幽津挹绝，玄泽不至。 夫上天降雨而均注无偏，川流常盈而峰岭无润，为其形高崄峭，无有容纳之处。 东海所以独为百川王者，非能恃威任势，强制苟抑，但由其体。 夫极旷而处卑居下，含垢莫逆，致为众流所凑，若有小儿未堪执斋，不得令触近治堂，干预斋次。 夫斋者，正以清虚为体，恬静为业，廉卑为本，恭敬为事。",
      "translated_text": "Speaking to outsiders during ritual proceedings: one *jin* of incense.\nAttending to the scriptures with disheveled attire, or touching objects from the high seat: half a *jin* of incense.\nDiscussing worldly affairs: two *sheng* of oil.\nEngaging in frivolous speech or laughter: one *liang* of cinnabar.\nMuttering or dozing off: half a *liang* of cinnabar.\nSpilling lamp oil: five *sheng* of oil.\nWearing headscarves or robes improperly: half a *jin* of incense.\nFailing to maintain mutual discipline, or raising one’s voice harshly: five *sheng* of oil.\nListening to scriptures while leaning or resting without holding a tablet: one *sheng* of oil.\nLacking focused reverence, or allowing the mind to wander—if noticed by others: two *sheng* of oil.\nLeaving the fasting hall without reporting: two *sheng* of oil.\nLetting hair hang loose or walking hurriedly: one *jin* of incense.\nReciting scriptures carelessly, or mispronouncing passages when questioned: five *sheng* of oil.\nChanting out of unison: two *sheng* of oil.\nPerforming the incense ritual without washing hands or rinsing the mouth: two *sheng* of oil.\nFailing to observe proper etiquette in bowing, rising, or yielding: half a *jin* of incense.\nCirculating out of order: half a *jin* of incense.\nAllowing incense smoke to extinguish while tending it: four *sheng* of oil.\nThe Precentor failing to chant or praise with care: one *jin* of incense.\nRising, moving, or returning to one’s seat without bowing thrice to the scriptures before departing: one *jin* of incense.\nAllowing the lamp to extinguish while tending it: one *jin* of incense.\nRushing forward abruptly during the incense offering: one *sheng* of oil.\nThe Fasting Supervisor failing to prepare offerings, or causing shortages: one *jin* of incense.\nThe Enforcer observing transgressions but concealing them out of favoritism: six *sheng* of oil.\nReceiving reports but failing to present them to superiors: three *sheng* of oil.\nLeaving the fast to attend to personal matters and failing to return—if reported by others: one *dou* of oil and one *jin* of incense.\nEngaging in deceitful or vulgar speech, or discussing private improprieties: one *jin* of incense, five *sheng* of oil, and three *liang* of cinnabar.\n\nThe *Golden Register* states: Ascending or descending the fast without fulfilling ritual duties shall be addressed by the Fasting Supervisor according to the offense. For three or more infractions, the offender shall be stripped of their rank and expelled, with their transgressions announced to the assembly, and they shall not be permitted to remain in the ritual seat. If the Fasting Supervisor neglects to enforce these rules, they shall receive the same penalty as the offender. Should the Dharma Master in the high seat fail in their duties, their faults shall be recorded and reported to the Fasting Supervisor. For one to three infractions, they shall be barred from the ritual seat for three hundred days.\n\nThe *Statutes on Dignity* state: Fines shall be delivered to the Fasting Supervisor, announced to the assembly, and then used for public purposes. All these prohibitions derive from the ancient codes of the Supreme Bureau of the Mysterious Capital, serving to curb negligence and enforce discipline. The Heavenly Worthy, in boundless compassion, pities those who incur sin through ritual lapses and thus permits redemption through offerings of incense and oil, that their misfortunes may be dispelled and their offenses dissolved, rather than allowing them to accumulate in the unseen realm. This also awakens remorse in the transgressor, prompting reform and renewal. Though the required offerings of incense and oil may seem modest, they are often difficult to procure at short notice. Moreover, Daoists gathered for a fast are often not regular members of the community; once the ritual concludes, they disperse, and fines may go unpaid, further violating the scriptural intent and compounding their guilt. Even those guilty of grave offenses may seek redemption through fasting and atonement. How much more should those who uphold the precepts strive for reverence in ritual? If minor lapses in decorum are to be penalized with prostrations, this too may be permissible, with the number of bows determined by the severity of the offense. The officiating officers shall assess each case and report to the Fasting Supervisor with due respect.\n\nThe fast is a practice of utmost refinement, governed by strict prohibitions. This is because the Heavenly Perfected, the Great Spirits, the sages of the ten directions, and the myriad spirits of the three realms all descend to the ritual site, observing and witnessing the proceedings. Demon kings bow in reverence, and local deities stand guard at the gates. The Fasting Supervisor must ensure the premises are swept clean. All, great and small, must maintain silence, and the gates must be marked to bar entry, preventing interference from outsiders or the uninitiated. If devout men and women, sincere in their faith, arrive in proper attire to observe the ritual, they shall be seated separately and not intermingled with the assembly. All participants, high and low, must wear sashes and proper footwear, not slouching or shuffling. When giving instructions, voices must be gentle and measured; shouting is forbidden. Harsh voices disturb the Heavenly Perfected and violate the sacred prohibitions. If guests or the Fasting Supervisor are in mourning, even if they have not met, they must maintain composure and avoid expressions of grief or consolation.\n\nIf guests are of lower status than the host, or if worldly distinctions create disparity, they may not fully grasp the reverence due to Daoists. Yet the Dao is supreme, its virtue unmatched; though a Daoist may be humble, their aspirations are lofty. The Fasting Supervisor, seeking divine favor, should humble themselves, yield to the Daoist’s guidance, and empty their pride, that virtue may flow and blessings abound. They must not remain aloof or arrogant, for to slight a Daoist is to sever the unseen currents of grace and block the descent of celestial blessings. Heaven’s rain falls evenly, yet mountain peaks remain dry, for their steep heights leave no place to receive it. The Eastern Sea reigns over all rivers not by force or coercion, but by its nature—vast and lowly, embracing all impurities, drawing the convergence of countless streams. If a child is too young to participate in the fast, they must not be allowed near the ritual hall or disrupt the proceedings.\n\nThe essence of the fast lies in purity and emptiness, its practice in tranquility, its foundation in humility, and its conduct in reverence.",
      "overlap_context": "ng their seats.\n\nWhen Daoists enter or leave the fast, they shall report to the Fasting Supervisor, bow once to the Dharma Master, then bow thrice to the incense before departing. Upon returning, they shall do likewise. Transgressions shall be penalized as follows:\n\nArriving at the fasting hall with disheveled footwear: two *sheng* of oil.\nSitting or rising without order: half a *liang* of cinnabar.\nSitting improperly: two *jin* of incense.\nUpsetting the incense or fire: half a *jin* of incense.",
      "start_char": 5295,
      "end_char": 6601,
      "start_sentence": 265,
      "end_sentence": 327,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.06894111633301,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洞玄灵宝自然斋仪（南朝宋陆修静）.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "战战兢兢，如履冰谷，肃肃栗栗，如对严君。 至经句辄起礼拜，当一心称善，随意愿念，唯令丹苦，必有感应。 太上道眼，恒洞观诸天下之善恶，无有毫遗也。 洞玄灵宝齐说光烛戒罚灯祝愿仪竟",
      "translated_text": "With trembling caution, as though treading upon ice or crossing a ravine; with solemn dread, as though standing before a stern sovereign. At every verse of the scripture, rise to perform the rites of bowing. In each moment, single-mindedly invoke goodness, following the promptings of one’s intent and aspirations—only let sincerity be pure, and response will surely come. The Most High’s Daoist gaze ever pierces through, surveying all good and evil beneath the heavens, with no detail overlooked.\n\nHere concludes the *Ritual of the Illuminating Lamp for the Precepts and Penalties in the Cavernous Mystery of the Numinous Treasure*.",
      "overlap_context": "in dry, for their steep heights leave no place to receive it. The Eastern Sea reigns over all rivers not by force or coercion, but by its nature—vast and lowly, embracing all impurities, drawing the convergence of countless streams. If a child is too young to participate in the fast, they must not be allowed near the ritual hall or disrupt the proceedings.\n\nThe essence of the fast lies in purity and emptiness, its practice in tranquility, its foundation in humility, and its conduct in reverence.",
      "start_char": 6601,
      "end_char": 6690,
      "start_sentence": 328,
      "end_sentence": 331,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.0167787075042725,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洞玄灵宝自然斋仪（南朝宋陆修静）.txt",
        "category": "威仪类"
      }
    }
  ]
}