{
  "source_id": "洞玄灵宝太上真人问疾经",
  "source_file": "chunked_daozang\\洞玄灵宝太上真人问疾经.json",
  "total_chunks": 11,
  "total_original_chars": 12069,
  "total_translated_chars": 72014,
  "total_translation_time": 328.9990177154541,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太平部\\洞玄灵宝太上真人问疾经.txt",
    "category": "正统道藏太平部"
  },
  "full_translation": "**The Supreme Perfected One’s Scripture on Inquiring About Illness from the Cavernous Mystery Numinous Treasure**\n\n**Scripture Title:** *The Supreme Perfected One’s Scripture on Inquiring About Illness from the Cavernous Mystery Numinous Treasure*. Author unknown, approximately composed during the Sui or Tang dynasties. It expounds on the causes of worldly suffering and exhorts people to observe purification rites and practice the Dao. One fascicle. Base text from *The Orthodox Daoist Canon*, Peace Section.\n\n---\n\n**Preface to *The Supreme Perfected One’s Scripture on Inquiring About Illness from the Cavernous Mystery Numinous Treasure***\n\nAt that time, the Heavenly Worthy of Numinous Radiance and Treasure Repository was in the World of Benevolent Worthies beneath the Dragon’s Teeth Mountain, beneath the *Qianhua* Tree in the Northern Dragon’s Mysterious Realm. With the assembly of the ten directions’ great sagely hosts—numbering hundreds of thousands of myriads—all gathered upon their dharma seats, they deliberated, discoursed, and meticulously examined the Great Vehicle scriptures, which are called the *Five Thousand Characters*.\n\nDay and night, they savored their shared discourse as though never sated, never weary, never fatigued, never remiss. From the four directions came those who had attained the Dao, those nearing its fruition, those yet to attain it, and those who had already done so—such multitudes as numerous as the grains of sand. There were also the Four Heavenly Kings, the Heavenly Kings of Brahma-qi, the Heavenly Emperor Śakra of the ten directions, the thousand myriads of Kunlun Kings, all those governed by the Kunlun, the thirty-two Brahma Heavenly Kings and spirits of the heavens, the demon kings of the heavens, the spirit kings of mountains and seas, the spirit kings of the Yang Valley—numbering hundreds of thousands of myriads.\n\nThe beings of the Three Realms, both human and non-human, all those with blood in their veins, numbered hundreds of thousands of myriads. The ninety-eight kinds of externalist beings, along with their gods and spirits, also numbered hundreds of thousands of myriads. There were also the Wheel-Turning Sage Kings, the Heavenly Sons of the Sun and Moon, and the heavenly sons of the ten directions’ worlds—numbering hundreds of thousands of myriads. Each arrived with their mounts, palaces, wives, and concubines beneath the *Qianhua* Tree to hear the Heavenly Worthy expound the Dharma.\n\nThe meaning of the Great Vehicle scriptures is profound and abstruse, difficult to fathom in detail. None among these multitudes could comprehend it, yet though they could not understand, their hearts rejoiced, forgetting all worldly defilements. Each scattered fragrant flowers to make offerings to the Heavenly Worthy, praying for clarity and understanding.\n\nThe Heavenly Worthy said: “What I expound—the Great Vehicle scriptures and the matters of the Three Attainments—cannot be comprehended.”\n\nAmong the assembly were the eternally abiding High Perfected Ones, as well as the High Perfected Ones of the past and present—numbering hundreds of thousands of myriads. Among them were eighty-six thousand great disciples of the Great Vehicle who had attained perfect clarity. Their names were: Perfected One of Primordial Beginning, Perfected One of the Heavenly Sovereign, Perfected One of the Great Ultimate, Perfected One of the August Sovereign, Perfected One of the Supreme Sovereign, Perfected One of the Great One, Perfected One of Great Peace, Perfected One of Great Simplicity, Perfected One of Great Origin, Perfected One of the Radiant Sovereign, Perfected One of the Long Night, Perfected One of Orthodox Unity, Perfected One of Fixed Radiance, Perfected One of Lofty Grace, Perfected One of Wondrous Sound, Perfected One of Lingering Net, Perfected One of Great Emptiness, Perfected One of Mysterious Wonder, Perfected One of Wise Renown, Perfected One of Great Penetration, Perfected One of Boundless Measure, Perfected One of Mysterious Quiescence, Perfected One of Self-Mastery, Perfected One Who Governs the Three Realms, Perfected One of Great Strength, Perfected One of Boundless Power, Perfected One of Auspicious Marks, Perfected One of Luminous Understanding, Perfected One of Wisdom, Perfected One of Impermanence, Perfected One of the Guiding Master, Perfected One Who Shatters Evil, and Perfected One Who Preserves Longevity.\n\nAll these Perfected Ones had mastered the Dharma of the Great Vehicle, having cultivated the supreme practice in prior kalpas to attain their perfected state. Among the assembly were those of minor kalpas, as numerous as the grains of sand. In their former lives, they had no affinity for the Great Vehicle Dharma, and thus remained in minor kalpas. Yet upon hearing the Great Vehicle scriptures expounded, their hearts rejoiced, though none dared to ask questions.\n\nThen the fifth disciple, the Perfected One of Non-Beginning, rose and made obeisance, addressing the Heavenly Worthy: “Now that the Great Vehicle Dharma is being expounded, many do not understand. None can grasp it, and they are unworthy to receive it. They can only make constant offerings, praying that in future lives they may attain the supreme perfection of the Perfected.”\n\nThe Heavenly Worthy said: “I now expound the Great Vehicle Dharma, and you all comprehend it clearly. Yet in future kalpas, beings will be unable to grasp its purport.”\n\nThereupon, he raised his left hand and pointed to the fifth and sixth disciples—the Perfected One of Non-Beginning and the Perfected One of Fixed Radiance—saying: “You two shall serve as guiding masters in the Worthy Kalpa. You shall receive the title Heavenly Master of Non-Beginning, and Fixed Radiance shall receive the title Heavenly Master of Fixed Radiance.”\n\nHe then pointed to the seventh disciple, the Perfected One of Orthodox Unity, and the eighth disciple, the Perfected One of Mysterious Wonder, saying: “You two shall guide the Three Vehicles of my Dharma in the Defiled Kalpa. The Perfected One of Orthodox Unity shall receive the title Dharma Master of the Three Heavens, and the Perfected One of Mysterious Wonder shall receive the title Dharma Master of the Six Perfections.”\n\n“You four disciples, through kalpas past, present, and future, shall gradually progress from the coarse to the subtle, and by virtue of the blessings of the great beings, the kings of nations, and the sons born of the wombs of Dharma Kings, you shall guide all sentient beings, deliver them from the sufferings of hell, transform the great destinies of the heavens, and diligently apply yourselves so that in the midst of the worthy and the defiled, they may come to know and understand the purport of my Dharma.”\n\n“I now divide my body and disperse my titles, multiplying them into hundreds of thousands of myriads—this is because of the afflictions of illness. *Yi* is the first name, *Xi* the second, *Wei* the third. These are the foremost of the Three Vehicles, the beginning of the Three Caverns. Within them are divisions and dispersals, forming thousands of myriads of scriptures.”\n\n“In the first kalpa to come, I shall be the Heavenly Treasure Lord in the Jade Clarity Palace—this is my first name. In the second kalpa, I shall be the Numinous Treasure Lord in the Purple Tenuity Palace—this is my second name. In the third kalpa, I shall be the Spirit Treasure Lord in the Great Ultimate Palace—this is my third name.”\n\nIt is said: “In the kalpas to come, the first shall abide in Jade Clarity, the second shall disperse the Numinous Treasure, and the third shall subdue demonic essences.”\n\n“*Ling* (Numinous) is my first title, the father of the ten thousand things, who brings them to completion. *Bao* (Treasure) is my second title, the mother of the ten thousand things, who gives birth to their offspring.”\n\nThus, as the Lingbao Dharma, I shall deliver the multitude of beings in the turbid world of future kalpas, illuminating and guiding them with this Dharma, inscribing its texts upon the Void Sovereign.\n\nI possess ten names: the first is \"To Come,\" the second \"Past,\" the third \"Present,\" the fourth \"Eternal Abode,\" the fifth \"World-Guide,\" the sixth \"Compassion,\" the seventh \"Purity,\" the eighth \"Vacuity,\" the ninth \"Being and Nonbeing,\" and the tenth \"Heaven and Earth.\" You all must reverently receive and remember these words.\n\nAt that moment, all the Perfected Ones, the Realized Ones from the four directions, the deva-princes, the kings, ghosts, and spirits—both human and nonhuman—rose together in homage, exclaiming in unison, \"Excellent! May we come to know this.\"\n\nThen, the Primordial Perfected One inquired further: \"The Dharma you have spoken of branches into thousands of myriads, difficult to comprehend and fathom. Though I may come to understand it, the beings of the turbid world will surely fail to grasp it fully. I pray you speak in finer, more accessible terms, that all beings may attain clarity.\"\n\n\"The Heavenly Worthy endures manifold afflictions. I wish to hear you distinguish their causes—why such maladies arise, why their pain and torment are so unbearable, why they lead to death and transformation, why death is not mere death, nor transformation mere transformation. Though these are not the Heavenly Worthy’s own sorrows, I am ever anxious and distressed, for such suffering indeed exists.\"\n\nThe Heavenly Worthy smiled, and from his mouth issued eight-colored light, dense as clouds. He snapped his fingers and addressed the assembly: \"Never before has such a question been asked. Now, this great disciple has skillfully inquired of me regarding the torments of death and illness. The matter of death is both difficult and easy to know. I shall now reveal the origins of these afflictions and expound upon them. All must quiet your minds.\n\nThe illnesses I bear arise from the kalpas—from the kalpa of existence to the kalpa of nonexistence—numberless as flowing sands, beyond reckoning. Yet this is not considered many, for I am ever afflicted, and all because I possess a body. To have a body is to have illness.\"\n\n**The Scripture of the Supreme Perfected One of the Cavernous Mystery and Numinous Treasure Inquiring into Illness**\n**Chapter One: Inquiring into Illness**\n\nThen the Heavenly Worthy spoke:\n\n\"For those who study the Dao in later ages, to don the robes of the Dharma outwardly while harboring malice within—this is my great illness.\n\nTo adorn oneself with splendor outwardly while lacking steadfast faith within—this is my great illness.\n\nTo fail in constant practice of the Dao and repentance—this is my great illness.\n\nTo neglect the salvation of beings—this is my great illness.\n\nTo lack compassion for all—this is my great illness.\n\nTo grow lax and retreat in mind and will—this is my great illness.\n\nTo transmit the supreme Dharma without regard for Heaven and Earth—this is my great illness.\n\nTo transmit scriptures without mastering their rituals and protocols—this is my great illness.\n\nTo undertake precepts with harm to the body—this is my great illness.\n\nTo fail the trials set by demons—this is my great illness.\n\nFor kings, ministers, and commoners to dwell in arrogance from high station—this is my great illness.\n\nFor the wealthy and noble to disregard the Dao—this is my great illness.\n\nStinginess and greed—this is my great illness.\n\nKilling and craving flavors—this is my great illness.\n\nDiscord in the household, disharmony among the six relations—this is my great illness.\n\nDisobedience to parents, lack of kindness to wife and children—this is my great illness.\n\nFailure to practice benevolence and righteousness—this is my great illness.\n\nTo destroy quiet abodes and fasting halls—this is my great illness.\n\nTo lack faith in the Three Treasures—this is my great illness.\n\nTo disrespect ghosts and spirits—this is my great illness.\n\nTo engage in theft and robbery—this is my great illness.\n\nTo plot against the sovereign—this is my great illness.\n\nTo disobey the sovereign and father—this is my great illness.\n\nFor the sovereign and father to lack the Dao—this is my great illness.\n\nTo slight the stars, sun, and moon—this is my great illness.\n\nFor past-life evil roots to remain unresolved, leading to misfortune in this life, only to blame others and resent the Dao—this is my great illness.\n\nTo betray the kindness of teachers—this is my great illness.\n\nTo deceive righteous friends—this is my great illness.\n\nTo slight teachers and neglect friends—this is my great illness.\n\nTo mock teachers and find fault with them—this is my great illness.\n\nTo lack love for disciples—this is my great illness.\n\nTo fail to awaken disciples—this is my great illness.\n\nTo conceal the true and display the false—this is my great illness.\n\nTo be attached to sounds and forms—this is my great illness.\n\nTo abandon the Dharma and embrace falsehood—this is my great illness.\n\nTo be attached to the lesser vehicle—this is my great illness.\n\nTo delight in external paths—this is my great illness.\n\nTo serve and feed evil spirits—this is my great illness.\n\nTo envy the capable and praise oneself—this is my great illness.\n\nTo refuse to yield virtue to others—this is my great illness.\n\nTo boast and insist on one’s own rightness—this is my great illness.\n\nTo claim knowledge of what one does not know, understanding of what one does not comprehend—this is my great illness.\n\nTo assert having seen what one has not seen, deceiving and misleading the poor—this is my great illness.\n\nTo borrow and not repay—this is my great illness.\n\nTo lend and demand excessive repayment, using large measures for taking and small for giving, light scales for lending and heavy for collecting—this is my great illness.\n\nTo curse and revile with harsh words—this is my great illness.\n\nTo speak false and deceitful words—this is my great illness.\n\nTo drink alcohol excessively—this is my great illness.\n\nTo consume food and clothing immoderately—this is my great illness.\n\nTo eat blood, fish, and raw meat—this is my great illness.\n\nTo crave the five pungent vegetables—this is my great illness.\n\nTo move, come, lie, and rest without arousing compassion—this is my great illness.\n\nTo harbor anger, resentment, and jealousy on the fasting days of the devas—this is my great illness.\n\nTo kill living beings on auspicious fasting days—this is my great illness.\n\nFor husband and wife to engage in yin and yang without following the precepts—this is my great illness.\n\nTo curse the wind and scold the rain—this is my great illness.\n\nTo mock and belittle the poor and sick—this is my great illness.\n\nTo speak of others’ gains and losses—this is my great illness.\n\nTo resent others’ successes and failures—this is my great illness.\n\nTo defile pure streams and roads—this is my great illness.\n\nTo kill living beings and bury the dead—this is my great illness.\n\nTo cherish wealth and treasures, refusing to receive the Dharma to resolve past-life karmic roots and establish good causes—this is my great illness.\n\nTo harm fetuses and abort children—this is my great illness.\n\nTo fell trees and fruit groves—this is my great illness.\n\nTo disbelieve in past lives—this is my great illness.\"\n\nTo claim that heaven and earth have no ghosts or spirits—this is my great illness.\n\nTo be ignorant of universal generosity—this is my great illness.\n\nTo give with reluctance and regret—this is my great illness.\n\nTo curse and chase away beggars—this is my great illness.\n\nTo hoard clothing and treasures—this is my great illness.\n\nTo judge and disparage others’ good and evil—this is my great illness.\n\nTo fail to relieve the destitute, distressed, and starving—this is my great illness.\n\nTo neglect all who suffer death and ruin—this is my great illness.\n\nI possess these seventy-two illnesses, bound for kalpas without escape, unable to free myself. Thus, I transform my form, disperse my qi, refine my spirit, and divide my body to become seventy-two sages. Among sages there are true ones; among the true there are ranks; among ranks there are chapters; among chapters there are verses; among verses there are words; among words there is qi; within qi there are images; within images there are subtleties; within subtleties there are refinements; within refinements there is nothingness; within nothingness there is being—this is called the subtle and wondrous.\n\nWithin the wondrous, the upper qi, though formless, forms the true body; the lower qi, though formed, becomes the fleshly body. Thus, water, fire, wind, and earth combine to form the four great elements of the body. My great illness arises from possessing these four great elements—without them, what affliction could there be? In truth, I have no four great elements; what great affliction could I have?\n\nTo know my body is to be my body; not to know my body is not to be my body. Knowing my body ensures its enduring existence; not knowing it leads to premature decay. Agonies fester in hell, ceaselessly cycling through the five destinies, revolving endlessly. Thus, I transform myself through this.\n\nWithout great merit, none can sever these bonds. The method to sever them is as heard and spoken.\n\nMy suffering in death arises from old age and illness. Birth inevitably leads to death; prosperity inevitably leads to decline. All beings share this law—none born escapes its end. Things sprout in spring, grow in summer, wither in autumn, and fade in winter. Success contains failure; heights harbor danger; safety holds sorrow; joy is fleeting, suffering enduring—who can comprehend this?\n\nDeath brings torment; the spirit struggles to transform. Sinking through endless nights, how bitter is the path! Though the heavens bring joy, they are ever haunted by impermanence. When the spirit scatters, the four great elements are hard to reunite, and the dwelling is difficult to return to.\n\nThis suffering is mine, yet not truly mine. My death is not death; my life is not life; my old age is not old age. Alas for those who cling to existence—what exists is not my true body; what does not exist is my true body. To call it death, to call it life—life and death are a pair, from which I am free. Those who remain bound are the sentient beings.\n\nThe great assembly, whether awakened or not, all at once wished to attain timely understanding, rose, bowed, and praised.\n\nThe Heavenly Worthy said: Those who cultivate the Great Vehicle to untie their bonds should, with every observance of the fast, wear the great talismans of the Three Caverns, bear the great registers of the Three Caverns and the契策, and in accordance with the Dharma, practice the Dao, recite scriptures, and persevere through the six periods without weariness.\n\nThe reason for establishing the six periods is that humans, born of the four great elements, possess the six emotions. If the six emotions are not dispelled, the roots of transgression remain. The first period dispels the eye; the second, the nose; the third, the mouth; the fourth, the ear; the fifth, the heart; the sixth, the hands. Practicing this day and night, the six emotions naturally dissolve, the six wisdoms become clear, and the Six Perfections are cultivated. Then, no obstructions remain; spiritual penetrations and demon-subduing powers are perfected, and one attains long life, enduring vision, free from all suffering, poison, worry, and vexation.\n\nLighting lamps illuminates the palace of the long night, liberating seven generations of parents and dispelling the darkness of all sentient beings’ parents in the world. Burning incense removes the foul impurities of the three realms, restoring fragrance and purity to hell. Like the fragrant herb *pingxiang*, also called *guiyao* or *yilan*, its scent pervades four hundred li, perfuming the beings of the three realms, transforming their qi. Illnesses are dispelled with aloeswood, sandalwood, frankincense, and other fragrant substances. The three realms and hells regain their fragrance and purity; souls and spirits are transformed, and beings are revived. The world rejoices, the six emotions vanish, and the five constants naturally subside.\n\nWhen the five constants subside, one can repay the five virtues: first, parents; second, master and disciple; third, host or patron; fourth, the king or sovereign father; fifth, the parents of the common people. Cherishing the bond between master and disciple, aiding travelers at passes and fords, serving the king, and comforting and loving the orphaned and destitute—these are the five virtues.\n\nThe text elucidates this clearly; understanding comes naturally. Words are as spoken, not empty or false—true and real. All beings may know and learn this; contemplate it deeply, contemplate it deeply.\n\n**Chapter Two: The Perfection of Hearing—Universal Spiritual Penetration**\n\nOne hears the chanting and singing of the highest perfected ones, the natural music of seven-jeweled palaces, the voices of the gods expounding the Dharma, the songs of dragons and phoenixes, the sound of divine winds scattering flowers, the disruptive chants of demon kings, the harmonious voices of jade maidens and immortal youths following the perfected ones, the spontaneous ringing of heavenly drums, the sounds of the assembled sages ascending to court, the melodies of the Five Emperors bestowing immortality, the voices of the Northern Emperor reviewing the registers of the dead, the Southern Dipper determining the records of life, the Central Dipper inscribing the registers of immortals, the distinctions of good and evil across the three realms, the judgments of Mount Tai’s net of sins, the music of the king’s palace, the clamor of armies training, the discussions of literary and strategic arts, the recitations of Daoist priests offering incense and making vows, the explanations of profound meanings, the teachings of young novices, the relief of illness and deliverance from distress, the voices of boys and girls, the words of spirits in mountains, forests, rivers, and seas—both good and evil—the recitations of recluses in secluded valleys deeply savoring the scriptures, the cries of hungry ghosts in hell begging for food in all directions, the wails of *wangliang* ghosts in hell enduring torture and torment, the laments of those conscripted by the Three Officials, longing for death but unable to die, the anguished cries of prisoners in earthly jails undergoing interrogation, the suffering calls of livestock slaughtered by humans, the sounds of birds, beasts, fish, and fowl devouring one another, the clamor of ghosts and spirits in conflict, the invocations of sacrifices to evil spirits, the sounds of drums, bells, and chimes, the noises of play, sorrowful weeping, and mourning, the complaints of the poor, the groans of the sick, the arrogance of the wealthy, the cries of victims of bandits and murder, the sounds of lust and sensual indulgence—such are the myriad sounds above and below heaven. All these one can hear and know without the ear becoming confused.\n\nRooted in the divine attainments gained through the cultivation of precepts—\n\n**Chapter Three: The Universal Vision of the Eye’s Precept-Attained Divine Power**\nOne sees the palaces of the heavens where the Perfected Ones expound the Dao, the unmoving serenity of the lofty sages in the ten directions, the division of light by sun and moon, the harmony of gong and shang notes, the mutual generation of yin and yang, the roars of dragons and phoenixes, the flying immortals scattering blossoms, the Heavenly Worthy guiding in empty space, the grand Dao assemblies teaching and transforming the heavens, the deliverance of immortals and Perfected Ones across the Three Realms, the recording of names by the Five Emperors, the revelry of kings and ministers, the debates of Daoists expounding scriptures, the repentance and ritual pacing, the partings of life and death, the sorrowful weeping and mourning, the torment of suffering souls in hell, the agony of prisoners in earthly jails, the hunger and thirst with no food or drink, the mutual harm and devouring of birds, beasts, fish, and fowl, the slaughter and sacrifice to spirits, the falling of lustful blossoms, the falsehood of deceitful words, the slander and envy of hidden malice, the complaints of laziness and backsliding—all such moments above and below heaven one can see without the eye’s root becoming confused, for this is the divine power attained through the cultivation of precepts.\n\n**Chapter Four: The Universal Olfaction of the Nose’s Precept-Attained Divine Power**\nThe natural fragrances of the heavens, the subtle and wondrous scent of *tuoluo*, the *shamoni* and *nilin* fragrances, the *botiman* blossom’s aroma, the wind-borne scent of the Secret River, the blue and white blossoms’ fragrance, the purple and red blossoms’ fragrance, the azure and yellow blossoms’ fragrance, the scent of yin clouds between the two earths, the golden-hued renowned incense, the fragrance of the forms of lofty Perfected Ones in the ten directions, the scent of the celestial maidens’ qi, the sandalwood and aloeswood incense, the cool and refreshing *qinggui* fragrance, the benzoin and sparrow-head incense, the *ainao*, *xuansuan*, and garlic scents, the *chongpi* and *kundang* aromas, the frankincense and benzoin, the *zhicao* and bright orchid fragrance, the fine medicinal waters’ scent, the blossoms and true forms of animals, the scent of human heads and bird feathers, the fragrance of boys and girls, the *maoxian* and *keyue* aromas, the soft and tender breath—all such fragrances above and below heaven one can smell and know without the nose’s root becoming confused, for this is the divine power attained through the cultivation of precepts.\n\n**Chapter Five: The Universal Discernment of the Mouth’s Precept-Attained Divine Power**\nThe sweet and numinous flavors of the heavens, the taste of swallowing sunlight and consuming blossoms, the savor of drawing in moonlight and dining on essence, the flavor of feeding on non-sucking light, the *luosheng* and darkly radiant taste, the green waters and yellow essence flavor, the fine herbs and sweet leeks’ savor, the jade seal and penetrating mystery taste, the wind-borne jade and stone flavor, the pine and cypress’ sweetness, the unborn and life-pervading aroma—all such flavors above and below heaven one can savor and know without the mouth’s root becoming confused, for this is the divine power attained through the cultivation of precepts.\n\n**Chapter Six: The Universal Strength of the Hand’s Precept-Attained Divine Power**\nThe hand does not take yet is self-sufficient, does not move yet is self-abundant, does not sway yet is self-plentiful, does not shift yet is self-level, does not exert yet is self-powered, does not grasp yet brings itself, does not clench yet lifts itself, does not hold yet fills itself, equal to the divine hand—all this is the divine power attained through the cultivation of precepts.\n\n**Chapter Seven: The Wondrous Pervasiveness of the Mind’s Precept-Attained Divine Power**\nThe mind can encompass the Three Realms, can move the Great Void, can command demonic spirits, can subdue all essences, can become palaces, can become yin and yang, can guide the sun and moon, can play in Dao assemblies, can wander among the lofty Perfected Ones, can become radiant blossoms, can enter the subtle and minute, can become great forms, can become water and fire, can become wind and earth, can aid heaven and earth, can rescue hell, can transcend all afflictions, can dissolve all forms, can merge with the myriad things—all such things it can do without the mind’s root becoming confused, for this is the divine power attained through the cultivation of precepts.\n\nThe Heavenly Worthy said: This is the body composed of the Four Great Elements, which, by aligning with the Dao and cultivating precepts, gains universal divine powers in this present life. Though one has not yet realized the true Dao, one attains spiritual feet. Proceeding from here in study, one gradually enters the subtle and wondrous. From one to three, the time of fruition draws near—this is the Way of enduring vision. Though far from the Three Evils, one is free from all sorrow, affliction, and poison. When the six roots are perfected, they merge with the One Spirit, and together they soar to the Upper Clarity.\n\n**Chapter Eight: The Rewards Sought by All Who Study Immortality**\nIf one desires transformation and flight, recite this scripture, and the fruit will be as wished.\nIf one desires to refine the body with elixirs and seek the Dao, recite this scripture, and the fruit will be as wished.\nIf one desires to consume essence and swallow qi, abiding in non-action, recite this scripture, and the fruit will be as wished.\nIf one desires to guide and conduct, exhaling and inhaling, to dispel distant sorrows, recite this scripture, and the fruit will be as wished.\nIf one desires to expound and study the Great Vehicle scriptures to ascend the Great Void, recite this scripture, and the fruit will be as wished.\nIf one desires to ride the chariot of luminous wheels and play in the Great Void, recite this scripture, and the fruit will be as wished.\nIf one desires to play with dragons and phoenixes, striking the rhythm, recite this scripture, and the fruit will be as wished.\nIf one desires to enter the Eternally Abiding and Right Perfection, recite this scripture, and the fruit will be as wished.\nIf one desires to create spontaneous music and pleasure, recite this scripture, and the fruit will be as wished.\nIf one desires to enter the past and future, recite this scripture, and the fruit will be as wished.\nIf one desires to shatter the great demon armies, recite this scripture, and the fruit will be as wished.\nIf one desires to make the impossible possible, recite this scripture, and the fruit will be as wished.\nIf one desires to make success and failure, recite this scripture, and the fruit will be as wished.\nIf one desires to become great or small, wondrous or subtle, recite this scripture, and the fruit will be as wished.\nIf one desires to become heaven or earth, mountain or sea, recite this scripture, and the fruit will be as wished.\nIf one desires to become cold or hot, harmonious or gentle, recite this scripture, and the fruit will be as wished.\nIf one desires to see the Eternally Abiding Perfected Ones of the ten directions and hear them expound the Dao, after fruition, one will see these Perfected Ones.\nIf one desires to see the Perfected Ones of the past and hear them expound the Dao, after fruition, one will see these Perfected Ones.\n\nIf one desires to see the present Perfected Ones and hear them expound the Dao, after fruition, one will see these Perfected Ones.\nIf one desires to see the natural palaces in the void and hear them expound the Dao, after fruition, one will see these palaces.\nIf one desires to see the celestial musicians and hear them expound the Dao, after fruition, one will see these musicians.\nIf one desires to see the thirty-two Heavenly Emperors governed by a single Mount Sumeru and hear them expound the Dao, after fruition, one will see these Heavenly Emperors.\nIf one desires to see the Brahma-qi Heavenly Kings and hear them expound the Dao, after fruition, one will see these kings.\nIf one desires to see the Wheel-Turning Sage Kings and hear them expound the Dao, after fruition, one will see these kings.\nIf one desires to see the Heavenly Great Generals and hear them expound the Dao, after fruition, one will see these generals.\nIf one desires to see the various Brahma Heavenly Kings and hear them expound the Dao, after fruition, one will see these kings.\nIf one desires to see the thousand millions of Mount Sumeru Kings of the ten directions and hear them expound the Dao, after fruition, one will see these kings.\nIf one desires to see the celestial youths of the worlds in the ten directions and hear them expound the Dao, after fruition, one will see these celestial youths.\nIf one desires to see the Heavenly Kings of the worlds in the ten directions and hear them expound the Dao, after fruition, one will see these kings.\nIf one desires to see the palaces of the Demon Kings and hear them expound the Dao, after fruition, one will see these palaces.\nIf one desires to see the spirits and gods of the Three Realms and hear them expound the Dao, after fruition, one will see these spirits and gods.\nIf one desires to see the Spirit Kings of Yang Valley and hear them expound the Dao, after fruition, one will see these kings.\nIf one desires to see the Five Emperors and hear them expound the Dao, after fruition, one will see these emperors.\nIf one desires to see the dragons, phoenixes, and various beasts and hear them expound the Dao, after fruition, one will see these dragons, phoenixes, and beasts.\nIf one desires to attain a body of wisdom and intelligence and hear them expound the Dao, after fruition, one will attain such a body.\nIf one desires to depart from poverty and distress and hear them expound the Dao, after fruition, one will become a body of fortune.\nIf one desires to transform from female to male and hear them expound the Dao, after fruition, one will become male.\nIf one desires to transform from male to female and hear them expound the Dao, after fruition, one will become female.\nIf one desires to become a recluse and hear them expound the Dao, after fruition, one will become a recluse.\nIf one desires to become a spiritual guide and hear them expound the Dao, after fruition, one will become a spiritual guide.\nIf one desires to subdue demonic spirits and hear them expound the Dao, after fruition, one will be able to subdue demonic spirits.\nIf one desires worldly peace and hears them expound the Dao, one will attain peace in the world.\nIf one’s home or tomb is unsettled and hears them expound the Dao, one will attain hidden tranquility.\nIf one’s evil karmic ties are unsevered, one’s household is troubled, and deaths are unceasing, and hears them expound the Dao, one will gain dissolution, restore fortune, and return to uprightness.\nIf one desires to sever the worldly taboos and malevolent spirits that bring harm and hears them expound the Dao, one will attain liberation and be free from calamitous burdens.\nIf one desires to attain prominence and official rank in noble households and hears them expound the Dao, the fruit will be as wished.\nIf one desires to manage livelihood and provide for clothing and food and hears them expound the Dao, the fruit will be as wished.\nIf one desires to avoid the blame and censure of enemies and hears them expound the Dao, one will attain resolution.\nIf one desires to be born constantly in a land of fortune and virtue, a realm of the Dao, and hears them expound the Dao, the fruit will be as wished.\nIf one desires the ancestral temple to flourish, descendants to be numerous, and the family to be harmonious and peaceful, and hears them expound the Dao, the fruit will be as wished.\nIf one desires to be born into a royal household and hears them expound the Dao, one will afterward be born into a royal household.\n\nSentient beings hear but do not understand, unaware of my true words. If one constantly offers incense, lamps, food, precious treasures, jeweled canopies, flowered banners, silk curtains, clothing, bedding, high seats, halls, and dwellings to the Dharma masters, with such resolve and conduct, the karmic reward will surely come. Sowing one, reaping ten thousand, like the harvest of rice in the fields, one must exert oneself diligently. Do not give rise to doubt, lest you lose your karmic conditions, fall into the long night, and cycle endlessly through the Five Paths—this awakening is difficult to measure.\n\n**The Ninth Chapter: The Grades of Karmic Rewards for Merit in Past Kalpas**\nThe Heavenly Worthy said: In past kalpas, those sentient beings who:\n- studied the supreme Dao,\n- made offerings to the Three Treasures,\n- recited and chanted the Cavern Scriptures,\n- practiced fasting and precepts,\n- ingested essence and swallowed qi,\n- practiced ingestion and guiding exercises,\n- presented jade tablets at the Eight Nodal Festivals to the Five Marchmounts and Three Rivers,\n- offered clothing to Dharma masters,\n- encouraged and assisted those lacking fragrant fats and other necessities,\n- vowed to rejoice in the Great Vehicle,\n- practiced charity and liberated living beings,\n- helped others build pure abodes and quiet chambers,\n- planted fruit groves to supply Dharma masters’ halls,\n- assisted others in reading and reciting scriptures,\n- aided others in preparing vegetarian feasts and providing labor,\n- observed, listened, practiced the Dao, repented transgressions, and awakened faith and understanding,\n- sincerely uttered the words “excellent,”\n- examined themselves and revered the Dharma,\n- in all actions—entering and exiting, lying down and rising—constantly practiced compassion,\n- liberated beings from death,\n- did not envy those who studied with resolve,\n- constantly praised the good and excellent,\n- did not contemplate killing,\n- bestowed alms upon the poor,\n- rescued those in distress and relieved the urgent,\n- lit lamps to illuminate the night,\n- wisely protected the Dharma—\n\nthose who performed such meritorious deeds became Perfected Ones in great numbers. Briefly recounting these matters, all are recorded on golden tablets and jade slips, for they planted these karmic conditions in past kalpas.\n\n**Chapter Ten: The Parable of Virtue’s Shelter**\n\nThe Heavenly Worthy said:\nI am the father and mother of all beings, cherishing and loving you, showing compassion to all, sheltering and nurturing all, moistening and nourishing all. All things that attain me are like fish finding the deep pool, like a child finding its mother, like the hungry finding food, like the thirsty finding drink, like the sick finding a physician, like the people finding their king, like the fearful finding refuge, like the drowning finding a boat, like the poor finding treasure, like the condemned receiving pardon, like the dying being revived, like the ruined being restored. My Dharma universally delivers beings, like a great cloud filling the sky, scattering fine rain in dense layers—none fail to receive its moisture.\n\nBeings do not know me, yet I give you life, raise you, nourish you, rear you, pity you. Why do you not repay my kindness with compassion and perform all good deeds? Instead, seeing my scriptures and Dharma, you do not repent or establish karmic conditions, hastening toward evil destinies, sinking into hell—how grievous, how lamentable! Each of you must diligently cultivate to uproot the seeds of sin and reap the fruits of eternal joy, as I have expounded in my teachings.\n\n**Chapter Eleven: The Retribution of Beings’ Past Karmic Conditions for Receiving Unwholesome Rewards**\n\nThose who in past lives executed others and exterminated clans now receive the retribution of having no descendants.\nThose who in past lives killed infants or harmed fetuses to induce miscarriage now receive the retribution of having children who often die young or become enemies in the family.\nThose who in past lives resented others’ misfortunes now receive the retribution of constantly suffering hardship.\nThose who in past lives resented others’ gains and losses now receive the retribution of being constantly slandered.\nThose who in past lives mocked the poor now receive the retribution of enduring this very distress.\nThose who in past lives stole, robbed, or, being wealthy and powerful, deceived and exploited the poor and lowly, or borrowed without repayment, now receive the retribution of being reborn as oxen, constantly bearing heavy burdens, thinking only of water and grass.\nThose who in past lives lent at interest, demanding tenfold repayment, now receive the retribution of constant suffering and want.\nThose who in past lives resented others afflicted with sores, scabies, leprosy, paralysis, or ulcers now receive the retribution of contracting these very diseases.\nThose who in past lives envied others’ intelligence now receive the retribution of stupidity and ignorance.\nThose who in past lives wore shoes while entering quiet halls and temples now receive the retribution of broken legs, being confined without ease, or having difficulty walking.\nThose who in past lives secretly entered others’ homes at night to commit adultery or theft now receive the retribution of being eyeless or hating the blind.\nThose who in past lives, dwelling in wealth, ate alone, refused to lend, ignored those in peril, lacked benevolence and righteousness, and scorned the poor and lowly, now receive the retribution of being born in barbarian lands among non-human beings.\nThose who in past lives refused to listen when they should have heard, or resented others’ deafness, now receive the retribution of this affliction.\nThose who in past lives engaged in incest with relatives near and distant now receive the retribution of being reborn as donkeys or horses.\nThose who in past lives killed and ate living creatures now receive the retribution of being reborn as livestock or wild beasts, harmed by humans to repay past enmities.\nThose who in past lives killed beings and buried their remains now receive the retribution of assuming the forms of those they killed.\nThose who in past lives killed others’ husbands now receive the retribution of having no husband.\nThose who in past lives killed others’ wives now receive the retribution of having no wife.\nThose who in past lives resented others’ success or failure now receive the retribution of constantly suffering misfortune.\nThose who in past lives hindered others from learning now receive the retribution of being ignorant of learning.\nThose who in past lives, as officials or clerks, harbored mutual hatred and jealousy, slandered and harmed without principle, causing unjust downfalls, now receive the retribution of being slandered and harmed by others, their karmic adversaries entangling them.\nThose who in past lives made offerings to ghosts and spirits now receive the retribution of constant insufficiency, drifting in degradation through the world.\nThose who in past lives cursed and reviled others now receive the retribution of being constantly cursed and hated, or being reborn as dogs.\nThose who in past lives drank wine without restraint, exceeding limits and committing evil, now receive the retribution of having their nature and reason inverted.\nThose who in past lives were unfilial to their parents now receive the retribution of bearing unfilial children.\nThose who in past lives were unkind to their brothers, wives, and children now receive the retribution of having disharmonious families, constantly quarreling, and being scorned by others.\nThose who in past lives wished others to be their slaves now receive the retribution of becoming slaves.\n\nSuch karmic conditions are manifold; here I have briefly recounted some to awaken your understanding. Beings, do not harbor such wishes or perform such deeds. The retribution of good and evil is certain and must be believed.\n\nIf there were no such karmic conditions, all would be born human, sharing the same four great elements—yet why do differences arise in wisdom and foolishness? Why do disparities exist in talent and incompetence? Why do distinctions appear in nobility and poverty? Why do variations occur in brightness and dullness? Why do some possess complete faculties while others do not? Why do some engage in discourse and debate while others do not? Why are some respected and loved while others are not? Why are some honored and revered while others are not? Such matters have been briefly recounted here.\n\n**Chapter Twelve: The Rewards of Beings’ Karmic Deeds for Receiving Wholesome Retribution**\n\nWealth in this world arises from past-life almsgiving;\nKingship in this world arises from past-life offerings to the Three Treasures;\nBecoming a Dharma Master, skilled in guidance and transformation, arises from past-life contemplation of the Great Vehicle;\nWisdom and intelligence in this world arise from past-life reverence for and faith in scriptural learning;\nBeing respected and feared by others arises from past-life vigilance in upholding the Three Treasures;\nAbundance in clothing and food arises from past-life relief of the destitute;\nHigh rank in officialdom and prominence in noble households arise from past-life restraint from harming living beings;\nThe perfection of the six senses arises from past-life protection of the Three Treasures;\nFlawless speech and discourse arise from past-life expounding of the Great Vehicle’s teachings;\nBeing a refuge for all people arises from past-life compassion and relief of all beings;\nBeing yielded to by good companions and deferred to by others arises from past-life wishing others to succeed in goodness.\n\nSuch are these retributions. Here, their principles are briefly stated. The karmic conditions are manifold; the roots of good and evil bear fruit like the radiance of the sun and moon, like the surging of the great ocean’s waves, like the turning of the four seasons, like the shifting of the Five Phases, like the wheel of a chariot. Do you, all beings, know this? Do you awaken to it? Do you comprehend it? Do you understand it? Do you practice it? Do you believe it? Do you take heed? Can you receive it? Now I have made clear these matters of good and evil.\n\nAll in the great assembly rejoiced, paid homage, and praised the teaching, wishing to fully comprehend it.\n\nThe Venerable One of Limitless Origin said: “The essential matters spoken by the Heavenly Worthy are most wondrous, sufficient to turn the minds of all beings. Among them are countless categories, yet beings cannot fully grasp them. Only the Dao can be understood with the Dao; only the Real can be understood with the Real; only the Void can be understood with the Void.\n\nAfter kalpas of receiving my title, I shall become the Limitless Heavenly Master, guiding the Great Vehicle of the Most High. Reflecting on these words now, many in this great assembly have yet to awaken to this truth.\n\nThe kalpa-body of the Heavenly Worthy is like the palaces of the Sun Valley, with its Terrace of Water Spirits, eighty myriad leagues in circumference and equal in height. Within it is golden sand, each grain like a mustard seed, filling it entirely. One grain dissolves every ten thousand years—such is the duration of the Heavenly Worthy’s minor kalpa-body. It is also like the dust into which all mountains, hills, mounds, earth, forests, and trees of the one hundred eighty Kunlun realms under the three myriad eight thousand worlds to the north are ground, then scattered into the great void. Their number is like the Heavenly Worthy’s body. When a great kalpa has passed, beings still do not awaken, do not believe. Among the four assemblies, those of the Lesser Vehicle, those of minor kalpa-bodies, the deva-princes, deva-kings, and deva-emperors also do not know or hear of it. Now that it is spoken, they too harbor doubts—how much more so the beings of this defiled world, who give rise to confusion! Thus, it is explained so that it may be made clear.\n\nBelief is difficult; knowledge is difficult; awakening is difficult; reception is difficult; encounter is difficult; seeing is difficult; devotion is difficult—such is the difficulty of my own body. As your guide, I deem it difficult, yet in truth, there is no difficulty.\n\nThe Venerable One of Limitless Origin said: “The *Five Thousand Characters* are the spirits within the five bodies of the Heavenly Worthy of the Numinous Radiance Treasure Repository. These spirits were also commanded by Laozi as the *Five Hundred*. Laozi compiled this meaning: the Numinous is the father of all beings; the Treasure is the mother of all beings; the Radiance is the light of the sun, illuminating and nourishing all; the Repository contains and generates the myriad things within it. I too have traversed this path.\n\nThe Heavenly Worthy surveys the good and evil, the learned and unlearned, among all beings—human and non-human, one-footed, two-footed, four-footed, many-footed, born of filth, moisture, eggs, wombs, or transformation—across the myriad worlds within a thousand koṭi Sumerus. All such evils arise before his eyes, mere inches from his body. Yet beings claim they do not know or see, do not recognize their true father and mother. Some say the true sages are distant; some say there are no divine spirits. Those who honor their parents receive descending numinous qi; those who dishonor their parents incur calamitous punishment. The parents of womb-born beings are but temporary vessels for karmic conditions—who can truly understand this?\n\nStudying the Great Vehicle is the condition, yet merely wishing for birth is not the ultimate aspiration of those who attain the Dao. If their merit and virtue are insufficient, they must again revolve through rebirth, yet their karmic roots of blessings remain unbroken. In later lives, they are constantly born into nobility, wealth, and honor, their virtue revered, their features complete, their actions guided by good spirits. They encounter enlightened teachers, auspicious burial sites, virtuous wives, and abundant provisions; malevolent spirits dare not approach.\n\nThose who take no joy in forming karmic bonds with the Three Treasures, who do not believe in the words of the sages, who utter harsh and abusive speech, and commit unwholesome deeds, are constantly born into lowly stations. They encounter unenlightened teachers, inauspicious burial sites, coarse wives, and lose their wealth upon departure. They become entangled with officials, their endeavors fail, good spirits do not protect them, and malevolent spirits lead them astray. All this arises from past-life karmic conditions, each governed by its respective stellar deity. The good belong to good stars; the evil belong to evil stars. Birth and death have their counterparts—this is exceedingly clear. Without the deliverance of the Great Vehicle, none can escape.\n\nDo you, all beings, know this? Yet you revere and trust heterodox teachings and various scriptures—how deeply pitiable is this delusion!\n\nThere are one hundred ninety-eight kinds of Dao, all of which are the Heavenly Worthy’s body. Why is this so? Among the beings of the ten directions’ worlds, their minds and actions differ. Some do not believe in spirits and ghosts, so the evil are transformed through evil expedient means, while the good are exhorted to awaken. Following their original minds, they are gradually led to know the Dao and truly awaken to the supreme path.”\n\nTo practice the Orthodox Unity (Zhengyi), there is no inside nor outside, no surface nor core, no essence nor grossness, neither two nor three, neither ten nor a hundred. Seek it through practice, and seek it from the heart—its principles of obscurity and clarity are exceedingly subtle and wondrous.\n\nAll beings, whether they see or do not see, must ever act as though they see; whether they fear or do not fear, must ever act as though they fear; whether they are cautious or not, must ever act as though they are cautious; whether they practice or not, must ever act as though they practice; whether they receive or not, must ever act as though they receive; whether they love or not, must ever act as though they love; whether they cultivate or not, must ever act as though they cultivate. Thus must the three hundred and sixty agreements be upheld. Whether it is real or not real, whether it is one or not one—this is what I have made clear.\n\nThis scripture issued from the golden mouth of the Heavenly Worthy. It must not be lightly slandered; to do so invites calamity and punishment, while reverence brings blessing and forgiveness. If there are those who aspire to be children of the Great Vehicle, they must devote themselves to its veneration, make offerings, recite and study it, and ponder its meaning deeply. Thus may they dissolve the sins of this present life, eradicate the evil of past causes, release the misfortunes of nine generations of ancestors, and deliver all from suffering.\n\nThose who seek the Dao in the future must first purify and rectify their spirit. Then will ghosts and spirits protect them, and demon kings pay them homage. They must present gold and treasures, pledge their hearts, and maintain a thousand-day fast before the scripture is bestowed upon them.\n\nThe Perpetually Primordial Realized One said: “I receive the formless and the qi of the myriad things’ breath. The beginning is the coalescence of the myriad things’ essence and qi—this is the principle of life and death, and it is my body.”\n\nIt has one name: Dragon’s Tooth Mountain; two names: Dragon’s Body; three names: Dragon’s Liver; four names: Phoenix Cry; five names: Lion’s Head; six names: Lesser Kalpa; seven names: Eternal Abode; eight names: Present Manifestation; nine names: Future Advent; ten names: Past Occurrence. This mountain spans eight thousand billion myriad *li* in circumference. Beneath its kalavinka trees, the area extends four hundred billion myriad *li*. Once every kalpa, the Supreme Sages and Lofty Perfected descend upon this mountain to expound the Great Vehicle scriptures and gather the great assembly.\n\nAt that time, the Heavenly Worthy discoursed in manifold ways, and each being understood according to their own capacity. Awakening to the varieties of his teachings, none erred—even the kings of moths and butterflies all attained the same understanding. The mountain arose thus: its altar was of yellow gold, its steps of white silver, its trees of the seven treasures, its blossoms of auspicious clouds. Dragons, phoenixes, and celestial beasts dwelt there, though among the assembly were those who had never before encountered such wonders.\n\nThe Heavenly Worthy, in his great compassion, revealed the mountain’s form, for it was tied to the causes of their former lives. All who study must diligently cultivate the Great Vehicle Dharma, for only afterward may they gather upon this mountain. The mountain also possesses palaces of the seven treasures and spontaneous celestial music. In that land, there is no spring, autumn, winter, or summer—yin and yang, the seasons, exist naturally and eternally.\n\nThe Great Vehicle scripture is but one, yet it branches into a thousand billion myriad forms—so vast that dragon-drawn chariots could not bear its weight, nor the Eastern Well measure its depth.\n\nThe first is the Five Thousand Characters. It is emptiness, it is void, it is non-being, it is being, it is heaven, it is earth, it is the myriad things. The Eternally Abiding Lofty Perfected of the ten directions ceaselessly contemplate it without surfeit.\n\nIts single character is the Heavenly Worthy’s esoteric name, ever revealed in the world, yet beings fail to awaken to it. Even in later ages, those who attain the Dao’s fruit, as well as the worthy, sagely, wise, and learned scholars who ponder this meaning—though they may treat it as the empty discourse of external teachings—still do good thereby.\n\nThis scripture is the body of the Great Sage. Internally, it draws in the numinous qi; externally, it unfolds wondrous meanings—none can fathom its depths. In past kalpas, all beings who pondered this truth believed in its words, and their intentions were thus dissolved. Whether their speech accorded with principle or not, whether they attained or failed to attain, whether they understood the path or not—I too can receive it all, without reproaching others. I follow the hearts of the people, for it is said: “Take the people’s heart as one’s own heart.”\n\nThe Perpetually Primordial Realized One said: “The Daoist methods for governing the body are as numerous as the sands of the Ganges—none can master them all. One need only grasp the One.”\n\nIngesting talismans, guiding and pulling, exhaling and inhaling, concealing and hiding—without completing the prior practices, one cannot succeed. Instead, one should diligently make offerings to this scripture, prostrate in worship, make vows, recite and study it, cultivate sincere faith without doubt, laziness, or weariness, and renew one’s resolve daily. Thus may one attain the power to soar and ride the dragon chariot, with nine generations of ancestors ascending together. Reflect well upon this: this scripture is the Five Thousand Characters.\n\nThe Primordial Commencement Realized One diligently studied and praised it, saying:\n\nWondrous is the supreme Dao,\nThe true Five Thousand Characters.\nEmpty and without origin, without trace,\nYet traces scatter like mist and clouds.\nScattered, they are beyond thought or measure—\nThe Three and the One unite in the Lord Emperor.\nThe Three Vehicles are not two,\nThe August Void expounds and proclaims.\nBeings are full of doubt,\nYet through preaching, awakening is transmitted.\nSever the roots of evil karma,\nDepart from the troubles of old age and sickness.\nAttain long life and enduring vision,\nFruits and deeds ride the rosy clouds.\nRoam freely in the Great Void,\nThe lofty and sagely join the assembly.\nFor kalpas as countless as the morning,\nThere is no sorrow, no affliction, no enmity.\nLook back upon later students—\nLazy and half-hearted in faith,\nLeveling resentments and envy,\nHow can they ascend the same chariot?\nSinking into the nine nights below,\nTheir souls endure trials and torments.\nRevolving through the Three Paths,\nThey will never again hear of good causes.\n\nThe Perfected of Primordial Beginning spoke:\nIn former kalpas, those who studied the Way of celestial immortality and the arts of deathlessness did not dwell in the world. To dwell in the world is to entertain many thoughts; many thoughts breed care; care burdens the heart; a burdened heart forgets the Dao. With wife and children, one worries for wife and children; with wealth and treasures, one worries for wealth and treasures; with illness, one worries for illness; with death and mourning, one worries for death and mourning; with poverty, one worries for poverty. All who follow such ways—how can they escape the pain of death? They diverge from the path of long life.\n\nOnly those who possess a single body know no care; knowing no care, the Dao and its methods endure forever. Later generations, deluded in their learning, only know to cherish their bodily lives, unaware of preserving and nurturing their spirit. The form is but a dwelling of the Four Great Elements—how can a dwelling last forever? When the person departs, the dwelling collapses, and the spirit scatters. Yet the spirit revolves without ceasing, neither sinking nor perishing.\n\nFools lavishly prepare grand tombs and fine timber, slaughtering living beings for burial rites, believing this to be filial piety and compassion. They do not realize they will face the long night of reckoning—how deluded, how deluded! They do not wish to become guests of the Most High, but hasten to be kings or common folk—this is true suffering.\n\nWhen sages have disciples, they are not truly their disciples, but rather those upon whom past blessings have bestowed their sacred lineage. Sages have no fixed lineage of learners; what matters is that they comprehend fully, as if understanding were itself comprehension.\n\nIn former kalpas, when their merit was not yet complete, those who studied the highest Dao and the ranks of immortality had not yet fulfilled their destined transformation. Their bodies passed through the Great Yin, and their disciples, along with Dharma masters, close friends, and kin, would perform the Three Sevens retreat, recite the Five Thousand Characters ten times, and liberate their souls and spirits.\n\nThose who study the highest Dao seek swift ascent through the revolving wheel; they need not possess long years of life. Unlike the foolish worldly folk who cling to long life without awakening, they, once unawakened, will weep. Weeping reveals the sickness of the body—how lamentable! Worldly people, by nature, face success and failure, long and short lives, and thus weep.\n\nThe Three Sevens retreat serves thus: the first seven days, the Water Official absolves sins; the second seven, the Earth Official resolves transgressions; the third seven, the Three Realms deliver beings, freeing them from the sufferings of hell, sparing them further reckoning, and hastening their transformation. Completing the full twenty-one days of the retreat is best; if not, observing the appointed days is also good. Diligence in the six periods of the day and night surpasses even the merit of saving lives.\n\nAll offerings made in faith, dedicated to the Three Treasures and the Dharma masters, should be thoughtfully considered—this is most wondrous. Yet all these are the delusions of later generations, who in life do not know to do good and establish fields of merit, but at death bury their clothing, treasures, and precious goods in coffins and tombs, only increasing the burdens and afflictions of the deceased. They do not understand that such acts are meant to deliver the dead and smooth their passage.\n\nFor the living, one set of garments for winter and summer suffices; there is no need for prolonged mourning that forgets the true needs of beings. Reflect deeply upon my words.\n\nThe Perfected of Primordial Beginning spoke:\nIn the ages to come, the minds of beings will grow coarse and wicked, failing to awaken to good causes. Unlike those of simple and honest nature today, future wise and worthy ones will teach the principles of ritual and doctrine. They will expound the truths of karmic conditions, the bonds of parents, siblings, uncles, aunts, sisters, and the six relations, and the rites of mourning—these are practices for all worldly people, not for those who study the highest Dao.\n\nWhen parents or those below pass away, one should cultivate a mind of merit, wishing to be reborn together with their true parents in the future, free from life and death, without the need for ancestral rites. Such mourning only harms the heart of the Way. This is called \"the disorderly verse\"—ponder it well.\n\nThe Perfected of Primordial Beginning spoke:\nLater learners must above all avoid unwarranted greed, obstructing others’ principles to enrich themselves, incurring resentment and invoking the wrath of spirits and gods. Though they may receive scriptures, wear talismans, practice breath control, observe fasts, cultivate the Dao, take elixirs, and regulate their diet, they merely exhaust their bodies outwardly. No immortality will be attained; instead, they hasten their trials. Coarse affairs cannot be extravagant—those who cling to such ways in their study are said to \"seek competition in the world,\" not true realization.\n\nIf one is slain by evil spirits in this life without awareness, at death the spirit will sink into hell, facing reckoning. How difficult to recognize my words! Let the learner’s mind enter the realm of insects and ants with harmony, the realm of the six livestock with harmony, the realm of birds and beasts with harmony, the realm of spirits and gods with harmony, the realm of good and evil people with harmony, the realm of forests and trees with harmony, and all things with harmony. Let all beings share in goodness, without the slightest thought of harm or blame. Only thus will one be protected by spirits and gods, commended by the Three Realms, and naturally attain perfection.\n\nThe Perfected of Primordial Beginning spoke:\nThe Heavenly Worthy and I observe the unseen, the past, and the present as clearly as if they were in our hearts.\n\nThen the Heavenly Worthy emitted from the center of his forehead the radiance of his purple-tinged brow, illuminating the ten directions, the thousand millions of Kunlun, and the three thousand six hundred great thousand worlds. All beings within beheld it with perfect clarity. The light was golden, and within it resounded a hundred thousand kinds of voices, delightful to hear. Following the light, beings unknowingly arrived beneath the Kalpa Flower Tree, where all good was attained, and they heard the roots of the Dharma’s karmic conditions expounded. This was the Heavenly Worthy’s demonstration of his great majestic power—a single encounter in a kalpa. Let later learners take heed and cultivate themselves well.\n\nThe Heavenly Worthy possesses great majestic power, striving to save all beings. Thus, within the Three Realms, though formless, there is a great voice; though formless, there is great strength—unattainable, like the sun, moon, and stars in the void, abiding mysteriously without attachment. From this arises spontaneity, and the turning of the human body is likewise.\n\nThus does qi communicate with numinous power. When a person preserves the Real, the Real preserves the person; when a person reveres the gods, the gods revere the person; when a person cherishes the spirits, the spirits cherish the person. When a person forgets qi, qi forgets the person; when a person neglects the Dao, the Dao neglects the person. Hence it is said: those with good karmic conditions proceed from brightness into brightness, from vision into vision, from understanding into understanding, from joy into joy. Those without good karmic conditions merely pass from error into error, from darkness into darkness, from suffering into suffering. Such are the correspondences—this is the root of all beings. In future kalpas, those who can believe and practice, who can uphold and cultivate, who can do good and be diligent, are the Dharma-teachers who, skillfully expounding my words, serve as guides, exhorting all to enter the Dharma-gate, perform purificatory fasts, recite scriptures, repent transgressions, and pray for deliverance, thereby loosening the bonds of birth and death. The rituals and precepts are manifold; one must rely on the detailed practices compiled by later sages.\n\nEstablishing merit and making vows proceeds from one to ten, from a hundred to a thousand, from a thousand to ten thousand. Gather silks and treasures to offer to the fast-officiant, dividing them into three portions: one portion for the Three Masters of the Numinous Treasure, one portion for the Perfected and Most High Saints, and one portion for those with good karmic conditions. The principle of karmic retribution is likewise as it is with being and non-being—within being and non-being lies the Real; proceed from this.\n\nThe Realized One speaks of three portions: one offered to the fast-officiant, one offered to the Dharma-teacher, and one offered annually or triennially to the master who transmits the precepts, the ancestral master. If the two masters are no longer present, the offering is entrusted to the registrar-master, transmitted according to the laws of the Three Heavens—thus is it done.\n\nThe title of Realized One has its standards, yet the supreme Dao remains distant. Those who attain spiritual penetration and freedom no longer regress; though they command ghosts and employ spirits, they still engage in activity. Diligently performing great deeds, they traverse kalpas and enter subtlety, gradually approaching the supreme Dao. All such cases are comparable. Those who studied the Dao in past kalpas and became Realized did not attain it suddenly. Rarely born with karmic conditions, they remain bound to the hidden and obscure, naturally unforgetting. Should they grow lax, they are tested and fall back, then sink once more into the Five Paths, with no time for return.\n\nUnderstand my words clearly. I have received the Heavenly Worthy’s command: in future kalpas, I shall be the parent of all beings, teaching the conditions for their growth and guiding those who shun evil. Heed my words well. In the kalpa when the Dao’s dispensation unfolds, only the Heavenly Master appears—this is singular. It is not that sages produce sages; scriptures and precepts have no distinction of great or small, no order of before or after, no hierarchy of high or low. They are all one. Yet there are ranks and categories, named according to their grade and volume. Each sage acts for the sake of beings.\n\nIt is neither two nor three, but identical to my own body. Let learners skillfully comprehend this. The ancient statutes of the Mystery Metropolis: thirty-one scrolls of the Jade Purity, thirty-six scrolls of the Purple Tenuity, three scrolls of the Great Ultimate. Their ranks and divisions each have their covenants, and these covenants serve as the body’s treasure, preserving one’s qi.\n\nDeath arises from within, not from without. Once it emerges from within, there is a response without, and this response brings great calamity. If within one remains unshaken and unradiant, abiding serenely in spirit, it is called \"silent spirit, spirit abiding of itself.\" Thus it is said: those who study the higher learning practice non-action, and through non-action, qi is governed. Those who study the lower learning engage in action, and through action, body and mind labor together. When both labor together, the bonds of past karma unravel, gradually leading to the governance of qi. It is not through silent spirit alone. When transgressions are extinguished, the spirit naturally becomes tranquil; when the spirit is tranquil, longevity is attained. If merit remains unfulfilled, silent spirit is not established. One must labor the body and afflict the flesh, aiding and delivering all beings without wearying of hardship.\n\nWhen a king faces calamity, recite this scripture. When the sovereign father is unwell, recite this scripture.\n\nWhen pestilence and poison spread, recite this scripture. When the people suffer death and illness, recite this scripture. When sun and moon lose their brightness, recite this scripture. When stars and constellations deviate from their courses, recite this scripture. When the kalpa nears its end, recite this scripture. When wind and rain come unseasonably, recite this scripture. When teachers and friends fall ill, recite this scripture. When household and family perish, recite this scripture. When the five grains do not ripen, recite this scripture. When thieves and bandits abound, recite this scripture. When beings curse one another, recite this scripture. When learning declines and resolve weakens, recite this scripture. When scolding, slander, and wrath arise, recite this scripture. On the fast days of the devas, recite this scripture.\n\nIn performing the fast and reciting the scripture, let the voice resound through the Great Void. When the sound rises, it descends as Brahma-tones. The Brahma-tones are subtle and wondrous, moving the response of all sages. The Demon Kings pay reverence, and all Perfected Ones praise its goodness. With such merit, one’s virtue becomes equal to that of the Heavenly Perfected, gradually entering the divine samādhi.\n\nWithin the body, the thirty-two marks naturally become complete: hair grows dark and long, the nape radiates purple light, eyebrows take the shape of the crescent moon, ears hear the profound, eyes shine with clarity, the nose is cool and dry, the mouth is square and round, teeth are moist and firm, white as silver and pure, numbering forty, even and fine, the tongue is bathed in spring waters, drawing in the essence of the moon, the Palace of Saliva flows with celestial fluid, the throat is lofty, the spine strong and firm, hands are soft yet grasp firmly, embracing both inner and outer, feet are powerful, treading the mysterious void, the heart is upright and at peace, subduing the Demon Kings, the liver shines with brightness, entering Mount Tai, the lungs are pure in qi, dwelling in Huayin, the kidneys radiate strength, gazing upon Mount Heng, the spleen receives qi, embracing the loftiness of Mount Song, the gallbladder roars with mighty voice, shaking the numinous resonance, recitation penetrates the subtle, entering the unobstructed. All these are attained through study, not by nature.\n\nThe *Scripture of the Supreme Perfected of the Cavernous Mystery and Numinous Treasure on Questioning Illness* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞玄灵宝太上真人问疾经 经名：洞玄灵宝太上真人问疾经。 撰人不详，约出於隋唐。 言世人疾苦缘由，劝人斋戒行道。 一卷。 底本出处：《正统道藏》太平部。 洞玄灵宝太上真人问疾经序 如是一时，灵耀宝藏天尊於北龙玄几仁贤世界，龙牙山中骞华树下，与十方大圣众，有若干千亿万众，俱会法座，论讲说议，研详大乘经，詺曰五千文。 终日竟夜，共美之味，常如不足，不厌不劳，不倦不懈。 四方得道，及次道果，未得道果，已得道果，如此之众，亦如尘沙。 及四天王，梵炁天王，诸天帝释，十方千亿昆仑王，一切昆仑所统，三十二天诸梵天王鬼神，诸天魔王，山海神王，旸谷神王，有若干千亿万人。 三界众生，人非人类，是含血之类，有若干千亿万众。 外道诸生，有九十八种，外道诸鬼神，复有若干千亿万众。 复有转轮圣王，复有日月天子，十方世界诸天子，有若干千亿万众。 各各身居骑乘，及其宫殿，妻妾俱到骞华树下，听天尊说法。 大乘经义，其义渊奥，难可寻详。 如此诸众生，莫能解者，虽不能解，然心意欢喜，忘诸尘污，各各散诸香华，供养天尊，愿解明了。 天尊言：我说大乘经，及言三达之事，非所能解。 众中有常住高真，及过去高真、见在高真，亦有若干千亿万人。 其有众中大明了大乘弟子，有八万六千人。 其名曰元始真人、天皇真人、太极真人、高皇真人、上皇真人、太一真人、太平真人、太素真人、太始真人、景皇真人、长夜真人、正一真人、定光真人、罗翘真人、妙音真人、留罗真人、太虚真人、玄妙真人、智称真人、大通真人、无量真人、玄寂真人、自在真人、统三界真人、大力真人、无量力真人、相好真人、明了真人、智慧真人、无常真人，导师真人、破恶真人、保长真人。 如此等真人，并皆明了大乘经法，是其先劫中修学上业，致居是真。 众中小劫身，其数如沙尘，当其先身时，不乐大乘法，是居小劫身，闻说大乘经，心意亦欣然，未有敢问者。 众中第五弟子无始真人而起作礼，上白天尊言：今说大乘法，不解者众，未能有 知，不堪受此，但使常供养，心愿果后，成无上真。 天尊言：我今说大乘法，汝等悉明了，后劫诸众生，未能解是趣。 遂举左手，指第五弟子、第六弟子，无始真人、定光真人，汝二人当於贤劫中而为导师，汝当受号为无始天师，定光受号为定光天师。 又指第七弟子正一真人，第八弟子玄妙真人，汝等当於浊劫中导我三乘法，正一真人当受号为三天法师，玄妙真人受号为六度法师。 汝等四弟子，累尝经当来过去见在，经粗入妙，及因大人国家法王之子胎孕之恩，皆导诸群生，济地狱诸苦，化诸天大运，勤为用心，令贤浊之中，使得知明了我法趣。 我今分身分号，其成百千亿万，是我病痛故耳。 夷是第一名，希是第二名，微是第三名，是三乘之首，一名三洞之始，其中分散，亦为千亿品经。 后第一劫为玉清宫，天宝君是我第一名； 后第二劫中为紫微宫，灵宝君是我第二名； 后三劫中为太极宫，神宝君是我第三名。 詺曰：当来之劫，第一住玉清，第二散灵宝，第三制魔精。 灵者是我第一号，是万物之父，能成万物。 宝者是我第二号，是万物之母，能生万物之子。",
      "translated_text": "**The Supreme Perfected One’s Scripture on Inquiring About Illness from the Cavernous Mystery Numinous Treasure**\n\n**Scripture Title:** *The Supreme Perfected One’s Scripture on Inquiring About Illness from the Cavernous Mystery Numinous Treasure*. Author unknown, approximately composed during the Sui or Tang dynasties. It expounds on the causes of worldly suffering and exhorts people to observe purification rites and practice the Dao. One fascicle. Base text from *The Orthodox Daoist Canon*, Peace Section.\n\n---\n\n**Preface to *The Supreme Perfected One’s Scripture on Inquiring About Illness from the Cavernous Mystery Numinous Treasure***\n\nAt that time, the Heavenly Worthy of Numinous Radiance and Treasure Repository was in the World of Benevolent Worthies beneath the Dragon’s Teeth Mountain, beneath the *Qianhua* Tree in the Northern Dragon’s Mysterious Realm. With the assembly of the ten directions’ great sagely hosts—numbering hundreds of thousands of myriads—all gathered upon their dharma seats, they deliberated, discoursed, and meticulously examined the Great Vehicle scriptures, which are called the *Five Thousand Characters*.\n\nDay and night, they savored their shared discourse as though never sated, never weary, never fatigued, never remiss. From the four directions came those who had attained the Dao, those nearing its fruition, those yet to attain it, and those who had already done so—such multitudes as numerous as the grains of sand. There were also the Four Heavenly Kings, the Heavenly Kings of Brahma-qi, the Heavenly Emperor Śakra of the ten directions, the thousand myriads of Kunlun Kings, all those governed by the Kunlun, the thirty-two Brahma Heavenly Kings and spirits of the heavens, the demon kings of the heavens, the spirit kings of mountains and seas, the spirit kings of the Yang Valley—numbering hundreds of thousands of myriads.\n\nThe beings of the Three Realms, both human and non-human, all those with blood in their veins, numbered hundreds of thousands of myriads. The ninety-eight kinds of externalist beings, along with their gods and spirits, also numbered hundreds of thousands of myriads. There were also the Wheel-Turning Sage Kings, the Heavenly Sons of the Sun and Moon, and the heavenly sons of the ten directions’ worlds—numbering hundreds of thousands of myriads. Each arrived with their mounts, palaces, wives, and concubines beneath the *Qianhua* Tree to hear the Heavenly Worthy expound the Dharma.\n\nThe meaning of the Great Vehicle scriptures is profound and abstruse, difficult to fathom in detail. None among these multitudes could comprehend it, yet though they could not understand, their hearts rejoiced, forgetting all worldly defilements. Each scattered fragrant flowers to make offerings to the Heavenly Worthy, praying for clarity and understanding.\n\nThe Heavenly Worthy said: “What I expound—the Great Vehicle scriptures and the matters of the Three Attainments—cannot be comprehended.”\n\nAmong the assembly were the eternally abiding High Perfected Ones, as well as the High Perfected Ones of the past and present—numbering hundreds of thousands of myriads. Among them were eighty-six thousand great disciples of the Great Vehicle who had attained perfect clarity. Their names were: Perfected One of Primordial Beginning, Perfected One of the Heavenly Sovereign, Perfected One of the Great Ultimate, Perfected One of the August Sovereign, Perfected One of the Supreme Sovereign, Perfected One of the Great One, Perfected One of Great Peace, Perfected One of Great Simplicity, Perfected One of Great Origin, Perfected One of the Radiant Sovereign, Perfected One of the Long Night, Perfected One of Orthodox Unity, Perfected One of Fixed Radiance, Perfected One of Lofty Grace, Perfected One of Wondrous Sound, Perfected One of Lingering Net, Perfected One of Great Emptiness, Perfected One of Mysterious Wonder, Perfected One of Wise Renown, Perfected One of Great Penetration, Perfected One of Boundless Measure, Perfected One of Mysterious Quiescence, Perfected One of Self-Mastery, Perfected One Who Governs the Three Realms, Perfected One of Great Strength, Perfected One of Boundless Power, Perfected One of Auspicious Marks, Perfected One of Luminous Understanding, Perfected One of Wisdom, Perfected One of Impermanence, Perfected One of the Guiding Master, Perfected One Who Shatters Evil, and Perfected One Who Preserves Longevity.\n\nAll these Perfected Ones had mastered the Dharma of the Great Vehicle, having cultivated the supreme practice in prior kalpas to attain their perfected state. Among the assembly were those of minor kalpas, as numerous as the grains of sand. In their former lives, they had no affinity for the Great Vehicle Dharma, and thus remained in minor kalpas. Yet upon hearing the Great Vehicle scriptures expounded, their hearts rejoiced, though none dared to ask questions.\n\nThen the fifth disciple, the Perfected One of Non-Beginning, rose and made obeisance, addressing the Heavenly Worthy: “Now that the Great Vehicle Dharma is being expounded, many do not understand. None can grasp it, and they are unworthy to receive it. They can only make constant offerings, praying that in future lives they may attain the supreme perfection of the Perfected.”\n\nThe Heavenly Worthy said: “I now expound the Great Vehicle Dharma, and you all comprehend it clearly. Yet in future kalpas, beings will be unable to grasp its purport.”\n\nThereupon, he raised his left hand and pointed to the fifth and sixth disciples—the Perfected One of Non-Beginning and the Perfected One of Fixed Radiance—saying: “You two shall serve as guiding masters in the Worthy Kalpa. You shall receive the title Heavenly Master of Non-Beginning, and Fixed Radiance shall receive the title Heavenly Master of Fixed Radiance.”\n\nHe then pointed to the seventh disciple, the Perfected One of Orthodox Unity, and the eighth disciple, the Perfected One of Mysterious Wonder, saying: “You two shall guide the Three Vehicles of my Dharma in the Defiled Kalpa. The Perfected One of Orthodox Unity shall receive the title Dharma Master of the Three Heavens, and the Perfected One of Mysterious Wonder shall receive the title Dharma Master of the Six Perfections.”\n\n“You four disciples, through kalpas past, present, and future, shall gradually progress from the coarse to the subtle, and by virtue of the blessings of the great beings, the kings of nations, and the sons born of the wombs of Dharma Kings, you shall guide all sentient beings, deliver them from the sufferings of hell, transform the great destinies of the heavens, and diligently apply yourselves so that in the midst of the worthy and the defiled, they may come to know and understand the purport of my Dharma.”\n\n“I now divide my body and disperse my titles, multiplying them into hundreds of thousands of myriads—this is because of the afflictions of illness. *Yi* is the first name, *Xi* the second, *Wei* the third. These are the foremost of the Three Vehicles, the beginning of the Three Caverns. Within them are divisions and dispersals, forming thousands of myriads of scriptures.”\n\n“In the first kalpa to come, I shall be the Heavenly Treasure Lord in the Jade Clarity Palace—this is my first name. In the second kalpa, I shall be the Numinous Treasure Lord in the Purple Tenuity Palace—this is my second name. In the third kalpa, I shall be the Spirit Treasure Lord in the Great Ultimate Palace—this is my third name.”\n\nIt is said: “In the kalpas to come, the first shall abide in Jade Clarity, the second shall disperse the Numinous Treasure, and the third shall subdue demonic essences.”\n\n“*Ling* (Numinous) is my first title, the father of the ten thousand things, who brings them to completion. *Bao* (Treasure) is my second title, the mother of the ten thousand things, who gives birth to their offspring.”",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1232,
      "start_sentence": 0,
      "end_sentence": 36,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.08123731613159,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\洞玄灵宝太上真人问疾经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "而为灵宝法，以度后劫中浊世诸众生，明导如是法，记文於虚皇。 我又有十名，一为当来，二为过去，三为见在，四为常住，五为导世，六为慈悲，七为清净，八为虚空，九为有无，十为天地，汝等当知敬受我言，忆识此数。 时诸真等，及四方一切真，及诸天子，诸王鬼神，人非人等，咸共起作礼，同称善哉，愿我当知。 尔时无始真人又问：如今所说，法分为千亿万，亦难可解，难可了，弟子自当知浊世中诸众生，卒未究了，愿以细者近者而言，使一切众生咸得明了。 天尊常有诸病苦，愿为分别说之，何故有斯病疢，痛恼如是，难堪如是，遂致死变，死非常死，变非常变，大圣所不兔，弟子常自忧虑，常自愁煎，虽非愁毒，要有是苦。 天尊含笑，八色之光从口出，状如密云，於是弹指告众：未有如是问，今有此大弟子，善能问我死病之恼，死事难知易知，今当告病之由，而为说之，一切静心，我生诸病，从有劫至无劫，亦如流沙无数入无数，不足以为多，常自忧恼，皆以我有身，有身则病。 洞玄灵宝太上真人问疾经 问疾品第一 於是天尊言：后世学仙士，外披法服，内怀阴恶，是我大病； 外饰华竞，内无专信，是我大病； 不常行道悔过，是我大病； 不念济众生，是我大病； 不慈一切，是我大病； 心意懈退，是我大病； 传授至法，不关天地，是我大病； 传经不究仪格，是我大病； 以害身任行受戒，是我大病； 为魔所试不过，是我大病； 国王臣民居高自骄，是我大病； 富贵不以道理，是我大病； 悭贪是我大病； 杀害贪味，是我大病； 室家不睦，六亲不和，是我大病； 不孝父母，不慈妻子，是我大病； 不行仁义，是我大病； 毁败静舍斋堂，是我大病； 不信三宝，是我大病； 不畏鬼神，是我大病； 为偷劫盗，是我大病； 谋图君主，是我大病； 不顺君父，是我大病； 君父无道，是我大病； 轻慢星辰日月，是我大病； 先世恶根未尽，中遭轗轲，还被冤家尤人咎道，是我大病； 背师恩爱，是我大病； 欺诈义友，是我大病； 轻师忽友，是我大病； 笑师非是，是我大病； 不爱弟子，是我大病； 不教悟弟子，是我大病； 藏真出伪，是我大病； 贪着声色，是我大病； 弃法入伪，是我大病； 贪着小乘，是我大病； 愿乐外道，是我大病； 事饲邪神，是我大病； 嫉能称己，是我大病； 不让德於他，是我大病； 唝嗃自是，是我大病； 未知云知，未解云解，是我大病； 未见云见，欺诱贫人，是我大病； 换贷不还，是我大病； 出债长取，大斗入小斗出，轻秤出重秤入，是我大病； 恶口骂詈，是我大病； 非实妄语，是我大病； 饮酒过量，是我大病； 衣食过量，是我大病； 啖血鱼腥，是我大病； 贪食五辛，是我大病； 出入行来卧息，不起慈悲，是我大病； 诸天斋日嗔恕恚妬，是我大病； 吉斋之日杀生，是我大病； 夫妻阴阳，不依科法，是我大病； 呵风骂雨，是我大病； 笑薄贫病，是我大病； 言人得失，是我大病； 憎人成败，是我大病； 秽污清流道路，是我大病； 杀生葬死骸，是我大病； 爱惜财宝，不肯受法，以解其先身罪根，立善因缘，是我大病； 伤胎去子，是我大病； 伐斫树木果林，是我大病； 不信宿命，是我大病；",
      "translated_text": "Thus, as the Lingbao Dharma, I shall deliver the multitude of beings in the turbid world of future kalpas, illuminating and guiding them with this Dharma, inscribing its texts upon the Void Sovereign.\n\nI possess ten names: the first is \"To Come,\" the second \"Past,\" the third \"Present,\" the fourth \"Eternal Abode,\" the fifth \"World-Guide,\" the sixth \"Compassion,\" the seventh \"Purity,\" the eighth \"Vacuity,\" the ninth \"Being and Nonbeing,\" and the tenth \"Heaven and Earth.\" You all must reverently receive and remember these words.\n\nAt that moment, all the Perfected Ones, the Realized Ones from the four directions, the deva-princes, the kings, ghosts, and spirits—both human and nonhuman—rose together in homage, exclaiming in unison, \"Excellent! May we come to know this.\"\n\nThen, the Primordial Perfected One inquired further: \"The Dharma you have spoken of branches into thousands of myriads, difficult to comprehend and fathom. Though I may come to understand it, the beings of the turbid world will surely fail to grasp it fully. I pray you speak in finer, more accessible terms, that all beings may attain clarity.\"\n\n\"The Heavenly Worthy endures manifold afflictions. I wish to hear you distinguish their causes—why such maladies arise, why their pain and torment are so unbearable, why they lead to death and transformation, why death is not mere death, nor transformation mere transformation. Though these are not the Heavenly Worthy’s own sorrows, I am ever anxious and distressed, for such suffering indeed exists.\"\n\nThe Heavenly Worthy smiled, and from his mouth issued eight-colored light, dense as clouds. He snapped his fingers and addressed the assembly: \"Never before has such a question been asked. Now, this great disciple has skillfully inquired of me regarding the torments of death and illness. The matter of death is both difficult and easy to know. I shall now reveal the origins of these afflictions and expound upon them. All must quiet your minds.\n\nThe illnesses I bear arise from the kalpas—from the kalpa of existence to the kalpa of nonexistence—numberless as flowing sands, beyond reckoning. Yet this is not considered many, for I am ever afflicted, and all because I possess a body. To have a body is to have illness.\"\n\n**The Scripture of the Supreme Perfected One of the Cavernous Mystery and Numinous Treasure Inquiring into Illness**\n**Chapter One: Inquiring into Illness**\n\nThen the Heavenly Worthy spoke:\n\n\"For those who study the Dao in later ages, to don the robes of the Dharma outwardly while harboring malice within—this is my great illness.\n\nTo adorn oneself with splendor outwardly while lacking steadfast faith within—this is my great illness.\n\nTo fail in constant practice of the Dao and repentance—this is my great illness.\n\nTo neglect the salvation of beings—this is my great illness.\n\nTo lack compassion for all—this is my great illness.\n\nTo grow lax and retreat in mind and will—this is my great illness.\n\nTo transmit the supreme Dharma without regard for Heaven and Earth—this is my great illness.\n\nTo transmit scriptures without mastering their rituals and protocols—this is my great illness.\n\nTo undertake precepts with harm to the body—this is my great illness.\n\nTo fail the trials set by demons—this is my great illness.\n\nFor kings, ministers, and commoners to dwell in arrogance from high station—this is my great illness.\n\nFor the wealthy and noble to disregard the Dao—this is my great illness.\n\nStinginess and greed—this is my great illness.\n\nKilling and craving flavors—this is my great illness.\n\nDiscord in the household, disharmony among the six relations—this is my great illness.\n\nDisobedience to parents, lack of kindness to wife and children—this is my great illness.\n\nFailure to practice benevolence and righteousness—this is my great illness.\n\nTo destroy quiet abodes and fasting halls—this is my great illness.\n\nTo lack faith in the Three Treasures—this is my great illness.\n\nTo disrespect ghosts and spirits—this is my great illness.\n\nTo engage in theft and robbery—this is my great illness.\n\nTo plot against the sovereign—this is my great illness.\n\nTo disobey the sovereign and father—this is my great illness.\n\nFor the sovereign and father to lack the Dao—this is my great illness.\n\nTo slight the stars, sun, and moon—this is my great illness.\n\nFor past-life evil roots to remain unresolved, leading to misfortune in this life, only to blame others and resent the Dao—this is my great illness.\n\nTo betray the kindness of teachers—this is my great illness.\n\nTo deceive righteous friends—this is my great illness.\n\nTo slight teachers and neglect friends—this is my great illness.\n\nTo mock teachers and find fault with them—this is my great illness.\n\nTo lack love for disciples—this is my great illness.\n\nTo fail to awaken disciples—this is my great illness.\n\nTo conceal the true and display the false—this is my great illness.\n\nTo be attached to sounds and forms—this is my great illness.\n\nTo abandon the Dharma and embrace falsehood—this is my great illness.\n\nTo be attached to the lesser vehicle—this is my great illness.\n\nTo delight in external paths—this is my great illness.\n\nTo serve and feed evil spirits—this is my great illness.\n\nTo envy the capable and praise oneself—this is my great illness.\n\nTo refuse to yield virtue to others—this is my great illness.\n\nTo boast and insist on one’s own rightness—this is my great illness.\n\nTo claim knowledge of what one does not know, understanding of what one does not comprehend—this is my great illness.\n\nTo assert having seen what one has not seen, deceiving and misleading the poor—this is my great illness.\n\nTo borrow and not repay—this is my great illness.\n\nTo lend and demand excessive repayment, using large measures for taking and small for giving, light scales for lending and heavy for collecting—this is my great illness.\n\nTo curse and revile with harsh words—this is my great illness.\n\nTo speak false and deceitful words—this is my great illness.\n\nTo drink alcohol excessively—this is my great illness.\n\nTo consume food and clothing immoderately—this is my great illness.\n\nTo eat blood, fish, and raw meat—this is my great illness.\n\nTo crave the five pungent vegetables—this is my great illness.\n\nTo move, come, lie, and rest without arousing compassion—this is my great illness.\n\nTo harbor anger, resentment, and jealousy on the fasting days of the devas—this is my great illness.\n\nTo kill living beings on auspicious fasting days—this is my great illness.\n\nFor husband and wife to engage in yin and yang without following the precepts—this is my great illness.\n\nTo curse the wind and scold the rain—this is my great illness.\n\nTo mock and belittle the poor and sick—this is my great illness.\n\nTo speak of others’ gains and losses—this is my great illness.\n\nTo resent others’ successes and failures—this is my great illness.\n\nTo defile pure streams and roads—this is my great illness.\n\nTo kill living beings and bury the dead—this is my great illness.\n\nTo cherish wealth and treasures, refusing to receive the Dharma to resolve past-life karmic roots and establish good causes—this is my great illness.\n\nTo harm fetuses and abort children—this is my great illness.\n\nTo fell trees and fruit groves—this is my great illness.\n\nTo disbelieve in past lives—this is my great illness.\"",
      "overlap_context": "n the third kalpa, I shall be the Spirit Treasure Lord in the Great Ultimate Palace—this is my third name.”\n\nIt is said: “In the kalpas to come, the first shall abide in Jade Clarity, the second shall disperse the Numinous Treasure, and the third shall subdue demonic essences.”\n\n“*Ling* (Numinous) is my first title, the father of the ten thousand things, who brings them to completion. *Bao* (Treasure) is my second title, the mother of the ten thousand things, who gives birth to their offspring.”",
      "start_char": 1232,
      "end_char": 2442,
      "start_sentence": 37,
      "end_sentence": 109,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.97511887550354,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\洞玄灵宝太上真人问疾经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "云天地无有鬼神，是我大病； 不知布施一切，是我大病； 布施追吝，是我大病； 骂逐乞儿，是我大病； 聚积衣服珍宝，是我大病； 论薄人为善恶，是我大病； 不救穷厄饥急，是我大病； 不过一切死败，是我大病。 我有此等七十二病，弥劫不脱，不能免之，是以故变形散气，化神分身，以成七十二圣。 圣中有真，真中有品，品中有章，章中有句，句中有辞，辞中有气，气中有象，象中有微，微中有细，细中有无，无中有有，是谓微妙。 妙中上气无气而成真身，下气有气而成肉身，故有水火风地，合成四大身。 我身大病者，为有四大，无此者有何患哉，我实无四大，有何大患。 以知我身，则是我身，弗知我身，则非我身，知我身则长存，不知我身则夭伤，痛毒於地狱，长更於五道，轮转於无穷，故我以此变也。 自非大业，莫能夺之，夺之之法，如说闻之。 我死苦者，以老病故也，生必有死，盛必有衰，人物一统，无生不终。 物生於春，长於夏，秋枯冬凋。 事成有败，高则有危，安则有悲，乐少苦多，孰能知乎。 死者烦毒，精神难化，沈弥积夜，苦哉由行，诸天虽乐，长忧无常，精神散者，四大难会，故宅难还。 我有此苦，实非我苦，我死非死，我生亦非生，我老亦非老。 苦哉有之，有之者非我身，无之者是我身，詺曰我死，詺曰我生，生死之对，我免之，不免者众生是也。 座中大众，有悟及未悟，一时愿得时解，而起作礼称善。 天尊言：修大乘以解缚者，每行斋戒，佩三洞大符，带三洞大箓，及契策，依法行道转经，六时不倦。 所以制作六时者，人受四大生於六情，六情不去，要有罪源，一时除眼，二时除鼻，三时除口，四时除耳，五时除心，六时除手，能昼夜行之，六情自消，六慧便通，六度行也，则无复有阂，神通众魔，自在具足，长生久视，无诸苦毒忧恼。 然灯者，光映长夜之府，以解七世父母，天下父母众生之暗，烧香者，以除三界中臭秽，使地狱还香洁。 犹之如苹香之草，一名鬼药，一名薏兰，方圆四百里中常扬气，以熏三界众生，使成诸气，病以沈水栴檀熏陆等香禳之，三界地狱还香洁，魂神得化，众生得苏，天下欢心，六情消灭，五常自息。 五常自息，能报五德，一者父母，二者师徒，三者主人，四者国王君父，五者百姓父母，恩爱师徒，关津主人，供养国王，抚恤镇爱百姓孤穷，是谓五德。 数中明之，明之自知，言如所说，非以虚妄，真实之语，众生可知可学，谛思谛思。 治耳戒神通普闻品第二 闻上真吟啸声，七宝宫殿自然妓乐声，诸天说法讲诵声，龙凤啸歌声，灵风散华声，魔王谣乱声，仙童玉女从真和音声，天鼓自然鸣声，众圣上朝声，五帝度仙品声，北帝校死籍声，南斗定生录声，中斗注仙简声，三界分别善恶声，太山判罪网声，国王宫殿妓乐声，耀兵教武声，文思诗章说议声，诸道士行香礼愿声，讲习通义声，教化童蒙声，救疾度厄声，童男童女声，山林河海鬼神言语善恶声，隐士幽谷中耽味至经声，地狱饿鬼东西乞食声，地狱魍魉鬼被考掠苦恼呼唤声，责役三官勤苦求死不得声，阳官囹圄考对苦痛声，六畜为人所杀苦唤声，禽兽鱼鸟更相啖食声，斗争牵引鬼神声，杀生祭祀邪神声，鼓音钟铃声，嬉戏悲哭哀悼声，贫人称怨声，疾痛呻昤声，富贵自骄声，劫盗杀害声，奸淫色味声，天上天下如此种种之音声，皆悉能闻知，犹不乱耳",
      "translated_text": "To claim that heaven and earth have no ghosts or spirits—this is my great illness.\n\nTo be ignorant of universal generosity—this is my great illness.\n\nTo give with reluctance and regret—this is my great illness.\n\nTo curse and chase away beggars—this is my great illness.\n\nTo hoard clothing and treasures—this is my great illness.\n\nTo judge and disparage others’ good and evil—this is my great illness.\n\nTo fail to relieve the destitute, distressed, and starving—this is my great illness.\n\nTo neglect all who suffer death and ruin—this is my great illness.\n\nI possess these seventy-two illnesses, bound for kalpas without escape, unable to free myself. Thus, I transform my form, disperse my qi, refine my spirit, and divide my body to become seventy-two sages. Among sages there are true ones; among the true there are ranks; among ranks there are chapters; among chapters there are verses; among verses there are words; among words there is qi; within qi there are images; within images there are subtleties; within subtleties there are refinements; within refinements there is nothingness; within nothingness there is being—this is called the subtle and wondrous.\n\nWithin the wondrous, the upper qi, though formless, forms the true body; the lower qi, though formed, becomes the fleshly body. Thus, water, fire, wind, and earth combine to form the four great elements of the body. My great illness arises from possessing these four great elements—without them, what affliction could there be? In truth, I have no four great elements; what great affliction could I have?\n\nTo know my body is to be my body; not to know my body is not to be my body. Knowing my body ensures its enduring existence; not knowing it leads to premature decay. Agonies fester in hell, ceaselessly cycling through the five destinies, revolving endlessly. Thus, I transform myself through this.\n\nWithout great merit, none can sever these bonds. The method to sever them is as heard and spoken.\n\nMy suffering in death arises from old age and illness. Birth inevitably leads to death; prosperity inevitably leads to decline. All beings share this law—none born escapes its end. Things sprout in spring, grow in summer, wither in autumn, and fade in winter. Success contains failure; heights harbor danger; safety holds sorrow; joy is fleeting, suffering enduring—who can comprehend this?\n\nDeath brings torment; the spirit struggles to transform. Sinking through endless nights, how bitter is the path! Though the heavens bring joy, they are ever haunted by impermanence. When the spirit scatters, the four great elements are hard to reunite, and the dwelling is difficult to return to.\n\nThis suffering is mine, yet not truly mine. My death is not death; my life is not life; my old age is not old age. Alas for those who cling to existence—what exists is not my true body; what does not exist is my true body. To call it death, to call it life—life and death are a pair, from which I am free. Those who remain bound are the sentient beings.\n\nThe great assembly, whether awakened or not, all at once wished to attain timely understanding, rose, bowed, and praised.\n\nThe Heavenly Worthy said: Those who cultivate the Great Vehicle to untie their bonds should, with every observance of the fast, wear the great talismans of the Three Caverns, bear the great registers of the Three Caverns and the契策, and in accordance with the Dharma, practice the Dao, recite scriptures, and persevere through the six periods without weariness.\n\nThe reason for establishing the six periods is that humans, born of the four great elements, possess the six emotions. If the six emotions are not dispelled, the roots of transgression remain. The first period dispels the eye; the second, the nose; the third, the mouth; the fourth, the ear; the fifth, the heart; the sixth, the hands. Practicing this day and night, the six emotions naturally dissolve, the six wisdoms become clear, and the Six Perfections are cultivated. Then, no obstructions remain; spiritual penetrations and demon-subduing powers are perfected, and one attains long life, enduring vision, free from all suffering, poison, worry, and vexation.\n\nLighting lamps illuminates the palace of the long night, liberating seven generations of parents and dispelling the darkness of all sentient beings’ parents in the world. Burning incense removes the foul impurities of the three realms, restoring fragrance and purity to hell. Like the fragrant herb *pingxiang*, also called *guiyao* or *yilan*, its scent pervades four hundred li, perfuming the beings of the three realms, transforming their qi. Illnesses are dispelled with aloeswood, sandalwood, frankincense, and other fragrant substances. The three realms and hells regain their fragrance and purity; souls and spirits are transformed, and beings are revived. The world rejoices, the six emotions vanish, and the five constants naturally subside.\n\nWhen the five constants subside, one can repay the five virtues: first, parents; second, master and disciple; third, host or patron; fourth, the king or sovereign father; fifth, the parents of the common people. Cherishing the bond between master and disciple, aiding travelers at passes and fords, serving the king, and comforting and loving the orphaned and destitute—these are the five virtues.\n\nThe text elucidates this clearly; understanding comes naturally. Words are as spoken, not empty or false—true and real. All beings may know and learn this; contemplate it deeply, contemplate it deeply.\n\n**Chapter Two: The Perfection of Hearing—Universal Spiritual Penetration**\n\nOne hears the chanting and singing of the highest perfected ones, the natural music of seven-jeweled palaces, the voices of the gods expounding the Dharma, the songs of dragons and phoenixes, the sound of divine winds scattering flowers, the disruptive chants of demon kings, the harmonious voices of jade maidens and immortal youths following the perfected ones, the spontaneous ringing of heavenly drums, the sounds of the assembled sages ascending to court, the melodies of the Five Emperors bestowing immortality, the voices of the Northern Emperor reviewing the registers of the dead, the Southern Dipper determining the records of life, the Central Dipper inscribing the registers of immortals, the distinctions of good and evil across the three realms, the judgments of Mount Tai’s net of sins, the music of the king’s palace, the clamor of armies training, the discussions of literary and strategic arts, the recitations of Daoist priests offering incense and making vows, the explanations of profound meanings, the teachings of young novices, the relief of illness and deliverance from distress, the voices of boys and girls, the words of spirits in mountains, forests, rivers, and seas—both good and evil—the recitations of recluses in secluded valleys deeply savoring the scriptures, the cries of hungry ghosts in hell begging for food in all directions, the wails of *wangliang* ghosts in hell enduring torture and torment, the laments of those conscripted by the Three Officials, longing for death but unable to die, the anguished cries of prisoners in earthly jails undergoing interrogation, the suffering calls of livestock slaughtered by humans, the sounds of birds, beasts, fish, and fowl devouring one another, the clamor of ghosts and spirits in conflict, the invocations of sacrifices to evil spirits, the sounds of drums, bells, and chimes, the noises of play, sorrowful weeping, and mourning, the complaints of the poor, the groans of the sick, the arrogance of the wealthy, the cries of victims of bandits and murder, the sounds of lust and sensual indulgence—such are the myriad sounds above and below heaven. All these one can hear and know without the ear becoming confused.",
      "overlap_context": "ccesses and failures—this is my great illness.\n\nTo defile pure streams and roads—this is my great illness.\n\nTo kill living beings and bury the dead—this is my great illness.\n\nTo cherish wealth and treasures, refusing to receive the Dharma to resolve past-life karmic roots and establish good causes—this is my great illness.\n\nTo harm fetuses and abort children—this is my great illness.\n\nTo fell trees and fruit groves—this is my great illness.\n\nTo disbelieve in past lives—this is my great illness.\"",
      "start_char": 2442,
      "end_char": 3732,
      "start_sentence": 110,
      "end_sentence": 138,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.64112043380737,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\洞玄灵宝太上真人问疾经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "根，皆治戒所得神通故也 。 治眼戒神通普见品第三 见诸天宫殿中上真说法时，十方高圣安然不动时，日月分景时，宫商相和时，阴阳相生时，龙凤啸鸣时，飞天散华时，天尊空中导引时，大会道场教化诸天时，三界度仙真品时，五帝记名时，国王臣人嬉戏时，道士讲论经法时，悔过行道时，生死别离时，悲哭哀悼时，地狱苦魂恼毒时，阳官囚徒痛剧时，饥渴不得饮食时，禽兽鱼鸟更相害食时，杀生祭祀鬼神时，淫色花落时，妄语非实时，阴恶谗嫉时，懈退称怨时，天上天下如此种种时，皆悉能见，犹不乱眼根，皆治戒所得神通故也 。 治鼻戒神通普闻香品第四 诸天自然香，陀罗微妙香，沙摩泥鳞香，波提漫华香，风生密河香，青华白华香，紫华赤华香，苍华黄华香，两地阴云香，金刚色名香，十方高真身形之美香，诸天彩女之气香，栴檀沈水香，高凉青桂香，安息雀头香，艾蒳蓒蒜香，虫蜱菎档香，熏陆安息香，芝草明兰香，美水药品香，畜华真形香，人头鸟羽香，童男童女香，毛鲜轲月香，口气柔嫩香，天上天下如此种种之香气，皆悉能闻知，犹不乱鼻根，皆治戒所得神通故也。 治口戒神通普知味品第五 诸天甘灵味，咽日服华味，引月餐精味，食无吸光味，罗生映玄味，绿水黄精味，英草美薤味，玉玺通玄味，风生玉石味，松柏甘口味，无生生熏味，天上天下如此种种味，皆悉能美知，犹不乱口根，皆治戒所得神通故也。 治手戒神通普通力品第六 手不取自足，不动自盈，不摇自丰，不移自平，不运自力，不执自来，不握自举，不把自满，与神手同，皆治戒所得神通故也。 治心戒神通普妙品第七 心能摄三界，能运太虚，能使魔灵，能伏众精，能为宫殿，能为阴阳，能导日月，能戏道场，能游上真，能为光华，能入细微，能为大象，能为水火，能为风地，能济天地，能救地狱，能过诸厄恼，能解诸形，能同万物，种种悉能为，犹不乱心根，皆治戒所得神通故也。 天尊言：此是受四大之体，能顺法治戒者，见世今身普得神通，虽未证道真，且令神足，从此进学，渐入微妙，从一至三，克果之期，便是久视之道，虽远三恶，无诸愁恼烦毒，六者既通，则与一神为合，则俱然飞腾上清也。 语来生学仙－切人求欲果报品第八 若欲变化飞行，修诵是经，果而如愿； 若欲服药自炼求道，修诵是经，果而如愿； 若欲餐精咽气，身在无为，修诵是经，果而如愿； 若欲导引吐纳，去远忧恼，修诵是经，果而如愿； 若欲讲读大乘经，以求升腾太空，修诵是经，果而如愿； 若欲乘景轮之车，游戏太虚，修诵是经，果而如愿； 若欲戏龙凤击节，修诵是经，果而如愿； 若欲入常住正真，修诵是经，果而如愿； 若欲作自然妓乐，修诵是经，果而如愿； 若欲入当来过去，修诵是经，果而如愿； 若欲破大魔军，修诵是经，果而如愿； 若欲能无能有，修诵是经，果而如愿； 若欲能成能败，修诵是经，果而如愿； 若欲能大能小，能妙能微，修诵是经，果而如愿； 若欲能天能地，能山能海，修诵是经，果而如愿； 若欲能寒能暑，能和能柔，修诵是经，果而如愿； 若欲见十方常住众真，而为说法，果后而见是真； 若欲见过去众真，而为说法，果后而见是真；",
      "translated_text": "Rooted in the divine attainments gained through the cultivation of precepts—\n\n**Chapter Three: The Universal Vision of the Eye’s Precept-Attained Divine Power**\nOne sees the palaces of the heavens where the Perfected Ones expound the Dao, the unmoving serenity of the lofty sages in the ten directions, the division of light by sun and moon, the harmony of gong and shang notes, the mutual generation of yin and yang, the roars of dragons and phoenixes, the flying immortals scattering blossoms, the Heavenly Worthy guiding in empty space, the grand Dao assemblies teaching and transforming the heavens, the deliverance of immortals and Perfected Ones across the Three Realms, the recording of names by the Five Emperors, the revelry of kings and ministers, the debates of Daoists expounding scriptures, the repentance and ritual pacing, the partings of life and death, the sorrowful weeping and mourning, the torment of suffering souls in hell, the agony of prisoners in earthly jails, the hunger and thirst with no food or drink, the mutual harm and devouring of birds, beasts, fish, and fowl, the slaughter and sacrifice to spirits, the falling of lustful blossoms, the falsehood of deceitful words, the slander and envy of hidden malice, the complaints of laziness and backsliding—all such moments above and below heaven one can see without the eye’s root becoming confused, for this is the divine power attained through the cultivation of precepts.\n\n**Chapter Four: The Universal Olfaction of the Nose’s Precept-Attained Divine Power**\nThe natural fragrances of the heavens, the subtle and wondrous scent of *tuoluo*, the *shamoni* and *nilin* fragrances, the *botiman* blossom’s aroma, the wind-borne scent of the Secret River, the blue and white blossoms’ fragrance, the purple and red blossoms’ fragrance, the azure and yellow blossoms’ fragrance, the scent of yin clouds between the two earths, the golden-hued renowned incense, the fragrance of the forms of lofty Perfected Ones in the ten directions, the scent of the celestial maidens’ qi, the sandalwood and aloeswood incense, the cool and refreshing *qinggui* fragrance, the benzoin and sparrow-head incense, the *ainao*, *xuansuan*, and garlic scents, the *chongpi* and *kundang* aromas, the frankincense and benzoin, the *zhicao* and bright orchid fragrance, the fine medicinal waters’ scent, the blossoms and true forms of animals, the scent of human heads and bird feathers, the fragrance of boys and girls, the *maoxian* and *keyue* aromas, the soft and tender breath—all such fragrances above and below heaven one can smell and know without the nose’s root becoming confused, for this is the divine power attained through the cultivation of precepts.\n\n**Chapter Five: The Universal Discernment of the Mouth’s Precept-Attained Divine Power**\nThe sweet and numinous flavors of the heavens, the taste of swallowing sunlight and consuming blossoms, the savor of drawing in moonlight and dining on essence, the flavor of feeding on non-sucking light, the *luosheng* and darkly radiant taste, the green waters and yellow essence flavor, the fine herbs and sweet leeks’ savor, the jade seal and penetrating mystery taste, the wind-borne jade and stone flavor, the pine and cypress’ sweetness, the unborn and life-pervading aroma—all such flavors above and below heaven one can savor and know without the mouth’s root becoming confused, for this is the divine power attained through the cultivation of precepts.\n\n**Chapter Six: The Universal Strength of the Hand’s Precept-Attained Divine Power**\nThe hand does not take yet is self-sufficient, does not move yet is self-abundant, does not sway yet is self-plentiful, does not shift yet is self-level, does not exert yet is self-powered, does not grasp yet brings itself, does not clench yet lifts itself, does not hold yet fills itself, equal to the divine hand—all this is the divine power attained through the cultivation of precepts.\n\n**Chapter Seven: The Wondrous Pervasiveness of the Mind’s Precept-Attained Divine Power**\nThe mind can encompass the Three Realms, can move the Great Void, can command demonic spirits, can subdue all essences, can become palaces, can become yin and yang, can guide the sun and moon, can play in Dao assemblies, can wander among the lofty Perfected Ones, can become radiant blossoms, can enter the subtle and minute, can become great forms, can become water and fire, can become wind and earth, can aid heaven and earth, can rescue hell, can transcend all afflictions, can dissolve all forms, can merge with the myriad things—all such things it can do without the mind’s root becoming confused, for this is the divine power attained through the cultivation of precepts.\n\nThe Heavenly Worthy said: This is the body composed of the Four Great Elements, which, by aligning with the Dao and cultivating precepts, gains universal divine powers in this present life. Though one has not yet realized the true Dao, one attains spiritual feet. Proceeding from here in study, one gradually enters the subtle and wondrous. From one to three, the time of fruition draws near—this is the Way of enduring vision. Though far from the Three Evils, one is free from all sorrow, affliction, and poison. When the six roots are perfected, they merge with the One Spirit, and together they soar to the Upper Clarity.\n\n**Chapter Eight: The Rewards Sought by All Who Study Immortality**\nIf one desires transformation and flight, recite this scripture, and the fruit will be as wished.\nIf one desires to refine the body with elixirs and seek the Dao, recite this scripture, and the fruit will be as wished.\nIf one desires to consume essence and swallow qi, abiding in non-action, recite this scripture, and the fruit will be as wished.\nIf one desires to guide and conduct, exhaling and inhaling, to dispel distant sorrows, recite this scripture, and the fruit will be as wished.\nIf one desires to expound and study the Great Vehicle scriptures to ascend the Great Void, recite this scripture, and the fruit will be as wished.\nIf one desires to ride the chariot of luminous wheels and play in the Great Void, recite this scripture, and the fruit will be as wished.\nIf one desires to play with dragons and phoenixes, striking the rhythm, recite this scripture, and the fruit will be as wished.\nIf one desires to enter the Eternally Abiding and Right Perfection, recite this scripture, and the fruit will be as wished.\nIf one desires to create spontaneous music and pleasure, recite this scripture, and the fruit will be as wished.\nIf one desires to enter the past and future, recite this scripture, and the fruit will be as wished.\nIf one desires to shatter the great demon armies, recite this scripture, and the fruit will be as wished.\nIf one desires to make the impossible possible, recite this scripture, and the fruit will be as wished.\nIf one desires to make success and failure, recite this scripture, and the fruit will be as wished.\nIf one desires to become great or small, wondrous or subtle, recite this scripture, and the fruit will be as wished.\nIf one desires to become heaven or earth, mountain or sea, recite this scripture, and the fruit will be as wished.\nIf one desires to become cold or hot, harmonious or gentle, recite this scripture, and the fruit will be as wished.\nIf one desires to see the Eternally Abiding Perfected Ones of the ten directions and hear them expound the Dao, after fruition, one will see these Perfected Ones.\nIf one desires to see the Perfected Ones of the past and hear them expound the Dao, after fruition, one will see these Perfected Ones.",
      "overlap_context": " fowl devouring one another, the clamor of ghosts and spirits in conflict, the invocations of sacrifices to evil spirits, the sounds of drums, bells, and chimes, the noises of play, sorrowful weeping, and mourning, the complaints of the poor, the groans of the sick, the arrogance of the wealthy, the cries of victims of bandits and murder, the sounds of lust and sensual indulgence—such are the myriad sounds above and below heaven. All these one can hear and know without the ear becoming confused.",
      "start_char": 3732,
      "end_char": 4987,
      "start_sentence": 139,
      "end_sentence": 171,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.947728872299194,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\洞玄灵宝太上真人问疾经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "若欲见见在诸真，而为说法，果后而见是真； 若欲见空中自然宫殿，而为说法，果后而见此官殿； 若欲见诸天妓乐，而为说法，果后而见此妓乐； 若欲见一须弥所统三十二天帝，而为说法，果后而见此天帝； 若欲 见梵炁天王，而为说法，果后而见此王身：若欲见转轮圣王，而为说法，果后而见此王身； 若欲见天大将军身，而为说法，果后而见此将军身； 若欲见诸梵天王，而为说法，果后而见此王身； 若欲见十方千亿须弥王身，而为说法，果后而见此王身； 若欲见十方世界诸天子，而为说法，果后而见此天子身； 若欲见十方世界诸天王身，而为说法，果后而见此王身； 若欲见魔王宫殿，而为说法，果后而见此宫殿； 若欲见三界鬼神身，而为说法，果后而见此鬼神身； 若欲见旸谷神王身，而为说法，果后而见此王身； 若欲见五帝身，而为说法，果后而见此帝身； 若欲见龙凤诸兽身，而为说法，果后而见此龙凤诸兽身； 若欲得聪明智慧身，而为说法，果后而得是身，若欲去离穷厄，而为说法，果后而为福身； 若欲转女为男，而为说法，果后而为男身； 若欲求转男为女，而为说法，果后得为女身； 若欲为隐士，而为说法，果后而为隐士； 若欲为导师，而为说法，果后而为导师； 若欲制役魔精，而为说法，果后而能制魔精； 若欲世间求安，而为说法，而见世得安； 若人宅墓不宁而为说法，而得潜宁； 若恶缘未断，居家轗轲，死丧不止，而为说法，而获消散，还得利贞； 若欲断世间禁忌鬼神为祟，而为说法，而得解释不为祸累； 若欲朱门荣宦求得通达，而为说法，果如所愿； 若欲治生供衣食之用，而为说法，而如所愿； 若欲免冤家之责咎，而为说法，而得解断； 若欲常生福德之国，有道之境，而为说法，而如所愿； 若欲宗庙胤长，多嗣辑睦，而为说法，而如所愿； 若欲生国王家，而为说法，而后生国王家。 众生闻不解，不知我真实之语，常能香灯饭食珍宝宝盖华旛缯帐衣服床席高座堂屋供养法师，志行如是，果报克至，种一获万，如田稻之实，善自力励，勿生疑惑，失汝因缘，堕落长夜，转转五道，此悟量难也。 前劫时众生为功德受报品第九 天尊言：前劫中诸众生，学无上道，供养三宝者，早已成真道； 诵咏洞经者，早已成真道； 修行斋戒者，早已成真道； 吞精咽气者，早已成真道； 服御导引者，早已成真道； 八节奏简於五岳三河者，早已成真道； 供养法师衣服者，早已成真道，劝助香腴众乏者，早已成真道； 发愿随喜大乘者，早已成真道； 布施放生者，早已成真道； 助人营精舍静室者，早已成真道； 种植果林供养法师堂宇者，早已成真道； 助人读诵经者，早已成真道； 助人营斋运力者，早已成真道； 观听行道悔过发信解者，早已成真道； 信心唱句善哉者，早已成真道； 检身畏敬法者，早已成真道； 出入卧息坐起常行慈悲者，早已成真道； 放生度死者，早已成真道； 不嫉妬志学者，早已成真道； 常叹善佳者，早已成真道； 不念杀生者，早已成真道； 赐乞贫穷者，早已成真道； 救厄恤急者，早已成真道； 然灯照夜者，早已成真道； 善明护法者，早已成真道。 有如此之功，真人得道甚多，略言其事，皆记名金格玉简，皆前劫时发是因缘故也。",
      "translated_text": "If one desires to see the present Perfected Ones and hear them expound the Dao, after fruition, one will see these Perfected Ones.\nIf one desires to see the natural palaces in the void and hear them expound the Dao, after fruition, one will see these palaces.\nIf one desires to see the celestial musicians and hear them expound the Dao, after fruition, one will see these musicians.\nIf one desires to see the thirty-two Heavenly Emperors governed by a single Mount Sumeru and hear them expound the Dao, after fruition, one will see these Heavenly Emperors.\nIf one desires to see the Brahma-qi Heavenly Kings and hear them expound the Dao, after fruition, one will see these kings.\nIf one desires to see the Wheel-Turning Sage Kings and hear them expound the Dao, after fruition, one will see these kings.\nIf one desires to see the Heavenly Great Generals and hear them expound the Dao, after fruition, one will see these generals.\nIf one desires to see the various Brahma Heavenly Kings and hear them expound the Dao, after fruition, one will see these kings.\nIf one desires to see the thousand millions of Mount Sumeru Kings of the ten directions and hear them expound the Dao, after fruition, one will see these kings.\nIf one desires to see the celestial youths of the worlds in the ten directions and hear them expound the Dao, after fruition, one will see these celestial youths.\nIf one desires to see the Heavenly Kings of the worlds in the ten directions and hear them expound the Dao, after fruition, one will see these kings.\nIf one desires to see the palaces of the Demon Kings and hear them expound the Dao, after fruition, one will see these palaces.\nIf one desires to see the spirits and gods of the Three Realms and hear them expound the Dao, after fruition, one will see these spirits and gods.\nIf one desires to see the Spirit Kings of Yang Valley and hear them expound the Dao, after fruition, one will see these kings.\nIf one desires to see the Five Emperors and hear them expound the Dao, after fruition, one will see these emperors.\nIf one desires to see the dragons, phoenixes, and various beasts and hear them expound the Dao, after fruition, one will see these dragons, phoenixes, and beasts.\nIf one desires to attain a body of wisdom and intelligence and hear them expound the Dao, after fruition, one will attain such a body.\nIf one desires to depart from poverty and distress and hear them expound the Dao, after fruition, one will become a body of fortune.\nIf one desires to transform from female to male and hear them expound the Dao, after fruition, one will become male.\nIf one desires to transform from male to female and hear them expound the Dao, after fruition, one will become female.\nIf one desires to become a recluse and hear them expound the Dao, after fruition, one will become a recluse.\nIf one desires to become a spiritual guide and hear them expound the Dao, after fruition, one will become a spiritual guide.\nIf one desires to subdue demonic spirits and hear them expound the Dao, after fruition, one will be able to subdue demonic spirits.\nIf one desires worldly peace and hears them expound the Dao, one will attain peace in the world.\nIf one’s home or tomb is unsettled and hears them expound the Dao, one will attain hidden tranquility.\nIf one’s evil karmic ties are unsevered, one’s household is troubled, and deaths are unceasing, and hears them expound the Dao, one will gain dissolution, restore fortune, and return to uprightness.\nIf one desires to sever the worldly taboos and malevolent spirits that bring harm and hears them expound the Dao, one will attain liberation and be free from calamitous burdens.\nIf one desires to attain prominence and official rank in noble households and hears them expound the Dao, the fruit will be as wished.\nIf one desires to manage livelihood and provide for clothing and food and hears them expound the Dao, the fruit will be as wished.\nIf one desires to avoid the blame and censure of enemies and hears them expound the Dao, one will attain resolution.\nIf one desires to be born constantly in a land of fortune and virtue, a realm of the Dao, and hears them expound the Dao, the fruit will be as wished.\nIf one desires the ancestral temple to flourish, descendants to be numerous, and the family to be harmonious and peaceful, and hears them expound the Dao, the fruit will be as wished.\nIf one desires to be born into a royal household and hears them expound the Dao, one will afterward be born into a royal household.\n\nSentient beings hear but do not understand, unaware of my true words. If one constantly offers incense, lamps, food, precious treasures, jeweled canopies, flowered banners, silk curtains, clothing, bedding, high seats, halls, and dwellings to the Dharma masters, with such resolve and conduct, the karmic reward will surely come. Sowing one, reaping ten thousand, like the harvest of rice in the fields, one must exert oneself diligently. Do not give rise to doubt, lest you lose your karmic conditions, fall into the long night, and cycle endlessly through the Five Paths—this awakening is difficult to measure.\n\n**The Ninth Chapter: The Grades of Karmic Rewards for Merit in Past Kalpas**\nThe Heavenly Worthy said: In past kalpas, those sentient beings who:\n- studied the supreme Dao,\n- made offerings to the Three Treasures,\n- recited and chanted the Cavern Scriptures,\n- practiced fasting and precepts,\n- ingested essence and swallowed qi,\n- practiced ingestion and guiding exercises,\n- presented jade tablets at the Eight Nodal Festivals to the Five Marchmounts and Three Rivers,\n- offered clothing to Dharma masters,\n- encouraged and assisted those lacking fragrant fats and other necessities,\n- vowed to rejoice in the Great Vehicle,\n- practiced charity and liberated living beings,\n- helped others build pure abodes and quiet chambers,\n- planted fruit groves to supply Dharma masters’ halls,\n- assisted others in reading and reciting scriptures,\n- aided others in preparing vegetarian feasts and providing labor,\n- observed, listened, practiced the Dao, repented transgressions, and awakened faith and understanding,\n- sincerely uttered the words “excellent,”\n- examined themselves and revered the Dharma,\n- in all actions—entering and exiting, lying down and rising—constantly practiced compassion,\n- liberated beings from death,\n- did not envy those who studied with resolve,\n- constantly praised the good and excellent,\n- did not contemplate killing,\n- bestowed alms upon the poor,\n- rescued those in distress and relieved the urgent,\n- lit lamps to illuminate the night,\n- wisely protected the Dharma—\n\nthose who performed such meritorious deeds became Perfected Ones in great numbers. Briefly recounting these matters, all are recorded on golden tablets and jade slips, for they planted these karmic conditions in past kalpas.",
      "overlap_context": "ven or earth, mountain or sea, recite this scripture, and the fruit will be as wished.\nIf one desires to become cold or hot, harmonious or gentle, recite this scripture, and the fruit will be as wished.\nIf one desires to see the Eternally Abiding Perfected Ones of the ten directions and hear them expound the Dao, after fruition, one will see these Perfected Ones.\nIf one desires to see the Perfected Ones of the past and hear them expound the Dao, after fruition, one will see these Perfected Ones.",
      "start_char": 4987,
      "end_char": 6219,
      "start_sentence": 172,
      "end_sentence": 231,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.818323850631714,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\洞玄灵宝太上真人问疾经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "德覆譬喻品第十 天尊言：我是众生之父母，怜汝爱汝，慈愍一切，覆育一切，润泽一切，一切物得我，如鱼之得渊，如儿得母，如饥得饭，如渴得饮，如病得医，如民得王，如恐得旅，如溺得船，如贫得宝，如刑得赦，如绝得苏，如败得成，我法普度众生，如大云弥天，布叆叇细雨，无不蒙泽。 众生知我不，我成汝生汝养汝育汝长汝愍汝，汝等何不知慈悲以报我恩，行诸善行。 而见我经法不知悔立缘，趣堕恶道，沈落地狱，可痛可哀。 明各修励，以得免罪根，果报长乐，如我所说义。 众生本行因缘受不善报品第十一 先身诛人灭族，今报其无后； 先身杀人小儿及伤胎去子，今报其有子多夭伤，成冤家之子； 先身憎人丧祸，今报其常婴轗轲； 先身憎人得失，今报其常被诽谤； 先身笑人贫，今报其此厄； 先身偷劫，及富贵无道，诱取贫贱，及换贷不还，今报其为牛之身，常负重担，但念水草； 先身出债一求偿十，今报其常苦乏； 先身憎人病疽疥癞瘫瘘，今报其此疾； 先身嫉人聪明，今报其愚暗； 先身着履上静堂宇，今报其脚折及无间关，行出不便； 先身夜入人家奸盗，今报其无眼，亦憎人盲也； 先身居富室独食，假借不通，不恤危急，仁义不达，轻慢贫贱，今报其生边夷之国，非人之类； 先身不闻云闻，及憎人聋疾，今报此疢； 先身淫色中外骨肉，今报其驴马身； 先身杀害含血之类，贪食其肉，今报其生六畜及野兽之身，为人所害，以酬先冤； 先身杀生葬死骸，今报其所杀之形； 先身杀人壻，今报其无壻； 先身杀人妇，今报其无妇； 先身憎人成败，今报其常婴凶祸； 先身人至学，今报其不知学； 先身为臣吏人，更相憎嫉，谗害无道，致令横败，冤对相牵，今报其为人所谗害； 先身饮饲鬼神，今报其常不足流弊世间； 先身恶二骂詈，今报其常为人所骂憎恶，为狗犬身； 先身饮酒无节，过量犯恶，今报其性理倒错； 先身不孝父母，今报其生不孝之子； 先身不慈爱兄弟妻妇，今报其为家不厚，常自斗争，为人所笑薄； 先身愿人为己奴婢，今报为奴婢。 有如此缘甚多，今略言其一，粗令悟知也。 众生勿发如是愿，如是行，善恶之报，立在信然。 若无是缘，俱是生人中受四大同一，而有愚智相去何； 若才不才相去何； 若高贵贫贱相去何； 若明不明相去何； 若六情完具及不完具相去何； 若谈讲论及议及不议相去何； 若为人所敬爱及不敬爱相去何； 若尊礼及不尊礼相去何。 若斯等略言其事也。 众生行业受善报品第十二",
      "translated_text": "**Chapter Ten: The Parable of Virtue’s Shelter**\n\nThe Heavenly Worthy said:\nI am the father and mother of all beings, cherishing and loving you, showing compassion to all, sheltering and nurturing all, moistening and nourishing all. All things that attain me are like fish finding the deep pool, like a child finding its mother, like the hungry finding food, like the thirsty finding drink, like the sick finding a physician, like the people finding their king, like the fearful finding refuge, like the drowning finding a boat, like the poor finding treasure, like the condemned receiving pardon, like the dying being revived, like the ruined being restored. My Dharma universally delivers beings, like a great cloud filling the sky, scattering fine rain in dense layers—none fail to receive its moisture.\n\nBeings do not know me, yet I give you life, raise you, nourish you, rear you, pity you. Why do you not repay my kindness with compassion and perform all good deeds? Instead, seeing my scriptures and Dharma, you do not repent or establish karmic conditions, hastening toward evil destinies, sinking into hell—how grievous, how lamentable! Each of you must diligently cultivate to uproot the seeds of sin and reap the fruits of eternal joy, as I have expounded in my teachings.\n\n**Chapter Eleven: The Retribution of Beings’ Past Karmic Conditions for Receiving Unwholesome Rewards**\n\nThose who in past lives executed others and exterminated clans now receive the retribution of having no descendants.\nThose who in past lives killed infants or harmed fetuses to induce miscarriage now receive the retribution of having children who often die young or become enemies in the family.\nThose who in past lives resented others’ misfortunes now receive the retribution of constantly suffering hardship.\nThose who in past lives resented others’ gains and losses now receive the retribution of being constantly slandered.\nThose who in past lives mocked the poor now receive the retribution of enduring this very distress.\nThose who in past lives stole, robbed, or, being wealthy and powerful, deceived and exploited the poor and lowly, or borrowed without repayment, now receive the retribution of being reborn as oxen, constantly bearing heavy burdens, thinking only of water and grass.\nThose who in past lives lent at interest, demanding tenfold repayment, now receive the retribution of constant suffering and want.\nThose who in past lives resented others afflicted with sores, scabies, leprosy, paralysis, or ulcers now receive the retribution of contracting these very diseases.\nThose who in past lives envied others’ intelligence now receive the retribution of stupidity and ignorance.\nThose who in past lives wore shoes while entering quiet halls and temples now receive the retribution of broken legs, being confined without ease, or having difficulty walking.\nThose who in past lives secretly entered others’ homes at night to commit adultery or theft now receive the retribution of being eyeless or hating the blind.\nThose who in past lives, dwelling in wealth, ate alone, refused to lend, ignored those in peril, lacked benevolence and righteousness, and scorned the poor and lowly, now receive the retribution of being born in barbarian lands among non-human beings.\nThose who in past lives refused to listen when they should have heard, or resented others’ deafness, now receive the retribution of this affliction.\nThose who in past lives engaged in incest with relatives near and distant now receive the retribution of being reborn as donkeys or horses.\nThose who in past lives killed and ate living creatures now receive the retribution of being reborn as livestock or wild beasts, harmed by humans to repay past enmities.\nThose who in past lives killed beings and buried their remains now receive the retribution of assuming the forms of those they killed.\nThose who in past lives killed others’ husbands now receive the retribution of having no husband.\nThose who in past lives killed others’ wives now receive the retribution of having no wife.\nThose who in past lives resented others’ success or failure now receive the retribution of constantly suffering misfortune.\nThose who in past lives hindered others from learning now receive the retribution of being ignorant of learning.\nThose who in past lives, as officials or clerks, harbored mutual hatred and jealousy, slandered and harmed without principle, causing unjust downfalls, now receive the retribution of being slandered and harmed by others, their karmic adversaries entangling them.\nThose who in past lives made offerings to ghosts and spirits now receive the retribution of constant insufficiency, drifting in degradation through the world.\nThose who in past lives cursed and reviled others now receive the retribution of being constantly cursed and hated, or being reborn as dogs.\nThose who in past lives drank wine without restraint, exceeding limits and committing evil, now receive the retribution of having their nature and reason inverted.\nThose who in past lives were unfilial to their parents now receive the retribution of bearing unfilial children.\nThose who in past lives were unkind to their brothers, wives, and children now receive the retribution of having disharmonious families, constantly quarreling, and being scorned by others.\nThose who in past lives wished others to be their slaves now receive the retribution of becoming slaves.\n\nSuch karmic conditions are manifold; here I have briefly recounted some to awaken your understanding. Beings, do not harbor such wishes or perform such deeds. The retribution of good and evil is certain and must be believed.\n\nIf there were no such karmic conditions, all would be born human, sharing the same four great elements—yet why do differences arise in wisdom and foolishness? Why do disparities exist in talent and incompetence? Why do distinctions appear in nobility and poverty? Why do variations occur in brightness and dullness? Why do some possess complete faculties while others do not? Why do some engage in discourse and debate while others do not? Why are some respected and loved while others are not? Why are some honored and revered while others are not? Such matters have been briefly recounted here.\n\n**Chapter Twelve: The Rewards of Beings’ Karmic Deeds for Receiving Wholesome Retribution**",
      "overlap_context": "- did not envy those who studied with resolve,\n- constantly praised the good and excellent,\n- did not contemplate killing,\n- bestowed alms upon the poor,\n- rescued those in distress and relieved the urgent,\n- lit lamps to illuminate the night,\n- wisely protected the Dharma—\n\nthose who performed such meritorious deeds became Perfected Ones in great numbers. Briefly recounting these matters, all are recorded on golden tablets and jade slips, for they planted these karmic conditions in past kalpas.",
      "start_char": 6220,
      "end_char": 7176,
      "start_sentence": 232,
      "end_sentence": 276,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.513359546661377,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\洞玄灵宝太上真人问疾经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "居世富有，从先身布施中来； 居世为人王，从先身供养三宝中来； 居世为法师，善能导化，从先身思念大乘中来； 居世聪明智慧，从先身敬信学问经法中来； 居世为人所敬畏，从先身戒慎三宝中来； 居世衣食有足，从先身济诸穷乏中来； 居世仕宦朱门高达，从先身不伤物夭中来； 居世六情相好具足，从先身不毁三宝中来； 居世言谈无误，从先身讲大乘经教中来； 居世为一切人所依栖，从先身抚恤一切中来； 居世行遇善座人所推让，从先身行善愿人得成中来。 有如是之报，今略言其理，因缘甚多，善恶之根，受报如日月之光，大海之涛，如四时之转，五行之移，如车之轮，众生汝知不，汝悟不，汝解不，汝了不，汝行不，汝信不，汝慎不，汝能受不，吾今说是善恶之事明也。 一切大众咸皆欢喜，作礼而称善，愿得解了。 无始真人言：天尊所说要事，斯妙极之，足令众生回心，其中品目有亿千，众生未能解了，惟道与道，对共解道，惟真与真，对共解真，惟无与无，对共解无。 我受号后劫中，当为无始天师，导太上大乘法，自究今言，诸大众中未悟此真实，其数亦多。 天尊劫身犹如旸谷宫殿，有水灵之台，方圆八十万里，等高亦然，中有金沙，沙大如芥子，满其中，万龄一枚自消，如此消尽。 以为天尊小劫身，其犹如北方有一百八十昆仑所统，三万八千世界中，山陵丘瓦土地林木，一时末为细尘，若於大虚空中扬之，其数犹如天尊身。 大劫一周，众生未悟也，不信也，座中四众小乘身，小劫身，诸天子诸天王诸天帝，亦复不知闻，今说之，亦咸有疑，何况浊世诸众生发有疑惑，是以说之，自可明了。 信者亦难，知者亦难，悟者亦难，受者亦难，遇者亦难，见者亦难，奉者亦难，则是我身之难，我为导师，犹难之以为难，为难审无有难。 无始真人言：五千文是灵耀宝藏天尊五体中神，神亦为老子诏曰五百，老子共集此义，灵为众生之父，宝为众生之母，耀为太阳之光，以明泽一切，藏为包含，万物而生其中，我亦尝经之。 天尊瞻千亿须弥中诸世界众中善恶，学与不学，人及非人，一足两足，四足多足，浊生湿生，卵生胎生化生，如是诸恶，悉皆我眼前从身生，常去眼数寸耳。 众生云不知不见，不见其真父母，或云真圣高远，或云无有神明，能孝父母，则灵气降，不孝父母，则祸罚至，胎生父母是因缘寄孕，其义一等，孰能知乎。 学大乘为缘，但愿生非是至愿果得道者，及功德未足，复应轮转寄生，而福根常不绝，后生常在贤贵富有，德为人尊，相好具足，动为善神所导，学遇明师，葬遇吉山，妻遇好女，出遇食禄，凶神敢干。 不乐与三宝为缘，不信有圣言，恶声骂詈，所为不善，常生下贱，学遇暗师，葬遇凶山，妻遇粗妇，出辄失财，县官相连，举向不利，善神不佑，凶神所牵。 皆由前缘宿命所为，各各星主之，善者属善星，恶者属恶星，生死有对，甚有分明，自非大乘所济，莫能免也。 众生知不，而敬信外道，诸述书籍，此迷误可哀将深。 有百九十八种道者，亦是天尊身。 所以尔者，十方世界中众生心行各异，不知有鬼神，故恶以化恶方便导之，善劝悟之，随顺其本心，渐令知道，悟审上道。",
      "translated_text": "Wealth in this world arises from past-life almsgiving;\nKingship in this world arises from past-life offerings to the Three Treasures;\nBecoming a Dharma Master, skilled in guidance and transformation, arises from past-life contemplation of the Great Vehicle;\nWisdom and intelligence in this world arise from past-life reverence for and faith in scriptural learning;\nBeing respected and feared by others arises from past-life vigilance in upholding the Three Treasures;\nAbundance in clothing and food arises from past-life relief of the destitute;\nHigh rank in officialdom and prominence in noble households arise from past-life restraint from harming living beings;\nThe perfection of the six senses arises from past-life protection of the Three Treasures;\nFlawless speech and discourse arise from past-life expounding of the Great Vehicle’s teachings;\nBeing a refuge for all people arises from past-life compassion and relief of all beings;\nBeing yielded to by good companions and deferred to by others arises from past-life wishing others to succeed in goodness.\n\nSuch are these retributions. Here, their principles are briefly stated. The karmic conditions are manifold; the roots of good and evil bear fruit like the radiance of the sun and moon, like the surging of the great ocean’s waves, like the turning of the four seasons, like the shifting of the Five Phases, like the wheel of a chariot. Do you, all beings, know this? Do you awaken to it? Do you comprehend it? Do you understand it? Do you practice it? Do you believe it? Do you take heed? Can you receive it? Now I have made clear these matters of good and evil.\n\nAll in the great assembly rejoiced, paid homage, and praised the teaching, wishing to fully comprehend it.\n\nThe Venerable One of Limitless Origin said: “The essential matters spoken by the Heavenly Worthy are most wondrous, sufficient to turn the minds of all beings. Among them are countless categories, yet beings cannot fully grasp them. Only the Dao can be understood with the Dao; only the Real can be understood with the Real; only the Void can be understood with the Void.\n\nAfter kalpas of receiving my title, I shall become the Limitless Heavenly Master, guiding the Great Vehicle of the Most High. Reflecting on these words now, many in this great assembly have yet to awaken to this truth.\n\nThe kalpa-body of the Heavenly Worthy is like the palaces of the Sun Valley, with its Terrace of Water Spirits, eighty myriad leagues in circumference and equal in height. Within it is golden sand, each grain like a mustard seed, filling it entirely. One grain dissolves every ten thousand years—such is the duration of the Heavenly Worthy’s minor kalpa-body. It is also like the dust into which all mountains, hills, mounds, earth, forests, and trees of the one hundred eighty Kunlun realms under the three myriad eight thousand worlds to the north are ground, then scattered into the great void. Their number is like the Heavenly Worthy’s body. When a great kalpa has passed, beings still do not awaken, do not believe. Among the four assemblies, those of the Lesser Vehicle, those of minor kalpa-bodies, the deva-princes, deva-kings, and deva-emperors also do not know or hear of it. Now that it is spoken, they too harbor doubts—how much more so the beings of this defiled world, who give rise to confusion! Thus, it is explained so that it may be made clear.\n\nBelief is difficult; knowledge is difficult; awakening is difficult; reception is difficult; encounter is difficult; seeing is difficult; devotion is difficult—such is the difficulty of my own body. As your guide, I deem it difficult, yet in truth, there is no difficulty.\n\nThe Venerable One of Limitless Origin said: “The *Five Thousand Characters* are the spirits within the five bodies of the Heavenly Worthy of the Numinous Radiance Treasure Repository. These spirits were also commanded by Laozi as the *Five Hundred*. Laozi compiled this meaning: the Numinous is the father of all beings; the Treasure is the mother of all beings; the Radiance is the light of the sun, illuminating and nourishing all; the Repository contains and generates the myriad things within it. I too have traversed this path.\n\nThe Heavenly Worthy surveys the good and evil, the learned and unlearned, among all beings—human and non-human, one-footed, two-footed, four-footed, many-footed, born of filth, moisture, eggs, wombs, or transformation—across the myriad worlds within a thousand koṭi Sumerus. All such evils arise before his eyes, mere inches from his body. Yet beings claim they do not know or see, do not recognize their true father and mother. Some say the true sages are distant; some say there are no divine spirits. Those who honor their parents receive descending numinous qi; those who dishonor their parents incur calamitous punishment. The parents of womb-born beings are but temporary vessels for karmic conditions—who can truly understand this?\n\nStudying the Great Vehicle is the condition, yet merely wishing for birth is not the ultimate aspiration of those who attain the Dao. If their merit and virtue are insufficient, they must again revolve through rebirth, yet their karmic roots of blessings remain unbroken. In later lives, they are constantly born into nobility, wealth, and honor, their virtue revered, their features complete, their actions guided by good spirits. They encounter enlightened teachers, auspicious burial sites, virtuous wives, and abundant provisions; malevolent spirits dare not approach.\n\nThose who take no joy in forming karmic bonds with the Three Treasures, who do not believe in the words of the sages, who utter harsh and abusive speech, and commit unwholesome deeds, are constantly born into lowly stations. They encounter unenlightened teachers, inauspicious burial sites, coarse wives, and lose their wealth upon departure. They become entangled with officials, their endeavors fail, good spirits do not protect them, and malevolent spirits lead them astray. All this arises from past-life karmic conditions, each governed by its respective stellar deity. The good belong to good stars; the evil belong to evil stars. Birth and death have their counterparts—this is exceedingly clear. Without the deliverance of the Great Vehicle, none can escape.\n\nDo you, all beings, know this? Yet you revere and trust heterodox teachings and various scriptures—how deeply pitiable is this delusion!\n\nThere are one hundred ninety-eight kinds of Dao, all of which are the Heavenly Worthy’s body. Why is this so? Among the beings of the ten directions’ worlds, their minds and actions differ. Some do not believe in spirits and ghosts, so the evil are transformed through evil expedient means, while the good are exhorted to awaken. Following their original minds, they are gradually led to know the Dao and truly awaken to the supreme path.”",
      "overlap_context": "lent and incompetence? Why do distinctions appear in nobility and poverty? Why do variations occur in brightness and dullness? Why do some possess complete faculties while others do not? Why do some engage in discourse and debate while others do not? Why are some respected and loved while others are not? Why are some honored and revered while others are not? Such matters have been briefly recounted here.\n\n**Chapter Twelve: The Rewards of Beings’ Karmic Deeds for Receiving Wholesome Retribution**",
      "start_char": 7176,
      "end_char": 8397,
      "start_sentence": 277,
      "end_sentence": 304,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.778440475463867,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\洞玄灵宝太上真人问疾经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "为正一者，无内无外，无表无裹，无精无粗，无二亦无三，无十亦无百，以行求之，求之由心，幽明之理，甚有微妙。 诸众生见不见，常如见，畏不畏，常如畏，慎不慎，常如慎，行不行，常如行，受不受，常如受，爱不爱，常如爱，修不修，常如修，要使如是三百六十契令，是真非真，是一非一，如我所说明之也。 此经是天尊金口所出，不得轻毁，轻则祸罚，崇则福宥。 若有志大乘之子，必能耽向供养读诵，思详是义，以解见世之罪，以灭先缘之恶，以释九祖之殃，以济一切之苦。 将来求道，使精神澄正，鬼神拥护，魔王敬礼者，赍金宝，质心长斋千日，然后而付焉。 无始真人言：我受无为以万物之气息也，始者是万物结精气也，生死之理，我身是也。 一名龙牙山，二名龙身，三名龙肝，四名凤鸣，五名师子头，六名小劫，七名常住，八名见在，九名当来，十名过去，此山方圆八千亿万里，骞华树下方圆四百亿万里，上圣高真一劫而降此山，说大乘经，集会大众。 天尊尔时种种说法，一切各各自知，悟其语种类相随，无误谬鸟蛾之王，俱同一解，起於此山，山以黄金为坛，白银为阶，七宝为树，庆云为华，龙凤天兽所依栖，众中诸众生亦有未尝见遇。 天尊开大宥而为见其山形，亦是先身之缘，诸是学者，勤修大乘法，果后得会此山。 其山亦有七宝宫殿，自然妓乐，是国无春秋冬夏，阴阳气候，自然常存。 大乘经其一耳，支散为千亿万，龙车所不能载，东井不足为汋。 一者，五千文是也，是空也，是虚也，是无也，是有也，是天也，是地也，是万物也。 十方常住高真，共所思议无厌也。 厥一字者，天尊内名常示世间，众生弗悟耳，后世众生有得道果者，及至贤圣聪明智慧儒学之人，而思惟是义，或用为外教虚谈，亦善也。 此经是大圣之身，内引气灵，外敷妙义，莫能究也，过去劫中诸众生思惟是趣，各各信言，其意此已消也，言谈是理非理，得与不得，知趣及不知趣，我亦能纳受，不责於人，顺百姓之心，詺曰以百姓心为心也。 无始真人言：道家治身之法，如恒河沙，非可尽学，但令执一者耳。 服符道引，吐纳隐薮，先功未满，其不能也，可勤供养是经，礼拜祝愿，读诵修研，善心信向，无有疑惑，懈退怠倦，志意日新，亦克得飞腾策驾龙车，九祖同轮，善自思之，是经者，五千文也。 元始真人勤学颂，其辞曰： 妙哉无上道，道真五千文。 空无本无迹，有迹霞散分。 分者难思测，三一合帝君。 三乘无有二，虚皇敷导宣。 众生多疑惑，说法悟以传。 解根恶缘逮，去离老病烦。 长生居久视，果业乘景云。 逍遥太虚中，高圣乃齐群。 亿劫由朝晨，未有忧恼冤。 顾看后学子，懈退信不专。 平相称嫉妬，那得同升辕。 沈灭九夜下，考楚是汝魂。 转轮三涂中，善缘不复闻。",
      "translated_text": "To practice the Orthodox Unity (Zhengyi), there is no inside nor outside, no surface nor core, no essence nor grossness, neither two nor three, neither ten nor a hundred. Seek it through practice, and seek it from the heart—its principles of obscurity and clarity are exceedingly subtle and wondrous.\n\nAll beings, whether they see or do not see, must ever act as though they see; whether they fear or do not fear, must ever act as though they fear; whether they are cautious or not, must ever act as though they are cautious; whether they practice or not, must ever act as though they practice; whether they receive or not, must ever act as though they receive; whether they love or not, must ever act as though they love; whether they cultivate or not, must ever act as though they cultivate. Thus must the three hundred and sixty agreements be upheld. Whether it is real or not real, whether it is one or not one—this is what I have made clear.\n\nThis scripture issued from the golden mouth of the Heavenly Worthy. It must not be lightly slandered; to do so invites calamity and punishment, while reverence brings blessing and forgiveness. If there are those who aspire to be children of the Great Vehicle, they must devote themselves to its veneration, make offerings, recite and study it, and ponder its meaning deeply. Thus may they dissolve the sins of this present life, eradicate the evil of past causes, release the misfortunes of nine generations of ancestors, and deliver all from suffering.\n\nThose who seek the Dao in the future must first purify and rectify their spirit. Then will ghosts and spirits protect them, and demon kings pay them homage. They must present gold and treasures, pledge their hearts, and maintain a thousand-day fast before the scripture is bestowed upon them.\n\nThe Perpetually Primordial Realized One said: “I receive the formless and the qi of the myriad things’ breath. The beginning is the coalescence of the myriad things’ essence and qi—this is the principle of life and death, and it is my body.”\n\nIt has one name: Dragon’s Tooth Mountain; two names: Dragon’s Body; three names: Dragon’s Liver; four names: Phoenix Cry; five names: Lion’s Head; six names: Lesser Kalpa; seven names: Eternal Abode; eight names: Present Manifestation; nine names: Future Advent; ten names: Past Occurrence. This mountain spans eight thousand billion myriad *li* in circumference. Beneath its kalavinka trees, the area extends four hundred billion myriad *li*. Once every kalpa, the Supreme Sages and Lofty Perfected descend upon this mountain to expound the Great Vehicle scriptures and gather the great assembly.\n\nAt that time, the Heavenly Worthy discoursed in manifold ways, and each being understood according to their own capacity. Awakening to the varieties of his teachings, none erred—even the kings of moths and butterflies all attained the same understanding. The mountain arose thus: its altar was of yellow gold, its steps of white silver, its trees of the seven treasures, its blossoms of auspicious clouds. Dragons, phoenixes, and celestial beasts dwelt there, though among the assembly were those who had never before encountered such wonders.\n\nThe Heavenly Worthy, in his great compassion, revealed the mountain’s form, for it was tied to the causes of their former lives. All who study must diligently cultivate the Great Vehicle Dharma, for only afterward may they gather upon this mountain. The mountain also possesses palaces of the seven treasures and spontaneous celestial music. In that land, there is no spring, autumn, winter, or summer—yin and yang, the seasons, exist naturally and eternally.\n\nThe Great Vehicle scripture is but one, yet it branches into a thousand billion myriad forms—so vast that dragon-drawn chariots could not bear its weight, nor the Eastern Well measure its depth.\n\nThe first is the Five Thousand Characters. It is emptiness, it is void, it is non-being, it is being, it is heaven, it is earth, it is the myriad things. The Eternally Abiding Lofty Perfected of the ten directions ceaselessly contemplate it without surfeit.\n\nIts single character is the Heavenly Worthy’s esoteric name, ever revealed in the world, yet beings fail to awaken to it. Even in later ages, those who attain the Dao’s fruit, as well as the worthy, sagely, wise, and learned scholars who ponder this meaning—though they may treat it as the empty discourse of external teachings—still do good thereby.\n\nThis scripture is the body of the Great Sage. Internally, it draws in the numinous qi; externally, it unfolds wondrous meanings—none can fathom its depths. In past kalpas, all beings who pondered this truth believed in its words, and their intentions were thus dissolved. Whether their speech accorded with principle or not, whether they attained or failed to attain, whether they understood the path or not—I too can receive it all, without reproaching others. I follow the hearts of the people, for it is said: “Take the people’s heart as one’s own heart.”\n\nThe Perpetually Primordial Realized One said: “The Daoist methods for governing the body are as numerous as the sands of the Ganges—none can master them all. One need only grasp the One.”\n\nIngesting talismans, guiding and pulling, exhaling and inhaling, concealing and hiding—without completing the prior practices, one cannot succeed. Instead, one should diligently make offerings to this scripture, prostrate in worship, make vows, recite and study it, cultivate sincere faith without doubt, laziness, or weariness, and renew one’s resolve daily. Thus may one attain the power to soar and ride the dragon chariot, with nine generations of ancestors ascending together. Reflect well upon this: this scripture is the Five Thousand Characters.\n\nThe Primordial Commencement Realized One diligently studied and praised it, saying:\n\nWondrous is the supreme Dao,\nThe true Five Thousand Characters.\nEmpty and without origin, without trace,\nYet traces scatter like mist and clouds.\nScattered, they are beyond thought or measure—\nThe Three and the One unite in the Lord Emperor.\nThe Three Vehicles are not two,\nThe August Void expounds and proclaims.\nBeings are full of doubt,\nYet through preaching, awakening is transmitted.\nSever the roots of evil karma,\nDepart from the troubles of old age and sickness.\nAttain long life and enduring vision,\nFruits and deeds ride the rosy clouds.\nRoam freely in the Great Void,\nThe lofty and sagely join the assembly.\nFor kalpas as countless as the morning,\nThere is no sorrow, no affliction, no enmity.\nLook back upon later students—\nLazy and half-hearted in faith,\nLeveling resentments and envy,\nHow can they ascend the same chariot?\nSinking into the nine nights below,\nTheir souls endure trials and torments.\nRevolving through the Three Paths,\nThey will never again hear of good causes.",
      "overlap_context": "nd various scriptures—how deeply pitiable is this delusion!\n\nThere are one hundred ninety-eight kinds of Dao, all of which are the Heavenly Worthy’s body. Why is this so? Among the beings of the ten directions’ worlds, their minds and actions differ. Some do not believe in spirits and ghosts, so the evil are transformed through evil expedient means, while the good are exhorted to awaken. Following their original minds, they are gradually led to know the Dao and truly awaken to the supreme path.”",
      "start_char": 8397,
      "end_char": 9477,
      "start_sentence": 305,
      "end_sentence": 335,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.720850229263306,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\洞玄灵宝太上真人问疾经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "无始真人言：前劫时人学上仙长生之道，不死之法，不念居世，居世则多想，多想则有忧，有忧则累心，累心则忘道，有妻子则忧妻子，有财宝则忧财宝，有疾病则忧疾病，有死丧则忧死丧，有贫穷则忧贫穷，诸有此行，岂离死痛，与长生便乖。 有一身者不知忧，不知忧则道法长存也。 后世学惑也，惟知爱惜身命，不知保爱精神，形是四大之屋室，为屋岂能长久，人去屋则不立，使精神散，精神转轮不灭，不沈不绝。 愚人厚营广冢大材，杀生葬送，以此为孝慈，不知应有长夜之对，惑哉惑哉。 其不愿为太上宾，趣为国王民，此之谓苦也。 圣人有子弟者，非其子弟，是前人有福寄其圣姓耳，圣人无有种学者，要令解之至如解。 前劫时其功未满，学上道仙品，未足运应灭度，身经太阴，有子弟请诸法师，及其义友亲表，为行三七斋，转五千文，十过以拔其魂神。 夫学上道之士，求转轮速腾，不必有年寿，如世间凡人愚者，保爱命长未悟耳，既未悟，则有哭，有哭则见身之病也，可哀世人本有成败，长短有哭。 所以三七斋者，一七水官除罪，二七土官解过，三七三界度生，离地狱苦，无复有对，便得速化。 竟三七日，营法是佳，弗者日数中节，节亦善也，六时勤苦，以过命者先。 所有众物为信，供养法师三宝，善思之焉，斯妙矣，并是后世一切人之惑也，生时不知为善，立福田之业，死时所有衣服众宝珍物埋送棺冢之中，益为亡者恼累，不知以为作开度其死者，津涂其亡者。 生人不忍者，自可寒夏各一通，不须有长此忘众生之实。 明思我言。 无始真人言：当来之世，众生心多粗恶，不悟善缘，不如今生朴实，自当有后贤智者告诸法则，礼教之文，夫因缘之理，则生父母兄弟伯叔姊妹姑姨六亲之义，有哀服之科，此是为一切凡人之施，非学上道之士所可同其科也。 父母以下命终，每发为功德之心，愿同更化生其真父母前，不复生死，无祭灵之目，益为丧道心。 詺曰而乱之一首，善详之焉。 无始真人言：后学之子，最忌非分贪婪，枉遏人理，而强为己润，为人所怨责，唤告鬼神，虽受经法服符，导引吐纳，斋戒行道，及服灵药，节食饮，徒自劳形体於外形，仙亦无所感致，更被考速耳，粗事不能奢，挟此学道，詺曰求竞世间，非谓真实也。 见世为恶鬼所杀不觉，死时既如此，精神沈堕地狱，受对难明识我言。 学者行心入虫蚁中，亦使和心入六畜中，亦使和心入鸟兽中，亦使和心入鬼神中，亦使和心入好恶人中，亦使和心入林木中，亦使和心入一切，万物同善其行，无分毫恼责之心，如此克为鬼神所拥护，三界所保举，自然成真。 无始真人言：天尊及我身观未然及过去见在之事，朗然如在我心。 天尊尔时即放额顶之中紫毫相光，普照十方千亿昆仑三万六千大千世界，其中种种众生，无有不见了然，其光如金色，光中有百千种音声，众生乐闻，从光中寻之，不觉至骞华树下，一切善得而闻说法因缘之根，是天尊喻取一切大威神故也，一劫一遇耳，宜监临后学，善自行焉。 天尊有大威神力，是勉济诸众生，故其犹如三界中，无形有大声，无形大力，有揽之不得，如虚空中日月星辰，玄居不着，下至自然，运转人身亦尔。",
      "translated_text": "The Perfected of Primordial Beginning spoke:\nIn former kalpas, those who studied the Way of celestial immortality and the arts of deathlessness did not dwell in the world. To dwell in the world is to entertain many thoughts; many thoughts breed care; care burdens the heart; a burdened heart forgets the Dao. With wife and children, one worries for wife and children; with wealth and treasures, one worries for wealth and treasures; with illness, one worries for illness; with death and mourning, one worries for death and mourning; with poverty, one worries for poverty. All who follow such ways—how can they escape the pain of death? They diverge from the path of long life.\n\nOnly those who possess a single body know no care; knowing no care, the Dao and its methods endure forever. Later generations, deluded in their learning, only know to cherish their bodily lives, unaware of preserving and nurturing their spirit. The form is but a dwelling of the Four Great Elements—how can a dwelling last forever? When the person departs, the dwelling collapses, and the spirit scatters. Yet the spirit revolves without ceasing, neither sinking nor perishing.\n\nFools lavishly prepare grand tombs and fine timber, slaughtering living beings for burial rites, believing this to be filial piety and compassion. They do not realize they will face the long night of reckoning—how deluded, how deluded! They do not wish to become guests of the Most High, but hasten to be kings or common folk—this is true suffering.\n\nWhen sages have disciples, they are not truly their disciples, but rather those upon whom past blessings have bestowed their sacred lineage. Sages have no fixed lineage of learners; what matters is that they comprehend fully, as if understanding were itself comprehension.\n\nIn former kalpas, when their merit was not yet complete, those who studied the highest Dao and the ranks of immortality had not yet fulfilled their destined transformation. Their bodies passed through the Great Yin, and their disciples, along with Dharma masters, close friends, and kin, would perform the Three Sevens retreat, recite the Five Thousand Characters ten times, and liberate their souls and spirits.\n\nThose who study the highest Dao seek swift ascent through the revolving wheel; they need not possess long years of life. Unlike the foolish worldly folk who cling to long life without awakening, they, once unawakened, will weep. Weeping reveals the sickness of the body—how lamentable! Worldly people, by nature, face success and failure, long and short lives, and thus weep.\n\nThe Three Sevens retreat serves thus: the first seven days, the Water Official absolves sins; the second seven, the Earth Official resolves transgressions; the third seven, the Three Realms deliver beings, freeing them from the sufferings of hell, sparing them further reckoning, and hastening their transformation. Completing the full twenty-one days of the retreat is best; if not, observing the appointed days is also good. Diligence in the six periods of the day and night surpasses even the merit of saving lives.\n\nAll offerings made in faith, dedicated to the Three Treasures and the Dharma masters, should be thoughtfully considered—this is most wondrous. Yet all these are the delusions of later generations, who in life do not know to do good and establish fields of merit, but at death bury their clothing, treasures, and precious goods in coffins and tombs, only increasing the burdens and afflictions of the deceased. They do not understand that such acts are meant to deliver the dead and smooth their passage.\n\nFor the living, one set of garments for winter and summer suffices; there is no need for prolonged mourning that forgets the true needs of beings. Reflect deeply upon my words.\n\nThe Perfected of Primordial Beginning spoke:\nIn the ages to come, the minds of beings will grow coarse and wicked, failing to awaken to good causes. Unlike those of simple and honest nature today, future wise and worthy ones will teach the principles of ritual and doctrine. They will expound the truths of karmic conditions, the bonds of parents, siblings, uncles, aunts, sisters, and the six relations, and the rites of mourning—these are practices for all worldly people, not for those who study the highest Dao.\n\nWhen parents or those below pass away, one should cultivate a mind of merit, wishing to be reborn together with their true parents in the future, free from life and death, without the need for ancestral rites. Such mourning only harms the heart of the Way. This is called \"the disorderly verse\"—ponder it well.\n\nThe Perfected of Primordial Beginning spoke:\nLater learners must above all avoid unwarranted greed, obstructing others’ principles to enrich themselves, incurring resentment and invoking the wrath of spirits and gods. Though they may receive scriptures, wear talismans, practice breath control, observe fasts, cultivate the Dao, take elixirs, and regulate their diet, they merely exhaust their bodies outwardly. No immortality will be attained; instead, they hasten their trials. Coarse affairs cannot be extravagant—those who cling to such ways in their study are said to \"seek competition in the world,\" not true realization.\n\nIf one is slain by evil spirits in this life without awareness, at death the spirit will sink into hell, facing reckoning. How difficult to recognize my words! Let the learner’s mind enter the realm of insects and ants with harmony, the realm of the six livestock with harmony, the realm of birds and beasts with harmony, the realm of spirits and gods with harmony, the realm of good and evil people with harmony, the realm of forests and trees with harmony, and all things with harmony. Let all beings share in goodness, without the slightest thought of harm or blame. Only thus will one be protected by spirits and gods, commended by the Three Realms, and naturally attain perfection.\n\nThe Perfected of Primordial Beginning spoke:\nThe Heavenly Worthy and I observe the unseen, the past, and the present as clearly as if they were in our hearts.\n\nThen the Heavenly Worthy emitted from the center of his forehead the radiance of his purple-tinged brow, illuminating the ten directions, the thousand millions of Kunlun, and the three thousand six hundred great thousand worlds. All beings within beheld it with perfect clarity. The light was golden, and within it resounded a hundred thousand kinds of voices, delightful to hear. Following the light, beings unknowingly arrived beneath the Kalpa Flower Tree, where all good was attained, and they heard the roots of the Dharma’s karmic conditions expounded. This was the Heavenly Worthy’s demonstration of his great majestic power—a single encounter in a kalpa. Let later learners take heed and cultivate themselves well.\n\nThe Heavenly Worthy possesses great majestic power, striving to save all beings. Thus, within the Three Realms, though formless, there is a great voice; though formless, there is great strength—unattainable, like the sun, moon, and stars in the void, abiding mysteriously without attachment. From this arises spontaneity, and the turning of the human body is likewise.",
      "overlap_context": "d enduring vision,\nFruits and deeds ride the rosy clouds.\nRoam freely in the Great Void,\nThe lofty and sagely join the assembly.\nFor kalpas as countless as the morning,\nThere is no sorrow, no affliction, no enmity.\nLook back upon later students—\nLazy and half-hearted in faith,\nLeveling resentments and envy,\nHow can they ascend the same chariot?\nSinking into the nine nights below,\nTheir souls endure trials and torments.\nRevolving through the Three Paths,\nThey will never again hear of good causes.",
      "start_char": 9478,
      "end_char": 10708,
      "start_sentence": 336,
      "end_sentence": 357,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.678834199905396,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\洞玄灵宝太上真人问疾经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "所以气通神力，如是人存真，真存人，人敬神，神敬人，人爱灵，灵爱人，人忘气，气忘人，人忽道，道忽人，故曰有善缘，从明入明，从见入见，从解入解，从乐入乐，不为善缘，徒过入过，从冥入冥，从苦入苦，其对有斯，是众生之本，后劫中能信能行，能奉能修，能善能勤，有为是法师，善说我语，而为导师，劝一切令入法门，行斋修经，悔过祈请，以救生死之缚，其仪律甚多，要用后圣所撰集详行焉。 立功嚫愿，从一至十，从百至千，从千至万。 集缯宝物，以施斋官，中分为三，一分供养灵宝三师，二分供养至真上圣，三分供养善缘。 果报之理，亦如有无，有无中真，从此为之。 真人言三分者，一施斋官，一施供养法师，一年三年一施供养度师祖师，二师不存，以付籍师，传送依三天法，为之如此也。 夫真人之号，其有仪格，去上道犹远，是神通自在，不复退落，役鬼使神，犹尚有为，勤为大功，历劫入微，渐至上道，诸有如此，比例皆是。 前劫中学道之人，而为其真，非卒可求，希生为缘，系着幽冥，自然不忘，忽为懈怠，被试退落，方复沦沈五道，未有反时。 明识我言，我受天尊教勑，后劫中为众生父母，教子生长之缘，避恶之人，善慎详我之言。 夫导运应开之劫，惟天师出世，其在一也，非为圣圣所出，经戒亦无大小，亦无前后，亦无高下，同为一耳，其有品格，詺品等帙，圣圣各有为者，为众生故也。 非二非三，同如我身，学者善能解之，玄都旧格，玉清三十一卷，紫微三十六卷，太极三卷，其品及部数各有盟，有盟以为身宝，保其气故也。 夫死者皆从内起，非外入，既从内发，外便有应，有应则致大灾，内固不动不耀，湛然安神，詺曰默神神自居。 故曰上学无为，无为气治，下学有为，有为则身心同劳，同劳则宿缚披散，渐至气治，非为默神，行罪既消灭，自然神静，神静便久视，其功未满，默神亦不立，要令劳身苦体，救济万物，不倦其苦。 国王有灾，修诵是经； 君父不安，修诵是经；",
      "translated_text": "Thus does qi communicate with numinous power. When a person preserves the Real, the Real preserves the person; when a person reveres the gods, the gods revere the person; when a person cherishes the spirits, the spirits cherish the person. When a person forgets qi, qi forgets the person; when a person neglects the Dao, the Dao neglects the person. Hence it is said: those with good karmic conditions proceed from brightness into brightness, from vision into vision, from understanding into understanding, from joy into joy. Those without good karmic conditions merely pass from error into error, from darkness into darkness, from suffering into suffering. Such are the correspondences—this is the root of all beings. In future kalpas, those who can believe and practice, who can uphold and cultivate, who can do good and be diligent, are the Dharma-teachers who, skillfully expounding my words, serve as guides, exhorting all to enter the Dharma-gate, perform purificatory fasts, recite scriptures, repent transgressions, and pray for deliverance, thereby loosening the bonds of birth and death. The rituals and precepts are manifold; one must rely on the detailed practices compiled by later sages.\n\nEstablishing merit and making vows proceeds from one to ten, from a hundred to a thousand, from a thousand to ten thousand. Gather silks and treasures to offer to the fast-officiant, dividing them into three portions: one portion for the Three Masters of the Numinous Treasure, one portion for the Perfected and Most High Saints, and one portion for those with good karmic conditions. The principle of karmic retribution is likewise as it is with being and non-being—within being and non-being lies the Real; proceed from this.\n\nThe Realized One speaks of three portions: one offered to the fast-officiant, one offered to the Dharma-teacher, and one offered annually or triennially to the master who transmits the precepts, the ancestral master. If the two masters are no longer present, the offering is entrusted to the registrar-master, transmitted according to the laws of the Three Heavens—thus is it done.\n\nThe title of Realized One has its standards, yet the supreme Dao remains distant. Those who attain spiritual penetration and freedom no longer regress; though they command ghosts and employ spirits, they still engage in activity. Diligently performing great deeds, they traverse kalpas and enter subtlety, gradually approaching the supreme Dao. All such cases are comparable. Those who studied the Dao in past kalpas and became Realized did not attain it suddenly. Rarely born with karmic conditions, they remain bound to the hidden and obscure, naturally unforgetting. Should they grow lax, they are tested and fall back, then sink once more into the Five Paths, with no time for return.\n\nUnderstand my words clearly. I have received the Heavenly Worthy’s command: in future kalpas, I shall be the parent of all beings, teaching the conditions for their growth and guiding those who shun evil. Heed my words well. In the kalpa when the Dao’s dispensation unfolds, only the Heavenly Master appears—this is singular. It is not that sages produce sages; scriptures and precepts have no distinction of great or small, no order of before or after, no hierarchy of high or low. They are all one. Yet there are ranks and categories, named according to their grade and volume. Each sage acts for the sake of beings.\n\nIt is neither two nor three, but identical to my own body. Let learners skillfully comprehend this. The ancient statutes of the Mystery Metropolis: thirty-one scrolls of the Jade Purity, thirty-six scrolls of the Purple Tenuity, three scrolls of the Great Ultimate. Their ranks and divisions each have their covenants, and these covenants serve as the body’s treasure, preserving one’s qi.\n\nDeath arises from within, not from without. Once it emerges from within, there is a response without, and this response brings great calamity. If within one remains unshaken and unradiant, abiding serenely in spirit, it is called \"silent spirit, spirit abiding of itself.\" Thus it is said: those who study the higher learning practice non-action, and through non-action, qi is governed. Those who study the lower learning engage in action, and through action, body and mind labor together. When both labor together, the bonds of past karma unravel, gradually leading to the governance of qi. It is not through silent spirit alone. When transgressions are extinguished, the spirit naturally becomes tranquil; when the spirit is tranquil, longevity is attained. If merit remains unfulfilled, silent spirit is not established. One must labor the body and afflict the flesh, aiding and delivering all beings without wearying of hardship.\n\nWhen a king faces calamity, recite this scripture. When the sovereign father is unwell, recite this scripture.",
      "overlap_context": "monstration of his great majestic power—a single encounter in a kalpa. Let later learners take heed and cultivate themselves well.\n\nThe Heavenly Worthy possesses great majestic power, striving to save all beings. Thus, within the Three Realms, though formless, there is a great voice; though formless, there is great strength—unattainable, like the sun, moon, and stars in the void, abiding mysteriously without attachment. From this arises spontaneity, and the turning of the human body is likewise.",
      "start_char": 10708,
      "end_char": 11483,
      "start_sentence": 358,
      "end_sentence": 371,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.45063877105713,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\洞玄灵宝太上真人问疾经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "疫毒流行，修诵是经； 人民死病，修诵是经； 日月失昏，修诵是经； 星宿错度，修诵是经； 劫运有终，修诵是经； 风雨不时，修诵是经； 师友疾病，修诵是经； 室家终亡，修诵是经； 五谷不熟，修诵是经； 盗贼多有，修诵是经； 众生相诅，修诵是经； 学退不固，修诵是经； 骂詈嗔恚，修诵是经； 诸天斋日，修诵是经。 行斋诵经，声彻太虚，举响有降，令为梵音，梵音微妙，感应众圣，魔王敬礼，诸真称善，有如此之功，上与天真齐德，渐入神定。 身中三十二相，自得具足，发青长，项紫光，眉月形，耳玄听，目明精，鼻涕泠，口方圆，齿濡刚，白银洁，数四十，细等平，舌灌泉，引月精，洨宫津，喉娄高，柱强坚，手柔握，内外揽，脚力强，步玄空，心正安，制魔王，肝耀明，入岱宗，肺气素，着华阴，肾发力，观恒山，脾受气，蔼嵩高，胆威声，振灵响，诵通微，入无间，此皆是学所得，非自然也。 洞玄灵宝太上真人问疾经竟",
      "translated_text": "When pestilence and poison spread, recite this scripture. When the people suffer death and illness, recite this scripture. When sun and moon lose their brightness, recite this scripture. When stars and constellations deviate from their courses, recite this scripture. When the kalpa nears its end, recite this scripture. When wind and rain come unseasonably, recite this scripture. When teachers and friends fall ill, recite this scripture. When household and family perish, recite this scripture. When the five grains do not ripen, recite this scripture. When thieves and bandits abound, recite this scripture. When beings curse one another, recite this scripture. When learning declines and resolve weakens, recite this scripture. When scolding, slander, and wrath arise, recite this scripture. On the fast days of the devas, recite this scripture.\n\nIn performing the fast and reciting the scripture, let the voice resound through the Great Void. When the sound rises, it descends as Brahma-tones. The Brahma-tones are subtle and wondrous, moving the response of all sages. The Demon Kings pay reverence, and all Perfected Ones praise its goodness. With such merit, one’s virtue becomes equal to that of the Heavenly Perfected, gradually entering the divine samādhi.\n\nWithin the body, the thirty-two marks naturally become complete: hair grows dark and long, the nape radiates purple light, eyebrows take the shape of the crescent moon, ears hear the profound, eyes shine with clarity, the nose is cool and dry, the mouth is square and round, teeth are moist and firm, white as silver and pure, numbering forty, even and fine, the tongue is bathed in spring waters, drawing in the essence of the moon, the Palace of Saliva flows with celestial fluid, the throat is lofty, the spine strong and firm, hands are soft yet grasp firmly, embracing both inner and outer, feet are powerful, treading the mysterious void, the heart is upright and at peace, subduing the Demon Kings, the liver shines with brightness, entering Mount Tai, the lungs are pure in qi, dwelling in Huayin, the kidneys radiate strength, gazing upon Mount Heng, the spleen receives qi, embracing the loftiness of Mount Song, the gallbladder roars with mighty voice, shaking the numinous resonance, recitation penetrates the subtle, entering the unobstructed. All these are attained through study, not by nature.\n\nThe *Scripture of the Supreme Perfected of the Cavernous Mystery and Numinous Treasure on Questioning Illness* concludes.",
      "overlap_context": "el, gradually leading to the governance of qi. It is not through silent spirit alone. When transgressions are extinguished, the spirit naturally becomes tranquil; when the spirit is tranquil, longevity is attained. If merit remains unfulfilled, silent spirit is not established. One must labor the body and afflict the flesh, aiding and delivering all beings without wearying of hardship.\n\nWhen a king faces calamity, recite this scripture. When the sovereign father is unwell, recite this scripture.",
      "start_char": 11483,
      "end_char": 11857,
      "start_sentence": 372,
      "end_sentence": 388,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.393365144729614,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\洞玄灵宝太上真人问疾经.txt",
        "category": "正统道藏太平部"
      }
    }
  ]
}