{
  "source_id": "洞神三皇七十二君斋方忏仪",
  "source_file": "chunked_daozang\\洞神三皇七十二君斋方忏仪.json",
  "total_chunks": 2,
  "total_original_chars": 2465,
  "total_translated_chars": 18089,
  "total_translation_time": 78.19553065299988,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\威仪类\\洞神三皇七十二君斋方忏仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**Liturgical Rites for the Fast of the Three Sovereigns and Seventy-Two Lords of the Cavernous Divine**\n\n*Title:* *Liturgical Rites for the Fast of the Three Sovereigns and Seventy-Two Lords of the Cavernous Divine*\nCompiled by the Tang-dynasty Daoist Du Guangting. A ritual of offering and invocation to the gods of Heaven and Earth. One fascicle.\n*Source text:* *Daoist Canon of the Zhengtong Era*, Cavernous Divine Section, *Weiyi* (Ritual Dignity) Category.\n\n**Liturgical Rites for the Fast of the Three Sovereigns and Seventy-Two Lords of the Cavernous Divine**\nRevised and edited by Master Guangcheng, Du Guangting\n\n---\n\n**The Nine Celestial Lords of the Eastern Heavens**\nWe have heard that when primordial *qi* congealed in the void, the Nine Heavens suspended their signs. They inaugurated the four seasons, and the eastern wind issued from *Zhen*; they disseminated the Five Constants, and the transformative power of *ren* advanced with spring. They initiated the triad of luminaries and presided over the inception of the myriad beings.\n\nNow, the Emperor, in accordance with Heaven’s transformative power and employing the Dao to rectify the times, aligns his virtue with the warmth of *yang* and his brilliance with the radiance of the sun and moon. In strict observance of the ritual codes, he presents incense, flowers, lamps, candles, and all requisite offerings, reverently invoking the Nine Celestial Lords of the Eastern Heavens, the Year Star of Wooden Virtue, the Azure Dragon of the Seven Mansions, and all stellar officials within and beyond.\n\nMay these meritorious deeds descend from the Nine Heavens of the Eastern Prime, the Jasper City of the Dawn *qi*, and the Nine Radiant Mists, to come and assist the Emperor’s person. During the three months of spring, in the positions of *jia*, *yi*, *yin*, *mao*, and *chen*, should there be dimmed red stars, earthly nets and celestial snares, clashes with the native year or the primal *chen*, or any misfortunes and calamities, may all be swept away.\n\nMay names be inscribed on the jade tablets of the Azure Palace, and years be added to the Emperor’s span. May the Two Modes harmonize, the Seven Luminaries shine with constancy, winds and rains arrive in season, warmth and coolness follow their proper order. May the house flourish and the state prosper, distant regions be pacified and near ones secure. May all officials and commoners, within and without, together partake in felicitous blessings. After attaining the Dao, may he unite with the Celestial Lords in perfection.\n\n---\n\n**The Nine Celestial Lords of the Southern Heavens**\nWe have heard that the Cavernous Void congealed its efflorescence, and the Cinnabar Heavens unfolded their transformations. They activated the Fire Virtue, and the radiance of *yang* suffused all; they disseminated civil brilliance, and the teachings of ritual spread afar. Lofty, they arrayed the Nine Layers; below, they oversaw the Southern Culmen.\n\nNow, the Emperor, endowed with felicity from Heaven, rectifies the times and descends into the world. His virtue encompasses divine martiality, and the hearts of the Eight Directions turn toward his transformative power. His Dao accords with pure harmony, and the myriad states rely on his revivifying grace.\n\nIn strict observance of the ritual codes, he presents incense, flowers, lamps, candles, and all requisite offerings, reverently invoking the Nine Celestial Lords of the Southern Heavens, the Sparkling Deluder of Fiery Virtue, the Vermilion Bird of the Seven Mansions, and all stellar officials within and beyond.\n\nThrough these meritorious deeds, may they descend from the Nine Heavens of the Southern Prime, the Vermilion Radiance of the Cinnabar Terrace, and the Three Suspended Lights, to come and assist the Emperor’s person. During the three months of summer, in the positions of *bing*, *ding*, *si*, *wu*, and *wei*, should there be earthly nets and celestial snares, dimmed red stars, inauspicious mansions clashing, the native year, or any misfortunes and declines, may all be released and dispersed.\n\nMay longevity be inscribed in the Southern Palace, names be recorded on the cinnabar tablets. May the merit of enriching the state endure forever, and the registers of long life shine anew. May the palace chambers flourish, distant and near regions feast in peace. May felicity inherit the mountains and rivers, and blessings suffuse the armies and the people. After attaining the Dao, may he unite with the Celestial Lords in perfection.\n\n---\n\n**The Nine Celestial Lords of the Western Heavens**\nWe have heard that when the pure and turbid separated their forms, *yin* and *yang* established their positions. When autumn arrived, the *qi* of the Nine Heavens grew solemn; when the Metal Phase advanced, the winds of the Four Seas turned clear. They settled the Five Constants in righteousness and perfected the myriad beings in their functions.\n\nNow, the Emperor, responding to the mandate and emerging in his time, rectifies the era and disseminates his virtue. His transformative power harmonizes, and the seas and lands turn toward his influence; his achievements are lofty, and Heaven and Earth share in his merit. Ever revering the mysterious codes, he secures the state and the realm.\n\nIn strict observance of the ritual codes, he presents incense, flowers, lamps, candles, and all requisite offerings, reverently invoking the Nine Celestial Lords of the Western Heavens, the Grand White of Metallic Essence, the White Tiger of the Seven Mansions, and all stellar officials within and beyond.\n\nThrough these meritorious deeds, may they descend from the Nine Heavens of the Western Prime, the Luminous Pavilion of Pristine Efflorescence, and the Seven Flowing Lights, to come and assist the Emperor’s person. During the three months of autumn, in the positions of *geng*, *xin*, *shen*, *you*, and *xu*, should there be earthly nets and celestial snares, dimmed red stars, inauspicious mansions clashing, the Eight Trigrams and Nine Palaces, or any misfortunes and declines, may all be released and dispersed.\n\nMay the Sages of the West inscribe his name upon the Seven-Treasure Golden Gate, and the Lofty Perfected of the Highest extend his years in the Jade Registers of the Three Clarities. May the Eight Winds harmonize, the Five Grains ripen in abundance. May blessings cover the state and felicity suffuse the armies and the people. After attaining the Dao, may he unite with the Celestial Lords in perfection.\n\n---\n\n**The Nine Celestial Lords of the Northern Heavens**\nWe have heard that the Cavernous *yin* congealed its transformations, and the Northern Culmen assumed its honored place. Vast and boundless, the Great Loftiness governs the myriad heavens in their vastness; limpid and wondrous, the numinous nature disseminates the manifold kinds in their generation and completion. The Dao crowns the Three Clarities, and wisdom pervades the myriad beings.\n\nNow, the Emperor’s name towers above the ages, his virtue extends to the Four Barbarians. He perpetually upholds the merit of rectification and salvation, harmonizing with the fortune of ascending peace.\n\nIn strict observance of the ritual codes, he presents incense, flowers, lamps, candles, and all requisite offerings, reverently invoking the Nine Celestial Lords of the Northern Heavens, the Chronographic Star of Watery Virtue, the Dark Warrior of the Seven Mansions, and all stellar officials within and beyond.\n\nThrough these meritorious deeds, may they descend from the Nine Heavens of the Northern Prime, the Dark Palace of the Mysterious *yin*, and the Five Flying Mists, to come and assist the Emperor’s person. During the three months of winter, in the positions of *ren*, *gui*, *hai*, *zi*, and *chou*, should there be clashes with the native year or the primal *chen*, dimmed red stars, earthly nets and celestial snares, or any misfortunes and declines, may all be released and dispersed.\n\nMay he beseech the Jade Capital to turn its gaze and the Golden Portal to bestow its grace. In the Forest of Seven Treasures, may the tally of pine and cypress-like longevity increase; within the Palace of Five Brilliances, may the auspicious omens of simurghs and phoenixes descend. May the myriad transformations be pacified, and the palace chambers rejoice together. After attaining the Dao, may he unite with the Celestial Lords in perfection.\n\n---\n\n**The Nine Earthly Lords of the East**\nWe have heard that when the Great Clod divided its forms, the earthly realm established its ultimate bounds. The waves of the Four Seas surge boundlessly, their depths unfathomable; the boundaries of the Eight Extremities stretch endlessly, their vastness unsearchable.\n\nNow, the Emperor, in strict observance of the ritual codes, presents incense, flowers, lamps, candles, and all requisite offerings, reverently invoking the Nine Earthly Lords of the Eastern Lands, the Sovereigns of the Eastern Marchmount, mountains and rivers, hills and mounds, plains and marshes, streams and valleys, and all numinous beings. He repents and offers thanks for all transgressions from the founding of the state to the present day—whether in dwelling or movement, untimely digging or excavation, the opening of mountains and rivers, the expansion of foundations—disturbing the profound earth and offending the August Lords. He deeply fears that offenses have accumulated in the *kun* quarter, calamities have arisen in the celestial divisions, portents have not ceased, and illnesses have multiplied.\n\nNow, with wholehearted devotion, he turns toward the Great Dao, takes refuge in the Supreme Emperor, and entrusts his fate to the True Sovereign. He establishes the Three August Ones’ Precious Retreat, enacts the rites of the Cavernous Spirit, and prays for wind in harmony and rain in season, seas calm and rivers clear, yin and yang balanced that all transformations may be at peace, the Dao and virtue flourishing that the Great Stair may be serene. May the emperor’s essence be pure and his harmony complete, his years as enduring as metal and stone, his six viscera ever regulated, his hundred passages all unobstructed. May his entire court and kin constantly preserve good fortune and integrity, and all officials and people within and without long abide in felicity and blessing. After attaining the Dao, may he unite in truth with the August Lords.\n\n**Southern Quarter, Nine Lands**\nHe has heard that the resplendent sun establishes its image, the Nine Lands dwell in the south, the courtyard of flowing fire runs deep, and the celestial pool’s waves stretch wide. On the purple precincts of Xiaoqiu, the register of long life may be sought; in the crimson towers of Zhuling, the names of accumulated goodness are recorded. Now the emperor, in strict observance of the ritual codes, presents incense, flowers, lamps, candles, and all requisite offerings, reverently invoking the Nine Earthly Lords of the Southern Lands, the Sovereigns of the Southern Marchmount, mountains and rivers, hills and mounds, plains and marshes, streams and valleys, and all numinous beings. He repents and offers thanks for all transgressions from the founding of the state to the present day—whether in dwelling or movement, untimely digging or excavation, the opening of mountains and rivers, the expansion of foundations—disturbing the profound earth and offending the August Lords. He deeply fears that offenses have accumulated in the *kun* quarter, calamities have arisen in the celestial divisions, portents have not ceased, and illnesses have multiplied. Now, with wholehearted devotion, he turns toward the Great Dao, takes refuge in the Supreme Emperor, and entrusts his fate to the True Sovereign. He establishes the Precious Retreat, observing all ritual forms, and prays that yin and yang be harmonized, borders be tranquil and secure, unicorns and phoenixes manifest auspicious signs, and tortoises and dragons bring forth felicitous omens. May the emperor’s virtue match the mountains and peaks, his auspicious clouds broadly cover the Nine Dusts, his transformative influence pervade the realm, and his harmonious qi universally nourish the myriad things. May his entire court and kin constantly preserve good fortune and integrity, and all soldiers and people within and without together partake in felicity and blessing. After attaining the Dao, may he unite in truth with the August Lords.\n\n**Western Quarter, Nine Lands**\nHe has heard that the *kun* element initiates beginnings, the profound earth bears all things, high and low take form, east and west assume their positions, the autumn wind stirs and all things are made solemn, and yin virtue accomplishes its work. Auspicious omens flow from Phoenix Ridge, and transformations unfold from Tortoise Mountain. Now the emperor, in strict observance of the ritual codes, presents incense, flowers, lamps, candles, and all requisite offerings, reverently invoking the Nine Earthly Lords of the Western Lands, the Sovereigns of the Western Marchmount, mountains and rivers, hills and mounds, plains and marshes, streams and valleys, and all numinous beings. He repents and offers thanks for all transgressions from the founding of the state to the present day—whether in dwelling or movement, untimely digging or excavation, the opening of mountains and rivers, the expansion of foundations—disturbing the profound earth and offending the August Lords. He deeply fears that offenses have accumulated in the *kun* quarter, calamities have arisen in the celestial divisions, portents have not ceased, and illnesses have multiplied. Now, with wholehearted devotion, he turns toward the Great Dao, takes refuge in the Supreme Emperor, and entrusts his fate to the True Sovereign. He establishes the Precious Retreat, observing all ritual forms. He prostrates himself and prays that boundless compassion bring vast salvation, that radiant blessings descend from afar, that auspicious mists spread across ten thousand *li*, and that propitious qi emanate from the nine heavens. May wind be harmonious and rain timely, the year abundant and the seasons mild. May the emperor’s blessed destiny be prolonged, his spirit protected, his emoluments as boundless as the azure sea, and his years as enduring as Mount Song and Mount Hua. May his imperial sons and grandsons enjoy heaven’s eternity and earth’s permanence. After attaining the Dao, may he unite in truth with the August Lords.\n\n**Northern Quarter, Nine Lands**\nHe has heard that the north extends to the watery marshes, the depths of wind and earth, the first yang stirs and all things know spring, the four seasons complete their cycle and the yin grasses return to their places. Earth’s numbers end at thirty-six, and the realm’s boundaries extend three thousand *li*. Mountains rise to embrace Fengdu, and lands open to Kunlun’s expanse. Now the emperor, in strict observance of the ritual codes, presents incense, flowers, lamps, candles, and all requisite offerings, reverently invoking the Nine Earthly Lords of the Northern Lands, the Sovereigns of the Northern Marchmount, mountains and rivers, hills and mounds, plains and marshes, streams and valleys, and all numinous beings. He repents and offers thanks for all transgressions from the founding of the state to the present day—whether in dwelling or movement, untimely digging or excavation, the opening of mountains and rivers, the expansion of foundations—disturbing the profound earth and offending the August Lords. He deeply fears that offenses have accumulated in the *kun* quarter, calamities have arisen in the celestial divisions, portents have not ceased, and illnesses have multiplied. Now, with wholehearted devotion, he turns toward the Great Dao, takes refuge in the Supreme Emperor, and entrusts his fate to the True Sovereign. He initiates the establishment of the Precious Retreat, observing all ritual forms. He prays that the four seasons follow their proper order, all things be born whole, wind and clouds long accord with auspicious signs, and drought and flood never become disasters. May the emperor’s virtue match heaven and earth, his Dao unite with Fuxi and the Yellow Emperor. May his blessed court extend to the Eight Extremities, his realm of longevity ascend to the Seven Governors. May his house and state flourish, far and near be tranquil and secure. May all officials and people within and without together partake in felicity and blessing. After attaining the Dao, may he unite in truth with the August Lords.\n\n**Repentance to the Great Unity**\nHe has heard that the primordial qi of the Three Origins and the Great Unity, the August Spirit, divided the clear and turbid to establish the Two Modes, and moved yin and yang to generate the myriad things. His numinous perception universally turns, and his mysterious merit broadly spreads. Now the emperor, in strict observance of the ritual codes, presents incense, flowers, lamps, candles, and all requisite offerings, establishes the Precious Retreat of the Cavernous Spirit and the Three August Ones’ Seventy-Two Lords, and reverently invokes the Great Unity, August Lord, the Nine August Jade Emperors, the Perfected Saints of the Boundless Realm, and all numinous beings. He universally repents all transgressions of past and present lives, the faults of the six senses and three karmas, and prays that all be cleansed and eradicated. May the Eastern Florescence augment his endless years, and the Southern Culmen inscribe his name in the register of long life. May his merit tower over ten thousand ages, and his rank be listed among the heavens. May true qi descend upon his bodily palace, preserving grand harmony in the repository of his nature. May mountains and rivers be equally steadfast, metal and stone equally enduring, his realm tranquil and secure, his house and state blessed and prosperous. After attaining the Dao, may he long enjoy the natural.\n\nThe rites of repentance for the Cavernous Spirit and the Three August Ones’ Seventy-Two Lords’ Retreat are now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞神三皇七十二君斋方忏仪 经名：洞神三皇七十二君斋方忏仪。 唐末道士杜光庭编。 醮祭天地诸神齐仪。 一卷。 底本出处：《正统道藏》洞神部威仪类。 洞神三皇七十二君斋方忏仪 广成先生杜光庭删定 东方九天帝君 伏闻，一气凝空，九天垂象，启四时而东风出震，播五常而仁化行春，启运三光，权舆万有。 今皇帝顺天行化，用道匡时，德合阳和，明齐景曜，谨依科式，赍香花灯烛，供养之具，归命东方九天帝君、岁星木德苍龙七宿中外诸星官。 愿以是功德，降东上九天始阳碧城九气垂霞，来辅皇帝身。 於春季三月之中，甲乙寅卯辰位，有赤星暗曜，地网天罗，本命行年，元辰冲破，一切灾厄，咸乞荡除。 碧简题名，青宫益算，二仪交泰，七曜贞明，风雨以时，暄凉应序，家隆国泰，远肃迩安，内外士民，同沾善庆。 得道之后，与天帝合真。 南方九天帝君 伏闻，空洞凝华，丹天演化，运火德而炎精普照，播文明而礼教遐宣，高列九重，下临南极。 今皇帝禀庆自天，匡时降世，德兼神武，八方回向化之心，道契淳和，万国赖昭苏之泽。 谨依科式，赍香花灯烛，供养之具，归命南方九天帝君、荧惑火德朱鸟七宿中外诸星官。 以是功德，愿降南上九天朱光丹台三气悬光，来辅皇帝身。 於夏季三月之中，丙丁巳午未位，有地网天罗、赤星暗曜、恶宿冲破，本命行年，一切灾衰，咸蒙释散。 南宫注寿，丹简题名，永垂富国之功，更耀长生之籍，宫闱隆盛，遐迩宴安，庆袭山河，福沾军庶，得道之后，与天帝合真。 西方九天帝君 伏闻，清浊分形，阴阳定位，秋至而九天气肃，金行而四海风清，义定五常，功成万物。 今皇帝应运挺生，匡时播德，化洽而寰瀛向化，功高而天地同功，每仰玄科，以安邦国。 谨依科式，赍香花灯烛，供养之具，归命西方九天帝君、太白金精白虎七宿中外诸星官。 以是功德，愿降西上九天素华皓阙七气流光，来辅皇帝身。 於秋季三月之中，庚辛申酉戌位，有地网天罗、赤星暗曜、恶宿冲破，八卦九宫，一切灾衰咸蒙释散。 西方列圣，题名於七宝金门，高上众真，延寿於三清玉籍，八风调畅，五谷熟成，福被邦家，庆沾军庶。 得道之后，与天帝合真。 北方九天帝君 伏闻，洞阴凝化，北极居尊，渺渺大罗，统诸天而广大，澄澄妙性，播群品以生成。 道冠三清，智周万物。 今皇帝名高万古，德被四夷，长垂匡救之功，以协升平之运。 谨依科式，赍香花灯烛，供养之具，归命北方九天帝君、辰星水德玄武七宿中外诸星官。 以是功德，愿降北方九天玄阴苍玄宫五气飞烟，来辅皇帝身。 於冬季三月之中，壬癸亥子丑位，有本命行年，元辰冲破，赤星暗曜、地网天罗，一切灾衰，咸蒙释散。 乞玉京回鉴，金阙垂恩，七宝林中，益椿松之寿筹，五明宫内，降鸾凤之祯祥。 万化咸安，闱宫同庆。 得道之后，与天帝合真。 东方九地 伏闻，大块分形，方舆构极，四海之波澜，浩漫未测其深； 八弦之境界，渺茫难穷其大。 今皇帝谨依科式，赍香花灯烛，供养之具，归命东方九土皇君、东岳山川丘陵原阜江海溪谷一切众灵，忏谢建国已来至于今日，或兴居动土，掘凿不时，开拓山河，广崇基址，惊喧厚地，触犯皇君，切虑衅积坤维，灾生分野，祆徉未息，疾病互兴。",
      "translated_text": "**Liturgical Rites for the Fast of the Three Sovereigns and Seventy-Two Lords of the Cavernous Divine**\n\n*Title:* *Liturgical Rites for the Fast of the Three Sovereigns and Seventy-Two Lords of the Cavernous Divine*\nCompiled by the Tang-dynasty Daoist Du Guangting. A ritual of offering and invocation to the gods of Heaven and Earth. One fascicle.\n*Source text:* *Daoist Canon of the Zhengtong Era*, Cavernous Divine Section, *Weiyi* (Ritual Dignity) Category.\n\n**Liturgical Rites for the Fast of the Three Sovereigns and Seventy-Two Lords of the Cavernous Divine**\nRevised and edited by Master Guangcheng, Du Guangting\n\n---\n\n**The Nine Celestial Lords of the Eastern Heavens**\nWe have heard that when primordial *qi* congealed in the void, the Nine Heavens suspended their signs. They inaugurated the four seasons, and the eastern wind issued from *Zhen*; they disseminated the Five Constants, and the transformative power of *ren* advanced with spring. They initiated the triad of luminaries and presided over the inception of the myriad beings.\n\nNow, the Emperor, in accordance with Heaven’s transformative power and employing the Dao to rectify the times, aligns his virtue with the warmth of *yang* and his brilliance with the radiance of the sun and moon. In strict observance of the ritual codes, he presents incense, flowers, lamps, candles, and all requisite offerings, reverently invoking the Nine Celestial Lords of the Eastern Heavens, the Year Star of Wooden Virtue, the Azure Dragon of the Seven Mansions, and all stellar officials within and beyond.\n\nMay these meritorious deeds descend from the Nine Heavens of the Eastern Prime, the Jasper City of the Dawn *qi*, and the Nine Radiant Mists, to come and assist the Emperor’s person. During the three months of spring, in the positions of *jia*, *yi*, *yin*, *mao*, and *chen*, should there be dimmed red stars, earthly nets and celestial snares, clashes with the native year or the primal *chen*, or any misfortunes and calamities, may all be swept away.\n\nMay names be inscribed on the jade tablets of the Azure Palace, and years be added to the Emperor’s span. May the Two Modes harmonize, the Seven Luminaries shine with constancy, winds and rains arrive in season, warmth and coolness follow their proper order. May the house flourish and the state prosper, distant regions be pacified and near ones secure. May all officials and commoners, within and without, together partake in felicitous blessings. After attaining the Dao, may he unite with the Celestial Lords in perfection.\n\n---\n\n**The Nine Celestial Lords of the Southern Heavens**\nWe have heard that the Cavernous Void congealed its efflorescence, and the Cinnabar Heavens unfolded their transformations. They activated the Fire Virtue, and the radiance of *yang* suffused all; they disseminated civil brilliance, and the teachings of ritual spread afar. Lofty, they arrayed the Nine Layers; below, they oversaw the Southern Culmen.\n\nNow, the Emperor, endowed with felicity from Heaven, rectifies the times and descends into the world. His virtue encompasses divine martiality, and the hearts of the Eight Directions turn toward his transformative power. His Dao accords with pure harmony, and the myriad states rely on his revivifying grace.\n\nIn strict observance of the ritual codes, he presents incense, flowers, lamps, candles, and all requisite offerings, reverently invoking the Nine Celestial Lords of the Southern Heavens, the Sparkling Deluder of Fiery Virtue, the Vermilion Bird of the Seven Mansions, and all stellar officials within and beyond.\n\nThrough these meritorious deeds, may they descend from the Nine Heavens of the Southern Prime, the Vermilion Radiance of the Cinnabar Terrace, and the Three Suspended Lights, to come and assist the Emperor’s person. During the three months of summer, in the positions of *bing*, *ding*, *si*, *wu*, and *wei*, should there be earthly nets and celestial snares, dimmed red stars, inauspicious mansions clashing, the native year, or any misfortunes and declines, may all be released and dispersed.\n\nMay longevity be inscribed in the Southern Palace, names be recorded on the cinnabar tablets. May the merit of enriching the state endure forever, and the registers of long life shine anew. May the palace chambers flourish, distant and near regions feast in peace. May felicity inherit the mountains and rivers, and blessings suffuse the armies and the people. After attaining the Dao, may he unite with the Celestial Lords in perfection.\n\n---\n\n**The Nine Celestial Lords of the Western Heavens**\nWe have heard that when the pure and turbid separated their forms, *yin* and *yang* established their positions. When autumn arrived, the *qi* of the Nine Heavens grew solemn; when the Metal Phase advanced, the winds of the Four Seas turned clear. They settled the Five Constants in righteousness and perfected the myriad beings in their functions.\n\nNow, the Emperor, responding to the mandate and emerging in his time, rectifies the era and disseminates his virtue. His transformative power harmonizes, and the seas and lands turn toward his influence; his achievements are lofty, and Heaven and Earth share in his merit. Ever revering the mysterious codes, he secures the state and the realm.\n\nIn strict observance of the ritual codes, he presents incense, flowers, lamps, candles, and all requisite offerings, reverently invoking the Nine Celestial Lords of the Western Heavens, the Grand White of Metallic Essence, the White Tiger of the Seven Mansions, and all stellar officials within and beyond.\n\nThrough these meritorious deeds, may they descend from the Nine Heavens of the Western Prime, the Luminous Pavilion of Pristine Efflorescence, and the Seven Flowing Lights, to come and assist the Emperor’s person. During the three months of autumn, in the positions of *geng*, *xin*, *shen*, *you*, and *xu*, should there be earthly nets and celestial snares, dimmed red stars, inauspicious mansions clashing, the Eight Trigrams and Nine Palaces, or any misfortunes and declines, may all be released and dispersed.\n\nMay the Sages of the West inscribe his name upon the Seven-Treasure Golden Gate, and the Lofty Perfected of the Highest extend his years in the Jade Registers of the Three Clarities. May the Eight Winds harmonize, the Five Grains ripen in abundance. May blessings cover the state and felicity suffuse the armies and the people. After attaining the Dao, may he unite with the Celestial Lords in perfection.\n\n---\n\n**The Nine Celestial Lords of the Northern Heavens**\nWe have heard that the Cavernous *yin* congealed its transformations, and the Northern Culmen assumed its honored place. Vast and boundless, the Great Loftiness governs the myriad heavens in their vastness; limpid and wondrous, the numinous nature disseminates the manifold kinds in their generation and completion. The Dao crowns the Three Clarities, and wisdom pervades the myriad beings.\n\nNow, the Emperor’s name towers above the ages, his virtue extends to the Four Barbarians. He perpetually upholds the merit of rectification and salvation, harmonizing with the fortune of ascending peace.\n\nIn strict observance of the ritual codes, he presents incense, flowers, lamps, candles, and all requisite offerings, reverently invoking the Nine Celestial Lords of the Northern Heavens, the Chronographic Star of Watery Virtue, the Dark Warrior of the Seven Mansions, and all stellar officials within and beyond.\n\nThrough these meritorious deeds, may they descend from the Nine Heavens of the Northern Prime, the Dark Palace of the Mysterious *yin*, and the Five Flying Mists, to come and assist the Emperor’s person. During the three months of winter, in the positions of *ren*, *gui*, *hai*, *zi*, and *chou*, should there be clashes with the native year or the primal *chen*, dimmed red stars, earthly nets and celestial snares, or any misfortunes and declines, may all be released and dispersed.\n\nMay he beseech the Jade Capital to turn its gaze and the Golden Portal to bestow its grace. In the Forest of Seven Treasures, may the tally of pine and cypress-like longevity increase; within the Palace of Five Brilliances, may the auspicious omens of simurghs and phoenixes descend. May the myriad transformations be pacified, and the palace chambers rejoice together. After attaining the Dao, may he unite with the Celestial Lords in perfection.\n\n---\n\n**The Nine Earthly Lords of the East**\nWe have heard that when the Great Clod divided its forms, the earthly realm established its ultimate bounds. The waves of the Four Seas surge boundlessly, their depths unfathomable; the boundaries of the Eight Extremities stretch endlessly, their vastness unsearchable.\n\nNow, the Emperor, in strict observance of the ritual codes, presents incense, flowers, lamps, candles, and all requisite offerings, reverently invoking the Nine Earthly Lords of the Eastern Lands, the Sovereigns of the Eastern Marchmount, mountains and rivers, hills and mounds, plains and marshes, streams and valleys, and all numinous beings. He repents and offers thanks for all transgressions from the founding of the state to the present day—whether in dwelling or movement, untimely digging or excavation, the opening of mountains and rivers, the expansion of foundations—disturbing the profound earth and offending the August Lords. He deeply fears that offenses have accumulated in the *kun* quarter, calamities have arisen in the celestial divisions, portents have not ceased, and illnesses have multiplied.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1272,
      "start_sentence": 0,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.60775589942932,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\洞神三皇七十二君斋方忏仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "今以一心回向大道，归依上帝，委命真皇，建三皇宝斋，演洞神仪式，乞使风调雨顺，海晏河清，阴阳和而万化安，道德兴而太阶静。 皇帝淳和备体，金石齐年，六腑常调，百关咸畅。 阖官眷属，常保利贞，内外士民，长居善庆。 得道之后，与皇君合真。 南方九地 伏闻，重离设象，九地居南，流火庭深，天池浪阔。 萧丘紫府，长生之籍可求，绛阙朱陵，积善之名斯在。 今皇帝谨依科式，赍香花灯烛，供养之具，归命南方九土皇君、南岳山川丘陵原阜江海溪谷一切灵官，忏谢建国已来，至于今日，或兴居动土，掘凿不时，开拓山河，广崇基址，惊喧厚地，触犯皇君，切虑衅积坤维，灾生分野，祆□未息，疾病互兴。 今以一心回向大道，归依上帝，委命真皇，建立宝斋，备依仪式，乞使阴阳调理，疆境晏安，麟凤呈祥，龟龙协瑞。 皇帝德符山岳，庆云广覆於九埃，化洽寰区，和气徧资於万物。 阖宫眷属，咸保利贞，内外军民，同沾善庆。 得道之后，与皇君合真。 西方九地 伏闻，坤元资始，厚载权舆，高下分形，东西列位，振秋风而肃物，运阴德以成功。 凤岭流祥，龟山演化。 今皇帝谨依科式，赍香花灯烛，供养之具，归命西方九土皇君、西岳山川丘陵原阜江海溪谷一切灵官，忏谢建国已来至于今日，或兴居动土，掘凿不时，开拓山河，广崇基址，惊喧厚地，触犯皇君，切虑衅积坤维，灾生分野，祆□未息，疾病互兴。 今以一心回向大道，归依上帝，委命真皇，建立宝斋，备依仪式。 伏愿大慈广济，景福遐临，布万里之祥烟，发九重之瑞气，风调雨顺，岁稔时和。 皇帝庆祚延长，神明保护，浩浩而沧溟比禄，峨峨而嵩华齐年。 皇子王孙，天长地久。 得道之后，与皇君合真。 北方九地 伏闻，北穷水泽，下极风输，一阳生而万物知春，四气匝而草阴复位，地数终於四九，国界列於三千。 山耸罗酆，境开昆板。 今皇帝谨依科式，赍香花灯烛，供养之具，归命北方九土皇君、北岳山川丘陵原阜江海溪谷一切灵官，忏谢建国已来至于今日，兴居动土，掘凿不时，开拓山河，广崇基址，惊喧厚地，触犯皇君，切虑衅积坤维，灾生分野，祆□未息，疾病互兴。 今以一心回向大道，归依上帝，委命真皇，启建宝斋，备依仪式。 乞使四时应序，万物生全，风云长契於祯祥，水旱不为其灾沙。 皇帝德符天地，道契羲黄。 福庭下际於八纮，寿域上参於七政。 家国隆盛，遐迩晏安。 内外士民，同沾善庆。 得道之后，与皇君合真。 北谢太一 伏闻，三元祖气、太一尊神，剖清浊以立二仪，运阴阳而生万物。 普回灵鉴，广布玄功。 今皇帝谨依科式，赍香花灯烛，供养之具，修建洞神三皇七十二君宝斋，归命太一元君、九皇玉帝、无极境界已得道大圣众，一切神明，普忏前世今生，六情三业，故误之罪，咸乞荡除。 东华增无尽之年，南极注长生之籍。 功高万古，位列诸天。 降真气於身宫，保太和於性府。 山河并固，金石同坚，境域晏安，家邦庆泰。 得道之后，长享自然。 洞神三皇七十二君斋方忏仪竟",
      "translated_text": "Now, with wholehearted devotion, he turns toward the Great Dao, takes refuge in the Supreme Emperor, and entrusts his fate to the True Sovereign. He establishes the Three August Ones’ Precious Retreat, enacts the rites of the Cavernous Spirit, and prays for wind in harmony and rain in season, seas calm and rivers clear, yin and yang balanced that all transformations may be at peace, the Dao and virtue flourishing that the Great Stair may be serene. May the emperor’s essence be pure and his harmony complete, his years as enduring as metal and stone, his six viscera ever regulated, his hundred passages all unobstructed. May his entire court and kin constantly preserve good fortune and integrity, and all officials and people within and without long abide in felicity and blessing. After attaining the Dao, may he unite in truth with the August Lords.\n\n**Southern Quarter, Nine Lands**\nHe has heard that the resplendent sun establishes its image, the Nine Lands dwell in the south, the courtyard of flowing fire runs deep, and the celestial pool’s waves stretch wide. On the purple precincts of Xiaoqiu, the register of long life may be sought; in the crimson towers of Zhuling, the names of accumulated goodness are recorded. Now the emperor, in strict observance of the ritual codes, presents incense, flowers, lamps, candles, and all requisite offerings, reverently invoking the Nine Earthly Lords of the Southern Lands, the Sovereigns of the Southern Marchmount, mountains and rivers, hills and mounds, plains and marshes, streams and valleys, and all numinous beings. He repents and offers thanks for all transgressions from the founding of the state to the present day—whether in dwelling or movement, untimely digging or excavation, the opening of mountains and rivers, the expansion of foundations—disturbing the profound earth and offending the August Lords. He deeply fears that offenses have accumulated in the *kun* quarter, calamities have arisen in the celestial divisions, portents have not ceased, and illnesses have multiplied. Now, with wholehearted devotion, he turns toward the Great Dao, takes refuge in the Supreme Emperor, and entrusts his fate to the True Sovereign. He establishes the Precious Retreat, observing all ritual forms, and prays that yin and yang be harmonized, borders be tranquil and secure, unicorns and phoenixes manifest auspicious signs, and tortoises and dragons bring forth felicitous omens. May the emperor’s virtue match the mountains and peaks, his auspicious clouds broadly cover the Nine Dusts, his transformative influence pervade the realm, and his harmonious qi universally nourish the myriad things. May his entire court and kin constantly preserve good fortune and integrity, and all soldiers and people within and without together partake in felicity and blessing. After attaining the Dao, may he unite in truth with the August Lords.\n\n**Western Quarter, Nine Lands**\nHe has heard that the *kun* element initiates beginnings, the profound earth bears all things, high and low take form, east and west assume their positions, the autumn wind stirs and all things are made solemn, and yin virtue accomplishes its work. Auspicious omens flow from Phoenix Ridge, and transformations unfold from Tortoise Mountain. Now the emperor, in strict observance of the ritual codes, presents incense, flowers, lamps, candles, and all requisite offerings, reverently invoking the Nine Earthly Lords of the Western Lands, the Sovereigns of the Western Marchmount, mountains and rivers, hills and mounds, plains and marshes, streams and valleys, and all numinous beings. He repents and offers thanks for all transgressions from the founding of the state to the present day—whether in dwelling or movement, untimely digging or excavation, the opening of mountains and rivers, the expansion of foundations—disturbing the profound earth and offending the August Lords. He deeply fears that offenses have accumulated in the *kun* quarter, calamities have arisen in the celestial divisions, portents have not ceased, and illnesses have multiplied. Now, with wholehearted devotion, he turns toward the Great Dao, takes refuge in the Supreme Emperor, and entrusts his fate to the True Sovereign. He establishes the Precious Retreat, observing all ritual forms. He prostrates himself and prays that boundless compassion bring vast salvation, that radiant blessings descend from afar, that auspicious mists spread across ten thousand *li*, and that propitious qi emanate from the nine heavens. May wind be harmonious and rain timely, the year abundant and the seasons mild. May the emperor’s blessed destiny be prolonged, his spirit protected, his emoluments as boundless as the azure sea, and his years as enduring as Mount Song and Mount Hua. May his imperial sons and grandsons enjoy heaven’s eternity and earth’s permanence. After attaining the Dao, may he unite in truth with the August Lords.\n\n**Northern Quarter, Nine Lands**\nHe has heard that the north extends to the watery marshes, the depths of wind and earth, the first yang stirs and all things know spring, the four seasons complete their cycle and the yin grasses return to their places. Earth’s numbers end at thirty-six, and the realm’s boundaries extend three thousand *li*. Mountains rise to embrace Fengdu, and lands open to Kunlun’s expanse. Now the emperor, in strict observance of the ritual codes, presents incense, flowers, lamps, candles, and all requisite offerings, reverently invoking the Nine Earthly Lords of the Northern Lands, the Sovereigns of the Northern Marchmount, mountains and rivers, hills and mounds, plains and marshes, streams and valleys, and all numinous beings. He repents and offers thanks for all transgressions from the founding of the state to the present day—whether in dwelling or movement, untimely digging or excavation, the opening of mountains and rivers, the expansion of foundations—disturbing the profound earth and offending the August Lords. He deeply fears that offenses have accumulated in the *kun* quarter, calamities have arisen in the celestial divisions, portents have not ceased, and illnesses have multiplied. Now, with wholehearted devotion, he turns toward the Great Dao, takes refuge in the Supreme Emperor, and entrusts his fate to the True Sovereign. He initiates the establishment of the Precious Retreat, observing all ritual forms. He prays that the four seasons follow their proper order, all things be born whole, wind and clouds long accord with auspicious signs, and drought and flood never become disasters. May the emperor’s virtue match heaven and earth, his Dao unite with Fuxi and the Yellow Emperor. May his blessed court extend to the Eight Extremities, his realm of longevity ascend to the Seven Governors. May his house and state flourish, far and near be tranquil and secure. May all officials and people within and without together partake in felicity and blessing. After attaining the Dao, may he unite in truth with the August Lords.\n\n**Repentance to the Great Unity**\nHe has heard that the primordial qi of the Three Origins and the Great Unity, the August Spirit, divided the clear and turbid to establish the Two Modes, and moved yin and yang to generate the myriad things. His numinous perception universally turns, and his mysterious merit broadly spreads. Now the emperor, in strict observance of the ritual codes, presents incense, flowers, lamps, candles, and all requisite offerings, establishes the Precious Retreat of the Cavernous Spirit and the Three August Ones’ Seventy-Two Lords, and reverently invokes the Great Unity, August Lord, the Nine August Jade Emperors, the Perfected Saints of the Boundless Realm, and all numinous beings. He universally repents all transgressions of past and present lives, the faults of the six senses and three karmas, and prays that all be cleansed and eradicated. May the Eastern Florescence augment his endless years, and the Southern Culmen inscribe his name in the register of long life. May his merit tower over ten thousand ages, and his rank be listed among the heavens. May true qi descend upon his bodily palace, preserving grand harmony in the repository of his nature. May mountains and rivers be equally steadfast, metal and stone equally enduring, his realm tranquil and secure, his house and state blessed and prosperous. After attaining the Dao, may he long enjoy the natural.\n\nThe rites of repentance for the Cavernous Spirit and the Three August Ones’ Seventy-Two Lords’ Retreat are now complete.",
      "overlap_context": "ys, and all numinous beings. He repents and offers thanks for all transgressions from the founding of the state to the present day—whether in dwelling or movement, untimely digging or excavation, the opening of mountains and rivers, the expansion of foundations—disturbing the profound earth and offending the August Lords. He deeply fears that offenses have accumulated in the *kun* quarter, calamities have arisen in the celestial divisions, portents have not ceased, and illnesses have multiplied.",
      "start_char": 1272,
      "end_char": 2448,
      "start_sentence": 44,
      "end_sentence": 85,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.58777475357056,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\洞神三皇七十二君斋方忏仪.txt",
        "category": "威仪类"
      }
    }
  ]
}