{
  "source_id": "洞真金房度命绿字回年三华宝曤内真上经",
  "source_file": "chunked_daozang\\洞真金房度命绿字回年三华宝曤内真上经.json",
  "total_chunks": 4,
  "total_original_chars": 3986,
  "total_translated_chars": 27015,
  "total_translation_time": 142.6607003211975,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞真金房度命绿字回年三华宝曤内真上经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "*The Cavern of Perfection: The Golden Chamber Scripture for Delivering Life, the Green-Writ Scripture of Rejuvenation, and the Three-Flowered Treasure Radiance’s Inner Perfection Upper Scripture*\n\nScripture Title: *The Cavern of Perfection: The Golden Chamber Scripture for Delivering Life, the Green-Writ Scripture of Rejuvenation, and the Three-Flowered Treasure Radiance’s Inner Perfection Upper Scripture*. Abbreviated as *The Golden Chamber Scripture for Delivering Life*.\n\nThe compiler is unknown, approximately dating to the Northern and Southern Dynasties. It is pseudepigraphically attributed to the transmission of the Celestial Worthy of the Primordial Beginning, expounding methods for reciting scriptures, preserving the spirits, and delivering life. Comprising one scroll.\n\nSource of the base text: *Daoist Canon of the Orthodox Tradition*, First Section.\n\n---\n\n*The Cavern of Perfection: The Golden Chamber Scripture for Delivering Life, the Green-Writ Scripture of Rejuvenation, and the Three-Flowered Treasure Radiance’s Inner Perfection Upper Scripture*\n\nOn the seventh day of the seventh month in the ren-wu year of the first reign of the August Emperor, at the mid-hour, the Supreme Perfected Warden of the Southern Culmen, Keeper of the Registers, prostrated himself before the Jade Pavilion and inquired of the Celestial Worthy of the Primordial Beginning, the Jade Emperor:\n\n\"Though I am unworthy, I am a scion of the imperial lineage, my life endowed with stellar roots. Through nine transformations, I have gestated in the nectar of jade, my three cinnabar spirits flourishing in radiant splendor. At the auspicious dawn, I inherited the imperial mantle, aspiring to the Nine Mysteries. I have studied the numinous canons, contemplated the true, and invoked the spirits. I have maintained a perpetual fast within the jade precincts, never faltering, and through kalpas of discipline, my name has been inscribed in the imperial registers. I have ascended to the office of Supreme Controller, overseeing the myriad immortals—yet I have not received the method for delivering life.\n\nThe revolutions of fate advance, and time does not abide. I humbly beseech the gift of a precious formula to deliver later worthies.\"\n\nThereupon, the Lord of the Dao, the Celestial Worthy, addressed the Supreme Perfected Warden of the Southern Culmen:\n\n\"The formula for delivering life through the Golden Chamber and reversing the years is concealed within the Palace of Great Existence above the Nine Heavens, in the Golden Terrace and Jade Chamber of the Nine-Bend Chamber, where three thousand jade maidens attend to the sacred texts. This Dao is profound and subtle, not to be fathomed by median perfected beings. By ancient statute, it is transmitted but once in ten thousand kalpas.\"\n\nThose who practice this method shall share the same root as the ninefold *qi*, their radiance equaling the Three Luminaries, and their existence enduring as long as Heaven and Earth.\n\nAfter one recitation, the stomach and viscera shall be permeated with vital fluids; after ten, clarity shall dawn, and speech with spirits shall become possible; after a hundred, the immortal embryo shall form within; after a thousand, one shall ascend through the void; after ten thousand, the Dao shall be perfected, the rank of Immortal Minister attained, and one shall ride the mist and mount the void to ascend before the August Emperor.\n\nNow I impart this to you—practice it with utmost care.\n\nThereupon, the Five Elders of the Immortal Capital in the Southern Palace commanded Sima Dingsian, the Perfected Warden of the Upper Realms, to transmit the *Upper Scripture of the Golden Chamber’s Life-Delivering, Green-Writ, Year-Reversing Threefold Radiance of Inner Perfection* under sacred covenant to you. The oath was sworn before the Heaven of Immeasurable Life.\n\nIn the first year of the Central August Era, this transmission passed to the Upper Primordial Lord of the Southern Culmen, the Venerable Master of the Myriad Beginnings, the Yellow Youth Perfected, the Golden Flower Immortal, the Jade Maiden of Supreme Harmony, the Three Primordial Lords of Grand Simplicity, the Golden Portal Emperor Lord, and the Upper Minister Azure Youth Lord. Now, one copy is sealed within Mount Emei. Only those who possess the imperial charts of the Mysterious Plan, the green-writ scriptures of the Upper Clarity, and the golden bones and jade viscera of immortality shall receive this text.\n\nYet as the Three Dao revolve and the Nine Yang respond in due time, those of the original Primordial August lineage who practice the true Dao, and whose names are already inscribed in the registers of immortality, shall rightfully obtain this scripture. Those who receive it must treasure and conceal it—beware of reckless disclosure.\n\nWithin the Divine Capital Palace, twenty-four myriad Upper Perfected Immortals have cast golden tablets, inscribed with silver-bound characters in purple ink. In unison, they recite this scripture, their jade-like voices resounding through the Nine Heavens, communicating with spirits and invoking numinous power, reversing the blossoms of age and restoring youth. Their ritual processions and chanted praises surpass all other mysteries of the Cavern Realms. Thus they deliver life, sharing the same root as Heaven and Earth. Those who attain this Dao shall ascend to become Upper Immortals.\n\nThis scripture is the jade composition of the Most High, the numinous text of the Supreme Emperor. It distributes itself within a single form, governing the hundred passages of the body. After one recitation, its profound principles shall naturally become clear; after ten, one’s countenance shall revert to youth; after a hundred, the immortal embryo shall form within; after a thousand, one shall sit in the midst of disappearance; after ten thousand, the Dao shall be perfected, and one shall ascend to the morning light in broad daylight.\n\nThose who maintain long-term purity in seclusion, untouched by worldly dust, shall find the Dao descending without fail—ascension to immortality shall be but a matter of days. For those of sincere devotion who cannot yet withdraw from the world, let them dwell among others while maintaining a separate chamber, observing purity, burning incense, and performing morning and evening rites. By reciting this sacred text, they may avert disasters, repel myriad afflictions, dissolve misfortunes in the Upper Palace, and eradicate sins in the Nine Yin. After ten thousand recitations, their accumulated merit shall carry them to the Cloud Chambers.\n\nIn practicing the method of life-deliverance, one should choose the day of one’s natal destiny, the day of the Grand Year Star, an *jiazi* day, or one of the eight solar terms. Entering the chamber and facing east, ingest *qi* nine times, visualizing the Great Emperor Lord, then bow twice. Turn to the south, ingest *qi* nine times, visualizing the Upper Perfected Lord of the Southern Culmen, then bow twice. Turn to the west, ingest *qi* nine times, visualizing the Lord of Longevity of the Three Heavens, then bow twice. Turn to the north, ingest *qi* nine times, visualizing the Most High Lord of the Void, then bow twice. Alternatively, one may face east throughout, bowing in the heart toward the four directions while ingesting *qi*.\n\nUpon completion, face the direction of one’s natal destiny, click the teeth thirty-six times, and swallow *qi* thirty-six times. Then face the Grand Year Star, draw *qi* twenty-four times, and conclude by facing north to recite the scripture. Ten recitations constitute one cycle; upon finishing, ingest one *Golden Chamber Life-Preserving Talisman* per cycle, matching the number of recitations. This practice shall communicate with spirits and attain perfection, allowing one to perceive the eight directions while seated, regulate the hundred passages, and gather the myriad *qi*—thus achieving longevity, matching the lifespan of Heaven and Earth, and sharing the same age as the Three Luminaries.\n\nAfter facing north and holding the scripture, click the teeth thirty-six times, visualizing five-colored purple clouds filling the chamber, shrouding it in mist. Silently intone the incantation:\n\n*\"Mysterious, mysterious, ninefold qi,*\n*the supreme Dao gives birth to the Upper Primordial.*\n*Three wheels empty as jade,*\n*five revolutions deliver life as clouds.*\n*Reversing the years within the Nine Imperials,*\n*ten thousand recitations divide the Dao.*\n*How vast and desolate the Great Desert—*\n*solely meditate on the Emperor Unity Lord.*\n*Within the Golden Chamber they merge,*\n*embryonic breathing stills the hundred passages.\"*\n\nThen begin reciting the scripture.\n\n---\n\n**Upper Scripture of the Golden Chamber’s Life-Delivering, Green-Writ, Year-Reversing Threefold Radiance of Inner Perfection**\n\nWithin the Golden Chamber dwells a Perfected One,\ntransformed in the Jade Kingdom, born in the Treasure Neighborhood.\nPurple clouds swirl and coil through the Nine Mysteries,\nforming a jade terrace, its body naturally perfected.\nJade towers and golden portals stand on either side,\nflowing rosy clouds and cinnabar skies shelter the numinous Perfected.\nVerdant radiance vast and bright illumines the central field—\nabove, the towering Nine Heavens,\nbelow, the ten-thousand-fathom abyss of hidden springs.\nJoining at the Cavern Gate, they create the root of clouds.\nJade maidens and immortal youths, three thousand each,\nhold towels and offer incense, wafting purple smoke.\nThousands upon thousands, hundreds upon hundreds—all are host to immortals,\nadorned in ritual vestments, reciting the sacred text.\nRevolving through the Golden Chamber to reverse the years,\nthe Threefold Radiance shines with luminous clarity.\nTen recitations complete one cycle to ascend to the Upper Primordial—\nswallowing the numinous talismans, the practice is complete.\n\nIn tranquil contemplation, regulate the five viscera and the hundred passages,\nfor within each passage dwells a spirit.\nThe Minor Lad of the Grand Tenuity faces the Emperor Perfected,\nsecuring the tongue’s root and connecting the source of fluids.\nThe Grand Unity’s *Wu You* recites essential words,\nfilling the Jade Pillow and descending to the Muddy Pellet.\nThe Emperor Lord’s *Lingyang* and *Fanming* banners\nhover between the eyebrows, centered and divided.\nThe Lord of Primordial Brilliance, *Yuan Ying*, solidifies the numinous immortals,\ntransforming and emerging from the left armpit, the liver’s posterior gate.\nThe flourishing yang of *Dongyang* and the numinous *Baiyuan*\nfill the right armpit, precisely aligned with the four officials.\nThe Central Controller, the Elder Lord of Destiny,\nrecords the beginning of clarity to deliver the body’s destiny.\nPreserving and refining the Crimson Palace, ever abiding therein,\nthe Peach Lord *Daokang* harmonizes essence and extends life.\nEqualizing the lower palace chambers, filling the root of the numinous,\nthe Heavenly Emperor’s Red Child, foremost of the Three Primordials,\nresides within the Muddy Pellet, before the nine apertures.\nThe Cinnabar Emperor moves the pearl, spirit of the Crimson Palace,\nfilling the great hammer beside the neck.\nThe Primordial King *Shiming*, originally natural,\nfills the four boundaries and connects with the mouth.\nEight Perfected Ones unite their radiance, partaking in the Nine Mysteries,\nfilling the spine of the back, gathering in the central field.\nSeven Perfected Ones of Mysterious Yang deliver the years of life,\nfilling the Jade Pass beside the right kidney.\nCommunicating with spirits and delivering life, the hundred fluids flow—\nsix Perfected Ones of the Upper Primordial connect with purple smoke,\nfilling the head’s exterior and interior.\nFive Perfected Ones nurture radiance through the Three Primordials,\nfilling the throat, grasping the wondrous text.\nFour Perfected Ones of Azure Clarity reverse youthful countenance,\nfilling the stomach duct, delighting the myriad spirits.\nThree Perfected Ones of Yellow Tranquility, their color like cinnabar,\nfill the two nostrils, connecting the hidden passages.\nTwo Perfected Ones of Firm Jade, their *qi* fragrant as orchids,\nfill the Great Granary without difficulty.\nOne Perfected of Heavenly Spirit, serene and tranquil,\nfills the chest, governing the life-officials.\nAll clad in brocade robes and flying azure skirts,\nthey deliver life for you, sealing the gate of death.\nCarefully visualize and recite the sacred text—\nten readings complete one cycle, and the principles shall become clear.\nNot only shall you attain longevity and ascend to the Nine Mysteries.\n\nThe Nine-Nine Perfected Ones, by their secret names, restrain and govern,\nfilling the left ear—spirit sharp and wise,\nstealing into the boundless ten thousand *li*,\npalace abodes lush with the Emperor of Immortals’ throne.\nThey teach you to deliver life, matching talismanic accord.\n\nThe Hun-soul of the August One, by its secret name *Shang Gui*,\nfills the right ear, mastering the myriad affairs,\ndistinguishing sounds and cries in the deepest subtleties.\nThree unite as one, their radiance gleaming bright.\n\nThe Purple-Silk Primordial Lady, by her secret name *Yi Yu*,\nfills your head and face, light bursting forth.\nBreathing in the Five Mornings, swallowing sun and moon,\nspirit mushrooms overflow—no hunger, no thirst.\n\nThe Yellow-Silk Primordial Lady, by her secret name *Yuan Hua*,\nfills chest and abdomen, weaving cloudy nets,\ncommanding the Northern Emperor to inspect celestial demons,\nupholding true refinement for the Void Sovereign’s house.\n\nThe White-Silk Primordial Lady, by her secret name *Qi Ming*,\nfills the lower gate, securing the Great Spirit,\nascending through the nine apertures, fresh and luminous,\nrestraining hun and po, ensuring perpetual life.\n\nThe Life-Officer of the Sun’s Center, by his secret name *Jie Sheng*,\nfills your left hand—the Four Great Illuminations,\nFive Flowers preserving truth, arrayed in cloudy encampments.\nDrawing in sun and moon, swallowing primordial essence,\ndelivering life, reversing years to the limits of heaven’s span.\n\nThe Peach Lord of the Moon, by his secret name *Fang Ying*,\nfills your right hand, wielding the Dipper’s stars,\ngrasping the mysterious net, governing the Five Spirits.\n\nThe *Li Du Si Qi*, by his secret name *Tian Ting*,\ncircles thrice, penetrating clarity and brightness.\n\nThe Lad of the Left Eye, by his secret name *Fei Ling*,\nfills your left eye—yang’s radiance,\nilluminating the primordial aperture to behold Jade Clarity,\nresplendent as celestial might, streaming like meteors.\n\nThe Lad of the Right Eye, by his secret name *Chen Ying*,\nfills your right eye—yin’s inner essence,\ngazing through Heaven’s Gate to oversee the Imperial Court,\nvast as the Three Mornings riding the turning wheel.\n\nThe Lad of the Lung, by his secret name *Su Ming*,\nfills the lung’s chamber, purifying within and without,\nentrusting wandering hun and scattered po to Yellow Tranquility,\ninspecting the Imperial Chamber without flaw or excess.\n\nThe First Primordial of the Womb, the Mysterious Child,\nthe Supreme One’s essence-soul, the *Xuan Gui* Child,\nfills the five viscera, binding the throat’s interior,\npreserving spirit, securing *qi*, ensuring deathlessness.\n\nThe *Qi*-Binding Lord of the Central Node, *An Yan Chang*,\nthe Lordless essence-soul, guardian of the Grain Lad,\nfills the five viscera and the Great Granary,\nreceiving essences and fluids, along with the Infant’s Vigor.\nVermilion blossoms and jade mushrooms naturally abound.\n\nThe Black *Qi* of the Nodes, born of *Bin Lai*,\nthe Emperor’s true essence-soul, by his secret name *You Tai*,\nfills the nine intestines, governing the four directions.\nMastering this truth grants boundless longevity.\n\nThe Yellow *Qi* of the Womb, *Zu Ming Che*,\nshares governance with the Emperor, dwelling in the same chamber.\nEssence-souls manage the hidden scriptures—\nwhy not contemplate the Mysterious Void alone?\nTen thousand recitations suffice to ascend the cloud chariot.\n\nThe Red *Qi* of the Blood, *Hun Li Zi*,\nthe Life-Officer’s essence-soul, *Fa Niu Zi*,\ntwo spirits together fill the hundred passages,\nharmonizing *qi* and fluids to protect the formed body.\nMastering this Dao ensures deathlessness—\nlongevity of ten thousand years only then begins.\n\nThe Primordial Father of the Upper Origin, *Gao Tong Sheng*,\nthe Mysterious Mother of the Lower Mystery, *Shu Huo Wang*,\nfill the Bright Hall below the bladder,\nthe Supreme One’s profound obscurity steering the mysterious net.\nThe Emperor, honored and true, perfectly matched—\n\nThe Great Emperor’s essence-soul, by his secret name *Yang Tai*,\neight voids revolve in the Dao, winging luminous light.\nThe Imperial Soul, without partiality, shares one chamber,\ntogether filling the Great Obscure Palace of your destiny.\nSeven spirits unite in accord, turning the Bright Beam—\nreversing years, delivering life without end.\n\nThe Three-Silk Elders, by their secret name *Lao Zhang*,\nrefine and transform the Eight Paths, delivering the great realm.\n\nThe Left Immortal, *Zhong Cheng*, governs the center,\nthe Right Immortal, *Qu Wen*, stands beside him.\nThree spirits unite in the human midst—\n\nThe Mysterious One, Lord Lao, *Lin Xu Ling*,\nthe Mysterious Gate, whispering and cool.\nThe Black Emperor guards and completes, filling the bladder,\nthe White Emperor arrives in peace, dwelling in the scrotum,\nthe Red Emperor awakens in the mouth’s square,\nthe Green Emperor carves the beams of the Five Viscera’s palace.\nFive Emperors, Two Elders, and the Two Immortal Kings\nguard and attend your body, ascending the cloudy net.\n\nThe Imperial Minister of the Upper Origin, *Zhao Qin Jing*,\nthe Crimson Palace’s central spirit, *Zhong Guang Jian*,\nthe lower court’s spirit ascends to *Shang Ming*.\nThe Three-One Perfected Lords guard your form,\neach filling one palace with their essence-*qi*.\nCarefully visualize them to attain longevity—\nnot only deathlessness, but ascension to Jade Clarity.\n\nThe First Emperor’s Lord, Father *Ning Zai*,\nMother Essence, two spirits awaiting your destiny,\nfill the dead gates within your form,\narrayed above and below, mutually serving.\nNever leaving the palace halls, they remain ever-present—\nrecite constantly to behold the Red Child.\n\nMyriad *qi* blend and merge, forming true beings,\neach division of heavenly soldiers fills your body.\nCarefully visualize and discern—\nwith long fasting and accumulated devotion, you shall see the Perfected.\nThey bestow upon you the *Gold Chamber’s* *Returning Years* scripture,\nyour name inscribed in the Emperor’s register, destined for immortality,\nall through diligent devotion, not by nature alone.\nTen recitations complete one cycle, and the myriad spirits rejoice.\nWithin three years, the Dao shall appear before you—\nthe Purple Chamber’s form shall speak with you,\ndescending in green chariots and flying cloud pavilions,\nroaming and feasting on the Five Peaks, visiting the Imperial Dawn.\nAscend to pay homage before the Jade Emperor of the Great Void,\nbowing in reverence, receiving further immortality.\n\nUpon completing the recitation, visualize within the chamber the spontaneous arising of purple *qi*,\nbillowing and surging, entering your body\nthrough nose, mouth, and both ears,\nuntil you feel a gentle warmth in your form.\nDraw thirty-nine breaths, then softly intone the incantation:\n\n*Myriad qi blend to form the spirit’s abode,*\n*each filling the palaces with pure and void qi.*\n*Thirty-nine apertures—death’s fate removed,*\n*names inscribed on golden tablets in green script.*\n*Myriad joys abound, blessings overflow.*\n*Spirits ascend the Golden Gate, mounting cloud chariots.*\n\nAll who possess the golden names and imperial tablets,\npurple script of the Upper Clarity,\nhaving received this text, are destined for immortality,\ntheir names recorded in the Azure Palace,\ngranted thirty-six Jade Lads and Jade Maidens each\nto attend the Jade Scriptures,\nguarding those whose bodies follow the Dao.\n\nIn practicing this Way,\ndo not tread upon filth or enter defilement,\nnor consume the five pungents, raw or rank meats,\nlest you offend the viscera’s spirits,\ninjure truth, or violate *qi*—\nsuch acts bar entry to immortality.\n\n**Golden Chamber’s Life-Delivering, Years-Returning Upper Perfected Jade Talisman**\nOn each day of your destiny,\ninscribe in green on white paper, facing the kingly direction, and ingest one talisman.\nEnter the chamber and recite the *Inner True Scripture of the Golden Chamber* once.\nInscribe and ingest the talisman as prescribed.\nAfter one hundred ingestions,\nthe Upper Origin flows unimpeded,\nthe hundred passages open bright,\ndead *qi* dissolves and vanishes,\nspirits and numina all return.\n\nAfter ingesting one thousand talismans,\nthe Upper Origin’s Perfected Lord manifests in the Mud-Pill Palace,\nthought and recollection take on semblance,\nand speech is shared with the spirits.\nAfter ingesting ten thousand talismans,\nspirit fills the hundred passages,\neach pore receives the true,\nthe Red Child rejoices,\nthe Highest Sovereign is moved above,\nsending down Perfected Ones,\nerasing death from the Northern Emperor,\ndelivering life to the Southern Palace,\nthe Three Luminaries merge in virtue,\nheaven and earth share a single root.\n\n**Golden Chamber’s Life-Delivering, Years-Returning Middle Perfected Jade Talisman**\nOn each of the eight seasonal nodes,\ninscribe in red on white paper,\ningest one talisman facing the direction of the season,\nenter the chamber and recite the *Inner True Scripture of the Golden Chamber* once.\nInscribe and ingest the talisman as prescribed.\nAfter one hundred ingestions,\nthe Middle Origin opens to the true,\nthe hundred passages receive spirit,\ninner and outer grow bright and clear.\nAfter one thousand ingestions,\nthe Middle Origin’s Perfected Lord manifests in the Crimson Palace,\nthought and recollection take on semblance,\nnow seen, now vanished,\nthe Red Child is secured and strengthened,\nreversing age to regain youth.\nAfter ten thousand ingestions,\nthe root of spirit fills with *qi*,\neach pore receives the true,\nthe stomach and viscera grow fresh and luminous,\nthe ascent reaches the Great Tenuity,\npurple chariots descend,\ndeath is concealed in the Northern Feng,\nlife is recorded in the Southern Palace,\nheaven and earth merge in virtue,\nthe Three Luminaries unite in spirit.\n\n**Golden Chamber’s Life-Delivering, Years-Returning Lower Perfected Jade Talisman**\nOn each day of the Great Year and each *jiazi*,\ninscribe in yellow on white paper,\ningest one talisman facing the Great Year,\nenter the chamber and recite the *Inner True Scripture of the Golden Chamber* once.\nInscribe and ingest the talisman as prescribed.\nAfter one hundred ingestions,\nthe Lower Origin’s hidden gates receive the nine spirits’ moisture,\nthe hundred passages grow bright and clear,\nthe ten thousand *qi* all return,\ninner and outer become thoroughly luminous.\nAfter one thousand ingestions,\nthe Lower Origin’s Perfected Lord takes on semblance and manifests.\nAfter ten thousand, the Way is complete,\neach pore binds spirit,\ndead *qi* wholly dissolves,\nthe entire form becomes immortal,\nthe Highest Perfected is moved above,\nsending down the Jade Dawn,\ndelivering life and returning years,\nsun and moon share a single root,\nsoaring through the Great Void,\nascending into the Emperor’s Dawn.\n\nWhen inscribing the talismans, always face the kingly direction above,\nknock the teeth thirty-six times,\nand raise the prayer:\n*\"Celestial numina flourish in splendor,\nthe nine apertures grow solemn and clear,\nthe five officials and six palaces,\ntheir divine radiance fresh and bright.\nThe Three Origins are filled and secured,\nthe ten thousand *qi* brim and overflow.\nThe Golden Chamber delivers life,\nthe green script reverses aging.\nThrice refined, the nine apertures\nascend into the Great Clarity,\nthe Three Luminaries shine as one,\nheaven and earth merge in union,\nsoaring through the Mysterious Void,\nroaming and feasting in the Purple Court.\"*\n\nConclude, then swallow *qi* forty-six times and cease.\nThen ingest the talisman.\n\nTo practice the Way of Delivering Life and Returning Years,\non each *gui* day of the sixth month,\ndraw one *hu* of Northern Spring water.\nOn the day of your destiny,\ntake one *jin* each of angelica root, peach bark, and [missing character] leaves,\nboil them together until bubbling,\nand bathe at noon.\nWhen about to bathe,\nface your destiny and knock the teeth nine times,\nvisualizing three Jade Lads holding towels to your left,\ntwo Jade Maidens bearing incense to your right,\na canopy of purple clouds and floral hues arrayed before and behind.\nSoftly intone:\n*\"Heaven and earth are thoroughly clear,\nwashing away filth and dust,\nrefining and transforming the nine paths,\nreturning the form to Great Perfection.\nThe hundred passages receive spirit,\neach joint is renewed,\nclarity and emptiness oversee and reflect,\ninner and outer unfold in full.\nThe day is auspicious, the hour favorable,\ndelivering life and returning years.\nJade Lads and Jade Maidens,\nhold towels for me,\nmystic clouds and purple canopy,\nadorn my body,\nthat I may live long,\nheaven and earth sharing a single root.\"*\n\nConclude, then bathe.\nAfter bathing, return to the chamber,\nlie with the head to the east,\napply powder to adorn yourself,\ncovering the entire body.\nRub both palms until warm,\nwipe the face fourteen times,\nand softly intone:\n*\"The *qi* of the Celestial Mystery is clear,\nmy body is already refined.\nDust and filth dissolve and vanish,\nthe nine nines receive spirit,\ntransforming me,\nreturning me to youthful form.\"*\n\nConclude, then draw *qi* thirty-six times and swallow, then cease.\nPracticing this Way for three years,\nthe old form’s skin wholly sheds,\nthe flowery bones regenerate,\nthe body shines with jade light,\nthe face and hair take on a golden countenance.\n\nThis is the wondrous method among all Ways,\nnot to be transmitted to the untrue.\nThose who lightly disclose it will see their seven ancestors tortured,\nendlessly consigned to the offices of ghosts.\nDisciples must practice in secret,\nonly then may they attain immortality.\n\nWhen receiving the Way of Delivering Life and Returning Years,\nfollow the regulations:\nmaster and disciple each observe a nine-day fast,\nor three days, or five,\nand offer silk according to the year’s tally,\none *chi* per year,\nalong with a golden figurine weighing two *liang*, four *zhu*, and one *xing*,\nas a pledge to the Nine Heavens for delivering life,\na token of the transformed body.\nThose who practice without pledging\nwill not draw the Way’s response,\nthought will not awaken spirit,\nviolating regulations and transgressing prohibitions\nwill be examined by the Right Office.\nPractitioners must be clearly cautious.\n\nThe Perfected of Western City transmitted this to Wei Huacun at the Yangluo Palace,\nand now seals one copy within the Yangluo Mountains.\n\nHere ends the *Upper Scripture of the Inner True Three Floral Treasures of the Green Script for Delivering Life and Returning Years in the Golden Chamber of the Cavern-Real*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真金房度命绿字回年三华宝曤内真上经 经名：洞真金房度命绿字回年三华宝曤内真上经。 简称《金房度命经》。 撰人不详，约出於南北朝。 假托虚皇天尊传授，言诵经存神度命之法。 一卷。 底本出处：《正统道藏》正一部。 洞真金房度命绿字回年三华宝曤内真上经 南极总司定录上真禁君，以始皇元年岁在壬午七月七日中时，於上上禅善无量寿天玉国，七宝洞虚凤京紫台琼林之下，敢稽首玉轩，请问玉帝虚皇天尊：忝胤皇期，命挺宿根，轮转九化，结胎琼津，三丹秀景，日吉启晨，自袭皇冑，希慕九玄，修研灵典，思真念神，长斋琼阙，时不亏间，历稔劫训，名题帝篇，位登上司，总监万仙，而未获启授度命之方。 运推数至，时不常存，愿赐宝诀，以度后贤。 於是虚皇道君告南极总司上真禁君曰：金房度命回年之诀，秘在九天之上大有之宫，金台玉室九曲之房，侍典玉女乃三千人。 此道玄微，非中真所参。 旧科万劫一传。",
      "translated_text": "*The Cavern of Perfection: The Golden Chamber Scripture for Delivering Life, the Green-Writ Scripture of Rejuvenation, and the Three-Flowered Treasure Radiance’s Inner Perfection Upper Scripture*\n\nScripture Title: *The Cavern of Perfection: The Golden Chamber Scripture for Delivering Life, the Green-Writ Scripture of Rejuvenation, and the Three-Flowered Treasure Radiance’s Inner Perfection Upper Scripture*. Abbreviated as *The Golden Chamber Scripture for Delivering Life*.\n\nThe compiler is unknown, approximately dating to the Northern and Southern Dynasties. It is pseudepigraphically attributed to the transmission of the Celestial Worthy of the Primordial Beginning, expounding methods for reciting scriptures, preserving the spirits, and delivering life. Comprising one scroll.\n\nSource of the base text: *Daoist Canon of the Orthodox Tradition*, First Section.\n\n---\n\n*The Cavern of Perfection: The Golden Chamber Scripture for Delivering Life, the Green-Writ Scripture of Rejuvenation, and the Three-Flowered Treasure Radiance’s Inner Perfection Upper Scripture*\n\nOn the seventh day of the seventh month in the ren-wu year of the first reign of the August Emperor, at the mid-hour, the Supreme Perfected Warden of the Southern Culmen, Keeper of the Registers, prostrated himself before the Jade Pavilion and inquired of the Celestial Worthy of the Primordial Beginning, the Jade Emperor:\n\n\"Though I am unworthy, I am a scion of the imperial lineage, my life endowed with stellar roots. Through nine transformations, I have gestated in the nectar of jade, my three cinnabar spirits flourishing in radiant splendor. At the auspicious dawn, I inherited the imperial mantle, aspiring to the Nine Mysteries. I have studied the numinous canons, contemplated the true, and invoked the spirits. I have maintained a perpetual fast within the jade precincts, never faltering, and through kalpas of discipline, my name has been inscribed in the imperial registers. I have ascended to the office of Supreme Controller, overseeing the myriad immortals—yet I have not received the method for delivering life.\n\nThe revolutions of fate advance, and time does not abide. I humbly beseech the gift of a precious formula to deliver later worthies.\"\n\nThereupon, the Lord of the Dao, the Celestial Worthy, addressed the Supreme Perfected Warden of the Southern Culmen:\n\n\"The formula for delivering life through the Golden Chamber and reversing the years is concealed within the Palace of Great Existence above the Nine Heavens, in the Golden Terrace and Jade Chamber of the Nine-Bend Chamber, where three thousand jade maidens attend to the sacred texts. This Dao is profound and subtle, not to be fathomed by median perfected beings. By ancient statute, it is transmitted but once in ten thousand kalpas.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 379,
      "start_sentence": 0,
      "end_sentence": 12,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.272982597351074,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真金房度命绿字回年三华宝曤内真上经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "得行此法，与九炁同根，齐光三景，天地长存。 修之一遍，胃藏通津，十遍朗彻，与灵共言，百遍度命，内化胎仙，千遍乘空，飞行上清，万遍道备，位加仙卿，乘烟驾虚，上造帝皇。 今以相告，慎而行焉。 即命五老仙都南昌上宫监录司马定仙上真，以《金房度命绿字回年三华宝曜内真上经》，盟授於君。 投盟告誓於无量寿天。 至中皇元年，历数以传南极上元君、万始先生、黄童中真、金华仙人、太和玉女、太素三元君、金阙帝君、上相青童君。 今封一通於峨媚山中，若有玄图帝简，绿字上清，金骨玉藏，当得此文。 然三道运周，九阳应期，本正元皇，当行道真，宿有仙籍，克得其文。 得者宝秘，慎勿妄宣。 大帝灵都宫中，有二十四万上真仙人，皆铸黄金为简，刻白银结编，紫笔书文，齐声合真，诵咏此篇，玉响辽朗，声表九天，通神致灵，反华回年，游行礼唱，妙冠洞真。 故能度命，天地同根，有得此道，克成上仙。 此经高上之玉章，太帝之灵篇，罗分一形之内，通理百关。 诵之一遍，妙理自鲜，诵之十遍，反容童颜，诵之百遍，内化胎仙，诵之千遍，坐在立亡，万遍道备，白日登晨。 长斋寂处，不关风尘，道无不降，计日升仙。 若有笃尚，未能遁身，故处人中，常能别室，清斋烧香，晨夕礼拜，诵咏灵篇，可得禳灾，辟却万患，祸消上宫，罪灭九阴，万遍积感，身登云房。 凡行度命之道，当以本命、太岁之日，又甲子、八节之日，入室东向，服炁九咽，存大帝君，仍再拜； 转南向，服炁九咽，存南极上真君，仍再拜； 转西向，服炁九咽，存三天长生君，仍再拜； 转北向，服炁九咽，存高上虚皇君，仍再拜。 亦可悉东向，心拜四方，而服炁也。 毕，向本命上，叩齿三十六通，咽炁三十六过止。 向太岁上，引炁二十四咽止。 还北向诵经。 诵经十遍为一过，讫则服金房保命符各一枚，十遍便十服符，随遍之限。 此则通神致真，坐见八方，调理百关，节节纳灵，万炁总归，则能长生，寿极天地，三光同年也。 北向执经，叩齿三十六通，心存室内有五色紫云，覆满一室，内外郁冥，微咒曰： 玄玄九重炁，至道生上元，三轮空同琼，五转度命云，回年九御中，万遍道乃分，太漠何寥寥，正存帝一君，混合金房内，胎息静百关。 毕，便咏经也。 金房度命绿字回年三华宝曜内真上经 金房之内有真人，化乎玉国生宝邻，紫云婆娑郁九玄，结成琼台体自然，玉楼金阙对两边，流霞丹霄翼灵真，绿华浩浩辉中田，上有崚嶒九重天，下有万丈幽谷泉，合会洞门造云根，玉女仙童各三千，执巾侍香扬紫烟，千千百百皆群仙，整束法服诵灵篇，轮转金房以回年，三华宝曜洞明鲜，十诵一遍造上元，吞咽灵符毕乃还。 静思五藏理百关，百关之内各有神，太微小童对帝真，安镇舌本通液源，太一务猷度要言，近填玉枕下泥丸，帝君陵阳梵命幡，徘徊两眉正中分，元英公子固灵仙，化生左腋肝后门，洞阳郁灵是白元，填兆右腋正四员，中央司命丈人君，明初执籍度兆身，保练绛宫长乃存，桃君道康合精延，齐下宫阙填灵根，天帝赤子三元先，泥丸之内九孔前，丹皇运珠绛宫神，上填项中大槌边，元王始明本自然，填在四际与口连，八真合景参九玄，下填背骨集中田，七真玄阳度命年，填兆玉关右肾间，通神致命百液津，六真上元连紫烟，填兆头外与内缠，五真养光法三元，填兆喉内执妙篇，四真青明反童颜，填兆胃管万神欢，三真黄宁色如丹，填鼻两孔通幽关，二真坚玉炁香兰，填在太仓无艰难，一真天精神静安，填在胸中统生官，悉衣锦衣飞青裙，为兆度命塞死门，审存口咏诵灵文，十读一遍义理分，不但长生升九玄。",
      "translated_text": "Those who practice this method shall share the same root as the ninefold *qi*, their radiance equaling the Three Luminaries, and their existence enduring as long as Heaven and Earth.\n\nAfter one recitation, the stomach and viscera shall be permeated with vital fluids; after ten, clarity shall dawn, and speech with spirits shall become possible; after a hundred, the immortal embryo shall form within; after a thousand, one shall ascend through the void; after ten thousand, the Dao shall be perfected, the rank of Immortal Minister attained, and one shall ride the mist and mount the void to ascend before the August Emperor.\n\nNow I impart this to you—practice it with utmost care.\n\nThereupon, the Five Elders of the Immortal Capital in the Southern Palace commanded Sima Dingsian, the Perfected Warden of the Upper Realms, to transmit the *Upper Scripture of the Golden Chamber’s Life-Delivering, Green-Writ, Year-Reversing Threefold Radiance of Inner Perfection* under sacred covenant to you. The oath was sworn before the Heaven of Immeasurable Life.\n\nIn the first year of the Central August Era, this transmission passed to the Upper Primordial Lord of the Southern Culmen, the Venerable Master of the Myriad Beginnings, the Yellow Youth Perfected, the Golden Flower Immortal, the Jade Maiden of Supreme Harmony, the Three Primordial Lords of Grand Simplicity, the Golden Portal Emperor Lord, and the Upper Minister Azure Youth Lord. Now, one copy is sealed within Mount Emei. Only those who possess the imperial charts of the Mysterious Plan, the green-writ scriptures of the Upper Clarity, and the golden bones and jade viscera of immortality shall receive this text.\n\nYet as the Three Dao revolve and the Nine Yang respond in due time, those of the original Primordial August lineage who practice the true Dao, and whose names are already inscribed in the registers of immortality, shall rightfully obtain this scripture. Those who receive it must treasure and conceal it—beware of reckless disclosure.\n\nWithin the Divine Capital Palace, twenty-four myriad Upper Perfected Immortals have cast golden tablets, inscribed with silver-bound characters in purple ink. In unison, they recite this scripture, their jade-like voices resounding through the Nine Heavens, communicating with spirits and invoking numinous power, reversing the blossoms of age and restoring youth. Their ritual processions and chanted praises surpass all other mysteries of the Cavern Realms. Thus they deliver life, sharing the same root as Heaven and Earth. Those who attain this Dao shall ascend to become Upper Immortals.\n\nThis scripture is the jade composition of the Most High, the numinous text of the Supreme Emperor. It distributes itself within a single form, governing the hundred passages of the body. After one recitation, its profound principles shall naturally become clear; after ten, one’s countenance shall revert to youth; after a hundred, the immortal embryo shall form within; after a thousand, one shall sit in the midst of disappearance; after ten thousand, the Dao shall be perfected, and one shall ascend to the morning light in broad daylight.\n\nThose who maintain long-term purity in seclusion, untouched by worldly dust, shall find the Dao descending without fail—ascension to immortality shall be but a matter of days. For those of sincere devotion who cannot yet withdraw from the world, let them dwell among others while maintaining a separate chamber, observing purity, burning incense, and performing morning and evening rites. By reciting this sacred text, they may avert disasters, repel myriad afflictions, dissolve misfortunes in the Upper Palace, and eradicate sins in the Nine Yin. After ten thousand recitations, their accumulated merit shall carry them to the Cloud Chambers.\n\nIn practicing the method of life-deliverance, one should choose the day of one’s natal destiny, the day of the Grand Year Star, an *jiazi* day, or one of the eight solar terms. Entering the chamber and facing east, ingest *qi* nine times, visualizing the Great Emperor Lord, then bow twice. Turn to the south, ingest *qi* nine times, visualizing the Upper Perfected Lord of the Southern Culmen, then bow twice. Turn to the west, ingest *qi* nine times, visualizing the Lord of Longevity of the Three Heavens, then bow twice. Turn to the north, ingest *qi* nine times, visualizing the Most High Lord of the Void, then bow twice. Alternatively, one may face east throughout, bowing in the heart toward the four directions while ingesting *qi*.\n\nUpon completion, face the direction of one’s natal destiny, click the teeth thirty-six times, and swallow *qi* thirty-six times. Then face the Grand Year Star, draw *qi* twenty-four times, and conclude by facing north to recite the scripture. Ten recitations constitute one cycle; upon finishing, ingest one *Golden Chamber Life-Preserving Talisman* per cycle, matching the number of recitations. This practice shall communicate with spirits and attain perfection, allowing one to perceive the eight directions while seated, regulate the hundred passages, and gather the myriad *qi*—thus achieving longevity, matching the lifespan of Heaven and Earth, and sharing the same age as the Three Luminaries.\n\nAfter facing north and holding the scripture, click the teeth thirty-six times, visualizing five-colored purple clouds filling the chamber, shrouding it in mist. Silently intone the incantation:\n\n*\"Mysterious, mysterious, ninefold qi,*\n*the supreme Dao gives birth to the Upper Primordial.*\n*Three wheels empty as jade,*\n*five revolutions deliver life as clouds.*\n*Reversing the years within the Nine Imperials,*\n*ten thousand recitations divide the Dao.*\n*How vast and desolate the Great Desert—*\n*solely meditate on the Emperor Unity Lord.*\n*Within the Golden Chamber they merge,*\n*embryonic breathing stills the hundred passages.\"*\n\nThen begin reciting the scripture.\n\n---\n\n**Upper Scripture of the Golden Chamber’s Life-Delivering, Green-Writ, Year-Reversing Threefold Radiance of Inner Perfection**\n\nWithin the Golden Chamber dwells a Perfected One,\ntransformed in the Jade Kingdom, born in the Treasure Neighborhood.\nPurple clouds swirl and coil through the Nine Mysteries,\nforming a jade terrace, its body naturally perfected.\nJade towers and golden portals stand on either side,\nflowing rosy clouds and cinnabar skies shelter the numinous Perfected.\nVerdant radiance vast and bright illumines the central field—\nabove, the towering Nine Heavens,\nbelow, the ten-thousand-fathom abyss of hidden springs.\nJoining at the Cavern Gate, they create the root of clouds.\nJade maidens and immortal youths, three thousand each,\nhold towels and offer incense, wafting purple smoke.\nThousands upon thousands, hundreds upon hundreds—all are host to immortals,\nadorned in ritual vestments, reciting the sacred text.\nRevolving through the Golden Chamber to reverse the years,\nthe Threefold Radiance shines with luminous clarity.\nTen recitations complete one cycle to ascend to the Upper Primordial—\nswallowing the numinous talismans, the practice is complete.\n\nIn tranquil contemplation, regulate the five viscera and the hundred passages,\nfor within each passage dwells a spirit.\nThe Minor Lad of the Grand Tenuity faces the Emperor Perfected,\nsecuring the tongue’s root and connecting the source of fluids.\nThe Grand Unity’s *Wu You* recites essential words,\nfilling the Jade Pillow and descending to the Muddy Pellet.\nThe Emperor Lord’s *Lingyang* and *Fanming* banners\nhover between the eyebrows, centered and divided.\nThe Lord of Primordial Brilliance, *Yuan Ying*, solidifies the numinous immortals,\ntransforming and emerging from the left armpit, the liver’s posterior gate.\nThe flourishing yang of *Dongyang* and the numinous *Baiyuan*\nfill the right armpit, precisely aligned with the four officials.\nThe Central Controller, the Elder Lord of Destiny,\nrecords the beginning of clarity to deliver the body’s destiny.\nPreserving and refining the Crimson Palace, ever abiding therein,\nthe Peach Lord *Daokang* harmonizes essence and extends life.\nEqualizing the lower palace chambers, filling the root of the numinous,\nthe Heavenly Emperor’s Red Child, foremost of the Three Primordials,\nresides within the Muddy Pellet, before the nine apertures.\nThe Cinnabar Emperor moves the pearl, spirit of the Crimson Palace,\nfilling the great hammer beside the neck.\nThe Primordial King *Shiming*, originally natural,\nfills the four boundaries and connects with the mouth.\nEight Perfected Ones unite their radiance, partaking in the Nine Mysteries,\nfilling the spine of the back, gathering in the central field.\nSeven Perfected Ones of Mysterious Yang deliver the years of life,\nfilling the Jade Pass beside the right kidney.\nCommunicating with spirits and delivering life, the hundred fluids flow—\nsix Perfected Ones of the Upper Primordial connect with purple smoke,\nfilling the head’s exterior and interior.\nFive Perfected Ones nurture radiance through the Three Primordials,\nfilling the throat, grasping the wondrous text.\nFour Perfected Ones of Azure Clarity reverse youthful countenance,\nfilling the stomach duct, delighting the myriad spirits.\nThree Perfected Ones of Yellow Tranquility, their color like cinnabar,\nfill the two nostrils, connecting the hidden passages.\nTwo Perfected Ones of Firm Jade, their *qi* fragrant as orchids,\nfill the Great Granary without difficulty.\nOne Perfected of Heavenly Spirit, serene and tranquil,\nfills the chest, governing the life-officials.\nAll clad in brocade robes and flying azure skirts,\nthey deliver life for you, sealing the gate of death.\nCarefully visualize and recite the sacred text—\nten readings complete one cycle, and the principles shall become clear.\nNot only shall you attain longevity and ascend to the Nine Mysteries.",
      "overlap_context": "addressed the Supreme Perfected Warden of the Southern Culmen:\n\n\"The formula for delivering life through the Golden Chamber and reversing the years is concealed within the Palace of Great Existence above the Nine Heavens, in the Golden Terrace and Jade Chamber of the Nine-Bend Chamber, where three thousand jade maidens attend to the sacred texts. This Dao is profound and subtle, not to be fathomed by median perfected beings. By ancient statute, it is transmitted but once in ten thousand kalpas.\"",
      "start_char": 379,
      "end_char": 1784,
      "start_sentence": 13,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 51.48828959465027,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真金房度命绿字回年三华宝曤内真上经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "九九之真讳拘制，填在左耳 神聪慧，窃向万里入无际，宫宅郁郁仙皇位，教兆度命合符契，皇一之魂讳上归，填在右耳 总万机，听声别鸣同幽微，三合成一齐光辉，紫素元君讳翳郁，填兆头面光明发，呼吸五晨咽日月，灵芝滂无饥渴，黄素元君讳圆华，填在胸腹结云罗，制御北帝检天魔，正真保练虚皇家，白素元君讳启明，填兆下关固太灵，上通九孔鲜光荣，拘魂制魄使常生，日中司命讳接生，填兆左手四大明，五华保真置云营，仰引日月咽元精，度命回年穷天龄，月中桃君讳方盈，填兆右手运斗星，把持玄纲御五灵，历度四七讳天庭，回周三匝洞清明，左目童子讳飞灵，填兆左目阳光明，朗彻元穷睹玉清，赫若天威放流星，右目童子讳晨婴，填兆右目阴内精，洞观天关监帝庭，豁若三晨乘运征，肺部童子讳素明，填兆肺户内外清，游魂散魄付黄宁，检摄帝房无亏盈，胎中一元务玄子，太一精魂玄归子，填兆五藏结喉里，保神固炁令不死，结中炁君案延昌，无君精魂保谷童，填兆五藏大胃宫，纳受津液及婴蒙，朱英玉芝自逸充，节中黑炁生斌来，帝真精魂讳幽台，填兆九肠统四维，能明此真寿无期，胞中黄炁祖明车，与帝同治共室庐，精魂理维藏隐书，何不独思想玄虚，万遍自足登云舆，血中赤炁混离子，司命精魂发纽子，二神共填百关里，调和炁液卫形已，能明此道终不死，寿得万年乃方始，上元元父高同生，下玄玄母叔火王，填在胞囊下明堂，太一重冥御玄纲，帝尊明真正相当，大帝精魂讳阳台，八虚回道翼明光，帝魂无阿共一房，同填本命太幽宫，七神合契运明梁，回年度命永无穷，三素老君讳牢张，练化八道度大乡，左仙仲成治中央，右仙曲文对在傍，三神合灵在人中，玄一老子林虚灵，玄关萧萧乃清凉，黑帝保成填膀胱，白帝安来处阴囊，赤帝来觉口中方，青帝雕梁五藏宫，五帝二老两仙王，卫侍兆身升云纲，帝卿上元肇勤精，绛宫中神中光坚，下庭之神归上明，三一真君守兆形，各填一宫其炁精，审能存之致长生，不但不死升玉清，帝一真君父宁在，母精二神待兆纪，填防形内死关里，上下罗列相役使，不离宫阙曰常在，兆常诵之见赤子。 万炁混合结成真，各部天兵填兆身，审而存之自当分，长斋积感见真人，授兆金房回年篇，名书帝录有宿缘，皆由勤慕非自然，十遍一过万神欣，三年之中道当前，见形紫房与兆言，降致绿軿飞云轩，游宴五岳造帝晨，上谒太虚玉皇前，稽首礼拜更受仙。 诵经毕，当存室内生自然紫炁，郁勃相沓，入兆身中，皆从鼻口两耳，而觉体小热，口引三十九咽，微咒曰： 万炁混合成神庐，各填宫室炁清虚，三十九孔死命除，名言金简绿字书，万庆欣欣福有余，神登金阙升云舆。 凡有金名帝简，紫字上清，得受此文，皆宿挺应仙，青宫纪名，给玉童玉女各三十六人，侍典玉经，营卫有经者身。 修行此道，不得履淹入秽，食五辛腥臊之属，触忤藏神，伤真犯炁，不得入仙。 金房度命回年上真玉符 每以本命之日，青书白纸，向王方服之一枚，入室诵金房内真经一遍。 书符如法服一枚。 服之百枚，上元通畅，百关朗开，死炁消灭，神明总归。",
      "translated_text": "The Nine-Nine Perfected Ones, by their secret names, restrain and govern,\nfilling the left ear—spirit sharp and wise,\nstealing into the boundless ten thousand *li*,\npalace abodes lush with the Emperor of Immortals’ throne.\nThey teach you to deliver life, matching talismanic accord.\n\nThe Hun-soul of the August One, by its secret name *Shang Gui*,\nfills the right ear, mastering the myriad affairs,\ndistinguishing sounds and cries in the deepest subtleties.\nThree unite as one, their radiance gleaming bright.\n\nThe Purple-Silk Primordial Lady, by her secret name *Yi Yu*,\nfills your head and face, light bursting forth.\nBreathing in the Five Mornings, swallowing sun and moon,\nspirit mushrooms overflow—no hunger, no thirst.\n\nThe Yellow-Silk Primordial Lady, by her secret name *Yuan Hua*,\nfills chest and abdomen, weaving cloudy nets,\ncommanding the Northern Emperor to inspect celestial demons,\nupholding true refinement for the Void Sovereign’s house.\n\nThe White-Silk Primordial Lady, by her secret name *Qi Ming*,\nfills the lower gate, securing the Great Spirit,\nascending through the nine apertures, fresh and luminous,\nrestraining hun and po, ensuring perpetual life.\n\nThe Life-Officer of the Sun’s Center, by his secret name *Jie Sheng*,\nfills your left hand—the Four Great Illuminations,\nFive Flowers preserving truth, arrayed in cloudy encampments.\nDrawing in sun and moon, swallowing primordial essence,\ndelivering life, reversing years to the limits of heaven’s span.\n\nThe Peach Lord of the Moon, by his secret name *Fang Ying*,\nfills your right hand, wielding the Dipper’s stars,\ngrasping the mysterious net, governing the Five Spirits.\n\nThe *Li Du Si Qi*, by his secret name *Tian Ting*,\ncircles thrice, penetrating clarity and brightness.\n\nThe Lad of the Left Eye, by his secret name *Fei Ling*,\nfills your left eye—yang’s radiance,\nilluminating the primordial aperture to behold Jade Clarity,\nresplendent as celestial might, streaming like meteors.\n\nThe Lad of the Right Eye, by his secret name *Chen Ying*,\nfills your right eye—yin’s inner essence,\ngazing through Heaven’s Gate to oversee the Imperial Court,\nvast as the Three Mornings riding the turning wheel.\n\nThe Lad of the Lung, by his secret name *Su Ming*,\nfills the lung’s chamber, purifying within and without,\nentrusting wandering hun and scattered po to Yellow Tranquility,\ninspecting the Imperial Chamber without flaw or excess.\n\nThe First Primordial of the Womb, the Mysterious Child,\nthe Supreme One’s essence-soul, the *Xuan Gui* Child,\nfills the five viscera, binding the throat’s interior,\npreserving spirit, securing *qi*, ensuring deathlessness.\n\nThe *Qi*-Binding Lord of the Central Node, *An Yan Chang*,\nthe Lordless essence-soul, guardian of the Grain Lad,\nfills the five viscera and the Great Granary,\nreceiving essences and fluids, along with the Infant’s Vigor.\nVermilion blossoms and jade mushrooms naturally abound.\n\nThe Black *Qi* of the Nodes, born of *Bin Lai*,\nthe Emperor’s true essence-soul, by his secret name *You Tai*,\nfills the nine intestines, governing the four directions.\nMastering this truth grants boundless longevity.\n\nThe Yellow *Qi* of the Womb, *Zu Ming Che*,\nshares governance with the Emperor, dwelling in the same chamber.\nEssence-souls manage the hidden scriptures—\nwhy not contemplate the Mysterious Void alone?\nTen thousand recitations suffice to ascend the cloud chariot.\n\nThe Red *Qi* of the Blood, *Hun Li Zi*,\nthe Life-Officer’s essence-soul, *Fa Niu Zi*,\ntwo spirits together fill the hundred passages,\nharmonizing *qi* and fluids to protect the formed body.\nMastering this Dao ensures deathlessness—\nlongevity of ten thousand years only then begins.\n\nThe Primordial Father of the Upper Origin, *Gao Tong Sheng*,\nthe Mysterious Mother of the Lower Mystery, *Shu Huo Wang*,\nfill the Bright Hall below the bladder,\nthe Supreme One’s profound obscurity steering the mysterious net.\nThe Emperor, honored and true, perfectly matched—\n\nThe Great Emperor’s essence-soul, by his secret name *Yang Tai*,\neight voids revolve in the Dao, winging luminous light.\nThe Imperial Soul, without partiality, shares one chamber,\ntogether filling the Great Obscure Palace of your destiny.\nSeven spirits unite in accord, turning the Bright Beam—\nreversing years, delivering life without end.\n\nThe Three-Silk Elders, by their secret name *Lao Zhang*,\nrefine and transform the Eight Paths, delivering the great realm.\n\nThe Left Immortal, *Zhong Cheng*, governs the center,\nthe Right Immortal, *Qu Wen*, stands beside him.\nThree spirits unite in the human midst—\n\nThe Mysterious One, Lord Lao, *Lin Xu Ling*,\nthe Mysterious Gate, whispering and cool.\nThe Black Emperor guards and completes, filling the bladder,\nthe White Emperor arrives in peace, dwelling in the scrotum,\nthe Red Emperor awakens in the mouth’s square,\nthe Green Emperor carves the beams of the Five Viscera’s palace.\nFive Emperors, Two Elders, and the Two Immortal Kings\nguard and attend your body, ascending the cloudy net.\n\nThe Imperial Minister of the Upper Origin, *Zhao Qin Jing*,\nthe Crimson Palace’s central spirit, *Zhong Guang Jian*,\nthe lower court’s spirit ascends to *Shang Ming*.\nThe Three-One Perfected Lords guard your form,\neach filling one palace with their essence-*qi*.\nCarefully visualize them to attain longevity—\nnot only deathlessness, but ascension to Jade Clarity.\n\nThe First Emperor’s Lord, Father *Ning Zai*,\nMother Essence, two spirits awaiting your destiny,\nfill the dead gates within your form,\narrayed above and below, mutually serving.\nNever leaving the palace halls, they remain ever-present—\nrecite constantly to behold the Red Child.\n\nMyriad *qi* blend and merge, forming true beings,\neach division of heavenly soldiers fills your body.\nCarefully visualize and discern—\nwith long fasting and accumulated devotion, you shall see the Perfected.\nThey bestow upon you the *Gold Chamber’s* *Returning Years* scripture,\nyour name inscribed in the Emperor’s register, destined for immortality,\nall through diligent devotion, not by nature alone.\nTen recitations complete one cycle, and the myriad spirits rejoice.\nWithin three years, the Dao shall appear before you—\nthe Purple Chamber’s form shall speak with you,\ndescending in green chariots and flying cloud pavilions,\nroaming and feasting on the Five Peaks, visiting the Imperial Dawn.\nAscend to pay homage before the Jade Emperor of the Great Void,\nbowing in reverence, receiving further immortality.\n\nUpon completing the recitation, visualize within the chamber the spontaneous arising of purple *qi*,\nbillowing and surging, entering your body\nthrough nose, mouth, and both ears,\nuntil you feel a gentle warmth in your form.\nDraw thirty-nine breaths, then softly intone the incantation:\n\n*Myriad qi blend to form the spirit’s abode,*\n*each filling the palaces with pure and void qi.*\n*Thirty-nine apertures—death’s fate removed,*\n*names inscribed on golden tablets in green script.*\n*Myriad joys abound, blessings overflow.*\n*Spirits ascend the Golden Gate, mounting cloud chariots.*\n\nAll who possess the golden names and imperial tablets,\npurple script of the Upper Clarity,\nhaving received this text, are destined for immortality,\ntheir names recorded in the Azure Palace,\ngranted thirty-six Jade Lads and Jade Maidens each\nto attend the Jade Scriptures,\nguarding those whose bodies follow the Dao.\n\nIn practicing this Way,\ndo not tread upon filth or enter defilement,\nnor consume the five pungents, raw or rank meats,\nlest you offend the viscera’s spirits,\ninjure truth, or violate *qi*—\nsuch acts bar entry to immortality.\n\n**Golden Chamber’s Life-Delivering, Years-Returning Upper Perfected Jade Talisman**\nOn each day of your destiny,\ninscribe in green on white paper, facing the kingly direction, and ingest one talisman.\nEnter the chamber and recite the *Inner True Scripture of the Golden Chamber* once.\nInscribe and ingest the talisman as prescribed.\nAfter one hundred ingestions,\nthe Upper Origin flows unimpeded,\nthe hundred passages open bright,\ndead *qi* dissolves and vanishes,\nspirits and numina all return.",
      "overlap_context": "Perfected Ones of Firm Jade, their *qi* fragrant as orchids,\nfill the Great Granary without difficulty.\nOne Perfected of Heavenly Spirit, serene and tranquil,\nfills the chest, governing the life-officials.\nAll clad in brocade robes and flying azure skirts,\nthey deliver life for you, sealing the gate of death.\nCarefully visualize and recite the sacred text—\nten readings complete one cycle, and the principles shall become clear.\nNot only shall you attain longevity and ascend to the Nine Mysteries.",
      "start_char": 1785,
      "end_char": 3005,
      "start_sentence": 44,
      "end_sentence": 55,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.76232671737671,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真金房度命绿字回年三华宝曤内真上经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "服之千枚，上元真君见形泥丸，思存仿髴，与神共言。 服之万枚，灵填百关，孔孔纳真，赤子欢欣，上感虚皇，降致真人，削死北帝，度命南宫，三景合德，天地齐根。 金房度命回年中真玉符 每以八节之日，赤书白纸，随节所向服之一枚，入室诵金房内真经一遍，书符如法服一枚。 服之百枚，中元开真，百关纳灵，内外朗清。 服之千枚，中元真君见形绛宫，思存仿髴，若见若亡，保固赤子，反老成童。 服之万枚，灵根炁充，百孔纳真，胃藏鲜明，上彻太微，降致紫軿，北酆匿死，南宫记生，天地合德，三景齐灵。 金房度命回年下真玉符 每以太岁及甲子之日，黄书白纸，向太岁服之一枚，入室诵金房内真经一遍，书符如法服一枚。 服之百枚，下元幽阙受九灵之润，百关朗清，万炁总归，内外彻明。 服之千枚，下元真君仿髴见形。 万枚道备，孔孔结灵，死炁都消，举形成仙，上感上真，降致玉晨，度命回年，日月同根，飞行太空，升入帝晨。 书符皆向王上，叩齿三十六通，仰祝曰： 天灵节荣，九孔肃清，五官六府，神华鲜明，三元填固，万炁充盈，金房度命，绿字反生，三炼九孔，升入太清，三景同辉，天地齐并，飞行玄虚，游宴紫庭。 毕，咽炁四十六过止。 便服符。 修度命回年之道，每以六癸之日，取北泉之水一斛，就本命之日，取白芷、桃皮、□叶各一斤，合煮令沸，正中而浴。 临浴时，向本命叩齿九通，思玉童三人执巾在左，玉女二人擎香在右，紫云华盖覆列前后。 微祝曰： 天地洞清，洗秽除尘，炼化九道，反形太真，百关纳灵，节节受新，清虚监映，内外敷陈，日吉时良，度命回年，玉童玉女，为我执巾，玄云紫盖，冠带我身，使我长生，天地同根。 毕，便浴浴讫，还入室，东首而卧，取粉自饰，通身令匝，仍摩两掌令热，拭面二七过，微祝曰： 天玄炁清，我身已精，尘秽消除，九九受灵，使我变易，还反童形。 〔毕〕#1，引炁三十六咽，都止。 行此之道三年，故形皮肤悉脱，华骨更生，体映玉光，面发金容。 此众道之妙法，不传於非真。 轻泄七祖被拷，长没鬼官，学者密修，克得神仙。 受度命回年之道，当依科，师弟子各斋九日，或三日，或五日，资盟随年之缯年一尺，金人二两四铢一形，誓九天度命，代形之信。 不盟而修，道不降感，思不启灵，违科犯禁，考属右官，奉者明自慎焉。 西城真人於阳洛宫授魏华存，今封一通於阳洛之山。 洞真金房度命绿字回年三华宝曜内真上经竟 #1『毕』字据前后文补。",
      "translated_text": "After ingesting one thousand talismans,\nthe Upper Origin’s Perfected Lord manifests in the Mud-Pill Palace,\nthought and recollection take on semblance,\nand speech is shared with the spirits.\nAfter ingesting ten thousand talismans,\nspirit fills the hundred passages,\neach pore receives the true,\nthe Red Child rejoices,\nthe Highest Sovereign is moved above,\nsending down Perfected Ones,\nerasing death from the Northern Emperor,\ndelivering life to the Southern Palace,\nthe Three Luminaries merge in virtue,\nheaven and earth share a single root.\n\n**Golden Chamber’s Life-Delivering, Years-Returning Middle Perfected Jade Talisman**\nOn each of the eight seasonal nodes,\ninscribe in red on white paper,\ningest one talisman facing the direction of the season,\nenter the chamber and recite the *Inner True Scripture of the Golden Chamber* once.\nInscribe and ingest the talisman as prescribed.\nAfter one hundred ingestions,\nthe Middle Origin opens to the true,\nthe hundred passages receive spirit,\ninner and outer grow bright and clear.\nAfter one thousand ingestions,\nthe Middle Origin’s Perfected Lord manifests in the Crimson Palace,\nthought and recollection take on semblance,\nnow seen, now vanished,\nthe Red Child is secured and strengthened,\nreversing age to regain youth.\nAfter ten thousand ingestions,\nthe root of spirit fills with *qi*,\neach pore receives the true,\nthe stomach and viscera grow fresh and luminous,\nthe ascent reaches the Great Tenuity,\npurple chariots descend,\ndeath is concealed in the Northern Feng,\nlife is recorded in the Southern Palace,\nheaven and earth merge in virtue,\nthe Three Luminaries unite in spirit.\n\n**Golden Chamber’s Life-Delivering, Years-Returning Lower Perfected Jade Talisman**\nOn each day of the Great Year and each *jiazi*,\ninscribe in yellow on white paper,\ningest one talisman facing the Great Year,\nenter the chamber and recite the *Inner True Scripture of the Golden Chamber* once.\nInscribe and ingest the talisman as prescribed.\nAfter one hundred ingestions,\nthe Lower Origin’s hidden gates receive the nine spirits’ moisture,\nthe hundred passages grow bright and clear,\nthe ten thousand *qi* all return,\ninner and outer become thoroughly luminous.\nAfter one thousand ingestions,\nthe Lower Origin’s Perfected Lord takes on semblance and manifests.\nAfter ten thousand, the Way is complete,\neach pore binds spirit,\ndead *qi* wholly dissolves,\nthe entire form becomes immortal,\nthe Highest Perfected is moved above,\nsending down the Jade Dawn,\ndelivering life and returning years,\nsun and moon share a single root,\nsoaring through the Great Void,\nascending into the Emperor’s Dawn.\n\nWhen inscribing the talismans, always face the kingly direction above,\nknock the teeth thirty-six times,\nand raise the prayer:\n*\"Celestial numina flourish in splendor,\nthe nine apertures grow solemn and clear,\nthe five officials and six palaces,\ntheir divine radiance fresh and bright.\nThe Three Origins are filled and secured,\nthe ten thousand *qi* brim and overflow.\nThe Golden Chamber delivers life,\nthe green script reverses aging.\nThrice refined, the nine apertures\nascend into the Great Clarity,\nthe Three Luminaries shine as one,\nheaven and earth merge in union,\nsoaring through the Mysterious Void,\nroaming and feasting in the Purple Court.\"*\n\nConclude, then swallow *qi* forty-six times and cease.\nThen ingest the talisman.\n\nTo practice the Way of Delivering Life and Returning Years,\non each *gui* day of the sixth month,\ndraw one *hu* of Northern Spring water.\nOn the day of your destiny,\ntake one *jin* each of angelica root, peach bark, and [missing character] leaves,\nboil them together until bubbling,\nand bathe at noon.\nWhen about to bathe,\nface your destiny and knock the teeth nine times,\nvisualizing three Jade Lads holding towels to your left,\ntwo Jade Maidens bearing incense to your right,\na canopy of purple clouds and floral hues arrayed before and behind.\nSoftly intone:\n*\"Heaven and earth are thoroughly clear,\nwashing away filth and dust,\nrefining and transforming the nine paths,\nreturning the form to Great Perfection.\nThe hundred passages receive spirit,\neach joint is renewed,\nclarity and emptiness oversee and reflect,\ninner and outer unfold in full.\nThe day is auspicious, the hour favorable,\ndelivering life and returning years.\nJade Lads and Jade Maidens,\nhold towels for me,\nmystic clouds and purple canopy,\nadorn my body,\nthat I may live long,\nheaven and earth sharing a single root.\"*\n\nConclude, then bathe.\nAfter bathing, return to the chamber,\nlie with the head to the east,\napply powder to adorn yourself,\ncovering the entire body.\nRub both palms until warm,\nwipe the face fourteen times,\nand softly intone:\n*\"The *qi* of the Celestial Mystery is clear,\nmy body is already refined.\nDust and filth dissolve and vanish,\nthe nine nines receive spirit,\ntransforming me,\nreturning me to youthful form.\"*\n\nConclude, then draw *qi* thirty-six times and swallow, then cease.\nPracticing this Way for three years,\nthe old form’s skin wholly sheds,\nthe flowery bones regenerate,\nthe body shines with jade light,\nthe face and hair take on a golden countenance.\n\nThis is the wondrous method among all Ways,\nnot to be transmitted to the untrue.\nThose who lightly disclose it will see their seven ancestors tortured,\nendlessly consigned to the offices of ghosts.\nDisciples must practice in secret,\nonly then may they attain immortality.\n\nWhen receiving the Way of Delivering Life and Returning Years,\nfollow the regulations:\nmaster and disciple each observe a nine-day fast,\nor three days, or five,\nand offer silk according to the year’s tally,\none *chi* per year,\nalong with a golden figurine weighing two *liang*, four *zhu*, and one *xing*,\nas a pledge to the Nine Heavens for delivering life,\na token of the transformed body.\nThose who practice without pledging\nwill not draw the Way’s response,\nthought will not awaken spirit,\nviolating regulations and transgressing prohibitions\nwill be examined by the Right Office.\nPractitioners must be clearly cautious.\n\nThe Perfected of Western City transmitted this to Wei Huacun at the Yangluo Palace,\nand now seals one copy within the Yangluo Mountains.\n\nHere ends the *Upper Scripture of the Inner True Three Floral Treasures of the Green Script for Delivering Life and Returning Years in the Golden Chamber of the Cavern-Real*.",
      "overlap_context": "ty.\n\n**Golden Chamber’s Life-Delivering, Years-Returning Upper Perfected Jade Talisman**\nOn each day of your destiny,\ninscribe in green on white paper, facing the kingly direction, and ingest one talisman.\nEnter the chamber and recite the *Inner True Scripture of the Golden Chamber* once.\nInscribe and ingest the talisman as prescribed.\nAfter one hundred ingestions,\nthe Upper Origin flows unimpeded,\nthe hundred passages open bright,\ndead *qi* dissolves and vanishes,\nspirits and numina all return.",
      "start_char": 3005,
      "end_char": 3990,
      "start_sentence": 56,
      "end_sentence": 86,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.137101411819458,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真金房度命绿字回年三华宝曤内真上经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}