{
  "source_id": "洞真太上八素真经登坛符札妙诀",
  "source_file": "chunked_daozang\\洞真太上八素真经登坛符札妙诀.json",
  "total_chunks": 5,
  "total_original_chars": 4997,
  "total_translated_chars": 33492,
  "total_translation_time": 168.27074217796326,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞真太上八素真经登坛符札妙诀.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "*The Supreme Cavern-Perfected Scripture of the Eight Simplicities: Esoteric Instructions for Mounting the Altar, Talismans, and Petitions*\n\nThe Supreme Lord addresses the Celestial Thearchs, the Sagely Sovereigns of Later Ages, the Azure Lad of the Supreme Ministers, and the Perfected of the Great Ultimate, saying: All later students who obtain the precious scriptures of the Great Cavern of the Supreme Perfected—inscribed in golden characters by the Eastern Florescence and recorded in the Highest Clarity—have already cultivated good karmic roots, their merit and honor difficult to surpass. Yet if they do not seek a master to receive the oral instructions, ascend the altar, and cultivate the practice, but merely recite and study without fathoming the source, their efforts will be in vain. Worse, they may invite demonic interference, incur the offense of secretly possessing scriptures, and forfeit any hope of ascending as immortals. Those of sincere aspiration must diligently follow the regulations and submit to a master, receiving the sacred charge to attain the utmost perfection.\n\nHerein are set forth the rites of covenant and revelation, to be transmitted with utmost care—let them never be lightly disclosed. The Celestial Thearchs and all the sagely perfected, in unison, proclaim their approval, bowing their heads in reverence to the command.\n\nIn all covenants and revelations to the spirits, each has its rank and grade. Whether dwelling in mountain forests or the world of mortals, the tokens of faith differ; the days of fasting and assembly vary in number; the submission of petitions and dissolution of the retreat depend on the individual. The progression of master and disciple broadly follows the essentials of this secret Dao.\n\nThe treasured mysteries of heaven and earth, concealed and profound, are not to be transmitted to the divine perfected of the various spirits, nor should they be heard, seen, spoken of, or employed by ordinary men, unlearned novices, or those of meager talent. Only when the world attains Great Peace and worthy ones emerge shall they not be withheld.\n\nThose who obtain the precious scriptures encounter manifold complexities. To summarize the essentials, the causes arise in seven ways:\nFirst, through the radiant numinous forms of spirits, their voices and appearances descending...\nSecond, through encounters with good people, dwelling in mountain caverns in ease and harmony;\nThird, through leisurely wandering or accidental discovery in public or private settings...\n\nFourth, through entering markets or courts, where others come to trade;\nFifth, through ignorance of ritual statutes, secretly grasping at its solemn forms;\nSixth, through single-minded reverence for a master, receiving instruction and transmission;\nSeventh, through family ancestors, passing it down through generations.\n\nThese seven conditions may occur separately or in combination, varying in rank and circumstance, each with its own covenantal rites—transmission by a master being central.\n\nThe proper procedures are as follows:\n\nAscend the Jade Clarity Imperial Altar to pledge vows and transmit the scriptural instructions. The altar shall be twenty-four feet in length and breadth, with four corner gates. Five-colored patterned silks, one bolt each for the five directions; ninety feet of purple silk; ninety feet of azure gauze; nine taels of gold; forty feet of life-destiny silk; five seating mats; one golden fish and one jade dragon; one jade tablet, twelve inches long and two inches four-tenths wide; five ritual boards for the Five Agents; three talismans; five incense fires; one crimson silk kerchief, five feet long; one foot of white silk; one gold ring; five luminous mirrors; fifteen feet of white silk for inscribing the covenant text; the covenant document bound with blue silk and a gold clasp, with twenty feet of crossed sashes in purple and damask patterns.\n\nThe earth-altar shall be of plain silk, matching the imperial altar in dimensions—twenty-four feet in length and breadth—with four corner gates. Five taels of gold shall be placed above, with nine feet of white silk as sashes and three feet two inches of purple silk.\n\nOn the day before the transmission, the recipient shall fast at the altar site. Facing north, he shall knock his teeth nine times and pray aloud:\n\n“Supreme Primordial Sovereign, Numinous Honored One of the Nine Heavens, the Most Real in the distant and profound Jade Pavilion—guided by the revolutions of the Three and Five, the dawns of the Seven Luminaries shifting, the Void Emperor holding the reins, the Jade Emperor determining immortality—on this day of primal auspiciousness, the myriad perfected open the way. Those who ascend to the ranks of the celestial stems, bound by karmic destiny, encounter the divine scriptures, the treasured scrolls of the Supreme Sovereign. Humbly, upon this sacred peak, I pledge vows to the Nine Heavens, petition the Five Emperors and the Twelve River Sources, beseeching registration and receipt. May my plea ascend to the lofty court, universally proclaimed to the ten thousand spirits. Here, upon the imperial altar, defenses are arrayed to dispel trials, following the precedents of the Great Perfected. Tomorrow, at the appointed hour, the transmission shall proceed.”\n\nAt dawn on the day of ascension, thirty paces from the altar, the recipient shall knock his teeth thirty-two times, envisioning purple clouds crowning a mountain and the divine soldiers of the Five Emperors—thousands upon thousands—coming to welcome his person. He shall softly intone:\n\n“The divine perfected roam forth, startling the myriad emperors. The Jade Numinous Mystic Guardians, the wardens of the Five Peaks, the Celestial Soldiers and Mighty Warriors—ten thousand strong—assist the numinous. Summoned from the ten directions, marshaling the heavenly hosts, they descend from the heavens to the imperial court. May I ascend as an immortal, penetrating the essence of the Dao. May I discern the inauspicious, traverse the hidden, and fathom the obscure. All that I face and declare shall align with the Jade Clarity.”\n\nThis completed, he shall ascend the altar.\n\nThe master enters from the northwest, facing northwest to perform nine bows toward the Nine Heavenly Kings, knocking his teeth nine times. He shall softly declare:\n\n“Today, I transmit the Nine Heavens’ Treasured Scripture to Disciple Wang Ding, extending to the Jade Taboo. Having fasted and purified, his qi and destiny harmonize with the Real. I beseech the oversight of the Perfected Immortals and the Jade Taboo. May the Registrar Attendant and the Guardian Marshal of the Numinous descend to witness the covenant in heaven. May all that is petitioned and entrusted swiftly ascend for audience.”\n\nThis completed, he turns to the southeast, bows again, and declares:\n\n“Supreme Primordial Heaven, today I offer the Eight Assemblies’ vows. On this auspicious day and pure hour, humbly upon this sacred peak, I pledge vows to transmit the supreme scripture. I beseech the divine immortals of the Five Emperors to oversee my covenant, that I may swiftly attain immortality, ascend in a flying chariot, and rise to the imperial court.”\n\nThe disciple enters from the southeast below the altar, performs nine bows to the northwest, then two bows to the southeast. Turning north to face the master, he knocks his teeth thirty-six times, first reciting the *Golden Perfected Great Void Chapter* once to subdue the myriad demons.\n\nThis chapter derives from the *Golden Perfected Jade Radiance Scroll*. Without receiving the *Supreme Clarity Jade Radiance*, one may not recite this text.\n\nThe celestial essence rides the void, startling the divine court.\nEntrusted to the immortal’s chant, it transforms into the nameless.\nHow tumultuous the clamorous qi, the defiled Dao arising along the path!\nWithin the clouds, the Crimson Palace; the Northern Emperor deploys his divine soldiers.\nThe drum resounds from the ocean of wisdom, the mysterious workings come to welcome.\nThe lofty scenes feast upon flying reins, swift chariots inspect the cloud encampments.\nHastening to collate the Northern Emperor’s register, seizing the names of the demonic hordes.\nThe *Huoluo* unfurls the celestial net, wielding might to cast the ringing bells.\nNow the perfected capture the empty cavern, the jade radiance illuminating the eight darknesses.\nThe Golden Mystery guards the supreme palace, the divine tiger slays the celestial essence.\nSevering the myriad demonic qi, billions upon billions all leveled.\nUpholding the trust of the Nine Heavens, all is overthrown at my whistled command.\nSummoning the perfected to fathom the Three Caverns, wisdom recitation clears the eyes.\nGazing upon the eight paths of the mysterious radiance, seven revolutions weave the celestial scriptures.\nMerging with the imperial unity of the Real, delivering the seven generations of ancestors.\nEradicating the roots of the five sufferings, the returned soul receives renewed glory.\nThe golden radiance shines upon the quiescent, the divine candle naturally kindles.\nFragrant blossoms scatter in the jade palace, misty qi penetrates the Jade Capital.\nThe Emperor dispatches the lingering chariot, the Three Origins descend in green carriages.\nSwift chariots soar through the Nine Mysteries, paying homage at the Jade Emperor’s court.”\n\nUpon completing the *Great Void Chapter*, the disciple faces east, knocks his teeth thirty-six times, and intones:\n\n“Supreme Three Heavens’ Primordial Qi of the Mysterious Origin, Most High Lord Lao, summon forth from within my person the Void-and-Spontaneous Flying Immortal Attendants, the Divine Immortal Envoys, the Left and Right Flying Dragons, the Great Perfected Jade Maidens, and the Direct Talismans of the Five Emperors—thirty-six each—to report to the local earth deities and true officials. As I now burn incense, may my petition swiftly reach the boundless Jade Emperor and the Most High Perfected before the myriad sages.”\n\nThis completed, he faces north, knocks his teeth twenty-four times, and exits the *Supreme Clarity Office*.\n\nWithout receiving the *Supreme Clarity Three Origins Jade Inspection*, one may not exit this office.\n\n“Reverently, I summon from within my person:\nThe Void-and-Spontaneous Left and Right Jade Void Attendants, twenty-four each;\nThe Void-and-Spontaneous Five Emperors of the Great Perfected, twenty-four each;\nThe Void-and-Spontaneous Left and Right Jade Immortal-Guiding Attendants, twenty-four each;\nThe Nine Mysteries’ Void-and-Spontaneous Flying Dragon Attendants, twenty-four each;\nThe Upper Origin Attendants, twenty-four each;\nThe Middle Origin Attendants, twenty-four each;\nThe Lower Origin Attendants, twenty-four each;\nThe *Supreme Clarity Jade Void* Flying Immortal Envoys, twenty-four each;\nThe Divine Immortal Envoys, twenty-four each;\nThe Jade Immortal Envoys, twenty-four each;\nThe Great Immortal Envoys, twenty-four each;\nThe Upper Origin Envoys, twenty-four each;\nThe Middle Origin Envoys, twenty-four each;\nThe Lower Origin Envoys, twenty-four each;\nThe *Jade Clarity Golden Dawn* Jade Lads, twenty-four each;\nThe *Jade Clarity Great Florescence* Jade Maidens, twenty-four each.”\n\nThose who emerge do so with solemn dignity, clad in immortal robes, their majesty and decorum perfectly composed as they stand arrayed before the minister.\n\nThe Jade Void Attendant Ministers wear soaring-dark-jade crowns, robes of nine-colored dragon-patterned tiger-skins, and wield the Banner of Commanding Demons, standing to the left.\n\nThe Five Thearchs’ Supreme Perfected wear Primordial Dawn Jade Crowns, five-colored flying-immortal feathered robes, and nine-colored pennants, standing to the right.\n\nThe Flying Dragon Attendants wear Level-Heaven Jade Crowns, nine-colored phoenix robes, tiger-script belts, and hold the Talismans of Summoning Spirits, positioned above.\n\nThe Three Origins Attendants wear Nine Origins Vermilion Yang Jade Crowns, three-colored feathered robes, belts of flowing-gold fire-bells, and wield the Statutes of Seizing and Slaying, standing below.\n\nThe Flying Immortal Envoys wear Soaring Heaven Jade Crowns, nine-colored variegated-patterned robes, and hold golden talismans with banners raised before them.\n\nThe Divine Immortal Envoys wear Vermilion Yang Jade Crowns, flying-immortal feathered robes, jade tablets in hand, and bear standards behind them.\n\nThe *Great Void’s Spontaneous Celestial-Auxiliary Immortal Flying Dark Cavalry*, nine hundred million myriad in number;\nThe *Celestial-Auxiliary Perfected Flying Ascending Cavalry*, nine hundred million myriad in number;\nThe *Celestial-Auxiliary Divine Flying Marching Cavalry*, nine hundred million myriad in number;\nThe *Celestial-Auxiliary Thearch Ascending Void Cavalry*, nine hundred million myriad in number;\nThe *Celestial-Auxiliary Spirit Ascending Void Cavalry*, nine hundred million myriad in number;\nThe *Great Void’s Spontaneous Five Thearchs’ Flying Immortal Sky-Strategizing Cavalry*, nine hundred million myriad chariots;\nThe *Great Void’s Spontaneous Flying Immortal Ascending Void Cavalry*, nine hundred million myriad chariots;\nThe *Spontaneous Flying Jade-Feather Canopy Bridle-Holding Cavalry*, nine hundred million myriad chariots;\nThe *Spontaneous Flying Green Carriage Bridle-Holding Cavalry*, nine hundred million myriad chariots;\nThe *Spontaneous Celestial-Regulating Earth-Commanding Dragon Ascending Cavalry*, nine hundred million myriad chariots;\nThe *Spontaneous Summoning Perfected Zhi-Mushroom Jade Immortal Clerks*, nine hundred million myriad in number;\nThe *Spontaneous Divine Elixir Birth Immortal Clerks*, nine hundred million myriad in number;\nThe *Spontaneous Golden Perfected Flowing Light Radiant Lightning Cavalry*, nine hundred million myriad in number;\nThe *Spontaneous Yin Essence Cloud-Raising Rain-Descending Cavalry*, nine hundred million myriad in number;\nThe *Yang Brightness Shining Summons-qi Pursuing Lightning Cavalry*, nine hundred million myriad in number;\nThe *Spontaneous Cloud Gate Banner-Holding Commanding Light Cavalry*, nine hundred million myriad in number—\nall these divine immortal troops and cavalry assemble and encamp, stationed before, behind, left, and right of the minister, arrayed in ordered ranks.\n\nSpontaneous five-colored flowing rosy clouds and purple mists, nine hundred million myriad layers;\nSpontaneous Five Thearchs’ flying wheels and flowing mists, nine hundred million myriad layers;\nFive-colored flying jade-feather canopies, nine hundred million myriad layers;\nFive Peaks’ five-colored flying carriages, nine hundred million myriad layers—\nenvelop the minister’s form, streaming essence and dispersing qi, filling the ten directions, encircling heaven and covering earth, guarding and protecting the minister’s body.\n\nOnce the solemn proceedings conclude, the feathered-node-bearing flying immortal jade lads hold aloft jade tables suspended in the void, positioned before the minister, receiving the words from the minister’s mouth to distinguish and report to the celestial officials, earth deities, and gods of the four directions, central quarters, ten directions, Five Peaks, Four Waterways, Nine Rivers, Eight Poles, famous mountains, great marshes, Five Thearchs’ Perfected Officials, Four Departments’ Inspectors, Nine Divisions’ Examiners and Summoners, Primordial Qi’s *Jiazi* Official Lords, boundless, measureless, depthless, heightless, fathomless, obscure or manifest, innumerable Perfected Officials; infusing qi into the Qian Sovereign’s Nine Palaces, Eight Trigrams, Six *Jia* Perfected Ones; the Void’s Direct Servants, Five Peaks’ Flying Immortals, divine dragon feathered cavalry.\n\nThe qi ascends to report to the Primordial Origin August Supreme High Void Jade Emperor, the Nine Heavens’ Venerable One;\nthe Primordial Origin Three Heavens’ Jade Lads, Supreme Numinous Perfected Kings;\nthe Highest Myriad Immortals’ Fusang Great Emperor;\nthe Supreme Great Dao Jade Dawn Lord;\nthe Three Origins Southern Culmen Prohibited Lord;\nthe Golden Watchtower Posterior Sage Emperor Lord;\nthe Eastern Florescence Azure Lad;\nthe Four Poles’ Perfected Ones;\nthe Thirty-Nine Emperors;\nthe Twenty-Four Perfected;\nthe Supreme Clarity Primordial Origin Upper Three Heavens’ Boundless Great Dao;\nthe Supreme Lord Lao;\nthe Supreme Venerable One;\nthe Heavenly Elder Emperor Lord;\nthe Nine Elders’ Immortal Capital Lord;\nthe Nine Qi Venerable One;\nthe Boundless Supreme Unity Emperor Lord—\nand the hundred thousand myriad layers of Dao-qi, the twelve hundred official lords, the Supreme Clarity Jade Steps’ Celestial Immortals, Divine Immortals, Flying Immortals, Five Thearchs’ Immortal Lords, Great Florescence Perfected Ones.\n\nThe minister, by karmic affinity and accumulated blessings, has endured the kalpas of the Nine Heavens, revolving without extinction, favored by fortune to be born into the Dharma-gate. Formerly, through the grace of former sagely perfected ones, he was uplifted and guided, his ignorance dispelled, and the supreme methods revealed to him—the Great Secrets of the Nine Heavens, the Three Caverns’ Treasured Scriptures, Jade Talismans, Numinous Writings, Cinnabar Scripts in Purple Characters, Flying Void Step Chapters—ascending the imperial altar to report and command the Nine Heavens. Over the years, as celestial cycles shifted and the imperial Dao’s destiny unfolded, the Dharma was to be transmitted to later disciples, those with predestined immortal names and destined for transcendence. The numinous texts are secret and weighty; they dare not be withheld, nor lightly transmitted. According to the stipulated time limits, should the kalpas turn, even the most devoted scholars might forever lack the affinity, their aspirations cut off, their efforts in vain. Yet when the Primordial Origin opens the transformation, it is rare to encounter the right person—thus, by the principles of the mysterious statutes, when the encounter aligns, the transmission is granted.\n\nNow there is the Master of Such-and-Such Peak, Wang of *Jia* clan, whose accumulated blessings and surplus fortune have met with this era of flourishing prosperity. By karmic good fortune, he was born in this sagely age, favored by the Supreme to have his name inscribed in the imperial records, to partake in the great Dharma, and to recite the Jade Scriptures. Over the years, he has cast aside worldly attachments, forgotten his shadow, and entrusted his aspirations to secluded peaks, calming his spirit in mountain caves, contemplating the numinous and meditating on qi. Yet his understanding remains shallow and narrow, and he has not yet mastered all matters. Now, he again approaches the minister, observing a seven-day purification fast, submitting his vows and oaths, seeking completion and establishment. He erects the imperial altar, reports to the Nine Heavens, and receives the Supreme Clarity’s Treasured Secrets and Jade Scriptures—all such matters as required. With faith and oaths fully prepared, all in accordance with the statutes and methods, the minister then escorts him to ascend the numinous mountain, reporting to the Five Peaks and Five Thearchs, and announcing to the Nine Heavens to transmit the teachings to him.\n\nHe pledges to observe silence in his practice, never to be negligent, never to reveal the true texts, nor to violate the statutes or transgress the precepts. Should he do so, his seven generations of ancestors will be examined, and his own person will be delivered to the ghostly officials.\n\nHaving examined his conduct and guarded the statutes, his person shall attain to flight as an immortal. With reverence, this is reported, and the transmission must be conferred with due ceremony.\n\nUpon exiting the official precinct, the master administers the covenant, the taboo names, and the scriptures and talismans. The master stands facing north, holding the scripture in his left hand. He knocks his teeth thirty-six times, visualizing the Most High Jade Emperor, causing the light of sun and moon to flank and illuminate both master and disciple. He recites the incantation:\n\nHow vast and distant is the Great Subtlety,\nTrue persons bind their lives to emptiness.\nThe celestial ford naturally opens,\nAssembling the Great Cavern Scripture.\nTrue worthies uphold the Dharma with faith,\nRiding the cycles through the Yellow Court.\nGuard its secrecy through kalpas of years—\nShould one reveal it carelessly, hell’s torments await,\nWith scourging extended to seven generations of ancestors,\nAnd wind-knives to dissect your very form.\n\nThe master holds the scripture in his left hand, while the disciple holds the pledge in his right. Together, they face heaven and softly intone:\n\nIssuing from the Four Poles’ luminous statutes,\nWe report above to the Lofty Mysterious,\nTo the myriad emperors of the Void and Subtle.\nIn this world, we vow to hold fast without wavering.\nDare we report to the luminous statutes,\nTo examine all transgressions.\nThe Jade Scripture and Treasured Secrets\nAre all as the statutes’ majesty decrees.\nAfter the transmission of this body,\nAll qi shall be wholly returned.\nMay we long preserve Heaven and Earth,\nWith the Three Luminaries shining as one.\nShould any dare to reveal them,\nThey shall forever forfeit the Four Transgressions.\n\nThis done, the disciple places the pledge to receive the scripture, bowing nine times toward the north. The disciple presents the pledge of the Dharma, and the master accepts the token. The disciple points with his left hand to the northwest, receives the scripture with his right, then turns to the southeast, standing with his back to the west. Proceeding southward in order, he takes the Heavenly Gate, and buries the talisman to erase his traces.\n\nIf both the purple and plain silk sashes are to be received together, before turning south, the purple and plain may be separated, as there are separate rites for each.\n\nThe master stands at the northeast, knocks his teeth thirty-six times, and raises his gaze to pray:\n\nThe Nine Heavens’ Cavernous Radiance,\nThe Mysterious Talismans shine brightly.\nAbove, one studies the celestial stems,\nClad in refined qi-essence.\nSelected as the August Minister,\nOne connects with the myriad spirits.\nThe Jade Emperor oversees the position,\nAttending the divine court of immortals.\nThe Three Palaces of Fengdu\nExamine and restrain demonic soldiers.\nThe Four Offices and Five Emperors\nExecute and destroy Jia Sheng.\nBrightly overseeing the Nine Treasuries,\nThey strike out the celestial stem names.\nSoaring in transformation, concealing the body,\nOne borrows the earth to hide the form,\nWith a lifespan equal to the Three Luminaries,\nAnd the Nine Origins merging as one.\n\nThis done, he takes twenty-four single steps to the disciple’s rear, at the Earthly Door, and recites another incantation:\n\nTreading the Five Peaks,\nOne grasps the Mysterious Mechanism.\nSoaring through the Nine Voids,\nExiting the hidden, entering the subtle,\nLightly pacing the cloud steps,\nSwiftly transforming with radiant speed,\nThe Golden Perfected shines with light,\nThe Heavenly Pass brightly opens.\nClad in the Emperor’s insignia,\nFlying in azure feathered robes,\nThe Five Spirits oversee and illuminate,\nDeparting without delay or hindrance,\nFor kalpas of eons,\nForever parting from worldly separation.\n\nThis done, he buries the *Soaring Heaven Concealment Talisman* beneath the disciple’s left foot. The disciple then takes twenty-four single steps to the southwest corner, standing at the Human Door, and prays:\n\nDissolving the form at the August Altar,\nTransforming traces to enter the void,\nErasing the luminous shadow at the numinous peak,\nSwiftly traversing the Great Void,\nSoaring through heaven, borrowing the earth,\nMerging with the ten directions,\nClosing what cannot be opened,\nSevering what cannot be turned,\nThe Most High Jade Emperor,\nGreat King of the Nine Heavens,\nHaving overseen the divine illumination,\nShall forever receive worldly reverence.\nWe report the covenant at the August Altar,\nPassing beyond the numinous peaks,\nShedding traces from the Three Paths,\nAscending to the Jade Capital.\n\nThis done, he buries the *Borrowing Earth Dissolving Form Talisman* beneath the disciple’s right foot. Next, he takes thirty-nine single steps to the northwest corner, standing at the Heavenly Gate. The master recites another incantation:\n\nSetting forth from the Earthly Door,\nClouds traverse the Heavenly Gate.\nThree revolutions, nine refinements,\nThe luminous Dao alone divides.\nReporting the covenant at the numinous peaks,\nRiding the cycles, turning the wheel,\nJade chariots linger,\nReining the clouds, holding the reins,\nThe Five Mornings flank the clouds,\nSurveying the shadows of the Seven Origins.\nDissolving the form, borrowing the earth,\nClad above in the Three Passes,\nPaying homage at the Golden Gates,\nAbiding with the Emperor forever.\n\nThis done, he buries the *Soaring Heaven Talisman* at the left trace and the *Borrowing Earth Talisman* at the right trace.\n\nThe rites completed, the master and disciple stand at the Gate of the Nine Heavens. With azure silk binding the golden clasp, they report to the numinous and depart, exiting through the northwest Gate of the Nine Heavens. The disciple, upon exiting, takes the fish and dragon and casts them into the mountain crags. Facing due north, he knocks his teeth nine times and reports his covenant to the Nine Heavens, reciting the incantation:\n\nThe Great Morning’s Mysterious Removal,\nThe Nine Mysterious’ profound secrecy,\nVermilion radiance oversees and illuminates,\nThe myriad spirits refine their essences.\nThe Three Cycles shift and change,\nThe moon revolves, the sun circuits.\nAt this time, we open and declare,\nWith primal felicity and auspiciousness.\nAscending the altar’s lofty peak,\nConcealing in the luminous grotto,\nAbove, we pledge to the Nine Heavens,\nIn the center, we open the Eternal One,\nBelow, we report to the numinous mountains,\nForever completing the myriad spirits.\nLightly transmitting the world’s treasures,\nForever parting from the Seven Mysteries.\nShould one violate the master or betray the covenant,\nForm and shadow shall be destroyed,\nSuffering the Three Paths and Five Torments,\nFor ten thousand kalpas, never to escape.\nHaving examined the covenant text,\nWe inscribe the name on the Jade Tablet,\nPraying for swift ascension and transmission,\nSoaring in body to the Emperor’s chambers.\n\nThis done, he casts the objects into the mountain crags.\n\nThe two talismans—inscribed in azure on white silk—are buried at the Heavenly Gate, beneath the recipient’s two traces. At the Earthly Door, the *Soaring Heaven Talisman* is buried beneath the disciple’s left foot. At the Human Door, the *Borrowing Earth Talisman* is buried beneath the disciple’s right trace. The disciple places the *Life-Stabilizing Silk* over his original destiny, with the *Five Emperors’ Silk* of corresponding colors placed at the five directions, and the covenant pledge placed at the center. The *Five Covenant Mirrors* stabilize the Five Emperors, restraining the heavenly demons. Without these stabilizing silks, the spirits of the Five Peaks will not accept the disciple’s covenant.\n\nThe Perfected Lord of the Western City copied the essential statutes of the *Great Perfection* at Yangluo, passing through the Lady of the Southern Peak. Only the *Soaring Heaven* and *Borrowing Earth* talismans are transmitted orally, their secrets passed mouth to mouth. For receiving this method, there are separate covenant statutes in the *Great Perfection* texts.\n\nWhen the master ascends the altar, he should present the *Five Emperors’ Petitioning Talismans*, using the disciple’s pledge to stabilize the five directions, covenanting with the Nine Heavens and pledging to the Five Spirits. A five-chi scarlet silk kerchief is placed before him to invite the scripture. The master faces north to read the taboo names of transmission, while the disciple faces east, prostrating to receive them. When the covenant rites are completed, the disciple faces north, bows nine times, and kneels nine times, then raises his head to swallow the nine qi. This done, he departs.\n\nThe master should bury the golden fish, jade dragon, and jade tablet in a sheer cliff. As he buries them, he faces north, knocks his teeth thirty-six times, and softly recites the incantation:\n\nThe Eight Luminaries of Heaven’s Origin, the Nine Mysteries seal the Perfected, the Three Radiances align with the appointed time—on this day, the offerings are set forth, the Celestial Thearch receives and heeds, the command is proclaimed to the numinous mountains, the Three Bureaus and Nine Offices, the Twelve River Sources. Record the disciple’s name in the registers, that he may forever attain immortality, sit awaiting the dragon carriage, ride the flying chariot amid purple mist, ascend to the heights, and pay court to the Jade Dawn.\n\nThis done, bury the fish, dragon, and tablet in the Dark Valley.\n\nThe Nine Heavens proclaim the command to the Eastern Peak’s Azure Numinous Myriad Immortals Palace, charging its guardians to shield Master So-and-so’s person as he ascends the covenant, receives the transmission of the Perfected, and is recorded in the Azure Palace. Bowing and rising, dispatch the Nine White Thearch Immortal Officers to attend and serve, to welcome him as one entrusted with the Nine Heavens’ pledge.\n\nInscribe this in cinnabar on a wooden board, place it facing south to guard the Eastern Peak’s numinous officials, with nine attending immortal officers in service.\n\nThe Nine Heavens proclaim the command to the Southern Peak’s Vermilion Numinous Myriad Immortals Palace, charging its guardians to shield Master So-and-so’s person as he ascends the covenant, receives the transmission of the Perfected, and is recorded in the Azure Palace. Bowing and rising, dispatch the Nine Red Thearch Immortal Officers to attend and serve, to welcome him as one entrusted with the Nine Heavens’ pledge.\n\nInscribe this in white on a wooden board, place it facing west to guard the Western Peak’s numinous officials, with nine attending immortal officers in service.\n\nThe Nine Heavens proclaim the command to the Western Peak’s White Numinous Myriad Immortals Palace, charging its guardians to shield Master So-and-so’s person as he ascends the covenant, receives the transmission of the Perfected, and is recorded in the Azure Palace. Bowing and rising, dispatch the Nine White Thearch Immortal Officers to attend and serve, to welcome him as one entrusted with the Nine Heavens’ pledge.\n\nInscribe this in white on a wooden board, place it facing west to guard the Western Peak’s numinous officials, with nine attending immortal officers in service.\n\nThe Nine Heavens proclaim the command to the Northern Peak’s Black Numinous Myriad Immortals Palace, charging its guardians to shield Master So-and-so’s person as he ascends the covenant, receives the transmission of the Perfected, and is recorded in the Azure Palace. Bowing and rising, dispatch the Nine Black Thearch Immortal Officers to attend and serve, to welcome him as one entrusted with the Nine Heavens’ pledge.\n\nInscribe this in black on a wooden board, place it facing north to guard the Northern Peak’s numinous officials, with nine attending immortal officers in service.\n\nThe Nine Heavens proclaim the command to the Central Peak’s Yellow Numinous Myriad Immortals Palace, charging its guardians to shield Master So-and-so’s person as he ascends the covenant, receives the transmission of the Perfected, and is recorded in the Azure Palace. Bowing and rising, dispatch the Nine Yellow Thearch Immortal Officers to attend and serve, to welcome him as one entrusted with the Nine Heavens’ pledge.\n\nInscribe this in yellow on a wooden board, place it at the center to guard the Central Peak’s numinous officials, with nine attending immortal officers in service.\n\nThese five talismans are the Jade Thearch of the Supreme Sovereign’s decrees, the Proclamation Talismans to the Numinous Perfected. When ascending the Jade Clarity Imperial Altar, inscribe the talismans and position them according to the method. The master stands at the center to command the covenant of the Four Poles.\n\nThis done, bury the talismans at the Five Peaks.\n\nFor the Great Covenant Transmission, cast the golden dragon, jade fish, and jade tablet, with the text inscribed as follows:\n\nOn the first day of such-and-such a month in such-and-such a year, Master So-and-so of such-and-such a peak, aged so many years, born in such-and-such a month, his fate governed by such-and-such a Dipper and such-and-such an Imperial Lord, respectfully proclaims his oath to the Nine Heavens upon the sheer cliff of the Dark Peak’s lofty mountain. Having received the ninety-one fascicles of scripture, the *Luminous Ordinances of the Four Poles and Supreme Perfected*, and the *Ordinances of the Nine Heavens’ Registers*, he pledges to uphold the Dao and the Perfected, beseeching that his name be inscribed on the Purple Tablet and recorded in the Azure Palace. Should he violate this covenant or betray this oath, he dares not aspire to immortality.\n\nInscribe this in cinnabar on a jade tablet, one foot two inches in length and two inches four fen in width. When the reading is complete, bury it in the shadowed side of the sheer cliff.\n\nHere ends the *Esoteric Ordinances of the Altar Talismans and Tablets of the Supreme Perfected’s Eight Pure Scriptures of the Cavernous Perfected*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真太上八素真经登坛符札妙诀 经名：洞真太上八素真经登坛符朮妙诀。 撰人不祥，约出於东晋南期。 原为《八素真经诀》之一，后分出单行。 一卷。 底本出处：《正统道藏》正一部。 洞真太上八素真经登坛符札妙诀 太上告诸天帝王、后圣帝君、上相青童、太极真人曰：凡后学之士，得见上真大洞宝经，皆东华书名，金字上清，先缘己善，贵重难胜。 而不寻师受诀，登坛修行，徒欲诵习，不测本源，劳而无益，更致魔干，犹致窃经之罪，无升仙之期。 有志之子，必务依科从师，受旨以成至真。 今故标出告盟之仪，谛传其人，慎勿轻泄。 诸天帝王、一切圣真，同时称善，稽首奉命。 凡盟约告灵，各有阶品，山林在世，信物不同，斋集日数，多少亦异，结斋投辞，事源随人，师徒进止，大略依此秘道之要。 天地宝珍幽隐、不传诸神真，非凡夫末学，少才之人所宜闻，所宜见，所宜言，所宜用，则太平得贤勿闭。 凡得宝经，参差多绪，大要言之，其因有七：一者神灵光像，声形降□； 二者善人相逢，山洞容与； 三者从容散逸，公私误得；",
      "translated_text": "*The Supreme Cavern-Perfected Scripture of the Eight Simplicities: Esoteric Instructions for Mounting the Altar, Talismans, and Petitions*\n\nThe Supreme Lord addresses the Celestial Thearchs, the Sagely Sovereigns of Later Ages, the Azure Lad of the Supreme Ministers, and the Perfected of the Great Ultimate, saying: All later students who obtain the precious scriptures of the Great Cavern of the Supreme Perfected—inscribed in golden characters by the Eastern Florescence and recorded in the Highest Clarity—have already cultivated good karmic roots, their merit and honor difficult to surpass. Yet if they do not seek a master to receive the oral instructions, ascend the altar, and cultivate the practice, but merely recite and study without fathoming the source, their efforts will be in vain. Worse, they may invite demonic interference, incur the offense of secretly possessing scriptures, and forfeit any hope of ascending as immortals. Those of sincere aspiration must diligently follow the regulations and submit to a master, receiving the sacred charge to attain the utmost perfection.\n\nHerein are set forth the rites of covenant and revelation, to be transmitted with utmost care—let them never be lightly disclosed. The Celestial Thearchs and all the sagely perfected, in unison, proclaim their approval, bowing their heads in reverence to the command.\n\nIn all covenants and revelations to the spirits, each has its rank and grade. Whether dwelling in mountain forests or the world of mortals, the tokens of faith differ; the days of fasting and assembly vary in number; the submission of petitions and dissolution of the retreat depend on the individual. The progression of master and disciple broadly follows the essentials of this secret Dao.\n\nThe treasured mysteries of heaven and earth, concealed and profound, are not to be transmitted to the divine perfected of the various spirits, nor should they be heard, seen, spoken of, or employed by ordinary men, unlearned novices, or those of meager talent. Only when the world attains Great Peace and worthy ones emerge shall they not be withheld.\n\nThose who obtain the precious scriptures encounter manifold complexities. To summarize the essentials, the causes arise in seven ways:\nFirst, through the radiant numinous forms of spirits, their voices and appearances descending...\nSecond, through encounters with good people, dwelling in mountain caverns in ease and harmony;\nThird, through leisurely wandering or accidental discovery in public or private settings...",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 431,
      "start_sentence": 0,
      "end_sentence": 16,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.83259916305542,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八素真经登坛符札妙诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "四者出入市朝，或人来货； 五者未识法科，窃略威仪； 六者精心崇师，启告传授； 七者家亲祖宗，传世相付。 凡此七条，或分或合，或上或下，各有盟法，师传为中。 正科如左： 登玉清皇坛，告盟度经诀。 坛广长二丈四尺，开四角门，五方纹缯各一疋，紫纹九十尺，青罗九十尺，上金九两，本命缯四十尺，五座席，金鱼、玉龙各一枚，玉札一枚，长一尺二寸，广二寸四分，五行板五枚，书符三方，五香火，绯罗巾一枚五尺，白素一尺，金环一枚，五明镜，白素一丈五尺，书箓盟文，青丝缠金钮，交带紫纹、纹二十尺。 地户素坛，同广长二丈四尺，开四角门，上金五两，白纹九尺为带，紫纹三尺二寸。 明日度事，尚宿於坛所，北向叩齿九通，仰祝曰： 高上元皇，九天灵尊，上真玄遐、邈幽琼轩，三五运推，七宿改晨，虚皇控辔，玉帝定仙，青宫简箓，符命灵山，是日元吉，万真开陈，上学甲乙，宿命因缘，得遇神经，上皇宝篇，谨於玄岳，上盟九天，上告五帝，十二河源，乞丐记领，奏上高晨，普告万灵，浮位皇坛，营卫灭试，按如太真，须到明日，以合当传。 明日登坛之时，未至坛所三十步，叩齿三十二通，思紫云覆冠一山，五帝神兵千万人来迎兆身，便微咒曰： 神真出游，万帝骇惊，玉灵玄卫，五岳司迎，天丁力士，万不辅灵，命召十方，驱策天兵，率天以下，咸到皇庭，令我登仙，洞得道精，审知不祥，通幽究冥，所向所陈，悉合玉清。 毕，乃登坛。 师从西北入坛之上，向西北九拜，朝九天王，叩齿九通。 〔微启曰〕： 今传弟子王甲九天宝经，上至玉讳。 清宿斋奏，气命合真，乞愿下监，真仙玉讳。 典录侍郎，卫灵司马，下监盟天，所启所付，早得上闻。 毕，还向东南，再拜又启： 高上元始天，今上愿八会，日吉时清，谨於玄岳，盟度上经，乞丐告下，五帝灵仙，监臣盟誓，早得神仙，得乘飞軿，上升帝庭。 弟子从东南入於坛下，西北九拜，向东南再拜，还北面南向仗师，北向叩齿三十六通，先诵金真太空章一遍，以制万魔。 此章出金真玉光卷中。 不受上清玉光，不得诵此篇。 天精乘空发，万精骇神庭。 托仙谣歌章，随变入无名。 嚣气何纷纭，秽道当涂生。 云中舍朱宫，北帝踊神兵。 鼓洋自智道，玄运来相迎。 上景宴飞辔，迅驾检云营。 促校北帝箓，收摄群魔名。 豁落张天罗，放威掷流铃。 今真捕空洞，玉光焕八冥。 金玄守上宫，神虎戮天精。 剪灭万妖气，亿亿悉齐平。 上承九天信，啸命靡不倾。 招真究三洞，慧诵眼且清。 八道望玄霞，七转纬天经。 混合帝一真，拔度七祖程。 削灭五苦根，反魂更受荣。 金光耀寂至，神烛自然生。 华香散玉宇，烟气彻玉京。 帝遣徘徊辇，三元降绿軿，迅驾腾九玄，朝礼玉皇庭。 诵太空章毕，东向叩齿三十六通，咒曰： 无上三天玄元始气太上老君，召出臣身中虚无自然飞仙功曹、神仙使者、左右飞龙、太真玉女、五帝直符，各三十六人出，关启此间土地真官正神，臣今正尔烧香，愿所启速达无极玉帝至真高上万圣几前。 毕，向北叩齿二十四通，出上清官。 不受上清三元玉检，不得出此官。 谨出臣身中虚无自然左右玉虚侍郎各二十四人，出混沌自然五帝太真各二十四人，出混沌自然左右领仙玉郎各二十四人，出九玄虚无飞龙功曹各二十四人，出上元功曹各二十四人，出中元功曹各二十四人，出下元功曹各二十四人，出上清玉虚飞仙使者各二十四人，出神仙使者各二十四人，出玉仙使者各二十四人，出太仙使者各二十四人，出上元使者各二十四人，出中元使者各二十四人，出下元使者各二十四人，出玉清金晨玉童各二十四人，出玉清太华玉女各二十四人出。",
      "translated_text": "Fourth, through entering markets or courts, where others come to trade;\nFifth, through ignorance of ritual statutes, secretly grasping at its solemn forms;\nSixth, through single-minded reverence for a master, receiving instruction and transmission;\nSeventh, through family ancestors, passing it down through generations.\n\nThese seven conditions may occur separately or in combination, varying in rank and circumstance, each with its own covenantal rites—transmission by a master being central.\n\nThe proper procedures are as follows:\n\nAscend the Jade Clarity Imperial Altar to pledge vows and transmit the scriptural instructions. The altar shall be twenty-four feet in length and breadth, with four corner gates. Five-colored patterned silks, one bolt each for the five directions; ninety feet of purple silk; ninety feet of azure gauze; nine taels of gold; forty feet of life-destiny silk; five seating mats; one golden fish and one jade dragon; one jade tablet, twelve inches long and two inches four-tenths wide; five ritual boards for the Five Agents; three talismans; five incense fires; one crimson silk kerchief, five feet long; one foot of white silk; one gold ring; five luminous mirrors; fifteen feet of white silk for inscribing the covenant text; the covenant document bound with blue silk and a gold clasp, with twenty feet of crossed sashes in purple and damask patterns.\n\nThe earth-altar shall be of plain silk, matching the imperial altar in dimensions—twenty-four feet in length and breadth—with four corner gates. Five taels of gold shall be placed above, with nine feet of white silk as sashes and three feet two inches of purple silk.\n\nOn the day before the transmission, the recipient shall fast at the altar site. Facing north, he shall knock his teeth nine times and pray aloud:\n\n“Supreme Primordial Sovereign, Numinous Honored One of the Nine Heavens, the Most Real in the distant and profound Jade Pavilion—guided by the revolutions of the Three and Five, the dawns of the Seven Luminaries shifting, the Void Emperor holding the reins, the Jade Emperor determining immortality—on this day of primal auspiciousness, the myriad perfected open the way. Those who ascend to the ranks of the celestial stems, bound by karmic destiny, encounter the divine scriptures, the treasured scrolls of the Supreme Sovereign. Humbly, upon this sacred peak, I pledge vows to the Nine Heavens, petition the Five Emperors and the Twelve River Sources, beseeching registration and receipt. May my plea ascend to the lofty court, universally proclaimed to the ten thousand spirits. Here, upon the imperial altar, defenses are arrayed to dispel trials, following the precedents of the Great Perfected. Tomorrow, at the appointed hour, the transmission shall proceed.”\n\nAt dawn on the day of ascension, thirty paces from the altar, the recipient shall knock his teeth thirty-two times, envisioning purple clouds crowning a mountain and the divine soldiers of the Five Emperors—thousands upon thousands—coming to welcome his person. He shall softly intone:\n\n“The divine perfected roam forth, startling the myriad emperors. The Jade Numinous Mystic Guardians, the wardens of the Five Peaks, the Celestial Soldiers and Mighty Warriors—ten thousand strong—assist the numinous. Summoned from the ten directions, marshaling the heavenly hosts, they descend from the heavens to the imperial court. May I ascend as an immortal, penetrating the essence of the Dao. May I discern the inauspicious, traverse the hidden, and fathom the obscure. All that I face and declare shall align with the Jade Clarity.”\n\nThis completed, he shall ascend the altar.\n\nThe master enters from the northwest, facing northwest to perform nine bows toward the Nine Heavenly Kings, knocking his teeth nine times. He shall softly declare:\n\n“Today, I transmit the Nine Heavens’ Treasured Scripture to Disciple Wang Ding, extending to the Jade Taboo. Having fasted and purified, his qi and destiny harmonize with the Real. I beseech the oversight of the Perfected Immortals and the Jade Taboo. May the Registrar Attendant and the Guardian Marshal of the Numinous descend to witness the covenant in heaven. May all that is petitioned and entrusted swiftly ascend for audience.”\n\nThis completed, he turns to the southeast, bows again, and declares:\n\n“Supreme Primordial Heaven, today I offer the Eight Assemblies’ vows. On this auspicious day and pure hour, humbly upon this sacred peak, I pledge vows to transmit the supreme scripture. I beseech the divine immortals of the Five Emperors to oversee my covenant, that I may swiftly attain immortality, ascend in a flying chariot, and rise to the imperial court.”\n\nThe disciple enters from the southeast below the altar, performs nine bows to the northwest, then two bows to the southeast. Turning north to face the master, he knocks his teeth thirty-six times, first reciting the *Golden Perfected Great Void Chapter* once to subdue the myriad demons.\n\nThis chapter derives from the *Golden Perfected Jade Radiance Scroll*. Without receiving the *Supreme Clarity Jade Radiance*, one may not recite this text.\n\nThe celestial essence rides the void, startling the divine court.\nEntrusted to the immortal’s chant, it transforms into the nameless.\nHow tumultuous the clamorous qi, the defiled Dao arising along the path!\nWithin the clouds, the Crimson Palace; the Northern Emperor deploys his divine soldiers.\nThe drum resounds from the ocean of wisdom, the mysterious workings come to welcome.\nThe lofty scenes feast upon flying reins, swift chariots inspect the cloud encampments.\nHastening to collate the Northern Emperor’s register, seizing the names of the demonic hordes.\nThe *Huoluo* unfurls the celestial net, wielding might to cast the ringing bells.\nNow the perfected capture the empty cavern, the jade radiance illuminating the eight darknesses.\nThe Golden Mystery guards the supreme palace, the divine tiger slays the celestial essence.\nSevering the myriad demonic qi, billions upon billions all leveled.\nUpholding the trust of the Nine Heavens, all is overthrown at my whistled command.\nSummoning the perfected to fathom the Three Caverns, wisdom recitation clears the eyes.\nGazing upon the eight paths of the mysterious radiance, seven revolutions weave the celestial scriptures.\nMerging with the imperial unity of the Real, delivering the seven generations of ancestors.\nEradicating the roots of the five sufferings, the returned soul receives renewed glory.\nThe golden radiance shines upon the quiescent, the divine candle naturally kindles.\nFragrant blossoms scatter in the jade palace, misty qi penetrates the Jade Capital.\nThe Emperor dispatches the lingering chariot, the Three Origins descend in green carriages.\nSwift chariots soar through the Nine Mysteries, paying homage at the Jade Emperor’s court.”\n\nUpon completing the *Great Void Chapter*, the disciple faces east, knocks his teeth thirty-six times, and intones:\n\n“Supreme Three Heavens’ Primordial Qi of the Mysterious Origin, Most High Lord Lao, summon forth from within my person the Void-and-Spontaneous Flying Immortal Attendants, the Divine Immortal Envoys, the Left and Right Flying Dragons, the Great Perfected Jade Maidens, and the Direct Talismans of the Five Emperors—thirty-six each—to report to the local earth deities and true officials. As I now burn incense, may my petition swiftly reach the boundless Jade Emperor and the Most High Perfected before the myriad sages.”\n\nThis completed, he faces north, knocks his teeth twenty-four times, and exits the *Supreme Clarity Office*.\n\nWithout receiving the *Supreme Clarity Three Origins Jade Inspection*, one may not exit this office.\n\n“Reverently, I summon from within my person:\nThe Void-and-Spontaneous Left and Right Jade Void Attendants, twenty-four each;\nThe Void-and-Spontaneous Five Emperors of the Great Perfected, twenty-four each;\nThe Void-and-Spontaneous Left and Right Jade Immortal-Guiding Attendants, twenty-four each;\nThe Nine Mysteries’ Void-and-Spontaneous Flying Dragon Attendants, twenty-four each;\nThe Upper Origin Attendants, twenty-four each;\nThe Middle Origin Attendants, twenty-four each;\nThe Lower Origin Attendants, twenty-four each;\nThe *Supreme Clarity Jade Void* Flying Immortal Envoys, twenty-four each;\nThe Divine Immortal Envoys, twenty-four each;\nThe Jade Immortal Envoys, twenty-four each;\nThe Great Immortal Envoys, twenty-four each;\nThe Upper Origin Envoys, twenty-four each;\nThe Middle Origin Envoys, twenty-four each;\nThe Lower Origin Envoys, twenty-four each;\nThe *Jade Clarity Golden Dawn* Jade Lads, twenty-four each;\nThe *Jade Clarity Great Florescence* Jade Maidens, twenty-four each.”",
      "overlap_context": "the world attains Great Peace and worthy ones emerge shall they not be withheld.\n\nThose who obtain the precious scriptures encounter manifold complexities. To summarize the essentials, the causes arise in seven ways:\nFirst, through the radiant numinous forms of spirits, their voices and appearances descending...\nSecond, through encounters with good people, dwelling in mountain caverns in ease and harmony;\nThird, through leisurely wandering or accidental discovery in public or private settings...",
      "start_char": 431,
      "end_char": 1858,
      "start_sentence": 17,
      "end_sentence": 64,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.81384491920471,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八素真经登坛符札妙诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "出者严庄，冠带仙服，正其威仪，对立臣前。 玉虚侍郎，冠飞玄玉冠，衣龙文九色虎衣，执命魔幡，立左。 五帝太真，冠元晨玉冠，五色飞仙羽服，九色之麾，立右。 飞龙功曹，冠平天玉冠，衣九色凤衣，腰带虎书，执召神之符，在上。 三元功曹，冠九元朱阳玉冠，衣三色羽衣，腰带流金火铃，执摄杀之律，立下。 飞仙使者，冠飞天玉冠，衣九色班文之衣，手执金符，建节在前。 神仙使者，冠朱阳玉冠，衣飞仙羽衣，手执玉板，持幢在后。 太空洞虚自然检天辅仙飞玄骑各九亿万众，检天辅真飞腾骑各九亿万众，检天辅神飞行骑各九亿万众，检天辅帝腾空骑各九亿万众，检天辅灵腾虚骑各九亿万众，洞虚自然五帝飞仙策空骑各九亿万乘，洞虚自然飞仙腾空骑各九亿万乘，自然飞琼羽盖策辔骑各九亿万乘，自然飞辕绿軿策辔骑各九亿万乘，自然检天制地龙腾骑各九亿万乘，自然招真生芝玉仙吏各九亿万众，自然神丹生仙吏各九亿万众，自然金真流光耀电骑各九亿万众，自然阴精兴云降雨骑各九亿万众，阳明照耀檄炁逐电骑各九亿万众，自然云门执节命光骑各九亿万众，神仙兵马乘骑，一合下屯，住臣前后左右，罗列行伍。 自然五色流霞紫烟各九亿万重，自然五帝飞轮流烟各九亿万重，五色飞琼羽盖各九亿万重，五岳五色飞軿各九亿万重，匝绕身形，流精散气，布满十方，周天覆地，营卫臣身。 严庄事讫，侍仙羽节、飞行玉童，擎持立空玉案，对在臣前，衔臣口中辞语，分别关启上下中央四面十方天官地神，五岳四渎九江八极名山大泽五帝真官，四司监察九部考召玄元始气甲子诸官君，无穷无极无高无下无深无浅无幽无显无鞅数量真官，注炁乾皇九宫八卦六甲真人，虚无直事五岳飞仙神龙羽骑。 历气上启元始皇上高虚玉帝九天丈人、元始三天玉童太灵真王、高上万仙扶桑大帝、太上大道玉晨君、三元南极禁君、金阙后圣帝君、东华青童、四极真人、三十九帝、二十四真、太清玄元上三天无极大道、太上老君、太上丈人、天老帝君、九老仙都君、九气丈人、无极太一帝君等百千万重道炁，千二百官君，太清玉陛下，天仙、神仙、飞仙、五帝仙君、太华真人。 臣自因缘宿福，九天之劫，轮转不灭，庆祚所逮，得生法门。 昔蒙先圣真人，所见拔擢，开导愚蒙，显授上法，九天大诀、三洞宝经、玉符灵文、丹书紫字、飞空步章，登於皇坛，告命九天。 从来积载，天运推移，皇道数行，法当传付后学，宿有玄名应仙之人，灵文秘重，不敢闭塞，不敢轻传，如案年限，动有劫年，於至学之士，永无其缘，有绝思之叹，勤而无成，至於元始开化，难遇其人，疠以玄科之旨，遇合便授。 今有某岳先生王甲，宿福余庆，遭值开泰，因缘侥幸，生於圣世，被蒙太上，书名帝简，得参大法，修诵玉经。 从来积载，某弃情忘影，志托幽阜，静神岩穴，思灵念气，而所见浅狭，触事未备。 今重诣臣，清斋七日，投辞启誓，求乞成就，建立皇坛，告命九天，奉受上清宝诀玉经，凡如干事。 信誓俱备，皆如科法，臣辄与某上登灵山，关五岳五帝，上告九天，以传某身。 某约闭口奉修，不得轻怠，宣露真文，违科犯诫，考延七祖，身谢鬼官。",
      "translated_text": "Those who emerge do so with solemn dignity, clad in immortal robes, their majesty and decorum perfectly composed as they stand arrayed before the minister.\n\nThe Jade Void Attendant Ministers wear soaring-dark-jade crowns, robes of nine-colored dragon-patterned tiger-skins, and wield the Banner of Commanding Demons, standing to the left.\n\nThe Five Thearchs’ Supreme Perfected wear Primordial Dawn Jade Crowns, five-colored flying-immortal feathered robes, and nine-colored pennants, standing to the right.\n\nThe Flying Dragon Attendants wear Level-Heaven Jade Crowns, nine-colored phoenix robes, tiger-script belts, and hold the Talismans of Summoning Spirits, positioned above.\n\nThe Three Origins Attendants wear Nine Origins Vermilion Yang Jade Crowns, three-colored feathered robes, belts of flowing-gold fire-bells, and wield the Statutes of Seizing and Slaying, standing below.\n\nThe Flying Immortal Envoys wear Soaring Heaven Jade Crowns, nine-colored variegated-patterned robes, and hold golden talismans with banners raised before them.\n\nThe Divine Immortal Envoys wear Vermilion Yang Jade Crowns, flying-immortal feathered robes, jade tablets in hand, and bear standards behind them.\n\nThe *Great Void’s Spontaneous Celestial-Auxiliary Immortal Flying Dark Cavalry*, nine hundred million myriad in number;\nThe *Celestial-Auxiliary Perfected Flying Ascending Cavalry*, nine hundred million myriad in number;\nThe *Celestial-Auxiliary Divine Flying Marching Cavalry*, nine hundred million myriad in number;\nThe *Celestial-Auxiliary Thearch Ascending Void Cavalry*, nine hundred million myriad in number;\nThe *Celestial-Auxiliary Spirit Ascending Void Cavalry*, nine hundred million myriad in number;\nThe *Great Void’s Spontaneous Five Thearchs’ Flying Immortal Sky-Strategizing Cavalry*, nine hundred million myriad chariots;\nThe *Great Void’s Spontaneous Flying Immortal Ascending Void Cavalry*, nine hundred million myriad chariots;\nThe *Spontaneous Flying Jade-Feather Canopy Bridle-Holding Cavalry*, nine hundred million myriad chariots;\nThe *Spontaneous Flying Green Carriage Bridle-Holding Cavalry*, nine hundred million myriad chariots;\nThe *Spontaneous Celestial-Regulating Earth-Commanding Dragon Ascending Cavalry*, nine hundred million myriad chariots;\nThe *Spontaneous Summoning Perfected Zhi-Mushroom Jade Immortal Clerks*, nine hundred million myriad in number;\nThe *Spontaneous Divine Elixir Birth Immortal Clerks*, nine hundred million myriad in number;\nThe *Spontaneous Golden Perfected Flowing Light Radiant Lightning Cavalry*, nine hundred million myriad in number;\nThe *Spontaneous Yin Essence Cloud-Raising Rain-Descending Cavalry*, nine hundred million myriad in number;\nThe *Yang Brightness Shining Summons-qi Pursuing Lightning Cavalry*, nine hundred million myriad in number;\nThe *Spontaneous Cloud Gate Banner-Holding Commanding Light Cavalry*, nine hundred million myriad in number—\nall these divine immortal troops and cavalry assemble and encamp, stationed before, behind, left, and right of the minister, arrayed in ordered ranks.\n\nSpontaneous five-colored flowing rosy clouds and purple mists, nine hundred million myriad layers;\nSpontaneous Five Thearchs’ flying wheels and flowing mists, nine hundred million myriad layers;\nFive-colored flying jade-feather canopies, nine hundred million myriad layers;\nFive Peaks’ five-colored flying carriages, nine hundred million myriad layers—\nenvelop the minister’s form, streaming essence and dispersing qi, filling the ten directions, encircling heaven and covering earth, guarding and protecting the minister’s body.\n\nOnce the solemn proceedings conclude, the feathered-node-bearing flying immortal jade lads hold aloft jade tables suspended in the void, positioned before the minister, receiving the words from the minister’s mouth to distinguish and report to the celestial officials, earth deities, and gods of the four directions, central quarters, ten directions, Five Peaks, Four Waterways, Nine Rivers, Eight Poles, famous mountains, great marshes, Five Thearchs’ Perfected Officials, Four Departments’ Inspectors, Nine Divisions’ Examiners and Summoners, Primordial Qi’s *Jiazi* Official Lords, boundless, measureless, depthless, heightless, fathomless, obscure or manifest, innumerable Perfected Officials; infusing qi into the Qian Sovereign’s Nine Palaces, Eight Trigrams, Six *Jia* Perfected Ones; the Void’s Direct Servants, Five Peaks’ Flying Immortals, divine dragon feathered cavalry.\n\nThe qi ascends to report to the Primordial Origin August Supreme High Void Jade Emperor, the Nine Heavens’ Venerable One;\nthe Primordial Origin Three Heavens’ Jade Lads, Supreme Numinous Perfected Kings;\nthe Highest Myriad Immortals’ Fusang Great Emperor;\nthe Supreme Great Dao Jade Dawn Lord;\nthe Three Origins Southern Culmen Prohibited Lord;\nthe Golden Watchtower Posterior Sage Emperor Lord;\nthe Eastern Florescence Azure Lad;\nthe Four Poles’ Perfected Ones;\nthe Thirty-Nine Emperors;\nthe Twenty-Four Perfected;\nthe Supreme Clarity Primordial Origin Upper Three Heavens’ Boundless Great Dao;\nthe Supreme Lord Lao;\nthe Supreme Venerable One;\nthe Heavenly Elder Emperor Lord;\nthe Nine Elders’ Immortal Capital Lord;\nthe Nine Qi Venerable One;\nthe Boundless Supreme Unity Emperor Lord—\nand the hundred thousand myriad layers of Dao-qi, the twelve hundred official lords, the Supreme Clarity Jade Steps’ Celestial Immortals, Divine Immortals, Flying Immortals, Five Thearchs’ Immortal Lords, Great Florescence Perfected Ones.\n\nThe minister, by karmic affinity and accumulated blessings, has endured the kalpas of the Nine Heavens, revolving without extinction, favored by fortune to be born into the Dharma-gate. Formerly, through the grace of former sagely perfected ones, he was uplifted and guided, his ignorance dispelled, and the supreme methods revealed to him—the Great Secrets of the Nine Heavens, the Three Caverns’ Treasured Scriptures, Jade Talismans, Numinous Writings, Cinnabar Scripts in Purple Characters, Flying Void Step Chapters—ascending the imperial altar to report and command the Nine Heavens. Over the years, as celestial cycles shifted and the imperial Dao’s destiny unfolded, the Dharma was to be transmitted to later disciples, those with predestined immortal names and destined for transcendence. The numinous texts are secret and weighty; they dare not be withheld, nor lightly transmitted. According to the stipulated time limits, should the kalpas turn, even the most devoted scholars might forever lack the affinity, their aspirations cut off, their efforts in vain. Yet when the Primordial Origin opens the transformation, it is rare to encounter the right person—thus, by the principles of the mysterious statutes, when the encounter aligns, the transmission is granted.\n\nNow there is the Master of Such-and-Such Peak, Wang of *Jia* clan, whose accumulated blessings and surplus fortune have met with this era of flourishing prosperity. By karmic good fortune, he was born in this sagely age, favored by the Supreme to have his name inscribed in the imperial records, to partake in the great Dharma, and to recite the Jade Scriptures. Over the years, he has cast aside worldly attachments, forgotten his shadow, and entrusted his aspirations to secluded peaks, calming his spirit in mountain caves, contemplating the numinous and meditating on qi. Yet his understanding remains shallow and narrow, and he has not yet mastered all matters. Now, he again approaches the minister, observing a seven-day purification fast, submitting his vows and oaths, seeking completion and establishment. He erects the imperial altar, reports to the Nine Heavens, and receives the Supreme Clarity’s Treasured Secrets and Jade Scriptures—all such matters as required. With faith and oaths fully prepared, all in accordance with the statutes and methods, the minister then escorts him to ascend the numinous mountain, reporting to the Five Peaks and Five Thearchs, and announcing to the Nine Heavens to transmit the teachings to him.\n\nHe pledges to observe silence in his practice, never to be negligent, never to reveal the true texts, nor to violate the statutes or transgress the precepts. Should he do so, his seven generations of ancestors will be examined, and his own person will be delivered to the ghostly officials.",
      "overlap_context": "n Attendants, twenty-four each;\nThe *Supreme Clarity Jade Void* Flying Immortal Envoys, twenty-four each;\nThe Divine Immortal Envoys, twenty-four each;\nThe Jade Immortal Envoys, twenty-four each;\nThe Great Immortal Envoys, twenty-four each;\nThe Upper Origin Envoys, twenty-four each;\nThe Middle Origin Envoys, twenty-four each;\nThe Lower Origin Envoys, twenty-four each;\nThe *Jade Clarity Golden Dawn* Jade Lads, twenty-four each;\nThe *Jade Clarity Great Florescence* Jade Maidens, twenty-four each.”",
      "start_char": 1858,
      "end_char": 3070,
      "start_sentence": 65,
      "end_sentence": 83,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.3673951625824,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八素真经登坛符札妙诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "检行慎法，身得飞仙。 谨以启闻，须御以传。 出官毕，命盟度讳及经符箓，师北向立，左手执经，师叩齿三十六通，心存太上玉皇，令日月之光，侠照师并弟子之身。 咒曰： 太微何渺邈，真人结虚生，空津自然通，集为大洞经，真贤奉法信，乘运历黄庭，保秘年劫积，泄慢地狱婴，拷及七世祖，风刀解汝形。 师左手执经，弟子右手执信，对向天而微言曰：出四极明科 上告高玄，万帝虚微，下世有愿，守固不移，敢告明科，以检众非，玉经宝诀，皆如科威，度身之后，万炁总归，长保天地，三景齐晖，敢有泄漏，长谢四非。 毕，弟子置信受经，向北九拜，弟子擎法信，师受信物，弟子左手指西北，右手受经，回东南上，倚向西立，以次南回取天门，埋灭迹符。 若并受紫结带者，於东南上未回，亦可分紫素，别有科仪也。 师位立东北上，叩齿三十六通，仰祝曰： 九天洞耀，玄符焕明，上学甲乙，被练炁精，上选皇臣，并关万灵，玉帝监位，侍仙神庭，北酆三宫，检制魔兵，四司五帝，戮灭贾生，明摄九府，勒落甲名，腾身遁变，藉地隐形，寿同三景，九元齐并。 毕，单步二十四，至弟子后地户间，又咒曰： 足蹑五岭，上攀玄机，腾身九空，出幽入微，轻行云步，逮变迅晖，金真焕光，天关朗开，身佩帝章，飞青羽衣，五灵监映，去无稽迟，亿龄兆劫，永谢世违。 毕，便埋腾天遁变符，於弟子左足下。 弟子便单步二十四，至西南角人门上倚，又祝曰： 解形皇坛，变迹入无，灭景灵岳，迅躯太空，腾天藉地，混代十方，闭无不开，绝无不回，高上玉帝，九天大王，灵映已监，永毕世崇，告盟皇坛，更过灵峰，脱迹三涂，上登玉京。 毕，便埋藉地解形符，於弟子右足下。 次单步三十九，至西北角天门上倚，师又咒曰： 发足地户，云行天门，三回九练，明道独分，告盟灵岳，乘运转轮，琼舆徘徊，控辔持云，五晨翼云，案景七元，解形藉地，上被三关，朝礼金阙，与帝长存。 毕，埋腾天符於左迹，藉地符於右迹。 毕，师与弟子於九天门，青丝缠金钮，告灵而去，便出西北九天之门。 弟子出门，便自执鱼龙投山之岩，正北向叩齿九通，自告盟於九天，咒曰： 太晨玄除，九玄幽密，朱景监映，万灵练质，三运交迁，回月周日，是时开陈，元庆良吉，登坛高峰，隐明岩室，上誓九天，中开常一，下告灵山，万神永毕，轻传世宝，长谢玄七，违师负盟，形残影灭，三涂五苦，万劫不脱，按知盟文，记名玉札，乞早升度，腾身帝室。 毕，便投物於山崖也。 右二符，青书白素，埋於天门，受者两迹下也。 地户，埋腾天符弟子左足下。 人门。 埋藉地符弟子右迹下。 弟子镇命纹缯，置本命之上，五帝纹随色镇五方，盟信置中央。 五盟镜镇五帝，制天魔，无此镇缯，则五岳之灵不受子盟也。 西城王君抄太真科要诀於阳洛，过南岳夫人，惟腾天、藉地二符，诀口口相传。 受此法，别有盟诀太真科中。 师登坛，当施五帝告真之符，以弟子信镇於五方，以盟九天，誓五灵。 施绯罗之巾五尺於前，以请经文，师北向读度讳，弟子东向伏受。 命盟事讫，弟子北向九拜九戢，仰咽九炁，毕，便去。 师当以金鱼、玉龙、玉札埋於绝岩，埋时北向叩齿三十六通，微咒曰：",
      "translated_text": "Having examined his conduct and guarded the statutes, his person shall attain to flight as an immortal. With reverence, this is reported, and the transmission must be conferred with due ceremony.\n\nUpon exiting the official precinct, the master administers the covenant, the taboo names, and the scriptures and talismans. The master stands facing north, holding the scripture in his left hand. He knocks his teeth thirty-six times, visualizing the Most High Jade Emperor, causing the light of sun and moon to flank and illuminate both master and disciple. He recites the incantation:\n\nHow vast and distant is the Great Subtlety,\nTrue persons bind their lives to emptiness.\nThe celestial ford naturally opens,\nAssembling the Great Cavern Scripture.\nTrue worthies uphold the Dharma with faith,\nRiding the cycles through the Yellow Court.\nGuard its secrecy through kalpas of years—\nShould one reveal it carelessly, hell’s torments await,\nWith scourging extended to seven generations of ancestors,\nAnd wind-knives to dissect your very form.\n\nThe master holds the scripture in his left hand, while the disciple holds the pledge in his right. Together, they face heaven and softly intone:\n\nIssuing from the Four Poles’ luminous statutes,\nWe report above to the Lofty Mysterious,\nTo the myriad emperors of the Void and Subtle.\nIn this world, we vow to hold fast without wavering.\nDare we report to the luminous statutes,\nTo examine all transgressions.\nThe Jade Scripture and Treasured Secrets\nAre all as the statutes’ majesty decrees.\nAfter the transmission of this body,\nAll qi shall be wholly returned.\nMay we long preserve Heaven and Earth,\nWith the Three Luminaries shining as one.\nShould any dare to reveal them,\nThey shall forever forfeit the Four Transgressions.\n\nThis done, the disciple places the pledge to receive the scripture, bowing nine times toward the north. The disciple presents the pledge of the Dharma, and the master accepts the token. The disciple points with his left hand to the northwest, receives the scripture with his right, then turns to the southeast, standing with his back to the west. Proceeding southward in order, he takes the Heavenly Gate, and buries the talisman to erase his traces.\n\nIf both the purple and plain silk sashes are to be received together, before turning south, the purple and plain may be separated, as there are separate rites for each.\n\nThe master stands at the northeast, knocks his teeth thirty-six times, and raises his gaze to pray:\n\nThe Nine Heavens’ Cavernous Radiance,\nThe Mysterious Talismans shine brightly.\nAbove, one studies the celestial stems,\nClad in refined qi-essence.\nSelected as the August Minister,\nOne connects with the myriad spirits.\nThe Jade Emperor oversees the position,\nAttending the divine court of immortals.\nThe Three Palaces of Fengdu\nExamine and restrain demonic soldiers.\nThe Four Offices and Five Emperors\nExecute and destroy Jia Sheng.\nBrightly overseeing the Nine Treasuries,\nThey strike out the celestial stem names.\nSoaring in transformation, concealing the body,\nOne borrows the earth to hide the form,\nWith a lifespan equal to the Three Luminaries,\nAnd the Nine Origins merging as one.\n\nThis done, he takes twenty-four single steps to the disciple’s rear, at the Earthly Door, and recites another incantation:\n\nTreading the Five Peaks,\nOne grasps the Mysterious Mechanism.\nSoaring through the Nine Voids,\nExiting the hidden, entering the subtle,\nLightly pacing the cloud steps,\nSwiftly transforming with radiant speed,\nThe Golden Perfected shines with light,\nThe Heavenly Pass brightly opens.\nClad in the Emperor’s insignia,\nFlying in azure feathered robes,\nThe Five Spirits oversee and illuminate,\nDeparting without delay or hindrance,\nFor kalpas of eons,\nForever parting from worldly separation.\n\nThis done, he buries the *Soaring Heaven Concealment Talisman* beneath the disciple’s left foot. The disciple then takes twenty-four single steps to the southwest corner, standing at the Human Door, and prays:\n\nDissolving the form at the August Altar,\nTransforming traces to enter the void,\nErasing the luminous shadow at the numinous peak,\nSwiftly traversing the Great Void,\nSoaring through heaven, borrowing the earth,\nMerging with the ten directions,\nClosing what cannot be opened,\nSevering what cannot be turned,\nThe Most High Jade Emperor,\nGreat King of the Nine Heavens,\nHaving overseen the divine illumination,\nShall forever receive worldly reverence.\nWe report the covenant at the August Altar,\nPassing beyond the numinous peaks,\nShedding traces from the Three Paths,\nAscending to the Jade Capital.\n\nThis done, he buries the *Borrowing Earth Dissolving Form Talisman* beneath the disciple’s right foot. Next, he takes thirty-nine single steps to the northwest corner, standing at the Heavenly Gate. The master recites another incantation:\n\nSetting forth from the Earthly Door,\nClouds traverse the Heavenly Gate.\nThree revolutions, nine refinements,\nThe luminous Dao alone divides.\nReporting the covenant at the numinous peaks,\nRiding the cycles, turning the wheel,\nJade chariots linger,\nReining the clouds, holding the reins,\nThe Five Mornings flank the clouds,\nSurveying the shadows of the Seven Origins.\nDissolving the form, borrowing the earth,\nClad above in the Three Passes,\nPaying homage at the Golden Gates,\nAbiding with the Emperor forever.\n\nThis done, he buries the *Soaring Heaven Talisman* at the left trace and the *Borrowing Earth Talisman* at the right trace.\n\nThe rites completed, the master and disciple stand at the Gate of the Nine Heavens. With azure silk binding the golden clasp, they report to the numinous and depart, exiting through the northwest Gate of the Nine Heavens. The disciple, upon exiting, takes the fish and dragon and casts them into the mountain crags. Facing due north, he knocks his teeth nine times and reports his covenant to the Nine Heavens, reciting the incantation:\n\nThe Great Morning’s Mysterious Removal,\nThe Nine Mysterious’ profound secrecy,\nVermilion radiance oversees and illuminates,\nThe myriad spirits refine their essences.\nThe Three Cycles shift and change,\nThe moon revolves, the sun circuits.\nAt this time, we open and declare,\nWith primal felicity and auspiciousness.\nAscending the altar’s lofty peak,\nConcealing in the luminous grotto,\nAbove, we pledge to the Nine Heavens,\nIn the center, we open the Eternal One,\nBelow, we report to the numinous mountains,\nForever completing the myriad spirits.\nLightly transmitting the world’s treasures,\nForever parting from the Seven Mysteries.\nShould one violate the master or betray the covenant,\nForm and shadow shall be destroyed,\nSuffering the Three Paths and Five Torments,\nFor ten thousand kalpas, never to escape.\nHaving examined the covenant text,\nWe inscribe the name on the Jade Tablet,\nPraying for swift ascension and transmission,\nSoaring in body to the Emperor’s chambers.\n\nThis done, he casts the objects into the mountain crags.\n\nThe two talismans—inscribed in azure on white silk—are buried at the Heavenly Gate, beneath the recipient’s two traces. At the Earthly Door, the *Soaring Heaven Talisman* is buried beneath the disciple’s left foot. At the Human Door, the *Borrowing Earth Talisman* is buried beneath the disciple’s right trace. The disciple places the *Life-Stabilizing Silk* over his original destiny, with the *Five Emperors’ Silk* of corresponding colors placed at the five directions, and the covenant pledge placed at the center. The *Five Covenant Mirrors* stabilize the Five Emperors, restraining the heavenly demons. Without these stabilizing silks, the spirits of the Five Peaks will not accept the disciple’s covenant.\n\nThe Perfected Lord of the Western City copied the essential statutes of the *Great Perfection* at Yangluo, passing through the Lady of the Southern Peak. Only the *Soaring Heaven* and *Borrowing Earth* talismans are transmitted orally, their secrets passed mouth to mouth. For receiving this method, there are separate covenant statutes in the *Great Perfection* texts.\n\nWhen the master ascends the altar, he should present the *Five Emperors’ Petitioning Talismans*, using the disciple’s pledge to stabilize the five directions, covenanting with the Nine Heavens and pledging to the Five Spirits. A five-chi scarlet silk kerchief is placed before him to invite the scripture. The master faces north to read the taboo names of transmission, while the disciple faces east, prostrating to receive them. When the covenant rites are completed, the disciple faces north, bows nine times, and kneels nine times, then raises his head to swallow the nine qi. This done, he departs.\n\nThe master should bury the golden fish, jade dragon, and jade tablet in a sheer cliff. As he buries them, he faces north, knocks his teeth thirty-six times, and softly recites the incantation:",
      "overlap_context": "ith the statutes and methods, the minister then escorts him to ascend the numinous mountain, reporting to the Five Peaks and Five Thearchs, and announcing to the Nine Heavens to transmit the teachings to him.\n\nHe pledges to observe silence in his practice, never to be negligent, never to reveal the true texts, nor to violate the statutes or transgress the precepts. Should he do so, his seven generations of ancestors will be examined, and his own person will be delivered to the ghostly officials.",
      "start_char": 3070,
      "end_char": 4340,
      "start_sentence": 84,
      "end_sentence": 119,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.157376289367676,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八素真经登坛符札妙诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "天元八朗，九玄－关真，三景应期，是日敷陈，上帝纳听，告命灵山，三官九府，十二河源，记某名籍，永以成仙，坐须龙驾，飞舆紫烟，得御上升，朝谒玉晨。 毕，埋鱼龙札於玄谷。 九天告命东岳青灵万仙宫属卫扞先生某甲之身登盟度真记录青宫俯仰遣白帝仙官九人给奉司迎如九天信 右丹书板上，置南面，以镇东岳灵官，侍给仙官九人。 九天告命南岳赤灵万仙官属卫扞先生某甲之身登盟度真记录青宫俯仰格遣赤帝仙官九人给奉司迎如九天信 右白书板上，置西面，以镇西岳灵官，侍给仙官九人。 九天告命西岳白灵万仙官属卫扞先生某甲之身登盟度真记录青宫俯仰格遣白帝仙官九人给奉司迎如九天信 右白书板上，置西面，以镇西岳灵官，侍给仙宫九人。 九天告命北岳黑灵万仙官属卫扞先生某甲之身登盟度真记录青宫俯仰格遣黑帝仙官九人给奉司迎如九天信 右黑书板上，置北面，以镇北岳灵官，侍给仙官九人 九天告命中岳黄灵万仙官属卫扞先生某甲之身登盟度真记录青宫俯仰格遣黄帝仙官九人给奉司迎如九天信 右黄书板上，置中央，以镇中岳灵官，侍给仙官九人。 右五符，上皇玉帝制命告灵真符，登玉清皇坛当依法书符安位，师於中央，命四极之盟。 毕，埋符五岳。 度大盟，投金龙玉鱼玉札文曰：某年月朔某日子，某岳先生某甲，年如干岁，某月生，命属某斗某帝君，谨於玄岳高山之岩，告誓九天，上受九十一卷经，四极太真明科，九天谱明科之诀，奉行道真，乞注紫简，言名青宫。 违盟负誓，不敢希仙。 右朱书玉札上，长一尺二寸，广二寸四分，读毕，埋於绝岩之阴。 洞真太上八素真经登坛符札妙诀竟",
      "translated_text": "The Eight Luminaries of Heaven’s Origin, the Nine Mysteries seal the Perfected, the Three Radiances align with the appointed time—on this day, the offerings are set forth, the Celestial Thearch receives and heeds, the command is proclaimed to the numinous mountains, the Three Bureaus and Nine Offices, the Twelve River Sources. Record the disciple’s name in the registers, that he may forever attain immortality, sit awaiting the dragon carriage, ride the flying chariot amid purple mist, ascend to the heights, and pay court to the Jade Dawn.\n\nThis done, bury the fish, dragon, and tablet in the Dark Valley.\n\nThe Nine Heavens proclaim the command to the Eastern Peak’s Azure Numinous Myriad Immortals Palace, charging its guardians to shield Master So-and-so’s person as he ascends the covenant, receives the transmission of the Perfected, and is recorded in the Azure Palace. Bowing and rising, dispatch the Nine White Thearch Immortal Officers to attend and serve, to welcome him as one entrusted with the Nine Heavens’ pledge.\n\nInscribe this in cinnabar on a wooden board, place it facing south to guard the Eastern Peak’s numinous officials, with nine attending immortal officers in service.\n\nThe Nine Heavens proclaim the command to the Southern Peak’s Vermilion Numinous Myriad Immortals Palace, charging its guardians to shield Master So-and-so’s person as he ascends the covenant, receives the transmission of the Perfected, and is recorded in the Azure Palace. Bowing and rising, dispatch the Nine Red Thearch Immortal Officers to attend and serve, to welcome him as one entrusted with the Nine Heavens’ pledge.\n\nInscribe this in white on a wooden board, place it facing west to guard the Western Peak’s numinous officials, with nine attending immortal officers in service.\n\nThe Nine Heavens proclaim the command to the Western Peak’s White Numinous Myriad Immortals Palace, charging its guardians to shield Master So-and-so’s person as he ascends the covenant, receives the transmission of the Perfected, and is recorded in the Azure Palace. Bowing and rising, dispatch the Nine White Thearch Immortal Officers to attend and serve, to welcome him as one entrusted with the Nine Heavens’ pledge.\n\nInscribe this in white on a wooden board, place it facing west to guard the Western Peak’s numinous officials, with nine attending immortal officers in service.\n\nThe Nine Heavens proclaim the command to the Northern Peak’s Black Numinous Myriad Immortals Palace, charging its guardians to shield Master So-and-so’s person as he ascends the covenant, receives the transmission of the Perfected, and is recorded in the Azure Palace. Bowing and rising, dispatch the Nine Black Thearch Immortal Officers to attend and serve, to welcome him as one entrusted with the Nine Heavens’ pledge.\n\nInscribe this in black on a wooden board, place it facing north to guard the Northern Peak’s numinous officials, with nine attending immortal officers in service.\n\nThe Nine Heavens proclaim the command to the Central Peak’s Yellow Numinous Myriad Immortals Palace, charging its guardians to shield Master So-and-so’s person as he ascends the covenant, receives the transmission of the Perfected, and is recorded in the Azure Palace. Bowing and rising, dispatch the Nine Yellow Thearch Immortal Officers to attend and serve, to welcome him as one entrusted with the Nine Heavens’ pledge.\n\nInscribe this in yellow on a wooden board, place it at the center to guard the Central Peak’s numinous officials, with nine attending immortal officers in service.\n\nThese five talismans are the Jade Thearch of the Supreme Sovereign’s decrees, the Proclamation Talismans to the Numinous Perfected. When ascending the Jade Clarity Imperial Altar, inscribe the talismans and position them according to the method. The master stands at the center to command the covenant of the Four Poles.\n\nThis done, bury the talismans at the Five Peaks.\n\nFor the Great Covenant Transmission, cast the golden dragon, jade fish, and jade tablet, with the text inscribed as follows:\n\nOn the first day of such-and-such a month in such-and-such a year, Master So-and-so of such-and-such a peak, aged so many years, born in such-and-such a month, his fate governed by such-and-such a Dipper and such-and-such an Imperial Lord, respectfully proclaims his oath to the Nine Heavens upon the sheer cliff of the Dark Peak’s lofty mountain. Having received the ninety-one fascicles of scripture, the *Luminous Ordinances of the Four Poles and Supreme Perfected*, and the *Ordinances of the Nine Heavens’ Registers*, he pledges to uphold the Dao and the Perfected, beseeching that his name be inscribed on the Purple Tablet and recorded in the Azure Palace. Should he violate this covenant or betray this oath, he dares not aspire to immortality.\n\nInscribe this in cinnabar on a jade tablet, one foot two inches in length and two inches four fen in width. When the reading is complete, bury it in the shadowed side of the sheer cliff.\n\nHere ends the *Esoteric Ordinances of the Altar Talismans and Tablets of the Supreme Perfected’s Eight Pure Scriptures of the Cavernous Perfected*.",
      "overlap_context": "cripture. The master faces north to read the taboo names of transmission, while the disciple faces east, prostrating to receive them. When the covenant rites are completed, the disciple faces north, bows nine times, and kneels nine times, then raises his head to swallow the nine qi. This done, he departs.\n\nThe master should bury the golden fish, jade dragon, and jade tablet in a sheer cliff. As he buries them, he faces north, knocks his teeth thirty-six times, and softly recites the incantation:",
      "start_char": 4340,
      "end_char": 5015,
      "start_sentence": 120,
      "end_sentence": 137,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.09952664375305,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八素真经登坛符札妙诀.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}