{
  "source_id": "洞真西王母宝神起居经",
  "source_file": "chunked_daozang\\洞真西王母宝神起居经.json",
  "total_chunks": 9,
  "total_original_chars": 7327,
  "total_translated_chars": 44099,
  "total_translation_time": 221.56772255897522,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞真西王母宝神起居经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Scripture of the Western Royal Mother’s Precious Spirit and Daily Practice**\n\n**Title:** *The Scripture of the Western Royal Mother’s Precious Spirit and Daily Practice*. Author unknown, approximately composed during the Eastern Jin or Southern Dynasties. Adapted from selections of *True Words* and *The Essential Jade Instructions of the Three Perfected Ones of Supreme Purity*, among other texts. Includes chapters such as *The Scripture of the Western Royal Mother’s Precious Spirit and Daily Practice*, *The Jade Scripture of the Western Royal Mother’s Treasure of Life Without Death*, and *The Jade Scripture of the Western Royal Mother’s Rebirth and Massage*. One scroll. Base text from *The Orthodox Daoist Canon*, Section Zhengyi, First Division.\n\n---\n\n**The Scripture of the Western Royal Mother’s Precious Spirit and Daily Practice**\n\nUpon waking at night or rising at dawn, first close both eyes tightly. Then, click the teeth nine times, swallow saliva three times, and press the tongue against the throat. Next, shake the head and move the neck seven times. With the hands, press along the sides of the nostrils, moving up and down dozens of times on the left and right. When finished, softly recite the following invocation:\n\n*\"The Nine Heavens’ Supreme Emperor, the Three Origins’ Protector of Infants,\nThe Supreme One unfurls the flower, the Jade Chamber emits essence.\nThe Seven Gates summon the spirits, the Nine Chambers receive illumination.\nEars keen, eyes clear, penetrating the true and reaching the numinous.\nThe Heavenly Peak of the Central Realm, harmonizing qi and balancing equilibrium.\nThe Proud Maiden’s cloud-like bearing, the Eye Lad’s radiant brightness.\nThe Mystic Window gleams, the Hundred Portals shine.\nPreserve harmony in the Upper Origin, wander the Golden Court.\nThe five viscera glow with splendor, ears and eyes ever renewed.\nThe Spirit Terrace stands towering, its pillars and beams unshaken.\nThe Seven Po dissolve and refine, the Three Hun rest in yellow tranquility.\nThe Supreme One takes my hand, walking beside me as one.\nThe Five Elders merge in unity, the Peerless assists and guards.\nMyriad evils vanish, all wishes surely come to pass.\nSun and Moon stand guard at the gates, the heart dwells with the auspicious star.\nAs the Immortal Sovereign declares, the ten thousand spirits heed with reverence.\"*\n\nUpon waking, always perform this pressing and invocation—never forget it. Though the true Dao may be attained, still practice this without fail.\n\nThis is the Supreme Highest Western Queen Mother’s *Precious Scripture on the Jade Arts of Rising and Resting*. It sharpens the ears and brightens the eyes, strengthens memory and clears the mind, harmonizes the breath within the nose so that no foul mucus arises, illuminates the Four Ministers and Eight Penetrations, and restores the complexion to youthful radiance. It governs the hun and records the po, repelling the ten thousand demons. This is the wondrous Dao of the Perfected One’s rising and resting.\n\nThe term “rising and resting” means that this practice should be performed regularly upon waking and before sleep. Additionally, one should rub the hands together until slightly warm and then massage the face and eyes as a daily habit, repeating this several times.\n\nThe Divine Mother says: When a person begins to age, wrinkles first appear beneath the eyes. When the body’s vitality declines and qi diminishes, it first manifests between the nostrils. These two areas are the doors and windows of wrinkles and decline, the passes and fords of qi and strength. Thus, regularly practicing this method wards off wrinkles and decline, preserving qi and strength in constant health and harmony.\n\nThe *Jade Scripture of Deathlessness* states:\nHands part the blossoming courtyard’s side,\nLingering to harmonize with Heavenly Perfection.\nAbove, enter the Spirit Gorge’s chamber,\nJade Valley fills the Celestial Mountain.\nThe inner source reveals the Mysterious Numinous,\nThe ten thousand demons self-destruct.\nEternal life without death,\nJade registers return to the Lord Emperor.\nThrough you, harmonize with Heavenly Perfection,\nPress this secluded mountain source.\n\nHeavenly Perfection resides between the eyebrows, at the inner corners of the brows—one fen below the ears is the upper chamber for drawing in the numinous. The mountain source lies beside the philtrum above the upper lip, slightly within the nostrils’ hollow—this is the gate that seals and extinguishes the ten thousand demons. The blossoming courtyard is below the eyebrows, at the center directly beneath them—this is the bridge for penetrating vision.\n\nAt dawn upon rising and at dusk before sleep, swiftly close both eyes, curl the tongue back toward the throat, and swallow saliva three times. Then, with urgency, press these three places nine times each, pressing inwardly without lifting the hands. Make this a constant practice, and it will grant long life without death, descending spirits and penetrating vision, sealing and extinguishing the path of the ten thousand ghosts.\n\nAfter pressing the hands, softly recite the incantation:\nSupreme Void Sovereign,\nOpen and scatter the Jade Court.\nThe Golden Chamber gleams radiant,\nThe Emerald Terrace stands lush and green.\nI gather the Three Paths,\nExtinguish demons and give birth to spirits.\nI attain deathlessness,\nAnd also transcend life.\nEternal life is free,\nReversing age to return to infancy.\nHun and po are refined,\nThe Five Spirits rest in peace.\nThe whirlwind’s chariot wheels turn,\nNorthward I visit Jade Clarity.\nAscending to the Great Origin,\nI merge with the sun.\nThus I become a Perfected One,\nThe Lord Emperor unites in darkness.\nProclaimed by the Three Origins,\nThe ten thousand spirits heed with reverence.\n\nDuring the reign of King Zhuang of Chu, there was a market chief named Song Yuanfu, a man of good heart who regularly swept the entire market himself. After some time, a beggar entered the market and stayed for a year. Each morning, he would beg while singing loudly:\nThe Heavenly Court births golden blossoms,\nThe inner source blocks yin evil.\nJade Valley joins the Mysterious Minister,\nJade qi mutually supports the web.\nHeavenly Perfection stands above the sun,\nFlying medicine spouts numinous wonders.\nAt dawn, press the Heavenly Steed,\nLinger and drive to the Spirit’s Mysterious Home.\nThe Immortal enters the chamber,\nAnd thus extinguishes the hundred demons.\n\nBefore leaving, he inscribed these words on the market gate. No one in the Chu market understood them, but Yuanfu suddenly grasped their meaning and suspected the beggar was an immortal—though he did not comprehend the song’s deeper import. He knelt and repeatedly entreated the beggar for instruction. After some time, the beggar said: “I am indeed a Perfected One. These words are the *Precious Song of Deathlessness* from the Kunlun Western Queen Mother. Those who know it transcend death.” He then transmitted the essential method and secret instructions to Yuanfu. After practicing for twenty years, Yuanfu ascended to heaven in broad daylight and now resides on the Dark Continent, where he holds the rank of Immortal Minister. The beggar in the Chu market was none other than the Perfected One of South Mountain, Red Pine.\n\nAt times, he divided his form and scattered his radiance, temporarily descending into the dust and filth to wander and observe the clamor, summoning and welcoming true encounters.\n\nThe *Divine Precious Scripture as Told by Perfected Lord Pei of Pure Emptiness* states: To seek the Dao, one must first make the eyes clear and the ears sharp, for these are the primary agents of all affairs. The ears and eyes are the ladder for seeking the Perfected and the gate for gathering the numinous. Success and failure depend on them, and life and death are determined by them. Now I transcribe this scripture to share—practice it diligently.\n\nThe *Upper Chapter on Dispelling Demons* says: Frequently press and rub the left and right ears, without limit—this is called “tending the city walls,” and one’s name is recorded in the Emperor’s register. Also frequently press the left and right sides of the nose, without limit—this is called “irrigating the Central Peak,” and one’s name is recorded in the Emperor’s ledger. These two methods originate from the oral instructions of Lady Li of Bright Numinosity on Bright Terrace, imparted on the night of the twelfth day of the ninth month.\n\nThe Dao says: Regularly press the small hollows behind the eyebrows three times. Also, use the palms and fingers to massage the area beneath the eyes and above the cheekbones. Grasp the ears and pull thirty times. Massage frequently, without fixed timing. Upon finishing, reverse the hands and stroke the forehead twenty-seven times, beginning at the space between the eyebrows and moving upward into the hairline. Meanwhile, swallow saliva, without limit to the amount. If practiced regularly, the eyes will grow clear and bright by day, and within a year, one will be able to write at night. This may also be done discreetly at the philtrum, without speaking of its form.\n\nThe small hollows behind the eyebrows are the mansion of the Upper Origin’s Six Harmonies, governing the generation of eye radiance, harmonizing and polishing essence and light, preserving the long pearl and penetrating the child’s vision, refining and training the eye spirits. This is the supreme Dao of the Perfected One’s sitting and rising—also called the *Perfected One’s Scripture of Constant Abiding Within*.\n\nThe Perfected One sighed and said: If you wish to write at night, you must cultivate the *Constant Abiding*. The reason the Perfected One can observe all four directions and illuminate the eight distant realms is truly due to the clarity of this *Constant Abiding* practice.\n\nThe area beneath the eyes and above the cheekbones is the *Hall of Bright Resolution*, the *Returning to Infancy’s Supreme Dao*. Grasping and pulling the ears is the art of deep illumination. Through this, the blood flows smoothly, wrinkles and blemishes do not form, the eye’s brilliance shines mysteriously, and spirit and essence flourish in harmony.\n\nWhen a person begins to age, it seldom does not first manifest in the ears and eyes.\n\nThe signs of aging also first appear at the outer corners of the eyes. Place your hands upon the forehead, inwardly visualize the *Red Child* and the *Dual Brightness of Sun and Moon*, and rejoice in the *Upper Prime*. Perform this for three cycles of nine repetitions, ceasing only when the count is complete. This is called the *Morning Practice of the Three Primes to Fortify the Brain and Strengthen the Hair*.\n\nFor the four sides of the head, use both hands to stroke along the hair, following its natural flow to gather and bind it, ensuring frequent repetition. Thus, the blood in the head flows freely, and *wind-dampness* does not congeal. When finished, press the four corners of the eyes eighteen times until light is distinctly perceived—this verifies the *Way of the Eye Spirit*. With prolonged practice, one may behold the *Hundred Spirits*.\n\nThe *Scripture of Master Stone Scenery* states: Often cover the mouth and nose with your hands, bringing them near the eyes while gently exhaling *qi*. After some time, fluid will form in the palms; use it to anoint the face and eyes. Regular practice imparts fragrance to the body.\n\nThe *Jade Scripture of the Three Celestial Passes* says: Frequently press the areas near the eyes and beside the nose, closing the breath to perform this. Cease when the *qi* flows through, then exhale and begin anew. With constant practice, the eyes gain penetrating vision.\n\nThe above two methods originate from *Lady Wei of South Mountain*.\n\nThe *Scripture of the Three-Five Sequential Flow in Cinnabar Script* states: When seated, often close the eyes and inwardly observe, visualizing the five viscera and intestines. With prolonged practice, they become distinctly clear.\n\nThe *Scripture of the Cinnabar Scenery of Grand Simplicity* says: On the face, frequently use both hands to rub and wipe, generating warmth. Follow the contours of the face, ensuring thorough coverage. The face will gain luster, wrinkles and blemishes will not form, and after five years of practice, the complexion will resemble that of a maiden. This is what is meant by *\"the qi of mountains and rivers, ever full and never depleted.\"*\n\nThe *Scripture of Cinnabar Scenery* further states: First rub the hands together until hot, then wipe the face and eyes. Next, stroke the hair as if combing it, and alternately massage the arms with the hands. This prevents hair from whitening and keeps the vessels from floating upward.\n\nThe *Section on Massage from the Scripture of Grand Cavern’s Essence and Scenery* says: Upon rising, sit upright and regulate the breath. First clasp the hands, then raise them to cover the back of the neck. Tilt the head back to gaze upward, creating tension between the neck and hands. Perform this three or four times to harmonize essence and circulate blood, preventing the intrusion of *wind-qi*. With long practice, one attains freedom from death and illness. Afterward, bend and stretch the body, extend the limbs to their utmost, arch backward, and twist to the sides, activating all joints—each movement performed three times.\n\nUpon rising, first use a towel or thick cloth to wipe the neck on all sides and behind the ears until warm. Then stroke the head as if combing the hair, ensuring thorough coverage. After some time, massage the hands and tend to the face and eyes. With prolonged practice, the eyes become bright, evil *qi* does not invade, the body remains free of grime, and impurities are dispelled. Conclude by swallowing saliva thirty times to guide the inner fluids.\n\nThe above method is from the *Scripture of Grand Cavern’s Essence and Scenery*.\n\n---\n\n**The Jade Scripture of Queen Mother of the West’s Reverse-Womb Massage**\n\nThe *Way of Nurturing Life* takes the ears and eyes as its foundation. Scattered vision dims the eyes, and excessive worry blocks the ears—these two afflictions arise from within the body and form illness, not from external misfortune. Thus, it is said: *\"Hearing the Dao is not difficult; practicing it is difficult. Practicing it is not difficult; completing it is difficult.\"* If the ears and eyes are beset by chaotic thoughts and hardships are not dispelled, even if one treads the halls of immortals or grasps the reins of dragons, it will be of no benefit.\n\nFor *Reverse-Womb Massage*, use *yang days*—the first day as *yang*, the second as *yin*. On each *yang* morning and *yang* night, upon waking from sleep or rising at dawn, promptly close the eyes and face the direction of one’s *life destiny*. First rub the palms together until slightly warm, then use each hand to press the corresponding eye and trace downward to the ear openings, bringing both palms to meet at the nape nine times. Next, visualize within each eye *purple, red, and yellow clouds of qi*, which descend into the ears. After a long while, recite the *yin incantation*:\n\n*\"The Three Clouds of the Eye Youths, the True Lords of the Two Eyes,\nRadiant and luminous, they infuse essence and open the divine gates of the Supreme Mystery.\nThe Cloudy Standards of Grand Simplicity, the Jade Spirits unfold their chapters,\nSafeguarding the twin gates, illuminating the nine portals.\nAll joints respond in resonance, the fluid returns to the Mud-Pill Palace.\nThe body ascends to the Jade Palace, ranked among the Highest Perfected.\"*\n\nAfter reciting, swallow saliva three times, then open the eyes. Make this a regular practice; on *yang* days, it may be performed upon sitting or rising, not only at dawn and dusk. After three years, the ears and eyes will become keen.\n\nWhen combing the hair, always face the direction of one’s *life destiny*. At the start of combing, recite the *yin incantation*:\n\n*\"The Supreme Thearch scatters numinous power, the Five Elders return their spirits.\nThe Mystic Flower of the Mud-Pill Palace preserves essence and ensures its enduring presence.\nOn the left, it gathers the Hidden Moon; on the right, it draws the Root of the Sun.\nThe Six Harmonies refine and purify, and the Hundred Spirits receive grace.\"*\n\nWith constant practice, the head and brain will not ache.\n\nThe *Scripture of the Grand Ultimate* states: When combing the hair, face the *Jade Pool*. At the start of combing, softly recite:\n\n*\"The Mystic Flower of the Mud-Pill Palace preserves essence and ensures its enduring presence.\nOn the left is the Hidden Moon; on the right, the Root of the Sun.\nThe Six Harmonies refine and purify, and the Hundred Spirits receive grace.\"*\n\nAfter reciting, swallow saliva three times. With regular practice, hair will not fall out and will grow anew. Frequently change combs, ensuring thorough combing without causing pain, or have an attendant comb the hair extensively. Thus, blood and fluids will not stagnate, and the roots of the hair will remain firm.\n\nThe above two methods were taught by *An Jiuhua* for application.\n\nWhen sitting or lying down, always direct the nostrils toward one’s *life destiny*; this also applies to eating and drinking. If unable to face one’s *life destiny*, orient toward the northeast or northwest—these are also auspicious, being the *gateways of the soul and spirit of Heaven and Earth*. Additionally, upon rising, often gently shake the body from side to side dozens of times.\n\nThen, place both hands behind the back, lift the head toward the heavens, and gently shake the neck left and right twenty times. When finished, sit upright and raise both hands to prop up the sky for a long while. Next, rub the palms together and use them to wipe the sides of the eyes, reaching the ears, and continue for a long while. Then recite the following incantation in secret:\n\n*\"Front clasp, rear point—celestial guest of the Emperor on High.\nLeft glance, right gaze—great measure of long life.\nLifting the head to pant—Taiyi’s utmost extreme.\nCrescent-moon dragon weir—Controller of Life in shared alignment.\nDrinking and eating the primordial embryo—interlocking with Kunlun.\nInverted double kneel—true person of shared aspiration.\"*\n\nAfter reciting, immediately draw in *qi* and hold it. Visualize a red *qi* within the navel, as large as a thread, emerging from the navel and entering the nostrils. Do this three times, and the method of pressing and rubbing is complete. This practice unblocks the hundred joints, ensuring long life without illness.\n\nThe *Purple Capital’s Radiant Light Inner Vision Central Method* states: Always lie down with eyes closed, settling the body with subtle *qi*, appearing as if merely asleep so that others remain unaware. Then, inwardly gaze and listen afar to the four directions, directing one’s ears and eyes to ten thousand *li* beyond. With prolonged practice, you will naturally perceive events ten thousand *li* away. If you focus your spirit, you may even see a hundred thousand *li* beyond. Within the ears, one may constantly hear the sounds of gold and jade, the melodies of silk and bamboo—this is the wondrous method. The \"four directions\" are merely a general term; one should begin with a single direction, applying the inner method of vision and hearing. Initially, there may be no semblance of success, but with time and sincerity, one will naturally enter the marvelous.\n\nThe *Highest Chapters of the Great Cavern Perfection Scripture’s Supreme Inner Method for Suppressing Demons and the Great Incantation* states: Whenever traveling through perilous paths or passing by ghostly shrines, or when the mind harbors doubts and fears, or when slight apprehensions arise regarding the places one traverses, first curl the tongue inward, swallow saliva three times, then use the third finger of the left hand to press the base of the philtrum beneath the nostrils—specifically, the inner edge of the nasal diaphragm—thirty-six times. Press firmly without lifting the finger to count. The edge of the nasal diaphragm is called *Mountain Source*. *Mountain Source* is also named *Ghost Well*, *Spirit Pool*, *Root of Evil*, and *Terrace of the Soul*. After pressing, knock the teeth seven times, then advance the palm to cover the nose. With eyes closed, softly recite:\n\n*\"Vermilion Bird soars above heaven, divine might inwardly expands.\nMountain Source’s four fills—Ghost Well flees in flight.\nSpirit Pool exhales *qi*—Root of Evil hides in submission.\nTerrace of the Soul shines in four directions—Jade Chamber’s chimes resound.\nJade Perfection stands majestic—seated, it guards the Hall of Light.\nHands radiate purple mist—head bears the dawn’s glow.\nGrasping and chanting the Cavern Scripture’s thirty-nine chapters,\nWithin dwell demon-repelling dragons and tigers,\nWeapon-severing, jar-smashing,\nFierce beasts like galloping oxen,\nSword-swallowing, blade-devouring,\nMountain-lifting, heaven-scaling apes,\nDivine birds and poisonous dragons,\nSix leaders spewing fire,\nGhost-devouring kings,\nLightning swine and thunder fathers,\nStar-snatching, meteor-streaming,\nOwls and blazing swift ones,\nMoving crosswind,\nGreat birds and net-spirits—\nAll stand beside me,\nSpitting ten thousand *zhang* of fire to dispel misfortune.\nMultitudes of spirits open the Dao—sealing and casting them into mountain villages.\nA thousand gods and hundred spirits clasp hands and bow their heads.\nMarshals and constables hold lamps to burn incense for me.\nWherever I go, the myriad spirits welcome me.\"*\n\nWhen finished, knock the teeth three more times, then slowly remove the left hand. Pressing *Mountain Source* closes the *Ghost Well*; clasping *Spirit Pool* scatters the *Root of Evil*; pressing the *Terrace of the Soul* stations *Jade Perfection* to guard the gate. Thereupon, the numinous root is stirred, celestial beasts come to protect, and a thousand spirits tremble and submit, none daring to disturb my *qi*. This is the natural principle, causing it to occur in an instant.\n\nThe *Mountain Source* beneath the nose is the stagnant fluid of the entire body, the thoroughfare of true and evil *qi*. For those who are not true, it generates evil *qi*; for those who are true, it suppresses the myriad evils—all depends on my control and regulation. Thus, good and ill omens manifest here. The *Hall of Light* is also the literary hall of the body, the repository of life and death, the original chamber of the seven *po*, and the numinous abode of the three *hun*. Preserving its spirit enables inner vision; neglecting its Dao leads to decay and rot. Therefore, it is for me to govern—carefully follow its principles of life preservation, and there will be no regrets or faults.\n\nThe above four methods are from the *Highest Chapters of the Great Cavern Perfection Scripture*.\n\nThe *Great Numinous Perfected One* states: Wind diseases arise from dampness in burial mounds, graves, and the three springs where *qi* stagnates. Thus, the earthly officials stir water and *qi* to create wind impediments. Severe wind impediments render the entire body immobile; milder cases affect half the body or cause the loss of hands and feet. If one frequently dreams of wandering in the northeast or northwest, passing by former dwellings, or seeing places where spirit beds were laid, it is precisely because one is about to connect with the *qi* of the tomb. The northeast of a grave is *Zheng Jue Ming* (Death by Decree), and the northwest is *Nine Calamities*—both are inauspicious grounds for tomb disputes. If one dreams of the deceased in these places, the omen is even more evident. Upon encountering such dreams, upon waking, face upward and knock the teeth three times, then recite:\n\n*\"Supreme Primordial, Nine Capitals’ Purple Heaven,\nOrdering the soul and protecting life—High and Pure Perfected One.\nI receive the supreme method, taught by the Great Mystery,\nTo attain long life and enduring vision, body soaring as an immortal.\nTombs forever peaceful, ghostly disputes cease,\nSoul and spirit harmonious, evil *qi* dispelled.\nWandering demons and specters dare not disturb my spirit.\nThe Northern Emperor breaks and restrains, drawing *qi* into the abyss.\nAttaining the register of the Supreme Emperor, my name inscribed before the throne.\"*\n\nRecite this twice, then knock the teeth three times, and one will no longer dream of tombs or deceased family ghosts. This is the secret incantation of the Northern Emperor; those with sincere and virtuous intentions may practice it. If one frequently experiences inauspicious dreams, this method may be applied, causing ghostly *qi* to vanish and evil spirits to scatter.\n\nWhen arms and limbs fail to move, it is because deep wind-toxin *qi* lodges in the meridians, binding and adhering to the bones, causing this condition. Acupuncture and moxibustion are appropriate; with treatment, recovery will follow.\n\nMoreover, one should apply the Northern Emperor’s winding incantation; if performed a hundred times, the illness will swiftly dissipate. First, gently massage the afflicted area with one hand for a long while, then lie down. Inwardly visualize, swallow saliva three times, and knock the teeth three times. Compose the mind and softly recite:\n\n*\"Supreme Four Mysteries, Five Flowers and Six Courts,\nThree Hun and Seven Po, Celestial Pass and Earthly Essence,\nDivine Palace and Guarding Spirits, Heavenly Womb and Supreme Clarity,\nFour Limbs and Hundred Spirits, Nine Joints and Myriad Numina,\nReceive the Register of Jade Dawn, inscribe it in the Jade City.\nJade Maidens attend my body, Jade Lads protect my life,\nForever aligned with the Two Radiant Ones, ascending as an Immortal to the Upper Clarity,\nEver in step with the sun and moon, sharing their boundless years,\nTranscending to rise as an Immortal, attaining Great Peace.\nYet pernicious winds congeal into afflictions, demonic *qi* infuses the Five Dragons,\nSpecters and tomb-*qi*, yin-*qi* intertwined,\nAssailing my four limbs, disrupting my flourishing and decline.\nSupreme Heavenly Soldiers, Dragon and Tiger manifest their might,\nSevering inauspicious ghosts, dispersing wind and evil at once.\nExamine and expel hidden grievances, all poisons and concealed wrongs,\nRestore me to normality, that I may shine with the radiance of sun and moon.\nShould any transgression be detected, the Northern Ghosts shall seize and crush it;\nIf they dare offend the luminous above, their punishment shall be recorded by the Chief of Stars.\"*\n\nFrom the *Scripture of the Supreme Inscription of Lingering Flowers on Scattered Petals*, the method of massage prescribes: At the time of *qi*-generation, swallow saliva fourteen times, then press the painful area while facing the ruler and recite:\n\n*\"Left Mystery and Right Mystery, Three Spirits unite in perfection,\nLeft Yellow and Right Yellow, Six Flowers harmonize,\nWind-*qi* and malignant illness, subdued and concealed in the four directions.\nJade fluid flows with grace, circulating above and below,\nInternally dispatching Water and Fire, externally repelling inauspiciousness,\nTo attain long life as a Divine Immortal, with a body ever strong and at ease.\"*\n\nConclude by swallowing saliva fourteen times again. Practicing this regularly will ensure freedom from illness.\n\nPress the painful area urgently thirty-one times.\n\nThe above method was revealed on the twenty-second day of the tenth month by the Right Radiant Lady Wang of Cloudy Waves and Verdant Grove Palace.\n\nThe *Scripture of the Supreme Numinous Eradication of Demons* states: If the body feels unwell, curl the tongue to block the throat, rinse with saliva, and swallow it without count. After a moment, the discomfort will naturally dissipate. At that time, one will also commonly feel the body relaxed and supple.\n\nThe above method is excerpted from the *Supreme Numinous Eradication of Demons*.\n\nIf dreams are unclear and the *po* soul aligns with malevolent *qi*, it is as though something examines the heart, seeking to ambush the spirit in its moments of vulnerability. Whenever encountering a nightmare, simply face north and invoke the Supreme Lord of the Great Dao, recounting the details. After no more than four or five repetitions, the disturbance will vanish of its own accord.\n\nThe above is a secret oral instruction of the Azure Lad.\n\nWhen encountering ill or inauspicious dreams day or night, upon waking, immediately turn the pillow over and recite while reclining upon it:\n\n*\"Jade Maiden of Supreme Harmony, attend the true and guard the soul,\nSix Palaces’ Golden Lads, come to defend the Gate of Life,\nTransform evil into good, inscribe it above the Three Origins,\nGrant me long life, to ride the radiance and mount the clouds.\"*\n\nConclude by swallowing saliva nine times and clicking the teeth seven times before sleeping. After four or five repetitions, all such disturbances will naturally cease entirely.\n\nThis incantation also reverses inauspicious dreams to auspicious ones.\n\n*Recorded on the night of the thirteenth day of the eleventh month by the Lady of Right Radiance.*\n\nThe numinous pivot of the celestial patterns lies in the clarity of one’s vision; the profound and empty heart, serene and luminous, drifts like mist, savoring the Great Harmony, embodying the qi of the vast and silent. Thereupon, jade chimes resound, and the myriad sounds are summoned in profound stillness.\n\nQi is the craft of spirit and brightness, the wellspring of purity and turbidity. Abiding in the mysterious, it clears the heavens; dwelling in man, it preserves the body. Life knows neither loss nor excess, for it follows the art of nurture and restraint.\n\nTo ingest the Six Qi, one must always begin at dawn, during the hours of *yin* and *chou*, when the celestial timing commences, and the directions align with this moment. As the great rosy clouds part and radiance emerges, when the cinnabar sun rises and the luminous dawn breaks, and the vermilion essence first shines—first visualize the sun as an egg within the *Niwan* Palace. Then exhale one breath, imagining the qi as black, naming it the *Corpse Qi*. Next exhale a second breath, imagining the qi as white, naming it the *Old Qi*. Exhale a third breath, imagining the qi as gray, naming it the *Dead Qi*. Focus on each color while exhaling for a long while. In total, three colors are exhaled, comprising the Six Qi.\n\nAfterward, slowly draw in and guide the qi, inhaling the yellow qi four times. Visualize the qi descending from the sun within the *Niwan* Palace. After four inhalations, swallow saliva three times, completing three full cycles. Then visualize the qi within the *Niwan* Palace descending from the ears and appearing before the mouth, nine inches from the face, so that it seems almost visible to the eyes. Again, riding the sun, draw in and guide the red qi seven times. After seven inhalations, swallow saliva three times to conclude. Then rise and move the four limbs, bending and stretching to harmonize the joints and meridians, completing the practice. When visualizing and swallowing saliva, always imagine it as green.\n\nAt night, one may also visualize the moon within the *Niwan* Palace, following the same method as for the sun. For moon visualization, begin at midnight on the first day of the lunar month and continue until the fifteenth. From the sixteenth to the thirtieth, the moon’s qi wanes and diminishes, and the celestial embryo contracts—do not visualize the moon at night during this period.\n\nThis method is most wondrous; those who practice it attain immortality. It is the art of exhaling and inhaling the primordial embryo, rinsing and absorbing the luminous truth. By timely invocation and fivefold swallowing, one attains the natural state, the hun-soul returns to its abode, and the po-soul rests in the *Niwan* Palace—thus is long life achieved. How can it compare to gathering the yin qi of secluded valleys, seeking the swift spirits of galloping horses, treading the sea in search of passage, or driving feathered chariots upon fiery mountains? Be cautious, be most cautious.\n\n*Secret Instructions of the Queen Mother of the West.*\n\nOn the night of the fourth day of the seventh month in the third year of *Xingning* of the *Yichou* era, the Lord of Life, Eastern Minister, descended with seven attendants entering the chamber. One held a flowered banner, also called the *Tenfold Numinous Pennant*; another bore a ring and a satchel of seals; three carried white ivory boxes, within which appeared to be books. Another grasped a flowing-gold fire-bell. The attendants were all clad in vermilion.\n\nThe Lord of Life appeared far younger than his two younger brothers, clad in a green brocade skirt, a purple fur cape, and a lotus crown at its center. His two brothers had likewise come to stand in attendance, and only after being bidden to sit did they take their seats. They spoke at length.\n\nOn the night of the sixth day of the seventh month, the Lord of Life descended once more to deliver a written admonition, saying: Should one truly model oneself upon the profound and embrace the symbolic, maintaining purity and tranquility in rare moments, then one may pluck the hidden blossoms from the thronging shadows, fold one’s wings and nest in lofty seclusion, savor the resonance of higher accord, abide in the stillness of deep pools and the steadfastness of mountains, wander through jade-like scriptures in serene solitude, and nurture the divine within by treasuring the sacred. Casting aside worldly attachments, one harmonizes and plays the pure numen, clarifying the inner vision within emptiness. The Five Ways become luminous, form transcends the waves of transformation, desire merges with stillness, and emptiness unites with the obscure thoroughfare. With neither sight nor hearing, one thus aligns with the subtlest truth, reawakens profound awareness, perfects virtue within, and stabilizes the spirit without. In the end, one may ride cloud chariots to ascend the heavens and inscribe the Lord of Life’s cinnabar register.\n\nYet if the mind scatters into ten thousand thoughts and life is not firmly rooted, if qi follows the dust and waves while the heart does not truly dwell in its abode, then one merely wearies body and spirit among the mountains and valleys, truly misleading those who come to learn. The Way is subtle yet easy to seek; the Way is arduous yet difficult to attain.\n\nOn the night of the fifth day of the month at midnight, visualize the solar image within the heart, allowing the sun to enter through the mouth. Let it illuminate the heart’s interior, merging its light with the sun’s radiance. When the union is complete, one should feel warmth in the heart, suffused with rosy glow as verification. After a long while, recite the incantation: *\"Great brightness nurtures essence, refining the cinnabar heart within. Light and radiance merge, and the divine and true come to the body.\"* Upon completion, swallow saliva nine times.\n\nRepeat this practice on the fifteenth, twenty-fifth, and twenty-ninth days of the month. Through this, one’s perception becomes keen and clear, the hundred passages unobstructed, the face radiant with jade-like light, and the body suffused with golden liquid. After five years of practice, the Great One will dispatch a protective chariot to welcome you, ascending to the Supreme Empyrean. The practice need not be confined to these specific days but should be frequent.\n\nThis passage is excerpted from the *Scripture on Dispelling Demons*, an inner method of the Red Lord of Southern Marchmount.\n\nIt further states: When partaking of meals, do not speak of matters of death, nor expose food, lest it attract the qi of manifold malevolent spirits.\n\nIt also advises: Bathe frequently, and on the day of *jiazi*, one must wash one’s hair. If not, then at dawn on the first day of the month, one should bathe to facilitate communion with the numinous. The concern is not with the frequency of bathing but with the practitioner’s inability to do so. By scouring and refining the stench of the corpse, the true qi enters.\n\nThese are the instructions of the Mystic Master, Lady Wei, to be implemented as directed.\n\nThe *Scripture of the Supreme Nine Transformations and Ten Transmutations for Renewal* states: When treading upon filth or any unclean place, one should first bathe to dissolve and dispel it. The method employs ten ounces of bamboo leaves and four ounces of peeled white peach bark, boiled in one *hu* and two *dou* of clear water in a cauldron. Before boiling, remove the liquid, adjust to a suitable temperature, and bathe the body, thereby eliminating all filth. This not only dispels impurities but also prevents damp impediment, sores, and itching.\n\nMoreover, bamboo is hollow, plain, and inwardly white, while peach repels evil and breaks filth. Thus, these two substances are used to purge the turbidity within the body. When celestial beings descend to the mortal realm and return, they invariably use this water for cleansing. Compared to the common techniques of talismanic water, incantations, and external rinsing, none match this method. While bathing with this water is even more beneficial, it should not be used for washing the hair. The pure essence for refining the corpse is precisely suited for bathing—truly wondrous and secret.\n\nThese are the directives of the Lady of the Purple Tenuity of the Mystic Mound Feather Palace, to be employed as commanded.\n\nAt dawn on an auspicious day, face the *wang* direction, write in vermilion, bow twice, and ingest.\n\nThe incantation reads:\n\"Five spirits open the heart, penetrating hearing and absolute sound;\nThree souls gather essence, steadfastly guarding the cinnabar heart.\nLet me not forget, as the five viscera seek afar.\"\n\nFirst bow, then recite the incantation upon completion of the bow. After reciting, ingest the talisman, then swallow saliva five times and click the teeth five times. Do not let others witness this.\n\nIf an *opening day* is not used, employ the first day of the month, the fifteenth day, and the twenty-seventh day—three ingestions per month. Within a year, efficacy will manifest. This is a secret talisman.\n\nOral instructions of the Perfected One of Great Emptiness:\nOn a *yi-mao* day in spring, *bing-wu* day in summer, *geng-shen* day in autumn, or *ren-zi* day in winter, at the hour of dark repose, first grind cinnabar, realgar, and orpiment—each in equal thirds—finely, then wrap them in silk to form a ball the size of a jujube. At bedtime, insert these into both ears. This is the wondrous and secret method for dissolving the Three Corpses and refining the Seven Po. Let no one know of this.\n\nThe next day at noon, bathe in east-flowing water. After bathing, rearrange the bedding and mat, change into fresh clothing, wash the old garments, replace worn shoes, and cleanse them thoroughly. Once all is done, sweep and sprinkle water beneath the sleeping couch, ensuring the entire chamber is pure and clean. Then, recline upon the pillow, face upward, close the *qi*, clench the fists firmly for a long while, and softly recite:\n\"The Dao of Heaven is constant, renewing the old and making it new.\nOn this auspicious day of the Supreme Thearch, bathing refines the true.\nThe Three *Qi* dissolve the corpse, cinnabar and yellow settle the soul.\nPrecious refinement of the Seven Po, may they draw near to me.\"\n\nUpon completion of the recitation, this method is the supreme technique for dissolving and refining corpse impurities, the essential secret for transforming and renewing the form. Perform this once in each of the four seasons.\n\nThe Perfected One of Great Emptiness said:\n\"As my former master taught, on the *Five Pervading Days*, when the sun has risen three or four *zhang*, stand upright facing the sun. Visualize the Three Soul spirits entering the heart together with the sunlight, perfectly aligned and inwardly penetrating for a long while. Close the *qi* for three breaths, swallow saliva three times, and softly recite:\n'The radiance of the Great Yang scatters its brilliance, casting purple and azure light.\nEnter my body, illuminate my five forms.\nRepel demonic trials, steady and align my heart.\nInwardly penetrate the Nine *Qi*, outwardly connect with the embryo’s destiny.\nAscend as a flying immortal to the Jade Purity, my name inscribed in the Jade Register.'\n\nAfter the incantation, wipe the eyes fourteen times and click the teeth fourteen times. Once all is done, this method causes the Three Souls to congeal in clarity, the cinnabar heart to become upright, all myriad evils to hide and submit, and demonic trials to cease. Truly, this is an essential Dao. You should practice this regularly on the *Five Pervading Days*, facing the sun to induce sneezing. If sneezing does not occur, use a soft object to gently stimulate the nose while facing the sun, and sneezing will follow. Upon sneezing, recite:\n'Heavenly light advances, the Six Embryos ascend and connect.\nThree Souls guard the spirit, Seven Po do not perish.\nReceiving the sun’s sneeze, I share its form.\nFly as an immortal to the Jade Purity, attaining the rank of Perfected Lord.'\n\nAfter reciting, wipe the eyes fourteen times. This causes the inner essence to ascend and merge with the sunlight, the Three Souls to radiate brilliance within, opening the heart and enlightening the spirit, while the hundred essences flow and circulate within the inner palace. If it is not one of the *Five Pervading Days*, this need not be done.\n\nOn the *Five Pervading Days*, face north and bow five times. With a sincere heart, invoke the names of the Supreme Perfected Sovereign and the Sovereign’s Lady three times. After completing this, click the teeth five times, remove your headscarf, and kneel lengthwise. Reverently address the August Perfected of the Five Stars, the Sun, the Moon, the Highest Perfected of the Dao, the Thirty-Two Heavenly Thearchs, the Jade Purity, the Supreme Purity, the August Thearch of the Highest Purity, and the Sagely Lord of the Great Dao before the few, stating:\n'From my seven generations of ancestors and parents down to myself, for the thousand transgressions and myriad faults committed since past lives, I beseech deliverance. May the Three Offices report to the Heavenly Thearch, causing my sins to be absolved, my name stricken from the black tally. I pray to receive the true essence of the Five Stars, hastening together to the Flowery Dawn, ascending to the Supreme Purity, and traversing the Jade Gate.'\n\nThe *Five Pervading Auspicious Days* are:\n- First month: sixth day at noon\n- Second month: first day at dusk\n- Third month: seventh day at midnight\n- Fourth month: ninth day at breakfast\n- Fifth month: fifteenth day at midnight\n- Sixth month: third day at noon\n- Seventh month: seventh day at midnight\n- Eighth month: fourth day at noon\n- Ninth month: second day at dawn\n- Tenth month: first day at dawn\n- Eleventh month: sixth day at midnight\n- Twelfth month: second day at midnight\n\nMethod for Ingesting the Essence of the Sun and Moon:\nOn the first day of the lunar month, when the sun has risen two *zhang* high, gaze toward it from afar, clench the fists, take three *Yu* steps facing east, and draw in the sun’s essence fourteen times with the mouth, swallowing it. After fourteen days, you may enter a household afflicted with warm disease, and no other illness will touch you. Those who accompany you will feel light, and if you sleep thus, you will attain longevity.\n\nOn the third day of the lunar month, when the moon rises in the *geng* position, clench both fists, walk southwest, face the moon, take three *Yu* steps, and draw in the moon’s essence fourteen times with the mouth, swallowing it. For the entire year, you will be free from illness and may also enter households of the deceased.\n\nThe sun and moon illuminate impurities and filth. These two methods—ingesting the sun’s essence and drinking the moon’s essence—dissolve and eliminate the myriad illnesses.\n\n*Scripture of the Western Queen Mother on the Precious Spirit’s Daily Practices from the Cavernous Perfection* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真西王母宝神起居经 经名：洞真西王母宝神起居经。 撰人不详，约出於东晋南朝。 系摘咏《真语》、《上清三真旨要玉诀》 等书改编而成。 有《西王母宝神起居经》、《西王母宝生无死玉经》、《西王母反胎按摩玉经》等篇。 一卷。 底本出处：《正统道藏》正一部。 洞真西王母宝神起居经 西王母宝神起居经 夜卧觉，旦将起常更，又急闭两目，叩齿九通，咽液三过毕，反舌向喉中，乃摇头动项七过，以手按鼻孔边，左右上下数十过，毕，微祝曰： 九天上帝，三元保婴，太上运华，玉室发精，七门召神，九房受明，耳聪目彻，通真达灵，天中之岳，和炁调平，骄女云仪，眼童英明，玄窗朗朗，百轩零零，保和上元，徘徊金庭，五脏曜华，耳目常生，神台郁峙，柱梁不倾，七魄澡练，三魂黄宁，太上携手，与我共并，五老混合，无英辅营，万凶消灭，所愿必成，日月守门，心徊景星，仙皇所告，万神敬听。 卧觉辄按祝，常如此勿忘也。 真道虽成，故常行焉。",
      "translated_text": "**The Scripture of the Western Royal Mother’s Precious Spirit and Daily Practice**\n\n**Title:** *The Scripture of the Western Royal Mother’s Precious Spirit and Daily Practice*. Author unknown, approximately composed during the Eastern Jin or Southern Dynasties. Adapted from selections of *True Words* and *The Essential Jade Instructions of the Three Perfected Ones of Supreme Purity*, among other texts. Includes chapters such as *The Scripture of the Western Royal Mother’s Precious Spirit and Daily Practice*, *The Jade Scripture of the Western Royal Mother’s Treasure of Life Without Death*, and *The Jade Scripture of the Western Royal Mother’s Rebirth and Massage*. One scroll. Base text from *The Orthodox Daoist Canon*, Section Zhengyi, First Division.\n\n---\n\n**The Scripture of the Western Royal Mother’s Precious Spirit and Daily Practice**\n\nUpon waking at night or rising at dawn, first close both eyes tightly. Then, click the teeth nine times, swallow saliva three times, and press the tongue against the throat. Next, shake the head and move the neck seven times. With the hands, press along the sides of the nostrils, moving up and down dozens of times on the left and right. When finished, softly recite the following invocation:\n\n*\"The Nine Heavens’ Supreme Emperor, the Three Origins’ Protector of Infants,\nThe Supreme One unfurls the flower, the Jade Chamber emits essence.\nThe Seven Gates summon the spirits, the Nine Chambers receive illumination.\nEars keen, eyes clear, penetrating the true and reaching the numinous.\nThe Heavenly Peak of the Central Realm, harmonizing qi and balancing equilibrium.\nThe Proud Maiden’s cloud-like bearing, the Eye Lad’s radiant brightness.\nThe Mystic Window gleams, the Hundred Portals shine.\nPreserve harmony in the Upper Origin, wander the Golden Court.\nThe five viscera glow with splendor, ears and eyes ever renewed.\nThe Spirit Terrace stands towering, its pillars and beams unshaken.\nThe Seven Po dissolve and refine, the Three Hun rest in yellow tranquility.\nThe Supreme One takes my hand, walking beside me as one.\nThe Five Elders merge in unity, the Peerless assists and guards.\nMyriad evils vanish, all wishes surely come to pass.\nSun and Moon stand guard at the gates, the heart dwells with the auspicious star.\nAs the Immortal Sovereign declares, the ten thousand spirits heed with reverence.\"*\n\nUpon waking, always perform this pressing and invocation—never forget it. Though the true Dao may be attained, still practice this without fail.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 400,
      "start_sentence": 0,
      "end_sentence": 12,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.570966720581055,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真西王母宝神起居经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "此太上西王母宝神起居玉经上法也。 令人耳目聪明，强识豁朗，鼻中调平，不生洟秽，四卿八彻，面有童颜，制魂录魄，却辟万魔。 此是真人起居之妙道也。 所以名之为起居者，起居常当行之。 又以两手摩拭面目，令小热以为常，每欲数之也。 阿母云：人之将老，面皱先从两目下始，又人之体衰炁少者，先从两鼻间也。 谓此二处是皱衰之户牖，炁力之关津，故起居常行此法，以辟皱衰，而炁力常保康和也。 西王母宝生无死玉经 无死玉经曰：手披华庭侧，迁延和天真，上入神涧房，玉谷填天山，内源玄灵见，万魔自灭身，长生永无死，玉籍反帝君，由兆和天真，按此幽山源。 天真在两眉间，眉内之两角也，天真在一分下耳，是引灵之上房也。 山源在鼻下人中之上本侧，在鼻下小入孔谷中也，是塞灭万魔之门户也。 华庭在两眉之下，对眉下之中央，是彻视之津梁也。 旦将起，暮将卧，更急闭两目，以舌反向喉中，咽液三过，急以手按此三处各九过，阴按之，勿举手也。 以为常，令人长生无死，降灵彻视，塞灭万鬼之道。 手按既毕，微咒曰： 太上虚皇，开散玉庭，金房煌朗，翠台郁青，我摄三道，灭鬼生灵，我能无死，亦能无生，长生自在，回老反婴，魂魄受练，五神安宁，回飙车轮，北谒玉清，上升太元，与日合并，遂为真人，帝君合冥，三元所告，万神敬听。 昔楚庄公时，市长宋原甫者，有善心，常自扫除一市中。 久时乃有一乞食人，入市经年，旦乞高歌，歌辞曰：天庭生金华，内源障阴邪，玉谷参玄卿，琼炁互扶罗，天真立日上，飞药吐灵妙，清晨按天马，徊驾神玄家，仙人来入室，又以灭百魔。 临去，又题市门如此。 楚一市人无解，而原甫意中忽悟，疑是仙人，但不解其歌旨耳。 遂乃叩头谘请，久久不已，乞人告曰：吾实真人也，此言是昆仑西王母宝生无死之曲，知者使人不死。 遂授原甫要法施行密诀，积二十年，原甫白日升天，今在玄洲，位为仙卿。 楚市乞人，是南岳真人赤松子矣。 时分形散景，假适尘浊，游眺嚣秽，招迎真会也。 《清虚真人裴君说神宝经》曰：求道要先令目清耳聪，为事主也。 且耳目是寻真之梯级，综灵之门户，得失系之而立，存亡须之而办也。 今抄经相示，可施用也。 《消魔上篇》曰：耳欲得数按抑其左右，亦令无数，所谓营治城郭，名书帝籍。 鼻亦欲数按其左右，惟令〔无〕#1数耳，所谓灌溉中岳，名书帝箓。 此二条出方丈台昭灵李夫人口诀，九月十二日夜喻之。 道日，常以手按两眉后小空中三过，又以手心及指摩两目下权上，以手捉耳行三十过，摩唯令数无时节也。 毕，辄以手逆乘额三九过，从眉中始，乃上行入发际中，口傍咽液，多少无数也。 如常行，目日清明，一年可夜书。 亦可於人中密为之，勿语其状。 眉后小空中，为上元六合之府，主化生眼晖，和莹精光，长珠彻童，保练目神，是真人坐起之上道也。 一名曰真人常居内经。 真人喭曰：子欲夜书，当修常居矣。 真人所以能旁观四达，八遐照朗者，实常居之数明也。 目下权上，是决明保室归婴至道，以手捉耳行，深明映之术也。 於是理关血散，皱班不生，目华玄映，和精神盈矣。 夫人之将老，鲜不先始於耳目也。",
      "translated_text": "This is the Supreme Highest Western Queen Mother’s *Precious Scripture on the Jade Arts of Rising and Resting*. It sharpens the ears and brightens the eyes, strengthens memory and clears the mind, harmonizes the breath within the nose so that no foul mucus arises, illuminates the Four Ministers and Eight Penetrations, and restores the complexion to youthful radiance. It governs the hun and records the po, repelling the ten thousand demons. This is the wondrous Dao of the Perfected One’s rising and resting.\n\nThe term “rising and resting” means that this practice should be performed regularly upon waking and before sleep. Additionally, one should rub the hands together until slightly warm and then massage the face and eyes as a daily habit, repeating this several times.\n\nThe Divine Mother says: When a person begins to age, wrinkles first appear beneath the eyes. When the body’s vitality declines and qi diminishes, it first manifests between the nostrils. These two areas are the doors and windows of wrinkles and decline, the passes and fords of qi and strength. Thus, regularly practicing this method wards off wrinkles and decline, preserving qi and strength in constant health and harmony.\n\nThe *Jade Scripture of Deathlessness* states:\nHands part the blossoming courtyard’s side,\nLingering to harmonize with Heavenly Perfection.\nAbove, enter the Spirit Gorge’s chamber,\nJade Valley fills the Celestial Mountain.\nThe inner source reveals the Mysterious Numinous,\nThe ten thousand demons self-destruct.\nEternal life without death,\nJade registers return to the Lord Emperor.\nThrough you, harmonize with Heavenly Perfection,\nPress this secluded mountain source.\n\nHeavenly Perfection resides between the eyebrows, at the inner corners of the brows—one fen below the ears is the upper chamber for drawing in the numinous. The mountain source lies beside the philtrum above the upper lip, slightly within the nostrils’ hollow—this is the gate that seals and extinguishes the ten thousand demons. The blossoming courtyard is below the eyebrows, at the center directly beneath them—this is the bridge for penetrating vision.\n\nAt dawn upon rising and at dusk before sleep, swiftly close both eyes, curl the tongue back toward the throat, and swallow saliva three times. Then, with urgency, press these three places nine times each, pressing inwardly without lifting the hands. Make this a constant practice, and it will grant long life without death, descending spirits and penetrating vision, sealing and extinguishing the path of the ten thousand ghosts.\n\nAfter pressing the hands, softly recite the incantation:\nSupreme Void Sovereign,\nOpen and scatter the Jade Court.\nThe Golden Chamber gleams radiant,\nThe Emerald Terrace stands lush and green.\nI gather the Three Paths,\nExtinguish demons and give birth to spirits.\nI attain deathlessness,\nAnd also transcend life.\nEternal life is free,\nReversing age to return to infancy.\nHun and po are refined,\nThe Five Spirits rest in peace.\nThe whirlwind’s chariot wheels turn,\nNorthward I visit Jade Clarity.\nAscending to the Great Origin,\nI merge with the sun.\nThus I become a Perfected One,\nThe Lord Emperor unites in darkness.\nProclaimed by the Three Origins,\nThe ten thousand spirits heed with reverence.\n\nDuring the reign of King Zhuang of Chu, there was a market chief named Song Yuanfu, a man of good heart who regularly swept the entire market himself. After some time, a beggar entered the market and stayed for a year. Each morning, he would beg while singing loudly:\nThe Heavenly Court births golden blossoms,\nThe inner source blocks yin evil.\nJade Valley joins the Mysterious Minister,\nJade qi mutually supports the web.\nHeavenly Perfection stands above the sun,\nFlying medicine spouts numinous wonders.\nAt dawn, press the Heavenly Steed,\nLinger and drive to the Spirit’s Mysterious Home.\nThe Immortal enters the chamber,\nAnd thus extinguishes the hundred demons.\n\nBefore leaving, he inscribed these words on the market gate. No one in the Chu market understood them, but Yuanfu suddenly grasped their meaning and suspected the beggar was an immortal—though he did not comprehend the song’s deeper import. He knelt and repeatedly entreated the beggar for instruction. After some time, the beggar said: “I am indeed a Perfected One. These words are the *Precious Song of Deathlessness* from the Kunlun Western Queen Mother. Those who know it transcend death.” He then transmitted the essential method and secret instructions to Yuanfu. After practicing for twenty years, Yuanfu ascended to heaven in broad daylight and now resides on the Dark Continent, where he holds the rank of Immortal Minister. The beggar in the Chu market was none other than the Perfected One of South Mountain, Red Pine.\n\nAt times, he divided his form and scattered his radiance, temporarily descending into the dust and filth to wander and observe the clamor, summoning and welcoming true encounters.\n\nThe *Divine Precious Scripture as Told by Perfected Lord Pei of Pure Emptiness* states: To seek the Dao, one must first make the eyes clear and the ears sharp, for these are the primary agents of all affairs. The ears and eyes are the ladder for seeking the Perfected and the gate for gathering the numinous. Success and failure depend on them, and life and death are determined by them. Now I transcribe this scripture to share—practice it diligently.\n\nThe *Upper Chapter on Dispelling Demons* says: Frequently press and rub the left and right ears, without limit—this is called “tending the city walls,” and one’s name is recorded in the Emperor’s register. Also frequently press the left and right sides of the nose, without limit—this is called “irrigating the Central Peak,” and one’s name is recorded in the Emperor’s ledger. These two methods originate from the oral instructions of Lady Li of Bright Numinosity on Bright Terrace, imparted on the night of the twelfth day of the ninth month.\n\nThe Dao says: Regularly press the small hollows behind the eyebrows three times. Also, use the palms and fingers to massage the area beneath the eyes and above the cheekbones. Grasp the ears and pull thirty times. Massage frequently, without fixed timing. Upon finishing, reverse the hands and stroke the forehead twenty-seven times, beginning at the space between the eyebrows and moving upward into the hairline. Meanwhile, swallow saliva, without limit to the amount. If practiced regularly, the eyes will grow clear and bright by day, and within a year, one will be able to write at night. This may also be done discreetly at the philtrum, without speaking of its form.\n\nThe small hollows behind the eyebrows are the mansion of the Upper Origin’s Six Harmonies, governing the generation of eye radiance, harmonizing and polishing essence and light, preserving the long pearl and penetrating the child’s vision, refining and training the eye spirits. This is the supreme Dao of the Perfected One’s sitting and rising—also called the *Perfected One’s Scripture of Constant Abiding Within*.\n\nThe Perfected One sighed and said: If you wish to write at night, you must cultivate the *Constant Abiding*. The reason the Perfected One can observe all four directions and illuminate the eight distant realms is truly due to the clarity of this *Constant Abiding* practice.\n\nThe area beneath the eyes and above the cheekbones is the *Hall of Bright Resolution*, the *Returning to Infancy’s Supreme Dao*. Grasping and pulling the ears is the art of deep illumination. Through this, the blood flows smoothly, wrinkles and blemishes do not form, the eye’s brilliance shines mysteriously, and spirit and essence flourish in harmony.\n\nWhen a person begins to age, it seldom does not first manifest in the ears and eyes.",
      "overlap_context": " tranquility.\nThe Supreme One takes my hand, walking beside me as one.\nThe Five Elders merge in unity, the Peerless assists and guards.\nMyriad evils vanish, all wishes surely come to pass.\nSun and Moon stand guard at the gates, the heart dwells with the auspicious star.\nAs the Immortal Sovereign declares, the ten thousand spirits heed with reverence.\"*\n\nUpon waking, always perform this pressing and invocation—never forget it. Though the true Dao may be attained, still practice this without fail.",
      "start_char": 400,
      "end_char": 1658,
      "start_sentence": 13,
      "end_sentence": 53,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.67161011695862,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真西王母宝神起居经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "又老形也，亦发始於目际之左右也。 以手乘额上，内存赤子、日月双明，上元欢喜，三九始周，数毕乃止。 此谓乎朝三元固脑坚发之道也。 头四面，两手乘之，顺发就结，惟令多也。 於是头血流散，风湿#2不凝也。 都毕，以手按目四眦二九，觉令见光分明，是验眼神之道，久为之，得见百灵。 石景子经曰：常能以手掩口鼻，临目微炁，久许时，手中生液，追以摩面目。 常行之，使人体香。 《太上三天关玉经》曰：常欲手按目近鼻之两訾，闭炁为之，炁通辄止，吐而后始。 常行之，眼能洞观。 右二条，南岳魏夫人所出。 《丹字紫书三五顺行经》曰：坐常欲闭目内视，存见五藏肠胃。 久行之，自得分明了了也。 《太素丹景经》曰：一面之上，常欲得两手摩拭之，使炁热，高下随形，皆使极匝人，面有光泽，皱班不生，行之五年，色如少女。 所谓山川行气，常盈不没。 《丹景经》曰：先当摩拭两手令热，然后以拭面目毕，又顺手摩发，如理栉之状，两臂亦更互以手摩之，使发不白，脉不浮升。 《大洞真经精景按摩篇》曰：卧起，常平炁正坐，先叉两手，乃度以掩项后，因仰面视上，与项争，使项与两手争也，为之三四止，使人精和血通，风炁不入，能久行之，不死不病。 毕，又屈动身体，伸手四极，反张侧掣，宣摇百关，为之各三。 卧起先以手巾若厚帛，拭项中四面及耳后，使圆匝热，温温然也。 顺发摩头，若栉理之无在也。 良久，摩两手以治面目。 久行之，使人目明，而邪气不干，形体不垢，去秽也。 都毕，而咽液三十过，以导内液。 右一条，出《大洞精景经》中。 西王母反胎按摩玉经 养生之道，以耳目为主。 杂视则目暗，广忧则耳闭，此二病从身中来而结病，非外客之假祸也。 所谓闻道之难也，非闻道之难，行道难也； 非行道之难，而终道难矣。 若夫耳目乱想，不遣艰难，虽复足蹑仙阁，手攀龙轩，犹无益也。 反胎按摩，常以阳日，用一日为阳，二日为阴。 每阳日之旦，阳日之夜，夜卧觉，日一将起，急更闭目，向本命之方，以两手掌先相摩切，令小热，各左右试按两目，就耳门下，令两掌俱交会於项中九过。 又存两目中各有紫赤黄三色云炁，各下入两耳中，良久，阴咒曰： 眼童三云，两目真君，英明注精，开通帝神，太玄云仪，玉灵敷篇，保利双阙，启彻九门，百节应响，徊液泥丸，身升玉宫，列为上真。 咒毕，因咽液三过。 既毕，乃开目。 以为常，阳日坐起常可行此，不必旦暮也。 行之三年，耳目聪明。 理发，常向本命，既栉发之始，而阴咒曰： 太帝散灵，五老反神，泥丸玄华，保精长存，左拘隐月，右引日根，六合清练，百神受恩。 毕。 常行之，使人头脑不痛。 《太极经》曰：理发，欲向玉池，既栉发之始，而微祝曰： 泥丸玄华，保精长存，左为隐月，右为日根，六合清练，百神受恩。 祝毕，咽液三过。 能常行之，使发不落而日生。 当数易栉，栉之取多而不使痛，亦可令侍者栉取多也。 於是血液不滞，发根常坚。 右二条，安九华所告令施用。 坐卧，常欲鼻孔向本命，饮食亦然。 若不得向本命，常向东北及西北，亦佳也。 此二处，是天地魂魄之门津也。 又卧起，常自左右摇动身体数十过。",
      "translated_text": "The signs of aging also first appear at the outer corners of the eyes. Place your hands upon the forehead, inwardly visualize the *Red Child* and the *Dual Brightness of Sun and Moon*, and rejoice in the *Upper Prime*. Perform this for three cycles of nine repetitions, ceasing only when the count is complete. This is called the *Morning Practice of the Three Primes to Fortify the Brain and Strengthen the Hair*.\n\nFor the four sides of the head, use both hands to stroke along the hair, following its natural flow to gather and bind it, ensuring frequent repetition. Thus, the blood in the head flows freely, and *wind-dampness* does not congeal. When finished, press the four corners of the eyes eighteen times until light is distinctly perceived—this verifies the *Way of the Eye Spirit*. With prolonged practice, one may behold the *Hundred Spirits*.\n\nThe *Scripture of Master Stone Scenery* states: Often cover the mouth and nose with your hands, bringing them near the eyes while gently exhaling *qi*. After some time, fluid will form in the palms; use it to anoint the face and eyes. Regular practice imparts fragrance to the body.\n\nThe *Jade Scripture of the Three Celestial Passes* says: Frequently press the areas near the eyes and beside the nose, closing the breath to perform this. Cease when the *qi* flows through, then exhale and begin anew. With constant practice, the eyes gain penetrating vision.\n\nThe above two methods originate from *Lady Wei of South Mountain*.\n\nThe *Scripture of the Three-Five Sequential Flow in Cinnabar Script* states: When seated, often close the eyes and inwardly observe, visualizing the five viscera and intestines. With prolonged practice, they become distinctly clear.\n\nThe *Scripture of the Cinnabar Scenery of Grand Simplicity* says: On the face, frequently use both hands to rub and wipe, generating warmth. Follow the contours of the face, ensuring thorough coverage. The face will gain luster, wrinkles and blemishes will not form, and after five years of practice, the complexion will resemble that of a maiden. This is what is meant by *\"the qi of mountains and rivers, ever full and never depleted.\"*\n\nThe *Scripture of Cinnabar Scenery* further states: First rub the hands together until hot, then wipe the face and eyes. Next, stroke the hair as if combing it, and alternately massage the arms with the hands. This prevents hair from whitening and keeps the vessels from floating upward.\n\nThe *Section on Massage from the Scripture of Grand Cavern’s Essence and Scenery* says: Upon rising, sit upright and regulate the breath. First clasp the hands, then raise them to cover the back of the neck. Tilt the head back to gaze upward, creating tension between the neck and hands. Perform this three or four times to harmonize essence and circulate blood, preventing the intrusion of *wind-qi*. With long practice, one attains freedom from death and illness. Afterward, bend and stretch the body, extend the limbs to their utmost, arch backward, and twist to the sides, activating all joints—each movement performed three times.\n\nUpon rising, first use a towel or thick cloth to wipe the neck on all sides and behind the ears until warm. Then stroke the head as if combing the hair, ensuring thorough coverage. After some time, massage the hands and tend to the face and eyes. With prolonged practice, the eyes become bright, evil *qi* does not invade, the body remains free of grime, and impurities are dispelled. Conclude by swallowing saliva thirty times to guide the inner fluids.\n\nThe above method is from the *Scripture of Grand Cavern’s Essence and Scenery*.\n\n---\n\n**The Jade Scripture of Queen Mother of the West’s Reverse-Womb Massage**\n\nThe *Way of Nurturing Life* takes the ears and eyes as its foundation. Scattered vision dims the eyes, and excessive worry blocks the ears—these two afflictions arise from within the body and form illness, not from external misfortune. Thus, it is said: *\"Hearing the Dao is not difficult; practicing it is difficult. Practicing it is not difficult; completing it is difficult.\"* If the ears and eyes are beset by chaotic thoughts and hardships are not dispelled, even if one treads the halls of immortals or grasps the reins of dragons, it will be of no benefit.\n\nFor *Reverse-Womb Massage*, use *yang days*—the first day as *yang*, the second as *yin*. On each *yang* morning and *yang* night, upon waking from sleep or rising at dawn, promptly close the eyes and face the direction of one’s *life destiny*. First rub the palms together until slightly warm, then use each hand to press the corresponding eye and trace downward to the ear openings, bringing both palms to meet at the nape nine times. Next, visualize within each eye *purple, red, and yellow clouds of qi*, which descend into the ears. After a long while, recite the *yin incantation*:\n\n*\"The Three Clouds of the Eye Youths, the True Lords of the Two Eyes,\nRadiant and luminous, they infuse essence and open the divine gates of the Supreme Mystery.\nThe Cloudy Standards of Grand Simplicity, the Jade Spirits unfold their chapters,\nSafeguarding the twin gates, illuminating the nine portals.\nAll joints respond in resonance, the fluid returns to the Mud-Pill Palace.\nThe body ascends to the Jade Palace, ranked among the Highest Perfected.\"*\n\nAfter reciting, swallow saliva three times, then open the eyes. Make this a regular practice; on *yang* days, it may be performed upon sitting or rising, not only at dawn and dusk. After three years, the ears and eyes will become keen.\n\nWhen combing the hair, always face the direction of one’s *life destiny*. At the start of combing, recite the *yin incantation*:\n\n*\"The Supreme Thearch scatters numinous power, the Five Elders return their spirits.\nThe Mystic Flower of the Mud-Pill Palace preserves essence and ensures its enduring presence.\nOn the left, it gathers the Hidden Moon; on the right, it draws the Root of the Sun.\nThe Six Harmonies refine and purify, and the Hundred Spirits receive grace.\"*\n\nWith constant practice, the head and brain will not ache.\n\nThe *Scripture of the Grand Ultimate* states: When combing the hair, face the *Jade Pool*. At the start of combing, softly recite:\n\n*\"The Mystic Flower of the Mud-Pill Palace preserves essence and ensures its enduring presence.\nOn the left is the Hidden Moon; on the right, the Root of the Sun.\nThe Six Harmonies refine and purify, and the Hundred Spirits receive grace.\"*\n\nAfter reciting, swallow saliva three times. With regular practice, hair will not fall out and will grow anew. Frequently change combs, ensuring thorough combing without causing pain, or have an attendant comb the hair extensively. Thus, blood and fluids will not stagnate, and the roots of the hair will remain firm.\n\nThe above two methods were taught by *An Jiuhua* for application.\n\nWhen sitting or lying down, always direct the nostrils toward one’s *life destiny*; this also applies to eating and drinking. If unable to face one’s *life destiny*, orient toward the northeast or northwest—these are also auspicious, being the *gateways of the soul and spirit of Heaven and Earth*. Additionally, upon rising, often gently shake the body from side to side dozens of times.",
      "overlap_context": "uly due to the clarity of this *Constant Abiding* practice.\n\nThe area beneath the eyes and above the cheekbones is the *Hall of Bright Resolution*, the *Returning to Infancy’s Supreme Dao*. Grasping and pulling the ears is the art of deep illumination. Through this, the blood flows smoothly, wrinkles and blemishes do not form, the eye’s brilliance shines mysteriously, and spirit and essence flourish in harmony.\n\nWhen a person begins to age, it seldom does not first manifest in the ears and eyes.",
      "start_char": 1658,
      "end_char": 2922,
      "start_sentence": 54,
      "end_sentence": 106,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.64728546142578,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真西王母宝神起居经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "毕，又两手据后面，举头向天，左右自摇动项中二十过。 毕，平坐，举两手托天，良久毕。 又摩两掌，以自拭目傍，至两耳，又良久毕，阴咒曰： 前抟后指，天帝上客，左眄右顾，长生大度，仰头喘息，太一相极，却月龙堰，司命同轸，饮食胎元，交关昆仑，回倒双跽，真人同志。 咒毕，辄引炁闭之。 存脐中赤炁大如綖，出脐卧，入鼻中，如此三过，按摩之道都毕。 使人百关通利，长生不病。 紫度炎光内视中方曰：常欲闭目而卧，安身微炁，使如卧状，令并人不觉也。 乃内视远听四方，令我耳目注万里之外，久行之，尔自见万里之外事，精心为之，乃见百万里外事也。 人耳中亦常闻金玉之音，丝竹之声，此妙法也。 四方者，总其言耳，当先起一方，而内法视听，初为之，实无仿髴，久久诚自入妙。 大洞真经高上内章遏邪大咒上法曰：每当经危睑之路，鬼庙之间，意中诸有疑难之处，心将有微忌，勑所经履者，乃当先反舌内向，咽液三过毕，以左手第三指摄两鼻孔下人中之本，鼻中鬲孔之内际也，三十六过，即以手急按，勿举指计数也。 鼻中鬲之际，名曰山源。 山源者，一名鬼井，一名神池，一名邪根，一名魂台也。 摄毕，因叩齿七通毕，又进手心以掩鼻，於是临目，乃微祝曰： 朱鸟陵天，神威内张，山源四填，鬼井逃亡，神池吐炁，邪根伏藏，魂台四明，琼房玲琅，玉真巍峨，坐镇明堂，手晖紫霞，头建晨光，执咏洞经，三十九章，中有辟邪龙虎，截兵斩缸，猛狩奔牛，衔刀吞镶，揭山玃天，神雀毒龙，六领吐火，啖鬼之王，电猪雷父，掣星流横，枭磕骏灼，逆风横行，大禽罗察，皆在我傍，吐火万丈，以除不祥，群精启道，封落山乡，千神百灵，并手叩颡，泽尉捧灯，为我烧香，所在所经，万神奉迎。 毕，又叩齿三通，乃开目，徐去左手也。 手按山源则鬼井闭门，手抟神池则邪根散分，手按魂台则玉真守阙。 於是感激灵根，天兽来卫，千精震伏，莫干我炁，此自然之理，使忽尔而然也。 鼻下山源，是一身痹津，真邪之通府，不真者所以生邪炁，为真者所以遏万邪，在我运摄之耳。 故吉凶兆焉。 明堂中，亦一身之文也，死生之形府，七魄元室，三魂灵宅，存其神可以眇乎内观，废其道所以致乎朽烂。 故由我御，慎顺其卫生，而无悔咎定焉。 右四条，出大洞真经高上首章。 大灵#3真人曰：风病之所生，生於丘坟阴湿，三泉壅滞，是故地官以水炁相激，多作风痹。 风痹之重者举体不援，轻者半身，或失手足也。 若常梦在东北及西北经按故居，或身见灵床处所者，正欲与冢炁相接耳。 墓之东北为征绝命，西北为九厄，此皆冢讼之凶地。 若梦见亡者於其间，益见验也。 若每遇此梦者，卧觉当正向上三啄齿，而祝之曰： 太元上玄，九都紫天，理魂护命，高素真人，我受上法，受教太玄，长生久视，身飞体仙，冢墓永安，鬼讼塞间，魂魄和悦，恶炁不烟，游魅魍魉，敢干我神，北帝折制，收炁入渊，得箓上皇，名书帝前。 如此者再祝，又叩齿三通，则不复梦冢墓及家死鬼也。 此北帝秘咒也，有心好事者，皆可行之。 若经常得恶梦不祥者，皆可按此法，於是鬼炁灭也，邪鬼散形也。 手臂不援者，沈风毒炁在脉中，结附痹骨使之然耳，自宜针灸，针灸则愈。",
      "translated_text": "Then, place both hands behind the back, lift the head toward the heavens, and gently shake the neck left and right twenty times. When finished, sit upright and raise both hands to prop up the sky for a long while. Next, rub the palms together and use them to wipe the sides of the eyes, reaching the ears, and continue for a long while. Then recite the following incantation in secret:\n\n*\"Front clasp, rear point—celestial guest of the Emperor on High.\nLeft glance, right gaze—great measure of long life.\nLifting the head to pant—Taiyi’s utmost extreme.\nCrescent-moon dragon weir—Controller of Life in shared alignment.\nDrinking and eating the primordial embryo—interlocking with Kunlun.\nInverted double kneel—true person of shared aspiration.\"*\n\nAfter reciting, immediately draw in *qi* and hold it. Visualize a red *qi* within the navel, as large as a thread, emerging from the navel and entering the nostrils. Do this three times, and the method of pressing and rubbing is complete. This practice unblocks the hundred joints, ensuring long life without illness.\n\nThe *Purple Capital’s Radiant Light Inner Vision Central Method* states: Always lie down with eyes closed, settling the body with subtle *qi*, appearing as if merely asleep so that others remain unaware. Then, inwardly gaze and listen afar to the four directions, directing one’s ears and eyes to ten thousand *li* beyond. With prolonged practice, you will naturally perceive events ten thousand *li* away. If you focus your spirit, you may even see a hundred thousand *li* beyond. Within the ears, one may constantly hear the sounds of gold and jade, the melodies of silk and bamboo—this is the wondrous method. The \"four directions\" are merely a general term; one should begin with a single direction, applying the inner method of vision and hearing. Initially, there may be no semblance of success, but with time and sincerity, one will naturally enter the marvelous.\n\nThe *Highest Chapters of the Great Cavern Perfection Scripture’s Supreme Inner Method for Suppressing Demons and the Great Incantation* states: Whenever traveling through perilous paths or passing by ghostly shrines, or when the mind harbors doubts and fears, or when slight apprehensions arise regarding the places one traverses, first curl the tongue inward, swallow saliva three times, then use the third finger of the left hand to press the base of the philtrum beneath the nostrils—specifically, the inner edge of the nasal diaphragm—thirty-six times. Press firmly without lifting the finger to count. The edge of the nasal diaphragm is called *Mountain Source*. *Mountain Source* is also named *Ghost Well*, *Spirit Pool*, *Root of Evil*, and *Terrace of the Soul*. After pressing, knock the teeth seven times, then advance the palm to cover the nose. With eyes closed, softly recite:\n\n*\"Vermilion Bird soars above heaven, divine might inwardly expands.\nMountain Source’s four fills—Ghost Well flees in flight.\nSpirit Pool exhales *qi*—Root of Evil hides in submission.\nTerrace of the Soul shines in four directions—Jade Chamber’s chimes resound.\nJade Perfection stands majestic—seated, it guards the Hall of Light.\nHands radiate purple mist—head bears the dawn’s glow.\nGrasping and chanting the Cavern Scripture’s thirty-nine chapters,\nWithin dwell demon-repelling dragons and tigers,\nWeapon-severing, jar-smashing,\nFierce beasts like galloping oxen,\nSword-swallowing, blade-devouring,\nMountain-lifting, heaven-scaling apes,\nDivine birds and poisonous dragons,\nSix leaders spewing fire,\nGhost-devouring kings,\nLightning swine and thunder fathers,\nStar-snatching, meteor-streaming,\nOwls and blazing swift ones,\nMoving crosswind,\nGreat birds and net-spirits—\nAll stand beside me,\nSpitting ten thousand *zhang* of fire to dispel misfortune.\nMultitudes of spirits open the Dao—sealing and casting them into mountain villages.\nA thousand gods and hundred spirits clasp hands and bow their heads.\nMarshals and constables hold lamps to burn incense for me.\nWherever I go, the myriad spirits welcome me.\"*\n\nWhen finished, knock the teeth three more times, then slowly remove the left hand. Pressing *Mountain Source* closes the *Ghost Well*; clasping *Spirit Pool* scatters the *Root of Evil*; pressing the *Terrace of the Soul* stations *Jade Perfection* to guard the gate. Thereupon, the numinous root is stirred, celestial beasts come to protect, and a thousand spirits tremble and submit, none daring to disturb my *qi*. This is the natural principle, causing it to occur in an instant.\n\nThe *Mountain Source* beneath the nose is the stagnant fluid of the entire body, the thoroughfare of true and evil *qi*. For those who are not true, it generates evil *qi*; for those who are true, it suppresses the myriad evils—all depends on my control and regulation. Thus, good and ill omens manifest here. The *Hall of Light* is also the literary hall of the body, the repository of life and death, the original chamber of the seven *po*, and the numinous abode of the three *hun*. Preserving its spirit enables inner vision; neglecting its Dao leads to decay and rot. Therefore, it is for me to govern—carefully follow its principles of life preservation, and there will be no regrets or faults.\n\nThe above four methods are from the *Highest Chapters of the Great Cavern Perfection Scripture*.\n\nThe *Great Numinous Perfected One* states: Wind diseases arise from dampness in burial mounds, graves, and the three springs where *qi* stagnates. Thus, the earthly officials stir water and *qi* to create wind impediments. Severe wind impediments render the entire body immobile; milder cases affect half the body or cause the loss of hands and feet. If one frequently dreams of wandering in the northeast or northwest, passing by former dwellings, or seeing places where spirit beds were laid, it is precisely because one is about to connect with the *qi* of the tomb. The northeast of a grave is *Zheng Jue Ming* (Death by Decree), and the northwest is *Nine Calamities*—both are inauspicious grounds for tomb disputes. If one dreams of the deceased in these places, the omen is even more evident. Upon encountering such dreams, upon waking, face upward and knock the teeth three times, then recite:\n\n*\"Supreme Primordial, Nine Capitals’ Purple Heaven,\nOrdering the soul and protecting life—High and Pure Perfected One.\nI receive the supreme method, taught by the Great Mystery,\nTo attain long life and enduring vision, body soaring as an immortal.\nTombs forever peaceful, ghostly disputes cease,\nSoul and spirit harmonious, evil *qi* dispelled.\nWandering demons and specters dare not disturb my spirit.\nThe Northern Emperor breaks and restrains, drawing *qi* into the abyss.\nAttaining the register of the Supreme Emperor, my name inscribed before the throne.\"*\n\nRecite this twice, then knock the teeth three times, and one will no longer dream of tombs or deceased family ghosts. This is the secret incantation of the Northern Emperor; those with sincere and virtuous intentions may practice it. If one frequently experiences inauspicious dreams, this method may be applied, causing ghostly *qi* to vanish and evil spirits to scatter.\n\nWhen arms and limbs fail to move, it is because deep wind-toxin *qi* lodges in the meridians, binding and adhering to the bones, causing this condition. Acupuncture and moxibustion are appropriate; with treatment, recovery will follow.",
      "overlap_context": "and the roots of the hair will remain firm.\n\nThe above two methods were taught by *An Jiuhua* for application.\n\nWhen sitting or lying down, always direct the nostrils toward one’s *life destiny*; this also applies to eating and drinking. If unable to face one’s *life destiny*, orient toward the northeast or northwest—these are also auspicious, being the *gateways of the soul and spirit of Heaven and Earth*. Additionally, upon rising, often gently shake the body from side to side dozens of times.",
      "start_char": 2922,
      "end_char": 4186,
      "start_sentence": 107,
      "end_sentence": 141,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.38834023475647,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真西王母宝神起居经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "又宜按北帝曲折之祝，若行之百过，疾立消除也。 先以一手徐徐按摩疾处，良久毕，乃卧，目内视，咽液三过，叩齿三通，正心微咒曰： 太上四玄，五华六庭，三魂七魄，天关地精，神府荣卫，天胎上明，四支百神，九节万灵，受箓玉晨，刊书玉城，玉女侍身，玉童护命，永齐二景，飞仙上清，长与日月，年俱受倾，超腾升仙，得整太平，流风结痾，注鬼五龙，魍魉冢气，阴气相迥，陵我四支，干我盛衰，太上天丁，龙虎曜威，斩鬼不祥，风邪即描，考注匿讼，百毒隐非，使我复常，日月同晖，考注见犯，北鬼收摧，如干明上，威章付魁。 《太上铭渟散华经》上按摩法：常以生炁时，咽液二七过毕，按体所痛处，向王祝曰： 左玄右玄，三神合真，左黄右黄，六华相当，风炁恶疾，伏匿四方，玉液流泽，上下宣通，内遣水火，外辟不祥，长生神仙，身常休强。 毕，又咽液二七过。 常如此，则无疾。",
      "translated_text": "Moreover, one should apply the Northern Emperor’s winding incantation; if performed a hundred times, the illness will swiftly dissipate. First, gently massage the afflicted area with one hand for a long while, then lie down. Inwardly visualize, swallow saliva three times, and knock the teeth three times. Compose the mind and softly recite:\n\n*\"Supreme Four Mysteries, Five Flowers and Six Courts,\nThree Hun and Seven Po, Celestial Pass and Earthly Essence,\nDivine Palace and Guarding Spirits, Heavenly Womb and Supreme Clarity,\nFour Limbs and Hundred Spirits, Nine Joints and Myriad Numina,\nReceive the Register of Jade Dawn, inscribe it in the Jade City.\nJade Maidens attend my body, Jade Lads protect my life,\nForever aligned with the Two Radiant Ones, ascending as an Immortal to the Upper Clarity,\nEver in step with the sun and moon, sharing their boundless years,\nTranscending to rise as an Immortal, attaining Great Peace.\nYet pernicious winds congeal into afflictions, demonic *qi* infuses the Five Dragons,\nSpecters and tomb-*qi*, yin-*qi* intertwined,\nAssailing my four limbs, disrupting my flourishing and decline.\nSupreme Heavenly Soldiers, Dragon and Tiger manifest their might,\nSevering inauspicious ghosts, dispersing wind and evil at once.\nExamine and expel hidden grievances, all poisons and concealed wrongs,\nRestore me to normality, that I may shine with the radiance of sun and moon.\nShould any transgression be detected, the Northern Ghosts shall seize and crush it;\nIf they dare offend the luminous above, their punishment shall be recorded by the Chief of Stars.\"*\n\nFrom the *Scripture of the Supreme Inscription of Lingering Flowers on Scattered Petals*, the method of massage prescribes: At the time of *qi*-generation, swallow saliva fourteen times, then press the painful area while facing the ruler and recite:\n\n*\"Left Mystery and Right Mystery, Three Spirits unite in perfection,\nLeft Yellow and Right Yellow, Six Flowers harmonize,\nWind-*qi* and malignant illness, subdued and concealed in the four directions.\nJade fluid flows with grace, circulating above and below,\nInternally dispatching Water and Fire, externally repelling inauspiciousness,\nTo attain long life as a Divine Immortal, with a body ever strong and at ease.\"*\n\nConclude by swallowing saliva fourteen times again. Practicing this regularly will ensure freedom from illness.",
      "overlap_context": " ghosts. This is the secret incantation of the Northern Emperor; those with sincere and virtuous intentions may practice it. If one frequently experiences inauspicious dreams, this method may be applied, causing ghostly *qi* to vanish and evil spirits to scatter.\n\nWhen arms and limbs fail to move, it is because deep wind-toxin *qi* lodges in the meridians, binding and adhering to the bones, causing this condition. Acupuncture and moxibustion are appropriate; with treatment, recovery will follow.",
      "start_char": 4186,
      "end_char": 4550,
      "start_sentence": 142,
      "end_sentence": 148,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.490092515945435,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真西王母宝神起居经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "又当急按所痛处三十一过也。 右一条，十月二十二日沧浪云林宫右英王夫人所出。 《消魔上灵经》曰：若体中不宁，当反舌塞喉，漱津咽液无数，须臾，不宁之病自即除也。 当时亦常觉体中宽软也。 右一条，出消魔上灵叙中。 梦寐不真，魄协邪炁，如校其心，欲伺我神之间伏也。 每遇恶梦，但向北启太上大道君，具言其状，不过四五，则自消绝也。 右青童口诀。 日夜遇恶梦非好，觉当即反枕，更枕而祝曰： 太和玉女，侍真卫魂，六宫金童，来卫生门，化恶反善，上书三元，使我长生，乘景驾云。 毕，咽液九过，叩齿七通而卧。 如此四五，亦自都绝消。",
      "translated_text": "Press the painful area urgently thirty-one times.\n\nThe above method was revealed on the twenty-second day of the tenth month by the Right Radiant Lady Wang of Cloudy Waves and Verdant Grove Palace.\n\nThe *Scripture of the Supreme Numinous Eradication of Demons* states: If the body feels unwell, curl the tongue to block the throat, rinse with saliva, and swallow it without count. After a moment, the discomfort will naturally dissipate. At that time, one will also commonly feel the body relaxed and supple.\n\nThe above method is excerpted from the *Supreme Numinous Eradication of Demons*.\n\nIf dreams are unclear and the *po* soul aligns with malevolent *qi*, it is as though something examines the heart, seeking to ambush the spirit in its moments of vulnerability. Whenever encountering a nightmare, simply face north and invoke the Supreme Lord of the Great Dao, recounting the details. After no more than four or five repetitions, the disturbance will vanish of its own accord.\n\nThe above is a secret oral instruction of the Azure Lad.\n\nWhen encountering ill or inauspicious dreams day or night, upon waking, immediately turn the pillow over and recite while reclining upon it:\n\n*\"Jade Maiden of Supreme Harmony, attend the true and guard the soul,\nSix Palaces’ Golden Lads, come to defend the Gate of Life,\nTransform evil into good, inscribe it above the Three Origins,\nGrant me long life, to ride the radiance and mount the clouds.\"*\n\nConclude by swallowing saliva nine times and clicking the teeth seven times before sleeping. After four or five repetitions, all such disturbances will naturally cease entirely.",
      "overlap_context": "ry, Three Spirits unite in perfection,\nLeft Yellow and Right Yellow, Six Flowers harmonize,\nWind-*qi* and malignant illness, subdued and concealed in the four directions.\nJade fluid flows with grace, circulating above and below,\nInternally dispatching Water and Fire, externally repelling inauspiciousness,\nTo attain long life as a Divine Immortal, with a body ever strong and at ease.\"*\n\nConclude by swallowing saliva fourteen times again. Practicing this regularly will ensure freedom from illness.",
      "start_char": 4550,
      "end_char": 4816,
      "start_sentence": 149,
      "end_sentence": 160,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.393706321716309,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真西王母宝神起居经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "此咒亦反恶梦，而为吉祥也。 右十一月十三日夜右英夫人所出。 夫玄象灵枢，达观所适，冲心秀虚，浪神味标，咀吸太和，体炁萧寥，於是琼振奏响，万籁冥招矣。 夫炁者，神明之器匠，清浊之宗渊，处玄则天清，在人则身存。 夫生无亏盈，盖顺乎摄御之间也。 欲服六炁，常以向晓向寅丑之际，因以天时造始，必以方面此之时也。 太霞剖晖，丹阳诞光，灵景启晨，朱精发明之始也，先存日如鸡子，在泥丸中，毕，乃吐出一炁，存炁为黑色，名之尸炁也。 次吐二炁，存炁为白色，名之为故炁，吐三炁，存炁为苍色，名之为死炁也。 思以其色吐炁良久也，凡出三色，合吐六炁也。 毕，又徐徐纳引，取黄炁四过，存炁从泥丸日中来下，四过毕，辄咽液三过，为之三毕。 乃又存在泥丸中，下从耳中出，当我口前，令去面九寸，临目仿髴如见之。 复乘日纳引，取赤炁七过，七过毕，复咽液三过止。 乃起坐，动摇四支，俯仰屈伸，令关脉调畅，都毕也。 存咽液，皆令青色。 夜亦可存月在泥丸中，如存日法。 如存月，当以月一日夜半，至十五日住。 从十六日至三十日，是月炁衰损，天胎亏缩，不可以夜存月也。 此法至妙，能行之者仙，所以吐纳胎元，漱吸明真。 时呼召五咽，以得自然，魂还绝宅，魄归泥丸，所以长生也。 岂同采幽谷之阴炁，求奔马之灵神，步海以求济，策毛车於火山哉。 可不慎欤，可不慎欤。 右西王母叙诀。 乙丑岁兴宁三年七月四日夜，司命东卿君来降，侍从七人入户。 其〔一〕#4 人执华旛，一名十绝灵幡，一人带环章囊，其三人捧白牙箱，箱中似有书也。 其一人握流金火铃。 侍人并朱衣。",
      "translated_text": "This incantation also reverses inauspicious dreams to auspicious ones.\n\n*Recorded on the night of the thirteenth day of the eleventh month by the Lady of Right Radiance.*\n\nThe numinous pivot of the celestial patterns lies in the clarity of one’s vision; the profound and empty heart, serene and luminous, drifts like mist, savoring the Great Harmony, embodying the qi of the vast and silent. Thereupon, jade chimes resound, and the myriad sounds are summoned in profound stillness.\n\nQi is the craft of spirit and brightness, the wellspring of purity and turbidity. Abiding in the mysterious, it clears the heavens; dwelling in man, it preserves the body. Life knows neither loss nor excess, for it follows the art of nurture and restraint.\n\nTo ingest the Six Qi, one must always begin at dawn, during the hours of *yin* and *chou*, when the celestial timing commences, and the directions align with this moment. As the great rosy clouds part and radiance emerges, when the cinnabar sun rises and the luminous dawn breaks, and the vermilion essence first shines—first visualize the sun as an egg within the *Niwan* Palace. Then exhale one breath, imagining the qi as black, naming it the *Corpse Qi*. Next exhale a second breath, imagining the qi as white, naming it the *Old Qi*. Exhale a third breath, imagining the qi as gray, naming it the *Dead Qi*. Focus on each color while exhaling for a long while. In total, three colors are exhaled, comprising the Six Qi.\n\nAfterward, slowly draw in and guide the qi, inhaling the yellow qi four times. Visualize the qi descending from the sun within the *Niwan* Palace. After four inhalations, swallow saliva three times, completing three full cycles. Then visualize the qi within the *Niwan* Palace descending from the ears and appearing before the mouth, nine inches from the face, so that it seems almost visible to the eyes. Again, riding the sun, draw in and guide the red qi seven times. After seven inhalations, swallow saliva three times to conclude. Then rise and move the four limbs, bending and stretching to harmonize the joints and meridians, completing the practice. When visualizing and swallowing saliva, always imagine it as green.\n\nAt night, one may also visualize the moon within the *Niwan* Palace, following the same method as for the sun. For moon visualization, begin at midnight on the first day of the lunar month and continue until the fifteenth. From the sixteenth to the thirtieth, the moon’s qi wanes and diminishes, and the celestial embryo contracts—do not visualize the moon at night during this period.\n\nThis method is most wondrous; those who practice it attain immortality. It is the art of exhaling and inhaling the primordial embryo, rinsing and absorbing the luminous truth. By timely invocation and fivefold swallowing, one attains the natural state, the hun-soul returns to its abode, and the po-soul rests in the *Niwan* Palace—thus is long life achieved. How can it compare to gathering the yin qi of secluded valleys, seeking the swift spirits of galloping horses, treading the sea in search of passage, or driving feathered chariots upon fiery mountains? Be cautious, be most cautious.\n\n*Secret Instructions of the Queen Mother of the West.*\n\nOn the night of the fourth day of the seventh month in the third year of *Xingning* of the *Yichou* era, the Lord of Life, Eastern Minister, descended with seven attendants entering the chamber. One held a flowered banner, also called the *Tenfold Numinous Pennant*; another bore a ring and a satchel of seals; three carried white ivory boxes, within which appeared to be books. Another grasped a flowing-gold fire-bell. The attendants were all clad in vermilion.",
      "overlap_context": "iately turn the pillow over and recite while reclining upon it:\n\n*\"Jade Maiden of Supreme Harmony, attend the true and guard the soul,\nSix Palaces’ Golden Lads, come to defend the Gate of Life,\nTransform evil into good, inscribe it above the Three Origins,\nGrant me long life, to ride the radiance and mount the clouds.\"*\n\nConclude by swallowing saliva nine times and clicking the teeth seven times before sleeping. After four or five repetitions, all such disturbances will naturally cease entirely.",
      "start_char": 4816,
      "end_char": 5454,
      "start_sentence": 161,
      "end_sentence": 186,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.68764066696167,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真西王母宝神起居经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "司命君形甚少於二弟，着青锦绣裙，紫毛帔，中芙蓉冠，二弟并同来侍立，命座乃坐耳。 言语良久。 七月六日夜，司命君又降喻书曰：若必范玄秉象，清靖罕时，遂拔群幽藻，戢翼高栖，感味上契，渊渟岳峙，萧寥玉篇，玩宝神生，遗放俗恋，调弹清灵，澄景虚中，五道发明，色绝化浪，欲与淡并，空同冥衢，无视无听，尔乃远齐妙真，重起玄觉，明德内圆，灵摽外定矣。 终能策云軿以赴霄，书司命之丹箓耳。 若情散万念，为生不固，炁随尘波，心不真舍，适足劳身神於林岫，实有误於来学也。 其道微而易寻，其道艰而难得乎。 月五日夜半，存日象在心中，日从口入也。 使照一心之内，与日共光，相合会毕，当觉心暖，霞晖映验，良久，乃祝曰：太明育精，内炼丹心，光晖合映，神真来身。 毕，咽液九过。 到十五日、二十五日、二十九日，复作如上。 使人开明听察，百关解彻，面生玉光，体有金液。 行之五年，太一遣保车来迎，上登太霄。 行之惟欲数，不必此数日作也。 右一条，出《消魔经》中，南岳赤君内法。 又曰：临食上，勿道死事，勿露食物，来众邪炁。 又曰：数澡浴，要至甲子当沐，不尔当以几月日旦，使人通灵。 浴不患数，患人不能耳。 荡炼尸臭，而真炁来入。 右玄师魏夫人所勑使施用。 《太上九变十化易新经》曰：若履殗秽，及诸不盛处，当先澡浴，与解形以除之。 其法用竹叶十两，桃皮削取白四两，以清水一斛二斗，於釜中煮之，未及沸出，适寒温，以浴形，即万殗除也。 既以除殗，又辟湿痹疮痒之疾。 且竹虚素而内白，桃即却邪而折秽，故用此二物，以消形中之滓浊也。 天人下游既反，未尝不用此水以荡也。 至於世间符水祝漱外舍之近术，皆莫比於此方也。 若浴者益佳，但不用此水以沐耳。 炼尸之素浆，正宜以浴耳，真奇秘也。 右玄垄羽宫紫微王夫人勑令用之。 开日旦，向王，朱书，再拜服之。",
      "translated_text": "The Lord of Life appeared far younger than his two younger brothers, clad in a green brocade skirt, a purple fur cape, and a lotus crown at its center. His two brothers had likewise come to stand in attendance, and only after being bidden to sit did they take their seats. They spoke at length.\n\nOn the night of the sixth day of the seventh month, the Lord of Life descended once more to deliver a written admonition, saying: Should one truly model oneself upon the profound and embrace the symbolic, maintaining purity and tranquility in rare moments, then one may pluck the hidden blossoms from the thronging shadows, fold one’s wings and nest in lofty seclusion, savor the resonance of higher accord, abide in the stillness of deep pools and the steadfastness of mountains, wander through jade-like scriptures in serene solitude, and nurture the divine within by treasuring the sacred. Casting aside worldly attachments, one harmonizes and plays the pure numen, clarifying the inner vision within emptiness. The Five Ways become luminous, form transcends the waves of transformation, desire merges with stillness, and emptiness unites with the obscure thoroughfare. With neither sight nor hearing, one thus aligns with the subtlest truth, reawakens profound awareness, perfects virtue within, and stabilizes the spirit without. In the end, one may ride cloud chariots to ascend the heavens and inscribe the Lord of Life’s cinnabar register.\n\nYet if the mind scatters into ten thousand thoughts and life is not firmly rooted, if qi follows the dust and waves while the heart does not truly dwell in its abode, then one merely wearies body and spirit among the mountains and valleys, truly misleading those who come to learn. The Way is subtle yet easy to seek; the Way is arduous yet difficult to attain.\n\nOn the night of the fifth day of the month at midnight, visualize the solar image within the heart, allowing the sun to enter through the mouth. Let it illuminate the heart’s interior, merging its light with the sun’s radiance. When the union is complete, one should feel warmth in the heart, suffused with rosy glow as verification. After a long while, recite the incantation: *\"Great brightness nurtures essence, refining the cinnabar heart within. Light and radiance merge, and the divine and true come to the body.\"* Upon completion, swallow saliva nine times.\n\nRepeat this practice on the fifteenth, twenty-fifth, and twenty-ninth days of the month. Through this, one’s perception becomes keen and clear, the hundred passages unobstructed, the face radiant with jade-like light, and the body suffused with golden liquid. After five years of practice, the Great One will dispatch a protective chariot to welcome you, ascending to the Supreme Empyrean. The practice need not be confined to these specific days but should be frequent.\n\nThis passage is excerpted from the *Scripture on Dispelling Demons*, an inner method of the Red Lord of Southern Marchmount.\n\nIt further states: When partaking of meals, do not speak of matters of death, nor expose food, lest it attract the qi of manifold malevolent spirits.\n\nIt also advises: Bathe frequently, and on the day of *jiazi*, one must wash one’s hair. If not, then at dawn on the first day of the month, one should bathe to facilitate communion with the numinous. The concern is not with the frequency of bathing but with the practitioner’s inability to do so. By scouring and refining the stench of the corpse, the true qi enters.\n\nThese are the instructions of the Mystic Master, Lady Wei, to be implemented as directed.\n\nThe *Scripture of the Supreme Nine Transformations and Ten Transmutations for Renewal* states: When treading upon filth or any unclean place, one should first bathe to dissolve and dispel it. The method employs ten ounces of bamboo leaves and four ounces of peeled white peach bark, boiled in one *hu* and two *dou* of clear water in a cauldron. Before boiling, remove the liquid, adjust to a suitable temperature, and bathe the body, thereby eliminating all filth. This not only dispels impurities but also prevents damp impediment, sores, and itching.\n\nMoreover, bamboo is hollow, plain, and inwardly white, while peach repels evil and breaks filth. Thus, these two substances are used to purge the turbidity within the body. When celestial beings descend to the mortal realm and return, they invariably use this water for cleansing. Compared to the common techniques of talismanic water, incantations, and external rinsing, none match this method. While bathing with this water is even more beneficial, it should not be used for washing the hair. The pure essence for refining the corpse is precisely suited for bathing—truly wondrous and secret.\n\nThese are the directives of the Lady of the Purple Tenuity of the Mystic Mound Feather Palace, to be employed as commanded.\n\nAt dawn on an auspicious day, face the *wang* direction, write in vermilion, bow twice, and ingest.",
      "overlap_context": "s of the Queen Mother of the West.*\n\nOn the night of the fourth day of the seventh month in the third year of *Xingning* of the *Yichou* era, the Lord of Life, Eastern Minister, descended with seven attendants entering the chamber. One held a flowered banner, also called the *Tenfold Numinous Pennant*; another bore a ring and a satchel of seals; three carried white ivory boxes, within which appeared to be books. Another grasped a flowing-gold fire-bell. The attendants were all clad in vermilion.",
      "start_char": 5454,
      "end_char": 6201,
      "start_sentence": 187,
      "end_sentence": 215,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.33091688156128,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真西王母宝神起居经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "祝曰： 五神开心，彻听绝音，三魂摄精，尽守丹心，使我勿忘，五藏远寻。 先拜，拜毕祝，祝毕乃服符，服毕咽液五过，叩齿五通，勿令人见。 若不用开日，以月旦、月十五日、二十七日，一月三服，一年使验至，秘符也。 太虚真人口诀：以春乙卯日、夏丙午日、秋庚申日、冬壬子日，冥卧时，先捣朱砂、雄黄，雌黄三分物，细捣之，以绵裹之，使如枣大。 临卧时，以塞两耳中。 此销三尸炼七魄之妙道秘法也。 勿令人知者。 明日，日中时，以东流水沐浴，沐浴毕，更整饰床席，易着衣服，洗故者，更弊履，澡洗之。 都毕，又扫洒於寝床下，通令所住一室净洁，更安枕卧，向上闭炁，握固良久，而微祝曰： 天道有常，改易故新，上帝吉日，沐浴为真，三炁消尸，朱黄安魂，宝炼七魄，与我相亲。 祝毕。 此道是消炼尸秽之上法，改易新形之要诀也。 四时唯各取一日为之。 太虚真人曰：先师见教，以五达之日，日出三四丈许，正立向日，存三魂神正与日光俱入心，平正内彻中良久，闭炁三息，咽液三过，微祝曰： 太阳散晖，垂光紫青，来入我身，照我五形，所却鬼试，心使平正，内彻九炁，外通胎命，飞仙上清，玉箓已定。 咒毕，以手拭目二七，叩齿二七。 都毕。 此法使人三魂凝明，丹心方正，万邪藏伏，心试不行，真要道也。 子常行之，诸以五达日，向日趣令嚏也，若不得嚏者，以软物向日引导鼻中，亦即嚏也。 嚏即咒曰： 天光来进，六胎上通，三魂守神，七魄不亡，承日鸣嚏，与日同形，飞仙玉清，位为真公。 祝毕，拭目二七。 是内精上交日光，三魂发明於内，使人心开神解，百精流传於内府也。 若非五达日者，可不须尔也。 以五达之日，北向五再拜，正心呼上真皇君、皇君夫人名字，三过毕，叩齿五通毕，解巾长跪，谨启五星日月上皇高真道君、三十二天帝、玉清太上上清上皇上帝大道圣君几前，因自陈七祖父母以下，及一身千罪万过，上世以来，乞得解脱，三官告下天帝，使罪名离释，消除黑简，乞赐得五星之真，俱奔华晨，上登上清，交行玉门。 正月六日中时，二月一日晡时，三月七日夜半，四月九日食时，五月十五夜半，六月三日中时，七月七日夜半，八月四日中时，九月二日平旦，十月一日平旦，十一月六日夜半，十二月二日夜半。 右记五达吉日也。 服日月精法： 月朔旦，日出高二丈许，遥望见日，便握固，禹步东向三步，以口逆到取日精二七合，食咽十四日，可将二人入温病家，他病终不能着，所将从人轻，常卧之，令老寿。 月生三日，月出於庚上，两手握固，西南行，向月禹步三步，以口遥饮月精二七，十四咽之，终年无疾病，亦可入死家。 日月照瑕秽。 此二条，食日饮月精，皆消除万疾。 洞真西王母宝神起居经竟 #1『无』字据上下文义补。 #2『湿』字原本误作『泾』。 #3『大灵』当作『太虚』。 #4『一』字据前后文补。",
      "translated_text": "The incantation reads:\n\"Five spirits open the heart, penetrating hearing and absolute sound;\nThree souls gather essence, steadfastly guarding the cinnabar heart.\nLet me not forget, as the five viscera seek afar.\"\n\nFirst bow, then recite the incantation upon completion of the bow. After reciting, ingest the talisman, then swallow saliva five times and click the teeth five times. Do not let others witness this.\n\nIf an *opening day* is not used, employ the first day of the month, the fifteenth day, and the twenty-seventh day—three ingestions per month. Within a year, efficacy will manifest. This is a secret talisman.\n\nOral instructions of the Perfected One of Great Emptiness:\nOn a *yi-mao* day in spring, *bing-wu* day in summer, *geng-shen* day in autumn, or *ren-zi* day in winter, at the hour of dark repose, first grind cinnabar, realgar, and orpiment—each in equal thirds—finely, then wrap them in silk to form a ball the size of a jujube. At bedtime, insert these into both ears. This is the wondrous and secret method for dissolving the Three Corpses and refining the Seven Po. Let no one know of this.\n\nThe next day at noon, bathe in east-flowing water. After bathing, rearrange the bedding and mat, change into fresh clothing, wash the old garments, replace worn shoes, and cleanse them thoroughly. Once all is done, sweep and sprinkle water beneath the sleeping couch, ensuring the entire chamber is pure and clean. Then, recline upon the pillow, face upward, close the *qi*, clench the fists firmly for a long while, and softly recite:\n\"The Dao of Heaven is constant, renewing the old and making it new.\nOn this auspicious day of the Supreme Thearch, bathing refines the true.\nThe Three *Qi* dissolve the corpse, cinnabar and yellow settle the soul.\nPrecious refinement of the Seven Po, may they draw near to me.\"\n\nUpon completion of the recitation, this method is the supreme technique for dissolving and refining corpse impurities, the essential secret for transforming and renewing the form. Perform this once in each of the four seasons.\n\nThe Perfected One of Great Emptiness said:\n\"As my former master taught, on the *Five Pervading Days*, when the sun has risen three or four *zhang*, stand upright facing the sun. Visualize the Three Soul spirits entering the heart together with the sunlight, perfectly aligned and inwardly penetrating for a long while. Close the *qi* for three breaths, swallow saliva three times, and softly recite:\n'The radiance of the Great Yang scatters its brilliance, casting purple and azure light.\nEnter my body, illuminate my five forms.\nRepel demonic trials, steady and align my heart.\nInwardly penetrate the Nine *Qi*, outwardly connect with the embryo’s destiny.\nAscend as a flying immortal to the Jade Purity, my name inscribed in the Jade Register.'\n\nAfter the incantation, wipe the eyes fourteen times and click the teeth fourteen times. Once all is done, this method causes the Three Souls to congeal in clarity, the cinnabar heart to become upright, all myriad evils to hide and submit, and demonic trials to cease. Truly, this is an essential Dao. You should practice this regularly on the *Five Pervading Days*, facing the sun to induce sneezing. If sneezing does not occur, use a soft object to gently stimulate the nose while facing the sun, and sneezing will follow. Upon sneezing, recite:\n'Heavenly light advances, the Six Embryos ascend and connect.\nThree Souls guard the spirit, Seven Po do not perish.\nReceiving the sun’s sneeze, I share its form.\nFly as an immortal to the Jade Purity, attaining the rank of Perfected Lord.'\n\nAfter reciting, wipe the eyes fourteen times. This causes the inner essence to ascend and merge with the sunlight, the Three Souls to radiate brilliance within, opening the heart and enlightening the spirit, while the hundred essences flow and circulate within the inner palace. If it is not one of the *Five Pervading Days*, this need not be done.\n\nOn the *Five Pervading Days*, face north and bow five times. With a sincere heart, invoke the names of the Supreme Perfected Sovereign and the Sovereign’s Lady three times. After completing this, click the teeth five times, remove your headscarf, and kneel lengthwise. Reverently address the August Perfected of the Five Stars, the Sun, the Moon, the Highest Perfected of the Dao, the Thirty-Two Heavenly Thearchs, the Jade Purity, the Supreme Purity, the August Thearch of the Highest Purity, and the Sagely Lord of the Great Dao before the few, stating:\n'From my seven generations of ancestors and parents down to myself, for the thousand transgressions and myriad faults committed since past lives, I beseech deliverance. May the Three Offices report to the Heavenly Thearch, causing my sins to be absolved, my name stricken from the black tally. I pray to receive the true essence of the Five Stars, hastening together to the Flowery Dawn, ascending to the Supreme Purity, and traversing the Jade Gate.'\n\nThe *Five Pervading Auspicious Days* are:\n- First month: sixth day at noon\n- Second month: first day at dusk\n- Third month: seventh day at midnight\n- Fourth month: ninth day at breakfast\n- Fifth month: fifteenth day at midnight\n- Sixth month: third day at noon\n- Seventh month: seventh day at midnight\n- Eighth month: fourth day at noon\n- Ninth month: second day at dawn\n- Tenth month: first day at dawn\n- Eleventh month: sixth day at midnight\n- Twelfth month: second day at midnight\n\nMethod for Ingesting the Essence of the Sun and Moon:\nOn the first day of the lunar month, when the sun has risen two *zhang* high, gaze toward it from afar, clench the fists, take three *Yu* steps facing east, and draw in the sun’s essence fourteen times with the mouth, swallowing it. After fourteen days, you may enter a household afflicted with warm disease, and no other illness will touch you. Those who accompany you will feel light, and if you sleep thus, you will attain longevity.\n\nOn the third day of the lunar month, when the moon rises in the *geng* position, clench both fists, walk southwest, face the moon, take three *Yu* steps, and draw in the moon’s essence fourteen times with the mouth, swallowing it. For the entire year, you will be free from illness and may also enter households of the deceased.\n\nThe sun and moon illuminate impurities and filth. These two methods—ingesting the sun’s essence and drinking the moon’s essence—dissolve and eliminate the myriad illnesses.\n\n*Scripture of the Western Queen Mother on the Precious Spirit’s Daily Practices from the Cavernous Perfection* concludes.",
      "overlap_context": "lismanic water, incantations, and external rinsing, none match this method. While bathing with this water is even more beneficial, it should not be used for washing the hair. The pure essence for refining the corpse is precisely suited for bathing—truly wondrous and secret.\n\nThese are the directives of the Lady of the Purple Tenuity of the Mystic Mound Feather Palace, to be employed as commanded.\n\nAt dawn on an auspicious day, face the *wang* direction, write in vermilion, bow twice, and ingest.",
      "start_char": 6201,
      "end_char": 7349,
      "start_sentence": 216,
      "end_sentence": 253,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.3871636390686,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真西王母宝神起居经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}