{
  "source_id": "洞玄灵宝玄一真人说生死轮转因缘经",
  "source_file": "chunked_daozang\\洞玄灵宝玄一真人说生死轮转因缘经.json",
  "total_chunks": 3,
  "total_original_chars": 3251,
  "total_translated_chars": 19741,
  "total_translation_time": 91.61016178131104,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太平部\\洞玄灵宝玄一真人说生死轮转因缘经.txt",
    "category": "正统道藏太平部"
  },
  "full_translation": "**The Scripture of the Wheel of Life and Death’s Causes and Conditions as Spoken by the Perfected One of Mysterious Unity of the Cavernous Mystery and Numinous Treasure**\n\n**Scripture Title:** *The Scripture of the Wheel of Life and Death’s Causes and Conditions as Spoken by the Perfected One of Mysterious Unity of the Cavernous Mystery and Numinous Treasure*. Author unknown, likely composed during the Tang dynasty. One scroll.\n\n**Source Text:** *Zhengtong Daoist Canon*, Peace Section.\n\n---\n\nAt that time, on the twentieth day of the first month of the first year of Jingyuan, the immortal Yun Du ascended the Jade Chamber of the Golden Terrace of Kunlun to inquire of the Three Heavens’ Dharma Master, the Perfected One of Mysterious Unity, saying:\n\n\"Though I, in my lowly station, have undeservedly received the imperial grace and accumulated study for over two thousand eight hundred years—able to ride clouds and mount dragons in carefree roaming through the great void—I have yet to attain the office of ascending heaven. The affairs of yin and yang, the causes of coming and going, lie beyond my concern, and their principles remain unknown to me.\n\nRecently, I have been unable to discern the causes and conditions of human life and death: whether as father, mother, elder brother, or younger brother; as sisters or household members—do they meet again in every generation, or are there distinctions? Do they each follow their virtue and power, so that those of former lives are reborn in later ones, or not? How great or small are their transgressions and blessings? Are they light or heavy? What forms do they fully receive? How do their paths differ? By what causes do masters and friends meet?\n\nI wish for you to distinguish these matters and expound what I have not yet heard.\"\n\nThe Perfected One replied: \"Your questions are subtle and profound. The matters of coming and going are such that even you have not yet heard of them. The turning of the kalpa is complete, and these affairs cannot remain hidden. Now I shall speak of them to you—guard them as secrets and uphold them.\n\nThe Dao is eternally One, without limit or end. It was revered by the ancient heavens and is honored by the heavens today. It is One without duality, yet the various heavens and humans speak in different tongues and name it differently. Its great return is to the One. The master, too, is One, but with the changes of the world, they emerge to transform it, shaping the myriad things.\n\nThose of former lives revolve within the Great Yin, and later, each is reborn according to their merit—these are the people of the present world. When heaven and earth close, humans perish with the turning of the kalpa; when heaven and earth open, humans are born with its turning. The sun, moon, and stars likewise revolve with the kalpa. Thus, the causes and conditions are unbroken. Heaven and earth, humans, the sun, moon, and stars do not repeat themselves but instead give rise to one another in endless succession.\n\nFathers, mothers, wives, children, brothers, and sisters are not constant gatherings. Each follows their fortune and virtue, temporarily lodging in the wombs of their parents. Later, they again disperse and part according to their merit, their revolutions without constancy. One who was a father in a former life may be reborn as a descendant; one who was a brother may become a father in a later life. They revolve in coming and going, dying and being reborn again.\n\nThe master, however, transmits the generations without end and is eternally the master. Thus, the master is my father and mother, the eternal artisan of life. Fathers, mothers, and brothers are not inherently kin; they merely follow their fortune and virtue to lodge and be born, with parents raising them to maturity. Therefore, the sages established the law of filial piety to repay the grace of nurturing and to cultivate a heart of devotion. Those who are unfilial and disobedient are punished by the king’s law, and heaven also strikes them down.\n\nBrothers, temporarily born together of the same parents, should cherish one another and together cultivate a heart of devotion. When parents pass away and the rites of burial are completed, this repays the grace of their nurturing. The sacrifices of the four seasons serve as the law of compassion and devotion, passed down to later generations so they may know the grace of filial nurturing.\n\nHusbands and wives rarely serve one another for long; their bonds of love are easily broken. A wife abandons her parents’ surname to take her husband’s. Before marriage, her fate is tied to her parents; after marriage, it is bound to her husband. If her husband dies, her fate is tied to her son. If the wife dies and the husband lives, the household remains intact. If the husband dies and the wife remarries, the bloodline is severed. Thus, sons belong to their father’s surname, while daughters belong to their mother’s birth—nameless and without surname.\n\nHuman life in the world is like the blossoms of spring grass: birth has no fixed day, but death has its destined portion. While alive, they temporarily share a household; in death, each follows their causes and conditions to return to their destined realm, never to meet again. Those with fortune are reborn in heaven or in the gates of noble families and kings. Those with transgressions are bound to the long night, their paths like endless exile and punishment.\n\nOnly during the four seasons and the five *la* festivals may they gather and meet again, rejoicing and recalling the love of their time alive. Yet after parting, each returns to their own realm, forever separated, never to remember one another again. When their ghostly merit is exhausted, they follow the weight of their exile, each according to their causes and conditions—some reborn as humans, others falling into the five paths or the six kinds of livestock, or among the border barbarians. The bonds of former days vanish into darkness, and kinship is no more.\n\nWhen humans have descendants, the rites of yin and yang gather joy between heaven and earth. In death, their essence and spirit remain in heaven, but if they face exile and punishment, the principle of yin and yang’s mutual generation no longer applies. Thus, in life, one is human; in death, one is a ghost. Between life and death, only the name changes.\n\nLife is joy; death is suffering. Therefore, the living cannot know the affairs of the ghosts below, while the dead, as ghosts, know the affairs of those above. All ghosts delight in life, yet they cannot act on their own. When their transgressions are exhausted, the lighter ones may return to be reborn among humans, again lodging in the womb according to the measure of their merit.\n\nThose who do evil in life die as ghosts, forever unable to seek rebirth. Instead, they fill the ranks of the long-bound, suffering cold and misery without end. When their transgressions are exhausted, they take the forms of the six kinds of livestock, or the tribes of the border barbarians, or are born with the six afflictions—blindness, deafness, madness, or idiocy—becoming foul and repulsive men and women, utterly despised. They endure hunger and cold, freezing and starving to death. After their suffering, they are reborn among the six kinds of livestock, with no hope of escape. Some are born as slaves or lowly people, driven and feared by others, constantly suffering hunger and cold, their bodies bearing the lash. They watch others rise and bow, their lives and deaths at the mercy of others.\"\n\nAt that time, the soul no longer knows from whence it came to be reborn—only the spirits of the dead may discern it. If one’s life held good deeds, in death one becomes a lord of ghosts, dwelling in halls of joy, where heaven provides food from its kitchens. Free and at ease, one awaits the end of one’s merits, then enters the gates of heavenly kings or is born into a family of wealth and nobility. Wealth and emolument arise naturally, desires are fulfilled, and one meets with the good. Ever abiding in a sagely age, one forms bonds with the worthy, and the path of fortune grows day by day. When the body’s life ends, one ascends directly to the heavens.\n\nIf one has made offerings to the Three Treasures and yearns in heart for immortality, immortals will surely descend to teach the Way of ascending to heaven in broad daylight. If one merely cultivates ordinary good deeds without passing through the Earth Bureau of Mount Tai, seven generations of ancestors will rejoice together. The matters of life and death are as clear as the sun and moon, yet only the wise perceive them while the foolish remain blind. Examine closely and ponder deeply, and understanding will naturally dawn.\n\nAbandon evil thoughts and take goodness as your calling. In the hidden depths of heaven and earth, deeds and transgressions escape not the slightest reckoning—every hair is recorded, nothing is lost or overlooked.\n\nThe Perfected One said: In the life and death of all people, as in the earliest ages, all depends upon the heart. At the gates of the Heavenly Emperor, names are reviewed and decrees issued: those fated to die have their living names erased and replaced with ghostly ones; those fated to be reborn in the world have their ghostly names erased and living ones restored. Then, according to the weight of their merit and virtue, the light are born into poor and lowly families, entering a world of suffering, enduring all six extremes until death. Cold and misery drag them on, selling themselves to feed their mouths, never full, their clothing never covering their bodies. They bear the form of humans but lack human blessings and rewards. The heavy in merit are born into noble and prosperous families, or into wealth and emolument that come unbidden, aligning with all that is good. Clothing and food arise naturally, without toil, and they constantly meet with the good and worthy, forming bonds with sages.\n\nIn this later age, the transmission has waned, and the qi of destiny nears its end. Human life holds no fixed span; heaven selects the body, and each person has a spirit that governs life and another that governs death dwelling within. Those who cherish life are protected by the life spirit; those who court death are assailed by the death spirit. Those who cherish life are inscribed in the register of life; those who court death are inscribed in the register of death. All is bound by clear covenants, yet people remain unaware.\n\nThose who accumulate goodness in life meet with sages and have their names entered in the left contract. In life, they become rulers of men; in death, guests of the heavenly halls. Seven generations of ancestors rejoice together, and later births may be as sons of kings and lords, or they may be born wise and sagely, becoming teachers of gods and men, revered by all within the four seas. When their merit is complete, they ascend to immortality in broad daylight. Thus, if merit and virtue are never severed, one generation after generation forms bonds with the worthy and sagely. Such towering merit has no equal.\n\nThose who do evil in life align with the wicked, their names entered in the right contract of the register of death. In life, they remain distant from the good, their gatherings unstable, and they never receive the blessings of fortune. In death, they enter the hells and the realm of hungry ghosts, their seven generations of ancestors drawn along with them into the endless dark night, with no hope of escape. Such is the difference between good and evil—how vast it is!\n\nThose who do good in life are chosen by heaven to have good people born as their descendants, so that parents receive their grace and fortune, all as recompense for good deeds. Those who do evil in life are chosen by heaven to have wicked and rebellious descendants born into their families, doomed from birth, growing to become disobedient and unfilial. Some engage in licentiousness, theft, banditry, or murder, constantly bringing their parents great sorrow. For lighter offenses, they are enslaved; for heavier ones, their lives are forfeit. Or they may live in poverty and cold, with no security from morning to night, serving others, constantly suffering hunger and cold, their clothing never covering their bodies, the lash never leaving their flesh. They know not the causes of their past, or they may be born deaf, mute, blind, or crippled, dying in infancy or at three or ten years old, or just as they near adulthood. Some are killed by people or poisonous beasts, or are endlessly imprisoned, causing their parents to grieve and sigh as they go about their days. Or they may bear many daughters and no sons, living to old age in loneliness and hardship. All this is the recompense for past evil deeds, as parents and children are bound together in mutual retribution. The principle is clear and cannot be violated; those who violate it find no pardon.\n\nThe Perfected One having expounded the causes and conditions of life, death, and rebirth, now chants the verses on the good karma of future lives:\n\nThe Great Dao’s essence is originally none,\nThe two qi deep and obscure.\nYin and yang harmonize the three powers,\nHeaven and earth set their mechanisms in motion.\nLife and death follow the turning of destiny,\nSin and fortune cling to none unfairly.\nAccumulate fortune and plant good deeds,\nAnd good people will come to be born.\nFortunate bonds and goodness converge,\nIn coming and going, the body receives glory.\nBorn to be a lord of the age,\nOr a master of gods and men.\nWhen life ends, a guest of the heavenly halls,\nFortune and emolument ever follow.\nRiding dragons and reining red phoenixes,\nWandering carefree in the Upper Clarity.\nOr becoming a sage-king,\nEnfeoffed and ruling the ten heavens.\nSeven generations rejoice together,\nIn the Southern Palace, reborn anew.\nForever severed from evil bonds,\nGeneration after generation, ever radiant.\n\nThe Perfected One further chants the verses on the evil karma of future lives:\n\nThough heaven and earth are not none,\nThey may be expected to give birth in turn.\nLiving in the world without thought of goodness,\nOne’s sins heavily accumulate.\nIn death, suffering in the mire and ashes,\nWind and fire never leave the form.\nWhen the sins are exhausted, one is reborn as a human,\nEver dwelling in cold and lowly gates.\nGripped by illness and heavy afflictions,\nDeaf, blind, mad, and deranged.\nSin and rebellion naturally converge,\nAll evils never leave the body.\nBound in form by whips and cudgels,\nGhostly sicknesses never cease for a year.\nParents sigh endlessly,\nBorn and dying in the hells.\nSinking into the dark evil paths,\nHoping for goodness, forever without cause.\n\nThe Perfected One said: The Dao returns to goodness as water flows to the abyss. The difficulty of transforming the wicked is like the treetop of a tall tree, lacking the source of good earth. Though they hear the good Dao and know it in the moment, they turn away and forget, like rain falling on a high forest—though momentarily moistened, it dries at once.\n\nThe good person who hears the Dao is like the abyss of a great river or the source of the vast sea—only receiving, never rejecting. The teachings of the Dao are rarely heard, sages are seldom encountered, and the worthy are difficult to meet. Unless the cycles of heaven and earth align and their movements converge, the scriptures of the Dao will not emerge, and sages will not appear. When the emperor rules with the Dao, sages are born in the land; when the great cycle converges, the appointed time draws near.\n\nAs the celestial movement hastens toward the final age, at the winter solstice of the new moon, in the era of the House of Jin, the scriptures of the Dao will at last become clear. For a brief time, there shall be great peace, and for several decades, one in five among the people will understand the Dao. When the age of the Golden Horse draws to its end and the celestial cycle shifts to the Zhou, in the year of the Water Dragon, Lord Li shall arise to govern. In that sagely era, the distinctions between good and evil in life and death will become clear. The virtuous among men and women shall turn to perform good deeds.\n\nAt that time, a sage shall appear in the world to deliver sentient beings. Those who encounter him shall receive the karmic retribution of past deeds—some shall attain liberation in this very life, while others shall rejoice as entire households enter into blessedness. But the wicked, ever at odds with goodness, upon hearing the sage’s teachings, shall dismiss them as nothing. These are not the roots of good people; heaven seals their hearts, preventing them from harmonizing with the sage. Thus, the streams of good and evil diverge, forever separated by heaven and earth.\n\nWhen the cycles converge and the Dao and virtue flourish, fools shall be many, while those who understand the Dao shall be few—one in ten thousand, and even that is considered abundant. Each shall teach and transform, yet none shall seek the original source. At that time, there shall be cunning and deceitful individuals, wavering in doubt, disbelieving the great Dharma, unable to distinguish truth from falsehood. As the appointed time nears its convergence, heaven ordains it to be so.\n\nMen and women of sincere heart, if you are good, do not retreat, for retreat means loss. Once the merit of former deeds is lost, a worthy one shall not appear again for ten thousand kalpas. When a worthy one appears in the world, it is difficult to serve them properly. Some may feign foolishness or deafness, some may be pure or turbid, some upright or chaste, some hidden or revealed, some right or wrong, some may spurn the shallow among gods and humans, while others may favor one thing over another. At the outset of their arrival, evil shall manifest in strange ways. But if it is a true sage, their conduct shall remain unshaken. Though they undergo myriad transformations, their essence shall remain eternally pure, distinct from the ordinary, untainted by common customs.\n\nOnce you have encountered them, fear that you may not have the chance to serve them again. They may withdraw in concealment, depart from the land, or leave no trace behind. If you oppose them, you shall be forever separated for ten thousand kalpas. But if you form a karmic bond with the worthy one, you shall sit and enjoy blessings, your seven ancestors shall ascend to heaven, and after death, you shall rise to the celestial halls, where clothing and sustenance come naturally. All this arises from karmic connections in past lives, ordained by the Dao.\n\nThose without such connections, though they dwell beneath the eaves of the worthy one or sit beside them, shall never form a bond, for it cannot be forced. The distinctions between sin and fortune are precise, not a hair’s breadth in error. Even if they chance to meet, they may suffer manifold calamities, preventing the convergence of good fortune. This is all due to the lack of karmic affinity in past lives; heaven confounds their minds, ghosts seal their intentions, preventing them from joining with goodness. Thus, they remain forever apart, drifting ever farther from virtue.\n\nIf one desires goodness and, upon encountering harm, does not retreat in heart, fortune shall surely come. Having spoken thus, the teachings are now transmitted to the worthy. Let them not be leaked, for they accord with the scriptural methods. Only after the oath is sworn shall they be passed on.\n\nHere ends *The Scripture of the Wheel of Life and Death: Causes and Conditions*, as Spoken by the Perfected One of Cavernous Mystery and Numinous Treasure, the True One of the Primordial Unity.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞玄灵宝玄一真人说生死轮转因缘经 经名：洞玄灵宝玄一真人说生死轮转因缘经。 撰人不详，似出於唐代。 一卷。 底本出处：《正统道藏》太平部。 洞玄灵宝玄一真人说生死轮转因缘经 尔时，仙人云度以景元元年正月二十日，於昆仑金台玉室请问三天法师玄一真人曰：自以卑下谬遭皇恩，积学二千八百余年，虽得乘云驾龙逍遥太空，未得登天之任。 阴阳之事，来去之缘，事非所关，理不得知。 近而未审人生死因缘，为父、为母、为兄、为弟，姊妹室家，为世世常会，复有分别，各随功德，先世之人，为生后世与不，其罪福多少，为轻为重，尽受何形，其道异同，师友交会，皆缘何因？ 愿为分别，释所未闻。 真人曰：子之所问，微乎远矣，来去之事，将亦未闻。 运度当周，事不容藏，今为子说之，秘而奉行。 道常一也，无极无穷，古天所奉，今天所宗，其一无二，但诸天人，言音不同，号之为异。 大归一也，师亦一也，但随世变易，出化於世，匠成万物。 先世之人，轮於太阴，后各随功受生，是今世之人也。 天地一阖，人随运灭，天地一开，人随运生。 日月星辰，亦随运转。 是故因缘不绝，天地与人、日月星辰，亦不重易，但缘展转以相生。 父母、妻子、兄弟、姊妹，皆非常会，各随福德，来暂寄胎於父母也。 后复各随功德，运转散离，无有常定； 或先世为父母，后生为子孙； 或先世为兄弟，后世为父母，轮转去来，更生更死。 师者，传世不绝，常为师也。 故师，我父母也，为常生之匠。 父母兄弟，本亦无亲，但随福德来寄生，父母养成人。 故圣人制法，孝顺以报育养之恩，以致孝心。 若不孝不顺，王法诛之，天亦伐之。 兄弟暂共生於父母，当相亲爱，共致孝心； 父母终亡，祖葬礼毕，以报生养之恩。 四时祠杞，以为慈孝之法，传告后世，使知有孝养之恩。 夫妇亦鲜相事，易重恩爱，弃父母之姓，就夫之姓。 未嫁系命父母，既嫁击命於夫，夫亡系命於子。 妇死夫存，门户由成，夫死妇嫁，血脉断绝。 故男属父姓，女属母生，无名无姓。 人生世间，如春草之华，生无定日，死有常分。 生时暂共为室家，死各随因缘归所系属，不复会也。 有福者，更生天堂，或生贵家王候之门。 有罪者，系於长夜，涂若谪罚无极。 唯四时五腊时，或聚会相见，亦复欢喜，念生时恩爱，既别之后，各还所属，永相去失，不复忆之。 须鬼功竟，随谪轻重，各随因缘，或生为人，或堕五道六畜、边夷之中，先日之缘，冥然绝矣，无复有亲。 人生有子孙，阴阳之礼，会乐天地之间，死亡，精魂在天，但有谪罚，无复阴阳相生之义。 故生以为人，死以为鬼，生死之间，但易名而已。 生之为乐，死之为苦，故令生人不得知地下鬼事，死人为鬼，知地上之事。 为鬼皆乐生活，但不能自，须罪竟过，轻者得还生人中，更随功多少，寄胎生为人。 生为恶者，死为鬼，求生终不得生，方充长徒，寒苦无极； 罪尽，当作六畜形，或边夷之类，或生六疾，盲聋癫痴，为男女臭秽，可憎之极，为人所不友。 生受饥寒，冻饿至死，苦毒后，又生六畜之中，未有脱期。 或生奴婢下贱之人，驱使畏人，常苦饥寒，笞杖在身，观人俛仰，任人杀活。",
      "translated_text": "**The Scripture of the Wheel of Life and Death’s Causes and Conditions as Spoken by the Perfected One of Mysterious Unity of the Cavernous Mystery and Numinous Treasure**\n\n**Scripture Title:** *The Scripture of the Wheel of Life and Death’s Causes and Conditions as Spoken by the Perfected One of Mysterious Unity of the Cavernous Mystery and Numinous Treasure*. Author unknown, likely composed during the Tang dynasty. One scroll.\n\n**Source Text:** *Zhengtong Daoist Canon*, Peace Section.\n\n---\n\nAt that time, on the twentieth day of the first month of the first year of Jingyuan, the immortal Yun Du ascended the Jade Chamber of the Golden Terrace of Kunlun to inquire of the Three Heavens’ Dharma Master, the Perfected One of Mysterious Unity, saying:\n\n\"Though I, in my lowly station, have undeservedly received the imperial grace and accumulated study for over two thousand eight hundred years—able to ride clouds and mount dragons in carefree roaming through the great void—I have yet to attain the office of ascending heaven. The affairs of yin and yang, the causes of coming and going, lie beyond my concern, and their principles remain unknown to me.\n\nRecently, I have been unable to discern the causes and conditions of human life and death: whether as father, mother, elder brother, or younger brother; as sisters or household members—do they meet again in every generation, or are there distinctions? Do they each follow their virtue and power, so that those of former lives are reborn in later ones, or not? How great or small are their transgressions and blessings? Are they light or heavy? What forms do they fully receive? How do their paths differ? By what causes do masters and friends meet?\n\nI wish for you to distinguish these matters and expound what I have not yet heard.\"\n\nThe Perfected One replied: \"Your questions are subtle and profound. The matters of coming and going are such that even you have not yet heard of them. The turning of the kalpa is complete, and these affairs cannot remain hidden. Now I shall speak of them to you—guard them as secrets and uphold them.\n\nThe Dao is eternally One, without limit or end. It was revered by the ancient heavens and is honored by the heavens today. It is One without duality, yet the various heavens and humans speak in different tongues and name it differently. Its great return is to the One. The master, too, is One, but with the changes of the world, they emerge to transform it, shaping the myriad things.\n\nThose of former lives revolve within the Great Yin, and later, each is reborn according to their merit—these are the people of the present world. When heaven and earth close, humans perish with the turning of the kalpa; when heaven and earth open, humans are born with its turning. The sun, moon, and stars likewise revolve with the kalpa. Thus, the causes and conditions are unbroken. Heaven and earth, humans, the sun, moon, and stars do not repeat themselves but instead give rise to one another in endless succession.\n\nFathers, mothers, wives, children, brothers, and sisters are not constant gatherings. Each follows their fortune and virtue, temporarily lodging in the wombs of their parents. Later, they again disperse and part according to their merit, their revolutions without constancy. One who was a father in a former life may be reborn as a descendant; one who was a brother may become a father in a later life. They revolve in coming and going, dying and being reborn again.\n\nThe master, however, transmits the generations without end and is eternally the master. Thus, the master is my father and mother, the eternal artisan of life. Fathers, mothers, and brothers are not inherently kin; they merely follow their fortune and virtue to lodge and be born, with parents raising them to maturity. Therefore, the sages established the law of filial piety to repay the grace of nurturing and to cultivate a heart of devotion. Those who are unfilial and disobedient are punished by the king’s law, and heaven also strikes them down.\n\nBrothers, temporarily born together of the same parents, should cherish one another and together cultivate a heart of devotion. When parents pass away and the rites of burial are completed, this repays the grace of their nurturing. The sacrifices of the four seasons serve as the law of compassion and devotion, passed down to later generations so they may know the grace of filial nurturing.\n\nHusbands and wives rarely serve one another for long; their bonds of love are easily broken. A wife abandons her parents’ surname to take her husband’s. Before marriage, her fate is tied to her parents; after marriage, it is bound to her husband. If her husband dies, her fate is tied to her son. If the wife dies and the husband lives, the household remains intact. If the husband dies and the wife remarries, the bloodline is severed. Thus, sons belong to their father’s surname, while daughters belong to their mother’s birth—nameless and without surname.\n\nHuman life in the world is like the blossoms of spring grass: birth has no fixed day, but death has its destined portion. While alive, they temporarily share a household; in death, each follows their causes and conditions to return to their destined realm, never to meet again. Those with fortune are reborn in heaven or in the gates of noble families and kings. Those with transgressions are bound to the long night, their paths like endless exile and punishment.\n\nOnly during the four seasons and the five *la* festivals may they gather and meet again, rejoicing and recalling the love of their time alive. Yet after parting, each returns to their own realm, forever separated, never to remember one another again. When their ghostly merit is exhausted, they follow the weight of their exile, each according to their causes and conditions—some reborn as humans, others falling into the five paths or the six kinds of livestock, or among the border barbarians. The bonds of former days vanish into darkness, and kinship is no more.\n\nWhen humans have descendants, the rites of yin and yang gather joy between heaven and earth. In death, their essence and spirit remain in heaven, but if they face exile and punishment, the principle of yin and yang’s mutual generation no longer applies. Thus, in life, one is human; in death, one is a ghost. Between life and death, only the name changes.\n\nLife is joy; death is suffering. Therefore, the living cannot know the affairs of the ghosts below, while the dead, as ghosts, know the affairs of those above. All ghosts delight in life, yet they cannot act on their own. When their transgressions are exhausted, the lighter ones may return to be reborn among humans, again lodging in the womb according to the measure of their merit.\n\nThose who do evil in life die as ghosts, forever unable to seek rebirth. Instead, they fill the ranks of the long-bound, suffering cold and misery without end. When their transgressions are exhausted, they take the forms of the six kinds of livestock, or the tribes of the border barbarians, or are born with the six afflictions—blindness, deafness, madness, or idiocy—becoming foul and repulsive men and women, utterly despised. They endure hunger and cold, freezing and starving to death. After their suffering, they are reborn among the six kinds of livestock, with no hope of escape. Some are born as slaves or lowly people, driven and feared by others, constantly suffering hunger and cold, their bodies bearing the lash. They watch others rise and bow, their lives and deaths at the mercy of others.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1218,
      "start_sentence": 0,
      "end_sentence": 47,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.72699475288391,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\洞玄灵宝玄一真人说生死轮转因缘经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "尔时，魂神不复自知从何来生，唯考鬼知之。 生有善功，死为鬼君，欢乐之堂，天给厨食，逍遥无为，须功竟后，生天王之门，或富贵之家，财禄自然，适意自足，与善人相会，恒值圣世，贤人结缘，福路日生。 身后命终，径生天堂。 若能供养三宝，心慕神仙，必降致仙人，白日升天之道。 若但修常善之行，不经泰山地官，七祖同庆。 生死之事，明如日月，贤者独见，愚人不识。 谛受精思，自然朗察。 弃放恶心，以善为业，天地冥冥，功过无脱，毫毛悉载，无有漏失也。 真人曰：凡人生死，上古之时悉皆由心，天帝门下校定名录：应死者，削除生名，更上鬼字； 应来生世，削落鬼字，更上生名。 然后随其福德轻重，轻者生贫贱之家，生世涂炭，备经六极至死，寒苦流曳，卖身饴口，恒不饱足，衣服恒不盖形，有人之形，无人之禄功。 重者生贵盛之门，或生财禄，不要自来，万向良合，衣食自然，不经辛苦，恒值善人，贤圣交会。 今下古未传，运气当终，人生无有定寿，天选人身，自有主生神，又有主死神在人身中。 生世好生，则生神护之； 生世好死，则死神伐之。 好生之人，则与生券之中； 好死之人，则与死券之下。 皆结约分明，而人不觉知也。 生世积善，则与圣人相值，名入左契。 生为人主，死为天堂之宾，七祖同欢，后生或为王侯之子，或生世聪明圣达，为天人之师，四海人神宗奉，功满白日升仙。 故功德不绝，世世常与贤圣结缘，巍巍之功，莫有比者。 生世为恶，则与恶人相宜，名入死籍右契之中。 在世常与善人相远，众不定会，福德之处常所不受，死入地狱饿鬼之中，七祖相牵，冥冥长夜，未有出期。 是为善恶，相去何若。 生世为善之人，天选善人来生为其子孙，使父母得其恩福，皆由善功之报。 生世为恶，天选恶逆子孙来生其门，堕地难保，既得成大，为人逆恶不孝。 或轻淫偷盗，劫贼杀人，恒为父母重忧，罪轻役身，重则没身； 或贫贱穷寒，有朝无暮，为人走使，常苦饥冻，衣不盖形，杖罚不去於身，不识昔缘； 或痴聋喑痖、盲目筋挛，或朝生夕死，或三岁十岁垂及成人而死，或为人及毒兽所害而死。 或恒为官狱囚系无已，令父母忧愁叹息而行； 或多生女无男，至老孤独穷厄。 如此，皆先世行恶之报，更相牵对为父母子孙。 其理分明，不可违犯，犯者不原。 真人说生死去来因缘竟，而颂善缘来生，其辞曰： 大道体本无，二气幽绝冥。 阴阳和三德，天地运机张。 生死随运转，罪福不偏婴。 积福种善功，善人来相生。 福缘善来会，去来身受荣。 生出为世主，或为天人宗。 命过天堂宾，福禄恒随身。 策龙辔朱凤，逍遥戏上清。 或为诸圣王，封掌於十天。 七祖同受庆，南宫更受生。 永与恶缘绝，世世常光明。 真人又颂恶缘来生，曰： 天地虽无无，可以期相生。 生世不念善，为罪重积盈。 死受涂炭苦，风火不去形。 罪竟还生人，恒托寒贱门。 抱病婴重疾，聋盲癫且狂。 罪逆自来会，众恶不去身。 形系鞭笞杖，鬼病岁不空。 父母长叹息，生死地狱中。 冥冥沦恶道，望善永无缘。 真人曰：道以归善，如水投渊。 恶人之难化，如高树之标，无良地之源。 虽闻善道，当时知有，因顾已忘，如雨堕高林，当时虽润，回即已燥。",
      "translated_text": "At that time, the soul no longer knows from whence it came to be reborn—only the spirits of the dead may discern it. If one’s life held good deeds, in death one becomes a lord of ghosts, dwelling in halls of joy, where heaven provides food from its kitchens. Free and at ease, one awaits the end of one’s merits, then enters the gates of heavenly kings or is born into a family of wealth and nobility. Wealth and emolument arise naturally, desires are fulfilled, and one meets with the good. Ever abiding in a sagely age, one forms bonds with the worthy, and the path of fortune grows day by day. When the body’s life ends, one ascends directly to the heavens.\n\nIf one has made offerings to the Three Treasures and yearns in heart for immortality, immortals will surely descend to teach the Way of ascending to heaven in broad daylight. If one merely cultivates ordinary good deeds without passing through the Earth Bureau of Mount Tai, seven generations of ancestors will rejoice together. The matters of life and death are as clear as the sun and moon, yet only the wise perceive them while the foolish remain blind. Examine closely and ponder deeply, and understanding will naturally dawn.\n\nAbandon evil thoughts and take goodness as your calling. In the hidden depths of heaven and earth, deeds and transgressions escape not the slightest reckoning—every hair is recorded, nothing is lost or overlooked.\n\nThe Perfected One said: In the life and death of all people, as in the earliest ages, all depends upon the heart. At the gates of the Heavenly Emperor, names are reviewed and decrees issued: those fated to die have their living names erased and replaced with ghostly ones; those fated to be reborn in the world have their ghostly names erased and living ones restored. Then, according to the weight of their merit and virtue, the light are born into poor and lowly families, entering a world of suffering, enduring all six extremes until death. Cold and misery drag them on, selling themselves to feed their mouths, never full, their clothing never covering their bodies. They bear the form of humans but lack human blessings and rewards. The heavy in merit are born into noble and prosperous families, or into wealth and emolument that come unbidden, aligning with all that is good. Clothing and food arise naturally, without toil, and they constantly meet with the good and worthy, forming bonds with sages.\n\nIn this later age, the transmission has waned, and the qi of destiny nears its end. Human life holds no fixed span; heaven selects the body, and each person has a spirit that governs life and another that governs death dwelling within. Those who cherish life are protected by the life spirit; those who court death are assailed by the death spirit. Those who cherish life are inscribed in the register of life; those who court death are inscribed in the register of death. All is bound by clear covenants, yet people remain unaware.\n\nThose who accumulate goodness in life meet with sages and have their names entered in the left contract. In life, they become rulers of men; in death, guests of the heavenly halls. Seven generations of ancestors rejoice together, and later births may be as sons of kings and lords, or they may be born wise and sagely, becoming teachers of gods and men, revered by all within the four seas. When their merit is complete, they ascend to immortality in broad daylight. Thus, if merit and virtue are never severed, one generation after generation forms bonds with the worthy and sagely. Such towering merit has no equal.\n\nThose who do evil in life align with the wicked, their names entered in the right contract of the register of death. In life, they remain distant from the good, their gatherings unstable, and they never receive the blessings of fortune. In death, they enter the hells and the realm of hungry ghosts, their seven generations of ancestors drawn along with them into the endless dark night, with no hope of escape. Such is the difference between good and evil—how vast it is!\n\nThose who do good in life are chosen by heaven to have good people born as their descendants, so that parents receive their grace and fortune, all as recompense for good deeds. Those who do evil in life are chosen by heaven to have wicked and rebellious descendants born into their families, doomed from birth, growing to become disobedient and unfilial. Some engage in licentiousness, theft, banditry, or murder, constantly bringing their parents great sorrow. For lighter offenses, they are enslaved; for heavier ones, their lives are forfeit. Or they may live in poverty and cold, with no security from morning to night, serving others, constantly suffering hunger and cold, their clothing never covering their bodies, the lash never leaving their flesh. They know not the causes of their past, or they may be born deaf, mute, blind, or crippled, dying in infancy or at three or ten years old, or just as they near adulthood. Some are killed by people or poisonous beasts, or are endlessly imprisoned, causing their parents to grieve and sigh as they go about their days. Or they may bear many daughters and no sons, living to old age in loneliness and hardship. All this is the recompense for past evil deeds, as parents and children are bound together in mutual retribution. The principle is clear and cannot be violated; those who violate it find no pardon.\n\nThe Perfected One having expounded the causes and conditions of life, death, and rebirth, now chants the verses on the good karma of future lives:\n\nThe Great Dao’s essence is originally none,\nThe two qi deep and obscure.\nYin and yang harmonize the three powers,\nHeaven and earth set their mechanisms in motion.\nLife and death follow the turning of destiny,\nSin and fortune cling to none unfairly.\nAccumulate fortune and plant good deeds,\nAnd good people will come to be born.\nFortunate bonds and goodness converge,\nIn coming and going, the body receives glory.\nBorn to be a lord of the age,\nOr a master of gods and men.\nWhen life ends, a guest of the heavenly halls,\nFortune and emolument ever follow.\nRiding dragons and reining red phoenixes,\nWandering carefree in the Upper Clarity.\nOr becoming a sage-king,\nEnfeoffed and ruling the ten heavens.\nSeven generations rejoice together,\nIn the Southern Palace, reborn anew.\nForever severed from evil bonds,\nGeneration after generation, ever radiant.\n\nThe Perfected One further chants the verses on the evil karma of future lives:\n\nThough heaven and earth are not none,\nThey may be expected to give birth in turn.\nLiving in the world without thought of goodness,\nOne’s sins heavily accumulate.\nIn death, suffering in the mire and ashes,\nWind and fire never leave the form.\nWhen the sins are exhausted, one is reborn as a human,\nEver dwelling in cold and lowly gates.\nGripped by illness and heavy afflictions,\nDeaf, blind, mad, and deranged.\nSin and rebellion naturally converge,\nAll evils never leave the body.\nBound in form by whips and cudgels,\nGhostly sicknesses never cease for a year.\nParents sigh endlessly,\nBorn and dying in the hells.\nSinking into the dark evil paths,\nHoping for goodness, forever without cause.\n\nThe Perfected One said: The Dao returns to goodness as water flows to the abyss. The difficulty of transforming the wicked is like the treetop of a tall tree, lacking the source of good earth. Though they hear the good Dao and know it in the moment, they turn away and forget, like rain falling on a high forest—though momentarily moistened, it dries at once.",
      "overlap_context": "th the six afflictions—blindness, deafness, madness, or idiocy—becoming foul and repulsive men and women, utterly despised. They endure hunger and cold, freezing and starving to death. After their suffering, they are reborn among the six kinds of livestock, with no hope of escape. Some are born as slaves or lowly people, driven and feared by others, constantly suffering hunger and cold, their bodies bearing the lash. They watch others rise and bow, their lives and deaths at the mercy of others.\"",
      "start_char": 1218,
      "end_char": 2453,
      "start_sentence": 48,
      "end_sentence": 105,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.95152926445007,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\洞玄灵宝玄一真人说生死轮转因缘经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "善人闻道，如大江之渊，大海之源，惟受不逆。 道教难闻，圣人难值，贤者难遇，自非天地运度当交，经道不出，圣人不见。 帝王有道，圣人生国，大运当交，期度将会。 天运转促，至末世之后，朔旦冬节，金氏之世，经道方明。 其时当暂太平，数十年中，人民五分，四分知道。 至金马之末，天运交周，水龙之岁，李君出治。 其时圣世，生死善恶将分，善心男女，逆作善功。 至时，当有圣人出世度人，有遇值者，便是宿功报应，或身得超度，或一门同庆，得入福中。 当恶之人，常与善乖，闻圣人说法，谓之为无，此非善人之根，天闭其心，使不与圣人相宜。 故善恶异流，天地永隔。 运交之际，道德虽兴，愚者甚多，知道者少，万中有一，以为多也，各各教化，不寻本源。 其时当有鬼黠之子，因是犹豫二心，不信大法，亦不能分别真伪，将是期度欲交，天使之然。 有心男女，善则勿退，退则失尔； 前功一失，贤人万劫不会。 夫贤人出世，难得平奉，或托痴聋，或清或浊，或廉或贞，或隐或见，或是或非，或弃薄天人，或偏有所爱，入境之始，恶当有异。 若是圣人，其行不移，虽诸变化，久故恒清，与凡有别，是为不杂常俗。 既见之后，恐不可得奉，其当潜隐，或去於境邑，或绝踪无迹。 若与是乖，万劫永隔； 尔与贤人结缘，则坐享福祚，七祖登天，死升天堂，衣食自然。 如此，皆先世有缘，道使之然。 无缘之子，虽居茸贤人之篱，坐贤人连席，其缘不会，非可强求。 明知罪福，毫分不失，纵复遇会，或婴罹众祸，因是不集，此皆前世无缘，天迷其心，鬼闭其意，不使得与善会，故有殊隔，使其更致重离，去善日远。 若人之欲善，因会遇害，因心不退，福必来会。 言毕，於是也传与贤人，勿令漏泄，具如经法，盟乃传焉。 洞玄灵宝玄一真人说生死轮转因缘经竟",
      "translated_text": "The good person who hears the Dao is like the abyss of a great river or the source of the vast sea—only receiving, never rejecting. The teachings of the Dao are rarely heard, sages are seldom encountered, and the worthy are difficult to meet. Unless the cycles of heaven and earth align and their movements converge, the scriptures of the Dao will not emerge, and sages will not appear. When the emperor rules with the Dao, sages are born in the land; when the great cycle converges, the appointed time draws near.\n\nAs the celestial movement hastens toward the final age, at the winter solstice of the new moon, in the era of the House of Jin, the scriptures of the Dao will at last become clear. For a brief time, there shall be great peace, and for several decades, one in five among the people will understand the Dao. When the age of the Golden Horse draws to its end and the celestial cycle shifts to the Zhou, in the year of the Water Dragon, Lord Li shall arise to govern. In that sagely era, the distinctions between good and evil in life and death will become clear. The virtuous among men and women shall turn to perform good deeds.\n\nAt that time, a sage shall appear in the world to deliver sentient beings. Those who encounter him shall receive the karmic retribution of past deeds—some shall attain liberation in this very life, while others shall rejoice as entire households enter into blessedness. But the wicked, ever at odds with goodness, upon hearing the sage’s teachings, shall dismiss them as nothing. These are not the roots of good people; heaven seals their hearts, preventing them from harmonizing with the sage. Thus, the streams of good and evil diverge, forever separated by heaven and earth.\n\nWhen the cycles converge and the Dao and virtue flourish, fools shall be many, while those who understand the Dao shall be few—one in ten thousand, and even that is considered abundant. Each shall teach and transform, yet none shall seek the original source. At that time, there shall be cunning and deceitful individuals, wavering in doubt, disbelieving the great Dharma, unable to distinguish truth from falsehood. As the appointed time nears its convergence, heaven ordains it to be so.\n\nMen and women of sincere heart, if you are good, do not retreat, for retreat means loss. Once the merit of former deeds is lost, a worthy one shall not appear again for ten thousand kalpas. When a worthy one appears in the world, it is difficult to serve them properly. Some may feign foolishness or deafness, some may be pure or turbid, some upright or chaste, some hidden or revealed, some right or wrong, some may spurn the shallow among gods and humans, while others may favor one thing over another. At the outset of their arrival, evil shall manifest in strange ways. But if it is a true sage, their conduct shall remain unshaken. Though they undergo myriad transformations, their essence shall remain eternally pure, distinct from the ordinary, untainted by common customs.\n\nOnce you have encountered them, fear that you may not have the chance to serve them again. They may withdraw in concealment, depart from the land, or leave no trace behind. If you oppose them, you shall be forever separated for ten thousand kalpas. But if you form a karmic bond with the worthy one, you shall sit and enjoy blessings, your seven ancestors shall ascend to heaven, and after death, you shall rise to the celestial halls, where clothing and sustenance come naturally. All this arises from karmic connections in past lives, ordained by the Dao.\n\nThose without such connections, though they dwell beneath the eaves of the worthy one or sit beside them, shall never form a bond, for it cannot be forced. The distinctions between sin and fortune are precise, not a hair’s breadth in error. Even if they chance to meet, they may suffer manifold calamities, preventing the convergence of good fortune. This is all due to the lack of karmic affinity in past lives; heaven confounds their minds, ghosts seal their intentions, preventing them from joining with goodness. Thus, they remain forever apart, drifting ever farther from virtue.\n\nIf one desires goodness and, upon encountering harm, does not retreat in heart, fortune shall surely come. Having spoken thus, the teachings are now transmitted to the worthy. Let them not be leaked, for they accord with the scriptural methods. Only after the oath is sworn shall they be passed on.\n\nHere ends *The Scripture of the Wheel of Life and Death: Causes and Conditions*, as Spoken by the Perfected One of Cavernous Mystery and Numinous Treasure, the True One of the Primordial Unity.",
      "overlap_context": " a year.\nParents sigh endlessly,\nBorn and dying in the hells.\nSinking into the dark evil paths,\nHoping for goodness, forever without cause.\n\nThe Perfected One said: The Dao returns to goodness as water flows to the abyss. The difficulty of transforming the wicked is like the treetop of a tall tree, lacking the source of good earth. Though they hear the good Dao and know it in the moment, they turn away and forget, like rain falling on a high forest—though momentarily moistened, it dries at once.",
      "start_char": 2453,
      "end_char": 3154,
      "start_sentence": 106,
      "end_sentence": 130,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.93163776397705,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\洞玄灵宝玄一真人说生死轮转因缘经.txt",
        "category": "正统道藏太平部"
      }
    }
  ]
}