{
  "source_id": "洞玄灵宝太上六斋十直圣纪经",
  "source_file": "chunked_daozang\\洞玄灵宝太上六斋十直圣纪经.json",
  "total_chunks": 3,
  "total_original_chars": 3667,
  "total_translated_chars": 21126,
  "total_translation_time": 99.99183583259583,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞玄灵宝太上六斋十直圣纪经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Numinous Treasure Scripture of the Six Fasts and Ten Upright Days of the Cavernous Mystery**\n\n**Scripture Title:** *The Supreme Numinous Treasure Scripture of the Six Fasts and Ten Upright Days of the Cavernous Mystery*\nAuthor unknown, approximately composed during the Sui or Tang dynasties. Discusses the dates of fasts and the methods of fasting. One scroll.\nSource text: *Daoist Canon of the Orthodox Tradition*, Section Zheng Yi.\n\n---\n\n### **The Five Precepts of Daoism**\n1. Refrain from taking life.\n2. Refrain from indulging in alcohol.\n3. Refrain from duplicity—speaking one thing while thinking another.\n4. Refrain from theft.\n5. Refrain from lust and lewdness.\n\n### **The Ten Virtues**\n1. Constantly hold filial piety toward parents in mind.\n2. Constantly hold loyalty to ruler and teacher in mind.\n3. Constantly hold compassion for all beings in mind.\n4. Constantly hold forbearance and tolerance for wrongs in mind.\n5. Constantly hold admonition and opposition to evil in mind.\n6. Constantly hold self-sacrifice to aid the destitute in mind.\n7. Constantly hold the liberation of living beings and the nurturing of creatures in mind, planting fruit groves.\n8. Constantly hold the digging of wells by roadsides and the planting of trees and building of bridges in mind.\n9. Constantly hold the promotion of benefit and elimination of harm for others in mind, teaching and enlightening the unenlightened.\n10. Constantly hold the recitation of the scriptures and precepts of the Three Treasures in mind, perpetually offering incense, flowers, and ritual implements.\n\nThose who perpetually practice these Five Sincerities and Ten Virtues shall be guarded by celestial and numinous spirits, forever dispelling calamities and perpetually attaining blessings and protection—this lies solely in unwavering resolve.\n\n### **The Six Annual Fasts**\nThe first, third, fifth, seventh, ninth, and eleventh months.\n\n### **The Ten Monthly Fasts**\n1. The first day: when the Northern Dipper descends.\n2. The eighth day: when the Northern Dipper’s Deity of Slaying Spirits descends.\n3. The fourteenth day: when the Messenger of the Great One descends.\n4. The fifteenth day: when the Heavenly Thearch and the Three Officials descend together.\n5. The eighteenth day: when the Great One descends.\n6. The twenty-third day: when the Eight Divine Messengers of the Great One descend.\n7. The twenty-fourth day: when the Northern Asterism descends.\n8. The twenty-eighth day: when the Lower Great One descends.\n9. The twenty-ninth day: when the Middle Great One descends.\n10. The thirtieth day: when the Upper Great One descends.\n\nOn the days of the Lower, Middle, and Upper Great Ones, all the honored deities of Heaven, Earth, and Water descend together, traversing the world to observe the good and evil of humanity.\n\n- On *jiǎzǐ* days, the Great One reviews the records of spirits.\n- On *gēngshēn* days, the Crouching Corpse reports human transgressions.\n- On one’s *bĕnmìng* (natal) day, one’s merits and conduct are calculated.\n- On the Eight Seasonal Nodes, eight spirits record human good and evil.\n- On the Three Primordial Days, the Three Officials of Heaven, Earth, and Water examine human transgressions and blessings.\n\n### **The Three Assembly Days**\n1. The seventh day of the first month: the Assembly of Promotion and Reward.\n2. The seventh day of the seventh month: the Assembly of Celebrating Life.\n3. The fifth day of the tenth month: the Grand Assembly of Establishing Life.\n\nOn the Three Assembly Days, the Three Officials assess merits and transgressions; it is fitting to receive talismans and registers, observe fasts, and present memorials to pray for abundant blessings.\n\n### **The Five La Days**\n1. The first day of the first month: *Tiān Là* (Celestial La).\n2. The fifth day of the fifth month: *Dì Là* (Earthly La).\n3. The seventh day of the seventh month: *Dàodé Là* (Dao-Virtue La).\n4. The first day of the tenth month: *Mínsuì Là* (People’s Year La).\n5. The La day of the twelfth month: *Hóuwáng Là* (Marquis-King La).\n\nOn the Five La Days, one should always make offerings to ancestral spirits, thereby becoming a filial child and attaining boundless blessings. All other days are considered excessive or improper sacrifices.\n\nTogether with the Three Primordial Days, these form the Eight Liberation Days, on which one may set up pure offerings to seek blessings.\n\n### **The Method of Fasting and Upright Conduct**\nThe essentials lie in abstaining from rich flavors, meat, pungent foods, alcohol, and lust; eliminating malice, jealousy, and delusive thoughts; and refraining from all evils. One should only burn incense, light lamps, recite scriptures, perform repentance rites, and pray for the universal deliverance of all from disasters and misfortunes—this constitutes fasting.\n\nFormerly, Confucius said to Laozi: “I, Qiu, live in poverty and have long abstained from alcohol and meat.”\nLaozi replied: “This is the fast of sacrificial offerings. You must unify your will: do not listen with your ears but with your mind; do not listen with your mind but with your *qi*. Purify your mind, cleanse your spirit, and shatter your intellect—I shall then speak to you.”\n\n### **Discourse**\nAccording to the fasting methods in various scriptures, there are roughly three levels:\n1. **Offering Fast**: By which one accumulates virtue and resolves transgressions.\n2. **Abstention Fast**: By which one harmonizes the spirit and preserves longevity. This is the sacrificial fast, practiced by those of middling capacity.\n3. **Mind Fast**: This entails purifying the mind and eliminating desires, cleansing the spirit and removing defilements, shattering one’s intellect and cutting off thoughts. Without thought or worry, one focuses solely on the Dao; without craving or desire, one delights in the Dao; without defilement or encumbrance, one unites with the Dao. Since the mind harbors no dualistic thoughts, it is called “unified will.” This is practiced by those of superior capacity.\n\nIn essence, “fasting” (*zhāi*) means “to align” (*qí*). The essentials lie in aligning and rectifying the Three Karmas—only then does it constitute fasting. If one merely observes dietary abstention while the mind remains unaligned, or if one merely unifies the will, then the mouth will not crave flavors. These two methods—outer and inner—mutually support one another. Thus, the *Scripture of the Great Precepts* states: “Calm the mind and still the breath, focus on single-mindedness without duality; do not eat after noon; maintain inner and outer purity and emptiness.”\n\nThough Confucius was skilled in dietary abstention, he had not yet mastered the regulation of the mind. Therefore, this fasting method was shown to him so that he might receive the Dao. Yet how many of the later learners can truly empty their minds and unify their wills? Those who vulgarize the teachings of sacrificial fasting, claiming to have grasped the principles of the Mind Fast, are merely arrogant and indolent. Though they may speak of mystery and quiescence, their eyes reveal no understanding—they merely pride themselves.\n\nThe *Book of Changes* states: “The sage uses this for fasting and vigilance.”\n\nEach person is born with a specific year, month, day, and hour, determined by their corresponding constellation, which defines their poverty or wealth, nobility or baseness, lifespan, and fate. Yet the six kinds of possessions—gathering and scattering, life and death, success and failure, flourishing and decline—are the eternal patterns of the world, the natural oppositions of the cosmos.\n\nThe five colors are awls that pierce the eyes.\nThe five tones are hammers that deafen the ears.\nThe five flavors are axes that sever the tongue.\nWealth and goods are things that confuse people.\n\nThus, no misfortune is greater than death, and no blessing is greater than life. Therefore, the fame that is sought is the sack that buries the self.\n\nThe nameless name is the dwelling that nurtures me.\nThe coveted wealth is the thief that destroys me.\nThe wealth that is not coveted is the blessing that nurtures me.\n\nNo sin is greater than lust,\nno misfortune greater than greed,\nno fault greater than transgression—\nthese three are the chariot of calamity.\nIn small measure, they ruin the self;\nin great measure, they ruin the household.\n\nTo cultivate life and nourish nature,\nto bear the spirit and uphold destiny,\nis to depart from suffering and ascend to joy,\nwhere blessings and felicity flow endlessly.\n\nHuman life arises from the spirit:\nwhen the spirit abides, life endures;\nwhen the spirit severs, death follows.\nThus, diligent devotion and accumulated sincerity\ncan lift the form to ascend to the Mystic Palace.\n\nPeople only know to indulge in rich delicacies to please the mouth,\nto seek ranks and emoluments to glorify the self,\nyet do not consider that the food that pleases the mouth\nis the axe that severs life,\nand that extravagant ranks and luxuries\nprovoke the resentment of all under heaven.\n\nThe Perfected Lord says:\nThe Dao is the utmost truth of numinous penetration.\nTechnique is the mysterious art of transformation.\nFrom form to the formless,\none relies on technique to aid others.\nHuman beings possess numinosity,\nand through cultivation, they unite with the Dao.\nIf one can study this,\ntransformation arises naturally.\n\nThe essence of the Dao\nlies in its simplicity and ease of practice.\nThe secrets of its defense\nreside in talismans, medicines, and qi.\nTalismans are the numinous script of the Three Luminaries,\nthe true pledge of heaven.\nMedicines are the blossoms and essences of the Five Phases,\nthe refined essence of earth.\nQi is the harmonious qi of yin and yang,\nthe numinous vitality of the myriad things.\nThough you may master one aspect,\nyou must still rely on talismans, medicines, and the Dao to complete it.\nMedicine refines the form;\ntalismans summon the spirit.\n\nOne who cherishes the self\ncannot be harmed even by heaven and earth.\nOne who guards their resolve\ncannot be defeated even by all under heaven.\nOne who is content in poverty\ncannot be enriched even by all under heaven.\nOne who delights in lowliness\ncannot be ennobled even by all under heaven.\n\nNever has there been reverence without all things revering,\nnever humility without all things yielding,\nnever pride without all things esteeming,\nnever kindness without all things bestowing kindness.\n\nGuard straightness with crookedness,\nwhiteness with disgrace,\neloquence with simplicity,\nskill with clumsiness.\nTake non-boasting as fulfillment,\nnon-knowing as nobility,\nlove and favor as alarm.\n\nDo not tread where there is no ground for safety,\nand thus the hundred misfortunes cannot befall you.\nDo not follow treacherous or uneven paths,\nand thus peril and obstruction cannot endanger you.\nDo not defile your resolve with emoluments and rank,\nand thus punishments cannot be imposed upon you.\nDo not take slander and praise as joy or anger,\nand thus vilification cannot follow you.\n\nThe hundred misfortunes cannot befall you—\nthus you grasp the essence of the myriad things.\nPeril and obstruction cannot endanger you—\nthus you preserve the blessing of eternal peace.\nPunishments cannot be imposed upon you—\nthus you fulfill the years of a long life.\nVilification cannot follow you—\nthus you perfect your pure and unadulterated truth.\n\nIf one can be empty, tranquil, and pure,\ncompassionate, kind, loyal, and trustworthy,\nfilial, respectful, harmonious, and compliant,\nhumble, diligent, frugal, gentle, sincere, and plain,\nthen one is in accord with the Dao.\n\nThus, when the Dao is applied to the self,\nthe mind is enlightened and the will is unobstructed.\nOne values the spirit and cherishes qi,\ndisdains things and scorns fame.\nThoughts are not confused,\nblood and qi are harmonious,\nsinews and bones are nimble,\nears and eyes are keen,\nskin and flesh are moist and lustrous,\nthe face radiates glory,\nthe spirit is focused and steadfast,\nthe body is light and strong,\nthe void and the full follow one another,\nand the temples are lustrous.\n\nWhen the Dao is applied to the household,\nfathers are kind and children filial,\nhusbands trustworthy and wives chaste,\nelder brothers good and younger brothers compliant,\nthe nine clans harmonious.\nFarming and sericulture are timely and abundant,\ngranaries and storehouses are amply stocked,\nthe six livestock multiply,\nand undertakings are well-ordered—\nthere is always surplus.\n\nThus, when ruler and minister follow the Dao, there is loyalty and kindness.\nWhen father and child follow the Dao, there is benevolence and kindness.\nWhen scholar and commoner follow the Dao, there is mutual love.\nWhere there is the Dao, there is harmony;\nwhere there is no Dao, there is discord.\nFrom this, we see that the Dao\ncannot be departed from even for a moment.\n\nWenzi asked Laozi:\n“What are the Dao, virtue, benevolence, righteousness, and ritual?”\n\nLaozi said:\nTo be formless and non-active,\nto cultivate the self within\nand govern others without,\nto accomplish works and establish affairs,\nand to neighbor with heaven—\nthis is the Dao.\n\nTo nurture and rear,\nto foster and grow,\nto benefit all without distinction,\nand to unite with heaven and earth—\nthis is virtue.\n\nTo be above without boasting of merit,\nto be below without shame in hardship,\nnot arrogant in greatness,\nnot negligent in smallness,\nto love universally without partiality,\nand to endure without decline—\nthis is benevolence.\n\nTo support the weak when above,\nto uphold integrity when below,\nto be unrestrained when successful,\nto remain steadfast when impoverished,\nto follow the principle in uniformity,\nand not to bend or distort for private ends—\nthis is righteousness.\n\nTo be reverent and solemn when above,\nto be humble and respectful when below,\nto yield and remain gentle,\nto be the female of all under heaven,\nto stand in non-daring,\nand to establish in non-ability—\nthis is ritual.\n\nThus, cultivating the Dao leads the below to submit and serve;\ncultivating virtue leads the below to follow commands;\ncultivating benevolence leads the below to not contend;\ncultivating righteousness leads the below to be just and upright;\ncultivating ritual leads the below to revere and respect.\nWhen all five are cultivated,\nthe state and household are at peace.\n\nAll the scholars of the present age\nwho are keen, perceptive, and discerning,\nyet draw near to death,\ndo so because they delight in discussing others’ faults.\nThose who are broadly learned, eloquent, and grand,\nyet endanger themselves,\ndo so because they delight in exposing others’ evils.\n\nAs for those who model heaven and emulate earth,\nwhose kindness extends to the moving and growing,\nwho forget and do not cling—\nthey are in accord with the Great Dao.\n\nThus it is said:\nProfound practice is called Dao and virtue;\nshallow practice is called benevolence and righteousness;\nsuperficial practice is called ritual and music.\nFrom this perspective,\nit is better to embrace the Dao and hold to virtue,\nnaturally pure and unadorned.\n\nThe Venerable Lord said to Lingyangzi:\n“Previously, I expounded with the Gatekeeper Yin Xi\nthe wondrous and essential explanations in a million words,\nthe *Nine Chapters of the Void and White*.\nThe void and the white—\nthis is my dwelling.\nThe clear and the pure—\nthis is my abode.”\n\nNon-action and spontaneity—this is my essence.\nSimplicity and unity—this is my name.\nHarmony without form—this is my function.\nResponsive transformation without end—this is my change.\n\nSpontaneity is the truth of the Dao.\nNon-action is the constancy of the Dao.\nVacuity and nothingness are the honor of virtue.\nSerenity and stillness are the palace of virtue.\nSilence and tranquility are the spring of virtue.\nPurity and clarity are the neighbors of spirit.\nSincerity and integrity are the gate of spirit.\nEquilibrium and harmony are the source of all affairs.\n\nWhen humans practice the Dao, those who can be spontaneous—thus the Dao may be attained and penetrated.\nThose who can practice non-action—thus life may be attained and prolonged.\nThose who can embody vacuity and nothingness—thus qi may be attained and circulated.\nThose who can abide in serenity—thus the will may be attained and shared.\nThose who can dwell in silence—thus sound may be attained and dissolved.\nThose who can maintain purity—thus spirit may be attained and radiant.\nThose who can uphold sincerity—thus the will may be attained and followed.\nThose who can preserve equilibrium—thus transformation may be attained and obeyed.\n\nTherefore, when ordinary people practice the Dao, they should:\nWith spontaneity establish their name,\nWith non-action nurture their form,\nWith vacuity and nothingness nourish their spirit,\nWith serenity preserve their will,\nWith silence cultivate their body,\nWith purity pacify their heart,\nWith sincerity guard their will,\nWith equilibrium preserve their spirit.\n\nTo settle the heart and roam the will—let it be like great waters naturally still.\nTo dwell in seclusion and quietude—let it be like the hidden dragon’s retreat.\nTo embrace emptiness without constraint—let it be like the bellows drawing in the void.\nTo transform and preserve spirit—let it be like the altars safeguarding their merit.\nTo establish honor and abide in spirit—let it be like ancestral temples upholding benevolence.\nTo make none see me—like the great fish dwelling in vast waters.\nTo make none know me—like the sun rising without east.\nTo make my life endless—like the boundless Great Dao.\n\nThe mutual attraction of the Dao is like:\nLofty mountains and vast marshes naturally drawing beasts and wolves,\nDeep forests and giant trees naturally drawing birds and insects,\nRivers, seas, lakes, and ponds naturally drawing fish, turtles, and dragons,\nVirtue in fullness and great peace naturally drawing qilin and phoenixes,\nSincerity and purity naturally drawing jade maidens and magic herbs,\nEquilibrium and auspicious response naturally drawing virtuous omens and blessings,\nCalamities and evil deeds naturally drawing misfortune and disaster.\n\nPeople often depart from the Dao—it is not the Dao that departs from people.\nPeople often lose life—it is not life that loses people.\nIf only the Dao and life could preserve each other,\nLife and the Dao could guard each other,\nAnd the two would never part—then one could attain longevity.\n\nAmong all that has form, humans are the most numinous.\nThough their heavenly nature is the same, their cultivation differs.\nWhy? Those who practice goodness gradually assume the bearing of perfected beings,\nWhile those who engage in evil transform into malevolent spirits.\nThus the Venerable Lord pitied them and commanded them to study the Dao.\n\nThe Dao of self-cultivation is the treasure of the state—\nIt must be cherished, it must be honored.\n\nThe root of the human body has three aspects:\nFirst is spirit, second is essence, third is qi.\nThese three originate from the qi of heaven and earth.\nSpirit is received from heaven,\nEssence is received from earth,\nQi is received from equilibrium.\nTogether they form the one Dao.\n\nThus spirit is the chariot of form,\nQi is the carriage of spirit,\nEssence dwells within.\nThe three assist each other in governance.\n\nThose who desire longevity must love qi, honor spirit, and value essence.\nFor qi is born of essence,\nEssence is born of spirit,\nSpirit is born of clarity.\nHumans are fundamentally the qi of yin and yang—\nQi transforms into essence,\nEssence transforms into spirit,\nSpirit transforms into clarity.\n\nTherefore, those who do not wish to age should focus on guarding the primordial qi and uniting with essence,\nSo that it does not leave the body, but unites as one.\nThen vitality will naturally appear,\nThe body will grow lighter,\nThe will will become refined—\nThis is the spirit-light about to arise.\nThe heart will be greatly at peace,\nJoyful as if delighted.\n\nIf one closes the eyes and lies down,\nDirecting the will inward,\nNot letting the inner intent stray—\nThen the body will refine and the form will transform.\nThus the true principle is attained,\nAnd great peace naturally responds.\n\nWondrous is this Dao!\nSpirit is the ruler,\nEssence is the minister,\nQi is the people.\n\nThus the Dao of self-cultivation:\nPacify the spirit and nourish qi,\nDo not indulge in joy or anger.\nIf one can master this,\nQi will naturally strengthen,\nThe will will naturally be fulfilled,\nAll evil will depart,\nAll illnesses will vanish,\nLight will naturally appear,\nGood spirits will naturally respond.\n\nThus it is said:\nThe Great Dao is smooth and broad, not far from the body.\n\nThe first initial fruit among practitioners:\nThe nine transformations of immortal conduct.\nFirst: follow goodness,\nSecond: block evil,\nThird: broadly give life and aid beings,\nFourth: encourage and assist the good,\nFifth: distribute wealth and resources,\nSixth: vow to benefit others,\nSeventh: be physically kind, not harming beings,\nEighth: be verbally kind, not harming beings with speech,\nNinth: be mentally kind, constantly contemplating goodness.\nAlways practice these nine deeds—none may be lacking.\n\nHere ends the *Supreme Cavernous Numinous Treasure Scripture of the Six Fasts and Ten Upright Sacred Records*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞玄灵宝太上六斋十直圣纪经 经名：洞玄灵宝太上六齐十直圣纪经。 撰人不详，约出於隋唐。 言齐戒日期及齐法。 一卷。 底本出处：《正统道藏》正一部。 洞玄灵宝太上六斋十直圣纪经 道教五戒 一者不得杀生，二者不得嗜酒，三者不得口是心非，四者不得偷盗，五者不得淫色。 十善 一念孝顺父母。 二念忠事君师。 三念慈心万物。 四念忍性容非。 五念谏争解恶。 六念损己救穷。 七念放生养物，种诸果林。 八念道边舍井，种树立桥。 九念为人兴利除害，教化未悟。 十念读三宝经律，恒奉香花供养之具。 凡人常行此五诚十善，但有天人善神卫之，永灭灾殃，长臻福佑，唯在坚志。 年六斋 正月、三月、五月、七月、九月、十一月。 月十斋 一日、北斗下。 八日、北斗司杀鬼下。 十四日、太一使者下。 十五日、天帝及三官俱下。 十八日、太一下。 二十三日、太一八神使者下。 二十四日、北辰下。 二十八日、下太一下。 二十九日、中太一下。 三十日。 上太一下。 自下中上三太一下日，皆天地水一切尊神俱下，周行天下，伺人善恶。 甲子日，太一简阅神只。 庚申日，伏尸言人罪过。 本命日，计人功行。 八节日，有八神记人善恶。 三元日。 天地水三官校人之罪福。 三会日 正月七日、举迁赏会。 七月七日、庆生中会。 十月五日。 建生大会。 五腊日 正月一日、名天腊。 五月五日、名地腊。 七月七日、名道德腊。 十月一日、名民岁腊。 十二月腊日。 名侯王腊。 三会日，三官考核功过，宜受符箓，斋戒呈章以祈景福。 五腊日，常当祠献先亡，名为孝子，得福无量。 余日，皆是淫祀。 通前三元日，为八解日，皆可设净供求福焉。 夫斋直之法，要在乎绝甘肥荤辛酒色，阴贼嫉妬妄想，一切诸恶。 唯宜烧香然灯，诵经礼忏，愿诸一切普免灾厄，乃为斋矣。 昔孔子谓老子曰：丘居贫，唯不饮酒、不茹荤久矣。 老子曰：是祭祀之斋也。 汝一志，无以耳听，而以心听，无以心听，而以气听，疏瀹汝心，澡雪汝精神，掊击汝智，吾将语汝。 论曰：按诸经斋法，略有三重。 一者设供斋，可以积德解愆。 二者节食斋，可以和神保寿，斯谓祭祀斋，中士所行也。 三者心斋，谓疏瀹其心，除嗜欲也。 澡雪精神，去秽累也。 掊击其智，绝思虑也。 夫无思无虑则专道，无嗜无欲则乐道，无秽无累则合道。 既心无二想，故曰一志焉。 盖上士所行也。 详夫斋者，齐也。 要以齐整三业，乃为斋矣。 若空守节食，既心识未齐，又唯在一志，则口无贪味。 谓兹二法，表裹相资。 故《大戒经》云：夷心静嘿，专想不二，过中不味，内外清虚是也。 孔子虽薄闲节食，未解调心，故示兹斋法，令其受道。 而末学之徒，孰能虚心一志哉。 夫鄙乎祭祀之教，自谓得心斋理，盖唝嗃怠慢之夫矣。 虽口谭玄寂，无解其目，是自矜焉。 《易》云：圣人以此斋戒。 人生各有岁月日时，随其所属星宿，以定贫富贵贱、性命长短焉。 然六家之物，有合则有散，有生则有死，有成则有败，有盛则有衰，此天下之恒数，自然之对也。 五色者，陷目之锥也。 五音者，塞耳之锤也。 五味者，截舌之斧也。 财货者，乱人之物也。 故祸莫大於死，福莫大於生。 是以有名之名，丧我之橐。",
      "translated_text": "**The Supreme Numinous Treasure Scripture of the Six Fasts and Ten Upright Days of the Cavernous Mystery**\n\n**Scripture Title:** *The Supreme Numinous Treasure Scripture of the Six Fasts and Ten Upright Days of the Cavernous Mystery*\nAuthor unknown, approximately composed during the Sui or Tang dynasties. Discusses the dates of fasts and the methods of fasting. One scroll.\nSource text: *Daoist Canon of the Orthodox Tradition*, Section Zheng Yi.\n\n---\n\n### **The Five Precepts of Daoism**\n1. Refrain from taking life.\n2. Refrain from indulging in alcohol.\n3. Refrain from duplicity—speaking one thing while thinking another.\n4. Refrain from theft.\n5. Refrain from lust and lewdness.\n\n### **The Ten Virtues**\n1. Constantly hold filial piety toward parents in mind.\n2. Constantly hold loyalty to ruler and teacher in mind.\n3. Constantly hold compassion for all beings in mind.\n4. Constantly hold forbearance and tolerance for wrongs in mind.\n5. Constantly hold admonition and opposition to evil in mind.\n6. Constantly hold self-sacrifice to aid the destitute in mind.\n7. Constantly hold the liberation of living beings and the nurturing of creatures in mind, planting fruit groves.\n8. Constantly hold the digging of wells by roadsides and the planting of trees and building of bridges in mind.\n9. Constantly hold the promotion of benefit and elimination of harm for others in mind, teaching and enlightening the unenlightened.\n10. Constantly hold the recitation of the scriptures and precepts of the Three Treasures in mind, perpetually offering incense, flowers, and ritual implements.\n\nThose who perpetually practice these Five Sincerities and Ten Virtues shall be guarded by celestial and numinous spirits, forever dispelling calamities and perpetually attaining blessings and protection—this lies solely in unwavering resolve.\n\n### **The Six Annual Fasts**\nThe first, third, fifth, seventh, ninth, and eleventh months.\n\n### **The Ten Monthly Fasts**\n1. The first day: when the Northern Dipper descends.\n2. The eighth day: when the Northern Dipper’s Deity of Slaying Spirits descends.\n3. The fourteenth day: when the Messenger of the Great One descends.\n4. The fifteenth day: when the Heavenly Thearch and the Three Officials descend together.\n5. The eighteenth day: when the Great One descends.\n6. The twenty-third day: when the Eight Divine Messengers of the Great One descend.\n7. The twenty-fourth day: when the Northern Asterism descends.\n8. The twenty-eighth day: when the Lower Great One descends.\n9. The twenty-ninth day: when the Middle Great One descends.\n10. The thirtieth day: when the Upper Great One descends.\n\nOn the days of the Lower, Middle, and Upper Great Ones, all the honored deities of Heaven, Earth, and Water descend together, traversing the world to observe the good and evil of humanity.\n\n- On *jiǎzǐ* days, the Great One reviews the records of spirits.\n- On *gēngshēn* days, the Crouching Corpse reports human transgressions.\n- On one’s *bĕnmìng* (natal) day, one’s merits and conduct are calculated.\n- On the Eight Seasonal Nodes, eight spirits record human good and evil.\n- On the Three Primordial Days, the Three Officials of Heaven, Earth, and Water examine human transgressions and blessings.\n\n### **The Three Assembly Days**\n1. The seventh day of the first month: the Assembly of Promotion and Reward.\n2. The seventh day of the seventh month: the Assembly of Celebrating Life.\n3. The fifth day of the tenth month: the Grand Assembly of Establishing Life.\n\nOn the Three Assembly Days, the Three Officials assess merits and transgressions; it is fitting to receive talismans and registers, observe fasts, and present memorials to pray for abundant blessings.\n\n### **The Five La Days**\n1. The first day of the first month: *Tiān Là* (Celestial La).\n2. The fifth day of the fifth month: *Dì Là* (Earthly La).\n3. The seventh day of the seventh month: *Dàodé Là* (Dao-Virtue La).\n4. The first day of the tenth month: *Mínsuì Là* (People’s Year La).\n5. The La day of the twelfth month: *Hóuwáng Là* (Marquis-King La).\n\nOn the Five La Days, one should always make offerings to ancestral spirits, thereby becoming a filial child and attaining boundless blessings. All other days are considered excessive or improper sacrifices.\n\nTogether with the Three Primordial Days, these form the Eight Liberation Days, on which one may set up pure offerings to seek blessings.\n\n### **The Method of Fasting and Upright Conduct**\nThe essentials lie in abstaining from rich flavors, meat, pungent foods, alcohol, and lust; eliminating malice, jealousy, and delusive thoughts; and refraining from all evils. One should only burn incense, light lamps, recite scriptures, perform repentance rites, and pray for the universal deliverance of all from disasters and misfortunes—this constitutes fasting.\n\nFormerly, Confucius said to Laozi: “I, Qiu, live in poverty and have long abstained from alcohol and meat.”\nLaozi replied: “This is the fast of sacrificial offerings. You must unify your will: do not listen with your ears but with your mind; do not listen with your mind but with your *qi*. Purify your mind, cleanse your spirit, and shatter your intellect—I shall then speak to you.”\n\n### **Discourse**\nAccording to the fasting methods in various scriptures, there are roughly three levels:\n1. **Offering Fast**: By which one accumulates virtue and resolves transgressions.\n2. **Abstention Fast**: By which one harmonizes the spirit and preserves longevity. This is the sacrificial fast, practiced by those of middling capacity.\n3. **Mind Fast**: This entails purifying the mind and eliminating desires, cleansing the spirit and removing defilements, shattering one’s intellect and cutting off thoughts. Without thought or worry, one focuses solely on the Dao; without craving or desire, one delights in the Dao; without defilement or encumbrance, one unites with the Dao. Since the mind harbors no dualistic thoughts, it is called “unified will.” This is practiced by those of superior capacity.\n\nIn essence, “fasting” (*zhāi*) means “to align” (*qí*). The essentials lie in aligning and rectifying the Three Karmas—only then does it constitute fasting. If one merely observes dietary abstention while the mind remains unaligned, or if one merely unifies the will, then the mouth will not crave flavors. These two methods—outer and inner—mutually support one another. Thus, the *Scripture of the Great Precepts* states: “Calm the mind and still the breath, focus on single-mindedness without duality; do not eat after noon; maintain inner and outer purity and emptiness.”\n\nThough Confucius was skilled in dietary abstention, he had not yet mastered the regulation of the mind. Therefore, this fasting method was shown to him so that he might receive the Dao. Yet how many of the later learners can truly empty their minds and unify their wills? Those who vulgarize the teachings of sacrificial fasting, claiming to have grasped the principles of the Mind Fast, are merely arrogant and indolent. Though they may speak of mystery and quiescence, their eyes reveal no understanding—they merely pride themselves.\n\nThe *Book of Changes* states: “The sage uses this for fasting and vigilance.”\n\nEach person is born with a specific year, month, day, and hour, determined by their corresponding constellation, which defines their poverty or wealth, nobility or baseness, lifespan, and fate. Yet the six kinds of possessions—gathering and scattering, life and death, success and failure, flourishing and decline—are the eternal patterns of the world, the natural oppositions of the cosmos.\n\nThe five colors are awls that pierce the eyes.\nThe five tones are hammers that deafen the ears.\nThe five flavors are axes that sever the tongue.\nWealth and goods are things that confuse people.\n\nThus, no misfortune is greater than death, and no blessing is greater than life. Therefore, the fame that is sought is the sack that buries the self.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1281,
      "start_sentence": 0,
      "end_sentence": 89,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.911486864089966,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝太上六斋十直圣纪经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "无名之名，养我之宅。 有货之货，丧我之贼。 无货之货，养我之福。 罪莫大於淫，祸莫大於贪，咎莫大於僭，此三者祸之车也。 小则亡身，大则亡家。 营生养性，载神扶命，则离苦升乐，福庆流延矣。 人之生也，皆由於神，神镇则生，神断则死，故勤心积感，则能举形上升玄宫矣。 夫人唯知丰肴以甘其口，爵禄以荣其身，而不顾甘口之食，是伤命之斧，爵禄奢丽，刑对天下之怨矣。 元君曰：道者，灵通之至真。 术者，变化之玄技也。 形之无形，因术以济人。 人之有灵，因修而会道。 人能学之，则变化自然矣。 夫道之要者，在乎探简而易攻也。 卫之秘者，唯符药炁也。 符者，三光之灵文，天之真信也。 药者，五行之华英，地之精液也。 炁者，阴阳之和炁，万物之灵爽也。 尔虽得一事未毕，要资符药道乃讫。 药能炼形，符能致神。 夫人爱其身，天地莫能害也。 守其志，天下莫能败也。 安其贫，天下莫能富也。 乐其贱，天下莫能贵也。 未有敬焉而无不敬，未有让焉而无不让，未有矜焉而无不矜，未有惠焉而无不惠也。 守直以曲，守白以辱，守辩以讷，守巧以拙，以无伐为盈，以无知为贵，以爱宠为惊。 非无患之地则不蹈，故百祸不能罹也。 非夷易之涂则不由，故险阻不能危也。 不以禄位秽其志，故刑罚不能加也。 不以毁誉为喜怒，故谤讟不能随也。 百祸不能罹，是以总万物之要也。 险阻不能危，是以保永安之祚也。 刑罚不能加，是以充其寿考之年也。 谤讟不能随，是以完其纯粹之真也。 人能虚无清净，慈惠忠信，孝敬和顺，谦勤俭柔淳素，则与道同也。 故以道理之於身，则心达志通，重神爱气，轻物贱名，思虑不惑，血气和平，筋骨便利，耳目聪明，肌肤润泽，面有光荣，精神专固，身体轻强，虚实相从，鬓发润光。 理之於家，则父慈子孝，夫信妇贞，兄良弟顺，九族和睦，耕桑时丰，仓禀积蔚，六畜蕃殖，事业修理，常有余矣。 故君臣有道，即忠惠。 父子有道，则慈惠。 士庶有道，则相爱。 故有道则和，无道则乖。 由此观之，道之於人，不可须臾而去矣。 文子问老子曰：何谓道德仁义礼邪。 老子曰：无形无为，内以修身，外以理人，功成事立，与天为邻，道也。 畜之养之，遂之长之，兼利无择，与天地合，德也。 为上不矜其功，为下不羞其病，於大不矜，於小不偷，兼爱无私，久而不衰，仁也。 为上辅弱，为下守节，达不肆意，穷不易操，一度顺理，不私枉挠，义也。 为上恭严，为下卑敬，退让守柔，为天下雌，立於不敢，设於不能，礼也。 故修道即下归服，修德即下从令，修仁即下不争，修义即下平正，修礼即下尊敬。 五者皆修，即国家安宁。 凡当代之士，聪明深察，而近於死者，好议人之罪也。 博辩闳大，而危其身者，好发人之恶也。 若夫法天象地，恩及动植，忘而不持，乃合大道焉。 故曰：深行之为道德，浅行之为仁义，薄行之为礼乐也。 由是观之，不若怀道抱德，自然淳朴矣。 老君谓陵阳子曰：吾前与关令尹喜妙真要解百万言，虚白九章。 虚而白者，吾宅也。 清而净者，吾舍也。",
      "translated_text": "The nameless name is the dwelling that nurtures me.\nThe coveted wealth is the thief that destroys me.\nThe wealth that is not coveted is the blessing that nurtures me.\n\nNo sin is greater than lust,\nno misfortune greater than greed,\nno fault greater than transgression—\nthese three are the chariot of calamity.\nIn small measure, they ruin the self;\nin great measure, they ruin the household.\n\nTo cultivate life and nourish nature,\nto bear the spirit and uphold destiny,\nis to depart from suffering and ascend to joy,\nwhere blessings and felicity flow endlessly.\n\nHuman life arises from the spirit:\nwhen the spirit abides, life endures;\nwhen the spirit severs, death follows.\nThus, diligent devotion and accumulated sincerity\ncan lift the form to ascend to the Mystic Palace.\n\nPeople only know to indulge in rich delicacies to please the mouth,\nto seek ranks and emoluments to glorify the self,\nyet do not consider that the food that pleases the mouth\nis the axe that severs life,\nand that extravagant ranks and luxuries\nprovoke the resentment of all under heaven.\n\nThe Perfected Lord says:\nThe Dao is the utmost truth of numinous penetration.\nTechnique is the mysterious art of transformation.\nFrom form to the formless,\none relies on technique to aid others.\nHuman beings possess numinosity,\nand through cultivation, they unite with the Dao.\nIf one can study this,\ntransformation arises naturally.\n\nThe essence of the Dao\nlies in its simplicity and ease of practice.\nThe secrets of its defense\nreside in talismans, medicines, and qi.\nTalismans are the numinous script of the Three Luminaries,\nthe true pledge of heaven.\nMedicines are the blossoms and essences of the Five Phases,\nthe refined essence of earth.\nQi is the harmonious qi of yin and yang,\nthe numinous vitality of the myriad things.\nThough you may master one aspect,\nyou must still rely on talismans, medicines, and the Dao to complete it.\nMedicine refines the form;\ntalismans summon the spirit.\n\nOne who cherishes the self\ncannot be harmed even by heaven and earth.\nOne who guards their resolve\ncannot be defeated even by all under heaven.\nOne who is content in poverty\ncannot be enriched even by all under heaven.\nOne who delights in lowliness\ncannot be ennobled even by all under heaven.\n\nNever has there been reverence without all things revering,\nnever humility without all things yielding,\nnever pride without all things esteeming,\nnever kindness without all things bestowing kindness.\n\nGuard straightness with crookedness,\nwhiteness with disgrace,\neloquence with simplicity,\nskill with clumsiness.\nTake non-boasting as fulfillment,\nnon-knowing as nobility,\nlove and favor as alarm.\n\nDo not tread where there is no ground for safety,\nand thus the hundred misfortunes cannot befall you.\nDo not follow treacherous or uneven paths,\nand thus peril and obstruction cannot endanger you.\nDo not defile your resolve with emoluments and rank,\nand thus punishments cannot be imposed upon you.\nDo not take slander and praise as joy or anger,\nand thus vilification cannot follow you.\n\nThe hundred misfortunes cannot befall you—\nthus you grasp the essence of the myriad things.\nPeril and obstruction cannot endanger you—\nthus you preserve the blessing of eternal peace.\nPunishments cannot be imposed upon you—\nthus you fulfill the years of a long life.\nVilification cannot follow you—\nthus you perfect your pure and unadulterated truth.\n\nIf one can be empty, tranquil, and pure,\ncompassionate, kind, loyal, and trustworthy,\nfilial, respectful, harmonious, and compliant,\nhumble, diligent, frugal, gentle, sincere, and plain,\nthen one is in accord with the Dao.\n\nThus, when the Dao is applied to the self,\nthe mind is enlightened and the will is unobstructed.\nOne values the spirit and cherishes qi,\ndisdains things and scorns fame.\nThoughts are not confused,\nblood and qi are harmonious,\nsinews and bones are nimble,\nears and eyes are keen,\nskin and flesh are moist and lustrous,\nthe face radiates glory,\nthe spirit is focused and steadfast,\nthe body is light and strong,\nthe void and the full follow one another,\nand the temples are lustrous.\n\nWhen the Dao is applied to the household,\nfathers are kind and children filial,\nhusbands trustworthy and wives chaste,\nelder brothers good and younger brothers compliant,\nthe nine clans harmonious.\nFarming and sericulture are timely and abundant,\ngranaries and storehouses are amply stocked,\nthe six livestock multiply,\nand undertakings are well-ordered—\nthere is always surplus.\n\nThus, when ruler and minister follow the Dao, there is loyalty and kindness.\nWhen father and child follow the Dao, there is benevolence and kindness.\nWhen scholar and commoner follow the Dao, there is mutual love.\nWhere there is the Dao, there is harmony;\nwhere there is no Dao, there is discord.\nFrom this, we see that the Dao\ncannot be departed from even for a moment.\n\nWenzi asked Laozi:\n“What are the Dao, virtue, benevolence, righteousness, and ritual?”\n\nLaozi said:\nTo be formless and non-active,\nto cultivate the self within\nand govern others without,\nto accomplish works and establish affairs,\nand to neighbor with heaven—\nthis is the Dao.\n\nTo nurture and rear,\nto foster and grow,\nto benefit all without distinction,\nand to unite with heaven and earth—\nthis is virtue.\n\nTo be above without boasting of merit,\nto be below without shame in hardship,\nnot arrogant in greatness,\nnot negligent in smallness,\nto love universally without partiality,\nand to endure without decline—\nthis is benevolence.\n\nTo support the weak when above,\nto uphold integrity when below,\nto be unrestrained when successful,\nto remain steadfast when impoverished,\nto follow the principle in uniformity,\nand not to bend or distort for private ends—\nthis is righteousness.\n\nTo be reverent and solemn when above,\nto be humble and respectful when below,\nto yield and remain gentle,\nto be the female of all under heaven,\nto stand in non-daring,\nand to establish in non-ability—\nthis is ritual.\n\nThus, cultivating the Dao leads the below to submit and serve;\ncultivating virtue leads the below to follow commands;\ncultivating benevolence leads the below to not contend;\ncultivating righteousness leads the below to be just and upright;\ncultivating ritual leads the below to revere and respect.\nWhen all five are cultivated,\nthe state and household are at peace.\n\nAll the scholars of the present age\nwho are keen, perceptive, and discerning,\nyet draw near to death,\ndo so because they delight in discussing others’ faults.\nThose who are broadly learned, eloquent, and grand,\nyet endanger themselves,\ndo so because they delight in exposing others’ evils.\n\nAs for those who model heaven and emulate earth,\nwhose kindness extends to the moving and growing,\nwho forget and do not cling—\nthey are in accord with the Great Dao.\n\nThus it is said:\nProfound practice is called Dao and virtue;\nshallow practice is called benevolence and righteousness;\nsuperficial practice is called ritual and music.\nFrom this perspective,\nit is better to embrace the Dao and hold to virtue,\nnaturally pure and unadorned.\n\nThe Venerable Lord said to Lingyangzi:\n“Previously, I expounded with the Gatekeeper Yin Xi\nthe wondrous and essential explanations in a million words,\nthe *Nine Chapters of the Void and White*.\nThe void and the white—\nthis is my dwelling.\nThe clear and the pure—\nthis is my abode.”",
      "overlap_context": "and scattering, life and death, success and failure, flourishing and decline—are the eternal patterns of the world, the natural oppositions of the cosmos.\n\nThe five colors are awls that pierce the eyes.\nThe five tones are hammers that deafen the ears.\nThe five flavors are axes that sever the tongue.\nWealth and goods are things that confuse people.\n\nThus, no misfortune is greater than death, and no blessing is greater than life. Therefore, the fame that is sought is the sack that buries the self.",
      "start_char": 1281,
      "end_char": 2459,
      "start_sentence": 90,
      "end_sentence": 147,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.516541481018066,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝太上六斋十直圣纪经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "无为自然者，吾素也。 易而为一者，吾号也。 和而无体者，吾用也。 应化无穷者，吾变也。 夫自然者，道之真也。 无为者，道之常也。 虚无者，德之尊也。 淡泊者，德之宫也。 静嘿者，德之泉也。 清净者，神之邻也。 精诚者，神之门也。 中和者，事之原也。 人为道，能自然者，故道可得而通也。 能无为者，故生可得而长也。 能虚无者，故气可得而行也。 能淡泊者，故志可得而共也。 能静嘿者，故声可得而灭也。 能清净者，故神可得而光也。 能精诚者，故志可得而从也。 能中和者，故化可得而从也。 是故凡人为道，当以自然成其名，以无为养其形，以虚无而养其神，以淡泊而存其志，以静嘿而养其身，以清净而平其心，以精诚而守其志，以中和而存其神矣。 夫安心游志，使若大水之自澹也。 深居靖处，使若蛟龙之潜藏也。 怀虚不屈，使若橐钥之挹空也。 化得存神，使若社稷之保功也。 立尊居神，使若宗庙之守仁也。 使不我见，若巨鱼之居大水也。 使人莫我知，若日出而无东也。 使我生无穷，若大道之无方也。 道之相致，譬如高山大泽之自致禽兽豺狼也，若深林巨木之自致飞鸟百虫也，若江海湖池之自致鱼龞蛟龙也，若盛德太平之自致麒麟凤凰也，若精诚洁白之自致玉女芝英也，若中和嘉应之自致德瑞吉祥也，若灾异恶行之自致妖孽殃祸也。 夫人常去道，非道去人。 人常失生，非生失人。 若使道与生相保，生与道相守，二者不相离，乃能得长久。 夫有形之内，人为最灵，天性虽同，因修各异，何者。 以之习善，即渐成真人之风，用之涉恶，即转为凶卒。 故老君哀之，令其学道。 夫修身之道，乃国之宝也。 不可不爱，不可不贵也。 然一身之根有三。 一为神，二为精，三为气也。 此三者，本天地之气也。 神者，受於天。 精者，受於地。 气者，受於中和也。 相与共为一道也。 故神者，形乃乘也。 气者，神之舆也。 精者，居其中也。 三者相助为理。 夫人欲寿者，乃当爱气尊神重精也。 故气生於精，精生於神，神生於明，人本为阴阳之气，气转为精，精转为神，神转生明。 是故不欲老者，当念守元气而合精者也。 令不去其形，合而为一也。 即淋淋自见，身益轻，意欲精也。 此神光欲生也。 心中大安，欣欣若喜也。 若冥目卧，着志意於身内，内意不出，则身炼形变也。 如此则真理已得，太平自应矣。 神哉此道。 神者，君也。 精者，臣也。 气者，人也。 故修身之道，安神养气，不欲其喜怒，若能制之，气自强也，意自得也，百邪自去，众病自消，光明自见，善神自应也。 故曰：大道坦坦，去身不远。 第一初果，行人之中，九转仙行。 一者可从於善，二者闭塞於恶，三者广生济物，四者劝助良善，五者布施财力，六者大愿利人，七者身慈，不害於物； 八者口慈，言不害物； 九者心慈，常念於善。 常行九行，一不可阙。 太上洞玄灵宝六斋十直圣纪经竟",
      "translated_text": "Non-action and spontaneity—this is my essence.\nSimplicity and unity—this is my name.\nHarmony without form—this is my function.\nResponsive transformation without end—this is my change.\n\nSpontaneity is the truth of the Dao.\nNon-action is the constancy of the Dao.\nVacuity and nothingness are the honor of virtue.\nSerenity and stillness are the palace of virtue.\nSilence and tranquility are the spring of virtue.\nPurity and clarity are the neighbors of spirit.\nSincerity and integrity are the gate of spirit.\nEquilibrium and harmony are the source of all affairs.\n\nWhen humans practice the Dao, those who can be spontaneous—thus the Dao may be attained and penetrated.\nThose who can practice non-action—thus life may be attained and prolonged.\nThose who can embody vacuity and nothingness—thus qi may be attained and circulated.\nThose who can abide in serenity—thus the will may be attained and shared.\nThose who can dwell in silence—thus sound may be attained and dissolved.\nThose who can maintain purity—thus spirit may be attained and radiant.\nThose who can uphold sincerity—thus the will may be attained and followed.\nThose who can preserve equilibrium—thus transformation may be attained and obeyed.\n\nTherefore, when ordinary people practice the Dao, they should:\nWith spontaneity establish their name,\nWith non-action nurture their form,\nWith vacuity and nothingness nourish their spirit,\nWith serenity preserve their will,\nWith silence cultivate their body,\nWith purity pacify their heart,\nWith sincerity guard their will,\nWith equilibrium preserve their spirit.\n\nTo settle the heart and roam the will—let it be like great waters naturally still.\nTo dwell in seclusion and quietude—let it be like the hidden dragon’s retreat.\nTo embrace emptiness without constraint—let it be like the bellows drawing in the void.\nTo transform and preserve spirit—let it be like the altars safeguarding their merit.\nTo establish honor and abide in spirit—let it be like ancestral temples upholding benevolence.\nTo make none see me—like the great fish dwelling in vast waters.\nTo make none know me—like the sun rising without east.\nTo make my life endless—like the boundless Great Dao.\n\nThe mutual attraction of the Dao is like:\nLofty mountains and vast marshes naturally drawing beasts and wolves,\nDeep forests and giant trees naturally drawing birds and insects,\nRivers, seas, lakes, and ponds naturally drawing fish, turtles, and dragons,\nVirtue in fullness and great peace naturally drawing qilin and phoenixes,\nSincerity and purity naturally drawing jade maidens and magic herbs,\nEquilibrium and auspicious response naturally drawing virtuous omens and blessings,\nCalamities and evil deeds naturally drawing misfortune and disaster.\n\nPeople often depart from the Dao—it is not the Dao that departs from people.\nPeople often lose life—it is not life that loses people.\nIf only the Dao and life could preserve each other,\nLife and the Dao could guard each other,\nAnd the two would never part—then one could attain longevity.\n\nAmong all that has form, humans are the most numinous.\nThough their heavenly nature is the same, their cultivation differs.\nWhy? Those who practice goodness gradually assume the bearing of perfected beings,\nWhile those who engage in evil transform into malevolent spirits.\nThus the Venerable Lord pitied them and commanded them to study the Dao.\n\nThe Dao of self-cultivation is the treasure of the state—\nIt must be cherished, it must be honored.\n\nThe root of the human body has three aspects:\nFirst is spirit, second is essence, third is qi.\nThese three originate from the qi of heaven and earth.\nSpirit is received from heaven,\nEssence is received from earth,\nQi is received from equilibrium.\nTogether they form the one Dao.\n\nThus spirit is the chariot of form,\nQi is the carriage of spirit,\nEssence dwells within.\nThe three assist each other in governance.\n\nThose who desire longevity must love qi, honor spirit, and value essence.\nFor qi is born of essence,\nEssence is born of spirit,\nSpirit is born of clarity.\nHumans are fundamentally the qi of yin and yang—\nQi transforms into essence,\nEssence transforms into spirit,\nSpirit transforms into clarity.\n\nTherefore, those who do not wish to age should focus on guarding the primordial qi and uniting with essence,\nSo that it does not leave the body, but unites as one.\nThen vitality will naturally appear,\nThe body will grow lighter,\nThe will will become refined—\nThis is the spirit-light about to arise.\nThe heart will be greatly at peace,\nJoyful as if delighted.\n\nIf one closes the eyes and lies down,\nDirecting the will inward,\nNot letting the inner intent stray—\nThen the body will refine and the form will transform.\nThus the true principle is attained,\nAnd great peace naturally responds.\n\nWondrous is this Dao!\nSpirit is the ruler,\nEssence is the minister,\nQi is the people.\n\nThus the Dao of self-cultivation:\nPacify the spirit and nourish qi,\nDo not indulge in joy or anger.\nIf one can master this,\nQi will naturally strengthen,\nThe will will naturally be fulfilled,\nAll evil will depart,\nAll illnesses will vanish,\nLight will naturally appear,\nGood spirits will naturally respond.\n\nThus it is said:\nThe Great Dao is smooth and broad, not far from the body.\n\nThe first initial fruit among practitioners:\nThe nine transformations of immortal conduct.\nFirst: follow goodness,\nSecond: block evil,\nThird: broadly give life and aid beings,\nFourth: encourage and assist the good,\nFifth: distribute wealth and resources,\nSixth: vow to benefit others,\nSeventh: be physically kind, not harming beings,\nEighth: be verbally kind, not harming beings with speech,\nNinth: be mentally kind, constantly contemplating goodness.\nAlways practice these nine deeds—none may be lacking.\n\nHere ends the *Supreme Cavernous Numinous Treasure Scripture of the Six Fasts and Ten Upright Sacred Records*.",
      "overlap_context": "rtue;\nshallow practice is called benevolence and righteousness;\nsuperficial practice is called ritual and music.\nFrom this perspective,\nit is better to embrace the Dao and hold to virtue,\nnaturally pure and unadorned.\n\nThe Venerable Lord said to Lingyangzi:\n“Previously, I expounded with the Gatekeeper Yin Xi\nthe wondrous and essential explanations in a million words,\nthe *Nine Chapters of the Void and White*.\nThe void and the white—\nthis is my dwelling.\nThe clear and the pure—\nthis is my abode.”",
      "start_char": 2459,
      "end_char": 3561,
      "start_sentence": 148,
      "end_sentence": 217,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.563807487487793,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝太上六斋十直圣纪经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}