{
  "source_id": "洞玄灵宝丹水飞术运度小劫妙经",
  "source_file": "chunked_daozang\\洞玄灵宝丹水飞术运度小劫妙经.json",
  "total_chunks": 8,
  "total_original_chars": 7423,
  "total_translated_chars": 48934,
  "total_translation_time": 255.89463210105896,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝丹水飞术运度小劫妙经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Wondrous Scripture of the Divine Treasure Elixir-Water Flying Technique for Delivering the Minor Kalpa**\n\n**Scripture Title:** *The Wondrous Scripture of the Divine Treasure Elixir-Water Flying Technique for Delivering the Minor Kalpa*. Author unknown, approximately dated to the Northern and Southern Dynasties. Not recorded in the *Catalogue of Divine Treasure Scriptures*. One fascicle. Base text from the *Daoist Canon of the Zhengtong Era*, *Wondrous Section*, *Textual Category*.\n\n---\n\nThe Most High Lord of the Great Dao proclaimed: The Primordial Heavenly Worthy spoke, saying that when the radiance and light of the vast celestial realm exhaust their kalpic destiny, their brilliance shall be without bound, their illumination without depth, and none may abide therein. The sun and moon shall be unable to shine, the constellations unable to mark time; there shall be neither above nor below, no place to rely upon or reach, and their reckoning shall be unfathomable.\n\nThe Dao declared: Without above or below, it pervades and revolves through the cosmic cycles, lightly extending into the boundless, sinking into the profound void. These two share a single designation, their contemplation vast and still; revolving, they return to unity, ultimately merging into the mysterious and perfect. Above, they chime at the absolute summit; below, they enter the minute dust. To the left, they reach the azure vastness; to the right, they flow through the myriad rivers. The canopy of the Great Net spreads forth, the Dipper’s extremity joins the darkness; the Mysterious Capital’s Primordial Lord, in numinous motion, whirls and vanishes. Towering peaks and rocky valleys suddenly dissolve and merge.\n\nHaving cultivated the Six Perfections and dwelt in the dual practice of Brahman conduct, one ascends the celestial passes, where the celestial traces stretch boundlessly, and the root of quiescent emptiness abides. The minor cycle flows and encircles; the kalpic deliverance unfolds the primordial. The myriad heavens revolve, the fiery kalpas converge at their appointed time, and the earthly realms respond in accord, all lightly overturning. The heavens rise without limit into the abyssal origin.\n\nThe heavens are upheld by the *qian*-tree, serving as the net’s guiding principle; the earth is inhabited by humans and birds, dwelling amidst the fiery mists. When the minor kalpa’s destiny arrives, it ascends to the lofty heavens. From the heavens’ revolving deliverance, the Dark Gate is unceasing. Thereupon, the assembled spirits record and inscribe this as the \"Intersection of Heaven and Earth’s Reckoning,\" for the minor kalpa has now converged.\n\nThe Primordial Heavenly Worthy delivered this revolving, intersecting reckoning for thirty-six myriad kalpas, a period termed the \"Minor Celestial Wind’s Deliverance,\" the convergence of the minor kalpa. The Great Heaven encompasses three thousand nine hundred and sixty heavens, enclosing the ten directions’ myriad lesser heavens. Each heaven is governed by Perfected Ones, each with ten directional Perfected Ones. Every three hundred years, they traverse the *qian*-tree and the Human-Bird Mountain, completing what is called the \"Minor Celestial Deliverance’s Convergence with the Minor Kalpa’s Cycle.\"\n\nThe Perfected Ones emerge from the present heaven into the Great Heaven. The Great Heaven endures three thousand nine hundred and sixty great kalpas. When the Radiant Perfected Ones have completed their rites in this heaven, it is termed the \"Cycle of the Minor Kalpa’s Deliverance.\"\n\nThe Primordial spoke to the Radiant Perfected Ones: There are a hundred million Great Heavens, and a hundred million Grotto-Heavens on earth. One heaven endures three hundred sixty myriad kalpas, its years simultaneously exhausting—this is called the Minor Heaven. Within it dwell the Perfected Ones of the Great Grotto Realm.\n\nWhen the cycle of the minor kalpa’s deliverance is complete, they reestablish their standing. The *gang*-asterism’s Five Dippers and the Seven Registers [lacuna] are first formed; the sun and moon shine brightly, and the celestial origin is newly governed. At that time, the Mysterious Deliverance emerges to transform, the scriptural Dao flows in response. The Supreme Numinous Purple Prime Lady emerges from the Numinous Radiance Heaven, accompanied by ten or so female flying celestial beings, seeking the Mysterious Deliverance from afar.\n\nAt that time, he resided upon the Five Marchmounts, suppressing the fiery mists, sweeping away calamities, and subduing all malevolence. The celestial beings, beholding the Mysterious Deliverance, paid homage amidst the Ten Absolute Void Spaces.\n\nThe Lady declared: In the distant past, before the ancient kalpic destiny had converged, the Heavenly Worthy and the Supreme Perfected Ones had already foreseen this. The Mysterious One descended with his teachings, expounding the ancient *Divine Treasure Scripture*’s sections and fascicles, which were concealed within the Great Grotto’s Mysterious Realm. Only those with immortal bones could behold its scriptural text.\n\nLater, there was the Supreme Ultimate Perfected One, who, before attaining the Dao, dwelt amidst the world, wandering mountains to gather herbs. From the age of seven to ninety, he refrained from harming living beings, constantly cultivating the world’s various scriptures. The *Scriptures of the Lao Lord’s Dao and Virtue* were his vocation, and he delved into the subtle and probed the inner mysteries. His spirit and perfection were fully realized; wherever he wandered—be it secluded mountains, deep valleys, dense forests, or precipitous cliffs—he inquired not of the terrain. Later, within the cavern of the Martial Man Mountain, he encountered the Primordial Lord and obtained the traces of the attained Dao: the *Wondrous Scripture of the Eightfold Plain Interwoven True Texts* and the *Wondrous Scripture of the Supreme’s Divine Treasure Minor Kalpa’s Reckoning*.\n\nHe instructed his disciples, saying: You must now receive these teachings so that the reckoning of heaven and earth’s revolutions may converge, and the hundred million cycles exhaust. The Mysterious Deliverance shall descend again. Fearing the great reckoning’s approach, how could one let it pass? The minor kalpa is now manifest.\n\nThe Primordial Heavenly Worthy spoke to the Mysterious Deliverance Perfected One: The reckoning follows the hundred and six, arising in the final kalpa. At that time, those with immortal bones—these men I myself shall instruct in the methods of delivering the body.\n\nDisciples should constantly seek to transcend the fiery calamities and deliver themselves from the perils of the mists. They ought to study the wondrous scriptures of the Three Caverns and establish the *Divine Treasure* purification rites. If dwelling amidst the world, they should erect a lofty dais with a jeweled canopy, floral lamps, and incense implements, paying homage six times daily and partaking of one meal at noon. If one has renounced worldly affairs and dwells in secluded mountains or deep valleys, practicing purification rites in solitude, they should maintain a perpetual fast, swallowing qi and elixir-water, standing or sitting constantly, with the left hand turning toward the Northern Culmen.\n\nOne should say: On such-and-such an auspicious day and hour, I, [Name], firmly establish my field of merit, beseeching the Supreme of the Northern Culmen to deliver my form. Holding the breath, one exhales thrice, practicing this six times daily, and shall thereby attain the Perfected Dao.\n\nWhen the celestial destiny of the minor kalpa converges, the Mysterious Deliverance Perfected One shall deliver them with these nine secret talismans. The Primordial declared: The nine talismans are the Nine Chapters, corresponding to the Supreme’s Nine Strategies. Receiving the *Divine Treasure* and wearing these nine talismanic water-texts—these are the *Wondrous Scripture’s Divine Chapters*. One recites and chants them while wearing them upon the body. The cinnabar-written plain registers and revolving talismans are placed in a pouch and worn, to avert the convergence of the minor kalpa. These are to be kept secret.\n\nThe Primordial Heavenly Worthy expounded the Supreme’s *Wondrous Scripture’s Ninefold Talismanic Chapters*:\n1. The First: Expounding the Supreme’s *Wondrous Scripture Talisman*\n2. The Second: Expounding the Supreme’s *Mysterious Scripture Talisman*\n3. The Third: Expounding the Supreme’s *Numinous Scripture Talisman*\n\nThe Primordial expounded the Supreme’s *Treasure Scripture Talisman* as the Fourth, the Supreme’s *Jade Scripture Talisman* as the Fifth, the Supreme’s *Ninefold Golden Tone Talisman* as the Sixth, the Supreme’s *Thirty-Nine Jade Tone Talismans* as the Seventh, the Supreme’s *Spirit-Generating Scripture Talisman* as the Eighth, and the Supreme’s *Ninefold Transformation Concealment Scripture Talisman* as the Ninth. These secret talismanic texts are the Supreme’s *Cavernous Mystery Concealed Strategies*. Scholars wear them upon the body and constantly chant the ninefold tones, and the true Dao naturally descends.\n\nThe Primordial Heavenly Worthy declared: The Three Simplicities are the Purple Simplicity, the Yellow Simplicity, and the White Simplicity. Now, each becomes a Supreme *Cavernous Mystery Numinous* Perfected One. The Three Simplicities unite to form the Three Perfected Ones, who perpetually govern the present administration.\n\nThe Scripture states: When a *Numinous Treasure* Dharma Master establishes a retreat and dons ritual vestments, the ritual skirt is made of yellow cloth, with inner garments of *Mud-Pellet Silk*. The *Mud-Pellet Silk* is adorned with a horizontal green sash as a mantle, and a yellow silk kerchief. Through cold and heat, this attire remains unchanged as the ritual vestment, and divine boys and jade maidens constantly guard it.\n\nThe Scripture states: For ritual vestments, if one dwells in secluded mountains and forests to establish retreat practices, the skirt, coarse cloth, kerchief, and cloak are all made of deer hide. However, one must not share the retreat with worldly people. If a scholar resides in the world, they must follow the scriptural instructions and not wear mountain-dwelling ritual vestments when venturing among people, nor bring worldly garments into the mountains. Such actions violate the scriptures and breach the precepts. The Great Perfected of the myriad heavens observe one’s demeanor and loss of proper form, becoming objects of mockery for demon kings. The orthodox spirits do not respond, and the mysterious Perfected do not attend.\n\nIn ancient times, before the Supreme Wondrous Heavenly Perfected One attained the Dao, he practiced the *Numinous Treasure* Dharma but did not adhere to the ritual protocols. Wearing mountain-dwelling ritual vestments, he ventured among people. Just as the true Dao was about to be accomplished, he attended a retreat at a royal household, where his ritual vestments violated the precepts and ruined his true Dao. Later, he became a Perfected One of the Five Peaks and remains in the world to this day. When the minor kalpas of heaven and earth reach their end, this Perfected One will ascend one kalpa’s height. Due to this transgression, he has incurred nine offenses against heaven and earth, exhausting ten minor kalpa cycles. As the cycle nears completion, the Perfected One roams the numinous peaks but has yet to ascend the Ten Absolute Realms. This stems from his failure to follow the ritual regulations for vestments. Scholars, take heed!\n\nWhen the minor kalpa cycles of heaven complete ten rotations, this Perfected One will once again become a concealed Perfected One among the ten directions.\n\nThe Scripture states: There was once a Dharma Master who studied the *Cavernous Mystery* retreat practices but had not yet severed worldly ties. He resided in the world, revering the precious scriptures, upholding the precepts, and cultivating the Dao, having accumulated much time in practice. Yet he mistakenly wore worldly ritual vestments into the mountains and thus failed to attain the Dao.\n\nAt that time, three jade maidens appeared, clad in nine-layered embroidered robes, with purple silk sashes. Their hair was styled in three coiled buns, adorned with orchid-embroidered kerchiefs. Their feet bore shoes with intertwined dragons and nine patterns, and in their hands, they held *Revolving Salvation* numinous banners, burning nine-colored harmonized incense. Playfully laughing, they said: \"The heavenly kalpa is nearing its end—who can resolve this?\"\n\nAn ancient immortal, seeing these jade maidens were no ordinary beings, bowed in reverence. The maidens initially ignored him, then said: \"You are an ancient worthy sovereign—why do you suddenly bow to us?\" The maidens rose, restless and uneasy. Soon, two more jade maidens arrived, each holding a scroll of wondrous scripture. They said: \"The Purple Tenuity Lady sent us bearing these eight precepts, issued from the midst of heaven, not to be shared with worldly people. The scriptural texts are secret and must not leave this place.\"\n\nThe Radiant Light Perfected One discussed the great and minor kalpas of heaven and earth, fearing that afterward, no remnant people would remain. Thus, he devised the minor kalpa salvation cycles, declaring that those who cultivate and keep these secrets may transcend. The eight solar terms are for presenting jade tablets.\n\nThe Radiant Light Perfected One composed the *Ode on Salvation for the Remnant People Across Kalpas*:\nCircling, traversing the cycle complete,\nRites touch the emptiness of non-action.\nAbove to the Numinous Clouds’ abode,\nBelow into the Abyssal Mystery Palace.\nDwelling round, square, level, and high,\nContemplating the precious chamber’s realm.\nThe salvations are not many,\nYet heaven’s cycles are distant in plain speech.\nWhen times flourish in the Primordial Accomplishment Palace,\nThe eight poles constantly come and go.\nThe three unite in one covenant—\nWhy is the transformative rite so late in coming?\nThe six directions arrive and depart,\nThe world’s destiny grows lofty and great.\nThe golden horse’s radiant essence flourishes,\nIts words portend prosperous cycles.\nWho treads the path of wisdom?\nReflecting on the primordial within and without.\nWhen the net’s discipline is exhausted at once,\nThe hundred-six numbers converge.\nCirculating, the Three Simplicities appear—\nRevered by the Heavenly Thearch.\nIf the past did not preserve the remnant,\nHeaven and earth’s cycles would overturn.\nHow to transcend this?\nGazing upward, recall the *Numinous Treasure’s* words.\nResponsive resonance may avert calamity,\nGrasping the tally and chanting the jade scriptures.\n\nDuring the salvation cycle, the Radiant Light Perfected One recited this ode, then summoned the Wind Earl and the lesser heavenly Perfected to assemble. As the kalpa’s cycle neared its end, he established the various minor heavens anew. Now, the Perfected One divides his form to become the Ten Heavenly Great Heavenly Worthies, surveying the Five Turbidities and the *Numinous Treasure* Ten Poles Perfected Ones. Those who now uphold the orthodox teachings and scriptures to attain the true Dao shall become these Ten Directional Perfected Ones. Though the texts have not yet been obtained, after witnessing the Dharma, one may ascend in broad daylight, transform the wheel, and become a minor heavenly Perfected One.\n\nThe Primordial Heavenly Worthy declared: The minor kalpa occurs when the Perfected Ones complete three celestial cycles, the heavenly numbers converge with earth, and the earthly numbers universally unite—this is called the minor kalpa salvation cycle. At that time, the sun, moon, and stars of the various heavens extinguish themselves, and the earth’s beams and frameworks lose their roots and origins. The Three Radiance Perfected Lords then transform and save the lesser sages who have not yet attained the true Dao, fearing the present cycle’s completion.\n\nIt is said that in former times, there was one *Mysterious Salvation* who emerged from the Ninefold Hidden Cavernous Mystery, self-generated and transformed. His radiant countenance resembled a youth’s. Holding the *Supreme Primordial Cavernous Clarity Numinous Treasure Twofold Simplicity True Scripture* in eight sections, he descended to inform the Five Peaks, suppressing disasters and calamities. Arriving at the stable and fiery lands, he sat and expounded the Eight Trigrams, establishing records to transmit to the Supreme Ultimate Perfected One.\n\nThe opening of the Three Worthies’ playful contemplation marks the means by which the kalpic passage is thus traversed. A jade maiden held a scroll of *Small Kalpa Jade Script for Suppressing Fire and Weeping Rivers*, stating it was bestowed upon the celestial of the Morning Land, Xia Yu. This was to be used when the teachings of the heavens faced great disasters, to pass through them.\n\nAncient immortals now serve as the Supreme Ultimate, recording the names and traces of those who attain transcendence. The scripture states: Before the era of Wu Yao, Perfected Ones received from the Jade Maiden of the Heavy Net Heaven the *Wondrous Scripture for Suppressing Fire and Annotating Smoke in the Small Kalpa*, which remains the method for transforming and delivering the body.\n\nWithin this scripture:\nThe flowing cycles revolve, the guiding principles perish,\nMountains and seas conceal, numinous power arrives.\nDeparting and returning, sun and moon are eclipsed,\nThe *Kui* transforms—now it has come.\n\nThe Primordial Celestial Venerable said: The Great Mystery holds six *wu* earthly branches, vast and purifying in their workings, responding to the endless wheel of kalpas. Contemplating the distant and empty, ascending the lofty and towering, craggy and boundless, the Ten Absolutes stand ungrounded. Vast and empty, the dark kalpa shifts and passes. The five stars are incomplete, constellations invert and the Big Dipper overturns. The kalpic cycle nears its end, sun and moon lose their light, yang’s moisture fails to harmonize, seasons lose their qi. Heaven and earth leak and dissipate, the Five Peaks sink and vanish, blessed lands float as ridges. Those who pass through find cool shade, gathering into the past.\n\nThe Three Realms take flight, and at that time, the people are utterly annihilated. The great perfected of the heavens refine and pass through, their bones merging with the Dao, their names inscribed on yellow silk. Thus the kalpic reckoning exhausts the empty and cavernous, the cavernous merging into emptiness to establish the Great Land, turning toward the Ten Absolutes’ boundlessness.\n\nThe great kalpic reckoning of the past and future North Pole converges into the great reckoning, entering the empty and征-space. The reckoning of emptiness creates the void—its name is unfathomable.\n\nThe Perfected of the Great Net said: The Dao that can be spoken is not the constant Dao. What is recorded as a name may also not be a name—it may be called hidden. The three below return to the void; the great enter vast expanse; the subtle reach the unseen. Moving in concealment within the empty land, resplendent within the cavernous palace, the Four Waterways serve as cavernous gates. The past abode is the great land for refining transcendents.\n\nThe Primordial Supreme Ultimate Perfected One and the Perfected of Mysterious Salvation expounded at the cavernous gate of the Small Kalpa the Dao of the kalpic cycle’s exhaustion, recording the cavernous lands and mountains. Mountains hold cavern-heavens, and cavern-heavens have four gates—these are the great cavernous gates. Upon reaching this gate, learners pass through by their own attainment.\n\nThe Most High Great Dao Lord said: The Primordial Celestial Venerable declared that as the great and small kalpic cycles near their end and the kalpic passage approaches, the Dao Lord himself spoke of the divergence of names and streams, the clash of kinds. The lofty dwell above, the low return to the depths. The great reverse and return to stillness; the One Origin forms its circle. The small settle into subtlety, the origin residing within. Forms divide and arise—some dwell high or low, some are born within the great or small, some take root and grow, some gestate in the womb, some renew with the new moon, some transform and arise naturally, some exist in the formless and qi-less void. Initially unseen in form or shadow, born in hidden depths—all such kinds possess karmic responses, all arising from transformation, each following its original cause.\n\nWhen the reckoning is exhausted, those with greater karmic response do not perish but follow their kind to begin anew. Those who take root and grow enhance their brilliance and beauty. With the register of the Seven Treasures’ trees, they are born in the Seven Treasures Forest of the Numinous Treasure Realm, where multitudes of transcendents and great sages often visit to observe. When the great and small kalpas end and the cycle renews, they attain human form. Cultivating the scriptural teachings, they behold the assembled perfected. The radiance of the Numinous Treasure shines universally, illuminating ten people.\n\nThose born from the womb, having accumulated heavy blessings in past lives, gain form and body in gestation, their souls and spirits conjoining with the numinous, naturally reciting the verses of the Supreme August. The Primordial Celestial Venerable and the Most High Lord Lao, in the Jade Capital’s Lesser Chamber of the Mysterious Capital’s Upper Land, expounded the *Thirty-Six Sections of the Supreme Cavernous Mystery Numinous Treasure Wondrous Scripture*.\n\nAt that time, the Most High Lord Lao possessed the reckoning of the Primordial Void’s lifespan and the boundless kalpic count. Before the Supreme August era, as the kalpic wheel turned and the mandate neared its transition, Yu Yi succeeded and departed, Jie Lin revolved and moved. Ascending to the kalpic peak, stars shattered and constellations renewed. The Five Peaks transformed, their directional guardians exchanged; the Four Waterways were swept away, seas became mountains, waters turned to colossal stones. Worms flew and insects stirred—all beings, formed in an instant, passed like the thirty-two myriad kinds of people.\n\nThe Primordial Lord Lao expounded the *Five Thousand Characters of the Scripture on the Dao and Virtue*, the *Three Cavernous True Writings*, and the *Essential Wondrous Scriptures*, teaching and transforming later learners. Its verses say:\n\nThe White Stone Elder, of empty surname,\nOn Bird Mountain, received and studied the Dharma in four hundred thousand words.\nDwelling there, he established fasts and upright conduct,\nAte plain vegetarian meals, repented of sins and contemplated blessings,\nOpened the path to deliver all, seeking escape from the troubled world,\nTo behold the Great Peace.\nHe paid homage to the heavens, bowed to the ten directions,\nGazed in gratitude to the Mysterious Perfected,\nThe Brahma multitudes of the heavens,\nThe eight kinds of voices.\nBurning incense, lighting lamps,\nReciting and circumambulating, practicing the Ten Poles’ mindfulness,\nReflecting to dispel floating illusions,\nDiscoursing on the most wondrous,\nAccumulating study for six hundred years,\nReturning to the Mysterious Capital’s Warrior Man Mountain’s northern chamber.\nAgain studying for two hundred years,\nOn the twenty-fourth day of the fifth month in the *jiawu* year of the Great Year,\nThe Numinous Treasure manifested.\nSuddenly, twelve flying celestial beings of the Seven Treasures,\nRiding cloud-borne chariots,\nDescended from the Ninefold Mystery Terrace,\nAddressed and welcomed the Primordial Void Perfected Lord,\nThe White Stone Empty Cavern Perfected One,\nWho soared aloft,\nAscending to the Ninefold Radiance,\nTeaching and transforming the assembled transcendents,\nStudying the arts and methods of true transcendence.\nIn the first year of the Supreme August era, on the tenth day of the ninth month,\nThe Lady of Tortoise Mountain received the *Eightfold Register of the Eight Lives’ Primordial Scripture*.\nOn the fifth day of the tenth month of that year,\nRed Pine Master received the *Thirty-Six Sections of the Great Cavernous Treasure Chapters*,\nThe *Three Cavernous True Regulations*,\nAnd the *Essential Precepts of the Dao and Virtue*\nIn the Mysterious Capital’s Treasure Citadel Mountain.\nBreaking gold to cast fish,\nDragons and serpents formed hooks,\nAscending the altar to fulfill a precious pledge.\n\nTo transmit its texts, they employed:\nA hundred feet of flying-cloud brocade,\nTwo jade tablets,\nTwo golden dragons,\nA pair of fish,\nTwenty-four swords,\nForty feet of white silk,\nAnd the Five Directions’ luminous mirrors.\n\nAt that time, the assembly of Brahma and the multitudes of heavens intoned the Eight Kinds of Celestial Sounds, chanting the Three Contractual Hymns. Through this study, they attained the Dao of true transcendence. They expounded upon the profound Cavernous Palace of Eon’s Height, naming it the abode of the Empty Cavern Primordial Unity Lord, the Supreme Radiance Lord, the Old Lord, and the Supreme Unity Lord—dwelling in villages beyond bounds, beyond abysses, in the subtle images of Mara’s realm. Across the Great Thousand’s Three Caverns, the Primordial Simplicity True Regulations and the Numinous Robe Treasure Regulations existed in utmost subtlety.\n\nFirst: the *True Guardians of the Empty Cavern*,\nThe *Great Cavern Purification Rites*,\nAnd the *Hymns of Simplicity and Numinosity* as odes.\nThey performed the *Mysterious Sound Cavern Purification of the Brahma-Heaven Net*,\nThe *Jade Capital Mountain Scripture’s Pace-the-Void Hymns*,\nThe *Brahma-Heaven Sound Cavern Spirit Purification*,\nThe *Eight Simplicities Yin-Yang Scripture*,\nAnd the *Central Lands’ Great Cavern Purification*.\nThey withdrew from worldly traces, secluding far from mortals,\nPracticing perpetual purification, ingesting and absorbing qi,\nRefusing to partake in worldly affairs.\nThose who did not maintain such purification and ingestion could not join the discourse.\n\nThe Ten Directions’ Supreme Sage Heavenly Worthies observed human good and evil, calling this the *Loftiest and Most Mysterious Purification Rite of the Supreme Perfected*. The independent Dao of establishing purification: the Primordial Void Lady, on Black Crow Mountain, received the *Supreme Cavernous Mysterious Brahma-Heaven Dignity Rituals and the Brahma-Heaven Net Great Precepts*. She repented and offered gratitude for the karmic fortunes and transgressions of her ancestors—seven generations of parents—bound in the cycles of birth, death, and rebirth, aspiring to dwell perpetually in non-action. She burned incense and lit lamps, eating once at midday, repenting and offering gratitude day and night in six periods for her primordial ancestors, that all might ascend to the heavenly halls, transform and be reborn across the Ten Directions, and walk alongside the Mysterious Capital.\n\nAs they recited the Three Caverns’ true texts, at that moment, the Numinous Treasure Perfected Ones descended in cloud-light. Ten Poles’ flying transcendents, divine youths, and jade maidens—each in tens—alongside Brahma’s multitudes, resounded in seven-jeweled radiance, illuminating the Jade Capital as they chanted the Three Contractual Brahma-Heaven Hymns. The Ten Poles’ Perfected Ones each intoned one contract, while Brahma’s hymns and the flying transcendents, divine youths, and jade maidens together offered a poem. The Primordial Void Lady descended from her seat to bow before the Heavenly Worthy, then received the poem, which read:\n\n*\"The chapter’s numinous, wondrous, and lofty,\nThe Primordial Lady deems it supreme.\"*\n\nThe Primordial Void Lady responded from the Mysterious Center with a poem of her own, and suddenly, all vanished. The assembled Perfected Ones turned their gaze—White Stone Master had attained the truth.\n\n**Three Contractual Hymns of the Supreme Perfected Ones of the Brahma-Heaven Net**\n\n**I.**\nThe Six Perfections trace Brahma’s path,\nThe utmost Perfected emerges from the Void’s mystery.\nThe Empty Cavern faces the Numinous Empyrean,\nGazing up at the Ten Poles’ guests.\nForms receive wondrous and marvelous appearances,\nVast and boundless, ascending to sagacity.\nHolding the staff, they attend the sacred branches,\nClad in coarse cloth at the Numinous Treasure’s dawn.\nUnraveling the flying clouds’ knots,\nTheir radiance illuminates the Brahma-Heaven Net.\nTheir bodies become golden,\nNecks adorned with seven-jeweled circles.\nFeet treading lotus steps,\nThey wander and inquire across the Ten Poles.\nThe Jade Capital’s village in the Mysterious Capital,\nNaturally inscribed with vermilion characters.\nJade tokens sound uncommon tones,\nThe Dharma-wheel is the true speech.\nWondrous indeed, the Supreme Teaching,\nThe Dao established in the Five Thousand Characters.\nAll scriptures return to this chief and eye,\nVast and open, the Cavernous Mystery’s truth.\nVirtue aligns, transcending beyond,\nWorldly dust left far behind.\n\n**II.**\nLush and verdant, the Empty Cavern’s land,\nTowering, the Heavenly Treasure Terrace.\nFlowing and clear, the assembled Perfected descend,\nTen thousand kalpas as one epoch.\nEmbracing the Jade Perfected Scripture,\nChanting through the Three Calamities.\nThe Five Sufferings burst forth at once,\nSeven generations transform into non-action.\nAscending to the Purple Tenuity Palace,\nThe Primordial Registers held as treasures.\nThe Primordial Void is not distant,\nRefining and expelling doubts of the perverse.\nThe body’s essence, turbid and worn,\nPay homage to the Supreme Master.\n\n**III.**\nThe Mysterious Cavern departs into the Void,\nEmpty and vast, without direction.\nThe Brahma-Heaven Net births the Cavern’s abode,\nTen Sages together in purification’s splendor.\nThe Five Peaks secure peace,\nThe Four Waterways receive wisdom’s image.\nAgain flying, they universally bear nothing,\nAll creatures, innumerable, equal.\nThe Nine Perfected’s Returned Elixir Record,\nFlying to the Jade Capital.\nTen thousand kalpas in an instant,\nCountless eons in a moment.\nTranscending the roots of the multitude’s difficulties,\nRiding rosy clouds to ascend Menglong’s ridges.\n\n**IV.**\nThe Dao that is not the Dao is not the constant Dao,\nThe name that is not the name is not the constant name.\nThe Void that is not the Void is not the constant Void,\nThe Mystery that is not the Mystery is not the constant Mystery.\nThus, know the Dao, the Mystery, the Void—\nNames are inherently wondrous.\nEncompassing and cleansing the utmost,\nVast and boundless, without end.\nAbove, embracing the Great Net in boundlessness,\nBelow, entering the abyssal in subtlety,\nAlso observing Mara’s images across the Great Thousand—\nMara finds the Great Net difficult to fathom.\n\nThe Treasure True Speech expounds the Supreme Teaching,\nThe assembled Perfected exhort and transform.\nThe *Heavenly Numinous Treasure Mysterious Scripture*,\nThe utmost secret texts,\nLiberate thirty-two myriad kinds of beings.\nThe Three Ones sweep away,\nThe Hundred Officials open the path,\nElaborating the true texts\nTo transform the benighted.\nUpholding prohibitions and taboos,\nThey naturally attain liberation.\nWithout such qualities,\nThey still avoid hell’s calamities.\n\nThe Dao has the *Five Thousand Characters*,\nThe utmost Perfected’s wondrous scripture—this is one text.\nThe *Great Cavern’s Thirty-Nine Chapters*—this is one text.\nThe *Jade Characters of the Cavernous Mystery Numinous Treasure True Texts of the Brahma-Heaven Net*—this is one text.\nThe *Three Sovereigns’ Inner Sounds*—this is one text.\nThe *Nine Dragons’ Flight*—this is the trace of attaining the Dao.\nScholars must study thoroughly the *Five Thousand Characters*,\nThe *Cavernous Mystery True Texts*,\nAnd the *Great Cavern’s Thirty-Nine Chapters*.\n\nThis scripture, since the Primordial Beginning, was hidden in the Golden Portal. By the Upper Prime, when the Dao’s scriptures were to spread, they swept away purity and turbidity, admonishing people on sin and fortune, enlightening the worldly, and revealing that the utmost Dao is not distant—it abides in the Great Void.\n\nThe *Great Cavern’s Thirty-Nine Chapters* originally consisted of thirty-nine words. The Supreme Old Lord elaborated them into thirty-nine chapters, bestowing them upon the Primordial Simplicity’s Primordial Void Lady as the *Empty Cavern True Texts*. After studying for one thousand six hundred twenty-four days, the assembled transcendents revered them, and the true Dao was accomplished. The Empty Cavern Perfected One, gazing upon the Six Perfections, further expounded the *Great Kalpa* in one scroll, teaching and transforming the assembled transcendents. The scripture’s loftiness and subtlety return to their origin.\n\nThe *Supreme Perfection’s True Regulations*, the *Highest Regulations and Methods*, the *Great Simplicity’s True Regulations*, the *Primordial Void Lady’s Empty Cavern True Secrets*, the *Numinous Treasure Jade Scripts*, and the *Great Cavern’s True Texts*—these thirty-nine chapters first emerged, while the Jade Scripts expounded thirty-six divisions of wondrous scriptures. Their profound and subtle texts arose from the Dao’s own words, and all the Heavenly Perfected revered the Vermilion Writ, gazing upon the traces of the Brahma-realm.\n\nThus the Perfected One declared: To cultivate the Great Vehicle’s practice, one must venerate the Jade Scripts and the *Great Cavern’s True Texts*, thereby attaining the rank of Highest Perfected. Their names are inscribed in the Brahma-register, and the Ten Poles’ True Immortals progressively ascend through verification, all rooted in the Empty Cavern. The Perfected One also serves as the Ten Directions’ Perfected, assisting in the governance of the Ten Heavens. The Brahma-Heaven’s name for them is the Ten Poles’ True Immortals, and the True Net Heaven’s sound is called the Dao.\n\n**Hymn of the Eastern Infinite Realm’s Void-within-Void Wondrous Form Perfected One, Precious Radiance Realm, for the Liberation of All in the Void (One Contract)**\nLofty peaks beyond the darkest ridge,\nMidway lies wondrous speech.\nThe Empty Cavern’s Net Heaven’s chapters,\nSoaring to ascend the Nine Mysteries.\nFeet treading the cloud-net’s path,\nGazing down upon the Supreme August Perfected.\nUpholding precepts to ascend the Void-Nothing,\nChanting the *Numinous Treasure’s* verses.\n\n**Hymn of the Southern Infinite Realm’s Void-within-Void Supreme Perfected One, Numinous Radiance Realm, for the Liberation of All in the Void (One Contract)**\nThe Void-True is the Mysterious True,\nThe utmost Dao reveres non-action.\nPrimal qi abides in emptiness and stillness,\nDragons inverted, vermilion phoenixes soaring.\nOnly pluck the lush jade mushrooms,\nUphold precepts to enter the Cloud Gate.\nSoaring nets play with dragons and tigers,\nVowing to bind past-life karmic threads.\n\n**Hymn of the Western Infinite Realm’s Mysterious-within-Mysterious Supreme Vastness Perfected One, Plain Radiance Realm, for the Liberation of All in the Mysterious (One Contract)**\nThe Purple Tenuity’s mysterious-within-mysterious,\nStanding alone, embodying spontaneity.\nAuspicious signs seventy-two,\nHead’s radiance five-colored and round.\nResplendent, illuminating the ten directions,\nFlying clouds disperse incense smoke.\nHands clasped toward Brahma-Heaven,\nAttaining sight of the *Infinite’s* chapters.\n\n**Hymn of the Northern Infinite Realm’s Nonbeing-within-Nonbeing Mysterious Record Perfected One, Mysterious Radiance Realm, for the Liberation of All in the Nonbeing (One Contract)**\nNuminous brilliance faces the void,\nHow could the lofty and wondrous be distant?\nThe Jade Dawn is no material vessel,\nCalamities thus reverse and retreat.\n\n**The Scripture of the Five Sufferings of the Golden Gate,**\nSevered forever through womb-refinement.\nFlowing pearls ascend to the Upper Palaces—\nHow could aeons be called late?\n\n**Hymn of the Perfected One of the Upper Village of Mysterious Province, Northeastern Infinite Realm, for the Liberation of All in the Upper Village of the Infinite (One Contract)**\nVerdant forests in solemn stillness,\nFragrant, ascending to the Great Rosy Clouds.\nJade pendants chime beneath Heaven’s shade,\nCloudy vapors dense and towering.\nThe red realm’s host of Daoists—brows arched—\nAttain long life to ward off evil.\nChanting the *Yellow Court Register*,\nThey achieve the Dao and return to ferry their kin.\n\n**Hymn of the Perfected One of Eon’s End, Southeastern Infinite Realm, for the Liberation of All in the Pure Net Heaven (One Contract)**\nGazing upward to the land of kalpas’ height,\nThe Jade Capital lies void within the Mysterious.\nMajestic, the Red Pine Master\nAscends as if to the Great Rosy Clouds.\nWandering and sinking past all beings,\nThe Great One rides the cloud-chariot.\nDelighting in the lofty and noble Dao,\nSeven ancestors are born in celestial dwellings.\n\n**Hymn of the Boundless Perfected One, Southwestern Infinite Realm, for the Liberation of All in the Luxuriant Net (One Contract)**\nRadiant light emerges from the Great Cavern—\nWhy do true spirits linger in hesitation?\nLeft, the dragon holds the reins in its jaws;\nRight, the tiger bares its might.\nCrimson phoenixes gather in mutual regard,\nSerpent-spirits ascend the Great Chief.\nThe Nine Palaces generate the Eight Trigrams,\nThe Ten Poles roam the Grand Tenuity.\n\n**Hymn of the Transformative Birth Perfected One, Northwestern Infinite Realm, for the Liberation of All in the Radiant Pāramitā (One Contract)**\nTreading the flying steps of the Upper Offices,\nThe Seven Primes’ path of long life.\nYearning for the people of this world,\nThey soar to escape suffering and affliction.\nErasing the hundredfold sins of past lives,\nThey circle back to the Five Elders.\nInscribed in the *Jade Tablet* of fixed names,\nAll vow to preserve themselves forever.\n\n**Hymn of the Supreme August Perfected One of Myriad Aeons, Upper Infinite Realm, for the Liberation of All in the Primordial Center of the Ninefold Radiant Numinous Treasure (One Contract)**\nGazing at the Great Rosy Clouds’ subtle traces,\nBeyond the peaks of the secluded central ridge.\nCaverns intersect in the Mysterious Province,\nWhere the host of immortals assembles.\nWandering past three revolutions,\nFurther refining to transform their luminous forms.\nAwaiting the Perfected Ones of the Ten Poles,\nThey ascend in clouds to the Jade Capital.\n\n**Hymn of the Longevity-Cultivating Perfected One of Countless Calculations, Lower Infinite Realm, for the Liberation of All in the Golden Radiance of the Great One (One Contract)**\nReturning to the wondrous truth within the Dao,\nThe Brahma-Heaven holds the numinous scripture.\nThe void expounds the jade characters,\nTo instruct later worthies.\n\nThe Perfected One leaves no visible form,\nHarmonizing light and qi to permeate the dust.\nPresenting jade tablets to the Supreme August,\nBeseeching the bestowal of essential texts.\n\n**Ten Chapters by the Ten Directions’ Perfected Ones for Offering Rituals, Burning Incense, Expressing Gratitude, Pacing the Void, Chanting Hymns, and Illuminating Lamps—Separately Extracted from the Host of Scriptures**\n\nIn the fifth year of the Void Sovereign’s reign, on the seventh day of the seventh month, the Primordial Lady of the Great Void descended to sport among the myriad heavens. Observing the good and evil therein, she beheld legions of demonic spirits and malevolent ghosts rampaging across the world, wantonly harming the innocent and violently severing lives. Though the Most High remained distant and the Three Clarities vast, countless demons and myriad evils masqueraded as true and upright. Wind and rain, drought and flood, no longer aligned with the hexagrams’ seasons. The Primordial Lady manifested upon Mount Reniao, where she expounded the *Wondrous Scripture of the Jade Formula of the Cavernous Mystery’s True Text*, dividing it into thirty-six scrolls. With its majestic rites and models, it pacified the Five Peaks to oversee the numinous spirits of heaven.\n\nNow, ten hexagrams are composed upon Mount Reniao, within the vast Cavernous Great Realm’s Mysterious Cavern Chamber. Amidst the teachings of the Mysterious Venerable’s supreme treasure, those with immortal bones shall behold its text. Concealing themselves to study and contemplate, they uphold its precepts. The world’s offerings and alternate methods, as recorded in the thirty-six sections of the wondrous scriptures, were received by the Perfected One of White Stone Kongdong as thirty-six myriad characters, originally comprising thirty-six scrolls—entitled the *Thirty-Six Sections of the Venerable Scriptures*—whose words and graphs remain unbounded. The scrolls’ opening titles derive from the *Great Cavern’s Scripture of the Fundamental Karma of Great and Small Kalpas*.\n\nWithin these characters lie the celestial sounds and the inner names of the hundred spirits. Now, the methods for study and cultivation emerge as the Primordial Lady of the Great Void expounds the *Middle-Grade Wondrous Scripture*.\n\nThe Primordial Lady of the Great Void declared: To behold the scripture of the Dao, the scholar must refine their essence and stir profound devotion. The Ten Ranks of Perfected Ones shall dispatch flying immortals to bestow the texts anew each day. Through diligent cultivation, one attains the true Dao.\n\n**Hymn of the Flying Heavenly Men and Jade Maidens:**\nVast and clear, the azure expanse adorned,\nBoundless, the Mysterious Origin’s embrace.\nSinking into the records of spontaneity,\nWondrously traversing the nine heavens’ net.\nLeaving no trace, the spirit of empty qi,\nEven a thousand kalpas would not be too long.\nRadiant brilliance universally gleams,\nPenetrating and illuminating the singular body.\nThe August Jade Sovereign descends in majesty,\nDissolving a hundredfold layers of sorrow.\n\n**Hymn of the Supreme Disciple, the Perfected One of the Great Void’s Cavernous Emptiness:**\nResplendent, without limit or trace,\nVast and open, the realm of emptiness and stillness.\nGazing down upon the Purple Tenuity’s terrace,\nEntangled in the karmic forms of the vulgar.\nHolding the texts of the Cavernous Chapters,\nSporting together amidst the jade radiance.\nThe Heavenly Venerable ascends in flight,\nDissolving and casting off the world’s snares.\n\nThe Perfected One declared: The Dao possesses the *Supreme Clarity’s Pure and Primordial Cavernous True Text of Jade Characters Wondrous Scripture*, the *Supreme Clarity’s Pure and Primordial Cavernous Jade Formula*, the *Wondrous Scripture of the Luminous Hosts’ Sounds*, the *Pure Clarity’s Flying Ninefold Cavernous Wondrous Scripture*, the *Pure Clarity’s Flying Sevenfold Transformations and Salvations of the Primordial Cavernous Wondrous Scripture*, the *Upper Scripture of the Pure and Primordial Cavernous Numinous Chapters*, the *Upper Scripture of the Pure and Primordial Cavernous Wheel-Turning of the Five Paths*, the *Upper Scripture of the Pure and Primordial Cavernous Mysterious Wheel*, the *True Scripture of the Pure and Primordial Cavernous Thirty-Six Ramparts’ Hosts of Sounds*, the *Wondrous Scripture of the Pure and Primordial Cavernous Phoenix’s Cessation and Wondrous Records of the Dao’s Traces*, the *Wondrous Scripture of the Pure and Cinnabar Waters’ Flying Techniques in Hu Language*, and the *Secret Scripture of Jade Texts’ Majestic Rites*.\n\nThe Great Salvation Perfected One, the Boundless Venerable, expounded the *Method of the Flying Cinnabar Waters* in the Kalpa-Measuring Realm on the sun’s day, bestowing it upon the Lady of the Purple Tenuity. The Lady received it with reverence.\n\nThe Perfected Ones of the Ten Directions, together enveloped by the *Great Numinous Chapters of the Cavernous Emptiness of the Ultimate Void* and the *Thirty-Six Sections of the Heavenly Dao’s True Texts in Brahma Sounds*, completed the catalog of titles. The Perfected Ones faithfully received and upheld them.\n\n**The Flying Cinnabar Waters Method’s Twelve Medicinal Ingredients:**\n1. **Crimson Mound Pearl** – Oral formula: cinnabar.\n2. **Black Horse’s Mysterious Passage** – Oral formula: stalactite.\n3. **Mysterious Subtlety’s Permeating Body** – Oral formula: white quartz.\n4. **Purple Ascent’s Blazing Radiance** – Oral formula: purple quartz.\n5. **Yellow Minister’s Penetrating Body** – Oral formula: sulfur.\n6. **Mysterious Life’s Prolonging Calculation** – Oral formula: Taiyi’s leftover jade.\n7. **Flowing Bloom’s Moon Essence** – Oral formula: mica powder.\n8. **Green Warrior’s Returning Essence** – Oral formula: white atractylodes.\n9. **Repelling Poison’s Warming Body** – Oral formula: asarum.\n10. **Withered Dao’s Winter Blossom** – Oral formula: poria.\n11. **Cinnabar Attendant** – Oral formula: sesame.\n12. **Prolonging Years and Extending Life** – Oral formula: polygonatum.\n\nEach of the above, twenty-four *jin* in weight. The twelve superior medicines each govern their own functions. The ingredients must be of the finest quality. The practitioner must first undertake a fast of one hundred twenty-four days, avoiding inquiries from others. Pound the ingredients in a bronze mortar: fifty thousand pestles for herbal medicines, one hundred thousand for mineral medicines. Once refined, combine them, first mixing with white honey in a bronze mortar for one hundred twenty thousand pestles. When the medicine is half-completed, place twelve *shi* of mercury into a bronze cauldron, sealing it with a bronze lid. Use white quartz to prepare the mud, sealing the cauldron’s seams. Construct two openings in the cauldron, covering it with a roof to prevent vulgar persons, birds, fowl, chickens, or dogs from seeing it. Use cypress leaves for fuel, replenishing until the mercury is entirely sublimated. Once the medicine is complete, dry it in the shade for one hundred days. Upon opening, store it in vessels of gold, silver, or jade.\n\nWhen taking the medicine, fast and consume twelve pills, each the size of a sesame seed. One shall then float aloft, ascending myriad stages. The Perfected Ones of the Ten Directions and the host of heavenly Perfected Ones attain truth through the *Flying Cinnabar Waters Technique*.\n\nThe Supreme Lord Lao observed the transformations of life across the Ten Directions, perceiving the foolish and admonishing the obstinate. He expounded wondrous texts to instruct the Great Salvation Perfected Ones of the Myriad Heavens and the Dharma Masters of the Net of Brahma. The Mysterious Ultimate’s Supreme Perfected One manifested the textual methods to illuminate the Ten Directions’ numinous voids. In the twenty-third year of the Jiaping era, on the ninth day of the ninth month, the Perfected One wandered the Kalpa-Measuring Mysterious Capital, ascending to behold the jade radiance of Mount Reniao. Paying homage to the Supreme Ultimate, he presented himself before the Great Salvation Perfected One.\n\nUpon completion, he addressed those seeking the Dharma among the benighted, entangled in defilement and impurity, who dared not ascend to make their case. From the inception of the withered bones’ primordial essence, through the wheel-turning of womb transformations, they erred into the human realm, their putrid flesh and bones. Yet, by the grace of the numinous descent’s mysterious favor, those with hearts were awakened and uplifted. The numinous and exalted Venerable nurtures and educates all beings, universally delivering all.\n\nHere the profound mystery is fathomed—even the crawling insects and wriggling creatures all escape the Three Evil Paths. Yet the numinous and exalted Venerable has not bestowed the true scripture upon these withered bones. We long to behold its purport.\n\nThereupon, they rose and made obeisance, pacing through the seven heavens for what seemed an age. The Great Salvation Perfected One remained still and silent, offering no response. Suddenly, the Lady of Mount Tortoise emerged from the Palace of Purple Radiance, attended by some ten jade maidens, and arrived at the Kalpa-Measuring Mysterious Capital.\n\nThe Lady smiled and said: “What request could so confound a Perfected One?” The Dao possesses the *Supreme Eulogy of the Mysterious True: The Wondrous Scripture of the Flying Arts of Cinnabar Waters* in eight sections—its profound records and essential texts encompass the true and correct Way in full.\n\nThe Lady then smeared her face with ashes and prostrated herself, earnestly entreating the jade maidens to join her plea. In an instant, the Perfected One produced the scripture and conferred it upon these Perfected Ones of the Ten Directions, who thereby also received the text. Through cultivation and study, they have now attained the rank of Perfected Ones of the Numinous Treasure of the Ten Directions.\n\nThus concludes the *Wondrous Scripture of the Flying Arts of Cinnabar Waters for Deliverance Through the Lesser Kalpa of the Cavernous Mystery and Numinous Treasure*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞玄灵宝丹水飞术运度小劫妙经 经名：洞玄灵宝丹水飞术运度小劫妙经。 撰人不祥，约出於南北朝。 灵宝经目着录未出。 一卷。 底本出处：《正统道藏》洞玄部本文类。 洞玄灵宝丹水飞术运度小劫妙经 太上大道君曰：元始天尊言，景光并国大天下劫运尽，其景无盖，其光无底，不可安止。 日月不能照，列辰不能纪，无上无下，不可依逮，其数难穷。 道言：无上无下，弥纶运会，轻至於历无，沦入於空玄。 二者同号，思议辽寂，回而复同，竟而玄圆，上钟於绝顶，下入於微尘，左达於苍浩，右通於万川。 大罗盖列，斗绝接冥，玄都元君，灵运旋隐，巨岳岩谷，翻然尽并。 六度既修，梵行双处，登诸天关，天迹辽豁，虚无湛根。 小运流周，运度开元，诸天轮转，炎度会期，诸地应数，亦俱轻翻，天高无极乎洞原。 天以骞树，正为网纪，地以人鸟，住乎炎烟，小劫运来，上造高天，从天运度，不绝幽门。 於是众灵记注，名曰天地数交，小劫已交也。 元始天尊度此轮转已交之数，凡三十六万劫时，行名为小天风度，小劫交也。 大天者，有三千九百六十天，包於十方诸小天。 其天各治真人，各有十方真人，三百年一过，旋行此骞树及人鸟山，竟名日小天运度交小劫周也。 真人从今天中出之於大天。 大天有三千九百六十天大劫，景光真人礼行此天毕，名为小劫运度周也。 元始与景光真人言：天有百亿大天，地有百亿洞天。 一天三十六万劫，年行同尽，名为小天。 其天有大洞乡真人。 小劫运度周时，还其立，罡宿五斗七籍□□始成，日月朗明，天元新治。 其时玄度出化，经道流应，有太灵紫元夫人从灵耀天中出，从女飞天人十许人，远寻玄度。 尔时正在五岳，镇此炎烟，清荡灾祸，止伏诸凶。 天人见玄度，应於十绝虚空中作礼。 夫人言：往昔上古劫运未交时，天尊太真已见，玄降其辞，演上古灵宝经部属卷数，藏之於大洞玄乡中。 有仙骨者，见其经文。 后有太极真人，未得道之时，常居世问，游山采药。 年七岁，游行至九十岁，不杀众生，常修世间诸经，老君道德众经为业，通微内究。 神真普足，游行所至，不问幽山深谷，林森岩岨，绝涧之地。 后於武人山洞中见元君，得道之迹遗，八素交带真文妙经，《太上洞玄灵宝小劫运数妙经》。 学者自当授子，令和天地运数，交会百亿数尽，玄度复降，恐大数欲至，何可过哉，小劫见也。 元始与玄度真人言：数随百六，生於末运，其时有仙骨之夫，吾自教之度身之法。 学者当以常求过炎灾，度烟厄者，当学三洞妙经，置立灵宝斋法。 若在人问者，当立高座宝盖，华灯香机，朝礼一日六时，日中一食。 若远弃世务，在山林幽谷，斋法独立之道者，长斋唯咽气吞丹，常以立坐，左手回北极星。 言：某甲月吉时良，坚立福田，愿北极太上度某甲形。 闭气三呼，六时行此，自得道真。 天运小劫交时，玄度真人以此秘文九符度之。 元始言：九符者，九章也。 应太上九策文，受灵宝佩此九符水文，是洞玄灵章文也。 诵咏经时佩身。 丹书素箓回符，给囊请带之，以去小劫交，秘之也。 元始天尊演太上洞章符九章 演太上洞章符第一 演太上玄章符第二 演太上灵章符第三",
      "translated_text": "**The Wondrous Scripture of the Divine Treasure Elixir-Water Flying Technique for Delivering the Minor Kalpa**\n\n**Scripture Title:** *The Wondrous Scripture of the Divine Treasure Elixir-Water Flying Technique for Delivering the Minor Kalpa*. Author unknown, approximately dated to the Northern and Southern Dynasties. Not recorded in the *Catalogue of Divine Treasure Scriptures*. One fascicle. Base text from the *Daoist Canon of the Zhengtong Era*, *Wondrous Section*, *Textual Category*.\n\n---\n\nThe Most High Lord of the Great Dao proclaimed: The Primordial Heavenly Worthy spoke, saying that when the radiance and light of the vast celestial realm exhaust their kalpic destiny, their brilliance shall be without bound, their illumination without depth, and none may abide therein. The sun and moon shall be unable to shine, the constellations unable to mark time; there shall be neither above nor below, no place to rely upon or reach, and their reckoning shall be unfathomable.\n\nThe Dao declared: Without above or below, it pervades and revolves through the cosmic cycles, lightly extending into the boundless, sinking into the profound void. These two share a single designation, their contemplation vast and still; revolving, they return to unity, ultimately merging into the mysterious and perfect. Above, they chime at the absolute summit; below, they enter the minute dust. To the left, they reach the azure vastness; to the right, they flow through the myriad rivers. The canopy of the Great Net spreads forth, the Dipper’s extremity joins the darkness; the Mysterious Capital’s Primordial Lord, in numinous motion, whirls and vanishes. Towering peaks and rocky valleys suddenly dissolve and merge.\n\nHaving cultivated the Six Perfections and dwelt in the dual practice of Brahman conduct, one ascends the celestial passes, where the celestial traces stretch boundlessly, and the root of quiescent emptiness abides. The minor cycle flows and encircles; the kalpic deliverance unfolds the primordial. The myriad heavens revolve, the fiery kalpas converge at their appointed time, and the earthly realms respond in accord, all lightly overturning. The heavens rise without limit into the abyssal origin.\n\nThe heavens are upheld by the *qian*-tree, serving as the net’s guiding principle; the earth is inhabited by humans and birds, dwelling amidst the fiery mists. When the minor kalpa’s destiny arrives, it ascends to the lofty heavens. From the heavens’ revolving deliverance, the Dark Gate is unceasing. Thereupon, the assembled spirits record and inscribe this as the \"Intersection of Heaven and Earth’s Reckoning,\" for the minor kalpa has now converged.\n\nThe Primordial Heavenly Worthy delivered this revolving, intersecting reckoning for thirty-six myriad kalpas, a period termed the \"Minor Celestial Wind’s Deliverance,\" the convergence of the minor kalpa. The Great Heaven encompasses three thousand nine hundred and sixty heavens, enclosing the ten directions’ myriad lesser heavens. Each heaven is governed by Perfected Ones, each with ten directional Perfected Ones. Every three hundred years, they traverse the *qian*-tree and the Human-Bird Mountain, completing what is called the \"Minor Celestial Deliverance’s Convergence with the Minor Kalpa’s Cycle.\"\n\nThe Perfected Ones emerge from the present heaven into the Great Heaven. The Great Heaven endures three thousand nine hundred and sixty great kalpas. When the Radiant Perfected Ones have completed their rites in this heaven, it is termed the \"Cycle of the Minor Kalpa’s Deliverance.\"\n\nThe Primordial spoke to the Radiant Perfected Ones: There are a hundred million Great Heavens, and a hundred million Grotto-Heavens on earth. One heaven endures three hundred sixty myriad kalpas, its years simultaneously exhausting—this is called the Minor Heaven. Within it dwell the Perfected Ones of the Great Grotto Realm.\n\nWhen the cycle of the minor kalpa’s deliverance is complete, they reestablish their standing. The *gang*-asterism’s Five Dippers and the Seven Registers [lacuna] are first formed; the sun and moon shine brightly, and the celestial origin is newly governed. At that time, the Mysterious Deliverance emerges to transform, the scriptural Dao flows in response. The Supreme Numinous Purple Prime Lady emerges from the Numinous Radiance Heaven, accompanied by ten or so female flying celestial beings, seeking the Mysterious Deliverance from afar.\n\nAt that time, he resided upon the Five Marchmounts, suppressing the fiery mists, sweeping away calamities, and subduing all malevolence. The celestial beings, beholding the Mysterious Deliverance, paid homage amidst the Ten Absolute Void Spaces.\n\nThe Lady declared: In the distant past, before the ancient kalpic destiny had converged, the Heavenly Worthy and the Supreme Perfected Ones had already foreseen this. The Mysterious One descended with his teachings, expounding the ancient *Divine Treasure Scripture*’s sections and fascicles, which were concealed within the Great Grotto’s Mysterious Realm. Only those with immortal bones could behold its scriptural text.\n\nLater, there was the Supreme Ultimate Perfected One, who, before attaining the Dao, dwelt amidst the world, wandering mountains to gather herbs. From the age of seven to ninety, he refrained from harming living beings, constantly cultivating the world’s various scriptures. The *Scriptures of the Lao Lord’s Dao and Virtue* were his vocation, and he delved into the subtle and probed the inner mysteries. His spirit and perfection were fully realized; wherever he wandered—be it secluded mountains, deep valleys, dense forests, or precipitous cliffs—he inquired not of the terrain. Later, within the cavern of the Martial Man Mountain, he encountered the Primordial Lord and obtained the traces of the attained Dao: the *Wondrous Scripture of the Eightfold Plain Interwoven True Texts* and the *Wondrous Scripture of the Supreme’s Divine Treasure Minor Kalpa’s Reckoning*.\n\nHe instructed his disciples, saying: You must now receive these teachings so that the reckoning of heaven and earth’s revolutions may converge, and the hundred million cycles exhaust. The Mysterious Deliverance shall descend again. Fearing the great reckoning’s approach, how could one let it pass? The minor kalpa is now manifest.\n\nThe Primordial Heavenly Worthy spoke to the Mysterious Deliverance Perfected One: The reckoning follows the hundred and six, arising in the final kalpa. At that time, those with immortal bones—these men I myself shall instruct in the methods of delivering the body.\n\nDisciples should constantly seek to transcend the fiery calamities and deliver themselves from the perils of the mists. They ought to study the wondrous scriptures of the Three Caverns and establish the *Divine Treasure* purification rites. If dwelling amidst the world, they should erect a lofty dais with a jeweled canopy, floral lamps, and incense implements, paying homage six times daily and partaking of one meal at noon. If one has renounced worldly affairs and dwells in secluded mountains or deep valleys, practicing purification rites in solitude, they should maintain a perpetual fast, swallowing qi and elixir-water, standing or sitting constantly, with the left hand turning toward the Northern Culmen.\n\nOne should say: On such-and-such an auspicious day and hour, I, [Name], firmly establish my field of merit, beseeching the Supreme of the Northern Culmen to deliver my form. Holding the breath, one exhales thrice, practicing this six times daily, and shall thereby attain the Perfected Dao.\n\nWhen the celestial destiny of the minor kalpa converges, the Mysterious Deliverance Perfected One shall deliver them with these nine secret talismans. The Primordial declared: The nine talismans are the Nine Chapters, corresponding to the Supreme’s Nine Strategies. Receiving the *Divine Treasure* and wearing these nine talismanic water-texts—these are the *Wondrous Scripture’s Divine Chapters*. One recites and chants them while wearing them upon the body. The cinnabar-written plain registers and revolving talismans are placed in a pouch and worn, to avert the convergence of the minor kalpa. These are to be kept secret.\n\nThe Primordial Heavenly Worthy expounded the Supreme’s *Wondrous Scripture’s Ninefold Talismanic Chapters*:\n1. The First: Expounding the Supreme’s *Wondrous Scripture Talisman*\n2. The Second: Expounding the Supreme’s *Mysterious Scripture Talisman*\n3. The Third: Expounding the Supreme’s *Numinous Scripture Talisman*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1238,
      "start_sentence": 0,
      "end_sentence": 49,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.11868476867676,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝丹水飞术运度小劫妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "演太上宝章符第四 演太上玉章符第五 演太上九章金音符第六 演太上玉音三十九章符第七 演太上生神章符第八 演太上九沦化隐章符第九 秘符文者， 太上洞玄隐策者也。 学者佩之於身，常咏此九章音，真道自降。 元始天尊言：三素者，紫素、黄素、白素是也。 今各为太上洞玄灵一真人，三素合为三真人，恒统领今治也。 经言：灵宝法师建斋法服，法裙以黄布为裙，内着泥丸缯。 泥丸缯其法上着青横幅为帔，黄绢为巾。 寒夏不改易道，常以此为法衣，常有神男玉女卫之。 经言：法服者，若山林幽隐，建立斋法，其裙褐巾被等皆以鹿皮制之。 然不得与世人同斋，若在世学者当按经言，不得服山学法衣游出人间，人间衣不得入山林。 且亦违经犯戒，诸天大真观看威仪失法，为魔王所笑，正神不感，玄真不临。 前上古之时，太妙天真人未得道之时，奉修灵宝法，不按仪注，以山学法衣游出人间，真道垂成，於此为一国王家斋，遂为此法衣犯戒败真道，后作五岳真人，今故在世间。 天地小劫数尽，此真人得一登劫仞，从此真秘戒败天地九过，度小运讫十，其运欲周，真人方且游行灵岳，未得上登十绝，从此法衣不按仪科所为也。 学士慎哉。 天运小度若讫十者，此真人还得为十方数中真人隐也。 经言：又有一法师修学洞玄斋法，故未绝迹，在世供养宝经，治戒修道业，已积时矣。 误着世间法衣入山，遂不得道也。 其时复有三玉女，衣九蕀绣被，紫丝为带，头作三环角结，上着兰生绣巾，足着交龙九文之履，手把运度灵幡，烧丹合九色和香。 游戏笑言：天运欲尽，谁解之哉。 於此有一上古仙人，见此玉女，如非常人，因顿首作礼，玉女初不看视，谓言：君是上古贤君，何忽礼乎。 玉女因起，彷徨不安，又有二玉女复来，手各持一卷妙经，言曰：紫微夫人使我持此八条，出自天中，不与世人相接。 经文秘，不出於此。 景光真人论数天地大小劫毕，恐其后无复种民，因造作小劫运度，谓契已可过为真者，修学秘之。 八节日投玉简用也。 景光真人造种民超劫颂 旋行过已周，礼涉无为空。 上至灵云宿，下入渊微宫。 宅圆方平上，思惟宝室乡。 度数不乃多，天运素言远。 时茂元成官，八极常往反。 三者同一契，礼化来何晚。 六合来往至，世祚长高大。 金马光精盛，其言将运泰。 谁迹智慧涂，念思元中外。 网纪一时尽，百六数交会。 周流三素见，天帝之所尊。 过去不成种，天地运将翻。 何缘得过之，仰念灵宝言。 感应可度灾，握节咏玉篇。 景光真人时在运度之际，告此颂已，方召风伯诸天小天天真来会，运期数尽，更造立诸小天。 真人今分形，作十天大天尊，游观五浊灵宝十极真人，今正教化经法得真者，当作此十方真人。 其文今虽未得，白日飞腾，见法后转轮，往作小天真人也。 元始天尊言：小劫者，真人三圆竟天，天数交地，地数普会，名为小劫运度者也。 其时诸天日月星宿皆自灭绝，诸地梁纲无有根宗。 尔时三景真君化度众小圣未得真者，特恐今运周也。 言昔往有玄度一人，本从九潜空微中生，自然而化，光泽颜如少童，持八部太上元洞清静灵宝二素真经，八部下登告五岳，镇往灾生祸，至安定炎烟乾坤演坐八卦建录，授与太极真人者也。",
      "translated_text": "The Primordial expounded the Supreme’s *Treasure Scripture Talisman* as the Fourth, the Supreme’s *Jade Scripture Talisman* as the Fifth, the Supreme’s *Ninefold Golden Tone Talisman* as the Sixth, the Supreme’s *Thirty-Nine Jade Tone Talismans* as the Seventh, the Supreme’s *Spirit-Generating Scripture Talisman* as the Eighth, and the Supreme’s *Ninefold Transformation Concealment Scripture Talisman* as the Ninth. These secret talismanic texts are the Supreme’s *Cavernous Mystery Concealed Strategies*. Scholars wear them upon the body and constantly chant the ninefold tones, and the true Dao naturally descends.\n\nThe Primordial Heavenly Worthy declared: The Three Simplicities are the Purple Simplicity, the Yellow Simplicity, and the White Simplicity. Now, each becomes a Supreme *Cavernous Mystery Numinous* Perfected One. The Three Simplicities unite to form the Three Perfected Ones, who perpetually govern the present administration.\n\nThe Scripture states: When a *Numinous Treasure* Dharma Master establishes a retreat and dons ritual vestments, the ritual skirt is made of yellow cloth, with inner garments of *Mud-Pellet Silk*. The *Mud-Pellet Silk* is adorned with a horizontal green sash as a mantle, and a yellow silk kerchief. Through cold and heat, this attire remains unchanged as the ritual vestment, and divine boys and jade maidens constantly guard it.\n\nThe Scripture states: For ritual vestments, if one dwells in secluded mountains and forests to establish retreat practices, the skirt, coarse cloth, kerchief, and cloak are all made of deer hide. However, one must not share the retreat with worldly people. If a scholar resides in the world, they must follow the scriptural instructions and not wear mountain-dwelling ritual vestments when venturing among people, nor bring worldly garments into the mountains. Such actions violate the scriptures and breach the precepts. The Great Perfected of the myriad heavens observe one’s demeanor and loss of proper form, becoming objects of mockery for demon kings. The orthodox spirits do not respond, and the mysterious Perfected do not attend.\n\nIn ancient times, before the Supreme Wondrous Heavenly Perfected One attained the Dao, he practiced the *Numinous Treasure* Dharma but did not adhere to the ritual protocols. Wearing mountain-dwelling ritual vestments, he ventured among people. Just as the true Dao was about to be accomplished, he attended a retreat at a royal household, where his ritual vestments violated the precepts and ruined his true Dao. Later, he became a Perfected One of the Five Peaks and remains in the world to this day. When the minor kalpas of heaven and earth reach their end, this Perfected One will ascend one kalpa’s height. Due to this transgression, he has incurred nine offenses against heaven and earth, exhausting ten minor kalpa cycles. As the cycle nears completion, the Perfected One roams the numinous peaks but has yet to ascend the Ten Absolute Realms. This stems from his failure to follow the ritual regulations for vestments. Scholars, take heed!\n\nWhen the minor kalpa cycles of heaven complete ten rotations, this Perfected One will once again become a concealed Perfected One among the ten directions.\n\nThe Scripture states: There was once a Dharma Master who studied the *Cavernous Mystery* retreat practices but had not yet severed worldly ties. He resided in the world, revering the precious scriptures, upholding the precepts, and cultivating the Dao, having accumulated much time in practice. Yet he mistakenly wore worldly ritual vestments into the mountains and thus failed to attain the Dao.\n\nAt that time, three jade maidens appeared, clad in nine-layered embroidered robes, with purple silk sashes. Their hair was styled in three coiled buns, adorned with orchid-embroidered kerchiefs. Their feet bore shoes with intertwined dragons and nine patterns, and in their hands, they held *Revolving Salvation* numinous banners, burning nine-colored harmonized incense. Playfully laughing, they said: \"The heavenly kalpa is nearing its end—who can resolve this?\"\n\nAn ancient immortal, seeing these jade maidens were no ordinary beings, bowed in reverence. The maidens initially ignored him, then said: \"You are an ancient worthy sovereign—why do you suddenly bow to us?\" The maidens rose, restless and uneasy. Soon, two more jade maidens arrived, each holding a scroll of wondrous scripture. They said: \"The Purple Tenuity Lady sent us bearing these eight precepts, issued from the midst of heaven, not to be shared with worldly people. The scriptural texts are secret and must not leave this place.\"\n\nThe Radiant Light Perfected One discussed the great and minor kalpas of heaven and earth, fearing that afterward, no remnant people would remain. Thus, he devised the minor kalpa salvation cycles, declaring that those who cultivate and keep these secrets may transcend. The eight solar terms are for presenting jade tablets.\n\nThe Radiant Light Perfected One composed the *Ode on Salvation for the Remnant People Across Kalpas*:\nCircling, traversing the cycle complete,\nRites touch the emptiness of non-action.\nAbove to the Numinous Clouds’ abode,\nBelow into the Abyssal Mystery Palace.\nDwelling round, square, level, and high,\nContemplating the precious chamber’s realm.\nThe salvations are not many,\nYet heaven’s cycles are distant in plain speech.\nWhen times flourish in the Primordial Accomplishment Palace,\nThe eight poles constantly come and go.\nThe three unite in one covenant—\nWhy is the transformative rite so late in coming?\nThe six directions arrive and depart,\nThe world’s destiny grows lofty and great.\nThe golden horse’s radiant essence flourishes,\nIts words portend prosperous cycles.\nWho treads the path of wisdom?\nReflecting on the primordial within and without.\nWhen the net’s discipline is exhausted at once,\nThe hundred-six numbers converge.\nCirculating, the Three Simplicities appear—\nRevered by the Heavenly Thearch.\nIf the past did not preserve the remnant,\nHeaven and earth’s cycles would overturn.\nHow to transcend this?\nGazing upward, recall the *Numinous Treasure’s* words.\nResponsive resonance may avert calamity,\nGrasping the tally and chanting the jade scriptures.\n\nDuring the salvation cycle, the Radiant Light Perfected One recited this ode, then summoned the Wind Earl and the lesser heavenly Perfected to assemble. As the kalpa’s cycle neared its end, he established the various minor heavens anew. Now, the Perfected One divides his form to become the Ten Heavenly Great Heavenly Worthies, surveying the Five Turbidities and the *Numinous Treasure* Ten Poles Perfected Ones. Those who now uphold the orthodox teachings and scriptures to attain the true Dao shall become these Ten Directional Perfected Ones. Though the texts have not yet been obtained, after witnessing the Dharma, one may ascend in broad daylight, transform the wheel, and become a minor heavenly Perfected One.\n\nThe Primordial Heavenly Worthy declared: The minor kalpa occurs when the Perfected Ones complete three celestial cycles, the heavenly numbers converge with earth, and the earthly numbers universally unite—this is called the minor kalpa salvation cycle. At that time, the sun, moon, and stars of the various heavens extinguish themselves, and the earth’s beams and frameworks lose their roots and origins. The Three Radiance Perfected Lords then transform and save the lesser sages who have not yet attained the true Dao, fearing the present cycle’s completion.\n\nIt is said that in former times, there was one *Mysterious Salvation* who emerged from the Ninefold Hidden Cavernous Mystery, self-generated and transformed. His radiant countenance resembled a youth’s. Holding the *Supreme Primordial Cavernous Clarity Numinous Treasure Twofold Simplicity True Scripture* in eight sections, he descended to inform the Five Peaks, suppressing disasters and calamities. Arriving at the stable and fiery lands, he sat and expounded the Eight Trigrams, establishing records to transmit to the Supreme Ultimate Perfected One.",
      "overlap_context": "upon the body. The cinnabar-written plain registers and revolving talismans are placed in a pouch and worn, to avert the convergence of the minor kalpa. These are to be kept secret.\n\nThe Primordial Heavenly Worthy expounded the Supreme’s *Wondrous Scripture’s Ninefold Talismanic Chapters*:\n1. The First: Expounding the Supreme’s *Wondrous Scripture Talisman*\n2. The Second: Expounding the Supreme’s *Mysterious Scripture Talisman*\n3. The Third: Expounding the Supreme’s *Numinous Scripture Talisman*",
      "start_char": 1238,
      "end_char": 2509,
      "start_sentence": 50,
      "end_sentence": 101,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.68215584754944,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝丹水飞术运度小劫妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "开三贤游戏观者，运度所以过尔。 一玉女持一卷镇炎泣川小劫玉字，言授晨乡天人夏禹者也。 可为众天教大灾之时，以往过也。 上古仙人今作太极，主得仙者记名迹也。 经言：真人从无尧之前，受重罗天玉女镇炎注烟小劫妙经，於今沦教度身之法。 其经也： 流周回，纲纪灭，山海藏，威神至。 去复来，日月食，魁＠化，今已至。 元始天尊言：太玄有六戊，辽清荡作，应轮转无极，教观虚遐，登高上，峻嶒无崖，十绝无立，浩浩空＠，冥劫移度，五星不备，宿倒罡翻，运周数终，日月无光，阳泽不和，时应失气，乾坤漏泄，五岳沦没，福地泛冈，得过阴凉，汇合为曩者也。 三界飞行，其时人民都悉无余，诸天大真於此炼过骨合道者，记名黄素，如是度数尽空洞，洞合为空而立大乡，向於十绝无崖也。 北极过去未来大数，并於大数，入於征空，数空造虚，其号难穷。 大罗真人言：道可言道，非可常论。 记言为名，亦可非名，可谓隐乎。 处下三者归於虚，大者入辽豁，细者达无幽，潜行空乡内，炜烨峒宫裹，四渎为洞门，曩宅是炼仙之大乡也。 元始太极真人、玄度真人，於小劫洞门演出运尽之道，以记洞之乡山，山有洞天，洞天有四门，是大洞门也，至此门，学自得过也。 太上大道君曰：元始天尊言，大小劫运尽，期度将至，道君故自言生名异流，种类相乘，高者居其上，下者还其底。 大者反归止，一元为其圆，小者定入於细，元在内中。 分形而生，或处高下，或入大小中生，或根立而生，或胎妊怀而生，或朔复而生，或变化自然而生，或在虚无无气而生。 初不见形影，沦幽而生，诸如此类，各有福应，并从变化，皆随本由。 其数尽，未若有福应多者，其度不绝，随类始生，若立根生者，益其光好。 与树七宝之箓生在灵宝国七宝林中，众仙大圣时往观照，大小劫尽，周而更化，得为人道中。 修学文旨，自见众真，灵宝光耀，普悬十人。 若是胎化者，前生福重，得生胎中，有形有体，魂魄结神，自然上皇之辞。 元始天尊、高上老君，於玄都上乡玉京少室，演出太上洞玄灵宝三十六部妙宝上经。 其时高上老君以有元虚之算寿，无极之数。 未至上皇，世运轮转，祚禄欲交，郁仪代谢，结璘旋行，高升劫仞，星辰分破，列宿更始，五岳变化，易更方镇，四渎荡除，海成山岳，水成巨石，蝖飞蠢动一切众生，成而倏忽度如三十二万种民。 元始老君演出五千文道德上下中经，三洞真文、众要妙经，教化后学。 其辞曰： 白石公，空姓也。 於人鸟山，奉受学法四十万言。 因停此山，建斋立直，菜素中餐，悔念罪福，开度一切，求脱厄世，得见太平。 朝礼诸天，拜谒十方。 仰谢玄真，罗梵众天，八种音声，烧香然灯，诵咏旋礼，十极念法，思惟次遣浮邪，论讲至妙，积学六百岁，还玄都武人山北室中。 复学二百年，太岁甲午五月二十四日，灵宝应见，忽有七宝飞天人十二人，乘飞云之舆，从九玄台下，即号位迎太虚元君，白石空洞真人，飘然飞登，上造九霞，教化众仙，学真仙之术法。 至太皇元年九月十日，有龟山王夫人，来受八生元录上经八卷。 赤松子其年十月五日受大洞宝章三十六部妙经，三洞真科道德要戒於玄都宝城山中，破金投鱼，蛟龙结钩，登坛尽一宝信为质。",
      "translated_text": "The opening of the Three Worthies’ playful contemplation marks the means by which the kalpic passage is thus traversed. A jade maiden held a scroll of *Small Kalpa Jade Script for Suppressing Fire and Weeping Rivers*, stating it was bestowed upon the celestial of the Morning Land, Xia Yu. This was to be used when the teachings of the heavens faced great disasters, to pass through them.\n\nAncient immortals now serve as the Supreme Ultimate, recording the names and traces of those who attain transcendence. The scripture states: Before the era of Wu Yao, Perfected Ones received from the Jade Maiden of the Heavy Net Heaven the *Wondrous Scripture for Suppressing Fire and Annotating Smoke in the Small Kalpa*, which remains the method for transforming and delivering the body.\n\nWithin this scripture:\nThe flowing cycles revolve, the guiding principles perish,\nMountains and seas conceal, numinous power arrives.\nDeparting and returning, sun and moon are eclipsed,\nThe *Kui* transforms—now it has come.\n\nThe Primordial Celestial Venerable said: The Great Mystery holds six *wu* earthly branches, vast and purifying in their workings, responding to the endless wheel of kalpas. Contemplating the distant and empty, ascending the lofty and towering, craggy and boundless, the Ten Absolutes stand ungrounded. Vast and empty, the dark kalpa shifts and passes. The five stars are incomplete, constellations invert and the Big Dipper overturns. The kalpic cycle nears its end, sun and moon lose their light, yang’s moisture fails to harmonize, seasons lose their qi. Heaven and earth leak and dissipate, the Five Peaks sink and vanish, blessed lands float as ridges. Those who pass through find cool shade, gathering into the past.\n\nThe Three Realms take flight, and at that time, the people are utterly annihilated. The great perfected of the heavens refine and pass through, their bones merging with the Dao, their names inscribed on yellow silk. Thus the kalpic reckoning exhausts the empty and cavernous, the cavernous merging into emptiness to establish the Great Land, turning toward the Ten Absolutes’ boundlessness.\n\nThe great kalpic reckoning of the past and future North Pole converges into the great reckoning, entering the empty and征-space. The reckoning of emptiness creates the void—its name is unfathomable.\n\nThe Perfected of the Great Net said: The Dao that can be spoken is not the constant Dao. What is recorded as a name may also not be a name—it may be called hidden. The three below return to the void; the great enter vast expanse; the subtle reach the unseen. Moving in concealment within the empty land, resplendent within the cavernous palace, the Four Waterways serve as cavernous gates. The past abode is the great land for refining transcendents.\n\nThe Primordial Supreme Ultimate Perfected One and the Perfected of Mysterious Salvation expounded at the cavernous gate of the Small Kalpa the Dao of the kalpic cycle’s exhaustion, recording the cavernous lands and mountains. Mountains hold cavern-heavens, and cavern-heavens have four gates—these are the great cavernous gates. Upon reaching this gate, learners pass through by their own attainment.\n\nThe Most High Great Dao Lord said: The Primordial Celestial Venerable declared that as the great and small kalpic cycles near their end and the kalpic passage approaches, the Dao Lord himself spoke of the divergence of names and streams, the clash of kinds. The lofty dwell above, the low return to the depths. The great reverse and return to stillness; the One Origin forms its circle. The small settle into subtlety, the origin residing within. Forms divide and arise—some dwell high or low, some are born within the great or small, some take root and grow, some gestate in the womb, some renew with the new moon, some transform and arise naturally, some exist in the formless and qi-less void. Initially unseen in form or shadow, born in hidden depths—all such kinds possess karmic responses, all arising from transformation, each following its original cause.\n\nWhen the reckoning is exhausted, those with greater karmic response do not perish but follow their kind to begin anew. Those who take root and grow enhance their brilliance and beauty. With the register of the Seven Treasures’ trees, they are born in the Seven Treasures Forest of the Numinous Treasure Realm, where multitudes of transcendents and great sages often visit to observe. When the great and small kalpas end and the cycle renews, they attain human form. Cultivating the scriptural teachings, they behold the assembled perfected. The radiance of the Numinous Treasure shines universally, illuminating ten people.\n\nThose born from the womb, having accumulated heavy blessings in past lives, gain form and body in gestation, their souls and spirits conjoining with the numinous, naturally reciting the verses of the Supreme August. The Primordial Celestial Venerable and the Most High Lord Lao, in the Jade Capital’s Lesser Chamber of the Mysterious Capital’s Upper Land, expounded the *Thirty-Six Sections of the Supreme Cavernous Mystery Numinous Treasure Wondrous Scripture*.\n\nAt that time, the Most High Lord Lao possessed the reckoning of the Primordial Void’s lifespan and the boundless kalpic count. Before the Supreme August era, as the kalpic wheel turned and the mandate neared its transition, Yu Yi succeeded and departed, Jie Lin revolved and moved. Ascending to the kalpic peak, stars shattered and constellations renewed. The Five Peaks transformed, their directional guardians exchanged; the Four Waterways were swept away, seas became mountains, waters turned to colossal stones. Worms flew and insects stirred—all beings, formed in an instant, passed like the thirty-two myriad kinds of people.\n\nThe Primordial Lord Lao expounded the *Five Thousand Characters of the Scripture on the Dao and Virtue*, the *Three Cavernous True Writings*, and the *Essential Wondrous Scriptures*, teaching and transforming later learners. Its verses say:\n\nThe White Stone Elder, of empty surname,\nOn Bird Mountain, received and studied the Dharma in four hundred thousand words.\nDwelling there, he established fasts and upright conduct,\nAte plain vegetarian meals, repented of sins and contemplated blessings,\nOpened the path to deliver all, seeking escape from the troubled world,\nTo behold the Great Peace.\nHe paid homage to the heavens, bowed to the ten directions,\nGazed in gratitude to the Mysterious Perfected,\nThe Brahma multitudes of the heavens,\nThe eight kinds of voices.\nBurning incense, lighting lamps,\nReciting and circumambulating, practicing the Ten Poles’ mindfulness,\nReflecting to dispel floating illusions,\nDiscoursing on the most wondrous,\nAccumulating study for six hundred years,\nReturning to the Mysterious Capital’s Warrior Man Mountain’s northern chamber.\nAgain studying for two hundred years,\nOn the twenty-fourth day of the fifth month in the *jiawu* year of the Great Year,\nThe Numinous Treasure manifested.\nSuddenly, twelve flying celestial beings of the Seven Treasures,\nRiding cloud-borne chariots,\nDescended from the Ninefold Mystery Terrace,\nAddressed and welcomed the Primordial Void Perfected Lord,\nThe White Stone Empty Cavern Perfected One,\nWho soared aloft,\nAscending to the Ninefold Radiance,\nTeaching and transforming the assembled transcendents,\nStudying the arts and methods of true transcendence.\nIn the first year of the Supreme August era, on the tenth day of the ninth month,\nThe Lady of Tortoise Mountain received the *Eightfold Register of the Eight Lives’ Primordial Scripture*.\nOn the fifth day of the tenth month of that year,\nRed Pine Master received the *Thirty-Six Sections of the Great Cavernous Treasure Chapters*,\nThe *Three Cavernous True Regulations*,\nAnd the *Essential Precepts of the Dao and Virtue*\nIn the Mysterious Capital’s Treasure Citadel Mountain.\nBreaking gold to cast fish,\nDragons and serpents formed hooks,\nAscending the altar to fulfill a precious pledge.",
      "overlap_context": "ious Salvation* who emerged from the Ninefold Hidden Cavernous Mystery, self-generated and transformed. His radiant countenance resembled a youth’s. Holding the *Supreme Primordial Cavernous Clarity Numinous Treasure Twofold Simplicity True Scripture* in eight sections, he descended to inform the Five Peaks, suppressing disasters and calamities. Arriving at the stable and fiery lands, he sat and expounded the Eight Trigrams, establishing records to transmit to the Supreme Ultimate Perfected One.",
      "start_char": 2509,
      "end_char": 3763,
      "start_sentence": 102,
      "end_sentence": 137,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.91444969177246,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝丹水飞术运度小劫妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "用飞云锦百尺、玉札二枚、金龙二口、鱼一双、剑二十四具、白素四十尺、五方明镜以度其文。 时罗梵众天八种音声、作三契颂，受学遂得真仙之道，说领劫仞玄洞宫，名日空洞元一君、太光君、老君、太一君所居乡邑，於无崖无渊细微象监魔罗，於大千三洞，本有太素真科，灵衣宝科至妙也。 一曰空洞真卫、大洞斋法、素灵赞经为颂，作罗天玄音洞斋法，玉京山经步虚颂，梵天音洞神斋法，八素阴阳经，中夏音大洞斋法，绝迹崖隐，远遁世人，长斋服食，咽元充气，不参世间。 非其服食长斋流延，不同为讲。 十方上圣天尊观人善恶，名曰高上至真玄妙斋法。 建斋独立之道，太虚元君於人乌山奉受太上洞玄梵天威仪罗天大戒，悔谢亿曾祖考七世父母生死罪福轮转胎化之厄，愿得长居无为，烧香燃灯。 日中一食，昼夜六时悔谢前后以来玄祖父母，咸得上登天堂，化生十方，与玄都同行。 诵咏三洞真文，当尔之时，灵宝真人云光降，十极飞天人神男玉女各十许人，罗梵众音七宝光耀焕烂玉京之中，诵三契罗天颂。 十极真人各颂一契，梵天颂飞天人神男玉女共赠诗一篇，太虚元君即下座礼拜天尊，因奉受诗云：章灵妙高真，元君以为胜。 太虚元君於玄中答诗一篇，竟奄然不见。 众真所向，白石公学得真也。 高上真人罗天颂三契 一。 六度生梵迹，至真出虚玄。 空洞向灵霄，仰秀十极宾。 形受奇妙相，辽辽造登贤。 执节侍营枝，被褐灵宝晨。 解散飞云结，耀光照罗天。 通身黄金体，颈有七宝圆。 足蹑莲华行，旋游十极问。 玄都邑玉京，自然赤字文。 玉诀非常音，法轮是真言。 妙哉高上教，道建五千文。 众经归首目，豁落洞玄真。 德合超然去，尘俗缅飘因。 二。 郁郁空洞乡，岧岧天宝台。 漻漻众真降，万劫为一期。 子抱玉真经，吟咏过三灾。 五苦一时迸，七祖化无为。 上造紫微官，元箓方宝持。 太虚非为远，合炼吐邪疑。 躯精浊损次，朝礼高上师。 三。 玄洞空中去，虚虚豁无向。 罗天生洞宅，十圣俱斋景。 五岳得安镇，四渎慧受象。 重飞普衔无，蠢动无算等。 九真还丹录，飞行造玉京。 万劫倏忽间，亿载在须顷。 超度众根难，流霞登蒙陇。 四。 道非道，非常道，名非名，非常名。 空非空，非常空。 玄非玄，非常玄。 故知道玄虚空，名自妙也。 弥纶至濯，辽豁无穷，上包大罗於无崖，下入无渊於细微，亦象监魔罗於大千，魔罗难察大罗。 宝真言高上演教，众真劝化，天灵宝玄经，至妙之秘文，度智三十二万种民，三一荡除，百官开度，演出真文，以化下愚，承奉禁忌，自蒙度脱。 苟无其质，亦免地狱之灾。 道有五千文，至真妙经，此为一文。 大洞三十九章，名为一文。 洞玄灵宝真文玉字罗天上经，此是一文。 三皇内音，名为一文。 龙飞九道，名曰得道之迹。 学士熟看五千文、洞玄真文、大洞三十九章。 此经从元始以来，秘之金阙，至于上元，经道欲行，扫除清浊，戒人罪福，通悟流俗，至道不远，安在太空。 大洞三十九章，本三十九言，高上老君演作三十九篇，以授素黄太虚元君空洞真文。 积学一千六百二十四日，众仙归仰，真道遂成。 空洞真人瞻观六度，复演出大劫一卷，教化众仙，至经高妙，莫归於本。",
      "translated_text": "To transmit its texts, they employed:\nA hundred feet of flying-cloud brocade,\nTwo jade tablets,\nTwo golden dragons,\nA pair of fish,\nTwenty-four swords,\nForty feet of white silk,\nAnd the Five Directions’ luminous mirrors.\n\nAt that time, the assembly of Brahma and the multitudes of heavens intoned the Eight Kinds of Celestial Sounds, chanting the Three Contractual Hymns. Through this study, they attained the Dao of true transcendence. They expounded upon the profound Cavernous Palace of Eon’s Height, naming it the abode of the Empty Cavern Primordial Unity Lord, the Supreme Radiance Lord, the Old Lord, and the Supreme Unity Lord—dwelling in villages beyond bounds, beyond abysses, in the subtle images of Mara’s realm. Across the Great Thousand’s Three Caverns, the Primordial Simplicity True Regulations and the Numinous Robe Treasure Regulations existed in utmost subtlety.\n\nFirst: the *True Guardians of the Empty Cavern*,\nThe *Great Cavern Purification Rites*,\nAnd the *Hymns of Simplicity and Numinosity* as odes.\nThey performed the *Mysterious Sound Cavern Purification of the Brahma-Heaven Net*,\nThe *Jade Capital Mountain Scripture’s Pace-the-Void Hymns*,\nThe *Brahma-Heaven Sound Cavern Spirit Purification*,\nThe *Eight Simplicities Yin-Yang Scripture*,\nAnd the *Central Lands’ Great Cavern Purification*.\nThey withdrew from worldly traces, secluding far from mortals,\nPracticing perpetual purification, ingesting and absorbing qi,\nRefusing to partake in worldly affairs.\nThose who did not maintain such purification and ingestion could not join the discourse.\n\nThe Ten Directions’ Supreme Sage Heavenly Worthies observed human good and evil, calling this the *Loftiest and Most Mysterious Purification Rite of the Supreme Perfected*. The independent Dao of establishing purification: the Primordial Void Lady, on Black Crow Mountain, received the *Supreme Cavernous Mysterious Brahma-Heaven Dignity Rituals and the Brahma-Heaven Net Great Precepts*. She repented and offered gratitude for the karmic fortunes and transgressions of her ancestors—seven generations of parents—bound in the cycles of birth, death, and rebirth, aspiring to dwell perpetually in non-action. She burned incense and lit lamps, eating once at midday, repenting and offering gratitude day and night in six periods for her primordial ancestors, that all might ascend to the heavenly halls, transform and be reborn across the Ten Directions, and walk alongside the Mysterious Capital.\n\nAs they recited the Three Caverns’ true texts, at that moment, the Numinous Treasure Perfected Ones descended in cloud-light. Ten Poles’ flying transcendents, divine youths, and jade maidens—each in tens—alongside Brahma’s multitudes, resounded in seven-jeweled radiance, illuminating the Jade Capital as they chanted the Three Contractual Brahma-Heaven Hymns. The Ten Poles’ Perfected Ones each intoned one contract, while Brahma’s hymns and the flying transcendents, divine youths, and jade maidens together offered a poem. The Primordial Void Lady descended from her seat to bow before the Heavenly Worthy, then received the poem, which read:\n\n*\"The chapter’s numinous, wondrous, and lofty,\nThe Primordial Lady deems it supreme.\"*\n\nThe Primordial Void Lady responded from the Mysterious Center with a poem of her own, and suddenly, all vanished. The assembled Perfected Ones turned their gaze—White Stone Master had attained the truth.\n\n**Three Contractual Hymns of the Supreme Perfected Ones of the Brahma-Heaven Net**\n\n**I.**\nThe Six Perfections trace Brahma’s path,\nThe utmost Perfected emerges from the Void’s mystery.\nThe Empty Cavern faces the Numinous Empyrean,\nGazing up at the Ten Poles’ guests.\nForms receive wondrous and marvelous appearances,\nVast and boundless, ascending to sagacity.\nHolding the staff, they attend the sacred branches,\nClad in coarse cloth at the Numinous Treasure’s dawn.\nUnraveling the flying clouds’ knots,\nTheir radiance illuminates the Brahma-Heaven Net.\nTheir bodies become golden,\nNecks adorned with seven-jeweled circles.\nFeet treading lotus steps,\nThey wander and inquire across the Ten Poles.\nThe Jade Capital’s village in the Mysterious Capital,\nNaturally inscribed with vermilion characters.\nJade tokens sound uncommon tones,\nThe Dharma-wheel is the true speech.\nWondrous indeed, the Supreme Teaching,\nThe Dao established in the Five Thousand Characters.\nAll scriptures return to this chief and eye,\nVast and open, the Cavernous Mystery’s truth.\nVirtue aligns, transcending beyond,\nWorldly dust left far behind.\n\n**II.**\nLush and verdant, the Empty Cavern’s land,\nTowering, the Heavenly Treasure Terrace.\nFlowing and clear, the assembled Perfected descend,\nTen thousand kalpas as one epoch.\nEmbracing the Jade Perfected Scripture,\nChanting through the Three Calamities.\nThe Five Sufferings burst forth at once,\nSeven generations transform into non-action.\nAscending to the Purple Tenuity Palace,\nThe Primordial Registers held as treasures.\nThe Primordial Void is not distant,\nRefining and expelling doubts of the perverse.\nThe body’s essence, turbid and worn,\nPay homage to the Supreme Master.\n\n**III.**\nThe Mysterious Cavern departs into the Void,\nEmpty and vast, without direction.\nThe Brahma-Heaven Net births the Cavern’s abode,\nTen Sages together in purification’s splendor.\nThe Five Peaks secure peace,\nThe Four Waterways receive wisdom’s image.\nAgain flying, they universally bear nothing,\nAll creatures, innumerable, equal.\nThe Nine Perfected’s Returned Elixir Record,\nFlying to the Jade Capital.\nTen thousand kalpas in an instant,\nCountless eons in a moment.\nTranscending the roots of the multitude’s difficulties,\nRiding rosy clouds to ascend Menglong’s ridges.\n\n**IV.**\nThe Dao that is not the Dao is not the constant Dao,\nThe name that is not the name is not the constant name.\nThe Void that is not the Void is not the constant Void,\nThe Mystery that is not the Mystery is not the constant Mystery.\nThus, know the Dao, the Mystery, the Void—\nNames are inherently wondrous.\nEncompassing and cleansing the utmost,\nVast and boundless, without end.\nAbove, embracing the Great Net in boundlessness,\nBelow, entering the abyssal in subtlety,\nAlso observing Mara’s images across the Great Thousand—\nMara finds the Great Net difficult to fathom.\n\nThe Treasure True Speech expounds the Supreme Teaching,\nThe assembled Perfected exhort and transform.\nThe *Heavenly Numinous Treasure Mysterious Scripture*,\nThe utmost secret texts,\nLiberate thirty-two myriad kinds of beings.\nThe Three Ones sweep away,\nThe Hundred Officials open the path,\nElaborating the true texts\nTo transform the benighted.\nUpholding prohibitions and taboos,\nThey naturally attain liberation.\nWithout such qualities,\nThey still avoid hell’s calamities.\n\nThe Dao has the *Five Thousand Characters*,\nThe utmost Perfected’s wondrous scripture—this is one text.\nThe *Great Cavern’s Thirty-Nine Chapters*—this is one text.\nThe *Jade Characters of the Cavernous Mystery Numinous Treasure True Texts of the Brahma-Heaven Net*—this is one text.\nThe *Three Sovereigns’ Inner Sounds*—this is one text.\nThe *Nine Dragons’ Flight*—this is the trace of attaining the Dao.\nScholars must study thoroughly the *Five Thousand Characters*,\nThe *Cavernous Mystery True Texts*,\nAnd the *Great Cavern’s Thirty-Nine Chapters*.\n\nThis scripture, since the Primordial Beginning, was hidden in the Golden Portal. By the Upper Prime, when the Dao’s scriptures were to spread, they swept away purity and turbidity, admonishing people on sin and fortune, enlightening the worldly, and revealing that the utmost Dao is not distant—it abides in the Great Void.\n\nThe *Great Cavern’s Thirty-Nine Chapters* originally consisted of thirty-nine words. The Supreme Old Lord elaborated them into thirty-nine chapters, bestowing them upon the Primordial Simplicity’s Primordial Void Lady as the *Empty Cavern True Texts*. After studying for one thousand six hundred twenty-four days, the assembled transcendents revered them, and the true Dao was accomplished. The Empty Cavern Perfected One, gazing upon the Six Perfections, further expounded the *Great Kalpa* in one scroll, teaching and transforming the assembled transcendents. The scripture’s loftiness and subtlety return to their origin.",
      "overlap_context": "y of Tortoise Mountain received the *Eightfold Register of the Eight Lives’ Primordial Scripture*.\nOn the fifth day of the tenth month of that year,\nRed Pine Master received the *Thirty-Six Sections of the Great Cavernous Treasure Chapters*,\nThe *Three Cavernous True Regulations*,\nAnd the *Essential Precepts of the Dao and Virtue*\nIn the Mysterious Capital’s Treasure Citadel Mountain.\nBreaking gold to cast fish,\nDragons and serpents formed hooks,\nAscending the altar to fulfill a precious pledge.",
      "start_char": 3763,
      "end_char": 4999,
      "start_sentence": 138,
      "end_sentence": 196,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.15814018249512,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝丹水飞术运度小劫妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "太真真科、高上科法、太素真科、太虚元君空洞真秘、灵宝玉字、洞玄真文，初生三十九章，玉字所演三十六部妙经，经文渊微，出自道言，诸天真人宗奉赤书，观於梵迹。 所以真人曰：学大乘之业，礼拜玉字，洞玄真文，位证高真，上名梵录，十极真仙，展转超证，本为空洞。 真人亦为十方真人，佐理十天，梵天名十极真人，至真罗天音是名为道。 东方无极世界虚中之虚妙相真人宝光世界开度虚中一切颂一契 高岳绝幽岭，中道有妙言。 罗天空洞章，飞造登九玄。 足蹑云纲行，俯眄上皇真。 奉戒升虚无，吟咏灵宝篇。 南方无极世界空中之空无上真人灵光世界开度空中一切颂一契 虚真是玄真，至道无为尊。 元气訅虚寂，龙倒朱凤翻。 惟采秀琼芝，奉戒入云门。 飞罗戏龙虎，愿结前世绿。 西方无极世界玄中之玄太浩真人素光世界开度玄中一切颂一契 紫微玄中玄，独立体自然。 瑞相七十二，头光五色圆。 焕烂照十方，飞云散香烟。 叉手向梵天，得见无极篇。 北方无极世界无中之无玄录真人玄光世界开度无中一切颂一契 灵耀空中向，高妙何为远。 玉晨非质器，灾害以旋反。",
      "translated_text": "The *Supreme Perfection’s True Regulations*, the *Highest Regulations and Methods*, the *Great Simplicity’s True Regulations*, the *Primordial Void Lady’s Empty Cavern True Secrets*, the *Numinous Treasure Jade Scripts*, and the *Great Cavern’s True Texts*—these thirty-nine chapters first emerged, while the Jade Scripts expounded thirty-six divisions of wondrous scriptures. Their profound and subtle texts arose from the Dao’s own words, and all the Heavenly Perfected revered the Vermilion Writ, gazing upon the traces of the Brahma-realm.\n\nThus the Perfected One declared: To cultivate the Great Vehicle’s practice, one must venerate the Jade Scripts and the *Great Cavern’s True Texts*, thereby attaining the rank of Highest Perfected. Their names are inscribed in the Brahma-register, and the Ten Poles’ True Immortals progressively ascend through verification, all rooted in the Empty Cavern. The Perfected One also serves as the Ten Directions’ Perfected, assisting in the governance of the Ten Heavens. The Brahma-Heaven’s name for them is the Ten Poles’ True Immortals, and the True Net Heaven’s sound is called the Dao.\n\n**Hymn of the Eastern Infinite Realm’s Void-within-Void Wondrous Form Perfected One, Precious Radiance Realm, for the Liberation of All in the Void (One Contract)**\nLofty peaks beyond the darkest ridge,\nMidway lies wondrous speech.\nThe Empty Cavern’s Net Heaven’s chapters,\nSoaring to ascend the Nine Mysteries.\nFeet treading the cloud-net’s path,\nGazing down upon the Supreme August Perfected.\nUpholding precepts to ascend the Void-Nothing,\nChanting the *Numinous Treasure’s* verses.\n\n**Hymn of the Southern Infinite Realm’s Void-within-Void Supreme Perfected One, Numinous Radiance Realm, for the Liberation of All in the Void (One Contract)**\nThe Void-True is the Mysterious True,\nThe utmost Dao reveres non-action.\nPrimal qi abides in emptiness and stillness,\nDragons inverted, vermilion phoenixes soaring.\nOnly pluck the lush jade mushrooms,\nUphold precepts to enter the Cloud Gate.\nSoaring nets play with dragons and tigers,\nVowing to bind past-life karmic threads.\n\n**Hymn of the Western Infinite Realm’s Mysterious-within-Mysterious Supreme Vastness Perfected One, Plain Radiance Realm, for the Liberation of All in the Mysterious (One Contract)**\nThe Purple Tenuity’s mysterious-within-mysterious,\nStanding alone, embodying spontaneity.\nAuspicious signs seventy-two,\nHead’s radiance five-colored and round.\nResplendent, illuminating the ten directions,\nFlying clouds disperse incense smoke.\nHands clasped toward Brahma-Heaven,\nAttaining sight of the *Infinite’s* chapters.\n\n**Hymn of the Northern Infinite Realm’s Nonbeing-within-Nonbeing Mysterious Record Perfected One, Mysterious Radiance Realm, for the Liberation of All in the Nonbeing (One Contract)**\nNuminous brilliance faces the void,\nHow could the lofty and wondrous be distant?\nThe Jade Dawn is no material vessel,\nCalamities thus reverse and retreat.",
      "overlap_context": "to thirty-nine chapters, bestowing them upon the Primordial Simplicity’s Primordial Void Lady as the *Empty Cavern True Texts*. After studying for one thousand six hundred twenty-four days, the assembled transcendents revered them, and the true Dao was accomplished. The Empty Cavern Perfected One, gazing upon the Six Perfections, further expounded the *Great Kalpa* in one scroll, teaching and transforming the assembled transcendents. The scripture’s loftiness and subtlety return to their origin.",
      "start_char": 4999,
      "end_char": 5463,
      "start_sentence": 197,
      "end_sentence": 217,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.80921745300293,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝丹水飞术运度小劫妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "金门五苦经，胎炼永以断。 流珠向上宫，亿劫岂云晚。 东北方无极世界玄州上乡真人开度玄州上乡无极一切颂一契 蔼蔼洞林肃，芬然升太霞。 鸣玉服天荫，云气郁嵯峨。 赤界众道眉，长生为辟邪。 奉啸黄庭箓，得道还度家。 东南方无极世界弥劫真人净罗天中开度世界一切颂一契 仰观劫仞乡，玉京玄中虚。 巍峨赤松子，上造如太霞。 游沈过众生，太一乘云舆。 少乐高尚法，七祖生天居。 西南方无极世界无量真人郁罗世界开度无量一切颂一契 耀光出大洞，真神何徘徊。 左顾龙衔辔，右眄虎吐威。 朱凤交观集，螣蛇登大魁。 九宫生八卦，十极游太微。 西北方无极世界化生真人波罗光世界开度波罗一切颂一契 飞步蹑上官，七元长生道。 愿乐一世人，腾身避苦恼。 削除百曾罪，徊转造五老。 定名玉札篇，咸念长自保。 上方无极世界亿亿之劫上皇真人九光灵宝世界开度元中一切颂一契 太霞观曾微，绝岳幽中岭。 岩选交洞乡，玄州众仙并。 游行三周过，更炼易光象。 还期十极真，云行登玉京。 下方无极世界算数养生真人太一金光世界开度算数一切颂一契 归道妙中真，梵天有灵篇。 虚无演玉字，用以教后贤。",
      "translated_text": "**The Scripture of the Five Sufferings of the Golden Gate,**\nSevered forever through womb-refinement.\nFlowing pearls ascend to the Upper Palaces—\nHow could aeons be called late?\n\n**Hymn of the Perfected One of the Upper Village of Mysterious Province, Northeastern Infinite Realm, for the Liberation of All in the Upper Village of the Infinite (One Contract)**\nVerdant forests in solemn stillness,\nFragrant, ascending to the Great Rosy Clouds.\nJade pendants chime beneath Heaven’s shade,\nCloudy vapors dense and towering.\nThe red realm’s host of Daoists—brows arched—\nAttain long life to ward off evil.\nChanting the *Yellow Court Register*,\nThey achieve the Dao and return to ferry their kin.\n\n**Hymn of the Perfected One of Eon’s End, Southeastern Infinite Realm, for the Liberation of All in the Pure Net Heaven (One Contract)**\nGazing upward to the land of kalpas’ height,\nThe Jade Capital lies void within the Mysterious.\nMajestic, the Red Pine Master\nAscends as if to the Great Rosy Clouds.\nWandering and sinking past all beings,\nThe Great One rides the cloud-chariot.\nDelighting in the lofty and noble Dao,\nSeven ancestors are born in celestial dwellings.\n\n**Hymn of the Boundless Perfected One, Southwestern Infinite Realm, for the Liberation of All in the Luxuriant Net (One Contract)**\nRadiant light emerges from the Great Cavern—\nWhy do true spirits linger in hesitation?\nLeft, the dragon holds the reins in its jaws;\nRight, the tiger bares its might.\nCrimson phoenixes gather in mutual regard,\nSerpent-spirits ascend the Great Chief.\nThe Nine Palaces generate the Eight Trigrams,\nThe Ten Poles roam the Grand Tenuity.\n\n**Hymn of the Transformative Birth Perfected One, Northwestern Infinite Realm, for the Liberation of All in the Radiant Pāramitā (One Contract)**\nTreading the flying steps of the Upper Offices,\nThe Seven Primes’ path of long life.\nYearning for the people of this world,\nThey soar to escape suffering and affliction.\nErasing the hundredfold sins of past lives,\nThey circle back to the Five Elders.\nInscribed in the *Jade Tablet* of fixed names,\nAll vow to preserve themselves forever.\n\n**Hymn of the Supreme August Perfected One of Myriad Aeons, Upper Infinite Realm, for the Liberation of All in the Primordial Center of the Ninefold Radiant Numinous Treasure (One Contract)**\nGazing at the Great Rosy Clouds’ subtle traces,\nBeyond the peaks of the secluded central ridge.\nCaverns intersect in the Mysterious Province,\nWhere the host of immortals assembles.\nWandering past three revolutions,\nFurther refining to transform their luminous forms.\nAwaiting the Perfected Ones of the Ten Poles,\nThey ascend in clouds to the Jade Capital.\n\n**Hymn of the Longevity-Cultivating Perfected One of Countless Calculations, Lower Infinite Realm, for the Liberation of All in the Golden Radiance of the Great One (One Contract)**\nReturning to the wondrous truth within the Dao,\nThe Brahma-Heaven holds the numinous scripture.\nThe void expounds the jade characters,\nTo instruct later worthies.",
      "overlap_context": "endent, illuminating the ten directions,\nFlying clouds disperse incense smoke.\nHands clasped toward Brahma-Heaven,\nAttaining sight of the *Infinite’s* chapters.\n\n**Hymn of the Northern Infinite Realm’s Nonbeing-within-Nonbeing Mysterious Record Perfected One, Mysterious Radiance Realm, for the Liberation of All in the Nonbeing (One Contract)**\nNuminous brilliance faces the void,\nHow could the lofty and wondrous be distant?\nThe Jade Dawn is no material vessel,\nCalamities thus reverse and retreat.",
      "start_char": 5464,
      "end_char": 5960,
      "start_sentence": 218,
      "end_sentence": 247,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.530555963516235,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝丹水飞术运度小劫妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "真人不见形，和光气洞尘。 玉札奉上皇，愿以赐要文。 十篇十方真人造斋用烧香谢文，步虚咏明灯祝灯祝愿，别出众经。 太虚元君於是虚皇五年七月七日，下游戏众天，看观善恶，见群精魔鬼，交逸天下，横害良民，强绝人命，太上高远，三清广大，千妖万邪，假作正真。 风雨水旱，不应节卦，元君出现於人鸟山，演出《洞玄真文玉诀妙经》，分作三十六卷，威仪法式，安镇五岳，以察天灵。 今作十表卦，人鸟山浩洞太乡玄洞室中，玄尊至宝中教，有仙骨之类，当见其文，隐学思惟，奉行其科，世间供养别法，世经所纪三十六部妙经，白石崆峒真人受三十六万言，本有三十六卷，号曰三十六部尊经，有三十六卷，言字无定。 经卷首目，出大洞大小劫本业妙经。 其中字天音百神内名是也。 今出学法所修太虚元君演出中品妙经。 太虚元君曰：经道欲见，学者精情感至，十位真人使飞天自授篇目，日更新妙，勤修得真道。 飞天人神男玉女颂曰： 浩浩清霄藻，渺渺玄元阿。 沈纪放自然，妙度九天罗。 绝迹空气灵，千劫不为多。 精光普朗莹，洞彻照一躯。 玉皇高尊降，解脱百曾忧。 高上弟子太虚空洞真人颂曰： 焕烂无崖迹，旷豁虚寂乡。 俯眄紫微台，因缘俗形象。 手持洞章文，相与戏玉景。 天尊飞登真，释散脱世网。 真人曰：道有太上清净元洞真文玉字妙经，太上清净元洞玉诀，罗梵众音妙经，清净飞行九元洞妙经，清净飞行七生化度元洞妙经，清净元洞灵章上经，清净元洞轮转五道真上经，清净元洞玄轮上经，清净元洞三十六垒众音真经，清净元洞凤止妙纪洞真道迹妙经，清净丹水飞术胡语妙经，玉文威仪秘经。 大度真人无极丈人，於劫仞乡日演出丹水飞诀法，授与紫微王夫人，夫人作礼奉受。 十方真人於此同被极空洞大灵章，天道真文三十六部妙经，梵音目录竟，真人等信受奉行。 丹水飞法用药十二种 绛陵珠子　口诀是丹砂。 白马玄通　口诀是石钟乳。 玄微通身　口诀是白石英。 紫度炎光　口诀是紫石英。 黄丞彻身　口诀是硫黄。 玄命益算　口诀是太一禹余。 流英月精　口诀是云母粉。 青戊还精　口诀是白术。 却毒温身　口诀是细辛。 枯道冬华　口诀是茯苓。 丹侍　口诀是巨胜。 延年度命　口诀是黄精。 已上各二十四觔。 上药十二种，各各自治。 梼药必使精好者，去人问长斋一百二十四日。 铜臼捣之，草药各五万杵，石药各十万杵。 治都成，并合，以铜臼白蜜先和，梼十二万杵，药半成以来，水银十二石着铜釜中，铜盖盖之，白石英调作泥，泥鳌，鳌作两口，屋覆，勿使俗人鸟雀鸡犬见之。 薪用栢叶为火，复水银消尽。 药成，阴曝百日，开之出着金银玉器中。 服之斋，可服十二丸，如巨胜大，即飘然飞登万阶，十方真人众天真人服丹水飞术所得真也。 太上老君养生观化十方，观愚戒顽，出妙文授教众天大度真人、罗天法师。 玄极太真以文法表显诸天十方灵空，真人以嘉平二十三年九月九日，游劫仞玄都，登观玉景人鸟，奉谒太极，朝礼太度真人。 竟，谓问求法下愚，缠绵邪浊，未敢上陈。 枯骨含元之始，轮转胎化，误生人道，腐臭骨肉。 比蒙灵泽玄降，启拔有心，灵尊高妙，养育群生，普度一切。",
      "translated_text": "The Perfected One leaves no visible form,\nHarmonizing light and qi to permeate the dust.\nPresenting jade tablets to the Supreme August,\nBeseeching the bestowal of essential texts.\n\n**Ten Chapters by the Ten Directions’ Perfected Ones for Offering Rituals, Burning Incense, Expressing Gratitude, Pacing the Void, Chanting Hymns, and Illuminating Lamps—Separately Extracted from the Host of Scriptures**\n\nIn the fifth year of the Void Sovereign’s reign, on the seventh day of the seventh month, the Primordial Lady of the Great Void descended to sport among the myriad heavens. Observing the good and evil therein, she beheld legions of demonic spirits and malevolent ghosts rampaging across the world, wantonly harming the innocent and violently severing lives. Though the Most High remained distant and the Three Clarities vast, countless demons and myriad evils masqueraded as true and upright. Wind and rain, drought and flood, no longer aligned with the hexagrams’ seasons. The Primordial Lady manifested upon Mount Reniao, where she expounded the *Wondrous Scripture of the Jade Formula of the Cavernous Mystery’s True Text*, dividing it into thirty-six scrolls. With its majestic rites and models, it pacified the Five Peaks to oversee the numinous spirits of heaven.\n\nNow, ten hexagrams are composed upon Mount Reniao, within the vast Cavernous Great Realm’s Mysterious Cavern Chamber. Amidst the teachings of the Mysterious Venerable’s supreme treasure, those with immortal bones shall behold its text. Concealing themselves to study and contemplate, they uphold its precepts. The world’s offerings and alternate methods, as recorded in the thirty-six sections of the wondrous scriptures, were received by the Perfected One of White Stone Kongdong as thirty-six myriad characters, originally comprising thirty-six scrolls—entitled the *Thirty-Six Sections of the Venerable Scriptures*—whose words and graphs remain unbounded. The scrolls’ opening titles derive from the *Great Cavern’s Scripture of the Fundamental Karma of Great and Small Kalpas*.\n\nWithin these characters lie the celestial sounds and the inner names of the hundred spirits. Now, the methods for study and cultivation emerge as the Primordial Lady of the Great Void expounds the *Middle-Grade Wondrous Scripture*.\n\nThe Primordial Lady of the Great Void declared: To behold the scripture of the Dao, the scholar must refine their essence and stir profound devotion. The Ten Ranks of Perfected Ones shall dispatch flying immortals to bestow the texts anew each day. Through diligent cultivation, one attains the true Dao.\n\n**Hymn of the Flying Heavenly Men and Jade Maidens:**\nVast and clear, the azure expanse adorned,\nBoundless, the Mysterious Origin’s embrace.\nSinking into the records of spontaneity,\nWondrously traversing the nine heavens’ net.\nLeaving no trace, the spirit of empty qi,\nEven a thousand kalpas would not be too long.\nRadiant brilliance universally gleams,\nPenetrating and illuminating the singular body.\nThe August Jade Sovereign descends in majesty,\nDissolving a hundredfold layers of sorrow.\n\n**Hymn of the Supreme Disciple, the Perfected One of the Great Void’s Cavernous Emptiness:**\nResplendent, without limit or trace,\nVast and open, the realm of emptiness and stillness.\nGazing down upon the Purple Tenuity’s terrace,\nEntangled in the karmic forms of the vulgar.\nHolding the texts of the Cavernous Chapters,\nSporting together amidst the jade radiance.\nThe Heavenly Venerable ascends in flight,\nDissolving and casting off the world’s snares.\n\nThe Perfected One declared: The Dao possesses the *Supreme Clarity’s Pure and Primordial Cavernous True Text of Jade Characters Wondrous Scripture*, the *Supreme Clarity’s Pure and Primordial Cavernous Jade Formula*, the *Wondrous Scripture of the Luminous Hosts’ Sounds*, the *Pure Clarity’s Flying Ninefold Cavernous Wondrous Scripture*, the *Pure Clarity’s Flying Sevenfold Transformations and Salvations of the Primordial Cavernous Wondrous Scripture*, the *Upper Scripture of the Pure and Primordial Cavernous Numinous Chapters*, the *Upper Scripture of the Pure and Primordial Cavernous Wheel-Turning of the Five Paths*, the *Upper Scripture of the Pure and Primordial Cavernous Mysterious Wheel*, the *True Scripture of the Pure and Primordial Cavernous Thirty-Six Ramparts’ Hosts of Sounds*, the *Wondrous Scripture of the Pure and Primordial Cavernous Phoenix’s Cessation and Wondrous Records of the Dao’s Traces*, the *Wondrous Scripture of the Pure and Cinnabar Waters’ Flying Techniques in Hu Language*, and the *Secret Scripture of Jade Texts’ Majestic Rites*.\n\nThe Great Salvation Perfected One, the Boundless Venerable, expounded the *Method of the Flying Cinnabar Waters* in the Kalpa-Measuring Realm on the sun’s day, bestowing it upon the Lady of the Purple Tenuity. The Lady received it with reverence.\n\nThe Perfected Ones of the Ten Directions, together enveloped by the *Great Numinous Chapters of the Cavernous Emptiness of the Ultimate Void* and the *Thirty-Six Sections of the Heavenly Dao’s True Texts in Brahma Sounds*, completed the catalog of titles. The Perfected Ones faithfully received and upheld them.\n\n**The Flying Cinnabar Waters Method’s Twelve Medicinal Ingredients:**\n1. **Crimson Mound Pearl** – Oral formula: cinnabar.\n2. **Black Horse’s Mysterious Passage** – Oral formula: stalactite.\n3. **Mysterious Subtlety’s Permeating Body** – Oral formula: white quartz.\n4. **Purple Ascent’s Blazing Radiance** – Oral formula: purple quartz.\n5. **Yellow Minister’s Penetrating Body** – Oral formula: sulfur.\n6. **Mysterious Life’s Prolonging Calculation** – Oral formula: Taiyi’s leftover jade.\n7. **Flowing Bloom’s Moon Essence** – Oral formula: mica powder.\n8. **Green Warrior’s Returning Essence** – Oral formula: white atractylodes.\n9. **Repelling Poison’s Warming Body** – Oral formula: asarum.\n10. **Withered Dao’s Winter Blossom** – Oral formula: poria.\n11. **Cinnabar Attendant** – Oral formula: sesame.\n12. **Prolonging Years and Extending Life** – Oral formula: polygonatum.\n\nEach of the above, twenty-four *jin* in weight. The twelve superior medicines each govern their own functions. The ingredients must be of the finest quality. The practitioner must first undertake a fast of one hundred twenty-four days, avoiding inquiries from others. Pound the ingredients in a bronze mortar: fifty thousand pestles for herbal medicines, one hundred thousand for mineral medicines. Once refined, combine them, first mixing with white honey in a bronze mortar for one hundred twenty thousand pestles. When the medicine is half-completed, place twelve *shi* of mercury into a bronze cauldron, sealing it with a bronze lid. Use white quartz to prepare the mud, sealing the cauldron’s seams. Construct two openings in the cauldron, covering it with a roof to prevent vulgar persons, birds, fowl, chickens, or dogs from seeing it. Use cypress leaves for fuel, replenishing until the mercury is entirely sublimated. Once the medicine is complete, dry it in the shade for one hundred days. Upon opening, store it in vessels of gold, silver, or jade.\n\nWhen taking the medicine, fast and consume twelve pills, each the size of a sesame seed. One shall then float aloft, ascending myriad stages. The Perfected Ones of the Ten Directions and the host of heavenly Perfected Ones attain truth through the *Flying Cinnabar Waters Technique*.\n\nThe Supreme Lord Lao observed the transformations of life across the Ten Directions, perceiving the foolish and admonishing the obstinate. He expounded wondrous texts to instruct the Great Salvation Perfected Ones of the Myriad Heavens and the Dharma Masters of the Net of Brahma. The Mysterious Ultimate’s Supreme Perfected One manifested the textual methods to illuminate the Ten Directions’ numinous voids. In the twenty-third year of the Jiaping era, on the ninth day of the ninth month, the Perfected One wandered the Kalpa-Measuring Mysterious Capital, ascending to behold the jade radiance of Mount Reniao. Paying homage to the Supreme Ultimate, he presented himself before the Great Salvation Perfected One.\n\nUpon completion, he addressed those seeking the Dharma among the benighted, entangled in defilement and impurity, who dared not ascend to make their case. From the inception of the withered bones’ primordial essence, through the wheel-turning of womb transformations, they erred into the human realm, their putrid flesh and bones. Yet, by the grace of the numinous descent’s mysterious favor, those with hearts were awakened and uplifted. The numinous and exalted Venerable nurtures and educates all beings, universally delivering all.",
      "overlap_context": " revolutions,\nFurther refining to transform their luminous forms.\nAwaiting the Perfected Ones of the Ten Poles,\nThey ascend in clouds to the Jade Capital.\n\n**Hymn of the Longevity-Cultivating Perfected One of Countless Calculations, Lower Infinite Realm, for the Liberation of All in the Golden Radiance of the Great One (One Contract)**\nReturning to the wondrous truth within the Dao,\nThe Brahma-Heaven holds the numinous scripture.\nThe void expounds the jade characters,\nTo instruct later worthies.",
      "start_char": 5961,
      "end_char": 7256,
      "start_sentence": 248,
      "end_sentence": 297,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.82113075256348,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝丹水飞术运度小劫妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "此参真妙，蝖飞蠢动，咸脱三恶道，灵尊未赐枯骨真文，愿见其旨。 因起作礼，经步七天许。 时大度真人湛然不应，忽有龟山王夫人从紫霞宫来，从玉女十许人，至劫仞。 夫人笑曰：有何请求，真人难之。 道有玄真上赞丹水飞术妙经八条，玄录要文正道毕矣。 夫人因涂炭叩头，苦请玉女共尔。 须臾之间，真人出文，见授此十方真人，亦於此得文。 修学今得十方灵宝真人也。 洞玄灵宝丹水飞术运度小劫妙经竟",
      "translated_text": "Here the profound mystery is fathomed—even the crawling insects and wriggling creatures all escape the Three Evil Paths. Yet the numinous and exalted Venerable has not bestowed the true scripture upon these withered bones. We long to behold its purport.\n\nThereupon, they rose and made obeisance, pacing through the seven heavens for what seemed an age. The Great Salvation Perfected One remained still and silent, offering no response. Suddenly, the Lady of Mount Tortoise emerged from the Palace of Purple Radiance, attended by some ten jade maidens, and arrived at the Kalpa-Measuring Mysterious Capital.\n\nThe Lady smiled and said: “What request could so confound a Perfected One?” The Dao possesses the *Supreme Eulogy of the Mysterious True: The Wondrous Scripture of the Flying Arts of Cinnabar Waters* in eight sections—its profound records and essential texts encompass the true and correct Way in full.\n\nThe Lady then smeared her face with ashes and prostrated herself, earnestly entreating the jade maidens to join her plea. In an instant, the Perfected One produced the scripture and conferred it upon these Perfected Ones of the Ten Directions, who thereby also received the text. Through cultivation and study, they have now attained the rank of Perfected Ones of the Numinous Treasure of the Ten Directions.\n\nThus concludes the *Wondrous Scripture of the Flying Arts of Cinnabar Waters for Deliverance Through the Lesser Kalpa of the Cavernous Mystery and Numinous Treasure*.",
      "overlap_context": " seeking the Dharma among the benighted, entangled in defilement and impurity, who dared not ascend to make their case. From the inception of the withered bones’ primordial essence, through the wheel-turning of womb transformations, they erred into the human realm, their putrid flesh and bones. Yet, by the grace of the numinous descent’s mysterious favor, those with hearts were awakened and uplifted. The numinous and exalted Venerable nurtures and educates all beings, universally delivering all.",
      "start_char": 7256,
      "end_char": 7440,
      "start_sentence": 298,
      "end_sentence": 306,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.860297441482544,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝丹水飞术运度小劫妙经.txt",
        "category": "本文类"
      }
    }
  ]
}