{
  "source_id": "洞玄灵宝玉京山步虚经",
  "source_file": "chunked_daozang\\洞玄灵宝玉京山步虚经.json",
  "total_chunks": 4,
  "total_original_chars": 3989,
  "total_translated_chars": 24753,
  "total_translation_time": 135.04120993614197,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏续道藏\\洞玄灵宝玉京山步虚经.txt",
    "category": "正统道藏续道藏"
  },
  "full_translation": "**The *Yujing Shan BuXu Jing* from the *Zhengtong Daozang* and *Xu Daozang***\n\n**Scripture Title:** *Dongxuan Lingbao Yujing Shan BuXu Jing* (*Scripture of the Cavernous Mystery and Numinous Treasure on Treading the Void at Jade Capital Mountain*). Also known as *Shengxuan BuXu Zhang* (*Verses on Ascending the Mystery and Treading the Void*). Author unknown, approximately dated to the Eastern Jin dynasty. One of the ancient *Lingbao Scriptures*. One fascicle. Base text from the *Xu Daozang*.\n\n---\n\n### *Dongxuan Lingbao Yujing Shan BuXu Jing*\n\nThe Mystic Capital’s Jade Capital Mountain lies above the Three Clarities, beyond form and dust. At its summit stands the Jade Capital’s Golden Towers, the Seven Treasures’ Mystic Terrace, and the Purple Tenuity’s Upper Palace, wherein reside the Three Treasure Spirit Scriptures. On the mountain’s eight directions, seven-jeweled trees grow naturally—one tree per direction, eight trees filling the eight quarters, their canopies covering all heavens, encompassing the Three Realms, serving as the governance of the Most High, the Boundless, the Void Sovereign Heavenly Worthy of the Supreme Great Luo Heaven.\n\nThe mountain’s forests and palaces all bear the registers of the heavenly sages. The heavenly sage emperors, kings, and innumerable hosts of lofty immortals and perfected beings assemble thrice monthly upon it. They burn naturally fragrant aloeswood that regenerates, and flying immortals scatter blossoms, encircling the Seven Treasures’ Mystic Terrace thrice. They chant and intone the empty and cavernous hymns. At this time, the heavens resound with music—hundreds of thousands of celestial musicians—cloud chimes ringing clear. True consorts sing in unison, their voices resonant, while immortal youths stand solemnly, their pure songs rising. Jade maidens advance gracefully, their steps light, their flowing dances elegant, their forms radiant and graceful.\n\nUpon the mountain, the seven-jeweled flower groves glow with brilliant hues, their crimson fruits resplendent, all fashioned from gold, silver, pearls, jade, crystal, lapis lazuli, *□qí*, and agate. When the numinous wind stirs them, their sounds naturally form the pentatonic scale, refined and wondrous beyond compare. The heavens’ hosts, hearing the melody, soar aloft, ceaselessly plucking strings and singing, sighing in rapture at the supreme sound, unable to describe it. Divine beasts—dragons, unicorns, lions, white cranes, rare birds, and phoenixes—wail and leap in joy.\n\nThe Most High resounds the Dharma drum, extending invitations to the jade hall. Seated upon lotus blossoms, he expounds the Dao in tranquil perfection, chanting the cavernous scriptures, elucidating the mysterious texts. Distantly savoring the subtle and formless, his joy stirs the assembly of immortals. At that moment, the eight winds unfurl banners, incense and blossoms scatter and mingle, and fragrant mist swirls in abundance.\n\nThe Most High declares: *\"Excellent! The formless is called the Dao; its meaning is profoundly mysterious. The wondrous enlightenment spans vast kalpas, enduring through countless ages. The Dao’s essence, though obscure in speech, is entrusted to these two chapters. If disciples can fast for long durations, ponder deeply, recite the cavernous scriptures, knock their teeth, swallow saliva, exhale and inhale the Great Harmony, their bodies will assume the hue of golden blossoms, their necks bear circular radiance, their heads adorned with the sun’s brilliance, the moon’s essence, and the dark mystery. In their hands, they grasp the spirit talismans and the ten-knotted banners. Such virtue is majestic—the Dao’s utmost honor. Cherish this mysterious transformation, and you shall become the Most High’s perfected ones. By moving the Boundless, you will stir the Heavenly Elder, summon flying dragons, and descend celestial immortals.\"*\n\nThrough the Three Realms and Nine Lands, at the cycle’s end of the great kalpa, during the catastrophes of the Yang’s nine and six, and the disasters of water and fire, all shall be dissolved and transformed by the Supreme Dao of Jade Clarity. The Three Caverns’ true scriptures, the divine and perfected treasure texts, the golden writings and jade characters, the phoenix-seal and dragon-bound scrolls—all shall return to the Supreme Great Luo Heaven, to the Seven Treasures’ Mystic Terrace within Jade Capital, untouched by calamity. When the kalpa renews and the primordial chaos is once more divided, the transmission of the true sages shall descend to transform the human realm.\n\nThis mountain resides in the highest heaven of the five hundred fifty-five thousand five hundred fifty-fifth layered heaven, beyond the sun and moon’s realm of the Eight Brahma Heavens, ninety-nine million nine hundred ninety-nine thousand nine hundred ninety-nine *qi* away—a single black *qi* spanning three thousand miles.\n\nThe heavenly immortals name this mountain in ten ways:\n1. The Heaven-Covering Summit Mountain,\n2. The Boundless Mystery Upper Mountain,\n3. The Net of Mystery Cavernous Void Mountain,\n4. The Lofty Supreme True Origin Mountain,\n5. The Multitude of Treasures’ Hidden Kalpa Blade Mountain,\n6. The Formless Great Treasure Mountain,\n7. The All-Encompassing Cavernous Mystery Mountain,\n8. The Radiant Flower Supreme Perfection Mountain,\n9. The Inconceivable Mountain,\n10. The Supreme Mystic Capital Jade Capital Great Mountain.\n\nTo know these mountain names is to have one’s name entered among the immortals.\n\nUpon the mountain, the seven-jeweled flower groves all bear the writings of the Supreme Clarity’s Three Caverns’ scriptures on Dao and virtue. Those who consume these blossoms and fruits become golden radiance immortals. Disciples who recite this scripture, savoring its utmost truth, shall naturally attain the Dao.\n\n---\n\n### *Treading the Void Chant*\n\nWhen performing the *Lingbao Dongxuan* fast and reciting the *Empty Cavern’s Treading the Void Verses*, first knock the teeth thrice and swallow saliva thrice. Visualize the sun and moon before your face, their radiance pouring into your nose—the sun entering from the left, the moon from the right—entering the Golden Flower Palace. A luminous glow emerges behind your head, forming a nine-colored circular aura, suffusing the Jade Pillow and illuminating the ten directions. Follow this as you circumambulate the scriptures. Upon completion, knock the teeth thrice again and swallow saliva thrice. Envision the Three Primordial Sovereign Ladies within the Golden Flower Palace, appearing like infant siblings.\n\nPerfected ones observing the fast adhere to the rites of dignity, omitting only the invocation of officials and the dispatch of spirit soldiers. All other prayers, vows, and prostrations follow the grand fast’s established rites. On the first day, spirit soldiers are dispatched, except when transmitting scriptural methods or instructing outsiders—then, no spirit soldiers need be sent.\n\nThe Supreme Ultimate Perfected One treasures this scripture. Those without immortal names in their destiny must not be allowed to see it.\n\n---\n\n### *Ten Treading the Void Chants of the Cavernous Mystery*\n\n1.\nI bow my head to the Most High,\nburning incense to return to the Void.\nFlowing light follows my turn,\nthe Dharma wheel circles thrice.\nThe Mystic Origin’s four great arise,\nnuminous blessings reach kings and lords.\nSeven ancestors ascend to heaven’s halls,\ntheir radiance resplendent, spreading brilliance.\n\n2.\nWhistling and singing, I gaze upon the Great Desert,\nheavenly music delights my joy.\nEqual fragrance, supreme virtue,\nthe lower world cannot compare.\nWondrous thoughts illumine mystic awakening,\ngraceful, I wander the void.\nCircling, I tread the cloud’s net,\nriding the void, I step the mystic records.\n\n3.\nChanting the Emperor’s One Honored,\na hundred passages naturally harmonize.\n\n**Ten Treading the Void Chants of the Cavernous Mystery** *(continued)*\n\n4.\nI command the Eight Sea Youths below,\nand lift the lofty immortals above.\nThe heavens scatter fragrant blossoms,\na numinous wind arises, serene.\nLong-held vows root destiny’s core,\nthus I ascend to towering heights.\nRejoicing before the Most High,\nten thousand kalpas are but a beginning.\n\n5.\nTowering, the Mystic Capital’s peaks,\nthe ten directions revere the August One.\nSoaring, the Heavenly Treasure Terrace,\nits radiance dazzles like the streaming sun.\nResplendent, the Jade Flower Grove,\ncrimson fruits gleam in luster.\nEver I consume primordial essence,\nrefining fluids to solidify form.\nGolden light scatters through Purple Tenuity,\ngraceful, the Great Vehicle soars free.\nGazing up and down, I hold the Most High,\nradiant splendor adorns the cinnabar field.\nLeft, I grasp the dark and dense,\nright, I clasp the boundless brilliance.\nThe Six Perfections crown pure conduct,\nvirtue and power renew with the sun.\nLifetimes of accumulated blessings,\nhearing the scriptures as if meeting kin.\nHeaven-endowed with transcendent talent,\njoyfully reciting the subtle and profound.\nThe qi of supreme harmony, empty and vast,\nexhaling and inhaling the misty nectar.\nEmbryonic breathing stills the hundred channels,\nin emptiness, I glimpse the Three Conveniences.\nThe Mud Pill Palace shines with luminous splendor,\nthus I become a Golden Flower Immortal.\nThe Demon King reverently serves,\nenabling my audience with the heavens.\nAll begins with fasting and precepts,\naccumulated merit binds past karma.\nSoaring through the Great Void,\nI uplift the exalted ones.\nGuiding the reins to the ten directions,\nI rest upon the mystic radiance’s slopes.\nGazing up at the Kalpa Terrace,\nlooking down upon the Purple Cloud Net.\nCarefree in the Most High’s capital,\ntogether we sit upon lotus blossoms.\n\n6.\nThrough study, one becomes a Perfected,\ntranquil, the constructive and defensive harmonize.\nEndlessly enjoying boundless life,\nwhy count ten thousand cedars as much?\nThe Great Dao follows the Mystic Silence,\nascending immortals befriend the Peerless.\nThe Noble Scion bestows the spirit talisman,\nthe Great One holds the Cavernous Scripture.\nRelics gleam with golden splendor,\nthe dragon carriage arrives in a flash.\nThe Heavenly Worthy gazes at the cloud chariot,\nfloating, floating, riding the void.\nFragrant blossoms like falling snow,\nmisty vapors enrich the mystic beams.\nBowing my head at the Golden Gate,\nhand in hand, I roam the Jade Capital.\nThe soaring trees of the Mystic Radiance Garden,\nresplendent with the Seven Treasures’ grove.\nThree hundred named celestial beasts,\nlions vast as ten thousand fathoms.\nFlying dragons pace and roar,\ndivine phoenixes chant in rhythm.\nA numinous breeze fans wondrous blossoms,\npure fragrance scatters upon my lapels.\nWithout transcendent talent,\nhow could I indulge this heart?\nI harness my Nine Dragon Carriage,\nriding the void in carefree ease.\nThe Eight Heavens like my palm,\nthe Six Harmonies—how could they be distant?\n\n7.\nThe host of immortals recites the Cavernous Scripture,\nthe Most High sings a pure hymn.\nFragrant blossoms scatter with the wind,\njade tones form in the Purple Empyrean.\nThe Five Sufferings burst forth at once,\nthe Eight Difficulties follow the scriptures’ emptiness.\nWondrous, the numinous treasure’s enclosure,\nraising this great Dharma bridge.\nThe Heavenly Perfected’s Palace of the August One,\nmisty, crowning the radiant spirits.\nFlowing brilliance, the Dharma wheel’s net,\nspinning through emptiness into formlessness.\nThe Void Sovereign plucks the cloud zither,\nthe host of Perfected recites the Cavernous Scripture.\nExalted immortals bow in praise,\nthrough endless kalpas, preserving purity.\nThe Utmost Perfected awaits nothing,\nsometimes guiding the flying dragons.\nLong fasts convene in the Mystic Capital,\njade chimes strike the jasper bells.\nThe Ten Flowers’ immortals gather,\npurple mist coalesces into a palace.\nCanopies array before the Most High,\nPerfected Ones hold the lotus.\nScattering blossoms, I declare my vow,\ngrasping the tally to subdue the Demon King.\nDharma drums summon the host of immortals,\nnuminous chants harmonize as one.\nNeither this nor that—\nthoughts commune with the subtle and profound.\n\n---\n\n**Eight Hymns in Praise of the Most High’s Wisdom Scripture**\n\n1.\nThe Most High’s Mystic Void School,\nhonors its scripture as the Dao’s vastness.\nGazing up and down, I have attained immortality,\nthrough countless kalpas, unaging.\nMajestic, the Great Perfected’s virtue,\ntranquil, rooted in non-arising.\nCelestial radiance weaves empty structures,\nriding the void, naturally journeying.\nSun and moon blaze with brilliance,\npeace and harmony, joy unending.\nTo study immortality, sever ornate thoughts,\neach thought accumulates in succession.\nComing and going disturb my spirit,\nrestless, it knows no respite.\nExtinguish thoughts, still the empty leisure,\nwhispering, entering emptiness and silence.\n\n2.\nSeeking the scriptures as if starving or thirsting,\nholding resolve firm as metal and stone.\nPreserve the path to your flying immortality,\nthe Five Numinous tally your register.\nCrossing the Six Perfections’ conduct,\nthus I untie the Three Nets.\nPurifying fasts honor the Primal Simplicity,\nexhaling and inhaling, nurturing cloud sprouts.\nCarefree within the Golden Gate,\nthe Jade Capital becomes my home.\nNaturally, the Seven Treasures arise,\neach person sits upon a lotus.\nGazing up, I chew the Mystic Capital’s dates,\nlooking down, I savor the Cavernous Void’s melons.\nMy countenance shines like ten suns,\nwhy reckon the kalpas’ multitude?\nDharma drums summon the celestial immortals,\njade chimes subdue the great demons.\nA numinous breeze fans fragrant blossoms,\nresplendent, unfurling my lapels.\nThe Utmost Perfected plucks the cloud zither,\nthe host of immortals strums the numinous harp.\nElegant songs of the Three Heavens’ radiance,\nscattering wisdom in the Jade Flower Grove.\nSeven ancestors ascend to the Blessing Hall,\nthus treading the mystic tones.\nIf past lives’ blessings were insufficient,\nthis book would be distant and hard to find.\nFaith in the Dao knows no end,\nseeking flight, one sinks instead.\n\n3.\nThe Most High’s non-action Dao,\nits vastness lies in the people’s hearts.\nStudying the Dao begins with cinnabar faith,\nserving the master as if kin.\nDrawing radiance to match the pure void,\ndiligently renewing with each day.\nUntil all people attain liberation,\nI will not liberate myself.\nGreat vows demand profound repayment,\nmystic virtue must be true.\nYin’s evil sins run deep,\nconfronting them like a turning wheel.\nStudying the Dao is also arduous,\nday and night, building the field of blessings.\nPlanting virtue is like planting trees,\npiling baskets to form a mountain.\nIf you can indulge in the mystic and exalted,\nyou will soar into the azure heavens.\nCultivating this non-action Dao,\nyou will bind good fortune’s threads.\n\n4.\nThe Most High’s most recondite book,\nnamed the *Scripture of Wisdom*.\nDeliverance from suffering requires great talent,\ntranscending the mundane to attain the Perfected.\nA numinous countenance, rare in the world,\nresplendent as a lotus in the abyss.\nHuman conduct, if it has roots,\nall stems from past lives’ merit.\nEstablishing virtue must be timely,\nvows, once made, are never unfulfilled.\nGood and evil both await their recompense,\nthe principle of rise and fall is unfathomable.\nThe worthy uphold the Dharma’s words,\nthe Dao also lies in forgetting both.\nUnderstanding this is great wisdom,\nascending to become a Supreme Pole Lord.\nJewel canopies link jade carriages,\ncommanding the Nine Dragons’ reins.\nGolden Flowers herald the Cavernous Scripture,\nimmortal youths all hold incense.\nWhistling and singing through the Mystic Capital,\njade chimes strike the jasper bells.\nRefining the body to ascend the Great Clarity,\nsurpassing radiance, soaring through the Purple Empyrean.\nUpholding the Dharma’s net,\nroaming the mystic ultimate in carefree ease.\nTen thousand kalpas are like last night,\na thousand cedars like this morning.\n\nMajestic peaks shade the radiant clouds,\nhands grasp the jeweled branches of the sacred grove.\nFragrant mist drifts away of itself,\nmystic melodies harmonize with the whirlwind.\nSpiritual banners unfurl with the wind,\nfleeting thoughts dissolve in due time.\nExtinguishing wisdom, vast is the Great Undifferentiated,\nnon-action becomes the pure chant.\n\nThese are the words of the Supreme Pole Perfected,\never cherished and recited by the host of immortals—\nnever to be revealed to the vulgar below,\nbut secretly preserved within golden palaces and jade chambers.\n\nThe Immortal Lord declared:\n\"These should be transmitted only to those who cultivate the Numinous Treasure Retreat,\nnever shown to the frivolous and ostentatious.\nBeware! Beware!\"\n\nThe Mystic Master, Supreme Primordial Perfected,\nbestowed upon Attendant Xu the *Jade Capital Mountain Formulae of the Great Cavern Numinous Treasure Scripture*,\ncomposing three odes in response.\nThat same evening, the Lady of Right Florescence also chanted them.\n\n**Ode:**\nThe Eight Assemblies’ paths have no origin,\nriding the current, one beholds the clamor of the world.\nTransforming and dissolving the floating dust,\nunfastening the lapel, one finds the Daoist household.\nIn an instant, mist vanishes,\nbearing truth, one ascends to the Numinous Alas.\nThe empty scene gazes upon the jasper pavilion,\nthe Mystic Harmony sings the Phoenix Song.\nThe path is free from hindrance,\ndivine sounds dance upon the clouds.\nEqual in virtue to the Jade Capital,\nwhy trouble with worldly concerns?\n\nLeft hand grasping the Jade Flower Canopy,\nsoaring at dawn, treading the Seven Primes.\nThe Three Luminaries gleam with purple radiance,\nupright and poised, one attends the Radiant Perfected.\nIn a moment, leaping transformations occur,\nall four directions become divine.\nThe numinous scripture knows no bounds,\ndiligently ponder the *Shangqing* texts.\nWhy linger on the crossroads,\ncausing your devotion to waver?\n\nYin ailments lose their mystic mechanism,\nunaware, the years divide.\nMystic waves stir the azure tides,\nvast ford rouses the myriad streams.\nRiding the light, one gazes upon the Six Voids,\nlonging to wander with the Perfected.\nExquisite songs find no response,\npure tones have no one to receive them.\nAmid the clouds, jasper wheels race—\nwho among them is a companion of dust?\n\nThe Supreme Lord of the Supreme Pole and Five Perfected,\non Mount Yu in the Yu Mountains,\nbestowed the *Cavernous Numinous Treasure Scripture* upon Lord Immortal Ge,\neach reciting an ode.\n\n**Ode of the Supreme Lord of the Supreme Pole:**\nThe Supreme Lord of the Great Dao,\nrevealed the *Numinous Treasure Chapters*.\nLofty and wondrous, beyond compare,\nlike the profound within the profound.\nThe ten directions’ lands,\nall revere the Supreme Immortals.\nVast is the *Cavernous Void Scripture*,\nserene in repose, one summons the heavens.\nAbove, it treasures the Purple Tenuity Terrace,\nbelow, it conceals the myriad famous mountains.\nResplendent with dragon and phoenix script,\nits brilliance dwells therein.\nWondrous is the Supreme Dao,\nnon-action is ever natural.\nKings, lords, and common folk—\nwhat they value is only worthiness.\nThose with karmic fortune,\nstand out from past affinities.\nDharma masters transmit it in turn,\ntreasured faith spans kalpas.\nWith a broad mind, deliver all,\ngreat fortune repays your person.\nThose who make offerings will attain the Dao,\nthose who uphold it become Perfected.\nThe Great Dao has no self or other,\ntransmission must reach the Perfected.\n\n**Ode of the Supreme Primordial First Perfected:**\nMyriad wonders emerge from the Cavernous Perfected,\nresplendent, illuminating the Great Clarity.\nThose who uphold it are called immortals,\nembodying the origin, they attain eternal life.\nCarefree, they sport in the Mystic Void,\npalaces array their forms.\nLush and lustrous, the Seven Treasures Grove,\nradiant as the sun and moon’s essence.\nDragons and unicorns gallop in crisscross,\nphoenixes soar with mournful cries.\nThe Supreme Lord governs the Purple Terrace,\nthe host of Perfected recite the Cavernous Scripture.\nHolding incense, they bow in reverence,\ncircumambulating the palace city.\nAfter three circuits, returning to the high seat,\nthe Dao King responds in kind.\nWhen the lord of men upholds the Supreme Dao,\nthe world enjoys universal peace.\n\n**Ode of the Supreme Primordial Second Perfected:**\nEmptiness and nothingness are ever natural,\nforcedly named the Great Dao.\nIts sound transcends boundless limits,\nmyriad wonders return to the Numinous Treasure.\nClosing the eyes, one visualizes the Supreme Perfected,\nwith concentrated thought, the Ten Elders descend.\nAscending as immortals, forever non-active,\ntheir numinous countenances ever wondrous.\nThirst quenched by the Jade Pool’s nectar,\nhunger sated by the Golden Flower Herb.\nPurifying the world, delivering from the Eight Difficulties,\nrelieving the world’s myriad sufferings.\n\n**Ode of the Supreme Primordial Third Perfected:**\nWondrous is the *Numinous Treasure Scripture*,\nthe Supreme Lord’s natural writing.\nThose who uphold it attain the Dao,\ncalled to descend as Perfected in the world.\nEntrusted to propagate the Daoist teachings,\ntruly surpassing worldly talent.\nWhen the task is complete, one ascends as an immortal,\npalaces govern the Mystic Terrace.\nAt times descending Mount Kunlun,\ncarefree, one rests in Penglai.\n\n**Ode of the Perfected of the Correct One, the Supreme Three Heavens Dharma Master, Celestial Master Zhang:**\nThe *Numinous Treasure* and *Great Cavern*,\nthe supreme Perfected Dao Scripture King.\nOnly the Five Thousand Characters,\nlofty and wondrous, without equal.\nThose who uphold it ascend as flying immortals,\ndwelling in the void, governing the emptiness.\nAttending the Supreme Lord’s Terrace,\ncarefree in the Purple Tenuity Palace.\nTen thousand kalpas are like a flash of lightning,\neternally abiding, never ending.\nThe Daoist robes are fully prepared,\nspontaneously penetrating the obscure.\nUnknowing of the dark and dim,\nserene in repose, one beholds the ten directions.\n\n**Three Odes of Reverence and Incantation**\nThe Perfected said: \"The formula states that when the scripture-attending immortal youths and jade maidens hear this incantation, they all rejoice and protect the practitioner’s person.\nAll great scriptures employ this incantation in worship.\nThose who sincerely revere the scriptures also silently recite its words—\nthis is the secret of the Supreme Immortals.\"\n\nDelighting in the Dharma as one’s spouse,\ncherishing the scriptures like pearls and jade.\nUpholding precepts to restrain the seven emotions,\ncontemplating the Dao to dispel desires.\nWith simplicity, the upright qi abides,\ntranquil, the spirit is serene.\nHeavenly demons all yield in respect,\nlifetimes enjoy great fortune.\nLush and prosperous, the household and state,\nflourishing, the Dao and scriptures thrive.\nHeaven and humanity share the same aspiration,\nsoaring into the Great Vehicle.\nEstablishing a field of merit in the heart,\nthe Dharma wheel ascends without cease.\nSeven ancestors ascend to the heavenly halls,\none’s person ascends at daylight.\nThe Great Dao pervades the Cavernous Void,\nwith mindfulness, nothing fails to align.\nRefining the body to enter the immortal Perfected,\none thus achieves the Vajra Body.\nSurpassing the Three Realms’ difficulties,\nthe Five Sufferings of hell are resolved.\nAll return to the Supreme Lord’s scriptures,\nserene in contemplation, bowing in reverence.\n\nLord Immortal Ge of the Supreme Pole’s Left, named Xuan, styled Xiaoxian,\non Mount Tiantai, bestowed the teachings upon his disciples Zheng Siyuan, the śramaṇa Zhu Falan, Shi Daowei, and Sun Quan of the Wu dynasty.\nLater, Siyuan, in the Horse’s Hoof Mountains, transmitted them to Ge Hong.\nHong was the grandnephew of Lord Immortal Ge, known as the Master Who Embraces Simplicity, authoring inner and outer canonical works.\nAt that time, Master Zheng spoke of the immortal teacher, Lord Immortal Ge, saying:\n\"The *Supreme Clarity Three Caverns Great Perfected Dao Scripture* I have transmitted—\non the day of my departure, one copy shall be entrusted to the famous mountains and terraces of Wu,\none copy to my disciples,\nand one copy to my family’s descendants,\nto be recorded and transmitted through the generations.\"\n\nThe Perfected One, if merely devoted to these scriptures while pursuing worldly affairs, shall be unworthy of their transmission and recording. They may then be wholly entrusted to the renowned mountains and Five Peaks, and must not be lightly transmitted to those unfit. Should one prove worthy, they ought to be passed on—lest the celestial Dao be obstructed.\n\nThe *Scripture of Cavernous Mystery, Numinous Treasure, and Strolling the Void on Jade Capital Mountain* concludes.\n\n[1] \"Five\" should read \"three.\"\n[2] \"Above\" was mistakenly written as \"mountain.\"",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "明万历正统道藏续道藏 洞玄灵宝玉京山步虚经 经名：洞玄灵宝玉京山步虚经。 又名《升玄步虚章》。 撰人不详，约出於东晋。 系古《灵宝经》之一。 一卷。 底本出处：《续道藏》。 洞玄灵宝玉京山步虚经 玄都玉京山在三清之上，无色无尘。 上有玉京金阙七宝玄台紫微上宫，中有三宝神经。 山之八方自然生七宝之树，一方各生一株，八株弥满八方，覆盖诸天，包罗三界，为无上大罗天太上无极虚皇天尊之治也。 其山林宫室皆列诸天圣众名籍。 诸天圣帝王、高仙真人无鞅数众，一月三朝其上，烧自然旗檀反生灵香，飞仙散花，旋绕七宝玄台三周匝，诵咏空洞歌章。 是时诸天奏乐，百千万妓，云璈朗彻，真妃齐唱而激节，仙童凛颜而清歌，玉女徐进而跰跹，放窈窕而流舞翩翩，诜诜而容裔也。 山上七宝华林，光色炜烨，朱实璨烂，悉是金银、珠玉、水晶、琉璃、□璖、码碯。 灵风振之，其音自成宫商，雅妙宛绝。 诸天闻声而飞腾，勿辍弦止歌，叹味至音，不能名状。 神兽、龙麟、狮子、白鹤、奇禽、凤凰，悲呜踊跃。 太上震响法鼓，延宾琼堂，安坐莲花，讲道静真，清咏洞经，敷释玄文，远味希夷，喜动群仙。 其时八风扬旛，香花交散，流烟蓊霭。 太上称：善哉。 无无曰道，义极玄玄。 妙觉大度，弥劫历年。 道素冥语而寄二篇，兆能长斋久思，讽诵洞经，叩齿咽液，吐纳太和，身作金华色，项负圆光，头簪日华月英玄景，手把灵符十绝之旛。 斯德巍巍，道之至尊，惜惜玄化，太上之真人矣。 将感太无，动天老，致飞龙，降天仙也。 三界九地，大劫之周，阳九百六之运，水火之灾，亦皆消化玉清上道。 三洞真经、神真宝文、金书玉字、凤篆龙编，并还无上大罗天中，玉京之中七宝玄台，灾所不及，劫历再开，混沌重判，传授真圣，下化人间。 其在五亿五万五千五百五十五重天之最上天也，去下八梵天日月之界，九千九百九十九万九千九百九十亿炁，一黑炁三千里。 诸天仙人名此山，一曰盖天首山，二日弥玄上山，三日罗玄洞虚山，四日高上真元山，五曰众宝幽劫刃山，六曰无色大宝山，七曰周观洞玄山，八日景华太真山，九曰不思议山，十曰太玄都玉京太山。 知此山名，名入仙矣。 山上七宝华林，皆作上清三洞道德玄经文章。 食此华实，为金光仙人，兆读是经，咽味至真，道自成矣。 步虚吟 修灵宝洞玄斋，诵空洞步虚章，先叩齿三通，咽嗽三过。 心存日月在己面上，光芒灌鼻，日从鼻左入，月从鼻右入，入金华官，光明出头后，焕然作九色圆象，溥入玉枕，彻照十方，随我绕经旋回而行。 毕，又叩齿三通，咽液三过，存三素元君在金华官，如婴兄之状。 真人斋皆如威仪法，唯不用启事出吏兵一节耳。 其余愿念礼拜，悉依大法建斋，初一过出史兵，非授经法，及教外人，不须出史兵。 太极真人宝贵此经，宿无仙真之名，不令见也。 洞玄步虚吟十首 稽首礼太上，烧香归虚无。 流明随我回，法轮亦三周。 玄元四大兴，灵庆及王侯。 七祖生天堂，煌煌耀景敷。 啸歌观太漠，天乐适我娱。 齐馨无上德，下俗不与俦。 妙想明玄觉，诜诜巡虚游。 旋行蹑云纲，乘虚步玄纪。 吟咏帝一尊，百关自调理。",
      "translated_text": "**The *Yujing Shan BuXu Jing* from the *Zhengtong Daozang* and *Xu Daozang***\n\n**Scripture Title:** *Dongxuan Lingbao Yujing Shan BuXu Jing* (*Scripture of the Cavernous Mystery and Numinous Treasure on Treading the Void at Jade Capital Mountain*). Also known as *Shengxuan BuXu Zhang* (*Verses on Ascending the Mystery and Treading the Void*). Author unknown, approximately dated to the Eastern Jin dynasty. One of the ancient *Lingbao Scriptures*. One fascicle. Base text from the *Xu Daozang*.\n\n---\n\n### *Dongxuan Lingbao Yujing Shan BuXu Jing*\n\nThe Mystic Capital’s Jade Capital Mountain lies above the Three Clarities, beyond form and dust. At its summit stands the Jade Capital’s Golden Towers, the Seven Treasures’ Mystic Terrace, and the Purple Tenuity’s Upper Palace, wherein reside the Three Treasure Spirit Scriptures. On the mountain’s eight directions, seven-jeweled trees grow naturally—one tree per direction, eight trees filling the eight quarters, their canopies covering all heavens, encompassing the Three Realms, serving as the governance of the Most High, the Boundless, the Void Sovereign Heavenly Worthy of the Supreme Great Luo Heaven.\n\nThe mountain’s forests and palaces all bear the registers of the heavenly sages. The heavenly sage emperors, kings, and innumerable hosts of lofty immortals and perfected beings assemble thrice monthly upon it. They burn naturally fragrant aloeswood that regenerates, and flying immortals scatter blossoms, encircling the Seven Treasures’ Mystic Terrace thrice. They chant and intone the empty and cavernous hymns. At this time, the heavens resound with music—hundreds of thousands of celestial musicians—cloud chimes ringing clear. True consorts sing in unison, their voices resonant, while immortal youths stand solemnly, their pure songs rising. Jade maidens advance gracefully, their steps light, their flowing dances elegant, their forms radiant and graceful.\n\nUpon the mountain, the seven-jeweled flower groves glow with brilliant hues, their crimson fruits resplendent, all fashioned from gold, silver, pearls, jade, crystal, lapis lazuli, *□qí*, and agate. When the numinous wind stirs them, their sounds naturally form the pentatonic scale, refined and wondrous beyond compare. The heavens’ hosts, hearing the melody, soar aloft, ceaselessly plucking strings and singing, sighing in rapture at the supreme sound, unable to describe it. Divine beasts—dragons, unicorns, lions, white cranes, rare birds, and phoenixes—wail and leap in joy.\n\nThe Most High resounds the Dharma drum, extending invitations to the jade hall. Seated upon lotus blossoms, he expounds the Dao in tranquil perfection, chanting the cavernous scriptures, elucidating the mysterious texts. Distantly savoring the subtle and formless, his joy stirs the assembly of immortals. At that moment, the eight winds unfurl banners, incense and blossoms scatter and mingle, and fragrant mist swirls in abundance.\n\nThe Most High declares: *\"Excellent! The formless is called the Dao; its meaning is profoundly mysterious. The wondrous enlightenment spans vast kalpas, enduring through countless ages. The Dao’s essence, though obscure in speech, is entrusted to these two chapters. If disciples can fast for long durations, ponder deeply, recite the cavernous scriptures, knock their teeth, swallow saliva, exhale and inhale the Great Harmony, their bodies will assume the hue of golden blossoms, their necks bear circular radiance, their heads adorned with the sun’s brilliance, the moon’s essence, and the dark mystery. In their hands, they grasp the spirit talismans and the ten-knotted banners. Such virtue is majestic—the Dao’s utmost honor. Cherish this mysterious transformation, and you shall become the Most High’s perfected ones. By moving the Boundless, you will stir the Heavenly Elder, summon flying dragons, and descend celestial immortals.\"*\n\nThrough the Three Realms and Nine Lands, at the cycle’s end of the great kalpa, during the catastrophes of the Yang’s nine and six, and the disasters of water and fire, all shall be dissolved and transformed by the Supreme Dao of Jade Clarity. The Three Caverns’ true scriptures, the divine and perfected treasure texts, the golden writings and jade characters, the phoenix-seal and dragon-bound scrolls—all shall return to the Supreme Great Luo Heaven, to the Seven Treasures’ Mystic Terrace within Jade Capital, untouched by calamity. When the kalpa renews and the primordial chaos is once more divided, the transmission of the true sages shall descend to transform the human realm.\n\nThis mountain resides in the highest heaven of the five hundred fifty-five thousand five hundred fifty-fifth layered heaven, beyond the sun and moon’s realm of the Eight Brahma Heavens, ninety-nine million nine hundred ninety-nine thousand nine hundred ninety-nine *qi* away—a single black *qi* spanning three thousand miles.\n\nThe heavenly immortals name this mountain in ten ways:\n1. The Heaven-Covering Summit Mountain,\n2. The Boundless Mystery Upper Mountain,\n3. The Net of Mystery Cavernous Void Mountain,\n4. The Lofty Supreme True Origin Mountain,\n5. The Multitude of Treasures’ Hidden Kalpa Blade Mountain,\n6. The Formless Great Treasure Mountain,\n7. The All-Encompassing Cavernous Mystery Mountain,\n8. The Radiant Flower Supreme Perfection Mountain,\n9. The Inconceivable Mountain,\n10. The Supreme Mystic Capital Jade Capital Great Mountain.\n\nTo know these mountain names is to have one’s name entered among the immortals.\n\nUpon the mountain, the seven-jeweled flower groves all bear the writings of the Supreme Clarity’s Three Caverns’ scriptures on Dao and virtue. Those who consume these blossoms and fruits become golden radiance immortals. Disciples who recite this scripture, savoring its utmost truth, shall naturally attain the Dao.\n\n---\n\n### *Treading the Void Chant*\n\nWhen performing the *Lingbao Dongxuan* fast and reciting the *Empty Cavern’s Treading the Void Verses*, first knock the teeth thrice and swallow saliva thrice. Visualize the sun and moon before your face, their radiance pouring into your nose—the sun entering from the left, the moon from the right—entering the Golden Flower Palace. A luminous glow emerges behind your head, forming a nine-colored circular aura, suffusing the Jade Pillow and illuminating the ten directions. Follow this as you circumambulate the scriptures. Upon completion, knock the teeth thrice again and swallow saliva thrice. Envision the Three Primordial Sovereign Ladies within the Golden Flower Palace, appearing like infant siblings.\n\nPerfected ones observing the fast adhere to the rites of dignity, omitting only the invocation of officials and the dispatch of spirit soldiers. All other prayers, vows, and prostrations follow the grand fast’s established rites. On the first day, spirit soldiers are dispatched, except when transmitting scriptural methods or instructing outsiders—then, no spirit soldiers need be sent.\n\nThe Supreme Ultimate Perfected One treasures this scripture. Those without immortal names in their destiny must not be allowed to see it.\n\n---\n\n### *Ten Treading the Void Chants of the Cavernous Mystery*\n\n1.\nI bow my head to the Most High,\nburning incense to return to the Void.\nFlowing light follows my turn,\nthe Dharma wheel circles thrice.\nThe Mystic Origin’s four great arise,\nnuminous blessings reach kings and lords.\nSeven ancestors ascend to heaven’s halls,\ntheir radiance resplendent, spreading brilliance.\n\n2.\nWhistling and singing, I gaze upon the Great Desert,\nheavenly music delights my joy.\nEqual fragrance, supreme virtue,\nthe lower world cannot compare.\nWondrous thoughts illumine mystic awakening,\ngraceful, I wander the void.\nCircling, I tread the cloud’s net,\nriding the void, I step the mystic records.\n\n3.\nChanting the Emperor’s One Honored,\na hundred passages naturally harmonize.",
      "overlap_context": "",
      "start_char": 7,
      "end_char": 1241,
      "start_sentence": 0,
      "end_sentence": 50,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.24924278259277,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\洞玄灵宝玉京山步虚经.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "俯命八海童，仰携高仙子。 诸天散香花，萧然灵风起。 宿愿定命根，故致标高拟。 惧乐太上前，万劫犹未始。 嵯峨玄都山，十方宗皇一。 岧岧天宝台，光明烂流日。 炜烨玉华林，蒨璨耀朱实。 常念餐元精，炼液固形质。 金光散紫微，窈窕大乘逸。 俯仰存太上，华景秀丹田。 左顾提郁，右盼携结璘。 六度冠梵行，道德随日新。 宿命积福庆，闻经若至亲。 天挺超世才，乐诵希微篇。 冲虚太和气，吐纳流霞津。 胎息静百关，寥寥窥三便。 泥丸洞明景，遂成金华仙，魔王敬受事，故能朝诸天。 皆从斋戒起，累功结宿绿。 飞行凌太虚，提携高上人。 控辔适十方，旋憩玄景阿。 仰观劫仞台，俯盼紫云罗。 逍遥太上京，相与坐莲花。 积学为真人，恬然荣卫和。 永享无期寿，万椿奚足多。 大道师玄寂，升仙友无英。 公子度灵符，太一捧洞章。 舍利曜金姿，龙驾欻来迎。 天尊盼云舆，飘飘乘虚翔。 香花若飞雪，氛霭茂玄梁。 头脑礼金阙，携手遨玉京。 骞树玄景园，焕烂七宝林。 天兽三百名，狮子巨万寻。 飞龙踯躅呜，神凤应节吟。 灵风扇奇花，清香散人衿。 自无高仙才，焉能耽此心。 严我九龙驾，乘虚以逍遥。 八天如指掌，六合何足辽。 众仙诵洞经，太上唱清谣。 香花随风散，玉音成紫霄。 五苦一时迸，八难顺经寥。 妙哉灵宝囿，兴此大法桥。 天真帝一宫，霭霭冠耀灵。 流焕法轮纲，旋空入无形。 虚皇抚云璈，众真诵洞经。 高仙拱手赞，弥劫保利贞。 至真无所待，时或辔飞龙。 长斋会玄都，呜玉扣琼钟。 十华诸仙集，紫烟结成宫。 宝盖罗太上，真人把芙蓉。 散华陈我愿，握节征魔王。 法鼓会群仙，灵唱靡不同。 无可无不可，思与希微通。 太上智慧经赞八首 太上玄虚宗，弘道尊其经。 俯仰已得仙，历劫无数龄。 巍巍大真德，寂寂因无生。 霄景结空构，乘虚自然征。 日月为炳灼，安和乐未央。 学仙绝华念，念念相因积。 去来乱我神，神躁靡不历。 灭念停虚闲，萧萧入空寂。 请经若饥渴，持志如金石。 保子飞仙路，五灵度符籍。 济我六度行，故能解三罗。 清斋礼太素，吐纳养云芽。 逍遥金阙内，玉京为余家。 自然生七宝，人人坐莲华。 仰嚼玄都奈，俯酣空洞瓜。 容颜曜十日，奚计年劫多。 法鼓会天仙，呜钟征大魔。 灵风扇香花，璨烂开繁衿。 太真抚云璈，众仙弹灵琴。 雅歌三天景，散慧玉华林。 七祖升福堂，由此步玄音。 前世福未足，斯书邈难寻。 信道情不尽，图飞乃反沈。 太上无为道，弘之在兆心。 学道由丹信，奉师如至亲。 挹景偶清虚，孜孜随日新。 众人未得度，终不度我身。 大愿有重报，玄德必信然。 阴恶罪至深，对来若转轮。 学道亦甚苦，晨夜建福田。 种德犹植树，种篑而成山。 子能耽玄尚，飘尔升青天。 修是无为道，当与善结绿。 太上至隐书，名日智慧篇。 拔苦由大才，超俗以得真。 灵姿世所奇，哗若渊中莲。 人行若有本，皆由宿世功。 立德务及时，发愿莫不从。 善恶俱待对，倚伏理难穷。 贤士奉法言，道亦在兼忘。 解是大智慧，上为太极公。 宝盖连玉舆，命驾御九龙。 金华警洞经，捧香悉仙童。 啸歌彻玄都，呜玉扣琼钟。 炼身凌太清，超景逸紫霄。 保无持法纲，游玄极逍遥。 万劫犹昨夜，千桩如晨朝。",
      "translated_text": "**Ten Treading the Void Chants of the Cavernous Mystery** *(continued)*\n\n4.\nI command the Eight Sea Youths below,\nand lift the lofty immortals above.\nThe heavens scatter fragrant blossoms,\na numinous wind arises, serene.\nLong-held vows root destiny’s core,\nthus I ascend to towering heights.\nRejoicing before the Most High,\nten thousand kalpas are but a beginning.\n\n5.\nTowering, the Mystic Capital’s peaks,\nthe ten directions revere the August One.\nSoaring, the Heavenly Treasure Terrace,\nits radiance dazzles like the streaming sun.\nResplendent, the Jade Flower Grove,\ncrimson fruits gleam in luster.\nEver I consume primordial essence,\nrefining fluids to solidify form.\nGolden light scatters through Purple Tenuity,\ngraceful, the Great Vehicle soars free.\nGazing up and down, I hold the Most High,\nradiant splendor adorns the cinnabar field.\nLeft, I grasp the dark and dense,\nright, I clasp the boundless brilliance.\nThe Six Perfections crown pure conduct,\nvirtue and power renew with the sun.\nLifetimes of accumulated blessings,\nhearing the scriptures as if meeting kin.\nHeaven-endowed with transcendent talent,\njoyfully reciting the subtle and profound.\nThe qi of supreme harmony, empty and vast,\nexhaling and inhaling the misty nectar.\nEmbryonic breathing stills the hundred channels,\nin emptiness, I glimpse the Three Conveniences.\nThe Mud Pill Palace shines with luminous splendor,\nthus I become a Golden Flower Immortal.\nThe Demon King reverently serves,\nenabling my audience with the heavens.\nAll begins with fasting and precepts,\naccumulated merit binds past karma.\nSoaring through the Great Void,\nI uplift the exalted ones.\nGuiding the reins to the ten directions,\nI rest upon the mystic radiance’s slopes.\nGazing up at the Kalpa Terrace,\nlooking down upon the Purple Cloud Net.\nCarefree in the Most High’s capital,\ntogether we sit upon lotus blossoms.\n\n6.\nThrough study, one becomes a Perfected,\ntranquil, the constructive and defensive harmonize.\nEndlessly enjoying boundless life,\nwhy count ten thousand cedars as much?\nThe Great Dao follows the Mystic Silence,\nascending immortals befriend the Peerless.\nThe Noble Scion bestows the spirit talisman,\nthe Great One holds the Cavernous Scripture.\nRelics gleam with golden splendor,\nthe dragon carriage arrives in a flash.\nThe Heavenly Worthy gazes at the cloud chariot,\nfloating, floating, riding the void.\nFragrant blossoms like falling snow,\nmisty vapors enrich the mystic beams.\nBowing my head at the Golden Gate,\nhand in hand, I roam the Jade Capital.\nThe soaring trees of the Mystic Radiance Garden,\nresplendent with the Seven Treasures’ grove.\nThree hundred named celestial beasts,\nlions vast as ten thousand fathoms.\nFlying dragons pace and roar,\ndivine phoenixes chant in rhythm.\nA numinous breeze fans wondrous blossoms,\npure fragrance scatters upon my lapels.\nWithout transcendent talent,\nhow could I indulge this heart?\nI harness my Nine Dragon Carriage,\nriding the void in carefree ease.\nThe Eight Heavens like my palm,\nthe Six Harmonies—how could they be distant?\n\n7.\nThe host of immortals recites the Cavernous Scripture,\nthe Most High sings a pure hymn.\nFragrant blossoms scatter with the wind,\njade tones form in the Purple Empyrean.\nThe Five Sufferings burst forth at once,\nthe Eight Difficulties follow the scriptures’ emptiness.\nWondrous, the numinous treasure’s enclosure,\nraising this great Dharma bridge.\nThe Heavenly Perfected’s Palace of the August One,\nmisty, crowning the radiant spirits.\nFlowing brilliance, the Dharma wheel’s net,\nspinning through emptiness into formlessness.\nThe Void Sovereign plucks the cloud zither,\nthe host of Perfected recites the Cavernous Scripture.\nExalted immortals bow in praise,\nthrough endless kalpas, preserving purity.\nThe Utmost Perfected awaits nothing,\nsometimes guiding the flying dragons.\nLong fasts convene in the Mystic Capital,\njade chimes strike the jasper bells.\nThe Ten Flowers’ immortals gather,\npurple mist coalesces into a palace.\nCanopies array before the Most High,\nPerfected Ones hold the lotus.\nScattering blossoms, I declare my vow,\ngrasping the tally to subdue the Demon King.\nDharma drums summon the host of immortals,\nnuminous chants harmonize as one.\nNeither this nor that—\nthoughts commune with the subtle and profound.\n\n---\n\n**Eight Hymns in Praise of the Most High’s Wisdom Scripture**\n\n1.\nThe Most High’s Mystic Void School,\nhonors its scripture as the Dao’s vastness.\nGazing up and down, I have attained immortality,\nthrough countless kalpas, unaging.\nMajestic, the Great Perfected’s virtue,\ntranquil, rooted in non-arising.\nCelestial radiance weaves empty structures,\nriding the void, naturally journeying.\nSun and moon blaze with brilliance,\npeace and harmony, joy unending.\nTo study immortality, sever ornate thoughts,\neach thought accumulates in succession.\nComing and going disturb my spirit,\nrestless, it knows no respite.\nExtinguish thoughts, still the empty leisure,\nwhispering, entering emptiness and silence.\n\n2.\nSeeking the scriptures as if starving or thirsting,\nholding resolve firm as metal and stone.\nPreserve the path to your flying immortality,\nthe Five Numinous tally your register.\nCrossing the Six Perfections’ conduct,\nthus I untie the Three Nets.\nPurifying fasts honor the Primal Simplicity,\nexhaling and inhaling, nurturing cloud sprouts.\nCarefree within the Golden Gate,\nthe Jade Capital becomes my home.\nNaturally, the Seven Treasures arise,\neach person sits upon a lotus.\nGazing up, I chew the Mystic Capital’s dates,\nlooking down, I savor the Cavernous Void’s melons.\nMy countenance shines like ten suns,\nwhy reckon the kalpas’ multitude?\nDharma drums summon the celestial immortals,\njade chimes subdue the great demons.\nA numinous breeze fans fragrant blossoms,\nresplendent, unfurling my lapels.\nThe Utmost Perfected plucks the cloud zither,\nthe host of immortals strums the numinous harp.\nElegant songs of the Three Heavens’ radiance,\nscattering wisdom in the Jade Flower Grove.\nSeven ancestors ascend to the Blessing Hall,\nthus treading the mystic tones.\nIf past lives’ blessings were insufficient,\nthis book would be distant and hard to find.\nFaith in the Dao knows no end,\nseeking flight, one sinks instead.\n\n3.\nThe Most High’s non-action Dao,\nits vastness lies in the people’s hearts.\nStudying the Dao begins with cinnabar faith,\nserving the master as if kin.\nDrawing radiance to match the pure void,\ndiligently renewing with each day.\nUntil all people attain liberation,\nI will not liberate myself.\nGreat vows demand profound repayment,\nmystic virtue must be true.\nYin’s evil sins run deep,\nconfronting them like a turning wheel.\nStudying the Dao is also arduous,\nday and night, building the field of blessings.\nPlanting virtue is like planting trees,\npiling baskets to form a mountain.\nIf you can indulge in the mystic and exalted,\nyou will soar into the azure heavens.\nCultivating this non-action Dao,\nyou will bind good fortune’s threads.\n\n4.\nThe Most High’s most recondite book,\nnamed the *Scripture of Wisdom*.\nDeliverance from suffering requires great talent,\ntranscending the mundane to attain the Perfected.\nA numinous countenance, rare in the world,\nresplendent as a lotus in the abyss.\nHuman conduct, if it has roots,\nall stems from past lives’ merit.\nEstablishing virtue must be timely,\nvows, once made, are never unfulfilled.\nGood and evil both await their recompense,\nthe principle of rise and fall is unfathomable.\nThe worthy uphold the Dharma’s words,\nthe Dao also lies in forgetting both.\nUnderstanding this is great wisdom,\nascending to become a Supreme Pole Lord.\nJewel canopies link jade carriages,\ncommanding the Nine Dragons’ reins.\nGolden Flowers herald the Cavernous Scripture,\nimmortal youths all hold incense.\nWhistling and singing through the Mystic Capital,\njade chimes strike the jasper bells.\nRefining the body to ascend the Great Clarity,\nsurpassing radiance, soaring through the Purple Empyrean.\nUpholding the Dharma’s net,\nroaming the mystic ultimate in carefree ease.\nTen thousand kalpas are like last night,\na thousand cedars like this morning.",
      "overlap_context": "each kings and lords.\nSeven ancestors ascend to heaven’s halls,\ntheir radiance resplendent, spreading brilliance.\n\n2.\nWhistling and singing, I gaze upon the Great Desert,\nheavenly music delights my joy.\nEqual fragrance, supreme virtue,\nthe lower world cannot compare.\nWondrous thoughts illumine mystic awakening,\ngraceful, I wander the void.\nCircling, I tread the cloud’s net,\nriding the void, I step the mystic records.\n\n3.\nChanting the Emperor’s One Honored,\na hundred passages naturally harmonize.",
      "start_char": 1241,
      "end_char": 2499,
      "start_sentence": 51,
      "end_sentence": 150,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.18421697616577,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\洞玄灵宝玉京山步虚经.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "巍峨荫云华，手攀宝林条。 香姻自然去，玄喈与扶摇。 灵旛顺风散，繁想应时消。 灭智弘大混，无为为清谣。 太极真人之辞，众仙常所耽诵，不宣於下俗之人，秘藏金阙玉房之内也。 仙公日：宜传至人修灵宝斋者也，不可示浮华之徒，慎之哉，慎之哉。 玄师太元真人，临授许常侍掾，太洞玄经玉京山诀，作颂三首。 同夕，右英夫人亦吟诵之。 颂曰 八会涂无宗，乘运观嚣罗。 化浮尘中除，解衿有道家。 聘烟忽未顷，携真造灵阿。 虚景赡琼轩，玄钧作凤歌。 适路无轨滞，神音舞云波。 齐德秀玉京，何用世问多。 左把玉华盖，飞晨蹑七元。 三辰焕紫辉，竦盼抚明真。 变踊期须臾，四面皆已神。 灵文无涯际，勤思上清文。 何事坐横涂，令尔感不专。 阴痾失玄机，不觉年岁分。 玄波振沧涛，洪津鼓万流。 驾景盻六虚，思与真人游。 妙唱不我对，清音无谁投。 云中骋琼轮，孰为尘土俦。 太上太极五#1真人，於会稽上#2虞山授葛仙公洞玄灵宝经，各吟一颂。 太上太极真人颂曰 太上太道君，出示灵宝篇。 高妙难为喻，犹彼玄中玄。 自然十方土，共仰无上仙。 大乎洞虚经，安坐朝诸天。 上宝紫微台，下藏诸名山。 焕烂龙凤文，戢耀在其间。 妙哉太上道，无为常自然。 王侯及凡庶，所贵唯贵贤。 宿命有福庆，卓拔在昔缘。 法师转相授，宝信劫数年。 广心度一切，大福报尔身。 供养必得道，奉行成至真。 大道无彼我，传当得至人。 太上玄一第一真人颂曰 众妙出洞真，焕烂耀太清。 奉者号仙人，体元永长生。 逍遥戏玄虚，宫殿罗其形。 蒨璨七宝林，晃朗日月精。 龙麟交横驰，凤凰翔悲呜。 太上治紫台，众真诵洞经。 捻香稽首礼，旋行绕宫城。 三周归高座，道王为应声。 人主弘至道，天下普安宁。 太上玄－第二真人颂曰 虚无常自然，强名字大道。 音克邈无迁际，众妙归灵宝。 闭目存至真，精思降十老。 升仙永无为，灵颜常妙好。 渴饮玉池醴，饥食金花草。 净世度八难，济世诸苦恼。 太上玄－第三真人颂曰 妙哉灵宝经，太上自然书。 奉者致得道，号世降真来。 受命宣道教，真为超俗才。 事毕升神仙，官殿治玄台。 时降昆仑山，逍遥憩蓬莱。 正－真人无上三天法师张天师颂曰 灵宝及大洞，至真道经王。 唯有五千文，高妙无等双。 奉行致飞仙，玄居治虚空，。 侍卫太上台，逍遥紫微官。 万劫犹电顷，长存永无穷。 道服已备足，豁落自冥通。 幽昧日不知，安坐睹十方。 礼经三首咒 真人曰：诀云侍经仙童玉女闻此咒，皆欢悦而佑兆身也。 是大经悉用此咒而礼拜矣。 若直心礼经者，亦心咒其文，乃上仙秘之乎。 乐法以为妻，爱经如珠玉。 持戒制七情，念道遣所欲。 淡薄正气停，萧然神静默。 天魔并敬让，世世享大福。 郁郁家国盛，济济经道兴。 天人同其愿，缥缈入大乘。 因心立福田，靡靡法轮升。 七祖生天堂，我身白日腾。 大道洞玄虚，有念无不契。 炼质入仙真，遂成金刚体。 超度三界难，地狱五苦解。 悉皈太上经，静念稽首礼。 太极左仙公葛真人，讳玄，字孝先，於天台山授弟子郑思远、沙门竺法兰、释道微、吴时先主孙权。 后思远於马迹山中，授葛洪。 洪乃葛仙公之从孙，号抱朴子，着内外书典。 郑君于时说仙师仙公告曰：我所授上清三洞太真道经，吾去世之日，一通付名山洞台，一通付弟子，一通付吾家门子弟，世世录传。",
      "translated_text": "Majestic peaks shade the radiant clouds,\nhands grasp the jeweled branches of the sacred grove.\nFragrant mist drifts away of itself,\nmystic melodies harmonize with the whirlwind.\nSpiritual banners unfurl with the wind,\nfleeting thoughts dissolve in due time.\nExtinguishing wisdom, vast is the Great Undifferentiated,\nnon-action becomes the pure chant.\n\nThese are the words of the Supreme Pole Perfected,\never cherished and recited by the host of immortals—\nnever to be revealed to the vulgar below,\nbut secretly preserved within golden palaces and jade chambers.\n\nThe Immortal Lord declared:\n\"These should be transmitted only to those who cultivate the Numinous Treasure Retreat,\nnever shown to the frivolous and ostentatious.\nBeware! Beware!\"\n\nThe Mystic Master, Supreme Primordial Perfected,\nbestowed upon Attendant Xu the *Jade Capital Mountain Formulae of the Great Cavern Numinous Treasure Scripture*,\ncomposing three odes in response.\nThat same evening, the Lady of Right Florescence also chanted them.\n\n**Ode:**\nThe Eight Assemblies’ paths have no origin,\nriding the current, one beholds the clamor of the world.\nTransforming and dissolving the floating dust,\nunfastening the lapel, one finds the Daoist household.\nIn an instant, mist vanishes,\nbearing truth, one ascends to the Numinous Alas.\nThe empty scene gazes upon the jasper pavilion,\nthe Mystic Harmony sings the Phoenix Song.\nThe path is free from hindrance,\ndivine sounds dance upon the clouds.\nEqual in virtue to the Jade Capital,\nwhy trouble with worldly concerns?\n\nLeft hand grasping the Jade Flower Canopy,\nsoaring at dawn, treading the Seven Primes.\nThe Three Luminaries gleam with purple radiance,\nupright and poised, one attends the Radiant Perfected.\nIn a moment, leaping transformations occur,\nall four directions become divine.\nThe numinous scripture knows no bounds,\ndiligently ponder the *Shangqing* texts.\nWhy linger on the crossroads,\ncausing your devotion to waver?\n\nYin ailments lose their mystic mechanism,\nunaware, the years divide.\nMystic waves stir the azure tides,\nvast ford rouses the myriad streams.\nRiding the light, one gazes upon the Six Voids,\nlonging to wander with the Perfected.\nExquisite songs find no response,\npure tones have no one to receive them.\nAmid the clouds, jasper wheels race—\nwho among them is a companion of dust?\n\nThe Supreme Lord of the Supreme Pole and Five Perfected,\non Mount Yu in the Yu Mountains,\nbestowed the *Cavernous Numinous Treasure Scripture* upon Lord Immortal Ge,\neach reciting an ode.\n\n**Ode of the Supreme Lord of the Supreme Pole:**\nThe Supreme Lord of the Great Dao,\nrevealed the *Numinous Treasure Chapters*.\nLofty and wondrous, beyond compare,\nlike the profound within the profound.\nThe ten directions’ lands,\nall revere the Supreme Immortals.\nVast is the *Cavernous Void Scripture*,\nserene in repose, one summons the heavens.\nAbove, it treasures the Purple Tenuity Terrace,\nbelow, it conceals the myriad famous mountains.\nResplendent with dragon and phoenix script,\nits brilliance dwells therein.\nWondrous is the Supreme Dao,\nnon-action is ever natural.\nKings, lords, and common folk—\nwhat they value is only worthiness.\nThose with karmic fortune,\nstand out from past affinities.\nDharma masters transmit it in turn,\ntreasured faith spans kalpas.\nWith a broad mind, deliver all,\ngreat fortune repays your person.\nThose who make offerings will attain the Dao,\nthose who uphold it become Perfected.\nThe Great Dao has no self or other,\ntransmission must reach the Perfected.\n\n**Ode of the Supreme Primordial First Perfected:**\nMyriad wonders emerge from the Cavernous Perfected,\nresplendent, illuminating the Great Clarity.\nThose who uphold it are called immortals,\nembodying the origin, they attain eternal life.\nCarefree, they sport in the Mystic Void,\npalaces array their forms.\nLush and lustrous, the Seven Treasures Grove,\nradiant as the sun and moon’s essence.\nDragons and unicorns gallop in crisscross,\nphoenixes soar with mournful cries.\nThe Supreme Lord governs the Purple Terrace,\nthe host of Perfected recite the Cavernous Scripture.\nHolding incense, they bow in reverence,\ncircumambulating the palace city.\nAfter three circuits, returning to the high seat,\nthe Dao King responds in kind.\nWhen the lord of men upholds the Supreme Dao,\nthe world enjoys universal peace.\n\n**Ode of the Supreme Primordial Second Perfected:**\nEmptiness and nothingness are ever natural,\nforcedly named the Great Dao.\nIts sound transcends boundless limits,\nmyriad wonders return to the Numinous Treasure.\nClosing the eyes, one visualizes the Supreme Perfected,\nwith concentrated thought, the Ten Elders descend.\nAscending as immortals, forever non-active,\ntheir numinous countenances ever wondrous.\nThirst quenched by the Jade Pool’s nectar,\nhunger sated by the Golden Flower Herb.\nPurifying the world, delivering from the Eight Difficulties,\nrelieving the world’s myriad sufferings.\n\n**Ode of the Supreme Primordial Third Perfected:**\nWondrous is the *Numinous Treasure Scripture*,\nthe Supreme Lord’s natural writing.\nThose who uphold it attain the Dao,\ncalled to descend as Perfected in the world.\nEntrusted to propagate the Daoist teachings,\ntruly surpassing worldly talent.\nWhen the task is complete, one ascends as an immortal,\npalaces govern the Mystic Terrace.\nAt times descending Mount Kunlun,\ncarefree, one rests in Penglai.\n\n**Ode of the Perfected of the Correct One, the Supreme Three Heavens Dharma Master, Celestial Master Zhang:**\nThe *Numinous Treasure* and *Great Cavern*,\nthe supreme Perfected Dao Scripture King.\nOnly the Five Thousand Characters,\nlofty and wondrous, without equal.\nThose who uphold it ascend as flying immortals,\ndwelling in the void, governing the emptiness.\nAttending the Supreme Lord’s Terrace,\ncarefree in the Purple Tenuity Palace.\nTen thousand kalpas are like a flash of lightning,\neternally abiding, never ending.\nThe Daoist robes are fully prepared,\nspontaneously penetrating the obscure.\nUnknowing of the dark and dim,\nserene in repose, one beholds the ten directions.\n\n**Three Odes of Reverence and Incantation**\nThe Perfected said: \"The formula states that when the scripture-attending immortal youths and jade maidens hear this incantation, they all rejoice and protect the practitioner’s person.\nAll great scriptures employ this incantation in worship.\nThose who sincerely revere the scriptures also silently recite its words—\nthis is the secret of the Supreme Immortals.\"\n\nDelighting in the Dharma as one’s spouse,\ncherishing the scriptures like pearls and jade.\nUpholding precepts to restrain the seven emotions,\ncontemplating the Dao to dispel desires.\nWith simplicity, the upright qi abides,\ntranquil, the spirit is serene.\nHeavenly demons all yield in respect,\nlifetimes enjoy great fortune.\nLush and prosperous, the household and state,\nflourishing, the Dao and scriptures thrive.\nHeaven and humanity share the same aspiration,\nsoaring into the Great Vehicle.\nEstablishing a field of merit in the heart,\nthe Dharma wheel ascends without cease.\nSeven ancestors ascend to the heavenly halls,\none’s person ascends at daylight.\nThe Great Dao pervades the Cavernous Void,\nwith mindfulness, nothing fails to align.\nRefining the body to enter the immortal Perfected,\none thus achieves the Vajra Body.\nSurpassing the Three Realms’ difficulties,\nthe Five Sufferings of hell are resolved.\nAll return to the Supreme Lord’s scriptures,\nserene in contemplation, bowing in reverence.\n\nLord Immortal Ge of the Supreme Pole’s Left, named Xuan, styled Xiaoxian,\non Mount Tiantai, bestowed the teachings upon his disciples Zheng Siyuan, the śramaṇa Zhu Falan, Shi Daowei, and Sun Quan of the Wu dynasty.\nLater, Siyuan, in the Horse’s Hoof Mountains, transmitted them to Ge Hong.\nHong was the grandnephew of Lord Immortal Ge, known as the Master Who Embraces Simplicity, authoring inner and outer canonical works.\nAt that time, Master Zheng spoke of the immortal teacher, Lord Immortal Ge, saying:\n\"The *Supreme Clarity Three Caverns Great Perfected Dao Scripture* I have transmitted—\non the day of my departure, one copy shall be entrusted to the famous mountains and terraces of Wu,\none copy to my disciples,\nand one copy to my family’s descendants,\nto be recorded and transmitted through the generations.\"",
      "overlap_context": "rd.\nJewel canopies link jade carriages,\ncommanding the Nine Dragons’ reins.\nGolden Flowers herald the Cavernous Scripture,\nimmortal youths all hold incense.\nWhistling and singing through the Mystic Capital,\njade chimes strike the jasper bells.\nRefining the body to ascend the Great Clarity,\nsurpassing radiance, soaring through the Purple Empyrean.\nUpholding the Dharma’s net,\nroaming the mystic ultimate in carefree ease.\nTen thousand kalpas are like last night,\na thousand cedars like this morning.",
      "start_char": 2499,
      "end_char": 3820,
      "start_sentence": 151,
      "end_sentence": 241,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.19885993003845,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\洞玄灵宝玉京山步虚经.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "至人若但务吾经，驰骋世业，则不堪任录传，可悉付名山五岳，不可轻传非其人也。 有其人者，宜传之，勿闭天道也。 洞玄灵宝玉京山步虚经竟 #1五：当作「三」。 #2上：原误作「山」。",
      "translated_text": "The Perfected One, if merely devoted to these scriptures while pursuing worldly affairs, shall be unworthy of their transmission and recording. They may then be wholly entrusted to the renowned mountains and Five Peaks, and must not be lightly transmitted to those unfit. Should one prove worthy, they ought to be passed on—lest the celestial Dao be obstructed.\n\nThe *Scripture of Cavernous Mystery, Numinous Treasure, and Strolling the Void on Jade Capital Mountain* concludes.\n\n[1] \"Five\" should read \"three.\"\n[2] \"Above\" was mistakenly written as \"mountain.\"",
      "overlap_context": "Lord Immortal Ge, known as the Master Who Embraces Simplicity, authoring inner and outer canonical works.\nAt that time, Master Zheng spoke of the immortal teacher, Lord Immortal Ge, saying:\n\"The *Supreme Clarity Three Caverns Great Perfected Dao Scripture* I have transmitted—\non the day of my departure, one copy shall be entrusted to the famous mountains and terraces of Wu,\none copy to my disciples,\nand one copy to my family’s descendants,\nto be recorded and transmitted through the generations.\"",
      "start_char": 3820,
      "end_char": 3913,
      "start_sentence": 242,
      "end_sentence": 246,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.4088902473449707,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\洞玄灵宝玉京山步虚经.txt",
        "category": "正统道藏续道藏"
      }
    }
  ]
}