{
  "source_id": "洞真太上八素真经精耀三景妙诀",
  "source_file": "chunked_daozang\\洞真太上八素真经精耀三景妙诀.json",
  "total_chunks": 2,
  "total_original_chars": 1985,
  "total_translated_chars": 11912,
  "total_translation_time": 57.270761013031006,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞真太上八素真经精耀三景妙诀.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Wondrous Secrets of the Three Luminaries from the Supreme Perfected Eightfold Simplicity Scripture of the Cavernous Truth**\n\n**Scripture Title:** *The Wondrous Secrets of the Three Luminaries from the Supreme Perfected Eightfold Simplicity Scripture of the Cavernous Truth*\n(Author unknown; approximately dated to the Eastern Jin or Southern Dynasties. Originally part of *The Secrets of the Eightfold Simplicity Scripture*, later extracted as an independent text. One scroll.)\n\n**Method for Absorbing the Qi of the Nine Stars of the Northern Dipper**\n**Method for Absorbing the Qi of the Five Stars of the Five Directions**\n\nThe radiance of the sun and moon is called \"light\"; the essence of the stars is called \"luminosity.\" Together, they are the Seven Luminaries; collectively, they are the Three Luminaries. The Luminaries are the images of bright essence. By aligning with these images, one embraces brightness and absorbs luminosity, attaining longevity and immortality. Such a person is called a \"Child of the Three Luminaries,\" ascending into emptiness and entering the Luminaries, becoming one with the Perfected, transforming freely, and merging with the True. This is a secret of the Supreme Sages—guard it well and do not transmit it recklessly.\n\nConduct this practice on the first nine days of the first, fourth, seventh, and tenth months (the four *meng* months of the year) at dawn; on the nineteenth day of the second, fifth, eighth, and eleventh months (the four *zhong* months) at noon; and on the twenty-ninth day of the third, sixth, ninth, and twelfth months (the four *ji* months) at midnight. Perform it once at dawn, noon, and midnight, and again at midnight until dawn, and dawn until noon. In a year, this amounts to thirty-six repetitions, corresponding to the three hundred and sixty degrees of the celestial cycle. The surplus of five represents the overflow of qi.\n\nOn the appointed days and hours, enter a purified chamber with solemn reverence. Burn incense, concentrate the mind, close the eyes, and hold the breath. Knock the teeth nine times, and visualize the divine lords of the Nine Star Palaces, majestic and dignified, surrounded by their retinues.\n\n1. The first, the Yang Brightness Divine Person, exhales a light of blue qi.\n2. The second, the Yin Essence Divine Person, exhales a light of black qi.\n3. The third, the Perfected Person Divine Person, exhales a light of yellow qi.\n4. The fourth, the Profound Darkness Divine Person, exhales a light of red qi.\n5. The fifth, the Cinnabar Prime Divine Person, exhales a light of white qi.\n6. The sixth, the Northern Culmen Divine Person, exhales a light of green qi.\n7. The seventh, the Celestial Pass Divine Person, exhales a light of crimson qi.\n8. The eighth, the Assistant Star Divine Person, exhales a light of azure qi.\n9. The ninth, the Adjuvant Star Divine Person, exhales a light of dark qi.\n\nEach of the nine qi descends from its star into the practitioner’s mouth in sequence. Inhale deeply, swallowing the qi without limit, then exhale the old qi gently. Gradually absorb the nine-colored new qi, swallowing them completely. Knock the teeth nine times, and proceed with sitting, lying, walking, or resting as usual. After nine years of this practice, the Nine August Divine Lords will descend to transmit their secrets. You will attain longevity and immortality, ascend to the Three Heavens, befriend the host of Perfected, and merge with the Dao.\n\n**Method for Absorbing the Qi of the Five Stars of the Five Directions**\n- **South:** Fire Star (Mars)\n- **East:** Year Star (Jupiter) ● **Center:** Quelling Star (Saturn) ●\n- **West:** Grand White Star (Venus)\n- **North:** Celestial Star (Mercury)\n\nOn the days of the Five Kings and during the hours of the Six *Ding*, enter a purified chamber with solemn reverence. Burn incense, concentrate the mind, close the eyes, and hold the breath. Knock the teeth twenty-five times, swallow saliva twenty-five times, calm the heart, and regulate the breath. Sit upright and still, visualizing the Year Star’s blue qi, the Fire Star’s red qi, the Grand White Star’s white qi, the Celestial Star’s black qi, and the Quelling Star’s yellow qi, each in their respective directions. The qi should be vibrant and shimmering, swirling and intertwining, blending the five colors into a radiant brilliance that crowns the heavens and fills the earth, suffusing the four directions. It should illuminate the practitioner’s body, inside and out, until the body grows warm and fragrant.\n\nFace the direction of the ruling star and first swallow its qi, then proceed to absorb the qi in the order of generation. Repeat this cycle until complete. The number of swallows corresponds to the ruling star: nine for the East, eight for the South, three for the intermediate directions, six for the West, and five for the North. Once finished, knock the teeth twenty-five times and swallow saliva twenty-five times. After five years of practice, the Five Emperors will guide you to wander and feast in the Jade Capital, and you will forever become a Perfected Person.\n\n**General Precepts for Absorbing the Qi of the Sun, Moon, Northern Dipper, and Five Stars:**\nDo not speak excessively. Do not over-exert yourself. Do not indulge in laziness. Do not succumb to joy or anger. Do not raise your voice. Do not pry into others’ affairs. Do not seek favor from superiors or inferiors. Do not isolate yourself or stand apart. Do not mingle with the unworthy. Do not claim to possess the Dao. Do not disclose your methods. Do not impatiently seek quick results. Do not doubt the divine. Do not abandon yourself to pursue external things. Do not manipulate things to suit yourself. Do not betray the Two Images. Do not defy the Three Honored Ones.\n\nEven if you observe other precepts and study various disciplines, without adhering to these principles, the Mysterious Spirits will not take pity, nor will they descend to aid you. No effects will manifest, and no attainment will be achieved. The resources for attaining the Dao lie in these secrets. Companions on the path of higher learning must earnestly uphold and practice them.\n\nThose who revere the Three Luminaries are called Disciples of the Three Luminaries. After guiding three others across, entrust the teachings to a master or friend. Thereafter, in transmission, one may be called a Master of the Three Luminaries, a Teacher, or a Perfected Person, as designated by one’s master or recommended by peers. Without formal petition and approval, one must not presumptuously adopt such titles. Those who arrogantly claim grand names for personal gain will face severe penalties and deep retribution, with no pardon even after three reprieves. If transgressions occur, promptly repent and face the Azure Lad to rectify past errors. Follow the master’s instructions and do not repeat the offense; three offenses will nullify all prior merit. Even repeated apologies will only compound the labor and increase the sin. Those who study with diligence must exercise utmost caution.\n\nFor those who receive the Dao, the greatest treasure lies in immortality. Through effective cultivation, one secures longevity, and with unbroken continuity of life, one becomes a True Sage. The foundation of sageliness lies in transforming others through practice, and through teaching, one revives the lost. Those who remain deluded and refuse to follow are pitied without abandonment. Turning delusion toward rectitude, one comforts them with even greater diligence.\n\nThose who show kindness reward the compliant without growing weary or disdainful; those who grieve for the disobedient harbor no anger or resentment. When reproaching with stern words, first examine their hearts: if receptive, feign goodness to move them; if resistant, conceal displeasure to pacify them. Pacify without breeding resentment, for resentment only deepens their faults. Persuade them often, ensuring their progress—regression brings ease and forfeits fortune. To cultivate alone yields no merit, and virtue cannot be perfected.\n\nIn the Great Antiquity, affairs were few, transgressions rare; no merit was needed for redemption. Through focused contemplation and stillness, with no exchange between self and others, all attained the True Dao. Since the Middle Antiquity, affairs have multiplied, grievances accumulated—urgent merit must be established. Sacrifice the self to save others, uphold the Dao, recite scriptures, and follow the master without negligence. Devote day and night with single-mindedness, toil with body and heart without shirking labor. The peril of evil is as startling as plunging into boiling water; the eagerness for goodness is as urgent as thirst driving one to drink.\n\nWhen the world is obstructed, temporarily preserve independence; when the world flows freely, extend boundless aid. If peril cannot be averted, depart in leisure, yet sorrow lingers in the heart, and remembrance never ceases. For those in decline who can be saved, exert tireless effort—restrain and guide, give and take, expand and contract as circumstances demand. Joy and anger, reward and punishment, demotion and promotion—all must align with the times. The flow of time has its favor and disfavor; the sagely and true have their actions and retreats. Without utmost refinement, none can comprehend this.\n\nThe shallow and unlearned falsely claim truth, forcing minor practices into grand ones. Unaware of obstruction or opportunity, they act recklessly, seeking merit where none can be established. Disaster strikes unperceived, and success turns to failure. Some persist unrepentant, turning calamity into fortune; others repent too late, with no chance for recovery. The cycle of the Five Sufferings is profoundly grievous.\n\nThose who aspire to higher learning must scrutinize these truths. In transforming self and others, one must assess capacity—do not expect a mosquito to bear a mountain. Do not wait for failure to awaken. Each method, great or small, possesses its subtleties; cultivate according to ability and sequence, always following the master’s instructions, never relying on one’s own inclinations. The heart is like a monkey or an ape, or like a flickering flame—uncontrollable, ungraspable. Without a master, how can it be corrected? Yet correction also depends on the self. Half lies with the self, half with the master; when the two halves unite, truth is achieved. Without the self, even a master cannot transform; without a master, even the self cannot evolve.\n\nTransformation and change mean abandoning the old for the new, forsaking evil for goodness, refining falsity into truth. The merit of a true master and the virtue of true substance, when harmonized, endure eternally, merging with the Dao.\n\nThose who aspire to study the Dao yet feel shame in learning from a master, who steal scriptures, purchase precepts and commandments, yet fail to grasp their profound meanings and act at will—even if they do not follow sacred texts but follow their nature to do good, their goodness, though genuine, remains incomplete. Partial goodness cannot constitute great virtue. Demons come to corrupt them, leading them into heretical factions, forever severed from the Dao. They labor under the name of learning yet gain no true attainment—this, too, is lamentable.\n\nSuch individuals must swiftly repent; early awakening allows salvation, but delay makes success difficult. Learners must reflect on themselves and others. Though others are hard to know, one can discern them through method: observe their conduct and demeanor, examine their inner and outer selves. Heart and body can be understood, truth and falsity can be clarified. Dispel falsity, reward truth—then merit and virtue will manifest.\n\n*The Supreme Perfection of the Eight Pure Scriptures of the Cavernous Truth: The Wondrous Secrets of the Three Radiant Realms of Essence* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真太上八素真经精耀三景妙诀 经名：洞真太上八素真经精耀三景妙诀。 撰人不详，约出於东晋南朝。 原为《八素真经诀》之一，徒分出单行。 一卷。 底本出处：《正统道藏》正一部。 洞真太上八素真经精耀三景妙诀 服北斗九星法 服五方五星法 服北斗九星法 日月之明谓之光，星辰之精谓之耀，总曰七曜，统曰三景。 景者，明精之象也。 缘象得明，含明纳耀，长生不死，号三景之人，升虚入景，与真为一，变化自在，与真合同。 上圣所秘，慎莫妄传。 常以正月、四月、七月、十月，四孟之月上旬，九日平旦； 又以二月、五月、八月、十一月，四仲之中旬，十九日之正中； 又以三月、六月、九月、十二月，四季之下旬，二十九日之夜半，一月一日，三过行之。 平旦中及夜，中及夜至旦，夜及旦至中。 一年三十六过，应三百六十度之数。 以五为盈气为余也。 至行日时，清严入室，烧香精思，临目闭气，叩齿九通，存见九星宫府神君，威容端正，侍卫畟然。 第一阳明神人，吐青气之光。 第二阴精神人，吐黑气之光。 第三真人神人，吐黄气之光。 第四玄冥神人，吐赤气之光。 第五丹元神人，吐白气之光。 第六北极神人，吐绿气之光。 第七天关神人，吐绛气之光。 第八辅星神人，吐碧气之光。 第九弼星神人，吐玄气之光。 九气各从星中，下吐兆口中，随次而吐，极气吞之，无极微微通，细细吐故气，仍渐渐纳新气九色，咽之都竟，叩齿九通，坐卧行息，动静适人。 如此九年，九皇神君降受兆诀，长生不死，上升三天，结友众真，与道合同矣。 服五方五星法 ●南荧惑星 东岁星●　　　● 中镇星　　●西太白星 ●北辰星 常以五王之日，六丁之时，精严入室，烧香存神，临目闭气，叩齿二十五通，咽液二十五过，和心平气，正身静止，见岁星青气、荧惑赤气、太白白气、辰星黑气、镇星黄气，各在其方，郁郁瑛瑛，氛氲相绕，五色混合，皎皎明明，冠天洞地，布满四方，中映兆身，内外同浃，良久体暖，香气芬芳。 乃向王方，先咽王气，次咽相生，周徧乃止。 咽各依王数，东九、南八、维三、西六、北五。 都毕，又叩齿二十五通，咽液二十五过。 习之五年，五帝提携，游宴玉京，永成真人矣。 凡服日月、北斗、五星光精之气，不得多言，不得过劳，不得怠逸，不得喜怒，不得高声，不得妄知他事，不得干求尊卑，不得偏枯独立，不得混杂非侪，不得自称有道，不得说其学方，不得急望速验，不得疑惑神明，不得舍己逐物，不得制物顺身，不得负违二象，不得乖伐三尊。 虽修余戒，习诸律科，不得此旨，玄灵不矜，不降不佑，不效不成。 成道之资，在乎此诀，上学之侣，谛奉施行。 凡尊三景，称三景弟子。 已度三人，委付师友，已后传授，得称三景法师、先生、真人。 随师所命，朋友所荐，乃得称之。 未经表奏，不得妄称，妄称大名，苟贪尊号，考重罚深，三宥不赦。 有犯急谢，首向青童，改革先弊。 依按师言，不得又犯，三犯元原。 □#1复数谢，劳而罪增，精学之士，明加详慎。 凡受道之士，贵在不死，修行有效，保得长生，生生不绝，乃成真圣。 圣基行化，化教复生，迷者不从，哀之不舍，反迷顺正，慰之弥勤。",
      "translated_text": "**The Wondrous Secrets of the Three Luminaries from the Supreme Perfected Eightfold Simplicity Scripture of the Cavernous Truth**\n\n**Scripture Title:** *The Wondrous Secrets of the Three Luminaries from the Supreme Perfected Eightfold Simplicity Scripture of the Cavernous Truth*\n(Author unknown; approximately dated to the Eastern Jin or Southern Dynasties. Originally part of *The Secrets of the Eightfold Simplicity Scripture*, later extracted as an independent text. One scroll.)\n\n**Method for Absorbing the Qi of the Nine Stars of the Northern Dipper**\n**Method for Absorbing the Qi of the Five Stars of the Five Directions**\n\nThe radiance of the sun and moon is called \"light\"; the essence of the stars is called \"luminosity.\" Together, they are the Seven Luminaries; collectively, they are the Three Luminaries. The Luminaries are the images of bright essence. By aligning with these images, one embraces brightness and absorbs luminosity, attaining longevity and immortality. Such a person is called a \"Child of the Three Luminaries,\" ascending into emptiness and entering the Luminaries, becoming one with the Perfected, transforming freely, and merging with the True. This is a secret of the Supreme Sages—guard it well and do not transmit it recklessly.\n\nConduct this practice on the first nine days of the first, fourth, seventh, and tenth months (the four *meng* months of the year) at dawn; on the nineteenth day of the second, fifth, eighth, and eleventh months (the four *zhong* months) at noon; and on the twenty-ninth day of the third, sixth, ninth, and twelfth months (the four *ji* months) at midnight. Perform it once at dawn, noon, and midnight, and again at midnight until dawn, and dawn until noon. In a year, this amounts to thirty-six repetitions, corresponding to the three hundred and sixty degrees of the celestial cycle. The surplus of five represents the overflow of qi.\n\nOn the appointed days and hours, enter a purified chamber with solemn reverence. Burn incense, concentrate the mind, close the eyes, and hold the breath. Knock the teeth nine times, and visualize the divine lords of the Nine Star Palaces, majestic and dignified, surrounded by their retinues.\n\n1. The first, the Yang Brightness Divine Person, exhales a light of blue qi.\n2. The second, the Yin Essence Divine Person, exhales a light of black qi.\n3. The third, the Perfected Person Divine Person, exhales a light of yellow qi.\n4. The fourth, the Profound Darkness Divine Person, exhales a light of red qi.\n5. The fifth, the Cinnabar Prime Divine Person, exhales a light of white qi.\n6. The sixth, the Northern Culmen Divine Person, exhales a light of green qi.\n7. The seventh, the Celestial Pass Divine Person, exhales a light of crimson qi.\n8. The eighth, the Assistant Star Divine Person, exhales a light of azure qi.\n9. The ninth, the Adjuvant Star Divine Person, exhales a light of dark qi.\n\nEach of the nine qi descends from its star into the practitioner’s mouth in sequence. Inhale deeply, swallowing the qi without limit, then exhale the old qi gently. Gradually absorb the nine-colored new qi, swallowing them completely. Knock the teeth nine times, and proceed with sitting, lying, walking, or resting as usual. After nine years of this practice, the Nine August Divine Lords will descend to transmit their secrets. You will attain longevity and immortality, ascend to the Three Heavens, befriend the host of Perfected, and merge with the Dao.\n\n**Method for Absorbing the Qi of the Five Stars of the Five Directions**\n- **South:** Fire Star (Mars)\n- **East:** Year Star (Jupiter) ● **Center:** Quelling Star (Saturn) ●\n- **West:** Grand White Star (Venus)\n- **North:** Celestial Star (Mercury)\n\nOn the days of the Five Kings and during the hours of the Six *Ding*, enter a purified chamber with solemn reverence. Burn incense, concentrate the mind, close the eyes, and hold the breath. Knock the teeth twenty-five times, swallow saliva twenty-five times, calm the heart, and regulate the breath. Sit upright and still, visualizing the Year Star’s blue qi, the Fire Star’s red qi, the Grand White Star’s white qi, the Celestial Star’s black qi, and the Quelling Star’s yellow qi, each in their respective directions. The qi should be vibrant and shimmering, swirling and intertwining, blending the five colors into a radiant brilliance that crowns the heavens and fills the earth, suffusing the four directions. It should illuminate the practitioner’s body, inside and out, until the body grows warm and fragrant.\n\nFace the direction of the ruling star and first swallow its qi, then proceed to absorb the qi in the order of generation. Repeat this cycle until complete. The number of swallows corresponds to the ruling star: nine for the East, eight for the South, three for the intermediate directions, six for the West, and five for the North. Once finished, knock the teeth twenty-five times and swallow saliva twenty-five times. After five years of practice, the Five Emperors will guide you to wander and feast in the Jade Capital, and you will forever become a Perfected Person.\n\n**General Precepts for Absorbing the Qi of the Sun, Moon, Northern Dipper, and Five Stars:**\nDo not speak excessively. Do not over-exert yourself. Do not indulge in laziness. Do not succumb to joy or anger. Do not raise your voice. Do not pry into others’ affairs. Do not seek favor from superiors or inferiors. Do not isolate yourself or stand apart. Do not mingle with the unworthy. Do not claim to possess the Dao. Do not disclose your methods. Do not impatiently seek quick results. Do not doubt the divine. Do not abandon yourself to pursue external things. Do not manipulate things to suit yourself. Do not betray the Two Images. Do not defy the Three Honored Ones.\n\nEven if you observe other precepts and study various disciplines, without adhering to these principles, the Mysterious Spirits will not take pity, nor will they descend to aid you. No effects will manifest, and no attainment will be achieved. The resources for attaining the Dao lie in these secrets. Companions on the path of higher learning must earnestly uphold and practice them.\n\nThose who revere the Three Luminaries are called Disciples of the Three Luminaries. After guiding three others across, entrust the teachings to a master or friend. Thereafter, in transmission, one may be called a Master of the Three Luminaries, a Teacher, or a Perfected Person, as designated by one’s master or recommended by peers. Without formal petition and approval, one must not presumptuously adopt such titles. Those who arrogantly claim grand names for personal gain will face severe penalties and deep retribution, with no pardon even after three reprieves. If transgressions occur, promptly repent and face the Azure Lad to rectify past errors. Follow the master’s instructions and do not repeat the offense; three offenses will nullify all prior merit. Even repeated apologies will only compound the labor and increase the sin. Those who study with diligence must exercise utmost caution.\n\nFor those who receive the Dao, the greatest treasure lies in immortality. Through effective cultivation, one secures longevity, and with unbroken continuity of life, one becomes a True Sage. The foundation of sageliness lies in transforming others through practice, and through teaching, one revives the lost. Those who remain deluded and refuse to follow are pitied without abandonment. Turning delusion toward rectitude, one comforts them with even greater diligence.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1287,
      "start_sentence": 0,
      "end_sentence": 52,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.89540338516235,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八素真经精耀三景妙诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "慈奖顺者，不生厌倦，悲念不从，无起忿嗔。 嗔之责语，先观其心，可者假善以感之，不可藏怼以和之，和之不使其怨，怨则更致其咎。 多感之，必令其进，退则逸福得福，独学无功，不能成德。 太古无事，其愆自少，不须功赎，精思守静，不相往来，皆得真道。 中古以来，有事转纷，仇衅既积，急宜立功，损己救物，存道诵经，从师敢懈，日夜专心，心身运役，苦不辞劳，避恶之势，惊若探汤，就善之慊，如渴趣饮。 世塞则暂存独立，世通则永申博济，危不可扶，逍遥而去，哀之在心，念之无已。 衰可救者，殷懃经营，抑引取与，歙张察时，喜怒赏罚，黜陟随时。 运时有可否，圣真有行藏，自非至精，莫能了此。 粗浅末学，以伪称真，强小行大，不识塞通，乱不知避，妄欲立功，祸至不悟，图成反败。 或有不悔，持祸作福，或有晚悔，无所复追，轮回五苦，良深可痛。 上学志士，明加研详，化身化物，必度才能，无以蚊虻负山，不可败后方悟，大小各有妙法，量力随次修之，皆从师诀，不可任心。 心如猴猨，又似熛火，不可执制，不可把持，自非师君，安能使正。 正又由己，己半师半，两半为一，乃得成真。 己无师有，亦不能回，己有师无，亦不能化。 化回变易，去故就新，舍恶入善，练伪成真。 真师之功，真质之德，功和合永，与道同也。 凡志欲学道，耻於师人，窃盗经书，买赎戒律，不解玄诰，随意行之。 或不从圣典，率性为善，善实善矣，善实不充，偏为小善，不成大德，魔来坏之，遂陷邪党，与道永隔，徒劳学名，不得学实，此又可悲。 如斯之流，急宜改悔，早觉可救，晚则难成。 学者自省，省己及人，人虽难知，知之以法，法察兴居，观其内外，心身可解，虚实可明，除虚奖实，功德有征矣。 洞真太上八素真经精耀三景妙诀竟 #1原本此处缺一字。",
      "translated_text": "Those who show kindness reward the compliant without growing weary or disdainful; those who grieve for the disobedient harbor no anger or resentment. When reproaching with stern words, first examine their hearts: if receptive, feign goodness to move them; if resistant, conceal displeasure to pacify them. Pacify without breeding resentment, for resentment only deepens their faults. Persuade them often, ensuring their progress—regression brings ease and forfeits fortune. To cultivate alone yields no merit, and virtue cannot be perfected.\n\nIn the Great Antiquity, affairs were few, transgressions rare; no merit was needed for redemption. Through focused contemplation and stillness, with no exchange between self and others, all attained the True Dao. Since the Middle Antiquity, affairs have multiplied, grievances accumulated—urgent merit must be established. Sacrifice the self to save others, uphold the Dao, recite scriptures, and follow the master without negligence. Devote day and night with single-mindedness, toil with body and heart without shirking labor. The peril of evil is as startling as plunging into boiling water; the eagerness for goodness is as urgent as thirst driving one to drink.\n\nWhen the world is obstructed, temporarily preserve independence; when the world flows freely, extend boundless aid. If peril cannot be averted, depart in leisure, yet sorrow lingers in the heart, and remembrance never ceases. For those in decline who can be saved, exert tireless effort—restrain and guide, give and take, expand and contract as circumstances demand. Joy and anger, reward and punishment, demotion and promotion—all must align with the times. The flow of time has its favor and disfavor; the sagely and true have their actions and retreats. Without utmost refinement, none can comprehend this.\n\nThe shallow and unlearned falsely claim truth, forcing minor practices into grand ones. Unaware of obstruction or opportunity, they act recklessly, seeking merit where none can be established. Disaster strikes unperceived, and success turns to failure. Some persist unrepentant, turning calamity into fortune; others repent too late, with no chance for recovery. The cycle of the Five Sufferings is profoundly grievous.\n\nThose who aspire to higher learning must scrutinize these truths. In transforming self and others, one must assess capacity—do not expect a mosquito to bear a mountain. Do not wait for failure to awaken. Each method, great or small, possesses its subtleties; cultivate according to ability and sequence, always following the master’s instructions, never relying on one’s own inclinations. The heart is like a monkey or an ape, or like a flickering flame—uncontrollable, ungraspable. Without a master, how can it be corrected? Yet correction also depends on the self. Half lies with the self, half with the master; when the two halves unite, truth is achieved. Without the self, even a master cannot transform; without a master, even the self cannot evolve.\n\nTransformation and change mean abandoning the old for the new, forsaking evil for goodness, refining falsity into truth. The merit of a true master and the virtue of true substance, when harmonized, endure eternally, merging with the Dao.\n\nThose who aspire to study the Dao yet feel shame in learning from a master, who steal scriptures, purchase precepts and commandments, yet fail to grasp their profound meanings and act at will—even if they do not follow sacred texts but follow their nature to do good, their goodness, though genuine, remains incomplete. Partial goodness cannot constitute great virtue. Demons come to corrupt them, leading them into heretical factions, forever severed from the Dao. They labor under the name of learning yet gain no true attainment—this, too, is lamentable.\n\nSuch individuals must swiftly repent; early awakening allows salvation, but delay makes success difficult. Learners must reflect on themselves and others. Though others are hard to know, one can discern them through method: observe their conduct and demeanor, examine their inner and outer selves. Heart and body can be understood, truth and falsity can be clarified. Dispel falsity, reward truth—then merit and virtue will manifest.\n\n*The Supreme Perfection of the Eight Pure Scriptures of the Cavernous Truth: The Wondrous Secrets of the Three Radiant Realms of Essence* concludes.",
      "overlap_context": "must exercise utmost caution.\n\nFor those who receive the Dao, the greatest treasure lies in immortality. Through effective cultivation, one secures longevity, and with unbroken continuity of life, one becomes a True Sage. The foundation of sageliness lies in transforming others through practice, and through teaching, one revives the lost. Those who remain deluded and refuse to follow are pitied without abandonment. Turning delusion toward rectitude, one comforts them with even greater diligence.",
      "start_char": 1287,
      "end_char": 1996,
      "start_sentence": 53,
      "end_sentence": 74,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.375357627868652,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八素真经精耀三景妙诀.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}