{
  "source_id": "洞真太上丹景道精经",
  "source_file": "chunked_daozang\\洞真太上丹景道精经.json",
  "total_chunks": 3,
  "total_original_chars": 2549,
  "total_translated_chars": 17139,
  "total_translation_time": 84.6875011920929,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞真太上丹景道精经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Cavern-Real Scripture of the Cinnabar Radiance and Dao-Essence**\n\n**Scripture Title:** *The Supreme Cavern-Real Scripture of the Cinnabar Radiance and Dao-Essence*. Author unknown, approximately composed during the Northern and Southern Dynasties. Allegedly transmitted by Gu Xizi. The text expounds the method of reciting *The Jade Radiance Inner True Metal Chapters of the Curved Simplicity Verses*. One scroll. Base text from *The Orthodox Daoist Canon*, Zhengyi Section, First Subsection.\n\n---\n\n**The Supreme Cavern-Real Scripture of the Cinnabar Radiance and Dao-Essence**\n\nThe Yellow Lad Perfected of Taigu, Master Gu Xizi, transmitted this. I received and practiced it, sealing one lineage within Mount Daizong, distinct in name yet akin in practice to the Eight Hidden Earth Techniques. The Eight Techniques bear eight names, concealed within a jade tome, sealed with a golden chapter, attended by jade lads and guarded by jade maidens, each numbering eight hundred. The Jade Dawn bestowed this upon the Nine Mysteries, and only after seven thousand years was it passed to me.\n\nThis *Cinnabar Radiance* also bears two names: first, *The Supreme Cavern-Real Scripture of the Cinnabar Radiance and Dao-Essence*; second, *The Jade Radiance Inner True Metal Chapters of the Three Primordials’ Curved Simplicity Verses*. It shares a name yet differs in substance from the *Verses of Sorrow and Joy*. Only after seven thousand years may it be transmitted thrice; if a worthy recipient appears within a hundred years, they too may receive three transmissions, granted two jade lads and two jade maidens.\n\nNow, *The Jade Radiance Inner True Metal Chapters of the Curved Simplicity Verses* is the supreme composition of the August Emperor Lord of the Void and the treasured verses of the Three Primordials Lord of Grand Simplicity. Smoke coalesces into script, jade waves arise from emptiness; the true pervades the arcane discourse, while simplicity shines within the golden chamber. Thus, it can dispel the Six Heavens at the inception of the Three Transformations, summon the Five Spirits amid the Seven Revolutions, govern the One and align the Three so that numinous immortals descend to repose, and revolve the Seven and shift the Five so that responses to summons know no bounds. It venerates the Two Honored Ones in the tranquil hall and stirs luminous wisdom in the frigid numen.\n\nThereupon, mountains and marshes submit their essence, water sources conceal and vanish, a thousand demons are collectively executed, and the Nine Fiends lose their footing. It unlocks the Five Hundred within the golden chapters, summons the Feng and Hua to the imperial throne. Then, the Jade Flower abides in repose, the Five Elders chant in unison, divine soldiers bind demons, and perverse vapors cease their clamor. It delivers the Seven Ancestors from the Southern Palace, receives their embryonic forms in the dawn’s aurora, bows to the Supreme One at the Flowery Gate, and pays homage to the Grand Simplicity in the Western Court. It transcends the Five Ranks within the imperial chamber and exhausts the Two Modes without decay.\n\nThis is the loftiest chapter of the utmost reality, the very standard by which demons are subdued. In accordance with the statutes of the Four Poles’ Luminous Regulations, it may be transmitted twice within five hundred years.\n\nIf a practitioner regularly recites the *Curved Simplicity Verses* in a serene chamber, the Five Elders will attend at dawn, and the maidens of the Jade Flower will descend at dusk. The martial might of the Great Script will ward off inauspiciousness, the spirits of springs and marshes will come to pay homage, and the true numina of the Five Peaks will bow before them.\n\nShould one wish to command or summon, perform the Seven Revolutions and Five Transformations. First, align the heart toward the north, visualize and venerate the Three Primordials Lord of Grand Simplicity within the Golden Flower Palace, and then bow to the Supreme Jade Dawn Lord in the Sevenfold Radiance Chamber. These Two Honored Lords—jade purity gleaming in emptiness, golden countenance radiant with lingzhi—adorn their resplendent chambers with haloed light, their brilliance flashing across the Eight Mysteries.\n\nOnce visualization is complete, strike the teeth twelve times. First, thrice recite the *Incantation of the Golden Perfected*, then recite the Fourth Chapter of the Upper Grade, followed by the Second Chapter, the Sixth Chapter, the Third Chapter, and the Fifth Chapter. The Upper and Middle Grades together comprise fourteen chapters; recite them all in sequence. Then, with eyes closed, visualize the summoned entity, and it shall arrive in accordance with the heart’s intent.\n\nTo summon the numina of the Five Peaks, the Directors of Destiny and Records, and the Three Officials of the Northern Emperor, command them to expunge the ledgers of sin, inscribe names for life, eradicate the vapors of demonic perversity, and sever the roots of trial and tribulation. Once the edict is pronounced, promptly dispatch them; take care not to detain them overlong. This Dao may be practiced thrice within a month.\n\nIf one merely seeks to dispel inauspiciousness and subdue demonic perversity, it may be performed without prior purification. First recite the Third Chapter of the Middle Grade, then the Second Chapter of the Upper Grade, followed by the Seventh Chapter of the Middle Grade, the Fourth Chapter of the Middle Grade, the Sixth Chapter of the Upper Grade, and thrice recite the *Incantation of the Golden Perfected*. This is the Dao of the Five Transformations, for summoning and subduing demonic spirits. It may be performed singly, without additional visualization or veneration.\n\nIf one wishes to absolve the sins of the Seven Ancestors and deliver their embryonic forms to the imperial honored ones, the practitioner must first perform visualization as above, then recite the First Chapter of the Upper Grade thrice in succession, each time followed by a recitation of the *Incantation of the Golden Perfected*. Within a single day, complete three to five hundred recitations, constituting one grade of passage. Upon completing five hundred grades, the Seven Ancestors shall become embryonic immortals, and the practitioner shall ascend the Three Heavens.\n\nWhen reciting the scripture, take care that the verses contain no errors; ten errors incur the penalty of one grade. When attempting to pass the great grades, one must first purify for three hundred days, bathe in the five fragrances, ensure the body is clad in purity, sever all worldly affairs, and free the heart from scheming thoughts. Only then may one proceed with visualization and practice.\n\n---\n\n**The Jade Radiance Inner True Metal Chapters of the Three Primordials’ Curved Simplicity Verses**\n\n**Upper Grade, First Chapter:**\nThe Northern Director records the subjects, the Four Directors wield the numinous,\nThe Southern Harmony unites the Nine Perfected, transforming and merging with majestic clarity.\nTogether with the Feathered Great One, the Jade Radiance raises its banner,\nInspecting and recording the Five Spirits, summoning the lofty mandate of the Northern Clarity.\nDemon spirits receive their tasks, myriad directors suppress their voices,\nThe Four Confluxes of the Great Yin ascend the cloud capital in radiance.\n\n**Middle Grade, First Chapter:**\nThe Supreme One entrusts the Jade Director, the Nine Heavens govern the divine encampments,\nUniting these to return to flourishing harmony, entrusting qi to tread upon numinous prosperity.\nSummoning demons and binding ghostly essences, the Director of Records takes his place in the imperial court,\nHastening to summon the springs’ curves, bearing halberds to attend the divine encampment.\n\n**Upper Grade, Second Chapter:**\nRevolving through the Three Mysteries, governing the mandate of the Four Directors,\nThe Great One’s primordial prohibition, grasping the tally to come and go.\nThe Nine Sources fall and vanish, binding and recording ghosts and deities,\nThe Great Emperor supports the throne, the Five Elders align in accord.\n\n**Illuminating the Perfected and Recording the Hun-Souls,**\nThe Flourishing Prime orders the po-souls,\nSeven Wisdoms chant in unison, ever-preserving eternal peace.\nPetitioning to govern inauspicious omens, seizing demons to guard the registers,\nThe Director of Transgressions punishes malevolence, the Six Heavens are overthrown and cast down.\nMay the upper wish be for ascension as an immortal, the body rising to the morning abode.\n\n**Middle Grade, Second Chapter:**\nCirculating qi into the Great Primordium, absolving transgressions and arraying the Emperor’s charts,\nThe Mysterious Register is inscribed upon the vermilion carriage, the Nine Perfected hold the golden tally.\nEntering and exiting without fixed abode, unyoking the chariot at the august person’s home,\nThe Four Illuminations serve the divine lineage, the jade pennant summons the myriad demons.\nLofty warriors array before the Emperor’s marshals, punishing those who bear the Feng chapter.\n\n**The Great Simplicity Metal Perfected’s Inner Perfected Demon-Quelling Incantation:**\nThe Great Primordium initiates the Perfected, the myriad spirits are bound by the net,\nThe Agricultural Director flees the marsh, the Four Lads sharpen their fangs.\nThe Metal Immortals wield axes, the celestial hosts fill the ranks with halberds,\nFire standards brandish blades, water-armored troops guide the waves.\nRushing to cast down the Nine Heavens, washing and cleansing the Mysterious River,\nHowling beasts and venomous serpents, eagles and birds strike the demons.\nMountain spirits submit and vanish, the Seven Images harmonize in union,\nBeheading a thousand demons, jointly executing the Feng’s flourishing,\nThe golden might shakes and topples, the Six Heavens wither and perish.\nThe Three Primordials proclaim the mandate, the myriad spirits respond in unison,\nThe Four Illuminations hear the summons, petitioning to record the Emperor’s charts.\n\n**Upper Grade, Third Chapter:**\nThe Great Emperor issues the supreme command, the Mysterious Prime’s four chapters,\nThe Heavenly Emperor wields the axe, the Director of Destinies upholds the net.\nThe Primordial Perfected guards the registers, the Seven Talismans govern the August One,\nThe Divine Lineage assists and protects, preserving life and peach-blossom well-being.\nThe host of demons receives its duties, responding to the summons and assembling in the regions,\nA thousand demons submit and vanish, mountains and peaks open their beams.\nGrasping the tally to hasten their arrival, the myriad evils wound themselves,\nThe mandate of the Nine Heavens, recorded as guests within the royal court.\n\n**Middle Grade, Third Chapter:**\nThe Four Falls of Mount Feng, hastening to audit the demon metropolis,\nThe Western August One brandishes the wheel, the Southern Perfected presents the scripture.\nThe Great One shares the same chariot, the Dark and Secluded Earl is nameless,\nThe Three Primordials hold the registers, the Duke’s Son confirms the tally.\nThe Nine Ghosts and Seven Expanses respond to the summons and face execution,\nA thousand spirits receive their duties, serving me without cease.\n\n**Upper Grade, Fourth Chapter:**\nThe Director of Destinies, Perfected Lord of the Northern Expansion, stabilizes wisdom,\nNurturing the light in the divine court, the Cinnabar August One rests in tranquility.\nClouds restrain and guard the numinous, the myriad demons are gathered and quelled,\nThe Director of Destinies holds the tally, the Duke’s Son guards the registers.\nThe Immortal King urges his chariot forward, the divine splendor erects its lofty canopy,\nThe Five Peaks present their axles, a thousand demons are gathered and cast down.\nGhosts vanish in the forbidden court, malevolence submits to the Emperor’s vast net.\n\n**Middle Grade, Fourth Chapter:**\nThe Great Non-Being’s mighty divine treasure, its perfect clarity reflects the Three Clarities,\nThe Purple Void’s square jade drum, the upper radiance firmly secures the celestial essence.\nThe Three Officials hasten to receive their duties, the Peak Perfected arrive once at the court,\nThe Four Directors clearly proclaim the morning prohibitions, a thousand demons feign submission in form.\n\n**Upper Grade, Fifth Chapter:**\nThe Supreme Emperor congeals the heavens, hastening the command to the Four Perfected,\nThe numinous prime arrays the plain, the divine tiger guards the borders.\nForever seizing the nether regions, suddenly casting down Mount Feng,\nDemons submit in the Fire Palace, spirits vanish before the Emperor.\nThose summoned hasten to arrive, no ghosts nor Perfected remain,\nThe Three Primordials proclaim the tally, the Register’s radiance welcomes the August Guest.\n\n**Middle Grade, Fifth Chapter:**\nThe Jade Void governs the Emperor’s radiance, the mysterious qi gathers in the mud-pill,\nThe Nine Perfected array in the Flower Chamber, the Duke pacifies and harmonizes the Mysterious Elixir.\nThe Three Officials of Mount Tai, coming forth to address the Emperor,\nSeizing demons and binding ghostly essences, riding the radiance to the Great Simplicity’s apex.\nThe seven ancestors uproot stagnant roots, the million bodies ascend the Three Heavens.\n\n**Upper Grade, Sixth Chapter:**\nThe Great Non-Being’s upper radiance, the Southern Perfected receives the numinous,\nRising from non-being and grasping the tally, the Mysterious One assists the pennant.\nThe Illuminated Perfected holds the luminaries, ascending to tread upon the cloud court,\nThe Nine Talismans hasten the summons, the host of demons vanishes in form.\nPeak ghosts submit and arrive, the Six Heavens are overthrown and toppled.\nThose who are malevolent are executed, those who are good are surely nurtured.\nThe Emperor and the Great One record and inscribe the names in the registers,\nI share in the root of fortune, flying as an immortal to the Upper Clarity.\n\n**Middle Grade, Sixth Chapter:**\nThe Nine Heavens possess revered directors, the Imperial One governs the numinous insignia,\nMajestic brilliance blazes through the Eight Radiant Ones, brandishing the pennant to array the Great Empyrean.\nTogether with this fragrant and resplendent Infant, the myriad spirits come once to court,\nThe Demon King hastens to receive his duties, vanquishing evil and destroying a thousand demons.\nLifting the Azure Emperor’s Mother, arrayed in seated rows along the Golden Flower’s branches,\nThe seven ancestors receive immortal ranks, forever transcending the Three Paths’ clamor.\n\n**Upper Grade, Seventh Chapter:**\nThe Four Perfected of the Great Ultimate serve the Imperial One,\nThe Mysterious returns to preserve the divine, nurturing life and governing qi.\nThe Primordial Lineage upholds the practice, the Nine Perfected harmonize in union,\nThe Red Child congeals the heavens, the patterned plain flourishes in the net.\nHastening to audit the Three Officials, executing demons and vanquishing evil,\nThe Nine Heavens shake and topple, the Seven Qi surge in harmony.\nEliminating and punishing the womb’s roots, uprooting and treading the Three Paths,\nGenerations receive grace, becoming immortals for all time.\n\n**Middle Grade, Seventh Chapter:**\nThe Imperial One guards the Mysterious Numinous, uprooting the registers from the Three Paths,\nEmptiness and fullness follow fortune’s arising, transforming and uniting in the Mud-Pill Palace.\nThe Three Officials face the Emperor’s summons, hastening to audit the Northern Feng,\nVanquishing and eliminating the demonic filth’s ford, the body ascends the Emperor’s wall.\nGeneration after generation, great fortune arises, flourishing and everlasting without end.\n\nWhenever reciting the *Qu-Su Formula* and the *Jade Radiance’s Inner Perfected Metal Chapter*,\nThe Imperial One must concentrate his gaze, the Director of Destinies guards the Perfected,\nThe Five Spirits wield axes, the Duke’s Son guards the palace gate.\nOne must purify one’s garments, burn incense, and reverently bow to the four directions,\nOnly then may one open the text’s sections.\nWhen the sound is emitted, a thousand demons gather and submit, myriad demons are shattered and crushed,\nMountains and peaks come to court, jade splendor shares in the feast.\nReciting one section, the jade sound resonates like chiming jade,\nFor seven days without negligence, ten thousand directions fulfill their wishes.\n\nThe method for receiving the *Qu-Su Formula*:\nThirty feet of cinnabar brocade, two pairs of golden rings,\nServe as the pledge of the Emperor Lord’s Mysterious Perfected.\nWhen transmitting the text, one must seal the fast for seven days,\nBathe with the five fragrant herbs, avoid contact with others,\nAnd seek descent and response.\nOnly those truly worthy may receive it;\nIf transmitted to the unworthy, recklessly divulging the precious scripture,\nThen the seven generations of ancestors will suffer dark torture in the earth prisons.\nHow could one not be cautious?\n\nThe *Wondrous Perfected Supreme Great Simplicity’s Cinnabar Radiance Dao Essence Scripture* concludes.\n\n[Variant note: The character *qǐng* 請 originally appears as *zhū* 諸.]",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真太上丹景道精经 经名：洞真太上丹景道精经。 撰人不详，约出於南北朝。 据称系谷希子传。 书诵读《曲素诀辞玉景内真金章》之法。 一卷。 底本出处：《正统道藏》正一部。 洞真太上丹景道精经 太谷先生黄童真人谷希子传，余受而遵行，封一宗於岱宗山中，与隐地八术名同事异。 八术八名，藏之玉笈，封以金章，侍以玉童，卫以玉女，各八百人。 玉晨授於九玄，七千年乃传余。 此之丹景，亦有二名，一曰太上丹景道精经，二曰太素三元曲素诀辞玉景内真金章，与忧乐惠辞#1又名同实异。 七千年中乃听三传，百年之内有其人者，亦得三传，给玉童、玉女各二人。 然曲素诀辞内真金章者，乃虚皇帝君之极篇，太素三元君之宝辞也。 烟生结文，玉浪虚无，徊真洞乎曲说，诀素焕乎金房，故能除六天於三变之始，招五神於七徊之中，司一列三则灵仙降寝，转七变五则应召无方，礼二尊於闲馆，震素慧於寒灵。 於是山泽稽精，水源伏灭，千妖同诛，九魔失坠#2，启五百於金章，招酆华於帝位，然后玉华宿寝，五老同谣，神兵束魔，邪烟绝嚣，拔七祖於南宫，受形胎乎晨霄，拜太上於蕊阙，谒太素於西朝，超五品於帝室，穷二仪而不凋。 斯故极真之高章，征魔之所摽也。 依四极明科之制，使五百年中听再传之。 兆常能诵曲素诀辞於寝静之宇者，则五老之宾晨朝，玉华之女夕降，卫文大武，以摄不祥，源泽之神皆来拜己，五岳真灵稽首而前。 若欲有所役召，当行七转五变。 先正心北向，存礼太素三元君於金华之宫，又拜太上玉晨君於七映之房。 此二尊君，玉秀虚朗，金姿映苓，圆光蔚於华寝，晃曜激乎八玄。 存既毕，叩齿十二通，先三读金真之祝毕，乃读上品第四章、次读第二章、次读第六章、次读第三章、次读第五章、次读第七章，上中二品合十四章，都毕。 又临目心存所召，则随心而到。 请#3召五岳神灵，及司命、司录、北帝三官，并使除罪籍，刻生名，伐灭邪魔之烟炁，绝塞试观之根源。 勑语既毕，时发遣之，慎不可久留。 一月之中，得三行此道。 若但欲驱除不祥，伐伏妖魔者，自不可顷斋而行事也。 当先读中品第三章、次读上品第二章、次读中品第七章、次读中品第四章、次读上品第六章、又三读金真咒，此谓五变之道，以招伏魔鬼，但单行之，不复有所存礼也。 若欲回七祖之罪，拔生宫於帝尊者，兆当先存礼如上，从经上品第一以转之三过，辄当一读金真祝，一日之中令得三遍至五百遍，为一品过至五百品过，则七祖胎仙，兆升三天也。 兆诵经之时，慎勿令章辞有误，十误则罚一品矣。 夫欲佪品大过之时，皆当先斋三百日，沐浴五香，使身服洁清，绝交人事，心不营虑，然后乃得存行之耳。 太素三元君曲素诀辞玉景内真金章 上品第一章曰： 北命录臣，四司秉灵，南和九真，化合威明， 并羽太一，玉景扬旌，检录五神，高命北清， 魔灵受事，万司摧声，太阴四混，景升云京。 中品第一章曰： 太上委玉司，九天总神营，混此归会昌，寄炁履昌灵， 招魔束鬼精，司录位帝庭，促来召泉曲，荷戈侍神营。 上品第二章曰： 徘徊三玄，理命四司，太一元禁，握节往来， 九源坠#4灭，束录鬼祇，大帝扶胥，五老同规，",
      "translated_text": "**The Supreme Cavern-Real Scripture of the Cinnabar Radiance and Dao-Essence**\n\n**Scripture Title:** *The Supreme Cavern-Real Scripture of the Cinnabar Radiance and Dao-Essence*. Author unknown, approximately composed during the Northern and Southern Dynasties. Allegedly transmitted by Gu Xizi. The text expounds the method of reciting *The Jade Radiance Inner True Metal Chapters of the Curved Simplicity Verses*. One scroll. Base text from *The Orthodox Daoist Canon*, Zhengyi Section, First Subsection.\n\n---\n\n**The Supreme Cavern-Real Scripture of the Cinnabar Radiance and Dao-Essence**\n\nThe Yellow Lad Perfected of Taigu, Master Gu Xizi, transmitted this. I received and practiced it, sealing one lineage within Mount Daizong, distinct in name yet akin in practice to the Eight Hidden Earth Techniques. The Eight Techniques bear eight names, concealed within a jade tome, sealed with a golden chapter, attended by jade lads and guarded by jade maidens, each numbering eight hundred. The Jade Dawn bestowed this upon the Nine Mysteries, and only after seven thousand years was it passed to me.\n\nThis *Cinnabar Radiance* also bears two names: first, *The Supreme Cavern-Real Scripture of the Cinnabar Radiance and Dao-Essence*; second, *The Jade Radiance Inner True Metal Chapters of the Three Primordials’ Curved Simplicity Verses*. It shares a name yet differs in substance from the *Verses of Sorrow and Joy*. Only after seven thousand years may it be transmitted thrice; if a worthy recipient appears within a hundred years, they too may receive three transmissions, granted two jade lads and two jade maidens.\n\nNow, *The Jade Radiance Inner True Metal Chapters of the Curved Simplicity Verses* is the supreme composition of the August Emperor Lord of the Void and the treasured verses of the Three Primordials Lord of Grand Simplicity. Smoke coalesces into script, jade waves arise from emptiness; the true pervades the arcane discourse, while simplicity shines within the golden chamber. Thus, it can dispel the Six Heavens at the inception of the Three Transformations, summon the Five Spirits amid the Seven Revolutions, govern the One and align the Three so that numinous immortals descend to repose, and revolve the Seven and shift the Five so that responses to summons know no bounds. It venerates the Two Honored Ones in the tranquil hall and stirs luminous wisdom in the frigid numen.\n\nThereupon, mountains and marshes submit their essence, water sources conceal and vanish, a thousand demons are collectively executed, and the Nine Fiends lose their footing. It unlocks the Five Hundred within the golden chapters, summons the Feng and Hua to the imperial throne. Then, the Jade Flower abides in repose, the Five Elders chant in unison, divine soldiers bind demons, and perverse vapors cease their clamor. It delivers the Seven Ancestors from the Southern Palace, receives their embryonic forms in the dawn’s aurora, bows to the Supreme One at the Flowery Gate, and pays homage to the Grand Simplicity in the Western Court. It transcends the Five Ranks within the imperial chamber and exhausts the Two Modes without decay.\n\nThis is the loftiest chapter of the utmost reality, the very standard by which demons are subdued. In accordance with the statutes of the Four Poles’ Luminous Regulations, it may be transmitted twice within five hundred years.\n\nIf a practitioner regularly recites the *Curved Simplicity Verses* in a serene chamber, the Five Elders will attend at dawn, and the maidens of the Jade Flower will descend at dusk. The martial might of the Great Script will ward off inauspiciousness, the spirits of springs and marshes will come to pay homage, and the true numina of the Five Peaks will bow before them.\n\nShould one wish to command or summon, perform the Seven Revolutions and Five Transformations. First, align the heart toward the north, visualize and venerate the Three Primordials Lord of Grand Simplicity within the Golden Flower Palace, and then bow to the Supreme Jade Dawn Lord in the Sevenfold Radiance Chamber. These Two Honored Lords—jade purity gleaming in emptiness, golden countenance radiant with lingzhi—adorn their resplendent chambers with haloed light, their brilliance flashing across the Eight Mysteries.\n\nOnce visualization is complete, strike the teeth twelve times. First, thrice recite the *Incantation of the Golden Perfected*, then recite the Fourth Chapter of the Upper Grade, followed by the Second Chapter, the Sixth Chapter, the Third Chapter, and the Fifth Chapter. The Upper and Middle Grades together comprise fourteen chapters; recite them all in sequence. Then, with eyes closed, visualize the summoned entity, and it shall arrive in accordance with the heart’s intent.\n\nTo summon the numina of the Five Peaks, the Directors of Destiny and Records, and the Three Officials of the Northern Emperor, command them to expunge the ledgers of sin, inscribe names for life, eradicate the vapors of demonic perversity, and sever the roots of trial and tribulation. Once the edict is pronounced, promptly dispatch them; take care not to detain them overlong. This Dao may be practiced thrice within a month.\n\nIf one merely seeks to dispel inauspiciousness and subdue demonic perversity, it may be performed without prior purification. First recite the Third Chapter of the Middle Grade, then the Second Chapter of the Upper Grade, followed by the Seventh Chapter of the Middle Grade, the Fourth Chapter of the Middle Grade, the Sixth Chapter of the Upper Grade, and thrice recite the *Incantation of the Golden Perfected*. This is the Dao of the Five Transformations, for summoning and subduing demonic spirits. It may be performed singly, without additional visualization or veneration.\n\nIf one wishes to absolve the sins of the Seven Ancestors and deliver their embryonic forms to the imperial honored ones, the practitioner must first perform visualization as above, then recite the First Chapter of the Upper Grade thrice in succession, each time followed by a recitation of the *Incantation of the Golden Perfected*. Within a single day, complete three to five hundred recitations, constituting one grade of passage. Upon completing five hundred grades, the Seven Ancestors shall become embryonic immortals, and the practitioner shall ascend the Three Heavens.\n\nWhen reciting the scripture, take care that the verses contain no errors; ten errors incur the penalty of one grade. When attempting to pass the great grades, one must first purify for three hundred days, bathe in the five fragrances, ensure the body is clad in purity, sever all worldly affairs, and free the heart from scheming thoughts. Only then may one proceed with visualization and practice.\n\n---\n\n**The Jade Radiance Inner True Metal Chapters of the Three Primordials’ Curved Simplicity Verses**\n\n**Upper Grade, First Chapter:**\nThe Northern Director records the subjects, the Four Directors wield the numinous,\nThe Southern Harmony unites the Nine Perfected, transforming and merging with majestic clarity.\nTogether with the Feathered Great One, the Jade Radiance raises its banner,\nInspecting and recording the Five Spirits, summoning the lofty mandate of the Northern Clarity.\nDemon spirits receive their tasks, myriad directors suppress their voices,\nThe Four Confluxes of the Great Yin ascend the cloud capital in radiance.\n\n**Middle Grade, First Chapter:**\nThe Supreme One entrusts the Jade Director, the Nine Heavens govern the divine encampments,\nUniting these to return to flourishing harmony, entrusting qi to tread upon numinous prosperity.\nSummoning demons and binding ghostly essences, the Director of Records takes his place in the imperial court,\nHastening to summon the springs’ curves, bearing halberds to attend the divine encampment.\n\n**Upper Grade, Second Chapter:**\nRevolving through the Three Mysteries, governing the mandate of the Four Directors,\nThe Great One’s primordial prohibition, grasping the tally to come and go.\nThe Nine Sources fall and vanish, binding and recording ghosts and deities,\nThe Great Emperor supports the throne, the Five Elders align in accord.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1269,
      "start_sentence": 0,
      "end_sentence": 42,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.16010880470276,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上丹景道精经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "明真纪魂，华元理魄，七慧齐吟，永康常伯， 请治不祥，摄魔护籍，司罪伐妖，六天摧落， 上愿名仙，身升晨宅。 中品第二章曰： 运气入太元，解罪列帝图，玄录刊朱轩，九真秉金符， 出入无定止，解驾皇人家，四明奉神宗，玉旌征万魔， 高兵列帝帅，伐此载酆章。 太素金真消魔内真咒曰： 太元启真，万灵勒罗，农司逃泽，四童明牙， 金仙秉钺，天旅充戈，火爄扬锋，水甲导波， 冲落九天，洗涤玄河，号兽毒蛇，鹰禽击魔， 山精伏灭，七象交和，馘斩千妖，齐戮酆华， 金威震落，六天凋殂，三元告命，万灵是呼， 四明闻召，请录帝图。 上品第三章曰： 大帝上命，玄元四章，天帝秉钺，司命承纲， 元真护籍，七符司皇，神宗辅卫，保命桃康， 群魔受事，应召会方，千妖伏灭，山岳启梁， 握符促到，万邪自伤，九天之命，宾录中王。 中品第三章曰： 四落酆山，促校鬼都，西皇扬轮，南真奉书， 太一同軿，玄幽伯无，三元秉籍，公子定符， 九鬼七广，应召对诛，千精受事，奉我勿休。 上品第四章曰： 理命真君，北摅定慧，养光神庭，丹皇栖憩， 云拘守灵，万魔收厉，司命秉符，公子护籍， 仙王骋驾，神华高幙，五岳奉辕，千妖收落， 鬼灭禁庭，凶伏帝濩。 中品第四章曰： 太无伟神宝，圆明映三清，紫虚方玉鼓，上景固天精， 三官促受事，岳真一来庭，四司明朝禁，千妖假伏形。 上品第五章曰： 上帝凝天，促命四真，灵元列素，神虎卫蕃， 永摄阴府，顿落酆山，妖伏火宫，精灭帝前， 所召促到，无鬼无真，三元告符，箓景皇宾。 中品第五章曰： 玉虚理帝景，玄炁聚泥丸，九真列华房，公宁合玄丹， 太山三官主，从来对帝言，收魔束鬼精，乘景太素端， 七祖拔滞根，兆身升三天。 上品第六章曰： 太无上景，南真受灵，起非握节，玄一扶旌， 明真秉曜，上蹑云庭，九符促召，群妖灭形， 岳鬼伏到，六天摧倾，有凶而诛，有善必营， 帝与太一，记籍书名，我同福根，飞仙上清。 中品第六章曰： 九天有司尊，帝一理灵摽，威明焕八景，扬旌列太霄， 并此芬艳婴，万灵一来朝，魔王促受事，灭邪破千妖， 提携青帝母，列坐金华条，七祖受仙品，永度三涂嚣。 上品第七章曰： 太极四真，奉司帝一，玄归保神，育生理炁， 元宗奉行，九真混会，赤子凝天，文素蔚罗， 急校三官，戮妖灭魔，九天震落，七炁冲和， 除伐胞根，拔履三涂，累叶受恩，世为仙家。 中品第七章曰： 帝一守玄灵，拔籍三涂中，虚盈顺福生，化合泥丸宫， 三官对帝召，急来校北酆，灭除妖秽津，身得升帝墉， 世世大福生，繁华永无穷。 凡诵曲素诀辞玉景内真金章之时，皆帝一凝观，司命卫真，五神仗钺，公子守阙。 当净服烧香，心礼四方，然后乃得开其篇目耳。 发响之时，则千魔聚伏，万妖摧烂，山岳来朝，玉华同宴，诵之一品，玉音琼振，七日勿殆，万向如愿矣。 凡受曲素诀辞之法，丹锦三十尺，金镮两双，以为帝君玄真之信也。 授书之时，封斋七日，灌浴五香，不交人物，求降感应。 必可授者，乃得传之，传非其人，妄泄宝经，则七祖父母受冥拷於地狱，可不慎哉。 洞真太上丹景道精经竟 #1『辞』字原本作『解』。 #2#3『坠』字原本作『队』。",
      "translated_text": "**Illuminating the Perfected and Recording the Hun-Souls,**\nThe Flourishing Prime orders the po-souls,\nSeven Wisdoms chant in unison, ever-preserving eternal peace.\nPetitioning to govern inauspicious omens, seizing demons to guard the registers,\nThe Director of Transgressions punishes malevolence, the Six Heavens are overthrown and cast down.\nMay the upper wish be for ascension as an immortal, the body rising to the morning abode.\n\n**Middle Grade, Second Chapter:**\nCirculating qi into the Great Primordium, absolving transgressions and arraying the Emperor’s charts,\nThe Mysterious Register is inscribed upon the vermilion carriage, the Nine Perfected hold the golden tally.\nEntering and exiting without fixed abode, unyoking the chariot at the august person’s home,\nThe Four Illuminations serve the divine lineage, the jade pennant summons the myriad demons.\nLofty warriors array before the Emperor’s marshals, punishing those who bear the Feng chapter.\n\n**The Great Simplicity Metal Perfected’s Inner Perfected Demon-Quelling Incantation:**\nThe Great Primordium initiates the Perfected, the myriad spirits are bound by the net,\nThe Agricultural Director flees the marsh, the Four Lads sharpen their fangs.\nThe Metal Immortals wield axes, the celestial hosts fill the ranks with halberds,\nFire standards brandish blades, water-armored troops guide the waves.\nRushing to cast down the Nine Heavens, washing and cleansing the Mysterious River,\nHowling beasts and venomous serpents, eagles and birds strike the demons.\nMountain spirits submit and vanish, the Seven Images harmonize in union,\nBeheading a thousand demons, jointly executing the Feng’s flourishing,\nThe golden might shakes and topples, the Six Heavens wither and perish.\nThe Three Primordials proclaim the mandate, the myriad spirits respond in unison,\nThe Four Illuminations hear the summons, petitioning to record the Emperor’s charts.\n\n**Upper Grade, Third Chapter:**\nThe Great Emperor issues the supreme command, the Mysterious Prime’s four chapters,\nThe Heavenly Emperor wields the axe, the Director of Destinies upholds the net.\nThe Primordial Perfected guards the registers, the Seven Talismans govern the August One,\nThe Divine Lineage assists and protects, preserving life and peach-blossom well-being.\nThe host of demons receives its duties, responding to the summons and assembling in the regions,\nA thousand demons submit and vanish, mountains and peaks open their beams.\nGrasping the tally to hasten their arrival, the myriad evils wound themselves,\nThe mandate of the Nine Heavens, recorded as guests within the royal court.\n\n**Middle Grade, Third Chapter:**\nThe Four Falls of Mount Feng, hastening to audit the demon metropolis,\nThe Western August One brandishes the wheel, the Southern Perfected presents the scripture.\nThe Great One shares the same chariot, the Dark and Secluded Earl is nameless,\nThe Three Primordials hold the registers, the Duke’s Son confirms the tally.\nThe Nine Ghosts and Seven Expanses respond to the summons and face execution,\nA thousand spirits receive their duties, serving me without cease.\n\n**Upper Grade, Fourth Chapter:**\nThe Director of Destinies, Perfected Lord of the Northern Expansion, stabilizes wisdom,\nNurturing the light in the divine court, the Cinnabar August One rests in tranquility.\nClouds restrain and guard the numinous, the myriad demons are gathered and quelled,\nThe Director of Destinies holds the tally, the Duke’s Son guards the registers.\nThe Immortal King urges his chariot forward, the divine splendor erects its lofty canopy,\nThe Five Peaks present their axles, a thousand demons are gathered and cast down.\nGhosts vanish in the forbidden court, malevolence submits to the Emperor’s vast net.\n\n**Middle Grade, Fourth Chapter:**\nThe Great Non-Being’s mighty divine treasure, its perfect clarity reflects the Three Clarities,\nThe Purple Void’s square jade drum, the upper radiance firmly secures the celestial essence.\nThe Three Officials hasten to receive their duties, the Peak Perfected arrive once at the court,\nThe Four Directors clearly proclaim the morning prohibitions, a thousand demons feign submission in form.\n\n**Upper Grade, Fifth Chapter:**\nThe Supreme Emperor congeals the heavens, hastening the command to the Four Perfected,\nThe numinous prime arrays the plain, the divine tiger guards the borders.\nForever seizing the nether regions, suddenly casting down Mount Feng,\nDemons submit in the Fire Palace, spirits vanish before the Emperor.\nThose summoned hasten to arrive, no ghosts nor Perfected remain,\nThe Three Primordials proclaim the tally, the Register’s radiance welcomes the August Guest.\n\n**Middle Grade, Fifth Chapter:**\nThe Jade Void governs the Emperor’s radiance, the mysterious qi gathers in the mud-pill,\nThe Nine Perfected array in the Flower Chamber, the Duke pacifies and harmonizes the Mysterious Elixir.\nThe Three Officials of Mount Tai, coming forth to address the Emperor,\nSeizing demons and binding ghostly essences, riding the radiance to the Great Simplicity’s apex.\nThe seven ancestors uproot stagnant roots, the million bodies ascend the Three Heavens.\n\n**Upper Grade, Sixth Chapter:**\nThe Great Non-Being’s upper radiance, the Southern Perfected receives the numinous,\nRising from non-being and grasping the tally, the Mysterious One assists the pennant.\nThe Illuminated Perfected holds the luminaries, ascending to tread upon the cloud court,\nThe Nine Talismans hasten the summons, the host of demons vanishes in form.\nPeak ghosts submit and arrive, the Six Heavens are overthrown and toppled.\nThose who are malevolent are executed, those who are good are surely nurtured.\nThe Emperor and the Great One record and inscribe the names in the registers,\nI share in the root of fortune, flying as an immortal to the Upper Clarity.\n\n**Middle Grade, Sixth Chapter:**\nThe Nine Heavens possess revered directors, the Imperial One governs the numinous insignia,\nMajestic brilliance blazes through the Eight Radiant Ones, brandishing the pennant to array the Great Empyrean.\nTogether with this fragrant and resplendent Infant, the myriad spirits come once to court,\nThe Demon King hastens to receive his duties, vanquishing evil and destroying a thousand demons.\nLifting the Azure Emperor’s Mother, arrayed in seated rows along the Golden Flower’s branches,\nThe seven ancestors receive immortal ranks, forever transcending the Three Paths’ clamor.\n\n**Upper Grade, Seventh Chapter:**\nThe Four Perfected of the Great Ultimate serve the Imperial One,\nThe Mysterious returns to preserve the divine, nurturing life and governing qi.\nThe Primordial Lineage upholds the practice, the Nine Perfected harmonize in union,\nThe Red Child congeals the heavens, the patterned plain flourishes in the net.\nHastening to audit the Three Officials, executing demons and vanquishing evil,\nThe Nine Heavens shake and topple, the Seven Qi surge in harmony.\nEliminating and punishing the womb’s roots, uprooting and treading the Three Paths,\nGenerations receive grace, becoming immortals for all time.\n\n**Middle Grade, Seventh Chapter:**\nThe Imperial One guards the Mysterious Numinous, uprooting the registers from the Three Paths,\nEmptiness and fullness follow fortune’s arising, transforming and uniting in the Mud-Pill Palace.\nThe Three Officials face the Emperor’s summons, hastening to audit the Northern Feng,\nVanquishing and eliminating the demonic filth’s ford, the body ascends the Emperor’s wall.\nGeneration after generation, great fortune arises, flourishing and everlasting without end.\n\nWhenever reciting the *Qu-Su Formula* and the *Jade Radiance’s Inner Perfected Metal Chapter*,\nThe Imperial One must concentrate his gaze, the Director of Destinies guards the Perfected,\nThe Five Spirits wield axes, the Duke’s Son guards the palace gate.\nOne must purify one’s garments, burn incense, and reverently bow to the four directions,\nOnly then may one open the text’s sections.\nWhen the sound is emitted, a thousand demons gather and submit, myriad demons are shattered and crushed,\nMountains and peaks come to court, jade splendor shares in the feast.\nReciting one section, the jade sound resonates like chiming jade,\nFor seven days without negligence, ten thousand directions fulfill their wishes.\n\nThe method for receiving the *Qu-Su Formula*:\nThirty feet of cinnabar brocade, two pairs of golden rings,\nServe as the pledge of the Emperor Lord’s Mysterious Perfected.\nWhen transmitting the text, one must seal the fast for seven days,\nBathe with the five fragrant herbs, avoid contact with others,\nAnd seek descent and response.\nOnly those truly worthy may receive it;\nIf transmitted to the unworthy, recklessly divulging the precious scripture,\nThen the seven generations of ancestors will suffer dark torture in the earth prisons.\nHow could one not be cautious?\n\nThe *Wondrous Perfected Supreme Great Simplicity’s Cinnabar Radiance Dao Essence Scripture* concludes.",
      "overlap_context": "nces, the Director of Records takes his place in the imperial court,\nHastening to summon the springs’ curves, bearing halberds to attend the divine encampment.\n\n**Upper Grade, Second Chapter:**\nRevolving through the Three Mysteries, governing the mandate of the Four Directors,\nThe Great One’s primordial prohibition, grasping the tally to come and go.\nThe Nine Sources fall and vanish, binding and recording ghosts and deities,\nThe Great Emperor supports the throne, the Five Elders align in accord.",
      "start_char": 1269,
      "end_char": 2666,
      "start_sentence": 43,
      "end_sentence": 108,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.35490894317627,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上丹景道精经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "#4『请』字原本作『诸』。",
      "translated_text": "[Variant note: The character *qǐng* 請 originally appears as *zhū* 諸.]",
      "overlap_context": "\nWhen transmitting the text, one must seal the fast for seven days,\nBathe with the five fragrant herbs, avoid contact with others,\nAnd seek descent and response.\nOnly those truly worthy may receive it;\nIf transmitted to the unworthy, recklessly divulging the precious scripture,\nThen the seven generations of ancestors will suffer dark torture in the earth prisons.\nHow could one not be cautious?\n\nThe *Wondrous Perfected Supreme Great Simplicity’s Cinnabar Radiance Dao Essence Scripture* concludes.",
      "start_char": 2667,
      "end_char": 2682,
      "start_sentence": 109,
      "end_sentence": 109,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.1724834442138672,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上丹景道精经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}