{
  "source_id": "洞玄灵宝千真科",
  "source_file": "chunked_daozang\\洞玄灵宝千真科.json",
  "total_chunks": 11,
  "total_original_chars": 11981,
  "total_translated_chars": 69164,
  "total_translation_time": 318.57924723625183,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞玄灵宝千真科.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "*The Dongxuan Lingbao Thousand Perfected Regulations*\n*Sutra Title: Dongxuan Lingbao Thousand Perfected Regulations. One fascicle.*\n*Source of Base Text: Zhengtong Daoist Canon, Orthodox Section, Part One*\n\nAt that time, the Left Immortal Duke of the Great Ultimate ascended Mount Laoshen on the first day of the first month in the third year of the Red Crow reign of Lord Hao. There, he refined his thoughts and meditated upon the Dao.\n\nAt noon that day, thirty-three earthbound immortals and Daoist adepts came to his seat to burn incense. In an instant, celestial bells and music of ten thousand chimes resounded. The Most High Lord of the Dao, accompanied by the host of sagely transcendents, perfected sovereigns, attendants of the Thousand Perfected, jade youths, and immortal maidens, arrived together, traversing the void upon empty space. The place where they dwelled transformed, their thrones and seats adorned with splendor, and the Most High Lord of the Dao took his seat according to rank.\n\nThe Immortal Duke prostrated himself upon the ground and, after a long while, spoke: \"Through kalpas of profound accumulation, I have been fortunate to delight in the Dao and revere the True. I bear the grace of the Compassionate Venerable One, who has descended to this humble abode, where the Thousand Perfected have gathered in assembly. My joy and felicity are beyond words. Yet, abiding in lowly obscurity, I have not yet attained great awakening. I humbly inquire: among the Daoist and lay communities of the world, what are the proper rules and rituals for conduct and retreat? I beseech your guidance.\"\n\nThe Most High replied: \"You possess meritorious virtue, long renowned as the Left Immortal. For a time, you have been entrusted with karmic conditions to be reborn in the lower world, serving as a model for all beings and aiding in the propagation of the Dao.\" Thereupon, he commanded the Thousand Perfected to expound the regulations and precepts.\n\nThe Thousand Perfected assented reverently and received the teaching. The Perfected Guardian of Life then proclaimed the regulations, saying:\n\n**The Regulations state:** To establish and enact laws, one must rely on those capable of practice. Among the assembly, those without adherence to the law—regardless of age—shall not be permitted to dwell together. All who reside together must uniformly uphold the sagely teachings, their actions and stillness conforming to ritual propriety. They must sever all evil and jointly safeguard goodness. Those who incite wickedness shall be dealt with according to separate regulations.\n\n**The Regulations state:** The Dao and its methods are pure and empty, not seeking fame or profit. To dwell in seclusion and tranquility is called the abode of immortals. Yet among my disciples, many hoard wealth, treasures, goods, cattle, horses, servants, and slaves, clinging to them without cease. Such persons sever the roots of the Three Treasures, blind the eyes of sentient beings, and though they may uphold the scriptures and observe the precepts, they collectively extinguish the Dharma.\n\n**The Regulations state:** When eminent and virtuous masters dwell together in one place, there may be cunning disciples who ardently seek refuge. Some remain entangled in worldly attachments, while others are coerced by unjust power. When circumstances permit no other recourse, each case must be tested according to its circumstances. Some may first be tasked with arduous labor; others may be guided with gentle and expansive words. Some may be instructed in solitary sitting and forgetting; others may be expelled and sent far away. Some may be taught the precious scriptures, enjoined to observe purification rites and fasts; others, fearing the master’s august authority, may be comforted by attendants. If, in the end, such disciples persist in evil without any progress toward goodness, to harbor them is to extinguish the Dao and its methods. They must be forever kept at a distance.\n\n**The Regulations state:** If there are disciples who delight in the true Dharma, who deeply comprehend the great meaning of the scriptures, and all wish to hear it, yet their karmic conditions and dull faculties obstruct them, such persons, when their aspiration for goodness arises, should be consoled. They may be shown the Three Precepts and the Five Precepts, and instructed in tranquility and pacification of the mind.\n\nThe great and virtuous Dharma masters serve as models for all beings. If a disciple’s nature is haughty, they must be humbled in mind and demeanor. If their conduct is unyielding, they must be subdued. If they are timid and weak, they must be encouraged to advance with courage and vigor.\n\nHaving become parents to all beings, how could one not be earnest and diligent, ensuring they align with the Dao and its methods, never to regress?\n\n**The Regulations state:** Those who have left the household life and uphold the Three Precepts, Five Precepts, Nine Precepts, Ten Precepts, or even the Three Hundred Great Precepts—within each single precept, twenty-four benevolent spirits offer protection, while heavenly and human beings make offerings, preventing the commission of evil. Those who disbelieve in the precepts and commit evil due to their transgressions will bind themselves to karmic retribution in both the unseen and manifest realms, only to fall into blind paths in future rebirths. Whether one violates or upholds the precepts, the resulting blessings or sins are impartially bestowed, regardless of whether one is a Daoist or a layperson. The principle is unbiased, and the merit is equal.\n\n**The Regulations state:** Those of superior virtue and esteemed standing who preside over the assembly must avoid suspicion even in minor transgressions. If discord arises with the king, his consorts and kin, high ministers and officials, or with laymen, their sons and daughters, lesser Daoists, or attendants—especially those with long-standing grievances—one must not reprimand them openly. If punishment is warranted, summon them to a secluded place and admonish them privately.\n\n**The Regulations state:** If one is incapable of bearing the hatred of the assembly, the matter should be reported to the community for collective discipline.\n\n**The Regulations state:** Those who have left the household life must prioritize simplicity and tranquility. Engaging in unlawful conduct leads inevitably to deviation. Unlawful acts include:\n1. Extensively seeking material gain while boasting of one’s abilities;\n2. Endlessly accumulating wealth, arranging marriages, or practicing divination and physiognomy;\n3. Arrogantly claiming vast knowledge while recklessly interpreting celestial phenomena;\n4. Behaving like attendants by personally engaging in farming and weighing grain;\n5. Disrupting the assembly and associating with evil companions;\n6. While professing to uphold the true Dharma, allying with corrupt laypeople;\n7. Disregarding proper conduct in sitting and rising, thereby disrupting the order of the Dharma;\n8. Acquiring wealth through improper means and sharing beds with laypeople;\n9. Venturing out at night without carrying a torch to illuminate the path;\n10. Gambling at games of chance, engaging in robbery, or indulging in misconduct without self-restraint.\n\nThose who enter the Dao and rely on the community may be admonished. If they fail to reform, they extinguish the Dao and its methods.\n\n**The Regulations state:** A Shangqing Dharma Master should not administer the Great Precepts to others, nor accept disciples, nor serve as a preceptor, nor engage in evaluating community matters, nor travel alone at night, nor associate with those of heterodox views. Their every action must accord with the Dharma.\n\n**The Regulations state:** When lesser Daoists invite esteemed masters, they must refine their appearance, adjust their robes and headwear, walk with measured dignity, and bow three times in reverence. After bowing, they should kneel and declare: *\"I, so-and-so, a humble novice, have not yet mastered the teachings. Having come from afar, I humbly beseech the great virtue to resolve my entanglements. Whatever I hear, I shall not disobey.\"* The master then addresses the assembly: *\"This Daoist has harbored karmic obstructions since youth and cannot resolve them alone. Today, he bows in repentance. From this life until now, for all acts of anger, wrath, robbery, greed, and every unwholesome deed, he now seeks absolution, vowing never to repeat them. He aspires to advance in the true precepts and comprehend their profound meaning.\"* After the declaration, the novice rises and bows three more times before withdrawing.\n\n**The Regulations state:** Those who disrupt the assembly, disregard the true Dharma, become intoxicated and disorderly, or disrespect their superiors and inferiors shall be fined in coin, grain, or other goods. If they initially agree but later refuse to comply, they may be subjected to corporal punishment, have their possessions confiscated for offerings, or be assigned labor such as clearing land, felling trees, or harvesting crops. If the assembly cannot enforce discipline, the matter should be brought before the Daoist community. If even this proves ineffective, they may be handed over to the king for judgment according to secular law.\n\n**The Regulations state:** Those who, in defiance of the true Dharma, wander into other abbeys to cause trouble, recklessly demand wine and meat, arrange marriages for attendants, buy or sell servants and livestock, adopt secular customs, commit crimes and are imprisoned but later pardoned, or secure their release through bribes, or seize stolen goods to profit further—such individuals shall be punished according to the established laws of the precepts.\n\n**The Regulations state:** All who reside in a Daoist sanctuary must partake in communal meals. When a vegetarian feast is held, all—whether Daoist or lay—are to gather together. The sounding of the qing and the ringing of the bell summon the assembly. Those not participating in the feast shall not partake of the food, for the merit of the offering is shared equally by all. To refuse entry to guests is a disgrace to the community. If questioned, one may explain that the food is limited, and guests are not excluded. Since we lack divine powers, how can we provide for all? The reply should be: *\"Hosts and guests must reciprocate. With limited provisions and many guests, let us share equally, reducing our portions to accommodate others. This is a matter of human kindness; it should not be denied.\"*\n\n**The Regulations state:** The Dao and its methods are impartial, making no distinction between the intimate and the distant. Whether noble or base, all dwell together in the assembly, and their protection must be sincere. If personal favoritism dictates who receives aid, the community will fall into chaos. All must exercise caution.\n\n**The Regulations state:** During a vegetarian feast, if laypeople come seeking food, the kitchen supervisor must inquire whether they can observe the fast. If they can, they shall be given food; if not, they must be instructed in the consequences of karma, so they may understand the distinction between sin and merit. This is not out of stinginess but to guide them toward awakening, upholding the Dharma, and embodying the foremost compassion. If no instruction is given, the beings incur sin.\n\n**The Regulations state:** During a vegetarian feast, five procedures must be observed:\n1. First, determine the time by the sun’s shadow;\n2. Then, ring the bell to gather the assembly;\n3. Next, perform ablutions, lay out mats, and arrange seating;\n4. Strike the qing to begin the meal;\n5. Finally, recite the food incantation of the ancestral masters.\n\nFailure to perform these five acts renders the feast impure, and partaking of the food constitutes theft.\n\n**The Regulations state:** For the daily provisions of the assembly, if a prior agreement of three measures is made, it must not be altered. To reduce the amount is theft; to take more is likewise theft.\n\nIf, when serving food, one takes an excessive portion of fruits or vegetables already presented, this constitutes theft. Should greed compel one to take more, the act is likewise theft. When serving food, the senior must gauge the needs of the junior; no excess may be taken. As the *Shengxuan Jing* states: \"Above and below, all must regard one another with care.\"\n\n**The Regulations state:** The demeanor of Daoist assemblies must be solemn and orderly. Clothing should be clean, conduct dignified, and bearing admirable—thus inspiring worldly goodness and earning the praise of the heavens. If one’s appearance and manner are slovenly, displeasing to the assembly, unworthy of public esteem, and bringing disgrace upon the Dao and its teachings, this diminishes the treasure of the Dao and severs the seed of great compassion. Yet if one’s conduct in the assembly’s rites commands reverence, the distant mysteries of the teaching flourish, and the Dharma gate stands apart.\n\n**The Regulations state:** When observing the rites of a vegetarian feast, those of great virtue should sit at the front, instructing the assembly to ensure the feast is conducted with propriety, lest the host feel disdain. Should disputes arise, with no regard for restraint, not only do the Daoist and lay communities discern good from evil, but the sages of the ten directions also witness it in secret. The misfortune of sin is borne by each according to their deeds.\n\n**The Regulations state:** Entering and rising in the assembly follow set rules. When sitting, men should first place the left foot forward, stepping properly near the seat, then the right foot, gently pressing the seat with the hands before settling the body and sitting back. When rising, they should again press the seat gently, move forward to retrieve their shoes, first lowering the left foot, then the right, and stand with composure. Women should lead with the right foot, and their sitting and rising follow the same pattern. When entering the hall, one must first straighten one’s robe and sash outside the door, adjust one’s attire, gather one’s garments, and compose oneself. One should visualize the assembly within as the honored sages of the ten directions, the perfected immortals, the present king, or the prefectural and county magistrates, then proceed with measured steps.\n\n**The Regulations state:** When entering the hall, if there are two doors—east and west—one should enter through the side corresponding to one’s seat. Those seated to the west should enter through the west door; those to the east, through the east door. No crossing over the threshold is permitted.\n\n**The Regulations state:** Daoist robes are the attire of the Middle Kingdom, with wide sleeves and cross-collared skirts, distinct from secular dress. They must not be mixed with those of laypeople. Robes, furs, boots, and utensils should be plain and unadorned, without excessive use of gold, silver, or bronze. For morning devotions, rituals, and paying homage to the sages, one should wear full ceremonial attire according to rank. In the Shangqing tradition, this means purple robes with pendants; in the Lingbao tradition, plain yellow; in the Three Sovereigns and Five Emperors traditions, crimson. When not engaged in rituals, fine silk of indigo or locust-brown may be worn, but never patterned brocade or embroidered silk to dazzle the world. Female officers must not wear gold or jade hairpins or bracelets, nor adorn themselves with flowers or cosmetics—first, because such vanity contradicts the Dao; second, because it fails to cultivate a sincere heart.\n\n**The Regulations state:** Daoist priests and female officers must each maintain purity. Male priests must not keep female attendants, nor female officers male attendants. They should keep their distance, stilling their hearts so that their eyes do not see improper forms nor their ears hear improper sounds. As the *Laozi* states: \"Not seeing what may be desired keeps the heart from confusion.\" If such temptations arise, they must be reported to the assembly. Should one fail to correct such conduct, the law of the king applies.\n\n**The Regulations state:** Private quarters in monasteries are often sites of disorder, primarily due to those in authority failing to exercise restraint, indulging without measure. Or perhaps the leaders do not issue clear instructions, dwelling in sacred spaces while their hearts are tainted by greed, leading the younger generation astray into evil paths. Such wickedness obstructs the source of the great Dao, leaving those of true faith with no refuge.\n\n**The Regulations state:** Entering the sacred precincts together, all should open the path to goodness. Harboring anger or inciting violence violates the great compassion. Raising cattle or horses inevitably leads to whipping; hunting dogs and cats are steeped in the intent to kill. Having entered the pure precepts, all such acts must be renounced.\n\n**The Regulations state:** Though people have ranks, the precepts know no distinction of great or small. Some may outwardly uphold the precepts while their hearts remain detached from the Dharma. They neglect the purity of their dwellings, embellishing halls and temples, gathering wicked factions, and engaging in unlawful acts. Hearing the bell for worship, they laugh; entering the monastery gate, they scorn the virtuous and slander those who practice the Dao. Such failures stem from the leaders themselves—how can they then guide their disciples to uphold the teachings, when the standards of conduct daily deteriorate?\n\n**The Regulations state:** If someone in the assembly behaves improperly, one should discreetly admonish them in private: \"The ranks of the perfected and the steps of immortality are what practitioners tread. The Dao has no form, yet it depends on harmony among people. The disciples of the ten directions assist the Dao and propagate its transformation. Hearing the essential teachings, they aspire to cultivate themselves. How can one allow others to become aware of such faults? Now, though the great virtues among us commit no transgressions, there is this matter that does not accord with the true Dao. I urge you to correct it, as the moon wanes only to wax again, and the orchid withers only to bloom anew. Let us use words to support one another. If the teachings are not heeded, the matter must be brought before the assembly.\"\n\n**The Regulations state:** Disciples under one’s care must be admonished all the more strictly. For grave transgressions, they should be reproached with five points:\n1. \"I now reproach you, and you must leave.\"\n2. \"After leaving, do not enter my quarters again.\"\n3. \"With no one to serve me, I vow never to employ you again.\"\n\n4. \"While I live, do not come to my place.\"\n5. \"I would rather guide beings through the three wretched paths and five destinies than speak with you again.\"\nSuch reproach is severe indeed in its subjugation and restraint. It does not permit extralegal measures—no unlawful beatings with cangues or rods, no hanging by the neck or binding in reverse, no day-and-night abuse or scolding. The statutes contain no such provisions, for they would harm the seed of great compassion.\n\nIf a master orders disciples to sell wine or meat, engage in trade, tend cattle or horses, or commit acts of debauchery, the disciples may say: \"Such deeds are not the conduct of the Heavenly Worthy. I dare not act as your disciple. If you grow angry and reproach me, I must leave.\"\n\n**The Regulations state:** Disciples of evil conduct who show no remorse exhibit ten traits:\n1. They commit evil without shame.\n2. They see goodness yet do not cultivate it.\n3. They grow worse upon hearing admonition.\n4. Their actions lack dignity and propriety.\n5. They are arrogant, overbearing, and devoid of reverence.\n6. Their nature is cruel and fierce.\n7. Their companions lack loyalty and trustworthiness.\n8. They wander and indulge in licentiousness.\n9. They delight in slaughter.\n10. They disrupt hierarchy through drunkenness.\n\nThose who bear these ten traits destroy the Dao and its teachings. If, however, one does not commit evil but endures hardship with diligence—entering chambers at dawn to sweep away filth and dust, paying respects at morning, noon, and dusk, seeking to learn, and obeying commands without complaint—then, like a great vessel gradually filled, they accumulate virtue and attain perfection. Such disciples uphold and propagate the true teachings, and their praises are widely sung.\n\n**The Regulations state:** Those who leave the household life differ from the laity. In establishing abbeys and dwellings, they must not allow laypeople or family members to lodge with them. If mendicants from the ten directions pass through, their virtue and conduct should be assessed and they should be accommodated in three ranks, with proper regard for seniority and precedence.\n\n**The Regulations state:** Each abbey should have a separate courtyard named with care, where the community may gather regularly in the refectory. If mendicants from afar arrive seeking temporary lodging, they must first be asked where they wish to stay. Those from the ten directions should assess their own talents and virtue and request lodging accordingly. If their talents and virtue are lofty, they may be assigned to a separate courtyard. If they possess no exceptional qualities, they may request ordinary lodging. If they deem themselves humble and weak, they may ask for a modest chamber; they should seek with humility and not exceed their station. If a senior offers lodging to a junior, the junior should decline and request a different place. If one’s talents do not match their lodging, they must be demoted or dismissed.\n\n**The Regulations state:** Those who leave the household life don yellow robes and wear blue-green as their insignia. If they can be as pure as frost and unsullied as jade, as smooth as water and as clear as a mirror—lifelong fields of blessing, their conduct without blemish, upholding the true precepts—they may be likened to five things:\n1. Like a noble family suddenly bearing a son blind in both eyes, who after three months regains his sight, bringing joy to the household. The preceptless are like the blind.\n2. Like a mirror being polished, growing ever brighter. Those who uphold the precepts accumulate merit with each thought.\n3. Like an infant slowly growing to adulthood. Those who uphold the precepts rise from lowliness to eminence.\n4. Like a starving man constantly longing for food, certain to die without it. Those who do not receive the precepts remain forever blind on the wheel of rebirth.\n5. Like a ship that can cross the great sea. Those who uphold the precepts will surely traverse the bitter sea of birth and death.\n\n**The Regulations state:** If kings, ministers, benefactors, or artisans can benefit the community, they may be provided with food, firewood, and other necessities upon request, with the assembly’s approval. Likewise, if those with power or bandits could harm the community, they too must be supplied with food. These are not good people, but they could damage the community of the Dao.\n\n**The Regulations state:** Common property must not be borrowed for private use. In cases of illness or urgent need, one may request it from the assembly, but it must later be repaid in full.\n\n**The Regulations state:** Unlawful items must not be offered as alms.\n\nThe Perfected Lord asked: \"What are unlawful items?\"\nThe Realized One replied: \"Cattle, horses, slaves, weapons, and the like—these are all unlawful.\"\n\n**The Regulations state:** In times of famine or chaos, when each seeks abundance and tranquility, those who remain steadfast may be given a portion of the community’s private property.\n\n**The Regulations state:** Ritual objects, icons, and scriptures vary in importance depending on their use.\n\nThe Perfected Lord asked: \"What distinguishes the weight of ritual objects, utensils, scriptures, and icons?\"\nThe Realized One replied: \"Bells, chimes, banners, flowers, censers, cases, canopies, precious banners, and scripture wrappings are ritual objects and thus weighty. Hats, shoes, tablets, coarse robes, skirts, jackets, and undergarments are utensils and thus of lesser weight. The original intent determines weight—if one later treats a weighty item as light, it violates the five punishments. If one initially treats a light item as weighty, it is not an offense.\n\nIcons have three ranks: the Heavenly Worthy is supreme, Realized Ones are intermediate, and immortals or masters of the Mystic Teachings are lowest. The original intent in offering an icon determines its weight; it must not be treated as light, or it incurs the ten evils. If a lesser icon is treated as higher, it is not an offense.\n\nScriptures are likewise ranked: *Shangqing* and *Dadong* are the Great Vehicle; *Dongxuan Lingbao* is the Middle Vehicle; *Dongshen Sanhuang* is the Small Vehicle. If one initially intends to create a Great Vehicle scripture but later produces a Middle or Small Vehicle text, it violates the five punishments. If one initially creates a Small Vehicle text but later produces a Middle or Great Vehicle text, it is not an offense.\n\n**The Regulations state:** Stealing ritual objects or utensils is equivalent to the five heinous crimes.\n\n**The Regulations state:** Using common food or drink for private gifts or personal gain is treated as theft.\n\n**The Regulations state:** Common property belongs to all in the ten directions. It is passed down through generations without interruption. It must not be used arbitrarily at the time, nor may it be privately appropriated or divided for personal gain—all such acts incur the sin of the five heinous crimes.\n\n**The Regulations state:** If one’s mother, aunt, sisters, or other female relatives suffer from illness or urgent distress and require assistance, there is no offense. If the children of others are drowning or trapped in fire, even if impure thoughts arise, one must still do everything possible to save them, without committing any improper contact.\n\n**The Regulations state:** Those who leave the household life dwell alone in seclusion, apart from worldly things, cutting off love and abandoning glory, abiding in tranquil solitude. If they violate this and become disorderly, the world will no longer hold them in reverence.\n\n**The Regulations state:** When traveling on the road and encountering women who make requests, beg for food or drink, or the like, one may only speak from a distance of ten paces or more. If receiving objects or food, place them on the ground or hold them, then depart and allow the woman to take them afterward—never hand them directly. If encountering women on the road, one must yield the path and let them pass.\n\n**The Regulations state:** When lustful thoughts arise, regard them as encountering a ferocious tiger, seeing a venomous snake, facing the king, being a thief caught by the master, sitting in a house as it catches fire, or sailing a boat at sea as it springs a leak. Cultivate these six perceptions, and lust will have no place to arise.\n\n**The Regulations state:** In shared abodes such as temples, halls, gardens, and fields belonging to the Three Treasures, the halls are dedicated to the Heavenly Worthy, while the halls belong to the Daoists. If construction involves distinctions of rank, and there are private chambers, these are built by the Daoists themselves, with size and grade determined by their own status. Upon death, they may dispose of them as they wish during their lifetime. If no instructions are left after death, the disciples or lay novices may manage them. After receiving ordination and being assigned a separate name, they may also dispose of them as they see fit. However, the land belongs to the Three Treasures and may not be altered. If the community has prior agreements, these general rules do not apply.\n\n**The Regulations state:** Those newly entered into the Dao, whose precepts and conduct are not yet complete, rely on villages and hamlets rather than residing in temples. Without venerable masters to revere above or virtuous companions below, they often associate with cunning peers, enticing and accompanying men and women, sharing beds, laughing and jesting, drinking wine and eating meat. When laypeople see this, they instead develop contempt. Such behavior destroys the Dao and the Law, undermines others’ faith and respect, and when discovered by esteemed masters, they are punished according to the regulations. If they cannot be corrected, the king’s law applies.\n\n**The Regulations state:** If those who have left the household life give Three Treasures property to officials or powerful figures to seek personal gain, causing laypeople to develop fearful expectations, even if they are capable of construction, it is better to sit in pure stillness. Those who violate this are judged as having stolen property.\n\n**The Regulations state:** Those who leave the household life do not associate with the secular world, seek fame or profit, or perform conditioned meritorious deeds. They enter stillness and samādhi, subdue external demons—this is called pure precepts, the true mother of the treasure of the Dao.\n\n**The Regulations state:** When those who have left the household life occupy clean halls and empty rooms, excessive attachment leads to ten evil accumulations: first, extensively occupying wilderness and separately maintaining fields and dwellings; second, cultivating gardens and groves for personal land profit; third, storing and accumulating silk, cotton, grain, and cloth; fourth, trading in servants and slaves; fifth, lovingly raising the six livestock; sixth, greedily gathering the eight delicacies; seventh, delighting in play; eighth, adorning curtains with bronze; ninth, wearing strange and extravagant clothing; tenth, diligently hoarding treasures and valuables. None of these ten things may be done. One should deeply reform and daily renew their adherence to the Dao.\n\n**The Regulations state:** If someone comes to beg, whether for the Three Treasures’ sake—such as establishing fasts, transmitting ordinations, lecturing, reciting scriptures, or receiving offerings—whatever is obtained through the Three Treasures must be handled according to the *Mingzhen Regulations*, following the twelve-fold transmission procedures. For other cases, one may freely give alms and bestow charity, but one must not accept impure offerings or make impure donations, as all such acts incur the sin of perverting the law.\n\n**The Regulations state:** If disciples, fearing disorder in cold times or famine, store silk, cotton, silk cloth, and the five grains to prepare for urgent needs and almsgiving, this is not prohibited.\n\n**The Regulations state:** If someone offers weapons, birds, beasts, or unlawful items as alms, none of these should be accepted.\n\n**The Regulations state:** If someone offers servants or slaves for service, none should be accepted. However, if the servants maintain vegetarian precepts, they may be accepted.\n\n**The Regulations state:** If the dwellings of those who have left the household life are adjacent to the homes of lay men and women, each must close their doors at night. Failure to do so violates the precepts.\n\n**The Regulations state:** Those who have left the household life would rather incur the sin of stealing bells or statues than speak of others’ private, shameful matters.\n\n**The Regulations state:** The clothing, shoes, and sandals of those who have left the household life must always be neat. Their movements, sitting, standing, speech, and laughter must be measured. If due to illness, coercion, fright, or being attacked by beasts, they are chased, injured, or their steps and clothing become disordered, there is no offense. Otherwise, it violates the precepts. If done intentionally, it violates the precepts.\n\nThe Perfected Lord was asked: “What is meant by *violating the precepts*? What is meant by *violating the regulations*?”\nThe True Person replied: “When the precepts are not directly violated but one is said to have violated the precepts, it is a flogging offense. When the regulations are not directly violated but one is said to have violated the regulations, it is a caning offense.”\n\n**The Regulations state:** If one finds buried treasure in the wild, return it to the king. If the treasure bears an inscription indicating it belongs to scriptures, images, halls, or meritorious works, the finder should follow the inscription’s instructions to distribute or construct it—no need to report to the king. Failure to do so violates the ten evil precepts. If one finds lost items on the road or in the wild, take the item and post a notice. If the owner is found, return it. If the owner cannot be found, give it to the common property; otherwise, it violates the precepts.\n\n**The Regulations state:** In winter, one may bathe once every ten days. Prepare a private chamber, six feet square, with a water trough, stove, and bamboo pipe to channel hot water into it. Add peach branches, cypress leaves, orchid, and bamboo leaves to the basket for filtering the water.\n\nWhen the kitchen drum sounds, superiors and inferiors shall enter the bath in order of rank. Men and women must not share the same chamber, nor may one bathe with laypeople or use their bathing garments. Failure to observe these rules violates the precepts.\n\n**The Regulations state:** Daoists must not consume alcohol. Some falsely claim cold weather or feign abdominal pain to justify drinking, only to flush with intoxication, disrupt hierarchy, or incite disorder. When attending alms-gatherings, performing rites, traveling on roads, or engaging in public or private affairs, such conduct not only breaches personal decorum but also defiles the Daoist community, extinguishing the Dao and obstructing its propagation. If invited by others, one must prioritize purity and dignity in all public and private conduct. Violations of these principles incur precept-breaking. However, if illness is genuine and known to all, medicinal remedies are permitted without restriction—though the afflicted must remain outside ritual assemblies.\n\nMaster Xian said: \"Within the Daoist tradition, wine is permitted.\" The *Lingbao Sutra* states: *\"Wine is set in the Floating Clouds Abbey, / Highly drunk at the Jade Clarity Terrace.\"* How can this be so starkly contradictory?\n\nThe Perfected One replied: \"What a misguided view! The *Taiqing Sutra* teaches: *Transmute gold and jade into thirty-six waters—gold as water becomes golden nectar, red jade as water becomes crimson nectar, white jade as water becomes jade nectar or jade liquid.* The *Dingzhi Sutra* further states: *The five jade liquids do not intoxicate; constant mindfulness of pure conduct—where is the allowance for such?*\"\n\n**The Regulations state:** When Daoists travel outside and witness fighting, filial impiety, fraternal discord, theft, military violence, or homicide, they must return to the abbey, bathe in fragrant water, and enter quiet meditation to avoid transgression.\n\n**The Regulations state:** When receiving food during a fast, one must use a clean handkerchief to hold it.\n\n**The Regulations state:** After a fast, one must rinse the mouth and clean the teeth with a willow twig.\n\n**The Regulations state:** When selecting alms, follow the established method of the host, dividing the twenty-four *qi* to determine merit or fault.\n\n**The Regulations state:** If a junior disciple encounters a senior master or scriptures and images behind them, they must attend and protect them, never turning their back.\n\n**The Regulations state:** When transmitting scriptures or conferring precepts, female officials may enter Daoist abbeys, and Daoist priests may enter female abbeys—provided they first request a master, establish ranks, and announce the proceedings to the assembly to ensure solemnity and adherence to precepts. No one may attend alone or in pairs, enter the ritual hall unannounced, or disrupt the rites in private chambers. All must depart the same day and not stay overnight; otherwise, they violate the precepts.\n\n**The Regulations state:** Male and female officials shall each have their own dependencies. Male officials depend on male officials, female officials on female officials, with senior masters as their teachers. Every ten days, they shall visit their teacher for instruction. At the appointed time, they must don their ritual robes, compose their minds, and proceed reverently and solemnly to the teacher’s door, facing neither east nor west. Upon arrival, they announce: *\"This disciple pays respects.\"* If the teacher acknowledges them, they adjust their robes and sashes, burn incense in the scripture-recitation chamber, and summon the disciple to enter. Approaching the teacher, the disciple performs three measured bows and inquires: *\"Has the teacher’s health been well of late? Has your virtue remained unimpaired?\"* If the teacher is without affliction, they reply: *\"There has been no neglect of recitations or rites.\"* If illness is present, they respond according to the disciple’s concern. If the disciple has transgressed, the teacher addresses it first: *\"You have committed such-and-such; let my admonishment guide your correction.\"* The disciple bows in gratitude: *\"My lack of self-discipline has troubled you to instruct me.\"* They bow again: *\"From this day forward, I shall not repeat this offense.\"* If the meeting occurs before a fast, a meal is prepared. Afterward, no further arrangements are made, and the disciple takes leave with two bows: *\"May the teacher cherish themselves.\"* The teacher admonishes in return: *\"Wherever you reside, diligently observe fasts and precepts, guard yourself with vigilance, and never succumb to arrogance.\"* The disciple assents and retreats, turning away only after three steps, never entering another chamber. Upon returning to their abbey, they relay the teacher’s instructions to all, senior and junior alike, without concealment. If a female official lacks a senior master or cannot transmit teachings, she may seek instruction from a male official. If a female official of high virtue exists, male officials may also visit her to receive teachings. The etiquette of bowing and rising applies equally to men and women.\n\n**Question:** If Daoist priests or female officials are disrespected or bullied by laypeople without just cause, how should they respond?\n\n**Answer:** If Daoist priests or female officials are unjustly bullied by laypeople, they should inform their parents, siblings, or influential figures in the village to serve as external protectors. If the Daoist or female official has committed an offense, they must report it to the community, who will administer punishment according to the precepts. If the offender refuses correction, they shall be handed over to the king.\n\n**Question:** When the Heavenly Worthy first attained enlightenment, he permitted men to leave the household life. How, then, did women come to enter the Dao?\n\n**Answer:** The Heavenly Worthy, through the pure faith of a devoted couple, achieved fruition in the Dao and became the Primordial Beginning. He then allowed both men and women to leave the household life. His wife, having attained the fruit of realization, was honored as the Lady of Golden Luminance, and women were thus permitted to enter the Dao in succession. After the transmission of scriptures and precepts, senior female officials, upon seeing men enter the Dao and receive the natural teachings of Laozi, must pay reverence and guide them according to the Dharma, for they perpetuate the sacred lineage. If they observe faults, they should offer gentle admonishment, never resorting to scolding or slander. When ordaining young register-holders, one must bow to senior female officials out of respect for the Dharma.\n\n**Question:** How should young boys and girls who uphold the scriptures and precepts be ordained under royal decree? After ordination, should they pay filial respect to their parents?\n\n**Answer:** To perpetuate the sacred lineage and protect the entry of men and women into the Dao, one must select those who are upright, kind, and devout. The master first tests and trains them; if their ten practices are exemplary, they may be permitted to study and cultivate.\n\nUnder royal decree and in accordance with the king’s statutes, once the candidates are deemed fit for ordination, a grand and solemn altar of the Dao shall be prepared in the manner of the *Great Vision*. The altar shall be adorned with orchid and bamboo ornaments, following the *Rite of Illuminating the True and Removing Transgressions*. The male and female ordinands shall be assembled to the south of the altar, standing in two rows according to their respective sides. The supervising officials shall stand in a horizontal line facing south, with a senior *Dadong* master positioned before them. A table and mat shall be set, incense lit, and the master shall intone the hymn of praise:\n\n*\"Great Sage, revered by gods and men,*\n*Honored through the ages past.*\n*Now a treasure rare appears—*\n*Our great king, of boundless grace.*\n*With compassion’s heart he turns,*\n*Guiding all to the true Way.*\n*Entering the true Way thus,*\n*Is by royal favor won.*\n*Forever free from worldly ties,*\n*Ever seeking sacred ground.*\n*Surely shall they gain the Dao’s great blessings,*\n*Together striving toward the formless true.\"*\n\nAfter the hymn, the master shall address the newly ordained, saying: \"From this day forth, you shall pay reverence to the sages and the perfected, forever parting from worldly kin. Each of you shall perform three bows, marking your separation from the secular.\" The first bow shall be to the king and sovereign, whose virtue and grace are boundless; the second to the provincial and county officials, in gratitude for their ordaining grace; the third to one’s living and deceased parents, for granting the chance to leave the household life. After the three bows, the master shall present the robes and headdress to each newly ordained, saying: \"Great indeed is the sagely transformation, infinite in reach. The stars shall be your crown, the sun and moon your garments. Follow heaven’s Way, never straying from the four seasons. Broadly deliver all beings, seeking to transcend the three realms.\"\n\nThe master shall then command the assembly to universally chant *shan* and snap their fingers three times. The senior members shall likewise chant *shan* and snap their fingers three times in unison. Afterward, the ordinands shall don their ritual robes. Once robed, the officials shall proceed with the incense offering as prescribed, circumambulating the altar three times, led by the senior members. Upon concluding the rites, the feast shall be offered. After the feast, each shall express gratitude to their fellow practitioners. Beginning with the eldest and proceeding to the youngest, parents and siblings shall take their seats, and all shall bow to the newly ordained. The parents shall address their sons and daughters as *disciples*, vowing that after the master attains the Dao, they too shall enter the realm of the true and perfected.\n\n**Question:** After leaving the household life, from youth to old age, what are the hierarchical ranks?\n\n**Answer:** Those who leave the household life are divided into five ranks: from ages seven to eleven, they are called *Puche Daoists*; from twelve to fourteen, *Zhuxie Daoists*; from fifteen to nineteen, *Chenshi Daoists*; from twenty to sixty, *Honghu Daoists*; and from seventy to ninety, *Zhuchi Daoists*.\n\n**Question:** What is the essence of the Three Vehicles of the Dao?\n\n**Answer:** First, the *Lesser Vehicle*: those who dwell in secluded mountains and forests, cultivating and cherishing themselves. Second, the *Middle Vehicle*: those whose virtue and grace run deep, enabling them to broadly deliver beings. Third, the *Greater Vehicle*: those who forget merit and renounce self-interest, making vast and solemn vows.\n\n**Statute:** To encourage others—men and women alike—to offer their own children to leave the household life is a merit surpassing even the construction of as many worlds as motes of dust. Even the merit of erecting banners and canopies to adorn the realm of the Three Clarities cannot compare to the merit of encouraging others to leave the household life.\n\n**Statute:** Both Daoists and lay followers who create scriptures and images: when laypeople revere them, using gold, wood, bronze, or pigments to replicate the sacred forms and enshrine them with devotion, this is called *creating images*.\n\n**Statute:** If one who has piously offered fields, dwellings, gardens, or groves finds them seized by others, the original donor shall be informed, allowing them to reclaim and reallocate the property.\n\n**Statute:** Those who leave the household life are distinct from the laity, yet illness and death follow no fixed law. When one falls ill, rites should be observed: incense must be burned and scriptures recited without cease, day and night. At the moment of passing, the *wu-chang* chime is struck to send forth the spirit. The Five Refining Corpse Rites are to be followed, lest the affliction persist. The monastic assembly should frequently visit the sick, inspect the kitchen, and ensure meals are prepared for the ailing. In times of illness, few comprehend the approach of death; when one’s karmic fortune wanes, they may seek to flee east or west. Such actions arise from the absence of prior merit, driven by last-minute fear—merely hastening death. Instead, the chamber should be swept clean and the quarters opened wide. Let those of virtuous understanding come and go, offering teachings on impermanence. If one clings to dwelling, death is certain; when the breath falters, they may be moved to the Hall of Transformation. This hall should be established in the northwest corner of the abbey, a three-bay structure with five beams, its facade facing northwest. Within, a high seat is prepared, upon which a celestial image is crafted—its form seated upon a lotus, human in size, the left hand raised to point toward the Gate of Heaven, flanked by two Perfected Ones. When a sick person’s end nears, they are placed behind the image’s seat. A yellow silk banner, twenty-four feet long, is draped so that its tip rests at the waist of the left Perfected One, while the banner’s head is placed in the dying person’s hand. This guides their mind to focus on the upright thought, aspiring to ascend with the Two Perfected through the Gate of Heaven to the Golden Palace. If they are not yet destined to depart, their merit is dedicated to the field of blessings: men face the left Perfected, women the right. Few who enter this hall leave in peace; at life’s end, all claim no distress, yet this is but attachment to life. The wise, who understand destiny, do not fixate on going or staying.\n\n**Statute:** When traveling abroad, one must seek good companions, observing ten principles: first, choose a trusted friend; second, ensure right view; third, mutual understanding; fourth, shared concern in suffering; fifth, learning from one another’s joys; sixth, maintaining dignified conduct; seventh, disciplined movement; eighth, bowing to all encountered; ninth, reverence with utmost devotion; tenth, proper conduct in advance and retreat. Only then may they journey together.\n\n**Statute:** When Daoist disciples or visiting guests arrive, regardless of status, each must be accommodated. First, provide lodging; next, furnish necessities; third, instruct them to join the assembly for worship; fourth, teach the taboos of the abbey; fifth, advise on where to go and what to avoid.\n\n**Statute:** When lay devotees enter the abbey to lodge, fast, listen to the Dao, attend assemblies, or make offerings, they must maintain purity, free from the taint of garlic, onions, alcohol, or strong odors. Their attire should be neat, their demeanor humble and reverent. Upon entering, they first bow to the Heavenly Worthy, then to the great masters, and finally to the novice Daoists. Once inside, they must uphold reverence. If attending daily fasts or lectures, which occur at the two fixed times, they should bow to the Heavenly Worthy at the altar before taking their seat. Laywomen who come must adhere to the same rules, refraining from laughter, frivolity, or adornment with cosmetics, makeup, or painted brows. They should maintain solemn composure, listen to the wondrous Dao, offer incense, make vows, and together aspire to enlightenment.\n\n**Statute:** When laypeople lodge in the abbey, they may not sleep or sit on the monks’ regular beds but must use a separate guest bed. When resting, they may not remove their clothes or expose their bodies.\n\n**Statute:** No virtue surpasses filial piety. Serving one’s parents, teachers, and masters with warmth and care is the greatest kindness. Encouraging others to do good yields equal merit. If parents are impoverished, elderly, ill, or deceased, lacking clothing, food, medicine, tea, or offerings, one must provide and arrange for them. If parents do not revere the Three Treasures, one should gently persuade them to gain the blessings of the Dao.\n\n**Question:** How should laypeople be instructed when observing fasts?\n**Answer:** For those entering a fast, begin with the six fast days: the 1st, 8th, 15th, 28th, and 29th of the lunar month. If they progress, add the eight fast days: the 1st, 14th, 15th, 23rd, 24th, 28th, and 29th. If they advance further, introduce the ten direct fast days: the 1st, 8th, 14th, 15th, 18th, 23rd, 24th, 28th, 29th, and 30th. For greater commitment, teach the Three Yuan Fasts of the 1st, 7th, and 10th months. For the utmost dedication, instruct the six fast months of the year: the 1st, 3rd, 5th, 7th, 9th, and 11th months. Before fasting, one must first receive the precepts. The precepts arise from the three karmic actions: bodily, verbal, and mental. Bodily transgressions are three: killing, stealing, and sexual misconduct. Verbal transgressions are four: false speech, frivolous talk, divisive words, and harsh language. Mental transgressions are three: greed, anger, and delusion. These ten precepts stem from the roots of the three karmic actions and must be guarded first.\n\n**Question:** What is the proper order for fasting meals?\n**Answer:** For regular fasts, one kitchen supervisor is appointed to inspect the head cook and the vegetables, ensuring the preparation of raw and cooked foods, their color, and flavor are all appropriate. Next, observe the gnomon’s shadow to determine the time; if the sky is overcast, use a water clock to fix the fasting hour. At the appointed time, the bell is rung to summon the meal. Each person brings their eating utensils to the fasting hall and places them according to their seat. After the bell is silenced, the circumambulation and hymns conclude, and all sit in order. Water is served once, then the meal is distributed, beginning with the first portion.\n\nRank and seniority must be observed in order. First, the offering is presented to the former masters, with the kitchen supervisor kneeling to raise the tray before the seat of the former masters. A single strike of the chime bowl at the head of the assembly signals the senior venerable to recite the incantation: \"This fast is established for the true Dao, the seeds of the Dao, the Father of the Dao, the Mother of the Dao, the Perfected, the Divine, the Immortals, the Sages—all gathered to partake of the Dao together, to share in this meal, and to attain boundless longevity.\" When the recitation concludes, the tray is first lowered before the former masters, then before the fasting assembly. The names of the vegetables and foods are announced aloud to the assembly, and each person holds their utensils to receive their portion. If one does not require something, it should not be taken.\n\nThe senior venerable surveys the meal, ensuring it is distributed evenly to all. Once the round is complete, a single strike of the chime bowl signals: \"Please begin eating.\" The assembly sits in orderly silence, without speech or laughter, to partake of the meal. While eating, one must not smack their lips, make slurping sounds, spit, sigh, exhale audibly, clink utensils against bowls, or clatter chopsticks. The senior seat eats slowly, waiting for the distribution of food, which is served three times in order from the highest to the lowest. When the meal is finished, the utensils are collected from the lowest to the highest.\n\nFood is to be received only at the proper time; it may not be demanded out of turn. As the fast nears its end, the leftover rice is gathered and scattered for all beings. Those who are not kitchen supervisors may not enter the kitchen to make demands. If the meal is insufficient for the fast, one must eat outside the hall. Forcing entry into the fasting hall is called \"disrupting the meal.\" Leaving before the assembly has finished eating is called \"disturbing the seat.\"\n\nFor those observing a long-term fast without a former master’s offering, the incantation is recited as follows. After the incantation for the rice of all beings concludes, water is served once more, followed by a final round of rinsing. When all have gathered their utensils, a single strike of the chime bowl is sounded, and it is announced: \"The fasting meal is complete. You may now rest as you wish.\" The senior venerable then carries the utensils out of the hall, returning to their quarters to wash and rinse. The kitchen supervisor inspects the kitchen to ensure no one remains behind.\n\nThose who violate any of the above rules shall each perform twenty prostrations before the assembly as penance.\n\nFor fasts attended by laypeople, the procedures for sitting, rising, and receiving food remain the same. However, all offered fruits must be accepted to prevent laypeople from developing preferences. After the meal, any remaining food or fruit is placed before the assembly. A single strike of the chime bowl signals the announcement: \"The leftovers from the assembly’s fast may be used freely by the host.\" Those who agree remain silent; those who disagree may speak. After three announcements, if the fasting officer has elderly or ailing parents or teachers, they may take the remaining fruit, rising to declare: \"[Name] has elderly or ailing parents or teachers and wishes to take this fruit home as an offering.\" The senior venerable responds: \"You may take it.\" Otherwise, the host may keep the leftovers for their household’s free use.\n\n**Question:** Should leftover food for all beings be set out during the fast?\n**Answer:** When the world of the worthy first emerged, the Primordial Beginning commanded the Perfected of the Dao to descend and teach, tasting the hundred herbs to discover the five grains and sustain human life. All hungry ghosts lack the merit of cultivation. During the fast, each person sets out seven grains of rice, a virtuous offering from the Perfected to all beings. This is also called \"Shennong’s rice\" or \"the rice of all beings.\" A single grain can satiate a being for a thousand days.\n\nThe regulations state: Those who have left the household must conduct themselves in word and deed to avoid reproach or suspicion. Practitioners of the Dharma must not speak of killing with killing intent, nor of lust with lustful intent, nor of theft with thieving intent. Any improper conduct must be concealed.\n\nThe regulations state: As the age of the Sages recedes, beings long for their presence. One may focus the mind to inspire reverence and faith in all beings. Temples, halls, palaces, towers, and pavilions may be constructed and adorned with carvings and paintings. Statues of the Ten Directions’ Celestial Worthies, Perfected Immortals, and Sages—whether of gold, bronze, iron, clay, wood, or painted—may be made according to one’s ability, along with banners, ritual implements, and musical instruments for various offerings. If, over time, these are damaged by insects, rats, bird droppings, filth, or the trampling of oxen and horses, those with reverence and faith may repair them with their own hands or hire artisans to restore and reinstall them. This surpasses the merit of the original creators, for it renews others’ reverence and continues the foundation laid by predecessors.\n\nThe regulations state: Morning and evening prostrations to the Three Treasures should be performed on a prostration board. During circumambulation, one may use a mat laid on the ground. If no mat is available while traveling, one may prostrate directly on the ground. When prostrating on the ground, the fingers may be bent so the backs of the fingers touch the earth, preventing dust from soiling the palms—this is called \"protecting purity.\" Prostrating on high, wide, long, or square beds is improper and deeply disrespectful. Even in the presence of worldly nobility, one must observe proper decorum; how much more so when paying homage to the Perfected and Sages? To address them from a bed incurs a hundred days of karmic retribution in darkness.\n\nThe regulations state: Before the revered images, one stands in the presence of the Perfected and the Sages. Even before worldly officials, one dare not slouch; how much less before the Eight Perfected and Seven Sages? To display arrogance in posture, speak loudly, interrupt others, glare angrily, or recline carelessly incurs karmic retribution and undermines the reverence of laypeople.\n\nThe regulations state: In households observing fasts, a day in advance, a long pole is erected before the gate with ten large banners hanging from it, marking the entrance to signify the renunciation of worldly attachments and the cultivation of seclusion.\n\nThe regulations state: Those who have left the household must always uphold loyalty and integrity, prioritizing correctness in all actions. First, correct oneself; second, correct one’s disciples and followers; third, correct the high and low within the temple; fourth, correct the distant Dharma assembly; fifth, correct the obstinate among laypeople.\n\nTo rectify one’s own conduct as a model for others is to rectify one’s disciples, ensuring they receive instruction with proper decorum; to rectify all within the temple, great and small, so they follow in harmony; to rectify the distant Dharma assembly, that the teachings may be praised afar; and to rectify the obstinate among laypeople, broadening their understanding and kindness. One who can do this is called a Daoist.\n\nIf one’s own conduct is not upright, one becomes an object of aversion. Disciples show no respect, and the master is held in contempt. Within the temple, rules and taboos are disregarded, hierarchy is confused, and trust and righteousness are absent. The distant assembly grows resentful, deceiving and oppressing the ignorant, cultivating a field of transgression. Instead of establishing authority and benevolence, one lures away the disciples, servants, or slaves of others, coveting their possessions or engaging in clandestine dealings, forsaking righteousness and perpetually acting with perversity. Those who exhibit such behavior—escaping duties, harboring malice—are to be guarded against and admonished. Should they refuse correction, the law of the king shall apply.\n\nThe regulations state: If one who has left the household returns to lay life—if they have parents, they may return to their parents’ hall but must reside in a separate bed and not share a bed with laypeople. If their parents are ill, they may assist in their care. If they have no parents, they may enter the guest hall to attend to all, great and small, but must not raise their voice in anger, engage in worldly jest or mockery, or mingle with men and women, staying overnight—all of which violate the precepts.\n\nThe regulations state: To withdraw for a full cycle of twelve years is to withdraw for three hundred days. To reduce by ten years is to reduce by ten days.\n\nThe regulations state: When visiting one’s master or a great virtue, one must bow three times and stand in attendance. When invited to sit, one bows before sitting. If further inquiry is made, one rises to answer, standing upright with feet together and hands clasped.\n\nThe regulations state: In the duties of a disciple performing sweeping, the dustpan must be placed upon the broom. Both are carried under the arm when approaching. There are five rules: first, when sweeping, gather dust with the sleeve and brush it away; second, erase traces so no marks remain, avoiding impurity; third, do not turn one’s back to elders, lest disrespect arise; fourth, the dustpan must face forward when removing waste; fifth, return the broom and dustpan to their proper place. Failure to comply violates the regulations.\n\nThe regulations state: In the duties of a disciple serving their master, when passing or receiving objects—if the master stands, one leans forward to receive; if the master sits, one kneels to receive.\n\nThe regulations state: When entering the room of an honored one, if one knows they are within—whether in the chamber or storeroom—and hears no sound, one should cough to announce their presence. If there is no response, one retreats. If asked, one states their name and seeks permission. If bidden to enter, one enters; if the door is open, one opens it; if closed, one closes it. Upon entering, one gazes directly at the honored one—glancing sideways violates the regulations.\n\nThe regulations state: When a disciple attends their master and a guest arrives, they must first dust and arrange the bed, mat, pillow, and bedding, then sweep the area before and after. Only after informing the master and receiving permission may they invite the guest in.\n\nThe regulations state: When a disciple has something to report, whether to their master, fellow temple residents, or external great virtues, they must adjust their attire and approach the room. If the door is closed, they lightly tap it three times with a bent finger. After a brief pause, if no response is heard, they tap three more times—nine taps in total. If still no response, they retreat.\n\nThe regulations state: When a master or great virtue returns from afar, they should send a messenger ahead to the temple to announce their arrival. Disciples must then adjust their attire and go forth to welcome them, gazing intently to avoid startling or catching them unawares.\n\nThe regulations state: Upon encountering one’s master or an elder acquaintance on the road, one must step aside to the leeward, avoiding crossing their path. One bows deeply, and if spoken to, responds; if not, one retreats.\n\nThe regulations state: When accompanying an honored one in travel, one must carry their staff, shoes, and other belongings. When ascending heights or traversing perilous terrain, one attends closely to their left or right, offering support with both hands—never straying far. The elderly and the young are to be treated differently.\n\nThe regulations state: In the duties of a disciple, when departing, one must inform their master; upon returning, one must offer greetings and inquire after all, high and low, before resuming regular duties.\n\nThe regulations state: When the assembly is in doubt, I do not insist on my own way. When the assembly deliberates, I examine carefully. When the assembly acts independently, I follow their lead. When the assembly travels, I do not defy custom. I remain humble and deferential, honoring my elders.\n\nThe regulations state: The method for a master or great virtue to guide the assembly is to establish dignity with magnanimity, restrain the many with compassion, conduct affairs with reverence and diligence, and perform morning practices with solemn respect. Above, one must be impartial, avoiding partiality; below, one must ensure no resentment arises. Such is the way of the great virtue.\n\nThe regulations state: If one achieves good conduct, one should share it with those below, not claiming it solely for oneself.\n\nThe regulations state: Those who study the Dao do not expose the faults of others, do not boast of their own abilities, do not reject others’ admonitions, and do not harbor resentment.\n\nThe regulations state: During the Daoist rites, after the host has paid homage to the Three Treasures and offered incense into the censer, they kneel with hands clasped before the Dharma master. The Dharma master takes the incense three times and recites the incantation: *\"May the host’s seven generations of ancestors escape the long night, behold the light, have disasters dispelled and blessings descend, and ascend from death to immortality.\"* The rite of offering incense then proceeds.\n\nThe regulations state: At the midday meal, recite the incantation: *\"The Two Mysteries ascend the Dao, the Four Poles are pure and cool. The Supreme One, the Emperor Lord, and the Hundred Spirits of Huangning receive sustenance in the Three Palaces, irrigating the spirit of the spleen. Above, they partake of the Great Harmony, consuming the five flavors. The life of the soul and embryo, the seven fluids flow and settle. The hundred passages are harmonized, the five viscera flourish. The Twin Sovereigns merge with the radiance, soaring to the Upper Clarity.\"*\n\nThe regulations state: When serving a meal during a fast, recite the incantation: *\"Today is an auspicious day, fasting and facing the Supreme. The celestial kitchen serves the midday meal—may the host’s blessings be boundless.\"*\n\nThe regulations state: When offering the first portion to the former masters, recite the incantation: *\"Establishing the fast for the true Dao, for the seed of Dao, the father of Dao, the mother of Dao, the perfected, the divine, the immortals, the sages—or together for the Dao—may we share this meal and attain limitless longevity.\"*\n\nThe regulations state: When offering the meal for all beings, recite the incantation:\n*\"Diligently cultivating the great Daoist dharma,\nWith utmost sincerity, we move the Supreme Darkness.\nThe true descends, demonic illusions scatter,\nAll malevolent spirits vanish without form.\nThe seven ancestors are born in the Southern Palace,\nThe self ascends to the Upper Clarity.\nAs blessings are universally bestowed,\nWe offer this dharma-meal to all beings.\"*\n\nThe regulations state: When consuming congee, recite the incantation:\n*\"Today is pure and serene,\nConsuming the immortal’s provisions.\nBurning incense and partaking of porridge,\nLifespan extends without end.\"*\nIt is also said:\n*\"Qian, Yuan, Heng, Li, Zhen—\nThe body is the great Dharma King.\nCongee enters the belly,\nThe five viscera become cool and clear.\"*\n\nThe mouth-rinsing incantation states:\n*\"The willow twig cleanses the mouth, brightening the eyes,\nMay I obtain a branch to offer to the great Dao.\nThe Dao resides in a single tree, fragrant with many names,\nMay I dedicate body and mind to the Three Treasures.\"*\n\nThe regulations state: Those who leave the household to follow the Dao differ from the secular world. These are our Dharma disciples—we must mutually conceal faults and promote goodness, reciprocating kindness, so that near and far may praise and deeply believe.\n\nIt is said: In the world, good people are few, while the unvirtuous are many. People today nitpick flaws, slandering and envying one another, unaware of their own faults yet eager to condemn others’ wrongs. Even if one performs a single good deed, they vie to slander it, unwilling to reform themselves and embrace goodness. Instead, they seek to corrupt the good to match their own wickedness, thus destroying the Dao and its dharma—all due to such people. The great and virtuous masters have strictly admonished this.\n\nThe regulations state: Stealing objects meant for sacred images is a sin equal to the ten evils. If one steals from another’s household, files a complaint along the way, and then takes the property for oneself, they will be subjected to the Eight Gates’ long trials, trapped for ten thousand kalpas without escape.\n\nThe regulations state: Stealing offerings from the ten directions meant for the assembly, or if one serves as the leader and privately takes them for oneself, they will fall into the Hell of Fire Pits, remaining for ten thousand kalpas before emerging, only to enter Fengdu for sixty years of trials, forever reborn as a hungry ghost.\n\nThe regulations state: Those with malicious speech and crimson tongues, forming gangs of wicked followers, should always be kept at a distance. If circumstances force an encounter, one must align words with the heart. Failure to do so will bring severe calamity.\n\nThe regulations state: For those who follow the Dao, any deficiency in demeanor constitutes a violation of the precepts. This is shown to you—may you understand and heed it carefully.\n\nThe Immortal Duke, having received the regulations, bows and retires.\n\n*The Dongxuan Lingbao Qianzhen Regulations conclude.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞玄灵宝千真科 经名：洞玄灵宝千真科。 一卷。 底本出处：《正统道藏》正一部 洞玄灵宝千真科 尔时，太极左仙公以昊赤乌三年正月一日，登劳盛山，精思念道。 是日中时，有地仙道士三十三人，诣坐烧香。 倏尔之时，乃有天钧仗乐万锺乐作。 太上道君与诸圣，众天真皇人、扶乘千真、仙童玉女，乘空履虚，同时俱至。 变所居处，床座庄严，太上道君依位而坐。 仙公稽首伏地，良久言曰：玄积劫有幸，好道乐真，衔荷慈尊，降此卑室，千真集会，喜庆难言，沈迹下僚，未由大悟，不审人间，居处道俗，轨仪进退之诚，伏希指示。 太上告曰：子有功德，宿着左仙，暂托因缘，寄生下世，为物宗匠，助道弘宣。 乃命千真，为说科戒。 千真唯唯，伏受教言，护命真人乃说科曰。 科曰：施制立法，要假能行。 众中无法者，不问老幼，悉不得共住。 共住之人，必须同遵圣教，动止合仪，恶悉能断，善共保护。 如劝恶者，事在别科。 科曰：道法清虚，不希名利，闲居静室，谓曰仙家。 我弟子中，多畜钱财宝货，牛马奴婢，着不已。 如此之人，断三宝原，夺众生眼，能持经奉戒，俱为灭法。 科曰：大德名人，同住一处，有狡猾弟子，苦欲归依。 或爱情未离，或枉威逼，事不获已，各试机宜。 或先令苦使，或诱弘恬言，或独立坐忘，或摈令远去，或出经宝教授，令斋戒治除，或惧自尊威，而令傍人抚接。 若终恶不改，而无进善之功，畜斯弟子，是灭道法，永须远离。 科曰：若有弟子，爱乐正法，深经大义，咸愿欲闻。 直以机在前缘，众根暗钝，如此之人，善欲暨发，可须安慰，三戒、五戒，示静安心。 大德法师是众生模范，若心性高者，而令低心下意； 若动止强梁，而须摄伏； 若其懦弱，劝进勇猛。",
      "translated_text": "*The Dongxuan Lingbao Thousand Perfected Regulations*\n*Sutra Title: Dongxuan Lingbao Thousand Perfected Regulations. One fascicle.*\n*Source of Base Text: Zhengtong Daoist Canon, Orthodox Section, Part One*\n\nAt that time, the Left Immortal Duke of the Great Ultimate ascended Mount Laoshen on the first day of the first month in the third year of the Red Crow reign of Lord Hao. There, he refined his thoughts and meditated upon the Dao.\n\nAt noon that day, thirty-three earthbound immortals and Daoist adepts came to his seat to burn incense. In an instant, celestial bells and music of ten thousand chimes resounded. The Most High Lord of the Dao, accompanied by the host of sagely transcendents, perfected sovereigns, attendants of the Thousand Perfected, jade youths, and immortal maidens, arrived together, traversing the void upon empty space. The place where they dwelled transformed, their thrones and seats adorned with splendor, and the Most High Lord of the Dao took his seat according to rank.\n\nThe Immortal Duke prostrated himself upon the ground and, after a long while, spoke: \"Through kalpas of profound accumulation, I have been fortunate to delight in the Dao and revere the True. I bear the grace of the Compassionate Venerable One, who has descended to this humble abode, where the Thousand Perfected have gathered in assembly. My joy and felicity are beyond words. Yet, abiding in lowly obscurity, I have not yet attained great awakening. I humbly inquire: among the Daoist and lay communities of the world, what are the proper rules and rituals for conduct and retreat? I beseech your guidance.\"\n\nThe Most High replied: \"You possess meritorious virtue, long renowned as the Left Immortal. For a time, you have been entrusted with karmic conditions to be reborn in the lower world, serving as a model for all beings and aiding in the propagation of the Dao.\" Thereupon, he commanded the Thousand Perfected to expound the regulations and precepts.\n\nThe Thousand Perfected assented reverently and received the teaching. The Perfected Guardian of Life then proclaimed the regulations, saying:\n\n**The Regulations state:** To establish and enact laws, one must rely on those capable of practice. Among the assembly, those without adherence to the law—regardless of age—shall not be permitted to dwell together. All who reside together must uniformly uphold the sagely teachings, their actions and stillness conforming to ritual propriety. They must sever all evil and jointly safeguard goodness. Those who incite wickedness shall be dealt with according to separate regulations.\n\n**The Regulations state:** The Dao and its methods are pure and empty, not seeking fame or profit. To dwell in seclusion and tranquility is called the abode of immortals. Yet among my disciples, many hoard wealth, treasures, goods, cattle, horses, servants, and slaves, clinging to them without cease. Such persons sever the roots of the Three Treasures, blind the eyes of sentient beings, and though they may uphold the scriptures and observe the precepts, they collectively extinguish the Dharma.\n\n**The Regulations state:** When eminent and virtuous masters dwell together in one place, there may be cunning disciples who ardently seek refuge. Some remain entangled in worldly attachments, while others are coerced by unjust power. When circumstances permit no other recourse, each case must be tested according to its circumstances. Some may first be tasked with arduous labor; others may be guided with gentle and expansive words. Some may be instructed in solitary sitting and forgetting; others may be expelled and sent far away. Some may be taught the precious scriptures, enjoined to observe purification rites and fasts; others, fearing the master’s august authority, may be comforted by attendants. If, in the end, such disciples persist in evil without any progress toward goodness, to harbor them is to extinguish the Dao and its methods. They must be forever kept at a distance.\n\n**The Regulations state:** If there are disciples who delight in the true Dharma, who deeply comprehend the great meaning of the scriptures, and all wish to hear it, yet their karmic conditions and dull faculties obstruct them, such persons, when their aspiration for goodness arises, should be consoled. They may be shown the Three Precepts and the Five Precepts, and instructed in tranquility and pacification of the mind.\n\nThe great and virtuous Dharma masters serve as models for all beings. If a disciple’s nature is haughty, they must be humbled in mind and demeanor. If their conduct is unyielding, they must be subdued. If they are timid and weak, they must be encouraged to advance with courage and vigor.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 686,
      "start_sentence": 0,
      "end_sentence": 29,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.45432996749878,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝千真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "既为众生父母，宁不殷懃，必契道法，永无退转。 科曰：出家之人，能持三戒、五戒、九戒、十戒，乃至三百大戒等，一戒之中，各有二十四善神之所拥护，天人供养，不犯众恶。 有不信戒，众恶故犯，罪结冥阳，却受生堕落盲道。 违戒奉戒，得福获罪，不问道俗，至理无偏，其功等尔。 科曰：上德尊人，住持大众，下有小过，须避嫌疑。 若有不和於国王、妃嫔眷属、大臣宰辅，及俗人儿女、小道士、净人，宿新恶嫌之人前，并不得呵责。 若应举罚，先唤来隐处，自以示语。 科曰：不堪为众所恶，乃当白众举罚。 科曰：出家之人，务在简静，非法行事，动则落邪。 非法者：一则广求利养，自托我能； 二则贪积无穷，为人婚姻卜相； 三则强称多解，视天文； 四则行等净人，躬执称稼； 五则冈乱大众，与恶友交游； 六则正法为事，而与凶俗结党； 七则坐起无分，混淆法次； 八财不依正道，与俗同床； 九则暗夜出行，而不炳炬自照； 十则樗栎双陆，劫盗行非，恣意所为，而不自戒。 入道依众，可以矢之，如不自惩，是灭道法。 科曰：上清法师，不应授人大戒，不应受人依止，不得畜弟子，不应为人教授，不预评论众事，不得暗夜自行，不得亲近邪见，当须动止在法。 科曰：诸小道士所请名德，皆须修饰形仪，整顿冠履，安庠雅步，稽首三拜。 拜讫，长跪启白：某甲小兆，未备法教，故以远来，伏愿大德，赐垂解结，我有所闻，必无返逆。 大德为白众：今有某道士，从小来心，有结缘累，不能自解。 今稽首求悔，若从生至今，行嗔，行怒，行劫盗，行贪欲，一切不善之行，於今解释，不敢复犯，进学正戒，通明义理。 说竟，谨依所说，乃起更三拜而退。 科曰：乱众之人，不依正法，饮酒醉乱，轻欺上下者，罚钱及米，或余货财，当时同和，后便违拒，不肯输送，因兹杖罚，或夺财帛，以用供养，或苦役治地，斩伐草木，锄禾收刈。 如一众不能治罚，捻集道众。 又不能治，可送与国王，以依俗律。 科曰：若有不依正法，游入他观，妄有轻欺，科索酒肉； 或媒嫁净人，卖买奴婢，及余畜产； 或造顺俗之制，犯罪囚禁，遭赦得免； 或自货财，方便得脱； 或夺贼物，因利求利。 律有正科，依法与罪。 科曰：住立道场，皆须众食，登斋应供，十方共同。 击磬鸣钟，名集法众，非是斋人，不预斯食，同建福善，道俗无违。 恨客闭门，众所同丑，或有问者，食则有限，客乃无违，既不神通，何能供给。 答曰：主客之人，递互为作，本供既少，客数又多，听可均分，减口让哺。 此是人情，勿宜杜绝。 科曰：道法平等，不简亲疏，亦贵贱同处一众，护惜无伪。 若人人作情，来求辄与，此不存众，众即破攘也。 各宜慎之。 科曰：若是斋时，俗人来乞食者，监厨之人，即须借问，能斋以否。 若能斋，与食，若不能斋，深示因果，使知罪福。 非为吝惜，欲令返悟，谨守道法，是为第一慈悲。 若不示语，众生得罪。 科曰：若斋食时，有五事：一先当取晷影，二则鸣钟集众，三则行水洗净、铺巾列席，四则打磬就食，五则说先师食咒。 若不为此五事，非入净斋，名为盗食。 科曰：诸大众人，每用常料，若先约三，不可加减，减为犯盗，多取亦然。",
      "translated_text": "Having become parents to all beings, how could one not be earnest and diligent, ensuring they align with the Dao and its methods, never to regress?\n\n**The Regulations state:** Those who have left the household life and uphold the Three Precepts, Five Precepts, Nine Precepts, Ten Precepts, or even the Three Hundred Great Precepts—within each single precept, twenty-four benevolent spirits offer protection, while heavenly and human beings make offerings, preventing the commission of evil. Those who disbelieve in the precepts and commit evil due to their transgressions will bind themselves to karmic retribution in both the unseen and manifest realms, only to fall into blind paths in future rebirths. Whether one violates or upholds the precepts, the resulting blessings or sins are impartially bestowed, regardless of whether one is a Daoist or a layperson. The principle is unbiased, and the merit is equal.\n\n**The Regulations state:** Those of superior virtue and esteemed standing who preside over the assembly must avoid suspicion even in minor transgressions. If discord arises with the king, his consorts and kin, high ministers and officials, or with laymen, their sons and daughters, lesser Daoists, or attendants—especially those with long-standing grievances—one must not reprimand them openly. If punishment is warranted, summon them to a secluded place and admonish them privately.\n\n**The Regulations state:** If one is incapable of bearing the hatred of the assembly, the matter should be reported to the community for collective discipline.\n\n**The Regulations state:** Those who have left the household life must prioritize simplicity and tranquility. Engaging in unlawful conduct leads inevitably to deviation. Unlawful acts include:\n1. Extensively seeking material gain while boasting of one’s abilities;\n2. Endlessly accumulating wealth, arranging marriages, or practicing divination and physiognomy;\n3. Arrogantly claiming vast knowledge while recklessly interpreting celestial phenomena;\n4. Behaving like attendants by personally engaging in farming and weighing grain;\n5. Disrupting the assembly and associating with evil companions;\n6. While professing to uphold the true Dharma, allying with corrupt laypeople;\n7. Disregarding proper conduct in sitting and rising, thereby disrupting the order of the Dharma;\n8. Acquiring wealth through improper means and sharing beds with laypeople;\n9. Venturing out at night without carrying a torch to illuminate the path;\n10. Gambling at games of chance, engaging in robbery, or indulging in misconduct without self-restraint.\n\nThose who enter the Dao and rely on the community may be admonished. If they fail to reform, they extinguish the Dao and its methods.\n\n**The Regulations state:** A Shangqing Dharma Master should not administer the Great Precepts to others, nor accept disciples, nor serve as a preceptor, nor engage in evaluating community matters, nor travel alone at night, nor associate with those of heterodox views. Their every action must accord with the Dharma.\n\n**The Regulations state:** When lesser Daoists invite esteemed masters, they must refine their appearance, adjust their robes and headwear, walk with measured dignity, and bow three times in reverence. After bowing, they should kneel and declare: *\"I, so-and-so, a humble novice, have not yet mastered the teachings. Having come from afar, I humbly beseech the great virtue to resolve my entanglements. Whatever I hear, I shall not disobey.\"* The master then addresses the assembly: *\"This Daoist has harbored karmic obstructions since youth and cannot resolve them alone. Today, he bows in repentance. From this life until now, for all acts of anger, wrath, robbery, greed, and every unwholesome deed, he now seeks absolution, vowing never to repeat them. He aspires to advance in the true precepts and comprehend their profound meaning.\"* After the declaration, the novice rises and bows three more times before withdrawing.\n\n**The Regulations state:** Those who disrupt the assembly, disregard the true Dharma, become intoxicated and disorderly, or disrespect their superiors and inferiors shall be fined in coin, grain, or other goods. If they initially agree but later refuse to comply, they may be subjected to corporal punishment, have their possessions confiscated for offerings, or be assigned labor such as clearing land, felling trees, or harvesting crops. If the assembly cannot enforce discipline, the matter should be brought before the Daoist community. If even this proves ineffective, they may be handed over to the king for judgment according to secular law.\n\n**The Regulations state:** Those who, in defiance of the true Dharma, wander into other abbeys to cause trouble, recklessly demand wine and meat, arrange marriages for attendants, buy or sell servants and livestock, adopt secular customs, commit crimes and are imprisoned but later pardoned, or secure their release through bribes, or seize stolen goods to profit further—such individuals shall be punished according to the established laws of the precepts.\n\n**The Regulations state:** All who reside in a Daoist sanctuary must partake in communal meals. When a vegetarian feast is held, all—whether Daoist or lay—are to gather together. The sounding of the qing and the ringing of the bell summon the assembly. Those not participating in the feast shall not partake of the food, for the merit of the offering is shared equally by all. To refuse entry to guests is a disgrace to the community. If questioned, one may explain that the food is limited, and guests are not excluded. Since we lack divine powers, how can we provide for all? The reply should be: *\"Hosts and guests must reciprocate. With limited provisions and many guests, let us share equally, reducing our portions to accommodate others. This is a matter of human kindness; it should not be denied.\"*\n\n**The Regulations state:** The Dao and its methods are impartial, making no distinction between the intimate and the distant. Whether noble or base, all dwell together in the assembly, and their protection must be sincere. If personal favoritism dictates who receives aid, the community will fall into chaos. All must exercise caution.\n\n**The Regulations state:** During a vegetarian feast, if laypeople come seeking food, the kitchen supervisor must inquire whether they can observe the fast. If they can, they shall be given food; if not, they must be instructed in the consequences of karma, so they may understand the distinction between sin and merit. This is not out of stinginess but to guide them toward awakening, upholding the Dharma, and embodying the foremost compassion. If no instruction is given, the beings incur sin.\n\n**The Regulations state:** During a vegetarian feast, five procedures must be observed:\n1. First, determine the time by the sun’s shadow;\n2. Then, ring the bell to gather the assembly;\n3. Next, perform ablutions, lay out mats, and arrange seating;\n4. Strike the qing to begin the meal;\n5. Finally, recite the food incantation of the ancestral masters.\n\nFailure to perform these five acts renders the feast impure, and partaking of the food constitutes theft.\n\n**The Regulations state:** For the daily provisions of the assembly, if a prior agreement of three measures is made, it must not be altered. To reduce the amount is theft; to take more is likewise theft.",
      "overlap_context": "bstruct them, such persons, when their aspiration for goodness arises, should be consoled. They may be shown the Three Precepts and the Five Precepts, and instructed in tranquility and pacification of the mind.\n\nThe great and virtuous Dharma masters serve as models for all beings. If a disciple’s nature is haughty, they must be humbled in mind and demeanor. If their conduct is unyielding, they must be subdued. If they are timid and weak, they must be encouraged to advance with courage and vigor.",
      "start_char": 686,
      "end_char": 1941,
      "start_sentence": 30,
      "end_sentence": 79,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.70415806770325,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝千真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "若行食时，果菜已上，并不可长取。 若意贪长取，此即犯盗。 若行食时，上座须量下座须用多少，不可过取。 《升玄经》云：上下共相顾望也。 科曰：道众威仪，事在严整。 衣服清洁，轨行可观，则生世善心，诸天称叹。 若形仪疏慢，不喜众心，不堪众论，毁辱道法，即是道宝有亏，断大慈种。 若为众仪轨，人所钦慕，远玄教益隆，法门有异。 科曰：若就斋戒仪轨，大德之人应当前坐，约语徒众，必使斋整，勿使主人有所嫌鄙。 或各争异论，无有畏忌，非唯道俗肾善恶恶，亦乃十方大圣冥鉴。 为罪招殃，各因己受。 科曰：入众坐起，皆有法则。 若坐时，男先上左脚，正履近床，次上右脚，徐手拓床，平身向后安坐。 若下床时，亦徐手拓床，近前取履，先下左脚，次下右脚，安徐而起。 女前右脚，坐起咸然。 若入堂时，先於门外，端衣笏，正褐帔，束身敛版，存想堂中法众如十方天尊、如得道众圣、如见在国王、如州县府主等，方始安庠进步。 科曰：若入堂时，有门两头东西门，各随左右入。 若门西坐者，从门西入； 若东坐者，可门东入。 不得於门上交过。 科曰：道服，中华之衣，横裙大袖，与俗有别。 不得与白衣参杂。 袍裘皮靴，角柄食器，皆须添素而已，不繁金银铜器。 朝修行事，礼谒众圣，皆盛仪服，随法位次。 若上清，衣紫带佩； 灵宝通黄，三五衣绛，非事时，细绢为衣，荆槐色而已，不得纹绫罗锦，炫惑时俗。 女官不得金玉钗钏，花妆粉饰。 一则入道通恶，二则非为正心。 科曰：道士女官，各须净行。 道士不得畜女童子，女官不得畜男童子，各便远离，栖肃其心，目不见形，听不闻声。 老子经云：不见可欲，使心不乱。 若有此色，即须白众，告举不肯制止，国王有法。 科曰：大观私房，皆多混乱，特由尊者，不能谨慎，纵恣无方。 或是纲维不出教令，身居宝地，心秽悭贪，导引后生，同开恶趣，凶恶长养，塞大道源，使正信者凭心何所。 科曰：共入宝方，同开善趣，怀嗔动煞，咸乖大慈。 养牛畜马，不免鞭挞，猎狗放猫，专怀杀意。 今入净戒，此等并合戒之。 科曰：人有尊卑，戒无大小，或身虽奉戒，意无在法，不修净舍，讵饰殿堂，招引凶党，动为非法，闻鸣钟礼拜，大笑入观门，见尊德行道，外生诽谤。 特由纲维自尔，何能戮力徒众，递互作法，风教日乖。 科曰：若众中有一人不善，可隐处示语云：真品仙阶，行人所践，道无形像，要籍人和，十方法徒，助道扬化，闻有法要，学拟成身。 岂得过令他知觉。 今大德诸行无犯，唯有其事，不依正道，请即改之，犹如月亏，更满兰歇，更熏幸相，用言共匡，法教不悛，即举白大众。 科曰：所养子弟，弥加呵责，有大罪过，引五事责之：一我今呵责汝，汝须出去； 二则出离之后，莫入我房； 三从使无人，誓不用汝；",
      "translated_text": "If, when serving food, one takes an excessive portion of fruits or vegetables already presented, this constitutes theft. Should greed compel one to take more, the act is likewise theft. When serving food, the senior must gauge the needs of the junior; no excess may be taken. As the *Shengxuan Jing* states: \"Above and below, all must regard one another with care.\"\n\n**The Regulations state:** The demeanor of Daoist assemblies must be solemn and orderly. Clothing should be clean, conduct dignified, and bearing admirable—thus inspiring worldly goodness and earning the praise of the heavens. If one’s appearance and manner are slovenly, displeasing to the assembly, unworthy of public esteem, and bringing disgrace upon the Dao and its teachings, this diminishes the treasure of the Dao and severs the seed of great compassion. Yet if one’s conduct in the assembly’s rites commands reverence, the distant mysteries of the teaching flourish, and the Dharma gate stands apart.\n\n**The Regulations state:** When observing the rites of a vegetarian feast, those of great virtue should sit at the front, instructing the assembly to ensure the feast is conducted with propriety, lest the host feel disdain. Should disputes arise, with no regard for restraint, not only do the Daoist and lay communities discern good from evil, but the sages of the ten directions also witness it in secret. The misfortune of sin is borne by each according to their deeds.\n\n**The Regulations state:** Entering and rising in the assembly follow set rules. When sitting, men should first place the left foot forward, stepping properly near the seat, then the right foot, gently pressing the seat with the hands before settling the body and sitting back. When rising, they should again press the seat gently, move forward to retrieve their shoes, first lowering the left foot, then the right, and stand with composure. Women should lead with the right foot, and their sitting and rising follow the same pattern. When entering the hall, one must first straighten one’s robe and sash outside the door, adjust one’s attire, gather one’s garments, and compose oneself. One should visualize the assembly within as the honored sages of the ten directions, the perfected immortals, the present king, or the prefectural and county magistrates, then proceed with measured steps.\n\n**The Regulations state:** When entering the hall, if there are two doors—east and west—one should enter through the side corresponding to one’s seat. Those seated to the west should enter through the west door; those to the east, through the east door. No crossing over the threshold is permitted.\n\n**The Regulations state:** Daoist robes are the attire of the Middle Kingdom, with wide sleeves and cross-collared skirts, distinct from secular dress. They must not be mixed with those of laypeople. Robes, furs, boots, and utensils should be plain and unadorned, without excessive use of gold, silver, or bronze. For morning devotions, rituals, and paying homage to the sages, one should wear full ceremonial attire according to rank. In the Shangqing tradition, this means purple robes with pendants; in the Lingbao tradition, plain yellow; in the Three Sovereigns and Five Emperors traditions, crimson. When not engaged in rituals, fine silk of indigo or locust-brown may be worn, but never patterned brocade or embroidered silk to dazzle the world. Female officers must not wear gold or jade hairpins or bracelets, nor adorn themselves with flowers or cosmetics—first, because such vanity contradicts the Dao; second, because it fails to cultivate a sincere heart.\n\n**The Regulations state:** Daoist priests and female officers must each maintain purity. Male priests must not keep female attendants, nor female officers male attendants. They should keep their distance, stilling their hearts so that their eyes do not see improper forms nor their ears hear improper sounds. As the *Laozi* states: \"Not seeing what may be desired keeps the heart from confusion.\" If such temptations arise, they must be reported to the assembly. Should one fail to correct such conduct, the law of the king applies.\n\n**The Regulations state:** Private quarters in monasteries are often sites of disorder, primarily due to those in authority failing to exercise restraint, indulging without measure. Or perhaps the leaders do not issue clear instructions, dwelling in sacred spaces while their hearts are tainted by greed, leading the younger generation astray into evil paths. Such wickedness obstructs the source of the great Dao, leaving those of true faith with no refuge.\n\n**The Regulations state:** Entering the sacred precincts together, all should open the path to goodness. Harboring anger or inciting violence violates the great compassion. Raising cattle or horses inevitably leads to whipping; hunting dogs and cats are steeped in the intent to kill. Having entered the pure precepts, all such acts must be renounced.\n\n**The Regulations state:** Though people have ranks, the precepts know no distinction of great or small. Some may outwardly uphold the precepts while their hearts remain detached from the Dharma. They neglect the purity of their dwellings, embellishing halls and temples, gathering wicked factions, and engaging in unlawful acts. Hearing the bell for worship, they laugh; entering the monastery gate, they scorn the virtuous and slander those who practice the Dao. Such failures stem from the leaders themselves—how can they then guide their disciples to uphold the teachings, when the standards of conduct daily deteriorate?\n\n**The Regulations state:** If someone in the assembly behaves improperly, one should discreetly admonish them in private: \"The ranks of the perfected and the steps of immortality are what practitioners tread. The Dao has no form, yet it depends on harmony among people. The disciples of the ten directions assist the Dao and propagate its transformation. Hearing the essential teachings, they aspire to cultivate themselves. How can one allow others to become aware of such faults? Now, though the great virtues among us commit no transgressions, there is this matter that does not accord with the true Dao. I urge you to correct it, as the moon wanes only to wax again, and the orchid withers only to bloom anew. Let us use words to support one another. If the teachings are not heeded, the matter must be brought before the assembly.\"\n\n**The Regulations state:** Disciples under one’s care must be admonished all the more strictly. For grave transgressions, they should be reproached with five points:\n1. \"I now reproach you, and you must leave.\"\n2. \"After leaving, do not enter my quarters again.\"\n3. \"With no one to serve me, I vow never to employ you again.\"",
      "overlap_context": " gather the assembly;\n3. Next, perform ablutions, lay out mats, and arrange seating;\n4. Strike the qing to begin the meal;\n5. Finally, recite the food incantation of the ancestral masters.\n\nFailure to perform these five acts renders the feast impure, and partaking of the food constitutes theft.\n\n**The Regulations state:** For the daily provisions of the assembly, if a prior agreement of three measures is made, it must not be altered. To reduce the amount is theft; to take more is likewise theft.",
      "start_char": 1941,
      "end_char": 3038,
      "start_sentence": 80,
      "end_sentence": 124,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.21506714820862,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝千真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "四我之生前，莫至我所； 五则宁引化三涂五道，终不与汝共语。 此之呵责，折伏为之甚矣。 不用分外，非法拷打枷棒，悬首反缚，昼夜打骂。 律无此条，伤大慈种。 若师主使令弟子酤酒买肉，坐行贩卖，牧牛养马，并为邪淫，驱使弟子，弟子可言曰：以此所作，非天尊之行，某不敢为师弟子，若有嗔责，可须舍去。 科曰：恶行弟子，教不知悔，其行有十：一则为恶不耻，二则见善不修，三则闻谏弥甚，四则动非威仪，五则强梁我慢而无恭肃，六则夷情狠戾，七则友非忠信，八则游习奸淫，九则好乐屠戮，十则醉乱尊卑。 有此十种行人，是破道法。 若不为恶，能伏勤苦，清旦入房，除秽清尘，朝中日暮，三时问讯，求有所习，随用□使，不辞劳苦，渐盈大器，积德成真。 有此弟子，绍隆正法，广以赞叹。 科曰：出家之人，与俗既别，置观立舍，并不得与俗人、及家口寄住。 若是十方法众，行往经过，看前人德行高低，作三品安置，尊卑居止，要合行所。 科曰：每观舍，应须精思别院置名，得平常集众，同在斋堂。 若是远方行人，来暂居止，即须先问，欲何处居止。 其十方来人，自量才德， 请就居止。 若才德高远，精思别院。 若无奇行，请平常居止。 若自量卑弱，请乞下房小室，听可以谦请，不可过分。 若是上人让请下人，可须辞谢改处。 若才非所处，即须黜退。 科曰：出家之人，既能披黄戴青为相。 若能渊澄霜洁，玉润水清，世世福田，行无点污，守持正戒，有五种譬喻：一者如富贵之家，忽生一子而无两目，经涉三月，两目忽明，众家欢喜。 无戒之人，犹如无目。 二者喻如磨镜，渐渐增明。 有戒之人，念念功积。 三者喻如婴儿，细细长大，能持戒者，以下之高。 四者喻如饥人，终念得食，不得食故，必死无疑。 不受戒人，长轮盲道。 五者喻如航，能度大海。 能持戒者，必度生死苦海。 科曰：若国王、大臣，施主、工匠，能有益众者，可供给饮食，薪火有求索，白众给之。 科曰：若威势及恶贼，能损害众者，亦须供给饮食。 此是不善人，能损坏法众故也。 科曰：常住财物，不得贷借，充私房中用。 其有病患，切急白众求请，后一陪填还。 科曰：非法之抓，不得布施。 仙公曰：何为非法之物？ 真人曰：牛马奴婢、军械器杖等物，并是也。 科曰：时在饥荒，又遭离乱，各欲随丰逐静。 能有守固者，众可分私财物，以与守固之人。 科曰：法物、造像、造经，有所施用，轻重各别。 仙公曰：何为法物、什物、经像等之轻重？ 真人曰：钟磬幡花、炉合帐盖、宝幢经缊之属，此是法物则重，冠履机笏、褐被裙襦衫褶等为什物则轻。 本心为重－后作轻，犯五刑律。 本作轻今作重，不犯。 像有三等，天尊为上，真人为中，众仙、玄中法师等为下。 本心舍施，造像为重，不得入轻，入轻犯十恶。 若以卑入尊，不犯。 经亦然，上清为大洞，是大乘； 洞玄灵宝是中乘； 洞神三皇为小乘。 本心造大乘，后为中、下，犯五刑律。 本心造小，今造中、大，不犯。 科曰：盗法物、什物，罪同五逆。 科曰：将常住食饮，以私饷及归私者，准盗论。 科曰：常住之物，十方共同，递互相付，百代常行。 不可当时任意取用，不得共制私自用意，分以归私，并犯五逆罪。",
      "translated_text": "4. \"While I live, do not come to my place.\"\n5. \"I would rather guide beings through the three wretched paths and five destinies than speak with you again.\"\nSuch reproach is severe indeed in its subjugation and restraint. It does not permit extralegal measures—no unlawful beatings with cangues or rods, no hanging by the neck or binding in reverse, no day-and-night abuse or scolding. The statutes contain no such provisions, for they would harm the seed of great compassion.\n\nIf a master orders disciples to sell wine or meat, engage in trade, tend cattle or horses, or commit acts of debauchery, the disciples may say: \"Such deeds are not the conduct of the Heavenly Worthy. I dare not act as your disciple. If you grow angry and reproach me, I must leave.\"\n\n**The Regulations state:** Disciples of evil conduct who show no remorse exhibit ten traits:\n1. They commit evil without shame.\n2. They see goodness yet do not cultivate it.\n3. They grow worse upon hearing admonition.\n4. Their actions lack dignity and propriety.\n5. They are arrogant, overbearing, and devoid of reverence.\n6. Their nature is cruel and fierce.\n7. Their companions lack loyalty and trustworthiness.\n8. They wander and indulge in licentiousness.\n9. They delight in slaughter.\n10. They disrupt hierarchy through drunkenness.\n\nThose who bear these ten traits destroy the Dao and its teachings. If, however, one does not commit evil but endures hardship with diligence—entering chambers at dawn to sweep away filth and dust, paying respects at morning, noon, and dusk, seeking to learn, and obeying commands without complaint—then, like a great vessel gradually filled, they accumulate virtue and attain perfection. Such disciples uphold and propagate the true teachings, and their praises are widely sung.\n\n**The Regulations state:** Those who leave the household life differ from the laity. In establishing abbeys and dwellings, they must not allow laypeople or family members to lodge with them. If mendicants from the ten directions pass through, their virtue and conduct should be assessed and they should be accommodated in three ranks, with proper regard for seniority and precedence.\n\n**The Regulations state:** Each abbey should have a separate courtyard named with care, where the community may gather regularly in the refectory. If mendicants from afar arrive seeking temporary lodging, they must first be asked where they wish to stay. Those from the ten directions should assess their own talents and virtue and request lodging accordingly. If their talents and virtue are lofty, they may be assigned to a separate courtyard. If they possess no exceptional qualities, they may request ordinary lodging. If they deem themselves humble and weak, they may ask for a modest chamber; they should seek with humility and not exceed their station. If a senior offers lodging to a junior, the junior should decline and request a different place. If one’s talents do not match their lodging, they must be demoted or dismissed.\n\n**The Regulations state:** Those who leave the household life don yellow robes and wear blue-green as their insignia. If they can be as pure as frost and unsullied as jade, as smooth as water and as clear as a mirror—lifelong fields of blessing, their conduct without blemish, upholding the true precepts—they may be likened to five things:\n1. Like a noble family suddenly bearing a son blind in both eyes, who after three months regains his sight, bringing joy to the household. The preceptless are like the blind.\n2. Like a mirror being polished, growing ever brighter. Those who uphold the precepts accumulate merit with each thought.\n3. Like an infant slowly growing to adulthood. Those who uphold the precepts rise from lowliness to eminence.\n4. Like a starving man constantly longing for food, certain to die without it. Those who do not receive the precepts remain forever blind on the wheel of rebirth.\n5. Like a ship that can cross the great sea. Those who uphold the precepts will surely traverse the bitter sea of birth and death.\n\n**The Regulations state:** If kings, ministers, benefactors, or artisans can benefit the community, they may be provided with food, firewood, and other necessities upon request, with the assembly’s approval. Likewise, if those with power or bandits could harm the community, they too must be supplied with food. These are not good people, but they could damage the community of the Dao.\n\n**The Regulations state:** Common property must not be borrowed for private use. In cases of illness or urgent need, one may request it from the assembly, but it must later be repaid in full.\n\n**The Regulations state:** Unlawful items must not be offered as alms.\n\nThe Perfected Lord asked: \"What are unlawful items?\"\nThe Realized One replied: \"Cattle, horses, slaves, weapons, and the like—these are all unlawful.\"\n\n**The Regulations state:** In times of famine or chaos, when each seeks abundance and tranquility, those who remain steadfast may be given a portion of the community’s private property.\n\n**The Regulations state:** Ritual objects, icons, and scriptures vary in importance depending on their use.\n\nThe Perfected Lord asked: \"What distinguishes the weight of ritual objects, utensils, scriptures, and icons?\"\nThe Realized One replied: \"Bells, chimes, banners, flowers, censers, cases, canopies, precious banners, and scripture wrappings are ritual objects and thus weighty. Hats, shoes, tablets, coarse robes, skirts, jackets, and undergarments are utensils and thus of lesser weight. The original intent determines weight—if one later treats a weighty item as light, it violates the five punishments. If one initially treats a light item as weighty, it is not an offense.\n\nIcons have three ranks: the Heavenly Worthy is supreme, Realized Ones are intermediate, and immortals or masters of the Mystic Teachings are lowest. The original intent in offering an icon determines its weight; it must not be treated as light, or it incurs the ten evils. If a lesser icon is treated as higher, it is not an offense.\n\nScriptures are likewise ranked: *Shangqing* and *Dadong* are the Great Vehicle; *Dongxuan Lingbao* is the Middle Vehicle; *Dongshen Sanhuang* is the Small Vehicle. If one initially intends to create a Great Vehicle scripture but later produces a Middle or Small Vehicle text, it violates the five punishments. If one initially creates a Small Vehicle text but later produces a Middle or Great Vehicle text, it is not an offense.\n\n**The Regulations state:** Stealing ritual objects or utensils is equivalent to the five heinous crimes.\n\n**The Regulations state:** Using common food or drink for private gifts or personal gain is treated as theft.\n\n**The Regulations state:** Common property belongs to all in the ten directions. It is passed down through generations without interruption. It must not be used arbitrarily at the time, nor may it be privately appropriated or divided for personal gain—all such acts incur the sin of the five heinous crimes.",
      "overlap_context": " again, and the orchid withers only to bloom anew. Let us use words to support one another. If the teachings are not heeded, the matter must be brought before the assembly.\"\n\n**The Regulations state:** Disciples under one’s care must be admonished all the more strictly. For grave transgressions, they should be reproached with five points:\n1. \"I now reproach you, and you must leave.\"\n2. \"After leaving, do not enter my quarters again.\"\n3. \"With no one to serve me, I vow never to employ you again.\"",
      "start_char": 3038,
      "end_char": 4301,
      "start_sentence": 125,
      "end_sentence": 181,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.537815809249878,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝千真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "科曰：若母及姑姊妹等，为病患及急难，要须扶提者，无犯。 若是他人儿女，没水堕火，纵有淫心，亦须极救，不得犯触。 科曰：出家之人，单景独宿，与物不群，割爱遗荣，超然宴处。 若犯逐乱，世不崇敬。 科曰：若行住道路，逢女人有所求觅，并乞食饮等，只得隔十步外遥言。 若得物及饮食等，安致地上，或持，去后任来取，不得亲授手中。 若路逢妇女，须避路与过。 科曰：居淫心起时，如逢猛虎，如见毒蛇想，如见国王，如为贼废逢主想，如坐在宅中、宅被火发遗烧想，如乘舡渡海、舡漏欲没想。 作此六心，淫无起处。 科曰：共居观舍、堂殿、园林、田地，三宝众有，殿属天尊，堂属道士。 若其营造尊卑，有其私房，是道士自造，广狭等级，出自己身，死后身前，由身处分。 若死后而无付嘱，徒众施为白衣童子，自所营造。 得度之后，配名则别者，亦听许自己处分。 唯地属三宝，不得改动。 若大众先有别约，众例不犯。 科曰：诸初入道，戒行未全，依倚村坊，不住观舍，上无尊德可畏，下多狡猾为朋，诱引儿女，同床坐起，歌笑僖戏，饮酒食肉，俗人见之，返生秽慢。 如此之类，是灭道法，破他信敬，尊德巡察，依科与罪。 设不能治，国王有法。 科曰：若出家之人，将三宝之物赠遗官人豪势，内求润己，翻令俗人生怖望心，纵能兴建，不如净坐。 如有犯者，准盗物论。 科曰：出家之人，不交世俗，不求名利，不作有为功德，静思入定，降伏外魔，名为净戒，是真宝法母。 科曰：出家之人，清堂虚室，着既甚，有十恶累：一则广占荒野、别畜田宅，二则种植园林、自求地利，三则出入贮积丝绵谷帛，四则畜贩奴婢，五则爱养六畜，六则贪聚八珍，七则乐玩，八则铜饰帷帐，九则衣着奇异，十则财宝珍勤。 此之十事，并不得为，深宜改革，从道日新。 科曰：若有人来乞索，是因三宝起斋，传度讲诵，转经受施。 但是因三宝得者，准明真科，依十二折传处分。 看是此外，所得听出意，布施济惠，仍不得以不净取，以为不净施，皆犯枉法得罪。 科曰：若诸弟子，恒畏天寒时乱、遭饥荒等事，储积丝绵、绢布、五谷，以备时急惠施者，不禁。 科曰：若有人，将器杖、禽兽、非法之物，以惠施者，并不合受。 科曰：若有人，将使人奴婢以供给者，悉不合受。 其使人能斋菜持戒者，可受。 科曰：出家之人房舍，与俗儿女邻并者，夜宿各须闭户，不闭犯律。 科曰：出家之人，宁受犯偷钟盗像之罪，不得言说他家阴私、秽恶之事。 科曰：出家之人，衣裳鞋履，皆须整顿，行动坐起语笑，要须得节。 若为疾病，或威迫惊惧，或被兽，则趂逐被伤刻，举足动步及衣服违法者，不犯。 非此等，犯律。 有故为者，犯律。 仙公问曰：何为犯律。 何为犯科。 真人曰：律无正犯，而言犯律，杖罪； 科无正犯，而言犯科，犯笞罪。 科曰：若野地得藏，还与国王。 驯若藏中有冢铭记，记云是经像堂殿功德之物，得者，依其铭记，处分施造，不须白王。 若不示，犯十恶律。 如路次野中，拾得之物，捉取其物，依物标榜，得主分付。 如不得主人，送常住，不尔犯律。 科曰：冬天洗浴，每一旬一浴。 先作密室，方六尺，安水槽火垆，筒渠注汤水入其，须桃枝栢叶、兰香竹叶等，内笼滤汤。",
      "translated_text": "**The Regulations state:** If one’s mother, aunt, sisters, or other female relatives suffer from illness or urgent distress and require assistance, there is no offense. If the children of others are drowning or trapped in fire, even if impure thoughts arise, one must still do everything possible to save them, without committing any improper contact.\n\n**The Regulations state:** Those who leave the household life dwell alone in seclusion, apart from worldly things, cutting off love and abandoning glory, abiding in tranquil solitude. If they violate this and become disorderly, the world will no longer hold them in reverence.\n\n**The Regulations state:** When traveling on the road and encountering women who make requests, beg for food or drink, or the like, one may only speak from a distance of ten paces or more. If receiving objects or food, place them on the ground or hold them, then depart and allow the woman to take them afterward—never hand them directly. If encountering women on the road, one must yield the path and let them pass.\n\n**The Regulations state:** When lustful thoughts arise, regard them as encountering a ferocious tiger, seeing a venomous snake, facing the king, being a thief caught by the master, sitting in a house as it catches fire, or sailing a boat at sea as it springs a leak. Cultivate these six perceptions, and lust will have no place to arise.\n\n**The Regulations state:** In shared abodes such as temples, halls, gardens, and fields belonging to the Three Treasures, the halls are dedicated to the Heavenly Worthy, while the halls belong to the Daoists. If construction involves distinctions of rank, and there are private chambers, these are built by the Daoists themselves, with size and grade determined by their own status. Upon death, they may dispose of them as they wish during their lifetime. If no instructions are left after death, the disciples or lay novices may manage them. After receiving ordination and being assigned a separate name, they may also dispose of them as they see fit. However, the land belongs to the Three Treasures and may not be altered. If the community has prior agreements, these general rules do not apply.\n\n**The Regulations state:** Those newly entered into the Dao, whose precepts and conduct are not yet complete, rely on villages and hamlets rather than residing in temples. Without venerable masters to revere above or virtuous companions below, they often associate with cunning peers, enticing and accompanying men and women, sharing beds, laughing and jesting, drinking wine and eating meat. When laypeople see this, they instead develop contempt. Such behavior destroys the Dao and the Law, undermines others’ faith and respect, and when discovered by esteemed masters, they are punished according to the regulations. If they cannot be corrected, the king’s law applies.\n\n**The Regulations state:** If those who have left the household life give Three Treasures property to officials or powerful figures to seek personal gain, causing laypeople to develop fearful expectations, even if they are capable of construction, it is better to sit in pure stillness. Those who violate this are judged as having stolen property.\n\n**The Regulations state:** Those who leave the household life do not associate with the secular world, seek fame or profit, or perform conditioned meritorious deeds. They enter stillness and samādhi, subdue external demons—this is called pure precepts, the true mother of the treasure of the Dao.\n\n**The Regulations state:** When those who have left the household life occupy clean halls and empty rooms, excessive attachment leads to ten evil accumulations: first, extensively occupying wilderness and separately maintaining fields and dwellings; second, cultivating gardens and groves for personal land profit; third, storing and accumulating silk, cotton, grain, and cloth; fourth, trading in servants and slaves; fifth, lovingly raising the six livestock; sixth, greedily gathering the eight delicacies; seventh, delighting in play; eighth, adorning curtains with bronze; ninth, wearing strange and extravagant clothing; tenth, diligently hoarding treasures and valuables. None of these ten things may be done. One should deeply reform and daily renew their adherence to the Dao.\n\n**The Regulations state:** If someone comes to beg, whether for the Three Treasures’ sake—such as establishing fasts, transmitting ordinations, lecturing, reciting scriptures, or receiving offerings—whatever is obtained through the Three Treasures must be handled according to the *Mingzhen Regulations*, following the twelve-fold transmission procedures. For other cases, one may freely give alms and bestow charity, but one must not accept impure offerings or make impure donations, as all such acts incur the sin of perverting the law.\n\n**The Regulations state:** If disciples, fearing disorder in cold times or famine, store silk, cotton, silk cloth, and the five grains to prepare for urgent needs and almsgiving, this is not prohibited.\n\n**The Regulations state:** If someone offers weapons, birds, beasts, or unlawful items as alms, none of these should be accepted.\n\n**The Regulations state:** If someone offers servants or slaves for service, none should be accepted. However, if the servants maintain vegetarian precepts, they may be accepted.\n\n**The Regulations state:** If the dwellings of those who have left the household life are adjacent to the homes of lay men and women, each must close their doors at night. Failure to do so violates the precepts.\n\n**The Regulations state:** Those who have left the household life would rather incur the sin of stealing bells or statues than speak of others’ private, shameful matters.\n\n**The Regulations state:** The clothing, shoes, and sandals of those who have left the household life must always be neat. Their movements, sitting, standing, speech, and laughter must be measured. If due to illness, coercion, fright, or being attacked by beasts, they are chased, injured, or their steps and clothing become disordered, there is no offense. Otherwise, it violates the precepts. If done intentionally, it violates the precepts.\n\nThe Perfected Lord was asked: “What is meant by *violating the precepts*? What is meant by *violating the regulations*?”\nThe True Person replied: “When the precepts are not directly violated but one is said to have violated the precepts, it is a flogging offense. When the regulations are not directly violated but one is said to have violated the regulations, it is a caning offense.”\n\n**The Regulations state:** If one finds buried treasure in the wild, return it to the king. If the treasure bears an inscription indicating it belongs to scriptures, images, halls, or meritorious works, the finder should follow the inscription’s instructions to distribute or construct it—no need to report to the king. Failure to do so violates the ten evil precepts. If one finds lost items on the road or in the wild, take the item and post a notice. If the owner is found, return it. If the owner cannot be found, give it to the common property; otherwise, it violates the precepts.\n\n**The Regulations state:** In winter, one may bathe once every ten days. Prepare a private chamber, six feet square, with a water trough, stove, and bamboo pipe to channel hot water into it. Add peach branches, cypress leaves, orchid, and bamboo leaves to the basket for filtering the water.",
      "overlap_context": "** Stealing ritual objects or utensils is equivalent to the five heinous crimes.\n\n**The Regulations state:** Using common food or drink for private gifts or personal gain is treated as theft.\n\n**The Regulations state:** Common property belongs to all in the ten directions. It is passed down through generations without interruption. It must not be used arbitrarily at the time, nor may it be privately appropriated or divided for personal gain—all such acts incur the sin of the five heinous crimes.",
      "start_char": 4302,
      "end_char": 5590,
      "start_sentence": 182,
      "end_sentence": 228,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.683977365493774,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝千真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "至乃鸣厨下鼓，尊卑以次入浴，不得男女同室，亦不得与俗人共浴及浴衣。 若不示，并犯律。 科曰：出家之人，不得饮酒，或妄托天寒，诈称腹痛，饮后色变，或斗乱尊卑。 应供赴斋，或施行章醮，或行游道路，或应对公私，非惟自失礼义，抑亦秽辱道众，是灭道法，无生弘赞。 然应人就请，本以清洁为先，出公入私，皆用端严为首。 有如此例，皆犯律论。 其实是疾痛，众所通知分药，要须不在禁例。 须令出外，不得入法席。 仙公曰：道法之中，听许饮酒。 《灵宝经》云：置酒浮云观，高饮玉清台。 此何顿隔之？ 真人曰：何见之谬。 《太清经》云：化金玉为三十六水，以金为水则为金浆，赤玉为水则为琼浆，白玉为水则：为玉浆，或玉液。 《定志经》云玉液五者不醉，常思净行，何有许法。 科曰：出家之人，出外行游，见人斗打，不孝父母，不顺兄弟，为偷盗，行军兵，伤杀人事，皆须归观香汤洗浴，入静思微，不示犯科。 科曰：斋时受食，皆须净手巾盛 受。 科曰：斋后，须杨枝揩洗口齿。 科曰：斋取时，依立主法，分二十四炁，以定得失。 科曰：小师若见大德，及经像在背后者，皆须侍卫，不得违背。 科曰：传经度戒之时，女官得入道士观，道士得入女官观，要须请师资，位定白众，令知严整法戒，不得一人自往听将，二人同行，直入法堂，更不得私房混乱法事。 当日即出，不得经宿，不尔犯律。 科曰：男女官各得依止。 男官依止男官，女官依止女官，大法者为师。 每一旬，至师所受教训。 至时，整理法服，赤心灵宇，恭敬谨肃，直诣师门，不得东西异向。 至师门已，通问云：某弟子问讯。 师知己，乃端严衣帔，烧香於经诵之室，命弟子进。 进至师前，安详三拜，问讯云：师比者起居安否？ 德无损乎？ 师无他故，乃答云：亦无亏礼诵。 若有疾苦，随事应弟子。 若有罪过，先闻师耳，可云：汝有某事，可加戒诲，令其改隔。 弟子拜谢乃云：不能自励，劳师戒勑。 又拜谢云：从今以去，不敢复犯。 若是斋前，设斋。 斋后，无所施设，乃辞去再拜：愿师以自珍重。 师重戒云：所在之处，勤行斋戒，以自慎护，勿起骄慢。 唯然即退，三步乃始转去，不得更入他房。 归至本观，以师戒诲之言，示众大小，不得藏匿。 若女官无大法，不解传授者，可访男官请受。 若有高德女官，男官亦得诣请受法。 俯仰之格，男女通用。 问曰：道士女官，而被俗人不依道理轻凌，若为依止？ 答曰：若道士女官，而为俗人不依道理轻欺者，告父母、兄弟，及村落有势力者，以为外护。 若道士女官，有不是罪过，可白徒众，徒众依律治罪。 不受，送与国王。 问曰：天尊初得成道，听许男子出家，未审女人从何乃得入道？ 答曰：天尊因乐净信，夫妻结果，道成为元始，因许男女通令出家。 妻以果地，为金中候太夫人之称，亦许女人相系入道。 传经度戒之后，大洞女官见男子入道，受老子自然法已，即须敬礼，依法引接，为能绍隆圣种。 若见有过，垂心慰喻，不得骂詈非谤。 若治箓童子，须礼大洞女官，为敬法故。 问曰：男女童子，依奉经戒，王勑与度，作何方法，得度之后，合礼父母以否？ 答曰：绍隆圣种相系，弘护男女入道，拣取端正慈敏、有道心者，师先试练，十行可轨，听许讲习。",
      "translated_text": "When the kitchen drum sounds, superiors and inferiors shall enter the bath in order of rank. Men and women must not share the same chamber, nor may one bathe with laypeople or use their bathing garments. Failure to observe these rules violates the precepts.\n\n**The Regulations state:** Daoists must not consume alcohol. Some falsely claim cold weather or feign abdominal pain to justify drinking, only to flush with intoxication, disrupt hierarchy, or incite disorder. When attending alms-gatherings, performing rites, traveling on roads, or engaging in public or private affairs, such conduct not only breaches personal decorum but also defiles the Daoist community, extinguishing the Dao and obstructing its propagation. If invited by others, one must prioritize purity and dignity in all public and private conduct. Violations of these principles incur precept-breaking. However, if illness is genuine and known to all, medicinal remedies are permitted without restriction—though the afflicted must remain outside ritual assemblies.\n\nMaster Xian said: \"Within the Daoist tradition, wine is permitted.\" The *Lingbao Sutra* states: *\"Wine is set in the Floating Clouds Abbey, / Highly drunk at the Jade Clarity Terrace.\"* How can this be so starkly contradictory?\n\nThe Perfected One replied: \"What a misguided view! The *Taiqing Sutra* teaches: *Transmute gold and jade into thirty-six waters—gold as water becomes golden nectar, red jade as water becomes crimson nectar, white jade as water becomes jade nectar or jade liquid.* The *Dingzhi Sutra* further states: *The five jade liquids do not intoxicate; constant mindfulness of pure conduct—where is the allowance for such?*\"\n\n**The Regulations state:** When Daoists travel outside and witness fighting, filial impiety, fraternal discord, theft, military violence, or homicide, they must return to the abbey, bathe in fragrant water, and enter quiet meditation to avoid transgression.\n\n**The Regulations state:** When receiving food during a fast, one must use a clean handkerchief to hold it.\n\n**The Regulations state:** After a fast, one must rinse the mouth and clean the teeth with a willow twig.\n\n**The Regulations state:** When selecting alms, follow the established method of the host, dividing the twenty-four *qi* to determine merit or fault.\n\n**The Regulations state:** If a junior disciple encounters a senior master or scriptures and images behind them, they must attend and protect them, never turning their back.\n\n**The Regulations state:** When transmitting scriptures or conferring precepts, female officials may enter Daoist abbeys, and Daoist priests may enter female abbeys—provided they first request a master, establish ranks, and announce the proceedings to the assembly to ensure solemnity and adherence to precepts. No one may attend alone or in pairs, enter the ritual hall unannounced, or disrupt the rites in private chambers. All must depart the same day and not stay overnight; otherwise, they violate the precepts.\n\n**The Regulations state:** Male and female officials shall each have their own dependencies. Male officials depend on male officials, female officials on female officials, with senior masters as their teachers. Every ten days, they shall visit their teacher for instruction. At the appointed time, they must don their ritual robes, compose their minds, and proceed reverently and solemnly to the teacher’s door, facing neither east nor west. Upon arrival, they announce: *\"This disciple pays respects.\"* If the teacher acknowledges them, they adjust their robes and sashes, burn incense in the scripture-recitation chamber, and summon the disciple to enter. Approaching the teacher, the disciple performs three measured bows and inquires: *\"Has the teacher’s health been well of late? Has your virtue remained unimpaired?\"* If the teacher is without affliction, they reply: *\"There has been no neglect of recitations or rites.\"* If illness is present, they respond according to the disciple’s concern. If the disciple has transgressed, the teacher addresses it first: *\"You have committed such-and-such; let my admonishment guide your correction.\"* The disciple bows in gratitude: *\"My lack of self-discipline has troubled you to instruct me.\"* They bow again: *\"From this day forward, I shall not repeat this offense.\"* If the meeting occurs before a fast, a meal is prepared. Afterward, no further arrangements are made, and the disciple takes leave with two bows: *\"May the teacher cherish themselves.\"* The teacher admonishes in return: *\"Wherever you reside, diligently observe fasts and precepts, guard yourself with vigilance, and never succumb to arrogance.\"* The disciple assents and retreats, turning away only after three steps, never entering another chamber. Upon returning to their abbey, they relay the teacher’s instructions to all, senior and junior alike, without concealment. If a female official lacks a senior master or cannot transmit teachings, she may seek instruction from a male official. If a female official of high virtue exists, male officials may also visit her to receive teachings. The etiquette of bowing and rising applies equally to men and women.\n\n**Question:** If Daoist priests or female officials are disrespected or bullied by laypeople without just cause, how should they respond?\n\n**Answer:** If Daoist priests or female officials are unjustly bullied by laypeople, they should inform their parents, siblings, or influential figures in the village to serve as external protectors. If the Daoist or female official has committed an offense, they must report it to the community, who will administer punishment according to the precepts. If the offender refuses correction, they shall be handed over to the king.\n\n**Question:** When the Heavenly Worthy first attained enlightenment, he permitted men to leave the household life. How, then, did women come to enter the Dao?\n\n**Answer:** The Heavenly Worthy, through the pure faith of a devoted couple, achieved fruition in the Dao and became the Primordial Beginning. He then allowed both men and women to leave the household life. His wife, having attained the fruit of realization, was honored as the Lady of Golden Luminance, and women were thus permitted to enter the Dao in succession. After the transmission of scriptures and precepts, senior female officials, upon seeing men enter the Dao and receive the natural teachings of Laozi, must pay reverence and guide them according to the Dharma, for they perpetuate the sacred lineage. If they observe faults, they should offer gentle admonishment, never resorting to scolding or slander. When ordaining young register-holders, one must bow to senior female officials out of respect for the Dharma.\n\n**Question:** How should young boys and girls who uphold the scriptures and precepts be ordained under royal decree? After ordination, should they pay filial respect to their parents?\n\n**Answer:** To perpetuate the sacred lineage and protect the entry of men and women into the Dao, one must select those who are upright, kind, and devout. The master first tests and trains them; if their ten practices are exemplary, they may be permitted to study and cultivate.",
      "overlap_context": "ds lost items on the road or in the wild, take the item and post a notice. If the owner is found, return it. If the owner cannot be found, give it to the common property; otherwise, it violates the precepts.\n\n**The Regulations state:** In winter, one may bathe once every ten days. Prepare a private chamber, six feet square, with a water trough, stove, and bamboo pipe to channel hot water into it. Add peach branches, cypress leaves, orchid, and bamboo leaves to the basket for filtering the water.",
      "start_char": 5590,
      "end_char": 6853,
      "start_sentence": 229,
      "end_sentence": 283,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.10305571556091,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝千真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "王勑与度，依王法制，应合度已，依一大观，严整玄坛，施安兰纂，依明真拔罪之法。 预度男女於坛南，依左右方面以别，两行倚立。 以监度官长正南横行，须一大洞法师横行之前，施案席然香，赞叹曰：大圣天人尊，历代所崇敬。 今有珍贵者，是我大国王。 以发慈善心，普令入正道。 得入正道已，实由国王恩。 永离有为情，长寻圣境界。 必得大法利，同趣证无为。 赞叹既已，白新度法师：今日之后，礼圣礼真，永离亲俗。 人各三礼，长为俗别。 第一礼国王帝主，德泽无尽； 第二礼州县官长，度脱之恩； 第三礼存没父母，得与出家离俗。 三礼讫，法师投新度一人衣冠曰：大哉，圣化被无穷，星宿为冠，日月为服，法天行道，勿替四时，广度众生，求超三界。 法师令大众，普皆唱善弹指三声，旧人唱善弹指，齐各三声讫，乃捴着法衣。 竟，官人行香如法，行道三周，旧人在前引发坛。 叹道事讫，投斋。 斋竟，各谢法徒。 从老起至下竟，列坐父母、兄弟，皆来礼拜。 於儿女边，父母并称弟子，发愿之后，师必定成道，与弟子等，同入正真。 问曰：出家之后，从少至老，有何阶级？ 答曰：出家之人，有五种阶级：从七岁至十一，名蒲车道士； 十二至十四，名驻邪道士； 十五至十九，名趂施道士； 二十至六十，名弘护道士； 七十至九十，名住持道士。 问曰：三乘之道，何以为心？ 答曰：一、小乘之人，隐处山林，自调自爱； 二、中乘之人，德泽弘深后，能兼济度物； 三、大乘之人，忘功绝私，发弘誓愿。 科曰：能劝他人男女，并舍自子出家，譬如微尘世界之数功德，亦不如劝人舍子等出家之功德。 纵有人造幡造盖悬，至三清之境功德，亦不如劝人出家之功德。 科曰：道俗二徒，造於经像，俗人仰之，以金木铜彩模写圣仪，安心供养，名为造像。 科曰； 若有信敬舍施田宅园林，为人侵夺，请报本施主，令其转货。",
      "translated_text": "Under royal decree and in accordance with the king’s statutes, once the candidates are deemed fit for ordination, a grand and solemn altar of the Dao shall be prepared in the manner of the *Great Vision*. The altar shall be adorned with orchid and bamboo ornaments, following the *Rite of Illuminating the True and Removing Transgressions*. The male and female ordinands shall be assembled to the south of the altar, standing in two rows according to their respective sides. The supervising officials shall stand in a horizontal line facing south, with a senior *Dadong* master positioned before them. A table and mat shall be set, incense lit, and the master shall intone the hymn of praise:\n\n*\"Great Sage, revered by gods and men,*\n*Honored through the ages past.*\n*Now a treasure rare appears—*\n*Our great king, of boundless grace.*\n*With compassion’s heart he turns,*\n*Guiding all to the true Way.*\n*Entering the true Way thus,*\n*Is by royal favor won.*\n*Forever free from worldly ties,*\n*Ever seeking sacred ground.*\n*Surely shall they gain the Dao’s great blessings,*\n*Together striving toward the formless true.\"*\n\nAfter the hymn, the master shall address the newly ordained, saying: \"From this day forth, you shall pay reverence to the sages and the perfected, forever parting from worldly kin. Each of you shall perform three bows, marking your separation from the secular.\" The first bow shall be to the king and sovereign, whose virtue and grace are boundless; the second to the provincial and county officials, in gratitude for their ordaining grace; the third to one’s living and deceased parents, for granting the chance to leave the household life. After the three bows, the master shall present the robes and headdress to each newly ordained, saying: \"Great indeed is the sagely transformation, infinite in reach. The stars shall be your crown, the sun and moon your garments. Follow heaven’s Way, never straying from the four seasons. Broadly deliver all beings, seeking to transcend the three realms.\"\n\nThe master shall then command the assembly to universally chant *shan* and snap their fingers three times. The senior members shall likewise chant *shan* and snap their fingers three times in unison. Afterward, the ordinands shall don their ritual robes. Once robed, the officials shall proceed with the incense offering as prescribed, circumambulating the altar three times, led by the senior members. Upon concluding the rites, the feast shall be offered. After the feast, each shall express gratitude to their fellow practitioners. Beginning with the eldest and proceeding to the youngest, parents and siblings shall take their seats, and all shall bow to the newly ordained. The parents shall address their sons and daughters as *disciples*, vowing that after the master attains the Dao, they too shall enter the realm of the true and perfected.\n\n**Question:** After leaving the household life, from youth to old age, what are the hierarchical ranks?\n\n**Answer:** Those who leave the household life are divided into five ranks: from ages seven to eleven, they are called *Puche Daoists*; from twelve to fourteen, *Zhuxie Daoists*; from fifteen to nineteen, *Chenshi Daoists*; from twenty to sixty, *Honghu Daoists*; and from seventy to ninety, *Zhuchi Daoists*.\n\n**Question:** What is the essence of the Three Vehicles of the Dao?\n\n**Answer:** First, the *Lesser Vehicle*: those who dwell in secluded mountains and forests, cultivating and cherishing themselves. Second, the *Middle Vehicle*: those whose virtue and grace run deep, enabling them to broadly deliver beings. Third, the *Greater Vehicle*: those who forget merit and renounce self-interest, making vast and solemn vows.\n\n**Statute:** To encourage others—men and women alike—to offer their own children to leave the household life is a merit surpassing even the construction of as many worlds as motes of dust. Even the merit of erecting banners and canopies to adorn the realm of the Three Clarities cannot compare to the merit of encouraging others to leave the household life.\n\n**Statute:** Both Daoists and lay followers who create scriptures and images: when laypeople revere them, using gold, wood, bronze, or pigments to replicate the sacred forms and enshrine them with devotion, this is called *creating images*.\n\n**Statute:** If one who has piously offered fields, dwellings, gardens, or groves finds them seized by others, the original donor shall be informed, allowing them to reclaim and reallocate the property.",
      "overlap_context": "ials out of respect for the Dharma.\n\n**Question:** How should young boys and girls who uphold the scriptures and precepts be ordained under royal decree? After ordination, should they pay filial respect to their parents?\n\n**Answer:** To perpetuate the sacred lineage and protect the entry of men and women into the Dao, one must select those who are upright, kind, and devout. The master first tests and trains them; if their ten practices are exemplary, they may be permitted to study and cultivate.",
      "start_char": 6853,
      "end_char": 7580,
      "start_sentence": 284,
      "end_sentence": 318,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.97107696533203,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝千真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "科曰：出家之人，与俗有别，然而死病亦无定法。 然稍修轨制病之时，转读然香，昼夜不绝，临打无常磬送终，依五练生尸法，失以病疾。 观内大众，数以存问，检校厨下，令前与病人食。 疾病之时，难有达命，福势既尽，乃欲隐避东西。 此并是前路功德无凭，而以临时惊惧作此，意速死而已。 可以净洒扫，开敞房舍，来往善知识达命之言，更相启发，请法无常。 宁有住者，必应寿尽，量命无机，可移入迁化堂。 其堂，可於观西北角别立，为院堂三间五架，堂面看西北。 其堂中高座，上造升虚像，身坐莲花，如人大，举左手以指天门，左右二真侠。 侍病人恐命将绝，移入堂中像座后安置，用黄纹全幅为幡，长二丈四尺，尖击左真腰，幡头与病人手投，令病人直心正念，愿随二真登天门，诣金阙。 若未应化，随建福田，男向左真，女向右真，一人入此堂、难得平然归者，临命将绝，咸称未困，特是贪生，有此计耳。 达命君子，岂去住为心。 科曰：出外行游，须思量结觅好伴，当有十可观：一择觅知己，二要须正见，三心心相得，四疾苦相忧，五递乐相师，六威仪勿失，七行动检摄，八所见鞠躬，九礼敬尽节，十进退合仪。 可同行也。 科曰：道学法徒，速来客依，不问大小，各须安置。 先与房舍，次给所须，三令随众朝拜，四教示门中讳忌，五语去处避就。 科曰：清信俗人，欲入观舍，观斋听法，请会供养者，并须清净，不染熏辛酒气，严整衣服。 结束卑恭，敛身下意，先礼天尊，次拜大德，后小戒道士。 既入门，通当崇敬。 若是日日斋讲，恒在二时，须来者，直於礼座，礼天尊，即以安坐。 其善女人来者，亦准此，不得语笑倡荡，脂粉图饬，妆眉画面，常须执志整容，观听妙法，舍香发愿，同契成道。 科曰：俗人入观寄宿，不得眠坐常卧之床，得坐居客别床。 眠时，不得脱衣露体。 科曰：恩德大者，无过孝顺，父母师主亲自供养，温良无失，此恩最大。 又能劝课，令人作善，其功等比。 若父母贫老、疾病、死亡，无可以充衣食、汤药、茶饼者，得供营送。 若父母不敬信三宝者，怡颜劝喻，令得法利。 问曰：俗人欲斋戒者，何为教示？ 答曰：若欲入斋者，可以一日、八日、十五日、二十八日、二十九日六斋日示之。 若能进，又以一日、十四日、十五日、二十三日、二十四日、二十八日、二十九日，以八斋日示之。 若又能进，以一日、八日、十四日、十五日、十八日、二十三日、二十四、二十八日、二十九日、三十日十直斋日示之。 若又能进，即以正月、七月、十月三元斋示之。 若又能进，即以正月、三月、五月、七月、九月、十一月岁中六斋月示之。 若欲斋，人先令受戒，戒之所起，三业为初。 身业有三：杀、盗、邪淫，口业有四：妄言、绮语、两舌、恶骂，意则有三：贪、嗔、痴。 此之十戒，由三业根，先须防之。 问曰：斋食，若为次第？ 答曰：若自居常斋，厨下监厨一人，先自检校厨头巢菜，调和生熟、颜色、气味，并令得所。 次看日时圭影。 天阴，取漏刻，以正斋时。 时，鸣钟召食，各送食器於斋堂，量坐处位次安置。 敛钟讫，行道赞叹竟，各坐定已，水一遍，次行食，中始就食。",
      "translated_text": "**Statute:** Those who leave the household life are distinct from the laity, yet illness and death follow no fixed law. When one falls ill, rites should be observed: incense must be burned and scriptures recited without cease, day and night. At the moment of passing, the *wu-chang* chime is struck to send forth the spirit. The Five Refining Corpse Rites are to be followed, lest the affliction persist. The monastic assembly should frequently visit the sick, inspect the kitchen, and ensure meals are prepared for the ailing. In times of illness, few comprehend the approach of death; when one’s karmic fortune wanes, they may seek to flee east or west. Such actions arise from the absence of prior merit, driven by last-minute fear—merely hastening death. Instead, the chamber should be swept clean and the quarters opened wide. Let those of virtuous understanding come and go, offering teachings on impermanence. If one clings to dwelling, death is certain; when the breath falters, they may be moved to the Hall of Transformation. This hall should be established in the northwest corner of the abbey, a three-bay structure with five beams, its facade facing northwest. Within, a high seat is prepared, upon which a celestial image is crafted—its form seated upon a lotus, human in size, the left hand raised to point toward the Gate of Heaven, flanked by two Perfected Ones. When a sick person’s end nears, they are placed behind the image’s seat. A yellow silk banner, twenty-four feet long, is draped so that its tip rests at the waist of the left Perfected One, while the banner’s head is placed in the dying person’s hand. This guides their mind to focus on the upright thought, aspiring to ascend with the Two Perfected through the Gate of Heaven to the Golden Palace. If they are not yet destined to depart, their merit is dedicated to the field of blessings: men face the left Perfected, women the right. Few who enter this hall leave in peace; at life’s end, all claim no distress, yet this is but attachment to life. The wise, who understand destiny, do not fixate on going or staying.\n\n**Statute:** When traveling abroad, one must seek good companions, observing ten principles: first, choose a trusted friend; second, ensure right view; third, mutual understanding; fourth, shared concern in suffering; fifth, learning from one another’s joys; sixth, maintaining dignified conduct; seventh, disciplined movement; eighth, bowing to all encountered; ninth, reverence with utmost devotion; tenth, proper conduct in advance and retreat. Only then may they journey together.\n\n**Statute:** When Daoist disciples or visiting guests arrive, regardless of status, each must be accommodated. First, provide lodging; next, furnish necessities; third, instruct them to join the assembly for worship; fourth, teach the taboos of the abbey; fifth, advise on where to go and what to avoid.\n\n**Statute:** When lay devotees enter the abbey to lodge, fast, listen to the Dao, attend assemblies, or make offerings, they must maintain purity, free from the taint of garlic, onions, alcohol, or strong odors. Their attire should be neat, their demeanor humble and reverent. Upon entering, they first bow to the Heavenly Worthy, then to the great masters, and finally to the novice Daoists. Once inside, they must uphold reverence. If attending daily fasts or lectures, which occur at the two fixed times, they should bow to the Heavenly Worthy at the altar before taking their seat. Laywomen who come must adhere to the same rules, refraining from laughter, frivolity, or adornment with cosmetics, makeup, or painted brows. They should maintain solemn composure, listen to the wondrous Dao, offer incense, make vows, and together aspire to enlightenment.\n\n**Statute:** When laypeople lodge in the abbey, they may not sleep or sit on the monks’ regular beds but must use a separate guest bed. When resting, they may not remove their clothes or expose their bodies.\n\n**Statute:** No virtue surpasses filial piety. Serving one’s parents, teachers, and masters with warmth and care is the greatest kindness. Encouraging others to do good yields equal merit. If parents are impoverished, elderly, ill, or deceased, lacking clothing, food, medicine, tea, or offerings, one must provide and arrange for them. If parents do not revere the Three Treasures, one should gently persuade them to gain the blessings of the Dao.\n\n**Question:** How should laypeople be instructed when observing fasts?\n**Answer:** For those entering a fast, begin with the six fast days: the 1st, 8th, 15th, 28th, and 29th of the lunar month. If they progress, add the eight fast days: the 1st, 14th, 15th, 23rd, 24th, 28th, and 29th. If they advance further, introduce the ten direct fast days: the 1st, 8th, 14th, 15th, 18th, 23rd, 24th, 28th, 29th, and 30th. For greater commitment, teach the Three Yuan Fasts of the 1st, 7th, and 10th months. For the utmost dedication, instruct the six fast months of the year: the 1st, 3rd, 5th, 7th, 9th, and 11th months. Before fasting, one must first receive the precepts. The precepts arise from the three karmic actions: bodily, verbal, and mental. Bodily transgressions are three: killing, stealing, and sexual misconduct. Verbal transgressions are four: false speech, frivolous talk, divisive words, and harsh language. Mental transgressions are three: greed, anger, and delusion. These ten precepts stem from the roots of the three karmic actions and must be guarded first.\n\n**Question:** What is the proper order for fasting meals?\n**Answer:** For regular fasts, one kitchen supervisor is appointed to inspect the head cook and the vegetables, ensuring the preparation of raw and cooked foods, their color, and flavor are all appropriate. Next, observe the gnomon’s shadow to determine the time; if the sky is overcast, use a water clock to fix the fasting hour. At the appointed time, the bell is rung to summon the meal. Each person brings their eating utensils to the fasting hall and places them according to their seat. After the bell is silenced, the circumambulation and hymns conclude, and all sit in order. Water is served once, then the meal is distributed, beginning with the first portion.",
      "overlap_context": "rit of encouraging others to leave the household life.\n\n**Statute:** Both Daoists and lay followers who create scriptures and images: when laypeople revere them, using gold, wood, bronze, or pigments to replicate the sacred forms and enshrine them with devotion, this is called *creating images*.\n\n**Statute:** If one who has piously offered fields, dwellings, gardens, or groves finds them seized by others, the original donor shall be informed, allowing them to reclaim and reallocate the property.",
      "start_char": 7581,
      "end_char": 8803,
      "start_sentence": 319,
      "end_sentence": 360,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.712799310684204,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝千真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "尊卑得序，前下先师拌，监厨人长跪擎柈於先师座前，节众人座头鸣磬子一下，座头大德咒曰：建斋，为道真、为道种、道父、道母、真人、神人、仙人、圣人，或同为道，同共饮食，长生无极。 竟，柈下先师前，次下斋人食，恒声各唱巢菜饮食名示众，斋人各捧器物盛受。 若不须者，勿取。 大德顾望看食，通至下周遍竟，乃令鸣磬子一下云：请就食。 大众安庠正坐，无语无笑，以就食。 食时，示不鸣唇，亦不□口，亦无歠饮之声，亦无咯唾，亦无呻声吐气，亦无惊匙打筋。 上座缓食，相待行食之时，事事三遍，行上次下第。 行食讫，从下收上。 行食时至，是时应受，非时不得辄索。 斋欲了，敛取众生饭散与众生。 非监厨人，不得向厨下有所科索。 饭食来不及斋，即须下堂食。 若强入斋堂，即名触食。 众食未了，食饱辄起，即名惊座。 众若自居长斋，无先师拌，即无先师，咒即有出。 众生饭咒食了，行饮一遍，次行水一遍，各收食器竟，鸣磬子一下，唱曰：斋食以竟，各随意下息。 大德乃以捧食器出堂，归房盥漱。 监厨人检校厨下，不得一人不出。 若犯前一条者，对众各罚二十拜。 若应俗人斋供，坐起受食并同，唯受果不得不受，俗人恐生拣择之意。 但受之食竟，余果食并面前节，众人鸣磬子一下，唱白：大众斋余长食，充主人无碍用。 同者嘿然，不同者说。 三唱讫，斋官或有父母、师主老病，得取此余果，即起白云：某甲有父母、师主老病，今将某果归家饷馈。 上座大德答云：好将去。 若不此者，并令主人收充家中无碍用。 或问曰：斋时，合出众生余否？ 答曰：弃贤世界初开，元始命行道真人下教，为遍尝百草，以得五谷，活於人命，一切饿鬼，无种植功。 於斋之次，各出饭七粒，真人德施与一切众生，亦名神农饭，亦名众生饭，一切众生得此饭一粒，能饱千曰。 科曰：出家人行动语笑，并避讥嫌。 入法之人，不得言杀心杀，不得言奸起奸，不得言盗起盗，才非正法，并须隐避。 科曰：圣人去代，众生恋慕，可以驻心，发众生敬信。 堂造堂殿，宫阙台榭，施置雕饰，造十方天尊、真仙、圣众，或金、或铜，或铁、泥木、图画，随力能辨，幡化仗乐，种种供养。 若以日月增久，虫鼠侵伤，乌粪秽污，牛马冲突，遂致毁坏。 能有敬信，身手治理，或顾借工匠，洗饰安置，犹胜前人初造功德。 何以故重发人敬信，又续前人基址故也。 科曰：朝哺礼拜三宝，得於礼拜板上。 若行道时，得於地铺席上。 若於路相逢无席，得於地上。 如地上礼时，手至地，得屈指，指背着地，不使尘污掌心，名为护净。 若为高广大床、平床、长床、方床上礼拜者，并不合仪，深乖崇敬。 譬如见世间高贵，尚当进退合节，何况谒圣朝真，而於床上启白，冥考一百日。 科曰：尊像之前，即是奉真承圣。 对俗间官长，尚乃不敢低顿，岂况朝谒八真七圣，而以倨傲形容，或大语高声，或更相亏林，或攘怒眼，或仰卧斜身，并以结罪冥科，亦大为俗人不生敬信。 科曰：斋戒之家，未至一日，先於门前竖一长竿，悬十绝大幡，标门户，示绝浮好，以存闭静。 科曰：出家之人，常合忠正，出入动止，以正为先。 一正己身，二正门徒子弟，三正观中良贱，四正四远法众，五正顽为俗人。",
      "translated_text": "Rank and seniority must be observed in order. First, the offering is presented to the former masters, with the kitchen supervisor kneeling to raise the tray before the seat of the former masters. A single strike of the chime bowl at the head of the assembly signals the senior venerable to recite the incantation: \"This fast is established for the true Dao, the seeds of the Dao, the Father of the Dao, the Mother of the Dao, the Perfected, the Divine, the Immortals, the Sages—all gathered to partake of the Dao together, to share in this meal, and to attain boundless longevity.\" When the recitation concludes, the tray is first lowered before the former masters, then before the fasting assembly. The names of the vegetables and foods are announced aloud to the assembly, and each person holds their utensils to receive their portion. If one does not require something, it should not be taken.\n\nThe senior venerable surveys the meal, ensuring it is distributed evenly to all. Once the round is complete, a single strike of the chime bowl signals: \"Please begin eating.\" The assembly sits in orderly silence, without speech or laughter, to partake of the meal. While eating, one must not smack their lips, make slurping sounds, spit, sigh, exhale audibly, clink utensils against bowls, or clatter chopsticks. The senior seat eats slowly, waiting for the distribution of food, which is served three times in order from the highest to the lowest. When the meal is finished, the utensils are collected from the lowest to the highest.\n\nFood is to be received only at the proper time; it may not be demanded out of turn. As the fast nears its end, the leftover rice is gathered and scattered for all beings. Those who are not kitchen supervisors may not enter the kitchen to make demands. If the meal is insufficient for the fast, one must eat outside the hall. Forcing entry into the fasting hall is called \"disrupting the meal.\" Leaving before the assembly has finished eating is called \"disturbing the seat.\"\n\nFor those observing a long-term fast without a former master’s offering, the incantation is recited as follows. After the incantation for the rice of all beings concludes, water is served once more, followed by a final round of rinsing. When all have gathered their utensils, a single strike of the chime bowl is sounded, and it is announced: \"The fasting meal is complete. You may now rest as you wish.\" The senior venerable then carries the utensils out of the hall, returning to their quarters to wash and rinse. The kitchen supervisor inspects the kitchen to ensure no one remains behind.\n\nThose who violate any of the above rules shall each perform twenty prostrations before the assembly as penance.\n\nFor fasts attended by laypeople, the procedures for sitting, rising, and receiving food remain the same. However, all offered fruits must be accepted to prevent laypeople from developing preferences. After the meal, any remaining food or fruit is placed before the assembly. A single strike of the chime bowl signals the announcement: \"The leftovers from the assembly’s fast may be used freely by the host.\" Those who agree remain silent; those who disagree may speak. After three announcements, if the fasting officer has elderly or ailing parents or teachers, they may take the remaining fruit, rising to declare: \"[Name] has elderly or ailing parents or teachers and wishes to take this fruit home as an offering.\" The senior venerable responds: \"You may take it.\" Otherwise, the host may keep the leftovers for their household’s free use.\n\n**Question:** Should leftover food for all beings be set out during the fast?\n**Answer:** When the world of the worthy first emerged, the Primordial Beginning commanded the Perfected of the Dao to descend and teach, tasting the hundred herbs to discover the five grains and sustain human life. All hungry ghosts lack the merit of cultivation. During the fast, each person sets out seven grains of rice, a virtuous offering from the Perfected to all beings. This is also called \"Shennong’s rice\" or \"the rice of all beings.\" A single grain can satiate a being for a thousand days.\n\nThe regulations state: Those who have left the household must conduct themselves in word and deed to avoid reproach or suspicion. Practitioners of the Dharma must not speak of killing with killing intent, nor of lust with lustful intent, nor of theft with thieving intent. Any improper conduct must be concealed.\n\nThe regulations state: As the age of the Sages recedes, beings long for their presence. One may focus the mind to inspire reverence and faith in all beings. Temples, halls, palaces, towers, and pavilions may be constructed and adorned with carvings and paintings. Statues of the Ten Directions’ Celestial Worthies, Perfected Immortals, and Sages—whether of gold, bronze, iron, clay, wood, or painted—may be made according to one’s ability, along with banners, ritual implements, and musical instruments for various offerings. If, over time, these are damaged by insects, rats, bird droppings, filth, or the trampling of oxen and horses, those with reverence and faith may repair them with their own hands or hire artisans to restore and reinstall them. This surpasses the merit of the original creators, for it renews others’ reverence and continues the foundation laid by predecessors.\n\nThe regulations state: Morning and evening prostrations to the Three Treasures should be performed on a prostration board. During circumambulation, one may use a mat laid on the ground. If no mat is available while traveling, one may prostrate directly on the ground. When prostrating on the ground, the fingers may be bent so the backs of the fingers touch the earth, preventing dust from soiling the palms—this is called \"protecting purity.\" Prostrating on high, wide, long, or square beds is improper and deeply disrespectful. Even in the presence of worldly nobility, one must observe proper decorum; how much more so when paying homage to the Perfected and Sages? To address them from a bed incurs a hundred days of karmic retribution in darkness.\n\nThe regulations state: Before the revered images, one stands in the presence of the Perfected and the Sages. Even before worldly officials, one dare not slouch; how much less before the Eight Perfected and Seven Sages? To display arrogance in posture, speak loudly, interrupt others, glare angrily, or recline carelessly incurs karmic retribution and undermines the reverence of laypeople.\n\nThe regulations state: In households observing fasts, a day in advance, a long pole is erected before the gate with ten large banners hanging from it, marking the entrance to signify the renunciation of worldly attachments and the cultivation of seclusion.\n\nThe regulations state: Those who have left the household must always uphold loyalty and integrity, prioritizing correctness in all actions. First, correct oneself; second, correct one’s disciples and followers; third, correct the high and low within the temple; fourth, correct the distant Dharma assembly; fifth, correct the obstinate among laypeople.",
      "overlap_context": "olor, and flavor are all appropriate. Next, observe the gnomon’s shadow to determine the time; if the sky is overcast, use a water clock to fix the fasting hour. At the appointed time, the bell is rung to summon the meal. Each person brings their eating utensils to the fasting hall and places them according to their seat. After the bell is silenced, the circumambulation and hymns conclude, and all sit in order. Water is served once, then the meal is distributed, beginning with the first portion.",
      "start_char": 8803,
      "end_char": 10051,
      "start_sentence": 361,
      "end_sentence": 406,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.570817947387695,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝千真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "能正己身为物轨，则能正弟子，承禀有仪，能正观中大小从顺，能正四远法义称扬，能正顽为广增惠解。 能如此者，名为道士。 若身既不正，为物所憎，弟子不敬，却贱师主。 观中常无禁忌，大小贵贱混淆，不存信义，四远同皆厌恶，欺凌愚蔽，增长罪田，不能广立威恩，却更诱引他家子弟、奴婢，或图物入己，或私与交关，不依正义在身，恒以邪僻为行。 有如此色逃课凶贼，共所防戒。 如不受惩，国王有法。 科曰：出家之人，还归俗家。 若有父母，可归父母之堂，别床安置，不得与俗人共床坐。 若父母有疾，听得扶持看侍。 若无父母，可进客堂，安慰大小，并不得嗔声大语，及俗间戏吓哂笑，累杂男女，经宿居停，并犯戒律。 科曰：若退一纪，即退三百日。 若减十算，减十日。 科曰：参省师主大德，皆三拜侍立，命坐即拜而坐，更问他故，则起立而答，皆条直身体，并脚敛手。 科曰：为弟子洒扫之礼，必加篇於箕上，两手捧接腋下而来，次有五事：一则敛尘扫时，以袂拘而却； 二则灭迹，勿使有於痕迹，不净於恶； 三则不背长者，勿生不敬； 四则除粪箕自向； 五则扫篇还故处。 不尔，犯科。 科曰：为弟子之礼师主，令过授物事。 师主若立，则倚授； 师主若坐，则长跪授。 科曰：进尊者之房户，知在房中、或库内，若不闻声，□咳发觉。 如不闻，退。 若问，称名启白，命入则入，房开则开，户闭则闭。 入户，正视尊者，左右斜顾犯科。 科曰：为弟子之礼师主，有客当即拂拭床席枕褥，洒扫前后讫，白师主，师主令命客进，乃命客进。 科曰：弟子有所启白，得主及同观、外观大德，皆整衣至房，房闭，当屈指细细打户三过。 停少时，不闻人声，又三过，合九过，不闻人声则退。 科曰：师主大德，若从远归，命所使先到观中，令知归至。 弟子则整衣被出观迎接，当以大顾望，不得无故掩人不备。 科曰：若於道路，逢见得主及师知故，皆以下风避影，不隔越道路而与共言，当以曲腰磬拆，有言则对，无言则退。 科日：随从尊者出入，当为提持机杖、鞋履。 登危临崄，当以亲侍左右，两手提携，不得散手远离，老少别用。 科曰：夫为弟子之礼，出则启白，还则慰问，问讯上下，乃复常业。 科曰：众有疑惑，我不劝成。 众有评论，我所审察。 众有擅造，我从众宜。 众有行游，我不矫俗。 自常卑退，尊敬於前人。 科曰：为师主大德存众之法，宽宏以立节容物，慈爱以约众，行事以恭勤，朝修以肃敬。 上乃均平，不生异心，下无怨色，斯为大德者矣。 科曰：为人自己有善行，当与在下共之，勿自取归己。 科曰：学道者，不发他人过，不扬己之能，不拒人之谏，不见己之怨。 科曰：行道时，斋主礼三宝讫，投香炉，拱手长跪法师之前。 法师三揲香咒曰：当愿主人七世父母得出长夜，身睹光明，灾消福降，生死升仙。 讫乃行香。 科曰：自临中食时，咒曰：二玄上道，四极清泠，太乙帝君，百神黄宁，受粮三宫，灌溉脾灵，上飨太和，餐味五声，魂胎之命，七液流停，百关通和，五藏华明，双皇合景，飞行上清。 科曰：为人斋，出饭咒曰：今日是吉日，斋戒向太上。 中食天行厨，主人福无量。 科曰：下先师饭咒曰：建斋，为道真，为道种、道父、道母、真人、神人、仙人、圣人，或共为道，同共饭食，长生无极。",
      "translated_text": "To rectify one’s own conduct as a model for others is to rectify one’s disciples, ensuring they receive instruction with proper decorum; to rectify all within the temple, great and small, so they follow in harmony; to rectify the distant Dharma assembly, that the teachings may be praised afar; and to rectify the obstinate among laypeople, broadening their understanding and kindness. One who can do this is called a Daoist.\n\nIf one’s own conduct is not upright, one becomes an object of aversion. Disciples show no respect, and the master is held in contempt. Within the temple, rules and taboos are disregarded, hierarchy is confused, and trust and righteousness are absent. The distant assembly grows resentful, deceiving and oppressing the ignorant, cultivating a field of transgression. Instead of establishing authority and benevolence, one lures away the disciples, servants, or slaves of others, coveting their possessions or engaging in clandestine dealings, forsaking righteousness and perpetually acting with perversity. Those who exhibit such behavior—escaping duties, harboring malice—are to be guarded against and admonished. Should they refuse correction, the law of the king shall apply.\n\nThe regulations state: If one who has left the household returns to lay life—if they have parents, they may return to their parents’ hall but must reside in a separate bed and not share a bed with laypeople. If their parents are ill, they may assist in their care. If they have no parents, they may enter the guest hall to attend to all, great and small, but must not raise their voice in anger, engage in worldly jest or mockery, or mingle with men and women, staying overnight—all of which violate the precepts.\n\nThe regulations state: To withdraw for a full cycle of twelve years is to withdraw for three hundred days. To reduce by ten years is to reduce by ten days.\n\nThe regulations state: When visiting one’s master or a great virtue, one must bow three times and stand in attendance. When invited to sit, one bows before sitting. If further inquiry is made, one rises to answer, standing upright with feet together and hands clasped.\n\nThe regulations state: In the duties of a disciple performing sweeping, the dustpan must be placed upon the broom. Both are carried under the arm when approaching. There are five rules: first, when sweeping, gather dust with the sleeve and brush it away; second, erase traces so no marks remain, avoiding impurity; third, do not turn one’s back to elders, lest disrespect arise; fourth, the dustpan must face forward when removing waste; fifth, return the broom and dustpan to their proper place. Failure to comply violates the regulations.\n\nThe regulations state: In the duties of a disciple serving their master, when passing or receiving objects—if the master stands, one leans forward to receive; if the master sits, one kneels to receive.\n\nThe regulations state: When entering the room of an honored one, if one knows they are within—whether in the chamber or storeroom—and hears no sound, one should cough to announce their presence. If there is no response, one retreats. If asked, one states their name and seeks permission. If bidden to enter, one enters; if the door is open, one opens it; if closed, one closes it. Upon entering, one gazes directly at the honored one—glancing sideways violates the regulations.\n\nThe regulations state: When a disciple attends their master and a guest arrives, they must first dust and arrange the bed, mat, pillow, and bedding, then sweep the area before and after. Only after informing the master and receiving permission may they invite the guest in.\n\nThe regulations state: When a disciple has something to report, whether to their master, fellow temple residents, or external great virtues, they must adjust their attire and approach the room. If the door is closed, they lightly tap it three times with a bent finger. After a brief pause, if no response is heard, they tap three more times—nine taps in total. If still no response, they retreat.\n\nThe regulations state: When a master or great virtue returns from afar, they should send a messenger ahead to the temple to announce their arrival. Disciples must then adjust their attire and go forth to welcome them, gazing intently to avoid startling or catching them unawares.\n\nThe regulations state: Upon encountering one’s master or an elder acquaintance on the road, one must step aside to the leeward, avoiding crossing their path. One bows deeply, and if spoken to, responds; if not, one retreats.\n\nThe regulations state: When accompanying an honored one in travel, one must carry their staff, shoes, and other belongings. When ascending heights or traversing perilous terrain, one attends closely to their left or right, offering support with both hands—never straying far. The elderly and the young are to be treated differently.\n\nThe regulations state: In the duties of a disciple, when departing, one must inform their master; upon returning, one must offer greetings and inquire after all, high and low, before resuming regular duties.\n\nThe regulations state: When the assembly is in doubt, I do not insist on my own way. When the assembly deliberates, I examine carefully. When the assembly acts independently, I follow their lead. When the assembly travels, I do not defy custom. I remain humble and deferential, honoring my elders.\n\nThe regulations state: The method for a master or great virtue to guide the assembly is to establish dignity with magnanimity, restrain the many with compassion, conduct affairs with reverence and diligence, and perform morning practices with solemn respect. Above, one must be impartial, avoiding partiality; below, one must ensure no resentment arises. Such is the way of the great virtue.\n\nThe regulations state: If one achieves good conduct, one should share it with those below, not claiming it solely for oneself.\n\nThe regulations state: Those who study the Dao do not expose the faults of others, do not boast of their own abilities, do not reject others’ admonitions, and do not harbor resentment.\n\nThe regulations state: During the Daoist rites, after the host has paid homage to the Three Treasures and offered incense into the censer, they kneel with hands clasped before the Dharma master. The Dharma master takes the incense three times and recites the incantation: *\"May the host’s seven generations of ancestors escape the long night, behold the light, have disasters dispelled and blessings descend, and ascend from death to immortality.\"* The rite of offering incense then proceeds.\n\nThe regulations state: At the midday meal, recite the incantation: *\"The Two Mysteries ascend the Dao, the Four Poles are pure and cool. The Supreme One, the Emperor Lord, and the Hundred Spirits of Huangning receive sustenance in the Three Palaces, irrigating the spirit of the spleen. Above, they partake of the Great Harmony, consuming the five flavors. The life of the soul and embryo, the seven fluids flow and settle. The hundred passages are harmonized, the five viscera flourish. The Twin Sovereigns merge with the radiance, soaring to the Upper Clarity.\"*\n\nThe regulations state: When serving a meal during a fast, recite the incantation: *\"Today is an auspicious day, fasting and facing the Supreme. The celestial kitchen serves the midday meal—may the host’s blessings be boundless.\"*\n\nThe regulations state: When offering the first portion to the former masters, recite the incantation: *\"Establishing the fast for the true Dao, for the seed of Dao, the father of Dao, the mother of Dao, the perfected, the divine, the immortals, the sages—or together for the Dao—may we share this meal and attain limitless longevity.\"*",
      "overlap_context": " with ten large banners hanging from it, marking the entrance to signify the renunciation of worldly attachments and the cultivation of seclusion.\n\nThe regulations state: Those who have left the household must always uphold loyalty and integrity, prioritizing correctness in all actions. First, correct oneself; second, correct one’s disciples and followers; third, correct the high and low within the temple; fourth, correct the distant Dharma assembly; fifth, correct the obstinate among laypeople.",
      "start_char": 10051,
      "end_char": 11364,
      "start_sentence": 407,
      "end_sentence": 457,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.40677833557129,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝千真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "科曰：出众生饭咒曰：勤修大道法，精诚感太冥。 真降魔魅散，众妖皆灭形。 七祖生南宫，兆身登上清。 福既无不普，法食施众生。 科曰：服糜咒曰：今日清净，服食仙粮。 行香吃粥，寿命延长。 又曰：乾、元、亨、利、贞，身为大法王。 糜粥入腹，五脏清凉。 漱口咒曰：杨枝捶口眼明好，愿得一枝供大道。 道在一树多名香，愿将身心奉三宝。 科曰：出家同道，与俗有乖，是我法徒，共相掩蔽，匿恶举善，递互生恩，使远近称扬，通令深信。 论云：天下善人少，不善人多。 今时之人，吹毛觅瑕，互相谗嫉，不知己过，强毁他非。 设有一善，争相毁谤，不能改身就善，乃欲败善同恶，故坏道法，专由此人。 大德尊者，深所约语。 科曰：盗造像物，罪同十恶。 若盗将他家，相缘路告讫，又取物入己，被八门长考，万劫无出。 科曰：盗十方斋供众物，或为头首，私自入己，入火坑狱，万劫方出，更入酆都，六十年考，长为饿鬼。 科曰：若有恶口赤舌，凶徒恶党以相群聚，常怀远离。 设使偶会，情不获已，须要口顺心。 若不能行，灾为切害。 科曰：凡人为道，威仪不足，皆为犯科。 以此示子，子明审之。 仙公奉科，稽首而退。 洞玄灵宝千真科竟",
      "translated_text": "The regulations state: When offering the meal for all beings, recite the incantation:\n*\"Diligently cultivating the great Daoist dharma,\nWith utmost sincerity, we move the Supreme Darkness.\nThe true descends, demonic illusions scatter,\nAll malevolent spirits vanish without form.\nThe seven ancestors are born in the Southern Palace,\nThe self ascends to the Upper Clarity.\nAs blessings are universally bestowed,\nWe offer this dharma-meal to all beings.\"*\n\nThe regulations state: When consuming congee, recite the incantation:\n*\"Today is pure and serene,\nConsuming the immortal’s provisions.\nBurning incense and partaking of porridge,\nLifespan extends without end.\"*\nIt is also said:\n*\"Qian, Yuan, Heng, Li, Zhen—\nThe body is the great Dharma King.\nCongee enters the belly,\nThe five viscera become cool and clear.\"*\n\nThe mouth-rinsing incantation states:\n*\"The willow twig cleanses the mouth, brightening the eyes,\nMay I obtain a branch to offer to the great Dao.\nThe Dao resides in a single tree, fragrant with many names,\nMay I dedicate body and mind to the Three Treasures.\"*\n\nThe regulations state: Those who leave the household to follow the Dao differ from the secular world. These are our Dharma disciples—we must mutually conceal faults and promote goodness, reciprocating kindness, so that near and far may praise and deeply believe.\n\nIt is said: In the world, good people are few, while the unvirtuous are many. People today nitpick flaws, slandering and envying one another, unaware of their own faults yet eager to condemn others’ wrongs. Even if one performs a single good deed, they vie to slander it, unwilling to reform themselves and embrace goodness. Instead, they seek to corrupt the good to match their own wickedness, thus destroying the Dao and its dharma—all due to such people. The great and virtuous masters have strictly admonished this.\n\nThe regulations state: Stealing objects meant for sacred images is a sin equal to the ten evils. If one steals from another’s household, files a complaint along the way, and then takes the property for oneself, they will be subjected to the Eight Gates’ long trials, trapped for ten thousand kalpas without escape.\n\nThe regulations state: Stealing offerings from the ten directions meant for the assembly, or if one serves as the leader and privately takes them for oneself, they will fall into the Hell of Fire Pits, remaining for ten thousand kalpas before emerging, only to enter Fengdu for sixty years of trials, forever reborn as a hungry ghost.\n\nThe regulations state: Those with malicious speech and crimson tongues, forming gangs of wicked followers, should always be kept at a distance. If circumstances force an encounter, one must align words with the heart. Failure to do so will bring severe calamity.\n\nThe regulations state: For those who follow the Dao, any deficiency in demeanor constitutes a violation of the precepts. This is shown to you—may you understand and heed it carefully.\n\nThe Immortal Duke, having received the regulations, bows and retires.\n\n*The Dongxuan Lingbao Qianzhen Regulations conclude.*",
      "overlap_context": "he incantation: *\"Today is an auspicious day, fasting and facing the Supreme. The celestial kitchen serves the midday meal—may the host’s blessings be boundless.\"*\n\nThe regulations state: When offering the first portion to the former masters, recite the incantation: *\"Establishing the fast for the true Dao, for the seed of Dao, the father of Dao, the mother of Dao, the perfected, the divine, the immortals, the sages—or together for the Dao—may we share this meal and attain limitless longevity.\"*",
      "start_char": 11365,
      "end_char": 11855,
      "start_sentence": 458,
      "end_sentence": 482,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.219370603561401,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝千真科.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}