{
  "source_id": "洪恩灵济真君事实",
  "source_file": "chunked_daozang\\洪恩灵济真君事实.json",
  "total_chunks": 4,
  "total_original_chars": 3073,
  "total_translated_chars": 20889,
  "total_translation_time": 109.79914546012878,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君事实.txt",
    "category": "威仪类"
  },
  "full_translation": "**The Veritable Records of the Illustrious and Benevolent True Lords of Vast Grace**\n\n**Sutra Title:** *The Veritable Records of the Illustrious and Benevolent True Lords of Vast Grace*\nComposed by Zhu Di et al. One fascicle.\nSource text: *Daoist Canon of the Zhengtong Era*, Dongxuan Section, *Weiyi* Category.\n\n---\n\n**The Veritable Records of the Illustrious and Benevolent True Lords of Vast Grace**\n\n**Imperially Composed Stele Inscription for the Sacred Luminous Aid Palace**\n\nWe reflect that since ancient times, the eminent and worthy, while living, have served as illustrious ministers, their merits shading the people; in death, they become luminous spirits, aiding the transformations of Heaven and Earth. Their stirring and flowing presence moves between the two realms, shielding the people with blessings, warding off calamities, and repelling misfortune. They revive the withered and quicken the living, their radiance vast and boundless—ever above, ever beside—beyond the reach of human wit or conjecture.\n\nAs the *Book of Songs* says:\n*\"The advent of the spirits—unfathomable,\nhow could one dare slight them?\"*\nThis is precisely what it means.\n\nConsider the Great Immortal of the Golden Towers of the Nine Heavens, the Illustrious Dao-Attaining and Virtue-Manifesting, the Vastly Aiding and Universally Beneficent True Person, the Jiang King; and the Supreme Immortal of the Jade Towers of the Nine Heavens, the Proclaiming Transformation and Upholding Teachings, the Luminously Manifest and Broadly Beneficent True Person, the Rao King. Their virtue and power overflow, truly as described. Descendants of the Southern Tang, they rendered meritorious service to the people in life and, in death, were enrolled among the ranks of immortals. As elder and younger brothers, their excellence is matched, their glory intertwined. Entrusted with offices in the heavens, their numinous presence descends to the earth, their breath evoking swift responses—swift as lightning, fleet as the wind. The people shelter beneath them, relying on them as parents. Their compassion and benevolence bring peace to all things.\n\nRecently, when We fell ill and employed every remedy, yet found no relief, the spirits silently mobilized their essence and power, guarding and protecting Us. Never for a moment did they depart; every prayer was met with an answer. Repeatedly, they manifested clear signs, bestowing divine talismans and celestial medicines. Through their aid, what was perilous was restored to safety, what had fallen was raised again. Their power to revive life is vast and boundless in grace.\n\nWe, of shallow virtue, know not how We have merited such favor. The debt to their power lingers in Our heart—how could it ever be forgotten? Deep as the sea, towering as the mountains, it knows no end. That one must requite merit is an enduring principle of the state. Thus, We issue this proclamation, conferring upon them exalted titles:\n\nThe elder shall be called:\n**True Lord of Vast Grace, Protector of the State and Shelter of the People, the Pure and Subtle, Cavernous and Mysterious, Void and Wondrously Responsive, Compassionate and Benevolent;**\n\nThe younger shall be called:\n**True Lord of Vast Grace, Guardian of the State and Helper of the People, the Lofty and Illustrious, Vast and Tranquil, Void and Profound, Wondrously Responsive, Benevolent and Kind.**\n\nTheir former titles remain unchanged.\n\nWe have newly expanded their temple halls, making them bright and spacious, worthy of the spirits’ dwelling. We command the relevant officials to maintain reverent purity in their offerings, to perform seasonal sacrifices in spring and autumn, to renew their robes with the changing year, and to appoint five households for sweeping and upkeep. Thus do We express Our sincerity and seek blessings, repaying the spirits’ boundless favor.\n\nYet though the spirits’ merit is profound, Our recompense is meager. The spirits, of course, do not demand repayment—but in Our heart, the debt cannot be set aside.\n\nThe virtue of Heaven and Earth is life; the spirits embody the Dao of Heaven and Earth, assisting and illuminating the workings of transformation. Emerging from darkness into light, their presence expands and contracts in an instant. They roam the Great Purity, overseeing the four directions, aiding and benefiting all living beings. Their merit spans Heaven and Earth—so luminous, yet beyond all naming or description.\n\nThus do We make their achievements manifest, inscribing them upon enduring stone, erecting it in their temple to be transmitted for endless generations. We append this poem:\n\nHeaven bore these heroic spirits, paragons of the age,\nMoving between darkness and light as one.\nIn life, their meritorious toil secured the land;\nIn death, as luminous spirits, their glory stands sublime.\n\nVast the southern seas, beneath their sheltering shade,\nRain and shine, cold and heat, all are tempered and made right.\nNo winter’s biting frost, no summer’s scorching heat,\nThe miasmic vapors of the sands are stilled, no gales take flight.\n\nYear after year, the millet ripens high,\nBanishing ill omens, driving evil spirits away.\nMorning bells and evening drums gladden the aged,\nMajestic Ao Peak, steep and towering, holds sway.\n\nWinding and embracing, wrought by Heaven’s hand,\nSpring orchids offer fragrance, autumn chrysanthemums their scent.\nCold springs and white stones, pure and clear,\nThe spirits roam with feathered canopies grand.\n\nFleeting clouds drift, guiding banners and staffs,\nSwift they come, swift they go, their presence light.\nBreath and response, swift as verse,\nTheir aid and benefit boundless, ceaseless day and night.\n\nFour seasons’ offerings, rich and plentiful,\nTheir merit in guarding Us—who can compare?\nWe vow to engrave it upon heart and bone,\nInscribing their grace and virtue on steadfast stone.\n\nLet it stand for ten thousand ages, radiant as sun and moon.\n\nIn the fifteenth year of the Yongle reign, on the first day of the fifth month, *The Transmission of the Two Perfected Ones’ Ascension to Immortality*:\n\nXu Zhizheng descended from the lineage of King Yan of Xu. A man of Southern Tang during the Five Dynasties period, he and his younger brother Zhie were both of unparalleled heroism and brilliance. Benevolent and compassionate toward all things, loyal to their lord and filial to their parents, they revered the Three Treasures, shared a devotion to goodness, and diligently cultivated the supreme Dao. They performed purification rites and offered jiao sacrifices, daily reciting the *True Scripture of the Jade Emperor* and chanting the sacred names.\n\nBoth brothers served the state of Wu. Later, Zhizheng was enfeoffed as the Prince of Jiang, and Zhie as the Prince of Rao. Stationed in Jinling, they maintained vigilant defenses in war and governance, pacifying refugees and securing the allegiance of over twenty prefectures. The people were relieved of burdens, the army well-provisioned, and the tribes of the forests and caves adhered to the laws. The young and old rejoiced together, singing hand in hand. No grievances arose above, no enmities below. The people of Jiangnan relied entirely upon them for peace.\n\nLater, when ordered to lead troops against Min, fearing the suffering of the innocent, they made a solemn vow: every fifth watch, they faced north to worship the Dipper; their morning meals were always vegetarian. They prayed for the cessation of war, and wherever they went, they labored to comfort the people. The prefectures and counties, seeing their approach, surrendered their cities. Elders offered baskets of food and jars of wine, crowding the roads to welcome them.\n\nUpon reaching Xiajiang, several hundred deserters had taken refuge in the mountains to rebel. They immediately ordered the execution of the ringleaders. The remaining soldiers cast aside their armor, cheering and dancing, and were pacified without battle. The people lived in peace, their fields, gardens, and crops untouched. They conferred among themselves, saying, “These are the parents who have given us new life.” They erected a shrine on Ao Peak to worship them.\n\nBefore long, the brothers ascended to immortality in succession. They became the Superintendents of the Central Waters of the Dipper, entering and leaving the celestial palaces. Through accumulated merit and hidden aid to the people, they ensured that all fulfilled their duties of loyalty and filial piety and revered the Three Treasures.\n\nIn times of drought, when the people prayed at their shrine, the deep, unfathomable pool before it would suddenly yield a divine serpent, coiling upon the altar table, its color like cinnabar. It would rise from the pool’s surface, remaining all day before withdrawing. The next dawn, rain would fall, and the year would yield a bountiful harvest.\n\nOne day, the torrential rains of Yanxi swelled violently, submerging fields and crops. The people, panic-stricken, suddenly beheld thousands of laborers wielding baskets and shovels, dredging the sources and diverting the flows. The waters ceased to harm the people, and the laborers vanished—these were divine soldiers.\n\nThe rapids of Cangxia were treacherous, and boats ascending or descending often lost control. When boatmen cried out in prayer, they perceived a faint yellow banner in the clouds, and the peril immediately subsided.\n\nWhenever households were careless with fire or locusts threatened the crops, the people invoked their aid, and the winds would shift to extinguish the flames or drive the locusts away. They also distributed talismans and medicines to the people. Those afflicted with illness who consumed them recovered immediately, and those who sought offspring found their descendants flourishing.\n\nThus, the people lived in peace, the land prospered, and the countryside remained tranquil.\n\nLiu Yi of Min, serving as governor of Guizhou and Jiaozhi, faced barbarian rebels invading the border and seizing Qin and Lian prefectures. Overwhelmed with fear, he fasted and prayed in silence, and the rebels indeed dispersed.\n\nLater, when Han Shizhong fought at Dayi Garrison and Wu Jie at Heshang Plain, the brothers dispatched divine soldiers to defend the nation, manifesting the numinous power of the grasses and trees of Mount Bagong. From afar, the enemy saw banners and standards fluttering, a million iron-clad cavalry filling the valleys, their formations disciplined, the sound of gongs and drums shaking the plains. Before battle was joined, the enemy had already fled in defeat.\n\nTheir divine traces and wondrous deeds are too numerous to recount in full.\n\nOne day, during the offering of the Yellow Register Fast, celestial music suddenly resounded in the sky, auspicious clouds encircled the distance, and an entourage of immortals appeared in magnificent array. Moved by their devotion, the Heavenly Emperor dispatched a divine messenger to proclaim the edict:\n\nThe Prince of Jiang was enfeoffed as the *Great Immortal of the Nine Heavens’ Golden Gate, Illuminator of the Dao, Attainer of Virtue, Manifestly Numinous and Universally Beneficent Perfected One*, charged with overseeing the Celestial Bureau of Astronomy, empowered to act at his discretion, and to correspond with the Ministry of Literature and the Celestial Office of Mysteries.\n\nHis wife, Lady Xu, the Princess of Jing, was enfeoffed as the *Immortal Maiden of Benevolence and Kindness, Assistant to the Dao*, concurrently overseeing the Right Bureau of Longevity of the Great Unity.\n\nThe Prince of Rao was enfeoffed as the *Supreme Immortal of the Nine Heavens’ Jade Gate, Propagator of Transformation and Protector of the Teachings, Illustriously Numinous and Vastly Beneficent Perfected One*, charged with overseeing all bureaus of the Lower Realm’s Earthly Prison, empowered to act at his discretion, and to correspond with the Ministry of Longevity of the Southern Culmen and the Celestial Office of Thunder and Mystery.\n\nHis wife, Lady Tao, the Princess of Wei, was enfeoffed as the *Immortal Maiden of Compassion and Grace, Assistant to the Dao*, concurrently overseeing the Northern Bureau of Life Registration of the Primordial Emperor.\n\nTheir father was enfeoffed as the *Perfected One of Loyal Valor*, and their mother as the *Immortal Consort of Benevolent Longevity*.\n\nRecently, when We fell gravely ill, through the silent operation of their transformative power, they manifested great numinous favor, guarding Us at every moment. They bestowed divine talismans and celestial medicines, and with every invocation, efficacy followed instantly, their responses as swift as an echo. Our debilitated body, once in peril, was restored to health; our chronic ailments were entirely dispelled, returning Us to Our former state. Their power to turn the tide was as if granting Us new life. The grace of the spirits is engraved in Our heart, never to be forgotten.\n\nThus, by this decree of invocation, We confer upon the elder brother the title of *Perfected Lord of Vast Grace, Protector of the State and Shelterer of the People, of the Pure Subtlety, Cavernous Mystery, Tranquil Emptiness, and Wondrous Response*—the *True Lord of Overflowing Kindness*; upon the Lady of Jing State, the additional title of *Perfected Consort of Steadfast Response*; upon the second brother, the title of *Perfected Lord of Lofty Brilliance, Vast Serenity, Profound Stillness, and Wondrous Response, of Benevolent Kindness, Assistant to the State and Guardian of the People*—the *True Lord of Overflowing Grace*; upon the Lady of Wei State, the additional title of *Perfected Consort of Reverent Stillness*. Their divine father is hereby titled *Perfected Lord of Illustrious Support*, and their divine mother *Perfected Consort of Refined Goodness*. All former designations shall remain as before.\n\nNew temples shall be erected in the lands of Min, and a traveling shrine shall be established in the capital to provide a dwelling for the spirits. Let the relevant offices be commanded to reverently conduct the sacrifices.\n\nFor those ministers whose merit extends to the altars of state and whose beneficence spreads over the people, they must become heroes in life and luminous spirits in death. Even a hundred generations hence, they shall bless the living and subtly assist the transforming influence of the throne. Consider Zhi Zheng and Zhi E: born of noble lineage, they served their lord in a declining age, yet were able to pacify turmoil in a region and preserve its people. When they marched into Min, they entered the land with banners furled, first eliminating the rebel troops, delivering the people from the horrors of war, and placing them in the safety of their own homes. Thus, the hearts of the people were moved with gratitude, unable to fully repay their debt, and so they erected living shrines to honor them. After their ascension as immortals, they warded off great disasters and defended against grave perils, sparing the people from the fears of famine and pestilence, granting them the joy of rest and renewal. Their merit complete and conduct fulfilled, they moved the heart of Heaven, which bestowed upon them the title of *Perfected One* and ranked them among the celestial immortals.\n\nRecently, through the silent operation of their transformative power, they have manifested great numinous favor, healing Our afflictions. Thus, We now augment their honorific titles, renew their temples, and reverently offer sacrifices to requite their divine grace. All this is the result of their accumulated hidden merits, and so their glory shines eternally, enduring as long as Heaven and Earth. How could this be mere chance?\n\nThe odes declare:\n*To serve one’s parents with utmost filiality, one’s lord with loyalty—*\n*Who can match the fragrant blossoms of this illustrious pair?*\n*With diligence, they cultivated the supreme Dao,*\n*And were enfeoffed with lands by royal decree.*\n\nAnd again:\n*In those years, they stationed their troops at Jinling,*\n*And the vast lands south of the river knew no war.*\n*When their army entered the seven Min lands, the people lived in peace,*\n*How much blessing and grace did they bestow upon the living!*\n\nAnd again:\n*In drought, the sacred pool brought forth the coiled dragon,*\n*And great rains poured forth, ensuring a bountiful year.*\n*The waters of Yan Brook receded, sparing the people from harm,*\n*While the perilous gorges of Cangxia became passable for ships.*\n\nAnd again:\n*Locusts did not harm the crops, nor fire pass beyond its bounds,*\n*The fields and wilds alike were blanketed in their abundant grace.*\n*They distributed divine talismans to multiply descendants,*\n*And cured grave illnesses, restoring the stricken to health.*\n\nAnd again:\n*In Gui Prefecture, they displayed their power to repel the barbarian raiders,*\n*Working wonders as at the Eight Lords’ Mountain.*\n*A million divine soldiers filled the valleys,*\n*And in an instant, the siege was lifted.*\n\nAnd again:\n*Divine talismans and wondrous medicines issued from the Celestial Physicians,*\n*Guarding Our humble person without a moment’s absence.*\n*Their power to heal is beyond repayment,*\n*Yet the gratitude for this new life is known in Our heart.*\n\nAnd again:\n*Responding to every invocation without delay,*\n*Their transformative power aligns with the workings of creation.*\n*Riding the qi and mounting the wind, they roam the eight directions,*\n*Descending from the celestial palaces to manifest their numinous might.*\n\nAnd again:\n*In life, they were famed generals, achieving great merit,*\n*Their conduct fulfilled, they ascended as immortals—such is the reward of virtue.*\n*In the capital’s Ao Peak, their temple shall forever receive offerings,*\n*As their names, inscribed in cinnabar, attest to their celestial perfection.*\n\nAnd again:\n*Their majestic power, resplendent and boundless,*\n*Shines ever brighter in their protection of the state and peace for the people.*\n*Not only is their fame as bright as the sun and moon,*\n*But it shall endure as long as Heaven and Earth.*\n\n*Memorial for the Conferral of Titles upon the Perfected Lords*\n\nMemorial from Your Servant Wang, Attendant of the Golden Portal, Practitioner of the Ninefold Numinous Flying Steps, and Controller of Thunder and Lightning:\n\nI humbly submit that the Dao resides in the beginningless boundlessness, profound and obscure, beyond recognition or knowledge, unattainable by the reckonings of heart or mind. Only after the Heavenly Perfected Sovereign inscribed the sacred texts with his purple brush did those who study the Dao gain the means to fathom its source and channel its flow, compiling its statutes and numinous writings.\n\nIn this age, there exists a divine being who cultivates merit through fasting and precepts, vows to deliver the dead and save the living, and composes texts that align with the sacred statutes. All who are of exceptional talent and refined character recite them with one voice—surely their merit is manifest and their renown resounds.\n\nI have observed the Nine Heavens’ Golden Portal Perfected Xu Zhizheng and the Nine Heavens’ Jade Portal Perfected Xu Zhie, whose names crown the age and whose virtue abides among the people. Examining their conduct within and their deeds without, they are indeed those whose very bones align with immortality, whose hearts accumulate goodness and build merit, and who steadfastly cherish the Three Treasures. If not for those blessed by karmic destiny who exhaust the divine to comprehend transformation, who could achieve such? Their works include the *Ninefold Perfected Wondrous Precepts of Transformative Texts*, the *Nine Marchmounts’ Spirit Lamps Statutes*, and the *Three Realms’ Protective Horse Statutes*—all derived from the Supreme’s mysterious words, delving into subtleties and extracting truth, naturally forming chapters of numinous resonance. These may serve as a bridge across the vast kalpas, for those who \"build carts behind closed doors\" reckon not the passage of years.\n\nBeyond these, there are the *Numinous Aid Ritual Statutes*, the *Original Vow Ritual Texts*, and the *Seven Governors’ Lamp Statutes*—composed not out of presumption of personal merit, but in response to the people’s entreaties.\n\nMy nature is crude and my understanding shallow; my words are of little weight. Yet, having examined their deeds and assessed their abilities, I petition to supplement their duties and elevate their immortal ranks. I now beseech Your Sagely Compassion to approve this memorial and promulgate the statutes compiled by Xu Zhizheng and others across the Three Realms, where all may adhere to and implement them accordingly. This will not only manifest the boundless merit of numinous aid but also strengthen our ranks and fulfill the people’s hopes.\n\nI prostrate myself in await of Your decree.\n\n*Record of the Facts of the Numinous Aid Perfected Lord concludes.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洪恩灵济真君事实 经名：洪恩灵济真君事实。 朱棣等撰。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 洪恩灵济真君事实 御制灵济宫碑 朕惟自古英贤，生为名臣，着芘民之功，没为明神，赞天地之化。 鼓动流荡，行乎两间，以荫福斯民，御灾捍患。 欨枯吹生，濯濯洋洋，如在其上，如在其左右者，非智虑所可得而测也。 《诗》曰：神之格思，不可度思，矧可射思。 其此之谓欤。 惟九天金阙明道达德大仙显灵溥济真人江王，九天玉阙宣化扶教上仙昭灵博济真人饶王，其功德充溢，盖若是已。 神南唐之冑，生有民社之勋，没录仙班之籍，伯仲齐美，华萼联芳。 领职上天，惧灵下土，呼吸感应，电迈风行。 下民是冒，父母其依，慈祥仁爱，物赖以宁。 乃者，朕躬弗豫，用药百计，罔底于效？ 神默运精灵，翊卫朕躬，顷刻弗违，随叩随应，屡显明征，施以灵符，天医妙药，使殆而复安，仆而复起，有回生之功，恩惠博矣盛矣。 朕揆德凉薄，何由获兹，永怀神德，曷其能忘，海深岳峻，其焉有极。 盖有功必报，国之恒典，是用祝册，加封神号。 伯曰清微洞玄冲虚妙感慈惠护国庇民洪恩真君，仲曰高明弘静冲湛妙应仁惠辅国佑民洪恩真君，旧号俱如故。 大新庙宇，亢爽轩豁，称神所栖。 爰勅有司，虔洁香火，春秋祭祀，岁易时衣，给洒扫五户，表朕悃福，答神鸿休。 虽然神功之厚，而报赉之薄，神固无责於报否，在朕心有不能已矣。 夫天地之德曰生，神体天地之道，弼亮化机，出幽入明，翕张欻忽，遨游太清，监观四方，济利群生，功在霄壤。 昭昭若此，固有不可得而名言者。 乃彰神绩，勒于贞石，树之于庙，垂示无穷，并系以诗曰： 天产英灵为世杰，出入幽明犹一覕。 生着勋劳保瓯粤，没为明神崇伟烈。 芒芒海甸倚芘樾，雨旸寒燠调以制。 冬无凌兢夏无暍，沙气远珍靡飓颲。 下徐高黍岁禳桀，驱拂不祥走祆(薛十虫)。 晨锺暮鼓乐奢耋，卓彼鳌峰峻且巀。 蜿蜓回抱天造设，春兰荐芳秋鞠馝。 寒泉白石漱清洁，神之游兮羽葆翳。 飞云翩翩导幢节，欻来忽往灵僁僁。 呼吸响应速以偈，济利溥博无时(忄十局)四时报享繁献醊，卫朕之功畴与埒。 惟矢铭心与刻骨，书恩着德勒坚碣。 垂示万古昭日月。",
      "translated_text": "**The Veritable Records of the Illustrious and Benevolent True Lords of Vast Grace**\n\n**Sutra Title:** *The Veritable Records of the Illustrious and Benevolent True Lords of Vast Grace*\nComposed by Zhu Di et al. One fascicle.\nSource text: *Daoist Canon of the Zhengtong Era*, Dongxuan Section, *Weiyi* Category.\n\n---\n\n**The Veritable Records of the Illustrious and Benevolent True Lords of Vast Grace**\n\n**Imperially Composed Stele Inscription for the Sacred Luminous Aid Palace**\n\nWe reflect that since ancient times, the eminent and worthy, while living, have served as illustrious ministers, their merits shading the people; in death, they become luminous spirits, aiding the transformations of Heaven and Earth. Their stirring and flowing presence moves between the two realms, shielding the people with blessings, warding off calamities, and repelling misfortune. They revive the withered and quicken the living, their radiance vast and boundless—ever above, ever beside—beyond the reach of human wit or conjecture.\n\nAs the *Book of Songs* says:\n*\"The advent of the spirits—unfathomable,\nhow could one dare slight them?\"*\nThis is precisely what it means.\n\nConsider the Great Immortal of the Golden Towers of the Nine Heavens, the Illustrious Dao-Attaining and Virtue-Manifesting, the Vastly Aiding and Universally Beneficent True Person, the Jiang King; and the Supreme Immortal of the Jade Towers of the Nine Heavens, the Proclaiming Transformation and Upholding Teachings, the Luminously Manifest and Broadly Beneficent True Person, the Rao King. Their virtue and power overflow, truly as described. Descendants of the Southern Tang, they rendered meritorious service to the people in life and, in death, were enrolled among the ranks of immortals. As elder and younger brothers, their excellence is matched, their glory intertwined. Entrusted with offices in the heavens, their numinous presence descends to the earth, their breath evoking swift responses—swift as lightning, fleet as the wind. The people shelter beneath them, relying on them as parents. Their compassion and benevolence bring peace to all things.\n\nRecently, when We fell ill and employed every remedy, yet found no relief, the spirits silently mobilized their essence and power, guarding and protecting Us. Never for a moment did they depart; every prayer was met with an answer. Repeatedly, they manifested clear signs, bestowing divine talismans and celestial medicines. Through their aid, what was perilous was restored to safety, what had fallen was raised again. Their power to revive life is vast and boundless in grace.\n\nWe, of shallow virtue, know not how We have merited such favor. The debt to their power lingers in Our heart—how could it ever be forgotten? Deep as the sea, towering as the mountains, it knows no end. That one must requite merit is an enduring principle of the state. Thus, We issue this proclamation, conferring upon them exalted titles:\n\nThe elder shall be called:\n**True Lord of Vast Grace, Protector of the State and Shelter of the People, the Pure and Subtle, Cavernous and Mysterious, Void and Wondrously Responsive, Compassionate and Benevolent;**\n\nThe younger shall be called:\n**True Lord of Vast Grace, Guardian of the State and Helper of the People, the Lofty and Illustrious, Vast and Tranquil, Void and Profound, Wondrously Responsive, Benevolent and Kind.**\n\nTheir former titles remain unchanged.\n\nWe have newly expanded their temple halls, making them bright and spacious, worthy of the spirits’ dwelling. We command the relevant officials to maintain reverent purity in their offerings, to perform seasonal sacrifices in spring and autumn, to renew their robes with the changing year, and to appoint five households for sweeping and upkeep. Thus do We express Our sincerity and seek blessings, repaying the spirits’ boundless favor.\n\nYet though the spirits’ merit is profound, Our recompense is meager. The spirits, of course, do not demand repayment—but in Our heart, the debt cannot be set aside.\n\nThe virtue of Heaven and Earth is life; the spirits embody the Dao of Heaven and Earth, assisting and illuminating the workings of transformation. Emerging from darkness into light, their presence expands and contracts in an instant. They roam the Great Purity, overseeing the four directions, aiding and benefiting all living beings. Their merit spans Heaven and Earth—so luminous, yet beyond all naming or description.\n\nThus do We make their achievements manifest, inscribing them upon enduring stone, erecting it in their temple to be transmitted for endless generations. We append this poem:\n\nHeaven bore these heroic spirits, paragons of the age,\nMoving between darkness and light as one.\nIn life, their meritorious toil secured the land;\nIn death, as luminous spirits, their glory stands sublime.\n\nVast the southern seas, beneath their sheltering shade,\nRain and shine, cold and heat, all are tempered and made right.\nNo winter’s biting frost, no summer’s scorching heat,\nThe miasmic vapors of the sands are stilled, no gales take flight.\n\nYear after year, the millet ripens high,\nBanishing ill omens, driving evil spirits away.\nMorning bells and evening drums gladden the aged,\nMajestic Ao Peak, steep and towering, holds sway.\n\nWinding and embracing, wrought by Heaven’s hand,\nSpring orchids offer fragrance, autumn chrysanthemums their scent.\nCold springs and white stones, pure and clear,\nThe spirits roam with feathered canopies grand.\n\nFleeting clouds drift, guiding banners and staffs,\nSwift they come, swift they go, their presence light.\nBreath and response, swift as verse,\nTheir aid and benefit boundless, ceaseless day and night.\n\nFour seasons’ offerings, rich and plentiful,\nTheir merit in guarding Us—who can compare?\nWe vow to engrave it upon heart and bone,\nInscribing their grace and virtue on steadfast stone.\n\nLet it stand for ten thousand ages, radiant as sun and moon.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 860,
      "start_sentence": 0,
      "end_sentence": 38,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.51034617424011,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君事实.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "永乐十五年五月初一日 二真成仙传 徐知证系出偃王之后，五代时南唐人，与其弟知谔，并英迈绝伦，宽仁爱物，忠君孝亲，崇信三宝，同心好善，精勤至道，修斋设醮，日常持诵玉皇真经并宝号。 兄弟俱事吴，其后知证封江王，知谔封饶王，镇金陵，战守有备，抚辑流亡？ 控扼二十余州，氓征就宽，军给以饶，林蛮洞蜑，守条死要，稚耋嬉游，连手歌讴，上无所怨，下无所雠，江南之民，举赖以安。 后奉命帅师攻闽，恐良善荼毒，乃发至愿，每五更望北拜斗，早膳恒素食，祈珍兵革，所至劳来。 百姓诸郡，望风以城降，父老箪食壶浆，拥道迎之。 次峡江，有溃卒数百，阻山为乱，立命歼其渠魁，余卒弃甲呼舞，不战而收。 民皆安堵，虽田园蔬稻，一无所犯，乃相谋曰：此吾复生之父母也。 立祠於鳌峰以祀之。 未几，兄弟相继仙去，遂为斗中都水使者，出入天宫，积行累功，默佑下民。 俾人皆尽忠行孝，崇信三宝。 遇岁旱，民祷祠下，祠前潭水深不可测，俄有灵蛇出，蜿蜓于几案间，色如丹砂，蕾买起潭面，竟日不收，诘旦果雨，岁大熟。 一日，演溪霖潦暴溢，田稼垫溺，众方狼顾失色，忽见有役夫千群，竞操畚锸，疏其源，决其流，水竟不为民害，已而俱失所在，乃神兵也。 沧峡滩石峻脸，舟船上下失势，水工叫呼祈佑，感云中有黄旗隐隐，即帖然无虞。 凡民居有不戒于火者，有蝗蝝伤其稼者，叩之，则反风灭火蝗辄飞去。 又为符药以施人，凡婴疾弗愈者服之，无不立效，祈子息者服之，即得嗣续蕃昌。 由是民安物阜，田里晏然。 闽人刘彝守桂州交址，蛮贼寇边，陷钦连等州。 彝震惧，莫知所为，斋戒默祷，贼果溃去。 其后韩世忠战大仪镇，吴玠战和尚原，俱遣将士卫国，效八公山草木之灵，使敌遥见旗纛旌麾飞扬，山谷铁骑百万，行阵严肃，钲鼓之声震动原野，不待交兵，而已败北。 灵迹显异，不可备述。 一日，黄箓斋进，忽闻天乐呜空，祥云环远，仙官导从，甚都乃感，天帝遣神人颁诰：封江王为九天金阙明道达德大仙显灵溥济真人，主管上清天文院，便宜行事，行文昌司禄上宰会书天机省事。 妻泾国夫人许氏，顺助仁惠仙姑，兼管太乙延生右真司事。 饶王为九天玉阙宣化扶教上仙昭灵博济真人，主管下元地府诸司，便宜行事，权南极注生上相会书雷霆玄省事。 妻卫国夫人陶氏，善助慈懿仙姑，兼管元皇北阴注生司事。 仍封父忠武真人，母仁寿仙妃。 比者，朕躬遘疾，默运化机，大阐灵贶，翊卫左右，顷刻不离，施以灵符，济以天医妙药，随言随效，感应如响。 使困敝之体，既危而即安。 沉痼之疾，尽脱而复旧。 斡旋之力，同於更生。 感神之惠，铭刻不忘。",
      "translated_text": "In the fifteenth year of the Yongle reign, on the first day of the fifth month, *The Transmission of the Two Perfected Ones’ Ascension to Immortality*:\n\nXu Zhizheng descended from the lineage of King Yan of Xu. A man of Southern Tang during the Five Dynasties period, he and his younger brother Zhie were both of unparalleled heroism and brilliance. Benevolent and compassionate toward all things, loyal to their lord and filial to their parents, they revered the Three Treasures, shared a devotion to goodness, and diligently cultivated the supreme Dao. They performed purification rites and offered jiao sacrifices, daily reciting the *True Scripture of the Jade Emperor* and chanting the sacred names.\n\nBoth brothers served the state of Wu. Later, Zhizheng was enfeoffed as the Prince of Jiang, and Zhie as the Prince of Rao. Stationed in Jinling, they maintained vigilant defenses in war and governance, pacifying refugees and securing the allegiance of over twenty prefectures. The people were relieved of burdens, the army well-provisioned, and the tribes of the forests and caves adhered to the laws. The young and old rejoiced together, singing hand in hand. No grievances arose above, no enmities below. The people of Jiangnan relied entirely upon them for peace.\n\nLater, when ordered to lead troops against Min, fearing the suffering of the innocent, they made a solemn vow: every fifth watch, they faced north to worship the Dipper; their morning meals were always vegetarian. They prayed for the cessation of war, and wherever they went, they labored to comfort the people. The prefectures and counties, seeing their approach, surrendered their cities. Elders offered baskets of food and jars of wine, crowding the roads to welcome them.\n\nUpon reaching Xiajiang, several hundred deserters had taken refuge in the mountains to rebel. They immediately ordered the execution of the ringleaders. The remaining soldiers cast aside their armor, cheering and dancing, and were pacified without battle. The people lived in peace, their fields, gardens, and crops untouched. They conferred among themselves, saying, “These are the parents who have given us new life.” They erected a shrine on Ao Peak to worship them.\n\nBefore long, the brothers ascended to immortality in succession. They became the Superintendents of the Central Waters of the Dipper, entering and leaving the celestial palaces. Through accumulated merit and hidden aid to the people, they ensured that all fulfilled their duties of loyalty and filial piety and revered the Three Treasures.\n\nIn times of drought, when the people prayed at their shrine, the deep, unfathomable pool before it would suddenly yield a divine serpent, coiling upon the altar table, its color like cinnabar. It would rise from the pool’s surface, remaining all day before withdrawing. The next dawn, rain would fall, and the year would yield a bountiful harvest.\n\nOne day, the torrential rains of Yanxi swelled violently, submerging fields and crops. The people, panic-stricken, suddenly beheld thousands of laborers wielding baskets and shovels, dredging the sources and diverting the flows. The waters ceased to harm the people, and the laborers vanished—these were divine soldiers.\n\nThe rapids of Cangxia were treacherous, and boats ascending or descending often lost control. When boatmen cried out in prayer, they perceived a faint yellow banner in the clouds, and the peril immediately subsided.\n\nWhenever households were careless with fire or locusts threatened the crops, the people invoked their aid, and the winds would shift to extinguish the flames or drive the locusts away. They also distributed talismans and medicines to the people. Those afflicted with illness who consumed them recovered immediately, and those who sought offspring found their descendants flourishing.\n\nThus, the people lived in peace, the land prospered, and the countryside remained tranquil.\n\nLiu Yi of Min, serving as governor of Guizhou and Jiaozhi, faced barbarian rebels invading the border and seizing Qin and Lian prefectures. Overwhelmed with fear, he fasted and prayed in silence, and the rebels indeed dispersed.\n\nLater, when Han Shizhong fought at Dayi Garrison and Wu Jie at Heshang Plain, the brothers dispatched divine soldiers to defend the nation, manifesting the numinous power of the grasses and trees of Mount Bagong. From afar, the enemy saw banners and standards fluttering, a million iron-clad cavalry filling the valleys, their formations disciplined, the sound of gongs and drums shaking the plains. Before battle was joined, the enemy had already fled in defeat.\n\nTheir divine traces and wondrous deeds are too numerous to recount in full.\n\nOne day, during the offering of the Yellow Register Fast, celestial music suddenly resounded in the sky, auspicious clouds encircled the distance, and an entourage of immortals appeared in magnificent array. Moved by their devotion, the Heavenly Emperor dispatched a divine messenger to proclaim the edict:\n\nThe Prince of Jiang was enfeoffed as the *Great Immortal of the Nine Heavens’ Golden Gate, Illuminator of the Dao, Attainer of Virtue, Manifestly Numinous and Universally Beneficent Perfected One*, charged with overseeing the Celestial Bureau of Astronomy, empowered to act at his discretion, and to correspond with the Ministry of Literature and the Celestial Office of Mysteries.\n\nHis wife, Lady Xu, the Princess of Jing, was enfeoffed as the *Immortal Maiden of Benevolence and Kindness, Assistant to the Dao*, concurrently overseeing the Right Bureau of Longevity of the Great Unity.\n\nThe Prince of Rao was enfeoffed as the *Supreme Immortal of the Nine Heavens’ Jade Gate, Propagator of Transformation and Protector of the Teachings, Illustriously Numinous and Vastly Beneficent Perfected One*, charged with overseeing all bureaus of the Lower Realm’s Earthly Prison, empowered to act at his discretion, and to correspond with the Ministry of Longevity of the Southern Culmen and the Celestial Office of Thunder and Mystery.\n\nHis wife, Lady Tao, the Princess of Wei, was enfeoffed as the *Immortal Maiden of Compassion and Grace, Assistant to the Dao*, concurrently overseeing the Northern Bureau of Life Registration of the Primordial Emperor.\n\nTheir father was enfeoffed as the *Perfected One of Loyal Valor*, and their mother as the *Immortal Consort of Benevolent Longevity*.\n\nRecently, when We fell gravely ill, through the silent operation of their transformative power, they manifested great numinous favor, guarding Us at every moment. They bestowed divine talismans and celestial medicines, and with every invocation, efficacy followed instantly, their responses as swift as an echo. Our debilitated body, once in peril, was restored to health; our chronic ailments were entirely dispelled, returning Us to Our former state. Their power to turn the tide was as if granting Us new life. The grace of the spirits is engraved in Our heart, never to be forgotten.",
      "overlap_context": "ar,\nThe spirits roam with feathered canopies grand.\n\nFleeting clouds drift, guiding banners and staffs,\nSwift they come, swift they go, their presence light.\nBreath and response, swift as verse,\nTheir aid and benefit boundless, ceaseless day and night.\n\nFour seasons’ offerings, rich and plentiful,\nTheir merit in guarding Us—who can compare?\nWe vow to engrave it upon heart and bone,\nInscribing their grace and virtue on steadfast stone.\n\nLet it stand for ten thousand ages, radiant as sun and moon.",
      "start_char": 861,
      "end_char": 1893,
      "start_sentence": 39,
      "end_sentence": 70,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.50492811203003,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君事实.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "是用祝册，加封伯曰清微洞玄冲虚妙感慈惠护国庇民洪恩真君，泾国夫人加封贞应仙妃，仲曰高明弘静冲湛妙应仁惠辅国佑民洪恩真君，卫国夫人加封恭静仙妃，神父曰翊亮真君，神母曰淑善仙妃，旧号俱如故。 大新闽地祠宇，又於京都建立行祠以安神栖。 特动所司，严奉祀焉。 夫为人臣，而功施社稷泽被生民者，必生为英杰，死为明神，虽百世之下，福佑生灵，阴翊皇化。 观知证、知谔，以世冑之裔，事主季世，乃能靖难一方，保全其民，既攻闽中，按甲入境，首除乱兵，脱民锋镝之惨，措之衽席之安，是以人心感激，靡克报称，乃立生祠以杞之。 逮其仙去，御大灾，捍大患，使民无凶荒疵疠之忧，遂休养生息之乐，功成行满，上感天心，锡号真人，叙列仙品。 比者，斡运化机，大阐灵贶，愈疾朕躬，是用加以徽号，新其祠宇，虔奉享祀，以答神休，斯皆累积阴功之所致，故昭昭不朽，与天地相为悠久，夫岂偶然而已哉。 诗曰 事亲尽孝事君忠，华萼联芳孰与同。 更复精勤修至道，并分茅土受王封。 又 当年驻节向金陵，万里江南不识兵。 师入七闽人按堵，几多福泽在生灵。 又 岁旱灵潭起垫龙，大施霖雨作年丰。 演溪水落民无患，沧峡舟船险更通。 又 蝗无伤稼火无过，田野均蒙惠泽多。 徧给灵符蕃子息，更能愈疾起沈痾。 又 桂郡扬灵却寇蛮，现奇更效八公山。 神兵百万填山谷，顿解重围顷刻间。 又 灵符妙药出天医，翊卫微躬不暂离。 起疾神功难报称，再生感惠此心知。 又 随声应感不移时，斡运功参造化机。 驭气乘风游八极，天宫陆降阐灵威。 又 生为名将建高勋，行满成仙福有因。 京国鳌峰长庙食，丹书锡号证天真。 又 威灵濯濯更洋洋，卫国安民绩愈彰。 不独声名昭日月，永同地久与天长。 保奏真君文",
      "translated_text": "Thus, by this decree of invocation, We confer upon the elder brother the title of *Perfected Lord of Vast Grace, Protector of the State and Shelterer of the People, of the Pure Subtlety, Cavernous Mystery, Tranquil Emptiness, and Wondrous Response*—the *True Lord of Overflowing Kindness*; upon the Lady of Jing State, the additional title of *Perfected Consort of Steadfast Response*; upon the second brother, the title of *Perfected Lord of Lofty Brilliance, Vast Serenity, Profound Stillness, and Wondrous Response, of Benevolent Kindness, Assistant to the State and Guardian of the People*—the *True Lord of Overflowing Grace*; upon the Lady of Wei State, the additional title of *Perfected Consort of Reverent Stillness*. Their divine father is hereby titled *Perfected Lord of Illustrious Support*, and their divine mother *Perfected Consort of Refined Goodness*. All former designations shall remain as before.\n\nNew temples shall be erected in the lands of Min, and a traveling shrine shall be established in the capital to provide a dwelling for the spirits. Let the relevant offices be commanded to reverently conduct the sacrifices.\n\nFor those ministers whose merit extends to the altars of state and whose beneficence spreads over the people, they must become heroes in life and luminous spirits in death. Even a hundred generations hence, they shall bless the living and subtly assist the transforming influence of the throne. Consider Zhi Zheng and Zhi E: born of noble lineage, they served their lord in a declining age, yet were able to pacify turmoil in a region and preserve its people. When they marched into Min, they entered the land with banners furled, first eliminating the rebel troops, delivering the people from the horrors of war, and placing them in the safety of their own homes. Thus, the hearts of the people were moved with gratitude, unable to fully repay their debt, and so they erected living shrines to honor them. After their ascension as immortals, they warded off great disasters and defended against grave perils, sparing the people from the fears of famine and pestilence, granting them the joy of rest and renewal. Their merit complete and conduct fulfilled, they moved the heart of Heaven, which bestowed upon them the title of *Perfected One* and ranked them among the celestial immortals.\n\nRecently, through the silent operation of their transformative power, they have manifested great numinous favor, healing Our afflictions. Thus, We now augment their honorific titles, renew their temples, and reverently offer sacrifices to requite their divine grace. All this is the result of their accumulated hidden merits, and so their glory shines eternally, enduring as long as Heaven and Earth. How could this be mere chance?\n\nThe odes declare:\n*To serve one’s parents with utmost filiality, one’s lord with loyalty—*\n*Who can match the fragrant blossoms of this illustrious pair?*\n*With diligence, they cultivated the supreme Dao,*\n*And were enfeoffed with lands by royal decree.*\n\nAnd again:\n*In those years, they stationed their troops at Jinling,*\n*And the vast lands south of the river knew no war.*\n*When their army entered the seven Min lands, the people lived in peace,*\n*How much blessing and grace did they bestow upon the living!*\n\nAnd again:\n*In drought, the sacred pool brought forth the coiled dragon,*\n*And great rains poured forth, ensuring a bountiful year.*\n*The waters of Yan Brook receded, sparing the people from harm,*\n*While the perilous gorges of Cangxia became passable for ships.*\n\nAnd again:\n*Locusts did not harm the crops, nor fire pass beyond its bounds,*\n*The fields and wilds alike were blanketed in their abundant grace.*\n*They distributed divine talismans to multiply descendants,*\n*And cured grave illnesses, restoring the stricken to health.*\n\nAnd again:\n*In Gui Prefecture, they displayed their power to repel the barbarian raiders,*\n*Working wonders as at the Eight Lords’ Mountain.*\n*A million divine soldiers filled the valleys,*\n*And in an instant, the siege was lifted.*\n\nAnd again:\n*Divine talismans and wondrous medicines issued from the Celestial Physicians,*\n*Guarding Our humble person without a moment’s absence.*\n*Their power to heal is beyond repayment,*\n*Yet the gratitude for this new life is known in Our heart.*\n\nAnd again:\n*Responding to every invocation without delay,*\n*Their transformative power aligns with the workings of creation.*\n*Riding the qi and mounting the wind, they roam the eight directions,*\n*Descending from the celestial palaces to manifest their numinous might.*\n\nAnd again:\n*In life, they were famed generals, achieving great merit,*\n*Their conduct fulfilled, they ascended as immortals—such is the reward of virtue.*\n*In the capital’s Ao Peak, their temple shall forever receive offerings,*\n*As their names, inscribed in cinnabar, attest to their celestial perfection.*\n\nAnd again:\n*Their majestic power, resplendent and boundless,*\n*Shines ever brighter in their protection of the state and peace for the people.*\n*Not only is their fame as bright as the sun and moon,*\n*But it shall endure as long as Heaven and Earth.*\n\n*Memorial for the Conferral of Titles upon the Perfected Lords*",
      "overlap_context": "e power, they manifested great numinous favor, guarding Us at every moment. They bestowed divine talismans and celestial medicines, and with every invocation, efficacy followed instantly, their responses as swift as an echo. Our debilitated body, once in peril, was restored to health; our chronic ailments were entirely dispelled, returning Us to Our former state. Their power to turn the tide was as if granting Us new life. The grace of the spirits is engraved in Our heart, never to be forgotten.",
      "start_char": 1893,
      "end_char": 2652,
      "start_sentence": 71,
      "end_sentence": 105,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.946999311447144,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君事实.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "金阙侍中行九灵飞步章奏节制雷霆臣王谨奏：臣切谓道在无极之始，冥冥杳杳，不识不知，非心思计虑之所能也。 自天真皇人紫笔定书，然后学道者，得以探其源泄其流，撰成科典灵文耳。 目斯世今有神焉，以修斋执戒为功，以度死济生为誓，发为文辞，合於科典。 凡曰长材秀民者，莫不交口诵之，其可稽於彻闻乎。 切见九天金阙真人徐知证、九天玉阙真人徐知谔，声名冠世，功德在民。 内察其行，外观其迹，委是骨像合仙、有心积善建功、笃好三宝之士，若非宿幸因缘穷神而知化者，孰能如此，所着九真妙戒化文，九岳神灯科格，三界科保马。 科并出於太上玄言，究微摘实，自然成章，灵音啸味，可以为浩劫津梁，所谓闭门造车者，不计其岁月矣。 外有灵济醮科、本愿仪文、七政灯科，自非敢以为己功，从民请也。 臣性识疏愚，为言轻贱，考事察能，诠补职任，跻进仙阶。 今欲望圣慈允俞所奏，再将臣徐知证等所撰科典翻行，三界合属去处，各请遵禀，照验施行。 不惟显灵济济度之功，亦足以张吾军而慰民心之所望也。 伏候，指挥。 洪恩灵济真君事实竟",
      "translated_text": "Memorial from Your Servant Wang, Attendant of the Golden Portal, Practitioner of the Ninefold Numinous Flying Steps, and Controller of Thunder and Lightning:\n\nI humbly submit that the Dao resides in the beginningless boundlessness, profound and obscure, beyond recognition or knowledge, unattainable by the reckonings of heart or mind. Only after the Heavenly Perfected Sovereign inscribed the sacred texts with his purple brush did those who study the Dao gain the means to fathom its source and channel its flow, compiling its statutes and numinous writings.\n\nIn this age, there exists a divine being who cultivates merit through fasting and precepts, vows to deliver the dead and save the living, and composes texts that align with the sacred statutes. All who are of exceptional talent and refined character recite them with one voice—surely their merit is manifest and their renown resounds.\n\nI have observed the Nine Heavens’ Golden Portal Perfected Xu Zhizheng and the Nine Heavens’ Jade Portal Perfected Xu Zhie, whose names crown the age and whose virtue abides among the people. Examining their conduct within and their deeds without, they are indeed those whose very bones align with immortality, whose hearts accumulate goodness and build merit, and who steadfastly cherish the Three Treasures. If not for those blessed by karmic destiny who exhaust the divine to comprehend transformation, who could achieve such? Their works include the *Ninefold Perfected Wondrous Precepts of Transformative Texts*, the *Nine Marchmounts’ Spirit Lamps Statutes*, and the *Three Realms’ Protective Horse Statutes*—all derived from the Supreme’s mysterious words, delving into subtleties and extracting truth, naturally forming chapters of numinous resonance. These may serve as a bridge across the vast kalpas, for those who \"build carts behind closed doors\" reckon not the passage of years.\n\nBeyond these, there are the *Numinous Aid Ritual Statutes*, the *Original Vow Ritual Texts*, and the *Seven Governors’ Lamp Statutes*—composed not out of presumption of personal merit, but in response to the people’s entreaties.\n\nMy nature is crude and my understanding shallow; my words are of little weight. Yet, having examined their deeds and assessed their abilities, I petition to supplement their duties and elevate their immortal ranks. I now beseech Your Sagely Compassion to approve this memorial and promulgate the statutes compiled by Xu Zhizheng and others across the Three Realms, where all may adhere to and implement them accordingly. This will not only manifest the boundless merit of numinous aid but also strengthen our ranks and fulfill the people’s hopes.\n\nI prostrate myself in await of Your decree.\n\n*Record of the Facts of the Numinous Aid Perfected Lord concludes.*",
      "overlap_context": "such is the reward of virtue.*\n*In the capital’s Ao Peak, their temple shall forever receive offerings,*\n*As their names, inscribed in cinnabar, attest to their celestial perfection.*\n\nAnd again:\n*Their majestic power, resplendent and boundless,*\n*Shines ever brighter in their protection of the state and peace for the people.*\n*Not only is their fame as bright as the sun and moon,*\n*But it shall endure as long as Heaven and Earth.*\n\n*Memorial for the Conferral of Titles upon the Perfected Lords*",
      "start_char": 2652,
      "end_char": 3085,
      "start_sentence": 106,
      "end_sentence": 118,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.836871862411499,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君事实.txt",
        "category": "威仪类"
      }
    }
  ]
}