{
  "source_id": "洪恩灵济真君集福宿启仪",
  "source_file": "chunked_daozang\\洪恩灵济真君集福宿启仪.json",
  "total_chunks": 4,
  "total_original_chars": 1629,
  "total_translated_chars": 11044,
  "total_translation_time": 64.0904929637909,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君集福宿启仪.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Rite of Invoking Blessings and Lodging Petitions to the Most Merciful and Efficacious True Lord*\n\n**Scripture Title:** *The Rite of Invoking Blessings and Lodging Petitions to the Most Merciful and Efficacious True Lord*\n*Author unknown. One fascicle.*\n*Source text:* *Daoist Canon of the Zhengtong Era, Dongxuan Section, Category of Ritual Dignity.*\n\n---\n\n**The Rite of Invoking Blessings and Lodging Petitions to the Most Merciful and Efficacious True Lord**\n\nThe ritual proceeds according to form.\nAll pay homage, the master visualizes and recites as prescribed.\nThe divine incantations are proclaimed:\n\n**East**\nThe East, realm of the Nine Qi, where the Primordial Sovereign rules the Azure Heaven.\nAmidst verdant mists and towering ramparts dwells the Ancient One,\nWho oversees the celestial registers, gathers qi, and uplifts immortals.\n\n**South**\nThe South, realm of the Cinnabar Heaven, where the Vermilion Emperor presides in the Jade Hall.\nThere abides the Great Spirit, known as the Radiant Sovereign,\nWhose flames ascend in streaming smoke, whose Three Qi blaze with light.\nImmortals receive their mandate, answering to the Great Yang.\n\n**West**\nThe West, realm of the Pale Heaven, where the White Emperor guards the Seven Gates.\nGolden numina gleam resplendent, the Great Hua exhales its mist.\nWhite peaks rise in majesty, the Seven Qi swirl in harmony.\nAbove dwells the First-Born, the August Ancient Great Spirit,\nWho governs the qi of the lungs, supervises the Nine Heavens,\nInspects and confirms the celestial registers, and commands the ascent of immortals.\n\n**North**\nThe North, realm of the Mysterious Heaven, where the Five Qi meander.\nThere abides the Black Emperor, the Dual Sovereign of the Supreme Tenuity.\nHe oversees the talismanic mandates, refining immortals in the Eight Potencies.\nClad in azure skirts and feathered capes, adorned with dragon scripts and phoenix robes,\nExalted by the Supreme Emperor, he is summoned to the Jade Stair.\n\n**Center**\nThe Center, realm of the All-Pervading Spirit, the Yellow Primordial Heaven.\nHere the Five Elders first arose, the Central August One most revered.\nGathering qi and overseeing perfected beings, he governs the immortals of the earth.\nKeeper of the mysterious registers, custodian of the jade texts,\nHe hastens the ascent of primordial qi, universally proclaiming to the myriad spirits.\n\nThe ritual drum is sounded twenty-four times.\n\nThe Most High Mysterious Origin, the Five Numinous Venerable Lords, summon forth from within our bodies:\nThe Three and Five Merit Officers, the Left and Right Fragrant Official Envoys,\nThe Golden Lads of Incense, the Jade Maidens of Transmission,\nThe Daily Fragrant Officials, the Merit Officer Envoys,\nThe Orthodox Spirits of the Three Qi—\nSwiftly ascend to report!\nThe Five Great Marshals of Guan, Qi, Bian, Wei, and Diao;\nThe Two Marshals of Yue and Xu;\nThe Celestial Ding Warriors;\nThe Left and Right Divine Officials—\nOn this day, we reverently initiate the fast and establish the altar to expound the rites.\n\nWe, your humble servants, respectfully receive the sacred decree.\nAll intentions and petitions have been recorded and submitted on high.\nWe pray that the true and vital qi of life descend and flow into our bodies,\nThat the words we now proclaim swiftly reach the presence of\nThe Most Merciful True Lord of the Golden Portals of the Nine Heavens,\nThe Most Merciful True Lord of the Jade Portals of the Nine Heavens.\n\n**Proclaiming the Ritual Rank**\nWe, your humble servants, now burn incense and dedicate these merits,\nHumbly praying that the Most Merciful True Lord of the Golden Portals of the Nine Heavens,\nThe Most Merciful True Lord of the Jade Portals of the Nine Heavens—\nWhose splendor rivals linked blossoms, whose eminence crowns the age—\nMay secretly pervade Heaven and Earth, uniquely wielding the power of creation;\nWhose dual aspects—light and radiance—transcend the unfathomable subtlety of their majestic efficacy.\n\nAbundant as though present, resplendent is Their numinous power.\nWe pray that They may thoroughly bestow Their gaze of observation,\nAnd graciously deign to accept these solemn offerings of gratitude.\n\nFirst, we offer prayers for the imperial realm’s enduring stability,\nFor the sacred longevity of the sovereign,\nThat the benevolence of nurturing transformation may widely extend,\nAnd the governance of great peace be effortlessly maintained.\nNext, for the heir apparent, the protective screens of the realm,\nThe chief ministers, public officials, and all under their charge;\nFor our own Three Masters and Five Companions,\nThose who cultivate the Dao across distant generations,\nThose who dwell in valleys or mountain retreats,\nThe disciples and libationers of the tradition;\nAnd for all beings within the world—\nThe people of the land, creatures moving and still,\nFlying and hidden, all sentient beings without bound—\n\nWe, your servants, turn body, turn spirit, turn life\nTo the Most Merciful True Lords of the Golden and Jade Portals of the Nine Heavens.\nWe humbly beseech the dissolution of the three karmic actions and six sensory roots,\nThe boundless transgressions and faults,\nThat we may escape the three disasters and five sufferings,\nThe eight difficulties and nine calamities.\nMay our bodies attain the true Dao,\nSinging praises of great peace,\nTogether ascending to benevolence and longevity,\nRoaming freely in non-action,\nForever in union with the Dao.\n\nMay these prayers of profound resonance swiftly ascend,\nReaching the presence of the Most Merciful True Lords\nOf the Golden and Jade Portals of the Nine Heavens.\n\n**Chanting the Directions**\nWith reverence, we bow our heads, kneel in prostration,\nAnd, as repentant servants of the ritual assembly,\nTurn body, turn spirit, turn life\nTo the Most Merciful True Lords of the Golden and Jade Portals of the Nine Heavens,\nHumbly awaiting Their great compassion,\nThat Their vast grace may universally descend.\n\nWe have heard that when the jade scriptures unfold their radiance,\nPhoenix glyphs illuminate the azure vault;\nWhen the golden canons reveal their wonders,\nDragon charts shine brilliantly in the crimson dawn.\n\nTo cultivate it is to ride the luminous clouds and soar through the heavens;\nTo employ it is to bring peace to people and benefit all things.\n\nYet we, your servants, deeply reflect:\nOur five spirits scatter and drift,\nOur six palaces grow dim and confused.\nThe dust of deeds from body, mouth, and mind\nswirls ceaselessly;\nThe wondrous workings of essence, qi, and spirit\nremain tangled and unformed.\n\nWe humbly pray for cleansing of the soul’s raiment,\nthat all obstructions may be stilled and clarified,\nthe five burdens dissolved,\nand the three primal mysteries realized.\nMay our single thought be centered in the Yellow Center,\nfacing the exalted with reverence;\nMay we gaze toward the Nine Heavens from the Dark Summit,\nand our responsive resonance know no bounds.\n\nWith devoted hearts, we bow our heads in homage,\nprostrating in gratitude before the Most Merciful True Lords\nof the Golden and Jade Portals of the Nine Heavens.\n\n**Threefold Invocation and Hymn**\n**Threefold Prostration and Thanksgiving**\n**Reverently Announcing the Dignitaries**\n\nWe, your humble servants—[Name], together with the ritual assembly present at this altar and the officiating officials—united in sincerity, reverently address:\n\nThe Most Merciful True Lord of the Golden Portal of the Nine Heavens,\nThe Most Merciful True Lord of the Jade Portal of the Nine Heavens,\nThe Illustrious True Lord, Divine Father,\nThe Benevolent and Longevous Virtuous Immortal Consort, Divine Mother,\nThe Pure and Assisting Benevolent and Faithful Immortal Consort, Sacred Consort of the Jing Kingdom,\nThe Kindly Assisting Compassionate and Serene Immortal Consort, Defender of the Realm,\nThe Holy Brothers, Holy Sisters-in-Law, Holy Uncles, Holy Sons-in-Law, Holy Sons, Holy Daughters, Holy Nephews, Holy Grandchildren,\nAll the Immortal Kin of the Celestial Court,\nThe Mighty Generals of the Five Great Marshals—Zha, Bian, Wei, Zhao, and Diao—\nThe Two Marshals, Yue and Xu,\nThe Spirit of the Current Year’s Tai Sui,\nThe City God of the Imperial Capital,\nThe Local Earth God of this Temple,\nAnd all the responding numinous spirits of this sacred altar—\nwe beseech Your vast compassion to deign to witness and bestow Your boundless grace.\n\nWe, mere blades of grass and lowly insects,\nof humble and coarse nature,\nby fortune’s favor have been granted to serve the Mysterious Tradition,\nentrusted with the duties of this sacred precinct.\n\nThough our merits fall short by the measure of a hair’s breadth, our transgressions have amassed like mountains as we wander the dust-laden world of mortals. We humbly implore Your boundless benevolence to grant our supplications. Should any matter require report, we dare not withhold it from Your divine hearing.\n\nBy imperial decree, we reverently conduct this Pure Offering Rite, extending our devotion to the True End, purifying ourselves and fasting in sincerity. With unwavering faith and earnest intent, we follow the sacred model, erecting a jade altar adorned with feathered canopies. The resonant chime of jade pendants fills the air, golden radiance scatters its brilliance, and the luminous glow of jade candles ascends. We offer our utmost devotion in repentance and beseech Your grace and mandate.\n\nWe look up in awe to the Nine Heavens’ Golden Portal and Jade Portal, the Vast Grace True Lords, who dispatch Their divine officials and the Five Marshal Generals. May They unite in purpose, purify within and without, dispel malevolent impurities, and distance us from pernicious influences, so that our five qi may flourish in harmony and all our faculties remain in perfect balance. Through disciplined cultivation and spiritual attainment, may we merge our inner light with the Cinnabar Origin; through prayer and communion, may we channel divine radiance into the Purple Forbidden precincts.\n\nMay the virtuous merit be fully accomplished, the blessings of the fast be complete and perfect. May all sentient beings partake in this supreme goodness. Tomorrow at dawn, as we proceed with the Daoist rites, we shall present further petitions.\n\nWe vow in devotion, invoking the presence of the divine:\nWe reverently summon the Incense Official Envoys, the Left and Right Spirit Lords, and all attending numinous officials. May this hallowed site, prepared for the rite, naturally yield golden elixirs, cinnabar jades, and azure sacred herbs. May the host of spirits and perfected beings gather before this incense burner. May our sincerity ascend on high, bringing peace to our households and the realm. May the jade maidens and immortal youths of the ten directions attend the rising incense, conveying our supplications swiftly to the Nine Heavens’ Golden Portal Vast Grace True Lord, the Nine Heavens’ Jade Portal Vast Grace True Lord, and the Vast Grace Numinous Aid True Lord before Their sacred presence.\n\nThe Rite of Gathering Blessings and Invoking the Night Vigil is now concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洪恩灵济真君集福宿启仪 经名：洪恩灵济真君集福宿启仪。 撰人不详。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 洪恩灵济真君集福宿启仪 法事如式 各礼师存念如法 请宣神咒 东方 东方九炁，始皇青天。 碧霞郁垒，中有老人。 总校图录，摄炁举仙。 南方 南方丹天，赤帝玉堂。 中有大神，号曰赤皇。 上炎流烟，三炁勃光。 神仙受命，应会太阳。 西方 西方素天，白帝七门。 金灵皓映，太华流氛。 白石峨峨，七炁氤氲。 上有始生，皇老大神。 总领肺气，主校九天。 检定图录，制召上仙。 北方 北方玄天，五炁徘徊。 中有黑帝，双皇太微。 总领符命，仙炼八威。 青裙羽，龙文凤衣。 上帝所举，制到玉阶。 中央 中央总灵，黄上天元。 始生五老，中皇高尊。 摄炁监真，总领草仙。 典录玄图，宿简玉文。 催运上炁，普告万神。 呜法鼓二十四通 太上玄元五灵老君，召出臣等身中三五功曹、左右香官使者、侍香金童、传言玉女、直日香官、功曹使者、三炁正神，速上关启查边魏赵刁五大元帅、岳许二元帅、天丁力士、左右神官，以今肃启告斋，建坛阐事。 臣等钦奉圣旨，其诸意旨已录上闻，愿得正真生炁，下降流入臣等身中，令今所启之言，速达九天金阙洪恩真君、九天玉阙洪恩真君圣前。 请称法位 具位臣某等，今故烧香，愿以是功德，洪惟九天金阙洪恩真君、九天玉阙洪恩真君，华萼联辉，簪缨冠世。 潜天潜地，独专造化之功； 曰两曰旸，莫测威灵之妙。",
      "translated_text": "*The Rite of Invoking Blessings and Lodging Petitions to the Most Merciful and Efficacious True Lord*\n\n**Scripture Title:** *The Rite of Invoking Blessings and Lodging Petitions to the Most Merciful and Efficacious True Lord*\n*Author unknown. One fascicle.*\n*Source text:* *Daoist Canon of the Zhengtong Era, Dongxuan Section, Category of Ritual Dignity.*\n\n---\n\n**The Rite of Invoking Blessings and Lodging Petitions to the Most Merciful and Efficacious True Lord**\n\nThe ritual proceeds according to form.\nAll pay homage, the master visualizes and recites as prescribed.\nThe divine incantations are proclaimed:\n\n**East**\nThe East, realm of the Nine Qi, where the Primordial Sovereign rules the Azure Heaven.\nAmidst verdant mists and towering ramparts dwells the Ancient One,\nWho oversees the celestial registers, gathers qi, and uplifts immortals.\n\n**South**\nThe South, realm of the Cinnabar Heaven, where the Vermilion Emperor presides in the Jade Hall.\nThere abides the Great Spirit, known as the Radiant Sovereign,\nWhose flames ascend in streaming smoke, whose Three Qi blaze with light.\nImmortals receive their mandate, answering to the Great Yang.\n\n**West**\nThe West, realm of the Pale Heaven, where the White Emperor guards the Seven Gates.\nGolden numina gleam resplendent, the Great Hua exhales its mist.\nWhite peaks rise in majesty, the Seven Qi swirl in harmony.\nAbove dwells the First-Born, the August Ancient Great Spirit,\nWho governs the qi of the lungs, supervises the Nine Heavens,\nInspects and confirms the celestial registers, and commands the ascent of immortals.\n\n**North**\nThe North, realm of the Mysterious Heaven, where the Five Qi meander.\nThere abides the Black Emperor, the Dual Sovereign of the Supreme Tenuity.\nHe oversees the talismanic mandates, refining immortals in the Eight Potencies.\nClad in azure skirts and feathered capes, adorned with dragon scripts and phoenix robes,\nExalted by the Supreme Emperor, he is summoned to the Jade Stair.\n\n**Center**\nThe Center, realm of the All-Pervading Spirit, the Yellow Primordial Heaven.\nHere the Five Elders first arose, the Central August One most revered.\nGathering qi and overseeing perfected beings, he governs the immortals of the earth.\nKeeper of the mysterious registers, custodian of the jade texts,\nHe hastens the ascent of primordial qi, universally proclaiming to the myriad spirits.\n\nThe ritual drum is sounded twenty-four times.\n\nThe Most High Mysterious Origin, the Five Numinous Venerable Lords, summon forth from within our bodies:\nThe Three and Five Merit Officers, the Left and Right Fragrant Official Envoys,\nThe Golden Lads of Incense, the Jade Maidens of Transmission,\nThe Daily Fragrant Officials, the Merit Officer Envoys,\nThe Orthodox Spirits of the Three Qi—\nSwiftly ascend to report!\nThe Five Great Marshals of Guan, Qi, Bian, Wei, and Diao;\nThe Two Marshals of Yue and Xu;\nThe Celestial Ding Warriors;\nThe Left and Right Divine Officials—\nOn this day, we reverently initiate the fast and establish the altar to expound the rites.\n\nWe, your humble servants, respectfully receive the sacred decree.\nAll intentions and petitions have been recorded and submitted on high.\nWe pray that the true and vital qi of life descend and flow into our bodies,\nThat the words we now proclaim swiftly reach the presence of\nThe Most Merciful True Lord of the Golden Portals of the Nine Heavens,\nThe Most Merciful True Lord of the Jade Portals of the Nine Heavens.\n\n**Proclaiming the Ritual Rank**\nWe, your humble servants, now burn incense and dedicate these merits,\nHumbly praying that the Most Merciful True Lord of the Golden Portals of the Nine Heavens,\nThe Most Merciful True Lord of the Jade Portals of the Nine Heavens—\nWhose splendor rivals linked blossoms, whose eminence crowns the age—\nMay secretly pervade Heaven and Earth, uniquely wielding the power of creation;\nWhose dual aspects—light and radiance—transcend the unfathomable subtlety of their majestic efficacy.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 612,
      "start_sentence": 0,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.414512634277344,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君集福宿启仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "洋洋如在，濯濯厥灵。 愿洞赐於鉴观，特俯歆於崇谢。 臣等先用上祝皇图巩固，圣寿绵长，廓施化育之仁，垂拱大平之治。 次为储宫藩屏、宰辅公卿官属，下及臣等三师五友，异代学真，谷隐岩槱，门徒祭酒，以至寰中庶类、天下人民、动植飞潜，无边含识。 臣等皈身皈神皈命九天金阙玉阙洪恩真君。 特乞消除三业六根，无边衅咎，得兔离三灾五苦，八难九厄之中。 身得真道，歌咏太平，同跻仁寿，逍遥无为，永与道合。 所祈玄感应声，上诣九天金阙洪恩真君、九天玉阙洪恩真君圣前。 唱方 礼足，各长跪皈命忏悔臣法众等，志心皈身皈神皈命九天金阙洪恩真君、九天玉阙洪恩真君，恭望大慈，同垂巨泽，普降洪恩。 臣闻玉字开光，凤篆昭回於碧落。 金科演妙，龙章辉焕於赤明。",
      "translated_text": "Abundant as though present, resplendent is Their numinous power.\nWe pray that They may thoroughly bestow Their gaze of observation,\nAnd graciously deign to accept these solemn offerings of gratitude.\n\nFirst, we offer prayers for the imperial realm’s enduring stability,\nFor the sacred longevity of the sovereign,\nThat the benevolence of nurturing transformation may widely extend,\nAnd the governance of great peace be effortlessly maintained.\nNext, for the heir apparent, the protective screens of the realm,\nThe chief ministers, public officials, and all under their charge;\nFor our own Three Masters and Five Companions,\nThose who cultivate the Dao across distant generations,\nThose who dwell in valleys or mountain retreats,\nThe disciples and libationers of the tradition;\nAnd for all beings within the world—\nThe people of the land, creatures moving and still,\nFlying and hidden, all sentient beings without bound—\n\nWe, your servants, turn body, turn spirit, turn life\nTo the Most Merciful True Lords of the Golden and Jade Portals of the Nine Heavens.\nWe humbly beseech the dissolution of the three karmic actions and six sensory roots,\nThe boundless transgressions and faults,\nThat we may escape the three disasters and five sufferings,\nThe eight difficulties and nine calamities.\nMay our bodies attain the true Dao,\nSinging praises of great peace,\nTogether ascending to benevolence and longevity,\nRoaming freely in non-action,\nForever in union with the Dao.\n\nMay these prayers of profound resonance swiftly ascend,\nReaching the presence of the Most Merciful True Lords\nOf the Golden and Jade Portals of the Nine Heavens.\n\n**Chanting the Directions**\nWith reverence, we bow our heads, kneel in prostration,\nAnd, as repentant servants of the ritual assembly,\nTurn body, turn spirit, turn life\nTo the Most Merciful True Lords of the Golden and Jade Portals of the Nine Heavens,\nHumbly awaiting Their great compassion,\nThat Their vast grace may universally descend.\n\nWe have heard that when the jade scriptures unfold their radiance,\nPhoenix glyphs illuminate the azure vault;\nWhen the golden canons reveal their wonders,\nDragon charts shine brilliantly in the crimson dawn.",
      "overlap_context": " the Ritual Rank**\nWe, your humble servants, now burn incense and dedicate these merits,\nHumbly praying that the Most Merciful True Lord of the Golden Portals of the Nine Heavens,\nThe Most Merciful True Lord of the Jade Portals of the Nine Heavens—\nWhose splendor rivals linked blossoms, whose eminence crowns the age—\nMay secretly pervade Heaven and Earth, uniquely wielding the power of creation;\nWhose dual aspects—light and radiance—transcend the unfathomable subtlety of their majestic efficacy.",
      "start_char": 612,
      "end_char": 920,
      "start_sentence": 44,
      "end_sentence": 55,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.989771842956543,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君集福宿启仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "修之则驾景腾霄，用之则安人利物。 重念臣等，五神荡越，六府昏迷，身口意之业尘，流吹罔息； 精炁神之妙用，混结未凝。 宜祈澡雪於襟灵，庶使澄清於诸障，消融五累，证妙三元。 端一念於黄中，对扬有翼； 望九霄於玄上，应感无方。 臣等志心稽首，礼谢九天金阙洪恩真君、九天玉阙洪恩真君圣前。 三启颂 三礼谢 重称法位 具位臣某，与临坛法众、代礼官等，谨同诚上启： 九天金阙洪恩真君， 九天玉阙洪恩真君， 圣父翊亮真君， 圣母仁寿淑善仙妃， 圣妃泾国夫人顺助仁惠贞应仙妃， 卫国夫人善助慈懿恭静仙妃， 圣兄、圣嫂、圣舅、圣婿、圣子、圣女、圣侄、圣孙，列位仙眷，合殿威灵，查边魏赵刁五大元帅，岳许二元帅，今年太岁之神，京都城隍，本宫土地之神，灵坛感降一切只灵，咸望洪慈，俯垂洞鉴。 臣等草芥微生，酿鸡陋质，幸依昌运，获奉玄宗。 主典祠宫。",
      "translated_text": "To cultivate it is to ride the luminous clouds and soar through the heavens;\nTo employ it is to bring peace to people and benefit all things.\n\nYet we, your servants, deeply reflect:\nOur five spirits scatter and drift,\nOur six palaces grow dim and confused.\nThe dust of deeds from body, mouth, and mind\nswirls ceaselessly;\nThe wondrous workings of essence, qi, and spirit\nremain tangled and unformed.\n\nWe humbly pray for cleansing of the soul’s raiment,\nthat all obstructions may be stilled and clarified,\nthe five burdens dissolved,\nand the three primal mysteries realized.\nMay our single thought be centered in the Yellow Center,\nfacing the exalted with reverence;\nMay we gaze toward the Nine Heavens from the Dark Summit,\nand our responsive resonance know no bounds.\n\nWith devoted hearts, we bow our heads in homage,\nprostrating in gratitude before the Most Merciful True Lords\nof the Golden and Jade Portals of the Nine Heavens.\n\n**Threefold Invocation and Hymn**\n**Threefold Prostration and Thanksgiving**\n**Reverently Announcing the Dignitaries**\n\nWe, your humble servants—[Name], together with the ritual assembly present at this altar and the officiating officials—united in sincerity, reverently address:\n\nThe Most Merciful True Lord of the Golden Portal of the Nine Heavens,\nThe Most Merciful True Lord of the Jade Portal of the Nine Heavens,\nThe Illustrious True Lord, Divine Father,\nThe Benevolent and Longevous Virtuous Immortal Consort, Divine Mother,\nThe Pure and Assisting Benevolent and Faithful Immortal Consort, Sacred Consort of the Jing Kingdom,\nThe Kindly Assisting Compassionate and Serene Immortal Consort, Defender of the Realm,\nThe Holy Brothers, Holy Sisters-in-Law, Holy Uncles, Holy Sons-in-Law, Holy Sons, Holy Daughters, Holy Nephews, Holy Grandchildren,\nAll the Immortal Kin of the Celestial Court,\nThe Mighty Generals of the Five Great Marshals—Zha, Bian, Wei, Zhao, and Diao—\nThe Two Marshals, Yue and Xu,\nThe Spirit of the Current Year’s Tai Sui,\nThe City God of the Imperial Capital,\nThe Local Earth God of this Temple,\nAnd all the responding numinous spirits of this sacred altar—\nwe beseech Your vast compassion to deign to witness and bestow Your boundless grace.\n\nWe, mere blades of grass and lowly insects,\nof humble and coarse nature,\nby fortune’s favor have been granted to serve the Mysterious Tradition,\nentrusted with the duties of this sacred precinct.",
      "overlap_context": "ow our heads, kneel in prostration,\nAnd, as repentant servants of the ritual assembly,\nTurn body, turn spirit, turn life\nTo the Most Merciful True Lords of the Golden and Jade Portals of the Nine Heavens,\nHumbly awaiting Their great compassion,\nThat Their vast grace may universally descend.\n\nWe have heard that when the jade scriptures unfold their radiance,\nPhoenix glyphs illuminate the azure vault;\nWhen the golden canons reveal their wonders,\nDragon charts shine brilliantly in the crimson dawn.",
      "start_char": 920,
      "end_char": 1296,
      "start_sentence": 56,
      "end_sentence": 75,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.179482460021973,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君集福宿启仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "功无及於分寸，周流尘俗，过有积於丘山。 尚祈善贷之仁，克副祷祈之请。 凡有关告，敢不上闻。 臣钦奉圣旨，崇修清醮，延奉真终，洁己斋心。 推诚秉愫，恭依琼范，崇建瑶坛，列羽葆之，缤纷扣琳，琅而振响，金华散彩，玉烛腾辉，谢过殚诚，祈恩请命。 仰惟九天金阙玉阙洪恩真君，降差官属五帅神员，协力同心，肃清内外，荡除凶秽，远隔妖氛，使臣等五气安熙，百关调泰。 操存达诣，合神景於丹元，启告感通，注灵光於紫禁。 善功克备，斋福周圆，一切含灵，同沾胜善，明晨行道，别具启闻。 发愿 存神烧香 谨摄香官使者、左右神君、侍香诸灵官，当令宿建之所，自然生金液丹碧芝英，百灵众真，交会在此香火炉前。 当愿精诚上达，家国安宁，十方仙童玉女，接侍香烟，传臣向来所启之言，速达九天金阙洪恩真君、九天玉阙洪恩真君圣前 洪恩灵济真君集福宿启仪竟",
      "translated_text": "Though our merits fall short by the measure of a hair’s breadth, our transgressions have amassed like mountains as we wander the dust-laden world of mortals. We humbly implore Your boundless benevolence to grant our supplications. Should any matter require report, we dare not withhold it from Your divine hearing.\n\nBy imperial decree, we reverently conduct this Pure Offering Rite, extending our devotion to the True End, purifying ourselves and fasting in sincerity. With unwavering faith and earnest intent, we follow the sacred model, erecting a jade altar adorned with feathered canopies. The resonant chime of jade pendants fills the air, golden radiance scatters its brilliance, and the luminous glow of jade candles ascends. We offer our utmost devotion in repentance and beseech Your grace and mandate.\n\nWe look up in awe to the Nine Heavens’ Golden Portal and Jade Portal, the Vast Grace True Lords, who dispatch Their divine officials and the Five Marshal Generals. May They unite in purpose, purify within and without, dispel malevolent impurities, and distance us from pernicious influences, so that our five qi may flourish in harmony and all our faculties remain in perfect balance. Through disciplined cultivation and spiritual attainment, may we merge our inner light with the Cinnabar Origin; through prayer and communion, may we channel divine radiance into the Purple Forbidden precincts.\n\nMay the virtuous merit be fully accomplished, the blessings of the fast be complete and perfect. May all sentient beings partake in this supreme goodness. Tomorrow at dawn, as we proceed with the Daoist rites, we shall present further petitions.\n\nWe vow in devotion, invoking the presence of the divine:\nWe reverently summon the Incense Official Envoys, the Left and Right Spirit Lords, and all attending numinous officials. May this hallowed site, prepared for the rite, naturally yield golden elixirs, cinnabar jades, and azure sacred herbs. May the host of spirits and perfected beings gather before this incense burner. May our sincerity ascend on high, bringing peace to our households and the realm. May the jade maidens and immortal youths of the ten directions attend the rising incense, conveying our supplications swiftly to the Nine Heavens’ Golden Portal Vast Grace True Lord, the Nine Heavens’ Jade Portal Vast Grace True Lord, and the Vast Grace Numinous Aid True Lord before Their sacred presence.\n\nThe Rite of Gathering Blessings and Invoking the Night Vigil is now concluded.",
      "overlap_context": " and Diao—\nThe Two Marshals, Yue and Xu,\nThe Spirit of the Current Year’s Tai Sui,\nThe City God of the Imperial Capital,\nThe Local Earth God of this Temple,\nAnd all the responding numinous spirits of this sacred altar—\nwe beseech Your vast compassion to deign to witness and bestow Your boundless grace.\n\nWe, mere blades of grass and lowly insects,\nof humble and coarse nature,\nby fortune’s favor have been granted to serve the Mysterious Tradition,\nentrusted with the duties of this sacred precinct.",
      "start_char": 1296,
      "end_char": 1653,
      "start_sentence": 76,
      "end_sentence": 88,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.506726026535034,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君集福宿启仪.txt",
        "category": "威仪类"
      }
    }
  ]
}