{
  "source_id": "清微神烈秘法",
  "source_file": "chunked_daozang\\清微神烈秘法.json",
  "total_chunks": 25,
  "total_original_chars": 8344,
  "total_translated_chars": 51588,
  "total_translation_time": 305.2543544769287,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
    "category": "方法类"
  },
  "full_translation": "**The Esoteric Divine Thunder Rites of Qingwei**\n\n**Title:** *The Esoteric Divine Thunder Rites of Qingwei*. Author unknown. Two fascicles. Base text from *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, Methods Category.\n\n---\n\n### *The Esoteric Divine Thunder Rites of Qingwei, Fascicle One*\n#### *Arcane Discourse on Thunder*\n\nThe Qingwei, when described by analogy, is the most revered among the myriad heavens of the Great Luo, the Jade Capital of the Yu Mountain atop the Yu Terrace of the Uppermost Great Luo, and the Jade Purity of the Primordial Uppermost Great Luo. It originates before the division of the primordial chaos, the vast expanse, and the undifferentiated hồng-mông, within the realm of the Great Brahmā and the Great Beginning—precisely where the Most High Primordial Lord presides. It is the luminous inception of the primordial *qi* at the dawn of the ancestral kalpa, known as the Root of Heaven.\n\nThe Qingwei Method is none other than the Divine Empyrean under another name, a sublime practice within the Dao. The Dao is the ancestor of all methods, and Thunder is the sovereign of all thunders—not merely a method among methods. Thus, it inherits the primordial *qi* of the Primordial Lord, governing the myriad spirits. It further manifests distinct forms of the Three *Qi* of Brahmā, Pure, and Radiant, bearing alternate names such as the Crimson, Azure, Jade, Vermilion, Purple, and Supreme Divine.\n\nWithin this method, thunder talismans, jade scriptures, and celestial canons all naturally coalesced from the Brahmā-*qi* in the vastness of the firmament at the dawn of the kalpa. In ancient times, the Primordial Lord descended and commanded the Heavenly Perfected Sovereign to transcribe their texts with a brush—each character a *zhang* in length—concealing them within the Golden Portal of the Jade Capital of the Purple Tenuity’s Upper Palace, entrusted to the Five Elder Thearchs. These Upper Grade Spirit Scriptures serve to regulate the kalpic cycles, give rise to heaven and establish earth, govern the movements of water and fire, enlighten the divine, and stand as the origin of all Daoist methods. Transmitted once every forty thousand kalpas, they are revealed to the celestial and human.\n\nThe Middle Grade Scriptures are concealed within the dragon palaces and oceanic treasuries of the Five Marchmounts and Four Watercourses, entrusted to their respective deities. They stabilize and pacify the marchmounts and watercourses, open the sources of springs, summon dragons to bear water, and command the divine hosts of the Divine Empyrean. Transmitted once every forty thousand kalpas, they are revealed to the divine and human.\n\nThe Lower Grade Spirit Scriptures are transmitted among the lineage masters of the world, passed heart-to-heart and mouth-to-mouth, enduring as long as heaven itself. They pray for celestial blessings upon the state, propagate the Dao to transform the people, command thunder and lightning, summon wind and rain at will, vanquish malevolent spirits, alleviate drought and flood, deliver the living and the dead, and aid the sovereign and the people. Such is the wondrous Dao of the Qingwei Thunder Rites practiced in the world today. Truly unlike any other method, the enlightened, upon hearing it once, attain sudden realization.\n\nFor the Five Phases, *geng* is sovereign; for the Five *Qi*, the One is the ancestor; for the myriad methods, the mind is the standard. This method is simple and effortless, neither clinging to deliberate action nor falling into non-action. It rejects forced visualization, hollow formalities, sacrifices, prayers, and supplications—all of which are but flattery and deception. Its wonder lies in the fusion of one’s spirit with the other spirit, one’s numen with the other numen, which the Confucian classics call \"extending knowledge to investigate things.\"\n\nIn the daily conduct of the four dignified postures—moving, dwelling, sitting, and reclining—one must gather and restrain body and mind, instantly stilling the myriad thoughts. Abide in non-abiding, preserve non-preservation, and maintain an unbroken true thought. As if in the undivided chaos before the emergence of the Supreme Ultimate, within the empty void and the circular radiance, there is a single aperture—vast without exterior, minute without interior. Before the Supreme Ultimate divided, chaos was uniform; body and mind dissolve, leaving only a single point in the Great Void. The numinous luminosity naturally illumines the ten directions. The field of the heart is unstained, the ground of nature free from dust. With time, stillness prevails, and responsiveness arises spontaneously.\n\nAt this stage, with a single glance or thought, the generals and marshals abound, as if present at one’s side. In stillness, it is the Dao; in motion, it is the method. With the mouth opened and the heart preserved, clarity and resonance manifest immediately. This is the root of the Great Dao, the origin of the myriad methods. Only through unwavering singularity from beginning to end, with thoughts unbroken in the four dignified postures, does one enter the unobstructed—this is the accomplishment of the perfected.\n\n---\n\n### *Lineage*\n\n**Patriarchs:**\n- The Qingwei Patriarch, High Yuanchen Zhaoxu Purple Void Primordial Sovereign, Minister Wei Huacun.\n- The Patriarch, Ten-Thousand-Transformations Nine Perfected Jade Immortal Holy Mother Primordial Sovereign, Minister Zhuang Xu.\n- The Patriarch, Three Heavens Sage Master Supreme Mystery King-Phase Perfected Lord, Minister Zhang Daoling.\n- The Patriarch, Illustrious Great Envoy Heavenly Mechanism Inner Minister Perfected Lord, Minister Xu Xun.\n\n**Perfected Lords:**\n- Qingwei Primordial Upper Attendant Chen Golden Portal Radiant Congealed Cavern-Pure Transformative Wondrous Dao Primordial Sovereign, Minister Zu Shu.\n- Three Heavens Attendant Scripture Dragon Radiance Dao Illumination Primordial Sovereign, Minister Yao Zhuang.\n- Three Heavens Attendant Imperial Purple Splendor Jade Wisdom Primordial Sovereign, Minister Gao Shi.\n- Cavern Yang Upper Minister Pure Void Western Florescence Perfected, Minister Hua Ying.\n- Divine Empyrean Jade Pivot Envoy Green City Penetrating Wisdom Perfected, Minister Zhu Dongguang.\n- Cloud Mountain Preserving Unity Perfected, Minister Li Shaowei.\n- Eyebrow Mountain Concealed Perfected, Minister Nan Bidao.\n- Azure Water Thunder Abyss Perfected, Minister Huang Shunshen.\n- Qingwei Impelling Dao Envoy, Minister Ye Yunlai.\n- Qingwei Impelling Harmony Envoy, Minister Zhang Daogui.\n- Impelling Primordial Thunder Envoy, Minister Zhang Shouqing.\n- Purple Mystery Dispersing Clerk, Minister Zhang Shouyi.\n\n**Divine Ranks:**\n- **Chief Ritual Master:** Purple August Supreme Unity Heavenly Lord Li Zhe. Attire as usual.\n- **Qingwei Chief Marshal:** Upper Clarity Divine Mighty Yang Thunder Divine Lord Gou Liuji. Golden crown, black face, three eyes, red hair, golden armor, vermilion robes, vermilion boots, wielding a golden hammer and drill.\n- **Qingwei Chief Marshal:** Upper Clarity Divine Mighty Yin Thunder Divine Lord Bi Zongyuan. Disheveled hair, red face, black robes, golden armor, barefoot, wielding an iron staff.\n\n### *Meditation and Seated Practice*\n\nIn all moments of seated meditation and regulated breath, one abides as if in the primordial state before the division of the Great Ultimate and the chaos, within the vast emptiness and the radiant orb of light. Or again, as if dwelling within the single aperture of that orb of light, where the Great Ultimate remains undivided—body and mind utterly dissolved, yet a single spark of numinous light persists, neither within nor without, limpid and profound, illumining the ten directions in boundless radiance, unfathomable even to heaven and earth. Morning and evening seated meditation alike serve as practice and application.\n\n**Prayer Ritual: Establishing the Outer Altar of the Four Directions**\nAt the four outer corners, place water jars, arraying them at the four directional positions, each with an incense table.\n\n**Left Rank of the Ritual:**\n- Thunder Marshals, Thunder Divine Generals, and Clerks of the Dharma\n- Register Master Protector Li, the Perfected\n- Illuminating Master Qingxu Hua, the Perfected\n- Perfected Master Mingdao Yuanjun\n- Sage Master Zhaoning Yuanjun\n- Primordial Master Zixu Yuanjun\nOfferings of incense, flowers, and candles.\n\n**Right Rank of the Ritual:**\n- Sage Master Taisu Yuanjun\n- Mystic Master Ziying Yuanjun\n- Scripture Master Tonghui Yuanzhe\n- Salvation Master Hunyin Nan, the Perfected\n- Deputy Marshals of the Dharma, Thunder Divine Talisman Envoys\n- Talisman Mandate: *Zong*\n- Purification Talisman: *Jiehui Fu*\n\n**Purification and Two Talismans on the Right**\nThe *Jiehui* and *Qidao* talismans—used for purification, prayer, healing, wine consecration, and eye-washing—are universally applicable. The *Xiangxin* talisman may be inscribed in cinnabar on incense tablets or written on paper.\n\n**Minister [Name] bows and respectfully petitions:**\nFor the talisman on the right, silently recite *\"Longyu Zhi\"* three times while tracing it in the mind and exhaling.\n\n○ Silently invoke the *Imperial Perfected Unity*.\n\n**Talisman to Summon the Two Thunder Lords**\n*Gou [Name] Talisman-Summons*\nSwiftly descend, *Qingshen Lie Gou Bi* Thunder Lord!\n*Bi [Name]*\n\n**Minister [Name] respectfully summons:**\nFor the talisman on the right, use the *Celestial Scripture* to trace the taboo names of the Two Marshals.\n\n**Purification Altar Talisman**\n*Qing*\n*Di Deng Ling Zhu Ying*\n*Chi*\nSwiftly summon by command!\n\n**Talisman to Summon the Four Dark Lords**\n☴ *Yulei Haoshi Jun* – Command to enter the water jar\n*Ding Wenguang* – Tortoise-headed, human-bodied\n\n☷ *Jinjing Liuguang Jun* – Command to enter the water jar\n*Ding Wenxing* – Human-headed, serpent-bodied\n\n☶ *Dongyang Youling Jun* – Command to enter the water jar\n*Ding Wenda* – Human-headed, fish-bodied\n\n☰ *Leihua Taihuanghou* – Command to enter the water jar\n*Ding Wenhui* – Human-headed, dragon-bodied\n\n**Urgent Summons of the Four Dark Talismans**\n☴ *Swift Talisman* – *Ding Wenguang* – *Complete*\n*Urgent Water-Jar Talisman* – *Kun Command* – *Ding Wenxing* – *Steadfast*\n*Urgent Water-Jar Talisman* – *Gen Rush* – *Ding Wenyuan* – *Swift*\n*Urgent Water-Jar Talisman* – *Qian Victory* – *Ding Wenhui* – *Rapid*\n\n**Prayer and Altar Construction for the Inner Thunder Platform**\n*Left Rank:*\n[Name], *Commander-in-Chief of the Thunder Deities, Talisman-Messenger, and Merit Officers.*\nThe Perfected Masters of the Qingwei Tradition, Expounders of the Teachings.\n\n*Purification Water*\n*Nine Heavens Responding to the Primordial, Thunder-Voice Universal Transformation Heavenly Worthy.*\n\n*Incense, Flowers, Candles*\n*Talisman Mandate*\n*Lofty Thunder, Supreme Illustrious Destiny, Utmost Perfected.*\n\n*Right Rank:*\n[Name], *Deputy Commander of the Thunder Deities, Merit Officers, and Generals.*\n\n*Outer Altar:*\nEach station arrayed with one table.\n\n*Summons Decree:*\nErect the Gate of Heaven, face the Portal of Earth.\n\n*Eastern* Wind-Rain-Thunder-Lightning Deities – *Eastern* Pursuit Messenger for [Name].\n*Southern* Wind-Rain-Thunder-Lightning Deities – *Southern* Pursuit Messenger for [Name].\n*Western* Wind-Rain-Thunder-Lightning Deities – *Western* Pursuit Messenger for [Name].\n*Northern* Wind-Rain-Thunder-Lightning Deities – *Northern* Pursuit Messenger for [Name].\n*Central* Wind-Rain-Thunder-Lightning Deities – *Central* Pursuit Messenger for [Name].\n\n*Altar-Construction Talisman Mandate.*\n\n**Purification of the Altar**\n\n*Inviting the Marshals*\n*Three Marshals*\n*Summoning the Generals*\n*Deploying the Generals*\n*General Summons*\n*Transmitting the Decree*\n*Primordial Mandate of Thunder and Lightning Talismans*\n*Thunder and Lightning Operational Mandate*\n*Thunder Altar’s Central Tablet for the Five Directions*—all inscribed on yellow paper in cinnabar.\n\n*Eastern Forest*\n*Southern Flame*\n*Western Capital*\n*Northern Hollow*\n*Central Pillar*\n*Central Palace*\n\n*Yellow and White Qi*—*Northern* *Black and Azure Qi*—*Western* *White and Black Qi*—*Southern* *Red and Yellow Qi*—*Eastern*\n\n*Swift Command Talisman*—inscribed in cinnabar on a new brick, fired and submerged in a jar, where water and fire clash in contest.\n\n*Eastern Convergence*\n*Western Clarity*\n*Southern Heaven*\n*Northern Emperor*\n*Central Sun*\n*Former Decree*\n\n*Swift* *Eastern Decree*—*Swift*\n*Southern Decree*—*Swift*\n*Western Decree*—*Swift*\n*Northern Decree*—*Swift*\n*Central*—*Swift*\n\nIf the response is not forthcoming, use an iron tablet and first submit an imperial memorial to the Dragon Pool. The master reviews and opens the talisman before lowering the tablet.\n\n**Tablet Formula**\nMemorial: *\"By imperial edict, the Three Ministries are charged to first rectify the celestial divisions and pardon transgressions. Proclaim this to the Dragon Lord of [State], [County], [Location] Pool-Cave. You are commanded to obey the originally descended [Tablet] and act with utmost urgency. Your servant, now at the altar of [Location], prostrates to await universal grace.\"*\n\n*Year, Month, First Day, Hour—Decree Issued.*\n\nThe iron tablet is one foot two inches in length and five inches two fen in width. Inscribe the talisman in cinnabar on the front and the text on the reverse, then place it in a blue silk pouch before submerging it in water. Further command the Dragon Lord of [Location] Pool-Cave to obey the tablet and act with haste.\n\nThe master burns the talisman and lowers it into the pool, wielding the sword to spray water while reciting the incantation:\n*\"Heaven descends in brilliance, Earth ascends in compliance. Spirits obey, thunder is driven forth. Lightning turns the celestial stars to smite the rebellious and defiant. Dragon deities descend in universal grace—benefit, advantage, harmony, and uprightness.\"*\n\n**Pouch Formula**\nMade of blue silk; if unavailable, blue damask may be used.\n\n**Iron Tablet Talisman**\nInscribed in cinnabar on the reverse of the tablet:\n*\"Vast Qi of the Pure and Subtle Heaven, pervading the Dao with boundless grace—Golden Talisman, Iron Tablet. Reverently following the originally descended decree, the mandate is issued.\"*\n\n*Right: Golden Talisman, Iron Tablet—Proclaimed to the Dragon Deity of [State], [County], [Location] Pool-Cave. You are commanded to obey the originally descended tablet mandate. On the [Day] of this month at [Hour], lead the dragon-thunder to descend upon [Location], summon clouds to bring rain, unleash great thunderclaps, rescue the parched people, saturate the fields, and benefit all things. On the day of merit, your name shall be recorded in the Upper Clarity Register of this altar. Beyond the already recorded words, a memorial shall be swiftly submitted to the Celestial Court to request the bestowal of imperial grace. Upon receipt of this external tablet mandate, command the swift stars to immediately await the luminous report.\"*\n\n*Year, Month, First Day, Hour—Decree Issued.*\n\n**Lowering the Tablet Talisman**\nInscribed in cinnabar on blue or plain silk:\n*\"Your servant [Name], bearing the decree, obeys and executes.\"*\n\nSummon the Three Celestial Thunderclaps, swiftly submit the dark memorial, and let the talisman envoy Kong An-tian descend. The incantation is complete and potent. Donning a fiery crown for three days, with a blue-green face, crimson hair, clad in golden armor and vermilion robes, wielding a sword, holding the talisman, wearing vermilion shoes, and riding a red phoenix.\n\nSummon the talisman envoy. The memorial commissions the talisman envoy, who bears the tablet mandate to proclaim its descent. Once the Dragon Lord is summoned and the memorial is read, burn the talisman. Thereafter, dispatch and command, ensuring timely and luminous report—do not delay or disobey. On the day of merit, your name shall be recorded in the Upper Clarity.\n\nRecite the incantation:\n*\"Heaven descends its crystalline essence to Earth,\nIn accord with the numinous, drive forth the thunder.\nThe thunder moves the celestial stars,\nPunishing the rebellious and countermanding fate.\nThe Dragon Spirit descends universally,\nBestowing moisture, harmony, and steadfast integrity.\"*\n\nCast the tablet into the water.\n\n**First Step:** Establish the altar petition, following the recent precedents of the Four Masters.\n**○ Enter the Flying [Memorial]**\nNext, don the armor, and perform the Three Thunder Rites as prescribed. Use yellow paper, nine inches in height and five inches in width, inscribe the talisman in cinnabar, annotate in ink, and bind it with silk thread. Burn it in the center, or within the incense burner. Invoke the Thunder Spirit.\n\nRecite the Heavenly Scripture, inscribing the talisman in ink:\n*\"This talisman is for [Location] and the petition therein prostrated. Since [Month], there has been prolonged drought without rain; the fields are cracked like tortoise shells, the crops wither, the people’s hearts are anxious, and the year’s harvest is feared lost. We knock our heads and beseech, pleading for rain—this matter is urgent. The petition’s words are earnest and impassioned, its intent too pressing to suppress. We proceed in accordance with the prescribed rites to proclaim and enact this. The originally descended Jade Talisman has been respectfully invoked.\"*\n\nTo the mighty and divine Lords of Yin and Yang, Gou and Bi, assemble with haste. Patrol by day, govern by year—the Thunder Spirits, the Masters of Rain, and the Dragon Lords of this realm’s mountains, rivers, deep pools, and caverns, along with the Earth Gods and Local Deities. On the appointed day and hour of this month, descend to [Location], summon the dragons to coil the waters, ride the winds and lash the thunder, and bestow three days of sweet rain to universally succor all beings across the four outskirts. Above, manifest the transformative power of the Dao; below, fulfill the people’s plea. Await the response in reverence, that the celestial trust be made manifest.\n\nYear ___ Month ___ Day ___ Hour ___\nYour servant [Name], by decree, respectfully enacts this.\n\nOne Supreme Ultimate, Two Flying Warriors, Three Armored Guardians, Six Rain, Seven Thunder, Startling Nine Thunder. Recite the Heavenly Scripture, inscribe ten revolutions.\n\nSecond stage: write in ink on yellow paper, bind with silk thread, and burn in a blazing fire beneath the open sky.\n\nRecite the Heavenly Scripture, inscribing the talisman in ink:\n*\"This talisman is for [Location] and [Petitioner], who prostrates in plea for rain to rescue the fields and crops.\"*\n\nYour servant, having received the petition, has already commissioned the Thunder Spirits to assemble with the Rain Deities, the Dragon Lords of mountains, rivers, deep pools, and caverns, and the Earth Gods and Local Deities, setting a fixed term for the great bestowal of sweet rain. Should there be any delay or obstruction to the timely relief of the drought, this further proclamation is issued without fail.\n\nThe originally descended Jade Talisman urgently invokes the mighty and divine Lords of Yin and Yang, Gou and Bi. Ensure they respond on schedule, commanding the Thunder Spirits of the yearly cycle, the Dragon Lords of the daily patrol, and the deities of mountains, rivers, deep pools, caverns, and local altars to uniformly obey the talismanic decree. Let them send forth rain and summon clouds, dispel the drought demons to save the withered, aid the living beings, and revive all things. May they extend the virtue of cherishing life, descending to rescue the dying crops with abundant sweet rain, that the great work of Heaven’s mandate be gloriously fulfilled. Await the harmonious response in reverence.\n\nOn the ___ day of the ___ month, at the ___ hour, your subject [Name] respectfully receives the edict and executes it.\n\nThe talisman on the right shall follow the previous sequence, with additional seals and ink applications. For the third deadline: inscribe in black ink on yellow paper, bind with five-colored threads, and burn in an open-air blazing fire. The administrative endorsement shall follow the prior format, written in accordance with the deadline sequence.\n\nRecite the Heavenly Scripture while applying ink.\n\nFor the fourth deadline: submit to the Ritual Master’s repository; the Five Masters shall inscribe the talisman as before. Further add the talismans of wind, clouds, thunder, rain, and lightning. Then affix the Heart Seal, applying ink to complete the brushstrokes.\n\nThe *Zhen* (☳) Hexagram’s Armored Summons Talisman shall be inscribed in cinnabar or black ink on yellow or blue-green paper, bound with five-colored threads, and burned in the stove. First apply cinnabar from the outside inward, then black ink from the inside outward, following the administrative endorsement procedure.\n\nSeal Bureau. Seal Bureau. From this point onward, the taboo names of the Two Marshals shall be written in cloud-script. First apply red, then black; after dispatch, apply black ink.\n\nFor the fifth deadline: the talisman format remains as before, with the addition of the Urgent Summons Heart Seal. Inscribe on four sheets of black paper, bind with black threads, roll, and seal within a bamboo tube; burn in an open-air blazing fire. First apply cinnabar from the outside inward, then black ink from the inside outward. The administrative endorsement shall be written accordingly.\n\nThe character *zhòu* (胄) may be added within the *Zhen* Hexagram (☳), above the central vertical stroke.\n\nSeal Bureau. Seal Bureau. For the sixth deadline: the Urgent Memorial to the Lord of the Dharma, the Five Masters’ talisman follows the previous format, with administrative endorsements written accordingly. When inscribing the talisman, add the characters *rǔ wù* (乳雾) above the black dot. First apply cinnabar from the outside inward, then black ink from the inside outward. This seal is placed beneath the character *wèi* (胃), with further additions: 　　　again added, then 　further added beneath the central vertical stroke. Inscribe in black ink on black paper, bind with black threads, roll, and seal within a bamboo tube; burn in an open-air blazing fire.\n\nBy command of the Daoist Sect, the Purple Sovereign, Supreme Unity Heavenly Lord. Seal Bureau. Within the black dot: *rǔ wù* (乳雾).\n\nFor the seventh deadline: inscribe in black ink on black paper, bind with black threads, seal within a bamboo tube, and burn in an open-air blazing fire. First apply cinnabar from the outside inward, then black ink from the inside outward. The seal additions follow the sixth deadline, with the Urgent Summons for Thunder, Rain, and Thunderclaps applied accordingly. This proceeds from 　next added, then 　further added, with the Heart Seal and 　brushwork applied. Daoist Sect Seal.\n\nFor the eighth deadline: memorialize the Jade Emperor, present the family petition to the Mysterious Emperor, and urge Master Mulberry Lord. Apply the incantation purely in black ink on black paper, following the previous method. Upon completion, sequentially add the Heart Seal, the Jade Emperor’s Heart Seal. Take care not to over-add. Burn in an open-air location.\n\nAdd *guī tiān* (規天, \"Compass of Heaven\") for thunder’s motion; add *jǔ dì* (矩地, \"Square of Earth\") for clear stillness. Jade Sovereign Lord.\n\nThe Ninth Supreme Method: ○ 口 ○ talisman. Within the circles, add all previous elements in sequence.\n\nOnce the talismanic symbols are fully inscribed, enter the small [enclosure], repeatedly writing the Six Great Invocations to the Purple Sovereign Supreme Unity Heavenly Lord. The subtlety lies in oral transmission of ○○. Add the Five Lords, *lǒng què gù* (壟鶸雇). Recite the *Heavenly Scripture* while applying ink.\n\nThe Tenth Supreme Method follows the previous procedure. Recite the *Heavenly Scripture* while applying ink.\n\nFor the *zhòu*-character talisman:\n- **Praying for Rain**: Apply from top to bottom in three successive operations.\n  - *Raising Clouds*: lower annotation\n  - *Urging Clouds*: lower annotation\n  - *Raising Wind*: write in cinnabar on blue paper, insert into double ○\n  - *Urging Wind*: write in cinnabar on blue paper, insert into double ○\n  - *Ceasing Wind*: write in ink on yellow paper, insert into double ○, lower annotation\n  - *Urging Cessation of Wind*\n  - *Raising Thunder*: write in ink on yellow paper, insert into double ○, lower annotation\n  - *Urging Thunder*: write in cinnabar on red paper, insert into double ○, lower annotation\n  - **Praying for Rain**: write in ink on yellow paper, insert into double ○, lower annotation\n  - *Five-Colored Thread Binding Rain*: write in ink on yellow paper\n  - *Urging Thunder*: write in ink on black paper, insert into double ○, lower annotation\n  - *Thread Binding Rain*\n  - **Praying for Rain**: add the Seven Characters of the *Kui Dou* above\n  - **Praying for Rain**: add *Thunder* within the central prayer\n  - **Prayer with Thunder-Character Talisman** for rain’s subtle efficacy\n\n- *Rain Moon Water*\n- *Ceasing Mist and Clouds*\n- *Hail*\n- *Thunder*\n- *Wind*\n- *Raising Wind*: external\n- *Ceasing Wind*: internal\n\n**Flying-Character Talisman for Rain’s Subtle Efficacy**\n- **Praying for Rain**\n- *Raising Wind*\n- *Urging Thunder*\n- *Summoning Hail*\n- *Ceasing Mist and Clouds*\n\n**Brightening-Character Talisman for Rain’s Subtle Efficacy**\n- **Praying for Rain**\n- *Urging Rain*\n- **Prayer**\n- *Ceasing Wind*\n- *Ceasing Thunder*\n\n**Treasure-Character Talisman for Rain’s Subtle Efficacy**\n- *Treasure-Character*\n- Clouds, Rain, Snow\n- Lightning, Hail, Wind\n- Thunder, Mist\n- Wind, Thunder, Clouds, Rain\n- Lightning, Hail\n- *Urging*\n- *Striking Dragon Iron Tablet Talisman*\n\n**Eight General Talismans for Summoning Divine Generals**\n- Jade\n- Emperor\n- Decree\n- Command\n- Edict\n- Order\n- Thunder\n- Thunderbolt\n\n**Order-Character Talisman**\nRight: Order-Character Talisman.\nSeventh and eighth time limits.\nWrite in cinnabar on a *jiangzhen* incense tablet, and on the reverse, inscribe: \"Your subject [Name] summons and requests.\"\nBurn in a censer with a blazing fire.\nRecite the prayer:\n*\"Your subject, [Name], of such-and-such rank, respectfully petitions the Most Sacred Ancestral Master. Your subject, on behalf of [Person] of [Place], for [Matter], has repeatedly issued talismanic commands and dispatched summons to the Thunder Gods, and has also memorialized the Heavenly Court to request the descent of rain. Since then, no response has yet been received. With no alternative, your subject reverently follows the teachings of my master and humbly petitions the Qingwei [Dao], invoking [Name] Talisman and [Name] Envoys to swiftly transmit this plea upward. I earnestly beseech the compassion of my master to deign to grant this foolish request, bestow a sacred decree, and command the divine generals to manifest their mighty power. Awaiting the fulfillment of this prayer, may it be as originally decreed.\"*\n\nLight another incense burner, visualize the Thunder Gods arriving at the altar, then grasp the command to dispatch the generals.\nRecite:\n*\"By imperial decree, I dutifully summon the Thunderbolt, exerting utmost loyalty to uphold the Dao and its transformations. Reverently obeying the talismanic command, I lead the Thunder Gods to rumble with thunder, flash with lightning, pour forth rain, and shake with thunderclaps, widely bestowing universal blessings to succor and save all living beings. By the Jade Clarity’s sacred decree, delay not. Wherever the talismanic command arrives, let lightning descend and clouds rush forth, swiftly as the wind and fire couriers, in perfect accord with this luminous order.\"*\n\nIssue the command.\n\n**Talismanic Commands for Prayer and Ritual Use**\n- Wind\n- Clouds\n- Thunder\n- Rain\n- Lightning\n- Dragons\n\n**Urgent Commands for Ritual Use**\n- Mist\n- Thunderbolt\n- Gathering\n- Cessation\n\n**Great Brahma’s Water-Fire Primordial Heart Chapter**\nThe Mysterious Emperor’s taboo name—\n*Your subject [Name] issues the command.*\n**Tortoise**—*Your subject [Name] issues the command.*\n**Serpent**—*Your subject [Name] issues the command.*\n\n*End of the Upper Scroll of the Qingwei Divine Might Esoteric Methods*\n*Beginning of the Lower Scroll of the Qingwei Divine Might Esoteric Methods*\n\n**Expelling and Curing Major Malevolence**\n**First Stage:** Inscribe the talisman on yellow silk in cinnabar, then apply it to the petition or affix it to the celestial minister [Name]’s child, Weng Gong [Name]. Alternatively, have the master compose it in the form of an official proclamation. Roll it with silk thread and burn it within the tortoise. Copy the petition as written for dispatch.\n\nRecite the *Celestial Scripture*, applying cinnabar.\n*Seal with the officer’s mark.*\n\n**Second Stage:** Compose the proclamation in ink on black paper, affixing the seals of the Upper and Lower Capital Bureaus. First apply cinnabar from the outside inward, then ink from the inside outward. Inscribe within the circle, filling the space entirely:\n\n```\n          ☯\n          ☯ (interior)\n          ☯\n```\n\nAdd a third layer within the gaps.\n\n**Third Stage:** Inscribe in cinnabar on yellow silk, framing the text as an official proclamation. The master executes this to summon thunder and strike down malevolence. Follow the petition’s content, copying it according to the prescribed stages. At the center, add red dots:\n\n```\n          • (center)\n          ••• (surrounding)\n```\n\nRecite the *Celestial Scripture* with cinnabar application.\n\n**Fourth Stage:** Inscribe in cinnabar on yellow silk, bound with red thread, and burn with fierce fire where exposed to heaven. Proceed as before for the proclamation, adding the titles of Wind, Clouds, Thunder, Rain, and Lightning—henceforth to be used throughout. At the center, add red dots:\n\n```\n          • (center)\n          ••• (interior)\n```\n\n**Fifth Stage:** Inscribe in cinnabar on blue-green silk, bound with blue-green thread, placed in a bamboo tube, and burned in fierce fire where exposed to heaven. Compose the text before and after in proclamation form, executed by the master. Seal at the center:\n\n```\n          盖 (center)\n          • (interior)\n```\n\n**Sixth Stage:** Inscribe in ink on black paper, bound with black thread, placed in a bamboo tube. Proceed as before. Mark the following at the center:\n\n```\n          • (1)\n          •• (2)\n          ••• (3)\n```\n\n**Seventh Stage:** Inscribe in ink on black paper, bound with black thread, placed in a bamboo tube, and burned with fierce fire where exposed to heaven. Format before and after as a *Dongzhang* document. To the right, apply:\n\n```\n          獬 (right)\n          中 (center, filled)\n          涂了 (added)\n          加 (further addition)\n```\n\n**Left:** *Suān*\n**Addition**   **Seal Imprint**   **Addition**\n\nAll the above talismans are for subduing great demons and malevolent spirits, to be employed in urgent or critical situations. The following five Daoist writs are for summoning thunder to vanquish spirits—do not use them unless for exorcism. Utter the incantations with utmost reverence; never invoke them lightly. Bear this solemnly in mind.\n\n**Eighth Stage:** Issue the *Command Talisman*, with a directive appended below. Copy and execute according to the matter at hand. Inscribe in cinnabar and ink on paper, bind with thread, and burn in fierce fire where exposed to heaven. Alternatively, use large incense tablets, inscribing the directive on the reverse. Recite the *Heavenly Scripture*, first applying cinnabar, then ink.\n\n**Nine Heavens’ Thunderbolt Incandescent Thunder Iron Writ** (also called *Jade Writ*)\n**For Vanquishing Spirits**\n\n*\"Three Caverns’ Numinous Writs, emanating from the Great Void.\nHeavenly deities, earthly spirits, lords of the Three Realms, village deities, city gods, and local spirit-officials—all must obey and execute. Those who defy shall be slain and their corpses severed.\nSwiftly, swiftly, as in the statutes and commands!\"*\n\n**Reverse Inscription for Vanquishing Spirits:**\n*\"Qian descends as crystal, Kun aligns with the numinous sun and moon.\nEmbodying mountains and rivers, commanding thunder and lightning, celestial stars shatter evil.\nSmooth and steadfast, correct and upright.\nAs in the imperial decree.\"*\n\n**Right:** For suppressing major malevolent spirits, quelling floods, invoking dragon-led rains, and subduing flood dragons, water monsters, and aquatic specters.\nUse an iron plaque, one *chi* and two *cun* in length, three *cun* and two *fen* in width, and two *fen* in thickness. Inscribe the talisman in cinnabar on the front, with the *Three Caverns’ Decrees*. On the reverse, write the *\"Qian Descends as Crystal\"* decree or the rain-invoking writ. To suppress evil, place it where needed, and all disturbances will naturally dissipate. For deep pools where flood dragons or water monsters wreak havoc, or where malevolent ghosts seize lives to substitute for their own deaths, this plaque will subdue and pacify them, bringing tranquility to the land. If prayers go unanswered, inscribe the talisman as prescribed and cast it into dragon-inhabited pools or caves—clouds will gather, and rain will follow.\n\n**Primordial Beginning’s Hidden Sanskrit Great Thunderbolt Talisman**\nThe reverse inscription is as above. Use this to suppress minor demons, sprites, flood dragons, fish-dragons, and riverbank collapses—all will be subdued. For places plagued by spring specters, water monsters, or any malevolent spirits, employ this talisman, and the evil will flee a thousand *li* away.\n\n**Primordial Beginning’s Decrees**\n*Jade Clarity*\n*Highest Clarity*\n*Great Clarity*\n\nThese three talismans may, in urgent cases, be incorporated into the previous set of eighty, ninety, or one hundred talismans for use. The six talismans to the right are for subduing malevolence; in extreme cases, they may be employed additionally.\n\n**Primordial Beginning’s Thunder Talisman**\nFor prayers, wearing, healing illnesses, and dispelling malevolence—universally applicable.\n\n**Yang Thunder Seal**\n**Yin Thunder Seal**\n\n**One Qi Talisman**\n**One Qi Jade Talisman**\n*Qi* – For healing illnesses, ingest *qi*.\n*Qi* – For hastening childbirth, ingest to heal illness.\n\n**One Qi Treasure Talisman**\nFor suppressing the household.\n\n*Qi* – Shake, *niě*, I, [Name], respectfully receive the decree and act accordingly.\n*Hēi* – Universally applicable for prayers and healing.\n\n**Talisman for the Controller of Fate**\n**Talisman for the City God**\nFor healing illnesses caused by malevolence.\n\nFor healing illnesses caused by malevolence.\n\n*Diàn* – Helm\n*Zhòu* – Armor\n*Xíng* – Armor\n\nEach of the above single-character talismans serves a distinct purpose, and all will fulfill their intent as desired.\n\n**Zhao Zhang, Spirit of the Celestial Net,**\n**Lü Xuan, Spirit of the Earthly Net,**\nThe *Ding* Forceful Warriors of the Five Directions,\nThe Dharma-Protecting Guardian Kings of the Ten Directions,\nHasten to enclose the household of [Name].\nLet the malevolent ghosts causing misfortune hasten to my *Kuí-Gāng*.\n*Swiftly, swiftly, as decreed by the Emperor’s command, save!*\n\nThis incantation is to be inscribed within an iron talisman.\n\n*Liè* – Reverse inscription.\n\n**Heaven descends in radiance, Earth ascends in receptivity,**\n**Harmonizing with the numinous sun and moon,**\n**Embodying the forms of mountains and rivers,**\n**Commanding the movement of thunder and lightning,**\n**The celestial stars crush evil and malevolence.**\n*Persisting in rectitude, yielding and firm—*\n**All shall be as the proclaimed decree.**\n\n*Year* ___ *Month* ___ *Day* ___ *Hour* ___ *Proclaimed and enacted.*\n*Rank* ___ *Minister* ___ *Surname* ___ *Receiving the edict and executing its charge.*\n\n**The talisman on the right governs and suppresses demonic and inauspicious forces.**\n*Material:* Iron plate, nine *cun* in length, four *cun* in width, three *fen* in thickness, rounded at the top and squared at the base. Inscribe in the form of the Seven Stars, with seven characters arranged in their celestial pattern.\n\n**Two Talismans of Divine Potency**\n**神** *Divine* **烈** *Fierce*\n**灵** *Numinous* **冑** *Armor*\n*Talismanic characters for expelling and healing—wondrous in application.*\n\n**For Healing:**\n- *Yellow paper, inscribed in cinnabar, placed upon a person’s* **双** *(paired points)*\n- *Black paper, inscribed in ink, placed upon a person*\n\n**崔** *Cui* **崇** *Chong*\n- *Bound with five-colored threads*\n- *Bound with double black threads*\n\n**For Suppressing:**\n- *Place* **烈** *Fierce* *in the center to treat* **崇** *malevolent influences*\n- *Expels* **邪** *demonic forces*\n- *Reduces* **热** *heat*\n- *Dispels* **寒** *cold*\n\n**For Thunder in Treating Malevolence:**\n- *Employ* **雷** *Thunder* *to address* **邪** *demonic forces*\n- *Employ* **飞** *Flight* *to address* **邪** *demonic forces*\n- **斩** *Sever* **邪** *demonic forces* **and** **崇** *malevolent influences*\n\n**For Cooling in Treating Malevolence:**\n- *Employ* **凉** *Coolness* *to address* **邪** *demonic forces*\n\n**From the** *Primordial Heavenly Scripture*:\n- *First:* **急** *Urgent*\n- *Second:* **速** *Swift*\n- *Third:* **令** *Command*\n*These may be appended to any talisman.*\n\n**Within these Three Invocations, employ the oral incantation:**\n- *Talisman for Resolving Grievances and Subduing Demons*\n- *Talisman for Mowing Down Demons and Fumigating Illness*\n- *Talisman of the Cavernous Void’s Five Thunders for Seizing the Hun and Restoring the Po*\n\n**For talismanic use, inscribe the person’s name:**\n- *To treat* **狂邪** *raving malevolence* **—** *Example:* **张大壮** *Zhang Dazhuang*\n- **斩邪** *Severing demons* **—** *For destroying temples and eliminating inauspicious forces*\n- **熏邪** *Fumigating demons* **—** *For use*\n\n**Talismans of Divine Potency:**\n- *Upper Clarity’s* **烈** *Fierce* *Talisman*\n- *Heavenly One’s Jade Talisman*\n- **烈** *Fierce* *— for fumigating demonic illness*\n- **炁** *Qi* *— for treating illness when ingested*\n\n**Purple Empyrean Jade Thunder Talisman:**\n- **雷** *Thunder* *— for supplicatory healing*\n\n**Talismans for Summoning and Commanding the Spirits:**\n- **敛** *Gather* **苟某** *Gou [So-and-so]*\n*Talisman to summon the Upper Clarity’s Divine Fierce Lords of the Two Thunders, Gou and Bi, to descend swiftly.*\n- **毕某** *Bi [So-and-so]* **臣某** *Your servant, [So-and-so], hereby invokes.*\n\n**Right Talisman:**\n*Silently recite the Heavenly Scripture, inscribe the names of the Two Thunder Lords.*\n- *Upper Clarity’s Divine Fierce Five Thunder Flight Talisman*\n- **飞** *Flight* *— for general use*\n\n**Divine Fierce Inner Petition:**\n- **狻** *Suān* **獬** *Xiè* *— the two spirit taboos; for minor matters, must not be used lest one incur censure*\n\n**Primordial Talisman of Mandate for Commanding the Myriad Spirits:**\n- *For supplicatory healing, general use*\n- **靈** *Numinous*\n\n**Inner Petition:**\n- **坤靜** *Kun’s Stillness* **艮止** *Gen’s Halt*\n\n**Primordial Mysterious Scripture’s Talisman for Urging the Myriad Spirits:**\n- **行** *Enact* *— for supplicatory healing, general use*\n\n**Talisman of Incense Seal for Summoning the Myriad Spirits:**\n- *Primordial Ancestor’s Black, Flying Heavenly Messenger, Wang Fu.*\n\n**Talisman for Summoning the Myriad Spirits:**\n- *[For] such-and-such a matter*\n- **信** *Faith* **香** *Incense* *— inscribe on incense slips*\n\n**Yin-Thunder Spirit Lord Qiong, Yang-Thunder Spirit Lord Qi:**\n- *These two lords and their messengers are the essence of sun and moon, the regulators of thunder and lightning. Their radiance shines within, their brilliance illumines below. When employed in the ten directions, response is immediate.*\n\n**Yin-Yu** **Yang-Tian**\n- *Add the two characters \"Yin\" and \"Yang\" to the right: use \"Yang\" before noon, \"Yin\" after noon. For prayers, healing, hastening childbirth, and the like, response is immediate.*\n\n**Yin-Chong** **Yang-Chang**\n- *To the right: \"Yin\" and \"Yang\" for summoning thunder and lightning, praying for clear skies or rain, general use. Employed in the same purification rites.*\n\n**Middle Petition:**\n- *At the hour of noon, visualize nine-colored rays of light. From below the navel, generate warmth that ascends between the brows, golden light of nine hues filling the altar courtyard, controlling souls and summoning perfected beings.*\n\n**Yang Guo, Envoy of Mandate from the Pure Tenuity Immortal Capital:**\n- *Turban of soaring heaven, horned eyes, a countenance like a beautiful woman, clad in golden armor and black robes, holding a staff and riding a green dragon.*\n\n**Summoning Talisman** **Urging Talisman**\n- *To the right: silently recite the summoning incantation \"Dun Xuan Yang Yi Yu.\"*\n\n**Pure Tenuity Immortal Capital’s Talisman of Mandate for Thunder and Lightning:**\n- **飛** *Flight* **速** *Swift* **與** *Grant*\n\n**General Summoning Talisman for Envoy-Talismans**\n*Talisman-Summon: [Name] Envoy-Talisman, descend swiftly. Your servant [Name] receives the summons.*\nTo the right: silently recite the summoning incantation *\"Zhi Dan Yi Qin.\"*\n\n**General Summoning Talisman (Incantation as before)**\n*Talisman-Summon: [Name] Envoy-Talisman, descend swiftly. Your servant [Name] receives the summons.*\n\n**Land Spirit Summoning Talisman**\n*Talisman-Summon: Righteous Spirit of the Local Land, descend swiftly. Your servant [Name] receives the summons.*\n**Pure Capital’s Mandate Envoy Tian Zhong.**\nSummoning incantation: *\"Dun Yang Xuan Bian Yu.\"*\n\n**Summoning Talisman**\n*Talisman-Summon: [Name] Envoy-Talisman, descend swiftly. Your servant [Name] receives the summons.*\n**Nine Heavens’ Thunder-Fire Decree Envoy Chen Rongchen.**\nSummoning incantation: *\"Fang Qi Yu.\"*\n\n**Summoning Talisman**\n*Talisman-Summon: [Name] Envoy-Talisman, descend swiftly. Your servant [Name] receives the summons.*\n**Swift Envoy Yang Jie.**\nSummoning incantation: *\"E Qie.\"*\n\n**Summoning Talisman**\n*Talisman-Summon: [Name] Talisman, descend swiftly. Your servant [Name] receives the summons.*\nTo the right: governs all thunders of the Three Realms, all scriptures, all Daoist esoteric texts.\nAlso called *\"Azure Void Supreme Dao,\"* used within the right-seat circle.\n\n**Primordial Qi Incense Talisman of the Origin**\nInscribe upon incense, silently invoke the Thunder Marshal and Generals.\n\n**Primordial Qi Mandate for Subtle Dao’s Service**\nTo the right: commands the Three Qi and all great thunder deities of the Three Realms, with none beyond its reach, none beyond its embrace.\n\n**Primordial Mandate Talisman for Commanding Myriad Deities of All Heavens**\n*Decree:*\n**General Summoning Talisman for All Departmental Envoy-Talismans**\n\n**Talisman-Summon: [Name] Envoy-Talisman, descend swiftly. Your servant [Name] receives the summons.**\n\n**Format for Official Documents Following Talismans**\n*Mandate for Official Generals and Envoy-Talismans, to convey memorials, petitions, and memorialized documents.*\n\n*Mandate-Talisman for Commanding Thunder Deities’ Service*\n\n**General Mandate**\n*Reverse Inscription:*\n**Decree**\n**Mandate for Summoning the Three Qi’s Thunder and Lightning Talismans**\n*Heart Incantation: \"Yi Hong Chang\"*\n\n**Talisman-Summon: [Name] Marshal, descend swiftly. Your servant [Name] receives the summons.**\n\n**Summoning Talisman for the Four Direct Envoys**\n**City God’s Official Document-Talisman**\n**Life-Registry Talisman**\n*First the Ancestral Talisman, then the Latter Talisman.*\n*First the Monthly Talisman, then the Latter Talisman.*\n*Two \"Swift\" Talismans to hasten all matters.*\n*Two \"Urgent\" Character-Talismans to hasten all matters.*\n\n**Right Talisman from the *Dongjing* of the Pure Subtlety Heavenly Perfected**\nIf in years of locust plagues, floods, or failed harvests, use this to petition the Great Gods of the Sprouts, as well as the City Gods and Earth Gods.\n\n**Talisman of the Abyssal Divine Spirits**\nRecite the secret incantation of the Abyssal Divine Spirits and inscribe it.\n\n*Thunder’s Pivot and Axis, governing all most wondrous and secret texts of the Three Realms.*\nThis talisman does not command generals to respond; passing flying thunder deities, upon seeing it, neither seal nor endorse it without its mark.\n\nFor all practices, first gather spirit-incense of fine quality, inscribe in cinnabar on yellow paper, in cinnabar on green paper for urgency, or in white on black paper for pressing matters. Burn where Heaven is visible, and response will surely come.\n\nWithin the right talisman, add *Wind, Clouds, Thunder, Rain, Lightning* above.\n\n*Permitted by the Perfected Lord of the Wondrous Dao of Purple Radiance and Vermilion Splendor, Xu Ying.*\nVisualize the Perfected Lord within a halo of light; universally applicable.\n\n*Wind*\n*Cloud*\n*Thunder*\n*Rain*\n*Mist*\n*Lightning*\n*Snow*\n*Hail*\n*Clear Skies*\n\nCloud, Rain, Thunder, Cloud, Thunder, Wind, Clear Skies, Hail—within the circle, employ the Primordial Unified Qi to command the Thunder Bureau’s seal.\n\nFirst for prayer, second for urgency, third for trust, fourth for governance, fifth for audience with the Origin.\n\nInscribe above incense, or on paper, or virtually within golden light. Within the method, these are the most wondrous and essential:\nThe images of old yin and old yang, Heaven and Earth, Qian and Kun;\nThe images of young yin and young yang, mouth and moon, Kan and Li.\n\nAbove red and below black: Fire-Water, Not Yet Crossed.\nAbove black and below red: Water-Fire, Already Crossed.\nTo treat illness and eradicate evil, add to the talisman.\n\nFive Wells within.\n\nQi-Character Talisman:\n*Qi* – Urgency for birth, treatment of illness.\n*Zuo* – Urgency for birth.\n*Cinnabar Splendor Jade Protection Divine Chapter* – Protects the fetus, hastens birth.\n*Wu* – For postpartum.\n*Yin* – Curved.\n*Yan* – Prolongs labor.\n*Postpartum Talisman for Resolving Grievances and Subduing Evil* – For swelling.\n*Five Origins Talisman for Protecting Life*:\n*Cuo* – Hastens birth.\n*Hastens birth*.\n*Guo* – *Guān-Mài* Unblocking Talisman.\n*Bi* – Red secondary strokes.\n*Postpartum Talisman for Salvaging Misfortune and Blood* – *Jian He* and *Ying*.\n*Talisman for Treating the Hundred Pregnancy Ailments*.\n*One Qi Talisman*.\n*Three Qi Talisman* – Protects the fetus.\n*Thunder* – For consumptive diseases, parasitic infestations, and the Underworld Controller: burn.\n*Talisman for Tigers, Flood Dragons, Serpents, Weapons, and Poison*:\n*Tiger*.\n*Flood Dragon*.\n*Weapons*.\n*Tiger-Serpent*.\n\nRight Talismans—when worn upon entering mountain forests, recite the announcement incantation: *Oṃ Hūṃ Tiṇ Ṇipi Phaṭ Tiṇ Uṣṇīṣa Phaṭ Tiṇ*. The *Zhòu*-character talisman has wondrous applications and treats all diseases.\n\nLivestock\nDiarrhea\nTreats malaria\nHeart pain\nAbdominal pain\nLumbar pain\nKidney *qi*\nThroat\nLivestock calamities\nTreats pestilence\nTreats pestilence\nWhole-body pain\nBoth hands\nBoth feet\nSweating\nEye pain\n\n*Qingwei* Wondrous Dao *Kaitian* Jade Talisman\nEnclose the right talisman with a circle, two *cun* and four *fen* in both width and height. Place the *Tianbao Daozong* seal at its head and tail. Following the text, inscribe the rank and list the masters in proper form.\n\nTaboo names within the Three Heavens:\n*Qian*\n*Yuan*\n*Dao*\n\n*Qingshi Xiangxin* Talisman\nSummon the master\nThank the marshal\n\nIncantation for the right talisman’s core: *Longyu Zhi*.\n\nHeaven\nEarth\nWater\n*Kaitian*\n*Tongyuan*\n*Feilei*\n\n*Yuanshi Bianyi Wukai* Talisman\n*Chedi*\n\n*Qingshi Xiangxin* Talisman\n\nThe Dark Emperor\nHeavenly Marshal\nEver\n*Chang Shouxue Xiangxin* Talisman\nSummon the Marshal’s Attendants\nIncantation for the right talisman’s core: *Wanjun Shouming Hong*.\n\n*Qingshi Tongyong Xiangxin* Talisman\nSummon\nIncantation for the core: *Jiangyu Zhi*\nSummon the Marshal\nProstrate and bow\n\nTen-Character Heavenly Scripture\nNine\nHeaven\nResponse\nPrimordial\nThunder\nSound\nUniversal\nTransformation\nHeavenly Venerable\nSerene\nPure\nFollow\nOriginal\nAllotment\n\nThe three talismans on the right may be used to pacify, suppress, and treat illness.\n\nHeavenly\nMovement\nAlready\nPassed\nMessenger\nMust\nKnow\n\nThe eight talismans on the right, when placed at year’s end to pacify and suppress the household, may repel pestilential evil.\n\nFifth\nMonth\nFifth\nDay\nHeaven’s\nMidpoint\nFestival\nOfficial\nCalamities\nMouth\nTongue\nAll\nEliminated\nEradicated\n\nThe fourteen talismans on the right, when inscribed in vermilion on the fifth day of the fifth month, may be used to pacify, suppress, drive away inauspiciousness, and swiftly attain spiritual resonance.\n\nFortune\nLongevity\nHealth\nPeace\n\nThe four talismans on the right may pacify and secure the household.\n\nSever\nEliminate\nInauspiciousness\n\nThe four talismans on the right may pacify, suppress, and repel evil.\n\n*Qingwei* Summons to the Myriad Spirits of the Cavernous Scripture\nController of the Forehead\n\nWith reverence, [Name] respectfully executes this *Ximing* Cavernous Scripture for [Matter] on behalf of [Person]. The Cavernous Scripture above petitions:\n\nTo [Such-and-such] Thunder Deity—how shall the ritual be performed?\nSwiftly comply, in accordance with the primordial-descended Cavernous Scripture’s statutes and decrees.\nProclaimed on the [Day] of [Month], [Year], at the hour of [Time].\nThe assembled masters and officers dispatch the generals.\nAs prescribed.\n\n*Jieji Feilong* Cavernous Scripture\nThis scripture, inscribed on brick, tile, or iron plate, is to be lowered into the dragon pool, secured with rope. If spiritual resonance is felt upon immersion, retrieve it swiftly.\n\nSummons and Dispatch Talisman for the Two Marshals\nThis talisman is activated by the incantation: *Yulou Yuzha*.\n\n*Qingwei* Celestial Treasure House Epistle\nThe dharma-heir, great-grandson of the lineage, [Name], today having thrice purified with ink and ninefold bathed, prostrates in reverence.\n\nThis letter is respectfully presented before the Jade Void Preceptor, the August Supreme Heavenly Venerable One, Lord of the Primordial Unity.\n\nI, a mere speck of dust, a minor functionary within the Dao, humbly rely upon the shelter of the Way’s grace, serving day and night in the thunder ranks, yet harboring boundless anxiety over my inability to repay such favor.\n\nRecently, on behalf of [Person] from [Place] regarding [Matter], I received their plea, which could not be refused. Reflecting on my transmission of the dharma lineage, I recognize that in my practice, my virtue is meager while my responsibilities are weighty, my transgressions many and my merits few. Now, the urgency of this matter brooks no negligence.\n\nI humbly implore the compassion of the Dao, that it may be as the primordial decree. This humble letter is respectfully submitted for your attention, beseeching your merciful regard. May the dharma lineage be specially favored, and may the imperial court be petitioned to issue a decree of deliverance.\n\nProclamation is hereby issued to [Name] Thunder Deity, setting the appointed time as the [Day] of this month at [Hour], to descend to [Location] and render due retribution. May this ensure the flourishing of the Great Dao and the turning of humans and heavens toward reverence.\n\nI, in my temerity, have trespassed upon imperial majesty, and am overwhelmed with trepidation. Humbly I implore your pardon, leaving further words unspoken.\n\nRespectfully submitted on the [Day] of the [Month] and [Year] by [Name], humble descendant of the dharma lineage.\n\n**Outer Seal:**\nThis letter is of urgent and confidential matter—its contents must not be lightly disclosed. By the true mandate of the Emperor, communion through prayer is sought.\n\nThe words herein are few, written in ink on plain paper, sealed with a horn closure and bound with five-colored silk threads. Entrusted to the Thunder Lords Gou and Bi for transmission and presentation.\n\n*End of the Lower Scroll of the Qingwei Divine and Mighty Secret Methods*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "清微神烈秘法 经名：清微神烈秘法。 撰人不详。 二卷。 底本出处：《正统道藏》洞真部方法类。 清微神烈秘法卷上 雷奥秘论 夫清微者，以象言之，乃大罗天上郁罗萧台玉山上京上极，元上大罗玉清诸天中之尊也。 肇自混沌溟涬鸿蒙未判之先，大梵大初之境，即元始至尊之所治也。 乃一炁开明祖劫，是谓天根。 且清微法者，即神霄异名也。 实道中之妙法。 道乃万法之祖，雷乃诸雷之尊，非法中之法也。 故禀元始一炁，统御万灵。 复有梵清景三炁之殊像，绛碧玉琅丹景紫太神之别名。 法中雷符玉章天经，皆浩劫之初，梵炁自然结成於太空之中。 昔元始下降，乃命天真皇人，按笔以书其文，字广长一丈，藏於紫微上宫玉京金阙，命五老上帝掌之。 上品灵书，以保制劫运，生天立地，运度水火，开化神明，为万道之宗，四万劫一传，以示天人也。 中品书，藏於五岳四渎龙宫海藏，命各神掌之，以安镇岳渎，开道泉源，召龙负水，役使神霄仙众，亦四万劫一传，以示神人也。 下品灵书，则应世宗师，心心相授，口口相传，与天长存，祈天福国，弘道化人，役使雷霆，坐召风雨，斩灭妖邪，救济旱涝，拯度幽显，赞助皇民，即今人间清微雷法妙道是也。 实与诸法不同，明达上人，一闻顿悟。 盖五行以庚为主，而五炁以一为祖，万法以心为正。 其法简易，不若有为，不落无作，不贡存想，无泥虚文，无祭杞，无祷祝，若此比诬谄也。 其妙乃以吾神合彼神，吾灵合彼灵，儒书谓致知格物是矣。 但於平日行住坐卧四威仪中，必要收敛身心，万绿顿息，存无守有，专一无二。 守无所守，存无所存，一念真常。 如在太极未判混沌之先，虚空圆光之内，一窍之中。 其大无外，其小无内。 太极未判，混沌一般，身心俱无，止在太虚一点，灵明自然，宏照十方，心田无秽，性地绝尘，久则寂然不动，感而遂通。 到此田地，一举目，一动念，将帅洋洋乎，如在其左右。 静则是道，动则是法，口启心存，立彰昭格。 即此乃大道之根，万法之本。 惟其始终，精一不二，念念相续於四威仪中，入乎无间，是谓达人能事毕矣。 师派 祖师，清微教主高元宸照紫虚太初元　君，臣魏华存。 祖师，万变九真玉仙圣母太素元君，臣　庄旭。 祖师，三天圣师泰玄王相真君，臣张道　陵。 祖师，高明大使天机内相真君，臣许逊。 清微元上侍宸金阙昭凝洞清通化妙道　元君，臣祖舒。 三天侍经龙光道明元君，臣姚庄。 三天侍御紫英玉惠元君，臣高奭。 洞阳上宰清虚西华真人，臣华英。 神霄玉枢使青城通惠真人，臣朱洞光。 云山保一真人，臣李少微。 眉山混隐真人，臣南毕道。 碧水雷渊真人，臣黄舜申。 清微冲道使，臣叶云莱。 清微冲和使，臣张道贵。 冲元雷使，臣张守清。 紫玄散吏，臣张守一。 圣位 主法紫皇太乙天君李哲。 服色如常。 清微主帅上清神烈阳雷神君苟留吉。 金冠，黑面，三目，赤发，金甲，朱衣，朱履，手执金锤钻。 清微主帅上清神烈阴雷神君毕宗远。 披发，面赤，皂衣，金甲，跌足，手执铁简。 习定坐法",
      "translated_text": "**The Esoteric Divine Thunder Rites of Qingwei**\n\n**Title:** *The Esoteric Divine Thunder Rites of Qingwei*. Author unknown. Two fascicles. Base text from *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, Methods Category.\n\n---\n\n### *The Esoteric Divine Thunder Rites of Qingwei, Fascicle One*\n#### *Arcane Discourse on Thunder*\n\nThe Qingwei, when described by analogy, is the most revered among the myriad heavens of the Great Luo, the Jade Capital of the Yu Mountain atop the Yu Terrace of the Uppermost Great Luo, and the Jade Purity of the Primordial Uppermost Great Luo. It originates before the division of the primordial chaos, the vast expanse, and the undifferentiated hồng-mông, within the realm of the Great Brahmā and the Great Beginning—precisely where the Most High Primordial Lord presides. It is the luminous inception of the primordial *qi* at the dawn of the ancestral kalpa, known as the Root of Heaven.\n\nThe Qingwei Method is none other than the Divine Empyrean under another name, a sublime practice within the Dao. The Dao is the ancestor of all methods, and Thunder is the sovereign of all thunders—not merely a method among methods. Thus, it inherits the primordial *qi* of the Primordial Lord, governing the myriad spirits. It further manifests distinct forms of the Three *Qi* of Brahmā, Pure, and Radiant, bearing alternate names such as the Crimson, Azure, Jade, Vermilion, Purple, and Supreme Divine.\n\nWithin this method, thunder talismans, jade scriptures, and celestial canons all naturally coalesced from the Brahmā-*qi* in the vastness of the firmament at the dawn of the kalpa. In ancient times, the Primordial Lord descended and commanded the Heavenly Perfected Sovereign to transcribe their texts with a brush—each character a *zhang* in length—concealing them within the Golden Portal of the Jade Capital of the Purple Tenuity’s Upper Palace, entrusted to the Five Elder Thearchs. These Upper Grade Spirit Scriptures serve to regulate the kalpic cycles, give rise to heaven and establish earth, govern the movements of water and fire, enlighten the divine, and stand as the origin of all Daoist methods. Transmitted once every forty thousand kalpas, they are revealed to the celestial and human.\n\nThe Middle Grade Scriptures are concealed within the dragon palaces and oceanic treasuries of the Five Marchmounts and Four Watercourses, entrusted to their respective deities. They stabilize and pacify the marchmounts and watercourses, open the sources of springs, summon dragons to bear water, and command the divine hosts of the Divine Empyrean. Transmitted once every forty thousand kalpas, they are revealed to the divine and human.\n\nThe Lower Grade Spirit Scriptures are transmitted among the lineage masters of the world, passed heart-to-heart and mouth-to-mouth, enduring as long as heaven itself. They pray for celestial blessings upon the state, propagate the Dao to transform the people, command thunder and lightning, summon wind and rain at will, vanquish malevolent spirits, alleviate drought and flood, deliver the living and the dead, and aid the sovereign and the people. Such is the wondrous Dao of the Qingwei Thunder Rites practiced in the world today. Truly unlike any other method, the enlightened, upon hearing it once, attain sudden realization.\n\nFor the Five Phases, *geng* is sovereign; for the Five *Qi*, the One is the ancestor; for the myriad methods, the mind is the standard. This method is simple and effortless, neither clinging to deliberate action nor falling into non-action. It rejects forced visualization, hollow formalities, sacrifices, prayers, and supplications—all of which are but flattery and deception. Its wonder lies in the fusion of one’s spirit with the other spirit, one’s numen with the other numen, which the Confucian classics call \"extending knowledge to investigate things.\"\n\nIn the daily conduct of the four dignified postures—moving, dwelling, sitting, and reclining—one must gather and restrain body and mind, instantly stilling the myriad thoughts. Abide in non-abiding, preserve non-preservation, and maintain an unbroken true thought. As if in the undivided chaos before the emergence of the Supreme Ultimate, within the empty void and the circular radiance, there is a single aperture—vast without exterior, minute without interior. Before the Supreme Ultimate divided, chaos was uniform; body and mind dissolve, leaving only a single point in the Great Void. The numinous luminosity naturally illumines the ten directions. The field of the heart is unstained, the ground of nature free from dust. With time, stillness prevails, and responsiveness arises spontaneously.\n\nAt this stage, with a single glance or thought, the generals and marshals abound, as if present at one’s side. In stillness, it is the Dao; in motion, it is the method. With the mouth opened and the heart preserved, clarity and resonance manifest immediately. This is the root of the Great Dao, the origin of the myriad methods. Only through unwavering singularity from beginning to end, with thoughts unbroken in the four dignified postures, does one enter the unobstructed—this is the accomplishment of the perfected.\n\n---\n\n### *Lineage*\n\n**Patriarchs:**\n- The Qingwei Patriarch, High Yuanchen Zhaoxu Purple Void Primordial Sovereign, Minister Wei Huacun.\n- The Patriarch, Ten-Thousand-Transformations Nine Perfected Jade Immortal Holy Mother Primordial Sovereign, Minister Zhuang Xu.\n- The Patriarch, Three Heavens Sage Master Supreme Mystery King-Phase Perfected Lord, Minister Zhang Daoling.\n- The Patriarch, Illustrious Great Envoy Heavenly Mechanism Inner Minister Perfected Lord, Minister Xu Xun.\n\n**Perfected Lords:**\n- Qingwei Primordial Upper Attendant Chen Golden Portal Radiant Congealed Cavern-Pure Transformative Wondrous Dao Primordial Sovereign, Minister Zu Shu.\n- Three Heavens Attendant Scripture Dragon Radiance Dao Illumination Primordial Sovereign, Minister Yao Zhuang.\n- Three Heavens Attendant Imperial Purple Splendor Jade Wisdom Primordial Sovereign, Minister Gao Shi.\n- Cavern Yang Upper Minister Pure Void Western Florescence Perfected, Minister Hua Ying.\n- Divine Empyrean Jade Pivot Envoy Green City Penetrating Wisdom Perfected, Minister Zhu Dongguang.\n- Cloud Mountain Preserving Unity Perfected, Minister Li Shaowei.\n- Eyebrow Mountain Concealed Perfected, Minister Nan Bidao.\n- Azure Water Thunder Abyss Perfected, Minister Huang Shunshen.\n- Qingwei Impelling Dao Envoy, Minister Ye Yunlai.\n- Qingwei Impelling Harmony Envoy, Minister Zhang Daogui.\n- Impelling Primordial Thunder Envoy, Minister Zhang Shouqing.\n- Purple Mystery Dispersing Clerk, Minister Zhang Shouyi.\n\n**Divine Ranks:**\n- **Chief Ritual Master:** Purple August Supreme Unity Heavenly Lord Li Zhe. Attire as usual.\n- **Qingwei Chief Marshal:** Upper Clarity Divine Mighty Yang Thunder Divine Lord Gou Liuji. Golden crown, black face, three eyes, red hair, golden armor, vermilion robes, vermilion boots, wielding a golden hammer and drill.\n- **Qingwei Chief Marshal:** Upper Clarity Divine Mighty Yin Thunder Divine Lord Bi Zongyuan. Disheveled hair, red face, black robes, golden armor, barefoot, wielding an iron staff.\n\n### *Meditation and Seated Practice*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1233,
      "start_sentence": 0,
      "end_sentence": 57,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.02458310127258,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "凡静坐定息之间，如在太极混沌未判之先，虚空圆光之内。 又如在圆光一窍之中，太极未判，一般身心俱无，却自存一点灵光，非中非外，澄澄湛湛，宏照十方，天地莫测。 早晚坐静，皆是行用。 祈梼建四瞑外坛式 外四角水瓮，列四瞑位，各一香案。 法中雷帅雷神将吏， 次班左。 籍师保一李真人。 明师清虚华真人。 真师明道元君。 圣师昭凝元君。 元师紫虚元君。 香花烛供养。 圣师太素元君。 玄师紫英元君。 经师通惠元若。 度师混隐南真人。 次班右， 法中副帅雷神符使。 符命－宗 解秽符",
      "translated_text": "In all moments of seated meditation and regulated breath, one abides as if in the primordial state before the division of the Great Ultimate and the chaos, within the vast emptiness and the radiant orb of light. Or again, as if dwelling within the single aperture of that orb of light, where the Great Ultimate remains undivided—body and mind utterly dissolved, yet a single spark of numinous light persists, neither within nor without, limpid and profound, illumining the ten directions in boundless radiance, unfathomable even to heaven and earth. Morning and evening seated meditation alike serve as practice and application.\n\n**Prayer Ritual: Establishing the Outer Altar of the Four Directions**\nAt the four outer corners, place water jars, arraying them at the four directional positions, each with an incense table.\n\n**Left Rank of the Ritual:**\n- Thunder Marshals, Thunder Divine Generals, and Clerks of the Dharma\n- Register Master Protector Li, the Perfected\n- Illuminating Master Qingxu Hua, the Perfected\n- Perfected Master Mingdao Yuanjun\n- Sage Master Zhaoning Yuanjun\n- Primordial Master Zixu Yuanjun\nOfferings of incense, flowers, and candles.\n\n**Right Rank of the Ritual:**\n- Sage Master Taisu Yuanjun\n- Mystic Master Ziying Yuanjun\n- Scripture Master Tonghui Yuanzhe\n- Salvation Master Hunyin Nan, the Perfected\n- Deputy Marshals of the Dharma, Thunder Divine Talisman Envoys\n- Talisman Mandate: *Zong*\n- Purification Talisman: *Jiehui Fu*",
      "overlap_context": "st Supreme Unity Heavenly Lord Li Zhe. Attire as usual.\n- **Qingwei Chief Marshal:** Upper Clarity Divine Mighty Yang Thunder Divine Lord Gou Liuji. Golden crown, black face, three eyes, red hair, golden armor, vermilion robes, vermilion boots, wielding a golden hammer and drill.\n- **Qingwei Chief Marshal:** Upper Clarity Divine Mighty Yin Thunder Divine Lord Bi Zongyuan. Disheveled hair, red face, black robes, golden armor, barefoot, wielding an iron staff.\n\n### *Meditation and Seated Practice*",
      "start_char": 1233,
      "end_char": 1502,
      "start_sentence": 58,
      "end_sentence": 78,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.181311130523682,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "清 净 右二符，解秽、祈祷、治病、治酒、洗眼通用。 香信符丹书片香上，或纸书。 臣某顿首启奏 右符，默念隆育智。 三遍心忖呎涂。 ○ 默奏帝真一。 召二雷君符 苟某　符召 清神烈苟毕雷君速降 毕某　 臣 某 奉 召 右符，用天经涂二帅讳。 净坛符 清 　　帝 登 灵 祝应 敕 速 召 信 召四瞑符 巽 玉雷皓师君 人水瓮令符 丁文广 龟首人身 坤 金精流光君　　 人水瓮令符 丁文行 人首蛇身 艮 洞阳幽灵君　　 人水瓮令符 丁文达 人首鱼身 乾 雷华太皇后　　 人水瓮令符 丁文惠 人首龙身",
      "translated_text": "**Purification and Two Talismans on the Right**\nThe *Jiehui* and *Qidao* talismans—used for purification, prayer, healing, wine consecration, and eye-washing—are universally applicable. The *Xiangxin* talisman may be inscribed in cinnabar on incense tablets or written on paper.\n\n**Minister [Name] bows and respectfully petitions:**\nFor the talisman on the right, silently recite *\"Longyu Zhi\"* three times while tracing it in the mind and exhaling.\n\n○ Silently invoke the *Imperial Perfected Unity*.\n\n**Talisman to Summon the Two Thunder Lords**\n*Gou [Name] Talisman-Summons*\nSwiftly descend, *Qingshen Lie Gou Bi* Thunder Lord!\n*Bi [Name]*\n\n**Minister [Name] respectfully summons:**\nFor the talisman on the right, use the *Celestial Scripture* to trace the taboo names of the Two Marshals.\n\n**Purification Altar Talisman**\n*Qing*\n*Di Deng Ling Zhu Ying*\n*Chi*\nSwiftly summon by command!\n\n**Talisman to Summon the Four Dark Lords**\n☴ *Yulei Haoshi Jun* – Command to enter the water jar\n*Ding Wenguang* – Tortoise-headed, human-bodied\n\n☷ *Jinjing Liuguang Jun* – Command to enter the water jar\n*Ding Wenxing* – Human-headed, serpent-bodied\n\n☶ *Dongyang Youling Jun* – Command to enter the water jar\n*Ding Wenda* – Human-headed, fish-bodied\n\n☰ *Leihua Taihuanghou* – Command to enter the water jar\n*Ding Wenhui* – Human-headed, dragon-bodied",
      "overlap_context": "e Perfected\n- Illuminating Master Qingxu Hua, the Perfected\n- Perfected Master Mingdao Yuanjun\n- Sage Master Zhaoning Yuanjun\n- Primordial Master Zixu Yuanjun\nOfferings of incense, flowers, and candles.\n\n**Right Rank of the Ritual:**\n- Sage Master Taisu Yuanjun\n- Mystic Master Ziying Yuanjun\n- Scripture Master Tonghui Yuanzhe\n- Salvation Master Hunyin Nan, the Perfected\n- Deputy Marshals of the Dharma, Thunder Divine Talisman Envoys\n- Talisman Mandate: *Zong*\n- Purification Talisman: *Jiehui Fu*",
      "start_char": 1502,
      "end_char": 1813,
      "start_sentence": 79,
      "end_sentence": 107,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.741206884384155,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "催召四冥符 巽信 丁文广　　完 催人水符 坤令 丁文行　　典 催人水符 艮奔 丁文远　　飞 催人水符 乾捷 丁文恵　　疾 催人水符 祈梼建内雷坛式 左班，某法主帅雷神符使功曹。 清微演教诸大师真。 净水 九天应元雷声普化天尊。 香花烛， 符命 雷霆高上昭运至真。 右班，某法副帅雷神功曹将吏。 外坛各列一案。 召令，立天门，朝地户。 东方风雨雷电之神，东方追某使者。 南方风雨雷电之神，南方追某使者。 西方风雨雷电之神，西方追某使＇者。 北方风雨雷电之神，北方追某使者。 中央风雨雷电之神，中央追某使者。 ． 建坛符命",
      "translated_text": "**Urgent Summons of the Four Dark Talismans**\n☴ *Swift Talisman* – *Ding Wenguang* – *Complete*\n*Urgent Water-Jar Talisman* – *Kun Command* – *Ding Wenxing* – *Steadfast*\n*Urgent Water-Jar Talisman* – *Gen Rush* – *Ding Wenyuan* – *Swift*\n*Urgent Water-Jar Talisman* – *Qian Victory* – *Ding Wenhui* – *Rapid*\n\n**Prayer and Altar Construction for the Inner Thunder Platform**\n*Left Rank:*\n[Name], *Commander-in-Chief of the Thunder Deities, Talisman-Messenger, and Merit Officers.*\nThe Perfected Masters of the Qingwei Tradition, Expounders of the Teachings.\n\n*Purification Water*\n*Nine Heavens Responding to the Primordial, Thunder-Voice Universal Transformation Heavenly Worthy.*\n\n*Incense, Flowers, Candles*\n*Talisman Mandate*\n*Lofty Thunder, Supreme Illustrious Destiny, Utmost Perfected.*\n\n*Right Rank:*\n[Name], *Deputy Commander of the Thunder Deities, Merit Officers, and Generals.*\n\n*Outer Altar:*\nEach station arrayed with one table.\n\n*Summons Decree:*\nErect the Gate of Heaven, face the Portal of Earth.\n\n*Eastern* Wind-Rain-Thunder-Lightning Deities – *Eastern* Pursuit Messenger for [Name].\n*Southern* Wind-Rain-Thunder-Lightning Deities – *Southern* Pursuit Messenger for [Name].\n*Western* Wind-Rain-Thunder-Lightning Deities – *Western* Pursuit Messenger for [Name].\n*Northern* Wind-Rain-Thunder-Lightning Deities – *Northern* Pursuit Messenger for [Name].\n*Central* Wind-Rain-Thunder-Lightning Deities – *Central* Pursuit Messenger for [Name].\n\n*Altar-Construction Talisman Mandate.*",
      "overlap_context": " Ling Zhu Ying*\n*Chi*\nSwiftly summon by command!\n\n**Talisman to Summon the Four Dark Lords**\n☴ *Yulei Haoshi Jun* – Command to enter the water jar\n*Ding Wenguang* – Tortoise-headed, human-bodied\n\n☷ *Jinjing Liuguang Jun* – Command to enter the water jar\n*Ding Wenxing* – Human-headed, serpent-bodied\n\n☶ *Dongyang Youling Jun* – Command to enter the water jar\n*Ding Wenda* – Human-headed, fish-bodied\n\n☰ *Leihua Taihuanghou* – Command to enter the water jar\n*Ding Wenhui* – Human-headed, dragon-bodied",
      "start_char": 1813,
      "end_char": 2110,
      "start_sentence": 108,
      "end_sentence": 130,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.671553611755371,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "净坛 　请帅 三帅 　召将 役将 　普召 傅令 　集神 元始檄命雷霆符 雷霆行用符命 雷坛镇本方案，并用黄纸丹书。 东森 南炎 西镐 北洼 中镇 中央 黄白炁 北方 黑青炁 西方 白黑炁 南方 赤黄炁 东方 令捷符 丹书新砖上，入火下瓮，水火激搏。 东合 西明 南天 北帝 中日 前令　　　　 徙捷 东令 捷 捷 南令 捷 西令 　捷 北令 　捷 中央 　捷 如未应用铁札，下龙潭先奏帝笺，师省开符，方下札。 札式 奏云：敕旨付三省，先与正天分度，赦过宥愆。 即与宣告，某州某县某处潭洞龙君。 仰遵元降某札火急，如何奉行。 臣见在某处坛所，伏地以伺普泽。 年 月 朔 日 时告行。 铁札长一尺二寸，阔五寸二分，朱书符，背书文，用青罗袋入水。 仍札某处潭洞龙君，仰遵某札，火速奉行。 法师焚符下潭，仗剑噀水，下札祝云： 乾降晶坤，顺灵驱雷。 电运天星，诛悖逆命。 龙神降普，泽亨利贞。 袋式 青罗为之，如无，青绢亦可。 铁札符 朱书於札背上。 清微天浩炁，通道溥泽，金符铁札。 恭准 元降，告行 符命。 右金符铁札告下：某州某县某处潭洞龙神，仰遵元降札命。 定於今月某日某时，率领龙雷下赴某处境内，兴云致雨，大轰霹雳，救民焦枯，沾足田畴，利济万物。 有功之日，名书上清本坛，除已录词，飞奏天廷，请颁恩命。 外札命到刻，令急飞星，立俟昭报。 年 月 朔 日 时告行 下札符青素丹书 臣某承诰奉行",
      "translated_text": "**Purification of the Altar**\n\n*Inviting the Marshals*\n*Three Marshals*\n*Summoning the Generals*\n*Deploying the Generals*\n*General Summons*\n*Transmitting the Decree*\n*Primordial Mandate of Thunder and Lightning Talismans*\n*Thunder and Lightning Operational Mandate*\n*Thunder Altar’s Central Tablet for the Five Directions*—all inscribed on yellow paper in cinnabar.\n\n*Eastern Forest*\n*Southern Flame*\n*Western Capital*\n*Northern Hollow*\n*Central Pillar*\n*Central Palace*\n\n*Yellow and White Qi*—*Northern* *Black and Azure Qi*—*Western* *White and Black Qi*—*Southern* *Red and Yellow Qi*—*Eastern*\n\n*Swift Command Talisman*—inscribed in cinnabar on a new brick, fired and submerged in a jar, where water and fire clash in contest.\n\n*Eastern Convergence*\n*Western Clarity*\n*Southern Heaven*\n*Northern Emperor*\n*Central Sun*\n*Former Decree*\n\n*Swift* *Eastern Decree*—*Swift*\n*Southern Decree*—*Swift*\n*Western Decree*—*Swift*\n*Northern Decree*—*Swift*\n*Central*—*Swift*\n\nIf the response is not forthcoming, use an iron tablet and first submit an imperial memorial to the Dragon Pool. The master reviews and opens the talisman before lowering the tablet.\n\n**Tablet Formula**\nMemorial: *\"By imperial edict, the Three Ministries are charged to first rectify the celestial divisions and pardon transgressions. Proclaim this to the Dragon Lord of [State], [County], [Location] Pool-Cave. You are commanded to obey the originally descended [Tablet] and act with utmost urgency. Your servant, now at the altar of [Location], prostrates to await universal grace.\"*\n\n*Year, Month, First Day, Hour—Decree Issued.*\n\nThe iron tablet is one foot two inches in length and five inches two fen in width. Inscribe the talisman in cinnabar on the front and the text on the reverse, then place it in a blue silk pouch before submerging it in water. Further command the Dragon Lord of [Location] Pool-Cave to obey the tablet and act with haste.\n\nThe master burns the talisman and lowers it into the pool, wielding the sword to spray water while reciting the incantation:\n*\"Heaven descends in brilliance, Earth ascends in compliance. Spirits obey, thunder is driven forth. Lightning turns the celestial stars to smite the rebellious and defiant. Dragon deities descend in universal grace—benefit, advantage, harmony, and uprightness.\"*\n\n**Pouch Formula**\nMade of blue silk; if unavailable, blue damask may be used.\n\n**Iron Tablet Talisman**\nInscribed in cinnabar on the reverse of the tablet:\n*\"Vast Qi of the Pure and Subtle Heaven, pervading the Dao with boundless grace—Golden Talisman, Iron Tablet. Reverently following the originally descended decree, the mandate is issued.\"*\n\n*Right: Golden Talisman, Iron Tablet—Proclaimed to the Dragon Deity of [State], [County], [Location] Pool-Cave. You are commanded to obey the originally descended tablet mandate. On the [Day] of this month at [Hour], lead the dragon-thunder to descend upon [Location], summon clouds to bring rain, unleash great thunderclaps, rescue the parched people, saturate the fields, and benefit all things. On the day of merit, your name shall be recorded in the Upper Clarity Register of this altar. Beyond the already recorded words, a memorial shall be swiftly submitted to the Celestial Court to request the bestowal of imperial grace. Upon receipt of this external tablet mandate, command the swift stars to immediately await the luminous report.\"*\n\n*Year, Month, First Day, Hour—Decree Issued.*\n\n**Lowering the Tablet Talisman**\nInscribed in cinnabar on blue or plain silk:\n*\"Your servant [Name], bearing the decree, obeys and executes.\"*",
      "overlap_context": "ortal of Earth.\n\n*Eastern* Wind-Rain-Thunder-Lightning Deities – *Eastern* Pursuit Messenger for [Name].\n*Southern* Wind-Rain-Thunder-Lightning Deities – *Southern* Pursuit Messenger for [Name].\n*Western* Wind-Rain-Thunder-Lightning Deities – *Western* Pursuit Messenger for [Name].\n*Northern* Wind-Rain-Thunder-Lightning Deities – *Northern* Pursuit Messenger for [Name].\n*Central* Wind-Rain-Thunder-Lightning Deities – *Central* Pursuit Messenger for [Name].\n\n*Altar-Construction Talisman Mandate.*",
      "start_char": 2110,
      "end_char": 2790,
      "start_sentence": 131,
      "end_sentence": 180,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.52570915222168,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "召三天霹雳，飞玄捷奏，符使孔安天。 咒直完郁。 火冠，三日，青面，赤发，全身金甲朱衣，仗剑，持符，朱履，乘赤凤。 召符使符 牒委请符使，资持札命告下。 龙君召至，宣牒焚符讫。 然后役遣，务要如期昭报，毋致稽违。 有功之日，名书上清。 念咒： 乾降晶坤，顺灵驱雷。 霆运天星，诛悖逆命。 龙神降普，泽亨利贞。 投札入水。 第一限建坛笺，近代四师先。 ○入飞 次冑，如式三雷。 涂用黄纸，高九寸，阔五寸，朱书符，墨批，卷绒缠。 焚中，或炉中。 祝雷神。 念天经　墨涂 符为某处某词称伏。 自某月以来，久旱无雨，田畴龟坼，禾稼将枯，民心忧惶，恐失岁望。 叩请祈求，雨泽事据。 词激切情，意难缄所。 合依式告行。 元降玉符，上请",
      "translated_text": "Summon the Three Celestial Thunderclaps, swiftly submit the dark memorial, and let the talisman envoy Kong An-tian descend. The incantation is complete and potent. Donning a fiery crown for three days, with a blue-green face, crimson hair, clad in golden armor and vermilion robes, wielding a sword, holding the talisman, wearing vermilion shoes, and riding a red phoenix.\n\nSummon the talisman envoy. The memorial commissions the talisman envoy, who bears the tablet mandate to proclaim its descent. Once the Dragon Lord is summoned and the memorial is read, burn the talisman. Thereafter, dispatch and command, ensuring timely and luminous report—do not delay or disobey. On the day of merit, your name shall be recorded in the Upper Clarity.\n\nRecite the incantation:\n*\"Heaven descends its crystalline essence to Earth,\nIn accord with the numinous, drive forth the thunder.\nThe thunder moves the celestial stars,\nPunishing the rebellious and countermanding fate.\nThe Dragon Spirit descends universally,\nBestowing moisture, harmony, and steadfast integrity.\"*\n\nCast the tablet into the water.\n\n**First Step:** Establish the altar petition, following the recent precedents of the Four Masters.\n**○ Enter the Flying [Memorial]**\nNext, don the armor, and perform the Three Thunder Rites as prescribed. Use yellow paper, nine inches in height and five inches in width, inscribe the talisman in cinnabar, annotate in ink, and bind it with silk thread. Burn it in the center, or within the incense burner. Invoke the Thunder Spirit.\n\nRecite the Heavenly Scripture, inscribing the talisman in ink:\n*\"This talisman is for [Location] and the petition therein prostrated. Since [Month], there has been prolonged drought without rain; the fields are cracked like tortoise shells, the crops wither, the people’s hearts are anxious, and the year’s harvest is feared lost. We knock our heads and beseech, pleading for rain—this matter is urgent. The petition’s words are earnest and impassioned, its intent too pressing to suppress. We proceed in accordance with the prescribed rites to proclaim and enact this. The originally descended Jade Talisman has been respectfully invoked.\"*",
      "overlap_context": "be recorded in the Upper Clarity Register of this altar. Beyond the already recorded words, a memorial shall be swiftly submitted to the Celestial Court to request the bestowal of imperial grace. Upon receipt of this external tablet mandate, command the swift stars to immediately await the luminous report.\"*\n\n*Year, Month, First Day, Hour—Decree Issued.*\n\n**Lowering the Tablet Talisman**\nInscribed in cinnabar on blue or plain silk:\n*\"Your servant [Name], bearing the decree, obeys and executes.\"*",
      "start_char": 2790,
      "end_char": 3105,
      "start_sentence": 181,
      "end_sentence": 206,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.492074966430664,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "神烈阴阳苟毕二神君，火速会合，日分巡施，雷神岁分，行雨主者，及本境山川潭洞龙君社令等神。 定於今月某日某时，下降某处，搜龙卷水，驾风鞭霆，大需三日之甘霖，普救四郊之品物。 上彰道化，下副民情。 立俟感通，以明天信。 年 月 日 时 臣某承 诰奉行。 一太极 二人飞 三胄 六雨 七雷 惊 九雷 念天经涂十转 第二限，黄纸墨书，卷绒缠，烈火焚见天处。 念天经 墨涂 符为某处某人，投词叩请雨泽救济田禾事。 臣领词除已委命雷神，会合雨部山川潭洞社令等神，定立限期，大布甘霖。 去外切虑违时，有妨济旱，不免再与告行。 元降玉符，催请 神烈阴阳苟毕二大神君。 务要应期，统摄日分岁分龙雷山川潭洞社令等神，一体承奉符命，施雨兴云，扫旱魃而救焦枯，济生灵而苏品物。 愿推好生之德泽，下济垂死之禾苗，大霈甘霖，庶崇不功绩，以彰 天令。 立俟咸通。",
      "translated_text": "To the mighty and divine Lords of Yin and Yang, Gou and Bi, assemble with haste. Patrol by day, govern by year—the Thunder Spirits, the Masters of Rain, and the Dragon Lords of this realm’s mountains, rivers, deep pools, and caverns, along with the Earth Gods and Local Deities. On the appointed day and hour of this month, descend to [Location], summon the dragons to coil the waters, ride the winds and lash the thunder, and bestow three days of sweet rain to universally succor all beings across the four outskirts. Above, manifest the transformative power of the Dao; below, fulfill the people’s plea. Await the response in reverence, that the celestial trust be made manifest.\n\nYear ___ Month ___ Day ___ Hour ___\nYour servant [Name], by decree, respectfully enacts this.\n\nOne Supreme Ultimate, Two Flying Warriors, Three Armored Guardians, Six Rain, Seven Thunder, Startling Nine Thunder. Recite the Heavenly Scripture, inscribe ten revolutions.\n\nSecond stage: write in ink on yellow paper, bind with silk thread, and burn in a blazing fire beneath the open sky.\n\nRecite the Heavenly Scripture, inscribing the talisman in ink:\n*\"This talisman is for [Location] and [Petitioner], who prostrates in plea for rain to rescue the fields and crops.\"*\n\nYour servant, having received the petition, has already commissioned the Thunder Spirits to assemble with the Rain Deities, the Dragon Lords of mountains, rivers, deep pools, and caverns, and the Earth Gods and Local Deities, setting a fixed term for the great bestowal of sweet rain. Should there be any delay or obstruction to the timely relief of the drought, this further proclamation is issued without fail.\n\nThe originally descended Jade Talisman urgently invokes the mighty and divine Lords of Yin and Yang, Gou and Bi. Ensure they respond on schedule, commanding the Thunder Spirits of the yearly cycle, the Dragon Lords of the daily patrol, and the deities of mountains, rivers, deep pools, caverns, and local altars to uniformly obey the talismanic decree. Let them send forth rain and summon clouds, dispel the drought demons to save the withered, aid the living beings, and revive all things. May they extend the virtue of cherishing life, descending to rescue the dying crops with abundant sweet rain, that the great work of Heaven’s mandate be gloriously fulfilled. Await the harmonious response in reverence.",
      "overlap_context": "Month], there has been prolonged drought without rain; the fields are cracked like tortoise shells, the crops wither, the people’s hearts are anxious, and the year’s harvest is feared lost. We knock our heads and beseech, pleading for rain—this matter is urgent. The petition’s words are earnest and impassioned, its intent too pressing to suppress. We proceed in accordance with the prescribed rites to proclaim and enact this. The originally descended Jade Talisman has been respectfully invoked.\"*",
      "start_char": 3105,
      "end_char": 3488,
      "start_sentence": 207,
      "end_sentence": 225,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.446702241897583,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "年 月 日 时 臣某承 诰奉行。 右符依前次第，加符涂盖。 第三限，用黄纸墨书，卷五色绒缠，见天处烈火焚。 批事同前式，照行遣限次写。 念天经 墨涂 第四限，奏法主栈，五师书符依前。 加又 次加风云雷雨电符  又加心印 盖涂出笔  震 召冑符心中 黄纸或青纸，朱墨书，五色绒缠，焚灶中。 先朱外向内涂，后墨内向外涂，照行遣批事。 印司 印司　　自此以下二帅讳并云篆  先红后黑了发涂黑 第五限，符式同前，加催号心印。 盖皂四纸书，皂绒缠卷，封入竹筒，见天处烈火焚。 先朱外向内涂，后墨内向外涂，. 批事照遣写。 可加胄字中 震卦 心直画上",
      "translated_text": "On the ___ day of the ___ month, at the ___ hour, your subject [Name] respectfully receives the edict and executes it.\n\nThe talisman on the right shall follow the previous sequence, with additional seals and ink applications. For the third deadline: inscribe in black ink on yellow paper, bind with five-colored threads, and burn in an open-air blazing fire. The administrative endorsement shall follow the prior format, written in accordance with the deadline sequence.\n\nRecite the Heavenly Scripture while applying ink.\n\nFor the fourth deadline: submit to the Ritual Master’s repository; the Five Masters shall inscribe the talisman as before. Further add the talismans of wind, clouds, thunder, rain, and lightning. Then affix the Heart Seal, applying ink to complete the brushstrokes.\n\nThe *Zhen* (☳) Hexagram’s Armored Summons Talisman shall be inscribed in cinnabar or black ink on yellow or blue-green paper, bound with five-colored threads, and burned in the stove. First apply cinnabar from the outside inward, then black ink from the inside outward, following the administrative endorsement procedure.\n\nSeal Bureau. Seal Bureau. From this point onward, the taboo names of the Two Marshals shall be written in cloud-script. First apply red, then black; after dispatch, apply black ink.\n\nFor the fifth deadline: the talisman format remains as before, with the addition of the Urgent Summons Heart Seal. Inscribe on four sheets of black paper, bind with black threads, roll, and seal within a bamboo tube; burn in an open-air blazing fire. First apply cinnabar from the outside inward, then black ink from the inside outward. The administrative endorsement shall be written accordingly.\n\nThe character *zhòu* (胄) may be added within the *Zhen* Hexagram (☳), above the central vertical stroke.",
      "overlap_context": "Lords of the daily patrol, and the deities of mountains, rivers, deep pools, caverns, and local altars to uniformly obey the talismanic decree. Let them send forth rain and summon clouds, dispel the drought demons to save the withered, aid the living beings, and revive all things. May they extend the virtue of cherishing life, descending to rescue the dying crops with abundant sweet rain, that the great work of Heaven’s mandate be gloriously fulfilled. Await the harmonious response in reverence.",
      "start_char": 3489,
      "end_char": 3779,
      "start_sentence": 226,
      "end_sentence": 241,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.964208126068115,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "印司 印司 第六限，催奏法主，五师符如前式，批事照行遣写，书符再加乳雾二字，书黑点上，先朱外向内涂，后墨内向外涂。 此号於胃字 又加 　　　又加 　再加 中直画下 皂纸墨书，皂绒卷缚，入竹筒，烈火焚见天处。 道宗 紫皇太乙天君令 司印　黑点内乳雾 第七限，皂纸墨书，皂绒缠，入竹筒中，焚见天处，用烈火。 先朱外向内涂，后墨内向外涂，加号同前六限，催雷雨霹雳聻涂。 此出 次加 又加心印 加 笔法 道宗印 第八限，奏玉帝，拜家书达玄帝，催师木郎，咒涂纯墨，书于黑纸上，涂加如前法。 涂毕，顺加心印，玉帝心印。 切勿到加。 焚见天处。 加规天 雷动 加矩地 晴静 玉皇上帝 第九极法， ○ 口 ○ 符。 ○中并加前后。",
      "translated_text": "Seal Bureau. Seal Bureau. For the sixth deadline: the Urgent Memorial to the Lord of the Dharma, the Five Masters’ talisman follows the previous format, with administrative endorsements written accordingly. When inscribing the talisman, add the characters *rǔ wù* (乳雾) above the black dot. First apply cinnabar from the outside inward, then black ink from the inside outward. This seal is placed beneath the character *wèi* (胃), with further additions: 　　　again added, then 　further added beneath the central vertical stroke. Inscribe in black ink on black paper, bind with black threads, roll, and seal within a bamboo tube; burn in an open-air blazing fire.\n\nBy command of the Daoist Sect, the Purple Sovereign, Supreme Unity Heavenly Lord. Seal Bureau. Within the black dot: *rǔ wù* (乳雾).\n\nFor the seventh deadline: inscribe in black ink on black paper, bind with black threads, seal within a bamboo tube, and burn in an open-air blazing fire. First apply cinnabar from the outside inward, then black ink from the inside outward. The seal additions follow the sixth deadline, with the Urgent Summons for Thunder, Rain, and Thunderclaps applied accordingly. This proceeds from 　next added, then 　further added, with the Heart Seal and 　brushwork applied. Daoist Sect Seal.\n\nFor the eighth deadline: memorialize the Jade Emperor, present the family petition to the Mysterious Emperor, and urge Master Mulberry Lord. Apply the incantation purely in black ink on black paper, following the previous method. Upon completion, sequentially add the Heart Seal, the Jade Emperor’s Heart Seal. Take care not to over-add. Burn in an open-air location.\n\nAdd *guī tiān* (規天, \"Compass of Heaven\") for thunder’s motion; add *jǔ dì* (矩地, \"Square of Earth\") for clear stillness. Jade Sovereign Lord.\n\nThe Ninth Supreme Method: ○ 口 ○ talisman. Within the circles, add all previous elements in sequence.",
      "overlap_context": " the fifth deadline: the talisman format remains as before, with the addition of the Urgent Summons Heart Seal. Inscribe on four sheets of black paper, bind with black threads, roll, and seal within a bamboo tube; burn in an open-air blazing fire. First apply cinnabar from the outside inward, then black ink from the inside outward. The administrative endorsement shall be written accordingly.\n\nThe character *zhòu* (胄) may be added within the *Zhen* Hexagram (☳), above the central vertical stroke.",
      "start_char": 3779,
      "end_char": 4121,
      "start_sentence": 242,
      "end_sentence": 264,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.214785099029541,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "符号遍了，又入小 ，迭书六号上诰紫皇太乙天君。 妙在口傅○○ 加五主 垄鶸雇 念天经墨涂 第十极法，用法同前。 念天经 墨涂. 冑字符 祈雨自上至下，作三次行用。 起云 下批　催云 下批 起风 青纸丹书入双O　催风 青纸丹书入双O 止风 黄纸墨书入双O下批  催止风 起雷 黄纸墨书入双O下批　　催雷 红纸朱书入双O下批 祈雨 黄纸墨书入双O下批五色绒缚雨　　催雷 皂纸黑书入双O下批绒缚雨 祈雨 　魁斗七字加上 祈雨 　　 祈梼 中加雷 祈梼 雷字符祈雨妙用 雨月水 　止雾云 　雹 雷 　　风 　　起风 外 止风 内",
      "translated_text": "Once the talismanic symbols are fully inscribed, enter the small [enclosure], repeatedly writing the Six Great Invocations to the Purple Sovereign Supreme Unity Heavenly Lord. The subtlety lies in oral transmission of ○○. Add the Five Lords, *lǒng què gù* (壟鶸雇). Recite the *Heavenly Scripture* while applying ink.\n\nThe Tenth Supreme Method follows the previous procedure. Recite the *Heavenly Scripture* while applying ink.\n\nFor the *zhòu*-character talisman:\n- **Praying for Rain**: Apply from top to bottom in three successive operations.\n  - *Raising Clouds*: lower annotation\n  - *Urging Clouds*: lower annotation\n  - *Raising Wind*: write in cinnabar on blue paper, insert into double ○\n  - *Urging Wind*: write in cinnabar on blue paper, insert into double ○\n  - *Ceasing Wind*: write in ink on yellow paper, insert into double ○, lower annotation\n  - *Urging Cessation of Wind*\n  - *Raising Thunder*: write in ink on yellow paper, insert into double ○, lower annotation\n  - *Urging Thunder*: write in cinnabar on red paper, insert into double ○, lower annotation\n  - **Praying for Rain**: write in ink on yellow paper, insert into double ○, lower annotation\n  - *Five-Colored Thread Binding Rain*: write in ink on yellow paper\n  - *Urging Thunder*: write in ink on black paper, insert into double ○, lower annotation\n  - *Thread Binding Rain*\n  - **Praying for Rain**: add the Seven Characters of the *Kui Dou* above\n  - **Praying for Rain**: add *Thunder* within the central prayer\n  - **Prayer with Thunder-Character Talisman** for rain’s subtle efficacy\n\n- *Rain Moon Water*\n- *Ceasing Mist and Clouds*\n- *Hail*\n- *Thunder*\n- *Wind*\n- *Raising Wind*: external\n- *Ceasing Wind*: internal",
      "overlap_context": "nd urge Master Mulberry Lord. Apply the incantation purely in black ink on black paper, following the previous method. Upon completion, sequentially add the Heart Seal, the Jade Emperor’s Heart Seal. Take care not to over-add. Burn in an open-air location.\n\nAdd *guī tiān* (規天, \"Compass of Heaven\") for thunder’s motion; add *jǔ dì* (矩地, \"Square of Earth\") for clear stillness. Jade Sovereign Lord.\n\nThe Ninth Supreme Method: ○ 口 ○ talisman. Within the circles, add all previous elements in sequence.",
      "start_char": 4121,
      "end_char": 4424,
      "start_sentence": 265,
      "end_sentence": 283,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.165313243865967,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "飞字符祈雨妙用 祈雨 　起风 　起雷 起雹 　止雾云 晾字符祈雨妙用 祈雨 　催雨 　祈祷 止风 　止雷 宝字符祈雨妙用 宝字 云雨雪 电崔雹 风雷雾 风 　雷 　云 　雨 电 　雹 　催 打龙铁札符 召将八符通用 玉 　帝 　敕 命 　号 　令 雷 　霆 令字符 右令字符。 第七、八限。 用朱书降真香片上，背书臣某召请。 以烈火，香炉内焚之。 祝云： 具位臣姓某上启， 祖师圣位。 臣据某处某人，为某事。 昨已累行符命，檄召雷神，及具奏闻天廷，请降雨泽。 去后尚未感通，臣情不获已，恭依师授，告行清微，某令某符使速令上达。 恭望师慈，俯从愚恳，特赐旨命，官将大显威灵。 伫俟感孚，一如元降。 再灶香，存召雷神到坛，后握令遣将。 念云：当职恭承 帝令，役召雷霆，务竭公忠，匡扶道化，仰遵 符命，率领雷神，轰雷掣电，澍雨震霆，大施普泽，救济生灵。 玉清敕命，幸勿稽停。 符命到处，电降云奔，一如明令，风火驿传。 下令。 祈梼行用符命 风 　云 　雷 雨 　电 　龙",
      "translated_text": "**Flying-Character Talisman for Rain’s Subtle Efficacy**\n- **Praying for Rain**\n- *Raising Wind*\n- *Urging Thunder*\n- *Summoning Hail*\n- *Ceasing Mist and Clouds*\n\n**Brightening-Character Talisman for Rain’s Subtle Efficacy**\n- **Praying for Rain**\n- *Urging Rain*\n- **Prayer**\n- *Ceasing Wind*\n- *Ceasing Thunder*\n\n**Treasure-Character Talisman for Rain’s Subtle Efficacy**\n- *Treasure-Character*\n- Clouds, Rain, Snow\n- Lightning, Hail, Wind\n- Thunder, Mist\n- Wind, Thunder, Clouds, Rain\n- Lightning, Hail\n- *Urging*\n- *Striking Dragon Iron Tablet Talisman*\n\n**Eight General Talismans for Summoning Divine Generals**\n- Jade\n- Emperor\n- Decree\n- Command\n- Edict\n- Order\n- Thunder\n- Thunderbolt\n\n**Order-Character Talisman**\nRight: Order-Character Talisman.\nSeventh and eighth time limits.\nWrite in cinnabar on a *jiangzhen* incense tablet, and on the reverse, inscribe: \"Your subject [Name] summons and requests.\"\nBurn in a censer with a blazing fire.\nRecite the prayer:\n*\"Your subject, [Name], of such-and-such rank, respectfully petitions the Most Sacred Ancestral Master. Your subject, on behalf of [Person] of [Place], for [Matter], has repeatedly issued talismanic commands and dispatched summons to the Thunder Gods, and has also memorialized the Heavenly Court to request the descent of rain. Since then, no response has yet been received. With no alternative, your subject reverently follows the teachings of my master and humbly petitions the Qingwei [Dao], invoking [Name] Talisman and [Name] Envoys to swiftly transmit this plea upward. I earnestly beseech the compassion of my master to deign to grant this foolish request, bestow a sacred decree, and command the divine generals to manifest their mighty power. Awaiting the fulfillment of this prayer, may it be as originally decreed.\"*\n\nLight another incense burner, visualize the Thunder Gods arriving at the altar, then grasp the command to dispatch the generals.\nRecite:\n*\"By imperial decree, I dutifully summon the Thunderbolt, exerting utmost loyalty to uphold the Dao and its transformations. Reverently obeying the talismanic command, I lead the Thunder Gods to rumble with thunder, flash with lightning, pour forth rain, and shake with thunderclaps, widely bestowing universal blessings to succor and save all living beings. By the Jade Clarity’s sacred decree, delay not. Wherever the talismanic command arrives, let lightning descend and clouds rush forth, swiftly as the wind and fire couriers, in perfect accord with this luminous order.\"*\n\nIssue the command.\n\n**Talismanic Commands for Prayer and Ritual Use**\n- Wind\n- Clouds\n- Thunder\n- Rain\n- Lightning\n- Dragons",
      "overlap_context": "g Rain*: write in ink on yellow paper\n  - *Urging Thunder*: write in ink on black paper, insert into double ○, lower annotation\n  - *Thread Binding Rain*\n  - **Praying for Rain**: add the Seven Characters of the *Kui Dou* above\n  - **Praying for Rain**: add *Thunder* within the central prayer\n  - **Prayer with Thunder-Character Talisman** for rain’s subtle efficacy\n\n- *Rain Moon Water*\n- *Ceasing Mist and Clouds*\n- *Hail*\n- *Thunder*\n- *Wind*\n- *Raising Wind*: external\n- *Ceasing Wind*: internal",
      "start_char": 4424,
      "end_char": 4902,
      "start_sentence": 284,
      "end_sentence": 321,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.18379807472229,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "催 　雾 　霹 雳 　集 　止 大梵水火元始心章 玄帝讳 臣某告行　龟 臣某告行 蛇 臣某告行 清微神烈秘法卷上竟 清微神烈秘法卷下 驱治大祟 第一限，黄素朱书符，涂了或批事于霄臣某儿翁龚臣某告诋臣某告行止下，或列师作诰式。 行用绒卷缠，焚於龟中。 批事照行遣写。 念天经朱涂 官押 第二限，皂纸墨书作诰式，行上下都司印。 先朱外向内涂，后墨内向外涂。 书於　　　圈　　　　　　　　　通涂中 艮　　　　内　　　　　　　　　间再加 第三限，黄素朱书，前后文作诰式，列师行之，乃起雷伐祟。 用批事，照行检限次写。 中心　　　　　加红 加　　　　　　点中",
      "translated_text": "**Urgent Commands for Ritual Use**\n- Mist\n- Thunderbolt\n- Gathering\n- Cessation\n\n**Great Brahma’s Water-Fire Primordial Heart Chapter**\nThe Mysterious Emperor’s taboo name—\n*Your subject [Name] issues the command.*\n**Tortoise**—*Your subject [Name] issues the command.*\n**Serpent**—*Your subject [Name] issues the command.*\n\n*End of the Upper Scroll of the Qingwei Divine Might Esoteric Methods*\n*Beginning of the Lower Scroll of the Qingwei Divine Might Esoteric Methods*\n\n**Expelling and Curing Major Malevolence**\n**First Stage:** Inscribe the talisman on yellow silk in cinnabar, then apply it to the petition or affix it to the celestial minister [Name]’s child, Weng Gong [Name]. Alternatively, have the master compose it in the form of an official proclamation. Roll it with silk thread and burn it within the tortoise. Copy the petition as written for dispatch.\n\nRecite the *Celestial Scripture*, applying cinnabar.\n*Seal with the officer’s mark.*\n\n**Second Stage:** Compose the proclamation in ink on black paper, affixing the seals of the Upper and Lower Capital Bureaus. First apply cinnabar from the outside inward, then ink from the inside outward. Inscribe within the circle, filling the space entirely:\n\n```\n          ☯\n          ☯ (interior)\n          ☯\n```\n\nAdd a third layer within the gaps.\n\n**Third Stage:** Inscribe in cinnabar on yellow silk, framing the text as an official proclamation. The master executes this to summon thunder and strike down malevolence. Follow the petition’s content, copying it according to the prescribed stages. At the center, add red dots:\n\n```\n          • (center)\n          ••• (surrounding)\n```",
      "overlap_context": "ith thunder, flash with lightning, pour forth rain, and shake with thunderclaps, widely bestowing universal blessings to succor and save all living beings. By the Jade Clarity’s sacred decree, delay not. Wherever the talismanic command arrives, let lightning descend and clouds rush forth, swiftly as the wind and fire couriers, in perfect accord with this luminous order.\"*\n\nIssue the command.\n\n**Talismanic Commands for Prayer and Ritual Use**\n- Wind\n- Clouds\n- Thunder\n- Rain\n- Lightning\n- Dragons",
      "start_char": 4902,
      "end_char": 5224,
      "start_sentence": 322,
      "end_sentence": 342,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.943041801452637,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "念天经朱涂 第四限，黄素朱书，绒缠，见天处烈火焚。 催行同前作诰，加风云雷雨电号，以下皆用。 中心　　　　　中心点 加　　　　　　内加 第五限，青素朱书，青绒缠，入竹筒，见天处烈火中焚。 前后文作诰式，列师行之。 心中　　　　　　盖 加　　　　　　　心 第六限，皂纸墨书，皂绒缠，入竹筒。 如前用。 心　　　　　　　一　　　　　二　　　　　三 加　　　　　　加　　　　　　加　　　　　加 第七限，皂纸墨书，皂绒缠，入竹筒，见天处，烈火焚。 前后如洞章式。 右獬　　　中　　　　涂了加　　又",
      "translated_text": "Recite the *Celestial Scripture* with cinnabar application.\n\n**Fourth Stage:** Inscribe in cinnabar on yellow silk, bound with red thread, and burn with fierce fire where exposed to heaven. Proceed as before for the proclamation, adding the titles of Wind, Clouds, Thunder, Rain, and Lightning—henceforth to be used throughout. At the center, add red dots:\n\n```\n          • (center)\n          ••• (interior)\n```\n\n**Fifth Stage:** Inscribe in cinnabar on blue-green silk, bound with blue-green thread, placed in a bamboo tube, and burned in fierce fire where exposed to heaven. Compose the text before and after in proclamation form, executed by the master. Seal at the center:\n\n```\n          盖 (center)\n          • (interior)\n```\n\n**Sixth Stage:** Inscribe in ink on black paper, bound with black thread, placed in a bamboo tube. Proceed as before. Mark the following at the center:\n\n```\n          • (1)\n          •• (2)\n          ••• (3)\n```\n\n**Seventh Stage:** Inscribe in ink on black paper, bound with black thread, placed in a bamboo tube, and burned with fierce fire where exposed to heaven. Format before and after as a *Dongzhang* document. To the right, apply:\n\n```\n          獬 (right)\n          中 (center, filled)\n          涂了 (added)\n          加 (further addition)\n```",
      "overlap_context": "nside outward. Inscribe within the circle, filling the space entirely:\n\n```\n          ☯\n          ☯ (interior)\n          ☯\n```\n\nAdd a third layer within the gaps.\n\n**Third Stage:** Inscribe in cinnabar on yellow silk, framing the text as an official proclamation. The master executes this to summon thunder and strike down malevolence. Follow the petition’s content, copying it according to the prescribed stages. At the center, add red dots:\n\n```\n          • (center)\n          ••• (surrounding)\n```",
      "start_char": 5224,
      "end_char": 5520,
      "start_sentence": 343,
      "end_sentence": 358,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.177796840667725,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "左狻　　　加　　　　心印　　　加 已上诸符，并治大魔恶祟，紧、急用之。 后五道起雷伐祟方用，非伐则勿用。 千万至祝，不可轻行，宜谨记之。 第八限，行令符，下批事，照行检写随事。 用纸朱墨，绒缠，见天处，烈火焚。 又云用大香片，书背批。 念天经先朱后墨涂 九天霹雳炎雷铁札一名玉札 伐祟 三洞灵章，泄自太虚。 天神地祇，三界主者，社令城隍，里域灵司，咸遵奉行，违者斩尸。 急急如律令。 伐祟背文 乾降晶坤，顺灵日月，象岳渎形，驱雷电运，天星摧凶恶。 亨利贞。 一如诰命。 右剖治大祟起垫、龙行雨镇、蛟蜃水怪。 用铁版一尺二寸长，阔三寸二分，厚二分。 面朱书符，三洞诰章。 背书乾降晶诰，或所雨札文。 用镇凶恶，所在去处，自然消弭。 或深潭蛟蜃为祸，或一切妖鬼捉生代死之处，皆可镇伏，境土清宁。 或祈梼不应，依式书篆，於有龙去处潭洞投下，随即感通，兴云致雨。 清微元始隐梵大霹雳符 右符背文同前，用镇压小怪妖精，蛟蜃鱼龙崩摧河岸等事，并皆镇之。 若泉邪水怪及一切妖邪去处，用此镇之，其邪立走千里。 元始诰命 玉清 上清 太清",
      "translated_text": "**Left:** *Suān*\n**Addition**   **Seal Imprint**   **Addition**\n\nAll the above talismans are for subduing great demons and malevolent spirits, to be employed in urgent or critical situations. The following five Daoist writs are for summoning thunder to vanquish spirits—do not use them unless for exorcism. Utter the incantations with utmost reverence; never invoke them lightly. Bear this solemnly in mind.\n\n**Eighth Stage:** Issue the *Command Talisman*, with a directive appended below. Copy and execute according to the matter at hand. Inscribe in cinnabar and ink on paper, bind with thread, and burn in fierce fire where exposed to heaven. Alternatively, use large incense tablets, inscribing the directive on the reverse. Recite the *Heavenly Scripture*, first applying cinnabar, then ink.\n\n**Nine Heavens’ Thunderbolt Incandescent Thunder Iron Writ** (also called *Jade Writ*)\n**For Vanquishing Spirits**\n\n*\"Three Caverns’ Numinous Writs, emanating from the Great Void.\nHeavenly deities, earthly spirits, lords of the Three Realms, village deities, city gods, and local spirit-officials—all must obey and execute. Those who defy shall be slain and their corpses severed.\nSwiftly, swiftly, as in the statutes and commands!\"*\n\n**Reverse Inscription for Vanquishing Spirits:**\n*\"Qian descends as crystal, Kun aligns with the numinous sun and moon.\nEmbodying mountains and rivers, commanding thunder and lightning, celestial stars shatter evil.\nSmooth and steadfast, correct and upright.\nAs in the imperial decree.\"*\n\n**Right:** For suppressing major malevolent spirits, quelling floods, invoking dragon-led rains, and subduing flood dragons, water monsters, and aquatic specters.\nUse an iron plaque, one *chi* and two *cun* in length, three *cun* and two *fen* in width, and two *fen* in thickness. Inscribe the talisman in cinnabar on the front, with the *Three Caverns’ Decrees*. On the reverse, write the *\"Qian Descends as Crystal\"* decree or the rain-invoking writ. To suppress evil, place it where needed, and all disturbances will naturally dissipate. For deep pools where flood dragons or water monsters wreak havoc, or where malevolent ghosts seize lives to substitute for their own deaths, this plaque will subdue and pacify them, bringing tranquility to the land. If prayers go unanswered, inscribe the talisman as prescribed and cast it into dragon-inhabited pools or caves—clouds will gather, and rain will follow.\n\n**Primordial Beginning’s Hidden Sanskrit Great Thunderbolt Talisman**\nThe reverse inscription is as above. Use this to suppress minor demons, sprites, flood dragons, fish-dragons, and riverbank collapses—all will be subdued. For places plagued by spring specters, water monsters, or any malevolent spirits, employ this talisman, and the evil will flee a thousand *li* away.\n\n**Primordial Beginning’s Decrees**\n*Jade Clarity*\n*Highest Clarity*\n*Great Clarity*",
      "overlap_context": " bound with black thread, placed in a bamboo tube. Proceed as before. Mark the following at the center:\n\n```\n          • (1)\n          •• (2)\n          ••• (3)\n```\n\n**Seventh Stage:** Inscribe in ink on black paper, bound with black thread, placed in a bamboo tube, and burned with fierce fire where exposed to heaven. Format before and after as a *Dongzhang* document. To the right, apply:\n\n```\n          獬 (right)\n          中 (center, filled)\n          涂了 (added)\n          加 (further addition)\n```",
      "start_char": 5536,
      "end_char": 6016,
      "start_sentence": 359,
      "end_sentence": 387,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.724361658096313,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "右符三道，紧急可加前八九十限符内用之。 右六符治邪，极处加用。 元始雷符 祈梼佩带，治病熏邪通用。 雷阳篆 　雷阴篆 一炁符　　　一炁玉符 炁 治病服　炁 催生治　病吞服 一炁宝符镇宅用。 炁 抖　聻　臣某承　诰奉行 唏 祈治通用 下司命符　　下城隍符 治邪病用。 治邪病用。 电 胄　　行 冑 已上一字一符一用，并皆如意。 昭 　雷 　孚 胜 　广 　威 天罗神赵章，地罗神律玄，五方天丁力士，十方护法神王，急罩某人家。 为祸邪鬼，赴吾魁罡。 急急如上帝律令救。 此咒书在铁符内。 烈 背文",
      "translated_text": "These three talismans may, in urgent cases, be incorporated into the previous set of eighty, ninety, or one hundred talismans for use. The six talismans to the right are for subduing malevolence; in extreme cases, they may be employed additionally.\n\n**Primordial Beginning’s Thunder Talisman**\nFor prayers, wearing, healing illnesses, and dispelling malevolence—universally applicable.\n\n**Yang Thunder Seal**\n**Yin Thunder Seal**\n\n**One Qi Talisman**\n**One Qi Jade Talisman**\n*Qi* – For healing illnesses, ingest *qi*.\n*Qi* – For hastening childbirth, ingest to heal illness.\n\n**One Qi Treasure Talisman**\nFor suppressing the household.\n\n*Qi* – Shake, *niě*, I, [Name], respectfully receive the decree and act accordingly.\n*Hēi* – Universally applicable for prayers and healing.\n\n**Talisman for the Controller of Fate**\n**Talisman for the City God**\nFor healing illnesses caused by malevolence.\n\nFor healing illnesses caused by malevolence.\n\n*Diàn* – Helm\n*Zhòu* – Armor\n*Xíng* – Armor\n\nEach of the above single-character talismans serves a distinct purpose, and all will fulfill their intent as desired.\n\n**Zhao Zhang, Spirit of the Celestial Net,**\n**Lü Xuan, Spirit of the Earthly Net,**\nThe *Ding* Forceful Warriors of the Five Directions,\nThe Dharma-Protecting Guardian Kings of the Ten Directions,\nHasten to enclose the household of [Name].\nLet the malevolent ghosts causing misfortune hasten to my *Kuí-Gāng*.\n*Swiftly, swiftly, as decreed by the Emperor’s command, save!*\n\nThis incantation is to be inscribed within an iron talisman.\n\n*Liè* – Reverse inscription.",
      "overlap_context": "louds will gather, and rain will follow.\n\n**Primordial Beginning’s Hidden Sanskrit Great Thunderbolt Talisman**\nThe reverse inscription is as above. Use this to suppress minor demons, sprites, flood dragons, fish-dragons, and riverbank collapses—all will be subdued. For places plagued by spring specters, water monsters, or any malevolent spirits, employ this talisman, and the evil will flee a thousand *li* away.\n\n**Primordial Beginning’s Decrees**\n*Jade Clarity*\n*Highest Clarity*\n*Great Clarity*",
      "start_char": 6016,
      "end_char": 6309,
      "start_sentence": 388,
      "end_sentence": 410,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.760548114776611,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "乾降晶坤，顺灵日月，象岳渎形，驱雷电运，天星摧凶恶。 亨利贞，一如告命。 年　月　日　时告行。 具　位　　臣姓某承　诰奉行。 右符治镇邪妖，用铁版，九寸长，四寸阔，三分厚，上圆下方，用七字作七星势，书于铁版。 神烈二符 神 烈 灵 冑字符祛治妙用 治　　　　　黄纸朱书人双　　　　　　　皂纸墨书人 崔 崇　　　　　O五色绒缚　　　　　　　　双O黑绒缚 治　　　　　中加　　　　治 崇　　　　　　烈字　　　邪 退　　　　　退 热　　　　　寒",
      "translated_text": "**Heaven descends in radiance, Earth ascends in receptivity,**\n**Harmonizing with the numinous sun and moon,**\n**Embodying the forms of mountains and rivers,**\n**Commanding the movement of thunder and lightning,**\n**The celestial stars crush evil and malevolence.**\n*Persisting in rectitude, yielding and firm—*\n**All shall be as the proclaimed decree.**\n\n*Year* ___ *Month* ___ *Day* ___ *Hour* ___ *Proclaimed and enacted.*\n*Rank* ___ *Minister* ___ *Surname* ___ *Receiving the edict and executing its charge.*\n\n**The talisman on the right governs and suppresses demonic and inauspicious forces.**\n*Material:* Iron plate, nine *cun* in length, four *cun* in width, three *fen* in thickness, rounded at the top and squared at the base. Inscribe in the form of the Seven Stars, with seven characters arranged in their celestial pattern.\n\n**Two Talismans of Divine Potency**\n**神** *Divine* **烈** *Fierce*\n**灵** *Numinous* **冑** *Armor*\n*Talismanic characters for expelling and healing—wondrous in application.*\n\n**For Healing:**\n- *Yellow paper, inscribed in cinnabar, placed upon a person’s* **双** *(paired points)*\n- *Black paper, inscribed in ink, placed upon a person*\n\n**崔** *Cui* **崇** *Chong*\n- *Bound with five-colored threads*\n- *Bound with double black threads*\n\n**For Suppressing:**\n- *Place* **烈** *Fierce* *in the center to treat* **崇** *malevolent influences*\n- *Expels* **邪** *demonic forces*\n- *Reduces* **热** *heat*\n- *Dispels* **寒** *cold*",
      "overlap_context": " fulfill their intent as desired.\n\n**Zhao Zhang, Spirit of the Celestial Net,**\n**Lü Xuan, Spirit of the Earthly Net,**\nThe *Ding* Forceful Warriors of the Five Directions,\nThe Dharma-Protecting Guardian Kings of the Ten Directions,\nHasten to enclose the household of [Name].\nLet the malevolent ghosts causing misfortune hasten to my *Kuí-Gāng*.\n*Swiftly, swiftly, as decreed by the Emperor’s command, save!*\n\nThis incantation is to be inscribed within an iron talisman.\n\n*Liè* – Reverse inscription.",
      "start_char": 6309,
      "end_char": 6591,
      "start_sentence": 411,
      "end_sentence": 425,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.099571466445923,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "雷 治邪用　飞 治邪用 斩 邪 崇 　凉 治邪 用 元始天经 一 急   二 速   三 令 可用加一切符上於  此三号内用口诀 解冤降邪符 芟邪熏病符 洞空五雷摄魂还魄符 符用本　　姓名人 治狂邪　　　张大壮　　 斩邪用 伐庙除凶　　 熏邪用 上清烈字符　天一玉符 烈 熏邪病　　炁 治病吞服 紫霄玉雷符 雷 祈治用 号召策役诸神符 敛 苟某　符召 上清神烈苟毕二雷君速降 毕某　臣　某奉召 右符默念天经，涂二雷君讳。 上清神烈五雷飞符 飞 通用",
      "translated_text": "**For Thunder in Treating Malevolence:**\n- *Employ* **雷** *Thunder* *to address* **邪** *demonic forces*\n- *Employ* **飞** *Flight* *to address* **邪** *demonic forces*\n- **斩** *Sever* **邪** *demonic forces* **and** **崇** *malevolent influences*\n\n**For Cooling in Treating Malevolence:**\n- *Employ* **凉** *Coolness* *to address* **邪** *demonic forces*\n\n**From the** *Primordial Heavenly Scripture*:\n- *First:* **急** *Urgent*\n- *Second:* **速** *Swift*\n- *Third:* **令** *Command*\n*These may be appended to any talisman.*\n\n**Within these Three Invocations, employ the oral incantation:**\n- *Talisman for Resolving Grievances and Subduing Demons*\n- *Talisman for Mowing Down Demons and Fumigating Illness*\n- *Talisman of the Cavernous Void’s Five Thunders for Seizing the Hun and Restoring the Po*\n\n**For talismanic use, inscribe the person’s name:**\n- *To treat* **狂邪** *raving malevolence* **—** *Example:* **张大壮** *Zhang Dazhuang*\n- **斩邪** *Severing demons* **—** *For destroying temples and eliminating inauspicious forces*\n- **熏邪** *Fumigating demons* **—** *For use*\n\n**Talismans of Divine Potency:**\n- *Upper Clarity’s* **烈** *Fierce* *Talisman*\n- *Heavenly One’s Jade Talisman*\n- **烈** *Fierce* *— for fumigating demonic illness*\n- **炁** *Qi* *— for treating illness when ingested*\n\n**Purple Empyrean Jade Thunder Talisman:**\n- **雷** *Thunder* *— for supplicatory healing*\n\n**Talismans for Summoning and Commanding the Spirits:**\n- **敛** *Gather* **苟某** *Gou [So-and-so]*\n*Talisman to summon the Upper Clarity’s Divine Fierce Lords of the Two Thunders, Gou and Bi, to descend swiftly.*\n- **毕某** *Bi [So-and-so]* **臣某** *Your servant, [So-and-so], hereby invokes.*\n\n**Right Talisman:**\n*Silently recite the Heavenly Scripture, inscribe the names of the Two Thunder Lords.*\n- *Upper Clarity’s Divine Fierce Five Thunder Flight Talisman*\n- **飞** *Flight* *— for general use*",
      "overlap_context": "s for expelling and healing—wondrous in application.*\n\n**For Healing:**\n- *Yellow paper, inscribed in cinnabar, placed upon a person’s* **双** *(paired points)*\n- *Black paper, inscribed in ink, placed upon a person*\n\n**崔** *Cui* **崇** *Chong*\n- *Bound with five-colored threads*\n- *Bound with double black threads*\n\n**For Suppressing:**\n- *Place* **烈** *Fierce* *in the center to treat* **崇** *malevolent influences*\n- *Expels* **邪** *demonic forces*\n- *Reduces* **热** *heat*\n- *Dispels* **寒** *cold*",
      "start_char": 6591,
      "end_char": 6871,
      "start_sentence": 426,
      "end_sentence": 448,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.181855201721191,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "神烈内章 狻 　　獬 二神讳小事不　　可用恐谴责 元始符命敕役万灵符祈治通用 灵 内　　　坤静　艮止 元始玄经催役万灵符 行 祈治通用 召万神香篆符 元始祖黑，飞天使者王敷。 召万神符 某事 信　香 香片上书 阴雷神君琼，阳雷神君琦。 二君并使者状，乃日月之精英，作雷霆之纲纪，於中光芒，彩映下烛。 十方用之立应。 阴淯 　　阳添 　加 右阴阳二字，阳用午前，阴用午后。 凡祈祷治病催生等事立应。 阴冲 　　阳昌 右阴阳，策雷霆，祈晴雨，通用。 同斋法。 中书临午朝，时思九色光芒。 自脐下作热，上升两眉之间，金光九彩，遍满坛庭，制魂召真。 清微仙都策命符使杨果。 冲天幞头，角眼，美女相，金甲皂衣，执节乘青龙。 召符　　　催符 右符，默念召呎敦玄阳奕郁。 清微仙都策命雷霆玉符 飞 　速 　与",
      "translated_text": "**Divine Fierce Inner Petition:**\n- **狻** *Suān* **獬** *Xiè* *— the two spirit taboos; for minor matters, must not be used lest one incur censure*\n\n**Primordial Talisman of Mandate for Commanding the Myriad Spirits:**\n- *For supplicatory healing, general use*\n- **靈** *Numinous*\n\n**Inner Petition:**\n- **坤靜** *Kun’s Stillness* **艮止** *Gen’s Halt*\n\n**Primordial Mysterious Scripture’s Talisman for Urging the Myriad Spirits:**\n- **行** *Enact* *— for supplicatory healing, general use*\n\n**Talisman of Incense Seal for Summoning the Myriad Spirits:**\n- *Primordial Ancestor’s Black, Flying Heavenly Messenger, Wang Fu.*\n\n**Talisman for Summoning the Myriad Spirits:**\n- *[For] such-and-such a matter*\n- **信** *Faith* **香** *Incense* *— inscribe on incense slips*\n\n**Yin-Thunder Spirit Lord Qiong, Yang-Thunder Spirit Lord Qi:**\n- *These two lords and their messengers are the essence of sun and moon, the regulators of thunder and lightning. Their radiance shines within, their brilliance illumines below. When employed in the ten directions, response is immediate.*\n\n**Yin-Yu** **Yang-Tian**\n- *Add the two characters \"Yin\" and \"Yang\" to the right: use \"Yang\" before noon, \"Yin\" after noon. For prayers, healing, hastening childbirth, and the like, response is immediate.*\n\n**Yin-Chong** **Yang-Chang**\n- *To the right: \"Yin\" and \"Yang\" for summoning thunder and lightning, praying for clear skies or rain, general use. Employed in the same purification rites.*\n\n**Middle Petition:**\n- *At the hour of noon, visualize nine-colored rays of light. From below the navel, generate warmth that ascends between the brows, golden light of nine hues filling the altar courtyard, controlling souls and summoning perfected beings.*\n\n**Yang Guo, Envoy of Mandate from the Pure Tenuity Immortal Capital:**\n- *Turban of soaring heaven, horned eyes, a countenance like a beautiful woman, clad in golden armor and black robes, holding a staff and riding a green dragon.*\n\n**Summoning Talisman** **Urging Talisman**\n- *To the right: silently recite the summoning incantation \"Dun Xuan Yang Yi Yu.\"*\n\n**Pure Tenuity Immortal Capital’s Talisman of Mandate for Thunder and Lightning:**\n- **飛** *Flight* **速** *Swift* **與** *Grant*",
      "overlap_context": "*\n\n**Talismans for Summoning and Commanding the Spirits:**\n- **敛** *Gather* **苟某** *Gou [So-and-so]*\n*Talisman to summon the Upper Clarity’s Divine Fierce Lords of the Two Thunders, Gou and Bi, to descend swiftly.*\n- **毕某** *Bi [So-and-so]* **臣某** *Your servant, [So-and-so], hereby invokes.*\n\n**Right Talisman:**\n*Silently recite the Heavenly Scripture, inscribe the names of the Two Thunder Lords.*\n- *Upper Clarity’s Divine Fierce Five Thunder Flight Talisman*\n- **飞** *Flight* *— for general use*",
      "start_char": 6871,
      "end_char": 7282,
      "start_sentence": 449,
      "end_sentence": 476,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.099754810333252,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "总召符使符 符召　某符使速降，　臣某奉召。 右，默念召咒直亶奕钦。 总召符召呎同前 符召　某符使速降，　臣某奉召。 召土地符 符召　当境土地正神速降，臣某奉召。 清都策命符使田仲。 召咒敦阳玄变郁。 召符 　符召　某符使速降，　臣某奉召。 九天雷火法令符使陈荣臣。 召咒昉祺於。 召符 　符召　某符使速降，　臣某奉召。 捷疾符使杨杰。 召咒遏伽。 召符 符召某符速降，臣某奉召。 右符，节制三界诸雷，诸经诸道经妙秘文。 又云碧虚至道，右座圈中用。 元始一炁信香符 书香上，命雷神帅将默祷用。 元始一炁策役妙道 右符，役三炁三界诸大雷神，无不通，无不包。 元始符命役诸天万神符 敕 总召诸部符使符",
      "translated_text": "**General Summoning Talisman for Envoy-Talismans**\n*Talisman-Summon: [Name] Envoy-Talisman, descend swiftly. Your servant [Name] receives the summons.*\nTo the right: silently recite the summoning incantation *\"Zhi Dan Yi Qin.\"*\n\n**General Summoning Talisman (Incantation as before)**\n*Talisman-Summon: [Name] Envoy-Talisman, descend swiftly. Your servant [Name] receives the summons.*\n\n**Land Spirit Summoning Talisman**\n*Talisman-Summon: Righteous Spirit of the Local Land, descend swiftly. Your servant [Name] receives the summons.*\n**Pure Capital’s Mandate Envoy Tian Zhong.**\nSummoning incantation: *\"Dun Yang Xuan Bian Yu.\"*\n\n**Summoning Talisman**\n*Talisman-Summon: [Name] Envoy-Talisman, descend swiftly. Your servant [Name] receives the summons.*\n**Nine Heavens’ Thunder-Fire Decree Envoy Chen Rongchen.**\nSummoning incantation: *\"Fang Qi Yu.\"*\n\n**Summoning Talisman**\n*Talisman-Summon: [Name] Envoy-Talisman, descend swiftly. Your servant [Name] receives the summons.*\n**Swift Envoy Yang Jie.**\nSummoning incantation: *\"E Qie.\"*\n\n**Summoning Talisman**\n*Talisman-Summon: [Name] Talisman, descend swiftly. Your servant [Name] receives the summons.*\nTo the right: governs all thunders of the Three Realms, all scriptures, all Daoist esoteric texts.\nAlso called *\"Azure Void Supreme Dao,\"* used within the right-seat circle.\n\n**Primordial Qi Incense Talisman of the Origin**\nInscribe upon incense, silently invoke the Thunder Marshal and Generals.\n\n**Primordial Qi Mandate for Subtle Dao’s Service**\nTo the right: commands the Three Qi and all great thunder deities of the Three Realms, with none beyond its reach, none beyond its embrace.\n\n**Primordial Mandate Talisman for Commanding Myriad Deities of All Heavens**\n*Decree:*\n**General Summoning Talisman for All Departmental Envoy-Talismans**",
      "overlap_context": "d beings.*\n\n**Yang Guo, Envoy of Mandate from the Pure Tenuity Immortal Capital:**\n- *Turban of soaring heaven, horned eyes, a countenance like a beautiful woman, clad in golden armor and black robes, holding a staff and riding a green dragon.*\n\n**Summoning Talisman** **Urging Talisman**\n- *To the right: silently recite the summoning incantation \"Dun Xuan Yang Yi Yu.\"*\n\n**Pure Tenuity Immortal Capital’s Talisman of Mandate for Thunder and Lightning:**\n- **飛** *Flight* **速** *Swift* **與** *Grant*",
      "start_char": 7294,
      "end_char": 7634,
      "start_sentence": 477,
      "end_sentence": 501,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.369415998458862,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "符召某符使速降，臣某奉召。 关牒后符式 命官将符使，奉达章词经疏 命雷神行用牒符 总令　　　　背文 敕 　命 总召三炁雷霆符 心咒奕宏昌 符召某帅速降，臣某奉召。 召四直使者符 城隍牒符　司命札符 先冑后符。 先月后符。 二飞催一切事 二速字符催一切事 清微天真洞经 右符，若年岁有蝗虫、水涝、五谷不熟，用此告示掌苗大神，及城隍土地等神。 洞渊神灵符 心念洞渊神灵　秘咒，书之。 雷霆枢纽，节制三界诸法极妙秘文。 此符不命将应，过往飞行雷神，见此不印不批。 凡行持先集神好香一片，黄纸朱书，催青纸朱书，紧黑纸白书。 见天处焚，自有报应。 右符中，加风云雷雨电於上。 紫光丹华妙道真君许映。 存想真君在圆光中，通用。 风 云 雷 雨 雾 电 雪 雹 晴",
      "translated_text": "**Talisman-Summon: [Name] Envoy-Talisman, descend swiftly. Your servant [Name] receives the summons.**\n\n**Format for Official Documents Following Talismans**\n*Mandate for Official Generals and Envoy-Talismans, to convey memorials, petitions, and memorialized documents.*\n\n*Mandate-Talisman for Commanding Thunder Deities’ Service*\n\n**General Mandate**\n*Reverse Inscription:*\n**Decree**\n**Mandate for Summoning the Three Qi’s Thunder and Lightning Talismans**\n*Heart Incantation: \"Yi Hong Chang\"*\n\n**Talisman-Summon: [Name] Marshal, descend swiftly. Your servant [Name] receives the summons.**\n\n**Summoning Talisman for the Four Direct Envoys**\n**City God’s Official Document-Talisman**\n**Life-Registry Talisman**\n*First the Ancestral Talisman, then the Latter Talisman.*\n*First the Monthly Talisman, then the Latter Talisman.*\n*Two \"Swift\" Talismans to hasten all matters.*\n*Two \"Urgent\" Character-Talismans to hasten all matters.*\n\n**Right Talisman from the *Dongjing* of the Pure Subtlety Heavenly Perfected**\nIf in years of locust plagues, floods, or failed harvests, use this to petition the Great Gods of the Sprouts, as well as the City Gods and Earth Gods.\n\n**Talisman of the Abyssal Divine Spirits**\nRecite the secret incantation of the Abyssal Divine Spirits and inscribe it.\n\n*Thunder’s Pivot and Axis, governing all most wondrous and secret texts of the Three Realms.*\nThis talisman does not command generals to respond; passing flying thunder deities, upon seeing it, neither seal nor endorse it without its mark.\n\nFor all practices, first gather spirit-incense of fine quality, inscribe in cinnabar on yellow paper, in cinnabar on green paper for urgency, or in white on black paper for pressing matters. Burn where Heaven is visible, and response will surely come.\n\nWithin the right talisman, add *Wind, Clouds, Thunder, Rain, Lightning* above.\n\n*Permitted by the Perfected Lord of the Wondrous Dao of Purple Radiance and Vermilion Splendor, Xu Ying.*\nVisualize the Perfected Lord within a halo of light; universally applicable.\n\n*Wind*\n*Cloud*\n*Thunder*\n*Rain*\n*Mist*\n*Lightning*\n*Snow*\n*Hail*\n*Clear Skies*",
      "overlap_context": "within the right-seat circle.\n\n**Primordial Qi Incense Talisman of the Origin**\nInscribe upon incense, silently invoke the Thunder Marshal and Generals.\n\n**Primordial Qi Mandate for Subtle Dao’s Service**\nTo the right: commands the Three Qi and all great thunder deities of the Three Realms, with none beyond its reach, none beyond its embrace.\n\n**Primordial Mandate Talisman for Commanding Myriad Deities of All Heavens**\n*Decree:*\n**General Summoning Talisman for All Departmental Envoy-Talismans**",
      "start_char": 7634,
      "end_char": 8042,
      "start_sentence": 502,
      "end_sentence": 529,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.402818202972412,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "云 雨 雷 云 雷 风 晴 雹 圆中用元始一炁都督雷府印。 一祈，二催，三信，四治，五朝元。 右书香上，或纸，或虚书金光内。 法中大用窍妙 老阴老阳天地乾坤之象少阴少阳口月坎离之象 上红下黑　火水未济　　 上黑下红　水火既济 治病芟邪，加於符上。 五 井中。 炁字符 炁 催生治病　冑 催生 丹华玉保神章保胎催生。 呒 　　吲 曲 　　延 产后 解冤降邪符 治肿 五元保生符 嘬 　　催生 催生 　　郭 关脉通开符 弼 朱次画 产后济凶运血符 建合 　　应 治胎前百病 一炁符 　　三炁符 保胎 雷 　　 治痨瘵虫下司命焚 治虎蛟蛇兵毒符 虎 　　蛟 兵 　　虎蛇",
      "translated_text": "Cloud, Rain, Thunder, Cloud, Thunder, Wind, Clear Skies, Hail—within the circle, employ the Primordial Unified Qi to command the Thunder Bureau’s seal.\n\nFirst for prayer, second for urgency, third for trust, fourth for governance, fifth for audience with the Origin.\n\nInscribe above incense, or on paper, or virtually within golden light. Within the method, these are the most wondrous and essential:\nThe images of old yin and old yang, Heaven and Earth, Qian and Kun;\nThe images of young yin and young yang, mouth and moon, Kan and Li.\n\nAbove red and below black: Fire-Water, Not Yet Crossed.\nAbove black and below red: Water-Fire, Already Crossed.\nTo treat illness and eradicate evil, add to the talisman.\n\nFive Wells within.\n\nQi-Character Talisman:\n*Qi* – Urgency for birth, treatment of illness.\n*Zuo* – Urgency for birth.\n*Cinnabar Splendor Jade Protection Divine Chapter* – Protects the fetus, hastens birth.\n*Wu* – For postpartum.\n*Yin* – Curved.\n*Yan* – Prolongs labor.\n*Postpartum Talisman for Resolving Grievances and Subduing Evil* – For swelling.\n*Five Origins Talisman for Protecting Life*:\n*Cuo* – Hastens birth.\n*Hastens birth*.\n*Guo* – *Guān-Mài* Unblocking Talisman.\n*Bi* – Red secondary strokes.\n*Postpartum Talisman for Salvaging Misfortune and Blood* – *Jian He* and *Ying*.\n*Talisman for Treating the Hundred Pregnancy Ailments*.\n*One Qi Talisman*.\n*Three Qi Talisman* – Protects the fetus.\n*Thunder* – For consumptive diseases, parasitic infestations, and the Underworld Controller: burn.\n*Talisman for Tigers, Flood Dragons, Serpents, Weapons, and Poison*:\n*Tiger*.\n*Flood Dragon*.\n*Weapons*.\n*Tiger-Serpent*.",
      "overlap_context": "paper, in cinnabar on green paper for urgency, or in white on black paper for pressing matters. Burn where Heaven is visible, and response will surely come.\n\nWithin the right talisman, add *Wind, Clouds, Thunder, Rain, Lightning* above.\n\n*Permitted by the Perfected Lord of the Wondrous Dao of Purple Radiance and Vermilion Splendor, Xu Ying.*\nVisualize the Perfected Lord within a halo of light; universally applicable.\n\n*Wind*\n*Cloud*\n*Thunder*\n*Rain*\n*Mist*\n*Lightning*\n*Snow*\n*Hail*\n*Clear Skies*",
      "start_char": 8042,
      "end_char": 8399,
      "start_sentence": 530,
      "end_sentence": 559,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.878640174865723,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "右符佩入山林境内，用告示咒唵吽听毗呢嘙听呜苏嘙听。 冑字符妙用，治诸病。 六畜 　　泄泻 　　治疟 心痛 　　肚痛　　 腰疼 肾炁 　　咽喉 　　六畜灾 治瘟 　治瘟 　　遍身疼 两手 　　两足 出汗 眼疼 清微妙道开天玉符 右符用○围，横直二寸四分阔。 中用天宝道宗印，印首尾。 有文后具位，列师如式。 三天内讳 乾 　　元 　　道 请师香信符 请师 　谢帅 右符心咒，隆育智。 天 　地 　水 开天 　通垣 　飞雷 元始便宜五开符 彻地 请师香信符",
      "translated_text": "Right Talismans—when worn upon entering mountain forests, recite the announcement incantation: *Oṃ Hūṃ Tiṇ Ṇipi Phaṭ Tiṇ Uṣṇīṣa Phaṭ Tiṇ*. The *Zhòu*-character talisman has wondrous applications and treats all diseases.\n\nLivestock\nDiarrhea\nTreats malaria\nHeart pain\nAbdominal pain\nLumbar pain\nKidney *qi*\nThroat\nLivestock calamities\nTreats pestilence\nTreats pestilence\nWhole-body pain\nBoth hands\nBoth feet\nSweating\nEye pain\n\n*Qingwei* Wondrous Dao *Kaitian* Jade Talisman\nEnclose the right talisman with a circle, two *cun* and four *fen* in both width and height. Place the *Tianbao Daozong* seal at its head and tail. Following the text, inscribe the rank and list the masters in proper form.\n\nTaboo names within the Three Heavens:\n*Qian*\n*Yuan*\n*Dao*\n\n*Qingshi Xiangxin* Talisman\nSummon the master\nThank the marshal\n\nIncantation for the right talisman’s core: *Longyu Zhi*.\n\nHeaven\nEarth\nWater\n*Kaitian*\n*Tongyuan*\n*Feilei*\n\n*Yuanshi Bianyi Wukai* Talisman\n*Chedi*\n\n*Qingshi Xiangxin* Talisman",
      "overlap_context": "ens birth*.\n*Guo* – *Guān-Mài* Unblocking Talisman.\n*Bi* – Red secondary strokes.\n*Postpartum Talisman for Salvaging Misfortune and Blood* – *Jian He* and *Ying*.\n*Talisman for Treating the Hundred Pregnancy Ailments*.\n*One Qi Talisman*.\n*Three Qi Talisman* – Protects the fetus.\n*Thunder* – For consumptive diseases, parasitic infestations, and the Underworld Controller: burn.\n*Talisman for Tigers, Flood Dragons, Serpents, Weapons, and Poison*:\n*Tiger*.\n*Flood Dragon*.\n*Weapons*.\n*Tiger-Serpent*.",
      "start_char": 8399,
      "end_char": 8716,
      "start_sentence": 560,
      "end_sentence": 582,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.61780047416687,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 22,
      "original_text": "玄帝 　天帅 常 首雪香信符 通帅人 右符心咒，完钧首明宏。 请师通用香信符 通 　 心咒降育智 启帅 　面叩 十字天经 九 　天 　应 元 　雷 　声 普 　化 　天 尊 静 　清 依 　本 　分 右三符，可安镇治病。 天 　行 　已 过 　使 　者 须 　知 右八符，岁暮安镇宅宇，可辟瘟邪。 五 　月 　五 日 　天 　中 节 官 灾 口 　舌 　尽 消 　灭 右十四符，五月五日朱书，安镇驱斥不祥，立获感通。 福 寿 康 宁 右四符，可镇安家宅。 剪 　除 　不 祥 右四符，可安镇辟邪。 清微檄万神洞章 司额",
      "translated_text": "The Dark Emperor\nHeavenly Marshal\nEver\n*Chang Shouxue Xiangxin* Talisman\nSummon the Marshal’s Attendants\nIncantation for the right talisman’s core: *Wanjun Shouming Hong*.\n\n*Qingshi Tongyong Xiangxin* Talisman\nSummon\nIncantation for the core: *Jiangyu Zhi*\nSummon the Marshal\nProstrate and bow\n\nTen-Character Heavenly Scripture\nNine\nHeaven\nResponse\nPrimordial\nThunder\nSound\nUniversal\nTransformation\nHeavenly Venerable\nSerene\nPure\nFollow\nOriginal\nAllotment\n\nThe three talismans on the right may be used to pacify, suppress, and treat illness.\n\nHeavenly\nMovement\nAlready\nPassed\nMessenger\nMust\nKnow\n\nThe eight talismans on the right, when placed at year’s end to pacify and suppress the household, may repel pestilential evil.\n\nFifth\nMonth\nFifth\nDay\nHeaven’s\nMidpoint\nFestival\nOfficial\nCalamities\nMouth\nTongue\nAll\nEliminated\nEradicated\n\nThe fourteen talismans on the right, when inscribed in vermilion on the fifth day of the fifth month, may be used to pacify, suppress, drive away inauspiciousness, and swiftly attain spiritual resonance.\n\nFortune\nLongevity\nHealth\nPeace\n\nThe four talismans on the right may pacify and secure the household.\n\nSever\nEliminate\nInauspiciousness\n\nThe four talismans on the right may pacify, suppress, and repel evil.\n\n*Qingwei* Summons to the Myriad Spirits of the Cavernous Scripture\nController of the Forehead",
      "overlap_context": "an with a circle, two *cun* and four *fen* in both width and height. Place the *Tianbao Daozong* seal at its head and tail. Following the text, inscribe the rank and list the masters in proper form.\n\nTaboo names within the Three Heavens:\n*Qian*\n*Yuan*\n*Dao*\n\n*Qingshi Xiangxin* Talisman\nSummon the master\nThank the marshal\n\nIncantation for the right talisman’s core: *Longyu Zhi*.\n\nHeaven\nEarth\nWater\n*Kaitian*\n*Tongyuan*\n*Feilei*\n\n*Yuanshi Bianyi Wukai* Talisman\n*Chedi*\n\n*Qingshi Xiangxin* Talisman",
      "start_char": 8716,
      "end_char": 9087,
      "start_sentence": 583,
      "end_sentence": 616,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.346720933914185,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 23,
      "original_text": "谨据某人为某事恭行 檄命洞章 右洞章上启： 某雷神，如何施行。 急急准 元降洞章律令。 年　月　日　时告下。 列师具位遣将。 如式。 捷疾飞龙洞章 右章，或砖瓦，或铁版书，下龙潭中，绳缚定。 下潭中，如有感通，急取。 召役二帅符 右符遣咒，郁娄郁咤。 清微天宝家书 嗣法曾玄孙姓某，即日三黛九沐，顿首。 书上万法教主玉虚师相紫皇太一天君御前。 某草芥微生法中小吏，仰依 道荫护侍，雷班夙夜，忧惶无由报效。 某昨据某处某人为某事，领词难抑。 自念嗣，法以来，行持之际，德薄任重，过多功微。 今来事势急切，不敢荒息。 伏丐道慈，一如 元降。 右谨奉尺书上 闻，恭望 垂怜，法裔特赐，启奏 帝廷，请颁 救旨。",
      "translated_text": "With reverence, [Name] respectfully executes this *Ximing* Cavernous Scripture for [Matter] on behalf of [Person]. The Cavernous Scripture above petitions:\n\nTo [Such-and-such] Thunder Deity—how shall the ritual be performed?\nSwiftly comply, in accordance with the primordial-descended Cavernous Scripture’s statutes and decrees.\nProclaimed on the [Day] of [Month], [Year], at the hour of [Time].\nThe assembled masters and officers dispatch the generals.\nAs prescribed.\n\n*Jieji Feilong* Cavernous Scripture\nThis scripture, inscribed on brick, tile, or iron plate, is to be lowered into the dragon pool, secured with rope. If spiritual resonance is felt upon immersion, retrieve it swiftly.\n\nSummons and Dispatch Talisman for the Two Marshals\nThis talisman is activated by the incantation: *Yulou Yuzha*.\n\n*Qingwei* Celestial Treasure House Epistle\nThe dharma-heir, great-grandson of the lineage, [Name], today having thrice purified with ink and ninefold bathed, prostrates in reverence.\n\nThis letter is respectfully presented before the Jade Void Preceptor, the August Supreme Heavenly Venerable One, Lord of the Primordial Unity.\n\nI, a mere speck of dust, a minor functionary within the Dao, humbly rely upon the shelter of the Way’s grace, serving day and night in the thunder ranks, yet harboring boundless anxiety over my inability to repay such favor.\n\nRecently, on behalf of [Person] from [Place] regarding [Matter], I received their plea, which could not be refused. Reflecting on my transmission of the dharma lineage, I recognize that in my practice, my virtue is meager while my responsibilities are weighty, my transgressions many and my merits few. Now, the urgency of this matter brooks no negligence.\n\nI humbly implore the compassion of the Dao, that it may be as the primordial decree. This humble letter is respectfully submitted for your attention, beseeching your merciful regard. May the dharma lineage be specially favored, and may the imperial court be petitioned to issue a decree of deliverance.",
      "overlap_context": "ourteen talismans on the right, when inscribed in vermilion on the fifth day of the fifth month, may be used to pacify, suppress, drive away inauspiciousness, and swiftly attain spiritual resonance.\n\nFortune\nLongevity\nHealth\nPeace\n\nThe four talismans on the right may pacify and secure the household.\n\nSever\nEliminate\nInauspiciousness\n\nThe four talismans on the right may pacify, suppress, and repel evil.\n\n*Qingwei* Summons to the Myriad Spirits of the Cavernous Scripture\nController of the Forehead",
      "start_char": 9087,
      "end_char": 9419,
      "start_sentence": 617,
      "end_sentence": 645,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.29491901397705,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 24,
      "original_text": "宣告某雷神，定限今月某日某时，下赴 某处如何报应。 庶使大道兴行，人天皈 向。 冒渎帝威，某不胜惶惧。 伏冀原宥不宣。 年 月 日时嗣法曾玄孙姓某拜上。 外封 右家书，事情急切可用，不得轻泄。 帝真俾令，祈祷感通。 言词简略，白纸墨书，外用角封，五色绒线缚之。 用苟毕二雷君，资持奏达。 清微神烈秘法卷下竟",
      "translated_text": "Proclamation is hereby issued to [Name] Thunder Deity, setting the appointed time as the [Day] of this month at [Hour], to descend to [Location] and render due retribution. May this ensure the flourishing of the Great Dao and the turning of humans and heavens toward reverence.\n\nI, in my temerity, have trespassed upon imperial majesty, and am overwhelmed with trepidation. Humbly I implore your pardon, leaving further words unspoken.\n\nRespectfully submitted on the [Day] of the [Month] and [Year] by [Name], humble descendant of the dharma lineage.\n\n**Outer Seal:**\nThis letter is of urgent and confidential matter—its contents must not be lightly disclosed. By the true mandate of the Emperor, communion through prayer is sought.\n\nThe words herein are few, written in ink on plain paper, sealed with a horn closure and bound with five-colored silk threads. Entrusted to the Thunder Lords Gou and Bi for transmission and presentation.\n\n*End of the Lower Scroll of the Qingwei Divine and Mighty Secret Methods*",
      "overlap_context": "lineage, I recognize that in my practice, my virtue is meager while my responsibilities are weighty, my transgressions many and my merits few. Now, the urgency of this matter brooks no negligence.\n\nI humbly implore the compassion of the Dao, that it may be as the primordial decree. This humble letter is respectfully submitted for your attention, beseeching your merciful regard. May the dharma lineage be specially favored, and may the imperial court be petitioned to issue a decree of deliverance.",
      "start_char": 9419,
      "end_char": 9582,
      "start_sentence": 646,
      "end_sentence": 658,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.745864152908325,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\清微神烈秘法.txt",
        "category": "方法类"
      }
    }
  ]
}