{
  "source_id": "渔庄邂逅录",
  "source_file": "chunked_daozang\\渔庄邂逅录.json",
  "total_chunks": 4,
  "total_original_chars": 4208,
  "total_translated_chars": 23692,
  "total_translation_time": 121.9653103351593,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\渔庄邂逅录.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "*The Fisherman’s Lodge Encounter*\n*Record of the Fisherman’s Lodge Encounter*\n*Composed by Wu Kuai of the Southern Song. One fascicle.*\n*Source text from the Zhengtong Daoist Canon, Supreme Mystery Section.*\n\n*The Fisherman’s Lodge Encounter*\n*Recorded by Ziranzi of Gaogai Mountain*\n\nIn the mid-autumn month of the ren-chen year of the Qiandao reign (1172), Ziranzi of Gaogai Mountain met Yu Zhongmou of Jinling at West Lake. By chance, they encountered the Registrar, Master Liu, at the Fisherman’s Lodge. Though they had first met in the ding-mao year (1167), they now found themselves seated together once more.\n\nMaster Liu remarked that the previous night, he had dreamed of the Perfected Wang of Fuzhou, whose words remained unfinished—yet today, Ziranzi’s discourse on the Dao seemed to align with them as if by tally. Ziranzi recalled that in his youth, he had once dreamed of the Three Mao Lords, who bestowed upon him the oral instructions of the elixir. A decade later, he encountered Master Wang, who transmitted to him the essentials of the *Scripture of Gold and Azure*. Master Liu, in particular, revered the Three Mao Lords with utmost devotion, leading Ziranzi to suspect that this was the resonance of his earlier dream.\n\nThe essentials of the *Scripture of Gold and Azure* comprise the secret formula of the Great Dragon-Tiger Elixir of Shennong, a method by which all the immortals of antiquity attained transcendence. Later generations established their own scriptures—no fewer than a hundred—all transmitted by the ancient sages to enlighten those who came after. Even today, a true gentleman does not betray his conscience within, nor shame his form without; he does not deceive Heaven above nor break his word below. How could the ancient sages and perfected ones have founded empty texts to delude future generations?\n\nAlas, the people of this world are dull of root, clinging to delusion and error, their foolishness so inverted as to evoke profound pity. As the ancients said: *\"There are no muddled immortals in Heaven.\"* Truly, these words ring true.\n\nFor the cultivation of the elixir, three like-minded individuals are required to succeed. Ziranzi has sought the Great Dao amidst the sea of humanity, searching for kindred spirits for nearly twenty-eight years, yet has found none who could harmonize with him. The ancient immortals declared: *\"Three of shared aspiration may refine the elixir.\"* Former companions on the path—Li Qiliang and Wang Jifu—have since passed away, leaving only Hu Ruogu. Though they tested the method together and saw results, their strength fell short; their gains were few, and success eluded them.\n\nNow, having chanced upon a kindred spirit, and with dreams so aligned, could this not be the work of predestined affinity? Thus, they formed a bond as fellow cultivators of the elixir, choosing the day after the White Dew (ding-wei) as their starting point. Ziranzi prepared the medicinal ingredients, Lord Yu managed the water and fire, and Master Liu was entrusted with the fire record.\n\nThe following day, Master Liu said: *\"This should be recorded.\"* Ziranzi understood that the Master’s heart was that of an ancient perfected one—his wish was to transmit what he had tested and proven, guiding those who would come after.\n\nThus, he took up his brush and recorded it, entitling it *The Fisherman’s Lodge Encounter*.\n\n**Explanation of the Great Return Elixir of Golden Liquor**\nLaozi said: *\"The Golden Liquor of the Return Elixir completes itself with Heaven.\"* Yet among the hundred methods of golden elixir, the essence lies in the divine water of the Flowery Pond. Only with divine water can white metal be born; white metal returns to yellow gold, yellow gold returns to purple gold, and purple gold flows as liquid, steaming and congealing atop the crucible to form the elixir. As *The Golden and Azure* states: *\"Yin and yang intermingle, essence and primordial qi embrace.\"* It is not comparable to material substances. Material substances, when ingested, cannot transform or steam within the body; over time, they accumulate and breed illness. Thus, the preciousness of the Golden Liquor lies in its being the primordial qi of Heaven and Earth, which steams into the five viscera, dispersing like mist or wind and rain. Wei Boyang’s *Cantong Qi* records this in detail.\n\n**The Return Elixir**\nAs *The Great Clarity Scripture* says: *\"Mercury is originally obtained from cinnabar; now, refining mercury returns it to the elixir.\"* Hence, it is called the Return Elixir. The Primordial Sovereign said: *\"Cinnabar possesses the creative transformations of Heaven and Earth; when its yin and yang qi are full, it naturally forms the elixir.\"* Within it are azurite, chalcanthite, realgar, orpiment, southern cinnabar, and northern mercury—thus, the elixir is light and pure, ascending in flight. Those who attain the Dao in this world are granted it by Heavenly Officials sent by the Supreme Emperor, and by consuming it, they ascend to the celestial river. Now, refining it in accord with Heaven and the Dao also yields these five corresponding elements, born within it—this is the transformation of the Five Phases. If one uses miscellaneous worldly substances, there can be no principle of return. Thus, those who refine their nature must sever worldly affairs, while those who refine the elixir may still keep wives and children, hold office, and bear titles. Refining one’s nature, if successful, benefits only oneself; refining the elixir, if successful, allows the entire household to ascend to Heaven. The Dao is supremely great and must be transmitted to the worthy, hence it crowns the list of elixirs. Yet though it is so, its fulfillment depends on fortune and destiny, and its great efficacy lies in human life.\n\nThe Scripture says: *\"If one accumulates much goodness, the Star of Goodness governs them; seeing goodness, they embrace it, and their endeavors will surely succeed. If one commits much evil, the Star of Evil governs them; disbelieving in goodness, the Dao of immortality becomes distant.\"* Laozi said: *\"If it can be offered, none will fail to offer it to their lord. If it can be advanced, none will fail to advance it to their kin. If it can be taught, none will fail to teach it to their brothers. If it can be transmitted, none will fail to transmit it to their descendants.\"* Were all under Heaven to become immortals, how could one not be cautious and deliberate in this?\n\n**First Transformation: Harmonizing Yin and Yang, Named \"Supreme Beginning\"**\nThe *Book of Changes* says: *\"The Dao consists of one yin and one yang; partial yin or partial yang is called illness.\"* Harmonizing yin and yang further requires matching their kinds—this is the principle of nature. The sage observes the primordial qi of Heaven and Earth, gathers the essence of the sun and moon, and takes the red and white substances, shaping them like a hen’s egg to form the primordial chaos. As *The Golden and Azure* states: *\"The hen’s egg is harmonized to give birth to the divine being.\"* In division, it resides in the two crescents; in union, it resembles joined jade disks. Through the trigrams and lines, water and fire are set in motion; through days and months, time is transformed. Yin and yang thus form black lead—this is what the Most High called *\"entering the black from the red,\"* the true practice.\n\nMaster Straw Garment said: *\"The human body exists because parents transmit qi; it is not formed from flesh.\"* The supreme medicine is likewise. The Kan male and Li female, their natures and feelings interdependent, conjoin their qi to form the embryo—even sages are born from the womb, hence it is said *\"from the common to the sacred.\"* Yet the qi received must be sufficient. Master Zheng said: *\"If the qi received is sufficient, one is intelligent; if insufficient, one is dull-witted.\"* This must not be overlooked.\n\nIt is also called *\"Primordial Lead,\"* for before Heaven and Earth existed, in the beginning of the primordial chaos, lead was the first to take form, being the primordial qi of Heaven and Earth. Master Peng said: *\"Human lifespan, strength, and weakness all depend on the primordial qi received from parents—yet this is a turbid, disordered body with limits. The Great Elixir is the sacred womb of the Divine Mother, the primordial qi of Heaven and Earth, hence boundless. Using the boundless to continue the limited, how could one not share the lifespan of Heaven and Earth?\"* For in the world, this lead did not originally exist; it arises through creation and transformation. The Dao is born from non-being; being is the beginning of Heaven and Earth. Once there is being, it is named the mother of the myriad things.\n\nIt is also said: *\"The Dao gives birth to the One; penetrating the One, all affairs are complete.\"* Black lead pertains to water, its number is one; if one can penetrate this, the great work of the elixir is accomplished. Now, those who discuss the Dao point to the principle of non-being as emptiness—how could they know that within the profound and obscure, there is essence?\n\n**Second Transformation: Primordial Chaos and Embryonic Radiance, Named \"Supreme Ultimate\"**\nThe Scripture says: *\"That which is unfathomable in yin and yang is called the divine.\"* This lead is a divine being born of Heaven, incomparable to the five metals and eight minerals of the world. Within it are contained Heaven and Earth, sun and moon, yin and yang, the Eight Trigrams, the Five Phases, and the principles of the myriad things. Fu Xi’s *Book of Changes* and Shennong’s *Scripture of the Golden and Azure* both record this Dao.\n\nNow, the thirty-six characters correspond internally and externally with the Eight Trigrams of the *Book of Changes*. The dragon and tiger, vermilion bird and dark warrior are the Four Symbols; the sun and moon are Kan and Li; fire, water, earth, wood, and metal are the Five Phases; green, white, black, azure, red, yellow, and purple are the Nine Palaces; Heaven and Earth are Qian and Kun. Xun is the eldest daughter, Gen the youngest son, Zhen the eldest son, Dui the youngest daughter; Jia, Bing, Wu, Geng, Ren, Yi, Ding, Ji, Xin, and Gui are the transformations of the Five Phases—here, the Dao of the Great Elixir is revealed, and this lead is it.\n\nNow, scholars of the present, each expounding their theories and galloping in confusion, without encountering a transmitted teaching—how could they exhaust principle and fulfill their nature to attain destiny?\n\nThe Elixir arises from the intercourse of the sun and moon, hence its pattern embodies the meaning of their union. Thus the *Book of Changes* adopts the principle of sun and moon, placing Qian and Kun at the head of the hexagrams. Qian is pure yang, the qi of white metal, firm and strong, residing above as Heaven. Kun is pure yin, the substance of water and earth, yielding and soft, dwelling below as Earth. When above and below interact, Qian’s yang enters Kun, forming Kan; Kun’s yin enters Qian, forming Li. Kan and Li are the sun and moon, the male and female of Heaven and Earth. Within the sun is the crow, within the moon the hare—yin contains yang, yang contains yin. This lead is the essence of sun and moon, the soul and spirit of Heaven and Earth. Guangchengzi said: \"Refine the marrow of Heaven and Earth’s yin and yang.\" The forging of the Great Elixir begins here.\n\nIn the third transformation, the Two Modes divide, distinguishing yin and yang. The Classic states: \"Heaven attains the One and becomes clear; Earth attains the One and becomes tranquil; Man attains the One and becomes numinous.\" The One refers to the True One. When this lead is placed in the crucible and mercury is poured over it, golden flowers naturally emerge on the surface—this is the light, clear qi, the image of Qian. The cinnabar and earth envelop it externally—this is the heavy, turbid substance, the image of Kun. The *Record of the Armillary Sphere* says: \"Heaven envelops Earth like the yolk within the shell.\" Herein lies the principle of Heaven and Earth. Pure yang is accumulated qi, which cannot but move and ascend. Pure yin clings to form, which cannot but remain still and settle below. The meaning of yin and yang is thus revealed. The *Daoist Classic* states: \"Pure yang becomes an immortal; pure yin becomes a ghost. Man dwells between Heaven and Earth, endowed with the qi of yin and yang, moving in and out of life and death.\" The Elixir is the medicine of eternal life. If one refines and obtains it, using mercury to temper it and circulating the fire-qi to completion, once the primordial chaos is divided, the yin within Li will depart, and the yang within Kan will be made whole, restoring the body of Qian—thus becoming a purely yang substance. When ingested, one attains immortality, as if by natural consequence. The *Book of Changes* says: \"That which is rooted in Heaven inclines upward\"—the body becomes light and soars, again as if by natural consequence. Only then may it be called cinnabar, not the cinnabar of this world. Thus the ancient song says:\n*\"White Horse Sprout, true cinnabar.\nHuainan King refined autumn stone; the Yellow Emperor praised golden flowers.\"*\nAnd further:\n*\"Lead is the mother of the sprout; the sprout is the child of lead.\nOnce the golden flowers are seen, abandon lead and do not employ it.\"*\nFor the golden flowers, being pure yang, become companions of Heaven. The leaden husk, a yin thing, once the River Chariot’s conveyance is complete, is of no further use. Thus it is said: \"Emerging from yin, entering yang, transcending the ordinary, and ascending to sagehood.\" Thereafter, quicksilver alone abides in profound mystery.\n\nIn the fourth transformation, the Five Phases are drilled and clustered, transmuting into the Four Spirits. The ancient song says:\n*\"No need for medicines, employ the Five Phases.\nThe dragon emerges from fire; the tiger is born in water.\"*\nThis White Horse Sprout is the golden flower, the White Tiger born in the black lead’s water. Moreover, when the finest cinnabar is sublimed to produce mercury, this is the dragon emerging from fire. Placing the two together, grind them three thousand times in a jade mortar with a pestle until they merge—this is called \"bathing.\" The *Mirror of Medicines* says:\n*\"The Red Dragon is Qian’s virtue; the White Tiger is likewise constant.\nGrind the dragon to powder, and the tiger will naturally match it.\"*\nThen wash them with pure spring water, which turns a deep azure, indistinguishable from the sky. Here, the sequence of *Gold and Azure*—one white, two black, three green, four azure—becomes visible. Returning them to the crucible and circulating the fire-qi to completion, what emerges naturally assumes the forms of azurite, chalcanthite, male and female cinnabar, and mercuric cinnabar—five hues in all. The green is mercury, the essence of the Azure Dragon of wood. The white is the golden flower, the essence of the White Tiger of metal. The red is cinnabar, the essence of the Vermilion Bird of fire. The black is black lead, the essence of the Dark Warrior of water. These four are sacred and unknowable, hence called the Four Spirits, also named the Sacred Unknowable. Cao Yi Zi said: \"When the Elixir reaches these Four Spirits, all gods and men revere them, as they do Heaven, Earth, sun, and moon—none dare offend, for the divine will surely punish.\"\n\nIn the fifth transformation, all changes proceed from the Central Palace’s earthly virtue. The Classic states: \"The number of Heaven is five; the number of Earth is five. The five positions interact, each having its correspondence.\" The five refers to the Central Palace of earth, the beginning and end of all things’ generation. Thus water, with earth, completes the number six; fire, with earth, completes seven; wood, with earth, completes eight; metal, with earth, completes nine; earth, with earth, completes ten. Having refined the Elixir to the Four Symbols, it must attain earth before completion. Thus Zi Yang said: \"Both embrace true earth, enabling the Golden Elixir’s return.\" The dragon emerging from fire refers to wood (three) and fire (two) combining to make five, rotating left to form wu earth. The tiger born in water refers to metal (four) and water (one) likewise combining to make five, rotating right to form ji earth. Both embrace true earth, returning to five, and their union with five is thus evident. The forging of the Great Elixir lies entirely in the dual function of metal and fire—the path of return through seven red and nine purple. When the completion numbers of metal and fire are fulfilled, the generative and consummative numbers of the *River Chart* become visible. The *Jade Flask Ode* of the Supreme Unity True Lord says:\n*\"The Chamber is the Azure Dragon; the Dipper is the Tiger.\nThe sun is the Vermilion Bird; the moon, the Dark Warrior.\nTo establish the foundation of the Great Medicine, one must obtain the central wu and ji earth.\"*\nTaking the Four Spirits, bathe them as before, return them to the crucible, and circulate the fire-qi to completion. They will merge into true earth, within which the golden flower naturally appears.\n\nUpon witnessing the golden flower, one may proceed with the *gou* and *liu* techniques. Master Cui states: *\"Dry mercury *gou*s, damp mercury *liu*s—none escapes its grasp.\"* Thus, the *gou* and *liu* serve as verification. *The Elbow-Behind Manual* says: *\"Upon seeing this earth, the Elixir is achieved.\"* Master Cui also calls it the *\"Dragon Embryo Great Medicine,\"* for within this earth, the Elixir’s body is forged, like a child within the mother’s womb.\n\nMaster Straw-Cloak says: *\"If one’s great merit and conduct are not yet complete, ascension cannot be achieved. Should one halt cultivation at this stage, one may ward off illness, prolong life, and dwell in the world as an earthbound immortal.\"* However, when this medicine is refined to the third revolution, the impure embryo becomes a body of pure yang—a light, ethereal, soaring substance. If water and fire deviate from their proper measure, the primordial qi scatters, and the medicine loses its efficacy. Though one may see the earth, it will have form but no spirit; ingesting it will only lead to fleeting, insubstantial effects, like scattered mist or drifting smoke, ultimately dissipating into the intestines. While it may cure illness, prolonged use will breed new ailments.\n\nMaster Yin Changsheng says: *\"Success or failure lies in the fire of *mao* and *you*; the interplay of punishment and virtue must not be overlooked.\"* From ancient times to the present, cultivators have regarded this as the great essential.\n\n**Master Straw-Cloak’s Fire Timing Formula:**\nThe fire begins at the first revolution, rising in the eleventh month at the winter solstice, at the midnight hour of *zi*, receiving the qi of one yang—this is the *Fu* hexagram, its first yang line a *\"hidden dragon,\"* awaiting its time to act, steadfast and unshakable. The twelfth month brings the *Lin* hexagram, its second yang line a *\"dragon seen in the field,\"* the virtue of a ruler. The first month is the *Tai* hexagram, its third yang line a *\"noble one advancing in virtue,\"* nearing the subtle. The second month is the *Dazhuang* hexagram, its fourth yang line a *\"dragon leaping in the abyss,\"* seizing the moment—here, the mercury in the medicine rises and falls without fixed place. The third month is the *Guai* hexagram, its fifth yang line a *\"flying dragon in the heavens,\"* having attained its will—the medicine accumulates yang to become heaven. The fourth month is the *Qian* hexagram, its top yang line: *\"A dragon soaring too high meets regret.\"* At this time, the medicine is complete, the body of *Qian* fully realized; no further transformation is possible. One must accumulate merit and conduct, then, in a pure and secluded place—a sacred mountain or auspicious site—purify oneself with fasting and ablutions before proceeding. The crucible, furnace, and fire timing differ from before. In the alchemical chamber, water and fire must never be separated for even a moment; the incense smoke must burn ceaselessly. For this is a substance of pure yang, its power equal to the workings of creation.\n\n*Baopuzi* and various scriptures state: *\"At this time, one must offer sacrifices to the furnace and to the Supreme Unity and all gods, inviting them to oversee and assist in the medicine’s formation.\"* The Daoist must not harbor wayward thoughts or allow any defilement to arise, for these will create obstacles—hence the warning of *\"regret.\"* Cultivators must take heed: many have faltered thus before—some failing to complete the work, others completing it but unable to ingest it, still others ingesting it without effect, then deeming it demonic. Little do they know that cinnabar, a yang substance, is feared by ghosts and spirits; how much more so when refined to pure yang—how could yin demons dare approach? This principle is clear: be vigilant, be vigilant.\n\nIf one adheres to the prohibitions, the medicine will gradually become spiritually responsive. One may then proceed to the transmutation of base metals into gold and silver, advancing to the ninth revolution, where the fire of the Purple Yang Palace is perfected and merit is fulfilled. A single grain of this medicine can transform a parrot into a phoenix, a dog into a dragon, and transmute metals and stones into supreme treasures. Cultivators should study the formulas in the scriptures and deduce the principles therein—this fisherman’s hut cannot record them all.\n\nAn ancient song says:\n*\"Words fail to express it—\nBeneath the pines, we may discuss it well.\"*\nAnother says:\n*\"When people ask of the Jiangnan scene,\nI say: ‘You must walk the path to know.’\"*\n\nOnce, after Master Huang annotated the *Scripture of the Dragon and Tiger*, he left this poem:\n*\"Things unrecognized are scorned as cheap;\nWords too profound are lightly dismissed.\nLast night, leaning on the railing, I sighed long—\nFor whom does this autumn moon shine bright?\"*\nHe lamented the rarity of kindred spirits.\n\nNow that this record has been made, it is no idle transcription. In joy, I compose four rhymed lines to append at the volume’s end:\n*\"Within the Elixir, divine water and the Flower Pool—\nSeekers are many, the awakened few.\nPointing to qi and essence as creation’s work,\nWho knows the lead and mercury hold depths profound?\nLost on the path, delusion breeds wayward views;\nWho now will guide them back to the Great Way?\nToday we meet by fate’s old bond—\nWith you, I lightly reveal heaven’s mystery.\"*\n\n**Eleventh month, eighteenth day:** The furnace is opened, and primordial lead is obtained. A record of the truth:\n*\"The union of yin and yang follows nature’s law,\nYielding this substance called ‘primordial.’\nWonder within wonder—wondrous, truly wondrous!\nDepth within depth—profound, ever profound.\nA hundred days of effort at the outset,\nSeizing the workings of creation for a thousand years.\nStudy the *Fisherman’s Hut Record* in detail—\nThen you’ll believe immortals are not falsely proclaimed.\"*\n\n**Second month, thirteenth day:** The ash pool is heated and scorched, yielding the *\"Chaotic Embryo Spleen.\"*\n*\"The ash pool’s heat determines rise and fall—\nOnly upon seeing it does one know creation’s depth.\nThis thing was never in the world before;\nAmong men, few are its true kindred.\nVague and indistinct, it departs the Li Palace’s origin;\nDim and distant, it is the Kan House’s metal.\nDo not boast of success upon gaining it—\nOne must diligently cultivate merit to align with heaven’s will.\"*\n\nHere ends the *Fisherman’s Hut’s Chance Encounters Record.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "渔庄邂逅录 经名：渔庄邂逅录。 南宋吴快撰。 一卷。 底本出处：《正统道藏》太玄部。 渔庄邂逅录 高盖山人自然子述 乾道八年岁次壬辰仲秋之月，高盖山人自然子，会金陵虞仲谋，西湖乘兴，因邂逅都录刘先生於渔庄。 因丁卯岁曾瞻识，今复遇坐中。 先生因语，昨梦福州王真人言未讫，而自然今日谈道，若合符契。 昔自然子，幼尝梦三茅君，授以丹诀。 后十年遇王先生，传《金碧经》旨，而刘先生奉三茅君尤谨，疑其昔梦所感也。 《金碧经》旨，乃神农龙虎大丹秘诀，历古神仙，莫不由此。 后皆立一经，何啻百数，皆古圣相传，开悟后学。 今之君子，犹内不负心，外不愧形，上不欺天，下不食言。 况古圣真人立虚文，诳误将来，何至是乎。 奈何世人根钝，妄执迷谬，愚鲁颠倒，深可哀愍。 古人云：天上无懵懂神仙，诚哉是言也。 凡修丹，须要三人同心，方可成事。 今自然子遇大道於人海中，遍寻知音，几二十八年，未见有参同者。 古仙云：三人同志可修丹。 前向道之友李启亮、王及甫，皆相继而亡，惟胡若谷存。 同试见效而力不及，所获者寡，未能成功。 今既邂逅知音，梦又若此，岂非宿绿。 由是结为丹友，以白露后一日丁未为首。 自然子治药物，虞公运水火，而属先生修火记焉。 居翌日，先生日：可以记之。 愚知先生之心，亦古至人之心，欲以所试见效，传之将来，接引后进耳。",
      "translated_text": "*The Fisherman’s Lodge Encounter*\n*Record of the Fisherman’s Lodge Encounter*\n*Composed by Wu Kuai of the Southern Song. One fascicle.*\n*Source text from the Zhengtong Daoist Canon, Supreme Mystery Section.*\n\n*The Fisherman’s Lodge Encounter*\n*Recorded by Ziranzi of Gaogai Mountain*\n\nIn the mid-autumn month of the ren-chen year of the Qiandao reign (1172), Ziranzi of Gaogai Mountain met Yu Zhongmou of Jinling at West Lake. By chance, they encountered the Registrar, Master Liu, at the Fisherman’s Lodge. Though they had first met in the ding-mao year (1167), they now found themselves seated together once more.\n\nMaster Liu remarked that the previous night, he had dreamed of the Perfected Wang of Fuzhou, whose words remained unfinished—yet today, Ziranzi’s discourse on the Dao seemed to align with them as if by tally. Ziranzi recalled that in his youth, he had once dreamed of the Three Mao Lords, who bestowed upon him the oral instructions of the elixir. A decade later, he encountered Master Wang, who transmitted to him the essentials of the *Scripture of Gold and Azure*. Master Liu, in particular, revered the Three Mao Lords with utmost devotion, leading Ziranzi to suspect that this was the resonance of his earlier dream.\n\nThe essentials of the *Scripture of Gold and Azure* comprise the secret formula of the Great Dragon-Tiger Elixir of Shennong, a method by which all the immortals of antiquity attained transcendence. Later generations established their own scriptures—no fewer than a hundred—all transmitted by the ancient sages to enlighten those who came after. Even today, a true gentleman does not betray his conscience within, nor shame his form without; he does not deceive Heaven above nor break his word below. How could the ancient sages and perfected ones have founded empty texts to delude future generations?\n\nAlas, the people of this world are dull of root, clinging to delusion and error, their foolishness so inverted as to evoke profound pity. As the ancients said: *\"There are no muddled immortals in Heaven.\"* Truly, these words ring true.\n\nFor the cultivation of the elixir, three like-minded individuals are required to succeed. Ziranzi has sought the Great Dao amidst the sea of humanity, searching for kindred spirits for nearly twenty-eight years, yet has found none who could harmonize with him. The ancient immortals declared: *\"Three of shared aspiration may refine the elixir.\"* Former companions on the path—Li Qiliang and Wang Jifu—have since passed away, leaving only Hu Ruogu. Though they tested the method together and saw results, their strength fell short; their gains were few, and success eluded them.\n\nNow, having chanced upon a kindred spirit, and with dreams so aligned, could this not be the work of predestined affinity? Thus, they formed a bond as fellow cultivators of the elixir, choosing the day after the White Dew (ding-wei) as their starting point. Ziranzi prepared the medicinal ingredients, Lord Yu managed the water and fire, and Master Liu was entrusted with the fire record.\n\nThe following day, Master Liu said: *\"This should be recorded.\"* Ziranzi understood that the Master’s heart was that of an ancient perfected one—his wish was to transmit what he had tested and proven, guiding those who would come after.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 541,
      "start_sentence": 0,
      "end_sentence": 27,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.36763572692871,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\渔庄邂逅录.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "遂秉笔书之，因目为《渔庄邂逅录》云。 释金液大还丹名 老子云：还丹金液，与天相毕。 而金丹之术百数，其要在神水华池。 须得神水，然后生白金，白金返黄金，黄金返紫金，紫金流液，熏结鼎上而成丹。 《金碧》所谓阴阳混交接，精液包元气。 非有质之物可比也。 有质之物入人肠胃，不能变化熏蒸，久而蕴结成疾。 所以贵乎金液者，乃天地之元气，熏蒸入五内，雾散若风雨。 魏公《参同契》载之详矣。 还丹者，《太清经》云：水银本是丹砂得，今炼水银还丹成。 故曰还丹。 元君曰：砂有天地造化，阴阳气足，自然成丹者。 内有曾青、胆矾、束雄黄、西雌黄、南朱砂、北水银，而丹则轻清飞腾於上。 凡世之得道者，乃上帝遣天官，采以赐之，而服食遂登云汉。 今体天法道而炼之，亦有此五相类，生於其问，乃五行之化也。 若以世上杂类为之，必无还返之理矣。 故炼性者，必绝去世务。 而炼丹者亦畜妻子，居官爵。 炼性若成，止於一身。 炼丹若成，举宅升天。 道至大而必授贤者，故冠草丹之首。 虽然在有福而有分，而成其大用人命。 经云：若积善多，善星主之，见善则善，而为之必成。 若为恶多，恶星主之，而不信善，仙道远矣。 老君日：可得而献，则人莫不献之其君。 可得而进，则人莫不进其亲。 可得而教，则人莫不教其兄弟。 可得而传，则人莫不传之子孙。 率土皆为仙矣，诚可慎之味之。 第一转配合阴阳名曰太初 《易》日：一阴一阳之谓道，偏阴偏阳之谓疾。 而配合阴阳，又须得类，自然之理也。 圣人由是观天地之元气，采日月之精华，取赤白二物，象鸡子形，以为混沌。 《金碧》所谓鸡子配合，而生神物是也。 分数则寓於两弦，交会则犹於合璧，以卦爻而运水火，以时日而易岁月，俾阴阳而成黑铅，太上所谓从红入黑是真修是也。 草衣子云：人之有身，因父母传气而生，非肉所化。 至药亦然。 坎男离女，性情相依，结气而成由、圣人亦从胎生，故日从凡入圣也。 然受气须足。 郑真人云：受气若足，为人聪明。 受气不足，为人暗珠。 不可不知。 又名先天铅，谓古未有天地，混沌之初，铅得一而先形，乃天地之元气也。 彭真人云：人之寿夭强弱，皆因父母元气所禀然，乃浊乱之身而有限。 大丹乃圣母灵胎，天地之元气，故无涯。 以无涯而续有限，安得不与天地同寿耶。 盖世问本无此铅，而因造化而有也。 道生於无，有者乃天地之始。 有也遂名，为万物母也一又云：道生一，通於一，万事毕。 盖黑铅属水，其数一，人能通此，则大丹能事毕矣。 今世人谈道，指无之理而为虚空，又岂知杳杳冥冥，其中有精耶。 第二转混沌胚辉名曰太极 经曰：阴阳不测之谓神，此铅乃天生神物，非世上五金八石之比。 其中包括天地日月，阴阳八卦五行，万物之理。 伏羲氏之《易》，神农氏之《金碧经》，皆载此道也。 今夫三十六字，与《易》八卦相为表裹。 日龙虎朱雀玄武，即四象也。 日月即坎离也，火水土木金即五行也。 青白黑碧绿黄赤紫即九宫，天地即乾坤也。 巽长女也，艮少男也，震为长男也，兑为少女也，甲丙戊庚壬乙丁己辛癸，此五行之变，大丹之道着矣，此铅是也。 今之学者，各肆说纷纷驰骋，不遇师传，安能穷理尽性，以至於命者乎。",
      "translated_text": "Thus, he took up his brush and recorded it, entitling it *The Fisherman’s Lodge Encounter*.\n\n**Explanation of the Great Return Elixir of Golden Liquor**\nLaozi said: *\"The Golden Liquor of the Return Elixir completes itself with Heaven.\"* Yet among the hundred methods of golden elixir, the essence lies in the divine water of the Flowery Pond. Only with divine water can white metal be born; white metal returns to yellow gold, yellow gold returns to purple gold, and purple gold flows as liquid, steaming and congealing atop the crucible to form the elixir. As *The Golden and Azure* states: *\"Yin and yang intermingle, essence and primordial qi embrace.\"* It is not comparable to material substances. Material substances, when ingested, cannot transform or steam within the body; over time, they accumulate and breed illness. Thus, the preciousness of the Golden Liquor lies in its being the primordial qi of Heaven and Earth, which steams into the five viscera, dispersing like mist or wind and rain. Wei Boyang’s *Cantong Qi* records this in detail.\n\n**The Return Elixir**\nAs *The Great Clarity Scripture* says: *\"Mercury is originally obtained from cinnabar; now, refining mercury returns it to the elixir.\"* Hence, it is called the Return Elixir. The Primordial Sovereign said: *\"Cinnabar possesses the creative transformations of Heaven and Earth; when its yin and yang qi are full, it naturally forms the elixir.\"* Within it are azurite, chalcanthite, realgar, orpiment, southern cinnabar, and northern mercury—thus, the elixir is light and pure, ascending in flight. Those who attain the Dao in this world are granted it by Heavenly Officials sent by the Supreme Emperor, and by consuming it, they ascend to the celestial river. Now, refining it in accord with Heaven and the Dao also yields these five corresponding elements, born within it—this is the transformation of the Five Phases. If one uses miscellaneous worldly substances, there can be no principle of return. Thus, those who refine their nature must sever worldly affairs, while those who refine the elixir may still keep wives and children, hold office, and bear titles. Refining one’s nature, if successful, benefits only oneself; refining the elixir, if successful, allows the entire household to ascend to Heaven. The Dao is supremely great and must be transmitted to the worthy, hence it crowns the list of elixirs. Yet though it is so, its fulfillment depends on fortune and destiny, and its great efficacy lies in human life.\n\nThe Scripture says: *\"If one accumulates much goodness, the Star of Goodness governs them; seeing goodness, they embrace it, and their endeavors will surely succeed. If one commits much evil, the Star of Evil governs them; disbelieving in goodness, the Dao of immortality becomes distant.\"* Laozi said: *\"If it can be offered, none will fail to offer it to their lord. If it can be advanced, none will fail to advance it to their kin. If it can be taught, none will fail to teach it to their brothers. If it can be transmitted, none will fail to transmit it to their descendants.\"* Were all under Heaven to become immortals, how could one not be cautious and deliberate in this?\n\n**First Transformation: Harmonizing Yin and Yang, Named \"Supreme Beginning\"**\nThe *Book of Changes* says: *\"The Dao consists of one yin and one yang; partial yin or partial yang is called illness.\"* Harmonizing yin and yang further requires matching their kinds—this is the principle of nature. The sage observes the primordial qi of Heaven and Earth, gathers the essence of the sun and moon, and takes the red and white substances, shaping them like a hen’s egg to form the primordial chaos. As *The Golden and Azure* states: *\"The hen’s egg is harmonized to give birth to the divine being.\"* In division, it resides in the two crescents; in union, it resembles joined jade disks. Through the trigrams and lines, water and fire are set in motion; through days and months, time is transformed. Yin and yang thus form black lead—this is what the Most High called *\"entering the black from the red,\"* the true practice.\n\nMaster Straw Garment said: *\"The human body exists because parents transmit qi; it is not formed from flesh.\"* The supreme medicine is likewise. The Kan male and Li female, their natures and feelings interdependent, conjoin their qi to form the embryo—even sages are born from the womb, hence it is said *\"from the common to the sacred.\"* Yet the qi received must be sufficient. Master Zheng said: *\"If the qi received is sufficient, one is intelligent; if insufficient, one is dull-witted.\"* This must not be overlooked.\n\nIt is also called *\"Primordial Lead,\"* for before Heaven and Earth existed, in the beginning of the primordial chaos, lead was the first to take form, being the primordial qi of Heaven and Earth. Master Peng said: *\"Human lifespan, strength, and weakness all depend on the primordial qi received from parents—yet this is a turbid, disordered body with limits. The Great Elixir is the sacred womb of the Divine Mother, the primordial qi of Heaven and Earth, hence boundless. Using the boundless to continue the limited, how could one not share the lifespan of Heaven and Earth?\"* For in the world, this lead did not originally exist; it arises through creation and transformation. The Dao is born from non-being; being is the beginning of Heaven and Earth. Once there is being, it is named the mother of the myriad things.\n\nIt is also said: *\"The Dao gives birth to the One; penetrating the One, all affairs are complete.\"* Black lead pertains to water, its number is one; if one can penetrate this, the great work of the elixir is accomplished. Now, those who discuss the Dao point to the principle of non-being as emptiness—how could they know that within the profound and obscure, there is essence?\n\n**Second Transformation: Primordial Chaos and Embryonic Radiance, Named \"Supreme Ultimate\"**\nThe Scripture says: *\"That which is unfathomable in yin and yang is called the divine.\"* This lead is a divine being born of Heaven, incomparable to the five metals and eight minerals of the world. Within it are contained Heaven and Earth, sun and moon, yin and yang, the Eight Trigrams, the Five Phases, and the principles of the myriad things. Fu Xi’s *Book of Changes* and Shennong’s *Scripture of the Golden and Azure* both record this Dao.\n\nNow, the thirty-six characters correspond internally and externally with the Eight Trigrams of the *Book of Changes*. The dragon and tiger, vermilion bird and dark warrior are the Four Symbols; the sun and moon are Kan and Li; fire, water, earth, wood, and metal are the Five Phases; green, white, black, azure, red, yellow, and purple are the Nine Palaces; Heaven and Earth are Qian and Kun. Xun is the eldest daughter, Gen the youngest son, Zhen the eldest son, Dui the youngest daughter; Jia, Bing, Wu, Geng, Ren, Yi, Ding, Ji, Xin, and Gui are the transformations of the Five Phases—here, the Dao of the Great Elixir is revealed, and this lead is it.\n\nNow, scholars of the present, each expounding their theories and galloping in confusion, without encountering a transmitted teaching—how could they exhaust principle and fulfill their nature to attain destiny?",
      "overlap_context": "s, they formed a bond as fellow cultivators of the elixir, choosing the day after the White Dew (ding-wei) as their starting point. Ziranzi prepared the medicinal ingredients, Lord Yu managed the water and fire, and Master Liu was entrusted with the fire record.\n\nThe following day, Master Liu said: *\"This should be recorded.\"* Ziranzi understood that the Master’s heart was that of an ancient perfected one—his wish was to transmit what he had tested and proven, guiding those who would come after.",
      "start_char": 541,
      "end_char": 1785,
      "start_sentence": 28,
      "end_sentence": 89,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.34437441825867,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\渔庄邂逅录.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "夫丹者，乃日月交感而生，故其文象日月混成之义。 故《易》取日月之义，而卦首乾坤者。 乾本纯阳，乃白金之气，刚健而居上为天。 坤本纯阴，乃水土之质，柔顺而居下为地。 上下交感，乾坤之阳入於坤，是谓之坎。 坤中之阴入於乾，是谓之离。 坎离者，日月也。 乃天地之男女也。 日中有乌，月中有兔，阴中有阳，阳中有阴，此铅乃日月之精华，天地之魂魄也。 广成子日：纯烧天地阴阳髓。 炼大丹当自此始。 第三转二仪剖判分别阴阳 经曰：天得一以清，地得一以宁，人得一以灵。 一者，真一之谓也。 将此铅入鼎中，以汞浇之，自然金花出而在外，轻清之气，乾之象也。 砂土包而在外，重浊之质，坤之象也。 《浑仪记》日：天包地如壳中之黄，天地之理，於斯见矣。 纯阳者积气也，不得不动而升上。 纯阴者附形也，不得不静而处下。 阴阳之义，於斯着矣。 道经曰：纯阳为仙，纯阴为鬼，人也者，居天地之中，而禀阴阳之气，出入乎生死。 丹者，长生不死之药。 若炼而得此，．用汞浇之，运火气足，混沌既判，离中之阴自出，坎中之阳自全，复为乾体，乃为纯阳之物，人服得仙，不期然而然也。 《易》曰：本乎天者亲上，身轻飞腾，亦不期然而然也。 如此然后，得名为丹砂，非世上之丹砂。 故古歌日：白马芽，真丹砂。 淮南王炼秋石，黄帝美金花。 又日：铅是芽之母，芽是铅之子。 既得见金花，舍铅还不使。 为金花既是纯阳，则与天为徒。 而铅壳阴物，而河车般运既毕，亦无用矣，故云出阴入阳，超凡入圣。 自是之后，水银一味，独幽玄矣。 第四转钻簇五行变化四神 古歌云：不用药，用五行，龙从火裹出，虎向水中生。 此白马芽，乃金华白虎，向黑铅水中生也。 又以上等好丹砂，飞出水银，乃龙从火裹出也。 二物一处，用玉乳锤钵，研三千下，令相入，谓之沐浴。 《药镜》云：赤龙乾之德，白虎亦如常。 研龙使如粉，吸虎自相当。 是也。 遂以清泉净浴，其水苍苍色，与天无异。 则《金碧》中一白二黑三绿四碧之次序，於此可见。 再入鼎中，运火气足，所出自然有曾青、胆矾、雄雌、砂汞五彩之状。 青者水银，苍龙木精。 白者金华，白虎金精。 赤者丹砂，朱雀火精。 黑者黑铅，玄武水精。 此四者圣而不可知，故谓之四神，又名为圣无知。 草衣子云：炼丹至此四神，一切天人，莫不敬仰，犹天地日月，不可触犯，神明必罚矣。 第五转变化尽由中宫土德 经曰：天数五，地数五，五位相得，而各有合。 五者，中宫土位，万物生成之始终也。 故水得土而成数六，火得土而成数七，木得土而成数八，金得土而成数九，土得土而成数十。 炼丹既有四象，必得土而后成。 故紫阳曰：都绿彼此怀真土，遂使金丹有返还。 所谓龙从火裹出者，乃木三火二同为五，左转而成戊土也。 虎向水中生，乃金四水一，亦同为五，右转而为己土也。 彼此各怀真土，至此而复归于五，与五合成可知矣。 炼大丹全在金火二用，七赤九紫，还返之道。 金火之成数毕，而河图生成之数，筑可见矣，太乙真君玉壶颂云：房是青龙参是虎，日为朱雀月玄武。 欲知大药立玄基，须得中央戊己土。 右取四神，依前沐浴，再入鼎中，运火气足，并化真土，其中自然现出金华。",
      "translated_text": "The Elixir arises from the intercourse of the sun and moon, hence its pattern embodies the meaning of their union. Thus the *Book of Changes* adopts the principle of sun and moon, placing Qian and Kun at the head of the hexagrams. Qian is pure yang, the qi of white metal, firm and strong, residing above as Heaven. Kun is pure yin, the substance of water and earth, yielding and soft, dwelling below as Earth. When above and below interact, Qian’s yang enters Kun, forming Kan; Kun’s yin enters Qian, forming Li. Kan and Li are the sun and moon, the male and female of Heaven and Earth. Within the sun is the crow, within the moon the hare—yin contains yang, yang contains yin. This lead is the essence of sun and moon, the soul and spirit of Heaven and Earth. Guangchengzi said: \"Refine the marrow of Heaven and Earth’s yin and yang.\" The forging of the Great Elixir begins here.\n\nIn the third transformation, the Two Modes divide, distinguishing yin and yang. The Classic states: \"Heaven attains the One and becomes clear; Earth attains the One and becomes tranquil; Man attains the One and becomes numinous.\" The One refers to the True One. When this lead is placed in the crucible and mercury is poured over it, golden flowers naturally emerge on the surface—this is the light, clear qi, the image of Qian. The cinnabar and earth envelop it externally—this is the heavy, turbid substance, the image of Kun. The *Record of the Armillary Sphere* says: \"Heaven envelops Earth like the yolk within the shell.\" Herein lies the principle of Heaven and Earth. Pure yang is accumulated qi, which cannot but move and ascend. Pure yin clings to form, which cannot but remain still and settle below. The meaning of yin and yang is thus revealed. The *Daoist Classic* states: \"Pure yang becomes an immortal; pure yin becomes a ghost. Man dwells between Heaven and Earth, endowed with the qi of yin and yang, moving in and out of life and death.\" The Elixir is the medicine of eternal life. If one refines and obtains it, using mercury to temper it and circulating the fire-qi to completion, once the primordial chaos is divided, the yin within Li will depart, and the yang within Kan will be made whole, restoring the body of Qian—thus becoming a purely yang substance. When ingested, one attains immortality, as if by natural consequence. The *Book of Changes* says: \"That which is rooted in Heaven inclines upward\"—the body becomes light and soars, again as if by natural consequence. Only then may it be called cinnabar, not the cinnabar of this world. Thus the ancient song says:\n*\"White Horse Sprout, true cinnabar.\nHuainan King refined autumn stone; the Yellow Emperor praised golden flowers.\"*\nAnd further:\n*\"Lead is the mother of the sprout; the sprout is the child of lead.\nOnce the golden flowers are seen, abandon lead and do not employ it.\"*\nFor the golden flowers, being pure yang, become companions of Heaven. The leaden husk, a yin thing, once the River Chariot’s conveyance is complete, is of no further use. Thus it is said: \"Emerging from yin, entering yang, transcending the ordinary, and ascending to sagehood.\" Thereafter, quicksilver alone abides in profound mystery.\n\nIn the fourth transformation, the Five Phases are drilled and clustered, transmuting into the Four Spirits. The ancient song says:\n*\"No need for medicines, employ the Five Phases.\nThe dragon emerges from fire; the tiger is born in water.\"*\nThis White Horse Sprout is the golden flower, the White Tiger born in the black lead’s water. Moreover, when the finest cinnabar is sublimed to produce mercury, this is the dragon emerging from fire. Placing the two together, grind them three thousand times in a jade mortar with a pestle until they merge—this is called \"bathing.\" The *Mirror of Medicines* says:\n*\"The Red Dragon is Qian’s virtue; the White Tiger is likewise constant.\nGrind the dragon to powder, and the tiger will naturally match it.\"*\nThen wash them with pure spring water, which turns a deep azure, indistinguishable from the sky. Here, the sequence of *Gold and Azure*—one white, two black, three green, four azure—becomes visible. Returning them to the crucible and circulating the fire-qi to completion, what emerges naturally assumes the forms of azurite, chalcanthite, male and female cinnabar, and mercuric cinnabar—five hues in all. The green is mercury, the essence of the Azure Dragon of wood. The white is the golden flower, the essence of the White Tiger of metal. The red is cinnabar, the essence of the Vermilion Bird of fire. The black is black lead, the essence of the Dark Warrior of water. These four are sacred and unknowable, hence called the Four Spirits, also named the Sacred Unknowable. Cao Yi Zi said: \"When the Elixir reaches these Four Spirits, all gods and men revere them, as they do Heaven, Earth, sun, and moon—none dare offend, for the divine will surely punish.\"\n\nIn the fifth transformation, all changes proceed from the Central Palace’s earthly virtue. The Classic states: \"The number of Heaven is five; the number of Earth is five. The five positions interact, each having its correspondence.\" The five refers to the Central Palace of earth, the beginning and end of all things’ generation. Thus water, with earth, completes the number six; fire, with earth, completes seven; wood, with earth, completes eight; metal, with earth, completes nine; earth, with earth, completes ten. Having refined the Elixir to the Four Symbols, it must attain earth before completion. Thus Zi Yang said: \"Both embrace true earth, enabling the Golden Elixir’s return.\" The dragon emerging from fire refers to wood (three) and fire (two) combining to make five, rotating left to form wu earth. The tiger born in water refers to metal (four) and water (one) likewise combining to make five, rotating right to form ji earth. Both embrace true earth, returning to five, and their union with five is thus evident. The forging of the Great Elixir lies entirely in the dual function of metal and fire—the path of return through seven red and nine purple. When the completion numbers of metal and fire are fulfilled, the generative and consummative numbers of the *River Chart* become visible. The *Jade Flask Ode* of the Supreme Unity True Lord says:\n*\"The Chamber is the Azure Dragon; the Dipper is the Tiger.\nThe sun is the Vermilion Bird; the moon, the Dark Warrior.\nTo establish the foundation of the Great Medicine, one must obtain the central wu and ji earth.\"*\nTaking the Four Spirits, bathe them as before, return them to the crucible, and circulate the fire-qi to completion. They will merge into true earth, within which the golden flower naturally appears.",
      "overlap_context": "and Earth are Qian and Kun. Xun is the eldest daughter, Gen the youngest son, Zhen the eldest son, Dui the youngest daughter; Jia, Bing, Wu, Geng, Ren, Yi, Ding, Ji, Xin, and Gui are the transformations of the Five Phases—here, the Dao of the Great Elixir is revealed, and this lead is it.\n\nNow, scholars of the present, each expounding their theories and galloping in confusion, without encountering a transmitted teaching—how could they exhaust principle and fulfill their nature to attain destiny?",
      "start_char": 1785,
      "end_char": 3023,
      "start_sentence": 90,
      "end_sentence": 151,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.67455434799194,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\渔庄邂逅录.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "如见金华，可以勾溜。 崔公云：乾汞勾，湿汞溜，无不住。 当以勾溜为验矣。 《肘后》云：见此土，即是丹。 崔公云：亦谓之龙胎大药，为其土中已炼丹体，如子之在母胎也。 草衣子曰：若人大功行未备，未可飞升，合修至此而止，可以辟病延年，住世为地仙耳。 然此药炼至第三转，既胎凡胎为纯阳体，乃轻清飞腾之物。 若水火乖度，则元气失散，药便不灵，虽得见土，有质无魂，服之即庭刁氲的科多不屡金澎引文规归大肠，虽能去病，久亦生疾。 阴长生云：得失在火卯酉，刑德不可不知。 古今修炼之士，莫不以此为大要者焉。 草衣子火候诀 火自第一转，起十一月冬至，至夜半子时，受一阳之气，为复卦，初九潜龙也，俟时而行，确乎不可拔？ 十二月临卦，九二，见龙在田，君德也。 正月泰卦，九三，君子进德，可与几也。 二月大壮卦，九四，或跃在渊，欲及时也，药中水银，上下无定。 三月央卦，九五，飞龙在天，得志也，药积阳为天。 四月乾卦，上九，｛几龙有悔，此时药成，乾体已全，不可造化，当积功累行，然后名山吉地洁净之处，斋戒沐浴，方可下手，鼎炉法象火候，并不同前，丹房中水火不可暂离，香烟长久不绝，盖纯阳之物，功齐造化。 《抱扑子》及诸经皆云：此时当祭炉，祭太乙诸神，并来监临助作药，道人斯时，不得辄生邪见，并一切秽触，要生障碍，故日有悔。 修炼之士不可不信，前后若此者多，或为而不能成，或成而不能服，或服而不能灵，遂以为魔。 殊不知丹砂阳物，鬼神畏忌，又况炼至纯阳，阴魔其能亲耶。 此理晓然，切忌切忌。 若能遵依禁戒，自此渐渐通灵，可造黄白，直至九转，紫阳官火足功全。 则一粒之功，鹦餐成凤，犬饵成龙，点化金石，并为至宝。 修真之士月诸经诀，可以理推，非渔庄之所能备录也。 古歌云：欲言言不及，林下好商量。 又云：时人问我江南景，柢道君行自得知。 昔黄真君注《龙虎经》毕，乃留诗云：物因不识香成贱，言为玄微却被轻。 昨夜托栏几长啸，一轮秋月为谁明。 盖伤知音之难遇也。 今既得倡，录非徒然，因喜成四韵，附于卷末云。 丹中神水与华池，学者如麻悟者稀。 但指气精为造化，岂知铅汞有深微。 迷途到底生邪见，大道何人为指归。 今日相逢皆宿契，与君容易泄天机。 十一月十八日开炉，得先天铅，因纪其实云： 配合阴阳法自然，得成此物号先天。 妙中妙妙妙真妙，渊处渊渊渊又渊。 下手工夫终百日，夺他造化几千年。 从头细试渔庄录，方信神仙不浪传。 二月十三日灰池炎灼，得混沌胚脾。 灰池炎灼定浮沈，见了方知造化深。 世上本来无此物，人问终是少知音。 蒙蒙恍恍离宫本，杳杳冥冥坎户金。 得一莫夸能事毕，要勤功行合天心。 渔庄邂逅录竟",
      "translated_text": "Upon witnessing the golden flower, one may proceed with the *gou* and *liu* techniques. Master Cui states: *\"Dry mercury *gou*s, damp mercury *liu*s—none escapes its grasp.\"* Thus, the *gou* and *liu* serve as verification. *The Elbow-Behind Manual* says: *\"Upon seeing this earth, the Elixir is achieved.\"* Master Cui also calls it the *\"Dragon Embryo Great Medicine,\"* for within this earth, the Elixir’s body is forged, like a child within the mother’s womb.\n\nMaster Straw-Cloak says: *\"If one’s great merit and conduct are not yet complete, ascension cannot be achieved. Should one halt cultivation at this stage, one may ward off illness, prolong life, and dwell in the world as an earthbound immortal.\"* However, when this medicine is refined to the third revolution, the impure embryo becomes a body of pure yang—a light, ethereal, soaring substance. If water and fire deviate from their proper measure, the primordial qi scatters, and the medicine loses its efficacy. Though one may see the earth, it will have form but no spirit; ingesting it will only lead to fleeting, insubstantial effects, like scattered mist or drifting smoke, ultimately dissipating into the intestines. While it may cure illness, prolonged use will breed new ailments.\n\nMaster Yin Changsheng says: *\"Success or failure lies in the fire of *mao* and *you*; the interplay of punishment and virtue must not be overlooked.\"* From ancient times to the present, cultivators have regarded this as the great essential.\n\n**Master Straw-Cloak’s Fire Timing Formula:**\nThe fire begins at the first revolution, rising in the eleventh month at the winter solstice, at the midnight hour of *zi*, receiving the qi of one yang—this is the *Fu* hexagram, its first yang line a *\"hidden dragon,\"* awaiting its time to act, steadfast and unshakable. The twelfth month brings the *Lin* hexagram, its second yang line a *\"dragon seen in the field,\"* the virtue of a ruler. The first month is the *Tai* hexagram, its third yang line a *\"noble one advancing in virtue,\"* nearing the subtle. The second month is the *Dazhuang* hexagram, its fourth yang line a *\"dragon leaping in the abyss,\"* seizing the moment—here, the mercury in the medicine rises and falls without fixed place. The third month is the *Guai* hexagram, its fifth yang line a *\"flying dragon in the heavens,\"* having attained its will—the medicine accumulates yang to become heaven. The fourth month is the *Qian* hexagram, its top yang line: *\"A dragon soaring too high meets regret.\"* At this time, the medicine is complete, the body of *Qian* fully realized; no further transformation is possible. One must accumulate merit and conduct, then, in a pure and secluded place—a sacred mountain or auspicious site—purify oneself with fasting and ablutions before proceeding. The crucible, furnace, and fire timing differ from before. In the alchemical chamber, water and fire must never be separated for even a moment; the incense smoke must burn ceaselessly. For this is a substance of pure yang, its power equal to the workings of creation.\n\n*Baopuzi* and various scriptures state: *\"At this time, one must offer sacrifices to the furnace and to the Supreme Unity and all gods, inviting them to oversee and assist in the medicine’s formation.\"* The Daoist must not harbor wayward thoughts or allow any defilement to arise, for these will create obstacles—hence the warning of *\"regret.\"* Cultivators must take heed: many have faltered thus before—some failing to complete the work, others completing it but unable to ingest it, still others ingesting it without effect, then deeming it demonic. Little do they know that cinnabar, a yang substance, is feared by ghosts and spirits; how much more so when refined to pure yang—how could yin demons dare approach? This principle is clear: be vigilant, be vigilant.\n\nIf one adheres to the prohibitions, the medicine will gradually become spiritually responsive. One may then proceed to the transmutation of base metals into gold and silver, advancing to the ninth revolution, where the fire of the Purple Yang Palace is perfected and merit is fulfilled. A single grain of this medicine can transform a parrot into a phoenix, a dog into a dragon, and transmute metals and stones into supreme treasures. Cultivators should study the formulas in the scriptures and deduce the principles therein—this fisherman’s hut cannot record them all.\n\nAn ancient song says:\n*\"Words fail to express it—\nBeneath the pines, we may discuss it well.\"*\nAnother says:\n*\"When people ask of the Jiangnan scene,\nI say: ‘You must walk the path to know.’\"*\n\nOnce, after Master Huang annotated the *Scripture of the Dragon and Tiger*, he left this poem:\n*\"Things unrecognized are scorned as cheap;\nWords too profound are lightly dismissed.\nLast night, leaning on the railing, I sighed long—\nFor whom does this autumn moon shine bright?\"*\nHe lamented the rarity of kindred spirits.\n\nNow that this record has been made, it is no idle transcription. In joy, I compose four rhymed lines to append at the volume’s end:\n*\"Within the Elixir, divine water and the Flower Pool—\nSeekers are many, the awakened few.\nPointing to qi and essence as creation’s work,\nWho knows the lead and mercury hold depths profound?\nLost on the path, delusion breeds wayward views;\nWho now will guide them back to the Great Way?\nToday we meet by fate’s old bond—\nWith you, I lightly reveal heaven’s mystery.\"*\n\n**Eleventh month, eighteenth day:** The furnace is opened, and primordial lead is obtained. A record of the truth:\n*\"The union of yin and yang follows nature’s law,\nYielding this substance called ‘primordial.’\nWonder within wonder—wondrous, truly wondrous!\nDepth within depth—profound, ever profound.\nA hundred days of effort at the outset,\nSeizing the workings of creation for a thousand years.\nStudy the *Fisherman’s Hut Record* in detail—\nThen you’ll believe immortals are not falsely proclaimed.\"*\n\n**Second month, thirteenth day:** The ash pool is heated and scorched, yielding the *\"Chaotic Embryo Spleen.\"*\n*\"The ash pool’s heat determines rise and fall—\nOnly upon seeing it does one know creation’s depth.\nThis thing was never in the world before;\nAmong men, few are its true kindred.\nVague and indistinct, it departs the Li Palace’s origin;\nDim and distant, it is the Kan House’s metal.\nDo not boast of success upon gaining it—\nOne must diligently cultivate merit to align with heaven’s will.\"*\n\nHere ends the *Fisherman’s Hut’s Chance Encounters Record.*",
      "overlap_context": "er Chart* become visible. The *Jade Flask Ode* of the Supreme Unity True Lord says:\n*\"The Chamber is the Azure Dragon; the Dipper is the Tiger.\nThe sun is the Vermilion Bird; the moon, the Dark Warrior.\nTo establish the foundation of the Great Medicine, one must obtain the central wu and ji earth.\"*\nTaking the Four Spirits, bathe them as before, return them to the crucible, and circulate the fire-qi to completion. They will merge into true earth, within which the golden flower naturally appears.",
      "start_char": 3023,
      "end_char": 4115,
      "start_sentence": 152,
      "end_sentence": 196,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.57874584197998,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\渔庄邂逅录.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}