{
  "source_id": "灵宝归空诀",
  "source_file": "chunked_daozang\\灵宝归空诀.json",
  "total_chunks": 3,
  "total_original_chars": 2867,
  "total_translated_chars": 14890,
  "total_translation_time": 83.74570298194885,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\方法类\\灵宝归空诀.txt",
    "category": "方法类"
  },
  "full_translation": "**The Scripture of the Numinous Treasure’s Return to Emptiness**\n\n**Title:** *The Scripture of the Numinous Treasure’s Return to Emptiness*\n**Original Compiler:** Zhao Yizhen of Yuanyangzi\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan Section*, *Methods Category*\n\n---\n\n### **The Scripture of the Numinous Treasure’s Return to Emptiness**\n\n**Preface by the Compiler:**\nZhao Yizhen, the High Adept of the Teaching Gate, styled Yuanyangzi, Compiler of the Pure Virtue and Broad Dao of the Venerable Master Chongwen\n\n---\n\n### **Versified Summary**\n\nWhen the embryo is perfected and the spirit transforms, the hero,\nSheds the body freely, unshackled by fear.\nThe diligent practitioner, having realized non-arising,\nMust remain vigilant in action, undisturbed by chaos.\n\nThe superior adept, having completed the elixir and perfected the Dao,\nMoves freely in coming and going—my life is mine,\nNo longer subject to Heaven.\nThe middling adept and below, though able to progress in the Dao,\nAt the moment of returning to Emptiness, must first awaken,\nLest they fall into confusion.\n\n---\n\n### **Signs of the Return to Emptiness**\n\n**The Heavenly Drum at the Crown:**\nIf the Heavenly Drum at the crown roars like thunder,\nThis is the sound of Heaven collapsing and Earth crumbling.\nThree sounds, two sounds—three or two years;\nOne sound, one year—so must it be reckoned.\n\nOn New Year’s Eve or at midnight each night,\nSit in stillness, gather the mind, and contemplate the crown—\nThis is called the *Gate of Great Clarity*.\nSuddenly, a sound like the brain splitting,\nClear and sharp as a thunderclap, shall be heard.\nCount the number of sounds to determine the time remaining.\n\n**The Drum at the Back of the Head:**\nCover both ears with the hands,\nAnd with two fingers, strike the back of the head thirty-six times.\nIf the sound resembles a drum, peace shall follow;\nIf like a bell or chime, a year remains;\nIf like a cicada’s cry, a hundred days;\nIf like an earthworm’s wriggling, seven days—\nThus is the time of return foretold.\n\n**The Collapse of the Heavenly Pillar:**\nIf the drum at the back of the head and the Heavenly Drum both fall silent,\nThe Heavenly Pillar and Kunlun have already toppled.\nBefore the lamp, raise the left hand to the forehead—\nIf the arm appears small, it is auspicious; if large, ominous.\nThe front teeth serve as the *Dharma Drum*;\nIf striking them yields no sound, all are signs of departure.\n\n**The Fading of Light and Vital Signs:**\nIn utter darkness, flick the eyes with a finger—\nIf no light appears above or below, it is called *the Sun and Moon extinguished*,\nA sign of impending return.\nIf the pulse before the ear ceases to move,\nIt is called *the angler lays down his rod*—a sign of one day remaining.\nThe pool behind the upper gums is the *Flowery Pond*;\nIf the fluids dry, it is called *the Cao Creek’s waters exhausted*—\nA sign of seven days remaining.\nAt midnight, burn incense, light a lamp, and bow in worship;\nIf, upon turning, no shadow appears to either side,\nIt is called *the shadow no longer follows the form*—\nA sign of departure on that very day.\n\n**The Movement of the External Kidneys:**\nThe left external kidney is called the *Yin Mother*,\nThe right, the *Yang Duke*.\nIf the left enters the abdomen and returns, it is a sign of two mornings,\nOr, if it remains, a full day.\nIf the right enters the abdomen and returns, it is a sign of seven nights.\nIf both enter together, death shall come within half a day.\nIf, at the moment of departure, they enter again,\nIt is called *Yin and Yang hastening*, or *the coiled rock*.\nBind them tightly with silk or cotton cord to the thighs,\nPreventing their entry, so the corpse does not die.\n\nWhen the five viscera stir, it is the time of returning to quiescence.\nAt that moment, consciousness arises from the soles of the feet\nAnd ascends through the crown—\nIf the corpse moves, compose the mind and face the Heavenly Gate to depart.\n\n**Pain at the Moment of Urination:**\nAt the moment of urination, if both kidneys contract,\nPiercing pain unbearable as a drill—\nThis is called *the Hell Gate suddenly stirring*.\nIf the left foot (for men) or right foot (for women) stabs with pain,\nIt is called *the Life Gate severed*.\nSit upright, steady the spirit, and firmly grasp the *Mind Seal*,\nLest it wander.\nPress the hands tightly to the heart, preventing confusion—\nWhen the pain subsides, departure shall come within half a day.\n\n**Sensations Throughout the Body:**\nIf the entire body feels as though ants are crawling,\nOr suddenly as though a serpent slithers,\nAnd these sensations reach the heart,\nCausing the joints to ache until one faints—\nAfter three or five such episodes,\nIt is called *all desires leaving the body*,\nOr *the myriad spirits departed*—\nCertainly an ill omen.\nOne must concentrate the spirit and stabilize the mind;\nA single errant thought, and one falls into the *karmic paths*—\nThis must not be taken lightly.\n\n**Final Preparations:**\nOn the night of departure, after washing the hands, rinsing the mouth,\nAnd donning proper attire,\nBurn incense as before and carefully examine the signs.\nIf two or three portents appear,\nBathe in peach-blossom water, change clothes, and enter the chamber.\nSit in stillness and drink white tea or pure water.\nIf any other visions suggest departure, yet doubt remains,\nDrink one or two more mouthfuls of pure water and compose oneself again.\n\n**Illusory Visions at the Hour of Death:**\nAll manner of beings and visions may arise,\nLuring one into the *karmic paths* to suffer defeat.\nHold fast to the *Mind Seal*, free from attachment,\nLike an axe splitting wood—fear not, nor suspect, nor doubt.\n\nAt the moment of death:\nThe eyes transform into the *Nameless Ghost*,\nThe ears into the *Who-Is-It Ghost*,\nThe nose into the *Dead Tree Ghost*,\nThe tongue into the *Swift Soldier Ghost*,\nThe body into the *Pondering Ghost*,\nThe heart into the *Male-Female Ghost*.\nAll ghosts and spirits arise from the mind—\nThey are not external intrusions.\nOne must first recognize them as such.\n\nIf one encounters visions of Buddhas, bodhisattvas, masters, or sages,\nOr processions of attendants beckoning,\nThese are the realms of *heavenly demons* and *external paths*.\n\nEncountering vengeful foes or kin,\nOr paths of yellow, red, or white—\nThese too are *karmic paths* and demon realms.\n\nWhere lamplight glows, the inner demons’ kin appear.\nIn desolate wilds, the human womb awaits.\nMeeting sisters or relatives—\nThis is the gateway to rebirth, womb or wombless, in the wilds.\n\nEncountering black-and-white carriages with flags and brushes—\nThe wombs of oxen and horses.\nPalaces and halls—\nThe wombs of swine and sheep.\nYellow-robed or white-clad figures—\nThe wombs of cats and dogs.\nYellow banners and leopard tails—\nThe wombs of beasts that run.\nElephants—\nThe wombs of foxes.\nWhere flutes are played—\nThe wombs of earthworms and cicadas.\nWhere drums and music sound—\nThe wombs of crows, sparrows, insects, and ants.\nFlower-lined streets and willow lanes—\nThe wombs of serpents.\nMarkets, gates, and bustling crowds,\nOr hues of black, white, blue, or purple—\nAll are the *animal realm*.\n\nEncountering wine, meat, or feasts—\nThe *hungry ghost realm*.\nScenting wondrous fragrance—\nThe womb of heavenly beings.\nMeeting parents or kin—\nThe gods of village shrines, born from the *Six Desire Heavens*.\nGold-armored deities who summon—\nThe blood-fed gods of human and heavenly realms, great in fortune.\n\nAll such visions of gods, men, and phenomena\nAre illusions of one’s own consciousness, luring external demons—\nThey are not the true *Way*.\nDo not heedlessly follow or flee;\nNeither fear nor doubt, neither grasp nor cling.\nA single stray thought—\nAnd you fall into their womb.\n\nAt the moment the *qi* severs,\nIt may feel like an axe’s split—\nDo not be alarmed.\nIn the hour of deepest stillness,\nDo not flee or wander.\nFirmly grasp the *Mind Seal*,\nUnmoving, thus and thus,\nAnd after a long while, you will settle.\n\nOnly then will you see:\nThe path of thunder, fire, and lightning,\nThe sun’s rays stretching a thousand leagues.\nRush forward with the body, yet the heart remains unmoved—\nThus you will attain the human or heavenly realms and return to the *Pure Land*.\nThese four visions alone are trustworthy,\nSure to guide you to the *good paths*.\n\nIf you meet a yin-being offering tea,\nDo not taste the *soul-bewildering* brew.\nShould you firmly remember this vision,\nYou will gain knowledge of past lives, never to forget.\n\nWhen women offer tea—whether as gift or sale—\nTo accept and drink is to fall into the *evil paths*.\nIf you refuse and secretly discard it,\nYou will in future lives gain knowledge of past existences.\n\nFourfold assembly of noble ones, students of immortals and Buddhas—\nSwift is impermanence; do not take it lightly.\nA hundred kalpas of suffering in the *wheel of rebirth*,\nThe *Six Thieves* and *Three Corpses* rampant on the path of delusion.\n\nThe fourfold assembly refers to those in Daoist teachings: male monastic Daoists, female monastic Daoists, male lay Daoists, and female lay Daoists. In Buddhist teachings, monastics are called *bhikṣu* (monks) and *bhikṣuṇī* (nuns), while lay practitioners are called *upāsaka* (male devotees) and *upāsikā* (female devotees). When the Heavenly Worthy and the World-Honored One expounded the Dharma in the past, these four assemblies were always present to listen.\n\nImpermanence refers to the illusory, borrowed form of the body, which cannot escape decay and transience. The *Six Thieves* are the six desires. The true nature is thusness—neither moving nor still—responding to phenomena as they arise. When the eye faculty sees, it covets forms; when the ear faculty hears, it craves sounds; when the nose faculty smells, it desires fragrances; when the tongue faculty speaks or eats, it hankers after flavors; when the body faculty moves, it indulges in improper actions; when the mind faculty devises plans, it clings to deluded dreams. Once these six dusts enter the six faculties, the six desires flare up, obscuring and deluding the true nature—hence the name *thieves*.\n\nWhen passions run high, essence and spirit congeal into the *Three Corpses*, causing insatiable craving, deluded dreams, and endless wandering through birth and death in the *wheel of rebirth*, suffering without respite. Only with the courage of Guan, Zhang, and Zhao—subduing without even drawing the sword—can the world be pacified and the Way restored. Surrender to the command of the *Great Dharma King of No-Birth*.\n\nThe Dharma-body of self-nature is fundamentally unborn and undying. You cannot see its beginning when you seek it, nor its end when you follow it. It shines through past and present, standing alone and unchanging. Yet when it is drowned in the faculties and dusts, it is led into the various destinies, forgetting its original nature. If you can rouse the power of great wisdom and see through the faculties and dusts, passions will vanish instantly, and the Dharma-body will manifest. Though the four elements dissolve, it remains untouched—this is the *Great Dharma King of No-Birth*.\n\n**Postscript**\nOnce a human form is received, it undergoes formation, dwelling, decay, and dissolution. A hundred years pass like a dream. At the moment of death, consciousness becomes confused, and one drifts into the various destinies according to karmic habits, with no hope of escape. This is what is meant by the swiftness of impermanence and the gravity of birth and death. The method of returning to emptiness has long existed.\n\nThis text is traditionally attributed to Chan Master Bodhidharma, but upon examining its style and meaning, I find it riddled with errors and inconsistencies, unlike the language of a Mahāyāna bodhisattva. Moreover, Bodhidharma came from the West without relying on written words—could this not be a later fabrication, falsely attributed to a great name for credibility? Based on the old version and supplemented with other accounts, I have corrected errors, removed redundancies, and distilled the essence into a seven-character verse of fourteen chapters, each with four lines, for ease of memorization. Each chapter is accompanied by annotations for clarity.\n\nThose who encounter this text should treasure and guard it, never carelessly divulging it. Urgently awaken, see through karmic conditions, forget phenomena when facing them, practice skillful means widely, and cultivate good roots. In the twelve hours of the day and the four postures of conduct, uphold precepts and samādhi unwaveringly—neither clinging nor forgetting. With sincere effort and dedicated practice, the original wisdom-nature will one day become clear. Directly take it up, become your own master, and when the time comes, hold fast to the mysterious pass. Test its workings, and when the moment arrives, act without hesitation—this is the true work of a great being. Thus, the method of returning to emptiness is not without benefit.\n\nI have also observed that among immortals and buddhas, some meet unfortunate ends. For instance, Master Guo Jingchun, having awakened to the true and constant Dao, was unjustly executed, and the upright path of loyalty met a violent end. Chan Master Dahui, having realized the treasury of the true Dharma-eye, died from a carbuncle on his back, seeing through the five viscera in agony. Yet in the sea of humanity, some luck out: ignorant men and women, sunk in worldly toil without cultivation, may foresee their death and pass away peacefully. These are all due to past-life fixed karma, each reaping what they sow according to conditions. The common folk, not understanding, often use such cases of peaceful or violent deaths as fodder for gossip, revealing their own lack of wisdom.\n\nKnow this: those with clear eyes and lofty natures have already penetrated the celestial mind. Even amid blades and winds, they remain at ease; though poison is administered, their leisurely self-nature and Dharma-body roam beyond the world. If worldly attachments remain unwashed and the Dao-eye is still clouded, when the time of dissolution comes, it will be like a dream within a dream—unaware it is a dream, unable to forget familiar realms, drifting blindly in darkness. In the end, delusion and awakening differ not between saints and ordinary beings.\n\nOnly the fourfold assembly of Daoist and Buddhist practitioners—awakening early to the fleeting nature of illusory scenes and the difficulty of escaping the *wheel of suffering*—can together ascend the shore of enlightenment. Is this not excellent?\n\nThus, I write this preface and offer a verse:\n\nBirth and death, impermanent, are not inherently ours—\nOnly through clinging do they spawn endless woes.\nThe method of returning to emptiness is no-method,\nLike the sun moving east and west, all is one.\n\n*The Secret of Returning to Emptiness of the Numinous Treasure* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "灵宝归空诀 经名：灵宝归空诀。 原题原阳子赵宜真，编述。 一卷。 底本出处：《正统道藏》洞玄部方法类。 灵宝归空诀 崇文广道纯德法师教门高士原阳子赵宜真编述 歌括 胎圆神化英雄汉，脱体自由无忌惮。 学人精进了无生，行时点检休撩乱。 上士丹成道备，来去自由，我命在我，不在天矣。 中士而下，虽能进道，当归空之际，必先觉察，不至昏迷。 顶门天鼓若雷轰，此是天崩地陷声。 三声二声三二载，一声一载也须行。 岁除夜或每夜半，静坐摄念，观顶门谓之大明关。 忽闻声如脑裂，历历然，如霹雳状，计其声数，以定年限。 掩耳指击楼头鼓，恰似钟声三载数。 磬声一载蝉百日，蚯蚓七日身当故。 岁除夜或每夜半，两手掩两耳，以二指於脑后击三十六下，如鼓声则安乐，如钟磬、蚯蚓、蝉声，则知归期远近。 楼头天鼓俱不呜，天柱昆仑亦已倾。 灯前额问看臂大，叩齿无声总去程。 楼头鼓即脑后，天鼓即顶门，天柱倾即头颈弱不能举，一曰昆仑倒，又曰须弥倒。 每夜灯前竖起左手，按自己额间，看臂小则吉，大则凶。 前齿为法鼓，叩之不呜，皆是去证。 暗中挑眼亏光耀，耳前脉住收竿钓。 曹溪水竭华池乾，拜灯失影皆归兆。 夜半於极暗处，以手指挑眼，上下无光，谓之日月无光，是归侯。 太阳耳前脉不动，谓之钓客罢竿，是一日候。 舌下大牙龈后为华池，闭。 津液乾师，谓之曹溪水竭，是七日候。 夜半焚香，点灯礼拜，回顾身后左右全无影，谓之影不随形，是此日候。 左肾入腹在明朝，右入复来待七宵。 临行又入紧击住，遗骸不死魂神超。 外肾子左曰阴母，右曰阳公。 左入小腹去复来，则是二朝，或对周，一日候。 右入小腹去腹来，则是七日侯。 左右俱入，则半日身亡。 临行又复入，谓之阴阳催促，又曰盘岩。 当以绢带或绵绳，紧系住於腿上，不令入腹，令尸不死。 五脏中动，便是归寂之时，其时性从足下而生，从顶门而起，即动尸，则正心望天门去。 便尿之际连双肾，缩痛如锥不堪忍。 男左女右脚刺疼，半日去程心按紧。 双肾名玉女画娥眉，当便尿之时，其肾缩，刺痛不可忍，谓之地狱关动於忽然。 男左女右脚刺痛，谓之命门绝，皆当正坐，把定精神，牢捉心印，不可放逸。 以手紧紧按心，勿令昏乱，良久痛止，即半日去也。 徧体如同走蝼蚁，忽然又似一蛇游。 频来报应到心上，骨节皆疼世事休。 偏身或脚板，如有皑子走，或如蛇行，行到心中，即骨节疼致昏闷。 如此三五回，谓之诸欲离身，又曰诸神不在，定是不祥。 须要凝神定心，或一念差错，即堕业道，不可不谨。 点检烧香当夜静，有三两件归空证。 桃汤沐浴便更衣，一盏白茶还静定。 遇夜洗手、洗漱、衣冠毕，烧夜香依前，逐一点检，如有三两件。 报应之时，便沐浴更衣入室，静坐吃白茶，或净水。 又有何境象可去，则去未可去，再吃净水一二口，又定了。 诸般人物境象来，引归业道受输回。 坚持心印休贪着，斧劈母惧母嫌猜。 临命终时，眼化为无名鬼，耳化为阿谁鬼，鼻化为死树鬼，舌化为快军鬼，身化为思惟鬼，心化为雌雄鬼。 一切鬼神尽从心起，即非外来，先须识破。 逢诸色佛、菩萨、师儒等，或队仗迎引，皆是天魔外道境。",
      "translated_text": "**The Scripture of the Numinous Treasure’s Return to Emptiness**\n\n**Title:** *The Scripture of the Numinous Treasure’s Return to Emptiness*\n**Original Compiler:** Zhao Yizhen of Yuanyangzi\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan Section*, *Methods Category*\n\n---\n\n### **The Scripture of the Numinous Treasure’s Return to Emptiness**\n\n**Preface by the Compiler:**\nZhao Yizhen, the High Adept of the Teaching Gate, styled Yuanyangzi, Compiler of the Pure Virtue and Broad Dao of the Venerable Master Chongwen\n\n---\n\n### **Versified Summary**\n\nWhen the embryo is perfected and the spirit transforms, the hero,\nSheds the body freely, unshackled by fear.\nThe diligent practitioner, having realized non-arising,\nMust remain vigilant in action, undisturbed by chaos.\n\nThe superior adept, having completed the elixir and perfected the Dao,\nMoves freely in coming and going—my life is mine,\nNo longer subject to Heaven.\nThe middling adept and below, though able to progress in the Dao,\nAt the moment of returning to Emptiness, must first awaken,\nLest they fall into confusion.\n\n---\n\n### **Signs of the Return to Emptiness**\n\n**The Heavenly Drum at the Crown:**\nIf the Heavenly Drum at the crown roars like thunder,\nThis is the sound of Heaven collapsing and Earth crumbling.\nThree sounds, two sounds—three or two years;\nOne sound, one year—so must it be reckoned.\n\nOn New Year’s Eve or at midnight each night,\nSit in stillness, gather the mind, and contemplate the crown—\nThis is called the *Gate of Great Clarity*.\nSuddenly, a sound like the brain splitting,\nClear and sharp as a thunderclap, shall be heard.\nCount the number of sounds to determine the time remaining.\n\n**The Drum at the Back of the Head:**\nCover both ears with the hands,\nAnd with two fingers, strike the back of the head thirty-six times.\nIf the sound resembles a drum, peace shall follow;\nIf like a bell or chime, a year remains;\nIf like a cicada’s cry, a hundred days;\nIf like an earthworm’s wriggling, seven days—\nThus is the time of return foretold.\n\n**The Collapse of the Heavenly Pillar:**\nIf the drum at the back of the head and the Heavenly Drum both fall silent,\nThe Heavenly Pillar and Kunlun have already toppled.\nBefore the lamp, raise the left hand to the forehead—\nIf the arm appears small, it is auspicious; if large, ominous.\nThe front teeth serve as the *Dharma Drum*;\nIf striking them yields no sound, all are signs of departure.\n\n**The Fading of Light and Vital Signs:**\nIn utter darkness, flick the eyes with a finger—\nIf no light appears above or below, it is called *the Sun and Moon extinguished*,\nA sign of impending return.\nIf the pulse before the ear ceases to move,\nIt is called *the angler lays down his rod*—a sign of one day remaining.\nThe pool behind the upper gums is the *Flowery Pond*;\nIf the fluids dry, it is called *the Cao Creek’s waters exhausted*—\nA sign of seven days remaining.\nAt midnight, burn incense, light a lamp, and bow in worship;\nIf, upon turning, no shadow appears to either side,\nIt is called *the shadow no longer follows the form*—\nA sign of departure on that very day.\n\n**The Movement of the External Kidneys:**\nThe left external kidney is called the *Yin Mother*,\nThe right, the *Yang Duke*.\nIf the left enters the abdomen and returns, it is a sign of two mornings,\nOr, if it remains, a full day.\nIf the right enters the abdomen and returns, it is a sign of seven nights.\nIf both enter together, death shall come within half a day.\nIf, at the moment of departure, they enter again,\nIt is called *Yin and Yang hastening*, or *the coiled rock*.\nBind them tightly with silk or cotton cord to the thighs,\nPreventing their entry, so the corpse does not die.\n\nWhen the five viscera stir, it is the time of returning to quiescence.\nAt that moment, consciousness arises from the soles of the feet\nAnd ascends through the crown—\nIf the corpse moves, compose the mind and face the Heavenly Gate to depart.\n\n**Pain at the Moment of Urination:**\nAt the moment of urination, if both kidneys contract,\nPiercing pain unbearable as a drill—\nThis is called *the Hell Gate suddenly stirring*.\nIf the left foot (for men) or right foot (for women) stabs with pain,\nIt is called *the Life Gate severed*.\nSit upright, steady the spirit, and firmly grasp the *Mind Seal*,\nLest it wander.\nPress the hands tightly to the heart, preventing confusion—\nWhen the pain subsides, departure shall come within half a day.\n\n**Sensations Throughout the Body:**\nIf the entire body feels as though ants are crawling,\nOr suddenly as though a serpent slithers,\nAnd these sensations reach the heart,\nCausing the joints to ache until one faints—\nAfter three or five such episodes,\nIt is called *all desires leaving the body*,\nOr *the myriad spirits departed*—\nCertainly an ill omen.\nOne must concentrate the spirit and stabilize the mind;\nA single errant thought, and one falls into the *karmic paths*—\nThis must not be taken lightly.\n\n**Final Preparations:**\nOn the night of departure, after washing the hands, rinsing the mouth,\nAnd donning proper attire,\nBurn incense as before and carefully examine the signs.\nIf two or three portents appear,\nBathe in peach-blossom water, change clothes, and enter the chamber.\nSit in stillness and drink white tea or pure water.\nIf any other visions suggest departure, yet doubt remains,\nDrink one or two more mouthfuls of pure water and compose oneself again.\n\n**Illusory Visions at the Hour of Death:**\nAll manner of beings and visions may arise,\nLuring one into the *karmic paths* to suffer defeat.\nHold fast to the *Mind Seal*, free from attachment,\nLike an axe splitting wood—fear not, nor suspect, nor doubt.\n\nAt the moment of death:\nThe eyes transform into the *Nameless Ghost*,\nThe ears into the *Who-Is-It Ghost*,\nThe nose into the *Dead Tree Ghost*,\nThe tongue into the *Swift Soldier Ghost*,\nThe body into the *Pondering Ghost*,\nThe heart into the *Male-Female Ghost*.\nAll ghosts and spirits arise from the mind—\nThey are not external intrusions.\nOne must first recognize them as such.\n\nIf one encounters visions of Buddhas, bodhisattvas, masters, or sages,\nOr processions of attendants beckoning,\nThese are the realms of *heavenly demons* and *external paths*.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1313,
      "start_sentence": 0,
      "end_sentence": 59,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.93669772148132,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\灵宝归空诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "逢冤家眷属，或黄赤白路，亦是业道魔境。 逢灯光处，是内魔眷属。 逢旷野处，是人间胎卯。 逢亲戚姊妹，是入轮回胎无胎入野。 逢簥笔黑白车，是牛马等胎。 逢殿宇，是猪羊胎。 逢黄衣白服，是猫犬胎。 逢黄旛豹尾，是走兽胎。 逢象，是狐胎。 逢吹箫处，是蚯蚓蝉类胎。 逢鼓乐处，是乌雀虫蚁胎。 逢花街柳巷，是蛇胎。 逢市井关阓人物往来之地，或黑白青紫，并是畜生道。 逢酒肉饮食之类，是饿鬼道。 闻妙香，是天人胎。 逢父母眷属处，是六欲天发做里社庙神。 逢金甲神人教请，是人天大福血食神。 如前诸色神人境物，并是自家神识诱引外魔，即非正道，不得乱舍去来，不怕不嫌，不取不爱，若差一念，便落他胎。 气断之际，或如斧劈也，莫惊恐。 正昏默时，不得逃窜，务要牢捉心印，如如不动，良久自定。 只见雷火电光路，日光毫光千丈度。 将身猛去不动心，即证人天归净土。 唯此四境可行，必归善道。 逢着阴人过茶汤，迷魂之药不可尝。 此境若还牢记得，能通宿命永无忘。 逢妇人过茶汤，或施或卖，若受而食之，便堕恶道，次定不食而窃倾弃之，则当来通宿命矣。 四辈高人学仙佛，迅速无常莫轻忽。 轮回百劫万苦辛，六贼三尸恣颠路。",
      "translated_text": "Encountering vengeful foes or kin,\nOr paths of yellow, red, or white—\nThese too are *karmic paths* and demon realms.\n\nWhere lamplight glows, the inner demons’ kin appear.\nIn desolate wilds, the human womb awaits.\nMeeting sisters or relatives—\nThis is the gateway to rebirth, womb or wombless, in the wilds.\n\nEncountering black-and-white carriages with flags and brushes—\nThe wombs of oxen and horses.\nPalaces and halls—\nThe wombs of swine and sheep.\nYellow-robed or white-clad figures—\nThe wombs of cats and dogs.\nYellow banners and leopard tails—\nThe wombs of beasts that run.\nElephants—\nThe wombs of foxes.\nWhere flutes are played—\nThe wombs of earthworms and cicadas.\nWhere drums and music sound—\nThe wombs of crows, sparrows, insects, and ants.\nFlower-lined streets and willow lanes—\nThe wombs of serpents.\nMarkets, gates, and bustling crowds,\nOr hues of black, white, blue, or purple—\nAll are the *animal realm*.\n\nEncountering wine, meat, or feasts—\nThe *hungry ghost realm*.\nScenting wondrous fragrance—\nThe womb of heavenly beings.\nMeeting parents or kin—\nThe gods of village shrines, born from the *Six Desire Heavens*.\nGold-armored deities who summon—\nThe blood-fed gods of human and heavenly realms, great in fortune.\n\nAll such visions of gods, men, and phenomena\nAre illusions of one’s own consciousness, luring external demons—\nThey are not the true *Way*.\nDo not heedlessly follow or flee;\nNeither fear nor doubt, neither grasp nor cling.\nA single stray thought—\nAnd you fall into their womb.\n\nAt the moment the *qi* severs,\nIt may feel like an axe’s split—\nDo not be alarmed.\nIn the hour of deepest stillness,\nDo not flee or wander.\nFirmly grasp the *Mind Seal*,\nUnmoving, thus and thus,\nAnd after a long while, you will settle.\n\nOnly then will you see:\nThe path of thunder, fire, and lightning,\nThe sun’s rays stretching a thousand leagues.\nRush forward with the body, yet the heart remains unmoved—\nThus you will attain the human or heavenly realms and return to the *Pure Land*.\nThese four visions alone are trustworthy,\nSure to guide you to the *good paths*.\n\nIf you meet a yin-being offering tea,\nDo not taste the *soul-bewildering* brew.\nShould you firmly remember this vision,\nYou will gain knowledge of past lives, never to forget.\n\nWhen women offer tea—whether as gift or sale—\nTo accept and drink is to fall into the *evil paths*.\nIf you refuse and secretly discard it,\nYou will in future lives gain knowledge of past existences.\n\nFourfold assembly of noble ones, students of immortals and Buddhas—\nSwift is impermanence; do not take it lightly.\nA hundred kalpas of suffering in the *wheel of rebirth*,\nThe *Six Thieves* and *Three Corpses* rampant on the path of delusion.",
      "overlap_context": "eless Ghost*,\nThe ears into the *Who-Is-It Ghost*,\nThe nose into the *Dead Tree Ghost*,\nThe tongue into the *Swift Soldier Ghost*,\nThe body into the *Pondering Ghost*,\nThe heart into the *Male-Female Ghost*.\nAll ghosts and spirits arise from the mind—\nThey are not external intrusions.\nOne must first recognize them as such.\n\nIf one encounters visions of Buddhas, bodhisattvas, masters, or sages,\nOr processions of attendants beckoning,\nThese are the realms of *heavenly demons* and *external paths*.",
      "start_char": 1313,
      "end_char": 1806,
      "start_sentence": 60,
      "end_sentence": 87,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.53639531135559,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\灵宝归空诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "四辈者，谓道教中有出家男宫道士，有出家女官道士，有在家男官道士，有在家女官道士。 释教中，则出家者男日比丘，女曰比丘尼，在家者男曰优婆塞，女曰优婆夷。 昔天尊世尊说法时，会中皆有此四辈人听法也。 无常者，谓幻假色身，未免败坏不长久也。 六贼，即六欲之谓也。 真性如如，非动非静，感物而应。 在眼根能视，则责欲色尘。 在耳根能听，则贪欲声尘。 在鼻根能嗅，则贪欲香尘。 在舌根能言能食，则贪欲滋味。 在身根能运动，则贪欲非为，在意根能出谋应事，则贪欲颠倒梦想。 如是六尘，既入於六根，六欲因之而炽盛，障迷自性，故以贼名。 情欲盛，则精魄结而为三尸虫，致人贪爱无厌，颠倒梦想，流浪死生，展转轮回，受诸苦恼，无有已时。 直须勇猛赛关张，不动干戈已伏降。 四海清平归有道，听命无生大法王。 自性法身，本无生灭。 迎之不见其首，随之不见其后。 辉今耀古，卓然独存。 唯其汩於根尘，引入诸趣，迷惑本来。 若能奋勇猛大智慧力，勘破根尘，则情欲顿消，法身自见。 从他四大败坏，於我了不相干，此所谓无生大法王也。 后序 夫人生受形，既有成住，不免坏空，百岁光阴，过眼如梦，命终之际，情识昏迷，则随其业习，沦入诸趣，无有出期。 此所谓无常迅速，生死事大，而归空之法，有自来矣。 恪传以为达摩禅师之作，予观其文义，讹舛不伦，不类大乘菩萨语句，况达摩西来不立文字，得非后人所撰，假大名以取信乎？ 今因旧本，参以异闻，正误删繁，序为七言歌括一篇，凡十四章，章四句，以便记忆，仍就每章附注，务得其详。 有缘遇者，宝而秘之，毋成轻泄。 急宜猛省，识破幼缘，对境忘境，广行方便，多种善根。 於十二时中，四威仪内，坚持戒定，勿助勿忘，真积力行，则本来慧性一旦开明，直下承当，自作主宰，时节到来，把定玄关，验其消息，撒乎便行，斯乃大丈夫能事，而归空之法，不为无所济矣。 抑尝见仙佛中或有不幸者，如景纯郭真人，既悟真常之道，而不免枉遭刑戮，直道中义，竟以凶终。 大慧禅师，既明正法眼藏，而不免疽发於背，洞见五脏，竟以苦终。 人海中或有侥幸者，愚夫愚妇，汩没尘劳，素无修习，而能先知去候，脱然令终。 是皆宿令定业，各随缘分顺偿。 凡俗罔知，宁不以彼此令终凶终为口实，而窃议之，多见其不智。 须知明眼高人，性天已彻，纵遇风刀常坦坦，假饶毒药也。 闲闲自性，法身逍遥世外。 设或尘情未涤，道眼未明，运应灭时，还如梦中，不知是梦，难忘熟境，随顺冥行，毕竟迷悟，不同圣凡有间。 惟学仙学佛四辈高人，抚幻景之倏迁，脱苦轮之未易，回头在早，觉岸同登，不亦善哉。 是故为之序，并说偈曰： 生死无常本不干，只因贪着致多端。 归空有法原非法，日向东西一样团。 灵宝归空诀竟",
      "translated_text": "The fourfold assembly refers to those in Daoist teachings: male monastic Daoists, female monastic Daoists, male lay Daoists, and female lay Daoists. In Buddhist teachings, monastics are called *bhikṣu* (monks) and *bhikṣuṇī* (nuns), while lay practitioners are called *upāsaka* (male devotees) and *upāsikā* (female devotees). When the Heavenly Worthy and the World-Honored One expounded the Dharma in the past, these four assemblies were always present to listen.\n\nImpermanence refers to the illusory, borrowed form of the body, which cannot escape decay and transience. The *Six Thieves* are the six desires. The true nature is thusness—neither moving nor still—responding to phenomena as they arise. When the eye faculty sees, it covets forms; when the ear faculty hears, it craves sounds; when the nose faculty smells, it desires fragrances; when the tongue faculty speaks or eats, it hankers after flavors; when the body faculty moves, it indulges in improper actions; when the mind faculty devises plans, it clings to deluded dreams. Once these six dusts enter the six faculties, the six desires flare up, obscuring and deluding the true nature—hence the name *thieves*.\n\nWhen passions run high, essence and spirit congeal into the *Three Corpses*, causing insatiable craving, deluded dreams, and endless wandering through birth and death in the *wheel of rebirth*, suffering without respite. Only with the courage of Guan, Zhang, and Zhao—subduing without even drawing the sword—can the world be pacified and the Way restored. Surrender to the command of the *Great Dharma King of No-Birth*.\n\nThe Dharma-body of self-nature is fundamentally unborn and undying. You cannot see its beginning when you seek it, nor its end when you follow it. It shines through past and present, standing alone and unchanging. Yet when it is drowned in the faculties and dusts, it is led into the various destinies, forgetting its original nature. If you can rouse the power of great wisdom and see through the faculties and dusts, passions will vanish instantly, and the Dharma-body will manifest. Though the four elements dissolve, it remains untouched—this is the *Great Dharma King of No-Birth*.\n\n**Postscript**\nOnce a human form is received, it undergoes formation, dwelling, decay, and dissolution. A hundred years pass like a dream. At the moment of death, consciousness becomes confused, and one drifts into the various destinies according to karmic habits, with no hope of escape. This is what is meant by the swiftness of impermanence and the gravity of birth and death. The method of returning to emptiness has long existed.\n\nThis text is traditionally attributed to Chan Master Bodhidharma, but upon examining its style and meaning, I find it riddled with errors and inconsistencies, unlike the language of a Mahāyāna bodhisattva. Moreover, Bodhidharma came from the West without relying on written words—could this not be a later fabrication, falsely attributed to a great name for credibility? Based on the old version and supplemented with other accounts, I have corrected errors, removed redundancies, and distilled the essence into a seven-character verse of fourteen chapters, each with four lines, for ease of memorization. Each chapter is accompanied by annotations for clarity.\n\nThose who encounter this text should treasure and guard it, never carelessly divulging it. Urgently awaken, see through karmic conditions, forget phenomena when facing them, practice skillful means widely, and cultivate good roots. In the twelve hours of the day and the four postures of conduct, uphold precepts and samādhi unwaveringly—neither clinging nor forgetting. With sincere effort and dedicated practice, the original wisdom-nature will one day become clear. Directly take it up, become your own master, and when the time comes, hold fast to the mysterious pass. Test its workings, and when the moment arrives, act without hesitation—this is the true work of a great being. Thus, the method of returning to emptiness is not without benefit.\n\nI have also observed that among immortals and buddhas, some meet unfortunate ends. For instance, Master Guo Jingchun, having awakened to the true and constant Dao, was unjustly executed, and the upright path of loyalty met a violent end. Chan Master Dahui, having realized the treasury of the true Dharma-eye, died from a carbuncle on his back, seeing through the five viscera in agony. Yet in the sea of humanity, some luck out: ignorant men and women, sunk in worldly toil without cultivation, may foresee their death and pass away peacefully. These are all due to past-life fixed karma, each reaping what they sow according to conditions. The common folk, not understanding, often use such cases of peaceful or violent deaths as fodder for gossip, revealing their own lack of wisdom.\n\nKnow this: those with clear eyes and lofty natures have already penetrated the celestial mind. Even amid blades and winds, they remain at ease; though poison is administered, their leisurely self-nature and Dharma-body roam beyond the world. If worldly attachments remain unwashed and the Dao-eye is still clouded, when the time of dissolution comes, it will be like a dream within a dream—unaware it is a dream, unable to forget familiar realms, drifting blindly in darkness. In the end, delusion and awakening differ not between saints and ordinary beings.\n\nOnly the fourfold assembly of Daoist and Buddhist practitioners—awakening early to the fleeting nature of illusory scenes and the difficulty of escaping the *wheel of suffering*—can together ascend the shore of enlightenment. Is this not excellent?\n\nThus, I write this preface and offer a verse:\n\nBirth and death, impermanent, are not inherently ours—\nOnly through clinging do they spawn endless woes.\nThe method of returning to emptiness is no-method,\nLike the sun moving east and west, all is one.\n\n*The Secret of Returning to Emptiness of the Numinous Treasure* concludes.",
      "overlap_context": "\nYou will gain knowledge of past lives, never to forget.\n\nWhen women offer tea—whether as gift or sale—\nTo accept and drink is to fall into the *evil paths*.\nIf you refuse and secretly discard it,\nYou will in future lives gain knowledge of past existences.\n\nFourfold assembly of noble ones, students of immortals and Buddhas—\nSwift is impermanence; do not take it lightly.\nA hundred kalpas of suffering in the *wheel of rebirth*,\nThe *Six Thieves* and *Three Corpses* rampant on the path of delusion.",
      "start_char": 1807,
      "end_char": 2894,
      "start_sentence": 88,
      "end_sentence": 129,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.27260994911194,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\灵宝归空诀.txt",
        "category": "方法类"
      }
    }
  ]
}