{
  "source_id": "灵宝净明院教师周真公起请画",
  "source_file": "chunked_daozang\\灵宝净明院教师周真公起请画.json",
  "total_chunks": 4,
  "total_original_chars": 3202,
  "total_translated_chars": 17736,
  "total_translation_time": 91.03600740432739,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\方法类\\灵宝净明院教师周真公起请画.txt",
    "category": "方法类"
  },
  "full_translation": "The Venerable Zhou Zhen of Lingbao Jingming Institute Submits a Request for Clarification on a Diagram\n\n**Title:** *Venerable Zhou Jie of Lingbao Jingming Institute Submits a Request for Clarification on a Diagram*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Zhengtong Daoist Canon*, Dongxuan Section, Methods Category\n\nThe Venerable Zhou Zhen of Lingbao Jingming Institute Submits a Request for Clarification on a Diagram\n\nHaving received the profound favor of the Six True Masters, who bestowed upon me the *Scripture of Pure Brightness*, I find its teachings replete with abstruse principles. To grasp the intent behind its expounded teachings, I humbly submit these queries, entreating detailed instruction—this would be most fortunate.\n\n**First Inquiry:**\nThe Scripture states: *\"Those who cultivate our Dao may be counted among the ranks of attendants.\"* The *Yu Chen Sanwu Feibu Pian* says: *\"The method of Three and Five is but its essential outline.\"* Expanding upon this, the numerical record does not exceed thirty-five, as I have already inquired. Yet I remain uncertain: when pacing the Three and Five, should one trace the guiding diagram while stepping, or merely observe the earth’s form to determine the steps? Must the feet follow the steps, or should one pace through visualization of the Mysterious Net’s flowing evolution? If the Mysterious Net is visualized to the point of \"flying steps,\" does this constitute pacing the diagram?\n\n**Second Inquiry:**\n*\"Serving one’s parents with devotion invites the descent of the Heavenly Worthy’s numinous power.\"* In the household, one serves parents; in court, one remains loyal to the sovereign. My parents have both passed, leaving only a younger brother far away. I bear the eternal sorrow of this unending grief—how may I fulfill the practices of the Scripture and the duties of filial piety? Moreover, though I am a lone and distant subject, my loyalty burns red, yet I cannot put it into action. What is to be done?\n*\"To establish oneself and propagate one’s name is filial piety. To refuse sinecures and empty ranks is loyalty.\"* Act as circumstances permit—therein lies filial devotion and fraternal duty.\n\n**Third Inquiry:**\n*\"By day, ingest the essence of the sun; by night, consume the fluid of the moon.\"* What is the method for absorbing the sun’s essence and harmonizing with the moon’s fluid? I humbly request instruction.\nThis is the *Dao of the Sun and Moon’s Lofty Ascent*.\n\n**Fourth Inquiry:**\n*\"Flowing Gold Fire Bell\"*—is this a talisman’s name, a deity’s name, or the name of a martial spirit? I seek clarification.\nIt is the name of the *Southern Dipper’s Alchemical Fire-Regulating Envoys*—the so-called *Ministerial Fire*.\n\n**Fifth Inquiry:**\n*\"The Master of the Celestial Pivot is called Daoling.\"* What is Daoling?\n*Daoling* is the honorific title of Heavenly Master Zhang, the Perfected One of Supervisory Salvation.\n\n**Sixth Inquiry:**\n*\"It encompasses the earth’s configurations, all of which it governs.\"* What are the *earth’s configurations*? What does *encompass* mean? I humbly await detailed instruction.\nThe *earth’s configurations* refer to the positions of the Eight Trigrams, each with its own palace and division.\n\n**Seventh Inquiry:**\n*\"The Five Peaks and Four Seas each possess their mechanisms.\"* What are the *mechanisms of the Five Peaks and Four Seas*? I humbly request detailed instruction.\nThese two passages speak of the circulation of *qi* and blood, akin to the meaning of the pericardium’s union with the *Zhang* meridian.\n\n**Eighth Inquiry:**\nThe Scripture states: *\"The inner and outer altars command sixteen generals...\"* Each is subject to the Celestial Pivot’s regulation, stationed under the authority of the Celestial Stem. Their methods of employment involve summoning—sound follows *qi*, *qi* merges with spirit, and they naturally appear before you, ready to be commanded. How may one summon them so they arrive immediately? If they do not come when summoned, what is to be done?\n\nThe Sixteen Generals, though bearing titles such as *Examiner-Summoner*, *Ghost-Shackler*, and *Yellow-Headed*, are likely the designations of their divine offices rather than their true names. It is further said that each has a deputy general—may I inquire as to the names of these deputies? How are they to be commanded and summoned so that they must arrive? I humbly request detailed instruction.\n\nThe scriptures contain talismans for summoning the *Pure Brightness* divine generals. If one has not yet seen them, one should consult the higher texts. Once seen, they may be employed at will while seated.\n\n**Ninth Inquiry:**\nThe *Immortal’s Ladder* lies within the eye, yet people remain unaware. What is the *Immortal’s Ladder within the eye*? Why is it not in the heart but in the eye? I humbly request your authoritative teaching.\nThe *Immortal’s Ladder* is the tongue. Though the tongue itself is invisible, speech arises from it. Its presence in the eye refers to the inner vision of the five viscera, where the tongue is perceived first.\n\n**Tenth Inquiry:**\nThe Three Pure Ones of the Supreme—*Kongtong* is the esoteric name of the *Primordial Beginning*; *Red* refers to the *Dao Lord*; and *Ears* to the *Old Lord*.\n\n**Eleventh Inquiry:**\nThe *Jade Emperor* and *Purple Tenuity* are *Zhiyuan* and *Zhongzhi*. Are these four characters the hidden names and appellations of the *Jade Emperor* and *Purple Tenuity*? Are they names or sobriquets? Which two characters denote rank, and which two denote position?\n*Zhiyuan* is the name of the *Jade Emperor*; *Zhongzhi* is the name of *Purple Tenuity*.\n\n**Twelfth Inquiry:**\nRegarding the deities of the Northern and Southern Dippers and the Three Terraces—those recorded as *Zixin*, *Ziyin*, *Gengwu*, *Dingren*, *Zigui*—the *Doushu Secret Essentials* in the *Golden Flowing Pearl Scripture*, as compiled in the *Fangwen* collection, states: The *Perfected One of Grand Unity*, whose wife was of the Ke clan, dreamed one night of a seven-colored light and bore seven sons. Later, they entered the White Jade Grotto to cultivate the Dao and were given the names *Kexin*, *Keyin*, *Kehui*, *Kezhen*, *Kelian*, *Kewu*, and *Kegeng*. Yet the *Pure Brightness Scripture* refers to them as *Zixin*, *Ziyin*, and *Zigui*, while *Geng*, *Wu*, *Ding*, and *Ren* are not prefixed with *Zi*—might this imply that all should be connected with *Zi*? Are these indeed the deities of the Northern Dipper? I humbly request detailed instruction on whether the Northern Dipper’s deities are male or female, and what attire and colors they wear.\nAll are addressed with the honorific *Zi*. Their attire follows fixed conventions: when wearing unbound hair and white robes, they command the generals in martial service; when adorned in crowns and regalia, they attend the perfected; and when clad in armor, they guard the Celestial Thearch.\n\nThe two Dipper deities may appear as male or manifest in transformed forms.\n\nFirst, are *Mengshu*, *Mengliang*, *Zhongbao*, *Zhongqing*, *Jiwang*, and *Jiqian* the deities of the Southern Dipper? Whether these are their names or courtesy names, I humbly seek precise instruction on their gender and attire.\n\nThese are their hidden names. The robes of the *Shangqing* tradition vary in their transformations, with no fixed gender.\n\nNext, among the Three Terraces, *Yunyu*, *Qijing*, *Fengliang*, and *Qingqi* are the Four Saintly Divine Lords. Since the Three Terraces should have three names, why are there now four saints? Are the names of the Three Terraces omitted? As for the Four Saints, are they the Four Saints such as the *Northern Culmen*, *Tianpeng*, and *Zhenwu*? I humbly request detailed clarification.\n\n*Yunyu* is the name of the Upper Terrace. The Four Saints refer to the four saints beginning with *Tianpeng*.\n\nThe Supreme Yin and Supreme Yang, the venerable stars of the sun and moon, are named *Yuanxiong*. Their names consist of only two characters—is the sun named *Xuan* and the moon named *Nü*? Yes.\n\nThe celestial stems of the Five Phases are known by distinct titles. The Water Star is named *Yan*, the Fire Star *Ying*, the Wood Star *Miao*, the Metal Star *Jian*, and the Earth Star *Zhen*. However, the esoteric names of the Five Star Sovereign Lords in the *Fangwen* are as follows:\n- The Northern Celestial Stem Star is named *Qixuan*, styled *Jingyuan*.\n- The Eastern Jupiter is named *Chenglan*, styled *Qingning*.\n- The Southern Mars is named *Weiting*, styled *Sanrong*.\n- The Western Venus is named *Liaoling*, styled *Zhenxun*.\n- The Central Saturn is named *Zanglu*, styled *Danyan*.\n\nWhy do these differ? True names, hidden names, inner names, and Daoist titles vary; they are invoked according to their texts, and one need not doubt each discrepancy.\n\nThe Thirty-Two Heavens, from *Gonghua Yaobo* onward, consist of eight phrases totaling thirty-two characters—are these the names of the Thirty-Two Heavens? The scripture states: \"These are their hidden names, recorded in the *Duren* chapter, unknown to those who transmit the *Duren*.\" Which lines in the scripture constitute their names? For example, *Taihuang Huangzeng Heaven* and *Yujiao Yuming*—is the upper line the name and the lower the style? Or are \"Heaven\" and \"Emperor\" separate designations?\n\nIn the *Duren Jing*, each Heavenly Emperor’s phrase may consist of five, seven, or eight characters, such as *Taishi Yulong Tengsheng Heaven*. I humbly request clear elucidation to dispel the ignorance of later learners.\n\nThe Thirty-Two Heavens bear these names. For instance, *Zhilou Ahui* is an inner name, while *Yujian Yuming* is the style.\n\nThe Twenty-Eight Constellations, from *Qingzong Liju* onward, comprise seven phrases totaling twenty-eight characters—these must be the names of the Twenty-Eight Constellations. But from which constellation does *Qingzong Liju* begin? The scripture states: \"These are the scriptural stars of the Twenty-Eight Constellations, serving as the warp.\" Are the Five Stars the weft? The Twenty-Eight Constellations remain fixed as the warp, while the Five Stars revolve, determining fortune and misfortune—like weaving, where patterns emerge from the weft.\n\nThe Five Stars array their radiance and may manifest transformed bodies. How do they transform? Transformation means descending to the human realm, as when Venus becomes *Taibai*.\n\nThe scripture states: \"The Three-Five Flying Steps are the essence of the Flowing Net,\" with *Tianying* and so forth constituting the Seven Transformations. It also says: \"The Three-Five Flying Steps are its essential summary.\" Yet here it claims: \"The Three-Five Flying Steps are the essence of the Flowing Net.\" The primordial net’s unfolding differs greatly from the Three-Five. Moreover, the *Fangwen* compilation of the *Nine Palaces Three-Five Steps* includes the Yang Dipper and Yin Dipper: stepping from *Tianying* into *Tianpeng* constitutes the Yin Dipper, while stepping from *Tianpeng* into *Tianying* constitutes the Yang Dipper—is this correct?\n\nThe incantation reads:\n*\"Dipper’s wondrous child, the twelve celestial stems,\nRiding radiance, martial might arrays...\"*\nThis describes stepping from *Tianying* to *Tianpeng*.\n\nAnother Dipper incantation states:\n*\"Sun and moon shine, Heaven and Earth pair,\nThe Dipper’s Dao gleams, the ghostly path decays.\nI from Tianpeng enter the celestial inner,\nPassing Chongfu in retreat, returning to Tianqin to face the Heart,\nMeeting Zhu and Ren, proceeding to Ying’s assembly.\nThe human path opens, the ghostly path obstructs.\"*\nThis describes stepping from *Tianpeng* to *Tianying*, constituting the Yang Dipper.\n\nIt is also said: \"The Yin Dipper is for the Summer Solstice, the Yang Dipper for the Winter Solstice.\" When practicing the Three-Five Flying Steps, which incantation and which Dipper should be used? Many recite the *\"Dipper’s wondrous child, the twelve celestial stems\"* incantation. Some say that before sleep, one steps onto the bed facing the Yin Dipper’s direction—is this stepping the Yin Dipper at night? If one steps when leaving home or traveling, is it sufficient to use the feet as the guide without a diagram? Yet it is also said there is a diagram—how is this so?\n\nThe scripture states: \"The Three-Five Flying Steps.\" How exactly are these steps performed? I humbly request detailed instruction to correct errors and omissions, and to receive clear guidance.\n\n*\"The Dao gives birth to the One, the One gives birth to the Two, the Two gives birth to the Three.\nBeyond the Three, none can be the same.\"*\nThe Three-Five Flying Steps are the essential summary of the primordial net. The Yin and Yang incantations are used for all movements—entering, exiting, rising, and resting. The feet serve as the guide; no diagram is needed.\n\nThe scripture states: \"The Three Jia and Six Ding emerge from their origin.\" How are the Three Jia and Six Ding employed? What does \"emerge from their origin\" mean? The *Three Jia Scripture* in circulation is not authentic, and its use yields no efficacy. The same applies to the Six Ding. I humbly request detailed explanation to instruct later learners.\n\nThe Three Jia and Six Ding have methods in the scriptures, and their service has long been established. Thus, if the practitioner’s intent is not diligent, the spirits will not respond—this is not the fault of the method.\n\nThe *Scripture of Pure Clarity* states: \"When encountering one whose karmic conditions align, face east and burn incense to inquire of me; if I grant permission, then transmit the teachings. I shall serve as the master who delivers, while you shall serve as the master who vouches. Now, if there is one whose karmic affinity is ripe, whose eight virtues are complete, who is utterly sincere in seeking the Dao, and whose loyalty and filial piety render them worthy of transmission—when such a person faces east to burn incense and inquire of the true master, how may one discern whether permission is granted? And how shall the response manifest? I humbly request your instruction to establish a clear standard. Before daring to submit a formal petition to the ancestral master, one should first present a letter of intent along with a letter of vouching, then burn them to seek a response—either through a dream or through the Four Upright Merit-Officials, who shall convey the immortal’s decree. This is what has been observed when others have succeeded in the Way. If no such signs appear, then burn the letter of vouching, face east to burn incense, and pray for a dream revelation.\"\n\nAs for the daily offerings to the Lord Emperor and the various deities, should one take refuge in them? Following the usual ritual, should one make obeisance to the Lord Emperor daily, or is it unnecessary? Moreover, when deities such as the Divine Kings, Upright Talismans, and Merit-Officials are enshrined together on the same altar, should one bow only to the Lord Emperor, Divine Kings, and True Officials, while merely paying reverence with incense and obeisance to the messengers and attendants below them? I humbly request your distinction and guidance. The scriptures and methods already contain daily incense-burning rituals, as stated therein.\n\nThe method states: \"The *Tuhu Jie* talisman swiftly heals acute illnesses.\" But how is the incantation employed to dispatch it for urgent treatment? \"Flying\" refers to burning it with fire. How does the talisman take flight? Which Upright Talisman should be invoked to carry it? I humbly request your detailed explanation. *Tuhu Jie* is the name of the talismanic spirit, and it is activated by fire.\n\nMay the talismans for self-deliverance, liberating one’s six relations, and healing all illnesses be carved into printing blocks? When printing, should one visualize as when inscribing talismans? For instance, the talisman for liberating the six relations and the talisman for refining the body should be ingested daily. However, if circumstances prevent daily inscription, these three talismans—used only when needed—should be written as needed rather than carved. Yet in times of calamity or pestilence, when distributing talismanic water widely, would printing be permissible for mass distribution? I humbly request your instruction on each point. Carving blocks is convenient for cultivation and qi-nourishment. For all Pure Clarity talismans, except those requiring saliva or manual tracing, printing may be used.\n\nIn the *Book of Numinous Writings*, beneath the names of dispersed talismans, it states: \"Recite the incantation once or thrice.\" Later, it mentions only reciting the incantation for the dispersed talisman—does this refer to reciting the *Book of Numinous Writings* three times, or merely inscribing and reciting the line *Yangqi luozhi luo*? The talisman states: \"Grasp the mudra and recite the incantation.\" I am unsure whether to recite the *Book of Numinous Writings* three times or only the single line *Yangqi luozhi luo*. Furthermore, many talismans do not specify the number of recitations, simply stating \"recite the incantation and inscribe the talisman.\" I humbly request your instruction on each point. Recite only the single line of the dispersed talisman. For those listed beneath the talisman, this is the method. Where no recitation count is given, recite seven times. Depending on the purpose, all are burned.\n\nHaving witnessed the true master’s compassionate guidance on these matters, I am fortunate to have encountered such clarity. May this ensure the transmission of the true teachings without obscurity, so that I may instruct others without betraying the questions posed in this petition. Thus concludes the inquiry of Zhou Zhengong, Instructor of the Numinous Treasure Pure Clarity Abbey.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "灵宝净明院教师周真公起请画一 经名：灵宝净明院教师周真介起请画一。 撰人不详。 一卷。 底本出处：《正统道藏》洞玄部方法类。 灵宝净明院教师周真公起请画一 方文上荷六位真师，既授以《净明真经》，经有奥义，合叩问玄微，庶几得承演教之意，一一详细批教，幸甚。 方文拜问： 一、经云：修吾道者，可膺员数参侍。 《玉晨三五飞步篇》云：三五之法，特其要略。 推而大之，其记数不过三五十，已问之矣。 不知步三五时，画纲图步之，或只地上视地形为纲步之？ 此须以足步，或以玄纲流演存想而步之。 玄纲即想至飞步，则为图步之。 一、能事父母，天尊降灵。 居家事父母，在朝忠於君。 方文父母俱亡，止有一弟，又在远处，怀终天永感之戚，如何应得经法行、孝之事。 奈何为臣孤远，虽有赤忠，不得施设，为之奈何？ 立身扬名，斯为孝矣。 不尸禄位，斯为忠矣。 随宜施设，孝悌在也。 一昼服日精，夜餐月液。 如何是服日精与准月液之法，乞赐指教。 此日月高奔之道。 一、流金火铃，此是符名，唯复是神名，是兵将之名，乞赐指示。 南斗炼丹火候使者之名，所谓相火。 一、天枢之主，是谓道陵。 乞问如何是道陵？ 道陵天师，张监度真讳。 一、该括地象，皆其主首。 如何是地象？ 如何该括？ 望赐详诲。 地象八卦之位，卦各有宫分。 一、五岳四海，各有其机。 如何是五岳四海之机？ 乞赐详诲。 此二节，言夫血炁踱度，如心包合漳之义。 一、经云：内外之坛，统十六将，云云。 各有天枢之节制，有在天罡之所部，用之之法，各有呼召。 声随炁至，炁与神交，自然见前，可以役使。 如何呼召，便肯立至？ 呼召不至时，如何？",
      "translated_text": "The Venerable Zhou Zhen of Lingbao Jingming Institute Submits a Request for Clarification on a Diagram\n\n**Title:** *Venerable Zhou Jie of Lingbao Jingming Institute Submits a Request for Clarification on a Diagram*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Zhengtong Daoist Canon*, Dongxuan Section, Methods Category\n\nThe Venerable Zhou Zhen of Lingbao Jingming Institute Submits a Request for Clarification on a Diagram\n\nHaving received the profound favor of the Six True Masters, who bestowed upon me the *Scripture of Pure Brightness*, I find its teachings replete with abstruse principles. To grasp the intent behind its expounded teachings, I humbly submit these queries, entreating detailed instruction—this would be most fortunate.\n\n**First Inquiry:**\nThe Scripture states: *\"Those who cultivate our Dao may be counted among the ranks of attendants.\"* The *Yu Chen Sanwu Feibu Pian* says: *\"The method of Three and Five is but its essential outline.\"* Expanding upon this, the numerical record does not exceed thirty-five, as I have already inquired. Yet I remain uncertain: when pacing the Three and Five, should one trace the guiding diagram while stepping, or merely observe the earth’s form to determine the steps? Must the feet follow the steps, or should one pace through visualization of the Mysterious Net’s flowing evolution? If the Mysterious Net is visualized to the point of \"flying steps,\" does this constitute pacing the diagram?\n\n**Second Inquiry:**\n*\"Serving one’s parents with devotion invites the descent of the Heavenly Worthy’s numinous power.\"* In the household, one serves parents; in court, one remains loyal to the sovereign. My parents have both passed, leaving only a younger brother far away. I bear the eternal sorrow of this unending grief—how may I fulfill the practices of the Scripture and the duties of filial piety? Moreover, though I am a lone and distant subject, my loyalty burns red, yet I cannot put it into action. What is to be done?\n*\"To establish oneself and propagate one’s name is filial piety. To refuse sinecures and empty ranks is loyalty.\"* Act as circumstances permit—therein lies filial devotion and fraternal duty.\n\n**Third Inquiry:**\n*\"By day, ingest the essence of the sun; by night, consume the fluid of the moon.\"* What is the method for absorbing the sun’s essence and harmonizing with the moon’s fluid? I humbly request instruction.\nThis is the *Dao of the Sun and Moon’s Lofty Ascent*.\n\n**Fourth Inquiry:**\n*\"Flowing Gold Fire Bell\"*—is this a talisman’s name, a deity’s name, or the name of a martial spirit? I seek clarification.\nIt is the name of the *Southern Dipper’s Alchemical Fire-Regulating Envoys*—the so-called *Ministerial Fire*.\n\n**Fifth Inquiry:**\n*\"The Master of the Celestial Pivot is called Daoling.\"* What is Daoling?\n*Daoling* is the honorific title of Heavenly Master Zhang, the Perfected One of Supervisory Salvation.\n\n**Sixth Inquiry:**\n*\"It encompasses the earth’s configurations, all of which it governs.\"* What are the *earth’s configurations*? What does *encompass* mean? I humbly await detailed instruction.\nThe *earth’s configurations* refer to the positions of the Eight Trigrams, each with its own palace and division.\n\n**Seventh Inquiry:**\n*\"The Five Peaks and Four Seas each possess their mechanisms.\"* What are the *mechanisms of the Five Peaks and Four Seas*? I humbly request detailed instruction.\nThese two passages speak of the circulation of *qi* and blood, akin to the meaning of the pericardium’s union with the *Zhang* meridian.\n\n**Eighth Inquiry:**\nThe Scripture states: *\"The inner and outer altars command sixteen generals...\"* Each is subject to the Celestial Pivot’s regulation, stationed under the authority of the Celestial Stem. Their methods of employment involve summoning—sound follows *qi*, *qi* merges with spirit, and they naturally appear before you, ready to be commanded. How may one summon them so they arrive immediately? If they do not come when summoned, what is to be done?",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 690,
      "start_sentence": 0,
      "end_sentence": 42,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.106078147888184,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\灵宝净明院教师周真公起请画.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "十六将，虽有考召、枷鬼、黄头之称，恐是所职神号，未是甚姓名。 又云：各有副将，敢问副将之名？ 如何役使呼召，使其必至？ 详乞批诲。 经中有召净明神将符。 未见，引上书。 既见，则任意坐以使之。 一、仙梯在目，而人不知。 如何是仙梯在目？ 何以不在於心而在目？ 乞赐旨教。 仙梯，舌也。 舌不可见，而言。 在目，谓内视五脏，先见其舌。 一、太上三清，空同赤耳。 空同，元始隐讳。 赤，则道君。 耳，则老君。 一、玉皇紫微，致远仲智。 致远仲智四字，莫便是玉皇紫微隐名隐字否？ 不知是名或是字？ 上二字是甚位？ 下二字是甚位？ 致远，玉皇名。 仲智，紫微名。 一、南北二斗、三台所记子辛、子寅、庚戊、丁壬、子癸之神，方文所收《斗枢秘要·金铄流珠经》云：太一真人，其妻可氏，夜梦七色之光，生子七人。 后入白玉洞修行，立七名曰：可辛、可寅、可惠、可真、可怜、可戊、可庚。 今《净明经》曰：子辛、子寅、子癸，而庚、戊、丁、壬不言子言，恐是皆合连子字，莫便是北斗之神否？ 不知北斗之神衣着服色，男子女子，乞赐详诲。 其下皆称子。 衣服有定格，如披发衣白，用兵役使神将； 冠冕，则朝真； 甲冑，则卫上帝。",
      "translated_text": "The Sixteen Generals, though bearing titles such as *Examiner-Summoner*, *Ghost-Shackler*, and *Yellow-Headed*, are likely the designations of their divine offices rather than their true names. It is further said that each has a deputy general—may I inquire as to the names of these deputies? How are they to be commanded and summoned so that they must arrive? I humbly request detailed instruction.\n\nThe scriptures contain talismans for summoning the *Pure Brightness* divine generals. If one has not yet seen them, one should consult the higher texts. Once seen, they may be employed at will while seated.\n\n**Ninth Inquiry:**\nThe *Immortal’s Ladder* lies within the eye, yet people remain unaware. What is the *Immortal’s Ladder within the eye*? Why is it not in the heart but in the eye? I humbly request your authoritative teaching.\nThe *Immortal’s Ladder* is the tongue. Though the tongue itself is invisible, speech arises from it. Its presence in the eye refers to the inner vision of the five viscera, where the tongue is perceived first.\n\n**Tenth Inquiry:**\nThe Three Pure Ones of the Supreme—*Kongtong* is the esoteric name of the *Primordial Beginning*; *Red* refers to the *Dao Lord*; and *Ears* to the *Old Lord*.\n\n**Eleventh Inquiry:**\nThe *Jade Emperor* and *Purple Tenuity* are *Zhiyuan* and *Zhongzhi*. Are these four characters the hidden names and appellations of the *Jade Emperor* and *Purple Tenuity*? Are they names or sobriquets? Which two characters denote rank, and which two denote position?\n*Zhiyuan* is the name of the *Jade Emperor*; *Zhongzhi* is the name of *Purple Tenuity*.\n\n**Twelfth Inquiry:**\nRegarding the deities of the Northern and Southern Dippers and the Three Terraces—those recorded as *Zixin*, *Ziyin*, *Gengwu*, *Dingren*, *Zigui*—the *Doushu Secret Essentials* in the *Golden Flowing Pearl Scripture*, as compiled in the *Fangwen* collection, states: The *Perfected One of Grand Unity*, whose wife was of the Ke clan, dreamed one night of a seven-colored light and bore seven sons. Later, they entered the White Jade Grotto to cultivate the Dao and were given the names *Kexin*, *Keyin*, *Kehui*, *Kezhen*, *Kelian*, *Kewu*, and *Kegeng*. Yet the *Pure Brightness Scripture* refers to them as *Zixin*, *Ziyin*, and *Zigui*, while *Geng*, *Wu*, *Ding*, and *Ren* are not prefixed with *Zi*—might this imply that all should be connected with *Zi*? Are these indeed the deities of the Northern Dipper? I humbly request detailed instruction on whether the Northern Dipper’s deities are male or female, and what attire and colors they wear.\nAll are addressed with the honorific *Zi*. Their attire follows fixed conventions: when wearing unbound hair and white robes, they command the generals in martial service; when adorned in crowns and regalia, they attend the perfected; and when clad in armor, they guard the Celestial Thearch.",
      "overlap_context": " union with the *Zhang* meridian.\n\n**Eighth Inquiry:**\nThe Scripture states: *\"The inner and outer altars command sixteen generals...\"* Each is subject to the Celestial Pivot’s regulation, stationed under the authority of the Celestial Stem. Their methods of employment involve summoning—sound follows *qi*, *qi* merges with spirit, and they naturally appear before you, ready to be commanded. How may one summon them so they arrive immediately? If they do not come when summoned, what is to be done?",
      "start_char": 690,
      "end_char": 1180,
      "start_sentence": 43,
      "end_sentence": 75,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.040353536605835,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\灵宝净明院教师周真公起请画.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "而二斗皆或男，或化现。 一、孟叔、孟良、仲宝、仲卿、季王、季乾，莫是南斗之神否？ 或名或字，乞详旨诲端的，并男子女人，衣着裳服。 是其隐名。 上清之衣而变化各有，男女无定。 一、三台之中，云育、齐京、奉良、清乞，四圣神君。 既言三台，合有三名，今却是四圣，又名四圣神君，不知如何？ 恐脱三台之名。 四圣者，不知是何四圣，是北极、天蓬、真武等四圣否？ 并乞详批。 云育，上台名也。 四圣，即天蓬已下四圣。 一、太阴太阳，日月尊星，其名垣胸。 其名只两字，莫是太阳名烜，太阴名朒否？ 是。 一、五行之辰，是以别称。 水星名衍，火星名荧，木星名苗，金星名坚，土星名镇。 方文得五星真皇君秘名曰：　北方辰星，名启咺，字精原。 东方岁星，名澄澜，字清凝。 南方荧惑星，名维停，字散融。 西方太白星，名寥陵，字振寻。 中央镇星，名藏陆，字耽延。 与不同何也？ 有真名、隐名、内名、道号各不同，随其文字呼召，不必一一生疑 一、三十二天，自恭华摇伯以下八句，乃三十二字，莫是三十二天否？ 经云：此其隐名，字载，度人不知度人。 经中何句乃是其字？ 如太黄皇曾天，郁缴玉名。 上句是字，下句是字，恐天自是天名，帝自是帝名。 又《度人经》，每天帝句，有五字或七字、八字者，如太释玉隆腾胜天之类。 伏乞明赐开析，以晓后学之愚昧。 三十二天，此其名； 如直娄阿荟，是内名。 则郁鉴玉名，是字也。 一、二十八宿自清宗立鞠以下，共七字，二十八字，必是二十八宿之名。 不知清宗立鞠，合从甚宿，为名字起头？ 经云：此其经是二十八宿，为经星。 五星为纬否？ 二十八宿不动，以为经。 五星周行，灾福系焉。 如织有纬，文章出焉。 一、五星列照，有时化身。 乞问如何化身？ 化身者，为人下降人间，如金星之为太白。 一、经云：三五飞步，流纲之总，天英云云。 是为七变。 又云：三五飞步，乃其要略。 今云：三五飞步却为流纲之总。 元纲流演，大与三五不同。 又方文收《九宫三五之步》，有阳斗、阴斗，自天英步入天蓬，为阴斗； 自天蓬步入天英，为阳斗； 不知是否？ 咒云：斗要妙子，十二辰。 乘光明兮，威武陈。 云云。 此自天英出天蓬也。 又有是斗咒曰：日月明，乾坤配。 斗道光，鬼道废。 吾从天蓬入天内，略过冲辅退，反归却向天禽与心对。 逢着柱任去英会。 人道通，鬼道碍。 此自天蓬出天英，为阳斗也。 又云：阴斗夏至，阳斗冬至。 今学三五飞步，不知用甚咒甚斗？ 人多念得斗要妙兮十二辰一咒。 或云临寝步阴斗方上寝床，是夜步阴斗，嗽不知是否？ 若出门出行皆便步，只以足步为纲，不用图。 又云有图。 不知如何。 今经云：三五飞步。 不知如何步，乞详以批诲，庶正舛误阙失，望赐明旨。 道生一，一生二，二生三。 三自三之后，不可得而同矣。 三五飞步，乃元纲之要略也。 阴阳二咒，出入起卧皆用之。 以足为纲，不用图。 一、经云：三甲与六丁，此出其宗。 不知使三甲、六丁，如何用诀？ 何谓出其宗？ 世有《三甲经》不真，用之不验。 六丁亦然。 望赐详喻以教后学。 三甲、六丁，经中有法，役使之道久。 故可见，用意不勤，则神不应，非法之罪。",
      "translated_text": "The two Dipper deities may appear as male or manifest in transformed forms.\n\nFirst, are *Mengshu*, *Mengliang*, *Zhongbao*, *Zhongqing*, *Jiwang*, and *Jiqian* the deities of the Southern Dipper? Whether these are their names or courtesy names, I humbly seek precise instruction on their gender and attire.\n\nThese are their hidden names. The robes of the *Shangqing* tradition vary in their transformations, with no fixed gender.\n\nNext, among the Three Terraces, *Yunyu*, *Qijing*, *Fengliang*, and *Qingqi* are the Four Saintly Divine Lords. Since the Three Terraces should have three names, why are there now four saints? Are the names of the Three Terraces omitted? As for the Four Saints, are they the Four Saints such as the *Northern Culmen*, *Tianpeng*, and *Zhenwu*? I humbly request detailed clarification.\n\n*Yunyu* is the name of the Upper Terrace. The Four Saints refer to the four saints beginning with *Tianpeng*.\n\nThe Supreme Yin and Supreme Yang, the venerable stars of the sun and moon, are named *Yuanxiong*. Their names consist of only two characters—is the sun named *Xuan* and the moon named *Nü*? Yes.\n\nThe celestial stems of the Five Phases are known by distinct titles. The Water Star is named *Yan*, the Fire Star *Ying*, the Wood Star *Miao*, the Metal Star *Jian*, and the Earth Star *Zhen*. However, the esoteric names of the Five Star Sovereign Lords in the *Fangwen* are as follows:\n- The Northern Celestial Stem Star is named *Qixuan*, styled *Jingyuan*.\n- The Eastern Jupiter is named *Chenglan*, styled *Qingning*.\n- The Southern Mars is named *Weiting*, styled *Sanrong*.\n- The Western Venus is named *Liaoling*, styled *Zhenxun*.\n- The Central Saturn is named *Zanglu*, styled *Danyan*.\n\nWhy do these differ? True names, hidden names, inner names, and Daoist titles vary; they are invoked according to their texts, and one need not doubt each discrepancy.\n\nThe Thirty-Two Heavens, from *Gonghua Yaobo* onward, consist of eight phrases totaling thirty-two characters—are these the names of the Thirty-Two Heavens? The scripture states: \"These are their hidden names, recorded in the *Duren* chapter, unknown to those who transmit the *Duren*.\" Which lines in the scripture constitute their names? For example, *Taihuang Huangzeng Heaven* and *Yujiao Yuming*—is the upper line the name and the lower the style? Or are \"Heaven\" and \"Emperor\" separate designations?\n\nIn the *Duren Jing*, each Heavenly Emperor’s phrase may consist of five, seven, or eight characters, such as *Taishi Yulong Tengsheng Heaven*. I humbly request clear elucidation to dispel the ignorance of later learners.\n\nThe Thirty-Two Heavens bear these names. For instance, *Zhilou Ahui* is an inner name, while *Yujian Yuming* is the style.\n\nThe Twenty-Eight Constellations, from *Qingzong Liju* onward, comprise seven phrases totaling twenty-eight characters—these must be the names of the Twenty-Eight Constellations. But from which constellation does *Qingzong Liju* begin? The scripture states: \"These are the scriptural stars of the Twenty-Eight Constellations, serving as the warp.\" Are the Five Stars the weft? The Twenty-Eight Constellations remain fixed as the warp, while the Five Stars revolve, determining fortune and misfortune—like weaving, where patterns emerge from the weft.\n\nThe Five Stars array their radiance and may manifest transformed bodies. How do they transform? Transformation means descending to the human realm, as when Venus becomes *Taibai*.\n\nThe scripture states: \"The Three-Five Flying Steps are the essence of the Flowing Net,\" with *Tianying* and so forth constituting the Seven Transformations. It also says: \"The Three-Five Flying Steps are its essential summary.\" Yet here it claims: \"The Three-Five Flying Steps are the essence of the Flowing Net.\" The primordial net’s unfolding differs greatly from the Three-Five. Moreover, the *Fangwen* compilation of the *Nine Palaces Three-Five Steps* includes the Yang Dipper and Yin Dipper: stepping from *Tianying* into *Tianpeng* constitutes the Yin Dipper, while stepping from *Tianpeng* into *Tianying* constitutes the Yang Dipper—is this correct?\n\nThe incantation reads:\n*\"Dipper’s wondrous child, the twelve celestial stems,\nRiding radiance, martial might arrays...\"*\nThis describes stepping from *Tianying* to *Tianpeng*.\n\nAnother Dipper incantation states:\n*\"Sun and moon shine, Heaven and Earth pair,\nThe Dipper’s Dao gleams, the ghostly path decays.\nI from Tianpeng enter the celestial inner,\nPassing Chongfu in retreat, returning to Tianqin to face the Heart,\nMeeting Zhu and Ren, proceeding to Ying’s assembly.\nThe human path opens, the ghostly path obstructs.\"*\nThis describes stepping from *Tianpeng* to *Tianying*, constituting the Yang Dipper.\n\nIt is also said: \"The Yin Dipper is for the Summer Solstice, the Yang Dipper for the Winter Solstice.\" When practicing the Three-Five Flying Steps, which incantation and which Dipper should be used? Many recite the *\"Dipper’s wondrous child, the twelve celestial stems\"* incantation. Some say that before sleep, one steps onto the bed facing the Yin Dipper’s direction—is this stepping the Yin Dipper at night? If one steps when leaving home or traveling, is it sufficient to use the feet as the guide without a diagram? Yet it is also said there is a diagram—how is this so?\n\nThe scripture states: \"The Three-Five Flying Steps.\" How exactly are these steps performed? I humbly request detailed instruction to correct errors and omissions, and to receive clear guidance.\n\n*\"The Dao gives birth to the One, the One gives birth to the Two, the Two gives birth to the Three.\nBeyond the Three, none can be the same.\"*\nThe Three-Five Flying Steps are the essential summary of the primordial net. The Yin and Yang incantations are used for all movements—entering, exiting, rising, and resting. The feet serve as the guide; no diagram is needed.\n\nThe scripture states: \"The Three Jia and Six Ding emerge from their origin.\" How are the Three Jia and Six Ding employed? What does \"emerge from their origin\" mean? The *Three Jia Scripture* in circulation is not authentic, and its use yields no efficacy. The same applies to the Six Ding. I humbly request detailed explanation to instruct later learners.\n\nThe Three Jia and Six Ding have methods in the scriptures, and their service has long been established. Thus, if the practitioner’s intent is not diligent, the spirits will not respond—this is not the fault of the method.",
      "overlap_context": "nected with *Zi*? Are these indeed the deities of the Northern Dipper? I humbly request detailed instruction on whether the Northern Dipper’s deities are male or female, and what attire and colors they wear.\nAll are addressed with the honorific *Zi*. Their attire follows fixed conventions: when wearing unbound hair and white robes, they command the generals in martial service; when adorned in crowns and regalia, they attend the perfected; and when clad in armor, they guard the Celestial Thearch.",
      "start_char": 1180,
      "end_char": 2437,
      "start_sentence": 76,
      "end_sentence": 159,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.3350887298584,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\灵宝净明院教师周真公起请画.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "一、净明法云：当遇缘合之人，望东烧香以问我，我许即传。 即我是度师，汝为保举之师。 今有绿合之人，八行俱全，至诚好道，忠孝可传之人。 东向烧香，以问真师，如何知其许传？ 如何报应也？ 乞赐批教，以为准的。 未敢具表申奏祖师，当先以投名状并保举状缴烧，以求报应，或乞梦，或乞四直功曹，传仙旨也。 此谓已闻见人道成时用。 如未见，则烧保举状，望东烧香，祈梦寐而已。 一、帝君诸位神明，逐日供养，合系皈依。 上依常式供养帝君，逐日合与不合拜礼？ 又有神王、直符、功曹之类，相夹杂在一坛供养。 莫自帝君、神王、真官已上合拜，传香、使者已下只合皈依顶礼？ 乞赐分别指教。 经法中自有逐日烧香法曰云云。 一、法云：菟掘符，飞治急病。 不知如何诀目使．飞治急病？ 飞者，是以火烧飞之。 如何使符能飞去？ 用何直符持去？ 乞赐详谕。 菟掘，即符神名也。 是火烧之。 一、自度脱六亲救治百病符，皆可雕印子印否？ 印时存想，如书符时，如度脱六亲符，服炼身形符，日日服食。 恐事夺，每日书写，不办救治百病。 已下三符，不日用遇，使时旋书，莫不须雕印。 若遇时灾瘟疫，散施符水，请给多时，还可用印印否？ 乞一一批诲。 雕印便於修行养炁者。 凡净明符，除唾易修摩不可用，其他皆可用。 一灵书中，散符名下云：念咒或一徧，或三徧者，唯后只是念散符咒，是念《灵书》三徧咒，书扬岐啰吱啰。 符云：恰诀念咒。 不知是念灵书三徧，或只书念扬岐啰吱啰一句？ 又诸符多有不说徧数者，云念咒书符。 乞一一批诲。 只念散符一句。 在符下者，此符是也。 如是有无徧数者，皆七徧。 看作何用者，皆烧。 方文伏睹真师批诲，慈悲一一遭遇之。 幸庶使演其真教，不为人所难晓。 然后可以教人，不辱方文拜问。 灵宝净明院教师周真公起请画一竟",
      "translated_text": "The *Scripture of Pure Clarity* states: \"When encountering one whose karmic conditions align, face east and burn incense to inquire of me; if I grant permission, then transmit the teachings. I shall serve as the master who delivers, while you shall serve as the master who vouches. Now, if there is one whose karmic affinity is ripe, whose eight virtues are complete, who is utterly sincere in seeking the Dao, and whose loyalty and filial piety render them worthy of transmission—when such a person faces east to burn incense and inquire of the true master, how may one discern whether permission is granted? And how shall the response manifest? I humbly request your instruction to establish a clear standard. Before daring to submit a formal petition to the ancestral master, one should first present a letter of intent along with a letter of vouching, then burn them to seek a response—either through a dream or through the Four Upright Merit-Officials, who shall convey the immortal’s decree. This is what has been observed when others have succeeded in the Way. If no such signs appear, then burn the letter of vouching, face east to burn incense, and pray for a dream revelation.\"\n\nAs for the daily offerings to the Lord Emperor and the various deities, should one take refuge in them? Following the usual ritual, should one make obeisance to the Lord Emperor daily, or is it unnecessary? Moreover, when deities such as the Divine Kings, Upright Talismans, and Merit-Officials are enshrined together on the same altar, should one bow only to the Lord Emperor, Divine Kings, and True Officials, while merely paying reverence with incense and obeisance to the messengers and attendants below them? I humbly request your distinction and guidance. The scriptures and methods already contain daily incense-burning rituals, as stated therein.\n\nThe method states: \"The *Tuhu Jie* talisman swiftly heals acute illnesses.\" But how is the incantation employed to dispatch it for urgent treatment? \"Flying\" refers to burning it with fire. How does the talisman take flight? Which Upright Talisman should be invoked to carry it? I humbly request your detailed explanation. *Tuhu Jie* is the name of the talismanic spirit, and it is activated by fire.\n\nMay the talismans for self-deliverance, liberating one’s six relations, and healing all illnesses be carved into printing blocks? When printing, should one visualize as when inscribing talismans? For instance, the talisman for liberating the six relations and the talisman for refining the body should be ingested daily. However, if circumstances prevent daily inscription, these three talismans—used only when needed—should be written as needed rather than carved. Yet in times of calamity or pestilence, when distributing talismanic water widely, would printing be permissible for mass distribution? I humbly request your instruction on each point. Carving blocks is convenient for cultivation and qi-nourishment. For all Pure Clarity talismans, except those requiring saliva or manual tracing, printing may be used.\n\nIn the *Book of Numinous Writings*, beneath the names of dispersed talismans, it states: \"Recite the incantation once or thrice.\" Later, it mentions only reciting the incantation for the dispersed talisman—does this refer to reciting the *Book of Numinous Writings* three times, or merely inscribing and reciting the line *Yangqi luozhi luo*? The talisman states: \"Grasp the mudra and recite the incantation.\" I am unsure whether to recite the *Book of Numinous Writings* three times or only the single line *Yangqi luozhi luo*. Furthermore, many talismans do not specify the number of recitations, simply stating \"recite the incantation and inscribe the talisman.\" I humbly request your instruction on each point. Recite only the single line of the dispersed talisman. For those listed beneath the talisman, this is the method. Where no recitation count is given, recite seven times. Depending on the purpose, all are burned.\n\nHaving witnessed the true master’s compassionate guidance on these matters, I am fortunate to have encountered such clarity. May this ensure the transmission of the true teachings without obscurity, so that I may instruct others without betraying the questions posed in this petition. Thus concludes the inquiry of Zhou Zhengong, Instructor of the Numinous Treasure Pure Clarity Abbey.",
      "overlap_context": "ow are the Three Jia and Six Ding employed? What does \"emerge from their origin\" mean? The *Three Jia Scripture* in circulation is not authentic, and its use yields no efficacy. The same applies to the Six Ding. I humbly request detailed explanation to instruct later learners.\n\nThe Three Jia and Six Ding have methods in the scriptures, and their service has long been established. Thus, if the practitioner’s intent is not diligent, the spirits will not respond—this is not the fault of the method.",
      "start_char": 2438,
      "end_char": 3173,
      "start_sentence": 160,
      "end_sentence": 203,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.554486989974976,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\灵宝净明院教师周真公起请画.txt",
        "category": "方法类"
      }
    }
  ]
}