{
  "source_id": "灵剑子",
  "source_file": "chunked_daozang\\灵剑子.json",
  "total_chunks": 7,
  "total_original_chars": 8320,
  "total_translated_chars": 47800,
  "total_translation_time": 243.6214861869812,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\众术类\\灵剑子.txt",
    "category": "众术类"
  },
  "full_translation": "**The Scripture of the Numinous Sword**\n\n**Title:** *Lingjianzi* (*The Master of the Numinous Sword*). Originally attributed to Lord Xu of Fangyang. One scroll. Base text from the *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, *Zhongshu* Category.\n\n---\n\n### **Preface (First Chapter)**\nThose who seek the Dao and long life must first practice *qi*-absorption. Those who dwell in the worldly and pursue fame and profit—when fame is established, profit flourishes; when *qi* is cultivated, longevity extends. This is the noble man’s embrace of destiny, not the petty man’s vaunting of cunning.\n\nWhen both civil and martial virtues are complete, one may become a loyal minister aiding the state. When essence and *qi* are both perfected, one becomes a true immortal’s heir.\n\nThe Master once said he did not know the root and origin of the Dao, so he asked Laozi and learned that the Dao is *qi*. If form and spirit are insufficient, one labors in vain. If the heart’s intent is biased, nothing will be attained. When the heart is upright, the spirit harmonizes; when the spirit harmonizes, the Dao’s *qi* is full.\n\n---\n\n### **Learning and Inquiry (Second Chapter)**\nAll who guard the wondrous Dao possess extraordinary forms, for it cannot be sought in haste. Without lifelong accumulation of virtue, one will not bear the marks of transcendence.\n\nSome, though learned, act with reckless frivolity; others, though steadfast, remain pure and sincere. Do not judge by long eyebrows, inverted pupils, or red-and-white eyes differing from the face. Those with thirty-six to forty-two teeth, a black mole on the abdomen, a long tongue, hands that hang past the knees, ears level with the neck, or soles inscribed with lines reaching the heel—these bear the signs. Some have the *qian* and *kun* trigrams on their foreheads, or auspicious characters on their chests, with dignified and radiant bearing. Others, though their bodies and clothes are filthy, harbor purity within, their traces mingling with dust and grime. They cast no shadow before the sun, moon, or lamp.\n\nThey constantly bestow kindness upon others, digest food swiftly but excrete slowly, and their urine forms pearls from their pores. Their mouths are square, their necks angular like horns, or resembling the sun, moon, qilin, dragon, or tiger. Their jade pillows are sharp as rhinoceros horn. Such people easily attain the Dao.\n\nThe steadfast and truthful, who never retreat, all achieve transcendence—these are the true immortals of the world, their merit complete as they ascend with their dwellings into the heavens. Those of profound wisdom, who scorn wealth and revere the Dao, though lacking supernatural transformations, will ultimately be honored for their deep virtue. They await only the completion of their hidden merits to join the company of the enlightened.\n\nWithout these signs, one’s efforts are in vain, the mind deluded. Even with the diligence of drinking ice and eating cypress, they will sink among the lower ghosts.\n\nI have sought among the various masters, and my heart aches for them. If I can awaken others, so they do not waver in their resolve, those with these signs will easily attain immortality, having reaped great benefits from the Dao over many lifetimes.\n\nThose who now ardently yearn for the Dao and urgently seek the Mysterious Female (*xuanpin*) must widely practice kindness within the Daoist gate. Those who achieve these extraordinary signs and merits have cultivated diligently over lifetimes, and in this life, they attain liberation.\n\nThose who delight in the Dao and earnestly cultivate life in this life are blessed by their accumulated practice.\n\n---\n\n### **Qi-Absorption (Third Chapter)**\nThe body depends on *qi*; *qi* arises from the body. Body and *qi* interdepend to form the physical self. The *hun* and *po* souls move within, descending and infusing to become spirit, giving rise to the five viscera.\n\n*Qi* is the mother of blood; blood is the mother of essence; essence is the mother of spirit; spirit is the mother of form. There has never been a form that took shape without *qi*. *Qi* exists because of form, and the *hun* and *po* accompany it.\n\nSpirit is the mother of *qi*. Embryonic breathing (*taixi*) is achieved by imagining an infant, thus attaining harmony. Harmony becomes primordial harmony (*yuanhe*). In the intervals of exhalation and inhalation, within the Three Primes (*sanyuan*) and even the hair’s pores, all is pervaded and permeated.\n\nAll is governed by the heart-monarch and the intent-minister, who regulate and restrain. Without engaging the heart in affairs, the ruler remains at peace. Anxiety and thought disrupt the principle of spontaneity.\n\nThe heart is the fierce fire of the ape, belonging to *si* and *wu*. The kidneys are the demeanor of the yin woman, the graceful root of *hai* and *zi*, where the Azure Dragon and White Tiger soar and crouch in their *qi*-generating power.\n\nThe heart’s fire becomes cloudy mist; the moon’s moisture becomes cloudy rain. Following the northern *kan*, they return to the *qi*-palace of the kidneys in *zi* and *hai*. The heart’s *qi* in *si* ascends to the Muddy Pellet Palace (*niwan gong*), descending to nourish the eight corpses and hundred joints. Even the hair responds completely, for there is no obstruction to the principle of primordial harmony, which cures a thousand illnesses and myriad diseases.\n\nWhen the heart-monarch emits fire, it burns all under heaven without exception. Clearly, the five grains and five flavors, when practiced long, naturally diminish.\n\nInitially, one may swallow thirty-six times, alternating dry and moist. Concentrate the heart’s *qi* and send it with intent to the *qi*-sea below the navel, flanked by the sun and moon. The left kidney is the sun; the right kidney is the moon. These two sides ascend together to merge as one.\n\nFirst, visualize the right kidney as the moon, its white *qi* entering the *qi*-sea. From the right side of the spine, it rises to the Muddy Pellet Palace at the crown—three inches within the space between the eyebrows. Then, pass through the Cavern Chamber Palace (*dongfang gong*), proceed through the Hall of Light Palace (*mingtang gong*), and guard the inch-wide double field below. Traverse the Twelve-Storied Tower (*shi’er chonglou*), pass through the Crimson Palace (*jiang gong*), and enter the golden chamber of the *qi*-sea, where the sun and moon illuminate both sides.\n\nNext, visualize the left kidney as the sun, its yellow *qi* ascending along the left side of the spine through the bone seams, directly entering the Muddy Pellet Palace. Proceed through the Cavern Chamber Palace, the Hall of Light Palace, guard the inch-wide double field below, traverse the Twelve-Storied Tower, pass through the Crimson Palace, and enter the center of the *qi*-sea, where the sun and moon shine on both sides.\n\nThen, visualize the white *qi* as the core and the yellow *qi* as the outer layer, forming a round pearl. Yellow outside, white inside, it hangs in the *qi*-sea, radiant as an orange, round as a pellet. With long practice, its light rivals the sun and moon...\n\nHere is the translation:\n\n---\n\nThis is the Mysterious Pearl, the Mysterious Female within the Kidney Palace—thus is the pearl. It is also called the union of two things into one, formed by one yin and one yang. Both are yellow on the outside, with the yellow as the outer layer and the white as the core.\n\nThe Crimson Waters are the blood. When the Mysterious Pearl is formed, the fluids and blood naturally fill. If you wish to verify this, mix bitter wine with the essence-dew; after one night, it will return to blood. After nine years of practice, the sinews and bones transform, and one becomes light enough to ascend as an earthly immortal.\n\nBefore refining the great elixir, one must first complete the cultivation of *qi*, relying on *qi* to replenish the body’s essence. Only then will the great elixir begin to take effect. Beginners in *qi*-absorption must not immediately seek the Mysterious Pearl. First, for three years, eat bland foods—do not yet cut off grains entirely. Lustful desires must be completely severed; otherwise, one will instead shorten one’s lifespan.\n\nAt the fifth watch, swallow thirty-six mouthfuls, linking the fluids and *qi*. Gradually reduce food intake, eating only bland foods and avoiding salt, vinegar, and extremes of cold or heat. Eat a full meal at midday, but little in the morning and evening. After three years of this morning and evening practice, one will gradually find bland foods flavorful. Do not abruptly cut off grains entirely, for this will cause great harm.\n\nWhen bland foods begin to taste good and worldly flavors are no longer craved, the five viscera will become firm and strong. If the five viscera are weak, use medicines to replenish and strengthen them—this is why bland foods become flavorful. After this, one may gradually eliminate the five flavors and five grains. For three days, eat bland congee, vegetable broth, sesame leaves and stems, wolfberry, Solomon’s seal, jujubes, and the like to aid the process, before finally cutting off grains. One should feel naturally satiated, without hunger or thirst. If suddenly exposed to the steam and scent of cooked grains, after long practice, one will naturally know to avoid them.\n\nAfter three or seven days of hunger and fatigue, eat cold bland noodles or leaf-wrapped dumplings. When hunger or thirst arises, visualize the *qi* within the center, and at any time—morning or evening—swallow it according to the previous method. This will substitute for food and bring satiety, just like eating. If one later wishes to eat, taro, yams, or *Polygonatum* may be consumed, along with a little tea. But if salt is added, hunger will immediately return.\n\nThe five flavors are the five thieves, also called the five poisons: salt, vinegar, water, fermented beans, and pungent foods. At this stage, one may consume fine wine, pepper-yellow pills, glutinous rice, and raw pepper. Glutinous rice nourishes the stomach’s *qi*, while pepper guides *qi* back to the lower origin. Blandly cooked fermented grains, taro, winter melon, yams, and scallion broth may also be eaten, but all must be cooled before consumption. Wine aids *qi*, and fermented grain broths help guide the original *qi* to completion more easily. After drinking, *qi* flows more smoothly. One need not drink much—vomiting from drunkenness will cause harm. An occasional cup will stave off hunger and substitute for food. Wine washes away yin impurities, and those who attain the Dao never dislike it. Wine refines the true and nourishes *qi*; one need not drink ginseng broth, for it stimulates the appetite and thus causes hunger.\n\nWolfberry and jujubes are highly beneficial. Melons and peaches aid *qi*, and oranges may be eaten, but avoid their peels, as they induce hunger. Chestnuts, peaches, fox nuts, lotus roots, and water caltrops may also be consumed in moderation, but cold foods can disrupt *qi*.\n\nWith time, the spirit and essence will flourish. One will no longer feel weary at night, and the eyes will emit divine light like lightning. In darkness, one will see as if in daylight—these are the signs. One must urgently guard and seal the essence and marrow, for the Dao is about to be achieved. If, at this moment, one fails to guard it and instead indulges in lust, death will follow.\n\nWhen the divine light and spirit manifest, the spirit is about to scatter from the body. If the light departs, so too will the spirit. Therefore, one must urgently guard the essence, seclude oneself, and subdue the impulses. This is the sign of the divine light appearing, the yang spirit flourishing, and the yin impurities nearing exhaustion. If one cannot urgently guard it and merely endures hunger and abstains from flavors, one does not enter the rank of divine immortals.\n\nIf one cannot yet sever desires, one must regulate and moderate bedroom activities, practicing emission without leakage. Once essence and marrow are lost, they become permanent tears and leaks. Such a person is not a true adept but a muddled, essence-leaking fool.\n\nBedroom matters are difficult to control and often reverse spiritual progress and wisdom. One must rely on worldly flavors to pass the days, using meat and grains to sustain oneself; otherwise, one will swiftly sink into the realm of ghosts. If one masters the principles of control in the bedroom and deeply understands its subtleties, one will grasp the ultimate truth. When encountering a young maiden, one may absorb and refine her essence, swallowing it. This is like a tiger growing horns—both civil and martial virtues are complete. Such practices are reserved for those of great fortune and virtue, not for ordinary people.\n\nWhen essence loses its proper place, it is like the sea drying up and mountains collapsing—hundreds of streams lose their course, and a thousand lands fall into ruin. No remedy can restore it. A hundred illnesses converge, and karmic ghosts draw near. To re-cultivate after such loss is nearly impossible; not one in a thousand succeeds.\n\nIf one cultivates the previous *qi* practices with a calm heart and severs desires, one will imagine that no illness can invade, and plagues or pestilential toxins cannot harm. If the brain’s marrow is depleted, pestilence will enter from the crown. If the brain is full and essence abundant, ghosts and spirits cannot cause harm.\n\nFor any illness, rise early and regulate the *qi* to dispel it. Circulate the *qi* to penetrate the five viscera and six bowels, expelling it through the hundred joints and hair follicles until one feels a sticky sweat like glue—this is the sign of efficacy. If the illness does not recede, continue regulating the *qi*, visualizing the hundred spirits within and outside the body, swallowing and sealing. One may also lie wrapped in bedding within a canopy, practicing *qi*-absorption as before.\n\nFor wind, *qi*, miasma, consumption, poison, or any illness, use the previous method to drive it out from the sinews, bones, and marrow. The efficacy of this surpasses that of ten thousand medicines. Of the 202 illnesses, those caused by heat are called wind, and those caused by cold are called *qi*. This method can cure them all—hence the saying, \"the four hundred and four illnesses.\"\n\n---\n\nThe *Scripture of the Yellow Court* states: Immortals and Daoist adepts are not divine by nature—they accumulate essence and amass *qi* to congeal the True. They do not first rely on great medicines to achieve this. Since ancient times, those who attained the Dao—such as the sages of Jambudvīpa and the Wind Sovereign, the Seven Primes and the Three Elders—all preserved their True Nature through *qi*, not by first relying on great medicines.\n\nAll those who attained the Dao—divine immortals, sages, and superior adepts—initially achieved realization through *qi*. There is no other path to transcend the Three Realms. Soaring through clouds and mist, their spirits transform and penetrate, roaming above the sun and moon within the Yang realms, observing the Three Isles and Ten Continents, the water palaces and the caverns of Mount Yin. They ride cranes and mount dragons, float upon fish and stride upon turtles, feast on bees and cast cups through walls, plant flowers that take root in pillars, and dispatch talismans into beams—all through the agency of *qi*.\n\nIn a single day and night, there are thirteen thousand five hundred cycles of breath, with *qi* entering and exiting. Twenty-seven thousand *qi* correspond to one spirit, and each can be directed at will. Thus, once *qi* is mastered, one transforms cold and heat within a single breath, perceives the Six Directions within a hair’s breadth, and can blow against the sea’s waters to reverse their flow for a thousand *li*—all by ascending from the mundane to the divine.\n\nFor those beginning to practice *qi*-absorption, first still the hairs within the nostrils, for the nostrils are the passageways that thoroughly connect the five viscera and six bowels, the channels of breath’s ingress and egress. Gently inhale through the nose, swallowing the pure *qi*, and exhale the turbid *qi* through the mouth—ever so softly. For all heat-induced illnesses, open the mouth wide and exhale with a *he* to purge; the Six Breaths need not be employed. For cold-induced illnesses, exhale with a *chui* to supplement, thereby regulating the upper burner’s afflictions. The *qi* should flow subtly, allowing the body to seek its own harmony.\n\nThere are two stages: the upper stage, from the heart’s primordial *qi*, and the lower stage, from the lower elixir field, together forming the \"two stages.\" The upper stage governs the regulation of illnesses in the upper burner, while the lower stage involves absorbing the *qi* within the heart. When practicing *qi*-absorption and regulation through swallowing, use the internal *qi*—this is called the Inner Elixir. The *qi* of the heart’s intent should be maintained continuously, without drawing upon the external *qi* of the upper stage, for external wind harms the five viscera. Thus, the two stages are divided for regulation. Without this division, the Mystic Pearl and the Crimson Waters remain unknowable.\n\nFor those who have practiced *qi*-absorption under a master, the *qi* becomes familiar and flows easily. For those without a master, the *qi* is raw and difficult to absorb. With prolonged practice, even those who violate the precepts will come to understand through self-realization.\n\n**Fourth Parable: The Dao as an Ocean**\nThe Dao is like the vast and boundless sea, its depths no different from its storm-tossed waves. Without having ventured forth oneself, traversed its perils, and endured its dangers, how can one truly know it? The common folk hear of it and are bewildered, unable to grasp its wonders, seeking the extraordinary in vain. Only by plunging into its whale-waves can one come to know it fully.\n\nThis is like one who has journeyed through the secluded and perilous states of You, Qing, Hua, and Wei, and then travels again—passing through customs barriers, ferries, villages, monasteries, Daoist abodes, sacred altars, spirit temples, grotto-heavens, and famous mountains—knowing them all intimately. One proceeds directly without obstruction, arriving wherever the will directs. This is called \"having journeyed before,\" for familiarity makes it easy.\n\nThose who practice internal *qi*-absorption are likewise. Without having traversed the path themselves, if they wish to reach the destination, how can they arrive without guidance? Even with no one to point the way, through diligent inquiry and unwavering resolve, they too will reach the destination—though with greater toil and delay. The immortal caverns are profound and secluded; only with steadfast resolve can one enter. Those who waver in faith and wisdom, never having journeyed, do not follow the direct path—thus the difficulty of cultivation.\n\nWhen the *qi* is fully matured, one may freely bestow blessings with humility, or abstain from food for years, or eat thrice daily, or fast entirely, or take one meal every three days, or subsist on a single daily congee. Through such hunger and thirst, the five viscera are tamed and harmonized—this is the sign of *qi*’s maturity.\n\nHerbs and minerals—such as talismanic water, purple ganoderma, southern bamboo, Solomon’s seal, white vitex, pine resin, cypress, poria, atractylodes, white atractylodes, wolfberry, *he shou wu*, golden cherry, fox nut, wax, calomel, cinnabar, frankincense, gleditsia seeds, black soybeans, and white storax—are all suitable for consumption.\n\nThough one may ingest these medicines, without absorbing the harmonious primordial *qi*, fasting and abstinence will wither the intestines, parch the blood vessels, and dry the meridians. Hoping for spontaneous longevity is futile; it is better to rely solely on the primordial *qi*, freely abstaining or eating as one wishes. This is the fruition of *qi*.\n\nWhen the *qi*’s work is complete, the sinews and bones become supple, the hundred joints flow smoothly, the fetal fluid daily increases, the blood vessels grow robust, and the hands and feet can coil atop the head. One can form a pellet with a single exhalation, expelling it like a ball. Some become purely sinew without bone, their essence solid and blood abundant—thus it is. Hair and body hair are entirely renewed.\n\nHave you not heard the *Daodejing* say: \"None in the world can know or practice it\"? Even sages like Confucius, Boyi, Shuqi, Bigan, and Qu Yuan could not comprehend it—how much less the common folk, entangled in worldly affairs? Truly, it is difficult to know.\n\nAlas! Indulging in greed, extravagance, and lust, one declines into decay—teeth wither, hair whitens, and old age overtakes them. They willingly scatter their form and soul, burying themselves in desolate earth. Reborn as infants, oxen, horses, pigs, sheep, chickens, dogs, fish, or insects, they torment their own form and soul. Those with greater karmic force drift through the currents of love and enmity, while those with lesser force become mosquitoes or maggots. The power of the Great Dao eludes them, for they know not this principle.\n\nHow could they know that the Dao is like the ocean, its responsive power shaping mountains and rivers? Fish, dragons, and serpents all stir clouds and spread rain, their might astonishing.\n\nThus, the Great Dao embraces the subtle and penetrates the minute, as deep and unfathomable as the ocean’s abyss—none can fathom or seek it. Therefore, the *Yin Fu Jing* states: \"Heaven unleashes its killing mechanism, and all things—fruits, grasses, insects, fish, mosquitoes, maggots, mole-crickets, and ants—all contain the qi of the Dao.\" The Dao resides within them, as fish dwell in water; the fish know not that water nourishes their form, just as the Dao abides in humanity, like the wind whose form cannot be seen. Thus, the *Huangting Jing* says: \"The tortoise draws qi to its spiritual root.\" This speaks of the tortoise’s attainment of qi, granting it long years without death. The snake, hibernating with a stone in its mouth without eating, transforms the stone into snake-yellow, a testament to the efficacy of qi. The phoenix and crane, mastering the subtleties of qi, roam the immortal grottoes of the Three Isles and Ten Continents; great immortals ride upon them—such is the marvel of their attainment of qi. The clam, embracing the autumn moonlight, forms a pearl; the macaque, learning dhyāna, enters samādhi; the white deer, skilled in stretching its joints, lives nine thousand years. Only humans, unaware of the arts of *daoyin*, fail to attain immortality.\n\nThe soft-shelled turtle, in winter, absorbs qi within the sand; the glow-fish burrows into dry earth; the silver carp feeds on water’s foam; the carp transforms into a dragon, summoning clouds and spreading rain. Yet humans, dwelling in the world, neglect the cultivation of the Dao and seek life outside themselves—how can they ever regain a human form? Alas! How sorrowful! Thus, the scriptures say: \"As if present, as if absent.\" When the Dao is present, one attains it; when it is lost, one forfeits it. Know this: humans who lose the Dao perish, just as fish who lose water die.\n\nAlas! Worldly people enter the mountains to seek the Dao, like climbing a tree to catch fish. They traverse great distances to find a master, like praying for rain in a drought. Thus, the *Yin Fu Jing* states: \"Thrice returning by day and night, one’s efforts surpass ten thousandfold.\" All things can steal from humans, and humans can steal from all things. Yet with an empty mind and a full abdomen, the qi of the Dao comes of itself; spreading virtue and bestowing merit, timely sweet rains descend.\n\nAs for the thieves of the Dao: all who consume the five grains grown from the earth—whose essence is of soil—will ultimately harm themselves, buried by the very earth. But those who feed on the primordial harmony of yin and yang’s qi, forsaking finite things, dwell eternally in the celestial kitchen. Thus, heaven cannot kill them, earth cannot bury them; my life is in my own hands, not in heaven or earth. Therefore, the Metal Mother said: \"The Three Passes determine life and death.\" How does the qi of the Dao compare to the moon’s reflection in the toad’s shadow? Every household radiates purity and brightness, ascending in their dwellings to the heavens; every person is imbued with the qi of the Dao. When saliva fills the mouth and is swallowed, it becomes *qiongye*—the sustenance of immortals.\n\nAfter one year of cultivation, the viscera are whole; after two years, the ailing body is healed; after three years, the blood and vessels are firm; after four years, the sinews and bones are refined; after five years, the eyes become bright; after six years, life is prolonged; after seven years, the marrow becomes like silk; after eight years, one becomes an earth immortal; after nine years, the hair turns black as dark jade. After nine years of cultivation, one can lightly ascend a hundred or ten *zhang* high, freely roaming the famous mountains and grottoes, unobstructed and unhindered. Weapons and armies cannot harm them; water and fire cannot afflict them; ghosts and spirits cannot disturb them. Dragons submit of themselves, tigers yield of themselves; spiritual powers are at their command—this is called a *zhenren*. Further cultivating the methods of ascension, chanting the mysteries of the grottoes, one soars to the yang realms and rests, wandering above the sun and moon—this is called a celestial immortal. Some govern immortal grottoes, some oversee the registers of immortals, some manage the records of cultivators, promoting them in due order, much like official ranks in the human world, each with its own duties. Those who do not cultivate the arts of ascension may retreat into grottoes, becoming earth immortals for eternity, their merit and fruition complete.\n\nAll who engage in cultivation must accumulate hidden merits, amassing three thousand; when their virtuous works are fulfilled, the Jade Emperor will naturally summon them to the Mystic Capital to receive their office. If one does not cultivate hidden merits, their name will not ascend to the Mystic Capital. Though their name may be recorded among those who cultivate the Dao, without a ledger of hidden merits, the celestial decree will not promote them for lack of accomplishment.\n\nThus, in cultivating the supreme methods, hidden merits come first; only then can one deliver others while perfecting one’s own merit. From ancient times, all who attained the Dao followed this path. The Dao is united by faith; virtue is preceded by wisdom. My Dao is like the sea—it is called the Dao-Sea. Without faith, without cultivation, I have spoken all. Those of shallow wisdom and meager virtue must not lightly divulge these teachings. Only after ancestral transgressions are expiated, obstacles removed, and the master’s transmission received—pledging with gold, swearing before the Ten Heavens, fasting, bathing, bowing, and kowtowing—may the teachings be imparted.\n\nFools amass wealth by the thousands, hoarding hundreds of herbs and minerals, yet their remedies have little healing power and no effect in prolonging life. To learn the arts of immortality, one must rely on qi techniques: visualize the left canine as the Golden Bell, the right as the Jade Chime, and the upper and lower front teeth as the Jade Tablets. These are also called the Celestial Drum. Gather the spirit, initiate the petition, and submit the memorial to beseech the removal of calamities, disasters, and malevolent spirits. Strike the Celestial Drum thirty-six times; dispatch talismans to slay demons, reverse misfortune, and dispel disasters. Strike the Golden Bell twenty-four times; administer elixirs and consume medicinal foods, striking the Jade Chime twelve times.\n\n**Dark Inscription, Fifth Scroll**\nTo cultivate the Dao and nourish the sacred embryo is the Way of long life and enduring vision—all possess it. Yet few are those who aspire to it. The sacred embryo is embryonic breathing. Envision the infant, the newborn—this is the Way of immortality and deathlessness. Whether present or absent, do not cling to either. Those who have faith in the qi of the Dao spare neither body nor life, steadfast in their resolve to learn the Dao. Only by deeply exploring the mysteries can one grasp the ultimate truth—then, whether present or absent, one does not cling. Cultivating the qi of the Dao, its currents flow unimpeded; the profound subtleties are the goal. Fear not death, and one will attain it.\n\nThe *Niwan* connects the hundred joints—the *Niwan* is three *cun* inward from the space between the eyebrows.\n\nWithin lies a path that enters, connecting to the crown at the back and the spine, extending through the bones of the feet, entering the *Qi Sea*, and exiting through the great and small *Li Gates*—its effect akin to the clarity of *ghṛta*. The *Danque* pulse embodies the Three Powers.\n\nThe *Danque* resides in the Central Palace, where the heart governs the cinnabar—its color is crimson. The Crimson Palace is ruled by the Heart Lord, who oversees the hundred cities and thousand states, all governed by the Heart Lord, with blood and pulse in harmony. The pulse is the regulation, harmony, and purity of cultivation. The Three Powers are the Three Burners: the Upper Burner corresponds to Heaven, the Middle Burner to Humanity, and the Lower Burner to Earth—modeled after the primordial harmonizing *qi*.\n\nIf one calculates in three cycles, unaware that the mysterious Dao is *qi*, one cannot fathom the distance or the breadth of the journey, and may fear never encountering it. Yet with steadfast resolve, one ventures forth as if exploring the depths of learning. Upon return, seven days have passed. The art of exploring to attain *qi* is so wondrous that it cannot be confined to the self, nor to others—thus, the return is swift.\n\nSeeking the *Mysterious Pearl* in the vast sea: as previously explained, it is like searching for a pearl within the ocean—if one has sought it before, then nothing will be left unobtained. But if one merely thinks of it without ever seeking, it remains as distant as the boundless sea. The path of *Red Water* lacks a guide. *Red Water* is blood. Even if the *Mysterious Pearl* is attained, without the fluid of blood, there is no guiding path.\n\nWithin the embrace of good and evil blooms the art of long life: if cultivated with goodness, it is easily attained. Evil is the failure to grasp the profound mystery. When cultivation reaches the *Qi Sea*, the radiance of life shines within—like the brilliance of a blossoming shadow.\n\nUrging from both flanks: focus the pure *qi* of *huixiang* along the spine, its movement pressing from both sides—*cui* means urgency. Thus is the *Mysterious Pearl* formed, as explained in the previous chapter. Within it, there is nothing—*qi* resides there, yet nothing exists. When the *qi* of the Dao is perfected, the mind reaches the state of no-mind, and in movement or stillness, one aligns with the principle of non-action, returning to the realm of spontaneity.\n\nScratching the head upon the Jade Terrace: the head is the crown, *sao* means movement, the manner of departure. The Jade Terrace and Jasper Chamber are the palaces of the sun and moon—this is the府 of the Three Hun of the Yang realm, the abode where the human spirit resides.\n\n**Record of the Pine Sand, Sixth Chapter**\nSince I began cultivating the Dao, I have come to understand that *qi* arts come first, and hidden merit is paramount. Recently, I obtained the *Spiritual Sword* and dispelled the toxins of demonic serpents and *shen* that harmed the people. Above the deep pool, I cast an iron cauldron to seal the *shen*’s lair. At night, I commanded spirits to forge two iron pillars—one secretly placed in *Yuzhang*, the other in the south. Another was erected on the Western Ridge, fearing the *shen* might surge forth and drown the people, so I placed a pillar on the western mountain, before the twin peaks to the east.\n\nI slew a great serpent at the border of *Xiping* and *Jianchang*, and its offspring emerged from its belly, fleeing into the sea. I pursued it with the flying spirit-sword, but as this serpent-child bore no fault, the divine sword did not slay it. My disciple Wu Meng said: \"This serpent-child will, in five hundred years, resume its harm to the people. You should mark this with a pine altar—when the pine branches droop low over the altar, brushing the ground, it will have been five hundred years. I shall descend to observe, and if it harms the people below, even my spirit-sword will be unable to slay it.\"\n\nNow, in the lands of *Yuwei* and the Five Mounds, eight hundred have already departed in succession, all attaining the Dao here and achieving earthly immortality. In time, worthy successors will arise to subdue it. Wu Meng asked: \"What shall we use as a marker?\" I replied: \"In the center of the great river of *Yuzhang*, a sandbar will suddenly emerge, gradually extending downstream until it covers the *Shakou* inlet, facing *Longsha*—that will be the sign.\"\n\nAs each cultivates the Dao and succeeds in turn, they ascend to the Golden Gates. Those who become masters of grotto-heavens and famous mountains will emerge from the land of *Yuzhang*, greatly propagating my teachings. I have composed *Fifty Scrolls of Qi Arts and Medical Sayings of the Commandery*, which will circulate in the world—do not worry, my disciple.\n\nMy disciple returned the sword after slaying the stone beast of *Nanhu*: the flying sword entered the beast’s eye, and though it exhaled clouds of vapor, the sword only struck its face, sparing the eye. Since the beast bore no fault, the sword did not slay it. Thus, the sword was sheathed and returned. For this merit, I am called *Lingjianzi*, and I transmit this to those who later attain immortality.\n\nIn the western city of the *Yuzhang* River, I sought the former traces of Lady Wei and Master Hong, entering the mansion to retrieve golden coins and elixir medicines. I again emphasized the *qi* arts and hidden merit. For those who study the Dao, first widely cultivate hidden virtue, then practice *qi* refinement, holding to the method of inner elixir for long life and enduring vision—this has been explained in the previous chapter and need not be repeated. Only after the *qi* is perfected does one proceed to refine the great medicine.\n\nOf the ten who attained the Dao and ascended, and those who achieved liberation through *shijie*, all placed hidden merit first: relieving the poor, rescuing the distressed, secretly bestowing kindness, aiding the hungry and cold, and employing all manner of expedient means to accumulate the full three thousand merits. Then, the *Siming* and *Silü* will report to the Supreme Mystery, and the great medicine may be cultivated.\n\n**Sincerity of the Dao, Seventh Chapter**\nThe Dao takes purity and stillness as its foundation, and virtue takes hidden merit as its priority. Sever desires at their root to achieve it. Abstain from grains and flavors to fill the belly—when the belly is full and unobstructed, it is easily traversed, and thus truly full. A clear and empty heart and belly are the constant of the Dao.\n\nFor those beginning cultivation: the eyes do not gaze upon sensual desires, the ears do not listen to mournful sounds, the mouth does not consume rich flavors, the nose does not seek exotic fragrances, and the body does not touch filth—these are all detested by the highest immortals. This is called the sealing of the six senses. If one can adhere to sincerity and sever these, one becomes a great immortal.\n\nFor those newly embarking on the path, do not abruptly cut off all things—simply adopt a bland diet. Gradually reduce worldly foods and affairs, and likewise diminish worldly engagements.\n\nThose who awaken to the truth may stir alarm among the masses, inviting misfortune and peril, their bodies consigned beneath the Great Yin, their bones piled like mounds—this is the calamity of learning the Dao, where punishment extinguishes the self. Feign madness, feign folly, alter one’s garments, and outwardly embrace filth and grime. Thus does one blend with the world, purify its turbid yin dregs, preserve the vital essence, and profoundly grasp the subtle mysteries. When the qi of the Dao is perfected, transmit it to later disciples according to the proper method. For each person initiated, the master’s qi cultivation is extended by one year. If one disciple in turn initiates another, the master’s merit accumulates for two years. Should two fail to follow this method, the master’s qi cultivation is diminished by three years. When three attain realization, the qi of the Dao is perfected. Transmitting these principles augments the master’s tranquil merit. Should one wish to widely transmit and initiate others, first observe the conduct of the candidate: whether their heart holds compassion, their speech extols the Dao and virtue, whether they honor kin near and far, uphold fidelity and loyalty, embody benevolence, harmony, propriety, and humility, possess wisdom, brilliance, extraordinary insight, and profound vision. Only those who meet these standards may be entrusted with the essential teachings and accepted as disciples. To transmit to those unworthy diminishes the master’s lifespan and forfeits their merit. Those who harbor compassion, reverence for the Dao, and a heart of devotion may share in the company of perfected beings. Should one receive these teachings yet fail to practice them, entangled in worldly affairs, they may present this text beneath the sun and moon, under the clear light of the stars, offering incense, lamps, fresh fruit, fine flowers, and good wine. With sincere prayer, they may say: *\"I have received this wondrous method but have not yet practiced it. I beseech that my master’s qi cultivation not be diminished, and entrust this plea to the scrutiny of the Mysterious Heavens.\"* Thus, the master’s qi cultivation will remain unharmed. Should one neglect this ritual and fail to invoke the stars, unforeseen illness and misfortune may strike. If such afflictions arise and medicine proves ineffective, one must appeal to the Upper Heavens, rectify the qi of the Dao, and resume practice to dispel them, whereupon divine efficacy will manifest. Do not rely on medicine to force a cure, lest one sink into the dark realms. Only the qi of the Dao is trustworthy; how can one rely on ghosts and spirits?\n\nAs for imbalances of hunger and satiety, fatigue and ease, cold and heat, dampness and wind, vomiting from wine, intoxication, sexual excess, prolonged standing or walking, sitting or lying, excessive speech, laughter, sorrow, joy, weeping, or elation—all diminish qi cultivation. These are recorded in various texts, and I shall not repeat them here.\n\nThis text long accompanied the immortal chariot in the celestial palace and was never transmitted to the mortal realm. It was only when Wu Meng and the maiden Cai Luan, who held the register of my drowning in the sea, visited my former immortal abode during the Mid-Autumn festival that they witnessed the spectacle: men and women joining hands, singing in harmonious melodies, entering the marvelous scene. They sang of the divide between immortals and mortals, their voices joyous and clear. Suddenly, they beheld Wenxiao, whose words flowed with unobstructed elegance, swift and keen. The two harbored mutual admiration, their verses intertwining as if bound by past karma. After the song, they lit candles and were led to the immortal dwelling, where the night resounded with the harmony of zither and lute. At dawn, an immortal youth arrived bearing a celestial ledger. Wenxiao inquired, and was told that revealing heavenly secrets had incurred the Jade Emperor’s punishment: she was to be demoted to a mortal wife for twelve years. Fearing Wenxiao might abandon the cultivation of Dao qi, this teaching was bestowed upon her. After twelve years of practice, her Dao qi was perfected, and she ascended to the Mysterious Capital.\n\n**Chapter Eight: Dao Yin Postures**\n\nFor those practicing fetal breathing and qi absorption, Dao Yin is paramount. It loosens the sinews and bones, regulates the blood and vessels, guides qi to its fullest, and allows its presence to be felt after extreme exertion. Rub the hands and feet, assume postures of yielding and grasping, stretch and flex, and let qi circulate freely. All illnesses will dissipate, and ailments will heal. The five viscera and six bowels will harmonize with the spirit, their qi flowing effortlessly, and the Dao qi will be perfected. Direct it to the Niwan Palace atop the head or downward to the Yongquan points beneath the feet. With prolonged practice, natural mastery will follow. The hun and po spirits will flourish, essence and marrow will solidify. Those who practice this method will all become immortals.\n\nThe five viscera have corresponding postures to replenish their primal qi according to the seasons. In spring, summer, autumn, and winter, apply them with focused intent. Even Laozi cultivated the Dao in this manner. How could the multitude of sages not have transmitted these methods in haste? The ancient texts contain many fine passages; here, I present sixteen postures.\n\n**Three Postures to Nourish the Liver (Used in Spring)**\n\n**First Posture:**\nCover the mouth with both hands, gather warmth, saliva, and sweat, then rub the face up and down thirty to fifty times. Perform this after meals to enhance radiance. Alternatively, rub the face vigorously until it grows very hot, imparting a lustrous, unwrinkled complexion. After three years of practice, one’s countenance will resemble a maiden’s, the eyes will brighten, and all chronic ailments will disperse. Guide the qi from the liver through the shoulders and back, drawing forth harmonious primal qi to nourish the liver and replenish the lower elixir field. All Dao Yin methods require holding the breath. First, ensure the blood and vessels flow freely throughout the body, and all illnesses will be cured. Take care not to open the mouth or exhale forcefully. When exerting effort, guard against external pathogenic qi invading the viscera and bowels, lest it invite misfortune. Exercise caution.\n\n**Second Posture:**\nSit upright, interlock the fingers, and exert force. This treats wind in the liver. Press the hands behind the neck, tilt the head back, and gaze upward. Let the neck and hands contend in force to dispel heat toxins, shoulder pain, and blurred vision. If stagnant wind qi accumulates and fails to disperse, the heart’s fire will burn it away. Then, regulate the harmonious qi to nourish the liver, descend it to the sea of qi, and replenish the inner pearl.\n\n**Third Posture:**\nPress one hand over the other, press the thighs, and pull forcefully to the left and right to expel wind toxins from the waist and chest, nourishing the liver and brightening the eyes.\n\n**One Posture to Nourish the Spleen (Used in Late Spring)**\n\n**Fourth Posture:**\nMimic the \"shooting hawk\" stance to the left and right, dispelling stagnation in the chest and diaphragm, and resolving wind qi congestion in the spleen. Apply force while holding the breath, allowing the internal qi to disperse.\n\n**Three Postures to Nourish the Heart (Used in Summer)**\n\n**Fifth Posture:**\nSit upright with legs extended, lean the body diagonally, and exert force as if pushing a mountain, using all strength to dispel wind-cold from the waist and spine, freeing the five viscera and six bowels, dispersing leg qi. Perform equally on both sides to nourish the heart and sharpen the mind.\n\n**Sixth Posture:**\nPress one hand against the thigh while the other reaches upward with all force, as if lifting a stone, to expel wind toxins from between the ribs and regulate the heart. Harmonize the blood vessels. Perform equally on both sides while holding the breath. Follow this method throughout the twelfth month. Practice this immediately after the first posture.\n\n**Seventh Posture:**\nRegularly clasp the hands together and thrust them forward to stretch the arms and wrists, purging the heart of wind-fatigue and freeing the joints. Perform equally on both sides, adhering to the spring method.\n\n**One Posture to Nourish the Spleen (Used in Late Summer)**\n\n**Eighth Posture:**\nSit upright with legs extended, stretch the fingers upward, then pull them back sharply three times, followed by forward bending to dispel numbness from the waist, spine, legs, and knees, and disperse bladder qi. Perform equally forward and backward. Begin this practice after the fourteenth day of the sixth month.\n\n**Three Postures to Nourish the Lungs (Used in Autumn)**\n\n**Ninth Posture:**\nClasp the hands behind the head and neck, turning and rotating the body with gentle bows, to dispel wind qi from between the ribs, chest, sinews, and back, freeing the lungs of all ailments. Perform equally on both sides of the neck, following the first-month method.\n\n**Tenth Posture:**\nInterlace the fingers above the head and stretch forcefully to the left and right ten times, dispelling wind qi from the joints and regulating the lungs of all ailments.\n\n**Eleventh Posture:**\nClench the fists and strike the shins ten times or more to open the chest and diaphragm, expel facial qi, and regulate the lungs of all ailments. Perform while holding the breath, as in the first month. Follow this by tapping the teeth together thirty-six times.\n\n**One Posture to Nourish the Spleen (Used in Late Autumn)**\n\n**Twelfth Posture:**\nBegin this practice after the twelfth day of the ninth month to nourish the spleen. Interlace the fingers above the head and exert force against them. Perform equally on both sides to regulate the spleen and limbs, dispel stagnant wind qi and diaphragm qi from beneath the ribs, and stimulate the appetite. Perform while holding the breath.\n\n**Three Postures to Nourish the Kidneys (Used in Winter)**\n\n**Thirteenth Posture:**\nInterlace the fingers and press one foot upon them to relieve tension in the waist and legs, kidney qi ailments, cold numbness, wind toxins in the hands and feet, and knee pain.\n\n**Fourteenth Posture:**\nSit upright with legs extended, stretch the fingers, and gently pull the toes to treat leg numbness, wind-dampness, kidney toxins, and pain from long journeys. This posture is most excellent for regular practice.\n\n**Fifteenth Posture:**\nPress one hand against the knee while the other clasps the head, bending forward, backward, and to the sides to dispel wind from the bones and joints, free the blood vessels, bladder, and kidney qi, and regulate the kidneys of all ailments.\n\n**One Posture to Nourish the Spleen (Used in Late Winter)**\n\n**Sixteenth Posture:**\nRaise both hands upward with all force three times to regulate the spleen of all ailments. Follow the spring method.\n\nThe preceding sixteen postures are most effective when performed while holding the breath. After the dissemination of this *Dao-yin* method, a thousand years later, a Daoist master greatly propagated the Dao’s qi through the five tones—*gong*, *shang*, *jue*, *zhi*, and *yu*—and many scholars gathered, numbering eight hundred. After the second refinement, within the four *yuan*, they ascended in succession. The first refinement took five hundred years, the second a thousand. The common world reckons twelve years as one cycle, while the Dao counts twelve years as one *ji*, sixty years as one *yuan*, and two hundred forty years as four *yuan*. Thus does the Dao endure in the world.\n\n*Ling Jian Zi* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "灵剑子 经名：灵剑子。 原题放阳许真君述。 一卷。 底本出处：《正统道藏》洞玄部众术类。 灵剑子 序第一 夫欲学道长生，服气为先。 处俗求利名，名彰则利盈，名成则利生，气成则延龄。 是君子之抱命，岂小人之矜智。 及文武俱备，可为佐国之忠臣。 精气双全，乃是真仙之子。 夫子称予不知道本根由，乃问老子，方知道之是气，形神不足，虚受辛勤。 心愿若偏，终无所得，心正则神调，神调则道气足矣。 学问第二 凡守妙道，皆异形仪，非可造次求之，无不夙绿积德，尽有出世之相。 或学问而举动轻狂，或坚贞而一志淳直。 不以眉出长毫、眼瞳倒侧、耳目赤白，异於面额。 齿三十六至四十二，当腹黑子，舌里通长，手垂过膝，耳与项齐，脚掌文通至根，手文川字相离。 或额有乾坤之文，或胸文吉字、容仪丰丽。 或毁污身衣，或在众人之内，蕴洁固之心，迹浑尘泥，垢腻不洗，日月灯前而无影。 常行德惠於人，食速粪迟，尿珠毛孔。 口方而项峰如角，日月之状，或如麒麟龙虎之角，玉枕通犀而棱利。 如此之人，亦易成道。 志士贞信不退，尽获超升，皆出世之真人，亦乃功成而拔宅冲天。 智量高深，轻财重法，不尔官班仙府，虽无神通变异，终怀德而崇深，只候阴德功成，尽皆得道之俦矣。 如无此相，虚役迷心，纵能饮冰食栢之勤，终沉下鬼。 余又寻诸子，实痛於心，若伸之悟人，不退志行，有此相者，则易成仙道，亦数世於道中有大利益。 方志心慕道，深有希生之意，急於玄牝当修者，皆於道门广行施惠，有此异相功成者，皆积世勤心，至此生而得度矣。 今生乐道修生切者，是积修之庆也。 服气第三 形之所依者，气也。 气之所因者，形也。 形气因依而成身体，魂魄跧而往来，降注为神，而生五藏焉。 气之为母，血之为子。 血之为母，精之为子。 精之为母，神之为子。 神之为母，形之为子，未有无气而自成形者也。 气因形有，乃魂魄偕之。 神者，气之母也。 胎息者，想婴儿而成焉，而号冲和，冲和则元和矣。 出入呼吸之间，三元之内，毛发之中，无不通透。 皆了心君意臣，调制节之。 无为事心，主安之。 有虑有思，便失自然之理。 心者，猛狞之猿火，巳午属之。 肾者，阴女之容仪，亥子窈窕之元根，故青龙白虎一飞一伏之能气。 日心之火为云津，月湿之水为云雨，相随北坎，而行归子亥肾海气宫。 向巳心之气，上通泥丸宫，下补八尸百关，毛发悉能应彻，故无碍元和理疗千疗万病。 心君发火，亘天地无有不焚，明然百谷五味，久行自渐稀之。 初可三十六咽，一乾一湿，存心中之气，以意送之，归脐下气海之中，夹之日月。 左肾为日，右肾为月，此乃两畔同升合为一。 即先存思右肾为月，白气入气海中，从脊右边，上至顶泥丸宫，眉间入三寸是也。 却存历洞房宫； 又历明堂宫，守寸双田下，历十二重楼，历绛宫，入气海金室，日月照两畔。 又存左肾为日，黄气从脊左边骨缝上，直入泥丸宫存，出历洞房宫、明堂宫，守寸双田下，历十二重楼，历绛宫，入气海中心，日月左右照。 又存白气为裹，黄气为表，团圆为珠尔。 外黄内白，悬在气海之中，黄光灿烂，圆如弹丸，黄如橘，久久行之光斗日月，此",
      "translated_text": "**The Scripture of the Numinous Sword**\n\n**Title:** *Lingjianzi* (*The Master of the Numinous Sword*). Originally attributed to Lord Xu of Fangyang. One scroll. Base text from the *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, *Zhongshu* Category.\n\n---\n\n### **Preface (First Chapter)**\nThose who seek the Dao and long life must first practice *qi*-absorption. Those who dwell in the worldly and pursue fame and profit—when fame is established, profit flourishes; when *qi* is cultivated, longevity extends. This is the noble man’s embrace of destiny, not the petty man’s vaunting of cunning.\n\nWhen both civil and martial virtues are complete, one may become a loyal minister aiding the state. When essence and *qi* are both perfected, one becomes a true immortal’s heir.\n\nThe Master once said he did not know the root and origin of the Dao, so he asked Laozi and learned that the Dao is *qi*. If form and spirit are insufficient, one labors in vain. If the heart’s intent is biased, nothing will be attained. When the heart is upright, the spirit harmonizes; when the spirit harmonizes, the Dao’s *qi* is full.\n\n---\n\n### **Learning and Inquiry (Second Chapter)**\nAll who guard the wondrous Dao possess extraordinary forms, for it cannot be sought in haste. Without lifelong accumulation of virtue, one will not bear the marks of transcendence.\n\nSome, though learned, act with reckless frivolity; others, though steadfast, remain pure and sincere. Do not judge by long eyebrows, inverted pupils, or red-and-white eyes differing from the face. Those with thirty-six to forty-two teeth, a black mole on the abdomen, a long tongue, hands that hang past the knees, ears level with the neck, or soles inscribed with lines reaching the heel—these bear the signs. Some have the *qian* and *kun* trigrams on their foreheads, or auspicious characters on their chests, with dignified and radiant bearing. Others, though their bodies and clothes are filthy, harbor purity within, their traces mingling with dust and grime. They cast no shadow before the sun, moon, or lamp.\n\nThey constantly bestow kindness upon others, digest food swiftly but excrete slowly, and their urine forms pearls from their pores. Their mouths are square, their necks angular like horns, or resembling the sun, moon, qilin, dragon, or tiger. Their jade pillows are sharp as rhinoceros horn. Such people easily attain the Dao.\n\nThe steadfast and truthful, who never retreat, all achieve transcendence—these are the true immortals of the world, their merit complete as they ascend with their dwellings into the heavens. Those of profound wisdom, who scorn wealth and revere the Dao, though lacking supernatural transformations, will ultimately be honored for their deep virtue. They await only the completion of their hidden merits to join the company of the enlightened.\n\nWithout these signs, one’s efforts are in vain, the mind deluded. Even with the diligence of drinking ice and eating cypress, they will sink among the lower ghosts.\n\nI have sought among the various masters, and my heart aches for them. If I can awaken others, so they do not waver in their resolve, those with these signs will easily attain immortality, having reaped great benefits from the Dao over many lifetimes.\n\nThose who now ardently yearn for the Dao and urgently seek the Mysterious Female (*xuanpin*) must widely practice kindness within the Daoist gate. Those who achieve these extraordinary signs and merits have cultivated diligently over lifetimes, and in this life, they attain liberation.\n\nThose who delight in the Dao and earnestly cultivate life in this life are blessed by their accumulated practice.\n\n---\n\n### **Qi-Absorption (Third Chapter)**\nThe body depends on *qi*; *qi* arises from the body. Body and *qi* interdepend to form the physical self. The *hun* and *po* souls move within, descending and infusing to become spirit, giving rise to the five viscera.\n\n*Qi* is the mother of blood; blood is the mother of essence; essence is the mother of spirit; spirit is the mother of form. There has never been a form that took shape without *qi*. *Qi* exists because of form, and the *hun* and *po* accompany it.\n\nSpirit is the mother of *qi*. Embryonic breathing (*taixi*) is achieved by imagining an infant, thus attaining harmony. Harmony becomes primordial harmony (*yuanhe*). In the intervals of exhalation and inhalation, within the Three Primes (*sanyuan*) and even the hair’s pores, all is pervaded and permeated.\n\nAll is governed by the heart-monarch and the intent-minister, who regulate and restrain. Without engaging the heart in affairs, the ruler remains at peace. Anxiety and thought disrupt the principle of spontaneity.\n\nThe heart is the fierce fire of the ape, belonging to *si* and *wu*. The kidneys are the demeanor of the yin woman, the graceful root of *hai* and *zi*, where the Azure Dragon and White Tiger soar and crouch in their *qi*-generating power.\n\nThe heart’s fire becomes cloudy mist; the moon’s moisture becomes cloudy rain. Following the northern *kan*, they return to the *qi*-palace of the kidneys in *zi* and *hai*. The heart’s *qi* in *si* ascends to the Muddy Pellet Palace (*niwan gong*), descending to nourish the eight corpses and hundred joints. Even the hair responds completely, for there is no obstruction to the principle of primordial harmony, which cures a thousand illnesses and myriad diseases.\n\nWhen the heart-monarch emits fire, it burns all under heaven without exception. Clearly, the five grains and five flavors, when practiced long, naturally diminish.\n\nInitially, one may swallow thirty-six times, alternating dry and moist. Concentrate the heart’s *qi* and send it with intent to the *qi*-sea below the navel, flanked by the sun and moon. The left kidney is the sun; the right kidney is the moon. These two sides ascend together to merge as one.\n\nFirst, visualize the right kidney as the moon, its white *qi* entering the *qi*-sea. From the right side of the spine, it rises to the Muddy Pellet Palace at the crown—three inches within the space between the eyebrows. Then, pass through the Cavern Chamber Palace (*dongfang gong*), proceed through the Hall of Light Palace (*mingtang gong*), and guard the inch-wide double field below. Traverse the Twelve-Storied Tower (*shi’er chonglou*), pass through the Crimson Palace (*jiang gong*), and enter the golden chamber of the *qi*-sea, where the sun and moon illuminate both sides.\n\nNext, visualize the left kidney as the sun, its yellow *qi* ascending along the left side of the spine through the bone seams, directly entering the Muddy Pellet Palace. Proceed through the Cavern Chamber Palace, the Hall of Light Palace, guard the inch-wide double field below, traverse the Twelve-Storied Tower, pass through the Crimson Palace, and enter the center of the *qi*-sea, where the sun and moon shine on both sides.\n\nThen, visualize the white *qi* as the core and the yellow *qi* as the outer layer, forming a round pearl. Yellow outside, white inside, it hangs in the *qi*-sea, radiant as an orange, round as a pellet. With long practice, its light rivals the sun and moon...",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1232,
      "start_sentence": 0,
      "end_sentence": 57,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.00502562522888,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\灵剑子.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "为玄珠尔，玄牝子肾宫尔，珠则珠尔。 亦曰两物合成一体，一阴一阳而成，俱黄者为表，黄表却白裹尔。 赤水则血尔，玄珠若成，津血自盈。 若欲知验，苦酒和精露，一宿却还血尔。 九年行之，筋骨变换，轻举通神为地仙。 未可修大药，先须气成，凭气补形精，大药方始灵。 初服气之士，未可便思玄珠，但且三年淡食，未可便绝粮，色欲须顿绝，不尔，反夭身命。 五更三十六咽，津气相连，渐渐少食，所食淡食去盐醋冷热之物，日中饱餐，旦暮少食，三年旦暮行之，渐觉淡食有味，不可便顿绝粮，极有所损尔。 如觉有味，不思俗味，则五藏坚实，如若五藏衰弱，以药补充盛壮也，故淡食诸物有味也。 如此后，可日渐灭五味五谷，三日淡食粥、菜汁、胡麻叶茎、枸杞、黄精、枣之类，将助之，方可绝粒。 亦当自饱无饥渴，忽闻谷气蒸煮之气触修服，食之气久久，亦自知自不欲食。 经三日或七日，饥困，更以淡面叶子餔饦放冷食之。 如遇饥渴，想中心内气，不以早晚，但依前法服之，当能代食能饱，一如餐物。 了来如要餐物，亦得则可芋头、薯药、何首乌之类，茶少食，若入盐，立便饥矣。 五味为五贼，又为五毒，盐、醋、水、豉、辛物。 是时，以好酒及椒黄丸、糯米、生椒食之。 糯能吁荣胃气，椒能引气归下元，淡煮糟芋、冬瓜、薯药、薤羹，亦得切须放冷食之。 酒能助气，酒糟作羹，尽能引元气易成，酒后气当易通。 美酒不须多，及醉吐则有所损矣。 时复一杯，止饥代食，酒能涛荡阴滓，得道之人无不好於酒也。 酒能炼真养气，不须服人参汤，人参汤能开胃，故易饥也。 狭苓、枣子甚益，瓜桃助气，橘亦得不须，吃皮便饥也。 大栗、桃子、鸡头莲藕亦得菱，少食，冷能动气。 若经时，当精神聿壮，夜自不困，眼中神光时出如电，渐夜黑见物如此之兆，急守闭精髓，道欲成也，而有此矣。 乃天发地应，尔不能急守，乱起奸淫，死之致也。 神光魂神彰出时，则神欲离散於身形，神光去也，亦乃出之。 · 故急守精闭室制伏，则是神光见，阳魂盛，阴滓欲尽之状。 如不能急守，徒忍饥绝味，非入神仙之格尔。 如未能便断嗜欲，则须房中将息节服之，则施而不泄不泻，精髓一出，永为涕泻，如此则非上真之士，浑浊精漏之夫。 房中之事，稍难擒制，皆返神退智。 须假俗味，方度朝昏，肉面助之，不尔，立沈下鬼。 如房中得擒制之理，深达洞微，乃知究竟。 及遇少女，采玩精气，咽而服之，可谓如虎戴角、文武全备，此皆福德之人所行，而非常流之见矣。 夫精失位，似海竭山崩，百渎失绪，千域倾败，莫能救洽，百病俱臻，业鬼相亲。 再修难成，千中无一。 如修前气灰心绝，想百病不侵，瘟瘴疫毒莫能为患。 若脑中髓耗，瘟疫从顶而入。 若脑实精充，鬼神莫能为害。 凡有诸疾早起，但调气辟之，以气通之，逼逐五藏六府，百关毛发中出觉热汗如胶，则是效矣。 未退，依前调气，存身上内外百神，咽闭。 或於帐中衣被裹伏，遂为之服气应。 有是风、是气、是瘴、是劳、是毒诸疾，皆用前法驱逐之，从筋骨髓中而出矣，千万药功皆不及矣。 二百二病，是热为风，二百二病，是冷为气，悉能疗之，故曰四百四病也。",
      "translated_text": "Here is the translation:\n\n---\n\nThis is the Mysterious Pearl, the Mysterious Female within the Kidney Palace—thus is the pearl. It is also called the union of two things into one, formed by one yin and one yang. Both are yellow on the outside, with the yellow as the outer layer and the white as the core.\n\nThe Crimson Waters are the blood. When the Mysterious Pearl is formed, the fluids and blood naturally fill. If you wish to verify this, mix bitter wine with the essence-dew; after one night, it will return to blood. After nine years of practice, the sinews and bones transform, and one becomes light enough to ascend as an earthly immortal.\n\nBefore refining the great elixir, one must first complete the cultivation of *qi*, relying on *qi* to replenish the body’s essence. Only then will the great elixir begin to take effect. Beginners in *qi*-absorption must not immediately seek the Mysterious Pearl. First, for three years, eat bland foods—do not yet cut off grains entirely. Lustful desires must be completely severed; otherwise, one will instead shorten one’s lifespan.\n\nAt the fifth watch, swallow thirty-six mouthfuls, linking the fluids and *qi*. Gradually reduce food intake, eating only bland foods and avoiding salt, vinegar, and extremes of cold or heat. Eat a full meal at midday, but little in the morning and evening. After three years of this morning and evening practice, one will gradually find bland foods flavorful. Do not abruptly cut off grains entirely, for this will cause great harm.\n\nWhen bland foods begin to taste good and worldly flavors are no longer craved, the five viscera will become firm and strong. If the five viscera are weak, use medicines to replenish and strengthen them—this is why bland foods become flavorful. After this, one may gradually eliminate the five flavors and five grains. For three days, eat bland congee, vegetable broth, sesame leaves and stems, wolfberry, Solomon’s seal, jujubes, and the like to aid the process, before finally cutting off grains. One should feel naturally satiated, without hunger or thirst. If suddenly exposed to the steam and scent of cooked grains, after long practice, one will naturally know to avoid them.\n\nAfter three or seven days of hunger and fatigue, eat cold bland noodles or leaf-wrapped dumplings. When hunger or thirst arises, visualize the *qi* within the center, and at any time—morning or evening—swallow it according to the previous method. This will substitute for food and bring satiety, just like eating. If one later wishes to eat, taro, yams, or *Polygonatum* may be consumed, along with a little tea. But if salt is added, hunger will immediately return.\n\nThe five flavors are the five thieves, also called the five poisons: salt, vinegar, water, fermented beans, and pungent foods. At this stage, one may consume fine wine, pepper-yellow pills, glutinous rice, and raw pepper. Glutinous rice nourishes the stomach’s *qi*, while pepper guides *qi* back to the lower origin. Blandly cooked fermented grains, taro, winter melon, yams, and scallion broth may also be eaten, but all must be cooled before consumption. Wine aids *qi*, and fermented grain broths help guide the original *qi* to completion more easily. After drinking, *qi* flows more smoothly. One need not drink much—vomiting from drunkenness will cause harm. An occasional cup will stave off hunger and substitute for food. Wine washes away yin impurities, and those who attain the Dao never dislike it. Wine refines the true and nourishes *qi*; one need not drink ginseng broth, for it stimulates the appetite and thus causes hunger.\n\nWolfberry and jujubes are highly beneficial. Melons and peaches aid *qi*, and oranges may be eaten, but avoid their peels, as they induce hunger. Chestnuts, peaches, fox nuts, lotus roots, and water caltrops may also be consumed in moderation, but cold foods can disrupt *qi*.\n\nWith time, the spirit and essence will flourish. One will no longer feel weary at night, and the eyes will emit divine light like lightning. In darkness, one will see as if in daylight—these are the signs. One must urgently guard and seal the essence and marrow, for the Dao is about to be achieved. If, at this moment, one fails to guard it and instead indulges in lust, death will follow.\n\nWhen the divine light and spirit manifest, the spirit is about to scatter from the body. If the light departs, so too will the spirit. Therefore, one must urgently guard the essence, seclude oneself, and subdue the impulses. This is the sign of the divine light appearing, the yang spirit flourishing, and the yin impurities nearing exhaustion. If one cannot urgently guard it and merely endures hunger and abstains from flavors, one does not enter the rank of divine immortals.\n\nIf one cannot yet sever desires, one must regulate and moderate bedroom activities, practicing emission without leakage. Once essence and marrow are lost, they become permanent tears and leaks. Such a person is not a true adept but a muddled, essence-leaking fool.\n\nBedroom matters are difficult to control and often reverse spiritual progress and wisdom. One must rely on worldly flavors to pass the days, using meat and grains to sustain oneself; otherwise, one will swiftly sink into the realm of ghosts. If one masters the principles of control in the bedroom and deeply understands its subtleties, one will grasp the ultimate truth. When encountering a young maiden, one may absorb and refine her essence, swallowing it. This is like a tiger growing horns—both civil and martial virtues are complete. Such practices are reserved for those of great fortune and virtue, not for ordinary people.\n\nWhen essence loses its proper place, it is like the sea drying up and mountains collapsing—hundreds of streams lose their course, and a thousand lands fall into ruin. No remedy can restore it. A hundred illnesses converge, and karmic ghosts draw near. To re-cultivate after such loss is nearly impossible; not one in a thousand succeeds.\n\nIf one cultivates the previous *qi* practices with a calm heart and severs desires, one will imagine that no illness can invade, and plagues or pestilential toxins cannot harm. If the brain’s marrow is depleted, pestilence will enter from the crown. If the brain is full and essence abundant, ghosts and spirits cannot cause harm.\n\nFor any illness, rise early and regulate the *qi* to dispel it. Circulate the *qi* to penetrate the five viscera and six bowels, expelling it through the hundred joints and hair follicles until one feels a sticky sweat like glue—this is the sign of efficacy. If the illness does not recede, continue regulating the *qi*, visualizing the hundred spirits within and outside the body, swallowing and sealing. One may also lie wrapped in bedding within a canopy, practicing *qi*-absorption as before.\n\nFor wind, *qi*, miasma, consumption, poison, or any illness, use the previous method to drive it out from the sinews, bones, and marrow. The efficacy of this surpasses that of ten thousand medicines. Of the 202 illnesses, those caused by heat are called wind, and those caused by cold are called *qi*. This method can cure them all—hence the saying, \"the four hundred and four illnesses.\"\n\n---",
      "overlap_context": " Cavern Chamber Palace, the Hall of Light Palace, guard the inch-wide double field below, traverse the Twelve-Storied Tower, pass through the Crimson Palace, and enter the center of the *qi*-sea, where the sun and moon shine on both sides.\n\nThen, visualize the white *qi* as the core and the yellow *qi* as the outer layer, forming a round pearl. Yellow outside, white inside, it hangs in the *qi*-sea, radiant as an orange, round as a pellet. With long practice, its light rivals the sun and moon...",
      "start_char": 1232,
      "end_char": 2445,
      "start_sentence": 58,
      "end_sentence": 100,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.38573718070984,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\灵剑子.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "《黄庭经》云：仙人道士非有神、积精累气结成真，非大药能先成也。 自古得道之人，竺乾风后，七元三老，皆从气中而全真，非先大药之能。 诸得道神仙、圣贤、上士，初成道皆从气也，别无径路可超出三界之外。 飞云走雾，神变通灵，遨游日月之上阳界之中，观行三岛十洲水府阴山之境洞，跨鹤乘龙上鱼皆浮龟行，蜂饭掷杯透壁种花飞符入柱，皆是气之因依。 而一日一夜，一万三千五百通息出入气皖，二万七千气一神一气，皆能指用。 是故气成之后，变寒暄於呼吸之间，视六合於毫芒之内，海水用气吹之可以逆流千里，皆从凡入神也。 初服气之士，静去於鼻中毫，鼻中能通彻五藏六腑，出入气息之沟也。 微微鼻吸，清气咽之，口吐浊气； 微微出之。 凡诸热疾，大开口呵之为泻，不必六气也。 有疾冷，即吹以补之，则调理上焦之疾，往来微，自求安之道也。 二段者，上元一段，从心中元并下元为一段，号曰二段。 上段理上焦诸疾用之，下段服气心中之内气。 凡服气调咽用内气，号曰内丹。 心中意气，存之绵绵，不得用上段外气引，外风损人五藏，故曰两段分理之者。 不能分之两段，玄珠赤水莫能知之。 凡服气，曾服者有师，则气熟易行，不曾服者无师，则炁生难服之。 久久能行之，犯了自诀之，亦乃自知矣。 道海喻第四 道海者，如大海茫洋之阔，深溺不异风涛。 如不曾自往，经游涉历睑阻，忧危之内岂得知之？ 但闻众庶惑之， 而莫能采摘，求奇无过，自涉鲸波尽知尔。 喻曾游幽青滑魏之州后，而更游则关津、渡镇、乡坊、观院、道舍、灵坛、神庙、洞府，名山，皆能知之，直径而行，必无阻滞，意往便往，得达彼中。 谓曾游，谙知熟尔，故曰易也。 服内气之人，亦乃如然，不曾自涉经游者，意欲往之，岂得直到彼中，又无人指引， 终乃辛勤能究问而求之，心坚不退，亦达彼处，则辛勤而迟矣。 仙洞幽深，或退坚心宜之，信智迷而不曾游尔，不行径路，故修奉之难矣。 气委若熟，放任撝谦赐福，或连年休绝，或一日三餐，或食或不食，或三日一餐，或时一日一粥，如斯饥渴，得之擒制，五藏安和则是气成熟尔。 草石等药，及符水、紫芝、南烛、黄精、白荆、松脂、仄栢、茯苓、苍木、白木、枸杞、何首乌、金樱、鸡头、蜡、腻粉、朱砂、乳香、皂角子、黑豆、白胶香，并宜服之。 道气虽然服药，不服冲和之气，开食休绝，腹肠枯竭，血脉乾焦，比望於长生自由，不如独服元气，开绝自在，见食而食，要休即休，可谓气之成焉。 气若功成，筋骨和柔，百关调畅，胎津日盛，血脉壮强，手脚盘顶，上成物丸，随意努气，出如球子。 或纯筋而无骨，精实血充，故如之尔，发毛俱换。 岂不闻《道德经》云：天下莫能知莫能行。 至於夫子伯夷叔齐比干屈原之士，尚不能知之，若为庶俗萦迫，实难知之尔。 痛哉，但纵贪奢色欲，及至衰败，齿焦发白，自相承老耄，甘散形魂，而埋荒跧土。 又作婴儿牛马猜羊之属，鸡犬鱼虫之类，自苦形魂。 其业力大者，身漂流浪，爱河冤业。 力小者，身作蚊蛆之属。 大道之力，而不能及也，不知此理多也。 岂知其道若大海，接应力成山川，鱼龙虬蜃，皆能兴云布雨，猛勇惊人。",
      "translated_text": "The *Scripture of the Yellow Court* states: Immortals and Daoist adepts are not divine by nature—they accumulate essence and amass *qi* to congeal the True. They do not first rely on great medicines to achieve this. Since ancient times, those who attained the Dao—such as the sages of Jambudvīpa and the Wind Sovereign, the Seven Primes and the Three Elders—all preserved their True Nature through *qi*, not by first relying on great medicines.\n\nAll those who attained the Dao—divine immortals, sages, and superior adepts—initially achieved realization through *qi*. There is no other path to transcend the Three Realms. Soaring through clouds and mist, their spirits transform and penetrate, roaming above the sun and moon within the Yang realms, observing the Three Isles and Ten Continents, the water palaces and the caverns of Mount Yin. They ride cranes and mount dragons, float upon fish and stride upon turtles, feast on bees and cast cups through walls, plant flowers that take root in pillars, and dispatch talismans into beams—all through the agency of *qi*.\n\nIn a single day and night, there are thirteen thousand five hundred cycles of breath, with *qi* entering and exiting. Twenty-seven thousand *qi* correspond to one spirit, and each can be directed at will. Thus, once *qi* is mastered, one transforms cold and heat within a single breath, perceives the Six Directions within a hair’s breadth, and can blow against the sea’s waters to reverse their flow for a thousand *li*—all by ascending from the mundane to the divine.\n\nFor those beginning to practice *qi*-absorption, first still the hairs within the nostrils, for the nostrils are the passageways that thoroughly connect the five viscera and six bowels, the channels of breath’s ingress and egress. Gently inhale through the nose, swallowing the pure *qi*, and exhale the turbid *qi* through the mouth—ever so softly. For all heat-induced illnesses, open the mouth wide and exhale with a *he* to purge; the Six Breaths need not be employed. For cold-induced illnesses, exhale with a *chui* to supplement, thereby regulating the upper burner’s afflictions. The *qi* should flow subtly, allowing the body to seek its own harmony.\n\nThere are two stages: the upper stage, from the heart’s primordial *qi*, and the lower stage, from the lower elixir field, together forming the \"two stages.\" The upper stage governs the regulation of illnesses in the upper burner, while the lower stage involves absorbing the *qi* within the heart. When practicing *qi*-absorption and regulation through swallowing, use the internal *qi*—this is called the Inner Elixir. The *qi* of the heart’s intent should be maintained continuously, without drawing upon the external *qi* of the upper stage, for external wind harms the five viscera. Thus, the two stages are divided for regulation. Without this division, the Mystic Pearl and the Crimson Waters remain unknowable.\n\nFor those who have practiced *qi*-absorption under a master, the *qi* becomes familiar and flows easily. For those without a master, the *qi* is raw and difficult to absorb. With prolonged practice, even those who violate the precepts will come to understand through self-realization.\n\n**Fourth Parable: The Dao as an Ocean**\nThe Dao is like the vast and boundless sea, its depths no different from its storm-tossed waves. Without having ventured forth oneself, traversed its perils, and endured its dangers, how can one truly know it? The common folk hear of it and are bewildered, unable to grasp its wonders, seeking the extraordinary in vain. Only by plunging into its whale-waves can one come to know it fully.\n\nThis is like one who has journeyed through the secluded and perilous states of You, Qing, Hua, and Wei, and then travels again—passing through customs barriers, ferries, villages, monasteries, Daoist abodes, sacred altars, spirit temples, grotto-heavens, and famous mountains—knowing them all intimately. One proceeds directly without obstruction, arriving wherever the will directs. This is called \"having journeyed before,\" for familiarity makes it easy.\n\nThose who practice internal *qi*-absorption are likewise. Without having traversed the path themselves, if they wish to reach the destination, how can they arrive without guidance? Even with no one to point the way, through diligent inquiry and unwavering resolve, they too will reach the destination—though with greater toil and delay. The immortal caverns are profound and secluded; only with steadfast resolve can one enter. Those who waver in faith and wisdom, never having journeyed, do not follow the direct path—thus the difficulty of cultivation.\n\nWhen the *qi* is fully matured, one may freely bestow blessings with humility, or abstain from food for years, or eat thrice daily, or fast entirely, or take one meal every three days, or subsist on a single daily congee. Through such hunger and thirst, the five viscera are tamed and harmonized—this is the sign of *qi*’s maturity.\n\nHerbs and minerals—such as talismanic water, purple ganoderma, southern bamboo, Solomon’s seal, white vitex, pine resin, cypress, poria, atractylodes, white atractylodes, wolfberry, *he shou wu*, golden cherry, fox nut, wax, calomel, cinnabar, frankincense, gleditsia seeds, black soybeans, and white storax—are all suitable for consumption.\n\nThough one may ingest these medicines, without absorbing the harmonious primordial *qi*, fasting and abstinence will wither the intestines, parch the blood vessels, and dry the meridians. Hoping for spontaneous longevity is futile; it is better to rely solely on the primordial *qi*, freely abstaining or eating as one wishes. This is the fruition of *qi*.\n\nWhen the *qi*’s work is complete, the sinews and bones become supple, the hundred joints flow smoothly, the fetal fluid daily increases, the blood vessels grow robust, and the hands and feet can coil atop the head. One can form a pellet with a single exhalation, expelling it like a ball. Some become purely sinew without bone, their essence solid and blood abundant—thus it is. Hair and body hair are entirely renewed.\n\nHave you not heard the *Daodejing* say: \"None in the world can know or practice it\"? Even sages like Confucius, Boyi, Shuqi, Bigan, and Qu Yuan could not comprehend it—how much less the common folk, entangled in worldly affairs? Truly, it is difficult to know.\n\nAlas! Indulging in greed, extravagance, and lust, one declines into decay—teeth wither, hair whitens, and old age overtakes them. They willingly scatter their form and soul, burying themselves in desolate earth. Reborn as infants, oxen, horses, pigs, sheep, chickens, dogs, fish, or insects, they torment their own form and soul. Those with greater karmic force drift through the currents of love and enmity, while those with lesser force become mosquitoes or maggots. The power of the Great Dao eludes them, for they know not this principle.\n\nHow could they know that the Dao is like the ocean, its responsive power shaping mountains and rivers? Fish, dragons, and serpents all stir clouds and spread rain, their might astonishing.",
      "overlap_context": "g and sealing. One may also lie wrapped in bedding within a canopy, practicing *qi*-absorption as before.\n\nFor wind, *qi*, miasma, consumption, poison, or any illness, use the previous method to drive it out from the sinews, bones, and marrow. The efficacy of this surpasses that of ten thousand medicines. Of the 202 illnesses, those caused by heat are called wind, and those caused by cold are called *qi*. This method can cure them all—hence the saying, \"the four hundred and four illnesses.\"\n\n---",
      "start_char": 2445,
      "end_char": 3666,
      "start_sentence": 101,
      "end_sentence": 140,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.65197944641113,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\灵剑子.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "故大道抱微贯细，若海幽深，莫能采觅。 故《阴符经》谓之：天发杀机，万物果草、虫鱼、蚊蛆、蝼蚁之属，皆含道气。 道在其中，如鱼在水，鱼不知水之养其形，道在人中，如风之莫能见其形也。 故《黄庭经》云：象龟引气到灵根。 此谓龟之得气，长年不死矣。 蛇冬藏含石而不食，乃石化为蛇黄，得气之效。 凤鹤得气之妙，游飞仙洞三岛十洲，大仙乘跨，此乃凤鹤得气之妙。 蚌含秋月光而成珠，猕猴学禅入定，白鹿善能伸舒关节，永寿九千年。 唯人不知导引成仙矣。 鳖冬服气沙中，辉鱼跧於乾土之中，鲢鱼食其水沬，鲤鱼能化龙兴云布雨。 人之处世，不修道法，於身外求生，岂得再获人身？ 痛哉悲哉，故经曰：若存若亡。 道存则成之，亡则失之，故知人失道者亡，鱼失水者死。 嗟吁，世人入山求道，如上树求鱼。 远涉而寻师，如旱天求雨。 故《阴符经》云：三返昼夜用师万倍矣。 万物能盗人，人能盗万物，但虚心实腹，道炁自来，布德施功，甘泽时降矣。 道之贼也，凡食五谷地之所生者，精气是土，终久害人，人遭土埋。 有食太和阴阳气之士，不食有限之物，永既在天厨。 故天不能杀，地不能埋，我命在我，不在天地尔。 故金母言：三关已定生死。 何来道气喻於蟾影？ 家家光彩洁明，至於拔宅冲天，人人尽怀道气。 津生满口咽而服，是为之琼液，此乃仙人之粮矣。 一年修之藏腑全，二年修之病身痊，三年修之血脉坚，四年修之筋骨迁，五年修之眼目皎然，六年修之命永延，七年修之骨髓如绵，八年修之作地仙，九年修之发黑玄。 九年修之后，时轻举百十丈高，时往游诸名山洞府，无滞无碍，兵马不能害，水火不能灾，鬼神不能挠，龙自降虎自伏，神通自在，号曰真人。 更修上升之法，咏洞讲玄，高奔阳界偃息，优游日月之上，号曰天仙。 或管主仙洞，或掌领仙籍，或主张修道之士名历，以次推迁，还如人间官职，各有主执。 如不修上升之法术，遁隐洞府，长作地仙矣，修习功果成焉。 凡修学之人，须假阴惊，助之三千，善功修满，玉帝自然诏上玄都受职尔。 若不修阴功，名不得上升玄都，虽录修学道之名，且无阴骘之簿，上命无功而不召迁。 故修上法，阴骘为先，方度他人而自身功全。 自古得道，皆复如然。 道以信为合，德以智为先。 吾道若海，谓之道海，不信不修，吾亦尽言。 智浅德薄，勿轻泄传，然及先祖谴累连延入，格之侣肘，步师前授，以金宝质，盟十天清斋，沐浴叩头，拜受方始授焉。 愚者，萃财千万，收御百般草石之药，少有治病之能，且无延命之效。 若学神仙，须凭气术，存左牙为金钟，右牙为玉磬，上下当门齿为玉版。 又为天鼓，聚神启奏，径御表章，乞除灾厄祸祟，当动天鼓三十六通，飞符诛魅返祸除灾，皆动金钟二十四通，施药服食动於玉磬十二通矣。 暗铭注第五 学道养圣胎，长生久视之道，人人尽有。 希生之心亦，少学者也。 圣胎者，胎息也。 想婴儿赤子，即长生不死之道也。 存亡不存来。 有信道气之者，不惜身命，始坚学道之心，深采玄微，方知究竟，则存亡而不存来。 学之道气，通流以得，玄趣为期，不畏亡而成之也。 泥丸通百节，泥丸，眉间入三寸是也。",
      "translated_text": "Thus, the Great Dao embraces the subtle and penetrates the minute, as deep and unfathomable as the ocean’s abyss—none can fathom or seek it. Therefore, the *Yin Fu Jing* states: \"Heaven unleashes its killing mechanism, and all things—fruits, grasses, insects, fish, mosquitoes, maggots, mole-crickets, and ants—all contain the qi of the Dao.\" The Dao resides within them, as fish dwell in water; the fish know not that water nourishes their form, just as the Dao abides in humanity, like the wind whose form cannot be seen. Thus, the *Huangting Jing* says: \"The tortoise draws qi to its spiritual root.\" This speaks of the tortoise’s attainment of qi, granting it long years without death. The snake, hibernating with a stone in its mouth without eating, transforms the stone into snake-yellow, a testament to the efficacy of qi. The phoenix and crane, mastering the subtleties of qi, roam the immortal grottoes of the Three Isles and Ten Continents; great immortals ride upon them—such is the marvel of their attainment of qi. The clam, embracing the autumn moonlight, forms a pearl; the macaque, learning dhyāna, enters samādhi; the white deer, skilled in stretching its joints, lives nine thousand years. Only humans, unaware of the arts of *daoyin*, fail to attain immortality.\n\nThe soft-shelled turtle, in winter, absorbs qi within the sand; the glow-fish burrows into dry earth; the silver carp feeds on water’s foam; the carp transforms into a dragon, summoning clouds and spreading rain. Yet humans, dwelling in the world, neglect the cultivation of the Dao and seek life outside themselves—how can they ever regain a human form? Alas! How sorrowful! Thus, the scriptures say: \"As if present, as if absent.\" When the Dao is present, one attains it; when it is lost, one forfeits it. Know this: humans who lose the Dao perish, just as fish who lose water die.\n\nAlas! Worldly people enter the mountains to seek the Dao, like climbing a tree to catch fish. They traverse great distances to find a master, like praying for rain in a drought. Thus, the *Yin Fu Jing* states: \"Thrice returning by day and night, one’s efforts surpass ten thousandfold.\" All things can steal from humans, and humans can steal from all things. Yet with an empty mind and a full abdomen, the qi of the Dao comes of itself; spreading virtue and bestowing merit, timely sweet rains descend.\n\nAs for the thieves of the Dao: all who consume the five grains grown from the earth—whose essence is of soil—will ultimately harm themselves, buried by the very earth. But those who feed on the primordial harmony of yin and yang’s qi, forsaking finite things, dwell eternally in the celestial kitchen. Thus, heaven cannot kill them, earth cannot bury them; my life is in my own hands, not in heaven or earth. Therefore, the Metal Mother said: \"The Three Passes determine life and death.\" How does the qi of the Dao compare to the moon’s reflection in the toad’s shadow? Every household radiates purity and brightness, ascending in their dwellings to the heavens; every person is imbued with the qi of the Dao. When saliva fills the mouth and is swallowed, it becomes *qiongye*—the sustenance of immortals.\n\nAfter one year of cultivation, the viscera are whole; after two years, the ailing body is healed; after three years, the blood and vessels are firm; after four years, the sinews and bones are refined; after five years, the eyes become bright; after six years, life is prolonged; after seven years, the marrow becomes like silk; after eight years, one becomes an earth immortal; after nine years, the hair turns black as dark jade. After nine years of cultivation, one can lightly ascend a hundred or ten *zhang* high, freely roaming the famous mountains and grottoes, unobstructed and unhindered. Weapons and armies cannot harm them; water and fire cannot afflict them; ghosts and spirits cannot disturb them. Dragons submit of themselves, tigers yield of themselves; spiritual powers are at their command—this is called a *zhenren*. Further cultivating the methods of ascension, chanting the mysteries of the grottoes, one soars to the yang realms and rests, wandering above the sun and moon—this is called a celestial immortal. Some govern immortal grottoes, some oversee the registers of immortals, some manage the records of cultivators, promoting them in due order, much like official ranks in the human world, each with its own duties. Those who do not cultivate the arts of ascension may retreat into grottoes, becoming earth immortals for eternity, their merit and fruition complete.\n\nAll who engage in cultivation must accumulate hidden merits, amassing three thousand; when their virtuous works are fulfilled, the Jade Emperor will naturally summon them to the Mystic Capital to receive their office. If one does not cultivate hidden merits, their name will not ascend to the Mystic Capital. Though their name may be recorded among those who cultivate the Dao, without a ledger of hidden merits, the celestial decree will not promote them for lack of accomplishment.\n\nThus, in cultivating the supreme methods, hidden merits come first; only then can one deliver others while perfecting one’s own merit. From ancient times, all who attained the Dao followed this path. The Dao is united by faith; virtue is preceded by wisdom. My Dao is like the sea—it is called the Dao-Sea. Without faith, without cultivation, I have spoken all. Those of shallow wisdom and meager virtue must not lightly divulge these teachings. Only after ancestral transgressions are expiated, obstacles removed, and the master’s transmission received—pledging with gold, swearing before the Ten Heavens, fasting, bathing, bowing, and kowtowing—may the teachings be imparted.\n\nFools amass wealth by the thousands, hoarding hundreds of herbs and minerals, yet their remedies have little healing power and no effect in prolonging life. To learn the arts of immortality, one must rely on qi techniques: visualize the left canine as the Golden Bell, the right as the Jade Chime, and the upper and lower front teeth as the Jade Tablets. These are also called the Celestial Drum. Gather the spirit, initiate the petition, and submit the memorial to beseech the removal of calamities, disasters, and malevolent spirits. Strike the Celestial Drum thirty-six times; dispatch talismans to slay demons, reverse misfortune, and dispel disasters. Strike the Golden Bell twenty-four times; administer elixirs and consume medicinal foods, striking the Jade Chime twelve times.\n\n**Dark Inscription, Fifth Scroll**\nTo cultivate the Dao and nourish the sacred embryo is the Way of long life and enduring vision—all possess it. Yet few are those who aspire to it. The sacred embryo is embryonic breathing. Envision the infant, the newborn—this is the Way of immortality and deathlessness. Whether present or absent, do not cling to either. Those who have faith in the qi of the Dao spare neither body nor life, steadfast in their resolve to learn the Dao. Only by deeply exploring the mysteries can one grasp the ultimate truth—then, whether present or absent, one does not cling. Cultivating the qi of the Dao, its currents flow unimpeded; the profound subtleties are the goal. Fear not death, and one will attain it.\n\nThe *Niwan* connects the hundred joints—the *Niwan* is three *cun* inward from the space between the eyebrows.",
      "overlap_context": "xen, horses, pigs, sheep, chickens, dogs, fish, or insects, they torment their own form and soul. Those with greater karmic force drift through the currents of love and enmity, while those with lesser force become mosquitoes or maggots. The power of the Great Dao eludes them, for they know not this principle.\n\nHow could they know that the Dao is like the ocean, its responsive power shaping mountains and rivers? Fish, dragons, and serpents all stir clouds and spread rain, their might astonishing.",
      "start_char": 3666,
      "end_char": 4879,
      "start_sentence": 141,
      "end_sentence": 188,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.18988656997681,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\灵剑子.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "中有路入，通顶后背脊，兼通达脚骨中，入气海，大小利门出，似醍醐之效也。 丹阙脉三才。 丹阙中宫，心所治丹者，赤色也。 为绛宫心君治之，管百城千国皆心君，血脉通焉。 脉者，调摄和净也。 三才者三焦，上焦象天，中焦象人，下焦象地，法取，元和之气也。 去作三周计，不知玄道是气，罔测远近宽迮程途，亦恐不逢，坚志往游，且若探讨学之周也。 还时七日回。 探讨得气之术，妙不能己身，不在他人，故不用多时回也。 玄珠求海阔，玄珠前章已解，如海内求珠，向来曾求，则求无不得也。 但思之能成若不曾求，即如海阔也。 赤水路无媒。 赤水者，血也。 玄珠来得，津血不成，无媒路也。 善恶怀中秀，长生之术，善修之则易到。 恶者，不达之玄妙。 修到气海，怀生光彩，一如秀影也。 尿阿两畔催。 唯思蕙白之气於背脊，两畔去来，催者急也。 而成玄珠，前章释也。 其中无一物，气在其中，元无一物。 道气已成，用心已到无心之境，行住合无为之理，自然之乡也。 搔首坐瑶台。 首者头也，搔者动也，去之貌也。 瑶台琼室，则日月之宫也。 此为阳界三魂受事之府，人神所居之宫也。 松沙记第六 余自修道，方明气术为先，阴功为首，顷获灵剑，荡妖精。 蛇蜃之毒，伤害於民，滋潭之上，铸铁纂以封蜃穴，夜使鬼神铸二铁柱，暗锁豫章一柱在于南。 又於西岭，恐蜃奔冲，陷溺庶民，立一柱在西山，东面双岭之前。 斩大蛇於西平建昌之界，有子从腹而出，走投入海，遂飞神剑逐之，缘此蛇子无过，致神剑不诛。 上足吴猛云：蛇子五百年后，当准前害於人民，但当以松坛为记，松枝低覆於坛拂地，合当五百年矣。 吾当自下观之，若下伤害於民，吾之灵剑亦不能诛之。 今来豫韦之境，五陵之内，相次已去，前后有八百人，皆於此得道，而获地仙。 当此之时，自有后贤而降伏之。 吴君云：将何物为记？ 答曰：豫章大江中心，忽生沙洲，渐长延下，掩过沙市口，与龙沙相对，遮掩是也。 是其道渐修之，各自成功，相次超升金阙。 及为洞府名山主者，道首人师当出豫章之地，大扬吾道。 吾着《气法医言郡》五十卷，流传於世，子请不忧尔。 上足回剑斩南湖石兽，飞剑入兽眼中，其兽虽吐气如云，秪引出其面受诛，兽不动眼，如此兽无过，剑不诛之。 妆剑而回。 以此之功，故号灵剑子，而传授后来得仙之士。 豫章河西城，寻获魏夫人洪传先生旧迹，入府内得金钱丹药，亦重宣气术阴功。 学道之士，初广布阴骘，先行气攻，持内丹长生久视之法，前章语毕，不劳重说。 气成之后，方修大药矣。 自十得道超升之士，尸解之徒，皆以阴惊为先，济贫拔难，或暗行施惠，将救饥寒，种种方便，以添三千功满自然矣。 司命，司录言奏於上玄，大药可修矣。 道诚第七 道以清浄为本，德以阴惊为先，切断嗜欲于足而成焉。 绝谷味以为实腹，腹实无滞而易行，则腹实矣。 清虚心腹，是道之常。 初修之人，目不视色欲，耳不听哀声，口不纳珍味，鼻不取异香，身不染秽浊，是上真俱恶此也。 谓之六根不漏矣，能如此依诚断绝，则为大仙矣。 凡初学之士，勿便顿绝，但将淡食为之。 俗食俗务，兼废人事，亦渐希之。",
      "translated_text": "Within lies a path that enters, connecting to the crown at the back and the spine, extending through the bones of the feet, entering the *Qi Sea*, and exiting through the great and small *Li Gates*—its effect akin to the clarity of *ghṛta*. The *Danque* pulse embodies the Three Powers.\n\nThe *Danque* resides in the Central Palace, where the heart governs the cinnabar—its color is crimson. The Crimson Palace is ruled by the Heart Lord, who oversees the hundred cities and thousand states, all governed by the Heart Lord, with blood and pulse in harmony. The pulse is the regulation, harmony, and purity of cultivation. The Three Powers are the Three Burners: the Upper Burner corresponds to Heaven, the Middle Burner to Humanity, and the Lower Burner to Earth—modeled after the primordial harmonizing *qi*.\n\nIf one calculates in three cycles, unaware that the mysterious Dao is *qi*, one cannot fathom the distance or the breadth of the journey, and may fear never encountering it. Yet with steadfast resolve, one ventures forth as if exploring the depths of learning. Upon return, seven days have passed. The art of exploring to attain *qi* is so wondrous that it cannot be confined to the self, nor to others—thus, the return is swift.\n\nSeeking the *Mysterious Pearl* in the vast sea: as previously explained, it is like searching for a pearl within the ocean—if one has sought it before, then nothing will be left unobtained. But if one merely thinks of it without ever seeking, it remains as distant as the boundless sea. The path of *Red Water* lacks a guide. *Red Water* is blood. Even if the *Mysterious Pearl* is attained, without the fluid of blood, there is no guiding path.\n\nWithin the embrace of good and evil blooms the art of long life: if cultivated with goodness, it is easily attained. Evil is the failure to grasp the profound mystery. When cultivation reaches the *Qi Sea*, the radiance of life shines within—like the brilliance of a blossoming shadow.\n\nUrging from both flanks: focus the pure *qi* of *huixiang* along the spine, its movement pressing from both sides—*cui* means urgency. Thus is the *Mysterious Pearl* formed, as explained in the previous chapter. Within it, there is nothing—*qi* resides there, yet nothing exists. When the *qi* of the Dao is perfected, the mind reaches the state of no-mind, and in movement or stillness, one aligns with the principle of non-action, returning to the realm of spontaneity.\n\nScratching the head upon the Jade Terrace: the head is the crown, *sao* means movement, the manner of departure. The Jade Terrace and Jasper Chamber are the palaces of the sun and moon—this is the府 of the Three Hun of the Yang realm, the abode where the human spirit resides.\n\n**Record of the Pine Sand, Sixth Chapter**\nSince I began cultivating the Dao, I have come to understand that *qi* arts come first, and hidden merit is paramount. Recently, I obtained the *Spiritual Sword* and dispelled the toxins of demonic serpents and *shen* that harmed the people. Above the deep pool, I cast an iron cauldron to seal the *shen*’s lair. At night, I commanded spirits to forge two iron pillars—one secretly placed in *Yuzhang*, the other in the south. Another was erected on the Western Ridge, fearing the *shen* might surge forth and drown the people, so I placed a pillar on the western mountain, before the twin peaks to the east.\n\nI slew a great serpent at the border of *Xiping* and *Jianchang*, and its offspring emerged from its belly, fleeing into the sea. I pursued it with the flying spirit-sword, but as this serpent-child bore no fault, the divine sword did not slay it. My disciple Wu Meng said: \"This serpent-child will, in five hundred years, resume its harm to the people. You should mark this with a pine altar—when the pine branches droop low over the altar, brushing the ground, it will have been five hundred years. I shall descend to observe, and if it harms the people below, even my spirit-sword will be unable to slay it.\"\n\nNow, in the lands of *Yuwei* and the Five Mounds, eight hundred have already departed in succession, all attaining the Dao here and achieving earthly immortality. In time, worthy successors will arise to subdue it. Wu Meng asked: \"What shall we use as a marker?\" I replied: \"In the center of the great river of *Yuzhang*, a sandbar will suddenly emerge, gradually extending downstream until it covers the *Shakou* inlet, facing *Longsha*—that will be the sign.\"\n\nAs each cultivates the Dao and succeeds in turn, they ascend to the Golden Gates. Those who become masters of grotto-heavens and famous mountains will emerge from the land of *Yuzhang*, greatly propagating my teachings. I have composed *Fifty Scrolls of Qi Arts and Medical Sayings of the Commandery*, which will circulate in the world—do not worry, my disciple.\n\nMy disciple returned the sword after slaying the stone beast of *Nanhu*: the flying sword entered the beast’s eye, and though it exhaled clouds of vapor, the sword only struck its face, sparing the eye. Since the beast bore no fault, the sword did not slay it. Thus, the sword was sheathed and returned. For this merit, I am called *Lingjianzi*, and I transmit this to those who later attain immortality.\n\nIn the western city of the *Yuzhang* River, I sought the former traces of Lady Wei and Master Hong, entering the mansion to retrieve golden coins and elixir medicines. I again emphasized the *qi* arts and hidden merit. For those who study the Dao, first widely cultivate hidden virtue, then practice *qi* refinement, holding to the method of inner elixir for long life and enduring vision—this has been explained in the previous chapter and need not be repeated. Only after the *qi* is perfected does one proceed to refine the great medicine.\n\nOf the ten who attained the Dao and ascended, and those who achieved liberation through *shijie*, all placed hidden merit first: relieving the poor, rescuing the distressed, secretly bestowing kindness, aiding the hungry and cold, and employing all manner of expedient means to accumulate the full three thousand merits. Then, the *Siming* and *Silü* will report to the Supreme Mystery, and the great medicine may be cultivated.\n\n**Sincerity of the Dao, Seventh Chapter**\nThe Dao takes purity and stillness as its foundation, and virtue takes hidden merit as its priority. Sever desires at their root to achieve it. Abstain from grains and flavors to fill the belly—when the belly is full and unobstructed, it is easily traversed, and thus truly full. A clear and empty heart and belly are the constant of the Dao.\n\nFor those beginning cultivation: the eyes do not gaze upon sensual desires, the ears do not listen to mournful sounds, the mouth does not consume rich flavors, the nose does not seek exotic fragrances, and the body does not touch filth—these are all detested by the highest immortals. This is called the sealing of the six senses. If one can adhere to sincerity and sever these, one becomes a great immortal.\n\nFor those newly embarking on the path, do not abruptly cut off all things—simply adopt a bland diet. Gradually reduce worldly foods and affairs, and likewise diminish worldly engagements.",
      "overlap_context": "o either. Those who have faith in the qi of the Dao spare neither body nor life, steadfast in their resolve to learn the Dao. Only by deeply exploring the mysteries can one grasp the ultimate truth—then, whether present or absent, one does not cling. Cultivating the qi of the Dao, its currents flow unimpeded; the profound subtleties are the goal. Fear not death, and one will attain it.\n\nThe *Niwan* connects the hundred joints—the *Niwan* is three *cun* inward from the space between the eyebrows.",
      "start_char": 4879,
      "end_char": 6092,
      "start_sentence": 189,
      "end_sentence": 244,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.35845756530762,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\灵剑子.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "恐人觉悟之人，乃动众惊恐，常流祸来逼，身致太阴之下，白骨作堆，此则学道祸刑灭身也。 佯颠佯狂，毁改衣装，外从垢腻，此并浑世清荡阴滓，保惜於命，深了玄趣，洞达幽微，道气成矣。 欲传后学，依格付之。 出度一人，立城气功一年。 授一人更度一久，臧功二年，二人不行此法。 得此法不信，不修疑惑，师减气功三年，三人得趣。 道气成功，传此文理，增得静纪。 泛欲传度，先观前人行，行心有慈悲，口常谈道德，孝敬中外，信义忠良，仁和礼善，卑逊德行，聪明英秀，异智高见，有此之功，方可传授本诀，与之为弟子。 如不入此格付之，减寿夺功矣。 更有慈悲愍念敬道之心，真人可同共之。 此道授之，或未能修奉，但业俗务萦牵时，将此文於日月之下，星斗分明之时，香灯鲜果好花好酒供养，心祝曰：某自传妙法，未能修奉，乞不减折本师气功，皆托玄穹鉴察，则师不减气功也。 如不依此法浩祝星辰，则当有不测之疾刑害身命。 觉有此疾，药力治疗不退，还告上穹，了以道气，依前调习驱逐，当见神功。 不得用药攻之，立沉幽府。 唯道气可凭信，至於鬼神，岂可凭焉。 其如饥饱劳逸，寒暑湿风，吐酒及醉房室，久行久立，久坐久卧，久声久笑，久悲久乐，久喜久哭，并减气功，诸子书并载，余不录之。 此书久随仙驾，已在天宫，未传於下世，因吴猛女彩鸾执吾沉海溺之籍，因中秋游吾仙府旧宅之所睹，求恩十方，男女相把手唱歌词场调美，便入讶场尔，唱仙凡之语，聆聆又乐。 忽睹文箫，词华无滞，出语捷机，二人各有心相慕，词中相接，有似宿缘，歌罢秉烛，引到仙居之地，夜之琴瑟和呜。 晨有仙童来呈文簿，而文箫问之，为泄天机，上帝罚为民妻一纪。 恐文箫不修道气，取此教之。 箫修行一纪，道气成而升上玄都矣。 导引势第八 凡欲胎息服气，导引为先，开舒筋骨，调理血脉，引气臻圆，使气存至极力后见焉。 摩拭手脚，偃亚球拳，伸展拏搦，任气出旋，诸疾退散，是病能痊，五藏六腑，神气通玄，来往自熟，道气成焉。 或存至泥丸顶发，或下至脚板涌泉。 久久修之，后知自然。 魂魄聿盛，精髓充坚。 行此法者，皆作神仙。 五藏有势，逐时补元。 春夏秋冬，以意通宣。 老子学道，亦乃如然。 岂悟众圣，造次流传。 子书之内，尽着佳篇，今引诸势，一十六端。 补肝藏三势春用之 一势。 以两手掩口，取热汗及津液摩面，上下三五十遍。 食后为之，令人华润。 又以两手摩拭面，使极热，令人光泽不皱。 行之三年，色如少女，兼明目，散诸故疾。 从肝藏中出肩背，然引元和，补肝藏入下元。 行导引之法，皆闭气为之。 先使血脉通流，从徧身中出，百病皆痊。 慎勿开口，舒气为之。 用力之际，勿以外邪气所入於藏腑中，返招祸害，慎护之。 二势，平身正坐，两手相叉，争力为之。 治肝中风，掩项后，使面仰视之。 使项与手争力，去热毒、肩疼痛、目视不明。 积聚风气，不散元和，心气焚之，令出散。 然调冲和之气补肝，下气海，添内珠尔。 三势。 以两手相重，按陛拔去左右，极力去腰间风毒之气及胸膈，补肝兼能明目。 补脾藏一势季春用之 四势。 左右射雕，去胸协及胸膈，结聚风气脾藏，诸疾来去，用力为之，闭口使内气趁散之尔。",
      "translated_text": "Those who awaken to the truth may stir alarm among the masses, inviting misfortune and peril, their bodies consigned beneath the Great Yin, their bones piled like mounds—this is the calamity of learning the Dao, where punishment extinguishes the self. Feign madness, feign folly, alter one’s garments, and outwardly embrace filth and grime. Thus does one blend with the world, purify its turbid yin dregs, preserve the vital essence, and profoundly grasp the subtle mysteries. When the qi of the Dao is perfected, transmit it to later disciples according to the proper method. For each person initiated, the master’s qi cultivation is extended by one year. If one disciple in turn initiates another, the master’s merit accumulates for two years. Should two fail to follow this method, the master’s qi cultivation is diminished by three years. When three attain realization, the qi of the Dao is perfected. Transmitting these principles augments the master’s tranquil merit. Should one wish to widely transmit and initiate others, first observe the conduct of the candidate: whether their heart holds compassion, their speech extols the Dao and virtue, whether they honor kin near and far, uphold fidelity and loyalty, embody benevolence, harmony, propriety, and humility, possess wisdom, brilliance, extraordinary insight, and profound vision. Only those who meet these standards may be entrusted with the essential teachings and accepted as disciples. To transmit to those unworthy diminishes the master’s lifespan and forfeits their merit. Those who harbor compassion, reverence for the Dao, and a heart of devotion may share in the company of perfected beings. Should one receive these teachings yet fail to practice them, entangled in worldly affairs, they may present this text beneath the sun and moon, under the clear light of the stars, offering incense, lamps, fresh fruit, fine flowers, and good wine. With sincere prayer, they may say: *\"I have received this wondrous method but have not yet practiced it. I beseech that my master’s qi cultivation not be diminished, and entrust this plea to the scrutiny of the Mysterious Heavens.\"* Thus, the master’s qi cultivation will remain unharmed. Should one neglect this ritual and fail to invoke the stars, unforeseen illness and misfortune may strike. If such afflictions arise and medicine proves ineffective, one must appeal to the Upper Heavens, rectify the qi of the Dao, and resume practice to dispel them, whereupon divine efficacy will manifest. Do not rely on medicine to force a cure, lest one sink into the dark realms. Only the qi of the Dao is trustworthy; how can one rely on ghosts and spirits?\n\nAs for imbalances of hunger and satiety, fatigue and ease, cold and heat, dampness and wind, vomiting from wine, intoxication, sexual excess, prolonged standing or walking, sitting or lying, excessive speech, laughter, sorrow, joy, weeping, or elation—all diminish qi cultivation. These are recorded in various texts, and I shall not repeat them here.\n\nThis text long accompanied the immortal chariot in the celestial palace and was never transmitted to the mortal realm. It was only when Wu Meng and the maiden Cai Luan, who held the register of my drowning in the sea, visited my former immortal abode during the Mid-Autumn festival that they witnessed the spectacle: men and women joining hands, singing in harmonious melodies, entering the marvelous scene. They sang of the divide between immortals and mortals, their voices joyous and clear. Suddenly, they beheld Wenxiao, whose words flowed with unobstructed elegance, swift and keen. The two harbored mutual admiration, their verses intertwining as if bound by past karma. After the song, they lit candles and were led to the immortal dwelling, where the night resounded with the harmony of zither and lute. At dawn, an immortal youth arrived bearing a celestial ledger. Wenxiao inquired, and was told that revealing heavenly secrets had incurred the Jade Emperor’s punishment: she was to be demoted to a mortal wife for twelve years. Fearing Wenxiao might abandon the cultivation of Dao qi, this teaching was bestowed upon her. After twelve years of practice, her Dao qi was perfected, and she ascended to the Mysterious Capital.\n\n**Chapter Eight: Dao Yin Postures**\n\nFor those practicing fetal breathing and qi absorption, Dao Yin is paramount. It loosens the sinews and bones, regulates the blood and vessels, guides qi to its fullest, and allows its presence to be felt after extreme exertion. Rub the hands and feet, assume postures of yielding and grasping, stretch and flex, and let qi circulate freely. All illnesses will dissipate, and ailments will heal. The five viscera and six bowels will harmonize with the spirit, their qi flowing effortlessly, and the Dao qi will be perfected. Direct it to the Niwan Palace atop the head or downward to the Yongquan points beneath the feet. With prolonged practice, natural mastery will follow. The hun and po spirits will flourish, essence and marrow will solidify. Those who practice this method will all become immortals.\n\nThe five viscera have corresponding postures to replenish their primal qi according to the seasons. In spring, summer, autumn, and winter, apply them with focused intent. Even Laozi cultivated the Dao in this manner. How could the multitude of sages not have transmitted these methods in haste? The ancient texts contain many fine passages; here, I present sixteen postures.\n\n**Three Postures to Nourish the Liver (Used in Spring)**\n\n**First Posture:**\nCover the mouth with both hands, gather warmth, saliva, and sweat, then rub the face up and down thirty to fifty times. Perform this after meals to enhance radiance. Alternatively, rub the face vigorously until it grows very hot, imparting a lustrous, unwrinkled complexion. After three years of practice, one’s countenance will resemble a maiden’s, the eyes will brighten, and all chronic ailments will disperse. Guide the qi from the liver through the shoulders and back, drawing forth harmonious primal qi to nourish the liver and replenish the lower elixir field. All Dao Yin methods require holding the breath. First, ensure the blood and vessels flow freely throughout the body, and all illnesses will be cured. Take care not to open the mouth or exhale forcefully. When exerting effort, guard against external pathogenic qi invading the viscera and bowels, lest it invite misfortune. Exercise caution.\n\n**Second Posture:**\nSit upright, interlock the fingers, and exert force. This treats wind in the liver. Press the hands behind the neck, tilt the head back, and gaze upward. Let the neck and hands contend in force to dispel heat toxins, shoulder pain, and blurred vision. If stagnant wind qi accumulates and fails to disperse, the heart’s fire will burn it away. Then, regulate the harmonious qi to nourish the liver, descend it to the sea of qi, and replenish the inner pearl.\n\n**Third Posture:**\nPress one hand over the other, press the thighs, and pull forcefully to the left and right to expel wind toxins from the waist and chest, nourishing the liver and brightening the eyes.\n\n**One Posture to Nourish the Spleen (Used in Late Spring)**\n\n**Fourth Posture:**\nMimic the \"shooting hawk\" stance to the left and right, dispelling stagnation in the chest and diaphragm, and resolving wind qi congestion in the spleen. Apply force while holding the breath, allowing the internal qi to disperse.",
      "overlap_context": "n to mournful sounds, the mouth does not consume rich flavors, the nose does not seek exotic fragrances, and the body does not touch filth—these are all detested by the highest immortals. This is called the sealing of the six senses. If one can adhere to sincerity and sever these, one becomes a great immortal.\n\nFor those newly embarking on the path, do not abruptly cut off all things—simply adopt a bland diet. Gradually reduce worldly foods and affairs, and likewise diminish worldly engagements.",
      "start_char": 6092,
      "end_char": 7345,
      "start_sentence": 245,
      "end_sentence": 298,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.83861541748047,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\灵剑子.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "补心藏三势夏用之 五势。 大坐斜身，用力偏敌如排山势，极力去腰脊风冷，宣通五藏六腑，散脚气，左右同，补心益智。 六势。 以一手按陛，一手向上，极力如托石，去两胁间风毒，治心藏，通和血脉。 左右同，闭气为之，十二月俱依此尔。 第一势后，便行此法。 七势。 常以两手合掌，向前筑去臂腕，淘心藏风劳，宣散关节。 左右同，皆须依春法尔。 补脾藏一势季夏用之 八势。 端身正坐，舒手指，直上反拘，三举，前屈，去腰脊脚膝痹风，散膀胱气。 前后同，至六月十四日已后用之。 补肺藏三势秋用之 九势。 以两手抱头项，宛转回旋俯仰，去胁胸筋背间风气，肺藏诸疾宣通，项脉左右同，依正月法。 十势。 以两手相叉於头上，过去左右伸曳之，十徧，去关节中风气，治肺藏诸疾。 十一势。 以两手拳脚胫十余徧，此是开胸膊膈，去脸中气，治肺藏诸疾，并依正月闭气为之。 仍叩齿三十六通应之。 补脾藏一势季秋用之 十二势。 九月十二日已后用，补脾。 以两手相叉於头上，与手争力。 左右同，治脾藏四肢，去胁下积滞风气膈气，使人能食，闭气为之。 补肾藏三势冬用之 十三势。 以两手相叉，一脚踏之，去腰脚拘急肾气诸疾、冷痹脚手风毒气膝中疼痛之疾。 十四势。 大坐伸手指，缓拘脚指，治脚痹诸风注气、肾藏诸毒气、远行脚痛不安，并可常为最妙矣。 十五势。 以一手托膝反折，一手抱头，前后左右为之，去骨节间风，宣通血脉、膀胱、肾气、肾藏诸疾。 补脾藏一势季冬用之 十六势。 以两手耸上，极力，三徧，去脾脏诸疾不安，依春法用之。 右已前一十六势，并闭气为之则妙也。 此导引后一千年中，有道首大扬道气，於宫商角征羽，唱阅后多士矣，共八百众，於二炼后四元内，相次飞升矣。 一炼五百年，二炼一千年。 俗以十二年为一周，道以十二年为一纪，一元六十年，四元二百四十年，道为世矣。 灵剑子竟",
      "translated_text": "**Three Postures to Nourish the Heart (Used in Summer)**\n\n**Fifth Posture:**\nSit upright with legs extended, lean the body diagonally, and exert force as if pushing a mountain, using all strength to dispel wind-cold from the waist and spine, freeing the five viscera and six bowels, dispersing leg qi. Perform equally on both sides to nourish the heart and sharpen the mind.\n\n**Sixth Posture:**\nPress one hand against the thigh while the other reaches upward with all force, as if lifting a stone, to expel wind toxins from between the ribs and regulate the heart. Harmonize the blood vessels. Perform equally on both sides while holding the breath. Follow this method throughout the twelfth month. Practice this immediately after the first posture.\n\n**Seventh Posture:**\nRegularly clasp the hands together and thrust them forward to stretch the arms and wrists, purging the heart of wind-fatigue and freeing the joints. Perform equally on both sides, adhering to the spring method.\n\n**One Posture to Nourish the Spleen (Used in Late Summer)**\n\n**Eighth Posture:**\nSit upright with legs extended, stretch the fingers upward, then pull them back sharply three times, followed by forward bending to dispel numbness from the waist, spine, legs, and knees, and disperse bladder qi. Perform equally forward and backward. Begin this practice after the fourteenth day of the sixth month.\n\n**Three Postures to Nourish the Lungs (Used in Autumn)**\n\n**Ninth Posture:**\nClasp the hands behind the head and neck, turning and rotating the body with gentle bows, to dispel wind qi from between the ribs, chest, sinews, and back, freeing the lungs of all ailments. Perform equally on both sides of the neck, following the first-month method.\n\n**Tenth Posture:**\nInterlace the fingers above the head and stretch forcefully to the left and right ten times, dispelling wind qi from the joints and regulating the lungs of all ailments.\n\n**Eleventh Posture:**\nClench the fists and strike the shins ten times or more to open the chest and diaphragm, expel facial qi, and regulate the lungs of all ailments. Perform while holding the breath, as in the first month. Follow this by tapping the teeth together thirty-six times.\n\n**One Posture to Nourish the Spleen (Used in Late Autumn)**\n\n**Twelfth Posture:**\nBegin this practice after the twelfth day of the ninth month to nourish the spleen. Interlace the fingers above the head and exert force against them. Perform equally on both sides to regulate the spleen and limbs, dispel stagnant wind qi and diaphragm qi from beneath the ribs, and stimulate the appetite. Perform while holding the breath.\n\n**Three Postures to Nourish the Kidneys (Used in Winter)**\n\n**Thirteenth Posture:**\nInterlace the fingers and press one foot upon them to relieve tension in the waist and legs, kidney qi ailments, cold numbness, wind toxins in the hands and feet, and knee pain.\n\n**Fourteenth Posture:**\nSit upright with legs extended, stretch the fingers, and gently pull the toes to treat leg numbness, wind-dampness, kidney toxins, and pain from long journeys. This posture is most excellent for regular practice.\n\n**Fifteenth Posture:**\nPress one hand against the knee while the other clasps the head, bending forward, backward, and to the sides to dispel wind from the bones and joints, free the blood vessels, bladder, and kidney qi, and regulate the kidneys of all ailments.\n\n**One Posture to Nourish the Spleen (Used in Late Winter)**\n\n**Sixteenth Posture:**\nRaise both hands upward with all force three times to regulate the spleen of all ailments. Follow the spring method.\n\nThe preceding sixteen postures are most effective when performed while holding the breath. After the dissemination of this *Dao-yin* method, a thousand years later, a Daoist master greatly propagated the Dao’s qi through the five tones—*gong*, *shang*, *jue*, *zhi*, and *yu*—and many scholars gathered, numbering eight hundred. After the second refinement, within the four *yuan*, they ascended in succession. The first refinement took five hundred years, the second a thousand. The common world reckons twelve years as one cycle, while the Dao counts twelve years as one *ji*, sixty years as one *yuan*, and two hundred forty years as four *yuan*. Thus does the Dao endure in the world.\n\n*Ling Jian Zi* concludes.",
      "overlap_context": ":**\nPress one hand over the other, press the thighs, and pull forcefully to the left and right to expel wind toxins from the waist and chest, nourishing the liver and brightening the eyes.\n\n**One Posture to Nourish the Spleen (Used in Late Spring)**\n\n**Fourth Posture:**\nMimic the \"shooting hawk\" stance to the left and right, dispelling stagnation in the chest and diaphragm, and resolving wind qi congestion in the spleen. Apply force while holding the breath, allowing the internal qi to disperse.",
      "start_char": 7346,
      "end_char": 8125,
      "start_sentence": 299,
      "end_sentence": 340,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.191784381866455,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\灵剑子.txt",
        "category": "众术类"
      }
    }
  ]
}