{
  "source_id": "灵飞散传信录",
  "source_file": "chunked_daozang\\灵飞散传信录.json",
  "total_chunks": 5,
  "total_original_chars": 2305,
  "total_translated_chars": 14251,
  "total_translation_time": 75.42408561706543,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\灵飞散传信录.txt",
    "category": "众术类"
  },
  "full_translation": "**Record of the Efficacy of the Spirit-Flight Powder**\n\n*Scripture Title:* *Record of the Efficacy of the Spirit-Flight Powder*\nCompiled by Qi Shui of the Tang. One fascicle.\nSource text: *Daoist Canon of the Zhengtong Era*, *Section of Divine Wonders*, *Category of Miscellaneous Arts*.\n\nThe *Record of the Efficacy of the Spirit-Flight Powder*\n\nI once shared with Censorate Inspector Huishu of Boling a bond of transcending the world to preserve the form, a pact to soar beyond mountains and seas. We often spoke thus: scholars in pursuit of learning explore distant and erroneous paths, ashamed to cultivate what is near and real. They vainly pursue the remote and vast, yet before shedding their vulgar and base nature, they already aspire to ascend as immortals, believing that the Golden Elixir alone can prolong life and that celestial registers are instantly attainable.\n\nYet if the heart is not truly aligned with the Dao, and the body’s refinement differs not from the ordinary, teeth and hair will not endure, and the complexion will fade with time. This is because qi and blood are inwardly depleted while appearance outwardly transforms. Before illness is dispelled and desires cease their torment, one may die prematurely, failing even to reach the natural span of life. Such blind and deluded pursuits are all too common.\n\nIf one seeks true distinction, one must first seek an effective formula. Only after verifying that one’s appearance and teeth differ from the vulgar, and that the natural limits of life are not pressing, may one hope for longevity and the cultivation of immortal potential. Refine the spirit to attain clarity and emptiness, seek to ingest the essence of mushrooms and jade, and in recent times, there have been new insights to rescue the body—these we share to enlighten one another.\n\nOne day, Huishu said to me: \"There was a guest who spoke of Commander Pei, whose hair had long turned white yet whose complexion remained youthful. When asked what he ingested, he credited the efficacy of the Spirit-Flight Powder.\" We knew this formula was recorded in the twenty-eighth fascicle of the *Thousand Gold Pieces*.\n\nHuishu further said: \"I heard that External Affairs Officer Junyi of Fanyang once studied the Way of qi refinement with the alchemist Wu Hanren. In their discussions of this formula, they noted that the version in the *Thousand Gold Pieces* was incomplete and often unreliable. The original formula derives from the *Scripture of the Grand Clarity*, and one should seek the authentic text to prepare and ingest it according to the method.\" However, Junyi’s private aspirations remained uncertain as to what he might achieve.\n\nAt the time, he was residing in the former residence of Secretary Li Bi. One leisurely day, he chanced upon a small chamber filled with books piled upon the desk—most were torn and incomplete, jumbled in disarray. As he examined nearly half of the scrolls, he suddenly came upon one with an intact header, its calligraphy and ink exceptionally fine. It was titled *Authentic Scripture of the Grand Clarity*, and upon unrolling it, he found the formula for the Spirit-Flight Powder.\n\nJunyi took it and read with joy, his heart truly moved. He hastened to inform the alchemist, who then burned incense, bowed in reverence, and washed his hands to hold the scroll, saying to Junyi: \"This is a true legacy of the celestial bureaucracy, a spiritually responsive and particularly efficacious formula, recorded in the immortal scriptures to encourage later learners.\"\n\nHuishu, knowing that my bond with Junyi was one of profound trust, deemed the transmission credible. We agreed to consult and seek a copy. I rode to his door and, upon hearing the account, obtained a transcription, which I shared with Huishu.\n\nThe formula’s ingredients are divided, with \"cloud powder\" as the principal component. That year, I was appointed to a post in Zhongling, and Mount Lu was within my jurisdiction. Its peaks leapt like waves, its veins flowing into streams and ravines. The local adepts and immortality-seekers all drew from the rushing springs and clouds, where water was cleansed by the sun, and frost and snow gleamed like crystal. The pills rolled like pearls and spiraled like conches, as if crafted by heaven itself.\n\nSold in village markets, they provided sustenance for clothing and food. The common shops stocked them daily, setting no fixed limit. Among the formula’s essentials, only this one substance was difficult to obtain—yet here, it was readily available. Such was the fortune of this journey.\n\nIndeed, heaven lent its design to my intentions, and thus did it also benefit fellow seekers of the Way—else how could such a convergence have occurred, fulfilling our earlier pact? I privately treasured this numinous revelation, never forgetting it in waking or rest. Traveling through the merchant routes of Lu, I lodged at a leopard’s hidden abode. A courier from Neixiang arrived, speaking of one Deng Yuanrong, who had served as acting magistrate of the former district. Though he had reached the age of fifty, his bearing and temples showed no sign of age, nor had his eyes dimmed. He governed with vigor, receiving guests with the strength of a man in his prime. When asked the source of his vitality, he replied that he had once obtained a divine formula. Upon arriving in the district to investigate, I found it to be the *Lingfei Powder*. Examining its transmission and the efficacy of its medicinal power, he recounted that years earlier, he had met a Tang clerk who had received it orally from a Daoist adept, claiming it was a celestial formula from the immortals. To witness its effects, one could transform hair and complexion in an instant.\n\nYuanrong had an elderly relative whose countenance and hair had already declined. Seeking to test its numinous power, he requested a portion of the formula. After thirty days of ingestion, his relative’s appearance and hair were suddenly restored to their former state. Yuanrong, having experienced half the dosage’s effect, preserved his youth for decades without change. Regrettably, before the medicine’s full potency could manifest, he ceased its use, and further requests were hindered by distance and exhaustion. Though his resources had since dwindled, he remained distinct from ordinary men. He further recounted that in Chang’an, he had transmitted the formula to the two imperial sons-in-law, Zhang and Pei, both of whom witnessed its transformative effects, confirming what he had previously heard. Thus, the marvel of this formula was verified by repeated evidence, and my eagerness to learn it grew with each account.\n\nMoreover, the recluse Sun, a master of Daoist inquiry, had delved deeply into the essentials of formulas and included this in his compilation—surely not by chance. Fortunate in our encounter with Junyi, Huishu and I fulfilled our earlier vow, pledging to ingest the medicine and await its proof in days to come, continuing this record.\n\nWritten in earnest on the fifth day of the fourth month, the seventh year of the Yuanhe era, by Qi Tui of Gaoyang.\n\nThe *Taiqing Jing* states: To summon the myriad spirits and seek ascension as an immortal, one must first purify oneself through fasting and ablution, washing the head with fragrant water and bathing the five limbs. After a hundred days of such refinement, one may then invoke the divine. Those who seek immortality should entreat the Perfected Ones of the Northern, Western, and Central Peaks for the *Lingfei Powder*; once obtained and ingested, one is certain to attain transcendence.\n\nThe Perfected One says: To seek immortality, eternal youth, and longevity—restoring white hair to black, fallen teeth to growth, a radiant complexion, and luminous flesh—one must take the *Lingfei Powder*.\n\nLord Lao says: This is the essence of the arts of the Dao, the very foundation of immortality. For Daoists, transcendence becomes effortless; for guardsmen, wandering Mount Hua is within reach; for common men, departed years return; for the elderly, a child’s visage is reborn.\n\nLord Lao says: Those who take this medicine may defy aging. After ten days of ingestion, one may fast for three years. After three years of use, one may live for three thousand six hundred years. Not I alone, but all who attain the true Dao shall preserve their bodies and become immortals.\n\n**Lingfei Powder Formula**\n- 1 *jin* of refined mica\n- ½ *jin* (or 1 *jin*) of *fuling* (poria)\n- 7 *liang* of *wuzi* kernels (schisandra)\n- 7 *liang* of stalactite\n- 5 *liang* (or 15 *liang*) of chrysanthemum\n- 4 *liang* of *mu* (likely *muxiang*, costus root)\n- (One version includes 7 *liang* of ginseng)\n- 12 *liang* (or 15 *liang*) of dried rehmannia\n- 7 *liang* of cassia heartwood\n- 7 *liang* of *xuduan* (dipsacus)\n\nGrind the nine ingredients into fine powder. Then take nineteen *jin* of fresh *tianmendong* (asparagus root), pound it to extract the juice, and use it to form pills. If the juice is abundant, blend it with the powder; if scant, knead it. Place the mixture in a bronze vessel, suspend it beneath a steamer, and steam it with twelve *dou* of millet until cooked. Remove and dry the medicine in the sun, then grind it again into a fine powder. Take a one-*cun* square spoonful every seven days.\n\nThis medicine is non-toxic and may be taken in larger doses.\n\nAfter ten days of consumption, the body will feel light; after twenty days, hearing and vision will sharpen; after seventy days, white hair will turn black again. If all hair has fallen out and teeth have been lost, take twenty-seven *bi* of the medicine, blend it with white honey, and grind it two hundred times until smooth. Form pills the size of *wutong* seeds, yielding approximately eighty-one to eighty-nine pills. Dry them in the sun until thoroughly desiccated. When the surface and interior of the pills become visible—resembling luminous moon pearls or glowing firefly orbs, sometimes red, sometimes white—this is the elixir that immortals carry with them and consume regularly.\n\nTo ensure hair and teeth regenerate in due time, take seven pills daily, three times a day, until new growth appears without whitening or shedding. If entering deep mountains without food, these pills may also be taken—seven pills a day will stave off hunger. If hair has not yet fallen out or turned white, the powdered form may be taken instead, granting a lifespan of five to six hundred years without graying. For those whose hair has already turned white, following the aforementioned method will allow it to remain black for up to seven hundred years before falling. Those who seek the Dao and take this medicine without experiencing white hair or tooth loss should consume it twice daily—this is the key to attaining immortality. Shedding teeth and bones is the lesser path of *shijie* (corpse liberation).\n\nWhen preparing this *Lingfei* powder, taking it for three days will double one’s strength; after five days, blood and qi will flourish; after seven days, the body will feel light; after ten days, the complexion will glow with radiance, and the mind will grow sharp; after fifteen days, one’s stamina will become boundless, allowing one to walk as swiftly as a horse; after twenty days, aging will cease; after thirty-five days, night vision will acquire luminosity.\n\n**Method for Processing Mica:**\n- Mix one *jin* of white salt with one *jin* of mica, then grind them together.\n  - Grind the mica thoroughly without sifting. Place it in a double-layered cloth bag and press firmly. Rinse with water until all saltiness is removed, then transfer to a silk bag. Hang to dry, and it will become powder.\n  - *Alternative method:* Boil the mica in saltwater until it dissolves into a mud-like consistency, then press it into powder.\n  - *Another method:* Soak one *jin* of mica in one *dou* of coarse salt within a bronze vessel for three to four days, then steam for a full day. Grind it in a mortar until it becomes powder.\n  - *Yet another method:* Boil one *jin* of mica in three *dou* of *poxiao* (sodium sulfate) solution until it forms powder. Dry and spread it out, then examine it under sunlight—if no streaks (*mang*) are visible, it is properly refined. If streaks remain, do not consume it, as prolonged use may cause illness and even death. Refine it meticulously.\n\nThis method was originally recorded in the authentic transmission obtained from Lu Silun.\n\nThe sutra states: After grinding the mica into a paste, place it in a layered cloth bag and press it thoroughly. Then transfer it into a leather bag and press again. However, this method is generally inferior to using water from Mount Lu’s stone steps to pound and grind it, which yields the finest and most refined powder. If self-prepared and the process is not meticulous, residual streaks (*yingmang*) may remain, which can harm the body—beware. After taking the medicine, avoid carp, and ideally abstain from all fish, as contamination from knives or cutting boards may cause serious harm. Also refrain from consuming blood, including raw meat, raw dried meat, and the like. Cooked blood dishes are not forbidden. Avoid raw onions, garlic, leeks, fermented vinegar, peaches, plums, quince, sour foods, and flowing water. If traveling by river or using water from mountain streams or old wells, boiling it before consumption is acceptable. Barley diminishes the efficacy of mica, so it should also be avoided. This medicine can halt menstrual bleeding, and when combined with the cultivation of a tranquil mind and qi, its effects manifest more swiftly. It must not be taken in the presence of others—thus noted here.\n\nScholar Sun’s *Secret Essentials of Nurturing Life* states: “Since encountering this formula, nearly thirty-six years have passed. Though I have long admired and delighted in it, I hesitated to put it into practice due to lingering doubts.”\n\nAfter years of inquiry and seeking, I have repeatedly encountered devoted practitioners who have benefited from this formula, and so I have taken it myself—its effects precisely as described. If one persists in its practice without cease, the merit will not be in vain. *Record of the Transmission of the Wondrous Flying Powder* concludes here.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "灵飞散传信录 经名：灵飞散传信录。 唐齐谁编撰。 一卷。 底本出处：《正统道藏》洞神部众衍类。 灵飞散传信录 余与宪台察史博陵晦叔，有遗世保形。 超蹈山海之契。 尝共语：求学之士，探拟赊谬，耻营近实。 虚务遐阔，未易凡鄙，便冀飞升，谓金丹坐延，而仙籍立致。 夫处心不真於道，炼形未异於常，齿发不驻，颜色随谢。 是气血内耗而容状外变，病疾未脱，嗜欲交煎，天生速死，不及常理，区区贪昏，多此类也。 今所为异，必求良方。 先验容齿，与俗流自别，知常限不迫，方可冀久视修仙材。 炼神清虚，求饵芝玉约索精要，近拯形骸，有新闻阅，互相晓导。 晦叔异日谓余日：有客话裴都尉者，鹤发早垂，童颜近复，访其所饵，曰灵飞散之功。 共知此方，在《千金》第二十八卷。 晦叔又日：闻勋曹员外即范阳君彝，尝与修气道客昊含人丹，讲求此方丹曰：《千金》近略，多不真定。 此方本出《太清仙经》，可求正文，如法合饵。 君彝私志，亦未卜所获。 时寓累于故李中书泌之宅，暇日偶入一小室，有书籍盈几，皆断烂罕全，杂委元次。 轴阅将半，忽遇一轴，标首完整，文墨甚华，题曰《太清真经》，发视乃灵飞散方卷。 君彝执读，欣契诚求，骤告於丹。 乃焚香顶奉，涤手持捧，谓君彝日：此真官曲遗，灵应特延，纪於仙书，足劝后学。 晦叔以余与君彝莫逆分至，传信可凭，约就谘访，便求传写。 余驱乘诣门，问与闻时，因得抄录，与晦叔同之。 又方中分味，以云粉为主。 是岁余授钟陵奏辟，而庐阜在封部之内，炉峰跳波，脉注溪壑，居人方士，皆引湍春云，水汰日曝，流霜莹雪，丸珠旋螺，宛若天造。 货於村市，资为衣食，常肆所积，日取元限。 此方难要，唯兹一物，有是行也。",
      "translated_text": "**Record of the Efficacy of the Spirit-Flight Powder**\n\n*Scripture Title:* *Record of the Efficacy of the Spirit-Flight Powder*\nCompiled by Qi Shui of the Tang. One fascicle.\nSource text: *Daoist Canon of the Zhengtong Era*, *Section of Divine Wonders*, *Category of Miscellaneous Arts*.\n\nThe *Record of the Efficacy of the Spirit-Flight Powder*\n\nI once shared with Censorate Inspector Huishu of Boling a bond of transcending the world to preserve the form, a pact to soar beyond mountains and seas. We often spoke thus: scholars in pursuit of learning explore distant and erroneous paths, ashamed to cultivate what is near and real. They vainly pursue the remote and vast, yet before shedding their vulgar and base nature, they already aspire to ascend as immortals, believing that the Golden Elixir alone can prolong life and that celestial registers are instantly attainable.\n\nYet if the heart is not truly aligned with the Dao, and the body’s refinement differs not from the ordinary, teeth and hair will not endure, and the complexion will fade with time. This is because qi and blood are inwardly depleted while appearance outwardly transforms. Before illness is dispelled and desires cease their torment, one may die prematurely, failing even to reach the natural span of life. Such blind and deluded pursuits are all too common.\n\nIf one seeks true distinction, one must first seek an effective formula. Only after verifying that one’s appearance and teeth differ from the vulgar, and that the natural limits of life are not pressing, may one hope for longevity and the cultivation of immortal potential. Refine the spirit to attain clarity and emptiness, seek to ingest the essence of mushrooms and jade, and in recent times, there have been new insights to rescue the body—these we share to enlighten one another.\n\nOne day, Huishu said to me: \"There was a guest who spoke of Commander Pei, whose hair had long turned white yet whose complexion remained youthful. When asked what he ingested, he credited the efficacy of the Spirit-Flight Powder.\" We knew this formula was recorded in the twenty-eighth fascicle of the *Thousand Gold Pieces*.\n\nHuishu further said: \"I heard that External Affairs Officer Junyi of Fanyang once studied the Way of qi refinement with the alchemist Wu Hanren. In their discussions of this formula, they noted that the version in the *Thousand Gold Pieces* was incomplete and often unreliable. The original formula derives from the *Scripture of the Grand Clarity*, and one should seek the authentic text to prepare and ingest it according to the method.\" However, Junyi’s private aspirations remained uncertain as to what he might achieve.\n\nAt the time, he was residing in the former residence of Secretary Li Bi. One leisurely day, he chanced upon a small chamber filled with books piled upon the desk—most were torn and incomplete, jumbled in disarray. As he examined nearly half of the scrolls, he suddenly came upon one with an intact header, its calligraphy and ink exceptionally fine. It was titled *Authentic Scripture of the Grand Clarity*, and upon unrolling it, he found the formula for the Spirit-Flight Powder.\n\nJunyi took it and read with joy, his heart truly moved. He hastened to inform the alchemist, who then burned incense, bowed in reverence, and washed his hands to hold the scroll, saying to Junyi: \"This is a true legacy of the celestial bureaucracy, a spiritually responsive and particularly efficacious formula, recorded in the immortal scriptures to encourage later learners.\"\n\nHuishu, knowing that my bond with Junyi was one of profound trust, deemed the transmission credible. We agreed to consult and seek a copy. I rode to his door and, upon hearing the account, obtained a transcription, which I shared with Huishu.\n\nThe formula’s ingredients are divided, with \"cloud powder\" as the principal component. That year, I was appointed to a post in Zhongling, and Mount Lu was within my jurisdiction. Its peaks leapt like waves, its veins flowing into streams and ravines. The local adepts and immortality-seekers all drew from the rushing springs and clouds, where water was cleansed by the sun, and frost and snow gleamed like crystal. The pills rolled like pearls and spiraled like conches, as if crafted by heaven itself.\n\nSold in village markets, they provided sustenance for clothing and food. The common shops stocked them daily, setting no fixed limit. Among the formula’s essentials, only this one substance was difficult to obtain—yet here, it was readily available. Such was the fortune of this journey.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 679,
      "start_sentence": 0,
      "end_sentence": 29,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.150801420211792,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\灵飞散传信录.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "实天借心谋，亦将旁利同志，不然何契会如此，以先约话。 余私贮灵感，不忘寝兴，行商洛数程，息豹藏舍。 邮客有自内乡来者，曰有邓缘融，摄宰前邑，年瑜从心之五，而姿鬓不老，目瞳不昏，理剧接宾，与强仕等力。 问其所得，日尝获神方。 余至邑征访，乃灵飞散所致。 考其传授及药力验应，云昔岁见唐主簿，有道流口付，说是灵仙上方，欲窥功用，可立变鬓发。 ．融有亲容，颜鬓已衰，将试灵验，因求合分，服三十日，融之亲容，颜发顿易前状。 融半剂之效，亦保数十年不改。 恨其药力未成，便阙服饵，又远请穷顿。 资货多乖，今比凡流，犹有所异。 复说在长安日，传张裴二驸马，皆目变效，重符前闻。 则此方神奇，验实相接，眼饥口问，积为明征。 又孙处士，道问上流。 精穷方要，攘此编录，固非偶然。 余与晦叔幸君彝之遇，果求向之约，誓心服食，以邀效证他日之异，续此编书。 元和七年四月五日，高阳齐推书心记实。 《太清经》云：凡欲致万神，求升仙，皆先洁斋清已，香水灌头，沐浴五体，益善百日之后，乃可致神明。 欲求仙者，当从北岳、西岳、中岳真人，求灵飞散，得而服之，必得神仙矣。 真人日：凡欲求神仙不老，长生久视，白发更黑，齿落更生，面目悦泽，肌骨有光，从表睹裹者，当服灵飞散。 老君日：此方术之要，神仙之道，必化之本。 道士服之，神仙不难。 卫士服之，游於华山。 凡夫服之，年去更还。 老翁服之，反生童颜。 老君日：服此药者，可以不老。 十日服之，三年不食。 服之三年，可寿三千六百岁。 我非一人，皆得真道，保成神仙。 灵飞散方 云母一斤，炼成者　狭苓半斤，亦可一斤　梧子仁七两　石钟乳七两　菊花五两，亦可＋五两　木四两。 一本人参七两　乾地黄十二两，亦可十五两　桂心七两　续断七两 凡九物治下徒讫，以生天门冬十九斤，祷麋绞取汁以丸。 此药汁多可和之，汁少者波之。 着铜器中，悬着饭下，蒸黍一斛二斗，熟出药曝乾。 更治梼之令细捷。 服一方寸。 七日一服。",
      "translated_text": "Indeed, heaven lent its design to my intentions, and thus did it also benefit fellow seekers of the Way—else how could such a convergence have occurred, fulfilling our earlier pact? I privately treasured this numinous revelation, never forgetting it in waking or rest. Traveling through the merchant routes of Lu, I lodged at a leopard’s hidden abode. A courier from Neixiang arrived, speaking of one Deng Yuanrong, who had served as acting magistrate of the former district. Though he had reached the age of fifty, his bearing and temples showed no sign of age, nor had his eyes dimmed. He governed with vigor, receiving guests with the strength of a man in his prime. When asked the source of his vitality, he replied that he had once obtained a divine formula. Upon arriving in the district to investigate, I found it to be the *Lingfei Powder*. Examining its transmission and the efficacy of its medicinal power, he recounted that years earlier, he had met a Tang clerk who had received it orally from a Daoist adept, claiming it was a celestial formula from the immortals. To witness its effects, one could transform hair and complexion in an instant.\n\nYuanrong had an elderly relative whose countenance and hair had already declined. Seeking to test its numinous power, he requested a portion of the formula. After thirty days of ingestion, his relative’s appearance and hair were suddenly restored to their former state. Yuanrong, having experienced half the dosage’s effect, preserved his youth for decades without change. Regrettably, before the medicine’s full potency could manifest, he ceased its use, and further requests were hindered by distance and exhaustion. Though his resources had since dwindled, he remained distinct from ordinary men. He further recounted that in Chang’an, he had transmitted the formula to the two imperial sons-in-law, Zhang and Pei, both of whom witnessed its transformative effects, confirming what he had previously heard. Thus, the marvel of this formula was verified by repeated evidence, and my eagerness to learn it grew with each account.\n\nMoreover, the recluse Sun, a master of Daoist inquiry, had delved deeply into the essentials of formulas and included this in his compilation—surely not by chance. Fortunate in our encounter with Junyi, Huishu and I fulfilled our earlier vow, pledging to ingest the medicine and await its proof in days to come, continuing this record.\n\nWritten in earnest on the fifth day of the fourth month, the seventh year of the Yuanhe era, by Qi Tui of Gaoyang.\n\nThe *Taiqing Jing* states: To summon the myriad spirits and seek ascension as an immortal, one must first purify oneself through fasting and ablution, washing the head with fragrant water and bathing the five limbs. After a hundred days of such refinement, one may then invoke the divine. Those who seek immortality should entreat the Perfected Ones of the Northern, Western, and Central Peaks for the *Lingfei Powder*; once obtained and ingested, one is certain to attain transcendence.\n\nThe Perfected One says: To seek immortality, eternal youth, and longevity—restoring white hair to black, fallen teeth to growth, a radiant complexion, and luminous flesh—one must take the *Lingfei Powder*.\n\nLord Lao says: This is the essence of the arts of the Dao, the very foundation of immortality. For Daoists, transcendence becomes effortless; for guardsmen, wandering Mount Hua is within reach; for common men, departed years return; for the elderly, a child’s visage is reborn.\n\nLord Lao says: Those who take this medicine may defy aging. After ten days of ingestion, one may fast for three years. After three years of use, one may live for three thousand six hundred years. Not I alone, but all who attain the true Dao shall preserve their bodies and become immortals.\n\n**Lingfei Powder Formula**\n- 1 *jin* of refined mica\n- ½ *jin* (or 1 *jin*) of *fuling* (poria)\n- 7 *liang* of *wuzi* kernels (schisandra)\n- 7 *liang* of stalactite\n- 5 *liang* (or 15 *liang*) of chrysanthemum\n- 4 *liang* of *mu* (likely *muxiang*, costus root)\n- (One version includes 7 *liang* of ginseng)\n- 12 *liang* (or 15 *liang*) of dried rehmannia\n- 7 *liang* of cassia heartwood\n- 7 *liang* of *xuduan* (dipsacus)\n\nGrind the nine ingredients into fine powder. Then take nineteen *jin* of fresh *tianmendong* (asparagus root), pound it to extract the juice, and use it to form pills. If the juice is abundant, blend it with the powder; if scant, knead it. Place the mixture in a bronze vessel, suspend it beneath a steamer, and steam it with twelve *dou* of millet until cooked. Remove and dry the medicine in the sun, then grind it again into a fine powder. Take a one-*cun* square spoonful every seven days.",
      "overlap_context": "all drew from the rushing springs and clouds, where water was cleansed by the sun, and frost and snow gleamed like crystal. The pills rolled like pearls and spiraled like conches, as if crafted by heaven itself.\n\nSold in village markets, they provided sustenance for clothing and food. The common shops stocked them daily, setting no fixed limit. Among the formula’s essentials, only this one substance was difficult to obtain—yet here, it was readily available. Such was the fortune of this journey.",
      "start_char": 679,
      "end_char": 1475,
      "start_sentence": 30,
      "end_sentence": 66,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.614116430282593,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\灵飞散传信录.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "元毒，可多服耳。 当食十日身轻，二十日耳目聪明，七十日发白返黑。 发尽落齿皆去者，取药二十七匕，以白蜜和之，梼二百下止，丸如梧桐子，可得八十一九。 曝令燥讫，视丸表裹相见，如明月珠，或似荧火精珠，或赤或白，此仙人随身常所服药也。 欲令发齿时生，日服此七丸，日三服，至发生不白不落。 若入深山不食，亦可作此丸，日七丸不饥也。 若头发不落未白，但可服散，可寿五六百年不白耳。 白者如前法。 已白，服药可至七百年乃落。 求道服药，不头白齿落者，日两服之，得仙之要。 齿骨尸解，道之下者。 几作此灵飞散，服之三日力倍，五日血脉盛，七日身轻，十日面目悦泽，智虑聪明，十五日力作不知极，徐行及马，二十日不复当，三十五日夜视有光。 治云母法 白盥一斤和合　云母一斤，并梼之 右云母梼糜勿筏，内重布囊中按挺之，水汰盐味尽，内绢囊中，悬令乾即成粉。 一法：以盐汤煮之，尽解如泥状，挺之为粉。 又法：云母一斤，大盐一斗，渍之铜器中三四，蒸之一日，於臼中梼之为粉。 又法：用朴硝水三斗，煮治云母一斤，取成粉，燥舒之，向日光看元芒，便好。 有芒，勿服。 服之久后，病杀人。 宜精治。 此本於卢司勋所得正经上传写记。",
      "translated_text": "This medicine is non-toxic and may be taken in larger doses.\n\nAfter ten days of consumption, the body will feel light; after twenty days, hearing and vision will sharpen; after seventy days, white hair will turn black again. If all hair has fallen out and teeth have been lost, take twenty-seven *bi* of the medicine, blend it with white honey, and grind it two hundred times until smooth. Form pills the size of *wutong* seeds, yielding approximately eighty-one to eighty-nine pills. Dry them in the sun until thoroughly desiccated. When the surface and interior of the pills become visible—resembling luminous moon pearls or glowing firefly orbs, sometimes red, sometimes white—this is the elixir that immortals carry with them and consume regularly.\n\nTo ensure hair and teeth regenerate in due time, take seven pills daily, three times a day, until new growth appears without whitening or shedding. If entering deep mountains without food, these pills may also be taken—seven pills a day will stave off hunger. If hair has not yet fallen out or turned white, the powdered form may be taken instead, granting a lifespan of five to six hundred years without graying. For those whose hair has already turned white, following the aforementioned method will allow it to remain black for up to seven hundred years before falling. Those who seek the Dao and take this medicine without experiencing white hair or tooth loss should consume it twice daily—this is the key to attaining immortality. Shedding teeth and bones is the lesser path of *shijie* (corpse liberation).\n\nWhen preparing this *Lingfei* powder, taking it for three days will double one’s strength; after five days, blood and qi will flourish; after seven days, the body will feel light; after ten days, the complexion will glow with radiance, and the mind will grow sharp; after fifteen days, one’s stamina will become boundless, allowing one to walk as swiftly as a horse; after twenty days, aging will cease; after thirty-five days, night vision will acquire luminosity.\n\n**Method for Processing Mica:**\n- Mix one *jin* of white salt with one *jin* of mica, then grind them together.\n  - Grind the mica thoroughly without sifting. Place it in a double-layered cloth bag and press firmly. Rinse with water until all saltiness is removed, then transfer to a silk bag. Hang to dry, and it will become powder.\n  - *Alternative method:* Boil the mica in saltwater until it dissolves into a mud-like consistency, then press it into powder.\n  - *Another method:* Soak one *jin* of mica in one *dou* of coarse salt within a bronze vessel for three to four days, then steam for a full day. Grind it in a mortar until it becomes powder.\n  - *Yet another method:* Boil one *jin* of mica in three *dou* of *poxiao* (sodium sulfate) solution until it forms powder. Dry and spread it out, then examine it under sunlight—if no streaks (*mang*) are visible, it is properly refined. If streaks remain, do not consume it, as prolonged use may cause illness and even death. Refine it meticulously.\n\nThis method was originally recorded in the authentic transmission obtained from Lu Silun.",
      "overlap_context": "acus)\n\nGrind the nine ingredients into fine powder. Then take nineteen *jin* of fresh *tianmendong* (asparagus root), pound it to extract the juice, and use it to form pills. If the juice is abundant, blend it with the powder; if scant, knead it. Place the mixture in a bronze vessel, suspend it beneath a steamer, and steam it with twelve *dou* of millet until cooked. Remove and dry the medicine in the sun, then grind it again into a fine powder. Take a one-*cun* square spoonful every seven days.",
      "start_char": 1475,
      "end_char": 1964,
      "start_sentence": 67,
      "end_sentence": 88,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.248696327209473,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\灵飞散传信录.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "经中云：梼云母糜后，入重布囊中按挺之，令须入皮囊中，按挺，大抵不如取庐山水磴舂梼者，最为轻／细。 自造恐功不至，忽有赢芒者，损人慎之。 服药后，禁食鲤鱼，能断一切鱼为上。 恐刀砧相染，所害不轻。 又禁食血，是生肉、生乾脯之类。 血羹是熟血，劫非所忌禁。 ‘生葱蒜、生韭、酿醋、桃李、木瓜、酸物等，并不宜食。 又忌流水。 若江行及汉涧元井处，但煎熟食之亦得。 大麦损云母力，亦宜慎之。 服此药能断叶血，兼修静心气，得效尤速。 不得面受，故此批上。 孙处士进《养生秘诀》云：臣遇此方已来，将瑜三纪，顷者但美而悦之，疑而未敢措手。",
      "translated_text": "The sutra states: After grinding the mica into a paste, place it in a layered cloth bag and press it thoroughly. Then transfer it into a leather bag and press again. However, this method is generally inferior to using water from Mount Lu’s stone steps to pound and grind it, which yields the finest and most refined powder. If self-prepared and the process is not meticulous, residual streaks (*yingmang*) may remain, which can harm the body—beware. After taking the medicine, avoid carp, and ideally abstain from all fish, as contamination from knives or cutting boards may cause serious harm. Also refrain from consuming blood, including raw meat, raw dried meat, and the like. Cooked blood dishes are not forbidden. Avoid raw onions, garlic, leeks, fermented vinegar, peaches, plums, quince, sour foods, and flowing water. If traveling by river or using water from mountain streams or old wells, boiling it before consumption is acceptable. Barley diminishes the efficacy of mica, so it should also be avoided. This medicine can halt menstrual bleeding, and when combined with the cultivation of a tranquil mind and qi, its effects manifest more swiftly. It must not be taken in the presence of others—thus noted here.\n\nScholar Sun’s *Secret Essentials of Nurturing Life* states: “Since encountering this formula, nearly thirty-six years have passed. Though I have long admired and delighted in it, I hesitated to put it into practice due to lingering doubts.”",
      "overlap_context": "a full day. Grind it in a mortar until it becomes powder.\n  - *Yet another method:* Boil one *jin* of mica in three *dou* of *poxiao* (sodium sulfate) solution until it forms powder. Dry and spread it out, then examine it under sunlight—if no streaks (*mang*) are visible, it is properly refined. If streaks remain, do not consume it, as prolonged use may cause illness and even death. Refine it meticulously.\n\nThis method was originally recorded in the authentic transmission obtained from Lu Silun.",
      "start_char": 1964,
      "end_char": 2217,
      "start_sentence": 89,
      "end_sentence": 101,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.537289381027222,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\灵飞散传信录.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "积年询访，屡有好事人曾饵得力，遂即服之，一如方说。 但能业之不已，功不徒弃也。 灵飞散传信录竟",
      "translated_text": "After years of inquiry and seeking, I have repeatedly encountered devoted practitioners who have benefited from this formula, and so I have taken it myself—its effects precisely as described. If one persists in its practice without cease, the merit will not be in vain. *Record of the Transmission of the Wondrous Flying Powder* concludes here.",
      "overlap_context": "he efficacy of mica, so it should also be avoided. This medicine can halt menstrual bleeding, and when combined with the cultivation of a tranquil mind and qi, its effects manifest more swiftly. It must not be taken in the presence of others—thus noted here.\n\nScholar Sun’s *Secret Essentials of Nurturing Life* states: “Since encountering this formula, nearly thirty-six years have passed. Though I have long admired and delighted in it, I hesitated to put it into practice due to lingering doubts.”",
      "start_char": 2217,
      "end_char": 2266,
      "start_sentence": 102,
      "end_sentence": 104,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.8731820583343506,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\灵飞散传信录.txt",
        "category": "众术类"
      }
    }
  ]
}