{
  "source_id": "玄和子十二月卦金诀",
  "source_file": "chunked_daozang\\玄和子十二月卦金诀.json",
  "total_chunks": 3,
  "total_original_chars": 2803,
  "total_translated_chars": 15164,
  "total_translation_time": 86.19274878501892,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\玄和子十二月卦金诀.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**Xuanhezi’s Golden Secrets of the Twelve Monthly Hexagrams**\n\n*Title:* *Xuanhezi’s Golden Secrets of the Twelve Monthly Hexagrams*\n*Author:* Anonymous\n*Volume:* One\n*Source:* *Daoist Canon of the Zhengtong Era*, Orthodox Section, Part One\n\n---\n\n**Xuanhezi’s Golden Secrets of the Twelve Monthly Hexagrams**\n\nAt the first yang line of *Fu* Hexagram, the celestial signs align at the hour of *zi*.\n*Fu* Hexagram governs the eleventh month, when the first yang line emerges as the cinnabar symbol.\nAs the eleventh month marks the onset of early spring, the elixir’s tally must follow the celestial pivot to refine the fire.\n\nThus does Xuanhezi employ this image and this method:\nWith wondrous skill, the golden crucible is tended;\nWith pure and reverent heart, the Jade Emperor is honored.\nFor twelve days of inner abstinence, the alchemist—master of profound mysteries—\nMust maintain immaculate devotion, as though standing before the Highest Perfected.\n\nThe White Tiger is not yet fully subdued,\nWhile the Azure Dragon begins its gradual ascent.\nBoth White Tiger and Azure Dragon reside within the crucible.\nThe White Tiger, being metal, cannot yet restrain the Dragon, which, nourished by gentle fire, gradually stirs into flight.\n\nSince ancient times, immortals have guarded this secret as one—\nWho claims the elixir’s art follows another path?\nFrom antiquity to the present, transcendents have concealed this Way.\nSages past and present share but this single method; no other principle exists.\nOnly the names of the elixir vary, it is said.\n\nIn *Lin* Hexagram, the Crimson Dragon stirs with clarity,\nAs mid-spring’s season brings mist-laden rains.\nThe Crimson Dragon arises with the second yang line, the fire growing stronger.\nNow in mid-spring, the Azure Dragon ascends and descends like drifting mists.\n\nThe ocean’s waves recede from the lofty isle of Penglai,\nWhile jade gates are sealed to ward off drafts.\nThe furnace has doors, and these must be opened and closed to block stray winds.\nOnce the ingredients are harmonized with skillful hands,\nThe fire’s modulation must proceed with profound mastery.\n\nOnly when the numbers of Heaven and Earth are grasped\nDoes the path to the Three Pure Ones become clear.\nThe method of refinement first requires understanding the water and fire of *Qian* and *Kun*.\nOnly then can the elixir be circulated; once perfected, the way to the Three Pure Realms is unobstructed.\n\nIn *Tai* Hexagram, the two qi achieve balance,\nAnd within the crucible, the leaps grow ever more distinct.\nThe Dragon’s roar and Tiger’s howl are truly worth hearing,\nAs lightning flashes and thunder rumbles in ceaseless fury.\nThe Azure Dragon and White Tiger within the crucible vie and devour one another.\nThe alchemist listens intently to the infant’s cries to gauge the fire’s ascent.\nThe fire, like stored lightning and thunder, gradually shifts to martial intensity.\n\nAs spring’s scene fades, the northern gate is sealed,\nAnd fiery clouds blaze, illuminating the fortress walls.\nBy the time of *Tai* Hexagram, spring’s season has passed.\nThe furnace’s northern gate is closed, and the fire grows martial, casting a radiant glow.\nThe fortress is the furnace, used as a stronghold.\n\nHow many know this secret of eternal life?\nWhen merit is complete, the whole household ascends to the Jade Pure Realm.\nMost mortals, ensnared by fame and profit, live in vain and die in futility.\nAmong ten thousand, scarcely one knows the Way of longevity—this elixir.\nYet if one refines the elixir to completion and accumulates hidden merit,\nThey shall surely ascend in time.\n\nIn *Zhuang* Hexagram, what is the Dao’s course?\nFire upon fire advances, and crimson clouds multiply.\nThe *Zhuang* Hexagram, with its four yang lines, marks the onset of summer.\nThe fire grows martial, hence the abundance of crimson clouds.\n\nWithin the vessel, the sun and moon align with the seasons;\nWithin the crucible, wind and thunder churn the azure waves.\nThe sun and moon are the two qi of yin and yang.\nWhen they move in harmony with the seasons, the crucible itself becomes a realm of wind and thunder stirring the lead and mercury.\n\nEars strain to catch the faintest whisper of fire,\nWhile nods affirm the rising veil of smoke.\nThe Fire Star’s net listens for the crucible’s bubbling and seething.\nAs the Azure Dragon weakens, the elixir’s work progresses.\nSoon, the elixir ripens—\nNo thousand scriptures or myriad secrets surpass this.\n\nIn *Guai* Hexagram, summer’s warmth divides the season,\nAnd the single yin will soon transform into pure *Qian*.\nThe *Guai* Hexagram, with its five yang lines, governs the height of summer.\nAs the season advances to *si*, it becomes *Qian* Hexagram—\nThus, it is said that before long, *Qian* reaches its fullness.\n\nTo capture the White Tiger is no easy feat,\nNor is subduing the Azure Dragon a mere coincidence.\nWith five yang lines, the fire grows fiercely martial.\nAt this stage, the Azure Dragon and White Tiger naturally restrain one another.\n\nGradually, purple powder flies within the lid,\nWhile within the crucible, red lotuses bloom.\nAfter the initial refinement, as the elixir circulates to this stage,\nWhat rises to the crucible’s lid resembles purple powder,\nAnd what forms around it takes the hue of red lotuses.\n\nWhen the allotted time nears its end, the adept departs,\nReturning to the golden altar of the old cave-heaven.\nOnce the elixir is complete, the one who consumes it has a thousand-day limit.\nYet they must perform hidden deeds in the world;\nOnly when the destined time is fulfilled does the elixir’s power manifest.\nSome ascend in broad daylight, others at night,\nLeaving behind an empty corpse in the city.\nThe heavens dissolve the mortal coil, and in Huayang Cave,\nA golden elixir altar stands a hundred *zhang* high—\nOne of the Eight Great Cave-Heavens.\n\nIn *Qian* Hexagram, the six positions complete their cycle,\nAnd the furnace blazes crimson with radiant fire.\nAs the six positions culminate in *Qian* Hexagram,\nThe alchemists speak of yang lines as the furnace’s flames.\nNow the elixir reaches its peak, the martial fire at its fiercest,\nGlowing brilliantly to fill the crucible with red.\n\nBy this stage, the harmonization matches that of all sages,\nAnd the adept, cherished and protected, ascends to the Nine Palaces.\nWhen the elixir reaches this point, the fire is at its zenith, the Dragon’s time past.\nThe inner and outer waters are balanced, the seas exhausted.\nAll sages guard and guide the adept toward the *wu* position—\nThe southern *Li* Palace, one of the Nine Palaces.\n\nThunder stills, lightning subsides, the azure sea runs dry,\nAnd the Dragon’s roar and Tiger’s struggle leave the crucible and vessel empty.\n\nThe *Yijing* states: \"The exalted Dragon has regret.\" This means yang has reached its extreme. At this time, the Azure Dragon has been entirely devoured by the White Tiger, and the White Tiger now lies subdued in stillness. Thunder and lightning fall silent, the crucible stands empty—no trace of the Azure Dragon’s roar remains.\n\nThe master’s wondrous hands penetrate the profound principle, gathering and clustering yin and yang within a single chamber. When the adept who refines the elixir attains this position, their power aligns with that of all sages. Thus it is said: \"penetrating the profound principle, gathering and clustering yin and yang.\" Though many in the world devote themselves to the Great Dao, few understand that the year mirrors the cosmos, the month mirrors the heavens—only the hours and moments hold the true key. By drilling and clustering yin and yang, one penetrates the ultimate principle of creation.\n\nAs Laozi’s song declares:\n*The sage seizes the intent of creation,\nGrasps sun and moon, sets them within the furnace.\nGently inverting the essence of heaven and earth,\nGathering yin and yang to command spirits and ghosts.\nWho recognizes the sun’s soul and moon’s spirit?\nThose who do are true immortals.\nRefine and consume it for a thousand days,\nAnd with no yin left within the body, how could death come?*\n\nThe *Gou* Hexagram now appears in perfect peace, the *Li* Palace restored with fresh auspiciousness. Clouds disperse, the two forces rest—all is tranquil. Fragrant blossoms bloom red, a springtime unlike any other. In the *Gou* Hexagram, a single yin line emerges, for the *Yijing* says: \"Treading on frost, solid ice—yin begins to congeal.\" The elixir, having reached this stage, gradually attains peace. This is the position of the *Li* Palace at *wu*, where fire and light prevail. The Metal Tiger Primordial Lord aligns with both realms, hence it is said to be \"restored.\" Within the crucible, clouds and rain withdraw, the elixir glows red as spring blossoms—this is *Gou*.\n\nThe Returned Elixir naturally reverts to the Dao; where can one seek companions in this work? The Elixir Earth has nine returns and seven reversals, referring to the return of yang in the eleventh month and the reversion to yin by the fifth month—each follows its own principle. If one refines the elixir with such effort, where can one find another like oneself?\n\nAttaining immortality is no easy feat—only by following the path of the Three Mao Masters can one tread in their footsteps. No method surpasses the Great Elixir for achieving longevity. If one reaches this stage and comprehends its wondrous function, such a person is rare indeed. To attain this is no simple endeavor; one must follow the dust-trails of the Three Mao Immortals.\n\nThe *Dun* Hexagram arrives as autumn’s scene unfolds, returning to the *Kun* position as the fire-clouds withdraw. The seventh month in the human world is mid-autumn; for elixir-refiners, the sixth month is mid-autumn, signifying the return to *Kun* in the southwest. Yin lines gradually emerge as yang lines withdraw. The water of the sea is replenished, timed by the dripping clepsydra. One imagines the crucible filled with crimson radiance, glowing like the rosy clouds of the Ten Isles.\n\nWithin the grotto-heavens, names are already inscribed—those who master this elixir-refinement are destined for immortality. When the elixir reaches the stage of two yin lines, there is no longer any danger of conflict or loss. Yet people of this age obscure the Dao, pursuing embryonic breathing, unaware that such practices are minor arts, incapable of transforming bone and form.\n\nAs Ge Xianweng said:\n*\"Daoists are all fools,\nSeeking only embryonic breathing.\nHow could they know of the Purple Journey Elixir,\nThe path of ascending to heaven in broad daylight?\"*\n\nThe *Pi* Hexagram approaches, bringing joy to the heart, as the three yang lines retreat and return to yin. After the Yellow Sprout coalesces, flowers burst forth in competition; when green waters are added, the sea deepens of its own accord. In the *Pi* Hexagram, the three yang lines transform into yin, hence the return to yin. The Yellow Sprout becomes the Great Elixir, blooming like flowers in spring, naturally fragrant and red. The water of the sea is replenished, now half again as deep.\n\nWithin the chamber, one temporarily commands the transformations of creation,\nYet returns to the dust to blend with the passing of time.\nThose who cultivate the Elixir, within a single room,\nManipulate the Qian and Kun Hexagrams, wielding the power of creation,\nGiving birth to the Elixir as heaven and earth bring forth the ten thousand things.\n\nOnce the Elixir’s drumbeat advances, its merit lies in human inquiry.\nLong have I sighed for companions of those bygone years—\nThe golden crucible, without karmic affinity, where now may it be found?\nThose who once practiced the Elixir together,\nAfter the turmoil of war, parted ways, their fates unknown,\nUnable to share the same affinity, to complete the golden crucible.\n\nThe *Guan* Hexagram nears its end, its Dao all but fulfilled,\nAt the hour of *you*, the tally and seal align at the center.\nThe hour of *you* marks the auspicious moment in the scriptures of Elixir cultivation,\nIts midpoint also serving as a guide for later learners.\n*You* is the eighth month, the sixth month the central position of heaven and earth.\n\nOnce the fire-timing attains its profound mystery,\nOne can envision the Elixir filling the crucible, crimson as dawn.\nWhen the fire-timing is mastered to its subtlety, the Elixir must form,\nIts red powder manifest.\n\nHow could one fret over graying hair in the world?\nDwelling in the mountains, one naturally subdues the Green Dragon.\nWith the red powder Elixir in hand, why fear hair that does not return to black?\nLiving in the mountains, attaining the Dao, one subdues the Green Dragon to refine the Elixir.\n\nThough immortals and aspirants may claim completion,\nWithout severing worldly desires, the Dao cannot be exhausted.\nThis poem on awaiting the Golden Elixir contains the ultimate secrets of immortals,\nAll methods fully expounded.\nYet if ordinary folk, their minds shallow and fickle,\nFail to align with the Dao’s affinity, they cannot fathom its depths.\n\nThe *Bo* Hexagram cycles, restoring the two qi in full—\nAt this stage of Elixir cultivation, one is called an immortal.\nWhen the five yin lines return, yin and yang near completion,\nThe Elixir perfected here is that of the immortal.\n\nThe Jade Hall, spring’s feast, enveloped in fragrant mist,\nThe golden crucible, its flowers red, unfolding like auspicious lotuses.\nThe Jade Hall is the Elixir chamber; the golden crucible, the Elixir furnace.\nAt this moment, the Elixir naturally fills the room and crucible with fragrant breezes,\nResembling newly bloomed red lotuses.\n\nThe sea’s waves naturally settle into emerald stillness,\nThe evening sun easily drifts with the passing years.\nYang fire gradually retreats, upper water replenished,\nCalm and unmoving, the time now evening.\nThe Elixir’s fire nears the midpoint of the year’s cycle, hence the drifting years.\n\nWorldly folk crave only the red dust of mundane affairs—\nHow could they believe there is yet another mystery within the mystery?\nThe Golden Elixir moves by heaven’s decree,\nTaking the false as its foundation,\nDrawing from the one within, it forms of itself.\n\nKnow that the *Kun* Hexagram’s positions have come full circle—\nBy the tenth month, all twelve positions are complete.\nThe fire now subtle, pure yin coalescing,\nThe civil fire lingers of its own accord.\n\nThen, holding the incense tablet, one faces the Dipper to pay homage,\nAdjusting robes and cap to offer prayers to the Supreme Ultimate.\nWhen the cycles of water and fire, yin and yang, are fulfilled,\nThe Elixir master, with incense in hand, ascends the altar,\nGiving thanks to the celestial spirits of heaven and earth,\nAnd once more entreating the stars to guard the Elixir’s favor,\nWarding off any encroaching malevolent qi.\n\nOnly when the furnace’s chill is carefully tended may one dare to look—\nAnxious thoughts linger, never ceasing.\nCome morning, after offering incense and paying homage to the immortals of heaven and earth,\nOne opens the golden crucible—\nAtop it, the Elixir has formed, finest of all,\nRising to the lid in a radiant purple glow,\nThis is the completion of the Purple Journey Elixir.\n\nThe *Xuanhezi’s* Twelve-Month Hexagram Secrets of the Golden Elixir conclude.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玄和子十二月卦金诀 经名：玄和子十二月卦金诀。 未署撰人。 一卷。 底本出处：《正统道藏》正一部。 玄和子十二月卦金诀 复卦初爻起一阳，子时符节转天呈。 复卦者，主十一月，一阳爻初生丹象。 以十一月，为初春用事，故子时还丹符，须顺天罡而行火也。 玄和子意用是象日是法。 高奇妙手修金鼎，清净斋心奉玉皇。 十二内禁日，凡修丹之人，乃是玄玄妙手也。 须洁净尊奉，如对高真玉皇者也。 白虎未能全制伏，青龙从此渐翱翔。 白虎与青龙，俱在鼎中。 白虎金，未能制伏青龙，龙方得文火，渐为腾跃之也。 神仙自古皆同秘，谁道还丹别有方。 自古至今，神仙皆秘借此道。 前贤后圣，亦只同此一方，故无别理，唯丹之名号，则不一耳云。 临卦分明运赤龙，中春时节雨蒙蒙。 赤龙者，为二爻生，火渐大，已是中春节候，青龙升降，如雨蒙蒙董董之逃也。 海波渐减高蓬岛，玉户潜扃避隙风。 炉皆有门，门有扇，开闭以避隙风也。 配合已知归敏手，燮调须顺有玄功。 铅汞皆先须配合得诀，方可入升卦用，燮调运其，火候无差，方生化成玄功也。 秪缘会得乾坤数，从此三清道路通。 修炼之法，先须得乾坤水火之数，方始运丹，丹成则三清神仙，无有不通。 泰卦方知二气平，鼎中腾跃渐分明。 龙吟虎啸真堪听，电激雷奔转转狞。 青龙与白虎在鼎递，相咽齿食，运丹之人专听婴儿之声，以停腾火候。 火则如藏畜电雷之声，渐行武火。 春景已阑扃北户，火云将炽映严城。 至泰卦已行尽，春令符节，炉北户皆却闭之，火渐武，映炉而明也。 城即炉也，用之如城也。 几人知此长生诀，功满全家上玉清。 谓世人但贪爱名利，须死虚生，万万人中无一人，知有长生之道，是此丹也。 如人修丹成，阴功又满，他日必上升也。 壮卦初临道若何，火火渐进赤云多。 丹象壮卦四阳爻，为夏首，火渐武也，故云赤云多也。 壶中日月能符节，鼎内风雷涌碧波。 日月阴阳二气也，谓能应时运其节符，只鼎内自在，如风雷涌其铅汞也。 侧耳渐听闻火微，点头时复许烟罗。 火罡罗公，闻鼎内水滴火熬之声，则青龙渐困，丹转有功。 看看便是还丹熟，万诀千经更莫过。 凡闻鼎中火熬之声，丹渐熟，谓法不能过也。 夬卦中分夏景暄，一阴非久变纯乾。 夫卦五阳爻主，是丹象中夏之节，渐及至巳，则为乾卦，故云非久，乾之至也。 解擒白虎能容易，降伏青龙岂偶然。 五阳爻主，则行火转武甚也。 至此时青龙白虎，自相制伏也。 渐渐盖中飞紫粉，看看鼎内化红莲。 凡采牙后运丹，至此节候，飞上鼎盖者，如紫粉色中，及四面者，如红莲花色也。 待逃数尽终归去，却反金坛旧峒天。 凡丹成，服丹之人，皆千日为限。 然须行阴功在世，逃数足后，方随药成功。 火者白日上升，或夜间上升，城市死尸解也。 天解化世，华阳洞有金丹坛百丈，是八大洞天也。 乾卦巡行六位终，火光赫赫满炉红。 行六位至乾卦，丹家谓阳爻为火炉炎光，即丹至此时，武火最大，赫赫极盛之貌，所以满炉红也。 燮调至此齐诸圣，爱护将升入九宫。 还丹至此，火极，无龙之时，内外燮调海水，水俱竭，诸圣皆爱护，将入午位，即南方离，为九宫。 雷息电收苍海竭，龙啸虎困鼎壶空。",
      "translated_text": "**Xuanhezi’s Golden Secrets of the Twelve Monthly Hexagrams**\n\n*Title:* *Xuanhezi’s Golden Secrets of the Twelve Monthly Hexagrams*\n*Author:* Anonymous\n*Volume:* One\n*Source:* *Daoist Canon of the Zhengtong Era*, Orthodox Section, Part One\n\n---\n\n**Xuanhezi’s Golden Secrets of the Twelve Monthly Hexagrams**\n\nAt the first yang line of *Fu* Hexagram, the celestial signs align at the hour of *zi*.\n*Fu* Hexagram governs the eleventh month, when the first yang line emerges as the cinnabar symbol.\nAs the eleventh month marks the onset of early spring, the elixir’s tally must follow the celestial pivot to refine the fire.\n\nThus does Xuanhezi employ this image and this method:\nWith wondrous skill, the golden crucible is tended;\nWith pure and reverent heart, the Jade Emperor is honored.\nFor twelve days of inner abstinence, the alchemist—master of profound mysteries—\nMust maintain immaculate devotion, as though standing before the Highest Perfected.\n\nThe White Tiger is not yet fully subdued,\nWhile the Azure Dragon begins its gradual ascent.\nBoth White Tiger and Azure Dragon reside within the crucible.\nThe White Tiger, being metal, cannot yet restrain the Dragon, which, nourished by gentle fire, gradually stirs into flight.\n\nSince ancient times, immortals have guarded this secret as one—\nWho claims the elixir’s art follows another path?\nFrom antiquity to the present, transcendents have concealed this Way.\nSages past and present share but this single method; no other principle exists.\nOnly the names of the elixir vary, it is said.\n\nIn *Lin* Hexagram, the Crimson Dragon stirs with clarity,\nAs mid-spring’s season brings mist-laden rains.\nThe Crimson Dragon arises with the second yang line, the fire growing stronger.\nNow in mid-spring, the Azure Dragon ascends and descends like drifting mists.\n\nThe ocean’s waves recede from the lofty isle of Penglai,\nWhile jade gates are sealed to ward off drafts.\nThe furnace has doors, and these must be opened and closed to block stray winds.\nOnce the ingredients are harmonized with skillful hands,\nThe fire’s modulation must proceed with profound mastery.\n\nOnly when the numbers of Heaven and Earth are grasped\nDoes the path to the Three Pure Ones become clear.\nThe method of refinement first requires understanding the water and fire of *Qian* and *Kun*.\nOnly then can the elixir be circulated; once perfected, the way to the Three Pure Realms is unobstructed.\n\nIn *Tai* Hexagram, the two qi achieve balance,\nAnd within the crucible, the leaps grow ever more distinct.\nThe Dragon’s roar and Tiger’s howl are truly worth hearing,\nAs lightning flashes and thunder rumbles in ceaseless fury.\nThe Azure Dragon and White Tiger within the crucible vie and devour one another.\nThe alchemist listens intently to the infant’s cries to gauge the fire’s ascent.\nThe fire, like stored lightning and thunder, gradually shifts to martial intensity.\n\nAs spring’s scene fades, the northern gate is sealed,\nAnd fiery clouds blaze, illuminating the fortress walls.\nBy the time of *Tai* Hexagram, spring’s season has passed.\nThe furnace’s northern gate is closed, and the fire grows martial, casting a radiant glow.\nThe fortress is the furnace, used as a stronghold.\n\nHow many know this secret of eternal life?\nWhen merit is complete, the whole household ascends to the Jade Pure Realm.\nMost mortals, ensnared by fame and profit, live in vain and die in futility.\nAmong ten thousand, scarcely one knows the Way of longevity—this elixir.\nYet if one refines the elixir to completion and accumulates hidden merit,\nThey shall surely ascend in time.\n\nIn *Zhuang* Hexagram, what is the Dao’s course?\nFire upon fire advances, and crimson clouds multiply.\nThe *Zhuang* Hexagram, with its four yang lines, marks the onset of summer.\nThe fire grows martial, hence the abundance of crimson clouds.\n\nWithin the vessel, the sun and moon align with the seasons;\nWithin the crucible, wind and thunder churn the azure waves.\nThe sun and moon are the two qi of yin and yang.\nWhen they move in harmony with the seasons, the crucible itself becomes a realm of wind and thunder stirring the lead and mercury.\n\nEars strain to catch the faintest whisper of fire,\nWhile nods affirm the rising veil of smoke.\nThe Fire Star’s net listens for the crucible’s bubbling and seething.\nAs the Azure Dragon weakens, the elixir’s work progresses.\nSoon, the elixir ripens—\nNo thousand scriptures or myriad secrets surpass this.\n\nIn *Guai* Hexagram, summer’s warmth divides the season,\nAnd the single yin will soon transform into pure *Qian*.\nThe *Guai* Hexagram, with its five yang lines, governs the height of summer.\nAs the season advances to *si*, it becomes *Qian* Hexagram—\nThus, it is said that before long, *Qian* reaches its fullness.\n\nTo capture the White Tiger is no easy feat,\nNor is subduing the Azure Dragon a mere coincidence.\nWith five yang lines, the fire grows fiercely martial.\nAt this stage, the Azure Dragon and White Tiger naturally restrain one another.\n\nGradually, purple powder flies within the lid,\nWhile within the crucible, red lotuses bloom.\nAfter the initial refinement, as the elixir circulates to this stage,\nWhat rises to the crucible’s lid resembles purple powder,\nAnd what forms around it takes the hue of red lotuses.\n\nWhen the allotted time nears its end, the adept departs,\nReturning to the golden altar of the old cave-heaven.\nOnce the elixir is complete, the one who consumes it has a thousand-day limit.\nYet they must perform hidden deeds in the world;\nOnly when the destined time is fulfilled does the elixir’s power manifest.\nSome ascend in broad daylight, others at night,\nLeaving behind an empty corpse in the city.\nThe heavens dissolve the mortal coil, and in Huayang Cave,\nA golden elixir altar stands a hundred *zhang* high—\nOne of the Eight Great Cave-Heavens.\n\nIn *Qian* Hexagram, the six positions complete their cycle,\nAnd the furnace blazes crimson with radiant fire.\nAs the six positions culminate in *Qian* Hexagram,\nThe alchemists speak of yang lines as the furnace’s flames.\nNow the elixir reaches its peak, the martial fire at its fiercest,\nGlowing brilliantly to fill the crucible with red.\n\nBy this stage, the harmonization matches that of all sages,\nAnd the adept, cherished and protected, ascends to the Nine Palaces.\nWhen the elixir reaches this point, the fire is at its zenith, the Dragon’s time past.\nThe inner and outer waters are balanced, the seas exhausted.\nAll sages guard and guide the adept toward the *wu* position—\nThe southern *Li* Palace, one of the Nine Palaces.\n\nThunder stills, lightning subsides, the azure sea runs dry,\nAnd the Dragon’s roar and Tiger’s struggle leave the crucible and vessel empty.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1235,
      "start_sentence": 0,
      "end_sentence": 61,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.670438051223755,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\玄和子十二月卦金诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "《易》曰：亢龙有悔。 即阳极为亢。 当此之时，青龙被白虎啮食已尽，白虎已自用伏。 雷电寂临，鼎空无其青声也。 先生妙手通玄理，攒簇阴阳一室中。 运丹之人得到此位，皆齐诸圣玄能也。 故日妙通玄理，攒簇阴阳者。 世人虽留心大道，多不知年象月亦象，唯日时是诀，钻簇阴阳，通於造化至理也。 老子歌云： 圣人夺得造化旨，手搏日月安炉里。 微微腾倒天地精，攒簇阴阳走神鬼。 日魂月魄若个识，识者便是真仙子。 炼之饵之千日期，身内无阴那得死。 姤卦看看已太平，离官依旧布祥新。 云收两歇时无事，香馥花红别是春。 姤卦一阴生，《易》曰：履霜坚冰，阴始凝也。 丹至此渐已太平，离宫午之位也，光者火也，金虎元君，两界同符，故言依旧也。 鼎内云雨收歇，丹以香红如春，姤也。 还丹自然归有道，功夫何处访同人。 丹土有九还七返，此谓从十一月还阳，至五月却返其阴，数各有其道也。 若运丹以此功夫觅同人，似我者何处有也。 长生到此非容易，为学三茅继后尘。 长生之道，莫过於大丹。 若到此符节，知其妙用，实罕有人。 若到此，则非容易而求也，可继三茅真人之道尘也。 遁卦元来景正秋，却归坤位火云收。 人间七月为中秋，丹家六月为中秋，言归坤西南也。 阴爻渐生，阳爻收敛也。 旋添海水听更漏，暗想红霞满十洲。 炉上有水海入，阴即减室内，想有刻漏，以则时候，丹到此，想满鼎红，如霞之光也。 洞里姓名元有姓，鼎中龙虎已无忧。 若解如此运丹，已是洞府录其姓名，有神仙之分。 谓丹到二阴爻生，则无冲失之为也。 时人昧道攻胎息，谁识还丹号紫游。 时人但则只学胎息气卫，以求长生，殊不知胎息是小术，未能换骨化形。 故葛仙翁云：道士尽愚痴，唯学於胎息。 岂知有紫游之丹，白日上升之道矣。 否卦将来喜称心，三阳已退却归阴。 黄芽结后花争发，渌水添来海自深。 否卦，三阳爻已变为阴爻，故之归阴也。 黄芽化大丹，如花得春，自然香红。 水海已添，乃半故深也。",
      "translated_text": "The *Yijing* states: \"The exalted Dragon has regret.\" This means yang has reached its extreme. At this time, the Azure Dragon has been entirely devoured by the White Tiger, and the White Tiger now lies subdued in stillness. Thunder and lightning fall silent, the crucible stands empty—no trace of the Azure Dragon’s roar remains.\n\nThe master’s wondrous hands penetrate the profound principle, gathering and clustering yin and yang within a single chamber. When the adept who refines the elixir attains this position, their power aligns with that of all sages. Thus it is said: \"penetrating the profound principle, gathering and clustering yin and yang.\" Though many in the world devote themselves to the Great Dao, few understand that the year mirrors the cosmos, the month mirrors the heavens—only the hours and moments hold the true key. By drilling and clustering yin and yang, one penetrates the ultimate principle of creation.\n\nAs Laozi’s song declares:\n*The sage seizes the intent of creation,\nGrasps sun and moon, sets them within the furnace.\nGently inverting the essence of heaven and earth,\nGathering yin and yang to command spirits and ghosts.\nWho recognizes the sun’s soul and moon’s spirit?\nThose who do are true immortals.\nRefine and consume it for a thousand days,\nAnd with no yin left within the body, how could death come?*\n\nThe *Gou* Hexagram now appears in perfect peace, the *Li* Palace restored with fresh auspiciousness. Clouds disperse, the two forces rest—all is tranquil. Fragrant blossoms bloom red, a springtime unlike any other. In the *Gou* Hexagram, a single yin line emerges, for the *Yijing* says: \"Treading on frost, solid ice—yin begins to congeal.\" The elixir, having reached this stage, gradually attains peace. This is the position of the *Li* Palace at *wu*, where fire and light prevail. The Metal Tiger Primordial Lord aligns with both realms, hence it is said to be \"restored.\" Within the crucible, clouds and rain withdraw, the elixir glows red as spring blossoms—this is *Gou*.\n\nThe Returned Elixir naturally reverts to the Dao; where can one seek companions in this work? The Elixir Earth has nine returns and seven reversals, referring to the return of yang in the eleventh month and the reversion to yin by the fifth month—each follows its own principle. If one refines the elixir with such effort, where can one find another like oneself?\n\nAttaining immortality is no easy feat—only by following the path of the Three Mao Masters can one tread in their footsteps. No method surpasses the Great Elixir for achieving longevity. If one reaches this stage and comprehends its wondrous function, such a person is rare indeed. To attain this is no simple endeavor; one must follow the dust-trails of the Three Mao Immortals.\n\nThe *Dun* Hexagram arrives as autumn’s scene unfolds, returning to the *Kun* position as the fire-clouds withdraw. The seventh month in the human world is mid-autumn; for elixir-refiners, the sixth month is mid-autumn, signifying the return to *Kun* in the southwest. Yin lines gradually emerge as yang lines withdraw. The water of the sea is replenished, timed by the dripping clepsydra. One imagines the crucible filled with crimson radiance, glowing like the rosy clouds of the Ten Isles.\n\nWithin the grotto-heavens, names are already inscribed—those who master this elixir-refinement are destined for immortality. When the elixir reaches the stage of two yin lines, there is no longer any danger of conflict or loss. Yet people of this age obscure the Dao, pursuing embryonic breathing, unaware that such practices are minor arts, incapable of transforming bone and form.\n\nAs Ge Xianweng said:\n*\"Daoists are all fools,\nSeeking only embryonic breathing.\nHow could they know of the Purple Journey Elixir,\nThe path of ascending to heaven in broad daylight?\"*\n\nThe *Pi* Hexagram approaches, bringing joy to the heart, as the three yang lines retreat and return to yin. After the Yellow Sprout coalesces, flowers burst forth in competition; when green waters are added, the sea deepens of its own accord. In the *Pi* Hexagram, the three yang lines transform into yin, hence the return to yin. The Yellow Sprout becomes the Great Elixir, blooming like flowers in spring, naturally fragrant and red. The water of the sea is replenished, now half again as deep.",
      "overlap_context": "on matches that of all sages,\nAnd the adept, cherished and protected, ascends to the Nine Palaces.\nWhen the elixir reaches this point, the fire is at its zenith, the Dragon’s time past.\nThe inner and outer waters are balanced, the seas exhausted.\nAll sages guard and guide the adept toward the *wu* position—\nThe southern *Li* Palace, one of the Nine Palaces.\n\nThunder stills, lightning subsides, the azure sea runs dry,\nAnd the Dragon’s roar and Tiger’s struggle leave the crucible and vessel empty.",
      "start_char": 1235,
      "end_char": 2017,
      "start_sentence": 62,
      "end_sentence": 103,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.47632145881653,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\玄和子十二月卦金诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "解向室中权造化，却归尘里混光阴。 修丹之人於一室中，运用乾坤二卦，权握造化，生成丹药，如天地生产万物一般。 丹之后鼓行，功却在人问也。 因嗟久别当年侣，金鼎无缘何处寻。 谓常时同修丹之人，值干戈之后，久别不知音信，不能同缘，成其金鼎也。 观卦依希道已终，酉时符节恰分中。 酉时，是修丹经诀吉，当其中以亦后学。 酉八月也，六月当天地分中位也。 自知火候通玄妙，想得还丹满鼎红。 言火候既得玄妙，丹必然成，其红粉也。 处世岂能忧白发，住山偏解伏青龙。 既有红粉之丹，又何忧白发不再黑，居山得道，言解伏青龙成丹。 神仙志士虽言了，未断凡心不可穷。 云我此金丹候之诗，皆是神仙至诀，尽法俱已言了。 若几常之人，心生浮薄，未契道缘，不可穷道也。 剥卦轮还二气全，修丹到此号神仙。 谓五阴已还，阴阳将全，丹得到此，则神仙也。 玉堂春晏笼香霭，金鼎花红坼瑞莲。 玉堂即丹室也，金鼎即丹鼎也。 丹至此时，自然香风满室鼎，如新开红莲之状。 海浪自然澄碧水，夕阳容易泛流年。 阳火渐退，上水即添，澄静不动，时已夕阳，还丹火将中一年之候，故泛流年。 世人只贪红尘事，岂信玄中别有玄。 言世人但知名利财色为乐，岂知有大还丹也。 金丹从天运，有假为基地，於一中取，自然而成矣。 坤卦须知位已周，从他文火自迟留。 至十月，已十二位周匝，火已微细，纯阴结时，文火自迟留。 却将香简朝元斗，重整衣冠祝太立。 行水火阴阳，数已周足，运丹先生遂将香简，於坛上朝谢天地真灵，再祈星斗，固护丹宠，免有邪气侵也。 爱护炉寒方敢看，徘徊心想未尝休。 来晨礼谢开金鼎，紫粉霞光最上头。 至来日鼎寒，先焚香，礼供天地真仙，方开得见，其丹已成中最佳，飞上鼎盖，如紫粉色光明者，号紫游丹成矣。 玄和子十二月卦金诀竟",
      "translated_text": "Within the chamber, one temporarily commands the transformations of creation,\nYet returns to the dust to blend with the passing of time.\nThose who cultivate the Elixir, within a single room,\nManipulate the Qian and Kun Hexagrams, wielding the power of creation,\nGiving birth to the Elixir as heaven and earth bring forth the ten thousand things.\n\nOnce the Elixir’s drumbeat advances, its merit lies in human inquiry.\nLong have I sighed for companions of those bygone years—\nThe golden crucible, without karmic affinity, where now may it be found?\nThose who once practiced the Elixir together,\nAfter the turmoil of war, parted ways, their fates unknown,\nUnable to share the same affinity, to complete the golden crucible.\n\nThe *Guan* Hexagram nears its end, its Dao all but fulfilled,\nAt the hour of *you*, the tally and seal align at the center.\nThe hour of *you* marks the auspicious moment in the scriptures of Elixir cultivation,\nIts midpoint also serving as a guide for later learners.\n*You* is the eighth month, the sixth month the central position of heaven and earth.\n\nOnce the fire-timing attains its profound mystery,\nOne can envision the Elixir filling the crucible, crimson as dawn.\nWhen the fire-timing is mastered to its subtlety, the Elixir must form,\nIts red powder manifest.\n\nHow could one fret over graying hair in the world?\nDwelling in the mountains, one naturally subdues the Green Dragon.\nWith the red powder Elixir in hand, why fear hair that does not return to black?\nLiving in the mountains, attaining the Dao, one subdues the Green Dragon to refine the Elixir.\n\nThough immortals and aspirants may claim completion,\nWithout severing worldly desires, the Dao cannot be exhausted.\nThis poem on awaiting the Golden Elixir contains the ultimate secrets of immortals,\nAll methods fully expounded.\nYet if ordinary folk, their minds shallow and fickle,\nFail to align with the Dao’s affinity, they cannot fathom its depths.\n\nThe *Bo* Hexagram cycles, restoring the two qi in full—\nAt this stage of Elixir cultivation, one is called an immortal.\nWhen the five yin lines return, yin and yang near completion,\nThe Elixir perfected here is that of the immortal.\n\nThe Jade Hall, spring’s feast, enveloped in fragrant mist,\nThe golden crucible, its flowers red, unfolding like auspicious lotuses.\nThe Jade Hall is the Elixir chamber; the golden crucible, the Elixir furnace.\nAt this moment, the Elixir naturally fills the room and crucible with fragrant breezes,\nResembling newly bloomed red lotuses.\n\nThe sea’s waves naturally settle into emerald stillness,\nThe evening sun easily drifts with the passing years.\nYang fire gradually retreats, upper water replenished,\nCalm and unmoving, the time now evening.\nThe Elixir’s fire nears the midpoint of the year’s cycle, hence the drifting years.\n\nWorldly folk crave only the red dust of mundane affairs—\nHow could they believe there is yet another mystery within the mystery?\nThe Golden Elixir moves by heaven’s decree,\nTaking the false as its foundation,\nDrawing from the one within, it forms of itself.\n\nKnow that the *Kun* Hexagram’s positions have come full circle—\nBy the tenth month, all twelve positions are complete.\nThe fire now subtle, pure yin coalescing,\nThe civil fire lingers of its own accord.\n\nThen, holding the incense tablet, one faces the Dipper to pay homage,\nAdjusting robes and cap to offer prayers to the Supreme Ultimate.\nWhen the cycles of water and fire, yin and yang, are fulfilled,\nThe Elixir master, with incense in hand, ascends the altar,\nGiving thanks to the celestial spirits of heaven and earth,\nAnd once more entreating the stars to guard the Elixir’s favor,\nWarding off any encroaching malevolent qi.\n\nOnly when the furnace’s chill is carefully tended may one dare to look—\nAnxious thoughts linger, never ceasing.\nCome morning, after offering incense and paying homage to the immortals of heaven and earth,\nOne opens the golden crucible—\nAtop it, the Elixir has formed, finest of all,\nRising to the lid in a radiant purple glow,\nThis is the completion of the Purple Journey Elixir.\n\nThe *Xuanhezi’s* Twelve-Month Hexagram Secrets of the Golden Elixir conclude.",
      "overlap_context": "\"*\n\nThe *Pi* Hexagram approaches, bringing joy to the heart, as the three yang lines retreat and return to yin. After the Yellow Sprout coalesces, flowers burst forth in competition; when green waters are added, the sea deepens of its own accord. In the *Pi* Hexagram, the three yang lines transform into yin, hence the return to yin. The Yellow Sprout becomes the Great Elixir, blooming like flowers in spring, naturally fragrant and red. The water of the sea is replenished, now half again as deep.",
      "start_char": 2017,
      "end_char": 2730,
      "start_sentence": 104,
      "end_sentence": 136,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.045989274978638,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\玄和子十二月卦金诀.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}