{
  "source_id": "玄机直讲",
  "source_file": "chunked_daozang\\玄机直讲.json",
  "total_chunks": 9,
  "total_original_chars": 9711,
  "total_translated_chars": 55375,
  "total_translation_time": 284.4689748287201,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\玄机直讲.txt",
    "category": "藏外"
  },
  "full_translation": "**Direct Discourse on the Mysterious Mechanism: Two Treatises on the Fire Phases of Elixir Refinement**\n\nWhen first applying effort, one must not cling to *youwei*—all *youwei* belongs to the posterior heaven. Many in today’s Daoist schools fall into this error, and thus few in the world attain perfection. Yet one must also not fixate on *wuwei*, for *wuwei* leads to sterile emptiness. Many in today’s Buddhist schools succumb to this flaw, and thus few in the world become true disciples of the Buddha. The Way does not spread because the Way is not understood.\n\nThe initial work lies in extinguishing emotional attachments and sweeping away stray thoughts—this is the first step in laying the foundation and refining the self. Once the human heart is cleared, the celestial heart returns; once human desires are purified, celestial principle abides. Each day, first settle for an hour until body and mind are fully at peace, and the breath is harmonized. Then, gently close the eyes, lower the lids, and inwardly observe the space one *cun* and three *fen* between the heart below and the kidneys above—neither clinging nor abandoning, neither forgetting nor forcing, until all thoughts vanish and only the solitary spirit remains. This is called *zhengnian* (right mindfulness).\n\nAt this time, within this mindfulness, one is lively and free; within that *qi*, one is serene and buoyant. When exhaling, the breath rises without rushing the heart; when inhaling, it descends without disturbing the kidneys. With each opening and closing, each coming and going, after practicing for one or two weeks, naturally the fire of the two kidneys begins to steam, the *qi* of the cinnabar field warms, the breath regulates itself without effort, and the *qi* refines itself without cultivation. Once the *qi* and breath harmonize, they no longer rise or fall, come or go—this is *taixi* (embryonic breathing), *shenxi* (spiritual breathing), the true bellows and furnace, the return to the root and restoration of life, the Gate of the Mysterious Female, the root of heaven and earth.\n\nAt this stage, the *qi* is like a budding flower, like an embryo in the womb. Naturally, the true *qi* steams and nourishes the *ying* and *wei*, ascending from the *weilü*, piercing the *jiaji*, and rising to the *niwan*. It descends the Magpie Bridge, passes the Double Towers, reaches the Crimson Palace, and settles in the middle cinnabar field—this is the initial movement of the River Chariot. Yet when the *qi* arrives, the spirit is not yet complete; it is not yet the true movement, so one must not attend to it. Simply maintain gentle inward focus, guarding the central palace, and boundless vitality will arise—this is what is meant by \"nurturing the bud.\"\n\nAfter one or two months of practice, the spirit becomes ever more tranquil. With prolonged stillness, the *qi* grows ever more abundant—this is the work of spirit generating *qi* and *qi* generating spirit. After a hundred days or more, the essence and spirit flourish, the true *qi* gradually fills, and the gentle fire phase ensures ample blood and fluid. Naturally, *kan* and *li* unite in marriage, *qian* and *kun* converge, spirit merges with *qi*, and in an instant, the true *qi* blends into oneness. A gust of returning wind surges upward through the hundred vessels—this is the true movement of the River Chariot. If a single point of numinous light is felt in the cinnabar field, it is the Mysterious Pearl at the water’s depths, the Yellow Sprout within the earth.\n\nAt this time, the first yang returns, as if the red sun rises over the azure sea—misty and hazy, now hidden, now visible—then lead-fire is born. Before *qian* and *kun*, *kan* and *li* unite, in the emptiness and stillness, the spirit congeals at the center. With uninterrupted effort, all is forged into one—this is the alignment of the Five Phases. When water and fire interact, the second phase of gathering begins; the River Chariot reverses its course, and in the fourth phase, the medicine is obtained. The spirit dwells within, the elixir’s light never departs—this is the Great Celestial Cycle, the practice of the Ninefold Great Return.\n\nAt this stage, a single drop of utmost yang essence congeals within, concealed in the moment when desires are stilled and emotions are extinguished. It takes form and shape. Having reached this state, the breath rests in the embryo, and inner and outer nurturing proceed without the slightest lapse—this is also called the ten-month work.\n\nThe work of stillness lies in every moment, and within each moment, the efforts of refining essence into *qi*, *qi* into spirit, and spirit into emptiness are present—not only in the ten months. Even within an hour, a day, a month, or a year, it is the same. Sitting with eyes closed, gathering the spirit, calming the heart, and regulating the breath—this is the work of refining essence into *qi*. Turning the light inward, focusing the spirit in the elixir chamber, allowing the true breath to come and go, with stillness reaching its extreme and movement arising from it—this is the work of refining *qi* into spirit. When the true *qi* returns to the origin, yin and yang reverse and unite, and after one round of intercourse, the wind calms and the waves subside. At this time, fixing right mindfulness in the cinnabar field is the sealing of the fire phase.\n\nPracticing these three stages of work over days, months, and years, one not only enters the ten-month gestation. Thus it is said: in every moment of practice, there is a Celestial Cycle for that moment; in every hour, day, month, or year of practice, there is a Celestial Cycle for that hour, day, month, or year. Yet within a single moment, the first half is warmth, advancing the fire, the full moon, the waxing crescent, the dawn of *zhun*, spring and summer; the latter half is coolness, retreating the tally, the new moon, the waning crescent, the dusk of *meng*, autumn and winter. An hour is divided into four upper and four lower moments, and the same applies to a day, a month, or a year. This is the gathering of yin and yang, the Five Phases—one moment’s work seizes a year’s climate.\n\nAt this point, one attains true emptiness and true stillness. After one or two years, or even ten or a hundred, shattering the void to merge with the Great Void—this is the work of refining spirit into emptiness.\n\nOnce the ten-month work is complete, one must constantly tend to the infant. Step by step, mile by mile, gradually emerging—if one is careless or unrestrained, one may become lost and unable to return. The immortal scriptures say: \"The spirit enters the *qi* to form the embryo; the *qi* returns to the spirit to congeal the elixir\"—this is the single point descending into the Yellow Court.\n\nThose with fewer distracting thoughts attain the elixir sooner, while those with many attain it later. This method is simple and easy, yet people lack the courage to practice it boldly. If one can persist in solitary practice over time, one will surely penetrate metal and stone, tread fire and water, and traverse heaven and earth. With further accumulation of merit and virtuous deeds, refining and ingesting the great elixir of spirit and cinnabar, one will attain perfection of both form and spirit, ascend in broad daylight, and elevate one’s entire household—this depends entirely on the depth of one’s merit and cultivation. If one does not ingest the spirit elixir but instead allows the yang spirit to ascend on its own, looking back at one’s former body as but a heap of dust, one may still take flight in daylight, abide for ten thousand kalpas, and share the eternal spring of the cosmos.\n\n**On the Verification of the Return**\nThe method of seven returns and nine reversions begins with practice. First, guide the true yin within the yang of the upper aperture into the inner golden crucible of the *qi* sea, where it unites with the true yang of the lower aperture. The true yin governed by yang is none other than one’s original spirit, belonging to the three *hun*; the true yang of the lower aperture is the original *qi* within the body, belonging to the seven *po*. Once these two *qi* merge, Kan and Li naturally conjoin, *hun* and *po* intermingle, spirit and *qi* coagulate, and the embryo stabilizes. Daily, one experiences the joy and pleasure of external union between husband and wife—yet one must not become attached. When water and fire achieve mutual balance, they circulate through the four limbs like an external flame kindling a blaze. Maintaining equilibrium between water and fire constitutes the minor celestial orbit. As the fire’s timing harmonizes and its vapors rise, the breath reverses into the original sea, the external yang naturally enters within, and the true fire spontaneously surges upward. The entire body softens and relaxes, suffused with boundless delight. Within the abdomen, the living dragon stirs, ascending and descending, undergoing dozens of transformations each day. The infant boy and the maiden naturally unite—this is the stage of gathering yin to replenish yang.\n\nRefining the jade fluid and returning the elixir begins with laying the foundation and refining the self, accumulating inner dharmic wealth. One abides in carefree ease, day and night perpetually luminous—this is the first step toward longevity and enduring vision. Ordinary people rely on the five grains to sustain life; going without food for several days, they perish from *qi* starvation. If one’s lower origin is depleted in old age...\n\nThe bones and marrow both hollow, unable to withstand the *qi* of the five grains, then *qi* weakens and illness arises. Thus, the five grains can nourish a person, yet they can also kill. If one masters the union of inner and outer, with water and fire in harmony, *qi* and blood flowing in reverse, the *qi* of the five viscera converging, and the spleen and stomach open and unobstructed, then food entering the abdomen can also transform into *qi*, generate essence, and nourish the spirit.\n\nShould one truly grasp the celestial mechanism at the outset, waiting until the marrow fills to overflowing and the abdomen swells like that of a pregnant woman—though no fetal form appears, only *qi* replete, essence abundant, and spirit complete—then, with these three in fullness, the true fire refines, the spirit is harmonized, and the void is cultivated. This is the moment when the great man’s work is accomplished and his name established.\n\nI urge seekers to visit and inquire of lineage masters, earnestly seeking the perfected ones to reveal the celestial mechanisms within and without the body. Clearly understand the swift method of beginning practice, refine the self and await the moment, waiting for the arrival of the solitary yang. Choose a secluded place and enter the chamber to refine this great elixir of dragon and tiger.\n\nIt is essential to find a quiet place where no crow of rooster nor bark of dog can be heard, and outside, only fellow adepts of the Dao should be present—no idle or unrelated person should approach, lest the primordial spirit be startled and scattered. Earlier, I spoke of harmonizing with the world and blending with the dust; now, I speak of seclusion—why? Refine the self amid the mundane, nurture *qi* in the mountains and forests; this is the time to enter the chamber and commence the work, to begin the practice.\n\nTo transcend the ordinary and enter sainthood is no small matter. One must be unstained by a single speck of dust, all concerns forgotten, not a thread of attachment remaining, cutting cleanly as with a blade, forever a stranger in this land, with no thought of retreat or regret. Hold to emptiness to refine the spirit, guard the void to cultivate nature. The five viscera, sinews, bones, *qi*, and blood of the entire body all transform into azure *qi*. With single-minded devotion, train the spirit to purity, shaping it to be commanded. As stars revolve and the Dipper turns, it changes at will. Nurture it until the entire body is free of wrinkles, like a spider’s form, with the seven orifices above radiating light, luminous day and night. When the body becomes like the Great Void, only then is it the proper time to seek the immortal Dao.\n\nThis verifies that *qi* is full and spirit complete. Only with vast dharmic wealth can the great elixir be refined—this is what makes one a true elixir adept. When the work is attained, the time naturally arrives. The seven orifices radiate light, the three yangs flourish, the spirit-sword takes form. Seizing the moment like sailing with the wind and tide, the fire is ignited with thunderous roars and lightning flashes. Only then can one seize the celestial mechanism without, begin the work of capture, gather the true lead beyond the body, wed the dragon to the tiger, and drive the tiger to the dragon.\n\nIf one can gather and cluster without missing the proper timing, serenely draw up the gold from the sea’s depths, open the spine’s pass, ascend to the Mud Pill Palace, and descend into the Crystal Palace, where it unites with the Wood Mercury—within half a moment, the clustering is complete. The true fire surges into the four limbs, and the entire body’s bones feel as if scorched by fire or sliced by a blade, most difficult to endure. Even the staunchest hero, at this point, has not a shred of composure left.\n\nGuard against danger and contemplate peril, bathing body and mind in ice, achieving harmony of water and fire. In an instant, the entire body feels like exploding beans, all at once bursting open. The *qi* and blood of the whole body coalesce into form and speech, clamoring as one within. Beneath the root of the tongue lie two cavities: the left is the Elixir Well, the right the Stone Spring—this is precisely the Lianquan point. As the bone meridians open, kidney water surges upward like an external spring, impossible to swallow completely, its flavor most extraordinary, unlike sugar or honey.\n\nYet the most wondrous moment comes at the very beginning of tending the furnace and commencing the work: the earth is about to yield its golden lotus, the heavens to bestow their precious dew. Suddenly, a single drop of true mercury descends, piercing the heart like icy coolness. Immediately, a spark of spirit-fire follows, clustering within the Chamber of Union. Serene and profound, it resounds like a thousand drums in battle, a myriad thunderclaps roaring. This is the transformation of the hundred meridians, *qi*, blood, and heart within one’s own body—do not be alarmed. Simply tread the steps of the Dipper, wield the sword, and grasp the seal. Here lies the most perilous point: three revolutions, nine turns, subduing generals and summoning marshals. Be vigilant in guarding this space.\n\nIn the void, one may witness dragons and tigers mating, heaven and earth in harmony, the sun and moon conjoined in their palaces, or see hosts of immortals and buddhas. When the work reaches this stage, myriad visions appear—take care not to mistake them for reality, lest external demons take hold. Once the primordial spirit is recognized and mercury and lead unite, after three days the great medicine is born. These three days are the most difficult to endure: the entire world becomes a realm of demonic illusions, spirits wailing and ghosts weeping on all sides, baleful *qi* and warlike smoke in every direction. This is the great work of opening the passes. Nine out of ten are terrified to death at this stage, but the heart must harbor no fear. Though the self has transformed into spirit, it remains a yin spirit, and yin spirits are most cunning, capable of endless transformations. How could they willingly submit to being subdued by mere kindness?\n\nAs the ancients said:\n*\"Only when you master the six penetrations can you escape birth and death;\nIf you do not master the six penetrations, do not dream of attaining the Dao amid chaos.\"*\n\nAfter thirty hours—two and a half days—*qi* communicates with *qi*, filling to the utmost. Suddenly, a vibrant, living pearl of solar radiance bursts forth, shedding its husk and entering the mouth. A hundred thousand dragon spirits are all startled. This is the true yang elixir of primordial yang. Only upon taking it into the mouth does one realize that one’s fate is not ruled by heaven.\n\nThe ancient immortals said:\n*\"This time, great death brings ten thousand lives,\"*\nand\n*\"One battle and the world is pacified.\"*\nThis is precisely that stage—where heaven and earth harmonize, the sun and moon conjoin in their palaces.\n\nWhen the medicine of true yang reaches the mouth, in an instant the fire of the celestial circuit ignites. The bone embryo dissolves into a mass of fleshly mud, the yang spirit leaves the body, and the hands are unbound without hindrance. With single-minded devotion, hold to emptiness and nurture the void, with emptiness nurture the spirit, with void nurture the heart. Transform the spirit at will.\n\nAll things under heaven are born of heaven and earth, and the myriad spirits pay homage in submission. Weary of dwelling in the dusty world, one roams freely to Penglai Isle, where three thousand jade maidens attend in service. Daily at the banquet of immortal peaches, one drinks celestial wine, wears celestial flowers, and becomes thoroughly intoxicated in all four limbs, the body entirely translucent. The tortoise and serpent emerge from the sea’s depths, and the myriad spirits receive their commands—this is the true inversion of lead and mercury, the body enveloped in purple mist and radiant beams, auspicious qi streaming in a thousand threads. This is the Great Hibernation of the Five Dragons.\n\nRefine it for a hundred days, and the Mysterious Pass opens of itself; the Infant appears in form, the tortoise and serpent emerge naturally and coil about. Only at this stage can the adept’s mouth obtain the external mercury.\n\nRefine it for six months, and the body becomes like silver paste, the blood transforms into white nectar, the whole body exudes a fragrance that assails others, and the breath from the mouth forms clouds. This is the maturation of the numinous elixir, a single grain of living mercury. One who consumes it never dies and can even revive the dead.\n\nRefine it for ten months, and the yang spirit departs the body, one form able to transform into ten thousand. Only await the twelfth month to seize the full tally of heaven and earth. Once the yang spirit is complete, it moves freely in and out of the body, and the fourteen thousand yang spirits step without shadow beneath the sun and moon, pass through metal and stone without hindrance, enter water without drowning, enter fire without burning, remain unscathed by blades and weapons, and elude the perception of ghosts and spirits. With endless transformations, one has become a true person. The qi and climate of the entire body are nothing but true medicine: a chicken that eats it becomes a phoenix, a dog that consumes it becomes a dragon. This principle is so profound that even ghosts and spirits find it difficult to comprehend. Without having encountered such words, one would surely not believe in the great elixir of golden cinnabar.\n\nThe work of creation and transformation undergoes three revolutions and nine cycles, seven returns and eight restorations. The firing times are subtle, the oral instructions for gathering and assembling take only three to five days to overturn heaven and earth entirely. All is natural, and the yin-yang creation within the human body is also natural. Only by embodying the creation and transformation of heaven and earth can one achieve success. Matters must be experienced and tested until they reach the state of naturalness. Though the work spans a year, the subtleties of the firing times lie within a hundred days, and the perilous moments of movement and stillness occur within just a few days. In an instant, internal and external are gathered and assembled, and in a moment of clarity, the sacred embryo is accomplished. Producing a pearl the size of a millet grain, one swallows it into the abdomen, and when the fire of the celestial circuit is complete, the embryo is shed and the bones are transformed. One need only hold to emptiness and nurture the void; the rest follows naturally.\n\nIf one truly receives the guidance of an enlightened teacher, one first refines the self amid the dust of the world, accumulates lead in the marketplace, gathers years into months, and months into hours. The great stabilization occurs in a single instant, no more than half an hour, overturning heaven and earth entirely. After ten months of firing, one embodies the natural method of heaven and earth. If one cannot seek life within death, how can one escape the three great calamities?\n\n**On the Ingestion of the Great Elixir**\nThe salaries of the Three Clarities and the provisions of the Jade Emperor are bestowed only upon the former sages, worthies, and enlightened ones. How could one receive the ranks of such as Master Zhengyang, Immortal Ge, and Perfected Lord Yin—over a hundred in all—who all achieved the Dao before refining and ingesting the elixir to dispel confusion?\n\nThe ancient immortals said: *\"When the inner elixir is complete, the outer elixir is achieved.\"* This is the true transmission received by the ancients. First, one accumulates essence and amasses qi, gathering the inner and outer dharmic wealth. When the qi is full and the spirit complete, golden light appears, shining day and night without cease. Only then is the inner elixir of the body complete, and the outer elixir of the self also manifests.\n\nOne must not read books by matching them to diagrams like seeking a steed with a picture. Only when the light shines day and night without cease and the sprouts of the medicine have grown can the adept gather the external medicine of the self and pair it with the inner yin and yang. Only then can the golden elixir enter the mouth, the fire of the celestial circuit ignite, and in an instant, one becomes clear and unbound, shedding the golden cicada’s shell. Silently, one pays homage to the Supreme Emperor, encounters the immortal chariot, and receives celestial emoluments. The knife spirits pay obeisance, and one can mend heaven and earth, pluck stars and grasp the moon, command thunder and turn the Dipper, summon wind and call rain. With a single thought, the myriad spirits obey, and one views heaven and earth as if they were the palm of one’s hand. This fortune surpasses that of three generations of emperors, this wisdom exceeds that of seven generations of top scholars. Only at this time can one refine and ingest the golden elixir.\n\nThis elixir, like a grain of millet, when dropped to the ground, illuminates the sky with golden light—only then is it called the divine elixir. Without spiritual communion, how dare one speak of ingesting the outer elixir? This principle is profound, the celestial mechanism deep and distant. Gold begets gold, silver begets silver; there are no other numinous spirits beyond. This art of the yellow and white is not the gold and silver of the mortal world but the mother that restrains qi. Only with the true transmission can one produce the great medicine of primordial qi, recognize the yellow sprout and white frost—this is the yellow and white, the mother that restrains qi, with which one refines the divine elixir. All gold, silver, liquid medicines, and elixirs belong to the postnatal realm. Without knowing the true yin and true yang of the same kind, one will never succeed.\n\nAlas, the scholars of the world cannot distinguish true from false and do not encounter true teachers, engaging only in blind practice and reckless refinement. Those who truly cultivate life and destiny, if they have not yet met a true teacher, should quietly study books. The *Book of the Great Auspicious Divine Elixir* does not utter a single empty word or idle sentence. It is only that later generations fail to discern the heterodox from the orthodox and do not understand that the words of the sages and worthies are all hidden language and metaphors. They encounter mediocre teachers, cling to side doors, and harbor poisonous intentions with great ambition, lacking adaptability. Seeming right yet wrong, they exalt themselves as correct in voice and countenance.\n\nThose who repel others from a thousand *li* away will see lofty persons turn and depart—how much more the immortals and sages! Before encountering a true teacher, scholars should proceed with humility and caution. Accumulate merit and deeds, face demons without retreat, endure slander without anger, value the Dao and disdain wealth. Once they meet a true teacher, they should earnestly seek with single-minded devotion, who will reveal the two true inner and outer messages of the body, suddenly awakening their understanding of all books, so they are no longer deluded by others.\n\nIf one is a noble-minded gentleman with a sincere heart for destiny, sweeping aside all side doors, valuing the taming of the mind-monkey, reaffirming resolve and qi, humbling the heart and lowering the intent, enduring demonic trials and hardships, diligently seeking an enlightened teacher, and exhaustively pursuing the origin of the body’s first reception of qi—this \"origin\" is the primordial ancestral qi, which unites with a single point of true yang and true yin. Without true yang and true yin, born before heaven and earth, at the inception of the primordial chaos, this luminous millet-grain treasure pearl hangs in the void, radiant and resplendent. Yet without an enlightened teacher to point it out, one remains as if in a drunken dream; missing this single step, all else is but side doors.\n\nThis luminous treasure pearl, within the lightning of the void, encompasses all phenomena, conceals all existence, and gives rise to all things—all from this single grain. In the Daoist tradition, it is called true lead and true mercury. Once truly attained, one must not seek it in heaven and earth, sun and moon, or male and female, but only within the body’s inner and outer crucible and furnace, refining the self and upholding the heart. When principle is understood and nature is seen, the fire is gathered and ignited, and in less than half a moment, the millet-grain mystery pearl appears above the winding river. With a single dose of the elixir taken, in an instant, one aperture opens and a hundred meridians align; the entire body’s sinews and bones, the five viscera and flesh, all transform into qi, resembling external mercury. At this stage, a hundred days of fire cultivation bring wondrous efficacy. Once attained, there is no regression—abiding in the world, preserving form, refining spirit to return to the void, and uniting with the Dao.\n\nIn the Buddhist tradition, this is called true emptiness and the wondrous dharmakāya. With precise application, refining demons to see nature, in a brief moment, the true fire of samādhi arises, returning to the origin and restoring unity. The earth becomes treasure, radiant with myriad rays of light; the six supernatural powers of the correct eye manifest, forging the indestructible vajra body and accomplishing the unfathomable wonders beyond ghosts and spirits.\n\nIn the Confucian tradition, it is called the Supreme Ultimate born of the Non-Ultimate. Considering the external heaven and earth, the Non-Ultimate is the vast expanse surrounding heaven and earth before the separation of sun and moon, the four directions and above and below, a chaotic mist like yin fog and water vapor. Only when the time arrives and qi reaches fullness, clashing together, does the Supreme Ultimate emerge. At that moment, sun and moon are born, the clear and turbid separate—above becomes heaven, below becomes earth. Heaven’s clear qi is pure yang; earth’s turbid qi is pure yin. Rain and dew descend from heaven, for yang can generate yin; the myriad things arise from earth, for yin can generate yang. Heaven and earth are but emptiness, containing boundless and limitless potential. Heaven’s stars and deities, in their movements and revolutions, each hold their positions; earth’s myriad things, following the four seasons and eight solar terms, naturally arise—all, in essence, are but the void.\n\nThe sun and moon are the essence of heaven and earth, illuminating the thirty-three heavens above and the nine abysses and ten thousand springs below, revolving east and west, ascending and descending, cycling through cold and heat. The sun is a body of pure yang, containing a single point of true yin essence, belonging to the ancient dragon, the maiden, wood of *jia*, mercury, the golden horse, and the three *hun*—this is the outer. The moon is a body of pure yin, containing a single point of true yang qi, belonging to the white tiger, the infant, metal of *geng*, cinnabar, the jade hare, and the seven *po*—this is the inner. The human body’s creation mirrors heaven and earth, thus the human body also possesses a true sun and moon. The Dao is near—why seek it afar?\n\nThe three *hun* belong to nature, which resides at the edge of heaven; the seven *po* belong to destiny, which lies at the bottom of the sea. The inner and outer unite in the two words \"nature and destiny,\" resolving the myriad volumes of alchemical texts. Nature pertains to spirit and is yin; destiny pertains to qi and is yang. Thus it is said, \"One yin and one yang is called the Dao.\" The thousands of classics and volumes are but different names; yet true nature and destiny, along with illusory phenomena, remain unknown without true transmission.\n\nAncient immortals said, \"The four great elements of the body all belong to yin—what then is yang essence?\" They also said, \"Tears, saliva, essence, fluids, qi, blood, and marrow—these seven numinous substances all belong to it,\" yet these are but the turbid yin of postnatal dregs, not true yin. True yin and true yang stand in opposition; if true yin is unknown, how can true yang be known? Today’s scholars not only do not know true yang but also do not know true yin. If they knew true yin, they would surely know true yang. Without encountering an enlightened teacher, how could they ever fathom it?\n\nScholars must exhaustively pursue the wonders of the three talents—heaven, earth, and humanity—within the body, as well as the true crucible and furnace within and without, and the true messages of yin and yang within and without. Without grasping the essential meaning, upon seeing the various names in books, the mind lacks certainty, clinging to side doors without discernment. Without understanding principle, the heart remains unclear; with an unclear heart, one cannot see nature; without seeing nature, how can one reach destiny? The ancients said, \"Only because the golden elixir lacks oral instructions, where can you form the spiritual embryo?\"\n\nThe *Pointer to Ascending Heaven* states: The Dao generates heaven and earth, nurtures the myriad things. When released, it encompasses the void; when gathered, it retreats into secrecy. The Two Modes, sun and moon, and the Five Phases are but the transformations within the Dao.\n\nEach thing possesses a Supreme Ultimate—this is the Dao. Within every person’s heart lies the primordial, which is also the Dao. The Five Phases flow forward to give birth to humans and creatures; they reverse to produce immortals and buddhas. Thus it is said, “When the Five Phases flow forward, the dharma-realm becomes a fiery pit; when they reverse, the great earth yields its seven treasures.” The essence of the Five Phases is concealed in the secret place of the Four Great Form-Mountains, neither inside nor outside—merely what common folk use daily without awareness.\n\nThe people may be made to follow, for this is the forward flow; they cannot be made to know, for that is the reverse flow. Just as a fish in water does not recognize the power of water, a person within the qi-mechanism does not recognize the power of qi. This analogy should be pondered deeply: turn the light inward, reflect back, illuminate the mind and see nature—then to realize the fruit of immortality or buddhahood, what difficulty remains?\n\nYet today’s Dao-seekers, each one, sell their own cleverness, boast of their own cleverness, claim mastery—yet none awaken. There is also a class of shallow-rooted blind men who, upon seeing the sages speak of outer yin-yang, outer furnace and tripod, outer medicinal substances, fixate on women as the tripod-vessel—how lamentable! I have seen those who ardently pursue furnace-fire, yet none succeed. Some cite the Yellow Emperor casting nine tripods to attain the Dao and assume nine people must be used as tripods—how utterly mistaken! I have witnessed those who have passed through five or seven tripods yet achieved nothing.\n\nMoreover, with the first stirring of a thought, primordial simplicity scatters; once the primordial is lost, even if the later heaven remains, what benefit is there to body and mind? It merely sustains the Four Great for a time. Such fools—how could they know the marvel of heaven’s wordless operation, where the four seasons proceed and the hundred things arise!\n\nThe human body’s transformations mirror those of heaven and earth. Yet one does not know: how does heaven attain oneness to become clear? How does earth attain oneness to become tranquil? Nor does one know who presides over these transformations. If one can take clarity and stillness as essence, stability as foundation, the celestial mind as master, and original spirit as function—skillfully employing the thief-mechanism to return to primordial truth, return to the root and recover destiny—how could one not attain the sage’s position between heaven and earth?\n\nAs for the matter of using a literary tripod, there is no such principle. If a blessed practitioner meets a true teacher, they should first practice the Jade Fluid Returning Elixir, refine the self and harmonize the light, maintain and nurture, turn the light inward and reflect—this is the work of seeing nature and illuminating the mind. Having seen nature, one then seeks the higher work: the Golden Fluid Returning Elixir, where emotions return to nature, reaching the position of true emptiness. The great function manifests, the Dragon Girl offers a single precious pearl, and golden light appears—only then is there one attainment that becomes eternal.\n\nAt the juncture of *hai* and *zi*, between *bo* and *fu*, when the first stirring of the Great Yang begins, one’s hand explores the Moon Grotto, one’s foot treads the Celestial Root, and the returning wind merges—from this arises the wondrous efficacy of a hundred days’ work. This is the Golden Fluid Returning Elixir, the great Dao of yin-yang and the Five Phases.\n\nApart from the Jade Fluid and Golden Fluid, the dual cultivation of nature and destiny, and the Dao of clarity and spontaneity, all else are side doors and minor methods.\n\nI have established the furnace and tripod within and without the body, gathered the oral instructions on gathering and refining, and grasped the subtleties of medicinal substances and firing times. Yet without knowing the celestial dharma-measure, one enters the chamber, takes the outer medicine into the abdomen for the great work, and begins the firing practice. At the secret place, the empty void’s myriad spirits pay homage, and immortal music plays above the crown—this matter is too profound for even gods and ghosts to comprehend. Alas, because one has not refined the self amid worldly dust, nor accumulated lead in the marketplace, the qi-channels are not yet fully stabilized, the foundation is not yet complete in three aspects, the principle is understood but nature remains unseen—thus myriad phenomena arise dangerously. The heart-spirit is unsettled, unable to take command. Moreover, without knowing companions or Dao-friends outside to protect and guard, one is startled by sounds and sights, the original spirit scatters, the tripod overturns, the furnace flips, the Heart-Monkey falters, the Intent-Horse flees, spirit does not guard the abode, qi does not return to the origin—one encounters yin-demons.\n\nWhat are yin-demons? I will not elaborate here, but later learners do not know: once true yang scatters, yin qi takes control. Day and night within the body, spirits and ghosts cause harm. Whether eyes are open or closed, one sees ghosts and spirits coming and going; even in the ears, one hears their clamor. By day, one may still endure, but at night it is most unbearable—one cannot remain still for a moment. The life-master in the Sea of Qi, the *dui*-metal’s *wu*-earth, surges back, and the five viscera’s qi and blood all rise upward. The body lifts, no longer touching the ground—this is truly the ghostly realm’s livelihood, leading to the destruction of body and life.\n\nI temporarily abandoned my previous efforts, followed my teacher’s guidance, concealed myself deeply in the marketplace, accumulated lead amid worldly dust, gathered emotions back to nature, and reversed the killing mechanism. From youth to old age, heaven, earth, and beings had stolen my primordial truth—now, within the formless and amidst worldly dust, I must seize and steal it back into my celestial nature. Only then are the Three Originals—original essence, original qi, original spirit—complete. Only then are the heart illuminated, principle understood, nature seen, body and mind stabilized, and the Five Phases gathered. Only then can one proceed to the highest work and complete the great Dao.\n\nReflecting on the worthy sages of former times, many abandoned their path midway, all because they had not refined the self and stabilized the heart, nor brought metal back to nature. Thus, in the second phase of obtaining the medicine, during the fourth phase of advancing the fire, not knowing the celestial dharma-measure and acting carelessly, even White Jade Toad lamented, “Again I must cut the autumn bamboo’s joints.”\n\nWho knows the subtleties of the empty void—how perilous, how fierce, how malevolent? If one cannot seize and control it, it will certainly not spare you. If a learner clearly understands the two true messages within and without the body, without obstruction, then proceeds to maintain and nurture, eliminate self-centeredness, and restore celestial principle—then the work of returning the elixir becomes most simple and easy.\n\nAll day long they gather the yellow sprouts beyond their body, awaiting the celestial jade nectar—this is precisely the wondrous awakening of \"drinking wine and wearing flowers\" to attain immortality. Yet in the matter of Primordial Unity, there is no intention, no insistence, no fixation, no self; whether living or dying, one forgets both people and things, like an idle wanderer who neglects livelihood, roaming streets and alleys all day, delighting in sights and soothing the heart, sitting vacant in brothels and taverns, wordless and unmoving—how could this not astonish and perplex the world! To gather the environment and accumulate lead, employing both method and wealth—how could this not invite the ridicule and slander of the vulgar!\n\nThus, one must rely on powerful families in great cities for external protection, preserving the Dao in daily practice while concealing one’s light and obscuring one’s traces. As the ancient immortals said: *\"To covet the treasure of heaven, one must use the wealth of the world.\"* Yet the \"treasure of heaven\" does not refer to the vault of the blue sky—it is the abode of the Nine Yang Cauldron within our own body. Thus, the Yellow Emperor cast the Nine Tripods and ascended. Deluded fools of this world, upon hearing the phrase \"treasure of heaven,\" cling to the sun and moon in the sky as water and fire, waiting for the moon to rise in the west to gather its degrees with their eyes, calling it true water and true lead; or at sunrise in the east, they likewise collect it with their gaze, calling it true fire and true mercury.\n\nYet heaven above and earth below, Qian and Kun, Kan and Li, the inner and outer furnaces of male and female—these are all metaphors for the inner and outer yin and yang of our own body, without any actual form of male or female. As the ancient immortals said: *\"All that has form is but illusion.\"* The returning elixir has no substance—how profound and exhaustive are these words!\n\nThose in the world who cultivate goodness never do harm to others for personal gain. What men and women in the universe rely upon to live without dying is nothing but this single point of yang essence. How could those who seek immortality steal a woman’s essence to benefit their own body? How would this differ from those who kill? The earlier sages spoke of \"that household’s male and female,\" \"the two families and two nations,\" and \"the inner and outer furnaces\"—if one does not receive the correct transmission, how few would not mistake their meaning!\n\nI once met an enlightened teacher who, through direct instruction, revealed the two true messages within and beyond the void. Not daring to keep this secret for myself, I transgress the prohibitions to pass it on, unfolding the creation of heaven, earth, and humanity within the body. The Three Teachings’ scriptures, the medicines and firing times, the conjunctions of sun and moon, the measures of fullness—all are laid bare. No texts are established; only true words are spoken, so that learners may avoid the errors of misguided practice.\n\nWherever this book resides, spiritual beings guard it. If those without affinity encounter it, it will be no more than blind recitation. The Great Dao of the Golden Elixir is rarely met even in ten thousand kalpas—*\"trampled straw sandals find no trace, yet it comes with no effort at all.\"* If learners can truly nurture it amid haste, turmoil, displacement, and hardship, preserving this square inch of the heart without loss, then the celestial principle is restored. Once the celestial principle is restored, then seeking the matter of the superior external medicine entering the abdomen becomes instantaneous—suddenly, one is serene, shedding the mortal coil and changing bones, wholly transformed into a single golden light, the great earth becoming treasure. A body is born beyond the body, the yang spirit leaves the form, nurtured in emptiness and void—this is the Great Hibernation of the Five Dragons, attaining boundless freedom, transcending the three kalpas of wind, water, and fire, no longer subject to birth, aging, sickness, death, or suffering.\n\nYet people today do not cultivate practice, instead coveting external elixirs of furnace and fire to consume—this is the height of delusion.\n\n**Commentary on the *Nine Augusts’ Elixir Canon: Dragon-Tiger Lead-Mercury Treatise***\nThe Daoist Lord’s discourse on the extraction and replenishment of dragon-tiger lead and mercury is meant for those of the future with roots and affinity to begin here. Though it is said, *\"Only immortals can become immortals,\"* I insist: *\"Even mortals can become immortals.\"* The only fear is not understanding the principle of the Golden Elixir—then one falls into hell as a beast.\n\nThis dragon belongs to yang; once yang is lost, all becomes yin. This tiger belongs to yin; yet within yin’s treasure lies a single yang. The dragon is the mysterious pass of my own body; the tiger is the mysterious gate of the other. The dragon is lascivious, but I do not leak—adding a drop of water to a speck of earth forms the character *yao* (瑶), becoming the supreme treasure of jade liquid. The tiger is voracious, but I do not leak—adding the character *jian* (柬) to *zhen* (真) forms *lian* (炼), gathering the supreme treasure of golden liquid.\n\nTiger, tiger, tiger—no matter how you bare your fangs and gape your jaws, striking terror into souls, I have the art of taming tigers, reducing you to emptiness within form and form within emptiness. With a single play of the dragon, you become the meeting of dragon and tiger in wind and cloud—I need not fear you will not yield the tiger’s cub from your den, entering my three fields.\n\nDragon, dragon, dragon—no matter how lustful you are, I have the art of subduing dragons. No matter how endless your transformations, I use Nezha’s vajra ring to bind you, drawing your sinews into a golden belt for nurturing nature and connecting life, worn always. I need not fear you will not go before the True Person of the Great Ultimate to beg for the unparalleled Dharma-door of the True One, merging with me into the Great Dao of Primordial Unity.\n\nLead is the lead of the two crescents; mercury is the mercury of heaven and earth within my body. With the radiance of sun and moon, heaven and earth become Earth-Heaven Peace, not Heaven-Earth Obstruction. Since birth from our parents, we originally possess one mercury and one lead—the principle of male-female union. Thus it is said: *\"Qian is father, Kun is mother; male and female unite their essence, and the myriad things transform into purity.\"* The *Book of Changes* is the Great Ultimate of the primordial. If one does not understand this principle, merely casting mercury into lead, one begets sons and daughters; but casting lead into mercury, one becomes a Buddha or immortal.\n\nThe iron steamed bun can be shattered—how then could the Three Peaks within Three Peaks be unattainable?\n\n**Annotation on Lü Zu’s *Hundred-Character Stele*:**\n\n**Nurture qi and forget speech; guard the One.**\nAll who cultivate the Way must first nurture qi.\nThe method of nurturing qi lies in forgetting the ancient temple’s One.\nForget speech, and qi does not scatter; guard the One, and spirit does not depart.\nThe secret says: *\"Seal the tongue and still the mind; embrace spirit and settle intent.\"*\n\n**Subdue the heart to act without acting.**\nThe human heart is ever restless.\nFor the cultivator, stilling the heart is paramount—this is achieved by mastering the two eyes.\nThe eyes are the gates of the heart; one must lower the lids and seal the orifices.\nAll matters are governed by the heart as a sword: reflect that worldly affairs bring no benefit, and like a raging fire, they are instantly extinguished—do not cling to them.\nThe secret says: *\"With the eyes gaze at the nose, with the nose gaze at the navel; above and below attend to one another, the mind’s point abides in unity. Focus intent on the Mysterious Pass, and thoughts are subdued.\"*\n\n**In movement and stillness, know the Ancestral Origin.**\nMovement and stillness are the interplay of yin and yang.\nThe Ancestral Origin is the source of one’s birth.\nThe cultivator must know that before parents gave form, there was the Mystery of Transformation.\nFrom head to foot, the body is the great robe of Qian and Kun; the convergence of the Five Phases and Four Images is the state before Heaven and Earth divided—a single luminous spark formed the Great Ultimate.\nBelow the heart and above the kidneys, within the indistinct space where thoughts arise without cease—this is the Ancestral Origin.\nMovement and stillness mean harmonizing true qi and settling the true origin.\nExhaling connects to the Heavenly Root; inhaling connects to the Earthly Root—closing the gate is Kun, opening the gate is Qian.\nOn exhalation, the dragon roars and clouds arise; on inhalation, the tiger howls and wind is born.\nWith each opening and closing, movement and stillness, the heart’s intent remains unmoved, allowing true breath to come and go, continuous as if present.\nRefine the breath until it becomes the breath of no-breath, forged into oneness—then spirit may congeal, and the elixir may be achieved.\n\n**Why seek another when nothing remains to be done?**\nIf one can nurture qi, forget speech, and guard the One, subduing body and mind so that spirit returns to the Cavern Chamber, intent fixed within the compass, merging into a single mystery—like a hen brooding an egg, like a dragon nurturing its pearl, ever present, never departing—then with time and deep practice, naturally the millet-grain pearl will appear, radiant as the sun, silently transforming the original spirit, its numinous clarity unfathomable. This is it.\n\n**The True Constant must respond to things; in responding, do not be deluded.**\nThis Dao is the True Constant, yet in engaging with affairs, one is easily bewildered. Thus, in meeting the world, one must not be lost in mundane matters.\nIf one does not engage, one falls into emptiness and void.\nOne must respond when things arise and let them go when they depart.\nTo be upright and luminous is to avoid delusion; the true nature is pure and still, the original spirit congealed.\nThe secret says: *\"Intent misplaced, all is error; non-action falls into emptiness. When the nature is not deluded, it abides; when the nature abides, qi naturally returns.\"*\n\nThe human nature is fierce as fire—joy, anger, sorrow, and delight; love, aversion, desire, and hatred—ever-changing, shifting without constancy. At the slightest provocation, false thoughts arise, making it difficult to still the nature.\nOne must truly restrain anger, and fire descends; truly reduce desire, and water ascends.\nWhen the body does not move, this is refining essence; refining essence makes the tiger roar, and the original spirit solidifies.\nWhen the heart does not move, this is refining qi; refining qi makes the dragon sing, and the original qi is preserved.\nWhen intent does not move, this is refining spirit; refining spirit makes the two qi merge, the Three Origins blend, and the original qi naturally returns.\nThe Three Origins are essence, qi, and spirit; the two qi are yin and yang.\nWhen the cultivator responds to things without delusion, the original spirit returns of itself, and the true nature abides.\nWhen the nature abides, the body’s precelestial qi returns, life is restored to its root—what difficulty remains?\nThe secret says: *\"Turn the light inward, focus the mind within; inner thoughts do not stray out, outer thoughts do not enter. When qi returns, the elixir forms of itself; within the crucible, Kan and Li unite.\"*\n\nWhen the cultivator’s nature is not deluded by worldly affairs, qi returns of itself. Then one witnesses the two vapors ascending and descending in the Central Palace, yin and yang uniting in the elixir crucible. Suddenly, a thread of hot qi from the kidneys surges into the heart’s palace, passion returns to nature—like husband and wife in union, enraptured and intoxicated.\nThe two qi intertwine, forming the elixir’s substance, as water and fire in the Cavern Chamber intermingle in endless circulation. Then spirit rides the qi, and qi lodges in form—no need for miscellaneous arts to attain longevity.\nThe secret says: *\"The three treasures—ears, eyes, and mouth—seal and do not let them open. The true person lurks in the deep abyss, floating and wandering, guarding the compass within.\"*\nUntil the qi fills the Cinnabar Field and the *daogui* is formed.\n\n**Yin and yang reverse their flow, and a thunderous transformation resounds.**\nAt this stage, spirit does not stray outward, qi does not leak away. Spirit returns to the Cavern Chamber, Kan and Li have merged. With ever-greater vigor and dedication, one reaches the utmost emptiness and guards stillness with utmost sincerity. The body is still within the profound darkness, the heart is clear in the realm of nothingness—then true breath abides of itself, the hundred vessels cease their movement, the sun and moon halt their passage, the Jade Pivot ceases to turn. The Great Ultimate is still and generates movement; yang arises in Kun of the southwest.\nKun is the abdomen, also called the Winding River.\nSuddenly, a luminous spark the size of a millet grain appears—this is the sign of the medicine’s birth.\nA brilliant light shines through; the two kidneys boil like a cauldron, the bladder burns like fire. Within the abdomen, the roar of a fierce wind; within the belly, the sound of thunder.\nThis is the Heavenly Root of the *Fu* hexagram manifesting.\nWhen the Heavenly Root appears, stir the heart’s five with spirit to assist it—then the medicine blazes like fire through metal, ascending to pierce the *weilu*. Lightly guide it, silently raise it.\nA mass of harmonious qi, like thunder’s crash, ascends to the Mud Pill Palace, the whole body leaping—this is the *Guai* hexagram of Heaven and Wind.\n\nFrom the Moon Grotto to the Hall of Seals between the brows, primordial light leaks forth—this is the Supreme Polarity moving to generate yin. It transforms into divine water, sweet dew, within which a millet-grain pearl descends into the Yellow Court. There it touches the numinous mercury within *Li*, forging the body of the sacred form, completing one cycle of the celestial fire’s timing. Steep it, refine it. The elixir coalesces of itself.\n\nWhite clouds gather at the crown; sweet dew sprinkles Mount Sumeru. At this stage, the medicine is attained. The two qi congeal into a *daogui*; the passes and orifices open. Fire descends, water ascends—one stream circulates. From the Supreme Polarity’s movement, the Heavenly Root passes the Dark Valley Pass, ascends the twenty-four vertebral joints, reaches the Heavenly Valley Pass. At the Moon Grotto, yin arises, fragrant and sweet, descending the Tower of Nine Stories without cease—this is called *Sweet Dew Sprinkles Mount Sumeru*.\n\nThe formula says: When the mouth is full of sweet dew, send it with the eyes, receive it with the mind, guide it down to the elixir crucible, and congeal the primordial qi to nurture it. Drinking the Wine of Immortality oneself—who could know this freedom!\n\nAt this stage of nurturing qi, the joints have opened, and the divine water ceaselessly circulates up and down. In constant ebb and flow, it is swallowed from time to time—this is called the Wine of Immortality.\n\nThe formula says: Flowing pearls irrigate and nourish the numinous root’s nature—does the cultivator know or not?\n\nSitting, one hears the music of no-strings; the mechanism of creation and transformation becomes lucid. At this level of practice, the ears catch the strains of celestial music, the rhythms of bells and drums. The five qi pay homage to the origin; the three flowers gather at the crown, like evening crows alighting. The heart’s field opens, wisdom arises of itself, the scriptures of the Three Teachings become clear. One silently comprehends the roots of past lives, foresees future fortunes and misfortunes. The great earth and mountains and rivers lie in the palm of the hand; the gaze spans ten thousand miles. The six penetrations’ wonders are attained—this is no illusion.\n\nI have truly reached this stage in my practice. Were I to speak falsely and mislead later learners, Heaven would surely punish me. To encounter this and not practice incurs heavenly retribution. Without meeting a teacher, this matter is difficult to know.\n\nIn all, twenty verses—truly the ladder to Heaven. From *Nurturing Qi, Forgetting Words* to these twenty verses, all are the authentic oral formulas of Ancestor Lü, without a trace of falsehood, the very steps to ascend to Heaven in cultivation.\n\nThose who awaken to this formula and its commentary should hasten to practice it. Do not recklessly leak it, nor show it to the unworthy, lest you incur heavenly retribution. Cherish and uphold it, and you will ascend to the Heavenly Palace.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玄机直讲 炼丹火候说二篇 夫功夫下手，不可执于有为，有为都是后天，今之道门，多流此弊，故世间罕全真； 亦不可着于无为，无为便落顽空，今之释门，多中此弊，故天下少佛子。 此道之不行。 由于道之不明也。 初功在寂灭情缘，扫除杂念，除杂念是第一着筑基炼己之功也。 人心既除，则天心来复； 人欲既净，则天理常存。 每日先静一时，待身心都安定了，气息都和平了，始将双目微闭，垂帘观照心下肾上一寸三分之间，不即不离，勿忘勿助，万念俱泯。 一灵独存。 谓之正念。 斯时也，于此念中，活活泼泼，于彼气中，悠悠扬扬，呼之至上，上不冲心，吸之至下，下不冲肾，一阖一辟，一来一往，行之一七、二七，自然渐渐两肾火蒸，丹田气暖，息不用调而自调，气不用炼而自炼。 气息既和，自然于上中下不出不入，无来无去，是为胎息，是为神息，是为真橐龠、真鼎炉，是为归根复命，是为玄牝之门、天地之根。 气到此时，如花方蕊，如胎方胞，自然真气熏蒸营卫，由尾闾，穿夹脊，升上泥丸。 下鹊桥，过重楼，至绎宫，而落于中丹田，是为河车初动，但气至而神朱全，非真动也，不可理他。 我只微微凝照，守于中宫，自有无穷生机，所谓养鄞鄂者此也。 行之一月、二月，我神益静。 静久则气益生，此为神生气、气生神之功也。 或百日，或百馀日，精神益长，真气渐充，温温火候，血水有馀，自然坎离交媾，乾坤会合，神融气畅，一霎时间，真气混合。 自有一阵回风上冲百脉，是为河车真动。 中间若有一点灵光觉在丹田，是为水底玄珠，土内黄芽。 尔时一阳来复，恍如红日初升，照于沧海之内。 如雾如烟。 若隐若见，则铅火生焉。 方其乾坤坎离末交，虚无寂灭，神凝于中。 功无间断，打成一团，是为五行配仑。 至若水火相交，二候采取，河车逆转，四候得药。 神居于内，丹光不离，谓之大周天，谓之行九转大还也。 此时一点至阳之精，凝结于中，隐藏于欲净情寂之时。 而有象有形。 到此地位，息住于胎，内外温养，顷刻无差，又谓之十月功夫也。 夫静功在一刻，一刻之中。 亦有炼精化气、炼气化神、炼神还虚之功夫在内，不独十月然也。 即一时一日、一月一年皆然。 坐下闭目存神，使心静息调。 即是炼精化气之功也； 回光返照，疑神丹穴，使真息往来。 内中静极而动。 动极而静。 无限天机，即是炼气化神之功也； 如此真气朝元，阴阳反复，交媾一番，自然风恬浪静。 我于此时将正念止于丹田，即是封固火候。 年月日时，久久行此三部功夫，不但入圜十月也。 故曰运之一刻有一刻之周天。 运之一时一日、一月一年即有一时一日、一月一年之周天也。 然一刻中，上半刻为温。 为进火。 为望，为上弦，为朝屯，为春夏； 下半刻为凉，为退符，为晦，为下弦，为暮蒙，为秋冬。 一时则有上四刻、下四刻之分，即一日一月一年，皆同。 此之谓攒簇阴阳五行，一刻之功夫夺一年之气候也。 到此乃是真空真静，或一二年至十年百年，打破虚空，与太虚同体，此为炼神还虚之功也。 前功十月既满，须时时照顾婴儿。 十步百步，千里万里，以渐而出，倘或放纵不禁，必致迷而不返。 仙经曰：\"神入气成胎，气归神结丹\"，所谓一点落黄庭是也。",
      "translated_text": "**Direct Discourse on the Mysterious Mechanism: Two Treatises on the Fire Phases of Elixir Refinement**\n\nWhen first applying effort, one must not cling to *youwei*—all *youwei* belongs to the posterior heaven. Many in today’s Daoist schools fall into this error, and thus few in the world attain perfection. Yet one must also not fixate on *wuwei*, for *wuwei* leads to sterile emptiness. Many in today’s Buddhist schools succumb to this flaw, and thus few in the world become true disciples of the Buddha. The Way does not spread because the Way is not understood.\n\nThe initial work lies in extinguishing emotional attachments and sweeping away stray thoughts—this is the first step in laying the foundation and refining the self. Once the human heart is cleared, the celestial heart returns; once human desires are purified, celestial principle abides. Each day, first settle for an hour until body and mind are fully at peace, and the breath is harmonized. Then, gently close the eyes, lower the lids, and inwardly observe the space one *cun* and three *fen* between the heart below and the kidneys above—neither clinging nor abandoning, neither forgetting nor forcing, until all thoughts vanish and only the solitary spirit remains. This is called *zhengnian* (right mindfulness).\n\nAt this time, within this mindfulness, one is lively and free; within that *qi*, one is serene and buoyant. When exhaling, the breath rises without rushing the heart; when inhaling, it descends without disturbing the kidneys. With each opening and closing, each coming and going, after practicing for one or two weeks, naturally the fire of the two kidneys begins to steam, the *qi* of the cinnabar field warms, the breath regulates itself without effort, and the *qi* refines itself without cultivation. Once the *qi* and breath harmonize, they no longer rise or fall, come or go—this is *taixi* (embryonic breathing), *shenxi* (spiritual breathing), the true bellows and furnace, the return to the root and restoration of life, the Gate of the Mysterious Female, the root of heaven and earth.\n\nAt this stage, the *qi* is like a budding flower, like an embryo in the womb. Naturally, the true *qi* steams and nourishes the *ying* and *wei*, ascending from the *weilü*, piercing the *jiaji*, and rising to the *niwan*. It descends the Magpie Bridge, passes the Double Towers, reaches the Crimson Palace, and settles in the middle cinnabar field—this is the initial movement of the River Chariot. Yet when the *qi* arrives, the spirit is not yet complete; it is not yet the true movement, so one must not attend to it. Simply maintain gentle inward focus, guarding the central palace, and boundless vitality will arise—this is what is meant by \"nurturing the bud.\"\n\nAfter one or two months of practice, the spirit becomes ever more tranquil. With prolonged stillness, the *qi* grows ever more abundant—this is the work of spirit generating *qi* and *qi* generating spirit. After a hundred days or more, the essence and spirit flourish, the true *qi* gradually fills, and the gentle fire phase ensures ample blood and fluid. Naturally, *kan* and *li* unite in marriage, *qian* and *kun* converge, spirit merges with *qi*, and in an instant, the true *qi* blends into oneness. A gust of returning wind surges upward through the hundred vessels—this is the true movement of the River Chariot. If a single point of numinous light is felt in the cinnabar field, it is the Mysterious Pearl at the water’s depths, the Yellow Sprout within the earth.\n\nAt this time, the first yang returns, as if the red sun rises over the azure sea—misty and hazy, now hidden, now visible—then lead-fire is born. Before *qian* and *kun*, *kan* and *li* unite, in the emptiness and stillness, the spirit congeals at the center. With uninterrupted effort, all is forged into one—this is the alignment of the Five Phases. When water and fire interact, the second phase of gathering begins; the River Chariot reverses its course, and in the fourth phase, the medicine is obtained. The spirit dwells within, the elixir’s light never departs—this is the Great Celestial Cycle, the practice of the Ninefold Great Return.\n\nAt this stage, a single drop of utmost yang essence congeals within, concealed in the moment when desires are stilled and emotions are extinguished. It takes form and shape. Having reached this state, the breath rests in the embryo, and inner and outer nurturing proceed without the slightest lapse—this is also called the ten-month work.\n\nThe work of stillness lies in every moment, and within each moment, the efforts of refining essence into *qi*, *qi* into spirit, and spirit into emptiness are present—not only in the ten months. Even within an hour, a day, a month, or a year, it is the same. Sitting with eyes closed, gathering the spirit, calming the heart, and regulating the breath—this is the work of refining essence into *qi*. Turning the light inward, focusing the spirit in the elixir chamber, allowing the true breath to come and go, with stillness reaching its extreme and movement arising from it—this is the work of refining *qi* into spirit. When the true *qi* returns to the origin, yin and yang reverse and unite, and after one round of intercourse, the wind calms and the waves subside. At this time, fixing right mindfulness in the cinnabar field is the sealing of the fire phase.\n\nPracticing these three stages of work over days, months, and years, one not only enters the ten-month gestation. Thus it is said: in every moment of practice, there is a Celestial Cycle for that moment; in every hour, day, month, or year of practice, there is a Celestial Cycle for that hour, day, month, or year. Yet within a single moment, the first half is warmth, advancing the fire, the full moon, the waxing crescent, the dawn of *zhun*, spring and summer; the latter half is coolness, retreating the tally, the new moon, the waning crescent, the dusk of *meng*, autumn and winter. An hour is divided into four upper and four lower moments, and the same applies to a day, a month, or a year. This is the gathering of yin and yang, the Five Phases—one moment’s work seizes a year’s climate.\n\nAt this point, one attains true emptiness and true stillness. After one or two years, or even ten or a hundred, shattering the void to merge with the Great Void—this is the work of refining spirit into emptiness.\n\nOnce the ten-month work is complete, one must constantly tend to the infant. Step by step, mile by mile, gradually emerging—if one is careless or unrestrained, one may become lost and unable to return. The immortal scriptures say: \"The spirit enters the *qi* to form the embryo; the *qi* returns to the spirit to congeal the elixir\"—this is the single point descending into the Yellow Court.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1234,
      "start_sentence": 0,
      "end_sentence": 55,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.93076419830322,
      "metadata": {
        "source_file": "dao\\藏外\\玄机直讲.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "但人杂念少者得丹早，杂念多者得丹迟。 此法简易，奈人不肯勇猛耳。 若能恒久行特，必然透金贯石，入水蹈火，通天达地。 再行积功累行，服炼神丹大药，必然形神俱妙，白昼飞升，全家拨宅，此又在功德之浅深何如耳。 设或不服神丹，只顾阳神冲举，回视旧骸，一堆尘土，夫亦白日羽翰。 万劫长存，可与宇宙同春者矣。 返还证验说 七返九还之法，下手兴功。 先将上窍阳里真阴，入内金鼎气海之中，与下窍真阳配合。 阳理真阴，即是自家元神，属三魂； 下窍真阳，即是身中元气，属七魄。 其先后二气一合。 则坎离自交，魂魄混合，神气凝结，胎总自定，每日如外夫妇交情美快，切不可着他，水火日然既济，发运四肢，如外火之生焰焰相似，只要水火均平，此是小周天。 火候调和熏蒸，喉息倒回元海，则外阳自然入内，真火自然上冲，浑身苏软，美快无穷，腹内如活龙动转升降，一日有数十样变化。 婴儿姹女，自然成合，此是采阴补阳一节。 修炼玉液还丹，即筑基炼己，积内法财，终日逍遥，昼夜常明，乃长生久视之初阶也。 世人常借五谷养命，数日不食，则气饥死矣； 若人年老，下元亏损。",
      "translated_text": "Those with fewer distracting thoughts attain the elixir sooner, while those with many attain it later. This method is simple and easy, yet people lack the courage to practice it boldly. If one can persist in solitary practice over time, one will surely penetrate metal and stone, tread fire and water, and traverse heaven and earth. With further accumulation of merit and virtuous deeds, refining and ingesting the great elixir of spirit and cinnabar, one will attain perfection of both form and spirit, ascend in broad daylight, and elevate one’s entire household—this depends entirely on the depth of one’s merit and cultivation. If one does not ingest the spirit elixir but instead allows the yang spirit to ascend on its own, looking back at one’s former body as but a heap of dust, one may still take flight in daylight, abide for ten thousand kalpas, and share the eternal spring of the cosmos.\n\n**On the Verification of the Return**\nThe method of seven returns and nine reversions begins with practice. First, guide the true yin within the yang of the upper aperture into the inner golden crucible of the *qi* sea, where it unites with the true yang of the lower aperture. The true yin governed by yang is none other than one’s original spirit, belonging to the three *hun*; the true yang of the lower aperture is the original *qi* within the body, belonging to the seven *po*. Once these two *qi* merge, Kan and Li naturally conjoin, *hun* and *po* intermingle, spirit and *qi* coagulate, and the embryo stabilizes. Daily, one experiences the joy and pleasure of external union between husband and wife—yet one must not become attached. When water and fire achieve mutual balance, they circulate through the four limbs like an external flame kindling a blaze. Maintaining equilibrium between water and fire constitutes the minor celestial orbit. As the fire’s timing harmonizes and its vapors rise, the breath reverses into the original sea, the external yang naturally enters within, and the true fire spontaneously surges upward. The entire body softens and relaxes, suffused with boundless delight. Within the abdomen, the living dragon stirs, ascending and descending, undergoing dozens of transformations each day. The infant boy and the maiden naturally unite—this is the stage of gathering yin to replenish yang.\n\nRefining the jade fluid and returning the elixir begins with laying the foundation and refining the self, accumulating inner dharmic wealth. One abides in carefree ease, day and night perpetually luminous—this is the first step toward longevity and enduring vision. Ordinary people rely on the five grains to sustain life; going without food for several days, they perish from *qi* starvation. If one’s lower origin is depleted in old age...",
      "overlap_context": "ndred, shattering the void to merge with the Great Void—this is the work of refining spirit into emptiness.\n\nOnce the ten-month work is complete, one must constantly tend to the infant. Step by step, mile by mile, gradually emerging—if one is careless or unrestrained, one may become lost and unable to return. The immortal scriptures say: \"The spirit enters the *qi* to form the embryo; the *qi* returns to the spirit to congeal the elixir\"—this is the single point descending into the Yellow Court.",
      "start_char": 1234,
      "end_char": 1684,
      "start_sentence": 56,
      "end_sentence": 73,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.228736877441406,
      "metadata": {
        "source_file": "dao\\藏外\\玄机直讲.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "骨髓俱空，不能胜五谷之气，则气馁病矣。 是五谷能养人，亦能杀人也。 若会内外交接，水火既济，气血逆流，五脏气合，脾胃开畅，食入腹中，亦能化气生精养神。 人果能得下手天机，直候骨髓盈满，腹脐如孕妇人一般，却不是有胎形相，不过是气满精盈神全而已。 如果三全，则真火般炼，调神炼虚，大丈夫功成名遂之时也。 奉劝学人，参访宗师，苦求至人，抉破一身内外天机，明白下手速修，炼己待时，候一阳至。 择地入室，炼此龙虎大丹。 必要僻静鸡犬不闻之处，外边又要知音道友，不要一个闲杂人来到，恐防惊散元神。 先言和光同尘，今言僻静处，何也炼己于尘俗，养气于山林，是入室兴功，下手之时也。 要超凡入圣，岂是小可的事必须要一尘不染，万虑俱忘，丝毫无挂，一刀两断，永作他乡之客，终无退悔之心。 持空炼神，守虚炼性，浑身五脏筋骨气血，都化成青气，专心致志，演神纯熟，成形受使，星回斗转，随心所变，直养得浑身无有皱纹，如蜘蛛相似，上七窍生光，昼夜常明。 身如太虚，才是正时候，方可求仙道。 这应验气满神全。 法财广大，方可炼大丹，才叫做一个丹客。 工夫既得，时候自至，七窍光明，三阳开泰，神剑成形，趁水顺风发火，雷轰电闪，方夺外天机，下手擒拿，采吾身外真铅，以龙嫁虎，驱虎就龙。 若会攒簇，不失时节，湛然摄起海底之金，开夹脊，上泥丸，落入水晶宫之内，与木汞配合，不过半刻，攒簇已定，真火冲入四肢，浑身骨既火烧刀割相似，最难禁受，就是十分好汉，到此无一分主张。 防危虑险，冰浴身心，水火既济，顷刻间浑身如炒豆子一般相似，一齐爆开，浑身气血，都会成形说话，就在身上闹成一堆。 舌根下又有两穴，左为丹井，右为石泉，此正是廉泉穴，随骨脉一齐开下，肾水上涌到如外水泉一般，咽纳不完，滋味甚异，比糖蜜更不相同。 又其至妙者，临炉下手之初，地将产其金莲，天亦垂乎宝露，忽然一点真汞下降，透心如冰凉，即运一点神火，随之攒簇于交感宫内，浑然湛然，如千千战鼓之鸣，万万雷声之吼，又即是自己一身百脉气血心化，休要惊怕，只要踏罡步斗，执剑掌印，这里正是凶恶处，三回九转，降帅召将，如此防顾，于虚空中或见龙虎相交，天地交泰，日月交宫，见众仙诸佛，工夫到此，诸境发现，切不可认他，恐着外邪。 既认元神，汞铅相投，三日才生大药，三日里最难过，遍世界都是邪境，四面神号鬼哭，八方杀气狼烟，此正是大开关工夫，到此十个九个都吓杀了，心不可有恐怖，盖己虽化成神，却是阴神，阴神最灵，能千变万化，诸境为害，他岂肯苦善降伏，前人说得好，\"你会六通神，方才脱生死； 你若不会六通神，休想成道混沌。 \"又至三十时辰二日半，气气相通，气满至极，忽然活泼泼地迸出太阳流珠，脱壳入口，百万龙神，尽皆失惊，此是元阳真丹药，入口始知我命不由天也。 古仙云，\"这回大死今万活\"，又云：\"一战而天下平\"，即是此等地位，这才是天地交泰，日月交宫。 真阳之药到口，顷刻周天火发，骨胎化作一堆肉泥，阳神脱体，撒手无碍，专心致志，持空养虚，以空养神，以虚养心，随心变神。",
      "translated_text": "The bones and marrow both hollow, unable to withstand the *qi* of the five grains, then *qi* weakens and illness arises. Thus, the five grains can nourish a person, yet they can also kill. If one masters the union of inner and outer, with water and fire in harmony, *qi* and blood flowing in reverse, the *qi* of the five viscera converging, and the spleen and stomach open and unobstructed, then food entering the abdomen can also transform into *qi*, generate essence, and nourish the spirit.\n\nShould one truly grasp the celestial mechanism at the outset, waiting until the marrow fills to overflowing and the abdomen swells like that of a pregnant woman—though no fetal form appears, only *qi* replete, essence abundant, and spirit complete—then, with these three in fullness, the true fire refines, the spirit is harmonized, and the void is cultivated. This is the moment when the great man’s work is accomplished and his name established.\n\nI urge seekers to visit and inquire of lineage masters, earnestly seeking the perfected ones to reveal the celestial mechanisms within and without the body. Clearly understand the swift method of beginning practice, refine the self and await the moment, waiting for the arrival of the solitary yang. Choose a secluded place and enter the chamber to refine this great elixir of dragon and tiger.\n\nIt is essential to find a quiet place where no crow of rooster nor bark of dog can be heard, and outside, only fellow adepts of the Dao should be present—no idle or unrelated person should approach, lest the primordial spirit be startled and scattered. Earlier, I spoke of harmonizing with the world and blending with the dust; now, I speak of seclusion—why? Refine the self amid the mundane, nurture *qi* in the mountains and forests; this is the time to enter the chamber and commence the work, to begin the practice.\n\nTo transcend the ordinary and enter sainthood is no small matter. One must be unstained by a single speck of dust, all concerns forgotten, not a thread of attachment remaining, cutting cleanly as with a blade, forever a stranger in this land, with no thought of retreat or regret. Hold to emptiness to refine the spirit, guard the void to cultivate nature. The five viscera, sinews, bones, *qi*, and blood of the entire body all transform into azure *qi*. With single-minded devotion, train the spirit to purity, shaping it to be commanded. As stars revolve and the Dipper turns, it changes at will. Nurture it until the entire body is free of wrinkles, like a spider’s form, with the seven orifices above radiating light, luminous day and night. When the body becomes like the Great Void, only then is it the proper time to seek the immortal Dao.\n\nThis verifies that *qi* is full and spirit complete. Only with vast dharmic wealth can the great elixir be refined—this is what makes one a true elixir adept. When the work is attained, the time naturally arrives. The seven orifices radiate light, the three yangs flourish, the spirit-sword takes form. Seizing the moment like sailing with the wind and tide, the fire is ignited with thunderous roars and lightning flashes. Only then can one seize the celestial mechanism without, begin the work of capture, gather the true lead beyond the body, wed the dragon to the tiger, and drive the tiger to the dragon.\n\nIf one can gather and cluster without missing the proper timing, serenely draw up the gold from the sea’s depths, open the spine’s pass, ascend to the Mud Pill Palace, and descend into the Crystal Palace, where it unites with the Wood Mercury—within half a moment, the clustering is complete. The true fire surges into the four limbs, and the entire body’s bones feel as if scorched by fire or sliced by a blade, most difficult to endure. Even the staunchest hero, at this point, has not a shred of composure left.\n\nGuard against danger and contemplate peril, bathing body and mind in ice, achieving harmony of water and fire. In an instant, the entire body feels like exploding beans, all at once bursting open. The *qi* and blood of the whole body coalesce into form and speech, clamoring as one within. Beneath the root of the tongue lie two cavities: the left is the Elixir Well, the right the Stone Spring—this is precisely the Lianquan point. As the bone meridians open, kidney water surges upward like an external spring, impossible to swallow completely, its flavor most extraordinary, unlike sugar or honey.\n\nYet the most wondrous moment comes at the very beginning of tending the furnace and commencing the work: the earth is about to yield its golden lotus, the heavens to bestow their precious dew. Suddenly, a single drop of true mercury descends, piercing the heart like icy coolness. Immediately, a spark of spirit-fire follows, clustering within the Chamber of Union. Serene and profound, it resounds like a thousand drums in battle, a myriad thunderclaps roaring. This is the transformation of the hundred meridians, *qi*, blood, and heart within one’s own body—do not be alarmed. Simply tread the steps of the Dipper, wield the sword, and grasp the seal. Here lies the most perilous point: three revolutions, nine turns, subduing generals and summoning marshals. Be vigilant in guarding this space.\n\nIn the void, one may witness dragons and tigers mating, heaven and earth in harmony, the sun and moon conjoined in their palaces, or see hosts of immortals and buddhas. When the work reaches this stage, myriad visions appear—take care not to mistake them for reality, lest external demons take hold. Once the primordial spirit is recognized and mercury and lead unite, after three days the great medicine is born. These three days are the most difficult to endure: the entire world becomes a realm of demonic illusions, spirits wailing and ghosts weeping on all sides, baleful *qi* and warlike smoke in every direction. This is the great work of opening the passes. Nine out of ten are terrified to death at this stage, but the heart must harbor no fear. Though the self has transformed into spirit, it remains a yin spirit, and yin spirits are most cunning, capable of endless transformations. How could they willingly submit to being subdued by mere kindness?\n\nAs the ancients said:\n*\"Only when you master the six penetrations can you escape birth and death;\nIf you do not master the six penetrations, do not dream of attaining the Dao amid chaos.\"*\n\nAfter thirty hours—two and a half days—*qi* communicates with *qi*, filling to the utmost. Suddenly, a vibrant, living pearl of solar radiance bursts forth, shedding its husk and entering the mouth. A hundred thousand dragon spirits are all startled. This is the true yang elixir of primordial yang. Only upon taking it into the mouth does one realize that one’s fate is not ruled by heaven.\n\nThe ancient immortals said:\n*\"This time, great death brings ten thousand lives,\"*\nand\n*\"One battle and the world is pacified.\"*\nThis is precisely that stage—where heaven and earth harmonize, the sun and moon conjoin in their palaces.\n\nWhen the medicine of true yang reaches the mouth, in an instant the fire of the celestial circuit ignites. The bone embryo dissolves into a mass of fleshly mud, the yang spirit leaves the body, and the hands are unbound without hindrance. With single-minded devotion, hold to emptiness and nurture the void, with emptiness nurture the spirit, with void nurture the heart. Transform the spirit at will.",
      "overlap_context": "ite—this is the stage of gathering yin to replenish yang.\n\nRefining the jade fluid and returning the elixir begins with laying the foundation and refining the self, accumulating inner dharmic wealth. One abides in carefree ease, day and night perpetually luminous—this is the first step toward longevity and enduring vision. Ordinary people rely on the five grains to sustain life; going without food for several days, they perish from *qi* starvation. If one’s lower origin is depleted in old age...",
      "start_char": 1684,
      "end_char": 2896,
      "start_sentence": 74,
      "end_sentence": 97,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.658660888671875,
      "metadata": {
        "source_file": "dao\\藏外\\玄机直讲.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "夫万物皆天地生发吾，万神朝拜而宾服，厌居尘世，通遥蓬岛，自有三千玉女奉侍，终日蟠桃会上，饮仙酒，戴仙花，四大醺醺，浑身彻底玲珑，海底龟蛇出现，万神受使，才是真铅真汞颠倒，浑身紫雾毫光，瑞气千条，是五龙大蛰法也。 炼之百日。 玄关自开，婴儿显相，龟蛇出现，自然蟠绕，学者到此地位，口中才干得外汞。 炼之六个月，体似银膏，血化白浆，浑身香气袭人，口中出气成云，此是灵丹成熟，一块千汞，人服之永不死矣，亦能治死人返活。 炼之十个月，阳神脱体，一身能化千万身，只候十二月，夺尽天地全数，阳神已就，浑身出入，只万四千阳神，步日月无影，入金石无碍，入水不溺，入火不焚，刀兵不能伤，鬼神不能测，变化无穷，已成真人也。 浑身气候，无不是真药，鸡餐成凤。 犬食成龙，此理鬼神也难明，若不见过这样言语，必不信大药金丹也。 造化工夫，三回九转。 七返八还，火候细微，攒簇口诀，只三五日间，把天地都颠倒过。 都是自然，人身造化阴阳，亦是自然。 却要体天地造化，方可成就。 事从做过见过，从试应验到自然处，工夫虽是一年，火候细微只在百日之内，动静凶恶只在几日，一时里得内外攒簇，刻湛然，圣胎成就。 产黍米之珠，吞入腹内，周天火足，脱胎换骨，只是要持空养虚，馀皆自然。 今人果得明师指示，先炼己于尘俗，积铅于廛市，攒年簇月，攒日簇时，大定之也只在一刹那间，不出半个时辰，把天地都颠倒过，运火十月之工，体天地自然之法，若不能死中求活，焉能逃出三灾大难哉！ 服食大丹说 三清俸禄，玉皇禀给，非先圣贤哲，焉能受得如许旌阳、葛仙翁、殷真君等人百馀家，俱是成道之后。 方炼服食，以度辩迷。 古仙云：\"内丹成，外丹就\"，此古人得正传。 先积精累气，收积内外法财。 养得气满神全，金光出现，昼夜常明，如是则再身内丹成，而否身外丹亦发相矣。 凡看书不可按图索骏，学者于昼夜常明之时，药苗已生，方可采吾身外之药，配吾身中之雌雄，以得金丹入口，周天火候发现，顷刻湛然，撒手无碍，才是金蝉脱壳，默朝上帝，中遇仙舆，受其天禄，刀神朝礼，能折天补地，摘星握月，驱雷转斗，呼风唤雨，举意万神，使觑天地如手掌相似，这福德胜三辈天子，智慧胜七辈状元，到这般时候，方可炼服食金丹。 此丹如黍米一粒，落于地则金光烛天，方名神丹。 若不通神，敢说是外丹服食！ 此理奥妙，天机深远，金种金，银种银，外边无有别灵神。 此黄白之术，不是凡间金银，为母遏气，果得正传，能产先天大药，认得黄芽白霸，此为黄白，方可为母遏气，以炼神丹。 但是金银水药，都属后天，且又不知真阴真阳同类，万万无成。 慨世学者，真假不辨，不遇正人，都是盲修瞎炼，实修性命之士，若末遇真师，且潜心看书。 大吉圣丹书，不空说一字，妄言一句。 只是后人不识邪正，又不知圣贤书中都是隐语譬喻，遭遇庸师。 执认旁门，毒药大心，又无通变。 似是而非，自高向是。 声音颜色。",
      "translated_text": "All things under heaven are born of heaven and earth, and the myriad spirits pay homage in submission. Weary of dwelling in the dusty world, one roams freely to Penglai Isle, where three thousand jade maidens attend in service. Daily at the banquet of immortal peaches, one drinks celestial wine, wears celestial flowers, and becomes thoroughly intoxicated in all four limbs, the body entirely translucent. The tortoise and serpent emerge from the sea’s depths, and the myriad spirits receive their commands—this is the true inversion of lead and mercury, the body enveloped in purple mist and radiant beams, auspicious qi streaming in a thousand threads. This is the Great Hibernation of the Five Dragons.\n\nRefine it for a hundred days, and the Mysterious Pass opens of itself; the Infant appears in form, the tortoise and serpent emerge naturally and coil about. Only at this stage can the adept’s mouth obtain the external mercury.\n\nRefine it for six months, and the body becomes like silver paste, the blood transforms into white nectar, the whole body exudes a fragrance that assails others, and the breath from the mouth forms clouds. This is the maturation of the numinous elixir, a single grain of living mercury. One who consumes it never dies and can even revive the dead.\n\nRefine it for ten months, and the yang spirit departs the body, one form able to transform into ten thousand. Only await the twelfth month to seize the full tally of heaven and earth. Once the yang spirit is complete, it moves freely in and out of the body, and the fourteen thousand yang spirits step without shadow beneath the sun and moon, pass through metal and stone without hindrance, enter water without drowning, enter fire without burning, remain unscathed by blades and weapons, and elude the perception of ghosts and spirits. With endless transformations, one has become a true person. The qi and climate of the entire body are nothing but true medicine: a chicken that eats it becomes a phoenix, a dog that consumes it becomes a dragon. This principle is so profound that even ghosts and spirits find it difficult to comprehend. Without having encountered such words, one would surely not believe in the great elixir of golden cinnabar.\n\nThe work of creation and transformation undergoes three revolutions and nine cycles, seven returns and eight restorations. The firing times are subtle, the oral instructions for gathering and assembling take only three to five days to overturn heaven and earth entirely. All is natural, and the yin-yang creation within the human body is also natural. Only by embodying the creation and transformation of heaven and earth can one achieve success. Matters must be experienced and tested until they reach the state of naturalness. Though the work spans a year, the subtleties of the firing times lie within a hundred days, and the perilous moments of movement and stillness occur within just a few days. In an instant, internal and external are gathered and assembled, and in a moment of clarity, the sacred embryo is accomplished. Producing a pearl the size of a millet grain, one swallows it into the abdomen, and when the fire of the celestial circuit is complete, the embryo is shed and the bones are transformed. One need only hold to emptiness and nurture the void; the rest follows naturally.\n\nIf one truly receives the guidance of an enlightened teacher, one first refines the self amid the dust of the world, accumulates lead in the marketplace, gathers years into months, and months into hours. The great stabilization occurs in a single instant, no more than half an hour, overturning heaven and earth entirely. After ten months of firing, one embodies the natural method of heaven and earth. If one cannot seek life within death, how can one escape the three great calamities?\n\n**On the Ingestion of the Great Elixir**\nThe salaries of the Three Clarities and the provisions of the Jade Emperor are bestowed only upon the former sages, worthies, and enlightened ones. How could one receive the ranks of such as Master Zhengyang, Immortal Ge, and Perfected Lord Yin—over a hundred in all—who all achieved the Dao before refining and ingesting the elixir to dispel confusion?\n\nThe ancient immortals said: *\"When the inner elixir is complete, the outer elixir is achieved.\"* This is the true transmission received by the ancients. First, one accumulates essence and amasses qi, gathering the inner and outer dharmic wealth. When the qi is full and the spirit complete, golden light appears, shining day and night without cease. Only then is the inner elixir of the body complete, and the outer elixir of the self also manifests.\n\nOne must not read books by matching them to diagrams like seeking a steed with a picture. Only when the light shines day and night without cease and the sprouts of the medicine have grown can the adept gather the external medicine of the self and pair it with the inner yin and yang. Only then can the golden elixir enter the mouth, the fire of the celestial circuit ignite, and in an instant, one becomes clear and unbound, shedding the golden cicada’s shell. Silently, one pays homage to the Supreme Emperor, encounters the immortal chariot, and receives celestial emoluments. The knife spirits pay obeisance, and one can mend heaven and earth, pluck stars and grasp the moon, command thunder and turn the Dipper, summon wind and call rain. With a single thought, the myriad spirits obey, and one views heaven and earth as if they were the palm of one’s hand. This fortune surpasses that of three generations of emperors, this wisdom exceeds that of seven generations of top scholars. Only at this time can one refine and ingest the golden elixir.\n\nThis elixir, like a grain of millet, when dropped to the ground, illuminates the sky with golden light—only then is it called the divine elixir. Without spiritual communion, how dare one speak of ingesting the outer elixir? This principle is profound, the celestial mechanism deep and distant. Gold begets gold, silver begets silver; there are no other numinous spirits beyond. This art of the yellow and white is not the gold and silver of the mortal world but the mother that restrains qi. Only with the true transmission can one produce the great medicine of primordial qi, recognize the yellow sprout and white frost—this is the yellow and white, the mother that restrains qi, with which one refines the divine elixir. All gold, silver, liquid medicines, and elixirs belong to the postnatal realm. Without knowing the true yin and true yang of the same kind, one will never succeed.\n\nAlas, the scholars of the world cannot distinguish true from false and do not encounter true teachers, engaging only in blind practice and reckless refinement. Those who truly cultivate life and destiny, if they have not yet met a true teacher, should quietly study books. The *Book of the Great Auspicious Divine Elixir* does not utter a single empty word or idle sentence. It is only that later generations fail to discern the heterodox from the orthodox and do not understand that the words of the sages and worthies are all hidden language and metaphors. They encounter mediocre teachers, cling to side doors, and harbor poisonous intentions with great ambition, lacking adaptability. Seeming right yet wrong, they exalt themselves as correct in voice and countenance.",
      "overlap_context": "precisely that stage—where heaven and earth harmonize, the sun and moon conjoin in their palaces.\n\nWhen the medicine of true yang reaches the mouth, in an instant the fire of the celestial circuit ignites. The bone embryo dissolves into a mass of fleshly mud, the yang spirit leaves the body, and the hands are unbound without hindrance. With single-minded devotion, hold to emptiness and nurture the void, with emptiness nurture the spirit, with void nurture the heart. Transform the spirit at will.",
      "start_char": 2896,
      "end_char": 4050,
      "start_sentence": 98,
      "end_sentence": 129,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.255401372909546,
      "metadata": {
        "source_file": "dao\\藏外\\玄机直讲.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "拒人千里之外，则高人望望然去之，况仙圣乎！ 学者未遇正人时，当小心低意。 积功累行，遇魔莫退，遭谤勿嗔，重道轻财； 一遇正人，鸳志苫求，抉破一身内外两个真消息，忽然醒悟诸书，才不为人迷惑。 若是志大君子，实心为命，扫尽旁门，重正心猿，重立志气，低心下意，经魔历难，苦求明师，穷取生身受气初。 初者，是元始祖气，此气合着一点真阳真阴。 失真阳真阴，产于天地之先，混元之始，这颗灵明黍米宝珠，悬在虚空，明明丽丽。 但未有明师指破的人，如在醉梦相似，离此一着，都是旁门。 此灵明宝珠，于虚空之电包含万象，潜藏万有，发生万物，都是这个。 一粒黍米说 此物在道门中，喻真铅真汞。 一得真得，不可若于乾坤、日月、男女上，只于已身内外，安炉立鼎，炼己持心，明理见性之时，攒簇发火，不出半刻时辰。 立得黍米玄珠，现于曲江之上。 刀圭入口，顷刻一窍开百脉齐开，浑身筋骨，五脏血肉，都化成气，与外水银相似。 到此时候，用百日火功，方有灵妙，一得水得，无有返还，住世留形，炼神还虚，与道为一矣。 此物在佛门中，说是真空真妙党性。 下手端的，炼魔见性，片晌工夫，发起三昧真火，返本还元，一体同观，大地成宝，霞光万道，正眼六通，炼金刚不坏之身，了鬼神不测之妙也。 此物在儒门中，说是无极而太极。 依外天地而论，无极是天地周围，日月末判之前，四维上下，混混沌沌，如阴雾水气，直至时到气满相激，才是太极。 是时也，日月既生，清浊自分，在上为天，在下为地，天之清气为纯阳，地之浊气为纯阴。 雨露从天降，是阳能生阴； 万物从地生，是阴能生阳。 天地是个虚无，包藏无穷尽、无边际。 天之星宿神祗，动静转轮，各有方位，地下万物，按四时八节，自然发生，总论只是虚空。 夫日月是天地之精，上照三十三天，下照九极万泉，东西运转，上下升降，寒暑往来。 日是纯阳之体，内含一点真阴之精，属古龙、姹女、甲木、水银、金马、三魂，即是外； 月是纯阴之体，内含着一点真阳之气，属白虎、婴儿、庚金、朱砂、玉兔、七魄，即是内。 人身造化同天地，故人身亦有真日月，道在逝，人何求之远也！ 三魂属性，性在天边； 七魄属命，命在海底。 内外通来\"性命\"两个字，了却万卷丹书。 性属神是阴，命属气是阳，故曰\"一阴一阳之谓道\"，千经万卷皆是异名，然真性命及幻法象，若不得真传，则又不可知耳。 古仙云，\"四大一身皆属阴，未知何物是阳精\"，又云，\"涕唾精津气血液，七般灵物总属的\"，乃后天渣质之浊阴，非真阴也。 真阴与真阳相对，真阴既不知，焉能知真阳乎今之学者，不惟不知真阳，亦且不知真阴，若知真阴，亦必知真阳矣。 不遇明师，焉能猜度！ 学者穷取一身中天地人三才之妙，穷一身内外真炉鼎之端的，及一身内外阴阳之真消息。 如不得旨，一见诸书异名，心无定见，执诸旁门，无有辨理。 既不知穷理，则心不明，心既不明，则不能见性，既不见性，焉能至命古人云，“只为金丹无口诀，教君何处结灵胎！ \" 登天指迷说 道也者，生天地，育万物，放之则包罗虚空，敛之则退藏于密，两仪．日月．五行，都是道中之造化耳。",
      "translated_text": "Those who repel others from a thousand *li* away will see lofty persons turn and depart—how much more the immortals and sages! Before encountering a true teacher, scholars should proceed with humility and caution. Accumulate merit and deeds, face demons without retreat, endure slander without anger, value the Dao and disdain wealth. Once they meet a true teacher, they should earnestly seek with single-minded devotion, who will reveal the two true inner and outer messages of the body, suddenly awakening their understanding of all books, so they are no longer deluded by others.\n\nIf one is a noble-minded gentleman with a sincere heart for destiny, sweeping aside all side doors, valuing the taming of the mind-monkey, reaffirming resolve and qi, humbling the heart and lowering the intent, enduring demonic trials and hardships, diligently seeking an enlightened teacher, and exhaustively pursuing the origin of the body’s first reception of qi—this \"origin\" is the primordial ancestral qi, which unites with a single point of true yang and true yin. Without true yang and true yin, born before heaven and earth, at the inception of the primordial chaos, this luminous millet-grain treasure pearl hangs in the void, radiant and resplendent. Yet without an enlightened teacher to point it out, one remains as if in a drunken dream; missing this single step, all else is but side doors.\n\nThis luminous treasure pearl, within the lightning of the void, encompasses all phenomena, conceals all existence, and gives rise to all things—all from this single grain. In the Daoist tradition, it is called true lead and true mercury. Once truly attained, one must not seek it in heaven and earth, sun and moon, or male and female, but only within the body’s inner and outer crucible and furnace, refining the self and upholding the heart. When principle is understood and nature is seen, the fire is gathered and ignited, and in less than half a moment, the millet-grain mystery pearl appears above the winding river. With a single dose of the elixir taken, in an instant, one aperture opens and a hundred meridians align; the entire body’s sinews and bones, the five viscera and flesh, all transform into qi, resembling external mercury. At this stage, a hundred days of fire cultivation bring wondrous efficacy. Once attained, there is no regression—abiding in the world, preserving form, refining spirit to return to the void, and uniting with the Dao.\n\nIn the Buddhist tradition, this is called true emptiness and the wondrous dharmakāya. With precise application, refining demons to see nature, in a brief moment, the true fire of samādhi arises, returning to the origin and restoring unity. The earth becomes treasure, radiant with myriad rays of light; the six supernatural powers of the correct eye manifest, forging the indestructible vajra body and accomplishing the unfathomable wonders beyond ghosts and spirits.\n\nIn the Confucian tradition, it is called the Supreme Ultimate born of the Non-Ultimate. Considering the external heaven and earth, the Non-Ultimate is the vast expanse surrounding heaven and earth before the separation of sun and moon, the four directions and above and below, a chaotic mist like yin fog and water vapor. Only when the time arrives and qi reaches fullness, clashing together, does the Supreme Ultimate emerge. At that moment, sun and moon are born, the clear and turbid separate—above becomes heaven, below becomes earth. Heaven’s clear qi is pure yang; earth’s turbid qi is pure yin. Rain and dew descend from heaven, for yang can generate yin; the myriad things arise from earth, for yin can generate yang. Heaven and earth are but emptiness, containing boundless and limitless potential. Heaven’s stars and deities, in their movements and revolutions, each hold their positions; earth’s myriad things, following the four seasons and eight solar terms, naturally arise—all, in essence, are but the void.\n\nThe sun and moon are the essence of heaven and earth, illuminating the thirty-three heavens above and the nine abysses and ten thousand springs below, revolving east and west, ascending and descending, cycling through cold and heat. The sun is a body of pure yang, containing a single point of true yin essence, belonging to the ancient dragon, the maiden, wood of *jia*, mercury, the golden horse, and the three *hun*—this is the outer. The moon is a body of pure yin, containing a single point of true yang qi, belonging to the white tiger, the infant, metal of *geng*, cinnabar, the jade hare, and the seven *po*—this is the inner. The human body’s creation mirrors heaven and earth, thus the human body also possesses a true sun and moon. The Dao is near—why seek it afar?\n\nThe three *hun* belong to nature, which resides at the edge of heaven; the seven *po* belong to destiny, which lies at the bottom of the sea. The inner and outer unite in the two words \"nature and destiny,\" resolving the myriad volumes of alchemical texts. Nature pertains to spirit and is yin; destiny pertains to qi and is yang. Thus it is said, \"One yin and one yang is called the Dao.\" The thousands of classics and volumes are but different names; yet true nature and destiny, along with illusory phenomena, remain unknown without true transmission.\n\nAncient immortals said, \"The four great elements of the body all belong to yin—what then is yang essence?\" They also said, \"Tears, saliva, essence, fluids, qi, blood, and marrow—these seven numinous substances all belong to it,\" yet these are but the turbid yin of postnatal dregs, not true yin. True yin and true yang stand in opposition; if true yin is unknown, how can true yang be known? Today’s scholars not only do not know true yang but also do not know true yin. If they knew true yin, they would surely know true yang. Without encountering an enlightened teacher, how could they ever fathom it?\n\nScholars must exhaustively pursue the wonders of the three talents—heaven, earth, and humanity—within the body, as well as the true crucible and furnace within and without, and the true messages of yin and yang within and without. Without grasping the essential meaning, upon seeing the various names in books, the mind lacks certainty, clinging to side doors without discernment. Without understanding principle, the heart remains unclear; with an unclear heart, one cannot see nature; without seeing nature, how can one reach destiny? The ancients said, \"Only because the golden elixir lacks oral instructions, where can you form the spiritual embryo?\"\n\nThe *Pointer to Ascending Heaven* states: The Dao generates heaven and earth, nurtures the myriad things. When released, it encompasses the void; when gathered, it retreats into secrecy. The Two Modes, sun and moon, and the Five Phases are but the transformations within the Dao.",
      "overlap_context": " The *Book of the Great Auspicious Divine Elixir* does not utter a single empty word or idle sentence. It is only that later generations fail to discern the heterodox from the orthodox and do not understand that the words of the sages and worthies are all hidden language and metaphors. They encounter mediocre teachers, cling to side doors, and harbor poisonous intentions with great ambition, lacking adaptability. Seeming right yet wrong, they exalt themselves as correct in voice and countenance.",
      "start_char": 4050,
      "end_char": 5279,
      "start_sentence": 130,
      "end_sentence": 170,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.81946325302124,
      "metadata": {
        "source_file": "dao\\藏外\\玄机直讲.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "物物各具一太极，即道也。 人人心上有先天，亦道也。 五行顺而生人生物，五行逆而成仙成佛，故云\"五行顺则法界火坑，五行逆则大地七宝\"。 这五行之精，秘于四大形山不内不外之密处，只是百姓日用而不知耳。 民可使由之，顺行也； 不可使知之，逆行也。 夫负在水中，不知其力水也； 人居气机不知其力气也。 此譬喻当潜心究竟，回光返照，明心见性，果证仙佛，复何难哉！ 今人学道，个个自卖聪明，自夸伶俐，自称会家，终无不悟。 又有一等小根盲人，见先圣所言外阴阳、外炉鼎、外药物，执迷女子为鼎器，则又可哀已也。 某见酷好炉火者，百无一成。 又以轩辕铸九鼎而成道，以为必用鼎器九人，谬之甚矣，尝见有进过五七鼎亦无成就者。 且人念头一动，先天淳朴即散，先天既丧，后天虽存，究何益于身心，不过聊存其四大而已。 这样下愚，岂知天不言而四时行、百物生之妙哉！ 夫人身造化同乎天地，但不知天何得一以清、地何得一以宁叉不知主张造化的是谁若能以清静为体，镇定为基，天心为主，元神为用，巧使盗机，返还天真，归根复命，岂患不至天地圣位。 至用文鼎一节事，万无此理。 假使有缘之士，得遇真师，先行玉液还丹，炼己和光，操持涵养，回光返照，此即见性明心之事也。 既见其性，更求向上之事，乃金液还丹，情来归性，直到真空地位，大用现前，龙女献一宝珠，金光发现，至此方为一得永得。 亥、子之交。 剥、复之间，于太阳初动兴功时，手探月窟，足蹑天根，回风混合，从此有百日功灵之妙，此金液还丹，乃阴阳五行之大道也。 除此玉液金液、性命双修、清静自然之道，徐皆旁门小法。 某于一身内外。 安炉立鼎，攒簇口诀，药物火候细微已得，不知虚空法度，便去入室，行外药入腹大事，发火行功，到秘密处，有虚空万神朝礼。 仙音戏顶，此事鬼神难明，怎奈因自己不能炼己于尘俗，末得积铅于市廛，气脉又未甚大定，基址也未得三全，理虽融而性未见，故万物发现凶险，心神恍憾，不能做主，又因外边无知音道侣护持看守，触其声色，惊散元神，激鼎翻炉，劣了心猿，走了意马，神不守舍，气不归元，遭其阴魔。 何为阴魔，我不细言，后学不知。 皆因真阳一散，阴气用事，昼夜身中，神鬼为害，不论睁眼合眼，看见鬼神来往，即耳中亦听得鬼神吵闹，白日间觉犹可，到晚来最难过，不敢静定一时，我身彼家海底命主，兑金之戊土冲返，五脏气血皆随上腾，身提不着地，杀身丧命，真乃鬼家活计也。 某乃暂弃前功，遵师训指，大隐市廛，积铅尘俗，摄情归性，杀机返覆，自幼至老被天地人物盗去的天真，今于虚无中尘色内，却要夺盗返还于我天性之中，方得元精、元气、元神之三全，至是乃心明理融，理融见性，身心大定，五行攒簇，才去行上等事而了大道。 想前代贤哲，多有中道而废，皆因未曾炼己持心，金来归性，以至二候得药，于四候进火之时，不知虚空法度，粗心大意，是以白玉蟾有\"再斫秋筠节\"之叹焉。 谁知虚空消息，至微至凶至恶，若是擒捉不住，定不饶人。 若是学人知一身内外两个真消息，了然无碍，方去操持涵养，克去己私，复还天理，则还丹工夫，至简至易。",
      "translated_text": "Each thing possesses a Supreme Ultimate—this is the Dao. Within every person’s heart lies the primordial, which is also the Dao. The Five Phases flow forward to give birth to humans and creatures; they reverse to produce immortals and buddhas. Thus it is said, “When the Five Phases flow forward, the dharma-realm becomes a fiery pit; when they reverse, the great earth yields its seven treasures.” The essence of the Five Phases is concealed in the secret place of the Four Great Form-Mountains, neither inside nor outside—merely what common folk use daily without awareness.\n\nThe people may be made to follow, for this is the forward flow; they cannot be made to know, for that is the reverse flow. Just as a fish in water does not recognize the power of water, a person within the qi-mechanism does not recognize the power of qi. This analogy should be pondered deeply: turn the light inward, reflect back, illuminate the mind and see nature—then to realize the fruit of immortality or buddhahood, what difficulty remains?\n\nYet today’s Dao-seekers, each one, sell their own cleverness, boast of their own cleverness, claim mastery—yet none awaken. There is also a class of shallow-rooted blind men who, upon seeing the sages speak of outer yin-yang, outer furnace and tripod, outer medicinal substances, fixate on women as the tripod-vessel—how lamentable! I have seen those who ardently pursue furnace-fire, yet none succeed. Some cite the Yellow Emperor casting nine tripods to attain the Dao and assume nine people must be used as tripods—how utterly mistaken! I have witnessed those who have passed through five or seven tripods yet achieved nothing.\n\nMoreover, with the first stirring of a thought, primordial simplicity scatters; once the primordial is lost, even if the later heaven remains, what benefit is there to body and mind? It merely sustains the Four Great for a time. Such fools—how could they know the marvel of heaven’s wordless operation, where the four seasons proceed and the hundred things arise!\n\nThe human body’s transformations mirror those of heaven and earth. Yet one does not know: how does heaven attain oneness to become clear? How does earth attain oneness to become tranquil? Nor does one know who presides over these transformations. If one can take clarity and stillness as essence, stability as foundation, the celestial mind as master, and original spirit as function—skillfully employing the thief-mechanism to return to primordial truth, return to the root and recover destiny—how could one not attain the sage’s position between heaven and earth?\n\nAs for the matter of using a literary tripod, there is no such principle. If a blessed practitioner meets a true teacher, they should first practice the Jade Fluid Returning Elixir, refine the self and harmonize the light, maintain and nurture, turn the light inward and reflect—this is the work of seeing nature and illuminating the mind. Having seen nature, one then seeks the higher work: the Golden Fluid Returning Elixir, where emotions return to nature, reaching the position of true emptiness. The great function manifests, the Dragon Girl offers a single precious pearl, and golden light appears—only then is there one attainment that becomes eternal.\n\nAt the juncture of *hai* and *zi*, between *bo* and *fu*, when the first stirring of the Great Yang begins, one’s hand explores the Moon Grotto, one’s foot treads the Celestial Root, and the returning wind merges—from this arises the wondrous efficacy of a hundred days’ work. This is the Golden Fluid Returning Elixir, the great Dao of yin-yang and the Five Phases.\n\nApart from the Jade Fluid and Golden Fluid, the dual cultivation of nature and destiny, and the Dao of clarity and spontaneity, all else are side doors and minor methods.\n\nI have established the furnace and tripod within and without the body, gathered the oral instructions on gathering and refining, and grasped the subtleties of medicinal substances and firing times. Yet without knowing the celestial dharma-measure, one enters the chamber, takes the outer medicine into the abdomen for the great work, and begins the firing practice. At the secret place, the empty void’s myriad spirits pay homage, and immortal music plays above the crown—this matter is too profound for even gods and ghosts to comprehend. Alas, because one has not refined the self amid worldly dust, nor accumulated lead in the marketplace, the qi-channels are not yet fully stabilized, the foundation is not yet complete in three aspects, the principle is understood but nature remains unseen—thus myriad phenomena arise dangerously. The heart-spirit is unsettled, unable to take command. Moreover, without knowing companions or Dao-friends outside to protect and guard, one is startled by sounds and sights, the original spirit scatters, the tripod overturns, the furnace flips, the Heart-Monkey falters, the Intent-Horse flees, spirit does not guard the abode, qi does not return to the origin—one encounters yin-demons.\n\nWhat are yin-demons? I will not elaborate here, but later learners do not know: once true yang scatters, yin qi takes control. Day and night within the body, spirits and ghosts cause harm. Whether eyes are open or closed, one sees ghosts and spirits coming and going; even in the ears, one hears their clamor. By day, one may still endure, but at night it is most unbearable—one cannot remain still for a moment. The life-master in the Sea of Qi, the *dui*-metal’s *wu*-earth, surges back, and the five viscera’s qi and blood all rise upward. The body lifts, no longer touching the ground—this is truly the ghostly realm’s livelihood, leading to the destruction of body and life.\n\nI temporarily abandoned my previous efforts, followed my teacher’s guidance, concealed myself deeply in the marketplace, accumulated lead amid worldly dust, gathered emotions back to nature, and reversed the killing mechanism. From youth to old age, heaven, earth, and beings had stolen my primordial truth—now, within the formless and amidst worldly dust, I must seize and steal it back into my celestial nature. Only then are the Three Originals—original essence, original qi, original spirit—complete. Only then are the heart illuminated, principle understood, nature seen, body and mind stabilized, and the Five Phases gathered. Only then can one proceed to the highest work and complete the great Dao.\n\nReflecting on the worthy sages of former times, many abandoned their path midway, all because they had not refined the self and stabilized the heart, nor brought metal back to nature. Thus, in the second phase of obtaining the medicine, during the fourth phase of advancing the fire, not knowing the celestial dharma-measure and acting carelessly, even White Jade Toad lamented, “Again I must cut the autumn bamboo’s joints.”\n\nWho knows the subtleties of the empty void—how perilous, how fierce, how malevolent? If one cannot seize and control it, it will certainly not spare you. If a learner clearly understands the two true messages within and without the body, without obstruction, then proceeds to maintain and nurture, eliminate self-centeredness, and restore celestial principle—then the work of returning the elixir becomes most simple and easy.",
      "overlap_context": "lear; with an unclear heart, one cannot see nature; without seeing nature, how can one reach destiny? The ancients said, \"Only because the golden elixir lacks oral instructions, where can you form the spiritual embryo?\"\n\nThe *Pointer to Ascending Heaven* states: The Dao generates heaven and earth, nurtures the myriad things. When released, it encompasses the void; when gathered, it retreats into secrecy. The Two Modes, sun and moon, and the Five Phases are but the transformations within the Dao.",
      "start_char": 5279,
      "end_char": 6497,
      "start_sentence": 171,
      "end_sentence": 201,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.66210198402405,
      "metadata": {
        "source_file": "dao\\藏外\\玄机直讲.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "终日采吾身外之黄芽，以候先天之琼浆，此正是饮酒戴花悟长生之妙也。 若混元一事，则无意无必，无固无我，恁生恁死，忘人忘物，如游手好闲，不务生理，终日穿街边巷，玩景怡情，淫房酒肆，兀坐忘言，岂不动世人之惊疑哉！ 摄境积铅，法财两用，岂不致俗子之笑谤哉！ 是以必资通都大邑有力之家，以为外护，日击道存，韬光晦迹。 古仙云：\"要贪天上宝，须用世间财。 \"夫天上宝，非指青天之上而言也，乃吾身上九阳鼎之宅也，故轩辕铸九鼎而飞升。 世之迷徒。 一闻\"天上宝\"三字，遂执天上日月为水火，乃于月出庚方，用两目行度数以来之，为真水真铅，于日出卯时，亦运两目采之，为真火真汞。 夫天上地下，乾坤坎离，男女内外炉鼎，喻吾一身之内外阴阳而言，并无男女等相。 古仙云，\"凡有所相，皆是虚妄\"。 还丹本无质，至哉斯言尽矣。 世间学好的人，必不为损人利已之事，宇宙间男女所赖以生而不死者，惟此一点阳精而已。 岂有学仙的人，采女人之精而利己之身哉！ 比与世之杀人者，有何异焉又先圣言彼家男女，两家两国，及内外炉鼎等说，若人不得正传，其不错认者几希矣。 某曾遇明师，耳提面命，抉破虚空内外两个真消息，不敢私于一己，冒禁相付，把一身天地人之造化。 三教经书，药物火候。 日月交合，盈满度数，尽都抉破，不立文字，但说真言，使学者无错认迷修之误。 是书在处，有神物护持，若无缘下流见之，亦不过瞽唱之文词耳。 是金丹大道万劫难遇，正是踏破芒鞋无觅处，得来全不费功夫。 学者果能涵养于造次颠沛流离之际。 保此方寸不失，是天理复矣。 天理既复，然后求向上外药入腹事，顷刻湛然，脱胎换骨，浑然化一道金光，大地成宝。 身外生身，阳神脱体，持空养虚，此是五龙大蛰法，受诸逍遥，超出风、水、火之三劫，不在生、老、病、死、苦中矣。 今人不去修行，有贪图炉火外丹服食者，此又迷之甚矣。 注《九皇丹经龙虎铅汞论》 道君论龙虎铅汞抽添，正要后世有根有缘者，从此下手。 虽曰\"神仙还是神仙做\"，吾却偏曰\"凡人亦可做神仙\"。 只怕不明金丹理，方入地狱为兽员。 此龙属阳，自阳一失，都是一阴； 此虎属阴，自阴有宝，却是一阳。 龙即我之玄关也，虎即彼之玄牡也。 龙却好淫，我却不泄，一水添一点土，佩要成一个'瑶\"字，成为玉液至宝； 虎却好吃，我却不泄，真大加一\"柬\"字，偏要成个\"炼\"字，收为金液至宝。 虎虎虎，那怕你张口漏牙，把人亡魂丧胆，我却有伏虎手段，将你为空中色，色中空，用龙一戏，把你为龙虎风云会，不怕你不为我把你虎穴中虎子得来，入我三田之中； 龙龙龙，纵任你是淫欲之物，我却有降龙手段，那怕你变化无穷，我用一那咤金刚圈降住你，抽你筋做为一条养性接命的金带，时时系着，那怕你不去向太极真人前，请一点真一不二法门来，与我为混合之大道也。 铅即两弦之铅，汞即我身天地之汞，有日月之光明，天地才成地天泰，不为天地否，人身自父母生来，原有一汞一铅，男女交媾之理，故曰\"乾为父，坤为母，男女媾精，万物化醇\",\"易为先天之太极'。 人不明此一理，只把汞去投铅，生男生女，不把铅来投汞，成佛成仙。",
      "translated_text": "All day long they gather the yellow sprouts beyond their body, awaiting the celestial jade nectar—this is precisely the wondrous awakening of \"drinking wine and wearing flowers\" to attain immortality. Yet in the matter of Primordial Unity, there is no intention, no insistence, no fixation, no self; whether living or dying, one forgets both people and things, like an idle wanderer who neglects livelihood, roaming streets and alleys all day, delighting in sights and soothing the heart, sitting vacant in brothels and taverns, wordless and unmoving—how could this not astonish and perplex the world! To gather the environment and accumulate lead, employing both method and wealth—how could this not invite the ridicule and slander of the vulgar!\n\nThus, one must rely on powerful families in great cities for external protection, preserving the Dao in daily practice while concealing one’s light and obscuring one’s traces. As the ancient immortals said: *\"To covet the treasure of heaven, one must use the wealth of the world.\"* Yet the \"treasure of heaven\" does not refer to the vault of the blue sky—it is the abode of the Nine Yang Cauldron within our own body. Thus, the Yellow Emperor cast the Nine Tripods and ascended. Deluded fools of this world, upon hearing the phrase \"treasure of heaven,\" cling to the sun and moon in the sky as water and fire, waiting for the moon to rise in the west to gather its degrees with their eyes, calling it true water and true lead; or at sunrise in the east, they likewise collect it with their gaze, calling it true fire and true mercury.\n\nYet heaven above and earth below, Qian and Kun, Kan and Li, the inner and outer furnaces of male and female—these are all metaphors for the inner and outer yin and yang of our own body, without any actual form of male or female. As the ancient immortals said: *\"All that has form is but illusion.\"* The returning elixir has no substance—how profound and exhaustive are these words!\n\nThose in the world who cultivate goodness never do harm to others for personal gain. What men and women in the universe rely upon to live without dying is nothing but this single point of yang essence. How could those who seek immortality steal a woman’s essence to benefit their own body? How would this differ from those who kill? The earlier sages spoke of \"that household’s male and female,\" \"the two families and two nations,\" and \"the inner and outer furnaces\"—if one does not receive the correct transmission, how few would not mistake their meaning!\n\nI once met an enlightened teacher who, through direct instruction, revealed the two true messages within and beyond the void. Not daring to keep this secret for myself, I transgress the prohibitions to pass it on, unfolding the creation of heaven, earth, and humanity within the body. The Three Teachings’ scriptures, the medicines and firing times, the conjunctions of sun and moon, the measures of fullness—all are laid bare. No texts are established; only true words are spoken, so that learners may avoid the errors of misguided practice.\n\nWherever this book resides, spiritual beings guard it. If those without affinity encounter it, it will be no more than blind recitation. The Great Dao of the Golden Elixir is rarely met even in ten thousand kalpas—*\"trampled straw sandals find no trace, yet it comes with no effort at all.\"* If learners can truly nurture it amid haste, turmoil, displacement, and hardship, preserving this square inch of the heart without loss, then the celestial principle is restored. Once the celestial principle is restored, then seeking the matter of the superior external medicine entering the abdomen becomes instantaneous—suddenly, one is serene, shedding the mortal coil and changing bones, wholly transformed into a single golden light, the great earth becoming treasure. A body is born beyond the body, the yang spirit leaves the form, nurtured in emptiness and void—this is the Great Hibernation of the Five Dragons, attaining boundless freedom, transcending the three kalpas of wind, water, and fire, no longer subject to birth, aging, sickness, death, or suffering.\n\nYet people today do not cultivate practice, instead coveting external elixirs of furnace and fire to consume—this is the height of delusion.\n\n**Commentary on the *Nine Augusts’ Elixir Canon: Dragon-Tiger Lead-Mercury Treatise***\nThe Daoist Lord’s discourse on the extraction and replenishment of dragon-tiger lead and mercury is meant for those of the future with roots and affinity to begin here. Though it is said, *\"Only immortals can become immortals,\"* I insist: *\"Even mortals can become immortals.\"* The only fear is not understanding the principle of the Golden Elixir—then one falls into hell as a beast.\n\nThis dragon belongs to yang; once yang is lost, all becomes yin. This tiger belongs to yin; yet within yin’s treasure lies a single yang. The dragon is the mysterious pass of my own body; the tiger is the mysterious gate of the other. The dragon is lascivious, but I do not leak—adding a drop of water to a speck of earth forms the character *yao* (瑶), becoming the supreme treasure of jade liquid. The tiger is voracious, but I do not leak—adding the character *jian* (柬) to *zhen* (真) forms *lian* (炼), gathering the supreme treasure of golden liquid.\n\nTiger, tiger, tiger—no matter how you bare your fangs and gape your jaws, striking terror into souls, I have the art of taming tigers, reducing you to emptiness within form and form within emptiness. With a single play of the dragon, you become the meeting of dragon and tiger in wind and cloud—I need not fear you will not yield the tiger’s cub from your den, entering my three fields.\n\nDragon, dragon, dragon—no matter how lustful you are, I have the art of subduing dragons. No matter how endless your transformations, I use Nezha’s vajra ring to bind you, drawing your sinews into a golden belt for nurturing nature and connecting life, worn always. I need not fear you will not go before the True Person of the Great Ultimate to beg for the unparalleled Dharma-door of the True One, merging with me into the Great Dao of Primordial Unity.\n\nLead is the lead of the two crescents; mercury is the mercury of heaven and earth within my body. With the radiance of sun and moon, heaven and earth become Earth-Heaven Peace, not Heaven-Earth Obstruction. Since birth from our parents, we originally possess one mercury and one lead—the principle of male-female union. Thus it is said: *\"Qian is father, Kun is mother; male and female unite their essence, and the myriad things transform into purity.\"* The *Book of Changes* is the Great Ultimate of the primordial. If one does not understand this principle, merely casting mercury into lead, one begets sons and daughters; but casting lead into mercury, one becomes a Buddha or immortal.",
      "overlap_context": "White Jade Toad lamented, “Again I must cut the autumn bamboo’s joints.”\n\nWho knows the subtleties of the empty void—how perilous, how fierce, how malevolent? If one cannot seize and control it, it will certainly not spare you. If a learner clearly understands the two true messages within and without the body, without obstruction, then proceeds to maintain and nurture, eliminate self-centeredness, and restore celestial principle—then the work of returning the elixir becomes most simple and easy.",
      "start_char": 6497,
      "end_char": 7728,
      "start_sentence": 202,
      "end_sentence": 238,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.23459982872009,
      "metadata": {
        "source_file": "dao\\藏外\\玄机直讲.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "这个铁馒头打得破，何难为三丰中之三丰也。 注吕祖《百字碑》 养气忘言守， 凡修行者，先须养气。 养气之法，在乎忘古寺一。 忘言则气不散，守一则神不出。 诀曰：缄舌静，抱神定。 降心为不为。 凡人之心，动荡不已。 修行人心欲人静，贵乎制伏两眼。 眼者心之门户，须要垂帘塞兑。 一切事体，以心为剑，想世事无益于我，火烈顿除，莫去贪着。 诀云，以眼视鼻，以鼻视脐，上下相顾，心点相依，着意玄关，便可降伏思虑。 动静知宗祖， 动静者。 一阴一阳也。 宗祖者，生身之处也。 修行人当知父母未生之前，即玄化也。 一身上下，乾坤大褂，五行四象，聚会之处，乃天地未判之先，一点灵光而成，即太极也。 心之下，肾之上，仿佛之内，念头无息所起之处，即是宗祖。 所谓动静者，调和真气，安理真元也。 盖呼接天根，吸接地根，即阖户之谓坤、辟户之谓乾。 呼则龙吟云起，吸则虎啸风生，一阎一辟，一动一静，贷乎心意不动，任其真息往来，绵绵若存。 调息至无息之息打成一片，斯神可凝、丹可就矣。 无事更寻谁！ 若能养气忘言守，降伏身心，神归杰穴，意注规中，混融一杰，如鸡抱卵，如龙养珠，念兹在兹，须臾不离，日久工深，自然现出黍米之珠，光耀如日，默化元神，灵明莫测，即此是也。 真常须应物，应物要不迷。 此道乃真常之道，以应事易于昏迷，故接物不可迷于尘事。 若不应接，则空寂虚无。 须要来则应之，事去不留。 光明正大，乃是不迷，真性清静，元神凝结。 诀曰：着意头头错，无为又落空。 不迷性自住，性住气自回。 凡人性烈如火，喜怒哀乐，爱恶欲憎，变态无常，但有触动。 便生妄想，难以静性。 必要有真惩忿，则火降； 真寡欲。 则水升。 身不动，名目炼精，炼精则虎啸，元神凝固； 心不动，名目炼气。 炼气则龙吟，元气存守； 意不动，名目炼神，炼神则二气交，三元混，元气自回矣。 三元者，精、气、神也； 二气者，阴阳也。 修行人应物不迷，则元神自归，本性自住矣。 性住则身屯先天之气自回，复命归根，有何难哉！ 诀曰：回光返照，一心中存，内想不出，外想不入。 气回丹自结，壶中配坎离。 修行人性不迷尘事，则气自回，将见二宠升降于中宫，阴阳配合于丹鼎，忽觉肾中一缕热杰上冲心府，情来归性，如夫妇配合，如痴如醉。 二气纟因缦，结成丹质，而宠穴中水火棚交，循环不已，则神驭杰、杰留形，不必杂术白长生。 诀曰，耳目口三宝，闭塞勿发通。 真人潜深渊，浮游守规中。 直至丹田气满，结成刀圭也。 阴阳生反复，普化一声雷。 功夫到此，神不外驰，气不外泄，神归杰穴，坎离已交，愈加猛烈精进，致虚之极，守静之笃，身静于杳冥之中，心澄于无何有之乡，则真息自住，百脉自停，日月停景，璇玑不行，太极静而生动，阳产于西南之坤。 坤即腹也，又名曲江。 忽然一点灵光，如黍米之大，即药生消息也。 赫然光透，两肾如汤煎，膀胱如火炙。 腹中如烈风之吼，腹内如震雷之声。 即复卦天根现也。 天根现即澜心五以神助之，则其笨如火遍金，上行穿过尾闾，轻轻运，默默举。 一团和气，如雷之震，上升泥丸，周身踊跃，即天风女后卦也。",
      "translated_text": "The iron steamed bun can be shattered—how then could the Three Peaks within Three Peaks be unattainable?\n\n**Annotation on Lü Zu’s *Hundred-Character Stele*:**\n\n**Nurture qi and forget speech; guard the One.**\nAll who cultivate the Way must first nurture qi.\nThe method of nurturing qi lies in forgetting the ancient temple’s One.\nForget speech, and qi does not scatter; guard the One, and spirit does not depart.\nThe secret says: *\"Seal the tongue and still the mind; embrace spirit and settle intent.\"*\n\n**Subdue the heart to act without acting.**\nThe human heart is ever restless.\nFor the cultivator, stilling the heart is paramount—this is achieved by mastering the two eyes.\nThe eyes are the gates of the heart; one must lower the lids and seal the orifices.\nAll matters are governed by the heart as a sword: reflect that worldly affairs bring no benefit, and like a raging fire, they are instantly extinguished—do not cling to them.\nThe secret says: *\"With the eyes gaze at the nose, with the nose gaze at the navel; above and below attend to one another, the mind’s point abides in unity. Focus intent on the Mysterious Pass, and thoughts are subdued.\"*\n\n**In movement and stillness, know the Ancestral Origin.**\nMovement and stillness are the interplay of yin and yang.\nThe Ancestral Origin is the source of one’s birth.\nThe cultivator must know that before parents gave form, there was the Mystery of Transformation.\nFrom head to foot, the body is the great robe of Qian and Kun; the convergence of the Five Phases and Four Images is the state before Heaven and Earth divided—a single luminous spark formed the Great Ultimate.\nBelow the heart and above the kidneys, within the indistinct space where thoughts arise without cease—this is the Ancestral Origin.\nMovement and stillness mean harmonizing true qi and settling the true origin.\nExhaling connects to the Heavenly Root; inhaling connects to the Earthly Root—closing the gate is Kun, opening the gate is Qian.\nOn exhalation, the dragon roars and clouds arise; on inhalation, the tiger howls and wind is born.\nWith each opening and closing, movement and stillness, the heart’s intent remains unmoved, allowing true breath to come and go, continuous as if present.\nRefine the breath until it becomes the breath of no-breath, forged into oneness—then spirit may congeal, and the elixir may be achieved.\n\n**Why seek another when nothing remains to be done?**\nIf one can nurture qi, forget speech, and guard the One, subduing body and mind so that spirit returns to the Cavern Chamber, intent fixed within the compass, merging into a single mystery—like a hen brooding an egg, like a dragon nurturing its pearl, ever present, never departing—then with time and deep practice, naturally the millet-grain pearl will appear, radiant as the sun, silently transforming the original spirit, its numinous clarity unfathomable. This is it.\n\n**The True Constant must respond to things; in responding, do not be deluded.**\nThis Dao is the True Constant, yet in engaging with affairs, one is easily bewildered. Thus, in meeting the world, one must not be lost in mundane matters.\nIf one does not engage, one falls into emptiness and void.\nOne must respond when things arise and let them go when they depart.\nTo be upright and luminous is to avoid delusion; the true nature is pure and still, the original spirit congealed.\nThe secret says: *\"Intent misplaced, all is error; non-action falls into emptiness. When the nature is not deluded, it abides; when the nature abides, qi naturally returns.\"*\n\nThe human nature is fierce as fire—joy, anger, sorrow, and delight; love, aversion, desire, and hatred—ever-changing, shifting without constancy. At the slightest provocation, false thoughts arise, making it difficult to still the nature.\nOne must truly restrain anger, and fire descends; truly reduce desire, and water ascends.\nWhen the body does not move, this is refining essence; refining essence makes the tiger roar, and the original spirit solidifies.\nWhen the heart does not move, this is refining qi; refining qi makes the dragon sing, and the original qi is preserved.\nWhen intent does not move, this is refining spirit; refining spirit makes the two qi merge, the Three Origins blend, and the original qi naturally returns.\nThe Three Origins are essence, qi, and spirit; the two qi are yin and yang.\nWhen the cultivator responds to things without delusion, the original spirit returns of itself, and the true nature abides.\nWhen the nature abides, the body’s precelestial qi returns, life is restored to its root—what difficulty remains?\nThe secret says: *\"Turn the light inward, focus the mind within; inner thoughts do not stray out, outer thoughts do not enter. When qi returns, the elixir forms of itself; within the crucible, Kan and Li unite.\"*\n\nWhen the cultivator’s nature is not deluded by worldly affairs, qi returns of itself. Then one witnesses the two vapors ascending and descending in the Central Palace, yin and yang uniting in the elixir crucible. Suddenly, a thread of hot qi from the kidneys surges into the heart’s palace, passion returns to nature—like husband and wife in union, enraptured and intoxicated.\nThe two qi intertwine, forming the elixir’s substance, as water and fire in the Cavern Chamber intermingle in endless circulation. Then spirit rides the qi, and qi lodges in form—no need for miscellaneous arts to attain longevity.\nThe secret says: *\"The three treasures—ears, eyes, and mouth—seal and do not let them open. The true person lurks in the deep abyss, floating and wandering, guarding the compass within.\"*\nUntil the qi fills the Cinnabar Field and the *daogui* is formed.\n\n**Yin and yang reverse their flow, and a thunderous transformation resounds.**\nAt this stage, spirit does not stray outward, qi does not leak away. Spirit returns to the Cavern Chamber, Kan and Li have merged. With ever-greater vigor and dedication, one reaches the utmost emptiness and guards stillness with utmost sincerity. The body is still within the profound darkness, the heart is clear in the realm of nothingness—then true breath abides of itself, the hundred vessels cease their movement, the sun and moon halt their passage, the Jade Pivot ceases to turn. The Great Ultimate is still and generates movement; yang arises in Kun of the southwest.\nKun is the abdomen, also called the Winding River.\nSuddenly, a luminous spark the size of a millet grain appears—this is the sign of the medicine’s birth.\nA brilliant light shines through; the two kidneys boil like a cauldron, the bladder burns like fire. Within the abdomen, the roar of a fierce wind; within the belly, the sound of thunder.\nThis is the Heavenly Root of the *Fu* hexagram manifesting.\nWhen the Heavenly Root appears, stir the heart’s five with spirit to assist it—then the medicine blazes like fire through metal, ascending to pierce the *weilu*. Lightly guide it, silently raise it.\nA mass of harmonious qi, like thunder’s crash, ascends to the Mud Pill Palace, the whole body leaping—this is the *Guai* hexagram of Heaven and Wind.",
      "overlap_context": "arth Obstruction. Since birth from our parents, we originally possess one mercury and one lead—the principle of male-female union. Thus it is said: *\"Qian is father, Kun is mother; male and female unite their essence, and the myriad things transform into purity.\"* The *Book of Changes* is the Great Ultimate of the primordial. If one does not understand this principle, merely casting mercury into lead, one begets sons and daughters; but casting lead into mercury, one becomes a Buddha or immortal.",
      "start_char": 7728,
      "end_char": 8997,
      "start_sentence": 239,
      "end_sentence": 300,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.574092388153076,
      "metadata": {
        "source_file": "dao\\藏外\\玄机直讲.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "由月窟至印堂眉中，漏出元光，即太极动而生阴。 化成神水甘露，内有黍米之珠，落在黄庭之中，点我离中灵汞，结成圣相之体，行周天火候一度。 烹之炼之。 丹自结矣。 白云朝顶上，甘露洒须弥。 到此地位，药即得矣。 二气结刀圭，关窍开通，火降水升，一杰周流，从太极中动天根，过玄谷关，升二十四椎骨节，至天谷关，月窟阴生，香甜美味，降下重楼，无休无息，名日甘露洒须弥。 诀曰：甘露满口，以目送之，以意迎之，送下丹釜，凝结元气以养之。 自饮长生酒，逍遥谁得知！ 养气到此，骨节已开，神水不住上下周流。 往来不息，时时吞咽，谓之长生酒。 诀日：流珠灌养灵根性，修行之人知不知 坐听无弦曲，明通造化机。 功夫到此，耳听仙乐之音，又有钟鼓之韵，五气朝元，三花聚顶，如晚鸦来栖之状，心田开朗，智慧自生，明通三教经书，默悟前生根本，豫知未来休咎，大地山河，如在掌中，目视万里，已得六通之妙，此乃实有也。 吾行实到此际，若有虚言以误后学，天必诛之。 遇之不行，罪遭天谴。 非与师遇，此事难知。 都来二十句，端的上天梯。 自“养气忘言”至此二十句，皆是吕祖真正口决工夫，无半点虚伪，乃修行上天之阶梯。 得悟此诀与注者，可急行之，勿妄漏泄，勿示匪人，以遭天谴。 珍重奉行，克登天阙。",
      "translated_text": "From the Moon Grotto to the Hall of Seals between the brows, primordial light leaks forth—this is the Supreme Polarity moving to generate yin. It transforms into divine water, sweet dew, within which a millet-grain pearl descends into the Yellow Court. There it touches the numinous mercury within *Li*, forging the body of the sacred form, completing one cycle of the celestial fire’s timing. Steep it, refine it. The elixir coalesces of itself.\n\nWhite clouds gather at the crown; sweet dew sprinkles Mount Sumeru. At this stage, the medicine is attained. The two qi congeal into a *daogui*; the passes and orifices open. Fire descends, water ascends—one stream circulates. From the Supreme Polarity’s movement, the Heavenly Root passes the Dark Valley Pass, ascends the twenty-four vertebral joints, reaches the Heavenly Valley Pass. At the Moon Grotto, yin arises, fragrant and sweet, descending the Tower of Nine Stories without cease—this is called *Sweet Dew Sprinkles Mount Sumeru*.\n\nThe formula says: When the mouth is full of sweet dew, send it with the eyes, receive it with the mind, guide it down to the elixir crucible, and congeal the primordial qi to nurture it. Drinking the Wine of Immortality oneself—who could know this freedom!\n\nAt this stage of nurturing qi, the joints have opened, and the divine water ceaselessly circulates up and down. In constant ebb and flow, it is swallowed from time to time—this is called the Wine of Immortality.\n\nThe formula says: Flowing pearls irrigate and nourish the numinous root’s nature—does the cultivator know or not?\n\nSitting, one hears the music of no-strings; the mechanism of creation and transformation becomes lucid. At this level of practice, the ears catch the strains of celestial music, the rhythms of bells and drums. The five qi pay homage to the origin; the three flowers gather at the crown, like evening crows alighting. The heart’s field opens, wisdom arises of itself, the scriptures of the Three Teachings become clear. One silently comprehends the roots of past lives, foresees future fortunes and misfortunes. The great earth and mountains and rivers lie in the palm of the hand; the gaze spans ten thousand miles. The six penetrations’ wonders are attained—this is no illusion.\n\nI have truly reached this stage in my practice. Were I to speak falsely and mislead later learners, Heaven would surely punish me. To encounter this and not practice incurs heavenly retribution. Without meeting a teacher, this matter is difficult to know.\n\nIn all, twenty verses—truly the ladder to Heaven. From *Nurturing Qi, Forgetting Words* to these twenty verses, all are the authentic oral formulas of Ancestor Lü, without a trace of falsehood, the very steps to ascend to Heaven in cultivation.\n\nThose who awaken to this formula and its commentary should hasten to practice it. Do not recklessly leak it, nor show it to the unworthy, lest you incur heavenly retribution. Cherish and uphold it, and you will ascend to the Heavenly Palace.",
      "overlap_context": "ire. Within the abdomen, the roar of a fierce wind; within the belly, the sound of thunder.\nThis is the Heavenly Root of the *Fu* hexagram manifesting.\nWhen the Heavenly Root appears, stir the heart’s five with spirit to assist it—then the medicine blazes like fire through metal, ascending to pierce the *weilu*. Lightly guide it, silently raise it.\nA mass of harmonious qi, like thunder’s crash, ascends to the Mud Pill Palace, the whole body leaping—this is the *Guai* hexagram of Heaven and Wind.",
      "start_char": 8997,
      "end_char": 9535,
      "start_sentence": 301,
      "end_sentence": 321,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.105154037475586,
      "metadata": {
        "source_file": "dao\\藏外\\玄机直讲.txt",
        "category": "藏外"
      }
    }
  ]
}