{
  "source_id": "玄灵转经晚朝行道仪",
  "source_file": "chunked_daozang\\玄灵转经晚朝行道仪.json",
  "total_chunks": 6,
  "total_original_chars": 2863,
  "total_translated_chars": 19695,
  "total_translation_time": 106.7445809841156,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经晚朝行道仪.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Rites for Circulating the Mysterious Numinous Scripture at Dawn, Noon, and Dusk from the Golden Register*\n*Title:* *The Rites for Circulating the Mysterious Numinous Scripture at Dawn, Noon, and Dusk from the Golden Register*\n*Three fascicles.*\n*Source text:* *Zhengtong Daoist Canon*, *Dongxuan* Section, *Weiyi* (Ritual Dignity) Category.\n\n---\n\n### *The Evening Audience Rite for Circulating the Mysterious Numinous Scripture*\n\nThe ritual proceeds according to form.\nAll pay homage to the master and visualize as prescribed.\n\n**Invocation of the Divine Incantation:**\nTo the north ascends the Supreme Mystery, where the Five Qi meander.\nFivefold treasure blossoms, their flowing light resplendent.\nThe numinous radiance is lush and elegant, suffusing the Great Tenuity.\nGaze upward as it pours into my body, unfolding the inner palace in fresh brilliance.\nPacify and guard the numinous abode, where the myriad spirits converge.\nMy form dons feathered raiment, and my risen body soars as an immortal.\n\n**Strike the ritual drum twenty-four times.**\n\nO Most High Three Heavens, Mysterious Primordial Origin, Three Qi, Supreme Venerable Lord Lao:\nSummon forth from within my body the Three and Five Merit Officers, the Attendants of the Left and Right, the Courier Dragon Riders bearing incense, the Golden Lads of Incense, the Jade Maidens scattering flowers, and the Five Thearchs’ Direct Attendants and Daily Incense Officers—thirty-six of each.\nLet them emerge, adorned in solemn vestments, their crowns and sashes trailing.\nNotify the Earth Deities and the numinous perfected of the sacred precinct’s domain.\nThis evening, I ascend the altar to perform the Dao-circulation rite and pay audience to the Imperial Perfected.\nWith reverence, I present these cinnabar sincerities, all inscribed and sealed.\nMay the Supreme Perfected’s Dao-Qi and the numinous treasures’ auspicious radiance descend, flowing into our bodies.\nMay the sincerity of my petition swiftly reach the presence of the Utmost Real, Boundless Dao’s Three Clarities, Supreme Saints, the Purple Tenuity’s Northern Culmen, the Great Thearch of the Northern Dipper, and the Nine August Stellar Lords.\n\n**Proclaim the Dharma Titles:**\nThe humble officiant, [Name], together with the assembled altar officers, respectfully and with one mind, petitions the Supreme Boundless Dao, the Dipper’s Ancestral Master, the Celestial Venerable of Primordial Beginning;\nthe Dipper’s Mysterious Master, the Celestial Venerable of Numinous Treasure;\nthe Dipper’s Lineage Master, the Celestial Venerable of the Dao and Its Virtue;\nthe Jade Thearch of the Vast Heaven;\nthe Great Thearch of the Purple Tenuity;\nthe Great Thearch of the Northern Culmen of the Purple Tenuity;\nthe August Stellar Lord of the Lofty Jade Thearch within the Dipper;\nthe Jade Thearch of the Great Tenuity;\nthe Great Thearch Lord of the Northern Culmen’s Mysterious Minister;\nthe Stellar Lords of the Northern Dipper’s Celestial Flower (Greedy Wolf), Celestial Task (Giant Gate), Celestial Pivot (Salary Storage), Celestial Heart (Literary Curvature), Celestial Quail (Integrity’s Mainstay), Celestial Auxiliary (Military Art), Celestial Impulse (Breaking Army), Celestial Brightness (Left Auxiliary), and Hidden Light (Right Assistant);\nthe Nine August Consorts;\nthe Nine Yin Inner Concubines;\nthe Heavenly Stem Great Sage, Myriad Perfected Numinous Commander, the Radiant Thearch of Astral Light;\nthe Three Terraces and Canopy Stellar Lords within the Dipper;\nthe Stellar Lord of the Natal Star of this life;\nthe Stellar Lord of the Southern Culmen’s Old Man of Longevity and Virtue;\nthe Stellar Lords of the Upper Clarity’s Blessing and Salary Virtues;\nthe Stellar Governor of the Imperial Throne’s Illumination;\nthe Twenty-Eight Constellations’ Stellar Lords;\nthe Sixty Celestial Stems’ Stellar Lords;\nthe Perfected Lords and Saints of the Dao and Virtue’s Mysterious Ministry;\nthe Great Dharma Master Perfected Lords of the Mysterious Center;\nthe Great Dharma Master Perfected Lords of the Three Heavens;\nthe Nine Provinces’ Many Phases Venerable Ones of the Central Heaven;\nthe Embroidered Robe Attendants of the Left and Right;\nthe Bearers of the Goat and Dhāraṇī;\nthe Jade Text Merit Officers of the Four Directions;\nthe Messengers of Communication;\nand the thousand chariots and myriad riders of all the numinous spirits within the Dipper.\n\nWe humbly beseech your vast compassion to deign to gaze down in penetrating insight.\n\nWe have heard:\nThe Central Culmen streams its radiance, while the Left Enclosure blazes in splendor.\n\nThe Primordial Origin inaugurates its course, manifesting the auspicious omen of cranes crying over the jade divination board; the Orthodox Unity receives the transmission, unfolding the esoteric secrets of the Dragon Han’s jasper-bound scriptures. Through these scriptures and precepts, the arts of geomancy are pervaded in full. Cultivating the true Dao to enter the lineage of immortals, delivering the people of heaven and revealing the wondrous Dharma. Sun and stars shine with radiance, rain and dew bestow without partiality. We, your servants, are fortunate to stand upon the Dharma bridge, receiving the sacred creation. Having been enlightened by the imperial transformation, we now proclaim and propagate the august imperial wind.\n\nToday, in reverent compliance with the imperial edict, we solemnly perform the Golden Register rites. We, your servants, purify the jade halls and erect the jasper altar. With myriad fragrant flowers, we signal our earnest prayers for grace; with towering merit and virtue, we aspire to extend life and inscribe blessings. Humbly we knock our heads upon the great anvil, hoping the August Ultimate will incline its heart.\n\nThis evening, ascending the altar to perform the Dao, the Dharma assembly and we now offer the first pinch of incense. May this incense smoke ascend directly to offer reverence to the Most High Perfect and True Precious Dao of the Great Luo, the Primordial Heavenly Worthy of Original Commencement; the Heavenly Emperor of the Purple Tenuity’s Upper Palace; the Two Emperors of the Jade Dipper; the Nine August Stellar Lords; and the Perfected Immortals and Sacred Hosts of the Heaven of Pure Tenuity.\n\nWe, your servants, take refuge in body, take refuge in spirit, take refuge in life, prostrating our heads to the earth, reverently relying upon the Three Venerables of the Most High and the sacred hosts of the ten directions. May the merit and virtue of this incense ascend to offer prayers for His Majesty the Emperor. We humbly pray that the eight extremities gather around the Pole Star, and the Three Powers assist his virtue. May the nine patterns of the tortoise diagram reveal celestial auspices upon the Yellow River’s clarity; may the tiger’s homage span ten thousand years, and the imperial spirit open the divine precincts upon the vast earth.\n\nNow, we burn incense, taking refuge from our honored teachers, the great sacred hosts, and the virtue of the Perfected Ones. After attaining the Dao, may they preserve heaven’s enduring existence, harmonizing with the Dao to achieve true perfection.\n\nThis evening, ascending the altar to perform the Dao, the Dharma assembly and we now offer the second pinch of incense. May this incense smoke ascend directly to offer reverence to the Most High Perfect and True Precious Scriptures of the Jade Clarity Dao Lord; the Heavenly Worthy of Numinous Treasure; the Great Emperor of the Purple Tenuity’s Central Palace of the Northern Culmen; the Stellar Lord of One’s Natal Destiny; the Stellar Governor Illuminating the Imperial Throne; and the Perfected Immortals and Sacred Hosts of the Heaven of Yu Yu.\n\nWe, your servants, take refuge in body, take refuge in spirit, take refuge in life, prostrating our heads to the earth, reverently relying upon the Three Venerables of the Most High and the sacred hosts of the ten directions. May the merit and virtue of this incense respectfully offer prayers for His Highness the Crown Prince. We humbly pray that his fortune’s tree renews daily, and the sprouts of goodness grow ever in spring. May heaven bestow pure felicity, uniting the true *qi* of the Seven Origins; may the emperor grant nine ages, bathing in the numinous light of the Ten Extremities. May the golden tripod inherit the treasure of emptiness and non-being, and the jade field fuse the pearl of mystery and wonder. May the profound dew fly to the clouds, moistening the moon palace and stellar enclosures in perfect harmony; may the auspicious clouds congeal at dawn, covering the golden branches and jade leaves in enduring peace.\n\nNow, we burn incense, taking refuge from our honored teachers, the great sacred hosts, and the virtue of the Perfected Ones. After attaining the Dao, may they preserve heaven’s enduring existence, harmonizing with the Dao to achieve true perfection.\n\nThis evening, ascending the altar to perform the Dao, the Dharma assembly and we now offer the third pinch of incense. May this incense smoke ascend directly to offer reverence to the Most High Perfect and True Precious Masters of the Five Numinous Elders; the Heavenly Worthy of Virtue and Power; the Old Man of the Southern Culmen, Stellar Lord of Longevity and Virtue; the Stellar Lords of Blessing and Virtue of the Highest Clarity; the Stellar Lords of Emolument and Virtue of the Highest Clarity; and the Perfected Immortals and Sacred Hosts of the Heaven of Great Redness.\n\nWe, your servants, take refuge in body, take refuge in spirit, take refuge in life, prostrating our heads to the earth, reverently relying upon the Three Venerables of the Most High and the sacred hosts of the ten directions. May the merit and virtue of this incense flow back to the nine provinces and four seas, to all moving and growing beings imbued with spirit. We humbly pray that the true Dao suffuse and nurture, and the mysterious grace spread and bestow. May the ladders and boats return to transformation, admiring the customs of robes and caps, rites and music; may mountains and marshes share benevolence, freeing scales, shells, feathers, and fur from their burdens.\n\nNow, therefore, we kindle this incense, taking refuge from our own selves to the Great Sacred Host of the Most Venerable Masters, that by their true virtue, having attained the Dao, we may forever preserve longevity and harmonize with the Dao to become true.\n\n**The Three Refuges**\nWith wholehearted devotion, we take refuge in the scriptural treasures of the ten directions; may all beings awaken understanding, receive, uphold, read, and recite.\nWith wholehearted devotion, we take refuge in the Dao treasures of the ten directions; may all beings turn their minds in reverence, offering faith and homage to all.\nWith wholehearted devotion, we take refuge in the master treasures of the ten directions; may all beings ascend the Dharma bridge universally, without hindrance.\n\n**Eulogy of Past Lives**\nAs the scriptures declare, upon encountering the life-bestowing hour of our destiny, the celestial post of the Middle Prime, the Steed of Fate, the Three Calamities, and the Nine Perils, we beseech protection for our present kin, that they may dwell in peace. Through repentance and reverence, may we gradually ascend to wondrous fruition.\n\nIn accordance with the sacred edict, we now reverently perform the Golden Register rites to pray for longevity and extended felicity. We, your servants, lead the pure assembly of this altar in reciting once through the *Highest Clarity Wondrous Numinous Northern Dipper Life-Prolonging True Scripture*, offering it up to the Great Sage of the Central Heaven, the Seventh Celestial Emperor’s Palace, the Heavenly Impulse Breaking-General Jade Dawn Lord.\n\nWe entreat the removal of all perils from the eastern Wood-Yang Three Greens and the Great Fire quadrant. Humbly we implore your compassion and mercy, that you deign to grant your assent.\n\nOverwhelmed by the utmost fervor, we undertake these scriptural practices.\n\n**Eulogy of the Dharma Seat**\n**Inscription of the Scripture**\n**Upon Completion of the Recitation**\n**Eulogy of the Rising from the Seat**\n\nWe, your servants, have hitherto reverently led the pure assembly in ascending the altar to perform the Dao, offering prayers for the eternal peace of the Sage’s longevity. We have recited once through the *Highest Clarity Wondrous Numinous Northern Dipper Life-Prolonging True Scripture*, and the recitation is now complete in full circle. Earnestly we hope that blessings of fortune and longevity may sustain life, that good fruits may accrue to each person, and that all may conduct themselves with sincerity, circling in praise and chant.\n\nProceeding in the *Step of Emptiness*, we lead the way to the eastern quarter, offer incense, and circle back to our positions.\n\n**Seven Primes Covering-Protection Heavenly Worthy**\n\nWe, your servants, humbly follow the scripture’s teaching that at the juncture of one’s destined life-span, calamities may be dissolved, sins repented, blessings invoked, and life prolonged. Holding fast to this true scripture and performing rites according to one’s capacity, virtue and power shall flourish and ascend.\n\nIn accordance with the sacred edict, we undertake the Golden Register rites to pray for longevity and extended felicity. We, your servants, lead the pure assembly of this altar in reciting once through the *Highest Clarity Wondrous Numinous Northern Dipper Life-Prolonging True Scripture*, offering it up to the Great Sage of the Central Heaven, the Eighth Celestial Emperor’s Palace, the Heavenly Inner-Outer Assistant Jade Dawn Lord.\n\nWe entreat the removal of all perils from the southwestern Kun-Yin Three Blacks, the Quail’s Tail, and the *Shichen* quadrant. Humbly we implore your compassion and mercy, that you deign to grant your assent.\n\nOverwhelmed by the utmost fervor, we undertake these scriptural practices.\n\n**Eulogy of the Dharma Seat**\n**Inscription of the Scripture**\n**Upon Completion of the Recitation**\n**Eulogy of the Rising from the Seat**\n\nWe, your servants, have hitherto led the pure assembly in ascending the altar to perform the Dao, offering prayers for the eternal peace of the Sage’s longevity. We have recited once through the *Highest Clarity Wondrous Numinous Northern Dipper Life-Prolonging True Scripture*, and the recitation is now complete. Reverently we hope that felicity and longevity will sustain life, that good fruits will accrue to the person, and that each may conduct themselves with sincerity, circling in praise and chant. Proceeding in void-step, we are led to the southwestern quarter, where incense is offered, and we circle back to our positions.\n\n**Great Compassionate Life-Prolonging Heavenly Worthy**\n\nWe, your servants, respectfully follow the scripture’s teaching: whenever men or women, on their life-mandate birthdays or on various fast-days, purify body and mind, burn incense, and hold this true text, recognizing their own Northern Culmen life-mandate star lord and praying according to their hearts, no good will fail to be answered.\n\nNow, in reverent compliance with the imperial edict, we undertake the register rites to pray for longevity and extended felicity. We, your servants, lead the pure assembly of this altar in reciting once through the *Highest Clarity Wondrous Numinous Northern Dipper Life-Prolonging True Scripture*, offering it up to the Great Sage of the Central Heaven, the Ninth Celestial Emperor’s Palace, the Heavenly Inner-Outer Assistant Jade Dawn Lord.\n\nWe entreat the removal of all perils from the northern Kan-One White and the Dark Void quadrant. Humbly we implore your compassion and mercy, that you deign to grant your assent.\n\nOverwhelmed by the utmost fervor, we undertake these scriptural practices.\n\n**Eulogy of the Dharma Seat**\n**Inscription of the Scripture**\n**Upon Completion of the Recitation**\n**Eulogy of the Rising from the Seat**\n\nWe, your servants, have hitherto led the pure assembly in ascending the altar to perform the Dao rites, offering prayers for the eternal peace of the Sacred Longevity, and reciting once through the *Highest Clarity Wondrous Numinous Northern Dipper Life-Prolonging True Scripture*, now completed in full. Humbly we hope that blessings of fortune and longevity may sustain life, that virtuous fruits may accrue to all, and that each may turn with utmost sincerity to the chanting of praises.\n\nProceeding in void-step, we are led to the northern quarter, where incense is offered, then return in circuit to our positions.\n\n**The Most Longevous Heavenly Worthy of the Mystic Capital**\n\nReverently we gaze upon the Great Sage of the Central Heaven and the Lofty Perfected of the Dipper’s Pole, praying that your vast compassion may deign to cast its profound regard upon us. We, your servants, have hitherto reverently followed the imperial edict, undertaking the register rites to pray for longevity and extended felicity, reciting nine times through the *Highest Clarity Wondrous Numinous Northern Dipper Life-Prolonging True Scripture* to offer it up to the Nine August Jade Dawn Lord of the Dipper, beseeching the removal of all perils from the nine palaces and their corresponding celestial sectors—now likewise completed in full.\n\nProstrate, we pray that your profound hearing may silently penetrate, that your sacred mind may clearly perceive. May the Star Bridge gleam in radiant connection, the Jade Balance secretly turn within the Dipper’s pivot; may the Silver River shine in its revolutions, the Heavenly Steeds flank the wheel’s spokes. May the attendants of the Six Jia and Six Ding spirits, the guardian spirits of the Dipper’s soul and essence, stand watch over the altar’s禁坛. May the twenty-four Peril-Officers, arrayed in solemn procession, surround the altar with their regalia; may the hundred thousand myriad layers of Dao qi ride upon banners of resplendent glory. May our humble plea, though but a footstep away, duly fulfill our repeated supplications. May you enjoy the fullness of the Nine-Five hexagram’s abundance, matching the eight thousand years of the Zhuang’s longevity. As Heaven protects you, may all be auspicious without exception.\n\nWe bow our heads in reverence, taking refuge in the scripture, and chant its praises.\n\n**Threefold Hearing of the Scripture**\nUpon hearing the scripture, may Heaven endure and Earth abide, seas be calm and rivers clear.\nUpon hearing the scripture, may the Sacred Longevity know eternal peace, the imperial domain stand firm.\nUpon hearing the scripture, may the golden branches flourish, the precious succession stretch far and wide.\n\n**Making Vows**\nConcentrating spirit, we burn incense. May the Incense Official Envoys, the Left and Right Dragon-Tiger Lords, and the attendant spirit-officers of incense cause this place where we have this evening performed the recitation and Dao rites to naturally produce golden liquid, cinnabar, and azure mushrooms. May the hundred numinous Perfected gather here before the incense burner. May our cinnabar sincerity move and be received, may vast blessings silently unfold. May the Sacred Longevity know eternal peace, the imperial domain stand forever firm. May the immortal youths of the ten directions and the jade maidens attend, transmitting the fragrant smoke of our sincerity in this offering, swiftly conveying it to the presence of the Utmost True, Boundless Dao, the Three Clarities’ August Perfected, the Purple Tenuity Northern Pole Great Emperor, and the Nine August Star Lords of the Northern Dipper.\n\n**Egress-Hall Hymn**\nThe rite of reciting the *Wondrous Numinous Scripture* and performing the evening Dao rites is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "金箓玄灵转经早午晚行道仪 经名：金箓玄灵转经早午晚行道仪。 三卷。 底本出处：《正统道藏》洞玄部威仪类。 玄灵转经晚朝行道仪 法事如式 各礼师，存念如法 请宣神咒 北上太玄，五炁徘徊。 宝华五重，流光焕辉。 灵景郁秀，洞映太微。 仰注我身，内府鲜开。 安镇灵宅，万神总归。 身生羽服，举形仙飞。 鸣法鼓二十四通 无上三天玄元始三炁太上老君，召出臣身中三五功曹、左右官使者、左右捧香驿龙骑吏、侍香金童、传言散花玉女、五帝直符直日香官，各三十六人出。 出者，严装显服，冠带垂缨。 关启玄坛土地，方域神真。 臣今晚朝，升坛行道，朝谒帝真。 钦奉其诸丹悃，具载缄誊。 愿得太上至真道炁灵宝瑞光下降，流入臣等身中，令臣所启之诚，速达径御至真无极大道三清上圣紫微北极大帝北斗九皇星君御前。 请称法位 具位臣姓某与临坛官众等，谨同诚上启太上无极大道斗极祖师元始天尊，斗极玄师灵宝天尊，斗极宗师道德天尊，昊天玉皇上帝，紫微天皇大帝，北极紫微大帝，斗中高上玉皇尊星君，太微玉帝，北极玄卿大帝君，北斗天英贪狼太星君、北斗天任巨门元星君、北斗天枢禄存真星君、北斗天心文曲纽星君、北斗天禽廉贞纲星君、北斗天辅武曲纪星君、北斗天冲破军关星君、北斗洞明左辅星君、北斗隐光右弼星君、九皇夫人、九阴内妃、天罡大圣万真节度奎光帝君、北斗中三台华盖星君，当生本命星君，南极老人寿德星君，上清福德星君、上清禄德星君，帝座照临星宰、二十八宿星君、六十甲子星君、道德玄曹官君圣众、玄中大法师真君、三天大法师真君、中天九省诸相丈人、左右绣衣使者、擎羊陀罗使者、四直玉文功曹、通事舍人，斗中千乘万骑一切真灵。 恭望洪慈，俯垂洞鉴。 臣闻，中极流辉，左垣焕彩。",
      "translated_text": "*The Rites for Circulating the Mysterious Numinous Scripture at Dawn, Noon, and Dusk from the Golden Register*\n*Title:* *The Rites for Circulating the Mysterious Numinous Scripture at Dawn, Noon, and Dusk from the Golden Register*\n*Three fascicles.*\n*Source text:* *Zhengtong Daoist Canon*, *Dongxuan* Section, *Weiyi* (Ritual Dignity) Category.\n\n---\n\n### *The Evening Audience Rite for Circulating the Mysterious Numinous Scripture*\n\nThe ritual proceeds according to form.\nAll pay homage to the master and visualize as prescribed.\n\n**Invocation of the Divine Incantation:**\nTo the north ascends the Supreme Mystery, where the Five Qi meander.\nFivefold treasure blossoms, their flowing light resplendent.\nThe numinous radiance is lush and elegant, suffusing the Great Tenuity.\nGaze upward as it pours into my body, unfolding the inner palace in fresh brilliance.\nPacify and guard the numinous abode, where the myriad spirits converge.\nMy form dons feathered raiment, and my risen body soars as an immortal.\n\n**Strike the ritual drum twenty-four times.**\n\nO Most High Three Heavens, Mysterious Primordial Origin, Three Qi, Supreme Venerable Lord Lao:\nSummon forth from within my body the Three and Five Merit Officers, the Attendants of the Left and Right, the Courier Dragon Riders bearing incense, the Golden Lads of Incense, the Jade Maidens scattering flowers, and the Five Thearchs’ Direct Attendants and Daily Incense Officers—thirty-six of each.\nLet them emerge, adorned in solemn vestments, their crowns and sashes trailing.\nNotify the Earth Deities and the numinous perfected of the sacred precinct’s domain.\nThis evening, I ascend the altar to perform the Dao-circulation rite and pay audience to the Imperial Perfected.\nWith reverence, I present these cinnabar sincerities, all inscribed and sealed.\nMay the Supreme Perfected’s Dao-Qi and the numinous treasures’ auspicious radiance descend, flowing into our bodies.\nMay the sincerity of my petition swiftly reach the presence of the Utmost Real, Boundless Dao’s Three Clarities, Supreme Saints, the Purple Tenuity’s Northern Culmen, the Great Thearch of the Northern Dipper, and the Nine August Stellar Lords.\n\n**Proclaim the Dharma Titles:**\nThe humble officiant, [Name], together with the assembled altar officers, respectfully and with one mind, petitions the Supreme Boundless Dao, the Dipper’s Ancestral Master, the Celestial Venerable of Primordial Beginning;\nthe Dipper’s Mysterious Master, the Celestial Venerable of Numinous Treasure;\nthe Dipper’s Lineage Master, the Celestial Venerable of the Dao and Its Virtue;\nthe Jade Thearch of the Vast Heaven;\nthe Great Thearch of the Purple Tenuity;\nthe Great Thearch of the Northern Culmen of the Purple Tenuity;\nthe August Stellar Lord of the Lofty Jade Thearch within the Dipper;\nthe Jade Thearch of the Great Tenuity;\nthe Great Thearch Lord of the Northern Culmen’s Mysterious Minister;\nthe Stellar Lords of the Northern Dipper’s Celestial Flower (Greedy Wolf), Celestial Task (Giant Gate), Celestial Pivot (Salary Storage), Celestial Heart (Literary Curvature), Celestial Quail (Integrity’s Mainstay), Celestial Auxiliary (Military Art), Celestial Impulse (Breaking Army), Celestial Brightness (Left Auxiliary), and Hidden Light (Right Assistant);\nthe Nine August Consorts;\nthe Nine Yin Inner Concubines;\nthe Heavenly Stem Great Sage, Myriad Perfected Numinous Commander, the Radiant Thearch of Astral Light;\nthe Three Terraces and Canopy Stellar Lords within the Dipper;\nthe Stellar Lord of the Natal Star of this life;\nthe Stellar Lord of the Southern Culmen’s Old Man of Longevity and Virtue;\nthe Stellar Lords of the Upper Clarity’s Blessing and Salary Virtues;\nthe Stellar Governor of the Imperial Throne’s Illumination;\nthe Twenty-Eight Constellations’ Stellar Lords;\nthe Sixty Celestial Stems’ Stellar Lords;\nthe Perfected Lords and Saints of the Dao and Virtue’s Mysterious Ministry;\nthe Great Dharma Master Perfected Lords of the Mysterious Center;\nthe Great Dharma Master Perfected Lords of the Three Heavens;\nthe Nine Provinces’ Many Phases Venerable Ones of the Central Heaven;\nthe Embroidered Robe Attendants of the Left and Right;\nthe Bearers of the Goat and Dhāraṇī;\nthe Jade Text Merit Officers of the Four Directions;\nthe Messengers of Communication;\nand the thousand chariots and myriad riders of all the numinous spirits within the Dipper.\n\nWe humbly beseech your vast compassion to deign to gaze down in penetrating insight.\n\nWe have heard:\nThe Central Culmen streams its radiance, while the Left Enclosure blazes in splendor.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 712,
      "start_sentence": 0,
      "end_sentence": 24,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.847650051116943,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经晚朝行道仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "混元启运，呈鹤呜玉局之祥； 正一承流，演龙汉瑶编之秘。 由兹经诀，遍彻堪舆。 修正道以入仙宗，度天民而示妙法。 日星有耀，雨露无私。 臣等幸际法桥，禀依圣造。 既缉熙於帝化，盍宣畅於皇风。 以今钦奉纶音，崇修金箓。 臣等肃严琳宇，聿建瑶坛。 种种香花，旌请命祈恩之悃； 巍巍功德，企延生注福之私。 庸扣首於大钧，希留心於皇极。 以今晚朝，升坛行道，请法众等，运兹初捻上香。 愿此香烟腾空，径上供养无上至真道宝大罗元始天尊、紫微上宫天皇大帝、玉斗二帝、九皇星君、清微天宫真仙圣众。 臣等皈身皈神、皈命，首体投地，仰依太上三尊、十方众圣。 愿以是香功德，上祝皇帝陛下。 伏愿八极拱辰，三灵辅德。 龟图九范，天开圣瑞於河清； 虎拜万年，帝辟神畿於地大。 今故烧香，自皈依师尊大圣众，至真之德，得道之后，保天长存，和与道合真。 以今晚朝，升坛行道，请法众等，运兹二捻上香。 愿此香烟腾空，径上供养无上至真经宝玉宸道君，灵宝天尊、紫微中宫北极大帝、当生本命元辰星君、帝座照临星宰、禹余天宫真仙圣众。 臣等皈身皈神饭命，首体投地，仰依太上三尊、十方众圣。 愿以是香功德，敬祝皇太子殿下。 伏愿福树曰新，善芽春长。 天锡纯嘏，合正炁於七元； 帝与九龄，沐灵光於十极。 金鼎胤虚无之宝，玉田融玄妙之珠。 湛露飞霄，润月殿星垣而咸若； 卿云凝晓，覆金枝玉叶以常宁。 今故烧香，自皈依师尊大圣众，至真之德，得道之后，保天长存，和与道合真。 以今晚朝，升坛行道，请法众等，运兹三捻上香。 愿此香烟腾空，径上供养至真无上师宝五灵玄老、道德天尊、南极老人寿德星君、上清福德星君、上清禄德星君、大赤天宫真仙圣众。 臣等皈身皈神皈命，首体投地，仰依太上三尊、十方众圣。 愿以是香功德，归流九州四海、动植含灵。 伏愿正道涵濡，玄恩披拂。 梯航归化，慕衣冠 礼乐之风； 山泽同仁，脱鳞介羽毛之累。",
      "translated_text": "The Primordial Origin inaugurates its course, manifesting the auspicious omen of cranes crying over the jade divination board; the Orthodox Unity receives the transmission, unfolding the esoteric secrets of the Dragon Han’s jasper-bound scriptures. Through these scriptures and precepts, the arts of geomancy are pervaded in full. Cultivating the true Dao to enter the lineage of immortals, delivering the people of heaven and revealing the wondrous Dharma. Sun and stars shine with radiance, rain and dew bestow without partiality. We, your servants, are fortunate to stand upon the Dharma bridge, receiving the sacred creation. Having been enlightened by the imperial transformation, we now proclaim and propagate the august imperial wind.\n\nToday, in reverent compliance with the imperial edict, we solemnly perform the Golden Register rites. We, your servants, purify the jade halls and erect the jasper altar. With myriad fragrant flowers, we signal our earnest prayers for grace; with towering merit and virtue, we aspire to extend life and inscribe blessings. Humbly we knock our heads upon the great anvil, hoping the August Ultimate will incline its heart.\n\nThis evening, ascending the altar to perform the Dao, the Dharma assembly and we now offer the first pinch of incense. May this incense smoke ascend directly to offer reverence to the Most High Perfect and True Precious Dao of the Great Luo, the Primordial Heavenly Worthy of Original Commencement; the Heavenly Emperor of the Purple Tenuity’s Upper Palace; the Two Emperors of the Jade Dipper; the Nine August Stellar Lords; and the Perfected Immortals and Sacred Hosts of the Heaven of Pure Tenuity.\n\nWe, your servants, take refuge in body, take refuge in spirit, take refuge in life, prostrating our heads to the earth, reverently relying upon the Three Venerables of the Most High and the sacred hosts of the ten directions. May the merit and virtue of this incense ascend to offer prayers for His Majesty the Emperor. We humbly pray that the eight extremities gather around the Pole Star, and the Three Powers assist his virtue. May the nine patterns of the tortoise diagram reveal celestial auspices upon the Yellow River’s clarity; may the tiger’s homage span ten thousand years, and the imperial spirit open the divine precincts upon the vast earth.\n\nNow, we burn incense, taking refuge from our honored teachers, the great sacred hosts, and the virtue of the Perfected Ones. After attaining the Dao, may they preserve heaven’s enduring existence, harmonizing with the Dao to achieve true perfection.\n\nThis evening, ascending the altar to perform the Dao, the Dharma assembly and we now offer the second pinch of incense. May this incense smoke ascend directly to offer reverence to the Most High Perfect and True Precious Scriptures of the Jade Clarity Dao Lord; the Heavenly Worthy of Numinous Treasure; the Great Emperor of the Purple Tenuity’s Central Palace of the Northern Culmen; the Stellar Lord of One’s Natal Destiny; the Stellar Governor Illuminating the Imperial Throne; and the Perfected Immortals and Sacred Hosts of the Heaven of Yu Yu.\n\nWe, your servants, take refuge in body, take refuge in spirit, take refuge in life, prostrating our heads to the earth, reverently relying upon the Three Venerables of the Most High and the sacred hosts of the ten directions. May the merit and virtue of this incense respectfully offer prayers for His Highness the Crown Prince. We humbly pray that his fortune’s tree renews daily, and the sprouts of goodness grow ever in spring. May heaven bestow pure felicity, uniting the true *qi* of the Seven Origins; may the emperor grant nine ages, bathing in the numinous light of the Ten Extremities. May the golden tripod inherit the treasure of emptiness and non-being, and the jade field fuse the pearl of mystery and wonder. May the profound dew fly to the clouds, moistening the moon palace and stellar enclosures in perfect harmony; may the auspicious clouds congeal at dawn, covering the golden branches and jade leaves in enduring peace.\n\nNow, we burn incense, taking refuge from our honored teachers, the great sacred hosts, and the virtue of the Perfected Ones. After attaining the Dao, may they preserve heaven’s enduring existence, harmonizing with the Dao to achieve true perfection.\n\nThis evening, ascending the altar to perform the Dao, the Dharma assembly and we now offer the third pinch of incense. May this incense smoke ascend directly to offer reverence to the Most High Perfect and True Precious Masters of the Five Numinous Elders; the Heavenly Worthy of Virtue and Power; the Old Man of the Southern Culmen, Stellar Lord of Longevity and Virtue; the Stellar Lords of Blessing and Virtue of the Highest Clarity; the Stellar Lords of Emolument and Virtue of the Highest Clarity; and the Perfected Immortals and Sacred Hosts of the Heaven of Great Redness.\n\nWe, your servants, take refuge in body, take refuge in spirit, take refuge in life, prostrating our heads to the earth, reverently relying upon the Three Venerables of the Most High and the sacred hosts of the ten directions. May the merit and virtue of this incense flow back to the nine provinces and four seas, to all moving and growing beings imbued with spirit. We humbly pray that the true Dao suffuse and nurture, and the mysterious grace spread and bestow. May the ladders and boats return to transformation, admiring the customs of robes and caps, rites and music; may mountains and marshes share benevolence, freeing scales, shells, feathers, and fur from their burdens.",
      "overlap_context": "hases Venerable Ones of the Central Heaven;\nthe Embroidered Robe Attendants of the Left and Right;\nthe Bearers of the Goat and Dhāraṇī;\nthe Jade Text Merit Officers of the Four Directions;\nthe Messengers of Communication;\nand the thousand chariots and myriad riders of all the numinous spirits within the Dipper.\n\nWe humbly beseech your vast compassion to deign to gaze down in penetrating insight.\n\nWe have heard:\nThe Central Culmen streams its radiance, while the Left Enclosure blazes in splendor.",
      "start_char": 712,
      "end_char": 1464,
      "start_sentence": 25,
      "end_sentence": 63,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.83057188987732,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经晚朝行道仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "今故烧香，自皈依师尊大圣众，至真之德，得道之后，永保长生，和与道合真。 三皈依 志心皈依，十方经宝，当愿众生，心开悟解，受持读诵。 志心皈依，十方道宝，当愿众生，起心回向，一切信礼。 志心皈依，十方师宝，当愿众生，普上法桥，无有障碍。 宿命赞 臣等谨按经云，遇本命生辰，告身中元辰驿马，削落三灾九厄，保见今眷属安宁，悔过虔恭，渐登妙果。 以今钦奉纶音，崇修金箓，祝寿延禧。 臣等谨率在坛清众，转诵《太上玄灵北斗本命延生真经》各一过，上祝中天大圣、第七上帝府天冲破军玉晨君。 乞为削落东震三绿、大火分野一切之厄。 仰希矜轸，俯赐允俞。 臣等不胜激切之至，修行经法。 敷座赞 题经 诵经毕 解座赞",
      "translated_text": "Now, therefore, we kindle this incense, taking refuge from our own selves to the Great Sacred Host of the Most Venerable Masters, that by their true virtue, having attained the Dao, we may forever preserve longevity and harmonize with the Dao to become true.\n\n**The Three Refuges**\nWith wholehearted devotion, we take refuge in the scriptural treasures of the ten directions; may all beings awaken understanding, receive, uphold, read, and recite.\nWith wholehearted devotion, we take refuge in the Dao treasures of the ten directions; may all beings turn their minds in reverence, offering faith and homage to all.\nWith wholehearted devotion, we take refuge in the master treasures of the ten directions; may all beings ascend the Dharma bridge universally, without hindrance.\n\n**Eulogy of Past Lives**\nAs the scriptures declare, upon encountering the life-bestowing hour of our destiny, the celestial post of the Middle Prime, the Steed of Fate, the Three Calamities, and the Nine Perils, we beseech protection for our present kin, that they may dwell in peace. Through repentance and reverence, may we gradually ascend to wondrous fruition.\n\nIn accordance with the sacred edict, we now reverently perform the Golden Register rites to pray for longevity and extended felicity. We, your servants, lead the pure assembly of this altar in reciting once through the *Highest Clarity Wondrous Numinous Northern Dipper Life-Prolonging True Scripture*, offering it up to the Great Sage of the Central Heaven, the Seventh Celestial Emperor’s Palace, the Heavenly Impulse Breaking-General Jade Dawn Lord.\n\nWe entreat the removal of all perils from the eastern Wood-Yang Three Greens and the Great Fire quadrant. Humbly we implore your compassion and mercy, that you deign to grant your assent.\n\nOverwhelmed by the utmost fervor, we undertake these scriptural practices.\n\n**Eulogy of the Dharma Seat**\n**Inscription of the Scripture**\n**Upon Completion of the Recitation**\n**Eulogy of the Rising from the Seat**",
      "overlap_context": "h and the sacred hosts of the ten directions. May the merit and virtue of this incense flow back to the nine provinces and four seas, to all moving and growing beings imbued with spirit. We humbly pray that the true Dao suffuse and nurture, and the mysterious grace spread and bestow. May the ladders and boats return to transformation, admiring the customs of robes and caps, rites and music; may mountains and marshes share benevolence, freeing scales, shells, feathers, and fur from their burdens.",
      "start_char": 1464,
      "end_char": 1776,
      "start_sentence": 64,
      "end_sentence": 79,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.33200716972351,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经晚朝行道仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "臣等向来，祗率清众，升坛行道，上祝圣寿万安，转诵《太上玄灵北斗本命延生真经》各一过，并已周圆。 恭望福寿资命，善果臻身，人各运诚，旋行赞咏。 步虚，引至东方，上香，旋行复位 七元覆护天尊 臣等谨按经云，本命限期，可以消灾忏罪，请福延生。 持此真经，随力章醮，福德增崇。 以今钦奉纶音，崇修金箓，祝寿延禧。 臣等谨率在坛清众，转诵《太上玄灵北斗本命延生真经》各一过，上祝中天大圣、第八玉帝府天内外辅玉晨君。 乞为削落西南坤位、二黑鹑尾、实沈分野一切之厄。 仰希矜轸，俯赐允俞。 臣等不胜激切之至，修行经法。 敷座赞 题经 诵经毕 解座赞",
      "translated_text": "We, your servants, have hitherto reverently led the pure assembly in ascending the altar to perform the Dao, offering prayers for the eternal peace of the Sage’s longevity. We have recited once through the *Highest Clarity Wondrous Numinous Northern Dipper Life-Prolonging True Scripture*, and the recitation is now complete in full circle. Earnestly we hope that blessings of fortune and longevity may sustain life, that good fruits may accrue to each person, and that all may conduct themselves with sincerity, circling in praise and chant.\n\nProceeding in the *Step of Emptiness*, we lead the way to the eastern quarter, offer incense, and circle back to our positions.\n\n**Seven Primes Covering-Protection Heavenly Worthy**\n\nWe, your servants, humbly follow the scripture’s teaching that at the juncture of one’s destined life-span, calamities may be dissolved, sins repented, blessings invoked, and life prolonged. Holding fast to this true scripture and performing rites according to one’s capacity, virtue and power shall flourish and ascend.\n\nIn accordance with the sacred edict, we undertake the Golden Register rites to pray for longevity and extended felicity. We, your servants, lead the pure assembly of this altar in reciting once through the *Highest Clarity Wondrous Numinous Northern Dipper Life-Prolonging True Scripture*, offering it up to the Great Sage of the Central Heaven, the Eighth Celestial Emperor’s Palace, the Heavenly Inner-Outer Assistant Jade Dawn Lord.\n\nWe entreat the removal of all perils from the southwestern Kun-Yin Three Blacks, the Quail’s Tail, and the *Shichen* quadrant. Humbly we implore your compassion and mercy, that you deign to grant your assent.\n\nOverwhelmed by the utmost fervor, we undertake these scriptural practices.\n\n**Eulogy of the Dharma Seat**\n**Inscription of the Scripture**\n**Upon Completion of the Recitation**\n**Eulogy of the Rising from the Seat**",
      "overlap_context": " the Seventh Celestial Emperor’s Palace, the Heavenly Impulse Breaking-General Jade Dawn Lord.\n\nWe entreat the removal of all perils from the eastern Wood-Yang Three Greens and the Great Fire quadrant. Humbly we implore your compassion and mercy, that you deign to grant your assent.\n\nOverwhelmed by the utmost fervor, we undertake these scriptural practices.\n\n**Eulogy of the Dharma Seat**\n**Inscription of the Scripture**\n**Upon Completion of the Recitation**\n**Eulogy of the Rising from the Seat**",
      "start_char": 1776,
      "end_char": 2053,
      "start_sentence": 80,
      "end_sentence": 94,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.018447160720825,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经晚朝行道仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "臣等向来，祇率清众，升坛行道，上祝圣寿万安，转诵《太上玄灵北斗本命延生真经》各一过，并已周圆。 恭望福寿资命，善果臻身，人各运诚，旋行赞咏。 步虚，引至西南方，上香，旋行复位 大慈延寿天尊 臣等谨按经云，凡有男女，於本命生辰及诸斋日，清净身心，焚香持此真文，自认北极本命星君，随心祷祝，善无不应。 以今钦奉纶音，崇修金箓，祝寿延禧。 臣等谨率在坛清众，转诵《太上玄灵北斗本命延生真经》各一过，上祝中天大圣、第九大帝府天蓬内弼玉晨君。 乞为削落北坎一白、玄枵分野一切之厄。 仰希矜轸，俯赐允俞。 臣等不胜激切之至，修行经法。 敷座赞 题经 诵经毕 解座赞",
      "translated_text": "We, your servants, have hitherto led the pure assembly in ascending the altar to perform the Dao, offering prayers for the eternal peace of the Sage’s longevity. We have recited once through the *Highest Clarity Wondrous Numinous Northern Dipper Life-Prolonging True Scripture*, and the recitation is now complete. Reverently we hope that felicity and longevity will sustain life, that good fruits will accrue to the person, and that each may conduct themselves with sincerity, circling in praise and chant. Proceeding in void-step, we are led to the southwestern quarter, where incense is offered, and we circle back to our positions.\n\n**Great Compassionate Life-Prolonging Heavenly Worthy**\n\nWe, your servants, respectfully follow the scripture’s teaching: whenever men or women, on their life-mandate birthdays or on various fast-days, purify body and mind, burn incense, and hold this true text, recognizing their own Northern Culmen life-mandate star lord and praying according to their hearts, no good will fail to be answered.\n\nNow, in reverent compliance with the imperial edict, we undertake the register rites to pray for longevity and extended felicity. We, your servants, lead the pure assembly of this altar in reciting once through the *Highest Clarity Wondrous Numinous Northern Dipper Life-Prolonging True Scripture*, offering it up to the Great Sage of the Central Heaven, the Ninth Celestial Emperor’s Palace, the Heavenly Inner-Outer Assistant Jade Dawn Lord.\n\nWe entreat the removal of all perils from the northern Kan-One White and the Dark Void quadrant. Humbly we implore your compassion and mercy, that you deign to grant your assent.\n\nOverwhelmed by the utmost fervor, we undertake these scriptural practices.\n\n**Eulogy of the Dharma Seat**\n**Inscription of the Scripture**\n**Upon Completion of the Recitation**\n**Eulogy of the Rising from the Seat**",
      "overlap_context": "tial Emperor’s Palace, the Heavenly Inner-Outer Assistant Jade Dawn Lord.\n\nWe entreat the removal of all perils from the southwestern Kun-Yin Three Blacks, the Quail’s Tail, and the *Shichen* quadrant. Humbly we implore your compassion and mercy, that you deign to grant your assent.\n\nOverwhelmed by the utmost fervor, we undertake these scriptural practices.\n\n**Eulogy of the Dharma Seat**\n**Inscription of the Scripture**\n**Upon Completion of the Recitation**\n**Eulogy of the Rising from the Seat**",
      "start_char": 2053,
      "end_char": 2340,
      "start_sentence": 95,
      "end_sentence": 108,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.3398916721344,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经晚朝行道仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "臣等向来，祇率清众，升坛行道，上祝圣寿万安，转诵《太上玄灵北斗本命延生真经》各一过，并已周圆。 恭望福寿资命，善果臻身，人各运诚，旋行赞咏。 步虚，引至北方，上香，旋行复位 玄都万寿天尊 仰惟中天大圣、斗极高真，愿运洪慈，俯垂渊鉴。 臣等向来，钦奉纶音，崇修金箓，祝寿延禧，转诵《太上玄灵北斗本命延生真经》九过，上祝九皇玉晨道君，削落九宫分野一切灾厄，并已周圆。 伏愿渊听潜通，圣心洞鉴。 星桥辉贯，玉衡密运於魁罡； 云汉昭回，天驷旁骖於轮辐。 六甲六丁之侍卫，斗魂斗魄之禁坛。 二十四厄灵官，拥森罗之卤簿； 百千万重道炁，乘赫奕之旌旄。 不违只尺之私，式副再三之祷。 享九五箕畴之盛，等八千庄算之长。 自天佑之，吉无不利。 稽首皈依，闻经赞咏。 三闻经 闻经已后，当愿天长地久，海晏河清。 闻经已后，当愿圣寿万安，皇图巩固。 闻经已后，当愿金枝蕃衍，宝历绵洪。 发愿 存神烧香 香官使者、左右龙虎君、侍香诸灵官，当令臣向来晚朝转经行道之所，自然生金液丹碧芝英。 百灵众真，交会在此，香火炉前。 当愿丹诚感格，鸿贶潜敷。 圣寿万安，皇图永固。 十方仙童，王女接侍，兰烟传臣向来所奏之诚，速达径御至真无极大道三清上圣紫微北极大帝北斗九皇星君御前。 出堂颂 玄灵转经晚朝行道仪竟",
      "translated_text": "We, your servants, have hitherto led the pure assembly in ascending the altar to perform the Dao rites, offering prayers for the eternal peace of the Sacred Longevity, and reciting once through the *Highest Clarity Wondrous Numinous Northern Dipper Life-Prolonging True Scripture*, now completed in full. Humbly we hope that blessings of fortune and longevity may sustain life, that virtuous fruits may accrue to all, and that each may turn with utmost sincerity to the chanting of praises.\n\nProceeding in void-step, we are led to the northern quarter, where incense is offered, then return in circuit to our positions.\n\n**The Most Longevous Heavenly Worthy of the Mystic Capital**\n\nReverently we gaze upon the Great Sage of the Central Heaven and the Lofty Perfected of the Dipper’s Pole, praying that your vast compassion may deign to cast its profound regard upon us. We, your servants, have hitherto reverently followed the imperial edict, undertaking the register rites to pray for longevity and extended felicity, reciting nine times through the *Highest Clarity Wondrous Numinous Northern Dipper Life-Prolonging True Scripture* to offer it up to the Nine August Jade Dawn Lord of the Dipper, beseeching the removal of all perils from the nine palaces and their corresponding celestial sectors—now likewise completed in full.\n\nProstrate, we pray that your profound hearing may silently penetrate, that your sacred mind may clearly perceive. May the Star Bridge gleam in radiant connection, the Jade Balance secretly turn within the Dipper’s pivot; may the Silver River shine in its revolutions, the Heavenly Steeds flank the wheel’s spokes. May the attendants of the Six Jia and Six Ding spirits, the guardian spirits of the Dipper’s soul and essence, stand watch over the altar’s禁坛. May the twenty-four Peril-Officers, arrayed in solemn procession, surround the altar with their regalia; may the hundred thousand myriad layers of Dao qi ride upon banners of resplendent glory. May our humble plea, though but a footstep away, duly fulfill our repeated supplications. May you enjoy the fullness of the Nine-Five hexagram’s abundance, matching the eight thousand years of the Zhuang’s longevity. As Heaven protects you, may all be auspicious without exception.\n\nWe bow our heads in reverence, taking refuge in the scripture, and chant its praises.\n\n**Threefold Hearing of the Scripture**\nUpon hearing the scripture, may Heaven endure and Earth abide, seas be calm and rivers clear.\nUpon hearing the scripture, may the Sacred Longevity know eternal peace, the imperial domain stand firm.\nUpon hearing the scripture, may the golden branches flourish, the precious succession stretch far and wide.\n\n**Making Vows**\nConcentrating spirit, we burn incense. May the Incense Official Envoys, the Left and Right Dragon-Tiger Lords, and the attendant spirit-officers of incense cause this place where we have this evening performed the recitation and Dao rites to naturally produce golden liquid, cinnabar, and azure mushrooms. May the hundred numinous Perfected gather here before the incense burner. May our cinnabar sincerity move and be received, may vast blessings silently unfold. May the Sacred Longevity know eternal peace, the imperial domain stand forever firm. May the immortal youths of the ten directions and the jade maidens attend, transmitting the fragrant smoke of our sincerity in this offering, swiftly conveying it to the presence of the Utmost True, Boundless Dao, the Three Clarities’ August Perfected, the Purple Tenuity Northern Pole Great Emperor, and the Nine August Star Lords of the Northern Dipper.\n\n**Egress-Hall Hymn**\nThe rite of reciting the *Wondrous Numinous Scripture* and performing the evening Dao rites is now complete.",
      "overlap_context": "entral Heaven, the Ninth Celestial Emperor’s Palace, the Heavenly Inner-Outer Assistant Jade Dawn Lord.\n\nWe entreat the removal of all perils from the northern Kan-One White and the Dark Void quadrant. Humbly we implore your compassion and mercy, that you deign to grant your assent.\n\nOverwhelmed by the utmost fervor, we undertake these scriptural practices.\n\n**Eulogy of the Dharma Seat**\n**Inscription of the Scripture**\n**Upon Completion of the Recitation**\n**Eulogy of the Rising from the Seat**",
      "start_char": 2340,
      "end_char": 2889,
      "start_sentence": 109,
      "end_sentence": 137,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.376013040542603,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经晚朝行道仪.txt",
        "category": "威仪类"
      }
    }
  ]
}