{
  "source_id": "玄灵转经午朝行道仪",
  "source_file": "chunked_daozang\\玄灵转经午朝行道仪.json",
  "total_chunks": 5,
  "total_original_chars": 2640,
  "total_translated_chars": 18253,
  "total_translation_time": 93.21896529197693,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经午朝行道仪.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Rites for Circulating the Mysterious Numinous Scripture at Dawn, Noon, and Dusk*\n**Scripture Title:** *The Rites for Circulating the Mysterious Numinous Scripture at Dawn, Noon, and Dusk*\nThree fascicles.\nSource text: *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, *Weiyi* Category.\n\n---\n\n**The Noon Rites for Circulating the Mysterious Numinous Scripture**\n\nThe ritual proceeds according to form.\nAll pay homage to the master and maintain visualization as prescribed.\nInvite the recitation of the divine incantation:\n\n*\"The Supreme Mysterious One, the Nine Augusts exhale their essence.\nThree, five, seven transformations—penetrating vision of the hidden and dark.\nSun and moon cast their radiance, descending to illumine the divine court.\nTheir brilliance spans the Six Directions; the Supreme One and August Sovereign attain tranquility.\nThe Imperial Lord of the Golden Portal, the golden script stands unshaken.\nThe Five Elders present the talisman; Heaven and Earth are perfected as one.\nMay I be free from delusion, attaining the true numen.\nRepelling the myriad evils, calamities and harms are all pacified.\nAscending to the Heavenly August, returning from old age to infancy.\nThe Great Emperor issues his decree; the hundred spirits reverently heed.\"*\n\nStrike the ritual drum twenty-four times.\n\n*\"The Most High Three Heavens, the Primordial Qi of the Mysterious Origin, the Most High Lord Lao, summon forth from within my body the Three and Five Merit Officials, the Left and Right Attendant Envoys, the Left and Right Dragon-Riding Couriers bearing incense, the Golden Lads Attending Incense, the Jade Maidens Scattering Flowers, the Five Thearchs’ Direct Talisman Officials of the Day, each thirty-six in number, to emerge.\nEmerging, they don their solemn attire, caps and sashes with pendants.\nNotify the Land Spirit of the Mysterious Altar and the deities of the local domain.\nAt this noon hour, I ascend the altar to perform the Dao-circulation, paying homage to the Imperial Perfected.\nReverently offering these cinnabar sincerities, all recorded in sealed script.\nMay the auspicious radiance of the Most High, the Perfect Dao, the numinous treasure, descend and flow into our bodies.\nMay the sincerity of my supplication swiftly reach the presence of the Perfect and Boundless Great Dao of the Three Clarities, the Supreme Saints, the Purple Tenuity Northern Culmen Great Emperor, the Nine August Star Lords of the Northern Dipper.\"*\n\n**Proclaiming the Dharma Titles:**\n\n*\"The undersigned official of such-and-such rank, [Name], together with the assembled altar officers, jointly and sincerely address the Most High and Boundless Great Dao, the Dipper Culmen Ancestral Master, the Celestial Worthy of Primordial Beginning; the Dipper Culmen Mysterious Master, the Celestial Worthy of Numinous Treasure; the Dipper Culmen Ancestral Master, the Celestial Worthy of Dao and Virtue; the Jade Thearch of the Vast Heaven; the Heavenly August Great Emperor of Purple Tenuity; the Great Emperor of the Northern Culmen of Purple Tenuity; the August Star Lord of the Highest Jade Thearch within the Dipper; the Jade Emperor of the Supreme Subtlety; the Great Emperor Lord of the Mysterious Minister of the Northern Culmen; the Great Star Lord of Heavenly Hero, Greedy Wolf of the Northern Dipper; the Primordial Star Lord of Heavenly Task, Great Gate of the Northern Dipper; the True Star Lord of Heavenly Pivot, Salary-Existence of the Northern Dipper; the Star Lord of Heavenly Heart, Literary Curve and Tie of the Northern Dipper; the Star Lord of Heavenly Wings, Upright Integrity and Network of the Northern Dipper; the Star Lord of Heavenly Auxiliary, Martial Brilliance and Record of the Northern Dipper; the Star Lord of Heavenly Impulse, Broken Army and Pass of the Northern Dipper; the Star Lord of Luminous Cavern, Left Auxiliary of the Northern Dipper; the Star Lord of Hidden Radiance, Right Assistant of the Northern Dipper; the Nine August Ladies; the Nine Yin Consorts; the Heavenly Stem Marshal of the Myriad Perfected, the Radiant Star Lord of Striding Light; the Three Terraces and Canopy Star Lords within the Dipper; the Star Lord of One’s Life Destiny at Birth; the Star Lord of Longevity and Virtue of the Southern Culmen; the Star Lord of Blessing and Virtue of the Highest Clarity; the Star Lord of Emolument and Virtue of the Highest Clarity; the Star Governor Illuminating the Imperial Seat; the Twenty-Eight Constellation Star Lords; the Sixty Jiazi Star Lords; the Divine Host of the Officials of Dao and Virtue; the Perfected Lord of the Great Dharma Master of the Mysterious Center; the Perfected Lords of the Three Heavens’ Great Dharma Masters; the Nine Provincial Ministers of the Central Heaven; the Left and Right Embroidered-Robed Envoys; the Four Direct Jade Text Merit Officials; the Attendant Gentlemen; the Thousand Chariots and Ten Thousand Riders within the Dipper; and all true numina.\nWe reverently beseech your vast compassion to turn and manifest your luminous scrutiny.\nI have heard that the ten administrations store essence, and the One Origin inaugurates the image.\"*\n\nThe wondrous qi of emptiness and non-being gives birth to the divine treasures in the Crimson Clarity; the perfected transformation-body expounds the true scriptures in Eternal Longevity. For the sake of sentient beings is the teaching established, and to the Great Sage is the numinous communion directed. Only the marvelous turning of yin and yang weighs upon the balance, while fortune and misfortune all proceed from the sovereign arbiter.\n\nWe, your servants, arrayed to the right of the altar in martial order and enrolled by name to the left, aspire to assist and exalt the true wind, and to open the bright dawn of wisdom’s sun. With exultant devotion we offer our vows, pledging their wide fulfillment.\n\nToday, in reverent compliance with the imperial edict, we undertake the solemn rite of the Golden Register. We steadfastly observe the wondrous instructions and have long upheld the luminous statutes. Pouring water and offering flowers, we erect the jade altar to invoke the mandate; extending life and inscribing blessings, we knock upon the jade gates to dispatch our spirits. Surely you will not overlook our humble offerings, but regard the sincerity of our devotion.\n\nAt this noon audience, ascending the altar to perform the Dao, the assembled ritualists now raise the first pinch of incense. May this incense smoke ascend directly to offer reverence to the Most High Perfect Dao-Treasure of the Great Luo, the Primordial Heavenly Worthy; the Heavenly Emperor of the Purple Tenuity’s Upper Palace; the Two Emperors of the Jade Dipper; the Nine August Star Lords; and the Perfected Immortals and Holy Host of the Heaven of Pure Tenuity.\n\nWe take refuge in body, take refuge in spirit, take refuge in life, prostrating ourselves to the earth, reverently relying upon the Three Worthies of the Most High and the Holy Hosts of the Ten Directions. May the merit of this incense ascend to bless His Imperial Majesty. We humbly pray that the Dao harmonizes with the Two Modes, and virtue embraces the Four Images. Ever pure and ever tranquil, may the Eight Wastes proclaim the harmony of the Jade Candle; united in governance and script, may the Six Directions rejoice in the auspicious abundance of golden harvests.\n\nNow, therefore, we burn incense, from taking refuge in our Master, the Great Sage Host, and the virtue of the Perfected, that after attaining the Dao, we may preserve heaven and endure forever, harmonizing with the Dao in truth.\n\nAt this noon audience, ascending the altar to perform the Dao, the assembled ritualists now raise the second pinch of incense. May this incense smoke ascend directly to offer reverence to the Most High Perfect Scripture-Treasure, the Jade Clarity Dao Lord; the Numinous Treasure Heavenly Worthy; the Great Emperor of the Purple Tenuity’s Central Palace of the North Pole; the Star Lord of Our Natal Destiny; the Star Governor Illuminating the Imperial Seat; and the Perfected Immortals and Holy Host of the Heaven of Yu-Yu.\n\nWe take refuge in body, take refuge in spirit, take refuge in life, prostrating ourselves to the earth, reverently relying upon the Three Worthies of the Most High and the Holy Hosts of the Ten Directions. May the merit of this incense ascend to bless His Highness the Crown Prince. We humbly pray that his anointing be of Great Harmony, and his destiny bathed in radiant fortune. May the dragon steps know enduring days, drawing from the vast wellspring of blessings; may the crane precincts bask in vernal warmth, gathering the abundant joy of harvests.\n\nNow, therefore, we burn incense, from taking refuge in our Master, the Great Sage Host, and the virtue of the Perfected, that after attaining the Dao, we may preserve heaven and endure forever, harmonizing with the Dao in truth.\n\nAt this noon audience, ascending the altar to perform the Dao, the assembled ritualists now raise the third pinch of incense. May this incense smoke ascend directly to offer reverence to the Most High Perfect Master-Treasure, the Five Numinous Elders; the Heavenly Worthy of Virtue and the Dao; the Old Man of the Southern Pole, Star Lord of Longevity and Virtue; the Star Lord of Felicity and Virtue of the Highest Clarity; the Star Lord of Emolument and Virtue of the Highest Clarity; and the Perfected Immortals and Holy Host of the Heaven of Great Crimson.\n\nWe take refuge in body, take refuge in spirit, take refuge in life, prostrating ourselves to the earth, reverently relying upon the Three Worthies of the Most High and the Holy Hosts of the Ten Directions. May the merit of this incense flow to the Nine Provinces and Four Seas, to the myriad families and the three orders of husbandmen. We humbly pray that the divine wind enfold them, and the loving sun nurture them. May the aged be at peace and the young content; may the fields and wilds be transformed by non-action, and the plowmen eat and the well-diggers drink, while the villages sing of the enduring Dao.\n\nNow, therefore, we burn incense, from taking refuge in our Master, the Great Sage Host, and the virtue of the Perfected, that after attaining the Dao, we may forever preserve and endure, harmonizing with the Dao in truth.\n\n**The Three Refuges**\n\nWith sincere heart, we take refuge in the scriptures of the Ten Directions. May all beings awaken to understanding, receive, uphold, read, and recite them.\n\nWith sincere heart, we take refuge in the Dao-Treasures of the Ten Directions. May all beings arise with resolve and turn toward all that is to be revered.\n\nWith sincere heart, we take refuge in the Masters of the Ten Directions. May all beings universally ascend the bridge of the Dharma, without hindrance.\n\n**Eulogy of Past Lives**\n\nWe, your servants, respectfully follow the scriptures, which state: On the Three Primes, the Eight Nodal Days, and the days of our natal destiny beneath the Northern Dipper, we solemnly establish the altar, perform the turning of scriptures, and conduct the fast and offering, proceeding according to the ritual—its blessings are boundless.\n\nToday, in reverent compliance with the imperial edict, we undertake the solemn rite of the Golden Register to pray for longevity and felicity. We, your servants, respectfully lead the pure assembly at the altar in reciting once through the *Highest Clarity Numinous Northern Dipper Natal Destiny Life-Prolonging True Scripture*, offering it to the Great Sage of the Central Heaven, the Fourth Roaming Strike Office, the Heavenly Heart Wenqu Jade Dawn Lord.\n\nWe beseech that the baleful influences of the northwest Qian position, the six white corners of Zī, and the Jiang Lou region be erased. We look up in hope of your compassion, and humbly pray for your gracious assent.\n\nWe, your servants, overwhelmed with fervent devotion, perform the scriptural rites.\n\n**Eulogy of the Dharma Seat**\n\n**Inscription of the Scripture**\n\n**After the Recitation of the Scripture**\n\n**Eulogy of the Rising from the Seat**\n\nWe, your servants, have just now reverently led the pure assembly in ascending the altar to perform the Dao rites, offering prayers for the eternal peace of the Sagely Lifespan. We have recited once through the *Highest Clarity Numinous Northern Dipper Natal Destiny Life-Prolonging True Scripture*, and the recitation is now complete. Earnestly we look up in hope that felicity and longevity may be bestowed upon our destinies, that virtuous fruits may gather upon our persons, and that each may turn with sincerity to circumambulate in hymns of praise.\n\nProceeding in void-stepping, we are led to the northwest quarter, where incense is offered. Circumambulating, we return to our positions.\n\n**Seven Primes Covering-Protection Heavenly Worthy**\n\nWe, your servants, respectfully follow the scripture’s teaching, offering libations of water and flowers. With minds concentrated, we gaze toward the Northern Culmen, prostrating in reverence to invoke the name of our Natal Destiny True Lord. Thus shall we not pass vainly through the limits of our natal destiny, but all may attain life-prolonging blessings inscribed upon the body, calamities and misfortunes expunged, and boundless felicity obtained.\n\nAgain, in reverent compliance with the imperial edict, we undertake the exalted practice of the Golden Register, praying for longevity and felicity. We, your servants, respectfully lead the pure assembly at the altar in reciting once through the *Highest Clarity Numinous Northern Dipper Natal Destiny Life-Prolonging True Scripture*, offering it to the Great Sage of the Central Heaven, the Fifth Dipper Lord Office, the Heavenly Quail Cinnabar Chastity Jade Dawn Lord.\n\nWe beseech that the baleful influences of the Shen Palace and the five-yellow region be erased. We look up in hope of your compassion, and humbly pray for your gracious assent.\n\nWe, your servants, overwhelmed with fervent devotion, perform the scriptural rites.\n\n**Eulogy of the Dharma Seat**\n\n**Inscription of the Scripture**\n\n**After the Recitation of the Scripture**\n\n**Eulogy of the Rising from the Seat**\n\nWe, your servants, having hitherto reverently led the pure assembly in ascending the altar to perform the Dao, supplicating for the myriad-fold peace of the Sage’s longevity, have now completed the recitation of the *Highest Clarity Numinous Northern Dipper Natal Destiny Life-Prolonging True Scripture* once through. We humbly pray that felicity and longevity be bestowed upon our destinies, that virtuous fruits accrue to our persons, and that each, with sincere devotion, proceed in rotating procession with hymns of praise.\n\nProceeding in void-stepping, we are led to the Shen Palace, where incense is offered, and in rotating procession return to our positions.\n\n**Great Compassionate Longevity-Extending Heavenly Worthy**\n\nWe, your servants, reverently follow the scripture’s teaching: the true lords’ names may not be heard. Yet all who see or hear and are able to recite them possess profound Dao-heart and karmic affinity from past lives. Their merit and power are beyond measure.\n\nIn accordance with the imperial edict, we now reverently perform the Golden Register rites to pray for longevity and felicity. We, your servants, respectfully lead the pure assembly at the altar in reciting once through the *Highest Clarity Numinous Northern Dipper Natal Destiny Life-Prolonging True Scripture*, offering it to the Great Sage of the Central Heaven, the Sixth Grand Constancy Office, and the Jade Dawn Lord of the Assisting Military Star.\n\nWe beseech that the baleful influences of the southeast Xun region, the four-green Longevity Star, and the Quail’s Head quadrant be erased. We look up in hope of your compassion, and humbly pray for your gracious assent.\n\nWe, your servants, overwhelmed with fervent devotion, perform the scriptural rites.\n\n**Eulogy of the Dharma Seat**\n\n**Inscription of the Scripture**\n\n**After the Recitation of the Scripture**\n\n**Eulogy of the Rising from the Seat**\n\nWe, your servants, have hitherto reverently led the pure assembly in ascending the altar to perform the Daoist rites. We have offered prayers for the eternal peace of the Sacred Lifespan and recited once through the *Highest Clarity Numinous Northern Dipper Natal Destiny Life-Prolonging True Scripture*, now fully completed. Humbly we look up in hope that felicity and longevity may be bestowed upon destinies, and that virtuous fruits may gather upon all beings. Each has conducted themselves with utmost sincerity, circling the altar in hymns of praise.\n\nProceeding in the *Step of Emptiness*, we are guided to the southeast, where incense is offered; then, circling back, we return to our positions.\n\n**Three Hearings of the Scripture**\nAfter hearing the scripture, may heaven endure and earth abide, may the seas be calm and the rivers clear.\nAfter hearing the scripture, may the Sacred Lifespan be eternally peaceful, and the imperial domain firmly secured.\nAfter hearing the scripture, may golden branches flourish and the treasury of destiny stretch boundlessly.\n\n**Vows**\nWith concentrated spirit, we burn incense. O Incense Official Messengers, Left and Right Dragon-Tiger Lords, and all Attending Incense Spirit-Officials, may you cause the place where we have just performed the noon audience, recited the scripture, and practiced the Dao to naturally generate golden liquid, cinnabar, azure mushrooms, and divine herbs. May the hundred numinous perfected beings gather here before the incense burner.\n\nMay our sincere devotion move the divine, may great blessings silently unfold, may the Sacred Lifespan be eternally peaceful, and the imperial domain forever secure. May the jade maidens and immortal youths of the ten directions transmit the sincerity of our supplications through orchid-scented smoke, swiftly conveying them to the presence of the Utmost True, Boundless Dao—before the Three Clarities, the August Saints, the Purple Tenuity Northern Pole Great Emperor, and the Nine August Star Lords of the Northern Dipper.\n\n**Eulogy of Exiting the Hall**\nThe rites of reciting the *Numinous Scripture* and performing the noon audience in the Dao have now concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "金箓玄灵转经早午晚行道仪 经名：金箓玄灵转经早午晚行道仪。 三卷。 底本出处：《正统道藏》洞玄部威仪类。 玄灵转经午朝行道仪 法事如式 各礼师，存念如法 请宣神咒 太上玄一，九皇吐精。 三五七变，洞观幽冥。 日月垂光，下彻神庭。 侠照六合，太一皇宁。 帝君金阙，金书不倾。 五老奉符，天地同成。 使我不惑，以致真灵。 却遏万邪，祸害咸平。 上朝天皇，还老返婴。 大帝有制，百神敬听。 鸣法鼓二十四通 无上三天玄元始三炁太上老君，召出臣身中三五功曹、左右官使者、左右捧香驿龙骑吏、侍香金童、传言散花玉女、五帝直符直日香官，各三十六人出。 出者，严装显服，冠带垂缨。 关启玄坛土地，方域神真。 臣今午景，升坛行道，朝谒帝真。 钦奉其诸丹悃，具载缄誊。 愿得太上至真道炁灵宝瑞光下降，流入臣等身中。 令臣所启之诚，速达径御至真无极大道三清上圣、紫微北极大帝、北斗九皇星君御前。 请称法位 具位臣姓某与临坛官众等，谨同诚上启太上无极大道斗极祖师元始天尊，斗极玄师灵宝天尊，斗极宗师道德天尊，昊天玉皇上帝，紫微天皇大帝、北极紫微大帝、斗中高上玉皇尊星君、太微玉帝、北极玄卿大帝君，北斗天英贪狼大星君、北斗天任巨门元星君、北斗天枢禄存真星君、北斗天心文曲纽星君、北斗天禽廉贞纲星君、北斗天辅武曲纪星君、北斗天冲破军关星君、北斗洞明左辅星君、北斗隐光右弼星君、九皇夫人、九阴内妃、天罡万真节度奎光帝君、斗中三台华盖星君，当生本命星君，南极老人寿德星君、上清福德星君、上清禄德星君，帝座照临星宰、二十八宿星君，六十甲子星君、道德玄曹官君圣众、玄中大法师真君、三天大法师真君，中天九省诸相丈人、左右绣衣使者、四直玉文功曹、通事舍人，斗中千乘万骑，一切真灵。 恭望洪慈，洞回昭鉴。 臣闻十政储精，一元肇象。",
      "translated_text": "*The Rites for Circulating the Mysterious Numinous Scripture at Dawn, Noon, and Dusk*\n**Scripture Title:** *The Rites for Circulating the Mysterious Numinous Scripture at Dawn, Noon, and Dusk*\nThree fascicles.\nSource text: *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, *Weiyi* Category.\n\n---\n\n**The Noon Rites for Circulating the Mysterious Numinous Scripture**\n\nThe ritual proceeds according to form.\nAll pay homage to the master and maintain visualization as prescribed.\nInvite the recitation of the divine incantation:\n\n*\"The Supreme Mysterious One, the Nine Augusts exhale their essence.\nThree, five, seven transformations—penetrating vision of the hidden and dark.\nSun and moon cast their radiance, descending to illumine the divine court.\nTheir brilliance spans the Six Directions; the Supreme One and August Sovereign attain tranquility.\nThe Imperial Lord of the Golden Portal, the golden script stands unshaken.\nThe Five Elders present the talisman; Heaven and Earth are perfected as one.\nMay I be free from delusion, attaining the true numen.\nRepelling the myriad evils, calamities and harms are all pacified.\nAscending to the Heavenly August, returning from old age to infancy.\nThe Great Emperor issues his decree; the hundred spirits reverently heed.\"*\n\nStrike the ritual drum twenty-four times.\n\n*\"The Most High Three Heavens, the Primordial Qi of the Mysterious Origin, the Most High Lord Lao, summon forth from within my body the Three and Five Merit Officials, the Left and Right Attendant Envoys, the Left and Right Dragon-Riding Couriers bearing incense, the Golden Lads Attending Incense, the Jade Maidens Scattering Flowers, the Five Thearchs’ Direct Talisman Officials of the Day, each thirty-six in number, to emerge.\nEmerging, they don their solemn attire, caps and sashes with pendants.\nNotify the Land Spirit of the Mysterious Altar and the deities of the local domain.\nAt this noon hour, I ascend the altar to perform the Dao-circulation, paying homage to the Imperial Perfected.\nReverently offering these cinnabar sincerities, all recorded in sealed script.\nMay the auspicious radiance of the Most High, the Perfect Dao, the numinous treasure, descend and flow into our bodies.\nMay the sincerity of my supplication swiftly reach the presence of the Perfect and Boundless Great Dao of the Three Clarities, the Supreme Saints, the Purple Tenuity Northern Culmen Great Emperor, the Nine August Star Lords of the Northern Dipper.\"*\n\n**Proclaiming the Dharma Titles:**\n\n*\"The undersigned official of such-and-such rank, [Name], together with the assembled altar officers, jointly and sincerely address the Most High and Boundless Great Dao, the Dipper Culmen Ancestral Master, the Celestial Worthy of Primordial Beginning; the Dipper Culmen Mysterious Master, the Celestial Worthy of Numinous Treasure; the Dipper Culmen Ancestral Master, the Celestial Worthy of Dao and Virtue; the Jade Thearch of the Vast Heaven; the Heavenly August Great Emperor of Purple Tenuity; the Great Emperor of the Northern Culmen of Purple Tenuity; the August Star Lord of the Highest Jade Thearch within the Dipper; the Jade Emperor of the Supreme Subtlety; the Great Emperor Lord of the Mysterious Minister of the Northern Culmen; the Great Star Lord of Heavenly Hero, Greedy Wolf of the Northern Dipper; the Primordial Star Lord of Heavenly Task, Great Gate of the Northern Dipper; the True Star Lord of Heavenly Pivot, Salary-Existence of the Northern Dipper; the Star Lord of Heavenly Heart, Literary Curve and Tie of the Northern Dipper; the Star Lord of Heavenly Wings, Upright Integrity and Network of the Northern Dipper; the Star Lord of Heavenly Auxiliary, Martial Brilliance and Record of the Northern Dipper; the Star Lord of Heavenly Impulse, Broken Army and Pass of the Northern Dipper; the Star Lord of Luminous Cavern, Left Auxiliary of the Northern Dipper; the Star Lord of Hidden Radiance, Right Assistant of the Northern Dipper; the Nine August Ladies; the Nine Yin Consorts; the Heavenly Stem Marshal of the Myriad Perfected, the Radiant Star Lord of Striding Light; the Three Terraces and Canopy Star Lords within the Dipper; the Star Lord of One’s Life Destiny at Birth; the Star Lord of Longevity and Virtue of the Southern Culmen; the Star Lord of Blessing and Virtue of the Highest Clarity; the Star Lord of Emolument and Virtue of the Highest Clarity; the Star Governor Illuminating the Imperial Seat; the Twenty-Eight Constellation Star Lords; the Sixty Jiazi Star Lords; the Divine Host of the Officials of Dao and Virtue; the Perfected Lord of the Great Dharma Master of the Mysterious Center; the Perfected Lords of the Three Heavens’ Great Dharma Masters; the Nine Provincial Ministers of the Central Heaven; the Left and Right Embroidered-Robed Envoys; the Four Direct Jade Text Merit Officials; the Attendant Gentlemen; the Thousand Chariots and Ten Thousand Riders within the Dipper; and all true numina.\nWe reverently beseech your vast compassion to turn and manifest your luminous scrutiny.\nI have heard that the ten administrations store essence, and the One Origin inaugurates the image.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 744,
      "start_sentence": 0,
      "end_sentence": 29,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.574393033981323,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经午朝行道仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "虚无妙炁，生神宝於赤明； 圆满化身，说真经於永寿。 为众生而设教，仰大圣以通灵。 惟阴阳妙斡於权衡，而祸福悉由於主宰。 臣等右坛缀武，左藉登名。 期翊赞於真风，庸开明於慧日。 踊跃修奉，誓愿流行。 以今钦奉纶音，崇修金箓。 臣等恪遵妙训，夙奉明科。 酌水献花，建瑶坛而请命； 延生注福，扣玉阙以驰神。 谅封菲之不遗，监葵藿之有造。 以今午朝，升坛行道，请法众等，运兹初捻上香。 愿此香烟腾空，径上供养无上至真道宝大罗元始天尊、紫微上宫天皇大帝、玉斗二帝、九皇星君、清微天宫真仙圣众。 臣等皈身皈神皈命，首体投地，仰依太上三尊、十方众圣。 愿以是香功德，上祝皇帝陛下。 伏愿道契两仪，德涵四象。 常清常静，八荒宣玉烛之和； 同轨同文，六合庆金穰之瑞。 今故烧香，自皈依师尊大圣众，至真之德，得道之后，保天长存，和与道合真。 以今午朝，陛坛行道，请法众等，运兹二捻上香。 愿此香烟腾空，径上供养至真无上经宝玉宸道君、灵宝天尊、紫微中宫北极大帝、当生本命元辰星君、帝座照临星宰、禹余天宫真仙圣众。 臣等皈身皈神皈命，首体投地，仰依太上三尊、十方众圣。 愿以是香功德，上祝皇太子殿下。 伏愿膏沐太和、涵濡景运。 龙墀日永，来浩浩之福源； 鹤禁春融，集穰穰之喜气，今故烧香，自皈依师尊大圣众，至真之德，得道之后，保天长存，和与道合真。 以今午朝，升坛行道，请法众等，运兹三捻上香。 愿此香烟腾空，径上供养至真无上师宝五灵玄老、道德天尊、南极老人寿德星君、上清福德星君、上清禄德星君、大赤天宫真仙圣众。 臣等皈身皈神皈命，首体投地，仰依太上三尊、十方众圣。 愿以是香功德，归流九州四海、万姓三农。 伏愿神风披冒，爱日熏陶。 老安少怀，田野被无为之化，耕食凿饮，里闾歌有道之长。 今故烧香，自皈依师尊大圣众，至真之德，得道之后，永保长存，和与道合真。 三皈依 志心皈依，十方经宝，当愿众生，心开悟解，受持读诵。 志心皈依，十方道宝，当愿众生，起心回向，一切信礼。 志心皈依，十方师宝，当愿众生，普上法桥，无有障碍。 宿命赞 臣等谨按经云，三元八节，本命元辰，北斗下日，严置坛场，转经斋醮，依仪行道，其福无边。 以今钦奉纶音，崇修金箓，祝寿延禧。 臣等谨率在坛清众，转诵《太上玄灵北斗本命延生真经》各一过，上祝中天大圣，第四游击府天心文曲玉晨君。 乞为削落西北乾位、六白陬訾、降娄分野一切之厄。 仰希矜轸，俯赐允俞。 臣等不胜激切之至，修行经法。 敷座赞 题经 诵经毕 解座赞",
      "translated_text": "The wondrous qi of emptiness and non-being gives birth to the divine treasures in the Crimson Clarity; the perfected transformation-body expounds the true scriptures in Eternal Longevity. For the sake of sentient beings is the teaching established, and to the Great Sage is the numinous communion directed. Only the marvelous turning of yin and yang weighs upon the balance, while fortune and misfortune all proceed from the sovereign arbiter.\n\nWe, your servants, arrayed to the right of the altar in martial order and enrolled by name to the left, aspire to assist and exalt the true wind, and to open the bright dawn of wisdom’s sun. With exultant devotion we offer our vows, pledging their wide fulfillment.\n\nToday, in reverent compliance with the imperial edict, we undertake the solemn rite of the Golden Register. We steadfastly observe the wondrous instructions and have long upheld the luminous statutes. Pouring water and offering flowers, we erect the jade altar to invoke the mandate; extending life and inscribing blessings, we knock upon the jade gates to dispatch our spirits. Surely you will not overlook our humble offerings, but regard the sincerity of our devotion.\n\nAt this noon audience, ascending the altar to perform the Dao, the assembled ritualists now raise the first pinch of incense. May this incense smoke ascend directly to offer reverence to the Most High Perfect Dao-Treasure of the Great Luo, the Primordial Heavenly Worthy; the Heavenly Emperor of the Purple Tenuity’s Upper Palace; the Two Emperors of the Jade Dipper; the Nine August Star Lords; and the Perfected Immortals and Holy Host of the Heaven of Pure Tenuity.\n\nWe take refuge in body, take refuge in spirit, take refuge in life, prostrating ourselves to the earth, reverently relying upon the Three Worthies of the Most High and the Holy Hosts of the Ten Directions. May the merit of this incense ascend to bless His Imperial Majesty. We humbly pray that the Dao harmonizes with the Two Modes, and virtue embraces the Four Images. Ever pure and ever tranquil, may the Eight Wastes proclaim the harmony of the Jade Candle; united in governance and script, may the Six Directions rejoice in the auspicious abundance of golden harvests.\n\nNow, therefore, we burn incense, from taking refuge in our Master, the Great Sage Host, and the virtue of the Perfected, that after attaining the Dao, we may preserve heaven and endure forever, harmonizing with the Dao in truth.\n\nAt this noon audience, ascending the altar to perform the Dao, the assembled ritualists now raise the second pinch of incense. May this incense smoke ascend directly to offer reverence to the Most High Perfect Scripture-Treasure, the Jade Clarity Dao Lord; the Numinous Treasure Heavenly Worthy; the Great Emperor of the Purple Tenuity’s Central Palace of the North Pole; the Star Lord of Our Natal Destiny; the Star Governor Illuminating the Imperial Seat; and the Perfected Immortals and Holy Host of the Heaven of Yu-Yu.\n\nWe take refuge in body, take refuge in spirit, take refuge in life, prostrating ourselves to the earth, reverently relying upon the Three Worthies of the Most High and the Holy Hosts of the Ten Directions. May the merit of this incense ascend to bless His Highness the Crown Prince. We humbly pray that his anointing be of Great Harmony, and his destiny bathed in radiant fortune. May the dragon steps know enduring days, drawing from the vast wellspring of blessings; may the crane precincts bask in vernal warmth, gathering the abundant joy of harvests.\n\nNow, therefore, we burn incense, from taking refuge in our Master, the Great Sage Host, and the virtue of the Perfected, that after attaining the Dao, we may preserve heaven and endure forever, harmonizing with the Dao in truth.\n\nAt this noon audience, ascending the altar to perform the Dao, the assembled ritualists now raise the third pinch of incense. May this incense smoke ascend directly to offer reverence to the Most High Perfect Master-Treasure, the Five Numinous Elders; the Heavenly Worthy of Virtue and the Dao; the Old Man of the Southern Pole, Star Lord of Longevity and Virtue; the Star Lord of Felicity and Virtue of the Highest Clarity; the Star Lord of Emolument and Virtue of the Highest Clarity; and the Perfected Immortals and Holy Host of the Heaven of Great Crimson.\n\nWe take refuge in body, take refuge in spirit, take refuge in life, prostrating ourselves to the earth, reverently relying upon the Three Worthies of the Most High and the Holy Hosts of the Ten Directions. May the merit of this incense flow to the Nine Provinces and Four Seas, to the myriad families and the three orders of husbandmen. We humbly pray that the divine wind enfold them, and the loving sun nurture them. May the aged be at peace and the young content; may the fields and wilds be transformed by non-action, and the plowmen eat and the well-diggers drink, while the villages sing of the enduring Dao.\n\nNow, therefore, we burn incense, from taking refuge in our Master, the Great Sage Host, and the virtue of the Perfected, that after attaining the Dao, we may forever preserve and endure, harmonizing with the Dao in truth.\n\n**The Three Refuges**\n\nWith sincere heart, we take refuge in the scriptures of the Ten Directions. May all beings awaken to understanding, receive, uphold, read, and recite them.\n\nWith sincere heart, we take refuge in the Dao-Treasures of the Ten Directions. May all beings arise with resolve and turn toward all that is to be revered.\n\nWith sincere heart, we take refuge in the Masters of the Ten Directions. May all beings universally ascend the bridge of the Dharma, without hindrance.\n\n**Eulogy of Past Lives**\n\nWe, your servants, respectfully follow the scriptures, which state: On the Three Primes, the Eight Nodal Days, and the days of our natal destiny beneath the Northern Dipper, we solemnly establish the altar, perform the turning of scriptures, and conduct the fast and offering, proceeding according to the ritual—its blessings are boundless.\n\nToday, in reverent compliance with the imperial edict, we undertake the solemn rite of the Golden Register to pray for longevity and felicity. We, your servants, respectfully lead the pure assembly at the altar in reciting once through the *Highest Clarity Numinous Northern Dipper Natal Destiny Life-Prolonging True Scripture*, offering it to the Great Sage of the Central Heaven, the Fourth Roaming Strike Office, the Heavenly Heart Wenqu Jade Dawn Lord.\n\nWe beseech that the baleful influences of the northwest Qian position, the six white corners of Zī, and the Jiang Lou region be erased. We look up in hope of your compassion, and humbly pray for your gracious assent.\n\nWe, your servants, overwhelmed with fervent devotion, perform the scriptural rites.\n\n**Eulogy of the Dharma Seat**\n\n**Inscription of the Scripture**\n\n**After the Recitation of the Scripture**\n\n**Eulogy of the Rising from the Seat**",
      "overlap_context": "Perfected Lords of the Three Heavens’ Great Dharma Masters; the Nine Provincial Ministers of the Central Heaven; the Left and Right Embroidered-Robed Envoys; the Four Direct Jade Text Merit Officials; the Attendant Gentlemen; the Thousand Chariots and Ten Thousand Riders within the Dipper; and all true numina.\nWe reverently beseech your vast compassion to turn and manifest your luminous scrutiny.\nI have heard that the ten administrations store essence, and the One Origin inaugurates the image.\"*",
      "start_char": 744,
      "end_char": 1763,
      "start_sentence": 30,
      "end_sentence": 78,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.40215015411377,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经午朝行道仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "臣向来，祇率清众，升坛行道，上祝圣寿万安，转诵《太上玄灵北斗本命延生真经》各一过，并已周圆。 恭望福寿资命，善果臻身，人各运诚，旋行赞咏。 步虚，引至西北方，上香，旋行复位 七元覆护天尊 臣等谨按经云，可以酌水献花，冥心望北极，稽首礼拜，念本命真君名号。 亦不虚过本命限期，皆得延生注福，击系人身，灾厄蠲除，获福无量。 以今钦奉纶音，崇修金箓，祝寿延禧。 臣等谨率在坛清众，转诵《太上玄灵北斗本命延生真经》各一过，上祝中天大圣，第五斗君府天禽廉贞玉晨君。 乞为削落申宫五黄分野一切之厄。 仰希矜轸，俯赐允俞。 臣等不胜激切之至，修行经法。 敷座赞 题经 诵经毕 解座赞",
      "translated_text": "We, your servants, have just now reverently led the pure assembly in ascending the altar to perform the Dao rites, offering prayers for the eternal peace of the Sagely Lifespan. We have recited once through the *Highest Clarity Numinous Northern Dipper Natal Destiny Life-Prolonging True Scripture*, and the recitation is now complete. Earnestly we look up in hope that felicity and longevity may be bestowed upon our destinies, that virtuous fruits may gather upon our persons, and that each may turn with sincerity to circumambulate in hymns of praise.\n\nProceeding in void-stepping, we are led to the northwest quarter, where incense is offered. Circumambulating, we return to our positions.\n\n**Seven Primes Covering-Protection Heavenly Worthy**\n\nWe, your servants, respectfully follow the scripture’s teaching, offering libations of water and flowers. With minds concentrated, we gaze toward the Northern Culmen, prostrating in reverence to invoke the name of our Natal Destiny True Lord. Thus shall we not pass vainly through the limits of our natal destiny, but all may attain life-prolonging blessings inscribed upon the body, calamities and misfortunes expunged, and boundless felicity obtained.\n\nAgain, in reverent compliance with the imperial edict, we undertake the exalted practice of the Golden Register, praying for longevity and felicity. We, your servants, respectfully lead the pure assembly at the altar in reciting once through the *Highest Clarity Numinous Northern Dipper Natal Destiny Life-Prolonging True Scripture*, offering it to the Great Sage of the Central Heaven, the Fifth Dipper Lord Office, the Heavenly Quail Cinnabar Chastity Jade Dawn Lord.\n\nWe beseech that the baleful influences of the Shen Palace and the five-yellow region be erased. We look up in hope of your compassion, and humbly pray for your gracious assent.\n\nWe, your servants, overwhelmed with fervent devotion, perform the scriptural rites.\n\n**Eulogy of the Dharma Seat**\n\n**Inscription of the Scripture**\n\n**After the Recitation of the Scripture**\n\n**Eulogy of the Rising from the Seat**",
      "overlap_context": " Office, the Heavenly Heart Wenqu Jade Dawn Lord.\n\nWe beseech that the baleful influences of the northwest Qian position, the six white corners of Zī, and the Jiang Lou region be erased. We look up in hope of your compassion, and humbly pray for your gracious assent.\n\nWe, your servants, overwhelmed with fervent devotion, perform the scriptural rites.\n\n**Eulogy of the Dharma Seat**\n\n**Inscription of the Scripture**\n\n**After the Recitation of the Scripture**\n\n**Eulogy of the Rising from the Seat**",
      "start_char": 1763,
      "end_char": 2057,
      "start_sentence": 79,
      "end_sentence": 93,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.357900381088257,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经午朝行道仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "臣等向来，祇率清众，升坛行道，上祝圣寿万安，转诵《太上玄灵北斗本命延生真经》各一过，并已周圆。 恭望福寿资命，善果臻身，人各运诚，旋行赞咏。 步虚，引至申宫，上香，旋行复位 大慈延寿天尊 臣等谨按经云，於是真君名号，不可得闻。 凡有见闻，能持诵者，皆道心深重，宿有善缘。 其功德力，莫可称量。 以今钦奉纶音，崇修金箓，祝寿延禧。 臣等谨率在坛清众，转诵《太上玄灵北斗本命延生真经》各一过，上祝中天大圣、第六太常府天、辅武曲玉晨君。 乞为削落东南巽位、四碧寿星、鹑首分野、一切之厄。 仰希矜轸，俯赐允俞。 臣等不胜激切之至，修行经法。 敷座赘 题经 诵经毕 解座赘",
      "translated_text": "We, your servants, having hitherto reverently led the pure assembly in ascending the altar to perform the Dao, supplicating for the myriad-fold peace of the Sage’s longevity, have now completed the recitation of the *Highest Clarity Numinous Northern Dipper Natal Destiny Life-Prolonging True Scripture* once through. We humbly pray that felicity and longevity be bestowed upon our destinies, that virtuous fruits accrue to our persons, and that each, with sincere devotion, proceed in rotating procession with hymns of praise.\n\nProceeding in void-stepping, we are led to the Shen Palace, where incense is offered, and in rotating procession return to our positions.\n\n**Great Compassionate Longevity-Extending Heavenly Worthy**\n\nWe, your servants, reverently follow the scripture’s teaching: the true lords’ names may not be heard. Yet all who see or hear and are able to recite them possess profound Dao-heart and karmic affinity from past lives. Their merit and power are beyond measure.\n\nIn accordance with the imperial edict, we now reverently perform the Golden Register rites to pray for longevity and felicity. We, your servants, respectfully lead the pure assembly at the altar in reciting once through the *Highest Clarity Numinous Northern Dipper Natal Destiny Life-Prolonging True Scripture*, offering it to the Great Sage of the Central Heaven, the Sixth Grand Constancy Office, and the Jade Dawn Lord of the Assisting Military Star.\n\nWe beseech that the baleful influences of the southeast Xun region, the four-green Longevity Star, and the Quail’s Head quadrant be erased. We look up in hope of your compassion, and humbly pray for your gracious assent.\n\nWe, your servants, overwhelmed with fervent devotion, perform the scriptural rites.\n\n**Eulogy of the Dharma Seat**\n\n**Inscription of the Scripture**\n\n**After the Recitation of the Scripture**\n\n**Eulogy of the Rising from the Seat**",
      "overlap_context": "eaven, the Fifth Dipper Lord Office, the Heavenly Quail Cinnabar Chastity Jade Dawn Lord.\n\nWe beseech that the baleful influences of the Shen Palace and the five-yellow region be erased. We look up in hope of your compassion, and humbly pray for your gracious assent.\n\nWe, your servants, overwhelmed with fervent devotion, perform the scriptural rites.\n\n**Eulogy of the Dharma Seat**\n\n**Inscription of the Scripture**\n\n**After the Recitation of the Scripture**\n\n**Eulogy of the Rising from the Seat**",
      "start_char": 2057,
      "end_char": 2347,
      "start_sentence": 94,
      "end_sentence": 109,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.563013315200806,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经午朝行道仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "臣等向来，祇率清众，升坛行道。 上祝圣寿万安，转诵《太上玄灵北斗本命延生真经》各一过，并已周圆。 恭望福寿资命，善果臻身。 人各运诚，旋行赞咏。 步虚，引至东南方，上香，旋行复位 三闻经 闻经已后，当愿天长地久，海晏河清。 闻经已后，当愿圣寿万安，皇图巩固。 闻经已后，当愿金技蕃衍，宝历绵洪。 发愿 存神烧香 香官使者、左右龙虎君、侍香诸灵官，当令臣向来午朝转经行道之所，自然生金液丹碧芝英。 百灵众真，交会在此，香火炉前。 当愿丹诚感格，鸿贶潜敷，圣寿万安，皇图永固。 十方仙童，玉女接侍，兰烟传臣向来所奏之诚，速达径御至真无极大道三清上圣紫微北极大帝北斗九皇星君御前。 出堂颂 玄灵转经午朝行道仪竟",
      "translated_text": "We, your servants, have hitherto reverently led the pure assembly in ascending the altar to perform the Daoist rites. We have offered prayers for the eternal peace of the Sacred Lifespan and recited once through the *Highest Clarity Numinous Northern Dipper Natal Destiny Life-Prolonging True Scripture*, now fully completed. Humbly we look up in hope that felicity and longevity may be bestowed upon destinies, and that virtuous fruits may gather upon all beings. Each has conducted themselves with utmost sincerity, circling the altar in hymns of praise.\n\nProceeding in the *Step of Emptiness*, we are guided to the southeast, where incense is offered; then, circling back, we return to our positions.\n\n**Three Hearings of the Scripture**\nAfter hearing the scripture, may heaven endure and earth abide, may the seas be calm and the rivers clear.\nAfter hearing the scripture, may the Sacred Lifespan be eternally peaceful, and the imperial domain firmly secured.\nAfter hearing the scripture, may golden branches flourish and the treasury of destiny stretch boundlessly.\n\n**Vows**\nWith concentrated spirit, we burn incense. O Incense Official Messengers, Left and Right Dragon-Tiger Lords, and all Attending Incense Spirit-Officials, may you cause the place where we have just performed the noon audience, recited the scripture, and practiced the Dao to naturally generate golden liquid, cinnabar, azure mushrooms, and divine herbs. May the hundred numinous perfected beings gather here before the incense burner.\n\nMay our sincere devotion move the divine, may great blessings silently unfold, may the Sacred Lifespan be eternally peaceful, and the imperial domain forever secure. May the jade maidens and immortal youths of the ten directions transmit the sincerity of our supplications through orchid-scented smoke, swiftly conveying them to the presence of the Utmost True, Boundless Dao—before the Three Clarities, the August Saints, the Purple Tenuity Northern Pole Great Emperor, and the Nine August Star Lords of the Northern Dipper.\n\n**Eulogy of Exiting the Hall**\nThe rites of reciting the *Numinous Scripture* and performing the noon audience in the Dao have now concluded.",
      "overlap_context": "ade Dawn Lord of the Assisting Military Star.\n\nWe beseech that the baleful influences of the southeast Xun region, the four-green Longevity Star, and the Quail’s Head quadrant be erased. We look up in hope of your compassion, and humbly pray for your gracious assent.\n\nWe, your servants, overwhelmed with fervent devotion, perform the scriptural rites.\n\n**Eulogy of the Dharma Seat**\n\n**Inscription of the Scripture**\n\n**After the Recitation of the Scripture**\n\n**Eulogy of the Rising from the Seat**",
      "start_char": 2347,
      "end_char": 2666,
      "start_sentence": 110,
      "end_sentence": 126,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.321508407592773,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经午朝行道仪.txt",
        "category": "威仪类"
      }
    }
  ]
}