{
  "source_id": "玄灵转经早朝行道仪",
  "source_file": "chunked_daozang\\玄灵转经早朝行道仪.json",
  "total_chunks": 7,
  "total_original_chars": 2974,
  "total_translated_chars": 20600,
  "total_translation_time": 108.94085955619812,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经早朝行道仪.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Ritual of Circulating the Mysterious Numinous Scripture at Dawn, Noon, and Dusk from the Golden Register*\n**Scripture Title:** *Ritual of Circulating the Mysterious Numinous Scripture at Dawn, Noon, and Dusk from the Golden Register*\nThree scrolls.\nSource text: *Zhengtong Daoist Canon*, Dongxuan Section, Category of Dignified Observances.\n\n---\n\n### *Ritual of Circulating the Mysterious Numinous Scripture at Dawn*\nThe ritual proceeds according to form.\nAll pay homage to the master, contemplating as prescribed.\n\n**Invocation of the Divine Incantation:**\nThe supreme scenes of the Nine Heavens transform and give birth to radiant splendor.\nShimmering across the vast firmament, they illuminate the Purple Tenuity of true numina.\nAscending to the Central August, the hundred spirits descend in return.\nDispersing the roots of suffering, the eight adversities are dispelled.\nThe seven ancestors ascend together, their blessed fortune towering and majestic.\nMay we, the divine immortals, soar in the Eightfold Luminous Fast.\n\n**Strike the ritual drum twenty-four times.**\n\nO Most High Three Heavens, Mysterious Primordial Three *Qi* of the Supreme Venerable Lord Lao,\nSummon forth from within this servant’s body:\nThe Three and Five Merit Officers,\nThe Attendants of the Left and Right,\nThe Dragon-Riders bearing incense of the Left and Right Courier Posts,\nThe Golden Lads attending incense,\nThe Jade Maidens transmitting words and scattering flowers,\nThe Incense Officials of the Five Thearchs on duty for the day—\nEach in a company of thirty-six.\nLet them emerge, clad in solemn attire and resplendent robes,\nTheir caps and sashes adorned with pendent tassels.\n\n**Address the Land Spirit of the Mysterious Altar and the Divine Perfected of the Realm.**\n\nThis servant now at early audience ascends the altar to perform the Dao and pay homage to the divine perfected.\n\nWith reverence, I present these vermilion sincerities, fully transcribed and sealed for submission.\n\nMay it be that the radiant luminous treasure-light of the Most High Perfect Dao-*qi* descend and flow into our bodies, that the sincerity of this servant’s invocation swiftly reach and be received before the Most True and Boundless Dao, the Three Clarities, the August Celestial Worthies, the Star Lord of the Central Heaven, the Purple Tenuity Great Emperor, and the Nine August Star Lords of the Northern Dipper.\n\n**Proclaiming the dharma-positions:**\n\nThis humble servant, [Name], together with the assembly of altar-officiants, with united sincerity respectfully addresses:\n\nThe Most High Boundless Dao, Dipper-Pole Ancestral Master, Celestial Worthy of Primordial Beginning;\nThe Dipper-Pole Mystic Preceptor, Celestial Worthy of Numinous Treasure;\nThe Dipper-Pole Patriarchal Master, Celestial Worthy of Dao and Virtue;\nThe Jade Thearch of the August Heaven;\nThe Great Emperor of the Northern Culmen, Purple Tenuity;\nThe Heavenly Thearch of Purple Tenuity;\nThe August Star Lord of the Lofty Central Dipper, Jade Emperor of the Great Tenuity;\nThe Great Emperor Lord of the Northern Culmen, Mystic Minister;\nThe Great Star Lord of Heavenly Hero, Greedy Wolf of the Northern Dipper;\nThe Primordial Star Lord of Heavenly Task, Great Gate of the Northern Dipper;\nThe True Star Lord of Heavenly Pivot, Emolument-Existence of the Northern Dipper;\nThe Star Lord of Heavenly Heart, Literary Brilliance and Tie of the Northern Dipper;\nThe Star Lord of Heavenly Chariot, Integrity and Principle of the Northern Dipper;\nThe Star Lord of Heavenly Auxiliary, Martial Brilliance and Record of the Northern Dipper;\nThe Star Lord of Heavenly Impulse, Broken Army and Pass of the Northern Dipper;\nThe Star Lord of Luminous Cavern, Left Auxiliary of the Northern Dipper;\nThe Star Lord of Hidden Light, Right Assistant of the Northern Dipper;\nThe Nine August Ladies;\nThe Nine Yin Inner Consorts;\nThe Heavenly Stem Great Sage, Myriad Perfected Nodal Commander, Radiant Strider Emperor Lord;\nThe Three Terraces of the Dipper’s Center, Canopy Star Lords;\nThe Star Lord of this servant’s natal destiny;\nThe Old Man of the Southern Culmen, Star Lord of Longevity and Virtue;\nThe Star Lord of Blessing and Virtue of the Highest Clarity;\nThe Star Lord of Emolument and Virtue of the Highest Clarity;\nThe Star Governor of the Throne’s Illumination;\nThe Twenty-Eight Constellation Star Lords;\nThe Sixty Stem-Branch Star Lords;\nThe Sagely Assembly of the Dao-Virtue Mystic Ministers;\nThe Perfected Lord, Great Dharma Master of the Mystic Center;\nThe Perfected Lord, Great Dharma Master of the Three Heavens;\nThe Venerable Elders of the Nine Provinces of the Central Heaven;\nThe Left and Right Embroidered-Robed Envoys;\nThe Envoys bearing the Goat and Dharaṇī;\nThe Jade Text Merit Officers of the Four Watches;\nThe Attendants of Communications;\nThe Thousand Chariots and Myriad Riders of the Dipper;\nAll divine numina.\n\nWe humbly beseech your vast compassion to deign to turn and peer with penetrating vision.\n\nThis servant has heard: when the Three Luminaries open their brightness, the Nine Stars bequeath their splendor.\n\nThe Earth Deities uphold the jade-disk throne, as the Dao’s unfolding destiny shines forth;\nThe Heavenly Masters attend the golden-gated august presence, as scriptures and texts radiate brilliance.\nThey serve as boats and bridges to ferry men and women, and govern tongues to command the divine numina.\nOf all who dwell within the geomantic realm, none stand beyond the crucible of transformation.\n\nWe, your servants, have stored blessings through past karmic affinity, and our names are inscribed in the registers of the Perfected.\nWe have studied the *Hetu* and the *Huoluo* texts,\nand bear the talismans of the Three-and-Five Jade Celestial Mechanism.\nWe strive in merit and conduct, humbly aiding the work of generation and completion.\n\nToday, in reverent compliance with the sagely decree, we undertake the veneration of the Golden Register.\nWe, your servants, have diligently followed the scriptural instructions and established the numinous altar from of old.\nModeling earth upon heaven, we gaze toward the Purple Palace and bow our heads;\nProlonging life and augmenting destiny, we inscribe our hearts upon the cinnabar tablets.\nMay the grace of rain and dew be bestowed, that the sequence of yin and yang may be harmonized.\n\nThis morning, ascending the altar to perform the Dao, we, the assembled ritualists, now offer the first pinch of incense.\nMay this incense smoke ascend directly to the heavens, offering reverence to the Most Perfect and Supreme Dao-Treasure:\nThe Great Primal Heavenly Worthy of the Great Luo of the Unsurpassed Dao,\nThe Heavenly Emperor of the Purple Tenuity’s Upper Palace,\nThe Two Emperors of the Jade Dipper,\nThe Nine August Star Lords,\nand the Perfected and Sages of the Heavenly Palace of Pure Tenuity.\n\nWe, your servants, take refuge in body, spirit, and life, prostrating ourselves with heads to the earth,\nand reverently depend upon the Three August Ones of the Most High and the sacred hosts of the Ten Directions.\nMay the merit of this incense be dedicated to the August Emperor, our Sovereign.\nWe humbly pray that heaven and earth display their splendor, and the Yellow and Luo Rivers radiate their auspicious signs.\nRed geese and white unicorns, through a thousand ages, record the jade charts’ omens;\nGolden branches and jade leaves, for ten thousand years, unfold the treasure calendar’s felicity.\nMay the sagely longevity equal that of heaven, and the imperial sun shine resplendently.\n\nThus we now burn incense, from our refuge in the Great Sacred Host of Master Teachers,\nto the virtue of the Most Perfect Ones.\nAfter attaining the Dao, may they preserve heaven’s enduring existence,\nand harmonize with the Dao in perfect unity.\n\nThis morning, ascending the altar to perform the Dao, we, the assembled ritualists, now offer the second pinch of incense.\nMay this incense smoke ascend directly to the heavens, offering reverence to the Most Perfect and Supreme Scripture-Treasure:\nThe Jade Tenuity Dao Lord of the Heavenly Palace,\nThe Numinous Treasure Heavenly Worthy,\nThe Great Emperor of the North Culmen of the Purple Tenuity’s Central Palace,\nThe Star Lord of Our Fundamental Destiny and Life-Span,\nThe Star Governor Illuminating the Throne,\nand the Perfected and Sages of the Heavenly Palace of Yu-Yu.\n\nWe, your servants, take refuge in body, spirit, and life, prostrating ourselves with heads to the earth,\nand reverently depend upon the Three August Ones of the Most High and the sacred hosts of the Ten Directions.\nMay the merit of this incense be respectfully dedicated to His Highness the Imperial Heir.\nWe humbly pray that the true wind may spread, and the sun of wisdom shine brightly.\nMay the Azure Han pour forth auspiciousness, and the realm of longevity open in the constellations of Winnowing Basket and Wings;\nMay the Purple Pivot extend its blessings, and clouds of fortune gather around the orchid and iris.\nThus we now burn incense, from our refuge in the Great Sacred Host of Master Teachers,\nto the virtue of the Most Perfect Ones.\nAfter attaining the Dao, may they preserve heaven’s enduring existence,\nand harmonize with the Dao in perfect unity.\n\nThis morning, ascending the altar to perform the Dao, we, the assembled ritualists, now offer the third pinch of incense.\nMay this incense smoke ascend directly to the heavens, offering reverence to the Most Perfect and Supreme Master-Treasure:\nThe Five Numinous Primal Elders,\nThe Heavenly Worthy of Virtue and Power,\nThe Old Man of the Southern Culmen, Star Lord of Longevity and Virtue,\nThe Star Lord of Blessing and Virtue of the Supreme Purity,\nThe Star Lord of Emolument and Virtue of the Supreme Purity,\nand the Perfected and Sages of the Heavenly Palace of Great Redness.\n\nWe, your servants, take refuge in body, spirit, and life, prostrating ourselves with heads to the earth,\nand reverently depend upon the Three August Ones of the Most High and the sacred hosts of the Ten Directions.\nMay the merit of this incense be dedicated to the return and flow of grace upon our Three Masters, Four Companions,\nand fellow disciples of the same school.\nWe pray that our nature-sky may be serene and limpid, and our mind-ground empty and luminous.\nMay the golden blossoms of the fixed registers dispel the eighty-four thousand dusts of toil;\nMay the jade slips of inscribed names fulfill the one thousand two hundred precepts in perfect roundness.\nThus we now burn incense, from our refuge in the Great Sacred Host of Master Teachers,\nto the virtue of the Most Perfect Ones.\nAfter attaining the Dao, may they eternally preserve enduring existence,\nand harmonize with the Dao in perfect unity.\n\nThe Seven Primes shelter and protect, Heavenly Worthies.\n\n**Invocation of the Sutra**\n\nWe, your humble servants, have heard that the life-mandate sutra and its esoteric instructions form the supreme Dharma-bridge. It is the true essence of the Three Caverns, the right path for all living beings. Thus, those who open and recite it are reborn among humankind, endowed with exceptional intelligence and clarity; those who uphold and chant it make it their eternal treasure, gaining blessings and longevity worthy of praise.\n\nWe, unworthy and base, rejoice in encountering this transformative cultivation. Bearing the descending *qi* of the Seven Stars, moved by the concentrated essence bestowed by the Two Poles, we hold fast to the mandate of life to preserve our Heaven-appointed years—all of which depends on the sovereign powers. Yet in preparing this offering feast and tending the incense fire, we dare not indulge in careless folly. Reverently heeding the sacred edict, we honor and perform the Golden Register rites.\n\nThrice daily we practice the Dao, proclaiming its mysteries in accordance with the secret scriptures; nine times we recite the sutra, chanting and intoning its cavernous verses. The Mysterious Altar unfolds its affairs, the Purple Pole dispenses its grace. May we rely in secret upon the One Vehicle to augment and extend our myriad years.\n\nWe humbly pray that the numinous spirits shine resplendent, the Dipper and Pole Star radiate their brilliance. Overseeing this single offering of incense, may you bestow the ninefold radiance of your candlelight. May one man’s felicity bring eternal clarity to the Four Seas; may the protection of the ten thousand sages inspire reverence among the thousand perfected. May we reach the realm of flourishing life, entering and departing the land of blessings.\n\nWith bowed heads, we take refuge, each with utmost reverence.\n\n**The Three Refuges**\nWith wholehearted devotion, we take refuge in the sutras of the Ten Directions—may all beings awaken to understanding, receive, uphold, read, and recite them.\nWith wholehearted devotion, we take refuge in the Dao of the Ten Directions—may all beings turn their minds toward it, offering sincere reverence.\nWith wholehearted devotion, we take refuge in the masters of the Ten Directions—may all beings ascend the Dharma-bridge without obstruction.\n\n**Hymn of Past Lives**\nPast lives are indeed real,\nYet the feeble dismiss them as nonexistent.\nAll crave what lies before their eyes,\nDismissing what passes beyond their gaze as false.\nThe great sages illuminate the Dao’s teachings,\nGrieving for the stubborn and ignorant.\nTenderly they recall the suffering of their disciples,\nDiligently they labor for our concerns.\n\nWe, your humble servants, respectfully follow the sutra’s words: the Northern Aster stands above, encircled by the host of stars, serving as the pivot of creation and the lord of human spirits. It possesses the power to dispel calamities and transcend adversity, the merit to prolong life and augment destiny. From emperors above to commoners below, though ranks differ, the mandate of life knows no distinction.\n\nToday, reverently heeding the sacred edict, we honor and perform the Golden Register rites for longevity and felicity. We, your humble servants, lead the pure assembly of this altar in reciting *The Wondrous Numinous Northern Dipper Life-Mandate Longevity Sutra of the Most High* once each, offering prayers to the Great Sage of the Central Heaven, the First Grand Marshal of the Celestial Bureau—Lord Tianying Tanlang Yuchen of the Jade Dawn. We beseech you to erase the Nine Purples of the Southern Fire, the misfortunes of the Quail’s Fire domain, and all adversities.\n\nWe look up in hope of your compassion, praying for your gracious assent. Overwhelmed by the utmost urgency, we perform these sutra rites.\n\n**Seating Hymn**\n*Title of the Sutra*\n*After the Recitation*\n**Dismounting Hymn**\n\nWe, your humble servants, have just now led the pure assembly in ascending the altar to perform the Dao. We have offered prayers for the eternal peace of the Sacred One’s longevity and completed the recitation of *The Wondrous Numinous Northern Dipper Life-Mandate Longevity Sutra of the Most High* once each, now fully accomplished. Reverently we hope that felicity and longevity will sustain life, and that virtuous fruits will gather upon the self. Each person moves with sincerity, circling in hymns of praise.\n\n*Step into the Void*, proceed to the southern quarter, offer incense, and circle back to position.\n**Numinous Response of the Mysterious Spirit, Heavenly Worthy**\n\nWe, your humble servants, respectfully follow the sutra’s teaching: on the day of one’s life-mandate, to perform the fast and establish the jiao, to invoke the Northern Dipper, the Three Officials, the Five Emperors, the Nine Bureaus, and the Four Offices, to present blessings and dispel calamities, to submit memorials and entreat wishes—such merit and power are profound and cannot be fully expressed.\n\nToday, reverently heeding the sacred edict, we honor and perform the Golden Register rites for longevity and felicity. We, your humble servants, lead the pure assembly of this altar in reciting *The Wondrous Numinous Northern Dipper Life-Mandate Longevity Sutra of the Most High* once each, offering prayers to the Great Sage of the Central Heaven, the Second Grand Ministerial Bureau—Lord Tianren Jumen Yuchen of the Jade Dawn. We beseech you to erase the Eight Whites of the Northeastern Gen position, the misfortunes of the Starry Chronicle’s Wood domain, and all adversities.\n\nWe look up in hope of your compassion, praying for your gracious assent. Overwhelmed by the utmost urgency, we perform these sutra rites.\n\n**Seating Hymn**\n*Title of the Sutra*\n*After the Recitation*\n**Dismounting Hymn**\n\nWe, your humble servants, have hitherto led the pure assembly in ascending the altar to perform the Dao rites. In reverent offering, we have recited *The Wondrous Numinous Northern Dipper Life-Mandate Longevity Sutra of the Most High* once each, now fully completed, to supplicate for the eternal peace of the sacred longevity. We humbly pray that the blessings of fortune and longevity be bestowed upon the life-mandate, and that the fruits of goodness gather upon each person. With utmost sincerity, we circumambulate in hymns of praise.\n\nProceeding in the *Step of Emptiness*, we are guided to the northeastern quarter, where incense is offered. We circumambulate and return to our positions.\n\n**Great Compassionate Longevity Heavenly Worthy**\n\nWe, your humble servants, reverently follow the sutra’s teaching: when peril or adversity arises, how may one seek deliverance? One must urgently petition the Northern Dipper, offer rites of gratitude to the Perfected Lords, and recite the true sutra, acknowledging the Perfected Lord of one’s life-mandate, only then may one attain peace and prosperity, leading to health and honor.\n\nToday, reverently heeding the sacred edict, we honor and perform the Golden Register rites for longevity and felicity. We, your humble servants, lead the pure assembly of this altar in reciting *The Wondrous Numinous Northern Dipper Life-Mandate Longevity Sutra of the Most High* once each, offering prayers to the Great Sage of the Central Heaven, the Third Ministerial Bureau of Works—Lord Tianzhu Luchen Yuchen of the Jade Dawn. We beseech you to erase the adversities of the Western Dui position, the Great Liang domain, and all misfortunes.\n\nWe look up in hope of your compassion, praying for your gracious assent. Overwhelmed by the utmost urgency, we perform these sutra rites.\n\n**Seating Hymn**\n*Title of the Sutra*\n*After the Recitation*\n**Dismounting Hymn**\n\nWe, your humble servants, have hitherto led the pure assembly in ascending the altar to perform the Dao. We have offered prayers for the eternal peace of the Sacred Longevity and completed the recitation of *The Wondrous Numinous Northern Dipper Life-Mandate Longevity Sutra of the Most High* once each, now fully accomplished. Reverently we look up, praying that felicity and longevity be bestowed upon life, and that virtuous fruits gather upon the self. Each person, with utmost sincerity, circumambulates while chanting hymns of praise.\n\nProceeding in the *Step of Emptiness*, we are led to the Western Quarter, where incense is offered. Then, circumambulating, we return to our positions.\n\n**Three Hearings of the Sutra**\nAfter hearing the sutra, may heaven endure and earth abide, seas be calm and rivers clear.\nAfter hearing the sutra, may the Sacred Longevity be eternally at peace, and the imperial domain remain unshaken.\nAfter hearing the sutra, may the golden branches flourish, and the precious lineage extend in boundless glory.\n\n**Vows**\nConcentrating the spirit, we burn incense. May the Incense Official Envoys, the Left and Right Dragon-Tiger Lords, and the attendant spirit officials of incense cause this place where we have this morning performed the sutra recitation and Dao rituals to naturally produce golden liquid, cinnabar, azure mushrooms, and divine herbs. May the hundred numinous perfected beings gather here before the incense burner. May our sincere devotion move the divine, and may great blessings be silently bestowed. May the Sacred Longevity be eternally at peace, and the imperial domain endure forever.\n\nMay the immortal youths of the ten directions and jade maidens in attendance swiftly convey the sincerity of our supplications through the orchid-scented smoke, directly reaching the presence of the Utmost True, Boundless, and Great Dao—the Three Clarities, the Supreme Saints, the Purple Tenuity, the Northern Pole, the Great Emperor, and the Nine August Star Lords of the Northern Dipper.\n\n**Exiting the Hall Hymn**\nThe rites for the recitation of the *Wondrous Numinous Sutra* and the morning performance of the Dao are now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "金箓玄灵转经早午晚行道仪 经名：金箓玄灵转经早午晚行道仪。 三卷。 底本出处：《正统道藏》洞玄部威仪类。 玄灵转经早朝行道仪 法事如式 各礼师，存念如法 请宣神咒 九天上景，化生华晖。 晃漾太空，曜真紫微。 上致中皇，百神降回。 散根离苦，八难豁开。 七祖同升，福庆巍巍。 使我神仙，八景斋飞。 鸣法鼓二十四通 无上三天玄元始三炁太上老君，召出臣身中三五功曹、左右官使者、左右捧香驿龙骑吏、侍香金童、传言散花玉女、五帝直符直日香官，各三十六人出。 出者，严装显服，冠带垂缨。 关启玄坛土地、方域神真。",
      "translated_text": "*The Ritual of Circulating the Mysterious Numinous Scripture at Dawn, Noon, and Dusk from the Golden Register*\n**Scripture Title:** *Ritual of Circulating the Mysterious Numinous Scripture at Dawn, Noon, and Dusk from the Golden Register*\nThree scrolls.\nSource text: *Zhengtong Daoist Canon*, Dongxuan Section, Category of Dignified Observances.\n\n---\n\n### *Ritual of Circulating the Mysterious Numinous Scripture at Dawn*\nThe ritual proceeds according to form.\nAll pay homage to the master, contemplating as prescribed.\n\n**Invocation of the Divine Incantation:**\nThe supreme scenes of the Nine Heavens transform and give birth to radiant splendor.\nShimmering across the vast firmament, they illuminate the Purple Tenuity of true numina.\nAscending to the Central August, the hundred spirits descend in return.\nDispersing the roots of suffering, the eight adversities are dispelled.\nThe seven ancestors ascend together, their blessed fortune towering and majestic.\nMay we, the divine immortals, soar in the Eightfold Luminous Fast.\n\n**Strike the ritual drum twenty-four times.**\n\nO Most High Three Heavens, Mysterious Primordial Three *Qi* of the Supreme Venerable Lord Lao,\nSummon forth from within this servant’s body:\nThe Three and Five Merit Officers,\nThe Attendants of the Left and Right,\nThe Dragon-Riders bearing incense of the Left and Right Courier Posts,\nThe Golden Lads attending incense,\nThe Jade Maidens transmitting words and scattering flowers,\nThe Incense Officials of the Five Thearchs on duty for the day—\nEach in a company of thirty-six.\nLet them emerge, clad in solemn attire and resplendent robes,\nTheir caps and sashes adorned with pendent tassels.\n\n**Address the Land Spirit of the Mysterious Altar and the Divine Perfected of the Realm.**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 257,
      "start_sentence": 0,
      "end_sentence": 17,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.095258474349976,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经早朝行道仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "臣今早朝，升坛行道，朝谒神真。 钦奉其诸丹悃，具奏缄誊。 二愿得太上至真道炁灵宝瑞光下降，流入臣等身中。 令臣所启之诚，速达径御至真无极大道三清上圣中天星主紫微大帝北斗九皇星君御前。 请称法位 具位臣姓某与临坛官众等，谨同诚上启太上无极大道斗极祖师元始天尊，斗极玄师灵宝天尊，斗极宗师道德天尊，昊天玉皇上帝，北极紫微大帝，紫微天皇大帝，斗中高上玉皇尊星君大微玉帝，北极玄卿大帝君，北斗天英贪狼大星君、北斗天任巨门元星君、北斗天枢禄存真星君、北斗天心文曲纽星君、北斗天禽廉贞纲星君、北斗天辅武曲纪星君、北斗天冲破军关星君、北斗洞明左辅星君、北斗隐光右弼星君、九皇夫人、九阴内妃、天罡大圣万真节度奎光帝君、北斗中三台华盖星君，当生本命星君，南极老人寿德星君、上清福德星君、上清禄德星君，帝座照临星宰、二十八宿星君，六十甲子星君、道德玄曹官君圣众，玄中大法师真君、三天大法师真君，中天九省诸相丈人、左右绣衣使者、擎羊陀罗使者，四直玉文功曹、通事舍人，斗中千乘万骑，一切真灵。 恭望洪慈，俯回洞鉴。 臣闻三景开明，九星胤彩。",
      "translated_text": "This servant now at early audience ascends the altar to perform the Dao and pay homage to the divine perfected.\n\nWith reverence, I present these vermilion sincerities, fully transcribed and sealed for submission.\n\nMay it be that the radiant luminous treasure-light of the Most High Perfect Dao-*qi* descend and flow into our bodies, that the sincerity of this servant’s invocation swiftly reach and be received before the Most True and Boundless Dao, the Three Clarities, the August Celestial Worthies, the Star Lord of the Central Heaven, the Purple Tenuity Great Emperor, and the Nine August Star Lords of the Northern Dipper.\n\n**Proclaiming the dharma-positions:**\n\nThis humble servant, [Name], together with the assembly of altar-officiants, with united sincerity respectfully addresses:\n\nThe Most High Boundless Dao, Dipper-Pole Ancestral Master, Celestial Worthy of Primordial Beginning;\nThe Dipper-Pole Mystic Preceptor, Celestial Worthy of Numinous Treasure;\nThe Dipper-Pole Patriarchal Master, Celestial Worthy of Dao and Virtue;\nThe Jade Thearch of the August Heaven;\nThe Great Emperor of the Northern Culmen, Purple Tenuity;\nThe Heavenly Thearch of Purple Tenuity;\nThe August Star Lord of the Lofty Central Dipper, Jade Emperor of the Great Tenuity;\nThe Great Emperor Lord of the Northern Culmen, Mystic Minister;\nThe Great Star Lord of Heavenly Hero, Greedy Wolf of the Northern Dipper;\nThe Primordial Star Lord of Heavenly Task, Great Gate of the Northern Dipper;\nThe True Star Lord of Heavenly Pivot, Emolument-Existence of the Northern Dipper;\nThe Star Lord of Heavenly Heart, Literary Brilliance and Tie of the Northern Dipper;\nThe Star Lord of Heavenly Chariot, Integrity and Principle of the Northern Dipper;\nThe Star Lord of Heavenly Auxiliary, Martial Brilliance and Record of the Northern Dipper;\nThe Star Lord of Heavenly Impulse, Broken Army and Pass of the Northern Dipper;\nThe Star Lord of Luminous Cavern, Left Auxiliary of the Northern Dipper;\nThe Star Lord of Hidden Light, Right Assistant of the Northern Dipper;\nThe Nine August Ladies;\nThe Nine Yin Inner Consorts;\nThe Heavenly Stem Great Sage, Myriad Perfected Nodal Commander, Radiant Strider Emperor Lord;\nThe Three Terraces of the Dipper’s Center, Canopy Star Lords;\nThe Star Lord of this servant’s natal destiny;\nThe Old Man of the Southern Culmen, Star Lord of Longevity and Virtue;\nThe Star Lord of Blessing and Virtue of the Highest Clarity;\nThe Star Lord of Emolument and Virtue of the Highest Clarity;\nThe Star Governor of the Throne’s Illumination;\nThe Twenty-Eight Constellation Star Lords;\nThe Sixty Stem-Branch Star Lords;\nThe Sagely Assembly of the Dao-Virtue Mystic Ministers;\nThe Perfected Lord, Great Dharma Master of the Mystic Center;\nThe Perfected Lord, Great Dharma Master of the Three Heavens;\nThe Venerable Elders of the Nine Provinces of the Central Heaven;\nThe Left and Right Embroidered-Robed Envoys;\nThe Envoys bearing the Goat and Dharaṇī;\nThe Jade Text Merit Officers of the Four Watches;\nThe Attendants of Communications;\nThe Thousand Chariots and Myriad Riders of the Dipper;\nAll divine numina.\n\nWe humbly beseech your vast compassion to deign to turn and peer with penetrating vision.\n\nThis servant has heard: when the Three Luminaries open their brightness, the Nine Stars bequeath their splendor.",
      "overlap_context": "tendants of the Left and Right,\nThe Dragon-Riders bearing incense of the Left and Right Courier Posts,\nThe Golden Lads attending incense,\nThe Jade Maidens transmitting words and scattering flowers,\nThe Incense Officials of the Five Thearchs on duty for the day—\nEach in a company of thirty-six.\nLet them emerge, clad in solemn attire and resplendent robes,\nTheir caps and sashes adorned with pendent tassels.\n\n**Address the Land Spirit of the Mysterious Altar and the Divine Perfected of the Realm.**",
      "start_char": 257,
      "end_char": 714,
      "start_sentence": 18,
      "end_sentence": 25,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.910465717315674,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经早朝行道仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "地祇拥玉局之座，道运昭敷； 天师侍金阙之尊，经文焕耀。 作舟船而津梁男女，司喉舌而统御仙灵。 凡居堪舆之中，孰出陶镕之外。 臣等宿缘储庆，真籍登名。 参河图豁落之文； 佩三五璇玑之箓。 勉思功行，庸赞生成。 以今钦奉圣旨，崇修金箓。 臣等恪遵经诀，夙建灵坛。 象地法天，望紫宸而稽首； 延生益算，注丹简以倾心。 愿施雨露之恩，冀顺阴阳之序。 以今早朝，升坛行道，请法众等，运兹初捻上香。 愿此香烟腾空，径上供养至真无上道宝大罗元始天尊、紫微上宫天皇大帝、玉斗二帝、九皇星君、清微天宫真仙圣众。 臣等皈身皈神皈命，首体投地，仰依太上三尊、十方众圣。 愿以是香功德，上祝皇帝陛下。 伏愿乾坤呈彩，河洛辉符。 赤雁白麟，千古纪瑶图之瑞； 金枝玉叶，万年开宝历之祥。 圣寿天齐，皇明日丽。 今故烧香，自皈依师尊大圣众，至真之德，得道之后，保天长存，和与道合真。 以今早朝，升坛行道，请法众等，运兹二捻上香。 愿此香烟腾空，径上供养至真无上经宝玉宸道君、灵宝天尊、紫微中宫北极大帝、当生本命元辰星君、帝座照临星宰、禹余天宫真仙圣众。 臣等皈身皈神皈命，首体投地，仰依太上三尊、十方众圣。 愿以是香功德，敬祝皇太子殿下。 伏愿真风披拂，慧日舒明。 碧汉流祥，寿域天开於箕翼； 紫枢衍庆，福源云集於芝兰。 今故烧香，自皈依师尊大圣众，至真之德，得道之后，保天长存，和与道合真。 以今早朝，升坛行道，请法众等，运兹三捻上香。 愿此香烟腾空，径上供养至真无上师宝五灵玄老、道德天尊、南极老人寿德星君、上清福德星君、上清禄德星君、太赤天宫真仙圣众。 臣等皈身皈神饭命，首体投地，仰愿依太上三尊、十方众圣。 愿以是香功德，皈流臣等三师四友、同学门人。 状愿性天澄湛，心地虚明。 定箓金华，八万四千之尘劳净尽； 摽名玉简，一千二百之戒行周圆。 今故烧香，自皈依师尊大圣众，至真之德，得道之后，永保长存。 和与道合真。 七元覆护天尊",
      "translated_text": "The Earth Deities uphold the jade-disk throne, as the Dao’s unfolding destiny shines forth;\nThe Heavenly Masters attend the golden-gated august presence, as scriptures and texts radiate brilliance.\nThey serve as boats and bridges to ferry men and women, and govern tongues to command the divine numina.\nOf all who dwell within the geomantic realm, none stand beyond the crucible of transformation.\n\nWe, your servants, have stored blessings through past karmic affinity, and our names are inscribed in the registers of the Perfected.\nWe have studied the *Hetu* and the *Huoluo* texts,\nand bear the talismans of the Three-and-Five Jade Celestial Mechanism.\nWe strive in merit and conduct, humbly aiding the work of generation and completion.\n\nToday, in reverent compliance with the sagely decree, we undertake the veneration of the Golden Register.\nWe, your servants, have diligently followed the scriptural instructions and established the numinous altar from of old.\nModeling earth upon heaven, we gaze toward the Purple Palace and bow our heads;\nProlonging life and augmenting destiny, we inscribe our hearts upon the cinnabar tablets.\nMay the grace of rain and dew be bestowed, that the sequence of yin and yang may be harmonized.\n\nThis morning, ascending the altar to perform the Dao, we, the assembled ritualists, now offer the first pinch of incense.\nMay this incense smoke ascend directly to the heavens, offering reverence to the Most Perfect and Supreme Dao-Treasure:\nThe Great Primal Heavenly Worthy of the Great Luo of the Unsurpassed Dao,\nThe Heavenly Emperor of the Purple Tenuity’s Upper Palace,\nThe Two Emperors of the Jade Dipper,\nThe Nine August Star Lords,\nand the Perfected and Sages of the Heavenly Palace of Pure Tenuity.\n\nWe, your servants, take refuge in body, spirit, and life, prostrating ourselves with heads to the earth,\nand reverently depend upon the Three August Ones of the Most High and the sacred hosts of the Ten Directions.\nMay the merit of this incense be dedicated to the August Emperor, our Sovereign.\nWe humbly pray that heaven and earth display their splendor, and the Yellow and Luo Rivers radiate their auspicious signs.\nRed geese and white unicorns, through a thousand ages, record the jade charts’ omens;\nGolden branches and jade leaves, for ten thousand years, unfold the treasure calendar’s felicity.\nMay the sagely longevity equal that of heaven, and the imperial sun shine resplendently.\n\nThus we now burn incense, from our refuge in the Great Sacred Host of Master Teachers,\nto the virtue of the Most Perfect Ones.\nAfter attaining the Dao, may they preserve heaven’s enduring existence,\nand harmonize with the Dao in perfect unity.\n\nThis morning, ascending the altar to perform the Dao, we, the assembled ritualists, now offer the second pinch of incense.\nMay this incense smoke ascend directly to the heavens, offering reverence to the Most Perfect and Supreme Scripture-Treasure:\nThe Jade Tenuity Dao Lord of the Heavenly Palace,\nThe Numinous Treasure Heavenly Worthy,\nThe Great Emperor of the North Culmen of the Purple Tenuity’s Central Palace,\nThe Star Lord of Our Fundamental Destiny and Life-Span,\nThe Star Governor Illuminating the Throne,\nand the Perfected and Sages of the Heavenly Palace of Yu-Yu.\n\nWe, your servants, take refuge in body, spirit, and life, prostrating ourselves with heads to the earth,\nand reverently depend upon the Three August Ones of the Most High and the sacred hosts of the Ten Directions.\nMay the merit of this incense be respectfully dedicated to His Highness the Imperial Heir.\nWe humbly pray that the true wind may spread, and the sun of wisdom shine brightly.\nMay the Azure Han pour forth auspiciousness, and the realm of longevity open in the constellations of Winnowing Basket and Wings;\nMay the Purple Pivot extend its blessings, and clouds of fortune gather around the orchid and iris.\nThus we now burn incense, from our refuge in the Great Sacred Host of Master Teachers,\nto the virtue of the Most Perfect Ones.\nAfter attaining the Dao, may they preserve heaven’s enduring existence,\nand harmonize with the Dao in perfect unity.\n\nThis morning, ascending the altar to perform the Dao, we, the assembled ritualists, now offer the third pinch of incense.\nMay this incense smoke ascend directly to the heavens, offering reverence to the Most Perfect and Supreme Master-Treasure:\nThe Five Numinous Primal Elders,\nThe Heavenly Worthy of Virtue and Power,\nThe Old Man of the Southern Culmen, Star Lord of Longevity and Virtue,\nThe Star Lord of Blessing and Virtue of the Supreme Purity,\nThe Star Lord of Emolument and Virtue of the Supreme Purity,\nand the Perfected and Sages of the Heavenly Palace of Great Redness.\n\nWe, your servants, take refuge in body, spirit, and life, prostrating ourselves with heads to the earth,\nand reverently depend upon the Three August Ones of the Most High and the sacred hosts of the Ten Directions.\nMay the merit of this incense be dedicated to the return and flow of grace upon our Three Masters, Four Companions,\nand fellow disciples of the same school.\nWe pray that our nature-sky may be serene and limpid, and our mind-ground empty and luminous.\nMay the golden blossoms of the fixed registers dispel the eighty-four thousand dusts of toil;\nMay the jade slips of inscribed names fulfill the one thousand two hundred precepts in perfect roundness.\nThus we now burn incense, from our refuge in the Great Sacred Host of Master Teachers,\nto the virtue of the Most Perfect Ones.\nAfter attaining the Dao, may they eternally preserve enduring existence,\nand harmonize with the Dao in perfect unity.\n\nThe Seven Primes shelter and protect, Heavenly Worthies.",
      "overlap_context": "Elders of the Nine Provinces of the Central Heaven;\nThe Left and Right Embroidered-Robed Envoys;\nThe Envoys bearing the Goat and Dharaṇī;\nThe Jade Text Merit Officers of the Four Watches;\nThe Attendants of Communications;\nThe Thousand Chariots and Myriad Riders of the Dipper;\nAll divine numina.\n\nWe humbly beseech your vast compassion to deign to turn and peer with penetrating vision.\n\nThis servant has heard: when the Three Luminaries open their brightness, the Nine Stars bequeath their splendor.",
      "start_char": 714,
      "end_char": 1488,
      "start_sentence": 26,
      "end_sentence": 65,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.557501316070557,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经早朝行道仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "启经 臣闻，本命经诀，无上法桥。 实三洞之真宗，为群生之正路。 故开转者，得生人中，而聪明殊胜； 令持诵者，永为身宝，而福寿可称。 臣自愧凡微，欣逢化育。 荷七星之降炁，感二极之垂精。 持人命以保天年，既悉由於主宰； 设礁筵而修香火，敢自蹈於轻迷。 钦奉纶音，崇修金箓。 三时行道，依秘典以宣扬； 九徧转经，按洞章而啸咏。 玄坛阐事，紫极布恩。 期密仗於一乘，可增延於万寿。 伏愿玄灵焕彩，斗极流辉。 监兹一瓣之香，恪赐九光之烛。 冀一人之有庆，四海永清； 感万圣之护持，千真敬仰。 达生荣界，出入福乡。 稽首皈依，人各恭敬。 三皈依 志心皈依，十方经宝，当愿众生，心开悟解，受持读诵。 志心皈依，十方道宝，当愿众生，起心回向，一切信礼。 志心皈依，十方师宝，当愿众生，普上法桥，无有障碍。 宿命赞 宿命有信然，弱丧谓之无。 皆欲眼前见，过目即言悠。 大贤明道教、惨戚悯顽夫。 依依念子苦，勤勤令我忧。 臣等谨按经云，北辰在上，而众星拱之，为造化之枢机，作人神之主幸。 有消灾度厄之力，有延龄益算之功。 上至帝王，下及庶人。 尊卑虽则殊途，命分俱无差别。 以今钦奉纶音，崇修金箓，祝寿延禧。 臣等谨率在坛清众，转诵《太上玄灵北斗本命延生真经》各一过，上祝中天大圣、第一太尉府‘天英贪狼玉晨君，乞为削落南离九紫、鹑火分野、一切之厄。 仰希矜轸，俯赐允俞。 臣不胜激切之至，修行经法。",
      "translated_text": "**Invocation of the Sutra**\n\nWe, your humble servants, have heard that the life-mandate sutra and its esoteric instructions form the supreme Dharma-bridge. It is the true essence of the Three Caverns, the right path for all living beings. Thus, those who open and recite it are reborn among humankind, endowed with exceptional intelligence and clarity; those who uphold and chant it make it their eternal treasure, gaining blessings and longevity worthy of praise.\n\nWe, unworthy and base, rejoice in encountering this transformative cultivation. Bearing the descending *qi* of the Seven Stars, moved by the concentrated essence bestowed by the Two Poles, we hold fast to the mandate of life to preserve our Heaven-appointed years—all of which depends on the sovereign powers. Yet in preparing this offering feast and tending the incense fire, we dare not indulge in careless folly. Reverently heeding the sacred edict, we honor and perform the Golden Register rites.\n\nThrice daily we practice the Dao, proclaiming its mysteries in accordance with the secret scriptures; nine times we recite the sutra, chanting and intoning its cavernous verses. The Mysterious Altar unfolds its affairs, the Purple Pole dispenses its grace. May we rely in secret upon the One Vehicle to augment and extend our myriad years.\n\nWe humbly pray that the numinous spirits shine resplendent, the Dipper and Pole Star radiate their brilliance. Overseeing this single offering of incense, may you bestow the ninefold radiance of your candlelight. May one man’s felicity bring eternal clarity to the Four Seas; may the protection of the ten thousand sages inspire reverence among the thousand perfected. May we reach the realm of flourishing life, entering and departing the land of blessings.\n\nWith bowed heads, we take refuge, each with utmost reverence.\n\n**The Three Refuges**\nWith wholehearted devotion, we take refuge in the sutras of the Ten Directions—may all beings awaken to understanding, receive, uphold, read, and recite them.\nWith wholehearted devotion, we take refuge in the Dao of the Ten Directions—may all beings turn their minds toward it, offering sincere reverence.\nWith wholehearted devotion, we take refuge in the masters of the Ten Directions—may all beings ascend the Dharma-bridge without obstruction.\n\n**Hymn of Past Lives**\nPast lives are indeed real,\nYet the feeble dismiss them as nonexistent.\nAll crave what lies before their eyes,\nDismissing what passes beyond their gaze as false.\nThe great sages illuminate the Dao’s teachings,\nGrieving for the stubborn and ignorant.\nTenderly they recall the suffering of their disciples,\nDiligently they labor for our concerns.\n\nWe, your humble servants, respectfully follow the sutra’s words: the Northern Aster stands above, encircled by the host of stars, serving as the pivot of creation and the lord of human spirits. It possesses the power to dispel calamities and transcend adversity, the merit to prolong life and augment destiny. From emperors above to commoners below, though ranks differ, the mandate of life knows no distinction.\n\nToday, reverently heeding the sacred edict, we honor and perform the Golden Register rites for longevity and felicity. We, your humble servants, lead the pure assembly of this altar in reciting *The Wondrous Numinous Northern Dipper Life-Mandate Longevity Sutra of the Most High* once each, offering prayers to the Great Sage of the Central Heaven, the First Grand Marshal of the Celestial Bureau—Lord Tianying Tanlang Yuchen of the Jade Dawn. We beseech you to erase the Nine Purples of the Southern Fire, the misfortunes of the Quail’s Fire domain, and all adversities.\n\nWe look up in hope of your compassion, praying for your gracious assent. Overwhelmed by the utmost urgency, we perform these sutra rites.",
      "overlap_context": "y the golden blossoms of the fixed registers dispel the eighty-four thousand dusts of toil;\nMay the jade slips of inscribed names fulfill the one thousand two hundred precepts in perfect roundness.\nThus we now burn incense, from our refuge in the Great Sacred Host of Master Teachers,\nto the virtue of the Most Perfect Ones.\nAfter attaining the Dao, may they eternally preserve enduring existence,\nand harmonize with the Dao in perfect unity.\n\nThe Seven Primes shelter and protect, Heavenly Worthies.",
      "start_char": 1488,
      "end_char": 2068,
      "start_sentence": 66,
      "end_sentence": 102,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.443827867507935,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经早朝行道仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "敷座赞 题经 诵经毕 解座赞 臣等向来，祇率清众，升坛行道。 上祝圣寿万安，转诵《太上玄灵北斗本命延生真经》各一过，并已周圆。 恭望福寿资命，善果臻身。 人各运诚，旋行赞咏。 步虚，引至南方，上香，旋行复位 玄灵感应天尊 臣等谨按经云，本命之日，修斋设醮，启祝北斗，三官五帝，九府四司，荐福消灾，奏章恳愿，功德深重，不可具陈。 以今钦奉纶音，崇修金箓，祝寿延禧。 臣等谨率在坛清众，转诵《太上玄灵北斗本命延生真经》各一过，上祝中天大圣，第二上宰府天任巨门玉晨君。 乞为削落东北艮位、八白折木、星纪分野、一切之厄。 仰希矜轸，俯赐允愈。 臣等不胜激切之至，修行经法。 敷座赞 题经 诵经毕 解座赞",
      "translated_text": "**Seating Hymn**\n*Title of the Sutra*\n*After the Recitation*\n**Dismounting Hymn**\n\nWe, your humble servants, have just now led the pure assembly in ascending the altar to perform the Dao. We have offered prayers for the eternal peace of the Sacred One’s longevity and completed the recitation of *The Wondrous Numinous Northern Dipper Life-Mandate Longevity Sutra of the Most High* once each, now fully accomplished. Reverently we hope that felicity and longevity will sustain life, and that virtuous fruits will gather upon the self. Each person moves with sincerity, circling in hymns of praise.\n\n*Step into the Void*, proceed to the southern quarter, offer incense, and circle back to position.\n**Numinous Response of the Mysterious Spirit, Heavenly Worthy**\n\nWe, your humble servants, respectfully follow the sutra’s teaching: on the day of one’s life-mandate, to perform the fast and establish the jiao, to invoke the Northern Dipper, the Three Officials, the Five Emperors, the Nine Bureaus, and the Four Offices, to present blessings and dispel calamities, to submit memorials and entreat wishes—such merit and power are profound and cannot be fully expressed.\n\nToday, reverently heeding the sacred edict, we honor and perform the Golden Register rites for longevity and felicity. We, your humble servants, lead the pure assembly of this altar in reciting *The Wondrous Numinous Northern Dipper Life-Mandate Longevity Sutra of the Most High* once each, offering prayers to the Great Sage of the Central Heaven, the Second Grand Ministerial Bureau—Lord Tianren Jumen Yuchen of the Jade Dawn. We beseech you to erase the Eight Whites of the Northeastern Gen position, the misfortunes of the Starry Chronicle’s Wood domain, and all adversities.\n\nWe look up in hope of your compassion, praying for your gracious assent. Overwhelmed by the utmost urgency, we perform these sutra rites.\n\n**Seating Hymn**\n*Title of the Sutra*\n*After the Recitation*\n**Dismounting Hymn**",
      "overlap_context": "minous Northern Dipper Life-Mandate Longevity Sutra of the Most High* once each, offering prayers to the Great Sage of the Central Heaven, the First Grand Marshal of the Celestial Bureau—Lord Tianying Tanlang Yuchen of the Jade Dawn. We beseech you to erase the Nine Purples of the Southern Fire, the misfortunes of the Quail’s Fire domain, and all adversities.\n\nWe look up in hope of your compassion, praying for your gracious assent. Overwhelmed by the utmost urgency, we perform these sutra rites.",
      "start_char": 2069,
      "end_char": 2383,
      "start_sentence": 103,
      "end_sentence": 122,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.216660737991333,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经早朝行道仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "臣等向来，祇率清众，升坛行道。 上祝圣寿万安，转诵《太上玄灵北斗本命延生真经》各一过，并已周圆。 恭望福寿资命，善果臻身。 人各运诚，旋行赞咏。 步虚，引至东北方，上香，旋行复位 大慈延寿天尊 臣等谨按经云，若有危厄，如何救解。 急须投告北斗，醮谢真君，及转真经，认本命真君，方获安泰，以致康荣。 以今钦奉纶音，崇修金箓，祝寿延禧。 臣等谨率在坛清众，转诵《太上玄灵北斗本命延生真经》各一过，上祝中天大圣、第三司空府天柱禄存玉晨君。 乞为削落西兑大梁分野、一切之厄。 仰希矜翰，俯赐允俞。 臣等不胜激切之至，修行经法。 敷座赞 题经 诵经毕 解座赞",
      "translated_text": "We, your humble servants, have hitherto led the pure assembly in ascending the altar to perform the Dao rites. In reverent offering, we have recited *The Wondrous Numinous Northern Dipper Life-Mandate Longevity Sutra of the Most High* once each, now fully completed, to supplicate for the eternal peace of the sacred longevity. We humbly pray that the blessings of fortune and longevity be bestowed upon the life-mandate, and that the fruits of goodness gather upon each person. With utmost sincerity, we circumambulate in hymns of praise.\n\nProceeding in the *Step of Emptiness*, we are guided to the northeastern quarter, where incense is offered. We circumambulate and return to our positions.\n\n**Great Compassionate Longevity Heavenly Worthy**\n\nWe, your humble servants, reverently follow the sutra’s teaching: when peril or adversity arises, how may one seek deliverance? One must urgently petition the Northern Dipper, offer rites of gratitude to the Perfected Lords, and recite the true sutra, acknowledging the Perfected Lord of one’s life-mandate, only then may one attain peace and prosperity, leading to health and honor.\n\nToday, reverently heeding the sacred edict, we honor and perform the Golden Register rites for longevity and felicity. We, your humble servants, lead the pure assembly of this altar in reciting *The Wondrous Numinous Northern Dipper Life-Mandate Longevity Sutra of the Most High* once each, offering prayers to the Great Sage of the Central Heaven, the Third Ministerial Bureau of Works—Lord Tianzhu Luchen Yuchen of the Jade Dawn. We beseech you to erase the adversities of the Western Dui position, the Great Liang domain, and all misfortunes.\n\nWe look up in hope of your compassion, praying for your gracious assent. Overwhelmed by the utmost urgency, we perform these sutra rites.\n\n**Seating Hymn**\n*Title of the Sutra*\n*After the Recitation*\n**Dismounting Hymn**",
      "overlap_context": "rayers to the Great Sage of the Central Heaven, the Second Grand Ministerial Bureau—Lord Tianren Jumen Yuchen of the Jade Dawn. We beseech you to erase the Eight Whites of the Northeastern Gen position, the misfortunes of the Starry Chronicle’s Wood domain, and all adversities.\n\nWe look up in hope of your compassion, praying for your gracious assent. Overwhelmed by the utmost urgency, we perform these sutra rites.\n\n**Seating Hymn**\n*Title of the Sutra*\n*After the Recitation*\n**Dismounting Hymn**",
      "start_char": 2383,
      "end_char": 2665,
      "start_sentence": 123,
      "end_sentence": 139,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.818971395492554,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经早朝行道仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "臣等向来，只率清众，升坛行道。 上祝圣寿万安，转诵《太上玄灵北斗本命延生真经》各一过，并已周圆。 恭望福寿资命，善果臻身。 人各运诚，旋行赞咏。 步虚，引至西方，上香，旋行复位 三闻经 闻经已后，当愿天长地久，海晏河清。 闻经已后，当愿圣寿万安，皇图巩固。 闻经已后，当愿金枝蕃衍，宝历绵洪。 发愿 存神烧香 香官使者、左右龙虎君、侍香诸灵官，当令臣向来早朝转经行道之所，自然生金液丹碧芝英。 百灵众真，交会在此，香火炉前。 当愿丹诚感格，洪贶潜敷。 圣寿万安，皇图永久。 十方仙童，玉女接侍，兰烟传臣向来所奏之诚，速达径御至真无极大道三清上圣紫微北极大帝北斗九皇星君御前。 出堂颂 玄灵转经早朝行道仪竟",
      "translated_text": "We, your humble servants, have hitherto led the pure assembly in ascending the altar to perform the Dao. We have offered prayers for the eternal peace of the Sacred Longevity and completed the recitation of *The Wondrous Numinous Northern Dipper Life-Mandate Longevity Sutra of the Most High* once each, now fully accomplished. Reverently we look up, praying that felicity and longevity be bestowed upon life, and that virtuous fruits gather upon the self. Each person, with utmost sincerity, circumambulates while chanting hymns of praise.\n\nProceeding in the *Step of Emptiness*, we are led to the Western Quarter, where incense is offered. Then, circumambulating, we return to our positions.\n\n**Three Hearings of the Sutra**\nAfter hearing the sutra, may heaven endure and earth abide, seas be calm and rivers clear.\nAfter hearing the sutra, may the Sacred Longevity be eternally at peace, and the imperial domain remain unshaken.\nAfter hearing the sutra, may the golden branches flourish, and the precious lineage extend in boundless glory.\n\n**Vows**\nConcentrating the spirit, we burn incense. May the Incense Official Envoys, the Left and Right Dragon-Tiger Lords, and the attendant spirit officials of incense cause this place where we have this morning performed the sutra recitation and Dao rituals to naturally produce golden liquid, cinnabar, azure mushrooms, and divine herbs. May the hundred numinous perfected beings gather here before the incense burner. May our sincere devotion move the divine, and may great blessings be silently bestowed. May the Sacred Longevity be eternally at peace, and the imperial domain endure forever.\n\nMay the immortal youths of the ten directions and jade maidens in attendance swiftly convey the sincerity of our supplications through the orchid-scented smoke, directly reaching the presence of the Utmost True, Boundless, and Great Dao—the Three Clarities, the Supreme Saints, the Purple Tenuity, the Northern Pole, the Great Emperor, and the Nine August Star Lords of the Northern Dipper.\n\n**Exiting the Hall Hymn**\nThe rites for the recitation of the *Wondrous Numinous Sutra* and the morning performance of the Dao are now complete.",
      "overlap_context": "e Most High* once each, offering prayers to the Great Sage of the Central Heaven, the Third Ministerial Bureau of Works—Lord Tianzhu Luchen Yuchen of the Jade Dawn. We beseech you to erase the adversities of the Western Dui position, the Great Liang domain, and all misfortunes.\n\nWe look up in hope of your compassion, praying for your gracious assent. Overwhelmed by the utmost urgency, we perform these sutra rites.\n\n**Seating Hymn**\n*Title of the Sutra*\n*After the Recitation*\n**Dismounting Hymn**",
      "start_char": 2665,
      "end_char": 2983,
      "start_sentence": 140,
      "end_sentence": 157,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.898174047470093,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玄灵转经早朝行道仪.txt",
        "category": "威仪类"
      }
    }
  ]
}