{
  "source_id": "玄谭全集",
  "source_file": "chunked_daozang\\玄谭全集.json",
  "total_chunks": 10,
  "total_original_chars": 9342,
  "total_translated_chars": 53121,
  "total_translation_time": 266.53317308425903,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\玄谭全集.txt",
    "category": "藏外"
  },
  "full_translation": "The *Complete Mystical Discourses* – Zhang Sanfeng states:\n\nThe Dao consists in nothing more than the Center. Thus the Confucians speak of \"attaining the Center,\" the Daoists of \"guarding the Center,\" and the Buddhists of \"emptiness within the Center.\" Yet the Center of which Internal Alchemy speaks is the aperture within the aperture—the true Center.\n\nI alone lament that people fail to recognize the Center. Some seek it amid the nine palaces, calling it the \"Mud Pill,\" yet do not find it. Others seek it an inch and three-tenths below the navel, calling it the \"Cinnabar Field,\" yet do not find it. Still others measure the span of eight inches and four-tenths between heart and navel, taking the midpoint of one inch and two-tenths as the Center, or search between the two kidneys, directly opposite the navel wheel—yet do not find it.\n\nSeeking it through form, none can attain it. Then, reversing their approach, they name the barrier the \"Mysterious Pass\" and the feminine the \"Mysterious Transformation\"—is this not the valley of the formless, which cannot be sought through form?\n\nSeeking it through the formless, they still cannot attain it. Reversing their approach once more, they say: \"Neither clinging to nonbeing nor to being, is it not that which is neither being nor nonbeing, and thus clings to neither the realm of being nor nonbeing?\"\n\nWisdom surpassing that of Yan [Hui] or Min [Sun] would struggle to fathom this. Now I transgress the prohibition and speak of it—not by choice, but of necessity.\n\nFor in this era, many immortals descend to be born among men, to save the world. Some take office, some become scholars, some engage in trade or commerce, some follow the Dao, some embrace Buddhism. Thus, I compose this text to present to them, that they may know how to save the world, return to the heavens above, and not fall into the dusty realm—this is my heart’s intent.\n\nThe *Outer Landscape* refers to externalizing the body and making it empty and void, first completing the cultivation of *xing* (nature). Zhang Sanfeng said: \"The Buddhists complete *xing* but must maintain vegetarian discipline; thus, the Great Void is myself—first empty the body. Once the body is empty, heaven and earth are also empty; once heaven and earth are empty, the Great Void is also empty. When emptiness is emptied of itself, this is true emptiness.\" He also said: \"Nonbeing itself gives rise to heaven and earth; externally, the void is embodied in nonbeing.\"\n\nThe *Inner Landscape* refers to internalizing the body and practicing fetal breathing, first completing the Daoist *Inner Landscape* cultivation of *ming* (life). Zhang Sanfeng said: \"The embryo grows through breath, and breath abides through the embryo. Within the aperture is the aperture—this is the true place where immortals abide in breath and the embryo dwells.\" Though heaven and earth are vast, they are but one embryo, and the revolutions of the sun and moon, the turning of the Dipper’s handle—these are the true breath. Have you not observed the texts of the Three Teachings? The *Book of Changes* says: *\"To preserve and sustain one’s nature is the gateway to the Dao and its power.\"* The *Dao De Jing* says: *\"Mysterious and again mysterious—this is the gateway to all wonders.\"* The *Sutra of Bequeathed Teachings* says: *\"Restrain it to one place, and nothing will remain undone.\"* All these are direct pointers.\n\nWhen I read without obstruction, I know that the sage and the ordinary are one, and I am no longer deluded by blind men. Sweeping away all side doors, I reorder the mind’s monkey, rekindle my resolve, humble my heart and lower my intent, endure trials and tribulations, seek a true teacher with suffering, and exhaustively pursue the origin of reception. This origin is the primordial ancestor of precelestial existence. It contains a speck of true yin and true yang, born before heaven and earth, at the inception of primordial chaos. This luminous pearl, like a grain of millet, hangs in the midst of perfect emptiness and correctness, radiant and unbounded. Yet those who have not awakened to its meaning are like drunks—every step they take, every move they make, leads to side doors.\n\nThis luminous pearl, suspended in emptiness, encompasses all phenomena and gives rise to all things—all are this ⊙. In Daoism, it is called true lead and true mercury. Once attained, it is attained forever. Do not cling to the images of qian and kun, the sun and moon, or male and female. Instead, within one’s own body, set up the furnace and establish the tripod. Refine the self and uphold the heart; when principle is understood and nature is seen, gather the fire and ignite it. Within a single double-hour, a grain of the mysterious pearl appears above the winding river. The moment it enters the mouth of the knife-house, in an instant, one aperture opens and a hundred apertures open with it. Fire spreads through the four limbs, and the entire body—sinews, bones, blood, and flesh—transforms, becoming like external mercury.\n\nAt this stage, a hundred days of firing are required to achieve numinous subtlety. Once attained, it is attained forever, with no regression. Abiding in the world while preserving form, refining spirit to return to the void, one becomes one with the Dao.\n\n○ In Buddhism, this is called true emptiness and true suchness, the awakened nature. If one knows the proper starting point, refining demons and seeing nature, in a moment’s effort, the true fire of samadhi arises, returning to the root and restoring the origin. All is perceived as one, heaven and earth are both empty, and a myriad of rosy clouds radiate. The five eyes and six penetrations are achieved, and the indestructible vajra body is forged, completing the mechanism that even ghosts and spirits cannot fathom.\n\n○ In Confucianism, this is the Supreme Ultimate born of the Ultimateless. Considering the external heaven and earth, the Ultimateless is the encompassing boundary of heaven and earth, before the division of the sun and moon, when the four directions and above and below were indistinguishable—a single chaotic mass, like yin mist or water. When the time came and qi was full, it surged and gave rise to the Supreme Ultimate. The Supreme Ultimate is the sun and moon. One must model oneself after heaven and earth, the sun and moon—not seek to gather the sun and moon of heaven and earth. Once the sun and moon are born, heaven and earth separate. The clear qi rises to become heaven, a vast emptiness filled with spirits—all are the radiant light of pure essence. The turbid qi descends to become earth, with mountains, rivers, and people all below. The five grains and all myriad things, though born on earth, all rely on the qi of heaven to come into being.\n\nHeaven’s clear qi is pure yang; earth’s turbid qi is pure yin. Dew descends from heaven—this is yang’s ability to generate yin. The myriad things arise from earth—this is yin’s ability to generate yang. Heaven and earth are a vast emptiness, boundless and infinite. The stars and spirits of heaven move and turn, each in its proper place; the myriad things on earth follow the four seasons and eight solar terms, all arising from emptiness. The sun and moon are the essence of heaven, illuminating the thirty-three heavens above and the nine springs of the Yellow Springs below. They revolve east and west, rise and descend, and the alternation of cold and heat proceeds. The sun is the body of pure yang, containing within it a speck of true yin essence. It pertains to the Green Dragon, the Maiden, jia wood, mercury, the Golden Crow, and the three *hun*—this is the external other. The moon is the body of pure yin, containing within it a speck of true yang. It pertains to the White Tiger, the Infant, geng metal, cinnabar, the Jade Hare, and the seven *po*—this is the internal self.\n\nThe creation of the human body mirrors that of heaven and earth. Thus, the human body also possesses a true sun and moon. The Dao is near at hand, yet people seek it afar. The three *hun* belong to *xing* (nature), and nature resides at the edge of heaven. The seven *po* belong to *ming* (life), and life resides at the bottom of the sea. The internal and external communicate—these two words, *xing* and *ming*, resolve the meaning of ten thousand volumes. *Xing* belongs to spirit and is yin; *ming* belongs to qi and is yang. Thus it is said: *\"One yin and one yang—this is the Dao.\"* If one does not know that speck of true yin, how can one ever know and reach that speck of true yang?\n\nScholars of today not only fail to recognize true yang but also remain ignorant of true yin. Yet if one knows true yin, true yang is naturally known as well. Without encountering a true teacher, all efforts are spent in vain conjecture—though the Dao exists within heaven and earth, even heaven and earth do not comprehend it.\n\nScholars exhaustively investigate the wondrous apertures of the three talents—heaven, earth, and humanity—within the body, as well as the true workings of yin and yang within and without. If the essential meaning eludes them, upon seeing the varied names in texts, they lack firm understanding, cling to side paths, and cannot discern the principle. Unable to fathom the principle, the heart remains unilluminated; with the heart unilluminated, the celestial nature cannot shine like the bright moon. If one cannot see nature, how can one know life?\n\nAlas! The alchemical classics lack oral transmission—where then can one conceive the spiritual embryo?\n\n**Outer: The Precelestial True Yang**\nThis ⊙ diagram represents the creative workings within and without the body, called the *Tongtian Aperture*, the alchemical furnace, the path that evades life and death, the place of birth, the state before father and mother, where the five phases do not reach. That speck of true yang lies hidden in the secret place amid the four great form-mountains—this message is profoundly mysterious. This luminous pearl of spirit within the body shares the same essence as the external heaven and earth, sun and moon; it is the ancestor of the entire body. *\"Today the true parents are revealed—tomorrow, one need not fear death or life.\"* This is the compassionate teaching of the Most High, the essence of the *Huangting Jing*’s *Outer Landscape*.\n\n**Middle: Within the Body**\nThis ○ diagram is the creative source of heaven and earth, where the sword is forged as male and female, where the medicine is discerned as old or young. All things depend on this center—here heaven is established, earth is set firm. The karmic causes of ten thousand kalpas require correct transmission, for this is where heaven cannot descend to earth, nor earth ascend to heaven, eternally suspended in emptiness, its principle most difficult to clarify. Thus it is said: *\"The central aperture is known by few—it must be transmitted directly by a clear teacher.\"* Yet the union of Qian and Kun, the intercourse of Kan and Li—all occur here.\n\n**Inner: The Life-Master of the Sea-Bottom**\nThis ○ diagram is the numinous tortoise of golden essence at the sea-bottom, the *dui* metal of the other household within our body, the life-master of *wu* earth. The hundred vessels, the five viscera and six bowels—all depend on this entity for governance. Whether attaining immortality or buddhahood, transcending life and death—all rely on this cavity for arrangement. It is truly the place that secures life, the method that nurtures it, where no illness arises. It is the root and stem of all things, the Supreme Ultimate within the body—the compassionate teaching of the Most High, the essence of the *Huangting Jing*’s *Inner Landscape*.\n\nThe three talents—heaven, earth, and humanity—are truly spoken of within one’s own body. Viewed from the postcelestial, the body contains images and directions; but when investigated from the precelestial, it is the formless, directionless thing that gives birth to heaven, earth, humanity, and the ten thousand beings.\n\nThe immortals say: *\"Without the postcelestial, the precelestial has nothing to gather; without the precelestial, the postcelestial has nothing to transform.\"* These are the three true workings—upper, middle, and lower—of heaven, earth, and humanity within and without the body, the three true furnaces and tripods, belonging to the three teachings and the three vehicles of wondrous dharma. They embody the three talents—heaven, earth, and humanity—beyond form, and encompass the scriptures of the three teachings. This five-phase person within the five phases exists entirely within nature and life—how could one seek it elsewhere?\n\nThe *Wuzhen Pian* states: *\"Three, five, and one—these three words; from ancient times to now, those who truly understand are rare.\"* What I speak is no empty boast. Even setting aside the subtle intricacies of fire-times and gathering, merely the three five phases are known by not one in a million. If one understands the mutual \"theft\" of the three talents, returning to this root and restoring this origin, transmitting essence and sending spirit, stealing essence and exchanging qi, inverting and gathering—if one dares to undertake this, attaining immortality or buddhahood is not difficult.\n\nAll who study cultivation must first thoroughly investigate the true furnaces and tripods within and without the body. Without recognizing the true furnaces and tripods inside and out, there is no place to begin. Once one knows that the establishment of the furnace and tripod lies within and without, as well as the principle of yin and yang’s coming and going, then one investigates the medicinal materials—what is to be refined in the furnace and tripod?\n\n**Outer: True Lead and True Mercury**\nThis ⊙ aperture is the true furnace and tripod within and without the body. Here the nine-yang tripod is established, the wisdom-sword is forged to determine the timing, the pass is opened to gather the medicine, mercury returns within cinnabar, fire and water achieve balance through gathering and bathing. All occurs within this aperture, which contains a speck of true cinnabar mercury, clearly present in the neither-internal-nor-external place within the body—yet unknown to ten thousand people. Depart from this, and all is blind practice and aimless refinement. This is the external five phases of one’s own body, the external furnace and tripod, the external creative workings—precisely the nine-yang tripod cast by the Yellow Emperor.\n\n**Middle: The Cauldron of Kun Earth**\nThis ○ aperture is precisely where the embryo is gathered and congealed, where heaven, earth, and the ten thousand beings are born, where wind, clouds, thunder, and rain arise—all within the central palace’s true position. This is the divine chamber, the precious tripod that produces the inner and outer medicines, forges the male and female swords, withdraws lead and adds mercury, awaits the moment to transmute the elixir. Thus it is said: *\"The central aperture is known by few.\"*\n\n**Inner: The Life-Master Below the Navel**\nThis ○ aperture is the root of initiating work, the bridge to attaining the Dao. Here the furnace is established and the tripod set within, water and fire refine, method and resources are complete, spirit and qi are whole. Only when the upper seven apertures radiate light is the true moment at hand—then one may gather the medicine from the external furnace and tripod of the body to pair with the male and female within. All depends on this cavity. When the regulation of spirit is perfected, the ten thousand spirits obey, the stars revolve and the Dipper turns—only then can one seize the celestial mechanism beyond.\n\nThe upper aperture is the body of pure yang, containing within it a speck of true lead’s essence—this is the other household’s substance within our body, externally within the internal. It is the speck of light between the two kidneys, manifested externally, hence the metaphor.\n\nThe lower aperture is the body of pure yin, containing within it a speck of true yang’s qi—this is the substance of our own household within the body, belonging to the internal. It is the essence that flows from the Qian palace into the Kun position, hence the metaphor of the self. The upper aperture is female within and male without; the lower aperture is male within and female without—thus the immortals often use the metaphors of male and female, self and other.\n\nBetween them lies the central aperture, the Yellow Dame’s matchmaking chamber. Only when inversion and union occur here can sagehood be attained. The treasure of life comes from beyond one’s own body, yet it is still the substance of one’s own Kun position—existing within the dharma-body and the physical form of the other household. Thus the immortals say, “Gathering does not depart from one’s original spirit.”\n\nScholars of the world, lacking proper transmission, know not where to begin—clinging to the self is wrong, yet departing from it is also wrong. Who realizes that the speck of original yang, bright and clear, resides in the lofty depths of one’s own mystery, concealed in the secret place neither inside nor out? Within and without, a single qi connects them, an esoteric secret untransmitted for ages.\n\nYet the human body already possesses two true mechanisms, identical to the sun and moon of the external heavens, not differing by a hair. Heaven and earth are the greatest of all things, while humans are the most spiritually endowed among the ten thousand beings. Heaven and earth are but a great person, and a person is but a small heaven and earth—thus human transformation mirrors that of heaven and earth.\n\nWho awakens to the fact that each person has a celestial aperture? That each person possesses an elixir of immortality? That each person has a furnace for refining the pill? That each person has a ladder to ascend to heaven? That each person has something they do not recognize? That each person disbelieves in the formula for immortality? That each person disbelieves in the path to ascension in broad daylight? Choosing instead to accept death—how lamentable, how grievous!\n\nIn refining the Great Return Elixir, one must first replenish deficiency. Only when the marrow is full can one refine the Golden Liquid Great Return Elixir. The initial work begins by gathering the true yin within the upper aperture’s yang and introducing it into the inner golden tripod of the qi sea, where it unites with the kidney meridian. The true yin within yang is one’s own original spirit in its true form, externally corresponding to the three hun; the true yang within yin is the original qi of the body, corresponding to the seven po. When these two qi meet in sequence, Kan and Li naturally merge, hun and po blend, spirit congeals and qi coalesces, and fetal breathing stabilizes. Daily, like the intimacy of husband and wife, the joy is boundless—yet one must not fixate. When water and fire are balanced, they circulate through the four limbs like an active external flame. Maintaining equilibrium between water and fire is the fire-timing of the Small Celestial Cycle.\n\nHarmonizing and steaming, the true breath in the throat reverses back to the original sea, and the lower kidney naturally enters within. True fire spontaneously surges into the four limbs, the entire body softens with indescribable comfort, and within the abdomen, a living dragon ascends and descends with dozens of transformations. The infant and the maiden naturally unite—this is the stage of gathering yang to replenish yin, the work of laying the foundation and refining the self.\n\nIn refining the Golden Liquid Great Return Elixir, one must amass both internal and external method and resources, abiding in carefree ease day and night, perpetually luminous—this is the Way of longevity and enduring vision. Ordinary people rely entirely on the five grains for sustenance; if they go several days without eating, their qi dissipates and they die. When a person ages, the lower origin becomes deficient, the marrow empty, and they can no longer endure the qi of the five grains—thus the five grains both nourish and kill. If one masters the balance of internal water and fire, with qi and blood flowing in reverse, the five viscera harmonize, the spleen and stomach open, and food entering the abdomen transforms into qi, generating essence and spirit.\n\nOnce the celestial mechanism is grasped and the initial work begins, one must wait until the marrow is full, the abdomen and navel swollen like a pregnant woman—though this is not the form of a physical mass, but rather qi, essence, and spirit all full. When these three are complete, true fire refines, spirit and qi are cultivated, and the great man naturally attains the moment of accomplishment and fulfillment.\n\nI now urge the people of the world: seek diligently, inquire earnestly, and decisively unravel the celestial mechanisms within and without the body. Begin the work swiftly, refine the self, and await the moment. When the time arrives, choose a secluded place and enter the chamber to refine this Dragon-Tiger Great Elixir. It must be a quiet location where no roosters or dogs can be heard. Externally, only fellow adepts of the Dao should be present—no idle or unrelated persons may approach, lest the spirit be startled.\n\nThe immortals speak of harmonizing with the world, yet I speak of seclusion—why? To refine the self amidst the mundane and nurture qi in the mountains and forests. The Golden Liquid Return Elixir is the Way of transcending the ordinary and entering sagehood, incomparable to other pursuits. One must be unstained by a single speck of dust, free from all concerns, severed from all attachments like a blade cutting through silk, forever a stranger in a foreign land, with no thought of retreat or regret. The blood fills, the sinews and bones soften, the body becomes wrinkle-free like a spider’s form, the upper seven apertures radiate light day and night, the heart like the great void—only then is the true moment at hand, and one may seek immortality.\n\nFocus the mind single-pointedly, cultivate the spirit to perfection, and when it takes form and obeys command, the stars revolve and the Dipper turns, transforming at will. Only at this time, when qi is full and spirit complete, with abundant method and resources, can one refine the Great Elixir and become a true alchemist.\n\nOnce the work is underway, the seven apertures radiate light, the Three Yangs flourish, the spirit-sword takes form. Seizing the current to push the boat, fanning the wind to ignite the fire, when the first yang arises within, one may seize the celestial mechanism beyond, begin the work of opening the passes, and gather the Golden Elixir from beyond the body—marrying the Dragon to the Tiger as husband and wife. If one masters the gathering, the gold from the sea bottom is calmly drawn up, then the spine is opened, the Mud Pill Palace is connected, and it descends into the Crystal Palace to unite with Wood Mercury. In less than half a double-hour, the gathering is complete, true fire surges into the four limbs, and the entire body’s flesh and bones feel as if burned by fire and cut by a knife—this is the most difficult to endure. Even the bravest hero loses all composure at this point. One must guard against danger, bathe the body and mind in ice, balance water and fire, and in an instant, the entire body feels like popping beans, with all pores bursting open. The qi and blood throughout the body take form and speak, clamoring together upon the body.\n\nBeneath the root of the tongue lie two cavities: on the left, the Cinnabar Well, and on the right, the Sweet Spring—rightly named the Gushing Cavities. As the bone meridians open in unison, kidney water surges into the mouth, so copious that one cannot swallow fast enough; its flavor is most singular, far unlike that of granulated sugar. For thirty double-hours—two days and a half—this raging water is exhausted, and one awaits only the descent of celestial menses. At precisely this moment, a single drop of true lead descends, cool as a flake of ice, and immediately a drop of true mercury rises to meet it.\n\nOnce the gathering is complete, the entire body becomes serene, yet resounds like a thousand war drums, or roars like a million thunderclaps—this is the transformation of the hundred meridians and the blood throughout the body. Do not be alarmed; simply tread the Dipper’s steps, wield the sword, and grasp the seal. Here lies the most perilous point: three revolutions and nine turns, subduing marshals and summoning generals. With such vigilance, one may witness in the void the coupling of dragon and tiger, the harmony of heaven and earth, the union of sun and moon, or the manifestation of various immortal realms. Yet one must not mistake these for reality, lest external demons take hold.\n\nOnce true lead is united with mercury, after three days the great medicine is born. During this battle between the two, had I not personally revealed the secret, nine out of ten would have been frightened to death. Fear in the heart invites demonic obstructions. Having refined the primordial yang, the body transforms entirely into spirit, but if one turns back to harm oneself, though the form is transformed, it is but a yin spirit. Yin spirits are most cunning, capable of myriad transformations to cause harm, and unwilling to submit to good. As the common saying goes: *\"Only when you master the six penetrations can you speak of life and death; without the six penetrations, do not dream of subduing spirits.\"* If one cannot subdue spirits, how can one attain the Dao? If spirits cannot be seen, how can they cause harm?\n\nAfter another thirty double-hours—two days and a half—qi flows unimpeded, reaching its fullness. Suddenly, a radiant solar pearl emerges, lively and bright, leaping from its shell into the mouth. A million dragon spirits are struck with awe and lose their grip. This is the primordial seed, the true elixir of cinnabar. Only upon ingestion does one realize: *\"My life is mine, not heaven’s to command.\"* The immortals say: *\"Only after this great death does one truly live,\"* and again: *\"One battle settles all under heaven.\"* At this stage, true harmony between heaven and earth, the union of sun and moon, is finally achieved.\n\nWhen the medicine of true yang arrives, the fire of the microcosmic orbit ignites in an instant. The skeletal frame melts into a mass of fleshly mud, and the yang spirit departs the body, free and unobstructed. One must focus the mind, uphold emptiness, and guard the void, allowing the spirit to transform at will. All things under heaven are born of heaven and earth, and thus all spirits pay homage and submit. Weary of the dusty world, one roams carefree in Penglai, attended by three thousand jade maidens, feasting daily at the Peach Banquet, drinking immortal wine, wearing immortal flowers, the four great elements suffused with intoxication, the entire body utterly translucent. The tortoise and serpent of the sea bottom naturally coil together—only now is the true method of the Great Hibernation of the Five Dragons achieved.\n\nAfter a hundred days of refinement, the Mysterious Pass opens of itself, the infant appears in form, the tortoise and serpent emerge, and the ten thousand spirits are at one’s command. Only now are true lead and true mercury truly inverted, the entire body enveloped in purple mist and radiant beams, auspicious qi in a thousand strands, a red glow encasing the form. At this stage, the adept’s mouth finally gains control over mercury.\n\nAfter six months of refinement, the body resembles silver paste, the blood transforms into white nectar, the entire being exudes a fragrance that lingers, and the breath from the mouth forms clouds. This is the completion of the numinous elixir; one who consumes it shall never die and can even revive the dead. After ten months, the yang spirit departs the body, and a single form can divide into a hundred thousand. After twelve months, one seizes the full tally of heaven and earth, the yang spirit is perfected, and the eighty-four thousand yin spirits are shed from the body. One walks without casting a shadow in the sun or moon, passes through metal and stone unimpeded, drowns not in water nor burns in fire, blades find no purchase, spirits cannot fathom one’s designs, and transformations are endless—one has become a true person.\n\nThe entire body’s qi and vitality are now true medicine. A chicken that eats it becomes a phoenix, a horse that consumes it becomes a dragon, and a person who takes it becomes an immortal. This principle is even difficult for spirits to comprehend; without having seen or done it, who would believe such words?\n\nThe great medicine of the golden elixir, the work of creation and transformation, three revolutions and nine turns—its firing times are subtle. The oral instructions for the gathering lie within the span of five to seven. One overturns heaven and earth entirely, all naturally so. Though natural, one must understand the method of embodying heaven and earth’s creation to succeed; yet this does not mean one must rely on heaven, earth, sun, or moon to attain the Dao.\n\nThe matter of ingesting the great medicine must be personally experienced, witnessed, and tested before it aligns with the natural state. Though the work spans a year, the subtleties of the firing times lie within a hundred days; the perilous phases of movement and stillness occur within ninety days. Through inner and outer refinement, the gathering is achieved in an instant, and the sacred embryo is formed. It produces a pearl the size of a millet grain, which, when swallowed, ignites the fire of the microcosmic orbit. The womb is shed, the bones are transformed—one need only uphold emptiness and nurture the void, and all unfolds naturally.\n\nIf one truly finds a true teacher to clearly instruct, one first refines the self amidst the dust of the world, accumulates lead in the marketplace, gathers years into months, days into hours, hours into moments. Within this great stillness, all occurs in a single instant—less than half a double-hour—and the celestial mechanism is entirely overturned. One applies the work of ten months’ firing, embodying the natural method of heaven and earth. Without seeking life within death, how can one escape the three calamities and eight difficulties?\n\nScholars of great learning, keen and wise, who grasp one and know ten, who can expound and discourse on the scriptures of the Three Teachings—yet this only clarifies the principles of nature and the meanings of words. How can they comprehend the creation of the golden elixir, the celestial mechanism of the great Dao, or the two true messages of inner and outer? How can they awaken to this?\n\nIf one truly encounters a perfected being who imparts the authentic transmission, one will immediately penetrate principle, exhaust nature, and awaken—like water returning to the great sea. Then, upon examining all the alchemical scriptures, one finds the Dao in every line, horizontal or vertical. The alchemical texts of the various masters were not idly composed by their predecessors; not a single word or phrase is empty—only people fail to awaken to them.\n\nTake, for instance, the saying “swallow the golden elixir into the belly.” Those who miss the essential meaning fixate on the mouth and stomach, unaware that the wondrous aperture draws in the profound mystery of the entire Western River! Or consider those who speculate wildly about heaven and earth, sun and moon, male and female—all mere guesswork. Clinging to the sounds and appearances of side doors, they repel others from a thousand miles away, unwilling to humble themselves before the worthy. They never attain awakening but instead nitpick and slander the lofty ones—how could they ever grasp the method and technique?\n\nThey become objects of shared disdain among heaven and humanity, seeds of hell indeed—how pitiable! I earnestly advise the world: if you encounter a perfected being, never cling to your own views. Instead, approach with an empty mind, seek out a luminous teacher with diligence, and only then will you avoid self-deception.\n\n⊙This is the Governing Vessel. \"Governing\" means \"to unify\"—it unifies the qi channels of the entire body. It is precisely the primordial yang ancestral qi of the pre-cosmic state, before heaven and earth divided, before this body was born. It has endured through kalpas, unbroken from ancient times to the present.\n\n○This is the Conception Vessel. \"Conception\" means \"benevolence\"—it is the primordial qi of ceaseless generation. Pure and vast, perfectly round, radiant and crimson, exquisitely refined, luminous and resplendent, vibrant and alive—this is the thing that precedes the image of the Lord-on-High, the ancestor of all spirits. It embraces the ten thousand images and gives rise to the ten thousand things. Buddhists call it the *maṇi-jewel*; Daoists call it the *millet-like mysterious pearl*; physicians call it the *ever-bubbling elixir of true numinous medicine*—truly a secret untransmitted for ages.\n\nPeople today do not understand this principle, nor have they received its transmission, nor do they awaken to it—how could they know the wondrousness of the \"inner and outer\"? The Conception and Governing Vessels are indeed the mystery of the pre- and post-cosmic, yet the common folk use them daily without knowing it.\n\n⊙The Governing Vessel—this aperture is the source of the body’s birth. Before this body existed, this aperture was already present. It is no ordinary bodily orifice but the wondrous aperture of the subtle mechanism. This subtle movement is precisely the primordial yang qi that existed before father and mother conceived.\n\n○The Conception Vessel—this aperture governs the five viscera of the entire body, presiding over both inner and outer. If one knows how to invert and gather, it becomes the root from which the five viscera are born. Before the five viscera existed, this aperture was already present; before this body was born, this aperture was born first. This subtle movement is the method of nurturing life, the root and stem of preserving life without death.\n\nThese three true subtle movements—upper, middle, and lower—if received through proper transmission, can return one to the root and restore life. They cause the four qi to return to the lower origin, prevent the dispersal of hun and po, and achieve the harmony of water and fire—what illness could then arise? If this primordial yang is clearly transmitted, even if one encounters the net of the law and cannot escape, or cannot attain the Dao, one may, as a last resort, arouse the life-master at the sea-bottom—the root of the four qi—and return it to the undispersed primordial qi. With a single move, one may let go without obstruction. Apart from this subtle movement, one may also reemerge to study the Dao—this is the unfathomable mystery of gods and spirits.\n\nThis primordial qi, the millet-like mysterious pearl, if the true mind transmits it clearly and one practices it diligently, will suddenly bring great awakening. Then the scriptures of the Three Teachings will be clearly present before one, understood without need for reflection or thought.\n\nFrom a grand theoretical perspective, the entire body—inside and out, blood and qi—is all post-cosmic dregs of turbid yin. Only the single point of primordial yang in the secret place is pure yang. This true form belongs to the heart, and this heart is the heart of true emptiness—not the heart of blood and flesh.\n\nThis true heart is unknown to the multitude, yet within it lies another world of heaven and earth. I shall describe the three hearts—inner, outer, and central—below.\n\n**Outer Heart—Heavenly Heart**: ○This heart is the heart of true emptiness, called the *mysterious pass*, the aperture that communicates with heaven. It is precisely the true crucible and furnace of the inner and outer Five Agents. All methods of opening the pass, kindling the fire, pacing the stars, wielding the sword, and holding the seal—through which even gods and spirits cannot perceive the mechanism—depend entirely on this. One must know the proper method.\n\n**Central Heart—Human Heart**: ○This heart is the central aperture, the dwelling of the Yellow Dame. The gathering of inner and outer depends entirely on her. Setting up the furnace and establishing the crucible, refining the inner and outer medicines, distinguishing maturity from immaturity, truth from falsehood—all emerge from this heart.\n\n**Inner Heart—Earthly Heart**: ○This heart is the life-master at the sea-bottom, the stem of the ten thousand spirits. In cultivating the Great Vehicle, one must first cultivate the Lesser Vehicle: laying the foundation, refining the self, accumulating the wealth of the Dharma, and preserving the qi of mercury—all depend on this cavity. One must recognize hardness and softness.\n\nThese three hearts are the three subtle movements—inner, outer, and central—within the body. If one can invert heaven and earth, unlock the seamless lock, then a single phrase resolves the ancient Amitābha.\n\nThese three hearts are the secret untransmitted for ages. Apart from the heart of blood and flesh, there are three true hearts. These three hearts penetrate the true emptiness of the void. If one understands this true heart, then the ten thousand images of heaven and earth are contained within this empty heart. This empty heart embraces true yin and true yang, yet the subtle movement of true emptiness is the seamless lock—if it cannot be opened, where can one escape birth and death?\n\nThe immortals say:\n*\"The golden needle is easy to obtain,\nThe jade thread is hardest to thread.\nTo know the path of birth and death,\nIs like tossing a mustard seed into a needle’s eye.\"*\n\nThis is a metaphor for yin and yang. Yin and yang are life and destiny—who truly understands them? Yet if one awakens for three, five, seven, fourteen, or twenty-one days, and wishes to preserve life without death, one must seize water, fire, and wind, preventing their dispersal, and return the life-master of the other household to one’s own body. Do not stir the heart—this is the method of not dying.\n\nIf one is aged and cannot practice to attain the Dao, one must turn back. Like a melon that ripens and its stem falls, it all depends on these subtle movements. Once the timing is known, arouse the life-master at the sea-bottom and return it to the primordial nature of the upper void. Then hun and po will not disperse, and one may act freely without delusion.\n\n*Direct Pointers to Resolving Doubts on the Golden Elixir*\n\nThere are those of shallow roots and blind eyes who, upon hearing the immortals speak of outer yin-yang, outer crucibles, and outer medicines, cling to their delusions and take women as vessels—how pitiable! Such ignorant fools—how could they know that the Great Dao of purity encompasses the three bodies and four wisdoms, the inner and outer crucibles and furnaces, the inner and outer medicines, and the subtleties of inner and outer fire timings? How could they know that the ten thousand things are complete within me, and the creative transformations of heaven and earth are identical to my own greatness!\n\nIf a man of karmic affinity should encounter a true master, he must first practice the inner return of the Jade Liquid Elixir, refining the self to harmonize with radiance, holding fast to nurturing cultivation, and turning the light inward to reflect—this is the matter of illuminating the mind and seeing the nature. As for the Golden Liquid Return Elixir, it is the return of emotion to nature, reaching the state of true emptiness, where great function manifests before one. The Dragon Girl presents a single precious pearl, and only upon its revelation is there attainment that endures forever.\n\nAt the cusp of *hai* and *zi*, between the belly of *kun*, when the first yang stirs and work begins, one’s hand explores the Moon Grotto while the foot treads the Heavenly Root. The returning wind merges in harmony, and only then does the efficacy of a hundred days’ work manifest. The Golden Liquid Return Elixir is the great affair of completing the Five Phases.\n\nApart from this Way of dual cultivation of nature and life in purity, all else is but peripheral minor arts. Within my own body, inside and out, I have mastered the subtleties of setting up the furnace and establishing the crucible, the oral instructions for gathering the Five Phases, and the fine details of medicine and fire timing. Yet if one does not understand the measures of the void and rashly enters the chamber to perform the great work of ingesting the outer medicine and kindling the fire, when the practice reaches its secret point, the ten thousand spirits of the void will come to pay homage, and the immortal embryo will form at the crown. This matter is too profound for even ghosts and spirits to fathom. It is only because one has not refined the self amid the dust of the world, has not accumulated lead in the marketplace, the qi channels remain unsettled, and the foundation is not yet complete in three aspects. Though the principle is harmonized, the nature is not yet revealed. Thus, when the ten thousand spirits manifest, a hundred dangers arise: the heart and spirit grow distracted, unable to take command.\n\nMoreover, without knowing companions of the Way to guard and protect outside, one may be startled by sounds and sights, scattering the primordial yang, agitating the crucible and scorching the furnace. The Heart Ape grows restless, the Intent Horse flees, the spirit does not guard the abode, and the qi does not return to the origin—one falls prey to yin demons. What are yin demons? I shall not elaborate, but later learners will not understand. It is all because the true yang scatters and yin qi takes control, with ghosts and spirits in the body causing harm day and night. Whether eyes are open or closed, one hears only the clamor of ghosts and spirits. By day it is bearable, but by night it is most unbearable—one dare not settle into stillness even for a moment. The life-master at the Sea Bottom of the other household, the *dui*-metal’s *wu* earth, surges through the five viscera and hundred channels, blood and qi all rising upward, lifting the body so it does not touch the ground, bringing death and ruin—the livelihood of ghosts.\n\nI temporarily abandoned my previous efforts, following my master’s instructions to conceal myself in the marketplace, accumulating lead amid the dust of the world, drawing emotion back to nature, and returning the killing mechanism to the heart. From youth to old age, heaven, earth, and all beings have stolen my celestial authenticity. Now, within the dust and colors of the void, I must steal it back and return it to my celestial nature. Only then can the primordial essence, primordial qi, and primordial spirit be restored to wholeness. This depends entirely on extreme emptiness and profound stillness, whereby the myriad things flourish and each returns to its root. When the root returns, the principle harmonizes; when the principle harmonizes, the nature is revealed. Body and mind settle into great stillness, the Five Phases gather, and only then can one proceed to the upward work and complete the Dao.\n\nMany worthy sages of former times abandoned their practice midway, all because they had not refined the self and held the heart, had not drawn metal back to nature. Thus, when they obtained the medicine in the second period and proceeded to the fire in the fourth period, not understanding the measures of the void and acting carelessly, Master Bai sighed, “Again must the pine and bamboo be hewn.” Who knows the subtleties of the void—so fine, so perilous, so fierce? If one fails to seize it, it will surely not spare them.\n\nIf a learner can understand the two subtleties within and without the body, attaining clarity without obstruction, and from there hold fast to nurturing cultivation, overcoming selfishness and restoring celestial principle, then the work of the elixir without fixed timing becomes most simple and easy. One may spend all day tending the yellow blossoms outside the body, awaiting the jade nectar of prior and posterior heaven—this is precisely the wonder of “drinking wine, wearing flowers, and awakening to longevity.”\n\nYet in the matter of primordial merging, there must be no intent, no insistence, no rigidity, no self. Whether life or death, forget others and forget the self. All day in the bustling marketplace, one plays with scenes to gladden the heart, sitting blankly in brothels and taverns, speaking idly—how could this not arouse the shock, doubt, laughter, and slander of others? Drawing in the environment to accumulate lead, employing both method and wealth—how could this not invite the deception and harm of vulgar men?\n\nThus, one relies on powerful families in great cities for external protection, perceiving the Dao with a glance while concealing one’s light and hiding one’s tracks. As the immortals say, “If you covet the treasure of heaven, you must use the wealth of the world.” This is the great treasure of the Nine Yang Crucible within my body. All beings dwelling between heaven and earth, men and women alike, rely on this single point of yang essence to live without dying. How could it be that those who study immortality—men learning the Dao must use women, women learning the Dao must use men—corrupt the customs of the world? Such acts are known only to beasts and animals. Alas! With speech incomprehensible and delusion unshaken, how could they be kin to immortals and buddhas?\n\nIf a learner can truly hold fast to nurturing cultivation, not losing the square inch of the heart amid haste, peril, or displacement, and then seeks the matter of ingesting the outer medicine, in an instant they will become profoundly still. Shedding the womb and changing the crucible, the whole body transforms into a single beam of golden light. The great earth becomes empty, and outside the body appears another body. The yang spirit leaves the form, holding emptiness to nurture the void—this is the Great Hibernation of the Five Dragons.\n\nAs the immortals say, “Without inner elixir, outer elixir will not succeed.” These words are trustworthy. One who receives the true transmission must first accumulate essence and amass qi, gathering both inner and outer method and wealth. When qi is full and spirit complete, the golden light appears, shining day and night without cease. At this time, the inner elixir is complete, and the outer elixir’s symbolic manifestation appears.\n\nOne must not read books and seek the steed by following the picture. Only when the golden light shines day and night, and the medicine sprout arises, may one gather the outer medicine of the body and pair it with the inner yin and yang. Once the golden light enters the mouth and the fire of the celestial circuit ignites, in an instant one becomes profoundly still, letting go without hindrance—this is the Great Molting of the Golden Cicada.\n\nBefore encountering a true master, one must be humble and cautious, accumulating merit and cultivating conduct. When faced with demons, do not retreat; when slandered, do not grow angry. Value the Dao and disdain wealth. Upon meeting a perfected one, devote oneself wholeheartedly to seeking, resolutely breaking through the two true mysteries within and without the body. Suddenly, one aligns with the true locus of realization and speaks of it—this is what is meant by \"my body as heaven and earth.\"\n\nThough this true locus is said to stand without reliance on form, how could the aperture within the aperture be without form? Now, we borrow an analogy to clarify: consider a forked mouth—when its center is full, it opens; when empty, it slackens. The aperture’s ability to open and slacken is just like this.\n\nAt the outset, one must first concentrate the spirit, entering the aperture within the aperture. With each breath returning to the root, the center becomes full, and with the center full, the embryo grows. Yet the spirit is originally born within the aperture of apertures and lodges in the palace of the heart. I have often called it: \"what was originally my own, now returned to me.\"\n\nThe aperture within the aperture is the spirit-chamber. The spirit-chamber is the qi-cavern, the Central Yellow. Yellow is the true color of good earth, and earth is intent. Thus, the earth of Kan (☵) is *wu* (戊), whose intent ever tends toward Li (☲); the earth of Li is *ji* (己), whose intent ever tends toward Kan. Such is their nature and disposition, and thus they possess a natural affinity for union.\n\nIf one can recognize this moment of affinity and guide it with intent, spirit congeals and qi abides—naturally coalescing into a single grain of golden elixir. It is utterly simple and effortless, without forced contrivance. This is the mother’s qi subduing the child’s qi, as the qi of mother and child yearn for each other within the aperture of apertures. How could the elixir fail to form?\n\n**Two Songs of the Right Dao**\n\nI hold a single oral formula,\nYet sigh that none can hear it.\nI search the world in vain—\nTo no one may it be spoken!\n\nForward is the elixir, reverse is immortality:\nThis is the true oral formula.\nAll else is vain striving,\nMere contortion and pretense.\n\nMaster the *Awakening to Reality*,\nSeek a teacher with care.\nThen some small wonder arises,\nA mystery beyond spirit’s reckoning.\n\nThe marrow of heaven and earth, fused and warm,\nSipped with mindful timing.\nOne must seek the treasure beneath the earth,\nAnd discern the moon in the sky.\n\nObserve the floating and sinking to know ripeness,\nDistinguish the water’s source for purity.\nWhen the wild battle comes,\nLet neither ape nor horse grow restless.\n\nWhen the guest arrives, first act as host;\nWhen the host arrives, then act as guest.\nThe Yellow Dame mediates the Dark Maiden—\nTheir union forges the elixir.\n\nOutside, black as lacquer;\nWithin, white as snow.\nAt the center, radiant with yellow and purple,\nFlesh green, skin like blood.\n\nOnce the Five Heroes’ elixir is formed,\nThe Three Corpses and yin ghosts perish.\nThe one refined and luminous,\nNot the dull, deaf, mute, or clumsy.\n\nMind without thought,\nMouth without speech.\nEmploy the civil, then the martial,\nGather in accord with the season.\n\nKeep the golden crucible ever warm,\nThe jade furnace never too hot.\nIn an instant, the union is complete—\nThen nurture it for ten months.\n\nA man may give birth,\nBearing a guest of the Three Isles.\nSwallowing a single living grain,\nHeavenly immortals come to welcome him.\n\nWhen nine years of merit are fulfilled,\nHe strides steadily toward the Golden Gate.\n\nAgain:\n\nThis Dao-affection is no common feeling.\nOnce the mystery is known, it must not be taken lightly.\n\nFirst lay down all worldly attachments,\nThen delve into the wondrous principles to clarify them yourself.\nBefore refining the Returned Elixir, first refine your nature;\nBefore cultivating the Great Medicine, first cultivate your mind.\nWhen the mind is settled, the Elixir’s nature naturally arrives;\nWhen the nature is purified, then the medicinal ingredients arise.\nThunder rumbles faintly, shaking the empty void,\nYellow Court and purple mists veil a thousand fathoms deep.\nShould you reach this point, do not be startled or afraid—\nOnly guard the Gate of the Grotto with your original spirit.\nGuard the Grotto Gate as a cat, mouse, or hare meets an eagle.\nThough myriad visions appear, none are true—\nOnly a single crimson light is the utmost reality.\nThis crimson light gives birth to strange phenomena,\nWithin it, like dust in a sunlit window.\nIt contains a single point of primordial qi,\nDistant as a grape, near as gold.\nSeize it with utmost care—\nThe slightest stray thought forfeits celestial truth.\nWait until the first yang returns to the Grotto Palace,\nTransforming the body into the four seasons of spring.\nA patch of white cloud drifts by,\nEach rain’s passing brings renewal.\nAll day long, serene as a drunken man,\nLeisurely guarding the grotto’s eternal spring.\nWhen all yin essence is stripped away,\nIt transmutes into a mass of pure yang gold.\nAt this moment, breath ceases as in a minor death,\nForged into one whole—the perfected true self.\nHere the work is complete,\nYet return to the mundane world to accumulate merit.\nWhen merit is fulfilled and conduct perfected, Heaven’s decree arrives,\nThe yang spirit emerges, revealing true numen.\nThese words must not be spoken to the unworthy—\nReckless disclosure invites celestial thunder’s wrath.\nI charge my immortal companions and Daoist peers:\nDo not lightly discuss this with those who do not comprehend.\nEach line here conveys profound mystery—\nBeyond this truth, no truth remains.\nGather these brocade verses, seal them tightly,\nThat one day they may verify your practice.\nVerify your practice—\nFifty-two lines for you to heed.\nShould any falsehood be spoken, you’ll meet violent death,\nYour spirit officer lashed to pieces.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玄谭全集 张三丰曰：夫道，中而已矣。 故儒曰致中，道曰守中，释曰空中。 而内丹之所谓中，窍中之窍也。 窍中之窍，乃真中也。 余独溉夫世人之不识中也，或求之九宫之中，曰泥丸，而不得也； 或求之脐下一寸三分，曰丹田，而不得也； 或求之心脐相去八寸四分，而以中一寸二分为中，与夫两肾之间，前对脐轮，而不得也。 夫以有形求之，而皆不能得也； 乃复逆而度之，则关曰玄关，牝曰玄化，岂虚无之谷，而不可以有形求欤？ 夫以无形求之，而又不能得也； 乃复逆而度之，则曰无而不着于无，有而不着于有，岂非有非无，而不着于有无间欤？ 智过颜、闵、真难强猜。 予今冒禁言之，非得已也。",
      "translated_text": "The *Complete Mystical Discourses* – Zhang Sanfeng states:\n\nThe Dao consists in nothing more than the Center. Thus the Confucians speak of \"attaining the Center,\" the Daoists of \"guarding the Center,\" and the Buddhists of \"emptiness within the Center.\" Yet the Center of which Internal Alchemy speaks is the aperture within the aperture—the true Center.\n\nI alone lament that people fail to recognize the Center. Some seek it amid the nine palaces, calling it the \"Mud Pill,\" yet do not find it. Others seek it an inch and three-tenths below the navel, calling it the \"Cinnabar Field,\" yet do not find it. Still others measure the span of eight inches and four-tenths between heart and navel, taking the midpoint of one inch and two-tenths as the Center, or search between the two kidneys, directly opposite the navel wheel—yet do not find it.\n\nSeeking it through form, none can attain it. Then, reversing their approach, they name the barrier the \"Mysterious Pass\" and the feminine the \"Mysterious Transformation\"—is this not the valley of the formless, which cannot be sought through form?\n\nSeeking it through the formless, they still cannot attain it. Reversing their approach once more, they say: \"Neither clinging to nonbeing nor to being, is it not that which is neither being nor nonbeing, and thus clings to neither the realm of being nor nonbeing?\"\n\nWisdom surpassing that of Yan [Hui] or Min [Sun] would struggle to fathom this. Now I transgress the prohibition and speak of it—not by choice, but of necessity.",
      "overlap_context": "",
      "start_char": 1,
      "end_char": 271,
      "start_sentence": 0,
      "end_sentence": 13,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.121466159820557,
      "metadata": {
        "source_file": "dao\\藏外\\玄谭全集.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "盖以神仙降生于此时者众，以救世也。 或官矣。 或士矣，家工商贾矣，道矣，释矣，故作此篇，以呈徕之，俾知救世，复返天上，而不堕落于尘寰者，此余之心也。 外景也者，外其身而虚空之，先了性也。 张三丰曰：释氏了性，须要持斋，故太虚是我，先空其身。 其身既空，天地亦空，天地既空，太空亦空，空无所空，乃是真空。 又曰：无无乃出天地，外虚空以体无无。 内景也者，内其身而胎息之，先了道家内景图命也。 张三丰曰：胎因息长，息因胎住，而窍中之窍，乃神仙长胎住息之真去处也。 天地虽大，亦一胎也，而日月之往来，斗柄之旋转者，真息也。 又不观三氏之书乎，《易经》曰：“成性存存，道义之门。 ”《道德经》曰：“玄之又玄，众妙之门。 ”《遗教经》曰：“制之一处，无事不办。 ”皆直指也。 我之看书无滞，才知圣凡一，不为盲人迷惑。 扫尽旁门，重整心猿，重发志气，低心下意，历魔历难，苦求明师，穷取受之初。 初者，先天始祖祖。 此含着一点真阴真阳，产于天地之先，混元之始。 这个灵明黍米宝珠，悬在至空至正之中，明明洒洒，但有未明旨的人，若醉相似，离此一着一着都是旁门。 这个灵明宝珠，于空悬之中，包含万象，发生万物，都是此⊙者。 此物在道喻为真铅真汞，一得永得，不可执乾坤、日月、男女相上去，只于己身内外安炉立鼎。 炼已持心，明理见性之时，攒簇发火，不出乎一个时辰，立得一黍玄珠，现于曲江之上。 刀宅入口，顷刻之间，一窍开百窍齐开，火发四肢，浑身筋骨血肉都化成，与外水银相似。 到此时候，用百日火力，方有灵妙，一得永得，勿有还返，住世留形，炼神还虚，与道为一矣。 ○此物在释曰真空真如觉性，若知下手端的，炼魔见性，片晌功夫，发起三昧真火，返本还元，一体同观，天地咸空，霞光万道，五眼六通，炼成金刚不坏之身，了鬼神窥不破之机。 ○此物在儒是无极而太极，依外天地而论，无极是天地周图，日月未判之前，四维上下不辨，一混混沌沌，如阴雾水，及气至时到，气满相激。 才生太极。 太极是日月，只要体法天地日月，不是要采天地之日月也。 日月既生，天地自分。 清气在上为天，虚无一派神祗，都是清精明之光曜也； 浊气在下，大地山河人民，俱在地下，五谷一切万物，虽在地发生； 都借天气方得有生。 天之清气为纯阳，地之浊气为纯阴，而露从天降，是阳能生阴，万物从地生，是阴能生阳。 天地是个虚无包藏，无穷尽，无边际。 天之星宿神祗，其动转各有方位，地下万物，按四时八节，发生总自虚无。 夫日月是天之精，上照三十三天，下照九泉黄极，东西运转，上下升降，寒暑往来。 日是纯阳之体，内含一点真阴之精，属青龙、姹女、甲木、水银、金乌、三魂，即是外彼； 月是纯阴之体，内含一点真阳之，属白虎、婴儿、庚金、朱砂、玉兔、七魄，即是内我。 人身造化同天地，故人身亦有真日月，道本在迩，而人反求诸远也。 三魂属性，性在天边； 七魄属命，命在海底。 内外通来“性命”两个字，了却万卷书。 性属神是阴； 命属是阳，故曰“一阴一阳之谓道”也。 那个真阴与真阳相对，这个真阴之精既不知，又乌知达‘一点真阳之乎？",
      "translated_text": "For in this era, many immortals descend to be born among men, to save the world. Some take office, some become scholars, some engage in trade or commerce, some follow the Dao, some embrace Buddhism. Thus, I compose this text to present to them, that they may know how to save the world, return to the heavens above, and not fall into the dusty realm—this is my heart’s intent.\n\nThe *Outer Landscape* refers to externalizing the body and making it empty and void, first completing the cultivation of *xing* (nature). Zhang Sanfeng said: \"The Buddhists complete *xing* but must maintain vegetarian discipline; thus, the Great Void is myself—first empty the body. Once the body is empty, heaven and earth are also empty; once heaven and earth are empty, the Great Void is also empty. When emptiness is emptied of itself, this is true emptiness.\" He also said: \"Nonbeing itself gives rise to heaven and earth; externally, the void is embodied in nonbeing.\"\n\nThe *Inner Landscape* refers to internalizing the body and practicing fetal breathing, first completing the Daoist *Inner Landscape* cultivation of *ming* (life). Zhang Sanfeng said: \"The embryo grows through breath, and breath abides through the embryo. Within the aperture is the aperture—this is the true place where immortals abide in breath and the embryo dwells.\" Though heaven and earth are vast, they are but one embryo, and the revolutions of the sun and moon, the turning of the Dipper’s handle—these are the true breath. Have you not observed the texts of the Three Teachings? The *Book of Changes* says: *\"To preserve and sustain one’s nature is the gateway to the Dao and its power.\"* The *Dao De Jing* says: *\"Mysterious and again mysterious—this is the gateway to all wonders.\"* The *Sutra of Bequeathed Teachings* says: *\"Restrain it to one place, and nothing will remain undone.\"* All these are direct pointers.\n\nWhen I read without obstruction, I know that the sage and the ordinary are one, and I am no longer deluded by blind men. Sweeping away all side doors, I reorder the mind’s monkey, rekindle my resolve, humble my heart and lower my intent, endure trials and tribulations, seek a true teacher with suffering, and exhaustively pursue the origin of reception. This origin is the primordial ancestor of precelestial existence. It contains a speck of true yin and true yang, born before heaven and earth, at the inception of primordial chaos. This luminous pearl, like a grain of millet, hangs in the midst of perfect emptiness and correctness, radiant and unbounded. Yet those who have not awakened to its meaning are like drunks—every step they take, every move they make, leads to side doors.\n\nThis luminous pearl, suspended in emptiness, encompasses all phenomena and gives rise to all things—all are this ⊙. In Daoism, it is called true lead and true mercury. Once attained, it is attained forever. Do not cling to the images of qian and kun, the sun and moon, or male and female. Instead, within one’s own body, set up the furnace and establish the tripod. Refine the self and uphold the heart; when principle is understood and nature is seen, gather the fire and ignite it. Within a single double-hour, a grain of the mysterious pearl appears above the winding river. The moment it enters the mouth of the knife-house, in an instant, one aperture opens and a hundred apertures open with it. Fire spreads through the four limbs, and the entire body—sinews, bones, blood, and flesh—transforms, becoming like external mercury.\n\nAt this stage, a hundred days of firing are required to achieve numinous subtlety. Once attained, it is attained forever, with no regression. Abiding in the world while preserving form, refining spirit to return to the void, one becomes one with the Dao.\n\n○ In Buddhism, this is called true emptiness and true suchness, the awakened nature. If one knows the proper starting point, refining demons and seeing nature, in a moment’s effort, the true fire of samadhi arises, returning to the root and restoring the origin. All is perceived as one, heaven and earth are both empty, and a myriad of rosy clouds radiate. The five eyes and six penetrations are achieved, and the indestructible vajra body is forged, completing the mechanism that even ghosts and spirits cannot fathom.\n\n○ In Confucianism, this is the Supreme Ultimate born of the Ultimateless. Considering the external heaven and earth, the Ultimateless is the encompassing boundary of heaven and earth, before the division of the sun and moon, when the four directions and above and below were indistinguishable—a single chaotic mass, like yin mist or water. When the time came and qi was full, it surged and gave rise to the Supreme Ultimate. The Supreme Ultimate is the sun and moon. One must model oneself after heaven and earth, the sun and moon—not seek to gather the sun and moon of heaven and earth. Once the sun and moon are born, heaven and earth separate. The clear qi rises to become heaven, a vast emptiness filled with spirits—all are the radiant light of pure essence. The turbid qi descends to become earth, with mountains, rivers, and people all below. The five grains and all myriad things, though born on earth, all rely on the qi of heaven to come into being.\n\nHeaven’s clear qi is pure yang; earth’s turbid qi is pure yin. Dew descends from heaven—this is yang’s ability to generate yin. The myriad things arise from earth—this is yin’s ability to generate yang. Heaven and earth are a vast emptiness, boundless and infinite. The stars and spirits of heaven move and turn, each in its proper place; the myriad things on earth follow the four seasons and eight solar terms, all arising from emptiness. The sun and moon are the essence of heaven, illuminating the thirty-three heavens above and the nine springs of the Yellow Springs below. They revolve east and west, rise and descend, and the alternation of cold and heat proceeds. The sun is the body of pure yang, containing within it a speck of true yin essence. It pertains to the Green Dragon, the Maiden, jia wood, mercury, the Golden Crow, and the three *hun*—this is the external other. The moon is the body of pure yin, containing within it a speck of true yang. It pertains to the White Tiger, the Infant, geng metal, cinnabar, the Jade Hare, and the seven *po*—this is the internal self.\n\nThe creation of the human body mirrors that of heaven and earth. Thus, the human body also possesses a true sun and moon. The Dao is near at hand, yet people seek it afar. The three *hun* belong to *xing* (nature), and nature resides at the edge of heaven. The seven *po* belong to *ming* (life), and life resides at the bottom of the sea. The internal and external communicate—these two words, *xing* and *ming*, resolve the meaning of ten thousand volumes. *Xing* belongs to spirit and is yin; *ming* belongs to qi and is yang. Thus it is said: *\"One yin and one yang—this is the Dao.\"* If one does not know that speck of true yin, how can one ever know and reach that speck of true yang?",
      "overlap_context": "is not the valley of the formless, which cannot be sought through form?\n\nSeeking it through the formless, they still cannot attain it. Reversing their approach once more, they say: \"Neither clinging to nonbeing nor to being, is it not that which is neither being nor nonbeing, and thus clings to neither the realm of being nor nonbeing?\"\n\nWisdom surpassing that of Yan [Hui] or Min [Sun] would struggle to fathom this. Now I transgress the prohibition and speak of it—not by choice, but of necessity.",
      "start_char": 271,
      "end_char": 1509,
      "start_sentence": 14,
      "end_sentence": 58,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.27500033378601,
      "metadata": {
        "source_file": "dao\\藏外\\玄谭全集.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "今之学者，不惟不知真阳，亦且不知真阴，若知真阴，则真阳亦自知之矣。 不遇真师，枉用猜疑，是道在天地，天地亦不知也。 学者穷究身中天、地、人三才之妙窍，一身内外阴阳真消息，如不得旨，一见诸书之异名，必无定见，执诸旁门，无能辨理； 既不能穷理，则心不明，心既不明，则性天不能如朗月； 既不能见性，焉能知命？ 噫！ 只为丹经无口诀，教君何处结灵胎。 外，先天真阳。 此⊙图是一身内外之造化，名通天窍，炼丹炉，躲生死路，生身处，父母未生前，五行不到处。 一点真阳，明明在四大形山秘密处，此个消息，玄之又玄。 此个灵明宝珠在人身，与外天地日月同体，是一身之祖。 “今日说破真父母，明朝不怕死和生”，即太上慈悲所言，《黄庭经》外景之旨也。 中，身中。 ○此图是产天地之造化，剑铸雌雄，药看老嫩，全在此中，安天立地，不离此中。 万劫因缘要正传，是天下降不到地，地上升不到天，空里常悬，理最难明，故曰“中间一窍少人知，须要明师亲口传”。 然乾坤交姤亦在此也，坎离交垢亦在此也。 内，海底命主。 ○此一图是海底金精之灵龟，吾身彼家之兑金，戊土之命主。 浑身百脉，五脏六腑，全凭此物执掌，且成仙成佛，超生出死，亦凭此穴安排。 实是个固命之地，养命之方，却诸病不生，为万之根蒂，乃一身中之太极，即太上慈悲所言，《黄庭》内景之旨也。 天、地、人三才，实在自己一身而言。 以后天论之，则于身中有象有方； 若以先天究之，则生天、生地、生入、生物，无象无方之物也。 仙云：“先天不得后天，无以招摄； 后天不得先天，无以变化。 ”此是天、地、入在己身内外，上、中、下三个真消息，三个真炉鼎，又属三教，三乘妙法，体外天、地、人三才，廓外三教经书。 此个五行中人之五行，皆在性命中，岂求之他人哉！ 《悟真篇》云：“三五一都三个字，古今明者实然稀。 ”仆说的不是大言，且不论火候攒簇细微，只说三个五行，百万人中无一知者。 若知三才相盗，返此之本，还此之元，传精送神，偷精换气，颠倒采取，若人敢承当，要作仙佛也不难。 凡学修炼者，先穷取一身内外真炉鼎； 若不识内外真炉鼎，则无处下手既知安炉立鼎之在内外，及阴阳往来之旨，便穷取药材，则炉鼎中煅炼何物？ 外，真铅真汞。 ⊙此个窍，己身内外真炉鼎。 安九阳之鼎，铸慧剑以定时候，开关采药，朱里回汞，攒簇冰浴，水火既济，持空养虚，只在此窍，含着一点真朱砂水银，明明在身不内不外之地，万人不识。 离此一着，都是盲修瞎炼。 此就是己身外五行，外炉鼎，外造化，即轩辕所铸九阳之鼎是也。 中，坤土釜。 ○此个窍，正是攒簇结胎，生天地人物，及风云雷雨，都在此中宫正位。 此是神室宝鼎，产内外二药，铸雌雄二剑，抽铅添汞，候取点化丹药，故曰“中间一窍少人知”。 内，脐下命主。 ○此个窍，乃兴功之根本，成道之梯航。 安炉立鼎在内，水火锻炼，法财俱足，神气完全，上七窍生光，才是真正时候，方可采吾身外炉鼎之药，以配身中之雌雄。 又全凭此穴； 调神纯熟，万神受使，星回斗转，方可夺外天机也。 夫上一窍乃纯阳之体，内含一点真朋之精，是我身彼家之物，属外在内，即两肾中间一点明，发之于外，故喻他也；",
      "translated_text": "Scholars of today not only fail to recognize true yang but also remain ignorant of true yin. Yet if one knows true yin, true yang is naturally known as well. Without encountering a true teacher, all efforts are spent in vain conjecture—though the Dao exists within heaven and earth, even heaven and earth do not comprehend it.\n\nScholars exhaustively investigate the wondrous apertures of the three talents—heaven, earth, and humanity—within the body, as well as the true workings of yin and yang within and without. If the essential meaning eludes them, upon seeing the varied names in texts, they lack firm understanding, cling to side paths, and cannot discern the principle. Unable to fathom the principle, the heart remains unilluminated; with the heart unilluminated, the celestial nature cannot shine like the bright moon. If one cannot see nature, how can one know life?\n\nAlas! The alchemical classics lack oral transmission—where then can one conceive the spiritual embryo?\n\n**Outer: The Precelestial True Yang**\nThis ⊙ diagram represents the creative workings within and without the body, called the *Tongtian Aperture*, the alchemical furnace, the path that evades life and death, the place of birth, the state before father and mother, where the five phases do not reach. That speck of true yang lies hidden in the secret place amid the four great form-mountains—this message is profoundly mysterious. This luminous pearl of spirit within the body shares the same essence as the external heaven and earth, sun and moon; it is the ancestor of the entire body. *\"Today the true parents are revealed—tomorrow, one need not fear death or life.\"* This is the compassionate teaching of the Most High, the essence of the *Huangting Jing*’s *Outer Landscape*.\n\n**Middle: Within the Body**\nThis ○ diagram is the creative source of heaven and earth, where the sword is forged as male and female, where the medicine is discerned as old or young. All things depend on this center—here heaven is established, earth is set firm. The karmic causes of ten thousand kalpas require correct transmission, for this is where heaven cannot descend to earth, nor earth ascend to heaven, eternally suspended in emptiness, its principle most difficult to clarify. Thus it is said: *\"The central aperture is known by few—it must be transmitted directly by a clear teacher.\"* Yet the union of Qian and Kun, the intercourse of Kan and Li—all occur here.\n\n**Inner: The Life-Master of the Sea-Bottom**\nThis ○ diagram is the numinous tortoise of golden essence at the sea-bottom, the *dui* metal of the other household within our body, the life-master of *wu* earth. The hundred vessels, the five viscera and six bowels—all depend on this entity for governance. Whether attaining immortality or buddhahood, transcending life and death—all rely on this cavity for arrangement. It is truly the place that secures life, the method that nurtures it, where no illness arises. It is the root and stem of all things, the Supreme Ultimate within the body—the compassionate teaching of the Most High, the essence of the *Huangting Jing*’s *Inner Landscape*.\n\nThe three talents—heaven, earth, and humanity—are truly spoken of within one’s own body. Viewed from the postcelestial, the body contains images and directions; but when investigated from the precelestial, it is the formless, directionless thing that gives birth to heaven, earth, humanity, and the ten thousand beings.\n\nThe immortals say: *\"Without the postcelestial, the precelestial has nothing to gather; without the precelestial, the postcelestial has nothing to transform.\"* These are the three true workings—upper, middle, and lower—of heaven, earth, and humanity within and without the body, the three true furnaces and tripods, belonging to the three teachings and the three vehicles of wondrous dharma. They embody the three talents—heaven, earth, and humanity—beyond form, and encompass the scriptures of the three teachings. This five-phase person within the five phases exists entirely within nature and life—how could one seek it elsewhere?\n\nThe *Wuzhen Pian* states: *\"Three, five, and one—these three words; from ancient times to now, those who truly understand are rare.\"* What I speak is no empty boast. Even setting aside the subtle intricacies of fire-times and gathering, merely the three five phases are known by not one in a million. If one understands the mutual \"theft\" of the three talents, returning to this root and restoring this origin, transmitting essence and sending spirit, stealing essence and exchanging qi, inverting and gathering—if one dares to undertake this, attaining immortality or buddhahood is not difficult.\n\nAll who study cultivation must first thoroughly investigate the true furnaces and tripods within and without the body. Without recognizing the true furnaces and tripods inside and out, there is no place to begin. Once one knows that the establishment of the furnace and tripod lies within and without, as well as the principle of yin and yang’s coming and going, then one investigates the medicinal materials—what is to be refined in the furnace and tripod?\n\n**Outer: True Lead and True Mercury**\nThis ⊙ aperture is the true furnace and tripod within and without the body. Here the nine-yang tripod is established, the wisdom-sword is forged to determine the timing, the pass is opened to gather the medicine, mercury returns within cinnabar, fire and water achieve balance through gathering and bathing. All occurs within this aperture, which contains a speck of true cinnabar mercury, clearly present in the neither-internal-nor-external place within the body—yet unknown to ten thousand people. Depart from this, and all is blind practice and aimless refinement. This is the external five phases of one’s own body, the external furnace and tripod, the external creative workings—precisely the nine-yang tripod cast by the Yellow Emperor.\n\n**Middle: The Cauldron of Kun Earth**\nThis ○ aperture is precisely where the embryo is gathered and congealed, where heaven, earth, and the ten thousand beings are born, where wind, clouds, thunder, and rain arise—all within the central palace’s true position. This is the divine chamber, the precious tripod that produces the inner and outer medicines, forges the male and female swords, withdraws lead and adds mercury, awaits the moment to transmute the elixir. Thus it is said: *\"The central aperture is known by few.\"*\n\n**Inner: The Life-Master Below the Navel**\nThis ○ aperture is the root of initiating work, the bridge to attaining the Dao. Here the furnace is established and the tripod set within, water and fire refine, method and resources are complete, spirit and qi are whole. Only when the upper seven apertures radiate light is the true moment at hand—then one may gather the medicine from the external furnace and tripod of the body to pair with the male and female within. All depends on this cavity. When the regulation of spirit is perfected, the ten thousand spirits obey, the stars revolve and the Dipper turns—only then can one seize the celestial mechanism beyond.\n\nThe upper aperture is the body of pure yang, containing within it a speck of true lead’s essence—this is the other household’s substance within our body, externally within the internal. It is the speck of light between the two kidneys, manifested externally, hence the metaphor.",
      "overlap_context": "long to *xing* (nature), and nature resides at the edge of heaven. The seven *po* belong to *ming* (life), and life resides at the bottom of the sea. The internal and external communicate—these two words, *xing* and *ming*, resolve the meaning of ten thousand volumes. *Xing* belongs to spirit and is yin; *ming* belongs to qi and is yang. Thus it is said: *\"One yin and one yang—this is the Dao.\"* If one does not know that speck of true yin, how can one ever know and reach that speck of true yang?",
      "start_char": 1509,
      "end_char": 2774,
      "start_sentence": 59,
      "end_sentence": 104,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.20914626121521,
      "metadata": {
        "source_file": "dao\\藏外\\玄谭全集.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "下一窍乃纯阴之体，内藏着一点真阳之气，是吾身我家之物，属内，即乾宫泄入坤位之物，故喻我也。 上窍内是女体，外是男子； 下窍内是男体，外是女身：故仙翁多以男女彼我喻也。 然中间一窍为中宫，黄婆媒舍，若会此处颠倒配合，方可成圣。 夫命宝从己身之外来，还是自己坤位之物，却在吾法身中、色身内之他家也，故仙云“采取不离自己元神”是也。 世之学者，不得正传，无处下手，执己又不是，离已也不是。 谁知一点元阳，明明洒洒，在己身玄中高处，隐藏于不内不外之密处，内外一气牵连，千古不传之秘。 然人身现成放着两个真消息，与外天地日月同体，不差毫发，是天地乃万物之最大者，人为万物中之最灵者。 天地不过是个大人，人不过是个小天地，所以人造化同天地也。 认能省悟人人有个通天窍？ 人人有一味长生不死药？ 人人有个炼丹炉？ 人人有个上天梯？ 人人有个人不识，人人不信有长生不死方，人人不信有白日升天路，情愿受死，哀哉痛哉！ 凡炼大还丹，先要补虚，只补得骨髓盈满，方可炼金液大还丹。 夫下手功夫，先采上窍阳里真阴，入内金鼎气海之中，与肾经配合，夫阳里真阴，即是自己元神真形，在外属三魂； 下窍阴里真阳，即是身中元炁，属七魄。 其先后二炁一会，则坎离自交，魂魄混合，神凝气结，胎息自定； 每日如夫妇交情，美快无比，切不可着意，水火既济，发运四肢，如外火活焰相似； 只要水火均平，此是小周天火候。 调和嚣蒸，喉中真息倒回元海，则下肾自入内，真火自然冲入四肢，浑身软美快无穷，腹内如活龙回转升降，有数十样变化，婴儿姹女自然交合，此是采阳补阴，筑基炼己一节事。 夫修炼金液大还丹，广积内外法财，终日遗遥，昼夜常明，则长生久视之道也。 世人全赖五谷养命，若数日不食，则气脱而死也。 若人老，则下元虚损，骨髓俱空，不能胜五谷之气，是五谷能养人亦能杀人。 若会内水火既济，气血逆流，则五脏气和，脾胃开畅，食入腹中，亦能化气，生精生神。 果得天机下手功夫，直候骨髓盈满，腹脐如满胎妇人一般，却不是果有胎块之形象也，不过气满、精满、神满而已。 如果三全，则真火煅炼，调神炼气，大丈夫自有功成名遂之时也。 仆今奉劝世人，参访苦求功夫，决破一身内外天机，下手速修，炼己待时，时候一至，择地入室，炼此龙虎大丹。 必要僻静鸡犬不闻之处，外边只要知音道侣，不许一个闲杂人来到，恐防惊神。 仙言和光同尘，仆言僻静处，何也？ 益炼己于尘俗，养气于山林也。 金液还丹乃超凡入圣之道，非他事之可比，必须一尘不染，万虑俱忘，一刀两段，丝毫无挂，永作他乡之客，终无退悔之心，血充盈，筋骨柔和，身无皱纹，如蜘蛛相似，上七窍生光，昼夜长明，心如太虚，才正是时候，方可求仙。 又专心致志，演神纯熟，成形受使，星回斗转，随意所变，直到这个时候，才是气满神全，法财广大，方可炼大丹，方作得一个丹客也。 功夫既行，七窍生光，三阳开泰，神剑成形，趁水推船，因风发火，一阳内生，方可夺外天机，下手开关，采吾身外金丹，以龙嫁虎而作夫妇也。 若会攒簇，湛然摄起海底之金，即后开夹脊，通泥丸，落入水晶宫内，与木汞配合，不过半个时辰，攒簇已定，真火冲入四肢，浑身骨肉火烧刀割相似，最难禁受，就是十分好汉，到此无分主张，须要防危虑险，冰浴身心，水火既济，顷刻浑身如炒豆子一般相似，百窍一齐爆开，浑身气血都会成形、都会说话，就在身上吵成一堆。",
      "translated_text": "The lower aperture is the body of pure yin, containing within it a speck of true yang’s qi—this is the substance of our own household within the body, belonging to the internal. It is the essence that flows from the Qian palace into the Kun position, hence the metaphor of the self. The upper aperture is female within and male without; the lower aperture is male within and female without—thus the immortals often use the metaphors of male and female, self and other.\n\nBetween them lies the central aperture, the Yellow Dame’s matchmaking chamber. Only when inversion and union occur here can sagehood be attained. The treasure of life comes from beyond one’s own body, yet it is still the substance of one’s own Kun position—existing within the dharma-body and the physical form of the other household. Thus the immortals say, “Gathering does not depart from one’s original spirit.”\n\nScholars of the world, lacking proper transmission, know not where to begin—clinging to the self is wrong, yet departing from it is also wrong. Who realizes that the speck of original yang, bright and clear, resides in the lofty depths of one’s own mystery, concealed in the secret place neither inside nor out? Within and without, a single qi connects them, an esoteric secret untransmitted for ages.\n\nYet the human body already possesses two true mechanisms, identical to the sun and moon of the external heavens, not differing by a hair. Heaven and earth are the greatest of all things, while humans are the most spiritually endowed among the ten thousand beings. Heaven and earth are but a great person, and a person is but a small heaven and earth—thus human transformation mirrors that of heaven and earth.\n\nWho awakens to the fact that each person has a celestial aperture? That each person possesses an elixir of immortality? That each person has a furnace for refining the pill? That each person has a ladder to ascend to heaven? That each person has something they do not recognize? That each person disbelieves in the formula for immortality? That each person disbelieves in the path to ascension in broad daylight? Choosing instead to accept death—how lamentable, how grievous!\n\nIn refining the Great Return Elixir, one must first replenish deficiency. Only when the marrow is full can one refine the Golden Liquid Great Return Elixir. The initial work begins by gathering the true yin within the upper aperture’s yang and introducing it into the inner golden tripod of the qi sea, where it unites with the kidney meridian. The true yin within yang is one’s own original spirit in its true form, externally corresponding to the three hun; the true yang within yin is the original qi of the body, corresponding to the seven po. When these two qi meet in sequence, Kan and Li naturally merge, hun and po blend, spirit congeals and qi coalesces, and fetal breathing stabilizes. Daily, like the intimacy of husband and wife, the joy is boundless—yet one must not fixate. When water and fire are balanced, they circulate through the four limbs like an active external flame. Maintaining equilibrium between water and fire is the fire-timing of the Small Celestial Cycle.\n\nHarmonizing and steaming, the true breath in the throat reverses back to the original sea, and the lower kidney naturally enters within. True fire spontaneously surges into the four limbs, the entire body softens with indescribable comfort, and within the abdomen, a living dragon ascends and descends with dozens of transformations. The infant and the maiden naturally unite—this is the stage of gathering yang to replenish yin, the work of laying the foundation and refining the self.\n\nIn refining the Golden Liquid Great Return Elixir, one must amass both internal and external method and resources, abiding in carefree ease day and night, perpetually luminous—this is the Way of longevity and enduring vision. Ordinary people rely entirely on the five grains for sustenance; if they go several days without eating, their qi dissipates and they die. When a person ages, the lower origin becomes deficient, the marrow empty, and they can no longer endure the qi of the five grains—thus the five grains both nourish and kill. If one masters the balance of internal water and fire, with qi and blood flowing in reverse, the five viscera harmonize, the spleen and stomach open, and food entering the abdomen transforms into qi, generating essence and spirit.\n\nOnce the celestial mechanism is grasped and the initial work begins, one must wait until the marrow is full, the abdomen and navel swollen like a pregnant woman—though this is not the form of a physical mass, but rather qi, essence, and spirit all full. When these three are complete, true fire refines, spirit and qi are cultivated, and the great man naturally attains the moment of accomplishment and fulfillment.\n\nI now urge the people of the world: seek diligently, inquire earnestly, and decisively unravel the celestial mechanisms within and without the body. Begin the work swiftly, refine the self, and await the moment. When the time arrives, choose a secluded place and enter the chamber to refine this Dragon-Tiger Great Elixir. It must be a quiet location where no roosters or dogs can be heard. Externally, only fellow adepts of the Dao should be present—no idle or unrelated persons may approach, lest the spirit be startled.\n\nThe immortals speak of harmonizing with the world, yet I speak of seclusion—why? To refine the self amidst the mundane and nurture qi in the mountains and forests. The Golden Liquid Return Elixir is the Way of transcending the ordinary and entering sagehood, incomparable to other pursuits. One must be unstained by a single speck of dust, free from all concerns, severed from all attachments like a blade cutting through silk, forever a stranger in a foreign land, with no thought of retreat or regret. The blood fills, the sinews and bones soften, the body becomes wrinkle-free like a spider’s form, the upper seven apertures radiate light day and night, the heart like the great void—only then is the true moment at hand, and one may seek immortality.\n\nFocus the mind single-pointedly, cultivate the spirit to perfection, and when it takes form and obeys command, the stars revolve and the Dipper turns, transforming at will. Only at this time, when qi is full and spirit complete, with abundant method and resources, can one refine the Great Elixir and become a true alchemist.\n\nOnce the work is underway, the seven apertures radiate light, the Three Yangs flourish, the spirit-sword takes form. Seizing the current to push the boat, fanning the wind to ignite the fire, when the first yang arises within, one may seize the celestial mechanism beyond, begin the work of opening the passes, and gather the Golden Elixir from beyond the body—marrying the Dragon to the Tiger as husband and wife. If one masters the gathering, the gold from the sea bottom is calmly drawn up, then the spine is opened, the Mud Pill Palace is connected, and it descends into the Crystal Palace to unite with Wood Mercury. In less than half a double-hour, the gathering is complete, true fire surges into the four limbs, and the entire body’s flesh and bones feel as if burned by fire and cut by a knife—this is the most difficult to endure. Even the bravest hero loses all composure at this point. One must guard against danger, bathe the body and mind in ice, balance water and fire, and in an instant, the entire body feels like popping beans, with all pores bursting open. The qi and blood throughout the body take form and speak, clamoring together upon the body.",
      "overlap_context": "ale and female within. All depends on this cavity. When the regulation of spirit is perfected, the ten thousand spirits obey, the stars revolve and the Dipper turns—only then can one seize the celestial mechanism beyond.\n\nThe upper aperture is the body of pure yang, containing within it a speck of true lead’s essence—this is the other household’s substance within our body, externally within the internal. It is the speck of light between the two kidneys, manifested externally, hence the metaphor.",
      "start_char": 2774,
      "end_char": 4126,
      "start_sentence": 105,
      "end_sentence": 139,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.99276852607727,
      "metadata": {
        "source_file": "dao\\藏外\\玄谭全集.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "舌根下又有两穴，左为丹井，右为甘泉，名正涌穴，随骨脉一齐开，下肾水涌到口，即时咽纳不及，滋味甚异； 比沙糖大不相同。 直至三十时辰两日半，狂水已尽，专候天癸降，此正是时候，忽然一点真铅下降，凉如冰片，即时下一点真汞迎之。 攒簇之后，浑身湛然，如千百面战鼓之声，又如百万颗雷霆之吼，此即一身百脉气血变化所致，休要惊怕，只要踏罡步斗，执剑掌印，这里正是凶恶处，三回九转，降帅召将，如此防顾，于虚空中或见龙虎相交，天地交泰，日月合宫，诸仙诸境发现，切不可认以为真，恐着外邪，既得真铅投汞，三日之后才生大药。 当此两家争战之时，仆若不亲口说破，十个九个都吓杀了也。 心有恐怖，即遭魔障，既炼先天元阳，遗体都化成神，返来害已，虽化成形，却是阴神，阴神最灵化，能千变万化诸境为害，未肯善善降伏。 常人有言：“你会六通神，方才说死生； 不会六通冲，休思伏鬼神。 ”既伏不得鬼神，休想成道。 若使鬼神不能相见，焉能为害？ 混混又至三十时辰两日半，气气相通，气满至极。 忽然活泼泼捧出太阳流珠，脱壳入口，百万龙神，尽皆惊失，此是元种真丹药，入口始知“我命由我不由天也，仙云：“这回大死今方活”，又云：“一战而天下平”。 到此地位，才是真正天地交泰，日月交宫。 真阳之药到，顷刻周天火发，骨胎化作一堆肉泥，阳神脱体，撒手无碍，专心致志，持空守虚，随神变化，夫万物皆天地所发生，则万神皆朝礼而宾服。 厌居尘世，逍遥蓬莱，有三千玉女侍奉，终日蟠桃会上，饮仙酒，戴仙花，四大醺醺，浑身彻底玲拢，海底龟蛇自然蟠绕，到此才是真五龙大蛰法也。 炼之百日，玄关自开，婴儿现相，龟蛇出现，万神受使，才是真铅真汞颠倒，浑身紫雾毫光，瑞气千条，红光罩体，学者到此地位，口中才得于汞。 炼之六个月，体似银膏，血化白浆，浑身香气袭人，口中出气成云，此是灵丹成就，人服之永不死，亦能治死人返活。 炼之十个月，阳神脱体，一身能化为十万身。 只候十二个月，夺尽天地全数，阳神已就，浑身脱去八万四千阴神，步日月无影，入金石无碍，入水不溺，入火不焚，刀兵无所容其刃，鬼神莫能测其机，变化无穷，乃成真人矣。 浑身气候，都是真药，鸡餐成风，马食成龙，人服成仙，此理鬼神亦难明，若不见过做过，这等言语谁人肯信！ 夫大药金丹，造化功夫，三回九转，火候细微，攒簇口诀，只在五七之间，把天地都颠倒过，都是自然而然。 虽是自然，却要知体法天地造化，方可成就，却不是要在天地日月上然后成道也。 夫大药入口事，从做过，从见过，从试过，应到自然处。 功夫虽一年，火候细微只在百日之内，动静凶恶只在九十日以里，得内外而攒簇，顷刻湛然，圣胎成就，产个黍米之珠，吞入腹中，周天火发，脱胎换骨，只要持空养虚，徐皆自然而然。 今人果得真师明示，先去炼己于尘俗，积铅于市廛，攒年簇月，攒日簇时、簇刻，大定之中，只在一刹那间，不出半个时辰，把天机都颠倒过，运火十月之功，体天地自然之法，若不能死中求活，焉能逃出三灾八难之外哉！ 大学之士，聪敏智慧，饲一知十，三教经书，能讲能说，不过明性理字义而已，而于金丹造化，大道天机，内外两个真消息，焉能省悟？",
      "translated_text": "Beneath the root of the tongue lie two cavities: on the left, the Cinnabar Well, and on the right, the Sweet Spring—rightly named the Gushing Cavities. As the bone meridians open in unison, kidney water surges into the mouth, so copious that one cannot swallow fast enough; its flavor is most singular, far unlike that of granulated sugar. For thirty double-hours—two days and a half—this raging water is exhausted, and one awaits only the descent of celestial menses. At precisely this moment, a single drop of true lead descends, cool as a flake of ice, and immediately a drop of true mercury rises to meet it.\n\nOnce the gathering is complete, the entire body becomes serene, yet resounds like a thousand war drums, or roars like a million thunderclaps—this is the transformation of the hundred meridians and the blood throughout the body. Do not be alarmed; simply tread the Dipper’s steps, wield the sword, and grasp the seal. Here lies the most perilous point: three revolutions and nine turns, subduing marshals and summoning generals. With such vigilance, one may witness in the void the coupling of dragon and tiger, the harmony of heaven and earth, the union of sun and moon, or the manifestation of various immortal realms. Yet one must not mistake these for reality, lest external demons take hold.\n\nOnce true lead is united with mercury, after three days the great medicine is born. During this battle between the two, had I not personally revealed the secret, nine out of ten would have been frightened to death. Fear in the heart invites demonic obstructions. Having refined the primordial yang, the body transforms entirely into spirit, but if one turns back to harm oneself, though the form is transformed, it is but a yin spirit. Yin spirits are most cunning, capable of myriad transformations to cause harm, and unwilling to submit to good. As the common saying goes: *\"Only when you master the six penetrations can you speak of life and death; without the six penetrations, do not dream of subduing spirits.\"* If one cannot subdue spirits, how can one attain the Dao? If spirits cannot be seen, how can they cause harm?\n\nAfter another thirty double-hours—two days and a half—qi flows unimpeded, reaching its fullness. Suddenly, a radiant solar pearl emerges, lively and bright, leaping from its shell into the mouth. A million dragon spirits are struck with awe and lose their grip. This is the primordial seed, the true elixir of cinnabar. Only upon ingestion does one realize: *\"My life is mine, not heaven’s to command.\"* The immortals say: *\"Only after this great death does one truly live,\"* and again: *\"One battle settles all under heaven.\"* At this stage, true harmony between heaven and earth, the union of sun and moon, is finally achieved.\n\nWhen the medicine of true yang arrives, the fire of the microcosmic orbit ignites in an instant. The skeletal frame melts into a mass of fleshly mud, and the yang spirit departs the body, free and unobstructed. One must focus the mind, uphold emptiness, and guard the void, allowing the spirit to transform at will. All things under heaven are born of heaven and earth, and thus all spirits pay homage and submit. Weary of the dusty world, one roams carefree in Penglai, attended by three thousand jade maidens, feasting daily at the Peach Banquet, drinking immortal wine, wearing immortal flowers, the four great elements suffused with intoxication, the entire body utterly translucent. The tortoise and serpent of the sea bottom naturally coil together—only now is the true method of the Great Hibernation of the Five Dragons achieved.\n\nAfter a hundred days of refinement, the Mysterious Pass opens of itself, the infant appears in form, the tortoise and serpent emerge, and the ten thousand spirits are at one’s command. Only now are true lead and true mercury truly inverted, the entire body enveloped in purple mist and radiant beams, auspicious qi in a thousand strands, a red glow encasing the form. At this stage, the adept’s mouth finally gains control over mercury.\n\nAfter six months of refinement, the body resembles silver paste, the blood transforms into white nectar, the entire being exudes a fragrance that lingers, and the breath from the mouth forms clouds. This is the completion of the numinous elixir; one who consumes it shall never die and can even revive the dead. After ten months, the yang spirit departs the body, and a single form can divide into a hundred thousand. After twelve months, one seizes the full tally of heaven and earth, the yang spirit is perfected, and the eighty-four thousand yin spirits are shed from the body. One walks without casting a shadow in the sun or moon, passes through metal and stone unimpeded, drowns not in water nor burns in fire, blades find no purchase, spirits cannot fathom one’s designs, and transformations are endless—one has become a true person.\n\nThe entire body’s qi and vitality are now true medicine. A chicken that eats it becomes a phoenix, a horse that consumes it becomes a dragon, and a person who takes it becomes an immortal. This principle is even difficult for spirits to comprehend; without having seen or done it, who would believe such words?\n\nThe great medicine of the golden elixir, the work of creation and transformation, three revolutions and nine turns—its firing times are subtle. The oral instructions for the gathering lie within the span of five to seven. One overturns heaven and earth entirely, all naturally so. Though natural, one must understand the method of embodying heaven and earth’s creation to succeed; yet this does not mean one must rely on heaven, earth, sun, or moon to attain the Dao.\n\nThe matter of ingesting the great medicine must be personally experienced, witnessed, and tested before it aligns with the natural state. Though the work spans a year, the subtleties of the firing times lie within a hundred days; the perilous phases of movement and stillness occur within ninety days. Through inner and outer refinement, the gathering is achieved in an instant, and the sacred embryo is formed. It produces a pearl the size of a millet grain, which, when swallowed, ignites the fire of the microcosmic orbit. The womb is shed, the bones are transformed—one need only uphold emptiness and nurture the void, and all unfolds naturally.\n\nIf one truly finds a true teacher to clearly instruct, one first refines the self amidst the dust of the world, accumulates lead in the marketplace, gathers years into months, days into hours, hours into moments. Within this great stillness, all occurs in a single instant—less than half a double-hour—and the celestial mechanism is entirely overturned. One applies the work of ten months’ firing, embodying the natural method of heaven and earth. Without seeking life within death, how can one escape the three calamities and eight difficulties?\n\nScholars of great learning, keen and wise, who grasp one and know ten, who can expound and discourse on the scriptures of the Three Teachings—yet this only clarifies the principles of nature and the meanings of words. How can they comprehend the creation of the golden elixir, the celestial mechanism of the great Dao, or the two true messages of inner and outer? How can they awaken to this?",
      "overlap_context": "g is complete, true fire surges into the four limbs, and the entire body’s flesh and bones feel as if burned by fire and cut by a knife—this is the most difficult to endure. Even the bravest hero loses all composure at this point. One must guard against danger, bathe the body and mind in ice, balance water and fire, and in an instant, the entire body feels like popping beans, with all pores bursting open. The qi and blood throughout the body take form and speak, clamoring together upon the body.",
      "start_char": 4126,
      "end_char": 5385,
      "start_sentence": 140,
      "end_sentence": 165,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.42159724235535,
      "metadata": {
        "source_file": "dao\\藏外\\玄谭全集.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "若果遇至人，真传实授，便主穷理尽性开悟，如水归大海，省诸丹书，横竖无不是道。 诸子丹书，前人不肯妄言，一句句字字不空，只是人不能省悟。 譬如说“金丹吞入腹”之言，不能得旨之人，就错认在口腹上说话，岂知窍妙吸尽西江之玄哉！ 臂如说天地、日月、男女上去了，都是胡猜胡说。 执着旁门声音颜色，拒人于千里之外，不肯谦恭下士，终无了悟，反吹毛求疵，诽谤高人，焉能得其法术哉！ 反为天人之共恶，是皆地狱种子，诚可哀也。 奉劝世人，如遇至人，切不可执着已见，当虚心参访，苦求明师，方不致自误也。",
      "translated_text": "If one truly encounters a perfected being who imparts the authentic transmission, one will immediately penetrate principle, exhaust nature, and awaken—like water returning to the great sea. Then, upon examining all the alchemical scriptures, one finds the Dao in every line, horizontal or vertical. The alchemical texts of the various masters were not idly composed by their predecessors; not a single word or phrase is empty—only people fail to awaken to them.\n\nTake, for instance, the saying “swallow the golden elixir into the belly.” Those who miss the essential meaning fixate on the mouth and stomach, unaware that the wondrous aperture draws in the profound mystery of the entire Western River! Or consider those who speculate wildly about heaven and earth, sun and moon, male and female—all mere guesswork. Clinging to the sounds and appearances of side doors, they repel others from a thousand miles away, unwilling to humble themselves before the worthy. They never attain awakening but instead nitpick and slander the lofty ones—how could they ever grasp the method and technique?\n\nThey become objects of shared disdain among heaven and humanity, seeds of hell indeed—how pitiable! I earnestly advise the world: if you encounter a perfected being, never cling to your own views. Instead, approach with an empty mind, seek out a luminous teacher with diligence, and only then will you avoid self-deception.",
      "overlap_context": " earth. Without seeking life within death, how can one escape the three calamities and eight difficulties?\n\nScholars of great learning, keen and wise, who grasp one and know ten, who can expound and discourse on the scriptures of the Three Teachings—yet this only clarifies the principles of nature and the meanings of words. How can they comprehend the creation of the golden elixir, the celestial mechanism of the great Dao, or the two true messages of inner and outer? How can they awaken to this?",
      "start_char": 5385,
      "end_char": 5619,
      "start_sentence": 166,
      "end_sentence": 172,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.784327030181885,
      "metadata": {
        "source_file": "dao\\藏外\\玄谭全集.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "⊙此督脉也。 督者，总也，总领一身之气脉。 正是天地未判，未生身前，先天元阳祖炁，浩劫长存，亘古至今而不坏者也。 ○此任脉也。 任者，仁也，乃生生不息之元气也。 净罗罗，圆陀陀，赤洒洒，精喇喇，明丽丽，光灼灼，活泼泼，此物是象帝之先，万神之祖，包含万象，发生万物，释云摩尼珠，道云黍米玄珠，医云活滚滚一丸真灵丹妙药，实千古不传之秘。 今人不明此理，亦无传授，又不醒悟，焉知“内外”二字之妙。 任督二脉实先后天之玄，诚哉百姓日用而不知也。 督脉⊙此窍是生身之源，未有此身，先有此窍，非凡孔窍之窍也，乃玄机之妙窍也。 此消息正是父母未生前一点元阳炁。 任脉○此窍是一身五脏之主，内外执掌，全在此窍，若知颠倒攒簇，是生五脏之根，未有五脏，先有此窍，未生此身，先生此窍也。 此个消息是养命之方，留命不死之根蒂。 这上、中、下三个真消息，若得正传，能归根复命，使四炁归入下元，魂魄不散，水火既济，有何病证！ 这元阳得传授明白，或遇法网不能脱，不能成道，不得已然后将海底命主，为四炁之根本，发起命主，归元炁不散，用一着撒手无碍，舍此消息，亦可再出头而学道也此是鬼神不测之玄机。 这先天元炁，黍米玄珠，真心传得明白，勤而行之，忽然大悟，则三教经书，了然在吾目前，不待思索自然解悟。 以大理论，则浑身上下，内外血气，俱后天渣滓之浊阴，唯秘密处一点元阳，是个纯阳，此真形属心，此心是真空心，非这个血肉心。 此真心万人不识，其中别有个乾坤世界。 仆把内外三心，述之于后。 外心——天心：○此心是真空心，曰玄关，通天窍，正是内外五行真炉鼎。 凡开关发火，踏罡步斗，执剑掌印，了鬼神窥不破之机，全在此也要知法度可也。 中心——人心：○此心是中心一窍也，为黄婆舍，内外攒簇，看时定候，全凭黄婆是也。 安炉立鼎，为炼内外二药，老嫩要辨，真伪亦然，出自此心也。 内心——、地心：○此心正海底命主，万神之蒂。 凡修大乘，先修小乘，筑基炼己，聚积法财保养汞气，全在此穴，要识刚柔。 此三个心，在一身内外三个消息，若会把天地颠倒过，打开无缝锁，一句了却古弥陀。 此三心万古不传之秘，除了这血肉心，还有三个真心，这三心贯通虚无真空。 若明这个真心，则天地万象，包含在这空心里。 这个空心含着真阴真阳，然真空消息是把无缝锁，终不能开，生死何处躲？ 仙云：“金针容易得，玉线最难穿。 要知生死路，如滚芥投针。 ”喻言阴阳，阴阳是性命，谁人识得么？ 然人觉三日、五日，一七、二七、三七日，回首要留命不死，当捉住水、火、风不散，归我身中彼家兑之命主，不要动心，是不死之方。 若人年老，不能行持了道，要回首去，如瓜儿一熟，蒂儿一落，全在这些消息，一知时候，发海底命主，归上虚无元性，自然魂魄不散，任从自己，方不迷矣。 金丹破疑直指 世有等小根盲人，见先仙所言外阴阳、外炉鼎、外药物，便执迷以女人为鼎器，诚可哀也。 这样无知之徒，岂知清静大道有三身四智、内外鼎炉、内外药物、内外火候之玄哉！ 岂知万物皆备于我，天地造化皆同我之大哉！",
      "translated_text": "⊙This is the Governing Vessel. \"Governing\" means \"to unify\"—it unifies the qi channels of the entire body. It is precisely the primordial yang ancestral qi of the pre-cosmic state, before heaven and earth divided, before this body was born. It has endured through kalpas, unbroken from ancient times to the present.\n\n○This is the Conception Vessel. \"Conception\" means \"benevolence\"—it is the primordial qi of ceaseless generation. Pure and vast, perfectly round, radiant and crimson, exquisitely refined, luminous and resplendent, vibrant and alive—this is the thing that precedes the image of the Lord-on-High, the ancestor of all spirits. It embraces the ten thousand images and gives rise to the ten thousand things. Buddhists call it the *maṇi-jewel*; Daoists call it the *millet-like mysterious pearl*; physicians call it the *ever-bubbling elixir of true numinous medicine*—truly a secret untransmitted for ages.\n\nPeople today do not understand this principle, nor have they received its transmission, nor do they awaken to it—how could they know the wondrousness of the \"inner and outer\"? The Conception and Governing Vessels are indeed the mystery of the pre- and post-cosmic, yet the common folk use them daily without knowing it.\n\n⊙The Governing Vessel—this aperture is the source of the body’s birth. Before this body existed, this aperture was already present. It is no ordinary bodily orifice but the wondrous aperture of the subtle mechanism. This subtle movement is precisely the primordial yang qi that existed before father and mother conceived.\n\n○The Conception Vessel—this aperture governs the five viscera of the entire body, presiding over both inner and outer. If one knows how to invert and gather, it becomes the root from which the five viscera are born. Before the five viscera existed, this aperture was already present; before this body was born, this aperture was born first. This subtle movement is the method of nurturing life, the root and stem of preserving life without death.\n\nThese three true subtle movements—upper, middle, and lower—if received through proper transmission, can return one to the root and restore life. They cause the four qi to return to the lower origin, prevent the dispersal of hun and po, and achieve the harmony of water and fire—what illness could then arise? If this primordial yang is clearly transmitted, even if one encounters the net of the law and cannot escape, or cannot attain the Dao, one may, as a last resort, arouse the life-master at the sea-bottom—the root of the four qi—and return it to the undispersed primordial qi. With a single move, one may let go without obstruction. Apart from this subtle movement, one may also reemerge to study the Dao—this is the unfathomable mystery of gods and spirits.\n\nThis primordial qi, the millet-like mysterious pearl, if the true mind transmits it clearly and one practices it diligently, will suddenly bring great awakening. Then the scriptures of the Three Teachings will be clearly present before one, understood without need for reflection or thought.\n\nFrom a grand theoretical perspective, the entire body—inside and out, blood and qi—is all post-cosmic dregs of turbid yin. Only the single point of primordial yang in the secret place is pure yang. This true form belongs to the heart, and this heart is the heart of true emptiness—not the heart of blood and flesh.\n\nThis true heart is unknown to the multitude, yet within it lies another world of heaven and earth. I shall describe the three hearts—inner, outer, and central—below.\n\n**Outer Heart—Heavenly Heart**: ○This heart is the heart of true emptiness, called the *mysterious pass*, the aperture that communicates with heaven. It is precisely the true crucible and furnace of the inner and outer Five Agents. All methods of opening the pass, kindling the fire, pacing the stars, wielding the sword, and holding the seal—through which even gods and spirits cannot perceive the mechanism—depend entirely on this. One must know the proper method.\n\n**Central Heart—Human Heart**: ○This heart is the central aperture, the dwelling of the Yellow Dame. The gathering of inner and outer depends entirely on her. Setting up the furnace and establishing the crucible, refining the inner and outer medicines, distinguishing maturity from immaturity, truth from falsehood—all emerge from this heart.\n\n**Inner Heart—Earthly Heart**: ○This heart is the life-master at the sea-bottom, the stem of the ten thousand spirits. In cultivating the Great Vehicle, one must first cultivate the Lesser Vehicle: laying the foundation, refining the self, accumulating the wealth of the Dharma, and preserving the qi of mercury—all depend on this cavity. One must recognize hardness and softness.\n\nThese three hearts are the three subtle movements—inner, outer, and central—within the body. If one can invert heaven and earth, unlock the seamless lock, then a single phrase resolves the ancient Amitābha.\n\nThese three hearts are the secret untransmitted for ages. Apart from the heart of blood and flesh, there are three true hearts. These three hearts penetrate the true emptiness of the void. If one understands this true heart, then the ten thousand images of heaven and earth are contained within this empty heart. This empty heart embraces true yin and true yang, yet the subtle movement of true emptiness is the seamless lock—if it cannot be opened, where can one escape birth and death?\n\nThe immortals say:\n*\"The golden needle is easy to obtain,\nThe jade thread is hardest to thread.\nTo know the path of birth and death,\nIs like tossing a mustard seed into a needle’s eye.\"*\n\nThis is a metaphor for yin and yang. Yin and yang are life and destiny—who truly understands them? Yet if one awakens for three, five, seven, fourteen, or twenty-one days, and wishes to preserve life without death, one must seize water, fire, and wind, preventing their dispersal, and return the life-master of the other household to one’s own body. Do not stir the heart—this is the method of not dying.\n\nIf one is aged and cannot practice to attain the Dao, one must turn back. Like a melon that ripens and its stem falls, it all depends on these subtle movements. Once the timing is known, arouse the life-master at the sea-bottom and return it to the primordial nature of the upper void. Then hun and po will not disperse, and one may act freely without delusion.\n\n*Direct Pointers to Resolving Doubts on the Golden Elixir*\n\nThere are those of shallow roots and blind eyes who, upon hearing the immortals speak of outer yin-yang, outer crucibles, and outer medicines, cling to their delusions and take women as vessels—how pitiable! Such ignorant fools—how could they know that the Great Dao of purity encompasses the three bodies and four wisdoms, the inner and outer crucibles and furnaces, the inner and outer medicines, and the subtleties of inner and outer fire timings? How could they know that the ten thousand things are complete within me, and the creative transformations of heaven and earth are identical to my own greatness!",
      "overlap_context": "nwilling to humble themselves before the worthy. They never attain awakening but instead nitpick and slander the lofty ones—how could they ever grasp the method and technique?\n\nThey become objects of shared disdain among heaven and humanity, seeds of hell indeed—how pitiable! I earnestly advise the world: if you encounter a perfected being, never cling to your own views. Instead, approach with an empty mind, seek out a luminous teacher with diligence, and only then will you avoid self-deception.",
      "start_char": 5621,
      "end_char": 6848,
      "start_sentence": 173,
      "end_sentence": 209,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.2721734046936,
      "metadata": {
        "source_file": "dao\\藏外\\玄谭全集.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "假如有缘之士，得遇真师，先行玉液内还丹，炼已和光，操持涵养，回光返照，此明心见性之事。 若夫金液还丹，乃情归性，直到真空地位，大用现前，龙女现一宝珠，发现至此，方为一得永得。 亥子之交，坤腹之间，于一阳初动兴功之时，手探月窟，足蹑天根，回风混合，从此方有百日功灵之验，金液还丹乃全此五行之大事也。 除此性命双修清静之道，馀皆旁门小术耳。 吾于一身内外，安炉立鼎之妙，攒簇五行口诀，药物火候细微已得，不知虚空法度，便去入室行外药入腹大事，发火兴功。 行到秘密处，有虚空万神朝礼，仙育成顶，此事鬼神难明，只因自己不能炼已于尘俗，未得积铅于市廛，气脉又末大定，基址亦未三全，理虽融而性未见，故万神发现，凶险百出，心神恍惚，不能作主。 又因外边无知音道侣护看防守； 着其声色，惊散元阳，激鼎焚炉，劣了心猿，走了意马，神不守舍，气不归元，遭其阴魔。 何为阴魔？ 我不细说，后学不知。 皆因真阳一散，阴气用事，昼夜身中鬼神为害，不论睁眼合眼，耳中只听鬼神噪闹，白日间犹可，到晚最为难过，不敢定静一时，我身彼家海底命主，兑金之戊土，冲翻五脏百脉，血气皆随上腾，连身提起不着地，杀身丧命，鬼家活计。 仆暂弃前功，遵师训指，大隐市廛，积铅尘俗，摄情归性，杀机返心。 自幼至老，被天地人物盗去天真，今于虚无中尘色内，却要盗夺返还于我天性之中，方得元精、元气、元神，欲还三全，全凭虚极静笃，造致万物芸芸，乃得各复归根。 根归理融，理融见性，身心大定，五行攒簇，才去行向上事而了道也。 想先代贤哲，多有中道而废者，皆因未曾炼己持心，金来归性，以至二候得药，于四候进火之时，不知虚空法度，粗心大意，是以白公有“再斫松筠节”之叹。 谁知虚空消息，至细至微，至凶至恶，若是擒捉不住，定不饶人。 学人能知一身内外两个消息，了然无碍，从此操持涵养，克去己私，复还天理，则不定期丹之功，至简至易，终日操吾身外之黄花，以候先后二天之琼浆，此正是“饮酒戴花悟长生”之妙也。 然混元一事，则毋有意、毋必、毋固、毋我，任死任生，忘人忘我，终日定街方块字市，玩景怡情，于淫房酒肆，兀坐妄言，岂不动人之惊疑笑谤哉！ 摄境积铅，法财两用，岂不致俗子之欺弄祸身哉！ 是以籍通都大邑有力之家，以为外护，目击道存，韬光晦迹。 仙云：“若贪天上宝，须用世间财。 ”乃吾身天上九阳鼎之大宝也。 凡寄生于宇宙之间，男女所赖以生而不死者，唯此一点阳精而已，岂有学仙的人，男子学道必用女人，女人学道必用男子，是财坏天下之风化，皆天知禽兽之所为也。 噫！ 言语不通，执迷不悟，岂仙佛之眷属乎？ 学者果能操持涵养，于造次颠沛流离之际，不失方寸，然后求向上外药入腹事，顷刻湛然，脱胎换鼎，浑身化一道金光，大地成空，身外有身，阳神脱体，持空养虚，此是五龙大蛰法。 仙云：“内丹不成，外丹不就。 ”言而有信人得正传，且先积精累气，并积内外法财，养得气满神全，金光出现，昼夜常明，则此时内丹成，而吾身外丹法象现矣。 凡看书不可按图索骥，学者于昼夜常明之时，药苗一生，方可采吾身外药，配吾身中之雌雄，一得金光入口，周天火发，顷刻湛然，撒手无碍，才是金蝉大脱壳也。",
      "translated_text": "If a man of karmic affinity should encounter a true master, he must first practice the inner return of the Jade Liquid Elixir, refining the self to harmonize with radiance, holding fast to nurturing cultivation, and turning the light inward to reflect—this is the matter of illuminating the mind and seeing the nature. As for the Golden Liquid Return Elixir, it is the return of emotion to nature, reaching the state of true emptiness, where great function manifests before one. The Dragon Girl presents a single precious pearl, and only upon its revelation is there attainment that endures forever.\n\nAt the cusp of *hai* and *zi*, between the belly of *kun*, when the first yang stirs and work begins, one’s hand explores the Moon Grotto while the foot treads the Heavenly Root. The returning wind merges in harmony, and only then does the efficacy of a hundred days’ work manifest. The Golden Liquid Return Elixir is the great affair of completing the Five Phases.\n\nApart from this Way of dual cultivation of nature and life in purity, all else is but peripheral minor arts. Within my own body, inside and out, I have mastered the subtleties of setting up the furnace and establishing the crucible, the oral instructions for gathering the Five Phases, and the fine details of medicine and fire timing. Yet if one does not understand the measures of the void and rashly enters the chamber to perform the great work of ingesting the outer medicine and kindling the fire, when the practice reaches its secret point, the ten thousand spirits of the void will come to pay homage, and the immortal embryo will form at the crown. This matter is too profound for even ghosts and spirits to fathom. It is only because one has not refined the self amid the dust of the world, has not accumulated lead in the marketplace, the qi channels remain unsettled, and the foundation is not yet complete in three aspects. Though the principle is harmonized, the nature is not yet revealed. Thus, when the ten thousand spirits manifest, a hundred dangers arise: the heart and spirit grow distracted, unable to take command.\n\nMoreover, without knowing companions of the Way to guard and protect outside, one may be startled by sounds and sights, scattering the primordial yang, agitating the crucible and scorching the furnace. The Heart Ape grows restless, the Intent Horse flees, the spirit does not guard the abode, and the qi does not return to the origin—one falls prey to yin demons. What are yin demons? I shall not elaborate, but later learners will not understand. It is all because the true yang scatters and yin qi takes control, with ghosts and spirits in the body causing harm day and night. Whether eyes are open or closed, one hears only the clamor of ghosts and spirits. By day it is bearable, but by night it is most unbearable—one dare not settle into stillness even for a moment. The life-master at the Sea Bottom of the other household, the *dui*-metal’s *wu* earth, surges through the five viscera and hundred channels, blood and qi all rising upward, lifting the body so it does not touch the ground, bringing death and ruin—the livelihood of ghosts.\n\nI temporarily abandoned my previous efforts, following my master’s instructions to conceal myself in the marketplace, accumulating lead amid the dust of the world, drawing emotion back to nature, and returning the killing mechanism to the heart. From youth to old age, heaven, earth, and all beings have stolen my celestial authenticity. Now, within the dust and colors of the void, I must steal it back and return it to my celestial nature. Only then can the primordial essence, primordial qi, and primordial spirit be restored to wholeness. This depends entirely on extreme emptiness and profound stillness, whereby the myriad things flourish and each returns to its root. When the root returns, the principle harmonizes; when the principle harmonizes, the nature is revealed. Body and mind settle into great stillness, the Five Phases gather, and only then can one proceed to the upward work and complete the Dao.\n\nMany worthy sages of former times abandoned their practice midway, all because they had not refined the self and held the heart, had not drawn metal back to nature. Thus, when they obtained the medicine in the second period and proceeded to the fire in the fourth period, not understanding the measures of the void and acting carelessly, Master Bai sighed, “Again must the pine and bamboo be hewn.” Who knows the subtleties of the void—so fine, so perilous, so fierce? If one fails to seize it, it will surely not spare them.\n\nIf a learner can understand the two subtleties within and without the body, attaining clarity without obstruction, and from there hold fast to nurturing cultivation, overcoming selfishness and restoring celestial principle, then the work of the elixir without fixed timing becomes most simple and easy. One may spend all day tending the yellow blossoms outside the body, awaiting the jade nectar of prior and posterior heaven—this is precisely the wonder of “drinking wine, wearing flowers, and awakening to longevity.”\n\nYet in the matter of primordial merging, there must be no intent, no insistence, no rigidity, no self. Whether life or death, forget others and forget the self. All day in the bustling marketplace, one plays with scenes to gladden the heart, sitting blankly in brothels and taverns, speaking idly—how could this not arouse the shock, doubt, laughter, and slander of others? Drawing in the environment to accumulate lead, employing both method and wealth—how could this not invite the deception and harm of vulgar men?\n\nThus, one relies on powerful families in great cities for external protection, perceiving the Dao with a glance while concealing one’s light and hiding one’s tracks. As the immortals say, “If you covet the treasure of heaven, you must use the wealth of the world.” This is the great treasure of the Nine Yang Crucible within my body. All beings dwelling between heaven and earth, men and women alike, rely on this single point of yang essence to live without dying. How could it be that those who study immortality—men learning the Dao must use women, women learning the Dao must use men—corrupt the customs of the world? Such acts are known only to beasts and animals. Alas! With speech incomprehensible and delusion unshaken, how could they be kin to immortals and buddhas?\n\nIf a learner can truly hold fast to nurturing cultivation, not losing the square inch of the heart amid haste, peril, or displacement, and then seeks the matter of ingesting the outer medicine, in an instant they will become profoundly still. Shedding the womb and changing the crucible, the whole body transforms into a single beam of golden light. The great earth becomes empty, and outside the body appears another body. The yang spirit leaves the form, holding emptiness to nurture the void—this is the Great Hibernation of the Five Dragons.\n\nAs the immortals say, “Without inner elixir, outer elixir will not succeed.” These words are trustworthy. One who receives the true transmission must first accumulate essence and amass qi, gathering both inner and outer method and wealth. When qi is full and spirit complete, the golden light appears, shining day and night without cease. At this time, the inner elixir is complete, and the outer elixir’s symbolic manifestation appears.\n\nOne must not read books and seek the steed by following the picture. Only when the golden light shines day and night, and the medicine sprout arises, may one gather the outer medicine of the body and pair it with the inner yin and yang. Once the golden light enters the mouth and the fire of the celestial circuit ignites, in an instant one becomes profoundly still, letting go without hindrance—this is the Great Molting of the Golden Cicada.",
      "overlap_context": "crucibles, and outer medicines, cling to their delusions and take women as vessels—how pitiable! Such ignorant fools—how could they know that the Great Dao of purity encompasses the three bodies and four wisdoms, the inner and outer crucibles and furnaces, the inner and outer medicines, and the subtleties of inner and outer fire timings? How could they know that the ten thousand things are complete within me, and the creative transformations of heaven and earth are identical to my own greatness!",
      "start_char": 6850,
      "end_char": 8127,
      "start_sentence": 210,
      "end_sentence": 238,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.652082443237305,
      "metadata": {
        "source_file": "dao\\藏外\\玄谭全集.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "学才未遇人时，当小心低意，积功累行，遇魔勿退，遇谤勿嗔，重道轻财； 一遇至人，笃志苦求，决破一身内外两个真消息，忽然配悟真去处而言之，所谓“吾身一天地”也。 然此真去处，虽曰不依形而立，而窍中之窍，夫岂无形哉！ 今乃借物以明之，譬之叉口然，实其中则张，虚其中则弛。 而窍之能张能弛，亦复如是。 起手时先须凝神，入于窍中之窍，息息归根而中实矣，中实而胎长矣。 然神本生于窍中之窍而寄体于心宫，余尝谓之原是我家之物而复返于我也。 窍中之窍者，神室也。 神室即气穴，即中黄。 盖黄好土之正色，而土意也，故坎之土戊，其意常在于离，离之土已，其意常在于坎，此其性情然也，而自有相投合之机矣。 若能识其投合之机，而以意送之，神凝气住，则自然结成一点金丹，至简至易，而非有穿凿也。 此盖以母之气伏子之气，而子母之气相眷恋于窍中之窍，丹岂有不成者乎？ 正道歌二首 我有一口诀，长叹无处说。 天下访不着，人人不可说！ 顺丹逆是仙，此是真口诀。 万般枉费心，都是胡扭捏。 熟记《悟真篇》，求师仔细别。 自然些子妙，玄机神莫测。 融融乾坤髓，拣时用意啜。 要须地下宝，须明天上月。 浮沈看老嫩，水源别清洁。 若逢野战时，猿马休颠劣。 宾来先作主，主来后作宾。 黄婆媒姹女，交{女后}丹自结。 外面黑如漆，里面白如雪，中间黄紫烂，肉青皮似血。 结就五杰丹，三尸阴鬼灭。 玲珑剔透人，痴聋喑哑拙。 心也无得思，口也没得说。 用文须用武，采取按时节。 金鼎常令暖，玉炉毋令热。 交{女后}顷刻间，温养十个月。 男子会生产，产个三岛客。 活吞一粒丹，天仙来迎接。 九年功行满，稳步朝金阙。 又 道情不是等闲情，既识玄机不可轻。",
      "translated_text": "Before encountering a true master, one must be humble and cautious, accumulating merit and cultivating conduct. When faced with demons, do not retreat; when slandered, do not grow angry. Value the Dao and disdain wealth. Upon meeting a perfected one, devote oneself wholeheartedly to seeking, resolutely breaking through the two true mysteries within and without the body. Suddenly, one aligns with the true locus of realization and speaks of it—this is what is meant by \"my body as heaven and earth.\"\n\nThough this true locus is said to stand without reliance on form, how could the aperture within the aperture be without form? Now, we borrow an analogy to clarify: consider a forked mouth—when its center is full, it opens; when empty, it slackens. The aperture’s ability to open and slacken is just like this.\n\nAt the outset, one must first concentrate the spirit, entering the aperture within the aperture. With each breath returning to the root, the center becomes full, and with the center full, the embryo grows. Yet the spirit is originally born within the aperture of apertures and lodges in the palace of the heart. I have often called it: \"what was originally my own, now returned to me.\"\n\nThe aperture within the aperture is the spirit-chamber. The spirit-chamber is the qi-cavern, the Central Yellow. Yellow is the true color of good earth, and earth is intent. Thus, the earth of Kan (☵) is *wu* (戊), whose intent ever tends toward Li (☲); the earth of Li is *ji* (己), whose intent ever tends toward Kan. Such is their nature and disposition, and thus they possess a natural affinity for union.\n\nIf one can recognize this moment of affinity and guide it with intent, spirit congeals and qi abides—naturally coalescing into a single grain of golden elixir. It is utterly simple and effortless, without forced contrivance. This is the mother’s qi subduing the child’s qi, as the qi of mother and child yearn for each other within the aperture of apertures. How could the elixir fail to form?\n\n**Two Songs of the Right Dao**\n\nI hold a single oral formula,\nYet sigh that none can hear it.\nI search the world in vain—\nTo no one may it be spoken!\n\nForward is the elixir, reverse is immortality:\nThis is the true oral formula.\nAll else is vain striving,\nMere contortion and pretense.\n\nMaster the *Awakening to Reality*,\nSeek a teacher with care.\nThen some small wonder arises,\nA mystery beyond spirit’s reckoning.\n\nThe marrow of heaven and earth, fused and warm,\nSipped with mindful timing.\nOne must seek the treasure beneath the earth,\nAnd discern the moon in the sky.\n\nObserve the floating and sinking to know ripeness,\nDistinguish the water’s source for purity.\nWhen the wild battle comes,\nLet neither ape nor horse grow restless.\n\nWhen the guest arrives, first act as host;\nWhen the host arrives, then act as guest.\nThe Yellow Dame mediates the Dark Maiden—\nTheir union forges the elixir.\n\nOutside, black as lacquer;\nWithin, white as snow.\nAt the center, radiant with yellow and purple,\nFlesh green, skin like blood.\n\nOnce the Five Heroes’ elixir is formed,\nThe Three Corpses and yin ghosts perish.\nThe one refined and luminous,\nNot the dull, deaf, mute, or clumsy.\n\nMind without thought,\nMouth without speech.\nEmploy the civil, then the martial,\nGather in accord with the season.\n\nKeep the golden crucible ever warm,\nThe jade furnace never too hot.\nIn an instant, the union is complete—\nThen nurture it for ten months.\n\nA man may give birth,\nBearing a guest of the Three Isles.\nSwallowing a single living grain,\nHeavenly immortals come to welcome him.\n\nWhen nine years of merit are fulfilled,\nHe strides steadily toward the Golden Gate.\n\nAgain:\n\nThis Dao-affection is no common feeling.\nOnce the mystery is known, it must not be taken lightly.",
      "overlap_context": " and the outer elixir’s symbolic manifestation appears.\n\nOne must not read books and seek the steed by following the picture. Only when the golden light shines day and night, and the medicine sprout arises, may one gather the outer medicine of the body and pair it with the inner yin and yang. Once the golden light enters the mouth and the fire of the celestial circuit ignites, in an instant one becomes profoundly still, letting go without hindrance—this is the Great Molting of the Golden Cicada.",
      "start_char": 8127,
      "end_char": 8813,
      "start_sentence": 239,
      "end_sentence": 275,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.683290719985962,
      "metadata": {
        "source_file": "dao\\藏外\\玄谭全集.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "先把世情都放下，后将妙理自研明。 未炼还丹先炼性，未修大药且修心。 心定自然丹性至，性清然后药材生。 雷声隐隐震虚空，黄庭紫雾罩千寻。 若还到此休惊怕，只把元神守洞门。 守洞门，如猫鼠兔逢鹰。 万般景象都非正，一个红光是至真。 此个红光生异象，其中犹若明窗尘。 中含一点先天气，远似葡萄近似金。 到手全凭要谨慎，丝毫念起丧天真。 待他一阳归洞府，身中化作四时春。 一片白云看一阵，一番雨过一番新。 终日绵绵如醉汉，悠悠只守洞中春。 遍体阴精都剥尽，化作纯阳一块金。 此时气绝如小死，打成一片是全真。 到此功夫为了当，却来尘世积功勋。 功成行满天命诏，阳神出现了真灵。 此言休与非人说，轻泄天花板机霹雳轰。 嘱咐仙朋与道侣，不逢达者莫轻论。 其中句句通玄妙，此真之外更无真。 收拾锦囊牢闭固，他日修行可印心。 可印心，五十二句要君听。 若有虚言遭横死，误尔灵官鞭碎身。",
      "translated_text": "First lay down all worldly attachments,\nThen delve into the wondrous principles to clarify them yourself.\nBefore refining the Returned Elixir, first refine your nature;\nBefore cultivating the Great Medicine, first cultivate your mind.\nWhen the mind is settled, the Elixir’s nature naturally arrives;\nWhen the nature is purified, then the medicinal ingredients arise.\nThunder rumbles faintly, shaking the empty void,\nYellow Court and purple mists veil a thousand fathoms deep.\nShould you reach this point, do not be startled or afraid—\nOnly guard the Gate of the Grotto with your original spirit.\nGuard the Grotto Gate as a cat, mouse, or hare meets an eagle.\nThough myriad visions appear, none are true—\nOnly a single crimson light is the utmost reality.\nThis crimson light gives birth to strange phenomena,\nWithin it, like dust in a sunlit window.\nIt contains a single point of primordial qi,\nDistant as a grape, near as gold.\nSeize it with utmost care—\nThe slightest stray thought forfeits celestial truth.\nWait until the first yang returns to the Grotto Palace,\nTransforming the body into the four seasons of spring.\nA patch of white cloud drifts by,\nEach rain’s passing brings renewal.\nAll day long, serene as a drunken man,\nLeisurely guarding the grotto’s eternal spring.\nWhen all yin essence is stripped away,\nIt transmutes into a mass of pure yang gold.\nAt this moment, breath ceases as in a minor death,\nForged into one whole—the perfected true self.\nHere the work is complete,\nYet return to the mundane world to accumulate merit.\nWhen merit is fulfilled and conduct perfected, Heaven’s decree arrives,\nThe yang spirit emerges, revealing true numen.\nThese words must not be spoken to the unworthy—\nReckless disclosure invites celestial thunder’s wrath.\nI charge my immortal companions and Daoist peers:\nDo not lightly discuss this with those who do not comprehend.\nEach line here conveys profound mystery—\nBeyond this truth, no truth remains.\nGather these brocade verses, seal them tightly,\nThat one day they may verify your practice.\nVerify your practice—\nFifty-two lines for you to heed.\nShould any falsehood be spoken, you’ll meet violent death,\nYour spirit officer lashed to pieces.",
      "overlap_context": "l,\nGather in accord with the season.\n\nKeep the golden crucible ever warm,\nThe jade furnace never too hot.\nIn an instant, the union is complete—\nThen nurture it for ten months.\n\nA man may give birth,\nBearing a guest of the Three Isles.\nSwallowing a single living grain,\nHeavenly immortals come to welcome him.\n\nWhen nine years of merit are fulfilled,\nHe strides steadily toward the Golden Gate.\n\nAgain:\n\nThis Dao-affection is no common feeling.\nOnce the mystery is known, it must not be taken lightly.",
      "start_char": 8813,
      "end_char": 9174,
      "start_sentence": 276,
      "end_sentence": 298,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.121320962905884,
      "metadata": {
        "source_file": "dao\\藏外\\玄谭全集.txt",
        "category": "藏外"
      }
    }
  ]
}