{
  "source_id": "玉景九天金霄威神王祝太元上经",
  "source_file": "chunked_daozang\\玉景九天金霄威神王祝太元上经.json",
  "total_chunks": 3,
  "total_original_chars": 3106,
  "total_translated_chars": 20336,
  "total_translation_time": 104.20720887184143,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\方法类\\玉景九天金霄威神王祝太元上经.txt",
    "category": "方法类"
  },
  "full_translation": "*The Jade Radiance Nine Heavens Golden Dawn Majestic Spirit King’s Invocation of the Supreme Primordial: An Upper Scripture*\n\n**Scripture Title:** *The Jade Radiance Nine Heavens Golden Dawn Majestic Spirit King’s Invocation of the Supreme Primordial*. Also known as *The Jade Capital Nine Heavens Golden Dawn Majestic Spirit Jade Secret Scripture*. Author unknown, approximately composed during the Northern and Southern Dynasties. An early Shangqing School talismanic text. One scroll.\n\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, Methods Category.\n\n---\n\nAll who possess karmic destiny and are destined to receive this scripture must first swear an oath, cutting their flesh to seal the covenant, pledging faith before the Nine Heavens, and only then may it be transmitted. According to the statutes of the Supreme Lord of the Western Numinous, within two thousand two hundred years, it may be passed to only three persons.\n\nThe *Jade Radiance Upper Primordial Great Tiger Talisman* is the inner numen of the Nine Heavens Golden Dawn Majestic Spirit King, a sacred text harmonizing the dual radiance of the Two Luminaries. Its Dao is wondrous and perfectly true; its qi intermingles with the Upper Primordial. It is treasured by the Jade Emperor and revered by all the Celestial Sovereigns. Those who wear it command the essence of radiance, ascend the Nine Mornings, annihilate demonic spirits, and subdue the myriad gods. All who behold its text possess the innate endowment of true immortals and extend seven generations of blessed fortune.\n\nOnly after encountering a master who imparts its transmission, observing summer retreats in austere solitude, and severing ties with the mundane world may one don the *Halo of Majestic Spirit Talisman*, invoke the inner numen, and cause its luminous effulgence to suffuse the Great Void, thereby moving the Three Clarities to respond. Thus, divine immortals bow in submission, malevolent trials vanish without trace, and the adept’s destiny is prolonged through vigilant secrecy. Overseers observe and record their deeds and transgressions.\n\nThe Supreme Lord perpetually dispatches seventy million *Western Numinous Great Armor* spirits and seven thousand *Divine Tigers* to escort the *Radiant Essence Central King*, attending the scripture at the *Western Jasper Terrace of the Supreme Primordial*. The *Radiant Essence Central King* is the inner name of the *Supreme Golden Dawn Majestic Spirit King*. Those who know the name of the *Majestic Spirit King* command all lesser spirits and gods, who submit without exception to the adept.\n\nThis *Spirit King* is the supreme numen of the *Jade Essence Heavenly Primordial*, the majestic truth of the *Divine Tiger Golden Dawn*. Thus, wearing its text invokes the awe of the Six Heavens; grasping its talisman summons the Three Officials as vassals; venerating its chamber hastens the arrival of *Jade Splendor*; reciting its invocation opens the ford of the *Divine Tigers*. Its majesty pervades the Eight Voids; its numinosity penetrates the Nine Mornings. It beheads hordes of demons, strikes down great villains, compels mountains and peaks to bow in reverence, and subdues the sources of rivers and seas. With a roar, it commands the ten directions, enslaves divine immortals, bestows a lifespan equal to the Three Luminaries, and radiates majesty across the *Supreme Primordial*. Truly, this is a marvelous text of the *Upper Clarity*, a majestic chapter of the *Radiant Essence*.\n\nWhen transmitting this divine text, one must carefully select the recipient. Only those whose karmic affinity aligns with destiny and whose innate endowment befits immortality may then seek the oral command of the *Grand Master*, the endorsement of the *Dharma Master*, and the covenant of the *Scripture Master*. They must invoke the talismanic response of the spirits, summon the wondrous awakening of qi, scrutinize subtle omens to determine alignment, and act upon the pivotal moment. If one transmits it recklessly without the mandate of the *Grand Master* or the endorsement of the *Dharma Master*, even if the recipient possesses the innate endowment of an immortal, the *Jade Name Youth*, or the seven generations of the adept’s ancestors, they will still face judgment in the netherworld’s statutes.\n\nThus, those who transmit without an oath cause the *Scripture Master* to die, their soul enslaved to the *Water Official*, while the disciple incurs the trial of *Heavenly Fire*. Those who swear an oath but fail to uphold it condemn the *Scripture Master* to perish in the *Path of Suffering*, while the disciple falls prey to demonic transformation. Therefore, the covenant is revered, and the oath must never be lightly broken. For this reason, *Water and Fire* serve as punishments from the *Divergent Heavens*, and the *Nine Demons* become the *Beams of Agony*. The soul suffers the *Punishment of the Womb*, enduring eternal torment in the *Great Darkness*. Though one may wander the grottoes and dwellings, beseeching the numen of the Celestial Sovereigns, even ten thousand repetitions will not absolve their sin, nor will their vows be heard. The *Seven Mysteries* endure eternal torment in hell.\n\nThe attainment of immortality is contingent upon celestial statutes and divine validation—let the adept be vigilant! If one wishes to expel the demonic spirits of the Six Heavens, capture and vanquish the poisonous qi of malevolent forces, or destroy and execute talismanic shrines, the adept must secretly practice the great invocatory method of the *Majestic Spirit King*.\n\nFirst, knock the teeth thirty-six times, then visualize the *Radiant Essence Central King* emerging from the *Palace of the Six Harmonies’ Grotto Chamber* within oneself, appearing before the adept’s face, one inch from the nose. The *Radiant Essence Central King* is seven inches tall, wearing a *Luminous Dawn Crown* of plain splendor, clad entirely in white brocade robes. From its mouth issues the qi of *Golden Perfection*, billowing like white clouds. Command this cloudy qi to flow and envelop the four directions, encircling the adept’s body and proceeding forward.\n\nNext, visualize within the white mist a sudden burst of *Vermilion Essence*, resplendent and flying with radiant light, flashing like a shooting star. In an instant, it transforms into hundreds of *Divine Tigers*, leaping forward to tear apart the targeted demonic thieves. Once complete, recite the invocation:\n\n*\"Supreme Illustrious Majesty, Inner Perfected of the Golden Dawn,\nThe Radiant Essence Central King releases qi to capture spirits,\nPreparing the abode of the Profound Void.\nThe Celestial Sovereign commands his vassals;\nRadiant mist flows with luminous brilliance,\nHarmonizing with the Nine Heavens.\nThe majestic text shines forth;\nDivine Tigers open the ford.\nNuminous clouds billow;\nVermilion Essence fans the void.\nSeven transformations of the Textual Adept,\nNine Heavens wield the Perfected.\nWho dares oppose me?\nBeheaded and torn asunder, the evil ones!\nMalevolent trials and demonic villains crushed to dust,\nTen thousand demons annihilated in an instant.\nDual Radiance unites to guard the Majestic King,\nAscending to the Celestial Mornings.\nSupreme Primordial’s wondrous transcendence,\nPreserve my fortune and integrity!\"*\n\nAfter the invocation, knock the teeth thirty-six times again. Only then may one execute and vanquish talismanic demons, subdue the myriad gods, and cause the qi to sweep away cold spirits, capturing and subduing the Six Heavens. Thus, a thousand demons and ten thousand poisons self-destruct before the invocation is even completed.\n\nThis invocation of the *Majestic King* is both wondrous and weighty, treasured by the loftiest perfected beings. Its text is concealed above the *Jade Clarity of the Nine Heavens*, upon the *Western Numinous Terrace of the Supreme Primordial*. The statutes of its sacred prohibition forbid its transmission to the world—unless it is the great method of the *Feathered Register of the Golden Name Kings*.\n\nThose who overflow with dark blessings shall never behold the great method of the *Majestic King*. Only those who ascend to the ranks of the loftiest immortals, becoming ministers of the *Upper Clarity* or guests of the *Imperial Dawn*, may don and bear this talisman. When the adept merely begins the great invocation, the exalted ranks of immortals align their reins, the Celestial Emperor dances in the heavens, the golden perfected hasten as swift couriers, luminous essences seize their attendants, the dark dragon spews its venom, the divine tiger roars to the right, ten thousand demons are beheaded and annihilated, a thousand specters are rebuked and slain. The Six Heavens crumble before it, mountains and peaks bow in audience, jade radiance fills the chambers, purple youths turn their canopies, the Heavenly Sovereign lends his might, the Nine Empyreans attain dark tranquility. Baneful poisons and cold vapors dissolve, water attacks and fire assaults sweep away a thousand billion hills, the Eight Voids surge open. Thus, the spirit is at peace and the qi harmonized, without obstruction or stagnation. The golden luminaries align with the dawn, the numinous immortals unite in accord, and the adept, bearing this divine talisman, receives dark blessings for ten thousand generations.\n\n*The Jade Luminance of the Nine Heavens, Golden Empyrean Majestic Spirit King, Supreme Primordial Great Tiger Talisman*\n\nShould the adept encounter urgent peril or be seized by terror and trembling, let them secretly invoke the name of the *Central King of Luminous Essence* thrice, visualizing the deity as if standing guard to their left and right. Then, a thousand calamities and ten thousand misfortunes shall all be averted, treacherous trials extinguished, and malevolent poisons annihilated. Furthermore, upon retiring each night, let the adept knock their teeth fourteen times and recite the deity’s name, ensuring the hun and po are safeguarded and anchored, corpse-demons sealed away, and nightmares and inauspicious omens dispelled.\n\nThe transmission of this scripture requires master and disciple to face one another in purification for twenty-one days, concluding the transmission at day’s end. The covenant employs plain silk and azure silk, each thirty-seven feet in length, and a pair of golden fish, each weighing one tael, as the ritual implements of the *Supreme Primordial Western Numinous Treasure Prohibition*. These offerings of faith shall be presented at the gates of the Grand Master and Dharma Master to serve the public use of the numinous spirits. Should one privately withhold or embezzle them for personal gain, coveting profit in violation of the celestial statutes and betraying the great trust pledged at the outset of the covenant, the master shall be tormented in the *Northern Dark Prison* by the Seven Mysteries’ ancestors, forever barred from immortal fruition.\n\nThe method for bearing this talisman is as follows: inscribe it in cinnabar on white silk, three feet in length, and encase it in a purple brocade pouch to be worn over the heart. When performing divine invocations, the adept must wear it. Bearing this talisman, the adept commands the spirits of heaven and earth, drives out the cold essences of the Six Heavens, and crushes the malevolent qi of the Nine Demons. The adept’s lifespan extends beyond heaven and earth, their destiny entwined with the loftiest immortals of the *Great Ultimate*. The numinous talisman descends upon their form, and the great method of the *Majestic King* is arrayed. Divine officials bow in reverence, golden warriors provide escort, water and fire alike are traversed unscathed—behold the enduring efficacy! Thus, the Three Officials and the Northern Emperor dare not intrude upon its interstices.\n\nOnce the adept receives the divine scripture, they must treasure and recite it in morning rites, but may not wear it openly among mortals. Should one recklessly divulge the sacred text or reveal the name of the *Majestic King*, the Supreme shall inflict torment upon the Seven Mysteries’ ancestors, and the adept’s soul and embryo shall be devoured by the *Divine Tiger’s* maw, their hun and po sealed in hell, their body and life extinguished by the punishments of water and fire. For seven hundred years, they shall be reborn in the womb of a wart-ridden fetus, afflicted with leprosy, bringing suffering to nine generations of kin. If master or disciple lightly transmits this scripture or recklessly receives it, their punishment shall be the same.\n\nOn the day of ascension to immortality, the adept shall bear the *Huoluo* divine scripture to pay homage at the *Upper Palace*. Inscribe it in cinnabar on white silk, seven feet in length, and fold it to a width of five inches, resembling a sash. Use plain silk or green silk, fourteen feet in length, to fashion a yellow-lined garment, following the talisman’s method, and bind it at the waist. This is the so-called *Phoenix Script Tiger Sash of the Huoluo Seven Primes*. Those who observe prolonged purification shall wear it on days of morning rites.\n\n*The Huoluo Talisman*\n*The Golden Tiger True Talisman of the Celestial Emperor of the Great Subtlety*\n\nThe *Golden Tiger True Talisman of the Celestial Emperor of the Great Subtlety* is concealed within the *Jade Palace of the Supreme Primordial’s Upper Luminance*, guarded by venomous beasts a myriad fathoms deep, striking demons to defend the scriptures. Seven thousand divine tigers stand ready at the Jade Gates, while three hundred *Western Flower Jade Maidens* scatter incense in the celestial courts, and the Five Elders oversee the registers, attending the perfected of the *Golden Dawn*. None but those inscribed in the *Jade Registers* and carved upon the *Three Clarities’* tablets may receive the *Inner Talisman of the Golden Tiger* or hear the *Jade Chapters of the Supreme*.\n\nThis talisman was originally carved within the *Jade Tablets of the Upper Clarity’s Wisdom Chapter*, comprising seven hundred thousand words of numinous sounds and Daoist wonders, their subtle meanings profound and elusive. Some conceal the hidden taboos of heavenly demons, others reveal the inner names of the myriad spirits, while still others resolve obscure allusions and doubts through jade-like tones. The *Lord of Lesser You* extracted this talisman and the method of its inner numinous power to command the spirits of heaven and earth—comprising a mere hundred words. This invocation is wondrously arcane, named the *Three Heavens’ Tiger Script, Supreme Primordial Upper Record*.\n\nThose who receive it must first purify themselves for seventy days, presenting a *Golden Tiger Jade Bell*, thirty feet each of plain silk and dark silk, as the oath of the *Golden Perfected*, swearing a covenant before heaven and earth that it shall not be improperly transmitted. In accordance with the *Bright Statutes of the Four Poles*, one may transmit it to three persons over seven hundred years.\n\nThe *Golden Tiger Jade Essence True Talisman of the Celestial Emperor of the Great Subtlety* is the natural inner fragrance of the *Supreme Primordial’s Upper Luminance Golden Seal*. It commands the golden immortals, seals mountains, summons clouds, terrifies the Six Heavens, and beheads the myriad spirits. The Supreme constantly deploys the *Seventy Thousand of the Western Numinous Great Yi* to guard the talisman within the *Jade Palace of the Great Subtlety*. Those who bear this talisman wield authority over heaven and earth, rebuking and commanding the multitude of spirits, steering luminous dragons, and presiding as high immortals. Once the *Central Jade Tone* resounds, jade radiance attends at their side, golden warriors stand guard, a thousand demons lose their sight, ten thousand ghosts are obliterated, the Nine Demons bow their heads, the Six Heavens collapse, the Dao attains its ultimate perfection, and the spirits gather the Five Numinous. To the left, the dark youths howl; to the right, the *Golden Dawn* is seized. Great indeed is this sacred text, the majestic truth of the Celestial Emperor! It is not merely for dispelling poisons, averting trials, or annihilating demons—it is the wondrous treasure of immortal seeking, the standard of attaining the true.\n\nThe *Right Golden Tiger True Talism* was transmitted by the Celestial Emperor of the Grand Tenuity to the Emperor Lord of the Golden Tower. Inscribe it in cinnabar upon white silk, enclose it in a purple brocade pouch, and wear it upon the head while traveling—thus shall you command heaven and earth and the multitude of spirits, and the immortals shall revere and submit. Jade radiance shall scatter like a turban, celestial soldiers shall guard your body, and mountain warriors shall present their essence. Invoke the incantation of divine authority and the jade-spirit’s decree, and you shall decapitate and rejoice, the Nine Demons shall be vanquished, and a thousand demons shall be obliterated. This is a supreme talisman of the Highest Clarity, not to be disseminated in the world. Whoever wears it shall ascend in flight to the Highest Clarity.\n\nThe *Inner Incantation of the Majestic Divine Power of the Golden Truth of the Supreme Primordial Luminous Scene* is employed to dispatch the divine soldiers of the right, slaying and annihilating evil souls. Upon entering the chamber, burn incense, strike the teeth thirty-six times, and sit or recline at will. Then recite the incantation:\n\n*\"Expel the Poison King of Qian, the Trembling Crimson Banner,\nEight Immortals wielding halberds, the Five Numinous of the Supreme Lord,\nThe Supreme Mystery’s falling radiance, the Seven Dawns guarding the court,\nThe Yellow Truth’s resplendent talisman, flaming bells cast forth,\nDivine tigers bristling with fury, venomous blades wildly displayed,\nThe Purple Effulgent Pattern, four leaping forms bowing in submission,\nThe Nine Heavens and Six Heavens, the Four Heavens’ luminous clarity,\nExternally enwrapped in primordial qi, internally guarded by the master’s soldiers,\nLeftward authority, rightward vigilance, wind’s assault and fire’s campaign,\nRebuking and slaying ten thousand demons, crushing and decapitating a thousand spirits,\nThe Golden Heaven’s majesty trembles.\nThe Nine Demons, their forms seized, are delivered to the Northern Feng,\nCrushed and cast down, adorned for annihilation, all shall collapse.\nI wear the true talisman and thereby command the myriad spirits,\nThe Three Origins proclaim the Dark Convergence of the Emperor’s sincerity,\nThe Supreme Mandate of the Grand Tenuity, ascending to the Three Clarities.\"*\n\nThe method of the *Inner Incantation of the Majestic Divine Power of the Supreme Primordial* is among the forbidden scriptures of the Highest Clarity.\n\nThe *Poison King of Qian* is the esoteric name of a great demon within the Six Heavens.\nThe *Trembling Crimson Banner* is the hidden taboo name of the Demon King of the Northern Emperor.\nThe *Four Heavens’ Luminous Clarity* is the soul-name of the ghost-ministers of the Northern Feng.\nWhoever knows the names of these three demons shall cause a thousand demons to flee in terror, ten thousand ghosts to conceal their forms, and the Nine Demons to be powerless to move. Trials shall be unable to manifest.\n\nWhen dwelling alone in mountains and forests or amidst the spirits and ghosts of talismanic temples, you may proceed with your affairs without needing to burn incense or enter a chamber. Alternatively, inscribe with orpiment upon green silk, three feet in length and one foot two inches in width—or else make it a square of one foot two inches. Outline its edges in cinnabar, and line its interior with red brocade. Wear it upon the right side of the waist. When ascending to the fast, entering the chamber, or attending the morning and evening audiences of the Eight Origins, or when subduing demons, summoning spirits, and commanding divine immortals, wear it and proceed with your affairs. Beware never to approach corpses or impurities, for it is a transgression. Should you divulge this secret, the Ancestor of the Seven Mysteries shall cast you into hell for torture.\n\nThus concludes the *Supreme Scripture of the Majestic Divine King of the Jade Luminance and the Golden Empyrean of the Nine Heavens*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玉景九天金霄威神王祝太元上经 经名：玉景九天金霄威神王祝太元上经。 又名《玉京九天金霄威神玉秘经》。 撰人不详，约出於南北朝。 早期上清派符儿。 一卷。 底本出处：《正统道藏》洞真部方法类。 玉景九天金霄威神王祝太元上经 凡有宿命，应得此文者，皆当盟授，割血为约，信誓九天，然后传之。 依太上西灵之科，听二千二百年中，得传三人。 玉景上元太虎符者，是九天金霄威神王之内灵，合曜二景之宝文也。 道妙极真，炁交上元，玉皇所宝，众帝所尊。 佩之者役景精，升九晨，灭鬼魔，制万神。 见其文者，皆有真仙之挺，延七世之福庆也。 若遭遇师匠启授之后，夏斋苦寂，不交风尘者，乃可带豁落神符，威祝内灵，流焕太虚，感擢三清者耳。 於是神仙伏拜，凶试灭迹，兆命长延於密慎，监者看视功过之所履。 太上恒以西灵大甲七千万人，神虎七千，给卫景精中王，侍文於太元西瑶台焉。 景精中王者，太上金霄威神王之内名也。 能知威神王之名者，则下鬼神，无不伏诺於兆也。 此之神王，则是玉精天元之上灵，神虎金霄之威真也。 是故佩其文则六天威度，秉其符则三官来臣，礼其室则玉华促诣，说其祝则神虎开津。 威落八虚，灵洞九晨，枭馘群魔，奋躩大奸，山岳稽精，河海伏源，啸咤十方，役命神仙，寿同三光，威曜太元，斯诚上清之奇文，景精之威章也。 凡授此神文，必当审择其人。 宿契冥会，果分神仙者，然后请太师口命，法师保举，经师告盟，求神灵之符应，招感气之妙悟，详察微兆以决会，动之机要也。 若不奉太师之命又不承法师之保举，而妄传以为盟者，虽遇其仙之挺，玉名之童，兆之七祖，犹见考於冥科也。 是故不盟而授者，经师当死，魂役於水官，弟子获天火之考。 盟而不者，经师灭於苦道，弟子受鬼魔之化。 所以崇盟信，誓不轻泄也。 是以水火为异天之罚，九魔为苦毒之梁，魂罚胎零，长考太幽，虽优游洞宅，乞请帝灵，然万遍不开其罪，陈愿不闻其辞，七玄长考於地狱焉。 神仙之可期，天科告验，兆慎之哉。 若欲驱除六天之鬼灵，摄伐凶邪之毒炁，及当破诛符庙者，兆秘行威神王大祝之法。 先叩齿三十六通，因存景精中王，从我六合洞房宫中，出於面前，对兆之鼻上，令去鼻一寸。 景精中王形长七寸，素华晨冠，上下皆着素锦衣裳，口吐金真之炁，郁郁然如白云之状。 令白云之气流扇四方之内，皆冠匝兆身而前行也。 又存白烟之中，忽有朱精显焕飞光，激扬如流星之状，於倏欻又变成数百神虎，奋躩前驱，即已摧裂向所捕之鬼贼也。 毕，乃祝曰： 太上明威，金霄内真，景精中王放炁摄神，幽寥备宅，上帝司臣，景烟流曜，洞合九天，威文朗发，神虎开津，灵云郁蔼，朱精虚扇，七化文人，九霄挥真，敢当吾者，馘裂邪身，凶试伏妖奸毒摧泯，万魔一灭，双景合镇俱与威王，上升帝晨，太元奇逸，保我利贞。 祝毕，又叩齿三十六通，然后可以诛伐符魔，制伏万神，炁荡寒灵摄伏六天。 於是千妖万毒，皆已自灭於未祝之前也。 此威王之祝，既已妙重，又是高真所宝。 其文皆藏於九天玉清之上，太元西灵之台。 宝禁之科，不传於世。 自非金名羽籍王之大法也。",
      "translated_text": "*The Jade Radiance Nine Heavens Golden Dawn Majestic Spirit King’s Invocation of the Supreme Primordial: An Upper Scripture*\n\n**Scripture Title:** *The Jade Radiance Nine Heavens Golden Dawn Majestic Spirit King’s Invocation of the Supreme Primordial*. Also known as *The Jade Capital Nine Heavens Golden Dawn Majestic Spirit Jade Secret Scripture*. Author unknown, approximately composed during the Northern and Southern Dynasties. An early Shangqing School talismanic text. One scroll.\n\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, Methods Category.\n\n---\n\nAll who possess karmic destiny and are destined to receive this scripture must first swear an oath, cutting their flesh to seal the covenant, pledging faith before the Nine Heavens, and only then may it be transmitted. According to the statutes of the Supreme Lord of the Western Numinous, within two thousand two hundred years, it may be passed to only three persons.\n\nThe *Jade Radiance Upper Primordial Great Tiger Talisman* is the inner numen of the Nine Heavens Golden Dawn Majestic Spirit King, a sacred text harmonizing the dual radiance of the Two Luminaries. Its Dao is wondrous and perfectly true; its qi intermingles with the Upper Primordial. It is treasured by the Jade Emperor and revered by all the Celestial Sovereigns. Those who wear it command the essence of radiance, ascend the Nine Mornings, annihilate demonic spirits, and subdue the myriad gods. All who behold its text possess the innate endowment of true immortals and extend seven generations of blessed fortune.\n\nOnly after encountering a master who imparts its transmission, observing summer retreats in austere solitude, and severing ties with the mundane world may one don the *Halo of Majestic Spirit Talisman*, invoke the inner numen, and cause its luminous effulgence to suffuse the Great Void, thereby moving the Three Clarities to respond. Thus, divine immortals bow in submission, malevolent trials vanish without trace, and the adept’s destiny is prolonged through vigilant secrecy. Overseers observe and record their deeds and transgressions.\n\nThe Supreme Lord perpetually dispatches seventy million *Western Numinous Great Armor* spirits and seven thousand *Divine Tigers* to escort the *Radiant Essence Central King*, attending the scripture at the *Western Jasper Terrace of the Supreme Primordial*. The *Radiant Essence Central King* is the inner name of the *Supreme Golden Dawn Majestic Spirit King*. Those who know the name of the *Majestic Spirit King* command all lesser spirits and gods, who submit without exception to the adept.\n\nThis *Spirit King* is the supreme numen of the *Jade Essence Heavenly Primordial*, the majestic truth of the *Divine Tiger Golden Dawn*. Thus, wearing its text invokes the awe of the Six Heavens; grasping its talisman summons the Three Officials as vassals; venerating its chamber hastens the arrival of *Jade Splendor*; reciting its invocation opens the ford of the *Divine Tigers*. Its majesty pervades the Eight Voids; its numinosity penetrates the Nine Mornings. It beheads hordes of demons, strikes down great villains, compels mountains and peaks to bow in reverence, and subdues the sources of rivers and seas. With a roar, it commands the ten directions, enslaves divine immortals, bestows a lifespan equal to the Three Luminaries, and radiates majesty across the *Supreme Primordial*. Truly, this is a marvelous text of the *Upper Clarity*, a majestic chapter of the *Radiant Essence*.\n\nWhen transmitting this divine text, one must carefully select the recipient. Only those whose karmic affinity aligns with destiny and whose innate endowment befits immortality may then seek the oral command of the *Grand Master*, the endorsement of the *Dharma Master*, and the covenant of the *Scripture Master*. They must invoke the talismanic response of the spirits, summon the wondrous awakening of qi, scrutinize subtle omens to determine alignment, and act upon the pivotal moment. If one transmits it recklessly without the mandate of the *Grand Master* or the endorsement of the *Dharma Master*, even if the recipient possesses the innate endowment of an immortal, the *Jade Name Youth*, or the seven generations of the adept’s ancestors, they will still face judgment in the netherworld’s statutes.\n\nThus, those who transmit without an oath cause the *Scripture Master* to die, their soul enslaved to the *Water Official*, while the disciple incurs the trial of *Heavenly Fire*. Those who swear an oath but fail to uphold it condemn the *Scripture Master* to perish in the *Path of Suffering*, while the disciple falls prey to demonic transformation. Therefore, the covenant is revered, and the oath must never be lightly broken. For this reason, *Water and Fire* serve as punishments from the *Divergent Heavens*, and the *Nine Demons* become the *Beams of Agony*. The soul suffers the *Punishment of the Womb*, enduring eternal torment in the *Great Darkness*. Though one may wander the grottoes and dwellings, beseeching the numen of the Celestial Sovereigns, even ten thousand repetitions will not absolve their sin, nor will their vows be heard. The *Seven Mysteries* endure eternal torment in hell.\n\nThe attainment of immortality is contingent upon celestial statutes and divine validation—let the adept be vigilant! If one wishes to expel the demonic spirits of the Six Heavens, capture and vanquish the poisonous qi of malevolent forces, or destroy and execute talismanic shrines, the adept must secretly practice the great invocatory method of the *Majestic Spirit King*.\n\nFirst, knock the teeth thirty-six times, then visualize the *Radiant Essence Central King* emerging from the *Palace of the Six Harmonies’ Grotto Chamber* within oneself, appearing before the adept’s face, one inch from the nose. The *Radiant Essence Central King* is seven inches tall, wearing a *Luminous Dawn Crown* of plain splendor, clad entirely in white brocade robes. From its mouth issues the qi of *Golden Perfection*, billowing like white clouds. Command this cloudy qi to flow and envelop the four directions, encircling the adept’s body and proceeding forward.\n\nNext, visualize within the white mist a sudden burst of *Vermilion Essence*, resplendent and flying with radiant light, flashing like a shooting star. In an instant, it transforms into hundreds of *Divine Tigers*, leaping forward to tear apart the targeted demonic thieves. Once complete, recite the invocation:\n\n*\"Supreme Illustrious Majesty, Inner Perfected of the Golden Dawn,\nThe Radiant Essence Central King releases qi to capture spirits,\nPreparing the abode of the Profound Void.\nThe Celestial Sovereign commands his vassals;\nRadiant mist flows with luminous brilliance,\nHarmonizing with the Nine Heavens.\nThe majestic text shines forth;\nDivine Tigers open the ford.\nNuminous clouds billow;\nVermilion Essence fans the void.\nSeven transformations of the Textual Adept,\nNine Heavens wield the Perfected.\nWho dares oppose me?\nBeheaded and torn asunder, the evil ones!\nMalevolent trials and demonic villains crushed to dust,\nTen thousand demons annihilated in an instant.\nDual Radiance unites to guard the Majestic King,\nAscending to the Celestial Mornings.\nSupreme Primordial’s wondrous transcendence,\nPreserve my fortune and integrity!\"*\n\nAfter the invocation, knock the teeth thirty-six times again. Only then may one execute and vanquish talismanic demons, subdue the myriad gods, and cause the qi to sweep away cold spirits, capturing and subduing the Six Heavens. Thus, a thousand demons and ten thousand poisons self-destruct before the invocation is even completed.\n\nThis invocation of the *Majestic King* is both wondrous and weighty, treasured by the loftiest perfected beings. Its text is concealed above the *Jade Clarity of the Nine Heavens*, upon the *Western Numinous Terrace of the Supreme Primordial*. The statutes of its sacred prohibition forbid its transmission to the world—unless it is the great method of the *Feathered Register of the Golden Name Kings*.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1238,
      "start_sentence": 0,
      "end_sentence": 42,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.72440052032471,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉景九天金霄威神王祝太元上经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "玄庆盈溢者，永不见威王之大法也。 唯位登高仙，为上清之公卿，及帝晨之宾者，乃得带佩此符耳。 兆但行大祝之始，则高元列辔，上帝舞霄，金真迅卒，景精摄寮，玄龙吐毒，神虎右号，馘灭万魔，叱斩千妖，六天为之摧落，山岳为之启朝，玉华诣寝，紫童回盖，天皇助威，九霄玄泰，凶毒寒消，水征火伐，千亿丘荡，八虚浪豁。 於是神安炁调，无注无滞，金景齐晨灵仙合契，奉我神符，玄福万世。 玉景九天金霄威神王太元上经大虎符 兆若经履急难，及有惊畏心震之但密呼景精中王名三过，心念其神如如有营护我之左右者，则千灾万祸，无不蒙济，奸试灭凶，妖毒皆亡。 又临卧常叩二七过，并祝念神名，令人魂魄保镇，尸鬼受闭，又除恶梦，去不祥。 夫传授此文经师及弟子对斋，告盟二十一日，日竟授经。 盟用素绮碧罗，各三十七尺，金鱼一双，各重一两，以为太上西灵宝禁之科约也。 此之信物，皆当归奉於太师、法师之门，以营神灵之公用。 若私割以自赡，贪滥以为利，不从天科之约，始衒大信於盟初者，经师七玄之祖，拷于北冥之狱，永无仙果。 带此符之法，以朱书白素，长三尺，以紫锦为囊，盛之於心前，欲行神祝之时，皆当佩之。 兆佩此符，以制天地鬼神，驱伐六天之寒灵，摧戮九魔之凶炁，兆命延长於天地，司高仙於太极，落灵符於形躯，陈威王之大法，神官启拜，金兵辅卫，水火俱过，试观长。 是故三官北帝，莫敢阀其间隙也。 兆既奉受神文，但宝录朝礼而已，不可便佩带於人间也。 若轻泄宝文，及宣露威王之名者，太上皆已拷毒於七玄之祖，见噬於神虎之口，兆之魂胎亦即受闭於地狱，身命俱灭於水火之罚，七百年中，乃更化於疣疵之胞，施恶癞之疾於九宗之亲。 二师轻举其人，弟子妄受其文者，罪亦同此罚也。 若升仙之曰，当带豁落神文，朝谒上宫。 以朱书白素，七尺长，牒辟之，令广五寸，如衣带之状。 以素罗若绿缯一丈四尺，为衣黄夹，亦如符法，带於腰中也。 所谓凤文虎带豁落七元者也。 若长斋之士，朝礼之日，皆佩之。 豁落符 太微天帝君金虎真符 太微天帝君金虎真符，藏于太元上景琼宫，毒兽万寻，击魔卫经，神虎七千，备于玉阙，西华玉女三百人，散香霄庭，五老典籍，金晨侍真。 非有琼录玉名，刻简三清者，皆不得金虎内符，及闻太上之玉篇矣。 此符本刻于上清玉简智慧篇中，有七十万言，灵音道妙、微旨难详，或着天魔隐讳，或表万神内名，或释幽喻疑央于琼音也。 小有王君抄出此符，及威神内文之法，以制天地群灵，有一百言耳。 此祝奇秘，名曰三天虎书太元上录。 受之者先斋七十日，赍金虎玉铃、素锦玄罗各三十尺，以为金真之誓，盟于天地不宜之约。 依四极明科，听使七百年中得传三人。 太微天帝君金虎玉精真符，乃太元上景自然金章之内香也。 以役命金仙，封山召云，威震六天，馘落万神。 太上恒以西灵太甲七十万人，卫符於太微琼宫。 佩此符者，威制天地，呵叱群灵，控驾景龙，位司高仙，中琼音既震则玉华待侧，金真卫兵，千妖丧眸，万鬼灭形，九魔并首，六天摧倾，道妙极真，神裒五灵，左啸玄童。 右摄金晨。 大哉宝文，太帝威真，岂徒辟毒禳试，灭妖而已，乃求仙之妙品，得真之标格。",
      "translated_text": "Those who overflow with dark blessings shall never behold the great method of the *Majestic King*. Only those who ascend to the ranks of the loftiest immortals, becoming ministers of the *Upper Clarity* or guests of the *Imperial Dawn*, may don and bear this talisman. When the adept merely begins the great invocation, the exalted ranks of immortals align their reins, the Celestial Emperor dances in the heavens, the golden perfected hasten as swift couriers, luminous essences seize their attendants, the dark dragon spews its venom, the divine tiger roars to the right, ten thousand demons are beheaded and annihilated, a thousand specters are rebuked and slain. The Six Heavens crumble before it, mountains and peaks bow in audience, jade radiance fills the chambers, purple youths turn their canopies, the Heavenly Sovereign lends his might, the Nine Empyreans attain dark tranquility. Baneful poisons and cold vapors dissolve, water attacks and fire assaults sweep away a thousand billion hills, the Eight Voids surge open. Thus, the spirit is at peace and the qi harmonized, without obstruction or stagnation. The golden luminaries align with the dawn, the numinous immortals unite in accord, and the adept, bearing this divine talisman, receives dark blessings for ten thousand generations.\n\n*The Jade Luminance of the Nine Heavens, Golden Empyrean Majestic Spirit King, Supreme Primordial Great Tiger Talisman*\n\nShould the adept encounter urgent peril or be seized by terror and trembling, let them secretly invoke the name of the *Central King of Luminous Essence* thrice, visualizing the deity as if standing guard to their left and right. Then, a thousand calamities and ten thousand misfortunes shall all be averted, treacherous trials extinguished, and malevolent poisons annihilated. Furthermore, upon retiring each night, let the adept knock their teeth fourteen times and recite the deity’s name, ensuring the hun and po are safeguarded and anchored, corpse-demons sealed away, and nightmares and inauspicious omens dispelled.\n\nThe transmission of this scripture requires master and disciple to face one another in purification for twenty-one days, concluding the transmission at day’s end. The covenant employs plain silk and azure silk, each thirty-seven feet in length, and a pair of golden fish, each weighing one tael, as the ritual implements of the *Supreme Primordial Western Numinous Treasure Prohibition*. These offerings of faith shall be presented at the gates of the Grand Master and Dharma Master to serve the public use of the numinous spirits. Should one privately withhold or embezzle them for personal gain, coveting profit in violation of the celestial statutes and betraying the great trust pledged at the outset of the covenant, the master shall be tormented in the *Northern Dark Prison* by the Seven Mysteries’ ancestors, forever barred from immortal fruition.\n\nThe method for bearing this talisman is as follows: inscribe it in cinnabar on white silk, three feet in length, and encase it in a purple brocade pouch to be worn over the heart. When performing divine invocations, the adept must wear it. Bearing this talisman, the adept commands the spirits of heaven and earth, drives out the cold essences of the Six Heavens, and crushes the malevolent qi of the Nine Demons. The adept’s lifespan extends beyond heaven and earth, their destiny entwined with the loftiest immortals of the *Great Ultimate*. The numinous talisman descends upon their form, and the great method of the *Majestic King* is arrayed. Divine officials bow in reverence, golden warriors provide escort, water and fire alike are traversed unscathed—behold the enduring efficacy! Thus, the Three Officials and the Northern Emperor dare not intrude upon its interstices.\n\nOnce the adept receives the divine scripture, they must treasure and recite it in morning rites, but may not wear it openly among mortals. Should one recklessly divulge the sacred text or reveal the name of the *Majestic King*, the Supreme shall inflict torment upon the Seven Mysteries’ ancestors, and the adept’s soul and embryo shall be devoured by the *Divine Tiger’s* maw, their hun and po sealed in hell, their body and life extinguished by the punishments of water and fire. For seven hundred years, they shall be reborn in the womb of a wart-ridden fetus, afflicted with leprosy, bringing suffering to nine generations of kin. If master or disciple lightly transmits this scripture or recklessly receives it, their punishment shall be the same.\n\nOn the day of ascension to immortality, the adept shall bear the *Huoluo* divine scripture to pay homage at the *Upper Palace*. Inscribe it in cinnabar on white silk, seven feet in length, and fold it to a width of five inches, resembling a sash. Use plain silk or green silk, fourteen feet in length, to fashion a yellow-lined garment, following the talisman’s method, and bind it at the waist. This is the so-called *Phoenix Script Tiger Sash of the Huoluo Seven Primes*. Those who observe prolonged purification shall wear it on days of morning rites.\n\n*The Huoluo Talisman*\n*The Golden Tiger True Talisman of the Celestial Emperor of the Great Subtlety*\n\nThe *Golden Tiger True Talisman of the Celestial Emperor of the Great Subtlety* is concealed within the *Jade Palace of the Supreme Primordial’s Upper Luminance*, guarded by venomous beasts a myriad fathoms deep, striking demons to defend the scriptures. Seven thousand divine tigers stand ready at the Jade Gates, while three hundred *Western Flower Jade Maidens* scatter incense in the celestial courts, and the Five Elders oversee the registers, attending the perfected of the *Golden Dawn*. None but those inscribed in the *Jade Registers* and carved upon the *Three Clarities’* tablets may receive the *Inner Talisman of the Golden Tiger* or hear the *Jade Chapters of the Supreme*.\n\nThis talisman was originally carved within the *Jade Tablets of the Upper Clarity’s Wisdom Chapter*, comprising seven hundred thousand words of numinous sounds and Daoist wonders, their subtle meanings profound and elusive. Some conceal the hidden taboos of heavenly demons, others reveal the inner names of the myriad spirits, while still others resolve obscure allusions and doubts through jade-like tones. The *Lord of Lesser You* extracted this talisman and the method of its inner numinous power to command the spirits of heaven and earth—comprising a mere hundred words. This invocation is wondrously arcane, named the *Three Heavens’ Tiger Script, Supreme Primordial Upper Record*.\n\nThose who receive it must first purify themselves for seventy days, presenting a *Golden Tiger Jade Bell*, thirty feet each of plain silk and dark silk, as the oath of the *Golden Perfected*, swearing a covenant before heaven and earth that it shall not be improperly transmitted. In accordance with the *Bright Statutes of the Four Poles*, one may transmit it to three persons over seven hundred years.\n\nThe *Golden Tiger Jade Essence True Talisman of the Celestial Emperor of the Great Subtlety* is the natural inner fragrance of the *Supreme Primordial’s Upper Luminance Golden Seal*. It commands the golden immortals, seals mountains, summons clouds, terrifies the Six Heavens, and beheads the myriad spirits. The Supreme constantly deploys the *Seventy Thousand of the Western Numinous Great Yi* to guard the talisman within the *Jade Palace of the Great Subtlety*. Those who bear this talisman wield authority over heaven and earth, rebuking and commanding the multitude of spirits, steering luminous dragons, and presiding as high immortals. Once the *Central Jade Tone* resounds, jade radiance attends at their side, golden warriors stand guard, a thousand demons lose their sight, ten thousand ghosts are obliterated, the Nine Demons bow their heads, the Six Heavens collapse, the Dao attains its ultimate perfection, and the spirits gather the Five Numinous. To the left, the dark youths howl; to the right, the *Golden Dawn* is seized. Great indeed is this sacred text, the majestic truth of the Celestial Emperor! It is not merely for dispelling poisons, averting trials, or annihilating demons—it is the wondrous treasure of immortal seeking, the standard of attaining the true.",
      "overlap_context": "thousand demons and ten thousand poisons self-destruct before the invocation is even completed.\n\nThis invocation of the *Majestic King* is both wondrous and weighty, treasured by the loftiest perfected beings. Its text is concealed above the *Jade Clarity of the Nine Heavens*, upon the *Western Numinous Terrace of the Supreme Primordial*. The statutes of its sacred prohibition forbid its transmission to the world—unless it is the great method of the *Feathered Register of the Golden Name Kings*.",
      "start_char": 1238,
      "end_char": 2502,
      "start_sentence": 43,
      "end_sentence": 79,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.88572716712952,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉景九天金霄威神王祝太元上经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "右金虎真符，太微天帝君以传金阙帝君。 朱书白素，请以紫锦囊，佩之头上以行，则制命天地群灵，神仙敬服，玉华散巾，天丁卫躯，山兵稽精，加敕威神之祝，玉精之章，便得馘欣、九魔，千妖灭形矣。 此上清禁符，不传於世，得佩之者，飞升上清。 太元上景金真威神内祝，以役右神兵，斩灭邪魂。 当入室烧香，叩齿三十六通，坐卧任意，乃祝之曰： 辟乾毒王，震拾罗旌，八仙秉钺，上帝五灵，太玄落景，七晨卫庭，黄真曜符，焕掷火铃，神虎奋豪，毒锋乱呈，紫勃文仪，四躩仰呜，九天六天，四天皛晶，外缠玄炁，内守师兵，左威右顾，风伐火征，叱斩万妖，摧馘千精金天威震。 九魔摄形付北酆摧落饰所灭皆倾，我佩真符方役便万灵，三元告鸟玄合帝诚，太微上命，上升三清。 太元上憬威神内祝之法，皆上清之禁经也。 辟乾毒王者，是六天大鬼之内名也。 震拾罗旌者，是北帝魔王之隐讳#1心也。 四天皛晶者，是北酆鬼相之魂名也。 能知三鬼名者，则千妖窜迹，万鬼匿形，九魔莫得而动，试观弗得而陈矣。 山林独处，及在符庙神鬼之中，便可案而行事，不必烧香入室也。 又以雌黄书碧缯，长三尺，广一尺二寸，亦可都方．圆一尺二寸也。 以朱四郭其外，并以丹锦缘厕其裹，带於腰中之右面也。 若一登斋入室，及朝宴八元，并制魔召灵，驱策神真者，便佩而行事也。 慎不可临见尸秽，罪。 同漏泄，七玄之祖，拷于地狱。 玉景九天金霄威神王祝太元上经竟 #1『讳』原作『议』。",
      "translated_text": "The *Right Golden Tiger True Talism* was transmitted by the Celestial Emperor of the Grand Tenuity to the Emperor Lord of the Golden Tower. Inscribe it in cinnabar upon white silk, enclose it in a purple brocade pouch, and wear it upon the head while traveling—thus shall you command heaven and earth and the multitude of spirits, and the immortals shall revere and submit. Jade radiance shall scatter like a turban, celestial soldiers shall guard your body, and mountain warriors shall present their essence. Invoke the incantation of divine authority and the jade-spirit’s decree, and you shall decapitate and rejoice, the Nine Demons shall be vanquished, and a thousand demons shall be obliterated. This is a supreme talisman of the Highest Clarity, not to be disseminated in the world. Whoever wears it shall ascend in flight to the Highest Clarity.\n\nThe *Inner Incantation of the Majestic Divine Power of the Golden Truth of the Supreme Primordial Luminous Scene* is employed to dispatch the divine soldiers of the right, slaying and annihilating evil souls. Upon entering the chamber, burn incense, strike the teeth thirty-six times, and sit or recline at will. Then recite the incantation:\n\n*\"Expel the Poison King of Qian, the Trembling Crimson Banner,\nEight Immortals wielding halberds, the Five Numinous of the Supreme Lord,\nThe Supreme Mystery’s falling radiance, the Seven Dawns guarding the court,\nThe Yellow Truth’s resplendent talisman, flaming bells cast forth,\nDivine tigers bristling with fury, venomous blades wildly displayed,\nThe Purple Effulgent Pattern, four leaping forms bowing in submission,\nThe Nine Heavens and Six Heavens, the Four Heavens’ luminous clarity,\nExternally enwrapped in primordial qi, internally guarded by the master’s soldiers,\nLeftward authority, rightward vigilance, wind’s assault and fire’s campaign,\nRebuking and slaying ten thousand demons, crushing and decapitating a thousand spirits,\nThe Golden Heaven’s majesty trembles.\nThe Nine Demons, their forms seized, are delivered to the Northern Feng,\nCrushed and cast down, adorned for annihilation, all shall collapse.\nI wear the true talisman and thereby command the myriad spirits,\nThe Three Origins proclaim the Dark Convergence of the Emperor’s sincerity,\nThe Supreme Mandate of the Grand Tenuity, ascending to the Three Clarities.\"*\n\nThe method of the *Inner Incantation of the Majestic Divine Power of the Supreme Primordial* is among the forbidden scriptures of the Highest Clarity.\n\nThe *Poison King of Qian* is the esoteric name of a great demon within the Six Heavens.\nThe *Trembling Crimson Banner* is the hidden taboo name of the Demon King of the Northern Emperor.\nThe *Four Heavens’ Luminous Clarity* is the soul-name of the ghost-ministers of the Northern Feng.\nWhoever knows the names of these three demons shall cause a thousand demons to flee in terror, ten thousand ghosts to conceal their forms, and the Nine Demons to be powerless to move. Trials shall be unable to manifest.\n\nWhen dwelling alone in mountains and forests or amidst the spirits and ghosts of talismanic temples, you may proceed with your affairs without needing to burn incense or enter a chamber. Alternatively, inscribe with orpiment upon green silk, three feet in length and one foot two inches in width—or else make it a square of one foot two inches. Outline its edges in cinnabar, and line its interior with red brocade. Wear it upon the right side of the waist. When ascending to the fast, entering the chamber, or attending the morning and evening audiences of the Eight Origins, or when subduing demons, summoning spirits, and commanding divine immortals, wear it and proceed with your affairs. Beware never to approach corpses or impurities, for it is a transgression. Should you divulge this secret, the Ancestor of the Seven Mysteries shall cast you into hell for torture.\n\nThus concludes the *Supreme Scripture of the Majestic Divine King of the Jade Luminance and the Golden Empyrean of the Nine Heavens*.",
      "overlap_context": "en thousand ghosts are obliterated, the Nine Demons bow their heads, the Six Heavens collapse, the Dao attains its ultimate perfection, and the spirits gather the Five Numinous. To the left, the dark youths howl; to the right, the *Golden Dawn* is seized. Great indeed is this sacred text, the majestic truth of the Celestial Emperor! It is not merely for dispelling poisons, averting trials, or annihilating demons—it is the wondrous treasure of immortal seeking, the standard of attaining the true.",
      "start_char": 2503,
      "end_char": 3096,
      "start_sentence": 80,
      "end_sentence": 99,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.597081184387207,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉景九天金霄威神王祝太元上经.txt",
        "category": "方法类"
      }
    }
  ]
}