{
  "source_id": "玉箓生神资度转经仪",
  "source_file": "chunked_daozang\\玉箓生神资度转经仪.json",
  "total_chunks": 21,
  "total_original_chars": 8403,
  "total_translated_chars": 60356,
  "total_translation_time": 326.9713354110718,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**Jade Register Ritual for Generating Divine Spirits and Aiding Transmigration Through Scripture Recitation**\n\n**Scripture Title:** *Jade Register Ritual for Generating Divine Spirits and Aiding Transmigration Through Scripture Recitation*. One fascicle.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan Section*, *Weiyi* (Ritual Propriety) category.\n\n---\n\n**Morning Audience**\nThe master stands in order within the hall.\n\n**Ritual Proceedings**\nKneeling, the officiant declares:\n\n*\"The humble disciple [Name], in full reverence, respectfully invokes:*\n*The Sovereign of the Mysterious Teachings, the Jade Clarity Radiant August Dao Lord;*\n*The Lords of the Three Heavens, the Orthodox Unity Celestial Masters;*\n*The Sovereign of the Numinous Treasure Teachings;*\n*The Perfected Lords of the Scripture Registers and Ordination Masters;*\n*The Great Dharma Masters of the Fast Supervision;*\n*The Perfected Lords of the Left Palace of the Supreme Ultimate;*\n*The Celestial Historians of the Nine Heavens;*\n*The Sovereigns of Human and Heavenly Teachings;*\n*The Perfected Lords of the Floating Canopy and Mount Fengqiu;*\n*And the successive patriarchs of the Pure Subtlety, Numinous Treasure, and Orthodox Unity lineages of the Dao and its virtue.*\n\n*With utmost devotion, I beseech your compassionate gaze to descend and witness this rite. By imperial decree, I now reverently conduct the Jade Register fast, offering this grand purification. Today, leading the assembly, I ascend the altar to recite the* Nine Heavens’ Scripture of Generating Divine Spirits from the *Wondrous Mystery Numinous Treasure* *Jade Chapters*—from the first to the third recitation—praying for the elevation of [Name]’s spirit to ascend into purity, and for the wandering souls to be universally aided in attaining rebirth.*\n\n*Not presuming to act without authorization, I first present this humble petition. May the sacred scroll be established, and may the master’s esoteric guidance illuminate the uninitiated. May the host of Perfected Ones oversee the ordination, as if I were seated in their presence. I dare not offend the master’s solemn dignity; my heart trembles with awe and trepidation.\"*\n\nThe assembly ascends the altar to reverently perform the prescribed rites.\n\n**Chanting the Dao**, they are led to stand in order before the altar.\n\n**Descending Spirit Kings**\n**Ritual Proceedings**\n\n**The Humble Petition of [Rank and Name]**\n\n[Rank and Name] humbly petitions the Ten Directions’ Boundless Flying Heavenly Divine Kings, the Great Sage of Eternal Life and Lord of Limitless Salvation, the Flying Heavenly Envoys, the Flying Heavenly Officers and Soldiers, and all the sacred hosts who guard the scriptures and treasures.\n\nWe have heard that when the Primordial Beginning expounded the scriptures, his merit shone through kalpas vast; when the August Sovereign of Emptiness promulgated the teachings, his grace widely extended to all sentient beings. With reverent intent, we diligently follow and recite with sincere devotion. Completing the ninefold recitation of the *Scripture of the Divine Birth*, we deliver all sunken and stagnant souls. Issuing the writs of destiny’s decree, we universally uplift spiritual consciousness; purifying the offerings of water-plants and fern, we express our utmost sincerity. The ritual assembly, in accordance with the rites, performs the fast and extends the invitation.\n\n**Performing the Fast and Extending the Invitation**\n\nThe Boundless Flying Heavenly Divine King of the Eastern Direction descends to the altar site.\nThe Southern, Western, Northern, Northeastern, Southeastern, Southwestern, Northwestern, Upper, and Lower Directions likewise.\n\nCloud chariots—\nSince the invocation was first made, we imagine the feathered standards lingering, the rainbow banners drifting in the distance. A thousand chariots and ten thousand riders surge forth, filling the sky; nine phoenixes and eight simurghs descend from heaven with resonant cries. We, in utmost devotion, offer pure tea in presentation. With this sincere memorial, we respectfully make it known.\n\n**Proclaiming the Memorial**\n\nThe memorial is read aloud, its words resounding before the sacred audience. May the merit of the ninefold recitation be universally realized, and may all together witness the wonder of the One Vehicle. May divine souls ascend and be delivered, forever transcending into the realm of purity; may suffering spirits receive grace and fully behold the realm of radiant light. We, in boundless reverence, offer this prayer.\n\n**Respectfully submitted.**\n\nAscending the altar,\nOffering incense,\nBowing in faith and devotion.\n\nSilent reverence to the master, contemplating in accordance with the Dharma.\nInvoking the divine incantation:\nSeven numinous spirits conceal their presence, the Three Origins merge in form.\nTransforming yin and transmuting yang, outwardly pure and inwardly luminous.\nPenetrating the Great Harmony, the Nine Palaces gather their essence.\nFlying elixirs flourish in brilliance, refining and delivering through the Eight Gates.\nShedding the mortal coil and repelling death, the seven po dissolve and disperse.\nThe hundred spirits merge as one, and the myriad souls become guests of the Emperor.\n\nStrike the Dharma drum twenty-four times.\n\nO Most Supreme Three Heavens, Mysterious Primordial Three Qi, Supreme Dao Lord,\nsummon forth from within our bodies the Three and Five Merit Officers,\nthe Left and Right Attendants, the Incense-Bearing Golden Lads,\nthe Message-Conveying and Flower-Scattering Jade Maidens,\nthe Five Thearchs’ True Talismans, and the Direct-Day Incense Officials—\nthirty-six each—forth to receive and transmit our words.\n\nWe now, with focused intent, pray that the Primordial Qi of the Supreme Ten Directions’ True and Upright Life descends,\nflowing into our bodies,\nthat our supplications may swiftly reach the presence of the Most High and Perfect Three Treasures,\nthe August Jade Sovereign of the Vast Heaven,\nthe Eastern Ultimate Savior from Suffering, Heavenly Worthy of the Nine Heavens’ Life-Generating Thearch,\nbefore the Dao.\n\nInvoking the Dharma ranks:\n\nWe, your humble servants [Name] and the ritual officers, with unified sincerity,\nrespectfully address and supplicate the Supreme Boundless Great Dao,\nthe Self-So and Natural Primordial Heavenly Worthy of the Origin;\nthe Jade Clarity Dao Lord;\nthe Numinous Treasure Heavenly Worthy;\nthe Supreme Lord Lao;\nthe Heavenly Worthy of the Dao and Its Virtue;\nthe Heavenly Worthy, Primordial Sage Who Governs Heaven;\nthe Heavenly Worthy Who Saves at the Sound of Suffering;\nthe Heavenly Worthy of the Vermilion Mound Who Delivers from Death;\nthe Eastern Flowery Lord Shangxiang, the Azure Lad Dao Lord;\nthe Western Numinous Golden Perfected, the Primordial Mother of the Myriad Qi;\nthe Heavenly Worthies of the Numinous Treasure Who Save from Suffering in the Ten Directions;\nthe Perfected Lords and Elders Who Have Attained the Dao in the Ten Directions;\nthe Life-Generating Thearch of the Nine Heavens;\nthe Thearchs of the Thirty-Two Heavens;\nthe Three Sovereigns and Five Elders;\nthe True Lords of the Five Fortunes and Ten Spirits;\nthe Supreme Clarity Dao Lord of the Golden Watchtower in the Purple Tenuity’s Upper Palace of the Mysterious Capital, Jade Metropolis;\nthe Upper Ministers, Upper Stewards, Upper Protectors, and Upper Instructors;\nthe Four Offices and Five Thearchs;\nthe Boundless Perfected of the Ten Directions;\nthe Divine Immortals of the Thirty-Six Divisions of the Venerable Scriptures;\nthe Sun and Moon of Supreme Clarity, the Five Planets and Four Luminaries;\nthe Southern Asterisms and Northern Dipper;\nthe Myriad Images and Lofty Perfected;\nthe Boundless and Immeasurable Hosts of the Perfected Great Spirits in the Ten Directions;\nthe Jade-Flying Celestial Spirits;\nthe Great Sage of Immeasurable Deliverance Who Grants Eternal Life;\nthe Heavenly Perfected, the Wondrously Practiced True Person;\nthe Great Emperors of the Three Origins;\nthe Nine Heavens’ Inspectors;\nthe Great Dharma Masters of the Mysterious Center;\nthe Great Dharma Masters of the Three Heavens;\nthe True Lords of the Three Masters of the Numinous Treasure;\nthe Star Lords of the Vast Heaven’s Arrayed Constellations;\nthe Lineage Masters of the Pure Tenuity through the Ages;\nthe Divine Officials of the Nine Heavens’ Bureaus;\nthe True Lords of the Four Saints of the Northern Ultimate;\nthe Upper and Lower Palace Lords of the Southern Prosperity, the Vermilion Mound’s Fire Office, and the Yellow Register’s Courtyard;\nthe Three Origins’ True Lords;\nthe True Lords Who Deliver from Death;\nthe True Lords of the Five Offices Who Gather the Hun-Souls of Xingsheng, Duli, Kehan, and Gongdu;\nthe Great Merit Kings of the Three Realms Who Attend the Scriptures and the Five Thearchs;\nthe Jade Lads and Jade Maidens;\nthe Talisman Envoys of the Nine Heavens;\nthe Guardians of the Nine Heavens;\nall the numinous immortals;\nthe Sacred Thearchs of the Five Marchmounts and Five Heavens;\nthe True Lords Who Assist and Govern;\nthe Great Emperor of the Northern Darkness, Fengdu;\nthe Lords of the Nine Ramparts;\nthe Heavenly Lords of the Five Qi;\nthe True Lords of the Ten Palaces;\nthe Hundred and Twenty Offices of the Three Origins’ Palaces and their Examiners and Clerks;\nthe Rulers of the Ten Directions’ Nine Dark Prisons;\nthe Great Emperor of the Water Office, Fusan;\nthe Divine Lord of the Sun Valley;\nthe Water Thearchs of the Nine Rivers;\nthe True Lords of the Twelve Brooks;\nthe Thunder and Rain Deities of the Scriptural Registers;\nthe Divine Generals and Officials;\nthe Mighty Heavenly Enforcers and Punitive Divine Soldiers;\nthe Direct Talisman Officers of the Five Thearchs;\nthe Clerks of the Six Palaces;\nthe Ox-Headed Prison Guards and Horse-Faced Great Spirits;\nthe Courier Officials of the Mysterious Capital’s Reed Dragon Post;\nthe Document-Bearing Lads;\nthe Guardians of the Precepts;\nthe Direct Talismans of the Three Realms;\nthe Merit Officers of the Four Directions;\nthe City Gods and Village Earth Gods;\nthe Incense-Attending Numinous Officials;\nthe Direct Talismans Who Proclaim and Transmit Summons;\nthe Responsive and Perceptive Spirits of the Three Realms;\nall the mighty and numinous beings.\n\nWe have heard that the original chapters of the Numinous Treasure\nencompass the profound mysteries of the hundred demons’ hidden rhymes,\nwhile the wondrous canon of the Cavernous Mystery\nunfolds the majestic ritual of the Nine Heavens’ Life-Generating Thearch.\n\nThe divine merit equals that of Heaven and Earth,\nits vast kindness is true and real—\nthe living and the dead alike receive its grace,\nthis is the supreme model,\nuniversally delivering without end.\n\nNow, in reverent compliance with the imperial edict,\nwe have undertaken the grand jiao of the Jade Register for many days and nights.\nToday, ascending the altar to recite in rotation\nthe *Cavernous Mystery Numinous Treasure Jade Chapters of the Nine Heavens’ Life-Generating Thearch*,\nwe offer ascent and recommendation for the spirit of so-and-so,\nthat they may attain fruition and wander carefree,\nwhile aiding the suffering souls of the departed,\nall equally achieving rebirth in the proper realm.\n\nAs this ritual is solemnly arrayed,\nthe jade caskets are about to be opened.\nWe respectfully present this memorial,\nhumbly beseeching your august observation.\n\nWe pray that the Three Realms’ exalted luminaries,\nthe Nine Heavens’ supreme sages,\nwill together bestow their mysterious blessings,\nuniversally granting vast favor.\nCondescend to descend upon this ritual arena,\nwitnessing our vows and accepting our devotion.\n\nThroughout the ten directions of the Dharma Realm,\nthe six directions of the cosmos,\nthe beings of the Five Paths,\nthe prisons of the Nine Dark Realms—\nmay these merits be universally employed for adornment.\n\nMay it be that the scriptural treasures widely propagate,\nthe gates of darkness cease their trials.\nPure souls receive grace and ascend beyond the Dao’s shore,\nsuffering spirits undergo refinement and forever depart the Yellow Springs.\nGrievances are dissolved,\nthe roots of sin eradicated.\nSwiftly may perfection be achieved in the Dao’s fruit,\nand immediate deliverance attained in the Crimson Palace.\n\nWe bow our heads and take refuge in the boundless Great Dao.\n\n*Respectfully presented by the scripture-attending acolytes:*\n*The Three Refuges.*\n\n**Hymn of Past Lives**\n*Attending the Scripture, Opening the Sutra*\n**Hymn of Seating the Assembly**\n*Silent Contemplation in Accordance with the Dharma*\nIn profound stillness, we reach the ultimate source—\n**Inviting the Turning of the Dharma Wheel**\nThe master inscribes the sutra,\nthe assembly chants its completion.\n*Attending the Scripture, Dedication of Merit*\n**Hymn of Rising from the Seat**\nProceeding in void-step, circling to the Palace of Zi,\noffering incense.\n\nThe master declares:\nWe humbly acknowledge that your station guards the Palace of Kan,\noverseeing the courts of ghosts and spirits;\nyour majestic power, O Spirit of the Zi, holds authority over sin and fortune.\nRadiating through the five qi, you pity the multitudes sunk in suffering.\nToday, in reverent obedience to the imperial decree,\nwe uphold the jade registers in solemn rite,\nascending and recommending the soul of [Name],\nto transcend into purity and stillness,\nwhile aiding the suffering spirits,\nthat all may equally attain rebirth in the realms of life.\n\nNow, the recitation of the sacred verses has been completed in full.\nWe pray that your mysterious grace be abundantly bestowed,\ndelivering the suffering spirits to transcendence.\nMay you deign to receive our earnest supplications\nand grant your saving mercy.\nLet the Three Wretched Paths open to prosperity,\nthe Five Sufferings cease their bitterness.\nMay the dark night brighten with light,\nand all cross to the farther shore.\n\nA memorial is prepared—\nwe shall now proclaim it.\n\n**Proclamation of the Memorial**\nWe reverently invoke the Heavenly Envoy of Youtan,\nBearer of the Tang Talisman,\nto swiftly step forth and receive this official document.\n\n**Proclamation of the Petition**\n[The memorial is] consigned to the flames.\n\n**Assisting the Sutra—Opening the Sutra**\n*Spreading the Seat—Hymn of Praise*\n*Inviting the Turning of the Dharma Wheel*\nThe Master Inscribes the Sutra\nThe Assembly Recites the Sutra to Completion\n*Assisting the Sutra—Dedication of Merit*\n*Chanting While Rising—Procession to the Kun Palace*\nOffering Incense\nThe Master Presents the Memorial\n\nWe humbly recall:\nHere, at the station of the Three,\none abides in the realm of benevolence and stillness.\nThe virtue of Kun flows at its center,\ndisseminating the yang qi of Brahma.\nDelivering beings and benefiting creatures,\nreviving the dead and restoring life.\n\nNow, in reverent compliance with the imperial decree,\nwe solemnly perform the Jade Register rites,\nelevating and recommending the spirit of [Name],\nadvancing them to purity and tranquility,\nextending aid to suffering souls,\nthat all may equally attain rebirth in the realms of life.\n\nThe recitation of the sacred verses has now been completed in full.\nWe respectfully proclaim the decree of grace,\npraying for the deliverance of divine souls.\nMay you deign to descend great compassion\nand heed the pleas of mortals.\nLet the netherworld open to prosperity,\nand the fruits of the Dao be perfected.\n\nA memorial is prepared—\nwe shall now proclaim it.\n\n**Proclamation of the Memorial**\nWe reverently invoke the Celestial Envoy of the Uppermost Meditation,\nBearer of the Liu Talisman of Boundless Longevity,\nto swiftly step forth and receive this official document.\n\n**Proclamation of the Petition**\n[The memorial is] consigned to the flames.\n\n**Assisting the Sutra—Opening the Sutra**\n*Spreading the Seat—Hymn of Praise*\n*Inviting the Turning of the Dharma Wheel*\nThe Master Inscribes the Sutra\nThe Assembly Recites the Sutra to Completion\n*Assisting the Sutra—Dedication of Merit*\n*Chanting While Rising*\n\n**Procession of the Void**\n\nProceeding in circular motion to the *Zhen* Palace, offering incense.\n\n**The Master Recites the Memorial**\n\nWe humbly acknowledge: dwelling in the *Mao* position, all sentient beings bathe in the profound grace; virtue aligning with the *Zhen* Palace, both hidden and manifest draw upon the great transformation. Responding to directions and bearing titles, boundlessly delivering humanity.\n\nToday, in reverent compliance with the imperial decree, we solemnly perform the Jade Register rites, ascending to recommend the soul of [Name], that they may transcend to purity and stillness, while aiding suffering spirits to equally attain the realm of life.\n\nNow, the recitation of the precious scripture has completed its third cycle. We respectfully proclaim the decree of grace, praying for the deliverance of divine souls. May it ascend to the azure heavens, and may compassion descend to heed our sincere plea—witnessing the covenant, opening the path of deliverance, and rescuing the netherworld.\n\nA memorial is prepared—we shall now proclaim it.\n\n**Proclamation of the Memorial**\nWe reverently invoke the Celestial Overseer of the Brahma Realm, Bearer of the Yellow Talisman of the *Xu Yan* Heaven, to swiftly step forth and receive this official document.\n\n**Proclamation of the Petition**\n[The memorial is] consigned to the flames.\n\n**Threefold Recitation of the Sutra**\n**Restoring the Deities—Burning Incense**\n\nImmortal spirits and immortal officials, Golden Lads and Jade Maidens, the Five Emperors and Five Marchmounts, divine immortals and perfected beings, the Three *Qi* True Deities, the Left and Right Dragon-Tiger Lords, celestial and terrestrial immortals, the Five Numinous Incense Officials—we now summon the ten directions’ true *qi*, that the golden liquid elixir, cinnabar mushrooms, and azure herbs may spontaneously arise.\n\nMay the hundred spirits and host of perfected ones gather here before the incense burner. May we, your servants, who study the Dao attain the Dao, and those who seek immortality attain immortality.\n\nMay the jade maidens and immortal lads of the ten directions attend the incense smoke, swiftly conveying the sincerity of our supplications to the supreme and most true Three Treasures, the August Jade Emperor of the Vast Heaven, the Heavenly Worthy of Salvation from the Eastern Extremity, and the Nine Heavens’ Life-Generating Emperor of the Dao.\n\n**Descending the Altar**\n**Thanks to the Master**\n\nYour subordinate, [Name], humbly addresses the Lord of the Mystic Teachings, the Jade Clarity August Sovereign of the Dao, the Three Heavens’ Lord and Master of the Orthodox Unity, the Heavenly Master Perfected Lord; the Lord of the Numinous Treasure Teachings, the Perfected Lord of Scriptures and Ordination; the Great Dharma Master and Overseer of the Retreat; the Perfected Lord of the Left Palace of the Supreme Ultimate; the Perfected Lord of the Grand Historian of the Nine Provinces’ Immortals; the Lord of the Teachings of Heaven and Humankind, the Perfected Lord of Hua Gai and Fu Qiu; and the successive masters of the Orthodox Unity of the Pure Subtlety and Moral Dao.\n\nWe reverently beseech your compassion to graciously accept our gratitude. Just now, ascending the altar, we chanted the Jade Chapters of the Life-Generating Deities of the Nine Heavens, praying for the elevation of the soul of [Name] to purity and stillness, and for the deliverance of all orphaned and hidden spirits of the Dharma realm from the depths of darkness, ascending to the immortal realms.\n\nHaving completed the third recitation under the guidance of the presiding master, we now offer our thanks, trusting that the rite may be brought to perfect fulfillment. May every blessing be bestowed, all entering the gate of life’s deliverance. As the recitation of the scripture remains unfinished, we briefly delay the immortal retinue’s departure.\n\nAt noon, the rites proceed—we shall make further supplications.\n\nOur hearts, in utmost reverence and gratitude, cannot be fully expressed.\n\nRespectfully submitted.\n\n**Thus Concludes**\n\nAt the Hour of Noon, the assembly gathers in the Master’s Hall, arrayed in proper order. The ritual proceedings commence—we kneel to make our supplication.\n\nNow, as the Great Sun shines with radiant clarity, its light suffusing the threefold qi’s hidden depths; as the celestial retinue descends to the mortal realm, we envision the hosts of all heavens assembled in perfect harmony.\n\nWe, your humble disciples [Names], hereby reverently address the Sovereign of the Mystic Teaching, the Jade Clarity August Dao Lord; the Three Heavens’ Sovereign, the Orthodox Unity Celestial Master; the Sovereign of the Numinous Treasure, the Perfected Lord of Scriptures and Ordinations; the Great Dharma Master and Overseer of the Fast; the Perfected Lord of the Left Palace of the Supreme Ultimate; the Perfected Lord and Grand Scribe of the Nine Provinces; the Sovereign of Human and Heavenly Teachings, the Hua Gai Perfected Lord of Floating Hill; and the successive masters of the Qingwei, Lingbao, and Orthodox Unity traditions.\n\nWe humbly beseech your compassion, that you may deign to turn your penetrating gaze upon us.\n\nIn reverent compliance with the sacred edict, we now conduct the grand jiao offering, ascending the altar to recite the *Jade Chapters of the Life-Generating Deities of the Nine Heavens* from the fourth to the sixth passage. We pray for the elevation of the soul of [Name] to the realms of blessedness, and for the deliverance of all orphaned spirits of the Dharma realm from the depths of darkness, ascending to the pure domains.\n\nNot presuming upon our own authority, we make this further supplication.\n\nMay the seven-jeweled platform of the scriptures ever behold the luxuriant splendor of the Purple Void; may the cavern-palaces of the Three Clarities distantly gaze upon the boundless expanse of the Brahma-qi.\n\nWe, your unworthy disciples, dare to trespass upon your august dignity, our hearts overwhelmed with awe and trepidation.\n\nNow, leading the assembly, we ascend the altar to perform the sacred rites in due order.\n\n**Chanting the Dao, we ascend the altar.**\n\nKindling the incense, we offer reverent obeisance and silent veneration to the Master, contemplating in accordance with the ritual.\n\nWe invoke the divine incantation:\nAt the dawn of the Primordial, the Great Mystery first stirred.\nFrom the Void’s extremity, formless, a single qi flowed into shape.\nIt transformed into the Two Radiant Ones, the Five Wefts congealed in essence.\nMerging with the spontaneous, it dissolved the knots of the womb.\nAssembling the perfected, it spread its radiance, resplendent through the Nine Purities.\nThe Flaming Pool expanded in splendor, the Seven Chronograms aligned with the Well.\nWe beseech Master Lu Hao, whose essence illumines the Cinnabar Heavens.\nCrimson light refines and elevates, scarlet mists disperse their brilliance.\nThe Three Flowers flourish in luxuriance, their radiance reflecting upon the Imperial Divine Seat.\n\nStriking the ritual drum twenty-four times.\n\nO Most Supreme Three Heavens, Mysterious Primordial Three Qi, Supreme Dao Lord of the Great Dao:\nSummon forth from within our bodies the Three and Five Merit Officers, the Attendants of the Left and Right, the Golden Lads of Incense, the Jade Maidens of Flower-Scattering and Message-Bearing, the Five Thearchs’ Direct Envoys and the Daily Fragrance Officials—thirty-six each—commanding them to transmit our words.\n\nWe now enter our intention, praying that the Upright Qi of the Ten Directions, the Perfected and True, descend and flow into our bodies, that our supplications may swiftly ascend to the presence of the Most Supreme and Perfect Three Treasures, the August Jade Thearch of the Vast Heaven, the Heavenly Worthy of Salvation from the Eastern Pole, and the Nine Heavens’ Life-Generating Thearch.\n\nAnnouncing the ritual rank:\n\nWe, your humble servants [Name] and the ritual officers, with unified sincerity, reverently address and supplicate the Most Supreme Boundless Dao, the Spontaneous and Natural Primordial Heavenly Worthy of Original Commencement; the Jade Clarity Dao Lord; the Heavenly Worthy of Numinous Treasure; the Most Supreme Lord Lao, the Heavenly Worthy of Dao and Virtue; the Heavenly Worthy of the Primordial Sage Who Governs All; the Heavenly Worthy of Salvation at the Sound of Suffering; the Heavenly Worthy of the Crimson Mound Who Delivers from Mortality; the Azure Lad Dao Lord, Grand Minister of the Eastern Florescence; the Primordial Sovereign Mother of Myriad Qi, the Golden Perfected of the Western Numinosity; the Heavenly Worthies of Salvation and Numinous Treasure in the Ten Directions; the Perfected Lords and Venerable Masters Who Have Attained the Dao in the Ten Directions; the Life-Generating Thearch of the Nine Heavens; the Thearchs of the Thirty-Two Heavens; the Three Sovereigns and Five Elders; the True Lords of the Five Fortunes and Ten Spirits; the Perfected Lord of the Luminous Capital, the Numinous Treasure and Perfect Radiant August Dao Lord of the Seven-Jeweled Mysterious Terrace of the Golden Towers of the Jade Metropolis in the Purple Tenuity Supreme Palace; the Grand Ministers, Grand Stewards, Grand Protectors, and Grand Tutors; the Four Offices and Five Thearchs; the Boundless and Perfect in the Ten Directions; the Divine Immortals of the Thirty-Six Sacred Scriptures; the Perfected of the Supreme Clarity’s Sun and Moon, the Five Planets and Four Luminaries, the Southern Asterism and Northern Dipper, and the Myriad Images of Lofty Perfection; the Boundless and Measureless Grades of Perfect and True Great Spirits in the Ten Directions; the Flying Heavenly Spirit-Kings; the Great Sage of Limitless Salvation Who Grants Eternal Life; the Heavenly Perfected and August Person, the Perfected of Wondrous Conduct; the Three Primordials and Three Officials, the Great Thearchs; the Envoys of Investigation in the Nine Heavens; the Great Dharma Masters of the Mysterious Center; the Great Dharma Masters of the Three Heavens; the Perfected Lords of the Three Masters of Numinous Treasure; the Star Perfected of the Myriad Constellations; the Master Lords of Successive Generations of the Pure Tenuity; the Sacred Worthies of the Nine Heavenly Bureaus; the Four Perfected Lords of the Northern Culmen; the Perfected Lords of the Upper and Lower Palaces of Southern Prosperity, the Crimson Mound Fire Mansion, and the Yellow Register Court; the True Lords Who Deliver from Death; the True Lords of the Five Offices Who Gather the Solitary and Orphaned Souls; the Great Merit Kings of the Three Realms; the Five Thearchs Who Attend the Scriptures; the Jade Lads and Jade Maidens; the Talisman Envoys of the Nine Heavens; the Guardians of the Nine Heavens; all the Numinous Immortals; the Sacred Thearchs of the Five Marchmounts and Five Heavens, the True Lords Who Assist and Govern; the Great Thearch of the Northern Darkness of Fengdu; the Lords of the Nine Ramparts; the Heavenly Lords of the Five Qi; the True Lords of the Ten Palaces; the Hundred and Twenty Bureaus of the Three Primordial Palaces and their Examiners and Clerks; the Wardens of the Prisons in the Nine Glooms of the Ten Directions; the Great Thearch of the Waters’ Mulberry Fields; the Spirit Lord of the Sunrise Valley; the Water Thearchs of the Nine Rivers; the Perfected of the Twelve Brooks; the Divine Officials, Lords, Generals, and Clerks of the Thunder, Rain, and Lightning Departments; the Mighty Heavenly Warriors Who Execute Punishments; the Direct Envoys of the Five Thearchs; the Clerks of the Six Palaces; the Ox-Headed Gaolers and Horse-Faced Great Spirits; the Courier Officials of the Mysterious Metropolis’ Reed Dragon Post; the Lads Who Bear the Tallies; the Guardians of the Precepts; the Direct Envoys of the Three Realms; the Four Direct Merit Officers; the City Gods and Village Deities; the Numinous Officials Who Attend the Incense; the Direct Envoys Who Proclaim and Transmit Commands—may all those responsive to invocation in the Three Realms, all majestic numina, attend and heed.\n\nWe have heard that the Golden Writ of the Three Treasures congeals the wondrous qi of the Empty Mystery, and that the Jade Tablets of the Nine Empyreans conceal the numinous sounds of the Cavernous Void.\n\nWithin, the names blend with the hundred spirits, while the roots of life are shaped and perfected among the ten thousand kinds. Guiding the course of governance, chanting reverence and offering, the nine qi coalesce into form; riding the dawn’s rare yang, penetrating the mysterious numinous, the Seven Origins return their radiance.\n\nVast is the Primal Beginning, congealing the wondrous and void. Moved by the end of the ninefold tread, it pities the responsive convergence of the threefold enclosure. Divine luminance unfolds its mysteries, hidden tones bridge the profound. Above, it opens the light of heaven and earth; below, it measures the transformations of death and life. So subtle it reaches the ultimate of the formless, so elusive it defies surpassing. Gazing upon its towering virtue and power, we exhaust our earnest devotion.\n\nNow, reverently heeding the imperial decree, we have solemnly observed the Jade Register Grand Fast for several days and nights. Today, ascending the altar, we intone the *Nine Heavens’ Life-Giving Divine Chapters of the Cavernous Mystery Numinous Treasure*, offering ascent and presentation for such-and-such a spirit, that they may attain fruition and carefree wandering, while aiding suffering souls and universally fostering life in all directions.\n\nWe humbly pray that compassionate light may illumine the scene, and the darkest depths flow with splendor. May the Jade Terrace release its forbidden script, permitting song and recitation; may the Golden Lattice open its treasured verses, allowing chant and ode. Let the resonant tones ring clear to the nine distances, and the fragrant clarity be heard throughout the Three Realms. Thus may such-and-such a spirit’s nature transcend the gates of death, their qi return to its original root. Riding the jade tones of Great Possession, they shall ascend the jeweled realm of the Wondrous and Non-Being.\n\nWe, your servants, bow our heads in homage and take refuge in the Boundless Great Dao.\n\n*Attending the Scripture, we recite the White Text;*\n*The Three Refuges;*\n*The Praise of Past Lives;*\n*Attending the Scripture, we open the sutra;*\n*The Praise of the Dharma Seat;*\n*Silent contemplation as prescribed;*\n*Requesting the Turning of the Dharma Wheel;*\n*The Master inscribes the sutra;*\n*The assembly recites the sutra to its close;*\n*Attending the Scripture, we dedicate the merit;*\n*The Chant of the Seat’s Dissolution.*\n\nProcession in void-step, circling to the Xun Palace, offering incense.\nThe Master recites the White Text:\n\nWe have heard that this station guards the Xun Palace, corresponding above to the Divine Empyrean’s realm; the Gate of Earth in the Grove of Blessings, connecting below to the boundless expanse of the Dark and Vast. Countless souls are delivered as teachings are established in every quarter.\n\nToday, in reverent compliance with the imperial decree, we perform the rites of the Jade Register, ascending to recommend such-and-such a spirit, advancing them to purity and stillness, universally aiding the suffering souls, that all may equally attain the realm of life.\n\nNow the recitation of the precious scripture has completed its fourth cycle. Respectfully we proclaim the decree of grace, beseeching deliverance for the souls of the dead.\n\nWe humbly pray that you look down with compassion, bestowing the great workings of the mysterious creation. May the true transformation be made manifest, fulfilling our earnest prayers.\n\nA memorial document is prepared; we now proceed to its proclamation.\n\nProclamation of the Memorial.\nWe reverently invite the Silent Penfu Messenger of the Doushu Heaven to swiftly step forth and receive the official document.\n\nProclamation of the Pass.\nBurning and offering.\n\nAttending the Scripture, we open the sutra;\nThe Praise of the Dharma Seat;\nRequesting the Turning of the Dharma Wheel;\nThe Master inscribes the sutra;\nThe assembly recites the sutra to its close;\nAttending the Scripture, we dedicate the merit;\nThe Chant of the Seat’s Dissolution.\n\nProcession in void-step, circling to the Center, offering incense.\nThe Master recites the White Text:\n\nWe have heard that the Dao, like the heavens above, alone governs life and death...\n\nVirtue, like the vaulted heavens, weighs the lightness and heaviness of sin and blessing. In compassion for the wandering souls of the departed, we pray for their deliverance from the dark gates.\n\nNow, in reverent obedience to the sacred edict, we solemnly perform the Jade Register rites, ascending and recommending the spirit of [Name], that they may ascend to purity and stillness, while extending aid to suffering souls, that all may together attain rebirth in the living realm. Today, the recitation of the precious scripture has been completed five times. We present the true talisman and proclaim its decree, praying for the bestowal of gracious blessings and their wide dissemination.\n\nWe humbly beseech that the returning chariot deign to look upon us, responding to each according to their measure. May all those bound in confinement ascend to the heavens of freedom.\n\nA memorial document is prepared; we now proceed to its proclamation.\n\nProclamation of the Memorial.\nWe reverently invite the Undefiled Joy of the Pāramitā Heaven’s Fanfu Messenger to swiftly step forth and receive the official document.\n\nProclamation of the Pass.\nBurning and offering.\n\nAttending the Scripture, we open the sutra;\nThe Praise of the Dharma Seat;\nRequesting the Turning of the Dharma Wheel;\nThe Master inscribes the sutra;\nThe assembly recites the sutra to its close;\nAttending the Scripture, we dedicate the merit;\nThe Chant of the Seat’s Dissolution.\n\nProcession in void-step, circling to the Qian Palace, offering incense.\nThe Master recites the White Text:\n\nWe have heard that majesty aids the workings of heaven, dwelling in the realm of boundless virtue and blessings; virtue expands the movement of the heavens, delivering souls from the hells of countless kalpas. Transformations respond to all heavens, and merits are bestowed without measure.\n\nNow, in reverent obedience to the sacred edict, we solemnly perform the Jade Register rites, ascending and recommending the spirit of [Name], that they may transcend to purity and stillness, while extending aid to suffering souls, that all may together attain rebirth in the living realm. Today, the recitation of the precious scripture has been completed six times. Relying on the profound grace, we proclaim the decree, praying for the vast bestowal of sacred blessings.\n\nWe humbly beseech that the Great Dao extend its compassion, and the divine radiance illuminate all. May the long night be fully enlightened, and all be delivered to the immortal realm.\n\nA memorial document is prepared; we now proceed to its proclamation.\n\nProclamation of the Memorial.\nWe reverently invite the Resonant Transformation of the Dongyuan Heaven’s Zhangfu Messenger to swiftly step forth and receive the official document.\n\nProclamation of the Pass.\nBurning and offering.\n\nUpon the third recitation of the scripture, we restore the deities and burn incense. May the immortal spirits and immortal officials, the Golden Lads and Jade Maidens, the Perfected of the Five Thearchs and Five Marchmounts, the True Persons of the Three Qi, the Lords of the Left and Right Dragon-Tiger, the Heavenly and Earthly Immortals, and the Five Numinous Incense Officials now summon the orthodox qi of the ten directions, that the golden liquid elixir and azure mushroom of immortality may spontaneously arise. Let the hundred numinous hosts of Perfected gather here before the incense burner. May we, your servants, who study the Dao attain the Dao, and those who seek immortality attain immortality. May the Jade Maidens and Immortal Lads of the ten directions attend the incense smoke, conveying the sincerity of our supplications to the Most High and Perfect Three Treasures, the August Jade Thearch of the Vast Heaven, the Heavenly Worthy of Salvation of the Eastern Culmen, and the Ninefold Heavenly Thearch of Life before the Dao.\n\nDescending from the altar, we offer thanks to the master. Though we have not observed the three-day retreat, we have been graced with the fortune of this audience. What we now declare pertains to the Two Mysteries, for the ritual protocols truly derive from the master-disciple transmission. We, your humble servant [Name], now address the Lord of the Dao in the Mystic Realm, the Jade Clarity August Sovereign of the Dao, the Lord of the Three Heavens, the Orthodox Unity Heavenly Master Perfected Lord, the Lord of the Numinous Treasure, the Perfected Lord of the Scriptures and Registers, the Great Dharma Master Perfected Lord who Oversees the Retreat, the Perfected Lord of the Left Palace of the Great Ultimate, the Perfected Lord of the Grand Historian of the Nine Provinces, the Lord of the Teaching of Humans and Devas, the Perfected Lord of the Floating Canopy of Mount Fuqiu, and the successive masters of the Orthodox Unity and Pristine Subtlety traditions. We reverently beseech your compassionate regard and humbly express our gratitude.\n\nWe have just ascended the altar to intone the Jade Chapters of the Nine Heavens’ Life-Generating Scripture, praying for the elevation of the soul of [Name] to purity and stillness, and for the deliverance of all solitary and obscure beings in the dharma-realm from the depths of darkness, that they may ascend to the immortal realm. Through your august support, we have completed six recitations. We now offer our earnest thanks, relying upon your aid to bring this rite to completion. May no detail remain obscure, and may all Perfected Ones oversee the deliverance. As the recitation of the scripture nears its end, we pray for the flourishing of our Dao. At the close of this day, we shall perform the remaining rituals and present our humble devotion. Our hearts are filled with utmost reverence and gratitude.\n\nThus we respectfully declare. As before.\n\nAt the Evening Audience, the masters assemble in the hall in proper order. The ritual proceedings commence; we kneel and declare:\n\nAs the sun pauses in the heavens of all directions, the turning wheel afar listens to the cranes’ songs in the void; as the five-colored clouds interweave, the chariot reverently awaits the phoenix’s cry beneath the feathered canopy. Thrice have we invoked the Venerable Masters, ever adhering to the canonical rites.\n\nWe, your disciples, [Names], in all due reverence, address the Supreme Master of the Mysterious Center, the Jade Clarity August Sovereign of the Dao; the Three Heavens’ Supreme Master, the Orthodox Unity Celestial Master Perfected Lord; the Numinous Treasure Supreme Master, the Perfected Lord of Scriptures and Ordination; the Great Dharma Master Perfected Lord who Oversees the Fast; the Perfected Lord of the Left Palace of the Supreme Ultimate; the Perfected Lord of the Nine Provinces’ Immortal Historiographer; the Supreme Master of Human and Heavenly Teachings, the Perfected Lord Fuqiu of the Flowery Canopy; and all successive Venerable Masters of the Pure Tenuity, Numinous Treasure, and Orthodox Unity traditions.\n\nWe humbly beseech your compassion, that you may deign to turn your penetrating gaze upon us. Now, in reverent compliance with your august decree, we solemnly perform the Jade Register rites to offer and exalt this grand fast. Today, as the assembly ascends the altar to recite the *Nine Heavens’ Life-Generating Jade Chapters of the Cavernous Mystery and Numinous Treasure* from the seventh to the ninth recitation, we pray for the elevation of the soul of [Name] to purity and stillness, and for all solitary spirits in the dharma-realm to together realize their good causes, ascend to Perfection, and attain deliverance. Daring not act on our own, we once more present this declaration. We humbly implore your divine aid to uphold and guide us from beginning to end.\n\nMay we reverently beseech the transmission of the esoteric secrets never imparted to the uninitiated, that the subtle be revealed and the profound be expounded; may the gates of deliverance for the divine souls be flung open, and the radiant light be turned back to guide their return. We await your august command to proclaim and intone the sacred chapters.\n\nDaring to presume beneath the awe of your majesty, we below are overwhelmed with trepidation. Leading the assembly to ascend the altar, we reverently perform the prescribed rites:\n\n**Chanting the Dao, ascending the altar, offering incense, making the pledge, bowing in silence to the masters, and contemplating as prescribed.**\n\nWe invoke the proclamation of the divine incantations—**the Most Supreme Perfected, the Great Sage and Lofty Venerables**—who spread transformation and circulate qi through the Thirty-Two Heavens. The Eight Assemblies and Nine Luminances naturally form their script, stabilizing heaven and earth and safeguarding the kalpas. The primordial mandate of the Originator is universally proclaimed to the Three Primes; below, it commands the Nine Earths, above, it seals the myriad heavens, and in the center, it announces to the seas and mountains, the great peaks and rivers. Today, we make this supreme declaration, and all spirits hear it. As we perform the fast and practice the Dao, we deliver the hidden souls. The Three Officials and Nine Bureaus eradicate their evil roots, forever liberating them from the Three Paths and the source of the Five Sufferings. Generation after generation, they receive blessings, their names inscribed in the cinnabar registers. Their spirits ascend to the heavens, refined and transformed by nature. The gates of life and death are opened for their deliverance, granting them eternal years through countless kalpas. The Nine Heavens’ mandate is transmitted by wind and fire couriers.\n\n**Strike the dharma drum twenty-four times.**\n\n**The Most Supreme Three Heavens’ Mysterious Originator, the Three Qi’s Most High Dao Lord**, summon forth from within our bodies the Three and Five Merit Officers, the Left and Right Attendants, the Incense-Bearing Golden Lads, the Message-Transmitting and Flower-Scattering Jade Maidens, the Five Thearchs’ Direct Envoys, and the Day-Officers of the Incense Bureau—thirty-six of each—to emerge. Let those who emerge be arrayed in solemn attire, and let the words we speak be conveyed without delay.\n\nWe now set our intention, praying that the life-generating qi of the Ten Directions’ Orthodox Perfected may descend and flow into our bodies, so that our supplications may swiftly reach the presence of the **Most Supreme Perfected Three Treasures, the August Jade Thearch of the Vast Heaven, the Heavenly Worthy of the Eastern Ultimate Who Saves from Suffering, and the Nine Heavens’ Life-Generating Thearch of the Dao**.\n\n**Announce the dharma ranks.**\n\nWe, your humble servants, [Name] and the ritual officers, together with utmost sincerity, reverently address the **Most High Limitless Dao, the Void and Spontaneous Originator Heavenly Worthy of Primordial Beginning; the Jade Clarity Dao Lord; the Heavenly Worthy of Numinous Treasure; the Most High Lord Lao, the Heavenly Worthy of Power and Virtue; the Heavenly Worthy Who Governs the Primordial Origin of All Under Heaven; the Heavenly Worthy Who Saves from Suffering at the Sound of a Cry; the Heavenly Worthy of the Cinnabar Mound Who Delivers Lives; the Eastern Florescence Lord of Wood, the Prime Minister Azure Lad Dao Lord; the Western Numinosity Golden Perfection, the Primordial Mother of the Myriad Qi; the Heavenly Worthies of the Ten Directions Who Save from Suffering through Numinous Treasure; the Great Sage Perfected of the Ten Directions Who Have Attained the Dao; the Host of Venerable Perfected Lords and Elders; the Life-Generating Thearch of the Nine Heavens; the Thearchs of the Thirty-Two Heavens; the Three Sovereigns and Five Elders; the True Lords of the Five Fortunes and Ten Spirits; the Dao Lord of the Luminous Perfection of Numinous Treasure, Supreme August Sovereign of the Purple Tenuity’s Upper Palace in the Seven-Treasured Mysterious Terrace of the Jade Capital of the Dark Metropolis; the Prime Ministers, Grand Councillors, Protectors, and Instructors; the Four Offices and Five Thearchs; the Limitless Perfected of the Ten Directions; the Divine Immortals of the Thirty-Six Divisions of Venerable Scriptures; the Nine Luminaries of the Upper Clarity’s Sun and Moon; the Southern Asterisms and Northern Dipper; the Myriad Images’ Lofty Perfected; the Boundless Hosts of the Ten Directions’ Limitless Grades of Perfected Great Spirits; the Flying Heavenly Spirit Kings, the Great Sages of Eternal Life, the Boundless Lords Who Deliver Humanity; the Heavenly Perfected Sovereigns, the Perfected of Wondrous Conduct; the Three Primes and Three Officials Great Emperors; the Nine Heavens’ Investigating Envoys; the Great Dharma Masters of the Mysterious Center; the Great Dharma Masters of the Three Heavens; the Three Masters of Numinous Treasure; the Perfected of the Constellations Arrayed Across the Heavens; the Perfected Masters of Successive Generations of the Orthodox Unity; the Sacred Worthies of the Nine Heavens’ Offices and Bureaus; the Four Sacred Perfected of the Northern Ultimate; the Lords of the Upper and Lower Palaces of Southern Prosperity, the Cinnabar Mound’s Fire Mansion, and the Yellow Register’s Court; the Three Prime True Lords Who Govern the Yellow Register; the True Lords Who Deliver Lives and Grant Immortality; the True Lords of the Five Mansion Who Gather the Solitary Souls of the Departed; the Great Merit Kings of the Three Realms; the Five Thearchs Who Attend the Scriptures; the Jade Lads and Jade Maidens; the Envoys of the Nine Heavens’ Talismans; the Nine Heavens’ Guards; all the numinous immortals; the Sacred Thearchs of the Five Peaks and Five Heavens; the True Lords Who Assist and Govern; the Great Emperor of the Northern Darkness of Fengdu; the Lords of the Nine Ramparts; the Heavenly Lords of the Five Qi; the True Lords of the Ten Palaces; the Hundred and Twenty Offices of the Three Prime Palaces and their Examiners, Clerks, and Scribes; the Rulers of the Ten Directions’ Nine Dark Prisons; the Great Emperor of the Mulberry Tree of the Water Mansion; the Spirit Lord of the Sunrise Valley; the Water Thearchs of the Nine Rivers; the Perfected of the Twelve Brooks; the Divine Officials, Lords, Generals, and Clerks of the Thunder, Lightning, and Rain Departments; the Registers of the Dharma; the Mighty Heavenly Warriors Who Execute Punishments; the Divine Soldiers; the Direct Envoys of the Five Thearchs; the Clerks of the Six Palaces; the Ox-Headed Prison Guards; the Horse-Faced Great Spirits; the Courier Clerks of the Mysterious Metropolis’ Reed Dragon Post; the Lads Who Bear the Documents; the Guardians of the Precepts; the Mighty Spirits; the Direct Envoys of the Three Realms; the Four Direct Merit Officers; the City Gods and Village Earth Gods; the Incense-Attending Numinous Officials; the Direct Envoys Who Proclaim and Transmit Summons; the Responsive and Perceptive Spirits of the Three Realms; and all the majestic numina.**\n\nWe have heard that when the Dragon Han first unfolded its chart, the Jade Vault expanded across the Five Primes; when the Crane’s cry governed the kalpa, golden scriptures wove through the Three Numinous Ones.\n\nAt the inception of Azure Perfection, wondrous tones revolved tenfold; as the Void’s Azure congealed in truth, jade-like sounds resounded nine times. Unfolding divine works through warp and weft, manifesting purple qi amid the dark and yellow. Phoenix-script illumines in circling radiance, jasper towers stand as flying celestials’ guard; dragon-chapters blaze in splendor, the Purple Palace unfolds its treasury of prohibitions’ store. As the compassionate ferry across the sea of suffering, truly the kindling torch upon the darkened thoroughfare. All who offer sincere prayers must rely on the profound grace.\n\nNow, in reverent compliance with the imperial edict, we have solemnly observed the Jade Register Grand Fast for several days and nights. Today, ascending the altar, we chant and intone the *Dongxuan Lingbao Jiutian Shengshen Yuzhang*, ascending to present the spirit of so-and-so, that they may be reborn in the blessed realm above, and that the lonely and hidden below may equally attain the realm of life. We humbly pray that all ten directions be encompassed, all myriad beings be uplifted. May the soul ascend to the jeweled realm, the hidden and forlorn be cleansed in the cold spring. May they, by the true vehicle’s power, swiftly dissolve deluded karma.\n\nWe, your servants, bow our heads in homage, taking refuge in the Boundless Dao.\n\n*Attending the Scriptures: White Text*\n*Three Refuges*\n*Eulogy of Past Lives*\n*Attending the Scriptures: Opening the Sutra*\n*Eulogy for Seating*\n*Silent Contemplation in Proper Form*\n*Request to Turn the Dharma Wheel*\n*Master Inscribes the Sutra*\n*Assembly Recites the Sutra to Completion*\n*Attending the Scriptures: Dedication*\n*Chant Upon Rising from the Seat*\n\nProceeding in void-step, circumambulating to the Palace of Dui, offering incense.\n\n*The Master intones the White Text:*\nWe humbly recall: standing in the Hall of Blessings, one may broadly unfold compassionate transformation; bestowing the grace of Dui’s marsh, one ever universally delivers divine souls. The hidden and manifest receive favor, the living and deceased attain felicity.\n\nToday, reverently heeding the imperial edict, we solemnly perform the Jade Register rites, ascending and recommending the soul of [Name], advancing them to purity and stillness, aiding the suffering and forlorn, that all equally attain the realm of life. Now, the recitation of the precious chapters has completed seven cycles. Overflowing with profound grace, we proclaim and transmit below to the nether courts for enactment.\n\nWe humbly pray that universal compassionate radiance descend, beholding our sincerity. May all swiftly harmonize with beneficent grace, forever relying upon this mercy.\n\nA memorial document is prepared; we now respectfully proclaim it.\n\n*Proclamation of the Memorial*\nWe reverently invoke the Transcendent Brahma-Auxiliary Deva, the Swift Talisman Envoy, to swiftly emerge in ordered ranks and receive this official document.\n\n*Proclamation of the Pass*\nBurning and transformation.\n\n*Attending the Scriptures: Opening the Sutra*\n*Eulogy for Seating*\n*Request to Turn the Dharma Wheel*\n*Master Inscribes the Sutra*\n*Assembly Recites the Sutra to Completion*\n*Attending the Scriptures: Dedication*\n*Chant Upon Rising from the Seat*\n\nProceeding in void-step, circumambulating to the Gate of Gen, offering incense.\n\n*The Master intones the White Text:*\nWe humbly recall: dwelling in the Gen position, one presides over the august Palace of Numinous Treasure; virtue governs the Ghost Gate, diffusing the qi of boundless space. Bestowing the great power of rebirth, extending the divine efficacy of revivification.\n\nToday, reverently heeding the imperial edict, we solemnly perform the Jade Register rites, ascending and recommending the soul of [Name], advancing them to purity and stillness, aiding the suffering and forlorn, that all equally attain the realm of life. Now, the recitation of the precious chapters has completed eight cycles. Respectfully proclaiming the decree of grace, we pray for the deliverance of divine souls.\n\nWe humbly pray for the special bestowal of divine radiance, that they harmonize with the decree of deliverance. May the stagnant and lingering souls be liberated, the deceased be elevated. Spared from sinking into the Nine Nether Realms, may they transcend the Three Realms.\n\nA memorial document is prepared; we now respectfully proclaim it.\n\n*Proclamation of the Memorial*\n\nWe reverently invoke the Celestial Envoy of the High Void and Luminous Heavens, hasten forth from your ranks, and respectfully receive this official document.\n\n*Proclamation of the Memorial*\n*Burning of the Document*\n*Attendants prepare the scriptures*\n*Opening of the scriptures*\n*Arrangement of the ritual seats*\n*Chanting of the praises*\n*Invocation to turn the Wheel of the Dharma*\n*The master inscribes the scriptures*\n*The assembly completes the recitation*\n*Attendants dedicate the merit*\n*Chanting of the closing hymn*\n*Procession in the Void-Stepping Rite*\nProceeding to the Southern Palace, we offer incense.\n\nThe master presents the memorial:\n\nWe humbly acknowledge that the radiant virtue of the Southern Palace governs the authority over life and death; its transformative teachings of the Southern Realm weigh the balance of sin and blessing. May all who suffer in the depths of sinking receive the grace of liberation.\n\nToday, reverently heeding the imperial edict, we solemnly perform the Jade Register rites, ascending and recommending the soul of [Name], advancing them to purity and stillness, aiding the suffering and forlorn, that all equally attain the realm of life. Now, the recitation of the precious chapters has completed nine cycles. We broadly proclaim the profound grace, that it be honored and enacted in the Nether Realms below.\n\nWe humbly pray that, embodying the Divine Emperor’s love for life, great compassion be extended to save the afflicted. May divine souls be delivered from the Nine Nights, and the forlorn spirits pass through the layered barriers.\n\nA memorial document is prepared; we now respectfully proclaim it.\n\n*Proclamation of the Memorial*\n\nWe reverently invoke the Celestial Envoy of the Heaven of No-Thought, No-Attachment, and No-Desire, hasten forth from your ranks, and respectfully receive this official document.\n\n*Proclamation of the Memorial*\n*Burning of the Document*\n\nUpon attending the sutra, sighing the sutra, and thrice hearing the sutra,\nthe master gathers the sutra with praise—\ngathering the sutra to attain the Dao, following mindfulness to rebirth.\nBoundless mysterious merit, limitless grace and blessings.\nWe humbly pray to dissolve karmic entanglements of the past,\nand meet conditions for the future.\nMay none fall into the Three Wretched Realms,\nand all be freed from the Eight Difficulties.\nWe bow our heads in reverence, taking refuge in the supreme Dao-Treasure.\nGathering the sutra to attain the Dao, following mindfulness to rebirth.\nMeasureless vast grace, boundless sagely power.\nWe humbly pray that the wheel of rebirth be stilled,\nand the bonds of karmic entanglement forever severed.\nMay the dark realms shine with radiance,\nand divine souls undergo refinement.\nWe bow our heads in reverence, taking refuge in the supreme Sutra-Treasure.\nGathering the sutra to attain the Dao, following mindfulness to rebirth.\nInfinite good affinity, inexhaustible wondrous power.\nWe humbly pray that the Four Offices flow without obstruction,\nand the Nine Bureaus silently communicate.\nMay souls ascend the Vermilion Mound,\nand spirits wander the Purple Palace.\nWe bow our heads in reverence, taking refuge in the supreme Master-Treasure.\n\nReturning the spirits and burning incense.\nCelestial spirits and officials, golden lads and jade maidens,\nthe Five Emperors and Five Peaks’ immortals and perfected,\nthe Three Qi’s true deities, the Left and Right Dragon-Tiger Lords,\nheavenly immortals and earthly immortals, the Five Numinous Incense Officials—\nnow summon and gather the ten directions’ true qi,\nnaturally giving rise to golden liquid, cinnabar, and azure mushrooms.\nThe hundred numinous perfected hosts converge here,\nbefore the incense burner.\nMay your servant study the Dao and attain the Dao,\nseek immortality and attain immortality.\nMay the ten directions’ immortal lads and jade maidens\nattend the incense smoke,\nand swiftly convey the sincerity of your servant’s earlier entreaties\ndirectly to the presence of the Supreme Perfected Three Treasures,\nthe Jade Emperor of the Vast Heaven,\nthe Heavenly Worthy of Eastern Relief from Suffering,\nand the Nine Heavens’ Life-Generating Emperor of the Dao.\n\nGiving thanks to the divine kings.\nReiterating the dharma-ranks,\nyour servant, [Name], humbly addresses the ten directions’ boundless flying celestial divine kings and envoys,\nthe flying celestial officials and soldiers, the sagely hosts.\nWe reverently gaze upon the auspicious light,\nhumbly awaiting your penetrating insight.\nFor the ninefold recitation of the Life-Generating Scripture,\nwe rely entirely upon the grace of reverent chanting;\nthrough the Three Vehicles’ expounding of wonders,\nwe fully inherit the merit of opening and pardoning.\nYesterday, in reverent compliance with the imperial decree,\nwe solemnly performed the Jade Register Great Retreat,\nascending and recommending the spirit of [Name],\nto rise to the realm of blessings,\nand broadly aiding the forlorn souls to equally attain the realm of life.\nEarlier, leading the assembly to ascend the altar,\nwe turned and chanted the *Nine Heavens’ Life-Generating Jade Chapters of the Numinous Treasure of the Cavernous Mystery*,\ncompleting nine cycles.\nWithout the sagely creation, how could perfection be achieved?\nWe exhaust our humble devotion, redoubling our sincerity.\nThe memorial document was recited with reverence,\nand respectfully proclaimed in full.\nProclamation of the Memorial.\nProclamation of the Pass.\nThe memorial document has been proclaimed;\nwe trust it reaches your profound wisdom.\nWe humbly pray that you oversee the deliverance of beings,\nand, hearing their cries, hasten to save the suffering;\nthat you turn your radiant chariot and return,\nfulfilling our prayers to deliver the world.\nWe cannot express our reverence,\nnor our longing.\nWe, [Names], bow again in reverent devotion,\nand with one heart, respectfully send you forth.\nRetreat concluded.\nCloud chariots depart.\n\nUpon the conclusion of the offering by fire,\nwe, your humble servants [Names], in our proper ranks,\nrespectfully address the Sovereign of the Mystic Teaching of the Cavernous Mystery,\nthe Jade Clarity August Emperor Dao Lord,\nthe Three Heavens’ Sovereign and Orthodox Unity Celestial Master Perfected Lord,\nthe Sovereign of the Numinous Treasure and Perfected Lord of the Canonical Preceptor,\nthe Perfected Lord Great Dharma Master Supervising the Retreat,\nthe Perfected Lord Immortal Duke of the Left Palace of the Supreme Ultimate,\nthe Perfected Lord Grand Scribe of the Nine Provinces’ Immortals,\nthe Sovereign of the Teaching for Humans and Devas and Perfected Lord Fuqiu of the Canopy,\nand the successive preceptor lords of the Pure Tenuity, Numinous Treasure, Dao Virtue, and Orthodox Unity traditions.\n\nWe reverently beseech your compassionate regard,\nthat you deign to turn your penetrating insight upon us.\nWe, having ascended the altar and recited the *Jade Chapters of the Nine Heavens’ Life-Generating Numinous Treasure of the Cavernous Mystery*,\nhave ascended and recommended the spirit of [Name],\nadvancing it to the realm of blessedness,\nextending aid to the suffering and departed,\nand universally guiding all toward the attainment of life’s true domain.\nThrough your sovereign oversight,\nthe nine cycles have been completed.\nYet we fear the unsettled state of form and spirit,\nand dread the errors that may arise in thought and intention.\nWe humbly implore your forbearance,\nthat the good fruit may be brought to fulfillment.\n\nWe pray that the imperial presence remain unwavering,\nand that Heaven incline its will toward us.\nMay those receiving rebirth be delivered,\ntheir souls all freed from the dark yin realms;\nmay responsive encounters with the numinous be fulfilled,\nand the work of perfect harmony be wholly achieved.\nWe presume upon your august severity,\nand in our lowly devotion,\nare overwhelmed with awe and reverent gratitude.\nThus we respectfully submit.\n\nRetreat concluded.\n\nThe Rite of the Cloud Chariot and the Jade Register for the Nurturance of Life through the Recitation of Transformative Scriptures is now concluded.\n*(Note: \"Jade\" (玉) was originally written as \"King\" (王), an error corrected here in accordance with the context.)*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玉箓生神资度转经仪 经名：玉箓生神资度转经仪。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 玉箓生神资度转经仪 早朝 师堂序立 法事 跪启 具位臣姓某上启玄中教主、玉虚明皇道君，三天教主、正一天师真君，灵宝教主，经籍度师真君，监斋大法师真君，太极左宫仙公真君，九天都仙太史真君，人天教主，华盖浮丘真君，清微灵宝道德正一历代师尊。 恭望师慈，俯回洞鉴。 臣今钦奉纶音，崇修玉箓，荐扬大斋。 以今领众升坛转咏，洞玄灵宝九天生神玉章，第一过至第三过，祈恩升荐某灵进登清静，旁资孤爽，均证生方。 未敢自专，先伸启告。 伏愿一卷必立，师密授启蒙之训； 众真监度，我犹如侍坐之时。 干冒师严，臣等下情不胜惶惧之至。 领众升坛，恭行典式。 唱道，引至坛前序立 降神王 法事",
      "translated_text": "**Jade Register Ritual for Generating Divine Spirits and Aiding Transmigration Through Scripture Recitation**\n\n**Scripture Title:** *Jade Register Ritual for Generating Divine Spirits and Aiding Transmigration Through Scripture Recitation*. One fascicle.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan Section*, *Weiyi* (Ritual Propriety) category.\n\n---\n\n**Morning Audience**\nThe master stands in order within the hall.\n\n**Ritual Proceedings**\nKneeling, the officiant declares:\n\n*\"The humble disciple [Name], in full reverence, respectfully invokes:*\n*The Sovereign of the Mysterious Teachings, the Jade Clarity Radiant August Dao Lord;*\n*The Lords of the Three Heavens, the Orthodox Unity Celestial Masters;*\n*The Sovereign of the Numinous Treasure Teachings;*\n*The Perfected Lords of the Scripture Registers and Ordination Masters;*\n*The Great Dharma Masters of the Fast Supervision;*\n*The Perfected Lords of the Left Palace of the Supreme Ultimate;*\n*The Celestial Historians of the Nine Heavens;*\n*The Sovereigns of Human and Heavenly Teachings;*\n*The Perfected Lords of the Floating Canopy and Mount Fengqiu;*\n*And the successive patriarchs of the Pure Subtlety, Numinous Treasure, and Orthodox Unity lineages of the Dao and its virtue.*\n\n*With utmost devotion, I beseech your compassionate gaze to descend and witness this rite. By imperial decree, I now reverently conduct the Jade Register fast, offering this grand purification. Today, leading the assembly, I ascend the altar to recite the* Nine Heavens’ Scripture of Generating Divine Spirits from the *Wondrous Mystery Numinous Treasure* *Jade Chapters*—from the first to the third recitation—praying for the elevation of [Name]’s spirit to ascend into purity, and for the wandering souls to be universally aided in attaining rebirth.*\n\n*Not presuming to act without authorization, I first present this humble petition. May the sacred scroll be established, and may the master’s esoteric guidance illuminate the uninitiated. May the host of Perfected Ones oversee the ordination, as if I were seated in their presence. I dare not offend the master’s solemn dignity; my heart trembles with awe and trepidation.\"*\n\nThe assembly ascends the altar to reverently perform the prescribed rites.\n\n**Chanting the Dao**, they are led to stand in order before the altar.\n\n**Descending Spirit Kings**\n**Ritual Proceedings**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 341,
      "start_sentence": 0,
      "end_sentence": 20,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.553693771362305,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "具位某上启十方无极飞天神王、长生大圣无量度人君，飞天使者，飞天吏兵，侍卫经宝一切圣众。 伏闻，元始说经，功昭垂於浩劫； 虚皇演教，泽广被於含灵。 某恪意遵行，志心持诵。 周九过生神之典，度一切沈滞之魂。 颁行符命之文，普超灵识； 蠲洁苹蘩之荐，用表忱诚。 法众如仪，修斋奉请。 修斋奉请 东方无极飞天神王降临坛所， 南方，西方，北方，东北，东南，西南，西北，上方，下方。 云舆 向来启请，伏想羽节徘徊，霓旌缥缈。 千乘万骑，勃勃浮空而来； 九凤八鸾，嗈嗈自天而下。 某等无任虔恭，净茶上献。 具有诚疏，谨用披宣。 宣疏 焚化 疏文披露，圣听昭回。 愿周九转之功，共证一乘之妙。 神魂升度，永超清静之乡； 苦爽沾恩，尽睹光明之境。 某等不胜虔祷之至。 谨言。 升坛 上香 信礼",
      "translated_text": "**The Humble Petition of [Rank and Name]**\n\n[Rank and Name] humbly petitions the Ten Directions’ Boundless Flying Heavenly Divine Kings, the Great Sage of Eternal Life and Lord of Limitless Salvation, the Flying Heavenly Envoys, the Flying Heavenly Officers and Soldiers, and all the sacred hosts who guard the scriptures and treasures.\n\nWe have heard that when the Primordial Beginning expounded the scriptures, his merit shone through kalpas vast; when the August Sovereign of Emptiness promulgated the teachings, his grace widely extended to all sentient beings. With reverent intent, we diligently follow and recite with sincere devotion. Completing the ninefold recitation of the *Scripture of the Divine Birth*, we deliver all sunken and stagnant souls. Issuing the writs of destiny’s decree, we universally uplift spiritual consciousness; purifying the offerings of water-plants and fern, we express our utmost sincerity. The ritual assembly, in accordance with the rites, performs the fast and extends the invitation.\n\n**Performing the Fast and Extending the Invitation**\n\nThe Boundless Flying Heavenly Divine King of the Eastern Direction descends to the altar site.\nThe Southern, Western, Northern, Northeastern, Southeastern, Southwestern, Northwestern, Upper, and Lower Directions likewise.\n\nCloud chariots—\nSince the invocation was first made, we imagine the feathered standards lingering, the rainbow banners drifting in the distance. A thousand chariots and ten thousand riders surge forth, filling the sky; nine phoenixes and eight simurghs descend from heaven with resonant cries. We, in utmost devotion, offer pure tea in presentation. With this sincere memorial, we respectfully make it known.\n\n**Proclaiming the Memorial**\n\nThe memorial is read aloud, its words resounding before the sacred audience. May the merit of the ninefold recitation be universally realized, and may all together witness the wonder of the One Vehicle. May divine souls ascend and be delivered, forever transcending into the realm of purity; may suffering spirits receive grace and fully behold the realm of radiant light. We, in boundless reverence, offer this prayer.\n\n**Respectfully submitted.**\n\nAscending the altar,\nOffering incense,\nBowing in faith and devotion.",
      "overlap_context": "etition. May the sacred scroll be established, and may the master’s esoteric guidance illuminate the uninitiated. May the host of Perfected Ones oversee the ordination, as if I were seated in their presence. I dare not offend the master’s solemn dignity; my heart trembles with awe and trepidation.\"*\n\nThe assembly ascends the altar to reverently perform the prescribed rites.\n\n**Chanting the Dao**, they are led to stand in order before the altar.\n\n**Descending Spirit Kings**\n**Ritual Proceedings**",
      "start_char": 341,
      "end_char": 687,
      "start_sentence": 21,
      "end_sentence": 48,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.107913732528687,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "默礼师，存念如法 请宣神咒 七灵隐神，三元混形。 变阴化阳，外清内明。 洞彻太和，九宫摄英。 飞丹郁秀，炼度八门。 脱胎却死，七魄散分。 百神混合，兆为帝宾。 鸣法鼓二十四通 无上三天玄元始三炁太上道君，召出臣等身中三五功曹、左右官使者、侍香金童、传言散花玉女、五帝真符直日香官，各三十六人出，关启所言。 臣今入意愿得太上十方正真生炁下降，流注臣等身中。 令臣所启二速达径御无上至真三宝昊天玉#1皇上帝、东极救苦天尊九天生神上帝道前。 请称法位 具位臣姓某与礼官等，谨同诚上启太上无极大道虚无自然元始天尊，玉宸道君、灵宝天尊、太上老君、道德天尊，统天元圣天尊，寻声救苦天尊，朱陵度命天尊、东华木公上相青童道君，西灵金真万炁祖母元君，十方灵宝救苦天尊，十方已得道至真诸君丈人，九天生神上帝，三十二天上帝，三皇五老上帝，五福十神真君，东华南极西灵北真玄都玉京金阙七宝玄台紫微上官灵宝至真明皇道君，上相上宰、上保上傅、四司五帝、十方无极至真，三十六部尊经神仙，上清日月、五星四曜、南辰北斗、万象高真，十方无极无量品至真大神，飞天神玉，长生大圣无量度人君，天真皇人妙行真人，三元三官大帝，九天采访使者，玄中大法师，三天大法师、灵宝三师真君，广天列宿星君，清微历代宗师，九天天曹诸司上圣，北极四圣真君，南昌上下宫朱陵火府黄箓院主宰三元真君，度人不死诸位真君，兴生独隶可韩功都聚魂五府真宰，三界大勋魔王侍经五帝，玉童玉女，九天符使，九天侍卫，一切灵仙，五岳五天圣帝、储副佐理真君，北阴酆都大帝，九垒帝君，五炁天君，十宫真君，三元宫府百二十曹、考官掾吏，十方九幽诸狱主者，水府榑桑大帝，旸谷神君，九江水帝，十二溪真雷霆雨部神祇夫箓、官君将吏，巨天力士执罚神兵、五帝直符、六宫掾吏、牛头狱卒、马面大神、玄都茭龙驿吏、赍简童子、护戒威神、三界直符、四直功曹、城隍里社正神、侍香灵官、直符宣通召命，三界应感，一切威灵。 臣闻，灵宝本章，总百魔隐韵之玄奥； 洞玄妙典，敷九天生神之威仪。",
      "translated_text": "Silent reverence to the master, contemplating in accordance with the Dharma.\nInvoking the divine incantation:\nSeven numinous spirits conceal their presence, the Three Origins merge in form.\nTransforming yin and transmuting yang, outwardly pure and inwardly luminous.\nPenetrating the Great Harmony, the Nine Palaces gather their essence.\nFlying elixirs flourish in brilliance, refining and delivering through the Eight Gates.\nShedding the mortal coil and repelling death, the seven po dissolve and disperse.\nThe hundred spirits merge as one, and the myriad souls become guests of the Emperor.\n\nStrike the Dharma drum twenty-four times.\n\nO Most Supreme Three Heavens, Mysterious Primordial Three Qi, Supreme Dao Lord,\nsummon forth from within our bodies the Three and Five Merit Officers,\nthe Left and Right Attendants, the Incense-Bearing Golden Lads,\nthe Message-Conveying and Flower-Scattering Jade Maidens,\nthe Five Thearchs’ True Talismans, and the Direct-Day Incense Officials—\nthirty-six each—forth to receive and transmit our words.\n\nWe now, with focused intent, pray that the Primordial Qi of the Supreme Ten Directions’ True and Upright Life descends,\nflowing into our bodies,\nthat our supplications may swiftly reach the presence of the Most High and Perfect Three Treasures,\nthe August Jade Sovereign of the Vast Heaven,\nthe Eastern Ultimate Savior from Suffering, Heavenly Worthy of the Nine Heavens’ Life-Generating Thearch,\nbefore the Dao.\n\nInvoking the Dharma ranks:\n\nWe, your humble servants [Name] and the ritual officers, with unified sincerity,\nrespectfully address and supplicate the Supreme Boundless Great Dao,\nthe Self-So and Natural Primordial Heavenly Worthy of the Origin;\nthe Jade Clarity Dao Lord;\nthe Numinous Treasure Heavenly Worthy;\nthe Supreme Lord Lao;\nthe Heavenly Worthy of the Dao and Its Virtue;\nthe Heavenly Worthy, Primordial Sage Who Governs Heaven;\nthe Heavenly Worthy Who Saves at the Sound of Suffering;\nthe Heavenly Worthy of the Vermilion Mound Who Delivers from Death;\nthe Eastern Flowery Lord Shangxiang, the Azure Lad Dao Lord;\nthe Western Numinous Golden Perfected, the Primordial Mother of the Myriad Qi;\nthe Heavenly Worthies of the Numinous Treasure Who Save from Suffering in the Ten Directions;\nthe Perfected Lords and Elders Who Have Attained the Dao in the Ten Directions;\nthe Life-Generating Thearch of the Nine Heavens;\nthe Thearchs of the Thirty-Two Heavens;\nthe Three Sovereigns and Five Elders;\nthe True Lords of the Five Fortunes and Ten Spirits;\nthe Supreme Clarity Dao Lord of the Golden Watchtower in the Purple Tenuity’s Upper Palace of the Mysterious Capital, Jade Metropolis;\nthe Upper Ministers, Upper Stewards, Upper Protectors, and Upper Instructors;\nthe Four Offices and Five Thearchs;\nthe Boundless Perfected of the Ten Directions;\nthe Divine Immortals of the Thirty-Six Divisions of the Venerable Scriptures;\nthe Sun and Moon of Supreme Clarity, the Five Planets and Four Luminaries;\nthe Southern Asterisms and Northern Dipper;\nthe Myriad Images and Lofty Perfected;\nthe Boundless and Immeasurable Hosts of the Perfected Great Spirits in the Ten Directions;\nthe Jade-Flying Celestial Spirits;\nthe Great Sage of Immeasurable Deliverance Who Grants Eternal Life;\nthe Heavenly Perfected, the Wondrously Practiced True Person;\nthe Great Emperors of the Three Origins;\nthe Nine Heavens’ Inspectors;\nthe Great Dharma Masters of the Mysterious Center;\nthe Great Dharma Masters of the Three Heavens;\nthe True Lords of the Three Masters of the Numinous Treasure;\nthe Star Lords of the Vast Heaven’s Arrayed Constellations;\nthe Lineage Masters of the Pure Tenuity through the Ages;\nthe Divine Officials of the Nine Heavens’ Bureaus;\nthe True Lords of the Four Saints of the Northern Ultimate;\nthe Upper and Lower Palace Lords of the Southern Prosperity, the Vermilion Mound’s Fire Office, and the Yellow Register’s Courtyard;\nthe Three Origins’ True Lords;\nthe True Lords Who Deliver from Death;\nthe True Lords of the Five Offices Who Gather the Hun-Souls of Xingsheng, Duli, Kehan, and Gongdu;\nthe Great Merit Kings of the Three Realms Who Attend the Scriptures and the Five Thearchs;\nthe Jade Lads and Jade Maidens;\nthe Talisman Envoys of the Nine Heavens;\nthe Guardians of the Nine Heavens;\nall the numinous immortals;\nthe Sacred Thearchs of the Five Marchmounts and Five Heavens;\nthe True Lords Who Assist and Govern;\nthe Great Emperor of the Northern Darkness, Fengdu;\nthe Lords of the Nine Ramparts;\nthe Heavenly Lords of the Five Qi;\nthe True Lords of the Ten Palaces;\nthe Hundred and Twenty Offices of the Three Origins’ Palaces and their Examiners and Clerks;\nthe Rulers of the Ten Directions’ Nine Dark Prisons;\nthe Great Emperor of the Water Office, Fusan;\nthe Divine Lord of the Sun Valley;\nthe Water Thearchs of the Nine Rivers;\nthe True Lords of the Twelve Brooks;\nthe Thunder and Rain Deities of the Scriptural Registers;\nthe Divine Generals and Officials;\nthe Mighty Heavenly Enforcers and Punitive Divine Soldiers;\nthe Direct Talisman Officers of the Five Thearchs;\nthe Clerks of the Six Palaces;\nthe Ox-Headed Prison Guards and Horse-Faced Great Spirits;\nthe Courier Officials of the Mysterious Capital’s Reed Dragon Post;\nthe Document-Bearing Lads;\nthe Guardians of the Precepts;\nthe Direct Talismans of the Three Realms;\nthe Merit Officers of the Four Directions;\nthe City Gods and Village Earth Gods;\nthe Incense-Attending Numinous Officials;\nthe Direct Talismans Who Proclaim and Transmit Summons;\nthe Responsive and Perceptive Spirits of the Three Realms;\nall the mighty and numinous beings.\n\nWe have heard that the original chapters of the Numinous Treasure\nencompass the profound mysteries of the hundred demons’ hidden rhymes,\nwhile the wondrous canon of the Cavernous Mystery\nunfolds the majestic ritual of the Nine Heavens’ Life-Generating Thearch.",
      "overlap_context": "ad aloud, its words resounding before the sacred audience. May the merit of the ninefold recitation be universally realized, and may all together witness the wonder of the One Vehicle. May divine souls ascend and be delivered, forever transcending into the realm of purity; may suffering spirits receive grace and fully behold the realm of radiant light. We, in boundless reverence, offer this prayer.\n\n**Respectfully submitted.**\n\nAscending the altar,\nOffering incense,\nBowing in faith and devotion.",
      "start_char": 687,
      "end_char": 1524,
      "start_sentence": 49,
      "end_sentence": 64,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.462406635284424,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "神功与天地齐，功大惠实，死生蒙惠，是为胜范，普度无穷。 以今钦奉纶音，崇修玉箓大斋几昼夜。 今则登坛转诵，洞玄灵宝九天生神玉章，升荐某灵、证果逍遥，旁资苦爽，均遂生方。 以今法事严陈，琅函将启。 敬伸誊奏，仰冀鉴观。 伏愿三境高明，九天上圣。 同垂玄贶，普赐洪恩。 俯降道场，证盟修奉。 十方法界，六合寰区。 五道众生，九幽诸狱。 以兹功德，徧用庄严。 当愿经宝宏宣，幽关罢对。 净魄蒙恩而上超道岸，苦魂受炼而永离泉乡。 冤对蠲除，罪根落灭。 径圆成於道果，即度品於朱宫。 稽首饭依，无极大道。 侍经白文 三皈依",
      "translated_text": "The divine merit equals that of Heaven and Earth,\nits vast kindness is true and real—\nthe living and the dead alike receive its grace,\nthis is the supreme model,\nuniversally delivering without end.\n\nNow, in reverent compliance with the imperial edict,\nwe have undertaken the grand jiao of the Jade Register for many days and nights.\nToday, ascending the altar to recite in rotation\nthe *Cavernous Mystery Numinous Treasure Jade Chapters of the Nine Heavens’ Life-Generating Thearch*,\nwe offer ascent and recommendation for the spirit of so-and-so,\nthat they may attain fruition and wander carefree,\nwhile aiding the suffering souls of the departed,\nall equally achieving rebirth in the proper realm.\n\nAs this ritual is solemnly arrayed,\nthe jade caskets are about to be opened.\nWe respectfully present this memorial,\nhumbly beseeching your august observation.\n\nWe pray that the Three Realms’ exalted luminaries,\nthe Nine Heavens’ supreme sages,\nwill together bestow their mysterious blessings,\nuniversally granting vast favor.\nCondescend to descend upon this ritual arena,\nwitnessing our vows and accepting our devotion.\n\nThroughout the ten directions of the Dharma Realm,\nthe six directions of the cosmos,\nthe beings of the Five Paths,\nthe prisons of the Nine Dark Realms—\nmay these merits be universally employed for adornment.\n\nMay it be that the scriptural treasures widely propagate,\nthe gates of darkness cease their trials.\nPure souls receive grace and ascend beyond the Dao’s shore,\nsuffering spirits undergo refinement and forever depart the Yellow Springs.\nGrievances are dissolved,\nthe roots of sin eradicated.\nSwiftly may perfection be achieved in the Dao’s fruit,\nand immediate deliverance attained in the Crimson Palace.\n\nWe bow our heads and take refuge in the boundless Great Dao.\n\n*Respectfully presented by the scripture-attending acolytes:*\n*The Three Refuges.*",
      "overlap_context": "ctions;\nthe City Gods and Village Earth Gods;\nthe Incense-Attending Numinous Officials;\nthe Direct Talismans Who Proclaim and Transmit Summons;\nthe Responsive and Perceptive Spirits of the Three Realms;\nall the mighty and numinous beings.\n\nWe have heard that the original chapters of the Numinous Treasure\nencompass the profound mysteries of the hundred demons’ hidden rhymes,\nwhile the wondrous canon of the Cavernous Mystery\nunfolds the majestic ritual of the Nine Heavens’ Life-Generating Thearch.",
      "start_char": 1524,
      "end_char": 1770,
      "start_sentence": 65,
      "end_sentence": 82,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.278140783309937,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "宿命赞 侍经开经 敷座赞 静念如法 寂寂至无宗 请转法轮 师题经 众讽经毕 侍经回向 解座吟 步虚，旋行至子宫，上香 师白文 伏闻，位镇坎宫，校录鬼神之府； 威灵子位，总司罪福之权。 应五气以分辉，悯群生之沦没。 以今钦奉纶音，崇修玉箓，升荐某灵，超登清静，旁资苦爽，均证生方。 今者诵咏宝章，已周一过。 祈玄恩而诞布，度苦爽以超升。 伏愿俯纳虔祈，特垂拯济。 俾三涂开泰，五苦停酸。 幽夜开光，咸登彼岸。 具有疏文，谨当宣告 宣疏 谨请郁单无量天唐符使，速出班次，祗受公文。 宣关 焚化",
      "translated_text": "**Hymn of Past Lives**\n*Attending the Scripture, Opening the Sutra*\n**Hymn of Seating the Assembly**\n*Silent Contemplation in Accordance with the Dharma*\nIn profound stillness, we reach the ultimate source—\n**Inviting the Turning of the Dharma Wheel**\nThe master inscribes the sutra,\nthe assembly chants its completion.\n*Attending the Scripture, Dedication of Merit*\n**Hymn of Rising from the Seat**\nProceeding in void-step, circling to the Palace of Zi,\noffering incense.\n\nThe master declares:\nWe humbly acknowledge that your station guards the Palace of Kan,\noverseeing the courts of ghosts and spirits;\nyour majestic power, O Spirit of the Zi, holds authority over sin and fortune.\nRadiating through the five qi, you pity the multitudes sunk in suffering.\nToday, in reverent obedience to the imperial decree,\nwe uphold the jade registers in solemn rite,\nascending and recommending the soul of [Name],\nto transcend into purity and stillness,\nwhile aiding the suffering spirits,\nthat all may equally attain rebirth in the realms of life.\n\nNow, the recitation of the sacred verses has been completed in full.\nWe pray that your mysterious grace be abundantly bestowed,\ndelivering the suffering spirits to transcendence.\nMay you deign to receive our earnest supplications\nand grant your saving mercy.\nLet the Three Wretched Paths open to prosperity,\nthe Five Sufferings cease their bitterness.\nMay the dark night brighten with light,\nand all cross to the farther shore.\n\nA memorial is prepared—\nwe shall now proclaim it.\n\n**Proclamation of the Memorial**\nWe reverently invoke the Heavenly Envoy of Youtan,\nBearer of the Tang Talisman,\nto swiftly step forth and receive this official document.\n\n**Proclamation of the Petition**\n[The memorial is] consigned to the flames.",
      "overlap_context": "opagate,\nthe gates of darkness cease their trials.\nPure souls receive grace and ascend beyond the Dao’s shore,\nsuffering spirits undergo refinement and forever depart the Yellow Springs.\nGrievances are dissolved,\nthe roots of sin eradicated.\nSwiftly may perfection be achieved in the Dao’s fruit,\nand immediate deliverance attained in the Crimson Palace.\n\nWe bow our heads and take refuge in the boundless Great Dao.\n\n*Respectfully presented by the scripture-attending acolytes:*\n*The Three Refuges.*",
      "start_char": 1770,
      "end_char": 2040,
      "start_sentence": 83,
      "end_sentence": 108,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.901823282241821,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "侍经开经 敷座赞 请转法轮 师题经 众讽经毕 侍经回向 解座吟 步虚，旋行至坤宫，上香 师白文 伏闻，位当参位，端居仁静之乡； 德运坤中，流布梵阳之炁。 度人利物，起死回生。 以今钦奉纶音，崇修玉箓，升荐某灵，进登清静，旁资苦爽，均证生方。 今者诵咏宝章，已周二过。 敬颁宣於恩命，祈拔度於神魂。 伏愿俯降大慈，特从凡恳。 俾幽冥之开泰，使道果以圆成。 具有疏文，谨当宣告 宣疏 谨请上上禅善无量寿天刘符使，速出斑次，祗受公文。 宣关 焚化 侍经开经 敷座赞 请转法轮 师题经 众讽经毕 侍经回向 解座吟",
      "translated_text": "**Assisting the Sutra—Opening the Sutra**\n*Spreading the Seat—Hymn of Praise*\n*Inviting the Turning of the Dharma Wheel*\nThe Master Inscribes the Sutra\nThe Assembly Recites the Sutra to Completion\n*Assisting the Sutra—Dedication of Merit*\n*Chanting While Rising—Procession to the Kun Palace*\nOffering Incense\nThe Master Presents the Memorial\n\nWe humbly recall:\nHere, at the station of the Three,\none abides in the realm of benevolence and stillness.\nThe virtue of Kun flows at its center,\ndisseminating the yang qi of Brahma.\nDelivering beings and benefiting creatures,\nreviving the dead and restoring life.\n\nNow, in reverent compliance with the imperial decree,\nwe solemnly perform the Jade Register rites,\nelevating and recommending the spirit of [Name],\nadvancing them to purity and tranquility,\nextending aid to suffering souls,\nthat all may equally attain rebirth in the realms of life.\n\nThe recitation of the sacred verses has now been completed in full.\nWe respectfully proclaim the decree of grace,\npraying for the deliverance of divine souls.\nMay you deign to descend great compassion\nand heed the pleas of mortals.\nLet the netherworld open to prosperity,\nand the fruits of the Dao be perfected.\n\nA memorial is prepared—\nwe shall now proclaim it.\n\n**Proclamation of the Memorial**\nWe reverently invoke the Celestial Envoy of the Uppermost Meditation,\nBearer of the Liu Talisman of Boundless Longevity,\nto swiftly step forth and receive this official document.\n\n**Proclamation of the Petition**\n[The memorial is] consigned to the flames.\n\n**Assisting the Sutra—Opening the Sutra**\n*Spreading the Seat—Hymn of Praise*\n*Inviting the Turning of the Dharma Wheel*\nThe Master Inscribes the Sutra\nThe Assembly Recites the Sutra to Completion\n*Assisting the Sutra—Dedication of Merit*\n*Chanting While Rising*",
      "overlap_context": "ns\nand grant your saving mercy.\nLet the Three Wretched Paths open to prosperity,\nthe Five Sufferings cease their bitterness.\nMay the dark night brighten with light,\nand all cross to the farther shore.\n\nA memorial is prepared—\nwe shall now proclaim it.\n\n**Proclamation of the Memorial**\nWe reverently invoke the Heavenly Envoy of Youtan,\nBearer of the Tang Talisman,\nto swiftly step forth and receive this official document.\n\n**Proclamation of the Petition**\n[The memorial is] consigned to the flames.",
      "start_char": 2040,
      "end_char": 2327,
      "start_sentence": 109,
      "end_sentence": 137,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.782864809036255,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "步虚，旋行至震宫，上香 师白文 伏闻，尊居卯位，有情俱沐於玄恩； 德合震宫，幽显咸资於大化。 随方应号，无量度人。 以今钦奉纶音，崇修玉箓，升荐某灵，超登清静，旁资苦爽，均证生方。 今者诵咏宝章，已周三过。 敬颁宣於恩命，祈拔度於神魂。 伏愿上彻苍昱，俯怜丹悃，证盟开度，济拔幽冥。 具有疏文，谨当宣告。 宣疏 谨请梵监须延天黄符使，速出班次，祗受公文。 宣关 焚化 三闻经 还神烧香 仙灵仙官、金童玉女、五帝五岳、神仙真人，三炁正神，左右龙虎君、天仙地仙，五灵香官，当令召致十方正炁，自然生金液丹碧芝英。 百灵众真，交会在此，香火炉前。 令臣等学道得道，求仙得仙。 十方仙童玉女，接侍香烟，传臣向来所启之诚，速达径御无上至真三宝昊天玉皇上帝、东极救苦天尊九天生神上帝道前。 下坛 谢师 具位臣姓某上启玄中教主玉虚明皇道君，三天教主正一天师真君，灵宝教主经籍度师真君，监斋大法师真君，太极左宫仙公真君，九州都仙太史真君，人天教主华盖浮丘真君，清微道德正一历代师尊。 恭望师慈，俯昭谢悃。 臣适来升坛，转咏九天生神玉章，祈恩升荐某灵，进登清静，下及法界孤幽，超出沈冥，迁升仙界。 仰荷主维，已周三过，径伸谒谢，尚冀成终。 伏愿何福不臻，悉入生门之度； 说经未竟，少稽仙仗之留。 临午行科，别伸启告。 臣等下情无任虔谢之至。 谨言。 向来",
      "translated_text": "**Procession of the Void**\n\nProceeding in circular motion to the *Zhen* Palace, offering incense.\n\n**The Master Recites the Memorial**\n\nWe humbly acknowledge: dwelling in the *Mao* position, all sentient beings bathe in the profound grace; virtue aligning with the *Zhen* Palace, both hidden and manifest draw upon the great transformation. Responding to directions and bearing titles, boundlessly delivering humanity.\n\nToday, in reverent compliance with the imperial decree, we solemnly perform the Jade Register rites, ascending to recommend the soul of [Name], that they may transcend to purity and stillness, while aiding suffering spirits to equally attain the realm of life.\n\nNow, the recitation of the precious scripture has completed its third cycle. We respectfully proclaim the decree of grace, praying for the deliverance of divine souls. May it ascend to the azure heavens, and may compassion descend to heed our sincere plea—witnessing the covenant, opening the path of deliverance, and rescuing the netherworld.\n\nA memorial is prepared—we shall now proclaim it.\n\n**Proclamation of the Memorial**\nWe reverently invoke the Celestial Overseer of the Brahma Realm, Bearer of the Yellow Talisman of the *Xu Yan* Heaven, to swiftly step forth and receive this official document.\n\n**Proclamation of the Petition**\n[The memorial is] consigned to the flames.\n\n**Threefold Recitation of the Sutra**\n**Restoring the Deities—Burning Incense**\n\nImmortal spirits and immortal officials, Golden Lads and Jade Maidens, the Five Emperors and Five Marchmounts, divine immortals and perfected beings, the Three *Qi* True Deities, the Left and Right Dragon-Tiger Lords, celestial and terrestrial immortals, the Five Numinous Incense Officials—we now summon the ten directions’ true *qi*, that the golden liquid elixir, cinnabar mushrooms, and azure herbs may spontaneously arise.\n\nMay the hundred spirits and host of perfected ones gather here before the incense burner. May we, your servants, who study the Dao attain the Dao, and those who seek immortality attain immortality.\n\nMay the jade maidens and immortal lads of the ten directions attend the incense smoke, swiftly conveying the sincerity of our supplications to the supreme and most true Three Treasures, the August Jade Emperor of the Vast Heaven, the Heavenly Worthy of Salvation from the Eastern Extremity, and the Nine Heavens’ Life-Generating Emperor of the Dao.\n\n**Descending the Altar**\n**Thanks to the Master**\n\nYour subordinate, [Name], humbly addresses the Lord of the Mystic Teachings, the Jade Clarity August Sovereign of the Dao, the Three Heavens’ Lord and Master of the Orthodox Unity, the Heavenly Master Perfected Lord; the Lord of the Numinous Treasure Teachings, the Perfected Lord of Scriptures and Ordination; the Great Dharma Master and Overseer of the Retreat; the Perfected Lord of the Left Palace of the Supreme Ultimate; the Perfected Lord of the Grand Historian of the Nine Provinces’ Immortals; the Lord of the Teachings of Heaven and Humankind, the Perfected Lord of Hua Gai and Fu Qiu; and the successive masters of the Orthodox Unity of the Pure Subtlety and Moral Dao.\n\nWe reverently beseech your compassion to graciously accept our gratitude. Just now, ascending the altar, we chanted the Jade Chapters of the Life-Generating Deities of the Nine Heavens, praying for the elevation of the soul of [Name] to purity and stillness, and for the deliverance of all orphaned and hidden spirits of the Dharma realm from the depths of darkness, ascending to the immortal realms.\n\nHaving completed the third recitation under the guidance of the presiding master, we now offer our thanks, trusting that the rite may be brought to perfect fulfillment. May every blessing be bestowed, all entering the gate of life’s deliverance. As the recitation of the scripture remains unfinished, we briefly delay the immortal retinue’s departure.\n\nAt noon, the rites proceed—we shall make further supplications.\n\nOur hearts, in utmost reverence and gratitude, cannot be fully expressed.\n\nRespectfully submitted.\n\n**Thus Concludes**",
      "overlap_context": "e the Celestial Envoy of the Uppermost Meditation,\nBearer of the Liu Talisman of Boundless Longevity,\nto swiftly step forth and receive this official document.\n\n**Proclamation of the Petition**\n[The memorial is] consigned to the flames.\n\n**Assisting the Sutra—Opening the Sutra**\n*Spreading the Seat—Hymn of Praise*\n*Inviting the Turning of the Dharma Wheel*\nThe Master Inscribes the Sutra\nThe Assembly Recites the Sutra to Completion\n*Assisting the Sutra—Dedication of Merit*\n*Chanting While Rising*",
      "start_char": 2327,
      "end_char": 2905,
      "start_sentence": 138,
      "end_sentence": 169,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.60486125946045,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "念善 午朝 师堂序立 法事 跪启 伏以太阳洞明，景焕三炁之蓊冥； 彩仗下凡，筵想诸天之齐到。 门下具位臣姓某上启玄中教主、玉虚明皇道君，三天教主、正一天师真君，灵宝教主、经籍度师真君，监斋大法师真君，太极左宫仙公真君，九州都仙太史真君，人天教主、华盖浮丘真君，清微灵宝道德正一历代师尊。 恭望师慈，俯回洞鉴。 臣今钦奉纶音，崇修玉箓，荐扬大斋。 以今领众升坛，转咏洞玄灵宝九天生神玉章第四过至第六过，祈恩升荐某灵，上登福境，下及法界。 孤爽出离幽冥，迁升净域。 未敢自专，再伸启告。 伏愿七宝经台，常睹紫虚之郁秀； 三清洞阙，遥瞻梵炁之弥罗。 臣等干冒师严，下情不胜惶惧之至。 领众升坛，恭行典式。 唱道 升坛",
      "translated_text": "At the Hour of Noon, the assembly gathers in the Master’s Hall, arrayed in proper order. The ritual proceedings commence—we kneel to make our supplication.\n\nNow, as the Great Sun shines with radiant clarity, its light suffusing the threefold qi’s hidden depths; as the celestial retinue descends to the mortal realm, we envision the hosts of all heavens assembled in perfect harmony.\n\nWe, your humble disciples [Names], hereby reverently address the Sovereign of the Mystic Teaching, the Jade Clarity August Dao Lord; the Three Heavens’ Sovereign, the Orthodox Unity Celestial Master; the Sovereign of the Numinous Treasure, the Perfected Lord of Scriptures and Ordinations; the Great Dharma Master and Overseer of the Fast; the Perfected Lord of the Left Palace of the Supreme Ultimate; the Perfected Lord and Grand Scribe of the Nine Provinces; the Sovereign of Human and Heavenly Teachings, the Hua Gai Perfected Lord of Floating Hill; and the successive masters of the Qingwei, Lingbao, and Orthodox Unity traditions.\n\nWe humbly beseech your compassion, that you may deign to turn your penetrating gaze upon us.\n\nIn reverent compliance with the sacred edict, we now conduct the grand jiao offering, ascending the altar to recite the *Jade Chapters of the Life-Generating Deities of the Nine Heavens* from the fourth to the sixth passage. We pray for the elevation of the soul of [Name] to the realms of blessedness, and for the deliverance of all orphaned spirits of the Dharma realm from the depths of darkness, ascending to the pure domains.\n\nNot presuming upon our own authority, we make this further supplication.\n\nMay the seven-jeweled platform of the scriptures ever behold the luxuriant splendor of the Purple Void; may the cavern-palaces of the Three Clarities distantly gaze upon the boundless expanse of the Brahma-qi.\n\nWe, your unworthy disciples, dare to trespass upon your august dignity, our hearts overwhelmed with awe and trepidation.\n\nNow, leading the assembly, we ascend the altar to perform the sacred rites in due order.\n\n**Chanting the Dao, we ascend the altar.**",
      "overlap_context": "n under the guidance of the presiding master, we now offer our thanks, trusting that the rite may be brought to perfect fulfillment. May every blessing be bestowed, all entering the gate of life’s deliverance. As the recitation of the scripture remains unfinished, we briefly delay the immortal retinue’s departure.\n\nAt noon, the rites proceed—we shall make further supplications.\n\nOur hearts, in utmost reverence and gratitude, cannot be fully expressed.\n\nRespectfully submitted.\n\n**Thus Concludes**",
      "start_char": 2905,
      "end_char": 3216,
      "start_sentence": 170,
      "end_sentence": 188,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.910029411315918,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "上香 信礼 默礼师，存念如法 请宣神咒 元始开图，太玄肇灵。 虚极无象，一气流形。 化生二景，五纬凝精。 混合自然，怛除结婴。 总真布景，焕赫九清。 炎池廓奕，七纪齐井。 祈师卢浩，丹天耀精。 朱光炼度，赤霭散明。 三华郁秀，晖映帝宸。 鸣法鼓二十四通 无上三天玄元始三炁太上道君，召出臣等身中三五功曹、左右官使者、侍香金童、传言散花玉女、五帝直符直日香官，各三十六人出，关启所言。 臣今入意愿得太上十方正真生炁下降，流注臣等身中，令臣所启，速达径御无上至真三宝昊天玉皇上帝、东极救苦天尊九天生神上帝道前。 请称法位 具位臣姓某与礼官等，谨同诚上启太上无极大道虚无自然元始天尊，玉宸道君、灵宝天尊，太上老君、道德天尊，统天元圣天尊，寻声救苦天尊，朱陵度命天尊，东华木公上相青童道君，西灵金真万炁祖母元君，十方灵宝救苦天尊，十方已得道至真诸君丈人，九天生神上帝，三十二天上帝，三皇五老上帝，五福十神真君，东华南极西灵北真玄都玉京金阙七宝玄台紫微上宫灵宝至真明皇道君，上相上宰、上保上傅、四司五帝、十方无极至真，三十六部尊经神仙，上清日月、五星四曜、南辰北斗、万象高真，十方无极无量品至真大神，飞天神王，长生大圣无量度人君，天真皇人妙行真人，三元三官大帝，九天采访使者，玄中大法师，三天大法师，灵宝三师真君，周天列宿星真，清微历代师君，九天天曹诸司上圣，北极四圣真君，南昌上下宫朱陵火府黄箓院主宰三元真君，度人不死诸位真君，兴生独隶可韩功都聚魂五府真宰，三界大勋魔王，侍经五帝，玉童玉女，九天符使，九天侍卫一切灵仙，五岳五天圣帝、储副佐理真君，北阴酆都大帝，九垒帝君，五炁天君，十宫真君，三元宫府百二十曹、考官掾吏，十方九幽诸狱主者，水府搏桑大帝，旸谷神君，九江水帝，十二溪真雷霆雨部神祇法箓、官君将吏，巨天力士执罚神兵、五帝直符、六宫掾吏、牛头狱卒、马面大神、玄都茭龙驿吏，赍简童子、护戒威神、三界直符、四直功曹、城隍里社正神、侍香灵官、直符宣通召命，三界应感，一切威灵。 臣闻，三宝金书，凝虚玄之妙炁； 九霄玉笈，秘空洞之灵音。",
      "translated_text": "Kindling the incense, we offer reverent obeisance and silent veneration to the Master, contemplating in accordance with the ritual.\n\nWe invoke the divine incantation:\nAt the dawn of the Primordial, the Great Mystery first stirred.\nFrom the Void’s extremity, formless, a single qi flowed into shape.\nIt transformed into the Two Radiant Ones, the Five Wefts congealed in essence.\nMerging with the spontaneous, it dissolved the knots of the womb.\nAssembling the perfected, it spread its radiance, resplendent through the Nine Purities.\nThe Flaming Pool expanded in splendor, the Seven Chronograms aligned with the Well.\nWe beseech Master Lu Hao, whose essence illumines the Cinnabar Heavens.\nCrimson light refines and elevates, scarlet mists disperse their brilliance.\nThe Three Flowers flourish in luxuriance, their radiance reflecting upon the Imperial Divine Seat.\n\nStriking the ritual drum twenty-four times.\n\nO Most Supreme Three Heavens, Mysterious Primordial Three Qi, Supreme Dao Lord of the Great Dao:\nSummon forth from within our bodies the Three and Five Merit Officers, the Attendants of the Left and Right, the Golden Lads of Incense, the Jade Maidens of Flower-Scattering and Message-Bearing, the Five Thearchs’ Direct Envoys and the Daily Fragrance Officials—thirty-six each—commanding them to transmit our words.\n\nWe now enter our intention, praying that the Upright Qi of the Ten Directions, the Perfected and True, descend and flow into our bodies, that our supplications may swiftly ascend to the presence of the Most Supreme and Perfect Three Treasures, the August Jade Thearch of the Vast Heaven, the Heavenly Worthy of Salvation from the Eastern Pole, and the Nine Heavens’ Life-Generating Thearch.\n\nAnnouncing the ritual rank:\n\nWe, your humble servants [Name] and the ritual officers, with unified sincerity, reverently address and supplicate the Most Supreme Boundless Dao, the Spontaneous and Natural Primordial Heavenly Worthy of Original Commencement; the Jade Clarity Dao Lord; the Heavenly Worthy of Numinous Treasure; the Most Supreme Lord Lao, the Heavenly Worthy of Dao and Virtue; the Heavenly Worthy of the Primordial Sage Who Governs All; the Heavenly Worthy of Salvation at the Sound of Suffering; the Heavenly Worthy of the Crimson Mound Who Delivers from Mortality; the Azure Lad Dao Lord, Grand Minister of the Eastern Florescence; the Primordial Sovereign Mother of Myriad Qi, the Golden Perfected of the Western Numinosity; the Heavenly Worthies of Salvation and Numinous Treasure in the Ten Directions; the Perfected Lords and Venerable Masters Who Have Attained the Dao in the Ten Directions; the Life-Generating Thearch of the Nine Heavens; the Thearchs of the Thirty-Two Heavens; the Three Sovereigns and Five Elders; the True Lords of the Five Fortunes and Ten Spirits; the Perfected Lord of the Luminous Capital, the Numinous Treasure and Perfect Radiant August Dao Lord of the Seven-Jeweled Mysterious Terrace of the Golden Towers of the Jade Metropolis in the Purple Tenuity Supreme Palace; the Grand Ministers, Grand Stewards, Grand Protectors, and Grand Tutors; the Four Offices and Five Thearchs; the Boundless and Perfect in the Ten Directions; the Divine Immortals of the Thirty-Six Sacred Scriptures; the Perfected of the Supreme Clarity’s Sun and Moon, the Five Planets and Four Luminaries, the Southern Asterism and Northern Dipper, and the Myriad Images of Lofty Perfection; the Boundless and Measureless Grades of Perfect and True Great Spirits in the Ten Directions; the Flying Heavenly Spirit-Kings; the Great Sage of Limitless Salvation Who Grants Eternal Life; the Heavenly Perfected and August Person, the Perfected of Wondrous Conduct; the Three Primordials and Three Officials, the Great Thearchs; the Envoys of Investigation in the Nine Heavens; the Great Dharma Masters of the Mysterious Center; the Great Dharma Masters of the Three Heavens; the Perfected Lords of the Three Masters of Numinous Treasure; the Star Perfected of the Myriad Constellations; the Master Lords of Successive Generations of the Pure Tenuity; the Sacred Worthies of the Nine Heavenly Bureaus; the Four Perfected Lords of the Northern Culmen; the Perfected Lords of the Upper and Lower Palaces of Southern Prosperity, the Crimson Mound Fire Mansion, and the Yellow Register Court; the True Lords Who Deliver from Death; the True Lords of the Five Offices Who Gather the Solitary and Orphaned Souls; the Great Merit Kings of the Three Realms; the Five Thearchs Who Attend the Scriptures; the Jade Lads and Jade Maidens; the Talisman Envoys of the Nine Heavens; the Guardians of the Nine Heavens; all the Numinous Immortals; the Sacred Thearchs of the Five Marchmounts and Five Heavens, the True Lords Who Assist and Govern; the Great Thearch of the Northern Darkness of Fengdu; the Lords of the Nine Ramparts; the Heavenly Lords of the Five Qi; the True Lords of the Ten Palaces; the Hundred and Twenty Bureaus of the Three Primordial Palaces and their Examiners and Clerks; the Wardens of the Prisons in the Nine Glooms of the Ten Directions; the Great Thearch of the Waters’ Mulberry Fields; the Spirit Lord of the Sunrise Valley; the Water Thearchs of the Nine Rivers; the Perfected of the Twelve Brooks; the Divine Officials, Lords, Generals, and Clerks of the Thunder, Rain, and Lightning Departments; the Mighty Heavenly Warriors Who Execute Punishments; the Direct Envoys of the Five Thearchs; the Clerks of the Six Palaces; the Ox-Headed Gaolers and Horse-Faced Great Spirits; the Courier Officials of the Mysterious Metropolis’ Reed Dragon Post; the Lads Who Bear the Tallies; the Guardians of the Precepts; the Direct Envoys of the Three Realms; the Four Direct Merit Officers; the City Gods and Village Deities; the Numinous Officials Who Attend the Incense; the Direct Envoys Who Proclaim and Transmit Commands—may all those responsive to invocation in the Three Realms, all majestic numina, attend and heed.\n\nWe have heard that the Golden Writ of the Three Treasures congeals the wondrous qi of the Empty Mystery, and that the Jade Tablets of the Nine Empyreans conceal the numinous sounds of the Cavernous Void.",
      "overlap_context": "e make this further supplication.\n\nMay the seven-jeweled platform of the scriptures ever behold the luxuriant splendor of the Purple Void; may the cavern-palaces of the Three Clarities distantly gaze upon the boundless expanse of the Brahma-qi.\n\nWe, your unworthy disciples, dare to trespass upon your august dignity, our hearts overwhelmed with awe and trepidation.\n\nNow, leading the assembly, we ascend the altar to perform the sacred rites in due order.\n\n**Chanting the Dao, we ascend the altar.**",
      "start_char": 3216,
      "end_char": 4087,
      "start_sentence": 189,
      "end_sentence": 208,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.34479546546936,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "内名混合於百神，生根裁成於万品。 导运御世，唱恭奉而九炁结形； 乘晨希阳，洞玄灵而七元返景。 洪惟元始。 凝妙虚无。 悯履九之告终，矜函三之应会。 神景启奥，隐韵通玄。 上开天地之光，下料死生之化。 希夷至极，微妙难超。 仰功德之魏巍，罄谌恂之切切。 以今钦奉纶音，崇修玉箓大斋几昼夜。 今则登坛，转咏洞玄灵宝九天生神玉章，升荐某灵，证果逍遥，旁资苦爽，均遂生方。 伏愿慈光耀景，玄极流辉。 出禁书於玉台，容其啸咏； 开宝章於金格，许以谣歌。 琅琅而逸响九遐，郁郁而朗闻三界。 即俾某灵性超死户，气返本根。 乘大有之琼音，登妙无之宝界。 臣等稽首皈依，无极大道。 侍经白文 三皈依 宿命赞 侍经开经 敷座赞 静念如法 请转法轮 师题经 众讽经毕 侍经回向 解座吟",
      "translated_text": "Within, the names blend with the hundred spirits, while the roots of life are shaped and perfected among the ten thousand kinds. Guiding the course of governance, chanting reverence and offering, the nine qi coalesce into form; riding the dawn’s rare yang, penetrating the mysterious numinous, the Seven Origins return their radiance.\n\nVast is the Primal Beginning, congealing the wondrous and void. Moved by the end of the ninefold tread, it pities the responsive convergence of the threefold enclosure. Divine luminance unfolds its mysteries, hidden tones bridge the profound. Above, it opens the light of heaven and earth; below, it measures the transformations of death and life. So subtle it reaches the ultimate of the formless, so elusive it defies surpassing. Gazing upon its towering virtue and power, we exhaust our earnest devotion.\n\nNow, reverently heeding the imperial decree, we have solemnly observed the Jade Register Grand Fast for several days and nights. Today, ascending the altar, we intone the *Nine Heavens’ Life-Giving Divine Chapters of the Cavernous Mystery Numinous Treasure*, offering ascent and presentation for such-and-such a spirit, that they may attain fruition and carefree wandering, while aiding suffering souls and universally fostering life in all directions.\n\nWe humbly pray that compassionate light may illumine the scene, and the darkest depths flow with splendor. May the Jade Terrace release its forbidden script, permitting song and recitation; may the Golden Lattice open its treasured verses, allowing chant and ode. Let the resonant tones ring clear to the nine distances, and the fragrant clarity be heard throughout the Three Realms. Thus may such-and-such a spirit’s nature transcend the gates of death, their qi return to its original root. Riding the jade tones of Great Possession, they shall ascend the jeweled realm of the Wondrous and Non-Being.\n\nWe, your servants, bow our heads in homage and take refuge in the Boundless Great Dao.\n\n*Attending the Scripture, we recite the White Text;*\n*The Three Refuges;*\n*The Praise of Past Lives;*\n*Attending the Scripture, we open the sutra;*\n*The Praise of the Dharma Seat;*\n*Silent contemplation as prescribed;*\n*Requesting the Turning of the Dharma Wheel;*\n*The Master inscribes the sutra;*\n*The assembly recites the sutra to its close;*\n*Attending the Scripture, we dedicate the merit;*\n*The Chant of the Seat’s Dissolution.*",
      "overlap_context": "ct Envoys of the Three Realms; the Four Direct Merit Officers; the City Gods and Village Deities; the Numinous Officials Who Attend the Incense; the Direct Envoys Who Proclaim and Transmit Commands—may all those responsive to invocation in the Three Realms, all majestic numina, attend and heed.\n\nWe have heard that the Golden Writ of the Three Treasures congeals the wondrous qi of the Empty Mystery, and that the Jade Tablets of the Nine Empyreans conceal the numinous sounds of the Cavernous Void.",
      "start_char": 4087,
      "end_char": 4423,
      "start_sentence": 209,
      "end_sentence": 238,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.309056520462036,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "步虚，旋行至巽宫，上香 师白文 伏闻，位镇巽宫，上应神霄之境； 泽林地户，下通溟漠之乡。 无量度人，随方设教。 以今钦奉纶音，崇修玉箓，升荐某灵，进登清静，旁资苦爽，均证生方。 今者诵咏宝章已周四过。 敬颁宣於恩命，祈拔度於死魂。 伏愿俯悯哀悰，大施玄造。 庶彰正化，以副虔祈。 具有疏文，谨当宣告。 宣疏 谨请寂然兜术天彭符使，速出班次，祗受公文。 宣关 焚化 侍经 开经 敷座赞 请转法轮 师题经 众讽经毕 侍经回向 解座吟 步虚，旋行至中央，上香 师白文 伏闻，道如天覆，独总御於死生；",
      "translated_text": "Procession in void-step, circling to the Xun Palace, offering incense.\nThe Master recites the White Text:\n\nWe have heard that this station guards the Xun Palace, corresponding above to the Divine Empyrean’s realm; the Gate of Earth in the Grove of Blessings, connecting below to the boundless expanse of the Dark and Vast. Countless souls are delivered as teachings are established in every quarter.\n\nToday, in reverent compliance with the imperial decree, we perform the rites of the Jade Register, ascending to recommend such-and-such a spirit, advancing them to purity and stillness, universally aiding the suffering souls, that all may equally attain the realm of life.\n\nNow the recitation of the precious scripture has completed its fourth cycle. Respectfully we proclaim the decree of grace, beseeching deliverance for the souls of the dead.\n\nWe humbly pray that you look down with compassion, bestowing the great workings of the mysterious creation. May the true transformation be made manifest, fulfilling our earnest prayers.\n\nA memorial document is prepared; we now proceed to its proclamation.\n\nProclamation of the Memorial.\nWe reverently invite the Silent Penfu Messenger of the Doushu Heaven to swiftly step forth and receive the official document.\n\nProclamation of the Pass.\nBurning and offering.\n\nAttending the Scripture, we open the sutra;\nThe Praise of the Dharma Seat;\nRequesting the Turning of the Dharma Wheel;\nThe Master inscribes the sutra;\nThe assembly recites the sutra to its close;\nAttending the Scripture, we dedicate the merit;\nThe Chant of the Seat’s Dissolution.\n\nProcession in void-step, circling to the Center, offering incense.\nThe Master recites the White Text:\n\nWe have heard that the Dao, like the heavens above, alone governs life and death...",
      "overlap_context": " our heads in homage and take refuge in the Boundless Great Dao.\n\n*Attending the Scripture, we recite the White Text;*\n*The Three Refuges;*\n*The Praise of Past Lives;*\n*Attending the Scripture, we open the sutra;*\n*The Praise of the Dharma Seat;*\n*Silent contemplation as prescribed;*\n*Requesting the Turning of the Dharma Wheel;*\n*The Master inscribes the sutra;*\n*The assembly recites the sutra to its close;*\n*Attending the Scripture, we dedicate the merit;*\n*The Chant of the Seat’s Dissolution.*",
      "start_char": 4423,
      "end_char": 4697,
      "start_sentence": 239,
      "end_sentence": 264,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.784138202667236,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "德若穹高，较重轻之罪福。 曲怜亡爽，愿拯幽关。 以今钦奉纶音，崇修玉箓，升荐某灵，进登清静，旁资苦爽，均证生方。 今者诵咏宝章已周五过。 奉真符而颁告，祈惠泽以宣行。 伏愿回驾鉴临，随方应度。 庶使拘囚之众，咸登自在之天。 具有疏文，谨当宣告。 宣疏 谨请波罗尼密不骄乐天范符使，速出班次，祇受公文。 宣关 焚化 侍经开经 敷座赞 请转法轮 师题经 众讽经毕 侍经回向 解座吟 步虚，旋行至乾宫，上香 师白文 伏闻，威佐天行，居福德大千之界； 德恢乾运，度幽冥亿劫之魂。 化应诸天，功施无量。 以今钦奉纶音，崇修玉箓，升荐某灵，超登清静，旁资苦爽，均证生方。 今者诵咏宝章已周六过。 赖玄恩而颁告，祈圣泽以弘施。 伏愿大道垂慈，神光徧烛。 尽开明於长夜，俾超度於仙乡。 具有疏文，谨当宣告。 宣疏 谨请洞元化应声天张符使，速出班次，祗受公文。 宣关 焚化",
      "translated_text": "Virtue, like the vaulted heavens, weighs the lightness and heaviness of sin and blessing. In compassion for the wandering souls of the departed, we pray for their deliverance from the dark gates.\n\nNow, in reverent obedience to the sacred edict, we solemnly perform the Jade Register rites, ascending and recommending the spirit of [Name], that they may ascend to purity and stillness, while extending aid to suffering souls, that all may together attain rebirth in the living realm. Today, the recitation of the precious scripture has been completed five times. We present the true talisman and proclaim its decree, praying for the bestowal of gracious blessings and their wide dissemination.\n\nWe humbly beseech that the returning chariot deign to look upon us, responding to each according to their measure. May all those bound in confinement ascend to the heavens of freedom.\n\nA memorial document is prepared; we now proceed to its proclamation.\n\nProclamation of the Memorial.\nWe reverently invite the Undefiled Joy of the Pāramitā Heaven’s Fanfu Messenger to swiftly step forth and receive the official document.\n\nProclamation of the Pass.\nBurning and offering.\n\nAttending the Scripture, we open the sutra;\nThe Praise of the Dharma Seat;\nRequesting the Turning of the Dharma Wheel;\nThe Master inscribes the sutra;\nThe assembly recites the sutra to its close;\nAttending the Scripture, we dedicate the merit;\nThe Chant of the Seat’s Dissolution.\n\nProcession in void-step, circling to the Qian Palace, offering incense.\nThe Master recites the White Text:\n\nWe have heard that majesty aids the workings of heaven, dwelling in the realm of boundless virtue and blessings; virtue expands the movement of the heavens, delivering souls from the hells of countless kalpas. Transformations respond to all heavens, and merits are bestowed without measure.\n\nNow, in reverent obedience to the sacred edict, we solemnly perform the Jade Register rites, ascending and recommending the spirit of [Name], that they may transcend to purity and stillness, while extending aid to suffering souls, that all may together attain rebirth in the living realm. Today, the recitation of the precious scripture has been completed six times. Relying on the profound grace, we proclaim the decree, praying for the vast bestowal of sacred blessings.\n\nWe humbly beseech that the Great Dao extend its compassion, and the divine radiance illuminate all. May the long night be fully enlightened, and all be delivered to the immortal realm.\n\nA memorial document is prepared; we now proceed to its proclamation.\n\nProclamation of the Memorial.\nWe reverently invite the Resonant Transformation of the Dongyuan Heaven’s Zhangfu Messenger to swiftly step forth and receive the official document.\n\nProclamation of the Pass.\nBurning and offering.",
      "overlap_context": "he Pass.\nBurning and offering.\n\nAttending the Scripture, we open the sutra;\nThe Praise of the Dharma Seat;\nRequesting the Turning of the Dharma Wheel;\nThe Master inscribes the sutra;\nThe assembly recites the sutra to its close;\nAttending the Scripture, we dedicate the merit;\nThe Chant of the Seat’s Dissolution.\n\nProcession in void-step, circling to the Center, offering incense.\nThe Master recites the White Text:\n\nWe have heard that the Dao, like the heavens above, alone governs life and death...",
      "start_char": 4697,
      "end_char": 5096,
      "start_sentence": 265,
      "end_sentence": 298,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.745699882507324,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "三闻经 还神烧香 仙灵仙官、金童玉女、五帝五岳神仙真人、三炁正神、左右龙虎君、天仙地仙、五灵香官，当令召致十方正炁，自然生金液丹碧芝英。 百灵众真，交会在此，香火炉前。 令臣等学道得道，求仙得仙。 十方仙童玉女，接侍香烟，传臣向来所启之诚，速达径御无上至真三宝昊天玉皇上帝、东极救苦天尊九天生神上帝道前。 下坛 谢师 伏以不参以三朝，礼幸成於晋接； 所告者二玄，科实出於师资。 门下具位臣姓某上启玄中教主、玉虚明皇道君，三天教主、正一天师真君，灵宝教主、经籍度师真君，监斋大法师真君，太极左宫仙公真君，九州都仙太史真君，人天教主、华盖浮丘真君，清微道德正一历代师尊。 恭望师慈，俯昭谢悃。 臣适来升坛，转咏九天生神玉章，祈恩升荐某灵，进登清静，下及法界孤幽，超出沈冥，迁升仙界。 仰沐匡维，幸周六过。 庸殚昭谢，尤赖成终。 伏愿无文不明，普冀众真之监度； 说经将毕，愿言我道之兴隆。 俟在落景，行科别沥，愚衷申告。 臣等下情无在虔谢之至。 谨言。 向来",
      "translated_text": "Upon the third recitation of the scripture, we restore the deities and burn incense. May the immortal spirits and immortal officials, the Golden Lads and Jade Maidens, the Perfected of the Five Thearchs and Five Marchmounts, the True Persons of the Three Qi, the Lords of the Left and Right Dragon-Tiger, the Heavenly and Earthly Immortals, and the Five Numinous Incense Officials now summon the orthodox qi of the ten directions, that the golden liquid elixir and azure mushroom of immortality may spontaneously arise. Let the hundred numinous hosts of Perfected gather here before the incense burner. May we, your servants, who study the Dao attain the Dao, and those who seek immortality attain immortality. May the Jade Maidens and Immortal Lads of the ten directions attend the incense smoke, conveying the sincerity of our supplications to the Most High and Perfect Three Treasures, the August Jade Thearch of the Vast Heaven, the Heavenly Worthy of Salvation of the Eastern Culmen, and the Ninefold Heavenly Thearch of Life before the Dao.\n\nDescending from the altar, we offer thanks to the master. Though we have not observed the three-day retreat, we have been graced with the fortune of this audience. What we now declare pertains to the Two Mysteries, for the ritual protocols truly derive from the master-disciple transmission. We, your humble servant [Name], now address the Lord of the Dao in the Mystic Realm, the Jade Clarity August Sovereign of the Dao, the Lord of the Three Heavens, the Orthodox Unity Heavenly Master Perfected Lord, the Lord of the Numinous Treasure, the Perfected Lord of the Scriptures and Registers, the Great Dharma Master Perfected Lord who Oversees the Retreat, the Perfected Lord of the Left Palace of the Great Ultimate, the Perfected Lord of the Grand Historian of the Nine Provinces, the Lord of the Teaching of Humans and Devas, the Perfected Lord of the Floating Canopy of Mount Fuqiu, and the successive masters of the Orthodox Unity and Pristine Subtlety traditions. We reverently beseech your compassionate regard and humbly express our gratitude.\n\nWe have just ascended the altar to intone the Jade Chapters of the Nine Heavens’ Life-Generating Scripture, praying for the elevation of the soul of [Name] to purity and stillness, and for the deliverance of all solitary and obscure beings in the dharma-realm from the depths of darkness, that they may ascend to the immortal realm. Through your august support, we have completed six recitations. We now offer our earnest thanks, relying upon your aid to bring this rite to completion. May no detail remain obscure, and may all Perfected Ones oversee the deliverance. As the recitation of the scripture nears its end, we pray for the flourishing of our Dao. At the close of this day, we shall perform the remaining rituals and present our humble devotion. Our hearts are filled with utmost reverence and gratitude.\n\nThus we respectfully declare. As before.",
      "overlap_context": "cred blessings.\n\nWe humbly beseech that the Great Dao extend its compassion, and the divine radiance illuminate all. May the long night be fully enlightened, and all be delivered to the immortal realm.\n\nA memorial document is prepared; we now proceed to its proclamation.\n\nProclamation of the Memorial.\nWe reverently invite the Resonant Transformation of the Dongyuan Heaven’s Zhangfu Messenger to swiftly step forth and receive the official document.\n\nProclamation of the Pass.\nBurning and offering.",
      "start_char": 5096,
      "end_char": 5523,
      "start_sentence": 299,
      "end_sentence": 319,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.08377432823181,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "念善 晚朝 师堂序立 法事 跪启 伏以诸天日停，轮遥听空歌之唳鹤； 五色云参，驾恭迎羽盖之鸣鸾。 三续师尊，载遵典式。 门下具位臣姓某上启玄中教主、玉虚明皇道君，三天教主、正一天师真君，灵宝教主、经籍度师真君，监斋大法师真君，太极左宫仙公真君，九州都仙太史真君，人天教主、华盖浮丘真君，清微灵宝道德正一历代师尊。 恭望师慈，俯回洞鉴。 臣今钦奉纶音，崇修玉箓，荐扬大斋。 以今众升坛，转咏洞玄灵宝九天生神玉章第七过至第九过，祈恩升荐某灵，进登清静，下及法界孤爽，同证良因，登真度命。 未敢自专，重伸启告。 伏希师造，终始纲维。",
      "translated_text": "At the Evening Audience, the masters assemble in the hall in proper order. The ritual proceedings commence; we kneel and declare:\n\nAs the sun pauses in the heavens of all directions, the turning wheel afar listens to the cranes’ songs in the void; as the five-colored clouds interweave, the chariot reverently awaits the phoenix’s cry beneath the feathered canopy. Thrice have we invoked the Venerable Masters, ever adhering to the canonical rites.\n\nWe, your disciples, [Names], in all due reverence, address the Supreme Master of the Mysterious Center, the Jade Clarity August Sovereign of the Dao; the Three Heavens’ Supreme Master, the Orthodox Unity Celestial Master Perfected Lord; the Numinous Treasure Supreme Master, the Perfected Lord of Scriptures and Ordination; the Great Dharma Master Perfected Lord who Oversees the Fast; the Perfected Lord of the Left Palace of the Supreme Ultimate; the Perfected Lord of the Nine Provinces’ Immortal Historiographer; the Supreme Master of Human and Heavenly Teachings, the Perfected Lord Fuqiu of the Flowery Canopy; and all successive Venerable Masters of the Pure Tenuity, Numinous Treasure, and Orthodox Unity traditions.\n\nWe humbly beseech your compassion, that you may deign to turn your penetrating gaze upon us. Now, in reverent compliance with your august decree, we solemnly perform the Jade Register rites to offer and exalt this grand fast. Today, as the assembly ascends the altar to recite the *Nine Heavens’ Life-Generating Jade Chapters of the Cavernous Mystery and Numinous Treasure* from the seventh to the ninth recitation, we pray for the elevation of the soul of [Name] to purity and stillness, and for all solitary spirits in the dharma-realm to together realize their good causes, ascend to Perfection, and attain deliverance. Daring not act on our own, we once more present this declaration. We humbly implore your divine aid to uphold and guide us from beginning to end.",
      "overlap_context": "port, we have completed six recitations. We now offer our earnest thanks, relying upon your aid to bring this rite to completion. May no detail remain obscure, and may all Perfected Ones oversee the deliverance. As the recitation of the scripture nears its end, we pray for the flourishing of our Dao. At the close of this day, we shall perform the remaining rituals and present our humble devotion. Our hearts are filled with utmost reverence and gratitude.\n\nThus we respectfully declare. As before.",
      "start_char": 5523,
      "end_char": 5790,
      "start_sentence": 320,
      "end_sentence": 333,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.93028998374939,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "恭愿授下士不传之秘，发微阐幽； 开神魂受度之门，倾光回驾。 恭俟景命，宣演灵章。 臣干冒师严，下情不胜惶惧之至。 领众陛坛，恭行典式。 唱道 升坛 上香 信礼 默礼师，存念如法 请宣神咒 无上至真，大圣高尊。 布化运炁，三十二天。 八会九光，自然成文。 安镇天地，保制劫年。 元始符命，普告三元。 下敕九地，上关诸天。 中告海岳，名山大川。 今日上告，万神咸闻。 修斋行道，拔度幽魂。 三官九署，落灭恶根。 永度三途，五苦之源。 世世受福，记名丹篇。 神生天堂，炼化自然。 生死开度，亿劫长年。 九天符命，风火驿传。 鸣法鼓二十四通 无上三天玄元始三炁太上道君，召出臣等身中三五功曹、左右官使者、侍香金童、传言散花玉女、五帝直符直日香官，各三十六人出。 出者严装，关启所言。 臣今入意愿得太上十方正真生炁下降，流注臣等身中，令臣所启，速达径御无上至真三宝昊天玉皇上帝、东极救苦天尊九天生神上帝道前。 请称法位 具位臣姓某与礼官等，谨同诚上启太上无极大道虚无自然元始天尊，玉宸道君、灵宝天尊，太上老君、道德天尊，统天元圣天尊，寻声救苦天尊，朱陵度命天尊，东华木公上相青童道君，西灵金真万炁祖母元君，十方灵宝救苦天尊，十方已得道大圣众至真诸君丈人，九天生神上帝，三十二天上帝，三皇五老上帝，五福十神真君，东华南极西灵北真玄都玉京金阙七宝玄台紫微上宫灵宝至真明皇道君，上相上宰、上保上傅、四司五帝，、十方无极至真，三十六部尊经神仙，上清日月九曜，南辰北斗、万象高真，十方无极无量品至真大神，飞天神王长生大圣无量度人君，天真皇人妙行真人，三元三官大帝，九天采访使者，玄中大法师，三天大法师，灵宝三师真君，周天列宿星真，清微历代师真，九天天曹诸司上圣，北极四圣真君，南昌上下宫朱陵火府黄箓院主宰三元真君，度人不死诸位真君，兴生独隶可韩功都聚魂五府真宰，三界大勋魔王，侍经五帝，玉童玉女，九天符使，九天侍卫，一切灵仙，五岳五天圣帝、储副佐理真君，北阴酆都大帝，九垒帝君，五炁天君，十宫真君，三元宫府百二十曹、考官掾吏，十方九幽诸狱主者，水府扶桑大帝，旸谷神君，九江水帝，十二溪真雷霆雨部神祇法箓、官君将吏，巨天力士执罚神兵、五帝直符、六宫掾吏、牛头狱卒，马面大神、玄都茭龙驿吏、赍简童子、护戒威神、三界直符、四直功曹、城隍里社正神、侍香灵官、直符宣通召命，三界应感，一切威灵。 臣闻，龙汉开图，玉宇恢张於五太； 鹤鸣御运，金书罗络於三灵。",
      "translated_text": "May we reverently beseech the transmission of the esoteric secrets never imparted to the uninitiated, that the subtle be revealed and the profound be expounded; may the gates of deliverance for the divine souls be flung open, and the radiant light be turned back to guide their return. We await your august command to proclaim and intone the sacred chapters.\n\nDaring to presume beneath the awe of your majesty, we below are overwhelmed with trepidation. Leading the assembly to ascend the altar, we reverently perform the prescribed rites:\n\n**Chanting the Dao, ascending the altar, offering incense, making the pledge, bowing in silence to the masters, and contemplating as prescribed.**\n\nWe invoke the proclamation of the divine incantations—**the Most Supreme Perfected, the Great Sage and Lofty Venerables**—who spread transformation and circulate qi through the Thirty-Two Heavens. The Eight Assemblies and Nine Luminances naturally form their script, stabilizing heaven and earth and safeguarding the kalpas. The primordial mandate of the Originator is universally proclaimed to the Three Primes; below, it commands the Nine Earths, above, it seals the myriad heavens, and in the center, it announces to the seas and mountains, the great peaks and rivers. Today, we make this supreme declaration, and all spirits hear it. As we perform the fast and practice the Dao, we deliver the hidden souls. The Three Officials and Nine Bureaus eradicate their evil roots, forever liberating them from the Three Paths and the source of the Five Sufferings. Generation after generation, they receive blessings, their names inscribed in the cinnabar registers. Their spirits ascend to the heavens, refined and transformed by nature. The gates of life and death are opened for their deliverance, granting them eternal years through countless kalpas. The Nine Heavens’ mandate is transmitted by wind and fire couriers.\n\n**Strike the dharma drum twenty-four times.**\n\n**The Most Supreme Three Heavens’ Mysterious Originator, the Three Qi’s Most High Dao Lord**, summon forth from within our bodies the Three and Five Merit Officers, the Left and Right Attendants, the Incense-Bearing Golden Lads, the Message-Transmitting and Flower-Scattering Jade Maidens, the Five Thearchs’ Direct Envoys, and the Day-Officers of the Incense Bureau—thirty-six of each—to emerge. Let those who emerge be arrayed in solemn attire, and let the words we speak be conveyed without delay.\n\nWe now set our intention, praying that the life-generating qi of the Ten Directions’ Orthodox Perfected may descend and flow into our bodies, so that our supplications may swiftly reach the presence of the **Most Supreme Perfected Three Treasures, the August Jade Thearch of the Vast Heaven, the Heavenly Worthy of the Eastern Ultimate Who Saves from Suffering, and the Nine Heavens’ Life-Generating Thearch of the Dao**.\n\n**Announce the dharma ranks.**\n\nWe, your humble servants, [Name] and the ritual officers, together with utmost sincerity, reverently address the **Most High Limitless Dao, the Void and Spontaneous Originator Heavenly Worthy of Primordial Beginning; the Jade Clarity Dao Lord; the Heavenly Worthy of Numinous Treasure; the Most High Lord Lao, the Heavenly Worthy of Power and Virtue; the Heavenly Worthy Who Governs the Primordial Origin of All Under Heaven; the Heavenly Worthy Who Saves from Suffering at the Sound of a Cry; the Heavenly Worthy of the Cinnabar Mound Who Delivers Lives; the Eastern Florescence Lord of Wood, the Prime Minister Azure Lad Dao Lord; the Western Numinosity Golden Perfection, the Primordial Mother of the Myriad Qi; the Heavenly Worthies of the Ten Directions Who Save from Suffering through Numinous Treasure; the Great Sage Perfected of the Ten Directions Who Have Attained the Dao; the Host of Venerable Perfected Lords and Elders; the Life-Generating Thearch of the Nine Heavens; the Thearchs of the Thirty-Two Heavens; the Three Sovereigns and Five Elders; the True Lords of the Five Fortunes and Ten Spirits; the Dao Lord of the Luminous Perfection of Numinous Treasure, Supreme August Sovereign of the Purple Tenuity’s Upper Palace in the Seven-Treasured Mysterious Terrace of the Jade Capital of the Dark Metropolis; the Prime Ministers, Grand Councillors, Protectors, and Instructors; the Four Offices and Five Thearchs; the Limitless Perfected of the Ten Directions; the Divine Immortals of the Thirty-Six Divisions of Venerable Scriptures; the Nine Luminaries of the Upper Clarity’s Sun and Moon; the Southern Asterisms and Northern Dipper; the Myriad Images’ Lofty Perfected; the Boundless Hosts of the Ten Directions’ Limitless Grades of Perfected Great Spirits; the Flying Heavenly Spirit Kings, the Great Sages of Eternal Life, the Boundless Lords Who Deliver Humanity; the Heavenly Perfected Sovereigns, the Perfected of Wondrous Conduct; the Three Primes and Three Officials Great Emperors; the Nine Heavens’ Investigating Envoys; the Great Dharma Masters of the Mysterious Center; the Great Dharma Masters of the Three Heavens; the Three Masters of Numinous Treasure; the Perfected of the Constellations Arrayed Across the Heavens; the Perfected Masters of Successive Generations of the Orthodox Unity; the Sacred Worthies of the Nine Heavens’ Offices and Bureaus; the Four Sacred Perfected of the Northern Ultimate; the Lords of the Upper and Lower Palaces of Southern Prosperity, the Cinnabar Mound’s Fire Mansion, and the Yellow Register’s Court; the Three Prime True Lords Who Govern the Yellow Register; the True Lords Who Deliver Lives and Grant Immortality; the True Lords of the Five Mansion Who Gather the Solitary Souls of the Departed; the Great Merit Kings of the Three Realms; the Five Thearchs Who Attend the Scriptures; the Jade Lads and Jade Maidens; the Envoys of the Nine Heavens’ Talismans; the Nine Heavens’ Guards; all the numinous immortals; the Sacred Thearchs of the Five Peaks and Five Heavens; the True Lords Who Assist and Govern; the Great Emperor of the Northern Darkness of Fengdu; the Lords of the Nine Ramparts; the Heavenly Lords of the Five Qi; the True Lords of the Ten Palaces; the Hundred and Twenty Offices of the Three Prime Palaces and their Examiners, Clerks, and Scribes; the Rulers of the Ten Directions’ Nine Dark Prisons; the Great Emperor of the Mulberry Tree of the Water Mansion; the Spirit Lord of the Sunrise Valley; the Water Thearchs of the Nine Rivers; the Perfected of the Twelve Brooks; the Divine Officials, Lords, Generals, and Clerks of the Thunder, Lightning, and Rain Departments; the Registers of the Dharma; the Mighty Heavenly Warriors Who Execute Punishments; the Divine Soldiers; the Direct Envoys of the Five Thearchs; the Clerks of the Six Palaces; the Ox-Headed Prison Guards; the Horse-Faced Great Spirits; the Courier Clerks of the Mysterious Metropolis’ Reed Dragon Post; the Lads Who Bear the Documents; the Guardians of the Precepts; the Mighty Spirits; the Direct Envoys of the Three Realms; the Four Direct Merit Officers; the City Gods and Village Earth Gods; the Incense-Attending Numinous Officials; the Direct Envoys Who Proclaim and Transmit Summons; the Responsive and Perceptive Spirits of the Three Realms; and all the majestic numina.**\n\nWe have heard that when the Dragon Han first unfolded its chart, the Jade Vault expanded across the Five Primes; when the Crane’s cry governed the kalpa, golden scriptures wove through the Three Numinous Ones.",
      "overlap_context": "o recite the *Nine Heavens’ Life-Generating Jade Chapters of the Cavernous Mystery and Numinous Treasure* from the seventh to the ninth recitation, we pray for the elevation of the soul of [Name] to purity and stillness, and for all solitary spirits in the dharma-realm to together realize their good causes, ascend to Perfection, and attain deliverance. Daring not act on our own, we once more present this declaration. We humbly implore your divine aid to uphold and guide us from beginning to end.",
      "start_char": 5790,
      "end_char": 6803,
      "start_sentence": 334,
      "end_sentence": 367,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.7986855506897,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "始青演妙而宝韵十回，空碧凝真而琅音九徧。 启神功於经纬，彰紫炁於玄黄。 凤篆昭回，琼阙俨飞天之卫； 龙章焕耀，紫宫敷典禁之藏。 为苦海之慈航，实昏衢之惠烛。 凡伸丹祷，必赖玄恩。 以今钦奉纶音，崇修玉箓大斋几昼夜，今则升坛，转咏洞玄灵宝九天生神玉章，升荐某灵，上生福境，下及孤幽，均证生方。 伏愿周回十方，提携万类。 升灵魂於宝界，濯幽爽於寒泉。 俾仗真乘，顿消妄业。 臣等稽首皈依，无极大道。 侍经白文 三皈依 宿命赞 侍经开经 敷座赞 静念如法 请转法轮 师题经 众讽经毕 侍经回向 解座吟",
      "translated_text": "At the inception of Azure Perfection, wondrous tones revolved tenfold; as the Void’s Azure congealed in truth, jade-like sounds resounded nine times. Unfolding divine works through warp and weft, manifesting purple qi amid the dark and yellow. Phoenix-script illumines in circling radiance, jasper towers stand as flying celestials’ guard; dragon-chapters blaze in splendor, the Purple Palace unfolds its treasury of prohibitions’ store. As the compassionate ferry across the sea of suffering, truly the kindling torch upon the darkened thoroughfare. All who offer sincere prayers must rely on the profound grace.\n\nNow, in reverent compliance with the imperial edict, we have solemnly observed the Jade Register Grand Fast for several days and nights. Today, ascending the altar, we chant and intone the *Dongxuan Lingbao Jiutian Shengshen Yuzhang*, ascending to present the spirit of so-and-so, that they may be reborn in the blessed realm above, and that the lonely and hidden below may equally attain the realm of life. We humbly pray that all ten directions be encompassed, all myriad beings be uplifted. May the soul ascend to the jeweled realm, the hidden and forlorn be cleansed in the cold spring. May they, by the true vehicle’s power, swiftly dissolve deluded karma.\n\nWe, your servants, bow our heads in homage, taking refuge in the Boundless Dao.\n\n*Attending the Scriptures: White Text*\n*Three Refuges*\n*Eulogy of Past Lives*\n*Attending the Scriptures: Opening the Sutra*\n*Eulogy for Seating*\n*Silent Contemplation in Proper Form*\n*Request to Turn the Dharma Wheel*\n*Master Inscribes the Sutra*\n*Assembly Recites the Sutra to Completion*\n*Attending the Scriptures: Dedication*\n*Chant Upon Rising from the Seat*",
      "overlap_context": "Direct Envoys of the Three Realms; the Four Direct Merit Officers; the City Gods and Village Earth Gods; the Incense-Attending Numinous Officials; the Direct Envoys Who Proclaim and Transmit Summons; the Responsive and Perceptive Spirits of the Three Realms; and all the majestic numina.**\n\nWe have heard that when the Dragon Han first unfolded its chart, the Jade Vault expanded across the Five Primes; when the Crane’s cry governed the kalpa, golden scriptures wove through the Three Numinous Ones.",
      "start_char": 6803,
      "end_char": 7063,
      "start_sentence": 368,
      "end_sentence": 389,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.05964994430542,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "步虚，旋行至兑宫，上香 师白文 伏闻，位正福堂，能弘敷於慈化； 惠施兑泽，每普度於神魂。 幽显沾恩，存亡获庆。 以今钦奉纶音，崇修玉箓，升荐某灵，进登清静，旁资苦爽，均证生方。 今者诵咏宝章已周七过。 沛玄恩而颁告，下冥府以施行。 伏愿普降慈光，鉴观情意。 俾即谐於惠泽，咸永赖於慈悲。 具有疏文，谨当宣告。 宣疏 谨请灵化梵辅天徐符使，速出斑次，祇受公文。 宣关 焚化 侍经开经 敷座赞 请转法轮 师题经 众讽经毕 侍经回向 解座吟 步虚，旋行至艮户，上香 师白文 伏闻镇居艮位，上尊灵宝之宫； 德摄鬼门，流布弥罗之炁。 施回生之大德，垂起死之神功。 以今钦奉纶音，崇修玉箓，升荐某灵，进登清静，旁资苦爽，均证生方。 今者诵咏宝章已周八过。 敬颁宣於恩命，祈拔度於神魂。 伏愿特赐神光，俾谐度命。 超苏滞爽，迁擢亡魂。 免沈坠於九幽，俾超凌於三界。 具有疏文，谨当宣告。 宣疏",
      "translated_text": "Proceeding in void-step, circumambulating to the Palace of Dui, offering incense.\n\n*The Master intones the White Text:*\nWe humbly recall: standing in the Hall of Blessings, one may broadly unfold compassionate transformation; bestowing the grace of Dui’s marsh, one ever universally delivers divine souls. The hidden and manifest receive favor, the living and deceased attain felicity.\n\nToday, reverently heeding the imperial edict, we solemnly perform the Jade Register rites, ascending and recommending the soul of [Name], advancing them to purity and stillness, aiding the suffering and forlorn, that all equally attain the realm of life. Now, the recitation of the precious chapters has completed seven cycles. Overflowing with profound grace, we proclaim and transmit below to the nether courts for enactment.\n\nWe humbly pray that universal compassionate radiance descend, beholding our sincerity. May all swiftly harmonize with beneficent grace, forever relying upon this mercy.\n\nA memorial document is prepared; we now respectfully proclaim it.\n\n*Proclamation of the Memorial*\nWe reverently invoke the Transcendent Brahma-Auxiliary Deva, the Swift Talisman Envoy, to swiftly emerge in ordered ranks and receive this official document.\n\n*Proclamation of the Pass*\nBurning and transformation.\n\n*Attending the Scriptures: Opening the Sutra*\n*Eulogy for Seating*\n*Request to Turn the Dharma Wheel*\n*Master Inscribes the Sutra*\n*Assembly Recites the Sutra to Completion*\n*Attending the Scriptures: Dedication*\n*Chant Upon Rising from the Seat*\n\nProceeding in void-step, circumambulating to the Gate of Gen, offering incense.\n\n*The Master intones the White Text:*\nWe humbly recall: dwelling in the Gen position, one presides over the august Palace of Numinous Treasure; virtue governs the Ghost Gate, diffusing the qi of boundless space. Bestowing the great power of rebirth, extending the divine efficacy of revivification.\n\nToday, reverently heeding the imperial edict, we solemnly perform the Jade Register rites, ascending and recommending the soul of [Name], advancing them to purity and stillness, aiding the suffering and forlorn, that all equally attain the realm of life. Now, the recitation of the precious chapters has completed eight cycles. Respectfully proclaiming the decree of grace, we pray for the deliverance of divine souls.\n\nWe humbly pray for the special bestowal of divine radiance, that they harmonize with the decree of deliverance. May the stagnant and lingering souls be liberated, the deceased be elevated. Spared from sinking into the Nine Nether Realms, may they transcend the Three Realms.\n\nA memorial document is prepared; we now respectfully proclaim it.\n\n*Proclamation of the Memorial*",
      "overlap_context": "e true vehicle’s power, swiftly dissolve deluded karma.\n\nWe, your servants, bow our heads in homage, taking refuge in the Boundless Dao.\n\n*Attending the Scriptures: White Text*\n*Three Refuges*\n*Eulogy of Past Lives*\n*Attending the Scriptures: Opening the Sutra*\n*Eulogy for Seating*\n*Silent Contemplation in Proper Form*\n*Request to Turn the Dharma Wheel*\n*Master Inscribes the Sutra*\n*Assembly Recites the Sutra to Completion*\n*Attending the Scriptures: Dedication*\n*Chant Upon Rising from the Seat*",
      "start_char": 7063,
      "end_char": 7472,
      "start_sentence": 390,
      "end_sentence": 424,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.620307922363281,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "谨请高虚清明天虞符使，速出班次，祗受公文。 宣关 焚化 侍经开经 敷座赞 请转法轮 师题经 众讽经毕 侍经回向 解座吟 步虚，旋行至离宫，上香 师白文 伏闻德辉离照，死生属统御之权； 化阐南调，罪福校重轻之柄。 普济沈沦之苦，咸蒙解脱之恩。 以今钦奉纶音，崇修玉箓，升荐某灵，进登清静，旁资苦爽，均证生方。 今者诵咏宝章已周九过。 广玄恩以宣告，下冥府而奉行。 伏愿体上帝之好生，施大慈而救苦。 拔神灵於九夜，度幽爽於重关。 具有疏文，谨当宣告。 宣疏 谨请无想无结无爱天潘符使，速出班次，祗受公文。 宣关 焚化",
      "translated_text": "We reverently invoke the Celestial Envoy of the High Void and Luminous Heavens, hasten forth from your ranks, and respectfully receive this official document.\n\n*Proclamation of the Memorial*\n*Burning of the Document*\n*Attendants prepare the scriptures*\n*Opening of the scriptures*\n*Arrangement of the ritual seats*\n*Chanting of the praises*\n*Invocation to turn the Wheel of the Dharma*\n*The master inscribes the scriptures*\n*The assembly completes the recitation*\n*Attendants dedicate the merit*\n*Chanting of the closing hymn*\n*Procession in the Void-Stepping Rite*\nProceeding to the Southern Palace, we offer incense.\n\nThe master presents the memorial:\n\nWe humbly acknowledge that the radiant virtue of the Southern Palace governs the authority over life and death; its transformative teachings of the Southern Realm weigh the balance of sin and blessing. May all who suffer in the depths of sinking receive the grace of liberation.\n\nToday, reverently heeding the imperial edict, we solemnly perform the Jade Register rites, ascending and recommending the soul of [Name], advancing them to purity and stillness, aiding the suffering and forlorn, that all equally attain the realm of life. Now, the recitation of the precious chapters has completed nine cycles. We broadly proclaim the profound grace, that it be honored and enacted in the Nether Realms below.\n\nWe humbly pray that, embodying the Divine Emperor’s love for life, great compassion be extended to save the afflicted. May divine souls be delivered from the Nine Nights, and the forlorn spirits pass through the layered barriers.\n\nA memorial document is prepared; we now respectfully proclaim it.\n\n*Proclamation of the Memorial*\n\nWe reverently invoke the Celestial Envoy of the Heaven of No-Thought, No-Attachment, and No-Desire, hasten forth from your ranks, and respectfully receive this official document.\n\n*Proclamation of the Memorial*\n*Burning of the Document*",
      "overlap_context": "apters has completed eight cycles. Respectfully proclaiming the decree of grace, we pray for the deliverance of divine souls.\n\nWe humbly pray for the special bestowal of divine radiance, that they harmonize with the decree of deliverance. May the stagnant and lingering souls be liberated, the deceased be elevated. Spared from sinking into the Nine Nether Realms, may they transcend the Three Realms.\n\nA memorial document is prepared; we now respectfully proclaim it.\n\n*Proclamation of the Memorial*",
      "start_char": 7472,
      "end_char": 7755,
      "start_sentence": 425,
      "end_sentence": 449,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.641557455062866,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "侍经叹经 三闻经 师收经赞 收经得道，随念往生。 无尽玄功，无边惠泽。 伏愿解分宿对，缘会当来。 不堕三途，悉蠲八难。 稽首皈依，无上道宝。 收经得道，随念往生。 无量洪恩，无边圣力。 伏愿潜停轮转，永断牵缠。 恶趣腾辉，神魂受炼。 稽首皈依，无上经宝。 收经得道，随念往生。 无极良缘，无穷妙力。 伏愿四司无滞，九署潜通。 魂度朱陵，神游紫府。 稽首皈依，无上师宝。 还神烧香 仙灵仙官、金童玉女、五帝五岳神仙真人，三炁正神，左右龙虎君，天仙地仙、五灵香官，当令召致十方正炁，自然生金液丹碧芝英。 百灵众真，交会在此，香火炉前。 令臣学道得道，求仙得仙。 十方仙童玉女，接侍香烟，传臣向来所启之诚，速达径御无上至真三宝昊天玉皇上帝、东极救苦天尊九天生神上帝道前。 谢神王 重称法位 具位臣姓某上启十方无极飞天神王使者，飞天吏兵圣众。 恭望祥光，俯回洞鉴。 切以九过生神，亶赖唱恭之惠； 三乘演妙，克承开宥之功。 昨为钦奉纶音，崇修玉箓大斋，升荐某灵，上登福境，旁资苦爽，均证生方。 向来领众升坛，转咏洞玄灵宝九天生神玉章，已周九过。 匪由圣造，曷遂圆隆。 庸罄微衷，重殚诚悃。 疏文叩诵，恭对披宣。 宣疏 宣关 疏文宣读，谅达渊聪。 伏愿监真度生，尚丐寻声而救苦； 倾光回驾，满祈应世以度人。 无任瞻依，不胜眷恋。 某等再拜恭虔，一心奉送。 修斋 云舆",
      "translated_text": "Upon attending the sutra, sighing the sutra, and thrice hearing the sutra,\nthe master gathers the sutra with praise—\ngathering the sutra to attain the Dao, following mindfulness to rebirth.\nBoundless mysterious merit, limitless grace and blessings.\nWe humbly pray to dissolve karmic entanglements of the past,\nand meet conditions for the future.\nMay none fall into the Three Wretched Realms,\nand all be freed from the Eight Difficulties.\nWe bow our heads in reverence, taking refuge in the supreme Dao-Treasure.\nGathering the sutra to attain the Dao, following mindfulness to rebirth.\nMeasureless vast grace, boundless sagely power.\nWe humbly pray that the wheel of rebirth be stilled,\nand the bonds of karmic entanglement forever severed.\nMay the dark realms shine with radiance,\nand divine souls undergo refinement.\nWe bow our heads in reverence, taking refuge in the supreme Sutra-Treasure.\nGathering the sutra to attain the Dao, following mindfulness to rebirth.\nInfinite good affinity, inexhaustible wondrous power.\nWe humbly pray that the Four Offices flow without obstruction,\nand the Nine Bureaus silently communicate.\nMay souls ascend the Vermilion Mound,\nand spirits wander the Purple Palace.\nWe bow our heads in reverence, taking refuge in the supreme Master-Treasure.\n\nReturning the spirits and burning incense.\nCelestial spirits and officials, golden lads and jade maidens,\nthe Five Emperors and Five Peaks’ immortals and perfected,\nthe Three Qi’s true deities, the Left and Right Dragon-Tiger Lords,\nheavenly immortals and earthly immortals, the Five Numinous Incense Officials—\nnow summon and gather the ten directions’ true qi,\nnaturally giving rise to golden liquid, cinnabar, and azure mushrooms.\nThe hundred numinous perfected hosts converge here,\nbefore the incense burner.\nMay your servant study the Dao and attain the Dao,\nseek immortality and attain immortality.\nMay the ten directions’ immortal lads and jade maidens\nattend the incense smoke,\nand swiftly convey the sincerity of your servant’s earlier entreaties\ndirectly to the presence of the Supreme Perfected Three Treasures,\nthe Jade Emperor of the Vast Heaven,\nthe Heavenly Worthy of Eastern Relief from Suffering,\nand the Nine Heavens’ Life-Generating Emperor of the Dao.\n\nGiving thanks to the divine kings.\nReiterating the dharma-ranks,\nyour servant, [Name], humbly addresses the ten directions’ boundless flying celestial divine kings and envoys,\nthe flying celestial officials and soldiers, the sagely hosts.\nWe reverently gaze upon the auspicious light,\nhumbly awaiting your penetrating insight.\nFor the ninefold recitation of the Life-Generating Scripture,\nwe rely entirely upon the grace of reverent chanting;\nthrough the Three Vehicles’ expounding of wonders,\nwe fully inherit the merit of opening and pardoning.\nYesterday, in reverent compliance with the imperial decree,\nwe solemnly performed the Jade Register Great Retreat,\nascending and recommending the spirit of [Name],\nto rise to the realm of blessings,\nand broadly aiding the forlorn souls to equally attain the realm of life.\nEarlier, leading the assembly to ascend the altar,\nwe turned and chanted the *Nine Heavens’ Life-Generating Jade Chapters of the Numinous Treasure of the Cavernous Mystery*,\ncompleting nine cycles.\nWithout the sagely creation, how could perfection be achieved?\nWe exhaust our humble devotion, redoubling our sincerity.\nThe memorial document was recited with reverence,\nand respectfully proclaimed in full.\nProclamation of the Memorial.\nProclamation of the Pass.\nThe memorial document has been proclaimed;\nwe trust it reaches your profound wisdom.\nWe humbly pray that you oversee the deliverance of beings,\nand, hearing their cries, hasten to save the suffering;\nthat you turn your radiant chariot and return,\nfulfilling our prayers to deliver the world.\nWe cannot express our reverence,\nnor our longing.\nWe, [Names], bow again in reverent devotion,\nand with one heart, respectfully send you forth.\nRetreat concluded.\nCloud chariots depart.",
      "overlap_context": " great compassion be extended to save the afflicted. May divine souls be delivered from the Nine Nights, and the forlorn spirits pass through the layered barriers.\n\nA memorial document is prepared; we now respectfully proclaim it.\n\n*Proclamation of the Memorial*\n\nWe reverently invoke the Celestial Envoy of the Heaven of No-Thought, No-Attachment, and No-Desire, hasten forth from your ranks, and respectfully receive this official document.\n\n*Proclamation of the Memorial*\n*Burning of the Document*",
      "start_char": 7755,
      "end_char": 8338,
      "start_sentence": 450,
      "end_sentence": 492,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.921512126922607,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "送出焚燎 谢师 具位臣姓某上启玄中教主、玉虚明皇道君，三天教主、正一天师真君，灵宝教主、经籍度师真君，监斋大法师真君，太极左宫仙公真君，九州都仙太史真君，人天教主、华盖浮丘真君，清微灵宝道德正一历代师尊。 恭望师慈，俯回洞鉴。 臣向来升坛，转咏洞玄灵宝九天生神玉章，升荐某灵，进登福境，旁资苦爽，均证生方。 仰荷主维，功成九过，惧形神之未定，愿念虑之有差。 所冀宽原，庶成善果。 伏愿帝临无贰，天诱其衷。 开度受生，魂咸离幽阴之境； 应会感灵，数俾全交泰之功。 干冒师严，臣等下情，不胜惶惧虔谢之至。 谨言。 修斋",
      "translated_text": "Upon the conclusion of the offering by fire,\nwe, your humble servants [Names], in our proper ranks,\nrespectfully address the Sovereign of the Mystic Teaching of the Cavernous Mystery,\nthe Jade Clarity August Emperor Dao Lord,\nthe Three Heavens’ Sovereign and Orthodox Unity Celestial Master Perfected Lord,\nthe Sovereign of the Numinous Treasure and Perfected Lord of the Canonical Preceptor,\nthe Perfected Lord Great Dharma Master Supervising the Retreat,\nthe Perfected Lord Immortal Duke of the Left Palace of the Supreme Ultimate,\nthe Perfected Lord Grand Scribe of the Nine Provinces’ Immortals,\nthe Sovereign of the Teaching for Humans and Devas and Perfected Lord Fuqiu of the Canopy,\nand the successive preceptor lords of the Pure Tenuity, Numinous Treasure, Dao Virtue, and Orthodox Unity traditions.\n\nWe reverently beseech your compassionate regard,\nthat you deign to turn your penetrating insight upon us.\nWe, having ascended the altar and recited the *Jade Chapters of the Nine Heavens’ Life-Generating Numinous Treasure of the Cavernous Mystery*,\nhave ascended and recommended the spirit of [Name],\nadvancing it to the realm of blessedness,\nextending aid to the suffering and departed,\nand universally guiding all toward the attainment of life’s true domain.\nThrough your sovereign oversight,\nthe nine cycles have been completed.\nYet we fear the unsettled state of form and spirit,\nand dread the errors that may arise in thought and intention.\nWe humbly implore your forbearance,\nthat the good fruit may be brought to fulfillment.\n\nWe pray that the imperial presence remain unwavering,\nand that Heaven incline its will toward us.\nMay those receiving rebirth be delivered,\ntheir souls all freed from the dark yin realms;\nmay responsive encounters with the numinous be fulfilled,\nand the work of perfect harmony be wholly achieved.\nWe presume upon your august severity,\nand in our lowly devotion,\nare overwhelmed with awe and reverent gratitude.\nThus we respectfully submit.\n\nRetreat concluded.",
      "overlap_context": "clamation of the Pass.\nThe memorial document has been proclaimed;\nwe trust it reaches your profound wisdom.\nWe humbly pray that you oversee the deliverance of beings,\nand, hearing their cries, hasten to save the suffering;\nthat you turn your radiant chariot and return,\nfulfilling our prayers to deliver the world.\nWe cannot express our reverence,\nnor our longing.\nWe, [Names], bow again in reverent devotion,\nand with one heart, respectfully send you forth.\nRetreat concluded.\nCloud chariots depart.",
      "start_char": 8338,
      "end_char": 8595,
      "start_sentence": 493,
      "end_sentence": 505,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.104896783828735,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "云舆 玉箓生神资度转经仪竟 #1『玉』原作『王』，误，据上下文义改。",
      "translated_text": "The Rite of the Cloud Chariot and the Jade Register for the Nurturance of Life through the Recitation of Transformative Scriptures is now concluded.\n*(Note: \"Jade\" (玉) was originally written as \"King\" (王), an error corrected here in accordance with the context.)*",
      "overlap_context": "d fruit may be brought to fulfillment.\n\nWe pray that the imperial presence remain unwavering,\nand that Heaven incline its will toward us.\nMay those receiving rebirth be delivered,\ntheir souls all freed from the dark yin realms;\nmay responsive encounters with the numinous be fulfilled,\nand the work of perfect harmony be wholly achieved.\nWe presume upon your august severity,\nand in our lowly devotion,\nare overwhelmed with awe and reverent gratitude.\nThus we respectfully submit.\n\nRetreat concluded.",
      "start_char": 8595,
      "end_char": 8635,
      "start_sentence": 506,
      "end_sentence": 508,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.025237560272217,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度转经仪.txt",
        "category": "威仪类"
      }
    }
  ]
}