{
  "source_id": "玉箓生神资度开收仪",
  "source_file": "chunked_daozang\\玉箓生神资度开收仪.json",
  "total_chunks": 12,
  "total_original_chars": 3927,
  "total_translated_chars": 28043,
  "total_translation_time": 163.26592421531677,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度开收仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**Jade Register Ritual for Generating Spirits, Bestowing Salvation, Opening, and Gathering**\n\n*Scripture Title:* *Jade Register Ritual for Generating Spirits, Bestowing Salvation, Opening, and Gathering*. One fascicle. Base text from *Zhengtong Daoist Canon*, *Dongxuan* Section, *Weiyi* Category.\n\n**Jade Register Ritual for Generating Spirits, Bestowing Salvation, Opening, and Gathering**\n\n**Morning Audience**\n\n**Attending the Scripture – Invocation**\n\nWe humbly invoke the Primordial Origin of the Mysterious qi, which governs the Three Treasures and inscribes the Dragon Script; the True Ancestor of the Dao and virtue, which illumines the Nine Heavens and forms the Phoenix Seal. The wondrous meanings of the *Dongzhen*, *Dongxuan*, and *Dongshen* [scriptures]; the numinous texts of the *Tai Xuan*, *Tai Ping*, and *Tai Qing*. In all, eighteen thousand chapters, concealed within thirty-six divisions. Some refined into gold to form characters, some kneaded from jade to compose script. Mysterious beyond mystery, quiescent beyond quiescence.\n\nAs the Eight Venerables of hoary heads could not discern the separation of heaven and earth in their time, nor could the Nine Elders of white brows fathom the division of the cosmos thereafter. Boundless and infinite, now sinking, now floating, now square, now round, now hidden, now manifest. Void and still, yet not existing; fleeting and indistinct, as if nonbeing.\n\nThus, when the *Celestial Treasure* is recited, it opens the radiance of heaven and earth; when the *Numinous Treasure* is recited, it delivers the souls of the Nine Dark Realms from eternal night. When the *Spirit Treasure* is recited, it subdues spirits; when the *Taiyi* is recited, it shapes forms; when the *Nine Heavens* is recited, it generates gods and ghosts. Spirits hear it and ascend; mortals hear it and endure; suffering souls hear it and attain deliverance; withered ashes hear it and emit smoke; infants hear it and speak; the dead hear it and return to life.\n\nAs for the divine mysteries of the Three Treasures and the myriad roots of the profound, they are concealed within jade tablets and not transmitted until gold and treasures are offered. Praise cannot exhaust them; their merit and virtue are boundless.\n\nNow, in reverent compliance with the imperial decree, we solemnly perform the *Great Fast of the Jade Register*, elevating and recommending the spirit of [Name], ascending to purity and stillness. We further contemplate the multitude of solitary, suffering souls in the dharma-realm, unable to honor their qi, esteem their forms, cherish their spirits, or preserve their lives. They brought ruin upon themselves, severed from their original truth. Once departed, they wander in darkness, their souls drifting without return. Gathered in flight through the void, their former clarity is mostly lost. Ignorant of the way of life and transformation, they inevitably fall into the depths of suffering.\n\nToday, we solemnly array the ritual assembly and reverently initiate the immortal rites. Precious incense perfumes the Nine Heavens; the torch of wisdom illumines the Ten Lands. Through this supreme goodness, we mourn the departed spirits.\n\nWe humbly beseech the Golden Palace to extend its grace, the Jade Clarity to bestow its benevolent command. Refine the souls in the Palace of Lesser Yin, restore the spirits to the Courtyard of Flowing Fire. Relying upon the scripture of the Nine Crossings, ascend directly to the realm of the Three Heavens.\n\nThe assembly, with sincere devotion, prostrates in reverence.\n\n**Three Refuges**\n**Hymn of Past Lives**\n**Attending the Scripture – Opening the Scripture**\n\n*Invocation*\n\nAs the scripture turns through its first recitation, its voice pierces the Nine Heavens; as the decree traverses the Three Paths, the soul is no longer bound to the Ten Lands. Today, upon ascending the altar for the first crossing, we intone the *Jade Chapters of the Nine Heavens for Generating the Divine*. We dedicate this merit to the Emperor of the Infinite Heaven of Yudu, praying for the grace to elevate the spirit of [Name], that they may ascend to the immortal realm, and extending this blessing to all forsaken and lost beings throughout the Dharma realms.\n\nMay they awaken to the illusory and false nature of their former existence, attaining perfect clarity in the One Truth; may they untangle the karmic bonds of past lives, with all transgressions dissolved and eradicated. The long night yields to purity, and the spirit-soul undergoes refinement. May they never enter the prison of wind and thunder, spared the torment of flying spears and drifting halberds; may they be reborn in the primordial womb of life, attaining the fruit of refining qi and achieving immortality. Freed from all obstructions, they shall roam in boundless ease.\n\nWe bow our heads to the August Void, cultivating the scripture’s Dharma.\n\n**Hymn of the Dharma Seat**\n*Silent contemplation in accordance with the rites*\nIn profound stillness, reaching the ultimate source—\nFor kalpas unending, they shall dwell as immortals.\n\n**The Master Inscribes the Scripture**\n**The Assembly Completes the Recitation**\n**Hymn of Rising from the Seat**\n\n**Attending the Scripture – Dedication of Merit**\nWe look up in reverence to the Three Sublime Realms and the Nine Heavens’ exalted sages. Turning our compassionate intent below, we beseech that they bestow their witness and alliance. We, your servants, have now completed one recitation of the precious scripture. Relying upon its Dharma, we elevate the spirit of [Name], guiding them to ascend to the realm of purity, and extending this merit to all forsaken and lost beings throughout the Dharma realms, that they may transcend the depths of darkness and ascend to the Dao’s domain. May all beings universally partake in this goodness and blessing.\n\nWe bow our heads in devotion and proceed with hymns of praise.\n\n**Celestial Procession**\n*Circumambulation with incense*\n\n**Master’s Proclamation of the Text – Declaration of Petitions or Talismans**\n\nThe attendant scripture now proclaimed, the second recitation begins:\n*One chant, and the myriad Perfected respond in harmony—*\nFirst, we extend our sincerest devotion in recitation and praise.\n*Twice recited, and Heaven and Earth commune—*\nAgain, we perform the rites of exaltation and hymnody.\n\nOn this day, ascending the altar for the second recitation, we turn to intone the *Jade Chapters of the Nine Heavens’ Life-Generating Spirit*. In dedication, we direct this merit to the Most Sublime Meditative Virtue, the Boundless-Longevity Heavenly Emperor, beseeching grace to elevate and recommend [Name]’s spirit, guiding them to ascend to the immortal realms, and extending this to all forsaken and lost beings throughout the Dharma realms. May all who hear this scripture awaken to the Dao, their transgressions absolved and karmic entanglements dissolved.\n\nFrom the Eastern Palace, may the grace of deliverance from suffering be bestowed;\nFrom the Northern Bureau, may the characters of rebirth be inscribed.\nSpared from the Brazen-Pillar Hell, they shall not clasp their hands in despair but ascend with ease.\nReborn in the primordial essence of life, may their spirit be whole and their qi gathered.\nTranscending to the Dao’s domain, may they be transformed and dwell among humans and devas.\n\nWe bow our heads in reverence to the August Void, cultivating the scripture’s Dharma.\n\n**Expounding the Seat – Hymn of Praise**\n*Request to Turn the Dharma Wheel*\n\n**Master Inscribes the Scripture**\n**Assembly Recites the Scripture to Completion**\n**Rising from the Seat – Hymn**\n\n**Attending the Scripture – Dedication of Merit**\nWe look up in reverence to the Three Sublime Realms and the Nine Heavens’ exalted sages. Turning our compassionate intent below, we beseech that they bestow their witness and alliance. We, your servants, have now completed two recitations of the precious scripture. Relying upon its Dharma, we elevate the spirit of [Name], guiding them to ascend to the immortal realms, and extending this merit to all forsaken and lost beings throughout the Dharma realms, that they may emerge from the depths of darkness and transcend to the Dao’s domain. May all beings universally partake in this excellence and blessing.\n\nThe Dharma assembly proceeds according to ritual, circumambulating in hymns of praise.\n\n**Celestial Procession**\n*Circumambulation with incense*\n\n**Master’s Proclamation of the Text**\nProclamation of the memorial or talisman, announcement of the petition, burning and offering—now that the scripture’s recitation has been opened, the third recitation of the precious canon is complete. The divine soul has received deliverance, at once plucked from the Nine Dark Realms.\n\nOn this third ascent to the altar, we turn and chant the *Nine Heavens’ Jade Scripture of Life-Generating Spirit*. We dedicate this merit to the Heavenly Emperor of the Vast Extension, praying for the elevation and advancement of [Name]’s soul to the immortal realms, extending this grace below to all forsaken and lost beings throughout the Dharma realms.\n\nMay the sea of desire settle its waves, may the river of attachment still its currents. The sins of accumulated lifetimes’ cultivation shall from this moment dissolve; the errors of many births’ past misdeeds shall henceforth be released. Let them not enter the fire-obscuring hells, where heat and torment are transformed into cool clarity. Let the soul’s original mandate be reborn, attaining carefree ease without hindrance. Merging with the empty and cavernous *qi*, may they rejoice before the Most High.\n\nWe bow our heads in reverence to the Void Sovereign, practicing the scripture’s Dharma.\n\n*Seating the Altar – Hymn of Praise*\n*Invitation to Turn the Dharma Wheel*\n*Master Intoning the Scripture*\n*Assembly Completing the Recitation*\n*Chant of Rising from the Seat*\n*Dedication of Merit*\n\nWe look up in reverence to the Three Sublime Realms and the Nine Heavens’ exalted sages. Turning our compassionate intent below, we beseech that they bestow their witness and alliance. We have now completed three recitations of the precious scripture. Relying upon its Dharma, we elevate the spirit of [Name], guiding them to ascend to the immortal realms, and extending this merit to all forsaken and lost beings throughout the Dharma realms, that they may emerge from the depths of darkness and be raised to the Dao’s domain. May all beings universally partake in this excellence and blessing.\n\nThe Dharma assembly proceeds according to ritual, circumambulating in hymns of praise.\n\n*Celestial Procession*\n*Circumambulation with incense*\n\n*Master’s Proclamation*\n*Announcement of Petition or Talismanic Script*\n*Invocation of the Celestial Gate*\n*Burning and Offering*\n\nThree recitations of the sutra are heard once more. The incense is returned to the censer, and the altar is descended. Gratitude is offered to the master, and the midday audience begins. The Three Refuges are recited, followed by the *Hymn of Past Lives* and the opening of the fourth scripture recitation.\n\n*The Nine Natural Chapters*\n*The Hidden Rhymes of the Heavenly Perfected*\n\nAfter four recitations, the corporeal husk is opened and sundered. Now, ascending the altar for the fourth recitation, we intone the *Jade Chapters of the Nine Heavens’ Life-Generating Spirits*. The merit is dedicated in silence to the Lord of the Tusita Heaven, praying for the elevation of [Name]’s spirit to ascend to the immortal realms, and extending this grace to all forsaken and lost beings throughout the Dharma realms.\n\nMay their transgressions dissolve like melting snow, their karmic obstructions thaw like melting ice. May they awaken to the causes of life and death, and suddenly perceive the transformations of emptiness and non-being. May they avoid the butchering hells, sparing them the sorrow of dismemberment; may their ethereal souls and vital essence be reborn, granting them the joy of carefree wandering in Penglai’s isles. May they be reborn in the realm of divine immortals, soaring to the Queen Mother’s abode.\n\nWe bow our heads in reverence to the Void Sovereign, practicing the scriptural Dharma.\n\n*Chant of the Seat’s Arrangement*\n*Silent Contemplation in Accordance with the Dharma*\n\nIn profound stillness, we reach the ultimate source—may they, in life after life, dwell as immortals’ kin.\n\n*Request to Turn the Dharma Wheel*\n*Master’s Inscription of the Scripture*\n\nAfter the assembly has chanted the sutra to completion,\nthe Seat is released with a hymn,\nand the attendants make their dedications.\n\nWe lift our gaze in reverence to the Three Sublime Realms’ exalted lords,\nto the Nine Heavens’ august sages.\nMay their compassionate grace descend,\nbestowing upon us the seal of their witness.\n\nWe, your servants, have recited the precious scripture four times in full.\nBy the power of this Dharma,\nmay the soul of [Name] ascend to realms of purity,\nand may all forsaken and suffering beings of the Dharma-realm\ntranscend their dark abodes,\nrising to the Dao’s domain.\nMay all beings universally partake in this supreme merit.\n\nThe Dharma assembly, with utmost devotion,\ncircles in procession, chanting praises.\n*Step into the Void*\nProcess in reverence, offering incense.\n\nThe Master presents the text,\nproclaims the memorial or talisman,\nannounces the petition,\ndeclares the invocation,\nand performs the burning rites.\n\nThe attendants open the scripture for the fifth recitation.\nThe numinous voice resounds, completing the fifth turning of the Wheel;\nthe departed receive and uphold it, their sins of many lives absolved.\n\nOn this fifth ascent to the altar,\nwe chant the *Nine Heavens’ Jade Scripture of Life-Generating Spirits*.\nWe dedicate this to the Heavenly Emperor of the Joyous Realm of Pāramitā,\npraying for the soul of [Name] to ascend to the immortals’ realm,\nand for all forsaken and suffering beings of the Dharma-realm.\n\nMay they awaken to the illusions of the past,\nand seize the auspicious causes of this day.\nMay wholesome thoughts arise at once,\nand all roots of evil be extinguished.\nMay they avoid the Diamond Hell,\nspared the sorrow of bonds and imprisonment;\nmay their viscera and vital essence be reborn,\nattaining the wondrous reversal of water and fire.\nRefining the embryo to return to the origin,\nthey shall realize the Dao and attain perfection.\n\nWe bow our heads in reverence to the Void Sovereign,\npracticing the scriptural Dharma.\n*Chant of the Seat’s Arrangement*\n*Request to Turn the Dharma Wheel*\n*Master’s Inscription of the Scripture*\n\nAfter the assembly has chanted the sutra to completion,\nthe Seat is released with a hymn,\nand the attendants make their dedications.\n\nWe look up in reverence to the Three Realms’ exalted ones,\nto the Nine Heavens’ sacred sages.\nWe bow in gratitude for their compassionate response,\ntogether bestowing confirmation of our covenant.\n\nYour servants have chanted the precious scripture,\ncompleting five recitations in full.\nRelying upon the scriptural Dharma,\nwe ascend and recommend the spirit of [Name],\nadvancing them to the immortal realms,\nextending to all forsaken and obscured beings of the Dharma-realm.\nMay they depart from darkness and obscurity,\nascend to the Dao’s境界,\nand may all universally partake in this sublime attainment.\n\nThe Dharma assembly, with utmost devotion,\nproceeds in circumambulation, offering praises.\n*Step into the Void*\n*Circumambulation*\n*Offering of Incense*\n*Master’s Declaration of the Text*\n*Proclamation of the Petition or Talisman*\n*Announcement of the Petition’s Presentation*\n*Proclamation of the Pass*\n*Fumigation*\n\nThe attendants open the scripture,\nbeginning the sixth recitation.\nNine *qi* fuse and coalesce,\nforming the profound scripture of the Nine Heavens;\nsix recitations unfold and proclaim,\nfreeing beings from the suffering of the Six Paths’ rebirth.\n\nOn this day, as the sixth recitation upon the altar commences,\nwe turn and chant the *Jade Scripture of the Nine Heavens’ Life-Generating Spirit*.\nWe dedicate this to the Responsive Heavenly Emperor of Primordial Transformation,\npraying for the ascent and recommendation of the spirit of [Name],\nadvancing them to the immortal realms,\nextending to all forsaken and obscured beings of the Dharma-realm.\n\nMay they reflect the light back to its source,\nabandon delusion and return to truth.\nMay their names be stricken from the Black Register,\nand their steps wander the Yellow Flower Fields.\nMay they avoid the Fire-Cart Hell,\nforever spared the sorrow of dismemberment;\nmay their spirit and vital essence be reborn,\nimmediately attaining the fruit of soul-refinement.\nWith all obstructions dissolved,\nthey shall forthwith enjoy boundless freedom.\n\nWe bow our heads in reverence to the Void Sovereign,\npracticing the scriptural Dharma.\n*Chant of the Seat’s Arrangement*\n*Request to Turn the Dharma Wheel*\n*Master’s Inscription of the Scripture*\nAfter the assembly has chanted the sutra to completion,\nthe Seat is released with a hymn,\nand the attendants make their dedications.\n\nWe reverently gaze upon the Three Realms’ exalted sovereigns,\nthe Nine Heavens’ august sages.\nBowing in humble gratitude for their compassionate response,\nwe together receive the covenant of verification.\n\nWe have chanted the precious scripture six times in full.\nRelying upon the scriptural Dharma,\nwe ascend and present the soul of [Name],\nadvancing them to the immortal realms,\nand extending to all forsaken and obscure beings of the Dharma-realm:\nmay they depart from the depths of darkness,\nascend to the Dao’s境界,\nand universally partake in this supreme attainment.\n\nThe assembly, with utmost devotion,\ncircumambulates in hymns of praise.\n*Step into the Void*\n*Circumambulation*\n*Offering of Incense*\n*The Master’s Petition*\n*Proclamation of the Memorial or Talisman*\n*Announcement of the General*\n*Proclamation of the Pass*\n*Fumigation*\n*Threefold Hearing of the Scripture*\n*Return to the Censer*\n*Descend from the Altar, Gratitude to the Master*\n*Recitation of Virtues*\n*Evening Audience*\n*Three Refuges*\n*Hymn of Past Lives*\n*The Scripture’s Opening, Seventh Recitation*\n\nThe Three Caverns’ soaring primordial qi\nweaves cloud-seals into script;\nthe Seven Recitations’ layered gates unlock,\nresonating with numinous sound to raise the dead.\n\nOn this seventh ascent of the altar,\nwe chant the *Jade Chapters of the Nine Heavens’ Life-Generating* anew.\nWe dedicate this to the Heavenly Emperor of Numinous Transformation and Brahma’s Assistants,\npraying for the ascent and presentation of [Name]’s soul,\nadvancing them to the immortal realms,\nand extending to all forsaken and obscure beings of the Dharma-realm:\nmay they henceforth behold the sunlight,\nforever forsaking the gloom of darkness.\nMay they avoid the Nether-Frigid Hell,\nspared the sorrow of frozen limbs;\nmay they be reborn in the Primordial Palace,\nreceiving the spring-renewing qi of the Sunlit Valley.\nWith their spirit serene and limpid,\nmay they roam the Three Realms at will.\n\nWe bow our heads in reverence to the Void Sovereign,\npracticing the scriptural Dharma.\n*Chant of the Seat’s Arrangement*\n*Silent Recitation According to the Rite*\n*In profound stillness, reaching the ultimate source,*\n*may they, life after life, become immortals’ kin.*\n*Request to Turn the Dharma Wheel*\n*Master’s Inscription of the Scripture*\n\nAfter the assembly has chanted the scripture to its close,\nthey rise from their seats in melodic recitation,\nand in attendant devotion offer the merit of the sutra’s turning.\nWe lift our gaze in reverence to the Three Sublime Realms’ exalted lords,\nthe Nine Heavens’ august sages.\nMay their compassionate grace descend,\nbestowing equal witness to our covenant.\n\nWe, your servants, have recited the precious chapters seven times in full.\nRelying upon the scriptural Dharma,\nwe ascend and present the soul of [name],\nadvancing them to the immortal realms,\nand extending to all forsaken and obscure beings of the Dharma-realm:\nmay they depart the depths of darkness,\nascend to the Dao’s domain,\nand may all universally partake in this supreme attainment.\nThe Dharma assembly, in devout sincerity,\nproceeds in circling praise and chant.\n*Stepping the Void*\nCircling procession,\noffering incense.\n*The Master’s Declaration of the Text*\nProclamation of the memorial or talisman,\n*Declaration of the Petition*\nProclamation of the petition,\nburning and transformation.\nThe attendant scripture is opened for the eighth recitation.\nEight recitations unfold the essence of the *Life-Spirit of the Nine Heavens*,\nilluminating the darkest night;\nthe soul’s work of returning to its origin is accomplished,\nand liberation is attained in due time.\n\nAt this eighth ascent to the altar,\nwe turn and chant the *Jade Chapters of the Life-Spirit of the Nine Heavens*,\ndirecting the merit toward the Emperor of the High Void and Luminous Heavens.\nWe pray for grace to ascend and present the soul of [name],\nadvancing them to the immortal realms,\nand extending to all forsaken and obscure beings of the Dharma-realm.\nMay they never lose their original nature,\nsuddenly awakening to the unconditioned.\nMay they sever the roots of desire and attachment,\nand condense the true spirit’s qi into radiant essence.\nMay they avoid the Cauldron and Scalding Peaks,\nspared the torment of furnace and charcoal;\nmay they be reborn in the Radiant Palace of Primordial Qi,\nencompassed by the refining work of yin and yang.\nForever may they become companions of carefree wandering,\nunbound by the constraints of forced union.\nWe bow our heads in reverence to the Void Sovereign,\npracticing the scriptural Dharma.\n*Chant of the Seat’s Arrangement*\n*Request to Turn the Dharma Wheel*\n*Master’s Inscription of the Scripture*\nAfter the assembly has chanted the scripture to its close,\nthey rise from their seats in melodic recitation,\nand in attendant devotion offer the merit of the sutra’s turning.\n\nWe gaze in reverence to the Three Realms’ exalted lords,\nthe Nine Heavens’ sacred sages.\nBowing in humble response to their compassionate creation,\nwe together receive the covenant of realization.\nYour servants have chanted the precious scripture,\ncompleting eight full recitations.\nRelying upon the scriptural Dharma,\nwe ascend and recommend the spirit of [Name],\nadvancing them to the immortal realm,\nand extending to all beings in the Dharma-realm—\nthe forsaken, the hidden, the lost—\nemergence from dark obscurity,\nascension to the Dao-boundary,\nuniversally bestowing upon all\nthe shared blessing of victory.\n\nThe Dharma assembly, in devout sincerity,\nproceeds in circumambulation, chanting praises.\n*Procession in Void-Stepping*\n*Circumambulation, Offering Incense*\n*Master’s Declaration of Text*\n*Proclamation of Petition or Talisman*\n*Announcement of Presentation*\n*Proclamation of Passages*\n*Fumigation*\n*Attendants open the scripture—Ninth Recitation*\n\nTen thousand perfected ones approach the Emperor’s throne,\ngazing upon the three hues in the empty mystery;\nninefold completion fulfills the work of humanity,\ncelebrating the joy of all heavens.\n\nToday, upon the altar’s ninth recitation,\nwe turn and chant the *Jade Chapter of the Nine Heavens’ Life-Generating Spirit*.\nWe dedicate this to the Emperor of the Desireless, Unbound, Unattached Heaven,\npraying for grace to ascend and recommend the spirit of [Name],\nadvancing them to the immortal realm,\nand extending to all beings in the Dharma-realm—\nthe forsaken, the hidden, the lost.\n\nMay they seize the moment to awaken,\ntransforming upon witnessing goodness.\nBeholding the Most High’s compassionate radiance,\nmay suffering souls be delivered to the Cinnabar Realm.\nSpared entry into the Universal Seizure Hell,\nthey escape the chaos of golden hammers’ relentless torment;\nreborn in the Primordial Palace of Spirit,\nthey realize the wondrous subtlety of jade grottoes’ spirit-congealing.\nRiding the power of the Dao,\nthey ascend directly the immortal’s steps.\n\nWe bow our heads in reverence to the Void Sovereign,\npracticing the scriptural Dharma.\n*Chant of the Seat’s Arrangement*\n*Request to Turn the Dharma Wheel*\n*Master’s Inscription of the Scripture*\nAfter the assembly has chanted the scripture to its close,\nthey rise from their seats in melodic recitation,\nand in attendant devotion offer the merit of the sutra’s turning.\n\nBeholding the Three Realms’ lofty Venerables,\nthe Nine Heavens’ august Sages,\nwe turn our gaze below to their compassionate creation,\njointly bestowing confirmation of our covenant.\nWe, your servants, have chanted the precious scripture,\ncompleting its ninefold recitation.\nRelying upon the scriptural Dharma,\nwe ascend and recommend the soul of so-and-so,\nadvancing them to the immortal realm,\nextending to all forsaken and hidden beings,\nthat they may forever depart the dark netherworld,\nascend to the Dao’s domain,\nand universally partake in this sublime blessing.\nThe Dharma assembly, in devout reverence,\ncircumambulates in hymns of praise.\n\n*Circumambulation in Void-Stepping*\n*Circumambulation, Offering Incense*\n*Master’s Declaration of Text*\n*Proclamation of Memorial or Talisman*\n*Declaration of Petition*\n*Proclamation of Pass*\n*Fumigation*\n*Attending the Scripture, Hymning the Scripture*\n\nWe prostrate ourselves, acknowledging:\nThe Heavenly Worthy enacts the great compassionate transformation,\nbestowing grace upon all beings;\nthe Perfected One expounds the scripture of spontaneity,\nits merit perfected in ninefold recitation.\nThe true wind rises in the vast emptiness,\nthe Brahma-qi suffuses the cosmos.\nEmerging before the Great Void’s dawn,\noriginating at the Primordial Unity’s inception,\nwithout form or trace,\nnow present, now absent,\nit universally delivers humans and heavens,\nliberating wandering souls.\n\nNow, we ascend and recommend the soul of so-and-so to the immortal realm,\nextending our concern to the Dharma realm—\nall forsaken, suffering souls,\nwho in their worldly days,\nfrom time immemorial,\nremained unaware of their leaky, colored bodies,\nindulging in manifold karmic transgressions.\nSince their lives ended,\nthey have wandered the wheel of rebirth,\nunable to find liberation,\nunable to ascend.\nWithout deliverance,\nthey cannot escape sinking and drowning.\nFortunately, the Most High revealed the scripture to deliver humanity,\nthat spiritual souls might regrow their roots and restore their lives.\n\nJust now, leading the assembly to ascend the altar,\nwe turned and chanted the *Jade Scripture of the Nine Heavens’ Spontaneous Life*,\ncompleting its ninefold recitation.\nSolemnly, we employ it to ascend and recommend the soul of so-and-so,\nextending to all forsaken beings.\nWe humbly pray that the Nine Perfected Ones show compassion,\nthat the Nine Qi coalesce and congeal.\nAbove, may it reach the Nine Heavens,\nwhere auspicious clouds cover the Nine Palaces;\nbelow, may it behold the Nine Earths,\nwhere propitious light penetrates the Nine Springs.\nMay sunken souls and stagnant spirits all ascend,\nmay past karmic debts and old grievances all dissolve.\nSins like spring snow,\nmelt entirely in the warm sun;\ntransgressions like morning clouds,\nscatter completely in the clear wind.\nEver pure, ever still,\nwithout hindrance or coagulation.\nHeavenly essence flows radiantly,\nflying through the Nine Palaces.\nThe root of womb-bondage is untied,\nall sensory leaks exhausted.\nFreed from the shadowy netherworld,\nthey tread steadily upon the immortal’s steps.\nIn the Eight Poles’ palaces,\nthey shall forever be carefree companions;\nwithin the Nine Empyreans’ courts,\nthey shall dwell as chambers of joyous feasting.\n\nThe dedication is complete,\nthe scripture heard in accordance with Dharma.\n\n*Threefold Hearing of the Scripture*\n*Master Gathers the Scripture*\n\nThe incense brazier is replenished,\nWhite Spirits take leave at the altar’s front,\nthe Divine Kings descend the platform,\nguiding the spirits to rest within the curtained sanctuary.\nGratitude is offered to the master,\nmerit recited,\nthe Jade Register’s life-nurturing and salvation rites for opening and closing are complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玉箓生神资度开收仪 经名：玉箓生神资度开收仪。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 玉箓生神资度开收仪 早朝 侍经白文 伏以玄元始炁，治三宝而结龙章； 道德贞宗，映九天而成凤篆。 洞真、洞玄、洞神之妙义，太玄、太平、太清之灵书。 总之于万八千篇，秘之于三十六部。 或炼金而为字，或揉玉以成文。 玄之又玄，寂而又寂。 所谓八公皓首，当时未判玄黄； 九老白眉，阙后初分天地。 无穷无极，乍沈乍浮，能方能圆，或隐或显。 虚寂非有，怳忽若无。 以致天宝诵之，以开天地之光； 灵宝诵之，以度九幽长夜之魂。 神宝诵之，以制灵； 太乙诵之，以结形； 九天诵之，以生神鬼。 神闻之以升迁，凡夫闻之以长存，幽魂闻之以开度，枯灰闻之以发烟，婴孩闻之以能言，死骸闻之以还人。 至於三宝神奥，万品玄根。 秘玉笈而不传，赍金宝而方受。 赞扬难尽，功德无边。 以今钦奉纶音，崇修玉箓大斋，升荐某灵，进登清静，重念法界孤幽苦魂等众，不能尊其气，贵其形，爱其神，保其命，自取死坏，离其本真。 一逝洞群，魔游魄不顾返。 采集飞空，景旧爽多不存。 罔明生化之方，竟坠沈沦之趣。 今者严陈法会，肃启仙科。 宝香芬馥於九天，慧炬照临於十地。 以兹胜善，用悼魂灵。 伏望金阙覃恩，玉清惠命。 炼魂少阴之府，还神流火之庭。 仰凭九过之经，径陟三天之境。 法众运诚，志心皈命。 三皈依 宿命赞 侍经，开经 白文",
      "translated_text": "**Jade Register Ritual for Generating Spirits, Bestowing Salvation, Opening, and Gathering**\n\n*Scripture Title:* *Jade Register Ritual for Generating Spirits, Bestowing Salvation, Opening, and Gathering*. One fascicle. Base text from *Zhengtong Daoist Canon*, *Dongxuan* Section, *Weiyi* Category.\n\n**Jade Register Ritual for Generating Spirits, Bestowing Salvation, Opening, and Gathering**\n\n**Morning Audience**\n\n**Attending the Scripture – Invocation**\n\nWe humbly invoke the Primordial Origin of the Mysterious qi, which governs the Three Treasures and inscribes the Dragon Script; the True Ancestor of the Dao and virtue, which illumines the Nine Heavens and forms the Phoenix Seal. The wondrous meanings of the *Dongzhen*, *Dongxuan*, and *Dongshen* [scriptures]; the numinous texts of the *Tai Xuan*, *Tai Ping*, and *Tai Qing*. In all, eighteen thousand chapters, concealed within thirty-six divisions. Some refined into gold to form characters, some kneaded from jade to compose script. Mysterious beyond mystery, quiescent beyond quiescence.\n\nAs the Eight Venerables of hoary heads could not discern the separation of heaven and earth in their time, nor could the Nine Elders of white brows fathom the division of the cosmos thereafter. Boundless and infinite, now sinking, now floating, now square, now round, now hidden, now manifest. Void and still, yet not existing; fleeting and indistinct, as if nonbeing.\n\nThus, when the *Celestial Treasure* is recited, it opens the radiance of heaven and earth; when the *Numinous Treasure* is recited, it delivers the souls of the Nine Dark Realms from eternal night. When the *Spirit Treasure* is recited, it subdues spirits; when the *Taiyi* is recited, it shapes forms; when the *Nine Heavens* is recited, it generates gods and ghosts. Spirits hear it and ascend; mortals hear it and endure; suffering souls hear it and attain deliverance; withered ashes hear it and emit smoke; infants hear it and speak; the dead hear it and return to life.\n\nAs for the divine mysteries of the Three Treasures and the myriad roots of the profound, they are concealed within jade tablets and not transmitted until gold and treasures are offered. Praise cannot exhaust them; their merit and virtue are boundless.\n\nNow, in reverent compliance with the imperial decree, we solemnly perform the *Great Fast of the Jade Register*, elevating and recommending the spirit of [Name], ascending to purity and stillness. We further contemplate the multitude of solitary, suffering souls in the dharma-realm, unable to honor their qi, esteem their forms, cherish their spirits, or preserve their lives. They brought ruin upon themselves, severed from their original truth. Once departed, they wander in darkness, their souls drifting without return. Gathered in flight through the void, their former clarity is mostly lost. Ignorant of the way of life and transformation, they inevitably fall into the depths of suffering.\n\nToday, we solemnly array the ritual assembly and reverently initiate the immortal rites. Precious incense perfumes the Nine Heavens; the torch of wisdom illumines the Ten Lands. Through this supreme goodness, we mourn the departed spirits.\n\nWe humbly beseech the Golden Palace to extend its grace, the Jade Clarity to bestow its benevolent command. Refine the souls in the Palace of Lesser Yin, restore the spirits to the Courtyard of Flowing Fire. Relying upon the scripture of the Nine Crossings, ascend directly to the realm of the Three Heavens.\n\nThe assembly, with sincere devotion, prostrates in reverence.\n\n**Three Refuges**\n**Hymn of Past Lives**\n**Attending the Scripture – Opening the Scripture**\n\n*Invocation*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 575,
      "start_sentence": 0,
      "end_sentence": 40,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.933934926986694,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度开收仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "经翻一过，声洞彻於九天； 命度三途，魂不拘於十地。 以今升坛第一过，转咏九天生神玉章。 回向郁单无量天帝，祈恩升荐某灵，进登仙境，下及法界孤幽等众。 当愿悟从前幻妄之躯，一真明了； 解宿世萦缠之业，万罪荡除。 长夜开清，神魂受炼。 不入风雷狱，免飞戈飘戟之忧； 再生胞命元，证炼炁成仙之果。 了无罜碍，自在逍遥。 稽首虚皇，修行经法。 敷座赞 静念如法 寂寂至无宗，至世世为仙家。 师题经 众讽经毕 解座吟 侍经回向 仰惟三境高尊，九天上圣。 俯回慈造，同赐证盟。 臣等讽诵宝章，已周一过。 仰凭经法，升荐某灵，进登清静，下及法界孤幽，超离沈冥，上登道境。 普及一切，均沾善利。 稽首皈依，旋行赞咏。 步虚 旋行上香",
      "translated_text": "As the scripture turns through its first recitation, its voice pierces the Nine Heavens; as the decree traverses the Three Paths, the soul is no longer bound to the Ten Lands. Today, upon ascending the altar for the first crossing, we intone the *Jade Chapters of the Nine Heavens for Generating the Divine*. We dedicate this merit to the Emperor of the Infinite Heaven of Yudu, praying for the grace to elevate the spirit of [Name], that they may ascend to the immortal realm, and extending this blessing to all forsaken and lost beings throughout the Dharma realms.\n\nMay they awaken to the illusory and false nature of their former existence, attaining perfect clarity in the One Truth; may they untangle the karmic bonds of past lives, with all transgressions dissolved and eradicated. The long night yields to purity, and the spirit-soul undergoes refinement. May they never enter the prison of wind and thunder, spared the torment of flying spears and drifting halberds; may they be reborn in the primordial womb of life, attaining the fruit of refining qi and achieving immortality. Freed from all obstructions, they shall roam in boundless ease.\n\nWe bow our heads to the August Void, cultivating the scripture’s Dharma.\n\n**Hymn of the Dharma Seat**\n*Silent contemplation in accordance with the rites*\nIn profound stillness, reaching the ultimate source—\nFor kalpas unending, they shall dwell as immortals.\n\n**The Master Inscribes the Scripture**\n**The Assembly Completes the Recitation**\n**Hymn of Rising from the Seat**\n\n**Attending the Scripture – Dedication of Merit**\nWe look up in reverence to the Three Sublime Realms and the Nine Heavens’ exalted sages. Turning our compassionate intent below, we beseech that they bestow their witness and alliance. We, your servants, have now completed one recitation of the precious scripture. Relying upon its Dharma, we elevate the spirit of [Name], guiding them to ascend to the realm of purity, and extending this merit to all forsaken and lost beings throughout the Dharma realms, that they may transcend the depths of darkness and ascend to the Dao’s domain. May all beings universally partake in this goodness and blessing.\n\nWe bow our heads in devotion and proceed with hymns of praise.\n\n**Celestial Procession**\n*Circumambulation with incense*",
      "overlap_context": "e departed spirits.\n\nWe humbly beseech the Golden Palace to extend its grace, the Jade Clarity to bestow its benevolent command. Refine the souls in the Palace of Lesser Yin, restore the spirits to the Courtyard of Flowing Fire. Relying upon the scripture of the Nine Crossings, ascend directly to the realm of the Three Heavens.\n\nThe assembly, with sincere devotion, prostrates in reverence.\n\n**Three Refuges**\n**Hymn of Past Lives**\n**Attending the Scripture – Opening the Scripture**\n\n*Invocation*",
      "start_char": 575,
      "end_char": 891,
      "start_sentence": 41,
      "end_sentence": 66,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.551223278045654,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度开收仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "师白文 宣疏或符 白将 宣关 焚化 侍经宣开，第二过经 一唱万真和，先伸讽咏之诚； 二诵天地通，再举赞扬之典。 以今升坛第二过，转咏九天生神玉章。 回向上上禅善无量寿天帝，祈恩升荐某灵，进登仙境，下及法界孤幽等众。 当愿闻经悟道，拔罪解冤。 东宫颁救苦之恩，北府注上生之字。 不入铜柱狱，免手抱以足登； 再生胎命元，俾神完而气聚。 超升道境，托化人天。 稽首虚皇，修行经法。 敷座赞 请转法轮 师题经 众讽经毕 解座吟 侍经回向 仰惟三境高尊，九天上圣。 俯回慈造，同赐证盟。 臣等讽诵宝章，已周二过。 仰凭经法，升荐某灵，进登仙境，下及法界孤幽，出离沈冥，超冲道境。 普及一切，均沾胜利。 法众如仪，旋行赞咏。 步虚 旋行，上香",
      "translated_text": "**Master’s Proclamation of the Text – Declaration of Petitions or Talismans**\n\nThe attendant scripture now proclaimed, the second recitation begins:\n*One chant, and the myriad Perfected respond in harmony—*\nFirst, we extend our sincerest devotion in recitation and praise.\n*Twice recited, and Heaven and Earth commune—*\nAgain, we perform the rites of exaltation and hymnody.\n\nOn this day, ascending the altar for the second recitation, we turn to intone the *Jade Chapters of the Nine Heavens’ Life-Generating Spirit*. In dedication, we direct this merit to the Most Sublime Meditative Virtue, the Boundless-Longevity Heavenly Emperor, beseeching grace to elevate and recommend [Name]’s spirit, guiding them to ascend to the immortal realms, and extending this to all forsaken and lost beings throughout the Dharma realms. May all who hear this scripture awaken to the Dao, their transgressions absolved and karmic entanglements dissolved.\n\nFrom the Eastern Palace, may the grace of deliverance from suffering be bestowed;\nFrom the Northern Bureau, may the characters of rebirth be inscribed.\nSpared from the Brazen-Pillar Hell, they shall not clasp their hands in despair but ascend with ease.\nReborn in the primordial essence of life, may their spirit be whole and their qi gathered.\nTranscending to the Dao’s domain, may they be transformed and dwell among humans and devas.\n\nWe bow our heads in reverence to the August Void, cultivating the scripture’s Dharma.\n\n**Expounding the Seat – Hymn of Praise**\n*Request to Turn the Dharma Wheel*\n\n**Master Inscribes the Scripture**\n**Assembly Recites the Scripture to Completion**\n**Rising from the Seat – Hymn**\n\n**Attending the Scripture – Dedication of Merit**\nWe look up in reverence to the Three Sublime Realms and the Nine Heavens’ exalted sages. Turning our compassionate intent below, we beseech that they bestow their witness and alliance. We, your servants, have now completed two recitations of the precious scripture. Relying upon its Dharma, we elevate the spirit of [Name], guiding them to ascend to the immortal realms, and extending this merit to all forsaken and lost beings throughout the Dharma realms, that they may emerge from the depths of darkness and transcend to the Dao’s domain. May all beings universally partake in this excellence and blessing.\n\nThe Dharma assembly proceeds according to ritual, circumambulating in hymns of praise.\n\n**Celestial Procession**\n*Circumambulation with incense*",
      "overlap_context": "one recitation of the precious scripture. Relying upon its Dharma, we elevate the spirit of [Name], guiding them to ascend to the realm of purity, and extending this merit to all forsaken and lost beings throughout the Dharma realms, that they may transcend the depths of darkness and ascend to the Dao’s domain. May all beings universally partake in this goodness and blessing.\n\nWe bow our heads in devotion and proceed with hymns of praise.\n\n**Celestial Procession**\n*Circumambulation with incense*",
      "start_char": 891,
      "end_char": 1225,
      "start_sentence": 67,
      "end_sentence": 96,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.771804571151733,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度开收仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "师白文 宣疏或符 白将 宣关 焚化 侍经宣开，第三过经 宝范宣扬，今已周於三过，神魂受度，即拔出於九幽。 以今升坛第三过，转咏九天生神玉章。 回向梵监须延天帝，祈恩升荐某灵，进登仙境，下及法界孤幽。 当愿欲海澄波，爱河息浪。 累世修为之罪，自此消除； 多生故误之愆，从兹解释。 不入火翳狱，变热恼而为清凉； 再生魂命元，得逍遥而无拘滞。 混合空洞炁，欢乐太上前。 稽首虚皇，修行经法。 敷座赞 请转法轮 师题经 众讽经毕 解座吟 侍经回向 仰惟三境高尊，九天上圣。 俯回慈造，同赐证盟。 臣讽诵宝章，已周三过。 仰凭经法，升荐某灵，进登仙境，下及法界孤幽，出离幽冥，迁升道境。 普及一切，均沾胜利。 法众如仪，旋行赞咏。 步虚 旋行，上香",
      "translated_text": "**Master’s Proclamation of the Text**\nProclamation of the memorial or talisman, announcement of the petition, burning and offering—now that the scripture’s recitation has been opened, the third recitation of the precious canon is complete. The divine soul has received deliverance, at once plucked from the Nine Dark Realms.\n\nOn this third ascent to the altar, we turn and chant the *Nine Heavens’ Jade Scripture of Life-Generating Spirit*. We dedicate this merit to the Heavenly Emperor of the Vast Extension, praying for the elevation and advancement of [Name]’s soul to the immortal realms, extending this grace below to all forsaken and lost beings throughout the Dharma realms.\n\nMay the sea of desire settle its waves, may the river of attachment still its currents. The sins of accumulated lifetimes’ cultivation shall from this moment dissolve; the errors of many births’ past misdeeds shall henceforth be released. Let them not enter the fire-obscuring hells, where heat and torment are transformed into cool clarity. Let the soul’s original mandate be reborn, attaining carefree ease without hindrance. Merging with the empty and cavernous *qi*, may they rejoice before the Most High.\n\nWe bow our heads in reverence to the Void Sovereign, practicing the scripture’s Dharma.\n\n*Seating the Altar – Hymn of Praise*\n*Invitation to Turn the Dharma Wheel*\n*Master Intoning the Scripture*\n*Assembly Completing the Recitation*\n*Chant of Rising from the Seat*\n*Dedication of Merit*\n\nWe look up in reverence to the Three Sublime Realms and the Nine Heavens’ exalted sages. Turning our compassionate intent below, we beseech that they bestow their witness and alliance. We have now completed three recitations of the precious scripture. Relying upon its Dharma, we elevate the spirit of [Name], guiding them to ascend to the immortal realms, and extending this merit to all forsaken and lost beings throughout the Dharma realms, that they may emerge from the depths of darkness and be raised to the Dao’s domain. May all beings universally partake in this excellence and blessing.\n\nThe Dharma assembly proceeds according to ritual, circumambulating in hymns of praise.\n\n*Celestial Procession*\n*Circumambulation with incense*",
      "overlap_context": "scripture. Relying upon its Dharma, we elevate the spirit of [Name], guiding them to ascend to the immortal realms, and extending this merit to all forsaken and lost beings throughout the Dharma realms, that they may emerge from the depths of darkness and transcend to the Dao’s domain. May all beings universally partake in this excellence and blessing.\n\nThe Dharma assembly proceeds according to ritual, circumambulating in hymns of praise.\n\n**Celestial Procession**\n*Circumambulation with incense*",
      "start_char": 1225,
      "end_char": 1563,
      "start_sentence": 97,
      "end_sentence": 126,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.81320834159851,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度开收仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "师白文 宣疏或符 白将 宣关 焚化 三闻经 复炉 下坛，谢师 念善 午朝 三皈依 宿命赞 侍经开，第四过经 自然九章，天真隐韵。 诵之四过，魄尸开辟。 以今升坛第四过，转咏九天生神玉章。 回向寂然兜术天帝，祈恩升荐某灵，进登仙境，下及法界孤幽等众。 当愿罪愆雪释，业障冰消。 了悟死生之因，顿觉虚无之化。 不入屠割狱，免肢体零落之忧； 再生魄命元，遂蓬岛逍遥之乐。 往生神仙界，控翮王母家。 稽首虚皇，修行经法。 敷座赞 静念如法 寂寂至无宗，至世世为仙家。 请转法轮 师题经",
      "translated_text": "*Master’s Proclamation*\n*Announcement of Petition or Talismanic Script*\n*Invocation of the Celestial Gate*\n*Burning and Offering*\n\nThree recitations of the sutra are heard once more. The incense is returned to the censer, and the altar is descended. Gratitude is offered to the master, and the midday audience begins. The Three Refuges are recited, followed by the *Hymn of Past Lives* and the opening of the fourth scripture recitation.\n\n*The Nine Natural Chapters*\n*The Hidden Rhymes of the Heavenly Perfected*\n\nAfter four recitations, the corporeal husk is opened and sundered. Now, ascending the altar for the fourth recitation, we intone the *Jade Chapters of the Nine Heavens’ Life-Generating Spirits*. The merit is dedicated in silence to the Lord of the Tusita Heaven, praying for the elevation of [Name]’s spirit to ascend to the immortal realms, and extending this grace to all forsaken and lost beings throughout the Dharma realms.\n\nMay their transgressions dissolve like melting snow, their karmic obstructions thaw like melting ice. May they awaken to the causes of life and death, and suddenly perceive the transformations of emptiness and non-being. May they avoid the butchering hells, sparing them the sorrow of dismemberment; may their ethereal souls and vital essence be reborn, granting them the joy of carefree wandering in Penglai’s isles. May they be reborn in the realm of divine immortals, soaring to the Queen Mother’s abode.\n\nWe bow our heads in reverence to the Void Sovereign, practicing the scriptural Dharma.\n\n*Chant of the Seat’s Arrangement*\n*Silent Contemplation in Accordance with the Dharma*\n\nIn profound stillness, we reach the ultimate source—may they, in life after life, dwell as immortals’ kin.\n\n*Request to Turn the Dharma Wheel*\n*Master’s Inscription of the Scripture*",
      "overlap_context": "s scripture. Relying upon its Dharma, we elevate the spirit of [Name], guiding them to ascend to the immortal realms, and extending this merit to all forsaken and lost beings throughout the Dharma realms, that they may emerge from the depths of darkness and be raised to the Dao’s domain. May all beings universally partake in this excellence and blessing.\n\nThe Dharma assembly proceeds according to ritual, circumambulating in hymns of praise.\n\n*Celestial Procession*\n*Circumambulation with incense*",
      "start_char": 1563,
      "end_char": 1831,
      "start_sentence": 127,
      "end_sentence": 154,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.38066554069519,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度开收仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "众讽经毕 解座吟 侍经回向 仰惟三境高尊，九天上圣。 俯回慈造，同赐证盟。 臣等讽诵宝章，已周四过。 用凭经法，升荐某灵，进登清静，下及法界孤幽，超离沈冥，上登道境。 普及一切，均沾胜利。 法众虔诚，旋行赞咏。 步虚 旋行，上香 师白文 宣疏或符 白将 宣关 焚化 侍经开，第五过经 灵音宣演，已周五转之功； 亡者受持，悉赦多生之罪。 以今升坛第五过，转咏九天生神玉章。 回向波罗尼密不骄乐天帝，祈恩升荐某灵，进登仙境，下及法界孤幽等众。 当愿悟从前之虚幻，乘今日之良因。 善念顿生，恶根俱灭。 不入金刚地狱，无拘囚系闭之忧； 再生脏腑命元，证水火返还之妙。 炼胎返本，得道成真。 稽首虚皇，修行经法。 敷座赞 请转法轮 师题经 众讽经毕 解座吟 侍经回向",
      "translated_text": "After the assembly has chanted the sutra to completion,\nthe Seat is released with a hymn,\nand the attendants make their dedications.\n\nWe lift our gaze in reverence to the Three Sublime Realms’ exalted lords,\nto the Nine Heavens’ august sages.\nMay their compassionate grace descend,\nbestowing upon us the seal of their witness.\n\nWe, your servants, have recited the precious scripture four times in full.\nBy the power of this Dharma,\nmay the soul of [Name] ascend to realms of purity,\nand may all forsaken and suffering beings of the Dharma-realm\ntranscend their dark abodes,\nrising to the Dao’s domain.\nMay all beings universally partake in this supreme merit.\n\nThe Dharma assembly, with utmost devotion,\ncircles in procession, chanting praises.\n*Step into the Void*\nProcess in reverence, offering incense.\n\nThe Master presents the text,\nproclaims the memorial or talisman,\nannounces the petition,\ndeclares the invocation,\nand performs the burning rites.\n\nThe attendants open the scripture for the fifth recitation.\nThe numinous voice resounds, completing the fifth turning of the Wheel;\nthe departed receive and uphold it, their sins of many lives absolved.\n\nOn this fifth ascent to the altar,\nwe chant the *Nine Heavens’ Jade Scripture of Life-Generating Spirits*.\nWe dedicate this to the Heavenly Emperor of the Joyous Realm of Pāramitā,\npraying for the soul of [Name] to ascend to the immortals’ realm,\nand for all forsaken and suffering beings of the Dharma-realm.\n\nMay they awaken to the illusions of the past,\nand seize the auspicious causes of this day.\nMay wholesome thoughts arise at once,\nand all roots of evil be extinguished.\nMay they avoid the Diamond Hell,\nspared the sorrow of bonds and imprisonment;\nmay their viscera and vital essence be reborn,\nattaining the wondrous reversal of water and fire.\nRefining the embryo to return to the origin,\nthey shall realize the Dao and attain perfection.\n\nWe bow our heads in reverence to the Void Sovereign,\npracticing the scriptural Dharma.\n*Chant of the Seat’s Arrangement*\n*Request to Turn the Dharma Wheel*\n*Master’s Inscription of the Scripture*\n\nAfter the assembly has chanted the sutra to completion,\nthe Seat is released with a hymn,\nand the attendants make their dedications.",
      "overlap_context": " the joy of carefree wandering in Penglai’s isles. May they be reborn in the realm of divine immortals, soaring to the Queen Mother’s abode.\n\nWe bow our heads in reverence to the Void Sovereign, practicing the scriptural Dharma.\n\n*Chant of the Seat’s Arrangement*\n*Silent Contemplation in Accordance with the Dharma*\n\nIn profound stillness, we reach the ultimate source—may they, in life after life, dwell as immortals’ kin.\n\n*Request to Turn the Dharma Wheel*\n*Master’s Inscription of the Scripture*",
      "start_char": 1831,
      "end_char": 2184,
      "start_sentence": 155,
      "end_sentence": 187,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.800325393676758,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度开收仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "仰惟三境高尊，九天上圣。 俯回慈造，同赐证盟。 臣等讽诵宝章，已周五过。 仰凭经法，升荐某灵，进登仙境，下及法界孤幽，出离沈冥，迁升道境，普及一切，均沾胜利。 法众虔诚，旋行赞咏。 步虚 旋行，上香 师白文 宣疏或符 白将 宣关 焚化 侍经开，第六过经 九炁融结，成九天玄奥之文； 六过翻宣，免六道轮回之苦。 以今升坛第六过，转咏九天生神玉章。 回向洞元化应声天帝，祈恩升荐某灵，进登仙境，下及法界孤幽等众。 当愿回光返照，舍妄归真。 勾销黑簿之名，游步黄华之野。 不入火车地狱，永无裂体之忧； 再生灵府命元，即证炼魂之果。 了无凝滞，即遂消遥。 稽首虚皇，修行经法。 敷座赞 请转法轮 师题经 众讽经毕 解座吟 侍经回向",
      "translated_text": "We look up in reverence to the Three Realms’ exalted ones,\nto the Nine Heavens’ sacred sages.\nWe bow in gratitude for their compassionate response,\ntogether bestowing confirmation of our covenant.\n\nYour servants have chanted the precious scripture,\ncompleting five recitations in full.\nRelying upon the scriptural Dharma,\nwe ascend and recommend the spirit of [Name],\nadvancing them to the immortal realms,\nextending to all forsaken and obscured beings of the Dharma-realm.\nMay they depart from darkness and obscurity,\nascend to the Dao’s境界,\nand may all universally partake in this sublime attainment.\n\nThe Dharma assembly, with utmost devotion,\nproceeds in circumambulation, offering praises.\n*Step into the Void*\n*Circumambulation*\n*Offering of Incense*\n*Master’s Declaration of the Text*\n*Proclamation of the Petition or Talisman*\n*Announcement of the Petition’s Presentation*\n*Proclamation of the Pass*\n*Fumigation*\n\nThe attendants open the scripture,\nbeginning the sixth recitation.\nNine *qi* fuse and coalesce,\nforming the profound scripture of the Nine Heavens;\nsix recitations unfold and proclaim,\nfreeing beings from the suffering of the Six Paths’ rebirth.\n\nOn this day, as the sixth recitation upon the altar commences,\nwe turn and chant the *Jade Scripture of the Nine Heavens’ Life-Generating Spirit*.\nWe dedicate this to the Responsive Heavenly Emperor of Primordial Transformation,\npraying for the ascent and recommendation of the spirit of [Name],\nadvancing them to the immortal realms,\nextending to all forsaken and obscured beings of the Dharma-realm.\n\nMay they reflect the light back to its source,\nabandon delusion and return to truth.\nMay their names be stricken from the Black Register,\nand their steps wander the Yellow Flower Fields.\nMay they avoid the Fire-Cart Hell,\nforever spared the sorrow of dismemberment;\nmay their spirit and vital essence be reborn,\nimmediately attaining the fruit of soul-refinement.\nWith all obstructions dissolved,\nthey shall forthwith enjoy boundless freedom.\n\nWe bow our heads in reverence to the Void Sovereign,\npracticing the scriptural Dharma.\n*Chant of the Seat’s Arrangement*\n*Request to Turn the Dharma Wheel*\n*Master’s Inscription of the Scripture*\nAfter the assembly has chanted the sutra to completion,\nthe Seat is released with a hymn,\nand the attendants make their dedications.",
      "overlap_context": "ital essence be reborn,\nattaining the wondrous reversal of water and fire.\nRefining the embryo to return to the origin,\nthey shall realize the Dao and attain perfection.\n\nWe bow our heads in reverence to the Void Sovereign,\npracticing the scriptural Dharma.\n*Chant of the Seat’s Arrangement*\n*Request to Turn the Dharma Wheel*\n*Master’s Inscription of the Scripture*\n\nAfter the assembly has chanted the sutra to completion,\nthe Seat is released with a hymn,\nand the attendants make their dedications.",
      "start_char": 2184,
      "end_char": 2515,
      "start_sentence": 188,
      "end_sentence": 216,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.61871886253357,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度开收仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "仰惟三境高尊，九天上圣。 俯回慈造，同赐证盟。 臣等讽诵宝章，已周六过。 仰凭经法，升荐某灵，进登仙境，下及法界孤幽，出离沈冥，迁升道境，普及一切，均沾胜利。 法众虔诚，旋行赞咏。 步虚 旋行，上香 师白文 宣疏或符 白将 宣关 焚化 三闻经 复炉 下坛，谢师 念善 晚朝 三皈依 宿命赞 侍经开，第七过经 三洞飞玄炁，结云篆以成文； 七诵重关开，振灵音而起死。 以今升坛第七过，转咏九天生神玉章。 回向灵化梵辅天帝，祈恩升荐某灵，进登仙境，下及法界孤幽。 当愿来睹阳光，永辞幽暗。 不入溟泠狱，无寒冰冻体之忧； 再生元府元，受旸谷回春之气。 一灵澄湛，三界遨游。 稽首虚皇，修行经法。 敷座赞 静念如法 寂寂至无宗，至世世为仙家。 请转法轮 师题经",
      "translated_text": "We reverently gaze upon the Three Realms’ exalted sovereigns,\nthe Nine Heavens’ august sages.\nBowing in humble gratitude for their compassionate response,\nwe together receive the covenant of verification.\n\nWe have chanted the precious scripture six times in full.\nRelying upon the scriptural Dharma,\nwe ascend and present the soul of [Name],\nadvancing them to the immortal realms,\nand extending to all forsaken and obscure beings of the Dharma-realm:\nmay they depart from the depths of darkness,\nascend to the Dao’s境界,\nand universally partake in this supreme attainment.\n\nThe assembly, with utmost devotion,\ncircumambulates in hymns of praise.\n*Step into the Void*\n*Circumambulation*\n*Offering of Incense*\n*The Master’s Petition*\n*Proclamation of the Memorial or Talisman*\n*Announcement of the General*\n*Proclamation of the Pass*\n*Fumigation*\n*Threefold Hearing of the Scripture*\n*Return to the Censer*\n*Descend from the Altar, Gratitude to the Master*\n*Recitation of Virtues*\n*Evening Audience*\n*Three Refuges*\n*Hymn of Past Lives*\n*The Scripture’s Opening, Seventh Recitation*\n\nThe Three Caverns’ soaring primordial qi\nweaves cloud-seals into script;\nthe Seven Recitations’ layered gates unlock,\nresonating with numinous sound to raise the dead.\n\nOn this seventh ascent of the altar,\nwe chant the *Jade Chapters of the Nine Heavens’ Life-Generating* anew.\nWe dedicate this to the Heavenly Emperor of Numinous Transformation and Brahma’s Assistants,\npraying for the ascent and presentation of [Name]’s soul,\nadvancing them to the immortal realms,\nand extending to all forsaken and obscure beings of the Dharma-realm:\nmay they henceforth behold the sunlight,\nforever forsaking the gloom of darkness.\nMay they avoid the Nether-Frigid Hell,\nspared the sorrow of frozen limbs;\nmay they be reborn in the Primordial Palace,\nreceiving the spring-renewing qi of the Sunlit Valley.\nWith their spirit serene and limpid,\nmay they roam the Three Realms at will.\n\nWe bow our heads in reverence to the Void Sovereign,\npracticing the scriptural Dharma.\n*Chant of the Seat’s Arrangement*\n*Silent Recitation According to the Rite*\n*In profound stillness, reaching the ultimate source,*\n*may they, life after life, become immortals’ kin.*\n*Request to Turn the Dharma Wheel*\n*Master’s Inscription of the Scripture*",
      "overlap_context": "eir spirit and vital essence be reborn,\nimmediately attaining the fruit of soul-refinement.\nWith all obstructions dissolved,\nthey shall forthwith enjoy boundless freedom.\n\nWe bow our heads in reverence to the Void Sovereign,\npracticing the scriptural Dharma.\n*Chant of the Seat’s Arrangement*\n*Request to Turn the Dharma Wheel*\n*Master’s Inscription of the Scripture*\nAfter the assembly has chanted the sutra to completion,\nthe Seat is released with a hymn,\nand the attendants make their dedications.",
      "start_char": 2515,
      "end_char": 2873,
      "start_sentence": 217,
      "end_sentence": 250,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.453405380249023,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度开收仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "众讽经毕 解座吟 侍经回向 仰惟三境高尊，九天上圣。 俯回慈造，同赐证盟。 臣等讽诵宝章，已周七过。 仰凭经法，升荐某灵，进登仙境，下及法界孤幽，出离沈冥，迁升道境，普及一切，均沾胜利。 法众虔诚，旋行赞咏。 步虚 旋行，上香 师白文 宣疏或符 白将 宣关 焚化 侍经开，第八过经 八过演生神之旨，幽夜光明； 神魂成返本之功，应时解脱。 以今升坛第八过，转咏九天生神玉章。 回向高虚清明天帝，祈恩升荐某灵，进登仙境，下及法界孤幽等众。 当愿不迷本性，顿悟无为。 断除爱欲之根，凝化真灵之炁。 不入镬汤岳，免炉炭之煎熬； 再生华府元，囿阴阳之陶冶。 永作逍遥之侣，不拘逼合之群。 稽首虚皇，修行经法。 敷座赞 请转法输 师题经 众讽经毕 解座吟 侍经回向",
      "translated_text": "After the assembly has chanted the scripture to its close,\nthey rise from their seats in melodic recitation,\nand in attendant devotion offer the merit of the sutra’s turning.\nWe lift our gaze in reverence to the Three Sublime Realms’ exalted lords,\nthe Nine Heavens’ august sages.\nMay their compassionate grace descend,\nbestowing equal witness to our covenant.\n\nWe, your servants, have recited the precious chapters seven times in full.\nRelying upon the scriptural Dharma,\nwe ascend and present the soul of [name],\nadvancing them to the immortal realms,\nand extending to all forsaken and obscure beings of the Dharma-realm:\nmay they depart the depths of darkness,\nascend to the Dao’s domain,\nand may all universally partake in this supreme attainment.\nThe Dharma assembly, in devout sincerity,\nproceeds in circling praise and chant.\n*Stepping the Void*\nCircling procession,\noffering incense.\n*The Master’s Declaration of the Text*\nProclamation of the memorial or talisman,\n*Declaration of the Petition*\nProclamation of the petition,\nburning and transformation.\nThe attendant scripture is opened for the eighth recitation.\nEight recitations unfold the essence of the *Life-Spirit of the Nine Heavens*,\nilluminating the darkest night;\nthe soul’s work of returning to its origin is accomplished,\nand liberation is attained in due time.\n\nAt this eighth ascent to the altar,\nwe turn and chant the *Jade Chapters of the Life-Spirit of the Nine Heavens*,\ndirecting the merit toward the Emperor of the High Void and Luminous Heavens.\nWe pray for grace to ascend and present the soul of [name],\nadvancing them to the immortal realms,\nand extending to all forsaken and obscure beings of the Dharma-realm.\nMay they never lose their original nature,\nsuddenly awakening to the unconditioned.\nMay they sever the roots of desire and attachment,\nand condense the true spirit’s qi into radiant essence.\nMay they avoid the Cauldron and Scalding Peaks,\nspared the torment of furnace and charcoal;\nmay they be reborn in the Radiant Palace of Primordial Qi,\nencompassed by the refining work of yin and yang.\nForever may they become companions of carefree wandering,\nunbound by the constraints of forced union.\nWe bow our heads in reverence to the Void Sovereign,\npracticing the scriptural Dharma.\n*Chant of the Seat’s Arrangement*\n*Request to Turn the Dharma Wheel*\n*Master’s Inscription of the Scripture*\nAfter the assembly has chanted the scripture to its close,\nthey rise from their seats in melodic recitation,\nand in attendant devotion offer the merit of the sutra’s turning.",
      "overlap_context": "the Primordial Palace,\nreceiving the spring-renewing qi of the Sunlit Valley.\nWith their spirit serene and limpid,\nmay they roam the Three Realms at will.\n\nWe bow our heads in reverence to the Void Sovereign,\npracticing the scriptural Dharma.\n*Chant of the Seat’s Arrangement*\n*Silent Recitation According to the Rite*\n*In profound stillness, reaching the ultimate source,*\n*may they, life after life, become immortals’ kin.*\n*Request to Turn the Dharma Wheel*\n*Master’s Inscription of the Scripture*",
      "start_char": 2873,
      "end_char": 3225,
      "start_sentence": 251,
      "end_sentence": 282,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.745525360107422,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度开收仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "仰惟三境高尊，九天上圣。 俯回慈造，同赐证盟。 臣等讽诵宝章，已周八过。 仰凭经法，升荐某灵，进登仙境，下及法界孤幽等众，出离沈冥，迁升道境，普及一切，均沾胜利。 法众虔诚，旋行赞咏。 步虚 旋行，上香 师白文 宣疏或符 白将 宣关 焚化 侍经开，第九过经 万真朝帝所，瞻三色於空玄； 九徧成人功，庆诸天之欢悦。 以今升坛第九过，转咏九天生神玉章。 回向无想无结无爱天帝，祈恩升荐某灵，进登仙境，下及法界孤幽等众。 当愿乘机而悟，见善则迁。 睹太上之慈光，度苦魂於丹界。 不入普掠狱，兔金锤乱考之刑； 再生神府元，证玉洞凝神之妙。 乘兹道力，径陟仙阶。 稽首虚皇，修行经法。 敷座赞 请转法轮 师题经 众讽经毕 解座吟 侍经回向",
      "translated_text": "We gaze in reverence to the Three Realms’ exalted lords,\nthe Nine Heavens’ sacred sages.\nBowing in humble response to their compassionate creation,\nwe together receive the covenant of realization.\nYour servants have chanted the precious scripture,\ncompleting eight full recitations.\nRelying upon the scriptural Dharma,\nwe ascend and recommend the spirit of [Name],\nadvancing them to the immortal realm,\nand extending to all beings in the Dharma-realm—\nthe forsaken, the hidden, the lost—\nemergence from dark obscurity,\nascension to the Dao-boundary,\nuniversally bestowing upon all\nthe shared blessing of victory.\n\nThe Dharma assembly, in devout sincerity,\nproceeds in circumambulation, chanting praises.\n*Procession in Void-Stepping*\n*Circumambulation, Offering Incense*\n*Master’s Declaration of Text*\n*Proclamation of Petition or Talisman*\n*Announcement of Presentation*\n*Proclamation of Passages*\n*Fumigation*\n*Attendants open the scripture—Ninth Recitation*\n\nTen thousand perfected ones approach the Emperor’s throne,\ngazing upon the three hues in the empty mystery;\nninefold completion fulfills the work of humanity,\ncelebrating the joy of all heavens.\n\nToday, upon the altar’s ninth recitation,\nwe turn and chant the *Jade Chapter of the Nine Heavens’ Life-Generating Spirit*.\nWe dedicate this to the Emperor of the Desireless, Unbound, Unattached Heaven,\npraying for grace to ascend and recommend the spirit of [Name],\nadvancing them to the immortal realm,\nand extending to all beings in the Dharma-realm—\nthe forsaken, the hidden, the lost.\n\nMay they seize the moment to awaken,\ntransforming upon witnessing goodness.\nBeholding the Most High’s compassionate radiance,\nmay suffering souls be delivered to the Cinnabar Realm.\nSpared entry into the Universal Seizure Hell,\nthey escape the chaos of golden hammers’ relentless torment;\nreborn in the Primordial Palace of Spirit,\nthey realize the wondrous subtlety of jade grottoes’ spirit-congealing.\nRiding the power of the Dao,\nthey ascend directly the immortal’s steps.\n\nWe bow our heads in reverence to the Void Sovereign,\npracticing the scriptural Dharma.\n*Chant of the Seat’s Arrangement*\n*Request to Turn the Dharma Wheel*\n*Master’s Inscription of the Scripture*\nAfter the assembly has chanted the scripture to its close,\nthey rise from their seats in melodic recitation,\nand in attendant devotion offer the merit of the sutra’s turning.",
      "overlap_context": "ining work of yin and yang.\nForever may they become companions of carefree wandering,\nunbound by the constraints of forced union.\nWe bow our heads in reverence to the Void Sovereign,\npracticing the scriptural Dharma.\n*Chant of the Seat’s Arrangement*\n*Request to Turn the Dharma Wheel*\n*Master’s Inscription of the Scripture*\nAfter the assembly has chanted the scripture to its close,\nthey rise from their seats in melodic recitation,\nand in attendant devotion offer the merit of the sutra’s turning.",
      "start_char": 3225,
      "end_char": 3559,
      "start_sentence": 283,
      "end_sentence": 311,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.658893585205078,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度开收仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "仰惟三境高尊，九天上圣。 俯回慈造，同赐证盟。 臣等讽诵宝章，已周九过。 仰凭经法，升荐某灵，进登仙境，下及孤幽等众，永离幽冥，迁升道境，普及一切，均沾胜利。 法众虔诚，旋行赞咏。 步虚 旋行，上香 师白文 宣疏或符 白将 宣关 焚化 侍经赞经 伏以天尊造大慈之化，泽及群生； 至真演自然之章，功成九过。 真风冲漠。 梵炁弥罗。 出乎太空之先，肇乎太乙之始。 无色无绪，乍存乍亡。 普济人天，开度魂爽。 今时升荐某进登仙境，重虑法界。 孤幽苦爽等众，在世之日，宿昔以来，未明有漏之色身，每纵多端之罪业。 自从命谢，莫测转轮。 解脱无由，超升末遂。 若非救拔，难免沈沦。 幸太上出书以度人，为神魂生根而复命。 适来领众升坛，转咏自然九天生神玉章，已周九过。 端用升荐某灵，下及孤幽等众。 伏愿九真慈悯，九炁结凝。 上以际乎九天，庆云覆于九府； 下以观乎九地，祥光彻于九泉。 沈魂滞魄尽超升，宿业旧冤齐解脱。 罪如春雪，逢暖日以俱消； 过若晴云，得清风而尽散。 常清常静，无滞无凝。 天精流焕，九宫飞生。 胎结解根，诸尘漏尽。 脱身阴府，稳步仙阶。 八极宫中，永作逍遥之侣； 九霄府内，常为游宴之房。 回向已周，闻经如法。 三闻经 师收经",
      "translated_text": "Beholding the Three Realms’ lofty Venerables,\nthe Nine Heavens’ august Sages,\nwe turn our gaze below to their compassionate creation,\njointly bestowing confirmation of our covenant.\nWe, your servants, have chanted the precious scripture,\ncompleting its ninefold recitation.\nRelying upon the scriptural Dharma,\nwe ascend and recommend the soul of so-and-so,\nadvancing them to the immortal realm,\nextending to all forsaken and hidden beings,\nthat they may forever depart the dark netherworld,\nascend to the Dao’s domain,\nand universally partake in this sublime blessing.\nThe Dharma assembly, in devout reverence,\ncircumambulates in hymns of praise.\n\n*Circumambulation in Void-Stepping*\n*Circumambulation, Offering Incense*\n*Master’s Declaration of Text*\n*Proclamation of Memorial or Talisman*\n*Declaration of Petition*\n*Proclamation of Pass*\n*Fumigation*\n*Attending the Scripture, Hymning the Scripture*\n\nWe prostrate ourselves, acknowledging:\nThe Heavenly Worthy enacts the great compassionate transformation,\nbestowing grace upon all beings;\nthe Perfected One expounds the scripture of spontaneity,\nits merit perfected in ninefold recitation.\nThe true wind rises in the vast emptiness,\nthe Brahma-qi suffuses the cosmos.\nEmerging before the Great Void’s dawn,\noriginating at the Primordial Unity’s inception,\nwithout form or trace,\nnow present, now absent,\nit universally delivers humans and heavens,\nliberating wandering souls.\n\nNow, we ascend and recommend the soul of so-and-so to the immortal realm,\nextending our concern to the Dharma realm—\nall forsaken, suffering souls,\nwho in their worldly days,\nfrom time immemorial,\nremained unaware of their leaky, colored bodies,\nindulging in manifold karmic transgressions.\nSince their lives ended,\nthey have wandered the wheel of rebirth,\nunable to find liberation,\nunable to ascend.\nWithout deliverance,\nthey cannot escape sinking and drowning.\nFortunately, the Most High revealed the scripture to deliver humanity,\nthat spiritual souls might regrow their roots and restore their lives.\n\nJust now, leading the assembly to ascend the altar,\nwe turned and chanted the *Jade Scripture of the Nine Heavens’ Spontaneous Life*,\ncompleting its ninefold recitation.\nSolemnly, we employ it to ascend and recommend the soul of so-and-so,\nextending to all forsaken beings.\nWe humbly pray that the Nine Perfected Ones show compassion,\nthat the Nine Qi coalesce and congeal.\nAbove, may it reach the Nine Heavens,\nwhere auspicious clouds cover the Nine Palaces;\nbelow, may it behold the Nine Earths,\nwhere propitious light penetrates the Nine Springs.\nMay sunken souls and stagnant spirits all ascend,\nmay past karmic debts and old grievances all dissolve.\nSins like spring snow,\nmelt entirely in the warm sun;\ntransgressions like morning clouds,\nscatter completely in the clear wind.\nEver pure, ever still,\nwithout hindrance or coagulation.\nHeavenly essence flows radiantly,\nflying through the Nine Palaces.\nThe root of womb-bondage is untied,\nall sensory leaks exhausted.\nFreed from the shadowy netherworld,\nthey tread steadily upon the immortal’s steps.\nIn the Eight Poles’ palaces,\nthey shall forever be carefree companions;\nwithin the Nine Empyreans’ courts,\nthey shall dwell as chambers of joyous feasting.\n\nThe dedication is complete,\nthe scripture heard in accordance with Dharma.\n\n*Threefold Hearing of the Scripture*\n*Master Gathers the Scripture*",
      "overlap_context": "e wondrous subtlety of jade grottoes’ spirit-congealing.\nRiding the power of the Dao,\nthey ascend directly the immortal’s steps.\n\nWe bow our heads in reverence to the Void Sovereign,\npracticing the scriptural Dharma.\n*Chant of the Seat’s Arrangement*\n*Request to Turn the Dharma Wheel*\n*Master’s Inscription of the Scripture*\nAfter the assembly has chanted the scripture to its close,\nthey rise from their seats in melodic recitation,\nand in attendant devotion offer the merit of the sutra’s turning.",
      "start_char": 3559,
      "end_char": 4070,
      "start_sentence": 312,
      "end_sentence": 354,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.193472623825073,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度开收仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "复炉 白灵朝辞 坛前，谢神王 下坛 引灵安幕 谢师 念善 玉箓生神资度开收仪竟",
      "translated_text": "The incense brazier is replenished,\nWhite Spirits take leave at the altar’s front,\nthe Divine Kings descend the platform,\nguiding the spirits to rest within the curtained sanctuary.\nGratitude is offered to the master,\nmerit recited,\nthe Jade Register’s life-nurturing and salvation rites for opening and closing are complete.",
      "overlap_context": "e flows radiantly,\nflying through the Nine Palaces.\nThe root of womb-bondage is untied,\nall sensory leaks exhausted.\nFreed from the shadowy netherworld,\nthey tread steadily upon the immortal’s steps.\nIn the Eight Poles’ palaces,\nthey shall forever be carefree companions;\nwithin the Nine Empyreans’ courts,\nthey shall dwell as chambers of joyous feasting.\n\nThe dedication is complete,\nthe scripture heard in accordance with Dharma.\n\n*Threefold Hearing of the Scripture*\n*Master Gathers the Scripture*",
      "start_char": 4070,
      "end_char": 4126,
      "start_sentence": 355,
      "end_sentence": 362,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.3447463512420654,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓生神资度开收仪.txt",
        "category": "威仪类"
      }
    }
  ]
}