{
  "source_id": "玉箓资度早朝仪",
  "source_file": "chunked_daozang\\玉箓资度早朝仪.json",
  "total_chunks": 4,
  "total_original_chars": 1915,
  "total_translated_chars": 13080,
  "total_translation_time": 72.26469302177429,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓资度早朝仪.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Jade Register’s Ritual for Morning, Noon, and Evening Audiences*\n**Text Title:** *Jade Register’s Ritual for Morning, Noon, and Evening Audiences*\nOne fascicle. Base text from *Daoist Canon of the Zhengtong Era*, Dongxuan Section, *Weiyi* (Ritual Dignity) Category.\n\n**Ritual for the Morning Audience of the Jade Register’s Salvific Empowerment**\nThe rites proceed according to form.\nAll pay homage to the Master and maintain visualization as prescribed.\n\n**Invocation of the Divine Mantra:**\nThe Azure Yang’s empty radiance—leaping sun, revolving numen.\nDivine Tigers repel evil; Flying Devas stream their bells.\nCrushing treachery, vanquishing trials, myriad demons bind their forms.\nNinefold Subtleties return to the Dao; Eightfold Awesomeness seizes essences.\nA thousand Perfected audit the records; Three Primes scour and purify.\nLeft, the Central Yellow’s roar; right, the Sixth Ding’s array.\nSeven revolutions, eight unions—revolving through Heaven’s scriptures.\nSacred transformation, majestic and towering; the Great Dao flourishes in practice.\nAuspicious clouds flow and spread, merging with the Yellow Court’s luminous scene.\n\n**Strike the ritual drum twenty-four times.**\n\nSupreme Three Heavens’ Primordial Origin, First Three *Qi* of the Most High Dao Lord, Most High Lord Lao:\nSummon forth from within us, your servants, the Three and Five Merit Officers, the Attendants and Envoys of Left and Right, the Dragon-Riders bearing incense, the Fragrant Lads of the Golden Youth, the Jade Maidens scattering flowers, the Five Thearchs’ Direct Talismans, the Incense Officials of the Direct Day—thirty-six each, to emerge.\nLet them emerge, clad in solemn raiment, crowned and sashed with trailing tassels.\nReport to the Land Spirit of the Mystic Altar, the Perfected Deities of the precinct’s bounds.\n\nYour Majesty this morning ascends the altar to perform the Dao, humbly presenting these sincere offerings of heartfelt devotion, now recorded and made known. May the luminous *qi* of the Supreme Ten Directions’ Perfected Dao, the numinous treasure of wisdom’s radiance, descend and flow into our bodies, that our supplications swiftly reach the presence of the Supreme Limitless Great Dao’s Three Clarities and Most Sacred Ones, the Jade Emperor of the Golden Portal of the Vast Heaven, the Eastern Ultimate’s Compassionate August One and Azure Mystery Emperor, and the Dao’s throne.\n\n**Invoking the Dharma Titles:**\nYour humble servant, [Name], along with the assembled altar officers, jointly and sincerely prostrate to address the Void and Spontaneous Perfect Limitless Great Dao, the Primordial Heavenly Worthy; the Supreme Dao Lord; the Supreme Lord Lao; the August Jade Emperor on High; the Northern Culmen’s Great Emperor of Purple Tenuity; the Heavenly Emperor of Purple Tenuity; the August Earth Spirit of the Imperial Mound; the Eastern Ultimate’s August Emperor of Azure Radiance; the Southern Ultimate’s August Emperor of Longevity; the Supreme Jade Emperor; the Jade Void Emperor; the Eastern Florescence, Southern Ultimate, Western Numinous, Northern Perfected, and Mystic Capital’s Jade Metropolis and Golden Portal’s Seven-Jewel Jeweled Terrace and Purple Tenuity’s Upper Palace’s Numinous Treasure Perfected Radiant August Dao Lord; the Ten Directions’ Great Holy Multitudes who have attained the Dao; the Perfected Lords and Venerable Masters; the Great Compassionate and Great Merciful Savior Perfected Ones, the Salvation Perfected Ones, the Great Benevolent Perfected Ones, the Life-Registering Perfected Ones, the Universal Salvation Perfected Ones, and the Dharma-Releasing Perfected Ones of the Fragrant Grove Assembly; the Thirty-Six Divisions’ Venerable Scriptures; the Great Dharma Masters of the Mystic Center; the Great Dharma Masters of the Three Heavens; the True Lords of the Three Masters of the Numinous Treasure Scriptures’ Transmission; the True Lords of the Orthodox Unity’s Lineage and the Three Female Masters; the officials and attendants of the Three Realms; and all true numina.\n\nWe have heard that when Crimson Clarity opened the cosmos, the Three Origins were spread through the ancestral *qi*; when the Azure Mystery governed the course, the true radiance of the Ten Ultimates was magnified. Majestic numen congeals in wondrous subtlety within purple gold; wisdom’s power unfolds in blossoming splendor upon jasper. The Fragrant Grove anchors its scene, its resonant tones responding to compassionate thoughts; the Kien Tree soars in brilliance, its jade proclamations manifesting the grace of answering cries. The Two Bureaus’ clouds unite in venerating virtue; the Nine Offices’ stars array to extend benevolence. Resplendent is the numinous efficacy; majestic is the sagely transformation.\n\nWe, your servants, are blessed by karmic fortune and live in an era of flourishing destiny. Wearing wondrous precepts before our bodies, we receive the esoteric gifts of the reclusive masters; grasping the phoenix charts behind our elbows, we witness the subtle unfolding of heaven. Not soaring high in the roc’s flight, we yet humbly dwell, chasing the fleeting hours. Studying the real to amend faults, we retreat to strengthen our resolve; propagating the Dao to establish merit, we advance to exert our efforts in delivering others. Reverently bearing the celestial mandate, dare we not make this known?\n\nToday, in reverent compliance with the imperial edict, we solemnly perform the Jade Register rites to aid and recommend the spirit of [Name]. Purifying ourselves to offer sincerity, we earnestly fast our minds and pour forth our heartfelt devotion. Turning our hearts to the Eastern Ultimate, we pray the gates of sweet dew be opened; bestowing blessings upon the spirit of [Name], may they swiftly attain the Purple Void’s rank. May grace flow through the ancestral shrines and blessings extend to humanity and heaven.\n\nThis morning, ascending the altar to perform the Dao, we, the assembled Dharma hosts, now offer the first pinch of incense. May this fragrant smoke ascend directly to offer homage to the Supreme Perfected Treasure of the Dao. We, your servants, take refuge in body, spirit, and life, prostrating our heads to the earth, reverently relying upon the Supreme Three Worthies and the Ten Directions’ multitudes of sages. May the merit of this incense be dedicated to the spirit of [Name], augmenting celestial blessings and advancing their immortal ranks.\n\nWe humbly pray that, with minds concentrated in the azure void, they may stride loftily in the Primordial Azure. Girded with pendants, they shall attend the Origin, celebrating the extension of sagely reign; adorned with tasseled crowns, they shall seek the Dao, heralding the auspicious perpetuation of divine destiny. For this purpose, we now burn incense, taking refuge in the great sagely multitudes, the Perfected Ones’ virtue. After attaining the Dao, may they preserve celestial longevity, harmonizing and uniting with the true Dao.\n\nThis morning, ascending the altar to perform the Dao, we, the assembled Dharma hosts, now offer the second pinch of incense. May this fragrant smoke ascend directly to offer homage to the Supreme Perfected Treasure of the Scriptures. We, your servants, take refuge in body, spirit, and life, prostrating our heads to the earth, reverently relying upon the Supreme Three Worthies and the Ten Directions’ multitudes of sages. May the merit of this incense be dedicated to the spirit of [Name], attaining the joy of the real and ascending to carefree heights.\n\nWe humbly pray that celestial decrees be issued below and profound grace be bestowed. Beneath the emerald canopy’s jeweled curtains, may they ascend the cloud thoroughfares to reach the Vermilion Mound; in jade carriages and cinnabar chariots, may they attend the Western Numinous and dwell loftily in the Crimson Portal. Extending the grace of the precious reign, may they perpetuate the golden branches’ prosperity. For this purpose, we now burn incense, taking refuge in the great sagely multitudes, the Perfected Ones’ virtue. After attaining the Dao, may they ascend into formlessness, harmonizing and uniting with the true Dao.\n\nThis morning, ascending the altar to perform the Dao, we, the assembled Dharma hosts, now offer the third pinch of incense. May this fragrant smoke ascend directly to offer homage to the Supreme Perfected Treasure of the Masters. We, your servants, take refuge in body, spirit, and life, prostrating our heads to the earth, reverently relying upon the Supreme Three Worthies and the Ten Directions’ multitudes of sages. May the merit of this incense be dedicated to the spirit of [Name], awakening to the Dao and attaining the real, concentrating their spirit to enter the wondrous.\n\nWe humbly pray that the Purple Mansion perfects their reality and the Mystic Capital bestows their mandate. In golden chariots with feathered canopies, may they soar through the pure void to return to the Great Brahmā’s heaven; in phoenix forms and simurgh postures, may they tread the jasper blossoms to ascend the Jasper Park’s realms. May their compassionate grace flow eternally through a hundred generations, and their benevolent kindness initiate blessings for ten thousand years. For this purpose, we now burn incense, taking refuge in the great sagely multitudes, the Perfected Ones’ virtue. After attaining the Dao, may they eternally preserve longevity, harmonizing and uniting with the true Dao.\n\n**Chant the Directions. Repent the Directions.**\n\n**Thrice we invoke, thrice we bow, and once more proclaim the sacred ranks.** We, your humble servants—[Name] and the assembled officiants—with reverent sincerity, jointly supplicate the Three Purities, the Most Sagely Ones of the Eastern Pole, the Compassionate Honored One, the true immortals and boundless sagely hosts of the Three Realms, and all the perfected spirits invoked in this altar’s images.\n\nWe humbly beseech your vast compassion to cast forth luminous regard. We have heard that the Dao venerates the Great Unity, whose numinous transformations extend through the ten directions; its teachings spread across the great chiliocosm, flowing profound grace into the deepest obscurities. The jade countenance of emptiness congeals, receiving the golden radiance of the Primordial Beginning. A hundred treasures stream forth brilliance, unfolding dawn’s glow in the night-dark ravines; the ninefold subtle lights revolve in splendor, awakening morning’s radiance in the cold courtyards. Thus may the desolate depths be uplifted by your wind-like grace, and all tread as one the boundless expanse of cloud and sky.\n\nIn reverent compliance with the imperial edict, we have followed the sacred scriptures, solemnly erecting the altar of magic mushrooms. We now grandly perform the wondrous fast of the Jade Register, humbly offering hidden blessings to the true spirits. Hearing the scriptures and listening to the Dharma, we face the lion throne to bask in its light; transcending life and attaining perfection, we tread the dragon steps to mount the dawn’s glory. May blessings extend to the ancestral temples and grace pervade both manifest and hidden realms.\n\nAbove, we pray that the celestial pivot be serene and still, the earthly axis pure and congealed. May sun and moon shine resplendent, mountains and rivers rest in tranquility. The three beacons fall silent, and the mighty warriors rejoice in the lands of Yao; the five grains ripen in abundance, and the wild geese find refuge in the fields of Shun. The night-dark ravines attain the joy of immortals’ flight, and the cold courtyards know no fear of judgment’s reckoning. All that moves and grows, flies and hides, together receive your benevolent grace. The four births and six destinies are wholly sheltered beneath the clouds of compassion.\n\nThus do we manifest the great transformative power of the Heavenly Worthy’s mercy, and below, fulfill the sincerity of our humble devotion. We respectfully make this supplication known.\n\n**Make the vow. Preserve the spirit and burn incense.**\n\nMay the Incense Officials and Envoys, the Lords of the Left and Right Dragon-Tiger, and all the spirit-officials attendant upon the incense ensure that the place where we this morning ascended the altar to perform the Dao rites naturally produces the golden elixir’s cinnabar-green essence. May the hundred numinous perfected ones gather here before the incense burner. May our sincere intent move and connect, the true spirits ascend and transcend, the fruit of immortality be realized, and the grace of state and family be universally bestowed.\n\nMay the jade maidens and immortal youths of the ten directions attend the orchid-scented smoke, conveying the sincerity of our supplication swiftly to the Most High and Boundless Dao of the Three Clarities, the August Jade Emperor of the Golden Portal of the Vast Heaven, and the Merciful Lord of the Eastern Ultimate, the Azure Mystery Emperor, before their Way.\n\n**Exiting the Hall Hymn**\nThe *Jade Register* Rite for Early Morning Salvation is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玉箓资度早午晚朝仪 经名：玉箓资度早午晚朝仪。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 玉箓资度早朝仪 法事如式 各礼师，存念如法 请宣神咒 青阳虚映，跃日回灵。 神虎辟邪，飞天流铃。 摧奸灭试，万魔束形。 九微回道，八威摄精。 千真校录，三元荡清。 左啸中黄，右第六丁。 七转八合，周旋天经。 圣化巍巍，大道兴行。 庆云流布，合景黄庭。 鸣法鼓二十四通 无上三天玄元始三炁太上道君、太上老君，召出臣等身中三五功曹、左右官使者、左右捧香驿龙骑吏、侍香金童、传言散花玉女、五帝直符直日香官，各三十六人出。 出者，严装显服，冠带垂缨。 关启玄坛土地，方域神真。",
      "translated_text": "*The Jade Register’s Ritual for Morning, Noon, and Evening Audiences*\n**Text Title:** *Jade Register’s Ritual for Morning, Noon, and Evening Audiences*\nOne fascicle. Base text from *Daoist Canon of the Zhengtong Era*, Dongxuan Section, *Weiyi* (Ritual Dignity) Category.\n\n**Ritual for the Morning Audience of the Jade Register’s Salvific Empowerment**\nThe rites proceed according to form.\nAll pay homage to the Master and maintain visualization as prescribed.\n\n**Invocation of the Divine Mantra:**\nThe Azure Yang’s empty radiance—leaping sun, revolving numen.\nDivine Tigers repel evil; Flying Devas stream their bells.\nCrushing treachery, vanquishing trials, myriad demons bind their forms.\nNinefold Subtleties return to the Dao; Eightfold Awesomeness seizes essences.\nA thousand Perfected audit the records; Three Primes scour and purify.\nLeft, the Central Yellow’s roar; right, the Sixth Ding’s array.\nSeven revolutions, eight unions—revolving through Heaven’s scriptures.\nSacred transformation, majestic and towering; the Great Dao flourishes in practice.\nAuspicious clouds flow and spread, merging with the Yellow Court’s luminous scene.\n\n**Strike the ritual drum twenty-four times.**\n\nSupreme Three Heavens’ Primordial Origin, First Three *Qi* of the Most High Dao Lord, Most High Lord Lao:\nSummon forth from within us, your servants, the Three and Five Merit Officers, the Attendants and Envoys of Left and Right, the Dragon-Riders bearing incense, the Fragrant Lads of the Golden Youth, the Jade Maidens scattering flowers, the Five Thearchs’ Direct Talismans, the Incense Officials of the Direct Day—thirty-six each, to emerge.\nLet them emerge, clad in solemn raiment, crowned and sashed with trailing tassels.\nReport to the Land Spirit of the Mystic Altar, the Perfected Deities of the precinct’s bounds.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 285,
      "start_sentence": 0,
      "end_sentence": 20,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.365245342254639,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓资度早朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "臣今早朝，升坛行道，谨奏为入意其诸忱悃，已录告闻。 愿得太上十方至真道炁灵宝慧光下降，流入臣等身中，令臣所启速达径御太上无极大道三清上圣、昊天金阙玉皇上帝、东极慈尊青玄上帝道前。 请称法位 具位臣姓某与临坛官众等，谨同诚上启虚无自然至真无极大道元始天尊，太上道君，太上老君，高上玉皇上帝，紫微北极大帝，紫微天皇大帝，后土皇地祇，东极青华大帝，南极长生大帝，无上玉帝，玉虚上帝，东华南极西灵北真玄都玉京金阙七宝琼台紫微上宫灵宝至真明皇道君，十方已得道大圣众、至真诸君丈人，大慈大悲救苦真人、救度真人、大惠真人、 注生真人、普救真人、香林会中法解真人，三十六部尊经，玄中大法师，三天大法师，灵宝经籍度三师真君，正一嗣系女三师真君，三界官属，一切真灵。 臣闻，赤明开圆，敷三元於祖炁； 青玄御运，宏十极之真光。 威神凝妙於紫金，慧力敷华於翠玉。 香林驻景，琅音尊应念之慈； 骞树腾辉，琼号表寻声之惠。 二府云联而宗德，九司星列以推仁。 赫赫灵功，巍巍圣化。 臣等福由宿庆，运际昌期。 佩妙戒於身前，希夷师锡； 击鸾图於肘后，微妙天开。 莫高蹈於鹏搏，乃卑栖而驹逐。 学真补过，退坚励己之诚； 宏道立功，进勉度人之力。 恭承上命，敢不告闻。 以今钦奉纶音，崇修玉箓，资荐某灵。 虔洁己以输诚，谨斋心而沥悃。 归心东极，愿开甘露之门； 荐福某灵，早证紫虚之位。 恩流宗社，泽被人天。 以今早朝，升坛行道，请法众等，运慈初捻上香。 愿此香烟腾空，径上供养无上至真道宝。 臣等皈身皈神皈命，首体投地，仰依太上三尊十方众圣。 愿以是香功德，端为某灵，增崇天福，登进仙阶。 恭愿凝神空碧，高步始青。 拥环佩以朝元，庆延圣祚； 被藻旒而问道，祥衍神终。 今故烧香，自皈依师尊大圣众，至真之德，得道之后，保天长存，和与道合真。 以今早朝，升坛行道，请法众等，运兹二捻上香。 愿此香烟腾空，径上供养无上至真经宝。 臣等皈身皈神皈命，首体投地，仰依太上三尊、十方众圣。 愿以是香功德，端为某灵，登真快乐，进陟逍遥。 恭愿天诏下颁，玄恩诞锡。 翠华宝幄，升云衢而直上朱陵； 玉辇丹舆，朝西灵而高居绛阙。 推恩宝祚，垂裕金枝。 今故烧香，自皈依师尊大圣众，至真之德，得道之后，升入无形，和与道合真。 以今早朝，升坛行道，请法众等，运兹三捻上香。 愿此香烟腾空，径上供养无上至真师宝。 臣等皈身皈神皈命，首体投地，仰依太上三尊、十方众圣。 愿以是香功德，端为某灵，悟道登真，凝神入妙。 恭愿紫府成真，玄都锡命。 金舆羽葆，冲清虚而归大梵之天； 凤表鸾姿，步瑶华而陟阆苑之境。 慈泽永流於百世，仁恩启佑於万年。 今故烧香，自皈依师尊大圣众，至真之德，得道之后，永保长存，和与道合真。 唱方 忏方",
      "translated_text": "Your Majesty this morning ascends the altar to perform the Dao, humbly presenting these sincere offerings of heartfelt devotion, now recorded and made known. May the luminous *qi* of the Supreme Ten Directions’ Perfected Dao, the numinous treasure of wisdom’s radiance, descend and flow into our bodies, that our supplications swiftly reach the presence of the Supreme Limitless Great Dao’s Three Clarities and Most Sacred Ones, the Jade Emperor of the Golden Portal of the Vast Heaven, the Eastern Ultimate’s Compassionate August One and Azure Mystery Emperor, and the Dao’s throne.\n\n**Invoking the Dharma Titles:**\nYour humble servant, [Name], along with the assembled altar officers, jointly and sincerely prostrate to address the Void and Spontaneous Perfect Limitless Great Dao, the Primordial Heavenly Worthy; the Supreme Dao Lord; the Supreme Lord Lao; the August Jade Emperor on High; the Northern Culmen’s Great Emperor of Purple Tenuity; the Heavenly Emperor of Purple Tenuity; the August Earth Spirit of the Imperial Mound; the Eastern Ultimate’s August Emperor of Azure Radiance; the Southern Ultimate’s August Emperor of Longevity; the Supreme Jade Emperor; the Jade Void Emperor; the Eastern Florescence, Southern Ultimate, Western Numinous, Northern Perfected, and Mystic Capital’s Jade Metropolis and Golden Portal’s Seven-Jewel Jeweled Terrace and Purple Tenuity’s Upper Palace’s Numinous Treasure Perfected Radiant August Dao Lord; the Ten Directions’ Great Holy Multitudes who have attained the Dao; the Perfected Lords and Venerable Masters; the Great Compassionate and Great Merciful Savior Perfected Ones, the Salvation Perfected Ones, the Great Benevolent Perfected Ones, the Life-Registering Perfected Ones, the Universal Salvation Perfected Ones, and the Dharma-Releasing Perfected Ones of the Fragrant Grove Assembly; the Thirty-Six Divisions’ Venerable Scriptures; the Great Dharma Masters of the Mystic Center; the Great Dharma Masters of the Three Heavens; the True Lords of the Three Masters of the Numinous Treasure Scriptures’ Transmission; the True Lords of the Orthodox Unity’s Lineage and the Three Female Masters; the officials and attendants of the Three Realms; and all true numina.\n\nWe have heard that when Crimson Clarity opened the cosmos, the Three Origins were spread through the ancestral *qi*; when the Azure Mystery governed the course, the true radiance of the Ten Ultimates was magnified. Majestic numen congeals in wondrous subtlety within purple gold; wisdom’s power unfolds in blossoming splendor upon jasper. The Fragrant Grove anchors its scene, its resonant tones responding to compassionate thoughts; the Kien Tree soars in brilliance, its jade proclamations manifesting the grace of answering cries. The Two Bureaus’ clouds unite in venerating virtue; the Nine Offices’ stars array to extend benevolence. Resplendent is the numinous efficacy; majestic is the sagely transformation.\n\nWe, your servants, are blessed by karmic fortune and live in an era of flourishing destiny. Wearing wondrous precepts before our bodies, we receive the esoteric gifts of the reclusive masters; grasping the phoenix charts behind our elbows, we witness the subtle unfolding of heaven. Not soaring high in the roc’s flight, we yet humbly dwell, chasing the fleeting hours. Studying the real to amend faults, we retreat to strengthen our resolve; propagating the Dao to establish merit, we advance to exert our efforts in delivering others. Reverently bearing the celestial mandate, dare we not make this known?\n\nToday, in reverent compliance with the imperial edict, we solemnly perform the Jade Register rites to aid and recommend the spirit of [Name]. Purifying ourselves to offer sincerity, we earnestly fast our minds and pour forth our heartfelt devotion. Turning our hearts to the Eastern Ultimate, we pray the gates of sweet dew be opened; bestowing blessings upon the spirit of [Name], may they swiftly attain the Purple Void’s rank. May grace flow through the ancestral shrines and blessings extend to humanity and heaven.\n\nThis morning, ascending the altar to perform the Dao, we, the assembled Dharma hosts, now offer the first pinch of incense. May this fragrant smoke ascend directly to offer homage to the Supreme Perfected Treasure of the Dao. We, your servants, take refuge in body, spirit, and life, prostrating our heads to the earth, reverently relying upon the Supreme Three Worthies and the Ten Directions’ multitudes of sages. May the merit of this incense be dedicated to the spirit of [Name], augmenting celestial blessings and advancing their immortal ranks.\n\nWe humbly pray that, with minds concentrated in the azure void, they may stride loftily in the Primordial Azure. Girded with pendants, they shall attend the Origin, celebrating the extension of sagely reign; adorned with tasseled crowns, they shall seek the Dao, heralding the auspicious perpetuation of divine destiny. For this purpose, we now burn incense, taking refuge in the great sagely multitudes, the Perfected Ones’ virtue. After attaining the Dao, may they preserve celestial longevity, harmonizing and uniting with the true Dao.\n\nThis morning, ascending the altar to perform the Dao, we, the assembled Dharma hosts, now offer the second pinch of incense. May this fragrant smoke ascend directly to offer homage to the Supreme Perfected Treasure of the Scriptures. We, your servants, take refuge in body, spirit, and life, prostrating our heads to the earth, reverently relying upon the Supreme Three Worthies and the Ten Directions’ multitudes of sages. May the merit of this incense be dedicated to the spirit of [Name], attaining the joy of the real and ascending to carefree heights.\n\nWe humbly pray that celestial decrees be issued below and profound grace be bestowed. Beneath the emerald canopy’s jeweled curtains, may they ascend the cloud thoroughfares to reach the Vermilion Mound; in jade carriages and cinnabar chariots, may they attend the Western Numinous and dwell loftily in the Crimson Portal. Extending the grace of the precious reign, may they perpetuate the golden branches’ prosperity. For this purpose, we now burn incense, taking refuge in the great sagely multitudes, the Perfected Ones’ virtue. After attaining the Dao, may they ascend into formlessness, harmonizing and uniting with the true Dao.\n\nThis morning, ascending the altar to perform the Dao, we, the assembled Dharma hosts, now offer the third pinch of incense. May this fragrant smoke ascend directly to offer homage to the Supreme Perfected Treasure of the Masters. We, your servants, take refuge in body, spirit, and life, prostrating our heads to the earth, reverently relying upon the Supreme Three Worthies and the Ten Directions’ multitudes of sages. May the merit of this incense be dedicated to the spirit of [Name], awakening to the Dao and attaining the real, concentrating their spirit to enter the wondrous.\n\nWe humbly pray that the Purple Mansion perfects their reality and the Mystic Capital bestows their mandate. In golden chariots with feathered canopies, may they soar through the pure void to return to the Great Brahmā’s heaven; in phoenix forms and simurgh postures, may they tread the jasper blossoms to ascend the Jasper Park’s realms. May their compassionate grace flow eternally through a hundred generations, and their benevolent kindness initiate blessings for ten thousand years. For this purpose, we now burn incense, taking refuge in the great sagely multitudes, the Perfected Ones’ virtue. After attaining the Dao, may they eternally preserve longevity, harmonizing and uniting with the true Dao.\n\n**Chant the Directions. Repent the Directions.**",
      "overlap_context": " within us, your servants, the Three and Five Merit Officers, the Attendants and Envoys of Left and Right, the Dragon-Riders bearing incense, the Fragrant Lads of the Golden Youth, the Jade Maidens scattering flowers, the Five Thearchs’ Direct Talismans, the Incense Officials of the Direct Day—thirty-six each, to emerge.\nLet them emerge, clad in solemn raiment, crowned and sashed with trailing tassels.\nReport to the Land Spirit of the Mystic Altar, the Perfected Deities of the precinct’s bounds.",
      "start_char": 285,
      "end_char": 1384,
      "start_sentence": 21,
      "end_sentence": 71,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.876209020614624,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓资度早朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "三启 三礼 重称法位 具位臣姓某与临坛官众等，谨同诚上启三清上圣东极慈尊，三界真仙无鞅众圣，醮筵设像一切真灵。 恭望洪慈，洞垂昭鉴。 臣闻，道尊太一，端神化於十方； 教衍大千，流玄恩於郁绝。 凝虚无之玉相，承元始之金光。 百宝流明，开晨辉於夜壑； 九微回曜，启朝景於寒庭。 庶提风泽之幽寥，均步云霄之渺莽。 以今钦奉纶音，爰遵蕊笈，肃建芝坛。 诞修玉箓之妙斋，庸荐真灵之冥福。 闻经听法，朝狮御以依光； 度命登真，步龙墀而御景。 庆延宗社，泽被显幽。 上愿乾枢澄湛，坤轴清凝。 日月辉华，山河宁谧。 三烽息警、貔貅乐意於尧疆； 五谷告成，鸿雁栖身於舜亩。 夜壑遂仙飞之乐，寒庭无校录之虞。 动植飞潜，俱承惠泽。 四生六道，悉被慈云。 则上明天尊大慈之化，下副臣等皈命之诚。 谨启以闻。 发愿 存神烧香",
      "translated_text": "**Thrice we invoke, thrice we bow, and once more proclaim the sacred ranks.** We, your humble servants—[Name] and the assembled officiants—with reverent sincerity, jointly supplicate the Three Purities, the Most Sagely Ones of the Eastern Pole, the Compassionate Honored One, the true immortals and boundless sagely hosts of the Three Realms, and all the perfected spirits invoked in this altar’s images.\n\nWe humbly beseech your vast compassion to cast forth luminous regard. We have heard that the Dao venerates the Great Unity, whose numinous transformations extend through the ten directions; its teachings spread across the great chiliocosm, flowing profound grace into the deepest obscurities. The jade countenance of emptiness congeals, receiving the golden radiance of the Primordial Beginning. A hundred treasures stream forth brilliance, unfolding dawn’s glow in the night-dark ravines; the ninefold subtle lights revolve in splendor, awakening morning’s radiance in the cold courtyards. Thus may the desolate depths be uplifted by your wind-like grace, and all tread as one the boundless expanse of cloud and sky.\n\nIn reverent compliance with the imperial edict, we have followed the sacred scriptures, solemnly erecting the altar of magic mushrooms. We now grandly perform the wondrous fast of the Jade Register, humbly offering hidden blessings to the true spirits. Hearing the scriptures and listening to the Dharma, we face the lion throne to bask in its light; transcending life and attaining perfection, we tread the dragon steps to mount the dawn’s glory. May blessings extend to the ancestral temples and grace pervade both manifest and hidden realms.\n\nAbove, we pray that the celestial pivot be serene and still, the earthly axis pure and congealed. May sun and moon shine resplendent, mountains and rivers rest in tranquility. The three beacons fall silent, and the mighty warriors rejoice in the lands of Yao; the five grains ripen in abundance, and the wild geese find refuge in the fields of Shun. The night-dark ravines attain the joy of immortals’ flight, and the cold courtyards know no fear of judgment’s reckoning. All that moves and grows, flies and hides, together receive your benevolent grace. The four births and six destinies are wholly sheltered beneath the clouds of compassion.\n\nThus do we manifest the great transformative power of the Heavenly Worthy’s mercy, and below, fulfill the sincerity of our humble devotion. We respectfully make this supplication known.\n\n**Make the vow. Preserve the spirit and burn incense.**",
      "overlap_context": " postures, may they tread the jasper blossoms to ascend the Jasper Park’s realms. May their compassionate grace flow eternally through a hundred generations, and their benevolent kindness initiate blessings for ten thousand years. For this purpose, we now burn incense, taking refuge in the great sagely multitudes, the Perfected Ones’ virtue. After attaining the Dao, may they eternally preserve longevity, harmonizing and uniting with the true Dao.\n\n**Chant the Directions. Repent the Directions.**",
      "start_char": 1384,
      "end_char": 1726,
      "start_sentence": 72,
      "end_sentence": 98,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.47369384765625,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓资度早朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "香官使者、左右龙虎君、侍香诸灵官，当令臣向来早朝升坛行道之所，自然生金液丹碧之英。 百灵众真，交会在此，香火炉前。 当愿诚意感通，真灵升度，克证神仙之果，普资家国之恩。 十方仙童玉女，接侍兰烟，传臣向来所启之诚，速达径御至真无极大道三清上圣、昊天金阙玉皇上帝、东极慈尊青玄上帝道前。 出堂颂 玉箓资度早朝仪竟",
      "translated_text": "May the Incense Officials and Envoys, the Lords of the Left and Right Dragon-Tiger, and all the spirit-officials attendant upon the incense ensure that the place where we this morning ascended the altar to perform the Dao rites naturally produces the golden elixir’s cinnabar-green essence. May the hundred numinous perfected ones gather here before the incense burner. May our sincere intent move and connect, the true spirits ascend and transcend, the fruit of immortality be realized, and the grace of state and family be universally bestowed.\n\nMay the jade maidens and immortal youths of the ten directions attend the orchid-scented smoke, conveying the sincerity of our supplication swiftly to the Most High and Boundless Dao of the Three Clarities, the August Jade Emperor of the Golden Portal of the Vast Heaven, and the Merciful Lord of the Eastern Ultimate, the Azure Mystery Emperor, before their Way.\n\n**Exiting the Hall Hymn**\nThe *Jade Register* Rite for Early Morning Salvation is now complete.",
      "overlap_context": " of immortals’ flight, and the cold courtyards know no fear of judgment’s reckoning. All that moves and grows, flies and hides, together receive your benevolent grace. The four births and six destinies are wholly sheltered beneath the clouds of compassion.\n\nThus do we manifest the great transformative power of the Heavenly Worthy’s mercy, and below, fulfill the sincerity of our humble devotion. We respectfully make this supplication known.\n\n**Make the vow. Preserve the spirit and burn incense.**",
      "start_char": 1726,
      "end_char": 1884,
      "start_sentence": 99,
      "end_sentence": 104,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.549544811248779,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓资度早朝仪.txt",
        "category": "威仪类"
      }
    }
  ]
}