{
  "source_id": "王弼老子注",
  "source_file": "chunked_daozang\\王弼老子注.json",
  "total_chunks": 27,
  "total_original_chars": 15071,
  "total_translated_chars": 81329,
  "total_translation_time": 415.3029305934906,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\王弼老子注.txt",
    "category": "藏外"
  },
  "full_translation": "Wang Bi’s *Commentary on the Laozi*, Chapter 1\n\nThe Dao that can be spoken of is not the constant Dao. The name that can be named is not the constant name. That which designates things and creates forms is not their eternal nature. Thus, it cannot be spoken of, cannot be named.\n\nAll that exists begins in nonexistence. Therefore, before form and name arise, it is the beginning of the myriad things. When it has form and name, it nurtures them, rears them, matures them, and ripens them—acting as their mother.\n\nThe Dao speaks of how the formless and nameless give rise to the myriad things. The myriad things, though begun and completed, do not know why it is so. This is the mystery within mystery.\n\nThe wondrous is the utmost subtlety. The myriad things begin in subtlety before taking form, begin in nothingness before coming into being. Thus, by constantly abiding in desireless emptiness, one may observe the wondrous beginning of things. The subtlety returns to the end.\n\nAll that exists as benefit must employ nonexistence as its function. The root of desire, when aligned with the Dao, then succeeds. Thus, by constantly abiding in desire, one may observe the completion of things at their end.\n\nThese two—beginning and mother—emerge from the same source. Their emergence is one and the same, issuing from the profound.\n\nTheir designations differ in application and cannot be the same. At the beginning, it is called the \"origin\"; at the end, it is called the \"mother.\" The profound is darkness, silence, and nothingness. From it issue both origin and mother. It cannot be grasped or named, and thus cannot be called by the same name as the profound. Yet to speak of it as \"profound\" is to take what cannot be grasped and call it so. If one could name it as \"one profound,\" then it would be a fixed term, missing the mark by far. Thus it is said: \"the mystery within mystery.\" All wonders emerge from this profound, and so it is called \"the gateway of the myriad wonders.\"\n\n---\n\n2.\nBeauty is what the human heart advances toward and delights in; ugliness is what the human heart detests and abhors. Beauty and ugliness are like joy and anger; good and not-good are like right and wrong. Joy and anger share the same root; right and wrong emerge from the same gate. Thus, they cannot be singly asserted. These six—beauty, ugliness, joy, anger, right, and wrong—all arise from nature and cannot be singly enumerated. Nature is already sufficient; to impose rules is to fail. Wisdom is self-sufficient; to act is to feign. Employing things as they are, merit is accomplished by them, and thus not claimed. If merit is claimed as one’s own, it cannot endure.\n\n---\n\n3.\n\"Worthy\" is akin to \"capable.\" \"Esteem\" is the name for what is commendable; \"noble\" is the term for what is exalted. If only capability is entrusted, why esteem? If only utility is applied, why exalt? To esteem the worthy is to display fame beyond their capacity; acting thus, they constantly compare and vie in ability. To prize wealth beyond its use is to incite the greedy to compete, to break through walls and rifle chests, to risk life in theft. Thus, if what is desirable is not seen, the heart remains undisturbed. The mind harbors wisdom while the belly holds food—outwardly wise yet inwardly devoid of true knowledge. Bones devoid of knowledge contend; the will generates affairs and disturbs the heart (when the heart is empty, the will is weak). Guard one’s authenticity. The wise call knowing \"acting.\"\n\n---\n\n4.\nOne who clings to the measure of a single household cannot preserve the whole household. One who clings to the measure of a single state cannot perfect the state. Exerting all strength to lift a heavy burden cannot make it useful. Thus, though one may know how to govern the myriad things, governing without the Way of the Two Modes cannot suffice. Though Earth possesses form and substance, without modeling itself on Heaven, it cannot preserve its tranquility. Though Heaven possesses essence and image, without modeling itself on the Dao, it cannot preserve its essence. Employing it through emptiness, its use is inexhaustible. Filling it to create solidity, solidity brings overflow. Thus, employing it through emptiness, it is never full. Its inexhaustibility is absolute.\n\nThough form may be vast, it cannot burden its body. Though affairs may be numerous, they cannot fill its measure. If the myriad things abandon this to seek a master, where can that master be found? Is it not deep and abiding, like the ancestor of the myriad things? Blunted yet undiminished, entangled yet untroubled, harmonizing its light without defiling its body, blending with dust without losing its truth—is it not serene and seemingly present? Earth guards its form, yet virtue cannot exceed its bearing. Heaven fulfills its image, yet virtue cannot exceed its covering. Neither Heaven nor Earth can reach it—is it not like what precedes the Emperor? The Emperor is Heaven’s Emperor.\n\nChapter 5\n\nHeaven and Earth act through spontaneity, without deliberate action or creation. The myriad things govern themselves, thus they do not practice \"benevolence.\" For benevolence necessarily involves establishing, enacting, and transforming—bestowing favor and taking action. Where there is establishing, enacting, and transforming, things lose their authenticity. Where there is favor and action, things cannot fully exist. If things cannot fully exist, they are insufficient to fulfill their capacity as vessels.\n\nHeaven and Earth do not grow grass for beasts, yet beasts eat grass. They do not raise dogs for humans, yet humans eat dogs. Acting without deliberate action toward the myriad things, each finds its proper use—thus none are left wanting. If wisdom were planted by oneself, it would not suffice as a foundation.\n\nThe sage harmonizes virtue with Heaven and Earth, regarding the common people as straw dogs. The bellows is the bellows; the flute is the flute. Within the bellows and flute, emptiness reigns—without emotion or deliberate action. Thus, they are hollow and cannot be exhausted, moving yet inexhaustible.\n\nAt the center of Heaven and Earth, all flows through spontaneity—thus it cannot be exhausted, just like the bellows and flute. The more one acts upon it, the more one loses it. When things are rooted in \"wisdom,\" affairs become entangled in words. Without wisdom, there is no success; without words, there is no order—this is the inevitable path to exhaustion.\n\nIf one abides within the principle of the bellows and flute, there is no end. Relinquishing the self to serve things, nothing remains unordered. But if the bellows and flute had intentions to produce sound, they would be insufficient to meet the needs of those who blow them.\n\n**Chapter 6**\nThe spirit of the valley resides in the valley’s center—yet it is no-thing. Without form, without shadow, without resistance, without opposition, it abides in lowliness yet does not move, guards stillness yet does not decay. All things attain completion through it, yet its form is unseen—this is the supreme thing. Dwelling in lowliness and guarding stillness, it cannot be named; thus it is called the **Mysterious Female**. (The root of Heaven and Earth endures ceaselessly as if present, its function unchanging.) The gate is the source from which the Mysterious Female emerges. Tracing its origin, it shares the same body as the **Great Ultimate**; thus it is called the root of Heaven and Earth. If one claims it exists, its form cannot be seen; if one claims it is gone, the myriad things are born through it—thus it endures ceaselessly as if present. Nothing is not brought to completion by it, yet it does not toil; therefore it is said: \"Its function is inexhaustible.\"\n\n**Chapter 7**\nTo be self-generated is to contend with things; not to be self-generated is for things to return to it. One who is selfless acts without concern for the self. The self is thus preserved first—therefore it is said: \"One is able to fulfill one’s private ends.\"\n\n**Chapter 8**\nHumans despise lowliness, but the Dao has no fixed form like water—thus it is said to be \"near.\" This means that water, like all things, responds to the Dao.\n\n**Chapter 9**\n\"Holding\" means not losing one’s virtue. Having not lost virtue, to then fill it further is to invite peril—thus it is better to cease. This means it is even less desirable than one who possesses neither virtue nor merit. Having shaped the tip to a point, to then sharpen it further is to invite breakage—thus it cannot be long preserved. It is better to cease; it cannot be long preserved. The four seasons alternate in succession; when a task is complete, it shifts onward.\n\n**Chapter 10**\n\"Carrying\" is like dwelling.\n\n**Chapter 10 (continued)**\n\nThe dwelling of the *hun* and *po* is humanity’s constant abode. It is the true essence of the individual. This means: if one can dwell in the abode of constancy, embracing the One and keeping the spirit pure, never parting from it—then the myriad things will naturally submit. \"Devoted commitment\" is single-minded application; \"attaining the ultimate\" is reaching the utmost limit. This means: if one can entrust oneself to the natural *qi*, attaining the utmost softness and harmony, becoming like an infant free of desire—then things will be whole and one’s nature will be realized.\n\n\"The ultimate of the mysterious\" is the pinnacle of subtle things. This means: if one can cleanse away false adornments, reaching the utmost clarity, neither allowing things to obstruct one’s illumination nor blemish one’s spirit—then one will ultimately merge with the mysterious. Those who employ techniques to seek success or rely on calculations to conceal themselves act with cunning. But with a gaze as mysterious and unblemished as this, governing a state without cunning is like discarding it altogether. If one can govern without cunning—then the people will not deceive, and the state will be well-ordered.\n\n\"The Gate of Heaven\" refers to that by which all under heaven follows. It is the juncture of opening and closing, order and chaos. Whether opening or closing, it pervades all under heaven—thus it is called \"the opening and closing of the Gate of Heaven.\" The female responds without initiating; it follows without acting. This means: if the Gate of Heaven’s opening and closing can be like the female—then things will naturally submit, and one’s dwelling will be at peace. This means: with utmost clarity extending in all four directions, free from delusion or confusion—can one act without contrivance?\n\nThen things transform of themselves. The Dao is ever without action—if lords and kings can hold to it, the myriad things will transform spontaneously. Do not block their source. If their source is not blocked, things arise of themselves—what merit is there to claim? Do not restrain their nature, and things fulfill themselves—what reliance is there to seek? Things grow to fullness without our shaping or completing them. To possess virtue yet have no master—what is this if not the mysterious? All references to \"mysterious virtue\" speak of possessing virtue while unaware of its source, emerging from the hidden and obscure.\n\n**Chapter 11**\nThe hub governs the thirty spokes by means of its emptiness. It is because of its emptiness that it can receive the spokes—thus it can govern the many with the few. The wood, clay, and walls that form the three materials of a house all serve their function through emptiness. This means: what is called \"emptiness\" is the very source of usefulness. All things rely on emptiness for their function.\n\n**Chapter 12**\n\"Scar\" means deviation, a loss of proper function. When the mouth loses its use, it is called a scar. The ears, eyes, mouth, and heart all follow their nature. If one does not follow the nature of life but instead harms what is natural, this is called blindness, deafness, scarring, and madness. Rare and precious goods obstruct the true path of people, causing their conduct to falter. Those who live for the belly use things to nourish themselves; those who live for the eyes use things to enslave themselves. Thus the sage does not live for the eyes.\n\n**Chapter 13**\nFavor inevitably brings disgrace; glory inevitably brings misfortune. Favor and disgrace are equal, glory and misfortune the same. If one is humbled yet receives favor or disgrace, glory or misfortune as if startled, one is not fit to disturb the world. Great misfortune arises from glory and favor. To thicken life is to enter the realm of death—thus it is called great misfortune. People are deluded by glory and favor, turning them back upon themselves—thus it is said, \"great misfortune is like one’s own body.\" It is because one has a body that one returns to the natural. Nothing can be exchanged for one’s body—thus it is called precious. Only thus can one be entrusted with the world. Nothing can harm one’s body—thus it is called beloved. Only thus can one be entrusted with the world. If one does not allow favor or disgrace, glory or misfortune to harm or exchange for one’s body, only then can the world be entrusted to them.\n\n**Chapter 14**\nWithout form, without image, without sound, without echo—thus it can penetrate everywhere, go anywhere. It cannot be known, and even with my ears, eyes, and body, I cannot name it—thus it cannot be questioned. Blended into oneness, if one wishes to call it \"not so,\" things arise from it; if one wishes to call it \"so,\" no form is seen. Thus it is called \"the form of the formless, the image of the imageless.\" It cannot be fixed or defined. That which has its reality yet lacks form or name is the ancestor of the myriad things. Though past and present differ, times change and customs shift, there is nothing that does not rely on this to achieve order. Thus one can grasp the ancient Dao to steer the present. Though high antiquity is distant, its Dao remains—thus even in the present, one can know the beginning of the ancient.\n\n**Chapter 15**\nWhen crossing a river in winter, one hesitates as if wishing to ford it, as if not wishing to ford it—such is the appearance of a mind whose true state cannot be discerned. When the four neighbors unite to attack the central lord, he remains uncertain of his direction. The person of supreme virtue—his beginnings and intentions cannot be observed, just like this. All these \"as if\" descriptions speak of appearances that cannot be captured in form or name. Obscurity brings clarity to things; turbidity, when stilled, becomes clear; stillness in movement brings life to things—this is the Dao of the natural. Who can articulate its difficulty? \"Removing\" means careful deliberation. \"Fullness\" inevitably leads to overflow. \"Covering\" means concealment.\n\n**Chapter 16**\nTo attain emptiness is the utmost sincerity of things; to guard stillness is the true essence of things. In activity and growth, observe their return through emptiness and stillness. All things arise from emptiness, movement from stillness—thus though the myriad things act in concert, they ultimately return to emptiness and stillness. This is the utmost sincerity of things. Each returns to its origin; returning to the root is stillness—thus it is called stillness. Stillness is returning to life—thus it is called returning to life. Returning to life is attaining the constancy of life—thus it is called constancy. As for constancy, it is neither partial nor conspicuous, without the appearance of brightness or obscurity, warmth or coolness—thus it is called \"knowing constancy is called illumination.\" Only this return can encompass all things without exclusion. To lose this is to invite deviation. When things depart from their proper place, it is said, \"not knowing constancy leads to reckless action and misfortune,\" for there is nothing to encompass. Without exclusion, one attains boundless impartiality. Boundless impartiality leads to all-pervading universality. All-pervading universality leads to unity with Heaven. United with Heaven in virtue, embodying the great penetration of the Dao, one attains the ultimate of emptiness. Attaining the ultimate of emptiness, one grasps the constancy of the Dao—thus one reaches the inexhaustible. As for the thing called emptiness: water and fire cannot harm it, metal and stone cannot destroy it. Applied to the mind, tigers and rhinos have nowhere to sink their claws or horns, weapons have nowhere to lodge their blades. What danger or peril could there be?\n\nThe Highest refers to the Great Person. The Great Person is above, hence called the Highest. When the Great Person is above, they dwell in the affairs of non-action and practice the teaching without words. The myriad things arise yet they do not initiate—thus those below merely know of their existence. This is to say, they follow what is above.\n\nIf one cannot dwell in non-action in affairs or teach without words, but instead establishes goodness and enacts beneficence, causing those below to grow close and praise them, they can no longer govern things through kindness and benevolence but must rely on authority and power.\n\nIf one cannot govern the people with uprightness and instead rules the state with cleverness, those below will know to evade them, and their commands will not be followed—hence it is said they are treated with contempt.\n\nWhen governing the great loses its nature, illness and disease arise. When assisting things loses their truth, flaws and conflicts emerge. When trust is insufficient, there will be distrust. This is the natural Dao.\n\nTo dwell in insufficiency cannot be remedied by cleverness. The beginnings and signs of the natural cannot be seen, nor can its intentions and tendencies be perceived.\n\nThe words of the Dao cannot be altered by any thing, and every word must have its response—thus it is said, \"How profound! How prized are its words.\"\n\nDwelling in non-action, practicing the teaching without words, not establishing things through form—thus achievements are completed and affairs succeed, yet the hundred clans do not know why it is so.\n\n**Chapter 18**\nWhen non-action is lost and one instead relies on deploying wisdom to establish goodness, the Dao advances things. Employing techniques and using cleverness to examine deceit and falsehood, pursuing visible forms and appearances, things will know to evade them—thus when wisdom and intelligence emerge, great falsity arises.\n\nThe most exalted names arise from the greatest evils—this is what is meant by \"beauty and ugliness share the same gate.\" The six relations—father and son, elder and younger brothers, husband and wife—if the six relations are naturally harmonious, the state will be naturally harmonious, and then filial piety and kindness, loyal ministers, will be nowhere to be found.\n\nThe Dao of fish forgetting one another in rivers and lakes gives rise to the virtue of mutual moistening.\n\n**Chapter 19**\nThe goodness of sagely wisdom and talent, the goodness of benevolence and righteousness in conduct, the goodness of skill and profit in use—yet it is simply said to \"cut them off.\" The ornament is insufficient, and the command has no attachment, so its intent cannot be seen. Thus it is said, \"These three are taken as ornament but are insufficient,\" and so one is made to have attachment—to attach to plain simplicity and few desires.\n\n**Chapter 20**\nThe lower section states: \"Those who engage in learning increase day by day; those who practice the Dao diminish day by day.\" Thus learning seeks to increase one's abilities and advance one's intelligence.\n\nIf one is without desire and content, what need is there for increase? If one hits the mark without knowing, what need is there for advancement? Swallows and sparrows have their mates; turtledoves and pigeons have their rivals. The people of cold lands must know felt and fur. When nature is already sufficient, to increase it brings worry. Thus to lengthen a duck's legs—how is it different from cutting a crane's shins? To advance in fear of censure—how is it different from fearing punishment? Only when beauty and ugliness are denounced—how far apart are they? Thus what others fear, I too fear, and dare not rely on it for use.\n\nAlas, how distant is this from the common way! The multitude is deluded by beautiful advancement, confused by glory and profit, desiring to advance and compete in heart—thus they are radiant as if feasting on grand sacrifices, as if ascending a terrace in spring.\n\nI am vast and formless, without nameable shape, without signs that can be raised—like an infant who cannot yet laugh. As if without abode, the multitude all have thoughts and aspirations filling their hearts—thus it is said, \"All have excess.\" I alone am vast and without action or desire, as if lost. The utterly foolish, their minds without distinction, their intentions without beauty or ugliness, their feelings yet unseen—I am listless like this. Without distinction, without nameable brightness, without separation or analysis, their feelings unseen, without attachment or use—all desire to have some application. Without desire for action, dull and dim, as if without knowledge—thus it is said, \"Stubborn and coarse.\"\n\nFeeding is the root of life. People all abandon the root of the living people and value the flower of adornment—thus it is said, \"I alone desire to be different from others.\"\n\n**Chapter 21**\nEmptiness is hollow. Only by taking emptiness as virtue can one then act in accord with the Dao. The sigh of the indistinct and formless, without attachment—by the formless, things begin; without attachment, things are completed. The ten thousand things begin and are completed, yet do not know why it is so. Thus it is said, \"Vague! Elusive! Within it there are things. Elusive! Vague! Within it there are images.\"\n\nThe sigh of the profound and distant—deep and distant, it cannot be seen, yet the ten thousand things arise from it. It cannot be seen, yet by it the true is determined. Thus it is said, \"Dark! Obscure! Within it there is essence.\" *Xin* means verification. When things return to the dark and obscure, the utmost of true essence is attained, and the nature of the ten thousand things is settled. Thus it is said, \"Its essence is utterly true; within it there is verification.\"\n\nThe utmost of truth cannot be named—without name, this is its name. From ancient times to the present, nothing does not thereby come to completion. Thus it is said, \"From ancient times to the present, its name does not depart.\"\n\nThe *zhongfu* is the beginning of things. By the nameless, the beginning of the ten thousand things is observed. This is what was said above. How do I know that the ten thousand things begin from the nameless? By this I know it.\n\nChapter 22:\n(Not seeing oneself preserves one’s clarity; thus it is complete.)\n(Not asserting oneself manifests one’s rightness.)\n(Not boasting ensures one’s achievements endure.)\n(Not self-aggrandizing allows one’s virtue to grow.)\nThe Dao of spontaneity is like a tree:\nthe more it branches, the farther it strays from its root;\nthe less it branches, the deeper its foundation in virtue.\nExcess strays from the true, hence it is called delusion.\nRestraint attains the root, hence it is called attainment.\nOneness is the utmost of restraint.\nThis is the standard to follow.\n\nChapter 23:\nWhat is heard yet not perceived is called *xi*.\nThe following chapter states:\nThe Dao’s words emerge bland, utterly flavorless.\nSeen, it is not enough to behold; heard, it is not enough to perceive.\nYet these flavorless, inaudible words are the utmost of natural speech.\nIt speaks of violent impulses and fleeting passions that do not endure.\n\"Following the Dao\" refers to those who act in accordance with it.\nThe Dao accomplishes and sustains the ten thousand things through formlessness and non-action.\nThus, those who follow the Dao take non-action as their ruler, silence as their teaching.\nSubtle yet ever-present, things attain their true nature and unite with the Dao in body.\nHence it is said, \"One with the Dao.\"\nAttainment is minimal—minimal, thus it is called attainment.\nIn conduct, attainment unites with attainment in body.\nHence it is said, \"One with attainment.\"\nFailure is encumbrance by excess—excess encumbers, thus it is called failure.\nIn conduct, failure unites with failure in body.\nHence it is said, \"One with failure.\"\nIt speaks of responding to whatever one follows, thus aligning with it.\nWhen loyalty and trust are insufficient among inferiors, how can there be no distrust?\n\n**Chapter 24**\nThings that overreach lose their stability—thus it is said, \"Those who stand on tiptoe cannot stand firm.\"\n[If one does not display oneself, one’s illumination remains whole.]\n[If one does not assert oneself, one’s rightness becomes manifest.]\n[If one does not boast, one’s merit endures.]\n[If one does not pride oneself, one’s virtue grows.]\nThis is how it is discussed in relation to the Dao.\nLike the excess of a lavish feast or the overreaching of conduct,\nthough the root may be fine, it becomes foul.\nOne who has merit yet boasts of it\nthus becomes a growth or excrescence.\n\n**Chapter 25**\nIndistinct and ungraspable,\nyet the ten thousand things are completed through it—\nthus it is called \"the Primal Completion.\"\nNot knowing whose child it is,\nit precedes the birth of heaven and earth.\nSilent and formless,\nwithout peer—\nthus it is called \"independent.\"\nReturning and cycling through beginning and end,\nit does not lose its constancy—\nthus it is called \"the Unchanging.\"\nCircling without end, reaching everywhere without peril,\nit gives birth to the great and complete form—\nthus it may be called the Mother of all under heaven.\nNames fix forms,\nbut the Primal Completion is formless and cannot be fixed—\nthus it is said, \"We do not know its name.\"\nNames fix forms; words designate what can be designated.\nThe Dao is taken from the formless and does not proceed from things.\nWithin the Primal Completion,\nthe greatest designation that can be spoken—\nthus I style it \"Dao,\"\ntaking the greatest designation that can be spoken.\nIf we demand the source of its designation,\nthen it is bound to the great.\nWhere there is binding, there must be division;\nwhere there is division, it loses its ultimate limit.\nThus it is said, \"By force we name it 'great.'\"\nIt moves and flows—\nnot confined to a single great body but circling without end—\nthus it is called \"the Flowing.\"\nIt reaches the farthest limit—\ncircling without bound, not partial to one path—\nthus it is called \"the Far.\"\nNot following where it goes,\nits body stands alone—\nthus it is called \"the Return.\"\nAmong the natures of heaven and earth, humans are most noble,\nand the king is the lord of humans.\nThough he does not hold the greatest office, he is still great,\nfor he matches the three—thus it is said, \"The king, too, is great.\"\nThe four great ones are the Dao, heaven, earth, and the king.\nAll things that have designation and name\nare said to have their limit.\nThe Dao has its source;\nonly with a source can it be called the Dao.\nYet this is the greatest among designations—\nnot as great as the greatness without designation.\nThe undesignated cannot be named—\nthus it is called \"the Realm.\"\nThe Dao, heaven, earth, and the king all lie within\nthe Realm of the undesignated—\nthus it is said, \"Within the realm are four great ones.\"\nThe king holds the greatness of the lord of humans.\nTo model is to take as a standard.\nHumans do not transgress earth—\nthus they preserve their wholeness and peace; they model earth.\nEarth does not transgress heaven—\nthus it preserves its full capacity to bear; it models heaven.\nHeaven does not transgress the Dao—\nthus it preserves its full capacity to cover; it models the Dao.\nThe Dao does not transgress the natural—\nthus it preserves its nature; it models the natural.\nTo model the natural is to follow the square when square,\nthe round when round,\nwithout transgressing the natural.\nThe natural is the word for the undesignated, the term for the ultimate limit.\nWisdom does not surpass non-knowing;\nform and spirit do not surpass subtle essence;\nsubtle essence does not surpass the formless;\nhaving form does not surpass formlessness.\nThus they model one another in turn.\nThe Dao models the natural—\nthus heaven relies on it.\nHeaven models the Dao—\nthus earth follows it.\nEarth models heaven—\nthus humans emulate it.\nThe king, as lord,\nunifies them in oneness.\n\n**Chapter 26**\n\n**Chapter 27**\n\nLight things cannot bear heavy burdens;\nsmall things cannot restrain great ones.\nTo make the unmovable move,\nto govern the restless with stillness—\nthus the heavy must serve as the root of the light,\nand stillness as the ruler of restlessness.\nBy taking heaviness as the foundation, one does not stray;\nit is not a matter of constant mindfulness.\nThe light cannot restrain the heavy—\nto lose the root is to forfeit one’s self;\nto lose the ruler is to lose one’s position.\n\n**Chapter 28**\n\nProceed in accordance with the natural,\nwithout contriving or imposing.\nThus things reach their fulfillment,\nyet leave no tracks.\nFollow the nature of things,\nwithout distinguishing or dissecting—\nthus no flaw or blame can find its way in.\nRely on the inherent patterns of things,\nwithout imposing form.\nAccord with the natural,\nwithout setting or imposing—\nthus, though no bolts or ropes are used,\nit cannot be untied.\nThese five all speak of not contriving or imposing,\nof following the nature of things\nwithout using form to control them.\n\nThe sage does not establish forms or names to restrain things,\nnor does he create advancement or rejection\nto separate the worthy from the unworthy.\nHe assists the self-so of the myriad things\nwithout taking the lead.\nThus it is said: \"No one is abandoned.\"\nIf worth and ability are not exalted,\nthe people do not contend.\nIf rare and precious goods are not valued,\nthe people do not steal.\nIf what can be desired is not displayed,\nthe people’s hearts are not disturbed.\nAlways keep the people’s hearts free of desire and confusion—\nthus no one is abandoned.\n\nElevate the good to bring the ungood into alignment—\nthus it is called \"teacher.\"\n*Resource and acquisition.*\nThe good person uses goodness to align the ungood,\nnot to abandon the ungood with goodness.\nThus the ungood are what the good acquire.\nThough one may possess wisdom,\nif one relies solely on one’s own wisdom\nand does not follow the Way of things,\none is bound to fail.\nThus it is said: \"Though wise, one is greatly deluded.\"\n\n**Chapter 29**\n\nThe male leads, the female follows—\nthose who take the lead in the world with cleverness\nare bound to fall behind.\nThus the sage places himself last and finds himself first.\nThe valley does not seek things,\nyet things naturally gather to it.\nThe infant does not use wisdom,\nyet embodies the wisdom of the natural.\n*Model and pattern; deviation and error—*\nthese cannot be exhausted.\nThese three speak of the constant return to the end,\nwhereby virtue is perfected in its place.\nThe next chapter says: \"Reversion is the movement of the Dao.\"\nMerit cannot be seized—\none must always abide in the mother.\n*Uncarved simplicity.*\nWhen simplicity scatters, the hundred practices emerge,\nand distinct kinds arise—like vessels.\nThe sage, following their dispersion,\nestablishes officials and leaders,\ntaking the good as teachers\nand the ungood as resources,\ntransforming customs and mores\nto return them to oneness.\n\nGreat governance takes the heart of the world as its heart—\nthus it does not divide.\n\n**Chapter 30**\n\nThe numinous has no form, no direction—\nvessels are what is completed.\nWith no form to complete,\nit is called the \"numinous vessel.\"\nThe myriad things take the natural as their nature—\nthus they can be followed but not made,\ncan be penetrated but not grasped.\nThings have a constant nature,\nyet to contrive and impose upon them\nis bound to fail.\nThings have their comings and goings,\nyet to grasp them\nis bound to lose them.\nAll these instances speak of the reversal and recurrence of things,\nof not imposing, grasping, or dividing.\n\nThe sage comprehends the utmost nature of the natural,\nunfolds the feelings of the myriad things—\nthus he follows without contriving,\naccords without imposing.\nHe removes what causes delusion,\ndispels what causes confusion—\nthus the heart is not disturbed,\nand the nature of things attains itself.\n\n**Chapter 31**\n\nTo assist a ruler with the Dao,\none must not rely on arms to overpower the world—\nhow much less so for a ruler who embodies the Dao?\nThose who govern by initiating affairs\nare ever eager to establish merit and create matters,\nwhile those who abide in the Dao\nare ever eager to return to non-action.\nThus it is said: \"Its affairs tend to return.\"\n\nTo speak of armies is to speak of instruments of misfortune—\nthey bring no benefit,\nand must bring harm.\nThey ravage the people,\nlay waste to fields and villages—\nthus it is said: \"Thorns and brambles grow there.\"\n\n*Fruit* means *to achieve.*\nTo speak of the skillful use of armies\nis to say they are employed to resolve difficulties—\nnot to use military force to overpower the world.\nI do not exalt the way of armies;\nwhen compelled to use them, what boasting is there?\nTo speak of using armies though compelled by circumstances—\nthough one may achieve success in resolving difficulties,\none must not proceed to use force to assert strength.\n\nTo be robust in martial power, to rise in violence—\nthis is to compare armies to overpowering the world.\nFierce winds do not last the morning;\ntorrential rains do not last the day.\nThus violent uprisings are not of the Dao—\nthey end early.\n\n**Chapter 32**\n\nThe Dao is formless, yet not without form.\nIt is eternally unnameable—\nits constancy lies in being nameless.\nThus it is said: \"The Dao is eternally nameless.\"\n\nSimplicity as a thing\ntakes non-action as its heart—\nit too is nameless.\nTherefore, to attain the Dao,\nnothing compares to preserving simplicity.\n\nThe wise can be employed as ministers,\nthe brave can be tasked with martial affairs,\nthe skilled can be assigned to labor,\nthe strong can bear heavy burdens—\nbut simplicity as a thing,\nvague and impartial,\napproaches nothingness.\nThus it is said: \"None can make it a subject.\"\n\nEmbracing simplicity and non-action,\nnot allowing things to burden one’s authenticity,\nnot letting desires harm one’s spirit—\nthen things naturally submit,\nand the Dao is naturally attained.\n\nIt is said: when Heaven and Earth unite,\nsweet dew descends without being sought.\nIf I preserve my true nature through non-action,\nthe people, without command, naturally harmonize.\n\n\"Initial ordering\" refers to the time when simplicity scatters\nand officials and leaders first emerge.\nAt the beginning of ordering officials and leaders,\none cannot but establish names and ranks to fix hierarchy—\nthus at the start of ordering, there are names.\n\nBeyond this point,\nthere will be contention over the smallest things.\nThus it is said: \"Once names exist, one must also know when to stop.\"\n\nTo rely on names to label things\nis to lose the mother of governance.\nTherefore, knowing when to stop prevents the beginning of disorder.\n\nRivers and valleys flow to the Yangtze and the sea—\nnot because the Yangtze and sea summon them,\nbut because they return of themselves without being summoned or sought.\nOne who practices the Dao in the world\nharmonizes without command,\nattains without seeking—\nthus it is said: \"Like rivers and valleys flowing to the Yangtze and sea.\"\n\n**Chapter 33**\n\n**Chapter 34**\n\nTo know others is merely wisdom,\nyet it does not surpass self-knowledge—\nself-knowledge transcends wisdom.\nTo overcome others is merely strength,\nyet it does not surpass self-mastery—\nnothing can diminish one’s strength when self-mastered.\n\nTo apply wisdom to others\nis not as good as applying it to oneself.\nTo apply strength to others\nis not as good as applying it to oneself.\nWhen clarity is turned inward, nothing eludes it;\nwhen strength is turned inward, all things transform.\n\nOne who knows contentment never loses and thus abounds in wealth.\nDiligence in practice ensures the fulfillment of aspiration.\nThus it is said: \"The resolute have purpose.\"\nBy examining oneself with clarity and acting within one’s capacity,\none never loses the proper path—\nassured of enduring longevity.\n\nThough the body perishes, it is as if alive,\nfor the Dao does not vanish, and one’s life remains whole.\nThough the body fades, the Dao endures—\nhow much more when the body persists and the Dao does not cease?\n\n**Chapter 35**\nThe Dao overflows without limit, adapting to all.\nPassing left and right, above and below, circling in use,\nit reaches everywhere.\nAll things arise from the Dao,\nyet once born, they know not their origin.\nThus, when the world is free of desire,\nall things find their place.\n\nIf the Dao did not act upon things,\nit would be called small.\nYet all things return to it for life,\nand though it compels none, none know its source—\nthis is not small.\nThus it may also be called great.\n\nTo achieve greatness in the minute,\nto plan difficulty in ease.\n\n**Chapter 36**\nThe great image is the mother of celestial patterns.\nNeither scorching nor cold,\nneither warm nor cool,\nit embraces and unites the ten thousand things,\nharming none.\nIf the ruler holds to it,\nthe world will follow.\n\nFormless and unknowable,\nimpartial and unmanifest,\nall things come to it without obstruction.\nThe depth and vastness of the Dao—\nwhen people hear its words,\nthey find them less appealing than learning or sustenance.\nFood and music may halt a passing traveler,\nbut the Dao’s words are plain and flavorless,\nseen yet not striking to the eye,\nheard yet not pleasing to the ear.\nYet when applied, they are inexhaustible.\n\n**Chapter 37**\nTo eliminate tyranny and quell chaos, employ these four principles:\nfollow the nature of things and let them destroy themselves,\nwithout resorting to punishment as the greatest means.\nThus it is called \"subtle clarity.\"\n\nTo stretch something to its limit and then demand more\ninvites collapse.\nBetter to abandon the demand for excess\nthan to persist and court danger.\n\nSharp instruments are tools of the state.\nWhen one relies on the nature of things\nwithout imposing punishments to govern,\nthe tools remain unseen,\nyet all things find their place—\nthis is the state’s true instrument.\n\nTo display them is to rely on punishment.\nPunishment that serves the state is already lost.\nA fish torn from the depths is surely doomed;\nso too is the state’s instrument lost when punishment is flaunted.\n\n**Chapter 38**\nTo follow nature:\nthe ten thousand things are governed and perfected by non-action.\nWhen transformation stirs and desire arises,\nI will pacify it with nameless simplicity,\nnot acting as master,\nfree from competitive desire.\n\n**Chapter 39**\nVirtue (德) means attainment (得).\nConstant attainment without loss,\nbenefit without harm—\nthus it is called *virtue*.\nHow is virtue attained?\nThrough the Dao.\nHow is virtue fully realized?\nBy employing non-action.\nWith non-action, nothing is not upheld.\nThus, where nothing is imposed, no thing is ungoverned;\nwhere something is imposed, life cannot be preserved.\n\nTherefore, though heaven and earth are vast, their heart is non-action.\nThough the sage-king is great, his foundation is emptiness.\nThus it is said: \"In returning to the root, the heart of heaven and earth is seen;\nin contemplating the solstice, the ultimate of the former kings is beheld.\"\n\nEradicate the private and abandon the self,\nand the four seas will gaze upon you,\nnear and far will come without fail.\nBut if one clings to the self and holds to the heart,\neven a single body cannot remain whole,\nflesh and bone cannot coexist.\n\nThus the person of highest virtue\nuses only the Dao,\nnot claiming virtue as their own.\nWithout grasping or imposing,\nthey possess virtue yet engage in all things,\nattaining without seeking,\naccomplishing without striving.\nThus, though virtuous, they bear no name of virtue.\n\nLesser virtue seeks and attains,\nstrives and accomplishes,\nestablishing goodness to govern things—\nthus the name of virtue arises.\nYet seeking and attaining must entail loss;\nstriving and accomplishing must entail failure.\nWhere the name of goodness arises,\nthe response of un-goodness follows.\nThus lesser virtue acts and has something to show for it.\n\nNon-action means no partiality.\nAll who cannot practice non-action but act\nare of lesser virtue—\nbenevolence, righteousness, propriety, and ritual are such.\n\nTo clarify the hierarchy of virtue:\nthe highest is contrasted with the lowest.\nThe lowest extreme of lesser virtue is *humaneness* (仁).\nEven when one reaches non-action, they still act—\nacting without imposing,\nthus the peril of action arises.\n\nThe root lies in non-action; the mother in namelessness.\nAbandoning the root and forsaking the mother\nto pursue their offspring,\nthough achievements may be great, they will not endure;\nthough names may be fine, falsity will surely arise.\n\nWhen governance cannot be achieved without action,\nwhen order cannot arise without effort,\nthen one acts.\nThus, those who broadly bestow benevolence and love\ndo so without partiality—\nthis is *highest humaneness*, acting without imposing.\n\nWhen love cannot be universal,\nthere arises restraint, uprightness, and righteousness—\nresenting wrong and aiding right,\nsupporting one to attack another,\nacting with the heart as arbiter.\nThus *highest righteousness* acts and has something to show for it.\n\nWhen uprightness cannot be steadfast,\nthere arises adornment, refinement, ritual, and reverence—\nvaluing refinement and respect,\ndemanding reciprocity,\ngiving rise to resentment in discord.\nThus *highest propriety* acts and has something to show for it.\n\nThus *highest propriety* acts, yet none respond—\nthen one rolls up their sleeves and drags them forth.\nYet how vast is that which reaches the ultimate?\nIs it not the Dao alone?\nBeyond this, what could be worthy of reverence?\n\nTherefore, though virtue be abundant and achievements great,\nthough one possess the myriad things,\neach still attains its own power—\nyet none can fully encompass themselves.\nThus, heaven cannot bear the weight alone,\nearth cannot cover all alone,\nhumankind cannot sustain the ten thousand things alone.\nThough noble, they rely on non-action for their function,\nyet cannot abandon non-being as their essence.\nTo abandon non-being as their essence\nis to lose their greatness.\nThis is what is called \"losing the Dao and following virtue.\"\n\nWhen non-action is employed,\none attains the Mother of all things,\nand thus, without toil, nothing remains ungoverned.\nBelow this, one loses the Mother of function,\nunable to value non-action and instead prizing broad bestowal,\nunable to value broad bestowal and instead prizing uprightness,\nunable to value uprightness and instead prizing adorned reverence.\nThis is what is called \"losing virtue and following humaneness,\nlosing humaneness and following righteousness,\nlosing righteousness and following propriety.\"\n\nNow, propriety\nbegins where loyalty and trust are not steadfast,\nwhere simplicity is not manifest,\nwhere demands are made of outward appearances,\nwhere subtle mechanisms vie for control.\nIf humaneness and righteousness, arising from within,\nare still deemed artificial when enacted,\nhow can the pursuit of external adornment endure?\nThus, propriety is the thinning of the loyal heart\nand the beginning of disorder.\n\nThose of *foreknowledge* are those who recognize before others—\nthey belong to the rank of lesser virtue.\nExhausting their keen perception to attain foreknowledge,\nemploying their wisdom and strength to manage affairs,\nthough they grasp the truth, deceit and cunning grow ever denser;\nthough their reputation swells, sincerity and substance wane.\nToil brings only obscurity,\neffort yields only filth.\nThough they exhaust sagely wisdom, the people suffer greater harm.\n\nThose who relinquish self and task others\nabide in non-action and ease.\nThose who uphold their plain simplicity\ndo not conform to established norms.\nIndulging in what they gain,\nabandoning what they hold—\nthus, *foreknowledge* is the flower of the Dao\nand the beginning of folly.\n\nTherefore, if one attains the Mother of all achievement,\nthe ten thousand things arise\nand make no refusal.\nThe ten thousand things abide therein.\n\nYet they toil not.\nTheir use leaves no trace of form,\ntheir governance no mark of name.\nThus, benevolence and righteousness may be made manifest,\nritual propriety and reverence may be made illustrious.\n\nWhen borne by the great Dao\nand anchored in namelessness,\nthings hold nothing in esteem,\nthe will seeks nothing to pursue.\nEach follows its true nature,\nemploys its sincerity—\nthen virtue and power grow profound,\nconduct in righteousness stands upright,\nritual propriety and reverence remain pure.\n\nIf one discards what bears them\nand abandons what sets them right,\nusing instead their completed forms\nand employing their keen perception,\nthen benevolence becomes a matter of esteem,\nrighteousness a contest,\nritual propriety a strife.\nThus, the profundity of virtue and power\nis not what the use of benevolence can achieve;\nthe uprightness of righteous conduct\nis not what the use of righteousness can accomplish;\nthe purity of ritual propriety and reverence\nis not what the use of ritual can attain.\n\nWhen borne by the Dao\nand unified by the Mother,\nthey are made manifest yet nothing is esteemed,\nmade illustrious yet nothing is contested.\nThrough the use of namelessness, names become sincere;\nthrough the use of formlessness, forms are perfected.\nGuard the Mother to preserve her children,\nhonor the root to raise the branches—\nthen form and name both exist, yet perversity does not arise.\nGreat beauty matches Heaven, yet ornamentation does not arise.\n\nThus, the Mother must not be distanced,\nthe root must not be lost.\nBenevolence and righteousness are born of the Mother,\nyet cannot serve as the Mother.\nForms and vessels are crafted by the artisan,\nyet cannot serve as the artisan.\n\nAbandoning the Mother to use her children,\ndiscarding the root to pursue the branches—\nnames then have their divisions,\nforms have their limits.\nThough one may extend them to the utmost,\nthere must be incompleteness;\nthough one may exalt their beauty,\nthere must be affliction and sorrow.\nSuccess lies in action—\nhow can it be a place of rest?\n\nIn the beginning of old,\nthe inception of the One was the culmination of all things.\nEach thing arises as this One,\nby which it is mastered.\nAll things attain this One to achieve completion;\nonce complete, they abandon it to dwell in completion.\nDwelling in completion, they lose their Mother—\nthus all split, wither, exhaust, perish, and collapse.\n\nEach employs its One to attain this clarity, tranquility, numinous fullness, vital flourishing, and integrity.\nIt is by the One that clarity is attained—\nnot by clarity that clarity is made clear.\nGuard the One, and clarity is not lost;\nemploy clarity, and one risks fragmentation.\nThus the Mother of all achievements must not be abandoned.\nFor this reason, none dare use their achievements,\nfearing the loss of their root.\n\nClarity cannot make itself clear,\nfullness cannot make itself full.\nThus clarity is not to be prized,\nnor is fullness to be esteemed.\nValue lies in their Mother,\nyet the Mother has no valued form.\nValue takes the lowly as its root,\nthe high takes the low as its foundation.\nTherefore, though one may amass carriages, they come to naught.\n\nJade and stone, piled high in heaps—\ntheir substance is exhausted in form,\nand so they are not desired.\n\nThe high takes the low as its foundation,\nthe valued takes the humble as its root.\nBeing arises from non-being as its function—\nsuch is their reversal.\nIn movement, when all know what they lack, things flow freely.\nThus it is said: Reversal is the movement of the Dao.\n\nSoftness and weakness share the same flow,\nboundless and inexhaustible.\nAll things under heaven arise from being,\nyet being itself begins from non-being as its root.\nTo preserve being in its wholeness,\none must return to non-being.\n\nThose of resolve act as if establishing,\nyet shine without dazzling.\nThey place themselves last and thus come first,\nset themselves aside and thus endure.\nThis is the flaw within—\nthe Dao of great harmony,\nwhich follows the nature of things,\nnot imposing levelness to carve them.\nIts evenness remains unseen,\never reverting to the flaw within.\n\nNot prizing their own power,\nthey harbor nothing.\nKnowing the bright, they guard the dark,\nthus attaining great spontaneity.\nVast virtue does not overflow,\nboundless and formless,\nit cannot be filled.\n\nTo align is to match.\nThose who establish virtue\nfollow the spontaneity of things,\nneither asserting nor imposing—\nthus they resemble their counterparts.\nThe truly authentic do not flaunt their authenticity,\nhence they merge.\nSquare without cutting,\nthey have no corners.\n\nGreat vessels take shape without being grasped,\nhence they must be slowly completed.\nSounds that cannot be heard are called \"subtle\"—\nthe great tone is the sound beyond hearing.\nWhere there is sound, there is division;\nwith division, tones lose their unity.\nDivision cannot unify the many,\nso what has sound is not great.\nWhere there is form, there is division;\nwith division, warmth and coolness alternate.\nThus what has image and form is not the great image.\n\nAll these excellences arise from the Dao.\nIn image, it is the great image—yet the great image has no form.\nIn sound, it is the great tone—yet the great tone has no sound.\nThrough it, things are completed,\nyet its completion remains unseen.\nThus it is hidden and nameless.\n\nBestowing is not merely supplying what is lacking—\na single bestowal suffices to perpetuate its power.\nThus it is called \"excellent in bestowing.\"\nTo complete is not like a carpenter’s craft,\nwhich shapes every thing without fail.\nThus it is called \"excellent in completing.\"\n\nThe myriad things and forms return to the One.\nHow is the One attained?\nThrough non-being.\nFrom non-being comes the One,\nand the One may be called non-being.\nOnce called the One,\nhow can it be without speech?\nSpeech implies duality—\nhow could it not be two?\nFrom the One comes two,\nand from two comes three.\nFrom non-being to being,\nnumbers end here.\nBeyond this lies not the Dao’s current.\n\nThus the arising of the myriad things—\nI know their master.\nThough they take myriad forms,\ntheir qi converges in the One.\nThe hundred clans have their hearts,\nforeign lands their customs,\nyet kings and lords who attain the One rule over them.\nTaking the One as their master,\nhow can the One be abandoned?\nThe more one multiplies, the farther one strays;\nreduction brings one closer.\nReduce to the utmost,\nand one reaches the limit.\nThough called the One, it extends to three—\nhow much less can the Dao be near when its root is not One?\n\nReduction leads to increase,\nincrease leads to reduction—\nis this empty talk?\nMy teaching does not force others to follow,\nbut employs spontaneity.\nPresenting its ultimate principle,\nfollowing it brings fortune,\ndefying it brings misfortune.\nThus when people instruct one another,\ndefiance invites their own misfortune—\njust as my teaching warns against defiance.\n\n**Chapter 43**\nQi penetrates all without exception. Water flows through all channels without exception. Emptiness and softness pervade all without obstruction. Nothing remains impenetrable. The softest cannot be broken. From this we infer the benefits of non-action.\n\n**Chapter 44**\nThose who exalt fame and pursue loftiness distance themselves from their own bodies. Those insatiable in wealth and goods diminish themselves. Gaining much profit yet losing one’s life—what is the affliction here? Excessive attachment severs communion with things. Hoarding without distribution invites many seekers and many attackers. Becoming a target for things brings great loss and heavy ruin.\n\n**Chapter 45**\nFollowing things to completion, it does not fix upon a single form—thus it seems incomplete. Perfect fullness adapts to things and gives freely, without attachment or pride—thus it seems empty. Adapting to things in their straightness, straightness is not confined to one—thus it seems bent. Great skill follows nature to create vessels, not contriving strange novelties—thus it seems clumsy. Great eloquence speaks in accord with things, without personal fabrication—thus it seems inarticulate. Restlessness and exhaustion overcome cold; stillness and non-action overcome heat. From this we infer that clarity and stillness are the norm for the world. Stillness preserves the true nature of things; restlessness violates their essence. Thus only through clarity and stillness can one attain all the great qualities above.\n\n**Chapter 46**\nWhen the world follows the Dao, one knows contentment and knows when to stop, seeking nothing from without, each cultivating only their inner self. Thus warhorses are retired to fertilize the fields. When greed and desire are insatiable, the inner self is neglected, and each seeks from without—thus warhorses are bred on the outskirts.\n\n**Chapter 47**\nAffairs have their origins, and things have their masters. Though paths differ, their return is the same. Though thoughts are many, their essence is one. The Dao has its great constancy; principles have their great convergence. Holding to the ancient Dao, one can govern the present. Though dwelling in the present, one can know the beginnings of antiquity. Thus, without looking out the door or peering through the window, one can know all. To seek the One in the many is futile. The Dao cannot be seen, cannot be heard, cannot be grasped. If one knows it, there is no need to step outside. If one does not know it, the farther one goes, the more lost one becomes. Grasping the essence of things, though one does not travel, one’s thoughts can know all. Recognizing the origin of things, though one does not see, the principles of right and wrong can be named. Understanding the nature of things and following it, though one does not act, one brings things to completion.\n\n**Chapter 48**\nThose who strive to advance their abilities and augment their habits strive instead to return to emptiness and nothingness. Action entails loss; thus non-action entails nothing that is not done. Movement is always contingent, self-initiated, and loses the unifying root.\n\n**Chapter 49**\nMovement is always contingent. Each adapts to its use, and goodness is not lost. Do not discard others; each employs their intelligence, all harmonized and desireless like infants. Heaven and earth establish positions, the sage perfects abilities. The people confer abilities upon the capable; the capable provide resources to those who take them. Great ability brings great resources; noble ability brings noble resources. Things have their origins, affairs have their masters. Thus one may wear the imperial crown and fill one’s eyes without fear of deception, stuff one’s ears with silk floss without concern for negligence. Why labor one’s own intelligence to scrutinize the sentiments of the people? When one uses clarity to examine things, things in turn compete to evade that clarity. When one seeks things with distrust, things in turn compete to respond with distrust. The hearts of the world need not be the same; their responses dare not differ. Then none will employ their true feelings. How grave the harm!\n\nNo harm surpasses employing one's own clarity. When one relies on cunning, others litigate; when one relies on force, others contend. If cunning does not arise from others yet is established on contentious ground, it will be exhausted. If force does not arise from others yet is established on disputed ground, it will be imperiled. Never has there been one who could prevent others from employing their cunning or force against oneself. In this way, one pits oneself alone against others, while others pit their thousands and tens of thousands against oneself.\n\nIf one multiplies legal nets, complicates punishments, blocks pathways, and assaults hidden dwellings, then the myriad things lose their spontaneity, and the people are bereft of their hands and feet. Birds are thrown into chaos above, fish into chaos below. Thus the sage, in governing the world, remains reverently still, with no fixed intent in mind. In treating the world, the sage maintains a unified heart, with no particular inclination. With nothing to scrutinize, what can the people evade? With nothing to seek, how can the people respond? Without evasion or response, none will fail to employ their true feelings.\n\nPeople do not abandon what they can do to do what they cannot, nor forsake their strengths to pursue their weaknesses. In this way, speakers speak of what they know, and actors act on what they can do. The people all direct their ears and eyes accordingly. I simply treat them all as children.\n\nChapter 50: Emerging into the realm of life, entering the realm of death. Of ten, three are said to follow the Way of life to its fullest, and three of ten follow the Way of death to its extreme. Yet the people, in their excessive pursuit of life, shift into the realm of no-life. Those who fully preserve life do not treat life as something to be clung to, and thus know no realm of death.\n\nNothing is more harmful than weapons, no beast more perilous than the rhinoceros and tiger. Yet when weapons find no place to lodge their blades, when tigers and rhinos have no ground to set their claws and horns, this is truly not allowing desire to burden the body. How then could there be a realm of death?\n\nThe viper and the eel deem the abyss too shallow and bore their dens within it. The hawk and the kestrel consider the mountain too low and build their nests upon its heights. Arrows and snares cannot reach them, nets and traps cannot ensnare them—one might say they dwell in a realm without death. Yet in the end, drawn by sweet bait, they enter the realm of no-life. Is this not the excess of pursuing life?\n\nThus, if things do not seek to depart from their root, do not allow desire to alter their true nature, then even entering an army they remain unharmed, traveling on land they encounter no danger. The infant’s virtue lies in its simplicity and the value of trust.\n\nChapter 51\n\nThings are born and then nurtured. Nurtured and then formed. Formed and then completed. How do they come to be born by the Dao? How do they come to be nurtured by virtue? By what cause are things formed? By what power are circumstances brought to completion? Only through cause can there be nothing that is not formed. Only through power can there be nothing that is not completed.\n\nAll things by which life arises, all works by which accomplishment is achieved—each has its cause. Where there is cause, there is nothing that does not proceed from the Dao. Thus, tracing it to its ultimate source, one arrives at the Dao.\n\nFollowing their respective causes, things acquire their names. The Dao is that by which things proceed. Virtue is that which things attain. Proceeding from it, they attain—thus it cannot but be honored. To lose it is to invite harm—thus it cannot but be valued.\n\n[Ranking their forms and natures,] it is said to perfect their essence. Each receives its shelter, unharmed in its body.\n\nActing yet not possessing, possessing virtue yet unaware of its source. Emerging from...\n\nThe obscure and hidden—thus it is called the mysterious virtue.\n\n[As the fifty-second chapter states: \"If one begins well, one may well nurture and cultivate it; thus, having a beginning for all under heaven, one may become the mother of all under heaven.\"] The mother is the root; the child is the branch. Attaining the root, one knows the branch; one does not abandon the root to pursue the branch.\n\nDesire arises from the engagement with affairs; the gate is that through which affairs and desires proceed. Without engaging in affairs, one remains perpetually at ease—thus one labors not throughout life. Not closing the source yet accomplishing one’s tasks—thus, though one may labor throughout life, one is never in distress.\n\nThe efficacy of governance does not lie in grandeur. To see the great is not to see clearly; to see the small is to see clearly. To hold fast to strength is not strength; to hold fast to softness is strength.\n\nManifesting the Dao dispels the people’s confusion—this is due to a lack of discernment. Such is the constancy of the Dao.\n\nAs the fifty-third chapter states: If I were to possess even a modicum of knowledge, I would walk the great Dao under heaven, fearing only the imposition of action. The great Dao is vast, upright, and level—yet the people still abandon it and do not follow, preferring to take devious paths. How much more so when one imposes action to obstruct the great Dao?\n\nThus it is said: The great Dao is exceedingly smooth, yet the people prefer byways. The court is adorned with palaces, and the halls are swept clean—this is excessive refinement. When the court is excessively refined, the fields grow wild, and granaries stand empty. To establish one thing is to give rise to a multitude of harms.\n\nAll things, if not obtained through the Dao, are perverse. What is perverse is theft. To boast without obtaining through the Dao is thieving boastfulness; to covet rank without obtaining through the Dao is usurped position. Thus,举非道以明—what is not the Dao is all thieving boastfulness.\n\nAs the fifty-fourth chapter states: Secure the root, then tend to the branches—thus it cannot be uprooted. Not impoverished by excess, aligning with one’s capacity—thus it does not fail. When descendants transmit this Dao, offering sacrifices, it does not cease.\n\nExtending from oneself to others: Cultivating it in the self, it becomes authentic. Cultivating it in the family, there is abundance. Cultivating it without cessation, the scope of its application grows ever greater. All things are thus.\n\nObserving the hearts of the hundred clans is to observe the heart of all under heaven. The Dao of all under heaven—its reversals and sequences, fortune and misfortune—are all like the Dao of humanity. This is what was stated above.\n\nHow do I come to know all under heaven? By examining myself to know it—not seeking it externally. This is what is meant by \"not leaving one’s door yet knowing all under heaven.\"\n\nAs the fifty-fifth chapter states: The infant seeks nothing, desires nothing, and does not offend the myriad things. Thus, creatures that sting and poison do not harm it. One whose virtue is profoundly accumulated does not offend things—thus nothing can diminish its wholeness.\n\nBy virtue of softness and weakness, its grasp is firm and complete. It grows long because nothing diminishes its body—thus it remains whole and enduring. One whose virtue is profoundly accumulated—nothing can diminish its power or alter its authenticity. Soft and weak, not contending, it is not broken. All is thus.\n\nWithout a heart of contention and desire, one may cry out all day without hoarseness. Things take harmony as their constancy—thus, knowing harmony, one attains constancy. Neither bright nor dim, neither warm nor cool—this is constancy. Without form, it cannot be seen—thus it is called illumination.\n\nLife cannot be augmented; to augment it is to cut it short. The heart should be empty of possession, making the qi strong.\n\nAs the fifty-sixth chapter states: Following nature, initiating no affairs, embracing and guarding authenticity, removing the source of contention—nothing is singled out for display, so things do not contend in bias. Nothing is singled out for contempt, so things do not feel shame in bias.\n\nWhat can be approached may also be distanced; what can be benefited may also be harmed; what can be honored may also be debased. Nothing can be added to it.\n\nAs the fifty-seventh chapter states: Governing the state through the Dao, the state is at peace. Governing the state through rectitude gives rise to extraordinary warfare. Through non-action, one may take all under heaven.\n\nThe preceding chapter states: Those who take all under heaven always do so through non-action. When they engage in action, it is insufficient to take all under heaven. Thus, governing through rectitude is insufficient to take all under heaven—it is governing through the extraordinary use of arms.\n\nGoverning through the Dao exalts the root to still the branches. Governing through rectitude establishes laws to attack the branches. When the root is not established and the branches are shallow, the people have nothing to reach for—thus it must come to the extraordinary use of arms.\n\nSharp instruments are all tools by which one benefits oneself. When the people are strong, the state is weak. When the people possess much knowledge and cunning, deceit and falsehood arise. When deceit and falsehood arise, perverse affairs emerge. Establishing rectitude to quell perversity leads to the use of extraordinary arms. Imposing many prohibitions to shame poverty only makes the people poorer.\n\nSeeking to strengthen the state through sharp instruments only makes the state more benighted and weak. All this is abandoning the root to govern the branches.\n\nWhat the ruler desires, the people follow. What I desire is only non-desire—thus the people also become desireless and return to simplicity. These four are exalting the root to still the branches.\n\n**Chapter 58**\n\nHe who excels in governing does so without form, without name, without affairs, without administration—yet in profound obscurity, he ultimately brings about great order. Thus it is said: \"His governance is obscure.\" His people, having nothing to contend over, are magnanimous and pure. Thus it is said: \"His people are simple.\"\n\nWhen penal codes and names are established, rewards and punishments made clear to restrain deceit and falsehood, it is said: \"[His governance] is meticulous.\" Categories are divided and distinctions drawn, and the people harbor contention. Thus it is said: \"His people are deficient.\"\n\nWho knows the ultimate of good governance? Only when nothing can be corrected or enacted, when nothing can be given form or name—when in profound obscurity the world is transformed—does this reach its ultimate.\n\nTo govern the state by rectitude is to soon revert to the extraordinary use of arms. Thus it is said: \"Rectitude reverts to the extraordinary.\" To establish goodness to harmonize the myriad things is to soon encounter the calamity of portents. This speaks of how long people have been deluded and lost the Dao.\n\nOne cannot immediately impose good governance to demand compliance. To guide things by methods is to command them to abandon their perversity, not to carve them with methods. This is what is called \"the great method has no corners.\"\n\n*Lian* means purity; *gui* means to wound. To guide the people with purity is to command them to abandon their filth, not to wound things with purity. To guide things with uprightness is to command them to abandon their depravity, not to provoke them with uprightness. This is what is called \"the great upright seems bent.\"\n\nTo illuminate their delusions with light is not to expose their hidden faults with light. This is what is called \"the luminous Dao seems dim.\" All these are exalting the root to still the branches, restoring things without attack.\n\n**Chapter 59**\n\nTo do nothing is to do no more than is necessary. *Se* means the farmer: the farmer tending his fields removes what is different to return them to uniformity, preserving their natural state. He does not rush to cure their barrenness or disease but removes the causes of barrenness and disease. To receive the Mandate of Heaven above and pacify the hundred clans below, nothing surpasses this.\n\n*Early compliance* means constancy. Only by deeply accumulating virtue does one avoid seeking hasty results. Thus it is said, \"Early compliance is called the accumulation of deep virtue.\" The Dao is inexhaustible. To govern the state with what is finite is not to truly possess the state. What secures a state’s peace is called the *Mother*. Deeply accumulating virtue is to plan for the root; only then does one cultivate the branches and attain their end.\n\n**Chapter 60**\n*Do not disturb.*\n\nAgitation brings much harm; stillness preserves authenticity. Thus, the greater the state, the more still its ruler must be—only then can he broadly win the hearts of the people. Governing a great state is like cooking a small fish. When the Dao presides over the world, its ghosts lose their numinosity. The numinous does not harm the natural; when things guard their natural state, the numinous has no power over them. When the numinous has no power, one does not perceive its numinosity.\n\nWhen the Dao pervades, the numinous does not harm people. When the numinous does not harm people, one does not perceive its numinosity. When the Dao pervades, the sage also does not harm people. When the sage does not harm people, one does not perceive his sagacity. It is as if one does not perceive the numinous as numinous, nor the sage as sage. Relying on nets of power to command things marks the decline of governance. To make people unaware of the numinous or the sage as such—this is the ultimate of the Dao.\n\nThe numinous does not harm people; the sage also does not harm people. When the sage does not harm people, the numinous also does not harm them. Thus it is said, \"The two do not harm each other.\" When the numinous and the sage unite with the Dao, they converge in the same return.\n\nChapter 61\nThe Yangzi and the sea, vast and lowly, become the gathering place of the hundred rivers. A great state, vast and lowly, becomes the gathering place of the world. Thus it is said, \"A great state is the lower reaches,\" the place where the world converges. Still and not seeking, things naturally return to it. By its stillness it can be lowly. The female is still; the male is restless, impoverished by desire. The female, ever still, thus overcomes the male. By its stillness it can again be lowly, and so things return to it. \"A great state being lowly\" means a great state lowering itself to small states, which then attach themselves to it, while the great state embraces them. It speaks only of cultivating humility, and then each attains what it desires. A small state cultivating humility preserves itself, but cannot make the world return to it. A great state cultivating humility makes the world return to it. Thus it is said, \"Each attains what it desires, so the greater should be lowly.\"\n\nChapter 62\n\"Obscure\" means warmth, an expression of finding shelter and shade. It is treasured for its use, preserved for its wholeness. It speaks of the Dao preceding all things, nothing being more precious than this. Though one possesses treasures, jades, and teams of horses, nothing compares to it. Beautiful words can outvalue the price of many goods, thus it is said, \"Beautiful words can be traded.\" When practiced with reverence, it elicits response from a thousand *li* away, thus it is said, \"It can be offered to others.\" The unworthy, when preserving the Dao, avoid banishment. It speaks of practicing the Dao with reverence. This is what the Dao above alludes to. Thus, establishing the Son of Heaven and appointing the Three Dukes, exalting their positions and honoring their persons, is for the sake of the Dao. Nothing is more precious than this. Therefore, though one advances bearing jades and leading teams of horses, it is not equal to sitting and offering this Dao. By seeking, one obtains what is sought; by avoiding, one obtains what is avoided. As there is nothing to which it does not apply, it is the world’s most precious.\n\nChapter 63\nDwelling in non-action, teaching without words, savoring tranquility—this is the ultimate of governance. Small grudges are not worth repaying; great grudges provoke the world’s desire to punish. Aligning with what the world holds in common is virtue. Even with a sage’s talent, it is still difficult to treat the small as easy. How much more so for one without a sage’s talent who would neglect this? Thus it is said, \"It is still difficult.\"\n\nChapter 64\nBecause it is secure and does not forget danger, planning is effortless. Thus it is said, \"easy.\" Though one loses, it does not enter into existence. Because it is subtle and fragile, it is insufficient to accomplish great deeds. Thus it is said, \"easy.\" These four all speak of being cautious to the end. One cannot, because it is not wild, fail to grasp it; nor, because it is subtle, fail to scatter it. Without grasping, existence arises; without scattering, greatness arises. Thus, contemplating the calamity of the end as the disaster of the beginning ensures no failure. It speaks of security before signs appear, of closing off what is subtle and fragile. One should be cautious to the end to eliminate the subtle, cautious of the subtle to eliminate disorder, and govern through action. Grasping forms and names reverses the origin of affairs; crafty evasions multiply. Thus failure and loss arise from not being cautious to the end. Though desires are subtle, contention and strife arise from them; though rare goods are small, poverty and theft arise from them. What one can do without learning is natural; it is a metaphor for the excesses of the learned. Thus, learning what is not learned restores the excesses of others.\n\nChapter 65\n\"Enlightened\" means much knowledge, craftiness, and deceit obscuring one’s simplicity. \"Foolish\" means being without knowledge, preserving the real, and following nature. Much knowledge and crafty deceit make governance difficult. \"Knowledge\" is like \"governance.\" Governing the state with knowledge is what is called \"banditry.\" Thus it is said, \"knowledge.\" The people are difficult to govern because of their much knowledge. One should block the openings and close the gates, causing them to be without knowledge and desire. Yet when one moves the people with clever techniques, their devious minds are already stirred. Then, using crafty methods to guard against the people’s falsity, the people, knowing these methods, follow and evade them. Their thoughts become secret and cunning, and deceit and falsity grow ever more. Thus it is said, \"Governing the state with knowledge is the state’s banditry.\" \"Examining\" means sameness. What is the same in past and present cannot be abandoned. To know the examined model is called \"mysterious virtue.\" Mysterious virtue is deep and far-reaching, returning to the real.\n\nChapter 67\n\"It has long been small\"—it is as if it has long been small. If it resembles [the small], it loses what makes it great. Thus it is said, \"If it resembles [the small], it has long been small.\" Now, with compassion, when deployed, it wins; when guarded, it is firm. Frugality and thrift cherish resources, so the world does not lack, and thus it can be vast. Only by putting oneself last and outside does one become the return of things, and only then can one establish vessels and benefit the world, becoming the leader of things. Moreover, it is like taking. They pity each other and do not avoid difficulty, thus they win.\n\nChapter 68\nThe leader of soldiers values not being first to overrun others. Being last and not first, responding and not initiating, thus not acting in anger, not contending. Using others without being lowly toward them means their strength will not be employed.\n\nChapter 69\nAdvancing relentlessly, \"marching\" means deploying formations. It speaks of being humble, compassionate, and not daring to be first. In war, it is like marching without marching, repelling without arms, wielding without weapons, and throwing without an enemy. It speaks of having no one to oppose it. It speaks of my compassion and humility, not desiring to take strength or be without enemy in the world. Unavoidably, it ends in being without enemy—this is precisely my great calamity. The three treasures are treasured. Thus it is said, \"I nearly lost my treasures.\" \"Resisting\" means encountering. The compassionate must cherish each other and not pursue profit or avoid harm, thus they must win.\n\nChapter 70\nOne can know without looking out the door or window. Thus it is said, \"very easy to know.\" It is accomplished without action. Thus it is said, \"very easy to practice.\" Deluded by restlessness and desire, thus it is said, \"none can know it.\" Enlightened by glory and profit, thus it is said, \"none can practice it.\" It is the ancestor of the myriad things, the lord of the myriad affairs. Because its words have an ancestor and its affairs have a lord, thus those who know it cannot but know it. Only because it is profound do those who know it become rare. Those who know me become rarer still; I too have no match. Thus it is said, \"Those who know me are rare, thus I am precious.\" Wearing coarse cloth blends with the dust; holding jade treasures its reality. The reason the sage is difficult to know is blending with the dust without distinction and holding jade without change.\n\nChapter 71\nThus, being difficult to know makes it precious. Not knowing that knowledge is insufficient to be entrusted is a flaw.\n\nChapter 72\nAbiding in clarity and quiescence, non-action—this is called dwelling. Humbling oneself and never overreaching—this is called living. Abandoning clarity and quiescence, acting on restlessness and desire, forsaking humility, wielding power and authority—then things are disturbed and the people grow perverse. Authority can no longer restrain the people; the people cannot endure such authority. Then above and below collapse utterly. Heaven’s punishment will arrive. Thus it is said, “When the people do not fear authority, great authority arrives.” Do not encroach upon their dwelling, do not oppress their living. This means power must not be wielded. Not oppressing oneself—because one does not oppress oneself, none in the world can oppress him. Not displaying what one knows to flaunt brilliance and wield power—self-importance leads others to encroach upon his dwelling and oppress his living.\n\nChapter 73\nNecessarily one will not die a natural death. Necessarily one will meet a uniform fate. Both are brave, yet what they apply it to differs; benefit and harm are not the same. Thus it is said, “Confused by benefit, confused by harm.” Who is it? This means, who can know the intent of Heaven (what all under Heaven detest)? Only the sage. Yet even the sage’s clarity finds bravery difficult—how much more so for one without the sage’s clarity who wishes to act on it. Thus it is said, “It is still difficult.” Only by not contending does none in the world contend with him. Following brings fortune, opposing brings misfortune. Though silent, he responds with goodness. Abiding below, things naturally return to him. Manifesting images, he reveals fortune and misfortune. Before matters arise, he establishes sincerity. At peace, he does not forget danger. Before signs appear, he plans for them. Thus it is said, “Spontaneously, he plans well.”\n\nChapter 74\nDeviant and strange, disrupting the multitude—this is called the uncanny. Those who act against the proper order are detested and resented. The unbenevolent are what people abhor. Thus it is said, “There is always an official executioner.”\n\nChapter 76\nThose who deploy strong armies with violence in the world are what all things detest. Thus they necessarily cannot prevail. What is applied to them—this is the root of the tree; branches and twigs are that.\n\nChapter 77\nHarmonizing virtue with Heaven and Earth, one can embrace it like the Dao of Heaven. Like human capacity, each has its own body and cannot be made equal. Only by having no self and no selfishness can one naturally harmonize virtue with Heaven and Earth. This means, who can be full yet act empty, reduce the excessive to supplement the deficient, blend radiance and merge with the dust, level and equalize? Only one who possesses the Dao. Thus the sage does not wish to display his worth in order to equalize all under Heaven.\n\nChapter 78\nIn application—this refers to water. It means that in using water’s softness and weakness, nothing can replace it.\n\n**Chapter 79**\nNot understanding the covenant’s principle, one invites great resentment to arise. Though virtue may later harmonize it, the wound cannot be undone. Thus there must remain residual grievance. The left tally prevents the origin of resentment. One of virtue contemplates the covenant, ensuring no grievance arises before holding others accountable. This is to thoroughly examine others’ transgressions.\n\n**Chapter 80**\nThough the state be small and its people few, it may yet return to antiquity—how much more so for a large state with many people? Thus I speak of a small state: though the people possess tools of ten or a hundred, they have no use for them. What worry is there of insufficiency? Let the people not employ them, valuing only their own bodies and treasuring no goods or bribes. Thus each dwells securely in their place, prizing life and not migrating far. They have no desires to seek.\n\n**Chapter 81**\nTruth lies in substance, the root in simplicity, the utmost in oneness. Without self yet possessing, only goodness is bestowed, letting things be as they are. What things honor, what they return to—movement constantly generates and completes them. Following Heaven’s benefit, they do not harm one another.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "王弼老子注 １章 可道之道．可名之名．指事造形．非其常也 ．故不可道．不可名也 ．凡有皆始于无．故未形无名时．则为万物之始．及其有形有名时．则长之育之亭之毒之．为其母也 ．言道以无形无名始成万物．［万物］以始以成而不知其所以［然］．玄之又玄也 ．妙者微之极也 ．万物始于微而后成．始于无而后生．故常无欲空虚．可以观其始物之妙．徼归终也 ．凡有之为利．必以无为用．欲之所本．适道而后济．故常有欲．可以观其终物之徼也 ．两者始与母也 ．同出者同出于玄也",
      "translated_text": "Wang Bi’s *Commentary on the Laozi*, Chapter 1\n\nThe Dao that can be spoken of is not the constant Dao. The name that can be named is not the constant name. That which designates things and creates forms is not their eternal nature. Thus, it cannot be spoken of, cannot be named.\n\nAll that exists begins in nonexistence. Therefore, before form and name arise, it is the beginning of the myriad things. When it has form and name, it nurtures them, rears them, matures them, and ripens them—acting as their mother.\n\nThe Dao speaks of how the formless and nameless give rise to the myriad things. The myriad things, though begun and completed, do not know why it is so. This is the mystery within mystery.\n\nThe wondrous is the utmost subtlety. The myriad things begin in subtlety before taking form, begin in nothingness before coming into being. Thus, by constantly abiding in desireless emptiness, one may observe the wondrous beginning of things. The subtlety returns to the end.\n\nAll that exists as benefit must employ nonexistence as its function. The root of desire, when aligned with the Dao, then succeeds. Thus, by constantly abiding in desire, one may observe the completion of things at their end.\n\nThese two—beginning and mother—emerge from the same source. Their emergence is one and the same, issuing from the profound.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 223,
      "start_sentence": 0,
      "end_sentence": 10,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.851910591125488,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "．异名所施不可同也 ．在首则谓之始．在终则谓之母．玄者冥（也 ）默（然）无有也 ．始母之所出也 ．不可得而名．故不可言同名曰玄．而言［同］谓之玄者．取于不可得而谓之然也 ．［不可得而］谓之然．则不可以定乎 一玄而已．［若定乎 一玄］则是名则失之远矣 ．故曰玄之又玄也 ．众妙皆从（同）［玄］而出．故曰众\\妙之门也 ． ２章 美者人心之所进乐也．恶者人心之所恶疾也．美恶犹喜怒也．善不善犹是非也．喜怒同根．是非同门．故不可得而偏举也．此六者皆陈自然．不可偏举之（明）［名］数也．自然已足．为则败也．知慧自备．为则伪也．因物而用．功自彼成．故不居也．使功在己．则功不可久也． ３章 贤犹能也．尚者嘉之名也．贵者隆之称也．唯能是任．尚也曷为．唯用是施．贵之何为．尚贤显名．荣过其任．为而常校能相射．贵货过用．贪者竞趣．穿窬探箧．没命而盗．故可欲不见．则心无所乱也．心怀智而腹怀食．虚有智而实无知也．骨无知以干．志生事以乱（心虚则志弱也）．守其真也．智者谓知为也． ４章 夫执一家之量者．不能全家．执一国之量者．不能成国．穷力举重．不能为用．故人虽知万物治也 ．治而不以二仪之道．则不能赡也 ．地虽形魄．不法于天则不能全其宁．天虽精象．不法于道则不能保其精．冲而用之．用乃不能穷．满以造实．实来则溢．故冲而用之又复不盈．其为无穷亦已极矣 ．形虽大不能累其体．事虽殷不能充其量．万物舍此而求主．主其安在乎 ．不亦渊兮似万物之宗乎 ．锐挫而无损．纷解而不劳．和光而不污其体．同尘而不渝其真．不亦湛兮似或存乎 ．地守其形．德不能过其载．天慊其象．德不能过其覆．天地莫能及之．不亦似帝之先乎 ．帝天帝也 ．",
      "translated_text": "Their designations differ in application and cannot be the same. At the beginning, it is called the \"origin\"; at the end, it is called the \"mother.\" The profound is darkness, silence, and nothingness. From it issue both origin and mother. It cannot be grasped or named, and thus cannot be called by the same name as the profound. Yet to speak of it as \"profound\" is to take what cannot be grasped and call it so. If one could name it as \"one profound,\" then it would be a fixed term, missing the mark by far. Thus it is said: \"the mystery within mystery.\" All wonders emerge from this profound, and so it is called \"the gateway of the myriad wonders.\"\n\n---\n\n2.\nBeauty is what the human heart advances toward and delights in; ugliness is what the human heart detests and abhors. Beauty and ugliness are like joy and anger; good and not-good are like right and wrong. Joy and anger share the same root; right and wrong emerge from the same gate. Thus, they cannot be singly asserted. These six—beauty, ugliness, joy, anger, right, and wrong—all arise from nature and cannot be singly enumerated. Nature is already sufficient; to impose rules is to fail. Wisdom is self-sufficient; to act is to feign. Employing things as they are, merit is accomplished by them, and thus not claimed. If merit is claimed as one’s own, it cannot endure.\n\n---\n\n3.\n\"Worthy\" is akin to \"capable.\" \"Esteem\" is the name for what is commendable; \"noble\" is the term for what is exalted. If only capability is entrusted, why esteem? If only utility is applied, why exalt? To esteem the worthy is to display fame beyond their capacity; acting thus, they constantly compare and vie in ability. To prize wealth beyond its use is to incite the greedy to compete, to break through walls and rifle chests, to risk life in theft. Thus, if what is desirable is not seen, the heart remains undisturbed. The mind harbors wisdom while the belly holds food—outwardly wise yet inwardly devoid of true knowledge. Bones devoid of knowledge contend; the will generates affairs and disturbs the heart (when the heart is empty, the will is weak). Guard one’s authenticity. The wise call knowing \"acting.\"\n\n---\n\n4.\nOne who clings to the measure of a single household cannot preserve the whole household. One who clings to the measure of a single state cannot perfect the state. Exerting all strength to lift a heavy burden cannot make it useful. Thus, though one may know how to govern the myriad things, governing without the Way of the Two Modes cannot suffice. Though Earth possesses form and substance, without modeling itself on Heaven, it cannot preserve its tranquility. Though Heaven possesses essence and image, without modeling itself on the Dao, it cannot preserve its essence. Employing it through emptiness, its use is inexhaustible. Filling it to create solidity, solidity brings overflow. Thus, employing it through emptiness, it is never full. Its inexhaustibility is absolute.\n\nThough form may be vast, it cannot burden its body. Though affairs may be numerous, they cannot fill its measure. If the myriad things abandon this to seek a master, where can that master be found? Is it not deep and abiding, like the ancestor of the myriad things? Blunted yet undiminished, entangled yet untroubled, harmonizing its light without defiling its body, blending with dust without losing its truth—is it not serene and seemingly present? Earth guards its form, yet virtue cannot exceed its bearing. Heaven fulfills its image, yet virtue cannot exceed its covering. Neither Heaven nor Earth can reach it—is it not like what precedes the Emperor? The Emperor is Heaven’s Emperor.",
      "overlap_context": "g into being. Thus, by constantly abiding in desireless emptiness, one may observe the wondrous beginning of things. The subtlety returns to the end.\n\nAll that exists as benefit must employ nonexistence as its function. The root of desire, when aligned with the Dao, then succeeds. Thus, by constantly abiding in desire, one may observe the completion of things at their end.\n\nThese two—beginning and mother—emerge from the same source. Their emergence is one and the same, issuing from the profound.",
      "start_char": 223,
      "end_char": 919,
      "start_sentence": 11,
      "end_sentence": 35,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.869279384613037,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "５章 天地任自然．无为无造．万物自相治理．故不仁也 ．仁者必造立施化．有恩有为．造立施化．则物失其真．有恩有为．则物不具存．物不具存．则不足以备载．（矣 ）［天］地不为兽生刍．而兽食刍．不为人生狗．而人食狗．无为于万物而万物各适其所用．则莫不赡矣 ．若慧由己树．未足任也 ．圣人与天地合其德．以百姓比刍狗也 ．橐排橐也 ．钥乐钥也 ．橐钥之中空洞．无情无为．故虚而不得穷屈．动而不可竭尽也 ．天地之中．荡然任自然．故不可得而穷．犹若 橐钥也 ．愈为之则愈失之矣 ．物树其（恶）［慧］．事错其言．［不慧］不济．不言不理．必穷之数也 ． 橐钥而守数中．则无穷尽．弃己任物．则莫不理．若橐钥有意于为声也 ．则不足以共吹者之求也 ．",
      "translated_text": "Chapter 5\n\nHeaven and Earth act through spontaneity, without deliberate action or creation. The myriad things govern themselves, thus they do not practice \"benevolence.\" For benevolence necessarily involves establishing, enacting, and transforming—bestowing favor and taking action. Where there is establishing, enacting, and transforming, things lose their authenticity. Where there is favor and action, things cannot fully exist. If things cannot fully exist, they are insufficient to fulfill their capacity as vessels.\n\nHeaven and Earth do not grow grass for beasts, yet beasts eat grass. They do not raise dogs for humans, yet humans eat dogs. Acting without deliberate action toward the myriad things, each finds its proper use—thus none are left wanting. If wisdom were planted by oneself, it would not suffice as a foundation.\n\nThe sage harmonizes virtue with Heaven and Earth, regarding the common people as straw dogs. The bellows is the bellows; the flute is the flute. Within the bellows and flute, emptiness reigns—without emotion or deliberate action. Thus, they are hollow and cannot be exhausted, moving yet inexhaustible.\n\nAt the center of Heaven and Earth, all flows through spontaneity—thus it cannot be exhausted, just like the bellows and flute. The more one acts upon it, the more one loses it. When things are rooted in \"wisdom,\" affairs become entangled in words. Without wisdom, there is no success; without words, there is no order—this is the inevitable path to exhaustion.\n\nIf one abides within the principle of the bellows and flute, there is no end. Relinquishing the self to serve things, nothing remains unordered. But if the bellows and flute had intentions to produce sound, they would be insufficient to meet the needs of those who blow them.",
      "overlap_context": " found? Is it not deep and abiding, like the ancestor of the myriad things? Blunted yet undiminished, entangled yet untroubled, harmonizing its light without defiling its body, blending with dust without losing its truth—is it not serene and seemingly present? Earth guards its form, yet virtue cannot exceed its bearing. Heaven fulfills its image, yet virtue cannot exceed its covering. Neither Heaven nor Earth can reach it—is it not like what precedes the Emperor? The Emperor is Heaven’s Emperor.",
      "start_char": 920,
      "end_char": 1225,
      "start_sentence": 36,
      "end_sentence": 50,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.694486379623413,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "６章 谷神谷中央无（谷）［者］也．无形无影．无逆无违．处卑不动．守静不衰．（谷）［物］以此成而不见其形．此至物也．处卑（而）［守静］不可得［而］名．故谓［之玄牝］．（天地之根绵绵若存用之不动）．门玄牝之所由也．本其所由．与［太］极同体．故谓之天地之根也．欲言存邪．则不见其形．欲言亡邪．万物以之生．故绵绵若存也．无物不成（用）而不劳也．故曰用而不勤也． ７章 自生则与物争．不自生则物归也．无私者无为于身也．身先身存．故曰能成其私也． ８章 人恶卑也．道无水有．故曰几也．言（人）［水］皆应于（治）［此］道也． ９章 持谓不失德也．既不失其德．又盈之．势必倾危．故不如其已者．谓乃更不如无德无功者也．既揣末令尖．又锐之令利．势必摧衄．故不可长保也．不若其已．不可长保也．四时更运．功成则移． １０章 载犹处也",
      "translated_text": "**Chapter 6**\nThe spirit of the valley resides in the valley’s center—yet it is no-thing. Without form, without shadow, without resistance, without opposition, it abides in lowliness yet does not move, guards stillness yet does not decay. All things attain completion through it, yet its form is unseen—this is the supreme thing. Dwelling in lowliness and guarding stillness, it cannot be named; thus it is called the **Mysterious Female**. (The root of Heaven and Earth endures ceaselessly as if present, its function unchanging.) The gate is the source from which the Mysterious Female emerges. Tracing its origin, it shares the same body as the **Great Ultimate**; thus it is called the root of Heaven and Earth. If one claims it exists, its form cannot be seen; if one claims it is gone, the myriad things are born through it—thus it endures ceaselessly as if present. Nothing is not brought to completion by it, yet it does not toil; therefore it is said: \"Its function is inexhaustible.\"\n\n**Chapter 7**\nTo be self-generated is to contend with things; not to be self-generated is for things to return to it. One who is selfless acts without concern for the self. The self is thus preserved first—therefore it is said: \"One is able to fulfill one’s private ends.\"\n\n**Chapter 8**\nHumans despise lowliness, but the Dao has no fixed form like water—thus it is said to be \"near.\" This means that water, like all things, responds to the Dao.\n\n**Chapter 9**\n\"Holding\" means not losing one’s virtue. Having not lost virtue, to then fill it further is to invite peril—thus it is better to cease. This means it is even less desirable than one who possesses neither virtue nor merit. Having shaped the tip to a point, to then sharpen it further is to invite breakage—thus it cannot be long preserved. It is better to cease; it cannot be long preserved. The four seasons alternate in succession; when a task is complete, it shifts onward.\n\n**Chapter 10**\n\"Carrying\" is like dwelling.",
      "overlap_context": "ne acts upon it, the more one loses it. When things are rooted in \"wisdom,\" affairs become entangled in words. Without wisdom, there is no success; without words, there is no order—this is the inevitable path to exhaustion.\n\nIf one abides within the principle of the bellows and flute, there is no end. Relinquishing the self to serve things, nothing remains unordered. But if the bellows and flute had intentions to produce sound, they would be insufficient to meet the needs of those who blow them.",
      "start_char": 1226,
      "end_char": 1609,
      "start_sentence": 51,
      "end_sentence": 60,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.030516147613525,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "．营魄人之常居处也 ．一人之真也 ．言人能处常居之宅．抱一清神能常无离乎 ．则万物自宾也 ．专任也 ．致极也 ．言任自然之气．致至柔之和．能若婴儿之无所欲乎 ．则物全而性得矣 ．玄物之极也 ．言能涤除邪饰．至于极览．能不以物介其明．疵（之）其神乎 ．则终与玄同也 ．任术以求成运数以求匿者智也 ．玄览无疵．治国无以智．犹弃智也 ．能无以智乎 ．则民不辟而国治也 ．天门谓天下之所由从也 ．开阖治乱之际也 ．或开或阖．经通于天下．故曰天门开阖也 ．雌应而不（倡）［唱］．因而不为．言天门开阖能为雌乎 ．则物自宾而处自安矣 ．言至明四达．无迷无惑．能无以为乎",
      "translated_text": "**Chapter 10 (continued)**\n\nThe dwelling of the *hun* and *po* is humanity’s constant abode. It is the true essence of the individual. This means: if one can dwell in the abode of constancy, embracing the One and keeping the spirit pure, never parting from it—then the myriad things will naturally submit. \"Devoted commitment\" is single-minded application; \"attaining the ultimate\" is reaching the utmost limit. This means: if one can entrust oneself to the natural *qi*, attaining the utmost softness and harmony, becoming like an infant free of desire—then things will be whole and one’s nature will be realized.\n\n\"The ultimate of the mysterious\" is the pinnacle of subtle things. This means: if one can cleanse away false adornments, reaching the utmost clarity, neither allowing things to obstruct one’s illumination nor blemish one’s spirit—then one will ultimately merge with the mysterious. Those who employ techniques to seek success or rely on calculations to conceal themselves act with cunning. But with a gaze as mysterious and unblemished as this, governing a state without cunning is like discarding it altogether. If one can govern without cunning—then the people will not deceive, and the state will be well-ordered.\n\n\"The Gate of Heaven\" refers to that by which all under heaven follows. It is the juncture of opening and closing, order and chaos. Whether opening or closing, it pervades all under heaven—thus it is called \"the opening and closing of the Gate of Heaven.\" The female responds without initiating; it follows without acting. This means: if the Gate of Heaven’s opening and closing can be like the female—then things will naturally submit, and one’s dwelling will be at peace. This means: with utmost clarity extending in all four directions, free from delusion or confusion—can one act without contrivance?",
      "overlap_context": "losing one’s virtue. Having not lost virtue, to then fill it further is to invite peril—thus it is better to cease. This means it is even less desirable than one who possesses neither virtue nor merit. Having shaped the tip to a point, to then sharpen it further is to invite breakage—thus it cannot be long preserved. It is better to cease; it cannot be long preserved. The four seasons alternate in succession; when a task is complete, it shifts onward.\n\n**Chapter 10**\n\"Carrying\" is like dwelling.",
      "start_char": 1609,
      "end_char": 1866,
      "start_sentence": 61,
      "end_sentence": 81,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.886978387832642,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "．则物化矣 ．所谓道常无为．侯王若能守．则万物［将］自化．不塞其源也 ．不塞其源．则物自生．何功之有．不禁其性．则物自济．何为之恃．物自长足．不吾宰成．有德无主．非玄而何．凡言玄德．皆有德而不知其主．出乎 幽冥． １１章 毂所以能统三十辐者无也．以其无能受物之故．故能以（实）［寡］统众也．木埴壁所以成三者．而皆以无为用也．言无者有之所以为利．皆赖无以为用也． １２章 爽差失也．失口之用．故谓之爽．夫耳目口心皆顺其性也．不以顺性命．反以伤自然．故曰盲聋爽狂也．难得之货塞人正路．故令人行妨也．为腹者以物养己．为目者以物役己．故圣人不为目也． １３章 宠必有辱．荣必有患．（惊）［宠］辱等．荣患同也．为下得宠辱荣患若惊．则不足以乱天下也．大患荣宠之属也．生之厚必入死之地．故谓之大患也．人迷之于荣宠．返之于身．故曰大患若身也．由有其身也．归之自然也．无［物可］以易其身．故曰贵也．如此乃可以诧天下也．无物可以损其身．故曰爱也．如此乃可以寄天下也．不以宠辱荣患损易其身．然后乃可以天下付之也． １４章 无状无象．无声无响．故能无所不通．无所不往．不得而知．更以我耳目体不知为名．故不可致诘．混而为一也．欲言无邪．而物由以成．欲言有邪．而不见其形．故曰无状之状无物之象也．不可得而定也．有有其事．无形无名者．万物之宗也．虽今古不同．时移俗易．故莫不由乎此以成其治者也．故可执古之道以御今之有．上古虽远．其道存焉．故虽在今可以知古始也． １５章 冬之渉川．予然若欲度．若不欲度．其情不可得见之貌也．四邻合攻中央之主．犹然不知所趣向者也．上德之人．其端兆不可观．（德）［意］趣不可见．亦犹此也．凡此诸若．皆言其容象不可得而形名也．夫晦以理．物则得明．浊以静．物则得清．安以动．物则得生．此自然之道也．孰能物言其难也．除者详慎也．盈必溢也．蔽覆盖也． １６章 言致虚．物之极笃．守静物之真正也 ．动作成长．以虚静观其反复．凡有起于虚．动起于静．故万物虽并动作．卒复归于虚静．是物之极笃也 ．各返其所始．归根则静．故曰静．静则复命．故曰复命也 ．复命则得性命之常．故曰常也 ．常之为物．不偏不彰．无皦昧之状．温凉之象．故曰知常曰明也 ．唯此复．乃能包通万物．无所不容．失此以往．则邪入乎 分．则物离其分．故曰不知常则妄作凶．无所包通也 ．无所不包通．则乃至于荡然公平也 ．荡然公平．则乃至于无所不周普也 ．无所不周普．则乃至于同乎 天也 ．与天合德．体道大通．则乃至于［穷］极虚无也 ．穷极虚无．得道之常．则乃至于不穷极也 ．无之为物．水火不能害．金石不能残．用之于心．则虎兕无所投其（齿）［爪］角．兵戈无所容其锋刃．何危殆之有乎 ． １７章",
      "translated_text": "Then things transform of themselves. The Dao is ever without action—if lords and kings can hold to it, the myriad things will transform spontaneously. Do not block their source. If their source is not blocked, things arise of themselves—what merit is there to claim? Do not restrain their nature, and things fulfill themselves—what reliance is there to seek? Things grow to fullness without our shaping or completing them. To possess virtue yet have no master—what is this if not the mysterious? All references to \"mysterious virtue\" speak of possessing virtue while unaware of its source, emerging from the hidden and obscure.\n\n**Chapter 11**\nThe hub governs the thirty spokes by means of its emptiness. It is because of its emptiness that it can receive the spokes—thus it can govern the many with the few. The wood, clay, and walls that form the three materials of a house all serve their function through emptiness. This means: what is called \"emptiness\" is the very source of usefulness. All things rely on emptiness for their function.\n\n**Chapter 12**\n\"Scar\" means deviation, a loss of proper function. When the mouth loses its use, it is called a scar. The ears, eyes, mouth, and heart all follow their nature. If one does not follow the nature of life but instead harms what is natural, this is called blindness, deafness, scarring, and madness. Rare and precious goods obstruct the true path of people, causing their conduct to falter. Those who live for the belly use things to nourish themselves; those who live for the eyes use things to enslave themselves. Thus the sage does not live for the eyes.\n\n**Chapter 13**\nFavor inevitably brings disgrace; glory inevitably brings misfortune. Favor and disgrace are equal, glory and misfortune the same. If one is humbled yet receives favor or disgrace, glory or misfortune as if startled, one is not fit to disturb the world. Great misfortune arises from glory and favor. To thicken life is to enter the realm of death—thus it is called great misfortune. People are deluded by glory and favor, turning them back upon themselves—thus it is said, \"great misfortune is like one’s own body.\" It is because one has a body that one returns to the natural. Nothing can be exchanged for one’s body—thus it is called precious. Only thus can one be entrusted with the world. Nothing can harm one’s body—thus it is called beloved. Only thus can one be entrusted with the world. If one does not allow favor or disgrace, glory or misfortune to harm or exchange for one’s body, only then can the world be entrusted to them.\n\n**Chapter 14**\nWithout form, without image, without sound, without echo—thus it can penetrate everywhere, go anywhere. It cannot be known, and even with my ears, eyes, and body, I cannot name it—thus it cannot be questioned. Blended into oneness, if one wishes to call it \"not so,\" things arise from it; if one wishes to call it \"so,\" no form is seen. Thus it is called \"the form of the formless, the image of the imageless.\" It cannot be fixed or defined. That which has its reality yet lacks form or name is the ancestor of the myriad things. Though past and present differ, times change and customs shift, there is nothing that does not rely on this to achieve order. Thus one can grasp the ancient Dao to steer the present. Though high antiquity is distant, its Dao remains—thus even in the present, one can know the beginning of the ancient.\n\n**Chapter 15**\nWhen crossing a river in winter, one hesitates as if wishing to ford it, as if not wishing to ford it—such is the appearance of a mind whose true state cannot be discerned. When the four neighbors unite to attack the central lord, he remains uncertain of his direction. The person of supreme virtue—his beginnings and intentions cannot be observed, just like this. All these \"as if\" descriptions speak of appearances that cannot be captured in form or name. Obscurity brings clarity to things; turbidity, when stilled, becomes clear; stillness in movement brings life to things—this is the Dao of the natural. Who can articulate its difficulty? \"Removing\" means careful deliberation. \"Fullness\" inevitably leads to overflow. \"Covering\" means concealment.\n\n**Chapter 16**\nTo attain emptiness is the utmost sincerity of things; to guard stillness is the true essence of things. In activity and growth, observe their return through emptiness and stillness. All things arise from emptiness, movement from stillness—thus though the myriad things act in concert, they ultimately return to emptiness and stillness. This is the utmost sincerity of things. Each returns to its origin; returning to the root is stillness—thus it is called stillness. Stillness is returning to life—thus it is called returning to life. Returning to life is attaining the constancy of life—thus it is called constancy. As for constancy, it is neither partial nor conspicuous, without the appearance of brightness or obscurity, warmth or coolness—thus it is called \"knowing constancy is called illumination.\" Only this return can encompass all things without exclusion. To lose this is to invite deviation. When things depart from their proper place, it is said, \"not knowing constancy leads to reckless action and misfortune,\" for there is nothing to encompass. Without exclusion, one attains boundless impartiality. Boundless impartiality leads to all-pervading universality. All-pervading universality leads to unity with Heaven. United with Heaven in virtue, embodying the great penetration of the Dao, one attains the ultimate of emptiness. Attaining the ultimate of emptiness, one grasps the constancy of the Dao—thus one reaches the inexhaustible. As for the thing called emptiness: water and fire cannot harm it, metal and stone cannot destroy it. Applied to the mind, tigers and rhinos have nowhere to sink their claws or horns, weapons have nowhere to lodge their blades. What danger or peril could there be?",
      "overlap_context": "d closing, order and chaos. Whether opening or closing, it pervades all under heaven—thus it is called \"the opening and closing of the Gate of Heaven.\" The female responds without initiating; it follows without acting. This means: if the Gate of Heaven’s opening and closing can be like the female—then things will naturally submit, and one’s dwelling will be at peace. This means: with utmost clarity extending in all four directions, free from delusion or confusion—can one act without contrivance?",
      "start_char": 1866,
      "end_char": 3004,
      "start_sentence": 82,
      "end_sentence": 112,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.758123636245728,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "太上谓大人也 ．大人在上．故曰太上．大人在上．居无为之事．行不言之教．万物作焉 而不为始．故下知有之而已．言从上也 ．不能以无为居事．不言为教．立善行施．使下得亲而誉之也 ．不复能以恩仁令物．而赖威权也 ．不能（法）以正齐民．而以智治国．下知避之．其令不从．故曰侮之也 ．夫御大失性．则疾病生．辅物失真．则疵衅作．信不足焉 ．则有不信．此自然之道也 ．已处不足．非智之所（齐）［济］也 ．自然其端兆不可得而见也 ．其意趣不可得而睹也",
      "translated_text": "The Highest refers to the Great Person. The Great Person is above, hence called the Highest. When the Great Person is above, they dwell in the affairs of non-action and practice the teaching without words. The myriad things arise yet they do not initiate—thus those below merely know of their existence. This is to say, they follow what is above.\n\nIf one cannot dwell in non-action in affairs or teach without words, but instead establishes goodness and enacts beneficence, causing those below to grow close and praise them, they can no longer govern things through kindness and benevolence but must rely on authority and power.\n\nIf one cannot govern the people with uprightness and instead rules the state with cleverness, those below will know to evade them, and their commands will not be followed—hence it is said they are treated with contempt.\n\nWhen governing the great loses its nature, illness and disease arise. When assisting things loses their truth, flaws and conflicts emerge. When trust is insufficient, there will be distrust. This is the natural Dao.\n\nTo dwell in insufficiency cannot be remedied by cleverness. The beginnings and signs of the natural cannot be seen, nor can its intentions and tendencies be perceived.",
      "overlap_context": "y with Heaven. United with Heaven in virtue, embodying the great penetration of the Dao, one attains the ultimate of emptiness. Attaining the ultimate of emptiness, one grasps the constancy of the Dao—thus one reaches the inexhaustible. As for the thing called emptiness: water and fire cannot harm it, metal and stone cannot destroy it. Applied to the mind, tigers and rhinos have nowhere to sink their claws or horns, weapons have nowhere to lodge their blades. What danger or peril could there be?",
      "start_char": 3005,
      "end_char": 3213,
      "start_sentence": 113,
      "end_sentence": 123,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.008472681045532,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "．无物可以易其言．言必有应．故曰悠兮其贵言也 ．居无为之事．行不言之教．不以形立物．故功成事遂．而百姓不知其所以然也 ． １８章 失无为之事．更以施慧立善．道进物也．行术用明．以察奸伪．趣睹形见．物知避之．故智慧出则大伪生也．甚美之名．生于大恶．所谓美恶同门．六亲父子兄弟夫妇也．若六亲自和．国家自和．则孝慈．忠臣不知其所在矣．鱼相忘于江湖之道．则相濡之德生也． １９章 圣智才之善也．仁义（人）［行］之善也．巧利用之善也．而直云绝．文甚不足．不令之有所属．无以见其指．故曰此三者以为文而未足．故令人有所属．属之于素朴寡欲． ２０章 下篇［云］．为学者日益．为道者日损．然则学求益所能．而进其智者也 ．若将无欲而足．何求于益．不知而中．何求于进．夫燕雀有匹．鸠鸽有仇．寒乡之民．必知旃裘．自然已足．益之则忧．故续凫之足．何异截鹤之胫．畏誉而进．何异畏刑．唯（阿）［诃］美恶．相去何若．故人之所畏．吾亦畏焉 ．未敢恃之以为用也 ．叹与俗相（返）［反］之远也 ．众人迷于美进．惑于荣利．欲进心竞．故煕煕如享太牢．如春登台也 ．言我廓然无形之可名．无兆之可举．如婴儿之未能孩也 ．若无所宅．众\\人无不有怀有志．盈溢胸心．故曰皆有余也 ．我独廓然无为无欲．若遗失之也 ．绝愚之人．心无所别析．意无所（好恶）［美恶］．犹然其情不可睹．我颓然若此也 ．无所别析．不可为（明）［名］．耀其光也 ．分别别析也 ．情不可睹．无所系[埶纟]．以用也 ．皆欲有所施用也 ．无所欲为．闷闷昏昏．若无所识．故曰顽且鄙也 ．食母生之本也 ．人（者）皆弃生民之本．贵末饰之华．故曰我独欲异于人． ２１章 孔空也 ．惟以空为德．然后乃能动作从道．恍惚无形不系之叹．以无形始物．不系成物．万物以始以成．而不知其所以然．故曰恍兮惚兮［其中有物］．惚兮恍兮其中有象也 ．窈冥深远之叹．深远不可得而见．然而万物由之．（其）［不］可得见．以定其真．故曰窈兮冥兮其中有精也 ．信信验也 ．物反窈冥．则真精之极得．万物之性定．故曰其精甚真其中有信也 ．至真之极．不可得名．无名则是其名也 ．自古及今．无不由此而成．故曰自古及今其名不去也 ．众甫物之始也 ．以无名（说）．［阅］万物始也 ．此上之所云也 ．言吾何以知万物之始于无哉 ．以此知之也 ．",
      "translated_text": "The words of the Dao cannot be altered by any thing, and every word must have its response—thus it is said, \"How profound! How prized are its words.\"\n\nDwelling in non-action, practicing the teaching without words, not establishing things through form—thus achievements are completed and affairs succeed, yet the hundred clans do not know why it is so.\n\n**Chapter 18**\nWhen non-action is lost and one instead relies on deploying wisdom to establish goodness, the Dao advances things. Employing techniques and using cleverness to examine deceit and falsehood, pursuing visible forms and appearances, things will know to evade them—thus when wisdom and intelligence emerge, great falsity arises.\n\nThe most exalted names arise from the greatest evils—this is what is meant by \"beauty and ugliness share the same gate.\" The six relations—father and son, elder and younger brothers, husband and wife—if the six relations are naturally harmonious, the state will be naturally harmonious, and then filial piety and kindness, loyal ministers, will be nowhere to be found.\n\nThe Dao of fish forgetting one another in rivers and lakes gives rise to the virtue of mutual moistening.\n\n**Chapter 19**\nThe goodness of sagely wisdom and talent, the goodness of benevolence and righteousness in conduct, the goodness of skill and profit in use—yet it is simply said to \"cut them off.\" The ornament is insufficient, and the command has no attachment, so its intent cannot be seen. Thus it is said, \"These three are taken as ornament but are insufficient,\" and so one is made to have attachment—to attach to plain simplicity and few desires.\n\n**Chapter 20**\nThe lower section states: \"Those who engage in learning increase day by day; those who practice the Dao diminish day by day.\" Thus learning seeks to increase one's abilities and advance one's intelligence.\n\nIf one is without desire and content, what need is there for increase? If one hits the mark without knowing, what need is there for advancement? Swallows and sparrows have their mates; turtledoves and pigeons have their rivals. The people of cold lands must know felt and fur. When nature is already sufficient, to increase it brings worry. Thus to lengthen a duck's legs—how is it different from cutting a crane's shins? To advance in fear of censure—how is it different from fearing punishment? Only when beauty and ugliness are denounced—how far apart are they? Thus what others fear, I too fear, and dare not rely on it for use.\n\nAlas, how distant is this from the common way! The multitude is deluded by beautiful advancement, confused by glory and profit, desiring to advance and compete in heart—thus they are radiant as if feasting on grand sacrifices, as if ascending a terrace in spring.\n\nI am vast and formless, without nameable shape, without signs that can be raised—like an infant who cannot yet laugh. As if without abode, the multitude all have thoughts and aspirations filling their hearts—thus it is said, \"All have excess.\" I alone am vast and without action or desire, as if lost. The utterly foolish, their minds without distinction, their intentions without beauty or ugliness, their feelings yet unseen—I am listless like this. Without distinction, without nameable brightness, without separation or analysis, their feelings unseen, without attachment or use—all desire to have some application. Without desire for action, dull and dim, as if without knowledge—thus it is said, \"Stubborn and coarse.\"\n\nFeeding is the root of life. People all abandon the root of the living people and value the flower of adornment—thus it is said, \"I alone desire to be different from others.\"\n\n**Chapter 21**\nEmptiness is hollow. Only by taking emptiness as virtue can one then act in accord with the Dao. The sigh of the indistinct and formless, without attachment—by the formless, things begin; without attachment, things are completed. The ten thousand things begin and are completed, yet do not know why it is so. Thus it is said, \"Vague! Elusive! Within it there are things. Elusive! Vague! Within it there are images.\"\n\nThe sigh of the profound and distant—deep and distant, it cannot be seen, yet the ten thousand things arise from it. It cannot be seen, yet by it the true is determined. Thus it is said, \"Dark! Obscure! Within it there is essence.\" *Xin* means verification. When things return to the dark and obscure, the utmost of true essence is attained, and the nature of the ten thousand things is settled. Thus it is said, \"Its essence is utterly true; within it there is verification.\"\n\nThe utmost of truth cannot be named—without name, this is its name. From ancient times to the present, nothing does not thereby come to completion. Thus it is said, \"From ancient times to the present, its name does not depart.\"\n\nThe *zhongfu* is the beginning of things. By the nameless, the beginning of the ten thousand things is observed. This is what was said above. How do I know that the ten thousand things begin from the nameless? By this I know it.",
      "overlap_context": " will know to evade them, and their commands will not be followed—hence it is said they are treated with contempt.\n\nWhen governing the great loses its nature, illness and disease arise. When assisting things loses their truth, flaws and conflicts emerge. When trust is insufficient, there will be distrust. This is the natural Dao.\n\nTo dwell in insufficiency cannot be remedied by cleverness. The beginnings and signs of the natural cannot be seen, nor can its intentions and tendencies be perceived.",
      "start_char": 3213,
      "end_char": 4159,
      "start_sentence": 124,
      "end_sentence": 161,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.46757698059082,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "２２章 （不自见［则］其明（则）全也）．（不自是则其是彰也）．（不自伐则其功有也）．（不自矜则其德长也）．自然之道亦犹树也．转多转远其根．转少转德其本．多则远其真故曰惑也．少则得其本故曰得也．一少之极也．式犹则（之）也． ２３章 听之不闻名曰希．下章言．道之出言．淡兮其无味也 ．视之不足见．听之不足闻．然则无味不足听之言．乃是自然之至言也 ．言暴疾美兴不长也 ．从事谓举动从事于道者也 ．道以无形无为成济万物．故从事于道者以无为为君．不言为教．绵绵若存．而物得其真．与道同体．故曰同于道．得少也 ．少则得故曰得也 ．行得则与得同体．故曰同于得也 ．失累多也 ．累多则失．故曰失也 ．行失则与失同体．故曰同于失也 ．言随（行）其所［行］．故同而应之．忠信不足于下．焉 有不信焉 ．",
      "translated_text": "Chapter 22:\n(Not seeing oneself preserves one’s clarity; thus it is complete.)\n(Not asserting oneself manifests one’s rightness.)\n(Not boasting ensures one’s achievements endure.)\n(Not self-aggrandizing allows one’s virtue to grow.)\nThe Dao of spontaneity is like a tree:\nthe more it branches, the farther it strays from its root;\nthe less it branches, the deeper its foundation in virtue.\nExcess strays from the true, hence it is called delusion.\nRestraint attains the root, hence it is called attainment.\nOneness is the utmost of restraint.\nThis is the standard to follow.\n\nChapter 23:\nWhat is heard yet not perceived is called *xi*.\nThe following chapter states:\nThe Dao’s words emerge bland, utterly flavorless.\nSeen, it is not enough to behold; heard, it is not enough to perceive.\nYet these flavorless, inaudible words are the utmost of natural speech.\nIt speaks of violent impulses and fleeting passions that do not endure.\n\"Following the Dao\" refers to those who act in accordance with it.\nThe Dao accomplishes and sustains the ten thousand things through formlessness and non-action.\nThus, those who follow the Dao take non-action as their ruler, silence as their teaching.\nSubtle yet ever-present, things attain their true nature and unite with the Dao in body.\nHence it is said, \"One with the Dao.\"\nAttainment is minimal—minimal, thus it is called attainment.\nIn conduct, attainment unites with attainment in body.\nHence it is said, \"One with attainment.\"\nFailure is encumbrance by excess—excess encumbers, thus it is called failure.\nIn conduct, failure unites with failure in body.\nHence it is said, \"One with failure.\"\nIt speaks of responding to whatever one follows, thus aligning with it.\nWhen loyalty and trust are insufficient among inferiors, how can there be no distrust?",
      "overlap_context": "y true; within it there is verification.\"\n\nThe utmost of truth cannot be named—without name, this is its name. From ancient times to the present, nothing does not thereby come to completion. Thus it is said, \"From ancient times to the present, its name does not depart.\"\n\nThe *zhongfu* is the beginning of things. By the nameless, the beginning of the ten thousand things is observed. This is what was said above. How do I know that the ten thousand things begin from the nameless? By this I know it.",
      "start_char": 4160,
      "end_char": 4500,
      "start_sentence": 162,
      "end_sentence": 177,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.36448884010315,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "２４章 物尚进则失安．故曰企者不立．［不自见则其明全也］．［不自是则其是彰也］．［不自伐则其功有也］．［不自矜则其德长也］．其唯于道而论之．若郄至之行．盛馔之余也．本虽美更可秽也．本有功而自伐之．故更为疣赘者也． ２５章 混然不可得而知．而万物由之以成．故曰混成也 ．不知其谁之子．故先天地生．寂寥无形体也 ．无物（之匹）［匹之］．故曰独立也 ．返化终始．不失其常．故曰改也 ．周行无所不至而（免）［不危］殆．能生全大形也 ．故可以为天下母也 ．名以定形．混成无形．不可得而定．故曰不知其名也 ．夫名以定形．字以称可．言道取于无物而不由也 ．是混成之中．可言之称最大也 ．吾所以字之曰道者．取其可言之称最大也 ．责其字定之所由．则系于大．（大）［夫］有系则必有分．有分则失其极矣 ．故曰强为之名曰大．逝行也 ．不守一大体而已．周行无所不至．故曰逝也 ．远极也 ．周［行］无所不穷极．不偏于一逝．故曰远也 ．不随于所适．其体独立．故曰反也 ．天地之性人为贵．而王是人之主也 ．虽不职大亦复为大．与三匹故曰王亦大也 ．四大道天地王也 ．凡者有称有名．则日其极也 ．言道则有所由．有所由然后谓之为道．然则（是道）［道是］称中之大也 ．不若无称之大也 ．无称不可得而名．［故］曰域也 ．道天地王皆在乎 无称之内．故曰域中有四大者也 ．处人主之大也 ．法谓法则也 ．人不违地．乃得全安．法地也 ．地不违天．乃得全载．法天也 ．天不违道．乃得全覆．法道也 ．道不违自然．乃得其性［法自然也 ］．法自然者．在方而法方．在圆而法圆．于自然无所违也 ．自然者无称之言穷极之辞也 ．用智不及无知．而形魄不及精象．精象不及无形．有仪不及无仪．故转相法也 ．道（顺）［法］自然．天故资焉 ．天法于道．地故则焉 ．地法于天．人故象焉 ．［王］所以为主．其（一）［主］之者（主）［一］也 ． ２６章",
      "translated_text": "**Chapter 24**\nThings that overreach lose their stability—thus it is said, \"Those who stand on tiptoe cannot stand firm.\"\n[If one does not display oneself, one’s illumination remains whole.]\n[If one does not assert oneself, one’s rightness becomes manifest.]\n[If one does not boast, one’s merit endures.]\n[If one does not pride oneself, one’s virtue grows.]\nThis is how it is discussed in relation to the Dao.\nLike the excess of a lavish feast or the overreaching of conduct,\nthough the root may be fine, it becomes foul.\nOne who has merit yet boasts of it\nthus becomes a growth or excrescence.\n\n**Chapter 25**\nIndistinct and ungraspable,\nyet the ten thousand things are completed through it—\nthus it is called \"the Primal Completion.\"\nNot knowing whose child it is,\nit precedes the birth of heaven and earth.\nSilent and formless,\nwithout peer—\nthus it is called \"independent.\"\nReturning and cycling through beginning and end,\nit does not lose its constancy—\nthus it is called \"the Unchanging.\"\nCircling without end, reaching everywhere without peril,\nit gives birth to the great and complete form—\nthus it may be called the Mother of all under heaven.\nNames fix forms,\nbut the Primal Completion is formless and cannot be fixed—\nthus it is said, \"We do not know its name.\"\nNames fix forms; words designate what can be designated.\nThe Dao is taken from the formless and does not proceed from things.\nWithin the Primal Completion,\nthe greatest designation that can be spoken—\nthus I style it \"Dao,\"\ntaking the greatest designation that can be spoken.\nIf we demand the source of its designation,\nthen it is bound to the great.\nWhere there is binding, there must be division;\nwhere there is division, it loses its ultimate limit.\nThus it is said, \"By force we name it 'great.'\"\nIt moves and flows—\nnot confined to a single great body but circling without end—\nthus it is called \"the Flowing.\"\nIt reaches the farthest limit—\ncircling without bound, not partial to one path—\nthus it is called \"the Far.\"\nNot following where it goes,\nits body stands alone—\nthus it is called \"the Return.\"\nAmong the natures of heaven and earth, humans are most noble,\nand the king is the lord of humans.\nThough he does not hold the greatest office, he is still great,\nfor he matches the three—thus it is said, \"The king, too, is great.\"\nThe four great ones are the Dao, heaven, earth, and the king.\nAll things that have designation and name\nare said to have their limit.\nThe Dao has its source;\nonly with a source can it be called the Dao.\nYet this is the greatest among designations—\nnot as great as the greatness without designation.\nThe undesignated cannot be named—\nthus it is called \"the Realm.\"\nThe Dao, heaven, earth, and the king all lie within\nthe Realm of the undesignated—\nthus it is said, \"Within the realm are four great ones.\"\nThe king holds the greatness of the lord of humans.\nTo model is to take as a standard.\nHumans do not transgress earth—\nthus they preserve their wholeness and peace; they model earth.\nEarth does not transgress heaven—\nthus it preserves its full capacity to bear; it models heaven.\nHeaven does not transgress the Dao—\nthus it preserves its full capacity to cover; it models the Dao.\nThe Dao does not transgress the natural—\nthus it preserves its nature; it models the natural.\nTo model the natural is to follow the square when square,\nthe round when round,\nwithout transgressing the natural.\nThe natural is the word for the undesignated, the term for the ultimate limit.\nWisdom does not surpass non-knowing;\nform and spirit do not surpass subtle essence;\nsubtle essence does not surpass the formless;\nhaving form does not surpass formlessness.\nThus they model one another in turn.\nThe Dao models the natural—\nthus heaven relies on it.\nHeaven models the Dao—\nthus earth follows it.\nEarth models heaven—\nthus humans emulate it.\nThe king, as lord,\nunifies them in oneness.\n\n**Chapter 26**",
      "overlap_context": "\"One with the Dao.\"\nAttainment is minimal—minimal, thus it is called attainment.\nIn conduct, attainment unites with attainment in body.\nHence it is said, \"One with attainment.\"\nFailure is encumbrance by excess—excess encumbers, thus it is called failure.\nIn conduct, failure unites with failure in body.\nHence it is said, \"One with failure.\"\nIt speaks of responding to whatever one follows, thus aligning with it.\nWhen loyalty and trust are insufficient among inferiors, how can there be no distrust?",
      "start_char": 4501,
      "end_char": 5263,
      "start_sentence": 178,
      "end_sentence": 220,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.822614908218384,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "凡物轻不能载重小不能镇大．不行者使行．不动者制动．是以重必为轻根．静必为躁君也．以重为本故不离．不以经心也．轻不镇重也．失本为丧身也．失君为失君位也． ２７章 顺自然而行．不造不（始）［施］．故物得至．而无辙迹也 ．顺物之性．不别不析．故无瑕谪可得其门也 ．因物之数．不假形也 ．因物自然．不设不施．故不用关楗．绳约而不可开解也 ．此五者皆言不造不施因物之性不以形制物也 ．圣人不立形名以检于物．不造进向以殊弃不肖．辅万物之自然而不为始．故曰无弃人也 ．不尚贤能．则民不争．不贵难得之货．则民不为盗．不见可欲．则民心不乱．常使民心无欲无惑．则无弃人也 ．举善以（师）［齐］不善．故谓之师矣 ．资取也 ．善人以善齐不善．［不］以善弃不善也 ．故不善人善人之所取也 ．虽有其智．自任其智．不因物于其道必失．故曰虽智大迷． ２８章 雄先之属．雌后之属也．智为天下之先（也）［者］必后也．是以圣人后其身而身先也．溪不求物．而物自归之．婴儿不用智．而合自然之智．式模则也． 忒差也．不可穷也．此三者．言常反终．后乃德全其所处也．下章云反者道之动也．功不可取．常处其母也．朴真也．真散则百行出．殊类生．若器也．圣人因其分散．故为之立官长．以善为师．不善为资．移风易俗．复使归于一也．大制者．以天下之心为心．故无割也． ２９章 神无形无方也．器合成也．无形以合．故谓之神器也．万物以自然为性．故可因而不可为也．可通而不可执也．物有常性．而造为之．故必败也．物有往来．而执之．故必失也．凡此诸或．言物事逆顺反复．不施为执割也．圣人达自然之（至）［性］．畅万物之情．故因而不为．顺而不施．除其所以迷．去其所以惑．故心不乱而物性自得之也． ３０章 以道佐人主．尚不可以兵强于天下．况人主躬于道者乎 ．为（始）［治］者务欲立功生事．而有道者务欲还反无为．故云其事好还也 ．言师凶害之物也 ．无有所济．必有所伤．贼害人民．残荒田亩．故曰荆棘生焉 ．果犹济也 ．言善用师者．趣以济难而已矣 ．不以兵力取强于天下也 ．吾不以师道为尚．不得已而用．何矜骄之有也 ．言用兵虽趣功（果）济难．然时故不得已（当复）［后］用者．但当以除暴乱．不遂用果以为强也 ．壮武力暴兴．喻以兵强于天下者也 ．飘风不终朝．骤雨不终日．故暴兴必不道．早已也 ． ３２章",
      "translated_text": "**Chapter 27**\n\nLight things cannot bear heavy burdens;\nsmall things cannot restrain great ones.\nTo make the unmovable move,\nto govern the restless with stillness—\nthus the heavy must serve as the root of the light,\nand stillness as the ruler of restlessness.\nBy taking heaviness as the foundation, one does not stray;\nit is not a matter of constant mindfulness.\nThe light cannot restrain the heavy—\nto lose the root is to forfeit one’s self;\nto lose the ruler is to lose one’s position.\n\n**Chapter 28**\n\nProceed in accordance with the natural,\nwithout contriving or imposing.\nThus things reach their fulfillment,\nyet leave no tracks.\nFollow the nature of things,\nwithout distinguishing or dissecting—\nthus no flaw or blame can find its way in.\nRely on the inherent patterns of things,\nwithout imposing form.\nAccord with the natural,\nwithout setting or imposing—\nthus, though no bolts or ropes are used,\nit cannot be untied.\nThese five all speak of not contriving or imposing,\nof following the nature of things\nwithout using form to control them.\n\nThe sage does not establish forms or names to restrain things,\nnor does he create advancement or rejection\nto separate the worthy from the unworthy.\nHe assists the self-so of the myriad things\nwithout taking the lead.\nThus it is said: \"No one is abandoned.\"\nIf worth and ability are not exalted,\nthe people do not contend.\nIf rare and precious goods are not valued,\nthe people do not steal.\nIf what can be desired is not displayed,\nthe people’s hearts are not disturbed.\nAlways keep the people’s hearts free of desire and confusion—\nthus no one is abandoned.\n\nElevate the good to bring the ungood into alignment—\nthus it is called \"teacher.\"\n*Resource and acquisition.*\nThe good person uses goodness to align the ungood,\nnot to abandon the ungood with goodness.\nThus the ungood are what the good acquire.\nThough one may possess wisdom,\nif one relies solely on one’s own wisdom\nand does not follow the Way of things,\none is bound to fail.\nThus it is said: \"Though wise, one is greatly deluded.\"\n\n**Chapter 29**\n\nThe male leads, the female follows—\nthose who take the lead in the world with cleverness\nare bound to fall behind.\nThus the sage places himself last and finds himself first.\nThe valley does not seek things,\nyet things naturally gather to it.\nThe infant does not use wisdom,\nyet embodies the wisdom of the natural.\n*Model and pattern; deviation and error—*\nthese cannot be exhausted.\nThese three speak of the constant return to the end,\nwhereby virtue is perfected in its place.\nThe next chapter says: \"Reversion is the movement of the Dao.\"\nMerit cannot be seized—\none must always abide in the mother.\n*Uncarved simplicity.*\nWhen simplicity scatters, the hundred practices emerge,\nand distinct kinds arise—like vessels.\nThe sage, following their dispersion,\nestablishes officials and leaders,\ntaking the good as teachers\nand the ungood as resources,\ntransforming customs and mores\nto return them to oneness.\n\nGreat governance takes the heart of the world as its heart—\nthus it does not divide.\n\n**Chapter 30**\n\nThe numinous has no form, no direction—\nvessels are what is completed.\nWith no form to complete,\nit is called the \"numinous vessel.\"\nThe myriad things take the natural as their nature—\nthus they can be followed but not made,\ncan be penetrated but not grasped.\nThings have a constant nature,\nyet to contrive and impose upon them\nis bound to fail.\nThings have their comings and goings,\nyet to grasp them\nis bound to lose them.\nAll these instances speak of the reversal and recurrence of things,\nof not imposing, grasping, or dividing.\n\nThe sage comprehends the utmost nature of the natural,\nunfolds the feelings of the myriad things—\nthus he follows without contriving,\naccords without imposing.\nHe removes what causes delusion,\ndispels what causes confusion—\nthus the heart is not disturbed,\nand the nature of things attains itself.\n\n**Chapter 31**\n\nTo assist a ruler with the Dao,\none must not rely on arms to overpower the world—\nhow much less so for a ruler who embodies the Dao?\nThose who govern by initiating affairs\nare ever eager to establish merit and create matters,\nwhile those who abide in the Dao\nare ever eager to return to non-action.\nThus it is said: \"Its affairs tend to return.\"\n\nTo speak of armies is to speak of instruments of misfortune—\nthey bring no benefit,\nand must bring harm.\nThey ravage the people,\nlay waste to fields and villages—\nthus it is said: \"Thorns and brambles grow there.\"\n\n*Fruit* means *to achieve.*\nTo speak of the skillful use of armies\nis to say they are employed to resolve difficulties—\nnot to use military force to overpower the world.\nI do not exalt the way of armies;\nwhen compelled to use them, what boasting is there?\nTo speak of using armies though compelled by circumstances—\nthough one may achieve success in resolving difficulties,\none must not proceed to use force to assert strength.\n\nTo be robust in martial power, to rise in violence—\nthis is to compare armies to overpowering the world.\nFierce winds do not last the morning;\ntorrential rains do not last the day.\nThus violent uprisings are not of the Dao—\nthey end early.\n\n**Chapter 32**",
      "overlap_context": "tural.\nThe natural is the word for the undesignated, the term for the ultimate limit.\nWisdom does not surpass non-knowing;\nform and spirit do not surpass subtle essence;\nsubtle essence does not surpass the formless;\nhaving form does not surpass formlessness.\nThus they model one another in turn.\nThe Dao models the natural—\nthus heaven relies on it.\nHeaven models the Dao—\nthus earth follows it.\nEarth models heaven—\nthus humans emulate it.\nThe king, as lord,\nunifies them in oneness.\n\n**Chapter 26**",
      "start_char": 5264,
      "end_char": 6229,
      "start_sentence": 221,
      "end_sentence": 252,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.35938572883606,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "道无形不形．常不可名．以无名为常．故曰道常无名也 ．朴之为物．以无为心也 ．亦无名．故将得道．莫若守朴．夫智者可以能臣也 ．勇者可以武使也 ．巧者可以事役也 ．力者可以重任也 ．朴之为物．愦然不偏．近于无有．故曰莫能臣也 ．抱朴无为．不以物累其真．不以欲害其神．则物自宾而道自得也 ．言天地相合．则甘露不求而自降．我守其真性无为．则民不令而自均也 ．始制谓朴散始为官长之时也 ．始制官长．不可不立名分以定尊卑．故始制有名也 ．过此以往．将争锥刀之末．故曰名亦既有夫亦将知止也 ．遂任名以号物．则失治之母也 ．故知止所以不始也 ．川谷之（求）［与］江（与）海．非江海召之．不召不求而自归者（世）［也 ］．行道于天下者．不令而自均．不求而自得．故曰犹川谷之与江海也 ． ３３章",
      "translated_text": "The Dao is formless, yet not without form.\nIt is eternally unnameable—\nits constancy lies in being nameless.\nThus it is said: \"The Dao is eternally nameless.\"\n\nSimplicity as a thing\ntakes non-action as its heart—\nit too is nameless.\nTherefore, to attain the Dao,\nnothing compares to preserving simplicity.\n\nThe wise can be employed as ministers,\nthe brave can be tasked with martial affairs,\nthe skilled can be assigned to labor,\nthe strong can bear heavy burdens—\nbut simplicity as a thing,\nvague and impartial,\napproaches nothingness.\nThus it is said: \"None can make it a subject.\"\n\nEmbracing simplicity and non-action,\nnot allowing things to burden one’s authenticity,\nnot letting desires harm one’s spirit—\nthen things naturally submit,\nand the Dao is naturally attained.\n\nIt is said: when Heaven and Earth unite,\nsweet dew descends without being sought.\nIf I preserve my true nature through non-action,\nthe people, without command, naturally harmonize.\n\n\"Initial ordering\" refers to the time when simplicity scatters\nand officials and leaders first emerge.\nAt the beginning of ordering officials and leaders,\none cannot but establish names and ranks to fix hierarchy—\nthus at the start of ordering, there are names.\n\nBeyond this point,\nthere will be contention over the smallest things.\nThus it is said: \"Once names exist, one must also know when to stop.\"\n\nTo rely on names to label things\nis to lose the mother of governance.\nTherefore, knowing when to stop prevents the beginning of disorder.\n\nRivers and valleys flow to the Yangtze and the sea—\nnot because the Yangtze and sea summon them,\nbut because they return of themselves without being summoned or sought.\nOne who practices the Dao in the world\nharmonizes without command,\nattains without seeking—\nthus it is said: \"Like rivers and valleys flowing to the Yangtze and sea.\"\n\n**Chapter 33**",
      "overlap_context": " the way of armies;\nwhen compelled to use them, what boasting is there?\nTo speak of using armies though compelled by circumstances—\nthough one may achieve success in resolving difficulties,\none must not proceed to use force to assert strength.\n\nTo be robust in martial power, to rise in violence—\nthis is to compare armies to overpowering the world.\nFierce winds do not last the morning;\ntorrential rains do not last the day.\nThus violent uprisings are not of the Dao—\nthey end early.\n\n**Chapter 32**",
      "start_char": 6230,
      "end_char": 6556,
      "start_sentence": 253,
      "end_sentence": 270,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.684162855148315,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "知人者智而已矣．未若自知者．越智之上也．胜人者有力而已矣．未若自胜者．无物以损其力．用其智于人．未若用其智于己也．用其力于人．未若用其力于己也．明用于己则物无避焉．力用于己则物改焉．知足［者］自不失故富．勤能行之．其志必获．故曰强行者有志矣．以明自察．量力而行．不失其所．必获久长矣．虽死而以为生之．道不亡乃得全其寿．身没而道犹存．况身存而道不卒乎． ３４章 言道泛滥无所不适．过左右上下周旋而用．则无所不至也．万物皆由道而生．既生而不知其所由．故天下常无欲之时．万物各得其所．若道无施于物．故名于小矣．万物皆归之以生．而力使不知其所由．此不为小．故复可名于大矣．为大于其细．图难于其易． ３５章 大象天象之母也．［不炎］不寒．不温不凉．故能包统万物．无所犯伤．主若执之．则天下往也．无形无识．不偏不彰．故万物得往而不害妨也．言道之深大．人闻道之言．乃更不如学与饵．应时感悦人心也．乐与饵则能令过客止．而道之出言淡然无味．视之不足见．则不足以悦其目．听之不足闻．则不足以娱其耳．若无所中然．乃用之不可穷极也． ３６章 将欲除强梁去暴乱当以此四者．因物之性．令其自戮．不假刑为大．以除将物也．故曰微明也．足其张令之足．而又求其张．则众所歙也．与其张之不足．而改其求张者．愈益而己反危．利器利国之器也．唯因物之性．不假刑以理物．器不可睹．而物各得其所．则国之利器也．示人者任刑也．刑以利国则失矣．鱼脱于渊则必见失矣．利国［之］器而立刑以示人亦必失也． ３７章 顺自然也．万物无不由为以治以成之也．化而欲作作欲成也．吾将镇之无名之朴．不为主也．无欲竞也． ３８章 德者得也 ．常得而无丧．利而无害．故以德为名焉 ．何以得德．由乎 道也 ．何以尽德．以无为用．以无为用．则莫不载也 ．故物无焉 则无物不经．有焉 则不足以免其生．是以天地虽广以无为心．圣王虽大以虚为主．故曰以复而视．则天地之心见．至日而思之．则先王之至睹也 ．故灭其私而无其身．则四海莫不瞻．远近莫不至．主其己而有其心．则一体不能自全．肌骨不能相容．是以上德之人．唯道是用．不德其德．无执无用．故能有德而无不为．不求而得．不为而成．故虽有德而无德名也 ．下德求而得之．为而成之．则立善以治物．故德名有焉 ．求而得之必有失焉 ．为而成之必有败焉 ．善名生则有不善应焉 ．故下德为之而有以为也 ．无以为者无所［偏］也 ．凡不能无为而为之者皆下德也 ．仁义礼节是也 ．正明德之上下．辄举下德以对上德．至于无以为极下德之量上仁是也 ．足及于无以为而犹为之焉 ．为之而无以为．故有为为之患矣 ．本在无为母在无名．弃本舍母．而适其子．功虽大焉 必有不济．名虽美焉 伪亦必生．不能不为而成不兴而治．则乃为之．故有宏普博施仁爱者．而爱之无所偏私．故上仁为之而无以为也 ．爱不能兼．则有抑抗正（真）［直］而义理者．忿枉佑直．助彼攻此．物事而有以心为矣 ．故上义为之而有以为也 ．直不能笃．则有游饰修文礼敬之者．尚好修敬．校责往来．则不对之间忿怒生焉",
      "translated_text": "**Chapter 34**\n\nTo know others is merely wisdom,\nyet it does not surpass self-knowledge—\nself-knowledge transcends wisdom.\nTo overcome others is merely strength,\nyet it does not surpass self-mastery—\nnothing can diminish one’s strength when self-mastered.\n\nTo apply wisdom to others\nis not as good as applying it to oneself.\nTo apply strength to others\nis not as good as applying it to oneself.\nWhen clarity is turned inward, nothing eludes it;\nwhen strength is turned inward, all things transform.\n\nOne who knows contentment never loses and thus abounds in wealth.\nDiligence in practice ensures the fulfillment of aspiration.\nThus it is said: \"The resolute have purpose.\"\nBy examining oneself with clarity and acting within one’s capacity,\none never loses the proper path—\nassured of enduring longevity.\n\nThough the body perishes, it is as if alive,\nfor the Dao does not vanish, and one’s life remains whole.\nThough the body fades, the Dao endures—\nhow much more when the body persists and the Dao does not cease?\n\n**Chapter 35**\nThe Dao overflows without limit, adapting to all.\nPassing left and right, above and below, circling in use,\nit reaches everywhere.\nAll things arise from the Dao,\nyet once born, they know not their origin.\nThus, when the world is free of desire,\nall things find their place.\n\nIf the Dao did not act upon things,\nit would be called small.\nYet all things return to it for life,\nand though it compels none, none know its source—\nthis is not small.\nThus it may also be called great.\n\nTo achieve greatness in the minute,\nto plan difficulty in ease.\n\n**Chapter 36**\nThe great image is the mother of celestial patterns.\nNeither scorching nor cold,\nneither warm nor cool,\nit embraces and unites the ten thousand things,\nharming none.\nIf the ruler holds to it,\nthe world will follow.\n\nFormless and unknowable,\nimpartial and unmanifest,\nall things come to it without obstruction.\nThe depth and vastness of the Dao—\nwhen people hear its words,\nthey find them less appealing than learning or sustenance.\nFood and music may halt a passing traveler,\nbut the Dao’s words are plain and flavorless,\nseen yet not striking to the eye,\nheard yet not pleasing to the ear.\nYet when applied, they are inexhaustible.\n\n**Chapter 37**\nTo eliminate tyranny and quell chaos, employ these four principles:\nfollow the nature of things and let them destroy themselves,\nwithout resorting to punishment as the greatest means.\nThus it is called \"subtle clarity.\"\n\nTo stretch something to its limit and then demand more\ninvites collapse.\nBetter to abandon the demand for excess\nthan to persist and court danger.\n\nSharp instruments are tools of the state.\nWhen one relies on the nature of things\nwithout imposing punishments to govern,\nthe tools remain unseen,\nyet all things find their place—\nthis is the state’s true instrument.\n\nTo display them is to rely on punishment.\nPunishment that serves the state is already lost.\nA fish torn from the depths is surely doomed;\nso too is the state’s instrument lost when punishment is flaunted.\n\n**Chapter 38**\nTo follow nature:\nthe ten thousand things are governed and perfected by non-action.\nWhen transformation stirs and desire arises,\nI will pacify it with nameless simplicity,\nnot acting as master,\nfree from competitive desire.\n\n**Chapter 39**\nVirtue (德) means attainment (得).\nConstant attainment without loss,\nbenefit without harm—\nthus it is called *virtue*.\nHow is virtue attained?\nThrough the Dao.\nHow is virtue fully realized?\nBy employing non-action.\nWith non-action, nothing is not upheld.\nThus, where nothing is imposed, no thing is ungoverned;\nwhere something is imposed, life cannot be preserved.\n\nTherefore, though heaven and earth are vast, their heart is non-action.\nThough the sage-king is great, his foundation is emptiness.\nThus it is said: \"In returning to the root, the heart of heaven and earth is seen;\nin contemplating the solstice, the ultimate of the former kings is beheld.\"\n\nEradicate the private and abandon the self,\nand the four seas will gaze upon you,\nnear and far will come without fail.\nBut if one clings to the self and holds to the heart,\neven a single body cannot remain whole,\nflesh and bone cannot coexist.\n\nThus the person of highest virtue\nuses only the Dao,\nnot claiming virtue as their own.\nWithout grasping or imposing,\nthey possess virtue yet engage in all things,\nattaining without seeking,\naccomplishing without striving.\nThus, though virtuous, they bear no name of virtue.\n\nLesser virtue seeks and attains,\nstrives and accomplishes,\nestablishing goodness to govern things—\nthus the name of virtue arises.\nYet seeking and attaining must entail loss;\nstriving and accomplishing must entail failure.\nWhere the name of goodness arises,\nthe response of un-goodness follows.\nThus lesser virtue acts and has something to show for it.\n\nNon-action means no partiality.\nAll who cannot practice non-action but act\nare of lesser virtue—\nbenevolence, righteousness, propriety, and ritual are such.\n\nTo clarify the hierarchy of virtue:\nthe highest is contrasted with the lowest.\nThe lowest extreme of lesser virtue is *humaneness* (仁).\nEven when one reaches non-action, they still act—\nacting without imposing,\nthus the peril of action arises.\n\nThe root lies in non-action; the mother in namelessness.\nAbandoning the root and forsaking the mother\nto pursue their offspring,\nthough achievements may be great, they will not endure;\nthough names may be fine, falsity will surely arise.\n\nWhen governance cannot be achieved without action,\nwhen order cannot arise without effort,\nthen one acts.\nThus, those who broadly bestow benevolence and love\ndo so without partiality—\nthis is *highest humaneness*, acting without imposing.\n\nWhen love cannot be universal,\nthere arises restraint, uprightness, and righteousness—\nresenting wrong and aiding right,\nsupporting one to attack another,\nacting with the heart as arbiter.\nThus *highest righteousness* acts and has something to show for it.\n\nWhen uprightness cannot be steadfast,\nthere arises adornment, refinement, ritual, and reverence—\nvaluing refinement and respect,\ndemanding reciprocity,\ngiving rise to resentment in discord.\nThus *highest propriety* acts and has something to show for it.",
      "overlap_context": "o stop.\"\n\nTo rely on names to label things\nis to lose the mother of governance.\nTherefore, knowing when to stop prevents the beginning of disorder.\n\nRivers and valleys flow to the Yangtze and the sea—\nnot because the Yangtze and sea summon them,\nbut because they return of themselves without being summoned or sought.\nOne who practices the Dao in the world\nharmonizes without command,\nattains without seeking—\nthus it is said: \"Like rivers and valleys flowing to the Yangtze and sea.\"\n\n**Chapter 33**",
      "start_char": 6557,
      "end_char": 7808,
      "start_sentence": 271,
      "end_sentence": 306,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.71063280105591,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "．故上（德）［礼］为之而莫之应．则攘臂而扔之．夫大之极也 其唯道乎 ．自此已往岂足尊哉 ．故虽［德］盛业大．富（而）有万物．犹各得其德．［而未能自周也 故天不能为载地不能为覆人不能为赡万物］虽贵．以无为用．不能舍无以为体也 ．（不能）舍无以为体．则失其为大矣 ．所谓失道自后德也 ．以无为用．［则］（德）［得］其母．故能己不劳焉 而者无不理．下此已往．则失用之母．不能无为而贵博施．不能博施而贵正直．不能正直而贵饰敬．所谓失德而后仁失仁而后义失义而后礼也 ．夫礼也 ．所始首于忠信不笃．通简不阳．责备于表．机微争制．夫仁义发于内．为之犹伪．况务外饰而可久乎 ．故夫礼者忠心之薄而乱之首也 ．前识者前人而识也 ．则下德之伦也 ．竭其聪明以为前识．役其智力以营庶事．虽（德）［得］其情奸巧弥密．虽丰其誉愈丧笃实．劳而事昏．务而治秽（秽） ．虽竭圣智而民愈害．舍己任者则无为而泰．守其素朴则不顺典制．（听）［耽］彼所获．弃此所守．［故前］识者道之华而愚之首．故苟得其为功之母．则万物作焉 而不辞也 ．万物存焉",
      "translated_text": "Thus *highest propriety* acts, yet none respond—\nthen one rolls up their sleeves and drags them forth.\nYet how vast is that which reaches the ultimate?\nIs it not the Dao alone?\nBeyond this, what could be worthy of reverence?\n\nTherefore, though virtue be abundant and achievements great,\nthough one possess the myriad things,\neach still attains its own power—\nyet none can fully encompass themselves.\nThus, heaven cannot bear the weight alone,\nearth cannot cover all alone,\nhumankind cannot sustain the ten thousand things alone.\nThough noble, they rely on non-action for their function,\nyet cannot abandon non-being as their essence.\nTo abandon non-being as their essence\nis to lose their greatness.\nThis is what is called \"losing the Dao and following virtue.\"\n\nWhen non-action is employed,\none attains the Mother of all things,\nand thus, without toil, nothing remains ungoverned.\nBelow this, one loses the Mother of function,\nunable to value non-action and instead prizing broad bestowal,\nunable to value broad bestowal and instead prizing uprightness,\nunable to value uprightness and instead prizing adorned reverence.\nThis is what is called \"losing virtue and following humaneness,\nlosing humaneness and following righteousness,\nlosing righteousness and following propriety.\"\n\nNow, propriety\nbegins where loyalty and trust are not steadfast,\nwhere simplicity is not manifest,\nwhere demands are made of outward appearances,\nwhere subtle mechanisms vie for control.\nIf humaneness and righteousness, arising from within,\nare still deemed artificial when enacted,\nhow can the pursuit of external adornment endure?\nThus, propriety is the thinning of the loyal heart\nand the beginning of disorder.\n\nThose of *foreknowledge* are those who recognize before others—\nthey belong to the rank of lesser virtue.\nExhausting their keen perception to attain foreknowledge,\nemploying their wisdom and strength to manage affairs,\nthough they grasp the truth, deceit and cunning grow ever denser;\nthough their reputation swells, sincerity and substance wane.\nToil brings only obscurity,\neffort yields only filth.\nThough they exhaust sagely wisdom, the people suffer greater harm.\n\nThose who relinquish self and task others\nabide in non-action and ease.\nThose who uphold their plain simplicity\ndo not conform to established norms.\nIndulging in what they gain,\nabandoning what they hold—\nthus, *foreknowledge* is the flower of the Dao\nand the beginning of folly.\n\nTherefore, if one attains the Mother of all achievement,\nthe ten thousand things arise\nand make no refusal.\nThe ten thousand things abide therein.",
      "overlap_context": "annot be universal,\nthere arises restraint, uprightness, and righteousness—\nresenting wrong and aiding right,\nsupporting one to attack another,\nacting with the heart as arbiter.\nThus *highest righteousness* acts and has something to show for it.\n\nWhen uprightness cannot be steadfast,\nthere arises adornment, refinement, ritual, and reverence—\nvaluing refinement and respect,\ndemanding reciprocity,\ngiving rise to resentment in discord.\nThus *highest propriety* acts and has something to show for it.",
      "start_char": 7808,
      "end_char": 8243,
      "start_sentence": 307,
      "end_sentence": 323,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.701311349868774,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "而不劳也 ．用不以形．御不以名．故（名）仁义可显礼敬可彰也 ．夫载之以大道．镇之以无名．则物无所尚志无所营．各任其贞事用其诚．则仁德厚焉 ．行义正焉 ．礼敬清焉 ．弃其所载．舍其所正．用其成形．役其聪明．仁则（诚\\）［尚］焉 ．义（其）［则］竞焉 ．礼（其）［则］争焉 ．故仁德之厚非用仁之所能也 ．行义之正非用义之所成也 ．礼敬之清非用礼之所济也 ．载之以道．统之以母．故显之而无所尚．彰之而无所竞．用夫无名故名以笃焉 ．用夫无形故形以成焉 ．守母以存其子．崇本以举其末．则形名俱有而邪不生．大美配天而华不作．故母不可远．本不可失．仁义母之所生．非可以为母．形器匠之所成．非可以为匠也 ．舍其母而用其子．弃其本而适其末．名则有所分．形则有所止．虽极其大必有不周．虽盛其美必有患忧．功在为之．岂足处也 ． ３９章",
      "translated_text": "Yet they toil not.\nTheir use leaves no trace of form,\ntheir governance no mark of name.\nThus, benevolence and righteousness may be made manifest,\nritual propriety and reverence may be made illustrious.\n\nWhen borne by the great Dao\nand anchored in namelessness,\nthings hold nothing in esteem,\nthe will seeks nothing to pursue.\nEach follows its true nature,\nemploys its sincerity—\nthen virtue and power grow profound,\nconduct in righteousness stands upright,\nritual propriety and reverence remain pure.\n\nIf one discards what bears them\nand abandons what sets them right,\nusing instead their completed forms\nand employing their keen perception,\nthen benevolence becomes a matter of esteem,\nrighteousness a contest,\nritual propriety a strife.\nThus, the profundity of virtue and power\nis not what the use of benevolence can achieve;\nthe uprightness of righteous conduct\nis not what the use of righteousness can accomplish;\nthe purity of ritual propriety and reverence\nis not what the use of ritual can attain.\n\nWhen borne by the Dao\nand unified by the Mother,\nthey are made manifest yet nothing is esteemed,\nmade illustrious yet nothing is contested.\nThrough the use of namelessness, names become sincere;\nthrough the use of formlessness, forms are perfected.\nGuard the Mother to preserve her children,\nhonor the root to raise the branches—\nthen form and name both exist, yet perversity does not arise.\nGreat beauty matches Heaven, yet ornamentation does not arise.\n\nThus, the Mother must not be distanced,\nthe root must not be lost.\nBenevolence and righteousness are born of the Mother,\nyet cannot serve as the Mother.\nForms and vessels are crafted by the artisan,\nyet cannot serve as the artisan.\n\nAbandoning the Mother to use her children,\ndiscarding the root to pursue the branches—\nnames then have their divisions,\nforms have their limits.\nThough one may extend them to the utmost,\nthere must be incompleteness;\nthough one may exalt their beauty,\nthere must be affliction and sorrow.\nSuccess lies in action—\nhow can it be a place of rest?",
      "overlap_context": "lth.\nThough they exhaust sagely wisdom, the people suffer greater harm.\n\nThose who relinquish self and task others\nabide in non-action and ease.\nThose who uphold their plain simplicity\ndo not conform to established norms.\nIndulging in what they gain,\nabandoning what they hold—\nthus, *foreknowledge* is the flower of the Dao\nand the beginning of folly.\n\nTherefore, if one attains the Mother of all achievement,\nthe ten thousand things arise\nand make no refusal.\nThe ten thousand things abide therein.",
      "start_char": 8243,
      "end_char": 8588,
      "start_sentence": 324,
      "end_sentence": 340,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.26515245437622,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "昔始也 ．一数之始而物之极也 ．各是一物之生．所以为主也 ．物皆各得此一以成．既成而舍以居成．居成则失其母．故皆裂发歇竭灭蹶也 ．各以其一致此清宁灵盈生贞．用一以致清耳 ．非用清以清也 ．守一则清不失．用清则恐裂也 ．故为功之母不可舍也 ．是以皆无用其功．恐丧其本也 れ．清不能为清．盈不能为盈． ．故清不足贵盈不足多．贵在其母而母无贵形．贵乃以贱为本．高乃以下为基．故致数舆乃无也 ．玉石琭琭珞珞．体尽于形．故不欲也 ． ４０章",
      "translated_text": "In the beginning of old,\nthe inception of the One was the culmination of all things.\nEach thing arises as this One,\nby which it is mastered.\nAll things attain this One to achieve completion;\nonce complete, they abandon it to dwell in completion.\nDwelling in completion, they lose their Mother—\nthus all split, wither, exhaust, perish, and collapse.\n\nEach employs its One to attain this clarity, tranquility, numinous fullness, vital flourishing, and integrity.\nIt is by the One that clarity is attained—\nnot by clarity that clarity is made clear.\nGuard the One, and clarity is not lost;\nemploy clarity, and one risks fragmentation.\nThus the Mother of all achievements must not be abandoned.\nFor this reason, none dare use their achievements,\nfearing the loss of their root.\n\nClarity cannot make itself clear,\nfullness cannot make itself full.\nThus clarity is not to be prized,\nnor is fullness to be esteemed.\nValue lies in their Mother,\nyet the Mother has no valued form.\nValue takes the lowly as its root,\nthe high takes the low as its foundation.\nTherefore, though one may amass carriages, they come to naught.\n\nJade and stone, piled high in heaps—\ntheir substance is exhausted in form,\nand so they are not desired.",
      "overlap_context": "ce and righteousness are born of the Mother,\nyet cannot serve as the Mother.\nForms and vessels are crafted by the artisan,\nyet cannot serve as the artisan.\n\nAbandoning the Mother to use her children,\ndiscarding the root to pursue the branches—\nnames then have their divisions,\nforms have their limits.\nThough one may extend them to the utmost,\nthere must be incompleteness;\nthough one may exalt their beauty,\nthere must be affliction and sorrow.\nSuccess lies in action—\nhow can it be a place of rest?",
      "start_char": 8589,
      "end_char": 8799,
      "start_sentence": 341,
      "end_sentence": 353,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.946569442749023,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "高以下为基．贵以贱为本．有以无为用．此其反也．动皆知其所无则物通矣．故曰反者道之动也．柔弱同通．不可穷极．天下之物皆以有为生．有之所始以无为本．将欲全有必反于无也． ４１章 有志也 ．建犹立也 ．光而不耀．后其身而身先．外其身而身存．颣[土内]也 ．大夷之道．因物之性．不执平以割物．其平不见．乃更反若颣[土内]也 ．不德其德．无所怀也 ．知其白守其黑．大自然后乃得．广德不盈．廓然无形．不可满也 ．伦匹也 ．建德者．因物自然．不立不施．故若伦匹．质真者不矜其真故［若］沦．方而不割故无隅也 ．大器成天下不持然别．故必晩成也 ．听之不闻名曰希．［大音］不可得闻之音也 ．有声则有分．有分则不宫而商矣 ．分则不能统众\\．故有声者非大也 ．有形则有分．有分者不温则（炎）［凉］不炎则寒．故象而形者非大象．凡此诸善皆此道之所成也 ．在象则为大象而大象无形．在音则为大音而大音希声．物以之成．而不见其（成）形．故隐而无名也 ．贷之非唯供其乏而已．一贷之则足以永终其德．故曰善贷也 ．成之不如机匠之裁．无物而不济其形．故曰善成． ４２章 万物万形其归一也 ．何由致一．由于无也 ．由无乃一．一可谓无．已谓之一．岂得无言乎 ．有言有一．非二如何．有一有二．遂生乎 三．从无之有．数尽乎 斯．过此以往．非道之流．故万物之生．吾知其主．虽有万形．冲气一焉 ．百姓有心．异国殊风．而（得一者）王侯［得一者］主焉 ．以一为主．一何可舍．愈多愈远．损则近之．损之至尽乃得其极．既谓之一犹乃至三．况本不一而道可近乎 ．损之而益［益之而损］岂虚言也 ．我之［教人］非强使（人）从之也 ．而用夫自然．举其至理．顺之必吉．违之必凶．故人相教．违之［必］自取其凶也 ．亦如我之教人勿违之也 ．",
      "translated_text": "The high takes the low as its foundation,\nthe valued takes the humble as its root.\nBeing arises from non-being as its function—\nsuch is their reversal.\nIn movement, when all know what they lack, things flow freely.\nThus it is said: Reversal is the movement of the Dao.\n\nSoftness and weakness share the same flow,\nboundless and inexhaustible.\nAll things under heaven arise from being,\nyet being itself begins from non-being as its root.\nTo preserve being in its wholeness,\none must return to non-being.\n\nThose of resolve act as if establishing,\nyet shine without dazzling.\nThey place themselves last and thus come first,\nset themselves aside and thus endure.\nThis is the flaw within—\nthe Dao of great harmony,\nwhich follows the nature of things,\nnot imposing levelness to carve them.\nIts evenness remains unseen,\never reverting to the flaw within.\n\nNot prizing their own power,\nthey harbor nothing.\nKnowing the bright, they guard the dark,\nthus attaining great spontaneity.\nVast virtue does not overflow,\nboundless and formless,\nit cannot be filled.\n\nTo align is to match.\nThose who establish virtue\nfollow the spontaneity of things,\nneither asserting nor imposing—\nthus they resemble their counterparts.\nThe truly authentic do not flaunt their authenticity,\nhence they merge.\nSquare without cutting,\nthey have no corners.\n\nGreat vessels take shape without being grasped,\nhence they must be slowly completed.\nSounds that cannot be heard are called \"subtle\"—\nthe great tone is the sound beyond hearing.\nWhere there is sound, there is division;\nwith division, tones lose their unity.\nDivision cannot unify the many,\nso what has sound is not great.\nWhere there is form, there is division;\nwith division, warmth and coolness alternate.\nThus what has image and form is not the great image.\n\nAll these excellences arise from the Dao.\nIn image, it is the great image—yet the great image has no form.\nIn sound, it is the great tone—yet the great tone has no sound.\nThrough it, things are completed,\nyet its completion remains unseen.\nThus it is hidden and nameless.\n\nBestowing is not merely supplying what is lacking—\na single bestowal suffices to perpetuate its power.\nThus it is called \"excellent in bestowing.\"\nTo complete is not like a carpenter’s craft,\nwhich shapes every thing without fail.\nThus it is called \"excellent in completing.\"\n\nThe myriad things and forms return to the One.\nHow is the One attained?\nThrough non-being.\nFrom non-being comes the One,\nand the One may be called non-being.\nOnce called the One,\nhow can it be without speech?\nSpeech implies duality—\nhow could it not be two?\nFrom the One comes two,\nand from two comes three.\nFrom non-being to being,\nnumbers end here.\nBeyond this lies not the Dao’s current.\n\nThus the arising of the myriad things—\nI know their master.\nThough they take myriad forms,\ntheir qi converges in the One.\nThe hundred clans have their hearts,\nforeign lands their customs,\nyet kings and lords who attain the One rule over them.\nTaking the One as their master,\nhow can the One be abandoned?\nThe more one multiplies, the farther one strays;\nreduction brings one closer.\nReduce to the utmost,\nand one reaches the limit.\nThough called the One, it extends to three—\nhow much less can the Dao be near when its root is not One?\n\nReduction leads to increase,\nincrease leads to reduction—\nis this empty talk?\nMy teaching does not force others to follow,\nbut employs spontaneity.\nPresenting its ultimate principle,\nfollowing it brings fortune,\ndefying it brings misfortune.\nThus when people instruct one another,\ndefiance invites their own misfortune—\njust as my teaching warns against defiance.",
      "overlap_context": " use their achievements,\nfearing the loss of their root.\n\nClarity cannot make itself clear,\nfullness cannot make itself full.\nThus clarity is not to be prized,\nnor is fullness to be esteemed.\nValue lies in their Mother,\nyet the Mother has no valued form.\nValue takes the lowly as its root,\nthe high takes the low as its foundation.\nTherefore, though one may amass carriages, they come to naught.\n\nJade and stone, piled high in heaps—\ntheir substance is exhausted in form,\nand so they are not desired.",
      "start_char": 8800,
      "end_char": 9518,
      "start_sentence": 354,
      "end_sentence": 385,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.87827205657959,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "４３章 气无所不入．水无所不（出于）经．虚无柔弱．无所不通．无有不可穷．至柔不可折．以此推之故知无为之有益也． ４４章 尚名好高．其身必疏．食货无厌．其身必少．得多利而亡其身．何者为病也．甚爱不与物通．多藏不与物散．求之者多．攻之者众．为物所病．故大费厚亡也． ４５章 随物而成．不为一象．故若缺也．大盈（冲）［充］足．随物而与．无所爱矜．故若冲也．随物而直．直不在一．故若屈也．大巧因自然以成器．不造为异端．故若拙也．大辩因物而言．己无所造．故若讷也．躁罢然后胜寒．静无为以胜热．以此推之则清静为天下正也．静则全物之真．躁则犯物之性．故惟清静乃得如上诸大也． ４６章 天下有道．知足知止．无求于外．各修其内而已．故却走马以治田粪也．贫欲无厌．不修其内．各求于外．故戎马生于郊也． ４７章 事有宗而物有主．途虽殊而（同）［其］归［同］也．虑虽百而其致一也．道有大常．理有大致．执古之道可以御今．虽处于今可以知古始．故不出户窥牖而可知也．无在于一而求之于众也．道视之不可见．听之不可得．抟之不可得．如其知之不须出户．若其不知出愈远愈迷也．得物之致．故虽不行而虑可知也．识物之宗．故虽不见而是非之理可得而名也．明物之性因之而已．故虽不为而使之成矣． ４８章 务欲进其所能益其所习．务欲反虚无也．有为则有所失．故无为乃无所不为也．动常因也．自己造也．失统本也． ４９章 动常因也 ．各因其用则善不失也 ．无弃人也 ．各用聪明．皆使和而无欲如婴儿也 ．夫天地设位圣人成能人谋鬼谋\\百姓与能者．能者与之资者取之．能大则大资贵则贵．物有其宗事有其主．如此则可冕旒充目而不惧于欺．黈纩塞耳 而无戚于慢．亦何为劳一身之聪明．以察百姓之情哉 ．夫以明察物物亦竞以其明（应）［避］之．以不信（察）［求］物物亦竞以其不信应之．夫天下之心不必同．其所应不敢异．则莫肯用其情矣 ．甚矣 害之大也",
      "translated_text": "**Chapter 43**\nQi penetrates all without exception. Water flows through all channels without exception. Emptiness and softness pervade all without obstruction. Nothing remains impenetrable. The softest cannot be broken. From this we infer the benefits of non-action.\n\n**Chapter 44**\nThose who exalt fame and pursue loftiness distance themselves from their own bodies. Those insatiable in wealth and goods diminish themselves. Gaining much profit yet losing one’s life—what is the affliction here? Excessive attachment severs communion with things. Hoarding without distribution invites many seekers and many attackers. Becoming a target for things brings great loss and heavy ruin.\n\n**Chapter 45**\nFollowing things to completion, it does not fix upon a single form—thus it seems incomplete. Perfect fullness adapts to things and gives freely, without attachment or pride—thus it seems empty. Adapting to things in their straightness, straightness is not confined to one—thus it seems bent. Great skill follows nature to create vessels, not contriving strange novelties—thus it seems clumsy. Great eloquence speaks in accord with things, without personal fabrication—thus it seems inarticulate. Restlessness and exhaustion overcome cold; stillness and non-action overcome heat. From this we infer that clarity and stillness are the norm for the world. Stillness preserves the true nature of things; restlessness violates their essence. Thus only through clarity and stillness can one attain all the great qualities above.\n\n**Chapter 46**\nWhen the world follows the Dao, one knows contentment and knows when to stop, seeking nothing from without, each cultivating only their inner self. Thus warhorses are retired to fertilize the fields. When greed and desire are insatiable, the inner self is neglected, and each seeks from without—thus warhorses are bred on the outskirts.\n\n**Chapter 47**\nAffairs have their origins, and things have their masters. Though paths differ, their return is the same. Though thoughts are many, their essence is one. The Dao has its great constancy; principles have their great convergence. Holding to the ancient Dao, one can govern the present. Though dwelling in the present, one can know the beginnings of antiquity. Thus, without looking out the door or peering through the window, one can know all. To seek the One in the many is futile. The Dao cannot be seen, cannot be heard, cannot be grasped. If one knows it, there is no need to step outside. If one does not know it, the farther one goes, the more lost one becomes. Grasping the essence of things, though one does not travel, one’s thoughts can know all. Recognizing the origin of things, though one does not see, the principles of right and wrong can be named. Understanding the nature of things and following it, though one does not act, one brings things to completion.\n\n**Chapter 48**\nThose who strive to advance their abilities and augment their habits strive instead to return to emptiness and nothingness. Action entails loss; thus non-action entails nothing that is not done. Movement is always contingent, self-initiated, and loses the unifying root.\n\n**Chapter 49**\nMovement is always contingent. Each adapts to its use, and goodness is not lost. Do not discard others; each employs their intelligence, all harmonized and desireless like infants. Heaven and earth establish positions, the sage perfects abilities. The people confer abilities upon the capable; the capable provide resources to those who take them. Great ability brings great resources; noble ability brings noble resources. Things have their origins, affairs have their masters. Thus one may wear the imperial crown and fill one’s eyes without fear of deception, stuff one’s ears with silk floss without concern for negligence. Why labor one’s own intelligence to scrutinize the sentiments of the people? When one uses clarity to examine things, things in turn compete to evade that clarity. When one seeks things with distrust, things in turn compete to respond with distrust. The hearts of the world need not be the same; their responses dare not differ. Then none will employ their true feelings. How grave the harm!",
      "overlap_context": "ost,\nand one reaches the limit.\nThough called the One, it extends to three—\nhow much less can the Dao be near when its root is not One?\n\nReduction leads to increase,\nincrease leads to reduction—\nis this empty talk?\nMy teaching does not force others to follow,\nbut employs spontaneity.\nPresenting its ultimate principle,\nfollowing it brings fortune,\ndefying it brings misfortune.\nThus when people instruct one another,\ndefiance invites their own misfortune—\njust as my teaching warns against defiance.",
      "start_char": 9519,
      "end_char": 10336,
      "start_sentence": 386,
      "end_sentence": 407,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.682173013687134,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "．莫大于用其明矣 ．夫（在）［任］智则人之讼．（在）［任］力则人与之争．智不出于人而立乎 讼地则穷矣 ．力不出于人而立乎 争地则危矣 ．未有能使人无用其智力（乎 ）［于］己者也 ．如此则己以一敌人而人以千万敌己也 ．若乃多其法网烦其刑罚塞其径路攻其幽宅．则万物失其自然百姓丧其手足．鸟乱于上鱼乱于下．是以圣人之于天下歙歙焉 心无所主也 ．为天下浑心焉 意无所适莫也 ．无所察焉 百姓何避．无所求焉 百姓何应．无避无应则莫不用其情矣 ．人无为舍其所能而为其所不能．舍其所长而为其所短．如此则言者言其所知行者行其所能．百姓各皆注其耳 目焉 ．吾皆孩之而已．",
      "translated_text": "No harm surpasses employing one's own clarity. When one relies on cunning, others litigate; when one relies on force, others contend. If cunning does not arise from others yet is established on contentious ground, it will be exhausted. If force does not arise from others yet is established on disputed ground, it will be imperiled. Never has there been one who could prevent others from employing their cunning or force against oneself. In this way, one pits oneself alone against others, while others pit their thousands and tens of thousands against oneself.\n\nIf one multiplies legal nets, complicates punishments, blocks pathways, and assaults hidden dwellings, then the myriad things lose their spontaneity, and the people are bereft of their hands and feet. Birds are thrown into chaos above, fish into chaos below. Thus the sage, in governing the world, remains reverently still, with no fixed intent in mind. In treating the world, the sage maintains a unified heart, with no particular inclination. With nothing to scrutinize, what can the people evade? With nothing to seek, how can the people respond? Without evasion or response, none will fail to employ their true feelings.\n\nPeople do not abandon what they can do to do what they cannot, nor forsake their strengths to pursue their weaknesses. In this way, speakers speak of what they know, and actors act on what they can do. The people all direct their ears and eyes accordingly. I simply treat them all as children.",
      "overlap_context": " fill one’s eyes without fear of deception, stuff one’s ears with silk floss without concern for negligence. Why labor one’s own intelligence to scrutinize the sentiments of the people? When one uses clarity to examine things, things in turn compete to evade that clarity. When one seeks things with distrust, things in turn compete to respond with distrust. The hearts of the world need not be the same; their responses dare not differ. Then none will employ their true feelings. How grave the harm!",
      "start_char": 10336,
      "end_char": 10596,
      "start_sentence": 408,
      "end_sentence": 425,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.192981004714966,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "５０章 出生地入死地．十有三犹云十分有三．取其生道全生之极十分有三耳 ．取死之道全死之极亦十分有三耳 ．而民生生之厚．更之无生之地焉 ．全摄生者无以生为生．故无死地也 ．器之害者莫甚乎 （戈兵）［兵戈］．兽之害者莫甚兕虎．而令兵戈无所容其锋刃．虎兕无所措其爪角．斯诚不以欲累其身者也 ．何死地之有乎 ．夫蚖蟺以渊为浅\\而凿穴其中．鹰鹯以山为卑而増巢其上．矰缴不能及网罟不能到．可谓处于无死地矣 ．然而卒以甘饵乃入于无生之地．岂非生生之厚乎 ．故物苟不以求离其本不以欲渝其真．虽入军而不害．陆行而不（可犯）［犯可］也 ．赤子之可则而贵信矣 ．",
      "translated_text": "Chapter 50: Emerging into the realm of life, entering the realm of death. Of ten, three are said to follow the Way of life to its fullest, and three of ten follow the Way of death to its extreme. Yet the people, in their excessive pursuit of life, shift into the realm of no-life. Those who fully preserve life do not treat life as something to be clung to, and thus know no realm of death.\n\nNothing is more harmful than weapons, no beast more perilous than the rhinoceros and tiger. Yet when weapons find no place to lodge their blades, when tigers and rhinos have no ground to set their claws and horns, this is truly not allowing desire to burden the body. How then could there be a realm of death?\n\nThe viper and the eel deem the abyss too shallow and bore their dens within it. The hawk and the kestrel consider the mountain too low and build their nests upon its heights. Arrows and snares cannot reach them, nets and traps cannot ensnare them—one might say they dwell in a realm without death. Yet in the end, drawn by sweet bait, they enter the realm of no-life. Is this not the excess of pursuing life?\n\nThus, if things do not seek to depart from their root, do not allow desire to alter their true nature, then even entering an army they remain unharmed, traveling on land they encounter no danger. The infant’s virtue lies in its simplicity and the value of trust.",
      "overlap_context": "o particular inclination. With nothing to scrutinize, what can the people evade? With nothing to seek, how can the people respond? Without evasion or response, none will fail to employ their true feelings.\n\nPeople do not abandon what they can do to do what they cannot, nor forsake their strengths to pursue their weaknesses. In this way, speakers speak of what they know, and actors act on what they can do. The people all direct their ears and eyes accordingly. I simply treat them all as children.",
      "start_char": 10597,
      "end_char": 10862,
      "start_sentence": 426,
      "end_sentence": 438,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.770174264907837,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "５１章 物生而后畜．畜而后形．形而后成．何由而生道也 ．何得而畜德也 ．何（由）［因］而形物也 ．何使而成势也 ．唯因也 故能无物而不形．唯势也 故能无物而不成．凡物之所以生．功之所以成．皆有所由．有所由焉 则莫不由乎 道也 ．故推而极之亦至道也 ．随其所因故各有称焉 ．道者物之所由也 ．德者物之所得也 ．由之乃得故（曰）不得不（失）［尊］．（尊）［失］之则害［故］不得不贵也 ．（命并作爵）．［亭谓品其形毒］谓成其（实）［质］．各得其庇荫．不伤其体矣 ．为而不有．有德而不知其主也 ．出乎",
      "translated_text": "Chapter 51\n\nThings are born and then nurtured. Nurtured and then formed. Formed and then completed. How do they come to be born by the Dao? How do they come to be nurtured by virtue? By what cause are things formed? By what power are circumstances brought to completion? Only through cause can there be nothing that is not formed. Only through power can there be nothing that is not completed.\n\nAll things by which life arises, all works by which accomplishment is achieved—each has its cause. Where there is cause, there is nothing that does not proceed from the Dao. Thus, tracing it to its ultimate source, one arrives at the Dao.\n\nFollowing their respective causes, things acquire their names. The Dao is that by which things proceed. Virtue is that which things attain. Proceeding from it, they attain—thus it cannot but be honored. To lose it is to invite harm—thus it cannot but be valued.\n\n[Ranking their forms and natures,] it is said to perfect their essence. Each receives its shelter, unharmed in its body.\n\nActing yet not possessing, possessing virtue yet unaware of its source. Emerging from...",
      "overlap_context": "s. Arrows and snares cannot reach them, nets and traps cannot ensnare them—one might say they dwell in a realm without death. Yet in the end, drawn by sweet bait, they enter the realm of no-life. Is this not the excess of pursuing life?\n\nThus, if things do not seek to depart from their root, do not allow desire to alter their true nature, then even entering an army they remain unharmed, traveling on land they encounter no danger. The infant’s virtue lies in its simplicity and the value of trust.",
      "start_char": 10863,
      "end_char": 11098,
      "start_sentence": 439,
      "end_sentence": 456,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.180239200592041,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "幽冥．（是以）［故］谓之玄德也 ． ５２章 ［善始之则善养畜之矣故天下有始则可以为天下母矣］．母本也．子末也．得本以知末．不舍本以逐末也．兑事欲之所由生．门事欲之所从也．无事永逸故终身不勤也．不闭其原而济其事．故虽终身不救．为治之功不在大．见大不明见小乃明．守强不强守柔乃强也．显道以去民迷．不明察也．道之常也． ５３章 言若使我可介然有知．行大道于天下．唯施为（之）是畏也．言大道荡然正平．而民犹尚舍之而不由．好从邪径．况复施为以塞大道之中乎．故曰大道甚夷而民好径．朝宫室也．除洁好也．朝甚除则田甚芜食甚虚．设一而众害生也．凡物不以其道得之则皆邪也．邪则盗也．夸而不以其道得之．［盗夸也贵而不以其道得之］窃位也．故举非道以明．非道则皆盗夸也． ５４章 固其根而后营其末．故不拔也．不贫于多．齐其所能．故不脱也．子孙传此道．以祭祀则不辍也．以身及人也．修之身则真．修之家则有余．修之不废．所施转大．彼皆然也．以天下百姓心观天下之心也．天下之道．逆顺吉凶．亦皆如人之道也．此上之所云也．言吾何以得知天下乎．察己以知之．不求于外也．所谓不出户以知天下者也． ５５章 赤子无求无欲不犯众物．故毒（虫）［螫］之物无犯（之）［于］人也．含德之厚者不犯于物．故无物以损其全也．以柔弱之故故握能周固．作长也．无物以损其身故能全长也．言含德之厚者无物可以损其德渝其真．柔弱不争而不摧折．皆若此也．无争欲之心．故终日出声而不嗄也．物以和为常．故知和则得常也．不皦不昧不温不凉此常也．无形不可得而见．［故曰知常］曰明也．生不可益．益之则夭也．心宜无有使气则强． ５６章 因自然也．造事端也．含守质也．除争原也．无所特显则物无所偏争也．无所特贱则物无所偏耻也．可得而亲则可得而疎也．可得而利则可得而害也．可得而贵则可得而贱也．无物可以加之也． ５７章 以道治国则国平．以正治国则奇（正）［兵］起也 ．以无事则能取天下也 ．上章云．其取天下者．常以无事．及其有事．亦不足以取天下也 ．故以正治国则不足以取天下治以奇用兵也 ．夫以道治国崇本以息末．以正治国立辟以攻末．本不立而末浅．民无所及．故必至于［以］奇用兵也 ．利器凡所以利己之器也 ．民强则国家弱．民多知慧则巧伪生．巧伪生则邪事起．立正欲以息邪而奇兵用．多忌讳欲以耻贫而民弥贫．利器欲以强国者也 而国愈昏（多）［弱］．皆舍本以治末故以致此也 ．上之所欲民从之则也 ．我之所欲唯无欲．而民亦无欲而自朴也 ．此四者崇本以息末也 ．",
      "translated_text": "The obscure and hidden—thus it is called the mysterious virtue.\n\n[As the fifty-second chapter states: \"If one begins well, one may well nurture and cultivate it; thus, having a beginning for all under heaven, one may become the mother of all under heaven.\"] The mother is the root; the child is the branch. Attaining the root, one knows the branch; one does not abandon the root to pursue the branch.\n\nDesire arises from the engagement with affairs; the gate is that through which affairs and desires proceed. Without engaging in affairs, one remains perpetually at ease—thus one labors not throughout life. Not closing the source yet accomplishing one’s tasks—thus, though one may labor throughout life, one is never in distress.\n\nThe efficacy of governance does not lie in grandeur. To see the great is not to see clearly; to see the small is to see clearly. To hold fast to strength is not strength; to hold fast to softness is strength.\n\nManifesting the Dao dispels the people’s confusion—this is due to a lack of discernment. Such is the constancy of the Dao.\n\nAs the fifty-third chapter states: If I were to possess even a modicum of knowledge, I would walk the great Dao under heaven, fearing only the imposition of action. The great Dao is vast, upright, and level—yet the people still abandon it and do not follow, preferring to take devious paths. How much more so when one imposes action to obstruct the great Dao?\n\nThus it is said: The great Dao is exceedingly smooth, yet the people prefer byways. The court is adorned with palaces, and the halls are swept clean—this is excessive refinement. When the court is excessively refined, the fields grow wild, and granaries stand empty. To establish one thing is to give rise to a multitude of harms.\n\nAll things, if not obtained through the Dao, are perverse. What is perverse is theft. To boast without obtaining through the Dao is thieving boastfulness; to covet rank without obtaining through the Dao is usurped position. Thus,举非道以明—what is not the Dao is all thieving boastfulness.\n\nAs the fifty-fourth chapter states: Secure the root, then tend to the branches—thus it cannot be uprooted. Not impoverished by excess, aligning with one’s capacity—thus it does not fail. When descendants transmit this Dao, offering sacrifices, it does not cease.\n\nExtending from oneself to others: Cultivating it in the self, it becomes authentic. Cultivating it in the family, there is abundance. Cultivating it without cessation, the scope of its application grows ever greater. All things are thus.\n\nObserving the hearts of the hundred clans is to observe the heart of all under heaven. The Dao of all under heaven—its reversals and sequences, fortune and misfortune—are all like the Dao of humanity. This is what was stated above.\n\nHow do I come to know all under heaven? By examining myself to know it—not seeking it externally. This is what is meant by \"not leaving one’s door yet knowing all under heaven.\"\n\nAs the fifty-fifth chapter states: The infant seeks nothing, desires nothing, and does not offend the myriad things. Thus, creatures that sting and poison do not harm it. One whose virtue is profoundly accumulated does not offend things—thus nothing can diminish its wholeness.\n\nBy virtue of softness and weakness, its grasp is firm and complete. It grows long because nothing diminishes its body—thus it remains whole and enduring. One whose virtue is profoundly accumulated—nothing can diminish its power or alter its authenticity. Soft and weak, not contending, it is not broken. All is thus.\n\nWithout a heart of contention and desire, one may cry out all day without hoarseness. Things take harmony as their constancy—thus, knowing harmony, one attains constancy. Neither bright nor dim, neither warm nor cool—this is constancy. Without form, it cannot be seen—thus it is called illumination.\n\nLife cannot be augmented; to augment it is to cut it short. The heart should be empty of possession, making the qi strong.\n\nAs the fifty-sixth chapter states: Following nature, initiating no affairs, embracing and guarding authenticity, removing the source of contention—nothing is singled out for display, so things do not contend in bias. Nothing is singled out for contempt, so things do not feel shame in bias.\n\nWhat can be approached may also be distanced; what can be benefited may also be harmed; what can be honored may also be debased. Nothing can be added to it.\n\nAs the fifty-seventh chapter states: Governing the state through the Dao, the state is at peace. Governing the state through rectitude gives rise to extraordinary warfare. Through non-action, one may take all under heaven.\n\nThe preceding chapter states: Those who take all under heaven always do so through non-action. When they engage in action, it is insufficient to take all under heaven. Thus, governing through rectitude is insufficient to take all under heaven—it is governing through the extraordinary use of arms.\n\nGoverning through the Dao exalts the root to still the branches. Governing through rectitude establishes laws to attack the branches. When the root is not established and the branches are shallow, the people have nothing to reach for—thus it must come to the extraordinary use of arms.\n\nSharp instruments are all tools by which one benefits oneself. When the people are strong, the state is weak. When the people possess much knowledge and cunning, deceit and falsehood arise. When deceit and falsehood arise, perverse affairs emerge. Establishing rectitude to quell perversity leads to the use of extraordinary arms. Imposing many prohibitions to shame poverty only makes the people poorer.\n\nSeeking to strengthen the state through sharp instruments only makes the state more benighted and weak. All this is abandoning the root to govern the branches.\n\nWhat the ruler desires, the people follow. What I desire is only non-desire—thus the people also become desireless and return to simplicity. These four are exalting the root to still the branches.",
      "overlap_context": ", one arrives at the Dao.\n\nFollowing their respective causes, things acquire their names. The Dao is that by which things proceed. Virtue is that which things attain. Proceeding from it, they attain—thus it cannot but be honored. To lose it is to invite harm—thus it cannot but be valued.\n\n[Ranking their forms and natures,] it is said to perfect their essence. Each receives its shelter, unharmed in its body.\n\nActing yet not possessing, possessing virtue yet unaware of its source. Emerging from...",
      "start_char": 11098,
      "end_char": 12153,
      "start_sentence": 457,
      "end_sentence": 481,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.291557788848877,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 22,
      "original_text": "５８章 言善治政者无形无名无事无政可举．闷闷然卒至于大治．故曰其政闷闷也 ．其民无所争竞．宽大淳淳也 ．故曰其民淳淳也 ．立刑名明赏罚以检奸伪．故曰［其政］察察也 ．殊类分析．民怀争竞．故曰其民缺缺．言谁知善治之极乎 ．唯无可正举．无可形名．闷闷然而天下大化此其极也 ．以正治国则便复以奇用兵也 ．故曰正复为奇．立善以和万物则便复有妖之患也 ．言人之迷惑失道固久矣 ．不可便正善治以责．以方导物．（舍）［令］去其邪．不以方割物．所谓大方无隅．廉清廉也 ．刿伤也 ．以清廉（清）［导入］民．（令去其邪）令去其污．不以清廉刿伤于物也 ．以直导物令去其僻．治不以直激（沸）［拂］于物也 ．所谓大直若屈也 ．以光鉴其所以迷．不以光照求其隐匿也 ．所谓明道若昧也 ．此皆崇本以息末．不攻而使复之也 ． ５９章",
      "translated_text": "**Chapter 58**\n\nHe who excels in governing does so without form, without name, without affairs, without administration—yet in profound obscurity, he ultimately brings about great order. Thus it is said: \"His governance is obscure.\" His people, having nothing to contend over, are magnanimous and pure. Thus it is said: \"His people are simple.\"\n\nWhen penal codes and names are established, rewards and punishments made clear to restrain deceit and falsehood, it is said: \"[His governance] is meticulous.\" Categories are divided and distinctions drawn, and the people harbor contention. Thus it is said: \"His people are deficient.\"\n\nWho knows the ultimate of good governance? Only when nothing can be corrected or enacted, when nothing can be given form or name—when in profound obscurity the world is transformed—does this reach its ultimate.\n\nTo govern the state by rectitude is to soon revert to the extraordinary use of arms. Thus it is said: \"Rectitude reverts to the extraordinary.\" To establish goodness to harmonize the myriad things is to soon encounter the calamity of portents. This speaks of how long people have been deluded and lost the Dao.\n\nOne cannot immediately impose good governance to demand compliance. To guide things by methods is to command them to abandon their perversity, not to carve them with methods. This is what is called \"the great method has no corners.\"\n\n*Lian* means purity; *gui* means to wound. To guide the people with purity is to command them to abandon their filth, not to wound things with purity. To guide things with uprightness is to command them to abandon their depravity, not to provoke them with uprightness. This is what is called \"the great upright seems bent.\"\n\nTo illuminate their delusions with light is not to expose their hidden faults with light. This is what is called \"the luminous Dao seems dim.\" All these are exalting the root to still the branches, restoring things without attack.\n\n**Chapter 59**",
      "overlap_context": "ctitude to quell perversity leads to the use of extraordinary arms. Imposing many prohibitions to shame poverty only makes the people poorer.\n\nSeeking to strengthen the state through sharp instruments only makes the state more benighted and weak. All this is abandoning the root to govern the branches.\n\nWhat the ruler desires, the people follow. What I desire is only non-desire—thus the people also become desireless and return to simplicity. These four are exalting the root to still the branches.",
      "start_char": 12154,
      "end_char": 12495,
      "start_sentence": 482,
      "end_sentence": 501,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.4976646900177,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 23,
      "original_text": "莫若犹莫过也．啬农夫．农人之治田务去其殊类．归于齐一也．全其自然．不急其荒病．除其所以荒病．上承天命下绥百姓莫过于此．早服常也．唯重积德不欲营速．故曰早服谓之重德者也．道无穷也．以有穷而莅国非能有国也．国之所以安谓之母．重积德是唯图其根．然后营末．乃得其终也． ６０章 不扰也 ．躁则多害静则全真．故其国弥大而其主弥静．然后乃能广得众心矣 ．治大国则若烹小鲜．以道莅天下则其鬼不神也 ．神不害自然也 ．物守自然则神无所加．神无所加则不知神之为神也 ．道洽则神不伤人．神不伤人则不知神之为神．道洽则圣人亦不伤人．圣人不伤人则［亦］不知圣人之为圣也 ．犹云［非独］不知神之为神．亦不知圣人之为圣也 ．夫恃威网以使物者治之衰也 ．使不知神圣之为神圣道之极也 ．神不伤人圣人亦不伤人．圣人不伤人神亦不伤人．故曰两不相伤也 ．神圣合道交归之也 ．",
      "translated_text": "To do nothing is to do no more than is necessary. *Se* means the farmer: the farmer tending his fields removes what is different to return them to uniformity, preserving their natural state. He does not rush to cure their barrenness or disease but removes the causes of barrenness and disease. To receive the Mandate of Heaven above and pacify the hundred clans below, nothing surpasses this.\n\n*Early compliance* means constancy. Only by deeply accumulating virtue does one avoid seeking hasty results. Thus it is said, \"Early compliance is called the accumulation of deep virtue.\" The Dao is inexhaustible. To govern the state with what is finite is not to truly possess the state. What secures a state’s peace is called the *Mother*. Deeply accumulating virtue is to plan for the root; only then does one cultivate the branches and attain their end.\n\n**Chapter 60**\n*Do not disturb.*\n\nAgitation brings much harm; stillness preserves authenticity. Thus, the greater the state, the more still its ruler must be—only then can he broadly win the hearts of the people. Governing a great state is like cooking a small fish. When the Dao presides over the world, its ghosts lose their numinosity. The numinous does not harm the natural; when things guard their natural state, the numinous has no power over them. When the numinous has no power, one does not perceive its numinosity.\n\nWhen the Dao pervades, the numinous does not harm people. When the numinous does not harm people, one does not perceive its numinosity. When the Dao pervades, the sage also does not harm people. When the sage does not harm people, one does not perceive his sagacity. It is as if one does not perceive the numinous as numinous, nor the sage as sage. Relying on nets of power to command things marks the decline of governance. To make people unaware of the numinous or the sage as such—this is the ultimate of the Dao.\n\nThe numinous does not harm people; the sage also does not harm people. When the sage does not harm people, the numinous also does not harm them. Thus it is said, \"The two do not harm each other.\" When the numinous and the sage unite with the Dao, they converge in the same return.",
      "overlap_context": "ity is to command them to abandon their filth, not to wound things with purity. To guide things with uprightness is to command them to abandon their depravity, not to provoke them with uprightness. This is what is called \"the great upright seems bent.\"\n\nTo illuminate their delusions with light is not to expose their hidden faults with light. This is what is called \"the luminous Dao seems dim.\" All these are exalting the root to still the branches, restoring things without attack.\n\n**Chapter 59**",
      "start_char": 12496,
      "end_char": 12862,
      "start_sentence": 502,
      "end_sentence": 515,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.876376628875732,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 24,
      "original_text": "６１章 江海居大而处下则百川流之．大国居大而处下则天下流之．故曰大国［者］下流．天下［之］所归会［者］也．静而不求．物自归之也．以其静故能为下．牝雌也．雄躁动贫欲．雌常以静故能胜雄也．以其静复能为下故物归之也．大国以下犹云以大国下小国．小国则附之．大国纳之也．言唯修卑下然后乃各得其所［欲］．小国修下自全而已．不能令天下归之．大国修下则天下归之．故曰各得其所欲则大者宜为下也． ６２章 奥犹暧也．可得庇荫之辞．宝以为用也．保以全也．言道无所不先．物无有贵于此也．虽有珍宝璧马无以匹之．美言之则可以夺众货之贾．故曰美言可以市也．尊行之则千里之外应之．故曰可以可于人也．不善当保道以免放．言以尊行道也．此道上之所云也．言故立天子置三公尊其位重其人所以为道也．物无有贵于此者．故虽有抱宝璧以先驷马而进之不如坐而进此道也．以求则得求以免则得免．无所而不施故为天下贵也． ６３章 以无为为居．以不言为教．以恬淡为味．治之极也．小怨则不足以报．大怨则天下之所欲诛．顺天下之所同者德也．以圣人之才犹尚难于细易．况非圣人之才而欲忽于此乎．故曰犹难之也． ６４章 以其安不忘危．谋之无功之势．故曰易也 ．虽失无入有．以其微脆之故．未足以兴大功．故易也 ．此四者皆说慎终也 ．不可以无野故而不持．不可以微之故而弗散也 ．无而弗持则生有焉 ．微而不散则生大焉 ．故虑终之患如始之祸．则无败事．谓其安未兆也 ．谓［闭］微脆也 ．当以慎终除微．慎微除乱．而以施为治之．形名执之．反生事原．巧辟滋作．故败失也 ．不慎终也 ．好欲虽微争尚为之兴．难得之货虽细贫盗为之起．不学而能者自然也 ．喻于学者过也 ．故学不学以复众\\人之［所］过． ６５章 明谓多（见）［智］巧诈蔽其朴也．愚谓无知守真顺自然也．多智巧诈故难治也．智犹治也．以智而治国．所以谓之贼者．故谓之智也．民之难治．以其多智也．当务塞兑闭门．令无知无欲．而以智术动民．邪心既动．复以巧术防民之伪．民知其术．（防随）［随防］而避之．思惟密巧．奸伪益滋．故曰以智治国国之贼\\也．稽同也．今古之所同则不可废．能知稽式是谓玄德．玄德深矣远矣．反其真也． ６７章 久矣其细犹曰其细久矣．肖则失其所以为大矣．故曰若肖久矣其细也夫．夫慈以陈则胜以守则固．节俭爱费天下不匮故能广也．唯后外其身．为物所归．然后乃能立成器为天下利．为物之长也．且犹取也．相慜而不避于难故胜也． ６８章 士卒之帅也．武尚先陵人也．后而不先．应而不唱．故不在怒．（不）与争也．用人而不为之下．则力不为用也． ６９章 （彼）［进］遂不止．行谓行陈也．言以谦退爱慈．不敢为物先．用战犹行无行．攘无臂．执无兵．扔无敌也．言无有与之抗也．言吾哀慈谦退．非欲以取强无敌于天下也．不得已而卒至于无敌．斯乃吾之所以为大祸也．宝三宝也．故曰几亡吾宝．抗举也．（加）［若］当也．哀者必相惜而不趣利避害故必胜． ７０章 可不出户窥牖而知．故曰甚易知也．无为而成．故曰甚易行也．惑于躁欲．故曰莫之能知也．明于荣利．故曰莫之能行也．宗万物之（宗）［主］也．万（物）［事］之主也．以其言有宗．事有君之故．故有知之人．不得不知之也．唯深故知之者希也．知我益希．我亦无匹．故曰知我者希则我（者）贵也．被褐者同其尘．怀玉者宝其真也．圣人之所以难知．以其同尘而不殊．怀玉而不渝．",
      "translated_text": "Chapter 61\nThe Yangzi and the sea, vast and lowly, become the gathering place of the hundred rivers. A great state, vast and lowly, becomes the gathering place of the world. Thus it is said, \"A great state is the lower reaches,\" the place where the world converges. Still and not seeking, things naturally return to it. By its stillness it can be lowly. The female is still; the male is restless, impoverished by desire. The female, ever still, thus overcomes the male. By its stillness it can again be lowly, and so things return to it. \"A great state being lowly\" means a great state lowering itself to small states, which then attach themselves to it, while the great state embraces them. It speaks only of cultivating humility, and then each attains what it desires. A small state cultivating humility preserves itself, but cannot make the world return to it. A great state cultivating humility makes the world return to it. Thus it is said, \"Each attains what it desires, so the greater should be lowly.\"\n\nChapter 62\n\"Obscure\" means warmth, an expression of finding shelter and shade. It is treasured for its use, preserved for its wholeness. It speaks of the Dao preceding all things, nothing being more precious than this. Though one possesses treasures, jades, and teams of horses, nothing compares to it. Beautiful words can outvalue the price of many goods, thus it is said, \"Beautiful words can be traded.\" When practiced with reverence, it elicits response from a thousand *li* away, thus it is said, \"It can be offered to others.\" The unworthy, when preserving the Dao, avoid banishment. It speaks of practicing the Dao with reverence. This is what the Dao above alludes to. Thus, establishing the Son of Heaven and appointing the Three Dukes, exalting their positions and honoring their persons, is for the sake of the Dao. Nothing is more precious than this. Therefore, though one advances bearing jades and leading teams of horses, it is not equal to sitting and offering this Dao. By seeking, one obtains what is sought; by avoiding, one obtains what is avoided. As there is nothing to which it does not apply, it is the world’s most precious.\n\nChapter 63\nDwelling in non-action, teaching without words, savoring tranquility—this is the ultimate of governance. Small grudges are not worth repaying; great grudges provoke the world’s desire to punish. Aligning with what the world holds in common is virtue. Even with a sage’s talent, it is still difficult to treat the small as easy. How much more so for one without a sage’s talent who would neglect this? Thus it is said, \"It is still difficult.\"\n\nChapter 64\nBecause it is secure and does not forget danger, planning is effortless. Thus it is said, \"easy.\" Though one loses, it does not enter into existence. Because it is subtle and fragile, it is insufficient to accomplish great deeds. Thus it is said, \"easy.\" These four all speak of being cautious to the end. One cannot, because it is not wild, fail to grasp it; nor, because it is subtle, fail to scatter it. Without grasping, existence arises; without scattering, greatness arises. Thus, contemplating the calamity of the end as the disaster of the beginning ensures no failure. It speaks of security before signs appear, of closing off what is subtle and fragile. One should be cautious to the end to eliminate the subtle, cautious of the subtle to eliminate disorder, and govern through action. Grasping forms and names reverses the origin of affairs; crafty evasions multiply. Thus failure and loss arise from not being cautious to the end. Though desires are subtle, contention and strife arise from them; though rare goods are small, poverty and theft arise from them. What one can do without learning is natural; it is a metaphor for the excesses of the learned. Thus, learning what is not learned restores the excesses of others.\n\nChapter 65\n\"Enlightened\" means much knowledge, craftiness, and deceit obscuring one’s simplicity. \"Foolish\" means being without knowledge, preserving the real, and following nature. Much knowledge and crafty deceit make governance difficult. \"Knowledge\" is like \"governance.\" Governing the state with knowledge is what is called \"banditry.\" Thus it is said, \"knowledge.\" The people are difficult to govern because of their much knowledge. One should block the openings and close the gates, causing them to be without knowledge and desire. Yet when one moves the people with clever techniques, their devious minds are already stirred. Then, using crafty methods to guard against the people’s falsity, the people, knowing these methods, follow and evade them. Their thoughts become secret and cunning, and deceit and falsity grow ever more. Thus it is said, \"Governing the state with knowledge is the state’s banditry.\" \"Examining\" means sameness. What is the same in past and present cannot be abandoned. To know the examined model is called \"mysterious virtue.\" Mysterious virtue is deep and far-reaching, returning to the real.\n\nChapter 67\n\"It has long been small\"—it is as if it has long been small. If it resembles [the small], it loses what makes it great. Thus it is said, \"If it resembles [the small], it has long been small.\" Now, with compassion, when deployed, it wins; when guarded, it is firm. Frugality and thrift cherish resources, so the world does not lack, and thus it can be vast. Only by putting oneself last and outside does one become the return of things, and only then can one establish vessels and benefit the world, becoming the leader of things. Moreover, it is like taking. They pity each other and do not avoid difficulty, thus they win.\n\nChapter 68\nThe leader of soldiers values not being first to overrun others. Being last and not first, responding and not initiating, thus not acting in anger, not contending. Using others without being lowly toward them means their strength will not be employed.\n\nChapter 69\nAdvancing relentlessly, \"marching\" means deploying formations. It speaks of being humble, compassionate, and not daring to be first. In war, it is like marching without marching, repelling without arms, wielding without weapons, and throwing without an enemy. It speaks of having no one to oppose it. It speaks of my compassion and humility, not desiring to take strength or be without enemy in the world. Unavoidably, it ends in being without enemy—this is precisely my great calamity. The three treasures are treasured. Thus it is said, \"I nearly lost my treasures.\" \"Resisting\" means encountering. The compassionate must cherish each other and not pursue profit or avoid harm, thus they must win.\n\nChapter 70\nOne can know without looking out the door or window. Thus it is said, \"very easy to know.\" It is accomplished without action. Thus it is said, \"very easy to practice.\" Deluded by restlessness and desire, thus it is said, \"none can know it.\" Enlightened by glory and profit, thus it is said, \"none can practice it.\" It is the ancestor of the myriad things, the lord of the myriad affairs. Because its words have an ancestor and its affairs have a lord, thus those who know it cannot but know it. Only because it is profound do those who know it become rare. Those who know me become rarer still; I too have no match. Thus it is said, \"Those who know me are rare, thus I am precious.\" Wearing coarse cloth blends with the dust; holding jade treasures its reality. The reason the sage is difficult to know is blending with the dust without distinction and holding jade without change.",
      "overlap_context": "ve the numinous as numinous, nor the sage as sage. Relying on nets of power to command things marks the decline of governance. To make people unaware of the numinous or the sage as such—this is the ultimate of the Dao.\n\nThe numinous does not harm people; the sage also does not harm people. When the sage does not harm people, the numinous also does not harm them. Thus it is said, \"The two do not harm each other.\" When the numinous and the sage unite with the Dao, they converge in the same return.",
      "start_char": 12863,
      "end_char": 14272,
      "start_sentence": 516,
      "end_sentence": 545,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.54130816459656,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 25,
      "original_text": "７１章 故难知而为贵也．不知知之不足任则病也． ７２章 清（净）［静］无为谓之居．谦后不盈谓之生．离其清（净）［静］．行其躁欲．弃其谦后．任其威权．则物扰而民弹僻．威不能复制民．民不能堪其威．则上下大溃矣．天诛将至．故曰民不畏威则大威至．无狎其所居．无厌其所生．言威力不可任也．不自厌也．不自厌是以天下莫之厌．不自见其所知．以耀光行威也．自贵则（物）［将］狎（厌居）［居厌］生． ７３章 必不得其死也．必齐命也．俱勇而所施者异．利害不同．故曰惑利惑害也．孰谁也．言谁能知天（天下之所恶）意（故）邪．其唯圣人［也］．夫圣人之明．犹难于勇敢．况无圣人之明而欲行之也．故曰犹难之也．（天）［夫］唯不争．故天下莫能与之争．顺则吉逆则凶．不言而善应也．处下则物自归．垂象而见吉凶．先事而设诚．安而不忘危．未（召）［兆］而谋\\之．故曰 繟（弹）然而善谋也． ７４章 诡异乱群谓之奇也．为逆顺者之所恶忿也．不仁者人之所疾也．故曰常有司杀也． ７６章 强兵以暴于天下者物之所恶也．故必不得胜．物所加也．木之本也．枝条是也． ７７章 与天地合德．乃能包之如天之道．如人之量则各有其身．不得相均．如惟无身无私乎．自然然后乃能与天地合德．言（唯）［谁］能处盈而然虚．损有以补无．和光同尘．荡而均者．唯（其）［有］道［者］也．是以圣人不欲示其贤．以均天下． ７８章 以用也．其谓水也．言用水之柔弱无物可以易之也．",
      "translated_text": "Chapter 71\nThus, being difficult to know makes it precious. Not knowing that knowledge is insufficient to be entrusted is a flaw.\n\nChapter 72\nAbiding in clarity and quiescence, non-action—this is called dwelling. Humbling oneself and never overreaching—this is called living. Abandoning clarity and quiescence, acting on restlessness and desire, forsaking humility, wielding power and authority—then things are disturbed and the people grow perverse. Authority can no longer restrain the people; the people cannot endure such authority. Then above and below collapse utterly. Heaven’s punishment will arrive. Thus it is said, “When the people do not fear authority, great authority arrives.” Do not encroach upon their dwelling, do not oppress their living. This means power must not be wielded. Not oppressing oneself—because one does not oppress oneself, none in the world can oppress him. Not displaying what one knows to flaunt brilliance and wield power—self-importance leads others to encroach upon his dwelling and oppress his living.\n\nChapter 73\nNecessarily one will not die a natural death. Necessarily one will meet a uniform fate. Both are brave, yet what they apply it to differs; benefit and harm are not the same. Thus it is said, “Confused by benefit, confused by harm.” Who is it? This means, who can know the intent of Heaven (what all under Heaven detest)? Only the sage. Yet even the sage’s clarity finds bravery difficult—how much more so for one without the sage’s clarity who wishes to act on it. Thus it is said, “It is still difficult.” Only by not contending does none in the world contend with him. Following brings fortune, opposing brings misfortune. Though silent, he responds with goodness. Abiding below, things naturally return to him. Manifesting images, he reveals fortune and misfortune. Before matters arise, he establishes sincerity. At peace, he does not forget danger. Before signs appear, he plans for them. Thus it is said, “Spontaneously, he plans well.”\n\nChapter 74\nDeviant and strange, disrupting the multitude—this is called the uncanny. Those who act against the proper order are detested and resented. The unbenevolent are what people abhor. Thus it is said, “There is always an official executioner.”\n\nChapter 76\nThose who deploy strong armies with violence in the world are what all things detest. Thus they necessarily cannot prevail. What is applied to them—this is the root of the tree; branches and twigs are that.\n\nChapter 77\nHarmonizing virtue with Heaven and Earth, one can embrace it like the Dao of Heaven. Like human capacity, each has its own body and cannot be made equal. Only by having no self and no selfishness can one naturally harmonize virtue with Heaven and Earth. This means, who can be full yet act empty, reduce the excessive to supplement the deficient, blend radiance and merge with the dust, level and equalize? Only one who possesses the Dao. Thus the sage does not wish to display his worth in order to equalize all under Heaven.\n\nChapter 78\nIn application—this refers to water. It means that in using water’s softness and weakness, nothing can replace it.",
      "overlap_context": "fairs. Because its words have an ancestor and its affairs have a lord, thus those who know it cannot but know it. Only because it is profound do those who know it become rare. Those who know me become rarer still; I too have no match. Thus it is said, \"Those who know me are rare, thus I am precious.\" Wearing coarse cloth blends with the dust; holding jade treasures its reality. The reason the sage is difficult to know is blending with the dust without distinction and holding jade without change.",
      "start_char": 14273,
      "end_char": 14909,
      "start_sentence": 546,
      "end_sentence": 559,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.864501953125,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 26,
      "original_text": "７９章 不明理其契．以致大怨已至．而德［以］和之．其伤不复．故［必］有余怨也．左契防怨之由生也．有德之人．念思其契．不（念）［令］怨生而后责于人也．彻司人之过也． ８０章 国既小．民又寡．尚可使反古．况国大民众乎．故举小国而言也．言使民虽有什伯之器．而无所用．何患不足也．使民不用．惟身是宝．不贪货赂．故各安其居．重死而不远徙也．无所欲求． ８１章 实在质也．本在朴也．极在一也．无私而有．唯善是与．任物而已．物所尊也．物所归也．动常生成之也．顺天之利不相伤也．",
      "translated_text": "**Chapter 79**\nNot understanding the covenant’s principle, one invites great resentment to arise. Though virtue may later harmonize it, the wound cannot be undone. Thus there must remain residual grievance. The left tally prevents the origin of resentment. One of virtue contemplates the covenant, ensuring no grievance arises before holding others accountable. This is to thoroughly examine others’ transgressions.\n\n**Chapter 80**\nThough the state be small and its people few, it may yet return to antiquity—how much more so for a large state with many people? Thus I speak of a small state: though the people possess tools of ten or a hundred, they have no use for them. What worry is there of insufficiency? Let the people not employ them, valuing only their own bodies and treasuring no goods or bribes. Thus each dwells securely in their place, prizing life and not migrating far. They have no desires to seek.\n\n**Chapter 81**\nTruth lies in substance, the root in simplicity, the utmost in oneness. Without self yet possessing, only goodness is bestowed, letting things be as they are. What things honor, what they return to—movement constantly generates and completes them. Following Heaven’s benefit, they do not harm one another.",
      "overlap_context": " Only by having no self and no selfishness can one naturally harmonize virtue with Heaven and Earth. This means, who can be full yet act empty, reduce the excessive to supplement the deficient, blend radiance and merge with the dust, level and equalize? Only one who possesses the Dao. Thus the sage does not wish to display his worth in order to equalize all under Heaven.\n\nChapter 78\nIn application—this refers to water. It means that in using water’s softness and weakness, nothing can replace it.",
      "start_char": 14910,
      "end_char": 15159,
      "start_sentence": 560,
      "end_sentence": 565,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.1060192584991455,
      "metadata": {
        "source_file": "dao\\藏外\\王弼老子注.txt",
        "category": "藏外"
      }
    }
  ]
}