{
  "source_id": "男女丹工异同辩",
  "source_file": "chunked_daozang\\男女丹工异同辩.json",
  "total_chunks": 7,
  "total_original_chars": 5905,
  "total_translated_chars": 30891,
  "total_translation_time": 159.55551624298096,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\男女丹工异同辩.txt",
    "category": "藏外"
  },
  "full_translation": "**Discourse on the Similarities and Differences in the Alchemical Arts for Men and Women**\n*Compiled by Yan Zehuan of Zhuyang, Woman Historian of the Yanclean Era*\n*Collated and Annotated by He Weilie of Xianjing, Woman Historian of Unblemished Chastity*\n*Revised and Edited by Chen Yingning of Wanjian*\n\n**Reader’s Notice:**\n\n1. This book was composed in the *guimao* year of the Guangxu reign (1903), eight years prior to the founding of the Republic of China.\n\n2. The author was a woman who remained unwed all her life, devotedly filial to her mother, who herself observed widow’s chastity. Both mother and daughter were devoted to the Dao, yet lacking a teacher, they gleaned oral instructions from various alchemical texts. At her mother’s behest, the author compiled this work, drawing entirely from excerpts of other *danjing* (alchemical classics), rather than composing it herself.\n\n3. The texts excerpted vary in quality; thus, their theories occasionally contradict one another, and their prose is often verbose. Though some revisions were made, the original intent could not be entirely altered. Scholars must employ their own discernment when studying it.\n\n4. Terms such as \"Ancient Mother Xiangyi,\" \"Supreme Emperor of the Dark Heavens,\" \"Jade Emperor of the Golden Palace,\" \"Queen Mother of the Jasper Pool,\" and \"Daoist Matriarch of Perfect Clarity\" are all fictitious names borrowed from other texts. In this age of dispelling superstition, such appellations ought not to be used, yet they are retained here as they appear in the original.\n\n5. The book asserts that a woman’s alchemical attainment requires awaiting \"transmission\" (*daidu*), a theory that is far from satisfactory. This stems from the old custom of valuing men over women. Most religious institutions worldwide deny equality between the sexes—not solely in China. Only when women of exceptional talent emerge can such conventions be broken.\n\n6. In the section attributed to the \"Jade Emperor of the Golden Palace,\" he states: *\"Some claim that unless the Red Dragon is severed, the elixir cannot form and the Dao cannot be realized. Yet if the blood is exhausted, so too is the qi. Just as a man’s essence decays and his elixir becomes difficult to refine, the principle is the same. For men’s essence and women’s blood must not be entirely cut off. Qi arises from blood, and when blood transforms into qi, essence flows freely. If one insists that blood must be exhausted to refine the elixir, why do young women with blood depletion fall ill instead? This alone proves that blood cannot be entirely forsaken.\"*\n\n   **Note:** Severing the Red Dragon refers to the practice of refining and halting menstruation through cultivation, not to blood depletion in women. To equate severing the Red Dragon with blood exhaustion or desiccation is to mistake it for the pathology of *ganxuelao* (consumptive blood depletion). If a woman truly suffers from this condition, she must employ special methods—combined with medical treatment—to restore her menstrual cycle to its regular, healthy state before gradually refining and halting it according to the oral instructions for severing the Dragon. This gentleman’s conflation of the effects of severing the Red Dragon with *ganxuelao* is a grave error.\n\n7. The differing methods for men and women in the initial stages of cultivation arise from physiological distinctions. If a woman wishes to enter the Dao, she must first acquire a foundational understanding of medicine before undertaking practice, lest she err in her approach. No true student of immortality neglects the study of medicine—this is a concrete principle, not to be dismissed as mere abstruse theory or lofty discourse on nature and mind.\n\n8. Regardless of sex, those incapable of conceiving mortal offspring will never attain the hope of forming an immortal embryo. The principles of human birth and immortal transformation are fundamentally the same; the difference lies solely in whether one follows or reverses the natural course. Severing the Red Dragon is a reversal of creation’s flow. If one mistakenly believes that the cessation of menstruation alone suffices for immortality, then women over fifty—whose menses naturally cease—would all possess the qualifications of immortals. If one argues that the elderly are a special case, what of modern young women who undergo surgical removal of the uterus or ovaries, thereby naturally halting menstruation? Can this be deemed severing the Red Dragon? Such matters demand profound investigation.\n\n   *October, Year 24 of the Republic of China (1935), Year 4632 of the Yellow Emperor’s Calendar.*\n\n**Inscription by Chen Yingning of Wanjiang**\n\n**Preface**\n\nZe-huan lost her father in early youth. Her mother, steadfast in widowhood, had no sons, and only we three sisters remained. Soon after, my second sister passed away, and my third sister was betrothed, awaiting marriage. Unwilling to bear my mother’s lonely suffering in widowhood, Ze-huan vowed to remain chaste and serve her, swearing never to marry. At the age of twelve, I began to observe vegetarian precepts alongside my mother, finding solace in reciting *Songs of Exhortation to Goodness*. I often admired the accounts of cultivation in moral tracts—the beauty of self-cultivation, the nobility of immortals and buddhas—yet lamented the lack of an enlightened teacher to guide me in the secrets, and the absence of alchemical scriptures to verify my own experience. For nearly a decade, I silently entreated the heavens for karmic affinity.\n\nThen, in the summer of *gengzi* (1900), the turmoil in the capital of Kyoto struck. Escorting my mother, we took refuge on Mount E, where I first learned of Buddhist texts on female cultivation: the *Sutra of Lady Malla*, the *Sutra of Mātanga-girl*, the *Sutra of the Daughter of Anāthapiṇḍada*, the *Biographies of Bhikṣuṇīs*, and the *Biographies of Virtuous Women*—a mere drop in the vast ocean. Later, I obtained *The Mani Candle Illuminating the Earth*, a collection of over seventy works compiled by Lady Rushan, a *upāsikā* named Shanyi. Yet the Buddhist canon is profound, emphasizing nature over life-destiny, and not readily accessible to beginners.\n\nAs for Daoist texts on female elixir (*nüdan*), they are often scattered within the *Daoist Canon*, without order or dedicated volumes—an endless sea, leaving one overwhelmed. Undeterred by my own inadequacy, I excised and compiled passages on female elixir from the sacred scriptures, gathering over a hundred pages. I explained them to my mother, both to dispel her solitude and to encourage her hidden cultivation. Beyond serving her with filial devotion, I followed her command to extract the differences and similarities between male and female alchemical practice from my collection, transcribing them into a separate volume of over five thousand characters. I titled it *On the Differences and Similarities in Male and Female Elixir Work*, placing it by my side to prevent confusion in practice, which might otherwise lead to strange illnesses. I cannot escape the charge of superficiality, but if fellow seekers find value in it, how could I dare withhold it?\n\n*Spring of the *guimao* year of the Guangxu reign (1903), recorded by Yan Ze-huan, the Bamboo Grove Historian, in her leisure.*\n\n**On the Differences and Similarities in Male and Female Elixir Work**\n*Compiled and Narrated by Yan Ze-huan, the Bamboo Grove Historian*\n*Collated by He Weilié Quanzhen, the Immortal Well Historian*\n*Revised and Edited by Chen Yingning of Wanjiang*\n\nMaster Sun Yuan’s *Commentary on the Kun Decisions* states:\nThe *Tuan* says: “Supreme is the Kun’s primordial power—all things draw upon it for life.”\nKun belongs to old yin; when yin reaches its extreme, yang is born. In following Heaven, it gives life to humans and creatures; in following the self, it completes the Dao and attains perfection.\n\nAncient Mother Xiang Yi says:\nIn all cases, men’s cultivation begins with the initial work of refining and laying the foundation. For women’s cultivation, however, it differs from men’s. In men, yang descends and disperses; in women, yang ascends. Men’s bodies are firm; women’s bodies are soft. Men use the yang essence of the cinnabar field, constantly preserving and guarding it to prevent external leakage. After long accumulation, they employ fire to refine it, transmuting essence into qi, qi into spirit, and spirit into emptiness. Progressing step by step, once the work is complete, they ascend in flight. Women, however, are different. Women are inherently bodies of yin turbidity and blood and flesh. They use the numinous fat of the breasts to transform their qi and disposition. Through prolonged refinement, naturally the red reverses to white, and blood transmutes into qi. Once blood has become qi, they too employ fire talismans to refine it, enabling qi to revert to pure yang, completing the Dao and returning to truth.\n\nIn women’s initial work, they first refine the physical form, then refine the original essence. This is unlike men’s work, which first refines the original essence, then the physical form. Their bodies differ, so their work naturally varies. If one does not distinguish the teachings by category, how can one harmonize yin and yang and enable men and women to aid one another?\n\nYet since the body is already ours, why refine it? Women’s bodies are originally yin turbidity, unlike men’s bodies, which inherently possess yang firmness. Without refinement, blood cannot be transmuted into qi—how then can one conceive the primordial or produce true qi? Without true qi, one remains a mass of pure yin—how could one attain the returned elixir and accomplish the great Dao? Thus, a woman’s form must first be refined before it is viable.\n\nThe Dao of female immortals fundamentally differs from men’s work. Men’s Dao values the refinement of the medicine; thus, the earlier stages of work are explained step by step. If one practices diligently day and night with sincere progress, the blood in the five viscera will all revert to qi, naturally transforming and generating. When true qi arises in concealment, the turbid yin body is transmuted into pure yang. Only at this stage can one employ fire and enact talismans, becoming equal to men.\n\nIf one does not distinguish the teachings by category, how can the work succeed? Thus, men first refine the medicine, then the form; women first refine the form, then the medicine. Because their bodies differ, the sequence of work also varies. In establishing teachings for others, I must clearly instruct so that learners do not suffer deficiencies.\n\nThe principles of female elixir cultivation are not inherently complex, and their practice is not difficult. The reason most elixir classics do not transmit women’s cultivation is that they fail to address both men and women. In offering teachings now, I truly wish for both men and women to cross over together. Thus, following the elixir texts, I append *Ten Principles of the Female Dao* to guide those of karmic affinity.\n\nWhy is the Dao of the female elixir so simple and uncluttered? Women’s nature is pure and whole; women’s bodies are tranquil and serene. With just a little work, they can achieve thorough accomplishment. Unlike men, whose thoughts are often biased and deviant, their bodies and minds differ in what they value. Women’s work is swifter than men’s.\n\nFrom nurturing the true to embryonic breathing, women’s work has already achieved two-thirds of the process. Unlike men’s work, which requires many operations to reach the stage of harmonizing the spirit, in female elixir texts, from nurturing the embryo to embryonic breathing, once the work is complete, one proceeds to external cultivation. Only when external cultivation is abundant can one refine the stage of harmonizing the spirit.\n\nWhy must female immortals, once cultivated, await deliverance? Because their bodies of weak blood rely on internal work to refine and become yang bodies. Though the body has become yang, the congealed yin nature has not yet been fully refined. Thus, women’s work lacks the final stage of returning to emptiness, unable to fully manifest the wondrous transformations of Heaven and Earth. The reason they cannot transcend the world is entirely due to the fragility of their bodies. Unlike men, whose bodies are refined into indestructible vajra forms, with the work of returning to emptiness complete, their spirit-light fills Heaven and Earth. Thus, they do not need to await deliverance to complete the Dao, attain perfection, personally attend the Celestial Emperor, and wander at leisure in Penglai.\n\nWomen, however, are different. Once the female elixir is cultivated, they must broadly perform meritorious deeds. Only when their merit is complete, seen and pitied by the upper sages, who then memorialize the Celestial Emperor, will an imperial edict be issued and a golden decree selected, certifying the supreme Dao fruit of humanity and Heaven. Otherwise, they will merely become solitary immortals.\n\nMaster Lü says:\n“Refining the form in the Great Yin differs only slightly from men’s cultivation. The initial work begins with severing the Red Dragon. Thereafter, ten months of work bring the yang spirit to manifestation, shattering emptiness. The path of cultivation is the same as men’s, with no distinction between them.”\n\nThe Daoist of Sui Mountain says:\n“Once the Red Dragon is severed, the nipples retract like a man’s, and the true yin qi transforms into true yang. Thereafter, the work is no different from men’s. But since women belong to the tranquil body, though the latter four stages share the same operations as men’s elixir, their achievements are even swifter.”\n\nMaster Lü says:\n“Men’s cultivation subdues the White Tiger; women’s cultivation severs the Red Dragon.”\n\nThe *Three Mandates Chapter* says:\n“Men’s mandate lies in the cinnabar field—the cinnabar field is the true earth that generates the elixir.”\n\nThe female mandate lies in the breasts, for the breasts are the essence of the mother-qi’s Wood.\n\nIt is also said: “Women take blood as their kidneys, which are hollow cavities. After forty-nine years, the waist dries and blood withers, leaving no vitality. Yet with long nurturing, the primal blood regenerates, as in a maiden—this is the marvel of creating something from nothing. When this ‘something’ appears, a single severing transforms it, and life is born. From this point onward, the work of cultivating both nature and life is the same as men’s.”\n\nMaster Lazy Daoist says: “Why are there three mandates for women? They are the upper, middle, and lower. The upper is the yang cavity, the middle is the Yellow Chamber, and the lower is the cinnabar field. In youth, one begins from the upper; in decline, from the middle; and only at maturity, from the lower. Moreover, women are inwardly yang and outwardly yin, so they must first sever the Red Dragon to preserve their body, whereupon *kan* transforms into *qian*. Thereafter, they employ the same work as men, achieving success in a single year, for the golden elixir resides within.”\n\nThe *Inquiries on Cultivating the Dao* asks: “How do the starting points differ for men and women?”\nThe answer: “Men begin by refining qi as the essential task, while women begin by refining form. Refining qi means subduing one’s qi, and subduing qi requires its return. When qi returns, emptiness reaches its extreme and stillness becomes profound, root and life are restored, and the White Tiger is subdued. Refining form means concealing one’s form, and concealing form requires its dissolution. When form dissolves, the Four Great enter emptiness, the limbs decay, and the Red Channel is severed. When men subdue the White Tiger, they revert to a youthful body, and the post-heaven essence no longer leaks, allowing the elixir to coalesce and years to be extended. When women sever the Red Dragon, they likewise revert to a youthful body, and the impure yin blood no longer descends, allowing them to escape death and enter life. Thus, men’s cultivation is called ‘Great Yang Refining Qi,’ while women’s cultivation is called ‘Great Yin Refining Form.’”\n\nIt is further asked: “Do women refining form not subdue qi?”\nThe answer: “Women are yin by nature, so their qi is easily subdued, but the Red Channel is most harmful to the Dao. This is their crucial point, so they begin by applying effort where it matters most. Once the Red Channel is severed, qi naturally becomes docile—not like men, who are yang by nature and whose qi is difficult to subdue. For example, while men require three years to subdue qi, women can achieve it in one. If a woman is truly a hero among women, receives her master’s oral instructions, and practices the Great Yin Refining Form method, she may attain the Dao in three to five years, with less effort than men. Yet such heroines among women are exceedingly rare. Only those whose fortitude exceeds a man’s by a hundredfold can succeed. Those equal in strength to men cannot achieve it at all.”\n\nAnother asked, “The Great Dao makes no distinction between men and women—why then are there differences between them?”\n\nThe answer came: “The Dao is the same, but its application differs. This is because their inherent natures are not alike, and their physical forms are distinct. Thus, though the Way of cultivating life and destiny is one, the methods of practice vary greatly.”\n\nThe Dark-Heaven Thearch said:\nThe *Book of Changes* states, “Qian is the father, Kun the mother,” making the principle of yin and yang abundantly clear. Only after heaven and earth exist do men and women arise, so the Way of yin and yang is self-evident. Thus, it is manifest that heaven and earth cannot be without men and women. Men receive the transformations of Qian and Kun to form their image, while women inherit the harmonious union of Qian and Kun to take their shape. All who possess these forms are endowed with the qi of Qian and Kun, and together they stand within the cosmos.\n\nNow, in this era of compassionate ferrying and universal salvation, when the precious raft is shared by all, the teachings for men are manifold—how could we abandon the Kun axis and pay it no heed? The profound and wondrous instructions for men fill libraries to overflowing, while the models and standards for women are few and far between. Moved by deep sorrow, I speak of this alone.\n\nIn men, qi within essence courses through the *xiezi*; in women, qi within blood warms the *xiezi*. When the *xiezi* is full, the lotus aperture is full; when the lotus aperture is full, the drawing and replenishing begin to move; when drawing and replenishing move, the sweet dew first descends.\n\nMen’s essence is abundant in qi; women’s blood is meager in qi—hence they are called yang in men and yin in women. Those who cultivate our Way take cutting off the seven emotions as their foundation and severing the six desires as their priority. Thus, their faint qi often surpasses that of men. Why? Men’s minds are easily stirred, while women’s thoughts are somewhat still. When stirred, qi is easily lost; when still, qi is easily nurtured. In men, the seven lotuses are easy to gather but hard to release; in women, they are easy to release but hard to gather. If one can remain truly unwavering in resolve, without waiting three to five years, sweet dew will descend constantly, and the seven lotuses will remain open. If opening is easy, how could gathering be difficult? The distinction between men and women is clear here.\n\nYet when texts speak of emptiness, void, mystery, subtlety, spirit, or transformation, these are the great commonalities of men and women. Men speak of the “embryo,” while women do not use the term “embryo” but simply call it “breathing.” This is to prevent later generations from misconstruing the word “embryo” and ultimately suffering false accusations. Moreover, when a man’s spirit departs, it must reach pure yang before the shell can be shed, for yang contains yin. A woman’s spirit departs differently. When she attains the three yangs, she can already transcend a hundred leagues; when she reaches the meeting of the pure and old two yangs, her departure is permanent, with no risk of premature demise. This is because men contain yin within yang, while women contain yang within yin. In men, yin is within and yang without; in women, yin is without and yang within. When yang prevails, all yin readily retreats.\n\nI now spare no true transmission, revealing this here, solely in the earnest hope that many may swiftly realize their true resolve.\n\nThe Golden Tower Lord said:\nFrom a broad perspective, the hundred vessels all emerge from the formless Ultimate; in finer detail, they belong to the formless and imageless, yet originally encompass all transformations. Both men and women share this supreme treasure—only the two paths of blood and essence differ. Men’s essence ascends in reversal to become immortals; women’s blood rises straight to the heart aperture. Thus, each has its own method, each its own illumination.\n\nThe elixir in men is formed by essence transforming into qi, qi into spirit, spirit into emptiness. When emptiness reaches its extreme and stillness is profound, the elixir naturally coalesces. The elixir in women is formed by blood transforming into qi, qi into spirit, spirit into emptiness. When emptiness is natural, the elixir naturally forms.\n\nSome say that without severing the Red Dragon, the elixir cannot form and the Dao cannot be achieved. They do not realize that when blood is exhausted, qi is also exhausted—just as when a man’s essence decays, the elixir is difficult to form. The principle is the same. For essence in men and blood in women cannot be entirely cut off. When qi departs from blood, qi has no source; when blood transforms into qi, essence begins to flow. If one claims to refine the elixir only after blood is exhausted, why do young women whose blood is depleted instead fall ill? This ultimately proves that blood cannot be abandoned.\n\nThe Queen Mother of the Jasper Pool said:\n“Women’s practice shares much with men’s—only the stages differ, and the ground is not mysterious. All wondrous transformations are no different from men’s. You must deeply awaken to this. The texts hold the complete record, without the slightest error. Each must cultivate in seclusion.”\n\nRound Bright Dao Mother said:\n“I shall now reveal the truth to spare you from suffering wrongful karma. The paths of yin and yang are apportioned—men and women share one principle. Men possess this ancestral qi, distributed within essence and blood. Women’s ancestral qi converges, spoken of as arising from the Sea of Blood. Men have this yang pass, its flow and reversal requiring no confusion. Women have the Northern Sea’s terrain, its waves surging as if pressed by water. White Lotus Perfected One said: ‘The terrain of the Golden Elixir differs for men and women, yet the principle of yin and yang is truly the same. Clarity of mind and few desires are the root; to lay the foundation, first sever the Red Dragon.’\n\nMaster Wu Xin said:\n“Men’s essence is yang within yin; women’s essence is yin within yang. Swiftly seek a luminous teacher to receive instruction, and return to youth in your native land. If the Heavenly Heart of seven days can be restored, this is the supreme wondrous technique. Thereafter, the work is the same as for men—every oral instruction must be taught by the master.”\n\nLüzu said:\n“Women’s cultivation is like men’s in every way; what is difficult to attain is purity. Know that women’s desires exceed men’s. When the menstrual flow has ceased, their hearts are like lotuses just opening, riding heaven’s rain and dew to bear fruit. If a woman has no man, she is solitary yin. Master Zhen Yi said: ‘The Great Dao makes no distinction between men and women—all may achieve completion. Thus, when a man perfects the Dao, he becomes a Perfected One; when a woman perfects it, she becomes a Yuanjun. From ancient times, alchemical texts have described men’s cultivation in exhaustive detail, while women’s practice is rarely addressed. When it is mentioned, only a glimpse is offered—not out of disdain for women’s cultivation. The underlying assumption is that humans share the same nature and life, thus the same work; speak of men’s practice, and women’s work need not be elaborated. Yet men are yang without and yin within, while women are yin without and yang within. Their inherent natures differ, their forms are distinct. Though they share the same nature and life, their methods of practice differ greatly.’\n\n*The Discernment of Cultivating the Real* states: ‘Men begin with refining qi as essential; women begin with refining form as essential.’ Xu Zu said: ‘When men cultivate, they achieve non-leakage of essence; when women cultivate, they achieve non-leakage of menses.’ Their initial barriers are entirely distinct. Yet in refining the self, obtaining the medicine, returning the elixir, warming and nourishing, and forming the embryo to release the spirit, though similar to men’s, the subtle sequences may still differ in major and minor ways.\n\nIn the spring of the *renchen* year, a woman of the *kun* trigram sought the Dao. Having read many ancient books, I verified what she had been taught. Yet alchemical texts say: ‘Works on women’s practice are uniquely scarce, making it difficult to examine differences.’ Thus, undeterred by the transgression of revealing heavenly secrets, I set down in writing the ways in which they are the same and the ways they differ, arranging each step in order to serve as a guide for those seeking the ford. Let them follow the text to interpret its meaning, avoiding the confusion of fish eyes with pearls. If one can deeply understand and vigorously practice, one may achieve the supreme and ultimate Dao, and at the assemblies of the Jasper Pool, it will be no difficulty to join the male immortals in paying homage to Lord Mu and together attend the Golden Mother.\n\nHeaven is yang, earth is yin; *qian* is firm, *kun* is yielding. Yin cannot grow without yang; yang cannot be born without yin. When firmness and softness achieve harmony, water and fire can then achieve mutual completion. Yin and yang must have their counterparts, and from this, humans and all beings are conceived. Thus, *qian* and *kun* both bear the qi of true origin; men and women each possess an undying body. *Qian* is called ‘great generation’—through it, one may perfect the Dao and awaken to truth. *Kun* is called ‘vast generation’—through it, one may also realize the fruit and become a Yuanjun. If one claims that the yin of *kun* cannot enter the immortal Dao, how then does the Queen Mother long dwell on Kunlun? Chang’e stole the elixir between the beams and forever became the empress of the moon palace. The carefree one read the books of the lacquer garden and styled herself the banished immortal of the Jasper Pool. The goddess of the Luo River and the shamanka of Wu have been illustrious since antiquity; Purple Maiden and the Xiang Consorts are celebrated even now. Their traces are recorded in historical texts and can certainly be verified. How could one who embodies the virtue of *kun* be incapable?\n\nWomen’s original destiny has three phases—purple, white, and yellow lights—not like men’s. Youth is above, decline in the middle, completion below; one must deeply comprehend the critical juncture where a mistake is made. The qi cavity is the origin of blood, the breasts—located one *cun* and three *fen* in the center, not the two breasts. Men’s destiny lies in the Cinnabar Field, thus the lower field is their qi cavity. Women’s destiny lies in the breasts, thus the breasts are their qi cavity. When yin reaches its extreme and transforms into yang, it transmutes from the qi cavity into yin blood and flows outward in form. Thus, severing the Red Dragon must begin where yin arises, and through long practice, the form will naturally recede. If one mistakenly points to the qi cavity one *cun* and three *fen* below a man’s navel, it is an error.\n\nXu Zu said: ‘When men cultivate, they achieve non-leakage of essence; when women cultivate, they achieve non-leakage of menses.’ For women, the menses are the first sign of life’s beginning. When the menses return to qi, the breasts shrink like a man’s, and the menses naturally cease to leak. For men, refining essence into qi causes the yin root to shrink like a boy’s, and essence naturally ceases to leak. Only after non-leakage can life be extended. It is also said: ‘When a woman cultivates to the point where the menses do not leak, her subsequent work on nature and life is largely the same as men’s, with only minor differences. The concern is that no one reveals the secrets to unlock its wonders!’\n\nThe practice of the yielding differs from that of the firm, yet their success may come more easily than for the firm. The firm may take three years to subdue qi; the yielding may achieve it in one, for the elixir is within the body. Yuanjun Sun Bu’er said:\n‘Men and women are originally one qi, differing in purity and turbidity, movement and stillness. If a woman wishes to cultivate the real, she must gather her true origin. Within yin lies primordial yang—preserve clarity and do not discard it. Understand that form and desire are originally without encumbrance.’”\n\n\"Banish greed, wrath, and delusion; sever the bonds of care and anxiety.\nRefine the turbid to cultivate pure nature, and you shall not fall into evil destinies.\nAbide in stillness and embrace non-action—thus do I possess the qualities of a man.\nNon-being has no form; being has its meaning.\nInwardly perceive form and sound as empty, with not even a hair’s attachment.\nRely on earth as the foundation of Kun; the primal yang arises from the ground.\nLead and mercury are not the same, yet qi and spirit share a single principle.\nThe vast and numinous heart—mind and spirit can govern it.\nWhen the one qi returns to spring harmony, it soars beyond the clouds.\nAccompanying you to wander the Great Clarity—this is called the gatha of true suchness.\n\nThe Way of Qian is movement; the Way of Kun is stillness.\nTo cultivate nature and life, one must begin with stillness.\nYou are originally still—why then seek to cultivate?\nThe Way of Kun is turbid; the Way of Qian is pure.\nTo cultivate nature and life, one must seek purity.\nOnly by refining the turbid into the pure can one enter the Dao and attain fruition.\n\nThe *Scripture of the Divine Embryo’s Longevity and Function* states:\n‘After success, in men the qi of the Gate of Life gathers essence; in women the womb’s moisture does not congeal into an infant. Though desire stirs, it cannot contend with spirit.’\nThis is the true essence returning to spirit in the midst of forming the embryo—this is the Highest Clarity.\"",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "男女丹工异同辩 竹阳女史颜泽寰晏清纂述 仙井女史贺为烈全贞参校 皖江陈撄宁重校订 读者须知 一、此书作于光绪癸卯岁，即民国纪元前八年。 二、作者乃一终身不嫁之女子，事母甚孝，母则守节，女则守贞。 母女二人皆好道，奈无师授，只得于各家道书中搜寻口诀，承母命，遂集此书，皆杂抄他种丹经而来，非其自作。 三、所抄各书，有善者，有不善者。 故其理论偶有矛盾，而文辞亦颇嫌冗烦，虽稍加以删改，然不能不存其本意，学者当用自己智慧分别观之。 四、书中如香逸古母、玄天上帝、金阙帝君，瑶池王母、圆明道姥一类的称呼，皆是他种书上假托之名，当此破除迷信时代，本不应用此等名称，但因原书已有，故仍其旧。 五、书中谓女丹修成，必用待度，此段理论，不甚圆满，盖因昔日重男轻女之习惯使然。 世界各种宗教制度，多数是男女不能平等，亦非独中国如是，惟赖女界有杰出之材，方能破此成例耳。 六、书中金阙帝君一段议论，他说「有谓赤龙不斩，而丹不得结，道不得成。 不知血尽而气亦尽矣，如男子之精败，而丹亦难成，其理一也。 盖男精女血，多不可绝，气离血而气无由生，血化气而精始流通，如谓血尽乃可炼丹，何以青年血枯而病反起？ 此终不离血之一证也」。 今按：斩赤龙即是用工夫把月经炼断，不是女子血枯，若说斩赤龙就是血绝、血尽、血枯，岂非变成干血痨的症候么？ 假使女子真有此病，必须要用特别工夫，并医药方法，令月经回复原状，每月按时而至，与普通健康身体无异，然后再依斩龙口诀，慢慢将他炼断，此乃一定之规则，这位先生，把斩赤龙的效验，同干血痨病一样看待，真可谓大大错误。 七、男女修炼下手方法之不同，就是因为生理上的关系，女子若要入道，必须先能明了普通医学知识，然后再做工夫，庶不至于弄错门路，学仙之士，未有不学医者，这是实在的凭据，非空讲玄理高谈心性所能比拟。 八、不论男女，若本身无生凡胎之能力者，决不会有结仙胎之希望，生人与成仙，其理原无二致，惟在顺逆之分而已，斩赤龙者，乃逆行造化也，倘自己身中无造化之生机，误认月经断绝，即可以成仙，则彼年龄已过五十之妇女，月经将呈自然断绝之状态，岂非各各都有仙人资格乎？ 若谓年老者又当别论，然现代青年女子，亦有请医生用手术将子宫卵巢割去者，其月经亦自然断绝，遂能称为斩赤龙乎？ 此中消息，不能不深究也。 中华民国二十四年十月，黄帝纪元四千六百三十二年。",
      "translated_text": "**Discourse on the Similarities and Differences in the Alchemical Arts for Men and Women**\n*Compiled by Yan Zehuan of Zhuyang, Woman Historian of the Yanclean Era*\n*Collated and Annotated by He Weilie of Xianjing, Woman Historian of Unblemished Chastity*\n*Revised and Edited by Chen Yingning of Wanjian*\n\n**Reader’s Notice:**\n\n1. This book was composed in the *guimao* year of the Guangxu reign (1903), eight years prior to the founding of the Republic of China.\n\n2. The author was a woman who remained unwed all her life, devotedly filial to her mother, who herself observed widow’s chastity. Both mother and daughter were devoted to the Dao, yet lacking a teacher, they gleaned oral instructions from various alchemical texts. At her mother’s behest, the author compiled this work, drawing entirely from excerpts of other *danjing* (alchemical classics), rather than composing it herself.\n\n3. The texts excerpted vary in quality; thus, their theories occasionally contradict one another, and their prose is often verbose. Though some revisions were made, the original intent could not be entirely altered. Scholars must employ their own discernment when studying it.\n\n4. Terms such as \"Ancient Mother Xiangyi,\" \"Supreme Emperor of the Dark Heavens,\" \"Jade Emperor of the Golden Palace,\" \"Queen Mother of the Jasper Pool,\" and \"Daoist Matriarch of Perfect Clarity\" are all fictitious names borrowed from other texts. In this age of dispelling superstition, such appellations ought not to be used, yet they are retained here as they appear in the original.\n\n5. The book asserts that a woman’s alchemical attainment requires awaiting \"transmission\" (*daidu*), a theory that is far from satisfactory. This stems from the old custom of valuing men over women. Most religious institutions worldwide deny equality between the sexes—not solely in China. Only when women of exceptional talent emerge can such conventions be broken.\n\n6. In the section attributed to the \"Jade Emperor of the Golden Palace,\" he states: *\"Some claim that unless the Red Dragon is severed, the elixir cannot form and the Dao cannot be realized. Yet if the blood is exhausted, so too is the qi. Just as a man’s essence decays and his elixir becomes difficult to refine, the principle is the same. For men’s essence and women’s blood must not be entirely cut off. Qi arises from blood, and when blood transforms into qi, essence flows freely. If one insists that blood must be exhausted to refine the elixir, why do young women with blood depletion fall ill instead? This alone proves that blood cannot be entirely forsaken.\"*\n\n   **Note:** Severing the Red Dragon refers to the practice of refining and halting menstruation through cultivation, not to blood depletion in women. To equate severing the Red Dragon with blood exhaustion or desiccation is to mistake it for the pathology of *ganxuelao* (consumptive blood depletion). If a woman truly suffers from this condition, she must employ special methods—combined with medical treatment—to restore her menstrual cycle to its regular, healthy state before gradually refining and halting it according to the oral instructions for severing the Dragon. This gentleman’s conflation of the effects of severing the Red Dragon with *ganxuelao* is a grave error.\n\n7. The differing methods for men and women in the initial stages of cultivation arise from physiological distinctions. If a woman wishes to enter the Dao, she must first acquire a foundational understanding of medicine before undertaking practice, lest she err in her approach. No true student of immortality neglects the study of medicine—this is a concrete principle, not to be dismissed as mere abstruse theory or lofty discourse on nature and mind.\n\n8. Regardless of sex, those incapable of conceiving mortal offspring will never attain the hope of forming an immortal embryo. The principles of human birth and immortal transformation are fundamentally the same; the difference lies solely in whether one follows or reverses the natural course. Severing the Red Dragon is a reversal of creation’s flow. If one mistakenly believes that the cessation of menstruation alone suffices for immortality, then women over fifty—whose menses naturally cease—would all possess the qualifications of immortals. If one argues that the elderly are a special case, what of modern young women who undergo surgical removal of the uterus or ovaries, thereby naturally halting menstruation? Can this be deemed severing the Red Dragon? Such matters demand profound investigation.\n\n   *October, Year 24 of the Republic of China (1935), Year 4632 of the Yellow Emperor’s Calendar.*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 977,
      "start_sentence": 0,
      "end_sentence": 23,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.43478512763977,
      "metadata": {
        "source_file": "dao\\藏外\\男女丹工异同辩.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "皖江陈撄宁识 序 泽寰少孤，母守节乏嗣，膝下惟余等姊妹三人。 未几二妹殇，三妹亦字人待嫁。 泽寰不忍母之孀居寂苦也，立志守贞奉母，誓不出阁。 年十二，即随母持斋，互以《劝善歌》文自娱。 每羡善书中言修行之美，仙佛之贵，憾无明师指点诀窍，复无丹经印证身心，默叩天缘，几历十载。 忽值庚子夏京都之变，奉母预避峨山，始知佛门中言女修者有《摩邪【耶】夫人经》、《摩登伽女经》、《寄【给】孤长者女经》《比丘尼传》、《善女人传》海南一勺编。 嗣又得《摩尼烛坤集》一部，约七十余种，系如山之夫人，名善一优婆姨者所集也。 但释藏深邃，详性略命，非初机所能应手。 若夫玄门中言女丹者，往往附诸《道藏》中，无次序、无专书，望海汪洋，无任于邑。 不揣陋劣，割裂圣经，汇集女丹约百余纸，与母演说，一消寂闷，一励潜修。 承欢之余，又尊母命，于所集女丹中，提出男女异同之处，另抄一册，约五千余言。 颜曰：《男女丹工异同辩》置诸座右，以免工法混淆，身罹奇疾，牙慧之诮，知不免焉，若公同好，则吾岂敢？ 光绪癸卯春，竹阳女史颜泽寰晏清自记。 男女丹工异同辩 竹阳女史颜泽寰晏清纂述 仙井女史贺为烈全贞参校 皖江陈撄宁重校订 集说",
      "translated_text": "**Inscription by Chen Yingning of Wanjiang**\n\n**Preface**\n\nZe-huan lost her father in early youth. Her mother, steadfast in widowhood, had no sons, and only we three sisters remained. Soon after, my second sister passed away, and my third sister was betrothed, awaiting marriage. Unwilling to bear my mother’s lonely suffering in widowhood, Ze-huan vowed to remain chaste and serve her, swearing never to marry. At the age of twelve, I began to observe vegetarian precepts alongside my mother, finding solace in reciting *Songs of Exhortation to Goodness*. I often admired the accounts of cultivation in moral tracts—the beauty of self-cultivation, the nobility of immortals and buddhas—yet lamented the lack of an enlightened teacher to guide me in the secrets, and the absence of alchemical scriptures to verify my own experience. For nearly a decade, I silently entreated the heavens for karmic affinity.\n\nThen, in the summer of *gengzi* (1900), the turmoil in the capital of Kyoto struck. Escorting my mother, we took refuge on Mount E, where I first learned of Buddhist texts on female cultivation: the *Sutra of Lady Malla*, the *Sutra of Mātanga-girl*, the *Sutra of the Daughter of Anāthapiṇḍada*, the *Biographies of Bhikṣuṇīs*, and the *Biographies of Virtuous Women*—a mere drop in the vast ocean. Later, I obtained *The Mani Candle Illuminating the Earth*, a collection of over seventy works compiled by Lady Rushan, a *upāsikā* named Shanyi. Yet the Buddhist canon is profound, emphasizing nature over life-destiny, and not readily accessible to beginners.\n\nAs for Daoist texts on female elixir (*nüdan*), they are often scattered within the *Daoist Canon*, without order or dedicated volumes—an endless sea, leaving one overwhelmed. Undeterred by my own inadequacy, I excised and compiled passages on female elixir from the sacred scriptures, gathering over a hundred pages. I explained them to my mother, both to dispel her solitude and to encourage her hidden cultivation. Beyond serving her with filial devotion, I followed her command to extract the differences and similarities between male and female alchemical practice from my collection, transcribing them into a separate volume of over five thousand characters. I titled it *On the Differences and Similarities in Male and Female Elixir Work*, placing it by my side to prevent confusion in practice, which might otherwise lead to strange illnesses. I cannot escape the charge of superficiality, but if fellow seekers find value in it, how could I dare withhold it?\n\n*Spring of the *guimao* year of the Guangxu reign (1903), recorded by Yan Ze-huan, the Bamboo Grove Historian, in her leisure.*\n\n**On the Differences and Similarities in Male and Female Elixir Work**\n*Compiled and Narrated by Yan Ze-huan, the Bamboo Grove Historian*\n*Collated by He Weilié Quanzhen, the Immortal Well Historian*\n*Revised and Edited by Chen Yingning of Wanjiang*",
      "overlap_context": "ation alone suffices for immortality, then women over fifty—whose menses naturally cease—would all possess the qualifications of immortals. If one argues that the elderly are a special case, what of modern young women who undergo surgical removal of the uterus or ovaries, thereby naturally halting menstruation? Can this be deemed severing the Red Dragon? Such matters demand profound investigation.\n\n   *October, Year 24 of the Republic of China (1935), Year 4632 of the Yellow Emperor’s Calendar.*",
      "start_char": 977,
      "end_char": 1472,
      "start_sentence": 24,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.00699734687805,
      "metadata": {
        "source_file": "dao\\藏外\\男女丹工异同辩.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "孙元君坤诀注曰： 《彖》曰：\"至哉坤元，万物资生。 \"坤属老阴，阴极阳生，顺承乎天，则生人生物； 顺承乎己，则成道成真。 香逸古母曰： 凡男子修行，皆从初工运炼筑基起手。 若是女子修行，与男子不同。 男子阳从下泄，女子阳从上升，男子体刚，女子体柔。 男子用丹田阳精，常常保守，不致外泄，积之既久，用火煅炼，使精化为气，气化为神，神化为虚，由渐而进，工完了道飞升。 若女子则不同，女子仍【乃】是阴浊之体、血液之躯，用乳房灵脂，变化气质，久久运炼，自然赤反为白，血化为气，血既化气，仍用火符煅炼，亦能气反纯阳，了道归真。 女子初工，先炼形质，后炼本元。 不似男子之工，先炼本元，后炼形质。 其体各殊，其工自异。 若不分门立教，何以能造化阴阳，男女共济也。 然形既为我有，何必用炼？ 女子之体，原属阴浊，不若男子之体，实秉阳刚，苟不陶炼，不能使血化为气，如何孕得出先天，产得出真气？ 若不得真气，仍然一片纯阴，又焉能得还丹而成大道？ 故女子之形，必先练而后可。 女真之道，原与男子之工大不相同。 男子之道，贵在炼药，是以前段工夫，逐一讲明，果能旦夕行之，虔心进步，使身中五脏之血皆返为气，自然化生。 若真气潜生，将阴浊之体变为纯阳，工夫至此，方能用火行符，才与男子同等。 若不分门别类，其工焉能有济？ 故男子先炼药后炼形，女子先炼形后炼药。 因其体相攸分，故前后工夫差别。 吾今立法教人，不得不分明指示，方使学者无亏。 女丹修法，其理原本不繁，当其运炼，亦自不难，诸丹经内，所以不传女子修炼者，盖因其未能男女双渡故也。 吾今垂法教人，实愿男女双渡，故此于丹书后编，接列《女道十则》，以渡有缘之辈。 何以女丹之道，至简不繁？ 女子之性纯全，女子之身安靖，但得一点工夫，便能澈【彻】底造就。 不似男子之念颇多偏僻，故其身心所尚不同，女子之工比男子便捷些。 女丹从养真至胎息，其工已得三分之二，不若男子之工，便有许多作用，方能到得调神地步。 所以女道丹书，从养胎直至胎息，工毕，便接录外行工修，俟其外行有余，方可炼调神一段。 女真修成，何以必用待度？ 因其血弱之躯，假内工修炼，以成阳体。 体虽成阳，而阴凝之性，尚未炼尽，故女子工夫少还虚一段运用，未能尽天地之妙化，所以不得超升世外者，悉由体相之不坚，故也。 不若男子之体已炼成金刚不坏之身，还虚之工养成，神光充满天地，故不用待度而可了道成真，亲朝上帝、游晏蓬莱。 若女子则不然，女丹修成，务必广行功德，倘功德行满，上圣见而怜之，保奏上帝，方得敕旨下颁、金书选诏，证得人天无上道果，否则就成一个散仙而已。 吕祖曰：\"太阴炼形，与男子修炼之法大同小异。 初工下手，是谓斩赤龙。 其后十月工夫，阳神出现，粉碎虚空，一路修真，与男子同，无彼此之别也。 \" 绥山道士曰：\"赤龙自斩，乳头自缩，如男子一般，而真阴之气化为真阳，以后用工，与男子无异。 但女属静体，后四层虽与男丹同其运用，而其建功更速矣。 \" 吕祖曰：\"男子修行降白虎，女子修行斩赤龙。 \" 《三命篇》曰：\"男子之命在丹田，丹田者，生丹之真土也。",
      "translated_text": "Master Sun Yuan’s *Commentary on the Kun Decisions* states:\nThe *Tuan* says: “Supreme is the Kun’s primordial power—all things draw upon it for life.”\nKun belongs to old yin; when yin reaches its extreme, yang is born. In following Heaven, it gives life to humans and creatures; in following the self, it completes the Dao and attains perfection.\n\nAncient Mother Xiang Yi says:\nIn all cases, men’s cultivation begins with the initial work of refining and laying the foundation. For women’s cultivation, however, it differs from men’s. In men, yang descends and disperses; in women, yang ascends. Men’s bodies are firm; women’s bodies are soft. Men use the yang essence of the cinnabar field, constantly preserving and guarding it to prevent external leakage. After long accumulation, they employ fire to refine it, transmuting essence into qi, qi into spirit, and spirit into emptiness. Progressing step by step, once the work is complete, they ascend in flight. Women, however, are different. Women are inherently bodies of yin turbidity and blood and flesh. They use the numinous fat of the breasts to transform their qi and disposition. Through prolonged refinement, naturally the red reverses to white, and blood transmutes into qi. Once blood has become qi, they too employ fire talismans to refine it, enabling qi to revert to pure yang, completing the Dao and returning to truth.\n\nIn women’s initial work, they first refine the physical form, then refine the original essence. This is unlike men’s work, which first refines the original essence, then the physical form. Their bodies differ, so their work naturally varies. If one does not distinguish the teachings by category, how can one harmonize yin and yang and enable men and women to aid one another?\n\nYet since the body is already ours, why refine it? Women’s bodies are originally yin turbidity, unlike men’s bodies, which inherently possess yang firmness. Without refinement, blood cannot be transmuted into qi—how then can one conceive the primordial or produce true qi? Without true qi, one remains a mass of pure yin—how could one attain the returned elixir and accomplish the great Dao? Thus, a woman’s form must first be refined before it is viable.\n\nThe Dao of female immortals fundamentally differs from men’s work. Men’s Dao values the refinement of the medicine; thus, the earlier stages of work are explained step by step. If one practices diligently day and night with sincere progress, the blood in the five viscera will all revert to qi, naturally transforming and generating. When true qi arises in concealment, the turbid yin body is transmuted into pure yang. Only at this stage can one employ fire and enact talismans, becoming equal to men.\n\nIf one does not distinguish the teachings by category, how can the work succeed? Thus, men first refine the medicine, then the form; women first refine the form, then the medicine. Because their bodies differ, the sequence of work also varies. In establishing teachings for others, I must clearly instruct so that learners do not suffer deficiencies.\n\nThe principles of female elixir cultivation are not inherently complex, and their practice is not difficult. The reason most elixir classics do not transmit women’s cultivation is that they fail to address both men and women. In offering teachings now, I truly wish for both men and women to cross over together. Thus, following the elixir texts, I append *Ten Principles of the Female Dao* to guide those of karmic affinity.\n\nWhy is the Dao of the female elixir so simple and uncluttered? Women’s nature is pure and whole; women’s bodies are tranquil and serene. With just a little work, they can achieve thorough accomplishment. Unlike men, whose thoughts are often biased and deviant, their bodies and minds differ in what they value. Women’s work is swifter than men’s.\n\nFrom nurturing the true to embryonic breathing, women’s work has already achieved two-thirds of the process. Unlike men’s work, which requires many operations to reach the stage of harmonizing the spirit, in female elixir texts, from nurturing the embryo to embryonic breathing, once the work is complete, one proceeds to external cultivation. Only when external cultivation is abundant can one refine the stage of harmonizing the spirit.\n\nWhy must female immortals, once cultivated, await deliverance? Because their bodies of weak blood rely on internal work to refine and become yang bodies. Though the body has become yang, the congealed yin nature has not yet been fully refined. Thus, women’s work lacks the final stage of returning to emptiness, unable to fully manifest the wondrous transformations of Heaven and Earth. The reason they cannot transcend the world is entirely due to the fragility of their bodies. Unlike men, whose bodies are refined into indestructible vajra forms, with the work of returning to emptiness complete, their spirit-light fills Heaven and Earth. Thus, they do not need to await deliverance to complete the Dao, attain perfection, personally attend the Celestial Emperor, and wander at leisure in Penglai.\n\nWomen, however, are different. Once the female elixir is cultivated, they must broadly perform meritorious deeds. Only when their merit is complete, seen and pitied by the upper sages, who then memorialize the Celestial Emperor, will an imperial edict be issued and a golden decree selected, certifying the supreme Dao fruit of humanity and Heaven. Otherwise, they will merely become solitary immortals.\n\nMaster Lü says:\n“Refining the form in the Great Yin differs only slightly from men’s cultivation. The initial work begins with severing the Red Dragon. Thereafter, ten months of work bring the yang spirit to manifestation, shattering emptiness. The path of cultivation is the same as men’s, with no distinction between them.”\n\nThe Daoist of Sui Mountain says:\n“Once the Red Dragon is severed, the nipples retract like a man’s, and the true yin qi transforms into true yang. Thereafter, the work is no different from men’s. But since women belong to the tranquil body, though the latter four stages share the same operations as men’s elixir, their achievements are even swifter.”\n\nMaster Lü says:\n“Men’s cultivation subdues the White Tiger; women’s cultivation severs the Red Dragon.”\n\nThe *Three Mandates Chapter* says:\n“Men’s mandate lies in the cinnabar field—the cinnabar field is the true earth that generates the elixir.”",
      "overlap_context": "ses. I cannot escape the charge of superficiality, but if fellow seekers find value in it, how could I dare withhold it?\n\n*Spring of the *guimao* year of the Guangxu reign (1903), recorded by Yan Ze-huan, the Bamboo Grove Historian, in her leisure.*\n\n**On the Differences and Similarities in Male and Female Elixir Work**\n*Compiled and Narrated by Yan Ze-huan, the Bamboo Grove Historian*\n*Collated by He Weilié Quanzhen, the Immortal Well Historian*\n*Revised and Edited by Chen Yingning of Wanjiang*",
      "start_char": 1473,
      "end_char": 2739,
      "start_sentence": 44,
      "end_sentence": 90,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.779226064682007,
      "metadata": {
        "source_file": "dao\\藏外\\男女丹工异同辩.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "女命在乳房，乳房者，母气之木精也。 \"又云：\"女子以血为肾，乃空窍焉。 过四十九岁，腰干血涸，无生机矣。 养而久之，又生血元，似处子焉，此乃无中生有之妙也。 见其有之，一斩即化，而命生矣。 此时则用性命工夫，与男子同也。 \" 懒道人曰：\"女命何以有三？ 谓上、中、下也。 上者阳穴，中者黄房，下者丹田。 少则从上，衰则从中，成方从下耳。 又女子内阳外阴，先须斩赤龙以全其体，则坎化为干矣。 然后用男子之工修之，一年即得，以金丹在其中，故也。 \" 《修真辩难》或问：\"男女下手处，分别如何？ \"答曰：男子下手以炼气为要，女子下手，以炼形为要。 炼气者，伏其气也，伏气务期其气回，气回则虚极静笃，归根复命，而白虎降。 炼形者，隐其形也。 隐形务期其灭形，形灭则四大入空，剥烂肢体，而赤脉斩。 男子白虎降，则变为童体，而后天之精自不泄漏，可以结丹，可以延年。 女子赤龙斩，亦变为童体，而阴浊之血自不下行，可以出死，可以入生。 故男子修炼，曰太阳炼气，女子修炼，曰太阴炼形。 又问：\"女子炼形，不伏气乎？ \"答曰：\"女子性阴，其气易伏，而赤脉最能害道，其所重者在此，故下手则在着重处用力，赤脉一斩，气自驯顺，非若男子性阳，其气难伏。 譬如男子伏气要三年，女子一年可伏。 果是女中丈夫，得师口诀，行太阴炼形法，三五年间，即可成道，比男子省力。 但女中丈夫最不易得，不易得者，刚烈须过于男子百倍之力者，方能济事。 若与男子等力者，万万不能。 \"",
      "translated_text": "The female mandate lies in the breasts, for the breasts are the essence of the mother-qi’s Wood.\n\nIt is also said: “Women take blood as their kidneys, which are hollow cavities. After forty-nine years, the waist dries and blood withers, leaving no vitality. Yet with long nurturing, the primal blood regenerates, as in a maiden—this is the marvel of creating something from nothing. When this ‘something’ appears, a single severing transforms it, and life is born. From this point onward, the work of cultivating both nature and life is the same as men’s.”\n\nMaster Lazy Daoist says: “Why are there three mandates for women? They are the upper, middle, and lower. The upper is the yang cavity, the middle is the Yellow Chamber, and the lower is the cinnabar field. In youth, one begins from the upper; in decline, from the middle; and only at maturity, from the lower. Moreover, women are inwardly yang and outwardly yin, so they must first sever the Red Dragon to preserve their body, whereupon *kan* transforms into *qian*. Thereafter, they employ the same work as men, achieving success in a single year, for the golden elixir resides within.”\n\nThe *Inquiries on Cultivating the Dao* asks: “How do the starting points differ for men and women?”\nThe answer: “Men begin by refining qi as the essential task, while women begin by refining form. Refining qi means subduing one’s qi, and subduing qi requires its return. When qi returns, emptiness reaches its extreme and stillness becomes profound, root and life are restored, and the White Tiger is subdued. Refining form means concealing one’s form, and concealing form requires its dissolution. When form dissolves, the Four Great enter emptiness, the limbs decay, and the Red Channel is severed. When men subdue the White Tiger, they revert to a youthful body, and the post-heaven essence no longer leaks, allowing the elixir to coalesce and years to be extended. When women sever the Red Dragon, they likewise revert to a youthful body, and the impure yin blood no longer descends, allowing them to escape death and enter life. Thus, men’s cultivation is called ‘Great Yang Refining Qi,’ while women’s cultivation is called ‘Great Yin Refining Form.’”\n\nIt is further asked: “Do women refining form not subdue qi?”\nThe answer: “Women are yin by nature, so their qi is easily subdued, but the Red Channel is most harmful to the Dao. This is their crucial point, so they begin by applying effort where it matters most. Once the Red Channel is severed, qi naturally becomes docile—not like men, who are yang by nature and whose qi is difficult to subdue. For example, while men require three years to subdue qi, women can achieve it in one. If a woman is truly a hero among women, receives her master’s oral instructions, and practices the Great Yin Refining Form method, she may attain the Dao in three to five years, with less effort than men. Yet such heroines among women are exceedingly rare. Only those whose fortitude exceeds a man’s by a hundredfold can succeed. Those equal in strength to men cannot achieve it at all.”",
      "overlap_context": " and the true yin qi transforms into true yang. Thereafter, the work is no different from men’s. But since women belong to the tranquil body, though the latter four stages share the same operations as men’s elixir, their achievements are even swifter.”\n\nMaster Lü says:\n“Men’s cultivation subdues the White Tiger; women’s cultivation severs the Red Dragon.”\n\nThe *Three Mandates Chapter* says:\n“Men’s mandate lies in the cinnabar field—the cinnabar field is the true earth that generates the elixir.”",
      "start_char": 2739,
      "end_char": 3339,
      "start_sentence": 91,
      "end_sentence": 119,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.745022535324097,
      "metadata": {
        "source_file": "dao\\藏外\\男女丹工异同辩.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "又问：\"大道不分男女，何以男女有分别？ \"答曰：\"其道则同，其用则异，盖以秉性不同、形体有别，故同一性命之道，而行持大有不同也。 \" 玄天上帝曰： 《易》曰\"干父坤母\"，阴阳之义昭昭可考。 有天地然后有男女，则阴阳之道，又不言而喻，则是天地之不可无男女明矣。 男受乾坤之变化而成其象，女亦秉乾坤之交泰而有其形。 凡具兹形象者，皆具乾坤之气，而同列于宇宙之间耳。 今当慈航普渡之际，宝筏共撑之时，男则教亦多术，岂能舍坤维而不顾哉？ 指男之玄微奥妙者，汗牛充栋，度女之法范典型者，寥寥无几。 吾切发悲而独论之。 男体以精中之气而贯些子，女子以血中之气而熏些子，些子足而莲窍足，莲窍足而抽添始运，抽添运而始有甘露下降。 男子之精，其气充足； 女子之血，其气甚微，故名之曰男阳而女阴也。 修吾道者，绝七情为本，断六欲为先，则微微之气，又较胜于男子者多矣。 何也？ 男子之心易动，女子之念略静，动则而气易泄，静则而气易长，男子之七莲，易收难放，女子之七莲，易放难收，苟能真心不懈，不待三五年，而甘露常降，七莲常开。 开之易，岂有采取之不易哉？ 男女之辨，于此明矣。 若集中之言虚、言空、言玄、言妙、言神、言化，又男女之大同也。 男子以胎名，女子不言胎，而单以息名者，恐后世之人错认胎字，卒受诬名耳。 再者男子之神出，必至纯至阳，而始有脱壳之机，因阳中含阴也。 女子之神出，不同于男子。 女子造到三阳之时，即可脱化百里之遥，造至纯老二阳之会，则一出永出，断无天折之患也。 盖男子阳中含阴，女子阴中含阳，男子阴在内，而阳在外，女子阴在外，而阳在内，阳胜则诸阴易退。 吾今不惜真脉，道破于斯，无非切望早成真志之多耳。 金阙帝君曰： 以大处而论，百脉皆由无极分形，以细密而言，又属无形无象，却原万化尽包，男女皆同此至宝，只分血精两条。 男精逆行而成仙，女血直腾归心窍，故而各有各法，各有各照。 男丹由精化气、气化神、神化虚，虚极静笃，而丹自结矣。 女丹由血化气、气化神、神化虚，虚无自然，而丹自成矣。 有谓赤龙不斩，而丹不得结、道不得成者，不知血尽而气亦尽矣。 如男子之精败，而丹亦难成，其理一也。 盖男精女血，多不可绝，气离血，而气无由生，血化气，而精始流通。 如谓血尽而乃言炼丹，何以青年血枯而病反起？ 此终不离血之一证也。 瑶池王母曰：\"女子工夫，与男相兼，只分地步，地本非玄。 一切妙化，俱不异男。 尔等切悟，书中载全。 毫不差错，各自修潜。 \"",
      "translated_text": "Another asked, “The Great Dao makes no distinction between men and women—why then are there differences between them?”\n\nThe answer came: “The Dao is the same, but its application differs. This is because their inherent natures are not alike, and their physical forms are distinct. Thus, though the Way of cultivating life and destiny is one, the methods of practice vary greatly.”\n\nThe Dark-Heaven Thearch said:\nThe *Book of Changes* states, “Qian is the father, Kun the mother,” making the principle of yin and yang abundantly clear. Only after heaven and earth exist do men and women arise, so the Way of yin and yang is self-evident. Thus, it is manifest that heaven and earth cannot be without men and women. Men receive the transformations of Qian and Kun to form their image, while women inherit the harmonious union of Qian and Kun to take their shape. All who possess these forms are endowed with the qi of Qian and Kun, and together they stand within the cosmos.\n\nNow, in this era of compassionate ferrying and universal salvation, when the precious raft is shared by all, the teachings for men are manifold—how could we abandon the Kun axis and pay it no heed? The profound and wondrous instructions for men fill libraries to overflowing, while the models and standards for women are few and far between. Moved by deep sorrow, I speak of this alone.\n\nIn men, qi within essence courses through the *xiezi*; in women, qi within blood warms the *xiezi*. When the *xiezi* is full, the lotus aperture is full; when the lotus aperture is full, the drawing and replenishing begin to move; when drawing and replenishing move, the sweet dew first descends.\n\nMen’s essence is abundant in qi; women’s blood is meager in qi—hence they are called yang in men and yin in women. Those who cultivate our Way take cutting off the seven emotions as their foundation and severing the six desires as their priority. Thus, their faint qi often surpasses that of men. Why? Men’s minds are easily stirred, while women’s thoughts are somewhat still. When stirred, qi is easily lost; when still, qi is easily nurtured. In men, the seven lotuses are easy to gather but hard to release; in women, they are easy to release but hard to gather. If one can remain truly unwavering in resolve, without waiting three to five years, sweet dew will descend constantly, and the seven lotuses will remain open. If opening is easy, how could gathering be difficult? The distinction between men and women is clear here.\n\nYet when texts speak of emptiness, void, mystery, subtlety, spirit, or transformation, these are the great commonalities of men and women. Men speak of the “embryo,” while women do not use the term “embryo” but simply call it “breathing.” This is to prevent later generations from misconstruing the word “embryo” and ultimately suffering false accusations. Moreover, when a man’s spirit departs, it must reach pure yang before the shell can be shed, for yang contains yin. A woman’s spirit departs differently. When she attains the three yangs, she can already transcend a hundred leagues; when she reaches the meeting of the pure and old two yangs, her departure is permanent, with no risk of premature demise. This is because men contain yin within yang, while women contain yang within yin. In men, yin is within and yang without; in women, yin is without and yang within. When yang prevails, all yin readily retreats.\n\nI now spare no true transmission, revealing this here, solely in the earnest hope that many may swiftly realize their true resolve.\n\nThe Golden Tower Lord said:\nFrom a broad perspective, the hundred vessels all emerge from the formless Ultimate; in finer detail, they belong to the formless and imageless, yet originally encompass all transformations. Both men and women share this supreme treasure—only the two paths of blood and essence differ. Men’s essence ascends in reversal to become immortals; women’s blood rises straight to the heart aperture. Thus, each has its own method, each its own illumination.\n\nThe elixir in men is formed by essence transforming into qi, qi into spirit, spirit into emptiness. When emptiness reaches its extreme and stillness is profound, the elixir naturally coalesces. The elixir in women is formed by blood transforming into qi, qi into spirit, spirit into emptiness. When emptiness is natural, the elixir naturally forms.\n\nSome say that without severing the Red Dragon, the elixir cannot form and the Dao cannot be achieved. They do not realize that when blood is exhausted, qi is also exhausted—just as when a man’s essence decays, the elixir is difficult to form. The principle is the same. For essence in men and blood in women cannot be entirely cut off. When qi departs from blood, qi has no source; when blood transforms into qi, essence begins to flow. If one claims to refine the elixir only after blood is exhausted, why do young women whose blood is depleted instead fall ill? This ultimately proves that blood cannot be abandoned.\n\nThe Queen Mother of the Jasper Pool said:\n“Women’s practice shares much with men’s—only the stages differ, and the ground is not mysterious. All wondrous transformations are no different from men’s. You must deeply awaken to this. The texts hold the complete record, without the slightest error. Each must cultivate in seclusion.”",
      "overlap_context": "qi is difficult to subdue. For example, while men require three years to subdue qi, women can achieve it in one. If a woman is truly a hero among women, receives her master’s oral instructions, and practices the Great Yin Refining Form method, she may attain the Dao in three to five years, with less effort than men. Yet such heroines among women are exceedingly rare. Only those whose fortitude exceeds a man’s by a hundredfold can succeed. Those equal in strength to men cannot achieve it at all.”",
      "start_char": 3340,
      "end_char": 4348,
      "start_sentence": 120,
      "end_sentence": 160,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.03853702545166,
      "metadata": {
        "source_file": "dao\\藏外\\男女丹工异同辩.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "圆明道姆曰： 吾今与点破，以免受冤孽。 分配阴阳路，男女指一节。 男有此祖气，分配在精血。 女之祖气合，阴从血海说。 男有此阳关，顺逆不须惑。 女有北海地，波摇似水迫。 白莲真人曰： 男女金丹地不同，阴阳一理实相通。 清心寡欲为根本，筑基先要斩赤龙。 无心子曰： 男子精液阳中阴，女子精液阴中阳； 快寻明师求指破，返老还童在故乡。 七日天心如可复，此是上乘一妙着； 以后便同男子工，般般口诀要师说。 吕祖曰： 妇人修炼，如男子一样，难得者是皎洁。 须知妇人之欲，过于男子。 或到经水已过之后，其心如莲之初放，乘天之雨露，才结其实，妇人若无男子，则孤阴矣。 贞一子曰： 大道不问男女，皆能有成。 故男子道成为真人，女子道成为元君。 自来丹经言男子修炼之功，至详且悉，女子修炼之道，多不论及。 间有论及此者，不过略露一般，非薄女修也。 推其意，以为人同此性命，即同一工夫，言男修，而女子之工不烦言解矣。 不知男子外阳内阴，女子外阴内阳，秉性不同，形骸各别，虽同一性命，其行持大有不同者。 《修真辩难》曰：\"男子下手以炼气为要，女子下手以炼形为要。 \"许祖曰：\"男子修成不漏精，女子修成不漏经。 \"其初关逈然各别，至炼己得药、还丹温养、结胎出神诸事，虽与男子同，而细微节次，未尝无大同小异之殊。 壬辰春，适有坤女问道，仆以多看古书，证其所授。 而丹经言：\"女修者独少，难以考证异同。 \"爰不恤泄漏天机之罪，因将其所以同者何如，所以异者何如，并逐节次第形于楮墨，以为问津程途。 俾得寻文释义，不致鱼目混珠，果能深知力行，庶几可成无上至道，而诸瑶池之会，不难与男仙同谒木公，共朝金母矣。 天阳地阴，干刚坤顺，阴无阳不长，阳无阴不生，刚柔得其中和，水火始能既济，阴阳必有匹偶，人物由兹孕生。 是乾坤皆秉真元之气，男女各具不死之身。 干曰大生，可以道成正觉； 坤曰广生，亦能果证元君，如谓坤阴难入仙道，何以王母长处昆仑？ 嫦娥窃梁间之丹，永作月宫皇后； 逍遥读漆园之书，自号瑶池谪仙。 洛神、巫女，自古维昭； 紫姑、湘妃，于今为烈，迹载史篇，固可考也。 身秉坤德，岂不能乎？ 女子原来命有三，紫白黄光不似男。 少上衰中成在下，关头一错要深谙。 气穴即血元也，即乳房也，在中一寸三分，非两乳也。 男命即在丹田，故以下田为气穴。 女命在乳房，故以乳房为气穴。 阴极变阳，从气穴化阴血，而流形于外，故斩赤龙须从阴生之处用工，久久行持，形自隐矣。 若以男子脐下一寸三分中之气穴指之，则误矣。 许祖云：\"男子修成不漏精，女子修成不漏经。 \"盖女子之经为生人之始信，经返成气，则乳缩如男子，而经自不漏。 若男子则炼精化气，阴根缩如童子，而精自不漏。 不漏而后命可延。 又云：\"女子修到经不漏，其后性命工夫，与男子之功，大同小异，患无人以诀破其妙耳！ \" 柔人行道，与刚人不同，而其成功比刚人亦易。 刚人伏气三年，柔人一年可伏，以丹在身中，故也。 孙不二元君曰： 男女本一气，清浊动静异； 女人欲修真，切使真元聚。 阴中有元阳，存清勿以弃； 明此色与欲，本来无所累。",
      "translated_text": "Round Bright Dao Mother said:\n“I shall now reveal the truth to spare you from suffering wrongful karma. The paths of yin and yang are apportioned—men and women share one principle. Men possess this ancestral qi, distributed within essence and blood. Women’s ancestral qi converges, spoken of as arising from the Sea of Blood. Men have this yang pass, its flow and reversal requiring no confusion. Women have the Northern Sea’s terrain, its waves surging as if pressed by water. White Lotus Perfected One said: ‘The terrain of the Golden Elixir differs for men and women, yet the principle of yin and yang is truly the same. Clarity of mind and few desires are the root; to lay the foundation, first sever the Red Dragon.’\n\nMaster Wu Xin said:\n“Men’s essence is yang within yin; women’s essence is yin within yang. Swiftly seek a luminous teacher to receive instruction, and return to youth in your native land. If the Heavenly Heart of seven days can be restored, this is the supreme wondrous technique. Thereafter, the work is the same as for men—every oral instruction must be taught by the master.”\n\nLüzu said:\n“Women’s cultivation is like men’s in every way; what is difficult to attain is purity. Know that women’s desires exceed men’s. When the menstrual flow has ceased, their hearts are like lotuses just opening, riding heaven’s rain and dew to bear fruit. If a woman has no man, she is solitary yin. Master Zhen Yi said: ‘The Great Dao makes no distinction between men and women—all may achieve completion. Thus, when a man perfects the Dao, he becomes a Perfected One; when a woman perfects it, she becomes a Yuanjun. From ancient times, alchemical texts have described men’s cultivation in exhaustive detail, while women’s practice is rarely addressed. When it is mentioned, only a glimpse is offered—not out of disdain for women’s cultivation. The underlying assumption is that humans share the same nature and life, thus the same work; speak of men’s practice, and women’s work need not be elaborated. Yet men are yang without and yin within, while women are yin without and yang within. Their inherent natures differ, their forms are distinct. Though they share the same nature and life, their methods of practice differ greatly.’\n\n*The Discernment of Cultivating the Real* states: ‘Men begin with refining qi as essential; women begin with refining form as essential.’ Xu Zu said: ‘When men cultivate, they achieve non-leakage of essence; when women cultivate, they achieve non-leakage of menses.’ Their initial barriers are entirely distinct. Yet in refining the self, obtaining the medicine, returning the elixir, warming and nourishing, and forming the embryo to release the spirit, though similar to men’s, the subtle sequences may still differ in major and minor ways.\n\nIn the spring of the *renchen* year, a woman of the *kun* trigram sought the Dao. Having read many ancient books, I verified what she had been taught. Yet alchemical texts say: ‘Works on women’s practice are uniquely scarce, making it difficult to examine differences.’ Thus, undeterred by the transgression of revealing heavenly secrets, I set down in writing the ways in which they are the same and the ways they differ, arranging each step in order to serve as a guide for those seeking the ford. Let them follow the text to interpret its meaning, avoiding the confusion of fish eyes with pearls. If one can deeply understand and vigorously practice, one may achieve the supreme and ultimate Dao, and at the assemblies of the Jasper Pool, it will be no difficulty to join the male immortals in paying homage to Lord Mu and together attend the Golden Mother.\n\nHeaven is yang, earth is yin; *qian* is firm, *kun* is yielding. Yin cannot grow without yang; yang cannot be born without yin. When firmness and softness achieve harmony, water and fire can then achieve mutual completion. Yin and yang must have their counterparts, and from this, humans and all beings are conceived. Thus, *qian* and *kun* both bear the qi of true origin; men and women each possess an undying body. *Qian* is called ‘great generation’—through it, one may perfect the Dao and awaken to truth. *Kun* is called ‘vast generation’—through it, one may also realize the fruit and become a Yuanjun. If one claims that the yin of *kun* cannot enter the immortal Dao, how then does the Queen Mother long dwell on Kunlun? Chang’e stole the elixir between the beams and forever became the empress of the moon palace. The carefree one read the books of the lacquer garden and styled herself the banished immortal of the Jasper Pool. The goddess of the Luo River and the shamanka of Wu have been illustrious since antiquity; Purple Maiden and the Xiang Consorts are celebrated even now. Their traces are recorded in historical texts and can certainly be verified. How could one who embodies the virtue of *kun* be incapable?\n\nWomen’s original destiny has three phases—purple, white, and yellow lights—not like men’s. Youth is above, decline in the middle, completion below; one must deeply comprehend the critical juncture where a mistake is made. The qi cavity is the origin of blood, the breasts—located one *cun* and three *fen* in the center, not the two breasts. Men’s destiny lies in the Cinnabar Field, thus the lower field is their qi cavity. Women’s destiny lies in the breasts, thus the breasts are their qi cavity. When yin reaches its extreme and transforms into yang, it transmutes from the qi cavity into yin blood and flows outward in form. Thus, severing the Red Dragon must begin where yin arises, and through long practice, the form will naturally recede. If one mistakenly points to the qi cavity one *cun* and three *fen* below a man’s navel, it is an error.\n\nXu Zu said: ‘When men cultivate, they achieve non-leakage of essence; when women cultivate, they achieve non-leakage of menses.’ For women, the menses are the first sign of life’s beginning. When the menses return to qi, the breasts shrink like a man’s, and the menses naturally cease to leak. For men, refining essence into qi causes the yin root to shrink like a boy’s, and essence naturally ceases to leak. Only after non-leakage can life be extended. It is also said: ‘When a woman cultivates to the point where the menses do not leak, her subsequent work on nature and life is largely the same as men’s, with only minor differences. The concern is that no one reveals the secrets to unlock its wonders!’\n\nThe practice of the yielding differs from that of the firm, yet their success may come more easily than for the firm. The firm may take three years to subdue qi; the yielding may achieve it in one, for the elixir is within the body. Yuanjun Sun Bu’er said:\n‘Men and women are originally one qi, differing in purity and turbidity, movement and stillness. If a woman wishes to cultivate the real, she must gather her true origin. Within yin lies primordial yang—preserve clarity and do not discard it. Understand that form and desire are originally without encumbrance.’”",
      "overlap_context": " to refine the elixir only after blood is exhausted, why do young women whose blood is depleted instead fall ill? This ultimately proves that blood cannot be abandoned.\n\nThe Queen Mother of the Jasper Pool said:\n“Women’s practice shares much with men’s—only the stages differ, and the ground is not mysterious. All wondrous transformations are no different from men’s. You must deeply awaken to this. The texts hold the complete record, without the slightest error. Each must cultivate in seclusion.”",
      "start_char": 4349,
      "end_char": 5620,
      "start_sentence": 161,
      "end_sentence": 222,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.25944185256958,
      "metadata": {
        "source_file": "dao\\藏外\\男女丹工异同辩.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "屏除贪嗔痴，割断忧思虑； 去浊修清性，不堕诸恶趣。 寂静守无为，我即男子具； 无无无其形，有有有其意。 内视色声空，丝毫无沾滞； 仗土为坤基，一阳本自地。 铅汞固不同，气神无二义； 渺渺空灵心，心神能为制。 一气反春和，飞出云霄去； 偕汝太清游，是曰真如偈。 夫干道动，坤道静，欲修性命，务须从静。 汝今原静，又何以修？ 坤道浊，干道清，欲修性命，务须求清。 惟能以浊修清，是以入道证果。 《长生胎元神用经》曰：\"成功之后，男子关元气聚精，女人胎泽不结婴，虽动于欲，不能与神争。 \"此是成胎之中【后】真精返为神，此是上清也。",
      "translated_text": "\"Banish greed, wrath, and delusion; sever the bonds of care and anxiety.\nRefine the turbid to cultivate pure nature, and you shall not fall into evil destinies.\nAbide in stillness and embrace non-action—thus do I possess the qualities of a man.\nNon-being has no form; being has its meaning.\nInwardly perceive form and sound as empty, with not even a hair’s attachment.\nRely on earth as the foundation of Kun; the primal yang arises from the ground.\nLead and mercury are not the same, yet qi and spirit share a single principle.\nThe vast and numinous heart—mind and spirit can govern it.\nWhen the one qi returns to spring harmony, it soars beyond the clouds.\nAccompanying you to wander the Great Clarity—this is called the gatha of true suchness.\n\nThe Way of Qian is movement; the Way of Kun is stillness.\nTo cultivate nature and life, one must begin with stillness.\nYou are originally still—why then seek to cultivate?\nThe Way of Kun is turbid; the Way of Qian is pure.\nTo cultivate nature and life, one must seek purity.\nOnly by refining the turbid into the pure can one enter the Dao and attain fruition.\n\nThe *Scripture of the Divine Embryo’s Longevity and Function* states:\n‘After success, in men the qi of the Gate of Life gathers essence; in women the womb’s moisture does not congeal into an infant. Though desire stirs, it cannot contend with spirit.’\nThis is the true essence returning to spirit in the midst of forming the embryo—this is the Highest Clarity.\"",
      "overlap_context": " success may come more easily than for the firm. The firm may take three years to subdue qi; the yielding may achieve it in one, for the elixir is within the body. Yuanjun Sun Bu’er said:\n‘Men and women are originally one qi, differing in purity and turbidity, movement and stillness. If a woman wishes to cultivate the real, she must gather her true origin. Within yin lies primordial yang—preserve clarity and do not discard it. Understand that form and desire are originally without encumbrance.’”",
      "start_char": 5621,
      "end_char": 5878,
      "start_sentence": 223,
      "end_sentence": 238,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.291506290435791,
      "metadata": {
        "source_file": "dao\\藏外\\男女丹工异同辩.txt",
        "category": "藏外"
      }
    }
  ]
}