{
  "source_id": "皇天上清金阙帝君灵书紫文上经",
  "source_file": "chunked_daozang\\皇天上清金阙帝君灵书紫文上经.json",
  "total_chunks": 4,
  "total_original_chars": 4966,
  "total_translated_chars": 30894,
  "total_translation_time": 155.7814166545868,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\本文类\\皇天上清金阙帝君灵书紫文上经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Supreme Clarity Scripture of the Golden Gates Sovereign Lord’s Numinous Writ in Purple Text**\n\n**Scripture Title:** *The Supreme Clarity Scripture of the Golden Gates Sovereign Lord’s Numinous Writ in Purple Text* (abbreviated as *Numinous Writ in Purple Text*).\nAuthor unknown, approximately dated to the Eastern Jin dynasty. A foundational scripture of the early Shangqing (Supreme Clarity) tradition. Comprises one scroll. Base text from the *Daoist Canon of the Zhengtong Era*, *Dongshen* section, *Benwen* category.\n\n---\n\nThe *Supreme Clarity Scripture of the Golden Gates Sovereign Lord’s Numinous Writ in Purple Text* was received by the Five Venerable Perfected Ones and the Lord of the Immortal Capital, who, by command of the Sagely Lord, transmitted it to the Azure Lad. The Azure Lad then passed it to Wang Yuanyou, instructing him to teach it to those whose bone structure and mystical names were inscribed in the registers of immortality—those destined to receive this text.\n\nThe Great Lord of the Azure Lad of the Eastern Sea in the Eastern Palace of Fangzhu, having purified himself in the Yellow Chamber of the Numinous Pavilion within the Cinnabar Tower for three years, then ascended in a cloud chariot of jade-green radiance, borne by the Three Numinous Ones and streaming auspicious clouds. Clad in a flying robe of kingfisher-green feathered dragon silk, he was accompanied by a thousand perfected ones from the Mulberry Grove as they ascended to the Golden Gates of Supreme Clarity to request the *Numinous Writ in Purple Text*.\n\nWithin the Golden Gates resided the Four Sovereign Lords, with the Sagely Lord seated to the left in the Palace of Vermilion Jade and Azure Space, attended by thirty thousand perfected maidens and divine women. Poisonous dragons, thunder tigers, and simurghs of the heavens stood guard at the gates, while serpents a thousand fathoms long coiled along the walls. Winged horses and great-beaked birds with outstretched talons gathered in the vast courtyard. The celestial majesty blazed resplendent, its radiance illuminating the eight directions. Mystic banners fluttered in the wind, canopies whirled in dance, jade trees chimed with resonant tones, and jasper grasses murmured like flutes. Cloud-borne songs rose in chorus, phoenixes sang upon the Azure Terrace, divine consorts harmonized in unison, and roc and simurgh danced in measured steps.\n\nWhen the Azure Lad arrived, he prostrated himself and advanced, bowing his head to the north, and spoke: \"Your humble servant, Fanmei, ventures to address the Sagely Emperor and August Sovereign before your throne. In former times, I governed the Great Void and presided over the flying perfected ones, overseeing the vast expanse of the Five Numinous Ones and the transcendent visions of the Mystic Masters. I ascended through the pure yang, ringing the bells of the White Fields, illuminating the Three Observances, and suffusing the wondrous awakening with misty radiance. I expanded the numinous gardens, bathed in the limpid streams of the Azure Valley. Thus, I roamed the boundless netherworlds, strode the heights of the Mystic Elders, aligned the Nine Luan with the cliffs of Lang’e, and released my flowing light above the dark splendor of the unseen. I traversed the twin mysteries, exhausted the limits of numinous vision, stilled the void in the Dragon’s Emptiness, and concealed the subtlest traces within the Cinnabar Chamber. I opened the divine portals to surrender to transformation, following the shifts of form to disperse all burdens.\n\nAt that time, my bonds were shattered, my spirit and qi subtly harmonized. I shed the Five Spirits, refined them through the empty and cavernous, leapt like a dragon into the azure ford, and roused myself with unbridled exultation. Though I was content within the Eight Observances, in truth, I remained unbound by the radiance of the heavens. Yet I reflected that true talent had not yet awakened, and the numinous uncut jade lay dormant, unpolished. I wished to scatter wind through the orchid groves, play flutes upon the cloudy shores, uplift the Seven Clarities, and cleave through the congealed darkness to reveal the obscure. I wondered: Might the *Numinous Writ in Purple Text* be granted for instruction below?\"\n\nAt that moment, the Sagely Lord was embracing the transformations beyond the loom of creation, his lofty thoughts drifting afar. He was inscribing the *Great Cavern Scripture of the Mystic* to instruct the Left Ministers of the Perfected Ones and the several hundred jade maidens and numinous lads. He neither heeded the Azure Lad’s petition nor glanced up from his writing.\n\nThereupon, the Azure Lad prostrated himself again, advancing on his knees to renew his entreaty without cease. Then, after a long while, the Sagely Lord set aside his loom and reclined, suddenly sighing: \"Your words reach the profound, your sincerity pierces the obscure—your devotion is truly utmost.\" Thereupon, he pointed to the empty realm, his countenance revealing compassion.\n\nHe then took up his cloud-hook zither, strummed it, and played. The pure and numinous tones resounded brilliantly, cascading into a hundred harmonies. The jade vibrations shook the Nine Voids, piercing the clarity of the Great Empyrean. He sang the *Chapter of the Divine Continent of the Great Cavern*, the *Melody of Congealed Spirits*, the *Mystic Poems and Numinous Verses*—celestial strains of the subtlest resonance, guiding the illumination of the central qi, their notes pure and luminous. The lyrics were as follows:\n\n> The qi of the profound void and Supreme Clarity,\n> The Three Primes ascend the radiant haze.\n> The abyss turns to open the numinous portals,\n> The Seven Gates unfurl for the feathered lads.\n> The vast expanse reveals the Cinnabar Empyrean’s vision,\n> The limpid solitude manifests the unseen workings.\n> Awakening to the profound assembly,\n> One dwells at the edge of the flying Great Void.\n> The Terrace of the Intestines spans the wilds of the Great Cavern,\n> The secluded and transcendent glow with the luster of divine mushrooms.\n> The inherited realm veils the wheel of the void,\n> The remote dwelling naturally communes with the unseen.\n> The lofty assembly gathers at the Gate of the Mystic Constellation,\n> The cold summit pays homage to the Jade Emperor.\n> The divine radiance echoes with the crimson numinous sound,\n> The empty drum resounds with the jade bell.\n> The Nine Bridles guide the cloud chariot,\n> Roaming freely upon the Purple Mist Peak.\n> The Cinnabar Mound opens the Azure Chamber,\n> The Green Court unfolds the Five Chambers.\n> The Golden Gates gleam with towering majesty,\n> The misty canopy shelters the Supreme Clarity Palace.\n> Tasting the essence of sun and moon,\n> Gazing toward the realm of the formless.\n> The profound attainment awakens the Three Numinous Ones,\n> Amidst the desolation of kalpas immeasurable.\n> Why sit at the crossroads,\n> The Five Difficulties weighing upon your breast?\n> Why not ride the Red Infant,\n> Mounting my Lord of the Mud-Pill Palace?\n> Neither death nor life,\n> Neither beginning nor end.\n\nWhen the Sagely Lord finished his song, he turned to the Azure Lad, bade him sit, and served him the nectar of flowing clouds, fruits of adamantine hardness, red trees bearing white seeds, and crimson woods with azure fruits. He then commanded the Five Venerable Perfected Ones and the Left Minister of the Immortal Capital to open the cloud-brocade satchel of the Purple Calyx Jade Case and retrieve the *Supreme Clarity Scripture of the Golden Gates Sovereign Lord’s Numinous Writ in Purple Text*, bestowing it upon the Azure Lad to transmit below to those whose names were inscribed in the Jade Registers of the Mystic Palace and were destined to become perfected ones.\n\nThe Azure Lad withdrew, bowed deeply, and received the scripture, returning with it to the Eastern Palace of Fangzhu.\n\nThe *Numinous Writ in Purple Text* was the essential text for cultivation received by the Sagely Lord Li in his youth. It comprises the oral instructions of the Celestial Emperor of the Great Tenuity and the Jade Clarity Sovereign of the Purple Tenuity, the two Celestial Emperors, and the methods for attaining perfection. It encompasses the great and expansive affairs of the Supreme August One, all meticulously compiled, arranged, and applied in invocations and recitations, ordered sequentially into a single scroll. It was inscribed upon tablets of purple jade with azure-gold characters.\n\nThus, the Tortoise Mother wielded the brush, the Perfected Lads swept the mat, the Heavenly Consorts attended with incense, and the Jade Lads bound the pages. It was named the *Supreme Clarity Scripture of the Golden Gates Sovereign Lord’s Numinous Writ in Purple Text* and entrusted to the Five Venerable Perfected Ones and the Left Minister of the Immortal Capital, to be stored in the Purple Calyx Jade Case and encased in a satchel of cloud brocade.\n\nThose attending the text were commanded to have ten Jade Maidens stand to its left and right, while those recording the sacred lord’s chronicles were commanded to have ten Jade Lads, who together oversaw the Daoist practitioners who had received the scripture, reporting their merits and transgressions to the Primordial Masters of the Supreme Clarity’s Mystic Realm. Major faults were to be examined by the Three Officials, minor faults would forfeit one’s life-record and shorten one’s years, grave sins would bring calamity upon one’s three generations of ancestors, while lesser sins would afflict only the offender. Disrespect would cause the spirits to depart, and defilement would cause the text to withdraw. Those who studied immortality and beheld the numinous writ were to rise and bow, washing their hands and burning incense. The celestial overseers were ever vigilant—how could one not be reverent and cautious?\n\nNone outside the lineage of transmission were permitted to recklessly disclose its passages, for to do so would violate the statutes against leaking celestial scripture.\n\nThe *Supreme Clarity Scripture of the Golden Gates’ Numinous Writ in Purple Text*, the method of \"Gathering Flying Roots and Ingesting Solar Qi,\" was once received from the Celestial Emperor of the Grand Tenuity. It is also called *The Scripture of Cinnabar Elixir, Golden Essence, and the Radiant Water Mother*. At the time when the sun first emerges, one should face east toward the sun, click the teeth nine times, then silently intone the names of the solar soul and the five emperors within the sun:\n\n*\"Solar soul, Vermilion Radiance, Shining Veil, Green Reflections, Returning Rosy Clouds, Crimson Lad, Mystic Flame, Whirlwind Image.\"*\n\nAfter silently reciting these sixteen characters, close the eyes and clench the fists, visualizing the five-colored streaming rosy clouds within the sun descending to envelop the entire body, down to the feet. Then visualize the five colors ascending to the crown of the head, whereupon the sunlight and streaming rosy clouds of five hues all enter the mouth. Within the sunlight and streaming rosy clouds, there further appears a purple qi, as large as the pupil of the eye, layering in dozens, resplendent amid the five lights—this is called the *Flying Root Water Mother*. Together with the five qi, it enters the mouth. Facing the sun, one swallows the rosy clouds, making forty-five gulps of qi. After swallowing the qi, swallow the saliva nine times, then click the teeth nine times and softly intone:\n\n*\"Crimson Hut, Cinnabar Qi, Round Heaven Nurtures Essence,\nReceiving the yielding with firmness, the flame’s yin blossom,\nSolar Orb’s Primordial Radiance, styled Great Brightness,\nNine Yangs harmonize as one, twin mists arise together,\nCongealing the hun and harmonizing the po, the five qi’s essence,\nWithin them the Five Emperors are born, riding the light to govern form,\nGathering the flying in emptiness, the severed root attains fullness,\nHead wrapped in Dragonflower, clad in vermilion and girded in azure,\nReining the Crow’s flowing mystery, rosy clouds reflect Supreme Clarity,\nBestowed the jade tablet of scripture, name engraved in the Golden Pavilion,\nFeasting on morning blossoms, uniting with the Perfected in numinosity,\nSoaring immortals of the Grand Tenuity, ascending to the Purple Court.\"*\n\nUpon completion, bow twice toward the sun. Among the ranks of true immortals, not one in ten thousand knows the name of the solar soul. This Dao is profoundly mysterious—it is not for those who consume blood or foul flesh to hear.\n\nOn overcast days without sun, one may perform this within a purified chamber. Daoists of pure cultivation and profound resonance with the supreme may practice it without waiting to see the sun. If a Daoist abstains from grains in the mountains and forests, maintains perpetual fasting on the Five Peaks, severs ties with the dusty world, and dwells in distant contemplation of purity, by daily drinking the sun-root’s rosy clouds and ingesting the essence of the Great Yang, they will immediately feel their body suffused with jade-like luster and their face aglow with streaming light.\n\nFor those entangled in worldly affairs, unable to still their form, drifting through worldly paths with hearts ensnared by the web of glory, one should perform this on the first, third, fifth, seventh, ninth, thirteenth, fifteenth, seventeenth, nineteenth, and twenty-fifth days of the lunar month, following the above method ten times within a month. These days are when the solar soul descends to connect, the flying roots are full, and the water mother dispels dreams. Practicing this for eighteen years, the Supreme Clarity will refine one with golden perfection, polish one with jade radiance, and elevate one to the rank of Jade Emperor, soaring through the great void, riding the threefold splendor of the flowery canopy to illuminate the world below.\n\n**Grand Tenuity’s Solar Qi Ingestion and Luminous Talisman**\nIf one cannot regularly inscribe the talisman on the night of the lunar month’s end at midnight, one must not miss the night of the odd-month’s end. On the night of the lunar month’s end at midnight, write the talisman in vermilion on blue paper, face east, and swallow it to first announce oneself to the solar soul. When ingesting the talisman, hold the breath, grasp the talisman in the left hand, and silently intone:\n\n*\"Grand Tenuity’s Cinnabar Measure Pavilion, styled Opening Brightness,\nSummon the sun’s upper soul to transform my form,\nAt dawn I prepare in solemnity, departing from the Round Court,\nFlying Flower Water Mother, Solar Root Golden Essence,\nPurple reflections streaming light, styled the Five Numinosities.\"*\n\nUpon completing the incantation, swallow the talisman.\n\nThe *Supreme Clarity Scripture of the Golden Gates’ Numinous Writ in Purple Text*, the method of \"Gathering Yin Blossoms and Ingesting Lunar Essence,\" was once received from the Celestial Emperor of the Grand Tenuity. It is also called *The Scripture of Yellow Qi, Yang Essence, the Hidden Heaven, and the Concealed Moon*. When the moon first emerges, one should face west toward the moon, click the teeth ten times, then silently intone the names of the lunar soul and the five ladies within the moon:\n\n*\"Lunar soul, Warm Mist, Whispering Breeze, Fragrant Bloom, Veiled Luminance, Boundless Grace, Empty Mystery, Orchid’s Elegance, Luxuriant Splendor, Knotted Radiance, Soaring Purity, Pure Gold, Clear Luster, Steadfast Presence, Towering Standard.\"*\n\nAfter silently reciting these twenty-four characters, close the eyes and clench the fists, visualizing the five-colored streaming essence within the moon descending to envelop the entire body, down to the feet. Then visualize the five qi ascending to the crown of the head, whereupon the moonlight and streaming essence of five hues all enter the mouth. Within the moonlight and streaming essence, there further appears a yellow qi, as large as the pupil of the eye, layering in dozens, following within the five-colored moonlight—this is called the *Flying Yellow Lunar Blossom Essence*. Together with the five qi, it enters the mouth. Facing the moon, one swallows the essence, making fifty gulps. After swallowing the qi, swallow the saliva ten times, then click the teeth ten times and softly intone:\n\n*\"Yellow Essence, Mystic Radiance, Primordial Yin’s Upper Qi,\nScattering the flourishing cold whirlwind, the numinous branches gather the stomach,\nEmpty waves and rippling brilliance, tempering the vessel of purity,\nLunar essence, night’s radiance, honored in the Mystic Palace,\nFive Lords and Ladies, each guarding their maternal positions,\nThe Red Child flies in, the Infant follows in succession,\nRevolving yin’s triple convergence, light and mystery pervade the ten thousand directions,\nHarmonizing the hun and restraining the po, the five wombs flow in communion,\nRiding the rosy clouds to fly the essence, soaring in emptiness to the east,\nHead crowned with numinous clouds, radiant blossoms summon the wind,\nLeft girded with the Dragon Talisman, right adorned with the Tiger Insignia,\nPhoenix plumes and vermilion sashes, jade pendants and golden earrings,\nThe soaring tree binds the slopes, styled the Wood King,\nThe divine foundation controls the root, waxing and waning,\nBright essence reflects within, mystic water spouts the bridge,\nBestowed the jade tablet of scripture, name engraved in the Cloud Chamber,\nFeasting on lunar blossoms, uniting with the Perfected in harmony,\nSoaring immortals of the Purple Tenuity, ascending to pay court to the Grand August.\"*\n\nUpon completing the invocation, bow twice toward the moon. Visualize the sun and moon, whether sitting or standing as is convenient.\n\nAmong the immortals’ officials, none know the name of the Moon’s essence. Those Perfected Ones who did know it in their time—if the sky is overcast and the moon absent, the practice may be performed indoors. The essential method follows the same principles as the \"Drinking Sunlight\" technique. Practicing nightly, one will swiftly perceive the body radiating light, the eyes emitting flying essence.\n\nThe crucial days for this method are the second, fourth, sixth, eighth, tenth, fourteenth, sixteenth, eighteenth, twentieth, twenty-second, and twenty-fourth of the lunar month—eleven occasions in a month, sufficient to attain immortality. On these evenings, when yin and yang converge, the three *qi* overflow, the moon’s waters crystallize into blossoms, and the Yellow Spirit descends to receive them.\n\nAfter eighteen years of practice, the Supreme Clarity will refine the hun-soul and replace the po-soul, illuminating them with jade light, so that one may ride the dark reins of radiance and soar through the great void.\n\n**Purple Tenuity’s Method for Drinking Moon Essence and the Great Yin’s Generative Talisman**\nIf unable to inscribe the talisman at midnight on every lunar eclipse, one must not miss the eclipse of even-numbered months. The first month is odd; the second, even.\n\nAt midnight on the eclipse, write in yellow on blue paper, face east, and consume it after first invoking the Moon’s essence. At this time, one should first drink the \"Luminous Spirit-Unlocking Talisman.\" While drinking the moon talisman, hold the breath, grasp the talisman in the right hand, and silently intone:\n\n*\"Purple Tenuity’s yellow script, named the Great Mystery,\nSummons the moon’s blossom-waters to nourish the po and harmonize the hun.\nIn the midst of solemn rites, issuing from the Mystic Pass,\nConcealing heaven and veiling the moon, the Five Numinous Ladies,\nNinefold flying radiance illumines the Mud-Pill Palace.\"*\n\nUpon completing the invocation, consume the talisman.\n\n**The Purple Text of the Great Mystery’s Scripture: Method for Restraining the Three Hun-Souls**\nOn the evenings of the third, thirteenth, and twenty-third days of the lunar month, at this time, the first and second hun-souls grow unsettled. The *Scintillant Spirit* drifts, the *Womb-Light* releases its form, and the *Dark Essence* stirs and calls. *Scintillant Spirit*, *Womb-Light*, and *Dark Essence* are the names of the three hun-soul deities. On these nights, they abandon the body to wander, swiftly returning to their original chamber—or else they may be detained by external spirits, captured by spectral entities, or fail to return in time, their forms scattered. If they encounter external spirits, the two *qi* will clash, agitating the *Red Child* and inducing wayward thoughts, their comings and goings formless, the heart sorrowful and the mind vexed.\n\nDaoists must restrain and retain them to prevent their straying. The method of restraint: lie supine, remove the pillow, stretch the legs, cross the hands over the heart, close the eyes, and hold the breath for three cycles. Knock the teeth three times, then visualize a red *qi* the size of a chicken’s egg rising from within, ascending through the eyes, and emerging outward. The red *qi* expands to envelop the body, flowing downward to the feet and upward to the crown of the head, transforming into fire that encircles the body, suffusing it inside and out until it glows like burning charcoal.\n\nOnce complete, one will feel a slight warmth in the body. Knock the teeth three more times, then silently call the names of the three hun-souls—*Scintillant Spirit*, *Womb-Light*, *Dark Essence*—commanding them to halt. Softly intone:\n\n*\"Palace of the Great Mystery, Primordial Yellow and First Green,\nRefine the three hun-souls within, let Womb-Light rest in peace.\nThe divine treasure of the Jade Chamber is born with me;\nDo not move recklessly, for the Supreme Numinous watches.\nIf you wish to fly, you may only ascend to the Great Ultimate and Supreme Clarity.\nIf you hunger or thirst, you may only drink the jade essence of the returning waters.\"*\n\n**The Purple Text of the Great Mystery’s Scripture: Method for Governing the Seven Po-Souls**\nOn the evenings of the new moon, full moon, and lunar eclipse, at this time, the seven po-souls wander and drift, roaming through filth and defilement. They may consort with blood offerings, mingle with ghosts and specters, or enter into dead corpses. They may seduce the *Red Child*, gather in licentiousness to assail dwellings, or report a person’s sins to the Three Officials and the River Earl. They may transform into *wangliang* spirits to afflict people with malevolence, or lead ghosts into the body to summon evil and slay the essence. All the ailments and afflictions of the living arise from the po-souls’ transgressions. Their nature delights in human death; their malady desires human ruin.\n\nDaoists must govern, refine, command, and subdue them. The first po-soul is named *Corpse Dog*, the second *Crouching Arrow*, the third *Sparrow Yin*, the fourth *Swallowing Thief*, the fifth *Non-Poison*, the sixth *Expelling Filth*, and the seventh *Stinking Lung*—these are the yin names of the seven po-souls, the turbid spirits within the body.\n\nThe method of restraint: lie properly, remove the pillow, stretch the legs, and cover the ears with the palms so the fingertips meet at the nape. Hold the breath for seven cycles, knock the teeth seven times, and visualize a white *qi* the size of a small bean at the tip of the nose. Gradually, it expands to envelop the body in nine layers, descending to the feet and ascending to the crown of the head.\n\nOnce complete, the white *qi* suddenly transforms into celestial beasts: two Azure Dragons in the eyes, facing outward; two White Tigers in the nostrils, also facing outward; a Vermilion Phoenix above the heart, facing the mouth; a Dark Tortoise beneath the left foot; a Numinous Serpent beneath the right foot. In the ears stand Jade Maidens, clad in dark brocade, guarding the ear gates, each holding a flame in hand.\n\nAfter a long while, when all is complete, swallow saliva seven times, knock the teeth seven times, and call the names of the seven po-souls. Then softly intone:\n\n*\"Ninefold white qi revolves, restraining the po-souls’ malevolence.\nCelestial beasts guard the gates; maidens hold the passes.\nRefine the po-souls to harmony, that they may dwell peacefully with me.\nDo not move recklessly; observe and examine the source of form.\nIf you hunger or thirst, you may only drink the moon’s yellow and the sun’s cinnabar.\"*\n\nUpon completing the invocation, the seven po-souls will be inwardly restrained, bound to obedience.\n\nIf practiced regularly, the turbid po-souls will gradually dissipate below, returning to harmonize with the body. They will ascend to unite with the Three Palaces, merging with the primordial to attain numinous union.\n\nWithin the human body reside the gods of the Three Primordial Palaces: the Great Lord of the Mysterious Pass at the Gate of Destiny, along with the gods of the three hun-souls, totaling seven deities, all dwelling within the form. These are the lords of great benevolence and supreme fortune, desiring to grant humans longevity. The seven po-souls, also born within the body, act as rebels that assail it, and thus must be restrained.\n\nDaoists often seek the methods of immortality yet remain ignorant of the Way to restrain the po-souls, laboring in vain. The Three Primordial Palaces are located as follows: the Upper Primordial Palace resides within the Mud-Pill, its god the Red Child, named Three Primordials First, also called Imperial Minister; the Middle Primordial Palace lies at the center of the Crimson Chamber, its god the Perfected One, named Child Southern Cinnabar, also called Central Radiance Firm; the Lower Primordial Palace of the Cinnabar Field is three inches below the navel, its god the Infant, named Primordial Yang Prosperity, also called Mysterious Below the Valley. These are the Three Ones.\n\nWhen seeking to restrain the hun and po-souls, first silently invoke their names, visualizing the three gods as jade-hued with golden radiance, bearing the appearance of infants. The Upper and Middle Primordial gods wear red, while the Lower Primordial god wears yellow, their heads resembling those of newborn babes. During Daoist practices and qi-absorption, likewise visualize and invoke their names.\n\nThe Gate of Destiny is the navel, and the Mysterious Pass is the pathway through which the umbilical cord once passed. Within it lies the Palace of Life, where the Great Lord resides, named Peach Prosperity, styled Union Prolonged. Clad in vermilion robes and crowned with a purple lotus coronet, he sits at the Gate of Destiny, attended by the gods of the three hun-souls. The Great Lord constantly holds the Heavenly August Symbol Talisman, which harmonizes and infuses primordial qi, replenishing the womb and reversing the placenta.\n\nBefore retiring at night, first hold the breath for twenty-four cycles, then silently invoke the Great Lord’s name three times. Swallow saliva fifty times, knock the teeth thrice, and softly intone:\n\n*\"Great Spirit of the Womb, Heavenly August Lord of the Imperial Net,\nHolding the Womb Talisman, crowned with a purple coronet,\nYellow revolves, red transforms, ascending to refine the Gate of Destiny,\nTransforming spirit to rebirth, the Six Harmonies intermingle,\nThe body gleams with radiance, jade maidens dwell within.\"*\n\nAfter completing the invocation, if practiced regularly for eighteen years, the Great Lord will be able to stir the Three Fields on the left and guide the Three Qi on the right. The fields will transform into soaring flight, and the qi will metamorphose into a dark dragon. Above, he commands the twenty-four spirits; below, he directs the hun-souls. He summons the Six Jia of the Yang Bureau and the Six Ding of the Yin Bureau, leading a thousand chariots and ten thousand riders to ascend to heaven in broad daylight—all through the influence of Lord Peach.\n\n**The Heavenly August Symbol Talisman of the Supreme Emperor Lord of the Golden Watchtower of Highest Clarity**\nAlso called the *Nine Revolutions of the Primordial Five Penetrations Eight Intervals Talisman of the Emperor Lord*.\n\nIf performing the ritual in a separate chamber, first inscribe this talisman, place it in a brocade pouch, and wear it before proceeding. The Heavenly August Symbol Talisman is bestowed upon the Great Lord of the Life Palace, Peach Prosperity Union Prolonged, to harmonize primordial qi and govern the womb’s essence.\n\nInscribe it in vermilion on blue paper. On the first day of the lunar month and the night of the full moon, face north, hold the talisman in the left hand, hold the breath, and silently intone:\n\n*\"Celestial Writ of the Heavenly Emperor, numinous talisman of the August Symbol,\nHarmonizing primordial qi, governing essence to reverse the womb,\nEternal Infant of ten thousand years, soaring immortal at the Heavenly Pivot,\nGreat Lord of the Life Palace, clad in vermilion, crowned in purple,\nConspire with me in this endeavor.\"*\n\nUpon completing the invocation, ingest the talisman, then rise and bow twice. Perform this ritual while lying in bed. If a Daoist practices the Way of Returning Essence, cycling yellow to red, infusing the morning’s essence to irrigate destiny, channeling fluids to nourish the elixir, causing both man and woman to share the cinnabar radiance and a jade-like complexion, they should know the essential name of the Great Lord and ingest the Symbol Talisman to attain agelessness.\n\nIf one merely performs the practices without knowing the gods’ names, returns essence without ingesting this talisman, remains ignorant of its invocations, or fails to discern the palaces where the gods reside, even if they attain a thousand years of life, they will ultimately return their corpse to the Great Yin, accumulating eons of existence only to surrender their bones to the Three Bureaus.\n\nWhen Daoists retire at night, they should regularly visualize the Great Lord and perform the invocation. On the first and fifteenth days of the lunar month, ingest the talisman to circulate the womb’s essence—through this, they too may become immortals without the need for the arts of returning essence through male and female.\n\nYet governing women to seek flight or cycling qi to aspire to celestial immortality is more perilous than fire and water, swifter in destruction than axes and hatchets. Unless one possesses a heart of ashes and embraces the One, such pursuits may lead to ruin. For those of middling ability, this is like swallowing a sword and hoping the throat remains unharmed—how can success be assured?\n\n**Taboos of the Great Spirit Lord of the Life Palace:**\nAvoid consuming raw blood, burning the fur of the six livestock, or burning the skins, leaves, or any pungent vegetables, as these disrupt the womb’s qi and offend the infant spirit. Exercise caution.\n\nHere ends the *Supreme Scripture of the Purple Texts and Numinous Writ of the Golden Watchtower of Highest Clarity, Emperor Lord of the August Heaven*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "皇天上清金阙帝君灵书紫文上经 经名：皇天上清金阙帝君灵书紫文上经。 简称《灵书紫文》。 撰人不详，约出於东晋。 系早期上清派重要经典。 一卷。 底本出处：《正统道藏》洞神部本文类。 皇天上清金阙帝君灵书紫文上经 五老上真仙都君受，圣君命授青童君，青童君以传王远游，使下教骨相玄名有仙籍之人，应得此文者。 方诸东宫东海青童大君，清斋於灵榭丹阙黄房之内三年，时乘碧霞三灵流景云舆，建带飞青翠羽龙帔，从桑林千真，上诣上清金阙，请受灵书紫文上经。 金阙中有四帝君，其后圣君处其左，居太空琼台丹玕之殿，侍女众真三万人，毒龙雷虎玃天之兽，备门抱关，蛟蛇千寻，卫於墙析，飞马奔雀大翅之乌，叩啄奋爪，陈于广庭，天威焕赫，流光八朗，风鼓玄旌，回舞旄盖，玉树激音，琳草作籁，众吹云歌，凤呜青泰，神妃合唱，鹏舞鸾迈。 青童既到，匍匐而前，捧首北面而言曰：小臣梵湄，敢献言於圣帝明皇几前，在昔统拔太虚，领宰飞真，察五灵之广肆，司玄师之逸观，腾濯清阳，呜铃素町，朗秀三观，庵蔼妙觉，廓落灵囿，濯澜青谷，是以逡巡长罗，高步玄老，齐九鸾於阆崿之墟，放流光於冥华之上，浪达双玄，穷标灵观，冲漠静於龙空，藏毫芒於丹室，启神扉而委化，随形迁而散累。 是其时也，缠梏披越，神气微夷，萧脱五神，流练空洞，鳞跃碧津，慷慨条畅，虽自足於八观，实无阑於霄映矣。 顾念真才未启，灵璞寝磨，欲使风洒兰林，奏籁云涯，发拔七爽，剖凝喻幽，不审灵书紫文，可得而下教乎。 于时后圣君方拥机外化，高拂遐想，方注笔於大洞玄经，以教授诸上真左卿，及灵童玉女数百人也。 既不耳青童之陈辞，又未暂缀咏於视矣。 於是青童君重启，伏膝进行，固请不已。 尔乃圣君良久推机偃处，忽尔长叹曰：苦辞玄达，精诚来悟，子甩心之至矣。 於是指点虚域，有愍焉之容也。 爰乃引云钧之琴，抚而弹之，清灵响粲，激落百音，琼振九虚，彻朗太霄，而歌大洞神州之章，凝魂之曲，玄诗灵藻，天韵希微，领照仲气，频音清徽，其辞曰： 玄虚上清气，三素凌华蒙。 渊向启灵扉，七门扇羽童。 豁落丹霄观，清寥冥运彰。 有觉悟玄会，涯栖飞太空。 肠台太洞野，幽逸英芝光，遗界翳虚轮，绝宅自冥通。 高会玄辰阙，寒首朝玉皇。 神映朱灵音，虚鼓响琼钟。 九辔纵云軿，逍遥紫霞峰。 丹陵启碧室，绿庭披五房。 金阙焕嵯峨，蔼沬木盖切上清宫。 味此日月华，盼彼无形方。 玄致三灵觉，萧条劫仞中。 何为当涂坐，五难乘子胸。 何不御赤婴，乘我泥丸公。 不死亦不生，不始亦不终。 於是圣君吟歌毕，顾引青童使坐，设流霞之浆，环刚之果，赤树白子，绛木青实。 乃命五老上真仙都左公，开紫蕊玉笈云锦之囊，出灵书紫文上经，以付青童君，下授有玄宫玉名，当为真人者。 青童君退席，稽首拜而受之，以还方诸东宫。 《灵书紫文上经》，是后圣李君自少学道，所受修行要文者也。 乃太微天帝、紫微上真天帝玉清君，二天帝口传之诀，为真之法，上皇大度要事，皆料拔撰集施行祝说，先后相比条例，相次为一卷，刻以紫玉为简，青金为文。 於是龟母案笔，真童拂筵，天妃侍香，玉童结编，名之曰灵书紫文上经，以付五老上真仙都左公，藏於紫蕊玉笈，盛以云锦之囊。",
      "translated_text": "**The Supreme Clarity Scripture of the Golden Gates Sovereign Lord’s Numinous Writ in Purple Text**\n\n**Scripture Title:** *The Supreme Clarity Scripture of the Golden Gates Sovereign Lord’s Numinous Writ in Purple Text* (abbreviated as *Numinous Writ in Purple Text*).\nAuthor unknown, approximately dated to the Eastern Jin dynasty. A foundational scripture of the early Shangqing (Supreme Clarity) tradition. Comprises one scroll. Base text from the *Daoist Canon of the Zhengtong Era*, *Dongshen* section, *Benwen* category.\n\n---\n\nThe *Supreme Clarity Scripture of the Golden Gates Sovereign Lord’s Numinous Writ in Purple Text* was received by the Five Venerable Perfected Ones and the Lord of the Immortal Capital, who, by command of the Sagely Lord, transmitted it to the Azure Lad. The Azure Lad then passed it to Wang Yuanyou, instructing him to teach it to those whose bone structure and mystical names were inscribed in the registers of immortality—those destined to receive this text.\n\nThe Great Lord of the Azure Lad of the Eastern Sea in the Eastern Palace of Fangzhu, having purified himself in the Yellow Chamber of the Numinous Pavilion within the Cinnabar Tower for three years, then ascended in a cloud chariot of jade-green radiance, borne by the Three Numinous Ones and streaming auspicious clouds. Clad in a flying robe of kingfisher-green feathered dragon silk, he was accompanied by a thousand perfected ones from the Mulberry Grove as they ascended to the Golden Gates of Supreme Clarity to request the *Numinous Writ in Purple Text*.\n\nWithin the Golden Gates resided the Four Sovereign Lords, with the Sagely Lord seated to the left in the Palace of Vermilion Jade and Azure Space, attended by thirty thousand perfected maidens and divine women. Poisonous dragons, thunder tigers, and simurghs of the heavens stood guard at the gates, while serpents a thousand fathoms long coiled along the walls. Winged horses and great-beaked birds with outstretched talons gathered in the vast courtyard. The celestial majesty blazed resplendent, its radiance illuminating the eight directions. Mystic banners fluttered in the wind, canopies whirled in dance, jade trees chimed with resonant tones, and jasper grasses murmured like flutes. Cloud-borne songs rose in chorus, phoenixes sang upon the Azure Terrace, divine consorts harmonized in unison, and roc and simurgh danced in measured steps.\n\nWhen the Azure Lad arrived, he prostrated himself and advanced, bowing his head to the north, and spoke: \"Your humble servant, Fanmei, ventures to address the Sagely Emperor and August Sovereign before your throne. In former times, I governed the Great Void and presided over the flying perfected ones, overseeing the vast expanse of the Five Numinous Ones and the transcendent visions of the Mystic Masters. I ascended through the pure yang, ringing the bells of the White Fields, illuminating the Three Observances, and suffusing the wondrous awakening with misty radiance. I expanded the numinous gardens, bathed in the limpid streams of the Azure Valley. Thus, I roamed the boundless netherworlds, strode the heights of the Mystic Elders, aligned the Nine Luan with the cliffs of Lang’e, and released my flowing light above the dark splendor of the unseen. I traversed the twin mysteries, exhausted the limits of numinous vision, stilled the void in the Dragon’s Emptiness, and concealed the subtlest traces within the Cinnabar Chamber. I opened the divine portals to surrender to transformation, following the shifts of form to disperse all burdens.\n\nAt that time, my bonds were shattered, my spirit and qi subtly harmonized. I shed the Five Spirits, refined them through the empty and cavernous, leapt like a dragon into the azure ford, and roused myself with unbridled exultation. Though I was content within the Eight Observances, in truth, I remained unbound by the radiance of the heavens. Yet I reflected that true talent had not yet awakened, and the numinous uncut jade lay dormant, unpolished. I wished to scatter wind through the orchid groves, play flutes upon the cloudy shores, uplift the Seven Clarities, and cleave through the congealed darkness to reveal the obscure. I wondered: Might the *Numinous Writ in Purple Text* be granted for instruction below?\"\n\nAt that moment, the Sagely Lord was embracing the transformations beyond the loom of creation, his lofty thoughts drifting afar. He was inscribing the *Great Cavern Scripture of the Mystic* to instruct the Left Ministers of the Perfected Ones and the several hundred jade maidens and numinous lads. He neither heeded the Azure Lad’s petition nor glanced up from his writing.\n\nThereupon, the Azure Lad prostrated himself again, advancing on his knees to renew his entreaty without cease. Then, after a long while, the Sagely Lord set aside his loom and reclined, suddenly sighing: \"Your words reach the profound, your sincerity pierces the obscure—your devotion is truly utmost.\" Thereupon, he pointed to the empty realm, his countenance revealing compassion.\n\nHe then took up his cloud-hook zither, strummed it, and played. The pure and numinous tones resounded brilliantly, cascading into a hundred harmonies. The jade vibrations shook the Nine Voids, piercing the clarity of the Great Empyrean. He sang the *Chapter of the Divine Continent of the Great Cavern*, the *Melody of Congealed Spirits*, the *Mystic Poems and Numinous Verses*—celestial strains of the subtlest resonance, guiding the illumination of the central qi, their notes pure and luminous. The lyrics were as follows:\n\n> The qi of the profound void and Supreme Clarity,\n> The Three Primes ascend the radiant haze.\n> The abyss turns to open the numinous portals,\n> The Seven Gates unfurl for the feathered lads.\n> The vast expanse reveals the Cinnabar Empyrean’s vision,\n> The limpid solitude manifests the unseen workings.\n> Awakening to the profound assembly,\n> One dwells at the edge of the flying Great Void.\n> The Terrace of the Intestines spans the wilds of the Great Cavern,\n> The secluded and transcendent glow with the luster of divine mushrooms.\n> The inherited realm veils the wheel of the void,\n> The remote dwelling naturally communes with the unseen.\n> The lofty assembly gathers at the Gate of the Mystic Constellation,\n> The cold summit pays homage to the Jade Emperor.\n> The divine radiance echoes with the crimson numinous sound,\n> The empty drum resounds with the jade bell.\n> The Nine Bridles guide the cloud chariot,\n> Roaming freely upon the Purple Mist Peak.\n> The Cinnabar Mound opens the Azure Chamber,\n> The Green Court unfolds the Five Chambers.\n> The Golden Gates gleam with towering majesty,\n> The misty canopy shelters the Supreme Clarity Palace.\n> Tasting the essence of sun and moon,\n> Gazing toward the realm of the formless.\n> The profound attainment awakens the Three Numinous Ones,\n> Amidst the desolation of kalpas immeasurable.\n> Why sit at the crossroads,\n> The Five Difficulties weighing upon your breast?\n> Why not ride the Red Infant,\n> Mounting my Lord of the Mud-Pill Palace?\n> Neither death nor life,\n> Neither beginning nor end.\n\nWhen the Sagely Lord finished his song, he turned to the Azure Lad, bade him sit, and served him the nectar of flowing clouds, fruits of adamantine hardness, red trees bearing white seeds, and crimson woods with azure fruits. He then commanded the Five Venerable Perfected Ones and the Left Minister of the Immortal Capital to open the cloud-brocade satchel of the Purple Calyx Jade Case and retrieve the *Supreme Clarity Scripture of the Golden Gates Sovereign Lord’s Numinous Writ in Purple Text*, bestowing it upon the Azure Lad to transmit below to those whose names were inscribed in the Jade Registers of the Mystic Palace and were destined to become perfected ones.\n\nThe Azure Lad withdrew, bowed deeply, and received the scripture, returning with it to the Eastern Palace of Fangzhu.\n\nThe *Numinous Writ in Purple Text* was the essential text for cultivation received by the Sagely Lord Li in his youth. It comprises the oral instructions of the Celestial Emperor of the Great Tenuity and the Jade Clarity Sovereign of the Purple Tenuity, the two Celestial Emperors, and the methods for attaining perfection. It encompasses the great and expansive affairs of the Supreme August One, all meticulously compiled, arranged, and applied in invocations and recitations, ordered sequentially into a single scroll. It was inscribed upon tablets of purple jade with azure-gold characters.\n\nThus, the Tortoise Mother wielded the brush, the Perfected Lads swept the mat, the Heavenly Consorts attended with incense, and the Jade Lads bound the pages. It was named the *Supreme Clarity Scripture of the Golden Gates Sovereign Lord’s Numinous Writ in Purple Text* and entrusted to the Five Venerable Perfected Ones and the Left Minister of the Immortal Capital, to be stored in the Purple Calyx Jade Case and encased in a satchel of cloud brocade.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1269,
      "start_sentence": 0,
      "end_sentence": 40,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.77595663070679,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\皇天上清金阙帝君灵书紫文上经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "侍文者命玉女十人，在文之左右，侍圣君列纪者，命玉童十人，并司察有书之道士，言功纠罪，上闻上清玄中先师。 大过被考於三官，小过夺纪以促年，大罪祸及於三祖，小罪止身以受殃，轻慢则神去，污秽则文藏也。 学仙者开视灵文，皆当起拜，盥手烧香也。 天灵司察，可不慎敬矣。 诸非传授，皆不得妄说篇目，说则犯泄漏天文之科。 上清金阙灵书紫文，采饮飞根吞日气之法，昔受之於太微天帝君，一名赤丹金精石景水母之经也。 当常见日初出之时，乃对日东向，叩齿九通毕，心中阴咒，呼日魂之名，日中五帝之字曰：日魂朱景照韬绿映回霞赤童玄炎飙像。 凡心祝呼此十六字毕，仍瞑目握固，存见日中五色流霞，皆来接一身，下至两足。 又存令五色上至头顶，於是日光流霞五色，俱来入口中。 又日光流霞之中，自复有紫气，大如目童者，累重数十，炫焕在五光之中，名之曰飞根水母也。 并俱与五气来入口中，向日吞霞，作四十五咽气。 咽气毕，又咽液九过，毕，又叩齿九通，微咒曰： 赤庐丹气，圆天育精，刚以受柔，炎火阴英，日辰元景，号曰大明，九阳齐化，二烟俱生，凝魂和魄，五气之精，中生五帝，乘光御形，采飞以虚，辍根得盈，首巾龙华，披朱带青，辔乌流玄，霞映上清，赐书玉简，金阁刻名，饮食朝华，与真合灵，飞仙太微，上升紫庭。 毕，向日再拜。 真仙之中，万人已上，无有一人知日魂之名者矣。 此道玄妙，非血食臭骸可得听闻者也。 天阴无日，可於室中所卧洁处，存而为之。 清修道士，精通上感者，都可不待见日而修之也。 若道士休粮山林，长斋五岳，绝尘人间，远思清真者，得日日饮日根之霞，吞太阳之精，则立觉体生玉泽，面有流光也。 如其外累人事，未获静形，浮游世路，心拘荣网者，要以月朔、月三日、月五日、月七日、月九日、月十三日、十五日、十七日、十九日、二十五日，案而为之如上法，一月之中十过也。 此日是日魂下接，飞根盈满，水母辟梦之时也。 行之十八年，上清当炼以金真，莹以玉光，位为玉皇，飞行太空，乘华三素，以映天下。 太微饮日气开明灵符 若不能常以月晦夜半书符者，要不可失奇月晦也。 右月晦夜半，朱书青纸上，东向吞之，以先告日魂也。 临饮符时，闭气，左手执符，心祝曰： 太微丹量阙，名曰开明，致日上魂，来化某形，平旦严装，发自圆庭，飞华水母，日根金精，紫映流光，号为五灵。 祝毕，乃饮符。 上清金阙灵书紫文、采饮阴华吞月精之法，昔受之於太微天帝君，一名黄气阳精藏天隐月之经也。 当思见月初出之时也，乃对月西向，叩齿十通，毕，心中阴祝，呼月魄之名，月中五夫人之字曰：月魄暧萧芬艳翳寥婉虚灵兰郁华结翘淳金清荧艮容台标。 凡心祝呼此二十四字毕，乃瞑目握固，存见月中五色流精，皆来接一身，下至两足。 又存令五气上至头顶，於是月光流精五色，俱来入口中。 又月光精之中，自复有黄气，大如目童者，累重数十，相随在月精光五色之中，名曰飞黄月华之精也。 并俱与五气来入口中，向月吞精，作五十咽毕，咽液十过毕，又叩齿十通，微祝曰： 黄情玄晖，元阴上气，散蔚寒飙，条灵敛胃，虚波澜颖，挺濯淳器，月精夜景，玄宫上贵，五君夫人，各保母位，赤子飞入，婴儿续至，回阴三合，光玄万方，和魂制魄，五胎流通，乘霞飞精，逸虚於东，首结灵云，景华招风，左带龙符，右佩虎章，凤羽朱帔，玉佩金珰，骞树结阿，号曰木王，神基控根，有亏有充，明精内映，玄水吐梁，赐书玉札，刻名云房，饮食月华，与真合同，飞仙紫微，上朝太皇。",
      "translated_text": "Those attending the text were commanded to have ten Jade Maidens stand to its left and right, while those recording the sacred lord’s chronicles were commanded to have ten Jade Lads, who together oversaw the Daoist practitioners who had received the scripture, reporting their merits and transgressions to the Primordial Masters of the Supreme Clarity’s Mystic Realm. Major faults were to be examined by the Three Officials, minor faults would forfeit one’s life-record and shorten one’s years, grave sins would bring calamity upon one’s three generations of ancestors, while lesser sins would afflict only the offender. Disrespect would cause the spirits to depart, and defilement would cause the text to withdraw. Those who studied immortality and beheld the numinous writ were to rise and bow, washing their hands and burning incense. The celestial overseers were ever vigilant—how could one not be reverent and cautious?\n\nNone outside the lineage of transmission were permitted to recklessly disclose its passages, for to do so would violate the statutes against leaking celestial scripture.\n\nThe *Supreme Clarity Scripture of the Golden Gates’ Numinous Writ in Purple Text*, the method of \"Gathering Flying Roots and Ingesting Solar Qi,\" was once received from the Celestial Emperor of the Grand Tenuity. It is also called *The Scripture of Cinnabar Elixir, Golden Essence, and the Radiant Water Mother*. At the time when the sun first emerges, one should face east toward the sun, click the teeth nine times, then silently intone the names of the solar soul and the five emperors within the sun:\n\n*\"Solar soul, Vermilion Radiance, Shining Veil, Green Reflections, Returning Rosy Clouds, Crimson Lad, Mystic Flame, Whirlwind Image.\"*\n\nAfter silently reciting these sixteen characters, close the eyes and clench the fists, visualizing the five-colored streaming rosy clouds within the sun descending to envelop the entire body, down to the feet. Then visualize the five colors ascending to the crown of the head, whereupon the sunlight and streaming rosy clouds of five hues all enter the mouth. Within the sunlight and streaming rosy clouds, there further appears a purple qi, as large as the pupil of the eye, layering in dozens, resplendent amid the five lights—this is called the *Flying Root Water Mother*. Together with the five qi, it enters the mouth. Facing the sun, one swallows the rosy clouds, making forty-five gulps of qi. After swallowing the qi, swallow the saliva nine times, then click the teeth nine times and softly intone:\n\n*\"Crimson Hut, Cinnabar Qi, Round Heaven Nurtures Essence,\nReceiving the yielding with firmness, the flame’s yin blossom,\nSolar Orb’s Primordial Radiance, styled Great Brightness,\nNine Yangs harmonize as one, twin mists arise together,\nCongealing the hun and harmonizing the po, the five qi’s essence,\nWithin them the Five Emperors are born, riding the light to govern form,\nGathering the flying in emptiness, the severed root attains fullness,\nHead wrapped in Dragonflower, clad in vermilion and girded in azure,\nReining the Crow’s flowing mystery, rosy clouds reflect Supreme Clarity,\nBestowed the jade tablet of scripture, name engraved in the Golden Pavilion,\nFeasting on morning blossoms, uniting with the Perfected in numinosity,\nSoaring immortals of the Grand Tenuity, ascending to the Purple Court.\"*\n\nUpon completion, bow twice toward the sun. Among the ranks of true immortals, not one in ten thousand knows the name of the solar soul. This Dao is profoundly mysterious—it is not for those who consume blood or foul flesh to hear.\n\nOn overcast days without sun, one may perform this within a purified chamber. Daoists of pure cultivation and profound resonance with the supreme may practice it without waiting to see the sun. If a Daoist abstains from grains in the mountains and forests, maintains perpetual fasting on the Five Peaks, severs ties with the dusty world, and dwells in distant contemplation of purity, by daily drinking the sun-root’s rosy clouds and ingesting the essence of the Great Yang, they will immediately feel their body suffused with jade-like luster and their face aglow with streaming light.\n\nFor those entangled in worldly affairs, unable to still their form, drifting through worldly paths with hearts ensnared by the web of glory, one should perform this on the first, third, fifth, seventh, ninth, thirteenth, fifteenth, seventeenth, nineteenth, and twenty-fifth days of the lunar month, following the above method ten times within a month. These days are when the solar soul descends to connect, the flying roots are full, and the water mother dispels dreams. Practicing this for eighteen years, the Supreme Clarity will refine one with golden perfection, polish one with jade radiance, and elevate one to the rank of Jade Emperor, soaring through the great void, riding the threefold splendor of the flowery canopy to illuminate the world below.\n\n**Grand Tenuity’s Solar Qi Ingestion and Luminous Talisman**\nIf one cannot regularly inscribe the talisman on the night of the lunar month’s end at midnight, one must not miss the night of the odd-month’s end. On the night of the lunar month’s end at midnight, write the talisman in vermilion on blue paper, face east, and swallow it to first announce oneself to the solar soul. When ingesting the talisman, hold the breath, grasp the talisman in the left hand, and silently intone:\n\n*\"Grand Tenuity’s Cinnabar Measure Pavilion, styled Opening Brightness,\nSummon the sun’s upper soul to transform my form,\nAt dawn I prepare in solemnity, departing from the Round Court,\nFlying Flower Water Mother, Solar Root Golden Essence,\nPurple reflections streaming light, styled the Five Numinosities.\"*\n\nUpon completing the incantation, swallow the talisman.\n\nThe *Supreme Clarity Scripture of the Golden Gates’ Numinous Writ in Purple Text*, the method of \"Gathering Yin Blossoms and Ingesting Lunar Essence,\" was once received from the Celestial Emperor of the Grand Tenuity. It is also called *The Scripture of Yellow Qi, Yang Essence, the Hidden Heaven, and the Concealed Moon*. When the moon first emerges, one should face west toward the moon, click the teeth ten times, then silently intone the names of the lunar soul and the five ladies within the moon:\n\n*\"Lunar soul, Warm Mist, Whispering Breeze, Fragrant Bloom, Veiled Luminance, Boundless Grace, Empty Mystery, Orchid’s Elegance, Luxuriant Splendor, Knotted Radiance, Soaring Purity, Pure Gold, Clear Luster, Steadfast Presence, Towering Standard.\"*\n\nAfter silently reciting these twenty-four characters, close the eyes and clench the fists, visualizing the five-colored streaming essence within the moon descending to envelop the entire body, down to the feet. Then visualize the five qi ascending to the crown of the head, whereupon the moonlight and streaming essence of five hues all enter the mouth. Within the moonlight and streaming essence, there further appears a yellow qi, as large as the pupil of the eye, layering in dozens, following within the five-colored moonlight—this is called the *Flying Yellow Lunar Blossom Essence*. Together with the five qi, it enters the mouth. Facing the moon, one swallows the essence, making fifty gulps. After swallowing the qi, swallow the saliva ten times, then click the teeth ten times and softly intone:\n\n*\"Yellow Essence, Mystic Radiance, Primordial Yin’s Upper Qi,\nScattering the flourishing cold whirlwind, the numinous branches gather the stomach,\nEmpty waves and rippling brilliance, tempering the vessel of purity,\nLunar essence, night’s radiance, honored in the Mystic Palace,\nFive Lords and Ladies, each guarding their maternal positions,\nThe Red Child flies in, the Infant follows in succession,\nRevolving yin’s triple convergence, light and mystery pervade the ten thousand directions,\nHarmonizing the hun and restraining the po, the five wombs flow in communion,\nRiding the rosy clouds to fly the essence, soaring in emptiness to the east,\nHead crowned with numinous clouds, radiant blossoms summon the wind,\nLeft girded with the Dragon Talisman, right adorned with the Tiger Insignia,\nPhoenix plumes and vermilion sashes, jade pendants and golden earrings,\nThe soaring tree binds the slopes, styled the Wood King,\nThe divine foundation controls the root, waxing and waning,\nBright essence reflects within, mystic water spouts the bridge,\nBestowed the jade tablet of scripture, name engraved in the Cloud Chamber,\nFeasting on lunar blossoms, uniting with the Perfected in harmony,\nSoaring immortals of the Purple Tenuity, ascending to pay court to the Grand August.\"*",
      "overlap_context": "ts of purple jade with azure-gold characters.\n\nThus, the Tortoise Mother wielded the brush, the Perfected Lads swept the mat, the Heavenly Consorts attended with incense, and the Jade Lads bound the pages. It was named the *Supreme Clarity Scripture of the Golden Gates Sovereign Lord’s Numinous Writ in Purple Text* and entrusted to the Five Venerable Perfected Ones and the Left Minister of the Immortal Capital, to be stored in the Purple Calyx Jade Case and encased in a satchel of cloud brocade.",
      "start_char": 1269,
      "end_char": 2665,
      "start_sentence": 41,
      "end_sentence": 75,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.31544351577759,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\皇天上清金阙帝君灵书紫文上经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "祝毕，向月再拜。 存日月，坐立任所便耳。 仙官之中，无有一人知月魄之名者矣。 其真人当时有知之者，若天阴无月，可於室中为之。 施行要诀，如饮日光法。 夕夕为之，则立觉体生光照，目有飞精也。 要法月二日、四日、六日、八日、十日、十四日、十六日、十八日、二十日、二十二日、二十四日，一月之中十一过，亦足成仙也。 此日之夕、是阴阳之合，三炁盈溢，月水结华，黄神下接之时也。 行之．一十八年，上清当炼魂易魄，映以玉光，乘玄辔景，飞行太空。 紫微饮月精太玄阴生符 若不能常以月晦夜半书符者，要不可失偶月晦也。 正月为奇，二月为偶。 右月晦夜半，黄书青纸上，东向饮之，先以告月魄也。 是时当先饮开明灵符也。 饮月符，闭炁，右手执符，心祝曰： 紫微黄书，名曰太玄，致月华水，养魄和魂，方中严事，发自玄关，藏天隐月，五灵夫人，飞光九道，映朗泥丸。 祝毕，乃饮符。 太微灵书紫文拘三魂之法 月三日、月十三日、月二十三日夕，是此时也，一二魂不定，爽灵浮游，胎光放形，幽精扰唤。 其爽灵、胎光、幽精，三君是三魂之神名也。 其夕皆弃身游遨，飚逝本室，或为他魂外鬼＇所见留制，或为魅物所得收录，或不得还及，离形放质，或犯於外魂，二气共战、皆躁竞赤子，使为他念，去来无形，心悲意闷也。 道士皆当拘而留之，使无游逸矣。 拘留之法，当安眠向上，下枕伸足，交手心上，暝目闭气三息，叩齿三通，存心有赤气如鸡子，从内仰上出於目中，从目中出外，赤气转大覆身，下流身体，上至头顶，变而成火，因以绕身，使匝一身，令内外洞彻，有如然炭之状。 都毕。 其时当觉体中小热，乃又叩齿三通，毕，存呼三魂名，爽灵、胎光、幽精，三神急住，因微祝曰： 太微玄官，中黄始青，内炼三魂，胎光安宁，神宝玉室，与我俱生，不得妄动，鉴者太灵，若欲飞行，唯得诣太极上清，若欲饥渴，唯得饮徊水玉精。 太微灵书紫文制七魄之法 月朔、月望、月晦夕，是此时也，七魄流荡，游走秽浊，或交通血食，往鬼来魅，或与死尸共相关入，或淫惑赤子，聚奸伐宅，或言人之罪，诣三官河伯，或变为魍魉，使人厌魅，或将鬼入身，呼邪杀质。 诸残病生人，皆魄之罪，乐人之死，皆魄之性，欲人之败，皆魄之疾。 道士当制而励之，炼而变之，御而正之，摄而威之。 其第一魄名尸狗，第二魄名伏矢，第三魄名雀阴，第四魄名吞贼，第五魄名非毒，第六魄名除秽，第七魄名臭肺，此皆七魄之阴名也，身中之浊鬼也。 制检之法，当正卧，去枕伸足，两手掌心掩两耳，令指端相接，交於项中，闭息七过，叩齿七通，存鼻端有白气如小豆，须臾渐大，以冠身九重，下至两足，上至头上。 既毕，於是白气忽又变成天兽，使两青龙在两目中，两白虎在两鼻孔中，皆向外，朱雀在心上，向人口，苍龟在左足下，灵蛇在右足下，两耳中有玉女，着玄锦衣，当耳门，两手各把火光。 良久，都毕。 又咽液七过，叩齿七通，呼七魄名毕，乃微祝曰： 素气九回，制魄邪凶，天兽守门，娇女执关，炼魄和柔，与我相安，不得妄动，看察形源，若汝饥渴，听饮月黄日丹。 右祝诵都毕，於是七魄内闭，相守受制。",
      "translated_text": "Upon completing the invocation, bow twice toward the moon. Visualize the sun and moon, whether sitting or standing as is convenient.\n\nAmong the immortals’ officials, none know the name of the Moon’s essence. Those Perfected Ones who did know it in their time—if the sky is overcast and the moon absent, the practice may be performed indoors. The essential method follows the same principles as the \"Drinking Sunlight\" technique. Practicing nightly, one will swiftly perceive the body radiating light, the eyes emitting flying essence.\n\nThe crucial days for this method are the second, fourth, sixth, eighth, tenth, fourteenth, sixteenth, eighteenth, twentieth, twenty-second, and twenty-fourth of the lunar month—eleven occasions in a month, sufficient to attain immortality. On these evenings, when yin and yang converge, the three *qi* overflow, the moon’s waters crystallize into blossoms, and the Yellow Spirit descends to receive them.\n\nAfter eighteen years of practice, the Supreme Clarity will refine the hun-soul and replace the po-soul, illuminating them with jade light, so that one may ride the dark reins of radiance and soar through the great void.\n\n**Purple Tenuity’s Method for Drinking Moon Essence and the Great Yin’s Generative Talisman**\nIf unable to inscribe the talisman at midnight on every lunar eclipse, one must not miss the eclipse of even-numbered months. The first month is odd; the second, even.\n\nAt midnight on the eclipse, write in yellow on blue paper, face east, and consume it after first invoking the Moon’s essence. At this time, one should first drink the \"Luminous Spirit-Unlocking Talisman.\" While drinking the moon talisman, hold the breath, grasp the talisman in the right hand, and silently intone:\n\n*\"Purple Tenuity’s yellow script, named the Great Mystery,\nSummons the moon’s blossom-waters to nourish the po and harmonize the hun.\nIn the midst of solemn rites, issuing from the Mystic Pass,\nConcealing heaven and veiling the moon, the Five Numinous Ladies,\nNinefold flying radiance illumines the Mud-Pill Palace.\"*\n\nUpon completing the invocation, consume the talisman.\n\n**The Purple Text of the Great Mystery’s Scripture: Method for Restraining the Three Hun-Souls**\nOn the evenings of the third, thirteenth, and twenty-third days of the lunar month, at this time, the first and second hun-souls grow unsettled. The *Scintillant Spirit* drifts, the *Womb-Light* releases its form, and the *Dark Essence* stirs and calls. *Scintillant Spirit*, *Womb-Light*, and *Dark Essence* are the names of the three hun-soul deities. On these nights, they abandon the body to wander, swiftly returning to their original chamber—or else they may be detained by external spirits, captured by spectral entities, or fail to return in time, their forms scattered. If they encounter external spirits, the two *qi* will clash, agitating the *Red Child* and inducing wayward thoughts, their comings and goings formless, the heart sorrowful and the mind vexed.\n\nDaoists must restrain and retain them to prevent their straying. The method of restraint: lie supine, remove the pillow, stretch the legs, cross the hands over the heart, close the eyes, and hold the breath for three cycles. Knock the teeth three times, then visualize a red *qi* the size of a chicken’s egg rising from within, ascending through the eyes, and emerging outward. The red *qi* expands to envelop the body, flowing downward to the feet and upward to the crown of the head, transforming into fire that encircles the body, suffusing it inside and out until it glows like burning charcoal.\n\nOnce complete, one will feel a slight warmth in the body. Knock the teeth three more times, then silently call the names of the three hun-souls—*Scintillant Spirit*, *Womb-Light*, *Dark Essence*—commanding them to halt. Softly intone:\n\n*\"Palace of the Great Mystery, Primordial Yellow and First Green,\nRefine the three hun-souls within, let Womb-Light rest in peace.\nThe divine treasure of the Jade Chamber is born with me;\nDo not move recklessly, for the Supreme Numinous watches.\nIf you wish to fly, you may only ascend to the Great Ultimate and Supreme Clarity.\nIf you hunger or thirst, you may only drink the jade essence of the returning waters.\"*\n\n**The Purple Text of the Great Mystery’s Scripture: Method for Governing the Seven Po-Souls**\nOn the evenings of the new moon, full moon, and lunar eclipse, at this time, the seven po-souls wander and drift, roaming through filth and defilement. They may consort with blood offerings, mingle with ghosts and specters, or enter into dead corpses. They may seduce the *Red Child*, gather in licentiousness to assail dwellings, or report a person’s sins to the Three Officials and the River Earl. They may transform into *wangliang* spirits to afflict people with malevolence, or lead ghosts into the body to summon evil and slay the essence. All the ailments and afflictions of the living arise from the po-souls’ transgressions. Their nature delights in human death; their malady desires human ruin.\n\nDaoists must govern, refine, command, and subdue them. The first po-soul is named *Corpse Dog*, the second *Crouching Arrow*, the third *Sparrow Yin*, the fourth *Swallowing Thief*, the fifth *Non-Poison*, the sixth *Expelling Filth*, and the seventh *Stinking Lung*—these are the yin names of the seven po-souls, the turbid spirits within the body.\n\nThe method of restraint: lie properly, remove the pillow, stretch the legs, and cover the ears with the palms so the fingertips meet at the nape. Hold the breath for seven cycles, knock the teeth seven times, and visualize a white *qi* the size of a small bean at the tip of the nose. Gradually, it expands to envelop the body in nine layers, descending to the feet and ascending to the crown of the head.\n\nOnce complete, the white *qi* suddenly transforms into celestial beasts: two Azure Dragons in the eyes, facing outward; two White Tigers in the nostrils, also facing outward; a Vermilion Phoenix above the heart, facing the mouth; a Dark Tortoise beneath the left foot; a Numinous Serpent beneath the right foot. In the ears stand Jade Maidens, clad in dark brocade, guarding the ear gates, each holding a flame in hand.\n\nAfter a long while, when all is complete, swallow saliva seven times, knock the teeth seven times, and call the names of the seven po-souls. Then softly intone:\n\n*\"Ninefold white qi revolves, restraining the po-souls’ malevolence.\nCelestial beasts guard the gates; maidens hold the passes.\nRefine the po-souls to harmony, that they may dwell peacefully with me.\nDo not move recklessly; observe and examine the source of form.\nIf you hunger or thirst, you may only drink the moon’s yellow and the sun’s cinnabar.\"*\n\nUpon completing the invocation, the seven po-souls will be inwardly restrained, bound to obedience.",
      "overlap_context": "he Tiger Insignia,\nPhoenix plumes and vermilion sashes, jade pendants and golden earrings,\nThe soaring tree binds the slopes, styled the Wood King,\nThe divine foundation controls the root, waxing and waning,\nBright essence reflects within, mystic water spouts the bridge,\nBestowed the jade tablet of scripture, name engraved in the Cloud Chamber,\nFeasting on lunar blossoms, uniting with the Perfected in harmony,\nSoaring immortals of the Purple Tenuity, ascending to pay court to the Grand August.\"*",
      "start_char": 2666,
      "end_char": 3914,
      "start_sentence": 76,
      "end_sentence": 112,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.50292491912842,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\皇天上清金阙帝君灵书紫文上经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "若常行之，则魄浊下消，反善合形，上和三宫，与元合灵。 人一身有三元宫神，命门有玄关大君，及三魂之神，合七神，皆在形中，欲令人长生，仁慈大吉之君也。 其七魄亦受生於一身，而与身为攻伐之贼，故当制之。 道士徒知求仙之方，而不知制魄之道，亦不免於徒劳。 三元宫所在，其上元宫，泥丸中也，其神赤子，字三元先，一名帝卿； 中元宫，绛房中心是也，其神真人，字子南丹，一名中光坚； 下元丹田宫，脐下三寸也，其神婴儿，字元阳昌，一名谷下玄。 此三一之神矣。 欲拘制魂魄时，皆先阴呼其名，存三神皆玉色金光，有婴孩之貌，中上二元皆衣赤，下元衣黄，头如婴儿始生之状也。 行道服气时，亦存呼名字。 命门，脐也，玄关是始生胞肠之通路也。 其中有生宫，宫内有大君，名桃康，字合延，着朱衣，巾紫蓉冠，坐当命门，其三魂神侍侧焉。 大君常手执天皇象符，以合注元气，补胎反胞。 暮卧，先闭气二十四息，乃心祝大君名三通，因咽液五十过，又三叩齿，微祝曰： 胎灵大神，皇纲天君，手执胞符，首冠紫冠，黄回赤转，上精命门，化神反生，六合相因，形骸光泽，玉女栖身。 毕。 能常行之十八年，大君将能左激三田，右御三气，田化成飞举，气 化成玄龙，仰役二十四神，俯使魂灵，呼阳官六甲，召阴官六丁，千乘万骑，白日升天，皆桃君之感致也。 太微天帝君天皇象符 一名帝君九迥元五通八间符。 若礼祝於别室，当先书此符，盛以锦囊，佩之，然后乃得行之。 右天皇象符，以付生宫大君桃康合延，合元上气，理胞运精。 朱书青纸，月旦、月望夜半，北向服之，以左手执符，闭气，心祝曰： 天帝玄书，皇象灵符，以合元气，运精反胞，万年婴孩，飞仙天枢，生宫大君，披丹建朱，首戴紫蓉，与我同谋。 毕，乃服，服毕，起再拜。 服符时，於所寝状上也。 若道士有行还精之道，回黄转赤，朝精灌命，注津溉液，使男女共丹，面生玉泽者，宜知大君之名要，服象符以不老矣。 若徒行事，而不知神名，还精而不知服此符，不见其祝说，不测其宫府所住者，虽获千岁之寿，故自归尸於太阴，徒积历纪之生，故应还骨於三官也。 道士暮卧，常存大君，为祝说之法，朔望服符，以运胎精之益者，如此亦成仙人，可不烦男女还补之术也。 然御女以要飞腾，回气以求天仙，崄巇甚於水火，杀伐速於斧釿，自非灰心抱一之性，殆不可以此取丧失者也。 中才行之，所谓吞剑而欲喉咽不伤，当可得耶。 生宫大神君，忌人食生血，忌烧六畜毛，忌烧葫蒜皮叶，及诸荤菜辈，皆伐乱胎气，臭伤婴神，慎之焉。 皇天上清金阙帝君灵书紫文上经竟",
      "translated_text": "If practiced regularly, the turbid po-souls will gradually dissipate below, returning to harmonize with the body. They will ascend to unite with the Three Palaces, merging with the primordial to attain numinous union.\n\nWithin the human body reside the gods of the Three Primordial Palaces: the Great Lord of the Mysterious Pass at the Gate of Destiny, along with the gods of the three hun-souls, totaling seven deities, all dwelling within the form. These are the lords of great benevolence and supreme fortune, desiring to grant humans longevity. The seven po-souls, also born within the body, act as rebels that assail it, and thus must be restrained.\n\nDaoists often seek the methods of immortality yet remain ignorant of the Way to restrain the po-souls, laboring in vain. The Three Primordial Palaces are located as follows: the Upper Primordial Palace resides within the Mud-Pill, its god the Red Child, named Three Primordials First, also called Imperial Minister; the Middle Primordial Palace lies at the center of the Crimson Chamber, its god the Perfected One, named Child Southern Cinnabar, also called Central Radiance Firm; the Lower Primordial Palace of the Cinnabar Field is three inches below the navel, its god the Infant, named Primordial Yang Prosperity, also called Mysterious Below the Valley. These are the Three Ones.\n\nWhen seeking to restrain the hun and po-souls, first silently invoke their names, visualizing the three gods as jade-hued with golden radiance, bearing the appearance of infants. The Upper and Middle Primordial gods wear red, while the Lower Primordial god wears yellow, their heads resembling those of newborn babes. During Daoist practices and qi-absorption, likewise visualize and invoke their names.\n\nThe Gate of Destiny is the navel, and the Mysterious Pass is the pathway through which the umbilical cord once passed. Within it lies the Palace of Life, where the Great Lord resides, named Peach Prosperity, styled Union Prolonged. Clad in vermilion robes and crowned with a purple lotus coronet, he sits at the Gate of Destiny, attended by the gods of the three hun-souls. The Great Lord constantly holds the Heavenly August Symbol Talisman, which harmonizes and infuses primordial qi, replenishing the womb and reversing the placenta.\n\nBefore retiring at night, first hold the breath for twenty-four cycles, then silently invoke the Great Lord’s name three times. Swallow saliva fifty times, knock the teeth thrice, and softly intone:\n\n*\"Great Spirit of the Womb, Heavenly August Lord of the Imperial Net,\nHolding the Womb Talisman, crowned with a purple coronet,\nYellow revolves, red transforms, ascending to refine the Gate of Destiny,\nTransforming spirit to rebirth, the Six Harmonies intermingle,\nThe body gleams with radiance, jade maidens dwell within.\"*\n\nAfter completing the invocation, if practiced regularly for eighteen years, the Great Lord will be able to stir the Three Fields on the left and guide the Three Qi on the right. The fields will transform into soaring flight, and the qi will metamorphose into a dark dragon. Above, he commands the twenty-four spirits; below, he directs the hun-souls. He summons the Six Jia of the Yang Bureau and the Six Ding of the Yin Bureau, leading a thousand chariots and ten thousand riders to ascend to heaven in broad daylight—all through the influence of Lord Peach.\n\n**The Heavenly August Symbol Talisman of the Supreme Emperor Lord of the Golden Watchtower of Highest Clarity**\nAlso called the *Nine Revolutions of the Primordial Five Penetrations Eight Intervals Talisman of the Emperor Lord*.\n\nIf performing the ritual in a separate chamber, first inscribe this talisman, place it in a brocade pouch, and wear it before proceeding. The Heavenly August Symbol Talisman is bestowed upon the Great Lord of the Life Palace, Peach Prosperity Union Prolonged, to harmonize primordial qi and govern the womb’s essence.\n\nInscribe it in vermilion on blue paper. On the first day of the lunar month and the night of the full moon, face north, hold the talisman in the left hand, hold the breath, and silently intone:\n\n*\"Celestial Writ of the Heavenly Emperor, numinous talisman of the August Symbol,\nHarmonizing primordial qi, governing essence to reverse the womb,\nEternal Infant of ten thousand years, soaring immortal at the Heavenly Pivot,\nGreat Lord of the Life Palace, clad in vermilion, crowned in purple,\nConspire with me in this endeavor.\"*\n\nUpon completing the invocation, ingest the talisman, then rise and bow twice. Perform this ritual while lying in bed. If a Daoist practices the Way of Returning Essence, cycling yellow to red, infusing the morning’s essence to irrigate destiny, channeling fluids to nourish the elixir, causing both man and woman to share the cinnabar radiance and a jade-like complexion, they should know the essential name of the Great Lord and ingest the Symbol Talisman to attain agelessness.\n\nIf one merely performs the practices without knowing the gods’ names, returns essence without ingesting this talisman, remains ignorant of its invocations, or fails to discern the palaces where the gods reside, even if they attain a thousand years of life, they will ultimately return their corpse to the Great Yin, accumulating eons of existence only to surrender their bones to the Three Bureaus.\n\nWhen Daoists retire at night, they should regularly visualize the Great Lord and perform the invocation. On the first and fifteenth days of the lunar month, ingest the talisman to circulate the womb’s essence—through this, they too may become immortals without the need for the arts of returning essence through male and female.\n\nYet governing women to seek flight or cycling qi to aspire to celestial immortality is more perilous than fire and water, swifter in destruction than axes and hatchets. Unless one possesses a heart of ashes and embraces the One, such pursuits may lead to ruin. For those of middling ability, this is like swallowing a sword and hoping the throat remains unharmed—how can success be assured?\n\n**Taboos of the Great Spirit Lord of the Life Palace:**\nAvoid consuming raw blood, burning the fur of the six livestock, or burning the skins, leaves, or any pungent vegetables, as these disrupt the womb’s qi and offend the infant spirit. Exercise caution.\n\nHere ends the *Supreme Scripture of the Purple Texts and Numinous Writ of the Golden Watchtower of Highest Clarity, Emperor Lord of the August Heaven*.",
      "overlap_context": "mes of the seven po-souls. Then softly intone:\n\n*\"Ninefold white qi revolves, restraining the po-souls’ malevolence.\nCelestial beasts guard the gates; maidens hold the passes.\nRefine the po-souls to harmony, that they may dwell peacefully with me.\nDo not move recklessly; observe and examine the source of form.\nIf you hunger or thirst, you may only drink the moon’s yellow and the sun’s cinnabar.\"*\n\nUpon completing the invocation, the seven po-souls will be inwardly restrained, bound to obedience.",
      "start_char": 3914,
      "end_char": 4954,
      "start_sentence": 113,
      "end_sentence": 145,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.187091588974,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\皇天上清金阙帝君灵书紫文上经.txt",
        "category": "本文类"
      }
    }
  ]
}