{
  "source_id": "碧霞元君护国庇民普济保生妙经",
  "source_file": "chunked_daozang\\碧霞元君护国庇民普济保生妙经.json",
  "total_chunks": 3,
  "total_original_chars": 2671,
  "total_translated_chars": 17290,
  "total_translation_time": 84.15142965316772,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏续道藏\\碧霞元君护国庇民普济保生妙经.txt",
    "category": "正统道藏续道藏"
  },
  "full_translation": "**The Marvelous Scripture of the Azure Cloud Primordial Sovereign for Protecting the Nation, Sheltering the People, and Universally Saving and Preserving Life**\n\n**Scripture Title:** *The Marvelous Scripture of the Azure Cloud Primordial Sovereign for Protecting the Nation, Sheltering the People, and Universally Saving and Preserving Life*\n**Author:** Unknown, approximately dating to the Ming dynasty.\n**Volume:** One.\n**Source Text:** *Wanli Continuation of the Daoist Canon*.\n\n---\n\n**The Marvelous Scripture of the Azure Cloud Primordial Sovereign for Protecting the Nation, Sheltering the People, and Universally Saving and Preserving Life**\n\n**Opening Gatha:**\nThe Heavenly Immortals of Great Compassion,\nFrom the kalpa’s dawn attained the Supreme Perfected.\nManifesting forms to rescue the suffering,\nThey vowed to deliver gods and humans alike.\nDisasters and blessings discern good and evil,\nFortune and woe respond to primordial causes.\nThe armies of the Five Peaks all submit to Her,\nSaving the manifest, delivering the hidden and sunken.\nWith devotion, none goes unanswered;\nSincere thought brings immediate resonance.\nWith wholehearted prayer for blessings and protection,\nWe take refuge and bow to the True Scripture.\n\n**The Primordial Heavenly Worthy expounds *The Marvelous Scripture of the Azure Cloud Primordial Sovereign for Protecting the Nation, Sheltering the People, and Universally Saving and Preserving Life***\n\nAt that time, the Primordial Heavenly Worthy ascended to the Supreme Azure Realm, mounting the spontaneous Hundred-Treasure Dharma Throne of Jasper Jade Terrace, to expound the wondrous transformations of the Supreme Mystery of the Primordial Dao to the assembled perfected beings.\n\nThen, the radiance of the Heavenly Worthy illuminated the ten thousand heavens, and celestial music resounded of itself. Heavenly flowers filled the expanse, and rare fragrances wafted through the air. The myriad heavens and emperors, the hosts of immortals of the Three Realms, gathered beneath the terrace. Having completed their obeisance, they encircled the throne, listening reverently to the exposition of the Dao.\n\nAt that moment, the Five Peaks offered flowers, and the Four Waterways presented treasures. From the assembled ranks, a perfected one named Yuluo stepped forth, knelt upright, and addressed the Heavenly Worthy, saying: \"By what past affinity have I, your servant, been granted the fortune to attend Your Jade Steps? I have been blessed to hear the Supreme Dao, and my heart is deeply indebted to Your boundless compassion. Yet in the governance of transformation, my humble understanding remains unenlightened.\"\n\nBeneath the mortal realm, the people undergo endless cycles of birth and transformation, each governed by divine overseers who record the destinies of heaven and humanity. All this falls under the jurisdiction of the Azure Radiance Primordial Sovereign of the Eastern Peak, who also presides over Mount Tai. By what karmic affinity has she attained her sacred rank? I humbly seek the cause of this Dao.\n\nThe Heavenly Worthy replied: \"Excellent is this question. Return to your place, and I shall expound for you.\n\nWhen heaven and earth were first divided, the Five Peaks stood in their directions, and the myriad things came to life in spring—all transformations began in the east. The Eastern Peak records births and harmonizes the primordial workings. In high antiquity, people were endowed with upright natures, fully embodying loyalty and filial piety. They lived long lives, and upon death, passed directly to rebirth, free from transgression or offense, never descending into darkness, never losing their original purity, and ever ascending to the good Dao.\n\nIn this degenerate age, people have strayed from the ancient Way, their hearts turning to cunning and deceit. They are disloyal to their rulers, unfilial to their parents, disrespectful to their teachers and elders, and unkind to their brothers. They rely on strength to bully the weak and recklessly engage in strife and plunder. They commit murder, theft, and lewdness, profane the Three Luminaries, and show no fear of the gods. Even among women, few understand the karmic causes of their past lives. Having received such a body and life in this existence, they fail to repent or awaken, instead giving rise to greed and wrath. They covet wealth and despise poverty, resenting heaven and cursing earth. They insult and defy their parents-in-law, humiliate their sisters-in-law, act without compassion, and mistreat their children. They worship false gods and secretly cast curses. For such manifold evils, retribution never ceases.\n\nAt that time, the Primordial Sovereign had already attained the rank of Supreme Unity and Azure Mystery. Witnessing the suffering of sentient beings, her boundless compassion knew no end. To transform women and universally deliver all beings, on the eighteenth day of the fourth month, she divided her perfected qi and manifested her merciful countenance. Ascending and descending Mount Tai, she dwelled in the highest realm, refining her primordial essence through eons of cultivation. Her compassionate radiance penetrated all, illuminating even the most subtle and obscure. Responding to the nine qi, she gave life without end; embodying the One Primordial, she transformed without cease. Her divine power was unfathomable, her vast virtue immeasurable. Her grace extended to all under heaven, and the entire world turned in reverence. By decree of the Jade Emperor, she was confirmed as a celestial immortal, commanding the divine soldiers of the Peak’s court, inspecting the good and evil, sin and fortune of the human world, where retribution and response swiftly manifest.\"\n\nThe perfected one bowed deeply and asked: \"How can the deceitful and cunning, who speak one way while thinking another, be discerned?\"\n\nThe Heavenly Worthy replied: \"The primordial spirit of humans is endowed by heaven. When good or evil first arises, the divine luminaries already perceive it. Though hidden in seclusion, the heart’s traces are revealed. A single good thought shines forth like the reflection of light—though unseen by people, the gods have already witnessed it. There are gods who record good deeds in the register of virtue. A single evil thought resounds like an echo in a valley—though unheard by people, the gods have already heard it. There are gods who record evil deeds in the register of transgressions. Though the nature of good and evil differs, the swiftness of their karmic response is the same.\"\n\nThe perfected one bowed again and asked: \"Though retribution is certain, its verification remains unheard.\"\n\nThe Heavenly Worthy replied: \"The workings of the divine sages are without sound or form, yet they subtly manifest through human affairs. When people act, if they encounter good fortune, it is good retribution; if they encounter misfortune, it is evil retribution. Some perish in the sinking of carriages, horses, boats, or ships; some are consumed by raging fires or drowned in floods; some are slain by weapons, bandits, or calamities; some are devoured by tigers, wolves, insects, or snakes; some are imprisoned by officials or confined in dungeons; some are afflicted by malevolent spirits or demonic entities; some suffer from plagues, consumption, or incurable sores; some are harmed by inauspicious stars or baleful constellations; some are injured by poisons or witchcraft; some meet violent or untimely deaths—all such sufferings, though seemingly accidental, arise from evil causes that bring about these afflictions.\n\nEven those who do good may encounter misfortune, but if they meet a virtuous person who resolves their troubles, it is divine protection. Do not assume that those who commit the Five Heinous Crimes or the Ten Evils enjoy peace and prosperity. Each has their own governing deities of destiny, local earth gods, city gods, and village spirits who report to their superiors in the Peak’s court, which then memorializes the Jade Emperor. By imperial decree, the Fire Department and Thunder Bureau verify the truth, awaiting the appointed time for punishment. The Emperor has commanded the Great Deities of Execution and Judgment to patrol the mortal world. If anyone plots to murder their parents or elders, though the act remains unformed, the evil intent has already arisen, and they will be swiftly executed. Their souls will descend to Fengdu, where they will suffer excruciating torments without hope of pardon.\n\nVirtuous men and faithful women, after the end of their lives, will not see hell but will ascend directly to heaven. If reborn in the human realm, they will dwell in the Central Kingdom as men—intelligent, wealthy, noble, and long-lived.\"\n\nThe perfected one asked: \"How can the karmic causes of past lives be clearly seen in retribution in this world?\"\n\nThe Heavenly Worthy replied: \"To know your past life, observe your present existence; to know your future life, observe your present conduct. If one is born in a royal palace, among imperial relatives, in the households of nobles or ministers, or in a tranquil and blessed place—free from toil in body and mind, enjoying peace, prosperity, and honor—this is the result of good causes from three past lives. If, though born among humans, one is blind or maimed, afflicted by sores, unable to find peace or healing, reduced to begging on the roads, suffering pain without injury, weeping on the ground and wailing to heaven—this is the retribution for past lives in which one disrespected heaven and earth, the Three Luminaries, and the Three Treasures, slandered the scriptures, and now receives this punishment.\n\nIf one is born with rotting lips, a missing nose, crippled hands or feet, and is despised and shunned by others—this is retribution for past lives in which one cursed the wind and rain, reviled parents and parents-in-law, relied on brute strength to bully the innocent, and now receives this punishment. If one suffers difficult childbirth, obstructed labor, or if the child survives while the mother perishes, or if both mother and child die—this is retribution for past lives in which one aborted fetuses, abandoned children, and harmed those entrusted to rebirth, and now receives this punishment. If one is born deaf, mute, or dumb, unable to hear or speak—this is retribution for past lives in which one schemed with cunning, deceiving the foolish, and now receives this punishment.\"\n\nOr if one is clothed yet cannot ward off the cold, fed yet cannot stave off hunger, dying in ditches with one’s corpse left exposed—this is retribution for past lives in which one wasted the five grains and treated fine silks with contempt, and now receives this punishment. Or if one is born a woman in lowly circumstances, or suffers capture and enslavement by bandits and barbarians—this is retribution for past lives in which one relied on violence and deceit to oppress the good and kind, and now receives this punishment.\n\nSuch karmic consequences are beyond enumeration, yet all stem from past causes, their judgment infallible. Should one fail to awaken, repent past wrongs, sever evil, and cultivate goodness, one may be reborn among creatures with scales, shells, fur, or feathers—those with claws, fangs, hooves, or horns. There, many endure whipping, slaughter, boiling, and roasting, only to transform into tiny insects, making it difficult to regain human form.\n\nUpon hearing these dire consequences, the Perfected One bowed deeply and said: “The people are ignorant, like newborn babes. By what practice may they avoid such retribution? I humbly beseech Your Celestial Compassion, vast in love for all life, to illuminate the path of goodness.”\n\nThe Heavenly Worthy replied: “Though the Azure Cloud Primordial Sovereign punishes evil, her intent is to deliver beings. All who reform themselves will be saved. There are sacred incantations that dissolve past transgressions. I shall now proclaim them:\n\nAt the beginning of the Great Dao, there was no form, no speech. After Heaven and Earth parted, the myriad spirits assumed their authority. Mount Tai, the lofty peak, stabilized the Earth’s foundation. Within it dwells the Primordial Sovereign, known as the Heavenly Immortal. She first realized the imperial truth and ascended to the Azure Heavens. To transform sentient beings, she manifests a compassionate countenance. Her divine powers are vast, her virtue and majesty resplendent. She pacifies the people and protects the realm, awakens the world and upholds its primal essence. She aids loyalty and fosters filial piety, upholds righteousness and elevates the worthy. She preserves life and extends lifespan, ensuring descendants flourish. She dispels disasters, resolves calamities, delivers from distress, and erases transgressions. She drives away plagues, subdues poisons, severs malevolent influences, and reconciles grievances. The officials and generals of her mountain court issue commands with solemn authority. Those who are unkind or unjust, rebellious or wicked, who scorn the true Dao—are reduced to dust and smoke. Should any dare to curse her, they are sent to Mount Feng, their souls consigned to the dark prisons, never to be pardoned for ten thousand kalpas. Yet when the people pray to her, no wish remains unfulfilled. Her great compassion responds to all, universally aiding humans and gods alike.”\n\nThe Heavenly Worthy addressed the Perfected One Yu Luo: “If one turns their heart even for a moment, taking refuge in the true Dao, calming the spirit within and dissolving habitual tendencies without, one may invite a pure precept-holding Daoist to perform rites—whether in a temple or at home—preparing a solemn and purified altar. With wholehearted devotion, one should perform good deeds, recite this scripture—be it three, five, or seven times, or even a hundred or a thousand—pay homage to the Primordial Sovereign, burn incense in repentance, and visualize her compassionate visage as if she were truly present. Prostrating with the five limbs touching the ground, bowing a hundred times to implore her grace, one’s sins will be erased from the dark ledgers, and transgressions expunged from the mountain court. Household and self will enjoy peace and fortune, misfortunes will vanish, all endeavors will prosper, and every movement will be auspicious. The nine generations of ancestors and the seven lineages will all attain freedom. Upon hearing these benefits, the Perfected One rejoiced exuberantly.\n\nThe Perfected One said: “Having now encountered this scripture, I vow to disseminate it among the people, that all may return to benevolence, cultivate harmony, and safeguard the realm in peace.”\n\nThe Perfected One bowed again and offered this hymn of praise:\nTaking refuge in the *Azure Cloud Scripture*, past karma dissolves across three lifetimes.\nReciting the *Azure Cloud Scripture*, disasters will not befall one’s body.\nRevering the *Azure Cloud Scripture*, ghosts and spirits hold one in awe.\nHonoring the *Azure Cloud Scripture*, one’s family remains safe and serene.\nMeditating on the *Azure Cloud Scripture*, essence, qi, and spirit merge in radiant harmony.\nVenerating the *Azure Cloud Scripture*, fortune, prosperity, and longevity all increase.\nCarrying the *Azure Cloud Scripture*, evil dares not approach.\nChanting the *Azure Cloud Scripture*, fields and homes flourish ever more.\nWorshipping the *Azure Cloud Scripture*, fire and theft never arise.\nPraising the *Azure Cloud Scripture*, all wishes come to fruition.\n\nThe Heavenly Worthy said: “Noble indeed is Yu Luo, who brings such benefit and joy to gods and humans. Your merit is boundless; you are worthy of advancement in the ranks of immortals.”\n\nAfter the Heavenly Worthy had expounded the scriptural method, he returned to the Pure Capital. The assembly of heavenly immortals bowed in reverence and saw him off, their joy beyond words. Then the Perfected One descended to transmit the scripture in the world, widely propagating its teachings.\n\nHere ends the *Marvelous Scripture of the Primordial Sovereign of Azure Cloud for Protecting the Realm, Sheltering the People, and Universally Preserving Life*, spoken by the Heavenly Worthy of Primordial Beginning.\n\n**Precious Invocation of the Heavenly Immortal Azure Cloud**\nAtop the summit of Mount Tai, within the inner palace of the Eastern Peak, she once manifested as a Jade Maiden, her fundamental nature being the essence of imperial truth. Clothed in the ninefold qi, she extends her compassion and reveals her form; crowned with the hundred spirits, her wisdom is perfectly fused. Her deeds fill the ten directions, her merit spans countless kalpas. She has attained the title of Heavenly Immortal and been enfeoffed as the Azure Cloud. She commands the divine soldiers of the mountain court and oversees the good and evil of the human realm. Responding to cries for help, she protects the realm and pacifies the people. Greatly sagely, greatly compassionate, supremely filial, supremely benevolent—Heavenly Immortal Jade Maiden, Vastly Numinous and Compassionate, Reverent and Universally Aiding, Life-Preserving Perfected One, Vastly Virtuous Azure Cloud Primordial Sovereign who Protects the Realm and Shelters the People.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "碧霞元君护国庇民普济保生妙经 经名：碧霞元君护国庇民普济保生妙经。 撰人不详，约出於明代。 一卷。 底本出处：《万历续道藏》。 碧霞元君护国庇民普济保生妙经 开经偈 大慈天仙圣，劫初证上真。 化身为救苦，发愿度天人。 灾祥察善恶，休苦应元因。 岳兵悉皆统，济显度幽沉。 有念无不应，诚思即感通。 志心祈福佑，皈命礼真经。 元始天尊说《碧霞元君护国庇民普济保生妙经》 尔时，元始天尊驾幸始青上境，碧玉琼台升自然百宝法座，为诸侍真说一元妙化至玄上道。 是时，天尊光映万天，仙乐自鸣。 天花徧满，异香飞扬。 诸天诸帝，三界群真，云集台下。 作礼既毕，环拱座前，咸听说法。 时有五岳献花，四渎贡宝。 班集中有一真人，名曰郁罗，出班端跪，上白天尊曰：臣昔宿何缘，得侍玉陛。 幸闻至道，深荷恩慈。 治化所司，愚怀未悟。",
      "translated_text": "**The Marvelous Scripture of the Azure Cloud Primordial Sovereign for Protecting the Nation, Sheltering the People, and Universally Saving and Preserving Life**\n\n**Scripture Title:** *The Marvelous Scripture of the Azure Cloud Primordial Sovereign for Protecting the Nation, Sheltering the People, and Universally Saving and Preserving Life*\n**Author:** Unknown, approximately dating to the Ming dynasty.\n**Volume:** One.\n**Source Text:** *Wanli Continuation of the Daoist Canon*.\n\n---\n\n**The Marvelous Scripture of the Azure Cloud Primordial Sovereign for Protecting the Nation, Sheltering the People, and Universally Saving and Preserving Life**\n\n**Opening Gatha:**\nThe Heavenly Immortals of Great Compassion,\nFrom the kalpa’s dawn attained the Supreme Perfected.\nManifesting forms to rescue the suffering,\nThey vowed to deliver gods and humans alike.\nDisasters and blessings discern good and evil,\nFortune and woe respond to primordial causes.\nThe armies of the Five Peaks all submit to Her,\nSaving the manifest, delivering the hidden and sunken.\nWith devotion, none goes unanswered;\nSincere thought brings immediate resonance.\nWith wholehearted prayer for blessings and protection,\nWe take refuge and bow to the True Scripture.\n\n**The Primordial Heavenly Worthy expounds *The Marvelous Scripture of the Azure Cloud Primordial Sovereign for Protecting the Nation, Sheltering the People, and Universally Saving and Preserving Life***\n\nAt that time, the Primordial Heavenly Worthy ascended to the Supreme Azure Realm, mounting the spontaneous Hundred-Treasure Dharma Throne of Jasper Jade Terrace, to expound the wondrous transformations of the Supreme Mystery of the Primordial Dao to the assembled perfected beings.\n\nThen, the radiance of the Heavenly Worthy illuminated the ten thousand heavens, and celestial music resounded of itself. Heavenly flowers filled the expanse, and rare fragrances wafted through the air. The myriad heavens and emperors, the hosts of immortals of the Three Realms, gathered beneath the terrace. Having completed their obeisance, they encircled the throne, listening reverently to the exposition of the Dao.\n\nAt that moment, the Five Peaks offered flowers, and the Four Waterways presented treasures. From the assembled ranks, a perfected one named Yuluo stepped forth, knelt upright, and addressed the Heavenly Worthy, saying: \"By what past affinity have I, your servant, been granted the fortune to attend Your Jade Steps? I have been blessed to hear the Supreme Dao, and my heart is deeply indebted to Your boundless compassion. Yet in the governance of transformation, my humble understanding remains unenlightened.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 359,
      "start_sentence": 0,
      "end_sentence": 22,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.042086124420166,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\碧霞元君护国庇民普济保生妙经.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "切以下界生民，生生化化，各有神司，判注天人，悉由东岳碧霞元君，亦主泰山，证位缘何，愿闻道因。 天尊曰：善哉斯问，汝复其位，吾为宣说。 天地既判，五岳莫方，万物生春，万化始东，东岳注生，燮理元工。 上古生人，禀性贞良，克全忠孝，生而多寿，死而径生，元无愆衅，无复幽冥，不失本真，往生善道。 末世人民，行违古道，心生巧术。 不忠君王，不孝父母，不敬师长，不友兄弟。 恃强凌弱，妄行争夺。 杀盗奸淫，亵渎三光，不惧神明。 及有妇女，罔知宿世因缘。 今受如是身命，不自悔悟，妄起贪嗔。 欲富憎贫，怨天恨地。 侮慢公姑，欺辱妯娌。 忍为不仁，作践儿女。 淫祀邪神，暗行咒诅。 为恶种种，报对无停。 是时元君已证太一青玄之位，观见众生受此况沦，悲慈不已。 为化女流，普度群生。 於四月十八日，分真化炁，现是慈颜。 陟降泰山，静居上境，复炼元真，功周亿劫。 慈光洞照，徧彻幽微。 应九炁以生生，体一元而化化。 神功莫测，浩德难量。 惠溥天民，倾土皈仰受命玉帝，证位天仙，统摄岳府神兵，照察人间善恶罪福，照报感应速彰。 真人稽首问曰：奸人巧诈，口是心非，何由照察？ 天尊告曰：人之元神，禀受於天，善恶初萌，神明耶照，虽处幽隐，心迹自露。 举一善念，昭显若光之影。 人不能见，神已鉴之。 即有掌善之神，记於善籍。 举一恶念，响应如谷里之声。 人不能闻，神已闻之，即有掌恶之神记於恶籍。 善恶之作虽殊，感召之速则一。 真人再拜问曰：报应验，亦未得闻。 天尊告曰：神圣功用，无有声色，但假人事，默寓神机。 凡人动作之际，遭逢善事，是为善报。 遭逢恶事，是为恶报。 或遭车马舟航之沉落，或遭猛火洪水之焚溺，或遭刀兵劫贼之横诛，或遭虎狼虫蛇之毒啖，或遭官司牢狱之刑囚，或遭鬼祟邪精之缠害，或遭瘟痨疗之弗痊，或遭凶曜恶星之临照，或遭蛊毒药毒之伤残，或遭非命横亡之促暴，一切苦厄，虽系遭逢，皆由恶因，致罹斯苦。 亦有为善之人，而遭不善之事，必遇善人解释，是为神护。 莫言五逆十恶之人，见履安福，各有本属司命土地，会合社令城隍，里域神司，告闻所隶岳主，录奏玉帝。 勑令火部雷司，勘验真明，候时诛罚。 帝尝有命，行下斩伐判逆大神，巡行人世。 如有谋弒父母尊长者，事虽未形，心已萌恶，即行显戮。 魂下酆都，加诸苦罪，不得赦原。 善男信女，命终之后，不见地狱，径生天堂。 若生人间，则居中国，为男子身。 聪明富贵，而获寿年。 真人问曰：善恶往因，昭报於世，何以见之？ 天尊曰：欲知往生，当观今生。 欲知来世，当观今世。 今若生於王宫国戚，侯门臣室，及於清闲福地，身心不劳，安乐康荣，此是三世良因。 今世虽或生於人中，眼目盲坏，疮毒缠身，不得安愈，乞丐道途，不刑自痛，泣地号天，此是往生不敬天地三光，不信三宝，诽谤经文，今受斯报。 或腐唇阙鼻，手挛足跛，人所憎弃，此是往生呵风骂雨，毁骂父母公姑，倚仗血气，凌烁平人，今受斯报。 或遭产难，不顺分娩，或子存母丧，或母子俱亡，此是往生揉堕胎婴，抛弃儿女，残悮托生，今受斯报。 或痴聋暗哑，难听难言，此是往生巧运心机，哄痴愚，今受斯报。",
      "translated_text": "Beneath the mortal realm, the people undergo endless cycles of birth and transformation, each governed by divine overseers who record the destinies of heaven and humanity. All this falls under the jurisdiction of the Azure Radiance Primordial Sovereign of the Eastern Peak, who also presides over Mount Tai. By what karmic affinity has she attained her sacred rank? I humbly seek the cause of this Dao.\n\nThe Heavenly Worthy replied: \"Excellent is this question. Return to your place, and I shall expound for you.\n\nWhen heaven and earth were first divided, the Five Peaks stood in their directions, and the myriad things came to life in spring—all transformations began in the east. The Eastern Peak records births and harmonizes the primordial workings. In high antiquity, people were endowed with upright natures, fully embodying loyalty and filial piety. They lived long lives, and upon death, passed directly to rebirth, free from transgression or offense, never descending into darkness, never losing their original purity, and ever ascending to the good Dao.\n\nIn this degenerate age, people have strayed from the ancient Way, their hearts turning to cunning and deceit. They are disloyal to their rulers, unfilial to their parents, disrespectful to their teachers and elders, and unkind to their brothers. They rely on strength to bully the weak and recklessly engage in strife and plunder. They commit murder, theft, and lewdness, profane the Three Luminaries, and show no fear of the gods. Even among women, few understand the karmic causes of their past lives. Having received such a body and life in this existence, they fail to repent or awaken, instead giving rise to greed and wrath. They covet wealth and despise poverty, resenting heaven and cursing earth. They insult and defy their parents-in-law, humiliate their sisters-in-law, act without compassion, and mistreat their children. They worship false gods and secretly cast curses. For such manifold evils, retribution never ceases.\n\nAt that time, the Primordial Sovereign had already attained the rank of Supreme Unity and Azure Mystery. Witnessing the suffering of sentient beings, her boundless compassion knew no end. To transform women and universally deliver all beings, on the eighteenth day of the fourth month, she divided her perfected qi and manifested her merciful countenance. Ascending and descending Mount Tai, she dwelled in the highest realm, refining her primordial essence through eons of cultivation. Her compassionate radiance penetrated all, illuminating even the most subtle and obscure. Responding to the nine qi, she gave life without end; embodying the One Primordial, she transformed without cease. Her divine power was unfathomable, her vast virtue immeasurable. Her grace extended to all under heaven, and the entire world turned in reverence. By decree of the Jade Emperor, she was confirmed as a celestial immortal, commanding the divine soldiers of the Peak’s court, inspecting the good and evil, sin and fortune of the human world, where retribution and response swiftly manifest.\"\n\nThe perfected one bowed deeply and asked: \"How can the deceitful and cunning, who speak one way while thinking another, be discerned?\"\n\nThe Heavenly Worthy replied: \"The primordial spirit of humans is endowed by heaven. When good or evil first arises, the divine luminaries already perceive it. Though hidden in seclusion, the heart’s traces are revealed. A single good thought shines forth like the reflection of light—though unseen by people, the gods have already witnessed it. There are gods who record good deeds in the register of virtue. A single evil thought resounds like an echo in a valley—though unheard by people, the gods have already heard it. There are gods who record evil deeds in the register of transgressions. Though the nature of good and evil differs, the swiftness of their karmic response is the same.\"\n\nThe perfected one bowed again and asked: \"Though retribution is certain, its verification remains unheard.\"\n\nThe Heavenly Worthy replied: \"The workings of the divine sages are without sound or form, yet they subtly manifest through human affairs. When people act, if they encounter good fortune, it is good retribution; if they encounter misfortune, it is evil retribution. Some perish in the sinking of carriages, horses, boats, or ships; some are consumed by raging fires or drowned in floods; some are slain by weapons, bandits, or calamities; some are devoured by tigers, wolves, insects, or snakes; some are imprisoned by officials or confined in dungeons; some are afflicted by malevolent spirits or demonic entities; some suffer from plagues, consumption, or incurable sores; some are harmed by inauspicious stars or baleful constellations; some are injured by poisons or witchcraft; some meet violent or untimely deaths—all such sufferings, though seemingly accidental, arise from evil causes that bring about these afflictions.\n\nEven those who do good may encounter misfortune, but if they meet a virtuous person who resolves their troubles, it is divine protection. Do not assume that those who commit the Five Heinous Crimes or the Ten Evils enjoy peace and prosperity. Each has their own governing deities of destiny, local earth gods, city gods, and village spirits who report to their superiors in the Peak’s court, which then memorializes the Jade Emperor. By imperial decree, the Fire Department and Thunder Bureau verify the truth, awaiting the appointed time for punishment. The Emperor has commanded the Great Deities of Execution and Judgment to patrol the mortal world. If anyone plots to murder their parents or elders, though the act remains unformed, the evil intent has already arisen, and they will be swiftly executed. Their souls will descend to Fengdu, where they will suffer excruciating torments without hope of pardon.\n\nVirtuous men and faithful women, after the end of their lives, will not see hell but will ascend directly to heaven. If reborn in the human realm, they will dwell in the Central Kingdom as men—intelligent, wealthy, noble, and long-lived.\"\n\nThe perfected one asked: \"How can the karmic causes of past lives be clearly seen in retribution in this world?\"\n\nThe Heavenly Worthy replied: \"To know your past life, observe your present existence; to know your future life, observe your present conduct. If one is born in a royal palace, among imperial relatives, in the households of nobles or ministers, or in a tranquil and blessed place—free from toil in body and mind, enjoying peace, prosperity, and honor—this is the result of good causes from three past lives. If, though born among humans, one is blind or maimed, afflicted by sores, unable to find peace or healing, reduced to begging on the roads, suffering pain without injury, weeping on the ground and wailing to heaven—this is the retribution for past lives in which one disrespected heaven and earth, the Three Luminaries, and the Three Treasures, slandered the scriptures, and now receives this punishment.\n\nIf one is born with rotting lips, a missing nose, crippled hands or feet, and is despised and shunned by others—this is retribution for past lives in which one cursed the wind and rain, reviled parents and parents-in-law, relied on brute strength to bully the innocent, and now receives this punishment. If one suffers difficult childbirth, obstructed labor, or if the child survives while the mother perishes, or if both mother and child die—this is retribution for past lives in which one aborted fetuses, abandoned children, and harmed those entrusted to rebirth, and now receives this punishment. If one is born deaf, mute, or dumb, unable to hear or speak—this is retribution for past lives in which one schemed with cunning, deceiving the foolish, and now receives this punishment.\"",
      "overlap_context": "ent, the Five Peaks offered flowers, and the Four Waterways presented treasures. From the assembled ranks, a perfected one named Yuluo stepped forth, knelt upright, and addressed the Heavenly Worthy, saying: \"By what past affinity have I, your servant, been granted the fortune to attend Your Jade Steps? I have been blessed to hear the Supreme Dao, and my heart is deeply indebted to Your boundless compassion. Yet in the governance of transformation, my humble understanding remains unenlightened.\"",
      "start_char": 359,
      "end_char": 1591,
      "start_sentence": 23,
      "end_sentence": 75,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.340662240982056,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\碧霞元君护国庇民普济保生妙经.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "或衣不护寒，食不济馁，死於沟壑，暴露尸骸，此是往生不惜五谷，作贱绫罗，今受斯报。 或为女流，生於卑贱之中，及遭寇夷虏掠者，此是往生倚恃凶强，奸欺良善，今受斯报。 种种果报，说不可尽。 俱系前因，判注无错。 若不悟悔前非，断恶修善，复生於鳞介毛羽、爪牙蹄角之类。 其中多受鞭挞，屠割烹煎，复化微虫，难复人身。 真人闻是恶报，稽颡拜曰：下民无知，一如赤子。 以何熏修，得免斯报，伏望天慈恩广好生，开明善道。 天尊告曰：碧霞元君，虽曰罚恶，意在度人。 但能自新，无不救度。 所有神咒，能解宿愆。 吾为宣说： 大道之始，无象无言。 天地既辟，万神司权。 泰山岱岳，奠靖坤元。 中有元君，号曰天仙。 始证帝真，位居碧天。 为化众生，示现慈颜。 大显神通，威德孔宣。 安民护国，警世敦元。 辅忠助孝，翼正扶贤。 保生益算，延嗣绵绵。 消灾化难，度厄除愆。 驱瘟摄毒，剪祟和冤。 岳庭官将，号令威严。 不仁不义，忤逆凶顽。 不尊正道，化微尘姻。 敢有咒诅，押送酆山。 魂击幽司，万劫不原。 下民有祷，无愿不全。 大慈应感，溥济人天。 天尊谓郁罗真人曰：若人一念回心，皈依正道，心神内静，结习外消。 便请清戒道士，或就观宇，或于家庭，严洁斋坛。 尽心建善，讽诵是经。 或三五七遍，或至百遍千遍，皈命元君，焚香忏悔，注想慈容，俨然如在。 五体投地，百拜祈恩，即得罪销黑书，愆除岳府。 身家宁吉，祸患消弭。 出入亨通，动居利泰。 九玄七祖，咸得逍遥。 真人闻是利益，踊跃欢忻。 臣今得遇是经，愿为流布人间，俾令兆民咸归仁化，齐兴慈让，保国清平。 真人再拜，而说赞曰： 皈命碧霞经，宿业解三生。 转诵碧霞经，灾难不临身。 仰体碧霞经，默有鬼神钦。 恪礼碧霞经，家眷保安宁。 存想碧霞经，精气神光融。 敬慕碧霞经，福禄寿齐增。 佩带碧霞经，邪恶不敢侵。 调演碧霞经，田宅益兴隆。 供养碧霞经，火盗永不生。 赞咏碧霞经，万愿悉如心。 天尊曰：仁哉郁罗，能为天人遂其利乐，功德无量。 宜进仙勋。 天尊说经法已，驾返清都。 诸天仙众，顶礼奉送，庆会难言。 是时真人下传世间，以广宣化。 元始天尊说碧霞元君护国庇民普济保生妙经竟 天仙碧霞宝诰 泰山上顶，东岳内宫，曩时现玉女之身，根本即帝真之质。 膺九炁而垂慈示相，冠百灵而智慧圆融。 行满十方，功周亿劫。 位证天仙之号，册显碧霞之封。 统岳府之神兵，掌人间之善恶。 寻声赴感，护国安民。 大圣大慈，至孝至仁。 天仙玉女、广灵慈惠、恭顺溥济、保生真人、护国庇民宏德碧霞元君。",
      "translated_text": "Or if one is clothed yet cannot ward off the cold, fed yet cannot stave off hunger, dying in ditches with one’s corpse left exposed—this is retribution for past lives in which one wasted the five grains and treated fine silks with contempt, and now receives this punishment. Or if one is born a woman in lowly circumstances, or suffers capture and enslavement by bandits and barbarians—this is retribution for past lives in which one relied on violence and deceit to oppress the good and kind, and now receives this punishment.\n\nSuch karmic consequences are beyond enumeration, yet all stem from past causes, their judgment infallible. Should one fail to awaken, repent past wrongs, sever evil, and cultivate goodness, one may be reborn among creatures with scales, shells, fur, or feathers—those with claws, fangs, hooves, or horns. There, many endure whipping, slaughter, boiling, and roasting, only to transform into tiny insects, making it difficult to regain human form.\n\nUpon hearing these dire consequences, the Perfected One bowed deeply and said: “The people are ignorant, like newborn babes. By what practice may they avoid such retribution? I humbly beseech Your Celestial Compassion, vast in love for all life, to illuminate the path of goodness.”\n\nThe Heavenly Worthy replied: “Though the Azure Cloud Primordial Sovereign punishes evil, her intent is to deliver beings. All who reform themselves will be saved. There are sacred incantations that dissolve past transgressions. I shall now proclaim them:\n\nAt the beginning of the Great Dao, there was no form, no speech. After Heaven and Earth parted, the myriad spirits assumed their authority. Mount Tai, the lofty peak, stabilized the Earth’s foundation. Within it dwells the Primordial Sovereign, known as the Heavenly Immortal. She first realized the imperial truth and ascended to the Azure Heavens. To transform sentient beings, she manifests a compassionate countenance. Her divine powers are vast, her virtue and majesty resplendent. She pacifies the people and protects the realm, awakens the world and upholds its primal essence. She aids loyalty and fosters filial piety, upholds righteousness and elevates the worthy. She preserves life and extends lifespan, ensuring descendants flourish. She dispels disasters, resolves calamities, delivers from distress, and erases transgressions. She drives away plagues, subdues poisons, severs malevolent influences, and reconciles grievances. The officials and generals of her mountain court issue commands with solemn authority. Those who are unkind or unjust, rebellious or wicked, who scorn the true Dao—are reduced to dust and smoke. Should any dare to curse her, they are sent to Mount Feng, their souls consigned to the dark prisons, never to be pardoned for ten thousand kalpas. Yet when the people pray to her, no wish remains unfulfilled. Her great compassion responds to all, universally aiding humans and gods alike.”\n\nThe Heavenly Worthy addressed the Perfected One Yu Luo: “If one turns their heart even for a moment, taking refuge in the true Dao, calming the spirit within and dissolving habitual tendencies without, one may invite a pure precept-holding Daoist to perform rites—whether in a temple or at home—preparing a solemn and purified altar. With wholehearted devotion, one should perform good deeds, recite this scripture—be it three, five, or seven times, or even a hundred or a thousand—pay homage to the Primordial Sovereign, burn incense in repentance, and visualize her compassionate visage as if she were truly present. Prostrating with the five limbs touching the ground, bowing a hundred times to implore her grace, one’s sins will be erased from the dark ledgers, and transgressions expunged from the mountain court. Household and self will enjoy peace and fortune, misfortunes will vanish, all endeavors will prosper, and every movement will be auspicious. The nine generations of ancestors and the seven lineages will all attain freedom. Upon hearing these benefits, the Perfected One rejoiced exuberantly.\n\nThe Perfected One said: “Having now encountered this scripture, I vow to disseminate it among the people, that all may return to benevolence, cultivate harmony, and safeguard the realm in peace.”\n\nThe Perfected One bowed again and offered this hymn of praise:\nTaking refuge in the *Azure Cloud Scripture*, past karma dissolves across three lifetimes.\nReciting the *Azure Cloud Scripture*, disasters will not befall one’s body.\nRevering the *Azure Cloud Scripture*, ghosts and spirits hold one in awe.\nHonoring the *Azure Cloud Scripture*, one’s family remains safe and serene.\nMeditating on the *Azure Cloud Scripture*, essence, qi, and spirit merge in radiant harmony.\nVenerating the *Azure Cloud Scripture*, fortune, prosperity, and longevity all increase.\nCarrying the *Azure Cloud Scripture*, evil dares not approach.\nChanting the *Azure Cloud Scripture*, fields and homes flourish ever more.\nWorshipping the *Azure Cloud Scripture*, fire and theft never arise.\nPraising the *Azure Cloud Scripture*, all wishes come to fruition.\n\nThe Heavenly Worthy said: “Noble indeed is Yu Luo, who brings such benefit and joy to gods and humans. Your merit is boundless; you are worthy of advancement in the ranks of immortals.”\n\nAfter the Heavenly Worthy had expounded the scriptural method, he returned to the Pure Capital. The assembly of heavenly immortals bowed in reverence and saw him off, their joy beyond words. Then the Perfected One descended to transmit the scripture in the world, widely propagating its teachings.\n\nHere ends the *Marvelous Scripture of the Primordial Sovereign of Azure Cloud for Protecting the Realm, Sheltering the People, and Universally Preserving Life*, spoken by the Heavenly Worthy of Primordial Beginning.\n\n**Precious Invocation of the Heavenly Immortal Azure Cloud**\nAtop the summit of Mount Tai, within the inner palace of the Eastern Peak, she once manifested as a Jade Maiden, her fundamental nature being the essence of imperial truth. Clothed in the ninefold qi, she extends her compassion and reveals her form; crowned with the hundred spirits, her wisdom is perfectly fused. Her deeds fill the ten directions, her merit spans countless kalpas. She has attained the title of Heavenly Immortal and been enfeoffed as the Azure Cloud. She commands the divine soldiers of the mountain court and oversees the good and evil of the human realm. Responding to cries for help, she protects the realm and pacifies the people. Greatly sagely, greatly compassionate, supremely filial, supremely benevolent—Heavenly Immortal Jade Maiden, Vastly Numinous and Compassionate, Reverent and Universally Aiding, Life-Preserving Perfected One, Vastly Virtuous Azure Cloud Primordial Sovereign who Protects the Realm and Shelters the People.",
      "overlap_context": "his punishment. If one suffers difficult childbirth, obstructed labor, or if the child survives while the mother perishes, or if both mother and child die—this is retribution for past lives in which one aborted fetuses, abandoned children, and harmed those entrusted to rebirth, and now receives this punishment. If one is born deaf, mute, or dumb, unable to hear or speak—this is retribution for past lives in which one schemed with cunning, deceiving the foolish, and now receives this punishment.\"",
      "start_char": 1591,
      "end_char": 2637,
      "start_sentence": 76,
      "end_sentence": 142,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.7686812877655,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\碧霞元君护国庇民普济保生妙经.txt",
        "category": "正统道藏续道藏"
      }
    }
  ]
}