{
  "source_id": "神仙养生秘术",
  "source_file": "chunked_daozang\\神仙养生秘术.json",
  "total_chunks": 7,
  "total_original_chars": 5549,
  "total_translated_chars": 28174,
  "total_translation_time": 160.83649039268494,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\神仙养生秘术.txt",
    "category": "众术类"
  },
  "full_translation": "**The Esoteric Arts of Immortal Nurturing and Longevity**\n\n**Scripture Title:** *The Esoteric Arts of Immortal Nurturing and Longevity*\nAttributed to transmission from a Mount Taibai adept to Liu Jingxian, Yellow Gate Attendant of the Later Zhao dynasty (Yongning 2, *circa* 350 CE), later collated by the Northern Song Daoist Baoyizi (Chen Xianwei). One scroll.\n**Source Text:** *Zhengtong Daoist Canon*, *Dongshen* Section, *Zhongshu* Category.\n\n---\n\n### **The Esoteric Arts of Immortal Nurturing and Longevity**\n*Transmitted by the Mount Taibai Adept to Liu Jingxian, Yellow Gate Attendant of the Later Zhao; Collated by Baoyizi of the Song*\n\n#### **1. Numinous Cinnabar (Lingsha)**\n**Ingredients:**\n- Seven *jin* of alumstone\n- One *jin* of mercury\n- Four *liang* of sulfur\n\n**Method:**\nFirst, melt the sulfur, then add the mercury and stir-fry until sandy. Cease firing.\nUse either a Xiangyin jar, a Jiading jar from Western Shu, or an old wine jar of unglazed pottery. Seal with sweet clay to a thickness of three *cun* and dry in the shade. Place the mixture inside.\nTake an iron lamp dish and set it over the jar’s mouth, ensuring the water within never dries. Seal the rim with sweet clay, leaving one vent hole. Thread an iron wire through the lamp dish and jar handles, then place in the furnace.\nUse 120 *jin* of charcoal. Begin firing at dawn and cease the next dawn. Remove at midday, break the jar, and retrieve the product. To refine it into *Heart Red*, grind to a fine powder. For *Numinous Cinnabar*, further methods apply.\n\n#### **2. Heart Red (Xinhong)**\n**Ingredients:**\n- One *jin* of mercury\n- Four *liang* of sulfur\n\n**Method:**\nFirst, melt the sulfur, then add the mercury. Use either a Xiangyin jar, a Jiading jar from Western Shu, or an old wine jar of unglazed pottery. Seal with sweet clay to a thickness of three *cun* and dry in the shade. Place the mixture inside.\nSet an iron lamp dish over the jar’s mouth, ensuring the water within never dries. Seal the rim with sweet clay, leaving one vent hole. Thread an iron wire through the lamp dish and jar handles, then place in the furnace.\nUse 120 *jin* of charcoal. Begin firing at dawn and cease the next dawn. Remove at midday, allow to cool, then break the jar. Discard the kernels, grind to a fine powder, and mix with five buckets of water in a vat or basin. Grind again.\nAt the *you* hour, let the mixture settle in the vat. The top layer is *Board Red*, the middle *Secondary Red*, and the bottom *Heart Red*. Cut with a knife, dry in sunlight, wrap in silver paper, and further encase in paper.\n\n#### **3. Dead Mercury (Sigong)**\n**Ingredients:**\n- One *jin* of mercury\n- One *jin* of black tin\n- One *jin* of *shanze* (realgar or orpiment)\n\n**Method:**\nFashion two boxes: one from black tin, the other from *shanze*. First, place the mercury in the *shanze* box and seal it airtight.\nPlace the *shanze* box inside the tin box, then set both in an iron cauldron. Seal the cauldron’s mouth firmly with red halloysite and raw honey. Bind top and bottom with iron wire, then place in a quiet chamber within the elixir workshop.\nUse 250 *jin* of charcoal. Begin firing at the *xu* hour (7–9 PM) and cease at the *mao* hour (5–7 AM) the next day. Open the cauldron to find neither black tin nor mercury remaining. The two *jin* of *shanze* may be used freely—this is a secret transmission.\n\n#### **4. Whitening (Dianbai)**\n**Ingredients (each processed separately):**\n- Four *liang* of roasted cinnabar\n- Four *liang* of chalcanthite\n- Four *liang* of realgar\n- Four *liang* of orpiment\n- Four *liang* of nitre\n- Four *liang* of calcined alum\n- Four *liang* of *shanze*\n- Four *liang* of green salt\n\n**Method:**\nGrind all into fine powders and store in a sealed container. Mix one *sheng* of the powders with camphorwood root, salt, wine, and vinegar.\nTake a crucible and place four *liang* of Yunnan copper inside. Heat in the furnace with a bellows, covering with a tile until molten. Add two *qian* of *xiusha* (purified cinnabar) and stir evenly. Then add two *liang* of the prepared medicine and one *liang* of *shanze*. Stir thoroughly, cease firing, and pour into a smooth pool to cool. The result is a supreme treasure, malleable for any use.\n\n#### **5. Hair Removal (Bamao)**\n**Ingredients (each processed separately):**\n- One *liang* of *shanze*\n- One *liang* of white alum\n- One *liang* of roasted cinnabar\n- One *liang* of mercury\n- One *liang* of white iron\n- One *liang* of chalcanthite\n- One *liang* of nitre\n\n**Method:**\nGrind all into fine powders. Take a crucible and place half a *jin* of copper inside. Refine three times until it turns peach-blossom red.\nIn another crucible, place two *liang* of copper. Heat in the furnace with charcoal and a bellows, covering with a tile. Add five *qian* of *shanze* and half a *qian* of *xiusha*, then mix in two and a half *qian* of the prepared medicine. Cease firing, pour into a smooth pool, and repeat the process three times. Return to the crucible to melt into a supreme treasure, usable for fine softness or crafting vessels—this is a secret formula.\n\n#### **6. Shrinking (Suohe)**\n**Method:**\nCast ten *jin* of white tin into plaques, each one *cun* wide and three *cun* long, with a hole at the top. Thread an iron rod through the plaques and suspend them in a pool without touching the bottom.\nAfter twenty-one days (three seven-day cycles), remove the plaques and melt them in an iron pot. Recast into plaques.\nAfter eighty-one days, remove, melt, and recast.\nAfter one hundred fifty days, remove, melt, and recast.\nAfter three hundred days, remove, melt, and recast.\nAfter six hundred days, the fire-taming is complete. Further hammering refines the metal into vessels.\nFor fine softness, extend to twelve hundred days to achieve a supreme treasure that remains unchanged for a thousand years—this is a secret transmission.\n\n#### **7. Constructing the Pool (Zuochi)**\n**Method:**\nDig a pool two *zhang* square and seven *chi* deep. Line with bricks, sealing the seams with hemp and lime mortar. Cover the pool with a latrine, filling it with five *chi* of human waste. Exercise utmost care during construction.\nOffer paper money and horses as sacrifices, ensuring no one learns of the work. Revealing this celestial mechanism to the unworthy is forbidden.\n\n#### **8. Producing Verdigris (Poliutonglü)**\n**Method:**\nCast ten *jin* of copper into plates. Prepare an iron pot, one *tan* of pure vinegar, and one *jin* of *xiushā* (sal ammoniac). Mix the *xiushā* with the vinegar, then heat and simmer over a constant flame. Continuously pour the medicated vinegar over the plates. After two *shichen* (four hours), cease and scrape off the verdigris before pouring again. If the plate thins to three-tenths of its original thickness, discard it. Settle the verdigris, dry it thoroughly, and use as desired.\n\n#### **9. Crafting Thread Tips (Zuoxiantou)**\n**Method:**\nTake one kneecap bone from a yellow ox and carve it into beads the size of peas. Drill holes through them. Prepare over one hundred sheets of silver foil and one *qian* of *jinjiaoxin* (gold-based alum). Grind these finely in a mortar, then hold glue water in the mouth and gradually spit it into a bowl. Grind the mixture once, then rinse with clear water—repeat this process seven times. Take a thread, tie a knot at one end, and thread a bead onto it. Use a new brush to apply the foil onto the bead, then press it firmly with cold cotton. If a radiant sheen appears, the process is complete. If the color is too pale, repeat the application. The bead must not fade when tested. Use as desired. This is a secret transmission—do not reveal it to the unworthy. Regardless of size, craft as needed.\n\n#### **Assembling the Eight Immortals to Point Āh (Juba Xian Dian A)**\n**Part One**\n\n**Part Two**\n\n**Mulberry blossoms, pagoda tree blossoms, gardenia blossoms, gleditsia blossoms, white crane blossoms, honey suckle blossoms, coltsfoot blossoms, and crabapple blossoms**—take two *liang* of each, grind into fine powder, and mix with one *jin* of honey melted in a copper pot. Add an unspecified quantity of aged scallion whites; when a drop of honey no longer disperses in water, incorporate one *liang* of the powdered herbs and half a *qian* of turmeric. Remove from heat, stir thoroughly, and set in a basin of water. Use as desired.\n\n**Part Three**\n\n**Pine pollen, corydalis blossoms, gleditsia blossoms, honey suckle blossoms, peach blossoms, yellow plum blossoms, yellow chrysanthemum blossoms, and apricot blossoms**—take one *liang* of each, grind into fine powder, and mix with one *jin* of honey melted in a copper pot. Add five to seven aged scallion whites, stir the honey until a drop no longer disperses in water, then incorporate one *liang* of the powdered herbs and half a *qian* of turmeric. Remove from heat, stir thoroughly, and set in a basin of water. Use as desired.\n\n**Part Four**\n\n**Vajra blossoms, dodder blossoms, hibiscus blossoms, silk tree blossoms, datura blossoms, white peony blossoms, rose of Sharon blossoms, and white willow blossoms**—take one *liang* of each, grind into fine powder, and mix with one *jin* of honey melted in a copper pot. Stir with aged scallions until the honey thickens, ensuring a drop does not disperse in water. Remove from heat, incorporate one *liang* of the powdered herbs, stir thoroughly, then add one *qian* of turmeric powder. Set in a basin of water.\n\n**Part Five**\n\n**Marigold blossoms, senna blossoms, golden cup blossoms, white mallow blossoms, gleditsia blossoms, mulberry blossoms, and gardenia blossoms**—take one *liang* of each, grind into fine powder, and mix with one *jin* of honey melted in a copper pot. Add aged scallion juice to thicken the honey until a drop does not disperse in water, then incorporate one *liang* of the powdered herbs and one *qian* of turmeric. Remove from heat, stir thoroughly, and set in a basin of water.\n\n**Part Six**\n\n**Yellow chrysanthemum blossoms, datura blossoms, cocklebur blossoms, senna blossoms, white crane blossoms, pine pollen, gleditsia blossoms, mulberry blossoms, sophora blossoms, yellow gentian blossoms, henbane blossoms, white morning glory blossoms, sweet chrysanthemum blossoms, honey suckle blossoms, coltsfoot blossoms, yellow plum blossoms, gardenia blossoms, pearl blossoms, crabapple blossoms, peony blossoms, spring blossoms, white peony blossoms, and golden bell blossoms**—take one *liang* of each, dry in the sun, and grind into fine powder. Melt five *jin* of honey in a copper pot, add five *jin* of aged scallions, extract the juice, and mix with one and a half *jin* of the powdered herbs. Form into pills the size of a bullet, each weighing two and a half *qian*. Melt one *jin* of honey in a copper ladle, dissolve one pill in it, and when the sweetness dissipates and a drop no longer disperses in water, set in a basin of water. If the color is too pale, add one *qian* of turmeric powder.\n\n**Part Seven**\n\n**Indigo blossoms, gleditsia blossoms, silver apricot blossoms, mulberry blossoms, dog blossoms, wintersweet blossoms, and watermelon blossoms**—take one *liang* of each, and mix with one *jin* of honey melted in a copper pot. Stir with aged scallion whites until the honey thickens and a drop does not disperse in water. Incorporate one *liang* of the powdered herbs and one *qian* of turmeric powder. Remove from heat, stir thoroughly, and set for use.\n\n**Part Eight**\n\n**Part Eight**\n\n**Golden coin corydalis, white corydalis, trichosanthes root, licorice, mulberry yellow, and *buguyin***—take equal parts of each. Grind into fine powder. Melt one *jin* of honey in a copper pot, stir with aged scallion whites until the honey thickens and a drop no longer disperses in water. Add half a *liang* of the powdered herbs and half a *qian* of turmeric powder. Remove from heat, stir thoroughly, and set for use.\n\n*Song:*\nGolden coin corydalis and trichosanthes root,\nLicorice, mulberry yellow, and *buguyin* blend.\nA *jin* of honey with half a *liang* of herbs—\nThis method’s benefit surpasses burning gold.\n\n**Part Nine: Sacred Wax Method**\nTen *jin* of mung bean starch, two *jin* of gardenia. For yellow wax, use one *jin*. Place in a copper pot to melt, then add one *jin* of starch and one *liang* of pine pollen. If using pine pollen, add one *jin*; if not, add half a *jin*. Remove from heat, stir until dry, and set in a basin for use.\n\n**Part Ten**\nFive *jin* of calcite, four *liang* of turmeric—stir evenly and grind into powder. Combine the two ingredients. Grind into fine powder like flour. Melt one *jin* of refined wax, add half a *jin* of the powdered herbs. Remove from heat, stir until dry, and set in a basin for use.\n\n**Part Eleven**\nTen *jin* of *bai jiaoxiang*. Use five *jin* of eggplant stalk ash. Leach with a bucket of water, then boil the *bai jiaoxiang* until it turns into black soot. Melt one *jin* of wax in a copper pot, add one *jin* of the soot and two *qian* of turmeric. Remove from heat, stir until dry, and set for use.\n\n**Part Twelve**\nOne *dou* of aged mallow seeds—roast until fragrant, remove the skins, and grind into fine powder (ten *jin*). Add one *liang* of turmeric powder and mix evenly. Melt ten *jin* of wax in a copper pot, combine with the two ingredients. Remove from heat, stir until dry, and set in a basin.\n\n**Part Thirteen: White Wax Method**\nFive *jin* of *wutong* oil. Melt in a copper pot, remove from heat, and filter through silk. Melt ten *jin* of wax in a copper pot, add the *wutong* oil, and stir evenly. Remove from heat, divide into three blocks.\n\n**Part Fourteen: Yellow Wax Method**\nFour *liang* of pine pollen, two *jin* of millet flour, two *liang* of gardenia. Boil in water until the mixture turns yellow, then dry in the sun. Melt one *jin* of wax in a copper pot, combine with the ingredients, and stir evenly. Remove from heat, dry, and set in a basin for use.\n\n**Part Fifteen**\nOne *jin* of mung bean starch, one *jin* of calcite, half a *jin* of mallow seed powder, one *jin* of clam powder, and one and a half *qian* of turmeric powder. Grind the five ingredients into fine powder like flour. Melt five *jin* of wax in a copper pot, combine with the powdered herbs, and stir evenly. Remove from heat, dry, and set in a basin. Divide into three blocks.\n\n**Part Sixteen**\nFour *liang* each of pine pollen, alum, calcite, and clam powder. Grind into fine powder. Melt three *jin* of wax in a copper pot, combine with the powdered herbs, and stir evenly. Remove from heat, dry, and set in a basin. Divide into two blocks.\n\n**Seventeen: Light Powder Formula**\nOne *jin* of mercury, four *liang* of sulfur. First melt the sulfur in an iron ladle, then add the mercury and stir together until it forms sand. Use four *liang* of litharge and two *liang* of saltpeter to make a crucible. In spring and summer, wait three days; in autumn and winter, seven days. Mix the sand with the crucible ingredients, then spread the mixture on a large iron plate. Cover with a clay basin, seal the edges with honey-mixed red halloysite, and heat with charcoal fire (moderate intensity). Start the fire in the morning and stop at noon. Once cooled, open the basin—the medicine will be on the inner surface. Scrape it off and store in a wooden box, four *liang* per container, for use as desired. The residue at the bottom is *frost powder*, and the upper layer is *light powder*—this is a profound and secret method.\n\n**Eighteen: Seven-Treasure Warm Sulfur Cup**\nDivide one *jin* of imported sulfur into four portions (one portion is four *liang*). Use one *liang* each of cinnabar, *xin hong*, gall, light powder, indigo, lead powder, and verdigris. Process each ingredient separately and grind into fine powder. For one cup, use three *qian* of the mixture. Place the cup in a water basin, then set it inside a porcelain cup from Chuzhou. Cover with a silk handkerchief (leaving a small opening in the center) and a tea tray, or fill with wine. Leave the wine in the cup overnight, and consume it the next morning on an empty stomach. It warms in winter and cools in summer, treating all cases of lower *qi* deficiency and cold.\n\n**Single Sulfur Cup**\nTreats lower *qi* deficiency and cold, similar to the Seven-Treasure Cup. Use one lump of sulfur (size does not matter) and prepare it in the same manner as the cup above.\n\n**Nineteen: Rubbing Method to Turn Copper White as Silver**\nFive *qian* each of chalcanthite, dried alum, genuine silver filings, mercury, deer antler ash, and *quesha*. First melt white iron in a pot, then add mercury while hot and stir evenly. Grind into powder. Next, melt the silver, add *quesha* and *pengsha*, and grind into fine powder while hot. Grind the dried alum, chalcanthite, and deer antler ash into fine powder. Combine all eight ingredients and grind again into a fine powder. To use, first wash the copper vessel three times with gleditsia water, then rub it with leaves. Seal with paper for seven days per application, repeating three times for best results—this is a wondrous and secret method. Do not reveal to others.\n\n**Sacred Wax Candle Method**\n\n**Sacred Wax Candle Method**\nFour *liang* each of *baijiaoxiang* (resin), sulfur, and sophora fruit (collected in the eighth month). First, pound the sophora fruit into a paste. Melt the *baijiaoxiang* and sulfur together, then pour the mixture into a bamboo tube seven *cun* in length. One candle will burn for a full month—divinely wondrous.\n\n**Oil-Saving Formula**\nCollect duckweed in the sixth month, and *wasong* (houseleek) in the sixth month. One *liang* each of *yuanzhi* (polygala root), *huangdan* (lead oxide), and clam powder. Grind all into a fine powder. For every *liang* of oil, use one *qian* of the powder—it will last a month.\n\n**Sacred Wax Candle Method (Alternate)**\nTwo *jin* of sophora fruit (collected in the eighth month), one *jin* of *baijiaoxiang*, and four *liang* of sulfur. First, pound the sophora fruit into a paste. Melt the *baijiaoxiang* in a sand pot, then add the sophora fruit and simmer until thick. Next, add the sulfur and stir evenly with a sophora twig. Pour into a bamboo tube seven *cun* long and as thick as a thumb. Dry in the shade, then remove the tube. Each candle will burn for sixty days—marvelous.\n\n**Ink-Making Method**\nTen *liang* of pine soot, four *liang* of *ejiao* (ass hide glue). Simmer *leihua* (thunderbolt flower), *gansong* (spikenard), ginger juice, and gleditsia (for tooth-cleaning) briefly in water, then strain. Dissolve four *liang* of *ejiao* in the liquid. Add three gold foils and two silver foils, then mix with the pine soot. Pound with a pestle ten thousand times, then mold into ink sticks. Place in an ash pit: five days in spring, three in summer, seven in autumn, and ten in winter. Remove when ready for use.\n\n**Dead Honey Method**\nTake one *jin* of white rock honey and an iron pot with original oil residue. Place the honey in the pot, then stir with ten stalks of aged scallions until cooked. Remove the scallions, add ten fresh stalks, and stir evenly over gentle heat. Test by dripping into water—if it holds shape, does not stick to teeth or hands, it is perfected, a treasure for transforming body and bone. After refining, blend with fine medicinal powders to achieve a golden hue. Use the inner white layer of horsehide (one and a half *liang*), mulberry flowers, gleditsia flowers, sophora flowers, *baimendong* (asparagus root), scallion flowers, *tusizi* (dodder seeds), winter-sweet flowers, *mimeng* (buddleia flowers), and chrysanthemum flowers (one and a half *liang* each). Grind into a fine powder and mix evenly. For every *jin* of honey, use one and a half *liang* of the powder. Stir well, then pour into cold water to form blocks. This is the secret method for dead honey—a divine formula for any use.\n\n**Hundred-Flower Paste**\n*Mimeng* (buddleia), licorice, trichosanthes root, *xuanhu* (corydalis), mulberry yellow, and white lime (in equal parts). For one *jin* of flowers, use two *liang* of the powder—superior to burning gold or silver. Grind all into a fine powder and mix. Melt the flowers in a copper pan, then add the powder and stir evenly. Strain through raw silk into water, then shape into blocks for use.\n\n**Wondrous Spirit Elixir**\nEat the leaves of the *qiao* tree to remain full and hunger-free, evading hardship and fasting. One *jin* of *duzhong* (eucommia bark), remove the coarse skin, soak in vinegar overnight, dry, stir-fry, and grind into fine powder. One *jin* of *jingjiesui* (schizonepeta spikes), grind into fine powder. One *jin* of *baifuling* (white poria), remove the skin. One *jin* of licorice, remove the skin. Half a *jin* of mint. Grind all into fine powder, then form into pills with refined honey, each the size of a little finger. Wash *qiao* leaves clean, chew with the pills for best effect.\n\n**Life-Preserving Elixir for Fasting and Evading Hardship**\n*Muxiang* (costus root), *baifuling* (white poria), *chishizhi* (halloysite), frankincense, mercury. Combine black tin with mercury to form pellets, then grind finely in a ceramic vessel. One *qian* each of cinnabar, realgar, and *mituoseng* (litharge). Six *qian* of yellow wax, three *qian* of pine resin. Grind all nine ingredients into fine powder, then melt the pine resin and yellow wax to form pills, each weighing one *qian*. When taking the elixir, first eat a full meal of glutinous rice porridge, then swallow one pill with frankincense tea. After five to seven days, take another pill. After two doses, eat seven jujubes on the first day, then consume them daily until finished—hunger will vanish, and thirst may be quenched with water.\n\n**Water-Sipping Method**\nThe Thunderbolt Fire Lord advises: Focus on the sun, draw in black qi, and blow it into water before drinking. After fasting, the mind becomes clear and thoughts still—no distractions enter or leave. Once, the imperial physician Yan Zhongshan, fleeing danger in Tangzhou on the third day of the seventh month in the *guisi* year, survived without food until death seemed certain. After taking the elixir, his entire family fasted for forty-nine days, yet remained safe and restored to health.\n\n**Immortal Wine Formula**\nUse one *sheng* and eleven *ge* of glutinous rice (or other suitable grain), four *liang* of fine yeast, one and a half *liang* of malted barley, and two *liang* of leaven. Grind into fine powder, then cook five *sheng* of water into porridge. Add the powdered ingredients, stir evenly, and let the wine ferment—its fragrance will be divine, and the method infallible.\n\n**Dry Wine Formula**\nOne *liang* each of cinnamon and black aconite, one *liang* of fine honey, one *liang* of Sichuan pepper, two *liang* of fresh ginger, two *liang* of apricot kernels (peeled and mashed), and one *jin* of divine yeast. Grind into fine powder. Wash two *sheng* of millet, steam until cooked, then mix with the powdered medicine. Place in a jar for three nights, then pound into pills the size of chicken heads. Store in a jar, seal with paper to prevent air exposure. After seven days, expose to wind for one *shichen* (two hours), then return to the jar and reseal. This wine may be stored indefinitely. To drink, steep one pill in five *sheng* of hot water, seal with damp paper, and soon the fragrance of wine will arise—fit for offering to the gods.\n\n**Daoist Immortal’s Method for Consuming Fresh Rehmannia to Prolong Life**\nTake an unspecified quantity of fresh rehmannia, selecting plump roots. Dry in the shade, grind into fine powder, and blend with refined honey to form pills the size of *wutong* seeds. Take thirty pills each time, washed down with hot water or wine. After thirty-nine days of taking three doses daily, the complexion will bloom like peach blossoms. After three years, one attains longevity.\n\n**Daoist Immortal’s Method for Consuming *Xianhua* for Longevity**\nGather one *dan* of *xianhua* when ripe in the seventh or eighth month. Dry in the sun, then pound in a mortar to remove thorns before grinding into fine powder. Take two spoonfuls each time, mixed with fresh water, three times daily without interruption. This grants immortality.\nAfter one year of consumption, one will no longer feel cold in winter or heat in summer.\nAfter two years, the old revert to youth, white hair turns black again, and fallen teeth regrow.\nAfter three years, the body becomes light, and life is prolonged.\n\n**Grain-Abstention Formula**\nStir-fry four *sheng* of black soybeans to remove their skins. Boil four *sheng* of hemp seeds, then pound into powder. Take one *ge* each time, mixed with water, three times daily. After ten days, one may cease eating grains, and neither cold nor heat will affect the body in winter or summer.\n\n**Daoist Immortal’s Method for Consuming Sophora Seeds to Prolong Life and Prevent Aging**\nOn the *shangsi* day of the tenth month, gather sophora seeds and store them in a new earthenware vessel. Cover with a basin, seal tightly with mud to prevent qi from escaping, and open after twenty-one days. Remove the skins, then begin consumption on the first day of the lunar month with one seed, taken with water. Increase by one seed each day until the fifteenth, then decrease by one seed daily. Repeat this cycle without end. This enables one to read by night and, with prolonged use, multiplies strength a hundredfold.\n\n**Grain-Abstention and Fasting Formula (First Calm the Mind)**\nStir-fry one *dou* of glutinous millet with six *liang* of sesame oil until cool. Add equal parts—ten *liang* each—of salt, Sichuan ginger, and Sichuan pepper, along with three *sheng* of turnip seeds and five *sheng* of dried jujubes. Grind all into fine powder. Take one large spoonful each time, mixed with fresh water, three times daily. As hunger and thirst subside, strength will gradually return. One may freely consume fruits, nuts, teas, and broths as desired, but meat is strictly forbidden. Avoid:\n- Horses that died from exhaustion,\n- Donkeys killed by drowning,\n- Cattle that died from bloating,\n- Sheep with red eyes,\n- Pigs that died of illness,\n- Soft-shelled turtles with pellets,\n- Pregnant hares,\n- Fish without scales.\nAs the ancient texts warn, consuming these will invite a hundred ailments.\n\n**Grain-Avoidance Formula**\n\nPresented on the seventeenth day of the second month of the second year of Yongning, by the Gentleman-in-Attendance at the Yellow Gate, Liu Jingxian:\n\n*\"I encountered a recluse of Mount Taibai, from whom I obtained this formula. Hearing that grain prices in the capital have soared, I submit this to provide relief, for it allows one to go without hunger, sharpens the senses, and imparts a radiant complexion. Should this prove false, my entire household willingly accepts execution.\"*\n\n**Ingredients and Preparation:**\nFor all seasons, take five *sheng* of black soybeans. Wash thoroughly, steam three times, sun-dry, and remove the skins. Additionally, take three *sheng* of hemp seeds. Soak overnight in hot water, drain, sun-dry, then coat with sticky water, dry again, remove the skins, wash clean, and steam three times. Pound firmly.\n\nNext, combine with the soybean powder and grind into a fine flour. Mix with glutinous rice porridge to form balls the size of a fist. Place in a steamer with rice, cook from nightfall until midnight, then cease heating. Remove at dawn and store in a ceramic vessel, sealed to prevent drying from wind.\n\n**Dosage:**\nConsume three balls at a time, until sated. Refrain from all other food.\n- After the first dose: seven days without hunger.\n- After the second dose: forty-nine days without hunger.\n- After the third dose: three hundred days without hunger.\nOne’s appearance will grow more refined, never wan or haggard.\n\nFor thirst, grind hemp seeds into a pulp and drink. This further nourishes the viscera.\n\nShould one wish to resume eating, crush three *ge* of mallow seeds, decoct in water, and drink to open and guide the stomach, awaiting the return of harmonious qi without harm.\n\nThis formula was engraved in stone at Taiping Xingguo Temple in Bieshan, Hanyang Prefecture.\n\n**Here ends the secret Daoist art of nourishing life.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "神仙养生秘术 经名：神仙养生秘术。 据称为复赵永宁二年（织7）黄门侍郎刘景先从太白山人传授，徒向北宋道士抱一子（陈显微）校正。 一卷。 底本出处：《正统道藏》洞神部众术类。 神仙养生秘术 太白山人传后赵黄门侍郎刘景先受宋抱一子校正 其一灵砂 灵少一料石七斤　水银一斤　硫黄四两 先将硫黄化开，次下水银，炒成砂子，住火了。 或是湘阴瓶，或是西蜀嘉定瓶，或是沙瓶老酒瓶，甘泥固济，三寸厚，阴乾，装入瓶内。 用铁灯盏一个，坐其口盏内，水长要不乾。 用甘泥固济口缝，留哨眼一个，用铁线一条，穿定灯盏瓶耳，入炉。 用炭一百二十斤，早晨下火，至来日早晨住火，晌午出炉，打破瓶。 取出要做心红，研为细末，若做灵砂，再有别法。 其二心红 水银一斤　硫黄四两 先将硫黄化开，次下水银，或是湘阴、西蜀嘉定瓶，或是沙瓶老酒瓶，甘泥固济，三寸厚，阴乾，装入瓶内，用灯盏一个，坐其口，盏内水长要不乾。 甘泥固济口缝，留哨眼一个，用铁线一条，穿定灯盏瓶耳，入炉，，用炭一百二十斤，早晨下火，至来日早晨住火。 午时出炉玲定，打破瓶取出，拣了核子，研为细末，用水五桶，或是盆瓮，一处再研之。 伏时或是盆瓮内坐起水定，上面是板红，第二是二红，底坐是心红，用刀划开，用花日头晒，用银纸包裹，随更用纸包。 其三死汞 水银一斤　黑锡一斤　山泽一斤 黑锡打成盒子一个，山泽打成盒子一个。 山泽盒子先装水银，封闭不透风。 锡盒子盛银盒子在内，入铁鼎内，用赤石脂、生蜜固济鼎口牢固，用铁线上下缚定，入丹房静室处，用炭二百五十斤，戌时下火，来日卯时出，打开鼎，不见黑锡不见汞，山泽二斤任意使用，此是秘衍。 其四点白 炮砂四两　胆矾四两　雄黄四两　雌黄四两　硝石四两　枯矾四两　山泽四两　青盐四两，各自制度 右为细末如粉作匮，用樟柳根、盐酒醋调和为一升，用甘锅一个，装云南铜四两，入炉，用风匣扩，又瓦盖镕开，下袖砂二钱搅匀，次下前药二两，山泽一两，再绷混茸一处，住火，青如滑池内玲定，成至宝也，任意细软使用。 其五拔毛 山泽一两　白矾一两　炮砂一两　水银一两　白铁一两　胆矾一两　硝石一两各自制度 石斫为细末，甘锅一个，用铜半斤，入炒炼三便如桃花色。 甘锅一个，下铜二两，於在炉内，炭火烧之，用风匣绷，．一瓦盖之下，山泽五钱，袖砂半钱，混茸再下前药二钱半，住火，出炉，走滑池三便，再入甘锅，消成至宝，任意使用。 或作细软，或作器盒，此是秘诀也。 其六缩贺 用白锡十斤，铸成牌子，缩贺胜如法，人问世罕闻。 阔一寸，长三寸，头上留眼子一个，用篆豆铁条穿牌子，放在池内，不要着地，三七二十一日取出牌子，铁锅内化开，再铸牌子。 八十一日取出化开，再铸成牌子。 一百五十日取出化开，再铸牌子。 三百日取出化开，再铸牌子。 六百日伏火为度，更着铁锤为度，造成器盒。 如要做细软，再六百日成至宝，千年不变，此是秘衍也。 其七作池 方圆二丈，七尺深，用砖砌合麻，捣石灰泥缝，池上盖厕室，存大粪，可用五尺深，别无疑虑，经心修时，用钱马献供，不许人知，泄漏天机，非人勿示。",
      "translated_text": "**The Esoteric Arts of Immortal Nurturing and Longevity**\n\n**Scripture Title:** *The Esoteric Arts of Immortal Nurturing and Longevity*\nAttributed to transmission from a Mount Taibai adept to Liu Jingxian, Yellow Gate Attendant of the Later Zhao dynasty (Yongning 2, *circa* 350 CE), later collated by the Northern Song Daoist Baoyizi (Chen Xianwei). One scroll.\n**Source Text:** *Zhengtong Daoist Canon*, *Dongshen* Section, *Zhongshu* Category.\n\n---\n\n### **The Esoteric Arts of Immortal Nurturing and Longevity**\n*Transmitted by the Mount Taibai Adept to Liu Jingxian, Yellow Gate Attendant of the Later Zhao; Collated by Baoyizi of the Song*\n\n#### **1. Numinous Cinnabar (Lingsha)**\n**Ingredients:**\n- Seven *jin* of alumstone\n- One *jin* of mercury\n- Four *liang* of sulfur\n\n**Method:**\nFirst, melt the sulfur, then add the mercury and stir-fry until sandy. Cease firing.\nUse either a Xiangyin jar, a Jiading jar from Western Shu, or an old wine jar of unglazed pottery. Seal with sweet clay to a thickness of three *cun* and dry in the shade. Place the mixture inside.\nTake an iron lamp dish and set it over the jar’s mouth, ensuring the water within never dries. Seal the rim with sweet clay, leaving one vent hole. Thread an iron wire through the lamp dish and jar handles, then place in the furnace.\nUse 120 *jin* of charcoal. Begin firing at dawn and cease the next dawn. Remove at midday, break the jar, and retrieve the product. To refine it into *Heart Red*, grind to a fine powder. For *Numinous Cinnabar*, further methods apply.\n\n#### **2. Heart Red (Xinhong)**\n**Ingredients:**\n- One *jin* of mercury\n- Four *liang* of sulfur\n\n**Method:**\nFirst, melt the sulfur, then add the mercury. Use either a Xiangyin jar, a Jiading jar from Western Shu, or an old wine jar of unglazed pottery. Seal with sweet clay to a thickness of three *cun* and dry in the shade. Place the mixture inside.\nSet an iron lamp dish over the jar’s mouth, ensuring the water within never dries. Seal the rim with sweet clay, leaving one vent hole. Thread an iron wire through the lamp dish and jar handles, then place in the furnace.\nUse 120 *jin* of charcoal. Begin firing at dawn and cease the next dawn. Remove at midday, allow to cool, then break the jar. Discard the kernels, grind to a fine powder, and mix with five buckets of water in a vat or basin. Grind again.\nAt the *you* hour, let the mixture settle in the vat. The top layer is *Board Red*, the middle *Secondary Red*, and the bottom *Heart Red*. Cut with a knife, dry in sunlight, wrap in silver paper, and further encase in paper.\n\n#### **3. Dead Mercury (Sigong)**\n**Ingredients:**\n- One *jin* of mercury\n- One *jin* of black tin\n- One *jin* of *shanze* (realgar or orpiment)\n\n**Method:**\nFashion two boxes: one from black tin, the other from *shanze*. First, place the mercury in the *shanze* box and seal it airtight.\nPlace the *shanze* box inside the tin box, then set both in an iron cauldron. Seal the cauldron’s mouth firmly with red halloysite and raw honey. Bind top and bottom with iron wire, then place in a quiet chamber within the elixir workshop.\nUse 250 *jin* of charcoal. Begin firing at the *xu* hour (7–9 PM) and cease at the *mao* hour (5–7 AM) the next day. Open the cauldron to find neither black tin nor mercury remaining. The two *jin* of *shanze* may be used freely—this is a secret transmission.\n\n#### **4. Whitening (Dianbai)**\n**Ingredients (each processed separately):**\n- Four *liang* of roasted cinnabar\n- Four *liang* of chalcanthite\n- Four *liang* of realgar\n- Four *liang* of orpiment\n- Four *liang* of nitre\n- Four *liang* of calcined alum\n- Four *liang* of *shanze*\n- Four *liang* of green salt\n\n**Method:**\nGrind all into fine powders and store in a sealed container. Mix one *sheng* of the powders with camphorwood root, salt, wine, and vinegar.\nTake a crucible and place four *liang* of Yunnan copper inside. Heat in the furnace with a bellows, covering with a tile until molten. Add two *qian* of *xiusha* (purified cinnabar) and stir evenly. Then add two *liang* of the prepared medicine and one *liang* of *shanze*. Stir thoroughly, cease firing, and pour into a smooth pool to cool. The result is a supreme treasure, malleable for any use.\n\n#### **5. Hair Removal (Bamao)**\n**Ingredients (each processed separately):**\n- One *liang* of *shanze*\n- One *liang* of white alum\n- One *liang* of roasted cinnabar\n- One *liang* of mercury\n- One *liang* of white iron\n- One *liang* of chalcanthite\n- One *liang* of nitre\n\n**Method:**\nGrind all into fine powders. Take a crucible and place half a *jin* of copper inside. Refine three times until it turns peach-blossom red.\nIn another crucible, place two *liang* of copper. Heat in the furnace with charcoal and a bellows, covering with a tile. Add five *qian* of *shanze* and half a *qian* of *xiusha*, then mix in two and a half *qian* of the prepared medicine. Cease firing, pour into a smooth pool, and repeat the process three times. Return to the crucible to melt into a supreme treasure, usable for fine softness or crafting vessels—this is a secret formula.\n\n#### **6. Shrinking (Suohe)**\n**Method:**\nCast ten *jin* of white tin into plaques, each one *cun* wide and three *cun* long, with a hole at the top. Thread an iron rod through the plaques and suspend them in a pool without touching the bottom.\nAfter twenty-one days (three seven-day cycles), remove the plaques and melt them in an iron pot. Recast into plaques.\nAfter eighty-one days, remove, melt, and recast.\nAfter one hundred fifty days, remove, melt, and recast.\nAfter three hundred days, remove, melt, and recast.\nAfter six hundred days, the fire-taming is complete. Further hammering refines the metal into vessels.\nFor fine softness, extend to twelve hundred days to achieve a supreme treasure that remains unchanged for a thousand years—this is a secret transmission.\n\n#### **7. Constructing the Pool (Zuochi)**\n**Method:**\nDig a pool two *zhang* square and seven *chi* deep. Line with bricks, sealing the seams with hemp and lime mortar. Cover the pool with a latrine, filling it with five *chi* of human waste. Exercise utmost care during construction.\nOffer paper money and horses as sacrifices, ensuring no one learns of the work. Revealing this celestial mechanism to the unworthy is forbidden.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1274,
      "start_sentence": 0,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.01966714859009,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\神仙养生秘术.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "其八泼铜绿 用铜十斤铸板，用铜锅一口，淳醋一檐，袖砂一斤，与醋相和，用火烧煎，火常不离，用药醋浇板。 到二时辰住，刮去绿再浇。 如板白剩三分，不用。 将澄绿就便培乾，任意使用也。 其九作线头 用黄牛膝骨一个，旋成珠子，如豌豆大，钻眼子，用银箔百十余个，金脚信一钱，用处磁内煞研细，口含胶水，旋旋的吐在碗内，研一遍，用清水淘一遍，七遍为度。 用线一条，一头结猾拙，一个穿珠子，用新笔一管，涂箔在珠子上。 又用冷绵花按定，如有毫光者为度。 如淡再度入口，不退色为度。 任从使用，非人勿示，不问大小，随意做造，此是秘衍。 聚八仙点阿 其一",
      "translated_text": "#### **8. Producing Verdigris (Poliutonglü)**\n**Method:**\nCast ten *jin* of copper into plates. Prepare an iron pot, one *tan* of pure vinegar, and one *jin* of *xiushā* (sal ammoniac). Mix the *xiushā* with the vinegar, then heat and simmer over a constant flame. Continuously pour the medicated vinegar over the plates. After two *shichen* (four hours), cease and scrape off the verdigris before pouring again. If the plate thins to three-tenths of its original thickness, discard it. Settle the verdigris, dry it thoroughly, and use as desired.\n\n#### **9. Crafting Thread Tips (Zuoxiantou)**\n**Method:**\nTake one kneecap bone from a yellow ox and carve it into beads the size of peas. Drill holes through them. Prepare over one hundred sheets of silver foil and one *qian* of *jinjiaoxin* (gold-based alum). Grind these finely in a mortar, then hold glue water in the mouth and gradually spit it into a bowl. Grind the mixture once, then rinse with clear water—repeat this process seven times. Take a thread, tie a knot at one end, and thread a bead onto it. Use a new brush to apply the foil onto the bead, then press it firmly with cold cotton. If a radiant sheen appears, the process is complete. If the color is too pale, repeat the application. The bead must not fade when tested. Use as desired. This is a secret transmission—do not reveal it to the unworthy. Regardless of size, craft as needed.\n\n#### **Assembling the Eight Immortals to Point Āh (Juba Xian Dian A)**\n**Part One**",
      "overlap_context": "emains unchanged for a thousand years—this is a secret transmission.\n\n#### **7. Constructing the Pool (Zuochi)**\n**Method:**\nDig a pool two *zhang* square and seven *chi* deep. Line with bricks, sealing the seams with hemp and lime mortar. Cover the pool with a latrine, filling it with five *chi* of human waste. Exercise utmost care during construction.\nOffer paper money and horses as sacrifices, ensuring no one learns of the work. Revealing this celestial mechanism to the unworthy is forbidden.",
      "start_char": 1275,
      "end_char": 1547,
      "start_sentence": 44,
      "end_sentence": 56,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.925564765930176,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\神仙养生秘术.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "桑花　槐花　栀子花　皂角花　白鹤花　蜜蒙花　款冬花　地棠花 右八味各二两，研为细末，用蜜一斤，於铜锅内化开，隔年葱白不拘多少，点蜜滴水不散，下药一两，姜黄半钱，住火搅匀，坐水盆内定，任意使用。 其二 松花　地丁花　皂角花　蜜蒙花　桃花　黄茨梅花　黄菊花　杳花各一两 右为细末，用蜜一斤，於铜锅内化开，用隔年葱白五七根，用手搅蜜，滴水不散，下药一两，姜黄半钱，住火搅匀，坐水盆内定，任意用之。 其三 金刚花　兔丝花　芙蓉花　夜合花　曼陀罗花　白芍药花　木刻花　白樟柳根花各一两 右为细末，用蜜一斤，铜锅内化开。 用隔年葱搅蜜死，滴水不散，住火搅匀，下药一两，再搅匀，下姜黄末一钱，坐水盆内定。 其四 松花　曼陀罗花　苍耳花　桑花　蜜蒙花　牡丹花　银杏花　春花　杏花各一两右为细末，蜜一斤，铜锅内化开，用隔年葱白汁点蜜死，滴水不散，下药一两，姜黄末一钱，住火搅匀，水盆内坐。 其五 金盏花　望江南花　摘金盏花　白葵花　皂角花　桑花　栀子花各一两 右为细末，蜜一斤，铜锅内化开，用隔年葱汁点蜜死，滴水不散，下药一两，姜黄一钱，住火搅匀，入水盆坐。 其六 黄菊花　曼陀罗花　苍耳花　望江南花　白鹤花　松花　皂角花　桑花　苦参花　黄羌花　天仙子花　白牵牛花　甘菊花　蜜蒙花　款冬花　黄茨梅花　栀子花　珍珠花　地棠花　牡丹花　春花　白芍药花　金灵子花各一两，晒乾 右为细末，用蜜五斤，铜锅内镕开，用隔年葱五斤，取汁入蜡，内前药一斤半，搅成一块，丸如弹子大，重二钱半。 蜜一斤，铜姚子内化开，下药一九，药化尽去了甜味，滴水不散，坐入水盆内，如色淡加姜黄末一钱。 其七 青蒙花　皂角花　银杳花　桑花　狗儿花　腊梅花　西瓜花 右七味各一两，蜜一斤铜锅内化开，用隔年葱白，搅蜜死，滴水不散，下药一两，姜黄末一钱，住火，搅匀坐 用。 其八",
      "translated_text": "**Part Two**\n\n**Mulberry blossoms, pagoda tree blossoms, gardenia blossoms, gleditsia blossoms, white crane blossoms, honey suckle blossoms, coltsfoot blossoms, and crabapple blossoms**—take two *liang* of each, grind into fine powder, and mix with one *jin* of honey melted in a copper pot. Add an unspecified quantity of aged scallion whites; when a drop of honey no longer disperses in water, incorporate one *liang* of the powdered herbs and half a *qian* of turmeric. Remove from heat, stir thoroughly, and set in a basin of water. Use as desired.\n\n**Part Three**\n\n**Pine pollen, corydalis blossoms, gleditsia blossoms, honey suckle blossoms, peach blossoms, yellow plum blossoms, yellow chrysanthemum blossoms, and apricot blossoms**—take one *liang* of each, grind into fine powder, and mix with one *jin* of honey melted in a copper pot. Add five to seven aged scallion whites, stir the honey until a drop no longer disperses in water, then incorporate one *liang* of the powdered herbs and half a *qian* of turmeric. Remove from heat, stir thoroughly, and set in a basin of water. Use as desired.\n\n**Part Four**\n\n**Vajra blossoms, dodder blossoms, hibiscus blossoms, silk tree blossoms, datura blossoms, white peony blossoms, rose of Sharon blossoms, and white willow blossoms**—take one *liang* of each, grind into fine powder, and mix with one *jin* of honey melted in a copper pot. Stir with aged scallions until the honey thickens, ensuring a drop does not disperse in water. Remove from heat, incorporate one *liang* of the powdered herbs, stir thoroughly, then add one *qian* of turmeric powder. Set in a basin of water.\n\n**Part Five**\n\n**Marigold blossoms, senna blossoms, golden cup blossoms, white mallow blossoms, gleditsia blossoms, mulberry blossoms, and gardenia blossoms**—take one *liang* of each, grind into fine powder, and mix with one *jin* of honey melted in a copper pot. Add aged scallion juice to thicken the honey until a drop does not disperse in water, then incorporate one *liang* of the powdered herbs and one *qian* of turmeric. Remove from heat, stir thoroughly, and set in a basin of water.\n\n**Part Six**\n\n**Yellow chrysanthemum blossoms, datura blossoms, cocklebur blossoms, senna blossoms, white crane blossoms, pine pollen, gleditsia blossoms, mulberry blossoms, sophora blossoms, yellow gentian blossoms, henbane blossoms, white morning glory blossoms, sweet chrysanthemum blossoms, honey suckle blossoms, coltsfoot blossoms, yellow plum blossoms, gardenia blossoms, pearl blossoms, crabapple blossoms, peony blossoms, spring blossoms, white peony blossoms, and golden bell blossoms**—take one *liang* of each, dry in the sun, and grind into fine powder. Melt five *jin* of honey in a copper pot, add five *jin* of aged scallions, extract the juice, and mix with one and a half *jin* of the powdered herbs. Form into pills the size of a bullet, each weighing two and a half *qian*. Melt one *jin* of honey in a copper ladle, dissolve one pill in it, and when the sweetness dissipates and a drop no longer disperses in water, set in a basin of water. If the color is too pale, add one *qian* of turmeric powder.\n\n**Part Seven**\n\n**Indigo blossoms, gleditsia blossoms, silver apricot blossoms, mulberry blossoms, dog blossoms, wintersweet blossoms, and watermelon blossoms**—take one *liang* of each, and mix with one *jin* of honey melted in a copper pot. Stir with aged scallion whites until the honey thickens and a drop does not disperse in water. Incorporate one *liang* of the powdered herbs and one *qian* of turmeric powder. Remove from heat, stir thoroughly, and set for use.\n\n**Part Eight**",
      "overlap_context": "times. Take a thread, tie a knot at one end, and thread a bead onto it. Use a new brush to apply the foil onto the bead, then press it firmly with cold cotton. If a radiant sheen appears, the process is complete. If the color is too pale, repeat the application. The bead must not fade when tested. Use as desired. This is a secret transmission—do not reveal it to the unworthy. Regardless of size, craft as needed.\n\n#### **Assembling the Eight Immortals to Point Āh (Juba Xian Dian A)**\n**Part One**",
      "start_char": 1547,
      "end_char": 2346,
      "start_sentence": 57,
      "end_sentence": 79,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.041929721832275,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\神仙养生秘术.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "金钱玄胡　白玄胡　瓜篓根　甘草　桑黄卜固因各等分 右为细末，蜜一斤铜锅内化开，用隔年葱白搅匀蜜死，滴水不散，下药半两，姜黄半钱，住火搅匀，坐用。 歌日： 金钱玄胡瓜篓根，甘草桑黄卜固因。 百花一斤药半两，此法益利胜烧金。 其九圣蜡法 蒙豆粉十斤　栀子二斤　因粉鹅黄色蜡一斤 右置铜锅内化开，下粉一斤，松花一两，有松花下一斤，元松花下半斤，住火，搅匀乾，盆内坐用。 其十 寒水石五斤　姜黄四两，搅匀为末，二味和为一处 右为细末如粉，细蜡一斤，下药半斤，住火，搅匀乾盆，坐用。 其十一 白胶香十斤　用茄杆灰五斤 右淋水一桶，煮白胶香，共升黑息为度。 蜡一斤，铜锅化开，下药一斤，姜黄二钱，住火，搅匀乾，坐用。 其十二 陈葵子一斗，炒香熟去皮，研为细末，十斤。 姜黄末一两，一处搅匀。 蜡十斤。 铜锅内化开，二味和一处，住火，搅匀乾，盆坐。 其十三造白蜡法 乌柏油五斤 右铜锅内化开，住火，用绵滤过。 蜡十斤，铜锅化开，下入乌柏油一处，住火，搅匀，分作三块。 其十四造黄蜡法 松花四两　黄米粉二斤　栀子二两 右熬水同粉黄色晒乾，蜡一斤，铜锅内化开，共药一处搅匀，住火乾，盆坐用。 其十五 慕豆粉一斤　寒水石一斤　葵子末半斤　蛤粉一斤　姜黄末一两半 右五味研为细末如粉。 蜡五斤，铜锅内化开，共下药一处，住火搅匀乾，盆坐，分作三块，住香下共药一处，住火，搅匀乾，盆坐。 其十六 松花四两　白矾四两　寒水石四两　蛤粉四两 右为细末，蜡三斤，铜锅内化开，下共药一处，住火，搅匀乾，盆坐作二块。 其一秤轻粉诀 水银一斤　硫黄四两 先将硫黄於铁姚内镕开，次下水银於硫黄内，一处炒成砂与。 用蜜陀僧四两，焰硝二两，作铀子。 春夏三日，秋冬七日，将前件砂子於铀子一处搅匀，用铁大铁一个，摊砂子在上，用瓦盆一个盖铁，用蜜调赤石脂固济口缝，底下用木炭火文武烧之。 早晨下火，午时住火。 玲定揭起，药在盆上，扫下用木匣子盛之，四两一匮，任意使用。 盆底是粉霜，上面是轻粉，此是奥妙秘衍。 其二七宝温冻硫黄盏 用舶上硫黄一斤分四处，一个是四两　朱砂　心红　胆　轻粉　青黛　官粉　铜绿 右每味各一两，各自制度，研如粉。 盏一个，用药三钱，水盏内坐，用处州磁盏一个，用生绢手帕一个，中心留眼用茶托子一个，或酒满，上盖之。 日晚放上酒，来日早晨空心服，冬缓夏凉，治一切下元虚玲。 单硫黄盏。 治下元虚玲，同前七宝盏一般，用嗅硫黄一个，不问大小，同前盏一般置造用度。 其三擦揩白如银治铜法 胆矾　枯白矾　真烧银　水银　鹿角灰　确砂各五钱 先将白铁於锅内化开，次下水银，就热搅匀，研为末，次将银子化开，下袖砂朋砂，就热研为细末。 枯白矾、· 胆矾、庇角灰，研为细末，总药八味，一处再研如粉。 如要使用，先将皂角水洗铜器三遍，然后用叶揩之，用纸封裹，七日一遍，三遍为度，此是妙秘或定也。 非人勿示。 圣蜡烛法",
      "translated_text": "**Part Eight**\n\n**Golden coin corydalis, white corydalis, trichosanthes root, licorice, mulberry yellow, and *buguyin***—take equal parts of each. Grind into fine powder. Melt one *jin* of honey in a copper pot, stir with aged scallion whites until the honey thickens and a drop no longer disperses in water. Add half a *liang* of the powdered herbs and half a *qian* of turmeric powder. Remove from heat, stir thoroughly, and set for use.\n\n*Song:*\nGolden coin corydalis and trichosanthes root,\nLicorice, mulberry yellow, and *buguyin* blend.\nA *jin* of honey with half a *liang* of herbs—\nThis method’s benefit surpasses burning gold.\n\n**Part Nine: Sacred Wax Method**\nTen *jin* of mung bean starch, two *jin* of gardenia. For yellow wax, use one *jin*. Place in a copper pot to melt, then add one *jin* of starch and one *liang* of pine pollen. If using pine pollen, add one *jin*; if not, add half a *jin*. Remove from heat, stir until dry, and set in a basin for use.\n\n**Part Ten**\nFive *jin* of calcite, four *liang* of turmeric—stir evenly and grind into powder. Combine the two ingredients. Grind into fine powder like flour. Melt one *jin* of refined wax, add half a *jin* of the powdered herbs. Remove from heat, stir until dry, and set in a basin for use.\n\n**Part Eleven**\nTen *jin* of *bai jiaoxiang*. Use five *jin* of eggplant stalk ash. Leach with a bucket of water, then boil the *bai jiaoxiang* until it turns into black soot. Melt one *jin* of wax in a copper pot, add one *jin* of the soot and two *qian* of turmeric. Remove from heat, stir until dry, and set for use.\n\n**Part Twelve**\nOne *dou* of aged mallow seeds—roast until fragrant, remove the skins, and grind into fine powder (ten *jin*). Add one *liang* of turmeric powder and mix evenly. Melt ten *jin* of wax in a copper pot, combine with the two ingredients. Remove from heat, stir until dry, and set in a basin.\n\n**Part Thirteen: White Wax Method**\nFive *jin* of *wutong* oil. Melt in a copper pot, remove from heat, and filter through silk. Melt ten *jin* of wax in a copper pot, add the *wutong* oil, and stir evenly. Remove from heat, divide into three blocks.\n\n**Part Fourteen: Yellow Wax Method**\nFour *liang* of pine pollen, two *jin* of millet flour, two *liang* of gardenia. Boil in water until the mixture turns yellow, then dry in the sun. Melt one *jin* of wax in a copper pot, combine with the ingredients, and stir evenly. Remove from heat, dry, and set in a basin for use.\n\n**Part Fifteen**\nOne *jin* of mung bean starch, one *jin* of calcite, half a *jin* of mallow seed powder, one *jin* of clam powder, and one and a half *qian* of turmeric powder. Grind the five ingredients into fine powder like flour. Melt five *jin* of wax in a copper pot, combine with the powdered herbs, and stir evenly. Remove from heat, dry, and set in a basin. Divide into three blocks.\n\n**Part Sixteen**\nFour *liang* each of pine pollen, alum, calcite, and clam powder. Grind into fine powder. Melt three *jin* of wax in a copper pot, combine with the powdered herbs, and stir evenly. Remove from heat, dry, and set in a basin. Divide into two blocks.\n\n**Seventeen: Light Powder Formula**\nOne *jin* of mercury, four *liang* of sulfur. First melt the sulfur in an iron ladle, then add the mercury and stir together until it forms sand. Use four *liang* of litharge and two *liang* of saltpeter to make a crucible. In spring and summer, wait three days; in autumn and winter, seven days. Mix the sand with the crucible ingredients, then spread the mixture on a large iron plate. Cover with a clay basin, seal the edges with honey-mixed red halloysite, and heat with charcoal fire (moderate intensity). Start the fire in the morning and stop at noon. Once cooled, open the basin—the medicine will be on the inner surface. Scrape it off and store in a wooden box, four *liang* per container, for use as desired. The residue at the bottom is *frost powder*, and the upper layer is *light powder*—this is a profound and secret method.\n\n**Eighteen: Seven-Treasure Warm Sulfur Cup**\nDivide one *jin* of imported sulfur into four portions (one portion is four *liang*). Use one *liang* each of cinnabar, *xin hong*, gall, light powder, indigo, lead powder, and verdigris. Process each ingredient separately and grind into fine powder. For one cup, use three *qian* of the mixture. Place the cup in a water basin, then set it inside a porcelain cup from Chuzhou. Cover with a silk handkerchief (leaving a small opening in the center) and a tea tray, or fill with wine. Leave the wine in the cup overnight, and consume it the next morning on an empty stomach. It warms in winter and cools in summer, treating all cases of lower *qi* deficiency and cold.\n\n**Single Sulfur Cup**\nTreats lower *qi* deficiency and cold, similar to the Seven-Treasure Cup. Use one lump of sulfur (size does not matter) and prepare it in the same manner as the cup above.\n\n**Nineteen: Rubbing Method to Turn Copper White as Silver**\nFive *qian* each of chalcanthite, dried alum, genuine silver filings, mercury, deer antler ash, and *quesha*. First melt white iron in a pot, then add mercury while hot and stir evenly. Grind into powder. Next, melt the silver, add *quesha* and *pengsha*, and grind into fine powder while hot. Grind the dried alum, chalcanthite, and deer antler ash into fine powder. Combine all eight ingredients and grind again into a fine powder. To use, first wash the copper vessel three times with gleditsia water, then rub it with leaves. Seal with paper for seven days per application, repeating three times for best results—this is a wondrous and secret method. Do not reveal to others.\n\n**Sacred Wax Candle Method**",
      "overlap_context": "eric powder.\n\n**Part Seven**\n\n**Indigo blossoms, gleditsia blossoms, silver apricot blossoms, mulberry blossoms, dog blossoms, wintersweet blossoms, and watermelon blossoms**—take one *liang* of each, and mix with one *jin* of honey melted in a copper pot. Stir with aged scallion whites until the honey thickens and a drop does not disperse in water. Incorporate one *liang* of the powdered herbs and one *qian* of turmeric powder. Remove from heat, stir thoroughly, and set for use.\n\n**Part Eight**",
      "start_char": 2346,
      "end_char": 3595,
      "start_sentence": 80,
      "end_sentence": 135,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.645861625671387,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\神仙养生秘术.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "白胶香四两　硫黄四两　槐角子四两 八月收，先将槐角子捣斓，将白胶香、硫黄一同镕开，用竹筒长七寸，将药灌之，一条可燃一月，神妙。 省油方 浮萍草六月收　瓦松六月收　远志　黄丹　蛤粉各一两 右为细末，每油一两，用药一钱，可点一月。 圣蜡烛法 槐角子二斤，八月收　白胶香一斤　硫黄四两 先将槐角子捣斓，用沙锅化开白胶香，次入槐角一处熬烂。 次下硫黄一处，用槐条搅匀，用竹筒长七寸，赢如大指，灌入筒内，阴乾，去其筒子不用，每一条可点六十日，妙。 治墨法 松烟十两　阿胶四两　蕾香　甘松　姜汁　堵牙皂角 四味用水熬少时，去滓沾清，十两中化阿胶四两胶用，金箔三个，银箔二个，和烟一处搅匀，用杵捣一万下，取出过成锭子。 次入灰池内，春五日，夏三日，秋七日，冬十日，取出任意用。 死蜜法 先用白沙蜜一斤，用元油铁锅一个，次下蜜在姚内，隔年葱十根搅。 葱熟取出，再将新葱十根搅匀，文武火暖之。 次用水一碗，将蜜滴水中不散，不沾牙，不沾手，此即成宝，脱胎换骨也。 悟修合秘之后，同细药取，颜色如黄金。 马皮包去皮取裹面白的好，一两半　桑花　皂角花　槐花　白天门冬　葱花　兔丝子腊梅花　蜜蒙花　甘菊花各一两半 右为细末，和匀一处，每一斤蜜，用药一两半，搅匀取出，倾在玲水成块，此即是死蜜秘法，任意用之仙方。 百花膏 蜜蒙甘草瓜篓根，玄胡桑黄白友停。 百花一斤药二两，胜如烧金共烧银。 右为细末，用为一处，铜跳内化开百花，将前药倒在一处，搅匀，用生绢滤入水中，搏成块，任意用。 妙灵丹 食桥叶百草，常饱不饥，避难绝食。 杜仲一斤，去厅皮，醋浸一宿，焙乾，炒捣罗为细末　荆芥穗一斤，捣罗为细未　白狭苓一斤，去皮　甘草一斤，去皮　薄苛半斤 右为细末，炼蜜为九，小指大，将桥叶水洗净，和药同入口内，细嚼食为妙。 知命丹避难绝食济饥 木香　白狭苓　赤石脂　乳香　水银 黑锡与水银同结子，砂器另研细。 朱砂　雄黄　蜜陀僧　已上各一钱　黄蜡六钱　松脂三钱 右九味都为细末，将松脂黄蜡镕开为九，可重一钱，如服药时，饱吃糯米粥一顿，后用乳香汤下一丸，至五七日，又服一九。 服至二九尽，用枣七个，初一日都服七枚，每日或尽枣，永不饥已发，渴饮水。 吮水法 啼霹雳火公奉劝摄。 存太阳，取黑一口，吹在水中，饮水时呢之。 绝食后心清意净，内想不出，外想不入。 昔日有传方太医严仲山，自癸巳年七月初三日，逃避唐州危难，元食至死，睑矣。 服药全家绝食四十九日，得保身安康，复旧如初。 仙酒方 糯米用111 升亦可用度　好铀四两　大麦蘗一两半　酵子二两 右为细末，用水五升煮粥取出。 次入药一处搅匀，复明酒香，其效如神，不误修合。 乾酒方 肉桂一两　黑附子一两　好蜜一两　川椒一两　生姜二两　杳仁二两，去皮如泥　神铀一斤 右为细末，用粟米二升淘净蒸熟，将药末和饭一处搅匀，入瓶罐内，三宿 取出，捣烂丸如鸡头大，入瓶内盛了，用纸封口，勿令透风。 至七日取出，见风时一个时辰，再入瓶内，依前封，不计年分。 若要吃酒时，将熟水五升，药一九，放在水内，湿纸封口，不多时闻酒香，盖用献圣饮。",
      "translated_text": "**Sacred Wax Candle Method**\nFour *liang* each of *baijiaoxiang* (resin), sulfur, and sophora fruit (collected in the eighth month). First, pound the sophora fruit into a paste. Melt the *baijiaoxiang* and sulfur together, then pour the mixture into a bamboo tube seven *cun* in length. One candle will burn for a full month—divinely wondrous.\n\n**Oil-Saving Formula**\nCollect duckweed in the sixth month, and *wasong* (houseleek) in the sixth month. One *liang* each of *yuanzhi* (polygala root), *huangdan* (lead oxide), and clam powder. Grind all into a fine powder. For every *liang* of oil, use one *qian* of the powder—it will last a month.\n\n**Sacred Wax Candle Method (Alternate)**\nTwo *jin* of sophora fruit (collected in the eighth month), one *jin* of *baijiaoxiang*, and four *liang* of sulfur. First, pound the sophora fruit into a paste. Melt the *baijiaoxiang* in a sand pot, then add the sophora fruit and simmer until thick. Next, add the sulfur and stir evenly with a sophora twig. Pour into a bamboo tube seven *cun* long and as thick as a thumb. Dry in the shade, then remove the tube. Each candle will burn for sixty days—marvelous.\n\n**Ink-Making Method**\nTen *liang* of pine soot, four *liang* of *ejiao* (ass hide glue). Simmer *leihua* (thunderbolt flower), *gansong* (spikenard), ginger juice, and gleditsia (for tooth-cleaning) briefly in water, then strain. Dissolve four *liang* of *ejiao* in the liquid. Add three gold foils and two silver foils, then mix with the pine soot. Pound with a pestle ten thousand times, then mold into ink sticks. Place in an ash pit: five days in spring, three in summer, seven in autumn, and ten in winter. Remove when ready for use.\n\n**Dead Honey Method**\nTake one *jin* of white rock honey and an iron pot with original oil residue. Place the honey in the pot, then stir with ten stalks of aged scallions until cooked. Remove the scallions, add ten fresh stalks, and stir evenly over gentle heat. Test by dripping into water—if it holds shape, does not stick to teeth or hands, it is perfected, a treasure for transforming body and bone. After refining, blend with fine medicinal powders to achieve a golden hue. Use the inner white layer of horsehide (one and a half *liang*), mulberry flowers, gleditsia flowers, sophora flowers, *baimendong* (asparagus root), scallion flowers, *tusizi* (dodder seeds), winter-sweet flowers, *mimeng* (buddleia flowers), and chrysanthemum flowers (one and a half *liang* each). Grind into a fine powder and mix evenly. For every *jin* of honey, use one and a half *liang* of the powder. Stir well, then pour into cold water to form blocks. This is the secret method for dead honey—a divine formula for any use.\n\n**Hundred-Flower Paste**\n*Mimeng* (buddleia), licorice, trichosanthes root, *xuanhu* (corydalis), mulberry yellow, and white lime (in equal parts). For one *jin* of flowers, use two *liang* of the powder—superior to burning gold or silver. Grind all into a fine powder and mix. Melt the flowers in a copper pan, then add the powder and stir evenly. Strain through raw silk into water, then shape into blocks for use.\n\n**Wondrous Spirit Elixir**\nEat the leaves of the *qiao* tree to remain full and hunger-free, evading hardship and fasting. One *jin* of *duzhong* (eucommia bark), remove the coarse skin, soak in vinegar overnight, dry, stir-fry, and grind into fine powder. One *jin* of *jingjiesui* (schizonepeta spikes), grind into fine powder. One *jin* of *baifuling* (white poria), remove the skin. One *jin* of licorice, remove the skin. Half a *jin* of mint. Grind all into fine powder, then form into pills with refined honey, each the size of a little finger. Wash *qiao* leaves clean, chew with the pills for best effect.\n\n**Life-Preserving Elixir for Fasting and Evading Hardship**\n*Muxiang* (costus root), *baifuling* (white poria), *chishizhi* (halloysite), frankincense, mercury. Combine black tin with mercury to form pellets, then grind finely in a ceramic vessel. One *qian* each of cinnabar, realgar, and *mituoseng* (litharge). Six *qian* of yellow wax, three *qian* of pine resin. Grind all nine ingredients into fine powder, then melt the pine resin and yellow wax to form pills, each weighing one *qian*. When taking the elixir, first eat a full meal of glutinous rice porridge, then swallow one pill with frankincense tea. After five to seven days, take another pill. After two doses, eat seven jujubes on the first day, then consume them daily until finished—hunger will vanish, and thirst may be quenched with water.\n\n**Water-Sipping Method**\nThe Thunderbolt Fire Lord advises: Focus on the sun, draw in black qi, and blow it into water before drinking. After fasting, the mind becomes clear and thoughts still—no distractions enter or leave. Once, the imperial physician Yan Zhongshan, fleeing danger in Tangzhou on the third day of the seventh month in the *guisi* year, survived without food until death seemed certain. After taking the elixir, his entire family fasted for forty-nine days, yet remained safe and restored to health.\n\n**Immortal Wine Formula**\nUse one *sheng* and eleven *ge* of glutinous rice (or other suitable grain), four *liang* of fine yeast, one and a half *liang* of malted barley, and two *liang* of leaven. Grind into fine powder, then cook five *sheng* of water into porridge. Add the powdered ingredients, stir evenly, and let the wine ferment—its fragrance will be divine, and the method infallible.\n\n**Dry Wine Formula**\nOne *liang* each of cinnamon and black aconite, one *liang* of fine honey, one *liang* of Sichuan pepper, two *liang* of fresh ginger, two *liang* of apricot kernels (peeled and mashed), and one *jin* of divine yeast. Grind into fine powder. Wash two *sheng* of millet, steam until cooked, then mix with the powdered medicine. Place in a jar for three nights, then pound into pills the size of chicken heads. Store in a jar, seal with paper to prevent air exposure. After seven days, expose to wind for one *shichen* (two hours), then return to the jar and reseal. This wine may be stored indefinitely. To drink, steep one pill in five *sheng* of hot water, seal with damp paper, and soon the fragrance of wine will arise—fit for offering to the gods.",
      "overlap_context": ", melt the silver, add *quesha* and *pengsha*, and grind into fine powder while hot. Grind the dried alum, chalcanthite, and deer antler ash into fine powder. Combine all eight ingredients and grind again into a fine powder. To use, first wash the copper vessel three times with gleditsia water, then rub it with leaves. Seal with paper for seven days per application, repeating three times for best results—this is a wondrous and secret method. Do not reveal to others.\n\n**Sacred Wax Candle Method**",
      "start_char": 3595,
      "end_char": 4922,
      "start_sentence": 136,
      "end_sentence": 185,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.54795837402344,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\神仙养生秘术.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "神仙饵生地黄延年法 生地黄不以多少，肥者阴乾为细末，炼蜜为丸，如梧桐子大。 每服如汤酒下，三十九日，进三服，百日颜如桃花，至三年令人长生矣。 神仙饵羡华方 羡华一石，常以七八月熟收之，采来曝乾，先入臼春去刺，然后为细末。 每服二匙，新水调下，日进三服，勿令断绝，服之长生。 服一年后，冬不寒，夏不热。 服之二年，老返少，头白再黑，齿落重生。 服至三年，身轻延年。 绝根方 黑豆四升，妙去皮。 火麻子四升，煮捣为末。 每服一合，水调下，日进三服。 十日可断谷，冬夏不令寒热也。 神仙服槐子延年不老方 常以十月上巳日，取在新甍器内盛之，以盆合其上，密泥勿令走气，三七日开取去皮，从月初日服一粒，以水下。 日加一粒，直至月半，却臧一粒为度，终而复始。 令人可依夜看书，久服此，气力百倍。 辟谷住食方凡欲住食必先住心 秣米一斗，小油六两炒玲　盐末　川姜　小椒各等分十两　蔓菁子三升　乾大枣五升 右六味为细末，每服一大匙，新水调下，日进三服。 如饥渴渐有力，如吃诸般果木茶汤自意，不可食肉，大忌也。 走死的马，饮杀的驴，胀死的牛，红眼的羊，自死的猪，有弹的鳖，怀胎的兔，无鳞的鱼。 自古有书云，皆不可食之。 若食之者，生百疾也。",
      "translated_text": "**Daoist Immortal’s Method for Consuming Fresh Rehmannia to Prolong Life**\nTake an unspecified quantity of fresh rehmannia, selecting plump roots. Dry in the shade, grind into fine powder, and blend with refined honey to form pills the size of *wutong* seeds. Take thirty pills each time, washed down with hot water or wine. After thirty-nine days of taking three doses daily, the complexion will bloom like peach blossoms. After three years, one attains longevity.\n\n**Daoist Immortal’s Method for Consuming *Xianhua* for Longevity**\nGather one *dan* of *xianhua* when ripe in the seventh or eighth month. Dry in the sun, then pound in a mortar to remove thorns before grinding into fine powder. Take two spoonfuls each time, mixed with fresh water, three times daily without interruption. This grants immortality.\nAfter one year of consumption, one will no longer feel cold in winter or heat in summer.\nAfter two years, the old revert to youth, white hair turns black again, and fallen teeth regrow.\nAfter three years, the body becomes light, and life is prolonged.\n\n**Grain-Abstention Formula**\nStir-fry four *sheng* of black soybeans to remove their skins. Boil four *sheng* of hemp seeds, then pound into powder. Take one *ge* each time, mixed with water, three times daily. After ten days, one may cease eating grains, and neither cold nor heat will affect the body in winter or summer.\n\n**Daoist Immortal’s Method for Consuming Sophora Seeds to Prolong Life and Prevent Aging**\nOn the *shangsi* day of the tenth month, gather sophora seeds and store them in a new earthenware vessel. Cover with a basin, seal tightly with mud to prevent qi from escaping, and open after twenty-one days. Remove the skins, then begin consumption on the first day of the lunar month with one seed, taken with water. Increase by one seed each day until the fifteenth, then decrease by one seed daily. Repeat this cycle without end. This enables one to read by night and, with prolonged use, multiplies strength a hundredfold.\n\n**Grain-Abstention and Fasting Formula (First Calm the Mind)**\nStir-fry one *dou* of glutinous millet with six *liang* of sesame oil until cool. Add equal parts—ten *liang* each—of salt, Sichuan ginger, and Sichuan pepper, along with three *sheng* of turnip seeds and five *sheng* of dried jujubes. Grind all into fine powder. Take one large spoonful each time, mixed with fresh water, three times daily. As hunger and thirst subside, strength will gradually return. One may freely consume fruits, nuts, teas, and broths as desired, but meat is strictly forbidden. Avoid:\n- Horses that died from exhaustion,\n- Donkeys killed by drowning,\n- Cattle that died from bloating,\n- Sheep with red eyes,\n- Pigs that died of illness,\n- Soft-shelled turtles with pellets,\n- Pregnant hares,\n- Fish without scales.\nAs the ancient texts warn, consuming these will invite a hundred ailments.",
      "overlap_context": "*sheng* of millet, steam until cooked, then mix with the powdered medicine. Place in a jar for three nights, then pound into pills the size of chicken heads. Store in a jar, seal with paper to prevent air exposure. After seven days, expose to wind for one *shichen* (two hours), then return to the jar and reseal. This wine may be stored indefinitely. To drink, steep one pill in five *sheng* of hot water, seal with damp paper, and soon the fragrance of wine will arise—fit for offering to the gods.",
      "start_char": 4923,
      "end_char": 5443,
      "start_sentence": 186,
      "end_sentence": 210,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.539641857147217,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\神仙养生秘术.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "辟谷方 永宁二年二月十七日黄门侍郎刘景先表言，臣遇太白山隐士，得此方。 臣闻京师米根大贵，宜以此济之，令人不饥，耳目聪明，颜色光泽。 如有诳妄，臣一家甘受刑戮。 四季用黑豆五升，诤洗后蒸三遍，晒乾去皮，又用大火麻子三升，汤浸一宿，洒出晒乾，胶水拌晒，去皮淘净，蒸三遍，确捣。 次下豆黄，共为细末，用糯米粥，合和成圆，如拳大。 入饭蒸，从夜至子，住火，至寅取出，於磁器内盛盖，不令风乾。 每服三块，但饱为度，不得食一切物。 第一顿七日不饥，第二顿七七日不饥，第三顿三百日不饥，容貌佳胜，更不憔悴。 渴即研火麻子浆饮，更滋润脏腑。 若要重吃物，用葵子三合杵碎，煎汤饮，开导胃院，以待冲和无损。 此方勒石汉阳军别山太平兴国寺。 神仙养生秘术竟",
      "translated_text": "**Grain-Avoidance Formula**\n\nPresented on the seventeenth day of the second month of the second year of Yongning, by the Gentleman-in-Attendance at the Yellow Gate, Liu Jingxian:\n\n*\"I encountered a recluse of Mount Taibai, from whom I obtained this formula. Hearing that grain prices in the capital have soared, I submit this to provide relief, for it allows one to go without hunger, sharpens the senses, and imparts a radiant complexion. Should this prove false, my entire household willingly accepts execution.\"*\n\n**Ingredients and Preparation:**\nFor all seasons, take five *sheng* of black soybeans. Wash thoroughly, steam three times, sun-dry, and remove the skins. Additionally, take three *sheng* of hemp seeds. Soak overnight in hot water, drain, sun-dry, then coat with sticky water, dry again, remove the skins, wash clean, and steam three times. Pound firmly.\n\nNext, combine with the soybean powder and grind into a fine flour. Mix with glutinous rice porridge to form balls the size of a fist. Place in a steamer with rice, cook from nightfall until midnight, then cease heating. Remove at dawn and store in a ceramic vessel, sealed to prevent drying from wind.\n\n**Dosage:**\nConsume three balls at a time, until sated. Refrain from all other food.\n- After the first dose: seven days without hunger.\n- After the second dose: forty-nine days without hunger.\n- After the third dose: three hundred days without hunger.\nOne’s appearance will grow more refined, never wan or haggard.\n\nFor thirst, grind hemp seeds into a pulp and drink. This further nourishes the viscera.\n\nShould one wish to resume eating, crush three *ge* of mallow seeds, decoct in water, and drink to open and guide the stomach, awaiting the return of harmonious qi without harm.\n\nThis formula was engraved in stone at Taiping Xingguo Temple in Bieshan, Hanyang Prefecture.\n\n**Here ends the secret Daoist art of nourishing life.**",
      "overlap_context": "sh water, three times daily. As hunger and thirst subside, strength will gradually return. One may freely consume fruits, nuts, teas, and broths as desired, but meat is strictly forbidden. Avoid:\n- Horses that died from exhaustion,\n- Donkeys killed by drowning,\n- Cattle that died from bloating,\n- Sheep with red eyes,\n- Pigs that died of illness,\n- Soft-shelled turtles with pellets,\n- Pregnant hares,\n- Fish without scales.\nAs the ancient texts warn, consuming these will invite a hundred ailments.",
      "start_char": 5444,
      "end_char": 5762,
      "start_sentence": 211,
      "end_sentence": 223,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.115866899490356,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\神仙养生秘术.txt",
        "category": "众术类"
      }
    }
  ]
}