{
  "source_id": "神仙炼丹点铸三元宝照法",
  "source_file": "chunked_daozang\\神仙炼丹点铸三元宝照法.json",
  "total_chunks": 4,
  "total_original_chars": 3888,
  "total_translated_chars": 21187,
  "total_translation_time": 112.43001556396484,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\神仙炼丹点铸三元宝照法.txt",
    "category": "方法类"
  },
  "full_translation": "**The Divine Immortals’ Method for Refining the Elixir and Forging the Three Primordial Treasure Mirrors**\n\n*Scripture Title:* *The Divine Immortals’ Method for Refining the Elixir and Forging the Three Primordial Treasure Mirrors*\n*Composed by:* Guigengzi, a reclusive scholar of the late Tang dynasty\n*A method for official elixir-refining and mirror-forging. One fascicle.*\n*Source of the base text:* *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Methods* Category.\n\n---\n\n**Preface to *The Divine Immortals’ Method for Refining the Elixir and Forging the Three Primordial Treasure Mirrors***\n\nGuigengzi was the sobriquet of a scholar who met with no success in his time.\n\nIn my youth, I studied both literary and martial arts and was drawn to extraordinary techniques. Upon reaching the age of maturity, I passed through Liang and arrived in Zheng, wandering among the peaks of Song and Sha. Resting beneath a great tree, I encountered an old man of perhaps eighty years, his brows and eyes clear, his spirit serene and unhurried. I bowed and sat with him upon a stone, and after some time in conversation, he spoke much of emptiness and transcendence.\n\nHe said to me, “My dwelling is not far. You may come and visit.” I assented and followed him. There, I saw only ancient trees and towering bamboo, the gate and path quiet and secluded, the chamber empty of others.\n\nI then inquired about the Yellow Emperor’s ascension to heaven, his battle with Chiyou, his employment of Feng Hou, and the method of forging the *Iron Mirror*.\n\nThe old man replied, “Have you heard of the Divine Immortals’ method for refining the elixir and forging the *Three Primordial Treasure Mirrors*—those of Heaven, Earth, and Humanity?”\n\nI answered, “I have not.”\n\nThereupon, I knelt and bowed twice, entreating him to reveal these hidden arts and dispel my worldly delusions.\n\nHe said, “Observing your bones and qi, you are no ordinary man. You are fit to be taught.” Then, from his satchel, he produced a text written entirely in ancient seal script.\n\nHe said, “This is not a matter for your person alone, but for the Sage Emperor of Great Peace. If you encounter an age where virtue and simplicity are pure, aligned with the heart of Heaven and Earth, where the Four Seas are at peace and the people sing in harmony, then you may forge the mirrors according to this method.”\n\nI received his words with sincerity and bowed twice in gratitude.\n\nThe next morning, the old man said, “This is no place for you to linger. You should depart.” Three cycles of twelve years later, we met again.\n\nWhen I took my leave, I bowed twice by the Luo River, concealing the method close to my person, never daring to transmit it lightly to the unworthy.\n\nRecorded in the second month of spring, the second year of *Tianfu* in the Tang dynasty, by Guigengzi.\n\n---\n\n**Preface to *The Divine Immortals’ Method for Refining the Elixir and Forging the Three Primordial Treasure Mirrors***\n\nGuigengzi was the sobriquet of a scholar who met with no success in his time.\n\nIn my youth, I studied both literary and martial arts and was drawn to extraordinary techniques.\n\nUpon reaching the age of adulthood, I passed through Liang and arrived in Zheng, wandering among the peaks of Song and Shaoshi. Resting beneath a great tree, I encountered an old man of about eighty, his brows and eyes clear and uncluttered, his spirit serene and composed. We exchanged bows and sat upon a stone, and as we spoke for some time, much of his discourse concerned the emptiness of the world and the path beyond it.\n\nHe said to me, “My dwelling is not far from here. You may come and visit.” I assented and followed him. His home was surrounded by ancient trees and towering bamboo, its gate and path quiet and secluded, the chamber empty of others. There, I inquired about the Yellow Emperor’s ascent to heaven, his battle with Chiyou, his employment of the Wind Master, and the method of forging the Iron Mirror.\n\nThe old man said, “Have you heard of the Divine Immortals’ method for refining the elixir and forging the Three Primordial Treasure Mirrors of Heaven, Earth, and Humanity?”\n\nI replied, “I have not.”\n\nThereupon, I bowed deeply twice and entreated him, “I wish for you, Master, to reveal these hidden arts and dispel my worldly delusions.”\n\nHe said, “Observing your bone and qi, you are no ordinary man. You are worthy of instruction.” He then drew from his bag a text written in ancient seal script.\n\n“This,” he said, “is not a matter for your person alone, but for the Sage Emperor of a Great Peace. Only when virtue is pure and simple, aligning with the heart of Heaven and Earth, when the Four Seas are at peace and the people sing praises of the pivot of governance, may this method be forged.”\n\nI received his words with sincerity and bowed twice in gratitude.\n\nThe next morning, the old man said, “This is no place for you to linger. You should depart.” Three cycles of twelve years later, we met again.\n\nWhen I took my leave, I bowed twice by the Luo River, concealing the method close to my person, never daring to transmit it lightly to the unworthy.\n\n---\n\n**The Divine Immortals’ Method for Refining the Elixir and Forging the Three Primordial Treasure Mirrors**\n\n**Method for Forging the Heaven Mirror**\nThe *Divine Immortals’ Text* states: At the beginning of the Heavenly Cycle of *jiazi*, the first of the six sixes, when the yang fire is at its zenith, gather its true essence. Refine the qi of the Five Metals’ numinous elixir and forge the Heaven Mirror. It will command the awe of spirits and demons, severing the roots of malevolence. Place the furnace in the position of the *Xuanjian* (Mysterious Mirror). On the six *wu* days of the year’s旬, invoke the yang earth of *Juchen* (the Celestial Enclosure), fell the yang wood of the Six *Jia* Green Dragon, and ignite the yang fire of the Six *Bing* Vermilion Bird, burning it to smokeless embers. Employ the yang metal of the Six *Geng* White Tiger and the yang water of the Six *Ren* Dark Warrior.\n\nAfterward, construct a yang earth altar, three feet high, with three tiers—round above and square below—with steps extending from all four sides. On the altar, mold a furnace eight feet and one inch high, with eight doors at its base, each six inches and four *fen* wide. Atop the furnace, fashion an iron Heavenly Wheel, positioning the deities of the Six *Jia* and Six *Ding*, the Sun Lord and Moon Queen, and the Nine Luminaries’ True Lords. Ignite the fire, refining at its center, using the Fire Dragon’s elixir.\n\nThe Heaven Mirror should be three inches thick, weighing seventy-two pounds, with a face thirty-six inches wide. On its reverse, the inner design depicts the Purple Tenuity Star Lord’s abode, while the outer lists the Twenty-Eight Constellations. Once forged, if the Five Planets deviate from their courses, comets appear in the sky, or disasters of frost, hail, floods, or drought strike, open this mirror with reverent purity. Assist in manifesting power and virtue, and the calamities will naturally cease.\n\n**Method for Forging the Earth Mirror**\nThe Earth Mirror is also three inches thick, weighing seventy-two pounds, with a face thirty-six inches wide. On its reverse, cast the mountains, rivers, Five Peaks, Four Seas, Eight Trigrams, Nine Provinces, and Sixteen Spirits. When forging, do so at the full moon of the Great Yin. If earthquakes, landslides, or the collapse of mountains and rivers occur, if locusts devastate the harvest, or if waterways and bridges are blocked, open the Earth Mirror with solemn purity. Cultivate virtue and assist in manifesting power, and the disasters will naturally vanish.\n\n**Method for Forging the Human Mirror**\nThe Human Mirror is likewise three inches thick, weighing seventy-two pounds, with a face thirty-six inches wide. On its reverse, cast the revolving mechanism of the stars, the names of the sixty *jiazi* spirits, the Son of Heaven’s imperial title, the Lord of One’s Life Destiny, the Green Dragon to the left and White Tiger to the right, the state’s name, the celestial divisions of the stars, and the subordinate commanderies and counties. Forge it on a *bingwu* day at the hour of the sun’s zenith.\n\nOnce forged, if warfare does not cease or the people suffer from epidemics, open this mirror with purity and sincerity, offering prayers and sacrifices, and the disasters and pestilence will naturally subside. On the days of the two qi’s ascent and descent, gather the elderly of all ranks in the main hall. Open the Human Mirror before the hall’s eaves, displaying its awe-inspiring radiance, and treacherous ministers and rebellious villains will all harbor fear. If the Human Mirror emits sudden, dazzling light from its case at an inopportune time, the direction it points will surely harbor the calamity of rebellion. Suppress it, and none will dare act. The Four Barbarians will come as guests, and the realm will be purified.\n\n**Method for Refining the Elixir and Infusing the Five Metals**\nThe *Divine Immortals’ Text* states: The Five Metals are of natural substance but cannot transform into treasures without being infused by the Fire Dragon Elixir, through which they attain communion with the numinous essence of Heaven and Earth. The Fire Dragon Elixir originates in the south, the Vermilion Bird’s position of fire, and is refined within the north’s *ren* and *gui* waters. Traversing the Five Phases, it encompasses the Five Colors and rivals Heaven and Earth in efficacy. Its qi ascends to become Heaven, and its substance descends to become Earth. Thus, it is the root of the supreme medicine, for it takes flight at the sight of fire—hence the name Fire Dragon.\n\nIt possesses the number of the Three Ones, where male and female are undivided, and purity and turbidity, ascent and descent, remain unsettled. Therefore, the noble man endures hardship and awaits the proper time, knowing the white yet guarding the black, and the numinous will come of its own accord. Sages keep it secret, transmitting it orally rather than inscribing it in writing.\n\n**Method for Nurturing the Elixir in the Golden Crucible**\nThe *Divine Immortals’ Text* states: The Golden Crucible corresponds above to Heaven, below to Earth, and in the center to humanity. When the people prosper and the state is at peace, when Heaven is clear and Earth is tranquil, the myriad things are born. Thus, it is said: “Preceding Heaven, Heaven does not oppose it; following Heaven, it complies with Heaven’s timing.” This is now made clear.\n\nThe crucible’s height, weight, thickness, and proportions must precisely follow the method. It should be one foot and two inches tall, weighing seventy-two pounds, its number being nine. Its inner circumference is one foot and five inches, its base one and a half inches thick, its legs raised two and a half inches from the ground, and its body one and a half inches thick.\n\nThe crucible’s interior holds three and a half *sheng* of material, with a depth of six inches. Its lid is one inch thick, and its handles rise one and a half inches.\n\nThere are ten defects that disqualify its use:\n1. The metal is impure.\n2. The casting is untimely.\n3. The thickness is uneven.\n4. The mold is not fully dried.\n5. The core is suspended during casting.\n6. There are sand holes.\n7. There are internal partitions.\n8. There are inclusions or seams.\n9. The metal is wrinkled.\n10. The height, size, and thickness do not conform to the measurements.\n\nIf any of these ten defects are present, the crucible is unfit for refining the supreme elixir.\n\n**Method of Nurturing the Elixir in the Furnace**\nThe *Divine Immortals’ Text* states: The furnace is the crucible’s transformative vessel, encompassing *wu* and *ji*, shielding against external pathogens. Its height resembles a lotus dais, its breadth the Five Peaks.\n\nThe altar has three tiers, round above and square below. The furnace has eight gates. Above, an iron celestial wheel is erected, bearing the Nine Stars and Twenty-Eight Constellations. It moves with the Six *Jia*, revolving in accordance with the Orthodox Unity, aligned with the lunar lodges. Their forms are cast in metal.\n\nThen, refine with fire:\n- One *jin* of sulfur,\n- One *jin* of realgar,\n- One *jin* of orpiment,\n- One *jin* of arsenic.\n\nThese Four Yellows serve as the city walls of the supreme elixir. The Four Yellows and the cinnabar elixir are governed by oral instructions.\n\nRefine one *jin* of cinnabar elixir, which contains sixteen *liang*. Each *liang* has twenty-four *zhu*, corresponding to the 365¼ degrees of the celestial circuit. The celestial *jiazi* cycle is 720, the great number of *bing* and *ding*. There is an envoy that moves one degree per day—this is the great number of pure Yang. There is an envoy that moves thirteen degrees per day and night, completing 365¼ degrees in a month—this is the great number of pure Yin. Yang is concealed by the external, while Yang coalesces from within.\n\nA song says:\n*Within sixty hours, move bing and ding,*\n*Discern the Five Phases with each moment’s shift.*\n*When Yang’s qi advances, follow Heaven’s turn;*\n*When Yin’s qi wanes, pursue the stars’ decree.*\n*Always align with the zenith at noon,*\n*As the lunar lodges cycle—then the elixir is complete.*\n\n**Method of Fire Timing**\nThe *Divine Immortals’ Text* states: The fire timing begins on the day Yang is born, cycling through the seventy-two seasonal markers, alternating in ascent and descent. Each day corresponds to one *liang* and one and a half *zhu*.\n\n- Winter Solstice: Earthworms coil. Celestial *jiazi* 1. Add fire: five *liang* and seven and a half *zhu*.\n- Elk shed their antlers. Human *jiazi* 7. Ten *liang* and fifteen *zhu*.\n- Springs stir. Earthly *jiazi* 4. Fifteen *liang* and twenty-two and a half *zhu*.\n- Minor Cold: Sores face north. Celestial *jiazi* 2. Twenty-one *liang* and six *zhu*.\n- Magpies begin nesting. Human *jiazi* 8. Twenty-six *liang* and thirteen *zhu*.\n- Pheasants first call. Earthly *jiazi* 5. Thirty-one *liang* and twenty-one *zhu*.\n- Major Cold: Ospreys begin breeding. Celestial *jiazi* 3. Thirty-seven *liang* and four and a half *zhu*.\n- Crows grow fierce. Human *jiazi* 9. Forty-two *liang* and twelve *zhu*.\n- Frozen marshes harden again. Earthly *jiazi* 6. Forty-seven *liang* and nineteen and a half *zhu*.\n- Start of Spring: East wind thaws ice. Celestial *jiazi* 8. Fifty-three *liang* and three *zhu*.\n- Hibernating insects stir. Human *jiazi* 5. Fifty-eight *liang* and ten and a half *zhu*.\n- Fish rise to the ice. Earthly *jiazi* 2. Sixty-three *liang* and eighteen *zhu*.\n- Rain Water: Otters sacrifice fish. Celestial *jiazi* 9. Sixty-nine *liang* and one and a half *zhu*.\n- Swans and crows arrive. Human *jiazi* 6. Seventy-four *liang* and nine *zhu*.\n- Plants and trees sprout. Earthly *jiazi* 3. Seventy-nine *liang* and sixteen and a half *zhu*.\n- Waking of Insects: Peach trees bloom. Celestial *jiazi* 1. Eighty-five *liang*.\n- Doves coo. Human *jiazi* 7. Ninety *liang* and seven and a half *zhu*.\n- Hawks transform into cuckoos. Earthly *jiazi* 4. Ninety-five *liang* and fifteen *zhu*.\n- Spring Equinox: Swallows arrive. Celestial *jiazi* 3. One hundred *liang* and twenty-two and a half *zhu*.\n- Thunder resounds. Human *jiazi* 9. One hundred six *liang* and six *zhu*.\n- Lightning begins. Earthly *jiazi* 6. One hundred eleven *liang* and thirteen and a half *zhu*.\n- Pure Brightness: Paulownia blooms. Celestial *jiazi* 4. One hundred sixteen *liang* and twenty-one *zhu*.\n- Voles transform into quails. Human *jiazi* 1. One hundred twenty-two *liang* and four and a half *zhu*.\n- Rainbows appear. Earthly *jiazi* 7. One hundred twenty-seven *liang* and twelve *zhu*.\n- Grain Rain: Duckweed sprouts. Celestial *jiazi* 5. One hundred thirty-two *liang* and nineteen and a half *zhu*.\n- Cuckoos flutter their wings. Human *jiazi* 2. One hundred thirty-eight *liang* and three *zhu*.\n- Hoopoes descend upon mulberries. Earthly *jiazi* 8. One hundred forty-three *liang* and ten and a half *zhu*.\n- Start of Summer: Crickets chirp. Celestial *jiazi* 4. One hundred forty-eight *liang* and eighteen *zhu*.\n- Earthworms emerge. Human *jiazi* 1. One hundred fifty-four *liang* and one and a half *zhu*.\n- King melons grow. Earthly *jiazi* 6. One hundred fifty-nine *liang* and nine *zhu*.\n- Grain Full: Bitter herbs flourish. Celestial *jiazi* 5. One hundred sixty-four *liang* and sixteen and a half *zhu*.\n- Foul grasses die. Human *jiazi* 2. One hundred sixty-nine *liang* and twenty-three *zhu*.\n- Wheat harvest arrives. Earthly *jiazi* 8. One hundred seventy-five *liang* and seven and a half *zhu*.\n- Grain in Ear: Mantises hatch. Celestial *jiazi* 6. One hundred eighty *liang* and fourteen *zhu*.\n- Cuckoos begin calling. Human *jiazi* 3. One hundred eighty-five *liang* and twenty-one and a half *zhu*.\n- Mockingbirds fall silent. Earthly *jiazi* 9. One hundred ninety-one *liang* and five *zhu*.\n- Summer Solstice: Deer shed their antlers. Celestial *jiazi* 9. One hundred eighty-five *liang* and twenty-one and a half *zhu*.\n\nCicadas begin calling. Human *jiazi* 3. One hundred eighty *liang* and fourteen *zhu*.\nPinellia sprouts. Earthly *jiazi* 6. One hundred seventy-five *liang* and seven and a half *zhu*.\nMinor Heat: Warm winds arrive. Celestial *jiazi* 8. One hundred sixty-nine *liang* and twenty-three *zhu*.\nCrickets dwell in walls. Human *jiazi* 2. One hundred sixty-four *liang* and sixteen and a half *zhu*.\nHawks begin to practice hunting. Earthly *jiazi* 5. One hundred fifty-nine *liang* and nine *zhu*.\nMajor Heat: Rotten grass transforms into fireflies. Celestial *jiazi* 7. One hundred fifty-four *liang* and one and a half *zhu*.\nEarth moistens, oppressive heat abates. Human *jiazi* 1. One hundred forty-eight *liang* and eighteen *zhu*.\nHeavy rains occur frequently. Earthly *jiazi* 4. One hundred forty-three *liang* and ten and a half *zhu*.\nStart of Autumn: Chill winds arrive. Celestial *jiazi* 1. One hundred thirty-eight *liang* and three *zhu*.\nWhite dew descends. Human *jiazi* 5. One hundred thirty-two *liang* and nineteen and a half *zhu*.\nCold cicadas call. Earthly *jiazi* 8. One hundred twenty-seven *liang* and twelve *zhu*.\nEnd of Heat: Hawks begin to sacrifice birds. Celestial *jiazi* 1. One hundred twenty-two *liang* and four and a half *zhu*.\nHeaven and Earth begin to wither. Human *jiazi* 4. One hundred sixteen *liang* and twenty-one *zhu*.\nGrain ripens. Earthly *jiazi* 7. One hundred eleven *liang* and thirteen and a half *zhu*.\nWhite Dew: Wild geese and crows arrive. Celestial *jiazi* 9. One hundred six *liang* and six *zhu*.\nDark birds return. Human *jiazi* 3. One hundred two *liang* and twenty-two and a half *zhu*.\nCrows prepare offerings. Earthly *jiazi* 6. Ninety-five *liang* and fifteen *zhu*.\nAutumn Equinox: Thunder ceases its sound. Celestial *jiazi* 7. Ninety *liang* and seven and a half *zhu*.\nHibernating insects seal their burrows. Human *jiazi* 1. Eighty-five *liang*.\nWater begins to dry up. Earthly *jiazi* 4. Seventy-nine *liang* and sixteen and a half *zhu*.\nCold Dew: Wild geese and crows arrive as guests. Celestial *jiazi* 6. Seventy-four *liang* and nine *zhu*.\nSparrows enter great waters and transform into clams. Human *jiazi* 9. Sixty-nine *liang* and one *zhu*.\nChrysanthemums bloom yellow. Earthly *jiazi* 3. Sixty-three *liang* and eighteen *zhu*.\nFrost Descends: Jackals sacrifice beasts. Celestial *jiazi* 5. Fifty-eight *liang* and ten and a half *zhu*.\nGrass and trees turn yellow and fall. Human *jiazi* 8. Fifty-three *liang* and three *zhu*.\nHibernating insects all bow down. Earthly *jiazi* 2. Sixty-seven *liang* and nineteen and a half *zhu*.\nStart of Winter: Water begins to freeze. Celestial *jiazi* 6. Forty-two *liang* and twelve *zhu*.\nEarth begins to freeze. Human *jiazi* 9. Thirty-seven *liang* and four and a half *zhu*.\nWild pheasants transform into clams. Earthly *jiazi* 3. Thirty-one *liang* and twenty-one *zhu*.\nMinor Snow: Rainbows hide and vanish. Celestial *jiazi* 5. Sixteen *liang* and thirteen and a half *zhu*.\nHeaven’s *qi* ascends, Earth’s *qi* descends. Human *jiazi* 8. Twenty-one *liang* and six *zhu*.\nClosed and sealed, winter is formed. Earthly *jiazi* 2. Fifteen *liang* and twenty-two and a half *zhu*.\nMajor Snow: Gulls and crows fall silent. Celestial *jiazi* 4. Ten *liang* and fifteen *zhu*.\nTigers begin to mate. Human *jiazi* 7. Five *liang* and seven and a half *zhu*.\n*Liting* emerges. Earthly *jiazi* 1. Exhausted.\n\n**Sacrificial Method**\nThe *Divine Immortals’ Writ* states: \"After achieving merit before Heaven, then the springs and caves are divided into four parts, three of them. One part is used to illuminate Heaven, one part to illuminate Earth, one part to illuminate Man, and the remaining one part of the three is used to report and give thanks to the springs and caves for the divine immortal traces bestowed. Cast gold into a case, inscribe the imperial records, and cast it in. The remaining one part may be consumed to make the spirit and *qi* serene and pure, prolonging life.\"\n\nThe method for refining the elixir and casting the Three Primordials’ precious illuminations is complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "神仙炼丹点铸三元宝照法 经名：神仙炼丹点铸三元宝照法。 唐末隐士归耕子撰。 官炼丹铸镜之法。 一卷。 底本出处：《正统道藏》洞神部方法类。 神仙炼丹点铸三元宝照法序 归耕子者，士之不遇所称也。 余幼习文武之艺，好奇异之术。 洎乎立身之年，过梁适郑，游嵩少之问，憩於大树下，遇一老叟，年八十许，眉目疏朗，神气闲静，因揖坐石上，移时与语，多话虚无出世之言。 谓余曰：叟居不远，可一往焉。 余唯唯同之，见所居皆古木修竹，门径闲寂，室无人矣。 余因征黄帝升天，及战蚩尤，使风后，铸铁照法。 叟日：子闻神仙炼丹，点铸三元天地人宝照否。 曰：未曾闻也。 遂稽颗再拜，愿先生指陈幽迹，以去尘惑。 日：观子骨气，异常人也，可以教授。 乃於囊中出其文，皆古篆也。 曰； 此非子之身之事，乃太平天子之所为也。 若遇道德淳素，合天地心，四海晏如，民有枢谣之咏，可依法铸之。 余禀是诚，叩首再拜。 俟来旦叟日：此非子久处，宜去也。 后三纪复相见。 余告辞，再拜之洛，秘之肘腋之问，未敢轻传其非人也。 时唐天复二年仲春月归耕子述。 神仙炼丹点铸三元宝照法序 归耕子者，士之不遇所称也。 余幼习文武之艺，好奇异之术。",
      "translated_text": "**The Divine Immortals’ Method for Refining the Elixir and Forging the Three Primordial Treasure Mirrors**\n\n*Scripture Title:* *The Divine Immortals’ Method for Refining the Elixir and Forging the Three Primordial Treasure Mirrors*\n*Composed by:* Guigengzi, a reclusive scholar of the late Tang dynasty\n*A method for official elixir-refining and mirror-forging. One fascicle.*\n*Source of the base text:* *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Methods* Category.\n\n---\n\n**Preface to *The Divine Immortals’ Method for Refining the Elixir and Forging the Three Primordial Treasure Mirrors***\n\nGuigengzi was the sobriquet of a scholar who met with no success in his time.\n\nIn my youth, I studied both literary and martial arts and was drawn to extraordinary techniques. Upon reaching the age of maturity, I passed through Liang and arrived in Zheng, wandering among the peaks of Song and Sha. Resting beneath a great tree, I encountered an old man of perhaps eighty years, his brows and eyes clear, his spirit serene and unhurried. I bowed and sat with him upon a stone, and after some time in conversation, he spoke much of emptiness and transcendence.\n\nHe said to me, “My dwelling is not far. You may come and visit.” I assented and followed him. There, I saw only ancient trees and towering bamboo, the gate and path quiet and secluded, the chamber empty of others.\n\nI then inquired about the Yellow Emperor’s ascension to heaven, his battle with Chiyou, his employment of Feng Hou, and the method of forging the *Iron Mirror*.\n\nThe old man replied, “Have you heard of the Divine Immortals’ method for refining the elixir and forging the *Three Primordial Treasure Mirrors*—those of Heaven, Earth, and Humanity?”\n\nI answered, “I have not.”\n\nThereupon, I knelt and bowed twice, entreating him to reveal these hidden arts and dispel my worldly delusions.\n\nHe said, “Observing your bones and qi, you are no ordinary man. You are fit to be taught.” Then, from his satchel, he produced a text written entirely in ancient seal script.\n\nHe said, “This is not a matter for your person alone, but for the Sage Emperor of Great Peace. If you encounter an age where virtue and simplicity are pure, aligned with the heart of Heaven and Earth, where the Four Seas are at peace and the people sing in harmony, then you may forge the mirrors according to this method.”\n\nI received his words with sincerity and bowed twice in gratitude.\n\nThe next morning, the old man said, “This is no place for you to linger. You should depart.” Three cycles of twelve years later, we met again.\n\nWhen I took my leave, I bowed twice by the Luo River, concealing the method close to my person, never daring to transmit it lightly to the unworthy.\n\nRecorded in the second month of spring, the second year of *Tianfu* in the Tang dynasty, by Guigengzi.\n\n---\n\n**Preface to *The Divine Immortals’ Method for Refining the Elixir and Forging the Three Primordial Treasure Mirrors***\n\nGuigengzi was the sobriquet of a scholar who met with no success in his time.\n\nIn my youth, I studied both literary and martial arts and was drawn to extraordinary techniques.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 481,
      "start_sentence": 0,
      "end_sentence": 28,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.810075759887695,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\神仙炼丹点铸三元宝照法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "洎乎立身之年，过梁适郑，游嵩少之问，憩於大树下，遇一老叟，年八十许，眉目疏朗，神气闲静，因揖坐石上，移时与语，多话虚无出世之言。 谓余曰：叟居不远，可一往焉。 余唯唯同之，见所居皆古木修竹，门径闲寂，室无人矣。 余因征黄帝升天，及战蚩尤，使风后，铸铁照法。 叟日：子闻神仙炼丹，点铸三元天地人宝照否。 曰：未曾闻也。 遂稽颗再拜，愿先生指陈幽迹，以去尘惑。 日：观子骨气，异常人也，可以教授。 乃於囊中出其文，皆古篆也。 曰； 此非子之身之事，乃太平天子之所为也。 若遇道德淳素，合天地心，四海晏如，民有枢谣之咏，可依法铸之。 余禀是诚，叩首再拜。 俟来旦叟日：此非子久处，宜去也。 后三纪复相见。 余告辞，再拜之洛，秘之肘腋之问，未敢轻传其非人也。 时唐天复二年仲春月归耕子述。 神仙炼丹点铸三元宝照法 炼丹铸天照法 《神仙文》日：天元甲子之纪，六六之首，阳火大盛，取其真精，炼五金灵丹之气，铸成天照，威服鬼神，松断祆授，置炉玄鉴之位，取岁旬六戊，句陈阳土，伐青龙六甲阳木，然朱雀六丙阳火，烧成无姻之烬，用白虎六庚阳金，央玄武六壬阳水。 后以阳土筑坛，高三尺，立三层，上圆下方，坛四出陛。 坛上泥炉，高八尺一寸，下开八门，门广六寸四分。 炉上用铁作天轮，立六甲六丁之神，日君月后，九曜真君。 发火，当火之中点炼，以火龙之丹。 其天照厚三寸，重七十二斤，面广三十六寸，背上内象紫微星君所居，外列二十八宿。 铸成，若遇五星失度，彗孛出天，霜雹霖旱，开此照，斋洁虔诚，助威扬德，其灾自珍。 铸地照法 地照亦厚三寸，重七十二斤，面广三十六寸。 背上铸山川五岳四渍，八卦九州十六神。 发火铸时，当太阴望中铸成。 若遇地动山川崩裂，虫蝗稼穑不登，津梁阻塞，开地照，虔诚严洁，修德助威，其灾自灭。 铸人照法 人照亦厚三寸，重七十二斤，面广三十六寸，背上铸游玑之星，六十甲子神名，天子帝号，本命神君，左龙右虎，国号，星辰分野，所属郡邑。 铸用丙午日太阳中时。 铸成，若遇干戈未偃，兆民疫疠，开此照，洁诚析祭，灾疠自息。 每遇二气升降之日，於正殿会旱品庶老，开人照临轩，扬威赫奕，奸臣贼子皆怀惧心。 若人照非时，有光突辉出匣，随其所指之方，必有祆叛之孽，可御之，无能动作，四夷来宾，寰宇廓清也。 炼丹点五金法 《神仙文》日：五金者，自然之质，未能变化为宝，须用火龙丹点之，方得通天地之灵也。 火龙丹者，本乎南方，朱雀火位，袭化北方壬癸之中，历涉五行，包含五彩，功齐天地。 其气腾而为天，其质降而为地，所以至药之本，谓见火即飞，故有火龙之称也。 乃有三一之数，雄雌混而未分，清浊浮沉不定。 故君子固穷候时，知白守黑，神明自来。 圣人秘之，不形文字，口口相传。 金鼎养丹法 《神仙文》曰：金鼎者，上符天，下法地，中应民。 民昌国泰，天清地静，万物生焉。 故日：先天而天弗违，后天而奉天时。 此可明矣。 其鼎高下锱铢厚薄，一一依法。 鼎高一尺二寸，重七十二斤，其数有九。 内围一尺五寸，底厚一寸半，脚去地二寸半，身厚一寸半。",
      "translated_text": "Upon reaching the age of adulthood, I passed through Liang and arrived in Zheng, wandering among the peaks of Song and Shaoshi. Resting beneath a great tree, I encountered an old man of about eighty, his brows and eyes clear and uncluttered, his spirit serene and composed. We exchanged bows and sat upon a stone, and as we spoke for some time, much of his discourse concerned the emptiness of the world and the path beyond it.\n\nHe said to me, “My dwelling is not far from here. You may come and visit.” I assented and followed him. His home was surrounded by ancient trees and towering bamboo, its gate and path quiet and secluded, the chamber empty of others. There, I inquired about the Yellow Emperor’s ascent to heaven, his battle with Chiyou, his employment of the Wind Master, and the method of forging the Iron Mirror.\n\nThe old man said, “Have you heard of the Divine Immortals’ method for refining the elixir and forging the Three Primordial Treasure Mirrors of Heaven, Earth, and Humanity?”\n\nI replied, “I have not.”\n\nThereupon, I bowed deeply twice and entreated him, “I wish for you, Master, to reveal these hidden arts and dispel my worldly delusions.”\n\nHe said, “Observing your bone and qi, you are no ordinary man. You are worthy of instruction.” He then drew from his bag a text written in ancient seal script.\n\n“This,” he said, “is not a matter for your person alone, but for the Sage Emperor of a Great Peace. Only when virtue is pure and simple, aligning with the heart of Heaven and Earth, when the Four Seas are at peace and the people sing praises of the pivot of governance, may this method be forged.”\n\nI received his words with sincerity and bowed twice in gratitude.\n\nThe next morning, the old man said, “This is no place for you to linger. You should depart.” Three cycles of twelve years later, we met again.\n\nWhen I took my leave, I bowed twice by the Luo River, concealing the method close to my person, never daring to transmit it lightly to the unworthy.\n\n---\n\n**The Divine Immortals’ Method for Refining the Elixir and Forging the Three Primordial Treasure Mirrors**\n\n**Method for Forging the Heaven Mirror**\nThe *Divine Immortals’ Text* states: At the beginning of the Heavenly Cycle of *jiazi*, the first of the six sixes, when the yang fire is at its zenith, gather its true essence. Refine the qi of the Five Metals’ numinous elixir and forge the Heaven Mirror. It will command the awe of spirits and demons, severing the roots of malevolence. Place the furnace in the position of the *Xuanjian* (Mysterious Mirror). On the six *wu* days of the year’s旬, invoke the yang earth of *Juchen* (the Celestial Enclosure), fell the yang wood of the Six *Jia* Green Dragon, and ignite the yang fire of the Six *Bing* Vermilion Bird, burning it to smokeless embers. Employ the yang metal of the Six *Geng* White Tiger and the yang water of the Six *Ren* Dark Warrior.\n\nAfterward, construct a yang earth altar, three feet high, with three tiers—round above and square below—with steps extending from all four sides. On the altar, mold a furnace eight feet and one inch high, with eight doors at its base, each six inches and four *fen* wide. Atop the furnace, fashion an iron Heavenly Wheel, positioning the deities of the Six *Jia* and Six *Ding*, the Sun Lord and Moon Queen, and the Nine Luminaries’ True Lords. Ignite the fire, refining at its center, using the Fire Dragon’s elixir.\n\nThe Heaven Mirror should be three inches thick, weighing seventy-two pounds, with a face thirty-six inches wide. On its reverse, the inner design depicts the Purple Tenuity Star Lord’s abode, while the outer lists the Twenty-Eight Constellations. Once forged, if the Five Planets deviate from their courses, comets appear in the sky, or disasters of frost, hail, floods, or drought strike, open this mirror with reverent purity. Assist in manifesting power and virtue, and the calamities will naturally cease.\n\n**Method for Forging the Earth Mirror**\nThe Earth Mirror is also three inches thick, weighing seventy-two pounds, with a face thirty-six inches wide. On its reverse, cast the mountains, rivers, Five Peaks, Four Seas, Eight Trigrams, Nine Provinces, and Sixteen Spirits. When forging, do so at the full moon of the Great Yin. If earthquakes, landslides, or the collapse of mountains and rivers occur, if locusts devastate the harvest, or if waterways and bridges are blocked, open the Earth Mirror with solemn purity. Cultivate virtue and assist in manifesting power, and the disasters will naturally vanish.\n\n**Method for Forging the Human Mirror**\nThe Human Mirror is likewise three inches thick, weighing seventy-two pounds, with a face thirty-six inches wide. On its reverse, cast the revolving mechanism of the stars, the names of the sixty *jiazi* spirits, the Son of Heaven’s imperial title, the Lord of One’s Life Destiny, the Green Dragon to the left and White Tiger to the right, the state’s name, the celestial divisions of the stars, and the subordinate commanderies and counties. Forge it on a *bingwu* day at the hour of the sun’s zenith.\n\nOnce forged, if warfare does not cease or the people suffer from epidemics, open this mirror with purity and sincerity, offering prayers and sacrifices, and the disasters and pestilence will naturally subside. On the days of the two qi’s ascent and descent, gather the elderly of all ranks in the main hall. Open the Human Mirror before the hall’s eaves, displaying its awe-inspiring radiance, and treacherous ministers and rebellious villains will all harbor fear. If the Human Mirror emits sudden, dazzling light from its case at an inopportune time, the direction it points will surely harbor the calamity of rebellion. Suppress it, and none will dare act. The Four Barbarians will come as guests, and the realm will be purified.\n\n**Method for Refining the Elixir and Infusing the Five Metals**\nThe *Divine Immortals’ Text* states: The Five Metals are of natural substance but cannot transform into treasures without being infused by the Fire Dragon Elixir, through which they attain communion with the numinous essence of Heaven and Earth. The Fire Dragon Elixir originates in the south, the Vermilion Bird’s position of fire, and is refined within the north’s *ren* and *gui* waters. Traversing the Five Phases, it encompasses the Five Colors and rivals Heaven and Earth in efficacy. Its qi ascends to become Heaven, and its substance descends to become Earth. Thus, it is the root of the supreme medicine, for it takes flight at the sight of fire—hence the name Fire Dragon.\n\nIt possesses the number of the Three Ones, where male and female are undivided, and purity and turbidity, ascent and descent, remain unsettled. Therefore, the noble man endures hardship and awaits the proper time, knowing the white yet guarding the black, and the numinous will come of its own accord. Sages keep it secret, transmitting it orally rather than inscribing it in writing.\n\n**Method for Nurturing the Elixir in the Golden Crucible**\nThe *Divine Immortals’ Text* states: The Golden Crucible corresponds above to Heaven, below to Earth, and in the center to humanity. When the people prosper and the state is at peace, when Heaven is clear and Earth is tranquil, the myriad things are born. Thus, it is said: “Preceding Heaven, Heaven does not oppose it; following Heaven, it complies with Heaven’s timing.” This is now made clear.\n\nThe crucible’s height, weight, thickness, and proportions must precisely follow the method. It should be one foot and two inches tall, weighing seventy-two pounds, its number being nine. Its inner circumference is one foot and five inches, its base one and a half inches thick, its legs raised two and a half inches from the ground, and its body one and a half inches thick.",
      "overlap_context": "oncealing the method close to my person, never daring to transmit it lightly to the unworthy.\n\nRecorded in the second month of spring, the second year of *Tianfu* in the Tang dynasty, by Guigengzi.\n\n---\n\n**Preface to *The Divine Immortals’ Method for Refining the Elixir and Forging the Three Primordial Treasure Mirrors***\n\nGuigengzi was the sobriquet of a scholar who met with no success in his time.\n\nIn my youth, I studied both literary and martial arts and was drawn to extraordinary techniques.",
      "start_char": 481,
      "end_char": 1714,
      "start_sentence": 29,
      "end_sentence": 80,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.1087863445282,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\神仙炼丹点铸三元宝照法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "内受物可三升半，深六寸，盖厚一寸，耳高一寸半。 次有十病，不在用限，一金不精，二铸不及时，三厚薄不匀，四模素不乾，五悬胎铸，六砂孔，七唐膈，八夹横，九金皱，十高下大小厚薄，不依尺寸。 若遇有此十病，并不在修至药之限。 炉养丹法 《神仙文》日：炉者，鼎之造化，包容戊己，隔截外邪，高像莲台，横像五岳。 坛有三层，上圆下方。 炉有八门，上以铁作天轮，立九星二十八宿，时行六甲，运转正一，建随冈宿，金铸其像。 然后以火伏硫黄，火伏雄黄，火伏雌黄，火伏毗黄，各一斤。 此四黄为至药之城郭。 其四黄并丹，并在口诀。 火伏丹砂一斤，有十六两，每两有二十四铢，周天三百六十五度二十五分半，天元甲子七百二十，是丙丁之大数也。 有使者日行一度，是纯阳之大数。 有使者月一日夜行一十三度，一月行三百六十五度二十五分半，是纯阴之大数也。 阳以外掩，阳自中结。 歌曰：六十时中运丙丁，每用随时辨五行。 阳气进时顺天转，阴气臧候逐星征。 常以加临须正午，冈宿周来至药成。 火候法 《神仙文》曰：火候起自阳生之日，周其七十二候，循环加臧也，每日合一两一铢半。 冬至蚯蚓结，天元甲子一，添火五两七铢半。 麋角解，人元甲子七，一十两一十五铢。 水泉动。 地元甲子四，一十五两二十二铢半。 小寒疡北乡，天元甲子二，二十一两六铢。 鹊始巢，人元甲子八，二十六两一十三铢。 野鹦始雊。 地元甲子五，三＋一两二十一铢。 大寒鹦始乳，天元甲子三，三＋七两四铢半。 惊乌厉疾，人元甲子九，四十二两一十二铢。 水泽复坚。 地元甲子六，四＋七两一十九铢半。 立春东风解冻，天元甲子八，五＋三两三铢。 蛰虫始振人元甲子五，五十八两一十铢半。 鱼上冰。 地元甲子二，六十三两一十八铢。 雨水獭祭鱼，天元甲子九，六＋九两1铢半。 鸿鸦来，人元甲子六，七十四两九铢。 草木萌动。 地元甲子三，七＋九两一十六铢半。 惊蛰桃始华，天元甲子一，八十五两。 鸽鹧呜，人元甲子七，九十两七铢半。 鹰化为鸠。 地元甲子四，九十五两一十五铢。 春分玄乌至，天元甲子三，一百两二＋二铢半。 雷乃发声，人元甲子九，一百六两六铢。 雷始电。 地元甲子六，一百十一两一十三铢半。 清明桐始华，天元甲子四，一百一十六两二十一铢。 田鼠化为驾，人元甲子一，一百二＋二两四铢半。 虹始见。 地元甲子七，一百二＋七两一十二铢。 谷雨萍始生，天元甲子五，一百三＋二两一＋九铢半。 呜鸠拂其羽，人元甲子二，一百三十八两三铢。 戴胜降于桑。 地元甲子八，一百四十三两一十铢半。 立夏蝼蝈呜，天元甲子四，一百四十八两一十八铢。 蚯蚓出，人元甲子一，一百五十四两一铢半。 王瓜生地元甲子六，一百五＋九两九铢。 小满苦菜秀，天元甲子五，一百六＋四两一十六铢半。 靡草死，人元甲子二，一百六＋九两二十三铢。 麦秋至。 地元甲子八，一百七十五两七铢半。 芒种螳螂生，天元甲子六，一百八十两一十四铢。 鹃始呜，人元甲子三，一百八十五两二十一铢半。 反舌无声。 地元甲子九，一百九十一两五铢。 夏至鹿角解，天元甲子九，一百八十五两二十一铢半。",
      "translated_text": "The crucible’s interior holds three and a half *sheng* of material, with a depth of six inches. Its lid is one inch thick, and its handles rise one and a half inches.\n\nThere are ten defects that disqualify its use:\n1. The metal is impure.\n2. The casting is untimely.\n3. The thickness is uneven.\n4. The mold is not fully dried.\n5. The core is suspended during casting.\n6. There are sand holes.\n7. There are internal partitions.\n8. There are inclusions or seams.\n9. The metal is wrinkled.\n10. The height, size, and thickness do not conform to the measurements.\n\nIf any of these ten defects are present, the crucible is unfit for refining the supreme elixir.\n\n**Method of Nurturing the Elixir in the Furnace**\nThe *Divine Immortals’ Text* states: The furnace is the crucible’s transformative vessel, encompassing *wu* and *ji*, shielding against external pathogens. Its height resembles a lotus dais, its breadth the Five Peaks.\n\nThe altar has three tiers, round above and square below. The furnace has eight gates. Above, an iron celestial wheel is erected, bearing the Nine Stars and Twenty-Eight Constellations. It moves with the Six *Jia*, revolving in accordance with the Orthodox Unity, aligned with the lunar lodges. Their forms are cast in metal.\n\nThen, refine with fire:\n- One *jin* of sulfur,\n- One *jin* of realgar,\n- One *jin* of orpiment,\n- One *jin* of arsenic.\n\nThese Four Yellows serve as the city walls of the supreme elixir. The Four Yellows and the cinnabar elixir are governed by oral instructions.\n\nRefine one *jin* of cinnabar elixir, which contains sixteen *liang*. Each *liang* has twenty-four *zhu*, corresponding to the 365¼ degrees of the celestial circuit. The celestial *jiazi* cycle is 720, the great number of *bing* and *ding*. There is an envoy that moves one degree per day—this is the great number of pure Yang. There is an envoy that moves thirteen degrees per day and night, completing 365¼ degrees in a month—this is the great number of pure Yin. Yang is concealed by the external, while Yang coalesces from within.\n\nA song says:\n*Within sixty hours, move bing and ding,*\n*Discern the Five Phases with each moment’s shift.*\n*When Yang’s qi advances, follow Heaven’s turn;*\n*When Yin’s qi wanes, pursue the stars’ decree.*\n*Always align with the zenith at noon,*\n*As the lunar lodges cycle—then the elixir is complete.*\n\n**Method of Fire Timing**\nThe *Divine Immortals’ Text* states: The fire timing begins on the day Yang is born, cycling through the seventy-two seasonal markers, alternating in ascent and descent. Each day corresponds to one *liang* and one and a half *zhu*.\n\n- Winter Solstice: Earthworms coil. Celestial *jiazi* 1. Add fire: five *liang* and seven and a half *zhu*.\n- Elk shed their antlers. Human *jiazi* 7. Ten *liang* and fifteen *zhu*.\n- Springs stir. Earthly *jiazi* 4. Fifteen *liang* and twenty-two and a half *zhu*.\n- Minor Cold: Sores face north. Celestial *jiazi* 2. Twenty-one *liang* and six *zhu*.\n- Magpies begin nesting. Human *jiazi* 8. Twenty-six *liang* and thirteen *zhu*.\n- Pheasants first call. Earthly *jiazi* 5. Thirty-one *liang* and twenty-one *zhu*.\n- Major Cold: Ospreys begin breeding. Celestial *jiazi* 3. Thirty-seven *liang* and four and a half *zhu*.\n- Crows grow fierce. Human *jiazi* 9. Forty-two *liang* and twelve *zhu*.\n- Frozen marshes harden again. Earthly *jiazi* 6. Forty-seven *liang* and nineteen and a half *zhu*.\n- Start of Spring: East wind thaws ice. Celestial *jiazi* 8. Fifty-three *liang* and three *zhu*.\n- Hibernating insects stir. Human *jiazi* 5. Fifty-eight *liang* and ten and a half *zhu*.\n- Fish rise to the ice. Earthly *jiazi* 2. Sixty-three *liang* and eighteen *zhu*.\n- Rain Water: Otters sacrifice fish. Celestial *jiazi* 9. Sixty-nine *liang* and one and a half *zhu*.\n- Swans and crows arrive. Human *jiazi* 6. Seventy-four *liang* and nine *zhu*.\n- Plants and trees sprout. Earthly *jiazi* 3. Seventy-nine *liang* and sixteen and a half *zhu*.\n- Waking of Insects: Peach trees bloom. Celestial *jiazi* 1. Eighty-five *liang*.\n- Doves coo. Human *jiazi* 7. Ninety *liang* and seven and a half *zhu*.\n- Hawks transform into cuckoos. Earthly *jiazi* 4. Ninety-five *liang* and fifteen *zhu*.\n- Spring Equinox: Swallows arrive. Celestial *jiazi* 3. One hundred *liang* and twenty-two and a half *zhu*.\n- Thunder resounds. Human *jiazi* 9. One hundred six *liang* and six *zhu*.\n- Lightning begins. Earthly *jiazi* 6. One hundred eleven *liang* and thirteen and a half *zhu*.\n- Pure Brightness: Paulownia blooms. Celestial *jiazi* 4. One hundred sixteen *liang* and twenty-one *zhu*.\n- Voles transform into quails. Human *jiazi* 1. One hundred twenty-two *liang* and four and a half *zhu*.\n- Rainbows appear. Earthly *jiazi* 7. One hundred twenty-seven *liang* and twelve *zhu*.\n- Grain Rain: Duckweed sprouts. Celestial *jiazi* 5. One hundred thirty-two *liang* and nineteen and a half *zhu*.\n- Cuckoos flutter their wings. Human *jiazi* 2. One hundred thirty-eight *liang* and three *zhu*.\n- Hoopoes descend upon mulberries. Earthly *jiazi* 8. One hundred forty-three *liang* and ten and a half *zhu*.\n- Start of Summer: Crickets chirp. Celestial *jiazi* 4. One hundred forty-eight *liang* and eighteen *zhu*.\n- Earthworms emerge. Human *jiazi* 1. One hundred fifty-four *liang* and one and a half *zhu*.\n- King melons grow. Earthly *jiazi* 6. One hundred fifty-nine *liang* and nine *zhu*.\n- Grain Full: Bitter herbs flourish. Celestial *jiazi* 5. One hundred sixty-four *liang* and sixteen and a half *zhu*.\n- Foul grasses die. Human *jiazi* 2. One hundred sixty-nine *liang* and twenty-three *zhu*.\n- Wheat harvest arrives. Earthly *jiazi* 8. One hundred seventy-five *liang* and seven and a half *zhu*.\n- Grain in Ear: Mantises hatch. Celestial *jiazi* 6. One hundred eighty *liang* and fourteen *zhu*.\n- Cuckoos begin calling. Human *jiazi* 3. One hundred eighty-five *liang* and twenty-one and a half *zhu*.\n- Mockingbirds fall silent. Earthly *jiazi* 9. One hundred ninety-one *liang* and five *zhu*.\n- Summer Solstice: Deer shed their antlers. Celestial *jiazi* 9. One hundred eighty-five *liang* and twenty-one and a half *zhu*.",
      "overlap_context": ": “Preceding Heaven, Heaven does not oppose it; following Heaven, it complies with Heaven’s timing.” This is now made clear.\n\nThe crucible’s height, weight, thickness, and proportions must precisely follow the method. It should be one foot and two inches tall, weighing seventy-two pounds, its number being nine. Its inner circumference is one foot and five inches, its base one and a half inches thick, its legs raised two and a half inches from the ground, and its body one and a half inches thick.",
      "start_char": 1714,
      "end_char": 3042,
      "start_sentence": 81,
      "end_sentence": 147,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.353140354156494,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\神仙炼丹点铸三元宝照法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "蜩始鸣，人元甲子三，一百八十两一十四铢。 半夏生。 地元甲子六，一百七十五两七铢半。 小暑温风至，天元甲子八，一百六十九两二＋三铢。 蟋蟀居壁，人元甲子二，一百六＋四两一十六铢半。 鹰乃学习。 地元甲子五，一百五十九两九铢。 大暑腐草化为萤，天元甲子七，一百五十四两一铢半。 土润褥暑，人元甲子一，一百四十八两一十八铢。 大雨时行。 地元甲子四，一百四十三两一十铢半。 立秋冻风至，天元甲子1一，一百三＋八两三铢。 白露降，人元甲子五，一百三十二两一十九铢半。 寒蝉呜。 地元甲子八，一百二＋七两一十二铢。 处暑鹰乃祭乌，天元甲子一，一百二＋二两四铢半。 天地始肃，人元甲子四，一百一十六两二十一铢。 禾乃登。 地元甲子七，一百一十一两一十三铢半。 白露鸿鸦来，天元甲子九，一百六两六铢。 玄乌归，人元甲子三，一百两二＋二铢半。 覃乌养羞。 地元甲子六，九＋五两一十五铢。 秋分雷乃收声，天元甲子七，九十两七铢半。 蛰虫坏户，人元甲子一，八十五两。 水始涸。 地元甲子四，七十九两一十六铢半。 寒露鸿鸦来宾，天元甲子六，七十四两九铢。 雀入大水化为蛤，人元甲子九，六＋九两一铢。 菊有黄华。 地元甲子三，六＋三两十八铢。 霜降豺祭兽，天元甲子五，五十八两一十铢半。 草木黄落，人元甲子八，五十三两三铢。 蛰虫咸俯。 地元甲子二，六＋七两一十九铢半。 立冬水始冰，天元甲子六，四十二两一十二铢。 地始冻，人元甲子九，三＋七两四铢半。 野雉化为蜃。 地元甲子三，三＋一两二十一铢。 小雪虹藏不见，天元甲子五，11＋六两一十三铢半。 天气上腾，地气下降，人元甲子八，二十一两六铢。 闭塞而成冬。 地元甲子二，一十五两二十二铢半。 大雪鸥乌不呜，天元甲子四，一十两一十五铢。 虎始交，人元甲子七，五两七铢半。 荔挺出。 地元甲子一，喊尽。 祭法 《神仙文》日：功成先天，而后泉洞，四分之三。 一分点天照，一分点地照，一分点人照，余一分小四分之三，一分告谢天地泉洞，所授神仙灵迹，铸金为函，刻帝纪投之，余一分可饵，使神气冲静，延龄也。 神仙炼丹点铸三元宝照法竟",
      "translated_text": "Cicadas begin calling. Human *jiazi* 3. One hundred eighty *liang* and fourteen *zhu*.\nPinellia sprouts. Earthly *jiazi* 6. One hundred seventy-five *liang* and seven and a half *zhu*.\nMinor Heat: Warm winds arrive. Celestial *jiazi* 8. One hundred sixty-nine *liang* and twenty-three *zhu*.\nCrickets dwell in walls. Human *jiazi* 2. One hundred sixty-four *liang* and sixteen and a half *zhu*.\nHawks begin to practice hunting. Earthly *jiazi* 5. One hundred fifty-nine *liang* and nine *zhu*.\nMajor Heat: Rotten grass transforms into fireflies. Celestial *jiazi* 7. One hundred fifty-four *liang* and one and a half *zhu*.\nEarth moistens, oppressive heat abates. Human *jiazi* 1. One hundred forty-eight *liang* and eighteen *zhu*.\nHeavy rains occur frequently. Earthly *jiazi* 4. One hundred forty-three *liang* and ten and a half *zhu*.\nStart of Autumn: Chill winds arrive. Celestial *jiazi* 1. One hundred thirty-eight *liang* and three *zhu*.\nWhite dew descends. Human *jiazi* 5. One hundred thirty-two *liang* and nineteen and a half *zhu*.\nCold cicadas call. Earthly *jiazi* 8. One hundred twenty-seven *liang* and twelve *zhu*.\nEnd of Heat: Hawks begin to sacrifice birds. Celestial *jiazi* 1. One hundred twenty-two *liang* and four and a half *zhu*.\nHeaven and Earth begin to wither. Human *jiazi* 4. One hundred sixteen *liang* and twenty-one *zhu*.\nGrain ripens. Earthly *jiazi* 7. One hundred eleven *liang* and thirteen and a half *zhu*.\nWhite Dew: Wild geese and crows arrive. Celestial *jiazi* 9. One hundred six *liang* and six *zhu*.\nDark birds return. Human *jiazi* 3. One hundred two *liang* and twenty-two and a half *zhu*.\nCrows prepare offerings. Earthly *jiazi* 6. Ninety-five *liang* and fifteen *zhu*.\nAutumn Equinox: Thunder ceases its sound. Celestial *jiazi* 7. Ninety *liang* and seven and a half *zhu*.\nHibernating insects seal their burrows. Human *jiazi* 1. Eighty-five *liang*.\nWater begins to dry up. Earthly *jiazi* 4. Seventy-nine *liang* and sixteen and a half *zhu*.\nCold Dew: Wild geese and crows arrive as guests. Celestial *jiazi* 6. Seventy-four *liang* and nine *zhu*.\nSparrows enter great waters and transform into clams. Human *jiazi* 9. Sixty-nine *liang* and one *zhu*.\nChrysanthemums bloom yellow. Earthly *jiazi* 3. Sixty-three *liang* and eighteen *zhu*.\nFrost Descends: Jackals sacrifice beasts. Celestial *jiazi* 5. Fifty-eight *liang* and ten and a half *zhu*.\nGrass and trees turn yellow and fall. Human *jiazi* 8. Fifty-three *liang* and three *zhu*.\nHibernating insects all bow down. Earthly *jiazi* 2. Sixty-seven *liang* and nineteen and a half *zhu*.\nStart of Winter: Water begins to freeze. Celestial *jiazi* 6. Forty-two *liang* and twelve *zhu*.\nEarth begins to freeze. Human *jiazi* 9. Thirty-seven *liang* and four and a half *zhu*.\nWild pheasants transform into clams. Earthly *jiazi* 3. Thirty-one *liang* and twenty-one *zhu*.\nMinor Snow: Rainbows hide and vanish. Celestial *jiazi* 5. Sixteen *liang* and thirteen and a half *zhu*.\nHeaven’s *qi* ascends, Earth’s *qi* descends. Human *jiazi* 8. Twenty-one *liang* and six *zhu*.\nClosed and sealed, winter is formed. Earthly *jiazi* 2. Fifteen *liang* and twenty-two and a half *zhu*.\nMajor Snow: Gulls and crows fall silent. Celestial *jiazi* 4. Ten *liang* and fifteen *zhu*.\nTigers begin to mate. Human *jiazi* 7. Five *liang* and seven and a half *zhu*.\n*Liting* emerges. Earthly *jiazi* 1. Exhausted.\n\n**Sacrificial Method**\nThe *Divine Immortals’ Writ* states: \"After achieving merit before Heaven, then the springs and caves are divided into four parts, three of them. One part is used to illuminate Heaven, one part to illuminate Earth, one part to illuminate Man, and the remaining one part of the three is used to report and give thanks to the springs and caves for the divine immortal traces bestowed. Cast gold into a case, inscribe the imperial records, and cast it in. The remaining one part may be consumed to make the spirit and *qi* serene and pure, prolonging life.\"\n\nThe method for refining the elixir and casting the Three Primordials’ precious illuminations is complete.",
      "overlap_context": "iazi* 8. One hundred seventy-five *liang* and seven and a half *zhu*.\n- Grain in Ear: Mantises hatch. Celestial *jiazi* 6. One hundred eighty *liang* and fourteen *zhu*.\n- Cuckoos begin calling. Human *jiazi* 3. One hundred eighty-five *liang* and twenty-one and a half *zhu*.\n- Mockingbirds fall silent. Earthly *jiazi* 9. One hundred ninety-one *liang* and five *zhu*.\n- Summer Solstice: Deer shed their antlers. Celestial *jiazi* 9. One hundred eighty-five *liang* and twenty-one and a half *zhu*.",
      "start_char": 3043,
      "end_char": 3982,
      "start_sentence": 148,
      "end_sentence": 198,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.158013105392456,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\神仙炼丹点铸三元宝照法.txt",
        "category": "方法类"
      }
    }
  ]
}