{
  "source_id": "神功妙济真君礼文",
  "source_file": "chunked_daozang\\神功妙济真君礼文.json",
  "total_chunks": 4,
  "total_original_chars": 3383,
  "total_translated_chars": 22626,
  "total_translation_time": 111.08589935302734,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\神功妙济真君礼文.txt",
    "category": "威仪类"
  },
  "full_translation": "**Ritual Text for the Venerable Divine Merit and Wondrous Salvation True Lord**\n\n*Scripture Title:* Ritual Text for the Venerable Divine Merit and Wondrous Salvation True Lord. One fascicle. Compiler unknown. Originated between the late Yuan and early Ming dynasties. Source text: *Daoist Canon of the Zhengtong Era*, Cavern Mystery Division, Category of Dignified Rituals.\n\n**Ritual Text for the Venerable Divine Merit and Wondrous Salvation True Lord**\nThe ritual proceeds according to form.\n\nWe have heard that divine immortals may be summoned, but this depends upon utmost sincerity. When purification and abstinence are solemnly observed, blessings naturally follow. How fortunate that the Great Dao, though hidden in humble abodes, grants the common people refuge in their fragile lives.\n\nWith reverence, we recall the Most High Lord of the Nine Provinces, Celestial Master, Illustrious Envoy, and True Lord of Mysterious Response, Divine Merit, and Wondrous Salvation. His heart merges with the wondrous Dao, and his person grasps the primordial chart. Proficient in the celestial patterns of astronomy and the harmonies of pitch-pipes, he penetrates the principles of primordial truth, yin and yang. He eradicates demons and banishes calamities to safeguard households and states; he inscribes talismans and dispenses medicine to revive the dead and restore the flesh. Laying down his bow and breaking his arrows, he awakened to the harm of taking life; transmuting stone into gold, he grieved over the loss of original nature. He never practiced deceptive illusions to delude others, but devoted himself to the compassionate heart of saving all beings. His towering virtue rivals heaven, and his radiant merits defy description.\n\nToday, we, [Name], devoutly follow the immortal’s model, earnestly cultivating sincerity. We burn fragrant dragon’s spittle incense to welcome the soaring crane-drawn chariot. May his divine merit swiftly manifest, and his sagely transformation swiftly arrive. Treading through colored mists and bearing vermilion banners, may he briefly depart the sublime realm of the Western Mountains; riding the pure wind, descending to this humble abode, to witness our sincere devotion from the north.\n\nWe, the assembly, take refuge and wholeheartedly praise and worship.\n\n**Invocation of the Most Pure and Perfect Heavenly Worthy**\nWith wholehearted devotion, we bow in homage to the Three Treasures—Celestial Treasure, Numinous Treasure, and Divine Treasure—and to the Three Clarities: Jade Clarity, Highest Clarity, and Great Clarity. One qi flows into form, and the Three Honored Ones respond to the world. Radiant yet silent, they speak not yet command the four seasons; pointing to form and emptiness, they act not yet transform and generate the Three Luminaries.\n\nHomage to the Heavenly Worthies of the Three Clarities and Three Realms, dwelling in the Palace of Golden Towers within the Great Primordial Heaven.\n\nWith wholehearted devotion, we bow in homage to the distant Purple-Golden Towers and the towering Azure Jade Palace. Governing the stars of the Purple Tenuity and the Seven Governors, they establish the imperial lineage of a dynasty. The Three Flowers flourish in splendor, and the Five Wefts congeal in essence. They set in motion the mechanism of creation and transformation, and wield the handle of life and death.\n\nHomage to the August Heavenly Lord of the Golden Towers, the Four Heavenly Emperors of the Great Primordial Heaven.\n\nWith wholehearted devotion, we bow in homage to one who embodies harmonious purity and perfects virtuous conduct. Without seeking fame or recognition, he concealed his brilliance and withdrew from the world; diligently accumulating merit, he cultivated the heart and nurtured his nature.\n\nVowing to bring forth an infant to aid the world, the prophecy indeed aligned with the divine birth of an immortal scion. Most sagely and most numinous, he mastered the profound and resolved all doubts.\n\nHomage to the Divine Father, the Immortal Official of the Central Marchmount, and the Divine Mother, the Auspicious Primordial Lady, the August Jade Perfected Heavenly Worthy.\n\nWith wholehearted devotion, we bow in homage to the Iron Pillar Realm of Extended Truth and the Jade Ascendant Grotto-Heaven of Soaring Victory. Here dwells the Immortal Lord of the Eastern Jin, who manifested in the ancient commandery of Nanchang. A golden phoenix bore a pearl in its beak to spout auspices, while a vermilion crow lent its form to present omens. His surpassing virtue transformed the people, setting him apart from the multitude.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.\n\nIn the carefree realm of the Western Mountain’s Blessed Land, within the Hall of Extended Truth and the Palace of Dao and Virtue, the Jade Ascendant’s title was bestowed by imperial decree of the Song dynasty. The Iron Pillar subdued demons to bless Hongdu. The prophecy of treasured omens and the words of celestial jewels aligned with the saying of earthly spirits and human prodigies. His wisdom and sagacity crowned all within the mortal realm, and the people to this day reap his beneficence.\n\nWe reverently consult the First Precept of Cultivating Perfection: \"Thou shalt not secretly scheme to harm others for personal gain.\" Reflecting deeply, we acknowledge that through countless lifetimes, we have violated this precept. Today, we bow before the Perfected Lord, beseeching mercy and repentance.\n\nWe, from boundless kalpas past, have secretly schemed and harmed others. Now, with sincerity, we wholly take refuge and prostrate before the Perfected Lord, seeking repentance.\n\nWith wholehearted devotion, we bow in homage to one whose teachings, like the Eight Treasures, are inscribed across the Nine Provinces. He demonstrated loyalty, filial piety, integrity, and prudence to all, embracing others with magnanimity and forbearance. His virtuous teachings transformed customs, and his profound wisdom, layer upon layer, established norms to rectify human relations.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.\n\nThe Eight Treasures’ teachings illuminate transformation; the timid find resolve, and the indolent are roused. Customs are transformed, human relations deepened, and from ancient times to the present, all follow the sagely teachings. Profound beyond measure, the Dao that is not the ordinary Dao defies naming. Radiant as the sun at midday, his beneficence extends to all directions, and all revere him in homage.\n\nWe reverently consult the Second Precept of the Immortal Code: \"Thou shalt not kill living beings to sate thy appetite.\" Reflecting deeply, we acknowledge that through countless lifetimes, we have violated this precept. Today, we bow before the Perfected Lord, beseeching mercy and repentance.\n\nWe, from boundless kalpas past, have committed slaughter and harmed living beings. Now, with sincerity, we wholly take refuge and prostrate before the Perfected Lord, seeking repentance.\n\nWith wholehearted devotion, we bow in homage to one who cast talismans into the waters and marked bamboo by the riverside. He relieved the suffering of the people below and aided the Supreme Emperor’s virtue of cherishing life. Not a single soul was untouched by his transformation, and all things flourished as if in perpetual spring. The ailing recovered, and the doomed were granted longevity.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.\n\nMoved by the multitude’s afflictions, he cast talismans and marked bamboo by the riverside. Assisting the Supreme Emperor’s heart of cherishing life, he diligently rescued the people from myriad hardships. His noble aim was to transform all directions, ensuring not a single being failed to thrive like spring. The doomed were granted longevity, the ailing recovered, and all dwelled in the realm of non-action and purity.\n\nWe reverently consult the Third Precept of the Immortal Code: \"Thou shalt not indulge in licentiousness to corrupt thy true nature, defiling and profaning the sacred qi.\" Reflecting deeply, we acknowledge that through countless lifetimes, we have violated this precept. Today, we bow before the Perfected Immortal, beseeching mercy and repentance.\n\nWe, from boundless kalpas past, have indulged in licentiousness and defilement, corrupting our primordial essence. Now, with sincerity, we wholly take refuge and prostrate before the Perfected Lord, seeking repentance.\n\nWith wholehearted devotion, we bow in homage to one who served as Magistrate of Lingyin, governing Jingyang. When famine struck and the people faced starvation, he pondered how to fulfill the celestial tribute. Where could funds be found? He had the people cultivate gardens to sustain themselves. Burying gold to command the hoe, he enabled them to sell grain and meet their obligations.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.\n\nServing as Magistrate of Jingyang, he could not bear the people’s suffering and willingly took on the burden. When drought struck, how could he rest? He fretted over the celestial tribute, for the people had no grain. Burying gold in the earth, he set them to work with hoes in the fields. Those who unearthed the treasure sold grain, fulfilling their duties as expected.\n\nWe reverently consult the Fourth Precept of the Immortal Code: \"Thou shalt not undermine others’ achievements or sever bonds of kinship.\" Reflecting deeply, we acknowledge that through countless lifetimes, we have violated this precept. Today, we bow before the Perfected Immortal, beseeching mercy and repentance.\n\nWe, from boundless kalpas past, have undermined others’ achievements and severed bonds of kinship. Now, with sincerity, we wholly take refuge and prostrate before the Perfected Lord, seeking repentance.\n\nWith wholehearted devotion, we bow in homage to one who hung his official cap in the Red County and sought traces in Danyang. Disdaining fame and profit that ensnare men, he transmitted the Dao and its arts to save the world. He presented himself to Mother Shen, weaving brocade to convey sincerity. Instructing the Enlightened King, he erected an altar to transmit the Dharma.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.\n\nHanging his cap in the Red County, he refused office to transmit the Dao and its methods for the people’s salvation. Presenting himself to Mother Shen, he wove brocade to convey sincerity. Instructing the Enlightened King, he prearranged the teachings. The precious scriptures of the Golden Elixir and wondrous secrets, bronze talismans, iron charters, and sacred texts—all were personally received. Wielding the Great Sword of three feet, he vowed to eradicate demonic influences without exception.\n\nWe reverently consult the Fifth Precept of the Immortal Code: \"Thou shalt not slander the worthy or flaunt thy talents to exalt thyself.\" Reflecting deeply, we acknowledge that through countless lifetimes, we have violated this precept. Today, we bow before the Perfected Lord, beseeching mercy and repentance.\n\nWe, from boundless kalpas past, have flaunted our talents and slandered the worthy. Now, with sincerity, we wholly take refuge and prostrate before the Perfected Lord, seeking repentance.\n\nWith wholehearted devotion, we bow in homage to one who ranked among the Grand Historians, foremost among the host of immortals. All spoke of the accumulation of three thousand deeds, yet who recognized the seven hundred years of cultivation? Thus, the Jade Emperor elevated him to the Golden Gate, where he secretly wielded the pivot of creation, jointly upholding the work of transformation.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.\n\nSeven hundred years of refining wondrous deeds—\nhis whole household ascended to the Three Heavens.\nThe Jade Emperor sent a flying edict, bestowing the title of Capital Immortal;\nthe Golden Palace proclaimed grace, appointing him Great Envoy.\nHe turned the pivot of creation, bearing secret decrees,\nwielding the power of transformation to shift yin and yang.\nProtecting households and pacifying the realm, his benefits boundless—\neven grasses, trees, and crawling creatures danced in joy.\n\nAccording to the sixth precept of the Immortal Code: *Thou shalt not overindulge in wine nor consume forbidden meats.*\nWe reflect that through many lives past, we have violated this precept. Now, we prostrate before the Perfected Lord, seeking mercy and repentance.\n\nWe, from boundless kalpas past, have broken precepts by consuming meat and wine.\nNow, with sincerity, we wholly take refuge and prostrate before the Perfected Lord, seeking repentance.\n\nWith wholehearted devotion, we bow in homage to one whose divine power defies measure, whose sagely transformation knows no end.\nHe cut paper to fashion oxen, driving away water disasters;\nhe transformed charcoal into a woman, testing his disciples.\nHe summoned dragons, ferrying boats past Jinling;\nhe captured flood dragons, nailing them to stone cliffs.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.\n\nHis vast divine might is beyond compare,\nhis countless transformations without limit.\nHe transformed charcoal into a woman to select disciples,\ncut paper to fashion oxen to drive away water disasters.\nWith iron nails, he pinned flood dragons to stone cliffs;\nhe summoned dragons, ferrying boats past Jinling.\nBoatmen, startled by the encounter, gained longevity—\neven the Purple Empyrean Peak grew ever more resplendent.\n\nAccording to the seventh precept of the Immortal Code: *Thou shalt not be insatiably greedy, hoarding wealth without bestowing.*\nWe reflect that through many lives past, we have violated this precept. Now, we prostrate before the Perfected Lord, seeking mercy and repentance.\n\nWe, from boundless kalpas past, have been miserly and hoarding, refusing to bestow kindness.\nNow, with sincerity, we wholly take refuge and prostrate before the Perfected Lord, seeking repentance.\n\nWith wholehearted devotion, we bow in homage to one whose true and constant virtue is pure as water, whose wondrous efficacy moves swiftly as the wind.\nHe cast iron pillars to suppress demons,\nreturned a golden lampstand to its rightful owner.\nCypress leaves hung upside down, pines pressed upon crumbling dikes—\nthe Seven Tranquilities endure, the Eight Wastelands forever rely.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.\n\nHis true and constant virtue is clear as still water,\nhis wondrous efficacy swift as the wind.\nReturning the lampstand to its owner, he ensured their well-being;\ncasting iron nails to bind flood dragons, he quelled calamity.\nPines pressing upon crumbling dikes remain on the cliffs,\ncypress leaves hanging upside down stand in the courtyard.\nEstablishing the Seven Tranquilities along the cultivated rivers,\nhe brought official glory and ever-growing prosperity to the people.\n\nAccording to the eighth precept of the Immortal Code: *Thou shalt not associate with the unworthy nor dwell in filth and disorder.*\nWe reflect that through many lives past, we have violated this precept. Now, we prostrate before the Perfected Immortal, seeking mercy and repentance.\n\nWe, from boundless kalpas past, have dwelled in impurity and befriended the unworthy.\nNow, with sincerity, we wholly take refuge and prostrate before the Perfected Lord, seeking repentance.\n\nWith wholehearted devotion, we bow in homage to one who offered cinnabar at Mofu,\ntempered his sword at Meishan.\nHe subdued the giant serpent that spewed venom to the heavens,\npitying the people who, desperate for safety, had nowhere to turn.\nHe commanded soldiers and officials to search its lair,\nsummoned thunder and wind to strike and subdue.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.\n\nAt Mofu, he offered cinnabar to repay the Emperor’s virtue;\nat Meishan, he tempered his sword to sharpen his heroic edge.\nThe giant serpent spewed poisonous vapors to the heavens,\nthe people’s cries of distress shook the earth.\nWith a whistle, he commanded thunder to drive it from its den;\nwith a gesture, he directed soldiers to erase its traces.\nTo this day, its bones form an isle—\nall to rid the people of this venomous scourge.\n\nAccording to the ninth precept of the Immortal Code: *Thou shalt not be disloyal, unfilial, unrighteous, or unkind.*\nWe reflect that through many lives past, we have violated this precept. Now, we prostrate before the Perfected Lord, seeking mercy and repentance.\n\nWe, from boundless kalpas past, have been disloyal and unfilial, forsaking lord and kin.\nNow, with sincerity, we wholly take refuge and prostrate before the Perfected Lord, seeking repentance.\n\nWith wholehearted devotion, we bow in homage to one who, when years of drought arose,\npitied the living beings.\nHe summoned clouds from the southern shores,\ninstantly bringing rain from the western mountains.\nThus, the five grains filled the granaries,\nand all nations rejoiced.\nTimes were harmonious, years abundant—\nhouseholds prospered, people were content.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.\n\nThough floods, droughts, and disasters are fated by number,\nthe Great Immortal pitied his homeland’s people.\nAt the first scent of incense in silent prayer,\nhe sent three days of torrential rain.\nThe year’s harvest reached its finest ripeness,\nand the common folk rejoiced.\nFeasting and dancing, they delighted in the era of Yao—\nwho would not sing praises of the true sagely transformation?\n\nAccording to the tenth precept of the Immortal Code: *Thou shalt not speak or laugh carelessly, nor act contrary to truth.*\nWe reflect that through many lives past, we have violated this precept. Now, we prostrate before the Perfected Lord, seeking mercy and repentance.\n\nWe, from boundless kalpas past, have spoken carelessly and acted contrary to truth.\nNow, with sincerity, we wholly take refuge and prostrate before the Perfected Lord, seeking repentance.\n\nWith wholehearted devotion, we bow in homage to the senior disciples of the immortal gate,\nthe illustrious kin of the true lineage.\nMother Shen, the guiding teacher,\nLord Lan, the supreme sage.\nThe true lords of the Three Palaces of Sun, Moon, and Dipper;\nthe five hundred spirit officials of Wind, Thunder, and Lightning.\nThe assembled perfected immortals of Yan Zhen’s blessed land,\nthe various lords of the Great Release Grotto-Heaven.\nSword-bearing jade maidens,\ngolden youths to left and right.\nSome hold tablets to lead the way,\nothers drive chariots from behind.\nJade ornaments clink as they march,\nbanners shimmer as they fill the sky.\nEach bears a heart of joy,\ntogether bestowing protective power.\nUniversally enhancing majesty and virtue,\njointly attaining the subtle and formless.\nDelivering all sentient beings,\nrealizing the supreme Dao.\n\nWe bow our heads, taking refuge in the peerless Dao—\nthe Great Compassionate One upon Jade Capital Mountain.\nNow, we prostrate before the true immortals,\nseeking repentance for boundless transgressions of bodily karma.\n\nWe bow our heads, taking refuge in the true and orthodox teaching—\nthe thirty-six divisions of the Great Vehicle scriptures.\nNow, we prostrate before the Perfected Lord,\nseeking repentance for boundless transgressions of verbal karma.\n\nWe bow our heads, taking refuge in the host of masters and companions—\nthe great immortals who have attained the Dao across the ten directions.\nNow, we prostrate before the Perfected Lord,\nseeking repentance for boundless transgressions of mental karma.\n\nWe bow our heads, having taken refuge in the Three Treasures,\nand completed our obeisance to the Perfected Lord in full.\nNow, we vow together with all sentient beings\nto jointly realize the subtle and formless supreme Dao.\n\nWith single-minded devotion, we make our vows:\nMay our eyes ever behold the sages of the three realms,\nmay our ears ever hear the wondrous sounds of the Dharma,\nmay our noses ever inhale the fragrance of virtue and power,\nmay our mouths never crave pungent or foul flavors,\nmay our bodies diligently practice the true Dao,\nmay our minds cease grasping at objects of desire.\n\nBefore the great immortals, we now make our vows,\nthat in days to come we may attain the sacred fruit.\nHaving made our vows, we bow in reverence,\nto the Three Treasures that realize the supreme truth.\n\nThe rites of obeisance to the Perfected Lord now complete,\nall forms of reverence have been fully observed.\nThrice bathed, thrice perfumed,\nevery gesture has expressed our solemn devotion.\nWith each glance, each bow,\nwe have surely invoked his gracious response.\nThus, may the flowers of sin wither and fall,\nwhile the fruits of blessing ripen in perfection;\nmay the sprouts of goodness flourish and grow,\nwhile the roots of evil be utterly severed.\n\nNow, the jade tablets are rolled shut,\nthe golden chimes fall silent.\nThe simurgh carriage slowly returns to Jade Capital,\nthe crane-drawn chariot prepares to depart for the Golden Portal.\nWith wholehearted devotion, we send them off,\nthe nine-fold hymns rising to still the floating clouds.\nTwice we bow, offering words of eternal homage,\npraying to abide beneath the transforming sun.\nWe bow our heads, taking refuge in the boundless Great Dao.\n\nThe recitation of scriptures concludes with dedication of merit.\nThe Rites of Veneration for the Wondrous and Salvific Perfected Lord are now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "神功妙济真君礼文 经名：神功妙济真君礼文。 一卷。 编者不祥。 出于元末明初。 底本出处：《正统道藏》。 洞玄部威仪类。 神功妙济真君礼文 法事如式 伏闻神仙可格，贵在精诚，斋戒既庄，自然获福。 幸大道潜藩於故里，而下民赖庇於微生。 恭惟九州都仙太史高明大使至道玄应神功妙济真君，心融妙道，躬握元图，素精天文、律吕之书，洞达元真、阴阳之理。 除妖荡孽而保安家国，书符施药而起死回骸。 弃弓折矢悟伤生，点石化金忧返本。 不习惑人之幻术，务存济物之慈心。 巍巍盛德天可齐，皓皓厥功言莫尽。 以今某虔依仙格，谨运精诚，爇叆叇之龙涎，迓翩翻之鹤驾。 伏愿神功特达，圣化须臾，步彩雾、戴朱旗，暂别西山之胜境，乘清风，来白屋，监观北面之投诚。 众等皈依，志心赞礼。 举浄明普实天尊 志心归命礼，天宝、灵宝、神宝，玉清、上清、太清，一炁流形，三尊应世，含光默默不言而令行四时，指色空空无为而化生三景。 和大罗天上金阙宫中，虚无自然三清三境天尊。 志心归命礼，渺渺紫金阙，巍巍碧玉官。 掌紫微七政之星，作皇派一朝之主。 三华郁秀，五纬凝精。 运造化机，握生杀柄。 和大罗天上金阙宫中，昊天至尊金阙四天上帝。 志心归命礼，冲和素禀，淑行至全。 不求闻达而晦迹韬光，务积功勋而存心养性。",
      "translated_text": "**Ritual Text for the Venerable Divine Merit and Wondrous Salvation True Lord**\n\n*Scripture Title:* Ritual Text for the Venerable Divine Merit and Wondrous Salvation True Lord. One fascicle. Compiler unknown. Originated between the late Yuan and early Ming dynasties. Source text: *Daoist Canon of the Zhengtong Era*, Cavern Mystery Division, Category of Dignified Rituals.\n\n**Ritual Text for the Venerable Divine Merit and Wondrous Salvation True Lord**\nThe ritual proceeds according to form.\n\nWe have heard that divine immortals may be summoned, but this depends upon utmost sincerity. When purification and abstinence are solemnly observed, blessings naturally follow. How fortunate that the Great Dao, though hidden in humble abodes, grants the common people refuge in their fragile lives.\n\nWith reverence, we recall the Most High Lord of the Nine Provinces, Celestial Master, Illustrious Envoy, and True Lord of Mysterious Response, Divine Merit, and Wondrous Salvation. His heart merges with the wondrous Dao, and his person grasps the primordial chart. Proficient in the celestial patterns of astronomy and the harmonies of pitch-pipes, he penetrates the principles of primordial truth, yin and yang. He eradicates demons and banishes calamities to safeguard households and states; he inscribes talismans and dispenses medicine to revive the dead and restore the flesh. Laying down his bow and breaking his arrows, he awakened to the harm of taking life; transmuting stone into gold, he grieved over the loss of original nature. He never practiced deceptive illusions to delude others, but devoted himself to the compassionate heart of saving all beings. His towering virtue rivals heaven, and his radiant merits defy description.\n\nToday, we, [Name], devoutly follow the immortal’s model, earnestly cultivating sincerity. We burn fragrant dragon’s spittle incense to welcome the soaring crane-drawn chariot. May his divine merit swiftly manifest, and his sagely transformation swiftly arrive. Treading through colored mists and bearing vermilion banners, may he briefly depart the sublime realm of the Western Mountains; riding the pure wind, descending to this humble abode, to witness our sincere devotion from the north.\n\nWe, the assembly, take refuge and wholeheartedly praise and worship.\n\n**Invocation of the Most Pure and Perfect Heavenly Worthy**\nWith wholehearted devotion, we bow in homage to the Three Treasures—Celestial Treasure, Numinous Treasure, and Divine Treasure—and to the Three Clarities: Jade Clarity, Highest Clarity, and Great Clarity. One qi flows into form, and the Three Honored Ones respond to the world. Radiant yet silent, they speak not yet command the four seasons; pointing to form and emptiness, they act not yet transform and generate the Three Luminaries.\n\nHomage to the Heavenly Worthies of the Three Clarities and Three Realms, dwelling in the Palace of Golden Towers within the Great Primordial Heaven.\n\nWith wholehearted devotion, we bow in homage to the distant Purple-Golden Towers and the towering Azure Jade Palace. Governing the stars of the Purple Tenuity and the Seven Governors, they establish the imperial lineage of a dynasty. The Three Flowers flourish in splendor, and the Five Wefts congeal in essence. They set in motion the mechanism of creation and transformation, and wield the handle of life and death.\n\nHomage to the August Heavenly Lord of the Golden Towers, the Four Heavenly Emperors of the Great Primordial Heaven.\n\nWith wholehearted devotion, we bow in homage to one who embodies harmonious purity and perfects virtuous conduct. Without seeking fame or recognition, he concealed his brilliance and withdrew from the world; diligently accumulating merit, he cultivated the heart and nurtured his nature.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 526,
      "start_sentence": 0,
      "end_sentence": 28,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.799890756607056,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\神功妙济真君礼文.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "誓产婴儿而佐世，果符仙嗣之挺生。 至圣至灵，克岐克疑。 和仙父中岳仙官、仙母符瑞元君高上玉真天尊。 志心归命礼，铁柱延真福地，玉隆腾胜洞天。 有东晋之仙君，显南昌之故郡。 金凤衔珠而吐瑞，赤乌寄质以呈祥。 令德化民，出群拔萃。 和九天仙主万法宗师至道玄应神功妙济真君。 西山福地逍遥境，督府延真道德宫。 玉隆纪号宋朝颁，铁柱斩妖洪都福。 果谶物华天宝语，更符人杰地灵言。 聪明睿智冠群伦，民到于今受其赐。 谨按修真第一戒云：不得阴盗潜谋，害物利己。 切念某多生以来，曾犯此戒，今礼真君，求哀忏悔。 臣等自从无量劫，潜谋阴贼害於人。 以今运诚悉归依，朝礼真君求忏悔。 志心归命礼，训留八宝，名镂九州。 忠孝廉谨以示人，宽裕容忍而接物，美教化而移风俗。 玄之又玄，垂宪言以正人伦，道非常道和九天仙主万法宗师至道玄应神功妙济真君。 八宝训留彰教化，懦夫立志薄夫敦。 移风易俗厚人伦，亘古从今遵圣教。 玄之又玄何可拟，道非常道更难名。 端如丽日耀中天，泽被万方咸拱仰。 谨按仙科第二戒云：不得杀害众生，以充滋味。 切念某多生以来，曾犯此戒。 今礼真君，求哀忏悔。 臣等自从无量劫，犯於杀戮虐众生。 以今运诚悉归依，朝礼真君求忏悔。 志心归命礼，沉符水浒，标竹江滨。 救下民疾苦之忧，助上帝好生之德。 无一夫不被其化，使万物常以如春。 病者自廖，夭者使寿。 和九天仙主万法宗师至道玄应神功妙济真君。 哀悯群氓多疾苦，沉符标竹向江滨。 助施上帝好生心，务救下民多厄难。 贵使万方皆被化，毋令一物不常春。 夭者寿而病者廖，咸处无为清静地。 谨按仙科第三戒云：不得淫邪败真，秽慢灵炁。 切念某多生以来，曾犯此戒。 今礼真仙，求哀忏悔。 臣等自从无量劫，淫邪秽浊败真元。 以今运诚悉归依，朝礼真君求忏悔。 志心归命礼，官居令尹职，署旌阳。 值岁饥而民不聊生，供天租而计从何出。 揆钱安得，俾治圃以服勤。 瘗金令锄，将货粟而转纳。 和九天仙主万法宗师至道玄应神功妙济真君。 官居令尹旌阳县，不忍人心自乐推。 适逢岁旱敢遑安，每虑天租何所出。 民不料生乌有粟，瘗金向土役锄园。 令其获宝货诸人，应物自期来送纳。 谨按仙科第四戒云：不得败人成功，离交析亲。 切念某多生以来，曾犯此戒，今礼真仙，求哀忏悔。 臣等自从无量劫，败人成功析离亲。 以今运诚悉归依，朝礼真君求忏悔。 志心归命礼，挂冠赤县，访迹丹阳。 厌名利以汩人，传道术而济世。 师投谌母，乃制锦以通诚。 教授明王，即筑坛而度法。 和九天仙主万法宗师至道玄应神功妙济真君。 赤县挂冠应不仕，故传道法济斯民。 师投谌母锦通诚，教授明王言预谱。 宝诰金丹并妙诀，铜符铁券暨灵文。 大阿三尺并亲承，誓断妖邪无憔类。 谨按仙科第五戒云：不得谗毁贤良，露才扬己。 伏念某多生以来，曾犯此戒，今礼真君，求哀忏悔。 臣等自从无量劫，露才扬己毁贤良。 以今运诚悉归依，朝礼真君求忏悔。 志心归命礼，班高太史，位冠都仙。 皆云三千行之积求，孰识七百年之修炼。 是宜玉帝擢入金门，密运枢机，同扶造化。 和九天仙主万法宗师至道玄应神功妙济真君。",
      "translated_text": "Vowing to bring forth an infant to aid the world, the prophecy indeed aligned with the divine birth of an immortal scion. Most sagely and most numinous, he mastered the profound and resolved all doubts.\n\nHomage to the Divine Father, the Immortal Official of the Central Marchmount, and the Divine Mother, the Auspicious Primordial Lady, the August Jade Perfected Heavenly Worthy.\n\nWith wholehearted devotion, we bow in homage to the Iron Pillar Realm of Extended Truth and the Jade Ascendant Grotto-Heaven of Soaring Victory. Here dwells the Immortal Lord of the Eastern Jin, who manifested in the ancient commandery of Nanchang. A golden phoenix bore a pearl in its beak to spout auspices, while a vermilion crow lent its form to present omens. His surpassing virtue transformed the people, setting him apart from the multitude.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.\n\nIn the carefree realm of the Western Mountain’s Blessed Land, within the Hall of Extended Truth and the Palace of Dao and Virtue, the Jade Ascendant’s title was bestowed by imperial decree of the Song dynasty. The Iron Pillar subdued demons to bless Hongdu. The prophecy of treasured omens and the words of celestial jewels aligned with the saying of earthly spirits and human prodigies. His wisdom and sagacity crowned all within the mortal realm, and the people to this day reap his beneficence.\n\nWe reverently consult the First Precept of Cultivating Perfection: \"Thou shalt not secretly scheme to harm others for personal gain.\" Reflecting deeply, we acknowledge that through countless lifetimes, we have violated this precept. Today, we bow before the Perfected Lord, beseeching mercy and repentance.\n\nWe, from boundless kalpas past, have secretly schemed and harmed others. Now, with sincerity, we wholly take refuge and prostrate before the Perfected Lord, seeking repentance.\n\nWith wholehearted devotion, we bow in homage to one whose teachings, like the Eight Treasures, are inscribed across the Nine Provinces. He demonstrated loyalty, filial piety, integrity, and prudence to all, embracing others with magnanimity and forbearance. His virtuous teachings transformed customs, and his profound wisdom, layer upon layer, established norms to rectify human relations.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.\n\nThe Eight Treasures’ teachings illuminate transformation; the timid find resolve, and the indolent are roused. Customs are transformed, human relations deepened, and from ancient times to the present, all follow the sagely teachings. Profound beyond measure, the Dao that is not the ordinary Dao defies naming. Radiant as the sun at midday, his beneficence extends to all directions, and all revere him in homage.\n\nWe reverently consult the Second Precept of the Immortal Code: \"Thou shalt not kill living beings to sate thy appetite.\" Reflecting deeply, we acknowledge that through countless lifetimes, we have violated this precept. Today, we bow before the Perfected Lord, beseeching mercy and repentance.\n\nWe, from boundless kalpas past, have committed slaughter and harmed living beings. Now, with sincerity, we wholly take refuge and prostrate before the Perfected Lord, seeking repentance.\n\nWith wholehearted devotion, we bow in homage to one who cast talismans into the waters and marked bamboo by the riverside. He relieved the suffering of the people below and aided the Supreme Emperor’s virtue of cherishing life. Not a single soul was untouched by his transformation, and all things flourished as if in perpetual spring. The ailing recovered, and the doomed were granted longevity.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.\n\nMoved by the multitude’s afflictions, he cast talismans and marked bamboo by the riverside. Assisting the Supreme Emperor’s heart of cherishing life, he diligently rescued the people from myriad hardships. His noble aim was to transform all directions, ensuring not a single being failed to thrive like spring. The doomed were granted longevity, the ailing recovered, and all dwelled in the realm of non-action and purity.\n\nWe reverently consult the Third Precept of the Immortal Code: \"Thou shalt not indulge in licentiousness to corrupt thy true nature, defiling and profaning the sacred qi.\" Reflecting deeply, we acknowledge that through countless lifetimes, we have violated this precept. Today, we bow before the Perfected Immortal, beseeching mercy and repentance.\n\nWe, from boundless kalpas past, have indulged in licentiousness and defilement, corrupting our primordial essence. Now, with sincerity, we wholly take refuge and prostrate before the Perfected Lord, seeking repentance.\n\nWith wholehearted devotion, we bow in homage to one who served as Magistrate of Lingyin, governing Jingyang. When famine struck and the people faced starvation, he pondered how to fulfill the celestial tribute. Where could funds be found? He had the people cultivate gardens to sustain themselves. Burying gold to command the hoe, he enabled them to sell grain and meet their obligations.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.\n\nServing as Magistrate of Jingyang, he could not bear the people’s suffering and willingly took on the burden. When drought struck, how could he rest? He fretted over the celestial tribute, for the people had no grain. Burying gold in the earth, he set them to work with hoes in the fields. Those who unearthed the treasure sold grain, fulfilling their duties as expected.\n\nWe reverently consult the Fourth Precept of the Immortal Code: \"Thou shalt not undermine others’ achievements or sever bonds of kinship.\" Reflecting deeply, we acknowledge that through countless lifetimes, we have violated this precept. Today, we bow before the Perfected Immortal, beseeching mercy and repentance.\n\nWe, from boundless kalpas past, have undermined others’ achievements and severed bonds of kinship. Now, with sincerity, we wholly take refuge and prostrate before the Perfected Lord, seeking repentance.\n\nWith wholehearted devotion, we bow in homage to one who hung his official cap in the Red County and sought traces in Danyang. Disdaining fame and profit that ensnare men, he transmitted the Dao and its arts to save the world. He presented himself to Mother Shen, weaving brocade to convey sincerity. Instructing the Enlightened King, he erected an altar to transmit the Dharma.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.\n\nHanging his cap in the Red County, he refused office to transmit the Dao and its methods for the people’s salvation. Presenting himself to Mother Shen, he wove brocade to convey sincerity. Instructing the Enlightened King, he prearranged the teachings. The precious scriptures of the Golden Elixir and wondrous secrets, bronze talismans, iron charters, and sacred texts—all were personally received. Wielding the Great Sword of three feet, he vowed to eradicate demonic influences without exception.\n\nWe reverently consult the Fifth Precept of the Immortal Code: \"Thou shalt not slander the worthy or flaunt thy talents to exalt thyself.\" Reflecting deeply, we acknowledge that through countless lifetimes, we have violated this precept. Today, we bow before the Perfected Lord, beseeching mercy and repentance.\n\nWe, from boundless kalpas past, have flaunted our talents and slandered the worthy. Now, with sincerity, we wholly take refuge and prostrate before the Perfected Lord, seeking repentance.\n\nWith wholehearted devotion, we bow in homage to one who ranked among the Grand Historians, foremost among the host of immortals. All spoke of the accumulation of three thousand deeds, yet who recognized the seven hundred years of cultivation? Thus, the Jade Emperor elevated him to the Golden Gate, where he secretly wielded the pivot of creation, jointly upholding the work of transformation.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.",
      "overlap_context": "n motion the mechanism of creation and transformation, and wield the handle of life and death.\n\nHomage to the August Heavenly Lord of the Golden Towers, the Four Heavenly Emperors of the Great Primordial Heaven.\n\nWith wholehearted devotion, we bow in homage to one who embodies harmonious purity and perfects virtuous conduct. Without seeking fame or recognition, he concealed his brilliance and withdrew from the world; diligently accumulating merit, he cultivated the heart and nurtured his nature.",
      "start_char": 526,
      "end_char": 1796,
      "start_sentence": 29,
      "end_sentence": 100,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.02232336997986,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\神功妙济真君礼文.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "七百余年修妙行，全家拔宅上三天。 玉皇飞诏赐都仙，金阙宣恩兼大使。 斡运枢机承密旨，权行造化转阴阳。 保家安国利无穷，草木昆虫咸鼓舞。 谨按仙科第六戒云：不得饮酒过多，食荤违禁。 伏念某多生以来曾犯此戒，今礼真君，求哀忏悔。 臣等自从无量劫，食荤饮酒戒常违。 以今运诚悉归依，朝礼真君求忏悔。 志心归命礼，神功莫测，圣化无穷。 剪纸作牛，驱除水孽。 化炭为妇，历试门人。 呼龙挟舫过金陵，擒蛟钉丁悬石壁。 和九天仙主万法宗师至道玄应神功妙济真君。 广大神通难比喻，亿千变化更无穷。 化炭为妇选门人，剪纸作牛驱水孽。 以铁钉蛟悬石壁，召龙挟舫过金陵。 舟人骇遇获长生，亦使紫霄峰愈盛。 谨按仙科第七戒云：不得贪求无厌，积财不施。 伏念某多生以来，曾犯此戒，今礼真君，求哀忏悔。 臣等自从无量劫，怪责鄙吝不施恩。 以今运诚悉归依，朝礼真君求忏悔。 志心归命礼，真常德性，妙用随机。 铸铁柱以镇妖，赍金檠而还主。 栢垂倒叶，松压溃堤。 七靖沿存，八荒永赖。 和九天仙主万法宗师至道玄应神功妙济真君。 真常德性澄如水，妙用随机疾若风。 赍檠还主示其康，铸铁钉绞思弭患。 松压溃堤犹在壁，栢垂倒叶正当庭。 立斯七靖向修川，亦使官荣民益盛。 谨按仙科第八戒云：不得交友非贤，居处秽杂。 伏念某多生以来，曾犯此戒，今礼真仙，求哀忏悔。 臣等自从无量劫，居处不洁友非贤。 以今运诚悉归依，朝礼具君求忏悔。 志心归命礼，祭丹幕阜，淬剑梅山。 正巨蛇，吐气以冲天，怜群氓惜身而无地。 指挥兵吏，探巢穴以搜逻。 啸命雷霆，运火风而击伐。 和九天仙主万法宗师至道玄应神功妙济真君。 幕阜祭丹酬帝德，梅山淬剑砺英锋。 巨蛇吐毒气冲天，百姓求哀声动地。 啸命雷霆驱出穴，指挥兵史灭其踪。 至今骸骨积成洲，端为万民除毒害。 谨按仙科第九戒云：不得不忠不孝，不义不仁。 伏念某多生以来，曾犯此戒，今礼真君，求哀忏悔。 臣等自从无量劫，不忠不孝背君亲。 以今运诚悉归依，朝礼真君求忏悔。 志心归命礼，时逢岁旱，仙悯生灵。 即飞南浦之云，立降西山之雨。 俾五谷以登廪，使万国以欢心。 时和岁丰，家给人足。 和九天仙主万法宗师至道玄应神功妙济真君。 水旱凶荒虽数定，大仙多悯故乡人。 才闻默祷一炉香，立降霶三日雨。 年谷遂令臻上熟，黎元於此尽欢心。 含餔鼓舞乐尧天，孰不讴歌真圣化。 谨按仙科第十戒云：不得轻忽言笑，举动乖真。 伏念某多生以来，曾犯此戒，今礼真君，求哀忏悔。 臣等自从无量劫，言辞轻慢举乖真。 以今运诚悉皈依，朝礼真君求忏悔。 志心归命礼，仙门高弟，真眷华宗。 谌母导师，兰公上圣。 日、月、斗三宫真宰。 风、雷、电五百灵官。 延真福地众真仙，大释洞天诸主宰。 剑印玉女，左右金童。 或执节以导前，或御车而在后。 珂佩珊珊而步武，旌旗闪闪以排空。 各生欢喜之心，同赐护持之力。 普增威德，共证希夷。 度诸有情，证无上道。 举十方灵宝天尊 稽首皈依无上道，玉京山上大慈尊，臣今朝礼对真仙，身业无边求忏悔。 稽首皈依正真教，三十六部大乘经，臣今朝礼对真君，口业无边求忏悔。",
      "translated_text": "Seven hundred years of refining wondrous deeds—\nhis whole household ascended to the Three Heavens.\nThe Jade Emperor sent a flying edict, bestowing the title of Capital Immortal;\nthe Golden Palace proclaimed grace, appointing him Great Envoy.\nHe turned the pivot of creation, bearing secret decrees,\nwielding the power of transformation to shift yin and yang.\nProtecting households and pacifying the realm, his benefits boundless—\neven grasses, trees, and crawling creatures danced in joy.\n\nAccording to the sixth precept of the Immortal Code: *Thou shalt not overindulge in wine nor consume forbidden meats.*\nWe reflect that through many lives past, we have violated this precept. Now, we prostrate before the Perfected Lord, seeking mercy and repentance.\n\nWe, from boundless kalpas past, have broken precepts by consuming meat and wine.\nNow, with sincerity, we wholly take refuge and prostrate before the Perfected Lord, seeking repentance.\n\nWith wholehearted devotion, we bow in homage to one whose divine power defies measure, whose sagely transformation knows no end.\nHe cut paper to fashion oxen, driving away water disasters;\nhe transformed charcoal into a woman, testing his disciples.\nHe summoned dragons, ferrying boats past Jinling;\nhe captured flood dragons, nailing them to stone cliffs.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.\n\nHis vast divine might is beyond compare,\nhis countless transformations without limit.\nHe transformed charcoal into a woman to select disciples,\ncut paper to fashion oxen to drive away water disasters.\nWith iron nails, he pinned flood dragons to stone cliffs;\nhe summoned dragons, ferrying boats past Jinling.\nBoatmen, startled by the encounter, gained longevity—\neven the Purple Empyrean Peak grew ever more resplendent.\n\nAccording to the seventh precept of the Immortal Code: *Thou shalt not be insatiably greedy, hoarding wealth without bestowing.*\nWe reflect that through many lives past, we have violated this precept. Now, we prostrate before the Perfected Lord, seeking mercy and repentance.\n\nWe, from boundless kalpas past, have been miserly and hoarding, refusing to bestow kindness.\nNow, with sincerity, we wholly take refuge and prostrate before the Perfected Lord, seeking repentance.\n\nWith wholehearted devotion, we bow in homage to one whose true and constant virtue is pure as water, whose wondrous efficacy moves swiftly as the wind.\nHe cast iron pillars to suppress demons,\nreturned a golden lampstand to its rightful owner.\nCypress leaves hung upside down, pines pressed upon crumbling dikes—\nthe Seven Tranquilities endure, the Eight Wastelands forever rely.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.\n\nHis true and constant virtue is clear as still water,\nhis wondrous efficacy swift as the wind.\nReturning the lampstand to its owner, he ensured their well-being;\ncasting iron nails to bind flood dragons, he quelled calamity.\nPines pressing upon crumbling dikes remain on the cliffs,\ncypress leaves hanging upside down stand in the courtyard.\nEstablishing the Seven Tranquilities along the cultivated rivers,\nhe brought official glory and ever-growing prosperity to the people.\n\nAccording to the eighth precept of the Immortal Code: *Thou shalt not associate with the unworthy nor dwell in filth and disorder.*\nWe reflect that through many lives past, we have violated this precept. Now, we prostrate before the Perfected Immortal, seeking mercy and repentance.\n\nWe, from boundless kalpas past, have dwelled in impurity and befriended the unworthy.\nNow, with sincerity, we wholly take refuge and prostrate before the Perfected Lord, seeking repentance.\n\nWith wholehearted devotion, we bow in homage to one who offered cinnabar at Mofu,\ntempered his sword at Meishan.\nHe subdued the giant serpent that spewed venom to the heavens,\npitying the people who, desperate for safety, had nowhere to turn.\nHe commanded soldiers and officials to search its lair,\nsummoned thunder and wind to strike and subdue.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.\n\nAt Mofu, he offered cinnabar to repay the Emperor’s virtue;\nat Meishan, he tempered his sword to sharpen his heroic edge.\nThe giant serpent spewed poisonous vapors to the heavens,\nthe people’s cries of distress shook the earth.\nWith a whistle, he commanded thunder to drive it from its den;\nwith a gesture, he directed soldiers to erase its traces.\nTo this day, its bones form an isle—\nall to rid the people of this venomous scourge.\n\nAccording to the ninth precept of the Immortal Code: *Thou shalt not be disloyal, unfilial, unrighteous, or unkind.*\nWe reflect that through many lives past, we have violated this precept. Now, we prostrate before the Perfected Lord, seeking mercy and repentance.\n\nWe, from boundless kalpas past, have been disloyal and unfilial, forsaking lord and kin.\nNow, with sincerity, we wholly take refuge and prostrate before the Perfected Lord, seeking repentance.\n\nWith wholehearted devotion, we bow in homage to one who, when years of drought arose,\npitied the living beings.\nHe summoned clouds from the southern shores,\ninstantly bringing rain from the western mountains.\nThus, the five grains filled the granaries,\nand all nations rejoiced.\nTimes were harmonious, years abundant—\nhouseholds prospered, people were content.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.\n\nThough floods, droughts, and disasters are fated by number,\nthe Great Immortal pitied his homeland’s people.\nAt the first scent of incense in silent prayer,\nhe sent three days of torrential rain.\nThe year’s harvest reached its finest ripeness,\nand the common folk rejoiced.\nFeasting and dancing, they delighted in the era of Yao—\nwho would not sing praises of the true sagely transformation?\n\nAccording to the tenth precept of the Immortal Code: *Thou shalt not speak or laugh carelessly, nor act contrary to truth.*\nWe reflect that through many lives past, we have violated this precept. Now, we prostrate before the Perfected Lord, seeking mercy and repentance.\n\nWe, from boundless kalpas past, have spoken carelessly and acted contrary to truth.\nNow, with sincerity, we wholly take refuge and prostrate before the Perfected Lord, seeking repentance.\n\nWith wholehearted devotion, we bow in homage to the senior disciples of the immortal gate,\nthe illustrious kin of the true lineage.\nMother Shen, the guiding teacher,\nLord Lan, the supreme sage.\nThe true lords of the Three Palaces of Sun, Moon, and Dipper;\nthe five hundred spirit officials of Wind, Thunder, and Lightning.\nThe assembled perfected immortals of Yan Zhen’s blessed land,\nthe various lords of the Great Release Grotto-Heaven.\nSword-bearing jade maidens,\ngolden youths to left and right.\nSome hold tablets to lead the way,\nothers drive chariots from behind.\nJade ornaments clink as they march,\nbanners shimmer as they fill the sky.\nEach bears a heart of joy,\ntogether bestowing protective power.\nUniversally enhancing majesty and virtue,\njointly attaining the subtle and formless.\nDelivering all sentient beings,\nrealizing the supreme Dao.\n\nWe bow our heads, taking refuge in the peerless Dao—\nthe Great Compassionate One upon Jade Capital Mountain.\nNow, we prostrate before the true immortals,\nseeking repentance for boundless transgressions of bodily karma.\n\nWe bow our heads, taking refuge in the true and orthodox teaching—\nthe thirty-six divisions of the Great Vehicle scriptures.\nNow, we prostrate before the Perfected Lord,\nseeking repentance for boundless transgressions of verbal karma.",
      "overlap_context": "torians, foremost among the host of immortals. All spoke of the accumulation of three thousand deeds, yet who recognized the seven hundred years of cultivation? Thus, the Jade Emperor elevated him to the Golden Gate, where he secretly wielded the pivot of creation, jointly upholding the work of transformation.\n\nHomage to the August Heavenly Lord of the Nine Heavens, the Master of Myriad Methods, the Wondrously Responsive Divine Merit and Marvelously Efficacious Perfected Lord of the Supreme Dao.",
      "start_char": 1797,
      "end_char": 3063,
      "start_sentence": 101,
      "end_sentence": 174,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.19082808494568,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\神功妙济真君礼文.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "稽首皈依师友众，十方得道大神仙，臣今朝礼对真君，意业无边求忏悔。 稽首皈依三宝已，朝礼真君悉周圆。 臣今愿共诸众生，同证希夷无上道。 举志心发愿 愿眼常观三界圣，愿耳常闻妙法音，愿鼻常闻道德香，愿口不养辛厌味，愿身精进行真道，愿意休攀有想缘。 臣今发愿大仙前，异日他时臻圣果。 发愿已归命礼，无上证真三宝。 向来礼赞真君，仪范悉已周圆，三沐三熏，曲尽齐庄之敬。 一瞻一礼，必蒙感格之私。 俾罪花凋落而福果圆成，致善芽增长而恶根断绝。 今则琼科卷轴，金磬停敲，鸾舆渐返於玉京，鹤驾将还於金阙。 一心奉送，九章歌声遏浮云。 再拜致辞亿万年，愿依化日，稽首皈依无极大道。 讽经　回向 神功妙济真君礼文竟",
      "translated_text": "We bow our heads, taking refuge in the host of masters and companions—\nthe great immortals who have attained the Dao across the ten directions.\nNow, we prostrate before the Perfected Lord,\nseeking repentance for boundless transgressions of mental karma.\n\nWe bow our heads, having taken refuge in the Three Treasures,\nand completed our obeisance to the Perfected Lord in full.\nNow, we vow together with all sentient beings\nto jointly realize the subtle and formless supreme Dao.\n\nWith single-minded devotion, we make our vows:\nMay our eyes ever behold the sages of the three realms,\nmay our ears ever hear the wondrous sounds of the Dharma,\nmay our noses ever inhale the fragrance of virtue and power,\nmay our mouths never crave pungent or foul flavors,\nmay our bodies diligently practice the true Dao,\nmay our minds cease grasping at objects of desire.\n\nBefore the great immortals, we now make our vows,\nthat in days to come we may attain the sacred fruit.\nHaving made our vows, we bow in reverence,\nto the Three Treasures that realize the supreme truth.\n\nThe rites of obeisance to the Perfected Lord now complete,\nall forms of reverence have been fully observed.\nThrice bathed, thrice perfumed,\nevery gesture has expressed our solemn devotion.\nWith each glance, each bow,\nwe have surely invoked his gracious response.\nThus, may the flowers of sin wither and fall,\nwhile the fruits of blessing ripen in perfection;\nmay the sprouts of goodness flourish and grow,\nwhile the roots of evil be utterly severed.\n\nNow, the jade tablets are rolled shut,\nthe golden chimes fall silent.\nThe simurgh carriage slowly returns to Jade Capital,\nthe crane-drawn chariot prepares to depart for the Golden Portal.\nWith wholehearted devotion, we send them off,\nthe nine-fold hymns rising to still the floating clouds.\nTwice we bow, offering words of eternal homage,\npraying to abide beneath the transforming sun.\nWe bow our heads, taking refuge in the boundless Great Dao.\n\nThe recitation of scriptures concludes with dedication of merit.\nThe Rites of Veneration for the Wondrous and Salvific Perfected Lord are now complete.",
      "overlap_context": " sentient beings,\nrealizing the supreme Dao.\n\nWe bow our heads, taking refuge in the peerless Dao—\nthe Great Compassionate One upon Jade Capital Mountain.\nNow, we prostrate before the true immortals,\nseeking repentance for boundless transgressions of bodily karma.\n\nWe bow our heads, taking refuge in the true and orthodox teaching—\nthe thirty-six divisions of the Great Vehicle scriptures.\nNow, we prostrate before the Perfected Lord,\nseeking repentance for boundless transgressions of verbal karma.",
      "start_char": 3063,
      "end_char": 3360,
      "start_sentence": 175,
      "end_sentence": 189,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.072857141494751,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\神功妙济真君礼文.txt",
        "category": "威仪类"
      }
    }
  ]
}