{
  "source_id": "离峰老人集",
  "source_file": "chunked_daozang\\离峰老人集.json",
  "total_chunks": 14,
  "total_original_chars": 15657,
  "total_translated_chars": 91660,
  "total_translation_time": 585.1263248920441,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\离峰老人集.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**Li Feng Lao Ren Ji, Volume One – Seven-Character Regulated Verse**\n\n**Title:** *Li Feng Lao Ren Ji* (Collected Works of the Old Man of Departed Peak). Composed by Jin Quanzhen Daoist Yu Daoxian. Two volumes. Source text: *Zhengtong Daozang*, Orthodox Section, Part One.\n\n**Seven-Character Regulated Verse**\n\n**Reflections**\nBy the western crags of Emerald Cliff, the Daoist’s home,\nBeyond the gate, idle fields and wildflowers grow.\nButterflies flutter—still but a dream,\nWandering bees dart—yet courtly cares remain.\nA boy in the clouds bears elixirs divine,\nWhile immortals in the void tread rainbow shine.\nIdle, I muse on red-dust seekers of fame,\nUnknowing the boundless skies within the gourd’s frame.\n\n**Again**\nVague mists veil the verdant peaks in gray,\nFalling leaves drift past the eaves this day.\nFew worldly affairs—dreams and soul are light,\nThe azure vault spans, stars sparse in the night.\nFrost chills the stream, fish refuse the bait,\nBare mountains stand, trees stripped of their state.\nThe Daoist passes days in careless ease,\nWhile outside his gate, the clamor never ceases.\n\n**Again**\nWhen will the red dust’s rush ever end?\nI wander beyond, free as the wind.\nFair waters and mountains stretch without cease,\nRare blossoms and fruits in tranquil peace.\nBreezes brush the herb garden, fragrance fine,\nMoonlight gilds the lingzhi fields in purple shine.\nLeisurely by streams and woods I hide,\nWhy fret the world’s woes, knitting the brow’s pride?\n\n**Again**\nGazing south to the mountains, loftier than the sky,\nMist-wreathed peaks rise, the heavens nigh.\nSince ancient times, immortals hide their trace,\nTo this day, feathered scholars seek long life’s grace.\nThe world’s rise and fall shift through time’s tide,\nClouds surge and fade, dark and bright abide.\nOnly the ancient pines and rugged stone remain,\nEvergreen through the seasons, unchanged, sustain.\n\n**Again**\nThe enlightened transcend life and death’s decree,\nMastering the subtle, they move with boundless glee.\nManifest—like moon unveiled through parting cloud,\nHidden—like pearl cradled in the oyster’s shroud.\nInwardly, the radiant spirit shines bright,\nFiercely, the alchemical furnace burns with light.\nForged is the golden elixir, day and night,\nTen thousand crimson flames gleam in the crystal’s sight.\n\n**Again**\nHeat departs, cold arrives—qi flows as fate,\nWest winds herald the osmanthus’ blooming state.\nTrees stand bare, birds nest in branches high,\nFrost descends, waters chill, fish dive nigh.\nCloud-bound friends from beyond the world appear,\nWhile the cave’s reclusive guest slumbers deep and clear.\nA staff of jade taps, its chime crisp and bright,\nRousing the dreamer from Huaxu’s flight.\n\n**Again**\nI do not study mysteries or seek Chan’s gate,\nA simple hut in the woods is my fate.\nHeavenly music drifts in the empty air,\nBeyond the world, the Way and virtue are my care.\nBy fragrant grasses, I sleep at ease,\nWoodcutters’ songs drift with the sunset’s breeze.\nThis body has yet to ride the phoenix away,\nSo I wander free as an earthbound immortal’s play.\n\n**On Others Mocking My Madness**\nFools laugh that I’m too wild, too strange—\nBut do they know this madness’ range?\nI’ve sworn with gulls on dreamlit shores,\nAnd followed deer through misted moors.\nBeneath three rods of sun, I sleep,\nWhile men hum tunes on dusty streets so deep.\nReturning to my homeland’s peace,\nI watch them raise their wars on common ground with ease.\n\n**Casual Verse**\nLight as wind, my sleeves dance in azure skies,\nOnce I rode with Hong Ya to caverned paradise.\nI drove the phoenix down with magic herbs in hand,\nAnd perched upon the jade-tree where cranes command.\nPurple mist breathes flames around the alchemical flame,\nBright moon’s glow crowns the sacred lotus’ frame.\nAs my jasper pendants brush the earth so low,\nThe Golden Lad descends with Heaven’s decree in tow.\n\n**Yin Xia Pavilion**\nA perilous pavilion pierces clouded heights,\nIts twelve balustrades command boundless sights.\nTurn your head—the mortal world shrinks to a grain,\nYet sometimes heaven’s breath plays the flute’s refrain.\nDistant peaks layer their emerald at treetops’ crest,\nWillows sway in winds with ten thousand threads dressed.\nSo near, yet none tread the misted path below—\nThe immortal’s road to Penglai is not far, I know.\n\n**For Others**\nTo be Buddha or immortal lies within the heart,\nCan one waste this life in dust’s dark art?\nThe Way seems distant, time slips by in vain,\nWhile fleeting years carve labor’s endless chain.\nDrunk on fame and profit, thick as wine,\nYet never guard the spirit’s gold divine.\nThe zither’s three-fold song stirs the immortal’s dance—\nI’ll make it the maxim by my seat’s advance.\n\n**For the Lost Seeker**\nSix windows open to the sky’s pure light,\nBreak all barriers—this is true insight.\nThe Great Dao’s path is ever straight and clear,\nYet lost ones wander where they need not fear.\nEvery road leads to Chang’an’s gate,\nYet none escape the boundless desert’s weight.\nCast aside your books, your burdens lay—\nWhere else to seek the sheep that strayed away?\n\n**In Reply**\nOne asked me of the Mystic Pearl’s glow—\nA single spark of light fills the jade jar’s flow.\nFrom ancient past to now, it never fades,\nBefore heaven and earth, it never strayed.\nWithin the six dusts, the True Lord abides,\nAtop the Seven Treasures’ peak, the false self hides.\nWho grasps this lineage’s truth with ease,\nNeeds no cloud-chariot to ride the breeze.\n\n**Again**\nAwakened, I brush off fame and dust,\nA carefree soul in freedom’s trust.\nBy streams I pledge with waterfowl,\nIn forests, I sleep on moss so cool.\nEndless worldly cares will never cease,\nFoolish men chase shadows, blind to peace.\nThey see only life and death before their eyes,\nUnknowing the eternal spring the gourd supplies.\n\n**To Master Lang, the Recluse**\nA decade has passed since we parted ways,\nYet time flows on, and Dao remains always.\nYou veil your light, hide your truth so deep,\nYet meet the world with wisdom’s leap.\nBeyond the fields, your life takes root,\nBy rivers and clouds, your spirit’s mute.\nA hundred years hence, your home will rise,\nYour name in purity through endless skies.\n\n**For Prefect Zhang**\nDo not cling to fleeting splendor—know your self,\nNurture tranquility to guard your inner wealth.\nThe dream within the dream is all you see,\nAwake, you’ll find the self beyond the self to be.\nIn the gourd, plant the shadowless tree,\nIn the cave, grasp spring before its spree.\nThe vulgar crowd will never understand,\nWhile heaven’s radiance shines, ever grand.\n\n**Secluded Dwelling**\nBeyond my door, clear streams; above, the mountain stands,\nHere I dwell in leisure, free from worldly bands.\nBooks shield my eyes when reading’s due,\nFame and profit—guests I never pursue.\nA thousand bamboo shoots I’ve grown,\nTwo or three thatched huts I’ve sown.\nClouds remain my steadfast friends,\nAt dusk they gather, at dawn they wend.\n\n**For Little Zhang, the Immortal**\nChildren point and laugh at my coarse robe’s sway,\nYet immortal garb is just the same in heaven’s array.\nCranes cry in azure skies, clouds drift slow,\nPhoenixes sing at the moonlit palace’s glow.\nGolden Lads from the Purple Court share jade’s grace,\nJade Maidens roll the elixir’s sphere in that place.\nYesterday, the Jade Emperor’s decree came down—\nYour name is written in the immortal’s crown.\n\n**For the Abbot of Yu Xi Hermitage**\nThe Daoist’s feet stir clouds as he goes,\nSeeking freedom beyond worldly woes.\nHe brushes the yellow dust from his gown,\nAnd rests his moonlit staff as he roams the town.\nPeaks rise like paintings from the plain,\nTheir chill purity strikes the soul again.\nHere I’d stay forever, let the world pursue\nIts fleeting gains—what are they to me and you?\n\n**For Abbot Yang of Shi Wo Hermitage**\nWho knows the fallen man is truly bold?\nIn mortal eyes, wealth and rank are cold.\nBeside clouds and waters, he finds his rest,\nContent with frugal fare, his lot the best.\nWhen things arise, his heart stays clear as glass,\nThough men may laugh, he wears his folly’s mask.\nVast and empty, the void knows no screen—\nA single pearl gleams in the azure sheen.\n\n**To Zhang Guan, Who Wishes to Leave the World**\nMan of resolve, do not hesitate,\nSeek the true root ere it’s too late.\nWhen the Great Dao is grasped, all fades to still,\nThe floating life dissolves in dust’s chill.\nThrough temporary forms, refine the elixir’s art,\nBorrow the spirit to forge the sacred heart.\nFree from yin and yang, beyond creation’s sway,\nThe primordial One illumines the mind’s array.\n\n**To Abbot Li**\nThe heart roams free, the qi flows in harmony,\nLet the world’s storms rage endlessly.\nThe jade wheel’s light will soon be full and bright,\nThe precious sword still needs the whetstone’s bite.\nCut through the karmic vines that block the way,\nSoon you’ll dance beneath the cinnamon’s sway.\nAll turns to gold in radiant unity,\nFilling heaven and earth—no need for more, you see.\n\n**To Liu Erguan of Songzhou**\nWorldly fame and wealth are but fleeting things,\nHonor and glory—mere mortal flings.\nAwake, it’s all a moment’s dream,\nEnlightened, no praise or scorn can seem.\nThe moon’s jewel shines for all to see,\nYet in the sea’s depths, its light burns free.\nThe world’s noble men hold kindness dear—\nTake your heart and advance another year.\n\n**For Director Han**\nFate and effort each have their cause,\nNo need for sighs or bitter pause.\nHeaven’s net is vast, its mesh wide,\nYet the subtle hinge moves, unseen, inside.\nMoon waxes and wanes by cosmic decree,\nYin and yang’s dance—who’s near, who’s free?\nI see creation as a fleeting dream,\nWho then is the one who wakes from this scheme?\n\n**For Madam Liu**\nLeap from the red dust, make your break complete,\nWith heart serene and will unshaken, sweet.\nThe precious sword’s glow chills a thousand flames,\nThe jade flower blooms, all other blossoms wane.\nFrom the Purple Court, the True One descends,\nCloud chariots and moonlit seats, banners extend.\n\nThe Elixir gleams in the palm, illumining the Great Void—\nNo need now for golden dust to employ.\n\n**For Lord Hu of Wanshu**\nAchieve your work, attain your name, then early retreat to the mountains,\nTo gain a body at peace and a heart even more at ease.\nLook back on the red dust—truly a dark dream,\nYet no magic medicine can stay the crimson face.\nDwelling by Peng Isle, how could one remain vulgar?\nThe gate set in misty vines needs no lock to close.\nSuddenly a golden pellet leaps forth,\nOutshining all who come and go, questioning men.\n\n**For Commander Jiagu**\nGain and loss, poverty and success—let them follow nature,\nNo need for joy or the torment of worry.\nThis life’s wealth and rank were sown in past lives,\nPresent cultivation reaps the past’s green.\nAt Broadview Slope, a moment’s delight,\nAt Du Post, how many faults were made?\nWhen will the cycle of retribution end?\nLearn from me to cultivate the immortal beyond the world.\n\n**For Vice Commissioner Zhang**\nDo not cling to fleeting splendor, lest desire’s realm encroach,\nThe immortal isles of Peng and Hu grow ever harder to find.\nThe alchemical terrace and divine furnace lie buried in dust,\nThe moonlit palace’s magic mushrooms overrun by wild grass.\nIf you ask what exhausts endless affairs,\nHow does it compare to awakening the original heart?\nDiligently apply yourself for three thousand days,\nAnd refine within the gourd a well of gold.\n\n**For the Daoist**\nTo study the Dao, first still all perceptions and knowledge,\nAmong the crowd, silence is most fitting.\nDo not rely on the sixty-four as profound mystery,\nNor debate the three-in-one as rigid grasp.\nClarify the spirit’s source to see hidden depths,\nOpen the eye of wisdom to recognize the subtle and unseen.\nProbe the root, secure the stem—this is the art of long life,\nLeading to non-action where nothing is left undone.\n\n**For Abbot Zhang**\nLong ago I heard of the ancient immortals,\nWho dwelt in nests and caves, their legacy enduring to this day.\nPeople like wild deer, knowing no gratitude,\nAbove like treetops—so naturally they lived.\nGood and evil both forgotten, roaming the vast expanse,\nDeath and life as one, all distinctions dissolved.\nWhen will the balance be shattered, the measure split?\nWhen the primordial chaos transforms to form this heaven.\n\n**For Supervisor Zhai, the Unrestrained**\nToday I meet the unrestrained wanderer Zhai,\nWhen shall we keep each other company in the groves and springs?\nAchieve your work, attain your name, then withdraw,\nConceal your traces, veil your light—your place will naturally be secluded.\nIn the cauldron of chaos, refine the great medicine,\nIn the crucible of primordial mist, boil the golden lead.\nOnce the elixir is complete and consumed, ascend to the origin,\nAttaining the land of Huayang, the unending day.\n\n**For the Assembly Leaders**\nTime is limited, like a candle in the wind,\nLife is uncertain, like spittle on water.\nRemember that the crimson face must fade,\nDo not let white hair arrive too soon.\nLet greed and desire for love be worn away,\nIn the wondrous realm of the subtle, search carefully.\nEnter the great boundless sea of perfect enlightenment,\nAnd roam freely in the land of Great Peace.\n\n**For Wen Dihan, the Enlightened Daoist**\nLong heard of in the past, today we meet,\nAs we sit and speak, suddenly a spring breeze arises.\nQi harmonious, peach blossoms bloom on your face,\nSpirit settled, the elixir in the furnace glows red.\nThe infant and maiden entwine, returning to the Purple Court,\nTiger and dragon unite, entering the Palace of Fire.\nCarefree upon the sea, seeking the mystery’s key,\nThe path to Penglai is but a thread’s width away.\n\n**For Master Heshilie**\nSteadily, freely, the body at ease,\nTogether we laugh and talk, leaving the red dust behind.\nThe journey to the Three Mountains is sure and steady,\nHarmonious qi melts into a spring of ten months.\nBelow Lu, incense divides as plum blossoms open,\nSouth of the river, green enters the willow tips anew.\nIf you are willing to come here and cultivate together,\nYou will not become a dreamer in a life of toil.\n\n**For Zhai, the Unrestrained**\nOnly in great awakening does one know the great dream is over,\nThen ride the transformations of things, roaming at will.\nSpirit like a crane freed from the clouds,\nBody like a boat unbound on rivers and lakes.\nProfound principles found in withered wood,\nLuxuriance all given to the flowing blossoms.\nNow no longer concerned with action or concealment,\nLike the frog’s croak or the whale’s surge—truly free.\n\n**Following Another’s Rhyme**\nAmid clouds and sea, meeting a man of the Dao,\nHis spirit like autumn waters, clear and bright.\nHe comes riding a white deer to the Three Isles,\nGoes astride a green luan to visit the Five Perfected.\nIn the crucible, the thousand-year medicine is refined,\nWithin his nature, the six sensory dusts are swept away.\nThe master has already attained the arts of immortals—\nVirtue is not solitary; it must have neighbors.\n\n**For Lord Wang**\nHair like a crane, beard like frost—this man of a different age,\nWilling to come here to speak of eternal spring.\nPlant well the withered tree in the moon’s light,\nRefine within the gourd the priceless truth.\nIf you can complete the repair of heaven and earth’s flaw,\nWhy bother casting a body of chaff and husks?\nYou must reach Penglai—once you do,\nYou may keep company with the immortals of the grass.\n\n**For the Astronomer’s Judge**\nAmid the bustling dust, awakening to the one truth,\nLike a tumbleweed, becoming a body at liberty.\nReleasing the crane in the blue clouds, the heart unstruck,\nHiding the pearl in the Red River, the Dao not poor.\nWithin the gourd, the towers and terraces of the Three Isles,\nIn the cave, flowers and trees in four seasons of spring.\nWhere blue luan and white crane soar,\nThe golden and azure radiance is ever new.\n\n**For Yan, the Young Immortal**\nThe young are to be revered—I pity you,\nVitality in full bloom—have you no fear?\nBriefly lingering in the splendor of the world,\nWasting effort on the black dye of cultivation.\nHeart like iron and stone, yet straying from the original vow,\nThe sun near the mulberry and elm—losing the later plan.\nBut if you keep this heart alert and cautious,\nIn secret, sages and worthies will surely aid you.\n\n**For Daoist Li**\nClarity and emptiness can refine the steadfast Daoist heart,\nSolitude and silence can darken the perfect wisdom.\nGold and jade filling the hall are ultimately abandoned things,\nA single grain of cinnabar elixir can extend the years.\nIn the world, men greedily chase fleeting dreams,\nBeyond things, who knows the transformations of the Dao?\nIf you can turn your head and grasp this principle,\nYou will see within the casing an immortal take flight.\n\n**Exhortation to the World**\nFleeting fame, fleeting profit—all is transient,\nThe heart’s entanglements must cease sooner or later.\nDevoted to schemes, forgetting the days,\nWhen has wealth and rank ever reached the withered skull?\nTurning back from the mountain of treasures—too late,\nStruggling to emerge from the boundless bitter sea.\nLife hangs by a thread, like a puppet,\nNot knowing that men play at being romantic.\n\n**Passing Lianchang Palace**\nLianchang’s palaces now lie in level sands,\nNo sight of phoenixes ascending—only crows.\nStill, Song Peak stands at the end of the trees,\nEndless, the Luo River flows to the edge of the sky.\nThe *Rainbow Skirts* dance finished, mountain birds sing,\nThe Upright Tower empty, wild grasses bloom.\nA thousand ages of splendor cannot be retained,\nNow the reclusive Daoist claims this quiet dwelling.\n\n**For Daoist Shi**\nThe petty pursuit of fame and profit—an ancient and modern passion,\nGained with alarm, lost with alarm.\nIn the butterfly’s dream, no ultimate awakening,\nIn the white colt’s gap, competing for fleeting glory.\n\n**At Tong Mountain and Golden Vale**\n\nThe imperial favor at Tong Mountain—an ode lasting a thousand years,\nThe perilous towers of Golden Vale—leveled in a single day.\nHow much better to follow the Daoist, retiring to rest,\nPassing one’s life by the waterside, beneath the forest’s shade.\n\n**Again**\n\nOn the *Pillow of Transcendence*, the dream first stirs awake,\nBamboo hut’s breeze brushes the face, so crisp and clear.\nAlready the watchman’s drum turns beyond the flickering light,\nNow the Dipper’s tail slants across the treetops’ edge.\nWorldly dust dissolves without a trace,\nWhen dragon and tiger meet, their roar resounds of itself.\nUnsheathing a single grain of golden light from the purple brush,\nIt soars and plunges—even ghosts and spirits stand in awe.\n\n**To Master Guo of the Hermitage**\n\nFleeting life scatters like leaves from the bough,\nHalf a century’s span already slipped away.\nBeyond the dust, green mountains stretch in vain longing,\nWhile white hairs at the temples multiply.\nThe year draws late—how can one feel no sorrow?\nYou do not return—what can be done?\nI have sealed my pact with the gulls of the sand,\nThis time, do not again betray the rippling waves.\n\n**For Qu’s Abbot**\n\nA single *qi*, vast and boundless, emerges from the void,\nAlready it divides and governs yin and yang.\nIt carves creation’s work as the primal ancestor,\nEmbracing emptiness, all things flourish.\nIn motion, its mystery responds to change,\nIn stillness, the empty chamber radiates celestial light.\nDisciples, do not seek its traces—\nRecognize true emptiness as the Dharma King.\n\n**For Officer Kang**\n\nHow does serving as an official compare to studying immortality?\nIn perfect stillness, perfect purity, nurture the vast *qi*.\nDaily in the jade crucible, refine the great elixir,\nHourly in the golden cauldron, temper the red lead.\nAuspicious vapors rise to the clear heavens,\nGolden lotuses bloom, veiled in purple mist.\nWhen merit is complete, ascend to the Moon Palace,\nAnd together we shall journey to the Great Brahma Heaven.\n\n**To Zhang the Commander**\n\nFor years you pledged with me to retreat to the groves and springs,\nYet in an instant, empty fame has ensnared you.\nThough the frontier sands press close, your resolve remains,\nThe Jasper Pool is not far—only the greening has yet to come.\nTo linger in clouded valleys is the Daoist’s way,\nTo wield generals’ power is the hero’s prerogative.\nWait until the day your work is done and name achieved,\nThen withdraw and once more attain the Great Brahma Immortal.\n\n**For Pu Cha, Abbot of Songzhou**\n\nThe supreme Dao of the Primordial Origin speaks no words,\nIn serene tranquility and pure emptiness, all is natural.\nWithin the gourd, a new world unfolds,\nIn the cave, the Three Isles part from the mountains and streams.\nLord Ding’s mercury, unwed, departs the palace,\nThe jade maiden’s lead lies deep in the northern chamber.\nDo not rashly breach the undifferentiated,\nLest you force the mending of heaven with molten stone.\n\n**For Abbot Guo**\n\nA single gourd of porridge—this is my livelihood,\nOne who befriends the Dao, is it not so?\nStill as a limpid river cradling sun and moon,\nIn motion, like a crane vanishing into rosy clouds.\nFrost touches the temples, hair now speckled with stars,\nThe cinnabar field sprouts inch by inch of golden shoots.\nWait until the work of the Seven Returns is complete,\nThen in the Palace of Nine Suns, behold the golden flower.\n\n**For Master Zhao**\n\nThe Golden Mountain by the stream—fit for a hermitage,\nI come to this place to dwell in a lotus hut.\nEach step in the land of the Dao is steady,\nEach glance back at worldly affairs grows more distant.\nOn the shelf, a few volumes of dusty scriptures,\nBefore the gate, a thousand willows in misty rows.\nOf late, celestial light shines in perfect peace,\nA single luminous pearl coalesces within.\n\n**For Clerk Le**\n\nHonor and disgrace—what do they matter to the body?\nOne misstep disturbs the harmony of *qi*.\nTime turns back, and youth slips away,\nGold and jade fill the hall—who would tire of abundance?\nNot seeking sun and moon within the gourd,\nIn vain the heart wages war.\nHow much better to awaken early to the plan of no-birth,\nBeyond the kalpas, can the spirit-light be destroyed?\n\n**Again**\n\nThe fourfold body is the crucible of creation,\nThe five phases’ true fire refines the primordial void.\nFrom the seething sea’s depths, crimson flames arise,\nIn the murky dust, the great emptiness manifests.\nThe formed body is but a temporary union,\nThe unborn Dharma-nature is true suchness.\nWhen the divine youth carves through Kunlun’s jade,\nCan its value be matched, even by a city’s ransom?\n\n**To Zhang the Commander**\n\nWhite hairs rush to fill the head,\nThe rosy face fades stealthily away.\nIf destined for immortality, rise lightly,\nIn the boundless world of affairs, seek not with toil.\nIllusions cannot withstand the wind’s candle,\nFleeting life is no more than foam on water.\nFame and fortune—what are they but ephemera?\nEven the wise cannot cease their pursuit.\n\n**For Others**\n\nWho recognizes the carefree immortal of the human world?\nHungry, he eats; tired, he sleeps.\nA humble hut, enough to shelter the knees,\nHalf a sheet of empty fame—not worth a penny.\nThe bright moon hangs in the sky, perfectly aligned,\nThe clear wind ever circles me.\nBefore the hall, no idle flowers are planted,\nOnly jade-green pines stretch to the heavens.\n\n**For Wang, Clerk of Songzhou**\n\nConsider carefully and recount it to the wise:\nThe word *Dao* belongs to the dusty world.\nIn utmost emptiness and silence, none may intrude,\nIts subtlety and wonder cannot be transmitted.\nIn stillness, radiance shines—heaven has eyes,\nWithin the mysterious, creation’s fire births the lotus.\nThe great thousand worlds are all unobstructed,\nA single spirit-pearl is round everywhere.\n\n**For Magistrate Hao of Ninghai**\n\nI tell the heroes of the world:\nEach person possesses a night-shining pearl.\nIn former years, desire’s dust dimmed its light,\nToday, polishing removes the grime, and it gleams anew.\nA radiance like a precious mirror,\nPurity like an ice-filled vase.\nFrom Kunlun’s summit, the spirit-spring descends,\nWatering the jade flowers, never to wither.\n\n**Great Harmony: For Commander Sun**\n\nDo not cling to fleeting splendor, resenting this body,\nBetter to nurture your celestial truth in quietude.\nWhat use is a life spent in vain?\nWorldly affairs have ever deceived mankind.\nAccumulate virtue—why fear the path to immortality is distant?\nForget emotion—this is the Dao’s true kin.\nWhen the dream of Huaxu ends and the yang spirit emerges,\nTransform the nation and wander in an eternal spring.\n\n**Roaming Mount Jiaozi**\n\nFlowing and halting, following the leisurely Dao,\nMy visit to Mount Jiaozi was but chance.\nLike floating duckweed, I drift ever onward,\nYet my sleeves dance in the wind, carefree.\nA few peaks rise from the plain like a painting,\nA hundred birds in the secluded woods play their pipes.\nOnce the work of the Seven Returns is complete,\nAll the world’s finest places will be filled with flying immortals.\n\n**For Daoist Yuan**\n\nEmpty fame all day—how futile,\nI ask: can the fleeting light be detained?\nOnly the buzzing flies vie for blood,\nUnknowing that the dream’s moon startles the crows.\nThrough many lives, greed and desire weigh heavily,\nGradually wearing away the jade-like nature to withered dryness.\nI tell the wise: remember well,\nCherish and guard the night-shining pearl within.\n\n**Admonition to the Kitchen**\n\nThe kitchen’s hearth and firewood keep one busy all day,\nFeeding the mouth—all for a sack of foulness and filth.\n\nA thousand meals from one plow’s toil are not easily gained,\nA hundred lashes for a bowl of rice already wound too deep.\nPrecious as brain and marrow—yet men treat it as common thing,\nNever once tilling the root of the Dao’s own field.\nForgetting stillness of mind, they cast aside constant vigilance,\nOnly to repay in fur and horn in lives to come.\n\n**Self-Reflection**\n\nFor forty years a tumbleweed on the sea,\nYear after year slipping past, long grown numb.\nSpring winds from afar reach the land of no-birth,\nAutumn moon ever shines on the sky of no-night.\nWhen samādhi arises, willow still grows by the elbow,\nWhen scenes fade, lotus beneath the feet is already gone.\nWith earnest words I send to friends in the dust:\nSoon, by Cloud Creek, we’ll weave this verdant bond.\n\n**Again**\n\nA carefree wanderer by Cloud Creek,\nIn a small window, high recline, nurturing heaven’s truth.\nIn dreams, once awakened, there are no more dreams,\nBeyond the body, one knows there is yet another body.\nA cold moon hangs in the void, bright for a thousand years,\nVernal splendor touches all things, fresh for a fleeting moment.\nHow could it compare to grasping the principle of long life?\nWithout past, without present—one eternal spring.\n\n**Following Sun Boying’s Rhyme**\n\nAlone, wherever I go, I find shelter,\nTreading through mist and rosy clouds, never losing the way.\nWho at the sky’s edge brings word from the green birds?\nWhite clouds beyond the wind drift east and west.\nPounding the dark frost, the rabbit in the moon appears,\nDriving the true fire, the sun’s parrot is summoned.\nGathered into the mysterious, to achieve enduring vision,\nOne spirit, one true nature, equal to heaven.\n\n**To Sun Boying**\n\nThis lofty one long wearied of the capital’s splendor,\nRecalling the immortal mountains, reclining amid rosy clouds.\nBamboo staff and straw sandals as companions,\nAlchemical furnace and scriptures as life’s foundation.\nHunger fed with acorns and mountain yams,\nThirst quenched with pine pollen and stone tea.\nRight and wrong, all distinctions left unchallenged,\nKnowing only that the body belongs to the great square.\n\n**Again**\n\nResponding to things as they come, trusting nature,\nWithin nature itself, the true immortal is concealed.\nNo need to pore over fragmented texts or exhaust scriptures,\nAlready, with a flower held, the ancestral Chan is awakened.\nWith mind settled, all idle weapons are subdued,\nWith spirit at peace, this fine cause is attained.\nHere lies the complete truth of the Quanzhen,\nWhere in the clouds and mountains would one seek grotto-heavens?\n\n**Again**\n\nTo learn immortality, one must dwell in the forest,\nIn every movement, guard against familiar realms encroaching.\nIn the arena of fame and profit, do not set foot,\nIn the realm of sages and worthies, bestow your heart.\nFrom one basket, a thousand fathoms are built,\nTreat fleeting moments as if they were inches of gold.\nWhen spirit and qi congeal into a leakless body,\nAmid mist and rosy clouds, there are true kindred spirits.\n\n**Again**\n\nHow many autumns can beauty’s eyes and adorned face endure?\nSuddenly, bleached bones lie in a desolate mound.\nIn life, relying on cunning, a thousand schemes,\nHere, heroes in an instant come to rest.\nAfter delusion, joy and sorrow become true form,\nUpon awakening, life and death are like floating bubbles.\nYet this numinous thing within never decays,\nLeft for wayfarers as a signpost to enlightenment.\n\n**To Magistrate Zheng**\n\nPitiable, your temples already grizzled,\nAll day buried in stacks of documents.\nWorldly profit melts like snow in boiling water,\nYour brush’s tip sharp as ginger’s sting.\nRich flavors delight the mouth, the whole family rejoices,\nBut when karmic debts arrive, you alone repay.\nIf you take my words as medicine and stone,\nI hope you’ll swallow them and freeze your heart.\n\n**To Deputy Warehouse Keeper Zhang**\n\nSoon or late, compose your return and rest,\nTo wander carefree as a cloud or water.\nTo have settled a life’s plans within a space to stretch one’s knees\nOutweighs three years as a prisoner of office.\nWithin the gourd, the elixir of long life awaits,\nIn the world, there is no reason not to die.\nOne day, when merit is complete, ascend beyond,\nAt the Jade Pool’s gathering, join the company of immortals.\n\n**To Magistrate Wang**\n\nBest to withdraw from the arena of right and wrong,\nTo become a carefree, untroubled person.\nWith a patterned staff, roam the paths beyond the clouds,\nStraw sandals never touch the dust of the world.\nLift your head—the bright moon is a worthy friend,\nWherever you go, green mountains are always neighbors.\nFind a small hut in a secure place,\nBy the pine window, in lofty seclusion, nurture heaven’s truth.\n\n**To Master Ji of Mount Song**\n\nFrom afar, gazing southeast to ten thousand layers of green,\nThe master dwells beyond this mountain’s heights.\nWorldly splendor seen through, the dust’s bonds all severed,\nSubtle wonders revealed, the Dharma-eye opened wide.\nAll books in the world are brushed aside,\nNo dharmas before the eyes can be grasped.\nWith earnest care, I offer this to all sentient beings:\nComplete the nearly finished work of the final basket.\n\n**To Daoist Dong of West Mountain**\n\nTo leave home and refine oneself relies on the forest,\nBeware of straying from the flock to indulge this heart.\nAsk the ungrateful floating clouds:\nHow do they compare to flowing water seeking a true friend?\nOnly after careful carving is jade perfected,\nOnly after blowing away the last grains of sand is gold revealed.\nI hear Penglai and Yingzhou abound in worthy companions,\nNever idly waste another moment of light.\n\n**Announcement to Old Lady Liang**\n\nDisciple, do not endure bitter suffering,\nThe great Dao was always originally natural.\nIn true stillness, true purity, all functions arise,\nWithout carving, without polishing, it becomes round.\nIn the Palace of Five Lights, lingzhi mushrooms grow,\nOn the Mountain of Seven Treasures, auspicious lotuses bloom.\nPluck one branch and return to the ethereal,\nAt the Jade Pool’s gathering, present it to the immortals.\n\n**To Abbot Wang**\n\nThe immortal’s wind is fit only for forests and springs,\nSeeing through the dust’s bonds, seek the Dao’s bonds.\nBrush away the myriad entanglements of the heart’s realm,\nCultivate in silence the mystery within your nature.\nHeaven’s light shines forth, delusive clouds disperse,\nThe Dharma-eye opens, the moon of wisdom hangs.\nThen, overturn the Silver River to pour,\nWatering the golden lotuses within the grotto.\n\n**To Mei Xian**\n\nWith innate Dao bones, you yearn for true cultivation,\nNaturally, the red dust cannot detain you.\nThe wild horses already know the window’s sun is brief,\nHow could the parrot consent to wander beneath a porcelain sky?\nWithin the gourd, the elixir of long life is refined,\nOn the sea, let the boat drift without mooring.\nBetter still, when you return at dusk,\nA single wheel of bright moon over the emerald river in autumn.\n\n**To Zhang Cangshi of Songzhou**\n\nTo become a guest in the Quanzhen gate,\nTake up your staff and leave the red dust.\nPolish the precious mirror until it blazes with light,\nRefine the cinnabar until it subdues gods and demons.\nTen thousand defilements cleared from the heart’s realm,\nA single word awakens the dreamer.\nTurn your head, look back at those petty ones—\nAll for cleverness have lost their original truth.\n\n**Inscribed at Stone Nest Hermitage**\n\nGazing afar, mist and haze lock the emerald haze,\nThe Daoist comes here and forgets all schemes.\nBefore the eyes, all is true purity and stillness,\nAt the ears, not a whisper of idle right or wrong.\nIn the distance, jade-green peaks stretch like kingfishers,\nBy the gate, fine springs drip like strings of pearls.\nThe red dust, though a footstep away, seems as distant as the sky,\nIn the quiet, beneath the pines, the door remains shut at noon.\n\n**To Zhao Jixian of Stone Nest**\n\nSeeing through this floating life—bubbles on water,\nNot a speck of dust allowed to touch the heart’s ground.\nSometimes I take up the yellowed scrolls and set them down,\nEndless blue mountains stir my wanderlust, and off I go.\nDo not mock this gourd-bottle livelihood—\nIt has made a thousand ages look up in admiration.\nIf someone asks for the method of cultivation,\n“Eat your fill, have no surplus, and every affair is done.”\n\n**Sent to Commissioner Zhang**\n\nThis body is finite—do not let it slip away,\nA hundred years of light pass in the snap of a finger.\nJust when you think your golden purse is still half-full,\nYou do not notice the white hairs multiplying at your temples.\nDeath at life’s end—who can escape it?\nEven with children and grandchildren filling your eyes, what can you do?\nHow much better to seize the days of strength and health,\nAnd early invite the bright moon to join you in misty vines.\n\n**For Chief Yang**\n\nDo not speak of golden lotuses blooming in fire,\nNor claim your home holds a grotto-heaven.\nGenerally, to leave the household is to leave love and desire,\nOne must cut off all thoughts to reach the profound mystery.\nGrinding a brick to make a mirror is never true,\nBrushing a stone to turn it into a sheep is but a temporary skill.\nIf you reach the state of unimpeded spiritual power,\nYou can make even level ground into a realm of immortals.\n\n**An Autumn Day for Daoist Wanyan**\n\nMorning brings the White Emperor’s frosty might,\nAs if to aid heaven and earth in their killing intent.\nTreetops cannot bear the weight—leaves fall in droves,\nWhile at the edge of the sky, scattered geese hurry home.\nTravelers far from the red dust fret over silvered temples,\nSoldiers at the purple frontier sicken in their iron armor.\nOnly the immortals have no cares—\nA bowl of millet gruel, and the brushwood gate stays shut.\n\n**Reflections at the Supreme Clarity Palace**\n\nWaking from sleep, I wander at ease, my mind unburdened,\nLeaning on my staff, I make my way to the abode of truth.\nIn the wind, red and purple petals fall ceaselessly,\nAfter the rain, jade-green bamboo renews itself daily.\nThis sacred land naturally generates auspicious qi,\nThe azure heavens never cease their journey of the red wheel.\nThe immortal sage has forgotten the world of mortals—\nJust as he turns, the morning bell rings from without.\n\n**For Daoist Zhao**\n\nGather your spirit and turn your gaze inward,\nDo not let the impoverished thief of the outer world deceive you.\nThe six gates’ mystic keys sever the roots of dust,\nThe sevenfold returning elixir drills the Dao’s qi into being.\nWhen jade dew descends, each drop is a pearl,\nWhere golden clouds take flight, the moon forms perfect circles.\nIn the crystal pavilion stands the True Person’s position,\nRed phoenix and dark turtle coil above and below.\n\n**Zhang Gu’s Announcement**\n\nA furnace of spring snow demands your work,\nTemper and refine until every grain becomes a pearl.\nTen thousand silver rays of radiance interweave,\nA thousand kinds of auspicious hues blur into one.\nThe infant gathers the magic mushroom,\nThe alchemical maiden steals open the crucible of creation.\nThere is a True Person idly at play—\nStaff propped against the moon, toying with the void’s origin.\n\n**For Daoist Li of Qingping**\n\nOld and great, my eyes can no longer bear books,\nOnly in stillness is it fitting to nurture an empty heart.\nA hundred bones harmonize, the spirit dreams no more,\nFour limbs flow freely, breath settles into depth.\nI break open Mount Jing to search for uncut jade,\nI brush aside the cinnabar tripod to seek true gold.\nNow I tell you the immortal’s secret—\nEntrust it to others: cherish every inch of time.\n\n**Announcement for Vice-Observer Wang**\n\nI tell the world’s stalwart heroes:\nAll people possess night-shining pearls.\nIn former years, they lay buried in dust and darkness,\nToday, the tarnish is wiped away, and not a trace of intent remains.\nA strip of light as pure as white silk,\nTenfold brightness like an ice-filled flask.\nKunlun transforms into the liquor of spirit-spring,\nWatering jade blossoms that never wither.\n\n**For Chief Shi**\n\nŚākyamuni held up a flower—it was a revelation,\nBodhidharma faced the wall—he tarried in stillness.\nThe numinous essence is inherently without wax or wane,\nIt is the human heart that vainly grows tumors of delusion.\nThe Great Dao forgets words—it is not a matter of discourse,\nThe valley spirit never dies—yet there is no way to seek it.\nThe perfected one, having attained it, is too lazy to speak—\nThirst quenched, hunger sated, all affairs are done.\n\n**For Chief Zhang**\n\nProfound silence and thunderous sound each follow their nature,\nWithin them, the message is fundamentally empty and nonexistent.\nThe lotus hut’s life and death are not a matter of wisdom,\nThe earth-and-wood body’s form is not foolishness.\nCounting breaths is but a trifling aid,\nFeasting on rosy clouds is but a shallow practice.\nIf you wish to know the immortal’s secret beyond the world,\nSnatch the pearl from beneath the black dragon’s chin.\n\n**Five-Character Regulated Verse**\n\n**Sent to Wanyan, Supervisor of the Dongxiao Palace**\n\nA message for the guest of Dongxiao:\nYour celestial endowment is fortunately abundant.\nGood conduct leaves no trace,\nIn worldly affairs, it is better to be as if foolish.\nRemember this candle burning brightly—\nIt yields to the clam that hides its pearl.\nDo not let your light shine outwardly,\nCherish it to nurture this frail body.\n\n**Sent to Master Lang**\n\nA message for the old man of the western mountains:\nLiving in the mountains is also joyous.\nTen thousand greens all taste of wax,\nA single thought turns to cold ashes.\nThe departing crow bows its head in submission,\nNew poems are cut out by hand.\nThe lofty immortals are full of care—\nThey do not let you come to the fore.\n\n**Reflections**\n\nHemp robe and kudzu kerchief,\nA single idle man between heaven and earth.\nVast and boundless, transcending the three realms,\nTowering and majestic, rising above the six dusts.\nWithin the grotto, immortals never age,\nInside the gourd, the scene is eternal spring.\nI ascend the summit of Kunlun,\nTurn my head to gaze at the North Star.\n\n**Again**\n\nThe Dao’s resolve grows ever more steadfast,\nHuman feelings naturally grow distant and sparse.\nEmptiness and clarity are my livelihood,\nStillness and simplicity nurture the true thusness.\nLead and mercury simmer in the golden tripod,\nMysterious frost refines the jade furnace.\nWhen the work is complete and I return,\nI will dwell forever in the immortal capital.\n\n**For Chief Wu of Zhongjing**\n\nCold jade-green peaks of Song Mountain press close,\nI dwell in seclusion by the stream’s waters.\nHuman sentiments gradually thin,\nThe Dao’s resolve grows ever more refined.\nSimurghs and cranes gather in the cinnabar courtyard,\nClouds and rosy mists fly through the jeweled hall.\nWhat is it that unties the orchid?\nOnce gone, it does not return.\n\n**Following Master Lei’s Rhyme**\n\nI wander at will into forests and springs,\nForty years have slipped by in careless steps.\nBefore the moon could be pointed out,\nAfter the fish, the fish-trap was already forgotten.\nYears and months pass like this,\nMy feelings and thoughts are also serene.\nNot yet returned to the immortal mountains,\nI respond to things and follow the green.\n\n**Twenty-Two Five-Character Quatrains**\n\nWorldly affairs, one by one, are finished,\nFloating life, matter by matter, is done.\nSuddenly, beyond the three realms,\nNot a single thread is entangled.\n\nThe Great Dao is utterly profound,\nEmptiness and clarity align with nature.\nParting the eye of samadhi,\nBehold another layer of heaven.\n\nForm reveals the formless,\nTrue emptiness blends with colored emptiness.\nNeither being nor non-being is stained—\nA single point within the great void.\n\nTo become a body without hindrance,\nFirst repay the debts you owe.\nTrim the lamp within your nature,\nIllumine the realm of empty space.\n\nA thatched hut at the city’s edge—\nWho recognizes it as an immortal land?\nThe place is remote, few people pass,\nThe heart is clear, the Dao’s flavor lingers.\n\nEverywhere is the Dao,\nEverything is illumination.\n\nDo not dare affirm all appearances,\nIn wordless silence find supreme peace.\nThe autumn wind rises in gusts,\nScattered leaves swirl and fly.\nThese very matters, in truth,\nReveal the whole of profound mystery.\nBeyond the world, nurturing lofty scholars,\nAmid the dust, men unlike the vulgar crowd.\nOpen wide the eye of purity,\nSee through the dust of fame and gain.\nLiberation is my own affair,\nDeath and life concern me not.\nThe heart shines like the bright moon in emptiness,\nThe body drifts like a wild cloud at ease.\nThe true white snow of one’s nature,\nHow can the hundred distractions stain it?\nUnlock the lock without a seam,\nLeap forth as a body unbound.\nThe physical form has its origin,\nThe true nature—how could it lack a root?\nSeek within the center,\nAnd the master remains, as ever.\nLet all branches and deceptions cease,\nWisdom will come of itself.\nForm cannot escape the mirror’s gaze,\nIntegrity blooms at the blade’s edge.\nLove clings, worldly passions weigh heavy,\nThe heart stills, the Dao’s flavor is true.\nTo seek both is without principle,\nOne must sever decisively.\nGreat skill is originally like clumsiness,\nThe awl in the bag must not show its head.\nWhen the hares are all gone,\nThe good hound need not worry.\nRoaming the vast sea,\nA thousand layers of snow-white waves rise high.\nCast the mountain bait—\nWhich one is the divine turtle?\nThat which is born was never born,\nThat which dies does not truly die.\nAmid the endless cycle of birth and death,\nNo one knows this truth.\nThe four elements perform wonders,\nThe five phases turn to stench and decay.\nTransformed a hundred thousand ways,\nTossed and turned through ten thousand ages.\nWorldly affairs are inherently limited,\nThe Great Dao is boundless.\nAwakening from the dream of floating life,\nThe heart is like a lotus rising from water.\nHaving become a carefree wanderer,\nSeek those beyond the realm of things.\nMeeting, not a word is spoken,\nEyes meet, the Dao is already intimate.\nWhere worldly dust does not reach,\nHere one nurtures idleness and ease.\nSpeak to like-minded friends:\nFloating life is all emptiness.\nWhen will fame and merit end?\nWhen will wealth and rank cease?\nSeeing through the dream of floating life,\nIt is like vomit on water.\nI wish to cast fragrant bait,\nBut the divine turtle does not take the hook.\nTurning back the solitary oar,\nThe moon glimmers on the emerald river in autumn.\n\n**Two Six-Line Poems**\n\nThe Dao is originally without words or speech,\nOnly that your heart be fiercely resolute.\nSweep aside the idle clouds for ten thousand miles,\nPush forth a wheel of bright moonlight.\n\nBlack mercury refined into white snow,\nRed lead congealed into golden sprouts.\nBy the lamp’s light, hand it down personally,\nDeeply conceal your own elixir of spirit.\n\n**Collected Works of Master Lifeng, Volume One Concluded**\n\n**Collected Works of Master Lifeng, Volume Two – Seven-Character Quatrains**\n\n**Occasionally Composed**\n\nDesolate clouds and waters, a few frosts and stars,\nI have gathered the immortal’s formula for deathlessness.\nTwo substances, together weighing sixteen ounces,\nRiding the crimson phoenix into the immortal realm.\n\n**Refining the Heart**\n\nThe Daoist’s heart is already cold ashes,\nBoundless worldly dust turns away of itself.\nTaking heaven and earth as wondrous use,\nThis body, wherever it goes, is Penglai.\n\n**For Master Yila**\n\nThe immortal scene within the gourd is not ordinary,\nThe ten thousand images, forest and net, shine of themselves.\nThrough purity refined into a body without leakage,\nIn harmony nurtured, the king within the Dharma.\n\nPeople’s talk of me—when will it end?\nCompeting for profit and fame—what sorrow is there?\nIf you awaken to this body’s limits,\nThe fly’s head and snail’s horn cease in an instant.\n\n**Wang the Daoist’s Admonition**\n\nOral instructions, earnestly repeated, offered to the worthy:\nWhen hungry, eat; when tired, sleep.\nThe numinous terrace gleams, unstained by dust,\nThe precious mirror leaves no trace, the nature is naturally whole.\n\n**Sent to Vice-Commissioner Yila of Deshun Prefecture**\n\nBefore worldly merit is complete, the heart is already done,\nWorldly customs all forgotten, the nature is not forgotten.\nLet the wind of wisdom blow through the ten thousand sounds,\nThe true emptiness alone appears, a wheel of light.\n\n**For the Gate Officer**\n\nAmid piled rosy clouds, there are those who know the tone,\nIn the arena of fame and profit, use little heart.\nIf you have but one branch for roosting,\nWhy laboriously seek the deep forest?\n\n**For Grand Master Jiang of the Taiyi Palace**\n\nThe numinous staff pries open the lock of fame and profit,\nThe blade of wisdom severs the borders of right and wrong.\nA rider of whales beyond the world by nature,\nNaturally roams the land of endless light.\n\n**Sent to Master Lang**\n\nBy Cloud Creek, high pillow, reclining amid rosy clouds,\nCultivating and grafting the flower of immortality that never fades.\nYou may lead the host of immortals,\nHaving harmonized the qi to the ends of the earth.\n\n**Also**\n\nTo the south of the mountains, auspicious qi swells and lengthens,\nTo the north of the waters, golden flowers bloom in clusters.\nFrom time to time, numinous sounds convey good tidings,\nIn the Jade Void Palace, selecting immortal material.\n\n**Also**\n\nFaint rosy clouds, gentle mountains,\nThis body ever dwells amid emerald haze.\nWhite clouds in the empty valley, no one comes,\nGaining a day of leisure for body and heart.\n\n**Wu the Daoist of Suizhou Requests to Reside in the Hermitage**\n\nHidden by Cloud Creek for several years,\nBy chance, following the wind, I came among men.\nYellow dust on the feet is not my affair,\nLeading the white clouds, I return to the old mountain.\n\n**For Liu, Chief of Liling County**\n\nMoney-grubbers and official prisoners,\nIn the bustling dust, when will it end?\nThe allotted span of light and time is easily spent,\nThe boundless years and months depart, hard to retain.\n\n**Verses for the Abbess of the Convent in Luozhou Stronghold**\n\nEverywhere is the meaning from the West,\nIn every thing, the ancestral Buddha’s heart is fully clear.\nHeart and intent both forgotten, wondrous use is achieved,\nNo need to struggle in vexed pondering.\n\n**Wooden Tablet Inscription for Heliu Town**\n\nOne robe, one meal—do not seek too rigidly,\nBe content to follow circumstances and rest.\nGain a heart at ease and strength spared,\nNo idle matters weigh on the brow.\n\n**For Li, Abbot of Xihua County**\n\nAtop the mountain, surging surging, a numinous spring,\nAt the sea’s bottom, blazing blazing, auspicious lotuses form.\nHaving harmonized yin and yang, the elixir congeals of itself,\nIn the crystal palace, meeting all the immortals.\n\n**For Hu, Chief of Xihua County**\n\nIf you awaken to the wheel of rebirth, return early,\nDo not plant golden lotuses in the fire.\nEven if you plant them and the roots sprout,\nIn the end, not a single blossom will open.\n\n**For Zhang, Abbot of Xihua County**\n\nNot attached to empty flowers or worldly flowers,\nThe Daoist’s livelihood is a simple life.\nWhen inspired, two scrolls of idle text,\nWhen weary, in the pine pavilion, watching the sunset glow.\n\n**For Jia the Daoist of Xihua County**\n\nCutting off the crane’s legs to lengthen the duck’s, forgetting proportion,\nFilling mountains and valleys, obscuring the verdant green.\nOne gourd is enough for the hermit’s joy,\nAn inch of ground, always empty, for the great awakened immortal.\n\n**For Chang the Novice of Chenzhou**\n\nThe Daoist’s heart is clear as ice,\nWithout need for contrivance, the Dao arises of itself.\n\nAmidst the hush of all sounds, the heart rests in perfect stillness,\nA single wheel of autumn moon shines bright and clear.\n\n**For Steward Wanyan of Chenzhou**\n\nAdding and withdrawing, inquiring through the scorching flames,\nOnce yin and yang are harmonized, the fire burns in ceaseless cycles.\nWhen pure yang is refined, the spirit emerges of itself,\nOn the path of no-birth, roam freely and without care.\n\n**For Abbess Wanyan of Chenzhou**\n\nSought all day, year after year, yet nowhere to be found,\nYet when attained, no time was ever spent.\nA single spark of numinous clarity—this true message,\nWhether for Buddha or immortal, it is this heart.\n\n**For Abbess Sun of Chenzhou**\n\nSweep away all worldly concerns until nothing remains,\nLet no dust obscure the ice-pure flask.\nWithin the breast, a single thing—divine radiance appears,\nTen thousand crimson clouds enfold the jeweled pearl.\n\n**For Minister Puchaci Congyi of Xizhou**\n\nWhen merit is complete and fame achieved, return early to the mountains,\nStaff in hand, wander carefree wherever you go.\nIn the light of the bright moon, subtle wonders fuse,\nWhere white clouds gather, refine the elixir of spirit.\n\n**For Elder Brother Wanyan of Chenzhou**\n\nCut away the brambles to open the heart’s ground,\nSweep clear the wasteland to plant auspicious lotuses.\nThe rustling breeze stirs jade-like leaves,\nThe radiant new moon illumines the alchemical heaven.\n\n**For Abbot Zhang of the Chen Garden in Chenzhou**\n\nCast aside the six desires, and the body is at ease,\nUnstained by a single speck of dust, the nature roams free.\nCultivate the rootless tree within the fire,\nRelease the divine blossom that never fades.\n\n**For Abbess Xu**\n\nFame and merit are like sparks struck from stone,\nWealth and rank vanish like foam upon the water.\nLet go, and ascend the path beyond the clouds,\nAll distinctions of right and wrong, self and other, cease at once.\n\n**To Liu Sanxian**\n\nLong have we wandered apart in Suiyang,\nGazing until spring clouds no longer come.\nCherish the priceless sword of Dragon Spring,\nLet not its sacred light be dimmed by dust.\n\n**For Abbot Song of Hutou**\n\nThis body drifts like a lone tumbleweed between heaven and earth,\nWandering aimlessly, east and west.\nBetter to sit idly in a grass hut,\nReturning to nurture my indolence in lofty solitude.\n\n**For Officer Guo of Changping**\n\nFire, wind, earth, water—what compels their service?\nGathered, they form shape; scattered, they return to rest.\nHalf a sheet of merit is but wasted effort,\nA hundred years of grasping at water’s foam.\n\n**For Wang Miaojian of Runliu Town**\n\nLet not a single thought disturb the heart’s leisure,\nShatter the knots of doubt to realize non-action.\nHold fast within the breast the nature of the Perfect Real,\nHow many in ancient or present times have preserved it?\n\n**For Chief Patron Wang of Linxian County**\n\nSpring’s light fades, and the traveler grows weary,\nWithered blossoms, butterflies—sorrow deepens.\nYet the osmanthus shadow knows no decay,\nIts fragrance fills the world—when will it ever cease?\n\n**For Chief Patron Shao of Linxian County**\n\nNot skilled in capturing foxes or hobbling horses,\nWhen hungry, eat; when weary, sleep.\nIn profound stillness, a dream of Huaxu,\nOnly then does one realize another heaven lies within the flask.\n\n**To Clerk He**\n\nFor years, you held the rod, angling for the great turtle,\nWhile the white-eyed whale mocked the waves.\nNow gather your line and return west,\nAnother empty crossing of the vast blue sea.\n\n**For Deputy Magistrate Wugulun of Wuyang County**\n\nThe immortal’s livelihood is not arduous,\nCleanse the mind, forget emotion, and qi harmonizes of itself.\nWhen joyful, take up the staff and seek wild paths,\nWhen weary, rest high upon the pillow, beyond worldly ties.\n\n**For Abbess Wanyan**\n\nBy the pine window, on the stone pillow, sleep at ease,\nEven when visitors come along the bamboo path, remain unaware.\nStartled awake, robe drawn close, sit upright—\nForm like withered wood, eyes like sleep.\n\n**For Chief Patron Zhang of Mengzhai**\n\nSuddenly cast off the world’s net to preserve the Perfect Real,\nPurify the spirit’s palace to nurture the Valley Spirit.\nEver keep the heart empty, free of all affairs,\nAs osmanthus blooms anew at the edge of the heavens.\n\n**For Supervisor Yu of the Daoist Abbey**\n\nDistant mountains, veiled in emerald mist,\nTowering green peaks near the forest springs.\nCarve open chaos to reveal a glimpse of scenery,\nSteal a speck of heaven from within the flask.\n\n**For Abbot Zu of Nanyang County**\n\nThe Three Realms have walls, yet still seem narrow,\nThe Four Directions have no bounds—all is garden.\nYellow blossoms, green bamboo—all my affairs,\nClouds are clouds, mountains are mountains.\n\n**For Abbot Cheng**\n\nFor forty autumns, you held the fishing line,\nWhenever waves arose, you cast your hook.\nThe whale and whalebone refused the fragrant bait,\nEmpty boat adrift, you wander alone.\n\n**For Lady Muhu**\n\nMankind knows only to chant the name of Amitābha,\nBut can you yourself become Amitābha?\nRecognize the original ancestor, formless,\nNo need to seek without, running in vain.\n\n**For Officer Kang**\n\nDo not compare it to mountains high or seas deep,\nThe seeker wastes effort in distant searches.\nBefore your eyes lies the Way of long life,\nBoth sage and mortal arise from this inch of heart.\n\n**For Chief Patron Xue of Luoyang**\n\nNear water, beside mountains, emerald mists enfold,\nYet fame and profit bind your steps, and you forget to return.\nThis body does not belong to the red dust’s guest,\nLying down, watch the white clouds drift beyond the sky.\n\n**For Daoist Yila**\n\nLet not the Daoist’s steps falter,\nThe heart’s mirror must be polished with single-minded resolve.\nWhen all traces of grime are gone, light appears of itself,\nWithin this square inch, behold Amitābha.\n\n**For Abbess Gui**\n\nTreading the world’s edge, sought in vain,\nYet when attained, no effort was ever spent.\nCast aside a hundred years of red dust affairs,\nA true person now steers the chariot.\n\n**For Chief Patron Jimofan**\n\nWithin the web of form, a body unbound,\nWho through the ages has understood near and far?\nCast off the hundred years of this mother-born sack,\nA true person now drives the sun’s chariot.\n\n**For Commander Tangkuo of Chenzhou**\n\nBreak free from the world’s net, and the body is at ease,\nLeap from the cage of the mundane, and the nature is free.\nStaff in hand, enter the misty path of rosy clouds,\nStartling the white clouds to fill the old mountains.\n\n**For Chief Patron Ma**\n\nSince you seek the Dao, study deeply,\nThe secret method, once transmitted, bears fruit.\nA single spark of numinous clarity, clear as water,\nRefined into the elixir, crimson within the crucible.\n\n**For Chief Patron Chen**\n\nDwelling in the sea of suffering, do not speak of the Dao,\nBeneath the mountain of grace, do not discuss Chan.\nIf you let go of both,\nNo need to dig the earth to seek the heavens.\n\n**For Military Supervisor Shi**\n\nBeyond the city walls, a few acres of garden,\nSilk and hemp, congee and porridge, sustain these fading years.\nNo ambition to ride the crane or mount the clouds,\nContent to wander the world, responding to illusions.\n\n**For Chief Patron Cao**\n\nThe Great Dao is wordless, within this inch of heart,\nNo need to chase it a thousand miles afar.\nWithin the breast lies a mirror, perfectly bright,\nLet not dust obscure its depths.\n\n**To Ma Wenqing**\n\nOnce awakened, waste not a moment,\nFor an inch of time is an inch of gold.\n\n**For Heshi Lie of Suzhou, Inquiring of His Future**\n\nAdrift in the waves of the sea of love, none can stay,\nAmidst the tangle of clouds, seek a true friend.\nThe Yu clan’s lofty gates have long held promise,\nThe cinnamon of Yan Mountain bears no cause without reason.\nNo need to ask of the future’s path—\nOne truly selfless is a person of fortune.\n\n**For Master Song of Xiao County**\n\nThe master strolls with staff in hand, at ease,\nGrasping the luminous pearl within his palm.\nBest to retreat to the cloud-wreathed mountains,\nReclining in leisure by the window, sipping the wind through pines.\n\n**Lazy Nest, Self-Composed**\n\nA lazy man now dwells in this lazy nest,\nThe steed of will long since reined and spent.\nAfter meals, he only knows to sit in heaped ashes—\nIs there another as indolent as I?\n\n**For Lady Gao**\n\nWho recognizes this puppet body on stage?\nLayer upon layer of flesh, heap upon heap of dust.\nWhen the hundred-year thread snaps, no news remains—\nGone is the puppeteer who once played the scene.\n\n**For the Wife of Supervisor Duji**\n\nThe four images congeal into a lump of deluded flesh,\nThe five phases knit into a stinking skeleton.\nLike puppets they appear—have you not seen?\nEach can speak and nod in turn.\n\n**For Lady Liu**\n\nWithin the crystal palace blooms a crimson lotus,\nAttaining the fruitless fruit, a great awakened immortal.\nGently she ascends the path beyond the clouds,\nSoaring into the Purple Tenuity Heaven.\n\n**For the Wife of Administrator Aotun**\n\nSeventy years of life—half already past,\nI urge you to advance upon the Dao, let no time slip.\nWhen impermanence suddenly presses upon your head,\nThough your children be dear, can they take your place?\n\n**For the Daoist of Joyful Practice**\n\nIf you speak of cultivation, all things cease,\nNot a single thread clings within the breast.\nAll sounds stilled, no trace remains—\nOnly a numinous youth driving the fire-ox.\n\n**For Little Yang the Daoist**\n\nThe Daoist’s heart is unobstructed, iron-willed,\nLeaping beyond the Three Mountains into vast obscurity.\nPointing afar to the depths of white clouds,\nPenglai is but her old homeland.\n\n**For Great Yang the Daoist**\n\nThe five phases knit this stinking skin-sack,\nA single spirit-pearl hidden within.\nWhen still, the flower of the heart shines through the body,\nWhen moving, no place is without its radiance.\n\n**For Xu Daochong**\n\nThe Daoist is most fitting in truth,\nFed to fullness, he treads the emerald peaks.\nWhen weary, he sleeps by the stream in his robes,\nAwakening, he gathers the drifting clouds to return.\n\n**For Sister Tong**\n\nOne who can be pure and still, free from torment,\nCultivating tranquility and emptiness to nourish the vast,\nBehind the brain, the eye of samadhi opens—\nWithin the heart, one’s own heaven shines clear.\n\n**When a Disciple Asked, \"What Is Complete Understanding?\"**\n\nYou come to ask me of complete understanding,\nYet worldly affairs are already swept away.\nA bright moon hangs full in the sky,\nTen thousand miles without clouds, its light gleaming.\n\n**For Gao the Immortal**\n\nGuard ever against your inferior nature,\nFor every movement harms the sprouts of spirit.\nHold fast the whip of thorns,\nUntil both heart and realm are forgotten.\n\n**For Lady Liu**\n\nA carefree traveler on the road of long life,\nA self-possessed immortal in the land of unending light.\nLuring the numinous youth to return to the Purple Court,\nHarmonizing the Jade Maidens to plant golden lotuses.\n\n**For Sun Tianhe**\n\nThe blade of wisdom severs the bonds of fame and gain,\nBeyond the world, carefree, all worries forgotten.\nWith a single release of the hand, he ascends the path to the Three Isles,\nEach step a land of white clouds.\n\n**Again**\n\nWithin the nameless cave lurks a venomous serpent,\nRaise its head, and all things are harmed.\nI warn the traveler: take heed,\nEver vigilant in coming and going.\n\n**For Daoist Shang**\n\nHalf a sheet of empty fame, hollow as an echo,\nA hundred years of fleeting life swift as a shuttle.\nAt the temples, white hair newly thickens,\nOn the face, rosy complexion silently fades.\n\n**For Supervisor Gao**\n\nThe ancient path of clear wind sees few travelers,\nYet in muddy waters and silted streams, they struggle to the death.\nHow laughable these foolish creatures,\nWho spend their lives pillowed on dregs and lees.\n\n**When Xu Daochong Asked of the Dao**\n\nIf you have a true teacher, whom else would you ask?\nWe share tea and rice, never parted.\nNow I point directly to the mark—\nEvery thought that arises is none other than this.\n\n**For Little Zhang the Immortal**\n\nAll reliance on tricks long since cast aside,\nSuddenly the ancient spirit shines through.\nHaving gained such true enjoyment,\nIn this world, no place is not Penglai.\n\n**For Sister Zhan**\n\nHaving grasped the true source, all things vanish,\nNo dust or defilement may stain the luminous pearl.\nWhen the waters of the source are clear, the whole body appears,\nWhen clouds disperse, the moon in the vast sky stands alone.\n\n**For Bo Zhijian**\n\nCultivation is neither easy nor difficult,\nBegin by removing the mountain of self and other.\nTemper true emptiness into one body,\nNaturally the heart will be as idle as white clouds.\n\n**For Lady Li**\n\nThe misty spring haze lengthens with the days,\nThe river plum still bears the fragrance of returned souls.\nThe grotto-heaven first receives the true message,\nHastening the Lord of Creation in his work.\n\n**Early Spring**\n\nWinter’s end, spring returns, the days grow long,\nThe grotto-heaven first gains its fine scenery.\nThe Lord of Creation summons a gathering of immortals,\nReturning amidst green clouds, sleeves fragrant.\n\n**For Magistrate Li of Linying**\n\nIn the wind, the faint scent of pine and cassia,\nThe mountain hall’s bright moon gleams with radiance.\nThe Daoist sits in silent stillness through the night,\nTen thousand sounds stilled, a single taste of frost.\n\n**When Lady Li Asked of the Journey**\n\nBetween Penglai and this world, the distance is but a foot,\nYet the traveler is lost beyond ten thousand barriers.\nThe cowherd does not point the way to Xiangcheng,\nEven the Yellow Emperor still seeks the Great Clod’s mountain.\n\n**For Lady Zhou**\n\nPower and profit appear as brittle as ice,\nThe Daoist has already forgotten worldly passions.\nLast night, in a dream of wandering immortals,\nShe rode a golden simurgh to court in the Jade Capital.\n\n**For Yila Dayuan**\n\nHeart-ash cold and fallen, no smoke of passion,\nA withered tree’s form, no sprouting buds.\nOnly when the true fire of the three yangs descends,\nWill the iron tree before the hall bloom.\n\n**When the Nun Elder Asked of Cultivation**\n\nYou come to ask me of the secret of cultivation,\nNow I tell you earnestly:\nSweep away all yin to reveal your original truth,\nAnd a single moon will hang in the azure sky.\n\n**Again**\n\nComing and going, carefree, following nature,\nThe long turtle, the short snake—ancestral Chan.\nUpon the mountain, a realm of pure frost,\nOnly then does one see another heaven within the gourd.\n\n**For Dong Zhiyuan**\n\nWhere the blade of wisdom is raised, delusions scatter,\nForth burst silver radiance in ten thousand strands.\nThe many-eyed ghost of yin’s corpse extinguished,\nWithin the lotus pavilion, the rare and subtle appears.\n\n**For Chief Patron Xue the Sixth**\n\nThe numinous treasure of prior heaven exists in the realm of having and not-having,\nMoving, it follows the moment; still, it is empty.\nAmidst the ten thousand things, it ever acts as master,\nIts thousandfold workings respond without end.\n\n**Spring Outing**\nOld in years, my heart finds robes too long,\nYet I grasp my staff and force myself to see spring’s light.\nThe garden’s peach and plum all gaze with envy,\nSaying my skin rivals Master Shen’s glow.\n\n**Chef Zhang Asks About Life and Death**\nThose who died long ago—did they ever die?\nThose born today—what birth do they truly know?\nWhen life and death reach their end, what remains?\nTo rest in harmony, in accord—this must be clear.\n\n**Roaming Cloud Creek**\nA host of immortals invites me to seek spring’s traces,\nThread upon thread of crimson blooms unfold in greeting.\nShould I enter Peach Blossom Spring, it would be no dream—\nYet when others ask, where to find Penglai?\n\n**For Zhang Wuzhen**\nWithin the gourd, a single grain of purple gold sand,\nRefined, it radiates a thousand strands of rosy mist.\nOnce ingested, the floating world’s narrowness fades,\nAnd suddenly the body dwells in the vast and boundless.\n\n**For Madam Zhou**\nAll things seen through are but dreams,\nEvery affair known is but emptiness.\nAwakened to the not-empty, content in one’s lot,\nLet the sun and moon race east and west as they will.\n\n**For Zhang Huaiyuan**\nNot a single thing, not a single form leads astray,\nTurning back, one penetrates the old Chan mechanism.\nDo not let yourself drift through the human world—\nHold fast to the formless, the true, the uncontrived.\n\n**For Magistrate Liu**\nTruly pure, truly still—the carefree wanderer,\nNo clinging, no grasping—the self-soaring immortal.\nWith staff in hand, he returns beyond the clouds,\nStraw sandals treading through the heavens of the grotto.\n\n**For Master Sun**\nCherish spirit, nurture qi, and fortify the numinous field,\nIn stillness of realm and tranquility of mind, the Dao is natural.\nAmidst blazing light, auspicious herbs arise,\nWithin flames of fire, red lotuses bloom.\n\n**Three Poems on Leisurely Roaming at Jade Creek Hermitage**\n\n**I**\nThe Daoist leans on his staff to gaze at Western Mountain,\nHis heart like a drifting white cloud, at ease wherever it goes.\nShould he drift into sleep, a dream of celestial palaces—\nWho would know his body rests amidst emerald peaks?\n\n**II**\nSuddenly recalling a carefree journey beyond the world,\nHe takes up his patterned staff and strides through wooded hills.\nLeaping to the summit of Three Peaks,\nThe empty and clear wellspring stills ten thousand cares.\n\n**III**\nYesterday, recalling an immortal’s roaming to this mountain,\nThe scenes within were all serene and unhurried.\nWhite clouds emerge from the ravine without intent,\nAnd the hidden birds return with men by chance.\n\n**For Master Xin**\nThe Daoist’s heart abides in silent solitude,\nLuminous, round, and bright as a jade gourd.\nClouds come and go without hindrance,\nBirthless and deathless—realizing the traceless.\n\n**For Master Liu**\nThe great Dao is empty and nonexistent, yet naturally so,\nNo need for labored words or endless speech.\nSimply keep the heart free of dust and grime,\nAnd a single point of numinous clarity will shine of itself.\n\n**Ascending the Hall at Taiqing Palace, Bozhou**\nI am Cloud Creek’s indolent husband,\nForced by ancestral court feathered guests to rise.\nBeyond endless prayers for the sage’s longevity,\nI watch for golden scales to rise upon the hook.\n\n**Composed at Qizhen Hermitage, Taiqing Palace**\nA pure breeze summoned me to Qizhen,\nWhere the realm is suddenly cut from worldly dust.\nYet here stand the noble bamboos of winter’s endurance,\nTheir shadows slanting through the window, stirring spirit.\n\nAmidst the bamboo, a hundred birds chirp and clamor,\nRousing me from sleep as the sun climbs high.\nThough men may recognize the ceaseless to-and-fro,\nI alone remain silent within my breast.\n\n**Idleness**\nEver careless, bound by nothing,\nI loosen my robe and idly read Lao-Zhuang.\nSuddenly, reaching the place beyond words,\nMy withered form and bones become like the great void.\n\n**West Garden Fire**\nThe west garden’s fire briefly lifts my face,\nAs I suddenly feel the hermitage’s coolness beneath the pillow.\nTen thousand miles of azure sky, clear as water—\nHow can I bear the moon half-cradled in the mountain’s teeth?\n\n**Reading the *Treatise on Forgotten Intent***\nI searched *Nanhua* for it in vain,\nYet found it required no effort at all.\nKnow that the celestial truth resides within—\nA single point of numinous clarity, ever serene.\n\n**Recording a Dream**\nIn dreams, I beheld sages and worthies descend,\nWhite cranes and green simurghs alighting from jade terraces.\nA single basket of the great return—work unfinished,\nAuspicious clouds swirled and circled once more.\n\n**Again**\nBy the cold window, silent, I slept with books for a pillow,\nAwakening to find the lamp still burning bright.\nBeyond the eaves, moonlight shone clear as day,\nWind stilled, smoke settled—in a time of great peace.\n\n**Admonition to the Magistrate**\nAs an official, do no harm to the people,\nBut devise a hundred ways to bestow kindness anew each day.\n\n**Entering, revere your kin; departing, honor your elders,**\nOutwardly perfecting *ren* and *yi*, inwardly preserving the True.\n*Zhang Gu’s Admonition*\n\nWorldly affairs are manifold, inexhaustible—\nAsk of men, and every matter turns to emptiness in an instant.\nTurn back and recall the primordial thing:\nThrough kalpas of destruction, it endures without beginning or end.\n\nWorldly fame cannot be sought,\nAsk of men, and wealth and rank vanish in an instant.\nHow much better to make early plans to return to the mountains,\nA single wisp of white cloud wandering beyond the heavens.\n*Le Gu’s Admonition*\n\nSouth of the waters, north of the waters, paths crisscross,\nPeople come and go—what is all this bustle for?\nHow much better to sit idly in a hut,\nThe heart untroubled, naturally clear and still.\n*Huo Daoren’s Admonition*\n\nThis borrowed body has passed sixty, half a hundred,\nThe face already aged, beard and temples white.\nWeary of the restless red dust, I have finished my wanderings—\nLet me be a cloud-and-mountain dweller, a rosy-glow guest.\n*Kang Guobao’s Examination Success*\n\nFar off, upon the stream, waters and clouds lie level,\nSteep mountains rise where the Way’s paths begin.\nIf only an autumn wind brings a single sail,\nKnocking at the gate, one glimpse will brighten the eyes.\n*To Shi Wa, Presented to Shi the Daoist*\n\nTo seek the formless and obtain the Mystic Pearl,\nOnce the Mystic Pearl is gained, all things dissolve.\nNever seek appearances within the Dharma,\nKnow that the supreme attainment is *tathatā*.\n*Cuckoo*\n\nGreen mountains, mist-laden, tangled clouds hang low,\nA hidden bird cries urgently day and night.\nWho understands the meaning of its bloodied song?\nEach cry still pleads, *\"Better to go home.\"*\n*Admonition to Du the Daoist*\n\nGreen leaves cast deep shade, veiling the setting sun,\nWhite clouds drift, one by one, across the autumn pond.\nThe Daoist comprehends nothing of worldly affairs,\nHidden in forests and springs, he forgets both favor and disgrace.\n*Presented to Cao the Daoist*\n\nI love the scenery of forests and springs, most secluded,\nWhere white clouds run deep and waters flow east.\nThe Daoist cares not for matters of rise and fall—\nBody and mind wholly free.\n*To Gao Gu of Huaizhou*\n\nThe Daoist’s livelihood fears no poverty,\nHis plain and simple family ways unstained by dust.\nClouds disperse, moonlight bright as day—\nTurning the light inward, he sees the one within.\n*To Shi Huo’s Dong Qilang*\n\nThe ancient Daoist family ways cannot be sought,\nHow long will you keep rummaging through old texts?\nHow much better to cast them aside and return home,\nWhere moon-white skies and blue clouds let waters flow freely.\n*Sent to the Field-Hut Shopkeeper Cao Kongyue, Who Calls Himself \"Water Buffalo\"*\n\nA word to Old Water Buffalo of the Cao family:\nA hempen rope through your nose, pulling you back.\nTime and again, apply the whip—\nOnly when your whole body turns white will you gain freedom.\n*Quanzhen Daoist’s Admonition*\n\nIn the human realm, do not distinguish foolishness from wisdom,\nFor to distinguish foolishness and wisdom is itself delusion.\nTo know the true principle of pure emptiness,\nSeek enlightenment deep in the white clouds, where the subtle and serene abide.\n*To Li Gu of Songzhou*\n\nA thousand paths, ten thousand divergences—only the solitary return,\nFrom the sacred mountain, the precious pearl is gathered.\nLet not the spring wind reveal idle tidings—\nWithin, the cloud-wrapped bud has yet to open.\n\nOver ten thousand waters and a thousand mountains, the path does not err,\nFirst to pluck the cassia branch in the Moon Palace.\nDiligently presented to Father Danyang—\nPermitted to claim the first place among Penglai’s families.\n*To Zhang Gu of Songzhou*\n\nTo grasp the wordless principle is deepest,\nNo need to wander far in search of a knowing friend.\nSuddenly letting go, every direction is it—\nA heart of pure emptiness, clear and serene.\n*Presented to Duji, Prefect of Songzhou*\n\nDeep in green mountains, white clouds idle,\nYet I recall those idle clouds, how they once came to the peaks.\nA dark path through mist-laden trees,\nA wooden man still passes through emerald haze.\n*Wang the Daoist’s Admonition*\n\nDiligently whet the sword of wisdom to sever ignorance,\nSpew forth numinous radiance, dissolving all perceptions.\nFrom this moment, body and mind know no obstruction—\nThe Primordial Lord follows wherever you go.\n*To Master Lang the Twelfth*\n\nOver ten thousand waters and a thousand mountains, the path does not err,\nMountains wind, paths turn—scenery ever more fine.\nOld friends meet, no other words—\nSitting together beneath deep peaks, gazing at rosy clouds.\n*Presented to Shi Huo’s Ma the Daoist*\n\nA quiet mountain village near forests and springs,\nSpring ends, no one stirs, willows trail mist.\nIf you wish to know where I’ve gone after parting,\nLeisurely in Penglai, gazing upon the jade-walled heavens.\n*Presented to Zhang the Immortal*\n\nThe Daoist exerts himself in forward cultivation,\nTo the ends of sea and sky, making it his limit.\nOnly after wearing through iron shoes does he awaken—\nTen thousand mountains, a thousand waters, all at once cease.\n*Admonition to Master He of Dengcheng County*\n\nThe Daoist’s true work lies in sincerity,\nNo need for alchemical classics or the *Book of Master Zhuang*.\nHaving awakened to a single word, its practice never ends—\nSerene and still, he sits in the realm of *Vairocana*.\n*For Tang the Abbess’ Birthday*\n\nBeyond kalpas, the numinous fungus needs no spring,\nWithin the gourd’s realm, no dust remains.\nAt heaven’s edge, the elms gleam white,\nIn the moon’s embrace, the cassia renews itself.\n*Wang the Daoist’s Admonition*\n\nLeaping from the red dust, the body is at ease,\nWithin it, life and death become distinct.\nUnobstructed, carefree in nature—\nWhy strive to soar a hundred thousand leagues?\n*To Little Li Gu*\n\nWashing away worldly passions, all things vanish,\nThe numinous terrace gleams, clear as an ice-jade vessel.\nNo need to ask the patriarch’s intent—\nClapping, the empty void holds a single pearl.\n*Admonition to Elder Bian*\n\nSeventy years an old rogue,\nChattering of Chan, discoursing on the Dao—when will it end?\nEven if all ten thousand Dharmas are fully illuminated,\nWithout reaching the ash-like heart, clear as autumn, it is not enough.\n*Chang Gu’s Admonition*\n\nSeeking teachers, visiting the Way, painfully inquiring,\nBody and mind bound, not free.\nSweeping away endless abstruse discourses—\nA bright moon rises above the mountain’s crest.\n*Presented to Director Han*\n\nLeaping from the red dust, all things cease,\nBody and world entrusted to the empty boat.\nDeep in azure waves, casting fragrant bait—\nWho says the golden turtle will not take the hook?\n*Presented to Commander Mu Hu*\n\nStaff in hand, drifting like tumbleweed, carefree,\nCloud companions come to visit among waters and clouds.\nA single meeting, a seat of unborn discourse—\nUnaware, the red sun sinks behind the western hills.\n*Zhao the Daoist’s Admonition*\n\nOne evening’s autumn wind, ten thousand leaves wither,\nThe Daoist’s livelihood grows ever more desolate.\nWashing away the dust of worldly cares,\nThe Penglai and Kunlun paths lie not far off.\n*Admonition to Xu Gu*\n\nTo cultivate immortality, first cast off self and others,\nTo study the Dao, guard against comparing right and wrong.\nOn Seven-Treasure Mountain, the smoke and fire fade,\nWithin the Five-Light Palace, *Muni* is realized.\n*Presented to Vice Commissioner Zhang*\n\nThis body is a drifting leaf of a boat,\nUnafraid of wind and waves, it comes to wander.\nDeep in misty waves, casting fragrant bait—\nWithout catching the divine turtle, it will not rest.\n*Again*\n\nIn a hempen robe, staff in hand, drifting away,\nA single wisp of solitary cloud between heaven and earth.\n\nWherever I go, I cannot become rain or dew,\nYet I return to the forest to companion the green mountains.\n*Presented to Young Master Zhang*\n\nAutumn winds sweep the cosmos clean,\nTen thousand miles without a cloud, the Great Purity spotless.\nOnly a single wheel of the formless moon,\nBefore heaven and earth, turns ever more bright.\n*Shown to Ma the Daoist of Hanyang*\n\nEast and west, a wanderer to the ends of the earth,\nNorth and south, seeking the mystery as a carefree immortal.\nHaving grasped the patriarch’s eye beyond kalpas,\nReturning, I see my own heaven.\n*Shown to Wang the Daoist*\n\nFor a decade, I wandered all quarters with staff in hand,\nLittle knowing that movement and stillness follow one another.\nYet among the clever ghosts who trade in bones,\nI awaken the master before heaven and earth.\n*Shown to Zhou the Daoist*\n\nA stalwart man’s seven-foot frame,\nLicking honey from a blade’s edge—this is no true man.\nKnow that you possess a natural treasure,\nIn vain do you seek the pearl beneath the black dragon’s chin.\n*Sent to Magistrate Nalan of Mianchi*\n\nTo govern with impartiality surpasses the practice of the Dao,\nThis saying should be inscribed on the sashes of all officials.\nDo not seek out hemp-robed recluses beyond the world,\nBut rather use good medicine to succor the suffering people.\n*Presented to Master Song*\n\nNot reading alchemical classics or the books of the sages,\nCome swiftly to a heart without a speck of dust.\nThis body then befriends the clouds,\nGoing and staying with them, coiling and unfurling.\n*Announcement by Yuan the Daoist*\n\nThe Great Dao is empty and nonexistent, fundamentally natural,\nLet it twist and turn—just follow its green hues.\nSuccess and failure, nobility and lowliness are all fated,\nCleverness and clumsiness, wisdom and folly rest with heaven.\n*Presented to Zhang the Recorder of the Central Capital*\n\nLong enamored of the red dust, coming and going often,\nHow could you know that hermits dwell in forests and springs?\nGreedily watching dewdrops on flower tips at sunrise,\nYou lose the everlasting spring within the gourd.\n*Announcement to Chief Wang*\n\nBreaking open chaos to see the celestial truth,\nLeaping beyond the red dust as a carefree person.\nIdly gazing in the mirror to observe transformations,\nDo not let the mirror transform your own body.\n*Presented to Vice Commissioner Zhang*\n\nI originally held my rod to fish for the giant turtle,\nLet the winds rage and waves rise.\nAs long as the divine creature swallows the fragrant bait,\nTen thousand miles of soaring winds will not deter me.\n*Presented to the Judge of the Bureau of Astronomy*\n\nA lofty person taps at the gate with staff in hand,\nComing to visit a hemp-robed man with a bamboo bowl.\nThe Dao is present at a glance, forgetting argument,\nGoing with an empty heart, returning with fulfillment.\n*Announcement to Chai the Daoist*\n\nWithin the body, stillness and few idle thoughts,\nIn the world, harmony and abundant qi.\nClean winds ever at my sides,\nA single crimson ribbon emerges from misty vines.\n*Sent to Zhang the Daoist*\n\nAlready having cast off this body like a silk thread,\nA hundred kinds of fragrant bait hold no allure.\nThe Yangtze’s boundless waves remain fine,\nDo not let worldly dust reach the brocade-scaled fish.\n*Presented to Chief Zhao*\n\nSpring’s light, counted on the fingers, has passed another autumn,\nWhen will the trade in bones ever end?\nKindness and love form their livelihood,\nThis body becomes ox and horse for others.\n*Presented to the Recluse Zhao of Yanshi County*\n\nAwakened, Penglai lies but a footstep away,\nDeluded, endless dust stretches on.\nA single lamp’s flame, just trimmed,\nDo not let the oil run out and darkness return.\n*Presented to Old Shi the Daoist*\n\nWithin the gourd, golden towers and jade terraces,\nAmid the moon, jasper flowers bloom resplendently.\nCranes cry in the azure sky, cinnabar phoenixes dance,\nDeep in colored clouds lies Penglai.\n*Presented to Zhao the Daoist*\n\nThe numinous terrace’s single point is originally without dust,\nIllusory empty bodies manifest as dharma bodies.\nThe Dao resides within your nature—do not seek elsewhere,\nResponding to circumstances with spontaneity is celestial truth.\n*Shown to Chief Zhang of Longwo*\n\nHow many know the gate of my family?\nThose who know must understand the mechanism of creation.\nWithin stillness lies wondrous function,\nWithin non-action hides the profound and subtle.\n*Announcement by Quan the Daoist*\n\nWho could bear to carve and cook?\nAxes and hatchets ultimately cannot shape the gnarled.\nWhether talented or not, all have their use,\nWhy then this life as a wooden crow?\n*Announcement by Tian the Daoist*\n\nTo study the Dao, first comprehend spontaneity,\nOnly then can you attain the true immortal.\nDense or sparse, all is vain inversion,\nYou strive in vain, like drilling ice to make fire.\n*Shown to the Three Lords’ Temple of Nanjing and Ke the Daoist*\n\nTrue purity, true stillness, ever unbroken,\nRefining qi first requires recognizing spontaneity.\nA single grain of cinnabar, ninefold transmutation,\nAuspicious radiance in ten thousand strands veils the golden immortal.\n*Shown to Yuan the Immortal*\n\nAt the outset of entering the Dao, do not delay,\nIt is best to polish yourself diligently in the forest.\nDo not let new dust tarnish the precious mirror,\nBeware lest old realms harm celestial harmony.\n*Presented to Liang the Daoist*\n\nThe luminous pearl reflects the great sun,\nWithin the crystal palace, it emits radiance.\nThis body possesses an inexhaustible treasure,\nYet for fleeting life, you toil in vain.\n*Passing Mengjin*\n\nRolling smoke and waves flow eastward,\nBathing the sun, floating clouds—how many autumns?\nIf you obtain the numinous raft to roam the great sea,\nIn Fusang’s land, you will see Yingzhou.\n*Shown to the Carpenter Yang the Immortal*\n\nTraversing a thousand mountains, ten thousand mountains,\nThis body remains as leisurely as white clouds.\nReturning to lie and watch the moon in the azure sky,\nPine winds clamor in the ears, chilling to the bone.\n*Announcement by Dong the Observer of Knowing*\n\nGreat awakening reveals there is nothing to be done,\nMysterious words and secret sayings are all swept away.\nReleasing hands east and west, trusting spontaneity,\nTapping a staff, roaming carefree through vast deserts.\n*Presented to Tian the Daoist of Mount Song*\n\nHaving attained carefree wandering, I visit old friends,\nStill cloud-hidden, nurturing celestial truth.\nThe west wind blows the moon from the pine’s tip,\nSitting, I await the sun’s wheel rolling from Fusang.\n*Announcement to Chief Chu of the County*\n\nWithin the gate of Complete Perfection, selecting immortal material,\nYou tread through clouds and mountains for this very purpose.\nOur Dao is easy to practice, no empty words,\nTurning the world’s currents upside down is Penglai.\n*Ode to Snow*\n\nThe north wind is fierce and mighty,\nBlowing fallen heavenly flowers to blanket the earth.\nPeach and plum do not yet know the heavens’ intent,\nWinter plum first senses the workings of creation.\n*Announcement to Li the Supervisor of Taxes in Yanshi County*\n\nBreaking free from the boundless waves of desire,\nCleverness and wisdom truly surpass immortal material.\nThe celestial numinous treasure is hard for people to find,\nI entrust it to the shadowless terrace of the Southern Palace.\n*Shown to Shi the Daoist*\n\nThe gate of all wonders renews daily,\nThe family’s custom is pure and free from the slightest dust.\nIdly summoning the long-lived guests beyond the clouds,\nTogether we enjoy the unwaning spring within the gourd.\n*Self-Contentment*\n\nWind passes through the courtyard pines, calling me from noon slumber,\nAwakening, the stone tripod still holds sinking smoke.\nNot seeking feathered transformation to ride cloud-cranes,\nI content myself as a mortal immortal on earth.\n*Farewell to the Supreme Clarity Palace*\n\nWestward I go, the west wind blowing my Daoist robes,\nAt the ancestral court, I have not yet attained true reliance.\n\nThe apes of other mountains and cranes of leisure have turned green,\nEntrusted with the white clouds, I shall return again.\n*For Master Shang the Immortal*\n\nIn the unseen, ghostly realms are ever dispatched,\nBeyond the world, the gate of mystery opens daily.\nMozi grieved that silk is dyed by nature,\nYang Zhu wept on the road, never to return.\n*For Officer Li*\n\nA thousand leagues of misty waves, a single-leaf boat,\nLight sail and short oar drift midstream.\nIn the glow of the toad’s light, idly I fish,\nHeedless whether the whale takes the hook.\n*For Daoist Friends in Chenzhou*\n\nWith merit achieved and name attained, best to withdraw,\nBecoming a carefree man of forests and springs.\nGathering the sun’s essence as the great elixir,\nRefining the moon’s spirit to manifest the yang spirit.\n*For Officer Li of Fei Village*\n\nNot yet having abandoned the world’s dust in learning the Dao,\nThe seas and mountains accumulate grain by grain.\nTake further steps through the gate of mystery,\nFor Penglai holds another heaven within its caves.\n*For Daoist Friend of Baisha*\n\nRestrain the wildness of apes and horses, lock them tight,\nDo not crave worldly pleasures, heart drunk with desire.\nAwakened, leap beyond the gate of life and death,\nThe true nature of the spirit flows without obstruction.\n*For Daoist Friend Li*\n\nThe immortal’s five-acre Penglai isle,\nFour hundred autumn waves, exceptionally clear.\nSight and sound need not bind ears and eyes,\nOn the path of the subtle and tranquil, level as a plain.\n*For Kou Tian and Jiang Menyou*\n\nEach person merely recites Amitābha’s name,\nYet does one truly grasp Amitābha’s self?\nRemember the original ancestor without form—\nUnconnected to prajñā or pāramitā.\n\n*For Lay Leader Li*\n\nThe gate of all wonders opens day by day,\nThe house’s ancient wind steep and free of dust.\nThough plain and without distraction,\nIt does not permit the careless to enter.\n\n*For Ren the Laywoman*\n\nShatter the knot of doubt and laugh aloud,\nNo need to wander far in search of answers.\nWhat fills your breast shines bright as the moon—\nWhy seek another’s candle in the night?\n\n*For Daoist Shi*\n\nBeyond things lies the subtle and profound,\nOne side collapses as the other rises.\nLater guests of Penglai Isle\nWalk not the road to E.\n\n*For Lay Leader Chen*\n\nA bend of flowing water, Cloud Creek’s stream,\nDay and night murmurs the mechanism of the Dao.\nHow many come and go, seekers of fame and gain,\nGreedy to watch the waves, blind to the subtle.\n\n*For Daoist Wang*\n\nA straight hook does not hook the moon in waves,\nFine nets cannot scoop clouds from the water’s depths.\nExhausting body and mind, you stray far from the Way—\nRelease all conditions, and transmission may be yours.\n\n*For the Elder of Longxi*\n\nGazing eastward, leaves fly from the trees,\nAutumn’s qi fills the sky, pressing upon one’s robes.\nThe immortal elder has reached the cinnabar heavens,\nLeisurely facing green pines, sipping the azure mist.\n\n*For Laywoman Li the Younger*\n\nTo leave the household, one must learn to be an immortal,\nTo make good karma for long life.\nIf but one thought lingers here,\nA golden lotus will bloom in the Jasper Pool.\n\n*For Clerk Liu*\n\nBeyond the dust of splendor, a guest of Three Mountains,\nA single leaf of a boat upon the bitter sea’s waves.\nCast silk and thread into the deep swells—\nWhich fish among them would take the hook?\n\n*For Daoist Ji and Li the Grinder*\n\nCease thoughts, forget schemes, follow nature,\nNo need to seek the Dao or study Chan.\nA drifting wisp of idle cloud arises—\nIt obstructs the ever-bright heaven within the gourd.\n\n*For Lay Leader Ji of Xiashi County*\n\nIn dreams, one speaks of dreams’ affairs,\nAwakened, one knows the dream is done.\nBrush the stone by South Creek, watch things transform,\nThe waters flow ever eastward as before.\n\n*For Lay Leader of Shanzhou*\n\nThe elixir of spirit is ever grasped in the palm,\nThe mirror of mystery rests only in the heart.\nIlluminating the world’s illusory realms,\nNaturally the body drifts like a wild cloud at ease.\n\n*For Daoist Wang of Jade Creek Hermitage*\n\nWhere in life is there no freedom?\nWhat matter if mountain village or marketplace?\nWhen the inch of heart is free of all fear,\nEven among tigers and wolves, one is at peace.\n\n*For Lay Leader Xia of Fei Village*\n\nMy family’s gate is profoundly mysterious,\nSilent and empty, following nature.\nSpeak not of length or brevity, great or small—\nHungry, eat; weary, sleep.\n\n*Retiring from the Hall of Great Clarity*\n\nI was once a guest on Peach Blossom Peak,\nSuddenly leaving traces among men.\nThough the ancestral court is fine, the cause was early—\nFor now, let the white clouds return to their home mountain.\n\n*Again*\n\nThe wind’s chariot drifts lightly to the ancestral court,\nAuspicious smoke, fragrant grasses, sweet osmanthus.\nThe cause not yet complete, one must turn back—\nReturn to Yi River, to rest beneath brocade curtains.\n\n*Returning to the Longevity Abbey*\n\nSeeing through the ancient mask from the start,\nA thousand wrongs, ten thousand slanders—let them be.\nLight smoke, thin mist vainly obscure,\nThe distant mountains remain unfurrowed.\n\n*Self-Expression*\n\nSever the opening at the head, no sound arises,\nThe dark pearl is gathered into a jeweled vase.\nFrom now on, no boasting of foolishness or wisdom—\nWhen the general is idle, there is great peace.\n\n*Visiting Lord Lao Mountain*\n\nSleeves fluttering in the wind, stepping from the mountain gate,\nTurning back, the green peaks resemble Lord Lao.\nListen to the clear spring converse with the mountain companion—\nIt clearly speaks the entirety of the Five Thousand Characters.\n\n*For Daoist Hu of Zhicha Mountain*\n\nDeep in the tangled mountains, thatched hut is built,\nTen thousand acres of clouds and mist cannot be swept away.\nThe immortal boy gathering herbs in wind-blown sleeves—\nRare fragrance follows as purple mushrooms appear.\n\n*For Lay Leader Zhang*\n\nTo be immortal or Buddha requires effort,\nDust-thoughts and dust-heart must be carefully removed.\nWhen the numinous brightness illuminates the cosmos,\nOnly then do you know the dregs of worldly books.\n\n*For Lady Controller Puchá*\n\nI love the extraordinary scenes of forests and springs,\nHeaven’s wind scatters the fragrance of osmanthus.\nThe traveler, about to depart, turns back again—\nLaughing at the futile busyness of floating life.\n\n*For Lady Puchá’s Longevity*\n\nThe Daoist would also wish her long life,\nYet worldly affairs are dark and unknown.\nA single grain of the immortal elixir—pray take it—\nPine years and crane tallies are nothing strange.\n\n*For Lady Sun, Wife of the Grand Preceptor*\n\nBefore merit and fame are complete, the body ages first,\nWhite hair, a pale face—too late to begin.\nSuddenly awakened, this body is not mine—\nTrue emptiness unmoved, a single cloud drifts.\n\n*For Lay Leader Tian*\n\nRadiant and luminous, this is the heart,\nA single word casts a shadow, creating heavy darkness.\nThe true message lies in pure emptiness—\nDo not seek it among the methods of the many schools.\n\n*For Laywoman Ma*\n\nCreation is endless, naturally so,\nNo need to seek immortality beyond the body.\nWhere the light of heaven shines, worldly passions vanish,\nWhen the precious mirror is bright, the Dao-eye is whole.\n\n*End of the Lower Scroll of the Collected Works of the Old Man of Li Peak*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "离峰老人集卷上_七言律诗 经名：离峰老人集。 金全真道士于道显着。 二卷。 底本出处：《正统道藏》正一部。 七言律诗 述怀 翠岩西畔道人家，门外闲田褊野花。 蝴蝶纷纷犹是梦，游蜂忽忽未忘衙。 云问童子担灵药，空裹仙人步彩霞。 闲想红尘名利客，不知壶内有天涯。 又 漠漠青姻锁翠微，潇潇落叶四檐飞。 红尘事少梦魂好，碧汉云横星斗稀。 水玲霜清鱼不食，山穷木瘦树无衣。 道人度日疏慵裹，门外纷纷总是非。 又 红尘汨汨几时休，去作逍遥物外游。 好水好山行不尽，奇花奇果景何幽。 风来药圃清香细，月到芝田紫艳浮。 闲向林泉佳处隐，世问何事上眉头。 又 南山一望胜天平，天宇浮岚入眼清。 自古神仙多隐迹，至今羽士学长生。 人间兴废成今古，云气翻腾变晦明。 只有老松并怪石，青青不改四时荣。 又 达人生死莫能拘，解着神机应万殊。 显即恰如云绽月，晦时还似蚌含珠。 冥冥内照灵明主，赫赫融开造化炉。 炼就金丹无昼夜，万条红焰晃冰壶。 又 暑往寒来气自然，西风又是桂花天。 山空木落乌依树，霜降水寒鱼在渊。 物外云朋忽相访，洞中幽客正高眠。 杖华轻烛琅牙响，唤起华胥梦裹仙。 又 不学参玄与问禅，一庵潇洒寄林泉。 空中天籁宫商意，物外家风道德篇。 一枕闲眠芳草畔，数声樵唱夕阳边。 此身未得胶鸾去，且作逍遥陆地仙。 又",
      "translated_text": "**Li Feng Lao Ren Ji, Volume One – Seven-Character Regulated Verse**\n\n**Title:** *Li Feng Lao Ren Ji* (Collected Works of the Old Man of Departed Peak). Composed by Jin Quanzhen Daoist Yu Daoxian. Two volumes. Source text: *Zhengtong Daozang*, Orthodox Section, Part One.\n\n**Seven-Character Regulated Verse**\n\n**Reflections**\nBy the western crags of Emerald Cliff, the Daoist’s home,\nBeyond the gate, idle fields and wildflowers grow.\nButterflies flutter—still but a dream,\nWandering bees dart—yet courtly cares remain.\nA boy in the clouds bears elixirs divine,\nWhile immortals in the void tread rainbow shine.\nIdle, I muse on red-dust seekers of fame,\nUnknowing the boundless skies within the gourd’s frame.\n\n**Again**\nVague mists veil the verdant peaks in gray,\nFalling leaves drift past the eaves this day.\nFew worldly affairs—dreams and soul are light,\nThe azure vault spans, stars sparse in the night.\nFrost chills the stream, fish refuse the bait,\nBare mountains stand, trees stripped of their state.\nThe Daoist passes days in careless ease,\nWhile outside his gate, the clamor never ceases.\n\n**Again**\nWhen will the red dust’s rush ever end?\nI wander beyond, free as the wind.\nFair waters and mountains stretch without cease,\nRare blossoms and fruits in tranquil peace.\nBreezes brush the herb garden, fragrance fine,\nMoonlight gilds the lingzhi fields in purple shine.\nLeisurely by streams and woods I hide,\nWhy fret the world’s woes, knitting the brow’s pride?\n\n**Again**\nGazing south to the mountains, loftier than the sky,\nMist-wreathed peaks rise, the heavens nigh.\nSince ancient times, immortals hide their trace,\nTo this day, feathered scholars seek long life’s grace.\nThe world’s rise and fall shift through time’s tide,\nClouds surge and fade, dark and bright abide.\nOnly the ancient pines and rugged stone remain,\nEvergreen through the seasons, unchanged, sustain.\n\n**Again**\nThe enlightened transcend life and death’s decree,\nMastering the subtle, they move with boundless glee.\nManifest—like moon unveiled through parting cloud,\nHidden—like pearl cradled in the oyster’s shroud.\nInwardly, the radiant spirit shines bright,\nFiercely, the alchemical furnace burns with light.\nForged is the golden elixir, day and night,\nTen thousand crimson flames gleam in the crystal’s sight.\n\n**Again**\nHeat departs, cold arrives—qi flows as fate,\nWest winds herald the osmanthus’ blooming state.\nTrees stand bare, birds nest in branches high,\nFrost descends, waters chill, fish dive nigh.\nCloud-bound friends from beyond the world appear,\nWhile the cave’s reclusive guest slumbers deep and clear.\nA staff of jade taps, its chime crisp and bright,\nRousing the dreamer from Huaxu’s flight.\n\n**Again**\nI do not study mysteries or seek Chan’s gate,\nA simple hut in the woods is my fate.\nHeavenly music drifts in the empty air,\nBeyond the world, the Way and virtue are my care.\nBy fragrant grasses, I sleep at ease,\nWoodcutters’ songs drift with the sunset’s breeze.\nThis body has yet to ride the phoenix away,\nSo I wander free as an earthbound immortal’s play.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 625,
      "start_sentence": 0,
      "end_sentence": 41,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.185011625289917,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\离峰老人集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "傍人笑我太风魔，这个风魔会得么。 已与沙鸥盟梦岸，更随山鹿上姻萝。 三竿日底劓够睡，一曲人问踏踏歌。 归去吾乡安稳处，看他平地起干戈。 偶书 翩翩风袖碧云端，曾伴洪崖到洞天。 去驭华芝鸾下界，来柄琪树鹤千年。 紫霞吐焰笼丹鼎，明月生光罩瑞莲。 苍佩一时低拂地，金童传下玉皇宣。 姻霞亭 危亭缥缈出云霄，十二栏干眺望饶。 回首尘寰如撮土，有时天籁自吹箫。 远山木末重重翠，细柳风中万万条。 咫尺姻霞人不到，蓬壶仙路信非遥。 示人 为佛为仙在寸心，可能尘世废光阴。 蹉跎望道期程远，迤迩劳生岁月深。 已醉利名浓似酒，不将神气惜如金。 琴心三迭胎仙舞，欲作玄门座右箴。 因迷人索路作 六窗通达见天光，彻去藩篱是大方。 至道有归皆坦直，迷人着处自彷徨。 程程尽是长安路，在在无非广漠乡。 传塞挟书都拨置，更於何处觅亡羊。 答人 有人向我问玄珠，一点灵光照玉壶。 亘古亘今长不灭，先天先地几曾无。 六尘堆裹存真宰，七宝山头弄假躯。 此个家风人会得，不劳足力驾云舆。 又 悟时拂散利名尘，作个逍遥自在人。 闲向溪头盟水乌，偶来林下睡莎茵。 纷纷俗事终无限，扰扰愚人不识真。 只见目前生与灭，那知壶内有长春。 寄郎大师俗隐 已别经今十有年，岁华易得道依然。 韬光晦迹潜真士，接物随机应世贤。 郑圃生涯畦陇外，漆园意气水云边。 百年拔宅超云汉，人世清名万古传。 示张都监 莫恋浮华悟此身，好将恬淡养天真。 眼前便是梦中梦，觉后方知身外身。 壶内好栽无影树，洞中先得未萌春。 纷纷俗辈应难辩，赫赫天光日转新。 幽居 门外清流屋上山，偶来此地寄安闲。 书因遮眼有时读，名恶为宾无意攀。 修竹种成千万个，茅庐结就两三问。 幽情犹有云相友，暮卷朝舒数往还。 示小张仙 儿童笑指布袍宽，上界仙衣总一般。 鹤唳青霄云冉冉，鸾呜凤阙月团团。 金童紫府分琼屑，玉女丹台辊魄丸。 昨日玉皇忙韶下，已书名字上仙班。 示玉溪庵主 道人脚底片云生，欲作逍遥物外行。 尽把黄尘衣上拂，却将明月杖头横。 数峰平地画图起，一见使人毛骨清。 便欲终焉谋此地，尽他世上利和名。 示石蜗杨庵主 落魄谁知却丈夫，人问富贵视如无。 居邻云水安常静，委分箪瓢不强图。 但得物来心似镜，从他人笑貌如愚。 虚空荡荡无遮障，万里青霄一颗珠。 寄张官欲出家 丈夫临庾莫徘徊，好念柄真早早来。 大道悟时须寂灭，浮生识破尽尘埃。 亦凭假合修丹药，暂借精神结圣胎。 脱了阴阳无造化，先天一物照灵台。 寄李庵主 心地逍遥气自和，从他人世自风波。 玉轮欲见清光满，宝剑犹须利石磨。 斫却孽蠡闲障碍，会看丹桂复婆娑。 烂然一色成金界，塞满乾坤不厌多。 寄嵩州刘二官 盖世功名身外事，掀天富贵世问荣。 觉来只是须臾梦，悟后元无宠辱惊。 宝月天心人共见，骊珠海底独增明。 人问上士怀仁惠，正好将心进一程。 示韩会首 力命穷通各有因，不须呻诉笑声频。 恢恢天网疏无漏，密密枢机暗有神。 日月亏盈皆运数，阴阳生杀岂疏亲。 我观造化南柯梦，谁作连然睡觉人。 示刘姑 跳出红尘须做彻，心清意静添央烈。 宝剑腾辉万焰寒，琼花开满群芳灭。 紫府真人下玉京，云车月席旌幢列。",
      "translated_text": "**On Others Mocking My Madness**\nFools laugh that I’m too wild, too strange—\nBut do they know this madness’ range?\nI’ve sworn with gulls on dreamlit shores,\nAnd followed deer through misted moors.\nBeneath three rods of sun, I sleep,\nWhile men hum tunes on dusty streets so deep.\nReturning to my homeland’s peace,\nI watch them raise their wars on common ground with ease.\n\n**Casual Verse**\nLight as wind, my sleeves dance in azure skies,\nOnce I rode with Hong Ya to caverned paradise.\nI drove the phoenix down with magic herbs in hand,\nAnd perched upon the jade-tree where cranes command.\nPurple mist breathes flames around the alchemical flame,\nBright moon’s glow crowns the sacred lotus’ frame.\nAs my jasper pendants brush the earth so low,\nThe Golden Lad descends with Heaven’s decree in tow.\n\n**Yin Xia Pavilion**\nA perilous pavilion pierces clouded heights,\nIts twelve balustrades command boundless sights.\nTurn your head—the mortal world shrinks to a grain,\nYet sometimes heaven’s breath plays the flute’s refrain.\nDistant peaks layer their emerald at treetops’ crest,\nWillows sway in winds with ten thousand threads dressed.\nSo near, yet none tread the misted path below—\nThe immortal’s road to Penglai is not far, I know.\n\n**For Others**\nTo be Buddha or immortal lies within the heart,\nCan one waste this life in dust’s dark art?\nThe Way seems distant, time slips by in vain,\nWhile fleeting years carve labor’s endless chain.\nDrunk on fame and profit, thick as wine,\nYet never guard the spirit’s gold divine.\nThe zither’s three-fold song stirs the immortal’s dance—\nI’ll make it the maxim by my seat’s advance.\n\n**For the Lost Seeker**\nSix windows open to the sky’s pure light,\nBreak all barriers—this is true insight.\nThe Great Dao’s path is ever straight and clear,\nYet lost ones wander where they need not fear.\nEvery road leads to Chang’an’s gate,\nYet none escape the boundless desert’s weight.\nCast aside your books, your burdens lay—\nWhere else to seek the sheep that strayed away?\n\n**In Reply**\nOne asked me of the Mystic Pearl’s glow—\nA single spark of light fills the jade jar’s flow.\nFrom ancient past to now, it never fades,\nBefore heaven and earth, it never strayed.\nWithin the six dusts, the True Lord abides,\nAtop the Seven Treasures’ peak, the false self hides.\nWho grasps this lineage’s truth with ease,\nNeeds no cloud-chariot to ride the breeze.\n\n**Again**\nAwakened, I brush off fame and dust,\nA carefree soul in freedom’s trust.\nBy streams I pledge with waterfowl,\nIn forests, I sleep on moss so cool.\nEndless worldly cares will never cease,\nFoolish men chase shadows, blind to peace.\nThey see only life and death before their eyes,\nUnknowing the eternal spring the gourd supplies.\n\n**To Master Lang, the Recluse**\nA decade has passed since we parted ways,\nYet time flows on, and Dao remains always.\nYou veil your light, hide your truth so deep,\nYet meet the world with wisdom’s leap.\nBeyond the fields, your life takes root,\nBy rivers and clouds, your spirit’s mute.\nA hundred years hence, your home will rise,\nYour name in purity through endless skies.\n\n**For Prefect Zhang**\nDo not cling to fleeting splendor—know your self,\nNurture tranquility to guard your inner wealth.\nThe dream within the dream is all you see,\nAwake, you’ll find the self beyond the self to be.\nIn the gourd, plant the shadowless tree,\nIn the cave, grasp spring before its spree.\nThe vulgar crowd will never understand,\nWhile heaven’s radiance shines, ever grand.\n\n**Secluded Dwelling**\nBeyond my door, clear streams; above, the mountain stands,\nHere I dwell in leisure, free from worldly bands.\nBooks shield my eyes when reading’s due,\nFame and profit—guests I never pursue.\nA thousand bamboo shoots I’ve grown,\nTwo or three thatched huts I’ve sown.\nClouds remain my steadfast friends,\nAt dusk they gather, at dawn they wend.\n\n**For Little Zhang, the Immortal**\nChildren point and laugh at my coarse robe’s sway,\nYet immortal garb is just the same in heaven’s array.\nCranes cry in azure skies, clouds drift slow,\nPhoenixes sing at the moonlit palace’s glow.\nGolden Lads from the Purple Court share jade’s grace,\nJade Maidens roll the elixir’s sphere in that place.\nYesterday, the Jade Emperor’s decree came down—\nYour name is written in the immortal’s crown.\n\n**For the Abbot of Yu Xi Hermitage**\nThe Daoist’s feet stir clouds as he goes,\nSeeking freedom beyond worldly woes.\nHe brushes the yellow dust from his gown,\nAnd rests his moonlit staff as he roams the town.\nPeaks rise like paintings from the plain,\nTheir chill purity strikes the soul again.\nHere I’d stay forever, let the world pursue\nIts fleeting gains—what are they to me and you?\n\n**For Abbot Yang of Shi Wo Hermitage**\nWho knows the fallen man is truly bold?\nIn mortal eyes, wealth and rank are cold.\nBeside clouds and waters, he finds his rest,\nContent with frugal fare, his lot the best.\nWhen things arise, his heart stays clear as glass,\nThough men may laugh, he wears his folly’s mask.\nVast and empty, the void knows no screen—\nA single pearl gleams in the azure sheen.\n\n**To Zhang Guan, Who Wishes to Leave the World**\nMan of resolve, do not hesitate,\nSeek the true root ere it’s too late.\nWhen the Great Dao is grasped, all fades to still,\nThe floating life dissolves in dust’s chill.\nThrough temporary forms, refine the elixir’s art,\nBorrow the spirit to forge the sacred heart.\nFree from yin and yang, beyond creation’s sway,\nThe primordial One illumines the mind’s array.\n\n**To Abbot Li**\nThe heart roams free, the qi flows in harmony,\nLet the world’s storms rage endlessly.\nThe jade wheel’s light will soon be full and bright,\nThe precious sword still needs the whetstone’s bite.\nCut through the karmic vines that block the way,\nSoon you’ll dance beneath the cinnamon’s sway.\nAll turns to gold in radiant unity,\nFilling heaven and earth—no need for more, you see.\n\n**To Liu Erguan of Songzhou**\nWorldly fame and wealth are but fleeting things,\nHonor and glory—mere mortal flings.\nAwake, it’s all a moment’s dream,\nEnlightened, no praise or scorn can seem.\nThe moon’s jewel shines for all to see,\nYet in the sea’s depths, its light burns free.\nThe world’s noble men hold kindness dear—\nTake your heart and advance another year.\n\n**For Director Han**\nFate and effort each have their cause,\nNo need for sighs or bitter pause.\nHeaven’s net is vast, its mesh wide,\nYet the subtle hinge moves, unseen, inside.\nMoon waxes and wanes by cosmic decree,\nYin and yang’s dance—who’s near, who’s free?\nI see creation as a fleeting dream,\nWho then is the one who wakes from this scheme?\n\n**For Madam Liu**\nLeap from the red dust, make your break complete,\nWith heart serene and will unshaken, sweet.\nThe precious sword’s glow chills a thousand flames,\nThe jade flower blooms, all other blossoms wane.\nFrom the Purple Court, the True One descends,\nCloud chariots and moonlit seats, banners extend.",
      "overlap_context": "reclusive guest slumbers deep and clear.\nA staff of jade taps, its chime crisp and bright,\nRousing the dreamer from Huaxu’s flight.\n\n**Again**\nI do not study mysteries or seek Chan’s gate,\nA simple hut in the woods is my fate.\nHeavenly music drifts in the empty air,\nBeyond the world, the Way and virtue are my care.\nBy fragrant grasses, I sleep at ease,\nWoodcutters’ songs drift with the sunset’s breeze.\nThis body has yet to ride the phoenix away,\nSo I wander free as an earthbound immortal’s play.",
      "start_char": 625,
      "end_char": 2091,
      "start_sentence": 42,
      "end_sentence": 129,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.89796304702759,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\离峰老人集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "手掌还丹晃太虚，比时不用黄金屑。 示朮虎万户 功成名遂早归山，落得身安心更闲。 返视红尘真墨梦，竟无灵药驻朱颜。 居连蓬岛何由俗，门寄姻萝不用关。 忽有一丸金弹出，飞胜来往照人问。 示夹谷都统 得失穷通任自然，不须欣喜与忧煎。 今生富贵前生种，见在修持过去绿。 广武坡头些子快，杜邮亭下几多愆。 还一报何年尽，学我同修物外仙。 寄张副使 莫恋浮华欲境侵，蓬壶仙景转难寻。 丹台神炉浮埃翳，月殿灵芝野草深。 试问穷他无尽事，何如悟取本来心。 殷勤下手三千日，炼就壶中一井金。 示道人 学道先须泯见知，众中缄口最相宜。 休凭六六为玄妙，莫论三三做执持。 澄彻灵源观隐奥，剔开慧眼认希夷。 探根固蒂长生术，以至无为无不为。 示张庵主 昔日曾闻上古仙，巢居穴处到今传。 民如野鹿那知谢，上若标枝亦自然。 善恶两忘游广模，死生一贯泯诸绿。 折衡剖斗知何日，再变鸿蒙作此天。 示翟监丞浩然 野客今逢翟浩然，几时相伴住林泉。 功成名遂身须退，迹晦光韬地自偏。 混沌炉中烧大药，鸿蒙鼎内煮金铅。 丹成服了朝元去，得处华阳不夜天。 示众会首 光阴有限风中烛，身世无凭水上呕。 当念朱颜须改色，休教白发早临头。 贪中爱欲消磨尽，妙裹希夷子细搜。 身入大方圆觉海，太平国裹信遨游。 赠温迪罕明道 往日闻名今日逢，坐问忽尔起春风。 气和面上桃花色，神定炉中丹药红。 婴诧绸缪归紫府，虎龙交媾入离宫。 逍遥海上求玄诀，路入蓬莱一线通。 寄纥石烈先生 兀兀腾腾自在身，相将谈笑出红尘。 修程稳入三山路，和气融开十月春。 洛下香分梅萼破，水南青入柳梢新。 肯来此处同修炼，不作劳生梦裹人。 示翟浩然 大觉才知大梦休，便乘物化恣遨游。 神如霄汉离笼鹤，身似江湖不系舟。 玄理却於枯木得，繁华都付落花流。 而今不复行藏问，蟆屈鲸掀信自由。 继人韵 云海相逢得道人，料应秋水作精神。 来乘白鹿游三岛，去跨青鸾谒五真。 鼎内炼成千岁药，性中消尽六根尘。 先生已获神仙术，德不孤兮必有邻。 赠王大夫 鹤发霜髯世异人，肯来此处话长春。 好栽月裹枯根树，便炼壶中无价真。 但得修完天地缺，何须陶铸枇糠身。 蓬莱要到君须到，可与草仙作近邻。 示司天台判 扰扰尘中悟一真，飘蓬便作自由身。 青云放鹤心无击，赤水藏珠道不贫。 壶内楼台三岛景，洞中花木四时春。 青鸾白鹤翱翔处，金碧寥阳一样新。 寄颜小仙 后生可畏我怜渠，血气方刚汝畏无。 暂向纷华留视听，便於黛炼费工夫。 心如铁石愆初志，景逼桑榆失后图。 但着此心相警戒，暗中自有圣贤扶。 示李道人 清虚可炼道心坚，寂寞能黑智慧圆。 金玉满堂终弃物，丹砂一粒却延年。 人问贪作纷华梦，物外那知道化绿。 此理若能回首得，会看个裹起飞仙。 劝世 浮名浮利总悠悠，击绾人心早晚休。 一向经营忘了日，几曾富贵到枯髅。 宝山有分空回首，苦海无涯强出头。 性命悬丝如傀儡，不知人戏作风流。 过连昌 连昌宫阙已平沙，不见乘鸾只见鸦。 依旧嵩峰横木末，无穷洛水去天涯。 霓裳曲罢山禽语，端正楼空野草花。 千古繁华留不得，幽栖今属道人家。 示史道人 区区名利古今情，得亦惊来失亦惊。 蝴蝶梦中无至觉，白驹隙内竞浮荣。",
      "translated_text": "The Elixir gleams in the palm, illumining the Great Void—\nNo need now for golden dust to employ.\n\n**For Lord Hu of Wanshu**\nAchieve your work, attain your name, then early retreat to the mountains,\nTo gain a body at peace and a heart even more at ease.\nLook back on the red dust—truly a dark dream,\nYet no magic medicine can stay the crimson face.\nDwelling by Peng Isle, how could one remain vulgar?\nThe gate set in misty vines needs no lock to close.\nSuddenly a golden pellet leaps forth,\nOutshining all who come and go, questioning men.\n\n**For Commander Jiagu**\nGain and loss, poverty and success—let them follow nature,\nNo need for joy or the torment of worry.\nThis life’s wealth and rank were sown in past lives,\nPresent cultivation reaps the past’s green.\nAt Broadview Slope, a moment’s delight,\nAt Du Post, how many faults were made?\nWhen will the cycle of retribution end?\nLearn from me to cultivate the immortal beyond the world.\n\n**For Vice Commissioner Zhang**\nDo not cling to fleeting splendor, lest desire’s realm encroach,\nThe immortal isles of Peng and Hu grow ever harder to find.\nThe alchemical terrace and divine furnace lie buried in dust,\nThe moonlit palace’s magic mushrooms overrun by wild grass.\nIf you ask what exhausts endless affairs,\nHow does it compare to awakening the original heart?\nDiligently apply yourself for three thousand days,\nAnd refine within the gourd a well of gold.\n\n**For the Daoist**\nTo study the Dao, first still all perceptions and knowledge,\nAmong the crowd, silence is most fitting.\nDo not rely on the sixty-four as profound mystery,\nNor debate the three-in-one as rigid grasp.\nClarify the spirit’s source to see hidden depths,\nOpen the eye of wisdom to recognize the subtle and unseen.\nProbe the root, secure the stem—this is the art of long life,\nLeading to non-action where nothing is left undone.\n\n**For Abbot Zhang**\nLong ago I heard of the ancient immortals,\nWho dwelt in nests and caves, their legacy enduring to this day.\nPeople like wild deer, knowing no gratitude,\nAbove like treetops—so naturally they lived.\nGood and evil both forgotten, roaming the vast expanse,\nDeath and life as one, all distinctions dissolved.\nWhen will the balance be shattered, the measure split?\nWhen the primordial chaos transforms to form this heaven.\n\n**For Supervisor Zhai, the Unrestrained**\nToday I meet the unrestrained wanderer Zhai,\nWhen shall we keep each other company in the groves and springs?\nAchieve your work, attain your name, then withdraw,\nConceal your traces, veil your light—your place will naturally be secluded.\nIn the cauldron of chaos, refine the great medicine,\nIn the crucible of primordial mist, boil the golden lead.\nOnce the elixir is complete and consumed, ascend to the origin,\nAttaining the land of Huayang, the unending day.\n\n**For the Assembly Leaders**\nTime is limited, like a candle in the wind,\nLife is uncertain, like spittle on water.\nRemember that the crimson face must fade,\nDo not let white hair arrive too soon.\nLet greed and desire for love be worn away,\nIn the wondrous realm of the subtle, search carefully.\nEnter the great boundless sea of perfect enlightenment,\nAnd roam freely in the land of Great Peace.\n\n**For Wen Dihan, the Enlightened Daoist**\nLong heard of in the past, today we meet,\nAs we sit and speak, suddenly a spring breeze arises.\nQi harmonious, peach blossoms bloom on your face,\nSpirit settled, the elixir in the furnace glows red.\nThe infant and maiden entwine, returning to the Purple Court,\nTiger and dragon unite, entering the Palace of Fire.\nCarefree upon the sea, seeking the mystery’s key,\nThe path to Penglai is but a thread’s width away.\n\n**For Master Heshilie**\nSteadily, freely, the body at ease,\nTogether we laugh and talk, leaving the red dust behind.\nThe journey to the Three Mountains is sure and steady,\nHarmonious qi melts into a spring of ten months.\nBelow Lu, incense divides as plum blossoms open,\nSouth of the river, green enters the willow tips anew.\nIf you are willing to come here and cultivate together,\nYou will not become a dreamer in a life of toil.\n\n**For Zhai, the Unrestrained**\nOnly in great awakening does one know the great dream is over,\nThen ride the transformations of things, roaming at will.\nSpirit like a crane freed from the clouds,\nBody like a boat unbound on rivers and lakes.\nProfound principles found in withered wood,\nLuxuriance all given to the flowing blossoms.\nNow no longer concerned with action or concealment,\nLike the frog’s croak or the whale’s surge—truly free.\n\n**Following Another’s Rhyme**\nAmid clouds and sea, meeting a man of the Dao,\nHis spirit like autumn waters, clear and bright.\nHe comes riding a white deer to the Three Isles,\nGoes astride a green luan to visit the Five Perfected.\nIn the crucible, the thousand-year medicine is refined,\nWithin his nature, the six sensory dusts are swept away.\nThe master has already attained the arts of immortals—\nVirtue is not solitary; it must have neighbors.\n\n**For Lord Wang**\nHair like a crane, beard like frost—this man of a different age,\nWilling to come here to speak of eternal spring.\nPlant well the withered tree in the moon’s light,\nRefine within the gourd the priceless truth.\nIf you can complete the repair of heaven and earth’s flaw,\nWhy bother casting a body of chaff and husks?\nYou must reach Penglai—once you do,\nYou may keep company with the immortals of the grass.\n\n**For the Astronomer’s Judge**\nAmid the bustling dust, awakening to the one truth,\nLike a tumbleweed, becoming a body at liberty.\nReleasing the crane in the blue clouds, the heart unstruck,\nHiding the pearl in the Red River, the Dao not poor.\nWithin the gourd, the towers and terraces of the Three Isles,\nIn the cave, flowers and trees in four seasons of spring.\nWhere blue luan and white crane soar,\nThe golden and azure radiance is ever new.\n\n**For Yan, the Young Immortal**\nThe young are to be revered—I pity you,\nVitality in full bloom—have you no fear?\nBriefly lingering in the splendor of the world,\nWasting effort on the black dye of cultivation.\nHeart like iron and stone, yet straying from the original vow,\nThe sun near the mulberry and elm—losing the later plan.\nBut if you keep this heart alert and cautious,\nIn secret, sages and worthies will surely aid you.\n\n**For Daoist Li**\nClarity and emptiness can refine the steadfast Daoist heart,\nSolitude and silence can darken the perfect wisdom.\nGold and jade filling the hall are ultimately abandoned things,\nA single grain of cinnabar elixir can extend the years.\nIn the world, men greedily chase fleeting dreams,\nBeyond things, who knows the transformations of the Dao?\nIf you can turn your head and grasp this principle,\nYou will see within the casing an immortal take flight.\n\n**Exhortation to the World**\nFleeting fame, fleeting profit—all is transient,\nThe heart’s entanglements must cease sooner or later.\nDevoted to schemes, forgetting the days,\nWhen has wealth and rank ever reached the withered skull?\nTurning back from the mountain of treasures—too late,\nStruggling to emerge from the boundless bitter sea.\nLife hangs by a thread, like a puppet,\nNot knowing that men play at being romantic.\n\n**Passing Lianchang Palace**\nLianchang’s palaces now lie in level sands,\nNo sight of phoenixes ascending—only crows.\nStill, Song Peak stands at the end of the trees,\nEndless, the Luo River flows to the edge of the sky.\nThe *Rainbow Skirts* dance finished, mountain birds sing,\nThe Upright Tower empty, wild grasses bloom.\nA thousand ages of splendor cannot be retained,\nNow the reclusive Daoist claims this quiet dwelling.\n\n**For Daoist Shi**\nThe petty pursuit of fame and profit—an ancient and modern passion,\nGained with alarm, lost with alarm.\nIn the butterfly’s dream, no ultimate awakening,\nIn the white colt’s gap, competing for fleeting glory.",
      "overlap_context": "moves, unseen, inside.\nMoon waxes and wanes by cosmic decree,\nYin and yang’s dance—who’s near, who’s free?\nI see creation as a fleeting dream,\nWho then is the one who wakes from this scheme?\n\n**For Madam Liu**\nLeap from the red dust, make your break complete,\nWith heart serene and will unshaken, sweet.\nThe precious sword’s glow chills a thousand flames,\nThe jade flower blooms, all other blossoms wane.\nFrom the Purple Court, the True One descends,\nCloud chariots and moonlit seats, banners extend.",
      "start_char": 2092,
      "end_char": 3570,
      "start_sentence": 130,
      "end_sentence": 218,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.84738826751709,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\离峰老人集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "铜山宠诏千年调，金谷危楼一旦平。 争似道人休歇去，水边林下过平生。 又 游仙枕上梦初醒，竹屋风来拂面清。 已听漏声炯外转，更看斗尾树梢横。 尘凡消尽浑无迹，龙虎交时自有声。 放出紫毫金一粒，飞腾上下鬼神惊。 寄郭庵主 浮生忽忽叶辞柯，百岁光阴已半过。 尘外青山空怅望，鬓边白发转添多。 岁云暮矣能无感，君不归兮可奈何。 我与沙鸥盟已了，此回休更负姻波。 示渠知观 一气寥寥出杳茫，已先剖判统阴阳。 区分造化旱灵祖，囊括虚无万汇昌。 动处玄机酬物变，静来虚室发天光。 学人切莫寻踪迹，认取真空是法王。 示亢官人 为官何似学神仙，真静真清养浩然。 日日玉炉烧大药，时时金鼎炼红铅。 蒸生瑞气腾清汉，种就金莲罩紫姻。 功满朝真广寒去，相随同赴大罗天。 寄张提控 几年与我约林泉，却为虚名一旦牵。 沙塞虽逼犹有志，瑶池非远尚无绿。 柄迟云壑道家事，指顾英雄将士权。 直待功成名遂日，退身复证大罗仙。 示嵩州蒲察知观 玄元至道本无言，恬淡清虚尽自然。 壶内一天新世界，洞中三岛别山川。 丁公未娶离宫汞，玉妮深藏坎户铅。 混沌等闲休凿破，免教炼石补青天。 示郭知观 一瓢谊粥是生涯，与道相为友者耶。 静似澄江浮日月，动随冥鹤去姻霞。 青生霜鬓星星发，黄吐丹田寸寸芽。 更待七还功了后，九阳宫裹看金华。 示赵先生 涧水金山可隐居，我来此地作莲庐。 道乡着脚程程稳，世事回头日日疏。 架上尘书三两卷，门前姻桥几千株。 迩来泰定天光发，一段灵明结宝珠。 示乐经历 宠辱於身事若何，一端着处损冲和。 光阴回首渐将少，金玉满堂谁厌多。 不向壶中寻日月，空赢心上起干戈。 争如早悟无生计，劫外灵光坏得么。 又 四大身为造化炉，五行真火炼虚元。 炎炎海底生红焰，昧昧尘中显太虚。 有相形躯终假合，无生法性是真如。 灵童凿透昆山玉，价直连城买得无。 寄张提控 白发匆匆已满头，红颜忽忽暗中偷。 神仙有分须轻举，世事无涯莫苦求。 幻影不禁风裹烛，浮生非久水中呕。 功名总是何楼物，馒过聪明人不休。 示人 谁识人问自在仙，饥来吃饭困来眠。 一庵避地堪容膝，半纸虚名不值钱。 明月当空正端正，清风为我每周旋。 堂前不种闲花草，自有琅讦翠接天。 赠嵩州王押司 子细分明举似贤，道之一字属尘绿。 至虚至寂那容叩，精妙精微不许传。 静裹光明天有眼，玄中造化火生莲。 大千历褊俱无碍，一颗神珠处处圆。 示宁海郝县令 说与人问大丈夫，人人都有夜明珠。 昔年爱欲尘深昧，今日磨聋垢自无。 一段光明如宝鉴，十分皎洁若冰壶。 昆仑顶上灵泉降，浇灌琼花永不枯。 太和赠孙提控 莫恋浮华恨此身，好於静处养天真。 人生到了成何济，世事从来欺得人。 积德何愁仙路远，忘情自是道绿亲。 华胥梦断阳神出，化国同游不夜春。 游角子山 流行坎止信闲绿，角子山游亦偶然。 已作浮萍常泛泛，不妨风袖又翩翩。 数峰平地如图画，百乌幽林自管弦。 咫尺七还功了毕，人问胜处尽飞仙。 示元道人 虚名终日馒区区，借问流光驻得无。 只见浮云蝇竞血，不知幻梦月惊乌。 多生贪爱尘绿重，迤渐摧残玉性枯。 说与聪明端记取，身中惜护夜明珠。 诫厨 斋厨薪爨日忙忙，糊口都绿臭秽囊。",
      "translated_text": "**At Tong Mountain and Golden Vale**\n\nThe imperial favor at Tong Mountain—an ode lasting a thousand years,\nThe perilous towers of Golden Vale—leveled in a single day.\nHow much better to follow the Daoist, retiring to rest,\nPassing one’s life by the waterside, beneath the forest’s shade.\n\n**Again**\n\nOn the *Pillow of Transcendence*, the dream first stirs awake,\nBamboo hut’s breeze brushes the face, so crisp and clear.\nAlready the watchman’s drum turns beyond the flickering light,\nNow the Dipper’s tail slants across the treetops’ edge.\nWorldly dust dissolves without a trace,\nWhen dragon and tiger meet, their roar resounds of itself.\nUnsheathing a single grain of golden light from the purple brush,\nIt soars and plunges—even ghosts and spirits stand in awe.\n\n**To Master Guo of the Hermitage**\n\nFleeting life scatters like leaves from the bough,\nHalf a century’s span already slipped away.\nBeyond the dust, green mountains stretch in vain longing,\nWhile white hairs at the temples multiply.\nThe year draws late—how can one feel no sorrow?\nYou do not return—what can be done?\nI have sealed my pact with the gulls of the sand,\nThis time, do not again betray the rippling waves.\n\n**For Qu’s Abbot**\n\nA single *qi*, vast and boundless, emerges from the void,\nAlready it divides and governs yin and yang.\nIt carves creation’s work as the primal ancestor,\nEmbracing emptiness, all things flourish.\nIn motion, its mystery responds to change,\nIn stillness, the empty chamber radiates celestial light.\nDisciples, do not seek its traces—\nRecognize true emptiness as the Dharma King.\n\n**For Officer Kang**\n\nHow does serving as an official compare to studying immortality?\nIn perfect stillness, perfect purity, nurture the vast *qi*.\nDaily in the jade crucible, refine the great elixir,\nHourly in the golden cauldron, temper the red lead.\nAuspicious vapors rise to the clear heavens,\nGolden lotuses bloom, veiled in purple mist.\nWhen merit is complete, ascend to the Moon Palace,\nAnd together we shall journey to the Great Brahma Heaven.\n\n**To Zhang the Commander**\n\nFor years you pledged with me to retreat to the groves and springs,\nYet in an instant, empty fame has ensnared you.\nThough the frontier sands press close, your resolve remains,\nThe Jasper Pool is not far—only the greening has yet to come.\nTo linger in clouded valleys is the Daoist’s way,\nTo wield generals’ power is the hero’s prerogative.\nWait until the day your work is done and name achieved,\nThen withdraw and once more attain the Great Brahma Immortal.\n\n**For Pu Cha, Abbot of Songzhou**\n\nThe supreme Dao of the Primordial Origin speaks no words,\nIn serene tranquility and pure emptiness, all is natural.\nWithin the gourd, a new world unfolds,\nIn the cave, the Three Isles part from the mountains and streams.\nLord Ding’s mercury, unwed, departs the palace,\nThe jade maiden’s lead lies deep in the northern chamber.\nDo not rashly breach the undifferentiated,\nLest you force the mending of heaven with molten stone.\n\n**For Abbot Guo**\n\nA single gourd of porridge—this is my livelihood,\nOne who befriends the Dao, is it not so?\nStill as a limpid river cradling sun and moon,\nIn motion, like a crane vanishing into rosy clouds.\nFrost touches the temples, hair now speckled with stars,\nThe cinnabar field sprouts inch by inch of golden shoots.\nWait until the work of the Seven Returns is complete,\nThen in the Palace of Nine Suns, behold the golden flower.\n\n**For Master Zhao**\n\nThe Golden Mountain by the stream—fit for a hermitage,\nI come to this place to dwell in a lotus hut.\nEach step in the land of the Dao is steady,\nEach glance back at worldly affairs grows more distant.\nOn the shelf, a few volumes of dusty scriptures,\nBefore the gate, a thousand willows in misty rows.\nOf late, celestial light shines in perfect peace,\nA single luminous pearl coalesces within.\n\n**For Clerk Le**\n\nHonor and disgrace—what do they matter to the body?\nOne misstep disturbs the harmony of *qi*.\nTime turns back, and youth slips away,\nGold and jade fill the hall—who would tire of abundance?\nNot seeking sun and moon within the gourd,\nIn vain the heart wages war.\nHow much better to awaken early to the plan of no-birth,\nBeyond the kalpas, can the spirit-light be destroyed?\n\n**Again**\n\nThe fourfold body is the crucible of creation,\nThe five phases’ true fire refines the primordial void.\nFrom the seething sea’s depths, crimson flames arise,\nIn the murky dust, the great emptiness manifests.\nThe formed body is but a temporary union,\nThe unborn Dharma-nature is true suchness.\nWhen the divine youth carves through Kunlun’s jade,\nCan its value be matched, even by a city’s ransom?\n\n**To Zhang the Commander**\n\nWhite hairs rush to fill the head,\nThe rosy face fades stealthily away.\nIf destined for immortality, rise lightly,\nIn the boundless world of affairs, seek not with toil.\nIllusions cannot withstand the wind’s candle,\nFleeting life is no more than foam on water.\nFame and fortune—what are they but ephemera?\nEven the wise cannot cease their pursuit.\n\n**For Others**\n\nWho recognizes the carefree immortal of the human world?\nHungry, he eats; tired, he sleeps.\nA humble hut, enough to shelter the knees,\nHalf a sheet of empty fame—not worth a penny.\nThe bright moon hangs in the sky, perfectly aligned,\nThe clear wind ever circles me.\nBefore the hall, no idle flowers are planted,\nOnly jade-green pines stretch to the heavens.\n\n**For Wang, Clerk of Songzhou**\n\nConsider carefully and recount it to the wise:\nThe word *Dao* belongs to the dusty world.\nIn utmost emptiness and silence, none may intrude,\nIts subtlety and wonder cannot be transmitted.\nIn stillness, radiance shines—heaven has eyes,\nWithin the mysterious, creation’s fire births the lotus.\nThe great thousand worlds are all unobstructed,\nA single spirit-pearl is round everywhere.\n\n**For Magistrate Hao of Ninghai**\n\nI tell the heroes of the world:\nEach person possesses a night-shining pearl.\nIn former years, desire’s dust dimmed its light,\nToday, polishing removes the grime, and it gleams anew.\nA radiance like a precious mirror,\nPurity like an ice-filled vase.\nFrom Kunlun’s summit, the spirit-spring descends,\nWatering the jade flowers, never to wither.\n\n**Great Harmony: For Commander Sun**\n\nDo not cling to fleeting splendor, resenting this body,\nBetter to nurture your celestial truth in quietude.\nWhat use is a life spent in vain?\nWorldly affairs have ever deceived mankind.\nAccumulate virtue—why fear the path to immortality is distant?\nForget emotion—this is the Dao’s true kin.\nWhen the dream of Huaxu ends and the yang spirit emerges,\nTransform the nation and wander in an eternal spring.\n\n**Roaming Mount Jiaozi**\n\nFlowing and halting, following the leisurely Dao,\nMy visit to Mount Jiaozi was but chance.\nLike floating duckweed, I drift ever onward,\nYet my sleeves dance in the wind, carefree.\nA few peaks rise from the plain like a painting,\nA hundred birds in the secluded woods play their pipes.\nOnce the work of the Seven Returns is complete,\nAll the world’s finest places will be filled with flying immortals.\n\n**For Daoist Yuan**\n\nEmpty fame all day—how futile,\nI ask: can the fleeting light be detained?\nOnly the buzzing flies vie for blood,\nUnknowing that the dream’s moon startles the crows.\nThrough many lives, greed and desire weigh heavily,\nGradually wearing away the jade-like nature to withered dryness.\nI tell the wise: remember well,\nCherish and guard the night-shining pearl within.\n\n**Admonition to the Kitchen**\n\nThe kitchen’s hearth and firewood keep one busy all day,\nFeeding the mouth—all for a sack of foulness and filth.",
      "overlap_context": "d of the trees,\nEndless, the Luo River flows to the edge of the sky.\nThe *Rainbow Skirts* dance finished, mountain birds sing,\nThe Upright Tower empty, wild grasses bloom.\nA thousand ages of splendor cannot be retained,\nNow the reclusive Daoist claims this quiet dwelling.\n\n**For Daoist Shi**\nThe petty pursuit of fame and profit—an ancient and modern passion,\nGained with alarm, lost with alarm.\nIn the butterfly’s dream, no ultimate awakening,\nIn the white colt’s gap, competing for fleeting glory.",
      "start_char": 3571,
      "end_char": 5045,
      "start_sentence": 219,
      "end_sentence": 307,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.315417528152466,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\离峰老人集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "千食一耕非易致，百鞭匙饭已多伤。 惜如脑髓人问物，不自锄耕道舍根。 忘却息心常臧戒，披毛戴角与他偿。 自咏 海上飘蓬四十年，年来年去久偷然。 春风自远无生地，秋月长临不夜天。 定起肘边犹有柳，景忘脚底已无莲。 殷勤寄语尘中友，早晚云溪结此绿。 又 落魄云溪一散人，小窗高卧养天真。 梦中既悟终无梦，身外方知更有身。 寒月挂空千岁朗，韶华着物片时新。 争如认取长生理，无古无今一样春。 继孙伯英韵 孤身到处便投栖，踏碎姻霞路不迷。 翠乌天边谁信息，白云风外自束西。 玄霜捣出蟾中兔，真火驱来日内鹦。 收向玄中成久视，一灵真性与天齐。 赠孙伯英 高人久已厌京华，却忆仙山卧彩霞。 竹杖芒鞋为伴倡，药炉经卷作主涯。 饥餐橡实和山芋，渴饮松黄与石茶。 彼是此非都不校，只知身属大方家。 又 应物随机信自然，自然之内隐真仙。 不须断简穷经论，已向拈花悟祖禅。 心定尽他闲仗俩，神安得此好因绿。 个中便是全真趣，何处云山觅洞天。 又 学仙大抵要丛林，举动无令熟境侵。 名利场中休着脚，圣贤分上好留心。 既从一篑成千仞，须把微阴作寸金。 神气结成无漏体，姻霞别有好知音。 又 美目修容得几秋，忽然枯骨卧荒丘。 生前仗俩千般巧，到此英雄一旦休。 迷后悲欢为实相，觉来生死若浮呕。 个中灵物何尝坏，留与行人作悟头。 赠郑令史 可怜鬓发已苍苍，牒诉堆中尽日忙。 世利既如汤沃雪，笔尖刚甚姜摇芒。 甘肥适口全家乐，冤债临头一己偿。 顾我此言如药石，愿君服了也心冻。 赠张库副 红尘早晚赋归休，作伴逍遥云水游。 了却一生容膝计，胜如三载抱官囚。 壶中自有延年药，世上终无不死由。 异日功成超达去，瑶池会裹列仙俦。 寄王县令 是非场上好抽身，作个无忧自在人。 华杖便游云外路，芒鞋不到世问尘。 举头明月堪为友，到处青山总是邻。 卜个小庵安稳地，松窗高迹养天真。 寄嵩山季先生 遥望束南翠万重，先生高外此山中。 纷华识破尘绿尽，微妙蒸开法眼通。 世上有书都拂却，目前无法可牢笼。 殷勤更与含灵便，完取垂成一篑功。 寄西山董道人 出家锻炼藉丛林，切忌离群快此心。 试问浮云僧不义，何如流水觅知音。 曾经巧琢方成玉，吹尽残砂始见金。 见说蓬瀛多益友，更休取次废光阴。 梁老姑告 学人莫事苦熬煎，大道元来本自然。 真静真清成运用，不调不琢就方圆。 五明宫内生芝草，七宝山头长瑞莲。 折得一枝归缥缈，瑶池会裹荐诸仙。 示王庵主 仙风只合住林泉，识破尘绿觅道绿。 拂尽纷纷心上境，修成默默性中玄。 天光发泄迷云散，法眼开通慧月悬。 更把银河颠倒卷，洞中浇溉紫金莲。 示梅仙 天然道骨慕真修，自是红尘不得留。 野马已知窗日短，酝鹦肯向瓷天游。 壶中炼得长生药，海上从他不系舟。 更好暮天归去后，一输明月碧江秋。 示嵩州张仓使 要作全真门下客，便携节杖出红尘。 磨开宝鉴生光焰，炼就丹砂伏鬼神。 万染悉除心上境，一言唤觉梦中人。 回头返顾区区者，尽为聪明丧本真。 题石祸庵 极目姻岚锁翠微，道人来此便忘机。 眼前总是真清静，耳畔全无闲是非。 远岫云边横翡翠，细泉门外滴珠玑。 红尘咫尺如天远，寂寞松阴昼掩扉。 赠石祸赵继先",
      "translated_text": "A thousand meals from one plow’s toil are not easily gained,\nA hundred lashes for a bowl of rice already wound too deep.\nPrecious as brain and marrow—yet men treat it as common thing,\nNever once tilling the root of the Dao’s own field.\nForgetting stillness of mind, they cast aside constant vigilance,\nOnly to repay in fur and horn in lives to come.\n\n**Self-Reflection**\n\nFor forty years a tumbleweed on the sea,\nYear after year slipping past, long grown numb.\nSpring winds from afar reach the land of no-birth,\nAutumn moon ever shines on the sky of no-night.\nWhen samādhi arises, willow still grows by the elbow,\nWhen scenes fade, lotus beneath the feet is already gone.\nWith earnest words I send to friends in the dust:\nSoon, by Cloud Creek, we’ll weave this verdant bond.\n\n**Again**\n\nA carefree wanderer by Cloud Creek,\nIn a small window, high recline, nurturing heaven’s truth.\nIn dreams, once awakened, there are no more dreams,\nBeyond the body, one knows there is yet another body.\nA cold moon hangs in the void, bright for a thousand years,\nVernal splendor touches all things, fresh for a fleeting moment.\nHow could it compare to grasping the principle of long life?\nWithout past, without present—one eternal spring.\n\n**Following Sun Boying’s Rhyme**\n\nAlone, wherever I go, I find shelter,\nTreading through mist and rosy clouds, never losing the way.\nWho at the sky’s edge brings word from the green birds?\nWhite clouds beyond the wind drift east and west.\nPounding the dark frost, the rabbit in the moon appears,\nDriving the true fire, the sun’s parrot is summoned.\nGathered into the mysterious, to achieve enduring vision,\nOne spirit, one true nature, equal to heaven.\n\n**To Sun Boying**\n\nThis lofty one long wearied of the capital’s splendor,\nRecalling the immortal mountains, reclining amid rosy clouds.\nBamboo staff and straw sandals as companions,\nAlchemical furnace and scriptures as life’s foundation.\nHunger fed with acorns and mountain yams,\nThirst quenched with pine pollen and stone tea.\nRight and wrong, all distinctions left unchallenged,\nKnowing only that the body belongs to the great square.\n\n**Again**\n\nResponding to things as they come, trusting nature,\nWithin nature itself, the true immortal is concealed.\nNo need to pore over fragmented texts or exhaust scriptures,\nAlready, with a flower held, the ancestral Chan is awakened.\nWith mind settled, all idle weapons are subdued,\nWith spirit at peace, this fine cause is attained.\nHere lies the complete truth of the Quanzhen,\nWhere in the clouds and mountains would one seek grotto-heavens?\n\n**Again**\n\nTo learn immortality, one must dwell in the forest,\nIn every movement, guard against familiar realms encroaching.\nIn the arena of fame and profit, do not set foot,\nIn the realm of sages and worthies, bestow your heart.\nFrom one basket, a thousand fathoms are built,\nTreat fleeting moments as if they were inches of gold.\nWhen spirit and qi congeal into a leakless body,\nAmid mist and rosy clouds, there are true kindred spirits.\n\n**Again**\n\nHow many autumns can beauty’s eyes and adorned face endure?\nSuddenly, bleached bones lie in a desolate mound.\nIn life, relying on cunning, a thousand schemes,\nHere, heroes in an instant come to rest.\nAfter delusion, joy and sorrow become true form,\nUpon awakening, life and death are like floating bubbles.\nYet this numinous thing within never decays,\nLeft for wayfarers as a signpost to enlightenment.\n\n**To Magistrate Zheng**\n\nPitiable, your temples already grizzled,\nAll day buried in stacks of documents.\nWorldly profit melts like snow in boiling water,\nYour brush’s tip sharp as ginger’s sting.\nRich flavors delight the mouth, the whole family rejoices,\nBut when karmic debts arrive, you alone repay.\nIf you take my words as medicine and stone,\nI hope you’ll swallow them and freeze your heart.\n\n**To Deputy Warehouse Keeper Zhang**\n\nSoon or late, compose your return and rest,\nTo wander carefree as a cloud or water.\nTo have settled a life’s plans within a space to stretch one’s knees\nOutweighs three years as a prisoner of office.\nWithin the gourd, the elixir of long life awaits,\nIn the world, there is no reason not to die.\nOne day, when merit is complete, ascend beyond,\nAt the Jade Pool’s gathering, join the company of immortals.\n\n**To Magistrate Wang**\n\nBest to withdraw from the arena of right and wrong,\nTo become a carefree, untroubled person.\nWith a patterned staff, roam the paths beyond the clouds,\nStraw sandals never touch the dust of the world.\nLift your head—the bright moon is a worthy friend,\nWherever you go, green mountains are always neighbors.\nFind a small hut in a secure place,\nBy the pine window, in lofty seclusion, nurture heaven’s truth.\n\n**To Master Ji of Mount Song**\n\nFrom afar, gazing southeast to ten thousand layers of green,\nThe master dwells beyond this mountain’s heights.\nWorldly splendor seen through, the dust’s bonds all severed,\nSubtle wonders revealed, the Dharma-eye opened wide.\nAll books in the world are brushed aside,\nNo dharmas before the eyes can be grasped.\nWith earnest care, I offer this to all sentient beings:\nComplete the nearly finished work of the final basket.\n\n**To Daoist Dong of West Mountain**\n\nTo leave home and refine oneself relies on the forest,\nBeware of straying from the flock to indulge this heart.\nAsk the ungrateful floating clouds:\nHow do they compare to flowing water seeking a true friend?\nOnly after careful carving is jade perfected,\nOnly after blowing away the last grains of sand is gold revealed.\nI hear Penglai and Yingzhou abound in worthy companions,\nNever idly waste another moment of light.\n\n**Announcement to Old Lady Liang**\n\nDisciple, do not endure bitter suffering,\nThe great Dao was always originally natural.\nIn true stillness, true purity, all functions arise,\nWithout carving, without polishing, it becomes round.\nIn the Palace of Five Lights, lingzhi mushrooms grow,\nOn the Mountain of Seven Treasures, auspicious lotuses bloom.\nPluck one branch and return to the ethereal,\nAt the Jade Pool’s gathering, present it to the immortals.\n\n**To Abbot Wang**\n\nThe immortal’s wind is fit only for forests and springs,\nSeeing through the dust’s bonds, seek the Dao’s bonds.\nBrush away the myriad entanglements of the heart’s realm,\nCultivate in silence the mystery within your nature.\nHeaven’s light shines forth, delusive clouds disperse,\nThe Dharma-eye opens, the moon of wisdom hangs.\nThen, overturn the Silver River to pour,\nWatering the golden lotuses within the grotto.\n\n**To Mei Xian**\n\nWith innate Dao bones, you yearn for true cultivation,\nNaturally, the red dust cannot detain you.\nThe wild horses already know the window’s sun is brief,\nHow could the parrot consent to wander beneath a porcelain sky?\nWithin the gourd, the elixir of long life is refined,\nOn the sea, let the boat drift without mooring.\nBetter still, when you return at dusk,\nA single wheel of bright moon over the emerald river in autumn.\n\n**To Zhang Cangshi of Songzhou**\n\nTo become a guest in the Quanzhen gate,\nTake up your staff and leave the red dust.\nPolish the precious mirror until it blazes with light,\nRefine the cinnabar until it subdues gods and demons.\nTen thousand defilements cleared from the heart’s realm,\nA single word awakens the dreamer.\nTurn your head, look back at those petty ones—\nAll for cleverness have lost their original truth.\n\n**Inscribed at Stone Nest Hermitage**\n\nGazing afar, mist and haze lock the emerald haze,\nThe Daoist comes here and forgets all schemes.\nBefore the eyes, all is true purity and stillness,\nAt the ears, not a whisper of idle right or wrong.\nIn the distance, jade-green peaks stretch like kingfishers,\nBy the gate, fine springs drip like strings of pearls.\nThe red dust, though a footstep away, seems as distant as the sky,\nIn the quiet, beneath the pines, the door remains shut at noon.\n\n**To Zhao Jixian of Stone Nest**",
      "overlap_context": "ame all day—how futile,\nI ask: can the fleeting light be detained?\nOnly the buzzing flies vie for blood,\nUnknowing that the dream’s moon startles the crows.\nThrough many lives, greed and desire weigh heavily,\nGradually wearing away the jade-like nature to withered dryness.\nI tell the wise: remember well,\nCherish and guard the night-shining pearl within.\n\n**Admonition to the Kitchen**\n\nThe kitchen’s hearth and firewood keep one busy all day,\nFeeding the mouth—all for a sack of foulness and filth.",
      "start_char": 5046,
      "end_char": 6516,
      "start_sentence": 308,
      "end_sentence": 396,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.15573596954346,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\离峰老人集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "识破浮生水上呕，一尘不许到心头。 有时黄卷拈来罢，无限青山兴便游。 莫笑一瓢成活计，却令千古仰风流。 有人来问修行法，食饱无余事事休。 寄张仓使 此身有限莫蹉跎，百岁光阴捻指过。 正忆黄金囊裹少，不知白发鬓边多。 临头生死谁能免，满眼儿孙不奈何。 争似闻身强健日，早邀明月赴姻萝。 示杨会首 休言火裹长金莲，莫说家中有洞天。 大抵出家离爱欲，直须绝虑造幽玄。 磨砖作镜终无假，拂石成羊亦是权。 若到神通无碍处，便教平地也为仙。 秋日示完颜道人 朝来白帝作霜威，似与乾坤助杀机。 木杪不禁群叶下，天涯更促乱鸿归。 红尘远客愁丝鬓，紫塞征人病铁衣。 唯有仙家无个事，一杯谊粥掩柴扉。 太清宫述怀 睡起逍遥闲放意，瘦饰扶我到栖真。 风中红紫时时落，雨后琅讦日日新。 胜地自然生瑞气，苍天不住走红轮。 仙翁忘却人问世，外听晨钟恰转身。 示赵道人 收拾精神向内观，莫教穷贼外相瞒。 六门玄钥尘根断，七返还丹道气钻。 玉露降时珠颗颗，金霞飞处月团团。 水精楼阁真人位，赤凤乌龟上下蟠。 张姑告 一炉春雪下工夫，锻炼须成颗颗珠。 万道银霞光错落，千般瑞彩色模糊。 婴儿采得灵芝草，诧女偷开造化炉。 有个真人闲作戏，杖挑明月弄虚元。 赠清平李道人 老大看书目不禁，只宜静处养虚心。 百骸和畅神无梦，四体冲融息自深。 凿破荆山搜璞玉，拨开丹鼎觅真金。 我今说与神仙诀，可付诸人惜寸阴。 王副观告 说与人问烈丈夫，时人都有夜明珠。 昔年埋没诸尘昧，今日镯除片意无。 一段光明如素练，十分皎洁若冰壶。 昆仑化作灵泉液，浇灌琼花永不枯。 赠师会首 释氏拈花犹示现，达磨面壁正迟留。 本来灵物无圆缺，自是人心妄赘瘤。 大道忘言非有说，谷神不死觅无由。 至人一得慵开口，渴饮饥餐万事休。 赠张会首 渊默雷声各自如，个中消息本虚无。 莲庐生死非由智，土木形容不是愚。 数息区区闲仗俩，餐霞屑屑浅工夫。 要知世外神仙诀，夺取骊龙颔下珠。 五言律诗 寄洞霄宫完颜提点 寄语洞霄客，天姿幸有余。 善行本无迹，处世不如愚。 念此膏然烛，输他蚌隐珠。 光明休外现，惜此养残躯。 寄郎大师 寄语西山老，山居亦乐哉。 万绿俱嚼蜡，一念自寒灰。 去乌稽颐送，新诗信手裁。 高真多爱惜，不放出头来。 述怀 麻衣与葛巾，天地一闲人。 荡荡超三界，巍巍出六尘。 洞中仙不老，壶内景长春。 走上昆仑顶，回头看北辰。 又 道念坚弥熟，人情自远疏。 清虚为活计，寂淡养真如。 铅汞烹金鼎，玄霜炼玉炉。 功成归去后，永永住仙都。 示中京舞会首 冷翠嵩峰逼，幽栖涧水依。 人情渐疏薄，道念益精微。 鸾鹤丹庭聚，云霞宝殿飞。 解兰亦何者，一去不来归。 继雷公韵 信步入林泉，蹉跎四十年。 月中不用指，鱼后已忘荃。 岁月行如此，情怀亦淡然。 仙山未归去，应物且随绿。 五言绝句二十二首 世事般般了，浮生事事休。 顿然三界外，不挂一丝头。 大道极幽玄，清虚合自然。 拨开三昧眼。 别看一重天。 有相明无相，真空混色空。 有无俱不染，一点太虚中。 欲作无碍身，还却输回债。 剔正性中灯，照破虚空界。 茅庐寄城角，谁识是仙乡。 地僻人行少，心清道味长。 头头俱是道，物物总为明。",
      "translated_text": "Seeing through this floating life—bubbles on water,\nNot a speck of dust allowed to touch the heart’s ground.\nSometimes I take up the yellowed scrolls and set them down,\nEndless blue mountains stir my wanderlust, and off I go.\nDo not mock this gourd-bottle livelihood—\nIt has made a thousand ages look up in admiration.\nIf someone asks for the method of cultivation,\n“Eat your fill, have no surplus, and every affair is done.”\n\n**Sent to Commissioner Zhang**\n\nThis body is finite—do not let it slip away,\nA hundred years of light pass in the snap of a finger.\nJust when you think your golden purse is still half-full,\nYou do not notice the white hairs multiplying at your temples.\nDeath at life’s end—who can escape it?\nEven with children and grandchildren filling your eyes, what can you do?\nHow much better to seize the days of strength and health,\nAnd early invite the bright moon to join you in misty vines.\n\n**For Chief Yang**\n\nDo not speak of golden lotuses blooming in fire,\nNor claim your home holds a grotto-heaven.\nGenerally, to leave the household is to leave love and desire,\nOne must cut off all thoughts to reach the profound mystery.\nGrinding a brick to make a mirror is never true,\nBrushing a stone to turn it into a sheep is but a temporary skill.\nIf you reach the state of unimpeded spiritual power,\nYou can make even level ground into a realm of immortals.\n\n**An Autumn Day for Daoist Wanyan**\n\nMorning brings the White Emperor’s frosty might,\nAs if to aid heaven and earth in their killing intent.\nTreetops cannot bear the weight—leaves fall in droves,\nWhile at the edge of the sky, scattered geese hurry home.\nTravelers far from the red dust fret over silvered temples,\nSoldiers at the purple frontier sicken in their iron armor.\nOnly the immortals have no cares—\nA bowl of millet gruel, and the brushwood gate stays shut.\n\n**Reflections at the Supreme Clarity Palace**\n\nWaking from sleep, I wander at ease, my mind unburdened,\nLeaning on my staff, I make my way to the abode of truth.\nIn the wind, red and purple petals fall ceaselessly,\nAfter the rain, jade-green bamboo renews itself daily.\nThis sacred land naturally generates auspicious qi,\nThe azure heavens never cease their journey of the red wheel.\nThe immortal sage has forgotten the world of mortals—\nJust as he turns, the morning bell rings from without.\n\n**For Daoist Zhao**\n\nGather your spirit and turn your gaze inward,\nDo not let the impoverished thief of the outer world deceive you.\nThe six gates’ mystic keys sever the roots of dust,\nThe sevenfold returning elixir drills the Dao’s qi into being.\nWhen jade dew descends, each drop is a pearl,\nWhere golden clouds take flight, the moon forms perfect circles.\nIn the crystal pavilion stands the True Person’s position,\nRed phoenix and dark turtle coil above and below.\n\n**Zhang Gu’s Announcement**\n\nA furnace of spring snow demands your work,\nTemper and refine until every grain becomes a pearl.\nTen thousand silver rays of radiance interweave,\nA thousand kinds of auspicious hues blur into one.\nThe infant gathers the magic mushroom,\nThe alchemical maiden steals open the crucible of creation.\nThere is a True Person idly at play—\nStaff propped against the moon, toying with the void’s origin.\n\n**For Daoist Li of Qingping**\n\nOld and great, my eyes can no longer bear books,\nOnly in stillness is it fitting to nurture an empty heart.\nA hundred bones harmonize, the spirit dreams no more,\nFour limbs flow freely, breath settles into depth.\nI break open Mount Jing to search for uncut jade,\nI brush aside the cinnabar tripod to seek true gold.\nNow I tell you the immortal’s secret—\nEntrust it to others: cherish every inch of time.\n\n**Announcement for Vice-Observer Wang**\n\nI tell the world’s stalwart heroes:\nAll people possess night-shining pearls.\nIn former years, they lay buried in dust and darkness,\nToday, the tarnish is wiped away, and not a trace of intent remains.\nA strip of light as pure as white silk,\nTenfold brightness like an ice-filled flask.\nKunlun transforms into the liquor of spirit-spring,\nWatering jade blossoms that never wither.\n\n**For Chief Shi**\n\nŚākyamuni held up a flower—it was a revelation,\nBodhidharma faced the wall—he tarried in stillness.\nThe numinous essence is inherently without wax or wane,\nIt is the human heart that vainly grows tumors of delusion.\nThe Great Dao forgets words—it is not a matter of discourse,\nThe valley spirit never dies—yet there is no way to seek it.\nThe perfected one, having attained it, is too lazy to speak—\nThirst quenched, hunger sated, all affairs are done.\n\n**For Chief Zhang**\n\nProfound silence and thunderous sound each follow their nature,\nWithin them, the message is fundamentally empty and nonexistent.\nThe lotus hut’s life and death are not a matter of wisdom,\nThe earth-and-wood body’s form is not foolishness.\nCounting breaths is but a trifling aid,\nFeasting on rosy clouds is but a shallow practice.\nIf you wish to know the immortal’s secret beyond the world,\nSnatch the pearl from beneath the black dragon’s chin.\n\n**Five-Character Regulated Verse**\n\n**Sent to Wanyan, Supervisor of the Dongxiao Palace**\n\nA message for the guest of Dongxiao:\nYour celestial endowment is fortunately abundant.\nGood conduct leaves no trace,\nIn worldly affairs, it is better to be as if foolish.\nRemember this candle burning brightly—\nIt yields to the clam that hides its pearl.\nDo not let your light shine outwardly,\nCherish it to nurture this frail body.\n\n**Sent to Master Lang**\n\nA message for the old man of the western mountains:\nLiving in the mountains is also joyous.\nTen thousand greens all taste of wax,\nA single thought turns to cold ashes.\nThe departing crow bows its head in submission,\nNew poems are cut out by hand.\nThe lofty immortals are full of care—\nThey do not let you come to the fore.\n\n**Reflections**\n\nHemp robe and kudzu kerchief,\nA single idle man between heaven and earth.\nVast and boundless, transcending the three realms,\nTowering and majestic, rising above the six dusts.\nWithin the grotto, immortals never age,\nInside the gourd, the scene is eternal spring.\nI ascend the summit of Kunlun,\nTurn my head to gaze at the North Star.\n\n**Again**\n\nThe Dao’s resolve grows ever more steadfast,\nHuman feelings naturally grow distant and sparse.\nEmptiness and clarity are my livelihood,\nStillness and simplicity nurture the true thusness.\nLead and mercury simmer in the golden tripod,\nMysterious frost refines the jade furnace.\nWhen the work is complete and I return,\nI will dwell forever in the immortal capital.\n\n**For Chief Wu of Zhongjing**\n\nCold jade-green peaks of Song Mountain press close,\nI dwell in seclusion by the stream’s waters.\nHuman sentiments gradually thin,\nThe Dao’s resolve grows ever more refined.\nSimurghs and cranes gather in the cinnabar courtyard,\nClouds and rosy mists fly through the jeweled hall.\nWhat is it that unties the orchid?\nOnce gone, it does not return.\n\n**Following Master Lei’s Rhyme**\n\nI wander at will into forests and springs,\nForty years have slipped by in careless steps.\nBefore the moon could be pointed out,\nAfter the fish, the fish-trap was already forgotten.\nYears and months pass like this,\nMy feelings and thoughts are also serene.\nNot yet returned to the immortal mountains,\nI respond to things and follow the green.\n\n**Twenty-Two Five-Character Quatrains**\n\nWorldly affairs, one by one, are finished,\nFloating life, matter by matter, is done.\nSuddenly, beyond the three realms,\nNot a single thread is entangled.\n\nThe Great Dao is utterly profound,\nEmptiness and clarity align with nature.\nParting the eye of samadhi,\nBehold another layer of heaven.\n\nForm reveals the formless,\nTrue emptiness blends with colored emptiness.\nNeither being nor non-being is stained—\nA single point within the great void.\n\nTo become a body without hindrance,\nFirst repay the debts you owe.\nTrim the lamp within your nature,\nIllumine the realm of empty space.\n\nA thatched hut at the city’s edge—\nWho recognizes it as an immortal land?\nThe place is remote, few people pass,\nThe heart is clear, the Dao’s flavor lingers.\n\nEverywhere is the Dao,\nEverything is illumination.",
      "overlap_context": "one Nest Hermitage**\n\nGazing afar, mist and haze lock the emerald haze,\nThe Daoist comes here and forgets all schemes.\nBefore the eyes, all is true purity and stillness,\nAt the ears, not a whisper of idle right or wrong.\nIn the distance, jade-green peaks stretch like kingfishers,\nBy the gate, fine springs drip like strings of pearls.\nThe red dust, though a footstep away, seems as distant as the sky,\nIn the quiet, beneath the pines, the door remains shut at noon.\n\n**To Zhao Jixian of Stone Nest**",
      "start_char": 6516,
      "end_char": 7962,
      "start_sentence": 397,
      "end_sentence": 494,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.553631067276,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\离峰老人集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "未敢全相许，忘言自太平。 飒飒秋风起，飘飘乱叶飞。 这些端的事，全体露玄机。 世外养高士，尘中异俗人。 放开清静眼，看破利名尘。 解脱本吾事，死生非我关。 心如空月朗，身似野云闲。 白雪性中真，百纷那得尘。 拨开无缝锁，跳出自由身。 色身元有属，实性岂无根。 试向中问觅，依然主宰存。 枝俩都休尽，聪明自到来。 形难镜中遁，节向刃边开。 爱滞凡情重，心澄道味真。 两全无是理，一割正须人。 大巧元如拙，囊锥莫出头。 一朝原兔尽，良犬汝无忧。 渤海一游遨，千重雪浪高。 试将山饵掷，若个是神鳖。 生者本无生，死者亦非死。 悠悠生死中，无人知此理。 四大作神奇，五行为臭腐。 改换百千般，翻腾一万古。 世情元有限，大道即无边。 苦悟浮生梦，心如出水莲。 既作逍遥客，须寻物外人。 相逢无一语，目击道先亲。 红尘不到处，此地养疏慵。 说与同心友，浮生总是空。 功名何日尽，富贵几时休。 识破浮生梦，还如水上呕。 我欲抛香饵，神鳖不上钩。 却回孤棹去，月玲碧江秋。 六言绝句二首 道本无言无说，只要君心猛烈。 拨开万里闲云，推出一输明月。 黑汞炼成白雪，赤铅结就黄芽。 灯下手亲分付，深藏自己灵砂。 离峰老人集卷上竟 离峰老人集卷下_七言绝句 偶得 寂寥云水几星霜，收得神仙不死方。 二物都来十六两，跨将赤凤入仙乡。 炼心 道人方寸已寒灰，无限尘纷境自回。 总把乾坤为妙用，此身到处即蓬莱。 赠移刺大师 壶中仙景本非常，万象森罗自发光。 清静炼成无漏体，冲和养就法中王。 谈人说我何时尽，竞利贪名有底愁。 若悟此身还有限，蝇头蜗角一时休。 王道人告 口诀叮咛举似贤，饥时吃饭倦时眠。 灵台莹静尘难染，宝鉴无痕性自圆。 寄德顺州移刺答节副 功名未了心先了，尘俗俱忘性不忘。 更着慧风吹万籁，真空独现一输光。 赠门使 姻霞堆裹有知音，名利场中少用心。 但得一枝栖宿处，何劳苦苦觅深林。 赠太－宫姜大师 灵杖剔开名利锁，慧刀割断是非疆。 天然世外骑鲸客，自是神游不夜乡。 寄郎大师 云溪高枕卧姻霞，栽接长生不谢花。 可与群仙为领袖，已调和气褊天涯。 又 山南瑞气腾腾长，水北金花蕊蕊开。 时有灵音传好信，玉虚殿上选仙材。 又 淡淡姻霞浅浅山，此身长在翠微间。 白云空谷无人到，赢得身心竟日闲。 睢州吴道人请住庵 隐迹云溪数载问，随风偶尔到人间。 黄尘着脚非吾事，部领白云归故山。 示郦陵县刘会首 看钱虏与抱官囚，扰扰尘中甚日休。 有数光阴销易尽，无涯岁月去难留。 洛州寨尼院主告颂 头头尽是西来意，物物全明祖佛心。 心意两忘成妙用，不须争裹苦沈吟。 合流镇木夹录判索 一衣一食莫刚求，但得随绿过便休。 赢得省心兼省力，更无闲事上眉头。 示西华县李庵主 山头滚滚涌灵泉，海底炎炎结瑞莲。 既济阴阳丹自结，水晶宫裹会诸仙。 西华县胡会首告 若悟轮回早早回，金莲休向火中栽。 纵然栽得根苗活，到底全无一朵开。 西华县张庵主告 不恋空华与世华，道人活计淡生涯。 兴来两卷闲文字，困外松轩看晚霞。 西华县贾道人告 断鹤续晃忘分与，夷山盈壑昧生绿。 一瓢自足幽人乐，寸地常虚大觉仙。 示陈州昌姑 道人心地玲如冰，不假营求道自生。",
      "translated_text": "Do not dare affirm all appearances,\nIn wordless silence find supreme peace.\nThe autumn wind rises in gusts,\nScattered leaves swirl and fly.\nThese very matters, in truth,\nReveal the whole of profound mystery.\nBeyond the world, nurturing lofty scholars,\nAmid the dust, men unlike the vulgar crowd.\nOpen wide the eye of purity,\nSee through the dust of fame and gain.\nLiberation is my own affair,\nDeath and life concern me not.\nThe heart shines like the bright moon in emptiness,\nThe body drifts like a wild cloud at ease.\nThe true white snow of one’s nature,\nHow can the hundred distractions stain it?\nUnlock the lock without a seam,\nLeap forth as a body unbound.\nThe physical form has its origin,\nThe true nature—how could it lack a root?\nSeek within the center,\nAnd the master remains, as ever.\nLet all branches and deceptions cease,\nWisdom will come of itself.\nForm cannot escape the mirror’s gaze,\nIntegrity blooms at the blade’s edge.\nLove clings, worldly passions weigh heavy,\nThe heart stills, the Dao’s flavor is true.\nTo seek both is without principle,\nOne must sever decisively.\nGreat skill is originally like clumsiness,\nThe awl in the bag must not show its head.\nWhen the hares are all gone,\nThe good hound need not worry.\nRoaming the vast sea,\nA thousand layers of snow-white waves rise high.\nCast the mountain bait—\nWhich one is the divine turtle?\nThat which is born was never born,\nThat which dies does not truly die.\nAmid the endless cycle of birth and death,\nNo one knows this truth.\nThe four elements perform wonders,\nThe five phases turn to stench and decay.\nTransformed a hundred thousand ways,\nTossed and turned through ten thousand ages.\nWorldly affairs are inherently limited,\nThe Great Dao is boundless.\nAwakening from the dream of floating life,\nThe heart is like a lotus rising from water.\nHaving become a carefree wanderer,\nSeek those beyond the realm of things.\nMeeting, not a word is spoken,\nEyes meet, the Dao is already intimate.\nWhere worldly dust does not reach,\nHere one nurtures idleness and ease.\nSpeak to like-minded friends:\nFloating life is all emptiness.\nWhen will fame and merit end?\nWhen will wealth and rank cease?\nSeeing through the dream of floating life,\nIt is like vomit on water.\nI wish to cast fragrant bait,\nBut the divine turtle does not take the hook.\nTurning back the solitary oar,\nThe moon glimmers on the emerald river in autumn.\n\n**Two Six-Line Poems**\n\nThe Dao is originally without words or speech,\nOnly that your heart be fiercely resolute.\nSweep aside the idle clouds for ten thousand miles,\nPush forth a wheel of bright moonlight.\n\nBlack mercury refined into white snow,\nRed lead congealed into golden sprouts.\nBy the lamp’s light, hand it down personally,\nDeeply conceal your own elixir of spirit.\n\n**Collected Works of Master Lifeng, Volume One Concluded**\n\n**Collected Works of Master Lifeng, Volume Two – Seven-Character Quatrains**\n\n**Occasionally Composed**\n\nDesolate clouds and waters, a few frosts and stars,\nI have gathered the immortal’s formula for deathlessness.\nTwo substances, together weighing sixteen ounces,\nRiding the crimson phoenix into the immortal realm.\n\n**Refining the Heart**\n\nThe Daoist’s heart is already cold ashes,\nBoundless worldly dust turns away of itself.\nTaking heaven and earth as wondrous use,\nThis body, wherever it goes, is Penglai.\n\n**For Master Yila**\n\nThe immortal scene within the gourd is not ordinary,\nThe ten thousand images, forest and net, shine of themselves.\nThrough purity refined into a body without leakage,\nIn harmony nurtured, the king within the Dharma.\n\nPeople’s talk of me—when will it end?\nCompeting for profit and fame—what sorrow is there?\nIf you awaken to this body’s limits,\nThe fly’s head and snail’s horn cease in an instant.\n\n**Wang the Daoist’s Admonition**\n\nOral instructions, earnestly repeated, offered to the worthy:\nWhen hungry, eat; when tired, sleep.\nThe numinous terrace gleams, unstained by dust,\nThe precious mirror leaves no trace, the nature is naturally whole.\n\n**Sent to Vice-Commissioner Yila of Deshun Prefecture**\n\nBefore worldly merit is complete, the heart is already done,\nWorldly customs all forgotten, the nature is not forgotten.\nLet the wind of wisdom blow through the ten thousand sounds,\nThe true emptiness alone appears, a wheel of light.\n\n**For the Gate Officer**\n\nAmid piled rosy clouds, there are those who know the tone,\nIn the arena of fame and profit, use little heart.\nIf you have but one branch for roosting,\nWhy laboriously seek the deep forest?\n\n**For Grand Master Jiang of the Taiyi Palace**\n\nThe numinous staff pries open the lock of fame and profit,\nThe blade of wisdom severs the borders of right and wrong.\nA rider of whales beyond the world by nature,\nNaturally roams the land of endless light.\n\n**Sent to Master Lang**\n\nBy Cloud Creek, high pillow, reclining amid rosy clouds,\nCultivating and grafting the flower of immortality that never fades.\nYou may lead the host of immortals,\nHaving harmonized the qi to the ends of the earth.\n\n**Also**\n\nTo the south of the mountains, auspicious qi swells and lengthens,\nTo the north of the waters, golden flowers bloom in clusters.\nFrom time to time, numinous sounds convey good tidings,\nIn the Jade Void Palace, selecting immortal material.\n\n**Also**\n\nFaint rosy clouds, gentle mountains,\nThis body ever dwells amid emerald haze.\nWhite clouds in the empty valley, no one comes,\nGaining a day of leisure for body and heart.\n\n**Wu the Daoist of Suizhou Requests to Reside in the Hermitage**\n\nHidden by Cloud Creek for several years,\nBy chance, following the wind, I came among men.\nYellow dust on the feet is not my affair,\nLeading the white clouds, I return to the old mountain.\n\n**For Liu, Chief of Liling County**\n\nMoney-grubbers and official prisoners,\nIn the bustling dust, when will it end?\nThe allotted span of light and time is easily spent,\nThe boundless years and months depart, hard to retain.\n\n**Verses for the Abbess of the Convent in Luozhou Stronghold**\n\nEverywhere is the meaning from the West,\nIn every thing, the ancestral Buddha’s heart is fully clear.\nHeart and intent both forgotten, wondrous use is achieved,\nNo need to struggle in vexed pondering.\n\n**Wooden Tablet Inscription for Heliu Town**\n\nOne robe, one meal—do not seek too rigidly,\nBe content to follow circumstances and rest.\nGain a heart at ease and strength spared,\nNo idle matters weigh on the brow.\n\n**For Li, Abbot of Xihua County**\n\nAtop the mountain, surging surging, a numinous spring,\nAt the sea’s bottom, blazing blazing, auspicious lotuses form.\nHaving harmonized yin and yang, the elixir congeals of itself,\nIn the crystal palace, meeting all the immortals.\n\n**For Hu, Chief of Xihua County**\n\nIf you awaken to the wheel of rebirth, return early,\nDo not plant golden lotuses in the fire.\nEven if you plant them and the roots sprout,\nIn the end, not a single blossom will open.\n\n**For Zhang, Abbot of Xihua County**\n\nNot attached to empty flowers or worldly flowers,\nThe Daoist’s livelihood is a simple life.\nWhen inspired, two scrolls of idle text,\nWhen weary, in the pine pavilion, watching the sunset glow.\n\n**For Jia the Daoist of Xihua County**\n\nCutting off the crane’s legs to lengthen the duck’s, forgetting proportion,\nFilling mountains and valleys, obscuring the verdant green.\nOne gourd is enough for the hermit’s joy,\nAn inch of ground, always empty, for the great awakened immortal.\n\n**For Chang the Novice of Chenzhou**\n\nThe Daoist’s heart is clear as ice,\nWithout need for contrivance, the Dao arises of itself.",
      "overlap_context": "\n\nForm reveals the formless,\nTrue emptiness blends with colored emptiness.\nNeither being nor non-being is stained—\nA single point within the great void.\n\nTo become a body without hindrance,\nFirst repay the debts you owe.\nTrim the lamp within your nature,\nIllumine the realm of empty space.\n\nA thatched hut at the city’s edge—\nWho recognizes it as an immortal land?\nThe place is remote, few people pass,\nThe heart is clear, the Dao’s flavor lingers.\n\nEverywhere is the Dao,\nEverything is illumination.",
      "start_char": 7962,
      "end_char": 9404,
      "start_sentence": 495,
      "end_sentence": 592,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 92.39438843727112,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\离峰老人集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "万籁无声心泰定，一输秋月皎然明。 陈州完颜舍人告 抽添问隔炎炎火，既济阴阳旋旋烧。 炼就纯阳神自出，无生路上恣逍遥。 陈州完颜姑姑告 尽日穷年无处寻，得来元不费光阴。 灵明一点真消息，为佛为仙是此心。 陈州孙姑告 扫荡群情事事无，莫教尘土翳冰壶。 胸中一物神光现，万道红霞罩宝珠。 赠息州蒲察从宜相公 功成名遂早归山，策杖逍遥到处闲。 明月光中融妙用，白云探处炼神丹。 陈州完颜大哥告 剪除荆棘开心地，扫荡荒芜种瑞莲。 飒飒情风生玉叶，辉辉新月照壶天。 赠陈州坐园张道人 六欲遣回身自在，一尘不染性逍遥。 栽成火裹无根树，放出灵葩永不凋。 徐姑告 功名恰似石中火，富贵挥如水上呕。 撒手便登云外路，是非人我一时休。 寄刘三仙 睢阳相别久徘徊，望断春云不到来。 惜取龙泉无价剑，宝光休使染尘埃。 赠湖头宋庵主 此身天地一孤蓬，信意蹉跎西复东。 不及草庵闲打坐，归来高迹养吾慵。 长平郭官人告 火风地水役来由，聚则成形散即休。 半纸功名虚费力，百年捞拢水中呕。 润流镇王妙坚告 一片闲心志莫移，疑团打破证无为。 胸中记取全真性，一旦古常存几个知。 临显县王会首告 老却春光人倦游，花残蝴蝶更添愁。 不知桂影无凋谢，香满人问甚日休d 临显县邵会首告 不会擒猥锁马颠，饥来吃饭倦时眠。 冥然一枕华胥梦，始觉壶中别有天。 寄和典史 几载持竿钓巨鳖，鲸锐白眼戏波涛。 丝纶收拾西归去，空渡沧瞑又一遭。 赠舞阳县乌古论县丞 神仙活计苦无多，涤虑忘情气自和。 欣则擭竿寻野径，困来高枕外姻萝。 示完颇姑姑 松窗石枕惟便睡，竹径人来尚未知。 惊觉披衣时敛坐，形如槁木，眼如眉。 孟寨张会首告 顿抛世网复全真，洗涤灵宫养谷神。 常要情虚无个事，桂花开彻且边新。 赠禹知观 隐隐遥山锁翠姻，亭亭碧蟑近林泉。 凿开混沌些儿景，偷得壶中一点天。 南阳县俎道人告 三界有墙犹恨窄，四维无处不为园。 黄华翠竹皆吾事，云即云兮山即山。 赠程庵主 手执丝纶四十秋，但逢波浪便抛钩。 鲸统不肯吞香饵，空驾虚舟独自游。 赠木虎夫人 人生只解念弥陀，自己弥陀会得么。 认得本来无相祖，不须身外苦奔彼。 赠亢官人 莫比山高与海深，学人空费远搜寻。 目前自有长生道，凡圣皆由一寸心。 赠洛阳薛会首 近水临山锁翠微，利名着脚却忘归。 此身不属红尘客，卧看白云天外飞。 移刺答道人告 道人行止莫蹉跎，心镜须凭一志磨。 痕垢尽时光自现，不离方寸见弥陀。 贵姑告 踏褊天涯觅也无，得来元不用功夫。 百年抛却红尘事，有个真人驾得车。 姬磨樊会首告 有相绿中无碍身，古今谁解识疏亲。 百年抛下娘生袋，一个真人驾日输。 陈州唐括提控告 世网掣开身自在，凡笼跳出性尤闲。 携节直入姻霞路，惊起白云满故山。 马会首告 既为学道好参同，秘诀传来便有功。 一点灵明清似水，炼成丹药鼎中红。 陈会首告 身居苦海休言道，头戴恩山莫论禅。 若是两家俱放下，不须掘地去寻天。 史都监告 郭外之田数亩园，丝麻擅粥保残年。 不图跨鹤乘云去，且向人问应幻绿。 曹会首告 大道无言在寸心，不须千里远追寻。 胸中自有圆明镜，莫使尘埃昧得深。 寄马文卿 悟来休得废光阴，一寸光阴一寸金。",
      "translated_text": "Amidst the hush of all sounds, the heart rests in perfect stillness,\nA single wheel of autumn moon shines bright and clear.\n\n**For Steward Wanyan of Chenzhou**\n\nAdding and withdrawing, inquiring through the scorching flames,\nOnce yin and yang are harmonized, the fire burns in ceaseless cycles.\nWhen pure yang is refined, the spirit emerges of itself,\nOn the path of no-birth, roam freely and without care.\n\n**For Abbess Wanyan of Chenzhou**\n\nSought all day, year after year, yet nowhere to be found,\nYet when attained, no time was ever spent.\nA single spark of numinous clarity—this true message,\nWhether for Buddha or immortal, it is this heart.\n\n**For Abbess Sun of Chenzhou**\n\nSweep away all worldly concerns until nothing remains,\nLet no dust obscure the ice-pure flask.\nWithin the breast, a single thing—divine radiance appears,\nTen thousand crimson clouds enfold the jeweled pearl.\n\n**For Minister Puchaci Congyi of Xizhou**\n\nWhen merit is complete and fame achieved, return early to the mountains,\nStaff in hand, wander carefree wherever you go.\nIn the light of the bright moon, subtle wonders fuse,\nWhere white clouds gather, refine the elixir of spirit.\n\n**For Elder Brother Wanyan of Chenzhou**\n\nCut away the brambles to open the heart’s ground,\nSweep clear the wasteland to plant auspicious lotuses.\nThe rustling breeze stirs jade-like leaves,\nThe radiant new moon illumines the alchemical heaven.\n\n**For Abbot Zhang of the Chen Garden in Chenzhou**\n\nCast aside the six desires, and the body is at ease,\nUnstained by a single speck of dust, the nature roams free.\nCultivate the rootless tree within the fire,\nRelease the divine blossom that never fades.\n\n**For Abbess Xu**\n\nFame and merit are like sparks struck from stone,\nWealth and rank vanish like foam upon the water.\nLet go, and ascend the path beyond the clouds,\nAll distinctions of right and wrong, self and other, cease at once.\n\n**To Liu Sanxian**\n\nLong have we wandered apart in Suiyang,\nGazing until spring clouds no longer come.\nCherish the priceless sword of Dragon Spring,\nLet not its sacred light be dimmed by dust.\n\n**For Abbot Song of Hutou**\n\nThis body drifts like a lone tumbleweed between heaven and earth,\nWandering aimlessly, east and west.\nBetter to sit idly in a grass hut,\nReturning to nurture my indolence in lofty solitude.\n\n**For Officer Guo of Changping**\n\nFire, wind, earth, water—what compels their service?\nGathered, they form shape; scattered, they return to rest.\nHalf a sheet of merit is but wasted effort,\nA hundred years of grasping at water’s foam.\n\n**For Wang Miaojian of Runliu Town**\n\nLet not a single thought disturb the heart’s leisure,\nShatter the knots of doubt to realize non-action.\nHold fast within the breast the nature of the Perfect Real,\nHow many in ancient or present times have preserved it?\n\n**For Chief Patron Wang of Linxian County**\n\nSpring’s light fades, and the traveler grows weary,\nWithered blossoms, butterflies—sorrow deepens.\nYet the osmanthus shadow knows no decay,\nIts fragrance fills the world—when will it ever cease?\n\n**For Chief Patron Shao of Linxian County**\n\nNot skilled in capturing foxes or hobbling horses,\nWhen hungry, eat; when weary, sleep.\nIn profound stillness, a dream of Huaxu,\nOnly then does one realize another heaven lies within the flask.\n\n**To Clerk He**\n\nFor years, you held the rod, angling for the great turtle,\nWhile the white-eyed whale mocked the waves.\nNow gather your line and return west,\nAnother empty crossing of the vast blue sea.\n\n**For Deputy Magistrate Wugulun of Wuyang County**\n\nThe immortal’s livelihood is not arduous,\nCleanse the mind, forget emotion, and qi harmonizes of itself.\nWhen joyful, take up the staff and seek wild paths,\nWhen weary, rest high upon the pillow, beyond worldly ties.\n\n**For Abbess Wanyan**\n\nBy the pine window, on the stone pillow, sleep at ease,\nEven when visitors come along the bamboo path, remain unaware.\nStartled awake, robe drawn close, sit upright—\nForm like withered wood, eyes like sleep.\n\n**For Chief Patron Zhang of Mengzhai**\n\nSuddenly cast off the world’s net to preserve the Perfect Real,\nPurify the spirit’s palace to nurture the Valley Spirit.\nEver keep the heart empty, free of all affairs,\nAs osmanthus blooms anew at the edge of the heavens.\n\n**For Supervisor Yu of the Daoist Abbey**\n\nDistant mountains, veiled in emerald mist,\nTowering green peaks near the forest springs.\nCarve open chaos to reveal a glimpse of scenery,\nSteal a speck of heaven from within the flask.\n\n**For Abbot Zu of Nanyang County**\n\nThe Three Realms have walls, yet still seem narrow,\nThe Four Directions have no bounds—all is garden.\nYellow blossoms, green bamboo—all my affairs,\nClouds are clouds, mountains are mountains.\n\n**For Abbot Cheng**\n\nFor forty autumns, you held the fishing line,\nWhenever waves arose, you cast your hook.\nThe whale and whalebone refused the fragrant bait,\nEmpty boat adrift, you wander alone.\n\n**For Lady Muhu**\n\nMankind knows only to chant the name of Amitābha,\nBut can you yourself become Amitābha?\nRecognize the original ancestor, formless,\nNo need to seek without, running in vain.\n\n**For Officer Kang**\n\nDo not compare it to mountains high or seas deep,\nThe seeker wastes effort in distant searches.\nBefore your eyes lies the Way of long life,\nBoth sage and mortal arise from this inch of heart.\n\n**For Chief Patron Xue of Luoyang**\n\nNear water, beside mountains, emerald mists enfold,\nYet fame and profit bind your steps, and you forget to return.\nThis body does not belong to the red dust’s guest,\nLying down, watch the white clouds drift beyond the sky.\n\n**For Daoist Yila**\n\nLet not the Daoist’s steps falter,\nThe heart’s mirror must be polished with single-minded resolve.\nWhen all traces of grime are gone, light appears of itself,\nWithin this square inch, behold Amitābha.\n\n**For Abbess Gui**\n\nTreading the world’s edge, sought in vain,\nYet when attained, no effort was ever spent.\nCast aside a hundred years of red dust affairs,\nA true person now steers the chariot.\n\n**For Chief Patron Jimofan**\n\nWithin the web of form, a body unbound,\nWho through the ages has understood near and far?\nCast off the hundred years of this mother-born sack,\nA true person now drives the sun’s chariot.\n\n**For Commander Tangkuo of Chenzhou**\n\nBreak free from the world’s net, and the body is at ease,\nLeap from the cage of the mundane, and the nature is free.\nStaff in hand, enter the misty path of rosy clouds,\nStartling the white clouds to fill the old mountains.\n\n**For Chief Patron Ma**\n\nSince you seek the Dao, study deeply,\nThe secret method, once transmitted, bears fruit.\nA single spark of numinous clarity, clear as water,\nRefined into the elixir, crimson within the crucible.\n\n**For Chief Patron Chen**\n\nDwelling in the sea of suffering, do not speak of the Dao,\nBeneath the mountain of grace, do not discuss Chan.\nIf you let go of both,\nNo need to dig the earth to seek the heavens.\n\n**For Military Supervisor Shi**\n\nBeyond the city walls, a few acres of garden,\nSilk and hemp, congee and porridge, sustain these fading years.\nNo ambition to ride the crane or mount the clouds,\nContent to wander the world, responding to illusions.\n\n**For Chief Patron Cao**\n\nThe Great Dao is wordless, within this inch of heart,\nNo need to chase it a thousand miles afar.\nWithin the breast lies a mirror, perfectly bright,\nLet not dust obscure its depths.\n\n**To Ma Wenqing**\n\nOnce awakened, waste not a moment,\nFor an inch of time is an inch of gold.",
      "overlap_context": "wo scrolls of idle text,\nWhen weary, in the pine pavilion, watching the sunset glow.\n\n**For Jia the Daoist of Xihua County**\n\nCutting off the crane’s legs to lengthen the duck’s, forgetting proportion,\nFilling mountains and valleys, obscuring the verdant green.\nOne gourd is enough for the hermit’s joy,\nAn inch of ground, always empty, for the great awakened immortal.\n\n**For Chang the Novice of Chenzhou**\n\nThe Daoist’s heart is clear as ice,\nWithout need for contrivance, the Dao arises of itself.",
      "start_char": 9405,
      "end_char": 10898,
      "start_sentence": 593,
      "end_sentence": 688,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.96526837348938,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\离峰老人集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "爱海波中留不住，乱云深处觅知音。 宿州纥石烈问前程 于氏高门元有渐，燕山丹桂岂无因。 不须若问前程事，真正无私是吉人。 赠萧县宋大师 先生策杖便从容，把握灵珠在掌中。 好向云山柄隐去，闲窗高卧饮松风。 懒窝自咏 懒汉今来住懒窝，禁持意马已蹉跎。 饭余只解堆灰坐，更有慵人似我么。 赠高姑 谁识当场傀儡身，一重皮肉一堆尘。 百年线断无消息，去了当场把戏人。 示独吉监丞夫人 四象合成痴肉块，五行结就臭骷髅。 状同傀儡亲曾看，个个能言解点头。 赠刘姑 水晶宫裹结红莲，证果无为大觉仙。 冉冉便登云外路，腾腾飞入紫微天。 赠奥屯经历夫人 七十光阴已半过，劝人进道莫蹉跎。 无常一旦临头逼，儿女虽亲替得么。 乐道人告 若论修行万事休，胸中不挂一丝头。 寂然万籁无声迹，有个灵童驾火牛。 小杨姑告 道人无碍铁心肠，跃出三山混渺茫。 遥指白云深处去，蓬莱元是旧家乡。 赠大杨姑 五行结就臭皮囊，一颗神珠裹面藏。 静即心花通体莹，动时无处不辉光。 徐道冲告 道人真实最相宜，食饱无余步翠微。 困即和衣溪上卧，觉来收拾乱云归。 仝姑告 人能清静绝熬煎，恬淡虚无养浩然。 脑后剔开三昧眼，心中明彻自家天。 门人问如何是了达 你来问我求了了，世事纷纷都尽剿。 一轮明月正当天，万里无云光皎皎。 示高仙 从来劣性要堤防，举动灵苗已损伤。 且把芒绳牢击守，待他心境两俱忘。 刘姑告 长生路上逍遥客，不夜乡中自在仙。 逗引灵童归紫府，调和玉女种金莲。 赠孙天和 慧刀割断利名强，物外逍遥万虑忘。 撒手便登三岛路，程程都是白云乡。 又 无名窟裹毒蛇藏，举起头来物便伤。 寄语行人须着意，往来常切要堤防。 赠尚道人 半纸虚名空似响，百年短景疾如梭。 鬓边白发新添甚，脸上红颜暗换多。 赠高都监 清风古道少人行，浊水淤泥抵死争。 可笑一般愚蠢物，枕糟藉麴过平生。 徐道冲问道 你有真师更问谁，同茶同饭几曾离。 我今指破知端的，举念生心总是伊。 赠小张仙 从来仗俩都除尽，一旦古灵明倒过来。 拾得这般真受用，世问无处不蓬莱。 展姑告 了得真源万事无，尘绿不许污灵珠。 水源澄诤全身现，云散寥天月自孤。 博志坚告 修行非易亦非难，下手先除人我山。 锻炼真空同一体，自然心似白云闲。 李姑告 漠漠春姻日渐长，江梅犹带返魂香。 洞天先得真消息，催逼束君造化忙。 初春 腊尽春回白昼长，洞天先得好风光。 束皇来约群仙会，归去碧云衣袂香。 临颖李县尉告 风裹微闻松桂香，山堂明月玲辉光。 道人夜静偷然坐，万籁无声一味冻。 李姑问行程 渺邈蓬壶咫尺问，行人迷隔万重关。 牧童不指襄城路，黄帝犹寻大块山。 赠周姑 势利看来玲似冰，道人於世已忘情。 昨宵一枕游仙梦，稳驾金鸾朝玉京。 赠移刺答院 心灰玲落无姻火，枯木形骸不放芽。 直待三阳真火降，堂前铁树也开花。 尼长老问修行 你来问我修行诀，我今与你叮咛说。 扫尽群阴现本真，青霄挂起一轮月。 又 去住逍遥信自然，龟长蛇短祖师禅。 山头一片清冻境，始见壶中别有天。 董志源告 慧刀举处散群迷，进出银霞万道飞。 灭却阴尸多目鬼，莲花帐裹露希夷。 赠会首薛六郎 先天灵物有无中，动即随机静即空。 万物之中常作主，千般运用应无穷。",
      "translated_text": "**For Heshi Lie of Suzhou, Inquiring of His Future**\n\nAdrift in the waves of the sea of love, none can stay,\nAmidst the tangle of clouds, seek a true friend.\nThe Yu clan’s lofty gates have long held promise,\nThe cinnamon of Yan Mountain bears no cause without reason.\nNo need to ask of the future’s path—\nOne truly selfless is a person of fortune.\n\n**For Master Song of Xiao County**\n\nThe master strolls with staff in hand, at ease,\nGrasping the luminous pearl within his palm.\nBest to retreat to the cloud-wreathed mountains,\nReclining in leisure by the window, sipping the wind through pines.\n\n**Lazy Nest, Self-Composed**\n\nA lazy man now dwells in this lazy nest,\nThe steed of will long since reined and spent.\nAfter meals, he only knows to sit in heaped ashes—\nIs there another as indolent as I?\n\n**For Lady Gao**\n\nWho recognizes this puppet body on stage?\nLayer upon layer of flesh, heap upon heap of dust.\nWhen the hundred-year thread snaps, no news remains—\nGone is the puppeteer who once played the scene.\n\n**For the Wife of Supervisor Duji**\n\nThe four images congeal into a lump of deluded flesh,\nThe five phases knit into a stinking skeleton.\nLike puppets they appear—have you not seen?\nEach can speak and nod in turn.\n\n**For Lady Liu**\n\nWithin the crystal palace blooms a crimson lotus,\nAttaining the fruitless fruit, a great awakened immortal.\nGently she ascends the path beyond the clouds,\nSoaring into the Purple Tenuity Heaven.\n\n**For the Wife of Administrator Aotun**\n\nSeventy years of life—half already past,\nI urge you to advance upon the Dao, let no time slip.\nWhen impermanence suddenly presses upon your head,\nThough your children be dear, can they take your place?\n\n**For the Daoist of Joyful Practice**\n\nIf you speak of cultivation, all things cease,\nNot a single thread clings within the breast.\nAll sounds stilled, no trace remains—\nOnly a numinous youth driving the fire-ox.\n\n**For Little Yang the Daoist**\n\nThe Daoist’s heart is unobstructed, iron-willed,\nLeaping beyond the Three Mountains into vast obscurity.\nPointing afar to the depths of white clouds,\nPenglai is but her old homeland.\n\n**For Great Yang the Daoist**\n\nThe five phases knit this stinking skin-sack,\nA single spirit-pearl hidden within.\nWhen still, the flower of the heart shines through the body,\nWhen moving, no place is without its radiance.\n\n**For Xu Daochong**\n\nThe Daoist is most fitting in truth,\nFed to fullness, he treads the emerald peaks.\nWhen weary, he sleeps by the stream in his robes,\nAwakening, he gathers the drifting clouds to return.\n\n**For Sister Tong**\n\nOne who can be pure and still, free from torment,\nCultivating tranquility and emptiness to nourish the vast,\nBehind the brain, the eye of samadhi opens—\nWithin the heart, one’s own heaven shines clear.\n\n**When a Disciple Asked, \"What Is Complete Understanding?\"**\n\nYou come to ask me of complete understanding,\nYet worldly affairs are already swept away.\nA bright moon hangs full in the sky,\nTen thousand miles without clouds, its light gleaming.\n\n**For Gao the Immortal**\n\nGuard ever against your inferior nature,\nFor every movement harms the sprouts of spirit.\nHold fast the whip of thorns,\nUntil both heart and realm are forgotten.\n\n**For Lady Liu**\n\nA carefree traveler on the road of long life,\nA self-possessed immortal in the land of unending light.\nLuring the numinous youth to return to the Purple Court,\nHarmonizing the Jade Maidens to plant golden lotuses.\n\n**For Sun Tianhe**\n\nThe blade of wisdom severs the bonds of fame and gain,\nBeyond the world, carefree, all worries forgotten.\nWith a single release of the hand, he ascends the path to the Three Isles,\nEach step a land of white clouds.\n\n**Again**\n\nWithin the nameless cave lurks a venomous serpent,\nRaise its head, and all things are harmed.\nI warn the traveler: take heed,\nEver vigilant in coming and going.\n\n**For Daoist Shang**\n\nHalf a sheet of empty fame, hollow as an echo,\nA hundred years of fleeting life swift as a shuttle.\nAt the temples, white hair newly thickens,\nOn the face, rosy complexion silently fades.\n\n**For Supervisor Gao**\n\nThe ancient path of clear wind sees few travelers,\nYet in muddy waters and silted streams, they struggle to the death.\nHow laughable these foolish creatures,\nWho spend their lives pillowed on dregs and lees.\n\n**When Xu Daochong Asked of the Dao**\n\nIf you have a true teacher, whom else would you ask?\nWe share tea and rice, never parted.\nNow I point directly to the mark—\nEvery thought that arises is none other than this.\n\n**For Little Zhang the Immortal**\n\nAll reliance on tricks long since cast aside,\nSuddenly the ancient spirit shines through.\nHaving gained such true enjoyment,\nIn this world, no place is not Penglai.\n\n**For Sister Zhan**\n\nHaving grasped the true source, all things vanish,\nNo dust or defilement may stain the luminous pearl.\nWhen the waters of the source are clear, the whole body appears,\nWhen clouds disperse, the moon in the vast sky stands alone.\n\n**For Bo Zhijian**\n\nCultivation is neither easy nor difficult,\nBegin by removing the mountain of self and other.\nTemper true emptiness into one body,\nNaturally the heart will be as idle as white clouds.\n\n**For Lady Li**\n\nThe misty spring haze lengthens with the days,\nThe river plum still bears the fragrance of returned souls.\nThe grotto-heaven first receives the true message,\nHastening the Lord of Creation in his work.\n\n**Early Spring**\n\nWinter’s end, spring returns, the days grow long,\nThe grotto-heaven first gains its fine scenery.\nThe Lord of Creation summons a gathering of immortals,\nReturning amidst green clouds, sleeves fragrant.\n\n**For Magistrate Li of Linying**\n\nIn the wind, the faint scent of pine and cassia,\nThe mountain hall’s bright moon gleams with radiance.\nThe Daoist sits in silent stillness through the night,\nTen thousand sounds stilled, a single taste of frost.\n\n**When Lady Li Asked of the Journey**\n\nBetween Penglai and this world, the distance is but a foot,\nYet the traveler is lost beyond ten thousand barriers.\nThe cowherd does not point the way to Xiangcheng,\nEven the Yellow Emperor still seeks the Great Clod’s mountain.\n\n**For Lady Zhou**\n\nPower and profit appear as brittle as ice,\nThe Daoist has already forgotten worldly passions.\nLast night, in a dream of wandering immortals,\nShe rode a golden simurgh to court in the Jade Capital.\n\n**For Yila Dayuan**\n\nHeart-ash cold and fallen, no smoke of passion,\nA withered tree’s form, no sprouting buds.\nOnly when the true fire of the three yangs descends,\nWill the iron tree before the hall bloom.\n\n**When the Nun Elder Asked of Cultivation**\n\nYou come to ask me of the secret of cultivation,\nNow I tell you earnestly:\nSweep away all yin to reveal your original truth,\nAnd a single moon will hang in the azure sky.\n\n**Again**\n\nComing and going, carefree, following nature,\nThe long turtle, the short snake—ancestral Chan.\nUpon the mountain, a realm of pure frost,\nOnly then does one see another heaven within the gourd.\n\n**For Dong Zhiyuan**\n\nWhere the blade of wisdom is raised, delusions scatter,\nForth burst silver radiance in ten thousand strands.\nThe many-eyed ghost of yin’s corpse extinguished,\nWithin the lotus pavilion, the rare and subtle appears.\n\n**For Chief Patron Xue the Sixth**\n\nThe numinous treasure of prior heaven exists in the realm of having and not-having,\nMoving, it follows the moment; still, it is empty.\nAmidst the ten thousand things, it ever acts as master,\nIts thousandfold workings respond without end.",
      "overlap_context": "alls, a few acres of garden,\nSilk and hemp, congee and porridge, sustain these fading years.\nNo ambition to ride the crane or mount the clouds,\nContent to wander the world, responding to illusions.\n\n**For Chief Patron Cao**\n\nThe Great Dao is wordless, within this inch of heart,\nNo need to chase it a thousand miles afar.\nWithin the breast lies a mirror, perfectly bright,\nLet not dust obscure its depths.\n\n**To Ma Wenqing**\n\nOnce awakened, waste not a moment,\nFor an inch of time is an inch of gold.",
      "start_char": 10899,
      "end_char": 12412,
      "start_sentence": 689,
      "end_sentence": 788,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.879661560058594,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\离峰老人集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "春游 年老心嫌衣带长，强携节杖看春光。 满园桃李皆相羡，都道肌肤似沈郎。 厨张问生死事 昔时死者何曾死，今日生来有甚生。 生死到头元有甚，安时处顺要分明。 游云溪 众仙邀我探春来，缕缕春红相问开。 俟入桃源即非梦，人问何处觅蓬莱。 张悟真告 壶中一粒紫金砂，炼就光生万道霞。 服了不知浮世隘，顿然身在大方家。 周姑告 般般识破都为梦，事事谙来总是空。 悟得不空安分过，从他乌兔走西束。 张怀远告 物物般般总不迷，回头参破老禅机。 莫教流落人问世，无相天真要执持。 刘令史告 真清真静逍遥客，无执无持自在仙。 策杖便归云外去，草鞋踏破洞中天。 赠孙大师 惜神养气固灵田，境静心闲道自然。 赫赫光中生瑞草，炎炎火内结红莲。 石祸玉溪庵闲游三首 道人策杖看西山，心似白云到处闲。 一枕困来仙阙梦，岂知身在翠微问。 忽忆逍遥物外游，便携华杖步林丘。 腾身直上三峰顶，虚彻灵源万虑休。 昨忆仙游到此山，个中景物共闲闲。 白云出岫亦无意，幽乌与人皆偶还。 辛先生告 道人心定寂寥居，皎洁圆明似玉壶。 云去云来俱不碍，无生无灭证无余。 刘先生告 大道虚无本自然，不劳苦苦用多言。 但教心上无尘垢，一点灵明光自圆。 亳州太清宫升堂 我是云溪懒丈夫，祖庭羽客强相扶。 无疆圣寿祝延外，看有金鳞上钓无。 太清宫栖真庵述怀 清风招我到栖真，境界修然断世尘。 犹有岁寒君子竹，窗问横影弄精神。 竹裹啾啾百乌喧，竹斋呼起日高眠。 将迎不断人如识，我自胸中独悄然。 疏懒从来百不拘，披襟闲看老庄书。 忽然读到忘言处，枯木形骸等太虚。 西郊火老暂开颜，顿觉幽庭枕蕈寒。 万里碧天清似水，那堪梳月半衔山。 读忘意论 检褊南华觅也无，得来元不费功夫。 须知自有天真在，一点灵明常湛如。 记梦 梦中亲观圣贤来，白鹤青鸾下玉台。 一篑大还功未就，瑞云缭绕复重回。 又 寒窗寂寂枕书眠，觉后檠灯尚俨然。 檐外月华明似昼，风停姻静太平年。 示时官 一行作吏莫伤民，百计施恩与日新。",
      "translated_text": "**Spring Outing**\nOld in years, my heart finds robes too long,\nYet I grasp my staff and force myself to see spring’s light.\nThe garden’s peach and plum all gaze with envy,\nSaying my skin rivals Master Shen’s glow.\n\n**Chef Zhang Asks About Life and Death**\nThose who died long ago—did they ever die?\nThose born today—what birth do they truly know?\nWhen life and death reach their end, what remains?\nTo rest in harmony, in accord—this must be clear.\n\n**Roaming Cloud Creek**\nA host of immortals invites me to seek spring’s traces,\nThread upon thread of crimson blooms unfold in greeting.\nShould I enter Peach Blossom Spring, it would be no dream—\nYet when others ask, where to find Penglai?\n\n**For Zhang Wuzhen**\nWithin the gourd, a single grain of purple gold sand,\nRefined, it radiates a thousand strands of rosy mist.\nOnce ingested, the floating world’s narrowness fades,\nAnd suddenly the body dwells in the vast and boundless.\n\n**For Madam Zhou**\nAll things seen through are but dreams,\nEvery affair known is but emptiness.\nAwakened to the not-empty, content in one’s lot,\nLet the sun and moon race east and west as they will.\n\n**For Zhang Huaiyuan**\nNot a single thing, not a single form leads astray,\nTurning back, one penetrates the old Chan mechanism.\nDo not let yourself drift through the human world—\nHold fast to the formless, the true, the uncontrived.\n\n**For Magistrate Liu**\nTruly pure, truly still—the carefree wanderer,\nNo clinging, no grasping—the self-soaring immortal.\nWith staff in hand, he returns beyond the clouds,\nStraw sandals treading through the heavens of the grotto.\n\n**For Master Sun**\nCherish spirit, nurture qi, and fortify the numinous field,\nIn stillness of realm and tranquility of mind, the Dao is natural.\nAmidst blazing light, auspicious herbs arise,\nWithin flames of fire, red lotuses bloom.\n\n**Three Poems on Leisurely Roaming at Jade Creek Hermitage**\n\n**I**\nThe Daoist leans on his staff to gaze at Western Mountain,\nHis heart like a drifting white cloud, at ease wherever it goes.\nShould he drift into sleep, a dream of celestial palaces—\nWho would know his body rests amidst emerald peaks?\n\n**II**\nSuddenly recalling a carefree journey beyond the world,\nHe takes up his patterned staff and strides through wooded hills.\nLeaping to the summit of Three Peaks,\nThe empty and clear wellspring stills ten thousand cares.\n\n**III**\nYesterday, recalling an immortal’s roaming to this mountain,\nThe scenes within were all serene and unhurried.\nWhite clouds emerge from the ravine without intent,\nAnd the hidden birds return with men by chance.\n\n**For Master Xin**\nThe Daoist’s heart abides in silent solitude,\nLuminous, round, and bright as a jade gourd.\nClouds come and go without hindrance,\nBirthless and deathless—realizing the traceless.\n\n**For Master Liu**\nThe great Dao is empty and nonexistent, yet naturally so,\nNo need for labored words or endless speech.\nSimply keep the heart free of dust and grime,\nAnd a single point of numinous clarity will shine of itself.\n\n**Ascending the Hall at Taiqing Palace, Bozhou**\nI am Cloud Creek’s indolent husband,\nForced by ancestral court feathered guests to rise.\nBeyond endless prayers for the sage’s longevity,\nI watch for golden scales to rise upon the hook.\n\n**Composed at Qizhen Hermitage, Taiqing Palace**\nA pure breeze summoned me to Qizhen,\nWhere the realm is suddenly cut from worldly dust.\nYet here stand the noble bamboos of winter’s endurance,\nTheir shadows slanting through the window, stirring spirit.\n\nAmidst the bamboo, a hundred birds chirp and clamor,\nRousing me from sleep as the sun climbs high.\nThough men may recognize the ceaseless to-and-fro,\nI alone remain silent within my breast.\n\n**Idleness**\nEver careless, bound by nothing,\nI loosen my robe and idly read Lao-Zhuang.\nSuddenly, reaching the place beyond words,\nMy withered form and bones become like the great void.\n\n**West Garden Fire**\nThe west garden’s fire briefly lifts my face,\nAs I suddenly feel the hermitage’s coolness beneath the pillow.\nTen thousand miles of azure sky, clear as water—\nHow can I bear the moon half-cradled in the mountain’s teeth?\n\n**Reading the *Treatise on Forgotten Intent***\nI searched *Nanhua* for it in vain,\nYet found it required no effort at all.\nKnow that the celestial truth resides within—\nA single point of numinous clarity, ever serene.\n\n**Recording a Dream**\nIn dreams, I beheld sages and worthies descend,\nWhite cranes and green simurghs alighting from jade terraces.\nA single basket of the great return—work unfinished,\nAuspicious clouds swirled and circled once more.\n\n**Again**\nBy the cold window, silent, I slept with books for a pillow,\nAwakening to find the lamp still burning bright.\nBeyond the eaves, moonlight shone clear as day,\nWind stilled, smoke settled—in a time of great peace.\n\n**Admonition to the Magistrate**\nAs an official, do no harm to the people,\nBut devise a hundred ways to bestow kindness anew each day.",
      "overlap_context": "Zhiyuan**\n\nWhere the blade of wisdom is raised, delusions scatter,\nForth burst silver radiance in ten thousand strands.\nThe many-eyed ghost of yin’s corpse extinguished,\nWithin the lotus pavilion, the rare and subtle appears.\n\n**For Chief Patron Xue the Sixth**\n\nThe numinous treasure of prior heaven exists in the realm of having and not-having,\nMoving, it follows the moment; still, it is empty.\nAmidst the ten thousand things, it ever acts as master,\nIts thousandfold workings respond without end.",
      "start_char": 12413,
      "end_char": 13352,
      "start_sentence": 789,
      "end_sentence": 848,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.270307540893555,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\离峰老人集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "入则敬亲出则悌，外全仁义内全真。 张姑告 世务多般不可穷，人问事事转头空。 回头记取先天物，劫坏长存无始终。 世上功名不可求，人问富贵转头休。 争如早作归山计，一片白云天外游。 勒姑告 水南水北路交相，人去人来有底忙。 争似一庵闲打坐，寸心无事自清冻。 霍道人告 假躯六十过半百，苍颜已老髯须白。 扰扰红尘已倦游，云山且作炯霞客。 康国宝殿试至 迢迢溪上水云平，岌岌山问道路生。 但得秋风片帆至，扣门一见眼增明。 石娲赠石道人 欲求罔象得玄珠，既得玄珠事事无。 切莫法中寻有相，须知无上证如如。 杜鹃 青山霭霭乱云低，切切幽禽昼夜啼。 啼得血流谁解意，声声犹道不如归。 示杜道 人绿叶阴阴障夕阳，白云片片渡秋塘。 道人不解红尘事，隐迹林泉宠辱忘。 赠曹道人 我爱林泉景最幽，白云深处水东流。 道人不管兴亡事，一片身心得自由。 怀州高姑告 道人活计不忧贫，玲淡家风不染尘。 云散月华明似昼，回光得见个中人。 石祸董七郎告 古道家风不可求，翻腾故纸几时休。 争如撇下归家去，月白青霄水自流。 寄田户店曹孔月其人以水牛自称 寄语曹家老水牛，芒绳穿鼻拽回头。 时时更与加鞭棰，白到全身得自由。 全道人告 人间莫得辩痴愚，辩得愚痴却是迷。 要识清虚端的理，白云深处悟希夷。 嵩州李姑告 万路千差独往回，灵山采得宝珠来。 春风莫露闲消息，个裹云苞尚未开。 万水千山路不差，蟾宫先得桂枝花。 殷勤为献丹阳父，许占蓬莱第一家。 嵩州张姑告 悟取无言理最深，不须远走访知音。 忽然放下头头是，一片清虚玲淡心。 赠嵩州独吉太守 碧山深处白云闲，却忆云闲偶到山。 乌道暗通姻树外，木人还过翠微问。 王道人告 勤磨慧剑断愚痴，吐出灵光泯见知。 从此身心无坚碍，元君到处自相随。 郎十二先生告 万水千山路不差，山回路转景尤嘉。 故人相见无他语，坐对覃峰看彩霞。 赠石祸马道人 山村寂寂近林泉，春尽无人柳带姻。 别后欲知何处去，蓬莱闲看玉壶天。 赠张仙 道人着力向前修，海角天涯作尽头。 踏破铁鞋方省悟，千山万水一齐休。 邓城县贺先生告 道人真实是功夫，不用丹经与子书。 悟得一言行不尽，端然静坐赀卢都。 为唐庵主姑姑寿 劫外灵芝不假春，壶中境界更无尘。 天边烁烁榆长白，月裹团团桂自新。 王道人告 跳出红尘身自在，个中生死转分明。 纵横无碍逍遥性，何必飞腾十万程。 小李姑告 洗涤尘情事事无，灵台莹彻似冰壶。 不须更问祖师意，拍塞虚空一颗珠。 示边大郎 七十年来老滑头，谈禅论道几时休。 直饶万法俱明彻，不到灰心玲似秋。 常姑告 寻师访道苦参求，笼络身心不自由。 无限玄谈都拂却，一轮明月出山头。 赠韩会首 跃出红尘万事休，已将身世付虚舟。 碧波深处抛香饵，未信金鳖不上钩。 赠木虎都统 策杖飘蓬恣意闲，云朋来谒水云问。 相逢一席无生话，不觉红输西下山。 赵道人告 一夕秋风万叶凋，道人活计转寥寥。 烦襟洗尽尘劳事，咫尺蓬壶路不逼。 示许姑 修仙先要除人我，学道须防较是非。 七宝山头姻火灭，五明宫裹证牟尼。 赠张副使 身是飘飘一叶舟，不辞风浪故来游。 姻波深处抛香饵，不得神鳖不肯休。 又 布袍策杖飘飘去，一片孤云天地问。",
      "translated_text": "**Entering, revere your kin; departing, honor your elders,**\nOutwardly perfecting *ren* and *yi*, inwardly preserving the True.\n*Zhang Gu’s Admonition*\n\nWorldly affairs are manifold, inexhaustible—\nAsk of men, and every matter turns to emptiness in an instant.\nTurn back and recall the primordial thing:\nThrough kalpas of destruction, it endures without beginning or end.\n\nWorldly fame cannot be sought,\nAsk of men, and wealth and rank vanish in an instant.\nHow much better to make early plans to return to the mountains,\nA single wisp of white cloud wandering beyond the heavens.\n*Le Gu’s Admonition*\n\nSouth of the waters, north of the waters, paths crisscross,\nPeople come and go—what is all this bustle for?\nHow much better to sit idly in a hut,\nThe heart untroubled, naturally clear and still.\n*Huo Daoren’s Admonition*\n\nThis borrowed body has passed sixty, half a hundred,\nThe face already aged, beard and temples white.\nWeary of the restless red dust, I have finished my wanderings—\nLet me be a cloud-and-mountain dweller, a rosy-glow guest.\n*Kang Guobao’s Examination Success*\n\nFar off, upon the stream, waters and clouds lie level,\nSteep mountains rise where the Way’s paths begin.\nIf only an autumn wind brings a single sail,\nKnocking at the gate, one glimpse will brighten the eyes.\n*To Shi Wa, Presented to Shi the Daoist*\n\nTo seek the formless and obtain the Mystic Pearl,\nOnce the Mystic Pearl is gained, all things dissolve.\nNever seek appearances within the Dharma,\nKnow that the supreme attainment is *tathatā*.\n*Cuckoo*\n\nGreen mountains, mist-laden, tangled clouds hang low,\nA hidden bird cries urgently day and night.\nWho understands the meaning of its bloodied song?\nEach cry still pleads, *\"Better to go home.\"*\n*Admonition to Du the Daoist*\n\nGreen leaves cast deep shade, veiling the setting sun,\nWhite clouds drift, one by one, across the autumn pond.\nThe Daoist comprehends nothing of worldly affairs,\nHidden in forests and springs, he forgets both favor and disgrace.\n*Presented to Cao the Daoist*\n\nI love the scenery of forests and springs, most secluded,\nWhere white clouds run deep and waters flow east.\nThe Daoist cares not for matters of rise and fall—\nBody and mind wholly free.\n*To Gao Gu of Huaizhou*\n\nThe Daoist’s livelihood fears no poverty,\nHis plain and simple family ways unstained by dust.\nClouds disperse, moonlight bright as day—\nTurning the light inward, he sees the one within.\n*To Shi Huo’s Dong Qilang*\n\nThe ancient Daoist family ways cannot be sought,\nHow long will you keep rummaging through old texts?\nHow much better to cast them aside and return home,\nWhere moon-white skies and blue clouds let waters flow freely.\n*Sent to the Field-Hut Shopkeeper Cao Kongyue, Who Calls Himself \"Water Buffalo\"*\n\nA word to Old Water Buffalo of the Cao family:\nA hempen rope through your nose, pulling you back.\nTime and again, apply the whip—\nOnly when your whole body turns white will you gain freedom.\n*Quanzhen Daoist’s Admonition*\n\nIn the human realm, do not distinguish foolishness from wisdom,\nFor to distinguish foolishness and wisdom is itself delusion.\nTo know the true principle of pure emptiness,\nSeek enlightenment deep in the white clouds, where the subtle and serene abide.\n*To Li Gu of Songzhou*\n\nA thousand paths, ten thousand divergences—only the solitary return,\nFrom the sacred mountain, the precious pearl is gathered.\nLet not the spring wind reveal idle tidings—\nWithin, the cloud-wrapped bud has yet to open.\n\nOver ten thousand waters and a thousand mountains, the path does not err,\nFirst to pluck the cassia branch in the Moon Palace.\nDiligently presented to Father Danyang—\nPermitted to claim the first place among Penglai’s families.\n*To Zhang Gu of Songzhou*\n\nTo grasp the wordless principle is deepest,\nNo need to wander far in search of a knowing friend.\nSuddenly letting go, every direction is it—\nA heart of pure emptiness, clear and serene.\n*Presented to Duji, Prefect of Songzhou*\n\nDeep in green mountains, white clouds idle,\nYet I recall those idle clouds, how they once came to the peaks.\nA dark path through mist-laden trees,\nA wooden man still passes through emerald haze.\n*Wang the Daoist’s Admonition*\n\nDiligently whet the sword of wisdom to sever ignorance,\nSpew forth numinous radiance, dissolving all perceptions.\nFrom this moment, body and mind know no obstruction—\nThe Primordial Lord follows wherever you go.\n*To Master Lang the Twelfth*\n\nOver ten thousand waters and a thousand mountains, the path does not err,\nMountains wind, paths turn—scenery ever more fine.\nOld friends meet, no other words—\nSitting together beneath deep peaks, gazing at rosy clouds.\n*Presented to Shi Huo’s Ma the Daoist*\n\nA quiet mountain village near forests and springs,\nSpring ends, no one stirs, willows trail mist.\nIf you wish to know where I’ve gone after parting,\nLeisurely in Penglai, gazing upon the jade-walled heavens.\n*Presented to Zhang the Immortal*\n\nThe Daoist exerts himself in forward cultivation,\nTo the ends of sea and sky, making it his limit.\nOnly after wearing through iron shoes does he awaken—\nTen thousand mountains, a thousand waters, all at once cease.\n*Admonition to Master He of Dengcheng County*\n\nThe Daoist’s true work lies in sincerity,\nNo need for alchemical classics or the *Book of Master Zhuang*.\nHaving awakened to a single word, its practice never ends—\nSerene and still, he sits in the realm of *Vairocana*.\n*For Tang the Abbess’ Birthday*\n\nBeyond kalpas, the numinous fungus needs no spring,\nWithin the gourd’s realm, no dust remains.\nAt heaven’s edge, the elms gleam white,\nIn the moon’s embrace, the cassia renews itself.\n*Wang the Daoist’s Admonition*\n\nLeaping from the red dust, the body is at ease,\nWithin it, life and death become distinct.\nUnobstructed, carefree in nature—\nWhy strive to soar a hundred thousand leagues?\n*To Little Li Gu*\n\nWashing away worldly passions, all things vanish,\nThe numinous terrace gleams, clear as an ice-jade vessel.\nNo need to ask the patriarch’s intent—\nClapping, the empty void holds a single pearl.\n*Admonition to Elder Bian*\n\nSeventy years an old rogue,\nChattering of Chan, discoursing on the Dao—when will it end?\nEven if all ten thousand Dharmas are fully illuminated,\nWithout reaching the ash-like heart, clear as autumn, it is not enough.\n*Chang Gu’s Admonition*\n\nSeeking teachers, visiting the Way, painfully inquiring,\nBody and mind bound, not free.\nSweeping away endless abstruse discourses—\nA bright moon rises above the mountain’s crest.\n*Presented to Director Han*\n\nLeaping from the red dust, all things cease,\nBody and world entrusted to the empty boat.\nDeep in azure waves, casting fragrant bait—\nWho says the golden turtle will not take the hook?\n*Presented to Commander Mu Hu*\n\nStaff in hand, drifting like tumbleweed, carefree,\nCloud companions come to visit among waters and clouds.\nA single meeting, a seat of unborn discourse—\nUnaware, the red sun sinks behind the western hills.\n*Zhao the Daoist’s Admonition*\n\nOne evening’s autumn wind, ten thousand leaves wither,\nThe Daoist’s livelihood grows ever more desolate.\nWashing away the dust of worldly cares,\nThe Penglai and Kunlun paths lie not far off.\n*Admonition to Xu Gu*\n\nTo cultivate immortality, first cast off self and others,\nTo study the Dao, guard against comparing right and wrong.\nOn Seven-Treasure Mountain, the smoke and fire fade,\nWithin the Five-Light Palace, *Muni* is realized.\n*Presented to Vice Commissioner Zhang*\n\nThis body is a drifting leaf of a boat,\nUnafraid of wind and waves, it comes to wander.\nDeep in misty waves, casting fragrant bait—\nWithout catching the divine turtle, it will not rest.\n*Again*\n\nIn a hempen robe, staff in hand, drifting away,\nA single wisp of solitary cloud between heaven and earth.",
      "overlap_context": " simurghs alighting from jade terraces.\nA single basket of the great return—work unfinished,\nAuspicious clouds swirled and circled once more.\n\n**Again**\nBy the cold window, silent, I slept with books for a pillow,\nAwakening to find the lamp still burning bright.\nBeyond the eaves, moonlight shone clear as day,\nWind stilled, smoke settled—in a time of great peace.\n\n**Admonition to the Magistrate**\nAs an official, do no harm to the people,\nBut devise a hundred ways to bestow kindness anew each day.",
      "start_char": 13353,
      "end_char": 14846,
      "start_sentence": 849,
      "end_sentence": 945,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.704463720321655,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\离峰老人集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "到处不能为雨露，却归林下伴青山。 赠张小－郎 秋风扫荡乾坤静，万里无云点太清。 唯有一轮无相月，先天先地转分明。 示汉阳马姑 束西行脚天涯客，南北求玄自在仙。 参得祖师劫外眼，归来却见自家天。 示王姑 十载诸方负杖华，岂知行住自相随。 却於贩骨聪明鬼，唤起先天先地师。 示周道人 磊磊男儿七尺躯，刀头舐蜜卒非夫。 须知自有天然宝，枉向骊龙觅颔珠。 寄沔池纳兰县令 为官公正胜为道，此语宜书仕子绅。 莫谒麻衣方外客，且将良药济残民。 赠宋大师 不看丹经与子书，快来心上一尘无。 此身便约云为友，去住与之同卷舒。 元道人告 大道虚无本自然，从渠委曲且随绿。 穷通贵贱俱由命，巧拙贤愚只在天。 赠中京张孔目 久恋红尘来往频，林泉岂识有高人。 贪看日上花梢露，失了壶中不夜春。 王会首告 凿开混沌见天真，跳出红尘自在人。 聊向镜中观物化，莫教化却自家身。 赠张副使 我本持竿钓巨鳖，从渠风恶起波涛。 但教神物吞香饵，万里扶摇不惮劳。 赠司天台判 高人策杖扣刑扉，来访箪瓢一布衣。 目击道存忘意论，虚心而往实而归。 柴姑告 身中寂寂闲机少，境上融融和气多。 两袖清风常左右，一条红练出姻萝。 寄张道人 已向丝纶脱此身，百端香饵不相亲。 长江好在无边浪，莫使风尘到锦鳞。 赠赵会首 春光屈指又经秋，贩骨何时是尽头。 恩爱结成他活计，此身作下马和牛。 赠偃师县赵散人 悟时咫尺是蓬莱，迷后重重不尽埃。 一点孤灯才剔正，莫教油尽暗还来。 赠老史道人 壶中金碧好楼台，月裹琼花烂慢开。 鹤唳青霄丹凤舞，彩云深处有蓬莱。 赠赵道人 灵台一点本无尘，幻出空身即法身。 道在性中休别觅，随机应物即天真。 示龙窝张会首 吾家门户几人知，知者须明造化机。 清静之中含妙用，无为之内隐玄微。 全姑告 割烹谁忍能呜及，斤斧终难拥肿施。 才与不才俱是用，此生木鸦复何为。 田道人告 学道先须达自然，自然然后得真仙。 浓粒淡抹空颠倒，想尔钻冰不得燃。 示南京三相公庙寇姑 真清真静永绵绵，炼气先须识自然。 一粒丹砂功九转，瑞霞万道罩金仙。 示元仙 初心入道戒蹉跎，正好丛林细琢磨。 莫遣新尘侵宝鉴，更防旧境损天和。 示梁道人 皎洁玄珠映太阳，水晶宫裹发辉光。 身中有此无穷宝，却为浮生抵事忙。 过孟津 滔滔姻浪向束流，浴日浮云是几秋。 若得灵搓游大海‘，扶桑国裹看瀛洲。 示木匠杨仙 走褊千山与万山，此身犹似白云闲。 归来卧看青霄月，聒耳松风彻骨寒。 董知观告 大悟才知无做作，玄言秘语齐拂却。 撒手束西信自然，策杖逍遥游广漠。 赠嵩山田道人 得到逍遥谒故人，依然云隐养天真。 西风吹落松梢月，坐待扶桑辊日轮。 告县楚会首 全真门裹选仙材，踏破云山特地来。 吾道易行不虚语，世绿倒过即蓬莱。 咏雪 朔风凛冽亦雄哉，吹落天花褊地开。 桃李未知天意动，腊梅先觉化工来。 偃师县税务李都监告 解出无涯欲浪来，聪明端胜选仙材。 先天灵宝人难觅，寄向南宫无影台。 示史道人 众妙之门日日新，家风玲淡绝纤尘。 闲招云外长生客，同赏壶中不谢春。 自乐 风过庭松唤午眠，觉来石鼎尚沈姻。 不求羽化乘云鹤，且作人问陆地仙。 辞太清宫 去去西风吹道衣，祖庭未得遂真依。",
      "translated_text": "Wherever I go, I cannot become rain or dew,\nYet I return to the forest to companion the green mountains.\n*Presented to Young Master Zhang*\n\nAutumn winds sweep the cosmos clean,\nTen thousand miles without a cloud, the Great Purity spotless.\nOnly a single wheel of the formless moon,\nBefore heaven and earth, turns ever more bright.\n*Shown to Ma the Daoist of Hanyang*\n\nEast and west, a wanderer to the ends of the earth,\nNorth and south, seeking the mystery as a carefree immortal.\nHaving grasped the patriarch’s eye beyond kalpas,\nReturning, I see my own heaven.\n*Shown to Wang the Daoist*\n\nFor a decade, I wandered all quarters with staff in hand,\nLittle knowing that movement and stillness follow one another.\nYet among the clever ghosts who trade in bones,\nI awaken the master before heaven and earth.\n*Shown to Zhou the Daoist*\n\nA stalwart man’s seven-foot frame,\nLicking honey from a blade’s edge—this is no true man.\nKnow that you possess a natural treasure,\nIn vain do you seek the pearl beneath the black dragon’s chin.\n*Sent to Magistrate Nalan of Mianchi*\n\nTo govern with impartiality surpasses the practice of the Dao,\nThis saying should be inscribed on the sashes of all officials.\nDo not seek out hemp-robed recluses beyond the world,\nBut rather use good medicine to succor the suffering people.\n*Presented to Master Song*\n\nNot reading alchemical classics or the books of the sages,\nCome swiftly to a heart without a speck of dust.\nThis body then befriends the clouds,\nGoing and staying with them, coiling and unfurling.\n*Announcement by Yuan the Daoist*\n\nThe Great Dao is empty and nonexistent, fundamentally natural,\nLet it twist and turn—just follow its green hues.\nSuccess and failure, nobility and lowliness are all fated,\nCleverness and clumsiness, wisdom and folly rest with heaven.\n*Presented to Zhang the Recorder of the Central Capital*\n\nLong enamored of the red dust, coming and going often,\nHow could you know that hermits dwell in forests and springs?\nGreedily watching dewdrops on flower tips at sunrise,\nYou lose the everlasting spring within the gourd.\n*Announcement to Chief Wang*\n\nBreaking open chaos to see the celestial truth,\nLeaping beyond the red dust as a carefree person.\nIdly gazing in the mirror to observe transformations,\nDo not let the mirror transform your own body.\n*Presented to Vice Commissioner Zhang*\n\nI originally held my rod to fish for the giant turtle,\nLet the winds rage and waves rise.\nAs long as the divine creature swallows the fragrant bait,\nTen thousand miles of soaring winds will not deter me.\n*Presented to the Judge of the Bureau of Astronomy*\n\nA lofty person taps at the gate with staff in hand,\nComing to visit a hemp-robed man with a bamboo bowl.\nThe Dao is present at a glance, forgetting argument,\nGoing with an empty heart, returning with fulfillment.\n*Announcement to Chai the Daoist*\n\nWithin the body, stillness and few idle thoughts,\nIn the world, harmony and abundant qi.\nClean winds ever at my sides,\nA single crimson ribbon emerges from misty vines.\n*Sent to Zhang the Daoist*\n\nAlready having cast off this body like a silk thread,\nA hundred kinds of fragrant bait hold no allure.\nThe Yangtze’s boundless waves remain fine,\nDo not let worldly dust reach the brocade-scaled fish.\n*Presented to Chief Zhao*\n\nSpring’s light, counted on the fingers, has passed another autumn,\nWhen will the trade in bones ever end?\nKindness and love form their livelihood,\nThis body becomes ox and horse for others.\n*Presented to the Recluse Zhao of Yanshi County*\n\nAwakened, Penglai lies but a footstep away,\nDeluded, endless dust stretches on.\nA single lamp’s flame, just trimmed,\nDo not let the oil run out and darkness return.\n*Presented to Old Shi the Daoist*\n\nWithin the gourd, golden towers and jade terraces,\nAmid the moon, jasper flowers bloom resplendently.\nCranes cry in the azure sky, cinnabar phoenixes dance,\nDeep in colored clouds lies Penglai.\n*Presented to Zhao the Daoist*\n\nThe numinous terrace’s single point is originally without dust,\nIllusory empty bodies manifest as dharma bodies.\nThe Dao resides within your nature—do not seek elsewhere,\nResponding to circumstances with spontaneity is celestial truth.\n*Shown to Chief Zhang of Longwo*\n\nHow many know the gate of my family?\nThose who know must understand the mechanism of creation.\nWithin stillness lies wondrous function,\nWithin non-action hides the profound and subtle.\n*Announcement by Quan the Daoist*\n\nWho could bear to carve and cook?\nAxes and hatchets ultimately cannot shape the gnarled.\nWhether talented or not, all have their use,\nWhy then this life as a wooden crow?\n*Announcement by Tian the Daoist*\n\nTo study the Dao, first comprehend spontaneity,\nOnly then can you attain the true immortal.\nDense or sparse, all is vain inversion,\nYou strive in vain, like drilling ice to make fire.\n*Shown to the Three Lords’ Temple of Nanjing and Ke the Daoist*\n\nTrue purity, true stillness, ever unbroken,\nRefining qi first requires recognizing spontaneity.\nA single grain of cinnabar, ninefold transmutation,\nAuspicious radiance in ten thousand strands veils the golden immortal.\n*Shown to Yuan the Immortal*\n\nAt the outset of entering the Dao, do not delay,\nIt is best to polish yourself diligently in the forest.\nDo not let new dust tarnish the precious mirror,\nBeware lest old realms harm celestial harmony.\n*Presented to Liang the Daoist*\n\nThe luminous pearl reflects the great sun,\nWithin the crystal palace, it emits radiance.\nThis body possesses an inexhaustible treasure,\nYet for fleeting life, you toil in vain.\n*Passing Mengjin*\n\nRolling smoke and waves flow eastward,\nBathing the sun, floating clouds—how many autumns?\nIf you obtain the numinous raft to roam the great sea,\nIn Fusang’s land, you will see Yingzhou.\n*Shown to the Carpenter Yang the Immortal*\n\nTraversing a thousand mountains, ten thousand mountains,\nThis body remains as leisurely as white clouds.\nReturning to lie and watch the moon in the azure sky,\nPine winds clamor in the ears, chilling to the bone.\n*Announcement by Dong the Observer of Knowing*\n\nGreat awakening reveals there is nothing to be done,\nMysterious words and secret sayings are all swept away.\nReleasing hands east and west, trusting spontaneity,\nTapping a staff, roaming carefree through vast deserts.\n*Presented to Tian the Daoist of Mount Song*\n\nHaving attained carefree wandering, I visit old friends,\nStill cloud-hidden, nurturing celestial truth.\nThe west wind blows the moon from the pine’s tip,\nSitting, I await the sun’s wheel rolling from Fusang.\n*Announcement to Chief Chu of the County*\n\nWithin the gate of Complete Perfection, selecting immortal material,\nYou tread through clouds and mountains for this very purpose.\nOur Dao is easy to practice, no empty words,\nTurning the world’s currents upside down is Penglai.\n*Ode to Snow*\n\nThe north wind is fierce and mighty,\nBlowing fallen heavenly flowers to blanket the earth.\nPeach and plum do not yet know the heavens’ intent,\nWinter plum first senses the workings of creation.\n*Announcement to Li the Supervisor of Taxes in Yanshi County*\n\nBreaking free from the boundless waves of desire,\nCleverness and wisdom truly surpass immortal material.\nThe celestial numinous treasure is hard for people to find,\nI entrust it to the shadowless terrace of the Southern Palace.\n*Shown to Shi the Daoist*\n\nThe gate of all wonders renews daily,\nThe family’s custom is pure and free from the slightest dust.\nIdly summoning the long-lived guests beyond the clouds,\nTogether we enjoy the unwaning spring within the gourd.\n*Self-Contentment*\n\nWind passes through the courtyard pines, calling me from noon slumber,\nAwakening, the stone tripod still holds sinking smoke.\nNot seeking feathered transformation to ride cloud-cranes,\nI content myself as a mortal immortal on earth.\n*Farewell to the Supreme Clarity Palace*\n\nWestward I go, the west wind blowing my Daoist robes,\nAt the ancestral court, I have not yet attained true reliance.",
      "overlap_context": " study the Dao, guard against comparing right and wrong.\nOn Seven-Treasure Mountain, the smoke and fire fade,\nWithin the Five-Light Palace, *Muni* is realized.\n*Presented to Vice Commissioner Zhang*\n\nThis body is a drifting leaf of a boat,\nUnafraid of wind and waves, it comes to wander.\nDeep in misty waves, casting fragrant bait—\nWithout catching the divine turtle, it will not rest.\n*Again*\n\nIn a hempen robe, staff in hand, drifting away,\nA single wisp of solitary cloud between heaven and earth.",
      "start_char": 14847,
      "end_char": 16351,
      "start_sentence": 946,
      "end_sentence": 1044,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.558929681777954,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\离峰老人集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "他山猿鹤闲绿了，管领白云容再归。 寄尚仙 冥中鬼趣时时遣，物外玄门日日开。 墨子悲丝元自染，杨朱泣路未归来。 李官人告 万里姻波一叶舟，轻帆短棹泛中流。 蟾光影裹闲垂钓，那计鲸鱼不上钩。 寄陈州道友 功成名遂好抽身，作个林泉自在人。 采得日魂为大药，炼成月魄现阳神。 寄费庄李官人 学仙未到弃尘绿，海岳涓埃积渐然。 更向玄门轻进步，蓬莱别有洞中天。 寄白沙道友 猿马轻狂牢锁闭，休贪世乐心如醉。 悟来跳出死生关，一灵真性无凝滞。 赠李道友 仙人五亩小蓬瀛，四百秋波分外清。 视听不须关耳目，希夷路上坦如平。 示口天姜闷友",
      "translated_text": "The apes of other mountains and cranes of leisure have turned green,\nEntrusted with the white clouds, I shall return again.\n*For Master Shang the Immortal*\n\nIn the unseen, ghostly realms are ever dispatched,\nBeyond the world, the gate of mystery opens daily.\nMozi grieved that silk is dyed by nature,\nYang Zhu wept on the road, never to return.\n*For Officer Li*\n\nA thousand leagues of misty waves, a single-leaf boat,\nLight sail and short oar drift midstream.\nIn the glow of the toad’s light, idly I fish,\nHeedless whether the whale takes the hook.\n*For Daoist Friends in Chenzhou*\n\nWith merit achieved and name attained, best to withdraw,\nBecoming a carefree man of forests and springs.\nGathering the sun’s essence as the great elixir,\nRefining the moon’s spirit to manifest the yang spirit.\n*For Officer Li of Fei Village*\n\nNot yet having abandoned the world’s dust in learning the Dao,\nThe seas and mountains accumulate grain by grain.\nTake further steps through the gate of mystery,\nFor Penglai holds another heaven within its caves.\n*For Daoist Friend of Baisha*\n\nRestrain the wildness of apes and horses, lock them tight,\nDo not crave worldly pleasures, heart drunk with desire.\nAwakened, leap beyond the gate of life and death,\nThe true nature of the spirit flows without obstruction.\n*For Daoist Friend Li*\n\nThe immortal’s five-acre Penglai isle,\nFour hundred autumn waves, exceptionally clear.\nSight and sound need not bind ears and eyes,\nOn the path of the subtle and tranquil, level as a plain.\n*For Kou Tian and Jiang Menyou*",
      "overlap_context": "-lived guests beyond the clouds,\nTogether we enjoy the unwaning spring within the gourd.\n*Self-Contentment*\n\nWind passes through the courtyard pines, calling me from noon slumber,\nAwakening, the stone tripod still holds sinking smoke.\nNot seeking feathered transformation to ride cloud-cranes,\nI content myself as a mortal immortal on earth.\n*Farewell to the Supreme Clarity Palace*\n\nWestward I go, the west wind blowing my Daoist robes,\nAt the ancestral court, I have not yet attained true reliance.",
      "start_char": 16352,
      "end_char": 16653,
      "start_sentence": 1045,
      "end_sentence": 1064,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.912237882614136,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\离峰老人集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "人人只解念弥陀，自己弥陀会得么。 记取本来无相祖，不干般若与波罗。 李会首告 众妙之门日日开，家风峻古绝纤埃。 虽然淡薄无余事，不许等闲人入来。 示任姑 打破疑团笑一场，不须来往褊诸方。 胸中有物明如月，却觅他人夜烛光。 示史道人 物外玄微世上名，一边败后一边成。 后来蓬岛洲中客，不在那鄂路上行。 示陈会首 一湾流水逵云溪，昼夜泠泠说道机。 多少往来名利客，贪观风浪隔玄微。 示王道人 直钩不钩波中月，数罟难捞水底云。 用尽身心离道远，诸绿放下许传君。 寄陇西老人 逼望束南木叶飞，满空秋气逼人衣。 仙翁已达丹霄景，闲对青松吸翠微。 小李姑告 出家须是学神仙，好与长生作善绿。 但肯此中留一念，瑶池会裹结金莲。 示刘令史 纷华尘外三山客，苦海波中一叶舟。 试掷丝论深浪裹，游鱼若个肯吞钩。 示姬磨李道人 息虑忘机任自然，不须访道与参禅。 因循一片闲云起，碍却壶中不夜天。 示峡石县冀会首 梦中又说梦中事，觉后才知梦已休。 拂石南溪观物化，滔滔依旧水束流。 寄陕州会首 神丹常在掌中握，玄鉴只宜心上安。 照破世问虚幻境，自然身似野云闲。 示玉溪庵王道人 人生何处不逍遥，论甚山村与市朝。 但得寸心诸畏尽，虎狼群裹也嚣嚣。 示费庄夏会首 我家门户本幽玄，寂寂寥寥任自然。 修短纤洪都莫话，饥来吃饭倦时眠。 太清宫退堂 我本桃花峰上客，忽遗尘迹在人问。 祖庭虽好因绿早，且放白云归故山。 又 风驭飘飘来祖庭，瑞姻芳草桂花馨。 因绿未合须回首，却入伊川卧锦幌。 还长生观 识破从来古面皮，千非万谤任从伊。 轻姻薄雾空遮障，依旧遥山不皱眉。 自咏 截断当头窍不呜，玄珠收入宝花瓶。 从今更不矜愚智，闲了将军便太平。 游老君山 飘飘风袖出山门，回首青山似老君。 试听清泉山伴语，分明说尽五千文。 示雉岔山胡道人 乱山深处结茅斋，万顷云姻拨不开。 采药仙童风袖裹，异香随得紫芝来。 示张会首 为仙为佛要功夫，尘念尘心子细除。 待得灵明光宇宙，始知糟粕世问书。 蒲察提控夫人告 我爱林泉景异常，天风吹散桂花香。 行人欲去还回首，笑杀浮生有底忙。 蒲察夫人寿 道人亦欲祝渠寿，世事冥然总不知。 一粒仙丹烦领略，松龄鹤筹未为奇。 赠孙太师夫人 功名未了身先老，白发苍颜下手迟。 顿悟此身非我有，真空不动片云飞。 田会首告 炳焕灵明是此心，片言遮障作重阴。 清虚自有真消息，莫向诸方法上寻。 马姑告 造化无穷尽自然，不须身外更求仙。 天光发处凡情灭，宝鉴明时道眼圆。 离峰老人集卷下竟",
      "translated_text": "Each person merely recites Amitābha’s name,\nYet does one truly grasp Amitābha’s self?\nRemember the original ancestor without form—\nUnconnected to prajñā or pāramitā.\n\n*For Lay Leader Li*\n\nThe gate of all wonders opens day by day,\nThe house’s ancient wind steep and free of dust.\nThough plain and without distraction,\nIt does not permit the careless to enter.\n\n*For Ren the Laywoman*\n\nShatter the knot of doubt and laugh aloud,\nNo need to wander far in search of answers.\nWhat fills your breast shines bright as the moon—\nWhy seek another’s candle in the night?\n\n*For Daoist Shi*\n\nBeyond things lies the subtle and profound,\nOne side collapses as the other rises.\nLater guests of Penglai Isle\nWalk not the road to E.\n\n*For Lay Leader Chen*\n\nA bend of flowing water, Cloud Creek’s stream,\nDay and night murmurs the mechanism of the Dao.\nHow many come and go, seekers of fame and gain,\nGreedy to watch the waves, blind to the subtle.\n\n*For Daoist Wang*\n\nA straight hook does not hook the moon in waves,\nFine nets cannot scoop clouds from the water’s depths.\nExhausting body and mind, you stray far from the Way—\nRelease all conditions, and transmission may be yours.\n\n*For the Elder of Longxi*\n\nGazing eastward, leaves fly from the trees,\nAutumn’s qi fills the sky, pressing upon one’s robes.\nThe immortal elder has reached the cinnabar heavens,\nLeisurely facing green pines, sipping the azure mist.\n\n*For Laywoman Li the Younger*\n\nTo leave the household, one must learn to be an immortal,\nTo make good karma for long life.\nIf but one thought lingers here,\nA golden lotus will bloom in the Jasper Pool.\n\n*For Clerk Liu*\n\nBeyond the dust of splendor, a guest of Three Mountains,\nA single leaf of a boat upon the bitter sea’s waves.\nCast silk and thread into the deep swells—\nWhich fish among them would take the hook?\n\n*For Daoist Ji and Li the Grinder*\n\nCease thoughts, forget schemes, follow nature,\nNo need to seek the Dao or study Chan.\nA drifting wisp of idle cloud arises—\nIt obstructs the ever-bright heaven within the gourd.\n\n*For Lay Leader Ji of Xiashi County*\n\nIn dreams, one speaks of dreams’ affairs,\nAwakened, one knows the dream is done.\nBrush the stone by South Creek, watch things transform,\nThe waters flow ever eastward as before.\n\n*For Lay Leader of Shanzhou*\n\nThe elixir of spirit is ever grasped in the palm,\nThe mirror of mystery rests only in the heart.\nIlluminating the world’s illusory realms,\nNaturally the body drifts like a wild cloud at ease.\n\n*For Daoist Wang of Jade Creek Hermitage*\n\nWhere in life is there no freedom?\nWhat matter if mountain village or marketplace?\nWhen the inch of heart is free of all fear,\nEven among tigers and wolves, one is at peace.\n\n*For Lay Leader Xia of Fei Village*\n\nMy family’s gate is profoundly mysterious,\nSilent and empty, following nature.\nSpeak not of length or brevity, great or small—\nHungry, eat; weary, sleep.\n\n*Retiring from the Hall of Great Clarity*\n\nI was once a guest on Peach Blossom Peak,\nSuddenly leaving traces among men.\nThough the ancestral court is fine, the cause was early—\nFor now, let the white clouds return to their home mountain.\n\n*Again*\n\nThe wind’s chariot drifts lightly to the ancestral court,\nAuspicious smoke, fragrant grasses, sweet osmanthus.\nThe cause not yet complete, one must turn back—\nReturn to Yi River, to rest beneath brocade curtains.\n\n*Returning to the Longevity Abbey*\n\nSeeing through the ancient mask from the start,\nA thousand wrongs, ten thousand slanders—let them be.\nLight smoke, thin mist vainly obscure,\nThe distant mountains remain unfurrowed.\n\n*Self-Expression*\n\nSever the opening at the head, no sound arises,\nThe dark pearl is gathered into a jeweled vase.\nFrom now on, no boasting of foolishness or wisdom—\nWhen the general is idle, there is great peace.\n\n*Visiting Lord Lao Mountain*\n\nSleeves fluttering in the wind, stepping from the mountain gate,\nTurning back, the green peaks resemble Lord Lao.\nListen to the clear spring converse with the mountain companion—\nIt clearly speaks the entirety of the Five Thousand Characters.\n\n*For Daoist Hu of Zhicha Mountain*\n\nDeep in the tangled mountains, thatched hut is built,\nTen thousand acres of clouds and mist cannot be swept away.\nThe immortal boy gathering herbs in wind-blown sleeves—\nRare fragrance follows as purple mushrooms appear.\n\n*For Lay Leader Zhang*\n\nTo be immortal or Buddha requires effort,\nDust-thoughts and dust-heart must be carefully removed.\nWhen the numinous brightness illuminates the cosmos,\nOnly then do you know the dregs of worldly books.\n\n*For Lady Controller Puchá*\n\nI love the extraordinary scenes of forests and springs,\nHeaven’s wind scatters the fragrance of osmanthus.\nThe traveler, about to depart, turns back again—\nLaughing at the futile busyness of floating life.\n\n*For Lady Puchá’s Longevity*\n\nThe Daoist would also wish her long life,\nYet worldly affairs are dark and unknown.\nA single grain of the immortal elixir—pray take it—\nPine years and crane tallies are nothing strange.\n\n*For Lady Sun, Wife of the Grand Preceptor*\n\nBefore merit and fame are complete, the body ages first,\nWhite hair, a pale face—too late to begin.\nSuddenly awakened, this body is not mine—\nTrue emptiness unmoved, a single cloud drifts.\n\n*For Lay Leader Tian*\n\nRadiant and luminous, this is the heart,\nA single word casts a shadow, creating heavy darkness.\nThe true message lies in pure emptiness—\nDo not seek it among the methods of the many schools.\n\n*For Laywoman Ma*\n\nCreation is endless, naturally so,\nNo need to seek immortality beyond the body.\nWhere the light of heaven shines, worldly passions vanish,\nWhen the precious mirror is bright, the Dao-eye is whole.\n\n*End of the Lower Scroll of the Collected Works of the Old Man of Li Peak*",
      "overlap_context": "\n*For Daoist Friend of Baisha*\n\nRestrain the wildness of apes and horses, lock them tight,\nDo not crave worldly pleasures, heart drunk with desire.\nAwakened, leap beyond the gate of life and death,\nThe true nature of the spirit flows without obstruction.\n*For Daoist Friend Li*\n\nThe immortal’s five-acre Penglai isle,\nFour hundred autumn waves, exceptionally clear.\nSight and sound need not bind ears and eyes,\nOn the path of the subtle and tranquil, level as a plain.\n*For Kou Tian and Jiang Menyou*",
      "start_char": 16653,
      "end_char": 17842,
      "start_sentence": 1065,
      "end_sentence": 1142,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.48592019081116,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\离峰老人集.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}