{
  "source_id": "素女经",
  "source_file": "chunked_daozang\\素女经.json",
  "total_chunks": 15,
  "total_original_chars": 6377,
  "total_translated_chars": 35589,
  "total_translation_time": 183.36060118675232,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\素女经.txt",
    "category": "藏外"
  },
  "full_translation": "**The Classic of Su Nü**\n**Chapter One: The Highest Principle**\n\nThe Yellow Emperor asked Su Nü, saying: *\"My qi is weakened and disharmonious, my heart knows no joy, and my body is constantly beset by fear of peril. What am I to do?\"*\n\nSu Nü replied: *\"The reason all people decline and weaken is invariably due to harm in the Dao of yin-yang union. The woman’s power over the man is like water extinguishing fire. If one knows how to practice this, it is like a cauldron blending the five flavors to make a fine broth. Those who master the Dao of yin and yang will attain the five joys in full; those who do not will forfeit their lives prematurely—how then can they know happiness? How can one not be cautious!\"*\n\nSu Nü continued: *\"There was a woman named Cai Nü who had mastered the arts of the Dao. The king sent Cai Nü to ask Peng Zu about the methods for prolonging life and increasing longevity. Peng Zu said: ‘Cherish essence, nourish the spirit, and consume various medicines—this can lead to long life. Yet without knowledge of the Dao of union, even medicine will be of no benefit. Man and woman complete each other as heaven and earth give rise to one another. Heaven and earth attain the Dao of union, and thus have no end; humans lose the Dao of union, and thus fall into premature decline. If one can avoid the harms of gradual injury and master the arts of yin and yang, this is the Way of immortality.’\"*\n\nCai Nü bowed twice and said: *\"I humbly request to hear the essential teachings.\"*\n\nPeng Zu said: *\"The Dao is quite easy to know, yet people cannot believe in it and put it into practice. Now, the king attends to myriad affairs and governs the realm—he cannot possibly master all the Ways. Fortunately, with many consorts in the rear palace, he ought to know the methods of union. The essentials of these methods lie in frequently uniting with young maidens while refraining from frequent emission of essence, so that the body becomes light and the hundred ailments vanish.\"*\n\nSu Nü said: *\"When engaging with a partner, regard her as mere tile or stone, while seeing yourself as gold or jade. If your essence stirs, swiftly depart from her presence. In union, act as though guiding a galloping horse with rotted reins, or as though standing at the edge of a deep pit lined with blades, ever fearful of falling in. If one can cherish essence, life will not be exhausted.\"*\n\nThe Yellow Emperor asked Su Nü: *\"If one wishes to abstain from union entirely, how should it be done?\"*\nSu Nü replied: *\"This cannot be. Heaven and earth have opening and closing; yin and yang have bestowal and transformation. Humans follow yin and yang in accord with the four seasons. If one wishes to abstain from union, the spirit and qi will not circulate, and yin and yang will become blocked and isolated—how then can one replenish oneself? Practice qi refinement repeatedly, expelling the old and drawing in the new to aid the self. If the jade stem remains unmoved, it will lead to the death of its dwelling, which is why one must engage in union as a form of guiding and pulling. To be aroused yet not emit is called ‘returning essence.’ Returning essence to replenish and benefit—this is how the Way of life becomes manifest.\"*\n\nThe *Su Nü Jing* states:\nThe Yellow Emperor asked: *\"How should one regulate the measures of yin-yang union?\"*\nSu Nü said: *\"The Way of union has its forms and states. For the man, it prevents decline; for the woman, it eliminates the hundred ailments. The heart’s intent is joyful, and one’s strength is fortified. Yet those who do not know how to practice it gradually weaken and decline. To know this Way, one must stabilize the qi, calm the mind, and harmonize the will. When the three qi all arrive, the numinous brightness is unified. Neither cold nor hot, neither hungry nor sated, the body is serene, the form settled, and the nature must be relaxed and unhurried. Insert shallowly and move gently, with entry and withdrawal kept sparse. When the woman is gratified and the man remains vigorous without decline, this is the proper measure.\"*\n\nThe *Xuan Nü Jing* states:\nThe Yellow Emperor asked Xuan Nü: *\"I have received the arts of yin and yang from Su Nü and already possess its methods. I now wish to hear them again to fully grasp the Way.\"*\nXuan Nü said: *\"Between heaven and earth, all movement requires yin and yang. Yang attains transformation through yin, and yin attains circulation through yang. Yin and yang, one after the other, depend on each other to proceed. Thus, when the man is aroused, he becomes firm and strong; when the woman is stirred, she opens and expands. The two qi merge their essences, and their fluids flow and intermingle. The man has eight nodes, and the woman has nine palaces. If these are used without measure, the man will suffer from paralysis and ulcers, and the woman will harm her monthly flow, giving rise to the hundred ailments and diminishing lifespan. But if one knows the Way, there will be joy and strength, life will be extended, and one’s complexion will bloom like a flower.\"*\n\n**Harmonizing the Will (Chapter Four)**\n\n*The Secret Instructions of the Jade Chamber* states:\n\nThe Yellow Emperor asked: \"In the Dao of yin and yang, how should one engage in union?\"\n\nSu Nü replied: \"The Dao of union has its proper methods. The man directs his qi, and the woman dispels her illnesses. With hearts joyful and minds at ease, their qi and strength grow ever stronger. Those who do not know this Dao will suffer decline with each encounter. To understand this Dao, one must first calm the mind and harmonize the will. Spirit and essence unite as one—neither too cold nor too hot, neither too full nor too hungry. Compose the body and settle the intent; let the nature unfold unhurriedly. Enter deeply and move gently, with withdrawals and thrusts sparse. This is the measure to follow—take care never to transgress it. Then the woman will rejoice, and the man will not weaken.\"\n\nIt further states:\n\nThe Yellow Emperor asked: \"Now, when I wish to engage vigorously, my jade stem does not rise. My face flushes with shame, sweat beads like pearls, and though my heart craves desire, I force it with my hand. How can I strengthen it? I wish to hear the Dao.\"\n\nSu Nü replied: \"Your question is common to all. Whenever one wishes to unite with a woman, there is a proper order. First, harmonize the qi, and the jade stem will rise. Follow the Five Constants, focus on the Nine Regions, and observe the woman’s five hues to discern where to press. Gather her overflowing essence, take her fluids into your mouth, and let the refined qi return to replenish the marrow and viscera. Avoid the Seven Harms and practice the Eight Benefits; do not violate the Five Constants, and your body will be preserved. With true qi filling within, what illness will not depart? The organs will be at peace, the skin smooth and moist. With each union, you will rise anew, your strength a hundredfold. Your partner will submit in admiration—what shame could remain?\"\n\n*The Scripture of Xuan Nü* states:\n\nThe Yellow Emperor asked: \"During union, if the woman is not pleased, her body does not stir, and her fluids do not flow—if the jade stem is not firm, small and lacking vigor, what is the reason?\"\n\nXuan Nü replied: \"Yin and yang respond to each other through mutual resonance. Thus, yang cannot delight without yin, nor can yin rise without yang. If the man desires union but the woman is not willing, or the woman desires union but the man is not, their hearts are not in harmony, and their essences do not resonate. If one rushes to mount her or forces himself upon her before affection is shared, the man may seek the woman while she does not desire him, or the woman may seek the man while he does not desire her. But when their emotions align and both hearts are joyful, the woman’s body will tremble in response, and the man’s stem will swell with heat. Pressing the *shu* and *shu* points, her essence flows abundantly. The jade stem moves freely—now slow, now swift—while the jade gate opens and closes. Though firm in action, it does not labor; the strong opponent naturally yields. Drawing in essence and guiding qi, it irrigates the Crimson Chamber. Now I present eight methods, their principles complete: extension and contraction, rising and lowering, advancing and retreating, bending and turning. Examine them carefully, Emperor, and take care not to err.\"\n\n\"Approaching the Throne, Fifth Method\"\nFrom the *Su Nü Jing*:\nThe Yellow Emperor asked, \"Is there a proper method for the union of yin and yang?\"\nSu Nü replied: \"When approaching a woman, first have her lie flat and at ease, bending her two legs. The man positions himself between them, clasping her mouth, sucking her tongue, and caressing her jade stem. He strikes the gates to the east and west, thus for the duration of a meal. Then he slowly enters.\n\nIf the jade stem is thick and large, he enters half a *cun*; if weak and small, he enters one *cun*. Do not move it; slowly withdraw and enter again. This dispels the hundred diseases. Do not let essence leak from the four sides. When the jade stem enters the jade gate, heat and urgency arise naturally, and the woman’s body will begin to sway of its own accord. Once she moves in harmony with the man above, then he may penetrate deeply, and the hundred diseases of both man and woman will vanish.\n\nShallowly strike the lute strings, entering three and a half *cun*. Pressing close, thrust while she keeps her mouth closed—one, two, three, four, five, six, seven, eight, nine—then penetrate deeply, reaching the Kun Stone’s side, moving back and forth. The man’s mouth should meet the woman’s to draw in qi. Proceed through the nine-by-nine Way, and only then conclude.\"\n\n\"The Five Constants, Sixth Method\"\n\n*The Secrets of the Jade Chamber* states:\n\nThe Yellow Emperor asked, \"What are the Five Constants?\"\nThe Plain Girl replied, \"The jade stem truly embodies the Way of the Five Constants. Deeply concealed in its hidden place, it holds fast to its discipline, inwardly cherishing supreme virtue and endlessly bestowing its power. When the jade stem desires to give, this is *ren* (benevolence). That it is hollow within is *yi* (righteousness). That its tip has nodes is *li* (propriety). That it rises when desired and subsides when not is *xin* (trust). That it lowers and lifts in the moment is *zhi* (wisdom). Thus, the perfected person regulates it through the Five Constants. Though benevolence may wish to bestow, if essence is not firm, it must be restrained. Righteousness guards its hollowness, for one must be clear in prohibition to prevent excess. Once the Way of restraint is established, then bestowal may proceed—thus propriety sets its measure. Holding to sincerity, trust becomes manifest, and one may then know the Way of union. Therefore, he who follows the Five Constants shall attain longevity.\"\n\n**The Fifth Sign, Seventh Chapter**\n\n*The Secrets of the Jade Chamber* states:\nThe Yellow Emperor asked, \"How can one know a woman’s pleasure?\"\nThe Plain Girl replied, \"There are five signs and five desires, as well as ten movements, by which to observe her changes and understand their cause. The five signs are as follows:\nFirst, when her face reddens, slowly unite with her.\nSecond, when her breasts harden and her nose perspires, slowly enter her.\nThird, when her throat is dry and she swallows, slowly move within her.\nFourth, when her yin is slick, slowly penetrate deeply.\nFifth, when her hips secrete fluid, slowly draw out.\"\n\n**The Five Desires, Eighth Chapter**\n\nThe Plain Girl said: \"The five desires reveal her responses. The first: when her mind desires union, she holds her breath. The second: when her yin desires it, her nose and mouth open wide. The third: when her essence stirs restlessly, she trembles and clings to the man. The fourth: when her heart is full, sweat soaks her garments. The fifth: when her pleasure is most intense, her body stiffens and her eyes close.\"\n\n**The Ten Movements, Ninth Chapter**\n\nThe Plain Girl said: \"The effects of the ten movements are as follows. The first: when she embraces the man with both hands, she desires their bodies to press close and their yin to align. The second: when she stretches out her arms, she seeks friction above. The third: when her abdomen swells, she desires release. The fourth: when her hips move, her pleasure is keen. The fifth: when she lifts her legs to clasp the man, she desires deep penetration. The sixth: when she crosses her thighs, her inner itch surges. The seventh: when she sways to the side, she desires deep, shifting contact. The eighth: when she raises her body, she urges the man to move with greater vigor. The ninth: when her limbs relax, her body is at ease. The tenth: when her yin fluids flow smoothly, her essence has been released. Observe these signs to know a woman’s pleasure.\"\n\n**Four Arrivals (Chapter Ten)**\nFrom the *Classic of the Dark Lady*, it is said: The Yellow Emperor asked, “If desire for union is strong yet the jade stalk does not rise, may one force its use?” The Dark Lady replied, “One may not. The Way of union requires that the man attain the four arrivals before the woman’s nine qi can be summoned.”\n\nThe Yellow Emperor asked, “What are the four arrivals?”\nThe Dark Lady said, “If the jade stalk does not swell with vigor, harmonious qi has not arrived. If it swells but does not enlarge, muscular qi has not arrived. If it enlarges but does not firm, skeletal qi has not arrived. If it firms but does not grow hot, spirit qi has not arrived. Thus, swelling is the radiance of essence; enlargement is the gateway of essence; firmness is the portal of essence; heat is the threshold of essence. When the four qi arrive and are regulated by the Dao, the mechanism opens without recklessness, and essence is released without leakage.”\n\n**Nine Qi (Chapter Eleven)**\nFrom the *Classic of the Dark Lady*, it is said: The Yellow Emperor asked, “Excellent! How may one recognize the woman’s nine qi?”\nThe Dark Lady replied, “Observe her nine qi to know them. When a woman sighs deeply and swallows her saliva, lung qi has arrived. When she moans and sucks at her partner, heart qi has arrived. When she embraces and clings to him, spleen qi has arrived. When her yin gate becomes smooth and moist, kidney qi has arrived. When she eagerly nips at him, bone qi has arrived. When her feet clasp him, sinew qi has arrived. When she caresses the jade stalk, blood qi has arrived. When she fondles the man’s nipples, flesh qi has arrived. After prolonged union, playing with her true form stirs her intent, and all nine qi arrive. If any fail to arrive, her countenance will show distress; if they do not, one may apply the proper methods to remedy this.”\n\n**Nine Methods (Chapter Twelve)**\n\nThe *Classic of the Dark Lady* states: The Yellow Emperor said, “Of the nine methods you have spoken, I have yet to hear their details. I wish you would expound upon them to clarify their meaning, that they may be stored in the stone chamber and their forms practiced.” The Dark Lady replied, “The nine methods are as follows:\n\n**First: Dragon’s Turn**\nHave the woman lie supine facing upward, while the man lies atop her, his thighs concealed upon the bed. The woman raises her yin to receive the jade stalk. Thrust into her valley’s fruit, then press upward, moving slowly and gently, eight shallow and two deep. Advance as if dead, retreat as if reborn—vigorous and strong. The woman will grow restless with delight, her pleasure like that of a performer. When she reaches closure and steadfastness, all ailments vanish.\n\n**Second: Tiger’s Stride**\nHave the woman lie prone, her buttocks raised and head lowered. The man kneels behind her, embracing her belly, then inserts the jade stalk, piercing her central pole. Ensure deep and close thrusts, pressing forward and back in alternation. Perform five sets of eight, and the rhythm will come naturally. The woman’s yin will open and close, her essence flowing outward. When finished, rest, and no ailments will arise; the man’s vigor will increase.\n\n**Third: Ape’s Grasp**\nHave the woman lie supine while the man lifts her thighs, her knees drawn past her chest, her buttocks and back both raised. Insert the jade stalk, piercing her foul rat. The woman will grow restless and sway, her essence flowing like rain. The man presses deeply, fierce and enraged, until the woman’s pleasure ceases. All ailments will heal of themselves.\n\n**Fourth: Cicada’s Cling**\nHave the woman lie prone, her body stretched straight. The man lies atop her from behind, inserting the jade stalk deeply. Slightly raise her buttocks to strike her red pearl. Perform six sets of nine. The woman will grow restless, her essence flowing, her inner yin pulsing urgently. Outwardly, she will open and relax. Cease when the woman’s pleasure is complete, and the seven harms will be dispelled.\n\n**Fifth: Turtle’s Ascent**\nHave the woman lie supine, bending her knees. The man pushes her legs until her feet reach her breasts, then inserts the jade stalk deeply, piercing the maiden. Adjust depth to strike her fruit. The woman will feel delight, her body swaying and lifting of its own accord. Her essence will flow, so press deeply within. Cease when the woman’s pleasure is complete. Practice this without fail, and vigor will increase a hundredfold.\n\n**Sixth: Phoenix’s Soar**\nHave the woman lie supine, raising her own legs. The man kneels between her thighs, his hands placed on the mat, and inserts the jade stalk deeply, piercing her kun stone. Firm and hot, he draws inward, urging the woman to move. Perform three sets of eight. Their buttocks press urgently together, the woman’s yin opening and relaxing, her essence flowing forth. Cease when the woman’s pleasure is complete, and all ailments will vanish.\n\n**Seventh: Hare’s Sip of Down**\nHave the man lie supine, legs stretched straight. The woman straddles him, her knees outside his thighs, her back toward his feet. She leans forward, head lowered, and inserts the jade stalk, piercing her zither strings. When the woman feels pleasure, her essence will flow like a spring. Joy and harmony will stir her spirit and form. Cease when the woman’s pleasure is complete, and no ailments will arise.\n\n**Eighth: Fish’s Scale Press**\nHave the man lie supine while the woman straddles him, her thighs forward. Insert gently, stopping after a slight entry. Entwine and receive without deepening, like a child at the breast. Let the woman sway alone, ensuring it lasts. When the woman feels pleasure, the man withdraws. This remedies all accumulations.\n\n**Ninth: Crane’s Neck Entwine**\nHave the man sit cross-legged while the woman straddles his thighs, her hands embracing his neck. Insert the jade stalk, piercing her wheat teeth to strike her fruit. The man embraces her buttocks, aiding her sway and lift. The woman will feel pleasure of her own accord, her essence flowing. Cease when the woman’s pleasure is complete, and the seven harms will heal of themselves.”\n\n**Eight Benefits (Chapter Sixteen)**\n\nFrom *The Secret Instructions of the Jade Chamber*, Su Nü states:\n\n“The interplay of yin and yang comprises seven harms and eight benefits.\n\n**First Benefit: Securing Essence**\nHave the woman lie on her side, legs parted, while the man lies beside her. Perform two sets of nine thrusts, then cease. This secures the man’s essence and remedies the woman’s uterine bleeding. Practice twice daily, and recovery comes in fifteen days.\n\n**Second Benefit: Harmonizing Qi**\nHave the woman lie supine with a high pillow, legs fully extended. The man kneels between her thighs and penetrates her, performing three sets of nine thrusts before stopping. This harmonizes qi and cures the woman’s vaginal cold. Practice thrice daily, and recovery comes in twenty days.\n\n**Third Benefit: Nourishing the Organs**\nHave the woman lie on her side, legs drawn up, while the man lies horizontally and penetrates her from behind. Perform four sets of nine thrusts, then cease. This harmonizes qi and cures the woman’s vaginal cold. Practice four times daily, and recovery comes in twenty days.\n\n**Fourth Benefit: Strengthening the Bones**\nHave the woman lie on her side, left knee bent and right leg extended. The man leans over her and penetrates, performing five sets of nine thrusts before stopping. This harmonizes the joints and remedies the woman’s blocked menstruation. Practice five times daily, and recovery comes in ten days.\n\n**Fifth Benefit: Regulating the Pulse**\nHave the woman lie on her side, right leg bent and left leg extended. The man positions himself on the ground and penetrates her, performing six sets of nine thrusts before stopping. This unblocks the pulse and cures the woman’s vaginal laxity. Practice six times daily, and recovery comes in twenty days.\n\n**Sixth Benefit: Storing Blood**\nHave the man lie supine while the woman, facing his feet, kneels above him and inserts deeply. She performs seven sets of nine thrusts before stopping. This strengthens the man’s vigor and remedies the woman’s menstrual irregularities. Practice seven times daily, and recovery comes in ten days.\n\n**Seventh Benefit: Enriching Fluids**\nHave the woman lie prone, lifting her buttocks, while the man mounts her from above. Perform eight sets of nine thrusts, then cease. This fortifies the bones.\n\n**Eighth Benefit: Cultivating the Dao-Body**\nHave the woman lie supine, legs bent with feet pressing near her buttocks. The man, using his thighs, penetrates her and performs nine sets of nine thrusts before stopping. This solidifies the bones and cures the woman’s vaginal odor. Practice nine times daily, and recovery comes in nine days.”\n\n**Seven Harms (Chapter Seventeen)**\n\nFrom *The Jade Chamber Secrets*, Su Nü states:\n\n**First Harm: Depletion of Qi**\nDepletion of qi occurs when desire is absent yet one forces the act, causing sweat to flow and qi to diminish, leading to heart heat and dimmed vision. The remedy: have the woman lie supine while the man lifts her thighs and deeply penetrates. Let the woman move herself until her essence is released, but the man must not reach climax. Practice nine times daily, and recovery comes in ten days.\n\n**Second Harm: Spillage of Essence**\nSpillage of essence occurs when desire is excessive and one engages before yin and yang harmonize, causing essence to overflow midway. Coupling while drunk or overfed disrupts breath and harms the lungs, resulting in counterflow qi, wasting-thirst, mood swings, sorrow, dry mouth, body heat, and difficulty standing. The remedy: have the woman lie supine, bending her knees to flank the man. The man penetrates shallowly, inserting only an inch and a half of the jade stem, then lets the woman move herself until her essence is released, while the man refrains from climax. Practice nine times daily, and recovery comes in ten days.\n\n**Third Harm: Disorder of the Vessels**\nDisorder of the vessels occurs when the yang is not firm yet one forces the act, draining essence midway and depleting qi. Coupling after a full meal harms the spleen, causing indigestion and impotence with loss of essence. The remedy: have the woman lie supine, hooking the man’s buttocks with her feet. The man positions himself on the mat and penetrates, letting the woman move herself until her essence is released, while the man refrains from climax. Practice nine times daily, and recovery comes in ten days.\n\n**Fourth Harm: Leakage of Qi**\nLeakage of qi occurs when one couples while fatigued and sweating, before the sweat has dried, leading to abdominal heat and chapped lips. The remedy: have the man lie supine while the woman straddles him, facing his feet and bracing herself on the mat. She inserts the jade stem shallowly and moves herself until her essence is released, while the man refrains from climax. Practice nine times daily, and recovery comes in ten days.\n\n**Fifth Harm: Injury to the Mechanism**\nInjury to the mechanism occurs when one couples immediately after urinating or defecating, before the body has settled, harming the liver. Hasty or violent coupling, with reckless pacing, strains the sinews and bones, causing blurred vision, abscesses, and ulcers. Prolonged harm leads to hemiplegia and impotence. The remedy: have the man lie supine while the woman straddles his thighs, crouching forward. He slowly penetrates without letting the woman move herself. When her essence is released, the man refrains from climax. Practice nine times daily, and recovery comes in ten days.\n\n**Sixth Harm: Hundredfold Obstruction**\nHundredfold obstruction occurs from excessive indulgence, lack of restraint, and reckless coupling that exhausts essence and qi. Forcing ejaculation when essence is depleted prevents its release, giving rise to a hundred illnesses, wasting-thirst, and dimmed vision. The remedy: have the man lie supine while the woman straddles him, leaning forward to brace herself on the mat. She inserts the jade stem and moves herself until her essence is released, while the man refrains from climax. Practice nine times daily, and recovery comes in ten days.\n\n**Seventh Harm: Exhaustion of Blood**\nExhaustion of blood occurs when one couples after strenuous labor or rapid movement, while still sweating. Lying prone and thrusting deeply with violent haste during climax triggers severe illness, continuous discharge, blood depletion, and qi exhaustion. This causes flaccid skin, taut flesh, penile pain, scrotal dampness, and essence transforming into blood. The remedy: have the woman lie supine, raising her buttocks high and stretching her thighs apart. The man kneels between them and deeply penetrates, letting the woman move herself until her essence is released, while the man refrains from climax. Practice nine times daily, and recovery comes in ten days.\n\n**Eighteenth Chapter: Returning Essence**\n\n**The Jade Chamber Secret Teachings** states:\nThe Yellow Emperor asked, “I wish to know the effects of movement without release.”\nThe Plain Girl replied:\n“One movement without release strengthens qi and vigor;\nTwo movements without release sharpen hearing and vision;\nThree movements without release dispel illness;\nFour movements without release stabilize spirit and might;\nFive movements without release replenish blood and vessels;\nSix movements without release fortify the waist and back;\nSeven movements without release enhance the buttocks and thighs;\nEight movements without release illuminate the body;\nNine movements without release extend lifespan without end;\nTen movements without release unite with the divine.”\n\n**Nineteenth Chapter: Release and Ejaculation**\n**The Jade Chamber Secret Teachings** states:\nThe Yellow Emperor asked the Plain Girl, “The essential Dao teaches not to lose essence, and one should cherish the fluids. Yet if one seeks offspring, how can ejaculation be permitted?”\nThe Plain Girl replied, “People vary in strength, and age differs in vitality. Each should follow their own qi and vigor, avoiding forced haste, for haste brings harm.\nThus, at fifteen, the robust may ejaculate twice daily, the frail once daily;\nAt twenty, the robust twice daily, the weak once daily;\nAt thirty, the robust once daily, the feeble once every two days;\nAt forty, the robust once every three days, the depleted once every four days;\nAt fifty, the robust once every five days, the weak once every ten days;\nAt sixty, the robust once every eleven days, the weak once every twenty days;\nAt seventy, the robust may ejaculate once every thirty days, the weak should not release.”\n\n**Twentieth Chapter: Treating Injuries**\n\nThe *Secret Essentials of the Jade Chamber* states: The Plain Girl asked, “How can one gauge the rise and decline of a man’s vigor?”\n\nPeng Zu replied, “When yang flourishes and qi is abundant, the jade stalk becomes hot, and the yang essence thickens and congeals. There are five signs of decline:\nFirst, if essence spills out, qi is injured;\nSecond, if essence is thin and scant, the flesh is injured;\nThird, if essence changes and turns foul, the sinews are injured;\nFourth, if essence flows out without forceful emission, the bones are injured;\nFifth, if the yin withers and fails to rise, the body itself is injured.\nAll these injuries stem from hasty and violent ejaculation rather than gradual union.\n\nThe remedy is to engage in intercourse without ejaculating. Within a hundred days, one’s qi and strength will surely increase a hundredfold.”\n\n**Twenty-First Chapter: Seeking Offspring**\n\nThe *Secret Essentials of the Jade Chamber* states: The Plain Girl said, “The method for seeking offspring follows a constant pattern. Calm the mind, dispel distractions, and stabilize one’s resolve. Observe fasting and abstinence. On the third night after a woman’s menstrual flow, after midnight and before cock’s crow, play and arouse her so that her desire peaks, then proceed to unite. Follow the proper way, share in her pleasure, withdraw, and ejaculate. Deposit the essence half an inch from the jade gate—do not surpass the womb. As the *Thousand Wings* states, do not go too deep, only as far as the wheat-teeth. If too far, it will pass the child’s gate and fail to enter the child’s chamber. If one adheres to this Daoist art, the child will be virtuous, and both parents will enjoy longevity.”\n\nIt further states: The Plain Girl said, “When a man and woman unite in yin and yang, they must avoid taboos and always ride the qi of life. Then there is no one who will not live long. But if both husband and wife are aged, even if they conceive and bear a child, the child will not live long.”\n\n**Twenty-Second Chapter: The Excellent Woman**\n\nThe *Great Purity Scripture* states: The Yellow Emperor asked, “What are the signs when assessing a woman for union?” The Plain Girl replied, “When assessing a woman, she should be naturally gentle and compliant, her qi and voice soft and flowing. Her hair is black as silk, her flesh tender, her bones fine. She is neither too tall nor too short, neither too large nor too small. Her jade gate is high-set, with no hair above the yin, and she abounds in essence-fluid. She should be above twenty-five and under thirty, and never having borne a child. During union, her essence-fluid flows and ripples, her body sways and trembles, unable to steady herself. Sweat streams from her in all directions, and she follows her partner’s every movement. Even if a man does not follow the proper method, uniting with such a woman will not harm him.”\n\n**Taboos in the Bedchamber:**\nAvoid union on the dark of the moon and the new moon, the first and last quarters, the full moon, the days of the six *dings* and six *bings*, inauspicious days, the twenty-eighth day of the lunar month, solar and lunar eclipses, days of fierce wind and heavy rain, earthquakes, thunder and lightning, extreme cold or heat, and the days when the seasons shift in spring, autumn, winter, and summer. Also avoid the five days before and after these transitions. Do not engage in yin-yang union.\n\n**Strictly Forbidden on One’s Natal Year and Age:**\nAfter the Summer Solstice, the days of *bingzi* and *dingchou*; after the Winter Solstice, the days of *gengshen* and *xinyou*. Also forbidden are the days after newly washing one’s hair, after a long journey, when fatigued, or when experiencing great joy or anger. One must never recklessly expend essence in the years when a man’s decline begins.\n\nThe Plain Girl’s treatise states: “On the sixteenth day of the fifth lunar month, the day when Heaven and Earth unite as female and male, one must not engage in the bedchamber arts. Violating this will bring death within three years. How can this be known?”\n\n\"Simply take a foot of new cloth and hang it on the eastern wall this evening. The next day, examine it—there will surely be a blood-like hue. This must be strictly avoided.\"\n\nCai Nü asked: \"Why does the illness of ghostly intercourse occur?\"\n\nPeng Zu replied: \"It arises from the lack of yin-yang union and deep-seated desires. Then, spectral entities assume forms to engage in intercourse. The way they traffic with humans surpasses mortal coupling. If one lingers with them, they become bewitched, concealing it in shame and refusing to tell others, believing it to be pleasurable. Thus, they die alone, and none know the cause.\n\nIf afflicted by this malady, the cure is this: have a woman lie with a man, but the man must not release his essence. They must persist day and night without rest; the afflicted will recover within seven days if exhausted. If the body is too weary to sustain this alone, simply press deeply without movement—this is also effective. Left untreated, it will kill within a few years.\n\nTo verify this truth: during spring or autumn, enter the depths of mountains or marshes, free of all distractions. Gaze into the distance and focus solely on the union of yin and yang. After three days and nights, the body will suddenly grow cold and feverish, the heart restless, the eyes dizzy. Men will see women, and women will see men, compelled to engage in intercourse—more exquisite than with mortals. Yet this will sicken them, and the illness will be difficult to cure. The pent-up qi of longing is overpowered by the malevolent force.\n\nFuture generations will surely encounter this. If a virgin of high status suffers from this and must not engage in union, treat her thus: burn several taels of sulfur to fumigate beneath her yin, and have her ingest a *fangcun* spoonful of deer antler powder—she will recover. She will see the ghost weep and depart. Another method: take a *fangcun* spoonful of deer antler powder three times daily until cured.\"\n\nThe Handmaid inquired, “I have heard of the matters of union, but dare I ask: which medicinal substances taken as food are also effective?”\n\nPeng Zu replied, “To make a man robust and free from aging, to engage in the bedchamber without exhausting his qi and strength, and to preserve his complexion—nothing surpasses elk antler. The method: take ten taels of elk antler, scrape it into powder, and each time combine it with eight *jiao* of processed aconite and one piece of raw aconite root. Ingest a *fangcun* spoonful of this mixture three times daily—highly efficacious. Alternatively, roast elk antler until slightly yellow and take it alone, which also prevents aging. However, its effects are slower and not as potent as when combined with aconite. After twenty days of ingestion, one will feel greatly invigorated. Another method: take equal parts of *Ling* poria from Longxi, sifted and blended, and ingest a *fangcun* spoonful three times daily. This grants longevity and preserves vigor in the bedchamber.”\n\nThe Yellow Emperor asked the Plain Girl, who replied, “When a woman reaches twenty-eight or twenty-nine—or twenty-three or twenty-four—her yin qi flourishes, and she desires a man, unable to restrain herself. Food and drink lose their savor, her hundred vessels stir within her body, and when her essence-vessel is full, her fluids seep forth, soiling her garments. Within a woman’s yin, there are worms resembling horse tails, three *fen* in length. Those with red heads cause distress, while those with black heads produce foam. The treatment: fashion a jade stalk from dough, its length and girth as desired, wrap it in soy paste and two layers of silk, and insert it into her yin. The worms will cling to it and emerge; reinsert it as needed. Once she obtains a husband, those with many worms may have thirty, while others may have twenty.”",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "《素女经》 至理第一 黄帝问素女曰：“吾气衰而不和，心内不乐，身常恐危，将如之何？ ”素女曰：“凡人之所以衰微者，皆伤于阴阳交接之道尔。 夫女之胜男，犹水之灭火。 知行之，如釜鼎能和五味，以成羹霍。 能知阴阳之道，悉成五乐； 不知之者，身命将夭，何得欢乐？ 可不慎哉！ 素女曰：“有采女者，妙得道术。 王使采女问：彭祖延年益寿之法，彭祖曰：“爱精养神，服食众药，可得长生。 然不知交接之道，虽服药无益也。 男女相成，犹天地相生也。 天地得交会之道，故无终竟之限。 人失交接之道，故有夭折之渐，能避渐伤之事而得阴阳之术，则不死之道也。 ” 采女再拜曰：“愿闻要教。",
      "translated_text": "**The Classic of Su Nü**\n**Chapter One: The Highest Principle**\n\nThe Yellow Emperor asked Su Nü, saying: *\"My qi is weakened and disharmonious, my heart knows no joy, and my body is constantly beset by fear of peril. What am I to do?\"*\n\nSu Nü replied: *\"The reason all people decline and weaken is invariably due to harm in the Dao of yin-yang union. The woman’s power over the man is like water extinguishing fire. If one knows how to practice this, it is like a cauldron blending the five flavors to make a fine broth. Those who master the Dao of yin and yang will attain the five joys in full; those who do not will forfeit their lives prematurely—how then can they know happiness? How can one not be cautious!\"*\n\nSu Nü continued: *\"There was a woman named Cai Nü who had mastered the arts of the Dao. The king sent Cai Nü to ask Peng Zu about the methods for prolonging life and increasing longevity. Peng Zu said: ‘Cherish essence, nourish the spirit, and consume various medicines—this can lead to long life. Yet without knowledge of the Dao of union, even medicine will be of no benefit. Man and woman complete each other as heaven and earth give rise to one another. Heaven and earth attain the Dao of union, and thus have no end; humans lose the Dao of union, and thus fall into premature decline. If one can avoid the harms of gradual injury and master the arts of yin and yang, this is the Way of immortality.’\"*\n\nCai Nü bowed twice and said: *\"I humbly request to hear the essential teachings.\"*",
      "overlap_context": "",
      "start_char": 1,
      "end_char": 283,
      "start_sentence": 0,
      "end_sentence": 16,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.690396070480347,
      "metadata": {
        "source_file": "dao\\藏外\\素女经.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "”彭祖曰：“道甚易知，人不能信而行之耳。 今君王御万机，治天下，必不能备为众道也。 幸多后宫，宜知交接之法，法之要者，在於多御少女而莫数泻精，使人身轻，百病消除也。 ” 素女曰：“御敌，当视敌如瓦石，自视如金玉，若其精动，当疾去其乡。 御女当如朽索御奔马，如临深坑下有刃，恐坠其中。 若能爱精，命亦不穷也。 ” 黄帝问素女曰：“今欲长不交接，为之奈何？ ”素女曰：“不可。 天地有开阖，阴阳有施化。 人法阴阳随四时，今欲不交接，神气不宣布，阴阳闭隔，何以自补？ 练气数行，去故纳新，以自助也。 玉茎不动，则辟死其舍，所以常行以当导引也。 能动而不施者，所谓还精。 还精补益，生道乃着。 ” 《素女经》云：黄帝曰：“夫阴阳交接节度，为之奈何？ ”素女曰：“交接之道，故有形状，男致不衰，女除百病，心意娱乐，气力强。 然不知行者，渐以衰损。 欲知其道，在於定气、安心、和志。 三气皆至，神明统归，不寒不热，不饥不饱，宁身定体，性必舒迟，浅内徐动，出入欲希。 女快意，男盛不衰，以此为节。 ” 《玄女经》云：黄帝问玄女曰：“吾受素女阴阳之术，自有法矣。 愿复命之，以悉其道。 ”玄女曰：“天地之间，动须阴阳，阳得阴而化，阴得阳而通。 一阴一阳，相须而行。 故男感坚强，女动辟张，二气交精，流液相通。 男有八节，女有九宫，用之失度，男发瘫疽，女害月经，百病生长，寿命消亡。 能知其道，乐而且强，寿即增延，色如华英。 ”",
      "translated_text": "Peng Zu said: *\"The Dao is quite easy to know, yet people cannot believe in it and put it into practice. Now, the king attends to myriad affairs and governs the realm—he cannot possibly master all the Ways. Fortunately, with many consorts in the rear palace, he ought to know the methods of union. The essentials of these methods lie in frequently uniting with young maidens while refraining from frequent emission of essence, so that the body becomes light and the hundred ailments vanish.\"*\n\nSu Nü said: *\"When engaging with a partner, regard her as mere tile or stone, while seeing yourself as gold or jade. If your essence stirs, swiftly depart from her presence. In union, act as though guiding a galloping horse with rotted reins, or as though standing at the edge of a deep pit lined with blades, ever fearful of falling in. If one can cherish essence, life will not be exhausted.\"*\n\nThe Yellow Emperor asked Su Nü: *\"If one wishes to abstain from union entirely, how should it be done?\"*\nSu Nü replied: *\"This cannot be. Heaven and earth have opening and closing; yin and yang have bestowal and transformation. Humans follow yin and yang in accord with the four seasons. If one wishes to abstain from union, the spirit and qi will not circulate, and yin and yang will become blocked and isolated—how then can one replenish oneself? Practice qi refinement repeatedly, expelling the old and drawing in the new to aid the self. If the jade stem remains unmoved, it will lead to the death of its dwelling, which is why one must engage in union as a form of guiding and pulling. To be aroused yet not emit is called ‘returning essence.’ Returning essence to replenish and benefit—this is how the Way of life becomes manifest.\"*\n\nThe *Su Nü Jing* states:\nThe Yellow Emperor asked: *\"How should one regulate the measures of yin-yang union?\"*\nSu Nü said: *\"The Way of union has its forms and states. For the man, it prevents decline; for the woman, it eliminates the hundred ailments. The heart’s intent is joyful, and one’s strength is fortified. Yet those who do not know how to practice it gradually weaken and decline. To know this Way, one must stabilize the qi, calm the mind, and harmonize the will. When the three qi all arrive, the numinous brightness is unified. Neither cold nor hot, neither hungry nor sated, the body is serene, the form settled, and the nature must be relaxed and unhurried. Insert shallowly and move gently, with entry and withdrawal kept sparse. When the woman is gratified and the man remains vigorous without decline, this is the proper measure.\"*\n\nThe *Xuan Nü Jing* states:\nThe Yellow Emperor asked Xuan Nü: *\"I have received the arts of yin and yang from Su Nü and already possess its methods. I now wish to hear them again to fully grasp the Way.\"*\nXuan Nü said: *\"Between heaven and earth, all movement requires yin and yang. Yang attains transformation through yin, and yin attains circulation through yang. Yin and yang, one after the other, depend on each other to proceed. Thus, when the man is aroused, he becomes firm and strong; when the woman is stirred, she opens and expands. The two qi merge their essences, and their fluids flow and intermingle. The man has eight nodes, and the woman has nine palaces. If these are used without measure, the man will suffer from paralysis and ulcers, and the woman will harm her monthly flow, giving rise to the hundred ailments and diminishing lifespan. But if one knows the Way, there will be joy and strength, life will be extended, and one’s complexion will bloom like a flower.\"*",
      "overlap_context": "g life. Yet without knowledge of the Dao of union, even medicine will be of no benefit. Man and woman complete each other as heaven and earth give rise to one another. Heaven and earth attain the Dao of union, and thus have no end; humans lose the Dao of union, and thus fall into premature decline. If one can avoid the harms of gradual injury and master the arts of yin and yang, this is the Way of immortality.’\"*\n\nCai Nü bowed twice and said: *\"I humbly request to hear the essential teachings.\"*",
      "start_char": 283,
      "end_char": 874,
      "start_sentence": 17,
      "end_sentence": 48,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.98685097694397,
      "metadata": {
        "source_file": "dao\\藏外\\素女经.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "和志第四 《玉房秘诀》云：黄帝曰：“夫阴阳之道，交接奈何？ ”素女曰：“交接之道，固有行状，男以致气，女以除病，心意娱乐，气力益壮。 不知道者，则侵以衰。 欲知其道，在安心、和志。 精神统归，不寒不暑，不饱不饥，定身正意，性必舒迟，深内徐动，出入欲希。 以是为节，慎无敢违，女即欢喜，男则不衰。 ” 又云：黄帝曰：“今欲强交接，玉茎不起，面惭意羞，汗如珠子，心情贪欲，强助以手，何以强之，愿闻其道。 ”素女曰：“帝之所问，众人所有。 凡欲接女，固有经纪，必先和气，玉茎乃起。 顺其五常，存感九部，女有五色，审所足扣。 采其溢精，取液於口，精气还化，填满髓脏。 避七损之禁，行八益之道，毋逆五常，身乃可保。 正气内充，何疾不去？ 府藏安宁，光滑润理，每接即起，气力百倍，敌人宾服，何惭之有？ ” 《玄女经》云：黄帝曰：“交接之时，女或不悦，其质不动，其液不出。 玉茎不强，小而不势，何以尔也？ ”玄女曰：“阴阳者，相感而应耳。 故阳不得阴则不喜，阴不得阳则不起，男欲接而女不乐，女欲接而男不欲，二心不和，精气不感，加以卒上暴下，爱乐未施。 男欲求女，女欲求男，情意合同，俱有悦心，故女质振感，男茎盛男热，营扣俞鼠，精液流溢，玉茎施纵，乍缓乍急，玉户开翕，或实作而不劳，强敌自佚，吸精引气，灌溉朱室。 今陈八事，其法备悉，伸缩俯仰，前却屈折。 帝审行之，慎莫违失。",
      "translated_text": "**Harmonizing the Will (Chapter Four)**\n\n*The Secret Instructions of the Jade Chamber* states:\n\nThe Yellow Emperor asked: \"In the Dao of yin and yang, how should one engage in union?\"\n\nSu Nü replied: \"The Dao of union has its proper methods. The man directs his qi, and the woman dispels her illnesses. With hearts joyful and minds at ease, their qi and strength grow ever stronger. Those who do not know this Dao will suffer decline with each encounter. To understand this Dao, one must first calm the mind and harmonize the will. Spirit and essence unite as one—neither too cold nor too hot, neither too full nor too hungry. Compose the body and settle the intent; let the nature unfold unhurriedly. Enter deeply and move gently, with withdrawals and thrusts sparse. This is the measure to follow—take care never to transgress it. Then the woman will rejoice, and the man will not weaken.\"\n\nIt further states:\n\nThe Yellow Emperor asked: \"Now, when I wish to engage vigorously, my jade stem does not rise. My face flushes with shame, sweat beads like pearls, and though my heart craves desire, I force it with my hand. How can I strengthen it? I wish to hear the Dao.\"\n\nSu Nü replied: \"Your question is common to all. Whenever one wishes to unite with a woman, there is a proper order. First, harmonize the qi, and the jade stem will rise. Follow the Five Constants, focus on the Nine Regions, and observe the woman’s five hues to discern where to press. Gather her overflowing essence, take her fluids into your mouth, and let the refined qi return to replenish the marrow and viscera. Avoid the Seven Harms and practice the Eight Benefits; do not violate the Five Constants, and your body will be preserved. With true qi filling within, what illness will not depart? The organs will be at peace, the skin smooth and moist. With each union, you will rise anew, your strength a hundredfold. Your partner will submit in admiration—what shame could remain?\"\n\n*The Scripture of Xuan Nü* states:\n\nThe Yellow Emperor asked: \"During union, if the woman is not pleased, her body does not stir, and her fluids do not flow—if the jade stem is not firm, small and lacking vigor, what is the reason?\"\n\nXuan Nü replied: \"Yin and yang respond to each other through mutual resonance. Thus, yang cannot delight without yin, nor can yin rise without yang. If the man desires union but the woman is not willing, or the woman desires union but the man is not, their hearts are not in harmony, and their essences do not resonate. If one rushes to mount her or forces himself upon her before affection is shared, the man may seek the woman while she does not desire him, or the woman may seek the man while he does not desire her. But when their emotions align and both hearts are joyful, the woman’s body will tremble in response, and the man’s stem will swell with heat. Pressing the *shu* and *shu* points, her essence flows abundantly. The jade stem moves freely—now slow, now swift—while the jade gate opens and closes. Though firm in action, it does not labor; the strong opponent naturally yields. Drawing in essence and guiding qi, it irrigates the Crimson Chamber. Now I present eight methods, their principles complete: extension and contraction, rising and lowering, advancing and retreating, bending and turning. Examine them carefully, Emperor, and take care not to err.\"",
      "overlap_context": "rong; when the woman is stirred, she opens and expands. The two qi merge their essences, and their fluids flow and intermingle. The man has eight nodes, and the woman has nine palaces. If these are used without measure, the man will suffer from paralysis and ulcers, and the woman will harm her monthly flow, giving rise to the hundred ailments and diminishing lifespan. But if one knows the Way, there will be joy and strength, life will be extended, and one’s complexion will bloom like a flower.\"*",
      "start_char": 877,
      "end_char": 1448,
      "start_sentence": 49,
      "end_sentence": 72,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.926774740219116,
      "metadata": {
        "source_file": "dao\\藏外\\素女经.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "” 临御第五 《素女经》云：黄帝曰：“阴阳贵有法乎？ ”素女曰：“临御女时，先令妇人放平安身，屈两脚，男人其间，衔其口，吮其舌，拊搏其玉茎，击其门户东西两傍，如是食顷，徐徐内入。 玉茎肥大者内半寸，弱小者入一寸，勿摇动之，徐出更入，除百病。 勿令四傍泄出，玉茎入玉门，自然生热且急，妇人身当自动摇，上与男相得，然后深之，男女百病消灭。 浅刺琴弦，入三寸半，当闭口刺之，一二三四五六七八九，因深之，至昆石旁往来，口当妇人口而吸气，行九九之道讫，乃如此。 ” 五常第六",
      "translated_text": "\"Approaching the Throne, Fifth Method\"\nFrom the *Su Nü Jing*:\nThe Yellow Emperor asked, \"Is there a proper method for the union of yin and yang?\"\nSu Nü replied: \"When approaching a woman, first have her lie flat and at ease, bending her two legs. The man positions himself between them, clasping her mouth, sucking her tongue, and caressing her jade stem. He strikes the gates to the east and west, thus for the duration of a meal. Then he slowly enters.\n\nIf the jade stem is thick and large, he enters half a *cun*; if weak and small, he enters one *cun*. Do not move it; slowly withdraw and enter again. This dispels the hundred diseases. Do not let essence leak from the four sides. When the jade stem enters the jade gate, heat and urgency arise naturally, and the woman’s body will begin to sway of its own accord. Once she moves in harmony with the man above, then he may penetrate deeply, and the hundred diseases of both man and woman will vanish.\n\nShallowly strike the lute strings, entering three and a half *cun*. Pressing close, thrust while she keeps her mouth closed—one, two, three, four, five, six, seven, eight, nine—then penetrate deeply, reaching the Kun Stone’s side, moving back and forth. The man’s mouth should meet the woman’s to draw in qi. Proceed through the nine-by-nine Way, and only then conclude.\"\n\n\"The Five Constants, Sixth Method\"",
      "overlap_context": "e *shu* and *shu* points, her essence flows abundantly. The jade stem moves freely—now slow, now swift—while the jade gate opens and closes. Though firm in action, it does not labor; the strong opponent naturally yields. Drawing in essence and guiding qi, it irrigates the Crimson Chamber. Now I present eight methods, their principles complete: extension and contraction, rising and lowering, advancing and retreating, bending and turning. Examine them carefully, Emperor, and take care not to err.\"",
      "start_char": 1448,
      "end_char": 1689,
      "start_sentence": 73,
      "end_sentence": 81,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.321592330932617,
      "metadata": {
        "source_file": "dao\\藏外\\素女经.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "《玉房秘诀》云：黄帝曰：“何谓五常？ ”素女曰：“玉茎实有五常之道，深居隐处，执节自守，内怀至德，施行无己。 夫玉茎意欲施与者，仁也； 中有空者，义也； 端有节者，礼也； 意欲即起，不欲即止者，信也； 临事低仰者，智也。 是故真人因五常而节之，仁虽欲施予，精苦不固。 义守其空者，明当禁，使无得多。 实既禁之道矣，又当施予，故礼为之节矣。 执诚持之，信既着矣，即当知交接之道。 故能从五常，身乃寿也。 ” 五征第七 《玉房秘诀》云：黄帝曰：“何以知女之快也？ ”素女曰：“有五征五欲，又有十动，以观其变，而知其故。 夫五征之候：一曰面赤，则徐徐合之； 二曰乳坚鼻汗，则徐徐内之； 三曰嗌干咽唾，则徐徐摇之； 四曰阴滑，则徐徐深之； 五曰尻传液，徐徐引之。 ” 五欲第八",
      "translated_text": "*The Secrets of the Jade Chamber* states:\n\nThe Yellow Emperor asked, \"What are the Five Constants?\"\nThe Plain Girl replied, \"The jade stem truly embodies the Way of the Five Constants. Deeply concealed in its hidden place, it holds fast to its discipline, inwardly cherishing supreme virtue and endlessly bestowing its power. When the jade stem desires to give, this is *ren* (benevolence). That it is hollow within is *yi* (righteousness). That its tip has nodes is *li* (propriety). That it rises when desired and subsides when not is *xin* (trust). That it lowers and lifts in the moment is *zhi* (wisdom). Thus, the perfected person regulates it through the Five Constants. Though benevolence may wish to bestow, if essence is not firm, it must be restrained. Righteousness guards its hollowness, for one must be clear in prohibition to prevent excess. Once the Way of restraint is established, then bestowal may proceed—thus propriety sets its measure. Holding to sincerity, trust becomes manifest, and one may then know the Way of union. Therefore, he who follows the Five Constants shall attain longevity.\"\n\n**The Fifth Sign, Seventh Chapter**\n\n*The Secrets of the Jade Chamber* states:\nThe Yellow Emperor asked, \"How can one know a woman’s pleasure?\"\nThe Plain Girl replied, \"There are five signs and five desires, as well as ten movements, by which to observe her changes and understand their cause. The five signs are as follows:\nFirst, when her face reddens, slowly unite with her.\nSecond, when her breasts harden and her nose perspires, slowly enter her.\nThird, when her throat is dry and she swallows, slowly move within her.\nFourth, when her yin is slick, slowly penetrate deeply.\nFifth, when her hips secrete fluid, slowly draw out.\"\n\n**The Five Desires, Eighth Chapter**",
      "overlap_context": ", then he may penetrate deeply, and the hundred diseases of both man and woman will vanish.\n\nShallowly strike the lute strings, entering three and a half *cun*. Pressing close, thrust while she keeps her mouth closed—one, two, three, four, five, six, seven, eight, nine—then penetrate deeply, reaching the Kun Stone’s side, moving back and forth. The man’s mouth should meet the woman’s to draw in qi. Proceed through the nine-by-nine Way, and only then conclude.\"\n\n\"The Five Constants, Sixth Method\"",
      "start_char": 1690,
      "end_char": 2021,
      "start_sentence": 82,
      "end_sentence": 104,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.142087697982788,
      "metadata": {
        "source_file": "dao\\藏外\\素女经.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "素女曰：“五欲者，以知其应：一曰意欲得之，则屏息屏气； 二曰阴欲得之，则鼻口两张； 三曰精欲烦者，则振掉而抱男； 四曰心欲满者，则汗流湿衣裳； 五曰其快欲之甚者，身直目眠。 ” 十动第九 素女曰：“十动之效：一曰两手抱人者，欲体相薄阴相当也； 二曰伸其两臂者，切磨其上方也； 三曰张腹者，欲其泄也； 四曰尻动者，快善也； 五曰举两脚拘人者，欲其深也； 六曰交其两股者，内痒滔滔也； 七曰侧摇者，欲深切左右也； 八曰举身者，迫人摇乐甚也； 九曰身巾纵者，支体快也； 十曰阴液滑者，精已泄也。 见其效以知女之快也。 ”",
      "translated_text": "The Plain Girl said: \"The five desires reveal her responses. The first: when her mind desires union, she holds her breath. The second: when her yin desires it, her nose and mouth open wide. The third: when her essence stirs restlessly, she trembles and clings to the man. The fourth: when her heart is full, sweat soaks her garments. The fifth: when her pleasure is most intense, her body stiffens and her eyes close.\"\n\n**The Ten Movements, Ninth Chapter**\n\nThe Plain Girl said: \"The effects of the ten movements are as follows. The first: when she embraces the man with both hands, she desires their bodies to press close and their yin to align. The second: when she stretches out her arms, she seeks friction above. The third: when her abdomen swells, she desires release. The fourth: when her hips move, her pleasure is keen. The fifth: when she lifts her legs to clasp the man, she desires deep penetration. The sixth: when she crosses her thighs, her inner itch surges. The seventh: when she sways to the side, she desires deep, shifting contact. The eighth: when she raises her body, she urges the man to move with greater vigor. The ninth: when her limbs relax, her body is at ease. The tenth: when her yin fluids flow smoothly, her essence has been released. Observe these signs to know a woman’s pleasure.\"",
      "overlap_context": "ere are five signs and five desires, as well as ten movements, by which to observe her changes and understand their cause. The five signs are as follows:\nFirst, when her face reddens, slowly unite with her.\nSecond, when her breasts harden and her nose perspires, slowly enter her.\nThird, when her throat is dry and she swallows, slowly move within her.\nFourth, when her yin is slick, slowly penetrate deeply.\nFifth, when her hips secrete fluid, slowly draw out.\"\n\n**The Five Desires, Eighth Chapter**",
      "start_char": 2022,
      "end_char": 2274,
      "start_sentence": 105,
      "end_sentence": 123,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.655054807662964,
      "metadata": {
        "source_file": "dao\\藏外\\素女经.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "四至第十 《玄女经》云：黄帝曰：“意贪交接而茎不起，可以强用不？ ”玄女曰：“不可矣。 夫欲交接之道，男经四至，乃可致女九气。 ”黄帝曰：“何谓四至？ ”玄女曰：“玉茎不怒，和气不至； 怒而不大，肌气不至； 大而不坚，骨气不至； 坚而不热，神气不至。 故怒者，精之明； 大者，精之关； 坚者，精之户； 热者，精之门。 四气至而节之以道，开机不妄，开精不泄矣。 ” 九气第十一 《玄女经》云：黄帝曰：“善哉！ 女之九气，何以知之？ ”玄女曰：“伺其九气以知之。 女人大息而咽唾者，肺气来至； 鸣而吮人者，心气来至； 抱而持人者，脾气来至； 阴门滑泽者，肾气来至； 勤殷咋人者，骨气来至； 足拘人者，筋气来至； 抚弄玉茎者，血气来至； 持弄男乳者，肉气来至。 久与交接，弄其实以感其意，九气皆至。 有不至者则容伤，故不至，可行其数以治之。 ” 九法第十二",
      "translated_text": "**Four Arrivals (Chapter Ten)**\nFrom the *Classic of the Dark Lady*, it is said: The Yellow Emperor asked, “If desire for union is strong yet the jade stalk does not rise, may one force its use?” The Dark Lady replied, “One may not. The Way of union requires that the man attain the four arrivals before the woman’s nine qi can be summoned.”\n\nThe Yellow Emperor asked, “What are the four arrivals?”\nThe Dark Lady said, “If the jade stalk does not swell with vigor, harmonious qi has not arrived. If it swells but does not enlarge, muscular qi has not arrived. If it enlarges but does not firm, skeletal qi has not arrived. If it firms but does not grow hot, spirit qi has not arrived. Thus, swelling is the radiance of essence; enlargement is the gateway of essence; firmness is the portal of essence; heat is the threshold of essence. When the four qi arrive and are regulated by the Dao, the mechanism opens without recklessness, and essence is released without leakage.”\n\n**Nine Qi (Chapter Eleven)**\nFrom the *Classic of the Dark Lady*, it is said: The Yellow Emperor asked, “Excellent! How may one recognize the woman’s nine qi?”\nThe Dark Lady replied, “Observe her nine qi to know them. When a woman sighs deeply and swallows her saliva, lung qi has arrived. When she moans and sucks at her partner, heart qi has arrived. When she embraces and clings to him, spleen qi has arrived. When her yin gate becomes smooth and moist, kidney qi has arrived. When she eagerly nips at him, bone qi has arrived. When her feet clasp him, sinew qi has arrived. When she caresses the jade stalk, blood qi has arrived. When she fondles the man’s nipples, flesh qi has arrived. After prolonged union, playing with her true form stirs her intent, and all nine qi arrive. If any fail to arrive, her countenance will show distress; if they do not, one may apply the proper methods to remedy this.”\n\n**Nine Methods (Chapter Twelve)**",
      "overlap_context": "sure is keen. The fifth: when she lifts her legs to clasp the man, she desires deep penetration. The sixth: when she crosses her thighs, her inner itch surges. The seventh: when she sways to the side, she desires deep, shifting contact. The eighth: when she raises her body, she urges the man to move with greater vigor. The ninth: when her limbs relax, her body is at ease. The tenth: when her yin fluids flow smoothly, her essence has been released. Observe these signs to know a woman’s pleasure.\"",
      "start_char": 2277,
      "end_char": 2645,
      "start_sentence": 124,
      "end_sentence": 154,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.316788673400879,
      "metadata": {
        "source_file": "dao\\藏外\\素女经.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "《玄女经》云：黄帝曰：“所说九法，未闻其法，愿为陈之，以开其意，藏之石室，行其法式。 ”玄女曰：“九法： 第一曰龙翻。 令女正偃卧向上，男伏其上，股隐於床，女举其阴，以受玉茎。 刺其谷实，又攻其上，疏缓动摇，八浅二深，死往生返，势壮且强，女则烦悦，其乐如倡，致自闭固，百病消亡。 第二曰虎步。 令女俯伏，尻仰首伏，男跪其后，抱其腹，乃内玉茎，刺其中极，务令深密，进退相薄，行五八之数，其度自得，女阴闭张，精液外溢，毕而休息，百病不发，男益盛。 第三曰猿搏。 令女偃卧，男担其股，膝还过胸，尻背俱举，乃内玉茎，刺其臭鼠，女烦摇动，精液如雨，男深案之，极壮且怒，女快乃止，百病自愈。 第四曰蝉附。 令女伏卧，直伸其躯，男伏其后，深内玉茎，小举其尻，以扣其赤珠，行六九之数，女烦精流，阴里动急，外为开舒，女快乃止，七伤自除。 第五曰龟腾。 令女正卧，屈其两膝，男乃推之，其足至乳，深内玉茎，刺婴女，深浅以度，令中其实，女则感悦，躯自摇举，精液流溢，乃深极内，女快乃止，行之勿失，精力百倍。 第六曰凤翔。 令女正卧，自举其脚，男跪其股间，两手处席，深内玉茎，刺其昆石，坚热内牵，令女动作，行三八之数，尻急相薄，女阴开舒，自吐精液，女快乃止，百病消灭。 第七曰兔吮毫。 男正反卧，直伸脚，女跨其上，膝在外边，女背头向足，处席俯头，乃内玉茎，刺其琴弦，女快，精液流出如泉，欣喜和乐，动其神形，女快乃止，百病不生。 第八曰鱼接鳞。 男正偃卧，女跨其上，两股向前，安徐内之，微入便止，缠授勿深，如儿含乳，使女独摇，务令持久，女快男退，治诸结聚。 第九曰鹤交颈。 男正箕座，女跨其股，手抱男颈，内玉茎，刺麦齿，中其实，男抱女尻，助其摇举，女自感快，精液流溢，女快乃止，七伤自愈。 ” 八益第十六",
      "translated_text": "The *Classic of the Dark Lady* states: The Yellow Emperor said, “Of the nine methods you have spoken, I have yet to hear their details. I wish you would expound upon them to clarify their meaning, that they may be stored in the stone chamber and their forms practiced.” The Dark Lady replied, “The nine methods are as follows:\n\n**First: Dragon’s Turn**\nHave the woman lie supine facing upward, while the man lies atop her, his thighs concealed upon the bed. The woman raises her yin to receive the jade stalk. Thrust into her valley’s fruit, then press upward, moving slowly and gently, eight shallow and two deep. Advance as if dead, retreat as if reborn—vigorous and strong. The woman will grow restless with delight, her pleasure like that of a performer. When she reaches closure and steadfastness, all ailments vanish.\n\n**Second: Tiger’s Stride**\nHave the woman lie prone, her buttocks raised and head lowered. The man kneels behind her, embracing her belly, then inserts the jade stalk, piercing her central pole. Ensure deep and close thrusts, pressing forward and back in alternation. Perform five sets of eight, and the rhythm will come naturally. The woman’s yin will open and close, her essence flowing outward. When finished, rest, and no ailments will arise; the man’s vigor will increase.\n\n**Third: Ape’s Grasp**\nHave the woman lie supine while the man lifts her thighs, her knees drawn past her chest, her buttocks and back both raised. Insert the jade stalk, piercing her foul rat. The woman will grow restless and sway, her essence flowing like rain. The man presses deeply, fierce and enraged, until the woman’s pleasure ceases. All ailments will heal of themselves.\n\n**Fourth: Cicada’s Cling**\nHave the woman lie prone, her body stretched straight. The man lies atop her from behind, inserting the jade stalk deeply. Slightly raise her buttocks to strike her red pearl. Perform six sets of nine. The woman will grow restless, her essence flowing, her inner yin pulsing urgently. Outwardly, she will open and relax. Cease when the woman’s pleasure is complete, and the seven harms will be dispelled.\n\n**Fifth: Turtle’s Ascent**\nHave the woman lie supine, bending her knees. The man pushes her legs until her feet reach her breasts, then inserts the jade stalk deeply, piercing the maiden. Adjust depth to strike her fruit. The woman will feel delight, her body swaying and lifting of its own accord. Her essence will flow, so press deeply within. Cease when the woman’s pleasure is complete. Practice this without fail, and vigor will increase a hundredfold.\n\n**Sixth: Phoenix’s Soar**\nHave the woman lie supine, raising her own legs. The man kneels between her thighs, his hands placed on the mat, and inserts the jade stalk deeply, piercing her kun stone. Firm and hot, he draws inward, urging the woman to move. Perform three sets of eight. Their buttocks press urgently together, the woman’s yin opening and relaxing, her essence flowing forth. Cease when the woman’s pleasure is complete, and all ailments will vanish.\n\n**Seventh: Hare’s Sip of Down**\nHave the man lie supine, legs stretched straight. The woman straddles him, her knees outside his thighs, her back toward his feet. She leans forward, head lowered, and inserts the jade stalk, piercing her zither strings. When the woman feels pleasure, her essence will flow like a spring. Joy and harmony will stir her spirit and form. Cease when the woman’s pleasure is complete, and no ailments will arise.\n\n**Eighth: Fish’s Scale Press**\nHave the man lie supine while the woman straddles him, her thighs forward. Insert gently, stopping after a slight entry. Entwine and receive without deepening, like a child at the breast. Let the woman sway alone, ensuring it lasts. When the woman feels pleasure, the man withdraws. This remedies all accumulations.\n\n**Ninth: Crane’s Neck Entwine**\nHave the man sit cross-legged while the woman straddles his thighs, her hands embracing his neck. Insert the jade stalk, piercing her wheat teeth to strike her fruit. The man embraces her buttocks, aiding her sway and lift. The woman will feel pleasure of her own accord, her essence flowing. Cease when the woman’s pleasure is complete, and the seven harms will heal of themselves.”\n\n**Eight Benefits (Chapter Sixteen)**",
      "overlap_context": "th and moist, kidney qi has arrived. When she eagerly nips at him, bone qi has arrived. When her feet clasp him, sinew qi has arrived. When she caresses the jade stalk, blood qi has arrived. When she fondles the man’s nipples, flesh qi has arrived. After prolonged union, playing with her true form stirs her intent, and all nine qi arrive. If any fail to arrive, her countenance will show distress; if they do not, one may apply the proper methods to remedy this.”\n\n**Nine Methods (Chapter Twelve)**",
      "start_char": 2646,
      "end_char": 3407,
      "start_sentence": 155,
      "end_sentence": 177,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.064562797546387,
      "metadata": {
        "source_file": "dao\\藏外\\素女经.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "《玉房秘诀》云：素女曰：“阴阳有七损八益。 一益曰固精。 令女侧卧，张股男侧，卧其中，行二九数，数毕止，令男固精，又治女子漏血，日再行，十五日愈。 二益曰安气。 令女正卧高枕，伸张两股，男跪其股间刺之，行三九数，数毕止，令人气和，又治女门寒，日三行，二十日愈。 三益曰利藏。 令女侧卧，屈其两股，男横卧，却刺之，行四九数，数毕止，令人气和，又治女门寒，日四行，二十日愈。 四益曰强骨。 令女侧卧，屈左膝，伸其右股，男伏刺之，行五九数，数毕止，令人关节调和，又治女闭血，日五行，十日愈。 五益曰调脉。 令女侧卧，屈其右希伸其左股，男处地刺之，行六九数，数毕止，令人脉通利，又治女门辟，日六行，二十日愈。 六益曰蓄血。 男正偃卧，令女戴尻跪其上，极内之，令女行七九数，数毕止，令人力强，又治女子月经不利，日七行，十日愈。 七益曰益液。 令女人正伏举后，男上往，行八九数，数毕止，令人骨填。 八益曰道体。 令女正卧，屈其股，足迫尻下，男以股胁刺之，以行九九数，数毕止，令人骨实，又治女阴臭，日九行，九日愈。 ” 七损第十七",
      "translated_text": "From *The Secret Instructions of the Jade Chamber*, Su Nü states:\n\n“The interplay of yin and yang comprises seven harms and eight benefits.\n\n**First Benefit: Securing Essence**\nHave the woman lie on her side, legs parted, while the man lies beside her. Perform two sets of nine thrusts, then cease. This secures the man’s essence and remedies the woman’s uterine bleeding. Practice twice daily, and recovery comes in fifteen days.\n\n**Second Benefit: Harmonizing Qi**\nHave the woman lie supine with a high pillow, legs fully extended. The man kneels between her thighs and penetrates her, performing three sets of nine thrusts before stopping. This harmonizes qi and cures the woman’s vaginal cold. Practice thrice daily, and recovery comes in twenty days.\n\n**Third Benefit: Nourishing the Organs**\nHave the woman lie on her side, legs drawn up, while the man lies horizontally and penetrates her from behind. Perform four sets of nine thrusts, then cease. This harmonizes qi and cures the woman’s vaginal cold. Practice four times daily, and recovery comes in twenty days.\n\n**Fourth Benefit: Strengthening the Bones**\nHave the woman lie on her side, left knee bent and right leg extended. The man leans over her and penetrates, performing five sets of nine thrusts before stopping. This harmonizes the joints and remedies the woman’s blocked menstruation. Practice five times daily, and recovery comes in ten days.\n\n**Fifth Benefit: Regulating the Pulse**\nHave the woman lie on her side, right leg bent and left leg extended. The man positions himself on the ground and penetrates her, performing six sets of nine thrusts before stopping. This unblocks the pulse and cures the woman’s vaginal laxity. Practice six times daily, and recovery comes in twenty days.\n\n**Sixth Benefit: Storing Blood**\nHave the man lie supine while the woman, facing his feet, kneels above him and inserts deeply. She performs seven sets of nine thrusts before stopping. This strengthens the man’s vigor and remedies the woman’s menstrual irregularities. Practice seven times daily, and recovery comes in ten days.\n\n**Seventh Benefit: Enriching Fluids**\nHave the woman lie prone, lifting her buttocks, while the man mounts her from above. Perform eight sets of nine thrusts, then cease. This fortifies the bones.\n\n**Eighth Benefit: Cultivating the Dao-Body**\nHave the woman lie supine, legs bent with feet pressing near her buttocks. The man, using his thighs, penetrates her and performs nine sets of nine thrusts before stopping. This solidifies the bones and cures the woman’s vaginal odor. Practice nine times daily, and recovery comes in nine days.”\n\n**Seven Harms (Chapter Seventeen)**",
      "overlap_context": "n withdraws. This remedies all accumulations.\n\n**Ninth: Crane’s Neck Entwine**\nHave the man sit cross-legged while the woman straddles his thighs, her hands embracing his neck. Insert the jade stalk, piercing her wheat teeth to strike her fruit. The man embraces her buttocks, aiding her sway and lift. The woman will feel pleasure of her own accord, her essence flowing. Cease when the woman’s pleasure is complete, and the seven harms will heal of themselves.”\n\n**Eight Benefits (Chapter Sixteen)**",
      "start_char": 3408,
      "end_char": 3890,
      "start_sentence": 178,
      "end_sentence": 196,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.990570306777954,
      "metadata": {
        "source_file": "dao\\藏外\\素女经.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "《玉房秘诀》云：素女曰： “一损谓绝气。 绝气者，心意不欲而强用之，则汗泄气少，令心热目冥冥。 治之法，令女正卧，男担其两股，深案之，令女自摇，女精出止，男勿得快，日九行，十日愈。 二损谓溢精。 溢精者，心意贪爱，阴阳未合而用之，精中道溢，又醉饱而交接，喘息气乱则伤肺，令人□逆上气，消渴喜怒，或悲惨惨，口干身热而难久立。 治之法，令女人正卧，屈其两膝侠男，男浅刺，内玉茎寸半，令女子自摇，女精出止，男勿得快，日九行，十日愈。 三损谓杂脉。 杂脉者，阴不坚而强用之，中道强写，精气竭，及饱食讫，交接伤脾，令人食不化，阴痿无精。 治之法，令女人正卧，以脚钩男子尻，男则处席内之，令女自摇，女精出止，男勿快，日九行，十日愈。 四损谓气泄。 气泄者，劳倦汗出，未干而交接，令人腹热唇焦。 治之法，令男子正卧，女跨其上，向足，女据席，浅内玉茎，令女自摇，精出止，男子勿快，日九行，十日愈。 五损谓机关厥伤。 机关厥伤者，适新大小便，身体未定而强用之，则伤肝，及卒暴交会，迟疾不理，不理劳疲筋骨，令人目茫茫，痈疽并发，众脉槁绝，久生偏枯，阴痿不起。 治之法，令男子正卧，女跨其股，踞前向，徐徐案内之，勿令女人自摇，女精出止，男勿快，日九行，十日愈。 六损谓百闭。 百闭者，淫佚於女，自用不节，数交失度，竭其精气，用力强写，精尽不出，百病并生，消渴目冥冥。 治之法，令男正卧，女跨其上，前伏据席，令女内玉茎相摇，精出止，男勿快，日九行，十日愈。 七损谓血竭。 血竭者，力作疾行，劳因汗出，因以交合，俱已之时，偃卧推深，没本暴急，剧病因发，连施不止，血枯气竭，令人皮虚肤急，茎痛囊湿，精变为血。 治之法，令女正卧，高抗其尻，申张两股，男跪其间深刺，令女自摇，精出止，男勿快，日九行，十日愈。 www.taoismcn.com 还精第十八",
      "translated_text": "From *The Jade Chamber Secrets*, Su Nü states:\n\n**First Harm: Depletion of Qi**\nDepletion of qi occurs when desire is absent yet one forces the act, causing sweat to flow and qi to diminish, leading to heart heat and dimmed vision. The remedy: have the woman lie supine while the man lifts her thighs and deeply penetrates. Let the woman move herself until her essence is released, but the man must not reach climax. Practice nine times daily, and recovery comes in ten days.\n\n**Second Harm: Spillage of Essence**\nSpillage of essence occurs when desire is excessive and one engages before yin and yang harmonize, causing essence to overflow midway. Coupling while drunk or overfed disrupts breath and harms the lungs, resulting in counterflow qi, wasting-thirst, mood swings, sorrow, dry mouth, body heat, and difficulty standing. The remedy: have the woman lie supine, bending her knees to flank the man. The man penetrates shallowly, inserting only an inch and a half of the jade stem, then lets the woman move herself until her essence is released, while the man refrains from climax. Practice nine times daily, and recovery comes in ten days.\n\n**Third Harm: Disorder of the Vessels**\nDisorder of the vessels occurs when the yang is not firm yet one forces the act, draining essence midway and depleting qi. Coupling after a full meal harms the spleen, causing indigestion and impotence with loss of essence. The remedy: have the woman lie supine, hooking the man’s buttocks with her feet. The man positions himself on the mat and penetrates, letting the woman move herself until her essence is released, while the man refrains from climax. Practice nine times daily, and recovery comes in ten days.\n\n**Fourth Harm: Leakage of Qi**\nLeakage of qi occurs when one couples while fatigued and sweating, before the sweat has dried, leading to abdominal heat and chapped lips. The remedy: have the man lie supine while the woman straddles him, facing his feet and bracing herself on the mat. She inserts the jade stem shallowly and moves herself until her essence is released, while the man refrains from climax. Practice nine times daily, and recovery comes in ten days.\n\n**Fifth Harm: Injury to the Mechanism**\nInjury to the mechanism occurs when one couples immediately after urinating or defecating, before the body has settled, harming the liver. Hasty or violent coupling, with reckless pacing, strains the sinews and bones, causing blurred vision, abscesses, and ulcers. Prolonged harm leads to hemiplegia and impotence. The remedy: have the man lie supine while the woman straddles his thighs, crouching forward. He slowly penetrates without letting the woman move herself. When her essence is released, the man refrains from climax. Practice nine times daily, and recovery comes in ten days.\n\n**Sixth Harm: Hundredfold Obstruction**\nHundredfold obstruction occurs from excessive indulgence, lack of restraint, and reckless coupling that exhausts essence and qi. Forcing ejaculation when essence is depleted prevents its release, giving rise to a hundred illnesses, wasting-thirst, and dimmed vision. The remedy: have the man lie supine while the woman straddles him, leaning forward to brace herself on the mat. She inserts the jade stem and moves herself until her essence is released, while the man refrains from climax. Practice nine times daily, and recovery comes in ten days.\n\n**Seventh Harm: Exhaustion of Blood**\nExhaustion of blood occurs when one couples after strenuous labor or rapid movement, while still sweating. Lying prone and thrusting deeply with violent haste during climax triggers severe illness, continuous discharge, blood depletion, and qi exhaustion. This causes flaccid skin, taut flesh, penile pain, scrotal dampness, and essence transforming into blood. The remedy: have the woman lie supine, raising her buttocks high and stretching her thighs apart. The man kneels between them and deeply penetrates, letting the woman move herself until her essence is released, while the man refrains from climax. Practice nine times daily, and recovery comes in ten days.\n\n**Eighteenth Chapter: Returning Essence**",
      "overlap_context": " buttocks, while the man mounts her from above. Perform eight sets of nine thrusts, then cease. This fortifies the bones.\n\n**Eighth Benefit: Cultivating the Dao-Body**\nHave the woman lie supine, legs bent with feet pressing near her buttocks. The man, using his thighs, penetrates her and performs nine sets of nine thrusts before stopping. This solidifies the bones and cures the woman’s vaginal odor. Practice nine times daily, and recovery comes in nine days.”\n\n**Seven Harms (Chapter Seventeen)**",
      "start_char": 3891,
      "end_char": 4666,
      "start_sentence": 197,
      "end_sentence": 220,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.91106677055359,
      "metadata": {
        "source_file": "dao\\藏外\\素女经.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "《玉房秘诀》云：黄帝曰：“愿闻动而不施，其效如何？ ”素女曰：“一动不写，则气力强； 再动不写，耳目聪明； 三动不写，病消亡； 四动不写，神威安； 五动不写，血脉充长； 六动不写，腰背竖强； 七动不写，尻股益力； 八动不写，身体生光； 九动不写，寿命未央； 十动不写，通於神明。 ” 施泻第十九 《玉房秘诀》云：黄帝问素女曰：“道要不欲失精，宜爱液者也，即欲求子，何可得写？ ”素女曰：“人有强弱，年有老壮，各随其气力，不欲强快，强快即有损。 故男年十五，盛者可一日再施，瘦者可一日一施； 年廿，盛者日再施，嬴者可一日一施； 年卅，盛者可一日一施，劣者二日一施； 册，盛者三日一施，虚者四日一施； 五十，盛者可五日一施，虚者可十日一施； 六十，盛者十一日一施，虚者二十日一施； 七十，盛者可卅日一施，虚者不写。 ” 治伤第廿十",
      "translated_text": "**The Jade Chamber Secret Teachings** states:\nThe Yellow Emperor asked, “I wish to know the effects of movement without release.”\nThe Plain Girl replied:\n“One movement without release strengthens qi and vigor;\nTwo movements without release sharpen hearing and vision;\nThree movements without release dispel illness;\nFour movements without release stabilize spirit and might;\nFive movements without release replenish blood and vessels;\nSix movements without release fortify the waist and back;\nSeven movements without release enhance the buttocks and thighs;\nEight movements without release illuminate the body;\nNine movements without release extend lifespan without end;\nTen movements without release unite with the divine.”\n\n**Nineteenth Chapter: Release and Ejaculation**\n**The Jade Chamber Secret Teachings** states:\nThe Yellow Emperor asked the Plain Girl, “The essential Dao teaches not to lose essence, and one should cherish the fluids. Yet if one seeks offspring, how can ejaculation be permitted?”\nThe Plain Girl replied, “People vary in strength, and age differs in vitality. Each should follow their own qi and vigor, avoiding forced haste, for haste brings harm.\nThus, at fifteen, the robust may ejaculate twice daily, the frail once daily;\nAt twenty, the robust twice daily, the weak once daily;\nAt thirty, the robust once daily, the feeble once every two days;\nAt forty, the robust once every three days, the depleted once every four days;\nAt fifty, the robust once every five days, the weak once every ten days;\nAt sixty, the robust once every eleven days, the weak once every twenty days;\nAt seventy, the robust may ejaculate once every thirty days, the weak should not release.”\n\n**Twentieth Chapter: Treating Injuries**",
      "overlap_context": "ischarge, blood depletion, and qi exhaustion. This causes flaccid skin, taut flesh, penile pain, scrotal dampness, and essence transforming into blood. The remedy: have the woman lie supine, raising her buttocks high and stretching her thighs apart. The man kneels between them and deeply penetrates, letting the woman move herself until her essence is released, while the man refrains from climax. Practice nine times daily, and recovery comes in ten days.\n\n**Eighteenth Chapter: Returning Essence**",
      "start_char": 4667,
      "end_char": 5026,
      "start_sentence": 221,
      "end_sentence": 244,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.938155174255371,
      "metadata": {
        "source_file": "dao\\藏外\\素女经.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "《玉房秘诀》云：采女曰：“男之盛衰，何以为候？ ”彭祖曰：“阳盛得气则玉茎当热，阳精浓而凝也。 其衰有五：一曰精泄而出，则气伤也； 二曰精清而少，此肉伤也； 三曰精变而臭，此筋伤也； 四曰精出不射，此骨伤也； 五曰阴衰不起，此身伤也。 凡此众伤皆由不徐交接而卒暴施写之所致也。 治之法，但御而不施，不过百日，气力必致百倍。 ” 求子第廿一 《玉房秘诀》云：素女曰：“求子法自有常体，清心远虑，安定其衿袍，垂虚斋戒，以妇人月经后三日，夜半之后，鸡鸣之前嬉戏，令女盛动，乃往从之。 适其道理，同其快乐，却身施写，下精欲得，去玉门半寸，不可过子宫，《千翼》，勿过远，至麦齿。 远则过子门，不入子户。 若依道术，有子贤良而老寿也。 ” 又云：素女曰：“夫人合阴阳，当避禁忌，常乘生气，无不老寿。 若夫妇俱老，虽生化有子，皆不寿也。 ” 好女第廿二",
      "translated_text": "The *Secret Essentials of the Jade Chamber* states: The Plain Girl asked, “How can one gauge the rise and decline of a man’s vigor?”\n\nPeng Zu replied, “When yang flourishes and qi is abundant, the jade stalk becomes hot, and the yang essence thickens and congeals. There are five signs of decline:\nFirst, if essence spills out, qi is injured;\nSecond, if essence is thin and scant, the flesh is injured;\nThird, if essence changes and turns foul, the sinews are injured;\nFourth, if essence flows out without forceful emission, the bones are injured;\nFifth, if the yin withers and fails to rise, the body itself is injured.\nAll these injuries stem from hasty and violent ejaculation rather than gradual union.\n\nThe remedy is to engage in intercourse without ejaculating. Within a hundred days, one’s qi and strength will surely increase a hundredfold.”\n\n**Twenty-First Chapter: Seeking Offspring**\n\nThe *Secret Essentials of the Jade Chamber* states: The Plain Girl said, “The method for seeking offspring follows a constant pattern. Calm the mind, dispel distractions, and stabilize one’s resolve. Observe fasting and abstinence. On the third night after a woman’s menstrual flow, after midnight and before cock’s crow, play and arouse her so that her desire peaks, then proceed to unite. Follow the proper way, share in her pleasure, withdraw, and ejaculate. Deposit the essence half an inch from the jade gate—do not surpass the womb. As the *Thousand Wings* states, do not go too deep, only as far as the wheat-teeth. If too far, it will pass the child’s gate and fail to enter the child’s chamber. If one adheres to this Daoist art, the child will be virtuous, and both parents will enjoy longevity.”\n\nIt further states: The Plain Girl said, “When a man and woman unite in yin and yang, they must avoid taboos and always ride the qi of life. Then there is no one who will not live long. But if both husband and wife are aged, even if they conceive and bear a child, the child will not live long.”\n\n**Twenty-Second Chapter: The Excellent Woman**",
      "overlap_context": "ail once daily;\nAt twenty, the robust twice daily, the weak once daily;\nAt thirty, the robust once daily, the feeble once every two days;\nAt forty, the robust once every three days, the depleted once every four days;\nAt fifty, the robust once every five days, the weak once every ten days;\nAt sixty, the robust once every eleven days, the weak once every twenty days;\nAt seventy, the robust may ejaculate once every thirty days, the weak should not release.”\n\n**Twentieth Chapter: Treating Injuries**",
      "start_char": 5027,
      "end_char": 5400,
      "start_sentence": 245,
      "end_sentence": 264,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.29402470588684,
      "metadata": {
        "source_file": "dao\\藏外\\素女经.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "《大清经》云：黄帝曰：“入相女人，云何谓其事？ ”素女曰：“入相女人，天性婉顺，气声濡行，丝发黑，弱肌细骨，不长不短，不大不小，凿孔居高，阴上无毛，多精液者； 年五五以上，三十以还，未在产者。 交接之时，精液流漾，身体动摇，不能自定，汗流四逋，随人举止。 男子者，虽不行法，得此人由不为损。 ” 房中禁忌：日月晦朔、上下弦望、六丁六丙日、破日、月廿八、日月蚀、大风甚雨、地动、雷电霹雳、大寒大暑、春秋冬夏节变之日，送迎五日之中，不行阴阳。 本命行年禁之重都者：夏至后丙子丁丑，冬至后庚申辛酉，及新沐头、新远行、疲倦、大喜怒，皆不可合阴阳。 至丈夫衰忌之年，皆不可妄施精。 素女论曰：“五月十六日，天地牝牡日，不可行房。 犯之，不出三年必死。 何以知之？",
      "translated_text": "The *Great Purity Scripture* states: The Yellow Emperor asked, “What are the signs when assessing a woman for union?” The Plain Girl replied, “When assessing a woman, she should be naturally gentle and compliant, her qi and voice soft and flowing. Her hair is black as silk, her flesh tender, her bones fine. She is neither too tall nor too short, neither too large nor too small. Her jade gate is high-set, with no hair above the yin, and she abounds in essence-fluid. She should be above twenty-five and under thirty, and never having borne a child. During union, her essence-fluid flows and ripples, her body sways and trembles, unable to steady herself. Sweat streams from her in all directions, and she follows her partner’s every movement. Even if a man does not follow the proper method, uniting with such a woman will not harm him.”\n\n**Taboos in the Bedchamber:**\nAvoid union on the dark of the moon and the new moon, the first and last quarters, the full moon, the days of the six *dings* and six *bings*, inauspicious days, the twenty-eighth day of the lunar month, solar and lunar eclipses, days of fierce wind and heavy rain, earthquakes, thunder and lightning, extreme cold or heat, and the days when the seasons shift in spring, autumn, winter, and summer. Also avoid the five days before and after these transitions. Do not engage in yin-yang union.\n\n**Strictly Forbidden on One’s Natal Year and Age:**\nAfter the Summer Solstice, the days of *bingzi* and *dingchou*; after the Winter Solstice, the days of *gengshen* and *xinyou*. Also forbidden are the days after newly washing one’s hair, after a long journey, when fatigued, or when experiencing great joy or anger. One must never recklessly expend essence in the years when a man’s decline begins.\n\nThe Plain Girl’s treatise states: “On the sixteenth day of the fifth lunar month, the day when Heaven and Earth unite as female and male, one must not engage in the bedchamber arts. Violating this will bring death within three years. How can this be known?”",
      "overlap_context": "e child’s gate and fail to enter the child’s chamber. If one adheres to this Daoist art, the child will be virtuous, and both parents will enjoy longevity.”\n\nIt further states: The Plain Girl said, “When a man and woman unite in yin and yang, they must avoid taboos and always ride the qi of life. Then there is no one who will not live long. But if both husband and wife are aged, even if they conceive and bear a child, the child will not live long.”\n\n**Twenty-Second Chapter: The Excellent Woman**",
      "start_char": 5401,
      "end_char": 5726,
      "start_sentence": 265,
      "end_sentence": 276,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.286849975585938,
      "metadata": {
        "source_file": "dao\\藏外\\素女经.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "但取新布一尺，此夕悬东墙上，明日视之，必有血色，切忌之。 ” 采女曰：“何以有鬼交之病？ ”彭祖曰：“由于阴阳不交，情欲深重，即鬼魅假像，与之交通。 与之交通之道，其有胜于人，久处则迷惑，讳而隐之，不肯告人，自以为佳，故至独死而莫知之也。 若得此病，治之法：但令女与男交，而男勿泻精，昼夜勿息，困者不过七日必愈。 若身体疲劳，不能独御者，但深按勿动，亦善也。 不治之，煞人不过数年也。 欲验其事实，以春秋之际，入于深山大泽间，无所云为，但远望极思，唯含交会阴阳，三日三夜后，则身体翕然寒热，心烦目眩，男见女子，女见男子，但行交接之事，美胜于人，然必病人而难治，怨旷之气，为邪所凌。 后世必当有此者，若处女贵人，苦不当交。 与男交以治之者，当以石硫黄数两，烧以熏妇人阴下身体，并服鹿角末方寸匕，即愈矣。 当见鬼涕泣而去。 一方服鹿角方寸匕，日三，以瘥为度。 ”",
      "translated_text": "\"Simply take a foot of new cloth and hang it on the eastern wall this evening. The next day, examine it—there will surely be a blood-like hue. This must be strictly avoided.\"\n\nCai Nü asked: \"Why does the illness of ghostly intercourse occur?\"\n\nPeng Zu replied: \"It arises from the lack of yin-yang union and deep-seated desires. Then, spectral entities assume forms to engage in intercourse. The way they traffic with humans surpasses mortal coupling. If one lingers with them, they become bewitched, concealing it in shame and refusing to tell others, believing it to be pleasurable. Thus, they die alone, and none know the cause.\n\nIf afflicted by this malady, the cure is this: have a woman lie with a man, but the man must not release his essence. They must persist day and night without rest; the afflicted will recover within seven days if exhausted. If the body is too weary to sustain this alone, simply press deeply without movement—this is also effective. Left untreated, it will kill within a few years.\n\nTo verify this truth: during spring or autumn, enter the depths of mountains or marshes, free of all distractions. Gaze into the distance and focus solely on the union of yin and yang. After three days and nights, the body will suddenly grow cold and feverish, the heart restless, the eyes dizzy. Men will see women, and women will see men, compelled to engage in intercourse—more exquisite than with mortals. Yet this will sicken them, and the illness will be difficult to cure. The pent-up qi of longing is overpowered by the malevolent force.\n\nFuture generations will surely encounter this. If a virgin of high status suffers from this and must not engage in union, treat her thus: burn several taels of sulfur to fumigate beneath her yin, and have her ingest a *fangcun* spoonful of deer antler powder—she will recover. She will see the ghost weep and depart. Another method: take a *fangcun* spoonful of deer antler powder three times daily until cured.\"",
      "overlap_context": "gshen* and *xinyou*. Also forbidden are the days after newly washing one’s hair, after a long journey, when fatigued, or when experiencing great joy or anger. One must never recklessly expend essence in the years when a man’s decline begins.\n\nThe Plain Girl’s treatise states: “On the sixteenth day of the fifth lunar month, the day when Heaven and Earth unite as female and male, one must not engage in the bedchamber arts. Violating this will bring death within three years. How can this be known?”",
      "start_char": 5726,
      "end_char": 6097,
      "start_sentence": 277,
      "end_sentence": 290,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.855165243148804,
      "metadata": {
        "source_file": "dao\\藏外\\素女经.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "采女曰：“交接之事既闻之矣，敢问服食药物，何者亦得而有效？ ”彭祖曰：“使人丁强不老，房室不劳损气力，颜色不衰者，莫过麋角也。 其法：取麋角，刮之为末十两，辄用八角、生附子一枚，合之服方寸匕，日三，大良。 亦可熬麋角令微黄，单服之，亦令人不老。 然迟缓不及用附子者，服之廿日，大觉。 亦可用陇西头伏苓分等捧筛，服方寸匕，日三，令人长生，房内不衰。 ” 黄帝问素女对曰：“女人年廿八、九，若廿三、四，阴气盛，欲得男子，不能自禁，食饮无味，百脉动体，候精脉实，汁出污衣裳。 女人阴中有虫，如马尾，长三分，赤头者闷，黑头者沫。 治之方：用面作玉茎，长短大小随意，以酱及二辨绵裹之，内阴中，虫即着来出，出复内，如得大夫，其虫多者卅，少者廿。 ”",
      "translated_text": "The Handmaid inquired, “I have heard of the matters of union, but dare I ask: which medicinal substances taken as food are also effective?”\n\nPeng Zu replied, “To make a man robust and free from aging, to engage in the bedchamber without exhausting his qi and strength, and to preserve his complexion—nothing surpasses elk antler. The method: take ten taels of elk antler, scrape it into powder, and each time combine it with eight *jiao* of processed aconite and one piece of raw aconite root. Ingest a *fangcun* spoonful of this mixture three times daily—highly efficacious. Alternatively, roast elk antler until slightly yellow and take it alone, which also prevents aging. However, its effects are slower and not as potent as when combined with aconite. After twenty days of ingestion, one will feel greatly invigorated. Another method: take equal parts of *Ling* poria from Longxi, sifted and blended, and ingest a *fangcun* spoonful three times daily. This grants longevity and preserves vigor in the bedchamber.”\n\nThe Yellow Emperor asked the Plain Girl, who replied, “When a woman reaches twenty-eight or twenty-nine—or twenty-three or twenty-four—her yin qi flourishes, and she desires a man, unable to restrain herself. Food and drink lose their savor, her hundred vessels stir within her body, and when her essence-vessel is full, her fluids seep forth, soiling her garments. Within a woman’s yin, there are worms resembling horse tails, three *fen* in length. Those with red heads cause distress, while those with black heads produce foam. The treatment: fashion a jade stalk from dough, its length and girth as desired, wrap it in soy paste and two layers of silk, and insert it into her yin. The worms will cling to it and emerge; reinsert it as needed. Once she obtains a husband, those with many worms may have thirty, while others may have twenty.”",
      "overlap_context": "e difficult to cure. The pent-up qi of longing is overpowered by the malevolent force.\n\nFuture generations will surely encounter this. If a virgin of high status suffers from this and must not engage in union, treat her thus: burn several taels of sulfur to fumigate beneath her yin, and have her ingest a *fangcun* spoonful of deer antler powder—she will recover. She will see the ghost weep and depart. Another method: take a *fangcun* spoonful of deer antler powder three times daily until cured.\"",
      "start_char": 6098,
      "end_char": 6413,
      "start_sentence": 291,
      "end_sentence": 301,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.980660915374756,
      "metadata": {
        "source_file": "dao\\藏外\\素女经.txt",
        "category": "藏外"
      }
    }
  ]
}