{
  "source_id": "素履子",
  "source_file": "chunked_daozang\\素履子.json",
  "total_chunks": 7,
  "total_original_chars": 6596,
  "total_translated_chars": 37205,
  "total_translation_time": 193.42946124076843,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\素履子.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**Su Lü Zi**\n\n**Scripture Title:** *Su Lü Zi*\nComposed by Zhang Hu of the Tang dynasty. Three juan in total.\nBase text sourced from: *Daoist Canon of the Orthodox Unity*, Tai Xuan Section.\nCollated with: *Complete Library of the Four Treasuries*, Wenyuan Pavilion edition (hereafter referred to as the Wenyuan Pavilion edition).\n\n**Table of Contents**\nPreface\n*Juan* One\n  Treading the Dao\n  Treading Virtue\n  Treading Loyalty\n  Treading Filial Piety\n*Juan* Two\n  Treading Benevolence\n  Treading Righteousness\n  Treading Wisdom\n  Treading Trust\n  Treading Ritual Propriety\n*Juan* Three\n  Treading Joy\n  Treading Wealth and Nobility\n  Treading Poverty and Humility\n  Treading Equanimity\n  Treading Peril\n\n**Su Lü Zi**\n**Scripture Title:** *Su Lü Zi*\nComposed by Zhang Hu of the Tang dynasty. Three juan in total.\nBase text sourced from: *Daoist Canon of the Orthodox Unity*, Tai Xuan Section.\nCollated with: *Complete Library of the Four Treasuries*, Wenyuan Pavilion edition (hereafter referred to as the Wenyuan Pavilion edition).\n\n**Preface to Su Lü Zi**\nThe *Su Lü Zi* takes its name from the *Book of Changes*, Hexagram *Lü* (Treading): \"At the first nine, treading with purity—no blame.\" It takes pure simplicity as the foundation of treading and conduct as its foremost priority. Though clad in plain cloth, one must first tread the governance and teachings of the former kings.\n\nThus, it draws from the origins of Heaven and Earth, the inception of *Qian* and *Kun*, the norms set forth by the sages in their teachings, and the traces of the worthy and wise in their practice of the Dao. The beginnings of fortune and misfortune arise from what one treads. Therefore, the sage treads the imperial throne with virtue and suffers no remorse, for his radiance is luminous. The scholar and commoner tread with discernment to distinguish above and below, thereby stabilizing the people’s will.\n\nHerein, fourteen chapters are compiled and titled *Su Lü Zi*, serving as admonitions and exhortations.\n\n**Su Lü Zi, Juan One**\n*Probationary Gentleman of the Court, Acting Judge of the Court of Judicial Review*\n\n**Composed by Zhang Hu, Recipient of the Fish-Bag with Purple Tassels**\n\n**Treading the Dao**\n*Su Lü Zi* states: The Dao in its origin is nameless, and in its namelessness abides at the beginning of Heaven and Earth. The beginning of Heaven and Earth is called the *Hunyuan*. At the inception of *Hunyuan*, there was no form, no image. Once the Two Modes divided, they gave birth to the myriad images. Thus, it is called the Dao.\n\nFrom the era of *Longhan* onward, the Three Sovereigns relied upon it to establish their teachings, and the Five Emperors depended on it to govern. It began with a single transformation, pure and natural. To clarify the cycles of cold and heat, the sequence of yin and yang was divided. The sages of high antiquity trod this path: they spoke no words, taught no doctrines, and held no intent toward things, yet things came to them of their own accord. They did not instruct the people, yet the people looked up to them. This was the treading of the pure and pristine royal Dao.\n\nThe lords who first drew the trigrams and the rulers who first cultivated the wilds all trod this path and brought about transformation. When riding oxen and horses, they trod it to dispel tyranny; when employing it, they removed the people’s suffering. Zhuanxu trod the path of loyalty and compliance, Emperor Ku trod the path of clarity and harmony, Tang Yao trod the path of humility and compliance and let his robes hang long, and Yu Shun trod the path of filial piety and fraternal duty and yielded his throne. This was the treading of the imperial Dao.\n\nYu practiced the Dao of diligence and frugality to govern the waters, Tang was reverent and thereby moved Heaven, the Western Earl possessed supreme virtue and was called venerable, and King Wu followed the Dao of filial piety to overthrow cruelty. These sages established teachings through the kingly Dao, ensuring that the elderly had care in their final years, the able-bodied had work, the young had nurture, and the widowed, orphaned, solitary, disabled, and infirm all had sustenance. Men had their duties, and women had their homes. This was the transformation of governing the world through the Dao.\n\nAs for the Yellow Emperor and Laozi, they esteemed only simplicity and eschewed ornamentation; the Uncrowned King likewise returned to pure simplicity. All discarded embellishment to create teachings, forsook literary adornment to return to truth, did not exalt the worthy to prevent contention, and did not prize rare goods to prevent theft. They condemned palaces with carved beams and painted rafters, and honored rulers who dwelt in humble abodes and ate plain fare. The *Daodejing* states: “I possess three treasures, which I safeguard and uphold: the first is compassion, the second is frugality, and the third is not daring to put oneself before the world.” This is the origin of treading the Dao.\n\nIt further says: “My greatest affliction is that I have a self. If I had no self, what affliction would I have?” This is the Dao of the perfected, who forget the self and tread beyond images.\n\nAs for consuming mist and ingesting qi, sealing the senses and revolving the pill, this is the path of treading beyond the dust. Long ago, Master Yayu, while still in the world, taught the people the Dao of cultivation and planting to sustain life, yet in the end he departed by boat. The Perfected Yan, while running a divination stall, taught others the Dao of loyalty and filial piety, then ascended with his entire household. Thus, the Great Dao is not confined to any vessel; all things possess knowledge. The Dao does not act in vain; things respond mysteriously. It is not found in lofty towers or vast halls, nor within the groves of the Western Regions.\n\nIn recent times, the High Lord of Huainan established the Hall of Extended Harmony to seek the Dao—this was mistaken. The foundation of establishing oneself and practicing the Dao does not surpass the harmony of ruler and minister, the kindness of father and filial piety of son, the friendliness of elder brother and deference of younger brother, the compliance of husband and chastity of wife, diligence and frugality in the household, and loyalty to the state.\n\nIn ancient times, the Xia, Yin, Wen, and Wu dynasties flourished because they attained the Dao, while Jie, Zhou, You, and Li perished because they lost it. Thus, the Dao cannot be abandoned: attaining it brings prosperity, losing it brings ruin. Therefore, the sage cherishes the people, benefits customs, bestows virtue, and preserves his position.\n\nMan’s relation to the Dao is like a fish’s to water. If the fish loses water, it perishes; if man loses the Dao, he is ruined. Encompassing the myriad images and governing them through the Dao—this is the Great Dao. To prosper one’s person, one should tread and practice it. This is clear.\n\n**Treading Virtue**\n*Su Lü Zi* states: The Most High values virtue. Virtue is the convergence of all goodness and the gathering of a hundred blessings. Long ago, Shun possessed the virtue of fragrance, and the people flocked to him like ants drawn to sweetness—not that the ants sought the ants, but that the ants sought the fragrance; not that Shun sought the people, but that the people sought virtue.\n\nWhen King Wen was the Western Earl, two-thirds of the world turned to Zhou. The virtue of the Western Earl was like planting bamboo to await birds: the bamboo did not seek the birds, but the birds, pursued by pheasants, came of their own accord to the bamboo. Zhou did not seek the people, but the people, oppressed by Zhou, came of their own accord to Zhou. Thus, it is known that virtue can be bestowed, while cruelty cannot be indulged.\n\nConstantly applying the virtue of cherishing life to harmonize the people’s hearts, spreading civil virtue far and wide, distant lands will come to submit. Therefore, the emperors and kings of ancient times all established virtue to bequeath teachings. Among the Five Phases and Five Emperors, in wood it is called the virtue of wood, in fire the virtue of fire, in earth the virtue of earth, in metal the virtue of metal, and in water the virtue of water. The Five Phases engender one another, each in turn becoming virtue.\n\nThus, water, fire, metal, wood, earth, and grain rectify virtue, their beneficial use enriching life—these are the Nine Merits, teachings established for ten thousand generations. This is the application of virtue, the bestowal of virtue. Without name, it resides in things: if all things attain it, they endure; if they lose it, they perish. If Heaven loses virtue, cold and heat will not arrive in season; if Earth loses virtue, the myriad things will not grow; if man loses virtue, his person will surely collapse.\n\nThus, Great Yu deliberated on the Nine Merits, and Gaoyao deliberated on the Nine Virtues, and the world was governed. The ruler establishes virtue through compassion and love, the minister achieves renown through loyalty and filial piety. Virtue lies in good governance, and governance lies in nurturing the people. The foundation of nurturing the people in martial affairs consists of seven: prohibiting violence, suppressing weapons, safeguarding the great, establishing merit, pacifying the people, harmonizing the masses, and enriching resources. In civil affairs, it consists of five: warmth, kindness, reverence, frugality, and deference. Reverence, magnanimity, trustworthiness, diligence, and kindness all return to the Five Virtues.\n\nVirtue can repel water and fire, move ghosts and spirits, tame dragons and serpents, and transform birds and beasts. It can also cause stars and constellations to retreat, and restore mountains and rivers. Mulberry and catalpa trees wither of themselves, ominous birds depart, the offspring of nest-serpents abandon their gold, and guests leave behind their medicines. It forgives the offense of the severed tassel, and fulfills the loyalty of the lacquered body. All these are bestowed as hidden merits and receive manifest rewards.\n\nThus it is fitting to extend this to all things, never failing even in a single word. The Dao of Heaven shows no partiality, aiding only those who possess virtue. For those who govern states or households, fortunate are they who tread this path—if they remain steadfast without weariness, prosperity and flourishing shall be theirs.\n\n**Treading Loyalty**\nMaster Su Lü said: Loyalty and integrity are the essence of Heaven and Earth, the finest spirit of human relations. In examining the records of past ages, only those of true loyalty have their names inscribed in history, enduring through ten thousand generations—thus, those who perish in loyalty do not truly perish. In ancient times, the Duke of Zhou exemplified utmost loyalty, serving King Wen, King Wu, and King Cheng. Even when King Cheng was but an infant in swaddling clothes, the Duke served three reigns with unwavering devotion, his steadfastness surpassing gold and jade, his integrity exceeding pine and bamboo. To prolong his life to ninety years, he offered himself in sacrifice, entrusting the young orphan to safety, and thereby removed the slander of Guan and Cai. Though his deeds belong to antiquity, his conduct remains ever fresh, recorded in the classics as a model for the wise and worthy. The Grand Duke governed Zhou with royal virtue, wielding the authority of hegemony to overthrow the Shang. Together, these two ministers flanked and aided Zhou, their achievements enduring through ten thousand generations. Again, we hear of Guan Zhong assisting Duke Huan, unifying the realm to honor Zhou, and Zhang Liang aiding the Liu clan, bridging the Honggou to restore Han. As for summoning the Four Elders to sway Emperor Hui, or embracing the young sovereign to receive the feudal lords—there were also those who lay across corpses to remonstrate, or shattered their skulls against pillars in protest. Through past and present, such men are revered as paragons of loyalty. But those who call a deer a horse, invert black and yellow, coerce the weak, and deceive the orphaned—who depose the worthy and usurp righteousness—shall feast on phoenix flesh in life and incur eternal reproach in death, defiling the Two Modes and trespassing within the Three Powers. Thus, the loyal and worthy deserve eternal commemoration, becoming exemplars for this age and glorious tales for the next. As the *Book of Songs* says: *\"The virtuous man, the noble lord—his conduct is never flawed.\"* How flourishing is it for the worthy to tread this path!\n\n**Treading Filial Piety**\nMaster Su Lü said: The classics state: *\"Filial piety is the constant Dao of Heaven, the righteous principle of Earth, and the conduct of humanity.\"* It is also said: *\"Filial piety is the root of virtue, the source from which teaching arises.\"* For those who govern states or households, establishing virtue comes first, and the foundation of virtue begins with filial piety. In ancient times, Shun and Yu possessed supreme virtue and utmost filial piety, preserving their persons and perfecting their virtue—both achieved this through filial conduct, and Shun’s yielding brought him honor. Thus it is said: *\"The former kings had supreme virtue and essential Dao to harmonize the world; the people lived in concord, and none above or below harbored resentment—this was the beginning of filial piety.\"* Filial piety moves Heaven and Earth, resonating with the divine. When the Son of Heaven is filial, the tortoise and dragon bear prophetic charts; when a commoner is filial, grasses and trees flourish. In the past, Master Zeng was filial to his parents, never daring to harm even his hair or skin, and until the end of his life, he never forgot the principles of filial piety, even in the space of a single step. He took from birds, beasts, grasses, and trees only in due season, never violating the Dao of Heaven, and exhausted his strength in loyal devotion. Such was the resolve of a filial son. Among the hundred virtues of humanity, one who lacks filial piety is like a casket filled with jade fragments—ultimately of no use. Those who practice filial piety naturally ascend in spirit, their rank elevated by the Heavenly Emperor, their persons secure and affairs auspicious, bringing honor and prominence in their time. Fortunate is the noble person who treads this path, preserving a hundred blessings.\n\nHere ends the first scroll of *Master Su Lü*.\n\n**Composed by Zhang Hu, Gentleman for Court Service, Probationary Officer of the Court of Judicial Review, Granted the Rank of Daiyu Belt**\n\n**Master Su Lü on Benevolence**\n\nMaster Su Lü said: In ancient times, the sovereigns who tasted herbs taught the people to eat grains and cease killing—this was the transformation of utmost benevolence. The Yellow Emperor removed harm from the people by slaying Chiyou—this was the teaching of utmost benevolence. The Great Luo clan crafted nets and traps to eliminate the harm of birds and beasts—this was the application of utmost benevolence. Yao and Shun employed the Eight Yuan and Eight Kai, illuminating the four directions and penetrating the four quarters—this was the governance of utmost benevolence. Yu carved Dragon Gate to dispel the harm of floods—this was the achievement of utmost benevolence. Tang removed the three-sided nets—this was the policy of utmost benevolence. King Wen buried the dry bones—this was the kindness of utmost benevolence.\n\nZhou lost benevolence, so King Wu slew him, adorned the ruins of Weizi, released Jizi from prison, and sealed the tomb of Bigan. Thereupon, the auspicious omen of the red sparrow bearing a book appeared. Benevolence was attained, benevolence was preserved, and blessings overflowed for a hundred generations. Heaven commands the lord of men to govern the state with benevolence. Thus, he confesses his faults and weeps for the guilty, swallows locusts and gnats—this is how he flourishes.\n\nQin was not benevolent: it burned books and buried scholars alive, and its ruler perished at Shaqiu, not lasting two generations before Ziying was contested by Liu and Xiang. Han practiced benevolence and frugality, spared Ziying, and gained the world. Chu was not benevolent, cruel to all things, killed Ziying, and lost the world. Thus, we know that practicing benevolence is the foundation of a flourishing state—therefore, it may be trodden.\n\nThe Sage Confucius said: \"The benevolent love others.\" He also said: \"To delight in life and detest killing is benevolence; to love others and benefit all things is benevolence; to master oneself and return to ritual is benevolence; to be compassionate and commiserate is benevolence.\" Rewarding the good and punishing the evil, rescuing the drowning and saving the imperiled—these are the steps of the benevolent.\n\nScholars have died to perfect benevolence, fled to perfect benevolence. They set out food beneath the mulberry’s shade, built walls on perilous paths; some saved yellow sparrows, some released white turtles; bestowed kindness upon wounded snakes, extracted thorns from choking tigers; bestowed boundless charity without weariness, distributed kindness with method. In spring, they did not fell trees or overturn nests; in summer, they did not burn fields or harm crops; in autumn, they relieved orphans and aided widows; in winter, they covered and concealed the hidden. The noble person follows the seasons, treads benevolence, and acts—thus, the merit of benevolence is manifest.\n\nThe *Book of Changes* says: \"The great virtue of Heaven and Earth is called life; the great treasure of the sage is called position.\" It also says: \"The noble person embodies benevolence, and this suffices to lead others.\" Only the utmost worthy treads this path without weariness.\n\n**Master Su Lü on Righteousness**\n\nMaster Su Lü said: Managing wealth and rectifying speech, forbidding the people from wrongdoing—this is called righteousness. Thus, righteousness does not contend with things, yet things naturally submit to it. Confucius said: \"Only after righteousness does one take from others, and one is not sated in taking.\"\n\nIn former times, the eldest son of King Tai of Zhou was named Taibo. When the Great King fell ill, Taibo, out of righteousness, yielded his position. He went to gather medicine for his father and never returned. Later, King Ji established Taibo in Wu. One who is righteous must be able to yield; one who can yield must be able to harmonize. The king who treads righteousness and yielding must be able to harmonize the myriad states, reward the good and punish the evil, establish merit and accomplish deeds, and use righteousness to eliminate the unrighteous.\n\nIn former times, Jie was infatuated with Mo Xi and lost righteousness, thereby forfeiting virtue. Zhou was enamored of Daji and lost righteousness, thereby harming loyal worthies. King You of Zhou favored Bao Si, deviated from righteousness, and lost the feudal lords. Duke Xian of Jin delighted in Li Ji and ultimately lost righteousness toward his heir. Lady Zhuang Jiang of Zheng, in her excessive favor, caused Shu Duan to be unfilial. Pang Juan was jealous of the worthy and died as an unrighteous friend. Luo Fu drowned in the river, and Lu Hu forever became a husband who deviated from righteousness. Qu Yuan drowned in the Miluo, and King Huai of Chu became an unrighteous lord. Wu Zixu was aided by the washerwoman, and ultimately became a worthy scholar who upheld righteousness. There were those who struck the locust tree and cut their throats, who burned their eyes and lacquered their bodies in righteousness—Guan and Bao, Chen and Lei established righteous names that adorned the former histories.\n\nThus, we know that righteousness cannot be untrodden and cannot be deviated from. Confucius said: \"Wealth and honor obtained through unrighteousness are to me like floating clouds.\" The former sages despised the unrighteous. If one dies through unrighteousness or abandons righteousness to live, then one treats life and death lightly—this is not worthy. One who can harmonize bones and flesh, brothers and kin, and treads righteousness in all things—what contention could there be? Therefore, the noble person takes righteousness as his essence, treads it, and acts—thus, there is surely no deviation.\n\n**Master Su Lü on Wisdom**\n\nMaster Su Lü said: Wisdom is the virtue of water among the Five Phases. Water takes moistening and descending as its virtue; wisdom takes planning and consideration as its ability. Without consideration, wisdom has no ability; without moistening, water has no virtue. Thus, water flows without ceasing, and wisdom is used without obstruction. When water is turbid, it cannot reflect; when wisdom is disturbed, it cannot consider. It is not like still water that can be clear, settled wisdom that can be bright—when water is still and wisdom is settled, they are both clear and bright.\n\nIf water bursts its banks and does not cease, it will soak and cause harm; if wisdom is used improperly, it will confuse and invite disaster. The worthy employ wisdom to encompass the myriad things, like a mirror that reflects objects—beauty and ugliness are both seen. Within, it is like the bright moon in the sky, with springs and ponds all reflecting its light. It observes and illuminates the distant and near, clearly distinguishing right and wrong, knowing the hardships of the multitude, treasuring one’s own ease and joy, equalizing warmth and fullness in one body, and considering cold and hunger for the four peoples. Thus, it can employ wisdom to assist emperors and kings, devise plans to prevent treachery and harm.\n\nTherefore, Zhang Liang and Chen Ping’s wisdom was comprehensive and they succeeded; Shang Yang and Su Qin’s wisdom was deceptive and they perished. Those who possess states and families, if they tread wisdom and can be bright and considerate, then calamities and misfortunes cannot reach them.\n\n**Master Su Lü on Trustworthiness**\n\nMaster Su Lü said: Trustworthiness is what the great person values. If Heaven loses trustworthiness, the Three Luminaries are not bright; if Earth loses trustworthiness, the Four Seasons are not completed; if man loses trustworthiness, the Five Virtues do not function. Thus, Master Kong said: \"A great cart has no yoke, a small cart has no crossbar—how can they travel?\" This means that without trustworthiness, man cannot proceed.\n\nZigong asked about governance. The Master said: \"Sufficient food, sufficient arms, and the people’s trust.\"\n\nZigong said: \"If forced to relinquish one of these three, which should be abandoned first?\"\nThe Master said: \"Abandon arms.\"\nZigong said: \"If forced to relinquish one of the remaining two, which should be abandoned first?\"\nThe Master said: \"Abandon food. Since ancient times, all must die; but without the people’s trust, the state cannot stand. In governing a state, trust must never be lost.\n\nIn former times, King You of Zhou faced threats from the Quanrong in the west and the Jiankang in the north. The king and the feudal lords established trust, agreeing that when beacon\n\n**Composed by Zhang Hu, Gentleman for Fostering Service, Probationary Officer of the Court of Judicial Review, Granted the Rank of Court Attendee with Fish-Shaped Pendant**\n\n**On Music**\n*Master Su Lü* said: Music is the harmony of Heaven and Earth and the four seasons. Thus, the tuning of pitch-pipes regulates yin and yang, and the modulation of the five notes orders the four seasons. For this reason, the sage-kings of antiquity established rites and created music to transform the people.\n\nTherefore:\n- The Yellow Emperor’s music was called *Cloud Gate*,\n- Zhuanxu’s *Six Classics*,\n- Emperor Ku’s *Five Blossoms*,\n- Yao’s *Universal Pond*,\n- Shun’s *Great Shao*,\n- Yu’s *Great Xia*,\n- Tang’s *Great Hu*,\n- King Wu’s *Great Martial*—\n\nall eight generations of music, used to manifest their virtue and illuminate their achievements. Thus, Heaven and Earth and the four seasons all submitted to their transformation.\n\nOn the use of the eight sounds, the *Record of Music* states:\n- The sound of bells is resonant; resonance establishes command, command establishes authority, authority establishes martial power. When a noble person hears the sound of bells, they think of martial ministers.\n- The sound of chimes is direct; directness establishes distinction, distinction leads to death. When a noble person hears the sound of chimes, they think of ministers who die defending the frontiers.\n- The sound of strings is mournful; its return establishes integrity, integrity establishes resolve. When a noble person hears the sound of zithers and lutes, they think of ministers of steadfast righteousness.\n- The sound of bamboo is overflowing; overflow establishes assembly, assembly gathers the multitude. When a noble person hears the sound of reed pipes, panpipes, and flutes, they think of ministers who amass and nurture the people.\n- The sound of drums is stirring; stirring establishes movement, movement advances the multitude. When a noble person hears the sound of war drums, they think of generals and commanders.\n\nOn the use of the five notes:\nThe five phases’ sounds regulate the vital qi. The *horn* of spring, with its clarity and depth, mirrors the image of the common people. When spring’s qi is harmonious, the *horn* note is well-tuned. The *Record of Music* says: \"When the *horn* is disordered, there is sorrow—do the people not resent it?\"\nThe *note* of summer, with its clarity, mirrors the image of diligent affairs. When summer’s qi is harmonious, the *note* is well-tuned. The *Record of Music* says: \"When the *note* is disordered, there is grief—are affairs not toilsome?\"\nThe *gong* of late summer, being the largest, mirrors the ruler’s image. The *Record of Music* says: \"When the *gong* is disordered, there is dissipation—is the ruler not arrogant?\"\nThe *shang* of autumn, with its depth, mirrors the image of secondary ministers. When autumn’s qi is harmonious, the *shang* is well-tuned. The *Record of Music* says: \"When the *shang* is disordered, there is perversity—are ministers not corrupt?\"\nThe *yu* of winter, being the clearest, mirrors the image of things refined. When winter’s qi is harmonious, the *yu* is well-tuned. The *Record of Music* says: \"When the *yu* is disordered, there is danger—are resources not exhausted?\"\n\nThese are the uses of the five notes and eight sounds, from which human emotions cannot escape. When used in sacrifices to Heaven and Earth, the celestial spirits descend and the earthly spirits ascend; when used in sacrifices to mountains and rivers, ghosts and spirits draw near; when used to transform the people, the populace is harmonious. Thus, when its measures are observed, music spreads and human relations are clarified, the ears and eyes become keen, the blood and qi are balanced, customs are reformed, and all under Heaven is at peace. When its measures are lost, the licentious music of Zheng and Wei arises, and the lewd airs of Mulberry Grove and Pu Shang spread. Therefore:\n- The music of a well-ordered age is peaceful and joyful, for its governance is harmonious;\n- The music of a disordered age is resentful and angry, for its governance is perverse;\n- The music of a ruined state is mournful and longing, for its people are distressed.\n\nMoreover, clarity is for the ruler, depth for the minister; clarity is yang, depth is yin. When clarity and depth are not disordered, ruler and minister are at peace, and yin and yang follow their proper order. The worthy listen to its sounds and know the state of governance.\n\nYet the Five Emperors, though their eras differed, did not inherit one another’s music; the Three Kings, though their dynasties varied, did not adopt one another’s rites. However, the essence of rites lies in reverence, and the essence of music lies in harmony—reverence and harmony are unchanging across ten thousand generations. Thus, rites restrain excess, and music curbs transgression. When rites are excessive, there is chaos; when music is excessive, there is licentiousness. To regulate music and halt licentiousness is the foundation of proper conduct.\n\n**On Wealth and Nobility**\n*Master Su Lü* said: Wealth and nobility are what all people desire, yet if obtained by improper means, one should not dwell in them. One should cultivate virtue to attain wealth and nobility. When wealth and nobility are obtained, one must maintain fullness and preserve achievement with reverence, frugality, humility, and deference; restrain expenditures and cherish others; master oneself and return to ritual; give without expecting repayment; bestow kindness without wasting resources; not overindulge in dwellings or adornments; in lean years, not be stingy; in abundant years, not be extravagant.\n\nThus, when Guan Zhong engraved his sacrificial vessels with cinnabar and adorned his carriage with mountain and algae patterns, the noble person deemed it excessive. When Yan Pingzhong offered his ancestors a pig’s shoulder that did not fill the dish and attended court in patched robes and a dusty cap, the noble person deemed it miserly. Therefore, the noble person, when in their proper station, practices the Way without transgressing into extravagance or parsimony that violates ritual; does not indulge excessively in music and sensual pleasures; does not greedily seize wealth and property; rejects arrogance and luxury; abandons excessive desires; reduces wine and restrains lust; avoids suspicion and distances doubt; aids others and benefits the people, bringing peace and harmony to the multitude. They constantly maintain a mind of humility and caution, never forgetting the aspirations of loyalty and filial piety.\n\nThe *Daoist Scripture* says: \"One who knows contentment is rich.\"\nThe *Classic of Filial Piety* says: \"Lofty yet not perilous—thus one long preserves nobility; full yet not overflowing—thus one long preserves wealth.\"\nThe *Book of Changes* says: \"The Way of Heaven diminishes the full and augments the humble; the Way of Earth alters the full and flows to the humble; ghosts and spirits harm the full and bless the humble; the Way of Man detests the full and favors the humble. The humble are honored and radiant, lowly yet unassailable.\" It also says: \"The laboriously humble noble person will have a good end.\"\n\n**On Poverty and Lowliness**\n*Master Su Lü* said: Poverty and lowliness are what all people detest, yet if one does not rid oneself of them by improper means, they should not be shunned. A scholar who is devoted to the Way yet ashamed of coarse clothes and poor food is not worth discussing. The noble person worries about the Way, not poverty; does not fear poverty but fears instability.\n\nOf old, the old fisherman and the recluse of the thatched hut were poor yet attained enlightenment. Thus, Zixia’s patched robe, Yuan Xian’s mulberry-wood door pivot, and Yanzi’s single basket of food, single gourd of drink, vegetable fare, and water—resting his head on his bent arm—found joy therein. Zengzi straightened his cap though its strings snapped, put on his shoes though their heels were worn through, adjusted his robe though his elbows showed, and dragged his sandals while singing.\n\nThe *Shang Song* hymns resounded throughout the realm, resonant as metal and stone, such that even the Son of Heaven could not take their masters as ministers, nor could feudal lords claim them as friends. These were men who attained the Way at the cost of their lives, or nurtured their aspirations at the cost of their fates—all of them poor yet rejoicing in the Dao.\n\nSome planted five willows by their gates, or cultivated three mulberry trees in their courtyards, singing as they tapped their horns, chanting as they gathered firewood—all were scholars who trod the path of poverty. The worthy, when employed, returned home bearing only a load of earth; when dismissed, they left behind even their calves, ever distant from the three delusions and early cautious of the four kinds of knowledge. Such were the incorruptible scholars who embraced poverty.\n\nSome forsook gold to preserve treasures, abandoned profit to uphold their words, disdaining the snail’s dwelling yet guarding their thatched huts, drinking water and eating greens, upholding the Way and content in poverty—these were the most virtuous and lofty of scholars. Confucius said: \"He who does not understand fate cannot be a noble person.\" Fate determines one’s rise or fall, and all one can do is delight in Heaven and know one’s destiny. Those who crave courage to despise poverty, or seek gain before wealth, are not true noble persons. To emulate the footsteps of the wise and sagely, one must not be ashamed of a threadbare robe or a humble gate with a jade-like chink.\n\n**Treading Level Ground**\nMaster Plain Tread said: The function of a steelyard lies in its balance; the movement of a cart depends on its ruts. When the balance is level, not even a hair’s breadth is amiss; when the ruts are clear, the axle and hub glide without obstruction. If the steelyard errs by a hair’s breadth, the weights and measures lose their correctness; if the axle and hub are flawed, the cart’s tracks become impassable. To keep the steelyard level, one must be vigilant in the minutest detail; to keep the ruts clear, one must tend to the axle and hub. When not even a hair’s breadth is lost and the axle and hub remain unmarred, this is called the equilibrium of Heaven and the completion of Earth.\n\nThis draws from the *Yi Jing*’s image of Heaven above and marsh below, where the noble person treads to distinguish high and low and settle the people’s aspirations. The utility of treading lies in dwelling in safety while contemplating danger, treading level ground while fearing stumbles. Thus the *Rites* say: \"Accumulate yet be able to disperse; be at ease yet able to adapt.\" This is how the noble person treads level ground while pondering advancement. Master Zhang’s *Plain Book* states: \"One who does not lift the collar of his robe wears it upside down; one who does not watch the ground while walking will stumble.\" If a scholar indulges in idleness, covets wealth and sensuality, craves wine, or harbors private desires, then even level ground will sprout pits and snares, and safe dwellings will harbor peril and ruin.\n\nThus the *Yi Jing* says: \"The noble person, to the end of the day, remains diligent and cautious, as if facing danger.\" It also says: \"Treading the Way with ease, the reclusive person’s steadfastness brings good fortune.\" Therefore the *Odes* say: \"They say Heaven is high—dare I not crouch? They say Earth is thick—dare I not tread?\" All this is like treading thin ice over deep waters—this is the perfection of treading level ground.\n\n**Treading Peril**\nMaster Plain Tread said: In times of *Zhun* and *Meng*, peril and difficulty are ever-present. The *Yi Jing*’s *Image* says: \"Clouds and thunder form *Zhun*—the noble person weaves and orders.\" The first nine: \"Hesitating, it is advantageous to dwell in steadfastness.\" Again, one sees peril beneath the mountain, and halts in danger—this is *Meng*. To retreat is to be trapped in peril; to advance is to be blocked by the mountain. *Meng* is for nurturing correctness—this is the work of the sage.\n\nThe noble person, through resolute action, cultivates virtue. The utility of *Zhun* lies in dwelling in steadfastness; the advantage of *Meng* lies in nurturing correctness. Thus, steadfastness and correctness enable one to traverse peril and difficulty. When Yu Shun lived in obscurity in Zhongyi, his benevolent and filial heart only grew firmer; when the Duke of Zhou went forth to campaign in the east, his loyal and sincere resolve only intensified. Zhan Qin was thrice dismissed yet never ceased his upright ways; Ziwen was thrice relieved of office yet never uttered a resentful word. King Wen was imprisoned in Youli, yet his virtuous power shone ever brighter; Ye Chang was bound in fetters, yet his worthy conduct remained unsullied. Confucius, though besieged in Kuang, never altered his benevolence and sageliness; though distressed in Chen, he never ceased playing his zither.\n\nThe noble person does not rejoice at good fortune nor fear calamity. Unstained by defilement, his pure and white virtue shines ever brighter; uncarved and unyielding, his clear and steadfast integrity grows ever more vigorous. The *Odes* say: \"My heart is not a stone—it cannot be turned; my heart is not a mat—it cannot be rolled up.\" And again: \"Though wind and rain darken the sky, the cock crows on without cease.\" Such were the sages and worthies, who long pondered the *Ode of the Crow and Magpie* and the *Rhapsody of the Roc and Crow*.\n\nYet treading on a tiger’s tail inspires trembling fear; traversing peril and difficulty demands cautious vigilance. The *Yi Jing* says: \"Observe one’s tread and examine its omens—returning thus brings supreme good fortune.\" And again: \"To advance and retreat without losing correctness—is this not the mark of the sage?\" The Way of treading is thus flourishing.\n\n*Plain Tread, Lower Scroll* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "素履子 经名：素履子。 唐账弧撰。 三卷。 底本出处：《正统道藏》太玄部。 参校本：《四库全书》文渊阁本（简称文渊阁本）。 目　录 序 卷上 履道 履德 履忠 履孝 卷中 履仁 履义 履智 履信 履礼 卷下 履乐 履富贵 履贫贱 履平 履危 素履子 经名：素履子。 唐账弧撰。 三卷。 底本出处：《正统道藏》太玄部。 参校本：《四库全书》文渊阁本（简称文渊阁本）。 素履子序 夫素履子者，取《周易》履卦：初九，素履往，无咎。 以纯素为本履，以履行为先，虽衣布素须履先王之政教。 故取天地之始，乾坤之初，圣人设教之规，贤哲行道之迹。 夫祸福之端生于所履，是以圣人以德履帝位而不疚光明者也。 士庶履能辩上下，定民志。 辄修一十四篇，号曰《素履子》，以为箴诚而已。 素履子卷上 将仕郎试大理评事",
      "translated_text": "**Su Lü Zi**\n\n**Scripture Title:** *Su Lü Zi*\nComposed by Zhang Hu of the Tang dynasty. Three juan in total.\nBase text sourced from: *Daoist Canon of the Orthodox Unity*, Tai Xuan Section.\nCollated with: *Complete Library of the Four Treasuries*, Wenyuan Pavilion edition (hereafter referred to as the Wenyuan Pavilion edition).\n\n**Table of Contents**\nPreface\n*Juan* One\n  Treading the Dao\n  Treading Virtue\n  Treading Loyalty\n  Treading Filial Piety\n*Juan* Two\n  Treading Benevolence\n  Treading Righteousness\n  Treading Wisdom\n  Treading Trust\n  Treading Ritual Propriety\n*Juan* Three\n  Treading Joy\n  Treading Wealth and Nobility\n  Treading Poverty and Humility\n  Treading Equanimity\n  Treading Peril\n\n**Su Lü Zi**\n**Scripture Title:** *Su Lü Zi*\nComposed by Zhang Hu of the Tang dynasty. Three juan in total.\nBase text sourced from: *Daoist Canon of the Orthodox Unity*, Tai Xuan Section.\nCollated with: *Complete Library of the Four Treasuries*, Wenyuan Pavilion edition (hereafter referred to as the Wenyuan Pavilion edition).\n\n**Preface to Su Lü Zi**\nThe *Su Lü Zi* takes its name from the *Book of Changes*, Hexagram *Lü* (Treading): \"At the first nine, treading with purity—no blame.\" It takes pure simplicity as the foundation of treading and conduct as its foremost priority. Though clad in plain cloth, one must first tread the governance and teachings of the former kings.\n\nThus, it draws from the origins of Heaven and Earth, the inception of *Qian* and *Kun*, the norms set forth by the sages in their teachings, and the traces of the worthy and wise in their practice of the Dao. The beginnings of fortune and misfortune arise from what one treads. Therefore, the sage treads the imperial throne with virtue and suffers no remorse, for his radiance is luminous. The scholar and commoner tread with discernment to distinguish above and below, thereby stabilizing the people’s will.\n\nHerein, fourteen chapters are compiled and titled *Su Lü Zi*, serving as admonitions and exhortations.\n\n**Su Lü Zi, Juan One**\n*Probationary Gentleman of the Court, Acting Judge of the Court of Judicial Review*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 384,
      "start_sentence": 0,
      "end_sentence": 39,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.093360424041748,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\素履子.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "赐绊鱼袋张弧撰 履道 素履子曰：道本无名，无名居天地之始。 天地之始，号曰混元。 混元之初，无形无象，既分二仪，能生万象。 故云之为道。 初自龙汉，三皇依之设教，五帝依之置治，始於一化，淳朴自然，将明寒暑之期，遂分阴阳之序。 上古圣人履之，无言无教，无心於物，物来归之； 不教於民，民皆仰之。 此则履纯朴皇道也。 画卦之主尝草之君，皆履之而化成。 至於伏牛乘马履之而去强暴，用之而除民害，颛顼履之於忠顺，帝誉履之於清和，唐尧履谦顺之道而垂裳，虞舜履孝悌之道而授让。 此履帝道也。 禹行勤俭之道而治水，汤能恭敬而感天，西伯以至德而称尊，武王以孝道而去虐。 此圣人以王道设教，使老有所终，壮有所用，幼有所长，鳏寡孤独废疾者皆有所养，男有分，女有归。 此以道治世之化也。 至於黄老唯尚朴而不文，素王亦归之於纯素，莫不去华饰而作教，舍文艳以归真，不尚贤使人不争，不贵难得之货使人不盗，责山节藻税之宇，尚卑宫菲食之君。 《道德经》云：吾有三宝，保而持之，一曰慈，二曰俭，三曰不敢为天下先。 此则履道之原也。 兼曰：吾有大患，为吾有身。 及吾无身，吾有何患。 此则至道者亡身履象外之道也。 至於餐霞食气，塞兑转丸，履离尘之道也。 昔鸦夷子在俗教民种植持生之道，竟乘舟而去； 严真人卜肆教人忠孝之道，乃拔宅而升。 此乃大道不器，在物皆有知。 道不虚行，物有玄应，不在高台广厦之问，束林西域之内。 近代淮南高公置延和阁求道，非也。 立身行道之本，未若君睦臣忠，父慈子孝，兄友弟恭，夫顺妻贞，勤俭於家，忠良於国。 昔夏殷文武得道而昌，桀纣幽厉失道而亡。 夫如是道不可舍，得之则昌，失之则亡。 故圣人爱人惠俗施德保位者也。 人之於道，如鱼之在水。 鱼失水则亡，人失道则丧。 牢笼万象，以道治之，为之大道，欲昌其身，宜履而行之，明矣。 屦德 素履子曰：太上贵德。 德者，众善所归，百福所集。 昔舜有膻德而人归之，如蚁擅不慕蚁而蚁慕膻，舜不慕民而民慕德。 文王为西伯，三分天下归周者·二。 西伯之德，犹种竹以待禽，竹不慕禽，禽为鹧所逐而自来投竹； 周不慕民，民为纣所虐而自来投周。 是知德可施，而虐不可肆。 常以好生之德洽于民心，诞敷文德，远方来格。 故古昔帝王皆立德以垂教，五行五帝，在木曰木德，在火曰火德，在土曰土德，在金曰金德，在水曰水德。 五行相生，递相为德。 所以水火金木土谷正德，利用厚生为之九功，立教於万祀。 此，德之用也，德之施也。 无名在物，物皆得之则存，失之则丧。 天若失德，寒暑不时； 地若失德，万物不生； 人若失德，身必将倾。 故大禹谋九功，皋陶谋九德，天下是治。 君以慈爱立德，臣以忠孝成名。 德唯善政，政在养民。 养民之本，在武则有七：禁暴、戢兵、保大、定功、安民、和众、丰财； 文则有五：温、良、恭、俭、让。 恭宽信敏惠，皆归五德。 德也者，能却水火，能感鬼神，狎伏龙蛇，化敷禽兽； 亦能退舍星象，亦能#1整复山河。 桑谷自枯，妖禽亦逝，座蛇之子，舍金之宾，遗药於敌人，驰酒於盗者，舍绝缨之过，成漆身之忠，皆施之於阴功而获阳报。",
      "translated_text": "**Composed by Zhang Hu, Recipient of the Fish-Bag with Purple Tassels**\n\n**Treading the Dao**\n*Su Lü Zi* states: The Dao in its origin is nameless, and in its namelessness abides at the beginning of Heaven and Earth. The beginning of Heaven and Earth is called the *Hunyuan*. At the inception of *Hunyuan*, there was no form, no image. Once the Two Modes divided, they gave birth to the myriad images. Thus, it is called the Dao.\n\nFrom the era of *Longhan* onward, the Three Sovereigns relied upon it to establish their teachings, and the Five Emperors depended on it to govern. It began with a single transformation, pure and natural. To clarify the cycles of cold and heat, the sequence of yin and yang was divided. The sages of high antiquity trod this path: they spoke no words, taught no doctrines, and held no intent toward things, yet things came to them of their own accord. They did not instruct the people, yet the people looked up to them. This was the treading of the pure and pristine royal Dao.\n\nThe lords who first drew the trigrams and the rulers who first cultivated the wilds all trod this path and brought about transformation. When riding oxen and horses, they trod it to dispel tyranny; when employing it, they removed the people’s suffering. Zhuanxu trod the path of loyalty and compliance, Emperor Ku trod the path of clarity and harmony, Tang Yao trod the path of humility and compliance and let his robes hang long, and Yu Shun trod the path of filial piety and fraternal duty and yielded his throne. This was the treading of the imperial Dao.\n\nYu practiced the Dao of diligence and frugality to govern the waters, Tang was reverent and thereby moved Heaven, the Western Earl possessed supreme virtue and was called venerable, and King Wu followed the Dao of filial piety to overthrow cruelty. These sages established teachings through the kingly Dao, ensuring that the elderly had care in their final years, the able-bodied had work, the young had nurture, and the widowed, orphaned, solitary, disabled, and infirm all had sustenance. Men had their duties, and women had their homes. This was the transformation of governing the world through the Dao.\n\nAs for the Yellow Emperor and Laozi, they esteemed only simplicity and eschewed ornamentation; the Uncrowned King likewise returned to pure simplicity. All discarded embellishment to create teachings, forsook literary adornment to return to truth, did not exalt the worthy to prevent contention, and did not prize rare goods to prevent theft. They condemned palaces with carved beams and painted rafters, and honored rulers who dwelt in humble abodes and ate plain fare. The *Daodejing* states: “I possess three treasures, which I safeguard and uphold: the first is compassion, the second is frugality, and the third is not daring to put oneself before the world.” This is the origin of treading the Dao.\n\nIt further says: “My greatest affliction is that I have a self. If I had no self, what affliction would I have?” This is the Dao of the perfected, who forget the self and tread beyond images.\n\nAs for consuming mist and ingesting qi, sealing the senses and revolving the pill, this is the path of treading beyond the dust. Long ago, Master Yayu, while still in the world, taught the people the Dao of cultivation and planting to sustain life, yet in the end he departed by boat. The Perfected Yan, while running a divination stall, taught others the Dao of loyalty and filial piety, then ascended with his entire household. Thus, the Great Dao is not confined to any vessel; all things possess knowledge. The Dao does not act in vain; things respond mysteriously. It is not found in lofty towers or vast halls, nor within the groves of the Western Regions.\n\nIn recent times, the High Lord of Huainan established the Hall of Extended Harmony to seek the Dao—this was mistaken. The foundation of establishing oneself and practicing the Dao does not surpass the harmony of ruler and minister, the kindness of father and filial piety of son, the friendliness of elder brother and deference of younger brother, the compliance of husband and chastity of wife, diligence and frugality in the household, and loyalty to the state.\n\nIn ancient times, the Xia, Yin, Wen, and Wu dynasties flourished because they attained the Dao, while Jie, Zhou, You, and Li perished because they lost it. Thus, the Dao cannot be abandoned: attaining it brings prosperity, losing it brings ruin. Therefore, the sage cherishes the people, benefits customs, bestows virtue, and preserves his position.\n\nMan’s relation to the Dao is like a fish’s to water. If the fish loses water, it perishes; if man loses the Dao, he is ruined. Encompassing the myriad images and governing them through the Dao—this is the Great Dao. To prosper one’s person, one should tread and practice it. This is clear.\n\n**Treading Virtue**\n*Su Lü Zi* states: The Most High values virtue. Virtue is the convergence of all goodness and the gathering of a hundred blessings. Long ago, Shun possessed the virtue of fragrance, and the people flocked to him like ants drawn to sweetness—not that the ants sought the ants, but that the ants sought the fragrance; not that Shun sought the people, but that the people sought virtue.\n\nWhen King Wen was the Western Earl, two-thirds of the world turned to Zhou. The virtue of the Western Earl was like planting bamboo to await birds: the bamboo did not seek the birds, but the birds, pursued by pheasants, came of their own accord to the bamboo. Zhou did not seek the people, but the people, oppressed by Zhou, came of their own accord to Zhou. Thus, it is known that virtue can be bestowed, while cruelty cannot be indulged.\n\nConstantly applying the virtue of cherishing life to harmonize the people’s hearts, spreading civil virtue far and wide, distant lands will come to submit. Therefore, the emperors and kings of ancient times all established virtue to bequeath teachings. Among the Five Phases and Five Emperors, in wood it is called the virtue of wood, in fire the virtue of fire, in earth the virtue of earth, in metal the virtue of metal, and in water the virtue of water. The Five Phases engender one another, each in turn becoming virtue.\n\nThus, water, fire, metal, wood, earth, and grain rectify virtue, their beneficial use enriching life—these are the Nine Merits, teachings established for ten thousand generations. This is the application of virtue, the bestowal of virtue. Without name, it resides in things: if all things attain it, they endure; if they lose it, they perish. If Heaven loses virtue, cold and heat will not arrive in season; if Earth loses virtue, the myriad things will not grow; if man loses virtue, his person will surely collapse.\n\nThus, Great Yu deliberated on the Nine Merits, and Gaoyao deliberated on the Nine Virtues, and the world was governed. The ruler establishes virtue through compassion and love, the minister achieves renown through loyalty and filial piety. Virtue lies in good governance, and governance lies in nurturing the people. The foundation of nurturing the people in martial affairs consists of seven: prohibiting violence, suppressing weapons, safeguarding the great, establishing merit, pacifying the people, harmonizing the masses, and enriching resources. In civil affairs, it consists of five: warmth, kindness, reverence, frugality, and deference. Reverence, magnanimity, trustworthiness, diligence, and kindness all return to the Five Virtues.\n\nVirtue can repel water and fire, move ghosts and spirits, tame dragons and serpents, and transform birds and beasts. It can also cause stars and constellations to retreat, and restore mountains and rivers. Mulberry and catalpa trees wither of themselves, ominous birds depart, the offspring of nest-serpents abandon their gold, and guests leave behind their medicines. It forgives the offense of the severed tassel, and fulfills the loyalty of the lacquered body. All these are bestowed as hidden merits and receive manifest rewards.",
      "overlap_context": "gs of fortune and misfortune arise from what one treads. Therefore, the sage treads the imperial throne with virtue and suffers no remorse, for his radiance is luminous. The scholar and commoner tread with discernment to distinguish above and below, thereby stabilizing the people’s will.\n\nHerein, fourteen chapters are compiled and titled *Su Lü Zi*, serving as admonitions and exhortations.\n\n**Su Lü Zi, Juan One**\n*Probationary Gentleman of the Court, Acting Judge of the Court of Judicial Review*",
      "start_char": 384,
      "end_char": 1605,
      "start_sentence": 40,
      "end_sentence": 100,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.420053482055664,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\素履子.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "夫如是宜施之於万类，不可失之於一言。 天道无亲，唯德是辅。 有国有家，幸其履之，瞬息无倦，昌矣盛矣。 履忠 素履子曰：忠贞者，天地之秀气，人伦之英灵。 凡观历世之书，唯忠实者名挂史笔，万世常存，则亡之忠者不灭亡也。 #2昔周公至忠，事文王武王至成王，成王自褪褓事之，於三世尽忠，金玉莫比其坚，松竹莫比其操。 至於祝九龄之寿，乃自剪为性，托六尺之孤，遂去管蔡之佞。 事虽往古，行迹常新，列於典籍之中，常为贤哲之范。 太公行王风而治周室，主霸典而灭纣邦。 二人夹辅於周，功业垂於万祀。 复闻管仲相桓公，一匡天下以尊周，子房佐刘氏，统洪沟以兴汉。 至於召四皓而回惠帝，抱幼主而朝诸侯，亦有卧尸折槛之士，碎首投擭之臣，今古所推，实谓忠节。 若指鹿为马，以玄为黄，胁弱欺孤，废贤夺义，生则舂喉鸾肉，没为后世责嫌，污辱二仪之中，滥这三才之内。 是知忠贤宜旌之不朽，为今世间杰，来世美谈。 《诗》曰：淑人君子，其仪不武。 贤者履之盛矣。 履孝 素履子曰：经云：夫孝，天之经也，地之义也，人之行也。 兼曰：夫孝，德之本，教之所由生。 治国治家者，立德为先。 立德之本，孝之为始。 昔舜禹有至德至孝存身，立德而成，皆以孝行，舜让而尊。 故云：先王有至德要道以顺天下，民用和睦，上下无怨，孝之始#3也。 孝感天地，应乎神明。 天子孝，龟龙负图； 庶人孝，草木荣茂。 昔曾子孝父母，身体发肤不敢毁伤，至于终身畦步之问不忘孝道义利。 一切禽兽草木取之以时，不违天道，竭力尽忠。 此为孝子之志也。 夫人有百行，不孝者如玉屑盈匣，终无用也。 能行孝道者，自然神明上生，天帝添等，身安事吉，荣显於时。 幸君子履之，保百福矣。 素履子卷上竟 ＃１『能』原作『熊』，据文渊阁本改。 ＃２『则亡之忠者不灭亡也』文渊阁本作『则夫不忠者必灭亡也』。 ＃３『始』原作谓，据文渊阁本改。 素履子卷中",
      "translated_text": "Thus it is fitting to extend this to all things, never failing even in a single word. The Dao of Heaven shows no partiality, aiding only those who possess virtue. For those who govern states or households, fortunate are they who tread this path—if they remain steadfast without weariness, prosperity and flourishing shall be theirs.\n\n**Treading Loyalty**\nMaster Su Lü said: Loyalty and integrity are the essence of Heaven and Earth, the finest spirit of human relations. In examining the records of past ages, only those of true loyalty have their names inscribed in history, enduring through ten thousand generations—thus, those who perish in loyalty do not truly perish. In ancient times, the Duke of Zhou exemplified utmost loyalty, serving King Wen, King Wu, and King Cheng. Even when King Cheng was but an infant in swaddling clothes, the Duke served three reigns with unwavering devotion, his steadfastness surpassing gold and jade, his integrity exceeding pine and bamboo. To prolong his life to ninety years, he offered himself in sacrifice, entrusting the young orphan to safety, and thereby removed the slander of Guan and Cai. Though his deeds belong to antiquity, his conduct remains ever fresh, recorded in the classics as a model for the wise and worthy. The Grand Duke governed Zhou with royal virtue, wielding the authority of hegemony to overthrow the Shang. Together, these two ministers flanked and aided Zhou, their achievements enduring through ten thousand generations. Again, we hear of Guan Zhong assisting Duke Huan, unifying the realm to honor Zhou, and Zhang Liang aiding the Liu clan, bridging the Honggou to restore Han. As for summoning the Four Elders to sway Emperor Hui, or embracing the young sovereign to receive the feudal lords—there were also those who lay across corpses to remonstrate, or shattered their skulls against pillars in protest. Through past and present, such men are revered as paragons of loyalty. But those who call a deer a horse, invert black and yellow, coerce the weak, and deceive the orphaned—who depose the worthy and usurp righteousness—shall feast on phoenix flesh in life and incur eternal reproach in death, defiling the Two Modes and trespassing within the Three Powers. Thus, the loyal and worthy deserve eternal commemoration, becoming exemplars for this age and glorious tales for the next. As the *Book of Songs* says: *\"The virtuous man, the noble lord—his conduct is never flawed.\"* How flourishing is it for the worthy to tread this path!\n\n**Treading Filial Piety**\nMaster Su Lü said: The classics state: *\"Filial piety is the constant Dao of Heaven, the righteous principle of Earth, and the conduct of humanity.\"* It is also said: *\"Filial piety is the root of virtue, the source from which teaching arises.\"* For those who govern states or households, establishing virtue comes first, and the foundation of virtue begins with filial piety. In ancient times, Shun and Yu possessed supreme virtue and utmost filial piety, preserving their persons and perfecting their virtue—both achieved this through filial conduct, and Shun’s yielding brought him honor. Thus it is said: *\"The former kings had supreme virtue and essential Dao to harmonize the world; the people lived in concord, and none above or below harbored resentment—this was the beginning of filial piety.\"* Filial piety moves Heaven and Earth, resonating with the divine. When the Son of Heaven is filial, the tortoise and dragon bear prophetic charts; when a commoner is filial, grasses and trees flourish. In the past, Master Zeng was filial to his parents, never daring to harm even his hair or skin, and until the end of his life, he never forgot the principles of filial piety, even in the space of a single step. He took from birds, beasts, grasses, and trees only in due season, never violating the Dao of Heaven, and exhausted his strength in loyal devotion. Such was the resolve of a filial son. Among the hundred virtues of humanity, one who lacks filial piety is like a casket filled with jade fragments—ultimately of no use. Those who practice filial piety naturally ascend in spirit, their rank elevated by the Heavenly Emperor, their persons secure and affairs auspicious, bringing honor and prominence in their time. Fortunate is the noble person who treads this path, preserving a hundred blessings.\n\nHere ends the first scroll of *Master Su Lü*.",
      "overlap_context": "move ghosts and spirits, tame dragons and serpents, and transform birds and beasts. It can also cause stars and constellations to retreat, and restore mountains and rivers. Mulberry and catalpa trees wither of themselves, ominous birds depart, the offspring of nest-serpents abandon their gold, and guests leave behind their medicines. It forgives the offense of the severed tassel, and fulfills the loyalty of the lacquered body. All these are bestowed as hidden merits and receive manifest rewards.",
      "start_char": 1605,
      "end_char": 2373,
      "start_sentence": 101,
      "end_sentence": 138,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.602044105529785,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\素履子.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "将仕郎试大理评事 赐徘鱼袋张弧撰 履仁 素履子曰：古者尝草之君教民粒食而止杀，至仁之化也。 黄帝为民除害，杀蚩尤，至仁之教也。 大罗氏作网罟，除禽兽之害，至仁之用也。 尧舜用八元八凯，明四目，达四聪，至仁之治也。 禹凿龙门，去水害，至仁之功也。 汤去三面罗，至仁之政也。 文王葬枯骨，至仁之惠也。 纣失仁，武王杀之，饰微子之墟，舍箕子之囚，封比干之墓，乃得赤雀衔书之瑞云，仁得之，仁守之，福瘾百代。 天使人君用仁守国，故罪己泣辜，吞蝗咽蛭，所以兴也。 秦不仁，焚书坑儒，身没沙丘，不及二代，子婴为刘项所竞。 汉履仁约法，舍子婴而得天下； 楚不仁暴物，杀子婴而失天下。 是知履仁为兴国之本，故可履之。 孔圣云：仁者爱人。 亦曰：好生恶杀为仁，爱人利物为仁，克己复礼为仁，慈惠恻隐为仁。 赏善罚恶，拯溺救危，皆仁人之履也。 士有杀身以成仁，亡命以成仁。 设食於翳桑，板筑於危径； 或救黄雀，或放白龟； 惠封於伤蛇，探喉於梗虎； 博施无倦，惠爱有方。 春不伐树覆巢，夏不燎田伤禾，秋赈孤恤寡，冬覆盖伏藏。 君子顺时，履仁而行，仁功着矣。 《易》曰：天地之大德曰生，圣人之大宝曰位。 又曰：君子体仁，足以长人。 唯至贤履之，无倦而已。 履义 素履子曰：理财正辞，禁民为非，曰义。 所以义者，不竞於物而物自归之。 孔子曰：义，然后取人，不厌其取。 昔周太王之太子曰太伯，大王有疾，太伯义让其位，乃为父采药而不返。 后季历立封太伯於昊。 夫有义必能让，能让必能和。 王者履义让，必能和协万邦，赏善罚恶，立功立事，以义除不义。 昔者桀惑於妹喜，亡义而丧德； 纣好姐己，失义而害忠贤； 周幽王宠褒姒，乖义而失诸侯。 晋献公悦骊姬而终失义於世子。 郑庄姜宠过致叔段不悌。 庞涓疾贤，死为不义之友。 罗敷沈河，鲁胡永为乖义之夫。 三闲溺於汨罗，楚淮王为不义之主。 子胥得洗纱女，终成守义之贤士。 有触槐刎颈烟目漆身之义，管鲍陈雷立义名标前史。 是知义不可不履而不可乖。 孔子云：不义而富且贵，於我如浮云。 先圣贱不义也。 若不义而死，舍义而生，则浪生死矣。 是不贤也。 能义和骨肉昆弟，在物以义履之，有何争哉。 故君子义以为质，履而行之，固无乖矣。 履智 素履子曰：夫智者，五行之德水。 水以润下为德，智以谋虑为能。 智不能虑无以为能，水不能润无以为德。 是以水流不止，智用无滞。 水混则浊，智挠则乱； 浊则不能鉴，乱则不能虑。 未若止水而能清，定智而能明，水止智定则清且明矣。 如水决流不止则浸渍以成弊，智用不端则惑乱以招祸。 夫贤者用智能周万类，若夫镜之鉴物，妍丑俱见。 其中如朗月之当空，泉沼皆临其内。 观照遐迩，明辨是非，知众之苦辛，臧己之逸乐，齐饱暖於一体，虑寒馁於四人。 故能运智而佐帝王，设虑以防奸弊。 所以子房陈平智周而成，商鞅苏秦智讹而辑。 夫有国有家者，履智而能明能虑，则祸患弗可及也。 履信 素履子曰：信之为大人所重焉。 天失信，三光不明； 地失信，四时不成； 人失信，五德不行。 故孔宣父云：大车无挽，小车无軏，其何以行之哉。 谓人无信，不可行也。",
      "translated_text": "**Composed by Zhang Hu, Gentleman for Court Service, Probationary Officer of the Court of Judicial Review, Granted the Rank of Daiyu Belt**\n\n**Master Su Lü on Benevolence**\n\nMaster Su Lü said: In ancient times, the sovereigns who tasted herbs taught the people to eat grains and cease killing—this was the transformation of utmost benevolence. The Yellow Emperor removed harm from the people by slaying Chiyou—this was the teaching of utmost benevolence. The Great Luo clan crafted nets and traps to eliminate the harm of birds and beasts—this was the application of utmost benevolence. Yao and Shun employed the Eight Yuan and Eight Kai, illuminating the four directions and penetrating the four quarters—this was the governance of utmost benevolence. Yu carved Dragon Gate to dispel the harm of floods—this was the achievement of utmost benevolence. Tang removed the three-sided nets—this was the policy of utmost benevolence. King Wen buried the dry bones—this was the kindness of utmost benevolence.\n\nZhou lost benevolence, so King Wu slew him, adorned the ruins of Weizi, released Jizi from prison, and sealed the tomb of Bigan. Thereupon, the auspicious omen of the red sparrow bearing a book appeared. Benevolence was attained, benevolence was preserved, and blessings overflowed for a hundred generations. Heaven commands the lord of men to govern the state with benevolence. Thus, he confesses his faults and weeps for the guilty, swallows locusts and gnats—this is how he flourishes.\n\nQin was not benevolent: it burned books and buried scholars alive, and its ruler perished at Shaqiu, not lasting two generations before Ziying was contested by Liu and Xiang. Han practiced benevolence and frugality, spared Ziying, and gained the world. Chu was not benevolent, cruel to all things, killed Ziying, and lost the world. Thus, we know that practicing benevolence is the foundation of a flourishing state—therefore, it may be trodden.\n\nThe Sage Confucius said: \"The benevolent love others.\" He also said: \"To delight in life and detest killing is benevolence; to love others and benefit all things is benevolence; to master oneself and return to ritual is benevolence; to be compassionate and commiserate is benevolence.\" Rewarding the good and punishing the evil, rescuing the drowning and saving the imperiled—these are the steps of the benevolent.\n\nScholars have died to perfect benevolence, fled to perfect benevolence. They set out food beneath the mulberry’s shade, built walls on perilous paths; some saved yellow sparrows, some released white turtles; bestowed kindness upon wounded snakes, extracted thorns from choking tigers; bestowed boundless charity without weariness, distributed kindness with method. In spring, they did not fell trees or overturn nests; in summer, they did not burn fields or harm crops; in autumn, they relieved orphans and aided widows; in winter, they covered and concealed the hidden. The noble person follows the seasons, treads benevolence, and acts—thus, the merit of benevolence is manifest.\n\nThe *Book of Changes* says: \"The great virtue of Heaven and Earth is called life; the great treasure of the sage is called position.\" It also says: \"The noble person embodies benevolence, and this suffices to lead others.\" Only the utmost worthy treads this path without weariness.\n\n**Master Su Lü on Righteousness**\n\nMaster Su Lü said: Managing wealth and rectifying speech, forbidding the people from wrongdoing—this is called righteousness. Thus, righteousness does not contend with things, yet things naturally submit to it. Confucius said: \"Only after righteousness does one take from others, and one is not sated in taking.\"\n\nIn former times, the eldest son of King Tai of Zhou was named Taibo. When the Great King fell ill, Taibo, out of righteousness, yielded his position. He went to gather medicine for his father and never returned. Later, King Ji established Taibo in Wu. One who is righteous must be able to yield; one who can yield must be able to harmonize. The king who treads righteousness and yielding must be able to harmonize the myriad states, reward the good and punish the evil, establish merit and accomplish deeds, and use righteousness to eliminate the unrighteous.\n\nIn former times, Jie was infatuated with Mo Xi and lost righteousness, thereby forfeiting virtue. Zhou was enamored of Daji and lost righteousness, thereby harming loyal worthies. King You of Zhou favored Bao Si, deviated from righteousness, and lost the feudal lords. Duke Xian of Jin delighted in Li Ji and ultimately lost righteousness toward his heir. Lady Zhuang Jiang of Zheng, in her excessive favor, caused Shu Duan to be unfilial. Pang Juan was jealous of the worthy and died as an unrighteous friend. Luo Fu drowned in the river, and Lu Hu forever became a husband who deviated from righteousness. Qu Yuan drowned in the Miluo, and King Huai of Chu became an unrighteous lord. Wu Zixu was aided by the washerwoman, and ultimately became a worthy scholar who upheld righteousness. There were those who struck the locust tree and cut their throats, who burned their eyes and lacquered their bodies in righteousness—Guan and Bao, Chen and Lei established righteous names that adorned the former histories.\n\nThus, we know that righteousness cannot be untrodden and cannot be deviated from. Confucius said: \"Wealth and honor obtained through unrighteousness are to me like floating clouds.\" The former sages despised the unrighteous. If one dies through unrighteousness or abandons righteousness to live, then one treats life and death lightly—this is not worthy. One who can harmonize bones and flesh, brothers and kin, and treads righteousness in all things—what contention could there be? Therefore, the noble person takes righteousness as his essence, treads it, and acts—thus, there is surely no deviation.\n\n**Master Su Lü on Wisdom**\n\nMaster Su Lü said: Wisdom is the virtue of water among the Five Phases. Water takes moistening and descending as its virtue; wisdom takes planning and consideration as its ability. Without consideration, wisdom has no ability; without moistening, water has no virtue. Thus, water flows without ceasing, and wisdom is used without obstruction. When water is turbid, it cannot reflect; when wisdom is disturbed, it cannot consider. It is not like still water that can be clear, settled wisdom that can be bright—when water is still and wisdom is settled, they are both clear and bright.\n\nIf water bursts its banks and does not cease, it will soak and cause harm; if wisdom is used improperly, it will confuse and invite disaster. The worthy employ wisdom to encompass the myriad things, like a mirror that reflects objects—beauty and ugliness are both seen. Within, it is like the bright moon in the sky, with springs and ponds all reflecting its light. It observes and illuminates the distant and near, clearly distinguishing right and wrong, knowing the hardships of the multitude, treasuring one’s own ease and joy, equalizing warmth and fullness in one body, and considering cold and hunger for the four peoples. Thus, it can employ wisdom to assist emperors and kings, devise plans to prevent treachery and harm.\n\nTherefore, Zhang Liang and Chen Ping’s wisdom was comprehensive and they succeeded; Shang Yang and Su Qin’s wisdom was deceptive and they perished. Those who possess states and families, if they tread wisdom and can be bright and considerate, then calamities and misfortunes cannot reach them.\n\n**Master Su Lü on Trustworthiness**\n\nMaster Su Lü said: Trustworthiness is what the great person values. If Heaven loses trustworthiness, the Three Luminaries are not bright; if Earth loses trustworthiness, the Four Seasons are not completed; if man loses trustworthiness, the Five Virtues do not function. Thus, Master Kong said: \"A great cart has no yoke, a small cart has no crossbar—how can they travel?\" This means that without trustworthiness, man cannot proceed.",
      "overlap_context": "ion. Such was the resolve of a filial son. Among the hundred virtues of humanity, one who lacks filial piety is like a casket filled with jade fragments—ultimately of no use. Those who practice filial piety naturally ascend in spirit, their rank elevated by the Heavenly Emperor, their persons secure and affairs auspicious, bringing honor and prominence in their time. Fortunate is the noble person who treads this path, preserving a hundred blessings.\n\nHere ends the first scroll of *Master Su Lü*.",
      "start_char": 2373,
      "end_char": 3603,
      "start_sentence": 139,
      "end_sentence": 214,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.81917595863342,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\素履子.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "子贡问政，子曰：足食．足兵，民信之矣。 子贡曰：必不得已而去，於斯三者何先。 曰：去兵。 曰：必不得已而去，於斯二者何先。 曰：去食。 自古皆有死，民无信不立，治邦不可失信。 昔周幽王西患犬戎，北患捡抗，王与诸侯立信，约举烽击鼓，则诸侯救。 至褒姒戏而举之，诸侯皆至，无寇，乃是妃后戏耳。 后犬戎逼王城，举烽火击鼓召诸侯，诸侯皆言妃后戏耳，遂不至，幽王乃为犬戎所杀。 此戏而失信之故也。 故齐桓不遗曹翩之盟，晋文舍原以示信，俱为霸主，诸侯皆从之。 所以不乖竹马之期，不爽虞人之约，王者履信则神龟见矣。 故用人之智去其诈，用人之勇去其怒，用人之仁去其贪，用智者之谋，勇者之断，仁者之施，足以成治矣。 诈害民信，怒害民恩，贪害民财，三害乱之原也。 是知可终身而守约，不可斯须而失信。 《易》云：天所助者顺也，人所助者信也。 君子仗忠信而为甲冑，履之无爽矣。 履礼 素履子曰：礼者，天地四时之正黑，人伦三纲之端首。 在物皆敬，於人必周，故能定亲疏央嫌疑，别同异明是非。 守道立德履之，方成教训，正俗履之，方备央争讼辨是非； 君臣上下、父子兄弟、军旅征伐、祭祀鬼神履之，方成其政教。 郊天杞地，礼之为大经所备焉。 夫父慈子孝，兄良弟悌，夫义妇听，长惠幼顺，君仁臣忠之道，礼之本也。 士唯履之，无暂乖失，无小大，无众寡，无敢慢。 故君子正其衣冠，尊其瞻视，望之俨然，即之也温，听其言也厉，无欺暗室，不愧屋漏。 明则有礼乐，幽则有鬼神。 是以贤者昏行不变节，夜浴不改容，唯礼唯敬。 履之则安，失之则危。 《诗》曰：相鼠有体，人而无礼。 人而无礼，胡不遗死。 《易》曰：藉用白茅，礼敬之至也。 素履子卷中 素履子卷下",
      "translated_text": "Zigong asked about governance. The Master said: \"Sufficient food, sufficient arms, and the people’s trust.\"\n\nZigong said: \"If forced to relinquish one of these three, which should be abandoned first?\"\nThe Master said: \"Abandon arms.\"\nZigong said: \"If forced to relinquish one of the remaining two, which should be abandoned first?\"\nThe Master said: \"Abandon food. Since ancient times, all must die; but without the people’s trust, the state cannot stand. In governing a state, trust must never be lost.\n\nIn former times, King You of Zhou faced threats from the Quanrong in the west and the Jiankang in the north. The king and the feudal lords established trust, agreeing that when beacon",
      "overlap_context": "isfortunes cannot reach them.\n\n**Master Su Lü on Trustworthiness**\n\nMaster Su Lü said: Trustworthiness is what the great person values. If Heaven loses trustworthiness, the Three Luminaries are not bright; if Earth loses trustworthiness, the Four Seasons are not completed; if man loses trustworthiness, the Five Virtues do not function. Thus, Master Kong said: \"A great cart has no yoke, a small cart has no crossbar—how can they travel?\" This means that without trustworthiness, man cannot proceed.",
      "start_char": 3603,
      "end_char": 4284,
      "start_sentence": 215,
      "end_sentence": 248,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.273372411727905,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\素履子.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "将仕郎试大理评事 赐徘鱼袋张弧撰 屦乐 素履子曰：夫乐者，天地四时之和也，故律吕调财阴阳和，五音调则四时叔。 是故古昔帝王制礼作乐以化民也。 是以黄帝曰云门，颛顼曰六经，帝誉曰五英，尧曰咸池，舜曰大韶，禹曰大夏，汤曰大濩，武王曰大武，皆八代之乐也。 用彰其德，以明其功。 故天地四时皆顺从其化。 夫八声之用，《乐记》曰：锺声铿，铿以立号，号以立横，横以立武。 君子听锺声，则思武臣。 石声径，径以立别，别以致死。 君子听磬声，则思死封疆之臣。 丝声哀，一反以立廉，廉以立志。 君子听琴瑟之声，则思志义之臣。 竹声滥，滥以立会，会以聚众。 君子听竽笙箫管之声，则思畜聚之臣。 鼙鼓之声谁，谁以立动，动以进众。 君子听鼙鼓之声，则思将帅之臣。 五音之用也，五行之音以调正气，春之角以其清浊，中人之象。 春气和，则角声调。 《乐记》曰：角乱则忧，其民怨也？ 夏之征，以其征，清事之象也。 夏气和，则征声调。 《乐记》曰：征乱则哀，其事勤也。 季夏之宫，以其最大。 《乐记》曰：宫乱则荒，其君骄也。 秋之商，以其浊，中次宫臣之象也。 秋气和，则商声调。 《乐记》曰：商乱则陂，其臣坏也。 冬之羽，以其最，清物之象也。 冬气和，则羽声调。 《乐记》曰：羽乱则危，其财匮也。 此五音八声之用也，所以人情不能免也。 用之祭天地，乃天神降地只升； 用之祭山川，则鬼神向； 用之化人，则人民和。 故得其节，则乐行而伦清，耳目聪明，血气和平，移风易俗，天下皆宁。 用失其节，则郑卫之音作，桑问濮上之风行。 所以治世之音安以乐，其政和； 乱世之音怨以怒，其政乖； 亡国之音哀以思，其民困。 又清为君，浊为臣； 清为阳，浊为阴。 清浊不乱，君臣和平，阴阳顺序。 贤者听其音而知其治。 然五帝殊时不相沿乐，三王异代不相袭礼。 至於礼情主敬，乐情主和，敬之与和，万代不易。 是以礼节之於繁，乐节之於过。 礼繁则乱，乐过则淫。 节乐止淫，履之本也。 屦富贵 素履子曰：富与贵是人之所欲，不以其道得之不处也。 当修德而取富贵。 得富贵也，持盈守成，恭俭谦让； 节用而爱人，克己而复礼； 施而不望报，惠而不费财； 不滥其居，不饰其服； 遇凶年不俭，遇丰岁不奢。 是以管仲镂篡朱，弦山节藻税，君子以为滥； 晏平仲祀其先人豚肩不掩豆，瀚衣弹冠以朝，君子以为隘。 则君子当其位行其道，不逾越而奢侈，不俭陋而乖礼，不过淫於声色，不贪暴於货财，绝骄奢，去耽嗜，贬酒阙色，避嫌远疑，济物利，人安民和众，常守谦慎之心，不忘忠孝之志。 《道经》云：知足者富。 《孝经》曰：高而不·危所以长守贵，满而不溢所以长守富。 《易》曰：天道亏盈而益谦，地道变盈而流谦，鬼神害盈而福谦，人道恶盈而好谦。 谦尊而光，卑而不可逾。 又曰：劳谦君子，有终吉。 履贫贱 素履子曰：贫与贱是人之所恶，不以其道得之不去也。 士志於道而耻恶衣恶食者，未足与议也。 君子忧道不忧贫，不患贫而患不安。 昔钓鱼之叟、蓬岩之士贫而遂通。 故贤子夏之鹑衣，原宪之桑枢，颜子一箪食，一瓢饮，饭蔬食饮水，曲肱而枕之，乐亦在其中矣。 曾子正冠而缨断，纳履而踵决，整襟而肘见，曳屦而歌。",
      "translated_text": "**Composed by Zhang Hu, Gentleman for Fostering Service, Probationary Officer of the Court of Judicial Review, Granted the Rank of Court Attendee with Fish-Shaped Pendant**\n\n**On Music**\n*Master Su Lü* said: Music is the harmony of Heaven and Earth and the four seasons. Thus, the tuning of pitch-pipes regulates yin and yang, and the modulation of the five notes orders the four seasons. For this reason, the sage-kings of antiquity established rites and created music to transform the people.\n\nTherefore:\n- The Yellow Emperor’s music was called *Cloud Gate*,\n- Zhuanxu’s *Six Classics*,\n- Emperor Ku’s *Five Blossoms*,\n- Yao’s *Universal Pond*,\n- Shun’s *Great Shao*,\n- Yu’s *Great Xia*,\n- Tang’s *Great Hu*,\n- King Wu’s *Great Martial*—\n\nall eight generations of music, used to manifest their virtue and illuminate their achievements. Thus, Heaven and Earth and the four seasons all submitted to their transformation.\n\nOn the use of the eight sounds, the *Record of Music* states:\n- The sound of bells is resonant; resonance establishes command, command establishes authority, authority establishes martial power. When a noble person hears the sound of bells, they think of martial ministers.\n- The sound of chimes is direct; directness establishes distinction, distinction leads to death. When a noble person hears the sound of chimes, they think of ministers who die defending the frontiers.\n- The sound of strings is mournful; its return establishes integrity, integrity establishes resolve. When a noble person hears the sound of zithers and lutes, they think of ministers of steadfast righteousness.\n- The sound of bamboo is overflowing; overflow establishes assembly, assembly gathers the multitude. When a noble person hears the sound of reed pipes, panpipes, and flutes, they think of ministers who amass and nurture the people.\n- The sound of drums is stirring; stirring establishes movement, movement advances the multitude. When a noble person hears the sound of war drums, they think of generals and commanders.\n\nOn the use of the five notes:\nThe five phases’ sounds regulate the vital qi. The *horn* of spring, with its clarity and depth, mirrors the image of the common people. When spring’s qi is harmonious, the *horn* note is well-tuned. The *Record of Music* says: \"When the *horn* is disordered, there is sorrow—do the people not resent it?\"\nThe *note* of summer, with its clarity, mirrors the image of diligent affairs. When summer’s qi is harmonious, the *note* is well-tuned. The *Record of Music* says: \"When the *note* is disordered, there is grief—are affairs not toilsome?\"\nThe *gong* of late summer, being the largest, mirrors the ruler’s image. The *Record of Music* says: \"When the *gong* is disordered, there is dissipation—is the ruler not arrogant?\"\nThe *shang* of autumn, with its depth, mirrors the image of secondary ministers. When autumn’s qi is harmonious, the *shang* is well-tuned. The *Record of Music* says: \"When the *shang* is disordered, there is perversity—are ministers not corrupt?\"\nThe *yu* of winter, being the clearest, mirrors the image of things refined. When winter’s qi is harmonious, the *yu* is well-tuned. The *Record of Music* says: \"When the *yu* is disordered, there is danger—are resources not exhausted?\"\n\nThese are the uses of the five notes and eight sounds, from which human emotions cannot escape. When used in sacrifices to Heaven and Earth, the celestial spirits descend and the earthly spirits ascend; when used in sacrifices to mountains and rivers, ghosts and spirits draw near; when used to transform the people, the populace is harmonious. Thus, when its measures are observed, music spreads and human relations are clarified, the ears and eyes become keen, the blood and qi are balanced, customs are reformed, and all under Heaven is at peace. When its measures are lost, the licentious music of Zheng and Wei arises, and the lewd airs of Mulberry Grove and Pu Shang spread. Therefore:\n- The music of a well-ordered age is peaceful and joyful, for its governance is harmonious;\n- The music of a disordered age is resentful and angry, for its governance is perverse;\n- The music of a ruined state is mournful and longing, for its people are distressed.\n\nMoreover, clarity is for the ruler, depth for the minister; clarity is yang, depth is yin. When clarity and depth are not disordered, ruler and minister are at peace, and yin and yang follow their proper order. The worthy listen to its sounds and know the state of governance.\n\nYet the Five Emperors, though their eras differed, did not inherit one another’s music; the Three Kings, though their dynasties varied, did not adopt one another’s rites. However, the essence of rites lies in reverence, and the essence of music lies in harmony—reverence and harmony are unchanging across ten thousand generations. Thus, rites restrain excess, and music curbs transgression. When rites are excessive, there is chaos; when music is excessive, there is licentiousness. To regulate music and halt licentiousness is the foundation of proper conduct.\n\n**On Wealth and Nobility**\n*Master Su Lü* said: Wealth and nobility are what all people desire, yet if obtained by improper means, one should not dwell in them. One should cultivate virtue to attain wealth and nobility. When wealth and nobility are obtained, one must maintain fullness and preserve achievement with reverence, frugality, humility, and deference; restrain expenditures and cherish others; master oneself and return to ritual; give without expecting repayment; bestow kindness without wasting resources; not overindulge in dwellings or adornments; in lean years, not be stingy; in abundant years, not be extravagant.\n\nThus, when Guan Zhong engraved his sacrificial vessels with cinnabar and adorned his carriage with mountain and algae patterns, the noble person deemed it excessive. When Yan Pingzhong offered his ancestors a pig’s shoulder that did not fill the dish and attended court in patched robes and a dusty cap, the noble person deemed it miserly. Therefore, the noble person, when in their proper station, practices the Way without transgressing into extravagance or parsimony that violates ritual; does not indulge excessively in music and sensual pleasures; does not greedily seize wealth and property; rejects arrogance and luxury; abandons excessive desires; reduces wine and restrains lust; avoids suspicion and distances doubt; aids others and benefits the people, bringing peace and harmony to the multitude. They constantly maintain a mind of humility and caution, never forgetting the aspirations of loyalty and filial piety.\n\nThe *Daoist Scripture* says: \"One who knows contentment is rich.\"\nThe *Classic of Filial Piety* says: \"Lofty yet not perilous—thus one long preserves nobility; full yet not overflowing—thus one long preserves wealth.\"\nThe *Book of Changes* says: \"The Way of Heaven diminishes the full and augments the humble; the Way of Earth alters the full and flows to the humble; ghosts and spirits harm the full and bless the humble; the Way of Man detests the full and favors the humble. The humble are honored and radiant, lowly yet unassailable.\" It also says: \"The laboriously humble noble person will have a good end.\"\n\n**On Poverty and Lowliness**\n*Master Su Lü* said: Poverty and lowliness are what all people detest, yet if one does not rid oneself of them by improper means, they should not be shunned. A scholar who is devoted to the Way yet ashamed of coarse clothes and poor food is not worth discussing. The noble person worries about the Way, not poverty; does not fear poverty but fears instability.\n\nOf old, the old fisherman and the recluse of the thatched hut were poor yet attained enlightenment. Thus, Zixia’s patched robe, Yuan Xian’s mulberry-wood door pivot, and Yanzi’s single basket of food, single gourd of drink, vegetable fare, and water—resting his head on his bent arm—found joy therein. Zengzi straightened his cap though its strings snapped, put on his shoes though their heels were worn through, adjusted his robe though his elbows showed, and dragged his sandals while singing.",
      "overlap_context": "doned first?\"\nThe Master said: \"Abandon arms.\"\nZigong said: \"If forced to relinquish one of the remaining two, which should be abandoned first?\"\nThe Master said: \"Abandon food. Since ancient times, all must die; but without the people’s trust, the state cannot stand. In governing a state, trust must never be lost.\n\nIn former times, King You of Zhou faced threats from the Quanrong in the west and the Jiankang in the north. The king and the feudal lords established trust, agreeing that when beacon",
      "start_char": 4284,
      "end_char": 5531,
      "start_sentence": 249,
      "end_sentence": 321,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.5842821598053,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\素履子.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "商颂声满天下，若出金石，天子不得为臣，诸侯不得为友。 此致道者亡身，养志者亡命。 此皆贫而乐道者也。 亦有门栽五柳，庭植三刻，扣角而歌，采樵而咏，皆履贫之士也。 贤者在事载土而归，留犊而去，常远三惑，早慎四知。 士之廉而履贫者也。 或舍金存宝，弃卖重言，不谦蜗舍之居而守蓬蒿之室，饮水食菜，守道安贫，悉士之至贤高尚其道。 孔宣父云：不知命，无以为君子。 命者，穷达之分，皆自乐天知命而已。 若好勇疾贫，临财苟得，非君子之人。 欲慕贤哲之踪，则不耻缢弊之袍，华门圭窦者矣。 履平 素履子曰：秤之用也，取之於衡； 车之行也，通之於辙。 衡平则毫厘不差，辙通则辕毂无滞。 秤若失之於毫厘，则权衡不正； 车若亏之於辕毂，则辙迹难通。 欲秤之平则慎之於毫厘，欲辙之通宜治之於辕毂，毫厘不失，辕毂无亏，则谓天平地成。 乃取易象上天下泽，履君子以辨上下定民志。 履之时用，居安虑危，履平虑蹶。 所以《礼》云：积而能散，安而能迁。 此君子履平而思进也。 子房《素书》曰：衣不举领者倒，走不视地者颠。 士若既逸游，好财色，嗜酒，多私，则平地生坑坎，安处有危亡。 是以《易》曰：九三，君子终曰乾乾，夕惕若厉。 亦曰：履道坦坦，幽人贞吉。 故《诗》曰：谓天盖高，不敢不局； 谓地盖厚，不敢不踏。 皆如履薄临深，履平之至也。 履危 素履子曰：居屯、蒙，危难之时常见。 《易·象》云：云雷屯，君子以经纶。 初九：盘桓，利居贞。 复见山下有险，险而止，蒙。 退则困险，进则阂山。 蒙以养正，乃圣功也。 君子以果行育德，屯之时用利在居贞，蒙之时宜利於养正。 是知贞之与正，可以涉危难矣。 虞舜潜居中冀，仁孝之心唯坚； 周公出往束征，忠实之志益盛。 展禽三黜而不已直道，子文三已而无愠辞。 西伯拘美里，仁德愈明，冶长囚缧绁，而贤行不替； 遭匡不改仁圣，厄陈不彻鼓琴。 君子福至不喜，祸至不惧； 不缁不磷，洁白之德益彰，不雕不衰，清贞之操弥盛。 《诗》曰：我心匪石，不可转也，我心匪席，不可卷也。 又曰：风雨如晦，鸡呜不已。 圣贤若是，所以长思《鸦鹊》之篇、《鹏乌》之赋。 然而履虎尾畏惧怨怨，涉险难慎危兢兢。 《易》曰：视履考祥，其旋元吉。 又曰：进退不失其正者，其唯圣人乎。 履道亨矣。 素履子卷下竟",
      "translated_text": "The *Shang Song* hymns resounded throughout the realm, resonant as metal and stone, such that even the Son of Heaven could not take their masters as ministers, nor could feudal lords claim them as friends. These were men who attained the Way at the cost of their lives, or nurtured their aspirations at the cost of their fates—all of them poor yet rejoicing in the Dao.\n\nSome planted five willows by their gates, or cultivated three mulberry trees in their courtyards, singing as they tapped their horns, chanting as they gathered firewood—all were scholars who trod the path of poverty. The worthy, when employed, returned home bearing only a load of earth; when dismissed, they left behind even their calves, ever distant from the three delusions and early cautious of the four kinds of knowledge. Such were the incorruptible scholars who embraced poverty.\n\nSome forsook gold to preserve treasures, abandoned profit to uphold their words, disdaining the snail’s dwelling yet guarding their thatched huts, drinking water and eating greens, upholding the Way and content in poverty—these were the most virtuous and lofty of scholars. Confucius said: \"He who does not understand fate cannot be a noble person.\" Fate determines one’s rise or fall, and all one can do is delight in Heaven and know one’s destiny. Those who crave courage to despise poverty, or seek gain before wealth, are not true noble persons. To emulate the footsteps of the wise and sagely, one must not be ashamed of a threadbare robe or a humble gate with a jade-like chink.\n\n**Treading Level Ground**\nMaster Plain Tread said: The function of a steelyard lies in its balance; the movement of a cart depends on its ruts. When the balance is level, not even a hair’s breadth is amiss; when the ruts are clear, the axle and hub glide without obstruction. If the steelyard errs by a hair’s breadth, the weights and measures lose their correctness; if the axle and hub are flawed, the cart’s tracks become impassable. To keep the steelyard level, one must be vigilant in the minutest detail; to keep the ruts clear, one must tend to the axle and hub. When not even a hair’s breadth is lost and the axle and hub remain unmarred, this is called the equilibrium of Heaven and the completion of Earth.\n\nThis draws from the *Yi Jing*’s image of Heaven above and marsh below, where the noble person treads to distinguish high and low and settle the people’s aspirations. The utility of treading lies in dwelling in safety while contemplating danger, treading level ground while fearing stumbles. Thus the *Rites* say: \"Accumulate yet be able to disperse; be at ease yet able to adapt.\" This is how the noble person treads level ground while pondering advancement. Master Zhang’s *Plain Book* states: \"One who does not lift the collar of his robe wears it upside down; one who does not watch the ground while walking will stumble.\" If a scholar indulges in idleness, covets wealth and sensuality, craves wine, or harbors private desires, then even level ground will sprout pits and snares, and safe dwellings will harbor peril and ruin.\n\nThus the *Yi Jing* says: \"The noble person, to the end of the day, remains diligent and cautious, as if facing danger.\" It also says: \"Treading the Way with ease, the reclusive person’s steadfastness brings good fortune.\" Therefore the *Odes* say: \"They say Heaven is high—dare I not crouch? They say Earth is thick—dare I not tread?\" All this is like treading thin ice over deep waters—this is the perfection of treading level ground.\n\n**Treading Peril**\nMaster Plain Tread said: In times of *Zhun* and *Meng*, peril and difficulty are ever-present. The *Yi Jing*’s *Image* says: \"Clouds and thunder form *Zhun*—the noble person weaves and orders.\" The first nine: \"Hesitating, it is advantageous to dwell in steadfastness.\" Again, one sees peril beneath the mountain, and halts in danger—this is *Meng*. To retreat is to be trapped in peril; to advance is to be blocked by the mountain. *Meng* is for nurturing correctness—this is the work of the sage.\n\nThe noble person, through resolute action, cultivates virtue. The utility of *Zhun* lies in dwelling in steadfastness; the advantage of *Meng* lies in nurturing correctness. Thus, steadfastness and correctness enable one to traverse peril and difficulty. When Yu Shun lived in obscurity in Zhongyi, his benevolent and filial heart only grew firmer; when the Duke of Zhou went forth to campaign in the east, his loyal and sincere resolve only intensified. Zhan Qin was thrice dismissed yet never ceased his upright ways; Ziwen was thrice relieved of office yet never uttered a resentful word. King Wen was imprisoned in Youli, yet his virtuous power shone ever brighter; Ye Chang was bound in fetters, yet his worthy conduct remained unsullied. Confucius, though besieged in Kuang, never altered his benevolence and sageliness; though distressed in Chen, he never ceased playing his zither.\n\nThe noble person does not rejoice at good fortune nor fear calamity. Unstained by defilement, his pure and white virtue shines ever brighter; uncarved and unyielding, his clear and steadfast integrity grows ever more vigorous. The *Odes* say: \"My heart is not a stone—it cannot be turned; my heart is not a mat—it cannot be rolled up.\" And again: \"Though wind and rain darken the sky, the cock crows on without cease.\" Such were the sages and worthies, who long pondered the *Ode of the Crow and Magpie* and the *Rhapsody of the Roc and Crow*.\n\nYet treading on a tiger’s tail inspires trembling fear; traversing peril and difficulty demands cautious vigilance. The *Yi Jing* says: \"Observe one’s tread and examine its omens—returning thus brings supreme good fortune.\" And again: \"To advance and retreat without losing correctness—is this not the mark of the sage?\" The Way of treading is thus flourishing.\n\n*Plain Tread, Lower Scroll* concludes.",
      "overlap_context": "ty.\n\nOf old, the old fisherman and the recluse of the thatched hut were poor yet attained enlightenment. Thus, Zixia’s patched robe, Yuan Xian’s mulberry-wood door pivot, and Yanzi’s single basket of food, single gourd of drink, vegetable fare, and water—resting his head on his bent arm—found joy therein. Zengzi straightened his cap though its strings snapped, put on his shoes though their heels were worn through, adjusted his robe though his elbows showed, and dragged his sandals while singing.",
      "start_char": 5531,
      "end_char": 6431,
      "start_sentence": 322,
      "end_sentence": 374,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.63717269897461,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\素履子.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}