{
  "source_id": "紫金光耀大仙修真演义",
  "source_file": "chunked_daozang\\紫金光耀大仙修真演义.json",
  "total_chunks": 6,
  "total_original_chars": 5583,
  "total_translated_chars": 31717,
  "total_translation_time": 161.59860944747925,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\紫金光耀大仙修真演义.txt",
    "category": "藏外"
  },
  "full_translation": "*The Purple Radiance of Golden Splendor: A Daoist Exposition on Cultivating Immortality*\n\nIn the third year of Yuanfeng of the Han, Wu Xian presented *The Record of Cultivating Immortality* to Emperor Wu. The Emperor could not put it to use—what a pity! The book was transmitted to later generations, and even those who but dimly grasped its methods gained robust limbs, extended years, and prolonged life. Applied to offspring, it made them intelligent and easy to rear. Yet there are those one must abandon, and those one must avoid. Only by first knowing what to abandon and what to avoid may one proceed step by step in practice.\n\nI have expounded its principles in twenty chapters, ordering the stages and fixing the sequence, for the sequence must not be disordered, nor the practice deficient. Those who cultivate immortality must attain it for themselves.\n\n—Inscribed by Deng Xixian\n\n---\n\n**1. On What to Abandon and What to Avoid**\n\nIn consorting with women, one must first understand the Five Abandonments:\n1. Those with deep voices and coarse skin, yellow hair and fierce tempers, or venomous jealousy in their yin—these are the first to abandon.\n2. Those with ugly, sallow faces, balding heads, foul armpits, hunched backs, protruding chests, or who walk with the hopping of sparrows or the slithering of serpents—these are the second to abandon.\n3. Those who are sallow, emaciated, and weak, with cold bodies and depleted qi, or irregular menstruation—these are the third to abandon.\n4. Those who are epileptic, deaf, mute, or dumb; lame or one-eyed; afflicted with scabies, scars, or madness; excessively fat or thin; or with coarse, dense yin hair—these are the fourth to abandon.\n5. Those over forty years of age, who have borne many children and whose yin is depleted, with loose skin and sagging breasts—these bring no benefit and only harm, and are the fifth to abandon.\n\nFor the timing of union, one must know the Five Avoidances:\n1. The Three Origins (heaven, earth, and human), jiazi days, one’s own fateful gengshen days, the conjunctions of heaven and earth, solar and lunar eclipses, the dark and new moons, the first and last quarters, great winds and rains, thunder and lightning, and beneath the Three Luminaries (sun, moon, and stars)—these are the first to avoid.\n2. Mountains, forests, gardens, ponds, Daoist halls, Buddhist temples, pagodas, spirit shrines, and the great rivers (Yangtze, Huai, Yellow, and Ji)—these are the second to avoid.\n3. Extreme cold or heat, ravenous hunger or overindulgent fullness, great joy or drunkenness, urgent need to relieve oneself, or when the cauldron’s qi is unresponsive—these are the third to avoid.\n4. Consecutive days of drunkenness, recovery from long illness, or exhaustion from long journeys—these are the fourth to avoid.\n5. Women who have not yet completed the seventy-seven days after childbirth, when defilement still lingers—these are the fifth to avoid.\n\nOnly by knowing and avoiding these Five Abandonments and Five Avoidances may one proceed. Those who violate them not only harm themselves but also beget offspring who are often crippled or unwholesome, for their endowment is not upright.\n\n---\n\n**2. On Nurturing Spirit and Qi**\n\nThe Dao of preserving life lies in carefully examining its methods.\n- Fewer sexual desires nurture essence and qi.\n- Moderation in rich flavors nurtures blood and qi.\n- Swallowing saliva nurtures lung qi.\n- Guarding against anger nurtures liver qi.\n- Regulating diet nurtures stomach qi.\n- Reducing excessive thought nurtures heart qi.\n- Self-reflection nurtures the qi of the flesh.\n\nPracticing these diligently will make one’s qi robust and spirit abundant.\n\nDuring the hours of xu and hai, when yin wanes and yang disperses, one should not indulge in drunkenness, overindulgence, or deep sleep, lest the hundred vessels become congested and the joints accumulate toxins. At this time, one should first guide the four vessels, then stretch the limbs, revolve the mechanism of qi, and move the entire body. Thus, the joints open, the constructive and defensive qi flow smoothly, yin and yang harmonize, essence is secured, spirit is whole, pathogenic qi cannot enter, and neither cold nor heat can assail—this is the Dao of preserving life.\n\n---\n\n**3. The Elixir of the Bedchamber**\n\nThe oral formula states: *\"To supplement a person with a person is to attain the true.\"*\nThe Dao of yin and yang treasures essence and marrow. Circulate and refine them, and one will not age even in later years.\n\nThe affairs of the bedchamber can kill a person or give them life. Those who master its techniques may nurture life; those who do not will perish. If one can deeply comprehend the arts of the bedchamber, unblock the passes, guide the qi, circulate essence, and supplement the marrow, one may attain longevity.\n\n---\n\n**4. The Precious Cauldron Within the Furnace**\n\nThe cauldron is the vessel for forging the divine elixir, the furnace for warming the true and nurturing qi. It must be a beautiful woman who has never given birth, pure and fair, without foul breath or bodily odors—this is the true cauldron, and using her brings great supplementation. All others, especially those described in the Five Abandonments, must not be used.\n\n---\n\n**5. The Man’s Observation of the Four Arrivals**\n\n**5. The Man’s Observation of the Four Arrivals**\n\nWhen the jade stem does not rise, the yang qi has not arrived. When it rises but does not extend, the flesh qi has not arrived. When it extends but is not firm, the bone qi has not arrived. When it is firm but not hot, the spirit qi has not arrived. In all couplings, first observe the four arrivals before proceeding.\n\n---\n\n**6. The Woman’s Examination of the Eight Attainments**\n\nWhen a woman silently swallows her fluids, the pulse qi has arrived. When she presses her body against her partner, the stomach qi has arrived. When she moves with force, the sinew qi has arrived. When she plays with her partner’s breasts, the flesh qi has arrived. When her brows frequently knit, the liver qi has arrived. When she grasps and fondles the jade stem, the blood qi has arrived. When slick fluids flow forth, the spleen qi has arrived. When she sucks her partner’s tongue, the lung qi has arrived. Only when all eight have arrived may coupling proceed.\n\n---\n\n**7. Playful Teasing and Timing**\n\nBefore coupling, first compose the spirit and settle the nature. Embrace the woman, warmly caress and tease her. Suck her lips and tongue, pinch her breasts. Have her grasp and fondle the jade stem until her heart stirs. Then, with the hand, explore her yin gate—only when slick fluids appear may the cauldron be entered. Proceeding gently according to method, the woman will surely be delighted and reach her peak first.\n\n---\n\n**8. Stirring the Heart’s Passions**\n\nA woman’s passions lie deep and hidden. How to arouse them? How to know when they are aroused? To stir her, if she craves wine, offer fragrant spirits; if she is tender-hearted, whisper sweet words; if she loves wealth, bestow silks and coins; if she delights in pleasure, present a mighty instrument. A woman’s heart is never fixed—seeing the scene, her passions will arise without fail.\n\nTo know when she is aroused: she may pant and tremble without cease; her eyes may close, her nose flare, and she may be unable to speak; her gaze may grow dull and fixed; her ears may redden, her face flush, and her tongue tip turn slightly cold; her hands may grow hot, her belly warm, and her speech become disordered; her spirit may wander, her body soften, and her limbs grow limp; her tongue may dry, her body press close, or the pulse of her yin gate may quicken and slick fluids overflow—all these are signs of stirred passion. At this time, the man must not act hastily. Proceeding slowly to gather, he will obtain true yang.\n\n---\n\n**9. Tempering the Blade and Nurturing Sharpness**\n\nDuring coupling, if the jade stem is long and fills the yin gate, the woman’s passions will surely be satisfied and her pleasure complete. There is a method to enlarge the stem. As the saying goes, *\"A craftsman must sharpen his tools to do his work well\"*—this cannot be ignored.\n\nEach day, between midnight and noon, when yin wanes and yang waxes, sit upright in a quiet chamber, facing east, clothed but barefoot. Compose the spirit and empty the mind. The belly should not be full—fullness causes qi to stagnate and blood to congeal—but neither should it be empty, for hunger quickens the flow of blood and qi. Exhale turbid qi through the mouth, then inhale clear qi through the nose. Swish the saliva, close the throat, and send it down to the cinnabar field, guiding it into the jade stem. Repeat this seven times, or fourteen, twenty-one, up to forty-nine times.\n\nRub the hands together until hot as fire. With the right hand, support the scrotum and stroke the jade stem. With the left hand, massage below the navel in a counterclockwise circle eighty-one times. Then switch hands, massaging clockwise eighty-one times. Next, extend the right hand to the coccyx, lift the root of the jade stem upward, pinch it at the base, and swing it against the left and right thighs without counting the strokes.\n\nAfterward, embrace the woman and slowly insert the jade stem into the yin gate. Gather her fluids, inhale her nasal qi, close the throat, and send it to the jade stem to nurture it. Then, rub the stem between the hands as if twisting a rope, without counting the strokes. Over time, it will naturally grow long and large.\n\nWhen engaging in battle, first bind the root of the stem with a silk sash. Then, with both hands, lift the scrotum and stem together. Swish the saliva, inhale qi, and swallow it down to the cinnabar field. Raise the coccyx to meet it, uniting upper and lower to strengthen the yang force before proceeding.\n\n---\n\n**10. Drilling Troops and Practicing Warfare**\n\nWhen first beginning, suppress all desire. Practice first with a coarse or unattractive cauldron to avoid excessive arousal or overwhelming pleasure, making control easier. Proceed slowly: gently enter, firmly withdraw, three shallow thrusts to one deep, completing eighty-one cycles as one round. If passion stirs, immediately halt and withdraw, leaving only an inch inside. Wait until the heart’s fire settles and breathing steadies, then resume the previous method. Next, perform five shallow thrusts to one deep, then nine shallow to one deep. Avoid impatience or haste. Practicing for half a month will bring mastery.\n\n---\n\n**11. The Art of Securing Victory**\n\nWhen encountering a truly beautiful cauldron, the heart will surely grow fond. Yet during coupling, one must feign disdain and steady the spirit. Move the jade stem slowly within the cauldron, completing one or two or three rounds. Then pause to rest the qi and calm the heart. After a moment, resume according to method. When her pleasure grows intense and she seems unable to endure, increase tenderness—she will surely reach her peak first. At that time, attack and gather according to method.\n\nIf one feels the urge to release, swiftly withdraw the jade stem and apply the sealing and closing method to quell the impulse. Once qi is settled and breathing even, resume the attack. In battle, never rush; in gathering, never hasten. Proceed with care.\n\nThese nine sections must be studied and integrated to grasp their subtleties.\n\n---\n\n**12. Sealing and Closing the Mysterious Pass**\n\nSealing and closing is the method of *\"damming the Yellow River with a single hand.\"* Impetuous individuals must practice for over twenty days to achieve closure. Those of calm and quiet nature may succeed in ten days or so. After a month of practice, the golden pass will be eternally secure, the jade gate perpetually barred. One may act at will without leakage—this is the wondrous application of the method.\n\nWhen engaging in union, let the jade stem advance and retreat slowly, employing the \"three shallow, one deep\" method. Close the eyes and seal the mouth, drawing qi gently through the nose to prevent panting. At the first sign of impending release, swiftly lift the waist and hips, withdrawing the jade stem by an inch without further movement. Inhale deeply, drawing the qi upward to the cinnabar field, then guide it along the spine to the coccyx, contracting the lower region as if restraining an urgent need to relieve oneself. Focus the mind and spirit, visualizing the acupoint beneath the tailbone—where one’s essence and qi reside as the most precious treasure—lest it be lost. With each inhalation, draw the essence and qi inward and swallow once. After a moment, when the impulse subsides, resume the slow and deliberate practice. Should pleasure arise again, repeat the withdrawal, inhalation, and visualization to prevent leakage.\n\nThe qi and meridians of the human body circulate ceaselessly from top to bottom. If one does not prepare in advance, by the time pleasure peaks and desire becomes uncontrollable, qi will guide essence outward, leading to self-harm. Attempting to forcibly restrain it may cause stagnant essence to flow into the bladder or kidney sac, resulting in disorders such as qi stagnation in the small intestine or bladder, or cold-induced swelling and pain in the kidneys. Generally, before desire arises, one should repeatedly lift and withdraw, frequently pausing to stabilize the jade stem, ensuring it does not wilt and that vigor remains abundant. Only after five thousand thrusts may one allow the release of stagnant essence, while the true yang qi of original vitality remains stored in the cinnabar field to nourish the spirit. With prolonged practice, one night’s effort may rival ten women—hence the name, *Sealing and Closing the Mysterious Pass*.\n\n**13. The Three Peaks and the Great Elixir**\n\nThe upper peak is called *Red Lotus Peak*. Its elixir is named *Jade Spring*, also known as *Jade Fluid* or *Sweet Spring*, and it flows from the two apertures beneath a woman’s tongue. Its color is azure, and it is the essence of saliva. When a man licks it with his tongue, the spring wells forth into the *Flower Pool*. Sucking and swallowing it, he sends it down the *Tower of Nine Stories* into the cinnabar field, where it irrigates the five viscera, replenishes the *Mysterious Pass* on the left, and fortifies the cinnabar field on the right, generating qi and blood.\n\nThe middle peak is called *Twin Watercress Peak*. Its elixir is named *Coiled Peach*, also called *White Snow* or *Jade Nectar*, and it issues from a woman’s two breasts. Its color is white, and its taste is sweet and rich. When a man sucks and drinks it, sending it to the cinnabar field, it nourishes the spleen and stomach, enhances the spirit, and through absorption, harmonizes the woman’s meridians, easing her body and mind. It ascends to the *Flower Pool* and descends to the *Mysterious Pass*, causing essence and qi to overflow. Among the three peaks, this is the first priority. Even in women who have not given birth and lack milk, its absorption yields even greater benefits.\n\nThe lower peak is called *Purple Mushroom Peak*, also known as *Tiger’s Den* or *Mysterious Pass*. Its elixir is named *Black Lead*, or *Moon Essence*, and it resides in the woman’s *Yin Palace*. Its fluid is slick, and its gate remains closed until, during union, the woman’s passion becomes tender and enchanting, her face flushed and voice trembling—only then does the gate open, qi disperse, and fluid overflow. The man withdraws the jade stem by an inch, maintaining the posture of union, receiving qi and absorbing fluid to replenish his original yang and nourish his spirit.\n\nThese are the *Three Peaks and the Great Elixir*. Only those who understand the Dao, who forget passion in the presence of desire and dwell in desirelessness, can attain them. Thus, white hair turns black again, old age reverts to youth, and one achieves longevity without aging.\n\n**14. The Five-Character True Mantra**\n\n*Cun* (Visualize), *Suo* (Contract), *Chou* (Withdraw), *Xi* (Absorb), *Bi* (Seal).\n\n*Cun* means visualization. During union, when one senses essence is about to release, swiftly withdraw the jade stem, seal the mouth, and close the eyes. Visualize the acupoint beneath the tailbone, where the essence and qi of the *Life Gate* reside as one’s most precious treasure, which must not be lost. Let the body unite while the spirit remains detached, without fixation. By visualizing thus, even if release occurs, it will be minimal, and vigor will not wane. With prolonged practice, there will be no leakage. This is the meaning of *Cun*.\n\n*Suo* means contraction, as in shrinking back without daring to advance. When essence is about to release, swiftly contract the flanks, withdraw the jade stem, and inhale deeply, drawing qi straight to the cinnabar field. Lift the coccyx, contract the lower region as if restraining an urgent need to relieve oneself, and hold the breath, visualizing without movement. After a moment, when the impulse subsides, exhale through the mouth, embrace the woman, suck her tongue, and swallow her fluid five to seven times, sending it to the cinnabar field. This allows one to resume union without fatigue.\n\nAt the outset, one must avoid hasty or deep penetration, for once the great impulse surges, it becomes difficult to control. Forcing restraint may cause stagnant essence to disperse improperly, leading to other illnesses. Generally, frequent lifting and withdrawal make it easier to govern desire without indulgence. This is the meaning of *Suo*.\n\n*Cun* and *Suo* are practiced simultaneously, without priority—this is the method for men to seal their essence.\n\n*Chou* means extraction. During union, if the woman experiences pleasure, her breath will quicken and her voice tremble. The man should seal his mouth, advance gently and withdraw firmly, avoiding haste or depth. He enters only halfway, drawing the woman’s nasal qi into his abdomen through his own nose, never through the mouth, for oral inhalation harms the brain. With each inhalation and withdrawal, he absorbs her qi above and her fluid below. After a moment, when qi harmonizes above and below, the yang organ naturally hardens. At the first sign of difficulty in restraint, he should swiftly withdraw and apply the visualization method to prevent leakage. This is the meaning of *Chou*.\n\n*Xi* means absorption. Once the woman has released, the man withdraws the jade stem by an inch, maintaining a half-union posture. He absorbs nasal qi above and slick fluid below. The nose is the *Heavenly Gate*, and below lies the *Life Gate*—the *Heavenly Gate* governs the upper elixir, while the *Life Gate* governs the lower elixir. When the *Spiritual Stalk* absorbs, water and fire cannot reach simultaneously, so the nose must absorb in unison with the *Heavenly Gate*.\n\nA single withdrawal and a single absorption, above and below responding to each other, like water drawn upward through a bamboo tube in reverse flow. By practicing this method, one greatly benefits in replenishing essence and strengthening yang, and the spirit naturally stabilizes. However, prolonged practice harms the woman, so one must wait for her to rest for several hours before engaging again. This is the meaning of *Xi*.\n\nWithdrawal and absorption, in their ebb and flow, connect above and below—within withdrawal lies absorption, and the two proceed in tandem. This is the method by which, after the woman has released, the man absorbs her fluid. *Bi* means sealing the mouth. During intercourse, one should close the eyes and seal the mouth, holding the breath without letting it escape, using only the nose to subtly guide and harmonize, thus avoiding panting. If not sealed, the *Human Gate* connects to the *Heavenly Gate*, and the *Heavenly Gate* connects to the *Life Gate*; if the *Heavenly Gate* of the kidney palace is not secure, it ascends and scatters, and the primordial yang essence will inevitably flow downward and leak. If the *Human Gate* is firmly sealed, brain qi descends to the kidney palace, flows into the *Jade Terrace*, and circulates above and below, transforming essence and qi into harmony, forever preventing leakage. This is the meaning of *Bi*.\n\nThe character *Bi* governs the four characters: at the onset of intercourse, one should regulate the breath and seal the qi, and until the end, one must not lose this restraint. Thus, the character *Bi* is practiced in tandem with the four-character method for a long time.\n\n---\n\n**15. Sequential Absorption and Refinement**\nThe immortal song says:\n*\"When a woman’s desire is boundless,\nFirst stir her passion deep.\nProceed slowly in the battle,\nAnd the general shall surely triumph.\"*\n\nBefore intercourse, first embrace the crucible, caress her breasts, and kiss her lips and tongue to arouse her desire. Only then should the yang organ enter the yin, engaging slowly in union, performing the nine-nines count. Close the eyes and seal the mouth, frequently withdrawing and thrusting, keeping the golden spear unswaying—this is the initial absorption of the lower peak.\n\nOnce the lower absorption is intense, the woman’s qi expands upward to respond to the middle peak. Gently embrace her, alternately inhaling and sipping her fluids, swallowing them until satisfaction is attained—this is the absorption of the middle peak.\n\nWhen the middle absorption is intense, the woman’s qi further rises to the upper peak. Extend your tongue beneath hers, stirring both orifices, repeatedly absorbing her fluid and swallowing it—this is the absorption of the upper peak.\n\nAfter the upper absorption is complete, the woman will reach utmost joy, and her true yin qi will be released. Withdraw the *Spiritual Stalk* by an inch, raise the body like a turtle, draw in a breath of qi, and direct it straight to the *Cinnabar Field*. Contain her qi and absorb her fluid, circulating and refining them—then the three absorptions are complete, and the woman, too, will feel thorough pleasure, her qi and pulse flowing smoothly. Afterward, exhale one or two breaths, letting her inhale and swallow them to calm her spirit and qi.\n\nThis method, once mastered, takes her released essence and returns it to one’s own unspent essence. For her, the harm is minimal; for oneself, the benefit is great. Yin and yang unite, water and fire achieve harmony—this is the wondrous application of the art of intercourse.\n\n---\n\n**16. Timely Circulation**\nWhen the woman releases, signs such as panting, trembling, or moaning will appear. At this moment, calm the mind and regulate the breath, holding the woman firmly. Absorb the *Jade Spring* above, the *Coiling Peach* in the middle, and the *Moonlight* below, refining and gathering them. Circulate them from the *Weilü*, ascending in reverse along the two white meridians, threading through the spine, piercing the *Kunlun*, entering the *Mud Pill*, and flowing into the mouth, where it transforms into *Jade Nectar*. Swallow it down the *Heavy Tower* until it reaches the *Cinnabar Field*. This is called *Reversing the Flow of the Yellow River*, which fills essence and replenishes marrow, prolonging life and extending years. The key lies in \"lifting qi and swallowing qi, visualizing the meridian pathways.\" As the saying goes: *\"Where the spirit goes, qi follows; where qi goes, essence follows.\"*\n\n---\n\n**17. Fulfilling the Dao of Marriage**\nHuman life begins with male and female, and from them arises the union of husband and wife—the foundation of human ethics. Without intercourse, there can be no deepening of affection and fulfillment of duty, which would violate ethical norms.\n\nMan belongs to yang, which is easily aroused and easily calmed; woman belongs to yin, which is difficult to arouse and difficult to calm. Most people, during intercourse, do not know how to control themselves, indulging in reckless stimulation and releasing in an instant, often failing to satisfy the woman’s desire. If one follows the method of absorption and battle, entering the crucible slowly and gently, without haste, for what is slow is easy to control, and what is hasty is difficult to restrain. Moreover, one must not let the woman clasp and move one’s waist. Withdrawing and thrusting leisurely, practicing the method of absorption and battle, not only benefits the body but also makes the woman affectionate. When man is fulfilled and woman is delighted, both derive equal benefit—this is the Dao of fulfilling marital duty and completing ethical relations.\n\n---\n\n**18. Reviving the Withered**\nCultivating the Dao and nourishing life is like grafting a withered tree to revive its vitality. Using one person to replenish another is akin to grafting a branch onto a tree—the principle is the same.\n\nThe immortal song says:\n*\"The world does not understand the principle of longevity,\nBut look to the mulberry grove where pears are grafted.\"*\n\nFor this practice, one must obtain a perfect precious crucible, ideally a woman between fifteen and thirty years of age. At fourteen (two sevens), she is *Lesser Yin*; at twenty-one (three sevens), she is *Abundant Yin*; at twenty-eight (four sevens), she is *Robust Yin*. *Lesser Yin* nourishes the body, *Abundant Yin* benefits longevity—these are suitable for warming and cultivation. Wait until her *Crimson Tide* converges, neither excessive nor deficient, for this is the optimal time for one’s use. With prolonged absorption and refinement, one may preserve form and abide in the world.\n\nAt thirty-five (five sevens), she becomes *Declining Yin*; at forty-two (six sevens), *Greater Yin*; at forty-nine (seven sevens), *Exhausted Yin*—one should distance oneself from these. Particularly avoid those who are overly plump (whose meridians are difficult to penetrate), overly thin (whose fluids are scant), fatigued (whose spirit and qi are insufficient), weak (who harm one’s yang spirit), weary (whose yin is cold), or ill (whose yin is toxic). All these are *Yin Predators* and must be avoided.\n\nMoreover, absorption and replenishment depend on one’s own mind. The heart and spirit must be empty and tranquil, thoughts calm and leisurely. Recognize taboos, observe signs, withdraw and thrust gently, play and frolic slowly. Enter weakly and exit strongly, discerning the moment just before the urge to release.\n\nWithdrawal and retention must be mastered in the moment between impending movement and actual movement. Steering the boat lies in the stern timber; loosing the crossbow depends on the trigger’s inch. The adept, knowing this, may guide it with intention.\n\n(19) Returning to the Origin and Reverting to the Root\n\"Returning to the Origin\" is the method of reversal. The true yin within *li* is formless yet reliable; its fire delights in soaring. When used in accord, it nurtures the embryo into a person; when used in reverse, it coagulates the pearl into treasure. This is what is meant by *\"The Yellow River’s waves overturn, drawn back to re-enter the Celestial Gate.\"*\n\nDuring absorption and refinement, one has already employed contraction and stillness to restrain it, and extraction and suction to gather it. Yet without a method for dismounting, how can it be returned and dispersed? After the act, one must lie flat, legs stretched, head resting on the pillow, heels pressed to the bed, the body entirely suspended. Exert all effort to hold the breath, swaying the body three to five times, then exhale through the nose, evenly and steadily.\n\nIf the face feels warm, it signals that the essence-qi has ascended to the *Niwan Palace*. Immediately rub the face with both hands to release the heat. Then, seal the lips to halt breathing, stir the *Flower Pool* with the tongue, and swallow the divine water into the *dantian*. Only then does the essence-qi circulate fully, becoming a substance of use to oneself. Through daily practice and monthly progress, one may wander the celestial clouds and feast in the *Yellow Court*.\n\n(20) Planting the Seed and Securing the Fetus\nIn the union of man and woman, absorption brings longevity and extended years, while release secures the fetus and plants the seed. As the saying goes, *\"Of the three unfilial acts, having no posterity is the greatest.\"* Thus, planting the seed is a vital duty of life.\n\nA man must first replenish his essence and strengthen his kidneys to invigorate his yang qi. A woman should likewise regulate her essence and nourish her blood to warm and harmonize her womb. Then, wait until her monthly flow has passed, the red pulse fully ceased, and the womb’s gate is open—this is the proper time for union. On the first day, a boy is conceived; on the second, a girl—such is the principle of yang as odd and yin as even. Following this method, the child will inherit bright virtue, be free of illness, and easy to raise. After five days, the womb’s gate closes, and the union becomes empty.\n\nFor success, both partners must be equally aroused. If the man’s desire stirs first and his essence arrives while the woman remains unmoved, the essence, though present, will not be received. Or if the woman’s desire stirs first and peaks before the man’s, his essence arrives too late and will likewise not be received. Only when both are equally delighted, the man deeply inserting his jade stem to release, and the woman raising her waist to draw it into her palace—only then, after a brief pause before withdrawing, should she lie flat on her back. This method proves effective in every trial.\n\nMoreover, union at the *zi* or *wu* hours (peak yang) yields a boy; union at the *mao* or *you* hours (peak yin) yields a girl. If yin blood arrives first and yang essence follows, the blood opens to enclose the essence, which enters to form bone—thus a boy is conceived. If yang essence arrives first and yin blood follows, the essence opens to envelop the blood, which remains within—thus a girl is conceived. If essence and blood arrive simultaneously, twins may result—a principle that may well hold true.\n\nHere ends the appended record.\n\nDuring the reign of Emperor Shizong, I received my government stipend in Yanjing. At that time, Master Tao, the Perfected One, had gained imperial favor through his arts. Though most of his practices were illusory and unorthodox, his methods of *cai bu* (yin-yang cultivation) alone proved substantial in effect. Thus, the sacrifices offered at the ancestral temple were graced with longevity—all owing to this. Admiring his techniques, I bribed his disciples to obtain their secret transmissions and acquired two texts: the *Pure Yang Master’s* teachings and the *Scripture of Master and Disciple*. Following their instructions, I practiced diligently. At first, control was difficult, but with time, it became effortless. Over sixty years, I bedded over a hundred women, fathered seventeen children, served five emperors, and witnessed five dynasties. Though now retired, I remain tireless in the bedchamber; even a single union suffices for several partners. Though Heaven has granted me years beyond measure, the merits of *cai bu* cannot be concealed.\n\nAs the saying goes: *\"He who excels in artifice courts misfortune.\"* Yet man’s lifespan rarely reaches a hundred—should I perish like morning dew, I could not bear to let these two texts vanish. Thus, I entrust them to the woodblock carver, that the virtue of the Great Immortal may spread, and all in this world may together ascend to the age of Peng and Lao. If one dismisses this as absurd and baseless, they forsake their own longevity—what fault lies with me?\n\nWritten in the spring of the *jiawu* year of the Wanli era, first month of the *ren* cycle, by the Old Man of Tiantai, aged ninety-five, in the Purple Ganoderma Chamber.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "《紫金光耀大仙修真演义》 汉元丰三年，巫咸进《修真语录》于武帝。 帝不能用，惜哉！ 书传后世，微谙其术者，亦得支体强健，益寿延年。 施之种子，聪明易养。 然有当弃，有当忌。 先知弃忌，方可次第行功。 余演其义为二十章，分功定序，因序定功。 序固不可紊，功亦不可阙也。 修真之士，当自得之。 邓希贤识 （一）弃忌当知 凡御女子，先明五弃：声雄皮粗、发黄性悍、阴毒妒忌，此一弃也。 貌恶面青、头秃腋气、背陀胸凸、雀跃蛇行，二弃也。 黄瘦羸弱、体寒气虚、经脉不调，三弃也。 癫聋喑哑、跛足眇目、癣疥瘢疯、太肥太瘦、阴毛粗密，四弃也。 年四十以上，产多阴衰，皮宽乳慢，无益有损，五弃也。 交合有期，五忌须知：三元甲子、本命庚申、天地交合、日月薄蚀、晦朔弦望、大风大雨、雷鸣电掣、三光之下，此一忌也。 山林园沼、道堂佛殿、宝塔神祠、江淮河济，二忌也。 大寒大热、大饥大饱、大喜大醉、大小便急、鼎气无情，三忌也。 连日醉酒、久病方痊、远归疲倦，四忌也。 妇人产后未满七七，秽污尚存，五忌也。 唯此五弃、五忌，当知避之，犯者不惟自损，即种子亦多残废不良，盖由禀赋之不正也。 （二）神气宜养 摄生之道，贵审其方。 夫寡色欲，所以养精气也； 薄滋味，所以养血气也； 咽津液，所以养肺气也； 慎嗔怒，所以养肝气也； 节饮食，所以养胃气也； 少思虑，所以养心气也； 自省悟，所以养肉气也。 遵而行之，则气壮神余矣。 人于戌亥阴消阳散之时，不宜醉饱酣寐，以致百脉壅滞，关节停毒。 此际当先导四脉，次展手足，斡运气机，动摇百体。 俾关节开通，荣卫流畅，阴阳和合，精固神全，邪气不入，寒暑不侵，斯为摄养之道也。 （三）房内灵丹 诀云：以人补人，自得其真。 阴阳之道，精髓为宝。 搬而运之，后无而老。 房中之事，多能杀人，亦能生人，能用之者，可以养生，不能用者，则以殒命。 人能善悟房中之术，通关引气，运精补髓，故能长生也。 （四）炉中宝鼎 鼎者，煅炼神丹之具，温真养气之炉也，须未生产美妇，清俊洁白，无口体之气者为真鼎，用之大能补益。 此外，如前五弃者不可用也。 （五）男察四至",
      "translated_text": "*The Purple Radiance of Golden Splendor: A Daoist Exposition on Cultivating Immortality*\n\nIn the third year of Yuanfeng of the Han, Wu Xian presented *The Record of Cultivating Immortality* to Emperor Wu. The Emperor could not put it to use—what a pity! The book was transmitted to later generations, and even those who but dimly grasped its methods gained robust limbs, extended years, and prolonged life. Applied to offspring, it made them intelligent and easy to rear. Yet there are those one must abandon, and those one must avoid. Only by first knowing what to abandon and what to avoid may one proceed step by step in practice.\n\nI have expounded its principles in twenty chapters, ordering the stages and fixing the sequence, for the sequence must not be disordered, nor the practice deficient. Those who cultivate immortality must attain it for themselves.\n\n—Inscribed by Deng Xixian\n\n---\n\n**1. On What to Abandon and What to Avoid**\n\nIn consorting with women, one must first understand the Five Abandonments:\n1. Those with deep voices and coarse skin, yellow hair and fierce tempers, or venomous jealousy in their yin—these are the first to abandon.\n2. Those with ugly, sallow faces, balding heads, foul armpits, hunched backs, protruding chests, or who walk with the hopping of sparrows or the slithering of serpents—these are the second to abandon.\n3. Those who are sallow, emaciated, and weak, with cold bodies and depleted qi, or irregular menstruation—these are the third to abandon.\n4. Those who are epileptic, deaf, mute, or dumb; lame or one-eyed; afflicted with scabies, scars, or madness; excessively fat or thin; or with coarse, dense yin hair—these are the fourth to abandon.\n5. Those over forty years of age, who have borne many children and whose yin is depleted, with loose skin and sagging breasts—these bring no benefit and only harm, and are the fifth to abandon.\n\nFor the timing of union, one must know the Five Avoidances:\n1. The Three Origins (heaven, earth, and human), jiazi days, one’s own fateful gengshen days, the conjunctions of heaven and earth, solar and lunar eclipses, the dark and new moons, the first and last quarters, great winds and rains, thunder and lightning, and beneath the Three Luminaries (sun, moon, and stars)—these are the first to avoid.\n2. Mountains, forests, gardens, ponds, Daoist halls, Buddhist temples, pagodas, spirit shrines, and the great rivers (Yangtze, Huai, Yellow, and Ji)—these are the second to avoid.\n3. Extreme cold or heat, ravenous hunger or overindulgent fullness, great joy or drunkenness, urgent need to relieve oneself, or when the cauldron’s qi is unresponsive—these are the third to avoid.\n4. Consecutive days of drunkenness, recovery from long illness, or exhaustion from long journeys—these are the fourth to avoid.\n5. Women who have not yet completed the seventy-seven days after childbirth, when defilement still lingers—these are the fifth to avoid.\n\nOnly by knowing and avoiding these Five Abandonments and Five Avoidances may one proceed. Those who violate them not only harm themselves but also beget offspring who are often crippled or unwholesome, for their endowment is not upright.\n\n---\n\n**2. On Nurturing Spirit and Qi**\n\nThe Dao of preserving life lies in carefully examining its methods.\n- Fewer sexual desires nurture essence and qi.\n- Moderation in rich flavors nurtures blood and qi.\n- Swallowing saliva nurtures lung qi.\n- Guarding against anger nurtures liver qi.\n- Regulating diet nurtures stomach qi.\n- Reducing excessive thought nurtures heart qi.\n- Self-reflection nurtures the qi of the flesh.\n\nPracticing these diligently will make one’s qi robust and spirit abundant.\n\nDuring the hours of xu and hai, when yin wanes and yang disperses, one should not indulge in drunkenness, overindulgence, or deep sleep, lest the hundred vessels become congested and the joints accumulate toxins. At this time, one should first guide the four vessels, then stretch the limbs, revolve the mechanism of qi, and move the entire body. Thus, the joints open, the constructive and defensive qi flow smoothly, yin and yang harmonize, essence is secured, spirit is whole, pathogenic qi cannot enter, and neither cold nor heat can assail—this is the Dao of preserving life.\n\n---\n\n**3. The Elixir of the Bedchamber**\n\nThe oral formula states: *\"To supplement a person with a person is to attain the true.\"*\nThe Dao of yin and yang treasures essence and marrow. Circulate and refine them, and one will not age even in later years.\n\nThe affairs of the bedchamber can kill a person or give them life. Those who master its techniques may nurture life; those who do not will perish. If one can deeply comprehend the arts of the bedchamber, unblock the passes, guide the qi, circulate essence, and supplement the marrow, one may attain longevity.\n\n---\n\n**4. The Precious Cauldron Within the Furnace**\n\nThe cauldron is the vessel for forging the divine elixir, the furnace for warming the true and nurturing qi. It must be a beautiful woman who has never given birth, pure and fair, without foul breath or bodily odors—this is the true cauldron, and using her brings great supplementation. All others, especially those described in the Five Abandonments, must not be used.\n\n---\n\n**5. The Man’s Observation of the Four Arrivals**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 912,
      "start_sentence": 0,
      "end_sentence": 45,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.970011949539185,
      "metadata": {
        "source_file": "dao\\藏外\\紫金光耀大仙修真演义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "男子玉茎不振，阳气未至也； 振而不展，肌气未至也； 展而不硬，骨气未至也； 硬而不热，神气未至也。 凡交合，先察四至，而后行之。 （六）女审八到 女人默咽津液，脉气到也； 将身附人，胃气到也； 以力动人，筋气到也； 弄人双乳，肉气到也； 眉尖频蹙，肝气到也； 握弄玉茎，血气到也； 滑津流出，脾气到也。 咂人舌津，肺气到也。 俱到则可交合矣。 （七）玩弄消息 凡欲交合，先自凝神定性，抱住女人，温存玩戏。 咂彼唇舌，捻彼双乳。 令女握弄玉茎，使之心动后，以手探阴户，微有滑津，方可入炉。 依法缓缓施功，女必畅快而先败矣。 （八）鼓舞心情 妇人之情，沈潜隐伏。 何以使之动，何以知其动？ 欲使之动者，如嗜酒则饮以香醪，多情则舔以甜语，贪财则赠以钱帛，好淫则欢以伟物。 妇人之心，终无所主，能见景生情，无不动也。 欲知其动，或有气喘而声颤不止者，或有目瞑鼻开而不能言者，或有目涩而定眸者，或有耳红面赤而舌尖微冷者，或有手热腹暖而语言嘈杂者，或有神思恍惚而体软、四肢不收者，或有舌下津干、将身迫近男子，或阴穴脉动滑津盈溢等状，皆情动之验也。 当此之时，男子不宜急燥，缓缓采取，则得真阳矣。 （九）淬锋养锐 交合之时，男若玉茎长大填满阴户者，女情必易畅美，展茎盖有法焉。 语曰“工欲善其事，必先利其器”，不可不知也。 当于每日子后午前，阴消阳长之时，静室中披衣向东端坐，凝神屏虑。 腹不宜饱，饱则气漱血窒； 惟俾无饥，饥则血气流行。 口嘘浊气，随以鼻吸清气，漱津液，闭咽送下丹田，运入玉茎，以七数为度，或二七、三七至七七止。 将两手搓热如火，右手托肾囊并捋玉茎，左手于脐下左转摩八十一次。 次换右手于脐下右转摩八十一次，再伸右手于尾闾，玉茎根提起向上，就根捏住，以茎于左右腿上摆击，不计其数。 后乃抱女，缓缓纳玉茎于阴户，采女津液，吸女鼻气，闭咽存送玉茎以养之。 后复以两手如搓索状搓之，不计数，久久自觉长大矣。 若行采战，先用绢带束固茎根，次以两手上下同肾囊捧起，漱津吸气，咽送丹田，随提尾闾起接，使上下相思，助壮阳势，然后行事。 （十）演战练兵 初下手时，务遏除欲念，先用宽丑之炉演习，庶兴不甚感，亦不至于欢浓，尤易制御也。 须缓缓用功，柔入刚出，三浅一深，行九九之数为一局。 倘情少动，即当停住掣退，只留寸许。 俟心火定息，复仍用前法。 次行五浅一深，后九浅一深。 切忌心急性燥，按行半月则纯熟矣。 （十一）制胜妙术 凡得真美之鼎，心必爱恋。 然交合时，须强为憎恶，按定心神。 以玉茎于炉中缓缓往来，或一局，或二三局，歇气定心，少顷，依法再行。 俟彼欢浓，似觉难禁，更加温存，女必先泄也。 其时如法攻取。 若自觉欲泄，速将玉茎掣退，行后锁闭之法，其势自息。 气定调匀，依法再攻，战不厌缓，采不厌迟，谨而行之可也。 此下九条，当交互融会观之，始得其妙。 （十二）锁闭玄关 锁闭者，撒手遏黄河之法也。 急燥之人，须下二十余日工夫方能得闭。 性柔静者，十数日可闭也。 用功一月，金关永固，玉户常扃，自在施为，无漏泄者，此法中妙用也。",
      "translated_text": "**5. The Man’s Observation of the Four Arrivals**\n\nWhen the jade stem does not rise, the yang qi has not arrived. When it rises but does not extend, the flesh qi has not arrived. When it extends but is not firm, the bone qi has not arrived. When it is firm but not hot, the spirit qi has not arrived. In all couplings, first observe the four arrivals before proceeding.\n\n---\n\n**6. The Woman’s Examination of the Eight Attainments**\n\nWhen a woman silently swallows her fluids, the pulse qi has arrived. When she presses her body against her partner, the stomach qi has arrived. When she moves with force, the sinew qi has arrived. When she plays with her partner’s breasts, the flesh qi has arrived. When her brows frequently knit, the liver qi has arrived. When she grasps and fondles the jade stem, the blood qi has arrived. When slick fluids flow forth, the spleen qi has arrived. When she sucks her partner’s tongue, the lung qi has arrived. Only when all eight have arrived may coupling proceed.\n\n---\n\n**7. Playful Teasing and Timing**\n\nBefore coupling, first compose the spirit and settle the nature. Embrace the woman, warmly caress and tease her. Suck her lips and tongue, pinch her breasts. Have her grasp and fondle the jade stem until her heart stirs. Then, with the hand, explore her yin gate—only when slick fluids appear may the cauldron be entered. Proceeding gently according to method, the woman will surely be delighted and reach her peak first.\n\n---\n\n**8. Stirring the Heart’s Passions**\n\nA woman’s passions lie deep and hidden. How to arouse them? How to know when they are aroused? To stir her, if she craves wine, offer fragrant spirits; if she is tender-hearted, whisper sweet words; if she loves wealth, bestow silks and coins; if she delights in pleasure, present a mighty instrument. A woman’s heart is never fixed—seeing the scene, her passions will arise without fail.\n\nTo know when she is aroused: she may pant and tremble without cease; her eyes may close, her nose flare, and she may be unable to speak; her gaze may grow dull and fixed; her ears may redden, her face flush, and her tongue tip turn slightly cold; her hands may grow hot, her belly warm, and her speech become disordered; her spirit may wander, her body soften, and her limbs grow limp; her tongue may dry, her body press close, or the pulse of her yin gate may quicken and slick fluids overflow—all these are signs of stirred passion. At this time, the man must not act hastily. Proceeding slowly to gather, he will obtain true yang.\n\n---\n\n**9. Tempering the Blade and Nurturing Sharpness**\n\nDuring coupling, if the jade stem is long and fills the yin gate, the woman’s passions will surely be satisfied and her pleasure complete. There is a method to enlarge the stem. As the saying goes, *\"A craftsman must sharpen his tools to do his work well\"*—this cannot be ignored.\n\nEach day, between midnight and noon, when yin wanes and yang waxes, sit upright in a quiet chamber, facing east, clothed but barefoot. Compose the spirit and empty the mind. The belly should not be full—fullness causes qi to stagnate and blood to congeal—but neither should it be empty, for hunger quickens the flow of blood and qi. Exhale turbid qi through the mouth, then inhale clear qi through the nose. Swish the saliva, close the throat, and send it down to the cinnabar field, guiding it into the jade stem. Repeat this seven times, or fourteen, twenty-one, up to forty-nine times.\n\nRub the hands together until hot as fire. With the right hand, support the scrotum and stroke the jade stem. With the left hand, massage below the navel in a counterclockwise circle eighty-one times. Then switch hands, massaging clockwise eighty-one times. Next, extend the right hand to the coccyx, lift the root of the jade stem upward, pinch it at the base, and swing it against the left and right thighs without counting the strokes.\n\nAfterward, embrace the woman and slowly insert the jade stem into the yin gate. Gather her fluids, inhale her nasal qi, close the throat, and send it to the jade stem to nurture it. Then, rub the stem between the hands as if twisting a rope, without counting the strokes. Over time, it will naturally grow long and large.\n\nWhen engaging in battle, first bind the root of the stem with a silk sash. Then, with both hands, lift the scrotum and stem together. Swish the saliva, inhale qi, and swallow it down to the cinnabar field. Raise the coccyx to meet it, uniting upper and lower to strengthen the yang force before proceeding.\n\n---\n\n**10. Drilling Troops and Practicing Warfare**\n\nWhen first beginning, suppress all desire. Practice first with a coarse or unattractive cauldron to avoid excessive arousal or overwhelming pleasure, making control easier. Proceed slowly: gently enter, firmly withdraw, three shallow thrusts to one deep, completing eighty-one cycles as one round. If passion stirs, immediately halt and withdraw, leaving only an inch inside. Wait until the heart’s fire settles and breathing steadies, then resume the previous method. Next, perform five shallow thrusts to one deep, then nine shallow to one deep. Avoid impatience or haste. Practicing for half a month will bring mastery.\n\n---\n\n**11. The Art of Securing Victory**\n\nWhen encountering a truly beautiful cauldron, the heart will surely grow fond. Yet during coupling, one must feign disdain and steady the spirit. Move the jade stem slowly within the cauldron, completing one or two or three rounds. Then pause to rest the qi and calm the heart. After a moment, resume according to method. When her pleasure grows intense and she seems unable to endure, increase tenderness—she will surely reach her peak first. At that time, attack and gather according to method.\n\nIf one feels the urge to release, swiftly withdraw the jade stem and apply the sealing and closing method to quell the impulse. Once qi is settled and breathing even, resume the attack. In battle, never rush; in gathering, never hasten. Proceed with care.\n\nThese nine sections must be studied and integrated to grasp their subtleties.\n\n---\n\n**12. Sealing and Closing the Mysterious Pass**\n\nSealing and closing is the method of *\"damming the Yellow River with a single hand.\"* Impetuous individuals must practice for over twenty days to achieve closure. Those of calm and quiet nature may succeed in ten days or so. After a month of practice, the golden pass will be eternally secure, the jade gate perpetually barred. One may act at will without leakage—this is the wondrous application of the method.",
      "overlap_context": "y attain longevity.\n\n---\n\n**4. The Precious Cauldron Within the Furnace**\n\nThe cauldron is the vessel for forging the divine elixir, the furnace for warming the true and nurturing qi. It must be a beautiful woman who has never given birth, pure and fair, without foul breath or bodily odors—this is the true cauldron, and using her brings great supplementation. All others, especially those described in the Five Abandonments, must not be used.\n\n---\n\n**5. The Man’s Observation of the Four Arrivals**",
      "start_char": 915,
      "end_char": 2210,
      "start_sentence": 46,
      "end_sentence": 105,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.89755368232727,
      "metadata": {
        "source_file": "dao\\藏外\\紫金光耀大仙修真演义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "且如交合时，玉茎缓缓进退，三浅一深，瞑目缄口，但鼻中微引气，则不喘急。 稍觉欲泄，速将腰身一提，掣退玉茎寸许不动，吸气一口，提上丹田，上向脊胁，起尾闾，夹缩下部，如忍大小便急甚之状。 按定心神，存想夹背之下尾闾之穴，有我精气为至宝，不可走失，随吸精气，一口咽之。 少顷势定，仍前缓缓用功。 稍觉情美，又复掣退，吸气定神，夹缩存想，方得不泄也。 且人身气脉，上下周流，先不预制，直至快乐时，欲炽难遏，致使气导精出，以取自损。 欲强闭之，则败精必流入膀胱肾囊，致生小肠膀胱气及肾冷肿痛之疾。 大概欲未萌时，预为提掣，频频定住，庶玉茎不倒，筋力有余，扇鼓五千之数，方许一泄败精。 而元阳真气常住丹田，以养精神。 果能久行，一宵可敌十女，故曰锁闭玄关。 （十三）三峰大药 上曰红莲峰，药名玉泉，又曰玉液，曰醴泉，在女子舌下两窍中出。 其色碧，为唾之精。 男子以舌舔之，其泉涌出华池，咂之咽下重楼，纳于丹田，能灌溉五藏，左填玄关，右补丹田，生气生血也。 中曰双荠峰，药名蟠桃，又曰白雪，曰琼浆，在女人两乳中出。 其色白，其味甘美。 男子咂而饮之，纳于丹田，能养脾胃，益精神，吸之能令女经脉相通，身心舒畅，上透华池，下应玄关，使津气盈溢。 三采之中，此为先务。 若未生产女人无乳汁者，采之更有补益。 下曰紫芝峰，号曰虎洞，又曰玄关，药名黑铅，又名月华，在女人阴宫。 其津滑，其关常闭而不开，凡媾会，女情姹媚，面赤声颤，其关始开，气乃泄，津乃溢。 男子以玉茎掣退寸许，作交接之势，受气吸津，以益元阳，养精神。 此三峰大药也。 惟知道者，对景忘情，在欲无欲，乃能得之。 所以发白再黑，返老还童，长生不老也。 （十四）五字真言 曰存，曰缩，曰抽，曰吸，曰闭。 存者，想也。 交媾之时，觉精欲泄，速将玉茎掣退，缄口瞑目，存想我夹背之下尾闾穴，有我命门精气所在，为我至宝，不可走失。 但体交而神不交，不可着意也。 依法存想，纵泄亦不多，力亦不倦。 久能行之，则无泄漏矣。 此存字之义也。 缩者，畏缩不敢进也。 精气欲泄，速缩胁掣退玉茎，提吸气一口，直上丹田，胁起尾闾，夹缩下部，不令气下，如忍大小便之状，定息存想，不得动作。 少顷势歇，口吁出气，两手抱女，咂女舌，取津咽五七次，送下丹田，可以再御不倦。 盖初下手时，切忌骤入径进，大势一发，难以制御。 设或强闭，恐败精不散，反生他疾。 大概频提频掣，不至纵欲则易制御。 此缩字之义也。 存、缩二字，工夫并行，无先无后，此男子闭精法也。 抽者，采取也。 交媾之时，女若欢娱，必气喘声颤。 男子当缄口，缓缓柔进刚退，不可燥急令深。 只进半步，以鼻引女鼻气，吸之入腹，不可口吸，吸口则伤脑。 一吸一抽，所谓上吸其气，下吸其津也。 少顷，其气上下相应，阳物自然坚硬。 稍觉难禁，宜速掣退，依存想之法，庶无走泄。 此抽之义也。 吸者，翕入也。 女人既泄，男子当掣退玉茎寸许，作半交接之势，上吸鼻气，下吸滑津。 盖鼻为天门，下为命门，天门居上元，命门居下元，灵柯吸取，一时水火不能到，当以鼻同吸天门也。",
      "translated_text": "When engaging in union, let the jade stem advance and retreat slowly, employing the \"three shallow, one deep\" method. Close the eyes and seal the mouth, drawing qi gently through the nose to prevent panting. At the first sign of impending release, swiftly lift the waist and hips, withdrawing the jade stem by an inch without further movement. Inhale deeply, drawing the qi upward to the cinnabar field, then guide it along the spine to the coccyx, contracting the lower region as if restraining an urgent need to relieve oneself. Focus the mind and spirit, visualizing the acupoint beneath the tailbone—where one’s essence and qi reside as the most precious treasure—lest it be lost. With each inhalation, draw the essence and qi inward and swallow once. After a moment, when the impulse subsides, resume the slow and deliberate practice. Should pleasure arise again, repeat the withdrawal, inhalation, and visualization to prevent leakage.\n\nThe qi and meridians of the human body circulate ceaselessly from top to bottom. If one does not prepare in advance, by the time pleasure peaks and desire becomes uncontrollable, qi will guide essence outward, leading to self-harm. Attempting to forcibly restrain it may cause stagnant essence to flow into the bladder or kidney sac, resulting in disorders such as qi stagnation in the small intestine or bladder, or cold-induced swelling and pain in the kidneys. Generally, before desire arises, one should repeatedly lift and withdraw, frequently pausing to stabilize the jade stem, ensuring it does not wilt and that vigor remains abundant. Only after five thousand thrusts may one allow the release of stagnant essence, while the true yang qi of original vitality remains stored in the cinnabar field to nourish the spirit. With prolonged practice, one night’s effort may rival ten women—hence the name, *Sealing and Closing the Mysterious Pass*.\n\n**13. The Three Peaks and the Great Elixir**\n\nThe upper peak is called *Red Lotus Peak*. Its elixir is named *Jade Spring*, also known as *Jade Fluid* or *Sweet Spring*, and it flows from the two apertures beneath a woman’s tongue. Its color is azure, and it is the essence of saliva. When a man licks it with his tongue, the spring wells forth into the *Flower Pool*. Sucking and swallowing it, he sends it down the *Tower of Nine Stories* into the cinnabar field, where it irrigates the five viscera, replenishes the *Mysterious Pass* on the left, and fortifies the cinnabar field on the right, generating qi and blood.\n\nThe middle peak is called *Twin Watercress Peak*. Its elixir is named *Coiled Peach*, also called *White Snow* or *Jade Nectar*, and it issues from a woman’s two breasts. Its color is white, and its taste is sweet and rich. When a man sucks and drinks it, sending it to the cinnabar field, it nourishes the spleen and stomach, enhances the spirit, and through absorption, harmonizes the woman’s meridians, easing her body and mind. It ascends to the *Flower Pool* and descends to the *Mysterious Pass*, causing essence and qi to overflow. Among the three peaks, this is the first priority. Even in women who have not given birth and lack milk, its absorption yields even greater benefits.\n\nThe lower peak is called *Purple Mushroom Peak*, also known as *Tiger’s Den* or *Mysterious Pass*. Its elixir is named *Black Lead*, or *Moon Essence*, and it resides in the woman’s *Yin Palace*. Its fluid is slick, and its gate remains closed until, during union, the woman’s passion becomes tender and enchanting, her face flushed and voice trembling—only then does the gate open, qi disperse, and fluid overflow. The man withdraws the jade stem by an inch, maintaining the posture of union, receiving qi and absorbing fluid to replenish his original yang and nourish his spirit.\n\nThese are the *Three Peaks and the Great Elixir*. Only those who understand the Dao, who forget passion in the presence of desire and dwell in desirelessness, can attain them. Thus, white hair turns black again, old age reverts to youth, and one achieves longevity without aging.\n\n**14. The Five-Character True Mantra**\n\n*Cun* (Visualize), *Suo* (Contract), *Chou* (Withdraw), *Xi* (Absorb), *Bi* (Seal).\n\n*Cun* means visualization. During union, when one senses essence is about to release, swiftly withdraw the jade stem, seal the mouth, and close the eyes. Visualize the acupoint beneath the tailbone, where the essence and qi of the *Life Gate* reside as one’s most precious treasure, which must not be lost. Let the body unite while the spirit remains detached, without fixation. By visualizing thus, even if release occurs, it will be minimal, and vigor will not wane. With prolonged practice, there will be no leakage. This is the meaning of *Cun*.\n\n*Suo* means contraction, as in shrinking back without daring to advance. When essence is about to release, swiftly contract the flanks, withdraw the jade stem, and inhale deeply, drawing qi straight to the cinnabar field. Lift the coccyx, contract the lower region as if restraining an urgent need to relieve oneself, and hold the breath, visualizing without movement. After a moment, when the impulse subsides, exhale through the mouth, embrace the woman, suck her tongue, and swallow her fluid five to seven times, sending it to the cinnabar field. This allows one to resume union without fatigue.\n\nAt the outset, one must avoid hasty or deep penetration, for once the great impulse surges, it becomes difficult to control. Forcing restraint may cause stagnant essence to disperse improperly, leading to other illnesses. Generally, frequent lifting and withdrawal make it easier to govern desire without indulgence. This is the meaning of *Suo*.\n\n*Cun* and *Suo* are practiced simultaneously, without priority—this is the method for men to seal their essence.\n\n*Chou* means extraction. During union, if the woman experiences pleasure, her breath will quicken and her voice tremble. The man should seal his mouth, advance gently and withdraw firmly, avoiding haste or depth. He enters only halfway, drawing the woman’s nasal qi into his abdomen through his own nose, never through the mouth, for oral inhalation harms the brain. With each inhalation and withdrawal, he absorbs her qi above and her fluid below. After a moment, when qi harmonizes above and below, the yang organ naturally hardens. At the first sign of difficulty in restraint, he should swiftly withdraw and apply the visualization method to prevent leakage. This is the meaning of *Chou*.\n\n*Xi* means absorption. Once the woman has released, the man withdraws the jade stem by an inch, maintaining a half-union posture. He absorbs nasal qi above and slick fluid below. The nose is the *Heavenly Gate*, and below lies the *Life Gate*—the *Heavenly Gate* governs the upper elixir, while the *Life Gate* governs the lower elixir. When the *Spiritual Stalk* absorbs, water and fire cannot reach simultaneously, so the nose must absorb in unison with the *Heavenly Gate*.",
      "overlap_context": "grated to grasp their subtleties.\n\n---\n\n**12. Sealing and Closing the Mysterious Pass**\n\nSealing and closing is the method of *\"damming the Yellow River with a single hand.\"* Impetuous individuals must practice for over twenty days to achieve closure. Those of calm and quiet nature may succeed in ten days or so. After a month of practice, the golden pass will be eternally secure, the jade gate perpetually barred. One may act at will without leakage—this is the wondrous application of the method.",
      "start_char": 2210,
      "end_char": 3510,
      "start_sentence": 106,
      "end_sentence": 157,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.2389702796936,
      "metadata": {
        "source_file": "dao\\藏外\\紫金光耀大仙修真演义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "一抽一吸，上下相应，如竹管引水逆流而上。 能依此术，大益精补阳，精神自固。 然久行则损女人，待将息数时方可再御。 此吸字之义也。 抽、吸出入，上下贯通，抽中有吸，二字并行，乃女人既泄，男采其津之法也。 闭者，缄口也。 交战之时，当瞑目缄口，闭气而不令出，但以鼻微微导引相应，自不致喘。 若不缄闭，则人门通天门，天门通命门，肾府天门不固而上走，元阳精液必纵下而泄也。 若人门固闭，脑气下降肾宫，流入琼台，上下周流，精气化洽，永无泄矣。 此闭字之义也。 闭字制于四字之中，初交便宜，定息缄气，至终不可放失，则闭之一字，久与四字工夫并行也。 （十五）采炼有序 仙歌曰：“女人兴无穷，先令情意浓。 徐徐方与战，上将必成功。 ”盖欲交合，先将鼎握抱，摩弄双乳，咂唇舌，使彼兴动后，方纳阳物于阴，缓缓交合，行九九之数，合目缄口，频频提掣，金枪不倒，此先采下峰也。 下采既浓，女气发舒而上应中峰，吾款抱之，左右吸咂其汁而咽之，其美既得乃止，此次采中峰也。 中采既浓，女气又发扬透于上峰，吾纵舌于彼舌下，搅其两窍，吸其津而咽者再三，此三采上峰也。 上采既已，女必欢极，阴中真气方泄，乃以灵柯掣退寸许，耸身如龟，提气一口，直上丹田，容彼气而吸彼津，搬运周流，然后三采全矣。 而女人亦上下通快，气脉顺畅矣。 后亦吁气一二口，令女吸而咽之，以安其神气。 盖此术已通，取彼既泄之真，还我不泄之精，在彼不甚损，在我大有益。 阴阳相得，水火既济，御女之妙用也。 （十六）搬运有时 女人若泄，必有气喘声颤等状之验。 此际当宁心息气，抱定女子，上采玉泉，中采蟠桃，下采月华，炼而得之，搬运从尾闾逆上两道白脉，串夹背，透昆仑，入泥丸，流注于口，化为琼浆，咽下重楼，直至丹田。 名曰黄河逆流，能填精补髓，益寿延年。 其诀在“提气咽气，存想穴道”。 所谓“神到则气到，气到则精到”是也。 （十七）全义尽伦 夫人之生，有男女而后有夫妇。 夫妇为人伦之始，匪媾合则无以洽恩浃义，是乖伦也。 然男属阳，阳易动而易静； 女属阴，阴难动而难静。 今人媾合，不知制御，恣意扇鼓，须臾即泄，往往不满女欲。 若依采战之法，入炉时缓缓按纳，不可急躁，缓者易制，躁者难遏，且不可令女人拍动我腰眼，进退悠久，依法采战，不惟有补于身，且使女爱恋。 男畅女美，彼此均益，乃夫妇全义之道，尽伦之事也。 （十八）回荣接朽 人之修真养命，犹木之接朽回荣。 以人补人，以枝接木，其理一也。 仙歌曰：“世人不识长生理，但看桑间接树梨。 ”凡欲施工，须得十全宝鼎，数在十五之上、三十之下。 女人二七为少阴，三七为盛阴，四七为壮阴。 少阴养身，盛阴益寿，宜取而温养之。 待赤潮辐凑，勿使大过，无不及，是吾利用。 久久采炼，则留形住世。 女至五七为衰阴，六七为太阴，七七为竭阴，当知远之。 尤忌太肥者，脉难通； 太瘦者，肌液少； 劳者，神气不足； 弱者，反伤阳神； 惫者，阴寒； 病者，阴毒。 皆谓阴贼，皆在所避也。 且采补在吾方寸，须心神虚寂，念虑安闲，识避忌，察证候，抽添缓缓，玩戏徐徐，弱入强出，审于欲泄未泄之先；",
      "translated_text": "A single withdrawal and a single absorption, above and below responding to each other, like water drawn upward through a bamboo tube in reverse flow. By practicing this method, one greatly benefits in replenishing essence and strengthening yang, and the spirit naturally stabilizes. However, prolonged practice harms the woman, so one must wait for her to rest for several hours before engaging again. This is the meaning of *Xi*.\n\nWithdrawal and absorption, in their ebb and flow, connect above and below—within withdrawal lies absorption, and the two proceed in tandem. This is the method by which, after the woman has released, the man absorbs her fluid. *Bi* means sealing the mouth. During intercourse, one should close the eyes and seal the mouth, holding the breath without letting it escape, using only the nose to subtly guide and harmonize, thus avoiding panting. If not sealed, the *Human Gate* connects to the *Heavenly Gate*, and the *Heavenly Gate* connects to the *Life Gate*; if the *Heavenly Gate* of the kidney palace is not secure, it ascends and scatters, and the primordial yang essence will inevitably flow downward and leak. If the *Human Gate* is firmly sealed, brain qi descends to the kidney palace, flows into the *Jade Terrace*, and circulates above and below, transforming essence and qi into harmony, forever preventing leakage. This is the meaning of *Bi*.\n\nThe character *Bi* governs the four characters: at the onset of intercourse, one should regulate the breath and seal the qi, and until the end, one must not lose this restraint. Thus, the character *Bi* is practiced in tandem with the four-character method for a long time.\n\n---\n\n**15. Sequential Absorption and Refinement**\nThe immortal song says:\n*\"When a woman’s desire is boundless,\nFirst stir her passion deep.\nProceed slowly in the battle,\nAnd the general shall surely triumph.\"*\n\nBefore intercourse, first embrace the crucible, caress her breasts, and kiss her lips and tongue to arouse her desire. Only then should the yang organ enter the yin, engaging slowly in union, performing the nine-nines count. Close the eyes and seal the mouth, frequently withdrawing and thrusting, keeping the golden spear unswaying—this is the initial absorption of the lower peak.\n\nOnce the lower absorption is intense, the woman’s qi expands upward to respond to the middle peak. Gently embrace her, alternately inhaling and sipping her fluids, swallowing them until satisfaction is attained—this is the absorption of the middle peak.\n\nWhen the middle absorption is intense, the woman’s qi further rises to the upper peak. Extend your tongue beneath hers, stirring both orifices, repeatedly absorbing her fluid and swallowing it—this is the absorption of the upper peak.\n\nAfter the upper absorption is complete, the woman will reach utmost joy, and her true yin qi will be released. Withdraw the *Spiritual Stalk* by an inch, raise the body like a turtle, draw in a breath of qi, and direct it straight to the *Cinnabar Field*. Contain her qi and absorb her fluid, circulating and refining them—then the three absorptions are complete, and the woman, too, will feel thorough pleasure, her qi and pulse flowing smoothly. Afterward, exhale one or two breaths, letting her inhale and swallow them to calm her spirit and qi.\n\nThis method, once mastered, takes her released essence and returns it to one’s own unspent essence. For her, the harm is minimal; for oneself, the benefit is great. Yin and yang unite, water and fire achieve harmony—this is the wondrous application of the art of intercourse.\n\n---\n\n**16. Timely Circulation**\nWhen the woman releases, signs such as panting, trembling, or moaning will appear. At this moment, calm the mind and regulate the breath, holding the woman firmly. Absorb the *Jade Spring* above, the *Coiling Peach* in the middle, and the *Moonlight* below, refining and gathering them. Circulate them from the *Weilü*, ascending in reverse along the two white meridians, threading through the spine, piercing the *Kunlun*, entering the *Mud Pill*, and flowing into the mouth, where it transforms into *Jade Nectar*. Swallow it down the *Heavy Tower* until it reaches the *Cinnabar Field*. This is called *Reversing the Flow of the Yellow River*, which fills essence and replenishes marrow, prolonging life and extending years. The key lies in \"lifting qi and swallowing qi, visualizing the meridian pathways.\" As the saying goes: *\"Where the spirit goes, qi follows; where qi goes, essence follows.\"*\n\n---\n\n**17. Fulfilling the Dao of Marriage**\nHuman life begins with male and female, and from them arises the union of husband and wife—the foundation of human ethics. Without intercourse, there can be no deepening of affection and fulfillment of duty, which would violate ethical norms.\n\nMan belongs to yang, which is easily aroused and easily calmed; woman belongs to yin, which is difficult to arouse and difficult to calm. Most people, during intercourse, do not know how to control themselves, indulging in reckless stimulation and releasing in an instant, often failing to satisfy the woman’s desire. If one follows the method of absorption and battle, entering the crucible slowly and gently, without haste, for what is slow is easy to control, and what is hasty is difficult to restrain. Moreover, one must not let the woman clasp and move one’s waist. Withdrawing and thrusting leisurely, practicing the method of absorption and battle, not only benefits the body but also makes the woman affectionate. When man is fulfilled and woman is delighted, both derive equal benefit—this is the Dao of fulfilling marital duty and completing ethical relations.\n\n---\n\n**18. Reviving the Withered**\nCultivating the Dao and nourishing life is like grafting a withered tree to revive its vitality. Using one person to replenish another is akin to grafting a branch onto a tree—the principle is the same.\n\nThe immortal song says:\n*\"The world does not understand the principle of longevity,\nBut look to the mulberry grove where pears are grafted.\"*\n\nFor this practice, one must obtain a perfect precious crucible, ideally a woman between fifteen and thirty years of age. At fourteen (two sevens), she is *Lesser Yin*; at twenty-one (three sevens), she is *Abundant Yin*; at twenty-eight (four sevens), she is *Robust Yin*. *Lesser Yin* nourishes the body, *Abundant Yin* benefits longevity—these are suitable for warming and cultivation. Wait until her *Crimson Tide* converges, neither excessive nor deficient, for this is the optimal time for one’s use. With prolonged absorption and refinement, one may preserve form and abide in the world.\n\nAt thirty-five (five sevens), she becomes *Declining Yin*; at forty-two (six sevens), *Greater Yin*; at forty-nine (seven sevens), *Exhausted Yin*—one should distance oneself from these. Particularly avoid those who are overly plump (whose meridians are difficult to penetrate), overly thin (whose fluids are scant), fatigued (whose spirit and qi are insufficient), weak (who harm one’s yang spirit), weary (whose yin is cold), or ill (whose yin is toxic). All these are *Yin Predators* and must be avoided.\n\nMoreover, absorption and replenishment depend on one’s own mind. The heart and spirit must be empty and tranquil, thoughts calm and leisurely. Recognize taboos, observe signs, withdraw and thrust gently, play and frolic slowly. Enter weakly and exit strongly, discerning the moment just before the urge to release.",
      "overlap_context": "the meaning of *Chou*.\n\n*Xi* means absorption. Once the woman has released, the man withdraws the jade stem by an inch, maintaining a half-union posture. He absorbs nasal qi above and slick fluid below. The nose is the *Heavenly Gate*, and below lies the *Life Gate*—the *Heavenly Gate* governs the upper elixir, while the *Life Gate* governs the lower elixir. When the *Spiritual Stalk* absorbs, water and fire cannot reach simultaneously, so the nose must absorb in unison with the *Heavenly Gate*.",
      "start_char": 3510,
      "end_char": 4783,
      "start_sentence": 158,
      "end_sentence": 211,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.26826357841492,
      "metadata": {
        "source_file": "dao\\藏外\\紫金光耀大仙修真演义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "掣退存留，明于将动已动之际。 运舟在尺木，发弩由寸机。 明知之士，以意逆之可也。 （十九）还元返本 还元者，挽回之法也。 离中真阴，无体有信，其火好飞腾，顺用则孕体成人，逆用则结珠成宝。 所谓“黄河翻浪，挽回依旧返天门”也。 采炼时既用存缩以闲之矣，又用抽吸以取之矣。 然下马无法，何以返还而散布哉？ 事毕，须平身舒脚，头安枕上，脚跟着床，体皆悬空，极力闭气，动摇其身三五次，令鼻出气，匀匀行之。 若面觉热，乃是精气已升泥丸，即用两手搓擦面皮，使热以放过开。 随又合唇止息，舌搅华池，神水咽下丹田，方得精气周流，为我有用之物。 如此日就月将，可以逍遥云汉，游宴黄庭矣。 （二十）种子安胎 男女交媾，采取则益寿延年，施泄则安胎种子。 传云：“不孝有三，无后为大。 ”则种子又人生之要务也。 男子先须补精益肾，使阳气壮盛； 女人亦宜调精养血，使子宫和暖。 再候月事已过，红脉方尽，子宫正开，正宜交合。 一日成男，二日成女，阳奇阴偶之义也。 依法则生子禀原德明，无疾病而易养。 越五日后，则阴户闭，为虚交矣。 交合必两情俱感乃有应验。 倘男情先动而精至，女尚未动，精虽至而不纳； 或女情先动而兴过，男兴未已，精后至而亦不纳也。 惟两情俱美，男深纳玉茎施泄，女耸腰收接入宫，合止片时然后退，令女正身仰卧，百试百效也。 又子午为太阳时，交合则生男； 卯酉为太阴时，交合则生女。 又阴血先至，阳精后冲，则血开闭精，精入为骨而成男； 阳精先至，阴血后参，则精开裹血，血在内而成女。 精血齐至为双胎，理或然也。 因附录之。 跋",
      "translated_text": "Withdrawal and retention must be mastered in the moment between impending movement and actual movement. Steering the boat lies in the stern timber; loosing the crossbow depends on the trigger’s inch. The adept, knowing this, may guide it with intention.\n\n(19) Returning to the Origin and Reverting to the Root\n\"Returning to the Origin\" is the method of reversal. The true yin within *li* is formless yet reliable; its fire delights in soaring. When used in accord, it nurtures the embryo into a person; when used in reverse, it coagulates the pearl into treasure. This is what is meant by *\"The Yellow River’s waves overturn, drawn back to re-enter the Celestial Gate.\"*\n\nDuring absorption and refinement, one has already employed contraction and stillness to restrain it, and extraction and suction to gather it. Yet without a method for dismounting, how can it be returned and dispersed? After the act, one must lie flat, legs stretched, head resting on the pillow, heels pressed to the bed, the body entirely suspended. Exert all effort to hold the breath, swaying the body three to five times, then exhale through the nose, evenly and steadily.\n\nIf the face feels warm, it signals that the essence-qi has ascended to the *Niwan Palace*. Immediately rub the face with both hands to release the heat. Then, seal the lips to halt breathing, stir the *Flower Pool* with the tongue, and swallow the divine water into the *dantian*. Only then does the essence-qi circulate fully, becoming a substance of use to oneself. Through daily practice and monthly progress, one may wander the celestial clouds and feast in the *Yellow Court*.\n\n(20) Planting the Seed and Securing the Fetus\nIn the union of man and woman, absorption brings longevity and extended years, while release secures the fetus and plants the seed. As the saying goes, *\"Of the three unfilial acts, having no posterity is the greatest.\"* Thus, planting the seed is a vital duty of life.\n\nA man must first replenish his essence and strengthen his kidneys to invigorate his yang qi. A woman should likewise regulate her essence and nourish her blood to warm and harmonize her womb. Then, wait until her monthly flow has passed, the red pulse fully ceased, and the womb’s gate is open—this is the proper time for union. On the first day, a boy is conceived; on the second, a girl—such is the principle of yang as odd and yin as even. Following this method, the child will inherit bright virtue, be free of illness, and easy to raise. After five days, the womb’s gate closes, and the union becomes empty.\n\nFor success, both partners must be equally aroused. If the man’s desire stirs first and his essence arrives while the woman remains unmoved, the essence, though present, will not be received. Or if the woman’s desire stirs first and peaks before the man’s, his essence arrives too late and will likewise not be received. Only when both are equally delighted, the man deeply inserting his jade stem to release, and the woman raising her waist to draw it into her palace—only then, after a brief pause before withdrawing, should she lie flat on her back. This method proves effective in every trial.\n\nMoreover, union at the *zi* or *wu* hours (peak yang) yields a boy; union at the *mao* or *you* hours (peak yin) yields a girl. If yin blood arrives first and yang essence follows, the blood opens to enclose the essence, which enters to form bone—thus a boy is conceived. If yang essence arrives first and yin blood follows, the essence opens to envelop the blood, which remains within—thus a girl is conceived. If essence and blood arrive simultaneously, twins may result—a principle that may well hold true.\n\nHere ends the appended record.",
      "overlap_context": "ed (whose spirit and qi are insufficient), weak (who harm one’s yang spirit), weary (whose yin is cold), or ill (whose yin is toxic). All these are *Yin Predators* and must be avoided.\n\nMoreover, absorption and replenishment depend on one’s own mind. The heart and spirit must be empty and tranquil, thoughts calm and leisurely. Recognize taboos, observe signs, withdraw and thrust gently, play and frolic slowly. Enter weakly and exit strongly, discerning the moment just before the urge to release.",
      "start_char": 4783,
      "end_char": 5436,
      "start_sentence": 212,
      "end_sentence": 245,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.072205781936646,
      "metadata": {
        "source_file": "dao\\藏外\\紫金光耀大仙修真演义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "世宗朝，余受廪燕京。 于时陶真人以术见幸。 迹其所为，皆幻怪不经，独采补为有实际，故献庙之享有遐龄，皆由于此。 余慕其术，赂所藏秘诀，得纯阳子师徒经义二书，遵而行之。 初若难制，久出自然。 六十年间，御女百余，育儿十七，身历五朝，眼见五代。 今虽告老，房中不厌，间一媾合，必敌数人。 虽天逸我以年，而采补之功亦不可掩。 语云：擅巧者不祥。 且人生不满百，倘一旦先朝露，不忍二书失传，爰付梓人，用广大仙之德，愿与斯世同跻彭老之年也。 如曰荒唐无稽，是自弃其寿也，其于余也何尤？ 万历甲午春壬正月 越人九十五岁翁书于天台之紫芝室",
      "translated_text": "During the reign of Emperor Shizong, I received my government stipend in Yanjing. At that time, Master Tao, the Perfected One, had gained imperial favor through his arts. Though most of his practices were illusory and unorthodox, his methods of *cai bu* (yin-yang cultivation) alone proved substantial in effect. Thus, the sacrifices offered at the ancestral temple were graced with longevity—all owing to this. Admiring his techniques, I bribed his disciples to obtain their secret transmissions and acquired two texts: the *Pure Yang Master’s* teachings and the *Scripture of Master and Disciple*. Following their instructions, I practiced diligently. At first, control was difficult, but with time, it became effortless. Over sixty years, I bedded over a hundred women, fathered seventeen children, served five emperors, and witnessed five dynasties. Though now retired, I remain tireless in the bedchamber; even a single union suffices for several partners. Though Heaven has granted me years beyond measure, the merits of *cai bu* cannot be concealed.\n\nAs the saying goes: *\"He who excels in artifice courts misfortune.\"* Yet man’s lifespan rarely reaches a hundred—should I perish like morning dew, I could not bear to let these two texts vanish. Thus, I entrust them to the woodblock carver, that the virtue of the Great Immortal may spread, and all in this world may together ascend to the age of Peng and Lao. If one dismisses this as absurd and baseless, they forsake their own longevity—what fault lies with me?\n\nWritten in the spring of the *jiawu* year of the Wanli era, first month of the *ren* cycle, by the Old Man of Tiantai, aged ninety-five, in the Purple Ganoderma Chamber.",
      "overlap_context": " (peak yang) yields a boy; union at the *mao* or *you* hours (peak yin) yields a girl. If yin blood arrives first and yang essence follows, the blood opens to enclose the essence, which enters to form bone—thus a boy is conceived. If yang essence arrives first and yin blood follows, the essence opens to envelop the blood, which remains within—thus a girl is conceived. If essence and blood arrive simultaneously, twins may result—a principle that may well hold true.\n\nHere ends the appended record.",
      "start_char": 5439,
      "end_char": 5708,
      "start_sentence": 246,
      "end_sentence": 258,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.151604175567627,
      "metadata": {
        "source_file": "dao\\藏外\\紫金光耀大仙修真演义.txt",
        "category": "藏外"
      }
    }
  ]
}