{
  "source_id": "紫阳真人悟真直指详说三乘秘要",
  "source_file": "chunked_daozang\\紫阳真人悟真直指详说三乘秘要.json",
  "total_chunks": 18,
  "total_original_chars": 12525,
  "total_translated_chars": 65078,
  "total_translation_time": 356.81838059425354,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真直指详说三乘秘要.txt",
    "category": "玉诀类"
  },
  "full_translation": "**Jade Instructions of the Cavern of Perfection**\n**Ziyang the Perfected’s Direct Pointers to the Comprehension of Reality: A Detailed Explication of the Three Vehicles’ Secret Essentials**\n\n**Scripture Title:** *Ziyang the Perfected’s Direct Pointers to the Comprehension of Reality: A Detailed Explication of the Three Vehicles’ Secret Essentials*\nOne fascicle. Attributed to Weng Baoguang. Originated in the Southern Song, compiled during the Yuan.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, Jade Instructions of the Cavern of Perfection.\n\n---\n\n### **Direct Pointers to the Comprehension of Reality: A Detailed Explication**\n**By Xiangchuan the Nameless Master, Weng Baoguang**\n\nBefore the manifestation of primordial chaos, there was emptiness and silence—no name could be ascribed, yet by necessity it was called the *Dao/Way*. The Dao descended and gave birth to *One Qi*, neither moving nor still, neither turbid nor clear, vast and unfathomable. The sages, compelled to speak of it, termed it the *Primal True Unity Qi*.\n\nOnce *One Qi* divided, it transformed into *yin* and *yang*. *Yin* and *yang* are Heaven and Earth, male and female. Heaven and Earth intermingle, and the myriad things refine into harmony; male and female unite in essence, and the myriad things take form. Thus, since the existence of Heaven and Earth, there has never been a single thing that did not acquire its shape through the intercourse of *yin* and *yang*.\n\nFor those who seek to refine the elixir: if one takes the forms of metals, minerals, herbs, or trees—each a vessel of myriad differences—or even the spirit, essence, *qi*, blood, and fluids of the body as the substance of the elixir, these are all postcelestial, turbid, and material things. Turbid and material things possess visible form; how can they generate the formless from the formed? They are postcelestial, born within the bounds of Heaven and Earth. All that has form is subject to decay; how can it transform and transcend beyond Heaven and Earth? Failing to transcend beyond Heaven and Earth, all that has form remains bound to the cycles of *yin-yang* and life-and-death. For *yang* governs life, and *yin* governs death; death and life alternate, advance and retreat—this is the natural principle.\n\nEven if one refines and ingests with skill, extending life to the age of the tortoise or the crane, when one’s allotted span is exhausted, none escape death. Like an arrow shot into the sky, when its force is spent, it must fall—such is the inevitable decay of all that has form. Therefore, the sages gather the *precelestial One Qi* as the elixir, refining form to return to *One Qi*, refining *qi* to return to spirit, refining spirit to merge with the Dao, and thus returning to the formless form. Only then can one transcend beyond Heaven and Earth, stand beyond the workings of creation, grasp *yin* and *yang*, and command Heaven and Earth. The transformations of *yin-yang* and life-and-death are governed by the *One Qi* of the Nine Heavens. Thus, one who attains the elixir-body abides in eternal numinosity, neither born nor extinguished.\n\nIt is like moving a jar: one within the jar cannot move it; only by standing outside the jar can one move it. The *True Unity Qi* exists prior to Heaven and Earth, vast and unfathomable. The sages, using things of the same kind, lure it to congeal into the elixir. Just as fire exists within the sun, and one may draw it forth with a burning-mirror; or as water exists within the moon, and one may draw it forth with a moon-receiver. Thus, refining things of the same kind, one establishes the furnace and crucible, calling them the *True Dragon* and *True Tiger*. As Master Lü’s verses say: *\"The natural furnace and crucible, the tiger encircling, the dragon coiling.\"*\n\nThese things of the same kind are *emotionless emotion*, *colorless color*—the purest and most numinous of the myriad things, possessing the correct nature and destiny. For example, the *qi* of the crescent moon: when activated and employed, it is termed *True Lead* and *True Mercury*. The Immortal Elder said: *\"If men wish to know True Lead and True Mercury, they are not common cinnabar or quicksilver—rather, the qi of the crescent moon.\"* The crescent moon refers to the numbers of the waxing and waning phases: eight *liang* for the dragon, half a *jin* for the tiger—hence the term *two eights*. At this time, the source of water is utterly clear, possessing *qi* but no substance. Using this *qi*-kind to lure it, the *True Unity Qi* descends in numinosity and takes form.\n\nThe Immortal Elder said: *\"The medicine meets its kindred qi and assumes form; the Dao abides in emptiness, harmonizing with nature.\"* To refine this Golden Elixir, one must first seek a propitious mountain and blessed land, then construct a refining chamber of several rafters. Erect a three-tiered altar, plant a sword at each of the four directions, and hang mirrors. Only then establish the dragon and tiger as the crucible and furnace, set the water-clock as the measure, regulate the withdrawal and addition with the principles of water and fire, and employ assistants for the work. Such matters cannot be easily expounded; they also require worldly wealth to bring to completion.\n\nThus, Master Yin Zhenjun said: *\"To cultivate this Dao, one must rely on resources. Without resources, the Golden Elixir cannot be accomplished.\"* Furthermore, three people must initiate the work—three of one heart, true companions of singular intent. On the night of the first full moon of the eighth month, at the moment when the *yang* first stirs, the principal adept performs the *Yu* step upon the altar, seizing the dragon with the left hand and the tiger with the right. Refining the *qi* and timing the phases, counting the revolutions of the stars, one aligns Heaven’s correctness with *yin-yang*, synchronizing breath with the water-clock’s marks. Thus, metal and water intermingle, and the dragon’s wood nurtures its essence.\n\nOne sits in meditation, strategizing like a general weaving the warp and weft of scripture and martial arts, ensuring the beginning and end of the process are flawlessly executed, without the slightest deviation. Thus, the Immortal Elder said: *\"It all depends on the power of cultivation; even a hair’s difference will fail to produce the elixir.\"* Another monitors the water-clock’s precision, meticulously adjusting the withdrawal and addition, ensuring the fire-timing is unerring. If the hexagram’s time is exceeded, the elixir will surely fail. Thus, Master Chaoyuan said: *\"I urge you to exhaust the numbers of the celestial revolution; do not let negligence hasten the hexagram’s turn.\"*\n\nWith three people of one heart, mutually verifying each other, in less than half an hour, the *True Unity Qi* is drawn into the Palace of Intercourse, coalescing into a single grain, as large as a millet seed—this is the *Golden Elixir*.\n\nNow within the Northern Sea, a radiant light suddenly pierces the curtains—swiftly and secretly, one must employ the *Mona* technique to pursue it. The moment it enters the mouth, one instantly ascends to the sacred rank. Thus, the Immortal Elder said: *\"Swallow but a single grain of Golden Elixir, and you shall know your fate is not ruled by Heaven.\"*\n\nOnce this single grain is lodged within the Cinnabar Field and Sea of Qi, the essence and qi of the entire body converge upon it, instantly coalescing into cinnabar without any loss. Then, through the firing and refinement, the *Golden Liquid Returned Elixir* is formed. Now, *fire* refers to the qi of yin and yang. Yang numbers are odd, yin numbers even. From *zi* to *si*, the six hours belong to yang—thus called *yang fire*. From *wu* to *hai*, the six hours belong to yin—thus called *yin tally*. The * Qian* hexagram’s tally is two hundred and sixteen; the *Kun* hexagram’s tally is one hundred and forty-four. Within these two scrolls, one seizes the four thousand three hundred and twenty years of *True Qi*, returning it to the Cinnabar Field, where it nurtures the *Child Pearl* and coalesces into the *Sacred Embryo*. Laozi said: *\"Yang’s oddness arises from *zi*; yin’s evenness issues from *wu*. Beginning and end lie in *Qian* and *Kun*; the dark womb is the moon of the mother’s womb.\"*\n\nThus, the external essence and the internal fire of yin and yang are born, and the substance of *Golden Liquid*—without need for forced effort—naturally circulates. From the *Weilü* point, it ascends with a clear, resonant sound, piercing the double passes, reversing upward to the summit of *Niwan*, then descending into the mouth, resembling a sparrow’s egg—fragrant, sweet, and delectable. This is the *Golden Liquid Returned Elixir*. Slowly swallowing it into the Cinnabar Field, it coalesces into the *Sacred Embryo*, nurturing the *Infant*. Thus, the Immortal Elder said: *\"The Infant is one who contains the True Qi; when the ten-month gestation is complete, one enters the sacred foundation.\"*\n\nFor the common fetus, ten months pass before birth; so too with the Sacred Embryo. When the ten months of firing are complete and the work perfected, one sheds the embryo and transforms into a body of pure yang. Cold, heat, hunger, and thirst can no longer disturb it. Only then may one wander in remote mountains and deep valleys, or dwell in humble, secluded places, facing the wall for nine years to empty the heart, where there is neither self nor other, and heart and realm become one—this is called the *Immortals’ Embrace of the One*. At the moment the Chan practitioner gathers the ox, only those who recognize the heart and perceive the nature can embrace it, and thus the Dao flourishes.\n\nAfter nine years of work, the nature of non-action becomes complete, and wisdom naturally arises. The body of pure yang becomes wondrous, and the spirit naturally attains numinosity. Thus, one obtains both nature and life, merging with the Dao in truth and without form. The formless form manifests according to circumstances—encountering wind, it becomes wind; encountering rain, it becomes rain; encountering water or fire, it becomes water or fire. Meeting birds, beasts, grasses, or trees, its transformations are unfathomable—now present, now gone, seen ahead, then suddenly behind. Thus, it can divide into a hundred million bodies, responding without limit. The heart is like the moon reflecting upon ten thousand waters, universally pervading. Therefore, it responds to conditions without fail, meeting every stimulus.\n\nYet the body of utmost truth dwells in the city of utmost stillness, truly never acting. Here, spirit, form, nature, and life merge with the Dao in truth, returning together to the ultimate source of quiescent emptiness. Thus, the sages forcibly name it the *Nine-Turn Golden Liquid Great Returned Elixir*, or the *Indestructible Vajra Body*—the supreme, most true, and wondrous Dao.\n\nThe Immortal Elder alone propagated this Dao, attaining a body of true gold and wondrous hue, manifesting the majestic and luminous visage of true gold, universally appearing throughout the Dharma realm to save and deliver all beings. Thus, he revealed to his disciple Liu Fengzhen the nature-Dao of non-arising, entering quiescence, and later manifested his true body in Wangwu Mountain, demonstrating the twofold Dao of life and nature—imperishable and perfectly penetrating. Therefore, on the fifth day of the third month in the fifth year of the Yuanfeng era, at the time of his liberation by means of the corpse, he left behind these words: *\"The wondrous function of the single spirit pervades the Dharma realm.\"* Without the dual perfection of the Dao of nature and life, and the wondrous union of form and spirit, how could one attain this?\n\nIn this world, he lived for ninety-six years. In his lifetime, he extensively expounded the profound and subtle, composing verses on emotion and nature—his words profound and elegant, guiding those who came after. He titled his work *Awakening to Reality*. *\"Awakening to Reality\"* refers to the truth of nature and life. Yet he feared that later students might know only the Dao of life but not exhaust the nature, or know only the Dao of nature but not nurture life. Thus, he composed a verse on awakening to the *True Suchness* and a hymn on the *Wondrous Treasure of the Colored Body*, to enlighten those of superior wisdom and great capacity, enabling them to fully comprehend the Dao of nature and life, attain ultimate perfection, and transcend the Three Realms. Without the great compassion and equal-hearted wisdom of one who has attained the Dao, who could achieve this?\n\nThough my own understanding is dim, I have received the Immortal Elder’s secret instructions. Thus, through diligent study of this work, I have grasped eight or nine parts of its profound mechanism. Fearing that fellow seekers might not know the source of the Golden Elixir’s lineage, I have traced its origins and essentials from beginning to end, daring to defy heavenly censure by directly pointing to the broad path of *Awakening to Reality*. If there are those with innate affinity for immortality, let them enter directly through the gate of *Awakening to Reality* and seek non-action within the single grain of millet. If sought externally, one cannot hope to attain it.\n\nIn ancient times, the Celestial Venerable of Primordial Beginning suspended a precious pearl, as large as a millet grain, within the empty mystery. Innumerable sacred hosts eagerly entered through the pearl’s mouth—this was none other than the single grain of Golden Elixir. A grain like a millet seed contains all phenomena, encompassing the Three Powers. Vast without boundary, minute without interior, it spans from antiquity to the present. Countless lofty immortals and supreme sages have verified this Dao—who among them did not attain the supreme great Dao through this single grain of millet?\n\nThis Dao is most simple and most easy. Yet without a true teacher’s guidance, none can fathom its deep roots and firm foundation. Even if the root and foundation are known, without great wealth and resources, one cannot accomplish the work or manifest the endeavor.\n\nOnce the work is accomplished and the endeavor manifest, without the clarity of seeing one’s nature, none can attain the subtlety of embracing the One. When embracing the One is perfected, the Dao of nature and life reaches its utmost—nothing more can be added.\n\nThus, the Dao of life is invariably transmitted through a teacher’s guidance before it becomes clear, and through cultivation before it becomes manifest. Yet the Dao of nature is not so—it does not come from without. Without the distractions of external sights and sounds, one falls into the confines of lesser rules and fails to penetrate the ultimate clarity of pure perception. Only by self-awakening and self-illumination within one’s own heart can one fully realize the Dao of nature and attain what is called the Supreme First Vehicle.\n\nAlas, within the Dao of nature, there is no awakening to awaken, no illumination to illuminate—only awakening to nothingness, illuminating nothingness. There is no exhausting to exhaust, no attaining to attain—only exhausting nothingness, attaining nothingness. The Supreme First Vehicle is not supreme in being supreme, not first in being first—only supreme in nothingness, first in nothingness.\n\nShould the disciple grasp the teacher’s intent, seize the celestial mechanism, refine the divine elixir, and undergo the transformation of bone and marrow, then without further need for illuminating the mind or fathoming the root, or awakening to true emptiness, one directly transcends to the Supreme Vehicle and enters the realm of non-action. There, form and spirit are both perfected, nature and life are harmoniously rounded. Mounting cranes and phoenixes, riding dragons and soaring with simurghs, one shall surely join the wanderings of Penglai’s immortal courts.\n\nAs for the art of mighty armies and victorious battles—this is the essence of refining the Golden Elixir. In refining the Golden Elixir, one always begins on the first night of the Mid-Autumn moon, when the yang first stirs. Seated to stabilize the celestial pivot, the altar ascends three tiers. To the left, the Dragon is seized to secure the cauldron’s alignment; to the right, the Tiger is grasped to precisely regulate the firing times. Civil and martial forces contend in battle at the mysterious gate; advance and retreat engage in perilous struggle at the Gate of Life.\n\nBreath aligns with the clepsydra’s marks, the count accords with the celestial revolution—let not a hair’s breadth of deviation arise. Thus is the art of mighty armies and victorious battles.\n\nFor armies are Dragon and Tiger; battle is their union. Within a single double-hour, the Golden Elixir enters the mouth, and the art of victory is manifest. Therefore, the *Western Florescence Scripture* states: “Mighty armies and victorious battles lie in the cultivation of the Mystic Pearl.”\n\nThus the Immortal Elder first arrays sixteen poems to clarify that Dragon and Tiger each bear the number one and eight. One poem of five words and four rhymes signifies that in one double-hour, one grain of Golden Elixir is attained. For this reason, I have divided this into the Upper Scroll, setting it forth to elucidate the art of mighty armies and victorious battles—whereby the work of gathering the Golden Elixir is made perfectly clear.\n\n**The Method of Enriching the State and Pacifying the People**\n\nThe method of enriching the state and pacifying the people is the essence of circulating the yin and yang talismans and firing times. The human Dao is formless, originating in the primal qi. This qi, in its primordial chaos, divides into yin and yang. The purest yang qi, light and clear, rises to cover above—this is called Heaven. The purest yin qi, heavy and turbid, sinks to bear below—this is called Earth. The accumulation of pure yang qi, ascending to Heaven, is the immortal. The accumulation of pure yin qi, sinking into Earth, is the ghost. Endowed with one yin and one yang qi, neither ascending nor sinking, dwelling between Heaven and Earth, capable of becoming immortal or ghost—this is the human.\n\nIf one cultivates and refines, stripping away the yin of the grasses until the form transforms into pure yang qi, one ascends as an immortal. If one knows not cultivation, daily depleting the six yang, until the body transforms into pure yin qi, one becomes a lower ghost. The *Book of Changes* states: “That which is rooted in Heaven inclines upward; that which is rooted in Earth inclines downward.” Each follows its kind.\n\nThus the sage, gazing above and below, knew that humans, endowed with the finest qi of Heaven and Earth, are most numinous, most noble, most supreme. Therefore, they borrowed the two substances of true yin and true yang to seize the primal qi before Heaven and Earth, forming the Elixir. Ingesting it into the Cinnabar Field and Sea of Qi, one governs the postnatal qi of the entire body. Then the qi of the entire body gathers as one—like the myriad states paying court to the sovereign, or the host of stars encircling the North Star.\n\nJust as humans arise from the essence of their parents’ union, so too do they steal the pure qi of yin and yang to serve as the foundation of transformation, called the yin talisman and yang fire. Circulating within the sixty-four hexagrams, revolving without end, cycling the seventy-two seasonal nodes and twenty-four qi within a single day and night, one seizes the four thousand three hundred and sixty measures of true qi, converging them in the Cinnabar Field and Sea of Qi to warm and nurture the Elixir Pearl.\n\nThe Elixir, abiding in the Central Palace, is fundamentally quiescent yet responsive. Thus, externally receiving the yin talisman and yang fire, it generates the true unified divine body. After ten months of womb-transformation, the form transmutes into the pure yang qi of the True One. Hunger and thirst cannot disturb it; cold and heat cannot assail it. Thus is the method of enriching the state and pacifying the people.\n\nFor the state is the body; the people are the essence and qi. The people are the foundation of the state; when the foundation is firm, the state is at peace. If the state lacks a sovereign, the people have no refuge; if the sovereign lacks ministers, the people are untended. Therefore, the sage takes the Elixir as sovereign and fire as minister. When Elixir and fire mutually require each other, sovereign and minister rejoice in union, and the world is governed in peace. Essence is secure, the people are at rest—thus the state of the body is enriched.\n\nThe *Western Florescence Scripture* states: “Essence complete and qi replete—this is how the state is enriched and the people pacified, precisely after ingesting the Golden Elixir.” Thus the Immortal Elder continued with sixty-four quatrains, corresponding to the sixty-four hexagrams of the *Book of Changes*, to clarify the reckoning of firing the lines. He further composed twelve *Moon Over the Western River* poems, symbolizing the firing and bathing practices, completing the work of twelve months. For this reason, I have divided this into the Middle Scroll, to elucidate the method of circulating fire and the meaning of enriching the state and pacifying the people. Such is the proper sequence of Elixir refinement.\n\n**The Dao of Immortals Embracing the One**\n\nThe Dao of immortals embracing the One is the time when the sage’s firing work is complete. When the form has transformed into pure yang qi, the body retreats to a secluded corner, facing the wall for nine years, embracing the One to empty the heart. The heart settles, the spirit transforms, and merges indistinguishably with the Dao.\n\nA eulogy states:\nThe Dao is nature and life; the original nature is the source of the heart.\nHeart and nature are of one body, their transformations boundless.\nThe common people use it daily, yet call it natural.\nIf one can awaken to this, forgetting images and words,\nEmptying the heart and filling the belly, embracing the One to transcend—\nAfter nine revolutions of the work, one attains immortality.\nSuch is its essence.\n\nThe nine revolutions are nine years—the number nine is the utmost of yang. The One is the potent name for the Dao. Embracing is embracing that which cannot be embraced. At this time, the immortal discards the limbs, dismisses hearing and sight, departs from the mundane and sacred, equalizes self and others, without fixation or insistence, without grasping or rejecting. The heart-mirror is as one, carefree and at ease—thus attaining great stability, emitting the radiance of Heaven.\n\nAfter nine years, the work is complete: the nature of non-action is spontaneously perfected; the spirit of formlessness is spontaneously wondrous. When the spirit is wondrous, transformations are inexhaustible, hidden and manifest beyond measure. When nature is perfected, wisdom illuminates the ten directions, numinous penetration is unbroken—thus one can divide the body into a hundred million, responding and manifesting everywhere. Yet the body of utmost truth abides in the realm of utmost stillness, unmoving and as if never acting. At this point, spirit, nature, form, and life all merge truly with the Dao—thus is it called the Dao of immortals embracing the One.\n\nIn former times, after the Immortal Elder attained the Dao, he demonstrated to his disciple Liu Fengzhen the entry into quiescence through non-birth. Having entered quiescence, he then manifested his body in the Wangwu Mountains—this was the very Dao.\n\nIn ancient times, after the Tathāgata entered nirvāṇa, his golden coffin arose spontaneously into the sky, transforming into samādhi fire. Having consumed his body, yet his mother’s weeping unceasing, he again manifested his golden form in the void, speaking half a phrase to console her—this too was this very Dao.\n\nLong ago, Bodhidharma faced the wall for nine years; having entered extinction, he yet carried a single sandal westward, and his body transformed into towering flames. Though form had perished, the sound of his staff still shook the heavens. Such examples are too numerous to recount in full. Only when both nature and life are perfected, when form and spirit are both wondrous, can one achieve the like.\n\nThus, at the close of his scroll, the Immortal Elder invokes the Chan school’s teaching of nature and Dao, for it truly clarifies the Dao of immortals embracing the One. Hence, I have divided this into the lower volume.\n\nNow, the Dao of nature is vast and boundless, silent and obscure—no form can capture it, no words describe it. All beings, human and non-human alike, are utterly equal, without high or low. Yet from beginningless time, whether in forms with names or in nameless formlessness, not a single thing fails to be perfectly complete and sufficient, for its inherent purity and sufficiency have never admitted description or definition.\n\nYet the Great Treasury contains fifty thousand forty-eight scrolls—all because sages, seeing people lost in ignorance of the Dao, could do no other than speak of it. They wished that through words the Dao might be understood, but once the Dao is understood, words themselves become superfluous. Thus the *Vajracchedikā Sūtra* states: “If the Tathāgata had taught any dharma, it would be slander against the Buddha.” Therefore, all speech is slander.\n\nNow, when the Immortal Elder sings of the Dao of nature, he too speaks out of necessity, and his words are already redundant. This is why I add no further explanation—lest I paint the lily.\n\nI only wish that those of fierce and lofty aspiration will not seek from without, but directly awaken and realize within their own hearts, shining forth uniquely and assuming the truth without hesitation. Let them take up and employ it, whether in clamor or silence, speech or stillness, taverns or flower-lined streets—whether idle or not, all is well. No distinction remains; everywhere harmony prevails. Throughout the ten directions, a single eye suffices, a single hand extends—wondrous function moves freely in all directions, covering heaven and earth. Wherever they act, it is the real; whatever they do is without hindrance. Then they know that here, originally, the celestial nature is fully sufficient, lacking nothing, with no excess. All deliberation dissolves, subject and object both forgotten. No question, no response; no thought, no concern. Even the word “nature” is no longer needed.\n\n*Secret Essentials of the Three Vehicles*\n*Guardian of the Golden Elixir*\n\nGreat indeed! A single millet grain foretells the Void,\nReturning to the root, flowing into form at the first hexagram’s dawn.\nTwo realms of Heaven and Earth draw upon creation’s power,\nA single pound of sun and moon turns the pivot of the mechanism.\nThe cycle of stars and the breath-count whisper faintly,\nAdvancing the fire, the divine work manifests its true tally.\nAfter burning half a watch with civil and martial flame,\nThe Crimson Dragon seizes the luminous night-shining pearl.\n\n**Method of Moving the Fire**\nOnce the pearl is ingested, Earth joins Heaven,\nAt the double-excess Mysterious Pass, the fire blazes bright.\nSixty hexagrams follow dawn and dusk,\nWithin the nine-fold city, mercury smelts lead.\nIn drawing and adding, guard against peril,\nIn bathing and halting the tally, let no smoke arise.\nWhen the work is complete and the embryo shed after ten months,\nFrom the primordial is nurtured a Great Luo Immortal.\n\n**Method of Embracing the One**\nThe elixir is the trap, the Dao the fish—\nForget the trap to attain the Dao, realizing emptiness.\nDo not rigidly cling to embracing the non-doing One,\nShatter the void, and even \"one\" is no more.\nThe wondrous being’s numinous radiance ever blazes,\nEncompassing the Dharma-realm, naturally thus.\nFollowing conditions to respond, ever pure and serene,\nAfter nine years, the vajra body remains indestructible.\n\nNow, the vast expanse of rosy clouds, ascending to the golden palace—\nsuch words may seem mere rhetoric, matters beyond the mortal realm.\nYet the worldly cannot deeply believe. I have observed the *Preface to the Comprehensive Immortals’ Collection*,\nwhich states: since ancient times, over a hundred thousand have soared aloft,\nand more than eight thousand households have ascended with their dwellings.\nLiu Xiang, foremost Confucian of the Han, also composed the *Biographies of the Immortals* to bequeath to later ages,\nthus it is known that the immortals are no mere fable.\n\nYet the reason the worldly do not believe lies in nothing else:\nthe celestial mechanism is profound and mysterious, the immortals and sages keep their secrets hidden.\nWith shallow habits and frivolous minds, the truth does not reach their ears—\nno wonder they do not believe.\n\nOf old, the Most High expounded the *Classic of Constant Purity and Stillness*,\nbeginning with the formless Great Dao that gives birth to Heaven and Earth,\nthe passionless Great Dao that moves the sun and moon,\nnurturing the myriad beings, molding the multitudes of life,\nall returning to the primal beginning of the nameless Origin.\nThe sages of antiquity probed the human origin to its utmost,\nthen further elucidated the principles of Heaven and Earth, male and female, purity and turbidity, movement and stillness,\nelaborating on the wonders of a pure heart, few desires, and profound stillness—\nall to reveal the celestial mechanism and secretly impart the profound purport.\nAt the end of the text, it is said that those who awaken may transmit the ultimate teachings of the sagely Dao.\n\nFrom the words of the immortal Master Ge, it was passed mouth to mouth,\nnever recorded in writing. Alas! Since the departure of the pure customs,\nhabits have grown shallow, the immortal dust far removed, this Dao left untransmitted.\nThough heterodox teachings abound, they all lead to the distant and obscure.\nThus the method of refining lead was not inscribed on bamboo or silk,\nthe wonders of forming the embryo and nurturing the infant were deeply sealed in golden caskets and jade boxes.\nStudents of immortality, white-haired from lifelong pursuit,\nnever found the key to unlock its mysteries.\n\nIn the flourishing reign of the Sagely Song, extraordinary figures emerged among men.\nThe Perfected of Purple Mystery, Master Zhang, in his youth studied at the Imperial Academy,\nendowed from birth with a numinous constitution, he set his resolve with diligence,\nundaunted by hardship, attaining the Dao from the Elder of Mount Qingcheng,\nmastering all the profound secrets of the golden elixir.\nExhausting what he encountered, he expressed it in songs and verses,\nnaming his work the *Awakening to Reality*.\nIn my youth, I read it, pondered deeply, and compared it with various teachings,\nyet found no illumination.\n\nSome misconstrued it as mere cinnabar-alchemy, others distorted it into theories of inner cultivation. Clasping the scroll, I sighed deeply—years passed thus. By heaven’s grace, I was fortunate to receive from the Immortal of Purple Yang, Master Chen, the *Awakening to Reality* in its authentic transmission, and from the Perfected Sun Wuming, the *Exegesis*. Secretly bestowed, I bathed, purified myself, and recited them with reverence. Suddenly, it was as if mist dispersed and clouds parted, sun shone and moon gleamed—before I could even inquire into the oral instructions and essential teachings, I already grasped the mechanism of generating heaven and earth, the Dao of circulating the sun and moon.\n\nFor nurturing the myriad things and molding all beings, nothing lies beyond true yin and true yang, the qi of the upper and lower celestial arcs. As for the application of withdrawal and replenishment, the vigilance against peril and danger—all glitters clearly before one’s eyes. If one can encounter a true transmission and attain this wondrous Dao, nurturing the immortal embryo, transcending the mundane to enter sageliness, one surely will not have lived this life in vain.\n\nHaving just gained access to this teaching, I leap with joy and exultation. Respectfully following the brush of Hong Ying, I inscribe these words at the end of the scroll.\n\n*Written in the Mid-Autumn of the Jiazi year of the Jiatai reign of the Sagely Song by Baiyunzi, who signs himself Jin Shu.*\n\n*Postscript on the Origins of the Awakening to Reality*\n*The Origins of the Perfected Zhang*\n\nThe Perfected One of Purple Yang was originally from Yingluo Street in Tiantai. His original name was Boduan, styled Pingshu, and later renamed Yongcheng. In his youth, he was untutored and aimless, drifting like clouds and water. Later, though he had received the teachings of the Primordial Dao, they were incomplete, so he diligently sought instruction, traveling extensively across the four directions. During the Xining era, when Lord Lu the Dragon Diagram was vigorously governing Chengdu, he followed him to Shu, serving as a policy advisor in the Pacification Bureau of the Sichuan Military Commissioner’s Office. In the year Jiyou, he encountered an extraordinary person who transmitted to him the secrets of the fire-phase, and thus his Dao was perfected. The master admonished him, saying: \"One day, if someone comes to free you from your bonds, you must accept them.\" After three transmissions, each time he encountered disasters and misfortunes, he deeply repented and blamed himself, withdrawing from the world and ceasing all speech. He composed the *Awakening to Reality* in eighty-one chapters, fully expounding the secrets of the two elixirs. Its discussions and main principles deeply criticized the scholars of his time for clinging to their separate schools, as the three teachings flowed in different currents, unable to merge into one. Yet the principle that different schools share a common source shone clearly. He continued the orthodox tradition and powerfully supplemented the Dao, and his work was widely recited throughout the world. When Lord Lu shed his mortal form, hundreds of śarīra were found, resembling cockscomb seeds, all shimmering in a golden-green hue. Later, there were those who claimed to have seen him, saying that during the Zhenghe era, he visited Minister Huang Mianzhong of Yanping under his true name. Huang had long transmitted the teachings of Rongcheng and was deeply devoted to alchemical practices. Though advanced in years, their conversation failed to resonate, and he departed. Subsequently, he sent a letter to Huang, which Pingshu found most extraordinary. Huang’s grandson Quan saw the letter but kept its contents secret, revealing only the general outline to me: Pingshu claimed that both he and Huang were celestial officials of the Purple Tenuity Palace, known as the Nine August Perfected Ones. Due to reviewing the records of kalpas and destinies, they were banished to the human realm. Among them, only six stars are now visible in the celestial enclosure, while three remain concealed in obscurity: Pingshu, Mianzhong, and Master Yu of Weiyang. Pingshu was called the Perfected One of Purple Yang, Mianzhong the Perfected One of Purple Primordium, and Master Yu the Perfected One of Purple Florescence. All those who had been banished as officials had already returned to the Pure Capital, but Pingshu had once again ascended to the ranks of immortals. Only Mianzhong remained mired in the sea of officialdom, having been reborn as a human for ten lifetimes—now in his ninth. If in his next life he again succumbs to delusion and clings to the dust, he will sink into other destinies, with no hope of promotion. Pingshu clearly set forth the covenant of immortals, striving to rescue him, yet Huang ultimately failed to resonate with the teachings and passed away, merely styling himself the Old Man of Purple Primordium. The Nine August Ones are not recorded among the celestial officials, for they are but faint stars—perhaps among the twelve thousand five hundred?\n\n**The Affairs of Master Xue Zixian**\nDao Yuan, surnamed Xue and named Shi, was a native of Jizu Mountain in Shanfu. He had once been a monk, with the Dharma name Zixian. Wandering to Chang’an, he stayed at Kaifu Temple, where he studied under the elder Xiuyan. Yan, perceiving his capacity for the Dao-eye, asked: \"Before the golden cock crows, how does one respond to this sound?\" He also studied under the monk Ruhuan, who asked: \"What is the bite that transcends the Buddha and the Patriarchs?\"—to which he replied, \"A sesame cake, round and complete.\" Upon hearing the creaking of a well-pulley, he suddenly attained enlightenment and composed a gatha:\n\n*When the creaking follows the sound’s arising,*\n*Not from another does sudden knowing come.*\n*The well-pulley sings the song of no-birth,*\n*While the snake in the well dances with abandon.*\n\nThe two elders affirmed his realization. From then on, he thoroughly awakened to the supreme secret, the perfectly luminous and true essential Dharma. His wit was swift, and he was equally versed in both the school and the teachings. Moreover, he ardently aspired to the cultivation of the golden elixir. In the winter of the Bingxu year of the Chongning era, while residing in Qing Town of Na County to attend a Buddhist lecture, he encountered Shi Tai, styled Dezhi, a native of Xinglin Post in Fufeng County, Fengxiang Prefecture. Though eighty-five years old, Shi had green hair and a ruddy complexion, his spirit and bearing extraordinary. At night, he sewed clothes. Dao Yuan observed him in secret and felt a sense of wonder. By chance, he recited a poem by Zhang Pingshu, and Shi was startled, asking: \"Do you know this man?\" Dao Yuan replied: \"He is my teacher.\" Thereupon, he recounted what Pingshu had said.\n\nMaster Pingshu, originally named Boduan, first encountered an extraordinary person at Tianhui Temple in Chengdu, who changed his name to Yongcheng. The governor of Fengzhou, enraged, pressed charges against him, and he was exiled. Passing through the prefecture, they encountered a great snowfall. He and his escorts drank together at a village tavern, where I happened to be present. After exchanging bows and sitting down, he invited me to join them. I smiled at the group and said: \"The guests are fearful, but this guest has not yet begun drinking—why not come and join us?\" Thus, we drank together until merry. He asked the reason for my presence, and I explained. I thought to myself: \"Governor Deng is an old friend, delighting in goodness and forgetting rank. Though a hundred *li* away, he would not hesitate to come if there were a reason.\" Pingshu pleaded with his escorts, who agreed. Thus, he was released at He. I went ahead, and with one meeting, he was pardoned. Pingshu was deeply grateful, saying: \"If I do not repay this kindness, how can I be called a man? Though I have studied the Dao all my life, I have never heard of such a method. Now, I will transmit the alchemical technique to you to perfect your Dao.\" I bowed in thanks and reverently received his instructions.\n\nDao Yuan, having heard Shi Tai’s account, prostrated himself in homage and sought to become his disciple. He ultimately mastered the great elixir and received the true essential oral instructions. Shi further admonished him to go to great cities and metropolises, seeking those of virtue and power to assist in his endeavor. Dao Yuan then came to the capital, discarded his monk’s robes, and donned a scholar’s turban and robe. Concealing his light and blending with the dust, he mingled among ordinary folk, hoping to fulfill this task. Yet among those who study the Dao of immortality, even those who encounter Pingshu’s poems may interpret them differently according to their own understanding, leading to discrepancies. Doubts arise, minds become confused, and clarity eludes them—who then can explain the *Triple Concordance* to them? Thus, many dare not begin their practice. Alas! Was this Master Pingshu’s original intention?\n\nThus moved by profound resolve, he first undertook to expound and clarify, systematically unfolding the essential principles, penetrating the mysteries and probing the subtleties, dispelling ignorance and awakening the benighted, so that all might readily comprehend. By this means, those who cultivate and refine may avoid error and deviation, attain realization as lofty perfected ones, and employ cinnabar in the elixir’s work.\n\nMaster Chuping once vowed, after incurring fault, never to instruct others, yet later sighed and said: “For myself, this may suffice, but it is no way to uphold the Dao.” The Most High’s sacred statutes declare:\n\n*Failing to transmit when one meets the right person severs the celestial Way;\nRecklessly imparting to the unworthy leaks the celestial treasure.\nTo transmit to the proper recipient brings merit to one’s person;\nTo recklessly transmit brings netherworld torment to seven generations of ancestors.*\n\nNow I have obstinately sealed the celestial Way—calamity will be great indeed. Thus compelled, I composed poems and songs, first to circulate among the world’s extraordinary persons, that they might read and awaken on their own. Yet the meaning within these poems and songs remains deeply concealed, beyond recognition.\n\nDaoyuan therefore expanded upon their intent, composing annotations to make all plain. The true essentials are thoroughly revealed, the profound subtleties of the method fully set forth, the inner and outer radiantly displayed, with no residue left concealed. Those who obtain and peruse this may thereby trace and examine, resolving their doubts without need for inquiry, able to comprehend fully on their own—thus fulfilling Master Chuping’s original intent.\n\nYet Daoyuan, having resolved to transmit this to later generations, shall henceforth seal his silence and withdraw into seclusion. Those who obtain this text must guard it with utmost secrecy. What Heaven treasures is everywhere attended and protected by numinous forces. Only when a person of resolve, steadfast in the Dao and clear in truth, whose words and deeds are without blemish, has carefully ascertained the path of cultivation, may it then be entrusted to them.\n\nIt must not be transmitted amid piles of gold and jade, nor even to one’s closest kin, father or son. For careless disclosure and wanton leakage bring misfortune upon the self, disaster upon the household, and inauspiciousness to descendants. Not only thus: it will further extend calamity to nine generations of ancestors and seven generations of forebears, subjecting them to dark retribution and netherworld punishment, bound eternally to ghostly servitude, never to receive rebirth. Bear this in mind, take heed, and do not neglect it.\n\nThe Elder Gardener of Shangqiu, now known as Master Wang Zhenyi of the Present Age, having transcribed and annotated the *Wuzhen pian* (\"Awakening to Reality\") with its poetic verses, together with the events of its transmission as received in his time, has compiled and recorded them in detail below. Though his words are unadorned, they are a faithful account, so that the beginning and end may be fully seen.\n\nRecorded on the Mid-Autumn Festival of the *yiwei* year of the Zhenghe era [1115 CE].\n\nIn the *dingmao* year of the Taiding era [1327 CE], at Ruiyang, I encountered Xue Zixian’s annotation of the *Wuzhen pian* and read it with a sense of loss, regretting that I had not seen the complete edition. In the *guisi* year of the Tianli era [1333 CE], upon returning to Sheng, I obtained the full text and read it repeatedly. Over several years, I began to discern its essential meaning. Later, I received several versions from distant Daoist friends for collation, all of which shared the same annotations. Where they refuted heterodox teachings, some attributed the errors to \"a certain person,\" while others named Ye Wenshu. Herein lies the first doubt.\n\nRecently published editions of the *Wuzhen pian* with annotations by various scholars include references to the commentaries of Master Xiangchuan and the Nameless One. Compared to the annotations I obtained from Zixian, these are identical, yet the authors differ—another doubt.\n\nIn the *renshu* year of the Jiatai era [1202 CE], Yuan Gongfu condemned Ye Wenshu’s commentary, leaving its origins obscure. Upon examining Gongfu’s own received teachings, I found they amounted to nothing more than solitary cultivation of a single element. Why, then, did he condemn others? If Wenshu’s work were truly flawed, why did both Zixian and Gongfu denounce it? Herein lies another doubt.\n\nBy examining the chronology: Daoguang composed the *Fuming pian* (\"Restoration of Life\"), stating that he received oral instructions in the *gengzi* year of the Xuanhe era [1120 CE]. Now, Wang Zhenyi of Shangqiu, in the *yiwei* year of the Zhenghe era [1115 CE], recorded the events of Xue Zixian’s life. Ye Wenshu’s annotations date to the *xinsi* year of the Shaoxing era [1161 CE], forty-seven years later. Wenshu may not even have been born—or was still a child—in the *yiwei* year of Zhenghe. How could Zixian have foreseen and condemned him forty-seven years in advance? Moreover, all the errors attributed to Wenshu appear in no other annotations. Herein lies yet another doubt.\n\nGiven these uncertainties, I suspected that the annotations were not Zixian’s, though I could not be certain. While his commentary differs from others, it truly captures the essence of the Perfected One’s teachings.\n\nOn the third day of the fifth month in the *xinyou* year of the Zhishun era [1331 CE], I encountered the direct instructions on the Golden Elixir, its ingredients, and the firing times—a celestial transmission. Yet I remained doubtful that the annotations were Zixian’s, and the matter weighed on my mind. I questioned ceaselessly and sought answers far and wide.\n\nIn the autumn of the *renshen* year of the Zhishun era [1332 CE], an old friend from Wuling transmitted the *Baoguang* commentary by Master Xiangchuan. Overjoyed, I read it for months, and my earlier doubts melted away like ice. It became clear that the annotations long attributed to Zixian were in fact the work of the Nameless One, mistakenly ascribed to Daoguang (Baoguang). How long this error has persisted, yet no one has corrected it!\n\nHow do I know this? The Perfected One transmitted the teachings to Shi Yaolin, and Yaolin to Zixian as the third generation—this is widely known. The Perfected One also transmitted to Guangyizi, and Guangyizi to the Nameless One, likewise the third generation—this is rarely known. Those who sought to lend credibility to the Nameless One’s annotations circulated them in abridged form. Later, to bolster their authenticity, they appended Zixian’s name, with the record stating: \"by Wang Zhenyi.\" Thus, two individuals were conflated into one.\n\nThe *Wuzhen pian* is a work of universal compassion, fully revealing the celestial mysteries. How could it bear the surname \"Yuan Wang\"? This is a self-inflicted error in the record, meant to mislead the world. Some further claim that Zixian was a monk, also known as Daoguang or Baoguang. This confusion arises from the shared character *guang* (\"light\"), leading to the mistaken attribution of criticisms of Ye Wenshu. Yet when we examine the Nameless One’s annotations, no one before Wenshu had written commentaries, nor did anyone after him condemn Wenshu’s errors.\n\nThe Nameless One, fearing that the Perfected One’s teachings would be lost and future generations misled, dared—at the risk of heavenly retribution—to annotate the text in the *guisi* year of the Qiandao era [1173 CE], adhering strictly to his master’s instructions. His explanations are meticulous, leaving no detail unaddressed, lest others be led astray. Yet later scholars, having only abridged versions of various commentaries, have never seen the complete text. They further erred by misreading the title \"Xiangchuan\" as an honorific for an elder, splitting the Nameless One and Xiangchuan into two individuals. More recently, the Nameless One’s annotations have been misattributed to Zixian. Error upon error has accumulated, and even the basic coherence of the text and its chronology cannot be verified. How, then, can one hope to grasp the true transmission of the immortal Dao?\n\nThe authentic transmission of the Great Way of the Golden Elixir has endured for ages, yet it now verges on extinction. Though the world is united and seekers of immortality abound, how few have truly encountered this teaching! Will Zixian’s annotations not be transmitted to later generations? Am I alone in having failed to see them?\n\nThe Nameless One’s annotations are exhaustive, leaving no obscurities. The annotations commonly attributed to Zixian are largely identical but riddled with omissions. If Zixian had indeed written a commentary, how could the Nameless One have ignored it, instead appropriating the entire text and publishing it under his own name? In his explanation of the \"full moon\" passage, the Nameless One cites only two lines from Zixian, proving that Zixian never wrote a commentary. The annotator begins with \"where human effort is applied to awaken understanding,\" and later cites \"Wu Shi Zi\" (\"Master of No-This\"), a corruption of \"Nameless One.\" This further confirms that Zixian never wrote a commentary.\n\nToday’s error—attributing the Nameless One’s work to Zixian—leads modern seekers of immortality to dismiss the obscure (Nameless One) in favor of the well-known (Zixian), inverting their true significance. Yet the authenticity of their master’s transmission and the orthodoxy of the immortal Dao are the same for both, as both trace their lineage to [Zhang] Boduan.\n\nWherever the words of the Perfected One reside, numinous forces attend and protect them. How could one fail to treasure this text and preserve it, transmitting it only to those worthy of receiving it?\n\nHerewith the translation:\n\n---\n\nAccordingly, I have appended the recorded origins of the Perfected One and the recent affairs of Zixian to the commentary of the Nameless One, offering a comprehensive critique. Thus may those who study this annotation find its principles readily clarified and its errors easily corrected, recognizing the truth of my words and refraining from falsely transmitting the commentary.\n\nKnowing the rarity of encountering the Great Dao, I dare not lightly transmit it to unworthy recipients. Those who pursue immortality follow a path: through text they grasp meaning, through annotation they penetrate the essence. Unled astray by heterodox teachings, they ascend directly to the Great Dao. This is Heaven’s gift, ensuring the transmission of the Golden Elixir’s Great Dao remains unbroken.\n\nThere exists another version, prefaced by a brief introduction by Zixuzi dated the ninth month of the first year of the Chunxi era, placed before Chen Ziyang’s preface. This version omits the Nameless One’s preface, retaining only the secret instructions of the Immortal Elder. It further alters the subsequent text, renaming *The Secret Essentials of the Three Vehicles* and placing it at the beginning. The commentary therein adds:\n\n> Its essential teachings regard virgin boys and girls as yin and yang, dragon and tiger; the qi of male and female as precelestial and postcelestial, as lead and mercury, as true water and fire, as the new moon. The year of *tiangui* is called *gui*’s birth; at sixteen, the three yang are complete, the toad’s light is full, the golden tripod is whole, great and small are unharmed, the two realms are whole, the precelestial qi is the external medicine. Truly, this is a heterodox sect’s perverse flourish, a spurious annotation.\n\nThis is the heresy of Zixuzi, who dared not reveal his true name. He falsely dated his work earlier, attributing his unspoken doctrines to the Nameless One to gain worldly acceptance. Some claim Zixuzi is merely another name for the Nameless One. If this were true, the Nameless One would contradict himself. Moreover, in the year *gui-si* of the Qiandao era, the following year *jia-wu* saw the reign title changed to Chunxi. Within a single year, how could the master’s teachings suddenly diverge?\n\nIn the *jia-zi* year of the Jiatai era, Baiyunzi prefaced Chen Ziyang’s transmission of this commentary. Thirty-two years later, the annotation remains entirely pure and unified, its secret instructions clear and unambiguous, without a single heterodox word intermingled. From *gui-si* to *jia-wu*, a mere year apart, this version rebels against the prior annotation. At that time, the Nameless One had not yet ascended; had he witnessed this, he would surely have condemned it as heresy. How could one attack Ye Wenshu while upholding Zixuzi?\n\nFurthermore, why did Zixuzi not seek the guidance of the enlightened to verify his transmission’s orthodoxy? If the Nameless One had indeed revised his own teachings, why would he claim to expand upon the Nameless One’s unspoken doctrines? Thus, the spuriousness of this annotation is undeniable.\n\nScholars of immortality who obtain the authentic version of this commentary should discern its truth and treasure it. Respectfully annotated on the fifteenth day of the first lunar month in the *bing-zi* year of the Zhiyuan era by Kongxuanzi Dai Qizong, styled Yizhong, and his father.\n\n---\n\nI have heard that in ancient times, the Perfected One Zixian expounded the subtle mysteries of the Great Dao, rescuing deluded disciples from drowning. On the day of his Dao’s fulfillment, he composed the *Wuzhen Pian* to transmit to the world, distilling his life’s experiences therein. Those who study the Dao yet fail to follow this text’s teachings are like travelers bound for the rivers and seas who abandon their oars.\n\nAlas, as the ages recede and the winds of the Dao grow faint, its words become stern and its Way concealed. Some cling to heterodox teachings, slandering the immortal Dao; others obscure its symbolic truths, rejecting its true principles. Thus do they deem the divine immortals as distant and indistinct, the alchemical texts as frivolous and absurd. The *Wuzhen*’s teachings and the Perfected One’s intent remain unrecognized in the world.\n\nYet the Nameless One, inheriting the orthodox transmission, lamented the proliferation of errors in its annotations and thus released this commentary into the world. Dividing chapters and explicating sentences, he meticulously distinguished each detail, fully revealing the celestial mechanisms and exhaustively recording them within. Through diligent study and profound reflection, one may attain understanding.\n\nMy great-uncle, from childhood, revered the Dao and has studied this text for years. Heaven opened his heart, granting him access to its mysteries. Drawing from his father’s and teachers’ instructions, as well as his own insights, he appended this exposition to the Nameless One’s commentary, that future seekers might use it as a standard, avoiding the pitfalls of vagueness and delusion.\n\nHow vast is his intent! By karmic affinity, I obtained this book, for which I am profoundly grateful. How might I encounter companions beyond the mundane, treading the fragrant paths to cultivate truth, riding the immortal winds to distant realms? Establishing the crucible and furnace, inhaling and exhaling dragon and tiger, inverting mercury and lead, gathering them in an instant, gestating for ten months, refining for nine years—then, serene, I would mount the flying chariot, cross the Weak Waters, stride the sacred turtle, and stand in the presence of the immortals, hearing the Great Dao of the Reclusive One and rescuing the drowning. This is my aspiration: to emulate Zixian.\n\nWritten on the third day of the third lunar month in the *ding-chou* year of the Zhiyuan era by the disciple Dai Shun, bowing in reverence, at the Great Life Grotto-Heaven of Zhuhu.\n\n---\n\n**Alchemical Symbols of the Golden Elixir**\nThe Nameless One, in his *Wuzhen Pian* commentary, compiled the alchemical symbols of the Golden Elixir, employing myriad analogies—truly comprehensive. Qizong expanded this collection, gathering from the *Cantong Qi*, various immortal scriptures, treatises, poems, and lyrics. All metaphors drawn from celestial patterns, *Yijing* symbols, human affairs, principles, and objects—comparisons to the yin-yang alchemical symbols—are categorized into seven types and appended to the *Wuzhen Pian* commentary. Thus may students of immortality easily investigate them, discerning the distinctions and similarities between internal and external, their mutual symbolic resonance.\n\nThe sequence of the Five Phases’ transformations defies fixed nomenclature. Clarifying their fundamental unity, distinguishing the names of their metaphorical variations, the enlightened masters’ teachings may all be unified. Through this, one may forget the true fishing line and, by this means, achieve the immortal Dao—no small benefit indeed.\n\nPrefaced on the fifteenth day of the first lunar month in the *ding-chou* year of the Zhiyuan era by Dai Qizong.\n\n**Yang**\nHeaven\nSun\nTriple Alignment\nQian\n\nLi\nFather\nHusband\nLord and Master\n\nWife\nNature\nQi\nSpirit\n\nCrown\nHun-soul\nEye\nFire\n\nSouth\nJia\nNoon\nBing\n\nTwo\nSeven\nHeart\nFlower\n\nJade\nDragon\nSerpent\nMale\n\nYang\nVoid\nQi\nAbove\n\nValley\nThing\nVessel\nSquare\n\nEssential\nMercury\nLight\nFloating\n\nEssence\nCharacter\nWu\nGreat\n\nMovement\nExterior\nHare\nFirm\n\nRed\nExhalation\nNonbeing\nMarvelous\n\nVirtue/Power\nRitual\nJoy\n\nReward\nMale\nWriting\nSummer Heat\nCelestial Soul\n\nQian Image\nSolar Soul\nZhang and Yi\nHouse and Six\n\nUpper Mystery\nQian Horse\nThunder Dragon\nFusang\n\nKunlun\nMarvelous Maiden\nEldest Son\nWood Son-in-law\n\nWu Earth\nTwo Souths\nEarth Two\nCinnabar\n\nAzurite\nAzure Dragon\nFire Dragon\nSea Dragon\n\nRed Phoenix\nQian Crucible\nJade Tripod\nJade Pool\n\nLower Virtue/Power\nVague and Elusive\nTrue Sand\nVermilion Bird\n\nDanyang\nCinnabar Tripod\nBorn of Jia and Yi\nYin\nEarth\n\nMoon\nShang\nKun\nKan\n\nMother\nWife\nMinister\nGuest\n\nHusband\nEmotion\nRealm\n\nDestiny\nDusk\nPo/Soul\nEar\nWater\nNorth\nGeng\nZi\nRen\nOne\nSix\nKidney\nWine\nMetal\nTiger\nTortoise\nFemale\nYin\nSolid\nFluid\nLower\nPivot\nElixir\nTripod\nCompass\nFlow\nLead\nHeavy\nSubmerged\nLight\nChirping\nSi\nSmall\nStill\nEnveloped\nCrow\nGentle\nBlack\nInhalation\nExistence\nCoupling\nPunishment\nWisdom\nAnger\nChastisement\nWoman\nNight\nCold\n\nEarth Po\nKun Image\nMoon Po\nXu and Wei\nChao Seven\nLower Crescent\nKun Ox\nKan Tiger\nMount Hua\nQujiang\nInfant Brother\nYoungest Daughter\nMetal Wife\nJi Earth\nOne North\nCelestial One\nBlack Lead\nMountains and Marshes\nWhite Tiger\nWater Tiger\nMount Tiger\nBlack Tortoise\nKun Tripod\nMetal Crucible\nWestern River\nUpper Virtue/Power\nVague and Elusive\nTrue Mercury\nXuanwu\nTrue Yin\nCrescent Moon Crucible\nBorn of Geng and Xin\nYang within Yin\nZhen\nLi\nWife\nMinister\n\nGuest\nMao\nJia\nEast\nEmotion\nBenevolence\nLeft\nThree\nEight\nFloating\nLiver\nWood\nWoman\nCreature\nFather\nSun-Soul\nCrow Marrow\nAlchemical Maiden\nPeople\nGuests\nAzure Maiden\nLi Maiden\nTrue Mercury\nWood Fluid\nFire Mercury\nYellow Sprout\nJade Fluid\nDivine Water\nFire Dragon\nFemale Dragon\nGolden Crow\nTrue Dragon\nTrue Yin\nFemale Matrix\nFemale Yin\nYin Fire\nYang Qi\nFlowing Pearl\nFemale Azure\nFemale Fire\nRed Lead\nCinnabar\nIntertwined Pear\nEast Two\nJade Fungus\nElixir Base\nTrue Fire\nNoon North\nDragon West\nQuicksilver\nCelestial Dark Maiden\nNoon Crow\nMother’s Blood\nDragon’s Bowstring Qi\nDragon’s Breath to Tiger\nYin White Fire\nFire within Water\nRed Entering Black\nVermilion Phoenix Marrow\nFlowing Mercury Father\nRed Lead Essence\nMercury within Cinnabar\nLi’s Ji\nKun’s Middle Daughter\nLi’s Single Yin\nMoon White on Mountain Peak\nGreat Yang Flowing Pearl\nLi Ji’s Sunlight\nGreen-Clad Maiden\nBlue-Eyed Hu Child\nFemale Mingling with Male Form\nTrue Mercury within Cinnabar\nDrawing Water from Qi\nMale Enveloping Female\nCrow Liver Eight Ounces\nMercury Born from Cinnabar\nBorn of Bing and Ding\nQi Generating Fluid\nTwo-Eight Alchemical Maiden\nEssence of the Vague and Elusive\nWithin the Cinnabar Tripod\nQuicksilver\nLower Crescent Water Half-Catty\nMercury as Water within Cinnabar\nYang within Yin\n\nDui\nKan\nHusband\nLord\nHost\nYou\nGeng\nWest\nNature\nRighteousness\nRight\nFour\nNine\nSubmerged\nLung\nMetal\nMan\nMedicine\nMother\nMoon-Soul\nHare Marrow\nGolden Elder\nParents\nHosts\nOld Gentleman\nKan Man\nTrue Lead\nMetal Essence\nWater Metal\nWhite Snow\nMetal Fluid\nFlowery Pond\nWater Tiger\nMale Tiger\nJade Hare\nTrue Tiger\nTrue Yang\nMale Father\nMale Yang\nYang Water\nYin Essence\nGolden Flower\nMale White\nMale Metal\nBlack Lead\nQuicksilver\nFire Jujube\nWest Four\nKnife-Tip\nElixir Mother\nTrue Water\nMidnight South\nTiger East\nJade Bud\nEarth-Yellow Man\nMoon Hare\nFather’s Essence\nTiger’s Bowstring Qi\nTiger’s Breath to Dragon\nYellow Sprout Lead\nWater within Fire\nBlack Entering Red\nBlack Tortoise Essence\nYellow Metal Mother\nBlack Lead Marrow\nSilver within Water\nKan’s Wu\nQian’s Middle Son\nKan’s Single Yang\nSun Red in Pool Depths\nNorthern River Chariot\nKan Wu’s Moon Essence\nWhite-Silk Gentleman\nWhite-Headed Elder\nMale with Female Body\nTrue Silver within Lead\nDrawing Qi from Water\nWhite within Black\nHare Marrow Half-Catty\nCinnabar Born from Lead\nBorn of Ren and Gui\nFluid Generating Qi\nNine-Three Gentleman\nEssence of the Vague and Elusive\nWithin the Crescent Moon Crucible\nJade Bud\nUpper Crescent Metal Half-Catty\nMetal as Cinnabar within Water\nCentral Palace\n\nEarth\nWithin\nFive\nTenfold Faith\nIntent\nSpleen\nAncestral\n\nTrue Earth\nEarth’s Virtue\nEarthen Cauldron\nOriginal Spirit\nSpirit Treasure\nMysterious Pass\nMysterious Gate\nTrue Lead\n\nMetal Mother\nMetal Consort\nMetal Womb\nMetal Tripod\nLead Tripod\nMercury Tripod\nKunlun\nGreat Foundry\n\nQian Palace\nKun Position\nFlowery Pool\nDivine Embryo\nSpirit Hut\nMother’s Abode\nWu-Ji\nNuminous Root\n\nSacred Embryo\nNuminous Portal\nGreat Abyss\nCompass Center\nChen’s Pole\nChaos\nElixir Chamber\nQi Repository\n\nPass Origin\nElixir Field\nCrimson Palace\nYellow Court\nYellow Matron\nYellow Path\nOriginal Center\nMysterious Aperture\n\nMedicine Mother\nElixir Foundation\nIce Flask\nTriple Enclosure\nStar Palace\nMother Womb\nNorthern Sea\nEmpty Mystery\n\nYellow House\nReturn-to-Root Aperture\nReturn-to-Mandate Pass\nReclining Moon Furnace\nSuspended Embryo Tripod\nMysterious Female Gate\nWu-Ji Gate\nCreation Furnace\n\nCreation Mechanism\nUnion Cavity\nTaiyi Furnace\nSpirit-Qi Cavity\nGuard-One Altar\nCentral Yellow Palace\nElixir Origin Repository\nElixir Pivot\n\nGolden Mother\nRealm of the Inaudible\nGate of Myriad Wonders\nGrand Tenuity Palace\nChaos Gate\nLife-and-Death Abode\nYellow Emperor’s Earth Virtue\nCentral Harmony\n\nEarth Goddess Tripod\nPreceding Heaven and Earth\nChaos Metal Tripod\nBlack and White in Accord\nAlready-Crossed Tripod Vessel\nPatterning Heaven and Earth\nAugust Earth’s Virtue\nPrimordial Metal Womb\n\nDivine Water Flowery Pool\nLike a Chicken’s Egg\nRoot of Breathing\nGate of the Mysterious Female\nRoot of Heaven and Earth\nPlace of Coagulation\nAugust Stone’s Parents\nComplete Cavern of Creation\n\nOuter Medicine\nYang\nLord\nMetal\nMother\n\nTiger\nIron\nMaster\nLead\nKin\nLord’s Virtue\nGolden Crow\nTrue Lead\n\nYin Fire\nMetal Essence\nMaiden Ma Gu\nYang Elixir\nTrue Earth\nTrue One\nTrue Water\nDivine Water\n\nGreat Elixir\nGreat Medicine\nGolden Elixir\nSeven-Return\nNine-Rebirth\nAutumn Stone\nGolden Flower\nInfant\n\nPerfected One\nValley Spirit\nKnife-Tip Measure\nGreat Stability\nSeed-Pearl\nSweet Dew\nYellow Sprout\nMysterious Pearl\n\nMysterious Frost\nMillet Pearl\nSacred Embryo\nJade Pistil\nGolden Sand\nYellow Repute\nYellow Pool\nOuter Elixir\n\nYang Essence\nWater Tiger\nPrimordial Qi\nTrue Seed\nTrue Mysterious Female\nThree-Five-One\nMud-Rubbing Pearl\nCentral Earth\n\nTrue Parents\nTrue Yin-Yang\nHeaven’s Five Thieves\nPurple Golden Frost\nJade Flask Ice\nCrimson Snow Elixir\nTrue One Essence\nFirst Tripod\n\nAugust Butter\nElixir of Immortality\nWhite Horse Tooth\nHeaven-Earth Marrow\nKan-Li Essence\nTrue One Water\nGold in Water\nLead in Water\n\nTrue Master\nNine-Cycle Elixir\nHeaven-Born Sprout\nNatural Body\nQian-Kun Essence\nHeaven-Earth Qi\nYin-Enveloped Yang Essence\nPrimordial Heaven-Earth Essence\n\nResplendent Metal Essence\nHeaven-Earth Spirit Root\nYin-Yang Sacred Mother\nQian-Kun Tripod Vessel\nKan-Li Medicinal Substances\nDivine Talisman White Snow\nFlask’s Sun and Moon\nDragon Pool Great Elixir\n\nMaster of Yu and Yin\nSnow Mountain Ghee\nKan Position’s Central Fruit\nSacred Father and Spirit Mother’s Qi\nPrimal True Yang\nHeaven-Earth Yin-Yang’s Longevity True Essence\nHeaven-Earth Chaos Root\nTaiyi’s Contained True Qi\n\nKun Position’s Generated Body\nInner Medicine\nYin\nMinister\nWood\nChild\n\nDragon\nMagnet\nGuest\nMercury\nMinister of Dredging\nHousehold Minister\nMoon Hare\nTrue Mercury\n\nYang Fire\nWood Sap\nZhang Qian\nYin Mercury\n\nTrue Fire\nSnow Embryo\nInfant Brother\nInner Elixir\n\nYin Elixir\nMysterious Pearl\nFire Dragon\nPostnatal Qi\n\nFire of Self-Mercury\nHeaven-Earth’s Child Qi\nYang-Enveloped Yin Essence\nPrimordial Yang Qi\n\nGolden Sap Returned Elixir\nYin-Enveloped Yang Fire\nWithin Li Palace’s Abdomen\nGreat Return of Golden Sap\n\nEastern Yang Alchemy\nDivine Embryo in the Crucible\nSpirit Chamber in the Womb\nLead and Mercury in the Sacred Embryo\n\nPurple Yang Realized One’s *Awakening to Reality*\nDetailed Explication of the Three Vehicles’ Secret Essentials—Concluded",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真部玉诀类 紫阳真人悟真直指详说三乘秘要 经名：紫阳真人悟真直指详说三来秘要。 一卷，题翁葆光述，出于南宋，编成于元代。 底本出处：《正统道藏》洞真部玉诀类。 悟真直指详说 象川无名子翁葆光述 夫混沌未显之前，虚无寂寞，无名可宗，强名日道。 道降而生一气，非动非静，非浊非清，邈不可测，圣人强言， 谓之混元真一之气。 一气既判，化为阴阳。 阴阳者，天地也，男女者也。 天地捆缢，万物化醇。 男女媾精，万物化生。 故自有天地以来，未有一物不因阴阳相交而得其形者。 夫欲修炼者，若以金石草木之象名，万有不同之器类，以至一身精神气血液之属，而为丹质者，此皆后天地生滓质之物也。 滓质之物有形可睹，安能生有形而入於无形也哉。 后天地生者也，皆不离乎天地之内，而有形者未尝不坏，安能变化而超乎天地之外也哉。 不超乎天地之外而有形者，未始不堕於阴阳生死之数者也。 夫阳主生，阴主死，一死一生，一往一复，此理之自然也。 设使缎炼得法，服饵有功，寿等龟龄，年齐鹤算，及其数尽，未有不亡。 若箭之射空，力尽必坠，谓其有形未有不坏之理也。 是故圣人采先天一气为丹，炼形还归於一气，炼气归神，炼神合道，而归於无形之形，故能超乎天地之外，立乎造化之表，掌握阴阳，挈提天地。 阴阳生死之所变者，九天一气使之然也。 故得丹体，常灵常存，不生不灭矣。 譬犹运瓷，处瓷之内，焉能运瓷。 必也处瓷之外，则能运瓷矣。 真一之气，生於天地之先，邈不可测，圣人以同类之物诱之成丹。 亦犹日中有火，以阳燧引之，则得其火矣。 又如月中有水，以方诸引之，则得其水矣。 故缎同类之物，立为炉鼎，号日真龙真虎。 故吕公词有自然炉鼎虎绕与龙蟠之语也。 夫同类者，无情之情，不色之色也。 万物之中，得其性命之正，为灵为贵之最者也。 假如初弦之气也，运而用之，故号日真铅、真汞也。 仙翁日：时人要识真铅汞，不是凡砂及水银。 乃初弦铅之气也。 初弦者，上下弦二八之数也。 龙称八雨，虎重半斤，所以谓之二八也。 此时水源至清，有气而无质者也。 以此气类而诱之，则真一之气降灵而有象也。 仙翁日：药逢气类方成象，道在虚无合自然也。 夫炼此金丹，先求名山福地，次创丹室数橡，坛筑三层，剑卓四面，悬之以镜，方乃立龙虎为鼎炉，置刻漏为规矩，抽添有水火之则，作用有辅弼之俦。 如此之类，未易敷陈，亦假世财，方克就绪。 故阴真君论曰：欲修此道，须假资财。 如无资财，则修金丹不成。 又须三人为倡，方可修炼。 三人同心，一志之良友也。 密当八月首望之宵，一阳初动之际，当先主者禹步登坛，左手擒龙，右手擒虎，精调气候，数按周星，一作天正配阴阳，息符刻漏，故得金水交并，龙木孕英矣。 一者坐喔运筹，经文纬武，而继其中问首尾之所施，不使毫厘差惑。 故仙翕曰：大都全藉修持力，髦发差殊不作丹也。 一者潜窥刻漏之的，密整抽添之用，准备火工无失，复卦逾时过刻，丹必难成。 故朝元子曰：劝君穷取周天数，莫使差跎复卦催。 三人一心，递互相符，不半时辰，立得真一之气归于交感之宫，结成一粒，大如黍珠，号日金丹。",
      "translated_text": "**Jade Instructions of the Cavern of Perfection**\n**Ziyang the Perfected’s Direct Pointers to the Comprehension of Reality: A Detailed Explication of the Three Vehicles’ Secret Essentials**\n\n**Scripture Title:** *Ziyang the Perfected’s Direct Pointers to the Comprehension of Reality: A Detailed Explication of the Three Vehicles’ Secret Essentials*\nOne fascicle. Attributed to Weng Baoguang. Originated in the Southern Song, compiled during the Yuan.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, Jade Instructions of the Cavern of Perfection.\n\n---\n\n### **Direct Pointers to the Comprehension of Reality: A Detailed Explication**\n**By Xiangchuan the Nameless Master, Weng Baoguang**\n\nBefore the manifestation of primordial chaos, there was emptiness and silence—no name could be ascribed, yet by necessity it was called the *Dao/Way*. The Dao descended and gave birth to *One Qi*, neither moving nor still, neither turbid nor clear, vast and unfathomable. The sages, compelled to speak of it, termed it the *Primal True Unity Qi*.\n\nOnce *One Qi* divided, it transformed into *yin* and *yang*. *Yin* and *yang* are Heaven and Earth, male and female. Heaven and Earth intermingle, and the myriad things refine into harmony; male and female unite in essence, and the myriad things take form. Thus, since the existence of Heaven and Earth, there has never been a single thing that did not acquire its shape through the intercourse of *yin* and *yang*.\n\nFor those who seek to refine the elixir: if one takes the forms of metals, minerals, herbs, or trees—each a vessel of myriad differences—or even the spirit, essence, *qi*, blood, and fluids of the body as the substance of the elixir, these are all postcelestial, turbid, and material things. Turbid and material things possess visible form; how can they generate the formless from the formed? They are postcelestial, born within the bounds of Heaven and Earth. All that has form is subject to decay; how can it transform and transcend beyond Heaven and Earth? Failing to transcend beyond Heaven and Earth, all that has form remains bound to the cycles of *yin-yang* and life-and-death. For *yang* governs life, and *yin* governs death; death and life alternate, advance and retreat—this is the natural principle.\n\nEven if one refines and ingests with skill, extending life to the age of the tortoise or the crane, when one’s allotted span is exhausted, none escape death. Like an arrow shot into the sky, when its force is spent, it must fall—such is the inevitable decay of all that has form. Therefore, the sages gather the *precelestial One Qi* as the elixir, refining form to return to *One Qi*, refining *qi* to return to spirit, refining spirit to merge with the Dao, and thus returning to the formless form. Only then can one transcend beyond Heaven and Earth, stand beyond the workings of creation, grasp *yin* and *yang*, and command Heaven and Earth. The transformations of *yin-yang* and life-and-death are governed by the *One Qi* of the Nine Heavens. Thus, one who attains the elixir-body abides in eternal numinosity, neither born nor extinguished.\n\nIt is like moving a jar: one within the jar cannot move it; only by standing outside the jar can one move it. The *True Unity Qi* exists prior to Heaven and Earth, vast and unfathomable. The sages, using things of the same kind, lure it to congeal into the elixir. Just as fire exists within the sun, and one may draw it forth with a burning-mirror; or as water exists within the moon, and one may draw it forth with a moon-receiver. Thus, refining things of the same kind, one establishes the furnace and crucible, calling them the *True Dragon* and *True Tiger*. As Master Lü’s verses say: *\"The natural furnace and crucible, the tiger encircling, the dragon coiling.\"*\n\nThese things of the same kind are *emotionless emotion*, *colorless color*—the purest and most numinous of the myriad things, possessing the correct nature and destiny. For example, the *qi* of the crescent moon: when activated and employed, it is termed *True Lead* and *True Mercury*. The Immortal Elder said: *\"If men wish to know True Lead and True Mercury, they are not common cinnabar or quicksilver—rather, the qi of the crescent moon.\"* The crescent moon refers to the numbers of the waxing and waning phases: eight *liang* for the dragon, half a *jin* for the tiger—hence the term *two eights*. At this time, the source of water is utterly clear, possessing *qi* but no substance. Using this *qi*-kind to lure it, the *True Unity Qi* descends in numinosity and takes form.\n\nThe Immortal Elder said: *\"The medicine meets its kindred qi and assumes form; the Dao abides in emptiness, harmonizing with nature.\"* To refine this Golden Elixir, one must first seek a propitious mountain and blessed land, then construct a refining chamber of several rafters. Erect a three-tiered altar, plant a sword at each of the four directions, and hang mirrors. Only then establish the dragon and tiger as the crucible and furnace, set the water-clock as the measure, regulate the withdrawal and addition with the principles of water and fire, and employ assistants for the work. Such matters cannot be easily expounded; they also require worldly wealth to bring to completion.\n\nThus, Master Yin Zhenjun said: *\"To cultivate this Dao, one must rely on resources. Without resources, the Golden Elixir cannot be accomplished.\"* Furthermore, three people must initiate the work—three of one heart, true companions of singular intent. On the night of the first full moon of the eighth month, at the moment when the *yang* first stirs, the principal adept performs the *Yu* step upon the altar, seizing the dragon with the left hand and the tiger with the right. Refining the *qi* and timing the phases, counting the revolutions of the stars, one aligns Heaven’s correctness with *yin-yang*, synchronizing breath with the water-clock’s marks. Thus, metal and water intermingle, and the dragon’s wood nurtures its essence.\n\nOne sits in meditation, strategizing like a general weaving the warp and weft of scripture and martial arts, ensuring the beginning and end of the process are flawlessly executed, without the slightest deviation. Thus, the Immortal Elder said: *\"It all depends on the power of cultivation; even a hair’s difference will fail to produce the elixir.\"* Another monitors the water-clock’s precision, meticulously adjusting the withdrawal and addition, ensuring the fire-timing is unerring. If the hexagram’s time is exceeded, the elixir will surely fail. Thus, Master Chaoyuan said: *\"I urge you to exhaust the numbers of the celestial revolution; do not let negligence hasten the hexagram’s turn.\"*\n\nWith three people of one heart, mutually verifying each other, in less than half an hour, the *True Unity Qi* is drawn into the Palace of Intercourse, coalescing into a single grain, as large as a millet seed—this is the *Golden Elixir*.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1223,
      "start_sentence": 0,
      "end_sentence": 52,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.27956795692444,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真直指详说三乘秘要.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "现在北海之中，赫然光透帘帏，即时密运模娜以追之。 才得入口，则立跻圣位矣。 故仙翁日．．一粒金丹吞入腹，方知我命不由天。 得此一粒，镇在丹田气海之中，则一身精气翕然而归之，立结成砂而不失走。 然后运火缎炼，成金液还丹。 夫火者，阴阳之气也。 阳数奇，阴数偶。 自子至巳六辰属阳，故谓之阳火。 自午至亥六辰属阴，故谓之阴符。 乾之策二百一十有六，坤之策一百四十有四。 二篇之中，夺得四千三百二十年正气，归我丹田之中，温养子珠，结就圣胎也。 老君曰：阳奇自子生，阴偶从午发。 终始在乾坤，中冥母胎月。 故得外精，阴阳之火内生，金液之质，不假施功，自然运转，从尾问历历然有声，直透双关，逆上泥丸峰顶，降下口中，状如雀卵，馨香甘美，此乃金液还丹也。 徐徐咽下丹田，结成圣胎，养就婴儿。 故仙翁曰：婴儿是一含真气，十月胎圆入圣基。 盖凡胎十月降诞，圣胎亦然。 十月火备功圆，脱胎而化形·为纯阳之体，寒暑饥渴不能为恼，方可换於探山穷谷之中，或卑污僻陋之所，面壁九年，以空其心，无人无我，心境一如，故谓之神仙抱一也。 正释子收牛之时，惟识心见性者抱之，则斯道弘矣。 九载功备，无为之性自圆，而慧自生。 纯阳之体自妙，而神自灵。 故得性命，与道合真而无形矣。 无形之形，随物现相，遇风则风，遇雨则雨，遇水火则为水火，遇飞走草木，变化不测，倏存倏亡，瞻之在前，忽焉在后，故能分身百亿，应现无方心若一月之照万水，无不周遍。 是以随绿赴感，靡所不应。 原其至真之躯，处於至静之城，实未尝有作者。 此乃神形性命，与道合真，而同归於究竟寂空之本源也。 故圣人强名之曰九转金液大还丹也，又曰金刚不坏之躯，乃为无上至真之妙道也。 仙翁独弘斯道，故以真金妙色之身，证其巍巍堂堂真金慈相，普现法界，救度众生。 故示刘奉真之徒以性道无生而入寂，后现真身於王屋山中，示二命道不灭而圆通。 故於元丰五年三月初五日尸解之时，乃留愒日．一灵妙用，法界圆通。 此非性命之道双圆，形神之真俱妙，岂能与於此。 其板世亦九十六载矣，平时宏阐玄微，吟咏情性，言辞奥雅，汲引后来，自目其篇曰《悟真》。 悟真云者，性命之真也。 又恐后学惟知命道而不知尽性，惟知性道而不知养命，故有了悟真如之一绝，丹是色身妙宝之一词，启发高明之士，大根器之人，俾知性命之道，咸获究竟圆通，迥超三界，此非无得大悲平等之心智慧智圆者，孰能如是哉。 愚虽识见暗昧，颇得仙翁之密旨，故精研是篇，而漏其精机十已八九矣。 探虑同好之士，金丹源流所自，於是原始要终，冒犯天谴，直指悟真之坦途。 倘有夙骨合仙者，径直入悟真之门，寻无为於一黍之珠。 若於外觅，则不可以冀其有所得矣。 昔元始天尊悬一宝珠，大如黍米，在空玄之中，无鞅圣众勃勃俱自珠口而入者，即此金丹之一·粒也。 一粒如黍，包含万象，囊括三才，其大无外，其小无内，一旦古迄今，高真上圣证此道者，不可胜举，孰不由此一黍而证无上之大道者。 此道至简至易，苟非真师指示，则莫能晓其深根固蒂者。 根蒂识矣，苟非巨有财力者，则亦莫能成其功而着其事也。",
      "translated_text": "Now within the Northern Sea, a radiant light suddenly pierces the curtains—swiftly and secretly, one must employ the *Mona* technique to pursue it. The moment it enters the mouth, one instantly ascends to the sacred rank. Thus, the Immortal Elder said: *\"Swallow but a single grain of Golden Elixir, and you shall know your fate is not ruled by Heaven.\"*\n\nOnce this single grain is lodged within the Cinnabar Field and Sea of Qi, the essence and qi of the entire body converge upon it, instantly coalescing into cinnabar without any loss. Then, through the firing and refinement, the *Golden Liquid Returned Elixir* is formed. Now, *fire* refers to the qi of yin and yang. Yang numbers are odd, yin numbers even. From *zi* to *si*, the six hours belong to yang—thus called *yang fire*. From *wu* to *hai*, the six hours belong to yin—thus called *yin tally*. The * Qian* hexagram’s tally is two hundred and sixteen; the *Kun* hexagram’s tally is one hundred and forty-four. Within these two scrolls, one seizes the four thousand three hundred and twenty years of *True Qi*, returning it to the Cinnabar Field, where it nurtures the *Child Pearl* and coalesces into the *Sacred Embryo*. Laozi said: *\"Yang’s oddness arises from *zi*; yin’s evenness issues from *wu*. Beginning and end lie in *Qian* and *Kun*; the dark womb is the moon of the mother’s womb.\"*\n\nThus, the external essence and the internal fire of yin and yang are born, and the substance of *Golden Liquid*—without need for forced effort—naturally circulates. From the *Weilü* point, it ascends with a clear, resonant sound, piercing the double passes, reversing upward to the summit of *Niwan*, then descending into the mouth, resembling a sparrow’s egg—fragrant, sweet, and delectable. This is the *Golden Liquid Returned Elixir*. Slowly swallowing it into the Cinnabar Field, it coalesces into the *Sacred Embryo*, nurturing the *Infant*. Thus, the Immortal Elder said: *\"The Infant is one who contains the True Qi; when the ten-month gestation is complete, one enters the sacred foundation.\"*\n\nFor the common fetus, ten months pass before birth; so too with the Sacred Embryo. When the ten months of firing are complete and the work perfected, one sheds the embryo and transforms into a body of pure yang. Cold, heat, hunger, and thirst can no longer disturb it. Only then may one wander in remote mountains and deep valleys, or dwell in humble, secluded places, facing the wall for nine years to empty the heart, where there is neither self nor other, and heart and realm become one—this is called the *Immortals’ Embrace of the One*. At the moment the Chan practitioner gathers the ox, only those who recognize the heart and perceive the nature can embrace it, and thus the Dao flourishes.\n\nAfter nine years of work, the nature of non-action becomes complete, and wisdom naturally arises. The body of pure yang becomes wondrous, and the spirit naturally attains numinosity. Thus, one obtains both nature and life, merging with the Dao in truth and without form. The formless form manifests according to circumstances—encountering wind, it becomes wind; encountering rain, it becomes rain; encountering water or fire, it becomes water or fire. Meeting birds, beasts, grasses, or trees, its transformations are unfathomable—now present, now gone, seen ahead, then suddenly behind. Thus, it can divide into a hundred million bodies, responding without limit. The heart is like the moon reflecting upon ten thousand waters, universally pervading. Therefore, it responds to conditions without fail, meeting every stimulus.\n\nYet the body of utmost truth dwells in the city of utmost stillness, truly never acting. Here, spirit, form, nature, and life merge with the Dao in truth, returning together to the ultimate source of quiescent emptiness. Thus, the sages forcibly name it the *Nine-Turn Golden Liquid Great Returned Elixir*, or the *Indestructible Vajra Body*—the supreme, most true, and wondrous Dao.\n\nThe Immortal Elder alone propagated this Dao, attaining a body of true gold and wondrous hue, manifesting the majestic and luminous visage of true gold, universally appearing throughout the Dharma realm to save and deliver all beings. Thus, he revealed to his disciple Liu Fengzhen the nature-Dao of non-arising, entering quiescence, and later manifested his true body in Wangwu Mountain, demonstrating the twofold Dao of life and nature—imperishable and perfectly penetrating. Therefore, on the fifth day of the third month in the fifth year of the Yuanfeng era, at the time of his liberation by means of the corpse, he left behind these words: *\"The wondrous function of the single spirit pervades the Dharma realm.\"* Without the dual perfection of the Dao of nature and life, and the wondrous union of form and spirit, how could one attain this?\n\nIn this world, he lived for ninety-six years. In his lifetime, he extensively expounded the profound and subtle, composing verses on emotion and nature—his words profound and elegant, guiding those who came after. He titled his work *Awakening to Reality*. *\"Awakening to Reality\"* refers to the truth of nature and life. Yet he feared that later students might know only the Dao of life but not exhaust the nature, or know only the Dao of nature but not nurture life. Thus, he composed a verse on awakening to the *True Suchness* and a hymn on the *Wondrous Treasure of the Colored Body*, to enlighten those of superior wisdom and great capacity, enabling them to fully comprehend the Dao of nature and life, attain ultimate perfection, and transcend the Three Realms. Without the great compassion and equal-hearted wisdom of one who has attained the Dao, who could achieve this?\n\nThough my own understanding is dim, I have received the Immortal Elder’s secret instructions. Thus, through diligent study of this work, I have grasped eight or nine parts of its profound mechanism. Fearing that fellow seekers might not know the source of the Golden Elixir’s lineage, I have traced its origins and essentials from beginning to end, daring to defy heavenly censure by directly pointing to the broad path of *Awakening to Reality*. If there are those with innate affinity for immortality, let them enter directly through the gate of *Awakening to Reality* and seek non-action within the single grain of millet. If sought externally, one cannot hope to attain it.\n\nIn ancient times, the Celestial Venerable of Primordial Beginning suspended a precious pearl, as large as a millet grain, within the empty mystery. Innumerable sacred hosts eagerly entered through the pearl’s mouth—this was none other than the single grain of Golden Elixir. A grain like a millet seed contains all phenomena, encompassing the Three Powers. Vast without boundary, minute without interior, it spans from antiquity to the present. Countless lofty immortals and supreme sages have verified this Dao—who among them did not attain the supreme great Dao through this single grain of millet?\n\nThis Dao is most simple and most easy. Yet without a true teacher’s guidance, none can fathom its deep roots and firm foundation. Even if the root and foundation are known, without great wealth and resources, one cannot accomplish the work or manifest the endeavor.",
      "overlap_context": "and addition, ensuring the fire-timing is unerring. If the hexagram’s time is exceeded, the elixir will surely fail. Thus, Master Chaoyuan said: *\"I urge you to exhaust the numbers of the celestial revolution; do not let negligence hasten the hexagram’s turn.\"*\n\nWith three people of one heart, mutually verifying each other, in less than half an hour, the *True Unity Qi* is drawn into the Palace of Intercourse, coalescing into a single grain, as large as a millet seed—this is the *Golden Elixir*.",
      "start_char": 1223,
      "end_char": 2436,
      "start_sentence": 53,
      "end_sentence": 94,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.58331489562988,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真直指详说三乘秘要.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "功事着矣，苟非明心见性，则亦莫能臻於抱1之妙也。 抱一既妙，则性命之道至矣，不可复有以加矣。 是故命道，莫不有传於师指而后明，修持而后着也。 若夫性道则不然，不由外至者也。 苟非见闻知识於外者，则堕於中小之规，而不彻其听莹之至者也。 惟於自己胸中，自悟自明，方能尽其性道，而得所谓最上第一乘者也。 吁，性道之中，非有悟有明也，悟无所悟、明无所明而已。 非有尽有得也，尽无所尽、得无所得而已。 最上第一也，上无所上、一无所一而已。 学者倘达师旨，手握天机，毁炼神丹，脱胎换骨，更无明心达本、了悟真空、直超最上之乘，径入无为之境，则形神俱妙，性命交圆，驾鹤縿鸾，乘龙跨凤，共为蓬闱之游必矣。 强兵战胜之卫 夫强兵战胜之术者，乃炼金丹之旨也。 夫炼金丹者，每以中秋初夜，一阳动时，坐镇魁呈，坛升三级，左擒龙而审定鼎弦，右捉虎而精调火候。 一文一武，交争战於玄门。 一去一来，互斗危於牝户。",
      "translated_text": "Once the work is accomplished and the endeavor manifest, without the clarity of seeing one’s nature, none can attain the subtlety of embracing the One. When embracing the One is perfected, the Dao of nature and life reaches its utmost—nothing more can be added.\n\nThus, the Dao of life is invariably transmitted through a teacher’s guidance before it becomes clear, and through cultivation before it becomes manifest. Yet the Dao of nature is not so—it does not come from without. Without the distractions of external sights and sounds, one falls into the confines of lesser rules and fails to penetrate the ultimate clarity of pure perception. Only by self-awakening and self-illumination within one’s own heart can one fully realize the Dao of nature and attain what is called the Supreme First Vehicle.\n\nAlas, within the Dao of nature, there is no awakening to awaken, no illumination to illuminate—only awakening to nothingness, illuminating nothingness. There is no exhausting to exhaust, no attaining to attain—only exhausting nothingness, attaining nothingness. The Supreme First Vehicle is not supreme in being supreme, not first in being first—only supreme in nothingness, first in nothingness.\n\nShould the disciple grasp the teacher’s intent, seize the celestial mechanism, refine the divine elixir, and undergo the transformation of bone and marrow, then without further need for illuminating the mind or fathoming the root, or awakening to true emptiness, one directly transcends to the Supreme Vehicle and enters the realm of non-action. There, form and spirit are both perfected, nature and life are harmoniously rounded. Mounting cranes and phoenixes, riding dragons and soaring with simurghs, one shall surely join the wanderings of Penglai’s immortal courts.\n\nAs for the art of mighty armies and victorious battles—this is the essence of refining the Golden Elixir. In refining the Golden Elixir, one always begins on the first night of the Mid-Autumn moon, when the yang first stirs. Seated to stabilize the celestial pivot, the altar ascends three tiers. To the left, the Dragon is seized to secure the cauldron’s alignment; to the right, the Tiger is grasped to precisely regulate the firing times. Civil and martial forces contend in battle at the mysterious gate; advance and retreat engage in perilous struggle at the Gate of Life.",
      "overlap_context": "ut boundary, minute without interior, it spans from antiquity to the present. Countless lofty immortals and supreme sages have verified this Dao—who among them did not attain the supreme great Dao through this single grain of millet?\n\nThis Dao is most simple and most easy. Yet without a true teacher’s guidance, none can fathom its deep roots and firm foundation. Even if the root and foundation are known, without great wealth and resources, one cannot accomplish the work or manifest the endeavor.",
      "start_char": 2436,
      "end_char": 2819,
      "start_sentence": 95,
      "end_sentence": 109,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.257452726364136,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真直指详说三乘秘要.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "息符刻漏，数应周天，无令毫发差殊，故日强兵战胜之术也。 夫兵者，龙虎也。 战者，交媾也。 不一时辰，立获金丹入口，战胜之术着矣。 故《西华经》日：强兵战胜，在养玄珠之功也。 是以仙翁首列一十六首者，以明龙虎，各一、八之数。 五言四韵一首者，以表一时得金丹一粒也。 此余所以分为上卷，表而出之，以明强兵战胜之术，则采金丹之功集然明白矣。 富国安民之法 夫富国安民之法者，乃运阴阳符火之旨也。 夫人道无形，肇生一气，一气混沌，判为阴阳。 故至阳之气轻清，覆冒於上者，谓之天。 至阴之气重浊，负载於下者，谓之地。 积诸纯阳之气，飞升於天者，仙也。 积诸纯阴之气，沉沦於地者，鬼也。 禀一阴一阳之气，不升沦之躯，处於天地之中，可仙可鬼者，人也。 人能修炼，剥尽草阴，而形化为纯阳之气，则升仙矣。 不知修炼，日耗六阳，而体化为纯阴之气，则为下鬼矣。 《易》日：本乎天者亲上，本乎地者亲下。 亦各从其类也。 是以圣人仰观俯察，知人禀天地之秀气，为灵、为贵、为最，故假真阴真阳之二物，夺先天地之一气以为丹，饵归丹田气海之中，以御一身后天地生之气，则一身之气翕然而归之，若万邦之朝於君，众星之拱北也。 如人因父母交感之精而有此身，是以盗阴阳纯粹之气而为化基，号曰阴符阳火。 循环六十卦之中，周而复始。 回七十二候、二十四气於一日一夜之中，夺得四千三百六十之正气，辐赓於丹田气海之中，温养丹珠。 其丹处於中宫，元为而静应，故得外接阴符阳火，生真一神躯。 十月脱胎，而形化纯阳真一之气。 饥渴不能挠，寒暑不能侵，故为富国安民之法也。 夫国者，身也。 民者，精气也。 民为邦本，本固邦宁。 邦若无君则民罔归，君若无臣则民罔治。 是以圣人以丹为君，以火为臣，丹火相须，君臣庆会，则天下平治，精固民安，故一身之国富矣。 《西华经》日，．精完气足，所以富国民安，正在饵金丹之后也。 是以仙翕续述绝句六十四首，按《周易》六十四卦者，明运火爻之计也。 又续成《西江月》一十二首，以象运火沐浴，共十有二月之功也。 此余所以分为中卷，以明运火之法、富国安民之意。 盖修丹之序，当如是尔。 神仙抱一之道 夫神仙抱一之道者，乃圣人运火功圆之时也。 形化纯阳之气者，身投僻陋之隅，面壁九年，抱一以空其心，心定神化，与道冥一。 赞曰：道为性命，本性是心源。 心性同体，变化无边。 百姓日用，亦日自然。 若能了悟，忘象忘言。 虚心实腹，抱一而迁。 功成九转，乃得神仙。 此其旨也。 夫九转者，九年也，九乃阳之极数也。 一者，道之强名也。 抱者，抱无所抱也。 神仙当此之时，瞋肢体，黜聪明，离凡圣，齐物我，毋固毋必，无取无舍，心镜如一，逍遥自在，故得泰定，发乎天光。 九载功圆，则无为之性自圆，无形之神自妙。 神妙则变化无穷，隐显莫测。 性圆则慧照十方，灵通无破，故能分身百亿，应显兄方。 而其至真之体，处於至静之域，板然而未尝有作者，此其神性形命俱与道合真矣，故谓之神仙抱一之道也。 昔仙翁道成之后，示刘奉真之徒以无生而入寂。 既入寂矣，而又现其身於王屋山中者，即斯道也。",
      "translated_text": "Breath aligns with the clepsydra’s marks, the count accords with the celestial revolution—let not a hair’s breadth of deviation arise. Thus is the art of mighty armies and victorious battles.\n\nFor armies are Dragon and Tiger; battle is their union. Within a single double-hour, the Golden Elixir enters the mouth, and the art of victory is manifest. Therefore, the *Western Florescence Scripture* states: “Mighty armies and victorious battles lie in the cultivation of the Mystic Pearl.”\n\nThus the Immortal Elder first arrays sixteen poems to clarify that Dragon and Tiger each bear the number one and eight. One poem of five words and four rhymes signifies that in one double-hour, one grain of Golden Elixir is attained. For this reason, I have divided this into the Upper Scroll, setting it forth to elucidate the art of mighty armies and victorious battles—whereby the work of gathering the Golden Elixir is made perfectly clear.\n\n**The Method of Enriching the State and Pacifying the People**\n\nThe method of enriching the state and pacifying the people is the essence of circulating the yin and yang talismans and firing times. The human Dao is formless, originating in the primal qi. This qi, in its primordial chaos, divides into yin and yang. The purest yang qi, light and clear, rises to cover above—this is called Heaven. The purest yin qi, heavy and turbid, sinks to bear below—this is called Earth. The accumulation of pure yang qi, ascending to Heaven, is the immortal. The accumulation of pure yin qi, sinking into Earth, is the ghost. Endowed with one yin and one yang qi, neither ascending nor sinking, dwelling between Heaven and Earth, capable of becoming immortal or ghost—this is the human.\n\nIf one cultivates and refines, stripping away the yin of the grasses until the form transforms into pure yang qi, one ascends as an immortal. If one knows not cultivation, daily depleting the six yang, until the body transforms into pure yin qi, one becomes a lower ghost. The *Book of Changes* states: “That which is rooted in Heaven inclines upward; that which is rooted in Earth inclines downward.” Each follows its kind.\n\nThus the sage, gazing above and below, knew that humans, endowed with the finest qi of Heaven and Earth, are most numinous, most noble, most supreme. Therefore, they borrowed the two substances of true yin and true yang to seize the primal qi before Heaven and Earth, forming the Elixir. Ingesting it into the Cinnabar Field and Sea of Qi, one governs the postnatal qi of the entire body. Then the qi of the entire body gathers as one—like the myriad states paying court to the sovereign, or the host of stars encircling the North Star.\n\nJust as humans arise from the essence of their parents’ union, so too do they steal the pure qi of yin and yang to serve as the foundation of transformation, called the yin talisman and yang fire. Circulating within the sixty-four hexagrams, revolving without end, cycling the seventy-two seasonal nodes and twenty-four qi within a single day and night, one seizes the four thousand three hundred and sixty measures of true qi, converging them in the Cinnabar Field and Sea of Qi to warm and nurture the Elixir Pearl.\n\nThe Elixir, abiding in the Central Palace, is fundamentally quiescent yet responsive. Thus, externally receiving the yin talisman and yang fire, it generates the true unified divine body. After ten months of womb-transformation, the form transmutes into the pure yang qi of the True One. Hunger and thirst cannot disturb it; cold and heat cannot assail it. Thus is the method of enriching the state and pacifying the people.\n\nFor the state is the body; the people are the essence and qi. The people are the foundation of the state; when the foundation is firm, the state is at peace. If the state lacks a sovereign, the people have no refuge; if the sovereign lacks ministers, the people are untended. Therefore, the sage takes the Elixir as sovereign and fire as minister. When Elixir and fire mutually require each other, sovereign and minister rejoice in union, and the world is governed in peace. Essence is secure, the people are at rest—thus the state of the body is enriched.\n\nThe *Western Florescence Scripture* states: “Essence complete and qi replete—this is how the state is enriched and the people pacified, precisely after ingesting the Golden Elixir.” Thus the Immortal Elder continued with sixty-four quatrains, corresponding to the sixty-four hexagrams of the *Book of Changes*, to clarify the reckoning of firing the lines. He further composed twelve *Moon Over the Western River* poems, symbolizing the firing and bathing practices, completing the work of twelve months. For this reason, I have divided this into the Middle Scroll, to elucidate the method of circulating fire and the meaning of enriching the state and pacifying the people. Such is the proper sequence of Elixir refinement.\n\n**The Dao of Immortals Embracing the One**\n\nThe Dao of immortals embracing the One is the time when the sage’s firing work is complete. When the form has transformed into pure yang qi, the body retreats to a secluded corner, facing the wall for nine years, embracing the One to empty the heart. The heart settles, the spirit transforms, and merges indistinguishably with the Dao.\n\nA eulogy states:\nThe Dao is nature and life; the original nature is the source of the heart.\nHeart and nature are of one body, their transformations boundless.\nThe common people use it daily, yet call it natural.\nIf one can awaken to this, forgetting images and words,\nEmptying the heart and filling the belly, embracing the One to transcend—\nAfter nine revolutions of the work, one attains immortality.\nSuch is its essence.\n\nThe nine revolutions are nine years—the number nine is the utmost of yang. The One is the potent name for the Dao. Embracing is embracing that which cannot be embraced. At this time, the immortal discards the limbs, dismisses hearing and sight, departs from the mundane and sacred, equalizes self and others, without fixation or insistence, without grasping or rejecting. The heart-mirror is as one, carefree and at ease—thus attaining great stability, emitting the radiance of Heaven.\n\nAfter nine years, the work is complete: the nature of non-action is spontaneously perfected; the spirit of formlessness is spontaneously wondrous. When the spirit is wondrous, transformations are inexhaustible, hidden and manifest beyond measure. When nature is perfected, wisdom illuminates the ten directions, numinous penetration is unbroken—thus one can divide the body into a hundred million, responding and manifesting everywhere. Yet the body of utmost truth abides in the realm of utmost stillness, unmoving and as if never acting. At this point, spirit, nature, form, and life all merge truly with the Dao—thus is it called the Dao of immortals embracing the One.\n\nIn former times, after the Immortal Elder attained the Dao, he demonstrated to his disciple Liu Fengzhen the entry into quiescence through non-birth. Having entered quiescence, he then manifested his body in the Wangwu Mountains—this was the very Dao.",
      "overlap_context": " refining the Golden Elixir. In refining the Golden Elixir, one always begins on the first night of the Mid-Autumn moon, when the yang first stirs. Seated to stabilize the celestial pivot, the altar ascends three tiers. To the left, the Dragon is seized to secure the cauldron’s alignment; to the right, the Tiger is grasped to precisely regulate the firing times. Civil and martial forces contend in battle at the mysterious gate; advance and retreat engage in perilous struggle at the Gate of Life.",
      "start_char": 2819,
      "end_char": 4038,
      "start_sentence": 110,
      "end_sentence": 166,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.56391263008118,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真直指详说三乘秘要.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "昔如来涅盘后，自涌金棺於空中，化三昧火。 既焚其身矣，因母哭而不已，又现金身空中，为说半句愒者，亦斯道也。 昔达磨面壁九年，既入灭矣，又携只履西归，并化焚身巨焰。 形既然矣，而铎声犹撼於空中。 若·此之辈流，未易该举。 倘性命双圆，形神俱妙，孰能如是。 是故仙翕毕其卷末而以禅宗性道者，实明神仙抱一之道也，故余分为下卷。 原夫性之道，虚无广漠，默默昏昏，无可得而形容以言之也。 人与非人，悉皆平等，无有高下，但以无始以来，凡有形与名、与夫无有形而名者，未尝有一物不圆成具足，以其本然自有清静具足，故未始有可得而形容以言之也。 然而大藏乃有五千四十八卷者，此皆圣人以人味道之，甚不获己而强言之也。 欲人因言以明道，道明则言语俱成非矣。 故《金刚经》云：如来有所说法，即为谤佛。 是以有言，皆是谤也。 今则仙翁歌咏性道，亦不获己而言之，固已赘矣，此余所以不复加之解释者，不欲为画蛇添足也。 惟愿猛烈高上之士，不由外得，直於自己胸中自悟自明，卓然独耀，直下承当，受用将去，不问喧静语默，酒肆花衢，怠么也得，不怠么也得，头头无别，处处和谐，尽十方世界，具一只眼，出一只手，妙用纵横，四通八达，盖天盖地，随处运动而莫非真，随所施为而无不可，则知这裹本来天性具足，无欠无余，拟议俱弛矣，能所俱忘矣，无问无应，无思无虑，虽性之一字，抑亦用不着也。 三乘秘要诗 金丹卫",
      "translated_text": "In ancient times, after the Tathāgata entered nirvāṇa, his golden coffin arose spontaneously into the sky, transforming into samādhi fire. Having consumed his body, yet his mother’s weeping unceasing, he again manifested his golden form in the void, speaking half a phrase to console her—this too was this very Dao.\n\nLong ago, Bodhidharma faced the wall for nine years; having entered extinction, he yet carried a single sandal westward, and his body transformed into towering flames. Though form had perished, the sound of his staff still shook the heavens. Such examples are too numerous to recount in full. Only when both nature and life are perfected, when form and spirit are both wondrous, can one achieve the like.\n\nThus, at the close of his scroll, the Immortal Elder invokes the Chan school’s teaching of nature and Dao, for it truly clarifies the Dao of immortals embracing the One. Hence, I have divided this into the lower volume.\n\nNow, the Dao of nature is vast and boundless, silent and obscure—no form can capture it, no words describe it. All beings, human and non-human alike, are utterly equal, without high or low. Yet from beginningless time, whether in forms with names or in nameless formlessness, not a single thing fails to be perfectly complete and sufficient, for its inherent purity and sufficiency have never admitted description or definition.\n\nYet the Great Treasury contains fifty thousand forty-eight scrolls—all because sages, seeing people lost in ignorance of the Dao, could do no other than speak of it. They wished that through words the Dao might be understood, but once the Dao is understood, words themselves become superfluous. Thus the *Vajracchedikā Sūtra* states: “If the Tathāgata had taught any dharma, it would be slander against the Buddha.” Therefore, all speech is slander.\n\nNow, when the Immortal Elder sings of the Dao of nature, he too speaks out of necessity, and his words are already redundant. This is why I add no further explanation—lest I paint the lily.\n\nI only wish that those of fierce and lofty aspiration will not seek from without, but directly awaken and realize within their own hearts, shining forth uniquely and assuming the truth without hesitation. Let them take up and employ it, whether in clamor or silence, speech or stillness, taverns or flower-lined streets—whether idle or not, all is well. No distinction remains; everywhere harmony prevails. Throughout the ten directions, a single eye suffices, a single hand extends—wondrous function moves freely in all directions, covering heaven and earth. Wherever they act, it is the real; whatever they do is without hindrance. Then they know that here, originally, the celestial nature is fully sufficient, lacking nothing, with no excess. All deliberation dissolves, subject and object both forgotten. No question, no response; no thought, no concern. Even the word “nature” is no longer needed.\n\n*Secret Essentials of the Three Vehicles*\n*Guardian of the Golden Elixir*",
      "overlap_context": "everywhere. Yet the body of utmost truth abides in the realm of utmost stillness, unmoving and as if never acting. At this point, spirit, nature, form, and life all merge truly with the Dao—thus is it called the Dao of immortals embracing the One.\n\nIn former times, after the Immortal Elder attained the Dao, he demonstrated to his disciple Liu Fengzhen the entry into quiescence through non-birth. Having entered quiescence, he then manifested his body in the Wangwu Mountains—this was the very Dao.",
      "start_char": 4038,
      "end_char": 4605,
      "start_sentence": 167,
      "end_sentence": 183,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.523932456970215,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真直指详说三乘秘要.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "大哉一黍兆虚无，降本流形复卦初。 两片乾坤资造化，一觔日月运机枢。 周星息数微微数，进火神功的的符。 烧罢半辰文武火，赤龙夺得夜明珠。 运火法 一珠饵罢地交天，两剩玄关火炽然。 六十卦循朝与暮，九重城裹汞烧铅。 抽添运用须防险，沐浴停符不使姻。 功备脱胎完十月，元中养出大罗仙。 抱一法 丹即荃蹄道即鱼，忘荃得道证空虚。 莫坚守抱无为一，扑碎虚空一也无。 妙有灵光常赫赫，含容法界自如如。 随绿赴感常清诤，九载金刚不坏躯。 夫泛景大霞，飞升金阙，言存盖简，事出尘寰，彼世俗之人不能深信。 尝观《总仙集序》以为：自昔冲举者十万余人，拔宅者八千余家。 刘向在汉为汉儒宗，亦作《列仙传》以贻后世，则知神仙非诞明矣。 然世俗所以不信者无他，天机玄奥，仙圣秘密，习薄人浮，诚不接於耳，无怪其不信也。 昔太上说《常清静经》，首言大道无形，生育天地。 大道无情，运行日月。 以至长养万物，陶铸群生，亦归於混元元名之始。 先圣之原人者至矣，继而申之以天地男女、清浊动静之理，详及於清心寡欲、湛然常寂之妙，无非显示天机密示玄旨也。 殆其终篇，为能以悟之者，可传圣道究极之说。 得於仙人葛公之语，则口口相传，不记文字。 嗟夫，淳风一离，习俗浅薄，仙尘杳隔，此道无传，异说虽多，同归渺藐。 因是采取铅之法，不形於竹帛之问。 结胎育婴之妙，深锁於金匮玉函之中。 学仙之子皓首穷年，终无由得其髻佛。 圣宋龙兴，异人间出，紫玄真人张公少游辟雍，夙禀灵骨，立志精勤，艰辛不替，得道於青城丈人，尽得金丹奥旨。 罄其所遇，发为歌咏，自名其书日《悟真篇》。 愚幼而读之，潜心深思，褊参众说，无所发明。",
      "translated_text": "Great indeed! A single millet grain foretells the Void,\nReturning to the root, flowing into form at the first hexagram’s dawn.\nTwo realms of Heaven and Earth draw upon creation’s power,\nA single pound of sun and moon turns the pivot of the mechanism.\nThe cycle of stars and the breath-count whisper faintly,\nAdvancing the fire, the divine work manifests its true tally.\nAfter burning half a watch with civil and martial flame,\nThe Crimson Dragon seizes the luminous night-shining pearl.\n\n**Method of Moving the Fire**\nOnce the pearl is ingested, Earth joins Heaven,\nAt the double-excess Mysterious Pass, the fire blazes bright.\nSixty hexagrams follow dawn and dusk,\nWithin the nine-fold city, mercury smelts lead.\nIn drawing and adding, guard against peril,\nIn bathing and halting the tally, let no smoke arise.\nWhen the work is complete and the embryo shed after ten months,\nFrom the primordial is nurtured a Great Luo Immortal.\n\n**Method of Embracing the One**\nThe elixir is the trap, the Dao the fish—\nForget the trap to attain the Dao, realizing emptiness.\nDo not rigidly cling to embracing the non-doing One,\nShatter the void, and even \"one\" is no more.\nThe wondrous being’s numinous radiance ever blazes,\nEncompassing the Dharma-realm, naturally thus.\nFollowing conditions to respond, ever pure and serene,\nAfter nine years, the vajra body remains indestructible.\n\nNow, the vast expanse of rosy clouds, ascending to the golden palace—\nsuch words may seem mere rhetoric, matters beyond the mortal realm.\nYet the worldly cannot deeply believe. I have observed the *Preface to the Comprehensive Immortals’ Collection*,\nwhich states: since ancient times, over a hundred thousand have soared aloft,\nand more than eight thousand households have ascended with their dwellings.\nLiu Xiang, foremost Confucian of the Han, also composed the *Biographies of the Immortals* to bequeath to later ages,\nthus it is known that the immortals are no mere fable.\n\nYet the reason the worldly do not believe lies in nothing else:\nthe celestial mechanism is profound and mysterious, the immortals and sages keep their secrets hidden.\nWith shallow habits and frivolous minds, the truth does not reach their ears—\nno wonder they do not believe.\n\nOf old, the Most High expounded the *Classic of Constant Purity and Stillness*,\nbeginning with the formless Great Dao that gives birth to Heaven and Earth,\nthe passionless Great Dao that moves the sun and moon,\nnurturing the myriad beings, molding the multitudes of life,\nall returning to the primal beginning of the nameless Origin.\nThe sages of antiquity probed the human origin to its utmost,\nthen further elucidated the principles of Heaven and Earth, male and female, purity and turbidity, movement and stillness,\nelaborating on the wonders of a pure heart, few desires, and profound stillness—\nall to reveal the celestial mechanism and secretly impart the profound purport.\nAt the end of the text, it is said that those who awaken may transmit the ultimate teachings of the sagely Dao.\n\nFrom the words of the immortal Master Ge, it was passed mouth to mouth,\nnever recorded in writing. Alas! Since the departure of the pure customs,\nhabits have grown shallow, the immortal dust far removed, this Dao left untransmitted.\nThough heterodox teachings abound, they all lead to the distant and obscure.\nThus the method of refining lead was not inscribed on bamboo or silk,\nthe wonders of forming the embryo and nurturing the infant were deeply sealed in golden caskets and jade boxes.\nStudents of immortality, white-haired from lifelong pursuit,\nnever found the key to unlock its mysteries.\n\nIn the flourishing reign of the Sagely Song, extraordinary figures emerged among men.\nThe Perfected of Purple Mystery, Master Zhang, in his youth studied at the Imperial Academy,\nendowed from birth with a numinous constitution, he set his resolve with diligence,\nundaunted by hardship, attaining the Dao from the Elder of Mount Qingcheng,\nmastering all the profound secrets of the golden elixir.\nExhausting what he encountered, he expressed it in songs and verses,\nnaming his work the *Awakening to Reality*.\nIn my youth, I read it, pondered deeply, and compared it with various teachings,\nyet found no illumination.",
      "overlap_context": "ends—wondrous function moves freely in all directions, covering heaven and earth. Wherever they act, it is the real; whatever they do is without hindrance. Then they know that here, originally, the celestial nature is fully sufficient, lacking nothing, with no excess. All deliberation dissolves, subject and object both forgotten. No question, no response; no thought, no concern. Even the word “nature” is no longer needed.\n\n*Secret Essentials of the Three Vehicles*\n*Guardian of the Golden Elixir*",
      "start_char": 4605,
      "end_char": 5301,
      "start_sentence": 184,
      "end_sentence": 214,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.61464262008667,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真直指详说三乘秘要.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "或指为丹宠之术，或讹为内御之说。 抚篇浩叹，积年于兹。 有幸自天得遇紫阳仙翁、陈公亲传《悟真》、适孙无名真人《释义》，密以见授，焚盥庄诵，恍然如雾散云收、日明月朗，口诀心要，未敢叩击，已知生天生地之机，运行日月之道与。 夫长养万物，陶铸群生，不出於真阴真阳、上下二弦之气。 至於运用抽添、防危虑险，灿灿然在目睫问。 倘能遭遇真传，得兹妙道，生育胎仙，超凡入圣，谅不虚度此生。 甫得入手，踊跃欣庆，敬依泓颖，题诸卷末。 时圣宋嘉泰甲子中秋白云子谨叔。 悟真篇本末事迹 张真人本末",
      "translated_text": "Some misconstrued it as mere cinnabar-alchemy, others distorted it into theories of inner cultivation. Clasping the scroll, I sighed deeply—years passed thus. By heaven’s grace, I was fortunate to receive from the Immortal of Purple Yang, Master Chen, the *Awakening to Reality* in its authentic transmission, and from the Perfected Sun Wuming, the *Exegesis*. Secretly bestowed, I bathed, purified myself, and recited them with reverence. Suddenly, it was as if mist dispersed and clouds parted, sun shone and moon gleamed—before I could even inquire into the oral instructions and essential teachings, I already grasped the mechanism of generating heaven and earth, the Dao of circulating the sun and moon.\n\nFor nurturing the myriad things and molding all beings, nothing lies beyond true yin and true yang, the qi of the upper and lower celestial arcs. As for the application of withdrawal and replenishment, the vigilance against peril and danger—all glitters clearly before one’s eyes. If one can encounter a true transmission and attain this wondrous Dao, nurturing the immortal embryo, transcending the mundane to enter sageliness, one surely will not have lived this life in vain.\n\nHaving just gained access to this teaching, I leap with joy and exultation. Respectfully following the brush of Hong Ying, I inscribe these words at the end of the scroll.\n\n*Written in the Mid-Autumn of the Jiazi year of the Jiatai reign of the Sagely Song by Baiyunzi, who signs himself Jin Shu.*\n\n*Postscript on the Origins of the Awakening to Reality*\n*The Origins of the Perfected Zhang*",
      "overlap_context": "y, Master Zhang, in his youth studied at the Imperial Academy,\nendowed from birth with a numinous constitution, he set his resolve with diligence,\nundaunted by hardship, attaining the Dao from the Elder of Mount Qingcheng,\nmastering all the profound secrets of the golden elixir.\nExhausting what he encountered, he expressed it in songs and verses,\nnaming his work the *Awakening to Reality*.\nIn my youth, I read it, pondered deeply, and compared it with various teachings,\nyet found no illumination.",
      "start_char": 5301,
      "end_char": 5537,
      "start_sentence": 215,
      "end_sentence": 224,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.178551435470581,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真直指详说三乘秘要.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "紫阳真人，乃天台缨络街人。 先名伯端，字平叔，后名用成。 少无名不学，浪边云水。 晚传混元之道未备，孜孜访问，褊历四方。 熙宁中，陆公龙图锐镇成都，乃依以游蜀，任四川节度制置使安抚司参议。 於己酉岁，遂遇异人传火候之秘，其道乃成。 仍戒之曰：他日有与汝脱缰锁者，当受之。 既而三传，每罹灾患，仍深自悔责，遁世忘言，着《悟真篇》八十一章，尽述二丹之秘。 其议论大旨则深嫉世之学者专门各宗，三教异流，不能混一矣。 异派同源之理通亮，继正力补於道，天下传诵之。 陆公其蜕，得其舍利千百，若鸡头实者，色皆钳碧。 既而复有见之者，云政和中，通姓名以谒黄君冕仲尚书於延平，黄公素传容成之道，且酷嗜炉火，年加耄矣，语不契而去，继而使人寓书於黄，叔述甚异。 其孙铨见其书，秘不尽言，独告予大略云：平叔自谓与黄皆紫微天官，号九皇真人，因校劫运之籍，遂谪於人问。 今垣中可见者，六星而已。 潜耀者三：平叔、冕仲，洎维扬于先生也。 平叔曰紫阳真人，冕仲曰紫元真人，于公曰紫华真人。 一时被谴者，官吏皆已、复於清都矣。 今平叔又登仙品，独冕沉沦於宦海，凡当为人者十世，今九世矣。 来世苟复迷妄合尘，则沦坠异趣，无复升迁之期。 平叔明序仙契，力欲振拔，而黄公竟不契而没，惟自号曰紫元翁而已。 九皇不载於天官，盖微星也。 非常名而可名者，在万二千五百之问耶。 薛紫贤事迹 道源姓薛名式，陕府鸡足山人也。 尝为僧，法号紫贤。 云游长安，留开福寺，参长老修严，严与道眼因绿，金鸡未呜，如何后这音响。 又参僧如环，如何是超佛祖之啖，糊饼圆陀陀地。 闻桔柠顿有省悟，有颂曰：轧轧相从响发时，不从他得豁然知。 桔柠说得无生曲，井底沉蛇舞拓枝。 二老然之。 自尔顿悟无上秘密、圆明真实法要，机锋迅速，宗说兼通，且复雅志金丹道养。 崇宁丙戌岁冬，寓那县青镇，听讲佛事，适遇凤翔府扶风县杏林驿人石泰字得之，年八十五矣，绿发朱颜，神宇不凡，夜事缝纫。 道源密察焉，心因异之，偶举张平叔诗曲，石攫然，日：识斯人乎。 日：吾师也。 遂将语着於平叔者。 平叔先生，旧名伯端，始於成都宿天回寺，遇异人，改名用成。 凤州太守怒按以事，坐鲸窜。 经由合境，会天大雪，与护送者俱饮酒村肆，吾适肆中，既揖而坐，见邀同席，吾笑顾此众：客方惧，彼客未成饮，盍来相就。 於是会饮酒酣，问其故，且以告。 吾念之日：邓守，故人也，乐善忘势，不远百里，能迂玉趾，有因绿，可兔此行。 平叔恳诸护送者，许之诺，遂复丁合。 吾为之先，一见获兔。 平叔德之，曰：此恩不报，岂人也哉。 子平生学道无所得闻，今将丹法用传于子以成道。 吾再拜谢，仰受付嘱。 道源源闻石泰说是语已，稽首皈依，请因受业，卒学大丹，及复受得口诀真要。 且戒往通邑大都，依有德有力者，可即图之。 道源遂来京师，弃僧伽梨，幅巾缝掖，和光同尘，混於常俗，觊了此事。 岂患学仙道流，得遇平叔诗曲，随其所见，致有差殊。 而意之所疑，又须展转，心生迷谬，莫能晓悟，孰从而语之《参同》哉。 致使不敢下手修炼者，多矣。 呜呼，岂平叔先生之本心哉。",
      "translated_text": "The Perfected One of Purple Yang was originally from Yingluo Street in Tiantai. His original name was Boduan, styled Pingshu, and later renamed Yongcheng. In his youth, he was untutored and aimless, drifting like clouds and water. Later, though he had received the teachings of the Primordial Dao, they were incomplete, so he diligently sought instruction, traveling extensively across the four directions. During the Xining era, when Lord Lu the Dragon Diagram was vigorously governing Chengdu, he followed him to Shu, serving as a policy advisor in the Pacification Bureau of the Sichuan Military Commissioner’s Office. In the year Jiyou, he encountered an extraordinary person who transmitted to him the secrets of the fire-phase, and thus his Dao was perfected. The master admonished him, saying: \"One day, if someone comes to free you from your bonds, you must accept them.\" After three transmissions, each time he encountered disasters and misfortunes, he deeply repented and blamed himself, withdrawing from the world and ceasing all speech. He composed the *Awakening to Reality* in eighty-one chapters, fully expounding the secrets of the two elixirs. Its discussions and main principles deeply criticized the scholars of his time for clinging to their separate schools, as the three teachings flowed in different currents, unable to merge into one. Yet the principle that different schools share a common source shone clearly. He continued the orthodox tradition and powerfully supplemented the Dao, and his work was widely recited throughout the world. When Lord Lu shed his mortal form, hundreds of śarīra were found, resembling cockscomb seeds, all shimmering in a golden-green hue. Later, there were those who claimed to have seen him, saying that during the Zhenghe era, he visited Minister Huang Mianzhong of Yanping under his true name. Huang had long transmitted the teachings of Rongcheng and was deeply devoted to alchemical practices. Though advanced in years, their conversation failed to resonate, and he departed. Subsequently, he sent a letter to Huang, which Pingshu found most extraordinary. Huang’s grandson Quan saw the letter but kept its contents secret, revealing only the general outline to me: Pingshu claimed that both he and Huang were celestial officials of the Purple Tenuity Palace, known as the Nine August Perfected Ones. Due to reviewing the records of kalpas and destinies, they were banished to the human realm. Among them, only six stars are now visible in the celestial enclosure, while three remain concealed in obscurity: Pingshu, Mianzhong, and Master Yu of Weiyang. Pingshu was called the Perfected One of Purple Yang, Mianzhong the Perfected One of Purple Primordium, and Master Yu the Perfected One of Purple Florescence. All those who had been banished as officials had already returned to the Pure Capital, but Pingshu had once again ascended to the ranks of immortals. Only Mianzhong remained mired in the sea of officialdom, having been reborn as a human for ten lifetimes—now in his ninth. If in his next life he again succumbs to delusion and clings to the dust, he will sink into other destinies, with no hope of promotion. Pingshu clearly set forth the covenant of immortals, striving to rescue him, yet Huang ultimately failed to resonate with the teachings and passed away, merely styling himself the Old Man of Purple Primordium. The Nine August Ones are not recorded among the celestial officials, for they are but faint stars—perhaps among the twelve thousand five hundred?\n\n**The Affairs of Master Xue Zixian**\nDao Yuan, surnamed Xue and named Shi, was a native of Jizu Mountain in Shanfu. He had once been a monk, with the Dharma name Zixian. Wandering to Chang’an, he stayed at Kaifu Temple, where he studied under the elder Xiuyan. Yan, perceiving his capacity for the Dao-eye, asked: \"Before the golden cock crows, how does one respond to this sound?\" He also studied under the monk Ruhuan, who asked: \"What is the bite that transcends the Buddha and the Patriarchs?\"—to which he replied, \"A sesame cake, round and complete.\" Upon hearing the creaking of a well-pulley, he suddenly attained enlightenment and composed a gatha:\n\n*When the creaking follows the sound’s arising,*\n*Not from another does sudden knowing come.*\n*The well-pulley sings the song of no-birth,*\n*While the snake in the well dances with abandon.*\n\nThe two elders affirmed his realization. From then on, he thoroughly awakened to the supreme secret, the perfectly luminous and true essential Dharma. His wit was swift, and he was equally versed in both the school and the teachings. Moreover, he ardently aspired to the cultivation of the golden elixir. In the winter of the Bingxu year of the Chongning era, while residing in Qing Town of Na County to attend a Buddhist lecture, he encountered Shi Tai, styled Dezhi, a native of Xinglin Post in Fufeng County, Fengxiang Prefecture. Though eighty-five years old, Shi had green hair and a ruddy complexion, his spirit and bearing extraordinary. At night, he sewed clothes. Dao Yuan observed him in secret and felt a sense of wonder. By chance, he recited a poem by Zhang Pingshu, and Shi was startled, asking: \"Do you know this man?\" Dao Yuan replied: \"He is my teacher.\" Thereupon, he recounted what Pingshu had said.\n\nMaster Pingshu, originally named Boduan, first encountered an extraordinary person at Tianhui Temple in Chengdu, who changed his name to Yongcheng. The governor of Fengzhou, enraged, pressed charges against him, and he was exiled. Passing through the prefecture, they encountered a great snowfall. He and his escorts drank together at a village tavern, where I happened to be present. After exchanging bows and sitting down, he invited me to join them. I smiled at the group and said: \"The guests are fearful, but this guest has not yet begun drinking—why not come and join us?\" Thus, we drank together until merry. He asked the reason for my presence, and I explained. I thought to myself: \"Governor Deng is an old friend, delighting in goodness and forgetting rank. Though a hundred *li* away, he would not hesitate to come if there were a reason.\" Pingshu pleaded with his escorts, who agreed. Thus, he was released at He. I went ahead, and with one meeting, he was pardoned. Pingshu was deeply grateful, saying: \"If I do not repay this kindness, how can I be called a man? Though I have studied the Dao all my life, I have never heard of such a method. Now, I will transmit the alchemical technique to you to perfect your Dao.\" I bowed in thanks and reverently received his instructions.\n\nDao Yuan, having heard Shi Tai’s account, prostrated himself in homage and sought to become his disciple. He ultimately mastered the great elixir and received the true essential oral instructions. Shi further admonished him to go to great cities and metropolises, seeking those of virtue and power to assist in his endeavor. Dao Yuan then came to the capital, discarded his monk’s robes, and donned a scholar’s turban and robe. Concealing his light and blending with the dust, he mingled among ordinary folk, hoping to fulfill this task. Yet among those who study the Dao of immortality, even those who encounter Pingshu’s poems may interpret them differently according to their own understanding, leading to discrepancies. Doubts arise, minds become confused, and clarity eludes them—who then can explain the *Triple Concordance* to them? Thus, many dare not begin their practice. Alas! Was this Master Pingshu’s original intention?",
      "overlap_context": "tal embryo, transcending the mundane to enter sageliness, one surely will not have lived this life in vain.\n\nHaving just gained access to this teaching, I leap with joy and exultation. Respectfully following the brush of Hong Ying, I inscribe these words at the end of the scroll.\n\n*Written in the Mid-Autumn of the Jiazi year of the Jiatai reign of the Sagely Song by Baiyunzi, who signs himself Jin Shu.*\n\n*Postscript on the Origins of the Awakening to Reality*\n*The Origins of the Perfected Zhang*",
      "start_char": 5537,
      "end_char": 6754,
      "start_sentence": 225,
      "end_sentence": 276,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.38253927230835,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真直指详说三乘秘要.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "於是慨然首为训释，条达宗旨，通玄究微，开蒙发昧，人可率解。 俾修炼者，无或差误，得证高真，作丹砂用。 初平叔先生尝因获罪，誓不语人，已而叹曰：自为计得矣，非所以为道也。 太上玄科日：遇人不传失天道，妄传非人泄天宝。 传得其人身有功，妄传七祖受冥考。 我今斩固闭天道也，祸将大矣。 不得已述诗曲，始以流传世之奇人，使读之自悟，诗曲中之意，亦隐深不可识。 道源因以推广其意，为注解明白。 真要洞阐，玄微法事悉备，表裹焕然，余蕴无所藏矣。 然获览者，得以寻详释其疑惑，不伺咨闻，能自了了，所以成平叔先生之志也。 然而道源既欲以是垂世传后，则亦将缄默，自此隐矣。 获斯文者，宜加秘密，天之所宝，在在处处，自有神物营卫护持。 若有志士信道明真，言行无玷，审是修行，然后付焉。 金玉堆裹不可传焉，父子至亲亦勿与之。 盖轻泄慢漏，身则受殃，门户有灾，子孙不祥。 岂止如是，又将祸延九玄七祖，阴谴冥责，长役鬼官，永不受生。 念兹慎兹，无忽。",
      "translated_text": "Thus moved by profound resolve, he first undertook to expound and clarify, systematically unfolding the essential principles, penetrating the mysteries and probing the subtleties, dispelling ignorance and awakening the benighted, so that all might readily comprehend. By this means, those who cultivate and refine may avoid error and deviation, attain realization as lofty perfected ones, and employ cinnabar in the elixir’s work.\n\nMaster Chuping once vowed, after incurring fault, never to instruct others, yet later sighed and said: “For myself, this may suffice, but it is no way to uphold the Dao.” The Most High’s sacred statutes declare:\n\n*Failing to transmit when one meets the right person severs the celestial Way;\nRecklessly imparting to the unworthy leaks the celestial treasure.\nTo transmit to the proper recipient brings merit to one’s person;\nTo recklessly transmit brings netherworld torment to seven generations of ancestors.*\n\nNow I have obstinately sealed the celestial Way—calamity will be great indeed. Thus compelled, I composed poems and songs, first to circulate among the world’s extraordinary persons, that they might read and awaken on their own. Yet the meaning within these poems and songs remains deeply concealed, beyond recognition.\n\nDaoyuan therefore expanded upon their intent, composing annotations to make all plain. The true essentials are thoroughly revealed, the profound subtleties of the method fully set forth, the inner and outer radiantly displayed, with no residue left concealed. Those who obtain and peruse this may thereby trace and examine, resolving their doubts without need for inquiry, able to comprehend fully on their own—thus fulfilling Master Chuping’s original intent.\n\nYet Daoyuan, having resolved to transmit this to later generations, shall henceforth seal his silence and withdraw into seclusion. Those who obtain this text must guard it with utmost secrecy. What Heaven treasures is everywhere attended and protected by numinous forces. Only when a person of resolve, steadfast in the Dao and clear in truth, whose words and deeds are without blemish, has carefully ascertained the path of cultivation, may it then be entrusted to them.\n\nIt must not be transmitted amid piles of gold and jade, nor even to one’s closest kin, father or son. For careless disclosure and wanton leakage bring misfortune upon the self, disaster upon the household, and inauspiciousness to descendants. Not only thus: it will further extend calamity to nine generations of ancestors and seven generations of forebears, subjecting them to dark retribution and netherworld punishment, bound eternally to ghostly servitude, never to receive rebirth. Bear this in mind, take heed, and do not neglect it.",
      "overlap_context": "aling his light and blending with the dust, he mingled among ordinary folk, hoping to fulfill this task. Yet among those who study the Dao of immortality, even those who encounter Pingshu’s poems may interpret them differently according to their own understanding, leading to discrepancies. Doubts arise, minds become confused, and clarity eludes them—who then can explain the *Triple Concordance* to them? Thus, many dare not begin their practice. Alas! Was this Master Pingshu’s original intention?",
      "start_char": 6754,
      "end_char": 7152,
      "start_sentence": 277,
      "end_sentence": 293,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.737566232681274,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真直指详说三乘秘要.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "商丘老圃今是翁元王真一既缮写注解《悟真篇》诗曲，并与当时承受事迹，因编详记於后。 虽言不文饰，而直书实录，庶几备见本末云。 政和岁次乙未中秋日记。 泰定丁卯在瑞阳见薛紫贤注《悟真篇》，读之惘然，恨未见全本。 天历癸巳归升获全本，反复读之，数年见其端倪，继蒙远方道友寄至数本勘俨，皆同注文，所驳傍门，或本作或者，或本作叶文叔，此其疑也。 近刊行《悟真篇》解诸家节文，其中所引象川翁、无名子二人之注，比之所获紫贤之注，又皆同，疑其文同而人异，此疑也。 宋嘉泰壬戌袁公辅斥文叔注疏，混般难考。 因选择其注，究公辅所受之道，亦不过独修一物，又何斥他人哉。 文叔之果是哉，何紫贤、公辅皆斥之，此其疑也。 因以年月考之，道光作《复命篇》自叔宣和庚子岁得遇至人口诀。 今之商丘今是翁元王真一在政和乙未记薛紫贤事迹，叶文叔注在绍兴三十一年辛巳，相隔四十七年。 文叔於政和乙未或未生，或童幼，安得紫贤於四十七年之前豫指名而斥之者。 又皆文叔之真谬，非他人所注，此其疑也。 以是数疑，疑其非紫贤之注，而未庾然。 其所注与诸家不同，而实得真人之旨。 至顺辛未五月初三日，得遇金丹、药物、火候直诀，天授之也。 终疑其非紫贤所注，於心未释，参问不已，旁求四方。 至顺壬申秋，武陵故友传至象川翁葆光解，喜跃不已，读之累月，则前之所疑涣然冰释，确然如世传紫贤之注，实为无名子之注，迷以葆光讹为道光。 何其讹传之久，而人未之订耶。 何以言之真人传石杳林，杏林传紫贤为第三传，此世之知也。 真人传广益子，广益子传无名子，亦为第三传，此世之罕知也。 好事者欲其所注取信当世，遂节无名子之注以传流之。 显者知紫贤附於后以实之，记者日：元王真一。 二人为一人也。 《悟真篇》者，仁慈之普，尽泄天机者矣。 安有元王之姓，是自讹其记述之名，以惑世也。 或者又日：紫贤为僧，一名道光一名葆光。 是又以光字之同，而讹以其指斥叶文叔者，今以无名子之注考之，前乎文叔未有注后乎文叔未有斥文叔之非者。 无名子恐其失真人之旨，迷误后人於乾道癸巳，冒犯天谴，谨依师旨注解篇义，毫分缕析，惟恐人迷，可谓世人节录诸解，未见全文，又讹翁姓为老者之称，分象川翁无名子为二人。 近又讹无名子之注为紫贤之注，讹以传讹，於其文义、年月尚不能参考其妄，安望其知仙道之真传也哉。 金丹大道之的传久矣，其绝矣。 今四海混一，学仙纷纷，求其一二能闻是道者，何其寥寥也。 抑紫贤此注不传於后世乎，将予孤寡而未见乎。 今无名子之注详尽而无留蕴，世传紫贤之注大同而多阙略，假使紫贤有注，无名子安得不援其文而反窃其全文而易以己名而传世乎。 无名子於释月圆之义，止引紫贤二语，可见紫贤之未有注也。 注者，於始於有作人事觉之注，及引无是子日，无是即无名之讹也，可见紫贤之未尝有注也。 今讹为紫贤之今之学仙者未可以紫贤显知、无名罕知，以重为轻也。 然其师传之真、仙道之正，二仙皆同也，皆传之自平叔。 真人斯文所在，端有神物营卫护持，安得不宝其文而珍藏之，择其人而流传之。",
      "translated_text": "The Elder Gardener of Shangqiu, now known as Master Wang Zhenyi of the Present Age, having transcribed and annotated the *Wuzhen pian* (\"Awakening to Reality\") with its poetic verses, together with the events of its transmission as received in his time, has compiled and recorded them in detail below. Though his words are unadorned, they are a faithful account, so that the beginning and end may be fully seen.\n\nRecorded on the Mid-Autumn Festival of the *yiwei* year of the Zhenghe era [1115 CE].\n\nIn the *dingmao* year of the Taiding era [1327 CE], at Ruiyang, I encountered Xue Zixian’s annotation of the *Wuzhen pian* and read it with a sense of loss, regretting that I had not seen the complete edition. In the *guisi* year of the Tianli era [1333 CE], upon returning to Sheng, I obtained the full text and read it repeatedly. Over several years, I began to discern its essential meaning. Later, I received several versions from distant Daoist friends for collation, all of which shared the same annotations. Where they refuted heterodox teachings, some attributed the errors to \"a certain person,\" while others named Ye Wenshu. Herein lies the first doubt.\n\nRecently published editions of the *Wuzhen pian* with annotations by various scholars include references to the commentaries of Master Xiangchuan and the Nameless One. Compared to the annotations I obtained from Zixian, these are identical, yet the authors differ—another doubt.\n\nIn the *renshu* year of the Jiatai era [1202 CE], Yuan Gongfu condemned Ye Wenshu’s commentary, leaving its origins obscure. Upon examining Gongfu’s own received teachings, I found they amounted to nothing more than solitary cultivation of a single element. Why, then, did he condemn others? If Wenshu’s work were truly flawed, why did both Zixian and Gongfu denounce it? Herein lies another doubt.\n\nBy examining the chronology: Daoguang composed the *Fuming pian* (\"Restoration of Life\"), stating that he received oral instructions in the *gengzi* year of the Xuanhe era [1120 CE]. Now, Wang Zhenyi of Shangqiu, in the *yiwei* year of the Zhenghe era [1115 CE], recorded the events of Xue Zixian’s life. Ye Wenshu’s annotations date to the *xinsi* year of the Shaoxing era [1161 CE], forty-seven years later. Wenshu may not even have been born—or was still a child—in the *yiwei* year of Zhenghe. How could Zixian have foreseen and condemned him forty-seven years in advance? Moreover, all the errors attributed to Wenshu appear in no other annotations. Herein lies yet another doubt.\n\nGiven these uncertainties, I suspected that the annotations were not Zixian’s, though I could not be certain. While his commentary differs from others, it truly captures the essence of the Perfected One’s teachings.\n\nOn the third day of the fifth month in the *xinyou* year of the Zhishun era [1331 CE], I encountered the direct instructions on the Golden Elixir, its ingredients, and the firing times—a celestial transmission. Yet I remained doubtful that the annotations were Zixian’s, and the matter weighed on my mind. I questioned ceaselessly and sought answers far and wide.\n\nIn the autumn of the *renshen* year of the Zhishun era [1332 CE], an old friend from Wuling transmitted the *Baoguang* commentary by Master Xiangchuan. Overjoyed, I read it for months, and my earlier doubts melted away like ice. It became clear that the annotations long attributed to Zixian were in fact the work of the Nameless One, mistakenly ascribed to Daoguang (Baoguang). How long this error has persisted, yet no one has corrected it!\n\nHow do I know this? The Perfected One transmitted the teachings to Shi Yaolin, and Yaolin to Zixian as the third generation—this is widely known. The Perfected One also transmitted to Guangyizi, and Guangyizi to the Nameless One, likewise the third generation—this is rarely known. Those who sought to lend credibility to the Nameless One’s annotations circulated them in abridged form. Later, to bolster their authenticity, they appended Zixian’s name, with the record stating: \"by Wang Zhenyi.\" Thus, two individuals were conflated into one.\n\nThe *Wuzhen pian* is a work of universal compassion, fully revealing the celestial mysteries. How could it bear the surname \"Yuan Wang\"? This is a self-inflicted error in the record, meant to mislead the world. Some further claim that Zixian was a monk, also known as Daoguang or Baoguang. This confusion arises from the shared character *guang* (\"light\"), leading to the mistaken attribution of criticisms of Ye Wenshu. Yet when we examine the Nameless One’s annotations, no one before Wenshu had written commentaries, nor did anyone after him condemn Wenshu’s errors.\n\nThe Nameless One, fearing that the Perfected One’s teachings would be lost and future generations misled, dared—at the risk of heavenly retribution—to annotate the text in the *guisi* year of the Qiandao era [1173 CE], adhering strictly to his master’s instructions. His explanations are meticulous, leaving no detail unaddressed, lest others be led astray. Yet later scholars, having only abridged versions of various commentaries, have never seen the complete text. They further erred by misreading the title \"Xiangchuan\" as an honorific for an elder, splitting the Nameless One and Xiangchuan into two individuals. More recently, the Nameless One’s annotations have been misattributed to Zixian. Error upon error has accumulated, and even the basic coherence of the text and its chronology cannot be verified. How, then, can one hope to grasp the true transmission of the immortal Dao?\n\nThe authentic transmission of the Great Way of the Golden Elixir has endured for ages, yet it now verges on extinction. Though the world is united and seekers of immortality abound, how few have truly encountered this teaching! Will Zixian’s annotations not be transmitted to later generations? Am I alone in having failed to see them?\n\nThe Nameless One’s annotations are exhaustive, leaving no obscurities. The annotations commonly attributed to Zixian are largely identical but riddled with omissions. If Zixian had indeed written a commentary, how could the Nameless One have ignored it, instead appropriating the entire text and publishing it under his own name? In his explanation of the \"full moon\" passage, the Nameless One cites only two lines from Zixian, proving that Zixian never wrote a commentary. The annotator begins with \"where human effort is applied to awaken understanding,\" and later cites \"Wu Shi Zi\" (\"Master of No-This\"), a corruption of \"Nameless One.\" This further confirms that Zixian never wrote a commentary.\n\nToday’s error—attributing the Nameless One’s work to Zixian—leads modern seekers of immortality to dismiss the obscure (Nameless One) in favor of the well-known (Zixian), inverting their true significance. Yet the authenticity of their master’s transmission and the orthodoxy of the immortal Dao are the same for both, as both trace their lineage to [Zhang] Boduan.\n\nWherever the words of the Perfected One reside, numinous forces attend and protect them. How could one fail to treasure this text and preserve it, transmitting it only to those worthy of receiving it?",
      "overlap_context": "f gold and jade, nor even to one’s closest kin, father or son. For careless disclosure and wanton leakage bring misfortune upon the self, disaster upon the household, and inauspiciousness to descendants. Not only thus: it will further extend calamity to nine generations of ancestors and seven generations of forebears, subjecting them to dark retribution and netherworld punishment, bound eternally to ghostly servitude, never to receive rebirth. Bear this in mind, take heed, and do not neglect it.",
      "start_char": 7152,
      "end_char": 8358,
      "start_sentence": 294,
      "end_sentence": 332,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.91588592529297,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真直指详说三乘秘要.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "因并附所记真人本末及紫贤事迩於无名子注文之后，而通辨之，庶得斯注疏者理易明、讹易革，知吾言之不妄，不敢讹传其注也。 知大道之难闻，不敢轻传非人也。 学仙有绿，因文解义，因注达旨，不迷傍门，直超大道，天之所赐，则金丹大道未尝绝传矣。 世之又传别本有淳熙改元九月子虚子小序，在陈紫阳序之前。 其於无名子之序节去，谨依仙翁之秘旨一段。 又易其后文《分三乘秘要论》，名贯卷首。 其於注文增又日：其说之要，以童男童女为阴阳、龙虎。 男女之气为先天、后天，为铅汞，为真水火，为初弦。 当天癸之年为癸生，二八为三阳备，为蟾光圆，为金鼎完，为大小无伤，为两国全，为先天气，为外药，诚可谓邪宗曲振而妄注之也。 乃子虚子之邪宗，故不敢显姓名。 又冒先书其年月，托以无名子未言旨取於世。 或日子虚子即无名子之异号，日审如是，则无名子自相矛盾矣。 且乾道癸巳次年甲午，改元淳熙，一年之问，师旨遽异，何以言之。 嘉泰甲子白云子序陈紫阳，始传斯注，相诅三十二年，注文全然纯一，秘旨坦然明白，无一字邪说以揉杂之。 癸巳至甲午相诅期月，即畔前注，当是时无名子未仙去，倘见闻之，必以为邪宗而攻之矣，岂有攻叶文叔而守子虚子者乎。 且子虚子何不就有道以正，使其传果正邪。 无名子必自增改，又何以为增无名子未言之旨乎。 是以知其妄注也审矣。 学仙之士，有绿获斯注之真者，幸明鉴而珍袭之。 至元丙子中元空玄子戴起宗一仲同父谨辨。 我闻在昔有若紫贤真人阐大道之希微，拯迷徒之沦溺，道成之日，着《悟真篇》以传于世。 盖平生之所历，萃於此矣。 学道者不率是篇之所言，譬犹适江海而离楫也。 奈何世远风微，言厉道隐。 坚执傍门，以毁仙道。 深蔽法象，以非真诠。 由此以神仙为渺茫，丹书为漫诞，而《悟真》之书，真人之心，竟莫克明于世。 乃若无名子接夫正传之绪，念其注者讹以传讹，复以此书注行于世，章分句释，畦疏叮别，尽泄天机，备载其中。 熟玩精思，当自得也。 叔祖父自稚龄慕道，读之有年，天启其衷，与闻玄秘。 以平日所闻於父师所授者，与夫己之所自得者，疏於无名子注文之末，俾来者得以取准焉，不至堕於渺茫而流于诞漫也。 溥哉，其心乎顺，夙生有绿，获阀其书，皇为庆幸。 又安得友方外之人，踏名蜡以栖真，策仙风而遐诣。 安立鼎炉，呼吸龙虎，颠倒汞铅，采之於一时，胎之於十月，空之於九载，泠然驭飞车，度弱水，跨灵鳖，侍诸仙真之下风，以闻希夷之大道，以拯沦溺之徒，乃所愿则学紫贤也。 至元丁丑上巳日后学戴顺稽首书于朱湖大生洞天。 金丹法象 无名子於《悟真篇注》钻集金丹法象，比喻众名，可谓备矣。 起宗推广裒集《参同契》及诸仙经论诗词，凡所假借天道、《易》象、人事、理物比喻金丹阴阳法象，分为七类，附於《悟真篇注》之下，庶学仙者易於参究，知夫内外同异之分，互为法象。 五行变化之序，难以定名。 明其本源之一契，其同有之实辨其异喻之名，则仙师之明，皆可以一贯之。 得於此而忘真荃，由於此而成仙道，亦非小补云。 至元丁丑上元戴起宗序。 阳 天　　　　日　　　　参　　　　乾",
      "translated_text": "Herewith the translation:\n\n---\n\nAccordingly, I have appended the recorded origins of the Perfected One and the recent affairs of Zixian to the commentary of the Nameless One, offering a comprehensive critique. Thus may those who study this annotation find its principles readily clarified and its errors easily corrected, recognizing the truth of my words and refraining from falsely transmitting the commentary.\n\nKnowing the rarity of encountering the Great Dao, I dare not lightly transmit it to unworthy recipients. Those who pursue immortality follow a path: through text they grasp meaning, through annotation they penetrate the essence. Unled astray by heterodox teachings, they ascend directly to the Great Dao. This is Heaven’s gift, ensuring the transmission of the Golden Elixir’s Great Dao remains unbroken.\n\nThere exists another version, prefaced by a brief introduction by Zixuzi dated the ninth month of the first year of the Chunxi era, placed before Chen Ziyang’s preface. This version omits the Nameless One’s preface, retaining only the secret instructions of the Immortal Elder. It further alters the subsequent text, renaming *The Secret Essentials of the Three Vehicles* and placing it at the beginning. The commentary therein adds:\n\n> Its essential teachings regard virgin boys and girls as yin and yang, dragon and tiger; the qi of male and female as precelestial and postcelestial, as lead and mercury, as true water and fire, as the new moon. The year of *tiangui* is called *gui*’s birth; at sixteen, the three yang are complete, the toad’s light is full, the golden tripod is whole, great and small are unharmed, the two realms are whole, the precelestial qi is the external medicine. Truly, this is a heterodox sect’s perverse flourish, a spurious annotation.\n\nThis is the heresy of Zixuzi, who dared not reveal his true name. He falsely dated his work earlier, attributing his unspoken doctrines to the Nameless One to gain worldly acceptance. Some claim Zixuzi is merely another name for the Nameless One. If this were true, the Nameless One would contradict himself. Moreover, in the year *gui-si* of the Qiandao era, the following year *jia-wu* saw the reign title changed to Chunxi. Within a single year, how could the master’s teachings suddenly diverge?\n\nIn the *jia-zi* year of the Jiatai era, Baiyunzi prefaced Chen Ziyang’s transmission of this commentary. Thirty-two years later, the annotation remains entirely pure and unified, its secret instructions clear and unambiguous, without a single heterodox word intermingled. From *gui-si* to *jia-wu*, a mere year apart, this version rebels against the prior annotation. At that time, the Nameless One had not yet ascended; had he witnessed this, he would surely have condemned it as heresy. How could one attack Ye Wenshu while upholding Zixuzi?\n\nFurthermore, why did Zixuzi not seek the guidance of the enlightened to verify his transmission’s orthodoxy? If the Nameless One had indeed revised his own teachings, why would he claim to expand upon the Nameless One’s unspoken doctrines? Thus, the spuriousness of this annotation is undeniable.\n\nScholars of immortality who obtain the authentic version of this commentary should discern its truth and treasure it. Respectfully annotated on the fifteenth day of the first lunar month in the *bing-zi* year of the Zhiyuan era by Kongxuanzi Dai Qizong, styled Yizhong, and his father.\n\n---\n\nI have heard that in ancient times, the Perfected One Zixian expounded the subtle mysteries of the Great Dao, rescuing deluded disciples from drowning. On the day of his Dao’s fulfillment, he composed the *Wuzhen Pian* to transmit to the world, distilling his life’s experiences therein. Those who study the Dao yet fail to follow this text’s teachings are like travelers bound for the rivers and seas who abandon their oars.\n\nAlas, as the ages recede and the winds of the Dao grow faint, its words become stern and its Way concealed. Some cling to heterodox teachings, slandering the immortal Dao; others obscure its symbolic truths, rejecting its true principles. Thus do they deem the divine immortals as distant and indistinct, the alchemical texts as frivolous and absurd. The *Wuzhen*’s teachings and the Perfected One’s intent remain unrecognized in the world.\n\nYet the Nameless One, inheriting the orthodox transmission, lamented the proliferation of errors in its annotations and thus released this commentary into the world. Dividing chapters and explicating sentences, he meticulously distinguished each detail, fully revealing the celestial mechanisms and exhaustively recording them within. Through diligent study and profound reflection, one may attain understanding.\n\nMy great-uncle, from childhood, revered the Dao and has studied this text for years. Heaven opened his heart, granting him access to its mysteries. Drawing from his father’s and teachers’ instructions, as well as his own insights, he appended this exposition to the Nameless One’s commentary, that future seekers might use it as a standard, avoiding the pitfalls of vagueness and delusion.\n\nHow vast is his intent! By karmic affinity, I obtained this book, for which I am profoundly grateful. How might I encounter companions beyond the mundane, treading the fragrant paths to cultivate truth, riding the immortal winds to distant realms? Establishing the crucible and furnace, inhaling and exhaling dragon and tiger, inverting mercury and lead, gathering them in an instant, gestating for ten months, refining for nine years—then, serene, I would mount the flying chariot, cross the Weak Waters, stride the sacred turtle, and stand in the presence of the immortals, hearing the Great Dao of the Reclusive One and rescuing the drowning. This is my aspiration: to emulate Zixian.\n\nWritten on the third day of the third lunar month in the *ding-chou* year of the Zhiyuan era by the disciple Dai Shun, bowing in reverence, at the Great Life Grotto-Heaven of Zhuhu.\n\n---\n\n**Alchemical Symbols of the Golden Elixir**\nThe Nameless One, in his *Wuzhen Pian* commentary, compiled the alchemical symbols of the Golden Elixir, employing myriad analogies—truly comprehensive. Qizong expanded this collection, gathering from the *Cantong Qi*, various immortal scriptures, treatises, poems, and lyrics. All metaphors drawn from celestial patterns, *Yijing* symbols, human affairs, principles, and objects—comparisons to the yin-yang alchemical symbols—are categorized into seven types and appended to the *Wuzhen Pian* commentary. Thus may students of immortality easily investigate them, discerning the distinctions and similarities between internal and external, their mutual symbolic resonance.\n\nThe sequence of the Five Phases’ transformations defies fixed nomenclature. Clarifying their fundamental unity, distinguishing the names of their metaphorical variations, the enlightened masters’ teachings may all be unified. Through this, one may forget the true fishing line and, by this means, achieve the immortal Dao—no small benefit indeed.\n\nPrefaced on the fifteenth day of the first lunar month in the *ding-chou* year of the Zhiyuan era by Dai Qizong.\n\n**Yang**\nHeaven\nSun\nTriple Alignment\nQian",
      "overlap_context": "odern seekers of immortality to dismiss the obscure (Nameless One) in favor of the well-known (Zixian), inverting their true significance. Yet the authenticity of their master’s transmission and the orthodoxy of the immortal Dao are the same for both, as both trace their lineage to [Zhang] Boduan.\n\nWherever the words of the Perfected One reside, numinous forces attend and protect them. How could one fail to treasure this text and preserve it, transmitting it only to those worthy of receiving it?",
      "start_char": 8358,
      "end_char": 9582,
      "start_sentence": 333,
      "end_sentence": 376,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.104377031326294,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真直指详说三乘秘要.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "离　　　　父　　　　夫　　　　君 主　　　　妇　　　　性　　　　气 神　　　　冠　　　　魂　　　　目 火　　　　南　　　　甲　　　　午 丙　　　　二　　　　七　　　　心 花　　　　玉　　　　龙　　　　蛇 雄　　　　牡　　　　虚　　　　气 上　　　　谷　　　　物　　　　器 矩　　　　要　　　　汞　　　　轻 浮　　　　精　　　　字　　　　戊 大　　　　动　　　　表　　　　兔 刚　　　　赤　　　　呼　　　　无 奇　　　　德　　　　礼　　　　喜",
      "translated_text": "Li\nFather\nHusband\nLord and Master\n\nWife\nNature\nQi\nSpirit\n\nCrown\nHun-soul\nEye\nFire\n\nSouth\nJia\nNoon\nBing\n\nTwo\nSeven\nHeart\nFlower\n\nJade\nDragon\nSerpent\nMale\n\nYang\nVoid\nQi\nAbove\n\nValley\nThing\nVessel\nSquare\n\nEssential\nMercury\nLight\nFloating\n\nEssence\nCharacter\nWu\nGreat\n\nMovement\nExterior\nHare\nFirm\n\nRed\nExhalation\nNonbeing\nMarvelous\n\nVirtue/Power\nRitual\nJoy",
      "overlap_context": " sequence of the Five Phases’ transformations defies fixed nomenclature. Clarifying their fundamental unity, distinguishing the names of their metaphorical variations, the enlightened masters’ teachings may all be unified. Through this, one may forget the true fishing line and, by this means, achieve the immortal Dao—no small benefit indeed.\n\nPrefaced on the fifteenth day of the first lunar month in the *ding-chou* year of the Zhiyuan era by Dai Qizong.\n\n**Yang**\nHeaven\nSun\nTriple Alignment\nQian",
      "start_char": 9582,
      "end_char": 9829,
      "start_sentence": 377,
      "end_sentence": 389,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.1845192909240723,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真直指详说三乘秘要.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "赏　　　　男　　　　书　　　　暑 天魂　　  乾象　　  日魂　　　张翼 房六　　　上玄　　　乾马　　　震龙 扶桑　　　昆仑　　  诧女　　　长男 木婿　　　戊土　　　二南　　　地二 朱砂　　　曾青　　　青龙　　　火龙 海龙　　　赤凤　　　乾炉　　　玉鼎 玉池　　　下德　　　恍惚　　　真砂 朱雀　　　丹阳　　　朱砂鼎　　生於甲乙 阴 地　　　　月　　　　商　　　　坤 坎　　　　母　　　　妇　　　　臣 宾　　　　夫　　　　情　　　　境",
      "translated_text": "Reward\nMale\nWriting\nSummer Heat\nCelestial Soul\n\nQian Image\nSolar Soul\nZhang and Yi\nHouse and Six\n\nUpper Mystery\nQian Horse\nThunder Dragon\nFusang\n\nKunlun\nMarvelous Maiden\nEldest Son\nWood Son-in-law\n\nWu Earth\nTwo Souths\nEarth Two\nCinnabar\n\nAzurite\nAzure Dragon\nFire Dragon\nSea Dragon\n\nRed Phoenix\nQian Crucible\nJade Tripod\nJade Pool\n\nLower Virtue/Power\nVague and Elusive\nTrue Sand\nVermilion Bird\n\nDanyang\nCinnabar Tripod\nBorn of Jia and Yi\nYin\nEarth\n\nMoon\nShang\nKun\nKan\n\nMother\nWife\nMinister\nGuest\n\nHusband\nEmotion\nRealm",
      "overlap_context": "Li\nFather\nHusband\nLord and Master\n\nWife\nNature\nQi\nSpirit\n\nCrown\nHun-soul\nEye\nFire\n\nSouth\nJia\nNoon\nBing\n\nTwo\nSeven\nHeart\nFlower\n\nJade\nDragon\nSerpent\nMale\n\nYang\nVoid\nQi\nAbove\n\nValley\nThing\nVessel\nSquare\n\nEssential\nMercury\nLight\nFloating\n\nEssence\nCharacter\nWu\nGreat\n\nMovement\nExterior\nHare\nFirm\n\nRed\nExhalation\nNonbeing\nMarvelous\n\nVirtue/Power\nRitual\nJoy",
      "start_char": 9829,
      "end_char": 10074,
      "start_sentence": 390,
      "end_sentence": 402,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.963025808334351,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真直指详说三乘秘要.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "命　　　　昏　　　　魄　　　　耳 水　　　　北　　　　庚　　　　子 壬　　　　一　　　　六　　　　肾 酒　　　　金　　　　虎　　　　龟 雌　　　　牝　　　　实　　　　液 下　　　　轴　　　　药　　　　鼎 规　　　　流　　　　铅　　　　重 沉　　　　光　　　　鸣　　　　巳 小　　　　静　　　　裹　　　　乌 柔　　　　黑　　　　吸　　　　有 耦　　　　刑　　　　智　　　　怒 罚　　　　女　　　　夜　　　　寒 地魄　　　坤象　　　月魄　　　虚危 晁七　　　下弦　　　坤牛　　　坎虎 华岳　　　曲江　　　婴兄　　　少女 金妻　　　己土　　　一北　　　天一 黑铅　　　山泽　　　白虎　　　水虎 岳虎　　　黑龟　　　坤鼎　　　金炉 西川　　　上德　　　杳冥　　　真汞 玄武　　　真阴　　　偃月炉　　生於庚辛 阳中阴 震　　　　离　　　　妻　　　　臣",
      "translated_text": "Destiny\nDusk\nPo/Soul\nEar\nWater\nNorth\nGeng\nZi\nRen\nOne\nSix\nKidney\nWine\nMetal\nTiger\nTortoise\nFemale\nYin\nSolid\nFluid\nLower\nPivot\nElixir\nTripod\nCompass\nFlow\nLead\nHeavy\nSubmerged\nLight\nChirping\nSi\nSmall\nStill\nEnveloped\nCrow\nGentle\nBlack\nInhalation\nExistence\nCoupling\nPunishment\nWisdom\nAnger\nChastisement\nWoman\nNight\nCold\n\nEarth Po\nKun Image\nMoon Po\nXu and Wei\nChao Seven\nLower Crescent\nKun Ox\nKan Tiger\nMount Hua\nQujiang\nInfant Brother\nYoungest Daughter\nMetal Wife\nJi Earth\nOne North\nCelestial One\nBlack Lead\nMountains and Marshes\nWhite Tiger\nWater Tiger\nMount Tiger\nBlack Tortoise\nKun Tripod\nMetal Crucible\nWestern River\nUpper Virtue/Power\nVague and Elusive\nTrue Mercury\nXuanwu\nTrue Yin\nCrescent Moon Crucible\nBorn of Geng and Xin\nYang within Yin\nZhen\nLi\nWife\nMinister",
      "overlap_context": "g\nSummer Heat\nCelestial Soul\n\nQian Image\nSolar Soul\nZhang and Yi\nHouse and Six\n\nUpper Mystery\nQian Horse\nThunder Dragon\nFusang\n\nKunlun\nMarvelous Maiden\nEldest Son\nWood Son-in-law\n\nWu Earth\nTwo Souths\nEarth Two\nCinnabar\n\nAzurite\nAzure Dragon\nFire Dragon\nSea Dragon\n\nRed Phoenix\nQian Crucible\nJade Tripod\nJade Pool\n\nLower Virtue/Power\nVague and Elusive\nTrue Sand\nVermilion Bird\n\nDanyang\nCinnabar Tripod\nBorn of Jia and Yi\nYin\nEarth\n\nMoon\nShang\nKun\nKan\n\nMother\nWife\nMinister\nGuest\n\nHusband\nEmotion\nRealm",
      "start_char": 10074,
      "end_char": 10489,
      "start_sentence": 403,
      "end_sentence": 424,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.468695640563965,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真直指详说三乘秘要.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "宾　　　　卯　　　　甲　　　　东 情　　　　仁　　　　左　　　　三 八　　　　浮　　　　肝　　　　木 女　　　　物　　　　父　　　　日魂 乌髓　　　姹女　　　人民　　　宾客 青娥　　　离女　　　真汞　　　木液 火汞　　　黄芽　　　玉液　　　神水 火龙　　　牝龙　　　金乌　　　真龙 真阴　　　雌母　　　雌阴　　　阴火 阳气　　　流珠　　　女青　　　雌火 红铅　　　朱砂　　　交梨　　　东二 玉芝　　　丹基　　　真火　　　午北 龙西　　　水银　　　天玄女　　日中乌 母之血　　龙弦气　　龙呼虎　　阴白火 火中水　　红入黑　　赤凤髓　　流汞父 红铅精　　砂裹汞　　离之己　　坤之中女 离中一阴　山头月白　太阳流珠　离己日光 青衣女子　碧眼胡儿　女混男形　砂中真汞 气中取水　雄裹藏雌　乌肝八两　砂中生汞 生於丙丁　气中生液　二八姹女　杳冥之精 恍惚中物　朱砂鼎内　水银　　　下弦水半斤 汞为砂中水 阴中阳 兑　　　　坎　　　　夫　　　　君 主　　　　酉　　　　庚　　　　西 性　　　　义　　　　右　　　　四 九　　　　沉　　　　肺　　　　金 男　　　　药　　　　母　　　　月魄 兔脂　　　金翁　　　父母　　　主人 老郎　　　坎男　　　真铅　　　金精 水金　　　白雪　　　金液　　　华池 水虎　　　雄虎　　　玉兔　　　真虎 真阳　　　雄父　　　雄阳　　　阳水 阴精　　　金华　　　男白　　　雄金 黑铅　　　水银　　　火枣　　　西四 刀圭　　　丹母　　　真水　　　子南 虎东　　　玉蕊　　　地黄男　　月中兔 父之精　　虎弦气　　虎吸龙　　黄芽铅 水中火　　黑入红　　黑龟精　　黄金母 黑铅髓　　水中银　　坎之戊　　乾之中男 坎中一阳　潭底日红　北方河车　坎戊月精 素练郎君　白头老子　男兼女体　铅中真银 水中取气　黑中有白　兔髓半斤　铅内产砂 生於壬癸　液中生气　九三郎君　恍惚之物 杳冥中精　偃月炉中　玉蕊　　　上弦金半斤 金为水中砂 中宫",
      "translated_text": "Guest\nMao\nJia\nEast\nEmotion\nBenevolence\nLeft\nThree\nEight\nFloating\nLiver\nWood\nWoman\nCreature\nFather\nSun-Soul\nCrow Marrow\nAlchemical Maiden\nPeople\nGuests\nAzure Maiden\nLi Maiden\nTrue Mercury\nWood Fluid\nFire Mercury\nYellow Sprout\nJade Fluid\nDivine Water\nFire Dragon\nFemale Dragon\nGolden Crow\nTrue Dragon\nTrue Yin\nFemale Matrix\nFemale Yin\nYin Fire\nYang Qi\nFlowing Pearl\nFemale Azure\nFemale Fire\nRed Lead\nCinnabar\nIntertwined Pear\nEast Two\nJade Fungus\nElixir Base\nTrue Fire\nNoon North\nDragon West\nQuicksilver\nCelestial Dark Maiden\nNoon Crow\nMother’s Blood\nDragon’s Bowstring Qi\nDragon’s Breath to Tiger\nYin White Fire\nFire within Water\nRed Entering Black\nVermilion Phoenix Marrow\nFlowing Mercury Father\nRed Lead Essence\nMercury within Cinnabar\nLi’s Ji\nKun’s Middle Daughter\nLi’s Single Yin\nMoon White on Mountain Peak\nGreat Yang Flowing Pearl\nLi Ji’s Sunlight\nGreen-Clad Maiden\nBlue-Eyed Hu Child\nFemale Mingling with Male Form\nTrue Mercury within Cinnabar\nDrawing Water from Qi\nMale Enveloping Female\nCrow Liver Eight Ounces\nMercury Born from Cinnabar\nBorn of Bing and Ding\nQi Generating Fluid\nTwo-Eight Alchemical Maiden\nEssence of the Vague and Elusive\nWithin the Cinnabar Tripod\nQuicksilver\nLower Crescent Water Half-Catty\nMercury as Water within Cinnabar\nYang within Yin\n\nDui\nKan\nHusband\nLord\nHost\nYou\nGeng\nWest\nNature\nRighteousness\nRight\nFour\nNine\nSubmerged\nLung\nMetal\nMan\nMedicine\nMother\nMoon-Soul\nHare Marrow\nGolden Elder\nParents\nHosts\nOld Gentleman\nKan Man\nTrue Lead\nMetal Essence\nWater Metal\nWhite Snow\nMetal Fluid\nFlowery Pond\nWater Tiger\nMale Tiger\nJade Hare\nTrue Tiger\nTrue Yang\nMale Father\nMale Yang\nYang Water\nYin Essence\nGolden Flower\nMale White\nMale Metal\nBlack Lead\nQuicksilver\nFire Jujube\nWest Four\nKnife-Tip\nElixir Mother\nTrue Water\nMidnight South\nTiger East\nJade Bud\nEarth-Yellow Man\nMoon Hare\nFather’s Essence\nTiger’s Bowstring Qi\nTiger’s Breath to Dragon\nYellow Sprout Lead\nWater within Fire\nBlack Entering Red\nBlack Tortoise Essence\nYellow Metal Mother\nBlack Lead Marrow\nSilver within Water\nKan’s Wu\nQian’s Middle Son\nKan’s Single Yang\nSun Red in Pool Depths\nNorthern River Chariot\nKan Wu’s Moon Essence\nWhite-Silk Gentleman\nWhite-Headed Elder\nMale with Female Body\nTrue Silver within Lead\nDrawing Qi from Water\nWhite within Black\nHare Marrow Half-Catty\nCinnabar Born from Lead\nBorn of Ren and Gui\nFluid Generating Qi\nNine-Three Gentleman\nEssence of the Vague and Elusive\nWithin the Crescent Moon Crucible\nJade Bud\nUpper Crescent Metal Half-Catty\nMetal as Cinnabar within Water\nCentral Palace",
      "overlap_context": "nishment\nWisdom\nAnger\nChastisement\nWoman\nNight\nCold\n\nEarth Po\nKun Image\nMoon Po\nXu and Wei\nChao Seven\nLower Crescent\nKun Ox\nKan Tiger\nMount Hua\nQujiang\nInfant Brother\nYoungest Daughter\nMetal Wife\nJi Earth\nOne North\nCelestial One\nBlack Lead\nMountains and Marshes\nWhite Tiger\nWater Tiger\nMount Tiger\nBlack Tortoise\nKun Tripod\nMetal Crucible\nWestern River\nUpper Virtue/Power\nVague and Elusive\nTrue Mercury\nXuanwu\nTrue Yin\nCrescent Moon Crucible\nBorn of Geng and Xin\nYang within Yin\nZhen\nLi\nWife\nMinister",
      "start_char": 10489,
      "end_char": 11401,
      "start_sentence": 425,
      "end_sentence": 471,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.091275453567505,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真直指详说三乘秘要.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "土　　　　中　　　　五　　　　十 信　　　　意　　　　脾　　　　祖 真土　　　土德　　　土釜　　　元神 神宝　　　玄关　　　玄门　　　真铅 金母　　　金妃　　　金胎　　　金鼎 铅鼎　　　汞鼎　　　昆仑　　　大冶 乾宫　　　坤位　　　华池　　　神胎 神庐　　　母舍　　　戊己　　　灵根 圣胎　　　灵户　　　太渊　　　规中 辰极　　　混沌　　　丹房　　　气府 关元　　　丹田　　　绛宫　　　黄庭 黄婆　　　黄道　　　元中　　　玄窍 药母　　　丹基　　　冰壶　　　函三 星官　　　母胎　　　北海　　　空玄 黄家　　　归根窍　　复命关　　偃月炉 悬胎鼎　　玄牝门　　戊己门　　造化炉 造化机　　交感穴　　太乙炉　　神气穴 守一坛　　中黄宫　　丹元府　　丹枢纽 黄金母　　希夷府　　众妙门　　太微宫 混沌门　　生杀舍　　黄帝土德　黄中通理 后土神鼎　先天地生　混沌金鼎　黑白相符 既济鼎器　法象天地　皇上地德　先天金胎 神水华池　类如鸡子　呼吸之根　玄牝之门 天地之根　凝结之所　皇石父母　造化全窟 外药 阳　　　　君　　　　金　　　　母",
      "translated_text": "Earth\nWithin\nFive\nTenfold Faith\nIntent\nSpleen\nAncestral\n\nTrue Earth\nEarth’s Virtue\nEarthen Cauldron\nOriginal Spirit\nSpirit Treasure\nMysterious Pass\nMysterious Gate\nTrue Lead\n\nMetal Mother\nMetal Consort\nMetal Womb\nMetal Tripod\nLead Tripod\nMercury Tripod\nKunlun\nGreat Foundry\n\nQian Palace\nKun Position\nFlowery Pool\nDivine Embryo\nSpirit Hut\nMother’s Abode\nWu-Ji\nNuminous Root\n\nSacred Embryo\nNuminous Portal\nGreat Abyss\nCompass Center\nChen’s Pole\nChaos\nElixir Chamber\nQi Repository\n\nPass Origin\nElixir Field\nCrimson Palace\nYellow Court\nYellow Matron\nYellow Path\nOriginal Center\nMysterious Aperture\n\nMedicine Mother\nElixir Foundation\nIce Flask\nTriple Enclosure\nStar Palace\nMother Womb\nNorthern Sea\nEmpty Mystery\n\nYellow House\nReturn-to-Root Aperture\nReturn-to-Mandate Pass\nReclining Moon Furnace\nSuspended Embryo Tripod\nMysterious Female Gate\nWu-Ji Gate\nCreation Furnace\n\nCreation Mechanism\nUnion Cavity\nTaiyi Furnace\nSpirit-Qi Cavity\nGuard-One Altar\nCentral Yellow Palace\nElixir Origin Repository\nElixir Pivot\n\nGolden Mother\nRealm of the Inaudible\nGate of Myriad Wonders\nGrand Tenuity Palace\nChaos Gate\nLife-and-Death Abode\nYellow Emperor’s Earth Virtue\nCentral Harmony\n\nEarth Goddess Tripod\nPreceding Heaven and Earth\nChaos Metal Tripod\nBlack and White in Accord\nAlready-Crossed Tripod Vessel\nPatterning Heaven and Earth\nAugust Earth’s Virtue\nPrimordial Metal Womb\n\nDivine Water Flowery Pool\nLike a Chicken’s Egg\nRoot of Breathing\nGate of the Mysterious Female\nRoot of Heaven and Earth\nPlace of Coagulation\nAugust Stone’s Parents\nComplete Cavern of Creation\n\nOuter Medicine\nYang\nLord\nMetal\nMother",
      "overlap_context": "an’s Wu\nQian’s Middle Son\nKan’s Single Yang\nSun Red in Pool Depths\nNorthern River Chariot\nKan Wu’s Moon Essence\nWhite-Silk Gentleman\nWhite-Headed Elder\nMale with Female Body\nTrue Silver within Lead\nDrawing Qi from Water\nWhite within Black\nHare Marrow Half-Catty\nCinnabar Born from Lead\nBorn of Ren and Gui\nFluid Generating Qi\nNine-Three Gentleman\nEssence of the Vague and Elusive\nWithin the Crescent Moon Crucible\nJade Bud\nUpper Crescent Metal Half-Catty\nMetal as Cinnabar within Water\nCentral Palace",
      "start_char": 11401,
      "end_char": 11918,
      "start_sentence": 472,
      "end_sentence": 497,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.758796691894531,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真直指详说三乘秘要.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "虎　　　　铁　　　　主　　　　铅 亲　　　　君德　　　金乌　　　真铅 阴火　　　金精　　　麻姑　　　阳丹 真土　　　真一　　　真水　　　神水 大丹　　　大药　　　金丹　　　七返 九还　　　秋石　　　金华　　　婴儿 真人　　　谷神　　　刀圭　　　大定 子珠　　　甘露　　　黄芽　　　玄珠 玄霜　　　黍珠　　　圣胎　　　玉蕊 金砂　　　黄誉　　　黄池　　　外丹 阳精　　　水虎　　　先天气　　真种子 真玄牝　　三五一　　摩泥珠　　中央土 真父母　　真阴阳　　天五贼　　紫金霜 玉壶冰　　绛雪丹　　真一精　　第一鼎 皇酥　　　长生药　　白马牙　　天地髓 坎离精　　真一水　　水中金　　水裹铅 真主人　　九转丹　　天生芽　　自然体 乾坤精　　天地气　　阴里阳精　先天地精 赫赫金精　天地灵根　阴阳圣母　乾坤鼎器 坎离药物　神符白雪　壶中日月　龙池大丹 宇寅之主　雪山醍醐　坎位中心实 圣父灵母之气 混元真一阳　天地阴阳长生真精 天地混沌之根 太乙含真气　坤位生成体 内药 阴　　　　臣　　　　木　　　　子",
      "translated_text": "Tiger\nIron\nMaster\nLead\nKin\nLord’s Virtue\nGolden Crow\nTrue Lead\n\nYin Fire\nMetal Essence\nMaiden Ma Gu\nYang Elixir\nTrue Earth\nTrue One\nTrue Water\nDivine Water\n\nGreat Elixir\nGreat Medicine\nGolden Elixir\nSeven-Return\nNine-Rebirth\nAutumn Stone\nGolden Flower\nInfant\n\nPerfected One\nValley Spirit\nKnife-Tip Measure\nGreat Stability\nSeed-Pearl\nSweet Dew\nYellow Sprout\nMysterious Pearl\n\nMysterious Frost\nMillet Pearl\nSacred Embryo\nJade Pistil\nGolden Sand\nYellow Repute\nYellow Pool\nOuter Elixir\n\nYang Essence\nWater Tiger\nPrimordial Qi\nTrue Seed\nTrue Mysterious Female\nThree-Five-One\nMud-Rubbing Pearl\nCentral Earth\n\nTrue Parents\nTrue Yin-Yang\nHeaven’s Five Thieves\nPurple Golden Frost\nJade Flask Ice\nCrimson Snow Elixir\nTrue One Essence\nFirst Tripod\n\nAugust Butter\nElixir of Immortality\nWhite Horse Tooth\nHeaven-Earth Marrow\nKan-Li Essence\nTrue One Water\nGold in Water\nLead in Water\n\nTrue Master\nNine-Cycle Elixir\nHeaven-Born Sprout\nNatural Body\nQian-Kun Essence\nHeaven-Earth Qi\nYin-Enveloped Yang Essence\nPrimordial Heaven-Earth Essence\n\nResplendent Metal Essence\nHeaven-Earth Spirit Root\nYin-Yang Sacred Mother\nQian-Kun Tripod Vessel\nKan-Li Medicinal Substances\nDivine Talisman White Snow\nFlask’s Sun and Moon\nDragon Pool Great Elixir\n\nMaster of Yu and Yin\nSnow Mountain Ghee\nKan Position’s Central Fruit\nSacred Father and Spirit Mother’s Qi\nPrimal True Yang\nHeaven-Earth Yin-Yang’s Longevity True Essence\nHeaven-Earth Chaos Root\nTaiyi’s Contained True Qi\n\nKun Position’s Generated Body\nInner Medicine\nYin\nMinister\nWood\nChild",
      "overlap_context": " Gate\nLife-and-Death Abode\nYellow Emperor’s Earth Virtue\nCentral Harmony\n\nEarth Goddess Tripod\nPreceding Heaven and Earth\nChaos Metal Tripod\nBlack and White in Accord\nAlready-Crossed Tripod Vessel\nPatterning Heaven and Earth\nAugust Earth’s Virtue\nPrimordial Metal Womb\n\nDivine Water Flowery Pool\nLike a Chicken’s Egg\nRoot of Breathing\nGate of the Mysterious Female\nRoot of Heaven and Earth\nPlace of Coagulation\nAugust Stone’s Parents\nComplete Cavern of Creation\n\nOuter Medicine\nYang\nLord\nMetal\nMother",
      "start_char": 11918,
      "end_char": 12421,
      "start_sentence": 498,
      "end_sentence": 524,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.951788425445557,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真直指详说三乘秘要.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "龙　　　　磁　　　　宾　　　　汞 疏　　　　家臣　　　兔儿　　　真汞 阳火　　　木液　　　张骞　　　阴汞 真火　　　雪胎　　　婴兄　　　内丹 阴丹　　　玄珠　　　火龙　　　后天气 己汞火　　天地子气　阳裹阴精　元阳之气 金液还丹　阴中阳火　离宫腹内　金液大还 东阳造化　炉灵胎中神室　灵胎中铅汞 紫阳真人悟真直指详说三乘秘要竟",
      "translated_text": "Dragon\nMagnet\nGuest\nMercury\nMinister of Dredging\nHousehold Minister\nMoon Hare\nTrue Mercury\n\nYang Fire\nWood Sap\nZhang Qian\nYin Mercury\n\nTrue Fire\nSnow Embryo\nInfant Brother\nInner Elixir\n\nYin Elixir\nMysterious Pearl\nFire Dragon\nPostnatal Qi\n\nFire of Self-Mercury\nHeaven-Earth’s Child Qi\nYang-Enveloped Yin Essence\nPrimordial Yang Qi\n\nGolden Sap Returned Elixir\nYin-Enveloped Yang Fire\nWithin Li Palace’s Abdomen\nGreat Return of Golden Sap\n\nEastern Yang Alchemy\nDivine Embryo in the Crucible\nSpirit Chamber in the Womb\nLead and Mercury in the Sacred Embryo\n\nPurple Yang Realized One’s *Awakening to Reality*\nDetailed Explication of the Three Vehicles’ Secret Essentials—Concluded",
      "overlap_context": "th Essence\n\nResplendent Metal Essence\nHeaven-Earth Spirit Root\nYin-Yang Sacred Mother\nQian-Kun Tripod Vessel\nKan-Li Medicinal Substances\nDivine Talisman White Snow\nFlask’s Sun and Moon\nDragon Pool Great Elixir\n\nMaster of Yu and Yin\nSnow Mountain Ghee\nKan Position’s Central Fruit\nSacred Father and Spirit Mother’s Qi\nPrimal True Yang\nHeaven-Earth Yin-Yang’s Longevity True Essence\nHeaven-Earth Chaos Root\nTaiyi’s Contained True Qi\n\nKun Position’s Generated Body\nInner Medicine\nYin\nMinister\nWood\nChild",
      "start_char": 12421,
      "end_char": 12603,
      "start_sentence": 525,
      "end_sentence": 533,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.258536100387573,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真直指详说三乘秘要.txt",
        "category": "玉诀类"
      }
    }
  ]
}