{
  "source_id": "罗天大醮晚朝科",
  "source_file": "chunked_daozang\\罗天大醮晚朝科.json",
  "total_chunks": 5,
  "total_original_chars": 2418,
  "total_translated_chars": 16490,
  "total_translation_time": 87.6577820777893,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\罗天大醮晚朝科.txt",
    "category": "威仪类"
  },
  "full_translation": "**Morning, Noon, and Evening Rites of the Grand Luotian Jiao**\n**Scripture Title:** *Morning, Noon, and Evening Rituals of the Grand Luotian Jiao* (One fascicle)\n**Source Text:** *Zhengtong Daoist Canon*, *Dongxuan* Section, *Weiyi* Category\n\n---\n\n### **Evening Rite of the Grand Luotian Jiao**\n\n**The Preceptor Recites the Invocation as Prescribed:**\n\nThe Five Stars gleam on high, auspicious *qi* drifts in the void.\nThe Primal Beginning gathers the spirits; Heaven and Earth unite in harmony.\nJade talismans and sacred seals summon the subtle and the hidden.\nFire is cast, might is displayed—no treachery or evil lingers.\nThe Ten Thousand Demons tremble and submit; malevolent blossoms wither away.\nMonsters are crushed, wickedness is vanquished—the Dao and *qi* flow as one.\nDivine radiance illumines the night; shadows and darkness are wholly withdrawn.\nThe Ten Thousand Spirits descend in attendance, riding the winds on spreading light.\nAll beings attain fulfillment; grace pervades the Divine Continent.\n\n**The Dharma Drum is Struck Twenty-Four Times**\n\nO Most Supreme Three Heavens, Mysterious Primal Beginning, Three *Qi* of the Grand Supreme Elder Lord:\nSummon forth from within this servant’s body the Three and Five Merit Officials, the Attendant Envoys of Left and Right, the Golden Lads Bearing Incense, the Jade Maidens Transmitting Words and Scattering Flowers, and the Thirty-Six Fragrant Officials of the Five Thearchs, the Direct Talismanic Envoys of the Day—let them all emerge.\nLet them emerge in solemn attire, adorned with robes, caps, and hanging tassels.\nReport to the Divine Perfected of the Altar’s Earthly Precincts and Local Deities.\nThis servant now ascends the altar in the evening rite to perform the Dao, paying homage to the Imperial Perfected. Humbly I submit this petition for the intent herein, its sincerity fully inscribed and sealed.\nMay the Supreme Perfected’s Dao-*qi* and the numinous radiance of the Numinous Treasure descend and flow into this servant’s body, that the sincerity of this petition swiftly reach the presence of the Utmost True and Boundless Great Dao, the Three Clarities’ Most Sacred, the August Jade Thearch of the Golden Gates of the Supreme Heaven.\n\n**Recitation of the Dharma Titles**\n\nThis unworthy one, [Name], together with the assembled altar officials, humbly and with one heart, reverently petitions:\nThe Vacuous and Spontaneous Primal Heavenly Worthy of the Origin,\nThe Boundless Great Dao, the Supreme Lord of the Dao,\nThe Grand Supreme Elder Lord,\nThe August Jade Thearch,\nThe Great Sage Hosts of the Ten Directions who have attained the Dao,\nThe Perfected Lords and Masters of the True,\nThe Thirty-Two Heavenly Thearchs,\nThe Jade Void Thearch,\nThe Great Thearch of the Jade Capital,\nThe Eastern Florescence and Southern Culmen,\nThe Western Numinous and Northern Perfected,\nThe Golden Gates of the Jade Metropolis of the Mysterious Capital, the Seven-Treasure Jeweled Terrace of the Purple Tenuity’s Upper Palace, the Numinous and Precious Utmost True Radiant August Dao Lord,\nThe Thirty-Six Revered Scriptures,\nThe Great Dharma Masters of the Mysterious Center,\nThe Supreme Ministers and Supreme Chancellors,\nThe Supreme Protectors and Supreme Tutors,\nThe Twenty-Four Perfected of the Great Peace’s Lower Teaching,\nThe Lord King of the Western City’s Assembly of Perfected,\nThe Perfected of the Great Unity,\nThe Lord of the Eastern Marchmount’s Upper Minister, the Controller of Destinies, the Two Perfected Lords Mao of the Registers of Life-Preservation,\nThe Divine Immortals who have attained the Dao in the Sacred Mountains and Grotto-Heavens,\nThe Officials and Retainers of the Three Realms, and all Perfected Spirits—\nwe reverently beseech Your Vast Compassion to turn and illuminate us with Your gaze.\n\n**Prostrate Reflection:**\n\nI, this unworthy servant, by some fortune of past blessings, early renounced worldly ties.\nHaving been permitted to serve the Supreme Mystery, I have gained access to the Mysterious Precepts.\n\nThus, ever reflecting upon this fortune, I know my good fortune; ever striving to exert myself, I seek to proclaim my devotion. In all matters of supplication, none may be suppressed or obstructed. Since the purity of the fast is earnest and the words of intent sincere, I humbly extend my plea. May the Mysterious Compassion, in its vast turning, incline its true hearing to this entreaty.\n\n**Proclamation of Words:**\nAs set forth in the petition, the sincerity of my heart is manifest. Presumptuously troubling the Mysterious Compassion, I am all the more reverently awed.\n\nI have heard: the Two Caverns of Lü swing wide the jeweled gates of the Imperial Palace; the Nine-by-Nine Heavenly Gates of the Celestial Gatekeeper seal the jade halls of the Divine Capital. Unseen by sight, unheard by hearing; gazing, they grow ever higher, observing, they stretch ever farther. Beyond the bounds of names and words, their subtlety eludes inquiry; unbound by form or vessel, their fragrant radiance defies perception. In stillness, the Response descended into the Han world; the Mysterious Origin repeatedly manifested in the Shu capital. Secretly expounding the true scriptures, privately transmitting the wondrous purport. The Azure Palace and the Purple Mansion—how distant their opening of the ford! The Yellow Path and the Vermilion Steps—suddenly, the day is made bright. Exhausting the solemnity of the fast and turning toward them, a single sincerity of intent establishes trust. The spirits of swift transformation respond in an instant, as if bending and stretching in a single breath. Thereupon, the golden locks turn, the jade maidens bear the missives, and we approach the Imperial Honored One to reverently present our petition. Above, to dispel calamities and portents; below, to deliver living beings. Universally leading all to compliance, the unseen and hidden rely upon this. The officiant of the fast, so-and-so, prostrates in reflection: dwelling in the mortal realm, my aspiration lies in the steps of the Dao. Observing the precepts and maintaining the fast, I don the feathered robe to proclaim the scriptural teachings; repenting transgressions and acknowledging faults, I honor the Precious Teacher to establish the altar. In meditation, I ascend to the Black Dawn Court of Heaven; prostrating, I send forth my spirit to pay homage to the Emperor. At times, purple light enfolds the golden radiance of the moon, auspicious mists float and gather, the fragrance of cinnabar flames is concealed, star-jade talismans shimmer, and the hues of propitious clouds appear. The myriad sounds fall silent in the cavernous valleys; flocks of birds fold their wings in the mountain forests. Bells and chimes resound in unison, their echoes flowing with the songs of the void; Kan and Li silently circulate, illuminating the inner landscape with their brilliance. The Three Realms assemble in attendance; the Five Wheels traverse together. On this tranquil night of ritual practice, the assembly of petitioners and the dharma multitude now perform the first incense offering. May the smoke of this incense ascend directly to the realm of the Three Clarities.\n\nWe, your servants, surrender body, spirit, and life, prostrating ourselves to the earth. Reverently relying upon the Three Honored Ones of the Most High, by the merit of this incense offering, we pray for the present emperor. May his sagely culture shine like the stars, his divine martial prowess soar like the dragon. May he illuminate the four quarters with wisdom, widely bestow the virtue of the imperial sovereign, and observe the movements of all beings with fitting accord—the very heart of Heaven and Earth. May carriages share the same tracks and writings the same script, the three frontiers be pacified; may music attain perfect goodness and martial prowess perfect beauty, the four seas know peace. As the wind moves and the grass bends, may transformation be universally accomplished; as fish leap and kites soar, may all people find their own fulfillment.\n\nNow, therefore, we burn incense and personally take refuge in the virtue of the Dao, the Venerable, the Great Sage Host, and the Perfected. Having attained the Dao, may they long preserve Heaven’s endurance.\n\nOn this tranquil night as we perform the Dao rites, we invite the dharma assembly to offer this second pinch of incense. May its fragrant smoke ascend directly to the realm of the Three Purities. We take refuge in body, spirit, and life, prostrating ourselves fully. Reverently relying upon the Three Honored Ones of the Most High, by the merit of this incense offering, we dedicate its power to the ancestral spirits of three generations, the kin, and the wandering souls of the officiant so-and-so. We pray that their transgressions vanish like the sea of desire, their sins dissolve like the river of attachment. May the three karmic retributions be eradicated, the eight impurities leave no trace upon the mind-ground; may the six senses be purified, the five spirits all attain their celestial nature. May they refine their forms in the courtyard of flowing fire, nurture their virtue in the palace of youthful origin. Riding clouds and guiding qi, may they wander and feast in the immortal capital, moving from yin to yang, roaming freely in the sagely age.\n\nNow, therefore, we burn incense and personally take refuge in the virtue of the Sutra, the Venerable, the Great Sage Host, and the Perfected. Having attained the Dao, may they ascend into formlessness.\n\nOn this tranquil night as we perform the Dao rites, we invite the dharma assembly to offer this third pinch of incense. May its fragrant smoke ascend directly to the realm of the Three Purities. We take refuge in body, spirit, and life, prostrating ourselves fully. Reverently relying upon the Three Honored Ones of the Most High, by the merit of this incense offering, we humbly pray for the officiant so-and-so, who with sincere intent establishes this grand rite of cosmic expanse to repent transgressions, dispel calamities, beseech blessings, and invoke fortune. We pray that golden script record their goodness, jade tablets inscribe their names. May the Emperor grant them longevity, their years ever increasing as their virtue ever excels; may the spirits bestow their blessings, the aged find peace and the young be cherished. Wherever they dwell or abide, may the spirits extend their protection; whether they rest or journey, may Heaven grant its accord. May joy fill their halls, felicity spread through their neighborhoods. May their households enjoy tranquility, their studies and conduct befit rank and emolument; may all people embrace trust and righteousness, their virtuous conduct worthy of hereditary office. May all affairs prosper, all misfortunes forever cease.\n\nNow, therefore, we burn incense and personally take refuge in the virtue of the Master, the Venerable, the Great Sage Host, and the Perfected. Having attained the Dao, may they unite with the Dao in truth.\n\n*Chanting the directions—Repentance.*\n\n**Invocation of the Demons—Triple Invocation, Triple Bow, Repeated Recitation of Dharma Titles**\n\nWe, [Rank and Name], together with the officiating officials and all assembled, humbly and with one heart, reverently address the following supplication:\n\nTo the Most Exalted Three Purities, the Ten Directions’ Supreme Sages, the Heavenly Emperors and Perfected of the Jade Capital and Golden Towers, the Master-Sages of the Ten Directions, the divine hosts of the Three Realms, and all mighty numina:\n\nWe have heard that through non-action, one grasps the essential purport of Heaven and humanity; in stillness, observing the return, one perceives the purity and wholeness of the Dao and virtue. Vast and boundless, its radiance is too distant to name; subtle and wondrously penetrating, it is too profound to fathom. Beyond form and vessel, it is flawless in all things; in its beginning and end, it abides with the Dao.\n\nYet we, holding fast to the heart, lack wisdom; our resolve is not steadfast. We delve into the indistinct and fail to discern its origin; we peer into the subtle and stray from its measure. Though we aspire to embrace the yellow and return to the purple, how can we commune with the real and attain the numinous? In vain do we bear our titles, presuming to enact the teachings.\n\nNow, the ritual master [Name] has bathed his body and washed his hair, prepared the offerings, and arrayed the rites. Desiring to approach the celestial steps, we cultivate the models of the Dao. With the cloud-script of the Five Directions, we gather demons and bind fiends; within the three-tiered sacred precinct, we reverently gaze toward Heaven and behold the Sages. Phoenix candles flicker crimson, their hues resplendent; dragon incense scatters its fragrance, its light flowing. The eight gates stand lofty and open; the nine keys are grandly proclaimed.\n\nWe humbly beseech the Jade Capital’s imperial towers, the Jasper Gardens’ immortal realms, the Most Sacred Primal Honored Ones, and the ranked officials of all offices—nine-hued chariots gleaming in flight through the void, five luminances floating upon the altar of radiance. As the divine stirs, Heaven follows; the great handle of the wellspring of life is raised. As ashes fly and smoke vanishes, the dense records of transgressions are swept away. All blessings derive from this; none remain unliberated.\n\nFirst, we pray that the imperial domain flourish and expand, the sovereign’s enterprise vast and glorious. Let those who scale mountains and sail seas present tribute without fail; let outer barbarians and border tribes offer allegiance without rebellion.\n\nNext, we pray for the ritual master: may Heaven’s harmony bestow blessings, the Dao’s fortune accumulate protection, and ancestors and forebears find peace. May the refined odes of the poets be fulfilled, the spirits assent and respond; may the humble light of the noble be enhanced, their grand legacy enduring and flourishing. May prosperity and splendor abound, their illustrious renown resounding. May their gates preserve loyalty and filial piety, their generations succeed in office, and all adversity be forever averted. May they abundantly receive the harvest tally; may the departed attain liberation, the recently deceased transcend to new life. Those bound to the Three Paths, still mired in the Five Sufferings—may they ride the merit of this fast to liberation, not drowning in karmic retribution; may they, in accord with the talismanic command, be transformed and reborn, attaining blessed fruition. May all in the unseen realms yet unliberated, together with the guardians who have labored in defense, by the grace of this luminous favor, ascend in rank and grade.\n\nThus, the great compassion of the Heavenly Worthy above is made manifest, and our sincerity in taking refuge below is duly answered.\n\nWe reverently submit this petition for your hearing.\n\n**Vows**\nOne: May the numinous light descend and illuminate.\nTwo: May the moon of the Dao cast its radiance.\nThree: May grace extend through the Nine Lands.\nFour: May sincerity reach the majesty of Heaven.\nFive: May all true spirits assemble.\nSix: May the qi of the Dao pervade all.\nSeven: May the Heavenly Palaces open wide.\nEight: May the hells be shattered and destroyed.\nNine: May the mysterious power universally extend.\nTen: May the chariot of radiance soar through the void.\nEleven: May all under Heaven embrace virtue.\nTwelve: May the transformation of the Dao be effortless.\n\n**Replenishing the Incense Burner**\n*Visualizing the spirits, burning incense.*\n\nThe Incense Officials and Envoys, the Lords of the Left and Right Dragon-Tiger, and all the attendant spirit-officials of the incense—may they now cause the place where I have just ascended the altar to perform the evening audience and conduct the Dao to naturally generate golden nectar, cinnabar-green mushroom blossoms, and the assembly of the hundred numinous perfected. May all gather here before the incense burner. May it be wished that the jade maidens and immortal youths of the ten directions attend the orchid banquet, convey the sincerity of my recent petition, and swiftly transmit it directly to the presence of the Utmost True and Boundless Great Dao, the Three Clarities’ August Sages, and the August Jade Emperor of the Golden Portal, Supreme Lord of the Vast Heaven. The evening audience of the Grand Offering to the Heavenly Net is now concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "罗天大醮早午晚三朝科 经名：罗天大醮早午晚三期科。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 罗天大醮晚朝科 各礼师存念如法 五星高耀，瑞气虚浮。 元始集神，天地交周。 玉符宝节，啸命微幽。 掷火扬威，奸凶无留。 万魔振伏，纷葩却消。 摧怪伐恶，道炁同流。 神光照夜，阴翳俱收。 万神降格，扇景乘飙。 群生咸遂，惠遍神州。 鸣法鼓二十四通 无上三天玄元始三炁太上老君，召出臣身中三五功曹左右官使者、左右捧香金童、传言散花玉女、五帝直符直日香官使者各三十六人出。 出者，严装显服，冠带垂缨。 关启玄坛土地方域神真。 臣今晚朝升坛行道，朝谒帝真，谨奏为入意，其诸诚意，具载缄誊。 愿得太上至真道炁，灵宝瑞光，下降流入臣等身中，令臣所启之诚，速达径御至真无极大道、三清上圣、昊天至尊金阙玉皇上帝御前 请称法位 具位某与临坛官众等，谨同诚上启：虚无自然元始天尊、无极大道太上道君、太上老君、高上玉皇、十方已得道大圣众，至真诸君丈人、三十二天帝君、玉虚上帝、玉帝大帝、东华南极、西灵北真、玄都玉京金阙七宝琼台紫微上宫灵必宝至真明皇道君、三十六部尊经、玄中大法师、上相上宰、上保上傅、太平下教二十四真人、西城总真王君、太乙真人、东岳上卿司命茅君定录保命二真人、名山洞府得道神仙、三界官属一切真灵，恭望洪慈，洞回照鉴。 伏念臣谬因夙庆，早谢尘缘。 得奉上玄，获参玄律。",
      "translated_text": "**Morning, Noon, and Evening Rites of the Grand Luotian Jiao**\n**Scripture Title:** *Morning, Noon, and Evening Rituals of the Grand Luotian Jiao* (One fascicle)\n**Source Text:** *Zhengtong Daoist Canon*, *Dongxuan* Section, *Weiyi* Category\n\n---\n\n### **Evening Rite of the Grand Luotian Jiao**\n\n**The Preceptor Recites the Invocation as Prescribed:**\n\nThe Five Stars gleam on high, auspicious *qi* drifts in the void.\nThe Primal Beginning gathers the spirits; Heaven and Earth unite in harmony.\nJade talismans and sacred seals summon the subtle and the hidden.\nFire is cast, might is displayed—no treachery or evil lingers.\nThe Ten Thousand Demons tremble and submit; malevolent blossoms wither away.\nMonsters are crushed, wickedness is vanquished—the Dao and *qi* flow as one.\nDivine radiance illumines the night; shadows and darkness are wholly withdrawn.\nThe Ten Thousand Spirits descend in attendance, riding the winds on spreading light.\nAll beings attain fulfillment; grace pervades the Divine Continent.\n\n**The Dharma Drum is Struck Twenty-Four Times**\n\nO Most Supreme Three Heavens, Mysterious Primal Beginning, Three *Qi* of the Grand Supreme Elder Lord:\nSummon forth from within this servant’s body the Three and Five Merit Officials, the Attendant Envoys of Left and Right, the Golden Lads Bearing Incense, the Jade Maidens Transmitting Words and Scattering Flowers, and the Thirty-Six Fragrant Officials of the Five Thearchs, the Direct Talismanic Envoys of the Day—let them all emerge.\nLet them emerge in solemn attire, adorned with robes, caps, and hanging tassels.\nReport to the Divine Perfected of the Altar’s Earthly Precincts and Local Deities.\nThis servant now ascends the altar in the evening rite to perform the Dao, paying homage to the Imperial Perfected. Humbly I submit this petition for the intent herein, its sincerity fully inscribed and sealed.\nMay the Supreme Perfected’s Dao-*qi* and the numinous radiance of the Numinous Treasure descend and flow into this servant’s body, that the sincerity of this petition swiftly reach the presence of the Utmost True and Boundless Great Dao, the Three Clarities’ Most Sacred, the August Jade Thearch of the Golden Gates of the Supreme Heaven.\n\n**Recitation of the Dharma Titles**\n\nThis unworthy one, [Name], together with the assembled altar officials, humbly and with one heart, reverently petitions:\nThe Vacuous and Spontaneous Primal Heavenly Worthy of the Origin,\nThe Boundless Great Dao, the Supreme Lord of the Dao,\nThe Grand Supreme Elder Lord,\nThe August Jade Thearch,\nThe Great Sage Hosts of the Ten Directions who have attained the Dao,\nThe Perfected Lords and Masters of the True,\nThe Thirty-Two Heavenly Thearchs,\nThe Jade Void Thearch,\nThe Great Thearch of the Jade Capital,\nThe Eastern Florescence and Southern Culmen,\nThe Western Numinous and Northern Perfected,\nThe Golden Gates of the Jade Metropolis of the Mysterious Capital, the Seven-Treasure Jeweled Terrace of the Purple Tenuity’s Upper Palace, the Numinous and Precious Utmost True Radiant August Dao Lord,\nThe Thirty-Six Revered Scriptures,\nThe Great Dharma Masters of the Mysterious Center,\nThe Supreme Ministers and Supreme Chancellors,\nThe Supreme Protectors and Supreme Tutors,\nThe Twenty-Four Perfected of the Great Peace’s Lower Teaching,\nThe Lord King of the Western City’s Assembly of Perfected,\nThe Perfected of the Great Unity,\nThe Lord of the Eastern Marchmount’s Upper Minister, the Controller of Destinies, the Two Perfected Lords Mao of the Registers of Life-Preservation,\nThe Divine Immortals who have attained the Dao in the Sacred Mountains and Grotto-Heavens,\nThe Officials and Retainers of the Three Realms, and all Perfected Spirits—\nwe reverently beseech Your Vast Compassion to turn and illuminate us with Your gaze.\n\n**Prostrate Reflection:**\n\nI, this unworthy servant, by some fortune of past blessings, early renounced worldly ties.\nHaving been permitted to serve the Supreme Mystery, I have gained access to the Mysterious Precepts.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 579,
      "start_sentence": 0,
      "end_sentence": 24,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.054269075393677,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\罗天大醮晚朝科.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "故每省循而知幸，尝思勉励以宣勤。 凡有告祈，不容抑塞。 斋诚既切，词意庸伸。 仰冀玄慈，洞回真听。 宣词 具如词言，灼见诚心，冒渎玄慈，益深祗畏。 臣闻：洞户吕二，敞琼门於帝阙； 天阍九九，閟玉宇於宸京。 视不见，而听不闻； 瞻弥高，而察弥远。 超出名言之外，莫究微芒； 不拘形器之间，难窥香蔼。 静应下生於汉世，玄元屡降於蜀都。 秘演真经，密传妙旨。 青宫伊紫府，邈矣开津，黄道彤墀，豁然通昼。 罄斋庄而皈向，一诚意以交孚。 感倏忽变化之神，若俯仰屈伸之速。 於是金关启钥，玉女飞函，亲谒帝尊，敬陈词表。 上以消於灾变； 下以度於生灵。 普率咸遵，幽冥是赖。 斋官某伏念身居寰壤，志在道阶，奉戒持斋，命羽衣而宣经教； 谢愆引咎，尊师宝而开设坛场。 存思而升黑朝天，俯伏而飞神谒帝。 时感紫光，笼月金华，浮瑞霭之，馨丹焰藏，星玉篆绚，祥云之彩。 万籁消声於洞壑，群飞敛翼於山林。 钟磬齐敲，与空歌而流响； 坎离默运，周内景以发辉。 三界齐临，五轮偕度。 以今静夜行道，请法众等，运兹初捻上香。 愿此香烟腾空，径上三清之境。 臣等皈身，皈神皈命，首体投地。 仰依太上三尊，以是捻香功德，上祝当今皇帝，伏愿睿文星焕，神武龙骧，明烛四方。 诞布帝王之德，坐观群动适当，天地之心。 车同轨而书同文，三边宁静； 韶尽善而武尽美，四海和平。 风行草靡，而化无不成； 鱼跃鸢飞，而人皆自得。",
      "translated_text": "Thus, ever reflecting upon this fortune, I know my good fortune; ever striving to exert myself, I seek to proclaim my devotion. In all matters of supplication, none may be suppressed or obstructed. Since the purity of the fast is earnest and the words of intent sincere, I humbly extend my plea. May the Mysterious Compassion, in its vast turning, incline its true hearing to this entreaty.\n\n**Proclamation of Words:**\nAs set forth in the petition, the sincerity of my heart is manifest. Presumptuously troubling the Mysterious Compassion, I am all the more reverently awed.\n\nI have heard: the Two Caverns of Lü swing wide the jeweled gates of the Imperial Palace; the Nine-by-Nine Heavenly Gates of the Celestial Gatekeeper seal the jade halls of the Divine Capital. Unseen by sight, unheard by hearing; gazing, they grow ever higher, observing, they stretch ever farther. Beyond the bounds of names and words, their subtlety eludes inquiry; unbound by form or vessel, their fragrant radiance defies perception. In stillness, the Response descended into the Han world; the Mysterious Origin repeatedly manifested in the Shu capital. Secretly expounding the true scriptures, privately transmitting the wondrous purport. The Azure Palace and the Purple Mansion—how distant their opening of the ford! The Yellow Path and the Vermilion Steps—suddenly, the day is made bright. Exhausting the solemnity of the fast and turning toward them, a single sincerity of intent establishes trust. The spirits of swift transformation respond in an instant, as if bending and stretching in a single breath. Thereupon, the golden locks turn, the jade maidens bear the missives, and we approach the Imperial Honored One to reverently present our petition. Above, to dispel calamities and portents; below, to deliver living beings. Universally leading all to compliance, the unseen and hidden rely upon this. The officiant of the fast, so-and-so, prostrates in reflection: dwelling in the mortal realm, my aspiration lies in the steps of the Dao. Observing the precepts and maintaining the fast, I don the feathered robe to proclaim the scriptural teachings; repenting transgressions and acknowledging faults, I honor the Precious Teacher to establish the altar. In meditation, I ascend to the Black Dawn Court of Heaven; prostrating, I send forth my spirit to pay homage to the Emperor. At times, purple light enfolds the golden radiance of the moon, auspicious mists float and gather, the fragrance of cinnabar flames is concealed, star-jade talismans shimmer, and the hues of propitious clouds appear. The myriad sounds fall silent in the cavernous valleys; flocks of birds fold their wings in the mountain forests. Bells and chimes resound in unison, their echoes flowing with the songs of the void; Kan and Li silently circulate, illuminating the inner landscape with their brilliance. The Three Realms assemble in attendance; the Five Wheels traverse together. On this tranquil night of ritual practice, the assembly of petitioners and the dharma multitude now perform the first incense offering. May the smoke of this incense ascend directly to the realm of the Three Clarities.\n\nWe, your servants, surrender body, spirit, and life, prostrating ourselves to the earth. Reverently relying upon the Three Honored Ones of the Most High, by the merit of this incense offering, we pray for the present emperor. May his sagely culture shine like the stars, his divine martial prowess soar like the dragon. May he illuminate the four quarters with wisdom, widely bestow the virtue of the imperial sovereign, and observe the movements of all beings with fitting accord—the very heart of Heaven and Earth. May carriages share the same tracks and writings the same script, the three frontiers be pacified; may music attain perfect goodness and martial prowess perfect beauty, the four seas know peace. As the wind moves and the grass bends, may transformation be universally accomplished; as fish leap and kites soar, may all people find their own fulfillment.",
      "overlap_context": "isters of Life-Preservation,\nThe Divine Immortals who have attained the Dao in the Sacred Mountains and Grotto-Heavens,\nThe Officials and Retainers of the Three Realms, and all Perfected Spirits—\nwe reverently beseech Your Vast Compassion to turn and illuminate us with Your gaze.\n\n**Prostrate Reflection:**\n\nI, this unworthy servant, by some fortune of past blessings, early renounced worldly ties.\nHaving been permitted to serve the Supreme Mystery, I have gained access to the Mysterious Precepts.",
      "start_char": 579,
      "end_char": 1146,
      "start_sentence": 25,
      "end_sentence": 62,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.13760733604431,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\罗天大醮晚朝科.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "今故烧香自皈依道尊大圣众至真之德。 得道之后，保天长存。 以今静夜行道，请法众等，运兹二捻上香。 愿此香烟腾空，径上三清之境。 臣等皈身，皈神皈命，首体投地。 仰依太上三尊，以是捻香功德，归流斋官某三代宗亲，眷属魂识。 伏愿愆消欲海，罪灭爱河。 三报豁除，八垢不留於心地； 六根洒落，五神皆得於性天。 炼形於流火之庭，育德於童初之府。 乘云驭气，游宴仙都，出阴入阳，逍遥圣世。 今故烧香，自皈依经尊大圣众至真之德。 得道之后，升入无形。 以今静夜行道，请法众等，运兹三捻上香。 愿此香烟腾空，径上三清之境。 臣等皈身，皈神皈命，首体投地。 仰依太上三尊，以是捻香功德，伏为斋官某诚存一念，醮设罗天，谢过消灾，祈恩请福。 伏愿金书纪善，玉简刊名。 帝与其龄，年弥高而德弥劭； 神介之福，老者安而少者怀。 爰居爰处，而神相其庥； 或止或行，而天授之契。 欢洽门庭之内，庆传闾里之间。 家用平康，习学宜修於爵禄； 人怀信义，循行可袭於簪缨。 万事成亨，千灾永殄。 今故烧香，自皈依师尊大圣众至真之德。 得道之后，与道合真。 唱方 忏悔",
      "translated_text": "Now, therefore, we burn incense and personally take refuge in the virtue of the Dao, the Venerable, the Great Sage Host, and the Perfected. Having attained the Dao, may they long preserve Heaven’s endurance.\n\nOn this tranquil night as we perform the Dao rites, we invite the dharma assembly to offer this second pinch of incense. May its fragrant smoke ascend directly to the realm of the Three Purities. We take refuge in body, spirit, and life, prostrating ourselves fully. Reverently relying upon the Three Honored Ones of the Most High, by the merit of this incense offering, we dedicate its power to the ancestral spirits of three generations, the kin, and the wandering souls of the officiant so-and-so. We pray that their transgressions vanish like the sea of desire, their sins dissolve like the river of attachment. May the three karmic retributions be eradicated, the eight impurities leave no trace upon the mind-ground; may the six senses be purified, the five spirits all attain their celestial nature. May they refine their forms in the courtyard of flowing fire, nurture their virtue in the palace of youthful origin. Riding clouds and guiding qi, may they wander and feast in the immortal capital, moving from yin to yang, roaming freely in the sagely age.\n\nNow, therefore, we burn incense and personally take refuge in the virtue of the Sutra, the Venerable, the Great Sage Host, and the Perfected. Having attained the Dao, may they ascend into formlessness.\n\nOn this tranquil night as we perform the Dao rites, we invite the dharma assembly to offer this third pinch of incense. May its fragrant smoke ascend directly to the realm of the Three Purities. We take refuge in body, spirit, and life, prostrating ourselves fully. Reverently relying upon the Three Honored Ones of the Most High, by the merit of this incense offering, we humbly pray for the officiant so-and-so, who with sincere intent establishes this grand rite of cosmic expanse to repent transgressions, dispel calamities, beseech blessings, and invoke fortune. We pray that golden script record their goodness, jade tablets inscribe their names. May the Emperor grant them longevity, their years ever increasing as their virtue ever excels; may the spirits bestow their blessings, the aged find peace and the young be cherished. Wherever they dwell or abide, may the spirits extend their protection; whether they rest or journey, may Heaven grant its accord. May joy fill their halls, felicity spread through their neighborhoods. May their households enjoy tranquility, their studies and conduct befit rank and emolument; may all people embrace trust and righteousness, their virtuous conduct worthy of hereditary office. May all affairs prosper, all misfortunes forever cease.\n\nNow, therefore, we burn incense and personally take refuge in the virtue of the Master, the Venerable, the Great Sage Host, and the Perfected. Having attained the Dao, may they unite with the Dao in truth.\n\n*Chanting the directions—Repentance.*",
      "overlap_context": "idely bestow the virtue of the imperial sovereign, and observe the movements of all beings with fitting accord—the very heart of Heaven and Earth. May carriages share the same tracks and writings the same script, the three frontiers be pacified; may music attain perfect goodness and martial prowess perfect beauty, the four seas know peace. As the wind moves and the grass bends, may transformation be universally accomplished; as fish leap and kites soar, may all people find their own fulfillment.",
      "start_char": 1146,
      "end_char": 1600,
      "start_sentence": 63,
      "end_sentence": 92,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.502825736999512,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\罗天大醮晚朝科.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "命魔 三启颂 三礼 重称法位 具位某与临坛官众等，谨同诚上启：三清至尊、十方上圣、玉京金阙天帝天真、十方师尊圣众、三界官属，一切威灵。 臣闻：一以无为，得天人之旨要； 静而观复，见道德之纯全。 含洪光大而邈矣难名，微妙玄通而深不可识。 离乎形器，与物无疵，要其始终，与道相保。 臣等持心弗惠，立志非坚。 穷恍惚而莫见其端； 窥徼妙而或乖其度。 虽欲抱黄而回紫，岂能通真以达灵。 徒负职名，滥行科教。 斋官某浴身沐发，备礼陈仪。 欲款天阶，爰修道范。 五方云篆，用收魔而束妖； 三级灵场，敬瞻天而望圣。 凤烛摇红而绚彩，龙烟散景以流馨。 高敞八门，弘宣九钥。 伏惟瑶京帝阙、琼苑仙都、至圣元尊、群司列职，九色焕飞空之驾，五明浮步景之坛。 神动天随，揭生源之大柄； 灰飞烟灭，扫罪籍之繁文。 一庆所资，无所不度。 上愿皇图丕衍，帝业恢弘。 梯山航海而入贡无违，外狄边夷而朝宗不逆。 次冀斋官，天钧锡祉，道运储庥，祖考来宁。 叶诗人之雅咏，神只顺相； 利君子之谦光，绵绵丕绪。 以隆昌奕奕，徽声而振作。 门全忠孝，代继簪缨，永却迍危。 茂膺穰简，先亡受度，近逝超生。 或系三涂，尚沦五苦。 乘斋功而解脱，不溺报缘； 准符命以化生，克膺福果。 暨幽冥之未度，偕翊卫之有劳。 允赖恩光，俱超品秩。 则上明天尊大慈之泽，下副臣等皈命之诚。 谨启以闻。 发愿 一愿灵光下烛，二愿道月扬辉，三愿恩宣九地，四愿诚达天威，五愿真灵具会，六愿道炁周围，七愿天堂开敞，八愿地狱隳摧，九愿玄功普被，十愿驾景空飞，十一愿普天怀德，十二愿道化无为。 复炉 存神烧香",
      "translated_text": "**Invocation of the Demons—Triple Invocation, Triple Bow, Repeated Recitation of Dharma Titles**\n\nWe, [Rank and Name], together with the officiating officials and all assembled, humbly and with one heart, reverently address the following supplication:\n\nTo the Most Exalted Three Purities, the Ten Directions’ Supreme Sages, the Heavenly Emperors and Perfected of the Jade Capital and Golden Towers, the Master-Sages of the Ten Directions, the divine hosts of the Three Realms, and all mighty numina:\n\nWe have heard that through non-action, one grasps the essential purport of Heaven and humanity; in stillness, observing the return, one perceives the purity and wholeness of the Dao and virtue. Vast and boundless, its radiance is too distant to name; subtle and wondrously penetrating, it is too profound to fathom. Beyond form and vessel, it is flawless in all things; in its beginning and end, it abides with the Dao.\n\nYet we, holding fast to the heart, lack wisdom; our resolve is not steadfast. We delve into the indistinct and fail to discern its origin; we peer into the subtle and stray from its measure. Though we aspire to embrace the yellow and return to the purple, how can we commune with the real and attain the numinous? In vain do we bear our titles, presuming to enact the teachings.\n\nNow, the ritual master [Name] has bathed his body and washed his hair, prepared the offerings, and arrayed the rites. Desiring to approach the celestial steps, we cultivate the models of the Dao. With the cloud-script of the Five Directions, we gather demons and bind fiends; within the three-tiered sacred precinct, we reverently gaze toward Heaven and behold the Sages. Phoenix candles flicker crimson, their hues resplendent; dragon incense scatters its fragrance, its light flowing. The eight gates stand lofty and open; the nine keys are grandly proclaimed.\n\nWe humbly beseech the Jade Capital’s imperial towers, the Jasper Gardens’ immortal realms, the Most Sacred Primal Honored Ones, and the ranked officials of all offices—nine-hued chariots gleaming in flight through the void, five luminances floating upon the altar of radiance. As the divine stirs, Heaven follows; the great handle of the wellspring of life is raised. As ashes fly and smoke vanishes, the dense records of transgressions are swept away. All blessings derive from this; none remain unliberated.\n\nFirst, we pray that the imperial domain flourish and expand, the sovereign’s enterprise vast and glorious. Let those who scale mountains and sail seas present tribute without fail; let outer barbarians and border tribes offer allegiance without rebellion.\n\nNext, we pray for the ritual master: may Heaven’s harmony bestow blessings, the Dao’s fortune accumulate protection, and ancestors and forebears find peace. May the refined odes of the poets be fulfilled, the spirits assent and respond; may the humble light of the noble be enhanced, their grand legacy enduring and flourishing. May prosperity and splendor abound, their illustrious renown resounding. May their gates preserve loyalty and filial piety, their generations succeed in office, and all adversity be forever averted. May they abundantly receive the harvest tally; may the departed attain liberation, the recently deceased transcend to new life. Those bound to the Three Paths, still mired in the Five Sufferings—may they ride the merit of this fast to liberation, not drowning in karmic retribution; may they, in accord with the talismanic command, be transformed and reborn, attaining blessed fruition. May all in the unseen realms yet unliberated, together with the guardians who have labored in defense, by the grace of this luminous favor, ascend in rank and grade.\n\nThus, the great compassion of the Heavenly Worthy above is made manifest, and our sincerity in taking refuge below is duly answered.\n\nWe reverently submit this petition for your hearing.\n\n**Vows**\nOne: May the numinous light descend and illuminate.\nTwo: May the moon of the Dao cast its radiance.\nThree: May grace extend through the Nine Lands.\nFour: May sincerity reach the majesty of Heaven.\nFive: May all true spirits assemble.\nSix: May the qi of the Dao pervade all.\nSeven: May the Heavenly Palaces open wide.\nEight: May the hells be shattered and destroyed.\nNine: May the mysterious power universally extend.\nTen: May the chariot of radiance soar through the void.\nEleven: May all under Heaven embrace virtue.\nTwelve: May the transformation of the Dao be effortless.\n\n**Replenishing the Incense Burner**\n*Visualizing the spirits, burning incense.*",
      "overlap_context": "hoods. May their households enjoy tranquility, their studies and conduct befit rank and emolument; may all people embrace trust and righteousness, their virtuous conduct worthy of hereditary office. May all affairs prosper, all misfortunes forever cease.\n\nNow, therefore, we burn incense and personally take refuge in the virtue of the Master, the Venerable, the Great Sage Host, and the Perfected. Having attained the Dao, may they unite with the Dao in truth.\n\n*Chanting the directions—Repentance.*",
      "start_char": 1600,
      "end_char": 2255,
      "start_sentence": 93,
      "end_sentence": 135,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.98249125480652,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\罗天大醮晚朝科.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "香官使者、左右龙虎君、侍香诸灵官，当令臣向来晚朝升坛行道之所，自然生金液，丹碧芝英，百灵众真，交会在此，香火炉前。 当愿十方仙童玉女，接侍兰筵，传臣向来所奏之诚，速达径上至真无极大道、三清上圣、昊天至尊金阙玉皇上帝御前。 罗天大醮晚朝科竟",
      "translated_text": "The Incense Officials and Envoys, the Lords of the Left and Right Dragon-Tiger, and all the attendant spirit-officials of the incense—may they now cause the place where I have just ascended the altar to perform the evening audience and conduct the Dao to naturally generate golden nectar, cinnabar-green mushroom blossoms, and the assembly of the hundred numinous perfected. May all gather here before the incense burner. May it be wished that the jade maidens and immortal youths of the ten directions attend the orchid banquet, convey the sincerity of my recent petition, and swiftly transmit it directly to the presence of the Utmost True and Boundless Great Dao, the Three Clarities’ August Sages, and the August Jade Emperor of the Golden Portal, Supreme Lord of the Vast Heaven. The evening audience of the Grand Offering to the Heavenly Net is now concluded.",
      "overlap_context": "ay sincerity reach the majesty of Heaven.\nFive: May all true spirits assemble.\nSix: May the qi of the Dao pervade all.\nSeven: May the Heavenly Palaces open wide.\nEight: May the hells be shattered and destroyed.\nNine: May the mysterious power universally extend.\nTen: May the chariot of radiance soar through the void.\nEleven: May all under Heaven embrace virtue.\nTwelve: May the transformation of the Dao be effortless.\n\n**Replenishing the Incense Burner**\n*Visualizing the spirits, burning incense.*",
      "start_char": 2255,
      "end_char": 2378,
      "start_sentence": 136,
      "end_sentence": 138,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.980588674545288,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\罗天大醮晚朝科.txt",
        "category": "威仪类"
      }
    }
  ]
}