{
  "source_id": "罗天大醮设醮仪",
  "source_file": "chunked_daozang\\罗天大醮设醮仪.json",
  "total_chunks": 6,
  "total_original_chars": 3016,
  "total_translated_chars": 20653,
  "total_translation_time": 109.96624732017517,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\罗天大醮设醮仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**Ritual for Establishing the Grand Offering to the Heavens of the Luo**\n\n**Scripture Title:** *Ritual for Establishing the Grand Offering to the Heavens of the Luo*. One fascicle. Source text from the *Zhengtong Daoist Canon*, *Dongxuan* Section, *Weiyi* Category.\n\n**Ritual for Establishing the Grand Offering to the Heavens of the Luo**\n\nAll ritual masters shall maintain mindfulness in accordance with the proper method.\n\n**Proclamation of the Protective Incantation of the Numinous**\n\n**East**\nNinefold *qi* of the Azure Heavens, great deities of the radiant stars.\nShining upon the eastern lands, illuminating the nine gates.\nRevolving the candle of yang light, sweeping away defilement and baleful *qi*.\nThe Luminous Youth, styled as Mysterious Minister,\nGuards my hall, ascending to face the Imperial Lord.\nSubduing demons and binding specters, capturing malevolent hordes.\nUpholding the true Dao, the vermilion script of jade texts.\nThe talismanic commands of the Nine Heavens, dispatched by dragon couriers.\nMay all under heaven be pacified, and I attain transcendence as a flying immortal.\n\n**South**\nThreefold *qi* of the Cinnabar Heavens, resplendent with streaming light.\nThe fire star revolves its candle, penetrating the illumination of the great sun.\nAbove dwells the Crimson Essence, in harmony with the Celestial August.\nThe Luminous Youth, styled as Radiant Chamber,\nCommands the fire soldiers, guarding the Jade Hall.\nSevering evil and binding specters, shearing and intercepting demon kings.\nAs decreed by the Northern Emperor, wind and fire surge forth.\nInterlocking bells gleam, protecting the altar precincts.\nMay the upright *qi* flow freely—who dares act recklessly?\nI receive the supreme merit, seated in the revolving of the *kuigang*.\nThrough kalpas unending, I safeguard heaven without bound.\n\n**West**\nSevenfold *qi* of the White Heavens, essence streaming from Venus.\nLight illumines the Golden Gate, penetrating the vast darkness.\nWithin dwells the White August, styled as Imperial Numinous.\nPreserving the divine and pacifying the numinous, guarding my bodily form.\nCutting off the roots of evil, the jade Dao shines forth in rectitude.\nPalaces and halls stand in solemn order, the three luminaries aligned as one.\nIn harmony with the Dao of spontaneity, I ascend to the Purple Court.\nThe talismanic commands of the Numinous Treasure bestow universal grace upon all beings.\nThe primordial *qi* of the August Sovereign unites with my body.\nMerit extends to all—heaven and earth are at peace.\n\n**North**\nThe Dark Heavens of the north, where the Primordial One wanders.\nThe star of the dawn revolves its candle, illuminating the Grand Tenuity.\nThe Black Numinous Honored Deity, styled as Layered Might,\nDons a dark cap to soar through the heavens, clad in feathered robes of an immortal.\nGuarding the five gates, inspecting essences and capturing transgressors.\nWhoever dares to test me shall be shattered and crushed by the *huoluo*.\nAs proclaimed by the jade talismans, the eight divine mights of the perfected.\nThe gates of evil are sealed, the true Dao shines forth in radiance.\nThe three lights illumine me—my body knows no decay.\nI whip the void and ride the floating clouds, my form ascending in immortal flight.\n\n**Center**\nYellow *qi* of the central realm, regulating and harmonizing heaven and earth.\nForging and refining yin and yang, governing the mysterious and true.\nThe star of stability emits its radiance, streaming brilliance through the nine stars.\nThe Luminous Youth, styled as Celestial Splendor,\nYang *qi* flames upward, vermilion and blazing with essence.\nPenetrating illumination within and without, revolving my bodily form.\nA hundred evils are cast down, spirits and ghosts are captured and commanded.\nThe divine incantation of the Central Mountain is heard throughout heaven.\nThe five numina are pacified—my body ascends to the Upper Clarity.\n\n**Striking the Ritual Drum Twenty-Four Times**\n\nMost High Three Heavens, Mysterious Primordial, Threefold *Qi* of the Supreme Venerable Lord Lao, summon forth from within my body the thirty-six *Gongcao* officials of the left and right, the left and right golden lads bearing incense, the jade maidens transmitting words and scattering flowers, and the thirty-six *Xianguan* messengers of the Five Thearchs on duty for the day.\n\nLet them emerge, clad in solemn attire, robes adorned, caps and pendants hanging.\nReport to the deities of the sacred altar’s land and the numinous guardians of the directional domains.\n\nNow, as I establish this jiao-offering to express gratitude, I reverently submit this petition with utmost sincerity, all intentions faithfully inscribed and sealed.\n\nMay the supreme and perfected *Dao*-*qi* of the Most High, the auspicious radiance of the Numinous Treasure, descend and flow into our bodies, that the sincerity of my entreaty may swiftly ascend and directly reach the presence of the Utmost True and Boundless Dao, the Three Clarities’ August Sages, and the August Jade Thearch of the Golden Gates, Supreme Lord of the Heavenly Vault.\n\nInvoking the sacred ranks:\nYour humble servant, [Name], together with the assembled altar officials, with unified sincerity, reverently petitions:\nThe Primordial Heavenly Venerable of the Void and Spontaneous, the Boundless Dao’s Most High Lord of the Way, the Most High Lord Lao, the August Jade Thearch, the host of great perfected saints who have attained the Dao in the ten directions, the true lords and elders, the thirty-two Heavenly Thearchs, the Jade Clarity Thearch, the Great Thearch of the Jade Capital, the Eastern Florescence and Southern Culmen, the Western Numinous and Northern Perfected, the Lord of the Dao of the Luminous August Numinous Treasure in the Seven-Jeweled Jasper Terrace of the Purple Tenuity’s Upper Palace within the Jade Metropolis of the Mysterious Capital, the thirty-six divisions of revered scriptures, the Great Dharma Masters of the Mysterious Center, the Supreme Ministers and Prime Counsellors, the Supreme Protectors and Grand Tutors, the twenty-four Perfected of the Great Peace’s Lower Teaching, the Perfected King of the Western City’s Assembly, the Perfected of the Great One, the Supreme Minister of the Eastern Marchmount and the Two Perfected Lords of Life-Prolonging Registers, the divine immortals who have attained the Dao in the grotto-heavens and blessed mountains, and all the numinous officials and spirits of the Three Realms.\n\nI have heard: the Dao is not distant from humanity, manifesting in forms neither substantial nor void.\nHeaven covers all things, its mechanism neither pure nor turbid when beheld.\n\nShould but a single thought attain perfect clarity, the hosts of the ten directions shall assemble as one. Now the present officiant, so-and-so, has long cultivated pure devotion, offering from the depths of a sincere heart. For long he has purified the stellar altar, having already observed the rites of the Six Fasts; again he welcomes the cloud-borne tread, reverently performing the ritual of a single offering. Alas, millet and grain lack true fragrance—yet he reflects that the humble offerings of fern and cress may still be fit for sacrifice. Incense mingles with the morning mist, qi congeals around the rattling dragon-chariots; chimes echo in the dawn wind, their sounds blending with the distant strains of immortal music. In reverence, he acts as though the deities were present, moved to communion by his devotion.\n\nWe humbly pray that, borne on feathered flight through the clouds, the banners and standards of the Ten Perfections may shimmer in hidden splendor; emerging with the sun and entering with the moon, the standards of the Eight Treasures may wave in graceful majesty. May the Three Realms attend in their chariots, the myriad spirits take their seats. We, your servants, in awe and trembling, dare to invoke your august presence, and now respectfully present our petition for your descent.\n\nWe beseech: **Array the ranks, descend in sacred presence, be seated in tranquility, receive the tea offering.** May the phoenix-cakes and dragon-tea, presented in jade cups, humbly extend an invitation to your numinous abodes. May we, gazing upward, find your celestial countenance as near as a handbreadth, and may you perceive the earnestness of human intent. Above and below in communion, within and without in perfect resonance.\n\nWe, the officiant and your servants, in awe and trembling, bow our heads to the ground, prostrate ourselves, and reverently present the tea offering. **The ritual proceeds.**\n\nWe, your servants, have heard: Heaven speaks not, yet it visits calamity upon excess and bestows blessings upon the virtuous; the Dao/Way encompasses all, yet it ever abhors killing and cherishes life. Thunder embodies the awe of its tremors, rain and dew enact its nurturing transformation. Its net is vast and none escape, its virtue/power boundless and beyond naming. Fortune and misfortune do not arise by mere chance, but are summoned by human deeds. Should one know to turn toward goodness and distance oneself from transgression, one may transform misfortune into blessing.\n\nWe humbly reflect: the officiant, so-and-so, dwells amid the boundless love of the Two Modes, counted among the most numinous of the myriad beings, charged with the mandate to shepherd the people. Yet now we behold this grievous calamity—external afflictions of pestilence, warfare, drought, locusts, and floods—while within, even those who once dwelt in peace may find strife arising behind their own gates. Thus, the officials of this district and the virtuous gentlemen of this township make their proclamation to the august Perfected Ones of the Ten Poles. Now we set forth our words prostrate upon the earth, and establish this grand Offering of the Boundless Heavens. Our hearts hold purity and sincerity, our rites are arrayed with solemn reverence. Orchid candles glow in radiance, precious torches scatter the auspicious blossoms of the sixfold splendor; aloeswood and sandalwood mingle their fragrance, golden censers diffuse the five-colored omens of fortune. Spring fills the offering altar, clouds part to reveal the Yellow Path. As we prepare to present our gifts, we dare not follow mere routine.\n\nFearing that our humble offerings of water-plants may bring shame, we have not attained perfect purity; yet we gather the immortal herbs of ginseng and poria, substituting them for what would defile. Though our goods are meager, our sincerity overflows; though our hearts are pure, our forms may be spare. With this single devotion we presume to trespass, with a hundred bows we tremble in awe. The clear wine stands in the vessel—we reverently present the first offering.\n\nThe ritual proceeds.\n\nWe, your servants, have heard: that which can be spoken is not the eternal Dao/Way, that which can be named is not the eternal name. Its depths cannot be fathomed...\n\nThe mysteries of the profoundest principle—\nwhat is called spirit is spirit, what is called sage is sage,\nwe revere the radiant and luminous numen.\n\nWe contemplate this body as a bubble upon the water,\nlamenting how our light and shadow flicker like a candle in the wind.\nTransgressions cannot be evaded—we fear the Han Code’s unyielding strictures;\nyet blessings may be averted—we see the Han Records’ full accounts.\nGazing across the eight directions, we set the vast net of heaven’s rite,\npurifying the five officials with ice-like clarity, our sincerity fixed in a single thought.\nHaving removed the defiled offerings, we renew our devotion with gathered water-plants.\nWe give thanks for sins forgiven, for grace received—\nashamed that otters and jackals could not compare;\nwe strive to begin anew, to persevere—\nmoved that even the toil of dogs and horses is not in vain.\nSeeing what cannot be seen, hearing what cannot be heard,\nwe look up to the boundless expanse above;\ndrawing near to virtue, partaking of the Dao/Way,\nwe offer our earnest sincerity from the depths of our hearts.\nMay the faults recorded in the black registers be dissolved,\nand blessings from the Pure Capital be inscribed.\nMay future prosperity be secured,\nand impending disasters be averted before they arrive.\nWe, your servants, reverently present the second offering of wine.\n\nThe ritual proceeds.\n\nWe have heard: now present, now absent—\nwithout sound, without scent.\nThe workings of heaven above,\nvast and towering.\nThe essence of the supreme Dao/Way,\nelusive and indistinct.\nWe exhaust our sincerity,\nlooking up to knock upon the azure vault.\nBeholding this illusory, leaky frame,\nwe have sinned and have no ground for prayer;\nlooking up to the wondrous Dao/Way beyond names,\nwe find great virtue that encompasses all.\nOn this auspicious morning, we maintain solemnity,\npurifying the altar with fragrant herbs.\nAdorned with feathered crowns, we complete eight days and seven nights;\nclouds drift from the Purple Palace, nine banners raised with ten pendants.\nWe recite the true scriptures and gather the mats,\narranging the fragrant offerings to disperse the altar’s boundaries.\nIn a fleeting moment, we behold the radiance of the celestial bodies,\nhoping the grasses and thatch of our humble abode may be seen.\nThe mountain of sins crumbles and vanishes,\nwhile the peak of longevity grows ever higher;\nthe sea of blessings becomes clear and serene,\nflowing like an inexhaustible river of prosperity.\nWe, along with the ritual officers, bow our heads twice in reverence,\nsetting forth the rite to give thanks, presenting the final offering of wine.\n\nThe ritual proceeds.\n\nThe humble official [Name] and the assembled ritual officers at the altar jointly and reverently address the petition to: the Three Pure Ones of the Highest Realms, the Ten Directions’ Most Sacred, the Heavenly Perfected of the Jade Capital and Golden Towers, the Celestial Emperors, the Venerable Masters and Holy Hosts of the Ten Directions, the Officials and Attendants of the Three Realms, and all mighty numina.\n\nWe, your servants, have been fortunate across many lives to encounter this karmic affinity. Early on, we were graced by the grace of the Maple Throne, donning starry crowns and feathered robes; we inherited the rites of the Mushroom Altar, breaking the tally and dividing the jade rings. Though we have transmitted the ninefold regulations, our single heart’s sincerity can scarcely be exhausted. Now, having received the command, we humbly perform this offering of incense and devotion.\n\nThe painted horns fall silent, and the jade pendants chime with the rhythm of *dingdang*; the fragrant goblets pour emerald wine, and golden cups cast beams of luminous purity. With a hundred bows in three rows, we have fulfilled our reverent devotion; for a thousand transgressions and ten thousand sins, we now present this text of confession and gratitude.\n\nThe heartfelt words of the ritual officers.\nWe shall now proclaim them.\nProclamation of the Petition\nProclamation of the Memorial\nProclamation of the Presentation Document\n\nThe humble official [Name] again bows and addresses: the Three Pure Ones, the Most Sacred, the Ten Loftiest Perfected, the True Lords of the Ritual Altar, and all mighty numina. We humbly beseech your celestial compassion to look down upon our earnest devotion.\n\nWe have heard: in the vastness of the Great Heavenly Net, the jade steps of the Jade Terrace gleam with eternal spring; in the towering layers of clouds, the shell-palaces shine with undying radiance. The gates open to golden halls, and the ladders span the white-jade towers. Iridescent halos of light illuminate the solemn imperial regalia; the stars align in ranks, encircling the resplendent celestial court.\n\nHow much more difficult is it to behold the Most High in their exalted station, let alone for us to summon the Lord and presume to instruct? Yet we rely on the boundless grace of the Supreme Emperor, who does not disdain our lowliness, allowing even the humble to approach the sacred. Now that the courtly rites are complete, we hasten to welcome the return of your divine procession.\n\nWe envision the Primordial Beginning of the Void, whose chariot turns toward the wondrous court of Great Existence; the Lord of the Dao and its Power, whose carriage ascends to the true realm of the Upper Clarity. Flying dragons and dancing cranes escort the Old Lord back to the Jade Capital; whistling phoenixes and soaring simurghs accompany the August Heaven’s return to the Golden Towers. The Heavenly Thearch withdraws to the station of the Curved Array, and the Purple Tenuity returns to the Northern Culmen’s precincts. The Earthly Deities of the Rear receive their edicts and resume their posts; the Great Emperor of Longevity, together with the Savior from Suffering, turns their chariots homeward. The Three Sovereigns and Five Elders return to their palaces, and the Four Brahmā Heavens and Nine Empyreans withdraw their divine carriages.\n\nThereafter, we bid farewell to the deities of the various heavens as they resume their positions, gazing upon the host of immortals as they escort the procession. We bow in reverence to the gods and immortals present who return to the celestial realms, envisioning: the whips crack upon the cloud paths, and the gates of the heavenly courts swing open. The ranks of immortals, solemn as courtiers in ceremonial robes, enter in orderly procession; the majestic divine carriages, resplendent with banners and standards, turn back in formation. Feathered robes flutter, and the cries of cranes resound; celestial music plays, and the calls of simurghs fade into the distance. We pray that the Two Modes harmonize, the Two Qi follow their regular course, that auspicious stars appear over lands of virtue, and sweet dew nourish the fields of fine grain.\n\nWe bow in reverence to the gods and immortals present who return to the earthly realms, envisioning: the gates of the mountain palaces open, and the locks of the netherworld’s gates are drawn. The stately simurgh carriages swiftly enter the palace courts; the graceful crane chariots return to their grottoes and caves. Pearl curtains are rolled up as jade maidens joyfully welcome them; the jeweled carriages return as the immortals of the Jasper Realm smile and greet one another. We pray that auspicious omens herald good fortune, that the sagely blessings flow like springs, that the mountain spirits nurture worthy sages in this flourishing age, and that imperial decrees relieve the suffering of those in the netherworld’s gates.\n\nWe bow in reverence to the gods and immortals present who return to the watery realms, envisioning: dragons return to the deep seas, and horses cross Dongting Lake. The solemn divine procession, as if departing from the imperial palace, enters with dignity; the majestic ritual vestments, rejoicing, return to the throne. The carriages come to rest, and the moon’s reflection gleams upon a thousand rivers; the zithers and swords are sheathed, and mist envelops the Three Isles. We pray that your benevolent waves reach all beings, that your gracious favor shower the people, that the four seas calm the surging waves of leviathans, and that the three terraces aid the leaping of fish in the waves.\n\nThereafter, we bow in reverence to the gods and immortals present who return to the world of the living, envisioning: precious carriages float upon clouds, and pearl banners array like stars. Everywhere in the mountains and rivers, the deities have long awaited their return; in the solemn halls and temples, the immortals and sages are reverently welcomed back. The spirit banners are furled, and iron horses neigh in the wind; the celestial guards follow, and golden marten caps catch the moonlight. We pray that you deign to accept the offerings of the temple, that your blessings extend to the people of the realm, that compassionate clouds spread the gift of nurturing rain, and that harmonious qi gather to dispel the scattering winds of pestilence.\n\nNext, we bid farewell to the spirits who return to the ancestral shrines, the guardian deities of the niches, halls, streets, and corners, each attending to their duties in the fleeting moments of their presence, leaving no trace behind.\n\nWe, your servants, linger until evening as the divine carriages depart, uttering these words—how can we face the distant celestial steps with shame, regretting that our bodies lack wings? In future petitions and rites of welcome, we humbly hope for your condescending grace.\n\nWith the deepest reverence and longing, we prostrate ourselves and send you forth with all our hearts.\nThe Great Offering to the Heavenly Net concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "罗天大醮设醮仪 经名：罗天大醮设醮仪。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 罗天大醮设醮仪 各礼师存念如法 宣卫灵咒 东方 九炁青天，明星大神。 焕照东乡，洞映九门。 转烛阳光，扫秽除氛。 开明童子，号曰玄卿。 备卫我轩，上对帝君。 收魔束妖，讨捕凶群。 奉承正道，赤书玉文。 九天符命，摄龙驿传。 普天安镇，我得飞仙。 南方 三炁丹天，焕景流光。 荧星转烛，洞照太阳。 上有赤精，合契虚皇。 开明童子，号曰华房。 总御火兵，备守玉堂。 斩邪束妖，剪截魔王。 北帝所承，风火冲当。 流铃交焕，翊卫坛场。 正炁流行，敢有巴狂。 我享上功，坐运魁罡。 亿劫长存，保天无疆。 西方 七炁素天，太白流精。 光耀金门，洞朗太冥。 中有素皇，号曰帝灵。 保神安镇，卫我身形。 断绝邪源，玉道正明。 宫殿整肃，三景齐并。 道合自然，飞升紫庭。 灵宝符命，普惠万生。 元皇正炁，来合我身。 功加一切，天地咸宁。 北方 北方玄天，元始徘徊。 辰星转烛，洞焕太微。 黑灵尊神，号曰层威。 玄冠飞天，仙裾羽衣。 备守五门，检精捕非。 敢有干试，豁落斩摧。 玉符所告，神真八威。 邪门闭塞，正道流辉。 三光映照，我身无衰。 策空驾浮，举形仙飞。 中央 黄炁中央，调理乾坤。 陶镕阴阳，总统玄真。 镇星吐辉，流耀九星。 开明童子，号曰天璘。 阳炁焰上，朱焕炎精。 洞照内外，运我身形。 百邪摧落，摄役鬼灵。 中山神咒，普天使闻。 五灵安镇，身飞上清。 鸣法鼓二十四通 无上三天玄元始三炁太上老君，召出臣身中三五功曹左右官使者、左右捧香金童、传言散花玉女、五帝直符直日香官使者各三十六人出。 出者，严装显服，冠带垂缨。 关启玄坛土地、方域神真。",
      "translated_text": "**Ritual for Establishing the Grand Offering to the Heavens of the Luo**\n\n**Scripture Title:** *Ritual for Establishing the Grand Offering to the Heavens of the Luo*. One fascicle. Source text from the *Zhengtong Daoist Canon*, *Dongxuan* Section, *Weiyi* Category.\n\n**Ritual for Establishing the Grand Offering to the Heavens of the Luo**\n\nAll ritual masters shall maintain mindfulness in accordance with the proper method.\n\n**Proclamation of the Protective Incantation of the Numinous**\n\n**East**\nNinefold *qi* of the Azure Heavens, great deities of the radiant stars.\nShining upon the eastern lands, illuminating the nine gates.\nRevolving the candle of yang light, sweeping away defilement and baleful *qi*.\nThe Luminous Youth, styled as Mysterious Minister,\nGuards my hall, ascending to face the Imperial Lord.\nSubduing demons and binding specters, capturing malevolent hordes.\nUpholding the true Dao, the vermilion script of jade texts.\nThe talismanic commands of the Nine Heavens, dispatched by dragon couriers.\nMay all under heaven be pacified, and I attain transcendence as a flying immortal.\n\n**South**\nThreefold *qi* of the Cinnabar Heavens, resplendent with streaming light.\nThe fire star revolves its candle, penetrating the illumination of the great sun.\nAbove dwells the Crimson Essence, in harmony with the Celestial August.\nThe Luminous Youth, styled as Radiant Chamber,\nCommands the fire soldiers, guarding the Jade Hall.\nSevering evil and binding specters, shearing and intercepting demon kings.\nAs decreed by the Northern Emperor, wind and fire surge forth.\nInterlocking bells gleam, protecting the altar precincts.\nMay the upright *qi* flow freely—who dares act recklessly?\nI receive the supreme merit, seated in the revolving of the *kuigang*.\nThrough kalpas unending, I safeguard heaven without bound.\n\n**West**\nSevenfold *qi* of the White Heavens, essence streaming from Venus.\nLight illumines the Golden Gate, penetrating the vast darkness.\nWithin dwells the White August, styled as Imperial Numinous.\nPreserving the divine and pacifying the numinous, guarding my bodily form.\nCutting off the roots of evil, the jade Dao shines forth in rectitude.\nPalaces and halls stand in solemn order, the three luminaries aligned as one.\nIn harmony with the Dao of spontaneity, I ascend to the Purple Court.\nThe talismanic commands of the Numinous Treasure bestow universal grace upon all beings.\nThe primordial *qi* of the August Sovereign unites with my body.\nMerit extends to all—heaven and earth are at peace.\n\n**North**\nThe Dark Heavens of the north, where the Primordial One wanders.\nThe star of the dawn revolves its candle, illuminating the Grand Tenuity.\nThe Black Numinous Honored Deity, styled as Layered Might,\nDons a dark cap to soar through the heavens, clad in feathered robes of an immortal.\nGuarding the five gates, inspecting essences and capturing transgressors.\nWhoever dares to test me shall be shattered and crushed by the *huoluo*.\nAs proclaimed by the jade talismans, the eight divine mights of the perfected.\nThe gates of evil are sealed, the true Dao shines forth in radiance.\nThe three lights illumine me—my body knows no decay.\nI whip the void and ride the floating clouds, my form ascending in immortal flight.\n\n**Center**\nYellow *qi* of the central realm, regulating and harmonizing heaven and earth.\nForging and refining yin and yang, governing the mysterious and true.\nThe star of stability emits its radiance, streaming brilliance through the nine stars.\nThe Luminous Youth, styled as Celestial Splendor,\nYang *qi* flames upward, vermilion and blazing with essence.\nPenetrating illumination within and without, revolving my bodily form.\nA hundred evils are cast down, spirits and ghosts are captured and commanded.\nThe divine incantation of the Central Mountain is heard throughout heaven.\nThe five numina are pacified—my body ascends to the Upper Clarity.\n\n**Striking the Ritual Drum Twenty-Four Times**\n\nMost High Three Heavens, Mysterious Primordial, Threefold *Qi* of the Supreme Venerable Lord Lao, summon forth from within my body the thirty-six *Gongcao* officials of the left and right, the left and right golden lads bearing incense, the jade maidens transmitting words and scattering flowers, and the thirty-six *Xianguan* messengers of the Five Thearchs on duty for the day.\n\nLet them emerge, clad in solemn attire, robes adorned, caps and pendants hanging.\nReport to the deities of the sacred altar’s land and the numinous guardians of the directional domains.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 697,
      "start_sentence": 0,
      "end_sentence": 64,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.762607097625732,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\罗天大醮设醮仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "臣今设醮谢恩，谨奏为入意，其诸诚意，具载缄誊。 愿得太上至真道炁，灵宝瑞光，下降流入臣等身中，令臣所启之诚，速达径御至真无极大道、三清上圣、昊天至尊金阙玉皇上帝御前。 请称法位 具位臣某与临坛官众等，谨同诚上启：虚无自然元始天尊、无极大道太上道君、太上老君、高上玉皇、十方已得道大圣众，至真诸君丈人、三十二天帝君、玉虚上帝、玉帝大帝、东华南极、西灵北真、玄都玉京金阙七宝琼台紫微上宫灵宝至真明皇道君、三十六部尊经、玄中大法师、上相上宰、上保上傅、太平下教二十四真人、西城总真王君、太乙真人、东岳上卿司命茅君定录保命二真人、名山洞府得道神仙、三界官属一切真灵。 臣闻：道不远人，彰非色非空之象； 天能覆物，仰不清不浊之机。",
      "translated_text": "Now, as I establish this jiao-offering to express gratitude, I reverently submit this petition with utmost sincerity, all intentions faithfully inscribed and sealed.\n\nMay the supreme and perfected *Dao*-*qi* of the Most High, the auspicious radiance of the Numinous Treasure, descend and flow into our bodies, that the sincerity of my entreaty may swiftly ascend and directly reach the presence of the Utmost True and Boundless Dao, the Three Clarities’ August Sages, and the August Jade Thearch of the Golden Gates, Supreme Lord of the Heavenly Vault.\n\nInvoking the sacred ranks:\nYour humble servant, [Name], together with the assembled altar officials, with unified sincerity, reverently petitions:\nThe Primordial Heavenly Venerable of the Void and Spontaneous, the Boundless Dao’s Most High Lord of the Way, the Most High Lord Lao, the August Jade Thearch, the host of great perfected saints who have attained the Dao in the ten directions, the true lords and elders, the thirty-two Heavenly Thearchs, the Jade Clarity Thearch, the Great Thearch of the Jade Capital, the Eastern Florescence and Southern Culmen, the Western Numinous and Northern Perfected, the Lord of the Dao of the Luminous August Numinous Treasure in the Seven-Jeweled Jasper Terrace of the Purple Tenuity’s Upper Palace within the Jade Metropolis of the Mysterious Capital, the thirty-six divisions of revered scriptures, the Great Dharma Masters of the Mysterious Center, the Supreme Ministers and Prime Counsellors, the Supreme Protectors and Grand Tutors, the twenty-four Perfected of the Great Peace’s Lower Teaching, the Perfected King of the Western City’s Assembly, the Perfected of the Great One, the Supreme Minister of the Eastern Marchmount and the Two Perfected Lords of Life-Prolonging Registers, the divine immortals who have attained the Dao in the grotto-heavens and blessed mountains, and all the numinous officials and spirits of the Three Realms.\n\nI have heard: the Dao is not distant from humanity, manifesting in forms neither substantial nor void.\nHeaven covers all things, its mechanism neither pure nor turbid when beheld.",
      "overlap_context": "the Supreme Venerable Lord Lao, summon forth from within my body the thirty-six *Gongcao* officials of the left and right, the left and right golden lads bearing incense, the jade maidens transmitting words and scattering flowers, and the thirty-six *Xianguan* messengers of the Five Thearchs on duty for the day.\n\nLet them emerge, clad in solemn attire, robes adorned, caps and pendants hanging.\nReport to the deities of the sacred altar’s land and the numinous guardians of the directional domains.",
      "start_char": 697,
      "end_char": 1011,
      "start_sentence": 65,
      "end_sentence": 70,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.655926942825317,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\罗天大醮设醮仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "苟一念之精通，则十方之咸集。 今时斋官某夙严素念，少罄丹衷。 久洁星坛，已肃六斋之礼； 再迎云躅，虔伸一醮之仪。 嗟黍稷之非馨，念苹蘩之可祀。 香交朝雾，气凝戛戛之龙车； 磬递晓风，声杂寥寥之仙乐。 敬之如在，感而遂通。 伏愿驾羽飞云，十绝之旛幢隐映； 出日入月，八珍之旌谛悠扬。 三界侍轩，万神就座。 臣等诚惶诚恐，冒犯威严，谨当奏降。 请班 降圣 安座 进荼 鸾舆鹤驾，敢延琳宇之居； 凤饼龙团，敬效玉杯之献。 望天颜之咫尺，鉴人意之翘懃。 上下交通，内外环应。 臣与斋官诚惶诚恐，稽首顿首，再拜谨陈茶献。 法事",
      "translated_text": "Should but a single thought attain perfect clarity, the hosts of the ten directions shall assemble as one. Now the present officiant, so-and-so, has long cultivated pure devotion, offering from the depths of a sincere heart. For long he has purified the stellar altar, having already observed the rites of the Six Fasts; again he welcomes the cloud-borne tread, reverently performing the ritual of a single offering. Alas, millet and grain lack true fragrance—yet he reflects that the humble offerings of fern and cress may still be fit for sacrifice. Incense mingles with the morning mist, qi congeals around the rattling dragon-chariots; chimes echo in the dawn wind, their sounds blending with the distant strains of immortal music. In reverence, he acts as though the deities were present, moved to communion by his devotion.\n\nWe humbly pray that, borne on feathered flight through the clouds, the banners and standards of the Ten Perfections may shimmer in hidden splendor; emerging with the sun and entering with the moon, the standards of the Eight Treasures may wave in graceful majesty. May the Three Realms attend in their chariots, the myriad spirits take their seats. We, your servants, in awe and trembling, dare to invoke your august presence, and now respectfully present our petition for your descent.\n\nWe beseech: **Array the ranks, descend in sacred presence, be seated in tranquility, receive the tea offering.** May the phoenix-cakes and dragon-tea, presented in jade cups, humbly extend an invitation to your numinous abodes. May we, gazing upward, find your celestial countenance as near as a handbreadth, and may you perceive the earnestness of human intent. Above and below in communion, within and without in perfect resonance.\n\nWe, the officiant and your servants, in awe and trembling, bow our heads to the ground, prostrate ourselves, and reverently present the tea offering. **The ritual proceeds.**",
      "overlap_context": "e Western City’s Assembly, the Perfected of the Great One, the Supreme Minister of the Eastern Marchmount and the Two Perfected Lords of Life-Prolonging Registers, the divine immortals who have attained the Dao in the grotto-heavens and blessed mountains, and all the numinous officials and spirits of the Three Realms.\n\nI have heard: the Dao is not distant from humanity, manifesting in forms neither substantial nor void.\nHeaven covers all things, its mechanism neither pure nor turbid when beheld.",
      "start_char": 1011,
      "end_char": 1267,
      "start_sentence": 71,
      "end_sentence": 92,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.187068700790405,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\罗天大醮设醮仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "臣闻：天本不言，虽曰祸淫而福善； 道无不覆，然常恶杀以好生。 雷霆寓震动之威，雨露有沾濡之化。 网恢恢而不漏，德荡荡以难名。 吉凶非数之适然，祸福皆人之所召。 苟知迁善而远罪，自可转祸而为祥。 切念斋官某居两仪博爱之中为万物最灵之数，被纶命牧民之际目兹浩劫可怜外境之瘟灾、兵戈、旱蝗、水灾身若泰和或者萧墙之衅起爰友乎分官列职，一乡善士昭告于十极高真。 乃陈伏地之词，爰设罗天之醮，心存精白，仪备斋庄。 兰烛相辉，宝炬散六花之瑞； 沉檀交馥，金炉熏五色之祥。 春满醮筵，云开黄道，将伸献礼，敢袭常程。 惧苹藻之为羞，未能斋洁； 采参苓之仙药，以代演污。 物不足而诚有余，心既精而文可略。 一忱冒渎，百拜震惊，清酒在樽，谨陈初献。 法事 臣闻：可道非道，可名非名，莫究",
      "translated_text": "We, your servants, have heard: Heaven speaks not, yet it visits calamity upon excess and bestows blessings upon the virtuous; the Dao/Way encompasses all, yet it ever abhors killing and cherishes life. Thunder embodies the awe of its tremors, rain and dew enact its nurturing transformation. Its net is vast and none escape, its virtue/power boundless and beyond naming. Fortune and misfortune do not arise by mere chance, but are summoned by human deeds. Should one know to turn toward goodness and distance oneself from transgression, one may transform misfortune into blessing.\n\nWe humbly reflect: the officiant, so-and-so, dwells amid the boundless love of the Two Modes, counted among the most numinous of the myriad beings, charged with the mandate to shepherd the people. Yet now we behold this grievous calamity—external afflictions of pestilence, warfare, drought, locusts, and floods—while within, even those who once dwelt in peace may find strife arising behind their own gates. Thus, the officials of this district and the virtuous gentlemen of this township make their proclamation to the august Perfected Ones of the Ten Poles. Now we set forth our words prostrate upon the earth, and establish this grand Offering of the Boundless Heavens. Our hearts hold purity and sincerity, our rites are arrayed with solemn reverence. Orchid candles glow in radiance, precious torches scatter the auspicious blossoms of the sixfold splendor; aloeswood and sandalwood mingle their fragrance, golden censers diffuse the five-colored omens of fortune. Spring fills the offering altar, clouds part to reveal the Yellow Path. As we prepare to present our gifts, we dare not follow mere routine.\n\nFearing that our humble offerings of water-plants may bring shame, we have not attained perfect purity; yet we gather the immortal herbs of ginseng and poria, substituting them for what would defile. Though our goods are meager, our sincerity overflows; though our hearts are pure, our forms may be spare. With this single devotion we presume to trespass, with a hundred bows we tremble in awe. The clear wine stands in the vessel—we reverently present the first offering.\n\nThe ritual proceeds.\n\nWe, your servants, have heard: that which can be spoken is not the eternal Dao/Way, that which can be named is not the eternal name. Its depths cannot be fathomed...",
      "overlap_context": ".** May the phoenix-cakes and dragon-tea, presented in jade cups, humbly extend an invitation to your numinous abodes. May we, gazing upward, find your celestial countenance as near as a handbreadth, and may you perceive the earnestness of human intent. Above and below in communion, within and without in perfect resonance.\n\nWe, the officiant and your servants, in awe and trembling, bow our heads to the ground, prostrate ourselves, and reverently present the tea offering. **The ritual proceeds.**",
      "start_char": 1267,
      "end_char": 1592,
      "start_sentence": 93,
      "end_sentence": 109,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.122193336486816,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\罗天大醮设醮仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "玄玄之理； 以神谓神，以圣谓圣，钦惟濯濯之灵。 念此身如水上之沤，嗟光景若风中之烛。 孽不可逭，惧汉罔之可疏； 善或可禳，见韩书之具载。 鉴清八表，醮设罗天，冰洁五官，诚存一念。 已彻潢污之供，重伸采藻之忱。 谢罪谢恩，愧獭豺之何似； 成终成始，怜犬马之惟勤。 视无见而听无闻，仰洋洋之在上； 亲有德而飨有道，鉴恳恳之由衷。 消禳黑籍之愆，乞注清都之禄。 介将来之景福，消巳见未至之灾危。 臣等虔诚酒陈亚献。 法事 臣闻：若存若亡，无声无臭。 上天之载，荡荡巍巍。 至道之精，恍恍惚惚。 辄殚悃素，仰叩圆青。 顾有漏之幻躯，获罪而无所祈祷； 仰无名之妙道，大德而有以包容。 是谷旦之谨严，肃兰场而致洁。 黄冠被羽，尽八日以七宵； 紫府飞云，建九节而十绝。 决真文而敛席，陈芳醮以散坛。 倏瞻奎壁之光，望鉴草茅之恳。 罪山摧灭，增寿岳之弥高； 福海澄清，流禄河之不竭。 臣与斋官稽首再拜，设醮谢恩，酒陈终献。 法事",
      "translated_text": "The mysteries of the profoundest principle—\nwhat is called spirit is spirit, what is called sage is sage,\nwe revere the radiant and luminous numen.\n\nWe contemplate this body as a bubble upon the water,\nlamenting how our light and shadow flicker like a candle in the wind.\nTransgressions cannot be evaded—we fear the Han Code’s unyielding strictures;\nyet blessings may be averted—we see the Han Records’ full accounts.\nGazing across the eight directions, we set the vast net of heaven’s rite,\npurifying the five officials with ice-like clarity, our sincerity fixed in a single thought.\nHaving removed the defiled offerings, we renew our devotion with gathered water-plants.\nWe give thanks for sins forgiven, for grace received—\nashamed that otters and jackals could not compare;\nwe strive to begin anew, to persevere—\nmoved that even the toil of dogs and horses is not in vain.\nSeeing what cannot be seen, hearing what cannot be heard,\nwe look up to the boundless expanse above;\ndrawing near to virtue, partaking of the Dao/Way,\nwe offer our earnest sincerity from the depths of our hearts.\nMay the faults recorded in the black registers be dissolved,\nand blessings from the Pure Capital be inscribed.\nMay future prosperity be secured,\nand impending disasters be averted before they arrive.\nWe, your servants, reverently present the second offering of wine.\n\nThe ritual proceeds.\n\nWe have heard: now present, now absent—\nwithout sound, without scent.\nThe workings of heaven above,\nvast and towering.\nThe essence of the supreme Dao/Way,\nelusive and indistinct.\nWe exhaust our sincerity,\nlooking up to knock upon the azure vault.\nBeholding this illusory, leaky frame,\nwe have sinned and have no ground for prayer;\nlooking up to the wondrous Dao/Way beyond names,\nwe find great virtue that encompasses all.\nOn this auspicious morning, we maintain solemnity,\npurifying the altar with fragrant herbs.\nAdorned with feathered crowns, we complete eight days and seven nights;\nclouds drift from the Purple Palace, nine banners raised with ten pendants.\nWe recite the true scriptures and gather the mats,\narranging the fragrant offerings to disperse the altar’s boundaries.\nIn a fleeting moment, we behold the radiance of the celestial bodies,\nhoping the grasses and thatch of our humble abode may be seen.\nThe mountain of sins crumbles and vanishes,\nwhile the peak of longevity grows ever higher;\nthe sea of blessings becomes clear and serene,\nflowing like an inexhaustible river of prosperity.\nWe, along with the ritual officers, bow our heads twice in reverence,\nsetting forth the rite to give thanks, presenting the final offering of wine.\n\nThe ritual proceeds.",
      "overlap_context": "bstituting them for what would defile. Though our goods are meager, our sincerity overflows; though our hearts are pure, our forms may be spare. With this single devotion we presume to trespass, with a hundred bows we tremble in awe. The clear wine stands in the vessel—we reverently present the first offering.\n\nThe ritual proceeds.\n\nWe, your servants, have heard: that which can be spoken is not the eternal Dao/Way, that which can be named is not the eternal name. Its depths cannot be fathomed...",
      "start_char": 1592,
      "end_char": 1981,
      "start_sentence": 110,
      "end_sentence": 139,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.13711953163147,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\罗天大醮设醮仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "具位臣某与临坛官众等谨同诚上启：三境至尊、十方上圣、玉京金阙天帝天真、十方师尊圣众、三界官属、一切威灵。 臣等多生幸会，宿命因缘。 早沾枫陛之恩，簪星披羽； 嗣拜芝坛之法，破券分环。 既传九等之规，难尽一心之恳。 今承请命，辄效焚修。 画角收声，玉佩响玎珰之韵； 芳樽泻翠，金杯飞皎洁之光。 百拜三行、已尽钦崇之志； 千愆万罪，庸披首谢之文。 斋官心词。 谨当宣奏。 宣词 宣疏 宣进状 具位臣某再拜上启：三清上圣、十极高真，醮筵真宰，一切威灵，恭望天慈，俯昭谢悃。 臣闻：大罗渺渺，瑶墀景丽於长春； 云层峨峨，贝阙辉凝於不夜。 门敞黄金之殿，梯横白玉之楼。 霞烂圆光，映雍雍之御表； 星分班次，拱奕奕之微垣。 矧至尊履位而见则犹难，况以臣召君而训云不可。 恃上帝勿嫌其卑贱，致下民僭屈於尊严。 既毕朝仪，盍迎归驾。 伏想虚无元始，车回於大有妙庭； 灵宝道君，辇向於上清真境。 飞龙舞鹤，迎老君之还玉京； 啸凤飞鸾，拥昊天之归金阙。 天皇回勾陈之位，紫微还北极之垣。 后土地祇，勑地神而还御； 长生大帝，同救苦以回辕。 三皇五老以还宫，四梵九霄而回驭。 然后饯诸天之复位，望群仙而翼辕。 拜送在会神仙归天界者，伏想：鞭鸣云路，户敞天庭。 济济仙班，肃若揖冕流而入； 巍巍法驾，森然拥旌节之回。 羽衣翩而鹤唳频闻，音乐奏而鸾声渐远。 尚愿两仪交泰，二气循常，景星出有道之邦，甘露液嘉禾之地。 拜送在会神仙归地府者，伏想：门开岳府，锁掣泉扃。 整整鸾舆，翕尔向宫庭而入； 翩翩鹤驾，依然从岩洞之居。 珠帘卷而彩女欢迎，宝驾回而琼仙笑揖。 尚愿佳祥启运，圣泽漏泉，岳神生盛世之贤，帝诏恤冥关之类。 拜送在会神仙归水府者，伏想：龙回沧海，马过洞庭。 肃肃神游，俨若自帝宫而入； 森森法服，欣朝御座而回。 轩车息而月印千江，琴剑收而烟笼三岛。 尚愿恩波及物，惠渥沾民，四溟止鲸霈之涛，三级助鱼跳之浪。 然后，拜送在会神仙归阳间者，伏想：云浮珍驾，星列珠幢。 在在山川，久矣俟尊神而入； 堂堂祠宇，肃然迎仙圣之回。 灵旗卷而铁马嘶风，天仗随而金貂带月。 尚愿尊膺庙食，福界邦民，慈云遍化雨之施，和气敛瘟风之散。 次及灵归家庙神镇龛堂坊隅之内，各有司存欻鲦之间，寂无遗响。 臣等夕淹飙驭出斯语，以何颜遥望天阶，恨此身之不羽，后启奏迎之礼，尚希降格之慈。 臣等下情无任俯伏攀恋之至，一心奉送。 罗天大醮设醮仪竟",
      "translated_text": "The humble official [Name] and the assembled ritual officers at the altar jointly and reverently address the petition to: the Three Pure Ones of the Highest Realms, the Ten Directions’ Most Sacred, the Heavenly Perfected of the Jade Capital and Golden Towers, the Celestial Emperors, the Venerable Masters and Holy Hosts of the Ten Directions, the Officials and Attendants of the Three Realms, and all mighty numina.\n\nWe, your servants, have been fortunate across many lives to encounter this karmic affinity. Early on, we were graced by the grace of the Maple Throne, donning starry crowns and feathered robes; we inherited the rites of the Mushroom Altar, breaking the tally and dividing the jade rings. Though we have transmitted the ninefold regulations, our single heart’s sincerity can scarcely be exhausted. Now, having received the command, we humbly perform this offering of incense and devotion.\n\nThe painted horns fall silent, and the jade pendants chime with the rhythm of *dingdang*; the fragrant goblets pour emerald wine, and golden cups cast beams of luminous purity. With a hundred bows in three rows, we have fulfilled our reverent devotion; for a thousand transgressions and ten thousand sins, we now present this text of confession and gratitude.\n\nThe heartfelt words of the ritual officers.\nWe shall now proclaim them.\nProclamation of the Petition\nProclamation of the Memorial\nProclamation of the Presentation Document\n\nThe humble official [Name] again bows and addresses: the Three Pure Ones, the Most Sacred, the Ten Loftiest Perfected, the True Lords of the Ritual Altar, and all mighty numina. We humbly beseech your celestial compassion to look down upon our earnest devotion.\n\nWe have heard: in the vastness of the Great Heavenly Net, the jade steps of the Jade Terrace gleam with eternal spring; in the towering layers of clouds, the shell-palaces shine with undying radiance. The gates open to golden halls, and the ladders span the white-jade towers. Iridescent halos of light illuminate the solemn imperial regalia; the stars align in ranks, encircling the resplendent celestial court.\n\nHow much more difficult is it to behold the Most High in their exalted station, let alone for us to summon the Lord and presume to instruct? Yet we rely on the boundless grace of the Supreme Emperor, who does not disdain our lowliness, allowing even the humble to approach the sacred. Now that the courtly rites are complete, we hasten to welcome the return of your divine procession.\n\nWe envision the Primordial Beginning of the Void, whose chariot turns toward the wondrous court of Great Existence; the Lord of the Dao and its Power, whose carriage ascends to the true realm of the Upper Clarity. Flying dragons and dancing cranes escort the Old Lord back to the Jade Capital; whistling phoenixes and soaring simurghs accompany the August Heaven’s return to the Golden Towers. The Heavenly Thearch withdraws to the station of the Curved Array, and the Purple Tenuity returns to the Northern Culmen’s precincts. The Earthly Deities of the Rear receive their edicts and resume their posts; the Great Emperor of Longevity, together with the Savior from Suffering, turns their chariots homeward. The Three Sovereigns and Five Elders return to their palaces, and the Four Brahmā Heavens and Nine Empyreans withdraw their divine carriages.\n\nThereafter, we bid farewell to the deities of the various heavens as they resume their positions, gazing upon the host of immortals as they escort the procession. We bow in reverence to the gods and immortals present who return to the celestial realms, envisioning: the whips crack upon the cloud paths, and the gates of the heavenly courts swing open. The ranks of immortals, solemn as courtiers in ceremonial robes, enter in orderly procession; the majestic divine carriages, resplendent with banners and standards, turn back in formation. Feathered robes flutter, and the cries of cranes resound; celestial music plays, and the calls of simurghs fade into the distance. We pray that the Two Modes harmonize, the Two Qi follow their regular course, that auspicious stars appear over lands of virtue, and sweet dew nourish the fields of fine grain.\n\nWe bow in reverence to the gods and immortals present who return to the earthly realms, envisioning: the gates of the mountain palaces open, and the locks of the netherworld’s gates are drawn. The stately simurgh carriages swiftly enter the palace courts; the graceful crane chariots return to their grottoes and caves. Pearl curtains are rolled up as jade maidens joyfully welcome them; the jeweled carriages return as the immortals of the Jasper Realm smile and greet one another. We pray that auspicious omens herald good fortune, that the sagely blessings flow like springs, that the mountain spirits nurture worthy sages in this flourishing age, and that imperial decrees relieve the suffering of those in the netherworld’s gates.\n\nWe bow in reverence to the gods and immortals present who return to the watery realms, envisioning: dragons return to the deep seas, and horses cross Dongting Lake. The solemn divine procession, as if departing from the imperial palace, enters with dignity; the majestic ritual vestments, rejoicing, return to the throne. The carriages come to rest, and the moon’s reflection gleams upon a thousand rivers; the zithers and swords are sheathed, and mist envelops the Three Isles. We pray that your benevolent waves reach all beings, that your gracious favor shower the people, that the four seas calm the surging waves of leviathans, and that the three terraces aid the leaping of fish in the waves.\n\nThereafter, we bow in reverence to the gods and immortals present who return to the world of the living, envisioning: precious carriages float upon clouds, and pearl banners array like stars. Everywhere in the mountains and rivers, the deities have long awaited their return; in the solemn halls and temples, the immortals and sages are reverently welcomed back. The spirit banners are furled, and iron horses neigh in the wind; the celestial guards follow, and golden marten caps catch the moonlight. We pray that you deign to accept the offerings of the temple, that your blessings extend to the people of the realm, that compassionate clouds spread the gift of nurturing rain, and that harmonious qi gather to dispel the scattering winds of pestilence.\n\nNext, we bid farewell to the spirits who return to the ancestral shrines, the guardian deities of the niches, halls, streets, and corners, each attending to their duties in the fleeting moments of their presence, leaving no trace behind.\n\nWe, your servants, linger until evening as the divine carriages depart, uttering these words—how can we face the distant celestial steps with shame, regretting that our bodies lack wings? In future petitions and rites of welcome, we humbly hope for your condescending grace.\n\nWith the deepest reverence and longing, we prostrate ourselves and send you forth with all our hearts.\nThe Great Offering to the Heavenly Net concludes.",
      "overlap_context": "ndaries.\nIn a fleeting moment, we behold the radiance of the celestial bodies,\nhoping the grasses and thatch of our humble abode may be seen.\nThe mountain of sins crumbles and vanishes,\nwhile the peak of longevity grows ever higher;\nthe sea of blessings becomes clear and serene,\nflowing like an inexhaustible river of prosperity.\nWe, along with the ritual officers, bow our heads twice in reverence,\nsetting forth the rite to give thanks, presenting the final offering of wine.\n\nThe ritual proceeds.",
      "start_char": 1981,
      "end_char": 2940,
      "start_sentence": 140,
      "end_sentence": 196,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.10133171081543,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\罗天大醮设醮仪.txt",
        "category": "威仪类"
      }
    }
  ]
}