{
  "source_id": "群仙要语纂集",
  "source_file": "chunked_daozang\\群仙要语纂集.json",
  "total_chunks": 18,
  "total_original_chars": 16252,
  "total_translated_chars": 91542,
  "total_translation_time": 469.56188917160034,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\群仙要语纂集.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**Anthology of Essential Sayings of the Immortals**\n*Title:* *Anthology of Essential Sayings of the Immortals*. Compiled by Dong Hanchun, a reclusive scholar of the late Yuan and early Ming dynasties. Two fascicles. Source text: *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n**Anthology of Essential Sayings of the Immortals, Fascicle One**\nCompiled by Dong Hanchun, the Return-to-the-Origin Daoist\n\n**Daily Practice**\nIn daily use, one must observe dietary restraints and sit upright without a single stray thought, forgetting all worldly affairs to preserve spirit and settle the mind. The eyes should not gaze upon objects, the ears should not heed sounds—guard the heart within, regulate the breath in an unbroken stream, exhaling gradually without interruption, as if present yet absent. Naturally, the heart’s fire descends, the kidneys’ water ascends, and saliva is born in the mouth. The numinous true self attaches to the body, and the path to longevity is attained.\n\nThroughout the twelve hours, one must remain pure and still. \"Pure\" means no thought arises; \"still\" means the spirit terrace is empty. The body is the dwelling of qi, the heart the abode of spirit. Where intention moves, spirit moves; where spirit moves, qi scatters. When spirit gathers, the five phases’ true qi coalesces into the elixir pellet. Naturally, a body arises within the body, and the harmonious qi surges through, like ghee pouring over the crown. In motion and stillness, sitting and lying down, one should always feel the body as light as the wind’s passage, the intestines rumbling like thunder. The ears catch immortal melodies, music without strings—soundless yet resonant, drumless yet resounding. When spirit and qi intertwine, the male principle reverses its course. One beholds the inner landscape, speaks spontaneously, perceives the formless, and dwells among the sages. Spirit moves freely in and out, and one’s lifespan aligns with heaven and earth, transcending birth and death.\n\nDo not allow any harm. Throughout the twelve hours, remain pure and still. Spirit is the child of qi, qi the mother of spirit—like a hen brooding her egg. In preserving spirit and nurturing qi, how could they ever part? Wondrous! Most wondrous!\n\n**Excerpts from Master Guan Yin**\nMaster Guan Yin said: Without the Dao, speech is impossible; yet what cannot be spoken *is* the Dao. Without the Dao, thought is impossible; yet what cannot be thought *is* the Dao. Speech is like blowing on a shadow; thought is like grasping at floating dust. Even sages and wise men become deluded—ghosts and spirits cannot fathom it.\n\nHe also said: Those who do not know the Dao yet recklessly divine with intent are like archers shooting at an overturned vessel. The lofty claim to \"preserve gold and jade\"; the mediocre, \"horns and feathers\"; the base, \"tiles and stones.\" Is this so or not? Only the one who placed the object knows.\n\nHe also said: The Dao can never be attained—what *can* be attained is called virtue, not Dao. The Dao can never be practiced—what *can* be practiced is called conduct, not Dao. The sage employs what can be attained and practiced to perfect this life; employs what cannot be attained or practiced to perfect death.\n\nHe also said: One whose emotions are utterly quiescent is a sage; one whose emotions are good is a worthy; one whose emotions are base is a petty person. The utterly quiescent emotion arises from the self-existent void—it cannot be displayed. The good or base emotion arises from nothingness into being—it cannot be concealed. Good and base emotions belong to conscious beings, for only sentient creatures possess them. The utterly quiescent emotion belongs to the unconscious, and beneath all heaven, the Dao is nowhere absent.\n\nHe also said: A single spark can burn ten thousand things, yet when the things are gone, where does the fire remain? A single breath of Dao can pervade ten thousand things, yet when the things are gone, where does the Dao abide?\n\nHe also said: My Dao is like dwelling in darkness. One who dwells in brightness sees nothing in the dark, yet one who dwells in darkness can see all things in the light.\n\nHe also said: A bean does not question the pot, nor does the pot answer the bean. A tile does not question the stone, nor does the stone answer the tile. The Dao likewise does not err—whether questioned or answered. Qi flows to and fro, yet where is the Dao?\n\nHe also said: The image of a single revolution is bound within the great void. From its center it ascends to become heaven; from its center it descends to become earth. There is nothing that ascends without descending, nothing that descends without ascending. What ascends is fire; what descends is water. What longs to ascend but cannot is wood; what longs to descend but cannot is metal. As for wood: when drilled, it yields fire; when wrung, it yields water. As for metal: when struck, it yields fire; when smelted, it yields water. Metal and wood are the intercourse of water and fire. Water is essence and heaven; fire is spirit and earth; wood is the hun-soul and humanity; metal is the po-soul and things. That which revolves without cease is time; that which contains and yet abides is space. Only soil marks both beginning and end.\n\nHe also said: Though heaven and earth are vast, they possess form, color, number, and direction. Yet I possess that which is neither form nor color, neither number nor direction—and yet it is heavenlier than heaven, earthier than earth.\n\nHe also said: In dreams, in mirrors, in water—there too heaven and earth exist. To dispel the heaven and earth of dreams, one must not sleep. To dispel the heaven and earth of mirrors, one must not reflect. To dispel the heaven and earth of water, one must not draw from the vessel. Their being or non-being lies here, not there—thus the sage does not dispel heaven and earth, but dispels perception.\n\nHe also said: Heaven and earth are lodged, the myriad things are lodged, I am lodged, the Dao is lodged. If one departs from lodging, the Dao cannot stand.\n\nHe also said: Though one’s conduct be most lofty, it does not escape high and low. Though one’s words be most impartial, they do not escape right and wrong. Though one’s abilities be most divine, they do not escape skill and clumsiness. Though one’s appearance be most singular, it does not escape beauty and ugliness. The sage employs these to manifest to the world, and when the world becomes quiescent in them, it sees the sage.\n\nHe also said: The Dao has no body—those who respond to the world with Dao are engaged in affairs, not Dao. The Dao has no direction—those who lodge the Dao in things are dealing with things, not Dao. The sage ultimately cannot depart from the Dao to display it to others.\n\nHe also said: Maggots eat snakes, snakes eat frogs, frogs eat maggots—each devours the other. The words of sages are likewise: they speak of being and non-being, then of neither being nor non-being, then of transcending neither being nor non-being. Their words are like the drawing of a saw. Only the truly sagely do not cling to a single word.\n\nHe also said: The clearer the mind of profit and harm, the less harmony among kin. The clearer the mind of worthiness and foolishness, the less fellowship among friends. The clearer the mind of right and wrong, the less accomplishment in affairs. The clearer the mind of beauty and ugliness, the less resonance with things. Thus the sage blends them all.\n\nHe also said: The sage employs speech, action, and thought to be one with others; employs non-speech, non-action, and non-thought to be distinct from others.\n\nHe also said: One who takes the sage as teacher of the sage is a worthy; one who takes the worthy as teacher of the sage is a sage. For one who takes the sage as teacher of the sage follows traces and forgets the Dao; one who takes the worthy as teacher of the sage returns to traces and unites with the Dao.\n\nHe also said: The multitude use the po-soul to restrain the hun-soul; the sage uses the hun-soul to move the po-soul. The po-soul stores the hun-soul and accompanies it; the hun-soul roams while the po-soul follows. By day the hun-soul lodges in the eyes, by night the po-soul abides in the liver. Lodging in the eyes, it can see; abiding in the liver, it can dream.\n\nHe also said: For a fruit to have a pit, it must await the presence of water, fire, and soil—only then can it generate endlessly. If these three are not present, as in great drought, great flood, or barren earth, nothing can be born. Essence-water, spirit-fire, and intent-soil—these three do not originally interact; only humans unite them through the root.\n\nHe also said: A cook boiled a crab, leaving one leg on the table. Though the crab was boiled, the discarded leg still twitched. Life and death are but the gathering and scattering of a single qi. Not born, not dead—yet people arbitrarily calculate life and death.\n\nHe also said: Without the one mind, the five senses race in all directions—the mind cannot be unified. Without the empty mind, the five phases are all present—the mind cannot be empty. Without the still mind, the myriad transformations shift imperceptibly—the mind cannot be still. If one could unify it, duality would arise. If one could empty it, it would be filled. If one could still it, it would be set in motion. Only the sage can gather the ten thousand existences into a single breath, so that not one thing can enslave his clarity; can scatter a single breath into the ten thousand existences, so that not one thing can inquire into his actions.\n\nHe also said: What flows is the boat, yet what causes it to flow is the water, not the boat. What moves is the cart, yet what causes it to move is the ox, not the cart. What thinks is the mind, yet what causes it to think is intent, not the mind.\n\nIt is so of itself, yet one knows not why it is so. Only by not knowing why it is so can its coming have no source, its going no place. With its coming having no source and its going no place, it can thus merge with the original essence of Heaven and Earth, neither ancient nor modern.\n\nHe also said: Right and wrong, beauty and ugliness, success and failure, fullness and emptiness—these are the workings of the Creator. All arise from clinging to private perceptions, and thus even when one dispels them with non-being, they remain; even when one dispels them with neither being nor non-being, they remain. It is like revisiting a place from the past—memories arise vividly, which cannot be forgotten or dismissed. The skillful transcend perception by transforming it into wisdom. Do you understand this teaching on transforming perception into wisdom?\n\nHe said: \"Thought\" is like fearing ghosts and trembling, or fearing bandits and panicking. \"Perception\" is like mistaking millet for sorghum, or jade for stone. Both are drifting illusions without foundation. For example, seeing a strange object gives rise to thoughts of strangeness, which in turn give rise to perceptions of strangeness—yet neither these thoughts nor perceptions have their root in oneself. It is like today: as for tomorrow, thoughts and perceptions cannot be foretold. When tomorrow comes, all the scattered thoughts and perceptions arise from what has come into being—these are called thoughts and perceptions. It is like a rhinoceros gazing at the moon: the moon’s reflection enters its horn, and from this thoughts and perceptions arise, producing the form of the moon—yet the true moon was never in the horn. The myriad things in the mind’s heaven and earth are likewise.\n\nOne who understands this teaching sees nothing outside, feels no emotion within.\n\nHe also said: Emotion arises from the mind, the mind arises from nature. Emotion is the wave; the mind, the current; nature, the water. What comes to disturb me passes like a spark struck from stone. If one receives it with nature, the mind does not give rise to things, and all remains buoyant.\n\nHe also said: Of worthies and fools, the genuine and the false, some perceive them, some do not. Though there are indeed worthies and fools, the genuine and the false, what we call worthies and fools, the genuine and the false, strike against our perceptions. Knowing that all are formed by perception, even the genuine becomes false.\n\nHe also said: Though Heaven and Earth are vast, they can command the formed but cannot command the formless. Though yin and yang are subtle, they can command the qi-endowed but cannot command the qi-less. Knowing that my mind is without qi and without form, then Heaven and Earth and yin and yang cannot command it.\n\nHe also said: When a person in ordinary times suddenly sees an extraordinary thing, it is always because essence has congealed to make it so. When a person in illness suddenly sees an extraordinary thing, it is always because something is lacking in the mind to make it so. If one knows that my mind can manifest being from non-being, then one knows that my mind can manifest non-being from being. But if one does not believe this, it will naturally not be numinous.\n\nSomeone asked: When perception is already clouded, who can avoid belief? He replied: Like a snake-catcher who does not fear snakes, though he may dream of snakes, he feels no terror. Thus the Yellow Emperor said: \"The Dao has no ghosts or spirits; it comes and goes alone.\"\n\nHe also said: Someone asked me: \"What is your clan name, your given name, your courtesy name? What do you wear, what do you eat?\"\n\n\"What friends, what servants? What zither, what books? What ancient, what modern?\" At that moment, I remained silent, not uttering a single word. When the questioner persisted without cease, I could not but reply: \"If you do not even see me, what use have you for what belongs to me?\"\n\nHe also said: Qi, as a thing, may gather or disperse. The reason I circulate qi is that it has never truly gathered, nor has it ever truly dispersed. That which gathers is born; that which disperses dies. But that which has never gathered nor dispersed knows neither birth nor death. Guests may come and go, yet the post station remains unchanged.\n\nHe also said: To confound the world’s wisest is not wisdom but folly; to exhaust the world’s eloquence is not eloquence but inarticulateness; to subdue the world’s bravest is not courage but timidity.\n\nHe also said: He who speaks little is not envied by others; he who acts little is not criticized by others; he who is sparing in wisdom is not wearied by others; he who is sparing in ability is not enslaved by others.\n\nHe also said: When speaking of a certain matter, one says it is beneficial, another says it is harmful, a third says it may be either, and a fourth says it is both beneficial and harmful—it must fall into one of these. But he who expounds the Dao does not speak.\n\nHe also said: Speaking of the Dao is like speaking of dreams. One who speaks of dreams says: \"Such gold and jade, such vessels, such birds and beasts.\" The speaker can describe them but cannot take them and give them; the listener can hear them but cannot receive and obtain them.\n\nOnly the adept listener remains unentangled, uncontentious.\n\nHe also said: The arts and methods in the world are manifold—some esteem obscurity, some clarity; some strength, some weakness. To cling to any is to engage in affairs; to cling to none is to abide in the Dao.\n\nHe also said: My Dao is like the sea—billions of gold cast into it vanish, billions of stones cast into it vanish, billions of filth cast into it vanish. It bears tiny shrimp and minnows, it bears great leviathans and whales. Gathering all waters to receive them, it is not full; dispersing all waters to divide them, it is not empty.\n\nHe also said: The people of the world number beyond reckoning. Each person’s dreams differ, and each night’s dreams differ. There are heavens and earths, humans and things, all shaped by thought—so numerous they cannot be counted as dust. How can we know that this present heaven and earth are not likewise shaped by some thinking being?\n\nHe also said: Those who die in the womb, those who die in the egg—these too are human, these too are things. Though heaven and earth are vast, they remain unaware. Those who calculate heaven and earth are but confined within their own perceptions. It is like a hand that does not touch the blade, a blade that does not wound the person.\n\nHe also said: That which has time is qi; that which is not qi has never known day or night. That which has direction is form; that which is not form has never known south or north. What is meant by \"not qi\"? That from which qi arises—like fanning a fan to produce wind. Before the fanning, there is no wind’s qi; once fanned, it is called qi. What is meant by \"not form\"? That from which form arises—like drilling wood to produce fire. Before the drilling, there is no fire’s form; once drilled, it is called form.\n\nHe also said: The sage does not differ from the multitude; it is merely that things cannot constrain him.\n\nHe also said: Abiding nowhere in oneself, yet form and things manifest of their own. In movement, it is like water; in stillness, like a mirror; in response, like an echo. Vague as if vanished, silent as if pure. Those who harmonize with it are at peace; those who grasp it lose it. Never preceding others, yet always following them.\n\nHe also said: The light and pure ascend with the hun-soul; the heavy and turbid descend with the po-soul. When hun and po are evenly balanced, one dwells among humans. Ascending hun is noble; descending po is base. Spirited hun is wise; oppressive po is foolish. Light hun is luminous; heavy po is dark. Soaring hun becomes feathered; sharp po becomes furred. Radiant hun is spirit; shadowy po is ghost. Their forms, their dwellings, their perceptions, their affinities—all correspond to the Five Phases.\n\nHe also said: Love is essence; contemplation is spirit. Though love and contemplation differ, both arise from perception. Only when love is without perception is it like the interlocking of a lock; when contemplation is without perception, it is like the illumination of a lamp. If my perception does not stir, what existence can I have?\n\nHe also said: From a single kernel, countless sprouts arise—who knows how many tens of thousands? Though heaven and earth are vast, they cannot sprout a kernel in empty space. From a single hen’s egg, countless birds arise—who knows how many tens of thousands? Though yin and yang are subtle, they cannot hatch an egg from a barren hen. Only that which comes to me can I gather in a single breath, transforming things into myself, so that nothing is not myself. As for the Five Phases—who can alter them?\n\nHe also said: Like a drumstick striking a drum—the drum’s form is my possession; the drum’s sound is my resonance. Though the stick has departed, the lingering sound remains, yet in the end, it too fades away. The drum’s form is like my essence; the drum’s sound is like my spirit; the lingering sound is like my hun and po. Knowing how it comes and goes in an instant—what have I to do with the qi of the Five Phases?\n\nHe also said: Know that this body is like a body in a dream, appearing as emotions dictate—then you may send forth your spirit to roam the Great Purity. Know that this thing is like a thing in a dream, appearing as emotions dictate—then you may concentrate your spirit to become that thing and traverse the Eight Wastes. This Dao—it can perceive spirit and prolong life, or forget spirit and transcend life.\n\nInhaling qi to nourish essence is like metal giving rise to water; inhaling wind to nourish spirit is like wood giving rise to fire—thus borrowing the external to extend spirit. Rinsing with water to nourish essence, so that essence does not exhaust; rubbing with fire to nourish spirit, so that spirit does not exhaust—thus borrowing the internal to extend spirit. As for forgetting spirit to transcend life, I have already spoken of it.\n\nHe also said: Those who calculate life and death say: death is already existent, or death is already nonexistent, or death is both existent and nonexistent; some say one should rejoice, some say one should fear; some say one should accept it, some say one should transcend it. The more perceptions shift, the more the mind races without cease. Yet they do not know that my life and death are like a horse’s hand or a cow’s wing—originally non-existent, and then not even non-existent. It is like water and fire: though they encounter each other, fire cannot burn them, water cannot drown them.\n\nHe also said: When things and I interact, mind arises—like two sticks rubbed together to produce fire. One cannot say it is in me, nor in the other; one cannot say it is not me, nor not the other. To cling to a division between self and other is folly.\n\nHe also said: Do not measure others by your own mind; measure them by their own mind. One who understands this can manage affairs, practice virtue, penetrate the Dao, engage with others, and forget the self.\n\nHe also said: You see those with serpent heads and human bodies, ox arms and fish scales, ghostly forms and avian wings—do not be astonished by these. Astonishment falls short of dreams; dreams fall short of waking. Having ears and eyes, hands and arms—this is even more astonishing. Great words cannot be spoken; great wisdom cannot be thought.\n\nHe also said: The eye sees itself but perceives no color; the ear hears itself but perceives no sound; the tongue tastes itself but perceives no flavor; the mind measures itself but perceives no thing.\n\nThe multitude chases the external; the worthy cling to the internal; the sage feigns them both.\n\nHe also said: People mistake the absence of knowledge and action for the absence of self, yet even with knowledge and action, this does not impair one’s true nature. The absence of self is like fire—restless and ceaseless, never possessing a self.\n\nHe also said: The wall is like the great sea, able to transform into countless dragons and fish, yet the water remains one. The self and the myriad things, lush and flourishing, exist within the great transformation—only their nature is one. One who knows this unity knows no person, no thing, no death, no life.\n\nHe also said: Water, sinking, condenses into the five essences; fire, soaring, disperses into the five odors; wood, flourishing, blossoms into the five colors; metal, firm, solidifies into the five sounds; earth, harmonious, nourishes into the five flavors. Their constancy is five, yet their transformations are incalculable. Their forms are five, yet their combinations are incalculable. Thus, the myriad things within heaven and earth cannot be rigidly called ten thousand, nor rigidly called five, nor rigidly called one; nor can they be rigidly called not ten thousand, not five, not one. Some unite, some separate—through this, form is determined, number is determined, qi is determined—yet all is but self-exertion. Things do not know me; I do not know things.\n\nHe also said: Birds and beasts now cry *you-you*, now *xun-xun*, now flee in haste; grasses and trees now sprout *zhuo-zhuo*, now stand *ting-ting*, now wither *xiao-xiao*. Heaven and earth cannot retain them; the sage cannot bind them—only the turning of fate sustains them. Presence lies there; absence lies here. A drum does not sound without a drumstick; evenness lies there, oddness lies here—a drumstick does not strike without a hand.\n\nHe also said: Though it is one thing, the multitude is deluded by its name, seeing things but not the Dao; the worthy dissect its principle, seeing the Dao but not things; the sage unites with heaven, seeing neither Dao nor things. The Dao is always the Dao—grasping it makes it a thing; not grasping it, it remains the Dao.\n\nHe also said: Those who once debated the Dao spoke of it as obstructing and vast, as profound and deep, as limpid and clear, as empty and unified, as obscure and luminous—beware of encountering such descriptions and retreating in fear. The supreme principle of the world utterly transcends words and concepts. Only when one knows it is beyond words and concepts, existing above subtle words and wondrous meanings, does one align with my teaching.\n\nHe also said: Affairs have their place in affairs; words have their principles. The Dao has no place in the Dao; words have no principles. Knowing that words have no principles, every word becomes the Dao. Not knowing this, even holding the most profound words becomes an obstruction, a veil.\n\nHe also said: People merely recognize that within false gains lies true loss, yet fail to see that within true gains lies true loss; they merely recognize that within false rightness lies true wrong, yet fail to see that within true rightness lies true wrong.\n\n*Tan Jing’s* *Shenghua Shu* states: The Dao’s descent unfolds thus—emptiness transforms into spirit, spirit into qi, qi into form, form into life, and thus the myriad things are filled. The Dao’s application unfolds thus—form transforms into qi, qi into spirit, spirit into emptiness, and emptiness illumined, the myriad things are made free. Thus, the ancient sages explored the origins of obstruction and freedom, grasped the source of creation and transformation, forgot form to nurture qi, forgot qi to nurture spirit, forgot spirit to nurture emptiness. Emptiness and fullness interpenetrate—this is called the Great Harmony. Thus, concealed, it is primordial essence; applied, it is the myriad spirits; contained, it is the Great One; released, it is the Great Clarity. Therefore, Kan and Li wax and wane within the body; wind and clouds issue forth from the seven orifices. True qi steams and rises, and the seasons know no cold or heat; pure yang flows and circulates, and the people know no death or life—this is the way of spiritual transformation.\n\nHe also said: Before the empty void, one sees the clod but not the void. Grinding the clod to seek the void, one sees the void but not the clod. Form does not hinder, yet people hinder themselves; things do not stagnate, yet people stagnate themselves. The dragon treads the empty void—void is not nothing. It can solidify metal and stone—metal and stone are not being. Being and non-being interpenetrate; self and things are the same. Its birth is not a beginning; its death is not an end. One who knows this Dao cannot be destroyed in form, cannot be lost in spirit.\n\nThe child plays with its shadow, unaware it is the shadow playing with the child. The madman mocks the statue, unaware it is the statue mocking the madman. The one who transforms the household does not know they are transformed by the household; the one who transforms the state does not know they are transformed by the state; the one who transforms the world does not know they are transformed by the world.\n\nEmptiness transforms into spirit, spirit into qi, qi into blood, blood into form, form into infancy, infancy into childhood, childhood into youth, youth into maturity, maturity into old age, old age into death, death back into emptiness, emptiness back into spirit, spirit back into qi, qi back into things. Transformation upon transformation is unceasing, like a ring without end. The myriad things do not desire life, yet cannot but live; they do not desire death, yet cannot but die. One who comprehends this principle may keep spirit from transforming, form from being born.\n\nNails and hair are part of my form, yet cutting nails causes no harm, severing hair causes no pain—for they lie beyond the reach of *ying* and *wei*. Thus, I am originally unharmed, yet sinews and bones harm me; I am originally without pain, yet flesh and blood pain me. Joy and anger do not arise from me; sorrow and happiness do not move me. I am obscured by form; form is cherished by me. One who comprehends this principle can transcend beyond birth and death.\n\nThe Most High is the spirit of emptiness and nothingness. Heaven and earth are the spirits of yin and yang. Humans and insects are the spirits of blood and flesh. What they share is spirit; what differs is form. Thus, form is not numinous, yet qi is numinous; qi is not numinous, yet sound is numinous; waking is not numinous, yet dreams are numinous; life is not numinous, yet death is numinous.\n\nWater, at its utmost clarity, congeals into ice that is no longer clear; spirit, at its utmost luminosity, congeals into form that is no longer luminous. When ice melts, clarity returns; when form scatters, luminosity returns. One who knows the truth of death may wander the capital of the Most High.\n\nThe void transforms into spirit, spirit transforms into qi, qi transforms into form—form and qi intermingle to produce sound. The ear does not listen to sound; sound comes to it of its own accord. The valley does not respond to echoes; echoes fill it of their own accord. The ear is a small aperture; the valley, a great one. A mountain ravine is a small valley; heaven and earth, a great valley. When one aperture resounds, ten thousand apertures all resound; when one valley hears, ten thousand valleys all hear.\n\nSound guides qi, qi guides spirit, spirit guides the void; the void contains spirit, spirit contains qi, qi contains sound. Guiding and containing one another, even the faintest hum of autumn mosquitoes or the ceaseless drone of flies reaches everywhere. From this we know that even the subtlest thought is perceived, and the faintest whisper is heard. Only the mechanism of the great person—neither heaven nor earth can see it, neither yin nor yang can know it, neither ghosts nor spirits can glimpse it.\n\nA block of wood, a foot square, placed upon the ground leaves ample room for a person to tread upon it. The same block, placed at the tip of a pole, leaves no room for a person to stand upon it. It is not the object that has grown larger or smaller, but the mind that has become empty or full. Thus, fanning a great heat only makes it hotter; fearing scorching pain only makes it more painful. People have no constant mind; things have no constant nature. From this we know that water can be made not to wet, and fire not to burn.\n\nThere are sea fish that use shrimp for eyes—people laugh at them. Yet they do not realize that the ancients used fireflies in bags as lamps, nor that without the sun’s light by day, one cannot travel, and without the candle’s light by night, one is deceived. They see the falsity of puppets but do not doubt themselves; they sigh for departed friends but do not grieve for themselves. Neither the wise nor the foolish understand—only those who embrace pure whiteness and nurture the Great Mystery avoid falling into its mechanism.\n\nThe mirror does not seek to reflect objects; objects come to it of their own accord. The bellows does not seek to contain qi; qi fills it of its own accord. Thus, the nose receives scents through emptiness, the ear receives sounds through emptiness, the eye receives colors through emptiness, the tongue receives flavors through emptiness. When the mind is as dark as the unseen depths, nothing is not received; when spirit is as void as nothingness, nothing is not known. Therefore, the great person seizes the mechanism and conceals the subtle.\n\nFeathered talismans are most strange; yin fluids are most wondrous. With them, one may guard a kingdom, rescue an age, or sit as the teacher of emperors and kings. Yet the world’s wise and foolish bustle about, laughing at moths that fly into night candles and flies that strike morning windows—knowing how to advance but not how to retreat, seeking profit while courting harm, unaware that profit gathers only to invite harm.\n\nTo be wise toward others but not toward oneself—what wisdom is that? To be learned in things but not in oneself—what learning is that? Thus, the great person forgets both profit and harm; what is there that cannot be concealed?\n\nWhat difference is there between birds and beasts and humans? They have nests and dens for dwellings, mates for pairing, the nature of parent and child, the feelings of life and death. The crow returns to feed its parents—this is benevolence. The falcon pities its unhatched young—this is righteousness. Bees have a ruler—this is propriety. The lamb kneels to nurse—this is wisdom. The pheasant does not mate twice—this is trustworthiness. Who has fully explored their ways? Among the ten thousand things, the Five Constants and a hundred virtues are all present. Yet humans cast nets and snares to teach them the pursuit of hunting and fishing.\n\nMoreover, burning their nests and dens is not benevolence. Seizing their loved ones is not righteousness. Offering them as sacrifices is not propriety. Teaching people cruelty is not wisdom. Causing the ten thousand things to harbor doubt is not trustworthiness. When the desire for rank odors does not cease, the mechanism of killing and harming does not end. Though birds and beasts have no words, they must depict us as ravenous wolves and giant boars. Though fish and shellfish have no knowledge, they must call us great whales and monstrous serpents. How can we be at ease? How can we not feel shame? Alas, one might suspect there have never been true noble persons.\n\nThose who rescue others and call it righteousness—people do not deem them righteous. Those who bestow kindness and seek repayment—people do not repay them. This is the nature of people: yield, and they take more; contend, and they take less. Approach them, and they leave; avoid them, and they come. Give to them, and they treat it lightly; cherish it, and they seize it. Thus, great righteousness has no form; great kindness has no image. When great righteousness is achieved, even the unknowing bear its burden; when great kindness is realized, even the ungrateful repay it.\n\nThose who can sing are heard by those who cannot; those who can dance are watched by those who cannot. The skillful are discerned by the unskillful; the worthy are employed by the unworthy. Those who tend trees must fell them; those who rely on scholars must lose them. They are ensnared with caps and robes, hooked with ranks and emoluments. Like horses harnessed to a carriage, their value is not for themselves; like swine fed on husks and chaff, their fatness is not their own.\n\nThus, the great person’s Dao is not vainly exalted; their virtue is not vainly preserved. In poverty, they have something to rely on; in retreat, they have something to depend on. Those who retreat do not delight in cold and lowliness and willingly cast themselves aside. Those who do evil fear being recognized—yet there are always those who recognize them. Those who do good desire to be known—yet there are always those who do not know them. Therefore, those unrecognized by others are called great evildoers; those unknown by others are called supreme goodness.\n\n*Master Wu’s Mystical Principles*\nThe Dao is the lineage of emptiness and nothingness, the root of creation and transformation, the origin of spirit and luminosity, the source of heaven and earth. Vast beyond all bounds, subtle beyond all interiors, boundless and without limit, dark and without counterpart. Profoundly obscure yet unable to be scrutinized, its great brightness sheds light; utterly still and without intent, yet the ten thousand things have their proper places. Vast and formless, silent and soundless—from it the ten thousand images arise, and the five notes are perfected. That which is born has its limit; that which is completed must wane. Birth and completion, completion and birth—unchanging from ancient times to the present.\n\nThis is called the Dao.\n\nVirtue is what heaven and earth receive, what yin and yang rely upon, ordered by the five phases, woven by the four seasons. Governed by lords, instructed by teachers, the hidden and the manifest, the moving and the still—all flourish in due measure. Its beneficence flows without end, yet grasses grow unaware of its merit; its grace extends without limit, yet the hundred clans know not their dependence on its power. This is called virtue.\n\nThus, that which pervades and gives life is called the Dao, yet the Dao inherently has no name. That which accumulates and brings to completion is called virtue, yet virtue inherently has no designation.\n\nLet us attempt to discourse upon it: Heaven and earth, humans and things, spirits and immortals, ghosts and gods—without the Dao, none could be born; without the Dao, none could be perfected. The born know not their beginning; the perfected see not their end. Who, delving into mysteries and seeking the hidden, has glimpsed its source? It enters the end of being, emerges before non-being, yet none fathom its traces—it is called the natural. The natural is the constant of Dao and virtue, the warp of heaven and earth.\n\n*On Dao and Virtue*\n\nBefore the great void, what was there in the boundless silence? Through the utmost essence’s stirring, the True One arises. The True One moves spirit, and primordial qi transforms of itself. Primordial qi is the being within non-being, the non-being within being—vast beyond measure, subtle beyond fathoming. Steaming and spreading, it thickens into boundless obscurity; the ten thousand images’ inception, their first signs, arise here. The qi of clarity, purity, and luminosity floats upward to become heaven. The qi of turbidity, stagnation, and dullness accumulates to become earth. The qi of harmony, gentleness, and compliance coalesces into human relations. The qi of discord, rigidity, and perversity disperses into miscellaneous kinds. From the nurturing of this single qi, myriad differences are sown and kinds divided. Once entering the mechanism of transformation, change knows no end.\n\nThus, the forms of heaven and earth, humans and things, are primordial qi. That which receives the numinous brilliance of heaven and earth, humans and things, is spirit. Therefore, Qian and Kun govern heaven and earth, while essence and soul direct humans and things. Qi undergoes the alternations of yin and yang, but spirit knows no change with cold or heat. Though the myriad movements intertwine beyond reckoning, perishing and reviving, ending and beginning again—yet the body of Dao and virtue, the mind of spirit, respond and perceive without exhaustion, never wearied in the realm of activity.\n\n*On Primordial Qi*\n\n**Essentials of the Chapters**\n\nHeaven and earth cannot exist of themselves; that which possesses heaven and earth is the Supreme Ultimate. The Supreme Ultimate cannot move of itself; that which moves the Supreme Ultimate is true essence. True essence is natural—only spirit, only luminosity. Without ancestor, without origin, without beginning, without end. It contains harmony and harbors compassion, pitying the vulgar and mourning the benighted. Clear and turbid receive different endowments; the true and the common are not the same. Descending qi divides its light, and thus humans are born within. The wise and enlightened, broad in understanding, take universal relief as their work. As rulers and leaders, they enable all things to flow freely.\n\nPure yang blazes above, and above the nine heavens there is no yin. Pure yin lies darkly below, and below the nine earths there is no yang. The steaming intermingling of yin and yang to generate the ten thousand beings occurs precisely between heaven and earth. Thus, the configurations of qi shift and communicate, obscurity and brightness take form. Yang is bright and upright—its essence is true numen. Yin is dark and perverse—its essence is demonic illusion. Therefore, those born with the endowment of yang’s numen are wise and sagacious; those nurtured by yin’s dullness are fierce and stubborn. Yang delights in life, so the wise and sagacious are necessarily kind and harmonious. Yin delights in killing, so the fierce and stubborn are necessarily perverse and violent. As for those who are sometimes good and sometimes not—these are the mediocre, born of the equal blending of the two qi.\n\nEach of these receives its own endowment—where, then, is instruction to be applied? Instruction is applied for the mediocre. Why? The wise and sagacious know without teaching; the fierce and stubborn, though taught, do not change—both receive the pure qi of yin and yang. It is like fire, which can be extinguished but cannot be made cold, or ice, which can be melted but cannot be made hot—the principle is thus.\n\nThat which gives me life is the Dao; that which endows me is spirit. Yet longevity or early death, departure or abiding, do not depend on oneself. Why? Because when nature moves, it becomes emotion; when emotion returns to the Dao, one is thus moved by the mechanism of transformation and cannot maintain control.\n\nTo transcend the realm of existence and non-existence, to dwell in the realm of self-attainment—one may take the Dao as teacher and spirit as friend. What does this mean? The Dao and spirit act without acting, and qi transforms of itself; they deliberate without deliberating, and things complete themselves. They enter the ranks of the myriad kinds yet emerge beyond the bounds of life and death.\n\nThus, the noble person rejects desires, dismantles cleverness, sees without color, hears without sound. Serene and pure, embodying harmony and spirit clear—void and equanimous, forgetting form—one unites with the utmost essence. This is called returning to one’s origin, reuniting with the Dao. Creation cannot fathom it; ghosts and spirits cannot know it—how much less can humans?\n\nOne who is attuned to the Dao, though soaring beyond the cosmos, remains ever at peace in heart; though resting within the finest hair’s breadth, qi moves of itself. Thus, if the heart is not at peace, there is nothing by which to unite with the Dao; if qi does not move, there is nothing by which to preserve form. When form is preserved and the Dao is united, this is the virtue of heaven and earth.\n\nTherefore, one who moves yet does not know movement has transcended movement. One who is still yet does not know stillness has emerged from stillness. One who has transcended movement cannot be reckoned by yang. One who has emerged from stillness cannot be shifted by yin. If yin and yang cannot alter it, how much less can the ten thousand things? Thus, one who is not enticed by things is called utmost stillness. Utmost stillness can unite with utmost emptiness. When emptiness reaches its limit, there is clarity; when clarity reaches its limit, there is luminosity; when luminosity reaches its limit, there is penetration. The penetrating one—though heaven and earth are vast and the ten thousand things abundant—cannot escape the mirror of a single square inch.\n\nThe Dao encompasses countless numbers yet is not great; it penetrates the tip of an autumn hair yet is not small. It precedes the void yet is not a beginning; it follows heaven and earth yet is not an end. It ascends through accumulated yang yet is not bright; it sinks into layered yin yet is not dark.\n\nFundamentally, there is no spirit—only when emptiness reaches its limit does spirit arise of itself. Fundamentally, there is no qi—only when spirit moves does qi transform of itself. Qi is originally without substance; when it congeals and accumulates, it forms shape. Shape is originally without sentiment; when it moves and functions, it harms one’s nature. Once shape is formed and nature is set in motion, one drifts ever farther from the Dao.\n\nThus, one drowns in the cycle of life and death, drifts amid yin and yang, and cannot halt of one’s own accord—not because the Dao exists while things perish. If the Dao can generate being from non-being, how could it not make being merge with non-being? When being merges with non-being, being does not perish.\n\nYin and yang unite, and thus humans are born. The hun-soul is the yang spirit; the po-soul is the yin numen. They bind the embryo, circulate qi, nurture the body, and construct its form. Yet if their power is not equally complete, each returns to its origin. Thus, when yin prevails, yang is exhausted and one dies; when yang prevails, yin is consumed and one becomes an immortal.\n\nGentleness, kindness, integrity, and purity belong to yang. Harshness, cruelty, jealousy, and impurity belong to yin. When the mind is tranquil and empty, yang harmony pervades; when intent is restless and desirous, yin qi enters. Understanding these two, when yang prevails and yin submits, is the beginning of long life.\n\nThe Dao does not desire a mind, for if there is a mind, true qi does not gather. Yet one should not forcefully forget the mind, for if the mind is forgotten, external demons take residence. Thus, when my mind does not incline, nothing is not upright; when thoughts attach to things, nothing is not perverse. The coming of perversity or uprightness lies within me alone.\n\nTherefore, advanced students who are negligent in maintaining mindfulness are overcome by the yin corpse; those who delight in diligent purity are overcome by the yang spirit. Those who alternate between negligence and diligence remain in unresolved conflict. Resolution lies in disciplined effort and steadfast conduct, in resolutely opposing indolence, so that concentration persists without interruption for even a moment. Those who endure in this practice will see the corpse dissolve and the spirit flourish—this is called yang prevailing. When yang prevails, one draws near the Dao.\n\nMoreover, when the body moves yet the mind is still, when the spirit is concentrated yet one’s traces shift—this is non-action. When one dwells in leisure yet the spirit is disturbed, when one sits in silence yet the mind wanders—this is action. Non-action brings order; action brings chaos. Though non-action is supremely easy, only those of utmost clarity can attain it.\n\nHeaven and earth practice non-action by day and by night; in non-action they are one, yet order and chaos differ—why? By day, non-action is luminous, so the host of yang appears and the multitude of yin submits; by night, non-action is obscure, so the multitude of yin moves and the host of yang rests. Thus, when a ruler is enlightened and practices non-action, loyal ministers advance, treacherous officials hide, and the world is ordered. When a ruler is benighted and engages in action, loyal ministers withdraw, treacherous officials take office, and the world falls into chaos.\n\nTherefore, the wise practice non-action with wisdom, while the deluded practice non-action in confusion. Wisdom aligns with the Dao; confusion merges with things. Advanced students sometimes feel elation, indulging in pride, reveling in their self-satisfaction, believing they can commune with true immortals and ascend to the celestial realms—this is the flourishing of spirit. Though the spirit flourishes, one must still guard against the dissipation of yang harmony and the encroachment of yin demons.\n\nOne should enter a quiet chamber, pacify the mind, suppress arising thoughts, and abide in stillness and single-mindedness—thus the spirit does not scatter, and yang numinosity remains whole. One must carefully avoid indulging in feelings of ease and joy, lest yin demons draw near.\n\nIf at times one feels restless, competitive, or agitated, this is the refining of the many po-souls within the body by the numinous qi of the spirit, as the accumulated stagnation of the yin corpse disperses and disturbs the true within the Crimson Palace. One should enter a quiet chamber, maintain a firm grip, and await the spirit’s clarity and the mind’s calm, uniting with emptiness and stillness—this too is a method for cleansing the mind.\n\nWords should not exceed actions; actions should not shame the heart. Persisting in such conduct, heaven and earth cherish one, divine spirits protect one, misfortune cannot befall, and ghosts and spirits cannot disturb.\n\nIf one’s words are pure yet actions are impure, if one’s reputation is spotless yet one’s traces are defiled—though shame is concealed externally, the heart is ashamed internally. Heaven and earth detest such a one; divine spirits punish them. Though they may strive mightily for the Dao, they cannot attain it.\n\nThus, it is better to endure slander from others than to incur heaven’s censure. Human slander can still be dispelled; heaven’s censure cannot be evaded. What the Dao most abhors are licentiousness, killing, yin treachery—these are truly easy to avoid. As for minor likes and dislikes, judgments of right and wrong, these are common human tendencies, yet most difficult to guard against.\n\nOne should not allow even the slightest matter to disturb the square inch of the heart. When thoughts are still and the spirit is at ease, demonic qi cannot enter; when my will is undisturbed, the perfected become my companions.\n\nSeeking praise and resenting slander—even the worthy and enlightened are not free from this. Yet if one examines oneself and finds no goodness yet receives praise, this is inauspicious; if one reflects and finds no fault yet is slandered, what harm is there?\n\nThe essence of yang is the hun-soul and spirit; the essence of yin is the corpse and po-soul. When the spirit prevails, one does good; when the corpse is strong, one does evil. Restraining evil and promoting good brings order; forgetting good and indulging evil brings chaos. With prolonged order, the corpse perishes and the po-soul is refined; with prolonged chaos, the spirit departs and the hun-soul dissipates.\n\nWhen the corpse perishes and the po-soul is refined, spirit and form unite to become an immortal. When the spirit departs and the hun-soul dissipates, the corpse and po-soul merge to become a ghost—this is the natural Dao.\n\nThe eye delights in seductive beauty, the mind values fame and reputation, the body favors light and fine adornments, the mouth craves rare and exquisite flavors, the ear enjoys beautiful sounds, the nose delights in fragrant scents. These six senses all corrupt virtue, harm one’s nature, and sever one’s spiritual root. Thus, if one possesses them, one should distance oneself; if one lacks them, one need not seek them.\n\nOnly clothing and food are daily necessities for people, yet even these are one of the pitfalls for Dao cultivators. Nevertheless, one should entrust the heart to natural processes, and there will be no lack of what one needs.\n\nMoreover, when heaven and earth generate birds and beasts, they still cover them with feathers and provide them with insects and grains—how much more so for humans? One must forget one’s pursuits and follow nature.\n\nWaking unites with yang, sleep merges with yin.\nExcessive waking strengthens the hun-soul; prolonged sleep fortifies the po-soul.\nThose with strong hun-souls belong to the living; those with robust po-souls belong to the dead.\nIf one consumes primordial harmony, purges rich flavors, and attains a state where spirit is clear and qi is crisp—even to the point of remaining awake day and night—nothing surpasses this goodness.\n\nWhen the human heart is left to its own devices for long, it becomes vast and forgets to return;\nwhen abruptly restrained, it leaps without root.\nLetting it roam obscures one’s nature; confining it wearies one’s spirit—how then can the Dao-seeker attain stillness?\nFor nature is fundamentally most serene, yet stirred by external stimuli.\nOnce habituated to movement, how can it suddenly find peace?\nHaving grown accustomed to movement and dispersal, one may instead cultivate stillness and tranquility.\n\nThus, those who cultivate stillness well become serene yet abundant;\nthose who do so poorly grow restless and achieve nothing.\nTherefore, when agitation arises, restrain it with calm;\nwhen deviance emerges, guard it with rectitude;\nwhen seeking begins, suppress it with relinquishment;\nwhen turbidity appears, clarify it with purity.\nLeisurely and carefree, neither desiring nor scheming—\nacting thus, abiding thus, hastening thus, wandering thus.\nWith long practice, external things grow dim while the inner spirit becomes luminous.\nWithout seeking stillness, one naturally attains it.\n\nThus, treading on frost marks the beginning of solid ice;\ncultivating stillness is the step toward uniting with the Dao.\nAs the ancients said: \"Accumulated habits become nature.\"\nThis is what they meant.\n\nSomeone asked: \"Many have sought immortality through the ages, yet few have attained the Dao. Why?\"\nThe answer: \"Among a thousand who study the Dao, one understands it;\namong a thousand who understand it, one aspires to it;\namong a thousand who aspire to it, one specializes in it;\namong a thousand who specialize, one persists long enough.\nThus, many study, but few succeed.\"\n\nAnother asked: \"Immortality is humanity’s highest beauty;\ndeath is humanity’s greatest evil.\nAll gentlemen know this, yet most follow convention while few cultivate immortality. Why?\"\nThe answer: \"There are two reasons.\nFirst, those whose endowment of qi is not lofty find their aspirations difficult to broaden.\nThus, they drown in immediate affairs, forget long-term vision,\nare submerged by sensual pleasures and deluded by desires,\nultimately entangled in the world’s net, never stepping into the realm of truth.\nSecond, though some possess pure and empty qi, with spirit and bearing refined and transcendent,\nif their merit in aiding others remains incomplete,\nthe path to immortality remains distant.\nThus, they linger in worldly ranks, unable to untie the celestial bonds.\"\n\nAnother asked: \"The Dao is originally formless, while immortality values form.\nTo unite the formed with the formless—how can this endure?\nWould it not be better to attain the wonder of preserving one’s nature while discarding form?\"\nThe answer: \"The Dao is utterly empty and boundless,\nencompassing spirit and moving qi, generating being from non-being.\nThus, the vast and obscure is the formless form of the Great Dao;\nheaven, earth, sun, and moon are the formed forms of the Great Dao.\nThe formless connects to the formed; the formed contains the formless.\nThus, heaven and earth endure forever, and immortals and sages never perish.\n\nLife is the great virtue of heaven and earth,\ndemonstrating the vastness of the six directions and the luminosity of the Three Origins—all because we possess form.\nOnce we succumb to dissolution, heaven, earth, and the myriad things no longer belong to us.\nDeath is the bitter poison of human relations.\nTherefore, refine the mortal to become immortal,\nrefine the immortal to become perfected,\nrefine the perfected to unite with the wondrous,\nunite with the wondrous to merge with the spirit.\nWhen spirit and Dao unite, the Dao becomes one’s body—\nthus ascending to Jade Capital, wandering in Golden Towers,\nable to be and not to be, neither ending nor perishing.\nHow can this be said to lack enduring principle?\n\nIf one mistakes attaining nature while neglecting the refinement of form as the ultimate wonder,\none becomes merely a clear and intelligent ghost—\nhow can this compare to the lofty immortals?\"\n\n*Collected Essential Sayings of the Immortals, Volume One Concluded*\n*Collected Essential Sayings of the Immortals, Volume Two*\n\nThe Reverted Origin Daoist Dong □ Chun’s Compilation\n*Master Xuqing’s Heart Discourse*\n\nThe heart is the origin of the ten thousand dharmas, the master of the nine apertures, the root of life and death, the source of good and evil. It comes into being alongside heaven and earth, governing the radiance of spirit. Some call it the True Lord, for it presides over the body as teacher and elder. Some call it the True Constant, for it transcends antiquity and modernity without decay. Some call it True Suchness, for it remains quiescent and unmoving.\n\nWhen activated, it pervades the six directions of emptiness; when abandoned, none know its whereabouts. Vast beyond measure, the cosmos lies within it; subtle beyond limit, it enters the tip of an autumn hair yet cannot be sought through form. This is what we call our fundamental heart, the original self before the empty kalpas.\n\nYet what, truly, is it? Vague and obscure, evanescent and elusive—it cannot be known through knowledge, nor grasped through perception. Forced to name it, we call it the Dao; forced to name it, we call it spirit; forced to name it, we call it nature; forced to name it, we call it heart. Only thus.\n\nBeholding it, how can one not exclaim its greatness! How can one not revere its preciousness!\n\nYet why do we revolve through birth and death without self-mastery? For when a single thought stirs within, the six senses flow outward—turning toward good or toward evil. Thus arise the retributions of heaven and hell, the karmic consequences, the endless cycles of the six realms of rebirth. How grievous! How lamentable!\n\nThe enlightened, however, are not thus. Through fasting and abstinence, they clarify their virtue in utmost sincerity; with the One True settled and limpid, ten thousand calamities dissolve. As *Laozi* says: *\"Attain utmost emptiness, abide in profound stillness; while the ten thousand things arise together, I observe their return.\"* The myriad things flourish, each returning to its root—returning to the root is called stillness, stillness is called reverting to life’s mandate. To revert to life’s mandate is called constancy; to know constancy is called illumination. Not knowing constancy, reckless action brings misfortune. What is called *constancy* endures beyond past and present without decay; what is called *recklessness* arises the moment a single thought stirs. *Zhuangzi* says: *\"Once you have become a thing, to return again to the root is difficult.\"* Is this not the way of the *Great Person*?\n\nFrom this point onward, be cautious in speech, moderate in diet, eliminate defilements, halt thoughts, still the heart, and guard the One. Embrace emptiness, tranquility, and non-action; withdraw the gaze, reverse the hearing; harmonize with light, merge with dust. A fleeting thought’s arising is the illness; its non-continuation is the cure. Fear not the thought’s arising—only the delay in awakening. *Wall.*\n\nIf thoughts arise, each morning reflect and order them. Having body and mind, why not act thus? In walking, standing, sitting, and lying down, let not a single moment pass without this practice. In the land of *Nothing-Whatsoever*, the realm of *Huaxu*, I shall wander.\n\n**Song of the Great Dao**\nThe Dao is not far—it dwells within the body.\nAll things are empty, yet nature is not.\nIf nature is not empty, harmonious *qi* abides;\n*Qi* returns to the primordial sea, and life knows no end.\n\nTo keep the spirit within the body unscattered,\nlet not a single thing linger in the numinous terrace.\nIf things remain in the heart, the spirit grows clouded,\ndraining true essence and wasting sinew and bone.\n\nSpirit governs *qi*, *qi* sustains form—\nno need for miscellaneous arts to attain long life.\nArts are easy, but the Dao is hard to encounter;\neven if encountered, few practice it single-mindedly.\nThus, of a thousand or ten thousand who study,\nscarcely one or two ever succeed.\n\nIf the spirit departs, draw it back;\nwhen the spirit returns to the body, *qi* naturally follows.\nPractice this morning and night,\nand the true embryo of the *Red Child* will naturally form.\n\n**Wang Chongyang’s *Fifteen Discourses on Establishing the Teaching***\n**Discourse on Sitting in Meditation**\n\nSitting in meditation does not mean merely straightening the body, closing the eyes, and stilling the gaze—this is false meditation. True meditation occurs in all twelve hours, whether walking, standing, sitting, or lying down, in every moment of movement. The heart remains steadfast as Mount Tai, unshaken and unmoving, sealing the four gates—eyes, ears, nose, tongue, and mouth—so that nothing enters from without or departs from within. This is true meditation. One who achieves this, though dwelling in the dust of the world, is already enrolled among the immortals. No need to seek afar—such a one is a sage in the flesh. After three years of such practice, the shell is shed, and one ascends as an immortal. With the elixir formed, the spirit roams the eight directions.\n\n**On Subduing the Heart**\n\nThe Way of subduing the heart is not stillness so profound that one is dull and silent, perceiving nothing of the myriad things, lost in darkness without inner or outer, devoid of the slightest thought—this is the heart in samādhi, not to be subdued. If the heart follows circumstances, rising and falling in confusion, chasing after beginnings and ends, this is the scattered heart, which corrupts virtue and power, harms the nature and the life, and must not be indulged.\n\nIn walking, standing, sitting, and lying down, one must diligently subdue the heart. To hear, see, sense, and know—these are already afflictions.\n\n**On Refining the Nature**\n\nRefining the nature is like tuning a zither: if the strings are too tight, they may snap; if too loose, they will not resonate. Only when tension is just right can the zither be played. It is also like forging a sword: too much steel makes it brittle, too much tin makes it bend. Only with the proper balance of steel and tin can the sword be wrought. Those who refine their true nature should embody these two principles.\n\n**On Transcending the Three Realms**\n\nThe Desire Realm, the Form Realm, and the Formless Realm—these are the Three Realms. When the heart forgets thoughts and cares, one transcends the Desire Realm. When the heart forgets all phenomena, one transcends the Form Realm. When the heart does not cling to emptiness, one transcends the Formless Realm. Departing these Three Realms, the spirit dwells in the land of immortals and sages, and the nature abides in the Jade Clarity.\n\nA poem says:\nAbandoning wakefulness to learn dullness,\nAt the place of non-doing, nothing is left undone.\nWorldly affairs are but this before the eyes,\nWhile thunder and wind pass unheard at the ear.\nThe feet wander where they will,\nThe single spirit ever follows the qi.\nAt times the four great elements grow drunk—\nI ask the blue sky: Who am I?\n\n**Inscription on Sitting in Forgetfulness**\n\nEver silent, the primordial qi remains unharmed;\nLess thought, the lamp of wisdom shines within.\nNo anger, the hundred vessels flow smoothly;\nNo vexation, the heart-ground is cool and clear.\nNo seeking, no flattery nor deceit;\nNo attachment, neither square nor round.\nNo greed is true wealth and nobility;\nNo impropriety fears even kings.\nTaste fades, the numinous spring descends of itself;\nQi settles, the true breath lengthens naturally.\nTouch, and the form perishes while the spirit roams;\nThought, and the dream departs while the corpse stiffens.\nQi leaks, the form returns to the thick earth;\nThoughts leak, the spirit hastens to the ghostly realm.\nOnly when the heart dies does the spirit live;\nOnly when the po is extinguished does the hun flourish.\nTurning things, the wondrous principle is inexhaustible;\nResponding to change, the true constant is never lost.\nSupreme essence hides in the indistinct;\nThe great image merges with the boundless.\nIf creation knew its compass and square,\nEven ghosts and spirits could not fathom its movements.\nNo drinking, no eating, no sleeping—\nThis is the true person’s sitting in forgetfulness.\n\n**Song of the Great Dao by Immortal Cao the Female Adept**\n\nI speak the truth to you all:\nLife has always been borne by the true breath.\nIlluminating the body, long life is empty yet not empty;\nThe numinous mirror embraces heaven and holds the ten thousand things.\nThe Supreme Polarity spreads its wonders, and humans obtain the One.\nHaving obtained the One, guard it well and never lose it.\nThe palace chambers are empty and tranquil, the spirit dwells of itself;\nThe numinous house is scorched, the blood and fluids wither.\nA single sorrow, a single joy, a single thought or care,\nA single indulgence, a single toil—these gnaw at the form.\nHarm at dawn, damage at dusk, deluded and unaware,\nThe spirit and essence scatter, with no place to rest.\nGradually worn away, slowly declining,\nThe primordial harmony is spent, and the spirit departs.\nThey say walking is meditation, sitting is also meditation—\nThe sage may be thus, but the common cannot.\nTender sprouts must be nurtured,\nFor the root-awareness is dim and easily shifts.\nWasting time without clearing the thorns,\nWho has heard of fine grain growing in a barren field?\nAfter nine years, the work is complete, the fire-tending sufficient;\nResponding to things without heart, the spirit transforms swiftly.\nThe heartless heart is the true heart;\nForgetting both movement and stillness is to leave desire.\nSpirit is nature, qi is life;\nWhen the spirit does not stray outward, the qi settles of itself.\nThese two things were originally close—who is closer?\nLose them, and what remains to grasp as the root?\nMerge them into one, then forget even the one—\nThen you may appear and disappear with the primordial transformation.\nPiercing metal and stone is no difficulty;\nSitting in liberation, standing in forgetfulness—swift as lightning.\nThis Dao is easy to know but hard to practice;\nForgetting the practice, the Dao is complete.\n\nDo not mistake breath-holding for the true task;\nCounting breaths or following diagrams—both are wrong.\nLately, lay down the toils of the external world,\nYet within, the heart is still entangled—what difference is there?\nObserve the infant in the womb—\nDoes it scheme in secret with a calculating heart?\nFocus the qi to achieve softness, the spirit lingers long;\nThe true breath comes and goes, naturally at ease.\nGently, sinuously, it returns to the primordial life;\nWithout drawing from the numinous spring, it flows of itself.\nThirty-six thousand days make the great work,\nThe nodes of yin and yang lie within.\nSteaming and fusing, the passes and vessels transform the sinews and bones;\nEverywhere, light shines, nothing is obstructed.\nThe Three Corpses depart the yin abode of the corpse;\nThe ten thousand nations come to pay homage at the Crimson Emperor’s palace.\nI ask the true person: Where have you come from?\nFrom the beginning, you were only in the numinous terrace.\nIn former years, clouds and mist deeply veiled you;\nToday, we meet, and the Dao’s path opens.\nThis is not the work of a morning or an evening—\nIt is my original true nature, not some technique.\nFirm as metal and stone in the cold of winter,\nRepelling yin demons with the power of wisdom.\nAll arises from emptiness and tranquility, returning to concentration—\nThis is the Land of Peace and Clarity in the realm of Hua Xu.\nWhat was first established as the root?\nAt the place of non-doing, nothing is left undone.\nImages in thought must be swept away;\nSpirit in dreams must be firmly held.\nNeither movement nor stillness is the great essential;\nNeither square nor round is the supreme Dao.\nRefining the primordial harmony within makes one true;\nSeeking breath without is never complete.\nIf the primordial qi does not abide, the spirit is not at peace—\nLike a worm-eaten tree with no roots, its branches and leaves wither.\nNo need to speak of tears, saliva, or essence and blood—\nTracing to the source, all are the same.\nThis thing has never had a fixed place;\nIt transforms with time according to the heart’s intent.\nIn the body, when moved by heat, it becomes sweat;\nIn the eyes, when moved by sorrow, it becomes tears.\nIn the kidneys, when moved by thought, it becomes essence;\nIn the nose, when moved by wind, it becomes mucus.\nFlowing and circulating, it moistens the entire body,\nYet in the end, it does not depart from the numinous water.\nThe numinous water is hard to describe—few recognize it—\nIt nourishes all things through the true qi.\nSimply know tranquility and non-thought,\nFast, quiet the heart, and moderate speech.\nA single taste of ghee and nectar,\nHunger and thirst vanish, the true simplicity appears.\nWhen the work is complete in time, you will be naturally free—\nAt first, the refining and cooking were truly arduous.\nYet within arduousness, there is no arduousness;\nLeisurely, one need only nurture the primordial spirit.\n\nHow then can the heart be made to rest,\nWhen at this point, capture or release lies wholly with the man?\nI now suffer within suffering—yet more suffering still—\nEating bark, clad in grass, solitary and still.\nThough the heart knows the Great Dao, it cannot be practiced,\nFor near fame and the body itself are grave maladies.\nBetter to cultivate in quietude with diligence,\nThan to strive anxiously for the Great Samādhi.\n\nThough form and spirit are said to be two and hard to unite,\nOne cannot complete destiny without first completing nature.\nCease chasing fame and profit,\nSever all worldly ties—then nothing remains to trouble you.\nResolute action lies with man—why linger?\nWho else can restrain or command me?\nWhat use are sky-high reputation,\nOr swift, polished compositions?\nFine robes and rich food hold no allure,\nWhat good are heaped jade and piled gold?\nClever craft and literary flourish,\nOnly obstruct the path of cultivation.\n\nLike thin mist or drifting smoke,\nIdle, they cling to falling blossoms and willow fluff,\nDrifting ethereal between heaven and earth,\nYet in the end, cannot become rain or dew.\nWhich is closer—name or self?\nHalf a lifetime spent in idle procrastination.\nOf late, cultivation relies on spirit and qi,\nYet if spirit and qi are unsettled, all toil is in vain.\nPity the fine foundation,\nA golden hall and jade chamber without a master.\nIf only the master could dwell long within,\nPlaced in emptiness and idleness—of what use?\nThe wondrous existence within non-being is hard to grasp,\nTo nurture the infant, one must cherish the mother.\nSeal away sharp eloquence, set aside cleverness,\nGather the spirit and feign foolishness.\nWith steadfast heart and single intent, follow the path ahead,\nFor the Great Dao will never betray man.\n\n*Returning to the True Collection*\n\nFor those who cultivate, if one awakens to the ground of the heart and applies effort, one must avoid discrimination. If discrimination arises, it belongs entirely to the realm of thought.\n\nWhat is effort applied to the ground of the heart?\nFirst, one must abruptly abandon all conditions,\nNext, extinguish self and others,\nEradicate greed and wrath completely,\nThe body like withered wood,\nThe heart like cold ashes.\nWithin and without undivided,\nAll observed as one body,\nLuminous and crystal-clear,\nThe numinous light appears of itself.\n\nThis numinous light is the light of spirit.\nLight is illumination.\nWhen the light of spirit illumines within, there is no darkness,\nAnd external states cannot invade.\nIf day and night the numinous light does not fade,\nNaturally, spirit settles and qi harmonizes—\nThis is true cultivation.\n\nAs *Zhuangzi* says: \"When the universe is at peace, it emits celestial light.\"\nThis celestial light is the functioning of the Dao of spirit.\nOnce celestial light descends,\nYin and yang interact,\nThe purest essence is released,\nLike the sea surging with rolling waves,\nA single qi ascends to the Mud Pill Palace,\nWith a thunderous crack,\nAll gates and spirit cavities open fully—\nThis is the arrival of the numinous light.\nNaturally, the five viscera generate harmony,\nThe heart channel wells upward,\nThe tongue produces sweet nectar,\nThe nose detects rare fragrances,\nAppetite gradually diminishes.\nRefining with fire and timing, the dross in the intestines and stomach is expelled,\nClearing the turbid and retaining the pure,\nReversing yin and restoring yang,\nPrimordial qi fills the abdomen,\nEnabling abstention from food,\nAll yin dissipates entirely.\n\nAs the Most High said: \"Simply ingest primordial harmony to dispel the five grains.\"\nWhen such signs appear,\nOne must not treat body and mind lightly,\nNor let the spirit of wisdom leap exuberantly,\nNor allow the heart to grow lax,\nNor engage in idle discourse on the profound and wondrous.\nIf harmony scatters,\nAnd prior merit is not carefully preserved,\nLosing constancy,\nOne will be secretly reproved by sages and worthies.\n\n*On Recognizing the Heart and Awakening to Nature*\n\nFor those who wish to cultivate,\nFirst recognize the heart, recognize thought,\nThen awaken to nature.\nWhat is the heart?\nWhat is thought?\nThat which can perceive is called the heart,\nThe myriad thoughts and reflections are called thought.\nThought arises from念,\nThe heart arises from objects.\nOnce the root of arising is known,\nIt lies solely within the square inch.\nThis square inch is the original true heart.\nThe heart is originally without heart,\nThought is originally without thought.\nYet from long familiarity, past states are hard to forget,\nThe heart floats, thought stirs,\nObscuring true nature, preventing its radiance.\nOne must settle the heart and stabilize thought,\nInwardly observe the heart—serene and unmoving—\nThis is called *ding*;\nWithin *ding*, awakened awareness is called *hui*.\n*Ding* is the essence, *hui* is the function.\nWhen *ding* and *hui* are both complete,\nDaily practice remains unbroken.\n\n*On the Dharma Realm*\n\nThe dharma realm is the great void,\nIt is the great nothingness,\nEmpty, still, and without form.\nIf we speak of a year,\nIt is the eleventh month, when yang builds at *zi*,\nYang light falls to earth,\nSinking beneath the nine springs,\nBelonging to the northern *ren* and *gui* water.\nAll things vanish,\nUtterly dark and traceless,\nVague and formless—\nThe *Yijing* calls this \"mountain and water veiling.\"\nAbove is mountain, below is water,\nWater and fire unjoined, awaiting their time—\nThis is called \"youthful veiling.\"\n\nIf we speak of a month,\nTo distinguish the dark and new moon phases,\nThe moon’s end is called *hui*,\nWhen the sun refines the yin essence completely,\nSun and moon share the same crucible,\nLight is unseen,\nAll images vanish,\nYet within, the yin essence receives a speck of true embryo from the great yang,\nDim and obscure,\nHushed and silent,\nLike the Supreme Ultimate unseparated,\nThe Two Modes undivided—\nWithin lies the image of layered veiling.\n\n*On the Two Carts Transporting*\n\nThe goat cart carries fire,\nThe deer cart carries water.\nThe goat and deer carts travel between the three palaces,\nUp and down without cease.\nThe upper field returns to the middle field,\nThe middle field returns to the lower field,\nThe lower field returns again to the upper field,\nThe upper field returns to the qi sea,\nJoining with true qi,\nThe three matters gather,\nThen fire is rekindled.\nThis is the fire timing of the celestial cycle,\nCalled the great ox cart,\nAccumulating and refining the golden body.\n\nBeyond the three carts, there is another—\nCalled the broken goat cart.\nSome cultivators,\nIn accord with heart and thought,\nImpatient and excessive,\nYin and yang unceasing,\nDream of heaven collapsing and earth splitting,\nSmashing the goat cart,\nThe body unwell,\nLimbs weak,\nIllness arises,\nThe heart becomes demonic.\nOr seeing demons and ghosts,\nThe spirit confused,\nAdvancing and retreating erratically,\nEntering deviant paths,\nUnable to attain the true.\n\n*White Jade Vows: Revealing the Secrets of the Mysterious Pass*\n\nA single word or half a phrase may penetrate the mystery—\nWhy pore over ten thousand scrolls of alchemical scriptures?\nIf one is not burdened by the form of the body,\nBefore one’s eyes lies the Great Heavenly Net.\n\nTo refine qi and congeal spirit,\nOne must recognize the return to the root and restoration of life.\nThus the Dao speaks of returning to the root,\nFor the root has its own aperture.\nRestoring life means seeking the Gate of Life-Restoration—\nConsider this very gate and aperture.\nIf one grasps the true reality,\nThen returning to the root and restoring life is no difficulty.\n\nHence it is said:\nWhoever seeks the immortal’s secret\nNeed only search for the root of creation.\nOf old, Emptiness gave rise to the spontaneous,\nThe spontaneous gave rise to the Great Dao,\nThe Great Dao gave rise to the One Qi,\nThe One Qi divided into yin and yang,\nYin and yang became heaven and earth,\nHeaven and earth gave birth to the myriad things—\nThis is the root of creation.\nThis is the True One Qi,\nPrior to all phenomena,\nThe Great Void, the Utmost Non-Being,\nThe Great Emptiness, the Utmost Mystery.\nVast and obscure, beyond measure by inches;\nBoundless and expansive, beyond reckoning by shores.\nIts greatness has no exterior,\nIts smallness has no interior.\nIt encompasses heaven and earth,\nYet enters the tip of a hair.\nAbove, it has no further hue;\nBelow, it has no further abyss.\nA single thing, round and luminous,\nManifesting through the ages—\nUnnameable, yet the sage intuits it with the heart,\nAnd, compelled, names it the Dao.\n\nThus we know the heart is the Dao itself.\nWithout heart, one merges with the Dao;\nWith heart, one strays from the Dao.\nThis single word *wu* (non-being)\nEmbraces all existence without remainder,\nGives birth to the myriad things without exhaustion.\nThough heaven and earth are vast,\nThey can command the formed,\nBut not the formless;\nThough the Five Agents are most refined,\nThey can command the numbered,\nBut not the unnumbered;\nThough the hundred thoughts surge,\nThey can command the conscious,\nBut not the unconscious.\n\nNow, for those who cultivate this Dao,\nIt is best to first refine the form.\nThe subtlety of refining form lies in congealing spirit;\nCongeal spirit, and qi gathers;\nQi gathers, and the elixir forms;\nThe elixir forms, and the body is firm;\nThe body is firm, and spirit is whole.\nThus Song Qiqiu said:\nForget the form to nourish qi,\nForget qi to nourish spirit,\nForget spirit to nourish emptiness.\nThis single word *forgetting*—\nIt is the absence of things.\nOriginally, not a single thing exists—\nWhere could dust alight?\nThis is what is meant.\n\nIf one comprehends this principle\nAnd takes *forgetting* as the work,\nOne may enter the profound subtleties of the Great Dao,\nSeize the wondrous functioning of spontaneity,\nEstablish the foundation of the elixir in an instant,\nAnd circulate creation within the body.\nYet this Dao, when seen, appears desolate and nothing is perceived;\nWhen heard, it is obscure and nothing is heard.\nOnly with the heart can one see its images,\nOnly with the heart can one hear its sounds.\nIf the adept stills the heart and congeals spirit,\nAttains emptiness and guards quiescence,\nThen the empty chamber generates brightness—\nTruly, it is the spontaneous.\n\nOnly the Most High, in delivering beings,\nTeaches refinement:\nTaking heaven and earth as the crucible,\nThe sun and moon as the medicinal substances,\nThe rising and sinking of the sun’s essence corresponding to the ascent and descent of qi,\nThe waxing and waning of the moon’s spirit corresponding to the ebb and flow of vitality,\nThe seasons of the four quarters corresponding to the hours of a day,\nThe stars of the celestial revolution corresponding to the transformations within the furnace.\n\nThus, gathering spirit as the medicine,\nRefining it with the fire of stillness and concentration,\nOne forms the Great Return Elixir of Golden Liquor.\nFor the union of true yin and true yang,\nThe pairing of one water and one fire,\nOne must first distinguish floating and sinking,\nThen clarify host and guest,\nDiscern the operation of withdrawal and addition,\nAnd examine the safety and peril of return and reversal.\nThus Gao Xiangxian said:\nThere is a day for gathering,\nA time for taking.\nHai Chan said:\nThe mechanism of creation opens and closes heaven and earth,\nForging a furnace of true sun and moon.\n\nThose who awaken to this\nEmulate the functioning of sun and moon,\nAnd share the achievement of heaven and earth.\nHow could they know that heaven nourishes without form,\nEarth nourishes without substance?\nThus heaven endures and earth persists,\nThe sun shines and the moon glows,\nThe True One abides forever,\nAnd emptiness does not decay.\n\nNow, I model myself upon this:\nNo heart for affairs,\nNo affairs for the heart.\nInwardly observe the heart—\nThe heart has no heart;\nOutwardly observe the form—\nThe form has no form;\nObserve things afar—\nThings have no things.\nKnow the heart as no-heart,\nKnow the form as no-form,\nKnow things as no-things,\nTranscend the myriad illusions,\nAnd emerge as the solitary numinous.\nThe ancient scripture says:\nIt gives me birth in emptiness,\nIt leads me to non-being.\nThus one should return to the primordial root of nature,\nRevert to the time before birth.\nHide the heart within the heart, yet the heart is not seen;\nHide spirit within spirit’s penetration, yet spirit does not emerge.\nThus one may penetrate the three times,\nSettle the myriad conditions,\nPurify the six senses,\nAnd the square inch of the heart becomes empty and luminous.\nNot clinging to emptiness,\nNot clinging to non-being,\nEmptying all that can be named,\nEliminating all that is without—\nUntil emptiness is empty of emptiness,\nAnd non-being is non-being of non-being,\nPure, bare, and utterly unadorned—\nThen the numinous alone abides.\n\nThe Dao does not desire emptiness,\nYet emptiness naturally returns to it.\nIf one can empty the heart,\nThe Dao naturally returns to one.\nThe Dao originally has no name;\nIt cannot be grasped when near,\nNor abandoned when distant.\nIt is neither square nor round,\nNeither inside nor outside—\nOnly the sage knows it.\n\nThe three poisons have no root,\nThe six desires have no seed.\nSuddenly awakening to this principle,\nOne returns to emptiness and non-being.\n*Laozi* said:\nBetween heaven and earth,\nIs it not like a bellows?\nEmpty yet inexhaustible,\nThe more it moves, the more it produces.\n\nIf, within stillness and concentration,\nOne embraces the qi of harmonious balance,\nAnd guards the essence of the True One,\nThis is sealing the furnace and securing the crucible\nTo enact the fire timing.\nFire originates from the southern *li* trigram,\nWhich pertains to the heart—\nThe heart is spirit, spirit is fire.\nQi is the medicine;\nRefining the medicine with fire forms the elixir—\nThus it is using spirit to guide qi and accomplish the Dao.\n\nIf one can grasp the sun and moon in hand,\nHold the primordial chaos in the heart,\nOne naturally perceives the opening and closing of the bellows,\nThe ascent and descent of the river chariot,\nWater irrigating the Palace of Life,\nFire nourishing the Elixir Terrace,\nMetal and fire intermingling, water and earth harmonizing,\nThe maiden riding the dragon,\nThe old man straddling the tiger,\nPassing through the three barriers,\nAscending to the inner court,\nTransforming into jade mercury,\nDescending into the multi-storied tower—\nWithin it lies a cavity,\nCalled the Elixir Terrace.\n\nLead and mercury unite, water and fire merge—\nThe movement of movement arises from stillness,\nThe action of action emerges from non-action.\n\nAt this moment,\nWhite snow blankets the sky,\nYellow sprouts carpet the earth,\nDragon hums, tiger roars,\nHusband sings, wife follows,\nThe jade crucible simmers,\nThe golden furnace blazes,\nThunder crashes, lightning flashes,\nShaking heaven and earth,\nAll meridians tremble,\nThe three barriers open wide,\nThe mysterious pearl takes form,\nThe Great One returns to truth,\nWinds stir in the Mud Pill Palace,\nMoonlight fills the Crimson Palace,\nMists warm the Elixir Field,\nWaves in the Valley Sea grow still—\nRefining the returning elixir\nIs as easy as turning one’s palm.\n\nSeven reversions, nine returns—\nOnly then is the great medicine complete.\nRefined by day, simmered by the hour,\nUntil ninefold transmutation is achieved,\nThe celestial gate and earthly axis\nLie within one’s grasp.\n\nAs the scripture says:\n*If one can abide in constant clarity and stillness,\nHeaven and earth all return to them.*\n\nThus the three flowers gather at the crown,\nThe five qi converge at the origin,\nOne may enter the gate of myriad mysteries,\nThe profound beyond the profound.\n\nIf one further cultivates the spirit banner by day\nAnd nurtures the fiery zhi by night,\nWarming the sacred embryo,\nForming the crimson child—\nThen, through embryonic transformation and divine alchemy,\nReverting yang and renewing the bones,\nOne safeguards the spirit with the jade talisman,\nRefines the body with golden liquid,\nUntil form and spirit are both perfected,\nAnd merge with the true Dao.\n\nZhang Ping Shu said:\n*All this takes but a moment’s effort,\nYet secures boundless ease and joy.*\nTruly, these are wise words.\n\nFor the foundation of the Dao,\nThe root of virtue,\nThe origin of dragon and tiger,\nThe ancestor of lead and mercury,\nThe convergence of the three fires,\nThe return of the eight waters,\nThe gate where all spirits gather,\nThe source of the golden elixir’s wondrous work—\nThis is the pivotal aperture of returning to the root and restoring life.\n\nOnce this is known,\nDesires need not be banished—\nThe heart grows still of itself.\nThe heart need not be clarified—\nThe spirit grows clear of itself.\nWith no thought arising,\nAll illusions subside.\nThe body rides the whirlwind,\nThe spirit roams the ethereal void.\n\nOnly then does one realize:\nThe breeze’s clarity, the moon’s purity\nAll reveal the foundation of lead and mercury;\nThe green of water, the blue of mountains\nAll disclose the essence of tiger and dragon.\n\nBai Zi Qing of Hainan,\nWho first learned the elixir method from Chen Ni Wan,\nWould at the winter solstice at high noon\nOpen Qian and break Xun,\nRetain Kun and block Gen,\nGrasp the celestial pivot,\nWield the Dipper’s handle,\nPay homage to the Xuanyuan,\nPass the Fusang,\nEnter the Guanghan,\nFace the Quail’s Tail,\nRaise the Yellow Bell,\nSail the sea raft,\nAscend Kunlun,\nBear the Tang talisman,\nShake the celestial thunder,\nWander Wu Mountain,\nSummon the Yellow Lad,\nCall the Vermilion Child,\nTake the green dragon’s liver,\nThe white tiger’s marrow,\nThe red phoenix’s blood,\nThe black turtle’s essence,\nPlace them in the earthen crucible,\nAwaken the Fire Star,\nCommand Guan Bo,\nTransform cinnabar,\nOpen the Flower Pool,\nAbsorb the divine water,\nDrink the medicinal spoon,\nMove from non-being into being,\nFrom formlessness into form,\nWithdraw lead and replenish mercury,\nForming the sacred embryo.\nAfter ten months,\nQi is full, form is complete,\nA body exists beyond the body—\nThis is called the embryonic immortal.\n\nIts secret states:\n*With undivided focus, one may concentrate the spirit;\nWith an ashen heart in profound stillness,\nThe golden elixir forms within.*\nSuch is what I have attained.\n\nMaster Shi Jianwu says:\nQi is the medicine that adds years to life,\nThe heart commands the spirit of qi.\nWhoever grasps the secret of circulating qi\nIs already an immortal.\n\nThis verse is concise yet profound, penetrating the mysteries to their subtlest depths. Thus, I carry it upon my person and recite it, naturally arriving at the realm where the autumn moon graces the sky and the void dissolves into nothingness. Only those who are like withered trees or cold springs can comprehend this. Having attained this knowledge, I cannot remain silent.\n\nThe Supreme Mysterious Statutes state:\nTo meet someone and not transmit is to lose the Dao of Heaven;\nTo transmit to the unworthy is to leak Heaven’s treasure.\nThough I have searched to the ends of the earth, I find no one—\nI dare not lightly transmit it, lest I incur Heaven’s punishment.\n\nDeeply concerned that the Great Dao may go untransmitted and the cinnabar classics may fade into oblivion, I compose the *Treatise on Revealing the Mysteries of the Mysterious Pass*. This is to enlighten this world, instruct later generations, and preserve the lineage of the golden elixir.\n\nYet fearing that people may still remain ignorant of this principle, I further explain:\nWith the eye, see the eye;\nWith the ear, hear the ear;\nWith the nose, regulate the nose;\nWith the mouth, seal the mouth.\nConcealment and soaring flight lie within the single heart.\n\nFirst, one must practice stillness and concentrate the spirit,\nCurb anger and restrain desire—\nThen water and fire achieve harmony,\nAnd metal and wood unite.\nWhen metal and wood unite,\nThe true earth returns to its place.\nWhen the true earth returns to its place,\nThe golden elixir naturally grows as large as a millet grain.\nConsuming one pellet daily,\nThe spirit and qi will once more fill Heaven and Earth.\n\nAs Mencius said: *\"This is what it means to well nurture my vast and flowing qi.\"*\nLet the seeker reflect upon this.\n\nRespectfully inscribed and bestowed upon Liu Ziyuan.\n—The Straightforward Words of Perfected Man Ma Danyang\n\nSever emotions, eliminate desires, and subdue the heart-mind.\nCease meeting with relatives, and do not let the heart-mind wander.\nIn walking, standing, sitting, or lying—even in carrying firewood or drawing water, or when relieving oneself—maintain a settled heart-mind, thoughts stilled, serene and unshaken: this is the true heart-mind.\nSeek quietude, still the heart-mind, speak little, and keep good company.\nDo not generate thoughts, for thoughts are the root of karmic action.\nIf nothing enters from without and nothing issues from within, and if speech is sparse, the heart-mind will naturally settle and qi harmonize.\nIf one does not purify the heart-mind and still thoughts, sever desires and cut off emotions, but instead allows external distractions to enter and internal impulses to exit, wandering abroad—how can natural breath-regulation be achieved?\nSuch a person is but an empty dwelling, and what departs is none other than the monkey and horse.\n\nSince ancient times, all immortals have never dared to transgress the two words: *clarity* and *serenity*.\nMoreover, the heart-mind must not chase after external things.\nFirmly seize the heart-monkey to ensure the elixir remains without leakage,\nConstantly restrain the intent-horse so that inherent nature becomes luminous.\n\nMaster Zuo Yuan said:\n*\"That which moves is the heart-mind; that which arises is thought; that which departs is intent.\nWhen the heart-mind is clear and intent is settled, self and other are both forgotten—serene and still.\nOnly the single nature responds to phenomena.\nAll is the heart-mind perceiving things; one must not obscure this single nature.\nIf one sees only things and not nature, one clings to the margins and cycles through rebirth.\"*\n\nHe also said:\n*\"Only because one sees things and not nature does one obscure everything.\nIn walking, standing, sitting, or lying, one must only subdue the heart-mind,\nSo that the single nature remains ever-present and unobscured.\"*\n\nTo still thoughts is to constantly awaken to the fact that all worldly thoughts are the root of karmic action.\nOne must purify and still this single nature, illuminating and dissolving the ten thousand conditions—all illusions.\nThoughts should be fine and subtle, so refined that they do not arise.\n\nSomeone asked: *\"What does it mean to respond to phenomena without obscuration?\"*\nThe answer: *\"Though the ears and eyes hear and see, and the mouth speaks, the heart-mind must not cling to them.\"*\n\nAnother asked: *\"Where is the unfathomable realm of spirits and gods?\"*\nThe answer: *\"It is precisely that state of utter emptiness and stillness.\"*\n\nYet another asked about the *\"Gate of the Mysterious Female, called the root of Heaven and Earth.\"*\nThe answer: *\"The Mysterious is the father; the Female is the mother.\nEach person possesses eight ounces, which together make one catty.\nA single spark of primordial yang qi is the root itself.\"*\n\nSomeone asked about *\"returning to life and reverting to the root.\"*\nThe answer: *\"One must only ensure the heart-mind does not chase after external things, remains unstained and unattached, the heart-mind unaroused, qi undispersed—this is reverting to the root.\nIf one cannot do this, one does not return to the root.\"*\n\nAnother asked: *\"What is seeing nature?\"*\nThe answer: *\"It is that state of no heart-mind, no thought, not clinging to a single thing—serene and still, like the moon in the sky.\"*\n\n*—The Essential Sayings of the Immortals, Concluded*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "群仙要语纂集 经名：群仙要语寨集。 元末明初环士董汉醇编。 二卷。 底本出处：《正统这藏》正一部。 群仙要语纂集上 还初道人董汉醇编 日用缺 夫臼用者，饮食则定禁口，端坐莫起一念，万事俱忘奉存神定意。 眼不视物，耳不听声，一心内守，调息绵绵，渐渐呼出，莫教间断，似有如无，自然心火下降，肾水上升，口裹津生，灵真附体，得至长生之路也。 十二时中，常要清静。 一念不起谓之清，灵台无物谓之净。 身是气之宅，心是神之舍。 意行则神行，神行则气散，神聚则五行真气结成刀圭，自然身中有身，冲和气透，醍醐灌顶。 行住坐卧，常觉身体如风之行，肠中如雷之呜。 耳总仙音，无弦之曲，不言而自声，不鼓而自呜，神气交结，男儿回转，得观内景，能自言语，见虚无之事，与圣同居，神自出入，天地齐寿，脱离生死矣。 莫教有损，十二时中，常要清静。 神是气之子、气是神之母，如鸡抱卵。 存神养气，能无离乎。 妙哉妙哉！ 关尹子节要 关尹子曰：非有道不可言，不可士黄即道。 非有道不可思，不可思即道。 言之如吹影，思之如缕尘。 圣智造迷，鬼神不识。 又曰：不知道妄意卜者，如射覆盂。 高之者曰存金存玉，中之者曰存角存羽，卑之者曰存瓦存石。 是乎非是乎？ 唯置物者知．之。",
      "translated_text": "**Anthology of Essential Sayings of the Immortals**\n*Title:* *Anthology of Essential Sayings of the Immortals*. Compiled by Dong Hanchun, a reclusive scholar of the late Yuan and early Ming dynasties. Two fascicles. Source text: *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n**Anthology of Essential Sayings of the Immortals, Fascicle One**\nCompiled by Dong Hanchun, the Return-to-the-Origin Daoist\n\n**Daily Practice**\nIn daily use, one must observe dietary restraints and sit upright without a single stray thought, forgetting all worldly affairs to preserve spirit and settle the mind. The eyes should not gaze upon objects, the ears should not heed sounds—guard the heart within, regulate the breath in an unbroken stream, exhaling gradually without interruption, as if present yet absent. Naturally, the heart’s fire descends, the kidneys’ water ascends, and saliva is born in the mouth. The numinous true self attaches to the body, and the path to longevity is attained.\n\nThroughout the twelve hours, one must remain pure and still. \"Pure\" means no thought arises; \"still\" means the spirit terrace is empty. The body is the dwelling of qi, the heart the abode of spirit. Where intention moves, spirit moves; where spirit moves, qi scatters. When spirit gathers, the five phases’ true qi coalesces into the elixir pellet. Naturally, a body arises within the body, and the harmonious qi surges through, like ghee pouring over the crown. In motion and stillness, sitting and lying down, one should always feel the body as light as the wind’s passage, the intestines rumbling like thunder. The ears catch immortal melodies, music without strings—soundless yet resonant, drumless yet resounding. When spirit and qi intertwine, the male principle reverses its course. One beholds the inner landscape, speaks spontaneously, perceives the formless, and dwells among the sages. Spirit moves freely in and out, and one’s lifespan aligns with heaven and earth, transcending birth and death.\n\nDo not allow any harm. Throughout the twelve hours, remain pure and still. Spirit is the child of qi, qi the mother of spirit—like a hen brooding her egg. In preserving spirit and nurturing qi, how could they ever part? Wondrous! Most wondrous!\n\n**Excerpts from Master Guan Yin**\nMaster Guan Yin said: Without the Dao, speech is impossible; yet what cannot be spoken *is* the Dao. Without the Dao, thought is impossible; yet what cannot be thought *is* the Dao. Speech is like blowing on a shadow; thought is like grasping at floating dust. Even sages and wise men become deluded—ghosts and spirits cannot fathom it.\n\nHe also said: Those who do not know the Dao yet recklessly divine with intent are like archers shooting at an overturned vessel. The lofty claim to \"preserve gold and jade\"; the mediocre, \"horns and feathers\"; the base, \"tiles and stones.\" Is this so or not? Only the one who placed the object knows.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 513,
      "start_sentence": 0,
      "end_sentence": 28,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.981867551803589,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\群仙要语纂集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "又曰：道终不可得，彼可得者，名德不名道。 道终不可行，彼可行者，名行不名道。 圣人以可得可行者，所以善吾生； 以不可得不可行者，所以善吾死。 又曰：一情冥为圣人，一情善为贤人，一情恶为小人。 一情冥者，自有之无，不可得而示。 一情善恶者，自无起有，不可得而秘。 一情善恶为有知，惟动物有之。 一情冥为无知，普天之下，道无不在。 又曰：一灼之火，能烧万物，物亡而火何存。 一息之道，能冥万物，物亡而道何在。 又曰：吾道如处暗。 夫处明者不见暗中一物，而处暗者能见明中区事。 又曰：连不问豆，豆不答迟。 瓦不问石，石不答瓦。 道亦不失，问欤答欤。 一气往来，道何在？ 又曰：一运之象，局乎太空，自中而升为天，自中而降为地。 无有升而不降，无有降而不升。 升者为火，降者为水，欲升而不能升者为木，欲降而不能降者为金。 木之为物，钻之得火，绞之得水。 金之为物，击之得火，镕之得水。 金木者，水火之交也。 水为精为天，火为神为地，木为魂为人，金为魄为物。 运而不已者为时，包而有在者为方，惟土终始之。 又曰：天地虽大，有色有形，有数有方。 吾有非色非形、非数非方、而天天地地者存。 又曰：梦中、鉴中、水中，皆有天地存焉。 欲去梦天地者，寝不寐； 欲去鉴天地者，形不照； 欲去水天地者，盎不汲。 彼之有无，在此不在彼，是以圣人不去天地，去识。 又曰：天地寓、万物寓、我寓、道寓，苟离乎寓，道亦不立。 又曰：行虽至卓，不离高下； 言虽至公，不离是非； 能虽至神，不离巧拙； 貌虽至殊，不离妍丑。 圣人假此以示天下，天下冥此乃见圣人。 又曰：道无体，以道应世者，是事非道。 道无方，以道寓物者，是物非道。 圣人竟不能出道以示人。 又曰：鲫蛆食蛇，蛇食鼃，鼃食螂蛆，互相食也。 圣人之言亦然。 言有无之弊，又言非有非无之弊，又言去非有非无之弊，言之如引锯然。 惟善圣者，不留一言。 又曰：利害心愈明，则亲不睦。 贤愚心愈明，则友不交。 是非心愈明，则事不成。 好丑心愈明，则物不契。 是以圣人浑之。 又曰：圣人以有言、有为、有思者，所以同乎人。 以未尝言、未尝为、未尝思者，所以异乎人。 又曰：以圣师圣者，贤人； 以贤师圣者，圣人。 盖以圣师圣者，徇迹而忘道。 以贤师圣者，反迹而合道。 又曰：众人以魄摄魂，圣人以魂运魄。 盖魄之藏魂俱之，魂之游魄因之。 魂昼寓目，魄夜舍肝。 寓目能见，舍肝能梦。 又曰：果之有核，必待水火土三者具矣，然后相生不穷。 三者不具，如大旱大潦大块，皆不足以生物。 精水、神火，意土，三者本不交，惟人以根合之。 又曰：庖人羹蟹，遗一足几上，蟹已羹而遗足尚动。 是生死者，一气聚散尔。 不生不死，而人横计曰生死。 又曰：无一心，五识并驰，心不可一。 无虚心，五行皆具，心不可虚。 无静心，万化密移，心不可静。 借能一，则二偶之。 借能虚，则实满之。 借能静，则动摇之。 惟圣人能敛万有於一息，无有一物可役吾之咀彻； 散一息於万有，无一物可问吾之云为。 又曰：流者舟也，所以流之者，是水非舟。 运者车也，所以运之者，是牛非车。 思者心也，所以思之者，是意非心。",
      "translated_text": "He also said: The Dao can never be attained—what *can* be attained is called virtue, not Dao. The Dao can never be practiced—what *can* be practiced is called conduct, not Dao. The sage employs what can be attained and practiced to perfect this life; employs what cannot be attained or practiced to perfect death.\n\nHe also said: One whose emotions are utterly quiescent is a sage; one whose emotions are good is a worthy; one whose emotions are base is a petty person. The utterly quiescent emotion arises from the self-existent void—it cannot be displayed. The good or base emotion arises from nothingness into being—it cannot be concealed. Good and base emotions belong to conscious beings, for only sentient creatures possess them. The utterly quiescent emotion belongs to the unconscious, and beneath all heaven, the Dao is nowhere absent.\n\nHe also said: A single spark can burn ten thousand things, yet when the things are gone, where does the fire remain? A single breath of Dao can pervade ten thousand things, yet when the things are gone, where does the Dao abide?\n\nHe also said: My Dao is like dwelling in darkness. One who dwells in brightness sees nothing in the dark, yet one who dwells in darkness can see all things in the light.\n\nHe also said: A bean does not question the pot, nor does the pot answer the bean. A tile does not question the stone, nor does the stone answer the tile. The Dao likewise does not err—whether questioned or answered. Qi flows to and fro, yet where is the Dao?\n\nHe also said: The image of a single revolution is bound within the great void. From its center it ascends to become heaven; from its center it descends to become earth. There is nothing that ascends without descending, nothing that descends without ascending. What ascends is fire; what descends is water. What longs to ascend but cannot is wood; what longs to descend but cannot is metal. As for wood: when drilled, it yields fire; when wrung, it yields water. As for metal: when struck, it yields fire; when smelted, it yields water. Metal and wood are the intercourse of water and fire. Water is essence and heaven; fire is spirit and earth; wood is the hun-soul and humanity; metal is the po-soul and things. That which revolves without cease is time; that which contains and yet abides is space. Only soil marks both beginning and end.\n\nHe also said: Though heaven and earth are vast, they possess form, color, number, and direction. Yet I possess that which is neither form nor color, neither number nor direction—and yet it is heavenlier than heaven, earthier than earth.\n\nHe also said: In dreams, in mirrors, in water—there too heaven and earth exist. To dispel the heaven and earth of dreams, one must not sleep. To dispel the heaven and earth of mirrors, one must not reflect. To dispel the heaven and earth of water, one must not draw from the vessel. Their being or non-being lies here, not there—thus the sage does not dispel heaven and earth, but dispels perception.\n\nHe also said: Heaven and earth are lodged, the myriad things are lodged, I am lodged, the Dao is lodged. If one departs from lodging, the Dao cannot stand.\n\nHe also said: Though one’s conduct be most lofty, it does not escape high and low. Though one’s words be most impartial, they do not escape right and wrong. Though one’s abilities be most divine, they do not escape skill and clumsiness. Though one’s appearance be most singular, it does not escape beauty and ugliness. The sage employs these to manifest to the world, and when the world becomes quiescent in them, it sees the sage.\n\nHe also said: The Dao has no body—those who respond to the world with Dao are engaged in affairs, not Dao. The Dao has no direction—those who lodge the Dao in things are dealing with things, not Dao. The sage ultimately cannot depart from the Dao to display it to others.\n\nHe also said: Maggots eat snakes, snakes eat frogs, frogs eat maggots—each devours the other. The words of sages are likewise: they speak of being and non-being, then of neither being nor non-being, then of transcending neither being nor non-being. Their words are like the drawing of a saw. Only the truly sagely do not cling to a single word.\n\nHe also said: The clearer the mind of profit and harm, the less harmony among kin. The clearer the mind of worthiness and foolishness, the less fellowship among friends. The clearer the mind of right and wrong, the less accomplishment in affairs. The clearer the mind of beauty and ugliness, the less resonance with things. Thus the sage blends them all.\n\nHe also said: The sage employs speech, action, and thought to be one with others; employs non-speech, non-action, and non-thought to be distinct from others.\n\nHe also said: One who takes the sage as teacher of the sage is a worthy; one who takes the worthy as teacher of the sage is a sage. For one who takes the sage as teacher of the sage follows traces and forgets the Dao; one who takes the worthy as teacher of the sage returns to traces and unites with the Dao.\n\nHe also said: The multitude use the po-soul to restrain the hun-soul; the sage uses the hun-soul to move the po-soul. The po-soul stores the hun-soul and accompanies it; the hun-soul roams while the po-soul follows. By day the hun-soul lodges in the eyes, by night the po-soul abides in the liver. Lodging in the eyes, it can see; abiding in the liver, it can dream.\n\nHe also said: For a fruit to have a pit, it must await the presence of water, fire, and soil—only then can it generate endlessly. If these three are not present, as in great drought, great flood, or barren earth, nothing can be born. Essence-water, spirit-fire, and intent-soil—these three do not originally interact; only humans unite them through the root.\n\nHe also said: A cook boiled a crab, leaving one leg on the table. Though the crab was boiled, the discarded leg still twitched. Life and death are but the gathering and scattering of a single qi. Not born, not dead—yet people arbitrarily calculate life and death.\n\nHe also said: Without the one mind, the five senses race in all directions—the mind cannot be unified. Without the empty mind, the five phases are all present—the mind cannot be empty. Without the still mind, the myriad transformations shift imperceptibly—the mind cannot be still. If one could unify it, duality would arise. If one could empty it, it would be filled. If one could still it, it would be set in motion. Only the sage can gather the ten thousand existences into a single breath, so that not one thing can enslave his clarity; can scatter a single breath into the ten thousand existences, so that not one thing can inquire into his actions.\n\nHe also said: What flows is the boat, yet what causes it to flow is the water, not the boat. What moves is the cart, yet what causes it to move is the ox, not the cart. What thinks is the mind, yet what causes it to think is intent, not the mind.",
      "overlap_context": "e; yet what cannot be thought *is* the Dao. Speech is like blowing on a shadow; thought is like grasping at floating dust. Even sages and wise men become deluded—ghosts and spirits cannot fathom it.\n\nHe also said: Those who do not know the Dao yet recklessly divine with intent are like archers shooting at an overturned vessel. The lofty claim to \"preserve gold and jade\"; the mediocre, \"horns and feathers\"; the base, \"tiles and stones.\" Is this so or not? Only the one who placed the object knows.",
      "start_char": 514,
      "end_char": 1781,
      "start_sentence": 29,
      "end_sentence": 105,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.412280559539795,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\群仙要语纂集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "不知所以然而然。 惟不知所以然而然，故其来无从，其往无在。 其来无从，其往无在，故能与天地本原，不古不今。 又曰：是非好丑，成败盈虚，造物者运矣。 皆因私识执之而有，於是以无遣之犹存，以非有非无遣之犹存。 譬如昔游再到，记忆宛然，此不可忘，不可遣。 善去识者，变识为智。 变识为智之说，汝知之乎？ 曰想，如思鬼心栗，思盗心怖。 曰识，如认黍为稷，认玉为石。 皆浮游罔象，无所底止。 譬睹奇物，生奇物想，生奇物识，此想此识，根不在我。 譬如今日而已，至於来日，想识殊未可卜； 及至来日，纷纷想识皆缘有生，曰想曰识。 譬犀望月，月影入角，因想识生，始有月形，而彼真月初不在角。 胸中之天地万物亦然。 知此说者，外不见物，内不见情。 又曰：情生於心，心生於性。 情，波也； 心，流也； 性，水也。 来干我者，如石火顷，以性，受之，则心不生物，浮浮然。 又曰：贤愚真伪，有识者，有不识者。 彼虽有贤愚，彼虽有真伪，而谓之贤愚真伪者，击我之识。 知夫皆识所成，故虽真者亦伪矣。 又曰：天地虽大，能役有形，不能役无形。 阴阳虽妙，能役有气，而不能役无气。 知夫我之心无气无形，则天地阴阳不能役之。 又曰：人之平日，目忽见非常之物者，皆精有所结而使之然。 人之病日，目忽见非常之物者，皆心中有所歉而使之然。 苟知吾心能於无中示有，则知吾心能於有中示无。 但不信之，自然不神。 或曰：厥识既昏，孰能不信。 我应之曰：如捕蛇师，心不怖蛇，彼虽梦蛇而无怖畏。 故黄帝曰：道无鬼神，独往独来。 又曰：有人问於我曰：尔族何氏何名何字？ 何衣何食？",
      "translated_text": "It is so of itself, yet one knows not why it is so. Only by not knowing why it is so can its coming have no source, its going no place. With its coming having no source and its going no place, it can thus merge with the original essence of Heaven and Earth, neither ancient nor modern.\n\nHe also said: Right and wrong, beauty and ugliness, success and failure, fullness and emptiness—these are the workings of the Creator. All arise from clinging to private perceptions, and thus even when one dispels them with non-being, they remain; even when one dispels them with neither being nor non-being, they remain. It is like revisiting a place from the past—memories arise vividly, which cannot be forgotten or dismissed. The skillful transcend perception by transforming it into wisdom. Do you understand this teaching on transforming perception into wisdom?\n\nHe said: \"Thought\" is like fearing ghosts and trembling, or fearing bandits and panicking. \"Perception\" is like mistaking millet for sorghum, or jade for stone. Both are drifting illusions without foundation. For example, seeing a strange object gives rise to thoughts of strangeness, which in turn give rise to perceptions of strangeness—yet neither these thoughts nor perceptions have their root in oneself. It is like today: as for tomorrow, thoughts and perceptions cannot be foretold. When tomorrow comes, all the scattered thoughts and perceptions arise from what has come into being—these are called thoughts and perceptions. It is like a rhinoceros gazing at the moon: the moon’s reflection enters its horn, and from this thoughts and perceptions arise, producing the form of the moon—yet the true moon was never in the horn. The myriad things in the mind’s heaven and earth are likewise.\n\nOne who understands this teaching sees nothing outside, feels no emotion within.\n\nHe also said: Emotion arises from the mind, the mind arises from nature. Emotion is the wave; the mind, the current; nature, the water. What comes to disturb me passes like a spark struck from stone. If one receives it with nature, the mind does not give rise to things, and all remains buoyant.\n\nHe also said: Of worthies and fools, the genuine and the false, some perceive them, some do not. Though there are indeed worthies and fools, the genuine and the false, what we call worthies and fools, the genuine and the false, strike against our perceptions. Knowing that all are formed by perception, even the genuine becomes false.\n\nHe also said: Though Heaven and Earth are vast, they can command the formed but cannot command the formless. Though yin and yang are subtle, they can command the qi-endowed but cannot command the qi-less. Knowing that my mind is without qi and without form, then Heaven and Earth and yin and yang cannot command it.\n\nHe also said: When a person in ordinary times suddenly sees an extraordinary thing, it is always because essence has congealed to make it so. When a person in illness suddenly sees an extraordinary thing, it is always because something is lacking in the mind to make it so. If one knows that my mind can manifest being from non-being, then one knows that my mind can manifest non-being from being. But if one does not believe this, it will naturally not be numinous.\n\nSomeone asked: When perception is already clouded, who can avoid belief? He replied: Like a snake-catcher who does not fear snakes, though he may dream of snakes, he feels no terror. Thus the Yellow Emperor said: \"The Dao has no ghosts or spirits; it comes and goes alone.\"\n\nHe also said: Someone asked me: \"What is your clan name, your given name, your courtesy name? What do you wear, what do you eat?\"",
      "overlap_context": "e set in motion. Only the sage can gather the ten thousand existences into a single breath, so that not one thing can enslave his clarity; can scatter a single breath into the ten thousand existences, so that not one thing can inquire into his actions.\n\nHe also said: What flows is the boat, yet what causes it to flow is the water, not the boat. What moves is the cart, yet what causes it to move is the ox, not the cart. What thinks is the mind, yet what causes it to think is intent, not the mind.",
      "start_char": 1781,
      "end_char": 2424,
      "start_sentence": 106,
      "end_sentence": 142,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.781235218048096,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\群仙要语纂集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "何友何仆？ 何琴何书？ 何古何今？ 我时默然不对一字。 或人叩之不已。 我不得已应之曰：尚自不见我，将何为我所。 又曰：气之为物，有合有散，我之所以行气者，本未尝合，亦未尝散。 有合者生，有散者死，彼未尝合未尝散者，无生无死。 客有去来，邮常自若。 又曰：困天下之智者，不在智而在愚； 穷天下之辩者，不在辩而在讷； 服天下之勇者，不在勇而在怯。 又曰：少言者不为人所忌，少行者不为人所短，少智者不为人所劳，少能者不为人所役。 又曰：言某事者，甲言利，乙言害，丙言或利或害，丁言俱利俱害，必居一于此矣。 喻道者不言。 又曰：言道者如言梦。 夫言梦者曰：如此金玉，如此器皿，如此禽兽。 言者能言之，不能取而与之； 听者能闻之，不能受而得之。",
      "translated_text": "\"What friends, what servants? What zither, what books? What ancient, what modern?\" At that moment, I remained silent, not uttering a single word. When the questioner persisted without cease, I could not but reply: \"If you do not even see me, what use have you for what belongs to me?\"\n\nHe also said: Qi, as a thing, may gather or disperse. The reason I circulate qi is that it has never truly gathered, nor has it ever truly dispersed. That which gathers is born; that which disperses dies. But that which has never gathered nor dispersed knows neither birth nor death. Guests may come and go, yet the post station remains unchanged.\n\nHe also said: To confound the world’s wisest is not wisdom but folly; to exhaust the world’s eloquence is not eloquence but inarticulateness; to subdue the world’s bravest is not courage but timidity.\n\nHe also said: He who speaks little is not envied by others; he who acts little is not criticized by others; he who is sparing in wisdom is not wearied by others; he who is sparing in ability is not enslaved by others.\n\nHe also said: When speaking of a certain matter, one says it is beneficial, another says it is harmful, a third says it may be either, and a fourth says it is both beneficial and harmful—it must fall into one of these. But he who expounds the Dao does not speak.\n\nHe also said: Speaking of the Dao is like speaking of dreams. One who speaks of dreams says: \"Such gold and jade, such vessels, such birds and beasts.\" The speaker can describe them but cannot take them and give them; the listener can hear them but cannot receive and obtain them.",
      "overlap_context": "est non-being from being. But if one does not believe this, it will naturally not be numinous.\n\nSomeone asked: When perception is already clouded, who can avoid belief? He replied: Like a snake-catcher who does not fear snakes, though he may dream of snakes, he feels no terror. Thus the Yellow Emperor said: \"The Dao has no ghosts or spirits; it comes and goes alone.\"\n\nHe also said: Someone asked me: \"What is your clan name, your given name, your courtesy name? What do you wear, what do you eat?\"",
      "start_char": 2424,
      "end_char": 2739,
      "start_sentence": 143,
      "end_sentence": 161,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.84159255027771,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\群仙要语纂集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "惟善听者不泥不辩。 又曰：方术之在天下多矣，或尚晦，或尚明，或尚强，或尚弱。 执之皆事，不执之皆道。 又曰：吾道如海，有亿万金投之不见，有亿万石投之不见，有亿万污秽投之不见。 能运小虾小鱼，能运大鲲大鲸。 合众水而受之，不为有余； 散众水而分之，不为不足。 又曰：天下之人，盖不可以亿兆计。 人之梦各异，夜夜之梦各异。 有天有地，有人有物，皆思成之，盖不以尘计。 安知今之天地非有思者乎。 又曰：死胎中者，死卵中者，亦人亦物。 天地虽大，彼固不知。 计天地者，皆我区识。 譬如手不触刃，刃不伤人。 又曰：有时者气，彼非气者，未尝有昼夜。 有方者形，彼非形者，未尝有南北。 何谓非气？ 气之所自生者，如摇箑得风，彼未摇时，非风之气，彼已摇时，即名为气。 何谓非形？ 形之所自生者，如钻、木得火，彼未钻时，非火之形，彼已钻时，即名为形。 又曰：圣人不异众人，特物不能拘尔。 又曰：在己无居，形物自着，其动若水，其静若镜，其应若响，芒乎若亡，寂乎若清，同焉者和，得焉者失，未尝先人而常随人。 又曰：轻清者魄从魂升，重浊者魂从魄降，魂魄半之则在人间。 升魂为贵，降魄为贱； 灵魂为贤，厉魄为愚； 轻魂为明，重魄为暗； 扬魂为羽，锐魄为毛； 明魂为神，幽魄为鬼。 其形其居，其识其好，皆以五行契。 又曰：爱为精，观为神，爱观虽异，皆因识生。 惟其爱之无识，如锁之交； 观之无识，如灯之照。 吾识不萌，吾生何有。 又曰：核芽相生，不知其几万株。 天地虽大，不能芽空中之核。 雌卵相生，不知其几万禽。 阴阳虽妙，不能卵无雄之雌。 惟其来干我者，皆摄之以一息，则变物为我，无物非我。 所谓五行者，孰能变之。 又曰：如桴叩鼓，鼓之形者，我之有也； 鼓之声者，我之感也。 桴已往矣，余声尚存，终亦不存而矣。 鼓之形如我之精，鼓之声如我之神，其余声者犹之魂魄。 知夫倏往忽来，则五行之气我何有焉。 又曰：知夫此身如梦中身，随情所见者，可以飞神作我而游太清。 知夫此物如梦中物，随情所见者，可以凝神作物而驾八荒。 是道也，能见精神而久生，能忘精神而超生。 吸气以养精，如金生水； 吸风以养神，如木生火，所以假外以延精神。 漱水以养精，精之所以不穷； 摩火以养神，神之所以不穷，所以假内以延精神。 若夫忘精神而超生者，吾尝言之矣。 又曰：计生死者，或曰死已有，或曰死已无，或曰死已亦有亦无； 或曰当幸者，或曰当惧者； 或曰当任者，或曰当超者。 愈变识情，驰骛不已。 殊不知我之生死，如马之手，牛之翼，本无有，复无无。 譬如水火虽犯水火，不能烧之，不能溺之。 又曰：物我交心生，两木摩火生。 不可谓之在我，不可谓之在彼，不可谓之非我，不可谓之非彼。 执而彼我之，则愚。 又曰：勿以我心揆彼，当以彼心揆彼。 知此说者，可以周事，可以行德，可以贯道，可以交人，可以忘我。 又曰：汝见蛇首人身者，牛臂鱼鳞者，鬼形禽翼者，汝勿怪此。 怪不及梦，梦怪不及觉。 有耳有目，有手有臂，怪尤矣。 大言不能言，大智不能思。 又曰：目自观目无色，耳自听耳无声，舌自尝舌无味，心自揆心无物。",
      "translated_text": "Only the adept listener remains unentangled, uncontentious.\n\nHe also said: The arts and methods in the world are manifold—some esteem obscurity, some clarity; some strength, some weakness. To cling to any is to engage in affairs; to cling to none is to abide in the Dao.\n\nHe also said: My Dao is like the sea—billions of gold cast into it vanish, billions of stones cast into it vanish, billions of filth cast into it vanish. It bears tiny shrimp and minnows, it bears great leviathans and whales. Gathering all waters to receive them, it is not full; dispersing all waters to divide them, it is not empty.\n\nHe also said: The people of the world number beyond reckoning. Each person’s dreams differ, and each night’s dreams differ. There are heavens and earths, humans and things, all shaped by thought—so numerous they cannot be counted as dust. How can we know that this present heaven and earth are not likewise shaped by some thinking being?\n\nHe also said: Those who die in the womb, those who die in the egg—these too are human, these too are things. Though heaven and earth are vast, they remain unaware. Those who calculate heaven and earth are but confined within their own perceptions. It is like a hand that does not touch the blade, a blade that does not wound the person.\n\nHe also said: That which has time is qi; that which is not qi has never known day or night. That which has direction is form; that which is not form has never known south or north. What is meant by \"not qi\"? That from which qi arises—like fanning a fan to produce wind. Before the fanning, there is no wind’s qi; once fanned, it is called qi. What is meant by \"not form\"? That from which form arises—like drilling wood to produce fire. Before the drilling, there is no fire’s form; once drilled, it is called form.\n\nHe also said: The sage does not differ from the multitude; it is merely that things cannot constrain him.\n\nHe also said: Abiding nowhere in oneself, yet form and things manifest of their own. In movement, it is like water; in stillness, like a mirror; in response, like an echo. Vague as if vanished, silent as if pure. Those who harmonize with it are at peace; those who grasp it lose it. Never preceding others, yet always following them.\n\nHe also said: The light and pure ascend with the hun-soul; the heavy and turbid descend with the po-soul. When hun and po are evenly balanced, one dwells among humans. Ascending hun is noble; descending po is base. Spirited hun is wise; oppressive po is foolish. Light hun is luminous; heavy po is dark. Soaring hun becomes feathered; sharp po becomes furred. Radiant hun is spirit; shadowy po is ghost. Their forms, their dwellings, their perceptions, their affinities—all correspond to the Five Phases.\n\nHe also said: Love is essence; contemplation is spirit. Though love and contemplation differ, both arise from perception. Only when love is without perception is it like the interlocking of a lock; when contemplation is without perception, it is like the illumination of a lamp. If my perception does not stir, what existence can I have?\n\nHe also said: From a single kernel, countless sprouts arise—who knows how many tens of thousands? Though heaven and earth are vast, they cannot sprout a kernel in empty space. From a single hen’s egg, countless birds arise—who knows how many tens of thousands? Though yin and yang are subtle, they cannot hatch an egg from a barren hen. Only that which comes to me can I gather in a single breath, transforming things into myself, so that nothing is not myself. As for the Five Phases—who can alter them?\n\nHe also said: Like a drumstick striking a drum—the drum’s form is my possession; the drum’s sound is my resonance. Though the stick has departed, the lingering sound remains, yet in the end, it too fades away. The drum’s form is like my essence; the drum’s sound is like my spirit; the lingering sound is like my hun and po. Knowing how it comes and goes in an instant—what have I to do with the qi of the Five Phases?\n\nHe also said: Know that this body is like a body in a dream, appearing as emotions dictate—then you may send forth your spirit to roam the Great Purity. Know that this thing is like a thing in a dream, appearing as emotions dictate—then you may concentrate your spirit to become that thing and traverse the Eight Wastes. This Dao—it can perceive spirit and prolong life, or forget spirit and transcend life.\n\nInhaling qi to nourish essence is like metal giving rise to water; inhaling wind to nourish spirit is like wood giving rise to fire—thus borrowing the external to extend spirit. Rinsing with water to nourish essence, so that essence does not exhaust; rubbing with fire to nourish spirit, so that spirit does not exhaust—thus borrowing the internal to extend spirit. As for forgetting spirit to transcend life, I have already spoken of it.\n\nHe also said: Those who calculate life and death say: death is already existent, or death is already nonexistent, or death is both existent and nonexistent; some say one should rejoice, some say one should fear; some say one should accept it, some say one should transcend it. The more perceptions shift, the more the mind races without cease. Yet they do not know that my life and death are like a horse’s hand or a cow’s wing—originally non-existent, and then not even non-existent. It is like water and fire: though they encounter each other, fire cannot burn them, water cannot drown them.\n\nHe also said: When things and I interact, mind arises—like two sticks rubbed together to produce fire. One cannot say it is in me, nor in the other; one cannot say it is not me, nor not the other. To cling to a division between self and other is folly.\n\nHe also said: Do not measure others by your own mind; measure them by their own mind. One who understands this can manage affairs, practice virtue, penetrate the Dao, engage with others, and forget the self.\n\nHe also said: You see those with serpent heads and human bodies, ox arms and fish scales, ghostly forms and avian wings—do not be astonished by these. Astonishment falls short of dreams; dreams fall short of waking. Having ears and eyes, hands and arms—this is even more astonishing. Great words cannot be spoken; great wisdom cannot be thought.\n\nHe also said: The eye sees itself but perceives no color; the ear hears itself but perceives no sound; the tongue tastes itself but perceives no flavor; the mind measures itself but perceives no thing.",
      "overlap_context": "ter, one says it is beneficial, another says it is harmful, a third says it may be either, and a fourth says it is both beneficial and harmful—it must fall into one of these. But he who expounds the Dao does not speak.\n\nHe also said: Speaking of the Dao is like speaking of dreams. One who speaks of dreams says: \"Such gold and jade, such vessels, such birds and beasts.\" The speaker can describe them but cannot take them and give them; the listener can hear them but cannot receive and obtain them.",
      "start_char": 2739,
      "end_char": 3992,
      "start_sentence": 162,
      "end_sentence": 230,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.095207691192627,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\群仙要语纂集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "众人逐於外，贤人执於内，圣人皆伪之。 又曰：人无以无知无为者为无我，虽有知有为，不害其为。 无我譬如火也，躁动不停，未尝有我。 又曰：壁曰如大海，能变化亿万蛟鱼，水一而已。 我之与物，蓊然蔚然，在大化中，性一而已。 知夫性一者，无人无物，无死无生。 又曰：水潜故蕴为五精，火飞故达为五臭，木茂故华为五色，金坚故实为五声，土和故滋为五味。 其常五，其变不可计。 其物五，其杂不可计。 然则万物在天地间，不可执谓之万，不可执谓之五，不可执谓之一； 不可执谓之非万，不可执谓之非五，不可执谓之非一。 或合之，或离之，以此必形，以此必数，以此必气，徒自劳尔。 物不知我，我不知物。 又曰：乌兽俄呦呦、俄旬旬、俄逃逃； 草木俄茁茁、俄亭亭，俄萧萧。 天地不能留，圣人不能系，有运者存焉尔。 有之在彼，无之在此。 鼓不桴则不呜，偶之在彼，奇之在此，桴不手则不击。 又曰：均一物也，众人惑其名，见物不见道； 贤人析其理，见道不见物； 圣人合其天，不见道，不见物。 道皆道，不执之即道，执之即物。 又曰：昔必论道者，或日碍厂，或曰邃深，或曰澄彻，或曰空同，或曰晦明，慎勿遇此而生怖退。 天下至理，竟非言意。 苟知非言非意，在彼微言妙意之上，乃契吾说。 又曰：事有在事，言有理； 道无在道，言无理。 知言无理，则言言皆道。 不知言无理，虽执至言，为梗为翳。 又曰：人徒知伪得之中有真失，殊不知真得之中有真失； 徒知伪是之中有真非，不知真是之中有真非。 谭景升化书 道之委也，虚化神，神化气，气化形，形化生，而万物所以塞也。 道之用也，形化气，气化神，神化虚，虚明而万物所以通也。 是以古圣人穷通塞之端，得造化之源，忘形以养气，忘气以养神，忘神以养虚，虚实相通，是谓大同。 故藏之为元精，用之为万灵，含之为太一，放之为太清。 是以坎离消长於一身，风云发泄於七窍。 真气熏蒸而时无寒暑，纯阳流注而民无死生，是谓神化之道者也。 且夫当空团块，见块而不见空。 粉块求空，见空而不见块。 形无妨而人自妨之，物无滞而人自滞之。 龙可以蹈虚空，虚空非无也。 可以实金石，金石非有也。 有无相通，物我相同。 其生非始，其死非终，知此道者，形不可得毙，神不可得逝。 稚子弄影，不知为影所弄。 狂夫侮像，不知为像所侮。 化家者不知为家所化，化国者不知为国所化，化天下者不知为天下所化。 虚化神，神化气，气化血，血化形，形化婴，婴化童，童化少，少化壮，壮化老，老化死，死复化为虚，虚复化为神，神复化为气，气复化为物。 化化不间，犹环之无穷。 夫万物非欲生，不得不生，万物非欲死，不得不死。 达此理者，神可以不化，形可以不生。 爪发者我之形，何爪可割而无害，发可截而无痛。 盖营卫所不至也。 则是我本无害而筋骨为之害，我本无痛而血肉为之痛，所以喜怒非我作，衰乐非我动，我为形所昧，形为我所爱。 达此理者，可以出生死之外。 太上者，虚无之神也。 天地者，阴阳之神也。 人虫者，血肉之神也。 其同者神，其异者形。 是故形不灵而气灵，气不灵而声灵，觉不灵而梦灵，生不灵而死灵。",
      "translated_text": "The multitude chases the external; the worthy cling to the internal; the sage feigns them both.\n\nHe also said: People mistake the absence of knowledge and action for the absence of self, yet even with knowledge and action, this does not impair one’s true nature. The absence of self is like fire—restless and ceaseless, never possessing a self.\n\nHe also said: The wall is like the great sea, able to transform into countless dragons and fish, yet the water remains one. The self and the myriad things, lush and flourishing, exist within the great transformation—only their nature is one. One who knows this unity knows no person, no thing, no death, no life.\n\nHe also said: Water, sinking, condenses into the five essences; fire, soaring, disperses into the five odors; wood, flourishing, blossoms into the five colors; metal, firm, solidifies into the five sounds; earth, harmonious, nourishes into the five flavors. Their constancy is five, yet their transformations are incalculable. Their forms are five, yet their combinations are incalculable. Thus, the myriad things within heaven and earth cannot be rigidly called ten thousand, nor rigidly called five, nor rigidly called one; nor can they be rigidly called not ten thousand, not five, not one. Some unite, some separate—through this, form is determined, number is determined, qi is determined—yet all is but self-exertion. Things do not know me; I do not know things.\n\nHe also said: Birds and beasts now cry *you-you*, now *xun-xun*, now flee in haste; grasses and trees now sprout *zhuo-zhuo*, now stand *ting-ting*, now wither *xiao-xiao*. Heaven and earth cannot retain them; the sage cannot bind them—only the turning of fate sustains them. Presence lies there; absence lies here. A drum does not sound without a drumstick; evenness lies there, oddness lies here—a drumstick does not strike without a hand.\n\nHe also said: Though it is one thing, the multitude is deluded by its name, seeing things but not the Dao; the worthy dissect its principle, seeing the Dao but not things; the sage unites with heaven, seeing neither Dao nor things. The Dao is always the Dao—grasping it makes it a thing; not grasping it, it remains the Dao.\n\nHe also said: Those who once debated the Dao spoke of it as obstructing and vast, as profound and deep, as limpid and clear, as empty and unified, as obscure and luminous—beware of encountering such descriptions and retreating in fear. The supreme principle of the world utterly transcends words and concepts. Only when one knows it is beyond words and concepts, existing above subtle words and wondrous meanings, does one align with my teaching.\n\nHe also said: Affairs have their place in affairs; words have their principles. The Dao has no place in the Dao; words have no principles. Knowing that words have no principles, every word becomes the Dao. Not knowing this, even holding the most profound words becomes an obstruction, a veil.\n\nHe also said: People merely recognize that within false gains lies true loss, yet fail to see that within true gains lies true loss; they merely recognize that within false rightness lies true wrong, yet fail to see that within true rightness lies true wrong.\n\n*Tan Jing’s* *Shenghua Shu* states: The Dao’s descent unfolds thus—emptiness transforms into spirit, spirit into qi, qi into form, form into life, and thus the myriad things are filled. The Dao’s application unfolds thus—form transforms into qi, qi into spirit, spirit into emptiness, and emptiness illumined, the myriad things are made free. Thus, the ancient sages explored the origins of obstruction and freedom, grasped the source of creation and transformation, forgot form to nurture qi, forgot qi to nurture spirit, forgot spirit to nurture emptiness. Emptiness and fullness interpenetrate—this is called the Great Harmony. Thus, concealed, it is primordial essence; applied, it is the myriad spirits; contained, it is the Great One; released, it is the Great Clarity. Therefore, Kan and Li wax and wane within the body; wind and clouds issue forth from the seven orifices. True qi steams and rises, and the seasons know no cold or heat; pure yang flows and circulates, and the people know no death or life—this is the way of spiritual transformation.\n\nHe also said: Before the empty void, one sees the clod but not the void. Grinding the clod to seek the void, one sees the void but not the clod. Form does not hinder, yet people hinder themselves; things do not stagnate, yet people stagnate themselves. The dragon treads the empty void—void is not nothing. It can solidify metal and stone—metal and stone are not being. Being and non-being interpenetrate; self and things are the same. Its birth is not a beginning; its death is not an end. One who knows this Dao cannot be destroyed in form, cannot be lost in spirit.\n\nThe child plays with its shadow, unaware it is the shadow playing with the child. The madman mocks the statue, unaware it is the statue mocking the madman. The one who transforms the household does not know they are transformed by the household; the one who transforms the state does not know they are transformed by the state; the one who transforms the world does not know they are transformed by the world.\n\nEmptiness transforms into spirit, spirit into qi, qi into blood, blood into form, form into infancy, infancy into childhood, childhood into youth, youth into maturity, maturity into old age, old age into death, death back into emptiness, emptiness back into spirit, spirit back into qi, qi back into things. Transformation upon transformation is unceasing, like a ring without end. The myriad things do not desire life, yet cannot but live; they do not desire death, yet cannot but die. One who comprehends this principle may keep spirit from transforming, form from being born.\n\nNails and hair are part of my form, yet cutting nails causes no harm, severing hair causes no pain—for they lie beyond the reach of *ying* and *wei*. Thus, I am originally unharmed, yet sinews and bones harm me; I am originally without pain, yet flesh and blood pain me. Joy and anger do not arise from me; sorrow and happiness do not move me. I am obscured by form; form is cherished by me. One who comprehends this principle can transcend beyond birth and death.\n\nThe Most High is the spirit of emptiness and nothingness. Heaven and earth are the spirits of yin and yang. Humans and insects are the spirits of blood and flesh. What they share is spirit; what differs is form. Thus, form is not numinous, yet qi is numinous; qi is not numinous, yet sound is numinous; waking is not numinous, yet dreams are numinous; life is not numinous, yet death is numinous.",
      "overlap_context": "nd human bodies, ox arms and fish scales, ghostly forms and avian wings—do not be astonished by these. Astonishment falls short of dreams; dreams fall short of waking. Having ears and eyes, hands and arms—this is even more astonishing. Great words cannot be spoken; great wisdom cannot be thought.\n\nHe also said: The eye sees itself but perceives no color; the ear hears itself but perceives no sound; the tongue tastes itself but perceives no flavor; the mind measures itself but perceives no thing.",
      "start_char": 3992,
      "end_char": 5235,
      "start_sentence": 231,
      "end_sentence": 291,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.33815884590149,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\群仙要语纂集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "水至清而结冰不清，神至明而结形不明。 冰泮返清，形散返明。 能知真死者，可以游太上之京。 虚化神，神化气，气化形，形气相乘而成声。 耳非听声也，而声自投之； 谷非应响也，而响自满之。 耳小窍也，谷大窍也。 山潭小谷也，天地大谷也。 一窍呜而万窍皆呜，一谷闻而万谷皆闻。 声导气，气导神，神导虚，虚含神，神含气，气含声。 相导相含，虽秋蚊之翾翾，苍蝇之营营，无所不至也。 由此知虽丝毫之虑，必有所察。 虽啾唧之言，必有所闻。 惟大人之机，天地莫能见，阴阳莫能知，鬼神莫能窥。 方咫之木，置於地之上，使人蹈之而有余。 方咫之木，置於竿之端，使人踞之而不足。 非物有大小，盖心有虚实。 是故冒大暑而挠之愈热，受炙灼而惧者愈痛。 人无常心，物无常性。 由是知水可使不湿，火可使不燥。 海鱼有以虾为目者，人皆笑之。 殊不知古人以囊萤为灯者，又不知昼非日之光则不能驰，夜非烛之光则有所欺。 观傀儡之假，而不自疑，嗟朋友之逝，而不自悲。 贤与愚莫知，惟抱纯白养太玄者，不入其机。 镜非求鉴於物，而物自投之。 橐非求包於气，而气自实之。 是故鼻以虚受臭，耳以虚受听，目以虚受色，舌以虚受味。 所以心同幽冥，则物无不受，神同虚无，则事无不知。 是以大人夺其机，藏其微。 羽符至怪，阴液至奇，可以守国，可以救时，可以坐为帝王之师。 天下贤愚营营然，笑飞蛾之投夜烛，苍蝇之触晓窗，知往不知还，知进不知退，而害以就利，不知聚利以就害。 贤於人而不贤於身，何贤之谓也。 博於物而不博於己，何博之谓也。 是以大人利害俱忘，何所不藏。 夫禽兽之於人也何异，有巢穴之居，有夫妇之配，有父子之性，有生死之情。 乌反哺，仁也； 隼悯胎，义也； 蜂有君，礼也； 羊跪乳，智也； 雉不再接，信也。 孰究其道，万物之中，五常百行无所不有也，而教之为网罟，使之务畋渔。 且夫焚其巢穴，非仁也。 夺其亲爱，非义也。 以斯为享，非礼也。 教民残暴，非智也。 使万物怀疑，非信也。 夫膻臭之欲不止，杀害之机不已。 羽毛虽无言，必状我为贪狼之与封豕。 鳞介虽无知，必名我为长鲸之与巨虺也。 胡为自安，焉得不耻。 吁，直疑自古无君子。 救物而称义者，人不义之。 行惠而求报者，人不报之。 民之情也，让之则多，争之则少，就之则去，避之则来，与之则轻，惜之则夺。 是故大义无状，大恩无象。 大义成，不知者荷之； 大恩就，不识者报之。 能歌者，不能者听之； 能舞者，不能者观之。 巧者，不巧者辨之； 贤者，不贤者任之。 夫养木者必伐之，待士者必死之，网之以冠冕，钩之以爵禄。 若马驾车辂，贵不我得； 彘食糟糠，肥不我有。 是以大人道不虚贵，德不虚守，贫有所倚，退有所恃。 退者非乐寒贱而甘委弃。 为恶者畏人识，必有识者； 为善者欲人知，必有不知者。 是故人不识者，谓之大恶； 人不知者，谓之至善。 吴尊师玄纲论 道者，虚无之系，造化之根，神明之本，天地之源。 其大无外，其微无内，浩旷无端，杳冥无对。 至幽靡察而大明垂光，至静无心而品物有方。 混漠无形，寂寞无声，万象以之生，五音以之成。 生者有极，成者必亏，生生成成，古今不移。",
      "translated_text": "Water, at its utmost clarity, congeals into ice that is no longer clear; spirit, at its utmost luminosity, congeals into form that is no longer luminous. When ice melts, clarity returns; when form scatters, luminosity returns. One who knows the truth of death may wander the capital of the Most High.\n\nThe void transforms into spirit, spirit transforms into qi, qi transforms into form—form and qi intermingle to produce sound. The ear does not listen to sound; sound comes to it of its own accord. The valley does not respond to echoes; echoes fill it of their own accord. The ear is a small aperture; the valley, a great one. A mountain ravine is a small valley; heaven and earth, a great valley. When one aperture resounds, ten thousand apertures all resound; when one valley hears, ten thousand valleys all hear.\n\nSound guides qi, qi guides spirit, spirit guides the void; the void contains spirit, spirit contains qi, qi contains sound. Guiding and containing one another, even the faintest hum of autumn mosquitoes or the ceaseless drone of flies reaches everywhere. From this we know that even the subtlest thought is perceived, and the faintest whisper is heard. Only the mechanism of the great person—neither heaven nor earth can see it, neither yin nor yang can know it, neither ghosts nor spirits can glimpse it.\n\nA block of wood, a foot square, placed upon the ground leaves ample room for a person to tread upon it. The same block, placed at the tip of a pole, leaves no room for a person to stand upon it. It is not the object that has grown larger or smaller, but the mind that has become empty or full. Thus, fanning a great heat only makes it hotter; fearing scorching pain only makes it more painful. People have no constant mind; things have no constant nature. From this we know that water can be made not to wet, and fire not to burn.\n\nThere are sea fish that use shrimp for eyes—people laugh at them. Yet they do not realize that the ancients used fireflies in bags as lamps, nor that without the sun’s light by day, one cannot travel, and without the candle’s light by night, one is deceived. They see the falsity of puppets but do not doubt themselves; they sigh for departed friends but do not grieve for themselves. Neither the wise nor the foolish understand—only those who embrace pure whiteness and nurture the Great Mystery avoid falling into its mechanism.\n\nThe mirror does not seek to reflect objects; objects come to it of their own accord. The bellows does not seek to contain qi; qi fills it of its own accord. Thus, the nose receives scents through emptiness, the ear receives sounds through emptiness, the eye receives colors through emptiness, the tongue receives flavors through emptiness. When the mind is as dark as the unseen depths, nothing is not received; when spirit is as void as nothingness, nothing is not known. Therefore, the great person seizes the mechanism and conceals the subtle.\n\nFeathered talismans are most strange; yin fluids are most wondrous. With them, one may guard a kingdom, rescue an age, or sit as the teacher of emperors and kings. Yet the world’s wise and foolish bustle about, laughing at moths that fly into night candles and flies that strike morning windows—knowing how to advance but not how to retreat, seeking profit while courting harm, unaware that profit gathers only to invite harm.\n\nTo be wise toward others but not toward oneself—what wisdom is that? To be learned in things but not in oneself—what learning is that? Thus, the great person forgets both profit and harm; what is there that cannot be concealed?\n\nWhat difference is there between birds and beasts and humans? They have nests and dens for dwellings, mates for pairing, the nature of parent and child, the feelings of life and death. The crow returns to feed its parents—this is benevolence. The falcon pities its unhatched young—this is righteousness. Bees have a ruler—this is propriety. The lamb kneels to nurse—this is wisdom. The pheasant does not mate twice—this is trustworthiness. Who has fully explored their ways? Among the ten thousand things, the Five Constants and a hundred virtues are all present. Yet humans cast nets and snares to teach them the pursuit of hunting and fishing.\n\nMoreover, burning their nests and dens is not benevolence. Seizing their loved ones is not righteousness. Offering them as sacrifices is not propriety. Teaching people cruelty is not wisdom. Causing the ten thousand things to harbor doubt is not trustworthiness. When the desire for rank odors does not cease, the mechanism of killing and harming does not end. Though birds and beasts have no words, they must depict us as ravenous wolves and giant boars. Though fish and shellfish have no knowledge, they must call us great whales and monstrous serpents. How can we be at ease? How can we not feel shame? Alas, one might suspect there have never been true noble persons.\n\nThose who rescue others and call it righteousness—people do not deem them righteous. Those who bestow kindness and seek repayment—people do not repay them. This is the nature of people: yield, and they take more; contend, and they take less. Approach them, and they leave; avoid them, and they come. Give to them, and they treat it lightly; cherish it, and they seize it. Thus, great righteousness has no form; great kindness has no image. When great righteousness is achieved, even the unknowing bear its burden; when great kindness is realized, even the ungrateful repay it.\n\nThose who can sing are heard by those who cannot; those who can dance are watched by those who cannot. The skillful are discerned by the unskillful; the worthy are employed by the unworthy. Those who tend trees must fell them; those who rely on scholars must lose them. They are ensnared with caps and robes, hooked with ranks and emoluments. Like horses harnessed to a carriage, their value is not for themselves; like swine fed on husks and chaff, their fatness is not their own.\n\nThus, the great person’s Dao is not vainly exalted; their virtue is not vainly preserved. In poverty, they have something to rely on; in retreat, they have something to depend on. Those who retreat do not delight in cold and lowliness and willingly cast themselves aside. Those who do evil fear being recognized—yet there are always those who recognize them. Those who do good desire to be known—yet there are always those who do not know them. Therefore, those unrecognized by others are called great evildoers; those unknown by others are called supreme goodness.\n\n*Master Wu’s Mystical Principles*\nThe Dao is the lineage of emptiness and nothingness, the root of creation and transformation, the origin of spirit and luminosity, the source of heaven and earth. Vast beyond all bounds, subtle beyond all interiors, boundless and without limit, dark and without counterpart. Profoundly obscure yet unable to be scrutinized, its great brightness sheds light; utterly still and without intent, yet the ten thousand things have their proper places. Vast and formless, silent and soundless—from it the ten thousand images arise, and the five notes are perfected. That which is born has its limit; that which is completed must wane. Birth and completion, completion and birth—unchanging from ancient times to the present.",
      "overlap_context": "orm; form is cherished by me. One who comprehends this principle can transcend beyond birth and death.\n\nThe Most High is the spirit of emptiness and nothingness. Heaven and earth are the spirits of yin and yang. Humans and insects are the spirits of blood and flesh. What they share is spirit; what differs is form. Thus, form is not numinous, yet qi is numinous; qi is not numinous, yet sound is numinous; waking is not numinous, yet dreams are numinous; life is not numinous, yet death is numinous.",
      "start_char": 5235,
      "end_char": 6469,
      "start_sentence": 292,
      "end_sentence": 367,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.618825912475586,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\群仙要语纂集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "此之谓道也。 德者，天地所禀，阴阳所资，经以五行，纬以四时。 牧之以君，训之以师，幽冥动植，咸畅其宜。 泽流无穷，草生不知藉其功； 惠加无极，百姓不知赖其力。 此之谓德也。 然则通而生之谓之道，道固无名焉。 蓄而成之谓之德，德固无称焉。 尝试论之曰：天地人物，灵仙鬼神，非道无以生，非道无以成。 生者不知其始，成者不见其终。 探奥索隐，孰窥其宗。 入有之末，出无之先，莫究其朕，谓之自然。 自然者，道德之常，天地之纲也。 右论道德 太虚之先，寂寥何有。 至精感激，而真一生焉。 真一运神，而元气自化。 元气者，无中之有，有中之无，广不可量，微不可测，氤氲渐着，混茫无倪，万象之端，兆眹於此。 清通澄朗之气，浮而为天。 浊滞烦昧之气，积而为地。 平和柔顺之气，结而为人伦。 错谬刚戾之气，散而为杂类。 自一气之所育，播万殊而种分，既涉化机，迁变罔极。 然则天地人物之形者，元气也。 受天地人物之灵者，神明也。 故乾坤统天地，精魂御人物，气有阴阳之革，神无寒暑之变。 虽群动纠纷不可胜纪，灭而复生，终而复始。 而道德之体，神明之心，应感不穷，未尝疲於动用之境矣。 右论兀气 诸章节要 天地不能自有，有天地者太极。 太极不能自运，运太极者真精。 真精自然，惟神惟明。 无祖无宗，不始不终。 含和蕴慈，愍俗哀蒙。 清浊异禀，真凡莫同。 降气分光，聿生人中。 贤明博达，周济为功。 为君为长，俾物咸通。 纯阳赫赫在于上，九天之上无阴也。 纯阴冥冥处于下，九地之下无阳也。 阴阳混蒸而生万有者，正在天地之间。 故气象变通，晦明有类，阳明而正，其粹为真灵，阴晦而邪，其精为魔魅。 故禀阳灵而生者为睿哲，资阴昧而育者为凶顽。 阳好生，故睿哲者必惠和。 阴好杀，故凶顽者必悖戾。 或善或否者，乃二气均合而生中人也。 二者各有所禀，而教安施乎？ 教之所施，为中人尔。 何者？ 睿哲不教而自知，凶顽虽教而不移，此皆受阴阳之纯气也。 亦犹火可灭，不可使之寒，冰可消，不可使之热，理固然也。 夫生我者道，禀我者神，而寿夭去留，匪由於己。 何也？ 以性动为情，情返於道，故为化机所运，不能自持也。 将超迹於存亡之域，栖心於自得之乡者，道可以为师，神可以为友。 何谓其然乎？ 盖道与神无为而气自化，无虑而物自成，入於品汇之中，出於生死之表。 故君子黜嗜欲，隳聪明，视无色，听无声，恬淡纯粹，体和神清，虚夷忘形，乃合至精，此所谓返我之宗，复与道同。 造化莫能测，鬼神莫能知，况於人乎。 通於道者，虽翱翔宇宙之外，而心常宁，虽体息毫厘之内，而气自运。 故心不宁，则无以同乎道，气不运，则无以存乎形。 形存道同，天地之德也。 是以动而不知其动者，超乎动者也。 静而不知其静者，出乎静者也。 超乎动者，阳不可得而推。 出乎静者，阴不可得而移。 阴阳不能变，而况於万物乎。 故不为物所诱者，谓之至静。 至静能契於至虚，虚极则明，明极则莹，莹极则彻。 彻者虽天地之广，万物之殷，不能逃方寸之鉴矣。 夫道包亿万之数，而不为大，贯秋毫之末，而不为小。 先虚无而不为始，后天地而不为终，升积阳而不为明，沦重阴而不为晦。",
      "translated_text": "This is called the Dao.\n\nVirtue is what heaven and earth receive, what yin and yang rely upon, ordered by the five phases, woven by the four seasons. Governed by lords, instructed by teachers, the hidden and the manifest, the moving and the still—all flourish in due measure. Its beneficence flows without end, yet grasses grow unaware of its merit; its grace extends without limit, yet the hundred clans know not their dependence on its power. This is called virtue.\n\nThus, that which pervades and gives life is called the Dao, yet the Dao inherently has no name. That which accumulates and brings to completion is called virtue, yet virtue inherently has no designation.\n\nLet us attempt to discourse upon it: Heaven and earth, humans and things, spirits and immortals, ghosts and gods—without the Dao, none could be born; without the Dao, none could be perfected. The born know not their beginning; the perfected see not their end. Who, delving into mysteries and seeking the hidden, has glimpsed its source? It enters the end of being, emerges before non-being, yet none fathom its traces—it is called the natural. The natural is the constant of Dao and virtue, the warp of heaven and earth.\n\n*On Dao and Virtue*\n\nBefore the great void, what was there in the boundless silence? Through the utmost essence’s stirring, the True One arises. The True One moves spirit, and primordial qi transforms of itself. Primordial qi is the being within non-being, the non-being within being—vast beyond measure, subtle beyond fathoming. Steaming and spreading, it thickens into boundless obscurity; the ten thousand images’ inception, their first signs, arise here. The qi of clarity, purity, and luminosity floats upward to become heaven. The qi of turbidity, stagnation, and dullness accumulates to become earth. The qi of harmony, gentleness, and compliance coalesces into human relations. The qi of discord, rigidity, and perversity disperses into miscellaneous kinds. From the nurturing of this single qi, myriad differences are sown and kinds divided. Once entering the mechanism of transformation, change knows no end.\n\nThus, the forms of heaven and earth, humans and things, are primordial qi. That which receives the numinous brilliance of heaven and earth, humans and things, is spirit. Therefore, Qian and Kun govern heaven and earth, while essence and soul direct humans and things. Qi undergoes the alternations of yin and yang, but spirit knows no change with cold or heat. Though the myriad movements intertwine beyond reckoning, perishing and reviving, ending and beginning again—yet the body of Dao and virtue, the mind of spirit, respond and perceive without exhaustion, never wearied in the realm of activity.\n\n*On Primordial Qi*\n\n**Essentials of the Chapters**\n\nHeaven and earth cannot exist of themselves; that which possesses heaven and earth is the Supreme Ultimate. The Supreme Ultimate cannot move of itself; that which moves the Supreme Ultimate is true essence. True essence is natural—only spirit, only luminosity. Without ancestor, without origin, without beginning, without end. It contains harmony and harbors compassion, pitying the vulgar and mourning the benighted. Clear and turbid receive different endowments; the true and the common are not the same. Descending qi divides its light, and thus humans are born within. The wise and enlightened, broad in understanding, take universal relief as their work. As rulers and leaders, they enable all things to flow freely.\n\nPure yang blazes above, and above the nine heavens there is no yin. Pure yin lies darkly below, and below the nine earths there is no yang. The steaming intermingling of yin and yang to generate the ten thousand beings occurs precisely between heaven and earth. Thus, the configurations of qi shift and communicate, obscurity and brightness take form. Yang is bright and upright—its essence is true numen. Yin is dark and perverse—its essence is demonic illusion. Therefore, those born with the endowment of yang’s numen are wise and sagacious; those nurtured by yin’s dullness are fierce and stubborn. Yang delights in life, so the wise and sagacious are necessarily kind and harmonious. Yin delights in killing, so the fierce and stubborn are necessarily perverse and violent. As for those who are sometimes good and sometimes not—these are the mediocre, born of the equal blending of the two qi.\n\nEach of these receives its own endowment—where, then, is instruction to be applied? Instruction is applied for the mediocre. Why? The wise and sagacious know without teaching; the fierce and stubborn, though taught, do not change—both receive the pure qi of yin and yang. It is like fire, which can be extinguished but cannot be made cold, or ice, which can be melted but cannot be made hot—the principle is thus.\n\nThat which gives me life is the Dao; that which endows me is spirit. Yet longevity or early death, departure or abiding, do not depend on oneself. Why? Because when nature moves, it becomes emotion; when emotion returns to the Dao, one is thus moved by the mechanism of transformation and cannot maintain control.\n\nTo transcend the realm of existence and non-existence, to dwell in the realm of self-attainment—one may take the Dao as teacher and spirit as friend. What does this mean? The Dao and spirit act without acting, and qi transforms of itself; they deliberate without deliberating, and things complete themselves. They enter the ranks of the myriad kinds yet emerge beyond the bounds of life and death.\n\nThus, the noble person rejects desires, dismantles cleverness, sees without color, hears without sound. Serene and pure, embodying harmony and spirit clear—void and equanimous, forgetting form—one unites with the utmost essence. This is called returning to one’s origin, reuniting with the Dao. Creation cannot fathom it; ghosts and spirits cannot know it—how much less can humans?\n\nOne who is attuned to the Dao, though soaring beyond the cosmos, remains ever at peace in heart; though resting within the finest hair’s breadth, qi moves of itself. Thus, if the heart is not at peace, there is nothing by which to unite with the Dao; if qi does not move, there is nothing by which to preserve form. When form is preserved and the Dao is united, this is the virtue of heaven and earth.\n\nTherefore, one who moves yet does not know movement has transcended movement. One who is still yet does not know stillness has emerged from stillness. One who has transcended movement cannot be reckoned by yang. One who has emerged from stillness cannot be shifted by yin. If yin and yang cannot alter it, how much less can the ten thousand things? Thus, one who is not enticed by things is called utmost stillness. Utmost stillness can unite with utmost emptiness. When emptiness reaches its limit, there is clarity; when clarity reaches its limit, there is luminosity; when luminosity reaches its limit, there is penetration. The penetrating one—though heaven and earth are vast and the ten thousand things abundant—cannot escape the mirror of a single square inch.\n\nThe Dao encompasses countless numbers yet is not great; it penetrates the tip of an autumn hair yet is not small. It precedes the void yet is not a beginning; it follows heaven and earth yet is not an end. It ascends through accumulated yang yet is not bright; it sinks into layered yin yet is not dark.",
      "overlap_context": "boundless and without limit, dark and without counterpart. Profoundly obscure yet unable to be scrutinized, its great brightness sheds light; utterly still and without intent, yet the ten thousand things have their proper places. Vast and formless, silent and soundless—from it the ten thousand images arise, and the five notes are perfected. That which is born has its limit; that which is completed must wane. Birth and completion, completion and birth—unchanging from ancient times to the present.",
      "start_char": 6469,
      "end_char": 7697,
      "start_sentence": 368,
      "end_sentence": 440,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.575114250183105,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\群仙要语纂集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "本无神也，虚极而神自生。 本无气也，神运而气自化。 气本无质，凝委而成形。 形本无情，动用而亏性。 形成性动，去道弥远。 故溺於生死，迁於阴阳，不能自止，非道存而物亡也。 故道能自无而生有，岂不能使有同於无乎。 有同於无，则有不灭矣。 阴与阳并，而人乃生。 魂为阳神，魄为阴灵，结胎运气，育体构形。 然势不俱全，则各返其本。 故阴胜则阳竭而死，阳胜则阴消而仙。 柔和慈善贞清者，阳也。 刚狠嫉妬娌浊者，阴也。 心澹而虚，则阳和袭； 意燥而欲，则阴气入。 明此二者，阳胜阴伏，长生之渐也。 道不欲有心，有心则真气不集。 又不欲苦忘心，忘心则客邪来舍。 故我心不倾，则物无不正； 动念有着，则物无不邪。 邪正之来，在我而已。 故上学之士，怠於存念者，阴尸胜之也； 忻於勤纯者，阳神胜之也。 一怠一勤者，其战未决也。 决之者在於克节励操，务违懈怠之意，使精专无辍於斯须，久於其事者，尸销而神王，谓之阳胜。 阳胜者，道其邻乎。 且夫形动而心静，神凝而迹移者，无为也。 闲居而神扰，拱默而心驰者，有为也。 无为则理，有为则乱。 虽无为至易，非至明者不可致也。 夫天地昼亦无为，夜亦无为，无为则一，而理乱有殊，何哉？ 昼无为以明，故众阳见而群阴伏，夜无为以晦，故群阴行而众阳息。 是以主明而无为者，则忠良进，奸佞匿，而天下理。 主暗而有为者，则忠良隐，奸佞职，而天下乱。 故达者之无为以慧，蔽者之无为以昏。 慧则通乎道，昏则同乎物。 上学之士，时有高兴寄傲，陶然於自得之乡，谓真仙可接，霄汉可升者，神之王也。 虽曰神王，犹恐阳和之气发泄，阴邪之气承袭耳。 可入静室夷心，抑制所起，静默专一，则神不散而阳灵全，谨无恣其康乐之情，以致阴邪之来尔。 若有时躁竞烦悖者，乃形中诸魄为灵之气所炼，阴尸积滞将散扰於绛宫之真。 可入静室存一握固，候神清意平，合於虚静，斯亦洗心之一术耳。 言勿过乎行，行无愧乎心。 行之不已，则天地爱之，神明佑之，凶横无由加，鬼神不能扰。 若言清而行浊，名洁而迹污。 虽丑蔽於外，而心惭於内，天地疾之，神明殛之，虽力强於道，不可致也。 故宁受人之毁，无招天之谴，人毁犹可弭，天谴不可这也。 道之所至忌者，淫杀阴贼，此诚易戒。 至於小小喜怒，是非可否，人之常情，甚难慎也。 都不欲有纤芥之事，关乎方寸之中，虑静神闲，则邪气不能入，我志不扰，则真人为俦。 好誉而憎毁者，贤达之所未免。 然审己无善而获誉者不祥，省躬无疵而获谤者何伤。 阳之精曰魂与神，阴之精曰尸与魄。 神胜则为善，尸强则为恶，制恶兴善则理，忘善纵恶则乱。 理久则尸灭而魄炼，乱久则神逝而魂消。 尸灭魄炼者，神与形合而为仙，神逝魂消者，尸与魄同而为鬼，自然之道也。 夫目以妖艳为华，心以声名为贵，身好轻鲜之饰，口欲珍奇之味，耳快美好之音，鼻悦芳香之气。 此六者皆败德伤性，伐其灵根者也。 故有之则宜远，无之不足求。 惟衣与食，人之日用所切也，亦务道者之一弊耳。 然当委心任运，未有不浩其所用。 且天地之生禽兽也，犹覆之以羽毛，供之以虫粒，而祝於人乎。 必在忘其所趣，任其自然尔。",
      "translated_text": "Fundamentally, there is no spirit—only when emptiness reaches its limit does spirit arise of itself. Fundamentally, there is no qi—only when spirit moves does qi transform of itself. Qi is originally without substance; when it congeals and accumulates, it forms shape. Shape is originally without sentiment; when it moves and functions, it harms one’s nature. Once shape is formed and nature is set in motion, one drifts ever farther from the Dao.\n\nThus, one drowns in the cycle of life and death, drifts amid yin and yang, and cannot halt of one’s own accord—not because the Dao exists while things perish. If the Dao can generate being from non-being, how could it not make being merge with non-being? When being merges with non-being, being does not perish.\n\nYin and yang unite, and thus humans are born. The hun-soul is the yang spirit; the po-soul is the yin numen. They bind the embryo, circulate qi, nurture the body, and construct its form. Yet if their power is not equally complete, each returns to its origin. Thus, when yin prevails, yang is exhausted and one dies; when yang prevails, yin is consumed and one becomes an immortal.\n\nGentleness, kindness, integrity, and purity belong to yang. Harshness, cruelty, jealousy, and impurity belong to yin. When the mind is tranquil and empty, yang harmony pervades; when intent is restless and desirous, yin qi enters. Understanding these two, when yang prevails and yin submits, is the beginning of long life.\n\nThe Dao does not desire a mind, for if there is a mind, true qi does not gather. Yet one should not forcefully forget the mind, for if the mind is forgotten, external demons take residence. Thus, when my mind does not incline, nothing is not upright; when thoughts attach to things, nothing is not perverse. The coming of perversity or uprightness lies within me alone.\n\nTherefore, advanced students who are negligent in maintaining mindfulness are overcome by the yin corpse; those who delight in diligent purity are overcome by the yang spirit. Those who alternate between negligence and diligence remain in unresolved conflict. Resolution lies in disciplined effort and steadfast conduct, in resolutely opposing indolence, so that concentration persists without interruption for even a moment. Those who endure in this practice will see the corpse dissolve and the spirit flourish—this is called yang prevailing. When yang prevails, one draws near the Dao.\n\nMoreover, when the body moves yet the mind is still, when the spirit is concentrated yet one’s traces shift—this is non-action. When one dwells in leisure yet the spirit is disturbed, when one sits in silence yet the mind wanders—this is action. Non-action brings order; action brings chaos. Though non-action is supremely easy, only those of utmost clarity can attain it.\n\nHeaven and earth practice non-action by day and by night; in non-action they are one, yet order and chaos differ—why? By day, non-action is luminous, so the host of yang appears and the multitude of yin submits; by night, non-action is obscure, so the multitude of yin moves and the host of yang rests. Thus, when a ruler is enlightened and practices non-action, loyal ministers advance, treacherous officials hide, and the world is ordered. When a ruler is benighted and engages in action, loyal ministers withdraw, treacherous officials take office, and the world falls into chaos.\n\nTherefore, the wise practice non-action with wisdom, while the deluded practice non-action in confusion. Wisdom aligns with the Dao; confusion merges with things. Advanced students sometimes feel elation, indulging in pride, reveling in their self-satisfaction, believing they can commune with true immortals and ascend to the celestial realms—this is the flourishing of spirit. Though the spirit flourishes, one must still guard against the dissipation of yang harmony and the encroachment of yin demons.\n\nOne should enter a quiet chamber, pacify the mind, suppress arising thoughts, and abide in stillness and single-mindedness—thus the spirit does not scatter, and yang numinosity remains whole. One must carefully avoid indulging in feelings of ease and joy, lest yin demons draw near.\n\nIf at times one feels restless, competitive, or agitated, this is the refining of the many po-souls within the body by the numinous qi of the spirit, as the accumulated stagnation of the yin corpse disperses and disturbs the true within the Crimson Palace. One should enter a quiet chamber, maintain a firm grip, and await the spirit’s clarity and the mind’s calm, uniting with emptiness and stillness—this too is a method for cleansing the mind.\n\nWords should not exceed actions; actions should not shame the heart. Persisting in such conduct, heaven and earth cherish one, divine spirits protect one, misfortune cannot befall, and ghosts and spirits cannot disturb.\n\nIf one’s words are pure yet actions are impure, if one’s reputation is spotless yet one’s traces are defiled—though shame is concealed externally, the heart is ashamed internally. Heaven and earth detest such a one; divine spirits punish them. Though they may strive mightily for the Dao, they cannot attain it.\n\nThus, it is better to endure slander from others than to incur heaven’s censure. Human slander can still be dispelled; heaven’s censure cannot be evaded. What the Dao most abhors are licentiousness, killing, yin treachery—these are truly easy to avoid. As for minor likes and dislikes, judgments of right and wrong, these are common human tendencies, yet most difficult to guard against.\n\nOne should not allow even the slightest matter to disturb the square inch of the heart. When thoughts are still and the spirit is at ease, demonic qi cannot enter; when my will is undisturbed, the perfected become my companions.\n\nSeeking praise and resenting slander—even the worthy and enlightened are not free from this. Yet if one examines oneself and finds no goodness yet receives praise, this is inauspicious; if one reflects and finds no fault yet is slandered, what harm is there?\n\nThe essence of yang is the hun-soul and spirit; the essence of yin is the corpse and po-soul. When the spirit prevails, one does good; when the corpse is strong, one does evil. Restraining evil and promoting good brings order; forgetting good and indulging evil brings chaos. With prolonged order, the corpse perishes and the po-soul is refined; with prolonged chaos, the spirit departs and the hun-soul dissipates.\n\nWhen the corpse perishes and the po-soul is refined, spirit and form unite to become an immortal. When the spirit departs and the hun-soul dissipates, the corpse and po-soul merge to become a ghost—this is the natural Dao.\n\nThe eye delights in seductive beauty, the mind values fame and reputation, the body favors light and fine adornments, the mouth craves rare and exquisite flavors, the ear enjoys beautiful sounds, the nose delights in fragrant scents. These six senses all corrupt virtue, harm one’s nature, and sever one’s spiritual root. Thus, if one possesses them, one should distance oneself; if one lacks them, one need not seek them.\n\nOnly clothing and food are daily necessities for people, yet even these are one of the pitfalls for Dao cultivators. Nevertheless, one should entrust the heart to natural processes, and there will be no lack of what one needs.\n\nMoreover, when heaven and earth generate birds and beasts, they still cover them with feathers and provide them with insects and grains—how much more so for humans? One must forget one’s pursuits and follow nature.",
      "overlap_context": "hen luminosity reaches its limit, there is penetration. The penetrating one—though heaven and earth are vast and the ten thousand things abundant—cannot escape the mirror of a single square inch.\n\nThe Dao encompasses countless numbers yet is not great; it penetrates the tip of an autumn hair yet is not small. It precedes the void yet is not a beginning; it follows heaven and earth yet is not an end. It ascends through accumulated yang yet is not bright; it sinks into layered yin yet is not dark.",
      "start_char": 7697,
      "end_char": 8919,
      "start_sentence": 441,
      "end_sentence": 503,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.359719038009644,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\群仙要语纂集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "觉与阳合，寐与阴并。 觉多则魂强，寐久则瑰壮。 魂强者生之徒，魄壮者死之徒。 若餐元和，彻滋味，使神清气爽，至於昼夜不寐者，善无以加焉。 人心久任之，则浩荡而忘返； 顿栖之，则超跃而无根。 任之则蔽乎我性，栖之则劳乎我神，使致道者奚方而静。 盖性本至凝，物感而动，习动滋久，胡能遽宁。 既习动而播迁，可习静而恬晏。 故善习者寂而有裕，不善习者烦而无功。 是以将躁而制之以宁，将邪而闲之以正，将求而抑之以舍，将浊而澄之以清。 优哉游哉，不欲不营，行於是，止於是，造次於是，逍遥於是。 习此久者，则物冥於外，神鉴於内，不思静而自静矣。 故履霜为坚冰之始，习静为契道之阶。 古人云：积习生常。 其斯之谓欤。 或问古今学仙者多，而得道者少，何也？ 答曰：常人学道者千，而知道者一； 知道者千，而志道者一； 志道者千，而专精者一； 专精者千，而勤久者一。 是以学者众，而成者寡也。 或曰：仙者，人之所至美者也。 死者，人所之至恶者也。 世人君子罔有不知，而从俗者至多，习仙者至少，何也？ 答曰：此有二理，一者所禀之气非高，则所希之志难广。 故溺於近务，忘於远见，为声色所汩，嗜欲所昏，终执从於世网，竟无蹈於真域。 二者虽气禀清虚，神襟秀迈，而济物之功未备，则登仙之路犹远，是以迟回人爵，. 未解帝悬耳。 或曰：道本无象，仙贵有形，以有契无，理难长久，曷若得性遗形之妙乎？ 答曰：夫道至虚极也，含神运气，自无而生有。 故空洞杳冥者，大道无形之形也。 天地日月者，大道有形之形也。 以无系有，以有含无，故乾坤永存，仙圣不灭。 生者，天地之大德也。 所以示六合之广、三元之明者，为吾有形也。 一从沦化，而天地万物，尽非吾有。 死者，人伦之荼毒也。 是以炼凡至於仙，炼仙至於真，炼真合於妙，合妙同乎神。 神与道合，则道为我身，所以升玉京，游金阙，能有能无，不终不没，何谓理难长久乎。 若浊以得性为妙，不知炼形为要者，所谓清灵善爽之鬼，何可与高仙为比哉。 群仙要语纂集上竟 群仙要语纂集下",
      "translated_text": "Waking unites with yang, sleep merges with yin.\nExcessive waking strengthens the hun-soul; prolonged sleep fortifies the po-soul.\nThose with strong hun-souls belong to the living; those with robust po-souls belong to the dead.\nIf one consumes primordial harmony, purges rich flavors, and attains a state where spirit is clear and qi is crisp—even to the point of remaining awake day and night—nothing surpasses this goodness.\n\nWhen the human heart is left to its own devices for long, it becomes vast and forgets to return;\nwhen abruptly restrained, it leaps without root.\nLetting it roam obscures one’s nature; confining it wearies one’s spirit—how then can the Dao-seeker attain stillness?\nFor nature is fundamentally most serene, yet stirred by external stimuli.\nOnce habituated to movement, how can it suddenly find peace?\nHaving grown accustomed to movement and dispersal, one may instead cultivate stillness and tranquility.\n\nThus, those who cultivate stillness well become serene yet abundant;\nthose who do so poorly grow restless and achieve nothing.\nTherefore, when agitation arises, restrain it with calm;\nwhen deviance emerges, guard it with rectitude;\nwhen seeking begins, suppress it with relinquishment;\nwhen turbidity appears, clarify it with purity.\nLeisurely and carefree, neither desiring nor scheming—\nacting thus, abiding thus, hastening thus, wandering thus.\nWith long practice, external things grow dim while the inner spirit becomes luminous.\nWithout seeking stillness, one naturally attains it.\n\nThus, treading on frost marks the beginning of solid ice;\ncultivating stillness is the step toward uniting with the Dao.\nAs the ancients said: \"Accumulated habits become nature.\"\nThis is what they meant.\n\nSomeone asked: \"Many have sought immortality through the ages, yet few have attained the Dao. Why?\"\nThe answer: \"Among a thousand who study the Dao, one understands it;\namong a thousand who understand it, one aspires to it;\namong a thousand who aspire to it, one specializes in it;\namong a thousand who specialize, one persists long enough.\nThus, many study, but few succeed.\"\n\nAnother asked: \"Immortality is humanity’s highest beauty;\ndeath is humanity’s greatest evil.\nAll gentlemen know this, yet most follow convention while few cultivate immortality. Why?\"\nThe answer: \"There are two reasons.\nFirst, those whose endowment of qi is not lofty find their aspirations difficult to broaden.\nThus, they drown in immediate affairs, forget long-term vision,\nare submerged by sensual pleasures and deluded by desires,\nultimately entangled in the world’s net, never stepping into the realm of truth.\nSecond, though some possess pure and empty qi, with spirit and bearing refined and transcendent,\nif their merit in aiding others remains incomplete,\nthe path to immortality remains distant.\nThus, they linger in worldly ranks, unable to untie the celestial bonds.\"\n\nAnother asked: \"The Dao is originally formless, while immortality values form.\nTo unite the formed with the formless—how can this endure?\nWould it not be better to attain the wonder of preserving one’s nature while discarding form?\"\nThe answer: \"The Dao is utterly empty and boundless,\nencompassing spirit and moving qi, generating being from non-being.\nThus, the vast and obscure is the formless form of the Great Dao;\nheaven, earth, sun, and moon are the formed forms of the Great Dao.\nThe formless connects to the formed; the formed contains the formless.\nThus, heaven and earth endure forever, and immortals and sages never perish.\n\nLife is the great virtue of heaven and earth,\ndemonstrating the vastness of the six directions and the luminosity of the Three Origins—all because we possess form.\nOnce we succumb to dissolution, heaven, earth, and the myriad things no longer belong to us.\nDeath is the bitter poison of human relations.\nTherefore, refine the mortal to become immortal,\nrefine the immortal to become perfected,\nrefine the perfected to unite with the wondrous,\nunite with the wondrous to merge with the spirit.\nWhen spirit and Dao unite, the Dao becomes one’s body—\nthus ascending to Jade Capital, wandering in Golden Towers,\nable to be and not to be, neither ending nor perishing.\nHow can this be said to lack enduring principle?\n\nIf one mistakes attaining nature while neglecting the refinement of form as the ultimate wonder,\none becomes merely a clear and intelligent ghost—\nhow can this compare to the lofty immortals?\"\n\n*Collected Essential Sayings of the Immortals, Volume One Concluded*\n*Collected Essential Sayings of the Immortals, Volume Two*",
      "overlap_context": "ance oneself; if one lacks them, one need not seek them.\n\nOnly clothing and food are daily necessities for people, yet even these are one of the pitfalls for Dao cultivators. Nevertheless, one should entrust the heart to natural processes, and there will be no lack of what one needs.\n\nMoreover, when heaven and earth generate birds and beasts, they still cover them with feathers and provide them with insects and grains—how much more so for humans? One must forget one’s pursuits and follow nature.",
      "start_char": 8920,
      "end_char": 9734,
      "start_sentence": 504,
      "end_sentence": 545,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.24065089225769,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\群仙要语纂集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "还初道人董□醇编 虚靖天师心说 夫心者万法之宗，九窍之主，生死之本，善恶之源，与天地而并生，为神明之主宰。 或曰真君以其师长於一体也。 或曰真常以其越古今而不坏也。 或曰真如以其寂然而不动也。 用之则弥满六虚，废之则莫知其所。 其大无外，则宇宙在其间； 其细无内，则入秋毫之末，而不可以象求矣。 此所谓我之本心，而空劫以前本来之自己也。 然则果何物哉？ 杳兮冥兮，恍兮惚兮，不可以知知，不可以识识，强名曰道，强名曰神，强名曰性，强名曰心，如此而已。 由是观之，岂不大哉！ 岂不贵哉！",
      "translated_text": "The Reverted Origin Daoist Dong □ Chun’s Compilation\n*Master Xuqing’s Heart Discourse*\n\nThe heart is the origin of the ten thousand dharmas, the master of the nine apertures, the root of life and death, the source of good and evil. It comes into being alongside heaven and earth, governing the radiance of spirit. Some call it the True Lord, for it presides over the body as teacher and elder. Some call it the True Constant, for it transcends antiquity and modernity without decay. Some call it True Suchness, for it remains quiescent and unmoving.\n\nWhen activated, it pervades the six directions of emptiness; when abandoned, none know its whereabouts. Vast beyond measure, the cosmos lies within it; subtle beyond limit, it enters the tip of an autumn hair yet cannot be sought through form. This is what we call our fundamental heart, the original self before the empty kalpas.\n\nYet what, truly, is it? Vague and obscure, evanescent and elusive—it cannot be known through knowledge, nor grasped through perception. Forced to name it, we call it the Dao; forced to name it, we call it spirit; forced to name it, we call it nature; forced to name it, we call it heart. Only thus.\n\nBeholding it, how can one not exclaim its greatness! How can one not revere its preciousness!",
      "overlap_context": " one’s body—\nthus ascending to Jade Capital, wandering in Golden Towers,\nable to be and not to be, neither ending nor perishing.\nHow can this be said to lack enduring principle?\n\nIf one mistakes attaining nature while neglecting the refinement of form as the ultimate wonder,\none becomes merely a clear and intelligent ghost—\nhow can this compare to the lofty immortals?\"\n\n*Collected Essential Sayings of the Immortals, Volume One Concluded*\n*Collected Essential Sayings of the Immortals, Volume Two*",
      "start_char": 9734,
      "end_char": 9970,
      "start_sentence": 546,
      "end_sentence": 559,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.31633734703064,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\群仙要语纂集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "然输回生死而不能自己者何也？ 盖一念萌动於内，六识流转於外，不趋乎善则趋乎恶。 故有天堂地狱因果之报，六道轮回无有出期，可不痛哉！ 可不悲哉！ 若夫达人，则不然也。 故斋戒以诚明其德，一真澄湛，万祸消除。 《老子》曰：致虚极，守静笃，万物并作，吾以观其复。 夫物芸芸，各归其根，归根曰静，静曰复命。 复命曰常，知常曰明。 不知常妄作凶。 所谓常者，越古今而不坏者是也。 所谓妄者，一念才起者是也。 《庄子》曰：既以为物矣，欲复归根，不亦难乎。 在易也其为大人乎。 自兹以往，谨言语，节饮食，除垢止念，静心守一，虚无恬淡，寂寞无为，收视返听，和光同尘。 瞥起是病，不续是药，不怕念起，惟恐觉迟。 壁。 如有发，朝朝思理，有身有心，胡不如是。 行住坐卧，勿使须臾离也。 无何有之乡，华胥氏之国，吾其游焉。 大道歌 道不远，在身中，物即皆空性不空。 性若不空和气住，气归元海寿无穷。 欲得身中神不出，莫向灵台留一物。 物在心中神不清，耗散真精损筋骨。 神御气，气留形，不须杂术自长生。 术则易知道难遇，纵然遇了不专行。 所以千人万人学，毕竟终无一二成。 神若出，便收来，神返身中气自回。 如此朝朝还暮暮，自然赤子产真胎。 重阳祖师〔立教十五论〕 口论打坐 凡打坐者，非形体端然，瞑目合眼，谓之打坐，此假打坐也。 十二时辰，行住坐卧，一切动中，心似泰山，不摇不动，把断四门，眼耳鼻舌口，不令内入外出者，此名真打坐也。 能如此者，虽身处尘世，名已列於仙宫，不须远参，便是肉身圣贤。 三年行满，脱壳登仙，一粒丹成，神游八极矣。",
      "translated_text": "Yet why do we revolve through birth and death without self-mastery? For when a single thought stirs within, the six senses flow outward—turning toward good or toward evil. Thus arise the retributions of heaven and hell, the karmic consequences, the endless cycles of the six realms of rebirth. How grievous! How lamentable!\n\nThe enlightened, however, are not thus. Through fasting and abstinence, they clarify their virtue in utmost sincerity; with the One True settled and limpid, ten thousand calamities dissolve. As *Laozi* says: *\"Attain utmost emptiness, abide in profound stillness; while the ten thousand things arise together, I observe their return.\"* The myriad things flourish, each returning to its root—returning to the root is called stillness, stillness is called reverting to life’s mandate. To revert to life’s mandate is called constancy; to know constancy is called illumination. Not knowing constancy, reckless action brings misfortune. What is called *constancy* endures beyond past and present without decay; what is called *recklessness* arises the moment a single thought stirs. *Zhuangzi* says: *\"Once you have become a thing, to return again to the root is difficult.\"* Is this not the way of the *Great Person*?\n\nFrom this point onward, be cautious in speech, moderate in diet, eliminate defilements, halt thoughts, still the heart, and guard the One. Embrace emptiness, tranquility, and non-action; withdraw the gaze, reverse the hearing; harmonize with light, merge with dust. A fleeting thought’s arising is the illness; its non-continuation is the cure. Fear not the thought’s arising—only the delay in awakening. *Wall.*\n\nIf thoughts arise, each morning reflect and order them. Having body and mind, why not act thus? In walking, standing, sitting, and lying down, let not a single moment pass without this practice. In the land of *Nothing-Whatsoever*, the realm of *Huaxu*, I shall wander.\n\n**Song of the Great Dao**\nThe Dao is not far—it dwells within the body.\nAll things are empty, yet nature is not.\nIf nature is not empty, harmonious *qi* abides;\n*Qi* returns to the primordial sea, and life knows no end.\n\nTo keep the spirit within the body unscattered,\nlet not a single thing linger in the numinous terrace.\nIf things remain in the heart, the spirit grows clouded,\ndraining true essence and wasting sinew and bone.\n\nSpirit governs *qi*, *qi* sustains form—\nno need for miscellaneous arts to attain long life.\nArts are easy, but the Dao is hard to encounter;\neven if encountered, few practice it single-mindedly.\nThus, of a thousand or ten thousand who study,\nscarcely one or two ever succeed.\n\nIf the spirit departs, draw it back;\nwhen the spirit returns to the body, *qi* naturally follows.\nPractice this morning and night,\nand the true embryo of the *Red Child* will naturally form.\n\n**Wang Chongyang’s *Fifteen Discourses on Establishing the Teaching***\n**Discourse on Sitting in Meditation**\n\nSitting in meditation does not mean merely straightening the body, closing the eyes, and stilling the gaze—this is false meditation. True meditation occurs in all twelve hours, whether walking, standing, sitting, or lying down, in every moment of movement. The heart remains steadfast as Mount Tai, unshaken and unmoving, sealing the four gates—eyes, ears, nose, tongue, and mouth—so that nothing enters from without or departs from within. This is true meditation. One who achieves this, though dwelling in the dust of the world, is already enrolled among the immortals. No need to seek afar—such a one is a sage in the flesh. After three years of such practice, the shell is shed, and one ascends as an immortal. With the elixir formed, the spirit roams the eight directions.",
      "overlap_context": "ught through form. This is what we call our fundamental heart, the original self before the empty kalpas.\n\nYet what, truly, is it? Vague and obscure, evanescent and elusive—it cannot be known through knowledge, nor grasped through perception. Forced to name it, we call it the Dao; forced to name it, we call it spirit; forced to name it, we call it nature; forced to name it, we call it heart. Only thus.\n\nBeholding it, how can one not exclaim its greatness! How can one not revere its preciousness!",
      "start_char": 9970,
      "end_char": 10607,
      "start_sentence": 560,
      "end_sentence": 595,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.560822010040283,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\群仙要语纂集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "论降心 凡降心之道，若湛然不动，昏昏默默，不见万物，杳杳冥冥，不内不外，无丝毫念想，此是定心，不可降也。 若随境生心颠倒，寻头觅尾，此名乱心，败坏道德，损失性命，不可纵也。 行住坐卧，常勤降心，闻见觉知，此为病矣。 论炼性 理性如调琴，弦紧则有断，慢则不应，紧慢得中，则琴可矣。 又如铸剑，钢多则折，锡多则卷，钢锡得中，则剑可矣。 调炼真性者，体此二法。 论超三界 欲界、色界、无色界，此三界也。 心忘念虑，即超欲界侈心忘诸境，即超色界； 心不着空，即超无色界。 离此三界，神居仙圣之乡，性在玉清之境矣。 又诗云 弃了惺惺学得痴，到无为处无不为。 眼前世事只如此，耳畔风雷过不知。 两脚任从行处去，一灵常与气相随。 有时四大醺醺醉，借问青天我是谁。 坐忘铭 常默元气不伤，少思慧烛内光。 不怒百脉和畅，不恼心地清凉。 不求无谄无曲，不执可圆可方。 不贪便是富贵，不苟何惧君王。 味绝灵泉自降，气定真息自长。 触则形毙神游，想则梦离尸强。 气漏形归厚土，念漏神趋鬼乡。 心死方得神活，魄灭然后魂昌。 转物难穷妙理，应化不离真常。 至精潜于恍惚，大象混於渺茫。 造化若知规矩，鬼神莫测行藏。 不饮不食不寐，是谓真人坐忘。 文逸曹仙姑大道歌 我为诸君说端的，命带从来在真息。 照体长生空不空，灵鉴涵天容万物。 太极布妙人得一，得一善持谨勿失。 宫室虚闲神自居，灵府煎熬枯血液。 一悲一喜一思虑，一纵一劳形蠹弊。 朝伤暮损迷不知，丧乱精神无所据。 细细消磨渐渐衰，用竭元和神乃去。 只道行禅坐亦禅，圣可如斯凡不然。 萌芽脆嫩须含蓄，根识昏迷易变迁。 蹉跎不解去荆棘，未闻美稼出荒田。 九年功满火候足，应物无心神化速。 无心心即是真心，动静两忘为离欲。 神是性兮气是命，神不外驰气自定。 本来二物更谁亲，失却将何为本柄。 混合为一复忘一，可与元化同出没。 透金贯石不为难，坐脱立忘犹倏忽。 此道易知不易行，行忘所行道乃毕。 莫将闭息为真务，数息按图俱未是。 比来放下外尘劳，内有萦心两何异。 但看婴儿处胎时，岂解有心潜算计。 专气致柔神久留，往来真息自悠悠。 绵延迤逦归元命，不汲灵泉常自流。 三万六千为大功，阴阳节候在其中。 蒸融关脉变筋骨，处处光明无不通。 三彭走出阴尸宅，万国来朝赤帝宫。 借问真人何处来，从前元只在灵台。 昔年云雾深遮蔽，今日相逢道跟开。 此非一朝与一夕，是我本真不是术。 岁寒坚确如金石，战退阴魔加慧力。 皆由虚淡复精专，便是华胥清静国。 初将何事立根基，到无为处无不为。 念中境象须除拨，梦裹精神牢执持。 不动不静为大要，不方不圆为至道。 元和内炼即成真，呼吸外求终未了。 元气不住神不安，蠹木无根枝叶乾。 休论涕唾与精血，达本穷源总一般。 此物何曾有定位，随时变化因心意。 在体感热即为汗，在眼感悲即为泪。 在肾感念即为精，在鼻感风即为涕。 纵横流转润一身，到头不出於神水。 神水难言识者稀，资生一切由真气。 但知恬淡无思虑，斋戒宁心节言语。 一味醍醐甘露浆，饥渴消除见真素。 他时功满自逍遥，初日炼烹实勤苦。 勤苦之中又不勤，闲闲祇要养元神。",
      "translated_text": "**On Subduing the Heart**\n\nThe Way of subduing the heart is not stillness so profound that one is dull and silent, perceiving nothing of the myriad things, lost in darkness without inner or outer, devoid of the slightest thought—this is the heart in samādhi, not to be subdued. If the heart follows circumstances, rising and falling in confusion, chasing after beginnings and ends, this is the scattered heart, which corrupts virtue and power, harms the nature and the life, and must not be indulged.\n\nIn walking, standing, sitting, and lying down, one must diligently subdue the heart. To hear, see, sense, and know—these are already afflictions.\n\n**On Refining the Nature**\n\nRefining the nature is like tuning a zither: if the strings are too tight, they may snap; if too loose, they will not resonate. Only when tension is just right can the zither be played. It is also like forging a sword: too much steel makes it brittle, too much tin makes it bend. Only with the proper balance of steel and tin can the sword be wrought. Those who refine their true nature should embody these two principles.\n\n**On Transcending the Three Realms**\n\nThe Desire Realm, the Form Realm, and the Formless Realm—these are the Three Realms. When the heart forgets thoughts and cares, one transcends the Desire Realm. When the heart forgets all phenomena, one transcends the Form Realm. When the heart does not cling to emptiness, one transcends the Formless Realm. Departing these Three Realms, the spirit dwells in the land of immortals and sages, and the nature abides in the Jade Clarity.\n\nA poem says:\nAbandoning wakefulness to learn dullness,\nAt the place of non-doing, nothing is left undone.\nWorldly affairs are but this before the eyes,\nWhile thunder and wind pass unheard at the ear.\nThe feet wander where they will,\nThe single spirit ever follows the qi.\nAt times the four great elements grow drunk—\nI ask the blue sky: Who am I?\n\n**Inscription on Sitting in Forgetfulness**\n\nEver silent, the primordial qi remains unharmed;\nLess thought, the lamp of wisdom shines within.\nNo anger, the hundred vessels flow smoothly;\nNo vexation, the heart-ground is cool and clear.\nNo seeking, no flattery nor deceit;\nNo attachment, neither square nor round.\nNo greed is true wealth and nobility;\nNo impropriety fears even kings.\nTaste fades, the numinous spring descends of itself;\nQi settles, the true breath lengthens naturally.\nTouch, and the form perishes while the spirit roams;\nThought, and the dream departs while the corpse stiffens.\nQi leaks, the form returns to the thick earth;\nThoughts leak, the spirit hastens to the ghostly realm.\nOnly when the heart dies does the spirit live;\nOnly when the po is extinguished does the hun flourish.\nTurning things, the wondrous principle is inexhaustible;\nResponding to change, the true constant is never lost.\nSupreme essence hides in the indistinct;\nThe great image merges with the boundless.\nIf creation knew its compass and square,\nEven ghosts and spirits could not fathom its movements.\nNo drinking, no eating, no sleeping—\nThis is the true person’s sitting in forgetfulness.\n\n**Song of the Great Dao by Immortal Cao the Female Adept**\n\nI speak the truth to you all:\nLife has always been borne by the true breath.\nIlluminating the body, long life is empty yet not empty;\nThe numinous mirror embraces heaven and holds the ten thousand things.\nThe Supreme Polarity spreads its wonders, and humans obtain the One.\nHaving obtained the One, guard it well and never lose it.\nThe palace chambers are empty and tranquil, the spirit dwells of itself;\nThe numinous house is scorched, the blood and fluids wither.\nA single sorrow, a single joy, a single thought or care,\nA single indulgence, a single toil—these gnaw at the form.\nHarm at dawn, damage at dusk, deluded and unaware,\nThe spirit and essence scatter, with no place to rest.\nGradually worn away, slowly declining,\nThe primordial harmony is spent, and the spirit departs.\nThey say walking is meditation, sitting is also meditation—\nThe sage may be thus, but the common cannot.\nTender sprouts must be nurtured,\nFor the root-awareness is dim and easily shifts.\nWasting time without clearing the thorns,\nWho has heard of fine grain growing in a barren field?\nAfter nine years, the work is complete, the fire-tending sufficient;\nResponding to things without heart, the spirit transforms swiftly.\nThe heartless heart is the true heart;\nForgetting both movement and stillness is to leave desire.\nSpirit is nature, qi is life;\nWhen the spirit does not stray outward, the qi settles of itself.\nThese two things were originally close—who is closer?\nLose them, and what remains to grasp as the root?\nMerge them into one, then forget even the one—\nThen you may appear and disappear with the primordial transformation.\nPiercing metal and stone is no difficulty;\nSitting in liberation, standing in forgetfulness—swift as lightning.\nThis Dao is easy to know but hard to practice;\nForgetting the practice, the Dao is complete.\n\nDo not mistake breath-holding for the true task;\nCounting breaths or following diagrams—both are wrong.\nLately, lay down the toils of the external world,\nYet within, the heart is still entangled—what difference is there?\nObserve the infant in the womb—\nDoes it scheme in secret with a calculating heart?\nFocus the qi to achieve softness, the spirit lingers long;\nThe true breath comes and goes, naturally at ease.\nGently, sinuously, it returns to the primordial life;\nWithout drawing from the numinous spring, it flows of itself.\nThirty-six thousand days make the great work,\nThe nodes of yin and yang lie within.\nSteaming and fusing, the passes and vessels transform the sinews and bones;\nEverywhere, light shines, nothing is obstructed.\nThe Three Corpses depart the yin abode of the corpse;\nThe ten thousand nations come to pay homage at the Crimson Emperor’s palace.\nI ask the true person: Where have you come from?\nFrom the beginning, you were only in the numinous terrace.\nIn former years, clouds and mist deeply veiled you;\nToday, we meet, and the Dao’s path opens.\nThis is not the work of a morning or an evening—\nIt is my original true nature, not some technique.\nFirm as metal and stone in the cold of winter,\nRepelling yin demons with the power of wisdom.\nAll arises from emptiness and tranquility, returning to concentration—\nThis is the Land of Peace and Clarity in the realm of Hua Xu.\nWhat was first established as the root?\nAt the place of non-doing, nothing is left undone.\nImages in thought must be swept away;\nSpirit in dreams must be firmly held.\nNeither movement nor stillness is the great essential;\nNeither square nor round is the supreme Dao.\nRefining the primordial harmony within makes one true;\nSeeking breath without is never complete.\nIf the primordial qi does not abide, the spirit is not at peace—\nLike a worm-eaten tree with no roots, its branches and leaves wither.\nNo need to speak of tears, saliva, or essence and blood—\nTracing to the source, all are the same.\nThis thing has never had a fixed place;\nIt transforms with time according to the heart’s intent.\nIn the body, when moved by heat, it becomes sweat;\nIn the eyes, when moved by sorrow, it becomes tears.\nIn the kidneys, when moved by thought, it becomes essence;\nIn the nose, when moved by wind, it becomes mucus.\nFlowing and circulating, it moistens the entire body,\nYet in the end, it does not depart from the numinous water.\nThe numinous water is hard to describe—few recognize it—\nIt nourishes all things through the true qi.\nSimply know tranquility and non-thought,\nFast, quiet the heart, and moderate speech.\nA single taste of ghee and nectar,\nHunger and thirst vanish, the true simplicity appears.\nWhen the work is complete in time, you will be naturally free—\nAt first, the refining and cooking were truly arduous.\nYet within arduousness, there is no arduousness;\nLeisurely, one need only nurture the primordial spirit.",
      "overlap_context": "eadfast as Mount Tai, unshaken and unmoving, sealing the four gates—eyes, ears, nose, tongue, and mouth—so that nothing enters from without or departs from within. This is true meditation. One who achieves this, though dwelling in the dust of the world, is already enrolled among the immortals. No need to seek afar—such a one is a sage in the flesh. After three years of such practice, the shell is shed, and one ascends as an immortal. With the elixir formed, the spirit roams the eight directions.",
      "start_char": 10608,
      "end_char": 11849,
      "start_sentence": 596,
      "end_sentence": 672,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.0823917388916,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\群仙要语纂集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "奈何心使闲不得，到此纵擒全在人。 我今苦中苦更苦，木食草衣孤又静。 心知大道不能行，名迩与身为大病。 比如闲处用工夫，争似泰然修大定。 形神虽曰两难全，了命未能先了性。 不去奔名与逐利，绝了人情总无事。 决烈在人何住滞，在我更教谁制御。 掀天声价又如何，倚马文章非足贵。 荣华衣食总无心，积玉堆金复何济。 工巧文章与词赋，多能碍却修行路。 恰如薄雾与轻烟，闲傍落花随柳絮。 缥缈幽闲天地间，到了不能成雨露。 名与身兮竟孰亲，半生岁月太因循。 比来修炼赖神气，神气不安空苦辛。 可怜一个好基址，金殿玉堂无主人。 劝得主人长久住，置在虚闲无用处。 无中妙有执持难，解养婴儿须惜母。 缄藏俊辩黜聪明，收卷精神作愚鲁。 坚心一志任前程，大道於人终不负。 还真集 夫修行之人，若悟心地下功者，切忌分别，若生分别，尽属意家。 如何是心地下功？ 先须顿舍诸缘，次灭人我，绝尽贪嗔，形如槁木，心似寒灰，内外不分，同观一体，朗然莹彻，灵光自现。 灵光者，神光也。 光者，照也。 神光内照，更无暗昧，外境难侵也。 若昼夜内神光不灭，自然神定气和，此乃真修行也。 《庄子》曰：宇泰定者，发乎天光。 天光者，神用之道也。 既得天光下降，阴阳感击，至精发泄，海泛浪滚，一气上升至於泥丸，霹雳一声，百关神穴尽皆开通，乃是灵光所至也。 自然五脏生和，心经上涌，舌生甘津，鼻闻异香，饮食渐减，运火候炼肠胃中退滓，淘清去浊，回阴换阳，元气克腹，能绝饮食，万阴皆消也。 太上云：但服元和除五谷，是也。 如是此验，切忌身心轻忽，智神踊跃，心生懈怠，谈玄说妙，和气渐散，前功若不谨守，失其常者，暗为圣贤所折也。 论识心悟性 如要修行者，先须识心识意，然后悟性。 如何是心？ 如何是意？ 但能知觉谓之心，千思万想谓之意。 意从念起，心从物生。 既知起生之根源者，只在方寸。 方寸者，是本来之真心也。 心本无心，意本无意，为从来熟境难忘，心浮意动，却把真性蒙昧，不能显焕。 须是澄心定意，内观其心湛然〔不〕动者，谓之定； 定中觉灵者，谓之慧。 定是体，慧是用。 定慧两全者，日用不亏也。 论法界 法界者，太虚也，是太无也，空寂无相。 若论一年，乃是十一月建子，阳光落地，沈於九泉之下，属北方壬癸水，万物俱泯，杳冥无迹，恍惚无形，易谓之山水蒙。 自上为山，下为水，水火未济，以待其时，谓之童蒙也。 若论一月，以辨晦朔之期，月尽谓之晦，被太阳炼尽阴魄，日月同炉，光明不见，万象泯绝，中间阴魄复受太肠一点真胎，杳杳冥冥，昏昏默默，如太极未判，二仪未分，内隐重蒙之象也。 论二车般运 羊车载火，鹿车载水，羊鹿二车三宫来往，上下不停。 上田返中田，中田返下田，下田复返上田，上田返入气海，接着真气，三事共聚，再返起火也。 是周天火候，谓之大牛车，积累炼其金身也。 三车之外，别有一车，谓之破羊车。 有学道之人，与心意相投，性急太过，阴阳不停，或梦中见天崩地陷，捽破羊车，身体不安，四肢无力，而成疾病，心反成魔。 或见耶鬼，心神恍惚，进退不常，已入邪道，不能成真矣。 白玉誓玄关显秘论",
      "translated_text": "How then can the heart be made to rest,\nWhen at this point, capture or release lies wholly with the man?\nI now suffer within suffering—yet more suffering still—\nEating bark, clad in grass, solitary and still.\nThough the heart knows the Great Dao, it cannot be practiced,\nFor near fame and the body itself are grave maladies.\nBetter to cultivate in quietude with diligence,\nThan to strive anxiously for the Great Samādhi.\n\nThough form and spirit are said to be two and hard to unite,\nOne cannot complete destiny without first completing nature.\nCease chasing fame and profit,\nSever all worldly ties—then nothing remains to trouble you.\nResolute action lies with man—why linger?\nWho else can restrain or command me?\nWhat use are sky-high reputation,\nOr swift, polished compositions?\nFine robes and rich food hold no allure,\nWhat good are heaped jade and piled gold?\nClever craft and literary flourish,\nOnly obstruct the path of cultivation.\n\nLike thin mist or drifting smoke,\nIdle, they cling to falling blossoms and willow fluff,\nDrifting ethereal between heaven and earth,\nYet in the end, cannot become rain or dew.\nWhich is closer—name or self?\nHalf a lifetime spent in idle procrastination.\nOf late, cultivation relies on spirit and qi,\nYet if spirit and qi are unsettled, all toil is in vain.\nPity the fine foundation,\nA golden hall and jade chamber without a master.\nIf only the master could dwell long within,\nPlaced in emptiness and idleness—of what use?\nThe wondrous existence within non-being is hard to grasp,\nTo nurture the infant, one must cherish the mother.\nSeal away sharp eloquence, set aside cleverness,\nGather the spirit and feign foolishness.\nWith steadfast heart and single intent, follow the path ahead,\nFor the Great Dao will never betray man.\n\n*Returning to the True Collection*\n\nFor those who cultivate, if one awakens to the ground of the heart and applies effort, one must avoid discrimination. If discrimination arises, it belongs entirely to the realm of thought.\n\nWhat is effort applied to the ground of the heart?\nFirst, one must abruptly abandon all conditions,\nNext, extinguish self and others,\nEradicate greed and wrath completely,\nThe body like withered wood,\nThe heart like cold ashes.\nWithin and without undivided,\nAll observed as one body,\nLuminous and crystal-clear,\nThe numinous light appears of itself.\n\nThis numinous light is the light of spirit.\nLight is illumination.\nWhen the light of spirit illumines within, there is no darkness,\nAnd external states cannot invade.\nIf day and night the numinous light does not fade,\nNaturally, spirit settles and qi harmonizes—\nThis is true cultivation.\n\nAs *Zhuangzi* says: \"When the universe is at peace, it emits celestial light.\"\nThis celestial light is the functioning of the Dao of spirit.\nOnce celestial light descends,\nYin and yang interact,\nThe purest essence is released,\nLike the sea surging with rolling waves,\nA single qi ascends to the Mud Pill Palace,\nWith a thunderous crack,\nAll gates and spirit cavities open fully—\nThis is the arrival of the numinous light.\nNaturally, the five viscera generate harmony,\nThe heart channel wells upward,\nThe tongue produces sweet nectar,\nThe nose detects rare fragrances,\nAppetite gradually diminishes.\nRefining with fire and timing, the dross in the intestines and stomach is expelled,\nClearing the turbid and retaining the pure,\nReversing yin and restoring yang,\nPrimordial qi fills the abdomen,\nEnabling abstention from food,\nAll yin dissipates entirely.\n\nAs the Most High said: \"Simply ingest primordial harmony to dispel the five grains.\"\nWhen such signs appear,\nOne must not treat body and mind lightly,\nNor let the spirit of wisdom leap exuberantly,\nNor allow the heart to grow lax,\nNor engage in idle discourse on the profound and wondrous.\nIf harmony scatters,\nAnd prior merit is not carefully preserved,\nLosing constancy,\nOne will be secretly reproved by sages and worthies.\n\n*On Recognizing the Heart and Awakening to Nature*\n\nFor those who wish to cultivate,\nFirst recognize the heart, recognize thought,\nThen awaken to nature.\nWhat is the heart?\nWhat is thought?\nThat which can perceive is called the heart,\nThe myriad thoughts and reflections are called thought.\nThought arises from念,\nThe heart arises from objects.\nOnce the root of arising is known,\nIt lies solely within the square inch.\nThis square inch is the original true heart.\nThe heart is originally without heart,\nThought is originally without thought.\nYet from long familiarity, past states are hard to forget,\nThe heart floats, thought stirs,\nObscuring true nature, preventing its radiance.\nOne must settle the heart and stabilize thought,\nInwardly observe the heart—serene and unmoving—\nThis is called *ding*;\nWithin *ding*, awakened awareness is called *hui*.\n*Ding* is the essence, *hui* is the function.\nWhen *ding* and *hui* are both complete,\nDaily practice remains unbroken.\n\n*On the Dharma Realm*\n\nThe dharma realm is the great void,\nIt is the great nothingness,\nEmpty, still, and without form.\nIf we speak of a year,\nIt is the eleventh month, when yang builds at *zi*,\nYang light falls to earth,\nSinking beneath the nine springs,\nBelonging to the northern *ren* and *gui* water.\nAll things vanish,\nUtterly dark and traceless,\nVague and formless—\nThe *Yijing* calls this \"mountain and water veiling.\"\nAbove is mountain, below is water,\nWater and fire unjoined, awaiting their time—\nThis is called \"youthful veiling.\"\n\nIf we speak of a month,\nTo distinguish the dark and new moon phases,\nThe moon’s end is called *hui*,\nWhen the sun refines the yin essence completely,\nSun and moon share the same crucible,\nLight is unseen,\nAll images vanish,\nYet within, the yin essence receives a speck of true embryo from the great yang,\nDim and obscure,\nHushed and silent,\nLike the Supreme Ultimate unseparated,\nThe Two Modes undivided—\nWithin lies the image of layered veiling.\n\n*On the Two Carts Transporting*\n\nThe goat cart carries fire,\nThe deer cart carries water.\nThe goat and deer carts travel between the three palaces,\nUp and down without cease.\nThe upper field returns to the middle field,\nThe middle field returns to the lower field,\nThe lower field returns again to the upper field,\nThe upper field returns to the qi sea,\nJoining with true qi,\nThe three matters gather,\nThen fire is rekindled.\nThis is the fire timing of the celestial cycle,\nCalled the great ox cart,\nAccumulating and refining the golden body.\n\nBeyond the three carts, there is another—\nCalled the broken goat cart.\nSome cultivators,\nIn accord with heart and thought,\nImpatient and excessive,\nYin and yang unceasing,\nDream of heaven collapsing and earth splitting,\nSmashing the goat cart,\nThe body unwell,\nLimbs weak,\nIllness arises,\nThe heart becomes demonic.\nOr seeing demons and ghosts,\nThe spirit confused,\nAdvancing and retreating erratically,\nEntering deviant paths,\nUnable to attain the true.\n\n*White Jade Vows: Revealing the Secrets of the Mysterious Pass*",
      "overlap_context": "\nThe numinous water is hard to describe—few recognize it—\nIt nourishes all things through the true qi.\nSimply know tranquility and non-thought,\nFast, quiet the heart, and moderate speech.\nA single taste of ghee and nectar,\nHunger and thirst vanish, the true simplicity appears.\nWhen the work is complete in time, you will be naturally free—\nAt first, the refining and cooking were truly arduous.\nYet within arduousness, there is no arduousness;\nLeisurely, one need only nurture the primordial spirit.",
      "start_char": 11849,
      "end_char": 13083,
      "start_sentence": 673,
      "end_sentence": 731,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.3727924823761,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\群仙要语纂集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "一言半句便通玄，何必丹经千万篇。 人若不为形所累，眼前便是大罗天。 若要炼气凝神，须识归根复命。 所以道归根，自有归根窍。 复命还寻复命关，且如这个关窍。 若人得知真实处，则归根复命何难也。 故曰：有人要识神仙诀，只去搜寻造化根。 古者虚无生自然，自然生大道，大道生一气，一气分阴阳，阴阳为天地，天地生万物，则是造化之根也。 此乃真一之气，万象之先，太虚太无，太空太玄。 杳杳冥冥，非尺寸之可量； 浩浩荡荡，非涯岸之可测。 其大无外，其小无内，大包天地，小入毫芒，上无复色，下无复渊。 一物圆明，千古显露，不可得而名者，圣人以心契之，不获已而名之曰道。 以是知心即是道也。 故无心则与道合，有心则与道违。 惟此无之一字，包诸有而无余，生万物而不竭。 天地虽大，能役有形，不能役无形； 五行至精，能役有数，不能役无数； 百念纷纷，能役有识，不能役无识。 今夫修此道者，不若先炼形。 炼形之妙，在乎凝神，凝神则气聚，气聚则丹成，丹成则形固，形固则神全。 故宋齐丘云：忘形以养气，忘气以养神，忘神以养虚。 只此忘之一字，则是无物也。 本来无一物，何处有尘埃。 其斯之谓乎。 如能喻此理，就忘之一字做工夫，可入大道之渊微，夺自然之妙用，立丹基於顷刻，运造化於一身。 然此道视之寂寥无所睹，听之杳冥无所闻。 惟以心视之则有象，以心听之则有声。 若学之士冥心凝神，致虚守静，则虚室生白，信乎自然也。 惟太上度人，教人修炼，以乾坤为鼎器，以乌兔为药物，以日魂之升沈应气候之升降，以月魄之盈亏应精神之衰旺，以四季之节候应一日之时刻，以周天之星数应一炉之造化。 是故采精神以为药，取静定之火炼之，则成金液大还丹矣。 盖真阴真阳之交会，一水一火之配合，要在先辨浮沈，次明主客，审抽添之运用，察返复之安危。 故高象先云：采有日，取有时。 海蟾云：开阖乾坤造化机，煅炼一炉真日月。 能悟之者，效日月之运用，与天地以同功。 夫岂知天养无象，地养无体，故天长地久，日光月明，真一长存，虚空不朽也。 吾今则而象之，无心於事，无事於心。 内观其心，心无其心，外观其形，形无其形，远观其物，物无其物。 知心无心，知形无形，知物无物，超出万幻，确出一灵。 古经云：生我於虚，致我於无。 是宜归性根之太始，返未生之以前。 藏心於心心而不见，藏神於神通，神而不出。 故能三际圆通，万缘澄寂，六根清静，方寸虚明，不滞於空，不滞於无，空诸所宫，无诸所无，至於空无所空，无无所无，净裸裸赤洒洒地，则灵然而独存者。 道非欲虚，虚自归之，人能虚心，道自归之。 道本无名，近不可取，远不可舍，非方非圆，非内非外，惟圣人知之。 三毒无根，六欲无种，顿悟此理，归於虚无。 《老子》曰：天地之间，其犹橐钥乎，虚而不屈，动而愈出。 若能静定之中，抱冲和之气，守真一之精，则是封炉固济，以行火候。 火本南方离卦离属心，心者神也，神火也。 气则药，以火炼药成丹，既是以神驭气而成道也。 人能手搏日月，心握鸿蒙，自然见橐钥之开阖，河车之升降，水济命宫，火溉丹台，金火交并水土融和，姹女乘龙，金公跨虎，通透三关，上升内院，化为玉汞，下入重楼，中有一穴，名曰丹台。",
      "translated_text": "A single word or half a phrase may penetrate the mystery—\nWhy pore over ten thousand scrolls of alchemical scriptures?\nIf one is not burdened by the form of the body,\nBefore one’s eyes lies the Great Heavenly Net.\n\nTo refine qi and congeal spirit,\nOne must recognize the return to the root and restoration of life.\nThus the Dao speaks of returning to the root,\nFor the root has its own aperture.\nRestoring life means seeking the Gate of Life-Restoration—\nConsider this very gate and aperture.\nIf one grasps the true reality,\nThen returning to the root and restoring life is no difficulty.\n\nHence it is said:\nWhoever seeks the immortal’s secret\nNeed only search for the root of creation.\nOf old, Emptiness gave rise to the spontaneous,\nThe spontaneous gave rise to the Great Dao,\nThe Great Dao gave rise to the One Qi,\nThe One Qi divided into yin and yang,\nYin and yang became heaven and earth,\nHeaven and earth gave birth to the myriad things—\nThis is the root of creation.\nThis is the True One Qi,\nPrior to all phenomena,\nThe Great Void, the Utmost Non-Being,\nThe Great Emptiness, the Utmost Mystery.\nVast and obscure, beyond measure by inches;\nBoundless and expansive, beyond reckoning by shores.\nIts greatness has no exterior,\nIts smallness has no interior.\nIt encompasses heaven and earth,\nYet enters the tip of a hair.\nAbove, it has no further hue;\nBelow, it has no further abyss.\nA single thing, round and luminous,\nManifesting through the ages—\nUnnameable, yet the sage intuits it with the heart,\nAnd, compelled, names it the Dao.\n\nThus we know the heart is the Dao itself.\nWithout heart, one merges with the Dao;\nWith heart, one strays from the Dao.\nThis single word *wu* (non-being)\nEmbraces all existence without remainder,\nGives birth to the myriad things without exhaustion.\nThough heaven and earth are vast,\nThey can command the formed,\nBut not the formless;\nThough the Five Agents are most refined,\nThey can command the numbered,\nBut not the unnumbered;\nThough the hundred thoughts surge,\nThey can command the conscious,\nBut not the unconscious.\n\nNow, for those who cultivate this Dao,\nIt is best to first refine the form.\nThe subtlety of refining form lies in congealing spirit;\nCongeal spirit, and qi gathers;\nQi gathers, and the elixir forms;\nThe elixir forms, and the body is firm;\nThe body is firm, and spirit is whole.\nThus Song Qiqiu said:\nForget the form to nourish qi,\nForget qi to nourish spirit,\nForget spirit to nourish emptiness.\nThis single word *forgetting*—\nIt is the absence of things.\nOriginally, not a single thing exists—\nWhere could dust alight?\nThis is what is meant.\n\nIf one comprehends this principle\nAnd takes *forgetting* as the work,\nOne may enter the profound subtleties of the Great Dao,\nSeize the wondrous functioning of spontaneity,\nEstablish the foundation of the elixir in an instant,\nAnd circulate creation within the body.\nYet this Dao, when seen, appears desolate and nothing is perceived;\nWhen heard, it is obscure and nothing is heard.\nOnly with the heart can one see its images,\nOnly with the heart can one hear its sounds.\nIf the adept stills the heart and congeals spirit,\nAttains emptiness and guards quiescence,\nThen the empty chamber generates brightness—\nTruly, it is the spontaneous.\n\nOnly the Most High, in delivering beings,\nTeaches refinement:\nTaking heaven and earth as the crucible,\nThe sun and moon as the medicinal substances,\nThe rising and sinking of the sun’s essence corresponding to the ascent and descent of qi,\nThe waxing and waning of the moon’s spirit corresponding to the ebb and flow of vitality,\nThe seasons of the four quarters corresponding to the hours of a day,\nThe stars of the celestial revolution corresponding to the transformations within the furnace.\n\nThus, gathering spirit as the medicine,\nRefining it with the fire of stillness and concentration,\nOne forms the Great Return Elixir of Golden Liquor.\nFor the union of true yin and true yang,\nThe pairing of one water and one fire,\nOne must first distinguish floating and sinking,\nThen clarify host and guest,\nDiscern the operation of withdrawal and addition,\nAnd examine the safety and peril of return and reversal.\nThus Gao Xiangxian said:\nThere is a day for gathering,\nA time for taking.\nHai Chan said:\nThe mechanism of creation opens and closes heaven and earth,\nForging a furnace of true sun and moon.\n\nThose who awaken to this\nEmulate the functioning of sun and moon,\nAnd share the achievement of heaven and earth.\nHow could they know that heaven nourishes without form,\nEarth nourishes without substance?\nThus heaven endures and earth persists,\nThe sun shines and the moon glows,\nThe True One abides forever,\nAnd emptiness does not decay.\n\nNow, I model myself upon this:\nNo heart for affairs,\nNo affairs for the heart.\nInwardly observe the heart—\nThe heart has no heart;\nOutwardly observe the form—\nThe form has no form;\nObserve things afar—\nThings have no things.\nKnow the heart as no-heart,\nKnow the form as no-form,\nKnow things as no-things,\nTranscend the myriad illusions,\nAnd emerge as the solitary numinous.\nThe ancient scripture says:\nIt gives me birth in emptiness,\nIt leads me to non-being.\nThus one should return to the primordial root of nature,\nRevert to the time before birth.\nHide the heart within the heart, yet the heart is not seen;\nHide spirit within spirit’s penetration, yet spirit does not emerge.\nThus one may penetrate the three times,\nSettle the myriad conditions,\nPurify the six senses,\nAnd the square inch of the heart becomes empty and luminous.\nNot clinging to emptiness,\nNot clinging to non-being,\nEmptying all that can be named,\nEliminating all that is without—\nUntil emptiness is empty of emptiness,\nAnd non-being is non-being of non-being,\nPure, bare, and utterly unadorned—\nThen the numinous alone abides.\n\nThe Dao does not desire emptiness,\nYet emptiness naturally returns to it.\nIf one can empty the heart,\nThe Dao naturally returns to one.\nThe Dao originally has no name;\nIt cannot be grasped when near,\nNor abandoned when distant.\nIt is neither square nor round,\nNeither inside nor outside—\nOnly the sage knows it.\n\nThe three poisons have no root,\nThe six desires have no seed.\nSuddenly awakening to this principle,\nOne returns to emptiness and non-being.\n*Laozi* said:\nBetween heaven and earth,\nIs it not like a bellows?\nEmpty yet inexhaustible,\nThe more it moves, the more it produces.\n\nIf, within stillness and concentration,\nOne embraces the qi of harmonious balance,\nAnd guards the essence of the True One,\nThis is sealing the furnace and securing the crucible\nTo enact the fire timing.\nFire originates from the southern *li* trigram,\nWhich pertains to the heart—\nThe heart is spirit, spirit is fire.\nQi is the medicine;\nRefining the medicine with fire forms the elixir—\nThus it is using spirit to guide qi and accomplish the Dao.\n\nIf one can grasp the sun and moon in hand,\nHold the primordial chaos in the heart,\nOne naturally perceives the opening and closing of the bellows,\nThe ascent and descent of the river chariot,\nWater irrigating the Palace of Life,\nFire nourishing the Elixir Terrace,\nMetal and fire intermingling, water and earth harmonizing,\nThe maiden riding the dragon,\nThe old man straddling the tiger,\nPassing through the three barriers,\nAscending to the inner court,\nTransforming into jade mercury,\nDescending into the multi-storied tower—\nWithin it lies a cavity,\nCalled the Elixir Terrace.",
      "overlap_context": "rts, there is another—\nCalled the broken goat cart.\nSome cultivators,\nIn accord with heart and thought,\nImpatient and excessive,\nYin and yang unceasing,\nDream of heaven collapsing and earth splitting,\nSmashing the goat cart,\nThe body unwell,\nLimbs weak,\nIllness arises,\nThe heart becomes demonic.\nOr seeing demons and ghosts,\nThe spirit confused,\nAdvancing and retreating erratically,\nEntering deviant paths,\nUnable to attain the true.\n\n*White Jade Vows: Revealing the Secrets of the Mysterious Pass*",
      "start_char": 13083,
      "end_char": 14332,
      "start_sentence": 732,
      "end_sentence": 782,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.50864791870117,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\群仙要语纂集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "铅汞相投，水火相合，有动之动，出於不动，有为之为，出於无为。 当是时也，白雪漫天，黄芽满地，龙吟虎啸，夫唱妇随，玉鼎汤煎，金炉火炽，雷轰电掣，撼动乾坤，百脉耸然，三关透彻，玄珠成象，太一归真，泥丸风生，绛宫月明，丹田烟暖，谷海波澄，炼成还丹，易如反掌。 七返九还，方成大药，日炼时烹，以至九转，天关地轴，在吾手中。 经云：人能常清静，天地悉皆归。 则是三华聚顶，五气朝元，可久入众妙门，玄之又玄也。 更能昼运灵旗，夜孕火芝，温就圣胎，结成赤子，至於脱胎神化，回阳换骨，则是玉符保神，金液炼形，形神俱妙，与道合真。 张平叔云：都来片饷工夫，永保无穷逸乐。 诚哉是言也。 盖道之基，德之本，龙虎之宗，铅汞之祖，三火所聚，八水同归，万神朝会之门，金丹妙用之源，乃归根复命之关窍也。 既能知此，则欲不必遣，而心自静，心不必澄，而神自清。 一念不生，万幻俱寝，身驭扶摇，神游淡漠。 方知道风清月白，皆显扬铅汞之基； 水绿山青，尽发露虎龙之旨。 海南白紫清，初从陈泥丸学丹法，每遇日中之冬至，则开乾破巽，留坤塞艮，据天罡，持斗柄，谒轩辕，过扶桑，入广寒，面鹑尾，举黄钟，泛海槎，登昆仑，佩唐符，撼天雷，游巫山，呼黄童，召朱儿，取青龙肝，白虎髓，赤凤血，黑龟精，入土釜，启荧惑，命关伯，化丹砂，开华池，吸神水，饮刀圭，从无入有，无质生质，抽铅添汞，结成圣胎，十月既满，气足形圆，身外有身，谓之胎仙。 其诀曰：用志不分，乃可凝神，灰心冥冥，金丹内成。 此予之所得也如此。",
      "translated_text": "Lead and mercury unite, water and fire merge—\nThe movement of movement arises from stillness,\nThe action of action emerges from non-action.\n\nAt this moment,\nWhite snow blankets the sky,\nYellow sprouts carpet the earth,\nDragon hums, tiger roars,\nHusband sings, wife follows,\nThe jade crucible simmers,\nThe golden furnace blazes,\nThunder crashes, lightning flashes,\nShaking heaven and earth,\nAll meridians tremble,\nThe three barriers open wide,\nThe mysterious pearl takes form,\nThe Great One returns to truth,\nWinds stir in the Mud Pill Palace,\nMoonlight fills the Crimson Palace,\nMists warm the Elixir Field,\nWaves in the Valley Sea grow still—\nRefining the returning elixir\nIs as easy as turning one’s palm.\n\nSeven reversions, nine returns—\nOnly then is the great medicine complete.\nRefined by day, simmered by the hour,\nUntil ninefold transmutation is achieved,\nThe celestial gate and earthly axis\nLie within one’s grasp.\n\nAs the scripture says:\n*If one can abide in constant clarity and stillness,\nHeaven and earth all return to them.*\n\nThus the three flowers gather at the crown,\nThe five qi converge at the origin,\nOne may enter the gate of myriad mysteries,\nThe profound beyond the profound.\n\nIf one further cultivates the spirit banner by day\nAnd nurtures the fiery zhi by night,\nWarming the sacred embryo,\nForming the crimson child—\nThen, through embryonic transformation and divine alchemy,\nReverting yang and renewing the bones,\nOne safeguards the spirit with the jade talisman,\nRefines the body with golden liquid,\nUntil form and spirit are both perfected,\nAnd merge with the true Dao.\n\nZhang Ping Shu said:\n*All this takes but a moment’s effort,\nYet secures boundless ease and joy.*\nTruly, these are wise words.\n\nFor the foundation of the Dao,\nThe root of virtue,\nThe origin of dragon and tiger,\nThe ancestor of lead and mercury,\nThe convergence of the three fires,\nThe return of the eight waters,\nThe gate where all spirits gather,\nThe source of the golden elixir’s wondrous work—\nThis is the pivotal aperture of returning to the root and restoring life.\n\nOnce this is known,\nDesires need not be banished—\nThe heart grows still of itself.\nThe heart need not be clarified—\nThe spirit grows clear of itself.\nWith no thought arising,\nAll illusions subside.\nThe body rides the whirlwind,\nThe spirit roams the ethereal void.\n\nOnly then does one realize:\nThe breeze’s clarity, the moon’s purity\nAll reveal the foundation of lead and mercury;\nThe green of water, the blue of mountains\nAll disclose the essence of tiger and dragon.\n\nBai Zi Qing of Hainan,\nWho first learned the elixir method from Chen Ni Wan,\nWould at the winter solstice at high noon\nOpen Qian and break Xun,\nRetain Kun and block Gen,\nGrasp the celestial pivot,\nWield the Dipper’s handle,\nPay homage to the Xuanyuan,\nPass the Fusang,\nEnter the Guanghan,\nFace the Quail’s Tail,\nRaise the Yellow Bell,\nSail the sea raft,\nAscend Kunlun,\nBear the Tang talisman,\nShake the celestial thunder,\nWander Wu Mountain,\nSummon the Yellow Lad,\nCall the Vermilion Child,\nTake the green dragon’s liver,\nThe white tiger’s marrow,\nThe red phoenix’s blood,\nThe black turtle’s essence,\nPlace them in the earthen crucible,\nAwaken the Fire Star,\nCommand Guan Bo,\nTransform cinnabar,\nOpen the Flower Pool,\nAbsorb the divine water,\nDrink the medicinal spoon,\nMove from non-being into being,\nFrom formlessness into form,\nWithdraw lead and replenish mercury,\nForming the sacred embryo.\nAfter ten months,\nQi is full, form is complete,\nA body exists beyond the body—\nThis is called the embryonic immortal.\n\nIts secret states:\n*With undivided focus, one may concentrate the spirit;\nWith an ashen heart in profound stillness,\nThe golden elixir forms within.*\nSuch is what I have attained.",
      "overlap_context": "art,\nOne naturally perceives the opening and closing of the bellows,\nThe ascent and descent of the river chariot,\nWater irrigating the Palace of Life,\nFire nourishing the Elixir Terrace,\nMetal and fire intermingling, water and earth harmonizing,\nThe maiden riding the dragon,\nThe old man straddling the tiger,\nPassing through the three barriers,\nAscending to the inner court,\nTransforming into jade mercury,\nDescending into the multi-storied tower—\nWithin it lies a cavity,\nCalled the Elixir Terrace.",
      "start_char": 14332,
      "end_char": 14947,
      "start_sentence": 783,
      "end_sentence": 798,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.66783046722412,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\群仙要语纂集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "施肩吾云：气是添年药，心为使气神，若知行气诀，便是得仙人。 此诗简明，通玄造妙。 故佩而诵之，自然到秋蟾丽天、虚空消陨之地。 非枯木寒泉之士，不能知此。 余既得此，不容自默。 太上玄科曰：遇人不传失天道，传非其人泄天宝。 天涯海角寻徧无人，不容轻传，恐受天谴。 深虑大道无传，丹经湮泯，故作《玄关显秘论》。 盖将晓斯世，以诏后来，而寿金丹之一脉也。 复恐世人犹昧此理，乃复为之说曰： 以眼视眼，以耳听耳，以鼻调鼻，以口缄口，潜藏飞跃，在乎一心。 先当习定凝神，惩忿窒欲，则水火既济，则金木交并。 金木交并，则真土归位。 真土归位，则金丹自然大如黍珠。 日服一粒，神气复克塞天地。 《孟子》曰：善养吾浩然之气者，此也。 学者思之，敬书以授留紫元云。 马丹阳真人直言",
      "translated_text": "Master Shi Jianwu says:\nQi is the medicine that adds years to life,\nThe heart commands the spirit of qi.\nWhoever grasps the secret of circulating qi\nIs already an immortal.\n\nThis verse is concise yet profound, penetrating the mysteries to their subtlest depths. Thus, I carry it upon my person and recite it, naturally arriving at the realm where the autumn moon graces the sky and the void dissolves into nothingness. Only those who are like withered trees or cold springs can comprehend this. Having attained this knowledge, I cannot remain silent.\n\nThe Supreme Mysterious Statutes state:\nTo meet someone and not transmit is to lose the Dao of Heaven;\nTo transmit to the unworthy is to leak Heaven’s treasure.\nThough I have searched to the ends of the earth, I find no one—\nI dare not lightly transmit it, lest I incur Heaven’s punishment.\n\nDeeply concerned that the Great Dao may go untransmitted and the cinnabar classics may fade into oblivion, I compose the *Treatise on Revealing the Mysteries of the Mysterious Pass*. This is to enlighten this world, instruct later generations, and preserve the lineage of the golden elixir.\n\nYet fearing that people may still remain ignorant of this principle, I further explain:\nWith the eye, see the eye;\nWith the ear, hear the ear;\nWith the nose, regulate the nose;\nWith the mouth, seal the mouth.\nConcealment and soaring flight lie within the single heart.\n\nFirst, one must practice stillness and concentrate the spirit,\nCurb anger and restrain desire—\nThen water and fire achieve harmony,\nAnd metal and wood unite.\nWhen metal and wood unite,\nThe true earth returns to its place.\nWhen the true earth returns to its place,\nThe golden elixir naturally grows as large as a millet grain.\nConsuming one pellet daily,\nThe spirit and qi will once more fill Heaven and Earth.\n\nAs Mencius said: *\"This is what it means to well nurture my vast and flowing qi.\"*\nLet the seeker reflect upon this.\n\nRespectfully inscribed and bestowed upon Liu Ziyuan.\n—The Straightforward Words of Perfected Man Ma Danyang",
      "overlap_context": "r,\nOpen the Flower Pool,\nAbsorb the divine water,\nDrink the medicinal spoon,\nMove from non-being into being,\nFrom formlessness into form,\nWithdraw lead and replenish mercury,\nForming the sacred embryo.\nAfter ten months,\nQi is full, form is complete,\nA body exists beyond the body—\nThis is called the embryonic immortal.\n\nIts secret states:\n*With undivided focus, one may concentrate the spirit;\nWith an ashen heart in profound stillness,\nThe golden elixir forms within.*\nSuch is what I have attained.",
      "start_char": 14947,
      "end_char": 15268,
      "start_sentence": 799,
      "end_sentence": 816,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.53964114189148,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\群仙要语纂集.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "断情除欲降心，休与亲戚相见，休教心到处去。 行住坐卧，乃至搬柴运水，或上茅去，也要心定念止，湛然不动，名为真心。 要处静心闲少语，住好伴。 莫生念，念是业根。 若外不入，内不出，常少语，自然心定气调。 若不澄心止念，去欲断情，更外入内出，出去外游，如何得自然调息？ 只是一座空舍，出者便是猿马也。 自古过去一切神仙，不敢越过澄湛二字。 又要心不逐一切物去，心猿牢捉丹无漏，意马常擒性自明。 坐园先生云：动者心，起者念，去者意，心澄意定，物我俱忘，澄澄湛湛。 只显一性应物，皆是心见物，要不昧一性。 若只见物不见性，便着边徽，却有轮回。 又云：只缘见物不见性，便是昧了一切。 行住坐卧，只要降心，使一性常现不昧。 止念者，常要觉一切尘念皆是业根，须要澄湛一性，照破万缘，一切虚假，其念细细，调熟不起。 或问曰：如何是应物不昧？ 答曰：耳目虽是闻见，口内虽是言说，只要心不着他。 或问：〔如何是〕鬼神不测处？ 答曰：只那一切虚寂便是也。 又问玄牝之门是谓天地根。 答曰：玄者父，牝者母。 各人八两，合成一斤。 一点元阳之气，便是根本。 又问复命归根。 答曰：只要心不逐一切物去，不染不着，心不起，气不散，便是归根。 若不能如此者，不得归根也。 又问：如何是见性？ 答曰：那无心无念，不着一物，澄澄湛湛，似月当空。 群仙要语纂集下竟",
      "translated_text": "Sever emotions, eliminate desires, and subdue the heart-mind.\nCease meeting with relatives, and do not let the heart-mind wander.\nIn walking, standing, sitting, or lying—even in carrying firewood or drawing water, or when relieving oneself—maintain a settled heart-mind, thoughts stilled, serene and unshaken: this is the true heart-mind.\nSeek quietude, still the heart-mind, speak little, and keep good company.\nDo not generate thoughts, for thoughts are the root of karmic action.\nIf nothing enters from without and nothing issues from within, and if speech is sparse, the heart-mind will naturally settle and qi harmonize.\nIf one does not purify the heart-mind and still thoughts, sever desires and cut off emotions, but instead allows external distractions to enter and internal impulses to exit, wandering abroad—how can natural breath-regulation be achieved?\nSuch a person is but an empty dwelling, and what departs is none other than the monkey and horse.\n\nSince ancient times, all immortals have never dared to transgress the two words: *clarity* and *serenity*.\nMoreover, the heart-mind must not chase after external things.\nFirmly seize the heart-monkey to ensure the elixir remains without leakage,\nConstantly restrain the intent-horse so that inherent nature becomes luminous.\n\nMaster Zuo Yuan said:\n*\"That which moves is the heart-mind; that which arises is thought; that which departs is intent.\nWhen the heart-mind is clear and intent is settled, self and other are both forgotten—serene and still.\nOnly the single nature responds to phenomena.\nAll is the heart-mind perceiving things; one must not obscure this single nature.\nIf one sees only things and not nature, one clings to the margins and cycles through rebirth.\"*\n\nHe also said:\n*\"Only because one sees things and not nature does one obscure everything.\nIn walking, standing, sitting, or lying, one must only subdue the heart-mind,\nSo that the single nature remains ever-present and unobscured.\"*\n\nTo still thoughts is to constantly awaken to the fact that all worldly thoughts are the root of karmic action.\nOne must purify and still this single nature, illuminating and dissolving the ten thousand conditions—all illusions.\nThoughts should be fine and subtle, so refined that they do not arise.\n\nSomeone asked: *\"What does it mean to respond to phenomena without obscuration?\"*\nThe answer: *\"Though the ears and eyes hear and see, and the mouth speaks, the heart-mind must not cling to them.\"*\n\nAnother asked: *\"Where is the unfathomable realm of spirits and gods?\"*\nThe answer: *\"It is precisely that state of utter emptiness and stillness.\"*\n\nYet another asked about the *\"Gate of the Mysterious Female, called the root of Heaven and Earth.\"*\nThe answer: *\"The Mysterious is the father; the Female is the mother.\nEach person possesses eight ounces, which together make one catty.\nA single spark of primordial yang qi is the root itself.\"*\n\nSomeone asked about *\"returning to life and reverting to the root.\"*\nThe answer: *\"One must only ensure the heart-mind does not chase after external things, remains unstained and unattached, the heart-mind unaroused, qi undispersed—this is reverting to the root.\nIf one cannot do this, one does not return to the root.\"*\n\nAnother asked: *\"What is seeing nature?\"*\nThe answer: *\"It is that state of no heart-mind, no thought, not clinging to a single thing—serene and still, like the moon in the sky.\"*\n\n*—The Essential Sayings of the Immortals, Concluded*",
      "overlap_context": "metal and wood unite.\nWhen metal and wood unite,\nThe true earth returns to its place.\nWhen the true earth returns to its place,\nThe golden elixir naturally grows as large as a millet grain.\nConsuming one pellet daily,\nThe spirit and qi will once more fill Heaven and Earth.\n\nAs Mencius said: *\"This is what it means to well nurture my vast and flowing qi.\"*\nLet the seeker reflect upon this.\n\nRespectfully inscribed and bestowed upon Liu Ziyuan.\n—The Straightforward Words of Perfected Man Ma Danyang",
      "start_char": 15268,
      "end_char": 15812,
      "start_sentence": 817,
      "end_sentence": 845,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.268773555755615,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\群仙要语纂集.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}