{
  "source_id": "老子道德经（晋王弼）",
  "source_file": "chunked_daozang\\老子道德经（晋王弼）.json",
  "total_chunks": 42,
  "total_original_chars": 23074,
  "total_translated_chars": 114854,
  "total_translation_time": 636.4730310440063,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
    "category": "藏外"
  },
  "full_translation": "The Imperial *Complete Library of the Four Treasuries*\n*Masters Section, Fourteenth Division: Laozi’s Dao and Virtue Classic*\n*Daoist School – Descriptive Summary*\n\nWe, your ministers, respectfully note: *Wang Bi’s Commentary on the Laozi* in two fascicles. According to the *Bibliographic Treatise* of the *History of the Sui*, there exists *Laozi’s Dao and Virtue Classic* in two fascicles with Wang Bi’s commentary. The *Old唐书*’s *Bibliographic Treatise* records *Yuan Yan’s New Record of the Dao and Virtue* in two fascicles, also attributed to Bi’s commentary, though the title differs. The *New唐书*’s *Treatise on Arts and Letters* further attributes *Yuan Yan’s New Record of the Dao and Virtue* to Wang Su, while Bi’s commentary is separately titled *New Record of Yuan Yan’s Dao and Virtue*—clearly a case of confusion, where one text was mistakenly divided into two, with its passages disordered.\n\nOnly the *History of the Song*’s *Treatise on Arts and Letters* records *Wang Bi’s Commentary on the Laozi*, matching this edition; thus, we follow it. Qian Zeng’s *Record of Reading with Keen Seeking* states that Bi’s commentary on the *Laozi* no longer survives, yet during the Wanli reign of the Ming, Zhang Zhixiang of Zhonghuating indeed produced a printed edition. Comparing it with the *Exegesis of the Classics* and the *Yongle Encyclopedia*, the texts align precisely. The *Heavenly Auspices* chapter of the *Liezi* cites the six lines beginning with “The Valley Spirit never dies,” and Zhang Zhan’s commentary also quotes Bi’s annotations to explicate them—though a few characters are altered, the meaning remains unchanged, confirming it is not a forgery. Qian Zeng likely never encountered it by chance.\n\nThis edition is transcribed from Zhang’s *Three Classics with Jin Commentaries*, though it is not without omissions and errors, its general sense remains discernible. A postscript by Chao Shuo of Fang, dated the *yiwei* year of the Zhenghe reign, notes that the text contains many errors. Another colophon by Xiong Ke, reprinted in the *gengyin* year of the Qiandao reign, states that it had become rare in recent times—only after a long search was it obtained. Thus, even in the Song dynasty, fine editions were scarce.\n\nHowever, both Chao and Fang remark that the text does not divide the *Dao Classic* and *Virtue Classic*, whereas the *Exegesis of the Classics* explicitly titles the first fascicle *Pronunciation and Meaning of the Dao Classic* and the second *Pronunciation and Meaning of the Virtue Classic*—inconsistent with this edition and the postscripts. Could it be that the transcribers of the *Exegesis* added these divisions based on a vulgar edition? Chen Zhensun’s *Book Catalogue with Annotations* still records it as undivided into *Dao* and *Virtue* sections. Lu You’s collected works include a postscript stating: “Chao, by way of Dao, said: Wang Fusi’s *Commentary on the Laozi* is titled *Dao and Virtue Classic*, not splitting *Dao* and *Virtue* into upper and lower sections—this is closer to antiquity.” Yet this edition has already been divided. How can we be certain that other arbitrary alterations have not been made?\n\nThe postscript was written in the *wuyin* year of the Qingyuan reign (1198), which was no longer the edition seen by Chao Yidao. Thus, the *Pronunciation and Meaning of the Classics* had already suffered arbitrary alterations for quite some time.\n\nRespectfully collated and presented in the second month of the forty-third year of the Qianlong reign (1778).\n\n*Chief Compilers:*\nMinister Ji Yun\nMinister Lu Feixiong\nMinister Sun Shiyi\n\n*Chief Collator:*\nMinister Lu Feichi\n\n*Imperially Commissioned Complete Library of the Four Treasuries*\n\n*Laozi’s Dao and Virtue Classic, Upper Fascicle*\n*Commentary by Wang Bi of Wei*\n\n**Chapter One**\n[*Note: In the He Shanggong commentary, this is the \"Embodying the Dao\" chapter. Here follows the original text of Wang Bi’s commentary as recorded by Zhang Zhixiang.*]\n\nThe Dao that can be spoken is not the constant Dao.\nThe name that can be named is not the constant name.\n\nThe Dao that can be spoken and the name that can be named refer to concrete things and formed shapes—they are not constant. Thus, they cannot be spoken of as Dao, nor can they be named.\n\n\"Nameless\" is the beginning of Heaven and Earth.\n\"Named\" is the mother of the myriad things.\n\nAll that exists begins from nothing. Thus, when things are unformed and nameless, this is the beginning of the myriad things. When they have form and name, this is when they are reared, nourished, ripened, and matured—acting as their mother. The Dao begins the myriad things with formless nothingness and completes them with the beginning, yet one does not know the mystery of how it accomplishes this—hence, it is again mysterious.\n\nTherefore, in constant nothingness, observe its wonder.\n[*Note: The *Yongle Encyclopedia* omits the character *gu* (故, \"therefore\") before this line.*]\n\n\"Wonder\" is the ultimate of subtlety. All things begin from subtlety before reaching completion; they begin from nothingness before coming into being. Thus, in constant nothingness and emptiness, one may observe the wonder of the beginning of things.\n\nIn constant having, observe its manifestations.\n\n\"Manifestations\" refer to returning to the end. All that exists relies on nothingness for its function. The root of desire must accord with the Dao before it can be fulfilled. Thus, in constant having, one may observe the manifestations—the end—of things.\n\nThese two emerge together but have different names.\nTogether, they are called the mysterious.\nMysterious and again mysterious—\nThe gateway to all wonders.\n\nThese two—beginning and mother—emerge together but have different names. They emerge together from the mysterious. Their applications cannot be the same: at the outset, it is called the beginning; at the end, it is called the mother. \"Mysterious\" means obscure, silent, and without form. It is the source of beginning and mother, yet it cannot be grasped and named. Thus, though it cannot be spoken of, it is collectively called the mysterious. To call it so is to take what cannot be grasped and name it as such. If one were to fix it as a single \"mysterious,\" then the name would be far from accurate.\n[*Note: These two sentences may contain omissions or errors.*]\nThus, it is said: \"Mysterious and again mysterious.\" All wonders emerge from this sameness, hence it is called the gateway to all wonders.\n\n**Chapter Two**\n[*Note: In the He Shanggong commentary, this is the \"Nurturing Life\" chapter.*]\n\nWhen all under Heaven know beauty as beauty, ugliness arises.\nWhen all know goodness as goodness, un-goodness arises.\n\nThus, having and nothingness give rise to each other;\nDifficulty and ease complete each other;\nLong and short contrast each other;\n[*Note: All editions read *xing* (形, \"form\"), but Lu Deming’s *Pronunciation and Meaning of the Classics* reads *jiao* (較, \"contrast\"), likely following Wang Bi’s original.*]\nHigh and low incline toward each other;\nSound and voice harmonize with each other;\nFront and back follow one another.\n\nBeauty is what the human heart advances toward and delights in; ugliness is what the human heart detests and abhors. Beauty and ugliness are like joy and anger; goodness and un-goodness are like right and wrong. Joy and anger share the same root; right and wrong emerge from the same gate. Thus, they cannot be singled out.\n[*Note: The original text lacks the character *er* (而, \"and\"); here corrected according to the *Yongle Encyclopedia.*]\nThese six are all manifestations of nature, clear proofs that they cannot be singled out.\n\nTherefore, the sage abides in non-action,\n[*Note: The *Yongle Encyclopedia* reads *ding* (定, \"settled\") instead of *zu* (足, \"sufficient\").*]\nFor acting leads to failure.\nPractices the teaching without words.\nThe myriad things arise yet are not rejected;\nThey are born yet not possessed;\nThey are acted upon yet not relied upon.\nWisdom and cunning are self-sufficient—acting leads to artifice.\n\nWhen the work is accomplished, it is not dwelled in.\n[*Note: The *Yongle Encyclopedia* omits *er* (而, \"and\") and reads *bu* (不, \"not\") instead of *fu* (弗, \"not\").*]\nUsing things, the work is completed by them, hence it is not dwelled in.\n\nOnly by not dwelling\n[*Note: The *Yongle Encyclopedia* reads *bu* (不, \"not\") instead of *fu* (弗, \"not\").*]\nDoes it not depart.\nIf the work were attributed to oneself, it could not endure.\n\n**Chapter Three**\n[*Note: In the He Shanggong commentary, this is the \"Pacifying the People\" chapter.*]\n\nDo not exalt the worthy, so the people do not contend.\nDo not prize goods that are hard to obtain, so the people do not steal.\nDo not display what is desirable, so the people’s hearts are not confused.\n[*Note: The original text and all editions lack the character *min* (民, \"people\"), but only the *Yongle Encyclopedia* includes it. According to Wang Bi’s commentary—\"desirable things not displayed, above it follows 'losing life and stealing'—the original text must have included *min*. Here corrected accordingly.*]\n\n\"Worthy\" means capable. \"Exalt\" is the name for esteeming; \"prize\" is the term for honoring.\n[*Note: Lu Deming’s *Pronunciation and Meaning* notes: \"One edition reads *hao* (号, 'title'); another reads *ming* (名, 'name').\"*]\nIf only the capable are employed, why exalt them? If only what is useful is applied, why prize it? Exalting the worthy makes names prominent, exceeding their capacity. Constantly comparing abilities leads to contention. Prizing goods beyond their use drives the greedy to compete, tunneling through walls and rifling through chests, risking their lives to steal. Thus, if the desirable is not displayed, the heart has nothing to be confused by.\n\nTherefore, in the sage’s governance:\nEmpty their hearts,\nFill their bellies.\n\nThe heart harbors wisdom; the belly harbors food. Emptying wisdom means being empty of knowledge; filling the belly means being full of substance.\n\nWeaken their ambitions, strengthen their bones.\nBones are without knowledge, serving as the framework; ambitions generate affairs, disturbing the heart. When empty, the heart’s ambitions weaken.\n\nConstantly keep the people without knowledge and without desire,\nPreserving their true nature.\nThus, even the wise dare not act.\nThe wise are those who know how to act.\nActing through non-action, nothing remains ungoverned.\n\nChapter Four\n\nThe Dao flows emptily, yet its use is inexhaustible.\nAbyssal, it seems the ancestor of the myriad things.\nBlunting sharpness,\nUntangling knots,\nHarmonizing light,\nMerging with dust—\nProfound, it seems to endure.\nI know not whose child it is,\nAn image prior to the Lord.\n\nThose who grasp the measure of a single household cannot preserve the whole household.\nThose who grasp the measure of a single state cannot perfect the state.\nExerting strength to lift the heavy cannot be put to use.\nThus, though one may know the governance of the myriad things,\nWithout the Dao of the Two Modes, one cannot sustain them.\n\nThough the earth possesses form and substance, without modeling itself on heaven, it cannot preserve its tranquility.\nThough heaven possesses essence and image, without modeling itself on the Dao, it cannot safeguard its essence.\nEmptily flowing, its use is never exhausted.\nFilled to overflowing, it spills over.\nThus, its emptiness in use never reaches fullness—\nIts inexhaustibility is truly boundless.\n\nThough form may be vast, it cannot burden its body.\nThough affairs may be numerous, they cannot exceed its measure.\nThe myriad things abandon this to seek their master—\nWhere does their master reside?\nIs it not abyssal, seeming the ancestor of the myriad things?\n\nSharpness blunted yet undiminished,\nKnots untangled without toil,\nLight harmonized yet the body unstained,\nDust merged yet true nature unaltered—\nIs it not profound, seeming to endure?\n\nThe earth guards its form, yet its virtue cannot surpass its bearing.\nHeaven fulfills its image, yet its virtue cannot surpass its covering.\nNeither heaven nor earth can match it—\nIs it not like that which precedes the Lord?\nThe Lord is the Heavenly Lord.\n\nChapter Five\nHeaven and earth are not humane—\nThey regard the myriad things as straw dogs.\nHeaven and earth act by nature, without deliberate creation.\nThe myriad things govern themselves, thus they are not humane.\nFor humane action must involve creation, establishment, bestowal, and transformation.\nIf there is creation, establishment, bestowal, and transformation,\nThings lose their authenticity.\nIf there is favor and deliberate action,\nThings cannot fully exist.\nIf things cannot fully exist,\nThey are insufficient to bear the weight of all under heaven.\nEarth does not grow grass for beasts, yet beasts eat grass.\nIt does not raise dogs for humans, yet humans eat dogs.\nActing without deliberate action toward the myriad things,\nEach finds its proper use—\nThus none lacks sustenance.\nIf wisdom is imposed by oneself,\nIt is not yet sufficient to entrust.\n\nThe sage is not humane—\nThey regard the hundred clans as straw dogs.\nThe sage aligns their virtue with heaven and earth,\nTreating the hundred clans as straw dogs.\n\nBetween heaven and earth, is it not like a bellows?\nEmpty yet inexhaustible,\nIn motion it brings forth ever more.\nThe space within heaven and earth is vast and natural,\nThus it cannot be exhausted—\nJust like a bellows.\n\nThe more one speaks, the sooner one reaches an impasse.\nBetter to guard the center.\nThe more one acts, the more one loses.\nTo establish affairs and complicate words is to fail.\nWithout speech, without governance, one avoids the fate of exhaustion.\nIf the bellows guards its central emptiness,\nIt will never be depleted.\nAbandoning the self to follow things,\nAll is governed.\nIf the bellows had intent in producing sound,\nIt would not suffice for the needs of the blower.\n\n---\n\nChapter Six\nThe valley spirit does not die—\nThis is called the Mystic Female.\nThe gate of the Mystic Female\nIs called the root of heaven and earth.\nSubtly enduring, it seems to exist.\nIn its use, it is not exhausted.\n\nThe valley spirit is the center of the valley—\nFormless and shadowless,\nWithout resistance or opposition.\nAbiding in lowliness, unmoving,\nGuarding stillness, undiminished.\nBy this, the valley is formed, yet its form is unseen.\nThis is the supreme thing.\nDwelling in lowliness, it cannot be named,\nThus it is called the root of heaven and earth.\nTo say it exists—its form is unseen.\nTo say it does not exist—all things arise from it.\nThus, subtly enduring, it seems to exist.\nNothing is not accomplished by its use, yet it does not labor.\nTherefore, it is said: in its use, it is not exhausted.\n\n---\n\nChapter Seven\nHeaven is eternal, earth enduring.\nThe reason heaven and earth can be eternal and enduring\nIs that they do not live for themselves.\nTo live for oneself is to contend with things.\nNot living for oneself, things return to it.\nThus, it can endure.\n\nTherefore, the sage places their person last, yet it comes first.\nThey set their person aside, yet it is preserved.\nIs it not because they are without self-interest?\nThus, they can fulfill their self-interest.\n\nTo be without self-interest is to act without regard for the self.\nThe self comes first and is preserved—\nThus, it is said: they can fulfill their self-interest.\n\n---\n\nChapter Eight\nThe highest virtue is like water.\nWater benefits the myriad things without contention,\nDwelling where the multitude disdains.\nThus, it is near the Dao.\nThe Dao has no form, yet water does—\nThus, it is said to be near.\n\nIn dwelling, it favors the lowly.\nIn the heart, it favors depth.\nIn giving, it favors kindness.\nIn speech, it favors trust.\nIn governance, it favors order.\nIn affairs, it favors ability.\nIn action, it favors timeliness.\nOnly by not contending does it avoid blame.\nThis is how one aligns with the governance of the Dao.\n\n---\n\nChapter Nine\nTo hold and fill it is not as good as stopping.\nTo grasp and sharpen it cannot be long preserved.\nWhen gold and jade fill the hall,\nNone can guard them.\nNot as good as stopping.\n\nRiches and honor breed arrogance, inviting one’s own downfall—\nthey cannot be long preserved.\nWhen merit is achieved and the self withdraws,\nthis is the Dao of Heaven.\nThe four seasons alternate in their work;\nwhen one’s task is complete, it is time to move on.\n\n---\n\nCan you carry the embodied soul and embrace the One without separation?\nTo dwell in the abode of the soul and hold fast to the true essence—\ncan you remain unparted?\nTo concentrate qi and attain suppleness,\ncan you be as guileless as an infant?\nTo cleanse and purify your profound vision,\ncan you leave no blemish?\nTo love the people and govern the state,\ncan you do so without cunning?\nWhen the gates of Heaven open and close,\ncan you remain receptive?\nTo comprehend all directions with clarity,\ncan you act without contrivance?\n\nTo give life without damming its source—\nthe Dao ever acts without acting.\nShould lords and kings abide by it,\nthe myriad things will transform of themselves.\n\nTo nurture them without restricting their nature—\nto give life without possessing,\nto act without relying,\nto lead without dominating—\nthis is called profound virtue.\n\nNot damming their source, things flourish of themselves—what merit is there to claim?\nNot restricting their nature, things fulfill themselves—what reliance is needed?\nThings grow to completion without our dominion—\nto possess virtue yet have no master,\nhow could this not be the profound?\n\nAll references to \"profound virtue\" speak of virtue whose source remains unseen, emerging from the hidden.\n\n---\n\nEleven\nThirty spokes converge upon a single hub;\nit is the emptiness within that grants the cart its use.\nThe hub’s capacity to unify the thirty spokes lies in its void—\nby its emptiness, it can receive all things,\nand thus with solidity govern the multitude.\n\nKnead clay to fashion vessels—\nit is the emptiness within that grants the vessel its use.\nCarve doors and windows to form a chamber—\nit is the emptiness within that grants the chamber its use.\nThus, what is present serves as advantage,\nwhile what is absent serves as function.\n\nWood, clay, and walls complete these three,\nyet all rely on emptiness for their use.\nTo speak of emptiness is to say:\nwhat is present serves as advantage,\nbut all depend on absence for their function.\n\n---\n\nTwelve\nThe five colors blind the eyes.\nThe five tones deafen the ears.\nThe five flavors dull the palate.\nRacing and hunting madden the heart.\nScarce goods obstruct conduct.\n\n\"Scar\" means loss—\nto lose the use of the mouth is called \"dulling.\"\nEars, eyes, mouth, and heart all follow their nature,\nyet instead of nurturing their natural endowment,\nthey harm it—\nhence the blindness, deafness, dullness, and madness.\n\nRare and precious goods block the true path,\nthus obstructing human conduct.\n\nThus the sage attends to the belly, not to the eyes—\nhence he discards that and selects this.\nTo attend to the belly is to nourish oneself with things;\nto attend to the eyes is to be enslaved by things.\nTherefore the sage does not attend to the eyes.\n\nThirteen\nFavor and disgrace are like alarm;\nregard great trouble as you regard the body.\nWhat does it mean, \"favor and disgrace are like alarm\"?\nFavor is inferior—\nto gain it is like alarm,\nto lose it is like alarm.\nThis is what is meant by \"favor and disgrace are like alarm.\"\n\nFavor necessarily entails disgrace;\nglory necessarily entails trouble.\nAlarm at disgrace and glory, trouble and favor being equal,\nto be inferior and yet receive favor and disgrace, glory and trouble as alarm—\nthis is insufficient to throw the world into chaos.\n\nWhat does it mean, \"regard great trouble as you regard the body\"?\nGreat trouble refers to glory and favor and the like.\nTo live in abundance is necessarily to enter the realm of death—\nhence it is called \"great trouble.\"\nPeople are deluded by glory and favor,\nturning them back upon the body—\nthus it is said, \"regard great trouble as you regard the body.\"\n\nThe reason I have great trouble is that I have a body.\nIt arises from having this body.\nWhen I have no body,\nI return to the natural.\nWhat trouble could I then have?\nTherefore, to value using the body for the world\nis to be entrusted with the world.\nNothing can replace one’s body—\nhence it is called \"valuing.\"\nOnly thus can one be entrusted with the world.\n\nTo cherish using the body for the world\nis to be entrusted with the world.\nNothing can harm one’s body—\nhence it is called \"cherishing.\"\nOnly thus can one be entrusted with the world.\nNot allowing favor and disgrace, glory and trouble\nto harm or replace one’s body—\nonly then can one be entrusted with the world.\n\nFourteen\nLook at it and it cannot be seen—\nit is called \"subtle.\"\nListen to it and it cannot be heard—\nit is called \"rare.\"\nGrasp it and it cannot be held—\nit is called \"elusive.\"\nThese three cannot be further questioned,\nso they merge into one.\n\nWithout form, without image,\nwithout sound, without echo—\nthus it can penetrate everywhere,\ngo anywhere.\nIt cannot be known,\nyet I name it based on what the ears, eyes, and body do not know.\nHence it cannot be further questioned,\nand merges into one.\n\nAbove, it is not bright;\nbelow, it is not dark.\nContinuous, unceasing—\nit cannot be named.\nIt returns to nothingness.\nThis is called \"the form of the formless,\nthe image of the imageless.\"\nThis is called \"indistinct and vague.\"\n\nMeet it and you cannot see its beginning;\nfollow it and you cannot see its end.\nHold to the ancient Dao to master present being—\nbeing has its affairs.\nTo know the ancient beginning\nis called the thread of the Dao.\n\nThe formless and nameless is the ancestor of the ten thousand things.\nThough past and present differ,\ncustoms change,\nnone fail to follow this to achieve their order.\nThus one can hold to the ancient Dao\nto master present being.\nThough high antiquity is distant,\nits Dao remains.\nTherefore, though in the present,\none can know the ancient beginning.\n\nFifteen\nOf old, those adept in the Dao\nwere subtly mysterious, profoundly penetrating—\nso deep they could not be known.\nIt is only because they could not be known\nthat I am compelled to describe their appearance:\ncautious, as if crossing a river in winter;\nhesitant, as if fearing the neighbors on all sides;\nsolemn, as if a guest;\nyielding, as ice about to melt;\nsimple, as uncarved wood;\nhollow, as a valley;\nopaque, as muddy water.\n\nWho can make the turbid still and gradually clear?\nWho can make the still gradually come to life?\nThose who preserve this Dao do not desire fullness.\nIt is only because they do not desire fullness\nthat they can remain hidden and complete.\n\nOnly because they do not desire fullness\ncan they remain concealed, not newly completed.\nConcealed means covered and veiled.\n\nSixteen\nAttain utmost emptiness,\nabide in steadfast stillness.\nThus, attaining the utmost emptiness of things,\nsteadfastly guarding the true stillness of things.\nThe myriad beings all arise—\nmoving, acting, growing—\nand I observe their return.\nThough all things flourish in motion,\neach ultimately returns to its root.\nReturning to the root is called stillness;\nthis is called recovering life’s mandate.\nRecovering life’s mandate is called constancy.\nKnowing constancy is called clarity;\nnot knowing constancy is reckless action—calamity.\nKnowing constancy is all-embracing;\nall-embracing, one is impartial.\nImpartial, one is kingly;\nkingly, one is of heaven;\nof heaven, one is of the Dao;\nof the Dao, one endures.\nThough the body perish, the Dao does not decay.\n\nCapacity becomes impartiality—\nnothing is not embraced and penetrated,\nthus reaching boundless equanimity.\nImpartiality becomes kingliness;\nboundless equanimity reaches nothing not pervaded.\nKingly, one is of heaven;\nnothing not pervaded, one attains harmony with heaven.\nOf heaven, one is of the Dao;\nuniting with heaven’s virtue and embodying the Dao’s great penetration,\none reaches the utmost emptiness.\nOf the Dao, one endures;\nexhausting the utmost emptiness and attaining the Dao’s constancy,\none reaches inexhaustibility.\nThough the body perish, one does not decay.\n\nAs a thing, nothingness—\nwater and fire cannot harm it,\nmetal and stone cannot destroy it.\nApplied to the mind,\ntigers and rhinos have no place to sink their claws,\nweapons have no place to lodge their blades.\nWhat danger could there be?\n\nSeventeen\nIn the highest antiquity, those below knew only of their existence.\nThe highest refers to the great person;\nthe great person is above, thus called \"the highest.\"\nThe great person above dwells in non-action,\npractices the teaching without words,\nand though the myriad beings arise, does not initiate—\nthus those below know only of their existence,\nmerely acknowledging their presence from above.\n\nNext are those whom the people draw near and praise.\nUnable to dwell in non-action or teach without words,\nthey establish goodness and enact virtue,\nso the people draw near and praise them.\n\nNext are those whom the people fear.\nNo longer able to command with benevolence,\nthey rely on authority and power.\n\nNext are those whom the people scorn.\nUnable to model governance on uprightness to order the people,\nthey rely on cunning to rule the state—\nthus those below know to evade them,\nand their commands go unheeded.\nHence it is said: \"the people scorn them.\"\n\nWhere trust is insufficient, there will be distrust.\nWhen the body’s governance loses its nature, illness arises;\nwhen aid to things loses their truth, flaws and strife emerge.\nWhere trust is insufficient, there will be distrust—\nthis is the natural Dao.\nTo dwell in insufficiency is not something wisdom can order.\n\nHow profound—how it values speech!\nWhen tasks are accomplished and affairs settled,\nthe hundred clans all say, \"We did it naturally.\"\nThe beginnings of spontaneity cannot be seen,\nits intent and inclination cannot be glimpsed.\nNothing can alter its words—\nwords must have response.\nThus it is said: \"How profound—how it values speech!\"\nDwelling in non-action,\npracticing the teaching without words,\nnot establishing things through form—\nthus tasks are accomplished and affairs settled,\nyet the hundred clans do not know how this came to be.\n\nEighteen\nWhen the great Dao is abandoned, there is \"benevolence\" and \"righteousness.\"\nHaving lost the practice of non-action,\nthey instead employ cleverness to establish goodness\nand advance things through the Dao.\nWhen cunning and intellect emerge, great falsity arises.\nThey employ methods and use discernment\nto examine deceit and fraud,\nto observe forms and perceive things,\nto know how to evade—\nthus when cunning and intellect emerge, great falsity is born.\n\nWhen the six relations are not in harmony, there is \"filial piety\" and \"compassion.\"\nWhen the state is in chaos, there are \"loyal ministers.\"\nSuch fine names arise from great evil—\nwhat is called \"beauty\" and \"ugliness\" share the same gate.\nThe six relations are father and son, elder and younger brothers, husband and wife.\nIf the six relations were naturally in harmony and the state naturally well-governed,\nfilial piety, compassion, and loyal ministers would have no place to exist.\nWhen fish forget one another in the rivers and lakes,\nthe virtue of mutual moisture arises.\n\nNineteen\nAbandon sagacity, discard intellect—\nthe people will benefit a hundredfold.\nAbandon benevolence, discard righteousness—\nthe people will return to filial piety and compassion.\nAbandon skill, discard profit—\nthere will be no thieves or robbers.\nThese three, as cultural refinements, are insufficient.\nThus they are made to belong to something:\nmanifest plainness, embrace simplicity,\nreduce self-interest, diminish desires.\n\nSagacity is the excellence of talent;\nbenevolence and righteousness are the excellence of humanity;\nskill and profit are the excellence of utility.\nYet to speak only of abandoning them\nis greatly insufficient—\nnot making them belong to anything\nwould fail to reveal their intent.\nThus it is said: \"These three, as cultural refinements, are insufficient,\nhence they are made to belong to something\"—\nbelonging to plainness, simplicity, few desires.\n\nTwenty\nAbandon learning, and there will be no worries.\nBetween \"yes\" and \"ah\"—how far apart are they?\nBetween \"good\" and \"evil\"—how distant are they?\nWhat others fear, one cannot but fear.\n\nThe latter section speaks of scholars who daily increase,\nwhile those who practice the Dao daily diminish.\nThus learning seeks to increase what one can do\nand advance one’s intellect.\nBut if one were without desires and content,\nwhat would there be to seek in increase?\nIf one were unknowing yet hit the mark,\nwhat would there be to seek in advancement?\nSwallows and sparrows have their mates;\nturtledoves and pigeons have their rivals.\nThe people of cold regions must know felt robes—\nnaturally, they are already sufficient.\nTo increase them would bring worry.\nThus to lengthen a duck’s legs—\nhow is this different from cutting a crane’s shins?\nTo advance out of fear of disgrace—\nhow is this different from fearing punishment?\nBetween \"yes\" and \"ah,\" between \"good\" and \"evil\"—\nhow distant are they?\nThus what others fear, I too fear—\nnot daring to rely on it for use.\n\nVast indeed—it is without end!\nA sigh at how far it diverges from the common.\n\nThe multitude bustle and rejoice,\nas if feasting on grand sacrificial oxen,\nas if ascending the terrace in spring.\nThe multitude are deluded by fine advancement,\nbewildered by glory and profit,\ntheir hearts racing with desire to advance—\nthus they bustle and rejoice,\nas if feasting on grand sacrificial oxen,\nas if ascending the terrace in spring.\n\nI alone am tranquil, without sign,\nlike an infant who has not yet learned to smile.\nI am vast and formless, without name,\nwithout sign to be grasped,\nlike an infant who has not yet learned to smile.\n\nListless, as if having nowhere to return,\nas if without a dwelling.\n\nThe multitude all have more than enough,\nwhile I alone seem to have lost something.\nThe multitude all harbor thoughts and ambitions,\nfilling their breasts to overflowing—\nthus they all have more than enough.\nI alone am vast and without action,\nwithout desire, as if having lost something.\n\nOh, the heart of a fool!\nThe heart of one utterly foolish—\nwithout discrimination,\nwithout preferences,\nwithout desires—\nits nature remains unseen.\nI am thus sunken and dull.\n\nMuddled, without discrimination,\nunable to be made bright.\nThe common folk are bright and shining,\nflaunting their radiance.\n\nI alone am dim and dull—\nthe common folk are sharp and keen,\ndiscerning and analyzing all things.\nI alone am listless and serene,\nvast as the sea,\nits depths unseen.\n\nDrifting, as if without end,\nunbound, without attachment.\nThe multitude all have their uses,\neach desiring to apply their skills.\nYet I alone am stubborn, like one crude—\nwithout ambition, dull and dim,\nas if without understanding.\nThus I am called stubborn and coarse.\n\nI alone differ from others\nand value the nourishment of the Mother.\nThe Mother is the root of life.\nPeople all abandon this root,\nprizing the blossoms of artifice.\nThus I alone desire to differ from others.\n\n**Chapter Twenty-One**\nThe bearing of great virtue\nfollows only the Dao.\nThe Dao as a thing—\nelusive, intangible.\nIntangible, elusive,\nyet within it are images.\nElusive, intangible,\nyet within it are forms.\nSubtle, obscure,\nyet within it is essence.\nThis essence is most real,\nwithin it is truth.\n\nFrom ancient times to the present,\nits name has never departed,\nby which we observe the origin of all things.\nHow do I know the shape of the origin of all things?\nBy this.\n\n**Chapter Twenty-Two**\nTo yield is to be preserved whole.\nNot displaying one’s brilliance\nis to be preserved whole.\nTo bend is to be upright.\nNot asserting one’s rightness\nis to have one’s rightness made clear.\n\nHollowed, it becomes full;\nnot boasting of oneself, one’s merit endures.\nWorn, it becomes new;\nnot exalting oneself, one’s virtue grows.\nTo have little is to gain,\nto have much is to be deluded.\nThe Dao of nature is like a tree:\nthe more it branches, the farther from its root;\nthe less it branches, the closer to its source.\nMuch strays from the real—hence delusion;\nlittle attains the source—hence gain.\n\nThus the sage embraces the One as the model for all under heaven.\nThe One is the utmost of few.\nModel means standard.\nNot displaying oneself, one is luminous;\nnot asserting oneself, one is distinguished;\nnot boasting, one’s merit endures;\nnot exalting oneself, one’s virtue grows.\nOnly by not contending does none under heaven contend with one.\nWhat the ancients called “to yield is to be preserved whole”—\nwas this an empty saying?\nTruly, wholeness is its return.\n\n**Chapter Twenty-Three**\nRare words are natural.\nHeard yet unheard—this is called rare.\nThe next chapter speaks of the Dao’s issuing in words:\nbland, as if without flavor.\nSeen yet insufficient to behold,\nheard yet insufficient to hear—\nsuch flavorless, inaudible words\nare the utmost of natural speech.\n\nThus whirlwinds do not last the morning,\ntorrential rains do not last the day.\nWhat brings these about? Heaven and earth.\nIf even heaven and earth cannot endure long,\nhow much less can humans?\nThus those who act with violence and haste\ndo not last.\n\nTherefore, those who align with the Dao\nare one with the Dao.\n“Align” means to act in accord with the Dao.\nThe Dao, through formlessness and non-action,\naccomplishes and sustains the myriad things.\nThus those who align with the Dao\ntake non-action as their lord,\nsilence as their teaching.\nSubtle yet ever-present,\nthings attain their reality—\none with the Dao in body.\nHence, “one with the Dao.”\n\nThose of virtue are one with virtue.\nTo attain little is to gain—\nlittle is gain, hence “gain.”\nActing with gain, one is one in body with gain,\nhence “one with virtue.”\n\nThose who lose are one with loss.\nLoss is the burden of much—\nmuch burdens, hence loss.\nActing with loss, one is one in body with loss,\nhence “one with loss.”\n\nThose one with the Dao—the Dao delights in attaining them.\nThose one with virtue—virtue delights in attaining them.\nThose one with loss—loss delights in attaining them.\nThis means: follow their actions,\nand what they align with responds.\nWhere trust is insufficient,\nthere is distrust.\nLoyalty and trust are insufficient below—\nhow can there be no distrust?\n\n**Chapter Twenty-Four**\nThose who stand on tiptoe do not stand firm.\nThings, when they advance, lose their stability—\nhence, “those who stand on tiptoe do not stand firm.”\nThose who stride do not walk.\nThose who display themselves are not luminous.\nThose who assert themselves are not distinguished.\nThose who boast have no merit.\nThose who exalt themselves do not grow.\nIn the Dao, these are called\n“leftover food and parasitic growth.”\nSuch things are abhorred by all—\nthus those with the Dao do not dwell in them.\n\n**Chapter Twenty-Five**\nThere is a thing, chaotic yet complete,\nborn before heaven and earth.\nSilent, empty,\nit stands alone and does not change.\nIt revolves without end,\nand may be called the mother of all under heaven.\nI do not know its name—\nnaming defines form.\nChaotic and complete, without form,\nit cannot be defined—\nhence, “I do not know its name.”\nI style it “Dao.”\n“Style” means to name what can be spoken.\nThe Dao is taken from nothingness,\nnot derived from being—\nwithin the chaotic and complete,\nthe greatest name that can be spoken.\nI force a name upon it: “great.”\nGreat means passing.\nPassing means journeying—\nit does not abide in one form,\nbut revolves without end.\nHence, “great means passing.”\nPassing means far-reaching;\nfar-reaching means returning.\nThus the Dao is great,\nheaven is great,\nearth is great,\nand the king is also great.\nWithin the realm, there are four greats—\nthe Dao, heaven, earth, and the king.\nThe king occupies one of them.\n\nWhere things have names and appellations,\nthey are not ultimate.\nTo speak of the Dao is to speak of what has a source—\nhaving a source, it is then called the Dao.\nYet this greatness of the Dao’s name\ndoes not compare to nameless greatness.\nNameless—it cannot be called a realm,\nyet the Dao, heaven, earth, and king\nall reside within namelessness.\nHence, “within the realm, there are four greats.”\n\nThe king is the greatest of human rulers.\nHumans model themselves on earth,\nearth models itself on heaven,\nheaven models itself on the Dao,\nthe Dao models itself on nature.\n“Model” means to follow.\nHumans do not violate earth—\nthus they attain wholeness and peace, following earth.\nEarth does not violate heaven—\nthus it attains fullness and bearing, following heaven.\nHeaven does not violate the Dao—\nthus it attains fullness and covering, following the Dao.\nThe Dao does not violate nature—\nthus it attains its essence, following nature.\nNature is the word for the nameless,\nthe term for the ultimate.\nWisdom does not reach it,\nnor does knowledge;\nform and spirit do not reach it,\nnor do essence and image;\nappearance and measure do not reach it,\nnor do form and formlessness.\nThus they follow one another in modeling:\nthe Dao follows nature,\nheaven follows the Dao,\nearth follows heaven,\nhumans follow earth.\nThe One they follow is the lord.\n\n**Chapter 26**\n*(According to the He Shang Gong commentary, this is the \"Virtue of Weight\" chapter)*\n\nWeight is the root of lightness;\nstillness is the lord of restlessness.\nAll things: the light cannot bear the heavy,\nthe small cannot govern the great.\nWhat does not move enables movement;\nwhat does not act controls action.\nThus weight must be the root of lightness,\nstillness must be the lord of restlessness.\n\nTherefore the sage travels all day\nyet never parts from the heavy baggage—\ntaking weight as the foundation,\nhe does not depart from it.\nThough he may dwell in splendor,\nhe remains detached,\nnot allowing it to occupy his mind.\n\nHow could a ruler of ten thousand chariots\ntreat his person lightly before the world?\nLightness loses the root;\nrestlessness loses the lord.\nLightness cannot govern weight—\nto lose the root is to forfeit the self;\nto lose the lord is to forfeit the throne.\n\n---\n\n**Chapter 27**\n*(According to the He Shang Gong commentary, this is the \"Skillful Use\" chapter)*\n\nSkillful movement leaves no tracks—\nfollowing nature’s course, neither contriving nor initiating,\nthings arrive without trace.\n\nSkillful speech bears no flaw—\naccord with things’ nature, neither dividing nor analyzing,\nthus no flaw can be found.\n\nSkillful reckoning requires no tally—\nrelying on things’ inherent number, no form is needed.\n\nSkillful closure needs no bolt\nyet cannot be opened;\nskillful binding needs no cord\nyet cannot be undone.\nThis follows things’ natural state,\nneither contriving nor imposing—\nthus no bolt or cord is used,\nyet they cannot be opened or undone.\nThese five all speak of non-contrivance, non-imposition,\nfollowing things’ nature without shaping them by form.\n\nTherefore the sage constantly excels at saving people,\nand so leaves none abandoned.\nThe sage does not establish forms or names to restrain things,\nnor contrive advancement to distinguish the worthy from the unworthy.\nHe aids the self-so of the myriad things without initiating—\nthus he leaves none abandoned.\nIf he does not esteem ability, the people do not contend;\nif he does not prize rare goods, the people do not steal;\nif he does not display what can be desired, the people’s hearts are not disordered.\nConstantly keeping the people’s hearts free of desire and confusion,\nhe leaves none abandoned.\n\nConstantly excelling at saving things,\nhe leaves nothing abandoned—\nthis is called inheriting clarity.\nThus the good person is the teacher of the not-good—\nelevating goodness to instruct the not-good,\nhence called their teacher.\nThe not-good person is the resource of the good—\na resource to be taken.\nThe good person uses goodness to align the not-good,\nto discard the not-good with goodness—\nthus the not-good is what the good takes.\nIf one does not value one’s teacher\nor cherish one’s resource,\nthough wise, one is greatly deluded.\nThough possessing wisdom, one relies on one’s own intelligence,\nnot following things in their Way—\nthis must lead to loss.\nThus it is called the essential mystery.\n\n---\n\n**Chapter 28**\n*(According to the He Shang Gong commentary, this is the \"Returning to Simplicity\" chapter)*\n\nKnow the masculine, keep to the feminine—\nbecome the world’s valley.\nAs the world’s valley, constant virtue does not depart,\nreturning to the state of the infant.\n\nKnow the white, keep to the black—\nbecome the world’s model.\nAs the world’s model, constant virtue does not err,\nreturning to the boundless.\n\nThe masculine belongs to the prior;\nthe feminine belongs to the posterior.\nTo know the world’s priority\nyet remain posterior—\nthus the sage places himself last yet comes first.\nThe valley does not seek things,\nyet things naturally gather to it.\nThe infant does not employ wisdom,\nyet accords with nature’s intelligence.\n\nKnow the white, keep to the black—\nbecome the world’s standard.\nAs the world’s standard, constant virtue does not deviate,\nreturning to simplicity.\n\nAs the world’s standard, constant virtue does not err—\n\"err\" meaning deviation—\nreturning to the boundless,\nwhich cannot be exhausted.\n\nKnow glory, keep to disgrace—\nbecome the world’s valley.\nAs the world’s valley, constant virtue is fulfilled,\nreturning to simplicity.\n\nThese three speak of the constant, the returning, the ultimate;\nonly afterward is virtue complete in its dwelling.\nThe next chapter says: \"Reversion is the movement of the Dao.\"\nAchievement cannot be seized; one must abide in the Mother.\n\nWhen simplicity scatters, it becomes vessels;\nthe sage employs it to become a leader.\nSimplicity is the real;\nwhen the real scatters, the hundred practices emerge,\ndifferentiated as vessels.\nThe sage, following their dispersion,\nestablishes leaders,\nusing the good as teachers and the ungood as resources,\ntransforming customs to restore unity.\n\nThus, great governance does not sever.\nGreat governance takes the world’s heart as its heart,\nhence it does not sever.\n\n*(Chapter 29)*\nThose who would take the world and act upon it—\nI see they will not succeed.\nThe world is a sacred vessel,\nshapeless and boundless,\na confluence of the formless—\nthus called the sacred vessel.\nIt cannot be acted upon;\nthose who act upon it ruin it,\nthose who grasp it lose it.\n\nAll things take naturalness as their nature,\nthus they may be followed but not acted upon,\nguided but not grasped.\nThings have constant natures;\nto impose upon them is to court failure.\nThings have their goings and comings;\nto grasp them is to court loss.\n\nThus, some things advance, some follow,\nsome sigh, some blow,\nsome are strong, some weak,\nsome are established, some overthrown.\nTherefore, the sage eliminates excess, extravagance, and extravagance.\n\nAll these \"some\" speak of the world’s affairs—\nreversal and recurrence, without action or grasping.\nThe sage, penetrating the utmost flow of naturalness\nand the conditions of the myriad things,\nfollows without acting,\naccords without imposing,\nremoves what causes delusion,\ndispels what causes confusion,\nso the heart is not disordered and the nature of things is naturally attained.\n\n*(Chapter 30)*\nThose who assist a ruler with the Dao\ndo not use arms to strengthen the world.\nUsing the Dao to assist a ruler,\none should not use arms to strengthen the world—\nhow much less should a ruler who embodies the Dao?\n\nSuch affairs tend to return.\nThose who initiate seek to establish merit and create affairs,\nwhile those with the Dao seek to return to non-action—\nthus it is said, \"Such affairs tend to return.\"\n\nWhere armies dwell, thorns and brambles grow;\nafter great wars, years of famine follow.\nThis speaks of armies as instruments of harm;\nwhere there is no benefit, there must be injury,\ndevastating the people and laying waste to fields—\nthus it is said, \"thorns and brambles grow.\"\n\nThe good achieve results and no more;\nthey dare not take strength by force.\n\"Results\" mean relief—\nthose who use armies well act to relieve difficulty,\nnot to take strength by force in the world.\n\nAchieve results but do not boast,\nachieve results but do not praise,\nachieve results but do not be arrogant.\nI do not exalt the way of armies;\nif compelled to use them, what boasting or arrogance is there?\n\nAchieve results but do not force,\nachieve results but do not overreach.\nThough using arms may achieve results and relieve difficulty,\nwhen circumstances compel their use,\none should only employ them to eliminate violence and disorder,\nnot to persist in force for strength’s sake.\n\nThings in their prime age;\nthis is called \"not the Dao.\"\nWhat is not the Dao ends early.\n\nMight and force rise violently—\nthis is like using arms to strengthen the world.\nWhirlwinds do not last the morning;\ntorrential rains do not last the day.\nThus, violent rise must not be the Dao and ends early.\n\n*(Chapter 31)*\nFine weapons are\ninauspicious instruments;\nsome things detest them,\nthus those with the Dao do not dwell with them.\n\nThe noble person at home values the left;\nin war, they value the right.\nWeapons are inauspicious instruments,\nnot the instruments of the noble person.\nCompelled to use them, they employ them with tranquility as the highest.\nVictory is not deemed beautiful;\nthose who deem it beautiful\ndelight in killing.\nThose who delight in killing\ncannot realize their will in the world.\n\nAuspicious affairs value the left;\ninauspicious affairs value the right.\nThe deputy general stands on the left;\nthe chief general stands on the right—\nthis speaks of placing them with mourning rites.\nWhen the slain are many,\nmourn them with sorrowful weeping.\nWhen victorious in battle,\nplace them with mourning rites.\n\n*(Chapter 32)*\nThe Dao is eternally nameless.\nThough simplicity is small,\nnone in the world can subdue it.\nIf lords and kings can guard it,\nthe myriad things will naturally submit.\n\nThe Dao is formless and unbound,\nconstant yet unnameable—\nthus it is said, \"The Dao is eternally nameless.\"\nSimplicity as a thing has no mind,\nhence it is nameless.\nThus, to attain the Dao, nothing surpasses guarding simplicity.\nThe wise can be employed as ministers,\nthe brave can be used for military service,\nthe skillful can be tasked with labor,\nthe strong can bear heavy burdens.\nSimplicity as a thing is impartial and near to nothingness—\nthus it is said, \"none can subdue it.\"\nEmbracing simplicity, acting without contrivance,\nnot burdening one’s reality with things,\nnot harming one’s spirit with desires—\nthen things naturally submit, and the Dao is naturally attained.\n\nHeaven and earth unite to descend sweet dew—\nthe people require no command, yet all is naturally balanced.\nThis speaks of how when heaven and earth unite, sweet dew descends without being summoned.\nIf I guard my true nature and act without contrivance,\nthe people require no command, yet all is naturally balanced.\n\nThe beginning of governance establishes names—\nonce names exist, one must also know when to stop.\nKnowing when to stop ensures one does not endanger oneself.\nThe \"beginning of governance\" refers to when simplicity disperses and officials are first appointed.\nAt the outset of appointing officials, one cannot but establish names and ranks to define hierarchy.\nBeyond this, contention will arise over the smallest things—\nthus it is said, \"once names exist, one must also know when to stop.\"\nIf names are employed to designate things, the mother of governance is lost—\nhence, knowing when to stop ensures one does not endanger oneself.\n\nThe Dao’s presence in the world\nis like rivers and valleys in relation to the Yangtze and the sea.\nRivers and valleys do not seek the Yangtze or the sea—\nthe Yangtze and sea do not summon them, yet they return of their own accord.\nThose who practice the Dao in the world do not command, yet all is naturally balanced;\nthey do not seek, yet naturally attain—\nthus it is said, \"like rivers and valleys in relation to the Yangtze and the sea.\"\n\n**Chapter Thirty-Three**\n\nOne who knows others is wise;\none who knows oneself is enlightened.\nOne who knows others is merely wise—\nhow much greater is one who knows oneself, rising above wisdom.\n\nOne who conquers others is strong;\none who conquers oneself is mighty.\nOne who conquers others is merely strong—\nhow much greater is one who conquers oneself, for nothing can diminish their strength.\nEmploying one’s wisdom on others does not compare to employing it on oneself;\nemploying one’s strength on others does not compare to employing it on oneself.\nWhen enlightenment is applied to oneself, nothing can evade it;\nwhen strength is applied to oneself, nothing can alter it.\n\nOne who knows contentment is rich—\nknowing contentment, one does not lose what they have, hence is rich.\n\n**Chapter Thirty-Three (continued)**\n\nOne who acts with unyielding resolve possesses true purpose.\nThrough diligent practice, their purpose is surely attained—\nthus it is said: one who acts with unyielding resolve possesses true purpose.\nOne who does not lose their proper place endures.\nBy clearly examining oneself, measuring one’s strength, and acting without losing their proper place,\nthey will surely attain enduring longevity.\nOne who dies yet does not perish enjoys true longevity.\nThough the body dies, if the Dao of life does not perish, one preserves their full lifespan.\nWhen the body is gone yet the Dao still remains,\nhow much more so when the body endures and the Dao does not cease?\n\n**Chapter Thirty-Four**\n\nThe great Dao flows freely, available to left and right.\nThis means the Dao overflows without restriction, adapting to all directions—\nwhether left or right, above or below—\nits application knows no bounds.\nAll things depend on it for life, yet it does not refuse;\nits work is accomplished, yet it claims no possession.\nIt clothes and nourishes the myriad things yet does not act as their master—\never without desire, it may be called subtle.\nThe myriad things arise from the Dao,\nyet once born, they know not whence they came.\nThus, when the world remains free of desire,\nall things attain their proper place.\nIf the Dao made no contribution to things,\nit would be called small.\nYet all things return to it without its acting as master—\nit may be called great.\nSince it does not claim greatness for itself,\nit fulfills its greatness.\nPlanning greatness begins with the small;\ndifficult tasks begin with the easy.\n\n**Chapter Thirty-Five**\n\nHold fast to the great image, and all under heaven will come.\nThe great image is the mother of all celestial phenomena—\nneither cold nor warm, neither cool nor hot—\nthus it embraces and unites the myriad things without harm.\nIf one grasps it, all under heaven will come.\nThey come without harm, dwelling in perfect peace.\nMusic and delicacies make passing guests pause,\nbut the Dao’s utterance is bland, without flavor—\nseen, it is not enough to please the eye;\nheard, it is not enough to delight the ear.\nYet in its use, it is inexhaustible.\nThe profound words of the Dao—\nwhen the great hear them, they seem even less than music and delicacies,\nwhich stir the heart in their season.\nMusic and delicacies may halt a traveler,\nbut the Dao’s utterance is insipid, without taste—\nseen, it does not satisfy the eye;\nheard, it does not gratify the ear.\nYet in its use, it cannot be exhausted.\n\n**Chapter Thirty-Six**\n\nTo intend to contract, first surely expand;\nto intend to weaken, first surely strengthen;\nto intend to abolish, first surely exalt;\nto intend to seize, first surely give—\nthis is called subtle illumination.\nTo remove the strong and violent, to eliminate disorder,\none must employ these four principles,\nfollowing the nature of things so they destroy themselves\nwithout resorting to punishment—\nthis is the great means of removal.\nThus it is called subtle illumination.\nIf one fully expands yet still seeks expansion,\nthe multitude will contract.\nBetter to abandon the pursuit of expansion when it is insufficient,\nfor excessive striving only leads to peril.\nThe soft overcomes the hard;\nthe weak overcomes the strong.\nFish must not leave the depths;\nthe state’s sharp instruments must not be shown to others.\nSharp instruments are those that benefit the state—\nonly by following the nature of things, without resorting to punishment,\ncan each thing attain its proper place.\nThus they are the state’s sharp instruments.\nTo display them is to rely on punishment;\nif punishment is used to benefit the state, it will fail.\nWhen fish leave the depths, they are surely lost;\nwhen the state’s sharp instruments are displayed, they too will be lost.\n\n**Chapter Thirty-Seven**\n\nThe Dao ever acts through non-action.\n\nBy following nature, yet nothing is left undone.\nAll things arise from this acting to be governed and perfected.\nShould lords and kings abide by it,\nthe myriad things will transform of themselves.\nWhen transformation stirs desire to arise,\nI shall still it with the Uncarved Block of nameless simplicity.\nWhen transformation stirs desire to arise—\nwhen desire seeks completion—\nI shall still it with the Uncarved Block of nameless simplicity, not taking mastery.\nThe Uncarved Block of nameless simplicity\nshall also be without desire.\nWithout desire, there is no contention.\nWithout desire, through stillness,\nthe world will settle of itself.\n\n**Chapter Thirty-Eight**\n\nHighest virtue does not act as virtue—\nthus it possesses virtue.\nLesser virtue does not lose virtue—\nthus it lacks virtue.\nHighest virtue acts through non-action, without purpose.\nLesser virtue acts, with purpose.\nHighest benevolence acts, without purpose.\nHighest righteousness acts, with purpose.\nHighest propriety acts, yet when none respond,\nit rolls up its sleeves and forces compliance.\nThus, when the Dao is lost, virtue arises;\nwhen virtue is lost, benevolence arises;\nwhen benevolence is lost, righteousness arises;\nwhen righteousness is lost, propriety arises.\nPropriety is the thinning of loyalty and trust,\nthe beginning of chaos.\nForeknowledge is the flower of the Dao,\nthe beginning of folly.\nTherefore, the great person dwells in the substantial,\nnot the superficial;\nin the fruit, not the flower.\nThus, they discard the latter and take the former.\n\nVirtue means attainment—\nconstant attainment without loss,\nbenefit without harm.\nHence it is named \"virtue.\"\n\nHow does one attain virtue? Through the Dao.\nHow does one fulfill virtue? By employing non-action.\nWhen non-action is employed, nothing is not borne.\nThus, when things are without it, no thing fails to pass through;\nwhen they possess it, they cannot preserve their lives.\n\nTherefore, though heaven and earth are vast, they take non-action as their heart.\nThough sage-kings are great, they take emptiness as their master.\nThus it is said: \"In returning to observe, the heart of heaven and earth is seen;\nin contemplating the solstice, the ultimate of the former kings is beheld.\"\n\nTherefore, extinguish the private and forget the self—\nthen the four seas will gaze upon you, and far and near will come without fail.\nBut if one exalts the self and harbors intentions,\nthen even a single body cannot remain whole,\nand even flesh and bone cannot tolerate one another.\n\nThus, the person of highest virtue employs only the Dao,\nnot deeming their virtue as virtue.\nWithout grasping, without employing,\nthey are able to possess virtue yet do nothing that is not done,\nto seek nothing yet attain,\nto act without acting yet accomplish.\nThus, though they possess virtue, they bear no name of virtue.\n\nLesser virtue seeks and attains, acts and accomplishes—\nestablishing goodness to govern things.\nThus, the name of virtue arises.\nYet in seeking and attaining, there must be loss;\nin acting and accomplishing, there must be failure.\nWhen the name of goodness arises, un-goodness responds.\nThus, lesser virtue acts with purpose.\n\n\"Without purpose\" means without partial action.\nAll who cannot practice non-action yet act are of lesser virtue—\nbenevolence, righteousness, propriety, and ritual are such.\nTo clarify the superior and inferior of virtue,\nwe invariably contrast lesser virtue with higher virtue,\ntaking \"without purpose\" as the measure of the lowest of lesser virtue.\nEven when one reaches \"without purpose,\" they still act—\nacting without purpose, yet the trouble of acting remains.\n\nThe root lies in non-action; the mother lies in namelessness.\nAbandoning the root, forsaking the mother, and pursuing the child—\nthough achievements may be great, they will surely not endure;\nthough names may be fine, falsity will inevitably arise.\n\nIf one cannot accomplish without acting,\ncannot govern without rising,\nthen one must act—\nhence the elaborate praises, broad bestowals,\nand benevolent loves that love without partiality.\nThus, highest benevolence acts without purpose.\n\nWhen love cannot be universal, there is restraint and resistance.\nThose who rectify with righteousness and principle\ngrow indignant at wrongs, aid the upright,\nassist one side and attack another—\ntheir hearts are set upon something.\nThus, highest righteousness acts with purpose.\n\nWhen rectitude cannot be steadfast, there is embellishment and refinement,\ncultivation of ritual and reverence.\nThose who esteem refinement and respect\ndemand reciprocity in exchanges—\nwhen unmet, anger arises.\nThus, highest propriety acts, yet when none respond,\nit rolls up its sleeves and forces compliance.\n\nIs not the greatest of all the Dao?\nFrom this point onward, what is worthy of esteem?\n\nThus, though one’s enterprises flourish, wealth abounds, and the myriad things each attain their virtue, though one is honored for employing non-action, one cannot abandon non-being as one’s essence. To abandon non-being as one’s essence is to lose that which makes one great. This is what is meant by \"losing the Dao and afterward virtue.\"\n\nEmploying non-action, virtue is the mother—thus one may cease without toil, and the things of the world are without disorder. Below this point onward, one loses the mother of employment, cannot practice non-action yet esteems broad bestowals, cannot practice broad bestowals yet esteems uprightness, cannot practice uprightness yet esteems embellished reverence. This is what is meant by \"losing virtue and afterward benevolence, losing benevolence and afterward righteousness, losing righteousness and afterward propriety.\"\n\nNow, propriety—its beginnings lie in loyalty and trust not being steadfast, in communication not being forthright, in outwardly demanding and expecting reciprocity. The mechanisms of restraint and contention are established. Benevolence and righteousness arise from within and are enacted—yet these are still artificial. How much more so when one busies oneself with external embellishments? Can this endure?\n\nThus, propriety is the attenuation of loyalty and trust and the beginning of disorder. Those of \"foreknowledge\" are those who recognize things before others—these belong to the ranks of lesser virtue. They exhaust their intelligence and clarity to cultivate foreknowledge, enslave their wisdom and strength to manage the myriad affairs. Though they may deem themselves virtuous, their nature is cunning and their schemes ever more intricate; though their reputation may flourish, their sincerity is increasingly lost. They toil in earnest yet their affairs grow murky, they strive in busyness yet their governance becomes filthy. Though they exhaust sagely wisdom, the people suffer greater harm.\n\nAbandoning the self to serve things leads to non-action and peace; upholding simplicity and plainness does not conform to established norms, allowing others to obtain what they seek while relinquishing what one guards. Recognizing the flower of the Dao is the beginning of folly. Therefore, if one but attains that which is the mother of all achievements, the myriad things arise of themselves without refusal, and the myriad affairs are preserved.\n\nYet it is not laborious. Employing it without reliance on form, without dependence on name—thus the names of benevolence and righteousness may be displayed, and rites and reverence may be made manifest.\n\nWhen borne by the great Dao and stabilized by the nameless, things have nothing to esteem, and aspirations have nothing to pursue. Each follows its inherent integrity, employing its sincerity—then the virtue of benevolence becomes profound, the conduct of righteousness becomes upright, and the observance of rites and reverence becomes pure.\n\nAbandoning what bears them, forsaking their source, using their completed forms, and employing their cleverness—then benevolence becomes insincere, righteousness becomes contentious, and rites become disputatious. Thus, the profundity of benevolent virtue is not achieved by employing benevolence; the uprightness of righteous conduct is not accomplished by employing righteousness; the purity of rites and reverence is not attained by employing rites.\n\nBorne by the Dao and governed by the Mother, they are displayed without esteem, made manifest without contention. Employing the nameless, names become sincere; employing the formless, forms become complete. Preserving the Mother to sustain the child, exalting the root to elevate the branch—then form and name both exist, and perversity does not arise. Great beauty matches Heaven, and embellishment does not occur.\n\nThus, the Mother cannot be distanced, the root cannot be lost. Benevolence and righteousness are born of the Mother—they cannot serve as the Mother. Forms and vessels are crafted by the artisan—they cannot serve as the artisan. Forsaking the Mother to use the child, abandoning the root to pursue the branch—names then have divisions, forms then have limits. Though one may extend them to their utmost, there must be incompleteness; though one may exalt their beauty, there must be affliction and sorrow. The merit lies in action—how can it suffice for abiding?\n\nChapter Thirty-Nine\nThose of old who attained the One:\nOf old, in the beginning—the One is the inception of numbers and the extremity of things. Each is the origin of a thing’s life, the means by which it becomes its master. All things each attain this One to achieve completion. Once completed, they abandon it to dwell in completion. Dwelling in completion, they lose their Mother—thus all split, wither, exhaust, perish, and collapse.\n\nHeaven attained the One and became clear;\nEarth attained the One and became tranquil;\nSpirits attained the One and became numinous;\nValleys attained the One and became full;\nThe myriad things attained the One and came to life;\nLords and kings attained the One and became the integrity of the world.\n\nIn their attainment:\nEach by its One attained this clarity, tranquility, numinosity, fullness, life, and integrity.\n\nIf Heaven had nothing by which to become clear, it would fear splitting—it employs the One to attain clarity, not clarity to become clear. Preserving the One, clarity is not lost; employing clarity, it fears splitting. Thus, the Mother of all achievements cannot be forsaken. Therefore, none dare employ their achievements, fearing the loss of their root.\n\nEarth, without that by which to become tranquil, would fear eruption;\nSpirits, without that by which to become numinous, would fear dissipation;\nValleys, without that by which to become full, would fear exhaustion;\nThe myriad things, without that by which to come to life, would fear extinction;\nLords and kings, without that by which to be exalted and lofty, would fear collapse.\n\nThus, the noble takes the humble as its root; the high takes the low as its foundation. Therefore, lords and kings call themselves \"the orphaned,\" \"the widowed,\" and \"the unworthy\"—is this not taking the humble as their root? Is it not so? Hence, to amass numerous carriages is to have no carriage. One does not desire to be lustrous like jade or coarse like stone.\n\nClarity cannot make itself clear; fullness cannot make itself full. All retain their Mother to preserve their form. Thus, clarity is not to be prized; fullness is not to be esteemed. The value lies in their Mother, yet the Mother has no prized form. Value arises from taking the humble as root; height arises from taking the low as foundation. Therefore, to amass numerous carriages is to have no carriage. Jade and stone, lustrous or coarse, are exhausted by their form—hence one does not desire them.\n\n**Chapter 40**\nReversion is the movement of the Dao;\nThe high takes the low as foundation; the noble takes the humble as root.\nBeing arises from non-being as its function—this is its reversion.\nIn movement, all know that which is without, and things communicate.\nThus it is said: Reversion is the movement of the Dao.\n\nWeakness is the function of the Dao.\nSoftness and weakness are interconnected, inexhaustible.\nAll things under heaven are born of being; being is born of non-being.\nTo preserve being in its entirety, one must return to non-being.\n\n**Chapter 41**\nWhen the highest scholar hears of the Dao, they diligently practice it—\nThis is their aspiration.\n\n**Chapter 41 (continued)**\nThe middling scholar hears of the Dao and treats it as if it exists, as if it does not;\nThe lesser scholar hears of the Dao and laughs greatly at it.\nIf it were not laughed at, it would not suffice to be the Dao.\nThus the established saying holds:\nDao established is like obscurity—\nLuminous yet not dazzling.\nAdvancing in the Dao is like retreating;\nPutting oneself last, one finds oneself first;\nSetting oneself aside, one preserves oneself.\nThe level Dao appears uneven—\nIts levelness unseen, it seems instead to be a barrier.\nThe highest virtue is like a valley—\nNot parading its virtue, it holds nothing within.\nGreat whiteness appears stained—\nKnowing its whiteness, it guards its blackness; only then is great whiteness attained.\nVast virtue appears insufficient—\nVast virtue is not full, its formlessness cannot be filled.\nEstablished virtue appears indolent—\nEstablished virtue follows things naturally, neither asserting nor imposing, thus seeming indolent.\nUnadulterated authenticity appears tarnished—\nUnadulterated authenticity does not cling to its purity, hence it seems tarnished.\nGreat squareness has no corners—\nBeing square yet not cutting, it has no corners.\nGreat vessels are slow to complete—\nGreat vessels, not held to partial completion, must be finished late.\nGreat sound is scarce of voice—\nThat which cannot be heard when listened for is called scarce; sound that cannot be grasped is sound indeed. Where there is sound, there is division; where there is division, there is no unity of tone. Division cannot govern the many—thus sound is not great sound.\nThe great image has no form—\nWhere there is form, there is division; what is divided is neither warm nor scorching, neither scorching nor cold. Thus the image that takes form is not the great image.\nThe Dao is hidden, without name.\nOnly the Dao excels in bestowing and in accomplishing.\nAll these excellences are what the Dao accomplishes.\nIn images, it becomes the great image, yet the great image has no form;\nIn sound, it becomes great sound, yet great sound is scarce of voice.\nThings are completed by it, yet its completion is unseen—thus it is hidden, without name.\nIts bestowal is not merely to supply what is lacking; a single bestowal suffices to perpetuate virtue eternally—hence it excels in bestowing.\nIts accomplishment is not like the carpenter’s craft, which shapes without exhausting form—hence it excels in accomplishing.\n\n**Chapter 42**\nThe Dao generates the One;\nThe One generates the Two;\nThe Two generate the Three;\nThe Three generate the ten thousand things.\nThe ten thousand things bear yin and embrace yang, blending qi to achieve harmony.\nWhat people despise—being orphaned, widowed, or unworthy—kings and lords take as their titles.\nThus things may be diminished yet gain, or augmented yet lose.\nWhat people teach, I also teach:\n“The violent do not meet a natural death.”\nI take this as the father of my teaching.\n\n**Chapter 43**\nThe softest under heaven gallops through the hardest under heaven.\nQi enters where there is no space; water emerges from what has no aperture.\n\nThe non-existent enters where there is no gap. Thus I know the benefit of non-action. Emptiness, nothingness, softness, and weakness penetrate all things without obstruction. The utterly soft cannot be broken. From this I infer the benefit of non-action. The teaching without words, the benefit of non-action—few in the world attain them.\n\n**Chapter 44**\nFame or self—which is dearer?\nSelf or wealth—which is greater?\nGain or loss—which is more harmful?\nExcessive love incurs great cost;\nHoarding brings heavy loss.\nKnow contentment and avoid disgrace;\nKnow restraint and avoid danger—\nThus can one endure long.\n\n**Chapter 45**\nGreat perfection seems flawed, yet its use is inexhaustible.\nGreat fullness seems empty, yet its use is boundless.\nGreat straightness seems bent;\nGreat skill seems clumsy;\nGreat eloquence seems inarticulate.\nRestlessness overcomes cold; stillness overcomes heat.\nPurity and tranquility set the world right.\n\n**Chapter 46**\nWhen the world follows the Dao, warhorses are retired to fertilize fields.\nWhen the world strays from the Dao, cavalry mounts are bred at the frontier.\nNo calamity is greater than discontent;\nNo fault is greater than covetousness.\nThus, knowing contentment brings constant sufficiency.\n\n**Chapter 47**\nWithout stepping outside, one knows the world;\nWithout peering through the window, one sees the Dao of heaven.\nThe farther one goes, the less one knows.\nThus the sage knows without traveling,\nNames without seeing,\nAchieves without acting.\n\n**Chapter 48**\nIn the pursuit of learning, one gains daily;\nIn the pursuit of the Dao, one loses daily.\n\nIn the pursuit of the Dao, one loses daily—\nStriving to return to emptiness and nothingness.\nLose and lose again, until one reaches non-action;\nThrough non-action, nothing is left undone.\nActing brings loss, thus non-action leaves nothing undone.\n\nTo govern the world, one always acts through non-interference,\nMoving only by following.\nWhen there is interference, it is self-created—\nInsufficient to govern the world, for the fundamental unity is lost.\n\n**Chapter 49**\nThe sage has no fixed heart,\nTaking the hearts of the people as his own—\nMoving only by following.\nThe good, I treat as good;\nThe not-good, I also treat as good—\nThus virtue is goodness.\nThe trustworthy, I trust;\nThe untrustworthy, I also trust—\nThus virtue is trustworthiness.\n\nThe sage, in the world,\nGathers and unifies the hearts of the world,\nMerging them into one.\nEach employs their own intelligence,\nYet the sage treats all as infants—\nAll are made harmonious and desireless, like newborns.\n\nHeaven and earth establish their positions; the sage fulfills his capacities.\nHuman plans, ghostly plans—\nThe people offer their abilities.\nThose with ability are given; those with resources take.\nGreat ability brings great resources; noble ability brings noble resources.\nThings have their origins; affairs have their masters.\nThus, one may wear the imperial crown, its tassels filling the eyes, yet fear no deception;\nIts floss may block the ears, yet suffer no distress from negligence.\nWhy then exhaust one’s own intelligence to scrutinize the people’s hearts?\n\nFor when one examines things with clarity, things in turn respond with their own clarity;\nWhen one examines things with distrust, things in turn respond with their own distrust.\nIf the hearts of the world need not be the same,\nAnd their responses dare not differ,\nThen none will offer their true feelings.\nHow grave the harm—how vast!\n\nNo greater error exists than employing one’s own clarity.\nFor when one relies on cunning, others contend in litigation;\nWhen one relies on force, others contend in struggle.\nIf cunning does not arise from the people but is imposed upon them,\nThen the ground for litigation is exhausted.\nIf force does not arise from the people but is imposed upon them,\nThen the ground for struggle becomes perilous.\nNever has there been one who could prevent the people from employing their own cunning and strength—\nThis is the folly of the self.\nThus, the self contends alone against the people,\nWhile the people contend against the self with a thousandfold might.\n\nIf one multiplies the nets of law, complicates punishments,\nBlocks the paths, and assaults the hidden dwellings,\nThen the myriad things lose their spontaneity,\nThe hundred clans are bereft of their hands and feet,\nBirds are thrown into chaos above,\nFish into chaos below.\nTherefore, the sage’s approach to the world is one of reverent restraint,\nWith a heart that holds no fixed intent.\nFor the world, the sage embodies an undivided mind,\nWith no inclination to impose direction,\nNo impulse to scrutinize.\nWhen the people have nothing to evade,\nNothing to respond to,\nThen none withhold their true feelings.\n\nPeople, when left to themselves,\nAbandon what they cannot do and act according to their abilities;\nThey forsake their shortcomings and cultivate their strengths.\nThus, speakers speak of what they know,\nDoers act according to their capacities,\nAnd the hundred clans all direct their ears and eyes.\nI merely treat them as infants.\n\nChapter Fifty [Note: In the *Heshang Gong* commentary, this is the \"Valuing Life\" chapter]\n\nEmerging into life, entering into death.\nEmerging into the land of life, entering the land of death.\nThose who follow life are thirteen in ten,\nThose who follow death are thirteen in ten,\nAnd those whose life moves them into the land of death are also thirteen in ten.\n[Note: *Han Feizi* reads: \"Those who live and act—all their actions lead to the land of death.\"]\nWhy is this?\nBecause they overindulge in the pursuit of life.\n\nI have heard that those skilled in nurturing life\nWalk on land without encountering rhinoceros or tiger,\nEnter battle without donning armor or wielding weapons.\nThe rhinoceros finds nowhere to thrust its horn,\nThe tiger nowhere to place its claws,\nWeapons nowhere to lodge their blades.\nWhy is this?\nBecause they harbor no ground for death.\n\n\"Thirteen in ten\" means that of ten parts, three follow the Way of life to its fullest,\nAnd three follow the Way of death to its extreme.\nYet people, in their excessive pursuit of life,\nTurn it into a land of no life.\n\nThose skilled in nurturing life do not treat life as something to be clung to,\nThus they have no ground for death.\nOf all harms wrought by tools, none surpasses weapons;\nOf all harms wrought by beasts, none surpasses rhinoceros and tiger.\nYet when weapons find no place for their blades,\nWhen tigers and rhinoceroses find no place for their claws and horns,\nThis is truly not allowing desire to burden the self.\nHow can there be any ground for death?\n\nThe viper and the centipede deem the abyss too shallow and burrow into it,\nThe hawk and the kite deem the mountain too low and build their nests higher.\nArrows and snares cannot reach them,\nNets and traps cannot ensnare them—\nOne might call this dwelling in a ground without death.\nYet in the end, they are lured by sweet bait\nAnd enter a land of no life.\nIs this not the result of overindulging in the pursuit of life?\n\nThus, if things do not seek to depart from their root,\nDo not allow desire to alter their true nature,\nThen even when entering battle, they remain unharmed,\nAnd when walking on land, they cannot be assailed.\nThe infant’s way is to be esteemed and trusted.\n\n**Chapter 51**\n*(According to the Heshang Gong commentary, this is the \"Nurturing Virtue\" chapter)*\n\nThe Dao gives them life; virtue fosters them.\nThings take form; circumstances bring them to completion.\n\nOnce things are born, they are nurtured;\nonce nurtured, they take form;\nonce formed, they reach completion.\nWhat gives them life? The Dao.\nWhat fosters them? Virtue.\nWhat shapes things? Their form.\nWhat brings circumstances to completion? Their inherent tendency.\n\nOnly through *cause* can all things take form;\nonly through *tendency* can all things reach completion.\nAll things that come to life,\nall achievements that reach fruition,\narise from some cause.\nIf they arise from a cause,\nthen none do not originate from the Dao.\nThus, when traced to their utmost,\nthey arrive at the Dao.\nFollowing their respective causes,\neach receives its proper name.\n\nTherefore, the myriad things\nrevere the Dao and honor virtue.\nThe Dao is that by which things arise;\nvirtue is that which things attain.\nThrough it, they attain—\nthus, if they do not attain, they lose.\nRevering it averts harm;\nif they do not revere it, they cannot but honor it.\n\nThe Dao’s reverence, virtue’s honor—\nnothing commands them, yet they are ever spontaneous.\n*(The word \"command\" here may originally have been a textual note on \"rank,\" mistakenly incorporated into the commentary.)*\n\nThus, the Dao gives them life; virtue fosters them.\nIt rears them, nurtures them,\nshelters them, matures them,\nnourishes them, protects them.\nThis is called bringing them to fruition.\nEach receives its due shelter,\nso that nothing harms its body.\n\nGiving life yet not possessing,\nacting yet not relying,\nrearing yet not dominating—\nthis is called *mysterious virtue*.\nPossessing virtue yet unaware of its source,\nit emerges from the profound.\n\n---\n\n**Chapter 52**\n*(According to the Heshang Gong commentary, this is the \"Returning to the Source\" chapter)*\n\nThe world has a beginning,\nwhich may be regarded as the Mother of the world.\nHaving attained the Mother,\none knows the Child.\nHaving known the Child,\none returns to guard the Mother.\nThus, to the end of one’s days, one does not falter.\n\nThe Mother is the root; the Child is the branch.\nAttaining the root to know the branch,\nnot abandoning the root to pursue the branch—\n\nBlock the openings, shut the gates.\n*(The \"openings\" are the source of desires;\nthe \"gates\" are the path by which desires enter.)*\nThus, one labors not for a lifetime.\nOpen the openings, assist the affairs—\nthus, one cannot be saved for a lifetime.\n*(Not closing the source yet aiding its affairs,\neven to life’s end, one cannot be saved.)*\n\nSeeing the small is called clarity;\nguarding the soft is called strength.\n*(The work of governance does not lie in the great.\nSeeing the great is not clarity;\nseeing the small is clarity.\nGuarding the strong is not strength;\nguarding the soft is strength.)*\n\nEmploy its light,\nreturn to its clarity.\n*(Manifest the Dao to dispel the people’s confusion.)*\nDo not lose sight of it—\nthis is called returning to its luminosity.\n*(Not perceiving with clarity.)*\n\nTo leave no calamity upon the body—this is called practicing constancy. *(This is the constancy of the Dao.)* [Chapter 53]\n\n\"Were I granted firm knowledge and made to walk the great Dao, only its enactment would I fear.\" *(This means: if I were granted firm knowledge to walk the great Dao in the world, I would fear only its enactment.)*\n\nThe great Dao is utterly level, yet the people prefer byways. *(The great Dao is vast and perfectly even, yet the people still abandon it and do not follow it, preferring to take devious paths—how much more so when enactments are used to obstruct the great Dao’s midst? Thus it is said: \"The great Dao is utterly level, yet the people prefer byways.\")*\n\nThe court is excessively adorned, *(the court refers to palaces and halls; \"adorned\" means cleansed and beautified)*\nfields are overgrown, granaries are empty. *(When the court is excessively adorned, fields become overgrown and granaries empty—establishing one leads to a multitude of harms.)*\n\nWearing embroidered robes, girded with fine belts, bearing sharp swords, sated with food and drink, possessing surplus wealth—this is called the boastful thief. *(Anything not obtained by the Dao is perverse; perverse means thievery. To boast while obtaining things not by the Dao is to usurp rank. Thus, to illustrate what is not the Dao is to show that all such things are the boastful thief.)* [Chapter 54]\n\nWhat is well established cannot be uprooted. *(Firmly rooting the base before cultivating the branches ensures it cannot be uprooted.)*\n\nA master of embrace does not let go. *(Not coveting excess, aligning with one’s capacity—thus nothing slips away.)*\nDescendants perform sacrifices without cease. *(When descendants transmit this Dao in their sacrifices, they do not cease.)*\n\nCultivate it in the self, and one’s virtue becomes genuine;\ncultivate it in the family, and one’s virtue becomes abundant. *(Extending from self to others: cultivated in the self, it is genuine; in the family, it overflows. When cultivation is unceasing, its application grows ever greater.)*\nCultivate it in the village, and one’s virtue becomes enduring;\ncultivate it in the state, and one’s virtue becomes bountiful;\ncultivate it in the world, and one’s virtue becomes universal.\n\nThus, observe the self through the self,\nobserve the family through the family,\nobserve the village through the village,\nobserve the state through the state—\neach mirrors the other.\nObserve the world through the world—\n*(Observe the Dao of the world through the hearts of the world’s people. The world’s Dao—its reversals and sequences, fortune and misfortune—is like the Dao of humanity.)*\n\nHow do I know the world is thus?\nBy this. *(This refers to what was stated above. How do I know the world? By examining myself, not seeking externally. This is what is meant by \"not stepping beyond the door to know the world.\")* [Chapter 55]\n\nOne whose virtue is profoundly embodied is like an infant:\nwasps, scorpions, vipers, and snakes do not sting;\nfierce beasts do not seize;\nbirds of prey do not strike. *(The infant seeks nothing, desires nothing, and does not offend other beings—thus poisonous creatures do not harm it. One of profound virtue does not transgress against things, so nothing can diminish their wholeness.)*\n\nBones soft, sinews tender, yet the grip is firm—\n*(By virtue of softness and tenderness, the grasp is complete and steadfast.)*\n\nOne who does not yet know the union of female and male yet has the *quan* fully aroused—\n*(The *quan* here refers to the genitals; their arousal is long-lasting. Nothing can diminish their body, thus they remain whole and endure. This speaks of one whose virtue is profoundly embodied: nothing can impair their virtue or alter their authenticity. Soft and weak, non-contending, they suffer no breakage—all is thus.)*\n\nThis is the perfection of *jing*.\nThough they cry all day, their voice does not grow hoarse—\n*(Without a heart of contention or desire, they may cry out all day without hoarseness.)*\n\nThis is the perfection of harmony.\nTo know harmony is to know constancy.\n*(Things take harmony as their constancy; thus, to know harmony is to attain constancy.)*\n\nTo know constancy is called clarity.\n*(Neither bright nor dim, neither warm nor cool—this is constancy. Without form, imperceptible to sight, it is called clarity.)*\n\nTo augment life is called ill-omen.\n*(Life cannot be augmented; to force augmentation is to invite premature death.)*\n\nWhen the heart commands *qi*, it is called force.\n*(The heart should remain empty; to command *qi* is to force it.)*\n\nWhen things reach their prime, they age—this is called not following the Dao.\nWhat does not follow the Dao perishes early.\n\n**[Chapter 56]**\n\nThose who know do not speak.\n*(They follow nature.)*\n\nThose who speak do not know—\nthey stir up affairs.\n\nBlock their orifices, shut their gates,\nblunt their sharpness, and hold fast to simplicity.\n*(This is to preserve their essential nature.)*\n\nUntangle their distinctions,\n*(Texts vary: some read \"entanglements\" for \"distinctions.\")*\nremove the source of contention.\n\nHarmonize their light—\nwhen nothing stands out, things do not vie for prominence.\nBlend with the dust—\nwhen nothing is singled out as base, things do not feel shame.\n\nThis is called the \"mysterious sameness.\"\nThus, one cannot be drawn near,\n*(Texts vary: some include \"also\" after \"near,\" and the following two lines follow this pattern.)*\nnor can one be kept distant.\nIf one could be drawn near, one could also be kept distant.\n\nOne cannot be benefited,\nnor can one be harmed.\nIf one could be benefited, one could also be harmed.\n\nOne cannot be exalted,\nnor can one be debased.\nIf one could be exalted, one could also be debased.\n\nTherefore, one is honored by all under heaven—\nnothing can be added to this.\n\n**[Chapter 57]**\n\nGovern the state with uprightness,\ndeploy troops with cunning,\nwin all under heaven by doing nothing.\n\nTo govern the state with the Dao is to bring peace;\nto govern with uprightness is to invite both uprightness and cunning.\nOnly by doing nothing can one truly win all under heaven.\n*(The previous chapter states: \"Those who win all under heaven always do so by doing nothing. When they act, it is no longer enough to win all under heaven.\")*\nThus, governing with uprightness is insufficient to win all under heaven—\none must resort to cunning in warfare.\n\nTo govern the state with the Dao is to honor the root and quiet the branches.\nTo govern with uprightness is to establish laws and attack the branches.\nWhen the root is not established and the branches are shallow,\nthe people have nothing to reach for—\nthis inevitably leads to cunning in warfare.\n\nHow do I know this is so?\nBy this:\nThe more taboos there are in the world, the poorer the people become.\nThe more sharp tools the people possess, the more benighted the state grows.\n*(Sharp tools refer to anything that benefits the self—when the people grow strong, the state weakens.)*\nThe more cleverness and skill there are, the more strange things arise.\nThe more knowledge and wisdom the people have, the more deceit and artifice emerge.\nWhen deceit and artifice emerge, perverse affairs arise.\nThe more laws and decrees are promulgated, the more thieves and bandits appear.\n\nEstablishing uprightness to suppress perversity leads instead to cunning in warfare.\nEnacting taboos to shame poverty only deepens the people’s poverty.\nSharpening tools to strengthen the state only plunges it further into darkness.\nAll these abandon the root to tend the branches—\nhence these outcomes.\n\nTherefore, the sage says:\nI do nothing, and the people transform themselves.\nI value stillness, and the people right themselves.\nI take no action, and the people enrich themselves.\nI have no desires, and the people return to simplicity.\n*(One text includes: \"I have no emotions, and the people purify themselves.\")*\n\nWhat the ruler desires, the people swiftly follow.\nMy only desire is to have no desires—\nthus the people, too, have no desires and return to simplicity.\nThese four are to honor the root and quiet the branches.\n\n**[Chapter 58]**\n\nWhen governance is dull and unobtrusive, the people are honest and simple.\n*(To govern well is to be formless, nameless, actionless, and without policies that can be cited—dull and unobtrusive, yet ultimately leading to great order. Thus it is said: \"When governance is dull and unobtrusive...\")*\nWhen the people have nothing to vie for, they are magnanimous and simple.\n*(Thus it is said: \"the people are honest and simple.\")*\n\nWhen governance is sharp and exacting, the people are fractious and lacking.\n*(Establishing laws and making rewards and punishments clear to restrain deceit and artifice is called \"sharp and exacting.\" Distinctions and divisions breed contention among the people. Thus it is said: \"the people are fractious and lacking.\")*\n\nDisaster!—Fortune leans upon it.\nFortune!—Disaster lurks within it.\nWho knows their limit?\nThere is no fixed standard.\n*(Who knows the ultimate in good governance? Only when there is nothing to be corrected, nothing to be shaped—dull and unobtrusive, yet all under heaven is transformed—is this the limit.)*\n\nUprightness reverts to cunning.\n*(Governing with uprightness soon leads to cunning in warfare. Thus it is said: \"Uprightness reverts to cunning.\")*\nGoodness reverts to perversity.\n*(Establishing goodness to harmonize the myriad things soon leads to perverse calamities. Thus it is said: \"Goodness reverts to perversity.\")*\n\nThe people’s delusion has lasted long indeed!\n*(Han Feizi reads: \"Thus it has lasted long.\")*\nThe people’s delusion and loss of the Dao have endured for so long—\none cannot suddenly correct them with good governance.\n\nTherefore, the sage is square but does not cut,\n*(Using squareness to guide things, he sets aside their perversity but does not use squareness to carve them—what is called \"great square has no corners.\")*\nsharp but does not pierce,\n*(Sharpness here means clarity. To pierce is to wound. Using clarity to purify the people, he removes their perversity and filth but does not use clarity to wound them.)*\nstraight but does not stretch,\n*(Using straightness to guide things, he removes their crookedness but does not use straightness to provoke them—what is called \"great straightness seems bent.\")*\nbright but does not dazzle.\n*(Using brightness to illuminate what causes delusion, he does not use brightness to expose hidden faults—what is called \"the luminous Dao seems dark.\")*\nAll these honor the root and quiet the branches,\nnot attacking but restoring.\n\n**[Chapter 59]**\n\nIn governing people and serving heaven, nothing surpasses frugality.\n*(Nothing surpasses: nothing is better. Frugality: the farmer tending his fields removes what is excessive and returns to uniformity. Preserving nature, not hastening its decline, removing what causes decay—nothing better serves heaven’s mandate and pacifies the people.)*\n\nOnly frugality is called \"early alignment.\"\nEarly alignment means accumulating virtue.\n*(Only by accumulating virtue without seeking swift results can one achieve early alignment with constancy. Thus it is said: \"Early alignment means accumulating virtue.\")*\n\nAccumulating virtue leads to overcoming all—\nwhen nothing cannot be overcome, none know its limit.\n*(The Dao is boundless.)*\nWhen none know its limit, one can possess the state.\n*(To govern the state with what is finite is not truly possessing it.)*\n\nPossessing the mother of the state ensures long duration.\n*(What stabilizes the state is called its mother. Accumulating virtue is to plan for the root—only then can one tend the branches and secure their end.)*\nThis is called \"deep roots and firm foundation\"—\nthe Dao of long life and enduring vision.\n\n**[Chapter 60]**\n\nGoverning a great state is like cooking a small fish—\ndo not disturb it.\nAgitation brings harm; stillness preserves integrity.\nThus, the greater the state, the more still its ruler must be—\nonly then can he broadly win the people’s hearts.\n\nWhen the Dao is used to govern all under heaven, its ghosts have no spirit.\n*(Governing a great state is like cooking a small fish. When the Dao is used to govern all under heaven, its ghosts have no spirit.)*\n\nIt is not that the ghosts lack spirit—\ntheir spirit does not harm people.\n*(Spirit does not violate nature. When things abide in nature, spirit has nothing to add. When spirit has nothing to add, one does not perceive its spirit.)*\n\nNonetheless, it is not that the spirits do not harm people—it is the sage who likewise does no harm.\nWhen the Dao flows harmoniously, spirits do no harm to people; when spirits do no harm, one ceases to perceive their numinosity.\nWhen the Dao flows harmoniously, the sage likewise does no harm; when the sage does no harm, one ceases to perceive his sageliness.\nThus, one no longer knows the numinosity of spirits or the sageliness of the sage.\nTo rely on coercive power to govern all things marks the decline of governance.\nTo render the numinosity of spirits and the sageliness of the sage imperceptible—this is the ultimate perfection of the Dao.\n\nAs neither harms the other, their virtues intermingle and return as one.\nSpirits do not harm people; the sage likewise does no harm. The sage does not harm people; spirits likewise do no harm. Hence it is said: \"Neither harms the other.\"\nWhen spirits and sages unite with the Dao, their virtues converge and return.\n\n**[Chapter 61]**\n\nA great state is like the lower reaches of a river—\njust as the Yangtze and the sea, vast yet dwelling below, draw the hundred streams to flow into them,\nso too does a great state, vast yet dwelling below, draw all under heaven to flow toward it.\nThus it is said: \"A great state is like the lower reaches.\"\n\nThe convergence of all under heaven—\nthis is the defense to which all return.\n\nThe female of all under heaven—\nstill and not seeking, yet things naturally come to her.\nThe female ever prevails over the male through stillness, ever abides below through stillness.\nThrough her stillness, she is able to be below.\n\nThe female is the yielding; the male, restless and driven by desire.\nThe female ever prevails over the male through stillness.\nThrough her stillness, she is again able to be below—\nthus do things come to her.\n\nTherefore, when a great state humbles itself before a small state,\nit wins the small state’s allegiance.\nWhen a small state humbles itself before a great state,\nit is received by the great state.\nThus, some humble themselves to win; some humble themselves and are won.\n\nIt is said: only by cultivating lowliness can each attain its proper place.\nA great state desires no more than to shelter and nurture others;\na small state desires no more than to enter into service.\nWhen both attain what they desire,\nthe greater should abide below.\n\n**[Chapter 62]**\n\nThe Dao is the profound mystery of the ten thousand things—\na shelter, a refuge, a place of warmth and protection.\n\nThe good person treasures it as a treasure to be used;\nthe not-good person clings to it as a safeguard to preserve life.\nFair words can be traded for esteem,\nnoble conduct can be extended to others—\nnothing precedes the Dao,\nnothing in the world is more precious than this.\nThough one possess treasures of jade and teams of horses,\nnone can compare to it.\nFair words can outbid all other goods in the marketplace—\nthus it is said: fair words can be traded.\nNoble conduct evokes response from a thousand miles away—\nthus it is said: it can be extended to others.\nHow can one abandon those who are not good?\nEven the not-good should be sheltered by the Dao to avoid exile.\nThus the Son of Heaven is established, the Three Dukes appointed—\nthis is how the Dao is honored through noble conduct.\nThough one lead with jade disks and teams of horses,\nit is not equal to sitting and advancing this Dao.\nThis is what the highest mean by the Dao.\nThus the Son of Heaven is established, the Three Dukes appointed,\ntheir positions exalted, their persons revered—\nall to serve the Dao.\nNothing in the world is more precious than this.\nTherefore, though one present jade disks and lead with teams of horses,\nadvancing it is not equal to sitting and advancing this Dao.\nWhy was this Dao prized in ancient times?\nDid they not say: by seeking it, one obtains;\nby relying on it, one avoids punishment?\nThus it is treasured by all under heaven.\nThrough seeking, one attains what is sought;\nthrough reliance, one attains exemption—\nnothing is left unapplied.\nThus it is treasured by all under heaven.\n\n**[Chapter 63]**\n\nAct without acting,\nattend without attending,\ntaste without tasting.\nDwell in non-action,\nteach without words,\nfind flavor in tranquility—\nthis is the perfection of governance.\nRespond to small with small, to much with little;\nrepay resentment with virtue.\nA small grievance does not warrant repayment,\na great grievance invites the world’s condemnation—\nwhat all under heaven share in common is virtue.\nAddress difficulty while it is still easy,\nhandle greatness while it is still small.\nThe difficult affairs of the world arise from the easy,\nthe great affairs of the world arise from the small.\nThus the sage never attempts greatness\nand thereby achieves greatness.\nOne who makes light promises will lack trust,\none who treats much as easy will encounter much difficulty.\nThus the sage regards even the easy as difficult—\nwith the sage’s talent, still they find the small and easy challenging,\nhow much more so for one without the sage’s talent who would neglect this?\nThus it is said: they regard it as difficult.\nIn the end, there will be no difficulty.\n\n**[Chapter 64]**\n\nWhat is secure is easy to maintain,\nwhat shows no sign is easy to plan for—\nfor in security one does not forget danger,\nin maintaining one does not forget loss,\nin planning one does not overlook the potential for failure.\nThus it is said: it is easy.\nWhat is fragile is easy to dissolve,\nwhat is minute is easy to scatter—\nthough nothing has entered, something arises;\nthough nothing has formed, greatness emerges.\nThis is because of their fragility and minuteness,\nwhich prevent the accomplishment of great deeds.\nThus they are easy.\nThese four are matters of vigilance to the end—\none cannot neglect maintenance because nothing is present,\nnor fail to scatter because nothing has formed.\nIf nothing is maintained, something will arise;\nif nothing is scattered, greatness will emerge.\nThus, contemplate the perils of the end as one does the calamities of the beginning,\nand there will be no failed affairs.\nAct before things arise—\nthis means in security, before signs appear.\n\nGoverning in the absence of disorder means preventing fragility.\nA tree of arm-span girth grows from a tender shoot;\na nine-tiered terrace rises from a basket of earth;\na journey of a thousand miles begins with a single step.\nThose who act fail;\nthose who grasp lose.\nThus, by vigilance at the end one eliminates the minute,\nand by eliminating disorder through non-action,\nthe forms and names of governance—when grasped—\ninstead generate affairs.\nThe root of craftiness and deceit flourishes,\nhence failure and loss.\nTherefore, the sage practices non-action and so does not fail,\nholds nothing and so does not lose.\nThe people, in their undertakings,\noften fail when nearly complete—\nthis is due to lack of vigilance at the end.\nIf one is as vigilant at the end as at the beginning,\nthere will be no failed affairs.\nThus, the sage desires what others do not desire\nand does not prize goods hard to obtain.\nThough desire is restrained, contention still arises;\nthough goods are trifling, greed and theft still emerge.\nTo learn what others do not learn is to redress the common transgression.\nNot learning yet possessing ability is natural;\nto be compared to those who do not learn is a fault.\nThus, learning what others do not learn\nredresses the common transgression\nand assists the self-so of the myriad things without daring to act.\n\nChapter Sixty-Five\nIn ancient times, those skilled in the Way\ndid not enlighten the people but sought to make them simple.\n\"Enlightenment\" means seeing much and crafty deceit,\nwhich obscures their simplicity.\n\"Simplicity\" means being without cunning, preserving truth,\nand following the natural.\nThe people are difficult to govern because of their many wiles.\nWith much cunning and deceit, they are hard to govern.\nThus, governing a state with cleverness is the state’s bane—\n\"cleverness\" here means governance.\nTo govern a state with cleverness is called its bane\nbecause the people are difficult to govern due to their many wiles.\nOne should block their openings and shut their doors,\ncausing them to be without knowledge or desire,\nand move them with clever techniques.\nOnce their devious hearts are stirred,\none attempts to restrain their falsity with crafty methods.\nThe people, knowing these restraints, evade them with deeper schemes,\nand deceit and falsity flourish all the more.\nThus it is said: governing a state with cleverness is the state’s bane.\nNot governing a state with cleverness is the state’s blessing.\nKnowing these two is also a model.\nTo constantly know the model is called profound virtue.\nProfound virtue is deep and far-reaching.\nIt moves counter to things,\nreturning to their truth.\n\nThen one attains great compliance.\n\nThe rivers and seas can be kings of the hundred valleys\nbecause they are good at being below them—\nthus they can be kings of the hundred valleys.\nTherefore, if one wishes to be above the people,\none must speak as though below them;\nif one wishes to lead the people,\none must place oneself behind them.\nThus the sage abides above yet the people do not feel burdened,\nstands ahead yet the people do not feel harmed.\nTherefore the world delights in exalting him without weariness.\nBecause he does not contend,\nno one in the world can contend with him.\n\nThe world all says my Dao is great, yet it seems unworthy.\nPrecisely because it is great, it seems unworthy.\nIf it were worthy, it would long since have become small.\nFor long it would have been small—\nthis is to say, if it were worthy, it would lose what makes it great.\nThus it is said: if it were worthy, it would long since have become small.\n\nI possess three treasures that I hold and preserve:\nthe first is called compassion,\nthe second is called frugality,\nthe third is called not daring to be first in the world.\nCompassion enables courage—\nfor with compassion, one triumphs in battle and stands firm in defense,\nthus enabling courage.\nFrugality enables breadth—\nby practicing restraint and cherishing resources,\nthe world does not become depleted, thus enabling breadth.\nNot daring to be first in the world enables one to become the vessel’s elder—\nonly by putting oneself last and relinquishing one’s person\ndoes one become the refuge of all things;\nthen one can establish and complete the vessel,\nbecoming the world’s benefit and the elder of all things.\n\nNow, if one abandons compassion and yet seeks courage,\nthis is merely grasping.\n\nAbandoning frugality yet seeking breadth,\nforsaking humility yet striving to be first—\nthis is death.\nFor with compassion, one triumphs in battle—\nmoved by mutual care, none shirks peril, thus victory.\nWith compassion, one stands firm in defense—\nHeaven will save and shield with compassion.\n\n**Chapter Sixty-Eight**\nThe true warrior is not martial—\nmartiality exalts aggression and domination.\nThe master of battle is not wrathful—\nacting only after others, responding without provocation, thus free from anger.\nThe one who conquers the enemy does not contend—\nnot engaging in struggle.\nThe one who employs others humbles himself—\nthis is called the virtue of non-contention,\nthis is called the power of employing others’ strength.\nEmploy others without humbling oneself,\nand their strength will not be put to use.\nThis is called matching Heaven, the ultimate of antiquity.\n\n**Chapter Sixty-Nine**\nIn warfare, there is a saying:\n\"I dare not act as host but as guest,\ndare not advance an inch but retreat a foot.\"\nThis is called advancing without advancing,\nrepelling without arms,\nseizing without weapons,\nresisting without enemies—\nmoving as if in formation yet without formation,\nraising arms as if armless,\ngrasping weapons as if weaponless,\nfacing foes as if no foe stands before you.\nFor there is no greater disaster than underestimating the enemy—\nunderestimating the enemy nearly forfeits my treasures.\nThus when armies clash in equal force,\nthe side moved by sorrow prevails—\nfor they cherish one another and do not pursue gain or flee harm.\n\n**Chapter Seventy**\nMy words are exceedingly easy to know,\nexceedingly easy to practice,\nyet none in the world can know them,\nnone can practice them.\nThey can be known without stepping beyond the door or peering through the window—\nthus I say they are easy to know.\nThey are accomplished through non-action—\nthus I say they are easy to practice.\nYet deluded by restlessness and desire,\nnone can know them.\nBewildered by glory and profit,\nnone can practice them.\nMy words have a source, my affairs have a lord—\nthe source is the origin of all things,\nthe lord is the master of all things.\nOnly through ignorance do they fail to know me.\nThose who know me are rare,\nthus I am esteemed—\nfor profound understanding is scarce,\nand those who grasp me are few, making me peerless.\nTherefore the sage wears coarse cloth yet holds jade—\nwearing coarse cloth, he blends with the dust,\nholding jade, he treasures his truth.\nThe sage is difficult to know because he mingles with the world yet remains distinct,\ncherishes his truth without alteration—\nthus he is difficult to know and held in esteem.\n\n**Chapter Seventy-One**\nTo know yet appear not to know is supreme;\nnot to know yet claim to know is a flaw.\nOnly by recognizing this flaw as a flaw\ncan one be free from flaw.\n\nOnly by recognizing the flaw as a flaw\ncan one be free from flaw.\nThe sage is free from flaw\nbecause he recognizes the flaw as a flaw—\nthus he is free from flaw.\n\n**Chapter Seventy-Two**\nWhen the people do not fear power,\nthen great power arrives.\nDo not encroach upon their dwelling,\ndo not oppress their livelihood.\nTo dwell in clarity and stillness is called \"dwelling,\"\nto remain humble and unfilled is called \"livelihood.\"\nAbandoning clarity to act with haste,\nforsaking humility to wield power—\nthen things are disturbed and the people turn perverse.\nPower can no longer restrain them;\nthe people cannot endure its weight,\nand thus above and below collapse entirely.\nHeaven’s punishment will come—\nthus it is said:\nWhen the people do not fear power,\nthen great power arrives.\nDo not encroach upon their dwelling,\ndo not oppress their livelihood—\nthis means power must not be wielded recklessly.\n\nOnly by not oppressing,\nby not oppressing oneself,\ncan one avoid oppression.\nNot oppressing oneself,\nthus the world does not oppress him.\nTherefore the sage knows himself but does not display himself,\ndoes not flaunt his knowledge to dazzle or overawe.\nHe cherishes himself but does not exalt himself—\nfor self-exaltation invites encroachment and oppression.\nThus he discards that and embraces this.\n\n**Chapter Seventy-Three**\nCourage in daring leads to killing,\nand one will surely not die a natural death.\n\nCourage in refraining brings life,\nand one will surely align with fate.\nThese two—though both are courage—\ndiffer in their application,\nand thus their outcomes diverge:\none brings benefit, the other harm.\nThus it is said: some bring benefit, some bring harm.\n\nWho knows the reason for Heaven’s aversion?\nEven the sage finds this difficult.\nWho can fathom what Heaven abhors?\nOnly the sage—yet even his clarity hesitates before the peril of reckless daring.\nHow much more so for those lacking the sage’s insight,\nwho yet presume to act?\nThus it is said: even the sage finds this difficult.\n\nThe Way of Heaven does not contend, yet excels in victory.\nPrecisely because it does not contend,\nnone in the world can contend with it.\nIt does not speak, yet responds with perfect accord—\ncompliance brings fortune, defiance brings misfortune,\nthough it utters no word.\nIt does not summon, yet things come of their own accord—\nabiding in lowliness, all things return to it.\nVast and unhurried, it excels in planning—\nrevealing omens to foretell fortune or misfortune,\npreparing in advance with sincerity,\nat peace yet never forgetting peril.\nBefore being summoned, it has already devised strategy—\nthus it is said: vast and unhurried, it excels in planning.\n\nHeaven’s net is vast and wide,\nloose yet never failing.\n\n**Chapter Seventy-Four**\nIf the people do not fear death,\nhow can death be used to frighten them?\nIf one could make the people constantly fear death,\nand for those who act perversely seize and kill them—\nwho would dare?\nThose who stir chaos and disrupt the multitude are called \"perverse.\"\nThere is always one who executes—\nbut to take the executioner’s place is to hew in the master carpenter’s stead.\nFew who hew in the master carpenter’s stead\nescape injury to their own hands.\nTo act against the natural order is what the compliant abhor,\nwhat the virtueless provoke others to resent.\nThus it is said: there is always one who executes.\n\n**Chapter Seventy-Five**\nThe people’s hunger arises from their superiors consuming excessive taxes—\nthis is why they hunger.\nThe people’s unruliness arises from their superiors’ excessive action—\nthis is why they are unruly.\nThe people’s disregard for death arises from their excessive pursuit of life—\nthis is why they disregard death.\nOnly one who does not make life his pursuit\nis wiser than one who values life.\nThe people’s perversity and the world’s disorder\nall stem from above, not below—\nthe people follow their superiors.\n\n**Chapter Seventy-Six**\nWhen a person is alive, they are supple and weak;\nin death, they are rigid and strong.\nAll things—plants and trees—\nin life are soft and fragile;\nin death, they are withered and brittle.\nThus the rigid and strong are companions of death,\nwhile the supple and weak are companions of life.\nTherefore, when armies are strong, they do not prevail—\nfor violent strength in arms is what all things abhor,\nand thus it cannot triumph.\nWhen wood is strong, it is felled—\nfor it invites the axe’s blade.\nThe strong and great abide below—\nthis is the root of the tree.\nThe supple and weak abide above—\nthese are the branches.\n\n**Chapter Seventy-Seven**\nThe Way of Heaven—is it not like the drawing of a bow?\nWhat is high is pressed down,\nwhat is low is raised up.\nWhat has excess is diminished,\nwhat is deficient is supplemented.\nThe Way of Heaven diminishes excess and supplements deficiency.\nThe way of man is otherwise:\nit diminishes the deficient to serve the excess.\nWho can take excess and serve the world?\nOnly one who holds the Dao.\nThus the sage acts without claiming,\nachieves without abiding—\nhe does not wish to display his worth.\n\nTo dwell in fullness yet preserve emptiness,\nto diminish excess and supplement deficiency,\nto harmonize light and merge with dust,\nto level and equalize—\nonly the Dao accomplishes this.\nThus the sage does not display his worth to equalize the world.\n\n**Chapter Seventy-Eight**\nNothing in the world is softer or weaker than water,\nyet in attacking the hard and strong, nothing surpasses it—\nnothing can take its place.\nIts use is this:\nthe weak overcomes the strong,\nthe soft overcomes the hard.\nIn the world, none do not know this,\nyet none can practice it.\nThus the sage says:\n“One who bears the nation’s disgrace\nis called the lord of the altars of soil and grain;\none who bears the nation’s misfortune\nis called the king of all under heaven.”\nTrue words seem their opposite.\n\n**Chapter Seventy-Nine**\nIn reconciling great enmity, some enmity must remain.\nHow can this be considered good?\nThus the sage holds the left tally\nand does not demand from others.\nThe virtuous tend the tally,\nthe unvirtuous tend the tax.\nThe Way of Heaven shows no partiality—\nit ever aligns with the good.\n\n**Chapter Eighty**\nLet the state be small, its people few.\nThough there be tools for ten or a hundred,\nlet them not be used.\nLet the people regard death as weighty\nand not wander far.\nThough there be boats and carriages,\nlet none ride them;\nthough there be armor and weapons,\nlet none display them.\nLet the people return to knotting cords for use.\nLet them savor their food,\nfind beauty in their clothing,\nbe content in their dwellings,\ndelight in their customs.\nThough neighboring states are within sight,\nand the sounds of dogs and roosters are heard,\nthe people will grow old and die\nwithout ever traveling between them—\nwithout desire.\n\n**Chapter Eighty-One**\nTruthful words are not fine,\nfine words are not truthful.\nThe real lies in substance.\n\nThe fair-spoken are not truthful—\ntheir root lies in simplicity.\nThe good do not dispute;\nthe disputatious are not good.\nThe knowing are not broad—\ntheir utmost lies in the One.\nThe broad are not knowing.\nThe sage does not accumulate,\nyet by being selfless, possesses all;\nhe merely aligns with the good,\nletting things take their course.\nHaving acted for others, he himself gains more—\nthus things honor him.\nHaving given to others, he himself abounds—\nthus things turn toward him.\n\nThe Way of Heaven benefits and does no harm,\never moving to generate and complete.\nThe Way of the sage acts yet does not contend,\nfollowing Heaven’s benefit without mutual injury.\n\nWang Bi’s *Laozi Daodejing* in two scrolls truly grasps the learning of Laozi—akin to the lineage of Yan Junping’s *Zhigui*. His words on benevolence, righteousness, and ritual, which cannot function on their own but must rely on the Dao to be employed, show how heaven, earth, and the myriad things each attain the One. How could his merit be limited to Laozi alone? All scholars must surely know this.\n\nHerein I recognize that Bi’s grasp of the *Laozi* was profound, while his *Zhouyi* was secondary. In the *Zhouyi*, he often borrowed from Laozi’s safeguards, whereas Laozi needed no recourse to the *Zhouyi*—the traces of his excess and deficiency are plainly visible. Alas, how difficult learning is! Bi knew that fine weapons are ill-omened implements, yet when it came to \"treating victory in war with mourning rites,\" these were not Laozi’s words. He did not understand that \"constantly excelling in saving people, thus none are abandoned; constantly excelling in saving things, thus none are discarded.\" This he derived solely from Heshang Gong, though the ancient text lacked it. Fortunately, Fu Yi was able to discern this.\n\nYet Bi titled his work *Daodejing* without dividing it into \"Dao\" and \"Virtue\" as upper and lower parts—this was closer to antiquity. However, its text contains many errors and corruptions, some nearly unreadable, which is lamentable.\n\nI have often said that Bi’s *Laozi*, Zhang Zhan’s *Liezi*, Guo Xiang’s *Zhuangzi*, Du Yu’s *Zuozhuan*, Fan Ning’s *Guliang*, Mao Chang’s *Book of Songs*, and Guo Pu’s *Erya* each form a complete school of learning. Though later scholars may produce works, they cannot easily surpass them.\n\nHaving transcribed Bi’s text, I record this here. Written on the dingchou day of the tenth month in the yiwei year of the Zhenghe era (1115), by Chao Gongwu of Songshan, at Fuzhi.\n\nThe *Holy Words of Xianping* state: \"The *Laozi Daodejing* is the essential guide for governing the world.\" Though the Emperor Minghuang’s commentary is resplendent and worthy of admiration, Wang Bi’s annotations, with their concise language and profound meaning, truly capture the pure and tranquil safeguards of Laozi’s teaching. From this, one may seek it. Bi’s commentary was diligently pursued, yet rare in recent times—only after a long time was it obtained.\n\nIn former years, while serving as acting educational official in Jianning, I once had it printed. Later, I acquired the edition annotated by Master Chao Yidao, which did not divide \"Dao\" and \"Virtue\" into upper and lower parts, nor did it include chapter divisions. I rejoiced in its closeness to antiquity and transcribed it for preservation. In the gengyin year of the Qiandao era (1170), while teaching in Jingkou, I had it block-printed for transmission. As for its textual errors and corruptions, earlier scholars were unable to verify them—how dare I presume to alter them? I can only await those with true knowledge.\n\nRespectfully recorded on the twenty-fourth day of the third month by Xiong Ke, Left Assistant Gentleman and Professor of the Jingkou Prefecture School. *Laozi Daodejing*, Lower Scroll.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "钦定四库全书　　　　　　　子部十四 老子道德经　　　　　　　　道家 提要 【臣】等谨案老子注二卷魏王弼撰案隋书经籍志载老子道德经二卷王弼注旧唐书经籍志作元言新记道德二卷亦称弼注名已不同新唐书艺文志又以元言新记道德为王肃撰而弼所注者别名新记元言道德盖为舛互疑一书而误分为二又颠错其文也 惟宋史艺文志作王弼老子注与此本同今从之钱曾读书敏求记谓弼注老子已不传然明万历中华亭张之象实有刻本证以经典释文及永乐大典所载一一相符列子天瑞篇引谷神不死六句张湛皆引弼注以释之虽增损数字而文亦无异知非依托曾盖偶未见也 此本即从张氏三经晋注中录出亦不免于脱讹而大致尚可辨别后有政和乙未晁说之防称文字多谬误又有乾道庚寅熊克重刋跋称近世希有盖久而后得之则书在宋时已希逄善本矣 然二防皆称不分道经德经而今本经典释文实上卷题道经音义下卷题德经音义与此本及防皆不合岂传刻释文者反据俗本增入欤考陈振孙书录解题尚称不分道经德经而陆游集有此书防曰晁以道谓王辅嗣老子注题曰道德经不析乎 道德而上下之犹近乎 古此本乃已析矣 安知其他无妄加窜定者乎",
      "translated_text": "The Imperial *Complete Library of the Four Treasuries*\n*Masters Section, Fourteenth Division: Laozi’s Dao and Virtue Classic*\n*Daoist School – Descriptive Summary*\n\nWe, your ministers, respectfully note: *Wang Bi’s Commentary on the Laozi* in two fascicles. According to the *Bibliographic Treatise* of the *History of the Sui*, there exists *Laozi’s Dao and Virtue Classic* in two fascicles with Wang Bi’s commentary. The *Old唐书*’s *Bibliographic Treatise* records *Yuan Yan’s New Record of the Dao and Virtue* in two fascicles, also attributed to Bi’s commentary, though the title differs. The *New唐书*’s *Treatise on Arts and Letters* further attributes *Yuan Yan’s New Record of the Dao and Virtue* to Wang Su, while Bi’s commentary is separately titled *New Record of Yuan Yan’s Dao and Virtue*—clearly a case of confusion, where one text was mistakenly divided into two, with its passages disordered.\n\nOnly the *History of the Song*’s *Treatise on Arts and Letters* records *Wang Bi’s Commentary on the Laozi*, matching this edition; thus, we follow it. Qian Zeng’s *Record of Reading with Keen Seeking* states that Bi’s commentary on the *Laozi* no longer survives, yet during the Wanli reign of the Ming, Zhang Zhixiang of Zhonghuating indeed produced a printed edition. Comparing it with the *Exegesis of the Classics* and the *Yongle Encyclopedia*, the texts align precisely. The *Heavenly Auspices* chapter of the *Liezi* cites the six lines beginning with “The Valley Spirit never dies,” and Zhang Zhan’s commentary also quotes Bi’s annotations to explicate them—though a few characters are altered, the meaning remains unchanged, confirming it is not a forgery. Qian Zeng likely never encountered it by chance.\n\nThis edition is transcribed from Zhang’s *Three Classics with Jin Commentaries*, though it is not without omissions and errors, its general sense remains discernible. A postscript by Chao Shuo of Fang, dated the *yiwei* year of the Zhenghe reign, notes that the text contains many errors. Another colophon by Xiong Ke, reprinted in the *gengyin* year of the Qiandao reign, states that it had become rare in recent times—only after a long search was it obtained. Thus, even in the Song dynasty, fine editions were scarce.\n\nHowever, both Chao and Fang remark that the text does not divide the *Dao Classic* and *Virtue Classic*, whereas the *Exegesis of the Classics* explicitly titles the first fascicle *Pronunciation and Meaning of the Dao Classic* and the second *Pronunciation and Meaning of the Virtue Classic*—inconsistent with this edition and the postscripts. Could it be that the transcribers of the *Exegesis* added these divisions based on a vulgar edition? Chen Zhensun’s *Book Catalogue with Annotations* still records it as undivided into *Dao* and *Virtue* sections. Lu You’s collected works include a postscript stating: “Chao, by way of Dao, said: Wang Fusi’s *Commentary on the Laozi* is titled *Dao and Virtue Classic*, not splitting *Dao* and *Virtue* into upper and lower sections—this is closer to antiquity.” Yet this edition has already been divided. How can we be certain that other arbitrary alterations have not been made?",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 455,
      "start_sentence": 0,
      "end_sentence": 9,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.003718614578247,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "其防作于庆元戊午已非晁氏所见本则经典释文之遭妄改固已久矣 乾隆四十三年二月恭校上 总纂官【臣】纪昀【臣】陆熊【臣】孙士毅 总　校　官　【臣】　陆　费　墀 钦定四库全书 老子道德经上篇 魏　王弼　注 一章【案河上公注本此为体道章今依张之象所录王注原本】 道可道非常道名可名非常名 可道之道可名之名指事造形非其常也故不可道不可名也 无名天地之始有名万物之母 凡有皆始于无故未形无名之时则为万物之始及其有形有名之时则长之育之亭之毒之为其母也言道以无形无名始成万物以始以成而不知其所以之又也 故常无欲以观其妙【案永乐大典此句上无故字】 妙者防之极也万物始于防而后成始于无而后生故常无欲空虚可以观其始物之妙 常有欲以观其徼 徼归终也凡有之为利必以无为用欲之所本适道而后济故常有欲可以观其终物之徼也 此两者同出而异名同谓之之又众妙之门两者始与母也【案永乐大典母作无误】同出者同出于也异名所施不可同也在首则谓之始在终则谓之母者冥也默然无有也始母之所出也不可得而名故不可言同名曰而言谓之者取于不可得而谓之然也谓之然则不可以定乎一而已则是名则失之远矣【案此二句疑有脱误】故曰之又也众妙皆从同而出故曰众妙之门也 二章【案河上公注本此为养身章】 天下皆知美之为美斯恶已皆知善之为善斯不善已故有无相生难易相成长短相较【案各本俱作形陆德明经典释文作较盖用弼本】高下相倾音声相和前后相随 美者人心之所进乐也恶者人心之所恶疾也美恶犹喜怒也善不善犹是非也喜怒同根是非同门故不可得而偏举也【案原本无而字今据永乐大典校】此六者皆陈自然不可偏举之明数也 是以圣人处无为之事 自然已足【案永乐大典足作定】为则败也 行不言之教万物作焉而不辞生而不有为而不恃智慧自备为则伪也 功成而弗居【案永乐大典无而字弗作不】 因物而用功自彼成故不居也 夫唯弗居【案永乐大典弗作不】是以不去 使功在已则功不可久也 三章【案河上公注本此为安民章】 不尚贤使民不争不贵难得之货使民不为盗不见可欲使民心不乱【案原本及各本俱无民字惟永乐大典有之据弼注故可欲不见上承没命而盗则经文本有民字今校】 贤犹能也尚者嘉之名也贵者隆之称也【案称释文云一本作号一本作名】唯能是任尚也曷为唯用是施贵之何为尚贤显名荣过其任为而常校能相射贵货过用贪者竞趣穿窬探箧没命而盗故可欲不见则心无所乱也 是以圣人之治虚其心实其腹 心懐智而腹懐食虚有智而实无知也",
      "translated_text": "The postscript was written in the *wuyin* year of the Qingyuan reign (1198), which was no longer the edition seen by Chao Yidao. Thus, the *Pronunciation and Meaning of the Classics* had already suffered arbitrary alterations for quite some time.\n\nRespectfully collated and presented in the second month of the forty-third year of the Qianlong reign (1778).\n\n*Chief Compilers:*\nMinister Ji Yun\nMinister Lu Feixiong\nMinister Sun Shiyi\n\n*Chief Collator:*\nMinister Lu Feichi\n\n*Imperially Commissioned Complete Library of the Four Treasuries*\n\n*Laozi’s Dao and Virtue Classic, Upper Fascicle*\n*Commentary by Wang Bi of Wei*\n\n**Chapter One**\n[*Note: In the He Shanggong commentary, this is the \"Embodying the Dao\" chapter. Here follows the original text of Wang Bi’s commentary as recorded by Zhang Zhixiang.*]\n\nThe Dao that can be spoken is not the constant Dao.\nThe name that can be named is not the constant name.\n\nThe Dao that can be spoken and the name that can be named refer to concrete things and formed shapes—they are not constant. Thus, they cannot be spoken of as Dao, nor can they be named.\n\n\"Nameless\" is the beginning of Heaven and Earth.\n\"Named\" is the mother of the myriad things.\n\nAll that exists begins from nothing. Thus, when things are unformed and nameless, this is the beginning of the myriad things. When they have form and name, this is when they are reared, nourished, ripened, and matured—acting as their mother. The Dao begins the myriad things with formless nothingness and completes them with the beginning, yet one does not know the mystery of how it accomplishes this—hence, it is again mysterious.\n\nTherefore, in constant nothingness, observe its wonder.\n[*Note: The *Yongle Encyclopedia* omits the character *gu* (故, \"therefore\") before this line.*]\n\n\"Wonder\" is the ultimate of subtlety. All things begin from subtlety before reaching completion; they begin from nothingness before coming into being. Thus, in constant nothingness and emptiness, one may observe the wonder of the beginning of things.\n\nIn constant having, observe its manifestations.\n\n\"Manifestations\" refer to returning to the end. All that exists relies on nothingness for its function. The root of desire must accord with the Dao before it can be fulfilled. Thus, in constant having, one may observe the manifestations—the end—of things.\n\nThese two emerge together but have different names.\nTogether, they are called the mysterious.\nMysterious and again mysterious—\nThe gateway to all wonders.\n\nThese two—beginning and mother—emerge together but have different names. They emerge together from the mysterious. Their applications cannot be the same: at the outset, it is called the beginning; at the end, it is called the mother. \"Mysterious\" means obscure, silent, and without form. It is the source of beginning and mother, yet it cannot be grasped and named. Thus, though it cannot be spoken of, it is collectively called the mysterious. To call it so is to take what cannot be grasped and name it as such. If one were to fix it as a single \"mysterious,\" then the name would be far from accurate.\n[*Note: These two sentences may contain omissions or errors.*]\nThus, it is said: \"Mysterious and again mysterious.\" All wonders emerge from this sameness, hence it is called the gateway to all wonders.\n\n**Chapter Two**\n[*Note: In the He Shanggong commentary, this is the \"Nurturing Life\" chapter.*]\n\nWhen all under Heaven know beauty as beauty, ugliness arises.\nWhen all know goodness as goodness, un-goodness arises.\n\nThus, having and nothingness give rise to each other;\nDifficulty and ease complete each other;\nLong and short contrast each other;\n[*Note: All editions read *xing* (形, \"form\"), but Lu Deming’s *Pronunciation and Meaning of the Classics* reads *jiao* (較, \"contrast\"), likely following Wang Bi’s original.*]\nHigh and low incline toward each other;\nSound and voice harmonize with each other;\nFront and back follow one another.\n\nBeauty is what the human heart advances toward and delights in; ugliness is what the human heart detests and abhors. Beauty and ugliness are like joy and anger; goodness and un-goodness are like right and wrong. Joy and anger share the same root; right and wrong emerge from the same gate. Thus, they cannot be singled out.\n[*Note: The original text lacks the character *er* (而, \"and\"); here corrected according to the *Yongle Encyclopedia.*]\nThese six are all manifestations of nature, clear proofs that they cannot be singled out.\n\nTherefore, the sage abides in non-action,\n[*Note: The *Yongle Encyclopedia* reads *ding* (定, \"settled\") instead of *zu* (足, \"sufficient\").*]\nFor acting leads to failure.\nPractices the teaching without words.\nThe myriad things arise yet are not rejected;\nThey are born yet not possessed;\nThey are acted upon yet not relied upon.\nWisdom and cunning are self-sufficient—acting leads to artifice.\n\nWhen the work is accomplished, it is not dwelled in.\n[*Note: The *Yongle Encyclopedia* omits *er* (而, \"and\") and reads *bu* (不, \"not\") instead of *fu* (弗, \"not\").*]\nUsing things, the work is completed by them, hence it is not dwelled in.\n\nOnly by not dwelling\n[*Note: The *Yongle Encyclopedia* reads *bu* (不, \"not\") instead of *fu* (弗, \"not\").*]\nDoes it not depart.\nIf the work were attributed to oneself, it could not endure.\n\n**Chapter Three**\n[*Note: In the He Shanggong commentary, this is the \"Pacifying the People\" chapter.*]\n\nDo not exalt the worthy, so the people do not contend.\nDo not prize goods that are hard to obtain, so the people do not steal.\nDo not display what is desirable, so the people’s hearts are not confused.\n[*Note: The original text and all editions lack the character *min* (民, \"people\"), but only the *Yongle Encyclopedia* includes it. According to Wang Bi’s commentary—\"desirable things not displayed, above it follows 'losing life and stealing'—the original text must have included *min*. Here corrected accordingly.*]\n\n\"Worthy\" means capable. \"Exalt\" is the name for esteeming; \"prize\" is the term for honoring.\n[*Note: Lu Deming’s *Pronunciation and Meaning* notes: \"One edition reads *hao* (号, 'title'); another reads *ming* (名, 'name').\"*]\nIf only the capable are employed, why exalt them? If only what is useful is applied, why prize it? Exalting the worthy makes names prominent, exceeding their capacity. Constantly comparing abilities leads to contention. Prizing goods beyond their use drives the greedy to compete, tunneling through walls and rifling through chests, risking their lives to steal. Thus, if the desirable is not displayed, the heart has nothing to be confused by.\n\nTherefore, in the sage’s governance:\nEmpty their hearts,\nFill their bellies.\n\nThe heart harbors wisdom; the belly harbors food. Emptying wisdom means being empty of knowledge; filling the belly means being full of substance.",
      "overlap_context": "n a vulgar edition? Chen Zhensun’s *Book Catalogue with Annotations* still records it as undivided into *Dao* and *Virtue* sections. Lu You’s collected works include a postscript stating: “Chao, by way of Dao, said: Wang Fusi’s *Commentary on the Laozi* is titled *Dao and Virtue Classic*, not splitting *Dao* and *Virtue* into upper and lower sections—this is closer to antiquity.” Yet this edition has already been divided. How can we be certain that other arbitrary alterations have not been made?",
      "start_char": 455,
      "end_char": 1513,
      "start_sentence": 10,
      "end_sentence": 41,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.0436635017395,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "弱其志强其骨 骨无知以干志生事以乱心虚则志弱也【案心虚则志弱也六字原本缺释文有应在此注之下今校】 常使民无知无欲 守其真也 使夫智者不敢为也 智者谓知为也 为无为则无不治 四章【案河上公注本此为无源章】 道冲而用之或不盈渊兮似万物之宗挫其锐解其纷和其光同其尘湛兮似或存【案或一作若】吾不知谁之子象帝之先 夫执一家之量者不能全家执一国之量者不能成国穷力举重不能为用故人虽知万物治也 治而不以二仪之道则不能赡也 【案赡原本作瞻今据永乐大典校改】地虽形魄不法于天则不能全其宁天虽精象不法于道则不能保其精冲而用之用乃不能穷满以造实实来则溢故冲而用之又复不盈其为无穷亦已极矣 形虽大不能累其体事虽殷不能充其量万物舍此而求主【案永乐大典作求其生】主其安在乎 不亦渊兮似万物之宗乎 锐挫而无损纷解而不劳和光而不污其体同尘而不渝其真不亦湛兮似或存乎 地守其形德不能过其载天慊其象德不能过其覆天地莫能及之不亦似帝之先乎 帝天帝也",
      "translated_text": "Weaken their ambitions, strengthen their bones.\nBones are without knowledge, serving as the framework; ambitions generate affairs, disturbing the heart. When empty, the heart’s ambitions weaken.\n\nConstantly keep the people without knowledge and without desire,\nPreserving their true nature.\nThus, even the wise dare not act.\nThe wise are those who know how to act.\nActing through non-action, nothing remains ungoverned.\n\nChapter Four\n\nThe Dao flows emptily, yet its use is inexhaustible.\nAbyssal, it seems the ancestor of the myriad things.\nBlunting sharpness,\nUntangling knots,\nHarmonizing light,\nMerging with dust—\nProfound, it seems to endure.\nI know not whose child it is,\nAn image prior to the Lord.\n\nThose who grasp the measure of a single household cannot preserve the whole household.\nThose who grasp the measure of a single state cannot perfect the state.\nExerting strength to lift the heavy cannot be put to use.\nThus, though one may know the governance of the myriad things,\nWithout the Dao of the Two Modes, one cannot sustain them.\n\nThough the earth possesses form and substance, without modeling itself on heaven, it cannot preserve its tranquility.\nThough heaven possesses essence and image, without modeling itself on the Dao, it cannot safeguard its essence.\nEmptily flowing, its use is never exhausted.\nFilled to overflowing, it spills over.\nThus, its emptiness in use never reaches fullness—\nIts inexhaustibility is truly boundless.\n\nThough form may be vast, it cannot burden its body.\nThough affairs may be numerous, they cannot exceed its measure.\nThe myriad things abandon this to seek their master—\nWhere does their master reside?\nIs it not abyssal, seeming the ancestor of the myriad things?\n\nSharpness blunted yet undiminished,\nKnots untangled without toil,\nLight harmonized yet the body unstained,\nDust merged yet true nature unaltered—\nIs it not profound, seeming to endure?\n\nThe earth guards its form, yet its virtue cannot surpass its bearing.\nHeaven fulfills its image, yet its virtue cannot surpass its covering.\nNeither heaven nor earth can match it—\nIs it not like that which precedes the Lord?\nThe Lord is the Heavenly Lord.",
      "overlap_context": "nstantly comparing abilities leads to contention. Prizing goods beyond their use drives the greedy to compete, tunneling through walls and rifling through chests, risking their lives to steal. Thus, if the desirable is not displayed, the heart has nothing to be confused by.\n\nTherefore, in the sage’s governance:\nEmpty their hearts,\nFill their bellies.\n\nThe heart harbors wisdom; the belly harbors food. Emptying wisdom means being empty of knowledge; filling the belly means being full of substance.",
      "start_char": 1513,
      "end_char": 1933,
      "start_sentence": 42,
      "end_sentence": 58,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.392259359359741,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "五章【案河上公注本此为虚用章永乐大典连后章至用之不勤也为第五章自天长地久至故能成其私为第六章以下章次俱异今悉依张之象所录王注原本】 天地不仁以万物为刍狗 天地任自然无为无造万物自相治理故不仁也仁者必造立施化有恩有为造立施化【案原本脱此四字今据永乐大典校】则物失其真有恩有为则物不具存物不具存则不足以备载矣地不为兽生刍而兽食刍不为人生狗而人食狗无为于万物而万物各适其所用则莫不赡矣【案赡原本作瞻今据永乐大典校改】若慧由巳树【案慧古通】未足任也 圣人不仁以百姓为刍狗 圣人与天地合其德以百姓比刍狗也【案比永乐大典作化】 天地之间其犹橐钥乎虚而不屈【案屈释文作掘】动而愈出橐排橐也钥乐钥也橐钥之中空洞无情无为故虚而不得穷屈动而不可竭尽也天地之中荡然任自然故不可得而穷犹若橐钥也 多言数穷不如守中 愈为之则愈失之矣物树其恶事错其言不济不言不理必穷之数也橐钥而守数中则无穷尽弃己任物则莫不理若橐钥有意于为声也则不足以共吹者之求也 六章【案河上公注本此为成象章】 谷神不死是谓牝牝之门是谓天地根绵绵若存用之不勤 谷神谷中央无谷也无形无影无逆无违处卑不动守静不衰谷以之成而不见其形此至物也处卑而不可得名故谓天地之根绵绵若存用之不勤门牝之所由也本其所由与极同体故谓之天地之根也欲言存耶则不见其形欲言亡耶万物以之生故绵绵若存也无物不成用而不劳也故曰用而不勤也 七章【案河上公注本此为韬光章】 天长地久天地所以能长且久者以其不自生 自生则与物争不自生则物归也 故能长生是以圣人后其身而身先外其身而身存非以其无私耶故能成其私 无私者无为于身也身先身存故曰能成其私也八章【案河上公注本此为易性章】 上善若水水善利万物而不争处众人之所恶 人恶卑也 故几于道 道无水有故曰几也 居善地心善渊与善仁言善信正善治【案永乐大典正作政古通用】事善能动善时夫唯不争故无尤 言人皆应于治道也【案永乐大典人作水治作此】 九章【案河上公注本此为运夷章】 持而盈之不如其巳 持谓不失德也既不失其德又盈之势必倾危故不如其巳者谓乃更不如无德无功者也 揣而棁之【案棁各本俱作锐惟释文作棁音锐】不可长保 既揣末令尖又锐之令利势必摧防故不可长保也 金玉满堂莫之能守 不若其巳",
      "translated_text": "Chapter Five\nHeaven and earth are not humane—\nThey regard the myriad things as straw dogs.\nHeaven and earth act by nature, without deliberate creation.\nThe myriad things govern themselves, thus they are not humane.\nFor humane action must involve creation, establishment, bestowal, and transformation.\nIf there is creation, establishment, bestowal, and transformation,\nThings lose their authenticity.\nIf there is favor and deliberate action,\nThings cannot fully exist.\nIf things cannot fully exist,\nThey are insufficient to bear the weight of all under heaven.\nEarth does not grow grass for beasts, yet beasts eat grass.\nIt does not raise dogs for humans, yet humans eat dogs.\nActing without deliberate action toward the myriad things,\nEach finds its proper use—\nThus none lacks sustenance.\nIf wisdom is imposed by oneself,\nIt is not yet sufficient to entrust.\n\nThe sage is not humane—\nThey regard the hundred clans as straw dogs.\nThe sage aligns their virtue with heaven and earth,\nTreating the hundred clans as straw dogs.\n\nBetween heaven and earth, is it not like a bellows?\nEmpty yet inexhaustible,\nIn motion it brings forth ever more.\nThe space within heaven and earth is vast and natural,\nThus it cannot be exhausted—\nJust like a bellows.\n\nThe more one speaks, the sooner one reaches an impasse.\nBetter to guard the center.\nThe more one acts, the more one loses.\nTo establish affairs and complicate words is to fail.\nWithout speech, without governance, one avoids the fate of exhaustion.\nIf the bellows guards its central emptiness,\nIt will never be depleted.\nAbandoning the self to follow things,\nAll is governed.\nIf the bellows had intent in producing sound,\nIt would not suffice for the needs of the blower.\n\n---\n\nChapter Six\nThe valley spirit does not die—\nThis is called the Mystic Female.\nThe gate of the Mystic Female\nIs called the root of heaven and earth.\nSubtly enduring, it seems to exist.\nIn its use, it is not exhausted.\n\nThe valley spirit is the center of the valley—\nFormless and shadowless,\nWithout resistance or opposition.\nAbiding in lowliness, unmoving,\nGuarding stillness, undiminished.\nBy this, the valley is formed, yet its form is unseen.\nThis is the supreme thing.\nDwelling in lowliness, it cannot be named,\nThus it is called the root of heaven and earth.\nTo say it exists—its form is unseen.\nTo say it does not exist—all things arise from it.\nThus, subtly enduring, it seems to exist.\nNothing is not accomplished by its use, yet it does not labor.\nTherefore, it is said: in its use, it is not exhausted.\n\n---\n\nChapter Seven\nHeaven is eternal, earth enduring.\nThe reason heaven and earth can be eternal and enduring\nIs that they do not live for themselves.\nTo live for oneself is to contend with things.\nNot living for oneself, things return to it.\nThus, it can endure.\n\nTherefore, the sage places their person last, yet it comes first.\nThey set their person aside, yet it is preserved.\nIs it not because they are without self-interest?\nThus, they can fulfill their self-interest.\n\nTo be without self-interest is to act without regard for the self.\nThe self comes first and is preserved—\nThus, it is said: they can fulfill their self-interest.\n\n---\n\nChapter Eight\nThe highest virtue is like water.\nWater benefits the myriad things without contention,\nDwelling where the multitude disdains.\nThus, it is near the Dao.\nThe Dao has no form, yet water does—\nThus, it is said to be near.\n\nIn dwelling, it favors the lowly.\nIn the heart, it favors depth.\nIn giving, it favors kindness.\nIn speech, it favors trust.\nIn governance, it favors order.\nIn affairs, it favors ability.\nIn action, it favors timeliness.\nOnly by not contending does it avoid blame.\nThis is how one aligns with the governance of the Dao.\n\n---\n\nChapter Nine\nTo hold and fill it is not as good as stopping.\nTo grasp and sharpen it cannot be long preserved.\nWhen gold and jade fill the hall,\nNone can guard them.\nNot as good as stopping.",
      "overlap_context": "t not abyssal, seeming the ancestor of the myriad things?\n\nSharpness blunted yet undiminished,\nKnots untangled without toil,\nLight harmonized yet the body unstained,\nDust merged yet true nature unaltered—\nIs it not profound, seeming to endure?\n\nThe earth guards its form, yet its virtue cannot surpass its bearing.\nHeaven fulfills its image, yet its virtue cannot surpass its covering.\nNeither heaven nor earth can match it—\nIs it not like that which precedes the Lord?\nThe Lord is the Heavenly Lord.",
      "start_char": 1933,
      "end_char": 2906,
      "start_sentence": 59,
      "end_sentence": 87,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.451149940490723,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "富贵而骄自遗其咎 不可长保也 功遂身退【案河上公注本及各本俱作功成名遂身退】天之道 四时更运功成则移 十章【案河上公注本此为能为章】 载营魄抱一能无离乎 载犹处也营魄人之常居处也一人之真也言人能处常居之宅抱一清神能常无离乎则万物自宾也 专气致柔能婴儿乎 专任也致极也言任自然之气致至柔之和能若婴儿之无所欲乎则物全而性得矣 涤除览能无疵乎 物之极也言能涤除邪饰至于极览能不以物介其明疵之其神乎【案二句疑有脱误】则终与同也 爱民治国能无知乎 任术以求成运数以求匿者智也览无疵犹绝圣也治国无以智犹弃智也能无以智乎则民不辟而国治之也 天门开阖能无雌乎【案注义无似作为】 天门谓天下之所由从也开阖治乱之际也或开或阖经通于天下故曰天门开阖也雌应而不倡因而不为言天门开阖能为雌乎则物自宾而处自安矣 明白四达能无为乎 言至明四达无迷无惑能无以为乎则物化矣所谓道常无为侯王若能守则万物自化 生之 不塞其原也",
      "translated_text": "Riches and honor breed arrogance, inviting one’s own downfall—\nthey cannot be long preserved.\nWhen merit is achieved and the self withdraws,\nthis is the Dao of Heaven.\nThe four seasons alternate in their work;\nwhen one’s task is complete, it is time to move on.\n\n---\n\nCan you carry the embodied soul and embrace the One without separation?\nTo dwell in the abode of the soul and hold fast to the true essence—\ncan you remain unparted?\nTo concentrate qi and attain suppleness,\ncan you be as guileless as an infant?\nTo cleanse and purify your profound vision,\ncan you leave no blemish?\nTo love the people and govern the state,\ncan you do so without cunning?\nWhen the gates of Heaven open and close,\ncan you remain receptive?\nTo comprehend all directions with clarity,\ncan you act without contrivance?\n\nTo give life without damming its source—\nthe Dao ever acts without acting.\nShould lords and kings abide by it,\nthe myriad things will transform of themselves.",
      "overlap_context": " favors the lowly.\nIn the heart, it favors depth.\nIn giving, it favors kindness.\nIn speech, it favors trust.\nIn governance, it favors order.\nIn affairs, it favors ability.\nIn action, it favors timeliness.\nOnly by not contending does it avoid blame.\nThis is how one aligns with the governance of the Dao.\n\n---\n\nChapter Nine\nTo hold and fill it is not as good as stopping.\nTo grasp and sharpen it cannot be long preserved.\nWhen gold and jade fill the hall,\nNone can guard them.\nNot as good as stopping.",
      "start_char": 2906,
      "end_char": 3343,
      "start_sentence": 88,
      "end_sentence": 106,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.43185830116272,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "畜之 不禁其性也 生而不有为而不恃长而不宰是谓德 不塞其原则物自生何功之有不禁其性则物自济何为之恃物自长足不吾宰成有德无主非而何【案而永乐大典作如古文而如通用】凡言德皆有德而不知其主出乎幽 十一章【案河上公注本此为无用章】 三十辐共一毂当其无有车之用 毂所以能统三十辐者无也以其无能受物之故故能以实统众也 埏埴以为器【案埏各本俱作埏惟释文作挻】当其无有器之用凿户牖以为室当其无有室之用故有之以为利无之以为用木埴壁所以成三者而皆以无为用也【案永乐大典无也字】言无者有之所以为利皆赖无以为用也 十二章【案河上公注本此为检欲章】 五色令人目盲五音令人耳聋五味令人口爽驰骋畋猎令人心发狂 爽差失也失口之用故谓之爽夫耳目口心皆顺其性也不以顺性命反以伤自然故曰盲聋爽狂也 难得之货令人行妨 难得之货塞人正路故令人行妨也",
      "translated_text": "To nurture them without restricting their nature—\nto give life without possessing,\nto act without relying,\nto lead without dominating—\nthis is called profound virtue.\n\nNot damming their source, things flourish of themselves—what merit is there to claim?\nNot restricting their nature, things fulfill themselves—what reliance is needed?\nThings grow to completion without our dominion—\nto possess virtue yet have no master,\nhow could this not be the profound?\n\nAll references to \"profound virtue\" speak of virtue whose source remains unseen, emerging from the hidden.\n\n---\n\nEleven\nThirty spokes converge upon a single hub;\nit is the emptiness within that grants the cart its use.\nThe hub’s capacity to unify the thirty spokes lies in its void—\nby its emptiness, it can receive all things,\nand thus with solidity govern the multitude.\n\nKnead clay to fashion vessels—\nit is the emptiness within that grants the vessel its use.\nCarve doors and windows to form a chamber—\nit is the emptiness within that grants the chamber its use.\nThus, what is present serves as advantage,\nwhile what is absent serves as function.\n\nWood, clay, and walls complete these three,\nyet all rely on emptiness for their use.\nTo speak of emptiness is to say:\nwhat is present serves as advantage,\nbut all depend on absence for their function.\n\n---\n\nTwelve\nThe five colors blind the eyes.\nThe five tones deafen the ears.\nThe five flavors dull the palate.\nRacing and hunting madden the heart.\nScarce goods obstruct conduct.\n\n\"Scar\" means loss—\nto lose the use of the mouth is called \"dulling.\"\nEars, eyes, mouth, and heart all follow their nature,\nyet instead of nurturing their natural endowment,\nthey harm it—\nhence the blindness, deafness, dullness, and madness.\n\nRare and precious goods block the true path,\nthus obstructing human conduct.",
      "overlap_context": "ttain suppleness,\ncan you be as guileless as an infant?\nTo cleanse and purify your profound vision,\ncan you leave no blemish?\nTo love the people and govern the state,\ncan you do so without cunning?\nWhen the gates of Heaven open and close,\ncan you remain receptive?\nTo comprehend all directions with clarity,\ncan you act without contrivance?\n\nTo give life without damming its source—\nthe Dao ever acts without acting.\nShould lords and kings abide by it,\nthe myriad things will transform of themselves.",
      "start_char": 3343,
      "end_char": 3727,
      "start_sentence": 107,
      "end_sentence": 119,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.259790420532227,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "是以圣人为腹不为目故去彼取此 为腹者以物养己为目者以物役己故圣人不为目也 十三章【案河上公注本此为厌耻章】 宠辱若惊贵大患若身何谓宠辱若惊宠为下得之若惊失之若惊是谓宠辱若惊 宠必有辱荣必有患惊辱等荣患同也为下得宠辱荣患若惊则不足以乱天下也 何谓贵大患若身 大患荣宠之属也生之厚必入死之地故谓之大患也人迷之于荣宠返之于身故曰大患若身也 吾所以有大患者为吾有身 由有其身也 及吾无身 归之自然也 吾有何患故贵以身为天下若可寄天下【案若可寄永乐大典作则可以寄河上公注本作则可寄于天下】 无以易其身故曰贵也如此乃可以托天下也 爱以身为天下若可托天下【案若可托永乐大典作乃可以托河上公注本作乃可以托于天下】 无物可以损其身故曰爱也如此乃可以寄天下也不以宠辱荣患损易其身然后乃可以天下付之也十四章【案河上公注本此为赞章】 视之不见名曰夷听之不闻名曰希搏之不得名曰防此三者不可致诘故混而为一 无状无象无声无响故能无所不通无所不徃不得而知更以我耳目体不知为名故不可致诘混而为一也 其上不皦其下不昧绳绳不可名【案永乐大典绳绳下有兮字】复归于无物是谓无状之状无物之象 欲言无耶而物由以成欲言有耶而不见其形故曰无状之状无物之象也 是谓惚恍 不可得而定也 迎之不见其首随之不见其后执古之道以御今之有有有其事 能知古始是谓道纪 无形无名者万物之宗也虽今古不同时移俗易故莫不由乎此以成其治者也故可执古之道以御今之有上古虽远其道存焉故虽在今可以知古始也十五章【案河上公注本此为显德章】 古之善为士者防妙通深不可识夫唯不可识故强为之容豫焉【案豫一作与】若冬渉川 冬之渉川豫然若欲度【案若原本讹作者今据永乐大典校改】若不欲度其情不可得见之貌也 犹兮若畏四邻 四邻合攻中央之主犹然不知所趣向者也上德之人其端兆不可睹德趣不可见亦犹此也 俨兮其若容【案容一本作客】涣兮若氷之将释敦兮其若朴旷兮其若谷混兮其若浊 凡此诸若皆言其容象不可得而形名也 孰能浊以静之徐清孰能安以久【案永乐大典无久字】动之徐生夫晦以理物则得明浊以静物则得清安以动物则得生此自然之道也孰能者言其难也徐者详慎也 保此道者不欲盈 盈必溢也",
      "translated_text": "Thus the sage attends to the belly, not to the eyes—\nhence he discards that and selects this.\nTo attend to the belly is to nourish oneself with things;\nto attend to the eyes is to be enslaved by things.\nTherefore the sage does not attend to the eyes.\n\nThirteen\nFavor and disgrace are like alarm;\nregard great trouble as you regard the body.\nWhat does it mean, \"favor and disgrace are like alarm\"?\nFavor is inferior—\nto gain it is like alarm,\nto lose it is like alarm.\nThis is what is meant by \"favor and disgrace are like alarm.\"\n\nFavor necessarily entails disgrace;\nglory necessarily entails trouble.\nAlarm at disgrace and glory, trouble and favor being equal,\nto be inferior and yet receive favor and disgrace, glory and trouble as alarm—\nthis is insufficient to throw the world into chaos.\n\nWhat does it mean, \"regard great trouble as you regard the body\"?\nGreat trouble refers to glory and favor and the like.\nTo live in abundance is necessarily to enter the realm of death—\nhence it is called \"great trouble.\"\nPeople are deluded by glory and favor,\nturning them back upon the body—\nthus it is said, \"regard great trouble as you regard the body.\"\n\nThe reason I have great trouble is that I have a body.\nIt arises from having this body.\nWhen I have no body,\nI return to the natural.\nWhat trouble could I then have?\nTherefore, to value using the body for the world\nis to be entrusted with the world.\nNothing can replace one’s body—\nhence it is called \"valuing.\"\nOnly thus can one be entrusted with the world.\n\nTo cherish using the body for the world\nis to be entrusted with the world.\nNothing can harm one’s body—\nhence it is called \"cherishing.\"\nOnly thus can one be entrusted with the world.\nNot allowing favor and disgrace, glory and trouble\nto harm or replace one’s body—\nonly then can one be entrusted with the world.\n\nFourteen\nLook at it and it cannot be seen—\nit is called \"subtle.\"\nListen to it and it cannot be heard—\nit is called \"rare.\"\nGrasp it and it cannot be held—\nit is called \"elusive.\"\nThese three cannot be further questioned,\nso they merge into one.\n\nWithout form, without image,\nwithout sound, without echo—\nthus it can penetrate everywhere,\ngo anywhere.\nIt cannot be known,\nyet I name it based on what the ears, eyes, and body do not know.\nHence it cannot be further questioned,\nand merges into one.\n\nAbove, it is not bright;\nbelow, it is not dark.\nContinuous, unceasing—\nit cannot be named.\nIt returns to nothingness.\nThis is called \"the form of the formless,\nthe image of the imageless.\"\nThis is called \"indistinct and vague.\"\n\nMeet it and you cannot see its beginning;\nfollow it and you cannot see its end.\nHold to the ancient Dao to master present being—\nbeing has its affairs.\nTo know the ancient beginning\nis called the thread of the Dao.\n\nThe formless and nameless is the ancestor of the ten thousand things.\nThough past and present differ,\ncustoms change,\nnone fail to follow this to achieve their order.\nThus one can hold to the ancient Dao\nto master present being.\nThough high antiquity is distant,\nits Dao remains.\nTherefore, though in the present,\none can know the ancient beginning.\n\nFifteen\nOf old, those adept in the Dao\nwere subtly mysterious, profoundly penetrating—\nso deep they could not be known.\nIt is only because they could not be known\nthat I am compelled to describe their appearance:\ncautious, as if crossing a river in winter;\nhesitant, as if fearing the neighbors on all sides;\nsolemn, as if a guest;\nyielding, as ice about to melt;\nsimple, as uncarved wood;\nhollow, as a valley;\nopaque, as muddy water.\n\nWho can make the turbid still and gradually clear?\nWho can make the still gradually come to life?\nThose who preserve this Dao do not desire fullness.\nIt is only because they do not desire fullness\nthat they can remain hidden and complete.",
      "overlap_context": ".\n\n---\n\nTwelve\nThe five colors blind the eyes.\nThe five tones deafen the ears.\nThe five flavors dull the palate.\nRacing and hunting madden the heart.\nScarce goods obstruct conduct.\n\n\"Scar\" means loss—\nto lose the use of the mouth is called \"dulling.\"\nEars, eyes, mouth, and heart all follow their nature,\nyet instead of nurturing their natural endowment,\nthey harm it—\nhence the blindness, deafness, dullness, and madness.\n\nRare and precious goods block the true path,\nthus obstructing human conduct.",
      "start_char": 3727,
      "end_char": 4678,
      "start_sentence": 120,
      "end_sentence": 152,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.024500846862793,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "夫唯不盈故能蔽不新成【案蔽永乐大典作敝】 蔽覆盖也 十六章【案河上公注本此为归根章】 致虚极守静笃 言致虚物之极笃守静物之真正也 万物并作 动作生长 吾以观复【案观下河上公注本及各本俱有其字】 以虚静观其反复凡有起于虚动起于静故万物虽并动作卒复归于虚静是物之极笃也 夫物芸芸各复归其根 各返其所始也 归根曰静是谓复命复命曰常 归根则静故曰静静则复命故曰复命也复命则得性命之常故曰常也 知常曰明不知常妄作凶 常之为物不偏不彰无皦昧之状【案皦原本讹作敝今据永乐大典校改】温凉之象故曰知常曰明也唯此复乃【案永乐大典无乃字】能包通万物无所不容失此以徃则邪入乎分则物离其分【案原本脱其字今据释文校】故曰不知常则妄作凶也 知常容 无所不包通也",
      "translated_text": "Only because they do not desire fullness\ncan they remain concealed, not newly completed.\nConcealed means covered and veiled.\n\nSixteen\nAttain utmost emptiness,\nabide in steadfast stillness.\nThus, attaining the utmost emptiness of things,\nsteadfastly guarding the true stillness of things.\nThe myriad beings all arise—\nmoving, acting, growing—\nand I observe their return.\nThough all things flourish in motion,\neach ultimately returns to its root.\nReturning to the root is called stillness;\nthis is called recovering life’s mandate.\nRecovering life’s mandate is called constancy.\nKnowing constancy is called clarity;\nnot knowing constancy is reckless action—calamity.\nKnowing constancy is all-embracing;\nall-embracing, one is impartial.\nImpartial, one is kingly;\nkingly, one is of heaven;\nof heaven, one is of the Dao;\nof the Dao, one endures.\nThough the body perish, the Dao does not decay.",
      "overlap_context": "ompelled to describe their appearance:\ncautious, as if crossing a river in winter;\nhesitant, as if fearing the neighbors on all sides;\nsolemn, as if a guest;\nyielding, as ice about to melt;\nsimple, as uncarved wood;\nhollow, as a valley;\nopaque, as muddy water.\n\nWho can make the turbid still and gradually clear?\nWho can make the still gradually come to life?\nThose who preserve this Dao do not desire fullness.\nIt is only because they do not desire fullness\nthat they can remain hidden and complete.",
      "start_char": 4678,
      "end_char": 5029,
      "start_sentence": 153,
      "end_sentence": 169,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.999539852142334,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "容乃公 无所不包通则乃至于荡然公平也 公乃王 荡然公平则乃至于无所不周普也 王乃天 无所不周普则乃至于同乎天也【案也永乐大典作均】 天乃道 与天合德体道大通则乃至于极虚无也 道乃久 穷极虚无得道之常【案道永乐大典作物误】则乃至于不穷极也【案穷原本讹作有今据永乐大典校改】 没身不殆 无之为物水火不能害金石不能残用之于心则虎兕无所投其齿角【案齿永乐大典作爪】兵戈无所容其锋刃何危殆之有乎 十七章【案河上公注本此为淳风章】 太上下知有之【案下永乐大典作不吴澄注亦作不】 太上谓大人也大人在上故曰太上大人在上居无为之事行不言之教万物作焉而不为始故下知有之而已言从上也【案言从上也四字原本误移于信不足焉节注内永乐大典在有之而已下今校改】 其次亲而誉之【案而河上公注本及各本俱作之】 不能以无为居事不言为教立善行施使下得亲而誉之也 其次畏之 不复能以恩仁令物而赖威权也",
      "translated_text": "Capacity becomes impartiality—\nnothing is not embraced and penetrated,\nthus reaching boundless equanimity.\nImpartiality becomes kingliness;\nboundless equanimity reaches nothing not pervaded.\nKingly, one is of heaven;\nnothing not pervaded, one attains harmony with heaven.\nOf heaven, one is of the Dao;\nuniting with heaven’s virtue and embodying the Dao’s great penetration,\none reaches the utmost emptiness.\nOf the Dao, one endures;\nexhausting the utmost emptiness and attaining the Dao’s constancy,\none reaches inexhaustibility.\nThough the body perish, one does not decay.\n\nAs a thing, nothingness—\nwater and fire cannot harm it,\nmetal and stone cannot destroy it.\nApplied to the mind,\ntigers and rhinos have no place to sink their claws,\nweapons have no place to lodge their blades.\nWhat danger could there be?\n\nSeventeen\nIn the highest antiquity, those below knew only of their existence.\nThe highest refers to the great person;\nthe great person is above, thus called \"the highest.\"\nThe great person above dwells in non-action,\npractices the teaching without words,\nand though the myriad beings arise, does not initiate—\nthus those below know only of their existence,\nmerely acknowledging their presence from above.\n\nNext are those whom the people draw near and praise.\nUnable to dwell in non-action or teach without words,\nthey establish goodness and enact virtue,\nso the people draw near and praise them.\n\nNext are those whom the people fear.\nNo longer able to command with benevolence,\nthey rely on authority and power.",
      "overlap_context": "flourish in motion,\neach ultimately returns to its root.\nReturning to the root is called stillness;\nthis is called recovering life’s mandate.\nRecovering life’s mandate is called constancy.\nKnowing constancy is called clarity;\nnot knowing constancy is reckless action—calamity.\nKnowing constancy is all-embracing;\nall-embracing, one is impartial.\nImpartial, one is kingly;\nkingly, one is of heaven;\nof heaven, one is of the Dao;\nof the Dao, one endures.\nThough the body perish, the Dao does not decay.",
      "start_char": 5029,
      "end_char": 5447,
      "start_sentence": 170,
      "end_sentence": 188,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.336508989334106,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "其次侮之【案永乐大典无其次二字】 不能法以正齐民而以智治国下知避之其令不从故曰侮之也 信不足焉有不信焉 夫御体失性则疾病生辅物失真则疵衅作信不足焉则有不信此自然之道也已处不足非智之所齐也【案此节注夫御上有言从上也四字今据永乐大典移于首节注末永乐大典又误以此注移置其次亲而誉之三节注前仍以此本为长】 悠兮其贵言【案悠河上公注本及各本俱作犹】功成事遂百姓皆谓我自然 自然其端兆不可得而见也其意趣不可得而睹也无物可以易其言言必有应故曰悠兮其贵言也居无为之事行不言之教不以形立物【案形永乐大典作刑】故功成事遂而百姓不知其所以然也 十八章【案河上公注本此为俗薄章】 大道废有仁义 失无为之事更以施慧【案施原本作于今据永乐大典校改】立善道进物也 慧智出有大伪【案慧智各本俱作智慧河上公注本作智】 行术用明以察奸伪趣睹形见物知避之故智慧出则大伪生也【案永乐大典脱生也二字】 六亲不和有孝慈【案慈永乐大典作子】国家昏乱有忠臣 甚美之名生于大恶所谓美恶同门六亲父子兄弟夫妇也若六亲自和国家自治则孝慈忠臣不知其所在矣鱼相忘于江湖之道则相濡之德生也十九章【案河上公注本此作还淳章永乐大典此章与上章合为一章】 绝圣弃智民利百倍【案永乐大典此二句在绝仁二句之下】绝仁弃义民复孝慈绝巧弃利盗贼无有此三者以为文不足故令有所属见素抱朴少私寡欲 圣智【案永乐大典圣下有人字】才之善也仁义人之善也巧利用之善也而直云绝文甚不足不令之有所属无以见其指故曰此三者以为文而未足故令人有所属属之于素朴寡欲 二十章【案河上公注本此为异俗章】 绝学无忧唯之与阿相去几何善之与恶相去若何【案若何河上公注本及各本俱作何若】人之所畏不可不畏 下篇为学者日益为道者日损然则学求益所能而进其智者也若将无欲而足何求于益不知而中何求于进夫燕雀有匹【案燕原本作鸷今据永乐大典校改】鸠鸽有仇寒乡之民必知旃裘自然已足益之则忧故续凫之足何异截鹤之胫畏誉而进何异畏刑唯阿美恶相去何若故人之所畏吾亦畏焉未敢恃之以为用也 荒兮其未央哉 叹与俗相返之远也【案永乐大典无此句】",
      "translated_text": "Next are those whom the people scorn.\nUnable to model governance on uprightness to order the people,\nthey rely on cunning to rule the state—\nthus those below know to evade them,\nand their commands go unheeded.\nHence it is said: \"the people scorn them.\"\n\nWhere trust is insufficient, there will be distrust.\nWhen the body’s governance loses its nature, illness arises;\nwhen aid to things loses their truth, flaws and strife emerge.\nWhere trust is insufficient, there will be distrust—\nthis is the natural Dao.\nTo dwell in insufficiency is not something wisdom can order.\n\nHow profound—how it values speech!\nWhen tasks are accomplished and affairs settled,\nthe hundred clans all say, \"We did it naturally.\"\nThe beginnings of spontaneity cannot be seen,\nits intent and inclination cannot be glimpsed.\nNothing can alter its words—\nwords must have response.\nThus it is said: \"How profound—how it values speech!\"\nDwelling in non-action,\npracticing the teaching without words,\nnot establishing things through form—\nthus tasks are accomplished and affairs settled,\nyet the hundred clans do not know how this came to be.\n\nEighteen\nWhen the great Dao is abandoned, there is \"benevolence\" and \"righteousness.\"\nHaving lost the practice of non-action,\nthey instead employ cleverness to establish goodness\nand advance things through the Dao.\nWhen cunning and intellect emerge, great falsity arises.\nThey employ methods and use discernment\nto examine deceit and fraud,\nto observe forms and perceive things,\nto know how to evade—\nthus when cunning and intellect emerge, great falsity is born.\n\nWhen the six relations are not in harmony, there is \"filial piety\" and \"compassion.\"\nWhen the state is in chaos, there are \"loyal ministers.\"\nSuch fine names arise from great evil—\nwhat is called \"beauty\" and \"ugliness\" share the same gate.\nThe six relations are father and son, elder and younger brothers, husband and wife.\nIf the six relations were naturally in harmony and the state naturally well-governed,\nfilial piety, compassion, and loyal ministers would have no place to exist.\nWhen fish forget one another in the rivers and lakes,\nthe virtue of mutual moisture arises.\n\nNineteen\nAbandon sagacity, discard intellect—\nthe people will benefit a hundredfold.\nAbandon benevolence, discard righteousness—\nthe people will return to filial piety and compassion.\nAbandon skill, discard profit—\nthere will be no thieves or robbers.\nThese three, as cultural refinements, are insufficient.\nThus they are made to belong to something:\nmanifest plainness, embrace simplicity,\nreduce self-interest, diminish desires.\n\nSagacity is the excellence of talent;\nbenevolence and righteousness are the excellence of humanity;\nskill and profit are the excellence of utility.\nYet to speak only of abandoning them\nis greatly insufficient—\nnot making them belong to anything\nwould fail to reveal their intent.\nThus it is said: \"These three, as cultural refinements, are insufficient,\nhence they are made to belong to something\"—\nbelonging to plainness, simplicity, few desires.\n\nTwenty\nAbandon learning, and there will be no worries.\nBetween \"yes\" and \"ah\"—how far apart are they?\nBetween \"good\" and \"evil\"—how distant are they?\nWhat others fear, one cannot but fear.\n\nThe latter section speaks of scholars who daily increase,\nwhile those who practice the Dao daily diminish.\nThus learning seeks to increase what one can do\nand advance one’s intellect.\nBut if one were without desires and content,\nwhat would there be to seek in increase?\nIf one were unknowing yet hit the mark,\nwhat would there be to seek in advancement?\nSwallows and sparrows have their mates;\nturtledoves and pigeons have their rivals.\nThe people of cold regions must know felt robes—\nnaturally, they are already sufficient.\nTo increase them would bring worry.\nThus to lengthen a duck’s legs—\nhow is this different from cutting a crane’s shins?\nTo advance out of fear of disgrace—\nhow is this different from fearing punishment?\nBetween \"yes\" and \"ah,\" between \"good\" and \"evil\"—\nhow distant are they?\nThus what others fear, I too fear—\nnot daring to rely on it for use.\n\nVast indeed—it is without end!\nA sigh at how far it diverges from the common.",
      "overlap_context": "tion,\npractices the teaching without words,\nand though the myriad beings arise, does not initiate—\nthus those below know only of their existence,\nmerely acknowledging their presence from above.\n\nNext are those whom the people draw near and praise.\nUnable to dwell in non-action or teach without words,\nthey establish goodness and enact virtue,\nso the people draw near and praise them.\n\nNext are those whom the people fear.\nNo longer able to command with benevolence,\nthey rely on authority and power.",
      "start_char": 5447,
      "end_char": 6336,
      "start_sentence": 189,
      "end_sentence": 208,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.888835668563843,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "众人熙熙如享太牢如春登台【案春登台一本作登春台】 众人迷于美进惑于荣利欲进心竞故熙熙如享太牢如春登台也 我独泊兮其未兆【案永乐大典无独字】如婴儿之未孩 言我廓然无形之可名无兆之可举如婴儿之未能孩也 儽儽兮若无所归【案儽儽河上公注本及各本俱作乘乘】 若无所宅 众人皆有余而我独若遗【案永乐大典无而字】 众人无不有懐有志盈溢胸心故曰皆有余也我独廓然无为无欲若遗失之也 我愚人之心也哉 绝愚之人心无所别析意无所好欲犹然其情不可睹我颓然若此也 沌沌兮 无所别析不可为明【案明原本作也今据永乐大典校改】 俗人昭昭 耀其光也",
      "translated_text": "The multitude bustle and rejoice,\nas if feasting on grand sacrificial oxen,\nas if ascending the terrace in spring.\nThe multitude are deluded by fine advancement,\nbewildered by glory and profit,\ntheir hearts racing with desire to advance—\nthus they bustle and rejoice,\nas if feasting on grand sacrificial oxen,\nas if ascending the terrace in spring.\n\nI alone am tranquil, without sign,\nlike an infant who has not yet learned to smile.\nI am vast and formless, without name,\nwithout sign to be grasped,\nlike an infant who has not yet learned to smile.\n\nListless, as if having nowhere to return,\nas if without a dwelling.\n\nThe multitude all have more than enough,\nwhile I alone seem to have lost something.\nThe multitude all harbor thoughts and ambitions,\nfilling their breasts to overflowing—\nthus they all have more than enough.\nI alone am vast and without action,\nwithout desire, as if having lost something.\n\nOh, the heart of a fool!\nThe heart of one utterly foolish—\nwithout discrimination,\nwithout preferences,\nwithout desires—\nits nature remains unseen.\nI am thus sunken and dull.\n\nMuddled, without discrimination,\nunable to be made bright.\nThe common folk are bright and shining,\nflaunting their radiance.",
      "overlap_context": "f cold regions must know felt robes—\nnaturally, they are already sufficient.\nTo increase them would bring worry.\nThus to lengthen a duck’s legs—\nhow is this different from cutting a crane’s shins?\nTo advance out of fear of disgrace—\nhow is this different from fearing punishment?\nBetween \"yes\" and \"ah,\" between \"good\" and \"evil\"—\nhow distant are they?\nThus what others fear, I too fear—\nnot daring to rely on it for use.\n\nVast indeed—it is without end!\nA sigh at how far it diverges from the common.",
      "start_char": 6336,
      "end_char": 6621,
      "start_sentence": 209,
      "end_sentence": 222,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.767259120941162,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "我独昏昏【案昏昏河上公注本作若昏】俗人察察 分别别析也 我独闷闷澹兮其若海【案澹兮永乐大典作漂乎一本作忽兮】 情不可睹 飂兮若无止【案飂河上公注本作漂永乐大典无下有所字】 无所系絷 众人皆有以 以用也皆欲有所施用也 而我独顽似鄙【案一本无而字】 无所欲为闷闷昏昏若无所识故曰顽且鄙也 我独异于人而贵食母 食母生之本也人者皆弃生民之本贵未饰之华故曰我独欲异于人 二十一章【案河上公注本此为虚心章】 孔德之容惟道是从【案是永乐大典作之】 孔空也惟以空为德然后乃能动作从道 道之为物惟恍惟惚 恍惚无形不系之叹 惚兮恍兮其中有象【案此二句一本在下二句之下】恍兮惚兮其中有物 以无形始物不系成物万物以始以成而不知其所以然故曰恍兮惚兮惚兮恍兮其中有象也 窈兮冥兮其中有精 窈冥深远之叹深远不可得而见然而万物由之其可得见以定其真故曰窈兮冥兮其中有精也 其精甚真其中有信 信信验也物反窈冥则真精之极得万物之性定故曰其精甚真其中有信也 自古及今其名不去 至真之极不可得名无名则是其名也自古及今无不由此而成故曰自古及今其名不去也 以阅众甫 众甫物之始也以无名万物始也 吾何以知众甫之状哉【案状各本俱作然】以此 此上之所云也言吾何以知万物之始于无哉以此知之也 二十二章【案河上公注本此为益谦章】 曲则全 不自见其明【案明原本作名今据永乐大典校改】则全也 枉则直 不自是则其是彰也",
      "translated_text": "I alone am dim and dull—\nthe common folk are sharp and keen,\ndiscerning and analyzing all things.\nI alone am listless and serene,\nvast as the sea,\nits depths unseen.\n\nDrifting, as if without end,\nunbound, without attachment.\nThe multitude all have their uses,\neach desiring to apply their skills.\nYet I alone am stubborn, like one crude—\nwithout ambition, dull and dim,\nas if without understanding.\nThus I am called stubborn and coarse.\n\nI alone differ from others\nand value the nourishment of the Mother.\nThe Mother is the root of life.\nPeople all abandon this root,\nprizing the blossoms of artifice.\nThus I alone desire to differ from others.\n\n**Chapter Twenty-One**\nThe bearing of great virtue\nfollows only the Dao.\nThe Dao as a thing—\nelusive, intangible.\nIntangible, elusive,\nyet within it are images.\nElusive, intangible,\nyet within it are forms.\nSubtle, obscure,\nyet within it is essence.\nThis essence is most real,\nwithin it is truth.\n\nFrom ancient times to the present,\nits name has never departed,\nby which we observe the origin of all things.\nHow do I know the shape of the origin of all things?\nBy this.\n\n**Chapter Twenty-Two**\nTo yield is to be preserved whole.\nNot displaying one’s brilliance\nis to be preserved whole.\nTo bend is to be upright.\nNot asserting one’s rightness\nis to have one’s rightness made clear.",
      "overlap_context": "ltitude all harbor thoughts and ambitions,\nfilling their breasts to overflowing—\nthus they all have more than enough.\nI alone am vast and without action,\nwithout desire, as if having lost something.\n\nOh, the heart of a fool!\nThe heart of one utterly foolish—\nwithout discrimination,\nwithout preferences,\nwithout desires—\nits nature remains unseen.\nI am thus sunken and dull.\n\nMuddled, without discrimination,\nunable to be made bright.\nThe common folk are bright and shining,\nflaunting their radiance.",
      "start_char": 6621,
      "end_char": 7269,
      "start_sentence": 223,
      "end_sentence": 256,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.85770583152771,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "洼则盈 不自伐则其功有也 敝则新 不自矜则其德长也 少则得多则惑 自然之道亦犹树也转多转远其根转少转得其本多则远其真故曰惑也少则得其本故曰得也【案此二句永乐大典作下节注误】 是以圣人抱一为天下式 一少之极也式犹则之也 不自见故明不自是故彰不自伐故有功不自矜故长夫唯不争故天下莫能与之争古之所谓曲则全者岂虚言哉诚全而归之 二十三章【案河上公注本此为虚无章】 希言自然 听之不闻名曰希下章言道之出言淡兮其无味也视之不足见听之不足闻然则无味不足听之言乃是自然之至言也 故飘风不终朝【案河上公注本及各本俱无故字】骤雨不终日孰为此者天地天地尚不能久而况于人乎 言暴疾美兴不长也 故从事于道者道者同于道 从事谓举动从事于道者也道以无形无为成济万物故从事于道者以无为为君不言为教绵绵若存而物得其真与道同体故曰同于道 德者同于德 得少也少则得故曰得也行得则与得同体故曰同于得也 失者同于失 失累多也累多则失故曰失也行失则与失同体故曰同于失也 同于道者道亦乐得之【案永乐大典无乐字下二句同】同于德者德亦乐得之同于失者失亦乐得之 言随行其所故同而应之 信不足焉有不信焉 忠信不足于下焉有不信焉【案焉永乐大典作也】 二十四章【案河上公注本此为苦恩章】 企者不立【案企河上公注本及各本俱作跂】 物尚进则失安故曰企者不立 跨者不行自见者不明自是者不彰自伐者无功自矜者不长其在道也【案在河上公注本及各本俱作于】曰余食赘行其唯于道而论之若却至之行盛馔之余也本虽美更可秽也本虽有功而自伐之故更为疣赘者也 物或恶之故有道者不处【案处下河上公注本及各本俱有也字】 二十五章【案河上公注本此为象元章】 有物混成先天地生 混然不可得而知而万物由之以成故曰混成也不知其谁之子故先天地生 寂兮寥兮独立不改【案立下河上公注本及各本俱有而字】 寂寞无形体也无物之匹故曰独立也返化终始不失其常故曰不改也 周行而不殆可以为天下母 周行无所不至而免殆【案免永乐大典作危】能生全大形也故可以为天下母也 吾不知其名 名以定形混成无形不可得而定故曰不知其名也 字之曰道 夫名以定形字以称可言道取于无物而不由也是混成之中可言之称最大也 强为之名曰大 吾所以字之曰道者取其可言之称最大也责其字定之所由则系于大大有系则必有分有分则失其极矣故曰强为之名曰大 大曰逝 逝行也不守一大体而已周行无所不至故曰逝也 逝曰远远曰反 远极也周无所不穷极不偏于一逝故曰远也不随于所适其体独立故曰反也 故道大天大地大王亦大 天地之性人为贵而王是人之主也虽不职大亦复为大与三匹故曰王亦大也 域中有四大 四大道天地王也凡物有称有名则非其极也言道则有所由有所由然后谓之为道然则是道称中之大也不若无称之大也无称不可得而名曰域也道天地王皆在乎无称之内故曰域中有四大者也 而王居其一焉 处人主之大也 人法地地法天天法道道法自然 法谓法则也人不违地乃得全安法地也地不违天乃得全载法天也天不违道乃得全覆法道也道不违自然乃得其性法自然者在方而法方在圆而法圆于自然无所违也自然者无称之言穷极之辞也用智不及无知而形魄不及精象精象不及无形有仪不及无仪故转相法也道顺自然天故资焉天法于道地故则焉地法于天人故象焉所以为主其一之者主也",
      "translated_text": "Hollowed, it becomes full;\nnot boasting of oneself, one’s merit endures.\nWorn, it becomes new;\nnot exalting oneself, one’s virtue grows.\nTo have little is to gain,\nto have much is to be deluded.\nThe Dao of nature is like a tree:\nthe more it branches, the farther from its root;\nthe less it branches, the closer to its source.\nMuch strays from the real—hence delusion;\nlittle attains the source—hence gain.\n\nThus the sage embraces the One as the model for all under heaven.\nThe One is the utmost of few.\nModel means standard.\nNot displaying oneself, one is luminous;\nnot asserting oneself, one is distinguished;\nnot boasting, one’s merit endures;\nnot exalting oneself, one’s virtue grows.\nOnly by not contending does none under heaven contend with one.\nWhat the ancients called “to yield is to be preserved whole”—\nwas this an empty saying?\nTruly, wholeness is its return.\n\n**Chapter Twenty-Three**\nRare words are natural.\nHeard yet unheard—this is called rare.\nThe next chapter speaks of the Dao’s issuing in words:\nbland, as if without flavor.\nSeen yet insufficient to behold,\nheard yet insufficient to hear—\nsuch flavorless, inaudible words\nare the utmost of natural speech.\n\nThus whirlwinds do not last the morning,\ntorrential rains do not last the day.\nWhat brings these about? Heaven and earth.\nIf even heaven and earth cannot endure long,\nhow much less can humans?\nThus those who act with violence and haste\ndo not last.\n\nTherefore, those who align with the Dao\nare one with the Dao.\n“Align” means to act in accord with the Dao.\nThe Dao, through formlessness and non-action,\naccomplishes and sustains the myriad things.\nThus those who align with the Dao\ntake non-action as their lord,\nsilence as their teaching.\nSubtle yet ever-present,\nthings attain their reality—\none with the Dao in body.\nHence, “one with the Dao.”\n\nThose of virtue are one with virtue.\nTo attain little is to gain—\nlittle is gain, hence “gain.”\nActing with gain, one is one in body with gain,\nhence “one with virtue.”\n\nThose who lose are one with loss.\nLoss is the burden of much—\nmuch burdens, hence loss.\nActing with loss, one is one in body with loss,\nhence “one with loss.”\n\nThose one with the Dao—the Dao delights in attaining them.\nThose one with virtue—virtue delights in attaining them.\nThose one with loss—loss delights in attaining them.\nThis means: follow their actions,\nand what they align with responds.\nWhere trust is insufficient,\nthere is distrust.\nLoyalty and trust are insufficient below—\nhow can there be no distrust?\n\n**Chapter Twenty-Four**\nThose who stand on tiptoe do not stand firm.\nThings, when they advance, lose their stability—\nhence, “those who stand on tiptoe do not stand firm.”\nThose who stride do not walk.\nThose who display themselves are not luminous.\nThose who assert themselves are not distinguished.\nThose who boast have no merit.\nThose who exalt themselves do not grow.\nIn the Dao, these are called\n“leftover food and parasitic growth.”\nSuch things are abhorred by all—\nthus those with the Dao do not dwell in them.\n\n**Chapter Twenty-Five**\nThere is a thing, chaotic yet complete,\nborn before heaven and earth.\nSilent, empty,\nit stands alone and does not change.\nIt revolves without end,\nand may be called the mother of all under heaven.\nI do not know its name—\nnaming defines form.\nChaotic and complete, without form,\nit cannot be defined—\nhence, “I do not know its name.”\nI style it “Dao.”\n“Style” means to name what can be spoken.\nThe Dao is taken from nothingness,\nnot derived from being—\nwithin the chaotic and complete,\nthe greatest name that can be spoken.\nI force a name upon it: “great.”\nGreat means passing.\nPassing means journeying—\nit does not abide in one form,\nbut revolves without end.\nHence, “great means passing.”\nPassing means far-reaching;\nfar-reaching means returning.\nThus the Dao is great,\nheaven is great,\nearth is great,\nand the king is also great.\nWithin the realm, there are four greats—\nthe Dao, heaven, earth, and the king.\nThe king occupies one of them.\n\nWhere things have names and appellations,\nthey are not ultimate.\nTo speak of the Dao is to speak of what has a source—\nhaving a source, it is then called the Dao.\nYet this greatness of the Dao’s name\ndoes not compare to nameless greatness.\nNameless—it cannot be called a realm,\nyet the Dao, heaven, earth, and king\nall reside within namelessness.\nHence, “within the realm, there are four greats.”\n\nThe king is the greatest of human rulers.\nHumans model themselves on earth,\nearth models itself on heaven,\nheaven models itself on the Dao,\nthe Dao models itself on nature.\n“Model” means to follow.\nHumans do not violate earth—\nthus they attain wholeness and peace, following earth.\nEarth does not violate heaven—\nthus it attains fullness and bearing, following heaven.\nHeaven does not violate the Dao—\nthus it attains fullness and covering, following the Dao.\nThe Dao does not violate nature—\nthus it attains its essence, following nature.\nNature is the word for the nameless,\nthe term for the ultimate.\nWisdom does not reach it,\nnor does knowledge;\nform and spirit do not reach it,\nnor do essence and image;\nappearance and measure do not reach it,\nnor do form and formlessness.\nThus they follow one another in modeling:\nthe Dao follows nature,\nheaven follows the Dao,\nearth follows heaven,\nhumans follow earth.\nThe One they follow is the lord.",
      "overlap_context": "\nyet within it are forms.\nSubtle, obscure,\nyet within it is essence.\nThis essence is most real,\nwithin it is truth.\n\nFrom ancient times to the present,\nits name has never departed,\nby which we observe the origin of all things.\nHow do I know the shape of the origin of all things?\nBy this.\n\n**Chapter Twenty-Two**\nTo yield is to be preserved whole.\nNot displaying one’s brilliance\nis to be preserved whole.\nTo bend is to be upright.\nNot asserting one’s rightness\nis to have one’s rightness made clear.",
      "start_char": 7269,
      "end_char": 8688,
      "start_sentence": 257,
      "end_sentence": 310,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.343018531799316,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "二十六章【案河上公注本此为重德章】 重为轻根静为躁君 凡物轻不能载重小不能镇大不行者使行不动者制动是以重必为轻根静必为躁君也 是以圣人终日行不离辎重 以重为本故不离 虽有荣观燕处超然 不以经心也【案永乐大典脱此句】 奈何万乘之王而以身轻天下轻则失本【案本河上公注本作臣永乐大典作根】躁则失君 轻不镇重也失本为丧身也失君为失君位也【案为永乐大典作谓古通用】 二十七章【案河上公注本此为巧用章】 善行无辙迹 顺自然而行不造不始故物得至而无辙迹也 善言无瑕谪 顺物之性不别不析故无瑕谪可得其门也 善数不用筹策【案数河上公注本作计】 因物之数不假形也 善闭无关楗【案楗原本作键今据释文校改注同】而不可开善结无绳约而不可解 因物自然【案此句原本作自物因然今据永乐大典校改】不设不施故不用关楗绳约而不可开解也此五者皆言不造不施因物之性不以形制物也 是以圣人常善救人故无弃人 圣人不立形名以检于物不造进向以殊弃不肖辅万物之自然而不为始故曰无弃人也不尚贤能则民不争不贵难得之货则民不为盗不见可欲则民心不乱常使民心无欲无惑则无弃人矣 常善救物故无弃物是谓袭明故善人者【案永乐大典无者字】不善人之师 举善以师不善故谓之师矣 不善人者【案永乐大典无者字】善人之资 资取也善人以善齐不善以善弃不善也故不善人善人之所取也 不贵其师不爱其资虽智大迷 虽有其智自任其智不因物于其道必失故曰虽智大迷 是谓要妙 二十八章【案河上公注本此为反朴章】 知其雄守其雌为天下溪为天下溪常德不离复归于婴儿【案永乐大典此节在复归于无极之后据注仍宜在前】 雄先之属雌后之属也知为天下之先也必后也是以圣人后其身而身先也溪不求物而物自归之婴儿不用智而合自然之智 知其白守其黑为天下式 式模则也",
      "translated_text": "**Chapter 26**\n*(According to the He Shang Gong commentary, this is the \"Virtue of Weight\" chapter)*\n\nWeight is the root of lightness;\nstillness is the lord of restlessness.\nAll things: the light cannot bear the heavy,\nthe small cannot govern the great.\nWhat does not move enables movement;\nwhat does not act controls action.\nThus weight must be the root of lightness,\nstillness must be the lord of restlessness.\n\nTherefore the sage travels all day\nyet never parts from the heavy baggage—\ntaking weight as the foundation,\nhe does not depart from it.\nThough he may dwell in splendor,\nhe remains detached,\nnot allowing it to occupy his mind.\n\nHow could a ruler of ten thousand chariots\ntreat his person lightly before the world?\nLightness loses the root;\nrestlessness loses the lord.\nLightness cannot govern weight—\nto lose the root is to forfeit the self;\nto lose the lord is to forfeit the throne.\n\n---\n\n**Chapter 27**\n*(According to the He Shang Gong commentary, this is the \"Skillful Use\" chapter)*\n\nSkillful movement leaves no tracks—\nfollowing nature’s course, neither contriving nor initiating,\nthings arrive without trace.\n\nSkillful speech bears no flaw—\naccord with things’ nature, neither dividing nor analyzing,\nthus no flaw can be found.\n\nSkillful reckoning requires no tally—\nrelying on things’ inherent number, no form is needed.\n\nSkillful closure needs no bolt\nyet cannot be opened;\nskillful binding needs no cord\nyet cannot be undone.\nThis follows things’ natural state,\nneither contriving nor imposing—\nthus no bolt or cord is used,\nyet they cannot be opened or undone.\nThese five all speak of non-contrivance, non-imposition,\nfollowing things’ nature without shaping them by form.\n\nTherefore the sage constantly excels at saving people,\nand so leaves none abandoned.\nThe sage does not establish forms or names to restrain things,\nnor contrive advancement to distinguish the worthy from the unworthy.\nHe aids the self-so of the myriad things without initiating—\nthus he leaves none abandoned.\nIf he does not esteem ability, the people do not contend;\nif he does not prize rare goods, the people do not steal;\nif he does not display what can be desired, the people’s hearts are not disordered.\nConstantly keeping the people’s hearts free of desire and confusion,\nhe leaves none abandoned.\n\nConstantly excelling at saving things,\nhe leaves nothing abandoned—\nthis is called inheriting clarity.\nThus the good person is the teacher of the not-good—\nelevating goodness to instruct the not-good,\nhence called their teacher.\nThe not-good person is the resource of the good—\na resource to be taken.\nThe good person uses goodness to align the not-good,\nto discard the not-good with goodness—\nthus the not-good is what the good takes.\nIf one does not value one’s teacher\nor cherish one’s resource,\nthough wise, one is greatly deluded.\nThough possessing wisdom, one relies on one’s own intelligence,\nnot following things in their Way—\nthis must lead to loss.\nThus it is called the essential mystery.\n\n---\n\n**Chapter 28**\n*(According to the He Shang Gong commentary, this is the \"Returning to Simplicity\" chapter)*\n\nKnow the masculine, keep to the feminine—\nbecome the world’s valley.\nAs the world’s valley, constant virtue does not depart,\nreturning to the state of the infant.\n\nKnow the white, keep to the black—\nbecome the world’s model.\nAs the world’s model, constant virtue does not err,\nreturning to the boundless.\n\nThe masculine belongs to the prior;\nthe feminine belongs to the posterior.\nTo know the world’s priority\nyet remain posterior—\nthus the sage places himself last yet comes first.\nThe valley does not seek things,\nyet things naturally gather to it.\nThe infant does not employ wisdom,\nyet accords with nature’s intelligence.\n\nKnow the white, keep to the black—\nbecome the world’s standard.\nAs the world’s standard, constant virtue does not deviate,\nreturning to simplicity.",
      "overlap_context": "lowing the Dao.\nThe Dao does not violate nature—\nthus it attains its essence, following nature.\nNature is the word for the nameless,\nthe term for the ultimate.\nWisdom does not reach it,\nnor does knowledge;\nform and spirit do not reach it,\nnor do essence and image;\nappearance and measure do not reach it,\nnor do form and formlessness.\nThus they follow one another in modeling:\nthe Dao follows nature,\nheaven follows the Dao,\nearth follows heaven,\nhumans follow earth.\nThe One they follow is the lord.",
      "start_char": 8688,
      "end_char": 9473,
      "start_sentence": 311,
      "end_sentence": 342,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.149181842803955,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "为天下式常德不忒 忒差也 复归于无极 不可穷也 知其荣守其辱为天下谷为天下谷常德乃足复归于朴 此三者言常反终后乃德全其所处也下章云反者道之动也功不可取常处其母也 朴散则为器圣人用之则为官长 朴真也真散则百行出殊生若器也圣人因其分散故为之立官长以善为师不善为资移风易俗复使归于一也 故大制不割 大制者以天下之心为心故无割也 二十九章【案河上公注本此为无为章】 将欲取天下而为之吾见其不得已天下神器【案永乐大典器下有也字】 神无形无方也器合成也无形以合故谓之神器也 不可为也为者败之执者失之 万物以自然为性故可因而不可为也可通而不可执也物有常性而造为之故必败也物有徃来而执之故必失矣 故物或行或随或歔或吹【案歔河上公注本作呴】或强或羸或挫或隳【案挫河上公注本作载】是以圣人去甚去奢去泰 凡此诸或言物事逆顺反覆不施为执割也圣人达自然之至畅万物之情故因而不为顺而不施除其所以迷去其所以惑故心不乱而物性自得之也三十章【案河上公注本此为俭武章】 以道佐人主者不以兵强天下 以道佐人主尚不可以兵强于天下况人主躬于道者乎 其事好还 为始者务欲立功生事而有道者务欲还反无为故云其事好还也 师之所处荆棘生焉大军之后必有凶年 言师凶害之物也无有所济必有所伤贼害人民残荒田亩故曰荆棘生焉【案永乐大典焉作也】 善有果而已【案有永乐大典作者而已下有矣字】不敢以取强 果犹济也言善用师者趣以济难而已矣不以兵力取强于天下也【案也永乐大典作矣】 果而勿矜果而勿伐果而勿骄 吾不以师道为尚不得已而用何矜骄之有也 果而不得已果而勿强 言用兵虽趣功果济难然时故不得已当复用者但当以除暴乱不遂用果以为强也 物壮则老是谓不道不道早已【案不一本作非】 壮武力暴兴喻以兵强于天下者也飘风不终朝骤雨不终日故暴兴必不道早已也 三十一章【案河上公注本此为偃武章】 夫佳兵者【案一本无者字】不祥之器【案永乐大典无之器二字】物或恶之故有道者不处【案永乐大典处下有也 字】君子居则贵左用兵则贵右兵者不祥之器【案自此句至言以防礼处之似有注语杂入但河上公注本及各本俱作经文今仍之】非君子之器不得已而用之恬淡为上【案恬淡河上公注本作恬惔一本作恬澹又作恬然】胜而不美而美之者【案永乐大典无而字】是乐杀人【案永乐大典人下有也 字】夫乐杀人者【案永乐大典无夫字】则不可以得志于天下矣 【案永乐大典无则字】吉事尚左凶事尚右偏将军居左【案永乐大典居作处下句同】上将军居右言以丧礼处之【案永乐大典无此句】杀人之众以哀悲泣之【案哀悲河上公注本及各本俱作悲哀】战胜以丧礼处之 三十二章【案河上公注本此为圣德章】 道常无名朴虽小天下莫能臣也【案河上公注本作天下莫敢臣前】侯王若能守之【案侯王释文云梁武作王侯】万物将自宾 道无形不系常不可名以无名为常故曰道常无名也朴之为物以无为心也亦无名【一本或作朴之为物无心故无名】故将得道莫若守朴夫智者可以能臣也勇者可以武使也巧者可以事役也力者可以重任也朴之为物愦然不偏近于无有故曰莫能臣也抱朴无为不以物累其真不以欲害其神则物自宾而道自得也",
      "translated_text": "As the world’s standard, constant virtue does not err—\n\"err\" meaning deviation—\nreturning to the boundless,\nwhich cannot be exhausted.\n\nKnow glory, keep to disgrace—\nbecome the world’s valley.\nAs the world’s valley, constant virtue is fulfilled,\nreturning to simplicity.\n\nThese three speak of the constant, the returning, the ultimate;\nonly afterward is virtue complete in its dwelling.\nThe next chapter says: \"Reversion is the movement of the Dao.\"\nAchievement cannot be seized; one must abide in the Mother.\n\nWhen simplicity scatters, it becomes vessels;\nthe sage employs it to become a leader.\nSimplicity is the real;\nwhen the real scatters, the hundred practices emerge,\ndifferentiated as vessels.\nThe sage, following their dispersion,\nestablishes leaders,\nusing the good as teachers and the ungood as resources,\ntransforming customs to restore unity.\n\nThus, great governance does not sever.\nGreat governance takes the world’s heart as its heart,\nhence it does not sever.\n\n*(Chapter 29)*\nThose who would take the world and act upon it—\nI see they will not succeed.\nThe world is a sacred vessel,\nshapeless and boundless,\na confluence of the formless—\nthus called the sacred vessel.\nIt cannot be acted upon;\nthose who act upon it ruin it,\nthose who grasp it lose it.\n\nAll things take naturalness as their nature,\nthus they may be followed but not acted upon,\nguided but not grasped.\nThings have constant natures;\nto impose upon them is to court failure.\nThings have their goings and comings;\nto grasp them is to court loss.\n\nThus, some things advance, some follow,\nsome sigh, some blow,\nsome are strong, some weak,\nsome are established, some overthrown.\nTherefore, the sage eliminates excess, extravagance, and extravagance.\n\nAll these \"some\" speak of the world’s affairs—\nreversal and recurrence, without action or grasping.\nThe sage, penetrating the utmost flow of naturalness\nand the conditions of the myriad things,\nfollows without acting,\naccords without imposing,\nremoves what causes delusion,\ndispels what causes confusion,\nso the heart is not disordered and the nature of things is naturally attained.\n\n*(Chapter 30)*\nThose who assist a ruler with the Dao\ndo not use arms to strengthen the world.\nUsing the Dao to assist a ruler,\none should not use arms to strengthen the world—\nhow much less should a ruler who embodies the Dao?\n\nSuch affairs tend to return.\nThose who initiate seek to establish merit and create affairs,\nwhile those with the Dao seek to return to non-action—\nthus it is said, \"Such affairs tend to return.\"\n\nWhere armies dwell, thorns and brambles grow;\nafter great wars, years of famine follow.\nThis speaks of armies as instruments of harm;\nwhere there is no benefit, there must be injury,\ndevastating the people and laying waste to fields—\nthus it is said, \"thorns and brambles grow.\"\n\nThe good achieve results and no more;\nthey dare not take strength by force.\n\"Results\" mean relief—\nthose who use armies well act to relieve difficulty,\nnot to take strength by force in the world.\n\nAchieve results but do not boast,\nachieve results but do not praise,\nachieve results but do not be arrogant.\nI do not exalt the way of armies;\nif compelled to use them, what boasting or arrogance is there?\n\nAchieve results but do not force,\nachieve results but do not overreach.\nThough using arms may achieve results and relieve difficulty,\nwhen circumstances compel their use,\none should only employ them to eliminate violence and disorder,\nnot to persist in force for strength’s sake.\n\nThings in their prime age;\nthis is called \"not the Dao.\"\nWhat is not the Dao ends early.\n\nMight and force rise violently—\nthis is like using arms to strengthen the world.\nWhirlwinds do not last the morning;\ntorrential rains do not last the day.\nThus, violent rise must not be the Dao and ends early.\n\n*(Chapter 31)*\nFine weapons are\ninauspicious instruments;\nsome things detest them,\nthus those with the Dao do not dwell with them.\n\nThe noble person at home values the left;\nin war, they value the right.\nWeapons are inauspicious instruments,\nnot the instruments of the noble person.\nCompelled to use them, they employ them with tranquility as the highest.\nVictory is not deemed beautiful;\nthose who deem it beautiful\ndelight in killing.\nThose who delight in killing\ncannot realize their will in the world.\n\nAuspicious affairs value the left;\ninauspicious affairs value the right.\nThe deputy general stands on the left;\nthe chief general stands on the right—\nthis speaks of placing them with mourning rites.\nWhen the slain are many,\nmourn them with sorrowful weeping.\nWhen victorious in battle,\nplace them with mourning rites.\n\n*(Chapter 32)*\nThe Dao is eternally nameless.\nThough simplicity is small,\nnone in the world can subdue it.\nIf lords and kings can guard it,\nthe myriad things will naturally submit.\n\nThe Dao is formless and unbound,\nconstant yet unnameable—\nthus it is said, \"The Dao is eternally nameless.\"\nSimplicity as a thing has no mind,\nhence it is nameless.\nThus, to attain the Dao, nothing surpasses guarding simplicity.\nThe wise can be employed as ministers,\nthe brave can be used for military service,\nthe skillful can be tasked with labor,\nthe strong can bear heavy burdens.\nSimplicity as a thing is impartial and near to nothingness—\nthus it is said, \"none can subdue it.\"\nEmbracing simplicity, acting without contrivance,\nnot burdening one’s reality with things,\nnot harming one’s spirit with desires—\nthen things naturally submit, and the Dao is naturally attained.",
      "overlap_context": "r,\nreturning to the boundless.\n\nThe masculine belongs to the prior;\nthe feminine belongs to the posterior.\nTo know the world’s priority\nyet remain posterior—\nthus the sage places himself last yet comes first.\nThe valley does not seek things,\nyet things naturally gather to it.\nThe infant does not employ wisdom,\nyet accords with nature’s intelligence.\n\nKnow the white, keep to the black—\nbecome the world’s standard.\nAs the world’s standard, constant virtue does not deviate,\nreturning to simplicity.",
      "start_char": 9473,
      "end_char": 10790,
      "start_sentence": 343,
      "end_sentence": 381,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.558809518814087,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "天地相合以降甘露民莫之令而自均【案民永乐大典作人】言天地相合则甘露不求而自降我守其真性无为则民不令而自均也 始制有名名亦既有夫亦将知止知止可以不殆【案河上公注本及各本俱作所】 始制谓朴散始为官长之时也始制官长不可不立名分以定尊卑故始制有名也过此以徃将争锥刀之末故曰名亦既有夫亦将知止也遂任名以号物则失治之母也故知止所以不殆也 譬道之在天下犹川谷之于江海 川谷之求江与海非江海召之不召不求而自归者世行道于天下者不令而自均不求而自得故曰犹川谷之与江海也 三十三章【案河上公注本此为辨德章】 知人者智自知者明 知人者智而已矣未若自知者【案永乐大典无未若二字】超智之上也 胜人者有力自胜者强 胜人者有力而已矣未若自胜者无物以损其力用其智于人未若用其智于己也用其力于人未若用其力于己也明用于己则物无避焉力用于己则物无改焉【案永乐大典无力用于己则物无改焉九字】 知足者富 知足自不失故富也",
      "translated_text": "Heaven and earth unite to descend sweet dew—\nthe people require no command, yet all is naturally balanced.\nThis speaks of how when heaven and earth unite, sweet dew descends without being summoned.\nIf I guard my true nature and act without contrivance,\nthe people require no command, yet all is naturally balanced.\n\nThe beginning of governance establishes names—\nonce names exist, one must also know when to stop.\nKnowing when to stop ensures one does not endanger oneself.\nThe \"beginning of governance\" refers to when simplicity disperses and officials are first appointed.\nAt the outset of appointing officials, one cannot but establish names and ranks to define hierarchy.\nBeyond this, contention will arise over the smallest things—\nthus it is said, \"once names exist, one must also know when to stop.\"\nIf names are employed to designate things, the mother of governance is lost—\nhence, knowing when to stop ensures one does not endanger oneself.\n\nThe Dao’s presence in the world\nis like rivers and valleys in relation to the Yangtze and the sea.\nRivers and valleys do not seek the Yangtze or the sea—\nthe Yangtze and sea do not summon them, yet they return of their own accord.\nThose who practice the Dao in the world do not command, yet all is naturally balanced;\nthey do not seek, yet naturally attain—\nthus it is said, \"like rivers and valleys in relation to the Yangtze and the sea.\"\n\n**Chapter Thirty-Three**\n\nOne who knows others is wise;\none who knows oneself is enlightened.\nOne who knows others is merely wise—\nhow much greater is one who knows oneself, rising above wisdom.\n\nOne who conquers others is strong;\none who conquers oneself is mighty.\nOne who conquers others is merely strong—\nhow much greater is one who conquers oneself, for nothing can diminish their strength.\nEmploying one’s wisdom on others does not compare to employing it on oneself;\nemploying one’s strength on others does not compare to employing it on oneself.\nWhen enlightenment is applied to oneself, nothing can evade it;\nwhen strength is applied to oneself, nothing can alter it.\n\nOne who knows contentment is rich—\nknowing contentment, one does not lose what they have, hence is rich.",
      "overlap_context": "n the Dao, nothing surpasses guarding simplicity.\nThe wise can be employed as ministers,\nthe brave can be used for military service,\nthe skillful can be tasked with labor,\nthe strong can bear heavy burdens.\nSimplicity as a thing is impartial and near to nothingness—\nthus it is said, \"none can subdue it.\"\nEmbracing simplicity, acting without contrivance,\nnot burdening one’s reality with things,\nnot harming one’s spirit with desires—\nthen things naturally submit, and the Dao is naturally attained.",
      "start_char": 10790,
      "end_char": 11203,
      "start_sentence": 382,
      "end_sentence": 393,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.906355857849121,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "强行者有志 勤能行之其志必获故曰强行者有志矣 不失其所者久 以明自察量力而行不失其所必获久长矣 死而不亡者寿 虽死而以为生之道不亡乃得全其寿身没而道犹存况身存而道不卒乎 三十四章【案河上公注本此为任成章】 大道泛兮其可左右 言道泛滥无所不适可左右上下周旋而用则无所不至也 万物恃之而生而不辞功成不名有【案永乐大典而生作以生不名有作而不居】衣养万物而不为主【案衣养河上公注本作爱养永乐大典作衣】常无欲可名于小【案永乐大典无常字小下有矣字】 万物皆由道而生既生而不知其所由【案所由永乐大典作由所误】故天下常无欲之时万物各得其所【案原本脱其字今据永乐大典校】若道无施于物故名于小矣 万物归焉而不为主【案为永乐大典作知】可名为大【案永乐大典为作于大下有矣字又有是以圣人能成其大也九字】 万物皆归之以生而力使不知其所由此不为小故复可名于大矣 以其终不自为大【案河上公注本作是以圣人终不为大永乐大典作以其不自大】故能成其大 为大于其细图难于其易 三十五章【案河上公注本此为仁德章】 执大象天下徃 大象天象之母也不寒不温不凉故能包统万物无所犯伤主若执之则天下徃也 徃而不害安平太【案平太河上公注本作太平永乐大典作平泰】 无形无识不偏不彰故万物得徃而不害妨也 乐与饵过客止道之出口淡乎其无味视之不足见听之不足闻用之不足既【案足河上公注本及各本俱作可】 言道之深大人闻道之言乃更不如【案如原本讹知今据永乐大典校改】乐与饵应时感悦人心也乐与饵则能令过客止而道之出言淡然无味视之不足见则不足以悦其目听之不足闻则不足以娱其耳若无所中然乃用之不可穷极也 三十六章【案河上公注本此为防明章】 将欲歙之必固张之将欲弱之必固强之将欲废之必固兴之将欲夺之必固与之是谓防明 将欲除强梁去暴乱当以此四者因物之性令其自戮不假刑为大以除将物也故曰防明也足其张令之足而又求其张则众所歙也与其张之不足而改其求张者愈益而已反危 柔弱胜刚强【案永乐大典作柔胜刚弱胜强】鱼不可脱于渊国之利器不可以示人 利器利国之器也唯因物之性不假刑以理物器不可睹而物各得其所【案所永乐大典作性】则国之利器也示人者任刑也刑以利国则失矣鱼脱于渊则必见失矣利国器而立刑以示人亦必失也 三十七章【案河上公注本此为为政章】 道常无为",
      "translated_text": "**Chapter Thirty-Three (continued)**\n\nOne who acts with unyielding resolve possesses true purpose.\nThrough diligent practice, their purpose is surely attained—\nthus it is said: one who acts with unyielding resolve possesses true purpose.\nOne who does not lose their proper place endures.\nBy clearly examining oneself, measuring one’s strength, and acting without losing their proper place,\nthey will surely attain enduring longevity.\nOne who dies yet does not perish enjoys true longevity.\nThough the body dies, if the Dao of life does not perish, one preserves their full lifespan.\nWhen the body is gone yet the Dao still remains,\nhow much more so when the body endures and the Dao does not cease?\n\n**Chapter Thirty-Four**\n\nThe great Dao flows freely, available to left and right.\nThis means the Dao overflows without restriction, adapting to all directions—\nwhether left or right, above or below—\nits application knows no bounds.\nAll things depend on it for life, yet it does not refuse;\nits work is accomplished, yet it claims no possession.\nIt clothes and nourishes the myriad things yet does not act as their master—\never without desire, it may be called subtle.\nThe myriad things arise from the Dao,\nyet once born, they know not whence they came.\nThus, when the world remains free of desire,\nall things attain their proper place.\nIf the Dao made no contribution to things,\nit would be called small.\nYet all things return to it without its acting as master—\nit may be called great.\nSince it does not claim greatness for itself,\nit fulfills its greatness.\nPlanning greatness begins with the small;\ndifficult tasks begin with the easy.\n\n**Chapter Thirty-Five**\n\nHold fast to the great image, and all under heaven will come.\nThe great image is the mother of all celestial phenomena—\nneither cold nor warm, neither cool nor hot—\nthus it embraces and unites the myriad things without harm.\nIf one grasps it, all under heaven will come.\nThey come without harm, dwelling in perfect peace.\nMusic and delicacies make passing guests pause,\nbut the Dao’s utterance is bland, without flavor—\nseen, it is not enough to please the eye;\nheard, it is not enough to delight the ear.\nYet in its use, it is inexhaustible.\nThe profound words of the Dao—\nwhen the great hear them, they seem even less than music and delicacies,\nwhich stir the heart in their season.\nMusic and delicacies may halt a traveler,\nbut the Dao’s utterance is insipid, without taste—\nseen, it does not satisfy the eye;\nheard, it does not gratify the ear.\nYet in its use, it cannot be exhausted.\n\n**Chapter Thirty-Six**\n\nTo intend to contract, first surely expand;\nto intend to weaken, first surely strengthen;\nto intend to abolish, first surely exalt;\nto intend to seize, first surely give—\nthis is called subtle illumination.\nTo remove the strong and violent, to eliminate disorder,\none must employ these four principles,\nfollowing the nature of things so they destroy themselves\nwithout resorting to punishment—\nthis is the great means of removal.\nThus it is called subtle illumination.\nIf one fully expands yet still seeks expansion,\nthe multitude will contract.\nBetter to abandon the pursuit of expansion when it is insufficient,\nfor excessive striving only leads to peril.\nThe soft overcomes the hard;\nthe weak overcomes the strong.\nFish must not leave the depths;\nthe state’s sharp instruments must not be shown to others.\nSharp instruments are those that benefit the state—\nonly by following the nature of things, without resorting to punishment,\ncan each thing attain its proper place.\nThus they are the state’s sharp instruments.\nTo display them is to rely on punishment;\nif punishment is used to benefit the state, it will fail.\nWhen fish leave the depths, they are surely lost;\nwhen the state’s sharp instruments are displayed, they too will be lost.\n\n**Chapter Thirty-Seven**\n\nThe Dao ever acts through non-action.",
      "overlap_context": "s others is merely strong—\nhow much greater is one who conquers oneself, for nothing can diminish their strength.\nEmploying one’s wisdom on others does not compare to employing it on oneself;\nemploying one’s strength on others does not compare to employing it on oneself.\nWhen enlightenment is applied to oneself, nothing can evade it;\nwhen strength is applied to oneself, nothing can alter it.\n\nOne who knows contentment is rich—\nknowing contentment, one does not lose what they have, hence is rich.",
      "start_char": 11203,
      "end_char": 12191,
      "start_sentence": 394,
      "end_sentence": 422,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.227415800094604,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "顺自然也 而无不为 万物无不由为以治以成之也 侯王若能守之【案永乐大典无之字】万物将自化化而欲作吾将镇之以无名之朴 化而欲作作欲成也吾将镇之无名之朴不为主也 无名之朴夫亦将无欲【案河上公注本及各本俱无夫字无欲作不欲】 无欲竞也 不欲以静天下将自定 老子道德经上篇 <子部,道家类,老子道德经> 钦定四库全书 老子道德经下篇 魏　王弼　注 三十八章【案河上公注本此为论德章永乐大典此章以下缺注张之象所录王注脱误甚多今无别本可校姑仍旧文】 上德不德是以有德下德不失德是以无德上德无为而无以为下德为之而有以为上仁为之而无以为上义为之而有以为上礼为之而莫之应则攘臂而扔之【案扔各本俱作仍】故失道而后德失德而后仁失仁而后义失义而后礼夫礼者忠信之薄而乱之首前识者道之华而愚之始是以大丈夫处其厚不居其薄处其实不居其华【案焦竑云古本四句并作处】故去彼取此 德者得也 常得而无丧利而无害故以德为名焉",
      "translated_text": "By following nature, yet nothing is left undone.\nAll things arise from this acting to be governed and perfected.\nShould lords and kings abide by it,\nthe myriad things will transform of themselves.\nWhen transformation stirs desire to arise,\nI shall still it with the Uncarved Block of nameless simplicity.\nWhen transformation stirs desire to arise—\nwhen desire seeks completion—\nI shall still it with the Uncarved Block of nameless simplicity, not taking mastery.\nThe Uncarved Block of nameless simplicity\nshall also be without desire.\nWithout desire, there is no contention.\nWithout desire, through stillness,\nthe world will settle of itself.\n\n**Chapter Thirty-Eight**\n\nHighest virtue does not act as virtue—\nthus it possesses virtue.\nLesser virtue does not lose virtue—\nthus it lacks virtue.\nHighest virtue acts through non-action, without purpose.\nLesser virtue acts, with purpose.\nHighest benevolence acts, without purpose.\nHighest righteousness acts, with purpose.\nHighest propriety acts, yet when none respond,\nit rolls up its sleeves and forces compliance.\nThus, when the Dao is lost, virtue arises;\nwhen virtue is lost, benevolence arises;\nwhen benevolence is lost, righteousness arises;\nwhen righteousness is lost, propriety arises.\nPropriety is the thinning of loyalty and trust,\nthe beginning of chaos.\nForeknowledge is the flower of the Dao,\nthe beginning of folly.\nTherefore, the great person dwells in the substantial,\nnot the superficial;\nin the fruit, not the flower.\nThus, they discard the latter and take the former.\n\nVirtue means attainment—\nconstant attainment without loss,\nbenefit without harm.\nHence it is named \"virtue.\"",
      "overlap_context": "s.\nSharp instruments are those that benefit the state—\nonly by following the nature of things, without resorting to punishment,\ncan each thing attain its proper place.\nThus they are the state’s sharp instruments.\nTo display them is to rely on punishment;\nif punishment is used to benefit the state, it will fail.\nWhen fish leave the depths, they are surely lost;\nwhen the state’s sharp instruments are displayed, they too will be lost.\n\n**Chapter Thirty-Seven**\n\nThe Dao ever acts through non-action.",
      "start_char": 12191,
      "end_char": 12624,
      "start_sentence": 423,
      "end_sentence": 439,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.704898595809937,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "何以得德由乎 道也 何以尽德以无为用以无为用则莫不载也 故物无焉 则无物不经有焉 则不足以免其生是以天地虽广以无为心圣王虽大以虚为主故曰以复而视则天地之心见至日而思之则先王之至睹也 故灭其私而无其身则四海莫不瞻远近莫不至殊其已而有其心则一体不能自全肌骨不能相容是以上德之人唯道是用不德其德无执无用故能有德而无不为不求而得不为而成故虽有德而无德名也 下德求而得之为而成之则立善以治物故德名有焉 求而得之必有失焉 为而成之必有败焉 善名生则有不善应焉 故下德为之而有以为也 无以为者无所徧为也 凡不能无为而为之者皆下德也 仁义礼节是也 将明德之上下辄举下德以对上德至于无以为极下德下之量上仁是也 足及于无以为而犹为之焉 为之而无以为故有为为之患矣 本在无为母在无名弃本舍母而适其子功虽大焉 必有不济名虽美焉 伪亦必生不能不为而成不兴而治则乃为之故有普博施仁爱之者而爱之无所偏私故上仁为之而无以为也 爱不能兼则有抑抗正真而义理之者忿枉佑直助彼攻此物事而有以心为矣 故上义为之而有以为也 直不能笃则有游饰修文礼敬之者尚好修敬校责徃来则不对之间忿怒生焉 故上礼为之而莫之应则攘臂而扔之夫大之极也 其唯道乎 自此已徃岂足尊哉",
      "translated_text": "How does one attain virtue? Through the Dao.\nHow does one fulfill virtue? By employing non-action.\nWhen non-action is employed, nothing is not borne.\nThus, when things are without it, no thing fails to pass through;\nwhen they possess it, they cannot preserve their lives.\n\nTherefore, though heaven and earth are vast, they take non-action as their heart.\nThough sage-kings are great, they take emptiness as their master.\nThus it is said: \"In returning to observe, the heart of heaven and earth is seen;\nin contemplating the solstice, the ultimate of the former kings is beheld.\"\n\nTherefore, extinguish the private and forget the self—\nthen the four seas will gaze upon you, and far and near will come without fail.\nBut if one exalts the self and harbors intentions,\nthen even a single body cannot remain whole,\nand even flesh and bone cannot tolerate one another.\n\nThus, the person of highest virtue employs only the Dao,\nnot deeming their virtue as virtue.\nWithout grasping, without employing,\nthey are able to possess virtue yet do nothing that is not done,\nto seek nothing yet attain,\nto act without acting yet accomplish.\nThus, though they possess virtue, they bear no name of virtue.\n\nLesser virtue seeks and attains, acts and accomplishes—\nestablishing goodness to govern things.\nThus, the name of virtue arises.\nYet in seeking and attaining, there must be loss;\nin acting and accomplishing, there must be failure.\nWhen the name of goodness arises, un-goodness responds.\nThus, lesser virtue acts with purpose.\n\n\"Without purpose\" means without partial action.\nAll who cannot practice non-action yet act are of lesser virtue—\nbenevolence, righteousness, propriety, and ritual are such.\nTo clarify the superior and inferior of virtue,\nwe invariably contrast lesser virtue with higher virtue,\ntaking \"without purpose\" as the measure of the lowest of lesser virtue.\nEven when one reaches \"without purpose,\" they still act—\nacting without purpose, yet the trouble of acting remains.\n\nThe root lies in non-action; the mother lies in namelessness.\nAbandoning the root, forsaking the mother, and pursuing the child—\nthough achievements may be great, they will surely not endure;\nthough names may be fine, falsity will inevitably arise.\n\nIf one cannot accomplish without acting,\ncannot govern without rising,\nthen one must act—\nhence the elaborate praises, broad bestowals,\nand benevolent loves that love without partiality.\nThus, highest benevolence acts without purpose.\n\nWhen love cannot be universal, there is restraint and resistance.\nThose who rectify with righteousness and principle\ngrow indignant at wrongs, aid the upright,\nassist one side and attack another—\ntheir hearts are set upon something.\nThus, highest righteousness acts with purpose.\n\nWhen rectitude cannot be steadfast, there is embellishment and refinement,\ncultivation of ritual and reverence.\nThose who esteem refinement and respect\ndemand reciprocity in exchanges—\nwhen unmet, anger arises.\nThus, highest propriety acts, yet when none respond,\nit rolls up its sleeves and forces compliance.\n\nIs not the greatest of all the Dao?\nFrom this point onward, what is worthy of esteem?",
      "overlap_context": "es;\nwhen benevolence is lost, righteousness arises;\nwhen righteousness is lost, propriety arises.\nPropriety is the thinning of loyalty and trust,\nthe beginning of chaos.\nForeknowledge is the flower of the Dao,\nthe beginning of folly.\nTherefore, the great person dwells in the substantial,\nnot the superficial;\nin the fruit, not the flower.\nThus, they discard the latter and take the former.\n\nVirtue means attainment—\nconstant attainment without loss,\nbenefit without harm.\nHence it is named \"virtue.\"",
      "start_char": 12624,
      "end_char": 13105,
      "start_sentence": 440,
      "end_sentence": 466,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.08366870880127,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "故虽盛业大富而有万物犹各得其德虽贵以无为用不能舍无以为体也 不能舍无以为体则失其为大矣 所谓失道而后德也 以无为用德其母故能已不劳焉 而物无不理下此已徃则失用之母不能无为而贵博施不能博施而贵正直不能正直而贵饰敬所谓失德而后仁失仁而后义失义而后礼也 夫礼也 所始首于忠信不笃通简不阳责备于表机防争制夫仁义发于内为之犹伪况务外饰而可久乎 故夫礼者忠信之薄而乱之首也 前识者前人而识也 即下德之伦也 竭其聪明以为前识役其智力以营庶事虽德其情奸巧弥密虽丰其誉愈丧笃实劳而事昏务而治秽虽竭圣智而民愈害舍已任物则无为而泰守夫素朴则不顺典制听彼所获弃此所守识道之华而愚之首故苟得其为功之母则万物作焉 而不辞也 万事存焉",
      "translated_text": "Thus, though one’s enterprises flourish, wealth abounds, and the myriad things each attain their virtue, though one is honored for employing non-action, one cannot abandon non-being as one’s essence. To abandon non-being as one’s essence is to lose that which makes one great. This is what is meant by \"losing the Dao and afterward virtue.\"\n\nEmploying non-action, virtue is the mother—thus one may cease without toil, and the things of the world are without disorder. Below this point onward, one loses the mother of employment, cannot practice non-action yet esteems broad bestowals, cannot practice broad bestowals yet esteems uprightness, cannot practice uprightness yet esteems embellished reverence. This is what is meant by \"losing virtue and afterward benevolence, losing benevolence and afterward righteousness, losing righteousness and afterward propriety.\"\n\nNow, propriety—its beginnings lie in loyalty and trust not being steadfast, in communication not being forthright, in outwardly demanding and expecting reciprocity. The mechanisms of restraint and contention are established. Benevolence and righteousness arise from within and are enacted—yet these are still artificial. How much more so when one busies oneself with external embellishments? Can this endure?\n\nThus, propriety is the attenuation of loyalty and trust and the beginning of disorder. Those of \"foreknowledge\" are those who recognize things before others—these belong to the ranks of lesser virtue. They exhaust their intelligence and clarity to cultivate foreknowledge, enslave their wisdom and strength to manage the myriad affairs. Though they may deem themselves virtuous, their nature is cunning and their schemes ever more intricate; though their reputation may flourish, their sincerity is increasingly lost. They toil in earnest yet their affairs grow murky, they strive in busyness yet their governance becomes filthy. Though they exhaust sagely wisdom, the people suffer greater harm.\n\nAbandoning the self to serve things leads to non-action and peace; upholding simplicity and plainness does not conform to established norms, allowing others to obtain what they seek while relinquishing what one guards. Recognizing the flower of the Dao is the beginning of folly. Therefore, if one but attains that which is the mother of all achievements, the myriad things arise of themselves without refusal, and the myriad affairs are preserved.",
      "overlap_context": "d attack another—\ntheir hearts are set upon something.\nThus, highest righteousness acts with purpose.\n\nWhen rectitude cannot be steadfast, there is embellishment and refinement,\ncultivation of ritual and reverence.\nThose who esteem refinement and respect\ndemand reciprocity in exchanges—\nwhen unmet, anger arises.\nThus, highest propriety acts, yet when none respond,\nit rolls up its sleeves and forces compliance.\n\nIs not the greatest of all the Dao?\nFrom this point onward, what is worthy of esteem?",
      "start_char": 13105,
      "end_char": 13395,
      "start_sentence": 467,
      "end_sentence": 479,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.902008533477783,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "而不劳也 用不以形御不以名故名仁义可显礼敬可彰也 夫载之以大道镇之以无名则物无所尚志无所营各任其贞事用其诚则仁德厚焉 行义正焉 礼敬清焉 弃其所载舍其所生用其成形役其聪明仁则诚焉 义其竞焉 礼其争焉 故仁德之厚非用仁之所能也 行义之正非用义之所成也 礼敬之清非用礼之所济也 载之以道统之以母故显之而无所尚彰之而无所竞用夫无名故名以笃焉 用夫无形故形以成焉 守母以存其子崇本以举其末则形名俱有而邪不生大美配天而华不作故母不可远本不可失仁义母之所生非可以为母形器匠之所成非可以为匠也 舍其母而用其子弃其本而适其末名则有所分形则有所止虽极其大必有不周虽盛其美必有患忧功在为之岂足处也 三十九章【案河上公注本此为法本章】 昔之得一者 昔始也一数之始而物之极也各是一物之生所以为主也物皆各得此一以成既成而舍以居成居成则失其母故皆裂发歇竭灭蹶也 天得一以清地得一以宁神得一以灵谷得一以盈万物得一以生侯王得一以为天下贞其致之【案各本致之下有一也二字焦竑云开元本无】 各以其一致此清宁灵盈生贞 天无以清将恐裂 用一以致清耳非用清以清也守一则清不失用清则恐裂也故为功之母不可舍也是以皆无用其功恐丧其本也",
      "translated_text": "Yet it is not laborious. Employing it without reliance on form, without dependence on name—thus the names of benevolence and righteousness may be displayed, and rites and reverence may be made manifest.\n\nWhen borne by the great Dao and stabilized by the nameless, things have nothing to esteem, and aspirations have nothing to pursue. Each follows its inherent integrity, employing its sincerity—then the virtue of benevolence becomes profound, the conduct of righteousness becomes upright, and the observance of rites and reverence becomes pure.\n\nAbandoning what bears them, forsaking their source, using their completed forms, and employing their cleverness—then benevolence becomes insincere, righteousness becomes contentious, and rites become disputatious. Thus, the profundity of benevolent virtue is not achieved by employing benevolence; the uprightness of righteous conduct is not accomplished by employing righteousness; the purity of rites and reverence is not attained by employing rites.\n\nBorne by the Dao and governed by the Mother, they are displayed without esteem, made manifest without contention. Employing the nameless, names become sincere; employing the formless, forms become complete. Preserving the Mother to sustain the child, exalting the root to elevate the branch—then form and name both exist, and perversity does not arise. Great beauty matches Heaven, and embellishment does not occur.\n\nThus, the Mother cannot be distanced, the root cannot be lost. Benevolence and righteousness are born of the Mother—they cannot serve as the Mother. Forms and vessels are crafted by the artisan—they cannot serve as the artisan. Forsaking the Mother to use the child, abandoning the root to pursue the branch—names then have divisions, forms then have limits. Though one may extend them to their utmost, there must be incompleteness; though one may exalt their beauty, there must be affliction and sorrow. The merit lies in action—how can it suffice for abiding?\n\nChapter Thirty-Nine\nThose of old who attained the One:\nOf old, in the beginning—the One is the inception of numbers and the extremity of things. Each is the origin of a thing’s life, the means by which it becomes its master. All things each attain this One to achieve completion. Once completed, they abandon it to dwell in completion. Dwelling in completion, they lose their Mother—thus all split, wither, exhaust, perish, and collapse.\n\nHeaven attained the One and became clear;\nEarth attained the One and became tranquil;\nSpirits attained the One and became numinous;\nValleys attained the One and became full;\nThe myriad things attained the One and came to life;\nLords and kings attained the One and became the integrity of the world.\n\nIn their attainment:\nEach by its One attained this clarity, tranquility, numinosity, fullness, life, and integrity.\n\nIf Heaven had nothing by which to become clear, it would fear splitting—it employs the One to attain clarity, not clarity to become clear. Preserving the One, clarity is not lost; employing clarity, it fears splitting. Thus, the Mother of all achievements cannot be forsaken. Therefore, none dare employ their achievements, fearing the loss of their root.",
      "overlap_context": "ust sagely wisdom, the people suffer greater harm.\n\nAbandoning the self to serve things leads to non-action and peace; upholding simplicity and plainness does not conform to established norms, allowing others to obtain what they seek while relinquishing what one guards. Recognizing the flower of the Dao is the beginning of folly. Therefore, if one but attains that which is the mother of all achievements, the myriad things arise of themselves without refusal, and the myriad affairs are preserved.",
      "start_char": 13395,
      "end_char": 13888,
      "start_sentence": 480,
      "end_sentence": 501,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.5045645236969,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "地无以宁将恐发神无以灵将恐歇谷无以盈将恐竭万物无以生将恐灭侯王无以贵高【案各本以下有贞字】将恐蹶故贵以贱为本高以下为基是以侯王自谓孤寡不谷此非以贱为本耶非乎故致数舆无舆【案两舆字河上公注本作车释文作舆原本误作誉今据释文校改】不欲琭琭如玉珞珞如石【案珞珞河上公注本作落落】 清不能为清盈不能为盈皆有其母以存其形故清不足贵盈不足多贵在其母而母无贵形贵乃以贱为本高乃以下为基故致数舆乃无舆也玉石琭琭珞珞体尽于形故不欲也 四十章【案河上公注本此为去用章】 反者道之动 高以下为基贵以贱为本有以无为用此其反也动皆知其所无则物通矣故曰反者道之动也 弱者道之用 柔弱同通不可穷极 天下万物生于有有生于无 天下之物皆以有为生有之所始以无为本将欲全有必反于无也 四十一章【案河上公注本此为同异章】 上士闻道勤而行之 有志也",
      "translated_text": "Earth, without that by which to become tranquil, would fear eruption;\nSpirits, without that by which to become numinous, would fear dissipation;\nValleys, without that by which to become full, would fear exhaustion;\nThe myriad things, without that by which to come to life, would fear extinction;\nLords and kings, without that by which to be exalted and lofty, would fear collapse.\n\nThus, the noble takes the humble as its root; the high takes the low as its foundation. Therefore, lords and kings call themselves \"the orphaned,\" \"the widowed,\" and \"the unworthy\"—is this not taking the humble as their root? Is it not so? Hence, to amass numerous carriages is to have no carriage. One does not desire to be lustrous like jade or coarse like stone.\n\nClarity cannot make itself clear; fullness cannot make itself full. All retain their Mother to preserve their form. Thus, clarity is not to be prized; fullness is not to be esteemed. The value lies in their Mother, yet the Mother has no prized form. Value arises from taking the humble as root; height arises from taking the low as foundation. Therefore, to amass numerous carriages is to have no carriage. Jade and stone, lustrous or coarse, are exhausted by their form—hence one does not desire them.\n\n**Chapter 40**\nReversion is the movement of the Dao;\nThe high takes the low as foundation; the noble takes the humble as root.\nBeing arises from non-being as its function—this is its reversion.\nIn movement, all know that which is without, and things communicate.\nThus it is said: Reversion is the movement of the Dao.\n\nWeakness is the function of the Dao.\nSoftness and weakness are interconnected, inexhaustible.\nAll things under heaven are born of being; being is born of non-being.\nTo preserve being in its entirety, one must return to non-being.\n\n**Chapter 41**\nWhen the highest scholar hears of the Dao, they diligently practice it—\nThis is their aspiration.",
      "overlap_context": "he integrity of the world.\n\nIn their attainment:\nEach by its One attained this clarity, tranquility, numinosity, fullness, life, and integrity.\n\nIf Heaven had nothing by which to become clear, it would fear splitting—it employs the One to attain clarity, not clarity to become clear. Preserving the One, clarity is not lost; employing clarity, it fears splitting. Thus, the Mother of all achievements cannot be forsaken. Therefore, none dare employ their achievements, fearing the loss of their root.",
      "start_char": 13888,
      "end_char": 14265,
      "start_sentence": 502,
      "end_sentence": 513,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.00907278060913,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 22,
      "original_text": "中士闻道若存若亡下士闻道大笑之不笑不足以为道故建言有之【案之下一本有曰字】 建犹立也 明道若昧 光而不耀 进道若退 后其身而身先外其身而身存 夷道若颣【案颣河上公注本作】 颣防也大夷之道因物之性不执平以割物其平不见乃更反若颣防也 上德若谷 不德其德无所懐也 大白若辱【案辱焦竑云古作】 知其白守其黑大白然后乃得 广德若不足 广德不盈廓然无形不可满也 建德若偷 偷匹也建德者因物自然不立不施故若偷匹 质真若渝【案渝一作偷】 质真者不矜其真故渝 大方无隅 方而不割故无隅也 大器晚成 大器成天下不持全别故必晚成也 大音希声 听之不闻名曰希不可得闻之音也有声则有分有分则不宫而商矣分则不能统众故有声者非大音也 大象无形 有形则有分有分者不温则炎不炎则寒故象而形者非大象 道隐无名夫唯道善贷且成 凡此诸善皆是道之所成也在象则为大象而大象无形在音则为大音而大音希声物以之成而不见其成形故隐而无名也贷之非唯供其乏而已一贷之则足以永终其德故曰善贷也成之不如机匠之裁无物而不济其形故曰善成 四十二章【案河上公注本此为道化章】 道生一一生二二生三三生万物万物负阴而抱阳冲气以为和人之所恶唯孤寡不谷而王公以为称故物或损之而益或益之而损 万物万形其归一也何由致一由于无也由无乃一一可谓无已谓之一岂得无言乎有言有一非二如何有一有二遂生乎三从无之有数尽乎斯过此以徃非道之流故万物之生吾知其主虽有万形冲气一焉百姓有心异国殊风而得一者王侯主焉以一为主一何可舍愈多愈远损则近之损之至尽乃得其极既谓之一犹乃至三况本不一而道可近乎损之而益岂虚言也 人之所教我亦教之【案二句焦竑云一作人之所以教我亦我之所以教人一作人之所教亦我义教之】 我之非强使人从之也而用夫自然举其至理顺之必吉违之必凶故人相教违之自取其凶也亦如我之教人勿违之也 强梁者不得其死吾将以为教父 强梁则必不得其死人相教为强梁则必如我之教人不当为强梁也举其强梁不得其死以教耶若云顺吾教之必吉也故得其违教之徒适可以为教父也 四十三章【案河上公注本此为徧用章】 天下之至柔驰骋天下之至坚 气无所不入水无所不出于经",
      "translated_text": "**Chapter 41 (continued)**\nThe middling scholar hears of the Dao and treats it as if it exists, as if it does not;\nThe lesser scholar hears of the Dao and laughs greatly at it.\nIf it were not laughed at, it would not suffice to be the Dao.\nThus the established saying holds:\nDao established is like obscurity—\nLuminous yet not dazzling.\nAdvancing in the Dao is like retreating;\nPutting oneself last, one finds oneself first;\nSetting oneself aside, one preserves oneself.\nThe level Dao appears uneven—\nIts levelness unseen, it seems instead to be a barrier.\nThe highest virtue is like a valley—\nNot parading its virtue, it holds nothing within.\nGreat whiteness appears stained—\nKnowing its whiteness, it guards its blackness; only then is great whiteness attained.\nVast virtue appears insufficient—\nVast virtue is not full, its formlessness cannot be filled.\nEstablished virtue appears indolent—\nEstablished virtue follows things naturally, neither asserting nor imposing, thus seeming indolent.\nUnadulterated authenticity appears tarnished—\nUnadulterated authenticity does not cling to its purity, hence it seems tarnished.\nGreat squareness has no corners—\nBeing square yet not cutting, it has no corners.\nGreat vessels are slow to complete—\nGreat vessels, not held to partial completion, must be finished late.\nGreat sound is scarce of voice—\nThat which cannot be heard when listened for is called scarce; sound that cannot be grasped is sound indeed. Where there is sound, there is division; where there is division, there is no unity of tone. Division cannot govern the many—thus sound is not great sound.\nThe great image has no form—\nWhere there is form, there is division; what is divided is neither warm nor scorching, neither scorching nor cold. Thus the image that takes form is not the great image.\nThe Dao is hidden, without name.\nOnly the Dao excels in bestowing and in accomplishing.\nAll these excellences are what the Dao accomplishes.\nIn images, it becomes the great image, yet the great image has no form;\nIn sound, it becomes great sound, yet great sound is scarce of voice.\nThings are completed by it, yet its completion is unseen—thus it is hidden, without name.\nIts bestowal is not merely to supply what is lacking; a single bestowal suffices to perpetuate virtue eternally—hence it excels in bestowing.\nIts accomplishment is not like the carpenter’s craft, which shapes without exhausting form—hence it excels in accomplishing.\n\n**Chapter 42**\nThe Dao generates the One;\nThe One generates the Two;\nThe Two generate the Three;\nThe Three generate the ten thousand things.\nThe ten thousand things bear yin and embrace yang, blending qi to achieve harmony.\nWhat people despise—being orphaned, widowed, or unworthy—kings and lords take as their titles.\nThus things may be diminished yet gain, or augmented yet lose.\nWhat people teach, I also teach:\n“The violent do not meet a natural death.”\nI take this as the father of my teaching.\n\n**Chapter 43**\nThe softest under heaven gallops through the hardest under heaven.\nQi enters where there is no space; water emerges from what has no aperture.",
      "overlap_context": "function—this is its reversion.\nIn movement, all know that which is without, and things communicate.\nThus it is said: Reversion is the movement of the Dao.\n\nWeakness is the function of the Dao.\nSoftness and weakness are interconnected, inexhaustible.\nAll things under heaven are born of being; being is born of non-being.\nTo preserve being in its entirety, one must return to non-being.\n\n**Chapter 41**\nWhen the highest scholar hears of the Dao, they diligently practice it—\nThis is their aspiration.",
      "start_char": 14265,
      "end_char": 15210,
      "start_sentence": 514,
      "end_sentence": 551,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.920685052871704,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 23,
      "original_text": "无有入无间【案淮南子作出于无有入于无间】吾是以知无为之有益虚无柔弱无所不通无有不可穷至柔不可折以此推之故知无为之有益也 不言之教无为之益天下希及之 四十四章【案河上公注本此为立戒章】 名与身孰亲 尚名好高其身必疏 身与货孰多 贪货无厌其身必少 得与亡孰病 得多利而亡其身何者为病也 是故甚爱必大费多藏必厚亡 甚爱不与物通多藏不与物散求之者多攻之者众为物所病故大费厚亡也 知足不辱知止不殆可以长久 四十五章【案河上公注本此为洪德章】 大成若缺其用不 随物而成不为一象故若缺也 大盈若冲其用不穷 大盈充足随物而与无所爱矜故若冲也 大直若屈 随物而直直不在一故若屈也 大巧若拙 大巧因自然以成器不造为异端故若拙也 大辩若讷 大辩因物而言已无所造故若讷也 躁胜寒静胜清静为天下正 躁罢然后胜寒静无为以胜以此推之则清静为天下正也静则全物之真躁则犯物之性故惟清静乃得如上诸大也 四十六章【案河上公注本此为俭欲章】 天下有道却走马以粪 天下有道知足知止无求于外各修其内而已故却走马以治田粪也 天下无道戎马生于郊 贪欲无厌不修其内各求于外故戎马生于郊也 祸莫大于不知足【案河上公注本此句上有罪莫大于可欲一句】咎莫大于欲得【案大韩非子作防】故知足之足常足矣 四十七章【案河上公注本此为鉴远章】 不出户知天下不窥牖见天道【案韩非子出窥下有于字户牖下有可以字】事有宗而物有主途虽殊而同归也虑虽百而其致一也道有大常理有大致执古之道可以御今虽处于今可以知古始故不出户窥牖而可知也 其出弥远【案韩非子远下有者字】其知弥少 无在于一而求之于众也道视之不可见听之不可闻搏之不可得如其知之不须出户若其不知出愈远愈迷也 是以圣人不行而知【案知一作至】不见而名 得物之致故虽不行而虑可知也识物之宗故虽不见而是非之理可得而名也 不为而成 明物之性因之而已故虽不为而使之成矣 四十八章【案河上公注本此为忘知章】 为学日益 务欲进其所能益其所习",
      "translated_text": "The non-existent enters where there is no gap. Thus I know the benefit of non-action. Emptiness, nothingness, softness, and weakness penetrate all things without obstruction. The utterly soft cannot be broken. From this I infer the benefit of non-action. The teaching without words, the benefit of non-action—few in the world attain them.\n\n**Chapter 44**\nFame or self—which is dearer?\nSelf or wealth—which is greater?\nGain or loss—which is more harmful?\nExcessive love incurs great cost;\nHoarding brings heavy loss.\nKnow contentment and avoid disgrace;\nKnow restraint and avoid danger—\nThus can one endure long.\n\n**Chapter 45**\nGreat perfection seems flawed, yet its use is inexhaustible.\nGreat fullness seems empty, yet its use is boundless.\nGreat straightness seems bent;\nGreat skill seems clumsy;\nGreat eloquence seems inarticulate.\nRestlessness overcomes cold; stillness overcomes heat.\nPurity and tranquility set the world right.\n\n**Chapter 46**\nWhen the world follows the Dao, warhorses are retired to fertilize fields.\nWhen the world strays from the Dao, cavalry mounts are bred at the frontier.\nNo calamity is greater than discontent;\nNo fault is greater than covetousness.\nThus, knowing contentment brings constant sufficiency.\n\n**Chapter 47**\nWithout stepping outside, one knows the world;\nWithout peering through the window, one sees the Dao of heaven.\nThe farther one goes, the less one knows.\nThus the sage knows without traveling,\nNames without seeing,\nAchieves without acting.\n\n**Chapter 48**\nIn the pursuit of learning, one gains daily;\nIn the pursuit of the Dao, one loses daily.",
      "overlap_context": "things bear yin and embrace yang, blending qi to achieve harmony.\nWhat people despise—being orphaned, widowed, or unworthy—kings and lords take as their titles.\nThus things may be diminished yet gain, or augmented yet lose.\nWhat people teach, I also teach:\n“The violent do not meet a natural death.”\nI take this as the father of my teaching.\n\n**Chapter 43**\nThe softest under heaven gallops through the hardest under heaven.\nQi enters where there is no space; water emerges from what has no aperture.",
      "start_char": 15210,
      "end_char": 16098,
      "start_sentence": 552,
      "end_sentence": 593,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.007806301116943,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 24,
      "original_text": "为道日损 务欲反虚无也 损之又损以至于无为无为而无不为 有为则有所失故无为乃无所不为也 取天下常以无事 动常因也 及其有事 自已造也 不足以取天下 失统本也 四十九章【案河上公注本此为任德章】 圣人无常心以百姓心为心 动常因也 善者吾善之不善者吾亦善之 各因其用则善不失也 德善【案善下一本有矣字】 无弃人也 信者吾信之不信者吾亦信之德信【案信下一本有矣字】圣人在天下【案人下各本有之字】歙歙为天下浑其心【案歙歙河上公注本作怵怵释文云一作惵惵】 各用聪明 圣人皆孩之【案孩释文云王弼作咳据注义仍宜作孩】 皆使和而无欲如婴儿也 夫天地设位圣人成能人谋鬼谋百姓与能者能者与之资者取之能大则大资贵则贵物有其宗事有其主如此则可冕旒充目而不惧于欺黈纩塞耳 而无戚于慢又何为劳一身之聪明以察百姓之情哉 夫以明察物物亦竞以其明应之以不信察物物亦竞以其不信应之夫天下之心不必同其所应不敢异则莫肯用其情矣 甚矣 害之大也",
      "translated_text": "In the pursuit of the Dao, one loses daily—\nStriving to return to emptiness and nothingness.\nLose and lose again, until one reaches non-action;\nThrough non-action, nothing is left undone.\nActing brings loss, thus non-action leaves nothing undone.\n\nTo govern the world, one always acts through non-interference,\nMoving only by following.\nWhen there is interference, it is self-created—\nInsufficient to govern the world, for the fundamental unity is lost.\n\n**Chapter 49**\nThe sage has no fixed heart,\nTaking the hearts of the people as his own—\nMoving only by following.\nThe good, I treat as good;\nThe not-good, I also treat as good—\nThus virtue is goodness.\nThe trustworthy, I trust;\nThe untrustworthy, I also trust—\nThus virtue is trustworthiness.\n\nThe sage, in the world,\nGathers and unifies the hearts of the world,\nMerging them into one.\nEach employs their own intelligence,\nYet the sage treats all as infants—\nAll are made harmonious and desireless, like newborns.\n\nHeaven and earth establish their positions; the sage fulfills his capacities.\nHuman plans, ghostly plans—\nThe people offer their abilities.\nThose with ability are given; those with resources take.\nGreat ability brings great resources; noble ability brings noble resources.\nThings have their origins; affairs have their masters.\nThus, one may wear the imperial crown, its tassels filling the eyes, yet fear no deception;\nIts floss may block the ears, yet suffer no distress from negligence.\nWhy then exhaust one’s own intelligence to scrutinize the people’s hearts?\n\nFor when one examines things with clarity, things in turn respond with their own clarity;\nWhen one examines things with distrust, things in turn respond with their own distrust.\nIf the hearts of the world need not be the same,\nAnd their responses dare not differ,\nThen none will offer their true feelings.\nHow grave the harm—how vast!",
      "overlap_context": "ntier.\nNo calamity is greater than discontent;\nNo fault is greater than covetousness.\nThus, knowing contentment brings constant sufficiency.\n\n**Chapter 47**\nWithout stepping outside, one knows the world;\nWithout peering through the window, one sees the Dao of heaven.\nThe farther one goes, the less one knows.\nThus the sage knows without traveling,\nNames without seeing,\nAchieves without acting.\n\n**Chapter 48**\nIn the pursuit of learning, one gains daily;\nIn the pursuit of the Dao, one loses daily.",
      "start_char": 16098,
      "end_char": 16536,
      "start_sentence": 594,
      "end_sentence": 619,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.658462047576904,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 25,
      "original_text": "莫大于用其明矣 夫在智则人与之讼在力则人与之争智不出于人而立乎 讼地则穷矣 力不出于人而立乎 争地则危矣 未有能使人无用其智力乎 己者也 如此则己以一敌人而人以千万敌己也 若乃多其法网烦其刑罚塞其径路攻其幽宅则万物失其自然百姓丧其手足鸟乱于上鱼乱于下是以圣人之于天下歙歙焉 心无所主也 为天下浑心焉 意无所适莫也 无所察焉 百姓何避无所求焉 百姓何应无避无应则莫不用其情矣 人无为舍其所能而为其所不能舍其所长而为其所短如此则言者言其所知行者行其所能百姓各皆注其耳 目焉 吾皆孩之而已",
      "translated_text": "No greater error exists than employing one’s own clarity.\nFor when one relies on cunning, others contend in litigation;\nWhen one relies on force, others contend in struggle.\nIf cunning does not arise from the people but is imposed upon them,\nThen the ground for litigation is exhausted.\nIf force does not arise from the people but is imposed upon them,\nThen the ground for struggle becomes perilous.\nNever has there been one who could prevent the people from employing their own cunning and strength—\nThis is the folly of the self.\nThus, the self contends alone against the people,\nWhile the people contend against the self with a thousandfold might.\n\nIf one multiplies the nets of law, complicates punishments,\nBlocks the paths, and assaults the hidden dwellings,\nThen the myriad things lose their spontaneity,\nThe hundred clans are bereft of their hands and feet,\nBirds are thrown into chaos above,\nFish into chaos below.\nTherefore, the sage’s approach to the world is one of reverent restraint,\nWith a heart that holds no fixed intent.\nFor the world, the sage embodies an undivided mind,\nWith no inclination to impose direction,\nNo impulse to scrutinize.\nWhen the people have nothing to evade,\nNothing to respond to,\nThen none withhold their true feelings.\n\nPeople, when left to themselves,\nAbandon what they cannot do and act according to their abilities;\nThey forsake their shortcomings and cultivate their strengths.\nThus, speakers speak of what they know,\nDoers act according to their capacities,\nAnd the hundred clans all direct their ears and eyes.\nI merely treat them as infants.",
      "overlap_context": " fear no deception;\nIts floss may block the ears, yet suffer no distress from negligence.\nWhy then exhaust one’s own intelligence to scrutinize the people’s hearts?\n\nFor when one examines things with clarity, things in turn respond with their own clarity;\nWhen one examines things with distrust, things in turn respond with their own distrust.\nIf the hearts of the world need not be the same,\nAnd their responses dare not differ,\nThen none will offer their true feelings.\nHow grave the harm—how vast!",
      "start_char": 16536,
      "end_char": 16761,
      "start_sentence": 620,
      "end_sentence": 637,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.776213884353638,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 26,
      "original_text": "五十章【案河上公注本此为贵生章】 出生入死 出生地入死地 生之徒十有三死之徒十有三人之生动之死地亦十有三【案韩非子作生而动动皆之死地】夫何故以其生生之厚盖闻善摄生者陆行不遇兕虎入军不甲兵兕无所投其角虎无所措其爪兵无所容其刃夫何故以其无死地十有三犹云十分有三分取其生道全生之极十分有三耳 取死之道全死之极亦十分有三耳 而民生生之厚更之无生之地焉 善摄生者无以生为生故无死地也 器之害者莫甚乎 戈兵兽之害者莫甚乎 兕虎而令兵戈无所容其锋刃虎兕无所措其爪角斯诚不以欲累其身者也 何死地之有乎 夫蚖蟺以渊为浅而凿穴其中鹰鹯以山为卑而増巢其上矰缴不能及网罟不能到可谓处于无死地矣 然而卒以甘饵乃入于无生之地岂非生生之厚乎 故物苟不以求离其本不以欲渝其真虽入军而不害陆行而不可犯也 赤子之可则而贵信矣",
      "translated_text": "Chapter Fifty [Note: In the *Heshang Gong* commentary, this is the \"Valuing Life\" chapter]\n\nEmerging into life, entering into death.\nEmerging into the land of life, entering the land of death.\nThose who follow life are thirteen in ten,\nThose who follow death are thirteen in ten,\nAnd those whose life moves them into the land of death are also thirteen in ten.\n[Note: *Han Feizi* reads: \"Those who live and act—all their actions lead to the land of death.\"]\nWhy is this?\nBecause they overindulge in the pursuit of life.\n\nI have heard that those skilled in nurturing life\nWalk on land without encountering rhinoceros or tiger,\nEnter battle without donning armor or wielding weapons.\nThe rhinoceros finds nowhere to thrust its horn,\nThe tiger nowhere to place its claws,\nWeapons nowhere to lodge their blades.\nWhy is this?\nBecause they harbor no ground for death.\n\n\"Thirteen in ten\" means that of ten parts, three follow the Way of life to its fullest,\nAnd three follow the Way of death to its extreme.\nYet people, in their excessive pursuit of life,\nTurn it into a land of no life.\n\nThose skilled in nurturing life do not treat life as something to be clung to,\nThus they have no ground for death.\nOf all harms wrought by tools, none surpasses weapons;\nOf all harms wrought by beasts, none surpasses rhinoceros and tiger.\nYet when weapons find no place for their blades,\nWhen tigers and rhinoceroses find no place for their claws and horns,\nThis is truly not allowing desire to burden the self.\nHow can there be any ground for death?\n\nThe viper and the centipede deem the abyss too shallow and burrow into it,\nThe hawk and the kite deem the mountain too low and build their nests higher.\nArrows and snares cannot reach them,\nNets and traps cannot ensnare them—\nOne might call this dwelling in a ground without death.\nYet in the end, they are lured by sweet bait\nAnd enter a land of no life.\nIs this not the result of overindulging in the pursuit of life?\n\nThus, if things do not seek to depart from their root,\nDo not allow desire to alter their true nature,\nThen even when entering battle, they remain unharmed,\nAnd when walking on land, they cannot be assailed.\nThe infant’s way is to be esteemed and trusted.",
      "overlap_context": ",\nWith no inclination to impose direction,\nNo impulse to scrutinize.\nWhen the people have nothing to evade,\nNothing to respond to,\nThen none withhold their true feelings.\n\nPeople, when left to themselves,\nAbandon what they cannot do and act according to their abilities;\nThey forsake their shortcomings and cultivate their strengths.\nThus, speakers speak of what they know,\nDoers act according to their capacities,\nAnd the hundred clans all direct their ears and eyes.\nI merely treat them as infants.",
      "start_char": 16761,
      "end_char": 17104,
      "start_sentence": 638,
      "end_sentence": 652,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.905283212661743,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 27,
      "original_text": "五十一章【案河上公注本此为养德章】 道生之德畜之物形之势成之 物生而后畜畜而后形形而后成何由而生道也何得而畜德也何由而形物也何使而成势也唯因也故能无物而不形唯势也故能无物而不成凡物之所以生功之所以成皆有所由有所由焉则莫不由乎道也故推而极之亦至道也随其所因故各有称焉 是以万物莫不尊道而贵德 道者物之所由也德者物之所得也由之乃得故曰不得不失尊之则害不得不贵也 道之尊德之贵夫莫之命而常自然 命并作爵【案此句疑系命字下原校注语误作弼注】 故道生之德畜之长之育之亭之毒之养之覆之谓成其实各得其庇防不伤其体矣 生而不有为而不恃 为而不有 长而不宰是谓德 有德而不知其主也出乎幽防 五十二章【案河上公注本此为归元章】 天下有始以为天下母既得其母以知其子既知其子复守其母没身不殆 母本也子末也得本以知末不舍本以逐末也 塞其兑闭其门 兑事欲之所由生门事欲之所由从也 终身不勤 无事永逸故终身不勤也 开其兑济其事终身不救 不闭其原而济其事故虽终身不救 见小曰明守柔曰强 为治之功不在大见大不明见小乃明守强不强守柔乃强也 用其光 显道以去民迷 复归其明 不明察也",
      "translated_text": "**Chapter 51**\n*(According to the Heshang Gong commentary, this is the \"Nurturing Virtue\" chapter)*\n\nThe Dao gives them life; virtue fosters them.\nThings take form; circumstances bring them to completion.\n\nOnce things are born, they are nurtured;\nonce nurtured, they take form;\nonce formed, they reach completion.\nWhat gives them life? The Dao.\nWhat fosters them? Virtue.\nWhat shapes things? Their form.\nWhat brings circumstances to completion? Their inherent tendency.\n\nOnly through *cause* can all things take form;\nonly through *tendency* can all things reach completion.\nAll things that come to life,\nall achievements that reach fruition,\narise from some cause.\nIf they arise from a cause,\nthen none do not originate from the Dao.\nThus, when traced to their utmost,\nthey arrive at the Dao.\nFollowing their respective causes,\neach receives its proper name.\n\nTherefore, the myriad things\nrevere the Dao and honor virtue.\nThe Dao is that by which things arise;\nvirtue is that which things attain.\nThrough it, they attain—\nthus, if they do not attain, they lose.\nRevering it averts harm;\nif they do not revere it, they cannot but honor it.\n\nThe Dao’s reverence, virtue’s honor—\nnothing commands them, yet they are ever spontaneous.\n*(The word \"command\" here may originally have been a textual note on \"rank,\" mistakenly incorporated into the commentary.)*\n\nThus, the Dao gives them life; virtue fosters them.\nIt rears them, nurtures them,\nshelters them, matures them,\nnourishes them, protects them.\nThis is called bringing them to fruition.\nEach receives its due shelter,\nso that nothing harms its body.\n\nGiving life yet not possessing,\nacting yet not relying,\nrearing yet not dominating—\nthis is called *mysterious virtue*.\nPossessing virtue yet unaware of its source,\nit emerges from the profound.\n\n---\n\n**Chapter 52**\n*(According to the Heshang Gong commentary, this is the \"Returning to the Source\" chapter)*\n\nThe world has a beginning,\nwhich may be regarded as the Mother of the world.\nHaving attained the Mother,\none knows the Child.\nHaving known the Child,\none returns to guard the Mother.\nThus, to the end of one’s days, one does not falter.\n\nThe Mother is the root; the Child is the branch.\nAttaining the root to know the branch,\nnot abandoning the root to pursue the branch—\n\nBlock the openings, shut the gates.\n*(The \"openings\" are the source of desires;\nthe \"gates\" are the path by which desires enter.)*\nThus, one labors not for a lifetime.\nOpen the openings, assist the affairs—\nthus, one cannot be saved for a lifetime.\n*(Not closing the source yet aiding its affairs,\neven to life’s end, one cannot be saved.)*\n\nSeeing the small is called clarity;\nguarding the soft is called strength.\n*(The work of governance does not lie in the great.\nSeeing the great is not clarity;\nseeing the small is clarity.\nGuarding the strong is not strength;\nguarding the soft is strength.)*\n\nEmploy its light,\nreturn to its clarity.\n*(Manifest the Dao to dispel the people’s confusion.)*\nDo not lose sight of it—\nthis is called returning to its luminosity.\n*(Not perceiving with clarity.)*",
      "overlap_context": "t reach them,\nNets and traps cannot ensnare them—\nOne might call this dwelling in a ground without death.\nYet in the end, they are lured by sweet bait\nAnd enter a land of no life.\nIs this not the result of overindulging in the pursuit of life?\n\nThus, if things do not seek to depart from their root,\nDo not allow desire to alter their true nature,\nThen even when entering battle, they remain unharmed,\nAnd when walking on land, they cannot be assailed.\nThe infant’s way is to be esteemed and trusted.",
      "start_char": 17104,
      "end_char": 17632,
      "start_sentence": 653,
      "end_sentence": 679,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.574199676513672,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 28,
      "original_text": "无遗身殃是为习常【案习各本作袭】 道之常也 五十三章【案河上公注本此为益证章】 使我介然有知行于大道唯施是畏 言若使我可介然有知行大道于天下唯施为之是畏也 大道甚夷而民好径 言大道荡然正平而民犹尚舍之而不由好从邪径况复施为以塞大道之中乎故曰大道甚夷而民好径 朝甚除 朝宫室也除洁好也 田甚芜仓甚虚 朝甚除则田甚芜仓甚虚设一而众害生也 服文防带利剑厌饮食财货有余是谓盗夸【案夸韩非子作竽】非道也哉 凡物不以其道得之则皆邪也邪则盗也夸而不以其道得之窃位也故举非道以明非道则皆盗夸也五十四章【案河上公注本此为修观章】 善建者不拔 固其根而后营其末故不拔也",
      "translated_text": "To leave no calamity upon the body—this is called practicing constancy. *(This is the constancy of the Dao.)* [Chapter 53]\n\n\"Were I granted firm knowledge and made to walk the great Dao, only its enactment would I fear.\" *(This means: if I were granted firm knowledge to walk the great Dao in the world, I would fear only its enactment.)*\n\nThe great Dao is utterly level, yet the people prefer byways. *(The great Dao is vast and perfectly even, yet the people still abandon it and do not follow it, preferring to take devious paths—how much more so when enactments are used to obstruct the great Dao’s midst? Thus it is said: \"The great Dao is utterly level, yet the people prefer byways.\")*\n\nThe court is excessively adorned, *(the court refers to palaces and halls; \"adorned\" means cleansed and beautified)*\nfields are overgrown, granaries are empty. *(When the court is excessively adorned, fields become overgrown and granaries empty—establishing one leads to a multitude of harms.)*\n\nWearing embroidered robes, girded with fine belts, bearing sharp swords, sated with food and drink, possessing surplus wealth—this is called the boastful thief. *(Anything not obtained by the Dao is perverse; perverse means thievery. To boast while obtaining things not by the Dao is to usurp rank. Thus, to illustrate what is not the Dao is to show that all such things are the boastful thief.)* [Chapter 54]\n\nWhat is well established cannot be uprooted. *(Firmly rooting the base before cultivating the branches ensures it cannot be uprooted.)*",
      "overlap_context": "even to life’s end, one cannot be saved.)*\n\nSeeing the small is called clarity;\nguarding the soft is called strength.\n*(The work of governance does not lie in the great.\nSeeing the great is not clarity;\nseeing the small is clarity.\nGuarding the strong is not strength;\nguarding the soft is strength.)*\n\nEmploy its light,\nreturn to its clarity.\n*(Manifest the Dao to dispel the people’s confusion.)*\nDo not lose sight of it—\nthis is called returning to its luminosity.\n*(Not perceiving with clarity.)*",
      "start_char": 17632,
      "end_char": 17937,
      "start_sentence": 680,
      "end_sentence": 694,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.037561655044556,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 29,
      "original_text": "善抱者不脱 不贪于多齐其所能故不脱也 子孙以祭祀不辍【案以下韩非子有其世世三字】 子孙传此道以祭祀则不辍也 修之于身其德乃真修之于家其德乃余 以身及人也修之身则真修之家则有余修之不废所施转大 修之于乡其德乃长修之于国【案国韩非子作】其德乃丰修之于天下其德乃普故以身观身以家观家以乡观乡以国观国 彼皆然也 以天下观天下 以天下百姓心观天下之道也天下之道逆顺吉凶亦皆如人之道也 吾何以知天下然哉以此【案下下各本有之字】 此上之所云也言吾何以得知天下乎察巳以知之不求于外也所谓不出户以知天下者也 五十五章【案河上公注本此为符章】 含德之厚比于赤子蜂虿虺蛇不螫猛兽不据攫鸟不搏 赤子无求无欲不犯众物故毒虫之物无犯之人也含德之厚者不犯于物故无物以损其全也 骨弱筋柔而握固 以柔弱之故故握能周固",
      "translated_text": "A master of embrace does not let go. *(Not coveting excess, aligning with one’s capacity—thus nothing slips away.)*\nDescendants perform sacrifices without cease. *(When descendants transmit this Dao in their sacrifices, they do not cease.)*\n\nCultivate it in the self, and one’s virtue becomes genuine;\ncultivate it in the family, and one’s virtue becomes abundant. *(Extending from self to others: cultivated in the self, it is genuine; in the family, it overflows. When cultivation is unceasing, its application grows ever greater.)*\nCultivate it in the village, and one’s virtue becomes enduring;\ncultivate it in the state, and one’s virtue becomes bountiful;\ncultivate it in the world, and one’s virtue becomes universal.\n\nThus, observe the self through the self,\nobserve the family through the family,\nobserve the village through the village,\nobserve the state through the state—\neach mirrors the other.\nObserve the world through the world—\n*(Observe the Dao of the world through the hearts of the world’s people. The world’s Dao—its reversals and sequences, fortune and misfortune—is like the Dao of humanity.)*\n\nHow do I know the world is thus?\nBy this. *(This refers to what was stated above. How do I know the world? By examining myself, not seeking externally. This is what is meant by \"not stepping beyond the door to know the world.\")* [Chapter 55]\n\nOne whose virtue is profoundly embodied is like an infant:\nwasps, scorpions, vipers, and snakes do not sting;\nfierce beasts do not seize;\nbirds of prey do not strike. *(The infant seeks nothing, desires nothing, and does not offend other beings—thus poisonous creatures do not harm it. One of profound virtue does not transgress against things, so nothing can diminish their wholeness.)*\n\nBones soft, sinews tender, yet the grip is firm—\n*(By virtue of softness and tenderness, the grasp is complete and steadfast.)*",
      "overlap_context": "lts, bearing sharp swords, sated with food and drink, possessing surplus wealth—this is called the boastful thief. *(Anything not obtained by the Dao is perverse; perverse means thievery. To boast while obtaining things not by the Dao is to usurp rank. Thus, to illustrate what is not the Dao is to show that all such things are the boastful thief.)* [Chapter 54]\n\nWhat is well established cannot be uprooted. *(Firmly rooting the base before cultivating the branches ensures it cannot be uprooted.)*",
      "start_char": 17937,
      "end_char": 18315,
      "start_sentence": 695,
      "end_sentence": 711,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.495862007141113,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 30,
      "original_text": "未知牝牡之合而全作【案全河上公注本作防】 作长也无物以损其身故能全长也言含德之厚者无物可以损其德渝其真柔弱不争而不摧折皆若此也 精之至也终日号而不嗄【案河上公注本而下有嗌字】 无争欲之心故终日出声而不嗄也 和之至也知和曰常 物以和为常故知和则得常也 知常曰明 不皦不昧不温不凉此常也无形不可得而见曰明也 益生曰祥 生不可益益之则夭也 心使气曰强 心宜无有使气则强 物壮则老谓之不道不道早已 五十六章【案河上公注本此为德章】 知者不言 因自然也",
      "translated_text": "One who does not yet know the union of female and male yet has the *quan* fully aroused—\n*(The *quan* here refers to the genitals; their arousal is long-lasting. Nothing can diminish their body, thus they remain whole and endure. This speaks of one whose virtue is profoundly embodied: nothing can impair their virtue or alter their authenticity. Soft and weak, non-contending, they suffer no breakage—all is thus.)*\n\nThis is the perfection of *jing*.\nThough they cry all day, their voice does not grow hoarse—\n*(Without a heart of contention or desire, they may cry out all day without hoarseness.)*\n\nThis is the perfection of harmony.\nTo know harmony is to know constancy.\n*(Things take harmony as their constancy; thus, to know harmony is to attain constancy.)*\n\nTo know constancy is called clarity.\n*(Neither bright nor dim, neither warm nor cool—this is constancy. Without form, imperceptible to sight, it is called clarity.)*\n\nTo augment life is called ill-omen.\n*(Life cannot be augmented; to force augmentation is to invite premature death.)*\n\nWhen the heart commands *qi*, it is called force.\n*(The heart should remain empty; to command *qi* is to force it.)*\n\nWhen things reach their prime, they age—this is called not following the Dao.\nWhat does not follow the Dao perishes early.\n\n**[Chapter 56]**\n\nThose who know do not speak.\n*(They follow nature.)*",
      "overlap_context": " is profoundly embodied is like an infant:\nwasps, scorpions, vipers, and snakes do not sting;\nfierce beasts do not seize;\nbirds of prey do not strike. *(The infant seeks nothing, desires nothing, and does not offend other beings—thus poisonous creatures do not harm it. One of profound virtue does not transgress against things, so nothing can diminish their wholeness.)*\n\nBones soft, sinews tender, yet the grip is firm—\n*(By virtue of softness and tenderness, the grasp is complete and steadfast.)*",
      "start_char": 18315,
      "end_char": 18570,
      "start_sentence": 712,
      "end_sentence": 727,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.12891411781311,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 31,
      "original_text": "言者不知 造事端也 塞其兑闭其门挫其锐 含守质也 解其分【案分各本作纷】 除争原也 和其光 无所特显则物无所偏争也 同其尘 无所特贱则物无所偏耻也 是谓同故不可得而亲【案亲下各本有亦字下二句同】不可得而疎可得而亲则可得而疎也 不可得而利不可得而害 可得而利则可得而害也 不可得而贵不可得而贱 可得而贵则可得而贱也 故为天下贵 无物可以加之也 五十七章【案河上公注本此为淳风章】 以正治国以奇用兵以无事取天下 以道治国则国平以正治国则奇正起也以无事则能取天下也上章云其取天下者常以无事及其有事又不足以取天下也故以正治国则不足以取天下而以奇用兵也夫以道治国崇本以息末以正治国立辟以攻末本不立而末浅民无所及故必至于奇用兵也 吾何以知其然哉以此天下多忌讳而民弥贫民多利器国家滋昏 利器凡所以利己之器也民强则国家弱 人多伎巧奇物滋起 民多智慧则巧伪生巧伪生则邪事起 法令滋彰盗贼多有 立正欲以息邪而奇兵用多忌讳欲以耻贫而民弥贫利器欲以强国者也而国愈昏多皆舍本以治末故以致此也 故圣人云我无为而民自化我好静而民自正我无事而民自富我无欲而民自朴【案一本有我无情而民自清句】 上之所欲民从之速也我之所欲唯无欲而民亦无欲而自朴也此四者崇本以息末也 五十八章【案河上公注本此为顺化章】 其政闷闷其民淳淳 言善治政者无形无名无事无政可举闷闷然卒至于大治故曰其政闷闷也其民无所争竞宽大淳淳故曰其民淳淳也 其政察察其民缺缺 立刑名明赏罚以检奸伪故曰察察也殊分析民懐争竞故曰其民缺缺 祸兮福之所倚福兮祸之所伏孰知其极其无正【案正下一本有邪字】 言谁知善治之极乎唯无可正举无可形名闷闷然而天下大化是其极也 正复为奇 以正治国则便复以奇用兵矣故曰正复为奇 善复为妖 立善以和万物则便复有妖之患也 人之迷其日固久【案韩非子作其故以久矣】 言人之迷惑失道固久矣不可便正善治以责 是以圣人方而不割 以方导物舍去其邪不以方割物所谓大方无隅 廉而不刿【案刿河上公注本作害】 廉清廉也刿伤也以清廉清民令去其邪令去其污不以清廉刿伤于物也 直而不肆 以直导物令去其僻而不以直激沸于物也所谓大直若屈也 光而不耀 以光鉴其所以迷不以光照求其隐慝也所谓明道若昧也此皆崇本以息末不攻而使复之也 五十九章【案河上公注本此为守道章】 治人事天莫若啬 莫若犹莫过也啬农夫农人之治田务去其殊归于齐一也全其自然不急其荒病除其所以荒病上承天命下绥百姓莫过于此 夫唯啬是谓早服 早服常也 早服谓之重积德 唯重积德不欲锐速然后乃能使早服其常故曰早服谓之重积德者也 重积德则无不克无不克则莫知其极 道无穷也 莫知其极可以有国 以有穷而莅国非能有国也 有国之母可以长久 国之所以安谓之母重积德是唯图其根然后营末乃得其终也 是谓深根固柢【案韩非子深固下俱有其字】长生久视之道 六十章【案河上公注本此为居位章】 治大国若烹小鲜 不扰也躁则多害静则全真故其国弥大而其主弥静然后乃能广得众心矣 以道莅天下其鬼不神 治大国则若烹小鲜以道莅天下则其鬼不神也 非其鬼不神其神不伤人 神不害自然也物守自然则神无所加神无所加则不知神之为神也",
      "translated_text": "Those who speak do not know—\nthey stir up affairs.\n\nBlock their orifices, shut their gates,\nblunt their sharpness, and hold fast to simplicity.\n*(This is to preserve their essential nature.)*\n\nUntangle their distinctions,\n*(Texts vary: some read \"entanglements\" for \"distinctions.\")*\nremove the source of contention.\n\nHarmonize their light—\nwhen nothing stands out, things do not vie for prominence.\nBlend with the dust—\nwhen nothing is singled out as base, things do not feel shame.\n\nThis is called the \"mysterious sameness.\"\nThus, one cannot be drawn near,\n*(Texts vary: some include \"also\" after \"near,\" and the following two lines follow this pattern.)*\nnor can one be kept distant.\nIf one could be drawn near, one could also be kept distant.\n\nOne cannot be benefited,\nnor can one be harmed.\nIf one could be benefited, one could also be harmed.\n\nOne cannot be exalted,\nnor can one be debased.\nIf one could be exalted, one could also be debased.\n\nTherefore, one is honored by all under heaven—\nnothing can be added to this.\n\n**[Chapter 57]**\n\nGovern the state with uprightness,\ndeploy troops with cunning,\nwin all under heaven by doing nothing.\n\nTo govern the state with the Dao is to bring peace;\nto govern with uprightness is to invite both uprightness and cunning.\nOnly by doing nothing can one truly win all under heaven.\n*(The previous chapter states: \"Those who win all under heaven always do so by doing nothing. When they act, it is no longer enough to win all under heaven.\")*\nThus, governing with uprightness is insufficient to win all under heaven—\none must resort to cunning in warfare.\n\nTo govern the state with the Dao is to honor the root and quiet the branches.\nTo govern with uprightness is to establish laws and attack the branches.\nWhen the root is not established and the branches are shallow,\nthe people have nothing to reach for—\nthis inevitably leads to cunning in warfare.\n\nHow do I know this is so?\nBy this:\nThe more taboos there are in the world, the poorer the people become.\nThe more sharp tools the people possess, the more benighted the state grows.\n*(Sharp tools refer to anything that benefits the self—when the people grow strong, the state weakens.)*\nThe more cleverness and skill there are, the more strange things arise.\nThe more knowledge and wisdom the people have, the more deceit and artifice emerge.\nWhen deceit and artifice emerge, perverse affairs arise.\nThe more laws and decrees are promulgated, the more thieves and bandits appear.\n\nEstablishing uprightness to suppress perversity leads instead to cunning in warfare.\nEnacting taboos to shame poverty only deepens the people’s poverty.\nSharpening tools to strengthen the state only plunges it further into darkness.\nAll these abandon the root to tend the branches—\nhence these outcomes.\n\nTherefore, the sage says:\nI do nothing, and the people transform themselves.\nI value stillness, and the people right themselves.\nI take no action, and the people enrich themselves.\nI have no desires, and the people return to simplicity.\n*(One text includes: \"I have no emotions, and the people purify themselves.\")*\n\nWhat the ruler desires, the people swiftly follow.\nMy only desire is to have no desires—\nthus the people, too, have no desires and return to simplicity.\nThese four are to honor the root and quiet the branches.\n\n**[Chapter 58]**\n\nWhen governance is dull and unobtrusive, the people are honest and simple.\n*(To govern well is to be formless, nameless, actionless, and without policies that can be cited—dull and unobtrusive, yet ultimately leading to great order. Thus it is said: \"When governance is dull and unobtrusive...\")*\nWhen the people have nothing to vie for, they are magnanimous and simple.\n*(Thus it is said: \"the people are honest and simple.\")*\n\nWhen governance is sharp and exacting, the people are fractious and lacking.\n*(Establishing laws and making rewards and punishments clear to restrain deceit and artifice is called \"sharp and exacting.\" Distinctions and divisions breed contention among the people. Thus it is said: \"the people are fractious and lacking.\")*\n\nDisaster!—Fortune leans upon it.\nFortune!—Disaster lurks within it.\nWho knows their limit?\nThere is no fixed standard.\n*(Who knows the ultimate in good governance? Only when there is nothing to be corrected, nothing to be shaped—dull and unobtrusive, yet all under heaven is transformed—is this the limit.)*\n\nUprightness reverts to cunning.\n*(Governing with uprightness soon leads to cunning in warfare. Thus it is said: \"Uprightness reverts to cunning.\")*\nGoodness reverts to perversity.\n*(Establishing goodness to harmonize the myriad things soon leads to perverse calamities. Thus it is said: \"Goodness reverts to perversity.\")*\n\nThe people’s delusion has lasted long indeed!\n*(Han Feizi reads: \"Thus it has lasted long.\")*\nThe people’s delusion and loss of the Dao have endured for so long—\none cannot suddenly correct them with good governance.\n\nTherefore, the sage is square but does not cut,\n*(Using squareness to guide things, he sets aside their perversity but does not use squareness to carve them—what is called \"great square has no corners.\")*\nsharp but does not pierce,\n*(Sharpness here means clarity. To pierce is to wound. Using clarity to purify the people, he removes their perversity and filth but does not use clarity to wound them.)*\nstraight but does not stretch,\n*(Using straightness to guide things, he removes their crookedness but does not use straightness to provoke them—what is called \"great straightness seems bent.\")*\nbright but does not dazzle.\n*(Using brightness to illuminate what causes delusion, he does not use brightness to expose hidden faults—what is called \"the luminous Dao seems dark.\")*\nAll these honor the root and quiet the branches,\nnot attacking but restoring.\n\n**[Chapter 59]**\n\nIn governing people and serving heaven, nothing surpasses frugality.\n*(Nothing surpasses: nothing is better. Frugality: the farmer tending his fields removes what is excessive and returns to uniformity. Preserving nature, not hastening its decline, removing what causes decay—nothing better serves heaven’s mandate and pacifies the people.)*\n\nOnly frugality is called \"early alignment.\"\nEarly alignment means accumulating virtue.\n*(Only by accumulating virtue without seeking swift results can one achieve early alignment with constancy. Thus it is said: \"Early alignment means accumulating virtue.\")*\n\nAccumulating virtue leads to overcoming all—\nwhen nothing cannot be overcome, none know its limit.\n*(The Dao is boundless.)*\nWhen none know its limit, one can possess the state.\n*(To govern the state with what is finite is not truly possessing it.)*\n\nPossessing the mother of the state ensures long duration.\n*(What stabilizes the state is called its mother. Accumulating virtue is to plan for the root—only then can one tend the branches and secure their end.)*\nThis is called \"deep roots and firm foundation\"—\nthe Dao of long life and enduring vision.\n\n**[Chapter 60]**\n\nGoverning a great state is like cooking a small fish—\ndo not disturb it.\nAgitation brings harm; stillness preserves integrity.\nThus, the greater the state, the more still its ruler must be—\nonly then can he broadly win the people’s hearts.\n\nWhen the Dao is used to govern all under heaven, its ghosts have no spirit.\n*(Governing a great state is like cooking a small fish. When the Dao is used to govern all under heaven, its ghosts have no spirit.)*\n\nIt is not that the ghosts lack spirit—\ntheir spirit does not harm people.\n*(Spirit does not violate nature. When things abide in nature, spirit has nothing to add. When spirit has nothing to add, one does not perceive its spirit.)*",
      "overlap_context": "ancy. Without form, imperceptible to sight, it is called clarity.)*\n\nTo augment life is called ill-omen.\n*(Life cannot be augmented; to force augmentation is to invite premature death.)*\n\nWhen the heart commands *qi*, it is called force.\n*(The heart should remain empty; to command *qi* is to force it.)*\n\nWhen things reach their prime, they age—this is called not following the Dao.\nWhat does not follow the Dao perishes early.\n\n**[Chapter 56]**\n\nThose who know do not speak.\n*(They follow nature.)*",
      "start_char": 18570,
      "end_char": 19987,
      "start_sentence": 728,
      "end_sentence": 797,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.70021390914917,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 32,
      "original_text": "非其神不伤人圣人亦不伤人 道洽则神不伤人神不伤人则不知神之为神道洽则圣人亦不伤人圣人不伤人则不知圣人之为圣也犹云不知神之为神亦不知圣人之为圣也夫恃威网以使物者治之衰也使不知神圣之为神圣道之极也 夫两不相伤故德交归焉 神不伤人圣人亦不伤人圣人不伤人神亦不伤人故曰两不相伤也神圣合道交归之也 六十一章【案河上公注本此为谦德章】 大国者下流 江海居大而处下则百川流之大国居大而处下则天下流之故曰大国下流也 天下之交 天下所归防也",
      "translated_text": "Nonetheless, it is not that the spirits do not harm people—it is the sage who likewise does no harm.\nWhen the Dao flows harmoniously, spirits do no harm to people; when spirits do no harm, one ceases to perceive their numinosity.\nWhen the Dao flows harmoniously, the sage likewise does no harm; when the sage does no harm, one ceases to perceive his sageliness.\nThus, one no longer knows the numinosity of spirits or the sageliness of the sage.\nTo rely on coercive power to govern all things marks the decline of governance.\nTo render the numinosity of spirits and the sageliness of the sage imperceptible—this is the ultimate perfection of the Dao.\n\nAs neither harms the other, their virtues intermingle and return as one.\nSpirits do not harm people; the sage likewise does no harm. The sage does not harm people; spirits likewise do no harm. Hence it is said: \"Neither harms the other.\"\nWhen spirits and sages unite with the Dao, their virtues converge and return.\n\n**[Chapter 61]**\n\nA great state is like the lower reaches of a river—\njust as the Yangtze and the sea, vast yet dwelling below, draw the hundred streams to flow into them,\nso too does a great state, vast yet dwelling below, draw all under heaven to flow toward it.\nThus it is said: \"A great state is like the lower reaches.\"\n\nThe convergence of all under heaven—\nthis is the defense to which all return.",
      "overlap_context": "st be—\nonly then can he broadly win the people’s hearts.\n\nWhen the Dao is used to govern all under heaven, its ghosts have no spirit.\n*(Governing a great state is like cooking a small fish. When the Dao is used to govern all under heaven, its ghosts have no spirit.)*\n\nIt is not that the ghosts lack spirit—\ntheir spirit does not harm people.\n*(Spirit does not violate nature. When things abide in nature, spirit has nothing to add. When spirit has nothing to add, one does not perceive its spirit.)*",
      "start_char": 19987,
      "end_char": 20217,
      "start_sentence": 798,
      "end_sentence": 806,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.248297929763794,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 33,
      "original_text": "天下之牝 静而不求物自归之也 牝常以静胜牡以静为下 以其静故能为下也牝雌也雄躁动贪欲雌常以静故能胜雄也以其静复能为下故物归之也 故大国以下小国 大国以下犹云以大国下小国 则取小国 小国则附之 小国以下大国则取大国 大国纳之也 故或下以取或下而取 言唯修卑下然后乃各得其所 大国不过欲兼畜人小国不过欲入事人夫两者各得其所欲大者宜为下 小国修下自全而已不能令天下归之大国修下则天下归之故曰各得其所欲则大者宜为下也六十二章【案河上公注本此为为道章】 道者万物之奥 奥犹暧也可得庇防之辞",
      "translated_text": "The female of all under heaven—\nstill and not seeking, yet things naturally come to her.\nThe female ever prevails over the male through stillness, ever abides below through stillness.\nThrough her stillness, she is able to be below.\n\nThe female is the yielding; the male, restless and driven by desire.\nThe female ever prevails over the male through stillness.\nThrough her stillness, she is again able to be below—\nthus do things come to her.\n\nTherefore, when a great state humbles itself before a small state,\nit wins the small state’s allegiance.\nWhen a small state humbles itself before a great state,\nit is received by the great state.\nThus, some humble themselves to win; some humble themselves and are won.\n\nIt is said: only by cultivating lowliness can each attain its proper place.\nA great state desires no more than to shelter and nurture others;\na small state desires no more than to enter into service.\nWhen both attain what they desire,\nthe greater should abide below.\n\n**[Chapter 62]**\n\nThe Dao is the profound mystery of the ten thousand things—\na shelter, a refuge, a place of warmth and protection.",
      "overlap_context": "harms the other.\"\nWhen spirits and sages unite with the Dao, their virtues converge and return.\n\n**[Chapter 61]**\n\nA great state is like the lower reaches of a river—\njust as the Yangtze and the sea, vast yet dwelling below, draw the hundred streams to flow into them,\nso too does a great state, vast yet dwelling below, draw all under heaven to flow toward it.\nThus it is said: \"A great state is like the lower reaches.\"\n\nThe convergence of all under heaven—\nthis is the defense to which all return.",
      "start_char": 20217,
      "end_char": 20489,
      "start_sentence": 807,
      "end_sentence": 822,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.362537145614624,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 34,
      "original_text": "善人之宝 宝以为用也 不善人之所保 保以全也 美言可以市尊行可以加人 言道无所不先物无有贵于此也虽有珍宝璧马无以匹之美言之则可以夺众货之贾故曰美言可以市也尊行之则千里之外应之故曰可以加于人也 人之不善何弃之有 不善当保道以免放 故立天子置三公 言以尊行道也 虽有拱璧以先驷马不如坐进此道 此道上之所云也言故立天子置三公尊其位重其人所以为道也物无有贵于此者故虽有拱抱宝璧以先驷马而进之不如坐而进此道也 古之所以贵此道者何不曰以求得有罪以免耶故为天下贵 以求则得求以免则得免无所而不施故为天下贵也 六十三章【案河上公注本此为恩始章】 为无为事无事味无味 以无为为居以不言为教以恬淡为味治之极也 大小多少报怨以德 小怨则不足以报大怨则天下之所欲诛顺天下之所同者德也 图难于其易为大于其细天下难事必作于易天下大事必作于细是以圣人终不为大故能成其大夫轻诺必寡信多易必多难是以圣人犹难之 以圣人之才犹尚难于细易况非圣人之才而欲忽于此乎故曰犹难之也 故终无难矣 六十四章【案河上公注本此为守防章】 其安易持其未兆易谋 以其安不忘危持之不忘亡谋之无功之势故曰易也 其脆易泮【案脆释文云一作脆】其防易散 虽失无入有以其防脆之故未足以兴大功故易也此四者皆慎终也不可以无之故而不持不可以防之故而弗散也无而弗持则生有焉防而不散则生大焉故虑终之患如始之祸则无败事 为之于未有 谓其安未兆也",
      "translated_text": "The good person treasures it as a treasure to be used;\nthe not-good person clings to it as a safeguard to preserve life.\nFair words can be traded for esteem,\nnoble conduct can be extended to others—\nnothing precedes the Dao,\nnothing in the world is more precious than this.\nThough one possess treasures of jade and teams of horses,\nnone can compare to it.\nFair words can outbid all other goods in the marketplace—\nthus it is said: fair words can be traded.\nNoble conduct evokes response from a thousand miles away—\nthus it is said: it can be extended to others.\nHow can one abandon those who are not good?\nEven the not-good should be sheltered by the Dao to avoid exile.\nThus the Son of Heaven is established, the Three Dukes appointed—\nthis is how the Dao is honored through noble conduct.\nThough one lead with jade disks and teams of horses,\nit is not equal to sitting and advancing this Dao.\nThis is what the highest mean by the Dao.\nThus the Son of Heaven is established, the Three Dukes appointed,\ntheir positions exalted, their persons revered—\nall to serve the Dao.\nNothing in the world is more precious than this.\nTherefore, though one present jade disks and lead with teams of horses,\nadvancing it is not equal to sitting and advancing this Dao.\nWhy was this Dao prized in ancient times?\nDid they not say: by seeking it, one obtains;\nby relying on it, one avoids punishment?\nThus it is treasured by all under heaven.\nThrough seeking, one attains what is sought;\nthrough reliance, one attains exemption—\nnothing is left unapplied.\nThus it is treasured by all under heaven.\n\n**[Chapter 63]**\n\nAct without acting,\nattend without attending,\ntaste without tasting.\nDwell in non-action,\nteach without words,\nfind flavor in tranquility—\nthis is the perfection of governance.\nRespond to small with small, to much with little;\nrepay resentment with virtue.\nA small grievance does not warrant repayment,\na great grievance invites the world’s condemnation—\nwhat all under heaven share in common is virtue.\nAddress difficulty while it is still easy,\nhandle greatness while it is still small.\nThe difficult affairs of the world arise from the easy,\nthe great affairs of the world arise from the small.\nThus the sage never attempts greatness\nand thereby achieves greatness.\nOne who makes light promises will lack trust,\none who treats much as easy will encounter much difficulty.\nThus the sage regards even the easy as difficult—\nwith the sage’s talent, still they find the small and easy challenging,\nhow much more so for one without the sage’s talent who would neglect this?\nThus it is said: they regard it as difficult.\nIn the end, there will be no difficulty.\n\n**[Chapter 64]**\n\nWhat is secure is easy to maintain,\nwhat shows no sign is easy to plan for—\nfor in security one does not forget danger,\nin maintaining one does not forget loss,\nin planning one does not overlook the potential for failure.\nThus it is said: it is easy.\nWhat is fragile is easy to dissolve,\nwhat is minute is easy to scatter—\nthough nothing has entered, something arises;\nthough nothing has formed, greatness emerges.\nThis is because of their fragility and minuteness,\nwhich prevent the accomplishment of great deeds.\nThus they are easy.\nThese four are matters of vigilance to the end—\none cannot neglect maintenance because nothing is present,\nnor fail to scatter because nothing has formed.\nIf nothing is maintained, something will arise;\nif nothing is scattered, greatness will emerge.\nThus, contemplate the perils of the end as one does the calamities of the beginning,\nand there will be no failed affairs.\nAct before things arise—\nthis means in security, before signs appear.",
      "overlap_context": "eived by the great state.\nThus, some humble themselves to win; some humble themselves and are won.\n\nIt is said: only by cultivating lowliness can each attain its proper place.\nA great state desires no more than to shelter and nurture others;\na small state desires no more than to enter into service.\nWhen both attain what they desire,\nthe greater should abide below.\n\n**[Chapter 62]**\n\nThe Dao is the profound mystery of the ten thousand things—\na shelter, a refuge, a place of warmth and protection.",
      "start_char": 20489,
      "end_char": 21130,
      "start_sentence": 823,
      "end_sentence": 851,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.343498468399048,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 35,
      "original_text": "治之于未乱 谓防脆也 合抱之木生于毫末九层之台起于累土千里之行始于足下为者败之执者失之 当以慎终除微慎微除乱而以施为治之形名执之反生事原巧辟滋作故败失也 是以圣人无为故无败无执故无失民之从事常于几成而败之 不慎终也 慎终如始则无败事是以圣人欲不欲不贵难得之货好欲虽防争尚为之兴难得之货虽细贪盗为之起也 学不学复众人之所过 不学而能者自然也喻于不学者过也故学不学以复众人之过 以辅万物之自然而不敢为 六十五章【案河上公注本此为淳德章】 古之善为道者非以明民将以愚之 明谓多见巧诈蔽其朴也愚谓无知守真顺自然也 民之难治以其智多 多智巧诈故难治也 故以智治国国之贼 智犹治也以智而治国所以谓之贼者故谓之智也民之难治以其多智也当务塞兑闭门令无知无欲而以智术动民邪心既动复以巧术防民之伪民知其术防随而避之思惟密巧奸伪益滋故曰以智治国国之贼也 不以智治国国之福知此两者亦稽式【案河上公注本稽作楷下同】常知稽式是谓德德深矣远矣 稽同也今古之所同则不可废能知稽式是谓德德深矣远矣 与物反矣 反其真也",
      "translated_text": "Governing in the absence of disorder means preventing fragility.\nA tree of arm-span girth grows from a tender shoot;\na nine-tiered terrace rises from a basket of earth;\na journey of a thousand miles begins with a single step.\nThose who act fail;\nthose who grasp lose.\nThus, by vigilance at the end one eliminates the minute,\nand by eliminating disorder through non-action,\nthe forms and names of governance—when grasped—\ninstead generate affairs.\nThe root of craftiness and deceit flourishes,\nhence failure and loss.\nTherefore, the sage practices non-action and so does not fail,\nholds nothing and so does not lose.\nThe people, in their undertakings,\noften fail when nearly complete—\nthis is due to lack of vigilance at the end.\nIf one is as vigilant at the end as at the beginning,\nthere will be no failed affairs.\nThus, the sage desires what others do not desire\nand does not prize goods hard to obtain.\nThough desire is restrained, contention still arises;\nthough goods are trifling, greed and theft still emerge.\nTo learn what others do not learn is to redress the common transgression.\nNot learning yet possessing ability is natural;\nto be compared to those who do not learn is a fault.\nThus, learning what others do not learn\nredresses the common transgression\nand assists the self-so of the myriad things without daring to act.\n\nChapter Sixty-Five\nIn ancient times, those skilled in the Way\ndid not enlighten the people but sought to make them simple.\n\"Enlightenment\" means seeing much and crafty deceit,\nwhich obscures their simplicity.\n\"Simplicity\" means being without cunning, preserving truth,\nand following the natural.\nThe people are difficult to govern because of their many wiles.\nWith much cunning and deceit, they are hard to govern.\nThus, governing a state with cleverness is the state’s bane—\n\"cleverness\" here means governance.\nTo govern a state with cleverness is called its bane\nbecause the people are difficult to govern due to their many wiles.\nOne should block their openings and shut their doors,\ncausing them to be without knowledge or desire,\nand move them with clever techniques.\nOnce their devious hearts are stirred,\none attempts to restrain their falsity with crafty methods.\nThe people, knowing these restraints, evade them with deeper schemes,\nand deceit and falsity flourish all the more.\nThus it is said: governing a state with cleverness is the state’s bane.\nNot governing a state with cleverness is the state’s blessing.\nKnowing these two is also a model.\nTo constantly know the model is called profound virtue.\nProfound virtue is deep and far-reaching.\nIt moves counter to things,\nreturning to their truth.",
      "overlap_context": "nt the accomplishment of great deeds.\nThus they are easy.\nThese four are matters of vigilance to the end—\none cannot neglect maintenance because nothing is present,\nnor fail to scatter because nothing has formed.\nIf nothing is maintained, something will arise;\nif nothing is scattered, greatness will emerge.\nThus, contemplate the perils of the end as one does the calamities of the beginning,\nand there will be no failed affairs.\nAct before things arise—\nthis means in security, before signs appear.",
      "start_char": 21130,
      "end_char": 21618,
      "start_sentence": 852,
      "end_sentence": 872,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.27892255783081,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 36,
      "original_text": "然后乃至大顺 六十六章【案河上公注本此为后已章】 江海所以能为百谷王者以其善下之故能为百谷王是以欲上民必以言下之欲先民必以身后之是以圣人处上而民不重处前而民不害是以天下乐推而不厌以其不争故天下莫能与之争 六十七章【案河上公注本此为三宝章】 天下皆谓我道大似不肖夫唯大故似不肖若肖久矣其细也夫 久矣其细犹曰其细久矣肖则失其所以为大矣故曰若肖久矣其细也夫 我有三宝持而保之一曰慈二曰俭三曰不敢为天下先慈故能勇 夫慈以陈则胜以守则固故能勇也 俭故能广 节俭爱费天下不匮故能广也 不敢为天下先故能成器长【案器韩非子作事】 唯后外其身为物所归然后乃能立成器为天下利为物之长也 今舍慈且勇 且犹取也",
      "translated_text": "Then one attains great compliance.\n\nThe rivers and seas can be kings of the hundred valleys\nbecause they are good at being below them—\nthus they can be kings of the hundred valleys.\nTherefore, if one wishes to be above the people,\none must speak as though below them;\nif one wishes to lead the people,\none must place oneself behind them.\nThus the sage abides above yet the people do not feel burdened,\nstands ahead yet the people do not feel harmed.\nTherefore the world delights in exalting him without weariness.\nBecause he does not contend,\nno one in the world can contend with him.\n\nThe world all says my Dao is great, yet it seems unworthy.\nPrecisely because it is great, it seems unworthy.\nIf it were worthy, it would long since have become small.\nFor long it would have been small—\nthis is to say, if it were worthy, it would lose what makes it great.\nThus it is said: if it were worthy, it would long since have become small.\n\nI possess three treasures that I hold and preserve:\nthe first is called compassion,\nthe second is called frugality,\nthe third is called not daring to be first in the world.\nCompassion enables courage—\nfor with compassion, one triumphs in battle and stands firm in defense,\nthus enabling courage.\nFrugality enables breadth—\nby practicing restraint and cherishing resources,\nthe world does not become depleted, thus enabling breadth.\nNot daring to be first in the world enables one to become the vessel’s elder—\nonly by putting oneself last and relinquishing one’s person\ndoes one become the refuge of all things;\nthen one can establish and complete the vessel,\nbecoming the world’s benefit and the elder of all things.\n\nNow, if one abandons compassion and yet seeks courage,\nthis is merely grasping.",
      "overlap_context": "d,\none attempts to restrain their falsity with crafty methods.\nThe people, knowing these restraints, evade them with deeper schemes,\nand deceit and falsity flourish all the more.\nThus it is said: governing a state with cleverness is the state’s bane.\nNot governing a state with cleverness is the state’s blessing.\nKnowing these two is also a model.\nTo constantly know the model is called profound virtue.\nProfound virtue is deep and far-reaching.\nIt moves counter to things,\nreturning to their truth.",
      "start_char": 21618,
      "end_char": 21940,
      "start_sentence": 873,
      "end_sentence": 886,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.489678859710693,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 37,
      "original_text": "舍俭且广舍后且先死矣夫慈以战则胜 相慜而不避于难故胜也 以守则固天将救之以慈卫之 六十八章【案河上公注本此为配天章】 善为士者不武 士卒之帅也武尚先陵人也 善战者不怒 后而不先应而不唱故不在怒 善胜敌者不与 不与争也 善用人者为之下是谓不争之德是谓用人之力用人而不为之下则力不为用也 是谓配天古之极 六十九章【案河上公注本此为用章】 用兵有言吾不敢为主而为客不敢进寸而退尺是谓行无行 彼遂不止 攘无臂扔无敌 行谓行陈也言以谦退哀慈不敢为物先用战犹行无行攘无臂执无兵扔无敌也言无有与之抗也 执无兵祸莫大于轻敌轻敌几丧吾宝 言吾哀慈谦退非欲以取强无敌于天下也不得已而卒至于无敌斯乃吾之所以为大祸也宝三宝也故曰几亡吾宝 故抗兵相加哀者胜矣 抗举也加当也哀者必相惜而不趣利避害故必胜七十章【案河上公注本此为知难章】 吾言甚易知甚易行天下莫能知莫能行 可不出户窥牖而知故曰甚易知也无为而成故曰甚易行也惑于躁欲故曰莫之能知也迷于荣利故曰莫之能行也 言有宗事有君 宗万物之宗也君万物之主也 夫唯无知是以不我知 以其言有宗事有君之故故有知之人不得不知之也 知我者希则我者贵 唯深故知之者希也知我益希我亦无匹故曰知我者希则我者贵也 是以圣人懐玉 者同其尘懐玉者宝其真也圣人之所以难知以其同尘而不殊懐玉而不渝故难知而为贵也七十一章【案河上公注本此为知病章】 知不知上不知知病 不知知之不足任则病也",
      "translated_text": "Abandoning frugality yet seeking breadth,\nforsaking humility yet striving to be first—\nthis is death.\nFor with compassion, one triumphs in battle—\nmoved by mutual care, none shirks peril, thus victory.\nWith compassion, one stands firm in defense—\nHeaven will save and shield with compassion.\n\n**Chapter Sixty-Eight**\nThe true warrior is not martial—\nmartiality exalts aggression and domination.\nThe master of battle is not wrathful—\nacting only after others, responding without provocation, thus free from anger.\nThe one who conquers the enemy does not contend—\nnot engaging in struggle.\nThe one who employs others humbles himself—\nthis is called the virtue of non-contention,\nthis is called the power of employing others’ strength.\nEmploy others without humbling oneself,\nand their strength will not be put to use.\nThis is called matching Heaven, the ultimate of antiquity.\n\n**Chapter Sixty-Nine**\nIn warfare, there is a saying:\n\"I dare not act as host but as guest,\ndare not advance an inch but retreat a foot.\"\nThis is called advancing without advancing,\nrepelling without arms,\nseizing without weapons,\nresisting without enemies—\nmoving as if in formation yet without formation,\nraising arms as if armless,\ngrasping weapons as if weaponless,\nfacing foes as if no foe stands before you.\nFor there is no greater disaster than underestimating the enemy—\nunderestimating the enemy nearly forfeits my treasures.\nThus when armies clash in equal force,\nthe side moved by sorrow prevails—\nfor they cherish one another and do not pursue gain or flee harm.\n\n**Chapter Seventy**\nMy words are exceedingly easy to know,\nexceedingly easy to practice,\nyet none in the world can know them,\nnone can practice them.\nThey can be known without stepping beyond the door or peering through the window—\nthus I say they are easy to know.\nThey are accomplished through non-action—\nthus I say they are easy to practice.\nYet deluded by restlessness and desire,\nnone can know them.\nBewildered by glory and profit,\nnone can practice them.\nMy words have a source, my affairs have a lord—\nthe source is the origin of all things,\nthe lord is the master of all things.\nOnly through ignorance do they fail to know me.\nThose who know me are rare,\nthus I am esteemed—\nfor profound understanding is scarce,\nand those who grasp me are few, making me peerless.\nTherefore the sage wears coarse cloth yet holds jade—\nwearing coarse cloth, he blends with the dust,\nholding jade, he treasures his truth.\nThe sage is difficult to know because he mingles with the world yet remains distinct,\ncherishes his truth without alteration—\nthus he is difficult to know and held in esteem.\n\n**Chapter Seventy-One**\nTo know yet appear not to know is supreme;\nnot to know yet claim to know is a flaw.\nOnly by recognizing this flaw as a flaw\ncan one be free from flaw.",
      "overlap_context": "ugality enables breadth—\nby practicing restraint and cherishing resources,\nthe world does not become depleted, thus enabling breadth.\nNot daring to be first in the world enables one to become the vessel’s elder—\nonly by putting oneself last and relinquishing one’s person\ndoes one become the refuge of all things;\nthen one can establish and complete the vessel,\nbecoming the world’s benefit and the elder of all things.\n\nNow, if one abandons compassion and yet seeks courage,\nthis is merely grasping.",
      "start_char": 21940,
      "end_char": 22600,
      "start_sentence": 887,
      "end_sentence": 919,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.561557054519653,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 38,
      "original_text": "夫唯病病是以不病圣人不病以其病病是以不病【案韩非子作圣人之不病也以其病病是以无病也】 七十二章【案河上公注本此为爱己章】 民不畏威则大威至无狎其所居无厌其所生 清浄无为谓之居谦后不盈谓之生离其清浄行其躁欲弃其谦后任其威权则物扰而民僻威不能复制民民不能堪其威则上下大溃矣天诛将至故曰民不畏威则大威至无狎其所居无厌其所生言威力不可任也 夫唯不厌 不自厌也 是以不厌 不自厌是以天下莫之厌 是以圣人自知不自见 不自见其所知以耀光行威也 自爱不自贵 自贵则物狎厌居生 故去彼取此 七十三章【案河上公注本此为任为章】 勇于敢则杀 必不得其死也",
      "translated_text": "Only by recognizing the flaw as a flaw\ncan one be free from flaw.\nThe sage is free from flaw\nbecause he recognizes the flaw as a flaw—\nthus he is free from flaw.\n\n**Chapter Seventy-Two**\nWhen the people do not fear power,\nthen great power arrives.\nDo not encroach upon their dwelling,\ndo not oppress their livelihood.\nTo dwell in clarity and stillness is called \"dwelling,\"\nto remain humble and unfilled is called \"livelihood.\"\nAbandoning clarity to act with haste,\nforsaking humility to wield power—\nthen things are disturbed and the people turn perverse.\nPower can no longer restrain them;\nthe people cannot endure its weight,\nand thus above and below collapse entirely.\nHeaven’s punishment will come—\nthus it is said:\nWhen the people do not fear power,\nthen great power arrives.\nDo not encroach upon their dwelling,\ndo not oppress their livelihood—\nthis means power must not be wielded recklessly.\n\nOnly by not oppressing,\nby not oppressing oneself,\ncan one avoid oppression.\nNot oppressing oneself,\nthus the world does not oppress him.\nTherefore the sage knows himself but does not display himself,\ndoes not flaunt his knowledge to dazzle or overawe.\nHe cherishes himself but does not exalt himself—\nfor self-exaltation invites encroachment and oppression.\nThus he discards that and embraces this.\n\n**Chapter Seventy-Three**\nCourage in daring leads to killing,\nand one will surely not die a natural death.",
      "overlap_context": " peerless.\nTherefore the sage wears coarse cloth yet holds jade—\nwearing coarse cloth, he blends with the dust,\nholding jade, he treasures his truth.\nThe sage is difficult to know because he mingles with the world yet remains distinct,\ncherishes his truth without alteration—\nthus he is difficult to know and held in esteem.\n\n**Chapter Seventy-One**\nTo know yet appear not to know is supreme;\nnot to know yet claim to know is a flaw.\nOnly by recognizing this flaw as a flaw\ncan one be free from flaw.",
      "start_char": 22600,
      "end_char": 22899,
      "start_sentence": 920,
      "end_sentence": 935,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.358124256134033,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 39,
      "original_text": "勇于不敢则活 必齐命也 此两者或利或害 俱勇而所施者异利害不同故曰或利或害也 天之所恶孰知其故是以圣人犹难之 孰谁也言谁能知天下之所恶意故耶其唯圣人夫圣人之明犹难于勇敢况无圣人之明而欲行之也故曰犹难之也 天之道不争而善胜 天唯不争故天下莫能与之争 不言而善应 顺则吉逆则凶不言而善应也 不召而自来 处下则物自归 繟然而善谋 垂象而见吉凶先事而设诚安而不忘危未召而谋之故曰繟然而善谋也 天网恢恢疏而不失 七十四章【案河上公注本此为制惑章】 民不畏死奈何以死惧之若使民常畏死而为奇者吾得执而杀之孰敢 诡异乱群谓之奇也 常有司杀者杀夫代司杀者杀是谓代大匠斲【案河上公注本作夫代司杀者是谓代大匠斲】夫代大匠斲者希有不伤其手矣为逆顺者之所恶忿也不仁者人之所疾也故曰常有司杀也 七十五章【案河上公注本此为贪损章】 民之饥以其上食税之多是以饥民之难治以其上之有为是以难治民之轻死以其求生之厚是以轻死夫唯无以生为者是贤于贵生 言民之所以僻治之所以乱皆由上不由其下也民从上也 七十六章【案河上公注本此为戒强章】 人之生也柔弱其死也坚强万物草木之生也柔脆其死也枯槁故坚强者死之徒柔弱者生之徒是以兵强则不胜 强兵以暴于天下者物之所恶也故必不得胜 木强则兵 物所加也 强大处下 木之本也 柔弱处上 枝条是也",
      "translated_text": "Courage in refraining brings life,\nand one will surely align with fate.\nThese two—though both are courage—\ndiffer in their application,\nand thus their outcomes diverge:\none brings benefit, the other harm.\nThus it is said: some bring benefit, some bring harm.\n\nWho knows the reason for Heaven’s aversion?\nEven the sage finds this difficult.\nWho can fathom what Heaven abhors?\nOnly the sage—yet even his clarity hesitates before the peril of reckless daring.\nHow much more so for those lacking the sage’s insight,\nwho yet presume to act?\nThus it is said: even the sage finds this difficult.\n\nThe Way of Heaven does not contend, yet excels in victory.\nPrecisely because it does not contend,\nnone in the world can contend with it.\nIt does not speak, yet responds with perfect accord—\ncompliance brings fortune, defiance brings misfortune,\nthough it utters no word.\nIt does not summon, yet things come of their own accord—\nabiding in lowliness, all things return to it.\nVast and unhurried, it excels in planning—\nrevealing omens to foretell fortune or misfortune,\npreparing in advance with sincerity,\nat peace yet never forgetting peril.\nBefore being summoned, it has already devised strategy—\nthus it is said: vast and unhurried, it excels in planning.\n\nHeaven’s net is vast and wide,\nloose yet never failing.\n\n**Chapter Seventy-Four**\nIf the people do not fear death,\nhow can death be used to frighten them?\nIf one could make the people constantly fear death,\nand for those who act perversely seize and kill them—\nwho would dare?\nThose who stir chaos and disrupt the multitude are called \"perverse.\"\nThere is always one who executes—\nbut to take the executioner’s place is to hew in the master carpenter’s stead.\nFew who hew in the master carpenter’s stead\nescape injury to their own hands.\nTo act against the natural order is what the compliant abhor,\nwhat the virtueless provoke others to resent.\nThus it is said: there is always one who executes.\n\n**Chapter Seventy-Five**\nThe people’s hunger arises from their superiors consuming excessive taxes—\nthis is why they hunger.\nThe people’s unruliness arises from their superiors’ excessive action—\nthis is why they are unruly.\nThe people’s disregard for death arises from their excessive pursuit of life—\nthis is why they disregard death.\nOnly one who does not make life his pursuit\nis wiser than one who values life.\nThe people’s perversity and the world’s disorder\nall stem from above, not below—\nthe people follow their superiors.\n\n**Chapter Seventy-Six**\nWhen a person is alive, they are supple and weak;\nin death, they are rigid and strong.\nAll things—plants and trees—\nin life are soft and fragile;\nin death, they are withered and brittle.\nThus the rigid and strong are companions of death,\nwhile the supple and weak are companions of life.\nTherefore, when armies are strong, they do not prevail—\nfor violent strength in arms is what all things abhor,\nand thus it cannot triumph.\nWhen wood is strong, it is felled—\nfor it invites the axe’s blade.\nThe strong and great abide below—\nthis is the root of the tree.\nThe supple and weak abide above—\nthese are the branches.",
      "overlap_context": " not oppressing,\nby not oppressing oneself,\ncan one avoid oppression.\nNot oppressing oneself,\nthus the world does not oppress him.\nTherefore the sage knows himself but does not display himself,\ndoes not flaunt his knowledge to dazzle or overawe.\nHe cherishes himself but does not exalt himself—\nfor self-exaltation invites encroachment and oppression.\nThus he discards that and embraces this.\n\n**Chapter Seventy-Three**\nCourage in daring leads to killing,\nand one will surely not die a natural death.",
      "start_char": 22899,
      "end_char": 23503,
      "start_sentence": 936,
      "end_sentence": 966,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.109767198562622,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 40,
      "original_text": "七十七章【案河上公注本此为天道章】 天之道其犹张弓与高者抑之下者举之有余者损之不足者之天之道损有余而不足人之道则不然与天地合德乃能包之如天之道如人之量则各有其身不得相均如惟无身无私乎自然然后乃能与天地合德 损不足以奉有余孰能有余以奉天下唯有道者是以圣人为而不恃功成而不处其不欲见贤 言唯能处盈而全虚损有以无和光同尘荡而均者唯其道也是以圣人不欲示其贤以均天下七十八章【案河上公注本此为任信章】 天下莫柔弱于水【案河上公注本作天下柔弱莫过于水】而攻坚强者莫之能胜其无以易之 以用也其谓水也言用水之柔弱无物可以易之也 弱之胜强柔之胜刚天下莫不知莫能行是以圣人云受国之垢是谓社稷主受国不祥是为天下王正言若反 七十九章【案河上公注本此为任契章】 和大怨必有余怨 不明理其契以致大怨已至而德和之其伤不复故有余怨也 安可以为善是以圣人执左契 左契防怨之所由生也 而不责于人有德司契 有德之人念思其契不念怨生而后责于人也 无德司彻 彻司人之过也 天道无亲常与善人 八十章【案河上公注本此为独立章】 小国寡民 国既小民又寡尚可使反古况国大民众乎故举小国而言也 使有什伯之器而不用【案什伯下河上公注本及各本俱有人字】 言使民虽有什伯之器而无所用何患不足也 使民重死而不远徙 使民不用惟身是宝不贪货赂故各安其居重死而不远徙也 虽有舟舆无所乘之虽有甲兵无所陈之使人复结绳而用之甘其食美其服安其居乐其俗邻国相望鸡犬之声相闻民至老死不相徃来 无所欲求 八十一章【案河上公注本此为显质章】 信言不美 实在质也",
      "translated_text": "**Chapter Seventy-Seven**\nThe Way of Heaven—is it not like the drawing of a bow?\nWhat is high is pressed down,\nwhat is low is raised up.\nWhat has excess is diminished,\nwhat is deficient is supplemented.\nThe Way of Heaven diminishes excess and supplements deficiency.\nThe way of man is otherwise:\nit diminishes the deficient to serve the excess.\nWho can take excess and serve the world?\nOnly one who holds the Dao.\nThus the sage acts without claiming,\nachieves without abiding—\nhe does not wish to display his worth.\n\nTo dwell in fullness yet preserve emptiness,\nto diminish excess and supplement deficiency,\nto harmonize light and merge with dust,\nto level and equalize—\nonly the Dao accomplishes this.\nThus the sage does not display his worth to equalize the world.\n\n**Chapter Seventy-Eight**\nNothing in the world is softer or weaker than water,\nyet in attacking the hard and strong, nothing surpasses it—\nnothing can take its place.\nIts use is this:\nthe weak overcomes the strong,\nthe soft overcomes the hard.\nIn the world, none do not know this,\nyet none can practice it.\nThus the sage says:\n“One who bears the nation’s disgrace\nis called the lord of the altars of soil and grain;\none who bears the nation’s misfortune\nis called the king of all under heaven.”\nTrue words seem their opposite.\n\n**Chapter Seventy-Nine**\nIn reconciling great enmity, some enmity must remain.\nHow can this be considered good?\nThus the sage holds the left tally\nand does not demand from others.\nThe virtuous tend the tally,\nthe unvirtuous tend the tax.\nThe Way of Heaven shows no partiality—\nit ever aligns with the good.\n\n**Chapter Eighty**\nLet the state be small, its people few.\nThough there be tools for ten or a hundred,\nlet them not be used.\nLet the people regard death as weighty\nand not wander far.\nThough there be boats and carriages,\nlet none ride them;\nthough there be armor and weapons,\nlet none display them.\nLet the people return to knotting cords for use.\nLet them savor their food,\nfind beauty in their clothing,\nbe content in their dwellings,\ndelight in their customs.\nThough neighboring states are within sight,\nand the sounds of dogs and roosters are heard,\nthe people will grow old and die\nwithout ever traveling between them—\nwithout desire.\n\n**Chapter Eighty-One**\nTruthful words are not fine,\nfine words are not truthful.\nThe real lies in substance.",
      "overlap_context": "—\nin life are soft and fragile;\nin death, they are withered and brittle.\nThus the rigid and strong are companions of death,\nwhile the supple and weak are companions of life.\nTherefore, when armies are strong, they do not prevail—\nfor violent strength in arms is what all things abhor,\nand thus it cannot triumph.\nWhen wood is strong, it is felled—\nfor it invites the axe’s blade.\nThe strong and great abide below—\nthis is the root of the tree.\nThe supple and weak abide above—\nthese are the branches.",
      "start_char": 23503,
      "end_char": 24204,
      "start_sentence": 967,
      "end_sentence": 995,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.4329514503479,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 41,
      "original_text": "美言不信 本在朴也 善者不辩辩者不善知者不博 极在一也 博者不知圣人不积 无私自有唯善是与任物而已 既以为人己愈有 物所尊也 既以与人己愈多 物所归也 天之道利而不害 动常生成之也 圣人之道为而不争 顺天之利不相伤也 王弼老子道德经二卷真得老子之学欤盖严君平指归之流也 其言仁义与礼不能自用必待道以用之天地万物各得于一岂特有功于老子哉 凡百学者盖不可不知乎 此也 予于是知弼本深于老子而易则末矣 其于易多假诸老子之防而老子无资于易者其有余不足之迹断可见也 呜呼学其难哉 弼知佳兵者不祥之器至于战胜以丧礼处之非老子之言乃不知常善救人故无弃人常善救物故无弃物独得诸河上公而古本无有也 赖傅奕能辩之尔然弼题是书曰道德经不析乎 道德而上下之犹近于古欤其文字则多误谬殆有不可读者令人惜之尝谓弼之于老子张湛之于列子郭象之于庄子杜预之于左氏范之于谷梁毛苌之于诗郭璞之于尔雅完然成一家之学后世虽有作者未易加也 予既缮写弼书并以记之政和乙未十月丁丑嵩山晁之鄜畤记 咸平圣语有曰老子道德经治世之要明皇解虽灿然可观王弼所注言简意深真得老氏清浄之防克自此求弼所注甚力而近世希有盖久而后得之徃岁摄建宁学官尝以刋行既又得晁以道先生所题本不分道德而上下之亦无篇目克喜其近古缮写藏之乾道庚寅分教京口复镂板以传若其字之谬讹前人已不能证克焉敢辄易姑俟夫知者三月二十四日左从事郎充镇江府府学教授熊克谨记 老子道德经下篇",
      "translated_text": "The fair-spoken are not truthful—\ntheir root lies in simplicity.\nThe good do not dispute;\nthe disputatious are not good.\nThe knowing are not broad—\ntheir utmost lies in the One.\nThe broad are not knowing.\nThe sage does not accumulate,\nyet by being selfless, possesses all;\nhe merely aligns with the good,\nletting things take their course.\nHaving acted for others, he himself gains more—\nthus things honor him.\nHaving given to others, he himself abounds—\nthus things turn toward him.\n\nThe Way of Heaven benefits and does no harm,\never moving to generate and complete.\nThe Way of the sage acts yet does not contend,\nfollowing Heaven’s benefit without mutual injury.\n\nWang Bi’s *Laozi Daodejing* in two scrolls truly grasps the learning of Laozi—akin to the lineage of Yan Junping’s *Zhigui*. His words on benevolence, righteousness, and ritual, which cannot function on their own but must rely on the Dao to be employed, show how heaven, earth, and the myriad things each attain the One. How could his merit be limited to Laozi alone? All scholars must surely know this.\n\nHerein I recognize that Bi’s grasp of the *Laozi* was profound, while his *Zhouyi* was secondary. In the *Zhouyi*, he often borrowed from Laozi’s safeguards, whereas Laozi needed no recourse to the *Zhouyi*—the traces of his excess and deficiency are plainly visible. Alas, how difficult learning is! Bi knew that fine weapons are ill-omened implements, yet when it came to \"treating victory in war with mourning rites,\" these were not Laozi’s words. He did not understand that \"constantly excelling in saving people, thus none are abandoned; constantly excelling in saving things, thus none are discarded.\" This he derived solely from Heshang Gong, though the ancient text lacked it. Fortunately, Fu Yi was able to discern this.\n\nYet Bi titled his work *Daodejing* without dividing it into \"Dao\" and \"Virtue\" as upper and lower parts—this was closer to antiquity. However, its text contains many errors and corruptions, some nearly unreadable, which is lamentable.\n\nI have often said that Bi’s *Laozi*, Zhang Zhan’s *Liezi*, Guo Xiang’s *Zhuangzi*, Du Yu’s *Zuozhuan*, Fan Ning’s *Guliang*, Mao Chang’s *Book of Songs*, and Guo Pu’s *Erya* each form a complete school of learning. Though later scholars may produce works, they cannot easily surpass them.\n\nHaving transcribed Bi’s text, I record this here. Written on the dingchou day of the tenth month in the yiwei year of the Zhenghe era (1115), by Chao Gongwu of Songshan, at Fuzhi.\n\nThe *Holy Words of Xianping* state: \"The *Laozi Daodejing* is the essential guide for governing the world.\" Though the Emperor Minghuang’s commentary is resplendent and worthy of admiration, Wang Bi’s annotations, with their concise language and profound meaning, truly capture the pure and tranquil safeguards of Laozi’s teaching. From this, one may seek it. Bi’s commentary was diligently pursued, yet rare in recent times—only after a long time was it obtained.\n\nIn former years, while serving as acting educational official in Jianning, I once had it printed. Later, I acquired the edition annotated by Master Chao Yidao, which did not divide \"Dao\" and \"Virtue\" into upper and lower parts, nor did it include chapter divisions. I rejoiced in its closeness to antiquity and transcribed it for preservation. In the gengyin year of the Qiandao era (1170), while teaching in Jingkou, I had it block-printed for transmission. As for its textual errors and corruptions, earlier scholars were unable to verify them—how dare I presume to alter them? I can only await those with true knowledge.\n\nRespectfully recorded on the twenty-fourth day of the third month by Xiong Ke, Left Assistant Gentleman and Professor of the Jingkou Prefecture School. *Laozi Daodejing*, Lower Scroll.",
      "overlap_context": "here be armor and weapons,\nlet none display them.\nLet the people return to knotting cords for use.\nLet them savor their food,\nfind beauty in their clothing,\nbe content in their dwellings,\ndelight in their customs.\nThough neighboring states are within sight,\nand the sounds of dogs and roosters are heard,\nthe people will grow old and die\nwithout ever traveling between them—\nwithout desire.\n\n**Chapter Eighty-One**\nTruthful words are not fine,\nfine words are not truthful.\nThe real lies in substance.",
      "start_char": 24204,
      "end_char": 24823,
      "start_sentence": 996,
      "end_sentence": 1022,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.236709117889404,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（晋王弼）.txt",
        "category": "藏外"
      }
    }
  ]
}