{
  "source_id": "老子道德经（河上公撰）",
  "source_file": "chunked_daozang\\老子道德经（河上公撰）.json",
  "total_chunks": 50,
  "total_original_chars": 26103,
  "total_translated_chars": 104699,
  "total_translation_time": 607.4119985103607,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
    "category": "藏外"
  },
  "full_translation": "The Imperial *Complete Library of the Four Treasuries*\n*Masters Section, Fourteenth Division: Commentaries on the Laozi*\n*Daoist School*\n*Abstract*\n\nWe, your ministers, respectfully note: The *Commentary on the Laozi* in two fascicles, as transmitted in old editions, is attributed to Heshang Gong. Chao Gongwu’s *Record of Reading* states: \"The Grand Historian [Sima Qian] said that the teachings of Laozi were transmitted twice before reaching Gai Gong, who was the teacher of Cao Shen, Chancellor of Qi.\" Yet Ge Hong claimed: \"Heshang Gong’s name is unknown. During the reign of Emperor Wen of Han, he dwelled by the Yellow River. The Gentleman-in-Attendance Pei Zhu reported his mastery of the *Laozi*, and the emperor visited him to receive the *Plain Book of the Daoist Canon*.\" These two accounts differ, and we follow the Grand Historian’s version.\n\nUpon examination, Chao’s citation derives from the *Postface to the Biography of Yue Yi* in the *Records of the Grand Historian*, which traces the lineage in detail. However, the *Bibliographic Treatise* of the *Book of Sui* records: \"*Laozi’s Dao and Virtue Sutra* in two fascicles, with a commentary by Heshang Gong from the time of Emperor Wen of Han,\" and further notes: \"During the Liang, there existed a *Commentary on the Laozi* in two fascicles by Heshang Gong of the Warring States period, now lost.\" Thus, the two Heshang Gongs were distinct individuals, and the two commentaries on the *Laozi* were separate works. The Warring States Heshang Gong’s book was already lost by the Sui, and the version now transmitted is indeed the work of the Han Heshang Gong.\n\nThe Ming scholar Zhu Dongguang’s edition of this text attributes it to a \"man of Qin,\" though this lacks thorough verification. Given that Emperor Wen personally visited the riverbank to receive the book, it is inconceivable that it would not have entered the imperial archives. Yet Liu Xiang’s *Seven Summaries* lists three commentators on the *Laozi* but omits Heshang Gong’s name. Moreover, Kong Yingda’s *Correct Meaning of the Record of Rites* states: \"Ma Rong, in his commentary on the *Rites of Zhou*, sought to spare students the effort of reading two texts and thus appended the original text. Since the Later Han, commentaries have been interspersed with the main text.\" How, then, could this book—composed in the Western Han—already feature annotations embedded within each sentence?\n\nThe *Old唐书* records that Liu Ziyuan, finding no *Heshang Gong Commentary on the Laozi*, sought to abolish it in favor of Wang Bi’s version. Even earlier, Lu Deming’s *Exegesis of the Classics* adopted Ge Hong’s account from the *Biographies of Divine Transcendents* in its preface, lacking critical discernment, yet the edition it annotated did not use Heshang Gong’s commentary but Wang Bi’s. Both were eminent scholars of their eras; their stance was surely not baseless. Upon close examination, the diction and phrasing of this text do not resemble Han-style prose. It is likely a later forgery by Daoist adherents, though its long circulation has yielded some insights. For now, we retain it as one school of interpretation.\n\nRespectfully submitted after collation in the tenth month of the forty-second year of the Qianlong reign.\n*Chief Compilers:*\n*Minister* Ji\n*Minister* Lu Feixiong\n*Minister* Sun Shiyi\n\n**Chief Collators:**\n*Minister* Lu Feichi\n\n**Original Preface to the *Laozi Daodejing***\n\nLaozi embodies spontaneity, arising of itself, born before the Great Void, emerging from Non-Being. Through the passage of heaven and earth, from beginning to end, it cannot be named or described; ending in Non-Ending, exhausting Non-Exhaustion, reaching Non-Ultimate—thus it is Non-Ultimate. Aligning with the Great Dao, it transforms in kind, establishing heaven and earth, rooting itself and spreading qi throughout the ten directions. Embracing the utmost purity of virtue and power, vast and boundless, it defies naming. Radiant, it possesses pattern; towering, it achieves success; profound, it cannot be measured; majestic, it stands as the ancestor of divine luminaries. The Three Lights depend on it for illumination; heaven and earth receive it to attain life. Qian and Kun revolve to exhale its essence. Lofty yet without subjects, noble yet without rank, it covers and sustains without end, expounding its teachings to the eight directions. The myriad heavens universally venerate the Great Dao. Before the opening of creation, it descended to serve as the state’s teacher, continuing unceasingly through the ages. None can comprehend it, yet it crafts the ten thousand things without speech—such is its mysterious virtue.\n\nThus, all sages revere it. The Dao is honored, virtue is prized, for none commands it, yet it is ever spontaneous. Is this not Laozi alone? In the Zhou era, he again manifested as a divine being, born of Mother Li, emerging from her left side. At birth, he was already hoary, hence named Laozi. The name Laozi arises from the mysterious, existing before heaven and earth, without age or decline—thus it is called Laozi. The world believes Laozi began in the Zhou dynasty, yet the name Laozi originated in measureless kalpas past. Its depths are obscure, its remoteness vast and enduring.\n\nAs the age declined and the Great Dao waned, he journeyed west through the world. Guanling Yin Xi said, “The Great Dao is about to withdraw. I beg you to compose a book.” Thereupon, he wrote the *Daodejing* in two scrolls, the *Five Thousand Characters*, comprising the Upper and Lower Classics. These five thousand characters proclaim the source of virtue and power, encompassing the great without omission and penetrating the minute without exclusion. They are the scripture of heaven and humanity’s spontaneity.\n\nMy former teacher said: “Diligently study it, and your voice will resonate with the Great Ultimate. Chant it in lofty tones, and the heavens will rejoice. Carry it in harmony with the immortals. In still contemplation, await the true, and the myriad wonders will respond. Inwardly observe form and shadow, and spirit and qi will abide long. Embrace virtue and power, and the ten thousand spirits will submit. Disasters vanish in the Nine Yin; blessings arise in the Ten Directions. The state is pacified, the family is secured—who can comprehend this? The text of non-action is not defiled by pollution, not adorned by glory, not disturbed by turmoil, not clarified by stillness. It is spontaneous.\n\nResponding to the Dao, it appears; its transmission is inexhaustible and eternal. Thus, to know the constant is called illumination. What is the Great Dao’s purpose? Its purity arises from humanity. How can one not strive for utmost refinement?”\n\nI have roughly set forth this preface. Only those with the Dao will treasure it.\n*Composed by Left Immortal of the Great Ultimate, Ge Xuan.*\n\nSomeone asked: “After the Six Classics, the books of the various masters emerged. Why is only the *Five Masters* circulated today?” I replied: “Laozi and Zhuangzi exhaust the mystery of the Dao. Xunzi, Yangzi, and Wen Zhongzi elucidate the essentials of the Dao. How could they not be circulated?”\n\nI have heard that Xunzi’s writings distinguish between Confucians and Mohists; Yangzi’s *Fa Yan* models itself on the *Analects*; Wen Zhongzi’s *Discourses on the Six Classics* further illuminate the Way of the Former Kings.\n\nIf Laozi’s *Dao and Virtue* arise from nothingness and culminate in the boundless, their current flows in stillness. Yet Zhuangzi’s parables equalize self and other, life and death—how can their excesses and absurdities be discussed alongside those who elucidate the sagely Dao? I say: not so. The Dao has its subtleties and grossness; learning has its roots and branches. The *Great Change* begins with thoughtlessness and non-action, yet only by exhausting principle and fulfilling nature does it commence. The *Great Learning* begins with stillness and stability, yet only by investigating things and extending knowledge does it commence. The teachings of the three masters—Xunzi, Yangzi, and Wen Zhongzi—proceed thus: from root to branch, from gross to subtle.\n\nWithout observing the images, how can one grasp the *Change*? Without embodying form and nature, how can one realize Heaven? To speak of subtlety while neglecting the gross, to abandon the root while seeking the branch—such is the discourse of Laozi and Zhuangzi. The learning of sages and worthies, in broad strokes, is built from the ground up; Laozi and Zhuangzi, however, take a direct path, leaping to the heights. Thus Ge Xuan called them \"the root of Heaven and Earth,\" for they embody the spontaneity of the Dao. Guo Xiang spoke of them as illuminating the Way of inner sageliness and outer kingship, all while resting in effortless attainment. How could those who merely dabble in the Dao ever reach such heights?\n\nLearning culminates in the Dao; the Dao culminates in subtlety. If scholars take Xunzi’s writings on Confucianism and Daoism and expound upon them, they may attain the effortless governance of the kingly Way. If they refine themselves through Yangzi’s *Fa Yan*, they may unite with the Dao in wordless harmony. If they expand upon Wen Zhongzi’s learning of the *Six Classics*, they may enrich their minds with the *Six Classics* themselves. Only then will Laozi’s natural Heaven and Zhuangzi’s realm of self-attainment be realized.\n\nAs for those who wish to study their works, they must first examine their own minds.\n\n*Composed by Gong Shixie of Shilu, three days before the Dragon Boat Festival in the first year of the Jingding era.*\n*Imperially Commissioned Complete Library of the Four Treasuries, Volume: Laozi Daode Jing*\n\n**Dao Jing**\n*He Shang Gong’s Chapter and Verse, First Scroll*\n1. Embracing the Dao\n2. Nurturing the Body\n3. Pacifying the People\n4. Without Source\n5. The Use of Emptiness\n6. Forming Images\n7. Concealing Radiance\n8. Transforming Nature\n9. Moving with the Barbarians\n10. The Power to Act\n11. Uselessness\n12. Restraining Desires\n13. Disdaining Shame\n14. Praising the Origin\n15. Manifesting Virtue\n16. Returning to the Root\n\n*He Shang Gong’s Chapter and Verse, Second Scroll*\n17. Pure Wind\n18. The Shallowness of Customs\n19. Returning to Simplicity\n20. Different Customs\n21. Emptying the Mind\n22. The Benefit of Humility\n23. Emptiness and Nothingness\n24. The Bitterness of Favor\n25. The Image of the Origin\n26. Honoring Virtue\n27. Skillful Use\n28. Returning to Simplicity\n29. Non-Action\n30. Frugality in Warfare\n31. Laying Down Arms\n32. Sagely Virtue\n33. Discerning Virtue\n34. Entrusting Completion\n35. Benevolent Virtue\n36. Subtle Illumination\n37. Governing\n\n**De Jing**\n*He Shang Gong’s Chapter and Verse, Third Scroll*\n38. On Virtue\n39. The Root of the Law\n40. Abandoning Use\n41. Sameness and Difference\n42. The Transformations of the Dao\n43. Universal Application\n44. Establishing Precepts\n45. Vast Virtue\n46. Moderating Desires\n47. Mirroring the Distant\n48. Forgetting Knowledge\n49. Entrusting Virtue\n50. Honoring Life\n51. Cultivating Virtue\n52. Returning to the Origin\n53. Increasing Evidence\n54. Cultivating Observation\n55. The Mysterious Talisman\n56. Mysterious Virtue\n57. Pure Wind\n58. Following Transformations\n59. Guarding the Dao\n\n*He Shang Gong’s Chapter and Verse, Fourth Scroll*\n60. Occupying Position\n61. The Virtue of Humility\n62. Practicing the Dao\n63. The Beginning of Grace\n64. Guarding the Subtle\n65. Pure Virtue\n66. Putting Oneself Last\n67. The Three Treasures\n68. Matching Heaven\n69. The Use of the Mysterious\n70. Knowing Difficulty\n71. Knowing Illness\n72. Loving Oneself\n73. Entrusting Action\n74. Controlling Delusion\n75. The Harm of Greed\n76. Warning Against Strength\n77. The Way of Heaven\n78. Entrusting Trust\n79. Entrusting the Covenant\n80. Standing Alone\n81. Revealing Essence\n\n**Laozi’s Dao and Virtue Classic: Chapter Titles**\n*Imperially Commissioned Siku Quanshu, Volume*\n*Laozi’s Dao Classic, Volume One*\n*He Shang Gong’s Chapter and Verse, First Scroll*\n\n1. **Embodying the Dao**\n   *Dao that can be spoken of* 【refers to the Dao of classical arts, governance, and teachings】\n   *is not the eternal Dao* 【not the natural Dao of long life; the eternal Dao should be nurtured through non-action to cultivate spirit, through non-interference to pacify the people, by containing radiance and concealing brilliance, erasing traces and hiding origins—it cannot be named as Dao】\n   *Name that can be named* 【refers to wealth, honor, nobility, and worldly renown】\n   *is not the eternal name* 【not the naturally enduring name; the eternal name is like an infant who has not yet spoken, an egg that has not yet divided, a luminous pearl within an oyster, a fine jade embedded in stone—internally bright, externally appearing dull and unrefined】\n\n   *Nameless, it is the origin of Heaven and Earth* 【\"Nameless\" refers to the Dao, which is formless and thus cannot be named; \"origin\" is the root of the Dao, which emits qi, spreads transformation, and emerges from emptiness and nothingness as the origin of Heaven and Earth】\n   *Named, it is the mother of the myriad things* 【\"Named\" refers to Heaven and Earth, which possess form and position, yin and yang, softness and hardness—these are their names; \"mother of the myriad things\" means Heaven and Earth contain qi to generate, nurture, and mature the myriad things, like a mother raising her child】\n\n   *Thus, constantly without desire, observe its mystery* 【\"Mystery\" is the essential; one who is constantly without desire can perceive the essence of the Dao—this essence is the One】\n   *Constantly with desire, observe its manifestations* 【\"Manifestations\" are the returns; one who is constantly with desire can observe the tendencies to which worldly customs return】\n   *These two emerge together yet have different names* 【\"These two\" refer to having desire and being without desire; \"emerge together\" means they arise from the same human heart, yet \"have different names\" because their designations differ—being without desire is called \"enduring,\" while having desire is called \"self-destruction\"】\n   *Together they are called the Mysterious* 【\"Mysterious\" is Heaven; those with desire and those without desire alike receive qi from Heaven】\n   *Mysterious within the Mysterious* 【Heaven contains yet another Heaven; receiving qi may be thick or thin—those who obtain harmony and nourishing fluids give birth to the worthy and sagely, while those who receive disorder and defilement give birth to the greedy and licentious】\n   *The gate of the myriad mysteries* 【To know that Heaven contains another Heaven and that received qi may be thick or thin, to eliminate emotions and desires, and to preserve harmony—this is called the gate and doorway to knowing the essentials of the Dao】\n\n2. **Nurturing Life**\n\nAll under Heaven know beauty as beauty—【self-praise that makes one’s excellence manifest】—this is already ugliness.【It brings peril and ruin.】\nAll know goodness as goodness—【it brings merit and fame】—this is already not goodness.【It is what people contend over.】\nThus, being and non-being give rise to each other;【seeing being, one acts as non-being】\ndifficulty and ease complete each other;【seeing difficulty, one acts as ease】\nlong and short shape each other;【seeing shortness, one acts as length】\nhigh and low incline toward each other;【seeing height, one acts as lowness】\nsound and echo harmonize;【the superior intones, the inferior must respond】\nbefore and after follow each other.【the superior advances, the inferior must follow】\nTherefore, the sage abides in non-action,【governing by the Dao】\npractices wordless teaching,【instructing by personal example】\nand lets the myriad things arise【each moving of itself】\nwithout refusal,【not refusing or obstructing】\ngives life without possession,【the primal qi gives life to the myriad things yet does not possess them】\nacts without reliance,【what the Dao accomplishes is not relied upon for recompense】\ncompletes works without dwelling.【Having completed works and achieved affairs, one retreats and does not occupy the position.】\nOnly by not dwelling【only by not occupying the position after success】\ndoes one not depart.【Virtue and blessing remain constantly with one, never leaving the person. This speaks of how what is not done cannot be followed, and what is not spoken cannot be known—just as the six preceding lines on high and low, long and short, all open from one source, and from that source a hundred branches arise, their transformations without end, yet none cause disorder.】\n\n**Pacifying the People (Chapter 3)**\nDo not exalt the worthy,【\"Worthy\" refers to worldly worthies—those skilled in eloquence, versed in literature, who depart from the Dao in conduct, employ stratagems, and abandon substance for ornament. \"Do not exalt\" means not enriching them with emoluments or ennobling them with office.】\nso that the people do not contend;【they do not contend for merit and fame, returning to naturalness】\ndo not prize rare and hard-to-obtain goods,【the ruler does not hoard treasures, gold, or jade, but casts them into mountains and abysses】\nso that the people do not become thieves;【when superiors are pure and tranquil, inferiors are without greed】\ndo not display what may be desired,【banish licentious music and keep beauties at a distance】\nso that the people’s hearts are not confused.【they are not licentious or deluded】\nThus, the sage governs:【the sage’s governance of the state is the same as governance of the self】\nempties their hearts,【eliminates cravings and dispels confusion and vexation】\nfills their bellies,【embraces the Dao and holds to the One, guarding the five spirits】\nweakens their ambitions,【is gentle, yielding, and humble, not occupying positions of power】\nstrengthens their bones.【cherishes essence and values bestowal, so that marrow is full and bones are firm】\nAlways causes the people to be without knowledge and without desire,【returns to simplicity and preserves purity】\nso that those with knowledge dare not act.【thoughts are deep, and one does not speak lightly】\nAct through non-action,【do not contrive or act arbitrarily, but follow what is natural】\nand nothing will not be governed.【Virtue is profound and transformation is deep; the hundred clans are at peace.】\n\n**Without Source (Chapter 4)**\nThe Dao is empty, yet its use is inexhaustible.【\"Empty\" means centered. The Dao conceals its name and hides its reputation; its use lies in the center.】\nIt seems never full.【\"Seems\" means \"constantly.\" The Dao is constantly humble and empty, never full.】\nAbysmal! It seems the ancestor of the myriad things.【The Dao is profound and unfathomable; it seems to be the ancestor of the myriad things.】\nBlunt its sharpness,【\"Sharpness\" means aggressive advancement. When people desire to advance sharply in pursuit of merit and fame, one should blunt and restrain them, for this is not the way of the Dao.】\nuntangle its tangles,【\"Tangles\" are knotted roots. One should contemplate the Dao’s non-action to untie them.】\nsoften its brilliance,【Though one may have unique insights, one should act as if dim and dull, not using one’s radiance to confuse others.】\nblend with its dust.【One should share the same dust and grime as the common people, not setting oneself apart.】\nDeep and clear! It seems ever-present.【One should be profoundly tranquil and serene, thus able to endure long and not be forgotten.】\nI do not know whose child it is—【Laozi says: I do not know from what it was born.】\nit seems to have existed before the Lord-on-High.【The Dao existed before Heaven and Earth. This says the Dao was born before Heaven and Earth. To this day, it endures because it can be tranquil, serene, and free from toil and desire, enabling people to cultivate themselves by modeling the Dao.】\n\n**Vacuity and Use (Chapter 5)**\nHeaven and Earth are not benevolent;【Heaven bestows and Earth transforms, not employing benevolence or kindness, but following naturalness.】\nthey treat the myriad things as straw dogs.【Heaven and Earth give life to the myriad things; humans are the most noble, yet Heaven and Earth regard them as straw dogs, not expecting recompense.】\nThe sage is not benevolent;【The sage cherishes and nurtures the myriad people, not employing benevolence or kindness, but following Heaven and Earth’s naturalness.】\nhe treats the hundred clans as straw dogs.【The sage regards the hundred clans as straw dogs, not expecting their courtesy or gratitude.】\nThe space between Heaven and Earth—【The space between Heaven and Earth is empty, and harmonious qi flows through it, so the myriad things are born of themselves. If people can eliminate emotions and desires, moderate flavors, and purify the five viscera, then numinous clarity will reside within.】\nis it not like a bellows?【The bellows is empty within yet can produce sound and qi.】\nEmpty yet not exhausted,【When empty, it is not depleted;】\nmoved, it brings forth more.【when agitated, it produces even more.】\nMuch speech leads to frequent exhaustion;【Many affairs harm the spirit; many words harm the body. When the mouth opens and the tongue moves, calamity must follow.】\nit is better to guard the center.【It is better to guard virtue within, nurturing the spirit, cherishing qi, and practicing few words.】\n\n**Forming Images (Chapter 6)**\nThe valley spirit does not die;【\"Valley\" means nourishment. If one can nourish the spirit, it will not die. The \"spirit\" refers to the spirits of the five viscera: the liver stores the ethereal soul, the lungs store the corporeal soul, the heart stores the spirit, the kidneys store essence, and the spleen stores the will. If the five viscera are all harmed, the five spirits depart.】\nthis is called the Mysterious Female.【The reason it does not die lies in the Mysterious Female. \"Mysterious\" is Heaven; in humans, it is the nose. \"Female\" is Earth; in humans, it is the mouth. Heaven feeds humans with the five qi, which enter through the nose and are stored in the heart. The five qi are clear and subtle, becoming spirit, intelligence, voice, and the five natures; their numinous aspect is called the ethereal soul. The ethereal soul is yang and governs ingress and egress; humans’ noses communicate with Heaven, so the nose is called \"Mysterious.\" Earth feeds humans with the five flavors, which enter through the mouth and are stored in the stomach. The five natures are turbid and thick, becoming the physical form—bones, flesh, blood, and vessels; the six emotions are their numinous aspect, called the corporeal soul. The corporeal soul is yin and governs ingress and egress through the mouth, communicating with Heaven and Earth, so it is called \"Female.\"】\nThe gate of the Mysterious Female is called the root of Heaven and Earth.【\"Root\" means origin.】\n\nThe gates of nose and mouth are where the primordial qi of Heaven and Earth comes and goes. Ceaseless yet seemingly present—nasal exhalations and inhalations should be gentle and subtle, as if existing yet also as if not. Use it without strain: the qi should always be relaxed and unhurried, never urgent or labored.\n\nChapter Seven: Concealing Radiance\nHeaven and Earth endure. Heaven and Earth are able to be long and enduring because they do not live for themselves. Thus they are able to live long. Therefore the sage places himself behind, yet finds himself ahead; sets himself outside, yet finds himself preserved. Is it not because he is selfless? Thus he is able to fulfill his self.\n\nChapter Eight: Transforming Nature\n\nThe Highest Virtue Resembles Water\n\nThe highest virtue resembles water’s nature. Water benefits the myriad things yet contends not, dwelling where the multitude shuns. Thus it nearly accords with the Dao. In abode, it favors the low ground; in heart, it favors the deep and still; in giving, it favors generosity; in speech, it favors truth; in governance, it favors order; in service, it favors competence; in movement, it favors timeliness. Only because it does not contend does it remain free from blame.\n\n**Chapter Nine: Embracing Simplicity**\n\nTo hold and fill it to overflowing is not as good as stopping.\nTo carve and sharpen it cannot be long preserved.\nWhen gold and jade fill the hall, none can guard them.\nWealth and honor with arrogance bring self-inflicted ruin.\nWhen merit is achieved and fame attained, withdraw the self—this is the Dao of Heaven.\n\n**Chapter Ten: Nurturing Power**\n\nIn bearing the soul,\nembrace the One and never depart from it.\nConcentrate qi to attain suppleness,\nbe like the infant.\nPurify the profound mirror,\nand remain free from flaw.\nIn loving the people and governing the state,\nact without cunning.\nIn opening and closing the gates of Heaven,\nbe like the female.\nIn illuminating the four directions,\nact without knowledge.\n\nCarrying the soul—\nthe soul is the spirit and the corporeal soul.\nMan bears them above and thereby lives;\nthey must be cherished and nurtured.\nJoy and anger scatter the spirit,\nsudden fright harms the corporeal soul.\nThe spirit dwells in the liver,\nthe corporeal soul in the lungs.\nFine wine and rich meats corrupt liver and lungs,\nso when the spirit is tranquil and the will aligned with the Dao,\nthe mind is not disordered,\nthe corporeal soul is at peace,\nand longevity is attained.\n\nEmbracing the One without departing—\nman who embraces the One and does not depart from the body\nabides long.\nThe One is the primordial qi of Great Harmony,\nthe origin from which the Dao arises.\nThus it is said:\nThe One spreads its name throughout the world.\nHeaven attains the One and becomes clear,\nEarth attains the One and becomes stable,\nlords and kings attain the One and bring rectitude and peace.\nInwardly, it is the heart;\noutwardly, it is conduct;\nin bestowal, it is virtue—\nall are named the One.\nThe One means singleness of purpose, undivided.\n\nConcentrate qi to attain suppleness—\nguard the essence of qi without disorder,\nand the body will respond with softness and compliance.\n\nBe like the infant—\nlike the infant, inwardly free from thought,\noutwardly free from affairs,\nso that the spirit does not depart.\n\nPurify the profound mirror—\nwash the heart to make it pure and still.\nThe heart dwells in the profound and obscure,\nyet surveys and knows the myriad things—\nthus it is called the profound mirror.\n\nRemain free from flaw—\nfree from depravity,\npure and without blemish.\n\nIn loving the people and governing the state—\nhe who governs the body loves qi, and the body is preserved;\nhe who governs the state loves the people, and the state is secure.\n\nAct without knowledge—\nhe who governs the body regulates breath and essence,\nallowing no sound to reach the ears.\nHe who governs the state bestows kindness and virtue,\nallowing no awareness below.\n\n---\n\nThe celestial gate opens and closes—\nthe celestial gate refers to the Purple Tenuity Palace at the North Star;\nopening and closing mark the five junctures of beginning and end.\nIn governing the body, the celestial gate refers to the nostrils:\nopening means inhalation and exhalation,\nclosing means breath held still.\n\nRemain without the feminine—\nin governing the body, be like the female: tranquil, still, soft, and yielding;\nin governing the state, respond to change with harmony, never taking the lead.\n\nLuminous clarity extends in all four directions—\nit is said to be so radiant and clear, like the sun and moon,\npervading all under heaven and beyond the eight directions.\nThus it is called: \"seen yet unseen, heard yet unheard,\"\nmanifesting throughout the ten directions,\nbrilliant and resplendent.\n\nRemain without knowledge—\nnone can know the Way that fills all under heaven.\n\nIt gives life and nurtures—\nthe Dao gives life to the myriad things and nurtures them.\n\nIt gives life yet does not possess—\nthe Dao gives life to the myriad things yet claims no ownership.\n\nIt acts yet does not rely—\nthe Dao enacts its work yet expects no recompense.\n\nIt fosters growth yet does not dominate—\nthe Dao fosters the growth of the myriad things yet does not carve or shape them for use.\n\nThis is called profound virtue—\nthe Dao’s virtue moves in profound obscurity, unseen.\nOne who would embody virtue must emulate the Dao.\n\nChapter Eleven: Uselessness\n\nThirty spokes converge upon a single hub—\nin ancient times, a chariot’s thirty spokes mirrored the moon’s count.\nThey converge upon one hub, for the hub has a hollow within,\nand thus the many spokes gather there.\nFor cultivating the body, one must dispel emotions and cast off desires,\nemptying the five viscera so that spirit may return to dwell within.\nFor governing the state, the few must unite the many,\nthe weak must empower the strong.\n\nYet it is by its very emptiness that the chariot serves its use—\n\"emptiness\" means the hollow within the hub,\nfor only when the hub is empty can the chariot move.\nThe carriage bed, too, is empty,\nso that one may load and bear upon it.\n\nKnead clay to fashion vessels—\n\"knead\" means to blend, \"clay\" means earth,\nblending earth to make vessels for food and drink.\nYet it is by its very emptiness that the vessel serves its use—\nonly when the vessel is hollow can it hold and receive.\n\nCarve doors and windows to make a chamber—\nthis is to construct a dwelling.\nYet it is by its very emptiness that the chamber serves its use—\nthe doors and windows are empty, so one may enter and exit, look and see;\nthe chamber is empty, so one may dwell within.\nThus, what is present is for the sake of benefit—\nbenefit to things, for the vessel holds objects,\nthe chamber shelters people.\nOne fears the roof’s collapse, the belly’s loss of spirit,\nand dreads the decay of form.\n\nWhat is absent is for the sake of function—\nit is the hollow and empty that can receive and contain the myriad things.\nThus it is said: the void can master the formed,\nand the Dao is empty.\n\nThe five colors blind the eyes—\nto covet and indulge in beauty harms the essence and loses sight.\n\nThe five tones deafen the ears—\nto delight in the five sounds drives harmony from the heart,\nso one cannot hear the soundless sound.\n\nThe five flavors dull the mouth—\n\"dull\" means loss; when one craves the five flavors,\nthe mouth loses its speech and strays from the Dao’s savor.\n\nGalloping and hunting madden the heart—\nthe human spirit naturally favors stillness;\ngalloping and panting scatter the spirit, so madness arises.\n\nRare and precious goods obstruct conduct—\n\"obstruct\" means harm; rare goods are gold, silver, pearls, jade;\nwhen the heart covets and desires without satiety,\nconduct is harmed, the body shamed.\n\nThus the sage attends to the belly—\npreserving the five natures, shedding the six passions,\nrestraining the will, nurturing spirit and clarity—\nand not to the eyes—\nthe eyes must not gaze recklessly, for reckless gazing leaks essence outward.\n\nTherefore, discard that and take this—\ndiscard the eyes’ reckless gazing, take the belly’s nurturing of nature.\n\n---\n\nFavor and disgrace are both startling—\nthe body is favored, it startles; the body is disgraced, it startles.\n\nTo value great calamity is as if it were the self—\n\"value\" means to fear; \"as if\" means \"to reach\";\nto fear great calamity reaching the self, thus all startle.\n\nWhat is meant by favor and disgrace?\nDisgrace is lowly.\nTo gain it is startling—\ngaining favor and honor is startling, for one stands in high position as if over a deep abyss;\none dare not be arrogant in nobility, dare not be extravagant in wealth.\nTo lose it is startling—\nloss means losing favor and falling into disgrace;\nstartling means fearing disaster’s return.\n\nThis is what is meant by favor and disgrace both startling.\n\nWhat is meant by valuing great calamity as if it were the self?\nThe reason I have great calamity is that I have a self—\nhaving a self, I worry over toil and labor, think of hunger and cold;\nfollowing emotions and desires, I encounter misfortune.\nIf I had no self, what calamity would I have?\n\nThus, one who values the self to govern the world may be entrusted with the world—\nto say a ruler values the self and despises others,\ndesiring to be lord of the world, may be provisionally established,\nbut cannot endure long.\n\nOne who cherishes the self for the sake of the world may be entrusted with the world—\nto say a ruler can cherish the self not for personal gain,\nbut to be father and mother to the myriad people,\nthus becoming lord of the world, may be entrusted with the self above the myriad people,\nand long remain without fault.\n\n---\n\nLook and it cannot be seen—it is called \"subtle\";\nlisten and it cannot be heard—it is called \"rare\";\ngrasp and it cannot be held—it is called \"minute.\"\n\nThese three cannot be exhaustively questioned—\nthese three are subtle, rare, and minute;\n\"cannot be exhaustively questioned\" means:\nwithout color, without sound, without form,\nthe mouth cannot speak of it, writing cannot transmit it;\nit must be received in stillness, sought with spirit,\nand cannot be questioned to obtain it.\n\nThus they merge into one—\n\"merge\" means to unite the three names into one.\n\nAbove, it is not bright—\nto say the one in the heavens is not dazzlingly bright.\n\nBelow, it is not dark—\nto say the one in the earth is not dimly obscure.\n\nVast and boundless, it cannot be named—\n\"vast and boundless\" means moving and acting without end;\n\"cannot be named\" means it is not one color—\nit cannot be distinguished as green, yellow, white, or black;\nnot one sound—\nit cannot be heard as gong, shang, jue, zhi, or yu;\nnot one form—\nit cannot be measured as long or short, large or small.\n\nIt returns to nothingness—\n\"nothingness\" means no substance;\nit should return to no substance.\n\nThis is called the formless form—\nto say the one has no form yet can give form to the myriad things.\n\nThe image of no-thing—\nthe one has no substance yet sets forth the images of the myriad things.\n\nThis is called \"elusive and evanescent\"—\nthe one is elusive and evanescent, as if present, as if absent,\nand cannot be seen.\n\nMeet it and its beginning is not seen—\nthe one has no beginning or end, cannot be awaited in advance;\ncast aside emotions and desires, and the one naturally returns.\n\nFollow it and its end is not seen—\nto say the one leaves no traces, cannot be observed.\n\nGrasp the ancient Dao to steer the present being—\nthe sage holds fast to the ancient Dao, generates the one,\nto steer things and know that the present should have the one.\n\nTo know the ancient beginning is called the thread of the Dao.\n\nThose of old who were adept as scholar-officials—\nthey were rulers who attained the Dao, subtle and wondrous, penetrating the mysteries,\ntheir aspirations and integrity profound and marvelous, their essence in communion with Heaven.\nDeep beyond comprehension—\ntheir virtue and power ran so deep it could not be fathomed;\ninwardly they saw as if blind, turned their hearing back as if deaf,\nso none could perceive their excellence.\n\nOnly because they could not be fathomed were they forced to adopt appearances:\nhesitant, as if crossing a river in winter;\ncautious, as if fearing their four neighbors;\nsolemn, as if they were guests;\ndissolving, as ice about to melt;\nsimple, as uncarved wood;\nvast, as a valley;\nturbid, as muddied waters.\n\nWho can still the turbid and gradually clarify it?\nWho can remain at rest and through long movement gradually bring forth life?\nThose who preserve this Dao do not seek fullness.\nOnly by not being full can one remain concealed, not newly accomplished.\n\nReturning to the Root\n\nAttain utmost emptiness,\nhold fast to stillness with unwavering depth.\nThe myriad things arise together—\nI thereby observe their return.\nThings flourish in abundance,\nyet each returns to its root.\nReturning to the root is called stillness;\nthis is called restoring life.\nRestoring life is called the constant.\nTo know the constant is called illumination.\nNot knowing the constant leads to reckless action and misfortune.\nKnowing the constant brings capacity;\ncapacity leads to impartiality;\nimpartiality leads to kingship;\nkingship leads to Heaven;\nHeaven leads to the Dao;\nthe Dao leads to enduring.\nThough the body perishes, it does not face peril.\n\n**Pure Wind, Chapter Seventeen**\n\nIn the highest antiquity, the rulers were unknown to the people below.\nThe people merely knew of their existence but did not serve them as subjects—so simple and unadorned were they.\nNext came those whom the people cherished and praised,\nfor their virtue was visible and their kindness commendable.\nThen came those whom the people feared,\nfor they established laws and punishments to govern.\nFinally came those whom the people scorned,\nfor their prohibitions were many and commands burdensome, making sincerity impossible—thus they were deceived and mocked.\nWhen trust is insufficient, distrust arises.\nThe people respond to their ruler’s lack of trust with their own distrust, deceiving their lord.\n\nHow cautious were the rulers of the highest antiquity in their speech,\nfor they treasured words, fearing deviation from the Dao and loss of spontaneity.\nWhen their work was accomplished and affairs were settled—\nthe world at peace—\nthe common people all said, *\"We are naturally thus.\"*\nThey did not perceive the ruler’s virtue as profound but instead believed it to be simply as it should be.\n\n**The Decline of Custom, Chapter Eighteen**\n\nWhen the Great Dao is abandoned, benevolence and righteousness appear.\nIn the age of the Great Dao, every household had filial children, every door had loyalty and trust—benevolence and righteousness were unseen.\nWhen the Great Dao is forsaken and not practiced, wickedness and rebellion arise, and only then do benevolence and righteousness become worthy of transmission.\n\nWhen cunning and wisdom emerge, great deceit follows.\nThe ruler who values cleverness over virtue and words over substance will be met by the people with great falsity and treachery.\nWhen the six relations are in discord, filial piety and compassion arise.\nOnly when kinship is severed and relatives are estranged do filial piety and compassion become necessary to nurture one another.\nWhen the state is in chaos and disorder, loyal ministers appear.\nOnly when governance fails, superiors and inferiors resent one another, and the perverse contend for power do loyal ministers emerge to correct their lord.\n\nThis speaks of the world in great peace, where benevolence and righteousness are unknown, desires are absent, integrity is unneeded, and self-restraint is unrecognized.\nIn the age of the Dao’s rulers, benevolence and righteousness vanish, filial piety and compassion fade—like the sun at its zenith, when the stars lose their light.\n\n**Returning to Simplicity, Chapter Nineteen**\n\nAbandon sagacity,\nrejecting artificial craft and returning to the origin, preserving the primordial.\nThe Five Emperors’ symbols and Cang Jie’s script were not as good as the Three Sovereigns’ knotted cords and unadorned records.\nDiscard wisdom,\nforsaking cleverness and returning to non-action.\nThe people’s benefit will increase a hundredfold,\nfor agriculture will flourish and selfishness will vanish.\n\nAbandon benevolence, cast aside righteousness,\nrejecting the display of kindness and the exaltation of hollow trust.\nThe people will return to filial piety and compassion,\nfor virtue’s transformation will be pure.\nAbandon artifice, cast aside profit,\nrejecting deceit that distorts truth and blocking the paths of greed and the gates of power.\nThieves and bandits will cease to exist.\n\nThese three things—\nthe three matters to be abandoned—\nare deemed insufficient as cultural teachings.\nThus, let them be guided as follows:\n\nManifest plainness, embrace simplicity.\nTo manifest plainness is to hold fast to the unadorned and guard the true, not prizing embellishment.\nTo embrace simplicity is to display one’s sincerity and plainness, so that the people may take it as a model.\n\nReduce selfishness, diminish desires.\nTo reduce selfishness is to be upright and free of partiality.\nTo diminish desires is to know contentment.\n\n**Chapter Twenty: Divergent Customs**\n\nAbandon learning—\nwhat is not true does not accord with the Dao.\nWithout care—\ncasting aside superficial adornment, there is no anxiety.\n\nHow far apart are \"aye\" and \"nay\"?\nBoth are responses, yet how distant they are—\nthe age scorns substance and prizes ornament.\n\nHow far apart are good and evil?\nOne brings harmony and praise, the other remonstrance and contention—\nyet how distant they are!\nThe age loathes loyalty and uprightness, favoring flattery and deceit.\n\nWhat others fear, one cannot but fear—\nothers refer to those of the Dao.\nWhat they fear is the ruler who does not abandon learning.\nOne cannot but fear the approach of flattery that slays benevolence and worthies.\n\nVast and boundless, it has not yet reached its end—\nsome say the people of the world, disordered and reckless,\nrush to pursue learning and ornamentation, never ceasing.\n\nThe multitude, gleeful and wanton—\nlike feasting on a grand sacrifice,\ntheir desires insatiable,\nor ascending a spring terrace,\nwhere yin and yang commingle, the myriad things stirred,\nthey gaze upon it with intent, their wills licentious.\n\nI alone am still, without sign—\ntranquil and unmoved, no trace of desire’s form appears.\n\nLike an infant who has not yet learned to smile—\nlike a child who cannot yet respond to playthings.\n\nAdrift, as if with nowhere to return—\nI wander, like one destitute, with no place to settle.\n\nThe multitude all have more than enough—\ntheir wealth in excess, they indulge in extravagance,\ntheir cunning in excess, they practice deceit.\n\nYet I alone seem forsaken—\nas if cast aside, as though lacking.\n\nAh, the heart of this foolish one!\n\nI do not follow the vulgar, holding fast to the One without wavering—\nlike the heart of a fool.\n\nTurbid, turbid—\nwithout distinction.\n\nThe vulgar are bright and clear,\nwhile I alone seem dim.\n\nThe vulgar are sharp and keen,\nwhile I alone am dull and uncut.\n\nVast, like the sea—\nI drift, as though without end.\n\nAdrift, as though without halt—\nmy will abides in the realm of spirit.\n\nThe multitude all have their means,\nwhile I alone am stubborn,\nseeming crude.\n\nI alone differ from others,\nyet I honor the nourishment of the Mother.\n\n---\n\n**Emptiness and Receptivity (Chapter 21)**\nThe bearing of great virtue\nfollows only the Dao.\n\nAs for the Dao as a thing—\nit is vague, it is fleeting.\n\nFleeting, vague—\nwithin it there are images.\n\nVague, fleeting—\nwithin it there are things.\n\nProfound, obscure—\nwithin it there is essence.\n\nIts essence is most true,\nwithin it there is trustworthiness.\n\nFrom ancient times to the present,\nits name does not depart,\nby which we witness the origins of the myriad.\n\nHow do I know the origins of the myriad are thus?\nBy this.\n\n---\n\n**Increase Through Humility (Chapter 22)**\nTo bend is to be whole,\nto yield is to be straight.\n\nTo be hollow is to be filled,\nto be worn is to be renewed.\n\nTo have little is to gain,\nto have much is to be confounded.\n\nTherefore the sage embraces the One\nand becomes the model for the world.\n\nNot asserting oneself, thus one is enlightened;\nnot self-righteous, thus one is distinguished;\nnot boasting, thus one has merit;\nnot self-aggrandizing, thus one endures.\n\nIt is only because one does not contend\nthat none in the world can contend with them.\n\nThe ancient saying, \"To bend is to be whole,\"\nhow could it be empty words?\n\nTruly, to be whole is to return to it.\n\n---\n\n**Emptiness and Non-Being (Chapter 23)**\n\nSilent Harmony Follows Nature (Chapter 23)\n\nTo speak sparingly is to follow nature.\nA whirlwind does not last the morning;\na sudden storm does not last the day.\n\nWhat causes these?\nHeaven and earth.\nIf even heaven and earth cannot make them last,\nhow much less can man?\n\nThus, those who align with the Dao\nare one with the Dao.\nThose who align with virtue\nare one with virtue.\nThose who align with loss\nare one with loss.\n\nThose who are one with the Dao,\nthe Dao delights in them.\nThose who are one with virtue,\nvirtue delights in them.\nThose who are one with loss,\nloss delights in them.\n\nWhen trust is insufficient,\nthere is distrust.\n\nHow things naturally converge:\nlike sounds echoing,\nlike dragons following clouds,\nlike tigers following wind,\nlike water flowing to the wet,\nlike fire tending to the dry.\n\nHe Who Stands on Tiptoe Does Not Stand Firm (Chapter 24)\n\nHe who stands on tiptoe cannot stand long—\nthis means one who grasps for power and fame,\nseeking glory and advancement,\ncannot long maintain integrity or walk the Way.\n\nHe who strides cannot walk far—\nthis means one who deems himself noble\nand strides above others,\nis collectively obstructed and cannot proceed.\n\nHe who displays himself is not enlightened—\none who admires his own appearance as fine,\nor his own conduct as aligned with the Way,\nfails to recognize the baseness of his form and the vulgarity of his actions.\n\nHe who is self-righteous is not illustrious—\none who deems himself right and others wrong\nis collectively obscured and cannot be made manifest.\n\nHe who boasts achieves no merit—\nthis means one who constantly boasts of his achievements\nloses the merit he might have gained from others.\n\nHe who is self-aggrandizing does not endure—\none who takes pride in his own greatness\ncannot long persist.\n\nIn relation to the Way, these are called\n\"leftover food and parasitic conduct\"—\nthis describes those who are self-aggrandizing and boastful:\nin governing a state, they amass surplus emoluments,\nengaging in parasitic conduct.\n\nAll things detest them—\nsuch people, when in power, act with harmful intent,\nso there is nothing that does not fear and despise them.\n\nThus, those who possess the Way do not remain in such a place.\n\nImage and Origin (Chapter 25)\n\nThere exists a thing, chaotic yet complete,\nborn before heaven and earth.\nSilent, oh! Void, oh!\nStanding alone, unchanging.\nCircling endlessly, never weary—\nit may be called the Mother of all under heaven.\nI know not its name;\nI style it \"Dao.\"\nForced to name it, I say \"Great.\"\nGreat, it flows away;\nflowing away, it is distant;\ndistant, it returns.\nThus, the Dao is great, heaven is great,\nearth is great, and the king, too, is great.\nWithin the realm, there are Four Greats—\nthe Dao, heaven, earth, and the king.\nThe king occupies one among them.\n\nMan models himself on earth;\nearth models itself on heaven;\nheaven models itself on the Dao;\nthe Dao models itself on spontaneity.\n\n**Chapter 26: Valuing Virtue**\n\nValuing is the root of the classics.\nIf the ruler does not value virtue, he will not be revered;\nif one does not value virtue in cultivating the self, one loses spirit.\nThe blossoms of grasses and trees are light, thus they scatter and fall;\ntheir roots are weighty, thus they endure long.\n\nStillness is the lord of restlessness.\nIf the ruler is not still, he loses his majesty;\nif one is not still in cultivating the self, the self is imperiled.\nThe dragon is still, thus it can transform;\nthe tiger is restless, thus it suffers loss.\n\nTherefore, the sage travels all day\nyet does not depart from the weight of stillness.\nThough there be splendid palaces and tranquil chambers,\nhe remains aloof and distant.\n\nAlas! How could the lord of ten thousand chariots\ntreat his person lightly before all under heaven?\nTo act lightly is to lose one’s ministers;\nto act restlessly is to lose one’s throne.\nIf the ruler is frivolous, he loses his ministers;\nif one is frivolous in cultivating the self, one loses one’s essence.\nIf the ruler is restless, he loses his position;\nif one is restless in cultivating the self, one loses one’s spirit.\n\n**Chapter 27: Skillful Application**\n\nThe skillful traveler leaves no wheel tracks;\nthe skillful speaker utters no flaw or blame.\nThe skillful reckoner needs no counting rods or barriers;\nthe skillful closer uses no bolts or bars, yet none can open.\nThe skillful binder uses no cords or knots, yet none can untie.\n\nThus the sage is ever skillful in saving people,\nand so abandons no one.\nEver skillful in saving things,\nand so abandons nothing.\nThis is called inheriting the illumination.\n\nTherefore, the good person is the teacher of the not-good;\nthe not-good person is the resource of the good.\nOne who neither values their teacher\nnor cherishes their resource—\nthough wise, is greatly deluded.\nThis is called the essential subtlety.\n\n**Chapter 28: Returning to Simplicity**\n\nHe who knows the masculine yet keeps to the feminine\nbecomes the world’s valley stream.\nAs the world’s valley stream,\nhis constant virtue never departs,\nand he returns to the state of infancy.\n\nHe who knows the bright yet keeps to the dark\nbecomes the world’s model.\nAs the world’s model,\nhis constant virtue knows no flaw,\nand he returns to the boundless.\n\nHe who knows glory yet keeps to humility\nbecomes the world’s valley.\nAs the world’s valley,\nhis constant virtue is fulfilled,\nand he returns to simplicity.\n\nWhen simplicity is scattered, it becomes vessels;\nthe sage employs it to become the chief of officials.\nThus the great system makes no cuts.\n\nHe who would take the world and act upon it—\nI see that he will not succeed.\nThe world is a sacred vessel, not to be acted upon.\nTo act upon it is to mar it;\nto grasp it is to lose it.\n\nThus, beings may lead or follow,\nbreathe warm or cold,\nbe strong or weak,\nbear or destroy.\nTherefore the sage discards excess, extravagance, and indulgence.\n\n**Chapter 30: On Restraint in Warfare**\n\nOne who assists a ruler with the Dao\ndoes not dominate the world with arms.\nSuch affairs tend to rebound.\nWhere armies camp, thorns and brambles grow.\nAfter great wars, years of famine follow.\nThe skilled warrior achieves his aim and stops—\nhe dares not seize power by force.\nHe achieves his aim but does not boast,\nachieves his aim but does not vaunt,\nachieves his aim but does not dominate,\nachieves his aim only when compelled,\nachieves his aim but does not overreach.\nThings flourish and then decay—\nthis is called \"not the Dao.\"\nWhat is not the Dao soon perishes.\n\n**Chapter 31: On Laying Down Arms**\n\nFine weapons are instruments of ill omen—\nbeings may detest them.\nThus the man of Dao does not dwell among them.\nThe noble person values the left in peace,\nbut in war, the right.\nWeapons are instruments of ill omen,\nnot the noble person’s instruments.\nUsed only when unavoidable,\ntranquility and restraint are paramount.\nVictory is not glorified—\nto glorify it is to delight in killing.\nOne who delights in killing\ncannot achieve his will in the world.\n\nIn auspicious affairs, the left is honored;\nin inauspicious affairs, the right.\nThe deputy general stands on the left,\nthe commander on the right—\nthis is to position them according to mourning rites.\nWhen many are killed, mourn them with sorrow and grief.\nWhen victorious in battle, observe mourning rites.\n\n**The Dao is Eternally Nameless**\n\nThe Dao is ever nameless—\nit can be yin, it can be yang,\nit can relax, it can stretch,\nit can endure, it can vanish,\nthus it has no fixed name.\n\nThough the uncarved block is small,\nnone under heaven dare claim dominion over it.\nShould lords and kings hold fast to it,\nthe myriad things will of themselves submit.\n\nHeaven and earth unite to send down sweet dew—\nthe people, without command, find their own harmony.\n\nAt the beginning of creation, names arise.\nOnce names exist,\nwhen all things with names have exhausted their forms,\nheaven too will come to know them.\nKnowing them, one avoids peril.\n\nThe Dao’s presence in the world\nis like valleys flowing into rivers and seas.\n\n**Discerning Virtue**\n\nOne who knows others is wise;\none who knows oneself is enlightened.\nOne who conquers others has force;\none who conquers oneself is strong.\nOne who knows contentment is rich;\none who strives with resolve has purpose.\nOne who does not lose their place endures;\none who dies yet does not perish attains longevity.\n\n**Assuming Completion**\n\nThe great Dao overflows—\nit drifts like floating, sinking,\nnow present, now absent,\nseen yet unseen, grasped yet elusive.\n\nIt may be found to the left or right,\nfor nothing is beyond its reach.\nThe myriad things depend on it to live,\nyet it does not refuse them.\nIts work complete, it claims no merit.\nIt nurtures and sustains the myriad things\nyet does not act as their master.\n\nEver without desire, it may be called small.\nYet the myriad things return to it\nwithout its acting as their lord—\nit may be called great.\n\nThus the sage never claims greatness,\nand so accomplishes greatness.\n\n**Virtue of Benevolence**\n\nHold fast to the great image,\nand all under heaven will come to you.\nThey come without harm,\nbringing peace and great stability.\n\nMusic and fine food may make a passing guest pause,\nbut the Dao that issues from the mouth is bland,\nseeming without flavor.\nLook for it, and it cannot be seen;\nlisten for it, and it cannot be heard.\nYet in its use, it is inexhaustible.\n\n**Subtle Illumination**\n\nHe who would draw them in must first fully expand them—\nthis is to push excess and indulgence to their limit.\n\nHe who would weaken them must first fully strengthen them—\nthis is to let them meet with calamity.\n\nHe who would abolish them must first fully establish them—\nthis is to let their arrogance bring them to ruin.\n\nHe who would seize them must first fully give to them—\nthis is to push their greed to its extreme.\n\nThis is called subtle illumination:\nthe Way is hidden, yet its effects are clear.\n\nThe soft and weak overcome the hard and strong—\nfor the soft and weak endure, while the hard and strong perish first.\n\nFish must not leave the depths—\nonce a fish leaves the depths, having abandoned hardness for softness, it can no longer be controlled.\n\nThe state’s sharp instruments must not be shown to others—\nsharp instruments are the arts of power.\nIn governing the state, the arts of power must not be shown to ministers who act;\nin cultivating the Way, they must not be shown to those unworthy of them.\n\n**Governance**\n\nThe Dao is ever without action,\nyet there is nothing it does not do.\nIf lords and kings can hold fast to it,\nthe myriad things will transform of themselves.\n\nWhen transformation stirs and desire arises,\nI will quell it with nameless simplicity—\nmy self, nameless simplicity, the Dao.\nWhen the myriad things, having transformed, imitate me,\nyet desire to act with cunning and deceit,\nlords and kings should personally quell and guide them with virtue and the Dao.\n\nNameless simplicity will also be without desire;\nwithout desire, there is stillness.\nThen the world will settle of itself.\n\n*Laozi Daojing* concludes here.\n*Imperially Commissioned Complete Library of the Four Treasuries*, Scroll.\n\n**Laozi Dejing, Scroll Two**\n*He Shanggong’s Chapter Sentences, Chapter Three: On Virtue (38)*\n\nThe highest virtue does not act as virtue—\nthis is called \"highest virtue.\"\nIt does not act as virtue because, though the rulers of remote antiquity bore no titles,\ntheir virtue was vast and without peer.\nThus it is called \"highest virtue.\"\n\"Not acting as virtue\" means they did not govern the people through virtue,\nbut followed the natural course, nurturing their lives and natures.\nTheir virtue remained unseen, hence \"does not act as virtue.\"\nTherefore, they possessed virtue—\nfor their virtue harmonized with Heaven and Earth,\nand the qi of harmony flowed freely, preserving the people whole.\n\nLesser virtue does not lose virtue—\nthis is called \"lesser virtue.\"\nIt is called \"lesser virtue\" because the titled rulers of later ages\nfell short of the highest virtue.\n\"Not losing virtue\" means their virtue was visible, their achievements commendable.\nTherefore, they lacked virtue—\nfor they bore names and titles, and acted for their own sake.\n\nThe highest virtue acts without action,\nabiding by the Dao in stillness, changing nothing.\nAnd it has no purpose—\nfor it does not act for the sake of name or title.\nLesser virtue acts,\nenacting teachings and decrees, administering affairs.\nAnd it has a purpose—\nfor it acts to claim names and titles for itself.\n\nThe highest benevolence acts,\nbestowing kindness and grace.\nYet it has no purpose—\nfor once its work is done and its affairs established, it does not cling to them.\nThe highest righteousness acts,\njudging and dividing.\nYet it has a purpose—\nfor its actions serve itself, killing to establish authority,\nexacting tribute to sustain its own grandeur.\n\nThe highest propriety acts,\nestablishing rituals, systems, and imposing decorum.\nYet none respond to it—\nfor propriety’s splendor is hollow, its substance diminished.\nIts embellishments grow ever more false and cumbersome,\nand when set in motion, it strays from the Dao, becoming unanswerable.\nThen arms are raised in defiance, and contention follows—\nfor its excesses make it unanswerable, and superiors and inferiors grow resentful,\nraising their arms to drag one another down.\nThus, when the Dao is lost, virtue arises;\nwhen virtue is lost, benevolence appears;\nwhen benevolence is lost, righteousness emerges;\nwhen righteousness is lost, propriety is imposed.\n\nPropriety is the thinning of loyalty and trust,\nthe harbinger of chaos—\nfor propriety discards the root to tend the branches,\nand loyalty and trust grow ever thinner.\nIt is the beginning of disorder—\nfor propriety values ornament over substance,\nand thus uprightness wanes while deceit and chaos flourish.\n\nThose with foreknowledge are the blossoms of the Dao,\nthe beginning of folly—\nfor to claim knowledge without true understanding is \"foreknowledge,\"\nand such people lose the substance of the Dao, grasping only its blossoms.\nThus, foreknowledge is the origin of foolishness.\nTherefore, the great man abides in depth,\nnot dwelling in shallowness—\ndwelling in depth means resting his person in sincerity and simplicity,\nnot residing in conduct that strays from the Dao, entangling the world in turmoil.\nHe abides in substance,\nnot dwelling in blossoms—\nabiding in substance means upholding loyalty and trust,\nnot prizing mere words.\nThus, he rejects that and embraces this.\n\n**Chapter Thirty-Nine: The Root of the Law**\n\nOf old, those who attained the One—\n\"Of old\" means \"in the past.\"\nThe One is the child of the actionless Dao.\n\n---\n\nHeaven attains the One and thus becomes clear;\nHeaven attains the One, and so its celestial signs hang luminous and bright.\nEarth attains the One and thus becomes tranquil;\nEarth attains the One, and so it rests in stillness, unshaken.\nSpirits attain the One and thus become numinous;\nSpirits attain the One, and so their transformations are formless.\nValleys attain the One and thus become full;\nValleys attain the One, and so they brim without ceasing.\nThe myriad things attain the One and thus come to life;\nThe myriad things all depend on the Dao to take form and grow.\nLords and kings attain the One and thus become the standard for all under heaven;\nLords and kings attain the One, and so they bring level peace to the world.\n\nSuch is the culmination of their sincerity—\nreferring to the five instances above.\n\nIf heaven had nothing by which to remain clear, it would fear splitting;\nHeaven must alternate yin and yang, expand and contract, day and night—it cannot remain merely bright without end, lest it split and cease to be heaven.\nIf earth had nothing by which to remain tranquil, it would fear erupting;\nEarth must hold high and low, firm and yielding, seasonal nodes, and the five phases—it cannot remain merely still without end, lest it burst forth and cease to be earth.\nIf spirits had nothing by which to remain numinous, they would fear exhaustion;\nSpirits must cycle through waxing, waning, imprisonment, death, rest, and decline—they cannot remain merely numinous without end, lest they fade and cease to be spirits.\nIf valleys had nothing by which to remain full, they would fear drying up;\nValleys must ebb and flow, fill and empty—they cannot remain merely brimming without end, lest they wither and cease to be valleys.\nIf the myriad things had nothing by which to live, they would fear annihilation;\nThe myriad things must follow the seasons in birth and death—they cannot remain merely alive without end, lest they perish and cease to be things.\nIf lords and kings had nothing by which to remain noble and exalted, they would fear stumbling;\nLords and kings must humble themselves to serve others, diligently seek the worthy—they cannot remain merely high above others, lest they topple and lose their thrones.\n\nThus, the noble takes the humble as its root;\nTo attain true honor, one must take lowliness as the foundation—like Yu and Ji, who tilled the fields themselves, or Shun, who made pottery by the riverbank, or the Duke of Zhou, who lowered himself to thatched huts.\nThe high must take the low as its base;\nTo attain true honor, one must take the low as the foundation. Just as building a wall begins with the humble earth to reach the heights, without a firm base below, the structure will later topple and fall.\n\nTherefore, lords and kings call themselves \"the orphaned,\" \"the widowed,\" and \"the unworthy\";\n\"Orphaned\" and \"widowed\" suggest solitude; \"unworthy\" suggests inability, like a wheel’s hub that cannot gather the many spokes.\nIs this not taking the humble as the root?\nLords and kings, though most exalted, call themselves by such lowly names—is this not taking the humble as the root? This is to enlighten others.\n\nIs it not so?\n\nThus, when the parts of a carriage are assembled, there is no \"carriage\";\nWhen one gathers the parts—spokes, wheels, hub, axle, and carriage box—none alone is called a carriage; only when combined does it become one. This illustrates how lords and kings, by not clinging to their exalted titles, achieve true nobility.\nOne does not desire to be lustrous like jade nor coarse like stone;\n\"Lustrous\" suggests rarity, \"coarse\" suggests abundance—jade is prized for its scarcity, stone is disdained for its plenty. One should not wish to be like jade, coveted by others, nor like stone, despised by others, but rather dwell in the mean between them.\n\n**Chapter Forty: Rejecting Excess**\n\nThe movement of the Dao turns back to its root;\nThe weak is the function of the Dao.\nAll things under heaven are born from Being,\nAnd Being is born from Nonbeing.\n\nThus the root prevails over the blossom,\nThe weak prevails over the strong,\nAnd humility prevails over fullness.\n\n**Chapter Forty-One**\n\nWhen the highest scholar hears of the Dao, he diligently practices it;\nWhen the middling scholar hears of the Dao, he keeps it now and loses it later;\nWhen the lowest scholar hears of the Dao, he laughs loudly at it.\nWere it not laughed at, it would not be the Dao.\n\nTherefore, established sayings declare:\nThe Dao that is bright appears dim;\nThe Dao that advances appears to retreat;\nThe Dao that is level appears uneven;\nThe highest virtue resembles a valley;\nThe purest white appears sullied;\nAbundant virtue seems deficient;\nEstablished virtue appears hollow;\nTrue substance seems mutable;\nGreat squareness has no corners;\nGreat vessels are slowly completed;\nGreat sound is scarcely heard;\nGreat form has no shape.\nThe Dao is hidden and nameless.\n\nOnly the Dao is good at bestowing and bringing to completion.\n\nThe Dao gives birth to the One;\nThe One gives birth to the Two;\nThe Two gives birth to the Three;\nThe Three gives birth to the myriad things.\n\nThe myriad things bear yin and embrace yang;\nThrough the blending of qi, they achieve harmony.\n\nWhat men dislike are only \"orphaned,\" \"widowed,\" and \"unworthy,\"\nYet kings and lords take these as their titles.\nThus, some things are diminished yet gain,\nWhile others are increased yet lose.\n\nWhat others teach,\nI also teach:\n\"The strong and violent do not meet their proper end.\"\nI shall take this as the father of my teaching.\n\nThe softest under heaven gallops through the hardest under heaven.\nThe softest is water; the hardest, metal and stone.\nWater can penetrate the firm and enter the rigid, passing through without obstruction.\nThere is nothing that enters where there are no gaps.\nBy this I know the benefit of non-action.\n\nThe teaching without words,\nThe benefit of non-action—\nFew under heaven attain them.\n\nTo set forth precepts, forty-fourth:\nName and self—which is dearer?\nSelf and goods—which is greater?\nGain and loss—which is more harmful?\nExcessive love must lead to great expense;\nHoarding much must lead to heavy loss.\nKnow contentment and you will not be disgraced;\nKnow when to stop and you will not be endangered—\nThus may you endure long.\n\nVast virtue, forty-fifth:\nGreat perfection seems flawed,\nYet its use is inexhaustible.\nGreat fullness seems empty,\nYet its use is unending.\nGreat straightness seems bent;\nGreat skill seems clumsy;\nGreat eloquence seems inarticulate.\nRestlessness overcomes cold,\nStillness overcomes heat.\nPurity and stillness set the standard for all under heaven.\n\nRestraining desire, forty-sixth:\nWhen the world follows the Dao,\nWarhorses are retired to fertilize the fields.\nWhen the world does not follow the Dao,\nMilitary steeds are bred even on the outskirts.\nNo sin is greater than indulging desire;\nNo disaster is greater than not knowing contentment;\nNo fault is greater than the desire for gain.\nThus, the contentment of knowing contentment\nIs ever content.\n\nMirroring afar, forty-seventh:\nWithout stepping outside, one knows all under heaven;\nWithout looking out the window, one sees the Dao of heaven.\nThe farther one goes,\nThe less one knows.\nTherefore the sage knows without traveling,\nNames without seeing,\nAccomplishes without acting.\n\nForgetting knowledge, forty-eighth:\nPursuing learning, one adds to it day by day;\nPursuing the Dao, one diminishes it day by day.\nDiminish and further diminish,\nUntil one reaches non-action.\nThrough non-action, nothing is left undone.\nTo take hold of all under heaven, one always acts without interference;\nWhen one interferes, one is not fit to take hold of all under heaven.\n\nEmploying virtue, forty-ninth:\nThe sage has no fixed mind,\nBut takes the mind of the people as their mind.\nThe good, I treat as good;\nThe not good, I also treat as good.\nVirtue is goodness.\nThe faithful, I trust;\nThe unfaithful, I also trust.\nVirtue is trust.\nThe sage, in ruling all under heaven,\nBlends their mind with the world,\nAnd the people all turn their ears and eyes toward them.\n\nVirtue is goodness.\nThe faithful, I trust;\nThe unfaithful, I also trust.\nVirtue is trust.\nThe sage, in ruling all under heaven,\nAbides in reverent caution,\nAnd for all under heaven blends their mind with the world,\nAs if muddled, dull, and unknowing.\nThe people all turn their ears and eyes toward them,\nAnd the sage treats them all as children.\n\nValuing Life, fiftieth:\nEmerging into life, entering death—\nThose who live: thirteen;\nThose who die: thirteen.\nFor life and death alike, thirteen are the portals—\nthe nine apertures and the four gates.\nIn life, the eyes do not recklessly see...\n\nThe eyes do not recklessly see,\nThe ears do not recklessly hear,\nThe nose does not recklessly smell,\nThe mouth does not recklessly speak of flavors,\nThe hands do not recklessly grasp,\nThe feet do not recklessly walk,\nThe spirit does not recklessly extend—\nThus, one avoids death.\nThe opposite leads to death.\nOf those who live, thirteen move toward the realm of death.\nWhy is this?\nBecause they excessively pursue the thickness of life.\nI have heard that those who skillfully nurture life,\nWhile traveling on land, do not encounter rhinoceroses or tigers;\nWhen entering battle, they do not evade armor and weapons.\nThe rhinoceros finds nowhere to thrust its horn,\nThe tiger finds nowhere to place its claws,\nWeapons find nowhere to lodge their blades.\nWhy is this?\nBecause they do not enter the realm of death.\n\nNurturing Virtue, fifty-first:\nThe Dao gives them life,\nVirtue nurtures them.\nThings take form,\nCircumstances bring them to completion.\nThus, all things without exception honor the Dao and treasure virtue.\nThe honor of the Dao, the treasure of virtue—\nNothing commands them, yet they are ever naturally so.\nTherefore, the Dao gives them life, virtue nurtures them,\nFosters their growth, nourishes them,\nBrings them to maturity, ripens them,\nShelters and protects them.\nIt gives life yet does not possess,\nActs yet does not rely,\nFosters yet does not dominate—\nThis is called profound virtue.\n\nReturning to the Source, fifty-second:\nThe world has a beginning,\nWhich is the mother of all under heaven.\nHaving known the mother, one also knows her children;\nHaving known the children, one returns to guard the mother.\nThus, to the end of one’s days, one is not imperiled.\nBlock the openings,\nShut the gates—\nTo the end of one’s days, one does not toil.\nOpen the openings,\nAssist in their affairs—\nTo the end of one’s days, one cannot be saved.\nSeeing the small is called clarity;\nGuarding the soft is called strength.\nUse its light,\nReturn to its brightness,\nLest one leave behind calamity for the self—\nThis is called practicing the constant.\n\nIncreasing Evidence, fifty-third:\nIf I were suddenly to gain knowledge and walk the great Dao,\nOnly execution would I fear.\nThe great Dao is utterly level,\nYet the people prefer byways.\nThe courts are exceedingly resplendent,\nWhile the fields are exceedingly overgrown,\nAnd the granaries are exceedingly empty.\nThey wear fine embroidered robes,\nCarry sharp swords at their waists,\nSate themselves on food and drink,\nAnd amass excess wealth and goods—\nThese are called thieves and boasters.\nFar indeed is this from the Dao!\n\nThose who delight in such ways—\nThe courts are exceedingly adorned,\nThe fields are exceedingly barren,\nAnd the granaries are exceedingly empty.\nThey wear fine embroidered robes,\nGird themselves with sharp swords,\nSate themselves on food and drink,\nAnd hoard excess wealth and goods—\nThese are called thieves and boasters.\nFar indeed is this from the Dao!\n\nCultivating Observation, fifty-fourth:\nWhat is well established cannot be uprooted;\nWhat is well embraced cannot slip away.\nThus, descendants’ sacrifices never cease.\nCultivate it in the self, and one’s virtue becomes true;\nCultivate it in the family, and one’s virtue overflows;\nCultivate it in the village, and one’s virtue endures;\nCultivate it in the state, and one’s virtue abounds;\nCultivate it in the world, and one’s virtue becomes universal.\nTherefore, observe the self through the self,\nObserve the family through the family,\nObserve the village through the village,\nObserve the state through the state,\nObserve the world through the world.\nHow do I know the world is thus?\nBy this.\n\nMysterious Token, fifty-fifth:\n\nHe who contains profound virtue—\nThis means one who embraces the fullness of the Dao’s power—\nIs like an infant:\nVenomous creatures do not sting him,\nFierce beasts do not seize him,\nBirds of prey do not strike him.\nHis bones are weak, his sinews soft,\nYet his grasp is firm—\nFor his mind remains unshaken.\n\nHe knows not the union of male and female,\nYet his organ stirs:\nSuch is the perfection of his essence.\nHe wails all day without growing hoarse:\nSuch is the perfection of his harmony.\n\nTo know harmony is to know the constant;\nTo know the constant is to be enlightened.\nTo seek to prolong life is ominous;\nTo let the mind direct the qi is to become rigid.\n\nWhen things reach their prime, they age—\nThis is called not following the Dao.\nWhat does not follow the Dao perishes early.\n\nThe wise do not speak—\nFor the wise value action over words—\nThose who speak are not wise—\nA team of horses cannot overtake the tongue; much speech brings many woes.\n\nBlock the openings, shut the gates—\nTo sever the source.\nBlunt the sharpness—\nWhen passions and desires arise with keen force, reflect on the Dao’s non-action to subdue them.\nUntangle the knots—\nWhen resentments and entanglements persist, reflect on the Dao’s non-action to dissolve them.\nSoften the light—\nThough one may possess unique insight, temper it to dim its brilliance.\nMerge with the dust—\nDo not set oneself apart.\n\nThis is called the Mysterious Union—\nThe celestial. One who practices these things above is said to unite with Heaven’s Dao.\n\nThus one cannot be drawn near—\nNot delighting in honor, standing alone in sorrow.\nNor can one be kept at a distance—\nWith a tranquil mind and no cause, there is no enmity with others.\nOne cannot be benefited—\nThe body does not seek wealth or nobility; the mouth does not crave fine flavors.\nNor can one be harmed—\nNot contending for gain with the greedy, nor for pride with the fierce.\nOne cannot be exalted—\nNot ruling in a chaotic age, nor serving in the court of a benighted lord.\nNor can one be debased—\nNot growing arrogant with power, nor bending in defeat.\n\nTherefore, one is honored by all under Heaven—\nWith such virtue, even the Son of Heaven cannot make them a subject, nor can feudal lords bend them. Flowing with the world, they preserve their integrity and evade harm—thus they are honored by all under Heaven.\n\nWith rectitude govern the state—\nThus does Heaven send forth those of upright conduct to rule over domains.\nWith stratagem deploy the army—\nThus does Heaven employ those skilled in deception to command troops.\nWith nonaction win all under Heaven—\nThus does Heaven establish those who act not as its sovereigns.\n\nHow do I know this is so? By this:\nThe more taboos and prohibitions in the world, the poorer the people grow—\nThe world refers to the ruler; taboos are restrictions. When decrees multiply, deceit arises; when bans proliferate, the people resort to fraud, and thus poverty spreads.\nThe more sharp instruments the people possess, the more benighted the state becomes—\nSharp instruments are powers. When the people wield many powers, the eyes of those who watch grow dazzled, the ears of those who listen grow confused; above and below grow estranged, and thus the state falls into chaos.\nThe more cunning and craft the people cultivate, the more extravagant things arise—\nThe people refer to the ruler and the feudal lords. Cunning and craft mean the carving of palaces, the engraving of garments, the proliferation of rare adornments. Below, the people emulate above: gold is inlaid, jade is carved, embroidery and brocade flourish, and sensual allurements grow daily more excessive.\nThe more ritual objects and fine goods are displayed, the more thieves and bandits appear—\nRitual objects are precious things. When such treasures multiply and are flaunted, agriculture is abandoned, cold and hunger ensue, and thus thieves and bandits abound.\n\nTherefore the sage declares—\n\n】I practice non-action, and the people transform of themselves—\nThe sage declares: I cultivate the Dao and follow Heaven, doing nothing, and the people mature of themselves.\n\nI value stillness, and the people rectify themselves—\nThe sage declares: I cherish stillness, neither speaking nor instructing, yet the people all become loyal and upright.\n\nI undertake no affairs, and the people prosper of themselves—\nI impose no corvée labor or conscription, so the people secure their livelihoods and thus all grow wealthy.\n\nI harbor no desires, and the people return to simplicity—\nI constantly remain desireless, casting off extravagance, and the people then follow me in embracing plainness and simplicity.\n\n*Conforming Transformation* Fifty-Eighth\nWhen governance is dull and dim—\nIts policies and teachings are magnanimous, dull and dim, seemingly obscure.\n\nThe people are honest and sincere—\nBecause governance is magnanimous, the people are honest and sincere, with wealth and nobility fostering mutual harmony.\n\nWhen governance is sharp and severe—\nIts policies and teachings are hasty and urgent, words decided by the mouth, judgments by the ear.\n\nThe people grow hollow and thin—\nWith governance so urgent, the people find no means of survival, and thus grow hollow and thin, daily more estranged and shallow.\n\nMisfortune!—where fortune leans—\nTo lean is to depend. Misfortune arises from fortune; when people encounter misfortune yet can repent, blame themselves, cultivate goodness, and practice the Dao, then misfortune departs and fortune arrives.\n\nFortune!—where misfortune lies in ambush—\nMisfortune lurks hidden within fortune; when people obtain fortune yet grow arrogant and indulgent, then fortune departs and misfortune arrives.\n\nWho knows its ultimate end?\nAs misfortune and fortune beget one another, who can know when their cycle will reach its limit?\n\nThere is no constancy—\n\"No\" means \"not.\" If the ruler does not rectify himself, there will be no state.\n\nRectitude reverts to perversity—\nPerversity means deceit. If the ruler is not upright, though those below may be correct, they will transform to follow above in deceit.\n\nGoodness reverts to ominousness—\nAll good people will transform to follow above in ominousness.\n\nThe people’s delusion has long been entrenched—\nThe ruler’s confusion and loss of rectitude have endured for a fixed and prolonged time.\n\nThus the sage is square but does not cut—\nThe sage acts with integrity, desiring to lead those below, yet does not use it to sever others.\n\nIs incorruptible but does not harm—\nThe sage is pure and clear, desiring to transform the people, yet does not use it to injure others. Now, however, it is otherwise: rectitude is used to harm others.\n\nIs straight but does not extend—\nTo extend is to stretch forth. Though the sage is straight, he bends himself to follow others and does not assert himself.\n\nShines but does not dazzle—\nThough the sage possesses unique insight, he remains as if dim and obscure, never using his brilliance to dazzle others.\n\n*Holding to the Dao* Fifty-Ninth\n\nGoverning people—\nThis means the ruler desiring to govern and order the people.\n\nServing Heaven—\n*Serving* means *employing*; one must employ the Way of Heaven and follow the four seasons.\n\nNothing compares to frugality—\n*Frugality* means *thrift*. Those who govern the state must cherish the people’s wealth and not indulge in extravagance; those who cultivate the self must cherish their essence and qi, never dissipating them.\n\nOnly through frugality can one be said to attain early compliance—\n*Early* means *first*; *compliance* means *attainment*. Only by cherishing the people’s wealth and one’s essence and qi can one first attain the Way of Heaven.\n\nEarly compliance is called the repeated accumulation of virtue—\nTo first attain the Way of Heaven is to repeatedly accumulate virtue within oneself.\n\nWith the repeated accumulation of virtue, there is nothing one cannot overcome—\n*Overcome* means *to prevail*. With virtue repeatedly accumulated within, there is nothing one cannot conquer.\n\nWith nothing one cannot overcome, none can fathom its limit—\nWhen there is nothing one cannot conquer, none can know the ultimate extent of one’s virtue.\n\nWhen none can fathom its limit, one can possess the state—\nWhen none can know the limit of one’s virtue, one can possess the altars of soil and grain and bring blessings to the people.\n\nPossessing the mother of the state, one can endure long—\nThe state and the self are the same; *mother* means the Way. If one can preserve the Way within the self, keeping essence and qi unwearied and the five spirits unharmed, one can endure long.\n\nThis is called deep roots and firm stem—\nIf one can take qi as the root and essence as the stem—just as when roots run deep, branches and stems are firm, and when firm, they do not fall—it means deeply storing one’s qi and firmly guarding one’s essence, allowing no leakage.\n\nThe Way of long life and enduring vision—\nDeep roots and a firm stem: this is the Way of long life and enduring vision.\n\n*Commentary on the* Laozi *by Heshang Gong, Chapter Four: \"Holding Office,\" Sixty*\n\nGoverning a great state is like cooking a small fish—\nWhen cooking a small fish, one does not remove its entrails or scales, nor dare stir it, lest it fall apart. Governing a state with excessive meddling brings chaos below; tending the self with excessive fuss scatters one’s essence.\n\nWith the Dao presiding over the world, its demons do not manifest their numinosity—\nWhen one governs the world with virtue and the Dao, demons dare not display their spiritual power to offend others.\n\nNot that its demons lack numinosity, but their numinosity does not harm people—\nThese demons are not without spiritual power, yet when evil does not invade the upright, it cannot harm those who follow nature.\n\nNot that their numinosity does not harm people, but the sage also does not harm people—\nIt is not that the demons’ numinosity cannot harm others, but with the sage in office, he does not harm others, so demons dare not encroach.\n\nThus, the two do not harm one another—\nDemons and the sage both refrain from mutual harm.\n\nTherefore, their powers converge and return—\nWhen the two do not harm one another, people are governed by yang, demons are governed by yin; people preserve their nature and life, demons safeguard their spiritual power. Thus, their powers converge and return.\n\n*Chapter Sixty-One: \"The Virtue of Humility\"*\n\nA great state is the lower reaches of the river—\nGoverning a great state should be like dwelling in the lower reaches, not opposing the subtle and small.\n\nThe confluence of all under heaven—\nA great state is where the scholars and people of all under heaven gather.\n\nThe female of all under heaven—\nThe female is the essence of yin, gentle and humble, never overbearing.\n\nThe female constantly overcomes the male with stillness—\nThe female overcomes the male’s submission through tranquility, never seeking precedence.\n\nWith stillness as her lower position—\nThe way of yin takes tranquility as humility.\n\nThus, when a great state lowers itself before a small state, it gains the small state—\nWhen it practices humility, it constantly possesses it.\n\nWhen a small state lowers itself before a great state, it gains the great state—\nThis means that regardless of size, a state that holds humility and nurtures others commits no errors.\n\nThus, some lower themselves to gain, while others lower themselves and are gained—\n\"Lowering\" refers to a great state humbling itself before a small one, or a small state humbling itself before a great one, each gaining the other through righteousness.\n\nA great state desires nothing more than to nurture and embrace others—\nA great state must not transgress its bounds; it merges with other states to shepherd and embrace them.\n\nA small state desires nothing more than to serve and attend others—\nTo act as a vassal.\n\nBoth attain what they desire; the greater should be the lower—\nBoth great and small states achieve their aims; the greater should practice humility.\n\n*Chapter Sixty-Two: \"The Dao\"*\n\nThe Dao is the hidden sanctuary of the ten thousand things—\n\"Hidden sanctuary\" means the innermost recess.\n\nThe Dao is the treasury of the ten thousand things, containing all without exception—\n*\"Hidden sanctuary\"* (奥, pronounced *ào* or *yù*).\n\nIt is the treasure of the good—\nThe good hold the Dao as their most precious possession, never daring to transgress it.\n\nIt is the refuge of the not-good—\nThe Dao is the support and reliance of the not-good; when calamity strikes or urgency presses, they may yet know remorse and humble themselves.\n\nFair words may be traded in the marketplace—\nFair words alone suffice in the marketplace. For in the marketplace, exchanges are made and parties depart, never to meet again. The seeker wishes for swift acquisition, the seller for swift sale.\n\nNoble conduct may be set above others—\n*\"Set above\"* means to distinguish. One whose conduct is noble and exalted may be set apart from the common, though this is not yet sufficient to honor the Dao.\n\nWhy should the not-good be cast aside?\nThough a person be not-good, they should be transformed by the Dao. For before the Three Sovereigns, there were no abandoned people—virtue and transformation were pure.\n\nThus the Son of Heaven is established, and the Three Dukes are appointed—\nTo teach and transform those who are not-good.\n\nThough one may offer a jade disk preceded by a team of four horses, it is not equal to sitting and presenting this Dao—\nThough one possess a fine jade disk and arrive first with a team of four horses, it is not equal to sitting and presenting this Dao.\n\nWhy was this Dao so prized in ancient times?\nNot by daily seeking it afar, but by finding it near, within oneself.\n\nCan it absolve one of guilt?\n*\"Guilt\"* refers to living in a chaotic age under a benighted ruler who metes out punishments and executions at whim. By cultivating the Dao, one may dissolve death and be absolved of guilt.\n\nThus it is prized under heaven—\nThe Dao is vast and all-pervading, sheltering all, preserving the self, and governing the state with tranquility and non-action. Therefore, it is prized under heaven.\n\n*Chapter Sixty-Three: \"Grace as the Beginning\"*\n\nAct with non-action—[by completing cultivation, thus having no need for contrivance.]\nAttend to non-affairs—[by preparing in advance, eliminating troubles, and simplifying matters.]\nSavor the flavorless—[through profound reflection and far-reaching contemplation of the Dao’s meaning.]\nIn great and small, many and few—[this sets forth the admonitions: desiring greatness, one returns to smallness; desiring abundance, one returns to scarcity—such is the natural Dao.]\nRepay resentment with virtue—[by cultivating the Dao and practicing goodness, one severs misfortune before it arises.]\nPlan for difficulty while it is still easy—[to address difficult matters, begin with what is easy, before they come to fruition.]\nAchieve greatness by starting with the minute—[to accomplish great undertakings, one must begin with small things, for calamity and disorder arise from the minor.]\nThe difficult affairs of the world necessarily begin with the easy; the great affairs of the world necessarily begin with the minute. Therefore, the sage never attempts greatness and thus is able to accomplish greatness—[for the world converges upon him.]\n\nTrivial promises surely lack trust—[for they are not given weight.]\nExcessive ease surely brings many difficulties—[for one does not guard against misfortune.]\nThus, the sage treats even the easy as difficult—[in all actions and undertakings, the sage advances and retreats with caution, treating difficulty with gravity, seeking to block its source.]\nTherefore, he ultimately encounters no difficulty—[the sage remains free from misfortune and adversity throughout his life, ever avoiding harm at its root.]\n\n*Chapter Sixty-Four: \"Guarding the Minute\"*\n\nThe secure is easily maintained—[in governing body and state, tranquility is easily preserved.]\nThe unmanifest is easily planned for—[when passions, desires, and misfortunes have yet to take shape, they are easily corrected.]\nThe brittle is easily shattered—[when disorder has not yet stirred in court and desires have not yet shown in countenance, they are as fragile and easily removed.]\nThe minute is easily dispersed—[before it becomes evident, the small is easily dissolved.]\n\nAct before it arises—[to undertake anything, block its inception at the moment of sprouting.]\nGovern before disorder begins—[in governing body and state, when all is yet unchaotic, preemptively close the gate.]\n\nA tree of arm-spanning girth grows from a tender shoot—[from small to great.]\nA nine-tiered terrace rises from a mound of earth—[from low to high.]\nA journey of a thousand li begins beneath the foot—[from near to far.]\n\nTo act is to ruin it—[acting in affairs disrupts the natural; acting in righteousness contradicts benevolence; acting in desire depletes the spirit.]\nTo grasp is to lose it—[grasping profit invites calamity; grasping the Dao preserves the body. Firm adherence cannot be relinquished, for it returns in kind.]\n\nThe sage practices non-action and thus suffers no ruin—[the sage does not adorn with embellishments, nor pursue sensual pleasures or profit, nor inflict harm, and so remains uncorrupted.]\nThe sage holds nothing and thus loses nothing—[the sage possesses virtue to teach the foolish and wealth to aid the poor, holding nothing in reserve, and so loses nothing to others.]\n\nThe people in their undertakings often fail at the brink of completion—[in their pursuits, the people, when on the verge of achieving merit, become greedy for rank, enamored of fame, extravagant and self-satisfied, and so bring ruin upon themselves.]\nBe as cautious at the end as at the beginning, and there will be no failure—[the end must be like the beginning; one must not grow lax.]\n\nThus, the sage desires what others do not desire—[others desire ostentation; the sage desires concealment of brilliance. Others desire adornment; the sage desires plainness. Others desire sensuality; the sage desires virtue.]\nThe sage does not prize rare and precious goods—[the sage does not wear fine garments, nor despise stone while prizing jade.]\nThe sage learns what others do not learn—[others learn cunning and deceit; the sage learns the natural. Others learn to govern the world; the sage learns to govern the self and guard the true Dao.]\nThe sage restores what the multitude has transgressed—[the multitude in their learning reverses root and branch, takes substance for ornament. To restore is to return them to the root.]\n\nThus, he aids the naturalness of the myriad things—[teaching people to return to the root and substance is to assist the natural disposition of the myriad things.]\nYet dares not act—[the sage’s actions follow the course of things and dare not create or contrive, fearing to stray from the root.]\n\n*Chapter Sixty-Five: \"Unadulterated Virtue\"*\n\nThose of old who were adept in the Way—[referring to those of old who skillfully governed the self and the state through the Dao]—did not enlighten the people with cleverness—[they did not teach the people cunning and deceit through the Dao]. Instead, they sought to make them simple—[they taught the people through virtue and the Dao, fostering sincerity and eliminating deceit].\n\nThe people are difficult to govern because their knowledge is excessive—[their excessive knowledge leads to cunning and deceit]. To govern the state through knowledge is the state’s ruin—[if those with intelligence and wisdom are entrusted with state affairs, they will distance themselves from the Dao, recklessly wielding power for personal gain, becoming the state’s ruin]. Not governing the state through knowledge is the state’s blessing—[if those with intelligence and wisdom are not entrusted with state affairs, the people will uphold integrity, refrain from deception, and foster harmony between ruler and subject, uniting their efforts—this is the state’s blessing].\n\nTo understand these two paths is to grasp the model—[the two paths refer to knowledge and the absence of knowledge; knowing that knowledge leads to ruin while the absence of knowledge brings blessing is the model for governing the self and the state]. To constantly understand this model is called profound virtue—[profound virtue aligns with Heaven; to comprehend the model for governing the self and the state is to share the virtue of Heaven].\n\nProfound virtue runs deep and far—[the person of profound virtue is unfathomable and boundless]. They move contrary to things—[the person of profound virtue differs from the myriad things; while things seek to benefit themselves, profound virtue bestows upon others]. Thus they attain great harmony—[profound virtue, moving contrary to things, achieves great harmony, aligning with the principles of Heaven].\n\n*Chapter Sixty-Six: \"Putting Others First\"*\n\nThe rivers and seas can be kings of the hundred valleys because they excel at placing themselves below—[the rivers and seas, being lowly, draw all streams to them; just as the people turn toward their king. *Xia* (下) read as departing tone]. Thus they become kings of the hundred valleys—[by being lowly, they become kings of the hundred valleys].\n\nTherefore, the sage who wishes to be above the people [desires to stand over the people] must speak humbly to them—[emulating the rivers and seas in modesty. *Xia* (下) read as departing tone]. The sage who wishes to lead the people [desires to stand before the people] must place their own person behind—[putting others first and themselves last].\n\nThus, when the sage stands above, the people do not feel burdened—[the sage, though ruler over the people, does not lord their exalted position over them, so the people bear them without feeling weighed down]. When the sage stands before, the people do not feel harmed—[the sage, though ahead of the people, does not obscure those behind with brilliance; the people cherish them like parents, without any thought of harm].\n\nTherefore, the world delights in exalting them without wearying—[the sage’s kindness runs deep and love is profound; they regard the people as their own children, so the world joyfully elevates them as ruler without tiring. *Yan* (厌) read as departing tone]. Because they do not contend—[the world’s lack of weariness toward the sage arises from their refusal to vie for precedence]. Thus, none in the world can contend with them—[it is said that all are without striving, and none can compete with one who practices non-contention].\n\n*Chapter Sixty-Seven: \"The Three Treasures\"*\nThe world all calls me great, yet I seem unworthy—[Laozi says: the world calls my virtue great, but I feign foolishness, appearing unworthy]. Only because I am great do I seem unworthy—[only one whose virtue is truly great would, to avoid harm to themselves, feign foolishness, appearing as if unworthy, without discrimination or division, not demeaning others while exalting themselves]. If I were worthy, it would have been so long ago—[*Xiao* (肖) means \"good,\" referring to discernment and wisdom].\n\nNow, as for those of discerning wisdom—elevating themselves in pride, they enact policies of meticulous scrutiny. Such has been the way for ages. How petty they are! Such discerning wisdom is but the way of the petty man, not the noble one.\n\nI possess three treasures, which I hold and cherish:\nThe first is called *compassion*—loving the people as one’s own child.\nThe second is called *frugality*—levying taxes as if taking from oneself.\nThe third is called *not daring to take precedence in the world*—embracing humility and refraining from initiating action.\n\nThrough compassion, one can be courageous—for the sake of benevolence, one can be brave in loyalty and filial piety.\nThrough frugality, one can be expansive—when the Son of Heaven practices restraint, the people’s daily lives flourish.\nThrough not daring to take precedence, one can become the leader of those who attain the Way—for not striving to be first allows one to become the elder of those who perfect their vessels.\n\nYet today, people abandon compassion and pursue mere valor; they forsake frugality and indulge in extravagance; they relinquish deference and rush to be first. This is the path to death.\n\nFor one who employs compassion in battle, victory is assured; in defense, it ensures firmness. When the people are united in heart and devotion, war brings triumph, and defense becomes unassailable. Heaven will save such a one, shielding them with compassion.\n\n*Chapter Sixty-Eight: \"Matching Heaven\"*\nOne who excels as a warrior does not rely on force.\nOne who excels in battle does not succumb to anger.\nOne who excels in victory does not engage in conflict—for they draw near with benevolence and reach afar with virtue, so that the enemy submits without contention.\nOne who excels in employing others places themselves below—this is called the virtue of non-contention, the power of utilizing others’ strength. Such is called *matching Heaven*, the ultimate principle of antiquity.\n\n*Chapter Sixty-Nine: \"The Subtle Use\"*\nIn the art of warfare, there is a saying:\n\"I dare not act as the host but rather as the guest\"—the host initiates, while the guest responds without provocation. In warfare, one should follow Heaven’s will before acting.\n\"I dare not advance an inch but retreat a foot\"—to encroach upon another’s land or covet their wealth is to advance; to close the gates and defend the city is to retreat.\nThis is called *marching without marching*—though they persist as brigands under Heaven, though one proceeds to punish them, it is as if no punishment is meted out.\nIt is called *repelling without arms*—though one may wish to rage, it is as if no arms are raised to strike.\nIt is called *pursuing without an enemy*—though one may wish to draw them in, it is as if no enemy is pursued.\nIt is called *grasping without weapons*—though one may wish to seize them, it is as if no blade is wielded. For how can one harm those who suffer under the sins of Heaven, who endure the cruelty of a tyrannical ruler?\n\nNo calamity is greater than underestimating the enemy—for to belittle them is to invite ceaseless invasion, reckless war, and insatiable greed. To underestimate the enemy is to draw near the peril of losing one’s treasure—one’s own life.\n\nThus, when opposing armies clash, it is the one who acts with sorrow who prevails—for the compassionate warrior does not send their soldiers heedlessly to death.\n\n*Chapter Seventy: \"Knowing Difficulty\"*\n\nMy words are most easy to know, most easy to practice—yet none in the world can know them, none can practice them. Words have their root, affairs have their lord; it is only through ignorance that men do not understand me. Precisely because they are ignorant, they fail to know me. Those who know me are rare, and thus I am esteemed. Therefore the sage wears coarse cloth while holding jade within.\n\n*Chapter Seventy-One: \"Knowing Illness\"*\nTo know that one does not know is highest; not to know yet claim to know is an illness. Only by recognizing this illness as an illness can one avoid illness. The sage is not ill because he recognizes this illness as an illness—thus he is not ill.\n\n*Chapter Seventy-Two: \"Cherishing the Self\"*\nWhen the people do not fear authority, great authority is about to arrive.\n\n*Chapter Seventy-Two: \"Cherishing the Self\" (continued)*\nFor authority is harm—when people do not fear minor harm, great harm arrives, meaning death. Those who fear it should cherish their spirit, aligning with Heaven and Earth.\n\nDo not constrict where the mind dwells—by this is meant that the heart’s dwelling in the spirit should be broad and gentle, not tense and narrow. Do not weary of that which gives life. What gives life to people is the spirit, which abides in emptiness and delights in purity and stillness. Gluttony, neglect of the Dao, indulgence in sensual desires, and perverse excesses fill the belly and strike at the root, offering the spirit as sacrifice. *(厌: pronounced \"yan\")*\n\nOnly by not wearying of the spirit does one avoid weariness. Precisely because one alone does not weary of the spirit—washing the heart and cleansing its filth, abiding in tranquility without desire—the spirit dwells within without weariness.\n\nThus the sage knows himself—knows his own gains and losses—yet does not display himself, concealing his virtue and beauty within. *(见: pronounced \"xian\")* He cherishes himself, preserving his essence and qi, yet does not exalt himself, nor does he seek lofty fame in the world. Therefore he discards that and embraces this—discarding self-display and self-exaltation, embracing self-knowledge and self-cherishing. *(去: pronounced \"qu\")*\n\n*Chapter Seventy-Three: \"Venturing Action\"*\nTo be brave in daring is to invite death; to be brave in restraint is to preserve life. These two—daring and restraint—bring either benefit or harm. What Heaven abhors—who knows the reason? *(恶: pronounced \"wu\")* Thus even the sage finds it difficult. *(难: pronounced \"nan\")*\n\nThe Way of Heaven does not contend yet excels at victory; it does not speak yet excels at response. It does not summon yet things come of themselves. Vast and unhurried, it excels at planning. *(繟: pronounced \"chan\")* Heaven’s net is vast and wide, seemingly loose yet never missing its mark.\n\n*Chapter Seventy-Four: \"Restraining Delusion\"*\nWhen the people do not fear death—whether the ruler’s punishments are cruel and deep, leaving no means of livelihood, or the body’s desires injure the spirit and greed for wealth destroys life—how can death be used to frighten them? If the people were made to constantly fear death, then those who act perversely, I would seize and execute—who would dare? There is always one who governs killing.\n\nTo take the place of the one who governs killing is to take the place of the great craftsman in hewing wood. *(斫: pronounced \"zhuo\")* Those who take the place of the great craftsman in hewing rarely avoid injuring their own hands.\n\n*Chapter Seventy-Five: \"Greed and Loss\"*\n\nPeople suffer famine because their superiors consume too much in taxes—this is why they starve. The people are thus reduced to hunger.\n\nThe people are difficult to govern because their superiors act with excessive intervention—this is why they are difficult to govern.\n\nThe people treat death lightly because they pursue life’s comforts too lavishly—this is why they treat death lightly.\n\nOnly those who do not make life’s preservation their primary concern are wiser than those who prize life.\n\n*Chapter Seventy-Six: \"Against Strength\"*\nWhen people are alive, they are supple and weak; when they die, they become rigid and strong. All things—plants and trees—are soft and fragile in life, but dry and withered in death. Thus, the rigid and strong belong to the ranks of death, while the supple and weak belong to the ranks of life.\n\nTherefore, when an army is strong, it will not prevail. When a tree is strong, it invites the axe. The strong and great occupy the lower position, while the soft and weak rise above.\n\n*Chapter Seventy-Seven: \"The Way of Heaven\"*\nIs not the Way of Heaven like the drawing of a bow?\n\nThe Way of Heaven is obscure and subtle—thus it takes the drawing of a bow as its metaphor. What is high it presses downward; what is low it lifts upward. What has surplus it diminishes; what is deficient it replenishes. Only when the bow is drawn in such balanced harmony can it be put to use. For to press down the high, lift up the low, diminish the strong, and augment the weak—this is the Way of Heaven.\n\nThe Way of Heaven diminishes surplus to supply what is lacking, ever holding harmony and equilibrium as supreme. The way of man, however, is not so: it diminishes the deficient to serve the surplus. The common world takes from the poor to enrich the wealthy, seizes from the weak to strengthen the powerful.\n\nWho, then, can hold surplus and offer it to all under Heaven? Only one who embodies the Way. Thus the sage acts yet does not rely on reward; accomplishes yet does not dwell in achievement. He does not wish his worthiness to be seen, concealing his merit and refusing honor, ever wary of Heaven’s law to diminish surplus.\n\n*Chapter Seventy-Eight: \"Embracing Trust\"*\n\nThe world holds nothing more yielding and weak than water—round when in a round vessel, square when in a square, still when embraced, flowing when released—yet nothing surpasses it in overcoming the hard and strong. There is no substitute for it. The weak overcomes the strong; the soft overcomes the hard. None under Heaven fails to know this, yet none can practice it. Thus the sage declares: \"One who bears the nation’s disgrace is called the lord of the altars of soil and grain; one who bears the nation’s misfortune is called the king of all under Heaven.\" Straightforward words seem contrary.\n\n*Chapter Seventy-Nine: \"Holding the Contract\"*\nTo reconcile great grievances, there must remain residual resentment. How can this be deemed good? Therefore the sage holds the left half of the contract but does not demand from others. The virtuous govern by the contract; the unvirtuous govern by exactions. The Way of Heaven shows no partiality, yet it ever aligns with the good.\n\n*Chapter Eighty: \"Standing Alone\"*\nLet the state be small, its people few. Though there be tools for ten or a hundred men, let them not be used. Let the people regard death as weighty and not wander far. Though there be boats and carriages, none will ride them; though there be armor and weapons, none will display them. Let the people return to knotting cords for record-keeping. Let them relish their food, delight in their clothing, find peace in their dwellings, and rejoice in their customs. Neighboring states may gaze upon one another, the sounds of their dogs and roosters heard across the border, yet the people will grow old and die without ever traveling between them.\n\n*Chapter Eighty-One: \"Manifesting Simplicity\"*\nTruthful words are not fine; fine words are not truthful. The good do not dispute; the disputatious are not good. The wise are not broadly learned; the broadly learned are not wise. The sage does not accumulate: having bestowed all upon others, he possesses even more; having given all to others, he has even greater abundance. The Way of Heaven benefits and does not harm; the Way of the sage acts and does not contend. Thus ends the *Virtue Classic* of Laozi.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "钦定四库全书　　　　　子部十四 老子注　　　　　　　　道家 提要 【臣】等谨按老子注二卷旧本题河上公撰晁公武读书志曰大史公谓河上丈人通老子再传而至盖公盖公即齐相曹参师也 而葛洪谓河上公者莫知其姓名汉孝文时居河之滨侍郎裴柱言其通老子孝文诣问之即授素书道经两说不同当从太史公云云案晁氏所引乃史记乐毅列传赞之文叙述源流甚悉然隋志道家载老子道德经二卷汉文帝时河上公注又载梁有战国时河上丈人注老子经二卷亡则两河上公各一人两老子注各一书战国时河上公书在隋已亡今所传者实汉河上公书耳 明朱东光刻是书题曰秦人盖未详考惟是文帝驾临河上亲受其书无不入秘府之理何以刘向七略载注老子者三家独不列其名且孔颕达礼记正义称马融为周礼注欲省学者两读故具载本文后汉以来始就经为注何以是书作于西汉注已防入各句下唐书刘子元传称老子无河上公注欲废之而立王弼前此陆德明作经典释文虽叙录之中亦采葛洪神仙传之说颇失辨正而所释之本则不用此注而用王弼注二人皆一代通儒必非无据详其词防不汉人殆道流之所依托与相传已乆所言亦颇有发明姑存以备一家可耳 乾隆四十二年十月恭校上 总纂官【臣】纪　【臣】陆熊【臣】孙士毅",
      "translated_text": "The Imperial *Complete Library of the Four Treasuries*\n*Masters Section, Fourteenth Division: Commentaries on the Laozi*\n*Daoist School*\n*Abstract*\n\nWe, your ministers, respectfully note: The *Commentary on the Laozi* in two fascicles, as transmitted in old editions, is attributed to Heshang Gong. Chao Gongwu’s *Record of Reading* states: \"The Grand Historian [Sima Qian] said that the teachings of Laozi were transmitted twice before reaching Gai Gong, who was the teacher of Cao Shen, Chancellor of Qi.\" Yet Ge Hong claimed: \"Heshang Gong’s name is unknown. During the reign of Emperor Wen of Han, he dwelled by the Yellow River. The Gentleman-in-Attendance Pei Zhu reported his mastery of the *Laozi*, and the emperor visited him to receive the *Plain Book of the Daoist Canon*.\" These two accounts differ, and we follow the Grand Historian’s version.\n\nUpon examination, Chao’s citation derives from the *Postface to the Biography of Yue Yi* in the *Records of the Grand Historian*, which traces the lineage in detail. However, the *Bibliographic Treatise* of the *Book of Sui* records: \"*Laozi’s Dao and Virtue Sutra* in two fascicles, with a commentary by Heshang Gong from the time of Emperor Wen of Han,\" and further notes: \"During the Liang, there existed a *Commentary on the Laozi* in two fascicles by Heshang Gong of the Warring States period, now lost.\" Thus, the two Heshang Gongs were distinct individuals, and the two commentaries on the *Laozi* were separate works. The Warring States Heshang Gong’s book was already lost by the Sui, and the version now transmitted is indeed the work of the Han Heshang Gong.\n\nThe Ming scholar Zhu Dongguang’s edition of this text attributes it to a \"man of Qin,\" though this lacks thorough verification. Given that Emperor Wen personally visited the riverbank to receive the book, it is inconceivable that it would not have entered the imperial archives. Yet Liu Xiang’s *Seven Summaries* lists three commentators on the *Laozi* but omits Heshang Gong’s name. Moreover, Kong Yingda’s *Correct Meaning of the Record of Rites* states: \"Ma Rong, in his commentary on the *Rites of Zhou*, sought to spare students the effort of reading two texts and thus appended the original text. Since the Later Han, commentaries have been interspersed with the main text.\" How, then, could this book—composed in the Western Han—already feature annotations embedded within each sentence?\n\nThe *Old唐书* records that Liu Ziyuan, finding no *Heshang Gong Commentary on the Laozi*, sought to abolish it in favor of Wang Bi’s version. Even earlier, Lu Deming’s *Exegesis of the Classics* adopted Ge Hong’s account from the *Biographies of Divine Transcendents* in its preface, lacking critical discernment, yet the edition it annotated did not use Heshang Gong’s commentary but Wang Bi’s. Both were eminent scholars of their eras; their stance was surely not baseless. Upon close examination, the diction and phrasing of this text do not resemble Han-style prose. It is likely a later forgery by Daoist adherents, though its long circulation has yielded some insights. For now, we retain it as one school of interpretation.\n\nRespectfully submitted after collation in the tenth month of the forty-second year of the Qianlong reign.\n*Chief Compilers:*\n*Minister* Ji\n*Minister* Lu Feixiong\n*Minister* Sun Shiyi",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 489,
      "start_sentence": 0,
      "end_sentence": 7,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.846142053604126,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "总　校　官　【臣】　陆　费　墀 老子道德经原序 老子体自然而然生乎 太无之先起乎 无因经历天地终始不可称载终乎 无终穷乎 无穷极乎 无极故无极也 与大道而伦化为天地而立根布炁于十方抱道德之至淳浩浩荡荡不可名也 焕乎 其有文章巍巍乎 其有成功渊乎 其不可量堂堂乎 为神明之宗三光恃以朗照天地禀以得生乾坤运以吐精高而无民贵而无位覆载无穷阐敎八方诸天普大道开辟以前复下为国师代代不休人莫能知之匠成万物不言我为之德也 故众圣所共尊道尊德贵夫莫之命而常自然惟老氏乎 周时复托神李母剖左腋而生生即皓然号曰老子老子之号因而出在天地之先无衰老之期故曰老子世人谓老子当始于周代老子之号始于无数之劫其窈窈冥冥眇邈久远矣 世衰大道不行西游天下关令尹喜曰大道将隐乎 愿为我着书于是作道德二篇五千文上下经焉 夫五千文宣道德之源大无不包细无不入天人自然经也 余先师有言精进研之则声参太极高上遥唱诸天欢乐则携契人静思期真则众妙感防内观形影则神炁长存体洽道德则万神震伏祸灭九阴福生十方安国宁家孰能知乎 无为之文洿之不辱饰之不荣挠之不浊澄之不清自然也 应道而见传告无穷常者也 故知常曰明大道何为哉 之由人所以尊妙可不极精乎 粗述一篇唯有道者宝之太极左仙公葛撰 或问曰六经之后诸子之书出焉 今独行五子何与余应之曰老庄极道之者也 荀扬文中子明道之要者也 焉 得而不行曰吾尝闻之荀子着书辩儒墨也 扬子法言象论语也 文中子论六经又所以昭先王之道也",
      "translated_text": "**Chief Collators:**\n*Minister* Lu Feichi\n\n**Original Preface to the *Laozi Daodejing***\n\nLaozi embodies spontaneity, arising of itself, born before the Great Void, emerging from Non-Being. Through the passage of heaven and earth, from beginning to end, it cannot be named or described; ending in Non-Ending, exhausting Non-Exhaustion, reaching Non-Ultimate—thus it is Non-Ultimate. Aligning with the Great Dao, it transforms in kind, establishing heaven and earth, rooting itself and spreading qi throughout the ten directions. Embracing the utmost purity of virtue and power, vast and boundless, it defies naming. Radiant, it possesses pattern; towering, it achieves success; profound, it cannot be measured; majestic, it stands as the ancestor of divine luminaries. The Three Lights depend on it for illumination; heaven and earth receive it to attain life. Qian and Kun revolve to exhale its essence. Lofty yet without subjects, noble yet without rank, it covers and sustains without end, expounding its teachings to the eight directions. The myriad heavens universally venerate the Great Dao. Before the opening of creation, it descended to serve as the state’s teacher, continuing unceasingly through the ages. None can comprehend it, yet it crafts the ten thousand things without speech—such is its mysterious virtue.\n\nThus, all sages revere it. The Dao is honored, virtue is prized, for none commands it, yet it is ever spontaneous. Is this not Laozi alone? In the Zhou era, he again manifested as a divine being, born of Mother Li, emerging from her left side. At birth, he was already hoary, hence named Laozi. The name Laozi arises from the mysterious, existing before heaven and earth, without age or decline—thus it is called Laozi. The world believes Laozi began in the Zhou dynasty, yet the name Laozi originated in measureless kalpas past. Its depths are obscure, its remoteness vast and enduring.\n\nAs the age declined and the Great Dao waned, he journeyed west through the world. Guanling Yin Xi said, “The Great Dao is about to withdraw. I beg you to compose a book.” Thereupon, he wrote the *Daodejing* in two scrolls, the *Five Thousand Characters*, comprising the Upper and Lower Classics. These five thousand characters proclaim the source of virtue and power, encompassing the great without omission and penetrating the minute without exclusion. They are the scripture of heaven and humanity’s spontaneity.\n\nMy former teacher said: “Diligently study it, and your voice will resonate with the Great Ultimate. Chant it in lofty tones, and the heavens will rejoice. Carry it in harmony with the immortals. In still contemplation, await the true, and the myriad wonders will respond. Inwardly observe form and shadow, and spirit and qi will abide long. Embrace virtue and power, and the ten thousand spirits will submit. Disasters vanish in the Nine Yin; blessings arise in the Ten Directions. The state is pacified, the family is secured—who can comprehend this? The text of non-action is not defiled by pollution, not adorned by glory, not disturbed by turmoil, not clarified by stillness. It is spontaneous.\n\nResponding to the Dao, it appears; its transmission is inexhaustible and eternal. Thus, to know the constant is called illumination. What is the Great Dao’s purpose? Its purity arises from humanity. How can one not strive for utmost refinement?”\n\nI have roughly set forth this preface. Only those with the Dao will treasure it.\n*Composed by Left Immortal of the Great Ultimate, Ge Xuan.*\n\nSomeone asked: “After the Six Classics, the books of the various masters emerged. Why is only the *Five Masters* circulated today?” I replied: “Laozi and Zhuangzi exhaust the mystery of the Dao. Xunzi, Yangzi, and Wen Zhongzi elucidate the essentials of the Dao. How could they not be circulated?”\n\nI have heard that Xunzi’s writings distinguish between Confucians and Mohists; Yangzi’s *Fa Yan* models itself on the *Analects*; Wen Zhongzi’s *Discourses on the Six Classics* further illuminate the Way of the Former Kings.",
      "overlap_context": "scholars of their eras; their stance was surely not baseless. Upon close examination, the diction and phrasing of this text do not resemble Han-style prose. It is likely a later forgery by Daoist adherents, though its long circulation has yielded some insights. For now, we retain it as one school of interpretation.\n\nRespectfully submitted after collation in the tenth month of the forty-second year of the Qianlong reign.\n*Chief Compilers:*\n*Minister* Ji\n*Minister* Lu Feixiong\n*Minister* Sun Shiyi",
      "start_char": 489,
      "end_char": 1080,
      "start_sentence": 8,
      "end_sentence": 39,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.647644519805908,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "若老子道德生乎 无先终乎 无极其流也 寂庄子寓言一物我齐死生其失也 诞抑可与推明圣道者并论哉 余曰不然道有精粗学有本末大易无思无为自穷理尽性始大学能静能定自格物致知始由本而至末由粗而造精荀扬文中三子之讲学是也 不观象心其易不践形性其天言精而遗其粗舍本而求其末老庄之谈是也 圣贤之学大概从头彻底做出老庄只直截从向上处去故葛谓其为天地立根盖体道之自然郭象谓其明内圣外王之道皆旷然自得兹岂浅浅造道者所能至哉 夫学至道而止道至精而止学者倘自荀书儒道而推明之则可以至王道之无为自扬子法言而精进之则可以会道德于不言自文中子六经之学而充广之又可以富胸中之六经至是则老氏自然之天庄生自得之境若夫欲观其书当观其心景定改元蒲节前三日石庐龚士卨序 钦定四库全书卷 老子道德经篇目",
      "translated_text": "If Laozi’s *Dao and Virtue* arise from nothingness and culminate in the boundless, their current flows in stillness. Yet Zhuangzi’s parables equalize self and other, life and death—how can their excesses and absurdities be discussed alongside those who elucidate the sagely Dao? I say: not so. The Dao has its subtleties and grossness; learning has its roots and branches. The *Great Change* begins with thoughtlessness and non-action, yet only by exhausting principle and fulfilling nature does it commence. The *Great Learning* begins with stillness and stability, yet only by investigating things and extending knowledge does it commence. The teachings of the three masters—Xunzi, Yangzi, and Wen Zhongzi—proceed thus: from root to branch, from gross to subtle.\n\nWithout observing the images, how can one grasp the *Change*? Without embodying form and nature, how can one realize Heaven? To speak of subtlety while neglecting the gross, to abandon the root while seeking the branch—such is the discourse of Laozi and Zhuangzi. The learning of sages and worthies, in broad strokes, is built from the ground up; Laozi and Zhuangzi, however, take a direct path, leaping to the heights. Thus Ge Xuan called them \"the root of Heaven and Earth,\" for they embody the spontaneity of the Dao. Guo Xiang spoke of them as illuminating the Way of inner sageliness and outer kingship, all while resting in effortless attainment. How could those who merely dabble in the Dao ever reach such heights?\n\nLearning culminates in the Dao; the Dao culminates in subtlety. If scholars take Xunzi’s writings on Confucianism and Daoism and expound upon them, they may attain the effortless governance of the kingly Way. If they refine themselves through Yangzi’s *Fa Yan*, they may unite with the Dao in wordless harmony. If they expand upon Wen Zhongzi’s learning of the *Six Classics*, they may enrich their minds with the *Six Classics* themselves. Only then will Laozi’s natural Heaven and Zhuangzi’s realm of self-attainment be realized.\n\nAs for those who wish to study their works, they must first examine their own minds.\n\n*Composed by Gong Shixie of Shilu, three days before the Dragon Boat Festival in the first year of the Jingding era.*\n*Imperially Commissioned Complete Library of the Four Treasuries, Volume: Laozi Daode Jing*",
      "overlap_context": "he Six Classics, the books of the various masters emerged. Why is only the *Five Masters* circulated today?” I replied: “Laozi and Zhuangzi exhaust the mystery of the Dao. Xunzi, Yangzi, and Wen Zhongzi elucidate the essentials of the Dao. How could they not be circulated?”\n\nI have heard that Xunzi’s writings distinguish between Confucians and Mohists; Yangzi’s *Fa Yan* models itself on the *Analects*; Wen Zhongzi’s *Discourses on the Six Classics* further illuminate the Way of the Former Kings.",
      "start_char": 1080,
      "end_char": 1413,
      "start_sentence": 40,
      "end_sentence": 50,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.936092615127563,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "道经 河上公章句第一 体道第一 养身第二 安民第三 无源第四 虚用第五 成象第六 韬光第七 易性第八 运夷第九 能为第十 无用第十一 检欲第十二 厌耻第十三 赞元第十四 显德第十五 归根第十六 河上公章句第二 淳风第十七 俗薄第十八 还淳第十九 异俗第二十 虚心第二十一 益谦第二十二 虚无第二十三 苦恩第二十四 象元第二十五 重德第二十六 巧用第二十七 反朴第二十八 无为第二十九 俭武第三十 偃武第三十一 圣德第三十二 辨德第三十三 任成第三十四 仁德第三十五 微明第三十六 为政第三十七 德经 河上公章句第三 论德第三十八 法本第三十九 去用第四十 同异第四十一 道化第四十二 徧用第四十三 立戒第四十四 洪德第四十五 俭欲第四十六 鉴远第四十七 忘知第四十八 任德第四十九 贵生第五十 养德第五十一 归元第五十二 益证第五十三 修观第五十四 符第五十五 德第五十六 淳风第五十七 顺化第五十八 守道第五十九 河上公章句第四 居位第六十 谦德第六十一 为道第六十二 恩始第六十三 守微第六十四 淳德第六十五 后巳第六十六 三宝第六十七 配天第六十八 用第六十九 知难第七十 知病第七十一 爱己第七十二 任为第七十三 制惑第七十四 贪损第七十五 戒强第七十六 天道第七十七 任信第七十八 任契第七十九 独立第八十 显质第八十一",
      "translated_text": "**Dao Jing**\n*He Shang Gong’s Chapter and Verse, First Scroll*\n1. Embracing the Dao\n2. Nurturing the Body\n3. Pacifying the People\n4. Without Source\n5. The Use of Emptiness\n6. Forming Images\n7. Concealing Radiance\n8. Transforming Nature\n9. Moving with the Barbarians\n10. The Power to Act\n11. Uselessness\n12. Restraining Desires\n13. Disdaining Shame\n14. Praising the Origin\n15. Manifesting Virtue\n16. Returning to the Root\n\n*He Shang Gong’s Chapter and Verse, Second Scroll*\n17. Pure Wind\n18. The Shallowness of Customs\n19. Returning to Simplicity\n20. Different Customs\n21. Emptying the Mind\n22. The Benefit of Humility\n23. Emptiness and Nothingness\n24. The Bitterness of Favor\n25. The Image of the Origin\n26. Honoring Virtue\n27. Skillful Use\n28. Returning to Simplicity\n29. Non-Action\n30. Frugality in Warfare\n31. Laying Down Arms\n32. Sagely Virtue\n33. Discerning Virtue\n34. Entrusting Completion\n35. Benevolent Virtue\n36. Subtle Illumination\n37. Governing\n\n**De Jing**\n*He Shang Gong’s Chapter and Verse, Third Scroll*\n38. On Virtue\n39. The Root of the Law\n40. Abandoning Use\n41. Sameness and Difference\n42. The Transformations of the Dao\n43. Universal Application\n44. Establishing Precepts\n45. Vast Virtue\n46. Moderating Desires\n47. Mirroring the Distant\n48. Forgetting Knowledge\n49. Entrusting Virtue\n50. Honoring Life\n51. Cultivating Virtue\n52. Returning to the Origin\n53. Increasing Evidence\n54. Cultivating Observation\n55. The Mysterious Talisman\n56. Mysterious Virtue\n57. Pure Wind\n58. Following Transformations\n59. Guarding the Dao\n\n*He Shang Gong’s Chapter and Verse, Fourth Scroll*\n60. Occupying Position\n61. The Virtue of Humility\n62. Practicing the Dao\n63. The Beginning of Grace\n64. Guarding the Subtle\n65. Pure Virtue\n66. Putting Oneself Last\n67. The Three Treasures\n68. Matching Heaven\n69. The Use of the Mysterious\n70. Knowing Difficulty\n71. Knowing Illness\n72. Loving Oneself\n73. Entrusting Action\n74. Controlling Delusion\n75. The Harm of Greed\n76. Warning Against Strength\n77. The Way of Heaven\n78. Entrusting Trust\n79. Entrusting the Covenant\n80. Standing Alone\n81. Revealing Essence",
      "overlap_context": "on Wen Zhongzi’s learning of the *Six Classics*, they may enrich their minds with the *Six Classics* themselves. Only then will Laozi’s natural Heaven and Zhuangzi’s realm of self-attainment be realized.\n\nAs for those who wish to study their works, they must first examine their own minds.\n\n*Composed by Gong Shixie of Shilu, three days before the Dragon Boat Festival in the first year of the Jingding era.*\n*Imperially Commissioned Complete Library of the Four Treasuries, Volume: Laozi Daode Jing*",
      "start_char": 1413,
      "end_char": 2156,
      "start_sentence": 51,
      "end_sentence": 137,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.40116572380066,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "老子道德经篇目 钦定四库全书卷 老子道经卷上 河上公章句第一 体道第一 道可道【谓经术政教之道也 】非常道【非自然长生之道也 常道当以无为养神无事安民含光藏晖灭迹匿端不可称道】名可名【谓富贵尊荣高世之名也 】非常名【非自然常在之名也 常名谓如婴儿之未言鸡子之未分明珠在蚌中美玉处石间内虽昭昭外如愚顽】无名天地之始【无名者谓道道无形故不可名也 始者道本也 吐气布化出于虚无为天地本始也 】有名万物之母【有名谓天地天地有形位阴阳有柔刚是其有名也 万物母者天地含气生万物长大成熟如母之养子】故常无欲以观其妙【妙要也 人常能无欲则可以观道之要要谓一也 】常有欲以观其徼【徼归也 常有欲之人可以观世俗之所归趣也 ○徼音叫又古吊反即窍字】此两者同出而异名【两者谓有欲无欲也 同出者同出人心也 而异名者所名各异也 名无欲者长存名有欲者亡身也 】同谓之【天也 言有欲之人与无欲之人同受气于天】之又【天中复有天也 禀气有厚薄得中和滋液则生贤圣得错乱污辱则生贪滛也 】众妙之门【能知天中复有天禀气有厚薄除情去欲守中和是谓知道要之门户也 】 养身第二",
      "translated_text": "**Laozi’s Dao and Virtue Classic: Chapter Titles**\n*Imperially Commissioned Siku Quanshu, Volume*\n*Laozi’s Dao Classic, Volume One*\n*He Shang Gong’s Chapter and Verse, First Scroll*\n\n1. **Embodying the Dao**\n   *Dao that can be spoken of* 【refers to the Dao of classical arts, governance, and teachings】\n   *is not the eternal Dao* 【not the natural Dao of long life; the eternal Dao should be nurtured through non-action to cultivate spirit, through non-interference to pacify the people, by containing radiance and concealing brilliance, erasing traces and hiding origins—it cannot be named as Dao】\n   *Name that can be named* 【refers to wealth, honor, nobility, and worldly renown】\n   *is not the eternal name* 【not the naturally enduring name; the eternal name is like an infant who has not yet spoken, an egg that has not yet divided, a luminous pearl within an oyster, a fine jade embedded in stone—internally bright, externally appearing dull and unrefined】\n\n   *Nameless, it is the origin of Heaven and Earth* 【\"Nameless\" refers to the Dao, which is formless and thus cannot be named; \"origin\" is the root of the Dao, which emits qi, spreads transformation, and emerges from emptiness and nothingness as the origin of Heaven and Earth】\n   *Named, it is the mother of the myriad things* 【\"Named\" refers to Heaven and Earth, which possess form and position, yin and yang, softness and hardness—these are their names; \"mother of the myriad things\" means Heaven and Earth contain qi to generate, nurture, and mature the myriad things, like a mother raising her child】\n\n   *Thus, constantly without desire, observe its mystery* 【\"Mystery\" is the essential; one who is constantly without desire can perceive the essence of the Dao—this essence is the One】\n   *Constantly with desire, observe its manifestations* 【\"Manifestations\" are the returns; one who is constantly with desire can observe the tendencies to which worldly customs return】\n   *These two emerge together yet have different names* 【\"These two\" refer to having desire and being without desire; \"emerge together\" means they arise from the same human heart, yet \"have different names\" because their designations differ—being without desire is called \"enduring,\" while having desire is called \"self-destruction\"】\n   *Together they are called the Mysterious* 【\"Mysterious\" is Heaven; those with desire and those without desire alike receive qi from Heaven】\n   *Mysterious within the Mysterious* 【Heaven contains yet another Heaven; receiving qi may be thick or thin—those who obtain harmony and nourishing fluids give birth to the worthy and sagely, while those who receive disorder and defilement give birth to the greedy and licentious】\n   *The gate of the myriad mysteries* 【To know that Heaven contains another Heaven and that received qi may be thick or thin, to eliminate emotions and desires, and to preserve harmony—this is called the gate and doorway to knowing the essentials of the Dao】\n\n2. **Nurturing Life**",
      "overlap_context": "ing Position\n61. The Virtue of Humility\n62. Practicing the Dao\n63. The Beginning of Grace\n64. Guarding the Subtle\n65. Pure Virtue\n66. Putting Oneself Last\n67. The Three Treasures\n68. Matching Heaven\n69. The Use of the Mysterious\n70. Knowing Difficulty\n71. Knowing Illness\n72. Loving Oneself\n73. Entrusting Action\n74. Controlling Delusion\n75. The Harm of Greed\n76. Warning Against Strength\n77. The Way of Heaven\n78. Entrusting Trust\n79. Entrusting the Covenant\n80. Standing Alone\n81. Revealing Essence",
      "start_char": 2162,
      "end_char": 2625,
      "start_sentence": 138,
      "end_sentence": 164,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.32944893836975,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "天下皆知羙之为羙【自扬巳美使显彰也 】斯恶巳【有危亡也 】皆知善之为善【有功名也 】斯不善巳【人所争也 】故有无相生【见有而为无也 】难易相成【见难而为易也 】长短相形【见短而为长也 】高下相倾【见高而为下也 】音声相和【上唱下必和也 】前后相随【上行下必随也 】是以圣人处无为之事【以道治也 】行不言之教【以身师导之也 】万物作焉 【各自动也 】而不辞【不辞谢而逆止】生而不有【元气生万物而不有】为而不恃【道所施为不恃望其报也 】功成而弗居【功成事就退避不居其位】夫惟弗居【夫惟功成不居其位】是以不去【福德常在不去其身也 此言不行不可随不言不可知即上六句有高下长短若开一源下生百端百端之变无不动乱】 安民第三 不尚贤【贤谓世俗之贤辩口明文离道行权去质为文也 不尚者不富之以禄不贵之以官】使民不争【不争功名返自然也 】不贵难得之货【言人君不御好珍宝黄金弃于山珠玉捐于渊】使民不为盗【上化清净下无贪人】不见可欲【放郑声远美人】使心不乱【不邪滛不惑乱也 】是以圣人治【圣人治国与治身同也 】虚其心【除嗜欲去乱烦】实其腹【懐道抱一守五神也 】弱其志【和柔谦让不处权也 】强其骨【爱精重施髓满骨坚○强平声】常使民无知无欲【反朴守淳】使夫知者不敢为也 【思虑深不轻言夫音扶知音智】为无为【不造作动因循】则无不治【德化厚百姓安】 无源第四 道冲而用之【冲中也 道匿名藏誉其用在中○冲音防】或不盈【或常也 道常谦虚不盈满】渊乎 似万物之宗【道渊深不可知也 似为万物之宗祖】挫其锐【锐进也 人欲锐精进取功名当挫止之法道不同也 ○挫子卧反锐音睿】解其纷【纷结根也 当念道无为以解释】和其光【言虽有独见之明当如暗昧不当以曜乱人也 】同其尘【当与众庶同垢尘不当自别殊】湛兮似若存【言当湛然安静故能长存不忘】吾不知谁之子【老子言我不知道所从生】象帝之先【道自在天帝之前此言道乃先天地生也 至今在者以能安静湛然不劳烦欲使人修身法道】 虚用第五 天地不仁【天施地化不以仁恩任自然也 】以万物为刍狗【天地生万物人最为贵天地视之如刍草狗畜不责望其报也 】圣人不仁【圣人爱养万民不以仁恩法天地行自然】以百姓为刍狗【圣人视百姓如刍草狗畜不责望其礼意】天地之间【天地之间空虚和气流行故万物自生人能除情欲节滋味清五藏则神明居之也 】其犹槖钥乎 【槖钥中空虚又能有声气○槖音托钥音药】虚而不屈动而愈出【言空虚无冇屈竭时动揺之益出声气也 】多言数穷【多事害神多言害身口开舌举必有祸患○数王弼注去声谓理数也 明皇注音朔】不如守中【不如守德于中育养精神爱气希言】 成象第六 谷神不死【谷养也 人能养神则不死也 神谓五藏之神也 肝藏魂肺藏魄心藏神肾藏精脾藏志五藏尽伤则五神去矣 】是谓牝【言不死之由在于牝天也 于人为鼻牝地也 于人为口天食人以五气从鼻入藏于心五气清微为精神聪明音声五性其曰魂魂者雄也 主出入人鼻与天通故鼻为也 地食人以五味从口入藏于胃五性浊厚为形骸骨肉血脉六情其曰魄魄者雌也 主出入于口与天地通故曰为牝也 】牝之门是谓天地根【根元也",
      "translated_text": "All under Heaven know beauty as beauty—【self-praise that makes one’s excellence manifest】—this is already ugliness.【It brings peril and ruin.】\nAll know goodness as goodness—【it brings merit and fame】—this is already not goodness.【It is what people contend over.】\nThus, being and non-being give rise to each other;【seeing being, one acts as non-being】\ndifficulty and ease complete each other;【seeing difficulty, one acts as ease】\nlong and short shape each other;【seeing shortness, one acts as length】\nhigh and low incline toward each other;【seeing height, one acts as lowness】\nsound and echo harmonize;【the superior intones, the inferior must respond】\nbefore and after follow each other.【the superior advances, the inferior must follow】\nTherefore, the sage abides in non-action,【governing by the Dao】\npractices wordless teaching,【instructing by personal example】\nand lets the myriad things arise【each moving of itself】\nwithout refusal,【not refusing or obstructing】\ngives life without possession,【the primal qi gives life to the myriad things yet does not possess them】\nacts without reliance,【what the Dao accomplishes is not relied upon for recompense】\ncompletes works without dwelling.【Having completed works and achieved affairs, one retreats and does not occupy the position.】\nOnly by not dwelling【only by not occupying the position after success】\ndoes one not depart.【Virtue and blessing remain constantly with one, never leaving the person. This speaks of how what is not done cannot be followed, and what is not spoken cannot be known—just as the six preceding lines on high and low, long and short, all open from one source, and from that source a hundred branches arise, their transformations without end, yet none cause disorder.】\n\n**Pacifying the People (Chapter 3)**\nDo not exalt the worthy,【\"Worthy\" refers to worldly worthies—those skilled in eloquence, versed in literature, who depart from the Dao in conduct, employ stratagems, and abandon substance for ornament. \"Do not exalt\" means not enriching them with emoluments or ennobling them with office.】\nso that the people do not contend;【they do not contend for merit and fame, returning to naturalness】\ndo not prize rare and hard-to-obtain goods,【the ruler does not hoard treasures, gold, or jade, but casts them into mountains and abysses】\nso that the people do not become thieves;【when superiors are pure and tranquil, inferiors are without greed】\ndo not display what may be desired,【banish licentious music and keep beauties at a distance】\nso that the people’s hearts are not confused.【they are not licentious or deluded】\nThus, the sage governs:【the sage’s governance of the state is the same as governance of the self】\nempties their hearts,【eliminates cravings and dispels confusion and vexation】\nfills their bellies,【embraces the Dao and holds to the One, guarding the five spirits】\nweakens their ambitions,【is gentle, yielding, and humble, not occupying positions of power】\nstrengthens their bones.【cherishes essence and values bestowal, so that marrow is full and bones are firm】\nAlways causes the people to be without knowledge and without desire,【returns to simplicity and preserves purity】\nso that those with knowledge dare not act.【thoughts are deep, and one does not speak lightly】\nAct through non-action,【do not contrive or act arbitrarily, but follow what is natural】\nand nothing will not be governed.【Virtue is profound and transformation is deep; the hundred clans are at peace.】\n\n**Without Source (Chapter 4)**\nThe Dao is empty, yet its use is inexhaustible.【\"Empty\" means centered. The Dao conceals its name and hides its reputation; its use lies in the center.】\nIt seems never full.【\"Seems\" means \"constantly.\" The Dao is constantly humble and empty, never full.】\nAbysmal! It seems the ancestor of the myriad things.【The Dao is profound and unfathomable; it seems to be the ancestor of the myriad things.】\nBlunt its sharpness,【\"Sharpness\" means aggressive advancement. When people desire to advance sharply in pursuit of merit and fame, one should blunt and restrain them, for this is not the way of the Dao.】\nuntangle its tangles,【\"Tangles\" are knotted roots. One should contemplate the Dao’s non-action to untie them.】\nsoften its brilliance,【Though one may have unique insights, one should act as if dim and dull, not using one’s radiance to confuse others.】\nblend with its dust.【One should share the same dust and grime as the common people, not setting oneself apart.】\nDeep and clear! It seems ever-present.【One should be profoundly tranquil and serene, thus able to endure long and not be forgotten.】\nI do not know whose child it is—【Laozi says: I do not know from what it was born.】\nit seems to have existed before the Lord-on-High.【The Dao existed before Heaven and Earth. This says the Dao was born before Heaven and Earth. To this day, it endures because it can be tranquil, serene, and free from toil and desire, enabling people to cultivate themselves by modeling the Dao.】\n\n**Vacuity and Use (Chapter 5)**\nHeaven and Earth are not benevolent;【Heaven bestows and Earth transforms, not employing benevolence or kindness, but following naturalness.】\nthey treat the myriad things as straw dogs.【Heaven and Earth give life to the myriad things; humans are the most noble, yet Heaven and Earth regard them as straw dogs, not expecting recompense.】\nThe sage is not benevolent;【The sage cherishes and nurtures the myriad people, not employing benevolence or kindness, but following Heaven and Earth’s naturalness.】\nhe treats the hundred clans as straw dogs.【The sage regards the hundred clans as straw dogs, not expecting their courtesy or gratitude.】\nThe space between Heaven and Earth—【The space between Heaven and Earth is empty, and harmonious qi flows through it, so the myriad things are born of themselves. If people can eliminate emotions and desires, moderate flavors, and purify the five viscera, then numinous clarity will reside within.】\nis it not like a bellows?【The bellows is empty within yet can produce sound and qi.】\nEmpty yet not exhausted,【When empty, it is not depleted;】\nmoved, it brings forth more.【when agitated, it produces even more.】\nMuch speech leads to frequent exhaustion;【Many affairs harm the spirit; many words harm the body. When the mouth opens and the tongue moves, calamity must follow.】\nit is better to guard the center.【It is better to guard virtue within, nurturing the spirit, cherishing qi, and practicing few words.】\n\n**Forming Images (Chapter 6)**\nThe valley spirit does not die;【\"Valley\" means nourishment. If one can nourish the spirit, it will not die. The \"spirit\" refers to the spirits of the five viscera: the liver stores the ethereal soul, the lungs store the corporeal soul, the heart stores the spirit, the kidneys store essence, and the spleen stores the will. If the five viscera are all harmed, the five spirits depart.】\nthis is called the Mysterious Female.【The reason it does not die lies in the Mysterious Female. \"Mysterious\" is Heaven; in humans, it is the nose. \"Female\" is Earth; in humans, it is the mouth. Heaven feeds humans with the five qi, which enter through the nose and are stored in the heart. The five qi are clear and subtle, becoming spirit, intelligence, voice, and the five natures; their numinous aspect is called the ethereal soul. The ethereal soul is yang and governs ingress and egress; humans’ noses communicate with Heaven, so the nose is called \"Mysterious.\" Earth feeds humans with the five flavors, which enter through the mouth and are stored in the stomach. The five natures are turbid and thick, becoming the physical form—bones, flesh, blood, and vessels; the six emotions are their numinous aspect, called the corporeal soul. The corporeal soul is yin and governs ingress and egress through the mouth, communicating with Heaven and Earth, so it is called \"Female.\"】\nThe gate of the Mysterious Female is called the root of Heaven and Earth.【\"Root\" means origin.】",
      "overlap_context": "her Heaven; receiving qi may be thick or thin—those who obtain harmony and nourishing fluids give birth to the worthy and sagely, while those who receive disorder and defilement give birth to the greedy and licentious】\n   *The gate of the myriad mysteries* 【To know that Heaven contains another Heaven and that received qi may be thick or thin, to eliminate emotions and desires, and to preserve harmony—this is called the gate and doorway to knowing the essentials of the Dao】\n\n2. **Nurturing Life**",
      "start_char": 2625,
      "end_char": 3852,
      "start_sentence": 165,
      "end_sentence": 221,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.68471360206604,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "言鼻口之门是乃通天地之元气所从徃来】绵绵若存【鼻口呼噏喘息当绵绵微妙若可存复若无有】用之不勤【用气常宽舒不当急疾勤劳也 】 韬光第七 天长地久【说天地长生久寿以喻教人也 】天地所以能长且久者以其不自生【天地所以独长且久者以其安静施不责报不如人居处汲汲求自饶之私夺人以自与】故能长生【以其不求生故能长生不终也 】是以圣人后其身【先人而后己者也 】而身先【天下敬之先以为长】外其身【薄己而厚人也 】而身存【百姓爱之如父母神明佑之若赤子故身常存】非以其无私邪【圣人为人所爱神明所佑非以其公正无私所致乎 】故能成其私【人以为私者欲以厚己也 圣人无私而己自厚故能成其私也 】 易性第八",
      "translated_text": "The gates of nose and mouth are where the primordial qi of Heaven and Earth comes and goes. Ceaseless yet seemingly present—nasal exhalations and inhalations should be gentle and subtle, as if existing yet also as if not. Use it without strain: the qi should always be relaxed and unhurried, never urgent or labored.\n\nChapter Seven: Concealing Radiance\nHeaven and Earth endure. Heaven and Earth are able to be long and enduring because they do not live for themselves. Thus they are able to live long. Therefore the sage places himself behind, yet finds himself ahead; sets himself outside, yet finds himself preserved. Is it not because he is selfless? Thus he is able to fulfill his self.\n\nChapter Eight: Transforming Nature",
      "overlap_context": "ds humans with the five flavors, which enter through the mouth and are stored in the stomach. The five natures are turbid and thick, becoming the physical form—bones, flesh, blood, and vessels; the six emotions are their numinous aspect, called the corporeal soul. The corporeal soul is yin and governs ingress and egress through the mouth, communicating with Heaven and Earth, so it is called \"Female.\"】\nThe gate of the Mysterious Female is called the root of Heaven and Earth.【\"Root\" means origin.】",
      "start_char": 3852,
      "end_char": 4138,
      "start_sentence": 222,
      "end_sentence": 233,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.115105152130127,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "上善若水【上善之人如水之性】水善利万物【水在天为雾露在地为泉源也 】而不争处众人之所恶【众人恶卑湿垢浊水独静流居之也 ○恶去声】故几于道【水性几与道同○几音机】居善地【水性善喜于地草木之上即流而下有似于牝动而下人也 】心善渊【水深空虚渊深清明】与善仁【万物得水以生与虚不与盈也 】言善信【水内影照形不失其情也 】正善治【无冇不洗清且平也 】事善能【能方能圆曲直随形】动善时【夏散冬凝应期而动不失天时】夫唯不争【壅之则止决之则流听从人也 】故无尤【水性如是故天下无冇怨尤水者也 】",
      "translated_text": "The Highest Virtue Resembles Water\n\nThe highest virtue resembles water’s nature. Water benefits the myriad things yet contends not, dwelling where the multitude shuns. Thus it nearly accords with the Dao. In abode, it favors the low ground; in heart, it favors the deep and still; in giving, it favors generosity; in speech, it favors truth; in governance, it favors order; in service, it favors competence; in movement, it favors timeliness. Only because it does not contend does it remain free from blame.",
      "overlap_context": "it without strain: the qi should always be relaxed and unhurried, never urgent or labored.\n\nChapter Seven: Concealing Radiance\nHeaven and Earth endure. Heaven and Earth are able to be long and enduring because they do not live for themselves. Thus they are able to live long. Therefore the sage places himself behind, yet finds himself ahead; sets himself outside, yet finds himself preserved. Is it not because he is selfless? Thus he is able to fulfill his self.\n\nChapter Eight: Transforming Nature",
      "start_char": 4138,
      "end_char": 4372,
      "start_sentence": 234,
      "end_sentence": 242,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.2053728103637695,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "运夷第九 持而盈之不如其已【盈满也已止也持满必倾不如止也】揣而锐之不可长保【揣治也先揣之后必弃捐】金玉满堂莫之能守【嗜欲伤神财多累身】富贵而骄自遗其咎【夫富当赈贫贵当怜贱而反骄恣必被祸患也○遗去声咎音臼】功成名遂身退天之道【言人所为功成事立名迹称遂不退身避位则遇于害此乃天之常道也譬如日中则移月满则物盛则衰乐极则哀】 能为第十 载营魄【营魄魂魄也 人载魂魄之上得以生当爱养之喜怒亡魂卒惊伤魄魂在肝魄在肺美酒甘肴腐人肝肺故魂静志道不乱魄安得寿延年也 】抱一能无离【言人能抱一使不离于身则长存一者道始所生太和之精气也 故曰一布名于天下天得一以清地得一以宁侯王得一以为正平入为心出为行布施为德总名为一一之为言志一无二也 ○离去声】专气致柔【专守精气使不乱则形体能应之而柔顺】能婴儿【能如婴儿内无思虑外无政事则精神不去也 】涤除览【当洗其心使洁静也 心居冥之处览知万事故谓之览也 ○涤音迪】能无疵【不邪也 净能无疵病乎 ○疵音眦】爱民治国【治身者爱气则身全治国者爱民则国安】能无知【治身者呼吸精气无令耳 闻也 治国者布施惠德无令下知也",
      "translated_text": "**Chapter Nine: Embracing Simplicity**\n\nTo hold and fill it to overflowing is not as good as stopping.\nTo carve and sharpen it cannot be long preserved.\nWhen gold and jade fill the hall, none can guard them.\nWealth and honor with arrogance bring self-inflicted ruin.\nWhen merit is achieved and fame attained, withdraw the self—this is the Dao of Heaven.\n\n**Chapter Ten: Nurturing Power**\n\nIn bearing the soul,\nembrace the One and never depart from it.\nConcentrate qi to attain suppleness,\nbe like the infant.\nPurify the profound mirror,\nand remain free from flaw.\nIn loving the people and governing the state,\nact without cunning.\nIn opening and closing the gates of Heaven,\nbe like the female.\nIn illuminating the four directions,\nact without knowledge.\n\nCarrying the soul—\nthe soul is the spirit and the corporeal soul.\nMan bears them above and thereby lives;\nthey must be cherished and nurtured.\nJoy and anger scatter the spirit,\nsudden fright harms the corporeal soul.\nThe spirit dwells in the liver,\nthe corporeal soul in the lungs.\nFine wine and rich meats corrupt liver and lungs,\nso when the spirit is tranquil and the will aligned with the Dao,\nthe mind is not disordered,\nthe corporeal soul is at peace,\nand longevity is attained.\n\nEmbracing the One without departing—\nman who embraces the One and does not depart from the body\nabides long.\nThe One is the primordial qi of Great Harmony,\nthe origin from which the Dao arises.\nThus it is said:\nThe One spreads its name throughout the world.\nHeaven attains the One and becomes clear,\nEarth attains the One and becomes stable,\nlords and kings attain the One and bring rectitude and peace.\nInwardly, it is the heart;\noutwardly, it is conduct;\nin bestowal, it is virtue—\nall are named the One.\nThe One means singleness of purpose, undivided.\n\nConcentrate qi to attain suppleness—\nguard the essence of qi without disorder,\nand the body will respond with softness and compliance.\n\nBe like the infant—\nlike the infant, inwardly free from thought,\noutwardly free from affairs,\nso that the spirit does not depart.\n\nPurify the profound mirror—\nwash the heart to make it pure and still.\nThe heart dwells in the profound and obscure,\nyet surveys and knows the myriad things—\nthus it is called the profound mirror.\n\nRemain free from flaw—\nfree from depravity,\npure and without blemish.\n\nIn loving the people and governing the state—\nhe who governs the body loves qi, and the body is preserved;\nhe who governs the state loves the people, and the state is secure.\n\nAct without knowledge—\nhe who governs the body regulates breath and essence,\nallowing no sound to reach the ears.\nHe who governs the state bestows kindness and virtue,\nallowing no awareness below.",
      "overlap_context": "hest Virtue Resembles Water\n\nThe highest virtue resembles water’s nature. Water benefits the myriad things yet contends not, dwelling where the multitude shuns. Thus it nearly accords with the Dao. In abode, it favors the low ground; in heart, it favors the deep and still; in giving, it favors generosity; in speech, it favors truth; in governance, it favors order; in service, it favors competence; in movement, it favors timeliness. Only because it does not contend does it remain free from blame.",
      "start_char": 4372,
      "end_char": 4837,
      "start_sentence": 243,
      "end_sentence": 257,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.58663010597229,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "】天门开阖【天门谓北极紫防宫开阖谓终始五际也 治身天门谓鼻孔开谓喘息阖谓呼吸也 ○阖音盍】能无雌【治身当如雌牝安静柔弱治国应变和而不唱】明白四达【言达明白如日月四通满于天下八极之外故曰视之不见听之不闻彰布之于十方焕焕煌煌也 】能无知【无有能知道满于天下者】生之畜之【道生万物而畜养之】生而不有【道生万物无所取有】为而不恃【道所施为不恃望其报也 】长而不宰【道长养万物不宰割以为器用○长上声】是谓德【言道行德冥不可得见欲德人如道也 】 无用第十一",
      "translated_text": "---\n\nThe celestial gate opens and closes—\nthe celestial gate refers to the Purple Tenuity Palace at the North Star;\nopening and closing mark the five junctures of beginning and end.\nIn governing the body, the celestial gate refers to the nostrils:\nopening means inhalation and exhalation,\nclosing means breath held still.\n\nRemain without the feminine—\nin governing the body, be like the female: tranquil, still, soft, and yielding;\nin governing the state, respond to change with harmony, never taking the lead.\n\nLuminous clarity extends in all four directions—\nit is said to be so radiant and clear, like the sun and moon,\npervading all under heaven and beyond the eight directions.\nThus it is called: \"seen yet unseen, heard yet unheard,\"\nmanifesting throughout the ten directions,\nbrilliant and resplendent.\n\nRemain without knowledge—\nnone can know the Way that fills all under heaven.\n\nIt gives life and nurtures—\nthe Dao gives life to the myriad things and nurtures them.\n\nIt gives life yet does not possess—\nthe Dao gives life to the myriad things yet claims no ownership.\n\nIt acts yet does not rely—\nthe Dao enacts its work yet expects no recompense.\n\nIt fosters growth yet does not dominate—\nthe Dao fosters the growth of the myriad things yet does not carve or shape them for use.\n\nThis is called profound virtue—\nthe Dao’s virtue moves in profound obscurity, unseen.\nOne who would embody virtue must emulate the Dao.\n\nChapter Eleven: Uselessness",
      "overlap_context": "e myriad things—\nthus it is called the profound mirror.\n\nRemain free from flaw—\nfree from depravity,\npure and without blemish.\n\nIn loving the people and governing the state—\nhe who governs the body loves qi, and the body is preserved;\nhe who governs the state loves the people, and the state is secure.\n\nAct without knowledge—\nhe who governs the body regulates breath and essence,\nallowing no sound to reach the ears.\nHe who governs the state bestows kindness and virtue,\nallowing no awareness below.",
      "start_char": 4837,
      "end_char": 5059,
      "start_sentence": 258,
      "end_sentence": 264,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.26612639427185,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "三十辐共一毂【古者车三十辐法月数也 共一毂者毂中有孔故众辐共凑之治身者当除情去欲使五藏空虚神乃归之也 治国者寡能总众弱能使强○辐音福毂音谷】当其无有车之用【无谓空虚毂中空虚车得其行舆中空虚人能载其上也 ○当去声】埏埴以为器【埏和也 埴土也 和土以为饮食之器○埏音膻埴音植】当其无有器之用【器中空虚故得有所盛受】凿户牖以为室【谓作屋室】当其无有室之用【言户牖空虚人得以出入观视室中空虚人得以居处是其用】故有之以为利【利物也 利于形用器中有物室中有人恐其屋破坏腹中冇神畏形之消亡也 】无之以为用【言虚空者乃可用盛受万物故曰虚无能制有形道者空也 】 检欲第十二",
      "translated_text": "Thirty spokes converge upon a single hub—\nin ancient times, a chariot’s thirty spokes mirrored the moon’s count.\nThey converge upon one hub, for the hub has a hollow within,\nand thus the many spokes gather there.\nFor cultivating the body, one must dispel emotions and cast off desires,\nemptying the five viscera so that spirit may return to dwell within.\nFor governing the state, the few must unite the many,\nthe weak must empower the strong.\n\nYet it is by its very emptiness that the chariot serves its use—\n\"emptiness\" means the hollow within the hub,\nfor only when the hub is empty can the chariot move.\nThe carriage bed, too, is empty,\nso that one may load and bear upon it.\n\nKnead clay to fashion vessels—\n\"knead\" means to blend, \"clay\" means earth,\nblending earth to make vessels for food and drink.\nYet it is by its very emptiness that the vessel serves its use—\nonly when the vessel is hollow can it hold and receive.\n\nCarve doors and windows to make a chamber—\nthis is to construct a dwelling.\nYet it is by its very emptiness that the chamber serves its use—\nthe doors and windows are empty, so one may enter and exit, look and see;\nthe chamber is empty, so one may dwell within.\nThus, what is present is for the sake of benefit—\nbenefit to things, for the vessel holds objects,\nthe chamber shelters people.\nOne fears the roof’s collapse, the belly’s loss of spirit,\nand dreads the decay of form.\n\nWhat is absent is for the sake of function—\nit is the hollow and empty that can receive and contain the myriad things.\nThus it is said: the void can master the formed,\nand the Dao is empty.",
      "overlap_context": "gs and nurtures them.\n\nIt gives life yet does not possess—\nthe Dao gives life to the myriad things yet claims no ownership.\n\nIt acts yet does not rely—\nthe Dao enacts its work yet expects no recompense.\n\nIt fosters growth yet does not dominate—\nthe Dao fosters the growth of the myriad things yet does not carve or shape them for use.\n\nThis is called profound virtue—\nthe Dao’s virtue moves in profound obscurity, unseen.\nOne who would embody virtue must emulate the Dao.\n\nChapter Eleven: Uselessness",
      "start_char": 5059,
      "end_char": 5333,
      "start_sentence": 265,
      "end_sentence": 274,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.04055404663086,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "五色令人目盲【贪好色则伤精失明也 ○令平声】五音令人耳 聋【好听五音则和气去心不能听无声之声】五味令人口爽【爽亡也 人嗜五味于口则口亡言失于道味也 】驰骋田猎令人心发狂【人精神好安静驰骋呼吸精神散亡故发狂也 】难得之货令人行妨【妨伤也 难得之货谓金银珠玉心贪意欲不知厌足则行伤身辱也 ○行去声妨音方】是以圣人为腹【守五性去六情节志气养神明】不为目【目不妄视妄视泄精于外】故去彼取此【去彼目之妄视取此腹之养性○去上声】 厌耻第十三 宠辱若惊【身宠亦惊身辱亦惊】贵大患若身【贵畏也若至也畏大患至身故皆惊】何谓宠辱【问何为宠何为辱宠者尊荣辱者耻辱及身还自问者以晓人也】辱为下【辱为下贱】得之若惊【得宠荣惊者处高位如临深危也贵不敢骄富不敢奢】失之若惊【失者失宠处辱也惊者恐祸重来也】是谓宠辱若惊【解上得之若惊失之若惊】何谓贵大患若身【复还自问何故畏人若身】吾所以有大患者为吾有身【吾所以有大患】 【者为吾有身有身忧其勤劳念其饥寒触情从欲则遇祸患也】及吾无身吾有何患【使吾无有身体得道自然轻举升云出入无间与道通神当有何患】故贵以身为天下者则可寄于天下【言人君贵其身而贱人欲为天下主者则可寄立不可以久也○为去声】爱以身为天下者乃可以托于天下【言人君能爱其身非为己也乃欲为万民之父母以此得为天下主者乃可以托其身于万民之上长无咎也】 赞第十四 视之不见名曰夷【无色曰夷言一无采色不可得视而见之】听之不闻名曰希【无声曰希言一无音声不可得听而闻之】搏之不得名曰微【无形曰微言一无形体不可搏持而得之】此三者不可致诘【三者谓夷希微也 不可致诘者谓无色无声无形口不能言书不能传当受之以静求之以神不可诘问而得之也 】故混而为一【混合也 故合于三名之而为一】其上不皦【言一在天上不皦皦光明○皦音皎】其下不昧【言一在天下不昧昧有所暗冥○昧音妹】绳绳不可名【绳绳者动行无穷极也 不可名者非一色也 不可以青黄白黑别非一声也 不可以宫商角征羽听非一形也 不可以长短大小度之也 】复归于无物【物质也 复当归之于无质○复音服】是谓无状之状【言一无形状而能为万物作形状也 】无物之象【一无物质而为万物设形象也 】是为忽恍【一忽忽恍恍者若存若亡不可见之也 】迎之不见其首【一无端末不可预待也 除情去欲一自归之也 】随之不见其后【言一无形迹不可得而看】执古之道以御今之有【圣人执守古道生一以御物知今当有一也 】能知古始是谓道纪【人能知上古本始有一是谓知道纲纪也 】 显德第十五",
      "translated_text": "The five colors blind the eyes—\nto covet and indulge in beauty harms the essence and loses sight.\n\nThe five tones deafen the ears—\nto delight in the five sounds drives harmony from the heart,\nso one cannot hear the soundless sound.\n\nThe five flavors dull the mouth—\n\"dull\" means loss; when one craves the five flavors,\nthe mouth loses its speech and strays from the Dao’s savor.\n\nGalloping and hunting madden the heart—\nthe human spirit naturally favors stillness;\ngalloping and panting scatter the spirit, so madness arises.\n\nRare and precious goods obstruct conduct—\n\"obstruct\" means harm; rare goods are gold, silver, pearls, jade;\nwhen the heart covets and desires without satiety,\nconduct is harmed, the body shamed.\n\nThus the sage attends to the belly—\npreserving the five natures, shedding the six passions,\nrestraining the will, nurturing spirit and clarity—\nand not to the eyes—\nthe eyes must not gaze recklessly, for reckless gazing leaks essence outward.\n\nTherefore, discard that and take this—\ndiscard the eyes’ reckless gazing, take the belly’s nurturing of nature.\n\n---\n\nFavor and disgrace are both startling—\nthe body is favored, it startles; the body is disgraced, it startles.\n\nTo value great calamity is as if it were the self—\n\"value\" means to fear; \"as if\" means \"to reach\";\nto fear great calamity reaching the self, thus all startle.\n\nWhat is meant by favor and disgrace?\nDisgrace is lowly.\nTo gain it is startling—\ngaining favor and honor is startling, for one stands in high position as if over a deep abyss;\none dare not be arrogant in nobility, dare not be extravagant in wealth.\nTo lose it is startling—\nloss means losing favor and falling into disgrace;\nstartling means fearing disaster’s return.\n\nThis is what is meant by favor and disgrace both startling.\n\nWhat is meant by valuing great calamity as if it were the self?\nThe reason I have great calamity is that I have a self—\nhaving a self, I worry over toil and labor, think of hunger and cold;\nfollowing emotions and desires, I encounter misfortune.\nIf I had no self, what calamity would I have?\n\nThus, one who values the self to govern the world may be entrusted with the world—\nto say a ruler values the self and despises others,\ndesiring to be lord of the world, may be provisionally established,\nbut cannot endure long.\n\nOne who cherishes the self for the sake of the world may be entrusted with the world—\nto say a ruler can cherish the self not for personal gain,\nbut to be father and mother to the myriad people,\nthus becoming lord of the world, may be entrusted with the self above the myriad people,\nand long remain without fault.\n\n---\n\nLook and it cannot be seen—it is called \"subtle\";\nlisten and it cannot be heard—it is called \"rare\";\ngrasp and it cannot be held—it is called \"minute.\"\n\nThese three cannot be exhaustively questioned—\nthese three are subtle, rare, and minute;\n\"cannot be exhaustively questioned\" means:\nwithout color, without sound, without form,\nthe mouth cannot speak of it, writing cannot transmit it;\nit must be received in stillness, sought with spirit,\nand cannot be questioned to obtain it.\n\nThus they merge into one—\n\"merge\" means to unite the three names into one.\n\nAbove, it is not bright—\nto say the one in the heavens is not dazzlingly bright.\n\nBelow, it is not dark—\nto say the one in the earth is not dimly obscure.\n\nVast and boundless, it cannot be named—\n\"vast and boundless\" means moving and acting without end;\n\"cannot be named\" means it is not one color—\nit cannot be distinguished as green, yellow, white, or black;\nnot one sound—\nit cannot be heard as gong, shang, jue, zhi, or yu;\nnot one form—\nit cannot be measured as long or short, large or small.\n\nIt returns to nothingness—\n\"nothingness\" means no substance;\nit should return to no substance.\n\nThis is called the formless form—\nto say the one has no form yet can give form to the myriad things.\n\nThe image of no-thing—\nthe one has no substance yet sets forth the images of the myriad things.\n\nThis is called \"elusive and evanescent\"—\nthe one is elusive and evanescent, as if present, as if absent,\nand cannot be seen.\n\nMeet it and its beginning is not seen—\nthe one has no beginning or end, cannot be awaited in advance;\ncast aside emotions and desires, and the one naturally returns.\n\nFollow it and its end is not seen—\nto say the one leaves no traces, cannot be observed.\n\nGrasp the ancient Dao to steer the present being—\nthe sage holds fast to the ancient Dao, generates the one,\nto steer things and know that the present should have the one.\n\nTo know the ancient beginning is called the thread of the Dao.",
      "overlap_context": "pty, so one may enter and exit, look and see;\nthe chamber is empty, so one may dwell within.\nThus, what is present is for the sake of benefit—\nbenefit to things, for the vessel holds objects,\nthe chamber shelters people.\nOne fears the roof’s collapse, the belly’s loss of spirit,\nand dreads the decay of form.\n\nWhat is absent is for the sake of function—\nit is the hollow and empty that can receive and contain the myriad things.\nThus it is said: the void can master the formed,\nand the Dao is empty.",
      "start_char": 5333,
      "end_char": 6341,
      "start_sentence": 275,
      "end_sentence": 304,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.602872371673584,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "古之善为士者【谓得道之君也 】微妙通【天也 言其志节妙精与天通也 】深不可识【道德深远不可识知内视若盲反听若聋莫知所长】夫唯不可识故强为之容【谓下句也 ○强上声】与兮若冬渉川【举事輙加重慎与与兮若冬渉川心犹难之也 】犹兮若畏四邻【其进退犹犹如拘制若人犯法畏四邻知之也 】俨兮其若客【如客畏主人俨然无所造作也 】涣兮若氷之将释【涣者解散释者消亡除情去欲日以空虚】敦兮其若朴【敦者质厚朴者形未分内守精神外无文采也 】旷兮其若谷【旷者宽大谷者空虚不有德功名无所不包也 】浑兮其若浊【浑者守举真浊者不昭然也 与众合同不自专】孰能浊以静之徐清【孰谁也 谁能知水之浊止而静之徐徐自清也 】孰能安以久动之徐生【谁能安静以久徐徐以长生也 】保此道者不欲盈【保此徐生之道不欲奢泰盈溢】夫唯不盈故能蔽不新成【夫唯不盈满之人能守蔽不为新成蔽者匿光荣也 新成者贵功名○夫音符】 归根第十六 至虚极【得道之人捐情去欲五内清净至于虚极】守静笃【守清净行笃厚】万物并作【作生也 万物并生也 】吾以观其复【言吾以观见万物无不皆归其本也 人当念重本也 】夫物芸芸【芸芸者华叶盛】各复归其根【言万物无不枯落各复反其根而更生也 】归根曰静【静谓根也 根安静柔弱谦卑处下故不复死也 】是谓复命【言安静者是为复还性命使不死也 】复命曰常【复命使不死乃道之所常行也 】知常曰明【能知道之所常行则为明】不知常萎作凶【不知道之所常行妄作巧诈则失神明故凶也 】知常容【能知道之所常行去情忘欲无所不包容也 】容乃公【无所不包容则公正无私众邪莫当】公乃王【公正无私可以为天下王治身正则形一神明千万共凑已躬也 】王乃天【能正德合神明乃与天子】天乃道【德与天通则与道合同也 】道乃久【与道合同乃能长久】没身不殆【能公能天通天合道四者纯备道德远无殃无咎乃与天地俱没不危殆也 】 河上公章句第二",
      "translated_text": "Those of old who were adept as scholar-officials—\nthey were rulers who attained the Dao, subtle and wondrous, penetrating the mysteries,\ntheir aspirations and integrity profound and marvelous, their essence in communion with Heaven.\nDeep beyond comprehension—\ntheir virtue and power ran so deep it could not be fathomed;\ninwardly they saw as if blind, turned their hearing back as if deaf,\nso none could perceive their excellence.\n\nOnly because they could not be fathomed were they forced to adopt appearances:\nhesitant, as if crossing a river in winter;\ncautious, as if fearing their four neighbors;\nsolemn, as if they were guests;\ndissolving, as ice about to melt;\nsimple, as uncarved wood;\nvast, as a valley;\nturbid, as muddied waters.\n\nWho can still the turbid and gradually clarify it?\nWho can remain at rest and through long movement gradually bring forth life?\nThose who preserve this Dao do not seek fullness.\nOnly by not being full can one remain concealed, not newly accomplished.\n\nReturning to the Root\n\nAttain utmost emptiness,\nhold fast to stillness with unwavering depth.\nThe myriad things arise together—\nI thereby observe their return.\nThings flourish in abundance,\nyet each returns to its root.\nReturning to the root is called stillness;\nthis is called restoring life.\nRestoring life is called the constant.\nTo know the constant is called illumination.\nNot knowing the constant leads to reckless action and misfortune.\nKnowing the constant brings capacity;\ncapacity leads to impartiality;\nimpartiality leads to kingship;\nkingship leads to Heaven;\nHeaven leads to the Dao;\nthe Dao leads to enduring.\nThough the body perishes, it does not face peril.",
      "overlap_context": "e seen.\n\nMeet it and its beginning is not seen—\nthe one has no beginning or end, cannot be awaited in advance;\ncast aside emotions and desires, and the one naturally returns.\n\nFollow it and its end is not seen—\nto say the one leaves no traces, cannot be observed.\n\nGrasp the ancient Dao to steer the present being—\nthe sage holds fast to the ancient Dao, generates the one,\nto steer things and know that the present should have the one.\n\nTo know the ancient beginning is called the thread of the Dao.",
      "start_char": 6341,
      "end_char": 7092,
      "start_sentence": 305,
      "end_sentence": 336,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.883906602859497,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "淳风第十七 太上下知有之【太上谓太古无名之君也下知有之者下知上有君而不臣事质朴也】其次亲之誉之【其德可见恩惠可称故亲爱而誉之】其次畏之【设刑法以治之】其次侮之【禁多令烦不可归诚故欺侮之】信不足焉有不信【君信不足于下下则应之以不信而欺其君也】犹兮其贵言【太上之君举事犹贵重于言恐离道失自然】功成事遂【谓天下太平也】百姓皆谓我自然【百姓不知君上之德淳厚反以为只自当然也】 俗薄第十八 大道废有仁义【大道之时家有孝子户有忠信仁义不见也大道废不用恶逆生乃有仁义可传道】智惠出有大伪【智惠之君贱德而贵言贱质而贵文下则应之以为大伪奸诈】六亲不和有孝慈【六亲绝亲戚不和乃有孝慈相牧养也】国家昏乱有忠臣【政令不行上下相怨邪辟争权乃有忠臣匡正其君也此言天下太平不知仁义尽无欲不知廉各防已不知贞大道之君仁义没孝慈灭犹日中盛时众星失光】 还淳第十九 绝圣【绝圣制作反初守元五帝垂象苍颉作书不如三皇结绳无文】弃智【弃智惠反无为】民利百倍【农事修公无私】绝仁弃义【绝仁之见恩惠弃义之尚华信】民复孝慈【德化淳也 】绝巧弃利【绝巧者诈伪乱真也 弃利者塞贪路闭权门也 】盗贼无有【上化公政下无邪私】此三者【谓上三事所弃绝也 】以为文不足【以为文不足者文不足以教民】故令有所属【当如下句○令平声属音烛】见素抱朴【见素者当抱素守真不尚文饰也 抱朴者当见其笃朴以示下故可法则○见音现】少私寡欲【少私者正无私也 寡欲者当知足也 】",
      "translated_text": "**Pure Wind, Chapter Seventeen**\n\nIn the highest antiquity, the rulers were unknown to the people below.\nThe people merely knew of their existence but did not serve them as subjects—so simple and unadorned were they.\nNext came those whom the people cherished and praised,\nfor their virtue was visible and their kindness commendable.\nThen came those whom the people feared,\nfor they established laws and punishments to govern.\nFinally came those whom the people scorned,\nfor their prohibitions were many and commands burdensome, making sincerity impossible—thus they were deceived and mocked.\nWhen trust is insufficient, distrust arises.\nThe people respond to their ruler’s lack of trust with their own distrust, deceiving their lord.\n\nHow cautious were the rulers of the highest antiquity in their speech,\nfor they treasured words, fearing deviation from the Dao and loss of spontaneity.\nWhen their work was accomplished and affairs were settled—\nthe world at peace—\nthe common people all said, *\"We are naturally thus.\"*\nThey did not perceive the ruler’s virtue as profound but instead believed it to be simply as it should be.\n\n**The Decline of Custom, Chapter Eighteen**\n\nWhen the Great Dao is abandoned, benevolence and righteousness appear.\nIn the age of the Great Dao, every household had filial children, every door had loyalty and trust—benevolence and righteousness were unseen.\nWhen the Great Dao is forsaken and not practiced, wickedness and rebellion arise, and only then do benevolence and righteousness become worthy of transmission.\n\nWhen cunning and wisdom emerge, great deceit follows.\nThe ruler who values cleverness over virtue and words over substance will be met by the people with great falsity and treachery.\nWhen the six relations are in discord, filial piety and compassion arise.\nOnly when kinship is severed and relatives are estranged do filial piety and compassion become necessary to nurture one another.\nWhen the state is in chaos and disorder, loyal ministers appear.\nOnly when governance fails, superiors and inferiors resent one another, and the perverse contend for power do loyal ministers emerge to correct their lord.\n\nThis speaks of the world in great peace, where benevolence and righteousness are unknown, desires are absent, integrity is unneeded, and self-restraint is unrecognized.\nIn the age of the Dao’s rulers, benevolence and righteousness vanish, filial piety and compassion fade—like the sun at its zenith, when the stars lose their light.\n\n**Returning to Simplicity, Chapter Nineteen**\n\nAbandon sagacity,\nrejecting artificial craft and returning to the origin, preserving the primordial.\nThe Five Emperors’ symbols and Cang Jie’s script were not as good as the Three Sovereigns’ knotted cords and unadorned records.\nDiscard wisdom,\nforsaking cleverness and returning to non-action.\nThe people’s benefit will increase a hundredfold,\nfor agriculture will flourish and selfishness will vanish.\n\nAbandon benevolence, cast aside righteousness,\nrejecting the display of kindness and the exaltation of hollow trust.\nThe people will return to filial piety and compassion,\nfor virtue’s transformation will be pure.\nAbandon artifice, cast aside profit,\nrejecting deceit that distorts truth and blocking the paths of greed and the gates of power.\nThieves and bandits will cease to exist.\n\nThese three things—\nthe three matters to be abandoned—\nare deemed insufficient as cultural teachings.\nThus, let them be guided as follows:\n\nManifest plainness, embrace simplicity.\nTo manifest plainness is to hold fast to the unadorned and guard the true, not prizing embellishment.\nTo embrace simplicity is to display one’s sincerity and plainness, so that the people may take it as a model.\n\nReduce selfishness, diminish desires.\nTo reduce selfishness is to be upright and free of partiality.\nTo diminish desires is to know contentment.",
      "overlap_context": "sh in abundance,\nyet each returns to its root.\nReturning to the root is called stillness;\nthis is called restoring life.\nRestoring life is called the constant.\nTo know the constant is called illumination.\nNot knowing the constant leads to reckless action and misfortune.\nKnowing the constant brings capacity;\ncapacity leads to impartiality;\nimpartiality leads to kingship;\nkingship leads to Heaven;\nHeaven leads to the Dao;\nthe Dao leads to enduring.\nThough the body perishes, it does not face peril.",
      "start_char": 7092,
      "end_char": 7694,
      "start_sentence": 337,
      "end_sentence": 349,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.451323986053467,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "异俗第二十 绝学【绝学不真不合道文】无忧【除浮华则无忧患也 】唯之与阿相去几何【同为应对而相去几何疾时贱质而贵文○唯上声】善之与恶相去何若【善者和誉恶者谏争能相去何如疾时恶忠直用邪佞也 】人之所畏不可不畏【人谓道人也 人所畏者畏不绝学之君也 不可不畏近令色杀仁贤】荒兮其未央哉 【或言世俗人荒乱欲进学为文未央止也 】众人熙熙【熙熙滛放多情欲也 】如享太牢【如饥思太牢之具意无足时也 】如登春台【春阴阳交通万物感动登台观之意志滛滛然】我独怕兮其未兆【我独怕然安静未有情欲之形兆也 ○怕音拍】如婴儿之未孩【如小儿未能答偶人时也 】乘乘兮若无所归【我乘乘如穷鄙无所归就○乘平声】众人皆有余【众人余财以为奢余智以为诈】而我独若遗【我独如遗弃似于不足也 】我愚人之心也 哉",
      "translated_text": "**Chapter Twenty: Divergent Customs**\n\nAbandon learning—\nwhat is not true does not accord with the Dao.\nWithout care—\ncasting aside superficial adornment, there is no anxiety.\n\nHow far apart are \"aye\" and \"nay\"?\nBoth are responses, yet how distant they are—\nthe age scorns substance and prizes ornament.\n\nHow far apart are good and evil?\nOne brings harmony and praise, the other remonstrance and contention—\nyet how distant they are!\nThe age loathes loyalty and uprightness, favoring flattery and deceit.\n\nWhat others fear, one cannot but fear—\nothers refer to those of the Dao.\nWhat they fear is the ruler who does not abandon learning.\nOne cannot but fear the approach of flattery that slays benevolence and worthies.\n\nVast and boundless, it has not yet reached its end—\nsome say the people of the world, disordered and reckless,\nrush to pursue learning and ornamentation, never ceasing.\n\nThe multitude, gleeful and wanton—\nlike feasting on a grand sacrifice,\ntheir desires insatiable,\nor ascending a spring terrace,\nwhere yin and yang commingle, the myriad things stirred,\nthey gaze upon it with intent, their wills licentious.\n\nI alone am still, without sign—\ntranquil and unmoved, no trace of desire’s form appears.\n\nLike an infant who has not yet learned to smile—\nlike a child who cannot yet respond to playthings.\n\nAdrift, as if with nowhere to return—\nI wander, like one destitute, with no place to settle.\n\nThe multitude all have more than enough—\ntheir wealth in excess, they indulge in extravagance,\ntheir cunning in excess, they practice deceit.\n\nYet I alone seem forsaken—\nas if cast aside, as though lacking.\n\nAh, the heart of this foolish one!",
      "overlap_context": " to be abandoned—\nare deemed insufficient as cultural teachings.\nThus, let them be guided as follows:\n\nManifest plainness, embrace simplicity.\nTo manifest plainness is to hold fast to the unadorned and guard the true, not prizing embellishment.\nTo embrace simplicity is to display one’s sincerity and plainness, so that the people may take it as a model.\n\nReduce selfishness, diminish desires.\nTo reduce selfishness is to be upright and free of partiality.\nTo diminish desires is to know contentment.",
      "start_char": 7694,
      "end_char": 8017,
      "start_sentence": 350,
      "end_sentence": 363,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.4434232711792,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "【不与俗人相随守一不移如愚人之心也 】沌沌兮【无所分别】俗人昭昭【明且达也 】我独若昏【如暗昧也 】俗人察察【察察急且疾也 】我独闷闷【闷闷无所割截】忽兮若海【我独忽忽如江海之流莫知其所穷极也 】漂兮若无止【我独漂漂若飞若扬无所止也 志意在神域也 】众人皆有以【以有为也 】而我独顽【我独无为】似鄙【鄙似若不逮也 】我独异于人【我独与人异也 】而贵食母【食用也 母道也 我独贵用道也 】 虚心第二十一 孔德之容【孔大也 有大德之人无所不容能受垢浊处谦卑也 】唯道是从【唯独也 大德之人不随世俗所行独从于道也 】道之为物唯怳唯忽【道之于万物独怳忽徃来于其无所定也 ○怳音恍】忽兮怳兮其中有像【道唯忽怳无形之中独为万物法像】怳兮忽兮其中有物【道唯怳忽其中有一经营主化因气立质】窈兮冥兮其中有精【道唯窈冥无形其中有精实神明相薄阴阳交防也 ○窈音杳】其精甚真【言存精气其妙甚真非有饰也 】其中有信【道匿功藏名其信在中也 】自古及今其名不去【自从也 自古至今道常在不去】以阅众甫【阅禀也 甫始也 言道禀与万物始生从道受气】吾何以知众甫之然哉 【我何以知从道受气】以此【此今也 以今万物皆得道精炁而生动作起居非道不然】 益谦第二十二 曲则全【曲已从众不自专则全其身也 】枉则直【枉屈己而申人久久自得直也 】洼则盈【地洼下水流之人谦下德归之也 ○洼音蛙】弊则新【自受薄后己先人天下敬之久久自新也 】少则得【自受取少则得多也 天道佑谦神明托虚】多则惑【财多者惑于所守学多者惑于所闻】是以圣人抱一为天下式【抱守法式也 圣人守一乃知万事故能为天下法式也 】不自见故明【圣人不以其目视千里之外也 乃因天下之目以视故能明达也 ○见音现】不自是故彰【圣人不自以为是而非人故能彰显于世】不自伐故有功【伐取也 圣人德化流行不自取其美故有功于天下】不自矜故长【矜大也 圣人不自贵大故能久不危】夫唯不争故天下莫与之争【此言天下贤与不肖无能与不争者争也 】古之所谓曲则全者岂虚言哉 【传古言曲从则全身正言非虚妄也 】诚全而归之【诚实也 能行曲从者实其肌体归之于父母无有伤害也 】 虚无第二十三",
      "translated_text": "I do not follow the vulgar, holding fast to the One without wavering—\nlike the heart of a fool.\n\nTurbid, turbid—\nwithout distinction.\n\nThe vulgar are bright and clear,\nwhile I alone seem dim.\n\nThe vulgar are sharp and keen,\nwhile I alone am dull and uncut.\n\nVast, like the sea—\nI drift, as though without end.\n\nAdrift, as though without halt—\nmy will abides in the realm of spirit.\n\nThe multitude all have their means,\nwhile I alone am stubborn,\nseeming crude.\n\nI alone differ from others,\nyet I honor the nourishment of the Mother.\n\n---\n\n**Emptiness and Receptivity (Chapter 21)**\nThe bearing of great virtue\nfollows only the Dao.\n\nAs for the Dao as a thing—\nit is vague, it is fleeting.\n\nFleeting, vague—\nwithin it there are images.\n\nVague, fleeting—\nwithin it there are things.\n\nProfound, obscure—\nwithin it there is essence.\n\nIts essence is most true,\nwithin it there is trustworthiness.\n\nFrom ancient times to the present,\nits name does not depart,\nby which we witness the origins of the myriad.\n\nHow do I know the origins of the myriad are thus?\nBy this.\n\n---\n\n**Increase Through Humility (Chapter 22)**\nTo bend is to be whole,\nto yield is to be straight.\n\nTo be hollow is to be filled,\nto be worn is to be renewed.\n\nTo have little is to gain,\nto have much is to be confounded.\n\nTherefore the sage embraces the One\nand becomes the model for the world.\n\nNot asserting oneself, thus one is enlightened;\nnot self-righteous, thus one is distinguished;\nnot boasting, thus one has merit;\nnot self-aggrandizing, thus one endures.\n\nIt is only because one does not contend\nthat none in the world can contend with them.\n\nThe ancient saying, \"To bend is to be whole,\"\nhow could it be empty words?\n\nTruly, to be whole is to return to it.\n\n---\n\n**Emptiness and Non-Being (Chapter 23)**",
      "overlap_context": "ign—\ntranquil and unmoved, no trace of desire’s form appears.\n\nLike an infant who has not yet learned to smile—\nlike a child who cannot yet respond to playthings.\n\nAdrift, as if with nowhere to return—\nI wander, like one destitute, with no place to settle.\n\nThe multitude all have more than enough—\ntheir wealth in excess, they indulge in extravagance,\ntheir cunning in excess, they practice deceit.\n\nYet I alone seem forsaken—\nas if cast aside, as though lacking.\n\nAh, the heart of this foolish one!",
      "start_char": 8017,
      "end_char": 8865,
      "start_sentence": 364,
      "end_sentence": 411,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.400880813598633,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "希言自然【希言者是爱言也 爱言者自然之道】飘风不终朝骤雨不终日【飘风疾风也 骤雨暴雨也 言疾不能长暴不能久也 】孰为此者天地【孰谁也 谁为此飘风暴雨者乎 天地所为】天地尚不能久【不终于朝暮也 】而况于人乎 【天地至神合为飘风暴雨尚不能使终朝至暮何况人欲为暴卒乎 】故从事于道者【从为也 人为事当如道安静不当如飘风骤雨】道者同于道【道者谓好道人也 同于道者所谓与道同】德者同于德【德为好德人也 同于德者所谓与德同也 】失者同于失【失谓任巳失人也 同于失者所谓与失同也 】同于道者道亦乐得之【与道同者道亦乐得之也 】同于德者德亦乐得之【与德同者德亦乐得之也 】同于失者失亦乐失之【与失同者失亦乐失之也 】信不足焉 【君信不足于下下则应君以不足也 】有不信焉 【此言物相归同声相应云从龙风从虎水流湿火就燥自然之也 】 苦恩第二十四",
      "translated_text": "Silent Harmony Follows Nature (Chapter 23)\n\nTo speak sparingly is to follow nature.\nA whirlwind does not last the morning;\na sudden storm does not last the day.\n\nWhat causes these?\nHeaven and earth.\nIf even heaven and earth cannot make them last,\nhow much less can man?\n\nThus, those who align with the Dao\nare one with the Dao.\nThose who align with virtue\nare one with virtue.\nThose who align with loss\nare one with loss.\n\nThose who are one with the Dao,\nthe Dao delights in them.\nThose who are one with virtue,\nvirtue delights in them.\nThose who are one with loss,\nloss delights in them.\n\nWhen trust is insufficient,\nthere is distrust.\n\nHow things naturally converge:\nlike sounds echoing,\nlike dragons following clouds,\nlike tigers following wind,\nlike water flowing to the wet,\nlike fire tending to the dry.",
      "overlap_context": "nded.\n\nTherefore the sage embraces the One\nand becomes the model for the world.\n\nNot asserting oneself, thus one is enlightened;\nnot self-righteous, thus one is distinguished;\nnot boasting, thus one has merit;\nnot self-aggrandizing, thus one endures.\n\nIt is only because one does not contend\nthat none in the world can contend with them.\n\nThe ancient saying, \"To bend is to be whole,\"\nhow could it be empty words?\n\nTruly, to be whole is to return to it.\n\n---\n\n**Emptiness and Non-Being (Chapter 23)**",
      "start_char": 8865,
      "end_char": 9212,
      "start_sentence": 412,
      "end_sentence": 435,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.837614297866821,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "跂者不立【进也 谓贪权慕名进取功荣也 则不可久立身行道也 ○跂音企又去声】跨者不行【自以为贵而跨于人众共蔽之使不得行】自见者不明【人自见其形容以为好自见所行以为应道殊不自知其形猊操行之鄙】自是者不彰【自以为是而非人众共蔽之使不得彰明】自伐者无功【所谓輙自伐取其功美即失有功于人也 】自矜者不长【好自矜大者不可以长久】其于道也 曰余食赘行【赘贪也 使此自矜伐之人在治国之道曰然敛余禄食为赘行○行去声】物或恶之【此人在位动欲伤害故物无有不畏恶也 ○恶去声】故有道者不处也 【言有道之人不居其国也 】 象元第二十五",
      "translated_text": "He Who Stands on Tiptoe Does Not Stand Firm (Chapter 24)\n\nHe who stands on tiptoe cannot stand long—\nthis means one who grasps for power and fame,\nseeking glory and advancement,\ncannot long maintain integrity or walk the Way.\n\nHe who strides cannot walk far—\nthis means one who deems himself noble\nand strides above others,\nis collectively obstructed and cannot proceed.\n\nHe who displays himself is not enlightened—\none who admires his own appearance as fine,\nor his own conduct as aligned with the Way,\nfails to recognize the baseness of his form and the vulgarity of his actions.\n\nHe who is self-righteous is not illustrious—\none who deems himself right and others wrong\nis collectively obscured and cannot be made manifest.\n\nHe who boasts achieves no merit—\nthis means one who constantly boasts of his achievements\nloses the merit he might have gained from others.\n\nHe who is self-aggrandizing does not endure—\none who takes pride in his own greatness\ncannot long persist.\n\nIn relation to the Way, these are called\n\"leftover food and parasitic conduct\"—\nthis describes those who are self-aggrandizing and boastful:\nin governing a state, they amass surplus emoluments,\nengaging in parasitic conduct.\n\nAll things detest them—\nsuch people, when in power, act with harmful intent,\nso there is nothing that does not fear and despise them.\n\nThus, those who possess the Way do not remain in such a place.\n\nImage and Origin (Chapter 25)",
      "overlap_context": " one with the Dao.\nThose who align with virtue\nare one with virtue.\nThose who align with loss\nare one with loss.\n\nThose who are one with the Dao,\nthe Dao delights in them.\nThose who are one with virtue,\nvirtue delights in them.\nThose who are one with loss,\nloss delights in them.\n\nWhen trust is insufficient,\nthere is distrust.\n\nHow things naturally converge:\nlike sounds echoing,\nlike dragons following clouds,\nlike tigers following wind,\nlike water flowing to the wet,\nlike fire tending to the dry.",
      "start_char": 9212,
      "end_char": 9463,
      "start_sentence": 436,
      "end_sentence": 446,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.748894691467285,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "有物混成先天地生【谓道无形混沌而成万物乃在天地之前○先去声】寂兮寥兮独立而不改【寂者无音声寥者空无形独立者无匹双不改者化有常】周行而不殆【道通行天地无所不入在阳不焦托阴不腐无不贯穿不危殆】可以为天下母【道育养万物精气如母之养子】吾不知其名字之曰道【我不见道形容不知当何以名之见万物皆从道所生故字之曰道也 】强为之名曰大【不知其名强曰大者高而无上罗而无外无不包容故曰大也 ○强上声】大曰逝【其为大非若天常在上非若地常在下乃复逝去无常处所也 】逝曰远【言远者穷乎 无穷布气天地无所不通也 】远曰反【言其远不越绝乃复在人身也 】故道大天大地大王亦大【道大者包罗诸天地无所不容也 天大者无所不盖也 地大者无所不载也 王大者无所不制也 】域中有四大【四大道天地王也 凡有称有名则非其极也 言道则冇所由有所由然后谓之为道然则是道称中之大也 不若无称之大也 无称不可得而名曰域也 天地王皆在乎 无称之内也 故曰域中有四大者也 】而王居其一焉 【八极之功有四大王居其一也 居一作处】人法地【人当法地安静柔和也 种之得五谷掘之得甘泉劳而不怨也 有功而不制也 】地法天【天湛泊不动施而不求报生长万物无所收取】天法道【道清净不言阴行精气万物自成也 】道法自然【道性自然无所法也 】",
      "translated_text": "There exists a thing, chaotic yet complete,\nborn before heaven and earth.\nSilent, oh! Void, oh!\nStanding alone, unchanging.\nCircling endlessly, never weary—\nit may be called the Mother of all under heaven.\nI know not its name;\nI style it \"Dao.\"\nForced to name it, I say \"Great.\"\nGreat, it flows away;\nflowing away, it is distant;\ndistant, it returns.\nThus, the Dao is great, heaven is great,\nearth is great, and the king, too, is great.\nWithin the realm, there are Four Greats—\nthe Dao, heaven, earth, and the king.\nThe king occupies one among them.\n\nMan models himself on earth;\nearth models itself on heaven;\nheaven models itself on the Dao;\nthe Dao models itself on spontaneity.",
      "overlap_context": "de in his own greatness\ncannot long persist.\n\nIn relation to the Way, these are called\n\"leftover food and parasitic conduct\"—\nthis describes those who are self-aggrandizing and boastful:\nin governing a state, they amass surplus emoluments,\nengaging in parasitic conduct.\n\nAll things detest them—\nsuch people, when in power, act with harmful intent,\nso there is nothing that does not fear and despise them.\n\nThus, those who possess the Way do not remain in such a place.\n\nImage and Origin (Chapter 25)",
      "start_char": 9463,
      "end_char": 9970,
      "start_sentence": 447,
      "end_sentence": 472,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.5763099193573,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "重德第二十六 重为经根【人君不重则不尊治身不重则失神草木之华轻故零落根重故长存也 ○轻去声】静为躁君【人君不静则失威治身不静则身危龙静故能变化虎躁故天亏也 ○躁音灶】是以圣人终日行不离辎重【辎静也 圣人终日行道不离其静与重也 ○离音利辎音缁重去声】虽有荣观燕处超然【荣观谓宫观燕处后妃所居也 超然远避而不处也 ○观去声】奈何万乘之主【奈何者疾时主伤痛之辞万乘之主谓王○乘去声】而以身轻天下【王者至尊而以其身行轻躁乎 疾时王奢恣轻滛也 】轻则失臣【王者轻滛则失其臣治身轻滛则失其精】躁则失君【王者行躁疾则失其君位治身躁疾则失其精神也 】 巧用第二十七",
      "translated_text": "**Chapter 26: Valuing Virtue**\n\nValuing is the root of the classics.\nIf the ruler does not value virtue, he will not be revered;\nif one does not value virtue in cultivating the self, one loses spirit.\nThe blossoms of grasses and trees are light, thus they scatter and fall;\ntheir roots are weighty, thus they endure long.\n\nStillness is the lord of restlessness.\nIf the ruler is not still, he loses his majesty;\nif one is not still in cultivating the self, the self is imperiled.\nThe dragon is still, thus it can transform;\nthe tiger is restless, thus it suffers loss.\n\nTherefore, the sage travels all day\nyet does not depart from the weight of stillness.\nThough there be splendid palaces and tranquil chambers,\nhe remains aloof and distant.\n\nAlas! How could the lord of ten thousand chariots\ntreat his person lightly before all under heaven?\nTo act lightly is to lose one’s ministers;\nto act restlessly is to lose one’s throne.\nIf the ruler is frivolous, he loses his ministers;\nif one is frivolous in cultivating the self, one loses one’s essence.\nIf the ruler is restless, he loses his position;\nif one is restless in cultivating the self, one loses one’s spirit.\n\n**Chapter 27: Skillful Application**",
      "overlap_context": "her of all under heaven.\nI know not its name;\nI style it \"Dao.\"\nForced to name it, I say \"Great.\"\nGreat, it flows away;\nflowing away, it is distant;\ndistant, it returns.\nThus, the Dao is great, heaven is great,\nearth is great, and the king, too, is great.\nWithin the realm, there are Four Greats—\nthe Dao, heaven, earth, and the king.\nThe king occupies one among them.\n\nMan models himself on earth;\nearth models itself on heaven;\nheaven models itself on the Dao;\nthe Dao models itself on spontaneity.",
      "start_char": 9970,
      "end_char": 10242,
      "start_sentence": 473,
      "end_sentence": 484,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.227837085723877,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "善行无辙迹【善行道者求之于身不下堂不出门故无辙迹○行去声】善言无瑕谪【善言谓择言而出则无瑕疵谪过于天下○瑕音遐谪直革反】善计不用筹防【善以道计事者则守一不移所计不多则不用筹防而可知也 ○筹音俦】善闭无关揵而不可开【善以道闭情欲守精神者不如门户有关揵可得开○揵音键】善结无绳约而不可解【善以道结事者乃可结其心不如绳索可得解也 】是以圣人常善救人【圣人所以常教人忠孝者欲以救人在命】故无弃人【使贵贱各得其所也 】常善救物【圣人所以教民顺四时以救万物之残伤】故无弃物【圣人不贱石而贵玉视之如一】是谓袭明【圣人善救人物谓袭明大道也 】故善人者不善人之师【人之行善者圣人即以为人师】不善人者善人之资【资用也 人行不善圣人犹教导使为善得以给用也 】不贵其师【独无辅也 】不爱其资【无所使也 】虽智大迷【虽自以为智言此人乃大述惑】是谓要妙【能通此意是谓知微妙要道也 】 反朴第二十八",
      "translated_text": "The skillful traveler leaves no wheel tracks;\nthe skillful speaker utters no flaw or blame.\nThe skillful reckoner needs no counting rods or barriers;\nthe skillful closer uses no bolts or bars, yet none can open.\nThe skillful binder uses no cords or knots, yet none can untie.\n\nThus the sage is ever skillful in saving people,\nand so abandons no one.\nEver skillful in saving things,\nand so abandons nothing.\nThis is called inheriting the illumination.\n\nTherefore, the good person is the teacher of the not-good;\nthe not-good person is the resource of the good.\nOne who neither values their teacher\nnor cherishes their resource—\nthough wise, is greatly deluded.\nThis is called the essential subtlety.\n\n**Chapter 28: Returning to Simplicity**",
      "overlap_context": "ambers,\nhe remains aloof and distant.\n\nAlas! How could the lord of ten thousand chariots\ntreat his person lightly before all under heaven?\nTo act lightly is to lose one’s ministers;\nto act restlessly is to lose one’s throne.\nIf the ruler is frivolous, he loses his ministers;\nif one is frivolous in cultivating the self, one loses one’s essence.\nIf the ruler is restless, he loses his position;\nif one is restless in cultivating the self, one loses one’s spirit.\n\n**Chapter 27: Skillful Application**",
      "start_char": 10242,
      "end_char": 10622,
      "start_sentence": 485,
      "end_sentence": 495,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.991604804992676,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "知其雄守其雌为天下溪【雄以喻尊雌以喻卑人虽知自尊显当复守之以卑防去雄之强梁就雌之柔和如是则天下归之如水流入深溪也 ○溪音溪】为天下溪常德不离【人能谦下如深溪则德常在不复离于己○离去声】复归于婴儿【常复归志于婴儿蠢然而无所知也 】知其白守其黑为天下式【白以喻昭昭黑以喻默默人虽自知昭昭明白当复守之以默默如暗昧无所见如是则可为天下法式则德常在】为天下式常德不忒【人能为天下法则德常在于己不复差忒○忒音慝】复归于无极【德不差忒则长生久寿归身于无穷极也 】知其荣守其辱为天下谷【荣以喻尊贵辱以喻污浊知己之有荣贵当守之以污浊如是则天下归之如水流入深谷也 】为天下谷常德乃足【足止也 人能为天下谷德乃止于己】复归于朴【复当归身于质朴不复为文饰】朴散则为器【万物之朴散则为器用也 若道散则为神明流为日月分为五行也 】圣人用之则为官长【圣人升用则为百官之元长也 ○长上声】故大制不割【圣人用之则以大道制御天下无所伤割治身则以天道制情欲不害精神也 】 无为第二十九",
      "translated_text": "He who knows the masculine yet keeps to the feminine\nbecomes the world’s valley stream.\nAs the world’s valley stream,\nhis constant virtue never departs,\nand he returns to the state of infancy.\n\nHe who knows the bright yet keeps to the dark\nbecomes the world’s model.\nAs the world’s model,\nhis constant virtue knows no flaw,\nand he returns to the boundless.\n\nHe who knows glory yet keeps to humility\nbecomes the world’s valley.\nAs the world’s valley,\nhis constant virtue is fulfilled,\nand he returns to simplicity.\n\nWhen simplicity is scattered, it becomes vessels;\nthe sage employs it to become the chief of officials.\nThus the great system makes no cuts.",
      "overlap_context": " cords or knots, yet none can untie.\n\nThus the sage is ever skillful in saving people,\nand so abandons no one.\nEver skillful in saving things,\nand so abandons nothing.\nThis is called inheriting the illumination.\n\nTherefore, the good person is the teacher of the not-good;\nthe not-good person is the resource of the good.\nOne who neither values their teacher\nnor cherishes their resource—\nthough wise, is greatly deluded.\nThis is called the essential subtlety.\n\n**Chapter 28: Returning to Simplicity**",
      "start_char": 10622,
      "end_char": 11041,
      "start_sentence": 496,
      "end_sentence": 506,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.7439017295837402,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 22,
      "original_text": "将欲取天下【欲为天下主也 】而为之【欲以有为治民】吾见其不得已【我见其不得天道人心已明矣 天道恶烦浊人心恶多欲】天下神器不可为也 【器物也 人乃天下之神物也 神物好安静不可以有为治】为者败之【以有为治之则败其质性】执者失之【强执教之人则失其情实生于诈伪也 】故物或行或随【上所行下必随之也 】或呴或吹【呴温也 吹寒也 有所温必有所寒也 ○呴音虚】或强或羸【有所强大必有所羸弱也 ○羸力为反】或载或隳【载安也 隳危也 有所安必有所危明人君不可以有为治国与治身也 】是以圣人去甚去奢去泰【甚谓贪声色奢谓服饰饮食泰谓宫室台榭去此三者处中和行无为则天下自化○去上声】 俭武第三十 以道佐人主者【谓人主能以道自辅佐也 】不以兵强天下【以道自佐之主不以兵革顺天任德敌人自服】其事好还【其举事好还自责不怨于人也 ○好去声还音旋】师之所处荆棘生焉 【农事废田不修】大军之后必有凶年【天应之以恶气即害五谷五谷尽伤人也 】善者果而已【善兵者当果敢而已不休】不敢以取强【不以果敢取强大之名也 】果而勿矜【当果敢谦卑勿自矜大也 】果而勿伐【当果敢推让勿自伐取其美也 】果而勿骄【骄欺也 果敢勿以骄欺人】果而不得已【当果敢至诚不当追不得已也 】果而勿强【果敢勿以为强兵坚甲以侵陵人也 】物壮则老【草木壮极则枯落人壮极则衰老也 言强者不可以壮】是谓不道【枯老者生不行道也 】不道早已【不行道者早死】 偃武第三十一 夫佳兵不祥之器【祥喜也 兵者惊精神浊和气不善人之器也 不当修饰之】物或恶之【兵动则有所害故万物无有不恶之○恶去声】故有道者不处【有道之人不处其国】君子居则贵左【贵柔弱也 】用兵则贵右【贵刚强也 此言兵道与君子道反所贵者异也 】兵者不祥之器【兵革者不善之器也 】非君子之器【非君子所贵重器也 】不得已而用之【谓遭衰逆乱祸欲加万民乃用之以自守】恬惔为上【不贪土地利人财宝○惔一作然】胜而不美【虽得胜而不以为利己也 】而美之者是乐杀人【美得胜若是为喜乐杀人者也 】夫乐杀人者则不可以得志于天下矣 【为人君而乐杀人此不可使得志于天下为人主必专制人命妄行刑诛】吉事尚左【左生位也 】凶事尚右【阴道杀人】偏将军居左【偏将军卑而居阳者以其不专杀也 】上将军居右【上将军尊而居右者言其主杀也 】言以防礼处之【上将军于右防礼尚右死人贵阴也 】杀人之众以悲哀泣之【伤已德薄不能以道化人而害无辜之民】战胜以防礼处之【古者战胜将军居防主礼之位素服而哭之明君子贵德而贱兵不得已诛不祥心不乐之比于防也 知后世用兵不已故悲痛之】 圣德第三十二",
      "translated_text": "He who would take the world and act upon it—\nI see that he will not succeed.\nThe world is a sacred vessel, not to be acted upon.\nTo act upon it is to mar it;\nto grasp it is to lose it.\n\nThus, beings may lead or follow,\nbreathe warm or cold,\nbe strong or weak,\nbear or destroy.\nTherefore the sage discards excess, extravagance, and indulgence.\n\n**Chapter 30: On Restraint in Warfare**\n\nOne who assists a ruler with the Dao\ndoes not dominate the world with arms.\nSuch affairs tend to rebound.\nWhere armies camp, thorns and brambles grow.\nAfter great wars, years of famine follow.\nThe skilled warrior achieves his aim and stops—\nhe dares not seize power by force.\nHe achieves his aim but does not boast,\nachieves his aim but does not vaunt,\nachieves his aim but does not dominate,\nachieves his aim only when compelled,\nachieves his aim but does not overreach.\nThings flourish and then decay—\nthis is called \"not the Dao.\"\nWhat is not the Dao soon perishes.\n\n**Chapter 31: On Laying Down Arms**\n\nFine weapons are instruments of ill omen—\nbeings may detest them.\nThus the man of Dao does not dwell among them.\nThe noble person values the left in peace,\nbut in war, the right.\nWeapons are instruments of ill omen,\nnot the noble person’s instruments.\nUsed only when unavoidable,\ntranquility and restraint are paramount.\nVictory is not glorified—\nto glorify it is to delight in killing.\nOne who delights in killing\ncannot achieve his will in the world.\n\nIn auspicious affairs, the left is honored;\nin inauspicious affairs, the right.\nThe deputy general stands on the left,\nthe commander on the right—\nthis is to position them according to mourning rites.\nWhen many are killed, mourn them with sorrow and grief.\nWhen victorious in battle, observe mourning rites.",
      "overlap_context": "d he returns to the state of infancy.\n\nHe who knows the bright yet keeps to the dark\nbecomes the world’s model.\nAs the world’s model,\nhis constant virtue knows no flaw,\nand he returns to the boundless.\n\nHe who knows glory yet keeps to humility\nbecomes the world’s valley.\nAs the world’s valley,\nhis constant virtue is fulfilled,\nand he returns to simplicity.\n\nWhen simplicity is scattered, it becomes vessels;\nthe sage employs it to become the chief of officials.\nThus the great system makes no cuts.",
      "start_char": 11041,
      "end_char": 12063,
      "start_sentence": 507,
      "end_sentence": 553,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.08704400062561,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 23,
      "original_text": "道常无名【道能阴能阳能弛能张能存能亡故无常名也 】朴虽小天下不敢臣【道朴虽小微妙无形天下不敢有臣使道者也 】侯王若能守之万物将自宾【侯王若能守道无为万物将自宾服从于德也 】天地相合以降甘露【侯王动作能与天相应合天即下甘露善瑞也 】民莫之令而自均【天降善瑞则万物莫有教令之者皆自均调若一也 】始制有名【始道也 有名万物也 道无名能制于有名无形能制于有形也 】名亦既有【既尽也 有名之物尽有情欲叛道离德故身毁辱也 】天亦将知之【人能去道行德天亦将自知之】知之所以不殆【天知之则神灵佑助不复危殆】譬道之在天下犹川谷之与江海【言道之在天下与人相应和如川谷与江海相流通也 】 辩德第三十三 知人者智【能知人好恶是为智】自知者明【人能自知贤不肖是为反听无声内视无形故为明】胜人者有力【能胜人者不过以威力也】自胜者强【人能自胜己情欲则天下无有能与己争者故为强】知足者富【人能知足之为足则长保福禄故为富也】强行者有志【人能强力行善则为有意于道道亦有意于人】不失其所者久【人能自节养不失其所受天之精气则可以久】死而不亡者寿【日不妄视耳不妄听口不妄言则无怨恶于天下故长寿】 任成第三十四 大道汜兮【言道汜汜若浮若沉若有若无视之不见之难殊○汜音泛】其可左右【道可左右无所不冝】万物恃之而生【恃待也 万物皆恃道而生】而不辞【道不辞谢而逆止也 】功成不名有【有道不名其有功也 】爱养万物而不为主【道虽爱养万物不如人主有所放取】常无欲可名于小【道匿德藏名恒然无为似若微小也 】万物归焉 而不为主【万物皆归道受气道非如人主冇所禁止也 】可名为大【万物横来横去使各自在故不若于大也 】是以圣人终不为大【圣人法道匿德藏名不为满大】故能成其大【圣人以身师导不言而化万事修治故能成其大】 仁德第三十五 执大象天下徃【执守也 象道也 圣人守大道则天下万物移心归徃之也 治身则天降神明徃来于巳也 】徃而不害安平太【万物归徃而不伤害则国安家宁而致太平矣 治身不害神明则身安而大寿也 】乐与饵过客止【饵美也 过客一也 人能乐美于道则一留止也 一者去盈而处虚忽忽如过客○乐音岳饵音珥】道之出口淡乎 其无味【道出入于口淡淡非如五味有酸咸苦甘辛也 ○出去声】视之不足见【足得也 道无形非若五色有青黄赤白黑可得见也 】听之不足闻【道非若五音有宫商角征羽可得听闻也 】用之不可既【用道治国则国安民昌治身则寿命延长无有既尽时也 】 微明第三十六",
      "translated_text": "**The Dao is Eternally Nameless**\n\nThe Dao is ever nameless—\nit can be yin, it can be yang,\nit can relax, it can stretch,\nit can endure, it can vanish,\nthus it has no fixed name.\n\nThough the uncarved block is small,\nnone under heaven dare claim dominion over it.\nShould lords and kings hold fast to it,\nthe myriad things will of themselves submit.\n\nHeaven and earth unite to send down sweet dew—\nthe people, without command, find their own harmony.\n\nAt the beginning of creation, names arise.\nOnce names exist,\nwhen all things with names have exhausted their forms,\nheaven too will come to know them.\nKnowing them, one avoids peril.\n\nThe Dao’s presence in the world\nis like valleys flowing into rivers and seas.\n\n**Discerning Virtue**\n\nOne who knows others is wise;\none who knows oneself is enlightened.\nOne who conquers others has force;\none who conquers oneself is strong.\nOne who knows contentment is rich;\none who strives with resolve has purpose.\nOne who does not lose their place endures;\none who dies yet does not perish attains longevity.\n\n**Assuming Completion**\n\nThe great Dao overflows—\nit drifts like floating, sinking,\nnow present, now absent,\nseen yet unseen, grasped yet elusive.\n\nIt may be found to the left or right,\nfor nothing is beyond its reach.\nThe myriad things depend on it to live,\nyet it does not refuse them.\nIts work complete, it claims no merit.\nIt nurtures and sustains the myriad things\nyet does not act as their master.\n\nEver without desire, it may be called small.\nYet the myriad things return to it\nwithout its acting as their lord—\nit may be called great.\n\nThus the sage never claims greatness,\nand so accomplishes greatness.\n\n**Virtue of Benevolence**\n\nHold fast to the great image,\nand all under heaven will come to you.\nThey come without harm,\nbringing peace and great stability.\n\nMusic and fine food may make a passing guest pause,\nbut the Dao that issues from the mouth is bland,\nseeming without flavor.\nLook for it, and it cannot be seen;\nlisten for it, and it cannot be heard.\nYet in its use, it is inexhaustible.\n\n**Subtle Illumination**",
      "overlap_context": " when unavoidable,\ntranquility and restraint are paramount.\nVictory is not glorified—\nto glorify it is to delight in killing.\nOne who delights in killing\ncannot achieve his will in the world.\n\nIn auspicious affairs, the left is honored;\nin inauspicious affairs, the right.\nThe deputy general stands on the left,\nthe commander on the right—\nthis is to position them according to mourning rites.\nWhen many are killed, mourn them with sorrow and grief.\nWhen victorious in battle, observe mourning rites.",
      "start_char": 12063,
      "end_char": 13041,
      "start_sentence": 554,
      "end_sentence": 594,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.724725484848022,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 24,
      "original_text": "将欲噏之必固张之【先开张之者欲极其奢滛○噏音吸】将使弱之必固强之【先强大之者欲使遇祸患】将欲废之必固兴之【先兴之者欲使其骄危也】将欲夺之必固与之【先与之者欲极其贪心也】是谓微明【此四事其道微其效明也】柔弱胜刚强【柔弱者久长刚强者先亡也】鱼不可脱于渊【鱼脱于渊谓去刚得柔不可复制也】国之利器不可以示人【利器权道也治国权者不可以示执事之臣也治身道者不可以示非其人也】 为政第三十七 道常无为【道以无为为常也】而无不为侯王若能守万物将自化【言侯王若能守道万物将自化效于己也】化而欲作吾将镇之以无名之朴【吾身也无名之朴道也万物以化效于己也复欲作巧伪者侯王当身镇抚以道德】无名之朴亦将不欲不欲以静【言侯王镇抚以道德民亦将不欲改当以清静导化之也】天下将自定【能如是者天下将自正定也】 老子道经卷终 钦定四库全书卷",
      "translated_text": "He who would draw them in must first fully expand them—\nthis is to push excess and indulgence to their limit.\n\nHe who would weaken them must first fully strengthen them—\nthis is to let them meet with calamity.\n\nHe who would abolish them must first fully establish them—\nthis is to let their arrogance bring them to ruin.\n\nHe who would seize them must first fully give to them—\nthis is to push their greed to its extreme.\n\nThis is called subtle illumination:\nthe Way is hidden, yet its effects are clear.\n\nThe soft and weak overcome the hard and strong—\nfor the soft and weak endure, while the hard and strong perish first.\n\nFish must not leave the depths—\nonce a fish leaves the depths, having abandoned hardness for softness, it can no longer be controlled.\n\nThe state’s sharp instruments must not be shown to others—\nsharp instruments are the arts of power.\nIn governing the state, the arts of power must not be shown to ministers who act;\nin cultivating the Way, they must not be shown to those unworthy of them.\n\n**Governance**\n\nThe Dao is ever without action,\nyet there is nothing it does not do.\nIf lords and kings can hold fast to it,\nthe myriad things will transform of themselves.\n\nWhen transformation stirs and desire arises,\nI will quell it with nameless simplicity—\nmy self, nameless simplicity, the Dao.\nWhen the myriad things, having transformed, imitate me,\nyet desire to act with cunning and deceit,\nlords and kings should personally quell and guide them with virtue and the Dao.\n\nNameless simplicity will also be without desire;\nwithout desire, there is stillness.\nThen the world will settle of itself.\n\n*Laozi Daojing* concludes here.\n*Imperially Commissioned Complete Library of the Four Treasuries*, Scroll.",
      "overlap_context": "led great.\n\nThus the sage never claims greatness,\nand so accomplishes greatness.\n\n**Virtue of Benevolence**\n\nHold fast to the great image,\nand all under heaven will come to you.\nThey come without harm,\nbringing peace and great stability.\n\nMusic and fine food may make a passing guest pause,\nbut the Dao that issues from the mouth is bland,\nseeming without flavor.\nLook for it, and it cannot be seen;\nlisten for it, and it cannot be heard.\nYet in its use, it is inexhaustible.\n\n**Subtle Illumination**",
      "start_char": 13041,
      "end_char": 13402,
      "start_sentence": 595,
      "end_sentence": 599,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.683596134185791,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 25,
      "original_text": "老子德经卷下 河上公章句第三 论德第三十八 上德不德【上德谓太古无名号之君德大无上故言上德也 不德者言其不以德教民因循自然养人性命其德不见故言不德也 】是以有德【言其德合于天地和气流行民得以全也 】下德不失德【下德谓号谥之君德不及上德故言下德也 不失德者其德可见其功可称也 】是以无德【以有名号及其身故】上德无为【谓法道安静无所改为也 】而无以为【言无以名号为】下德为之【言为教令施政事也 】而有以为【言以为己取名号也 】上仁为之【上仁谓行仁之君其仁为上故言上仁也 为之者为仁恩】而无以为【功成事立无以执为】上义为之【为义以断割也 】而有以为【动作以为己杀人以成威赋下以自奉也 】上礼为之【谓上礼之君其礼无上故言上礼为之者言为礼制度序威仪】而莫之应【言礼华盛实衰饰伪烦多动则离道不可应也 】则攘臂而仍之【言烦多不可应上下忿争故攘臂相仍引○攘音禳】故失道而后德【言道衰而德化生也 】失德而后仁【言德哀而仁爱见也 】失仁而后义【言仁衰而分义明也 】失义而后礼【言义衰则施礼聘行玉帛】夫礼者忠信之薄【言礼废本治末忠信日以衰薄】而乱之首【礼者贱质而贵文故正直日以少邪乱日以生】前识者道之华【不知而言知为前识此人失道之实得道之华】而愚之始【言前识之人愚暗之倡始】是以大丈夫处其厚【大丈夫谓得道之君也 处其厚者处身于敦朴】不居其薄【不处身违道为世烦乱也 】处其实【处忠信也 】不居其华【不尚言也 】故去彼取此【去彼华薄取此厚实○去上声】 法本第三十九 昔之得一者【昔徃也 一无为道之子也",
      "translated_text": "**Laozi Dejing, Scroll Two**\n*He Shanggong’s Chapter Sentences, Chapter Three: On Virtue (38)*\n\nThe highest virtue does not act as virtue—\nthis is called \"highest virtue.\"\nIt does not act as virtue because, though the rulers of remote antiquity bore no titles,\ntheir virtue was vast and without peer.\nThus it is called \"highest virtue.\"\n\"Not acting as virtue\" means they did not govern the people through virtue,\nbut followed the natural course, nurturing their lives and natures.\nTheir virtue remained unseen, hence \"does not act as virtue.\"\nTherefore, they possessed virtue—\nfor their virtue harmonized with Heaven and Earth,\nand the qi of harmony flowed freely, preserving the people whole.\n\nLesser virtue does not lose virtue—\nthis is called \"lesser virtue.\"\nIt is called \"lesser virtue\" because the titled rulers of later ages\nfell short of the highest virtue.\n\"Not losing virtue\" means their virtue was visible, their achievements commendable.\nTherefore, they lacked virtue—\nfor they bore names and titles, and acted for their own sake.\n\nThe highest virtue acts without action,\nabiding by the Dao in stillness, changing nothing.\nAnd it has no purpose—\nfor it does not act for the sake of name or title.\nLesser virtue acts,\nenacting teachings and decrees, administering affairs.\nAnd it has a purpose—\nfor it acts to claim names and titles for itself.\n\nThe highest benevolence acts,\nbestowing kindness and grace.\nYet it has no purpose—\nfor once its work is done and its affairs established, it does not cling to them.\nThe highest righteousness acts,\njudging and dividing.\nYet it has a purpose—\nfor its actions serve itself, killing to establish authority,\nexacting tribute to sustain its own grandeur.\n\nThe highest propriety acts,\nestablishing rituals, systems, and imposing decorum.\nYet none respond to it—\nfor propriety’s splendor is hollow, its substance diminished.\nIts embellishments grow ever more false and cumbersome,\nand when set in motion, it strays from the Dao, becoming unanswerable.\nThen arms are raised in defiance, and contention follows—\nfor its excesses make it unanswerable, and superiors and inferiors grow resentful,\nraising their arms to drag one another down.\nThus, when the Dao is lost, virtue arises;\nwhen virtue is lost, benevolence appears;\nwhen benevolence is lost, righteousness emerges;\nwhen righteousness is lost, propriety is imposed.\n\nPropriety is the thinning of loyalty and trust,\nthe harbinger of chaos—\nfor propriety discards the root to tend the branches,\nand loyalty and trust grow ever thinner.\nIt is the beginning of disorder—\nfor propriety values ornament over substance,\nand thus uprightness wanes while deceit and chaos flourish.\n\nThose with foreknowledge are the blossoms of the Dao,\nthe beginning of folly—\nfor to claim knowledge without true understanding is \"foreknowledge,\"\nand such people lose the substance of the Dao, grasping only its blossoms.\nThus, foreknowledge is the origin of foolishness.\nTherefore, the great man abides in depth,\nnot dwelling in shallowness—\ndwelling in depth means resting his person in sincerity and simplicity,\nnot residing in conduct that strays from the Dao, entangling the world in turmoil.\nHe abides in substance,\nnot dwelling in blossoms—\nabiding in substance means upholding loyalty and trust,\nnot prizing mere words.\nThus, he rejects that and embraces this.\n\n**Chapter Thirty-Nine: The Root of the Law**\n\nOf old, those who attained the One—\n\"Of old\" means \"in the past.\"\nThe One is the child of the actionless Dao.",
      "overlap_context": " arises,\nI will quell it with nameless simplicity—\nmy self, nameless simplicity, the Dao.\nWhen the myriad things, having transformed, imitate me,\nyet desire to act with cunning and deceit,\nlords and kings should personally quell and guide them with virtue and the Dao.\n\nNameless simplicity will also be without desire;\nwithout desire, there is stillness.\nThen the world will settle of itself.\n\n*Laozi Daojing* concludes here.\n*Imperially Commissioned Complete Library of the Four Treasuries*, Scroll.",
      "start_char": 13402,
      "end_char": 14031,
      "start_sentence": 600,
      "end_sentence": 625,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.17047667503357,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 26,
      "original_text": "】天得一以清地得一以宁【言天得一故能垂象清明地得一故能安静不动揺】神得一以灵【言神得一故能变化无形】谷得一以盈【言谷得一故能盈满而不绝也 】万物得一以生【言万物皆须道以生成也 】侯王得一以为天下正【言侯王得一故能为天下平正】其致之【致诚也 谓下五事也 】天无以清将恐裂【言天当有阴阳施张昼夜更用不可但欲清明无巳时将恐分裂不为天】地无以宁将恐发【言地当有高下刚柔气节五行不可但欲安静无巳时将恐发泄不为地】神无以灵将恐歇【言神当有王相囚死休废不可但欲灵无巳时将恐虚歇不为神也 】谷无以盈将恐竭【言谷当有盈缩虚实不可但欲盈满无巳时将恐枯竭不为谷】万物无以生将恐灭【言万物当随时生死不可但欲生无巳时将恐灭亡不为物也 】侯王无以贵高将恐蹶【言侯王当屈己以下人汲汲求贤不可但欲高于人将恐颠蹶失其位也 ○蹶音厥】故贵以贱为本【言必欲尊贵当以薄贱为本若禹稷躬稼舜陶河滨周公下白屋也 】高必以下为基【言必欲尊贵当以下为本基犹筑墙造功因卑成高下不坚固后必倾危】是以侯王自谓孤寡不毂【孤寡喻孤独不毂喻不能如车毂为众毂所凑】此非以贱为本耶【言侯王至尊贵能以孤寡自称此非以贱为本乎 以晓人】非乎 【嗟叹之辞】故致数车无车【致就也 言人就车数之为辐为轮为毂为衡为舆无冇名为车者故成为车以喻侯王不以尊号自名故能成其贵○数上声】不欲琭琭如玉落落如石【琭琭喻少落落喻多玉少故见贵石多故见贱言不欲如玉为人所贵如石为人所贱当处其中也 ○琭音禄】 去用第四十",
      "translated_text": "---\n\nHeaven attains the One and thus becomes clear;\nHeaven attains the One, and so its celestial signs hang luminous and bright.\nEarth attains the One and thus becomes tranquil;\nEarth attains the One, and so it rests in stillness, unshaken.\nSpirits attain the One and thus become numinous;\nSpirits attain the One, and so their transformations are formless.\nValleys attain the One and thus become full;\nValleys attain the One, and so they brim without ceasing.\nThe myriad things attain the One and thus come to life;\nThe myriad things all depend on the Dao to take form and grow.\nLords and kings attain the One and thus become the standard for all under heaven;\nLords and kings attain the One, and so they bring level peace to the world.\n\nSuch is the culmination of their sincerity—\nreferring to the five instances above.\n\nIf heaven had nothing by which to remain clear, it would fear splitting;\nHeaven must alternate yin and yang, expand and contract, day and night—it cannot remain merely bright without end, lest it split and cease to be heaven.\nIf earth had nothing by which to remain tranquil, it would fear erupting;\nEarth must hold high and low, firm and yielding, seasonal nodes, and the five phases—it cannot remain merely still without end, lest it burst forth and cease to be earth.\nIf spirits had nothing by which to remain numinous, they would fear exhaustion;\nSpirits must cycle through waxing, waning, imprisonment, death, rest, and decline—they cannot remain merely numinous without end, lest they fade and cease to be spirits.\nIf valleys had nothing by which to remain full, they would fear drying up;\nValleys must ebb and flow, fill and empty—they cannot remain merely brimming without end, lest they wither and cease to be valleys.\nIf the myriad things had nothing by which to live, they would fear annihilation;\nThe myriad things must follow the seasons in birth and death—they cannot remain merely alive without end, lest they perish and cease to be things.\nIf lords and kings had nothing by which to remain noble and exalted, they would fear stumbling;\nLords and kings must humble themselves to serve others, diligently seek the worthy—they cannot remain merely high above others, lest they topple and lose their thrones.\n\nThus, the noble takes the humble as its root;\nTo attain true honor, one must take lowliness as the foundation—like Yu and Ji, who tilled the fields themselves, or Shun, who made pottery by the riverbank, or the Duke of Zhou, who lowered himself to thatched huts.\nThe high must take the low as its base;\nTo attain true honor, one must take the low as the foundation. Just as building a wall begins with the humble earth to reach the heights, without a firm base below, the structure will later topple and fall.\n\nTherefore, lords and kings call themselves \"the orphaned,\" \"the widowed,\" and \"the unworthy\";\n\"Orphaned\" and \"widowed\" suggest solitude; \"unworthy\" suggests inability, like a wheel’s hub that cannot gather the many spokes.\nIs this not taking the humble as the root?\nLords and kings, though most exalted, call themselves by such lowly names—is this not taking the humble as the root? This is to enlighten others.\n\nIs it not so?\n\nThus, when the parts of a carriage are assembled, there is no \"carriage\";\nWhen one gathers the parts—spokes, wheels, hub, axle, and carriage box—none alone is called a carriage; only when combined does it become one. This illustrates how lords and kings, by not clinging to their exalted titles, achieve true nobility.\nOne does not desire to be lustrous like jade nor coarse like stone;\n\"Lustrous\" suggests rarity, \"coarse\" suggests abundance—jade is prized for its scarcity, stone is disdained for its plenty. One should not wish to be like jade, coveted by others, nor like stone, despised by others, but rather dwell in the mean between them.\n\n**Chapter Forty: Rejecting Excess**",
      "overlap_context": "g in shallowness—\ndwelling in depth means resting his person in sincerity and simplicity,\nnot residing in conduct that strays from the Dao, entangling the world in turmoil.\nHe abides in substance,\nnot dwelling in blossoms—\nabiding in substance means upholding loyalty and trust,\nnot prizing mere words.\nThus, he rejects that and embraces this.\n\n**Chapter Thirty-Nine: The Root of the Law**\n\nOf old, those who attained the One—\n\"Of old\" means \"in the past.\"\nThe One is the child of the actionless Dao.",
      "start_char": 14031,
      "end_char": 14631,
      "start_sentence": 626,
      "end_sentence": 639,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.552496671676636,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 27,
      "original_text": "反者道之动【反本也本者道所以动动生万物背之则亡也】弱者道之用【柔弱者道之所常用故能长久】天下万物生于有【万物皆从天地生天地有形位故言生于冇也】有生于无【天地神明蜎飞蠕动皆从道生道无形故言生于无此言本胜于华弱胜于强谦虚胜盈满也】 同异第四十一 上士闻道勤而行之【上士闻道自勤苦竭力而行之】中士闻道若存若亡【中士闻道治身以长存治国以太平欣然而存之退见财色荣誉或于情欲而复亡之也 】下士闻道大之【下士贪狼多欲见道柔弱谓之恐惧见道质朴谓之鄙陋故大之】不不足以为道【不为下士所不足以名为道】故建言有之【建设也 设言以冇道当如下句】明道若昧【明道之人若暗昧无所见○昧音妹】进道若退【进取道者若退不及】夷道若【夷平也 大道之人不自别殊若多比也 ○音颣】上德若谷【上德之人若深谷不耻垢浊也 】大白若辱【大洁白之人若污辱不自彰显】广德若不足【德行广大之人若愚须不足也 】建德若偷【建设道德之人若可偷引使空虚也 】质真若渝【质朴之人若五色有渝浅不明】大方无隅【大方正之人无委曲廉隅】大器晚成【大器之人若九鼎瑚琏不可卒成也 】大音希声【大音犹雷霆待时而动喻常爱气希言也 】大象无形【大法象之人质朴无形容】道隐无名【道潜隐使人无能指名也 】夫唯道善贷且成【成就也 言道善禀贷人精气且成就之也 ○贷音态】 道化第四十二",
      "translated_text": "The movement of the Dao turns back to its root;\nThe weak is the function of the Dao.\nAll things under heaven are born from Being,\nAnd Being is born from Nonbeing.\n\nThus the root prevails over the blossom,\nThe weak prevails over the strong,\nAnd humility prevails over fullness.\n\n**Chapter Forty-One**\n\nWhen the highest scholar hears of the Dao, he diligently practices it;\nWhen the middling scholar hears of the Dao, he keeps it now and loses it later;\nWhen the lowest scholar hears of the Dao, he laughs loudly at it.\nWere it not laughed at, it would not be the Dao.\n\nTherefore, established sayings declare:\nThe Dao that is bright appears dim;\nThe Dao that advances appears to retreat;\nThe Dao that is level appears uneven;\nThe highest virtue resembles a valley;\nThe purest white appears sullied;\nAbundant virtue seems deficient;\nEstablished virtue appears hollow;\nTrue substance seems mutable;\nGreat squareness has no corners;\nGreat vessels are slowly completed;\nGreat sound is scarcely heard;\nGreat form has no shape.\nThe Dao is hidden and nameless.\n\nOnly the Dao is good at bestowing and bringing to completion.",
      "overlap_context": " when combined does it become one. This illustrates how lords and kings, by not clinging to their exalted titles, achieve true nobility.\nOne does not desire to be lustrous like jade nor coarse like stone;\n\"Lustrous\" suggests rarity, \"coarse\" suggests abundance—jade is prized for its scarcity, stone is disdained for its plenty. One should not wish to be like jade, coveted by others, nor like stone, despised by others, but rather dwell in the mean between them.\n\n**Chapter Forty: Rejecting Excess**",
      "start_char": 14631,
      "end_char": 15181,
      "start_sentence": 640,
      "end_sentence": 655,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.199240207672119,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 28,
      "original_text": "道生一【道始所生者一】一生二【一生阴与阳也 】二生三【阴阳生和清浊三气分为天地人也 】三生万物【天地共生万物也 天施地化人长养之也 】万物负阴而抱阳【万物无不负阴而向阳回心而就日】冲气以为和【万物中皆有元气得以和柔若胸中冇藏骨中有髓草木中有空虚与气通故得久生也 】人之所恶唯孤寡不毂而王公以为称【孤寡不毂者不祥之名而王公以为称者处谦卑法虚空和柔○恶去声称去声】故物或损之而益【引之不得推之必还】或益之而损【夫増高者崩贪富者致患】人之所教【谓众人所以教去弱为强去柔为刚】我亦教之【言我教众人使去强为弱去刚为柔】强梁者不得其死【强梁谓不信妙背叛道德不从经教尚势任力也 不得其死者为天所绝兵刃所伐王法所杀不得以寿命死也 】吾将以为教父【父始也 老子以强梁之人为敎戒之始也 】 徧用第四十三",
      "translated_text": "The Dao gives birth to the One;\nThe One gives birth to the Two;\nThe Two gives birth to the Three;\nThe Three gives birth to the myriad things.\n\nThe myriad things bear yin and embrace yang;\nThrough the blending of qi, they achieve harmony.\n\nWhat men dislike are only \"orphaned,\" \"widowed,\" and \"unworthy,\"\nYet kings and lords take these as their titles.\nThus, some things are diminished yet gain,\nWhile others are increased yet lose.\n\nWhat others teach,\nI also teach:\n\"The strong and violent do not meet their proper end.\"\nI shall take this as the father of my teaching.",
      "overlap_context": "o that is bright appears dim;\nThe Dao that advances appears to retreat;\nThe Dao that is level appears uneven;\nThe highest virtue resembles a valley;\nThe purest white appears sullied;\nAbundant virtue seems deficient;\nEstablished virtue appears hollow;\nTrue substance seems mutable;\nGreat squareness has no corners;\nGreat vessels are slowly completed;\nGreat sound is scarcely heard;\nGreat form has no shape.\nThe Dao is hidden and nameless.\n\nOnly the Dao is good at bestowing and bringing to completion.",
      "start_char": 15181,
      "end_char": 15519,
      "start_sentence": 656,
      "end_sentence": 666,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.1034908294677734,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 29,
      "original_text": "天下之至柔驰骋天下之至坚【至柔者水至坚金石水能贯坚入刚无所不通○骋音逞】无有入无间【无冇谓道也道无形质故能出入无间通神群生也】吾以是知无为之有益【吾见道无为而万物自化成是以知无为之有益于人也】不言之教【法道不言师之以身】无为之益【法道无为治身则有益精神治国则冇益万民不劳烦也】天下希及之【天下人主也希能有及道无为之治身治国也】 立戒第四十四 名与身孰亲【名遂则身退也】身与货孰多【财多则害身也】得与亡孰病【好得利则病于行也】甚爱必大费【甚爱色费精神甚爱财遇祸患所爱者少所亡者多故言大费】多藏必厚亡【生多藏于府库死多藏于邱墓生有攻劫之忧死有掘冢探柩之患】知足不辱【知足之人绝利去欲不辱其身】知止不殆【知可止则财利不累身声色不乱于耳目则身不危怠也】可以长久【人能知止足则福禄在己治身者神不劳治国者民不扰故可长久】 洪德第四十五 大成若【谓道德大成之君若者灭名藏誉如毁不备也 ○音缺】其用不【其用心如是则无弊尽时】大盈若冲【谓道德大盈满之君也 如冲者贵不敢骄也 富不敢奢也 】其用不穷【其用心如是则无穷尽时也 】大直若屈【大直谓修道法度正直如一也 如屈者不与俗人争如可屈折】大巧若拙【大巧谓多才术也 如拙者亦不敢见其能】大辩若讷【大辩者智无疑如讷者口无辞】躁胜寒【胜极也 春夏阳气躁疾于上万物盛夫极则寒寒则零落死亡也 言人不当刚强也 ○躁音灶】静胜【秋冬万物静于黄泉之下极则者生之源】清静为天下正【能清静则为天下长持正则无终巳时也 】 俭欲第四十六 天下有道【谓人主有道也】却走马以粪【粪者粪田也兵甲不用却走马治农田治身者却阳精以粪粪身○粪弗问反】天下无道【谓人主无道也】戎马生于郊【战伐不止戎马生于郊境之上久不还也】罪莫大于可欲【好色也】祸莫大于不知足【富贵不能自禁止也】咎莫大于欲得【欲得人物利且贪也○咎音臼】故知足之足【守真根也】常足【无欲心也】 鉴远第四十七 不出户知天下【圣人不出户以知天下者以己身知人身以己家知人家所以见天下也】不窥牖见天道【天道与人道同天人相通精气相贯人君清净天气自正人君多欲天气烦浊吉凶利害皆由于己○牖音酉】其出弥远其知弥少【谓去其家观人家去其身观人身所观益远所用益少也】是以圣人不行而知【圣人不上天不入渊能知天地以心知之】不见而名【上好道下好德上好武下好力圣人原小知大察内知外】不为而成【上无所为则下无事家给人足万物自化成也】 忘知第四十八 为学日益【学谓政教礼乐之学也日益者情欲文饰日以益多】为道日损【道谓自然之道也日损者情欲文饰日以消损】损之又损【损情欲又损之所以渐去】以至于无为【当恬淡如婴儿无所造为】无为而无不为【情欲断绝德与道合则无所不施无所不为也】取天下常以无事【取治也治天下常当以无事不畜烦劳也】及其有事不足以取天下【及其好有事则政教烦民不安故不足以治天下也】 任德第四十九 圣人无常心【圣人重改更贵因循若自无心】以百姓心为心【百姓心之所便因而从之】善者吾善之【百姓为善圣人因而善之】不善者吾亦善之【百姓虽有不善者圣人化之使善也",
      "translated_text": "The softest under heaven gallops through the hardest under heaven.\nThe softest is water; the hardest, metal and stone.\nWater can penetrate the firm and enter the rigid, passing through without obstruction.\nThere is nothing that enters where there are no gaps.\nBy this I know the benefit of non-action.\n\nThe teaching without words,\nThe benefit of non-action—\nFew under heaven attain them.\n\nTo set forth precepts, forty-fourth:\nName and self—which is dearer?\nSelf and goods—which is greater?\nGain and loss—which is more harmful?\nExcessive love must lead to great expense;\nHoarding much must lead to heavy loss.\nKnow contentment and you will not be disgraced;\nKnow when to stop and you will not be endangered—\nThus may you endure long.\n\nVast virtue, forty-fifth:\nGreat perfection seems flawed,\nYet its use is inexhaustible.\nGreat fullness seems empty,\nYet its use is unending.\nGreat straightness seems bent;\nGreat skill seems clumsy;\nGreat eloquence seems inarticulate.\nRestlessness overcomes cold,\nStillness overcomes heat.\nPurity and stillness set the standard for all under heaven.\n\nRestraining desire, forty-sixth:\nWhen the world follows the Dao,\nWarhorses are retired to fertilize the fields.\nWhen the world does not follow the Dao,\nMilitary steeds are bred even on the outskirts.\nNo sin is greater than indulging desire;\nNo disaster is greater than not knowing contentment;\nNo fault is greater than the desire for gain.\nThus, the contentment of knowing contentment\nIs ever content.\n\nMirroring afar, forty-seventh:\nWithout stepping outside, one knows all under heaven;\nWithout looking out the window, one sees the Dao of heaven.\nThe farther one goes,\nThe less one knows.\nTherefore the sage knows without traveling,\nNames without seeing,\nAccomplishes without acting.\n\nForgetting knowledge, forty-eighth:\nPursuing learning, one adds to it day by day;\nPursuing the Dao, one diminishes it day by day.\nDiminish and further diminish,\nUntil one reaches non-action.\nThrough non-action, nothing is left undone.\nTo take hold of all under heaven, one always acts without interference;\nWhen one interferes, one is not fit to take hold of all under heaven.\n\nEmploying virtue, forty-ninth:\nThe sage has no fixed mind,\nBut takes the mind of the people as their mind.\nThe good, I treat as good;\nThe not good, I also treat as good.\nVirtue is goodness.\nThe faithful, I trust;\nThe unfaithful, I also trust.\nVirtue is trust.\nThe sage, in ruling all under heaven,\nBlends their mind with the world,\nAnd the people all turn their ears and eyes toward them.",
      "overlap_context": "Two gives birth to the Three;\nThe Three gives birth to the myriad things.\n\nThe myriad things bear yin and embrace yang;\nThrough the blending of qi, they achieve harmony.\n\nWhat men dislike are only \"orphaned,\" \"widowed,\" and \"unworthy,\"\nYet kings and lords take these as their titles.\nThus, some things are diminished yet gain,\nWhile others are increased yet lose.\n\nWhat others teach,\nI also teach:\n\"The strong and violent do not meet their proper end.\"\nI shall take this as the father of my teaching.",
      "start_char": 15519,
      "end_char": 16778,
      "start_sentence": 667,
      "end_sentence": 690,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.42684817314148,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 30,
      "original_text": "】德善【百姓德化圣人为善】信者吾信之【百姓为信圣人因而信之】不信者吾亦信之【百姓为不信圣人化之使信也 】德信【百姓德化圣人为信】圣人在天下怵怵【圣人在天下怵怵常恐怖富贵不敢骄奢】为天下浑其心【言圣人为天下百姓浑浊其心若愚暗不通也 ○浑音混】百姓皆注其耳 目【注用也 百姓皆用其耳 目为圣人视听也 】圣人皆孩之【圣人爱念百姓如孩婴赤子长养之而不责望其报○孩胡来反】 贵生第五十 出生入死【出生为情欲出于内魂定魄静故生也 入死谓情欲入于胸臆精神劳惑故死】生之徒十有三死之徒十有三【言死生之各有十三谓九窍四关也 其生也 目不妄视耳",
      "translated_text": "Virtue is goodness.\nThe faithful, I trust;\nThe unfaithful, I also trust.\nVirtue is trust.\nThe sage, in ruling all under heaven,\nAbides in reverent caution,\nAnd for all under heaven blends their mind with the world,\nAs if muddled, dull, and unknowing.\nThe people all turn their ears and eyes toward them,\nAnd the sage treats them all as children.\n\nValuing Life, fiftieth:\nEmerging into life, entering death—\nThose who live: thirteen;\nThose who die: thirteen.\nFor life and death alike, thirteen are the portals—\nthe nine apertures and the four gates.\nIn life, the eyes do not recklessly see...",
      "overlap_context": "n, one always acts without interference;\nWhen one interferes, one is not fit to take hold of all under heaven.\n\nEmploying virtue, forty-ninth:\nThe sage has no fixed mind,\nBut takes the mind of the people as their mind.\nThe good, I treat as good;\nThe not good, I also treat as good.\nVirtue is goodness.\nThe faithful, I trust;\nThe unfaithful, I also trust.\nVirtue is trust.\nThe sage, in ruling all under heaven,\nBlends their mind with the world,\nAnd the people all turn their ears and eyes toward them.",
      "start_char": 16778,
      "end_char": 17036,
      "start_sentence": 691,
      "end_sentence": 702,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.160506010055542,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 31,
      "original_text": "不妄听鼻不妄香臭口不妄言味手不妄持足不妄行精神不妄施其死也 反是也 】人之生动之死地十有三【人之求生动作反之十三死也 】夫何故【问何故动之死地也 】以其生生之厚【所以动之死地者以其求生活之事太厚违道忤天妄行失纪】盖闻善摄生者【摄养也 】陆行不遇兕虎【自然远避害不干也 ○兕徐履反】入军不避甲兵【不好战以杀人】兕无所投其角虎无所措其爪兵无所容其刃【养生之人虎兕无由伤兵刃无从加之也 】夫何故【问虎兕兵甲何故不害之】以其无死地【以其不犯十三之死地言神明营防之此物不敢害】 养德第五十一 道生之【道生万物】德畜之【德一也 一生布气而畜养】物形之【一为万物设形象也 】势成之【一为万物作寒暑之势以成之】是以万物莫不尊道而贵德【道德所为无不尽惊动而尊敬】道之尊德之贵夫莫之命而常自然【道德不命召万物而常自然应之如影响】故道生之德畜之长之育之成之熟之养之覆之【道之于万物非但生之而已乃复长养成熟覆育全于性命人君治国治身亦当如是也 】生而不有【道生万物不有所取以为利也 】为而不恃【道所施为不恃望其报也 】长而不宰【道长养万物不宰割以为利也 】是谓德【道之所行恩德暗不可得见】 归元第五十二 天下有始【始有道也 】以为天下母【道为天下万物之母】既知其母复知其子【子一也 既知道己当复立一也 】既知其子复守其母【已知一当复守道反无为】没身不殆【不危殆也 】塞其兑【兑目也 目不妄视也 】其门【门口也 使口不妄言】终身不勤【人当塞目不妄视口不妄言则终身不勤苦】开其兑【开目视情欲也 】济其事【济益也 益情欲之事】终身不救【祸乱成也 】见小日明【萌芽未动祸乱未见为小昭然独见为明】守柔日强【守柔弱日以强大也 】用其光【用其目光于外视时世之利害】复归其明【复当反其光明于内无使精神泄也 】无遗身殃【内视存神不为漏失○遗去声】是谓习常【人能行此是谓习修常道】 益证第五十三 使我介然有知行于大道【介大也 老子疾时王不行大道故设此言使我介然有知于政事我则行于大道躬无为之化】唯施是畏【唯独也 独畏冇所施为失道意欲赏善恐伪善生欲信忠恐诈忠起】大道甚夷【夷平易也 】而民好径【径邪不平正也 大道甚平易而民好从邪径也",
      "translated_text": "The eyes do not recklessly see,\nThe ears do not recklessly hear,\nThe nose does not recklessly smell,\nThe mouth does not recklessly speak of flavors,\nThe hands do not recklessly grasp,\nThe feet do not recklessly walk,\nThe spirit does not recklessly extend—\nThus, one avoids death.\nThe opposite leads to death.\nOf those who live, thirteen move toward the realm of death.\nWhy is this?\nBecause they excessively pursue the thickness of life.\nI have heard that those who skillfully nurture life,\nWhile traveling on land, do not encounter rhinoceroses or tigers;\nWhen entering battle, they do not evade armor and weapons.\nThe rhinoceros finds nowhere to thrust its horn,\nThe tiger finds nowhere to place its claws,\nWeapons find nowhere to lodge their blades.\nWhy is this?\nBecause they do not enter the realm of death.\n\nNurturing Virtue, fifty-first:\nThe Dao gives them life,\nVirtue nurtures them.\nThings take form,\nCircumstances bring them to completion.\nThus, all things without exception honor the Dao and treasure virtue.\nThe honor of the Dao, the treasure of virtue—\nNothing commands them, yet they are ever naturally so.\nTherefore, the Dao gives them life, virtue nurtures them,\nFosters their growth, nourishes them,\nBrings them to maturity, ripens them,\nShelters and protects them.\nIt gives life yet does not possess,\nActs yet does not rely,\nFosters yet does not dominate—\nThis is called profound virtue.\n\nReturning to the Source, fifty-second:\nThe world has a beginning,\nWhich is the mother of all under heaven.\nHaving known the mother, one also knows her children;\nHaving known the children, one returns to guard the mother.\nThus, to the end of one’s days, one is not imperiled.\nBlock the openings,\nShut the gates—\nTo the end of one’s days, one does not toil.\nOpen the openings,\nAssist in their affairs—\nTo the end of one’s days, one cannot be saved.\nSeeing the small is called clarity;\nGuarding the soft is called strength.\nUse its light,\nReturn to its brightness,\nLest one leave behind calamity for the self—\nThis is called practicing the constant.\n\nIncreasing Evidence, fifty-third:\nIf I were suddenly to gain knowledge and walk the great Dao,\nOnly execution would I fear.\nThe great Dao is utterly level,\nYet the people prefer byways.\nThe courts are exceedingly resplendent,\nWhile the fields are exceedingly overgrown,\nAnd the granaries are exceedingly empty.\nThey wear fine embroidered robes,\nCarry sharp swords at their waists,\nSate themselves on food and drink,\nAnd amass excess wealth and goods—\nThese are called thieves and boasters.\nFar indeed is this from the Dao!",
      "overlap_context": "he sage, in ruling all under heaven,\nAbides in reverent caution,\nAnd for all under heaven blends their mind with the world,\nAs if muddled, dull, and unknowing.\nThe people all turn their ears and eyes toward them,\nAnd the sage treats them all as children.\n\nValuing Life, fiftieth:\nEmerging into life, entering death—\nThose who live: thirteen;\nThose who die: thirteen.\nFor life and death alike, thirteen are the portals—\nthe nine apertures and the four gates.\nIn life, the eyes do not recklessly see...",
      "start_char": 17036,
      "end_char": 17915,
      "start_sentence": 703,
      "end_sentence": 738,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.399072408676147,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 32,
      "original_text": "○好去声】朝甚除【高台榭宫室修】田甚芜【农事废不耕治○芜音无】仓甚虚【五谷伤害国无储也 】服文防【好饰伪贵尚华】利剑【尚刚强武且奢】厌饮食财货有余【多嗜欲无足时】是谓盗夸【百姓不足而君有余者是由劫盗以为服饰持行夸人不知身死家破亲戚并随也 】非道哉 【人君所行如是此非道也 复言哉 者痛伤之辞】 修观第五十四 善建者不防【建立也 善以道立身立国者不可得引而防也 】善抱者不脱【善以道抱精神者终不可防引解脱】子孙祭祀不辍【为人子孙能修道如是长生不死世世以久祭祀先祖宗庙无绝时】修之于身其德乃真【修道于身爱气养神益寿延年其德如是乃为真人】修之于家其德乃余【修道于家父慈子孝兄友弟顺夫信妻贞其德如是乃有余庆及于来世子孙】修之于乡其德乃长【修道于乡尊敬长老爱养防小教诲愚鄙其德如是乃无不覆及也 】修之于国其德乃丰【修道于国则君信臣忠仁义自生礼乐自兴政平无私其德如是乃为丰厚也 】修之于天下其德乃普【人主修道于天下不言而化不教而治下之应上信如影响其德如是乃为普博】故以身观身【以修道之身观不修道之身孰亡孰存也 】以家观家【以修道之家观不修道之家也 】以乡观乡【以修道之乡观不修道之乡也 】以国观国【以修道之国观不修道之国也 】以天下观天下【以修道之主观不修道之主也 】吾何以知天下之然哉 以此【老子言吾何知天下修道者昌背道者亡以此五事观而知之也 】 符第五十五",
      "translated_text": "Those who delight in such ways—\nThe courts are exceedingly adorned,\nThe fields are exceedingly barren,\nAnd the granaries are exceedingly empty.\nThey wear fine embroidered robes,\nGird themselves with sharp swords,\nSate themselves on food and drink,\nAnd hoard excess wealth and goods—\nThese are called thieves and boasters.\nFar indeed is this from the Dao!\n\nCultivating Observation, fifty-fourth:\nWhat is well established cannot be uprooted;\nWhat is well embraced cannot slip away.\nThus, descendants’ sacrifices never cease.\nCultivate it in the self, and one’s virtue becomes true;\nCultivate it in the family, and one’s virtue overflows;\nCultivate it in the village, and one’s virtue endures;\nCultivate it in the state, and one’s virtue abounds;\nCultivate it in the world, and one’s virtue becomes universal.\nTherefore, observe the self through the self,\nObserve the family through the family,\nObserve the village through the village,\nObserve the state through the state,\nObserve the world through the world.\nHow do I know the world is thus?\nBy this.\n\nMysterious Token, fifty-fifth:",
      "overlap_context": "ifty-third:\nIf I were suddenly to gain knowledge and walk the great Dao,\nOnly execution would I fear.\nThe great Dao is utterly level,\nYet the people prefer byways.\nThe courts are exceedingly resplendent,\nWhile the fields are exceedingly overgrown,\nAnd the granaries are exceedingly empty.\nThey wear fine embroidered robes,\nCarry sharp swords at their waists,\nSate themselves on food and drink,\nAnd amass excess wealth and goods—\nThese are called thieves and boasters.\nFar indeed is this from the Dao!",
      "start_char": 17915,
      "end_char": 18482,
      "start_sentence": 739,
      "end_sentence": 758,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.44288182258606,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 33,
      "original_text": "含德之厚【谓含懐道德之厚也 】比于赤子【神明保佑含德之人若父母之于赤子也 】毒虫不螫【蜂虿蛇虺不螫○螫音适】猛兽不据玃鸟不搏【赤子不害于物物亦不害之故太平之世人无贵贱之心有刺之物还反其本有毒之虫不伤于人○玃音矍抟音博】骨弱防柔而握固【赤子防骨柔弱而持物坚固以其意心不移也 ○防音斤】未知牝牡之合而防作精之至也 【赤子未知男女之合防而阴作怒者由精气多之所至也 ○防音韵】终日号而不哑和之至也 【赤子从朝至暮啼号声不变易者和气多之所至也 ○号平声】知和曰常【人能知和气之柔弱有益于人者则为知道之常也 】知常曰明【人能知道之常行则日以明达于妙也 】益生日祥【祥长也 益生言欲自生日以长矢】心使气日强【心当专一和柔而气实内故形柔而反使妄有所为和气去于中故形体日以刚强也 】物壮则老【万物壮极则枯老也 】谓之不道【老不得道】不道早已【不得道者早已死也 】 德第五十六",
      "translated_text": "He who contains profound virtue—\nThis means one who embraces the fullness of the Dao’s power—\nIs like an infant:\nVenomous creatures do not sting him,\nFierce beasts do not seize him,\nBirds of prey do not strike him.\nHis bones are weak, his sinews soft,\nYet his grasp is firm—\nFor his mind remains unshaken.\n\nHe knows not the union of male and female,\nYet his organ stirs:\nSuch is the perfection of his essence.\nHe wails all day without growing hoarse:\nSuch is the perfection of his harmony.\n\nTo know harmony is to know the constant;\nTo know the constant is to be enlightened.\nTo seek to prolong life is ominous;\nTo let the mind direct the qi is to become rigid.\n\nWhen things reach their prime, they age—\nThis is called not following the Dao.\nWhat does not follow the Dao perishes early.",
      "overlap_context": "Cultivate it in the family, and one’s virtue overflows;\nCultivate it in the village, and one’s virtue endures;\nCultivate it in the state, and one’s virtue abounds;\nCultivate it in the world, and one’s virtue becomes universal.\nTherefore, observe the self through the self,\nObserve the family through the family,\nObserve the village through the village,\nObserve the state through the state,\nObserve the world through the world.\nHow do I know the world is thus?\nBy this.\n\nMysterious Token, fifty-fifth:",
      "start_char": 18482,
      "end_char": 18854,
      "start_sentence": 759,
      "end_sentence": 773,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.509938716888428,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 34,
      "original_text": "知者不言【知者贵行不贵言也 】言者不知【驷不及舌多言多患】塞其兑其门【塞之者欲绝其源】挫其锐【情欲有所锐为当念道无为以挫止之也 挫子卧反】解其纷【纷结恨不休当念道无为以解释之】和其光【虽有独见之明当和之使暗昧不便矅】同其尘【不当自别殊也 】是谓同【天也 人能行此上事是谓与天同道也 】故不可得而亲【不以荣誉为乐独立为哀】亦不可得而踈【志静无故与人无怨】不可得而利【身不欲富贵口不欲五味】亦不可得而害【不与贪争利不与勇争气】不可得而贵【不为乱世主不处暗君位】亦不可得而贱【不以乘权故骄不以失志故屈】故为天下贵【其德如此天子不得臣诸侯不得屈与世沉浮容身避害故为天下贵也 】 淳风第五十七",
      "translated_text": "The wise do not speak—\nFor the wise value action over words—\nThose who speak are not wise—\nA team of horses cannot overtake the tongue; much speech brings many woes.\n\nBlock the openings, shut the gates—\nTo sever the source.\nBlunt the sharpness—\nWhen passions and desires arise with keen force, reflect on the Dao’s non-action to subdue them.\nUntangle the knots—\nWhen resentments and entanglements persist, reflect on the Dao’s non-action to dissolve them.\nSoften the light—\nThough one may possess unique insight, temper it to dim its brilliance.\nMerge with the dust—\nDo not set oneself apart.\n\nThis is called the Mysterious Union—\nThe celestial. One who practices these things above is said to unite with Heaven’s Dao.\n\nThus one cannot be drawn near—\nNot delighting in honor, standing alone in sorrow.\nNor can one be kept at a distance—\nWith a tranquil mind and no cause, there is no enmity with others.\nOne cannot be benefited—\nThe body does not seek wealth or nobility; the mouth does not crave fine flavors.\nNor can one be harmed—\nNot contending for gain with the greedy, nor for pride with the fierce.\nOne cannot be exalted—\nNot ruling in a chaotic age, nor serving in the court of a benighted lord.\nNor can one be debased—\nNot growing arrogant with power, nor bending in defeat.\n\nTherefore, one is honored by all under Heaven—\nWith such virtue, even the Son of Heaven cannot make them a subject, nor can feudal lords bend them. Flowing with the world, they preserve their integrity and evade harm—thus they are honored by all under Heaven.",
      "overlap_context": "nd remains unshaken.\n\nHe knows not the union of male and female,\nYet his organ stirs:\nSuch is the perfection of his essence.\nHe wails all day without growing hoarse:\nSuch is the perfection of his harmony.\n\nTo know harmony is to know the constant;\nTo know the constant is to be enlightened.\nTo seek to prolong life is ominous;\nTo let the mind direct the qi is to become rigid.\n\nWhen things reach their prime, they age—\nThis is called not following the Dao.\nWhat does not follow the Dao perishes early.",
      "start_char": 18854,
      "end_char": 19150,
      "start_sentence": 774,
      "end_sentence": 781,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.560480833053589,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 35,
      "original_text": "以正治国【以至也 天使正身之人使至有国也 】以奇用兵【奇诈也 天使诈为之人使用兵也 】以无事取天下【以无事无为之人使取天下为之主】吾何以知其然哉 以此【此今也 老子言我何以知天意然哉 以今日所见知】天下多忌讳而民弥贫【天下谓人主也 忌讳者防禁也 令烦则奸生禁多则下诈相殆故贫】民多利器国家滋昏【利器者权也 民多权则视者于目听者惑于耳 上下不亲故国家昏乱】人多伎巧奇物滋起【人谓人君百里诸侯也 多知伎巧谓刻画宫观雕琢服章奇物滋起下则化上饰金镂玉文绣防色日以滋甚】法物滋彰盗贼多有【法物好物也 珍好之物滋生彰着则农事废寒并至故盗贼多有也 】故圣人云【谓下事也",
      "translated_text": "With rectitude govern the state—\nThus does Heaven send forth those of upright conduct to rule over domains.\nWith stratagem deploy the army—\nThus does Heaven employ those skilled in deception to command troops.\nWith nonaction win all under Heaven—\nThus does Heaven establish those who act not as its sovereigns.\n\nHow do I know this is so? By this:\nThe more taboos and prohibitions in the world, the poorer the people grow—\nThe world refers to the ruler; taboos are restrictions. When decrees multiply, deceit arises; when bans proliferate, the people resort to fraud, and thus poverty spreads.\nThe more sharp instruments the people possess, the more benighted the state becomes—\nSharp instruments are powers. When the people wield many powers, the eyes of those who watch grow dazzled, the ears of those who listen grow confused; above and below grow estranged, and thus the state falls into chaos.\nThe more cunning and craft the people cultivate, the more extravagant things arise—\nThe people refer to the ruler and the feudal lords. Cunning and craft mean the carving of palaces, the engraving of garments, the proliferation of rare adornments. Below, the people emulate above: gold is inlaid, jade is carved, embroidery and brocade flourish, and sensual allurements grow daily more excessive.\nThe more ritual objects and fine goods are displayed, the more thieves and bandits appear—\nRitual objects are precious things. When such treasures multiply and are flaunted, agriculture is abandoned, cold and hunger ensue, and thus thieves and bandits abound.\n\nTherefore the sage declares—",
      "overlap_context": "ding for gain with the greedy, nor for pride with the fierce.\nOne cannot be exalted—\nNot ruling in a chaotic age, nor serving in the court of a benighted lord.\nNor can one be debased—\nNot growing arrogant with power, nor bending in defeat.\n\nTherefore, one is honored by all under Heaven—\nWith such virtue, even the Son of Heaven cannot make them a subject, nor can feudal lords bend them. Flowing with the world, they preserve their integrity and evade harm—thus they are honored by all under Heaven.",
      "start_char": 19150,
      "end_char": 19417,
      "start_sentence": 782,
      "end_sentence": 796,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.59899640083313,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 36,
      "original_text": "】我无为而民自化【圣人言我修道承天无所作为而民自化成也 】我好静而民自正【圣人言我好静不言不教民皆自忠正也 】我无事而民自富【我无徭役征召之事民安其业故皆自富】我无欲而民自朴【我常无欲去华饰民则随我为多质朴也 】 顺化第五十八 其政闷闷【其政教宽大闷闷昧昧似若不明也 】其民醇醇【政教宽大故民醇醇富贵相亲睦也 】其政察察【其政教急疾言决于口听决于耳 也 】其民【政教急民不聊生故日以踈薄】祸兮福之所倚【倚因也 夫祸因福而生人遭祸而能悔过责已修善行道则祸去而福来】福兮祸之所伏【祸伏匿于福中人得福而为骄恣则福去祸来】孰知其极【祸福更相生谁能知其穷极时】其无正【无不也 谓人君不正其身其无国也 】正复为奇【奇诈也 人君不正下虽正复化上为诈也 】善复为訞【善人皆复化上为訞祥也 】民之迷其日固乆【言人君迷惑失正以来其日已固久】是以圣人方而不割【圣人行方正者欲以率下不以割截人也 】廉而不害【圣人廉清欲以化民不以伤害人也 今则不然正巳以害人也 】直而不肆【肆申也 圣人虽直曲巳从人不自申之也 】光而不曜【圣人虽有独知之明常如暗昧不以曜昡人也 】 守道第五十九",
      "translated_text": "】I practice non-action, and the people transform of themselves—\nThe sage declares: I cultivate the Dao and follow Heaven, doing nothing, and the people mature of themselves.\n\nI value stillness, and the people rectify themselves—\nThe sage declares: I cherish stillness, neither speaking nor instructing, yet the people all become loyal and upright.\n\nI undertake no affairs, and the people prosper of themselves—\nI impose no corvée labor or conscription, so the people secure their livelihoods and thus all grow wealthy.\n\nI harbor no desires, and the people return to simplicity—\nI constantly remain desireless, casting off extravagance, and the people then follow me in embracing plainness and simplicity.\n\n*Conforming Transformation* Fifty-Eighth\nWhen governance is dull and dim—\nIts policies and teachings are magnanimous, dull and dim, seemingly obscure.\n\nThe people are honest and sincere—\nBecause governance is magnanimous, the people are honest and sincere, with wealth and nobility fostering mutual harmony.\n\nWhen governance is sharp and severe—\nIts policies and teachings are hasty and urgent, words decided by the mouth, judgments by the ear.\n\nThe people grow hollow and thin—\nWith governance so urgent, the people find no means of survival, and thus grow hollow and thin, daily more estranged and shallow.\n\nMisfortune!—where fortune leans—\nTo lean is to depend. Misfortune arises from fortune; when people encounter misfortune yet can repent, blame themselves, cultivate goodness, and practice the Dao, then misfortune departs and fortune arrives.\n\nFortune!—where misfortune lies in ambush—\nMisfortune lurks hidden within fortune; when people obtain fortune yet grow arrogant and indulgent, then fortune departs and misfortune arrives.\n\nWho knows its ultimate end?\nAs misfortune and fortune beget one another, who can know when their cycle will reach its limit?\n\nThere is no constancy—\n\"No\" means \"not.\" If the ruler does not rectify himself, there will be no state.\n\nRectitude reverts to perversity—\nPerversity means deceit. If the ruler is not upright, though those below may be correct, they will transform to follow above in deceit.\n\nGoodness reverts to ominousness—\nAll good people will transform to follow above in ominousness.\n\nThe people’s delusion has long been entrenched—\nThe ruler’s confusion and loss of rectitude have endured for a fixed and prolonged time.\n\nThus the sage is square but does not cut—\nThe sage acts with integrity, desiring to lead those below, yet does not use it to sever others.\n\nIs incorruptible but does not harm—\nThe sage is pure and clear, desiring to transform the people, yet does not use it to injure others. Now, however, it is otherwise: rectitude is used to harm others.\n\nIs straight but does not extend—\nTo extend is to stretch forth. Though the sage is straight, he bends himself to follow others and does not assert himself.\n\nShines but does not dazzle—\nThough the sage possesses unique insight, he remains as if dim and obscure, never using his brilliance to dazzle others.\n\n*Holding to the Dao* Fifty-Ninth",
      "overlap_context": " engraving of garments, the proliferation of rare adornments. Below, the people emulate above: gold is inlaid, jade is carved, embroidery and brocade flourish, and sensual allurements grow daily more excessive.\nThe more ritual objects and fine goods are displayed, the more thieves and bandits appear—\nRitual objects are precious things. When such treasures multiply and are flaunted, agriculture is abandoned, cold and hunger ensue, and thus thieves and bandits abound.\n\nTherefore the sage declares—",
      "start_char": 19417,
      "end_char": 19884,
      "start_sentence": 797,
      "end_sentence": 819,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.879387855529785,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 37,
      "original_text": "治人【谓人君欲治理人民】事天【事用也 当用天道顺四时】莫若啬【啬贪也 治国者当爱民财不为奢泰治身者当爱精气不放○啬音色】夫惟啬是谓早服【早先也 服得也 夫独爱民财爱精气则能先得天道也 】早服谓之重积德【先得天道是谓重积德于己也 ○重平声】重积德则无不克【克胜也 重积德于己则无不胜】无不克则莫知其极【无不克胜则莫冇知己德之穷极也 】莫知其极可以有国【莫知己德有极则可以有杜稷为民致福】有国之母可以长久【国身同也 母道也 人能保身中之道使精气不劳五神不苦则可以长久】是谓深根固【人能以气为根以精为蒂如根不深则枝蒂不坚不坚则落言深藏其气固守其精使无漏泄○蒂音帝】长生久视之道【深根固蒂者乃长生久视之道】 河上公章句第四 居位第六十",
      "translated_text": "Governing people—\nThis means the ruler desiring to govern and order the people.\n\nServing Heaven—\n*Serving* means *employing*; one must employ the Way of Heaven and follow the four seasons.\n\nNothing compares to frugality—\n*Frugality* means *thrift*. Those who govern the state must cherish the people’s wealth and not indulge in extravagance; those who cultivate the self must cherish their essence and qi, never dissipating them.\n\nOnly through frugality can one be said to attain early compliance—\n*Early* means *first*; *compliance* means *attainment*. Only by cherishing the people’s wealth and one’s essence and qi can one first attain the Way of Heaven.\n\nEarly compliance is called the repeated accumulation of virtue—\nTo first attain the Way of Heaven is to repeatedly accumulate virtue within oneself.\n\nWith the repeated accumulation of virtue, there is nothing one cannot overcome—\n*Overcome* means *to prevail*. With virtue repeatedly accumulated within, there is nothing one cannot conquer.\n\nWith nothing one cannot overcome, none can fathom its limit—\nWhen there is nothing one cannot conquer, none can know the ultimate extent of one’s virtue.\n\nWhen none can fathom its limit, one can possess the state—\nWhen none can know the limit of one’s virtue, one can possess the altars of soil and grain and bring blessings to the people.\n\nPossessing the mother of the state, one can endure long—\nThe state and the self are the same; *mother* means the Way. If one can preserve the Way within the self, keeping essence and qi unwearied and the five spirits unharmed, one can endure long.\n\nThis is called deep roots and firm stem—\nIf one can take qi as the root and essence as the stem—just as when roots run deep, branches and stems are firm, and when firm, they do not fall—it means deeply storing one’s qi and firmly guarding one’s essence, allowing no leakage.\n\nThe Way of long life and enduring vision—\nDeep roots and a firm stem: this is the Way of long life and enduring vision.\n\n*Commentary on the* Laozi *by Heshang Gong, Chapter Four: \"Holding Office,\" Sixty*",
      "overlap_context": "age is pure and clear, desiring to transform the people, yet does not use it to injure others. Now, however, it is otherwise: rectitude is used to harm others.\n\nIs straight but does not extend—\nTo extend is to stretch forth. Though the sage is straight, he bends himself to follow others and does not assert himself.\n\nShines but does not dazzle—\nThough the sage possesses unique insight, he remains as if dim and obscure, never using his brilliance to dazzle others.\n\n*Holding to the Dao* Fifty-Ninth",
      "start_char": 19884,
      "end_char": 20197,
      "start_sentence": 820,
      "end_sentence": 832,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.56580138206482,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 38,
      "original_text": "治大国若烹小鲜【鲜鱼烹小鱼不去肠不去鳞不敢挠恐其糜也治国烦则下乱治身烦则精散】以道莅天下其不神【以道德居位治天下则不敢见其精神以犯人也】非其不神其神不伤人【其非无精神也邪不入正不能伤自然之人】非其神不伤人圣人亦不伤人【非神不能伤害人以圣人在位不伤害人故不敢干之也】夫两不相伤【与圣人俱两不相伤也】故德交归焉【夫两不相伤人得治于阳得治于阴人得全其性命得保其精神故德交归焉】 谦德第六十一 大国者下流【治大国当如居下流不逆细微】天下之交【大国天下士民之所交会】天下之牝【牝者阴也 柔谦和而不昌也 】牝常以静胜牡【女所以胜屈于男阴胜阳以安静不先求之也 】以静为下【阴道以安静为谦下】故大国以下小国则取小国【能谦下之则常有之○下去声取平声又去声】小国以下大国则取大国【此言国无大小能执谦畜人则无过失也 】故或下以取或下而取【下者谓大国以下小国小国以下大国更以义相取】大国不过欲兼畜人【大国不可失则兼并人国而牧畜之○过平声又去声】小国不过欲入事人【使为臣偞】夫两者各得其所欲大者宜为下【大国小国各欲得其所大国又宜为谦下】 为道第六十二 道者万物之奥【奥藏也",
      "translated_text": "Governing a great state is like cooking a small fish—\nWhen cooking a small fish, one does not remove its entrails or scales, nor dare stir it, lest it fall apart. Governing a state with excessive meddling brings chaos below; tending the self with excessive fuss scatters one’s essence.\n\nWith the Dao presiding over the world, its demons do not manifest their numinosity—\nWhen one governs the world with virtue and the Dao, demons dare not display their spiritual power to offend others.\n\nNot that its demons lack numinosity, but their numinosity does not harm people—\nThese demons are not without spiritual power, yet when evil does not invade the upright, it cannot harm those who follow nature.\n\nNot that their numinosity does not harm people, but the sage also does not harm people—\nIt is not that the demons’ numinosity cannot harm others, but with the sage in office, he does not harm others, so demons dare not encroach.\n\nThus, the two do not harm one another—\nDemons and the sage both refrain from mutual harm.\n\nTherefore, their powers converge and return—\nWhen the two do not harm one another, people are governed by yang, demons are governed by yin; people preserve their nature and life, demons safeguard their spiritual power. Thus, their powers converge and return.\n\n*Chapter Sixty-One: \"The Virtue of Humility\"*\n\nA great state is the lower reaches of the river—\nGoverning a great state should be like dwelling in the lower reaches, not opposing the subtle and small.\n\nThe confluence of all under heaven—\nA great state is where the scholars and people of all under heaven gather.\n\nThe female of all under heaven—\nThe female is the essence of yin, gentle and humble, never overbearing.\n\nThe female constantly overcomes the male with stillness—\nThe female overcomes the male’s submission through tranquility, never seeking precedence.\n\nWith stillness as her lower position—\nThe way of yin takes tranquility as humility.\n\nThus, when a great state lowers itself before a small state, it gains the small state—\nWhen it practices humility, it constantly possesses it.\n\nWhen a small state lowers itself before a great state, it gains the great state—\nThis means that regardless of size, a state that holds humility and nurtures others commits no errors.\n\nThus, some lower themselves to gain, while others lower themselves and are gained—\n\"Lowering\" refers to a great state humbling itself before a small one, or a small state humbling itself before a great one, each gaining the other through righteousness.\n\nA great state desires nothing more than to nurture and embrace others—\nA great state must not transgress its bounds; it merges with other states to shepherd and embrace them.\n\nA small state desires nothing more than to serve and attend others—\nTo act as a vassal.\n\nBoth attain what they desire; the greater should be the lower—\nBoth great and small states achieve their aims; the greater should practice humility.\n\n*Chapter Sixty-Two: \"The Dao\"*\n\nThe Dao is the hidden sanctuary of the ten thousand things—\n\"Hidden sanctuary\" means the innermost recess.",
      "overlap_context": "ne can endure long.\n\nThis is called deep roots and firm stem—\nIf one can take qi as the root and essence as the stem—just as when roots run deep, branches and stems are firm, and when firm, they do not fall—it means deeply storing one’s qi and firmly guarding one’s essence, allowing no leakage.\n\nThe Way of long life and enduring vision—\nDeep roots and a firm stem: this is the Way of long life and enduring vision.\n\n*Commentary on the* Laozi *by Heshang Gong, Chapter Four: \"Holding Office,\" Sixty*",
      "start_char": 20197,
      "end_char": 20686,
      "start_sentence": 833,
      "end_sentence": 841,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.748507261276245,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 39,
      "original_text": "道为万物之藏无所不容也 ○奥音懊又音】善人之宝【善人以道为身宝不敢违】不善人之所保【道者不善人之保倚也 遭患逄急犹自知悔卑下】美言可以市【美言者独可于市耳 夫市交易而退不相冝善言美语求者欲疾得卖者欲疾售也 】尊行可以加人【加别也 人有尊贵之行可以别异于凡人未足以尊道○行去声】人之不善何弃之有【人虽不善当以道化之盖三皇之前无有弃民德化淳也 】故立天子置三公【欲使教化不善之人】虽有拱璧以先驷马不如坐进此道【虽冇美璧先驷马而至故不如坐进此道○先去声】古之所以贵此道者何不日以求得【古之所以贵此道者不日日远行求索近得之于身】有罪以免耶【有罪谓遭乱世暗君妄行刑诛修道则可以解死免于罪耶】故为天下贵【道德洞远无不覆济全身治国恬然无为故可为天下贵也 】 恩始第六十三",
      "translated_text": "The Dao is the treasury of the ten thousand things, containing all without exception—\n*\"Hidden sanctuary\"* (奥, pronounced *ào* or *yù*).\n\nIt is the treasure of the good—\nThe good hold the Dao as their most precious possession, never daring to transgress it.\n\nIt is the refuge of the not-good—\nThe Dao is the support and reliance of the not-good; when calamity strikes or urgency presses, they may yet know remorse and humble themselves.\n\nFair words may be traded in the marketplace—\nFair words alone suffice in the marketplace. For in the marketplace, exchanges are made and parties depart, never to meet again. The seeker wishes for swift acquisition, the seller for swift sale.\n\nNoble conduct may be set above others—\n*\"Set above\"* means to distinguish. One whose conduct is noble and exalted may be set apart from the common, though this is not yet sufficient to honor the Dao.\n\nWhy should the not-good be cast aside?\nThough a person be not-good, they should be transformed by the Dao. For before the Three Sovereigns, there were no abandoned people—virtue and transformation were pure.\n\nThus the Son of Heaven is established, and the Three Dukes are appointed—\nTo teach and transform those who are not-good.\n\nThough one may offer a jade disk preceded by a team of four horses, it is not equal to sitting and presenting this Dao—\nThough one possess a fine jade disk and arrive first with a team of four horses, it is not equal to sitting and presenting this Dao.\n\nWhy was this Dao so prized in ancient times?\nNot by daily seeking it afar, but by finding it near, within oneself.\n\nCan it absolve one of guilt?\n*\"Guilt\"* refers to living in a chaotic age under a benighted ruler who metes out punishments and executions at whim. By cultivating the Dao, one may dissolve death and be absolved of guilt.\n\nThus it is prized under heaven—\nThe Dao is vast and all-pervading, sheltering all, preserving the self, and governing the state with tranquility and non-action. Therefore, it is prized under heaven.\n\n*Chapter Sixty-Three: \"Grace as the Beginning\"*",
      "overlap_context": "d embrace others—\nA great state must not transgress its bounds; it merges with other states to shepherd and embrace them.\n\nA small state desires nothing more than to serve and attend others—\nTo act as a vassal.\n\nBoth attain what they desire; the greater should be the lower—\nBoth great and small states achieve their aims; the greater should practice humility.\n\n*Chapter Sixty-Two: \"The Dao\"*\n\nThe Dao is the hidden sanctuary of the ten thousand things—\n\"Hidden sanctuary\" means the innermost recess.",
      "start_char": 20686,
      "end_char": 21011,
      "start_sentence": 842,
      "end_sentence": 850,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.895955085754395,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 40,
      "original_text": "为无为【因成修故无所造作】事无事【豫有备除烦省事也 】味无味【深思远虑味道意也 】大小多少【陈其戒令也 欲大反小欲多反少自然之道也 】报怨以德【修道行善绝祸于未生也 】图难于其易【欲图难事先于易者未及成也 ○易去声】为大于其细【欲为大事必作于小祸乱从小来也 】天下难事必作于易天下大事必作于细是以圣人终不为大故能成其大【天下共归之也 】夫轻诺必寡信【不重言也 】多易必多难【不慎患也 ○难去声】是以圣人犹难之【圣人动作举事犹进退重难之欲塞其源】故终无难【圣人终身无患难之事犹避害也 】 守微第六十四",
      "translated_text": "Act with non-action—[by completing cultivation, thus having no need for contrivance.]\nAttend to non-affairs—[by preparing in advance, eliminating troubles, and simplifying matters.]\nSavor the flavorless—[through profound reflection and far-reaching contemplation of the Dao’s meaning.]\nIn great and small, many and few—[this sets forth the admonitions: desiring greatness, one returns to smallness; desiring abundance, one returns to scarcity—such is the natural Dao.]\nRepay resentment with virtue—[by cultivating the Dao and practicing goodness, one severs misfortune before it arises.]\nPlan for difficulty while it is still easy—[to address difficult matters, begin with what is easy, before they come to fruition.]\nAchieve greatness by starting with the minute—[to accomplish great undertakings, one must begin with small things, for calamity and disorder arise from the minor.]\nThe difficult affairs of the world necessarily begin with the easy; the great affairs of the world necessarily begin with the minute. Therefore, the sage never attempts greatness and thus is able to accomplish greatness—[for the world converges upon him.]\n\nTrivial promises surely lack trust—[for they are not given weight.]\nExcessive ease surely brings many difficulties—[for one does not guard against misfortune.]\nThus, the sage treats even the easy as difficult—[in all actions and undertakings, the sage advances and retreats with caution, treating difficulty with gravity, seeking to block its source.]\nTherefore, he ultimately encounters no difficulty—[the sage remains free from misfortune and adversity throughout his life, ever avoiding harm at its root.]\n\n*Chapter Sixty-Four: \"Guarding the Minute\"*",
      "overlap_context": "nding it near, within oneself.\n\nCan it absolve one of guilt?\n*\"Guilt\"* refers to living in a chaotic age under a benighted ruler who metes out punishments and executions at whim. By cultivating the Dao, one may dissolve death and be absolved of guilt.\n\nThus it is prized under heaven—\nThe Dao is vast and all-pervading, sheltering all, preserving the self, and governing the state with tranquility and non-action. Therefore, it is prized under heaven.\n\n*Chapter Sixty-Three: \"Grace as the Beginning\"*",
      "start_char": 21011,
      "end_char": 21255,
      "start_sentence": 851,
      "end_sentence": 863,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.6142737865448,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 41,
      "original_text": "其安易持【治身治国安静者易守持也 】其未兆易谋【情欲祸患未有形兆时易谋正也 】其脆易破【祸乱未动于朝情欲未见于色如脆弱易除破○脆七岁反】其微易散【其未彰着微小易散去也 】为之于未有【欲有所为当于未有萌芽之时塞其端也 】治之于未乱【治身治国于未乱之时当豫闭其门也 】合抱之木生于毫末【从小成大】九层之台起于累土【从卑至高】千里之行始于足下【从近至远】为者败之【有为于事废于自然有为于义反于仁有为于色废于精神也 】执者失之【执利遇患执道全身坚持不得推让反还】圣人无为故无败【圣人不为华文不为色利不为残贼故无坏败】无执故无失【圣人有德以教愚有财以与贫无所执藏故无所失于人也 】民之从事常于几成而败之【从为也 民人为事常于功德防成而贪位好名奢泰盈满而自败也 】慎终如始则无败事【终当如始不当懈怠】是以圣人欲不欲【圣人欲人所不欲人欲彰显圣人欲伏光人欲文饰圣人欲质朴人欲色圣人欲于德也 】不贵难得之货【圣人不为服不贱石而贵玉】学不学【圣人学人所不能学人学智诈圣人学自然人学治世圣人学治身守道真也 】复众人之所过【众人学问反过本为末过实为华复之者使反本也 】以辅万物之自然【教人反本实者欲以辅助万物自然之性也 】而不敢为【圣人动作因循不敢有所造为恐远本也 】 淳德第六十五",
      "translated_text": "The secure is easily maintained—[in governing body and state, tranquility is easily preserved.]\nThe unmanifest is easily planned for—[when passions, desires, and misfortunes have yet to take shape, they are easily corrected.]\nThe brittle is easily shattered—[when disorder has not yet stirred in court and desires have not yet shown in countenance, they are as fragile and easily removed.]\nThe minute is easily dispersed—[before it becomes evident, the small is easily dissolved.]\n\nAct before it arises—[to undertake anything, block its inception at the moment of sprouting.]\nGovern before disorder begins—[in governing body and state, when all is yet unchaotic, preemptively close the gate.]\n\nA tree of arm-spanning girth grows from a tender shoot—[from small to great.]\nA nine-tiered terrace rises from a mound of earth—[from low to high.]\nA journey of a thousand li begins beneath the foot—[from near to far.]\n\nTo act is to ruin it—[acting in affairs disrupts the natural; acting in righteousness contradicts benevolence; acting in desire depletes the spirit.]\nTo grasp is to lose it—[grasping profit invites calamity; grasping the Dao preserves the body. Firm adherence cannot be relinquished, for it returns in kind.]\n\nThe sage practices non-action and thus suffers no ruin—[the sage does not adorn with embellishments, nor pursue sensual pleasures or profit, nor inflict harm, and so remains uncorrupted.]\nThe sage holds nothing and thus loses nothing—[the sage possesses virtue to teach the foolish and wealth to aid the poor, holding nothing in reserve, and so loses nothing to others.]\n\nThe people in their undertakings often fail at the brink of completion—[in their pursuits, the people, when on the verge of achieving merit, become greedy for rank, enamored of fame, extravagant and self-satisfied, and so bring ruin upon themselves.]\nBe as cautious at the end as at the beginning, and there will be no failure—[the end must be like the beginning; one must not grow lax.]\n\nThus, the sage desires what others do not desire—[others desire ostentation; the sage desires concealment of brilliance. Others desire adornment; the sage desires plainness. Others desire sensuality; the sage desires virtue.]\nThe sage does not prize rare and precious goods—[the sage does not wear fine garments, nor despise stone while prizing jade.]\nThe sage learns what others do not learn—[others learn cunning and deceit; the sage learns the natural. Others learn to govern the world; the sage learns to govern the self and guard the true Dao.]\nThe sage restores what the multitude has transgressed—[the multitude in their learning reverses root and branch, takes substance for ornament. To restore is to return them to the root.]\n\nThus, he aids the naturalness of the myriad things—[teaching people to return to the root and substance is to assist the natural disposition of the myriad things.]\nYet dares not act—[the sage’s actions follow the course of things and dare not create or contrive, fearing to stray from the root.]\n\n*Chapter Sixty-Five: \"Unadulterated Virtue\"*",
      "overlap_context": "given weight.]\nExcessive ease surely brings many difficulties—[for one does not guard against misfortune.]\nThus, the sage treats even the easy as difficult—[in all actions and undertakings, the sage advances and retreats with caution, treating difficulty with gravity, seeking to block its source.]\nTherefore, he ultimately encounters no difficulty—[the sage remains free from misfortune and adversity throughout his life, ever avoiding harm at its root.]\n\n*Chapter Sixty-Four: \"Guarding the Minute\"*",
      "start_char": 21255,
      "end_char": 21776,
      "start_sentence": 864,
      "end_sentence": 879,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.543152332305908,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 42,
      "original_text": "古之善为道者【谓古之善以道治身及治国者】非以明民【不以道教民明知巧诈也 】将以愚之【将以道德教民使朴质不诈伪】民之难治以其智多【以其智多故为巧伪】以智治国国之贼【使智惠之人治国之政事必远道德妄作威福为国之贼】不以智治国国之福【不使智惠之人治国之政事则民守正直不为邪饰上下相亲君臣同力故为国之福也 】知此两者亦楷式【两者谓智与不智者当知智者为贼不智者能为福是治身治国之法式也 】常知楷式是谓德【天也 能知治身及治国之法式是谓与天同德也 】德深矣 远矣 【德之人深不可测远不可极也 】与物反矣 【德之人与万物反异万物欲益已德施与人也 】乃至于大顺【德与万物反异故能至大顺顺天理也 】 后己第六十六",
      "translated_text": "Those of old who were adept in the Way—[referring to those of old who skillfully governed the self and the state through the Dao]—did not enlighten the people with cleverness—[they did not teach the people cunning and deceit through the Dao]. Instead, they sought to make them simple—[they taught the people through virtue and the Dao, fostering sincerity and eliminating deceit].\n\nThe people are difficult to govern because their knowledge is excessive—[their excessive knowledge leads to cunning and deceit]. To govern the state through knowledge is the state’s ruin—[if those with intelligence and wisdom are entrusted with state affairs, they will distance themselves from the Dao, recklessly wielding power for personal gain, becoming the state’s ruin]. Not governing the state through knowledge is the state’s blessing—[if those with intelligence and wisdom are not entrusted with state affairs, the people will uphold integrity, refrain from deception, and foster harmony between ruler and subject, uniting their efforts—this is the state’s blessing].\n\nTo understand these two paths is to grasp the model—[the two paths refer to knowledge and the absence of knowledge; knowing that knowledge leads to ruin while the absence of knowledge brings blessing is the model for governing the self and the state]. To constantly understand this model is called profound virtue—[profound virtue aligns with Heaven; to comprehend the model for governing the self and the state is to share the virtue of Heaven].\n\nProfound virtue runs deep and far—[the person of profound virtue is unfathomable and boundless]. They move contrary to things—[the person of profound virtue differs from the myriad things; while things seek to benefit themselves, profound virtue bestows upon others]. Thus they attain great harmony—[profound virtue, moving contrary to things, achieves great harmony, aligning with the principles of Heaven].\n\n*Chapter Sixty-Six: \"Putting Others First\"*",
      "overlap_context": "ultitude has transgressed—[the multitude in their learning reverses root and branch, takes substance for ornament. To restore is to return them to the root.]\n\nThus, he aids the naturalness of the myriad things—[teaching people to return to the root and substance is to assist the natural disposition of the myriad things.]\nYet dares not act—[the sage’s actions follow the course of things and dare not create or contrive, fearing to stray from the root.]\n\n*Chapter Sixty-Five: \"Unadulterated Virtue\"*",
      "start_char": 21776,
      "end_char": 22073,
      "start_sentence": 880,
      "end_sentence": 892,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.040236949920654,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 43,
      "original_text": "江海所以能为百谷王者以善下之【江海以卑故众流归之若民归就王○下去声】故能为百谷王【以卑下故能为百谷王也 】是以圣人欲上民【欲在民上】必以言下之【法江海处谦虚○下去声】欲先民【欲在民之前也 】必以身后之【先人而后己也 】是以圣人处上而民不重【圣人在民上为主不以尊贵虚下故民戴而不为重】处前而民不害【圣人在民前不以光明蔽后民亲之若父母无有欲害之心也 】是以天下乐推而不厌【圣人恩深爱厚视民如赤子故天下乐推进以为主无有厌也 ○厌去声】以其不争【天下无厌圣人时是由圣人不与人争先后也 】故天下莫能与之争【言人皆冇为无能争与吾争无为】 三宝第六十七 天下皆谓我大似不肖【老子言天下谓我德大我则佯愚似不肖】夫唯大故似不肖【唯独名德大者为身害故佯愚似若不肖无所分别无所割截不贱人而自贵】若肖久矣 【肖善也 谓辨惠也",
      "translated_text": "The rivers and seas can be kings of the hundred valleys because they excel at placing themselves below—[the rivers and seas, being lowly, draw all streams to them; just as the people turn toward their king. *Xia* (下) read as departing tone]. Thus they become kings of the hundred valleys—[by being lowly, they become kings of the hundred valleys].\n\nTherefore, the sage who wishes to be above the people [desires to stand over the people] must speak humbly to them—[emulating the rivers and seas in modesty. *Xia* (下) read as departing tone]. The sage who wishes to lead the people [desires to stand before the people] must place their own person behind—[putting others first and themselves last].\n\nThus, when the sage stands above, the people do not feel burdened—[the sage, though ruler over the people, does not lord their exalted position over them, so the people bear them without feeling weighed down]. When the sage stands before, the people do not feel harmed—[the sage, though ahead of the people, does not obscure those behind with brilliance; the people cherish them like parents, without any thought of harm].\n\nTherefore, the world delights in exalting them without wearying—[the sage’s kindness runs deep and love is profound; they regard the people as their own children, so the world joyfully elevates them as ruler without tiring. *Yan* (厌) read as departing tone]. Because they do not contend—[the world’s lack of weariness toward the sage arises from their refusal to vie for precedence]. Thus, none in the world can contend with them—[it is said that all are without striving, and none can compete with one who practices non-contention].\n\n*Chapter Sixty-Seven: \"The Three Treasures\"*\nThe world all calls me great, yet I seem unworthy—[Laozi says: the world calls my virtue great, but I feign foolishness, appearing unworthy]. Only because I am great do I seem unworthy—[only one whose virtue is truly great would, to avoid harm to themselves, feign foolishness, appearing as if unworthy, without discrimination or division, not demeaning others while exalting themselves]. If I were worthy, it would have been so long ago—[*Xiao* (肖) means \"good,\" referring to discernment and wisdom].",
      "overlap_context": " the state is to share the virtue of Heaven].\n\nProfound virtue runs deep and far—[the person of profound virtue is unfathomable and boundless]. They move contrary to things—[the person of profound virtue differs from the myriad things; while things seek to benefit themselves, profound virtue bestows upon others]. Thus they attain great harmony—[profound virtue, moving contrary to things, achieves great harmony, aligning with the principles of Heaven].\n\n*Chapter Sixty-Six: \"Putting Others First\"*",
      "start_char": 22073,
      "end_char": 22421,
      "start_sentence": 893,
      "end_sentence": 903,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.8027982711792,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 44,
      "original_text": "若夫辨惠之人身高自贵行察察之政所从来久矣 】其细【言辨惠者唯如小人也 非长者】夫我有三宝持而宝之【老子言我有三宝抱持而保倚】一曰慈【爱百姓若赤子】二曰俭【赋敛若取之于己也 】三曰不敢为天下先【执谦退不敢倡始也 】慈故能勇【以为仁故能勇于忠孝也 】俭故能广【天子身能节俭故民日用广矣 】不敢为天下先【不为天下首先】故能成器长【成器长谓得道人也 我能为道人之长也 ○长上声】今舍慈且勇【今世人舍慈仁但为勇武也 】舍俭且广【舍其俭约但为奢泰】舍后且先【舍其后己但为人先】死矣 【所行如此动入死地】夫慈以战则胜以守则固【夫慈仁者百姓亲附并心一意故以战则胜敌以守卫则坚固】天将救之以慈卫之【天将救助善人必与慈仁之性使能自当助也 】 配天第六十八 善为士者不武【言贵道德不好武力】善战者不怒【善以道战者禁邪于胸心绝祸于未萌无所诛怒也】善胜战者不与【善以道胜敌者附近以仁来远以德不与敌争而敌自服也】善用人者为下【善用人自辅佐者常为人执谦下也】是谓不争之德【谓上为之下也是乃不与人争之道德也】是谓用人之力【能身为人下是谓用人臣之力】是谓配天【能行此者德配天也】古之极【是乃古之极要道也】 用第六十九 用兵有言【陈用兵之道老子疾时用兵故托巳设其义也 】吾不敢为主【主先也 不敢先举兵】而为客【客者和而不倡用兵当承天而后动】不敢进寸而退尺【侵人境界利人财宝为进闭门守城为退】是谓行无行【彼遂不止为天下贼虽行诛之不行诛也 ○无行音杭】攘无臂【虽欲大怒若无臂可攘也 ○攘音禳】仍无敌【虽欲仍引之心若无敌可仍也 】执无兵【虽欲执持之若无兵刃可持用也 何者伤彼之民罹罪于天遭不道之君愍忍防之痛也 】祸莫大于轻敌【夫祸乱之害莫大于欺轻敌家侵取不休轻战贪财】轻敌几防吾宝【几近也 宝身也 欺轻敌者近防身也 ○几音祈音机】故抗兵相加【两敌战也 】哀者胜矣 【哀者慈仁士卒不远于死】 知难第七十",
      "translated_text": "Now, as for those of discerning wisdom—elevating themselves in pride, they enact policies of meticulous scrutiny. Such has been the way for ages. How petty they are! Such discerning wisdom is but the way of the petty man, not the noble one.\n\nI possess three treasures, which I hold and cherish:\nThe first is called *compassion*—loving the people as one’s own child.\nThe second is called *frugality*—levying taxes as if taking from oneself.\nThe third is called *not daring to take precedence in the world*—embracing humility and refraining from initiating action.\n\nThrough compassion, one can be courageous—for the sake of benevolence, one can be brave in loyalty and filial piety.\nThrough frugality, one can be expansive—when the Son of Heaven practices restraint, the people’s daily lives flourish.\nThrough not daring to take precedence, one can become the leader of those who attain the Way—for not striving to be first allows one to become the elder of those who perfect their vessels.\n\nYet today, people abandon compassion and pursue mere valor; they forsake frugality and indulge in extravagance; they relinquish deference and rush to be first. This is the path to death.\n\nFor one who employs compassion in battle, victory is assured; in defense, it ensures firmness. When the people are united in heart and devotion, war brings triumph, and defense becomes unassailable. Heaven will save such a one, shielding them with compassion.\n\n*Chapter Sixty-Eight: \"Matching Heaven\"*\nOne who excels as a warrior does not rely on force.\nOne who excels in battle does not succumb to anger.\nOne who excels in victory does not engage in conflict—for they draw near with benevolence and reach afar with virtue, so that the enemy submits without contention.\nOne who excels in employing others places themselves below—this is called the virtue of non-contention, the power of utilizing others’ strength. Such is called *matching Heaven*, the ultimate principle of antiquity.\n\n*Chapter Sixty-Nine: \"The Subtle Use\"*\nIn the art of warfare, there is a saying:\n\"I dare not act as the host but rather as the guest\"—the host initiates, while the guest responds without provocation. In warfare, one should follow Heaven’s will before acting.\n\"I dare not advance an inch but retreat a foot\"—to encroach upon another’s land or covet their wealth is to advance; to close the gates and defend the city is to retreat.\nThis is called *marching without marching*—though they persist as brigands under Heaven, though one proceeds to punish them, it is as if no punishment is meted out.\nIt is called *repelling without arms*—though one may wish to rage, it is as if no arms are raised to strike.\nIt is called *pursuing without an enemy*—though one may wish to draw them in, it is as if no enemy is pursued.\nIt is called *grasping without weapons*—though one may wish to seize them, it is as if no blade is wielded. For how can one harm those who suffer under the sins of Heaven, who endure the cruelty of a tyrannical ruler?\n\nNo calamity is greater than underestimating the enemy—for to belittle them is to invite ceaseless invasion, reckless war, and insatiable greed. To underestimate the enemy is to draw near the peril of losing one’s treasure—one’s own life.\n\nThus, when opposing armies clash, it is the one who acts with sorrow who prevails—for the compassionate warrior does not send their soldiers heedlessly to death.\n\n*Chapter Seventy: \"Knowing Difficulty\"*",
      "overlap_context": "he world all calls me great, yet I seem unworthy—[Laozi says: the world calls my virtue great, but I feign foolishness, appearing unworthy]. Only because I am great do I seem unworthy—[only one whose virtue is truly great would, to avoid harm to themselves, feign foolishness, appearing as if unworthy, without discrimination or division, not demeaning others while exalting themselves]. If I were worthy, it would have been so long ago—[*Xiao* (肖) means \"good,\" referring to discernment and wisdom].",
      "start_char": 22421,
      "end_char": 23189,
      "start_sentence": 904,
      "end_sentence": 932,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.80927801132202,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 45,
      "original_text": "吾言甚易知甚易行【老子言吾所言省而易知约而易行○易并去声】天下莫能知莫能行【人恶柔弱好刚强也】言有宗事有君【我所言有宗祖根本事有君臣上下世人不知者非我之无德不与我反】夫唯无知是以不我知【夫唯圣人也是我德之暗不见于外穷极微妙故无知也】知我者希则我者贵【希少也惟达道者乃能知我故为贵也】是以圣人被褐怀玉【被褐者薄外懐玉者厚内匿宝藏懐不以示人也○褐音曷】 知病第七十一 知不知上【知道言不知是乃德之上】不知知病【不知道言知是德之病】夫唯病病是以不病【夫唯能病苦众人有强知之病是以不自病也】圣人不病以其病病【圣人无此强知之病者以其常苦众人有此病】是以不病【以此非人也故不自病夫圣人懐通达之知托于不知者欲使天下质朴忠正各守纯性小人不知道意而妄行强知之争以自显着内伤精神减寿消年也】 爱己第七十二 民不畏威大威至矣",
      "translated_text": "My words are most easy to know, most easy to practice—yet none in the world can know them, none can practice them. Words have their root, affairs have their lord; it is only through ignorance that men do not understand me. Precisely because they are ignorant, they fail to know me. Those who know me are rare, and thus I am esteemed. Therefore the sage wears coarse cloth while holding jade within.\n\n*Chapter Seventy-One: \"Knowing Illness\"*\nTo know that one does not know is highest; not to know yet claim to know is an illness. Only by recognizing this illness as an illness can one avoid illness. The sage is not ill because he recognizes this illness as an illness—thus he is not ill.\n\n*Chapter Seventy-Two: \"Cherishing the Self\"*\nWhen the people do not fear authority, great authority is about to arrive.",
      "overlap_context": " of Heaven, who endure the cruelty of a tyrannical ruler?\n\nNo calamity is greater than underestimating the enemy—for to belittle them is to invite ceaseless invasion, reckless war, and insatiable greed. To underestimate the enemy is to draw near the peril of losing one’s treasure—one’s own life.\n\nThus, when opposing armies clash, it is the one who acts with sorrow who prevails—for the compassionate warrior does not send their soldiers heedlessly to death.\n\n*Chapter Seventy: \"Knowing Difficulty\"*",
      "start_char": 23189,
      "end_char": 23550,
      "start_sentence": 933,
      "end_sentence": 937,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.563713788986206,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 46,
      "original_text": "【威害也 人不畏小害则大害至谓死亡也 畏之者当爱精神承天顺地也 】无狭其所居【谓心居神当宽柔不当急狭也 】无厌其所生【人所以生者为有精神托空虚喜清净饮食不节忽道念色邪僻满腹为伐本献神○厌去声】　唯不厌是以不厌【夫唯独不厌精神之人洗心濯垢恬泊无欲则精神居之不厌也 】是以圣人自知【自知己之得失】不自见【不自显见德美于外藏之于内○见音现】自爱【自爱其身以保精气也 】不自贵【不自贵高荣名于世】故去彼取此【去彼自见自贵取此自知自爱○去上声】 任为第七十三 勇于敢则杀【勇敢有为即杀身也 】勇于不敢则活【勇于不敢冇为则活其身】此两者【谓敢与不敢也 】或利或害【活身为利杀身为害】天之所恶【恶有为也 ○恶去声】孰知其故【谁能知天意之故而不犯】是以圣人犹难之【言圣人之明德犹难于勇敢况无圣人之德而欲行之乎 ○难去声】天之道不争而善胜【天不与人争贵贱而人自畏之】不言而善应【天不言万物自动应以时】不召而自来【天不呼召万物皆负阴而向阳】繟然而善谋【繟宽也 天道虽宽博善谋虑人事修善行恶各蒙其报也 ○繟音阐】天恢恢疎而不失【天所网罗恢恢甚大虽疎远司察人善恶无有所失】 制惑第七十四 民不畏死【治国者刑罚酷深民不聊生故不畏死也 治身者嗜欲伤神贪财杀身民不知畏之也 】奈何以死惧之【人君不宽刑罚教民去情欲奈何设刑法以死惧之】若使民常畏死【当除巳之所残克教民去利欲也 】而为奇者吾得执而杀之孰敢【以道教化而民不从反为奇巧乃应王法执而杀之谁敢冇犯者老子伤时王不先道德化之而先刑罚】常有司杀者【司杀者天居高临下司察人过天网恢恢踈而不失也 】夫代司杀者是谓代大匠斫【天道至明司杀者常犹春生夏长秋冬藏斗杓运移以节度行之人君欲代杀之是犹拙夫代大匠斫木劳而无功也 ○斫音卓】夫代大匠斫者希有不伤手者矣 【人君行刑罚犹拙人代大匠斫则方圆不得其理还自伤代天杀者失纪纲不得其纪纲还受其殃也 】 贪损第七十五",
      "translated_text": "*Chapter Seventy-Two: \"Cherishing the Self\" (continued)*\nFor authority is harm—when people do not fear minor harm, great harm arrives, meaning death. Those who fear it should cherish their spirit, aligning with Heaven and Earth.\n\nDo not constrict where the mind dwells—by this is meant that the heart’s dwelling in the spirit should be broad and gentle, not tense and narrow. Do not weary of that which gives life. What gives life to people is the spirit, which abides in emptiness and delights in purity and stillness. Gluttony, neglect of the Dao, indulgence in sensual desires, and perverse excesses fill the belly and strike at the root, offering the spirit as sacrifice. *(厌: pronounced \"yan\")*\n\nOnly by not wearying of the spirit does one avoid weariness. Precisely because one alone does not weary of the spirit—washing the heart and cleansing its filth, abiding in tranquility without desire—the spirit dwells within without weariness.\n\nThus the sage knows himself—knows his own gains and losses—yet does not display himself, concealing his virtue and beauty within. *(见: pronounced \"xian\")* He cherishes himself, preserving his essence and qi, yet does not exalt himself, nor does he seek lofty fame in the world. Therefore he discards that and embraces this—discarding self-display and self-exaltation, embracing self-knowledge and self-cherishing. *(去: pronounced \"qu\")*\n\n*Chapter Seventy-Three: \"Venturing Action\"*\nTo be brave in daring is to invite death; to be brave in restraint is to preserve life. These two—daring and restraint—bring either benefit or harm. What Heaven abhors—who knows the reason? *(恶: pronounced \"wu\")* Thus even the sage finds it difficult. *(难: pronounced \"nan\")*\n\nThe Way of Heaven does not contend yet excels at victory; it does not speak yet excels at response. It does not summon yet things come of themselves. Vast and unhurried, it excels at planning. *(繟: pronounced \"chan\")* Heaven’s net is vast and wide, seemingly loose yet never missing its mark.\n\n*Chapter Seventy-Four: \"Restraining Delusion\"*\nWhen the people do not fear death—whether the ruler’s punishments are cruel and deep, leaving no means of livelihood, or the body’s desires injure the spirit and greed for wealth destroys life—how can death be used to frighten them? If the people were made to constantly fear death, then those who act perversely, I would seize and execute—who would dare? There is always one who governs killing.\n\nTo take the place of the one who governs killing is to take the place of the great craftsman in hewing wood. *(斫: pronounced \"zhuo\")* Those who take the place of the great craftsman in hewing rarely avoid injuring their own hands.\n\n*Chapter Seventy-Five: \"Greed and Loss\"*",
      "overlap_context": ", and thus I am esteemed. Therefore the sage wears coarse cloth while holding jade within.\n\n*Chapter Seventy-One: \"Knowing Illness\"*\nTo know that one does not know is highest; not to know yet claim to know is an illness. Only by recognizing this illness as an illness can one avoid illness. The sage is not ill because he recognizes this illness as an illness—thus he is not ill.\n\n*Chapter Seventy-Two: \"Cherishing the Self\"*\nWhen the people do not fear authority, great authority is about to arrive.",
      "start_char": 23550,
      "end_char": 24326,
      "start_sentence": 938,
      "end_sentence": 962,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.108494520187378,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 47,
      "original_text": "民之饥以其上食税之多【人民所以饥深者以其君上税食下太多】是以饥【民皆化上为矣叛道违德故饥】民之难治以其上之有为【民之不可治者以其君上多欲好有为也】是以难治【是以其民化上有为情伪难治】民之轻死以其求生之厚【人民轻犯死者以其求生活之道太厚贪利以自危】是以轻死【以求生太厚之故轻入死地也】夫唯无以生为者是贤于贵生【夫唯独无以生为务者爵禄不干于意财利不入于身天子不得臣诸侯不得使则贤于贵生也】 戒强第七十六 人之生也柔弱【人生含和气抱精神故柔弱也】其死也坚强【人死和气竭精神亡故坚强也○强上声旧平声】万物草木之生也柔脆【和气存也】其死也枯槁【和气去也】故坚强者死之徒柔弱者生之徒【以其上二事观之知坚强者死柔弱者生也】是以兵强则不胜【强大之兵轻战乐杀毒流怨结众弱为一强故不胜】木强则共【木强大枝弱共生其上也】强大处下柔弱处上【兴物造功大木处下小物处上大道抑强扶弱自然之效】 天道第七十七 天之道其犹张弓乎",
      "translated_text": "People suffer famine because their superiors consume too much in taxes—this is why they starve. The people are thus reduced to hunger.\n\nThe people are difficult to govern because their superiors act with excessive intervention—this is why they are difficult to govern.\n\nThe people treat death lightly because they pursue life’s comforts too lavishly—this is why they treat death lightly.\n\nOnly those who do not make life’s preservation their primary concern are wiser than those who prize life.\n\n*Chapter Seventy-Six: \"Against Strength\"*\nWhen people are alive, they are supple and weak; when they die, they become rigid and strong. All things—plants and trees—are soft and fragile in life, but dry and withered in death. Thus, the rigid and strong belong to the ranks of death, while the supple and weak belong to the ranks of life.\n\nTherefore, when an army is strong, it will not prevail. When a tree is strong, it invites the axe. The strong and great occupy the lower position, while the soft and weak rise above.\n\n*Chapter Seventy-Seven: \"The Way of Heaven\"*\nIs not the Way of Heaven like the drawing of a bow?",
      "overlap_context": "r wealth destroys life—how can death be used to frighten them? If the people were made to constantly fear death, then those who act perversely, I would seize and execute—who would dare? There is always one who governs killing.\n\nTo take the place of the one who governs killing is to take the place of the great craftsman in hewing wood. *(斫: pronounced \"zhuo\")* Those who take the place of the great craftsman in hewing rarely avoid injuring their own hands.\n\n*Chapter Seventy-Five: \"Greed and Loss\"*",
      "start_char": 24326,
      "end_char": 24733,
      "start_sentence": 963,
      "end_sentence": 967,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.08547830581665,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 48,
      "original_text": "【天道暗昧举物以为喻也 】高者抑之下者举之有余者损之不足者与之【言张弓和调之如是乃可用夫抑高举下损强益弱天之道也 】天之道损有余而不足【天道损有余而益谦常以中和为上】人之道则不然【人道则与天道反也 】损不足以奉有余【世俗之人损贫以奉富夺弱以益强也 】孰能有余以奉天下唯有道者【言谁能居有余之位自省爵禄以奉天下不足者乎 唯有道之君能行也 】是以圣人为而不恃【圣人为德施不恃其报也 】功成而不处【功成事就不处其位】其不欲见贤【不欲使人知己之贤匿功不居荣畏天损有余也 】 任信第七十八",
      "translated_text": "The Way of Heaven is obscure and subtle—thus it takes the drawing of a bow as its metaphor. What is high it presses downward; what is low it lifts upward. What has surplus it diminishes; what is deficient it replenishes. Only when the bow is drawn in such balanced harmony can it be put to use. For to press down the high, lift up the low, diminish the strong, and augment the weak—this is the Way of Heaven.\n\nThe Way of Heaven diminishes surplus to supply what is lacking, ever holding harmony and equilibrium as supreme. The way of man, however, is not so: it diminishes the deficient to serve the surplus. The common world takes from the poor to enrich the wealthy, seizes from the weak to strengthen the powerful.\n\nWho, then, can hold surplus and offer it to all under Heaven? Only one who embodies the Way. Thus the sage acts yet does not rely on reward; accomplishes yet does not dwell in achievement. He does not wish his worthiness to be seen, concealing his merit and refusing honor, ever wary of Heaven’s law to diminish surplus.\n\n*Chapter Seventy-Eight: \"Embracing Trust\"*",
      "overlap_context": "rigid and strong. All things—plants and trees—are soft and fragile in life, but dry and withered in death. Thus, the rigid and strong belong to the ranks of death, while the supple and weak belong to the ranks of life.\n\nTherefore, when an army is strong, it will not prevail. When a tree is strong, it invites the axe. The strong and great occupy the lower position, while the soft and weak rise above.\n\n*Chapter Seventy-Seven: \"The Way of Heaven\"*\nIs not the Way of Heaven like the drawing of a bow?",
      "start_char": 24733,
      "end_char": 24969,
      "start_sentence": 968,
      "end_sentence": 977,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.355175971984863,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 49,
      "original_text": "天下柔弱莫过于水【圆中则圆方中则方拥之则止决之则行】而攻坚强者莫知能胜【水能懐山襄陵磨铁消铜莫能胜水而成功也 】其无以易之【夫攻坚强者无以易于水○易入声】弱之胜强【水能灭火阴能消阳】柔之胜刚【舌柔齿刚齿先舌亡】天下莫不知【知柔弱者长久刚强者折伤也 】莫能行【耻谦卑好强梁】故圣人云【谓下事也 】受国之垢是谓社稷主【君能受国垢浊者若江海不逆小流则能长保其社稷为一国君主也 ○垢音苟】受国之不祥是谓天下王【君能引过自与代民受不祥之殃则可以王有天下】正言若反【此乃正直之言世人不知以为反言】 任契第七十九 和大怨【杀人者死伤人者刑以相和报】必有余怨【任刑者失人情必冇怨及于良人也】安可以为善【言一人吁嗟则失天心安可以和怨为善也】是以圣人执左契【古者圣人执左契合符信也无文书法律刻契合符以为信也】而不责于人【但刻契之信不责人以他事也】有德司契【有德之君司察契信而已】无德司彻【无德之君背其契信司人所失】天道无亲常与善人【天道无有亲疎唯与善人则与司契者也】 独立第八十 小国寡民【圣人虽治大国犹以为小俭约不奢防民虽众犹若寡少不敢劳之也 】使有什伯【使民各有部曲什伯贵贱不相犯也 】人之器而不用【器谓农人之器而不用不征召夺人良时也 】使民重死【君能为民兴利除害各得其所则民重死而贪生也 】而不远徙【政令不烦则安其业故不远迁徙离其常处】虽有舟舆无所乘之【清净无为不作烦华不好出入游娱也 】虽有甲兵无所陈之【无怨恶于天下】使民复结绳而用之【去文反质信无欺也 】甘其食【甘其蔬食不渔食百姓也 】美其服【美其恶衣不贵五色】安其居【安其茅茨不好文饰之屋】乐其俗【乐其质朴之俗不转移也 ○乐音洛】邻国相望鸡狗之声相闻【相去近也 】民至老死不相徃来【其无情欲】 显质第八十一 信言不美【信者如其实不美者朴且质也 】美言不信【滋美之言者孳孳华词不信者饰伪多空虚也 】善者不辩【善者以道修身不防文也 】辩者不善【辩者谓巧言也 不善者舌致患也 山冇玉掘其山水有珠浊其渊辩口多言亡其身】知者不博【知者谓知道之士不博者守一元也 】博者不知【博者多见闻不知者失要真也 】圣人不积【圣人积德不积财有德以教愚有财以与贫也 】既以为人巳愈有【既以为人施设德化己愈冇德】既以与人己愈多【既以财贿布施与人而财益多如日月之光无有尽时也 】天之道利而不害【天生万物爱育之令长大无所伤害也 】圣人之道为而不争【圣人法天所施为化成事就不与下争功名故能全其圣功也 】 老子德经卷终",
      "translated_text": "The world holds nothing more yielding and weak than water—round when in a round vessel, square when in a square, still when embraced, flowing when released—yet nothing surpasses it in overcoming the hard and strong. There is no substitute for it. The weak overcomes the strong; the soft overcomes the hard. None under Heaven fails to know this, yet none can practice it. Thus the sage declares: \"One who bears the nation’s disgrace is called the lord of the altars of soil and grain; one who bears the nation’s misfortune is called the king of all under Heaven.\" Straightforward words seem contrary.\n\n*Chapter Seventy-Nine: \"Holding the Contract\"*\nTo reconcile great grievances, there must remain residual resentment. How can this be deemed good? Therefore the sage holds the left half of the contract but does not demand from others. The virtuous govern by the contract; the unvirtuous govern by exactions. The Way of Heaven shows no partiality, yet it ever aligns with the good.\n\n*Chapter Eighty: \"Standing Alone\"*\nLet the state be small, its people few. Though there be tools for ten or a hundred men, let them not be used. Let the people regard death as weighty and not wander far. Though there be boats and carriages, none will ride them; though there be armor and weapons, none will display them. Let the people return to knotting cords for record-keeping. Let them relish their food, delight in their clothing, find peace in their dwellings, and rejoice in their customs. Neighboring states may gaze upon one another, the sounds of their dogs and roosters heard across the border, yet the people will grow old and die without ever traveling between them.\n\n*Chapter Eighty-One: \"Manifesting Simplicity\"*\nTruthful words are not fine; fine words are not truthful. The good do not dispute; the disputatious are not good. The wise are not broadly learned; the broadly learned are not wise. The sage does not accumulate: having bestowed all upon others, he possesses even more; having given all to others, he has even greater abundance. The Way of Heaven benefits and does not harm; the Way of the sage acts and does not contend. Thus ends the *Virtue Classic* of Laozi.",
      "overlap_context": "ent to serve the surplus. The common world takes from the poor to enrich the wealthy, seizes from the weak to strengthen the powerful.\n\nWho, then, can hold surplus and offer it to all under Heaven? Only one who embodies the Way. Thus the sage acts yet does not rely on reward; accomplishes yet does not dwell in achievement. He does not wish his worthiness to be seen, concealing his merit and refusing honor, ever wary of Heaven’s law to diminish surplus.\n\n*Chapter Seventy-Eight: \"Embracing Trust\"*",
      "start_char": 24969,
      "end_char": 25986,
      "start_sentence": 978,
      "end_sentence": 1009,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.812385082244873,
      "metadata": {
        "source_file": "dao\\藏外\\老子道德经（河上公撰）.txt",
        "category": "藏外"
      }
    }
  ]
}