{
  "source_id": "老君音诵戒经",
  "source_file": "chunked_daozang\\老君音诵戒经.json",
  "total_chunks": 11,
  "total_original_chars": 8741,
  "total_translated_chars": 55609,
  "total_translation_time": 278.66422724723816,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\戒律类\\老君音诵戒经.txt",
    "category": "戒律类"
  },
  "full_translation": "**The Scripture of the Venerable Lord’s Chanted Admonitions**\n\n**Scripture Title:** *The Scripture of the Venerable Lord’s Chanted Admonitions*. Also known as *The Admonitions of the New Scale Chanted in the Clouds*.\n\nIn the second year of Shenduan during the Northern Wei dynasty, the Daoist Kou Qianzhi of Mount Song falsely claimed to have received this scripture through a revelation from the Most High Venerable Lord. According to the *Wei Shu: Treatise on Buddhism and Daoism*, the original text comprised twenty scrolls, of which only one remains. The present edition is derived from the *Daoist Canon of the Zhengtong Era*, under the category of Precepts and Disciplines in the *Dongshen* section.\n\n---\n\nThe Venerable Lord spoke:\nThe Way that is vexed does not arrive; the Way that arrives is not vexed. Follow this in cultivation, and all Daoist officials, male and female disciples, upon hearing my chanted precepts and statutes, shall awaken in their hearts. Gather the people and fellow practitioners, inscribe my admonitions and statutes into a single document, and present it in memorial to receive the precepts. Be diligent and cautious in upholding them as decreed.\n\nThe Venerable Lord spoke:\nWhen Daoist officials and registered disciples first receive the precepts and statutes, they shall bow eight times toward the scripture of admonitions, stand upright before it, and—whether master or companion—hold the scripture to perform the Eightfold Offering of Music. Those who chant and receive the precepts shall prostrate themselves, recite the scripture’s meaning to its conclusion, and then bow eight times to conclude. If one does not understand the chanted recitation, a straightforward reading shall suffice. The precepts and statutes are to be mutually affirmed by two parties. Always maintain reverence and care. When transmitting them to fellow practitioners or disciples, follow the proper method and uphold them diligently as decreed.\n\nThe Venerable Lord spoke:\nDaoist officials and registered disciples must not copy scriptures or precepts carelessly. To add or omit even a single character is forbidden; such errors may not be excerpted. If one transcribes the precepts onto two or three sheets without including the opening section, rendering the statutes incomplete, calamity shall befall the transgressor. These statutes and admonitions shall be overseen by officials of canonical affairs, who shall supervise their observance in accordance with the scripture’s precepts. Be diligent and cautious in upholding them as decreed.\n\nThe Venerable Lord spoke:\nIn the first year of Han’an, I transmitted the Dao to Zhang Ling, establishing him as the Celestial Master to assist the state and sustain the mandate. Ling, seeing the hardships of the world, deemed it unfit for a thousand-year lord and begged to ascend to heaven. I then urged Ling to refine his resolve, bestowed upon him the elixir of ascension, and the hundred-times-distilled wine. Thus, Ling ascended upon clouds, entering the celestial palace. Since Ling’s ascension, the office of the Celestial Master has been vacant for too long. I commanded the true officials of all prefectures, commanderies, and counties to govern ghostly affairs with their infused *qi*, register the households of the living, and cease employing living persons as Libationers to govern the people—a method that has led to corruption and disorder.\n\nYet later Daoist officials and Libationers, ignorant and blindly transmitting the teachings, have falsely assumed the authority to administer registers and talismans, distorting scriptural methods and polluting the pure and true. They claim there are three hundred and sixty talismanic decrees enabling immortality, conjuring myriad spirits to confuse the people. They confer ranks and registers upon others in exchange for gold, silver, and wealth, and govern households with threats and coercion, compelling offerings of silk, cattle, slaves, clothing, or annual tributes of a bolt of silk or an ounce of silk floss. The abuses are too numerous to recount.\n\nThey falsely propagate the Yellow and Red Chamber arts transmitted by Zhang Ling, teaching them to husbands and wives, spreading licentious practices that disgrace the Daoist teachings. Some Libationer officials claim that upon a father’s death, the son inherits his position, further corrupting the Dao. Yet the truth is: the Dao is revered and virtue is noble; only the worthy are to be entrusted. If a son is unworthy, how can he inherit his father’s legacy? Some Libationer officials, their sons unworthy, act perversely, defying principles and disordering the Dao—how can they rightfully inherit the lineage? The opening of the iron charter states, “Upon the father’s death, the son succeeds”—this is merely the law of secular rulers. I have not yet established a Celestial Master on earth, yet Daoist officials, blindly transmitting the teachings, have presumptuously assumed the authority to administer registers. All Daoist officials and Libationers must select the worthy and enlightened for transmission. Cease the practice of sons inheriting their fathers’ positions, lest the Daoist teachings remain obscure. I declare: even if I were to die, my descendants would not inherit the position of Celestial Master after me. The Way of Heaven is impartial; only the worthy are entrusted. Be diligent and cautious in upholding this as decreed.\n\nThe Venerable Lord spoke:\nI received a memorial from the assembled immortals and officials presiding over the sacred land of Mount Song, stating: “The people of the world have long been without proper governance. Those who cultivate goodness and seek blessings through precepts follow fraudulent and deceptive scriptures, their practices yielding no results. They long for the teachings of a true and worthy orthodox method. It is fitting to establish the position of Celestial Master on earth as a model.”\n\nNow there is Kou Qianzhi of Shanggu, who has secluded himself to study on Mount Song’s Shaoshi Peak. He has refined the teachings, grasped the nature of humans and spirits, embodied the principles in his conduct, and aligned his actions with spontaneity—though not yet worthy of the Celestial Master’s position. Thus, I journeyed east to observe him in person. Do you know this? My destined time has not yet come; I should not have appeared in the world. Qianzhi, you shall assume the position of Celestial Master, teach the people, assist the state, sustain the mandate, and diligently govern the Daoist methods. Sever all ties to the Yellow and Red practices. As for the various officials and Libationers who examine registers and talismans, extort gold, silver, and wealth, and demand miscellaneous offerings and vows—all such abuses shall be prohibited. Follow only my new method of chanting and reciting the precepts. The fraudulent scriptures and statutes shall no longer be observed.\n\nQianzhi received the precepts and, after two nights and three days, delved into the hidden depths of the matter. The Venerable Lord summoned him, and Qianzhi addressed him: “I am benighted and unworthy, lacking the wisdom to advance. Without the elixir of long life or the power to command spirits, how can I transform evil into good, dispel disasters, and subdue anomalies to serve as a model? I humbly beseech your compassion, grant me life, and await the time of your manifestation in the world. Only when the divine elixir responds and the *qi* of the Dao enters my body shall I dare to assume the position of Celestial Master. I record my earnest plea.”\n\nThe Venerable Lord spoke:\n“I appoint you to govern the inner and outer offices of the celestial bureaucracy, presiding over the true duties, equal in rank to the Celestial Master.”\n\nI permit you to voice your modest refusal once more.\n\nThis teaching of mine through joyous sound is true and sincere. Since the single correct transformation of Heaven and Earth, it has not been revealed to the world. Now, as the cyclical destiny demands its emergence, you must diligently instruct and establish the precepts and statutes, guiding both the ordained and the laity, and the *jijiu* shall implement them accordingly. After they uphold and submit to these sincere covenants, I shall command the true officials of the lands within the Nine Provinces and the Four Seas to ascend the registers and report the households.\n\nThose *jijiu* and Daoist followers who uphold the law with merit shall then be selected among the seed people of the Central Realm, their names recorded in the Hall of Literary Prosperity. If any Daoist officials or *jijiu* are remiss in teaching and transformation, neglecting the arts of nurturing life, and encounter uncertainties they cannot resolve, you shall decide for them, clarifying the proper observance to be followed as decreed.\n\nThe Most High Lord Lao’s Decree of Joyous Sound and Sincere Instruction states:\n\nIn this present age, evildoers abound: fathers lack compassion, children lack filial piety, ministers lack loyalty. The cyclical destiny ordains that pestilence and poison shall descend upon them, and the wicked shall perish utterly. Thus, I withdrew far away to the Kunlun Mountains. In the world below, the wicked prey upon one another, and the dead are countless. Among them, the innocent and virtuous suffer unjustly, and I pity their hardship. From time to time, I cross eastward to shelter the good.\n\nThe true spirits of the lands within the Nine Provinces and the Four Seas, along with the officials of the Five Peaks, have all assembled to report on the virtues and deviations of their domains, recounting the facts. They declare that in this age, people commit deeds that lead to death, while those who cultivate goodness are few. Deceit and falsehood pervade the world, distorting the classics and the Dao, deluding the foolish masses. They claim that Lord Lao shall govern, that Li Hong shall appear, and that the realm shall be thrown into chaos, with rebels abounding. Every year, some claim the name Li Hong, and among them, spirits and ghosts manifest in broad daylight, deceiving the people with their spectral words. The foolish believe them, spreading countless lies, assuming titles and ranks, gathering crowds like ants, and disrupting the lands. Those who call themselves Liu Ju are many, and those who claim to be Li Hong are no fewer. I am enraged! How can there be so many who invoke my name for such evil? How can the people of this world be so foolish and deluded?\n\nMy abode is on Kunlun Mountain, where terraces, pavilions, towers, halls, and palaces stand in succession. Treasures of gold and silver, myriad fragrant woods, and intricate adornments fill the place. Orchids and cassia trees grow there, and rare beasts roam freely. Phoenixes and flocks of birds nest in the trees, while divine dragons and qilin serve as my livestock. Immortals and jade maidens gather there in abundance. When I wish to travel, I ride clouds and mount dragons, traversing ten thousand *li* in a breath. The people of Heaven and Earth, ghosts and spirits, are all subject to my command. Why would I desire to be the ruler of a single city on earth? I have no such wish!\n\nWhen the time comes for my manifestation, I shall transform Heaven and Earth, abolishing the old classics and ancient laws, and establish a new order. Those destined for long life shall be granted the divine elixir, ascending as immortals to transcend the world and remain by my side. The wicked who turn to goodness and encounter me shall all have their years extended. If kings and emperors govern the people with merit, they shall continue to rule as before. If they govern unlawfully, the enlightened shall replace them. After the people are pacified and order is restored, they shall ascend to dwell on Kunlun.\n\nWhen I emerge, I shall ride a chariot drawn by nine dragons, each adorned with multicolored, coin-spotted patterns. The chariot shall bear a feathered canopy with twelve projections, crafted from sandalwood and catalpa, embellished with gold, silver, pearls, and jade, along with rare and wondrous ornaments too numerous to name. I shall summon the true officials of the world, the wind and rain masters of the seas and mountains, and command the myriad ghosts. I shall overturn the celestial net, contract the earth’s veins, and turn Heaven and Earth as easily as I turn my own body. I shall grasp the sun and moon, causing the world to darken by day. Immortals and jade maidens shall ride in carriages beside me, while bells, drums, and music fill the void. The true disciples and beasts, phoenixes and flocks of birds, shall soar above. Heaven and Earth shall move, and the hosts of people and ghostly soldiers shall stretch boundlessly. All who behold my majestic radiance shall prostrate themselves before me!\n\nYet the foolish deceive without end, each desiring to rebel, gathering fugitives, criminals, slaves, and servants, falsely claiming to be Li Hong. How could I, in my true form, descend into this foul, carnal realm of slaves, dogs, and malevolent spirits to associate with such wicked rebels? The people of this world are treacherous and deceitful, reciting false scriptures and corrupting the classics. How much have they wronged me? How grievously they harm one another! Is this not agonizing?\n\nI issue this decree of sincere instruction so that all people may know and hear it. Let them reflect deeply and strive to cultivate goodness. When their merit in cultivating goodness is complete, they may encounter the true and have their years extended. Be prudent and observe this as decreed.\n\nLord Lao said:\nWhen I first established the Celestial Master, I bestowed the registers, talismans, and contracts to govern the Daoist teachings. Did I ever institute a law to take even a single coin from the people? It is like appointing an official to a post—how much wealth might they possess? Now, I issue this new law to be followed and obeyed.\n\nFrom this day forward, there shall be no division of transmission, no vows of offering, no imitation of the registers of governance. Without wealth or silk, the households shall make their annual pledges, ensuring the sustenance of their kitchens and the prosperity of their families. For the myriad afflictions of men and women, illnesses and disasters, all offerings and vows made in kitchens shall cease. Only the storage of provisions shall be permitted, with one-third collected. The people may trade and calculate in the markets, and the gatherings at homes shall be dissolved, allowing them to seek the masters for governance instead.\n\nWhen the people suffer illness or their lives are imperiled, they need only maintain the incense and flame, and present their sincerity in written petitions. Thus, they may attain resonance. The households shall be permitted to offer thirty sheets of paper, one brush, and one stick of ink each year to support the work of drafting petitions and delivering salvation.\n\nIf any Daoist officials harbor impure intentions and do not follow the true teachings, the people may instead seek out masters who uphold the new statutes and the pure teachings.\n\nObserve and act with caution, as decreed by the statutes.\n\nThe Most High Lord Lao declares: After the merit of Libationer officials is transferred, their descendants, if pure, clear-minded, and adept in matters of spirits, may approach enlightened masters to receive appointment, register talismanic pledges, and inherit their fathers’ legacy.\n\nShould their descendants conduct themselves perversely, indistinguishable from the common folk, and disobey the statutes and covenants, all officials shall deliberate and jointly submit a memorial to the Heavenly Bureau, permitting the people to seek new masters.\n\nObserve and act with caution, as decreed by the statutes.\n\nThe Most High Lord Lao declares: If Daoist households possess altars, make vows, or prepare ritual utensils without consulting their masters, the masters shall immediately order their return, require the people to procure them from the market, and dissolve such gatherings.\n\nThe Most High Lord Lao’s recitation of the pledge states: Daoist households that do not practice the statutes and methods, fail to diligently maintain the incense and flame, dispel disasters, avert misfortunes, or address illnesses—yet still come and go with anxieties about officials, strange omens, or various phenomena—shall not be permitted to make protective vows.\n\nWhy is this so? If a household embraces the Dao seeking blessings, it is a misguided endeavor. Only after first submitting a petition may they proceed.\n\nFrom this day forward, if Daoist households seek to make vows, they must first prepare the utensils for the ritual feast and submit a petition. When gathering to establish and fulfill a vow, they shall seek but one matter above all, and the blessings received shall be without distraction. Let this be diligently observed as decreed.\n\nThe Most High Lord Lao declares: Daoist officials, upon receiving their appointments and administering talismans and registers, shall do so in accordance with each household’s means. If they wish to hold a ritual feast, the number of participants may be determined at will—three or more may gather, and those capable may do so repeatedly. The dishes and harmonious gatherings may be shared in common; if unable, there shall be no hardship. Let this be diligently observed as decreed.\n\nThe Most High Lord Lao declares: For ritual feasts, the highest observance requires seven days of fasting, the middle three days, and the lowest a single day of prior abstention. The fasting method: consume plain rice and vegetables for one day, consuming three *sheng* of rice. Abstain from the bedchamber, the five pungent vegetables, raw greens, and all meats. Cultivate diligent good conduct, remain within, and do not traverse where one ought not. When those in mourning, impurity, or recent childbirth wish to attend, they shall bow eight times before the incense and flame, and a person of great virtue and progress shall preside, preparing a fine rice platter at the head of the gathering, with each person having their own platter. Those who do not follow the Dao may be invited to the feast without hardship. Yet worldly fools, deeming their practices different, harbor contrary intentions, neglecting the fast and disdaining the statutes and methods. The host must seek reverence and solemnity, for within the gathering, anger and resentment shall have no place. From this day forward, officials shall adjudicate with discernment, contemplating the subtle essence. If there are those who, with unified hearts, seek blessings and vows, they may attend the feast without hardship. Upon returning home as the host, burn incense and pass the night in vigil, tending the incense flame thrice, and recite: *\"For the ritual feast held by the household of so-and-so, we dissolve and seek such-and-such a matter of grace and blessing, may we be enveloped in the protective qi of the Dao.\"* Let this be diligently observed as decreed.\n\nThe Most High Lord Lao declares: The method for ritual feasts prescribes three courses: first a light repast, then wine, and finally rice. In this age, many cannot prepare three courses, so wine may come first, with a limit of five *sheng*. Let this be diligently observed as decreed.\n\nThe Most High Lord Lao declares: When men and women receive registers and are appointed as officials, they present memorials to the celestial bureaucracy. Those who align with sincerity shall not be deluded by the myriad evils. They should understand themselves as living officials and servants—how could Daoist households deceive or transgress against those with such duties? Daoist officials perform sacrifices and aid, yet the ignorant and benighted transmit false traditions, self-appointing and administering registers, invoking and wearing the generals of the Thousand Divisions, along with their attendant soldiers, causing confusion. Such false invocations of soldiers for protection are entirely baseless. They may only perpetually wear the insignia of their appointed office. Those who commune with spirits and attain the Dao may encounter immortal officials. Those who receive registers and appointments shall not have five or three attendants or soldiers assigned to them. Yet worldly fools, imitating one another in self-appointment—how could there possibly be hundreds of thousands of layers of generals, soldiers, and guardians? From this day forward, all past practices in this regard shall cease and no longer be followed. Let this be diligently observed as decreed.\n\nThe Lord Lao said: When inviting guests to assemble, people should attire themselves with solemn dignity, as if attending an audience in the celestial palace of the Son of Heaven, all reverent and respectful together. Let this be diligently observed as decreed.\n\nThe Lord Lao said: Daoist followers serving their household masters shall do so as commoners serve officials, addressing themselves as \"Daoist followers.\" Let this be diligently observed as decreed.\n\nThe Lord Lao said: Those who receive registers of governance—sincere disciples—shall, in their morning and bowing audiences, conduct themselves with the same ritual propriety as officials and clerks in ceremonial attire, adhering equally to ritual and law. Let this be diligently observed as decreed.\n\nThe Lord Lao said: Daoist officials and libationers who confer registers of governance and office upon others shall impart only the Dao. After receiving and wearing these registers, if one fails to advance with diligence, violates precepts, breaches covenants, acts perversely, harbors malice, or engages in unlawful conduct, wandering among the people and reciting false precepts to deceive in myriad ways, such a one shall not be upheld in the world.\n\nAmong the households and followers of the Dao, when afflicted by illness, peril, or distress, those who rashly alter my Dao shall be corrected and healed. Foolish and witless, they recklessly shift and change, offering bundles of grain and firewood to household masters to treat illness, claiming recovery is certain—only to meet death instead. After death, their prior merits are transformed, and they revert to their original status as commoners.\n\nYet when the sick recover, they claim it as the grace and blessing of the Dao, proclaiming the Dao’s divine power and broadcasting it to the world. Upon hearing this, those who suffer misfortune or calamity turn to local officials for aid, while others change their affiliation and submit to conversion. Households gradually multiply, but the household libationers, in their perversity and inconsistency, act contrary to proper conduct—indulging in debauchery, theft, and killing, their nature deficient and their actions coercive and intimidating, peddling the divine and trafficking the Dao.\n\nSome falsely claim to have seen the Lord Lao, or feign inspiration, speaking as if by divine instruction, thereby sowing sighs and resentments among the people. Others, though they too serve household masters, ask, \"Why do we not compare to other masters?\" They demand reverence and worship, offering fleeting rectitude, then seek out the wise and enlightened, claiming the precepts and laws are too strict to transgress.\n\nSuch deceivers must be examined and restrained. The decline of fortune, the turn of misfortune, and the length of life are all predetermined—none can be prolonged by the machinations of foolish Daoist officials. Those who deceive and disrupt the Dao’s laws—if any such exist—shall be scrutinized by all officials.\n\nWhen gathering converted households for communal feasts, take their sworn statements, and let Daoist officials jointly submit memorials to permit households to change affiliation. Followers shall not rashly transfer or rebel on their own. Let this be diligently observed as decreed.\n\nThe Lord Lao said: I observe that among the world’s common and foolish, libationers who convert households and lead followers in submitting memorials present documents of refinement—some ten or five sheets, others three or two. Yet whether many or few, all lack coherence. Of the myriad memorials submitted, not one reaches its destination. How can this be?\n\nThe earthly true officials, those who oversee affairs, fear the chain of guilt and thus suppress, delay, or disobey. I now command that proclamations of sincerity be chanted and sung, and all officials be admonished. The method of memorials and documents should resemble those of living officials—only then can they reach their proper destination and be governed by reason.\n\nFoolish Daoist officials do not refine their memorials and petitions, nor do they seek out the bright and capable to study and practice the refined methods. Among the world’s Daoist officials, some compose twenty or thirty sheets for the deliverance of the deceased, weaving countless fine words about the matter. Yet this is not as good as cultivating reverent good conduct, fasting and refining the body, kindling incense and binding oneself in devotion, and establishing a hundred days of merit—all for the sake of the departed parents, to deliver and ascend their souls.\n\nMonthly single-sheet memorials reporting fasting merits surpass a thousand petitions for deliverance through starry rites. If fasting merits do not reach their mark, there can be no principle of resonance or penetration. First establish merit through fasting, then submit petitions for deliverance—without any extraneous items like rice, silk, paper, or brushes. The most ancient assemblies of the worthy were simply for burning incense and redeeming the dead; the highest way does not require deliverance through stars.\n\nWhat is troublesome does not reach the Dao; what reaches the Dao is not troublesome. From now on, reflect upon and recite these admonitions. Let this be diligently observed as decreed.\n\nLord Lao said: For Daoist officials, register initiates, and lay men and women, the method of burning incense to make vows is as follows: Enter the oratory, face east with sincerity, offer incense three times, then perform eight bows. Remove your headscarf and hat, kowtow nine times, and strike your cheeks thrice. After completing these three sets, declare: \"Officer so-and-so, on this day and hour, burns incense and wishes to make a solemn petition.\" Then take the incense in hand, place it in the censer, and say aloud: \"May so-and-so’s transgressions from the age of seven onward be absolved, and may they attain longevity and extended years.\" Offer incense again and vow: \"May so-and-so’s three clans, five ancestors, seven generations of parents—those who have passed before and those who have died after—be delivered from suffering and dwell in peace and bliss.\" Offer incense once more and say: \"May all members of this household, great and small, remain free from harm, and may their income and expenditures flow smoothly.\" Offer incense again and vow for official promotion. Offer incense once more and pray for the resolution of disputes, illnesses, and ailments among local officials. Each vow is made with a separate offering of incense. If making vows on behalf of others, there is no fixed limit—ten, twenty, or thirty offerings may be made as the vow requires. On fasting days, incense is burned at the six hours: *yin*, *wu*, *xu*, *hai*, *zi*, and *chou*. On non-fasting days, incense is offered at dawn and dusk. On *chen* and *si* days, when the heavens are clear, repent at midnight facing north, kowtow one hundred times in sets of thirty-six, strike the cheeks three times, and perform three hundred kowtows as a regular practice. Those whose accumulated merit runs deep will draw near to communion with the divine; those whose merit is shallow will attain immortality in eight years. Let this be diligently observed as decreed.\n\nLord Lao said: On the three assembly days, Daoist adherents shall present themselves to their masters for instruction. When first submitting petitions and registers, stand in the oratory facing south with the master to the north, each in their proper position. Perform eight bows, nine kowtows, and strike the cheeks nine times. Bow again, prostrate, and request the petitions and registers. Then pay respects to the master. Let this be diligently observed as decreed.\n\nLord Lao said: For Daoist officials and libationers, the method of cultivation while traveling among the people in the four directions is as follows: Walk with an upright posture, face forward, and proceed directly without glancing left or right. Upon entering a household, do not give way to anger or reproach. Do not criticize their food, drink, beds, or dwellings, nor engage in idle chatter or debate right and wrong. Do not first visit the homes of the wealthy and powerful out of partiality, nor neglect the proper order of visits. Instead, go first to the homes of the poor and humble, instruct them in seeking blessings, and ensure all rituals and precepts are fully observed. Let this be diligently observed as decreed.\n\nLord Lao said: Daoist register initiates and lay adherents who have servants must not address them as \"servant\" but by their given names. If they commit an offense, do not beat them arbitrarily; instead, summon them and explain: \"You have committed this transgression and deserve punishment. Accept it.\" If the reprimand is just, the servant will acknowledge their fault without resentment. Daoist officials and lay adherents must not speak of death in their words or breath, for this is a grave taboo for Daoist adherents. Let this be diligently observed as decreed.\n\nLord Lao said: In the world, there are those who inherit their fathers’ or ancestors’ practice of the Dao, creating their own methods and household rituals. Others inherit the office of libationer from their ancestors. The common people, being ignorant, claim that when a father dies, the son succeeds him, without proper affiliation. Household masters and common folk alike indulge in licentious and heterodox worship, introducing various corruptions and falsely claiming to uphold the Dao. When they see a properly ordained libationer, they bow and say: \"I am a Daoist adherent and wish to submit to your guidance, but I fear offending the spirits and bringing calamity upon myself.\" Such people may request to hold a Daoist assembly. After three gatherings to establish sincerity, if they still refuse to comply, do not invite them again. These deceitful individuals persist in their ways; they are not true followers of the Dao. It would be better to invite those who do not claim to uphold the Dao at all. Why is this? All are subjects of Heaven, governed by a single Dao. Yet if they are of a different affiliation, it is better to include them in assemblies than to tolerate those who claim to uphold the Dao without a master and harbor heterodox intentions. Daoist officials and libationers should include them in assemblies and treat them as guests. However, such arrangements often lead to many errors and require careful consideration. If they are treated as guests, they shall be judged according to the law. Let this be diligently observed as decreed.\n\nLord Lao said: When Daoist adherents seek blessings through offering feasts, they must first purify themselves through fasting. The fast may be of high, middle, or low grade, as they choose, and the assembly shall be held the following day. On the day of the feast, invite guests to stay overnight in the host’s home. After all vows have been fulfilled, the officials and assembly shall collectively ensure the proceedings, and no one shall depart for other engagements. From cockcrow until sunrise, all shall take their places in the kitchen to welcome the immortal officials. Only for the feast of the departed ancestors is the time extended from dawn to noon. If a person of rank or office makes a vow and seeks official recognition, or if it involves commanderies, counties, dukes, ministers, or nobles of any rank, the feast may be held as they wish, including animal sacrifices. The people shall enjoy peace, the land shall be secure, wind and rain shall come in due season, and feasts may be held as desired without prior restrictions. There is no limit to the number of attendees, nor is it required to hold a feast at all. Simply maintain diligent incense offerings. Let this be diligently observed as decreed.\n\nLord Lao said: The qi of the Dao is layered in countless folds. Since the beginning of creation and the reign of the Yellow Thearch, gates have had immortals and sages. From this time onward, human deceit has flourished, and the Dao has declined; scriptures and texts have become corrupted. Later generations, in their fraudulence, have fabricated immortal scriptures and diagrams. Countless methods and prescriptions fill the world—ten thousand herbs, a hundred thousand remedies. Yet why do those who delight in the Dao and seek longevity fail to achieve it? The foolish, with their limited understanding, cannot grasp the subtleties of the supreme Dao of immortality. The transmission of the Way from immortal to sage is passed down through oral instructions and essential secrets, not recorded in written texts. Without the merit of fasting, focused meditation, and communion with the divine, how can one summon the winds and ride the dragons, have immortal officials descend to visit, be received and ascend on high? Those who consume herbal and mineral medicines and gain efficacy from them—these are the ones whose petitions are heard above, and who are sent immortal youths and jade maidens to attend them.\n\nThe celestial officials’ divine medicines, when their proportions are precisely measured—one herb for one person—yield the efficacy of a hundredweight. When one person gains efficacy, the methods of ingesting qi are likewise equivalent. How can people of this world comprehend such principles? Without the descent of immortals, how can one ascend the steps of the Great Clarity? Yet by preparing and consuming these medicines, one may indeed dispel illness, prolong life to its natural end, ward off noxious qi, and render oneself invulnerable to pestilence. One may complete the span of a lifetime, supplementing it with grain to nourish one’s nature, establishing merit through fasting and purification, and dissolving transgressions to erase sins.\n\nThose who wish to cultivate and study the Way of longevity should diligently seek out the recited precepts and establish merit, engaging in incense offerings, fasting, and refinement. Only after their merit is complete and their sincerity moves the heavens can they attain longevity. The *Baopuzi*, without seeking to benefit the world, has gathered and synthesized the medical formulas of former sages from various schools to compose this scripture and exhort the pursuit of immortality. Its inner and outer chapters begin by affirming that immortality is attainable, thereby awakening the hearts of people. It inherits many lost scriptures yet does not recklessly fabricate or alter their teachings, thus avoiding the transgression of falsifying scriptures. In composing this scripture to exhort the pursuit of immortality, its merit or fault will be self-evident, and in future lives, one may ascend the ranks of immortals.\n\nThose who cultivate the Dao must no longer rely on the spurious scriptures and precepts of earlier generations. The texts people study today, though deemed fine classics, may benefit the body and bring morning wealth and honor, serving as a legacy for descendants—but they contain no steps to attain longevity or ascend as immortals. Those who seek the Way of life must first read the *Five Thousand Character Classic*, for it is the most essential. Be clear and cautious in upholding it as you would a sacred decree.\n\nLord Lao said: Outside the purification chamber, according to the available space, construct an additional layer of fencing or walls with a gate facing east. The master of the purification and their disciples must remain outside the chamber. During the time of incense offerings, the master must not eat, drink, or wear shoes within the chamber. When entering to sit or speak, this is the greatest prohibition for seeking blessings. Lest ordinary people enter and take things, all objects must be secured. Be clear and cautious in upholding it as you would a sacred decree.\n\nLord Lao said: Daoist officials and Daoist followers, upon the death of a family member, shall perform purification rites seven days later. The family of the deceased shall distribute living-world goods and hold a ritual feast according to the number of attendees, inviting laypeople to participate without hardship in order to assist the deceased in crossing over. After three such rituals are completed, if they wish to hold another, they may do so at their discretion. If they are able to prepare adequately, they should; if not, they need not trouble themselves with incense offerings.\n\nBe clear and cautious in upholding it as you would a sacred decree.\n\nLord Lao said: When holding a ritual feast for the deceased and offering incense, one Daoist official shall stand in the center of the purification altar, facing east. The register-holder and the host shall also face east, each performing eight bows, nine prostrations, nine breast-strikings, and repeating this three times. Each shall then bow again earnestly. If there are many attendees, they may perform seated bows and prostrations. The host shall state their official title, surname, and given name, and address the Boundless Great Dao, the myriad myriad Perfected of the Boundless Great Dao. Taking incense in hand, they shall offer it three times into the censer, reciting: \"For the deceased, so-and-so, I dissolve their transgressions and offer this incense with my vows.\" The others shall then approach the altar in turn, earnestly offering incense according to the proper method until all have finished. The master of the purification shall present the memorial, while the others shall bow to the host from their seats, facing east, and prostrate themselves after the memorial is presented. The ritual feast shall then commence. After the feast concludes, the master of the purification shall enter the chamber to report the proceedings, seeking blessings for the host. At that moment, the host shall bow and prostrate themselves. When the gathering disperses, the guests shall bow eight times toward the purification chamber before returning home. The host shall burn incense three times throughout the night.\n\nBe clear and cautious in upholding it as you would a sacred decree.\n\nLord Lao said: If a Daoist follower’s household has a sick member, upon returning home, the master shall first instruct the follower to offer incense in the purification chamber. The follower shall stand outside the chamber, facing west, with hair unbound, prostrating themselves to confess and repent all transgressions and offenses, ensuring nothing is concealed or withheld, and seeking forgiveness. If even one matter is left unconfessed, or if their intent is insincere and their faith in the method lacking, how can the memorial dissolve their transgressions? The master shall also separately report: \"Follower so-and-so seeks such-and-such.\" The sick person shall also confess their transgressions. If all transgressions are confessed, the master shall receive favorable responses; if not, the master shall receive no favorable response. During the confession, talismans may be employed concurrently. The follower shall present the memorial three times a day. If after three days the sick person shows no improvement, a memorial may be presented to dissolve the retribution of deceased ancestors. The sick person’s family shall prostrate themselves toward the purification chamber by day and face north toward heaven and earth by night, confessing their transgressions without fail at any hour. If the family, in their distress, wishes to make vows involving money, food, or offerings, they shall not be heeded. If they are able to prepare a feast, they may invite three, five, ten, or more guests, according to their means, and hold a ritual feast in accordance with the regulations. During the feast, the guests and host shall bow, prostrate themselves, and offer incense, seeking deliverance for the sick person. After the feast concludes, the guests shall return home and burn incense, prostrating themselves three times throughout the night, performing the same rites of deliverance for the sick person.\n\nBe clear and cautious in upholding it as you would a sacred decree.\n\nLord Lao said: If Daoist followers transgress the regulations through licentiousness or killing, they shall calculate the value of the illicit goods and return them to the lay household, purchasing ritual feast supplies themselves. The master shall then present a memorial to dissolve their transgressions. During the ritual feast, the host and guests shall face the incense, perform eight bows and prostrations, thirty-six breast-strikings, and repeat this three times before bowing again. Taking incense in hand, they shall place it in the censer and declare: \"So-and-so addresses the Most High Great Dao: I, so-and-so, being but a mortal of limited understanding, have followed the regulations in offering sacrifices to such-and-such an official for such-and-such a matter, yet I have also made improper requests to fulfill my desires. Now, in accordance with the regulations, I return the illicit goods to provide for the ritual feast and invite guests as witnesses. From this day forward, I entrust my life and death to the Dao and dare not repeat my former actions. I humbly seek to be included in the amnesty and receive the grace of life, that the Dao’s qi may take pity on me.\"\n\nBe clear and cautious in upholding it as you would a sacred decree.\n\nUphold it with clarity and caution as you would a sacred decree.\n\nThe Most High Lord Lao declares: Male and female Dao officials, \"having long been mired in defilement, have assumed the office of Libationer. Through accumulated diligence over generations, they have grown avaricious and impure. If, after their bodies have transformed and they have sought renewal over many years, they still engage in bribery and self-serving explanations, greedily hoarding filth for themselves, this is to fabricate falsehoods in the name of the scriptures and precepts. Such persons shall all descend into hell. Those whose sins are grave shall be reborn as insects or beasts, their debts of retribution never to be repaid. Thus, I now issue this renewed ordinance of music and rectification, aligning it with the heads of the teachings, so that those who believe in the Dao may harmonize with human sentiment, purify their bodies, and align their conduct with the Dao’s merit. The Most High’s pure qi shall henceforth shelter and protect them, allowing the people to begin anew, rectify past wrongs, and cultivate future virtue, all in accordance with the new ordinances as the standard.\"\n\nUphold it with clarity and caution as you would a sacred decree.\n\nThe Most High Lord Lao declares: The Dao’s qi is layered in hundreds, thousands, and myriad folds. The sages of old and the worthies to come, who cultivated and studied for immortality, all encountered immortal officials. Each person received a single layer of qi, and upon ascending and transcending, their names were never recorded in the registers. The teachings of the bedchamber, which encompass the *Huang-Chi* scriptures and covenants, comprise one hundred and twenty methods. The teachings of pacing the courtyard and thresholds likewise contain not a single word of deviation. Since the time when the Celestial Master Zhang Daoling wearied of his ascent, only those scriptures with extant explanations have remained in the world—yet who among them has attained longevity and ascension as a flying immortal? The most essential techniques of the body, the oral instructions of *daoyin*, all reside in the master’s words. The written teachings, however, are used to test the hearts of officials. If those who open and believe in them hold fast to the scriptures with single-minded devotion, their incense and flames will naturally flourish. Through refining their practice to completion, they shall awaken to the perception of true spirits, commune with immortals, and obtain the ultimate instructions.\n\nHenceforth, those who falsely deceive and mock the Dao, adorning themselves with divine favor and embellishing the scriptures, altering texts and fabricating precepts without cause, have established these counterfeit practices as custom, misleading the world. Men and women who receive and wear the covenants and ordinances, blindly transmitting them to one another, are unable to transcend themselves yet still lead disciples, confusing and deluding the common people. The number of offenders is great, inviting calamity and tribulation, polluting the Daoist teachings and damaging the Dharma-body. I now earnestly command that the *Huang-Chi* be abolished and reformed, and that pure and distinct methods be cultivated to align with the Dao’s merit. From this day of admonition forward, those male and female officials and registered disciples who wear the *Huang-Chi* covenants shall find no auspiciousness in doing so. If there are those who remain heedless, the true officials of the land where they reside shall record their qi and govern their misdeeds. The attending envoys shall examine and record their actions, and I shall visit calamity and tribulation upon them, consigning them to hell in death. If their refined spirits are reborn, they shall enter the bodies of insects or beasts—even swine or sheep—and their debts of retribution shall never be repaid.\n\nI observe that among the world’s people, husbands and wives who practice the *Huang-Chi* do not follow a single method according to the essential principles of the celestial officials. Instead, they engage in defilement and impurity, violating the prohibitions of the *Jinglu* governing officials with their hands. Yet even the celestial officials, immortals, and jade maidens do not transgress the laws of the governing chambers. Now, due to the greed and defilement associated with the *Huang-Chi*, the Daoist teachings have long been without true transmission. The blind have led the blind, and none have attained the correct middle path. There are, however, those who are pure, refined, and unsullied, who do not err in their adherence to the scriptures and precepts. I intend to eliminate such persons from calamity, sparing them from the violence of condemnation and reproach. Thus, I first issue this solemn covenant to reform and redirect the teachings. Nevertheless, the foundational scriptures and covenants of the bedchamber, which seek life’s essence, comprise over a hundred methods that are not subject to prohibition. If husband and wife delight in these methods, they need only inquire of a pure and upright master, follow the prescribed methods, and practice according to their preferences—even a single method will suffice.\n\nIn this defiled and evil age, embodied beings dissipate their spirits, and the threads of their sins are difficult to unravel. Thus, I issue this covenant. It is essential to undertake fasting and merit-making, returning to the beginning, wiping away sins and transgressions, so as to awaken to the perception of true immortals. Male and female officials, exert yourselves in cultivating fasts, seek out these solemn admonitions, establish merit through incense and flame, and the Dao of immortality shall not be far.\n\nUphold it with clarity and caution as you would a sacred decree.\n\nThe Most High Lord Lao declares: Since the time when the Celestial Master ascended as an immortal, the true offices of the Dao have been neglected, and the Way has withered while people have grown defiled. Later officials, blindly transmitting the teachings to one another, have self-appointed themselves to govern registers, talismans, and covenants, their qi and seasonal correspondences inverted and disordered, rendering them unfit for emulation. I originally conferred the Twenty-Four Treaties, which correspond above to the Twenty-Eight Constellations and below to the twenty-four qi of yin and yang, bestowing them upon the diligent Libationers to transform and lead the households of the people. Zhang Daoling expounded the methods of the Dao, initially establishing the teachings in the single province of Shu. He appointed male and female Dao officials, aligning them with the mountains, rivers, lands, commanderies, and counties, and in accordance with my governing officials, *jinglu* pavilions, and residences, he shared with me the task of leading and transforming the people, exhorting them to turn from evil and cultivate goodness. Mount Yangping’s name corresponds above to the Horn Constellation, and the other mountains follow likewise.\n\nYet later Dao officials, failing to comprehend the conditions of the unseen world, have employed the alliance methods of Shu, appointing themselves to governing offices. The edict’s text states: \"Now, so-and-so is provisionally appointed to the He-Ming and Yun-Tai Treaties, temporarily registering and governing the office of qi, leading and transforming the households of the people. Upon presenting documents to the governing officials, they shall await the era of Great Peace before returning to their original treaties.\" However, the spirits of the lands of the Nine Provinces, along with their memorials and documents, all ascend through the true spirits of the local governing officials. Yet now, when Dao officials present memorials, they summon the governing officials and clerks of the Shu treaties and residences, while the spirits of other lands remain distant and estranged. My original decrees for the hostel-treaties were intended to lead and transform the households of the people. Zhang Daoling merely established the names of the mountain, river, land, and residential treaties—how could there be a requirement to await Great Peace before returning to the original treaties?\n\nHenceforth, in all commanderies and counties, male and female officials who wear the registers of office shall each report to their masters to reform their residential treaties and qi. In accordance with the new ordinances, they shall return to their original hostel-officials, designating the treaties as their official titles and receiving the Twenty-Four Treaties. Those who transmit the covenants and ordinances shall issue proclamations, stating: \"So-and-so is appointed as the Correct Central Official of the True Qi of the Horn Constellation Treaty.\"\n\nWhen submitting memorials during the proper times for the constellations Kang, Di, Fang, and the Twenty-Eight Mansions, one may only address oneself as \"your servant\" and may not be styled as a \"Perfected Person.\" If one holds an external register as an official, one may not use the title of a *treaty*. The titles of the residential treaties of Shu lands shall no longer be employed. If descendants of the Celestial Master’s lineage remain in the world, diligently upholding the teachings of the treaties and guiding the people, they may not rely upon or employ various officials or Libationers. When submitting memorials in accordance with the law, they may not solely claim the title of the Celestial Master’s position but must use their official titles, equal in rank to other officials.\n\nProceed with caution and act in accordance with the statutes and ordinances.\n\nLord Lao said: Those who serve as Dao officials, Correct Treaties, or Libationers must promote the worthy and recommend the capable. When receiving disciples, conferring official treaties, registers of sincerity, and talismanic contracts, for every worthy and good person advanced, ten years of transgressions are erased, and the path to immortality is swiftly attained. For every sycophant or evil person advanced, ten years of retribution are incurred, and neither immortality nor blessings may be sought. Those among the people who seek entry into the Dao gate and wish to become disciples must first observe their temperament and disposition. Only after three years of mutual agreement in sincerity, when they have demonstrated the ability to cultivate the teachings with care, advance in virtuous conduct, maintain an unwavering heart, and hold no deviant intentions, may registers of sincerity be conferred and they be accepted as disciples.\n\nProceed with caution and act in accordance with the statutes and ordinances.\n\nLord Lao said: Central officials, Correct Qi Constellation Treaty Libationers, may confer official registers and contracts upon others. However, those who have received registers may not recklessly confer contracts upon others. If one does not govern households but receives the register of a Central Treaty, one shall receive the position of a Libationer of Scattered Qi of the Central Treaty. If one holds the position of a High Spirit Official but does not govern households, one shall receive the position of a Libationer of Scattered Qi of an External Office. External officials and Libationers who govern the people shall sit with one hundred and fifty registers during assemblies, occupying the lower seats. If a Central Official governs the people, the descendants of the Correct Qi Libationer shall receive the office of a Central Official. For Central Constellation Treaties, Scattered Qi Libationers shall, when submitting memorials on behalf of the people under their father’s governance, address them as \"civil treaty qi memorials.\" If other officials or Libationers govern the people, the people shall submit memorials under their own treaty qi. If one seeks personal salvation, self-cultivation, and does not transform the ignorant masses or govern households, one may directly receive the register of the Seventy-Five Generals of the Red Heaven of the Upper Immortals of the Central Office. In life, such a one shall rank above External Treaty Libationers.\n\nProceed with caution and act in accordance with the statutes and ordinances.\n\nLord Lao said: Among Dao officials and Dao followers, if the spirits of their deceased ancestors, grandparents, or parents remain bound in the underworld and afflict their descendants, when purification rituals fail to reach them and memorials contain errors or excessive claims—such as boasting of ten or a hundred successful petitions—these efforts will be of no benefit. First, one must ensure the purification ritual is thorough and effective; only then may memorials be submitted for verification and deliverance. The methods of purification rituals and memorials need not be overly elaborate. Excessive and burdensome petitions defile the celestial bureaus and are better left unsent. Conduct one purification ritual every hundred days. On the day memorials are submitted for deliverance, one may also invite the worthy, holding an assembly commensurate with the number of attendees to rescue the suffering and accumulate blessings and benevolence. If one cannot prepare adequately, one may simply submit memorials through one’s master to deliver the deceased. Libationers may do so daily. After completing a hundred days of purification rituals, submit memorials through one’s master.\n\nProceed with caution and act in accordance with the statutes and ordinances.\n\nThe recitation of Lord Lao’s Admonitory Sutra concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "老君音诵诫经 经名：老君音诵诫经。 又名《云中音诵新秤之诫》。 北魏神端二年，嵩山道士寇谦之假托太上老君降授。 据《魏书□释老志》载，原本为二十卷。 现残存一卷。 底本出处：《正统道藏》洞神部戒律类。 老君音诵诫经 老君曰：烦道不至，至道不烦，按如修行，诸男女官见吾诵诚科律，心自开悟。 可请会民同友，以吾诫律着按上作单章，表奏受诚，明慎奉行如律令。 老君曰：道官、箓生，初受诫律之时，向诫经八拜，正立经前，若师若友，执经作八胤乐，音诵受者，伏诵经意卷后讫，后八拜止。 若不解音诵者，但直诵而已。 其诫律以两若相成之，常当恭谨，若展转授同友及弟子，按法传之，明慎奉行如律令。 老君曰：道官、箓生，未使写经，诚律脱误，增损一字，有不得抄撮； 写诚三纸二纸，不说卷首，使科律不具，灾当及身。 吾此科诫，自有典事之官，随经诚监临，明慎奉行如律令。 老君曰：吾汉安元年以道授陵，立为系天师之位，佐国扶命。 陵以地上苦难，不堪千年之主者，求乞升天。 吾乃勉陵身，元元之心，赐登升之药，百炼之酒，陵得升云蹑虚，上入天宫。 从陵升度以来，旷官真职，来久不立系天师之位。 吾使诸州郡县，土地真官，注气治理鬼事，领籍生民户口，不用生人，祭酒理民，浊乱之法。 而后人道官诸祭酒，愚暗相传，自署治箓符契，攻错经法，浊乱清真，言有三百六十契令，能使长生。 鬼神万端，惑乱百姓； 授人职契录，取人金银财帛。 而治民户，恐动威逼，教人脆愿，匹帛、牛犊、奴婢、衣裳，或有岁输全绢一匹，功薄输丝一两。 众杂病说，不可称数。 妄传陵身所授黄赤房中之术，授人夫妻，侄风大行，损辱道教。 有祭酒之官，称父死子系，使道益荒浊。 诚曰：道尊德贵，惟贤是授，若子胤不肖，岂有继承先业？ 有祭酒之官，子之不肖，用行颠倒，逆节纵横，错乱道法，何有承系之理者乎？ 铁券首云父死子系何？ 是近世生官王者之法制耳。 吾今未立地上系天师正位，据听道官，愚暗相传，自署治箓。 诸道官祭酒，可简贤授明，末复按前，父死子系，使道教不显。 吾论一事，吾岂死，有子孙系吾老君天师之后。 天道无亲，惟贤是授。 明慎奉行如律令。 老君曰：吾得嵩岳镇土之灵集仙官主表闻称言：地上生民，旷官来久。 世间修善之人，求生科福，寻绪诈伪经书，修行无效，思得真贤正法之教。 宜立地上系天师之位为范则。 今有上谷寇谦之，隐学嵩岳少室，精炼教法，掬知人鬼之情，文身宣理，行合自然，未堪系天师之位。 吾是以东游，临观子身，汝知之不乎？ 吾数未至，不应见身於世。 谦之，汝就系天师正位，并教生民，佐国扶命，勤理道法，断发黄赤。 以诸官祭酒之官，校人治箓符契，取人金银财帛，众杂功跪，愿尽皆断禁，一从吾乐章诵诚新法，其伪诈经法科，勿复承用。 谦之受诚，二宿三日，掬寻窃冥之情。 老君召，谦之临言：臣以蒙覆，愚而不进，有不赐长生神药，不能役使鬼神，何能化恶为善，消灾伏异，师范之？ 则愿道哀念，赐存生命，须老君出於世之时，得有神药之应，皆道气入身，乃敢受系天师之位。 愿录愚诚。 老君曰：吾以汝受天官内治，领中外官，临统真职，可比系天师同位。",
      "translated_text": "**The Scripture of the Venerable Lord’s Chanted Admonitions**\n\n**Scripture Title:** *The Scripture of the Venerable Lord’s Chanted Admonitions*. Also known as *The Admonitions of the New Scale Chanted in the Clouds*.\n\nIn the second year of Shenduan during the Northern Wei dynasty, the Daoist Kou Qianzhi of Mount Song falsely claimed to have received this scripture through a revelation from the Most High Venerable Lord. According to the *Wei Shu: Treatise on Buddhism and Daoism*, the original text comprised twenty scrolls, of which only one remains. The present edition is derived from the *Daoist Canon of the Zhengtong Era*, under the category of Precepts and Disciplines in the *Dongshen* section.\n\n---\n\nThe Venerable Lord spoke:\nThe Way that is vexed does not arrive; the Way that arrives is not vexed. Follow this in cultivation, and all Daoist officials, male and female disciples, upon hearing my chanted precepts and statutes, shall awaken in their hearts. Gather the people and fellow practitioners, inscribe my admonitions and statutes into a single document, and present it in memorial to receive the precepts. Be diligent and cautious in upholding them as decreed.\n\nThe Venerable Lord spoke:\nWhen Daoist officials and registered disciples first receive the precepts and statutes, they shall bow eight times toward the scripture of admonitions, stand upright before it, and—whether master or companion—hold the scripture to perform the Eightfold Offering of Music. Those who chant and receive the precepts shall prostrate themselves, recite the scripture’s meaning to its conclusion, and then bow eight times to conclude. If one does not understand the chanted recitation, a straightforward reading shall suffice. The precepts and statutes are to be mutually affirmed by two parties. Always maintain reverence and care. When transmitting them to fellow practitioners or disciples, follow the proper method and uphold them diligently as decreed.\n\nThe Venerable Lord spoke:\nDaoist officials and registered disciples must not copy scriptures or precepts carelessly. To add or omit even a single character is forbidden; such errors may not be excerpted. If one transcribes the precepts onto two or three sheets without including the opening section, rendering the statutes incomplete, calamity shall befall the transgressor. These statutes and admonitions shall be overseen by officials of canonical affairs, who shall supervise their observance in accordance with the scripture’s precepts. Be diligent and cautious in upholding them as decreed.\n\nThe Venerable Lord spoke:\nIn the first year of Han’an, I transmitted the Dao to Zhang Ling, establishing him as the Celestial Master to assist the state and sustain the mandate. Ling, seeing the hardships of the world, deemed it unfit for a thousand-year lord and begged to ascend to heaven. I then urged Ling to refine his resolve, bestowed upon him the elixir of ascension, and the hundred-times-distilled wine. Thus, Ling ascended upon clouds, entering the celestial palace. Since Ling’s ascension, the office of the Celestial Master has been vacant for too long. I commanded the true officials of all prefectures, commanderies, and counties to govern ghostly affairs with their infused *qi*, register the households of the living, and cease employing living persons as Libationers to govern the people—a method that has led to corruption and disorder.\n\nYet later Daoist officials and Libationers, ignorant and blindly transmitting the teachings, have falsely assumed the authority to administer registers and talismans, distorting scriptural methods and polluting the pure and true. They claim there are three hundred and sixty talismanic decrees enabling immortality, conjuring myriad spirits to confuse the people. They confer ranks and registers upon others in exchange for gold, silver, and wealth, and govern households with threats and coercion, compelling offerings of silk, cattle, slaves, clothing, or annual tributes of a bolt of silk or an ounce of silk floss. The abuses are too numerous to recount.\n\nThey falsely propagate the Yellow and Red Chamber arts transmitted by Zhang Ling, teaching them to husbands and wives, spreading licentious practices that disgrace the Daoist teachings. Some Libationer officials claim that upon a father’s death, the son inherits his position, further corrupting the Dao. Yet the truth is: the Dao is revered and virtue is noble; only the worthy are to be entrusted. If a son is unworthy, how can he inherit his father’s legacy? Some Libationer officials, their sons unworthy, act perversely, defying principles and disordering the Dao—how can they rightfully inherit the lineage? The opening of the iron charter states, “Upon the father’s death, the son succeeds”—this is merely the law of secular rulers. I have not yet established a Celestial Master on earth, yet Daoist officials, blindly transmitting the teachings, have presumptuously assumed the authority to administer registers. All Daoist officials and Libationers must select the worthy and enlightened for transmission. Cease the practice of sons inheriting their fathers’ positions, lest the Daoist teachings remain obscure. I declare: even if I were to die, my descendants would not inherit the position of Celestial Master after me. The Way of Heaven is impartial; only the worthy are entrusted. Be diligent and cautious in upholding this as decreed.\n\nThe Venerable Lord spoke:\nI received a memorial from the assembled immortals and officials presiding over the sacred land of Mount Song, stating: “The people of the world have long been without proper governance. Those who cultivate goodness and seek blessings through precepts follow fraudulent and deceptive scriptures, their practices yielding no results. They long for the teachings of a true and worthy orthodox method. It is fitting to establish the position of Celestial Master on earth as a model.”\n\nNow there is Kou Qianzhi of Shanggu, who has secluded himself to study on Mount Song’s Shaoshi Peak. He has refined the teachings, grasped the nature of humans and spirits, embodied the principles in his conduct, and aligned his actions with spontaneity—though not yet worthy of the Celestial Master’s position. Thus, I journeyed east to observe him in person. Do you know this? My destined time has not yet come; I should not have appeared in the world. Qianzhi, you shall assume the position of Celestial Master, teach the people, assist the state, sustain the mandate, and diligently govern the Daoist methods. Sever all ties to the Yellow and Red practices. As for the various officials and Libationers who examine registers and talismans, extort gold, silver, and wealth, and demand miscellaneous offerings and vows—all such abuses shall be prohibited. Follow only my new method of chanting and reciting the precepts. The fraudulent scriptures and statutes shall no longer be observed.\n\nQianzhi received the precepts and, after two nights and three days, delved into the hidden depths of the matter. The Venerable Lord summoned him, and Qianzhi addressed him: “I am benighted and unworthy, lacking the wisdom to advance. Without the elixir of long life or the power to command spirits, how can I transform evil into good, dispel disasters, and subdue anomalies to serve as a model? I humbly beseech your compassion, grant me life, and await the time of your manifestation in the world. Only when the divine elixir responds and the *qi* of the Dao enters my body shall I dare to assume the position of Celestial Master. I record my earnest plea.”\n\nThe Venerable Lord spoke:\n“I appoint you to govern the inner and outer offices of the celestial bureaucracy, presiding over the true duties, equal in rank to the Celestial Master.”",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1246,
      "start_sentence": 0,
      "end_sentence": 49,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.86031365394592,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\老君音诵戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "吾令听汝一让之辞。 吾此乐音之教诚，从天地一正变易以来，不出於世，今运数应出，汝好宜教诚科律，法人、治民、祭酒按而行之。 奉顺诚约之后，吾当勑下九州四海之内土地真官之神，腾籍户言#1。 其有祭酒道民，奉法有功，然后於中方有当简择种民#2，录名文昌宫中。 若道官祭酒不闲教化者，导及养生之术，有疑事不了，汝当与决之，分明顺奉，行如律令。 太上老君乐音诵诚令文曰：我以今世人作恶者多，父不慈，子不孝，臣不忠，运数应然当疫毒临之，恶人死尽。 吾是以引而远去，乃之昆仑山上。 世间恶人，共相鱼肉，死者甚多，其中滥枉良善，吾愍之辛苦，时复东度，覆护善人。 九州四海之内土地真神，五岳官属，尽集对各说土居好德异同，林言事实，称今世人恶，但作死事，修善者少。 世间诈伪，攻错经道，惑乱愚民，但言老君当治，李弘应出，天下纵横，返逆者众。 称名李弘，岁岁有之，其中精感鬼神，白日人见，惑乱万民，称鬼神语。 愚民信之，诳诈万端，称官设号，蚁聚人众，坏乱土地。 称刘举者甚多，称李弘者亦复不少，吾大瞋怒！ 念此恶人，以我作辞者，乃尔多乎！ 世间愚痴之人，何乃如此。 吾治在昆仑山，山上台观众楼，殿堂宫室，连接相次，珍宝金银，众香种数，杂合错饰，兰香桂树，穷奇异兽，凤凰众乌，栖於树上，神龙麒骥，以为家畜，仙人玉女，尽集其上。 若欲游行，乘云驾龙，呼吸万里，天地人民鬼神，令属於我，我岂用作地上一城之主也，我不愿之！ 若我应出形之时？ 宜欲攻#3易天地，经典故法，尽皆珍灭，更出新正。 命应长生之者，赐给神药，升仙度世，随我左右。 恶人化善，遇我之者，尽皆延年。 若国王天子，治民有功，辄使伏杜如故，若治民失法，明圣代之。 安民平定之后，还当升举，伏宅昆仑。 我出之时，乘驾九龙之车，龙有九色连钱斑文，车有羽盖十二出，檀梓为车，饰以金银珠玉，杂色奇异，不可目名； 征召天下真官，海岳风伯雨师，役使万鬼； 倾天纲，缩地脉，回转天地如回我身； 把捉日月，能令天地昼暗； 仙人玉女，輧车侍从，锺鼓音乐，遍满虚空； 百兽真徒，凤凰众乌，翔于其上； 天地运动，人众鬼兵，无有边际，见我威光，无不弥伏我哉！ 愚人诳诈无端，人人欲作不臣，聚集通逃罪逆之人，及以奴仆隶皂之问，诈称李弘。 我身宁可入此下俗臭肉奴狗魍魉之中，作此恶逆者哉！ 世人奸欺，诵读伪书，切坏经典，输吾多少，共相残害，岂不痛哉！ 吾出诵诚，宜令世人，咸使知闻，好加思寻，努力修善。 修善功成，可得遇真，延年益算。 明慎奉行如律令。 老君曰：吾初立天师，授署道教治箓符契，岂有取人一钱之法乎？ 喻如生官署职，有财钱若干，吾今并出新法，按而奉顺。 从今以后，无有分传，说愿输送，仿署治箓； 无有财帛，民户杂愿，岁常保口，厨具产生。 男女百灾，疾病光佐，众说厨愿，尽皆断之，惟有校藏，三分收一，即其民市买计，厨会就家解散，易复可诣师治。 民有病患，生命有分，唯存香火，一心章表，可得感彻。 唯听民户，岁输纸三十张，笔一管，墨一挺，以供治表捄度之功。 若有道官，浊心不除，不从正教，听民更从新科正法清教之师。",
      "translated_text": "I permit you to voice your modest refusal once more.\n\nThis teaching of mine through joyous sound is true and sincere. Since the single correct transformation of Heaven and Earth, it has not been revealed to the world. Now, as the cyclical destiny demands its emergence, you must diligently instruct and establish the precepts and statutes, guiding both the ordained and the laity, and the *jijiu* shall implement them accordingly. After they uphold and submit to these sincere covenants, I shall command the true officials of the lands within the Nine Provinces and the Four Seas to ascend the registers and report the households.\n\nThose *jijiu* and Daoist followers who uphold the law with merit shall then be selected among the seed people of the Central Realm, their names recorded in the Hall of Literary Prosperity. If any Daoist officials or *jijiu* are remiss in teaching and transformation, neglecting the arts of nurturing life, and encounter uncertainties they cannot resolve, you shall decide for them, clarifying the proper observance to be followed as decreed.\n\nThe Most High Lord Lao’s Decree of Joyous Sound and Sincere Instruction states:\n\nIn this present age, evildoers abound: fathers lack compassion, children lack filial piety, ministers lack loyalty. The cyclical destiny ordains that pestilence and poison shall descend upon them, and the wicked shall perish utterly. Thus, I withdrew far away to the Kunlun Mountains. In the world below, the wicked prey upon one another, and the dead are countless. Among them, the innocent and virtuous suffer unjustly, and I pity their hardship. From time to time, I cross eastward to shelter the good.\n\nThe true spirits of the lands within the Nine Provinces and the Four Seas, along with the officials of the Five Peaks, have all assembled to report on the virtues and deviations of their domains, recounting the facts. They declare that in this age, people commit deeds that lead to death, while those who cultivate goodness are few. Deceit and falsehood pervade the world, distorting the classics and the Dao, deluding the foolish masses. They claim that Lord Lao shall govern, that Li Hong shall appear, and that the realm shall be thrown into chaos, with rebels abounding. Every year, some claim the name Li Hong, and among them, spirits and ghosts manifest in broad daylight, deceiving the people with their spectral words. The foolish believe them, spreading countless lies, assuming titles and ranks, gathering crowds like ants, and disrupting the lands. Those who call themselves Liu Ju are many, and those who claim to be Li Hong are no fewer. I am enraged! How can there be so many who invoke my name for such evil? How can the people of this world be so foolish and deluded?\n\nMy abode is on Kunlun Mountain, where terraces, pavilions, towers, halls, and palaces stand in succession. Treasures of gold and silver, myriad fragrant woods, and intricate adornments fill the place. Orchids and cassia trees grow there, and rare beasts roam freely. Phoenixes and flocks of birds nest in the trees, while divine dragons and qilin serve as my livestock. Immortals and jade maidens gather there in abundance. When I wish to travel, I ride clouds and mount dragons, traversing ten thousand *li* in a breath. The people of Heaven and Earth, ghosts and spirits, are all subject to my command. Why would I desire to be the ruler of a single city on earth? I have no such wish!\n\nWhen the time comes for my manifestation, I shall transform Heaven and Earth, abolishing the old classics and ancient laws, and establish a new order. Those destined for long life shall be granted the divine elixir, ascending as immortals to transcend the world and remain by my side. The wicked who turn to goodness and encounter me shall all have their years extended. If kings and emperors govern the people with merit, they shall continue to rule as before. If they govern unlawfully, the enlightened shall replace them. After the people are pacified and order is restored, they shall ascend to dwell on Kunlun.\n\nWhen I emerge, I shall ride a chariot drawn by nine dragons, each adorned with multicolored, coin-spotted patterns. The chariot shall bear a feathered canopy with twelve projections, crafted from sandalwood and catalpa, embellished with gold, silver, pearls, and jade, along with rare and wondrous ornaments too numerous to name. I shall summon the true officials of the world, the wind and rain masters of the seas and mountains, and command the myriad ghosts. I shall overturn the celestial net, contract the earth’s veins, and turn Heaven and Earth as easily as I turn my own body. I shall grasp the sun and moon, causing the world to darken by day. Immortals and jade maidens shall ride in carriages beside me, while bells, drums, and music fill the void. The true disciples and beasts, phoenixes and flocks of birds, shall soar above. Heaven and Earth shall move, and the hosts of people and ghostly soldiers shall stretch boundlessly. All who behold my majestic radiance shall prostrate themselves before me!\n\nYet the foolish deceive without end, each desiring to rebel, gathering fugitives, criminals, slaves, and servants, falsely claiming to be Li Hong. How could I, in my true form, descend into this foul, carnal realm of slaves, dogs, and malevolent spirits to associate with such wicked rebels? The people of this world are treacherous and deceitful, reciting false scriptures and corrupting the classics. How much have they wronged me? How grievously they harm one another! Is this not agonizing?\n\nI issue this decree of sincere instruction so that all people may know and hear it. Let them reflect deeply and strive to cultivate goodness. When their merit in cultivating goodness is complete, they may encounter the true and have their years extended. Be prudent and observe this as decreed.\n\nLord Lao said:\nWhen I first established the Celestial Master, I bestowed the registers, talismans, and contracts to govern the Daoist teachings. Did I ever institute a law to take even a single coin from the people? It is like appointing an official to a post—how much wealth might they possess? Now, I issue this new law to be followed and obeyed.\n\nFrom this day forward, there shall be no division of transmission, no vows of offering, no imitation of the registers of governance. Without wealth or silk, the households shall make their annual pledges, ensuring the sustenance of their kitchens and the prosperity of their families. For the myriad afflictions of men and women, illnesses and disasters, all offerings and vows made in kitchens shall cease. Only the storage of provisions shall be permitted, with one-third collected. The people may trade and calculate in the markets, and the gatherings at homes shall be dissolved, allowing them to seek the masters for governance instead.\n\nWhen the people suffer illness or their lives are imperiled, they need only maintain the incense and flame, and present their sincerity in written petitions. Thus, they may attain resonance. The households shall be permitted to offer thirty sheets of paper, one brush, and one stick of ink each year to support the work of drafting petitions and delivering salvation.\n\nIf any Daoist officials harbor impure intentions and do not follow the true teachings, the people may instead seek out masters who uphold the new statutes and the pure teachings.",
      "overlap_context": "l disasters, and subdue anomalies to serve as a model? I humbly beseech your compassion, grant me life, and await the time of your manifestation in the world. Only when the divine elixir responds and the *qi* of the Dao enters my body shall I dare to assume the position of Celestial Master. I record my earnest plea.”\n\nThe Venerable Lord spoke:\n“I appoint you to govern the inner and outer offices of the celestial bureaucracy, presiding over the true duties, equal in rank to the Celestial Master.”",
      "start_char": 1246,
      "end_char": 2471,
      "start_sentence": 50,
      "end_sentence": 93,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.127042293548584,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\老君音诵戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "明慎奉行如律令。 老君曰：祭酒之官，迁功之后，子孙清彻聪明，闲练鬼事，可就明师，受署治箓符诚，承继父后。 若子孙用行颠倒，与俗不别，不顺科约者，诸官平处，奏表天曹，听民更受。 明慎奉行如律令。 老君曰：道民或有家宅，说愿厨具，不由师治者，师即时使还，令民市备，为会解散。 老君音诵诚曰：道民不练科法，不能精勤香火，消灾散祸及病痛，行来忧虑县官，光怪众诸，欲有保说者，尽不听。 听先启，何以故也？ 此户安道以求福，是误事也。",
      "translated_text": "Observe and act with caution, as decreed by the statutes.\n\nThe Most High Lord Lao declares: After the merit of Libationer officials is transferred, their descendants, if pure, clear-minded, and adept in matters of spirits, may approach enlightened masters to receive appointment, register talismanic pledges, and inherit their fathers’ legacy.\n\nShould their descendants conduct themselves perversely, indistinguishable from the common folk, and disobey the statutes and covenants, all officials shall deliberate and jointly submit a memorial to the Heavenly Bureau, permitting the people to seek new masters.\n\nObserve and act with caution, as decreed by the statutes.\n\nThe Most High Lord Lao declares: If Daoist households possess altars, make vows, or prepare ritual utensils without consulting their masters, the masters shall immediately order their return, require the people to procure them from the market, and dissolve such gatherings.\n\nThe Most High Lord Lao’s recitation of the pledge states: Daoist households that do not practice the statutes and methods, fail to diligently maintain the incense and flame, dispel disasters, avert misfortunes, or address illnesses—yet still come and go with anxieties about officials, strange omens, or various phenomena—shall not be permitted to make protective vows.\n\nWhy is this so? If a household embraces the Dao seeking blessings, it is a misguided endeavor. Only after first submitting a petition may they proceed.",
      "overlap_context": "re imperiled, they need only maintain the incense and flame, and present their sincerity in written petitions. Thus, they may attain resonance. The households shall be permitted to offer thirty sheets of paper, one brush, and one stick of ink each year to support the work of drafting petitions and delivering salvation.\n\nIf any Daoist officials harbor impure intentions and do not follow the true teachings, the people may instead seek out masters who uphold the new statutes and the pure teachings.",
      "start_char": 2471,
      "end_char": 2684,
      "start_sentence": 94,
      "end_sentence": 101,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.509418725967407,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\老君音诵戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "自今以后，道民若有求愿，先修厨会之具请。 若集启设求愿，其一事求上之，收福无他。 明慎奉行如律令。 老君曰：道官授署，职治符箓，随家丰俭。 意欲设会，任意人数，三人以上，复能重设。 诸肴和会可通，若不能者，无苦也。 明慎奉行如律令。 老君曰：厨会之上斋七日，中斋三日，下斋先宿一日。 斋法：素饭菜一日，食米三升，断房室、五辛、生菜，诸肉尽断。 勤修善行，不出，由行不经。 丧秽、新产欲就会时，向香火八拜，使大德精进之人，在坐首作好饭盘，在坐上头，人别作盘。 其参同不奉道者，请会无苦。 而世间愚人，真以所奉不同，便作异意，不斋慢道，科法不为。 主人求思恭肃之，故坐会之中，瞋恚无常。 从今以后，诸官以意科处，思寻妙旨，苟能同心福愿之人，参尔无苦会。 既还家为主人，烧香径宿，三过香火，言为：甲乙之家所请厨会，解求某事恩福，愿得道气覆护。 明慎奉行如律令。 老君曰：厨会之法，应下三盘，初小食，中酒，后饭。 今世人多不能三下盘，但酒为前，五升为限。 明慎奉行如律令。 老君曰：男女官受治箓，天官叩章。 顺诚之人，万邪不惑。 当喻如生官臣使，夫有职之人，道民岂能欺犯者乎？ 道官祭济，愚暗相传，自署治箓，为请佩千部将军、吏兵相惑，乱请之伪，吏兵卫护，尽皆无有正。 可常佩受署某官而已。 通神得道之人，遇值仙官。 诸受职箓者，不得五人三人，吏兵给吏。 然地上愚人，自署相仿，何可能有此百千万重将军。 吏兵、管护者哉！ 从今以去故时为事，未复承用。 明慎奉行如律令。",
      "translated_text": "From this day forward, if Daoist households seek to make vows, they must first prepare the utensils for the ritual feast and submit a petition. When gathering to establish and fulfill a vow, they shall seek but one matter above all, and the blessings received shall be without distraction. Let this be diligently observed as decreed.\n\nThe Most High Lord Lao declares: Daoist officials, upon receiving their appointments and administering talismans and registers, shall do so in accordance with each household’s means. If they wish to hold a ritual feast, the number of participants may be determined at will—three or more may gather, and those capable may do so repeatedly. The dishes and harmonious gatherings may be shared in common; if unable, there shall be no hardship. Let this be diligently observed as decreed.\n\nThe Most High Lord Lao declares: For ritual feasts, the highest observance requires seven days of fasting, the middle three days, and the lowest a single day of prior abstention. The fasting method: consume plain rice and vegetables for one day, consuming three *sheng* of rice. Abstain from the bedchamber, the five pungent vegetables, raw greens, and all meats. Cultivate diligent good conduct, remain within, and do not traverse where one ought not. When those in mourning, impurity, or recent childbirth wish to attend, they shall bow eight times before the incense and flame, and a person of great virtue and progress shall preside, preparing a fine rice platter at the head of the gathering, with each person having their own platter. Those who do not follow the Dao may be invited to the feast without hardship. Yet worldly fools, deeming their practices different, harbor contrary intentions, neglecting the fast and disdaining the statutes and methods. The host must seek reverence and solemnity, for within the gathering, anger and resentment shall have no place. From this day forward, officials shall adjudicate with discernment, contemplating the subtle essence. If there are those who, with unified hearts, seek blessings and vows, they may attend the feast without hardship. Upon returning home as the host, burn incense and pass the night in vigil, tending the incense flame thrice, and recite: *\"For the ritual feast held by the household of so-and-so, we dissolve and seek such-and-such a matter of grace and blessing, may we be enveloped in the protective qi of the Dao.\"* Let this be diligently observed as decreed.\n\nThe Most High Lord Lao declares: The method for ritual feasts prescribes three courses: first a light repast, then wine, and finally rice. In this age, many cannot prepare three courses, so wine may come first, with a limit of five *sheng*. Let this be diligently observed as decreed.\n\nThe Most High Lord Lao declares: When men and women receive registers and are appointed as officials, they present memorials to the celestial bureaucracy. Those who align with sincerity shall not be deluded by the myriad evils. They should understand themselves as living officials and servants—how could Daoist households deceive or transgress against those with such duties? Daoist officials perform sacrifices and aid, yet the ignorant and benighted transmit false traditions, self-appointing and administering registers, invoking and wearing the generals of the Thousand Divisions, along with their attendant soldiers, causing confusion. Such false invocations of soldiers for protection are entirely baseless. They may only perpetually wear the insignia of their appointed office. Those who commune with spirits and attain the Dao may encounter immortal officials. Those who receive registers and appointments shall not have five or three attendants or soldiers assigned to them. Yet worldly fools, imitating one another in self-appointment—how could there possibly be hundreds of thousands of layers of generals, soldiers, and guardians? From this day forward, all past practices in this regard shall cease and no longer be followed. Let this be diligently observed as decreed.",
      "overlap_context": "’s recitation of the pledge states: Daoist households that do not practice the statutes and methods, fail to diligently maintain the incense and flame, dispel disasters, avert misfortunes, or address illnesses—yet still come and go with anxieties about officials, strange omens, or various phenomena—shall not be permitted to make protective vows.\n\nWhy is this so? If a household embraces the Dao seeking blessings, it is a misguided endeavor. Only after first submitting a petition may they proceed.",
      "start_char": 2684,
      "end_char": 3296,
      "start_sentence": 102,
      "end_sentence": 132,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.362061977386475,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\老君音诵戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "老君曰：请客就会，人习严整衣服，如生官天子殿会，恭肃共同。 明慎奉行如律令。 老君曰：道民奉户师，如生民事官等，言则称道民。 明慎奉行如律令。 老君曰：其受治箓，诚之人弟子，朝拜之喻，如礼生官妆吏，礼法等同。 明慎奉行如律令。 老君曰：道官祭酒，授人职治符箓，但与其道。 受佩之后，不能精进，违科犯约，用行颠倒，奸怨非法，游行民间，读伪科律，诈惑万端，世间不奉。 道之家民，有疾病危困，辄便改动我道者，当与治差。 愚人无智，辄便动移，操米束薪，投户治病，谓病当差，返受死亡。 死亡之后，先以功变，所还本属，辄即为民。 然病者得差，便言得道恩福，言道有神，唱告於世，世人闻之，有丧祸变佐县官，复有改属归化之者。 户口渐多，而户生祭酒，颠倒无常，用行逆节，淫盗杀生，体性短少，逼迫恐动，衒神卖道。 其於无则诈见老君，兼复感悟，如是神教语，致使民心怀叹恨积。 有复道官，我俱奉户主，何以不如他师，奉事礼拜，使人有暂正，欲更就明贤，言科法难犯。 如此之徒，毒可检校，其衰祸阪运，命有长短，自有一定，非是愚人道官所能延远。 诈惑之人，浊乱道法，若有此辈，此诸官参详。 所集化户作厨会，取民辞状，道官连名表章，听民改属，民不得辄自移叛。 明慎奉行如律令。 老君曰：吾观视世问凡愚，祭酒化户，领民上章，奏上练文书，多者十纸五纸，少者三纸二纸。 ．多之以少，都无头绪，万亿章奏，达者无一。 何以尔者？",
      "translated_text": "The Lord Lao said: When inviting guests to assemble, people should attire themselves with solemn dignity, as if attending an audience in the celestial palace of the Son of Heaven, all reverent and respectful together. Let this be diligently observed as decreed.\n\nThe Lord Lao said: Daoist followers serving their household masters shall do so as commoners serve officials, addressing themselves as \"Daoist followers.\" Let this be diligently observed as decreed.\n\nThe Lord Lao said: Those who receive registers of governance—sincere disciples—shall, in their morning and bowing audiences, conduct themselves with the same ritual propriety as officials and clerks in ceremonial attire, adhering equally to ritual and law. Let this be diligently observed as decreed.\n\nThe Lord Lao said: Daoist officials and libationers who confer registers of governance and office upon others shall impart only the Dao. After receiving and wearing these registers, if one fails to advance with diligence, violates precepts, breaches covenants, acts perversely, harbors malice, or engages in unlawful conduct, wandering among the people and reciting false precepts to deceive in myriad ways, such a one shall not be upheld in the world.\n\nAmong the households and followers of the Dao, when afflicted by illness, peril, or distress, those who rashly alter my Dao shall be corrected and healed. Foolish and witless, they recklessly shift and change, offering bundles of grain and firewood to household masters to treat illness, claiming recovery is certain—only to meet death instead. After death, their prior merits are transformed, and they revert to their original status as commoners.\n\nYet when the sick recover, they claim it as the grace and blessing of the Dao, proclaiming the Dao’s divine power and broadcasting it to the world. Upon hearing this, those who suffer misfortune or calamity turn to local officials for aid, while others change their affiliation and submit to conversion. Households gradually multiply, but the household libationers, in their perversity and inconsistency, act contrary to proper conduct—indulging in debauchery, theft, and killing, their nature deficient and their actions coercive and intimidating, peddling the divine and trafficking the Dao.\n\nSome falsely claim to have seen the Lord Lao, or feign inspiration, speaking as if by divine instruction, thereby sowing sighs and resentments among the people. Others, though they too serve household masters, ask, \"Why do we not compare to other masters?\" They demand reverence and worship, offering fleeting rectitude, then seek out the wise and enlightened, claiming the precepts and laws are too strict to transgress.\n\nSuch deceivers must be examined and restrained. The decline of fortune, the turn of misfortune, and the length of life are all predetermined—none can be prolonged by the machinations of foolish Daoist officials. Those who deceive and disrupt the Dao’s laws—if any such exist—shall be scrutinized by all officials.\n\nWhen gathering converted households for communal feasts, take their sworn statements, and let Daoist officials jointly submit memorials to permit households to change affiliation. Followers shall not rashly transfer or rebel on their own. Let this be diligently observed as decreed.\n\nThe Lord Lao said: I observe that among the world’s common and foolish, libationers who convert households and lead followers in submitting memorials present documents of refinement—some ten or five sheets, others three or two. Yet whether many or few, all lack coherence. Of the myriad memorials submitted, not one reaches its destination. How can this be?",
      "overlap_context": "e. Those who commune with spirits and attain the Dao may encounter immortal officials. Those who receive registers and appointments shall not have five or three attendants or soldiers assigned to them. Yet worldly fools, imitating one another in self-appointment—how could there possibly be hundreds of thousands of layers of generals, soldiers, and guardians? From this day forward, all past practices in this regard shall cease and no longer be followed. Let this be diligently observed as decreed.",
      "start_char": 3297,
      "end_char": 3882,
      "start_sentence": 133,
      "end_sentence": 154,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.46225929260254,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\老君音诵戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "土地真官，典事主者，惧罪相连，覆停稽违。 吾令并出音诵歌诚，宣勑诸官。 章书之法，如似生官文书，可得达理。 凡愚道官，不练章表奏，不就於明能学习练法。 世间道官，迁达亡人度星，作为二十、三十纸，千万美说於事，不如修谨善行，斋练苦身，香火自缨，百日功建，为先亡父母迁度魂灵。 月月单章，言达斋功，胜於千通度星游说之事，斋功不达，无有感彻之理。 先斋立功，却上度星章，无有杂色、米丝、纸笔，正为先古集贤会，烧香拔免亡人，最上可不度星。 烦道不至，至道不烦，从今以后，思寻诵诚。 明慎奉行如律令。",
      "translated_text": "The earthly true officials, those who oversee affairs, fear the chain of guilt and thus suppress, delay, or disobey. I now command that proclamations of sincerity be chanted and sung, and all officials be admonished. The method of memorials and documents should resemble those of living officials—only then can they reach their proper destination and be governed by reason.\n\nFoolish Daoist officials do not refine their memorials and petitions, nor do they seek out the bright and capable to study and practice the refined methods. Among the world’s Daoist officials, some compose twenty or thirty sheets for the deliverance of the deceased, weaving countless fine words about the matter. Yet this is not as good as cultivating reverent good conduct, fasting and refining the body, kindling incense and binding oneself in devotion, and establishing a hundred days of merit—all for the sake of the departed parents, to deliver and ascend their souls.\n\nMonthly single-sheet memorials reporting fasting merits surpass a thousand petitions for deliverance through starry rites. If fasting merits do not reach their mark, there can be no principle of resonance or penetration. First establish merit through fasting, then submit petitions for deliverance—without any extraneous items like rice, silk, paper, or brushes. The most ancient assemblies of the worthy were simply for burning incense and redeeming the dead; the highest way does not require deliverance through stars.\n\nWhat is troublesome does not reach the Dao; what reaches the Dao is not troublesome. From now on, reflect upon and recite these admonitions. Let this be diligently observed as decreed.",
      "overlap_context": "rmit households to change affiliation. Followers shall not rashly transfer or rebel on their own. Let this be diligently observed as decreed.\n\nThe Lord Lao said: I observe that among the world’s common and foolish, libationers who convert households and lead followers in submitting memorials present documents of refinement—some ten or five sheets, others three or two. Yet whether many or few, all lack coherence. Of the myriad memorials submitted, not one reaches its destination. How can this be?",
      "start_char": 3882,
      "end_char": 4119,
      "start_sentence": 155,
      "end_sentence": 163,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.851876974105835,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\老君音诵戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "老君曰：道官、箓生、男女民，烧香求愿法：入靖东向恳，三上香讫，八拜，便脱巾帽，九叩头，三搏颊。 满三讫，启言：男官甲乙，今日时烧香，愿言上启。 便以手捻香着炉中，口并言：愿甲乙以年七以来过罪得除，长生延年。 复上香，愿言：某乙三宗五祖、七世父母、前亡后死，免离苦难，得在安乐之处。 后上香，言：愿门内大小口数，端等无他利害，来钱出入滑易。 复上香，愿仕官高迁。 复上香，愿县官口舌疾病除愈。 一愿一上香，若为他人愿通，亦无苦十上、二十上、三十上，随愿。 斋日六时烧香，寅午、戌亥、子丑是六时。 非斋日，朝暮。 辰巳之日，天清明，夜半北向悔过，向天地叩头百下三十六，搏颊三过，三百下以为常则。 先绿福深者，通神在近，先绿福浅者，八年得仙。 明慎奉行如律令。 老君曰：三会日，道民就师治。 初上章籍时，於靖前南正北向行立定位，各八拜、九叩头、九搏颊。 再拜，伏地请章籍讫，然后朝贺师。 明慎奉行如律令。 老君曰：道官祭酒，修行之法，复历民间，东西南北，行来出入，直身直面，一向直去，不得左右顾盼。 到民家，不得妄有瞋怒，有呵谴食饮，好恶床席，舍庐众杂，论说是非。 不可得先到贵豪富家苦顾，历民仪，先到寒贫家，教诲求福，使科约具备。 明慎奉行如律令。 老君曰：男女箓生及道民，家有奴婢，不得唤奴婢，当呼字。 若有过事，不得纵横朴打，但以理呼在前，语甲乙：汝有此事，应得杖罚，令受之。 若责数，奴婢自当札罪，无有怨恨之心。 道官道民，出言吐气，不得言说死事，此道民之大忌。 明慎奉行如律令。 老君曰：世间有承先父祖事道，自作一法，家宅香火。 复有承先祖作祭酒之官者，民户无知，言父死子系， 更不正属。 户师民氓，同淫祠邪，令众杂邪，令非一仿言奉道。 见他官政治祭酒，使复礼拜言：我是道民，意欲就正，复惧裹神，与之灾考。 如此之人，为请作道会，满三约正诚，若不从令，勿复重请。 如此之徒，奸情不已，非是天民，不如请诸不奉道之民。 何以尔者？ 等是天民，统一道治，然则别属，有参会更好，岂比之奉道无师而有邪心乎？ 道官祭酒，宜以参会，更言据是，民可请为客，此乃违失事多，宜如详酌。 若请为客，以刑律论。 明慎奉行如律令。 老君曰：道民求福愿厨，先刺客斋，上中下斋随意，明当设会。 今日请客来在主人家中宿，诸求愿还，官众共保乃行，出无他适。 鸡呜至日出，尽皆上厨之列，来致仙官。 唯解先亡厨，平旦至日中为限。 若人士从愿到官，一切郡县，及以公侯卿相伯子男封土，随意欲设厨，可作耳求宰。 民得腹心，土居安宁，风雨时节，随意而设，无有先科。 今不限人头数，不设亦复无苦，但精勤香火。 明慎奉行如律令。 老君曰：道气百千万重，自从开辟，黄燧之治，门有仙圣。 从今以来，人伪道荒，经书舛错。 后人诈伪，仙经图书，人人造法，天下经方，百千万亿，草药万种，万药百数。 后人乐道长生，循放#4无效者何？ 然愚人意短，不达至妙，长生至道。 仙圣相传，口诀授要，不载於文籍，自非斋功，念定通神，何能招致乘风驾龙，仙官临顾，接而升腾，服食草药、石药，服而得力之者，此则仙人奏表上闻，遣仙人、玉童、玉女来下临。",
      "translated_text": "Lord Lao said: For Daoist officials, register initiates, and lay men and women, the method of burning incense to make vows is as follows: Enter the oratory, face east with sincerity, offer incense three times, then perform eight bows. Remove your headscarf and hat, kowtow nine times, and strike your cheeks thrice. After completing these three sets, declare: \"Officer so-and-so, on this day and hour, burns incense and wishes to make a solemn petition.\" Then take the incense in hand, place it in the censer, and say aloud: \"May so-and-so’s transgressions from the age of seven onward be absolved, and may they attain longevity and extended years.\" Offer incense again and vow: \"May so-and-so’s three clans, five ancestors, seven generations of parents—those who have passed before and those who have died after—be delivered from suffering and dwell in peace and bliss.\" Offer incense once more and say: \"May all members of this household, great and small, remain free from harm, and may their income and expenditures flow smoothly.\" Offer incense again and vow for official promotion. Offer incense once more and pray for the resolution of disputes, illnesses, and ailments among local officials. Each vow is made with a separate offering of incense. If making vows on behalf of others, there is no fixed limit—ten, twenty, or thirty offerings may be made as the vow requires. On fasting days, incense is burned at the six hours: *yin*, *wu*, *xu*, *hai*, *zi*, and *chou*. On non-fasting days, incense is offered at dawn and dusk. On *chen* and *si* days, when the heavens are clear, repent at midnight facing north, kowtow one hundred times in sets of thirty-six, strike the cheeks three times, and perform three hundred kowtows as a regular practice. Those whose accumulated merit runs deep will draw near to communion with the divine; those whose merit is shallow will attain immortality in eight years. Let this be diligently observed as decreed.\n\nLord Lao said: On the three assembly days, Daoist adherents shall present themselves to their masters for instruction. When first submitting petitions and registers, stand in the oratory facing south with the master to the north, each in their proper position. Perform eight bows, nine kowtows, and strike the cheeks nine times. Bow again, prostrate, and request the petitions and registers. Then pay respects to the master. Let this be diligently observed as decreed.\n\nLord Lao said: For Daoist officials and libationers, the method of cultivation while traveling among the people in the four directions is as follows: Walk with an upright posture, face forward, and proceed directly without glancing left or right. Upon entering a household, do not give way to anger or reproach. Do not criticize their food, drink, beds, or dwellings, nor engage in idle chatter or debate right and wrong. Do not first visit the homes of the wealthy and powerful out of partiality, nor neglect the proper order of visits. Instead, go first to the homes of the poor and humble, instruct them in seeking blessings, and ensure all rituals and precepts are fully observed. Let this be diligently observed as decreed.\n\nLord Lao said: Daoist register initiates and lay adherents who have servants must not address them as \"servant\" but by their given names. If they commit an offense, do not beat them arbitrarily; instead, summon them and explain: \"You have committed this transgression and deserve punishment. Accept it.\" If the reprimand is just, the servant will acknowledge their fault without resentment. Daoist officials and lay adherents must not speak of death in their words or breath, for this is a grave taboo for Daoist adherents. Let this be diligently observed as decreed.\n\nLord Lao said: In the world, there are those who inherit their fathers’ or ancestors’ practice of the Dao, creating their own methods and household rituals. Others inherit the office of libationer from their ancestors. The common people, being ignorant, claim that when a father dies, the son succeeds him, without proper affiliation. Household masters and common folk alike indulge in licentious and heterodox worship, introducing various corruptions and falsely claiming to uphold the Dao. When they see a properly ordained libationer, they bow and say: \"I am a Daoist adherent and wish to submit to your guidance, but I fear offending the spirits and bringing calamity upon myself.\" Such people may request to hold a Daoist assembly. After three gatherings to establish sincerity, if they still refuse to comply, do not invite them again. These deceitful individuals persist in their ways; they are not true followers of the Dao. It would be better to invite those who do not claim to uphold the Dao at all. Why is this? All are subjects of Heaven, governed by a single Dao. Yet if they are of a different affiliation, it is better to include them in assemblies than to tolerate those who claim to uphold the Dao without a master and harbor heterodox intentions. Daoist officials and libationers should include them in assemblies and treat them as guests. However, such arrangements often lead to many errors and require careful consideration. If they are treated as guests, they shall be judged according to the law. Let this be diligently observed as decreed.\n\nLord Lao said: When Daoist adherents seek blessings through offering feasts, they must first purify themselves through fasting. The fast may be of high, middle, or low grade, as they choose, and the assembly shall be held the following day. On the day of the feast, invite guests to stay overnight in the host’s home. After all vows have been fulfilled, the officials and assembly shall collectively ensure the proceedings, and no one shall depart for other engagements. From cockcrow until sunrise, all shall take their places in the kitchen to welcome the immortal officials. Only for the feast of the departed ancestors is the time extended from dawn to noon. If a person of rank or office makes a vow and seeks official recognition, or if it involves commanderies, counties, dukes, ministers, or nobles of any rank, the feast may be held as they wish, including animal sacrifices. The people shall enjoy peace, the land shall be secure, wind and rain shall come in due season, and feasts may be held as desired without prior restrictions. There is no limit to the number of attendees, nor is it required to hold a feast at all. Simply maintain diligent incense offerings. Let this be diligently observed as decreed.\n\nLord Lao said: The qi of the Dao is layered in countless folds. Since the beginning of creation and the reign of the Yellow Thearch, gates have had immortals and sages. From this time onward, human deceit has flourished, and the Dao has declined; scriptures and texts have become corrupted. Later generations, in their fraudulence, have fabricated immortal scriptures and diagrams. Countless methods and prescriptions fill the world—ten thousand herbs, a hundred thousand remedies. Yet why do those who delight in the Dao and seek longevity fail to achieve it? The foolish, with their limited understanding, cannot grasp the subtleties of the supreme Dao of immortality. The transmission of the Way from immortal to sage is passed down through oral instructions and essential secrets, not recorded in written texts. Without the merit of fasting, focused meditation, and communion with the divine, how can one summon the winds and ride the dragons, have immortal officials descend to visit, be received and ascend on high? Those who consume herbal and mineral medicines and gain efficacy from them—these are the ones whose petitions are heard above, and who are sent immortal youths and jade maidens to attend them.",
      "overlap_context": "r penetration. First establish merit through fasting, then submit petitions for deliverance—without any extraneous items like rice, silk, paper, or brushes. The most ancient assemblies of the worthy were simply for burning incense and redeeming the dead; the highest way does not require deliverance through stars.\n\nWhat is troublesome does not reach the Dao; what reaches the Dao is not troublesome. From now on, reflect upon and recite these admonitions. Let this be diligently observed as decreed.",
      "start_char": 4120,
      "end_char": 5379,
      "start_sentence": 164,
      "end_sentence": 215,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.16708159446716,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\老君音诵戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "天官神药，参入分数，一草一人，得力一石。 一人得力，服气方法，亦俱等同。 今世人岂能达此理乎？ 不降仙人，何能登太清之阶乎？ 而案药服之，正可得除病寿终，攘却毒气，瘟疫所不能中伤。 毕一世之年，可兼谷养性，建功斋靖．解过除罪。 诸欲修学长生之人，好共寻诸诵诫建功，香火斋练，功成感彻之后，长生可克。 抱朴子者，未明益世，掬合前贤诸家经方，造经劝仙，内外卷首言仙之可得，可开悟人心。 承前多有遗经，亦复不妄造出意，不犯改经诈说之罪。 造经劝仙，功过自保，补后身当得仙人之阶。 诸有修道之人，勿复承按前人伪书经律。 今世人习读美经典，可益得身，朝但富贵，为子孙资荫耳。 无有长生登仙之阶，欲求生道为可先读五千文，最是要者。 明慎奉行如律令。 老君曰：靖舍外，随地宽窄，别作一重篱障壁，东向门。 靖主人入靖处，人及弟子尽在靖外。 香火时法，靖主不得靖舍中饮食及着鞋靺，入靖坐起言语，最是求福大禁。 恐凡人入靖有取，物尽皆束带。 明慎奉行如律令。",
      "translated_text": "The celestial officials’ divine medicines, when their proportions are precisely measured—one herb for one person—yield the efficacy of a hundredweight. When one person gains efficacy, the methods of ingesting qi are likewise equivalent. How can people of this world comprehend such principles? Without the descent of immortals, how can one ascend the steps of the Great Clarity? Yet by preparing and consuming these medicines, one may indeed dispel illness, prolong life to its natural end, ward off noxious qi, and render oneself invulnerable to pestilence. One may complete the span of a lifetime, supplementing it with grain to nourish one’s nature, establishing merit through fasting and purification, and dissolving transgressions to erase sins.\n\nThose who wish to cultivate and study the Way of longevity should diligently seek out the recited precepts and establish merit, engaging in incense offerings, fasting, and refinement. Only after their merit is complete and their sincerity moves the heavens can they attain longevity. The *Baopuzi*, without seeking to benefit the world, has gathered and synthesized the medical formulas of former sages from various schools to compose this scripture and exhort the pursuit of immortality. Its inner and outer chapters begin by affirming that immortality is attainable, thereby awakening the hearts of people. It inherits many lost scriptures yet does not recklessly fabricate or alter their teachings, thus avoiding the transgression of falsifying scriptures. In composing this scripture to exhort the pursuit of immortality, its merit or fault will be self-evident, and in future lives, one may ascend the ranks of immortals.\n\nThose who cultivate the Dao must no longer rely on the spurious scriptures and precepts of earlier generations. The texts people study today, though deemed fine classics, may benefit the body and bring morning wealth and honor, serving as a legacy for descendants—but they contain no steps to attain longevity or ascend as immortals. Those who seek the Way of life must first read the *Five Thousand Character Classic*, for it is the most essential. Be clear and cautious in upholding it as you would a sacred decree.\n\nLord Lao said: Outside the purification chamber, according to the available space, construct an additional layer of fencing or walls with a gate facing east. The master of the purification and their disciples must remain outside the chamber. During the time of incense offerings, the master must not eat, drink, or wear shoes within the chamber. When entering to sit or speak, this is the greatest prohibition for seeking blessings. Lest ordinary people enter and take things, all objects must be secured. Be clear and cautious in upholding it as you would a sacred decree.",
      "overlap_context": "o sage is passed down through oral instructions and essential secrets, not recorded in written texts. Without the merit of fasting, focused meditation, and communion with the divine, how can one summon the winds and ride the dragons, have immortal officials descend to visit, be received and ascend on high? Those who consume herbal and mineral medicines and gain efficacy from them—these are the ones whose petitions are heard above, and who are sent immortal youths and jade maidens to attend them.",
      "start_char": 5379,
      "end_char": 5783,
      "start_sentence": 216,
      "end_sentence": 234,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.3850679397583,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\老君音诵戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "老君曰：道官道民，有死亡七日后解秽，家人为亡人散生时财物作会，随人多少，可参请俗民无苦为亡人过度设会。 功满三，复欲设会，随意。 能备可作，若不能备，无苦勤香火。 明慎奉行如律令。 老君曰：为亡人设会烧香时，道官一人，靖坛中正东向，箓生及主人亦东向，各八拜、九叩头，九搏颊，三满三过止。 各皆再拜恳，若人多者，亦可坐礼拜叩头，主称官号姓字，上启无极大道，万万至真无极大道。 以手捻香三上，着炉中，口并言为亡者甲乙解罪过，烧香愿言。 余人以次到坛前恳上香如法尽，各各讫。 靖主上章，余人当席拜主人，东向叩头上章讫，设会。 解坐讫，靖主入靖启事，为主人求愿收福，言当时，主人束向叩头，坐罢出时，客向靖八拜而归家焉。 主人一宿之中，满三过烧香。 明慎奉行如律令。 老君曰：道民家有疾病，告归到宅，师先令民香火在靖中。 民在靖外，西向散发叩头，谢写愆违罪过，令使皆尽，未有藏匿，求乞原赦。 若过一事不尽，意不实，心不信法，章奏何解？ 师亦自别启事云：民某甲求乞事。 及病者亦道首过。 若过尽者，师自得好感应； 若过不尽，师亦不得好感应报。 首过时，为可并行符承衔。 民首辞上章，一日三过。 上三日后，病人不降损，可作解先亡谪罚章。 病家昼则向靖叩头，夜则北向，向天地叩头首过，勿使一时有阙。 病家惶怖，欲有所说钱财厨愿，勿听之。 若能备厨，请客三人、五人、十人以上，随人多少，按如科法设会。 会时，客主人，#5病者考礼拜烧香，求乞救度。 病者设会讫，客归到家，为病者烧香叩头，一宿之中，满三过，以病者救度礼叩头，烧香同法。 明慎奉行如律令。 老君曰：道民不慎科法，淫犯杀生，宜校脏物，计钱使还民家，自市厨具，师得与表章解散。 当作会时，主人众客前向香火，八拜叩头，三十六搏颊，满三讫，再拜。 手捻香着炉中，并告言：某甲启太上大道，甲乙是肉人无知，奉科许祠某官求其事，并复有以塞请之者，今依科输赃，直为厨具，请客证明。 以从今以后，生死付道，不敢以前为比。 乞愿得在赦格之例，蒙恩生活，道气哀念。",
      "translated_text": "Lord Lao said: Daoist officials and Daoist followers, upon the death of a family member, shall perform purification rites seven days later. The family of the deceased shall distribute living-world goods and hold a ritual feast according to the number of attendees, inviting laypeople to participate without hardship in order to assist the deceased in crossing over. After three such rituals are completed, if they wish to hold another, they may do so at their discretion. If they are able to prepare adequately, they should; if not, they need not trouble themselves with incense offerings.\n\nBe clear and cautious in upholding it as you would a sacred decree.\n\nLord Lao said: When holding a ritual feast for the deceased and offering incense, one Daoist official shall stand in the center of the purification altar, facing east. The register-holder and the host shall also face east, each performing eight bows, nine prostrations, nine breast-strikings, and repeating this three times. Each shall then bow again earnestly. If there are many attendees, they may perform seated bows and prostrations. The host shall state their official title, surname, and given name, and address the Boundless Great Dao, the myriad myriad Perfected of the Boundless Great Dao. Taking incense in hand, they shall offer it three times into the censer, reciting: \"For the deceased, so-and-so, I dissolve their transgressions and offer this incense with my vows.\" The others shall then approach the altar in turn, earnestly offering incense according to the proper method until all have finished. The master of the purification shall present the memorial, while the others shall bow to the host from their seats, facing east, and prostrate themselves after the memorial is presented. The ritual feast shall then commence. After the feast concludes, the master of the purification shall enter the chamber to report the proceedings, seeking blessings for the host. At that moment, the host shall bow and prostrate themselves. When the gathering disperses, the guests shall bow eight times toward the purification chamber before returning home. The host shall burn incense three times throughout the night.\n\nBe clear and cautious in upholding it as you would a sacred decree.\n\nLord Lao said: If a Daoist follower’s household has a sick member, upon returning home, the master shall first instruct the follower to offer incense in the purification chamber. The follower shall stand outside the chamber, facing west, with hair unbound, prostrating themselves to confess and repent all transgressions and offenses, ensuring nothing is concealed or withheld, and seeking forgiveness. If even one matter is left unconfessed, or if their intent is insincere and their faith in the method lacking, how can the memorial dissolve their transgressions? The master shall also separately report: \"Follower so-and-so seeks such-and-such.\" The sick person shall also confess their transgressions. If all transgressions are confessed, the master shall receive favorable responses; if not, the master shall receive no favorable response. During the confession, talismans may be employed concurrently. The follower shall present the memorial three times a day. If after three days the sick person shows no improvement, a memorial may be presented to dissolve the retribution of deceased ancestors. The sick person’s family shall prostrate themselves toward the purification chamber by day and face north toward heaven and earth by night, confessing their transgressions without fail at any hour. If the family, in their distress, wishes to make vows involving money, food, or offerings, they shall not be heeded. If they are able to prepare a feast, they may invite three, five, ten, or more guests, according to their means, and hold a ritual feast in accordance with the regulations. During the feast, the guests and host shall bow, prostrate themselves, and offer incense, seeking deliverance for the sick person. After the feast concludes, the guests shall return home and burn incense, prostrating themselves three times throughout the night, performing the same rites of deliverance for the sick person.\n\nBe clear and cautious in upholding it as you would a sacred decree.\n\nLord Lao said: If Daoist followers transgress the regulations through licentiousness or killing, they shall calculate the value of the illicit goods and return them to the lay household, purchasing ritual feast supplies themselves. The master shall then present a memorial to dissolve their transgressions. During the ritual feast, the host and guests shall face the incense, perform eight bows and prostrations, thirty-six breast-strikings, and repeat this three times before bowing again. Taking incense in hand, they shall place it in the censer and declare: \"So-and-so addresses the Most High Great Dao: I, so-and-so, being but a mortal of limited understanding, have followed the regulations in offering sacrifices to such-and-such an official for such-and-such a matter, yet I have also made improper requests to fulfill my desires. Now, in accordance with the regulations, I return the illicit goods to provide for the ritual feast and invite guests as witnesses. From this day forward, I entrust my life and death to the Dao and dare not repeat my former actions. I humbly seek to be included in the amnesty and receive the grace of life, that the Dao’s qi may take pity on me.\"\n\nBe clear and cautious in upholding it as you would a sacred decree.",
      "overlap_context": "le space, construct an additional layer of fencing or walls with a gate facing east. The master of the purification and their disciples must remain outside the chamber. During the time of incense offerings, the master must not eat, drink, or wear shoes within the chamber. When entering to sit or speak, this is the greatest prohibition for seeking blessings. Lest ordinary people enter and take things, all objects must be secured. Be clear and cautious in upholding it as you would a sacred decree.",
      "start_char": 5784,
      "end_char": 6606,
      "start_sentence": 235,
      "end_sentence": 267,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.43940782546997,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\老君音诵戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "明慎奉行如律令。 老君曰：男女道官，‘浊乱来久，有作祭酒之官，积勤累世贪浊，若身化领求复经数余载，赃钱通说，贪秽入己，此是前造，诈言经律。 此等之人，尽在地狱。 若有罪重之者，转生虫畜，偿罪难毕。 吾故出音乐新正科律，依其头领，欲使信道，以通人情，清身洁己，与道同功。 太上清气，当来覆护，与民更始，改往修来，一从新科为正。 明慎奉行如律令。 老君曰：道气百千万重，前贤后圣，修学长生，尽遇仙官，人人各得一重之气，而得升度之后，终不载於文籍。 房中之教，通黄赤经契，有百二十之法。 步门庭之教，亦无交差一言。 自从系天师道陵升倦以来，唯经有文在世解者，为是何人？ 得长生飞仙者，复是何人？ 身中至要，导引之诀，尽在师口。 而笔谍之教，以官人心，若开解信之者，执经一心，香火自缨，精练功成，感悟真神，与仙人交游，至诀可得。 今后人诈欺谩道，爱神润饬，经文改错，法度妄造，无端作诸伪行，遂成风俗，劝教天下。 男女受佩契令，愚暗相传，不能自度，而相领弟子，惑乱百姓，犯罪者众，招延灾考，浊欲道教，毁损法身。 吾诵诚断改黄赤，更修清异之法，与道同功。 其男女官箓生佩契黄赤者，从今诫之后，佩者不吉。 若有不慎之人，所居止土地真官，注气靖治，典者使者，当自校录，吾与之灾考，死入地狱。 若输转精魂，虫畜猜羊而生，偿罪难毕。 吾观世人，夫妻修行黄赤，无有一条按天官本要所行，专作浊秽，手犯靖庐治官禁忌，而天官、仙人、玉女，尚不犯治室之法。 吾今以黄赤贪浊，道教来久无有，真正愚暗相传，尽各不得其中正。 时有清真洁素之人，无经律错乱，吾尽欲灾除此辈之人，不令而犯诛诮之暴。 是以先令诚约，迁遣一教。 然房中求生之本经契，故有百余法不在断禁之列。 若夫妻乐法，但葱进问清正之师，按而行之，任意所好，传一法亦可足矣。 今世浊恶，有形之人，流转精神，罪绿难消，是以诚约。 要须斋功，与返为始，雪罪除愆，乃得感悟真仙。 男女官努力修斋，寻诸诵诚，香火建功，仙道不远。 明慎奉行如律令。 老君曰：从系天师升仙以来，旷官真职，道荒人浊。 后人诸官，愚暗相传，自署治箓符契，气候倒错，不可承准。 吾本授二十四治，上应二十八宿，下应阴阳二十四气，授精进祭酒，化领民户。 道陵演出道法，初在蜀土一州之教，板署男女道官，因山川土地郡县，按吾治官靖庐亭宅，与吾共同领化民户，劝恶为善。 阳平山名，上配角宿，余山等同。 而后人道官，不达幽冥情状，故用蜀土盟法，板署治职。 勑令文曰：今补某乙鹤呜、云台治，权时箓署治气职，领化民户，质对治官文书，须世太平，遣还本治。 而九州土地之神，章表文书，皆由土地治官真神，而得上达。 有今闻道官章表时，请召蜀土治宅君吏，他方土地之神，此则天永地隔，人鬼胡越，吾本下宿治号令之名，领化民户。 道陵立山川土地宅治之名耳，岂有须太平遣还本治者乎？ 从今以后，诸州郡县，男女有佩职箓者，尽各诣师，改宅治气。 按今新科，但还宿官，称治为职号，受二十四治。 中化契令者，发号言补甲乙正中官，真气角宿治。",
      "translated_text": "Uphold it with clarity and caution as you would a sacred decree.\n\nThe Most High Lord Lao declares: Male and female Dao officials, \"having long been mired in defilement, have assumed the office of Libationer. Through accumulated diligence over generations, they have grown avaricious and impure. If, after their bodies have transformed and they have sought renewal over many years, they still engage in bribery and self-serving explanations, greedily hoarding filth for themselves, this is to fabricate falsehoods in the name of the scriptures and precepts. Such persons shall all descend into hell. Those whose sins are grave shall be reborn as insects or beasts, their debts of retribution never to be repaid. Thus, I now issue this renewed ordinance of music and rectification, aligning it with the heads of the teachings, so that those who believe in the Dao may harmonize with human sentiment, purify their bodies, and align their conduct with the Dao’s merit. The Most High’s pure qi shall henceforth shelter and protect them, allowing the people to begin anew, rectify past wrongs, and cultivate future virtue, all in accordance with the new ordinances as the standard.\"\n\nUphold it with clarity and caution as you would a sacred decree.\n\nThe Most High Lord Lao declares: The Dao’s qi is layered in hundreds, thousands, and myriad folds. The sages of old and the worthies to come, who cultivated and studied for immortality, all encountered immortal officials. Each person received a single layer of qi, and upon ascending and transcending, their names were never recorded in the registers. The teachings of the bedchamber, which encompass the *Huang-Chi* scriptures and covenants, comprise one hundred and twenty methods. The teachings of pacing the courtyard and thresholds likewise contain not a single word of deviation. Since the time when the Celestial Master Zhang Daoling wearied of his ascent, only those scriptures with extant explanations have remained in the world—yet who among them has attained longevity and ascension as a flying immortal? The most essential techniques of the body, the oral instructions of *daoyin*, all reside in the master’s words. The written teachings, however, are used to test the hearts of officials. If those who open and believe in them hold fast to the scriptures with single-minded devotion, their incense and flames will naturally flourish. Through refining their practice to completion, they shall awaken to the perception of true spirits, commune with immortals, and obtain the ultimate instructions.\n\nHenceforth, those who falsely deceive and mock the Dao, adorning themselves with divine favor and embellishing the scriptures, altering texts and fabricating precepts without cause, have established these counterfeit practices as custom, misleading the world. Men and women who receive and wear the covenants and ordinances, blindly transmitting them to one another, are unable to transcend themselves yet still lead disciples, confusing and deluding the common people. The number of offenders is great, inviting calamity and tribulation, polluting the Daoist teachings and damaging the Dharma-body. I now earnestly command that the *Huang-Chi* be abolished and reformed, and that pure and distinct methods be cultivated to align with the Dao’s merit. From this day of admonition forward, those male and female officials and registered disciples who wear the *Huang-Chi* covenants shall find no auspiciousness in doing so. If there are those who remain heedless, the true officials of the land where they reside shall record their qi and govern their misdeeds. The attending envoys shall examine and record their actions, and I shall visit calamity and tribulation upon them, consigning them to hell in death. If their refined spirits are reborn, they shall enter the bodies of insects or beasts—even swine or sheep—and their debts of retribution shall never be repaid.\n\nI observe that among the world’s people, husbands and wives who practice the *Huang-Chi* do not follow a single method according to the essential principles of the celestial officials. Instead, they engage in defilement and impurity, violating the prohibitions of the *Jinglu* governing officials with their hands. Yet even the celestial officials, immortals, and jade maidens do not transgress the laws of the governing chambers. Now, due to the greed and defilement associated with the *Huang-Chi*, the Daoist teachings have long been without true transmission. The blind have led the blind, and none have attained the correct middle path. There are, however, those who are pure, refined, and unsullied, who do not err in their adherence to the scriptures and precepts. I intend to eliminate such persons from calamity, sparing them from the violence of condemnation and reproach. Thus, I first issue this solemn covenant to reform and redirect the teachings. Nevertheless, the foundational scriptures and covenants of the bedchamber, which seek life’s essence, comprise over a hundred methods that are not subject to prohibition. If husband and wife delight in these methods, they need only inquire of a pure and upright master, follow the prescribed methods, and practice according to their preferences—even a single method will suffice.\n\nIn this defiled and evil age, embodied beings dissipate their spirits, and the threads of their sins are difficult to unravel. Thus, I issue this covenant. It is essential to undertake fasting and merit-making, returning to the beginning, wiping away sins and transgressions, so as to awaken to the perception of true immortals. Male and female officials, exert yourselves in cultivating fasts, seek out these solemn admonitions, establish merit through incense and flame, and the Dao of immortality shall not be far.\n\nUphold it with clarity and caution as you would a sacred decree.\n\nThe Most High Lord Lao declares: Since the time when the Celestial Master ascended as an immortal, the true offices of the Dao have been neglected, and the Way has withered while people have grown defiled. Later officials, blindly transmitting the teachings to one another, have self-appointed themselves to govern registers, talismans, and covenants, their qi and seasonal correspondences inverted and disordered, rendering them unfit for emulation. I originally conferred the Twenty-Four Treaties, which correspond above to the Twenty-Eight Constellations and below to the twenty-four qi of yin and yang, bestowing them upon the diligent Libationers to transform and lead the households of the people. Zhang Daoling expounded the methods of the Dao, initially establishing the teachings in the single province of Shu. He appointed male and female Dao officials, aligning them with the mountains, rivers, lands, commanderies, and counties, and in accordance with my governing officials, *jinglu* pavilions, and residences, he shared with me the task of leading and transforming the people, exhorting them to turn from evil and cultivate goodness. Mount Yangping’s name corresponds above to the Horn Constellation, and the other mountains follow likewise.\n\nYet later Dao officials, failing to comprehend the conditions of the unseen world, have employed the alliance methods of Shu, appointing themselves to governing offices. The edict’s text states: \"Now, so-and-so is provisionally appointed to the He-Ming and Yun-Tai Treaties, temporarily registering and governing the office of qi, leading and transforming the households of the people. Upon presenting documents to the governing officials, they shall await the era of Great Peace before returning to their original treaties.\" However, the spirits of the lands of the Nine Provinces, along with their memorials and documents, all ascend through the true spirits of the local governing officials. Yet now, when Dao officials present memorials, they summon the governing officials and clerks of the Shu treaties and residences, while the spirits of other lands remain distant and estranged. My original decrees for the hostel-treaties were intended to lead and transform the households of the people. Zhang Daoling merely established the names of the mountain, river, land, and residential treaties—how could there be a requirement to await Great Peace before returning to the original treaties?\n\nHenceforth, in all commanderies and counties, male and female officials who wear the registers of office shall each report to their masters to reform their residential treaties and qi. In accordance with the new ordinances, they shall return to their original hostel-officials, designating the treaties as their official titles and receiving the Twenty-Four Treaties. Those who transmit the covenants and ordinances shall issue proclamations, stating: \"So-and-so is appointed as the Correct Central Official of the True Qi of the Horn Constellation Treaty.\"",
      "overlap_context": "ch-and-such a matter, yet I have also made improper requests to fulfill my desires. Now, in accordance with the regulations, I return the illicit goods to provide for the ritual feast and invite guests as witnesses. From this day forward, I entrust my life and death to the Dao and dare not repeat my former actions. I humbly seek to be included in the amnesty and receive the grace of life, that the Dao’s qi may take pity on me.\"\n\nBe clear and cautious in upholding it as you would a sacred decree.",
      "start_char": 6606,
      "end_char": 7818,
      "start_sentence": 268,
      "end_sentence": 310,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.66963863372803,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\老君音诵戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "以亢宿、氏宿、房宿二十八，如法上章时，直言臣，而不得称真人。 若灵箓外官，不得称治号。 其蜀土宅治之号，勿复承用。 若系天师遗胤子孙，在世精循治教，领民化者，不得信用诸官祭酒； 为法律上章时，不得单称系天师位号，当称职号，名与诸官同等。 明慎奉行如律令。 老君曰：夫为道官、正治、祭酒，进善举贤，领受弟子，授人职治、诚箓、符契。 进一贤善，除过十年，求仙速达。 进一佞一恶，反罪十年，求仙求福，终不可得。 其投道门之民，欲为弟子者，当观望情性，与约诚相应者三年，体能修慎法教，精进善行，心无有退，志无倾邪，乃可授箓诚，纳为弟子。 明慎奉行如律令。 老君曰：中官正气宿治祭酒，得授人职箓诚，其箓生之人，不得妄授人诚箓。 若不领民户，受中治箓者，当受中治散气祭酒职。 若上灵官，不领民户，受外官散气祭酒职。 其外官祭酒治民者，坐会时百五十箓，下坐。 若中官治民，正气祭酒子息受治署中官。 中官宿治，散气祭酒在父民闻行章，称文治气上章。 若他官祭酒，民闻自治气上章。 若求生之人，一身自度，不化愚俗，不领民户，亦可直受中官上仙赤天七十五将军箓，生起亦在外治祭酒上。 明慎奉行如律令。 老君曰：道官道民，其先亡祖曾父母，幽谪不解，复注子孙。 若斋功不达，章书谬说，多言十通百通，无益於事，要先斋感彻之，后乃可章表证达。 斋功章书之法，不须多重，重烦浊天曹，不如不上斋。 满百日一斋功，达表章之日，兼能请贤，随多少人数设会，拯梂收福益仁。 若不能备者，但就师表章迁达亡人。 若祭酒者，日日可言，斋功满百日，就师表章。 明慎奉行如律令。 老君音诵诫经竟 ＃１此处疑有漏脱。 ＃２『方有当』疑为衍文。 ＃３『攻』疑当作『改』 字。 ＃４『放』当作『仿』。 ＃５此处疑有漏脱。",
      "translated_text": "When submitting memorials during the proper times for the constellations Kang, Di, Fang, and the Twenty-Eight Mansions, one may only address oneself as \"your servant\" and may not be styled as a \"Perfected Person.\" If one holds an external register as an official, one may not use the title of a *treaty*. The titles of the residential treaties of Shu lands shall no longer be employed. If descendants of the Celestial Master’s lineage remain in the world, diligently upholding the teachings of the treaties and guiding the people, they may not rely upon or employ various officials or Libationers. When submitting memorials in accordance with the law, they may not solely claim the title of the Celestial Master’s position but must use their official titles, equal in rank to other officials.\n\nProceed with caution and act in accordance with the statutes and ordinances.\n\nLord Lao said: Those who serve as Dao officials, Correct Treaties, or Libationers must promote the worthy and recommend the capable. When receiving disciples, conferring official treaties, registers of sincerity, and talismanic contracts, for every worthy and good person advanced, ten years of transgressions are erased, and the path to immortality is swiftly attained. For every sycophant or evil person advanced, ten years of retribution are incurred, and neither immortality nor blessings may be sought. Those among the people who seek entry into the Dao gate and wish to become disciples must first observe their temperament and disposition. Only after three years of mutual agreement in sincerity, when they have demonstrated the ability to cultivate the teachings with care, advance in virtuous conduct, maintain an unwavering heart, and hold no deviant intentions, may registers of sincerity be conferred and they be accepted as disciples.\n\nProceed with caution and act in accordance with the statutes and ordinances.\n\nLord Lao said: Central officials, Correct Qi Constellation Treaty Libationers, may confer official registers and contracts upon others. However, those who have received registers may not recklessly confer contracts upon others. If one does not govern households but receives the register of a Central Treaty, one shall receive the position of a Libationer of Scattered Qi of the Central Treaty. If one holds the position of a High Spirit Official but does not govern households, one shall receive the position of a Libationer of Scattered Qi of an External Office. External officials and Libationers who govern the people shall sit with one hundred and fifty registers during assemblies, occupying the lower seats. If a Central Official governs the people, the descendants of the Correct Qi Libationer shall receive the office of a Central Official. For Central Constellation Treaties, Scattered Qi Libationers shall, when submitting memorials on behalf of the people under their father’s governance, address them as \"civil treaty qi memorials.\" If other officials or Libationers govern the people, the people shall submit memorials under their own treaty qi. If one seeks personal salvation, self-cultivation, and does not transform the ignorant masses or govern households, one may directly receive the register of the Seventy-Five Generals of the Red Heaven of the Upper Immortals of the Central Office. In life, such a one shall rank above External Treaty Libationers.\n\nProceed with caution and act in accordance with the statutes and ordinances.\n\nLord Lao said: Among Dao officials and Dao followers, if the spirits of their deceased ancestors, grandparents, or parents remain bound in the underworld and afflict their descendants, when purification rituals fail to reach them and memorials contain errors or excessive claims—such as boasting of ten or a hundred successful petitions—these efforts will be of no benefit. First, one must ensure the purification ritual is thorough and effective; only then may memorials be submitted for verification and deliverance. The methods of purification rituals and memorials need not be overly elaborate. Excessive and burdensome petitions defile the celestial bureaus and are better left unsent. Conduct one purification ritual every hundred days. On the day memorials are submitted for deliverance, one may also invite the worthy, holding an assembly commensurate with the number of attendees to rescue the suffering and accumulate blessings and benevolence. If one cannot prepare adequately, one may simply submit memorials through one’s master to deliver the deceased. Libationers may do so daily. After completing a hundred days of purification rituals, submit memorials through one’s master.\n\nProceed with caution and act in accordance with the statutes and ordinances.\n\nThe recitation of Lord Lao’s Admonitory Sutra concludes.",
      "overlap_context": "male officials who wear the registers of office shall each report to their masters to reform their residential treaties and qi. In accordance with the new ordinances, they shall return to their original hostel-officials, designating the treaties as their official titles and receiving the Twenty-Four Treaties. Those who transmit the covenants and ordinances shall issue proclamations, stating: \"So-and-so is appointed as the Correct Central Official of the True Qi of the Horn Constellation Treaty.\"",
      "start_char": 7818,
      "end_char": 8543,
      "start_sentence": 311,
      "end_sentence": 343,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.830058336257935,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\老君音诵戒经.txt",
        "category": "戒律类"
      }
    }
  ]
}