{
  "source_id": "胎息经笺疏",
  "source_file": "chunked_daozang\\胎息经笺疏.json",
  "total_chunks": 17,
  "total_original_chars": 17112,
  "total_translated_chars": 96172,
  "total_translation_time": 491.49139499664307,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\胎息经笺疏.txt",
    "category": "藏外"
  },
  "full_translation": "**The Scripture of Embryonic Breathing**\n\nThe embryo forms from the concealed qi,\nAnd qi breathes within the formed embryo.\nQi enters the body to give life;\nSpirit departs from form to bring death.\nKnowing that spirit and qi can grant long life,\nFirmly abide in emptiness and non-being\nTo nurture spirit and qi.\nWhere spirit moves, qi moves;\nWhere spirit rests, qi rests.\nIf you desire long life,\nLet spirit and qi pour into one another.\nThe heart stirs no thought,\nNeither coming nor going,\nNeither exiting nor entering—\nNaturally, they remain constant.\nDiligently practice this,\nAnd it is the true Way.\n\nThe above scripture contains eighty-three characters in seventeen lines.\n\n**Preface to the Annotations and Commentaries**\n\nSince childhood, I have been plagued by illness and lacked the wisdom to align with things and delight in heaven. Constantly anxious about the realm of life and death, I have studied all manner of cultivation arts, Daoist and Buddhist teachings, hoping to prolong life, secure my form, and transcend to attain fruition.\n\nYet, reflecting on these many years, the more I learned, the more my practice sprawled, increasingly at odds with the principle of daily diminution. I was well aware of this.\n\nOn the twenty-fifth day of winter in 1951—fifteenth day of the twelfth lunar month—idle and without occupation, I pondered: after half a lifetime of Daoist study, what benefit have I gained? When impermanence arrives, how shall I respond? Startled, I resolved to rectify past errors and practice with utmost effort.\n\nBut what should my practice be based upon?\nCarefully considering the various Daoist texts, those that are false and erroneous need not be mentioned.\n\nAmong the rest, though not false or erroneous, some are excessively abstruse in their doctrines (such as the *Can Tong Qi* and *Wu Zhen Pian*), while others are fragmented and devoid of essentials (like the vast majority of texts in the *Daoist Canon*). Seeking one that could serve as a model for beginners, with content precise and concise enough to serve as a foundation for realization, perhaps none surpasses the *Classic of Embryonic Breathing*. Regrettably, the commentaries and Master Huan Zhen’s annotations are both inadequate. Thus, I resolved to consult the essential teachings of various schools and compile my own annotations, both to guide my own practice and to cross-verify with Esoteric Buddhist teachings. However, in recent years, my engagement in compiling medical texts and Buddhist scriptures has left this intention long deferred. Now, fortunately, both endeavors are largely complete, allowing me to finally undertake this task—such is the origin of these annotations.\n\nFurthermore, I note the words left by the Perfected Min Xiao Gen: *\"To delight in needless difficulty is to waste a lifetime; to indulge in strange and ostentatious practices is utterly futile. Only this ordinary Way holds the secret of returning to the source. In three hundred days, the garden is ever luminously clear.\"* How excellent these words are! They resonate deeply with my own heart.\n\nWhat the scriptures attest to reveals that among the nineteen Daoist texts of the *Daozong shu*, the *Xingming guizhi* conceals the \"Qi Cavity Section\" beneath its passages, where this segment is titled *The Embryonic Breathing Sutra of Patriarch Bodhidharma*. At first glance, its spuriousness is evident. Thus, when the Perfected Wu Chongxu cites the opening two lines in *The True Principle of Celestial Immortality*, he refers to it simply as the *Ancient Embryonic Breathing Sutra* without attributing an author. Since the *Xingming guizhi* was published in the Wanli era of the Ming, and *The True Principle* dates from the same period, this scripture may well have been fabricated by a Song or Yuan adept knowledgeable in the Dao, falsely ascribed to Bodhidharma.\n\n**The Aim of the Scripture**\nThe essence of this sutra is none other than Internal Alchemy. Internal Alchemy is the Yin Elixir, a concoction harmonized within one’s own body without reliance on external agents—also termed the Jade Fluid Returned Elixir (though the Southern School defines \"Jade Fluid\" as the post-foundation work of gathering medicine to form the Elixir, hence the distinction marked by \"also\"). In truth, it is the practice of cultivating one’s nature.\n\nWhile the fruition of Daoist practice is ultimately one, the entry points are manifold. Some cultivate alone, some rely on medicinal substances, some depend on crucibles and vessels, and some employ all three methods in varying degrees. Among those using vessels, some work solely with the Tiger, while others engage both Dragon and Tiger. Though the paths differ in depth, this stems from the varying root capacities and karmic virtues of practitioners. Yet, in the end, none can achieve great attainment without the convergence of the Three Families.\n\nIn this degenerate age, emulating the feats of Jingyang or Zhang Sanfeng is no longer feasible. The only recourse is to fulfill one’s nature to the utmost, ensuring that this shore’s affairs are complete so that the other shore may be readily traversed. This aligns with the words of the Perfected Wen Yi: *\"Though form and spirit are said to be difficult to perfect together, one must first fulfill one’s nature before completing one’s destiny.\"*\n\nYet, from ancient times to the present, most Dao seekers fail to distinguish between internal and external alchemy, leading to confusion and discord. They overlook that Yin and Yang differ as *within the body*, *of the same kind*, and *of the void*—hence the divergence in elixir methods: Jade Fluid, Golden Fluid, and the Mysterious Pearl. Thus, those who refine Jade may scorn Gold, those who refine Gold may dismiss Jade, and some, though versed in both, remain ignorant of the *Xuan Zhu*’s method of transforming form, achieving at best a corpse-liberation.\n\nRecently, Master Chen Yingning of Wan has clarified this tangle by defining Jade Fluid as the cultivation of the Dao and Golden Fluid as the refinement of the Elixir. He has carved a path of luminous clarity through the confusion, offering seekers a means to distinguish truth amid obscurity. This resonates deeply with my own heart—I am profoundly indebted! Without vast reading and transmission from a profound lineage, how could one grasp this?\n\nHere, I provisionally divide Yin and Yang into three categories—*within the body*, *of the same kind*, and *of the void*—though this is merely one perspective. In truth, the pure Southern School begins with *of the same kind*, progressing from shallow to deep, with each stage differing in method. The pure Northern School practices solitary refinement throughout, though even its \"solitary\" end is not truly solitary. The Eastern and Western Schools synthesize North and South, entering through the Northern School’s method and attaining fruition through the Southern School’s—such are the distinctions in lineage and method, which must not be overlooked.\n\nOther traditions, like that of Zhang Sanfeng, employ Dragon and Tiger at every step. Li Huiqing’s commentary on the *Cantong qi* and Weng Baoguang’s (Xue’s) commentary on the *Wuzhen pian* (among the Three Commentaries) align closely with this approach. Lu Ziye’s commentary on the *Wuzhen pian*, however, clearly follows the methods of both schools.\n\nInitially, I dismissed these dual approaches as inauthentic, but my study of Esoteric Buddhism revealed my earlier view to be that of a frog in a well. In sum, the Dao of self-cultivation has many gates—*\"Wherever there are willows, a horse may be tethered; every household’s door opens onto Chang’an.\"* With a true teacher and true instructions, every path can lead to fruition; it depends solely on the practitioner’s karmic conditions and the depth of their practice.\n\n**Annotations on the *Embryonic Breathing Sutra***\n\nThe ancient immortals said: *\"Embryo’ refers to the embryo of spirit; ‘breathing’ refers to the stilling of qi.\"* Thus, \"embryo\" denotes the supreme stability of spirit—unmoving, unshaken, free from sorrow or fear, thought or imagination—like an infant nestled in its mother’s womb. \"Breathing\" denotes the cessation of coarse qi, the halting of external respiration, so that qi is no longer drawn in, and the hundred vessels naturally harmonize in a single radiance.\n\nKnow that qi is like water, and spirit is like the moon. The moon’s movement arises from water’s ripples; the spirit’s agitation stems from qi’s pull. When water is still, the moon is bright; when qi is settled, the spirit is wise. In the Jade Fluid Returned Elixir, the practice is nothing other than the embrace of spirit and qi, neither issuing nor entering, like a woman with child.\n\nOnly by ensuring that spirit does not leave qi and qi does not leave spirit, each breath interdependent, can one attain great stillness and the Internal Elixir naturally form—hence the title *Embryonic Breathing Sutra*. \"Sutra\" means the constant Dao: this practice of embryonic spirit and breath is the eternal Way of the Jade Fluid.\n\nNow, \"spirit\" is called \"embryo.\" Consider pregnancy: after the union of the Two Fives, there is something within the womb, naturally abiding, unceasing in its flow, unbroken in its nurturance. Yet our spirit is restless all day, even in dreams unsettled—how can it hope to hibernate unmoving, vast and luminous?\n\nI have already noted that qi can stir the will, but the principle that the will can stir qi must not be overlooked. For scattered thoughts are not the true heart or true spirit—they are like wind. Water is inherently still, but wind stirs it into ripples. If the wind ceases, the water returns to clarity, and the moon’s reflection shines undisturbed. Thus, the adept eliminates the Three Minds and extinguishes the Four Marks. With delusive thoughts severed, the true spirit (the One Numinous) radiates, and qi naturally returns to its root, neither issuing nor entering.\n\nShiyi Zi (Wan Qixing) expounds on the method of *zhuanxi* (revolving the breath), saying:\n\n“The Dao abides between Heaven and Earth; from ancient times to the present, it is borne by a single breath. Since the Dao cannot be seen, what may be quietly observed and realized is only this one breath. Yet breath has the true and the ordinary: ordinary breath is respiration, easily known to all, while within ordinary breath lies true breath, known only to those who cultivate the Real. Beyond true breath lies breathlessness, and within breathlessness lies non-breath—only the perfected person can discern these.\n\nAt the moment of utmost emptiness and profound stillness, ordinary breath departs and true breath appears. In the depths of boundless obscurity, true breath manifests and breathlessness arises. In the ceaseless, subtle continuity of the moment, breathlessness settles and non-breath revolves. To know the revolving of breath is to know the revolving of consciousness; to know the revolving of consciousness is to know the revolving of the subtlest movement—does this not approach the numinous?\n\nYet revolving the breath is no simple matter. To know the revolving of breath, one must first know *fenxi* (divided breath); to know divided breath, one must know *lixi* (detached breath); to know detached breath, one must know *hexi* (united breath); to know united breath, one must know *tongxi* (pervading breath). Pervading, it is one; one becomes two, two becomes one. Does this not correspond to what Zhuangzi meant by ‘riding the constancy of Heaven and Earth, steering the transformations of the six qi, and roaming the boundless’?\n\nThe above elucidates the classic’s title.\n\nThe embryo is formed within subdued qi.\nThe spirit is like a person; qi is like a horse.\nAs a horse carries a rider in gallop, so qi pulls the spirit into motion. Thus, if one wishes the spirit to abide in tranquility and freedom, like a pregnant woman carrying a child, nothing can be achieved without subduing the qi and returning it to its root, where it hibernates in concealment.\n\nBut where does it return to its root? How is qi subdued?”\n\nHere lies a profound subject for inquiry. Cao Wenyi states: *\"Focus the qi to achieve suppleness, and the spirit will abide long.\"* The *Record of Northern Journeys* recounts: *\"I recall my master (referring to Ancestor Qiu) expounding during a state of great samādhi that among all methods of practice, visualization of the lower dantian is paramount—yet it remains but one method, not the Dao itself.\"* Master Huanzhen’s commentary on the *Embryonic Breathing Classic* notes: *\"Three inches below the navel lies the Sea of Qi, also called the lower dantian.\"*\n\nFurthermore, the lower dantian is where spirit and qi return to their root. Its precise location lies slightly below and behind the navel, though one must not fixate on exact measurements in inches or fractions. Knowing the general area suffices. As the ancients said: *\"Behind the navel, before the waist; below the heart, above the kidneys\"* (here, \"kidneys\" refers to the *yinqiao* point). The region between these landmarks should not be rigidly defined.\n\nThe *Guidance Within the Compass* discusses the *Mysterious Gate* (*xuanpin*): *\"A substance of inch-wide dimension, uniting the Three Powers, situated above the kidneys and below the heart—its interior is vaguely discernible, called the Mysterious Pass. It cannot be grasped with intent, nor sought without intent. To grasp it with intent is to never attain it.\"*\n\nWith intentless seeking, one ultimately reveals its nonexistence—how could this suffice?\n\nFor when focus remains undivided, spirit congeals; merely preserve the heart and sever thoughts, regulate the breath to evenness. In serene illumination, avoid dullness or distraction. Await the settling of qi into harmony, and the True Person enters samādhi. Within this samādhi, observe and reflect upon the inner landscape. The moment intent arises, its sign immediately germinates—one then senses a breath emerging from the *Compass Within*, flowing continuously, rising and surging without cease. Preserve it with sincerity, listen with the heart. The six senses settle, fetal breathing congeals, neither forced nor counted, left to its natural course. At the extreme of stillness, exhalation arises like fish in a spring pond; at the extreme of movement, inhalation comes like hibernating insects. With misty opening and closing, its wonders are boundless.\n\nAfter a brief interval, one must forget the breath and merge with spirit, returning wholly to primordial chaos. At the utmost of emptiness, the deepest stillness is maintained. The heart moves no thought, neither coming nor going, neither exiting nor entering—abiding in profound clarity. This is called the True Person’s breath, where the breath at the heels reaches its deepest culmination. Here, spirit and qi intermingle—this is the sign.\n\nFrom this arises primordial qi, from this arises true breathing. Where intent reaches, creation is perceived. Where this breath arises, there lies the *Mysterious Pass*. It is neither high nor low, neither left nor right, neither forward nor backward, neither biased nor partial. Within the human body’s microcosm, this is the very center.\n\nHere lies the place of gathering, of union, of refinement, of bathing, of gentle nurturing. Here, the embryo is knit; here, the embryo is shed in spiritual transformation—all occurs within this point. This aperture, where yang expands and yin contracts, has no fixed form. Intent arrives, and it opens; opening and closing occur in due time. After a hundred days, the foundation is laid, the *qi*-mother nurtured. From the empty chamber, light naturally arises. This was the Dao of the Yellow Emperor’s three-month inner contemplation.\n\nAccording to Master Chen’s discourse, this merges the middle and lower *dantian* in explanation. Yet distinguishing between them is most difficult to grasp. Only Master Min’s *Precious Scroll of the Heavenly Immortal’s Path* elucidates it in detail. He states: *\"When not a speck of dust clings, the absence of杂念 is evident. Only when thoughts cease does the breath settle; only when the breath settles does the pass open—this is an immutable principle. Yet there are those for whom a single moment of emptiness and stillness suffices to open it. This is the *qi*-cavity, not the *qi*-aperture. The *qi*-cavity is where ancestral *qi* naturally emerges, while the *qi*-aperture resides within it. When the *qi*-aperture opens, the *Mysterious Pass* unfolds. This is one explanation—few understand it.\"*\n\nAlas! This is why earthly immortals outnumber heavenly immortals. A deviation by a hair’s breadth leads to an error of a thousand miles. As the saying goes: *\"To know the path at the mountain’s foot, ask one who has traversed it.\"* Without a teacher’s guidance, one may toil in vain until old age, becoming a mere relic. How fortunate I am!\n\nDid not the master say: *\"If the *qi*-cavity does not open, there is no gate for advancing the fire. If the *qi*-aperture does not open, the sacred embryo will not form. Forgetting and forgetting again, the *Mysterious Pass* unfolds. It is two yet not two, one yet not one—like a hen brooding an egg, speaking without words.\"*\n\nWan Qixing said: *\"The *qi*-cavity lies below, the *qi*-aperture above—they share the same point but differ in aperture.\"* He also said: *\"Before the *Mysterious Pass* opens, one concentrates spirit upon the *qi*-cavity, practicing the work of the human element. Once the *Mysterious Pass* opens, one concentrates spirit upon the *qi*-aperture, directly connecting to the heavenly element.\"*\n\nFrom this, beginners should take the lower *dantian* and the earthly abdomen as their foundation. When concentrating spirit and gathering *qi*, the *Mysterious Pass* manifests—yet this pass may open or close at times. Thus, it is said: *\"When effort is sufficient, it appears; when the mechanism is still, it vanishes.\"* This is the *kun*-furnace, also called the spirit-furnace, the place where breath begins and ends—truly the *qi*-cavity. Yet it is also named the *Mysterious Pass* because it appears after spirit and *qi* merge, embodying the wondrous mechanism.\n\nHowever, the true *Mysterious Pass*, also called the *Mysterious Aperture*, only emerges after the *ren* and *du* meridians are unobstructed and the human Dao is fully realized. At the extreme of emptiness and stillness, this aperture appears. Thus, without decades of practice, one cannot speak of its opening. Once opened, it remains so, providing a sanctuary for spirit—hence the *Yellow Chamber* and *spirit abode*. From here, *qi* naturally arises from the *yinqiao*, ascending through the central seam between the spine and the front of the channels, piercing the *niwan* palace as if without ascent or descent. This is precisely the place where the *Yellow Center* connects to the heavens, where heavenly immortals form and shed their embryos.\n\n*Baopuzi* states: *\"Thus, practicing *qi* may cure a hundred illnesses, ward off plagues, subdue tigers and snakes, stanch bleeding wounds, dwell underwater, walk upon water, dispel hunger and thirst, or prolong life. Its essence lies in fetal breathing alone. Those who attain fetal breathing need not breathe through nose or mouth, as if within the womb—then the Dao is achieved.\"*\n\nFor beginners practicing *qi*, draw *qi* through the nose and hold the breath, counting silently to one hundred twenty before gently exhaling through the mouth. Both inhalation and exhalation should be so subtle that one’s own ears cannot hear the breath’s passage. Always let inhalation exceed exhalation. Place a goose feather before the nose and mouth—if the breath does not stir it, this is the sign. Gradually increase the count over time, eventually reaching a thousand. At a thousand, the aged grow younger, regaining a day for each day practiced.\n\nOne should practice *qi* only during the time of living *qi*, not during dead *qi*. Thus it is said: *\"The immortals ingest the six *qi*.\"* In a day and night, there are twelve hours. From midnight to noon, the six hours are living *qi*; from noon to midnight, the six hours are dead *qi*. Practicing *qi* during dead *qi* yields no benefit.\n\nOne skilled in the use of *qi* may, by exhaling upon water, cause it to flow backward for several paces; by exhaling upon fire, extinguish it; by exhaling upon tigers and wolves, render them crouched and unable to rise; by exhaling upon serpents and vipers, coil them so they cannot flee. If another is wounded by blade or weapon, exhaling upon the injury will stanch the blood. Should one hear of another bitten by venomous creatures, though unseen, one may exhale from afar while reciting an incantation over one’s own hand—men exhale over the left, women over the right—and even if the afflicted lies a hundred *li* distant, they will be instantly cured. For sudden ailments or acute afflictions, merely swallowing the *qi* of three nines will bring immediate recovery.\n\nYet human nature is often restless, and few can remain tranquil to cultivate the Way. Moreover, in the practice of *qi*, one must not overeat, nor consume raw vegetables, rich meats, or overly fresh foods, for these strengthen the *qi* and make it difficult to contain. One must also refrain from anger, for excessive wrath disorders the *qi*, preventing its overflow and sometimes causing swelling in the jaw. Thus, few succeed in this art.\n\nThe Three Essentials of Nurturing Life state: To cultivate *qi*, one must begin with regulating the breath. The Chan school speaks of four kinds of breath: that which produces sound in the nostrils is *wind*—to focus on wind is to scatter; though soundless, if the breath is rough and obstructed, it is *panting*—to focus on panting is to bind; though neither noisy nor obstructed, if its passage is perceptible, it is *breath*—to focus on breath is to labor. The true *breath* is that which neither enters nor exits.\n\nMaster Zhu’s *Inscription on Regulating the Breath* says: When stillness reaches its limit, exhale like fish in a spring pond; when movement reaches its limit, inhale like creatures in winter hibernation. Fish in spring stir with the *qi*, their movement exceedingly subtle; insects in winter hibernate with the *qi*, their stillness without trace. In regulating the breath, one must emulate this—subtle, continuous, quiet, and faint. With each exhalation, the *qi* follows out through the hundred bones and ten thousand pores; with each inhalation, the *qi* follows in through the hundred bones and ten thousand pores. If this regulation is unceasing, true *qi* will arise—this is the essential method.\n\nIt further states: In nurturing the body, one must not allow the *qi* within to conflict. For instance, when walking for a long time and wishing to sit, this is a transition from movement to stillness. As one prepares to sit, first walk slowly for a few steps, gently extending the *qi*, gradually relaxing the body. The *qi* of stillness will arrive as the *qi* of movement departs. Sitting thus, the coarse will not clash with the fine. Conversely, when sitting for a long time and wishing to walk, this is a transition from stillness to movement. One must first stir the body, stretching the limbs as if massaging them, then begin to walk slowly. Otherwise, the fine *qi* within will conflict with the coarse *qi*—all other transitions follow this principle.\n\nIt also says: Practicing breath-holding and swallowing it is called *embryonic breathing*; swirling the spring beneath the tongue and swallowing it is called *embryonic nourishment*. In spring, one consumes the morning glow—the red *qi* at sunrise; in autumn, the sinking Han—the red-yellow *qi* after sunset; in winter, the flowing night mist—the *qi* of the northern midnight; in summer, the three yang—the *qi* of the southern noon. Diligently practicing this can enable grain avoidance, and I have tested it with good results.\n\nIt further states: When first learning to regulate the breath, one must imagine the *qi* exiting and entering through the navel. Once the breath is refined to extreme subtlety, one may abandon the use of mouth and nose, breathing solely through the navel, as if within the womb—hence the term *embryonic breathing*. Initially, hold one breath, breathing with the navel, counting to eighty-one or one hundred twenty before exhaling through the mouth. The exhalation should be exceedingly fine, such that a goose feather placed before the nose and mouth remains unmoved. With gradual practice, the count may be increased over time, eventually reaching a thousand. At a thousand, the aged grow younger, regaining a day for each day practiced.\n\nMaster Ge the Immortal would, even in the height of summer, descend to the depths of deep abysses, remaining for a day before emerging—this was due to his mastery of breath-holding and *embryonic breathing*. Yet merely knowing breath-holding without *embryonic breathing* is of no benefit.\n\nIt further states: The *qi* should be soft, not forceful; compliant, not contrary; gathered, not scattered. Thus, Daoists most abhor wrath, for the moment anger arises, the *qi* becomes forceful rather than soft, contrary rather than compliant, disordered rather than settled, scattered rather than gathered. Forcing its containment may cause coughing. Therefore, the practitioner must be like a clear breeze after rain, a bright moon after clouds, a lucky star or auspicious cloud—without a trace of perverse *qi*—before progress can be made. Consuming raw vegetables, rich meats, or overly fresh foods also strengthens the *qi*, making it difficult to contain. Eating at irregular times or consuming foods that stir the *qi* also causes it to become contrary. Excessive thought disorders the *qi*, and excessive speech scatters it—both must be deeply avoided.\n\nThe True Man of Three Peaks’ *Plain Teachings on the Dao* says: Concentrate the spirit in emptiness, as if sitting atop a high mountain gazing upon all other mountains and waters, or lighting a heavenly lamp to illuminate the nine depths and nine obscurities. Regulating the breath is not difficult—once the heart and spirit are still, the breath follows naturally. One need only guard its spontaneity while directing the light of the spirit downward, and the breath will be regulated. To regulate the breath is to harmonize the *qi* of the Yin Heel Vessel with the *qi* in one’s heart, meeting within the *qi* cavity.\n\nIt further says: When the heart rests below the navel, it is called *concentrating the spirit*; when the *qi* returns below the navel, it is called *regulating the breath*. When spirit and breath depend on each other, guarding their natural purity is called *non-forgetting*; following their natural purity is called *non-assistance*. Neither forgetting nor assisting, in silence and softness, the breath becomes lively and the heart at ease. Employ the *drilling* method: use emptiness as the dwelling for the heart, and profound stillness as the abode of the spirit and breath. After two or three attempts, refining again and again, suddenly spirit and breath will forget each other, merging and harmonizing. Unaware, one will feel as if yang has arisen, and the person becomes intoxicated.\n\nIt further says: In regulating the breath, one must use the postnatal breathing to seek the place of the true person’s breathing. As the ancients said: *\"Postnatal breathing stirs a gentle wind, drawing forth the true person’s breathing.\"* Yet in regulating postnatal breathing, one must allow it to regulate itself, only then can the prenatal breathing be cultivated. I need only attain emptiness and guard stillness—once the true breath stirs, the Mysterious Pass is not far.\n\nPursuing practice in this manner, the foundation may be established with ease, requiring not even a hundred days.\n\nFurthermore, in refining *qi* through embryonic breathing, one must rely on breath regulation as the method. The techniques of breath regulation were most thoroughly expounded by [Zhang] Sanfeng, and thus this commentary frequently cites him—these are the true oral instructions of the immortals. As for the method of breath retention, many ancient immortals have rejected it, yet it also has its appropriate applications and cannot be entirely dismissed. However, in practice, one should proceed with utmost naturalness, beginning with the harmonious *qi* of gentle, continuous regulation and gradually advancing. I have already discussed this in detail in *Research and Practice of Qigong for Health Preservation*.\n\nIn the preface to *Four Hundred Words on the Golden Elixir* by the Perfected Zhang Ziyang, it is said: *\"One must know that within the body there is an aperture called the Mysterious Female. This aperture is neither heart nor kidney, neither mouth nor nose, neither spleen nor stomach, neither the anus nor the bladder, neither the Cinnabar Field nor the Mud Pill Palace. To know this aperture is to know where the Winter Solstice resides, where the medicinal substances are found, where the firing times are set, where the bathing occurs, where the Elixir coalesces, and where the body is transcended. This aperture has no left or right, no inside or outside—it is the root of spirit and *qi*, the valley of emptiness. One must seek it within the body and not elsewhere. This aperture cannot be conjectured by private speculation; it must be transmitted heart-to-heart and mouth-to-mouth. Should one proceed otherwise, all efforts are in vain.\"*\n\nThe Perfected Min Yide annotates: *\"Conjecture is merely a thought. The Great Dao teaches one to forget thoughts—how can one speculate with private intent? Yet to forbid conjecture is also to forbid external seeking. The insistence on heart-to-heart and mouth-to-mouth transmission is to show the seeker that realization must come from within. For those of superior wisdom, whose celestial disposition is already settled, reading this may lead to sudden enlightenment. For those of middling capacity, who must progress gradually, there is still the risk of seeking shortcuts without guidance. Now, in reverence for the compassionate intent of Ancestor Zhang, I shall point out the correct path for entering this aperture within the body of all practitioners: it is the method of stopping thoughts. To stop thoughts, one must first curb anger and restrain desires, eliminating all杂念 and retaining only the right thought. Though the right thought is retained, one must not allow it to cling to subsidiary thoughts, which may subtly grow. When this thought suddenly ceases and the next has not yet arisen, all concerns vanish—this is the most wondrous moment. Receiving a single phrase from the teacher at this instant, one may directly grasp it in the heart. Yet if one can, in the gap between the cessation of the prior thought and the arising of the next, suddenly awaken with a single decisive awareness, it is no different from heart-to-heart transmission—what need is there for oral instruction? The key is to awaken in that instant, without startling oneself. Not startling oneself brings stability; stability deepens the medicinal substances within the body, and the so-called method and measure will naturally flow from all sides. The Winter Solstice, medicinal substances, firing times, and all else mentioned above are truly found here. If one speculates with private intent, will this not be like traveling south by driving north? How could it be otherwise?\"*\n\nFurthermore, the general transmission of the Daoist lineage often follows the gradual path of refining *qi* to gather the heart-mind, whereas the Perfected One’s teaching—that stopping thoughts reveals the Mysterious Female—is the supreme vehicle of the Daoist lineage, a method of refining the heart-mind to gather *qi* that resolves all at once. This principle aligns with the Chan School of the exoteric Buddhist teachings and the Great Seal and Great Perfection transmitted in the esoteric teachings—this is most worthy of attention.\n\n*Qi* breathes as if within the womb—how does it breathe? It relies entirely on the great stillness of spirit. As the ancient immortals said: *\"When spirit departs, draw it back; when spirit returns to the body, *qi* naturally follows.\"* Master Lü’s *Hundred Verses* states: *\"Without thought, stillness arises; in stillness, *qi* naturally levels. When *qi* breathes and rests, it returns to the root. Returning to the root, one sees the original nature; seeing the original nature is true realization.\"*\n\nWhen spirit enters the realm of profound indistinctness and the body returns to the state of emptiness and silence, this is what is meant by *\"nurturing life through nurturing nature.\"* The *Master of Broad Accomplishment* said: *\"The essence of the supreme Dao is subtle and obscure; its ultimate is dim and silent. Without seeing, without hearing, embrace spirit in stillness—then the body will naturally rectify itself. Be still, be clear; do not labor your form, do not disturb your essence—only then can you attain longevity. With eyes that see nothing, ears that hear nothing, a heart that knows nothing, your spirit will guard your form, and your form will attain longevity. Guard your inner self, close off the outer; excessive knowledge leads to ruin. I guard the One and abide in harmony—thus I have cultivated my body for one thousand two hundred years, yet my form has never declined.\"*\n\nPeng Zu said: *\"The Dao does not lie in compliance. Simply do not think of clothing, do not think of food, do not think of sound, do not think of color, do not think of victory, do not think of defeat, do not think of loss, do not think of gain, do not think of honor, do not think of disgrace. Let the heart-mind not labor, the body not exhaust itself; constantly guide and lead the inner *qi* to rest—thus may one attain a thousand years.\"* (Some versions include the lines: *\"Do not think of crookedness, do not think of straightness.\"*)\n\nThe *Perfected Bai’s Treatise on Revealing the Secrets of the Mysterious Pass* states: *\"The subtlety of refining the form lies in concentrating spirit. When spirit is concentrated, *qi* gathers; when *qi* gathers, the Elixir forms; when the Elixir forms, the form is stabilized; when the form is stabilized, spirit is preserved whole.\"*\n\nThus, the Perfected Tan (Tan Zixiao, author of the *Book of Transformations*) said: *\"Forget the form to nurture *qi*; forget *qi* to nurture spirit; forget spirit to nurture emptiness; forget emptiness to nurture the Dao. In forgetting all, the work is perfected.\"*\n\nThe Celestial Master Zhang Xuqing’s *Song of the Great Dao* says: *\"The Dao is not far—it is within the body. All things are empty, yet nature is not empty. If nature is not empty, harmonious *qi* abides; when *qi* returns to the primordial sea, life is boundless.\"*\n\nTo keep the spirit within the body, let nothing linger in the mind’s chamber. If things remain within, the spirit is not clear—it dissipates vitality and weakens sinew and bone.\n\nSpirit commands *qi*; *qi* sustains form. No need for miscellaneous arts—longevity comes of itself. Arts are easy to know, but the Dao is hard to awaken to. Even if awakened, without single-minded practice, of the thousands who study, barely one or two succeed.\n\nIf the spirit strays, draw it back. When spirit returns to the body, *qi* naturally follows. Morning after morning, evening after evening, the true embryo of the Red Child is born.\n\nThe Perfected Cao Wenyu said: *\"When spirit does not stray outward, *qi* settles of itself.\"*\n\nFrom the recorded sayings of the Perfected Dan Yang:\nThe Master said: *\"Qi* is hard to master—swift as a galloping horse. Only stillness makes it easy. One must abandon external attachments. Though splendid sights unfold before the eyes, regard them as if in a deep mountain valley. This is the heart of a Daoist. If one has not reached the state of no-mind, mastery is impossible. Thus, those who know the Dao value no-mind.\"*\n\nFrom the *Record of Northern Travels*:\n*\"Now I speak truthfully to all of you—these are not my private words, but the words of the Perfected Masters. Those who study the Dao and uphold goodness begin with diligence, but before long, they grow lax. They cling to deluded desires, and when no results appear, doubt arises, unshakable. Thus, they abandon the path halfway.*\n\n*The sages established teachings for later generations to dispel delusion and restore nature, preventing emotions and desires from disturbing the heart. When the heart finds its natural equilibrium, this is the foundation of entering the Dao. Were the sages without emotion? They simply did not let their hearts be moved. Like heaven’s four seasons—cold and heat in motion, thunder, wind, and rain transforming all before them—yet the true essence of the Great Void never stirs. When practitioners investigate this to its core, they reach the state of ordinary mind. Hence it is said: ‘The ordinary is the Dao.’*\n\n*First preserve this ordinariness. Accumulated practice and merit depend on oneself—this is what lies within our power. The manifestation of the Dao, grasped by sages and worthies, lies with heaven. One must fulfill what is within one’s power and leave what lies with heaven. When merit and practice are complete, the Dao is naturally attained. To seek it with intention is delusion.*\n\n*It is also said: Purity and stillness have inner and outer aspects, non-action and action. Only non-action leads to true attainment—this is genuine purity and stillness, bestowed by sages and worthies. Today’s practitioners may engage in visualization or breath regulation, which is good, yet they never see success. It is like forcing flowers to bloom in winter under shelter—not without marvel, but they never bear fruit. Only non-action and stillness reach the ultimate, with the sign of no leakage. After three years without leakage, the lesser elixir forms; after six years, the middle elixir forms—matters beyond full expression. After nine years, the upper elixir forms, ascending into the Mud Pill Palace. The Three Palaces rise and descend, transformations endless. Even a thousand or ten thousand emanation bodies emerge from this. How is this achieved? By taking the ordinary mind as the foundation. When the mind is at peace, spirit stabilizes; when spirit stabilizes, essence congeals; when essence congeals, *qi* harmonizes. This manifests in the face and radiates through the four limbs—all naturally. The root lies in taking the ordinary mind as the foundation.*\n\n*What lies within our power must be fully realized; what depends on heaven cannot be forced. Only when merit and practice accumulate sufficiently does attainment come of itself.*\n\n*It is also said: Patriarch Qiu said, ‘Dan Yang and I both studied the Dao under the same master. The master sent me back into worldly labor without rest, while Dan Yang received silent transmission of the mysteries. One day, the master shut his door. I listened through the window and heard him teaching the method of ‘the Valley Spirit never dies’—breath regulation. After a long time, he opened the door and stopped speaking. After that, once my worldly duties were complete, I practiced what I had heard. Though I practiced diligently, Dan Yang attained the Dao in two and a half years, while I endured countless hardships for eighteen or nineteen years without results. The Dao our master transmitted was the same—why such disparity? Only because each person’s accumulated merit and practice differ in depth, so attainment comes sooner or later. Dan Yang’s cultivation spanned lifetimes; by this life, his merit was complete. Applying the Valley Spirit’s method at that time, he quickly saw results. My merit was incomplete, so even with long practice, no results appeared—this was only natural.’*\n\n*Practitioners must first cast aside worldly affairs, cultivate all virtues, free themselves from every encumbrance, and focus the mind on emptiness until reaching the state of stillness beyond stillness. When merit and practice are complete, fortune arrives; when fortune arrives, the heart opens. A single point of light enters—this is the root of heaven and earth. The two substances naturally merge into one. Then, apply the unbroken thread of the Dao to nurture it, filling it to fullness, and one becomes deathless for eternal kalpas.*\n\n*The *Three Essentials of Nurturing Life* states: ‘Gathering essence depends on nurturing *qi*; nurturing *qi* depends on preserving spirit. Spirit’s relation to *qi* is like a mother’s to her child.’ (It records the method of refining essence: at midnight, rise and sit up, rub both hands until extremely hot, use one hand to support the external kidneys, and the other to cover the navel, concentrating spirit on the internal kidneys. With long practice, essence flourishes.) Thus, when spirit congeals, *qi* gathers; when spirit scatters, *qi* dissipates. If one treasures essence and *qi* but neglects spirit, it is like enjoying the flower while forgetting the root.*\n\n*It also says: The Chan school’s *cessation and insight* is the essential method of preserving spirit. One day’s ‘binding to a single object’ is the same as fixing the mind on one point.\"*\n\n\"Second is *restraining the mind to cessation*: no longer binding the mind to one place, but whenever a thought arises, immediately halting it. This is what is meant by ‘not fearing thoughts arising, only fearing delayed awareness.’\n\nThird is *embodying the true cessation*: amidst the myriad worldly conditions, the true mind remains unmoved. In all circumstances of fortune or adversity, the mind does not recklessly follow external objects—this is abiding by embodying the true.\n\n*The Nourishing Life Skin and Tongue* says: When a person first dies, their ears, eyes, mouth, nose, hands, and feet—all their physical form—remain intact, yet their parents, siblings, spouse, and children no longer love them. Why? Because their spirit has departed. Thus, what people love is the spirit, not the form. Yet today, what people cultivate is the form, not the spirit—why is this?\n\nToday, when people compose literature, their spirit departs; when they handle affairs, their spirit departs; when they delight in sounds, their spirit departs; when they indulge in sensual pleasures, their spirit departs. In all their movements and activities, their spirit scatters without cease, yet they do not regret it. Only when the spirit is utterly exhausted do they grieve deeply—how belated is their insight!\n\nWhen a person engages in thought and contemplation, each thought emits a spirit, each focused intention emits a spirit, like dividing a flame: the more it is divided, the more the oil is depleted, and the smaller the flame grows. The more the spirit is divided, the more essence is exhausted, and the less spirit remains. Only when it is cut off do they grieve deeply—how belated is their insight!\n\nAn ancient immortal said: ‘The moment the spirit departs, draw it back. When the spirit returns to the body, *qi* naturally returns. If you do this morning and night, naturally the old man and woman will revert to childhood.’ Alas! This truly communicates the life-force of heaven and earth.\n\nIt also says: Lu Yuanhe, discussing the essence of nourishing life, stated: ‘It is nothing more than concealing the spirit in the abyss, preventing it from wandering outward. Over time, the spirit will naturally transform—no need for excessive talk.’\n\nMaster Sanfeng’s *Daoist Words in Plain Speech* says: The great Dao enters through the character *zhong* (center). This *zhong* has two meanings: one within the body, and one beyond the body. The practice must be done in two layers.\n\nFirst, seek the *zhong* within the body. As Zhu Xi said: ‘Guard the center to control the external.’ To guard the center, one must turn the light inward and reflect, focusing attention on the *guiding* (one *cun* and three *fen* below the navel), neither clinging nor departing—this is seeking the *zhong* within the body.\n\nSecond, seek the *zhong* beyond the body. The *Doctrine of the Mean* speaks of ‘before joy, anger, sorrow, and delight arise.’ At this time of non-arising, one neither hears nor sees, maintaining reverence in solitude. Naturally, the nature settles and the spirit becomes clear; when the spirit is clear, *qi* becomes refined. Only then can one see the original face—this is seeking the *zhong* beyond the body.\n\nBy using the *zhong* within the body to seek the *zhong* beyond the body, human desires are easily purified, and heavenly principle is restored to clarity. The sages, immortals, and buddhas of all ages have taken this as the first step in practice.\n\nIt also says: *Congealing the spirit and regulating the breath, regulating the breath and congealing the spirit*—these eight characters are the initial practice. They must be pursued as a single endeavor, progressing through stages without interruption.\n\n*Congealing the spirit* means gathering the already-cleared mind and entering within. When the mind is not yet clear, do not rashly close the eyes. First, one must self-exhort and self-encourage. Only when the mind is coaxed back, cool and tranquil, should it be gathered into the *qi*-cavity—this is called *congealing the spirit*. Once the spirit is congealed, one sits like atop a high mountain, gazing upon all mountains and waters, or like lighting a heavenly lamp to illuminate the nine depths and nine mysteries—this is what is meant by *congealing the spirit in emptiness*.\n\nIt also says: Conceal the mind in the abyss, and the spirit will not wander outward. When the mind is dragged by affairs, fire stirs within. When fire stirs within, it inevitably agitates essence. When the mind is still, the breath naturally regulates; with prolonged stillness, the mind naturally settles. Kill the mind to nourish *qi*; refine the breath to purify the mind.\n\nEssence, *qi*, and spirit are the three inner treasures; the ears, eyes, and mouth are the three outer treasures. Always ensure the inner three treasures do not chase after external objects, and the outer three treasures do not penetrate within to disturb. Let the breath be continuous and deep, entering the *dantian*. Make breath the husband and wife, spirit and *qi* the mother and child. When mother, child, husband, and wife gather without separation, the mind does not stray outward, intention does not wander, the spirit does not roam, and essence does not recklessly move. Constantly steaming the four limbs—this is the orthodox lineage of the golden elixir’s great Dao.\n\nIt also says: *Congealing the spirit and regulating the breath* requires only a peaceful mind and harmonious *qi*. When the mind is peaceful, the spirit roams; when *qi* is harmonious, the breath regulates. The character *ping* (peace) is most wondrous: a mind without waves is *ping*; a mind that holds to the center is *ping*. *Ping* is precisely this center. When the mind is in this center, it does not stir waves—this is the *mysterious pass* of the alchemical classics.\n\nIt also says: Without knowing the *mysterious pass* in cultivation, regardless of other matters, this alone is like entering a dark room—where to begin? The *mysterious pass* is the *qi*-cavity. When the spirit enters the *qi*, it is as if dwelling in a deep cavern. When spirit and *qi* long for each other, the substance of the *mysterious pass* is established.\n\nMaster Wu Chongxu said: The ancient *Embryonic Breathing Classic* states: ‘The embryo forms from *qi* lying hidden; breath ceases within the formed embryo.’ These words are the essential method for all past and future divine immortals and heavenly immortals. I wish to further elucidate and directly discuss this.\n\nWhen a person first loses their body, only the union of two *qi* as empty space remains—there is no embryo, nor breath. Due to the mother’s breathing, the embryo grows; due to the embryo, breath grows. When the embryo is complete, the wonder lies in following the mother’s breath to become breath. Thus, one breathes all day without feeling stifled. This is because the breath does not pass through the mouth and nose but only communicates through the navel, appearing as if without breath—this is the true scene of embryonic breathing.\n\nOnce separated from the embryo, breath is cut off. Without the mother’s navel connected to the child’s navel, one cannot but begin breathing through one’s own mouth and nose, which is the same as embryonic breathing but temporarily differs in the aperture.\"\n\nThe principle of reverse cultivation and return—how could it not involve taking one’s present breathing and reverting it to the breath within the womb? Whenever one returns the breath, the *qi* drawn through mouth and nose is restored to the locus of embryonic breathing, as if the breath were once again in the womb. Gradually refining it, even the true embryonic breath vanishes. This \"true void\" signifies the extinction of breath. Only then does one revert to the state before birth, returning to the realm prior to breath and prior to the embryo, no longer subject to the path of birth and death.\n\nYet the breath is most difficult to subdue. Only with the support of primordial *qi* can it stabilize and form embryonic breathing. This is another instance of what is meant by \"solitary yin cannot complete.\" It requires the moment when the mechanism of precelestial *qi* stirs, when the primordial spirit awakens alone, and when breath and *qi* interdepend—only when the Three Treasures converge and the Great Medicine is first refined can one return to the Yellow Court, the locus of embryo formation. At this time, one nourishes the fetal spirit with embryonic breathing, allowing spirit and *qi* to ride the breath of embryonic breathing and stabilize within. This is the beginning of embryo formation. Though there may seem to be a faint breath at the navel wheel, it is as if it is not at the navel wheel but in empty space. Gradually, breath ceases, and the embryo forms, seamless and unbroken, directly attaining the great samādhi of the yang spirit. Without movement or stillness, arising or ceasing, the embryo is perfected, and the samādhi of extinction is achieved, giving rise to the yang spirit.\n\nMaster Wuyuan said: \"When the four great elements are unattached, the body is purified; when all thoughts cease, the mind is purified; when the light is turned inward in reflection, the eyes are purified; when sounds do not enter, the ears are purified; when fragrance and stench do not reach, the nose is purified; when right and wrong do not move, the tongue is purified. Sweeping clean all conditions, departing from all extremes, responding without attachment—this is the purification of the heart.\"\n\nMaster Min said: \"At this stage, the Dao-body is fully manifest. If one recognizes this and continues to the point where nothing is established and both self and dharmas are forgotten, advancing to the boundless, one naturally enters the infinite realm of transformation. Body and mind merge with the workings of creation. Further, one maintains the scattered purification for forty-nine days without losing this state. When the time arrives, one responds to the moment with spontaneity, naturally attaining realization in one’s own body. The six supernormal powers are complete—how could the precelestial be obscured, or the embryo fail to form and perfect? Thus, one may suddenly transcend to the supreme knowledge and virtue, resolving all at once. Even if obstacles arise, the Mysterious Pass will surely open widely and remain open. The processes of gathering, forming, nourishing, and liberation—all operate through non-abiding, awareness without attachment.\"\n\n*The Guide to the Center* says of the medicine: \"Generally, the Mysterious Female is the origin of yin and yang, the dwelling of spirit and *qi*. Spirit and *qi* are the medicine of nature and life, the root of embryonic breathing, the ancestor of respiration. The Dao of deep roots and firm stems— the embryo is the palace that houses the spirit, and breath is the source that transforms the embryo. The embryo arises from breath, and breath abides through the embryo. Without breath, the embryo cannot form; without spirit, breath has no master.\"\n\nIt further states: \"The immortals teach that in refining essence, one must return to its origin, restore its beginning, regenerate the five viscera, reestablish the bodily form, and from formlessness give rise to form, structuring the sacred embryo. The secret says: 'Concentrate *qi* to achieve softness—can you be like an infant? Eliminate defilement, cease thoughts, still the heart, and guard the One. External perceptions do not enter; internal perceptions do not exit. All day, remain in primordial chaos, as if in the mother’s womb. Spirit stabilizes to meet *qi*; *qi* harmonizes (or abides) to unite with spirit. Spirit congeals as *qi*; *qi* abides as spirit. Serene in the realm of rest, dimly present in the land of nothingness, the heart of heaven is obscure, attention fixed on the One aperture. Like a hen brooding an egg, like a fish in water—exhaling to the root, inhaling to the stem, continuous yet subtle, guarding the single breath within the embryo. Guarding without fixation, the true breath naturally abides. Vanishing as if nothing, though the heart is in the heart, nothing is retained. Within the profound darkness, one only perceives the vast emptiness, where a single spirit governs creation. When the time is ripe, the wondrous principle manifests of itself. Gently it moves, silently it rises. With subtle intention, *qi* is stabilized, responding to the pivot of creation. Then metal and wood naturally merge; water and fire naturally ascend and descend. Suddenly, a single point, as large as a millet grain, falls into the Yellow Court—this is the mechanism of gathering lead and merging mercury, forming the elixir of a single day within that day.\"\n\n*The Return of Life* says: \"At night, primordial chaos crashes to the ground—all the myriad forms are utterly unknown. At this time, the body merges with emptiness, equal to the void. One does not know spirit as *qi*, nor *qi* as spirit. Such transformation is not through visualization—it is the natural Dao. I do not know why it is so, yet it is so.\"\n\nOnce the medicine is born, the fire emerges. Generally, when the medicine arises, in its small form it can align with the workings of Kan and Li; in its great form, it can synchronize with the movements of Qian and Kun. The essence of the golden elixir is fully revealed here, leaving no residue. How could it be spoken of in the same breath as lesser methods? If you do not believe me, abandon the Mysterious Female to establish a foundation, seek medicine outside spirit and *qi*, practice fire times without knowing the natural embryonic breathing—forsaking the root for the branches, chasing delusion and losing the real—heaven will shorten your allotted time. What more can I say?\n\nNow, regarding Master Chen’s passage: though it primarily discusses the Jade Fluid, it also briefly touches on the Golden Fluid. Though the small and great differ, their principle is one. This \"one\" refers to the union of yin and yang to give birth. Whether in the lesser elixir, the greater elixir, or the Mysterious Pearl—without union, there is no birth. Master Yin said, \"There has never been creation without union\"—this is precisely what he meant.\n\nQi enters the body to give life; spirit departs from form to bring death. All living things possess qi, and life dwells within qi. The awareness and movement of all living things arise from the functioning of qi. Without qi, there can be no movement—it becomes a dead thing. All creatures, however humble, contain spirit; spirit is the numinous, and nature resides within it. Without spirit to govern, it is like wood or stone—what else but death?\n\nThus, we know that what gives life to the human body is qi and spirit. Yet this qi and spirit are endowed by Heaven and further shaped by its molding. As the *Yin Fu Jing* says, \"Heaven, Earth, and the myriad things are thieves of one another,\" and the ancient sages declared, \"Heaven gives it, Heaven takes it back.\" When qi is lost, qi is exhausted, and death follows—all referring to this.\n\nKnowing that spirit and qi can prolong life, one firmly abides in emptiness to nurture them. This is the most essential secret of this classic. Emptiness here means attaining emptiness and guarding stillness, the method of establishing the Mysterious Female. To be empty is to empty the heart; to be without is to forget the body. Emptying the heart, spirit becomes clear; forgetting the body, qi becomes still. When clarity and stillness are achieved, spirit and qi nurture themselves.\n\nYet this is not something attainable in a single leap. From morning to night, in movement and stillness, one must remain unwavering—only then can success be achieved. Hence, it is called \"firmly guarding,\" meaning not a moment’s separation, not a single instant of slackness. Moreover, this practice of firmly guarding emptiness is the very method by which immortals unite yin and yang, stealing the creative power of Heaven and Earth. Without knowing this secret, there can be no return; without attaining this state, there is no path to return. Thus, it will be expounded further below.\n\nLaozi said: \"Attain utmost emptiness, guard profound stillness.\" The *Huangdi Neijing*’s \"Discourse on the Heavenly Truth of High Antiquity\" states: \"Serene and empty, true qi follows; spirit guarded within—how could illness arise?\" Master Danyang’s recorded sayings say: \"The Dao takes non-mind as its essence, forgetting words as its function, softness and weakness as its root, and purity and stillness as its foundation. If applied to cultivation, one must moderate diet, sever thoughts, sit in stillness to regulate breath, and rest peacefully to nurture qi. When the heart does not wander, nature stabilizes; when the body is not wearied, essence is born; when spirit is not disturbed, the elixir coalesces. Then, extinguishing emotions in emptiness and calming spirit to the utmost, one may be said to attain the wondrous Dao without stepping beyond the threshold.\"\n\nHe also said: \"Purity and stillness—purity is to clarify the source of the heart, stillness is to purify the sea of qi. When the heart’s source is clear, external things cannot disturb it, so emotions settle and spirit’s clarity arises. When the sea of qi is pure, base desires cannot intrude, so essence is preserved and the abdomen is full. Thus, settling the heart is like clarifying water; nurturing qi is like raising a child. When qi flourishes, spirit becomes numinous; when spirit is numinous, qi transforms—this is the result of purity and stillness. If one practices with intention and effort, it is a method with limits; if one practices the principle of non-mind and non-action, it is the boundless emptiness of purity.\"\n\nHe further said: \"Non-action means no thought, no worry—concentrating on a pure heart and tranquil mind, nurturing qi and preserving spirit, wandering in the realm of carefree ease, entering the land of nothingness.\" He also said: \"Liu Gaoshang lived in a humble abode for forty years, doing nothing else but emptying his heart, filling his abdomen, shedding vanity, forgetting fame, abandoning profit, purifying his spirit, and preserving his qi. The elixir formed of itself, and immortality was achieved.\" There is a eulogy for him that says: \"Block the openings, close the gates.\" I once recited these words, but now I see such a person—truly simple and fitting.\n\nHe also said: \"The cultivator, in walking, standing, sitting, or lying down, must not for a moment let the heart stray from the Dao. In walking, place the feet on level ground; in standing, concentrate the mind on the great void; in sitting, regulate the breath at the tip of the nose; in sleeping, embrace the pearl below the navel. Over time, breath is harmonized without interruption, and though one appears foolish all day, this is the true work—no artificial effort or forced practice.\"\n\nHe addressed the assembly, saying: \"The Dao has no form or name; it is the ancestor of spirit and qi. When primordial qi descends and transforms, numinous awareness arises of itself. Refining spirit to merge with the Dao—this is true cultivation. All other names and forms are mere distractions, unreliable as standards. I will now present its great outline for you: the essentials of this practice do not depart from spirit and qi. Spirit and qi are life and nature; life and nature are dragon and tiger; dragon and tiger are lead and mercury; lead and mercury are water and fire; water and fire are the infant and maiden; the infant and maiden are true yin and true yang; true yin and true yang are none other than spirit and qi. All these names and forms must not be clung to—they are merely the two words: spirit and qi.\n\nTo nurture qi and preserve spirit, one must cast aside all worldly ties, purify both inside and out. Over time, with unbroken focus, spirit congeals and qi surges. After three years without leakage, the lower elixir forms; after six years without leakage, the middle elixir is achieved; after nine years without leakage, the upper elixir is perfected—this is called the fulfillment of the three elixirs, the completion of the nine transformations. Marrow solidifies, blood and vessels become true, inner perfection overflows externally, radiance and clarity shine through. In stillness, there is no movement; in response, there is no limit. A thousand changes, ten thousand transformations—sitting in death, standing in life. The thirty-six thousand spirits leap forth, roaming the world. The three realms welcome you together; within the eight difficulties, a thousand perils and ten thousand poisons cannot harm you. Even in the great kalpa’s transformations, when flames rage on all sides, spirit fills the great void without obstruction. Thus, heaven may at times collapse, earth may at times sink, mountains may at times crumble, seas may at times dry up—all things with form will ultimately perish. Only the cultivator, when spirit merges with the Dao, remains eternally unbroken, and the merit extends to nine generations of ancestors, ascending to the Upper Clarity.\"\n\nThe Master then addressed his disciples, saying, \"How many hours are there in a day?\"\nThe disciples replied, \"Six hours in a day.\"\nThe Master asked, \"How many hours are there in a day and night together?\"\nThe disciples answered, \"Twelve hours in a day and night.\"\nThe Master said, \"Within these twelve hours of day and night, the Dao of Heaven moves, revolving and creating transformations—does it ever pause even for an instant?\"\nThe disciples replied, \"It never pauses.\"\nThe Master said, \"Those who cultivate the Dao must emulate the Dao of Heaven, revolving and transforming within their own bodies. In all twelve hours, maintain constant purity and clarity, without the slightest dust-like thought arising. Only then is this true cultivation. Progressing day by day, month by month, without interruption, you will assuredly become an immortal. If you falter in effort or lose conduct, how can you attain realization? I observe that among you, in these twelve hours, there is not a single hour devoted wholeheartedly to the Dao. Having received offerings from patrons in the ten directions, how can you repay them? Once your eyes close in death, you will reenter the wheel of rebirth—when will you ever escape? I now earnestly remind you: simply settle the mind and dispel desires, unstained by the myriad entanglements. When spirit and qi harmonize and ascend, this is the Dao. Cultivate accordingly, and you will not err. If you procrastinate and grow indolent, failing to uphold the practice, the fault is not mine. Do you not consider your seven generations of ancestors, who in life committed manifold evil deeds and now suffer torments in the netherworld, hoping their descendants will attain the Dao and deliver them to rebirth in heaven? Let this be your resolve. Hold fast to the Dao even unto death—this is my wish for you. Take heed.\n\nThe *Regulations Within the Rules* on the firing process states: The Jade Toad says, 'Fire originally belongs to the southern *Li* trigram, corresponding to the heart. The heart is spirit; spirit is fire. Qi is the medicine.' To refine the medicine into the elixir with fire is to guide qi with spirit and thereby accomplish the Dao. This explanation is so clear, so direct—yet those without the bone of immortality dismiss it as empty words, missing it even as it stands before them. How lamentable!\n\nThe essential oral instructions on the firing process must be sought within true breathing. For breath arises from the heart; when the heart is still, breath is regulated. When breath and heart return to the root, this is the mother of the golden elixir. The *Heart Seal Sutra* says, 'Returning the wind to merge as one—after a hundred days, the work becomes efficacious.' This is it. One must guide qi with spirit, stabilize breath with qi, and regulate the bellows’ opening and closing, the ascent and descent of yin and yang. Let inhalation and exhalation proceed naturally. Focus the qi to attain suppleness, contain the light, and remain silent. Whether moving or still, sitting or lying down, maintain continuity as if something were present—like a woman nurturing a pregnancy, like a young dragon tending its pearl. Gradually gather, gradually refine, gradually condense, gradually solidify. When the work becomes pure, it coalesces into one. In movement and stillness, be ever mindful. Do not let thoughts arise—for when they do, fire flares. Do not let intention scatter—for when it does, fire cools. Simply ensure no excess or deficiency, maintaining balance in action and rest. Let spirit embrace qi, and qi embrace spirit. With singular intention, harmonize and envelop the primordial chaos. This is called the continuous transmission of the fire-seed, keeping the elixir crucible perpetually warm, without a single breath’s interruption or the slightest deviation. Refining thus for a moment is a moment’s celestial revolution. Refining thus for an hour is an hour’s celestial revolution. Refining thus for a day is a day’s celestial revolution. Refining for a hundred days is called establishing the foundation. Refining for ten months is called the fetal immortal. Even when yang arises from the primordial sea and fire emerges within water, when heaven and earth cycle and qian and kun reverse—all remains inseparable from a single breath. Moreover, in bathing, nurturing, advancing, retreating, withdrawing, and adding, the subtle alignment with the celestial mechanism and the hidden accord with creation brook no forced effort. Thus it is said: 'Though fire has its timing, it need not be held; the subtle mechanism I know myself. Simply rest the spirit and breath, letting nature take its course—this is the definitive teaching of the former masters.' 'Day and night, the cyclical methods proceed naturally—what need is there to diligently watch the firing process?' This is the unerring judgment of the ancient teachers. The intent of the sages—to transmit the medicine but not the fire—is fully realized herein.\n\nThe *Secret Essentials of Cultivating the Real* states: When a cultivator begins to establish the foundation, one must first make the heart like still water without ripples, like the great void without clouds—a state of absolute quiescence. Then, within the mysterious pass of the single aperture, emulate the work prior to the time of one’s parents’ birth. Stabilize the true breath and true qi, ensuring qi does not leave breath and breath does not leave qi, merging them into one. Let the inner not exit, the outer not enter. Up and down they circulate within the single aperture, continuously present as if in the womb before birth—a speck of precelestial ancestral qi, vast and harmonious, warm as spring, blissful as intoxication. Beauty resides within, manifesting on the face, flourishing on the back, extending to the four limbs. The four limbs, though silent, are eloquent. Gazing, one sees no form; seeking, one finds no shape. Not for a moment does it depart from the mysterious pass. At this point, the sprout returns to the crucible, and the firing process may commence.\n\nThus, the wondrous function of the primordial spirit naturally operates with the true heart, circulating and revolving within the primordial pass. Gradually tempered, gradually condensed, true essence increases daily. When effort reaches depth, it grows from small to great, from subtle to manifest. The primordial pearl takes form, coalescing into the sacred embryo—all proceeding naturally, without knowing how. From spirit to spirit, without knowing how it is so. Like a child nestled in the mother’s womb, following each breath, gathering the qi of profound harmony and emptiness, forming a body imperishable through the ages. When the embryo matures after ten months, it transforms into an infant, identical in appearance to when one was in the mother’s womb before birth. Then, diligently apply the work of nurturing: focus the qi to attain suppleness, concentrate the mind unwaveringly. In movement and stillness, speech and silence, in haste and separation, nurture it fully. When nurturing is complete, the body becomes empty as space. Then, split open the primordial chaos, cleave the undifferentiated, and reveal the original face. A body exists beyond the body, freely transcending dimensions, transforming without limit.\"\n\nThe Oral Secrets of the Mysterious Mechanism state: Assume the full lotus posture, withdraw the gaze and restrain the hearing. Align the mind with the rising and falling of the breath, neither constraining nor indulging it. In continuous, unbroken flow, one merges with the natural Dao. The method of the Golden Elixir is thus from beginning to end—if one applies effort with excessive intent, it is already mistaken.\n\nLaozi said: \"Subtle and continuous, as if existing yet not exerting force.\" Thus, in beginning the practice, one is not bound by time or moment. In stillness and concentration, dispersion belongs to yin; in concentration and emptiness, forgetfulness within dispersion gives rise to the yin spirit, while forgetfulness within concentration gives rise to the yang spirit. When both internal and external mechanisms are forgotten, the mind of nurturing remains ever-present. In walking, standing, sitting, and lying down, one constantly abides in suppleness. Dispersion leads to inert emptiness, while stillness leads to true emptiness. In quiescent concentration, essence, qi, and spirit all coalesce. Forget the form but not the mind; forget the mechanism but not the guard. Focus solely on emptiness and non-being, wherein being arises. Constant vigilance ensures presence—only the unmoving mind remains. In purity and non-action, one must ever attend closely, lest thoughts arise. The moment a thought emerges, counter it with a civil and martial response. One must firmly guard without interruption.\n\nZhang Sanfeng’s discourse on the firing times of elixir refinement states: The initial work lies in extinguishing emotional attachments and sweeping away stray thoughts—removing stray thoughts is the first step, the work of laying the foundation and refining the self. Once the human mind is eliminated, the celestial mind returns; once human desires are purified, celestial principle abides. Each day, first enter stillness for a time until body and mind are fully settled and the breath is harmonized. Then, gently close the eyes, lower the eyelids, and inwardly observe the space one *cun* and three *fen* between the heart below and the kidneys above—neither clinging nor departing, neither forgetting nor forcing. All thoughts vanish, and the solitary spirit remains—this is called the right thought. At this moment, within this thought, one is lively and free; within that qi, one is leisurely and unhurried. The exhalation rises upward without rushing the heart; the inhalation descends downward without disturbing the kidneys. With each opening and closing, each coming and going, after one or two weeks of practice, the fire of the two kidneys naturally begins to steam, and the qi of the cinnabar field warms. The breath regulates itself without effort; the qi refines itself without cultivation. Once the qi and breath harmonize, they naturally ascend, descend, and abide in the upper, middle, and lower without exiting or entering, coming or going—this is called fetal breathing, spirit breathing, the true bellows and furnace, the true cauldron. This is returning to the root and restoring life, the Mysterious Female’s gate, the root of heaven and earth. At this stage, the qi is like a budding flower or an early-stage embryo, naturally steaming and nourishing the constructive and protective qi. It passes from the coccyx through the spine, ascends to the mud-pill palace, descends the magpie bridge, traverses the multi-storied tower, and settles in the Crimson Palace before returning to the middle cinnabar field—this is the initial movement of the river chariot. However, though the qi arrives, the spirit is not yet complete; this is not the true movement. One must not interfere but merely subtly concentrate and guard the central palace. Naturally, boundless vitality arises—this is what is meant by \"nurturing the tender shoot.\"\n\nAfter one or two months of practice, the spirit becomes increasingly still, and prolonged stillness generates more qi—this is the work of spirit generating qi and qi generating spirit. After a hundred days or slightly more, the spirit flourishes, and true qi gradually fills. With a gentle firing time, the blood and water become abundant. Naturally, kan and li unite, qian and kun converge. Spirit and qi harmonize, and in an instant, true qi blends. A gust of returning wind surges upward through the hundred meridians—this is the true movement of the river chariot. Within it, a single point of numinous light is felt in the cinnabar field—this is the Mysterious Pearl at the water’s bottom, the Yellow Sprout within the earth. At this time, the first yang revives, as if the red sun rising over the vast sea, misty and hazy, now hidden, now visible—thus the lead fire is born.\n\nBefore qian and kun, kan and li unite, in the emptiness and extinction of non-being, the spirit congeals at the center. The work continues without interruption, forging into a single mass—this is the union of the Five Agents. When water and fire interact, the second phase of gathering begins. The river chariot reverses its course, and in the fourth phase, the medicine is obtained. The spirit resides within, and the elixir’s light never departs—this is called the Great Celestial Cycle, the practice of the Ninefold Great Return. At this stage, a single point of utmost yang essence congeals within, concealed in the time of purified desire and stilled emotion, taking on form and appearance. Here, the breath rests in the embryo, and both internal and external nurturing proceed without the slightest lapse—this is also called the ten-month work.\n\nThough this passage appears in the *Complete Works of Sanfeng*, it is not necessarily by Sanfeng. However, its discussion of entering stillness is logically sound, and thus it is recorded here.\n\nThe *Secret Principles of the Three Vehicles* by Master Hanxu states: In beginning the practice, first still the mind, then seal the mouth, and then regulate the breath (a still mind calms the qi; the highest regulation is no regulation). When the nasal breath is harmonized, close the eyes and inwardly observe, directing the spirit below the root of the kidneys to the yin convergence vessel (this vessel lies behind the scrotum, before the anus, and ascends directly to the sea of qi). After a time, lift the mind and breath into the void aperture (the region behind the navel, before the waist, between the heart below and the kidneys above—do not cling rigidly). Rest the spirit and settle the breath, taking naturalness as the principle. If the mind is too strict, it becomes scorching—this is the civil fire. If the mind is too scattered, it becomes cold—this is the martial fire. The civil fire nurtures; the martial fire refines. The wondrous application from beginning to end lies in the evenness of the internal breath—neither assisting nor forgetting. At this time, the mind is like the great void; if the breath accompanies it, it is not void. The mind is like the great emptiness; if the breath follows it, it is not empty. Between non-void and non-empty, stillness deepens into deeper stillness, purity into deeper purity. All is released; the entire body is forgotten. Mind and spirit are silent; the breath is continuous. All enter into profound obscurity—this is called \"piercing the profound obscurity.\" Within this obscurity, there is qi, and the solitary spirit alone awakens—this is the true breath.\n\nWhen the true qi emerges, it warms the heart with a melting sweetness and opens the apertures—yet one must still settle it into the cavity, within the void aperture, accumulating and layering it. Then the stem of life grows and yang qi flourishes, allowing the opening of the passes and the circulation of qi.\n\nMaster Min said: The method of observing return ultimately lies in nothing beyond \"attaining utmost emptiness\" and \"maintaining deep stillness\"—these two phrases are the essential techniques. How many truly understand this secret?\n\nThe *High-Grade Alchemical Method* states: As the *Dan Jing* says, \"Heaven attains the One and becomes clear; Earth attains the One and becomes tranquil; Man attains the One and attains longevity.\" This primordial One Qi emerges from the midst of emptiness—yet it is not the same as utter void. By maintaining stillness to the extreme of emptiness, the body abides in the midst of the indistinct and obscure, in primordial chaos and great stability. Spirit and clarity arise naturally; the solitary numen remains ever serene—this is the true primordial, emptiness yet not emptiness.\n\nWhere spirit moves, qi moves; where spirit abides, qi abides. This means that spirit and qi are one, not two. Without qi, spirit has no support; without spirit, qi has no master. Since spirit is the master, when spirit moves, qi functions; when spirit does not move, qi also does not move—like a shadow following form. As the ancient immortals said, \"Breath arises from the heart; when the heart is still, breath is harmonized.\" This is the meaning.\n\nFurther examining this passage: Though the classics speak of spirit and qi in parallel, yin and yang side by side, the work of Dao cultivation lies solely in the union of yin and yang. To firmly guard emptiness is to \"attain utmost emptiness\" and \"maintain deep stillness,\" which is also the means to achieve union.\n\nMencius said: \"The will is the commander of qi.\"\nThe *Baopuzi* said: \"The method of refining qi should be practiced before noon. It can move mountains and seas, subdue tigers and leopards, and restrain bandits.\"\nThe *Three Essentials of Nurturing Life* said: \"A person’s qi, when blown, feels cool; when exhaled, feels warm. Warmth and coolness change between blowing and exhaling—thus in summer one can make things cold, and in winter, hot. Those who practice qi circulation can enter plague-ridden areas, ward off snakes and tigers, dwell underwater, walk upon water, or blow water to make it flow backward for a thousand miles. The transformations of qi are boundless, all depending on nurturing it with the proper method.\"\n\nMaster Shuju said: \"Where the heart directs and qi assists, one can summon wind and rain, move mountains. Where the heart halts and qi guards, one can traverse time—past, present, and future. Thus the Buddha could sit through five thousand kalpas in the snap of a finger, and Daoists could master creation in the palm of their hand.\"\n\nMaster Min said: \"Innate nature is fundamentally still. After long stillness, it naturally moves. When movement is concentrated, it becomes the great handle. Returning to the root, one reverts to stillness—stillness is called 'returning to life,' which is the esoteric secret. Concentration is reverence inwardly aligned; if movement is not concentrated, it is distraction. Returning from distraction to stillness is confusion. Thus, when the heart moves, it must be concentrated—this is the principle of selecting the good and firmly holding to it. When movement ends, return to stillness; when heart and spirit are calm and clear, this is clarity embodied.\"\n\nHe also said: \"The opening and closing of heaven and earth are nothing but movement and stillness. The life and death of the human body are nothing but movement and stillness. Like leaving the battlefield—after battle, one naturally returns to stillness. Like a theater—after the performance, one returns to stillness. Thus, all movement arises from emotion; stillness is one’s true nature.\"\n\n*Note: Master Min was a direct lineage holder of the Northern School, hence his teachings on stillness practice are especially intimate.*\n\nIf one desires longevity, spirit and qi must be mutually infused. When spirit and qi unite and stabilize, this is the essence of this passage. For where spirit moves, qi moves; where qi moves, essence decays, and the body withers. Only when spirit congeals and qi stabilizes does the body follow in peace—naturally attaining longevity. This passage is particularly crucial.\n\nMaster Wenyu said: \"When merged into one, then forget the one—thus may one emerge and submerge with the primordial transformation.\" He also said: \"When primordial harmony circulates internally, true attainment is achieved; seeking it externally through breath is ultimately futile.\"\n\nMaster Sanfeng’s plainspoken teachings said: \"In general, when sitting in meditation, one must embrace qi with spirit and tether breath with intention, within the Cinnabar Field, gently and leisurely, gathering without scattering. Then the internal qi and the externally drawn qi converge in the Cinnabar Field, growing day by day, month by month, reaching the four limbs and flowing through the hundred channels. It strikes open the double passes of the spine and ascends to the Muddy Pellet; then it descends again to the Crimson Palace and returns to the Cinnabar Field. Spirit and qi guard each other, breath follows breath—thus the path of the River Chariot is opened. At this stage, half the effect of laying the foundation is achieved.\"\n\nThe *Oral Secrets of the Immortals’ Mysterious Mechanism* said: \"The method of immortal cultivation lies in concentrating spirit into the qi cavity.\" The qi cavity is the Mysterious Pass. This aperture lies below the heart and above the kidneys, in the central empty space, facing the navel wheel in front and the kidneys behind—it is the root of life and the foundation of the body. The primordial qi congeals to become nature; the postnatal qi coalesces to become life. The source of nature and life, the stem of life and death—human longevity or brevity all depend on this. The seed of immortals and sages is also contained here. Knowing this aperture and gathering the heart to nurture it, life is in one’s own hands; ignoring this aperture and following the heart’s whims, life is left to heaven.\n\nWhen beginning practice, fix the heart upon the Mysterious Pass, using the method of heart and breath interdependence: inhale qi into it, gently and continuously; exhale softly and subtly. Before the exhale ends, let the inhale follow. If the heart does not guard the aperture, though breath enters, spirit does not infuse it—the pass will not open. Only with unwavering attention can it be achieved. If breath does not enter the aperture, though the heart guards it, qi does not penetrate—the pass will not open. Only when breath constantly returns to the root can it be achieved.\"\n\nThough both heart and breath reach the aperture yet allow them free ingress and egress, qi will not gather, and the pass will not open—only as Zhongli Quan said, \"more in, less out,\" can it be achieved.\n\nCombining these three principles—neither forcing nor forgetting—maintaining the proper pace, neither too slow nor too swift: \"not forgetting\" means unceasing practice; \"not forcing\" means no need for deliberate effort or hastening. When spirit settles and qi fills, brimming in the cinnabar field, the aperture must open, and essence must arrive.\n\nIt is like a wisp of incense smoke in a sealed chamber—at first, barely perceptible. If the flame is never extinguished, the smoke gradually fills the room, and every crevice becomes permeated. The true qi of the human body begins in the abdomen, then gradually opens the aperture, and in time, flows through the four limbs and hundred bones—just so. To accumulate qi is to generate essence. In but a moment, true qi circulates, and true essence arises naturally. This is what is meant by \"the nine returns forming the great medicine,\" where in an instant, divine power manifests.\n\nOnce this aperture opens, all apertures open. If there is illness, after a slight warmth and pain—lasting three or four days, or seven or eight—the pain ceases, and the illness departs with it. If there is no illness, it serves as supplementation, leading to the union and return of the elixir, conception of the embryo, shedding of the embryo, transcendence, and spiritual transformation—all occurring when the time arrives and the wondrous aperture opens, without reliance on artificial effort.\n\nWhen true essence arises, as long as qi is sufficient and spirit abundant, it swiftly reaches the four limbs and hundred bones, and the skin feels as though insects crawl upon it. Practicing thus with unwavering diligence, not a moment’s slack, the Ren and Du meridians meet at the lips, Kan and Li, Qian and Kun, the small and great cycles, the three vehicles and three fields, the head and face, the bubbling spring—no place remains untouched. Practicing thus without cease, the effects are boundless, each unique: the embryo forms and is shed, the sun and moon unite, spirit emerges and transforms.\n\nAll these wondrous realizations begin and end with this oral instruction, arising naturally, without knowing how or why.\n\nFurthermore, this passage, along with the earlier esoteric oral instructions on \"firmly guarding emptiness to nurture spirit and qi,\" was hand-copied by Master Fu Qingzhu of the Ming loyalists and annotated in red by the Qing scholar Gu Tinglin. As Master Fu often associated with true immortals and extraordinary individuals, his teachings transcend both principle and practice, unlike the superficial, speculative theories of armchair scholars. Those earnest in cultivating life and entering transformation should wholeheartedly practice, for it is no deception.\n\nWang Dongting said: \"To know interdependence is to steal from heaven and earth, to seize the workings of creation.\" To know the natural interdependence of heart and breath is dual cultivation.\n\nHe also said: \"The body is true emptiness; spirit is nature. To attain these, one must seek in the Qian heaven of the West. Function is wondrous existence; qi is life. To attain these, one must seek in the Kun earth of the sea’s depths.\" When spirit and qi unite, nature and life are dually cultivated.\n\nHe further said: \"Do not seek within the physical body, nor within the mouth and nose.\" Those who receive the true transmission must know how to borrow the breath of mouth and nose to return to the primordial true unity of qi.\n\nHe also said: \"When speaking of heart and breath interdependence, the heart is not the fleshly heart but the primordial congealed original essence; the breath is not the breath of mouth and nose but the primordial flowing original qi. The wondrous union of heart and breath is the primordial original spirit.\"\n\nHe also said: \"The two characters 'natural' are the fundamental principle of the Dao, heaven, earth, and humanity. One must follow the natural, not merely listen to it.\"\n\nHe also said: \"Dual cultivation relies entirely on the firing times; the firing times rely entirely on the natural.\"\n\nHe also said: \"The primordial unity of qi comes from the midst of emptiness. To be empty is to empty the heart, and spirit naturally perceives; to be without is to be without the body, and qi naturally stills.\" There is a distinction between pre-heaven and post-heaven: pre-heaven pertains to the Dharma body, post-heaven to the physical body. Pre-heavenly emptiness and stillness are for refining the self and laying the foundation; post-heavenly emptiness and stillness lead to solitary yin’s extinction. The great path of the golden elixir most values the emptiness beyond the body—cultivating the pre-heavenly Dharma body is also cultivating the post-heavenly physical body.\n\nHe also said: \"Spoken separately: without descending the dragon, how can one subdue the tiger? Without accumulating mercury, how can one obtain lead? Mercury is the inner medicine; lead is the outer medicine. At the outset, one must first connect the inner medicine, then the outer medicine. Thus it is said: when the inner connects, the outer must also connect.\"\n\nSpoken together: refining the self is laying the foundation; laying the foundation is refining the self. Refining the self is nurturing spirit; laying the foundation is settling the breath. When the heart does not move with thoughts, there is no coming or going, no exiting or entering—naturally abiding. When the heart does not move with thoughts, there is no coming or going—this is the work of settling the heart and congealing spirit. Not only is there no coming or going, but one must transcend duality, leave the two extremes, empty the three times, and abide thusly, dwelling where there is no dwelling. When the heart does not move, qi does not move. Thus, it is said: \"no exiting or entering, naturally abiding.\" This is qi without exit or entry, breath extinguished in perfect stillness—heart and qi are not two.\n\nMaster Min said: \"Simply observe movement and stillness; do not cling to the perception of movement. There is no going, nor is there coming—I am thus ever at ease. Movement and stillness are not it; let go and observe from both ends.\"\n\nHe also said: \"I am now ever at ease, neither moving nor still. Within □, I am naturally awake—heaven, earth, beings, and I are one.\" Diligently practicing this is the true principle.\n\nHaving obtained such wondrous instructions, one must practice with utmost diligence to surely attain the wondrous fruit. This is the path of the true immortals’ great Dao, incomparable to the lesser methods of side doors.\n\nWhat is the wondrous fruit? Sima Chengzhen said: \"The Dao has supreme power, transforming form and spirit. When form follows the Dao’s flow, it unites with spirit. When form and spirit unite, this is called the spirit person.\"\n\nThe spirit’s nature is emptily fused, its essence without change or extinction. When form aligns with it, there is no birth or death. Concealed, form merges with spirit; revealed, spirit merges with form. Thus one treads water and fire without harm, faces sun and moon without shadow. Existence and cessation lie within oneself; entry and exit are without gap. Though the body is a coarse substance, it attains the utmost emptiness and subtlety—how much deeper and farther, then, does its numinous wisdom extend?\n\nYet the Dao of emptying the heart has depths and shallows. Deep, it pervades the form; shallow, it reaches only the heart. Those pervaded in form are spirit persons; those who reach only the heart attain but wisdom and awareness, and the body is not spared decay. Why? Wisdom is the function of the heart; excessive use wearies the substance. At first, small wisdom brings joy and much debate, scattering and depleting the spirit and qi, leaving no numinous essence to moisten the body. Life thus ends prematurely, and the Dao remains incomplete. The scriptures call this \"corpse liberation.\"\n\nIt is also said: Mountains have three [grades], and by them grasses and trees do not wither. When humans embrace the Dao, their forms endure forever. Nurtured by its influence over time, their substance transforms to match the spirit. Refining the spirit to the subtle, they merge with the Dao in darkness. They disperse one body into the ten thousand dharmas and blend the ten thousand dharmas into one body. Wisdom illumines without bound; form transcends all limits. They unify emptiness and form as their function and harmonize with creation as their achievement.\n\nIt is further said: When the body aligns with the Dao, there is no time when it does not exist. When the heart aligns with the Dao, there is no dharma it does not penetrate. The ear becomes the Dao-ear, hearing all sounds without sound. The eye becomes the Dao-eye, seeing all colors without color. The six senses become thoroughly clear—this is the reason.\n\nStill, according to these words, the fruition of practice varies in height. The shallow attain spirit’s subtlety but not the body’s; this is the fruit of corpse liberation. The deep attain subtlety in both form and spirit—this is called attaining sagehood in the body and ascending to heaven in broad daylight. Yet when one examines how this is achieved, it is nothing other than nurturing wisdom without employing it, thereby suffusing the four great elements, accumulating over long duration, transforming the form into an immortal.\n\nTo embark on the immortal’s Dao, one begins by verifying the presence of warmth in the abdomen, gradually extending it to fill the entire body with harmony. The mouth can then dry mercury, and the breath can sear flesh—one’s whole body becomes a single mass of pure yang. The substance of the body is inherently yin; when yang flourishes, yin wanes; when yang is firm, yin is soft; when yang is pure, yin is extinguished. With the presence of such yang—drying mercury and searing flesh—how could the yin of blood and flesh not be transformed?\n\nFurther, examining the words of the Śākya school: The origin of the human body lies solely in *āyus*, warmth, and consciousness. *Āyus* is endowed by the offering of father and mother; the length of a person’s life varies according to the thickness or thinness of this endowment. Warmth is the life of sentient beings; when warmth flourishes, life thrives; when warmth ceases, life ends. Consciousness is the numinous awareness—the \"master who comes last and goes first.\" Thus the essentials of cultivation lie in nurturing *āyus*, increasing warmth, so that the body is naturally robust and the spirit has a dwelling. With this as foundation, warmth increases without cease, the form gradually becomes subtle, life endures forever, the body transforms into a rainbow, without change or extinction. Consciousness severs defilement and returns to perfect clarity—is this not one with the Dao’s nine returns and seven reversions?\n\nIn esoteric methods concerning the Dao of transforming form, cultivating the qi channels and *bindu* is most direct and effective. For those who take *Dzogchen* as their main practice, the preliminary observations and the final entry into *Tögel* are the essential techniques for transforming form through the heart’s absorption of qi.\n\nThe *Commentaries on the Scripture of Embryonic Breathing* are here complete.\n\nThere is a superfluous remark: Though the above assembles the renowned sayings of ancient sages and arranges them under various sections, one must know that from beginning to end, it all comes down to the two words *spirit* and *qi*—there is no fixed sequence of before and after. Yet in embarking on practice, effort progresses from shallow to deep, and the effects differ step by step. Though the effects differ step by step, the cultivator of truth never departs from the mutual embrace of spirit and qi. With spirit and qi, there is embrace; forgetting spirit and qi, one enters emptiness. Emptiness does not empty itself—the Dao’s essence is perfectly luminous.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "胎息经 胎从伏气中结，气从有胎中息，气入身来为之生，神去离形为之死。 知神气可以长生，固守虚无，以养神气，神行即气行，神住即气住，若欲长生，神气相注，心不动念，无来无去，不出不入，自然常住，勤而行之，是真道路。 上经共八十三字，一十七句 笺疏缘起 尚自幼多病，又乏齐物乐天之智，常汲汲于死生之域，故于修养诸术，道佛学说，无不参究，冀得延命固形，超脱证果。 然念余多年来，学愈多，行余蔓，与日损之旨，大相背谬，自亦知之。 适一九五一冬日二十五，腊之十五日，闲居无事，因思学道半生，有何受用，无常一到，将何应付，不禁惊起，欲痛改前非，身体力行。 然行将何据？ 细忖道书种种，伪谬者固无论矣。",
      "translated_text": "**The Scripture of Embryonic Breathing**\n\nThe embryo forms from the concealed qi,\nAnd qi breathes within the formed embryo.\nQi enters the body to give life;\nSpirit departs from form to bring death.\nKnowing that spirit and qi can grant long life,\nFirmly abide in emptiness and non-being\nTo nurture spirit and qi.\nWhere spirit moves, qi moves;\nWhere spirit rests, qi rests.\nIf you desire long life,\nLet spirit and qi pour into one another.\nThe heart stirs no thought,\nNeither coming nor going,\nNeither exiting nor entering—\nNaturally, they remain constant.\nDiligently practice this,\nAnd it is the true Way.\n\nThe above scripture contains eighty-three characters in seventeen lines.\n\n**Preface to the Annotations and Commentaries**\n\nSince childhood, I have been plagued by illness and lacked the wisdom to align with things and delight in heaven. Constantly anxious about the realm of life and death, I have studied all manner of cultivation arts, Daoist and Buddhist teachings, hoping to prolong life, secure my form, and transcend to attain fruition.\n\nYet, reflecting on these many years, the more I learned, the more my practice sprawled, increasingly at odds with the principle of daily diminution. I was well aware of this.\n\nOn the twenty-fifth day of winter in 1951—fifteenth day of the twelfth lunar month—idle and without occupation, I pondered: after half a lifetime of Daoist study, what benefit have I gained? When impermanence arrives, how shall I respond? Startled, I resolved to rectify past errors and practice with utmost effort.\n\nBut what should my practice be based upon?\nCarefully considering the various Daoist texts, those that are false and erroneous need not be mentioned.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 296,
      "start_sentence": 0,
      "end_sentence": 9,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.901940107345581,
      "metadata": {
        "source_file": "dao\\藏外\\胎息经笺疏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "其他纵非伪谬，或则陈义过深，（如参同契，悟真篇等）或则支离寡要，（如道藏中之绝大部分），求其能为初学楷式，而内容精当扼要，足为实证之资者，其惟胎息经乎。 惜经疏与幻真先生注，皆欠妥善，故当即决心参考各家要言，作成笺疏，以便一己之行持，且以与佛密互证。 惟年来从事医学内典之纂辑，此意搁置已久，今幸二者大体就绪，故特及之，此作笺疏之缘起也。 尚按：闵小艮真人遗言有曰“好为苟难，耽误一世，作异矜奇，全不济事，只此平常，还源密谛，三百日园，时时明是。 ”善哉言乎！ 乃先得我心也。",
      "translated_text": "Among the rest, though not false or erroneous, some are excessively abstruse in their doctrines (such as the *Can Tong Qi* and *Wu Zhen Pian*), while others are fragmented and devoid of essentials (like the vast majority of texts in the *Daoist Canon*). Seeking one that could serve as a model for beginners, with content precise and concise enough to serve as a foundation for realization, perhaps none surpasses the *Classic of Embryonic Breathing*. Regrettably, the commentaries and Master Huan Zhen’s annotations are both inadequate. Thus, I resolved to consult the essential teachings of various schools and compile my own annotations, both to guide my own practice and to cross-verify with Esoteric Buddhist teachings. However, in recent years, my engagement in compiling medical texts and Buddhist scriptures has left this intention long deferred. Now, fortunately, both endeavors are largely complete, allowing me to finally undertake this task—such is the origin of these annotations.\n\nFurthermore, I note the words left by the Perfected Min Xiao Gen: *\"To delight in needless difficulty is to waste a lifetime; to indulge in strange and ostentatious practices is utterly futile. Only this ordinary Way holds the secret of returning to the source. In three hundred days, the garden is ever luminously clear.\"* How excellent these words are! They resonate deeply with my own heart.",
      "overlap_context": "nution. I was well aware of this.\n\nOn the twenty-fifth day of winter in 1951—fifteenth day of the twelfth lunar month—idle and without occupation, I pondered: after half a lifetime of Daoist study, what benefit have I gained? When impermanence arrives, how shall I respond? Startled, I resolved to rectify past errors and practice with utmost effort.\n\nBut what should my practice be based upon?\nCarefully considering the various Daoist texts, those that are false and erroneous need not be mentioned.",
      "start_char": 296,
      "end_char": 532,
      "start_sentence": 10,
      "end_sentence": 15,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.0271501541137695,
      "metadata": {
        "source_file": "dao\\藏外\\胎息经笺疏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "经之所证 道宗书十九伪造，性命圭旨蛰藏气穴节下，载此一段，题曰达摩祖师胎息经，此一见而知其伪者，故伍冲虚真人于天仙正理中引用经首二语，只称古胎息经而不着撰人名氏。 查性命圭旨刊于明之万历，正理亦系同时之书，则此经或系明以前宋元人之知道者，托达摩而造与。 经旨正鹄 此经经旨，即是内丹。 内丹者，阴丹也。 乃一己身中所配合而无须假之于人者，亦称玉液还丹，（南宗以筑基后令得药结丹为玉液，与此迥别，故以亦字冠之），实为了性之功。 道宗功夫，虽大成是一，而入手确有多途。 有一己独修者，有资药物者，有赖鼎器者，有三法参差并用者。 而鼎器之中，又有单用虎者，有龙虎并用者，其道虽有浅深，此缘学者根性福德不齐所致。 若云大成，总非三家相见不能也。 而今末法时代，欲如旌阳三丰之所为，实不可能，惟有尽性至命，俾这边事尽，那边易通。 此亦文逸真人所谓形神虽曰两难全，了命未能先了性之旨也。 然古今学道者，多不能辨析内外，致丹道混淆，莫衷一是。 殊不知阴阳有一身、同类、虚空之别，故丹法有玉液，金液，玄珠之殊。 是以玉炼者金炼，金炼者菲玉炼，间又玉炼金炼皆知，而不识玄珠化形之道，经于尸解已耳。 迩来惟皖中陈樱宁先生，以玉液为修道，认金液为炼丹，于纠葛不清之中，辟出一条光明大路，俾学者于茫昧之中，有所辨析，此所谓先得我心者，佩甚！ 非读书破万卷，师授有渊源者，岂能知此乎！ 尚于此将阴阳分作一身、同类、虚空三种，亦不过聊存一说耳，实则纯粹南宗，入手即假同类，由浅入深，而功法步步不同； 纯粹北宗，始终皆是单修，而末后单亦非单； 东西两派，合南北为一，由北宗法入门，以南宗法证果，此因派别不同，而所用之方法亦异，不可不知也。 他如三丰之法，步步俱用龙虎，李晦卿注参同、翁葆光注悟真，（即三注中之薜注）颇为近之。 至于陆子野之悟真注，则又明是两家之法。 余初以两家为非真，及学佛密，始知昔日殆井蛙之见。 总之，修真一道，法有多门，处处绿杨堪系马，家家门闸透长安，若得真师真诀，门门堪以证果，只看学者之因缘与实践之功夫如何耳。 胎息经笺疏正文 古仙云，胎者胎其神，息者息其气。 故胎字是指神之泰定，不动不摇，不忧不惧，不思不想，如婴孩之处母腹一般。 息字是指粗气绝灭，亦是外气不行，气即不引，自然百脉中和，一片光明。 须知气犹水也。 神犹月也，月动由于水漾，神摇由于气牵，水澄则月明，气定则神慧。 在玉液还丹中，始终不外神气相抱，不出不入，如女之怀孕然。 而亦惟有依此神不离气，气不离神，气气相依，达于大定，而内丹自成，故曰胎息经。 经者常道也。 言此胎神息气之功，即玉液之常道也。 夫神即曰胎，考怀胎者，二五媾合之后，即是有物在胞，自然常存，无一息不贯注，无一刻不孕育者，吾人之神，终日攘攘，梦中犹且不靖，安望其能蛰藏不动，含宏光大乎？ 吾前固已言及气能动志矣，而志能动气之旨，尤不可忽。 盖杂念纷乘，并非真心真神，无异风也。 水本不动，因风荡漾，风若不来，水还澄湛，而水月自相辉照矣。 故知道者，去三心，灭四相，缘念既绝，真神（一灵也）朗耀，气自归根，不出不入矣。",
      "translated_text": "What the scriptures attest to reveals that among the nineteen Daoist texts of the *Daozong shu*, the *Xingming guizhi* conceals the \"Qi Cavity Section\" beneath its passages, where this segment is titled *The Embryonic Breathing Sutra of Patriarch Bodhidharma*. At first glance, its spuriousness is evident. Thus, when the Perfected Wu Chongxu cites the opening two lines in *The True Principle of Celestial Immortality*, he refers to it simply as the *Ancient Embryonic Breathing Sutra* without attributing an author. Since the *Xingming guizhi* was published in the Wanli era of the Ming, and *The True Principle* dates from the same period, this scripture may well have been fabricated by a Song or Yuan adept knowledgeable in the Dao, falsely ascribed to Bodhidharma.\n\n**The Aim of the Scripture**\nThe essence of this sutra is none other than Internal Alchemy. Internal Alchemy is the Yin Elixir, a concoction harmonized within one’s own body without reliance on external agents—also termed the Jade Fluid Returned Elixir (though the Southern School defines \"Jade Fluid\" as the post-foundation work of gathering medicine to form the Elixir, hence the distinction marked by \"also\"). In truth, it is the practice of cultivating one’s nature.\n\nWhile the fruition of Daoist practice is ultimately one, the entry points are manifold. Some cultivate alone, some rely on medicinal substances, some depend on crucibles and vessels, and some employ all three methods in varying degrees. Among those using vessels, some work solely with the Tiger, while others engage both Dragon and Tiger. Though the paths differ in depth, this stems from the varying root capacities and karmic virtues of practitioners. Yet, in the end, none can achieve great attainment without the convergence of the Three Families.\n\nIn this degenerate age, emulating the feats of Jingyang or Zhang Sanfeng is no longer feasible. The only recourse is to fulfill one’s nature to the utmost, ensuring that this shore’s affairs are complete so that the other shore may be readily traversed. This aligns with the words of the Perfected Wen Yi: *\"Though form and spirit are said to be difficult to perfect together, one must first fulfill one’s nature before completing one’s destiny.\"*\n\nYet, from ancient times to the present, most Dao seekers fail to distinguish between internal and external alchemy, leading to confusion and discord. They overlook that Yin and Yang differ as *within the body*, *of the same kind*, and *of the void*—hence the divergence in elixir methods: Jade Fluid, Golden Fluid, and the Mysterious Pearl. Thus, those who refine Jade may scorn Gold, those who refine Gold may dismiss Jade, and some, though versed in both, remain ignorant of the *Xuan Zhu*’s method of transforming form, achieving at best a corpse-liberation.\n\nRecently, Master Chen Yingning of Wan has clarified this tangle by defining Jade Fluid as the cultivation of the Dao and Golden Fluid as the refinement of the Elixir. He has carved a path of luminous clarity through the confusion, offering seekers a means to distinguish truth amid obscurity. This resonates deeply with my own heart—I am profoundly indebted! Without vast reading and transmission from a profound lineage, how could one grasp this?\n\nHere, I provisionally divide Yin and Yang into three categories—*within the body*, *of the same kind*, and *of the void*—though this is merely one perspective. In truth, the pure Southern School begins with *of the same kind*, progressing from shallow to deep, with each stage differing in method. The pure Northern School practices solitary refinement throughout, though even its \"solitary\" end is not truly solitary. The Eastern and Western Schools synthesize North and South, entering through the Northern School’s method and attaining fruition through the Southern School’s—such are the distinctions in lineage and method, which must not be overlooked.\n\nOther traditions, like that of Zhang Sanfeng, employ Dragon and Tiger at every step. Li Huiqing’s commentary on the *Cantong qi* and Weng Baoguang’s (Xue’s) commentary on the *Wuzhen pian* (among the Three Commentaries) align closely with this approach. Lu Ziye’s commentary on the *Wuzhen pian*, however, clearly follows the methods of both schools.\n\nInitially, I dismissed these dual approaches as inauthentic, but my study of Esoteric Buddhism revealed my earlier view to be that of a frog in a well. In sum, the Dao of self-cultivation has many gates—*\"Wherever there are willows, a horse may be tethered; every household’s door opens onto Chang’an.\"* With a true teacher and true instructions, every path can lead to fruition; it depends solely on the practitioner’s karmic conditions and the depth of their practice.\n\n**Annotations on the *Embryonic Breathing Sutra***\n\nThe ancient immortals said: *\"Embryo’ refers to the embryo of spirit; ‘breathing’ refers to the stilling of qi.\"* Thus, \"embryo\" denotes the supreme stability of spirit—unmoving, unshaken, free from sorrow or fear, thought or imagination—like an infant nestled in its mother’s womb. \"Breathing\" denotes the cessation of coarse qi, the halting of external respiration, so that qi is no longer drawn in, and the hundred vessels naturally harmonize in a single radiance.\n\nKnow that qi is like water, and spirit is like the moon. The moon’s movement arises from water’s ripples; the spirit’s agitation stems from qi’s pull. When water is still, the moon is bright; when qi is settled, the spirit is wise. In the Jade Fluid Returned Elixir, the practice is nothing other than the embrace of spirit and qi, neither issuing nor entering, like a woman with child.\n\nOnly by ensuring that spirit does not leave qi and qi does not leave spirit, each breath interdependent, can one attain great stillness and the Internal Elixir naturally form—hence the title *Embryonic Breathing Sutra*. \"Sutra\" means the constant Dao: this practice of embryonic spirit and breath is the eternal Way of the Jade Fluid.\n\nNow, \"spirit\" is called \"embryo.\" Consider pregnancy: after the union of the Two Fives, there is something within the womb, naturally abiding, unceasing in its flow, unbroken in its nurturance. Yet our spirit is restless all day, even in dreams unsettled—how can it hope to hibernate unmoving, vast and luminous?\n\nI have already noted that qi can stir the will, but the principle that the will can stir qi must not be overlooked. For scattered thoughts are not the true heart or true spirit—they are like wind. Water is inherently still, but wind stirs it into ripples. If the wind ceases, the water returns to clarity, and the moon’s reflection shines undisturbed. Thus, the adept eliminates the Three Minds and extinguishes the Four Marks. With delusive thoughts severed, the true spirit (the One Numinous) radiates, and qi naturally returns to its root, neither issuing nor entering.",
      "overlap_context": "re largely complete, allowing me to finally undertake this task—such is the origin of these annotations.\n\nFurthermore, I note the words left by the Perfected Min Xiao Gen: *\"To delight in needless difficulty is to waste a lifetime; to indulge in strange and ostentatious practices is utterly futile. Only this ordinary Way holds the secret of returning to the source. In three hundred days, the garden is ever luminously clear.\"* How excellent these words are! They resonate deeply with my own heart.",
      "start_char": 533,
      "end_char": 1791,
      "start_sentence": 16,
      "end_sentence": 55,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.57040619850159,
      "metadata": {
        "source_file": "dao\\藏外\\胎息经笺疏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "式一子（万启型）论转息法曰：“道在天地间，古今由一息，以道不可见，所可静观而领悟者，惟此一息耳。 而息有真凡，凡息者，呼吸也，人所易知，而凡息中之真息，惟修真者能知之。 至真息中之无息，无息中之不息，非真人莫辨。 虚极静笃之时，凡息除而真息见，杳杳冥冥之中，真息现而无息立，绵绵密密之顷，无息安而不息转。 知转息，即知转识，知转识，即知转几，知几其神乎？ 虽然，转息非易易也。 欲知转息，非知分息不可，欲知分息，非知离息不可，欲知离息，非知合息不可，欲知合息，非知通息不可，通则一、一而二、二而一也。 庄子所谓乘天地之正，而御六气之变，以游无穷者，非此之谓耶。 上疏经名竟 胎从伏气中结 神犹人也，气犹马也。 马载人驰，犹之气牵神动，故欲神定自在，有如孕妇之怀胎者，舍降伏其气，使气能归根蛰藏，莫由致也。 然归根何所？ 气如何伏？",
      "translated_text": "Shiyi Zi (Wan Qixing) expounds on the method of *zhuanxi* (revolving the breath), saying:\n\n“The Dao abides between Heaven and Earth; from ancient times to the present, it is borne by a single breath. Since the Dao cannot be seen, what may be quietly observed and realized is only this one breath. Yet breath has the true and the ordinary: ordinary breath is respiration, easily known to all, while within ordinary breath lies true breath, known only to those who cultivate the Real. Beyond true breath lies breathlessness, and within breathlessness lies non-breath—only the perfected person can discern these.\n\nAt the moment of utmost emptiness and profound stillness, ordinary breath departs and true breath appears. In the depths of boundless obscurity, true breath manifests and breathlessness arises. In the ceaseless, subtle continuity of the moment, breathlessness settles and non-breath revolves. To know the revolving of breath is to know the revolving of consciousness; to know the revolving of consciousness is to know the revolving of the subtlest movement—does this not approach the numinous?\n\nYet revolving the breath is no simple matter. To know the revolving of breath, one must first know *fenxi* (divided breath); to know divided breath, one must know *lixi* (detached breath); to know detached breath, one must know *hexi* (united breath); to know united breath, one must know *tongxi* (pervading breath). Pervading, it is one; one becomes two, two becomes one. Does this not correspond to what Zhuangzi meant by ‘riding the constancy of Heaven and Earth, steering the transformations of the six qi, and roaming the boundless’?\n\nThe above elucidates the classic’s title.\n\nThe embryo is formed within subdued qi.\nThe spirit is like a person; qi is like a horse.\nAs a horse carries a rider in gallop, so qi pulls the spirit into motion. Thus, if one wishes the spirit to abide in tranquility and freedom, like a pregnant woman carrying a child, nothing can be achieved without subduing the qi and returning it to its root, where it hibernates in concealment.\n\nBut where does it return to its root? How is qi subdued?”",
      "overlap_context": "he will can stir qi must not be overlooked. For scattered thoughts are not the true heart or true spirit—they are like wind. Water is inherently still, but wind stirs it into ripples. If the wind ceases, the water returns to clarity, and the moon’s reflection shines undisturbed. Thus, the adept eliminates the Three Minds and extinguishes the Four Marks. With delusive thoughts severed, the true spirit (the One Numinous) radiates, and qi naturally returns to its root, neither issuing nor entering.",
      "start_char": 1792,
      "end_char": 2152,
      "start_sentence": 56,
      "end_sentence": 69,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.262244462966919,
      "metadata": {
        "source_file": "dao\\藏外\\胎息经笺疏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "此中大有研究。 曹文逸云：专气致柔神久留。 北游语录云：尝记师父（指丘祖）大定间宣见时，论及诸功法，惟存想下丹田为最，然止一法耳，于道则未也。 幻真先生注胎息经曰：脐下三寸为气海，亦为下丹田。 尚按下丹田即神气归根之所，其适当部位，在脐后微下之处，但不可执定几寸几分，知其地就是，古云脐后腰前，心下肾上（此肾指阴跷穴），中间一带，不可拘执是也。 规中指南论玄牝曰：径寸之质，以混三才，在肾之上，心之下，仿佛其内，谓之玄关。 不可以有心守不可以无心求。 以有心守之，终莫之有；",
      "translated_text": "Here lies a profound subject for inquiry. Cao Wenyi states: *\"Focus the qi to achieve suppleness, and the spirit will abide long.\"* The *Record of Northern Journeys* recounts: *\"I recall my master (referring to Ancestor Qiu) expounding during a state of great samādhi that among all methods of practice, visualization of the lower dantian is paramount—yet it remains but one method, not the Dao itself.\"* Master Huanzhen’s commentary on the *Embryonic Breathing Classic* notes: *\"Three inches below the navel lies the Sea of Qi, also called the lower dantian.\"*\n\nFurthermore, the lower dantian is where spirit and qi return to their root. Its precise location lies slightly below and behind the navel, though one must not fixate on exact measurements in inches or fractions. Knowing the general area suffices. As the ancients said: *\"Behind the navel, before the waist; below the heart, above the kidneys\"* (here, \"kidneys\" refers to the *yinqiao* point). The region between these landmarks should not be rigidly defined.\n\nThe *Guidance Within the Compass* discusses the *Mysterious Gate* (*xuanpin*): *\"A substance of inch-wide dimension, uniting the Three Powers, situated above the kidneys and below the heart—its interior is vaguely discernible, called the Mysterious Pass. It cannot be grasped with intent, nor sought without intent. To grasp it with intent is to never attain it.\"*",
      "overlap_context": " boundless’?\n\nThe above elucidates the classic’s title.\n\nThe embryo is formed within subdued qi.\nThe spirit is like a person; qi is like a horse.\nAs a horse carries a rider in gallop, so qi pulls the spirit into motion. Thus, if one wishes the spirit to abide in tranquility and freedom, like a pregnant woman carrying a child, nothing can be achieved without subduing the qi and returning it to its root, where it hibernates in concealment.\n\nBut where does it return to its root? How is qi subdued?”",
      "start_char": 2152,
      "end_char": 2388,
      "start_sentence": 70,
      "end_sentence": 77,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.54920482635498,
      "metadata": {
        "source_file": "dao\\藏外\\胎息经笺疏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "以无心求之，终显其无，若何可也。 盖用志不分，乃凝于神，但存心绝虑，调息气匀，寂然常照，勿使昏散，候气安和，真人入定。 于此定中，观照内景，才若意到，其兆即萌，便觉一息，从规中起，混混续续，兀兀腾腾，存之以诚，听之以心，六根安定，胎息凝凝，不闭不数，任其自如，静极而嘘，如春沼鱼，动极而吸，如百虫蛰，氤氲开阖，其妙无穷。 如此少时，便须忘气合神，一归混沌，致虚之极，守静之笃，心不动念，无来无去，不出不入，湛然常住，是谓真人之息以踵踵者其息深深之竞，神气交感，此其候也。 元气所由生，真息所由起，此意到处，便见造化，此息起处，便是玄关，非高非下，非左非右，不前不后，不偏不倚，人一身天地之正中，正此处也。 采取在此，交媾在此，烹炼在此，沐浴在此，温养在此，然结胎在此，脱胎神化，无不在此。 此窍阳舒阴惨，本无正形，意到即开，开合有时，百日立基，养成气母，虚室生白，自然见之。 昔黄帝三月内观，盖此道也。 按陈真人此论，乃混中下二田而说等者。 然此中分辨，最不易知，惟闵真人天仙道程宝则，论之最祥。 其言曰：一尘不染，则其无杂念也可知。 念无而后息住，息住而后关开，此一定之理，然亦有一虚一寂而便开焉者，此乃气穴，非炁穴也。 气穴者，祖炁之所自出，而炁穴在其中。 炁穴开而玄关辟矣。 此一说也，知者鲜矣。 噫，此地仙之所以多夫天仙者与！ 失之毫厘，谬以千里，语曰：欲知山下路，须问过来人，不蒙师指，到老还成古董，是某之幸也。 夫师不云乎，不云乎，所穴不开，进火无门，炁穴不开，圣胎不结，忘而又忘，玄关斯辟，是二非二，是一非一，如鸡抱卵，不说而说。 万启型曰：气穴在下，炁穴在上，穴同而窍异也。 又曰：玄关未开，只是凝神于气穴，做人元功夫，玄关已开，则凝神于炁穴，直接天元矣。 于此可知初机之士，总以下田坤腹为依归，当其凝神聚气，现出玄关，此关乃有时而开，有时而不开者，故曰功到则现，机寂则隐，即是坤炉，一名神炉，乃起息止息之所，实即气穴也。 而此亦名玄关者，以系神气混一后所现，所谓玄妙机关也。 若真正玄关，一名玄窍，必于任督通理，人道已尽之后，虚静之极，此窍乃现，故有功非十年八载，难言开窍之说。 此窍开则常开，神有所藏，故各神室黄房，而炁自由阴跻起，经脘后脊前中缝，直透泥丸，而若无升无降者，此正黄中通理天仙结胎脱胎之地也。 抱朴子曰：故行炁，或可以治百病，或可以入瘟疫，或可以禁蛇虎，或可以止疮血，或可以居水中，或可以行水上，或可以辟饥渴，或可以延年命，其大要者，胎息而已。 得胎息者，能不以鼻口嘘吸，如以胞胎之中，则道成矣。 初学行炁，鼻中引炁而闭气，阴以心数，至一百二十，乃以口微吐之，吐之及引之。 皆不欲令己耳闻其炁出入之声，常令入多出少，以鸿毛着鼻口之上，吐炁而鸿毛不动为候也。 渐习转增其心数，久久可以至千，至千则老者更少，日还一日矣。 夫行炁当以生炁之时，勿以死炁之时也。 故曰仙人服六炁，此之谓也。 一日夜有十二时，其从夜半以至日中六时为生炁，从日中至夜半六时为死炁，死炁之时，行炁无益也。",
      "translated_text": "With intentless seeking, one ultimately reveals its nonexistence—how could this suffice?\n\nFor when focus remains undivided, spirit congeals; merely preserve the heart and sever thoughts, regulate the breath to evenness. In serene illumination, avoid dullness or distraction. Await the settling of qi into harmony, and the True Person enters samādhi. Within this samādhi, observe and reflect upon the inner landscape. The moment intent arises, its sign immediately germinates—one then senses a breath emerging from the *Compass Within*, flowing continuously, rising and surging without cease. Preserve it with sincerity, listen with the heart. The six senses settle, fetal breathing congeals, neither forced nor counted, left to its natural course. At the extreme of stillness, exhalation arises like fish in a spring pond; at the extreme of movement, inhalation comes like hibernating insects. With misty opening and closing, its wonders are boundless.\n\nAfter a brief interval, one must forget the breath and merge with spirit, returning wholly to primordial chaos. At the utmost of emptiness, the deepest stillness is maintained. The heart moves no thought, neither coming nor going, neither exiting nor entering—abiding in profound clarity. This is called the True Person’s breath, where the breath at the heels reaches its deepest culmination. Here, spirit and qi intermingle—this is the sign.\n\nFrom this arises primordial qi, from this arises true breathing. Where intent reaches, creation is perceived. Where this breath arises, there lies the *Mysterious Pass*. It is neither high nor low, neither left nor right, neither forward nor backward, neither biased nor partial. Within the human body’s microcosm, this is the very center.\n\nHere lies the place of gathering, of union, of refinement, of bathing, of gentle nurturing. Here, the embryo is knit; here, the embryo is shed in spiritual transformation—all occurs within this point. This aperture, where yang expands and yin contracts, has no fixed form. Intent arrives, and it opens; opening and closing occur in due time. After a hundred days, the foundation is laid, the *qi*-mother nurtured. From the empty chamber, light naturally arises. This was the Dao of the Yellow Emperor’s three-month inner contemplation.\n\nAccording to Master Chen’s discourse, this merges the middle and lower *dantian* in explanation. Yet distinguishing between them is most difficult to grasp. Only Master Min’s *Precious Scroll of the Heavenly Immortal’s Path* elucidates it in detail. He states: *\"When not a speck of dust clings, the absence of杂念 is evident. Only when thoughts cease does the breath settle; only when the breath settles does the pass open—this is an immutable principle. Yet there are those for whom a single moment of emptiness and stillness suffices to open it. This is the *qi*-cavity, not the *qi*-aperture. The *qi*-cavity is where ancestral *qi* naturally emerges, while the *qi*-aperture resides within it. When the *qi*-aperture opens, the *Mysterious Pass* unfolds. This is one explanation—few understand it.\"*\n\nAlas! This is why earthly immortals outnumber heavenly immortals. A deviation by a hair’s breadth leads to an error of a thousand miles. As the saying goes: *\"To know the path at the mountain’s foot, ask one who has traversed it.\"* Without a teacher’s guidance, one may toil in vain until old age, becoming a mere relic. How fortunate I am!\n\nDid not the master say: *\"If the *qi*-cavity does not open, there is no gate for advancing the fire. If the *qi*-aperture does not open, the sacred embryo will not form. Forgetting and forgetting again, the *Mysterious Pass* unfolds. It is two yet not two, one yet not one—like a hen brooding an egg, speaking without words.\"*\n\nWan Qixing said: *\"The *qi*-cavity lies below, the *qi*-aperture above—they share the same point but differ in aperture.\"* He also said: *\"Before the *Mysterious Pass* opens, one concentrates spirit upon the *qi*-cavity, practicing the work of the human element. Once the *Mysterious Pass* opens, one concentrates spirit upon the *qi*-aperture, directly connecting to the heavenly element.\"*\n\nFrom this, beginners should take the lower *dantian* and the earthly abdomen as their foundation. When concentrating spirit and gathering *qi*, the *Mysterious Pass* manifests—yet this pass may open or close at times. Thus, it is said: *\"When effort is sufficient, it appears; when the mechanism is still, it vanishes.\"* This is the *kun*-furnace, also called the spirit-furnace, the place where breath begins and ends—truly the *qi*-cavity. Yet it is also named the *Mysterious Pass* because it appears after spirit and *qi* merge, embodying the wondrous mechanism.\n\nHowever, the true *Mysterious Pass*, also called the *Mysterious Aperture*, only emerges after the *ren* and *du* meridians are unobstructed and the human Dao is fully realized. At the extreme of emptiness and stillness, this aperture appears. Thus, without decades of practice, one cannot speak of its opening. Once opened, it remains so, providing a sanctuary for spirit—hence the *Yellow Chamber* and *spirit abode*. From here, *qi* naturally arises from the *yinqiao*, ascending through the central seam between the spine and the front of the channels, piercing the *niwan* palace as if without ascent or descent. This is precisely the place where the *Yellow Center* connects to the heavens, where heavenly immortals form and shed their embryos.\n\n*Baopuzi* states: *\"Thus, practicing *qi* may cure a hundred illnesses, ward off plagues, subdue tigers and snakes, stanch bleeding wounds, dwell underwater, walk upon water, dispel hunger and thirst, or prolong life. Its essence lies in fetal breathing alone. Those who attain fetal breathing need not breathe through nose or mouth, as if within the womb—then the Dao is achieved.\"*\n\nFor beginners practicing *qi*, draw *qi* through the nose and hold the breath, counting silently to one hundred twenty before gently exhaling through the mouth. Both inhalation and exhalation should be so subtle that one’s own ears cannot hear the breath’s passage. Always let inhalation exceed exhalation. Place a goose feather before the nose and mouth—if the breath does not stir it, this is the sign. Gradually increase the count over time, eventually reaching a thousand. At a thousand, the aged grow younger, regaining a day for each day practiced.\n\nOne should practice *qi* only during the time of living *qi*, not during dead *qi*. Thus it is said: *\"The immortals ingest the six *qi*.\"* In a day and night, there are twelve hours. From midnight to noon, the six hours are living *qi*; from noon to midnight, the six hours are dead *qi*. Practicing *qi* during dead *qi* yields no benefit.",
      "overlap_context": "above the kidneys\"* (here, \"kidneys\" refers to the *yinqiao* point). The region between these landmarks should not be rigidly defined.\n\nThe *Guidance Within the Compass* discusses the *Mysterious Gate* (*xuanpin*): *\"A substance of inch-wide dimension, uniting the Three Powers, situated above the kidneys and below the heart—its interior is vaguely discernible, called the Mysterious Pass. It cannot be grasped with intent, nor sought without intent. To grasp it with intent is to never attain it.\"*",
      "start_char": 2388,
      "end_char": 3617,
      "start_sentence": 78,
      "end_sentence": 109,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.57985234260559,
      "metadata": {
        "source_file": "dao\\藏外\\胎息经笺疏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "善用炁者，嘘水，水为之逆流数步，嘘火，火为之灭，嘘虎狼，虎狼伏而不得动起，嘘蛇虺，蛇虺蟠而不能去，若他人为刀兵所伤，嘘之血即止，闻有为毒虫所中，虽不见其人，遥为嘘祝我之手，男嘘我左，女嘘我右，而彼人虽在百里之外，即时皆愈矣。 又中恶急疾，但吞三九之炁，亦登时差也。 但人性多燥，少能安静以修其道耳。 又行炁大要，不欲多食，及食生菜肥鲜之物，令人气强难闭，又禁恚怒，多恚怒则炁乱，既不得溢，或令人发颏，故甚少有能为者也。 摄生三要曰：养气者，须从调息起乎。 禅家谓息有四种，凡鼻息往来声者，此风也，守风则散； 虽无声而鼻中涩滞者，此喘也，守喘则结； 不声不滞而往来有迹者，此气也，守气则劳； 所谓息者，乃不出不入之义。 朱子调息铭曰：静极而嘘，如春沼鱼，动极而吸，如百曰蛰，春鱼得气而动，其动极微，寒虫含气而蛰，其蛰无朕，调息者，须似之绵绵密密，幽幽微微，呼则百骸万窃，气随以出，吸则百骸万窍，气随以入，调之不废，真气从生，诚要诀也。 又曰：养身者，毋令身中之气，有所违诤。 如行久欲坐，此从动入止也，将就坐时，先徐行数步，稍申其气，渐放身体，止气稍来，动气稍去，从此而坐，则粗不忤细矣。 如坐久欲行，此从止出动也，必稍动其身，或申手足，如按摩状，然后徐行，不然，细气在身，与粗气相忤矣，其余种种，依此推之。 又曰：习闭气而吞之，名曰胎息，嗽舌下泉咽之，名曰胎食，春食朝霞者，日始出赤气也； 秋食沦汉者，日没后赤黄气也； 冬食流瀣者，北方夜半气也； 夏食三阳者，南方日中气也。 勤而行之，可以辟谷，余试之良验。 又曰：初学调息，须想其气，出从脐出，入从脐灭，调得极细，然后不用口鼻，但以脐呼吸，如在胞胎中，故曰胎息。 初闭气一口，以脐呼吸，数之至八十一或一百二十，乃以口吐气出之，当令极细，以鸿毛着于口鼻之上，吐气而鸿毛不动为度，渐习转增，数之久可至千，则老者更少，日还一日矣。 葛仙翁每盛暑，辄入深渊之底，一日许乃出，以其能闭气胎息耳。 但知闭气，不知胎息，无益也。 又曰：气欲柔，不欲强，欲顺，不欲逆，欲聚，不欲散，故道家最忌嗔，嗔心一发，则气强而不柔，逆而不顺，乱而不定，散而不聚矣。 若强闭之，则令人发咳。 故道者须如光风霁月，景星庆云，无一毫乖戾之气，而后可行功。 又食生菜肥鲜之物，亦令人气强难闭，食非时动气之食，亦令人气逆。 又多思气乱，多言气散，皆当深戒。 三丰真人道言浅近说曰：凝神于虚，如坐高山而视众山众水，如燃天灯而照九幽九昧。 调息不难，心神一静，随息自然，我只守其自然，加以神光下照，即调息也。 调息者，调度阴跻之息，与吾心中之气，相会于气穴中也。 又曰，心止于脐下曰凝神，气归于脐下曰调息，神息相依，守其清净自然曰勿忘，顺其清净自然日勿助，勿忘勿助，以默以柔，息活泼而心自在，即用钻字诀，以虚空为藏心之所，以昏默为息神之乡，三番两次，澄之又澄，忽然神息相忘，神炁融和，不觉恍然阳生而人如醉矣。 又曰：调息须以后天呼吸寻真人呼吸之处，古云，后天呼吸起微风，引起真人呼吸功，然调后天呼吸，须任他自调，方能调得起先天呼吸，我惟致虚守静而已，真息一动，玄关即不远矣。",
      "translated_text": "One skilled in the use of *qi* may, by exhaling upon water, cause it to flow backward for several paces; by exhaling upon fire, extinguish it; by exhaling upon tigers and wolves, render them crouched and unable to rise; by exhaling upon serpents and vipers, coil them so they cannot flee. If another is wounded by blade or weapon, exhaling upon the injury will stanch the blood. Should one hear of another bitten by venomous creatures, though unseen, one may exhale from afar while reciting an incantation over one’s own hand—men exhale over the left, women over the right—and even if the afflicted lies a hundred *li* distant, they will be instantly cured. For sudden ailments or acute afflictions, merely swallowing the *qi* of three nines will bring immediate recovery.\n\nYet human nature is often restless, and few can remain tranquil to cultivate the Way. Moreover, in the practice of *qi*, one must not overeat, nor consume raw vegetables, rich meats, or overly fresh foods, for these strengthen the *qi* and make it difficult to contain. One must also refrain from anger, for excessive wrath disorders the *qi*, preventing its overflow and sometimes causing swelling in the jaw. Thus, few succeed in this art.\n\nThe Three Essentials of Nurturing Life state: To cultivate *qi*, one must begin with regulating the breath. The Chan school speaks of four kinds of breath: that which produces sound in the nostrils is *wind*—to focus on wind is to scatter; though soundless, if the breath is rough and obstructed, it is *panting*—to focus on panting is to bind; though neither noisy nor obstructed, if its passage is perceptible, it is *breath*—to focus on breath is to labor. The true *breath* is that which neither enters nor exits.\n\nMaster Zhu’s *Inscription on Regulating the Breath* says: When stillness reaches its limit, exhale like fish in a spring pond; when movement reaches its limit, inhale like creatures in winter hibernation. Fish in spring stir with the *qi*, their movement exceedingly subtle; insects in winter hibernate with the *qi*, their stillness without trace. In regulating the breath, one must emulate this—subtle, continuous, quiet, and faint. With each exhalation, the *qi* follows out through the hundred bones and ten thousand pores; with each inhalation, the *qi* follows in through the hundred bones and ten thousand pores. If this regulation is unceasing, true *qi* will arise—this is the essential method.\n\nIt further states: In nurturing the body, one must not allow the *qi* within to conflict. For instance, when walking for a long time and wishing to sit, this is a transition from movement to stillness. As one prepares to sit, first walk slowly for a few steps, gently extending the *qi*, gradually relaxing the body. The *qi* of stillness will arrive as the *qi* of movement departs. Sitting thus, the coarse will not clash with the fine. Conversely, when sitting for a long time and wishing to walk, this is a transition from stillness to movement. One must first stir the body, stretching the limbs as if massaging them, then begin to walk slowly. Otherwise, the fine *qi* within will conflict with the coarse *qi*—all other transitions follow this principle.\n\nIt also says: Practicing breath-holding and swallowing it is called *embryonic breathing*; swirling the spring beneath the tongue and swallowing it is called *embryonic nourishment*. In spring, one consumes the morning glow—the red *qi* at sunrise; in autumn, the sinking Han—the red-yellow *qi* after sunset; in winter, the flowing night mist—the *qi* of the northern midnight; in summer, the three yang—the *qi* of the southern noon. Diligently practicing this can enable grain avoidance, and I have tested it with good results.\n\nIt further states: When first learning to regulate the breath, one must imagine the *qi* exiting and entering through the navel. Once the breath is refined to extreme subtlety, one may abandon the use of mouth and nose, breathing solely through the navel, as if within the womb—hence the term *embryonic breathing*. Initially, hold one breath, breathing with the navel, counting to eighty-one or one hundred twenty before exhaling through the mouth. The exhalation should be exceedingly fine, such that a goose feather placed before the nose and mouth remains unmoved. With gradual practice, the count may be increased over time, eventually reaching a thousand. At a thousand, the aged grow younger, regaining a day for each day practiced.\n\nMaster Ge the Immortal would, even in the height of summer, descend to the depths of deep abysses, remaining for a day before emerging—this was due to his mastery of breath-holding and *embryonic breathing*. Yet merely knowing breath-holding without *embryonic breathing* is of no benefit.\n\nIt further states: The *qi* should be soft, not forceful; compliant, not contrary; gathered, not scattered. Thus, Daoists most abhor wrath, for the moment anger arises, the *qi* becomes forceful rather than soft, contrary rather than compliant, disordered rather than settled, scattered rather than gathered. Forcing its containment may cause coughing. Therefore, the practitioner must be like a clear breeze after rain, a bright moon after clouds, a lucky star or auspicious cloud—without a trace of perverse *qi*—before progress can be made. Consuming raw vegetables, rich meats, or overly fresh foods also strengthens the *qi*, making it difficult to contain. Eating at irregular times or consuming foods that stir the *qi* also causes it to become contrary. Excessive thought disorders the *qi*, and excessive speech scatters it—both must be deeply avoided.\n\nThe True Man of Three Peaks’ *Plain Teachings on the Dao* says: Concentrate the spirit in emptiness, as if sitting atop a high mountain gazing upon all other mountains and waters, or lighting a heavenly lamp to illuminate the nine depths and nine obscurities. Regulating the breath is not difficult—once the heart and spirit are still, the breath follows naturally. One need only guard its spontaneity while directing the light of the spirit downward, and the breath will be regulated. To regulate the breath is to harmonize the *qi* of the Yin Heel Vessel with the *qi* in one’s heart, meeting within the *qi* cavity.\n\nIt further says: When the heart rests below the navel, it is called *concentrating the spirit*; when the *qi* returns below the navel, it is called *regulating the breath*. When spirit and breath depend on each other, guarding their natural purity is called *non-forgetting*; following their natural purity is called *non-assistance*. Neither forgetting nor assisting, in silence and softness, the breath becomes lively and the heart at ease. Employ the *drilling* method: use emptiness as the dwelling for the heart, and profound stillness as the abode of the spirit and breath. After two or three attempts, refining again and again, suddenly spirit and breath will forget each other, merging and harmonizing. Unaware, one will feel as if yang has arisen, and the person becomes intoxicated.\n\nIt further says: In regulating the breath, one must use the postnatal breathing to seek the place of the true person’s breathing. As the ancients said: *\"Postnatal breathing stirs a gentle wind, drawing forth the true person’s breathing.\"* Yet in regulating postnatal breathing, one must allow it to regulate itself, only then can the prenatal breathing be cultivated. I need only attain emptiness and guard stillness—once the true breath stirs, the Mysterious Pass is not far.",
      "overlap_context": "e sign. Gradually increase the count over time, eventually reaching a thousand. At a thousand, the aged grow younger, regaining a day for each day practiced.\n\nOne should practice *qi* only during the time of living *qi*, not during dead *qi*. Thus it is said: *\"The immortals ingest the six *qi*.\"* In a day and night, there are twelve hours. From midnight to noon, the six hours are living *qi*; from noon to midnight, the six hours are dead *qi*. Practicing *qi* during dead *qi* yields no benefit.",
      "start_char": 3617,
      "end_char": 4899,
      "start_sentence": 110,
      "end_sentence": 141,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.276965618133545,
      "metadata": {
        "source_file": "dao\\藏外\\胎息经笺疏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "照此进功，筑基可翘足而至，不必百日也。 尚按伏气胎息，必依调息为功，调息之法，三丰最详，故本注多引之，乃真仙口诀也。 至于闭息一法，古仙多有辟之者，然亦有其相当作用，未可厚非，不过行持须极自然最好由调绵绵之中和气入手而渐企之，余已详述于气功保健的研究和实践中矣。 张紫阳真人金丹四百字自序中有曰：要须知夫身中一窍，名曰玄牝，此窍者，非心非肾，非口非鼻，非脾胃，非谷道，非膀胱，非丹田，非泥丸，能知此一窍，则冬至在此矣，药物在此矣，火候在此矣，沐浴亦在此矣，结丹亦在此矣，脱体亦在此矣。 夫此一窍，亦无返旁，更无内外，乃神气之根，虚无之谷，在身中求之，不可求于他也。 此之一窍，不可以私意揣度，是必心传口授苟或不而，皆妄为矣。 闵一得真人注曰，揣度即是念头，夫大道教人忘念，乌可私意揣度，然而戒揣度，又戒他求，谓必心传口授者，显示学者以必由心得也。 在上智之人，天怀素定者，读之自可顿入，中智之士，功需渐进者，尚恐觅趋径而无由，吾今仰体张祖婆心，普为学人身中，指一入窍正路，厥为止念一法，夫欲止念，先须惩忿窒欲，去除种种杂念，只留正念，正念虽留，却不许有依附旁念，潜滋暗长，俄而此念顿息，后念未起，正是万虑消忘，绝妙好时，得师一句，便能心受矣。 然人果能于前念已断，后念未续之际，当下猛然一觉，不啻心传，尽堪自得，夫亦何待夫口授耶。 只要当下得觉，切勿自惊，弗自惊者，则居之安，居之安，则身中药材亦资之深，而所谓法度者，亦取诸左右逢其源矣。 上文所谓冬至药物火候等等，尽在于此者信也。 若以私意揣度之，不几南辕而北辙哉，乌乎可。 尚按道宗一般传授，多是修气以摄心之渐乘，而真人示以上止念即知玄牝，则是道宗之无上上乘，修心摄气，一了百当之法门也。 此理与佛法显教之禅宗及密教所传之大手印大圆满，大可相通，大宜着眼。 气从有胎中息 气如何息，惟赖神明大定，如妇之有胎然。 古仙云，神一出，便收来，神返身中气自回。 吕祖师百句章曰：无念方能静，静中气自平，气乎息乃住，息住自归根，归根见本性，见性始为真。 神入恍惚杳冥之乡，形归虚无寂寥之境，所谓养命资于养性，正谓此也。 广成子曰：至道之精，窈窈冥冥，至道之极，昏昏默默。 无视无听，抱神以静，形将自正。 必静必清，无劳汝形，无摇汝精，乃可以长生。 目无所见，耳无所闻，心无所知，汝神将守形，形乃长生。 慎汝内，闭汝外，多知为败。 我守其一，以处其和，故我修身千二百岁，而形未尝衰。 彭祖曰：道不在顺，但能不思衣，不思食，不思声，不思色，不思胜，不思负，不思失，不思得，不思荣，不思辱，心不劳，形不极，常导引，内气息，但尔，可得千岁。 （一有不思曲，不思直二句）。 白真人玄关显秘论曰：炼形之妙，在乎凝神，神凝则气聚，气聚则丹成，丹成则形固，形固则神全。 故谭真人（谭紫霄，有化书）云，忘形以养气，忘气以养神，忘神以养虚，忘虚以养道，忘忘则功园。 张虚靖天师大道歌曰：道不远在身中，物则皆空性不空，性若不空和气住，气归元海寿无穷。",
      "translated_text": "Pursuing practice in this manner, the foundation may be established with ease, requiring not even a hundred days.\n\nFurthermore, in refining *qi* through embryonic breathing, one must rely on breath regulation as the method. The techniques of breath regulation were most thoroughly expounded by [Zhang] Sanfeng, and thus this commentary frequently cites him—these are the true oral instructions of the immortals. As for the method of breath retention, many ancient immortals have rejected it, yet it also has its appropriate applications and cannot be entirely dismissed. However, in practice, one should proceed with utmost naturalness, beginning with the harmonious *qi* of gentle, continuous regulation and gradually advancing. I have already discussed this in detail in *Research and Practice of Qigong for Health Preservation*.\n\nIn the preface to *Four Hundred Words on the Golden Elixir* by the Perfected Zhang Ziyang, it is said: *\"One must know that within the body there is an aperture called the Mysterious Female. This aperture is neither heart nor kidney, neither mouth nor nose, neither spleen nor stomach, neither the anus nor the bladder, neither the Cinnabar Field nor the Mud Pill Palace. To know this aperture is to know where the Winter Solstice resides, where the medicinal substances are found, where the firing times are set, where the bathing occurs, where the Elixir coalesces, and where the body is transcended. This aperture has no left or right, no inside or outside—it is the root of spirit and *qi*, the valley of emptiness. One must seek it within the body and not elsewhere. This aperture cannot be conjectured by private speculation; it must be transmitted heart-to-heart and mouth-to-mouth. Should one proceed otherwise, all efforts are in vain.\"*\n\nThe Perfected Min Yide annotates: *\"Conjecture is merely a thought. The Great Dao teaches one to forget thoughts—how can one speculate with private intent? Yet to forbid conjecture is also to forbid external seeking. The insistence on heart-to-heart and mouth-to-mouth transmission is to show the seeker that realization must come from within. For those of superior wisdom, whose celestial disposition is already settled, reading this may lead to sudden enlightenment. For those of middling capacity, who must progress gradually, there is still the risk of seeking shortcuts without guidance. Now, in reverence for the compassionate intent of Ancestor Zhang, I shall point out the correct path for entering this aperture within the body of all practitioners: it is the method of stopping thoughts. To stop thoughts, one must first curb anger and restrain desires, eliminating all杂念 and retaining only the right thought. Though the right thought is retained, one must not allow it to cling to subsidiary thoughts, which may subtly grow. When this thought suddenly ceases and the next has not yet arisen, all concerns vanish—this is the most wondrous moment. Receiving a single phrase from the teacher at this instant, one may directly grasp it in the heart. Yet if one can, in the gap between the cessation of the prior thought and the arising of the next, suddenly awaken with a single decisive awareness, it is no different from heart-to-heart transmission—what need is there for oral instruction? The key is to awaken in that instant, without startling oneself. Not startling oneself brings stability; stability deepens the medicinal substances within the body, and the so-called method and measure will naturally flow from all sides. The Winter Solstice, medicinal substances, firing times, and all else mentioned above are truly found here. If one speculates with private intent, will this not be like traveling south by driving north? How could it be otherwise?\"*\n\nFurthermore, the general transmission of the Daoist lineage often follows the gradual path of refining *qi* to gather the heart-mind, whereas the Perfected One’s teaching—that stopping thoughts reveals the Mysterious Female—is the supreme vehicle of the Daoist lineage, a method of refining the heart-mind to gather *qi* that resolves all at once. This principle aligns with the Chan School of the exoteric Buddhist teachings and the Great Seal and Great Perfection transmitted in the esoteric teachings—this is most worthy of attention.\n\n*Qi* breathes as if within the womb—how does it breathe? It relies entirely on the great stillness of spirit. As the ancient immortals said: *\"When spirit departs, draw it back; when spirit returns to the body, *qi* naturally follows.\"* Master Lü’s *Hundred Verses* states: *\"Without thought, stillness arises; in stillness, *qi* naturally levels. When *qi* breathes and rests, it returns to the root. Returning to the root, one sees the original nature; seeing the original nature is true realization.\"*\n\nWhen spirit enters the realm of profound indistinctness and the body returns to the state of emptiness and silence, this is what is meant by *\"nurturing life through nurturing nature.\"* The *Master of Broad Accomplishment* said: *\"The essence of the supreme Dao is subtle and obscure; its ultimate is dim and silent. Without seeing, without hearing, embrace spirit in stillness—then the body will naturally rectify itself. Be still, be clear; do not labor your form, do not disturb your essence—only then can you attain longevity. With eyes that see nothing, ears that hear nothing, a heart that knows nothing, your spirit will guard your form, and your form will attain longevity. Guard your inner self, close off the outer; excessive knowledge leads to ruin. I guard the One and abide in harmony—thus I have cultivated my body for one thousand two hundred years, yet my form has never declined.\"*\n\nPeng Zu said: *\"The Dao does not lie in compliance. Simply do not think of clothing, do not think of food, do not think of sound, do not think of color, do not think of victory, do not think of defeat, do not think of loss, do not think of gain, do not think of honor, do not think of disgrace. Let the heart-mind not labor, the body not exhaust itself; constantly guide and lead the inner *qi* to rest—thus may one attain a thousand years.\"* (Some versions include the lines: *\"Do not think of crookedness, do not think of straightness.\"*)\n\nThe *Perfected Bai’s Treatise on Revealing the Secrets of the Mysterious Pass* states: *\"The subtlety of refining the form lies in concentrating spirit. When spirit is concentrated, *qi* gathers; when *qi* gathers, the Elixir forms; when the Elixir forms, the form is stabilized; when the form is stabilized, spirit is preserved whole.\"*\n\nThus, the Perfected Tan (Tan Zixiao, author of the *Book of Transformations*) said: *\"Forget the form to nurture *qi*; forget *qi* to nurture spirit; forget spirit to nurture emptiness; forget emptiness to nurture the Dao. In forgetting all, the work is perfected.\"*\n\nThe Celestial Master Zhang Xuqing’s *Song of the Great Dao* says: *\"The Dao is not far—it is within the body. All things are empty, yet nature is not empty. If nature is not empty, harmonious *qi* abides; when *qi* returns to the primordial sea, life is boundless.\"*",
      "overlap_context": " becomes intoxicated.\n\nIt further says: In regulating the breath, one must use the postnatal breathing to seek the place of the true person’s breathing. As the ancients said: *\"Postnatal breathing stirs a gentle wind, drawing forth the true person’s breathing.\"* Yet in regulating postnatal breathing, one must allow it to regulate itself, only then can the prenatal breathing be cultivated. I need only attain emptiness and guard stillness—once the true breath stirs, the Mysterious Pass is not far.",
      "start_char": 4899,
      "end_char": 6133,
      "start_sentence": 142,
      "end_sentence": 171,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.748595237731934,
      "metadata": {
        "source_file": "dao\\藏外\\胎息经笺疏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "欲得身中神不出，莫向灵台留一物，物在身中神不清，耗散精神损筋骨。 神驭气，气留形，不须杂术自长生，术则易知道难悟，既然悟得不专行，所以千人万人学，毕竟终无一二成。 神若出，便收来，神返身中气自回，如此朝朝还暮暮，自然赤子产真胎。 曹文逸真人云：神不外驰气自定。 丹阳真人语录曰：师曰：炁之难御，迅若奔马，唯静者为易，必去其外慕，虽观纷华之在眼前，正如深山穷谷中，方是道人心肠，倘不到无心地面，莫能制御，是知道者，贵于无心也。 北游语录曰：吾今以实言告众，众等听之，非我之私言也，师真之言也。 人之学道奉善，初心莫不精进，行之未久而退怠，以其妄有所求，卒不见其验，则疑惑不能自解，故中道而废。 圣人设教于天下后世，惟欲人去妄复性，而不使情欲乱于中，使其心得其平常，为入道之本。 圣人岂独无情哉，能自不动其心耳。 如天有四时，寒暑运用，雷霆风雨，万变于前，而太虚之真体未尝动，学人体究到此，是到平常地色，故有云，平常是道。 先保此平常，其积行累功，皆由乎己，是在我者也。 道之显验，圣贤把握，是在天者也。 当尽其在我者，而任其在天者，功行既全，道乃自得，若有心以求则妄矣。 又曰：清静有内有外，有无为，有有为，惟无为自得，是谓真清静，圣贤与之也。 今之学人，或有存想吐纳以为事者，善则善矣，终不见其成功，正如入冬时，能开诸花卉于覆荫中，非不奇也，然终不能成其实，惟无为清静，是为至极，无漏为验也。 三年不漏，则不丹结，六年则中丹结，其事已有不可具言者，九年上丹结，转入泥丸，三宫升降，变化无穷，虽千百亿化身，亦自此出。 何以能致此？ 曰：必心地平常以为本，心平则神定，神定则精凝，精凝则气和，竹然见于面，发于四肢，无非自然，盖初以心地平常为本故也。 此在乎己者，固不可不尽，系夫天者，不可以强致，惟其积累功行既至，则有所自得。 又曰：丘祖云，俺与丹阳，同遇祖师学道，令俺重作尘劳，不容少息，与丹阳默谈玄妙，一日闭其户，俺窍中听之，正传谷神不死调息之法，久之，推户入，即止其说，俺自此后，尘劳了毕，力行所闻之法，行之虽至，然丹阳二年半了道，俺千万苦辛，十八九年，犹未有验，祖师所传之道一也 ，何为有等须如此，只缘各人所积功行有浅深，是以得道有迟速，丹阳非一世修行，至此世，功行已满，用此谷神之道，当其时耳 ，故速见其验，俺之功行未备，纵行其法，久而无验，固其宜也 。 修行人必先全抛世事，齐修万行，使一物不累，一心致虚，至寂无所寂之地，功行兼备则福至，福至则心开，一点光明透入，即天地之根，二物自然合而为一，方用绵绵之道以存养之，使之充实，则永劫不死矣。 摄生三要曰：聚精在于养气，养气在于存神，神之于气，犹母之于子也。 （按中载炼精之诀，须夜半子时，披衣起坐，两手搓极热，以一手将外肾兜住，以一手掩脐而凝神于内肾，久久习之而精旺矣）。 故神凝则气聚，神散则气消，若宝惜精气而不知存神，是茹其华而忘其根矣。 又曰：禅门止观，乃存神要诀，一日 系缘守境止，即系念一处是也。",
      "translated_text": "To keep the spirit within the body, let nothing linger in the mind’s chamber. If things remain within, the spirit is not clear—it dissipates vitality and weakens sinew and bone.\n\nSpirit commands *qi*; *qi* sustains form. No need for miscellaneous arts—longevity comes of itself. Arts are easy to know, but the Dao is hard to awaken to. Even if awakened, without single-minded practice, of the thousands who study, barely one or two succeed.\n\nIf the spirit strays, draw it back. When spirit returns to the body, *qi* naturally follows. Morning after morning, evening after evening, the true embryo of the Red Child is born.\n\nThe Perfected Cao Wenyu said: *\"When spirit does not stray outward, *qi* settles of itself.\"*\n\nFrom the recorded sayings of the Perfected Dan Yang:\nThe Master said: *\"Qi* is hard to master—swift as a galloping horse. Only stillness makes it easy. One must abandon external attachments. Though splendid sights unfold before the eyes, regard them as if in a deep mountain valley. This is the heart of a Daoist. If one has not reached the state of no-mind, mastery is impossible. Thus, those who know the Dao value no-mind.\"*\n\nFrom the *Record of Northern Travels*:\n*\"Now I speak truthfully to all of you—these are not my private words, but the words of the Perfected Masters. Those who study the Dao and uphold goodness begin with diligence, but before long, they grow lax. They cling to deluded desires, and when no results appear, doubt arises, unshakable. Thus, they abandon the path halfway.*\n\n*The sages established teachings for later generations to dispel delusion and restore nature, preventing emotions and desires from disturbing the heart. When the heart finds its natural equilibrium, this is the foundation of entering the Dao. Were the sages without emotion? They simply did not let their hearts be moved. Like heaven’s four seasons—cold and heat in motion, thunder, wind, and rain transforming all before them—yet the true essence of the Great Void never stirs. When practitioners investigate this to its core, they reach the state of ordinary mind. Hence it is said: ‘The ordinary is the Dao.’*\n\n*First preserve this ordinariness. Accumulated practice and merit depend on oneself—this is what lies within our power. The manifestation of the Dao, grasped by sages and worthies, lies with heaven. One must fulfill what is within one’s power and leave what lies with heaven. When merit and practice are complete, the Dao is naturally attained. To seek it with intention is delusion.*\n\n*It is also said: Purity and stillness have inner and outer aspects, non-action and action. Only non-action leads to true attainment—this is genuine purity and stillness, bestowed by sages and worthies. Today’s practitioners may engage in visualization or breath regulation, which is good, yet they never see success. It is like forcing flowers to bloom in winter under shelter—not without marvel, but they never bear fruit. Only non-action and stillness reach the ultimate, with the sign of no leakage. After three years without leakage, the lesser elixir forms; after six years, the middle elixir forms—matters beyond full expression. After nine years, the upper elixir forms, ascending into the Mud Pill Palace. The Three Palaces rise and descend, transformations endless. Even a thousand or ten thousand emanation bodies emerge from this. How is this achieved? By taking the ordinary mind as the foundation. When the mind is at peace, spirit stabilizes; when spirit stabilizes, essence congeals; when essence congeals, *qi* harmonizes. This manifests in the face and radiates through the four limbs—all naturally. The root lies in taking the ordinary mind as the foundation.*\n\n*What lies within our power must be fully realized; what depends on heaven cannot be forced. Only when merit and practice accumulate sufficiently does attainment come of itself.*\n\n*It is also said: Patriarch Qiu said, ‘Dan Yang and I both studied the Dao under the same master. The master sent me back into worldly labor without rest, while Dan Yang received silent transmission of the mysteries. One day, the master shut his door. I listened through the window and heard him teaching the method of ‘the Valley Spirit never dies’—breath regulation. After a long time, he opened the door and stopped speaking. After that, once my worldly duties were complete, I practiced what I had heard. Though I practiced diligently, Dan Yang attained the Dao in two and a half years, while I endured countless hardships for eighteen or nineteen years without results. The Dao our master transmitted was the same—why such disparity? Only because each person’s accumulated merit and practice differ in depth, so attainment comes sooner or later. Dan Yang’s cultivation spanned lifetimes; by this life, his merit was complete. Applying the Valley Spirit’s method at that time, he quickly saw results. My merit was incomplete, so even with long practice, no results appeared—this was only natural.’*\n\n*Practitioners must first cast aside worldly affairs, cultivate all virtues, free themselves from every encumbrance, and focus the mind on emptiness until reaching the state of stillness beyond stillness. When merit and practice are complete, fortune arrives; when fortune arrives, the heart opens. A single point of light enters—this is the root of heaven and earth. The two substances naturally merge into one. Then, apply the unbroken thread of the Dao to nurture it, filling it to fullness, and one becomes deathless for eternal kalpas.*\n\n*The *Three Essentials of Nurturing Life* states: ‘Gathering essence depends on nurturing *qi*; nurturing *qi* depends on preserving spirit. Spirit’s relation to *qi* is like a mother’s to her child.’ (It records the method of refining essence: at midnight, rise and sit up, rub both hands until extremely hot, use one hand to support the external kidneys, and the other to cover the navel, concentrating spirit on the internal kidneys. With long practice, essence flourishes.) Thus, when spirit congeals, *qi* gathers; when spirit scatters, *qi* dissipates. If one treasures essence and *qi* but neglects spirit, it is like enjoying the flower while forgetting the root.*\n\n*It also says: The Chan school’s *cessation and insight* is the essential method of preserving spirit. One day’s ‘binding to a single object’ is the same as fixing the mind on one point.\"*",
      "overlap_context": "o, author of the *Book of Transformations*) said: *\"Forget the form to nurture *qi*; forget *qi* to nurture spirit; forget spirit to nurture emptiness; forget emptiness to nurture the Dao. In forgetting all, the work is perfected.\"*\n\nThe Celestial Master Zhang Xuqing’s *Song of the Great Dao* says: *\"The Dao is not far—it is within the body. All things are empty, yet nature is not empty. If nature is not empty, harmonious *qi* abides; when *qi* returns to the primordial sea, life is boundless.\"*",
      "start_char": 6133,
      "end_char": 7358,
      "start_sentence": 172,
      "end_sentence": 200,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.283933877944946,
      "metadata": {
        "source_file": "dao\\藏外\\胎息经笺疏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "二日制心止，不复系心一处，但觉念动，随而止之，所谓不怕念起，惟怕觉迟也。 三日体真止，俗缘万殊，真心不动，一切顺逆等境，心不妄缘，盖体真而住也。 养生肤语曰：人始死，耳目口鼻手足形体具足，而父母兄弟妻子莫之爱者，谓其神之去也，然则人之所爱，在神不在形矣，而今人所养，顾在形不在神，何耶？ 今人作文神去，作事神去，好声神去，好色神去，凡动静运用纷纭，神无不去，人莫之惜，顾神绝，乃独悲之深焉，是何见之晚也。 人之致思发虑，致一思，出一神，注一念，出一神，如分火焉，火愈分，油愈干，火愈小； 神愈分，精愈竭，神愈少。 及其绝而悲之深焉。 是何见之晚也。 古仙云，神一出，便收回，神返身中气自回，如此朝朝并暮暮，自然翁妪返童孩，噫，其诚通天地之生机也夫。 又曰：陆元鹤谈养生之旨曰，不过藏神于渊，令不外游，久之自然神化，毋多谈。 三丰祖师道言近说曰：大道从中字入门，所谓中字者，一在身中，一不在身中，功夫须两层做。 第一寻身中之中，朱子云守中制外。 夫守中者，须要回光返照，注意规中，呈脐下一寸三分处，，不即不离，此寻身中之中也。 第二求不在身中之中，中庸云喜怒哀乐之未发。 此未发时，不闻不见，戒慎幽独，自然性定神清，神清气慧，到此方见本来面目，此求不在身中之中也。 以在身中之中，求不在身中之中，然后人欲易净，天理复明，千古圣贤仙佛，皆以此为第一步功夫。 又曰：凝神调息，调息凝神，八个字就是下手功夫，须一片做去，分层次而不断乃可。 凝神者，收已清之心而入其内也。 心未清时，眼勿乱闭，先要自劝自勉，劝得回来，清凉恬淡，始行收入气穴，乃曰凝神，凝起神了，然后如坐高山而视众山众水，如燃天灯而照九幽九昧，所谓凝神于虚者此也。 又曰：潜心于渊，神不外游，心牵于事，火动于中，火动于中，必摇其精，心静则息自调，静久则心自定，死心以养气，息切以纯心，精气神为内三宝，耳目口为外三宝，常使内三宝不逐物而游，外三宝不透中而扰，呼吸绵绵，深入丹田，使呼吸为夫妇，神气为子母，子母夫妇，聚而不离，故心不外驰，意不外想，神不外游，精不妄动，常熏蒸于四肢，此金丹大道之正宗也。 又曰：凝神调息，只要心平气和。 心平则神游，气和则息调。 心平，平字最妙，心不起波之谓平，心执其中之谓平，平即在此中也。 心在此中，乃不起波，即丹经之玄关一窍也。 又曰：修炼不知玄关，无论其他，只此便如入暗室一般，从何下手？ 玄关者，气穴也，气穴也，神入气中，如在深穴之中也，神气相恋，则玄关之体已立。 伍冲虚真人曰：古胎息经云，胎从伏气中结，炁从有胎中息，斯言为过去未来诸神仙天仙之要法也。 予愿再详译而直论之。 失人身初时，只二炁合一为虚空之炁而已，无胎也，亦无息也，因母呼吸而长为胎，因胎而长为息，及至胎全，妙在随母呼吸而为呼吸，所以终日呼吸而不逼闷，此缘不由口鼻呼吸，只脐相通，故能似无息一般，此正真胎息景也。 离胎而息即断，无母脐与子脐相通，不得不向自身口鼻起呼吸，即与胎中呼吸同而暂异其窍耳。",
      "translated_text": "\"Second is *restraining the mind to cessation*: no longer binding the mind to one place, but whenever a thought arises, immediately halting it. This is what is meant by ‘not fearing thoughts arising, only fearing delayed awareness.’\n\nThird is *embodying the true cessation*: amidst the myriad worldly conditions, the true mind remains unmoved. In all circumstances of fortune or adversity, the mind does not recklessly follow external objects—this is abiding by embodying the true.\n\n*The Nourishing Life Skin and Tongue* says: When a person first dies, their ears, eyes, mouth, nose, hands, and feet—all their physical form—remain intact, yet their parents, siblings, spouse, and children no longer love them. Why? Because their spirit has departed. Thus, what people love is the spirit, not the form. Yet today, what people cultivate is the form, not the spirit—why is this?\n\nToday, when people compose literature, their spirit departs; when they handle affairs, their spirit departs; when they delight in sounds, their spirit departs; when they indulge in sensual pleasures, their spirit departs. In all their movements and activities, their spirit scatters without cease, yet they do not regret it. Only when the spirit is utterly exhausted do they grieve deeply—how belated is their insight!\n\nWhen a person engages in thought and contemplation, each thought emits a spirit, each focused intention emits a spirit, like dividing a flame: the more it is divided, the more the oil is depleted, and the smaller the flame grows. The more the spirit is divided, the more essence is exhausted, and the less spirit remains. Only when it is cut off do they grieve deeply—how belated is their insight!\n\nAn ancient immortal said: ‘The moment the spirit departs, draw it back. When the spirit returns to the body, *qi* naturally returns. If you do this morning and night, naturally the old man and woman will revert to childhood.’ Alas! This truly communicates the life-force of heaven and earth.\n\nIt also says: Lu Yuanhe, discussing the essence of nourishing life, stated: ‘It is nothing more than concealing the spirit in the abyss, preventing it from wandering outward. Over time, the spirit will naturally transform—no need for excessive talk.’\n\nMaster Sanfeng’s *Daoist Words in Plain Speech* says: The great Dao enters through the character *zhong* (center). This *zhong* has two meanings: one within the body, and one beyond the body. The practice must be done in two layers.\n\nFirst, seek the *zhong* within the body. As Zhu Xi said: ‘Guard the center to control the external.’ To guard the center, one must turn the light inward and reflect, focusing attention on the *guiding* (one *cun* and three *fen* below the navel), neither clinging nor departing—this is seeking the *zhong* within the body.\n\nSecond, seek the *zhong* beyond the body. The *Doctrine of the Mean* speaks of ‘before joy, anger, sorrow, and delight arise.’ At this time of non-arising, one neither hears nor sees, maintaining reverence in solitude. Naturally, the nature settles and the spirit becomes clear; when the spirit is clear, *qi* becomes refined. Only then can one see the original face—this is seeking the *zhong* beyond the body.\n\nBy using the *zhong* within the body to seek the *zhong* beyond the body, human desires are easily purified, and heavenly principle is restored to clarity. The sages, immortals, and buddhas of all ages have taken this as the first step in practice.\n\nIt also says: *Congealing the spirit and regulating the breath, regulating the breath and congealing the spirit*—these eight characters are the initial practice. They must be pursued as a single endeavor, progressing through stages without interruption.\n\n*Congealing the spirit* means gathering the already-cleared mind and entering within. When the mind is not yet clear, do not rashly close the eyes. First, one must self-exhort and self-encourage. Only when the mind is coaxed back, cool and tranquil, should it be gathered into the *qi*-cavity—this is called *congealing the spirit*. Once the spirit is congealed, one sits like atop a high mountain, gazing upon all mountains and waters, or like lighting a heavenly lamp to illuminate the nine depths and nine mysteries—this is what is meant by *congealing the spirit in emptiness*.\n\nIt also says: Conceal the mind in the abyss, and the spirit will not wander outward. When the mind is dragged by affairs, fire stirs within. When fire stirs within, it inevitably agitates essence. When the mind is still, the breath naturally regulates; with prolonged stillness, the mind naturally settles. Kill the mind to nourish *qi*; refine the breath to purify the mind.\n\nEssence, *qi*, and spirit are the three inner treasures; the ears, eyes, and mouth are the three outer treasures. Always ensure the inner three treasures do not chase after external objects, and the outer three treasures do not penetrate within to disturb. Let the breath be continuous and deep, entering the *dantian*. Make breath the husband and wife, spirit and *qi* the mother and child. When mother, child, husband, and wife gather without separation, the mind does not stray outward, intention does not wander, the spirit does not roam, and essence does not recklessly move. Constantly steaming the four limbs—this is the orthodox lineage of the golden elixir’s great Dao.\n\nIt also says: *Congealing the spirit and regulating the breath* requires only a peaceful mind and harmonious *qi*. When the mind is peaceful, the spirit roams; when *qi* is harmonious, the breath regulates. The character *ping* (peace) is most wondrous: a mind without waves is *ping*; a mind that holds to the center is *ping*. *Ping* is precisely this center. When the mind is in this center, it does not stir waves—this is the *mysterious pass* of the alchemical classics.\n\nIt also says: Without knowing the *mysterious pass* in cultivation, regardless of other matters, this alone is like entering a dark room—where to begin? The *mysterious pass* is the *qi*-cavity. When the spirit enters the *qi*, it is as if dwelling in a deep cavern. When spirit and *qi* long for each other, the substance of the *mysterious pass* is established.\n\nMaster Wu Chongxu said: The ancient *Embryonic Breathing Classic* states: ‘The embryo forms from *qi* lying hidden; breath ceases within the formed embryo.’ These words are the essential method for all past and future divine immortals and heavenly immortals. I wish to further elucidate and directly discuss this.\n\nWhen a person first loses their body, only the union of two *qi* as empty space remains—there is no embryo, nor breath. Due to the mother’s breathing, the embryo grows; due to the embryo, breath grows. When the embryo is complete, the wonder lies in following the mother’s breath to become breath. Thus, one breathes all day without feeling stifled. This is because the breath does not pass through the mouth and nose but only communicates through the navel, appearing as if without breath—this is the true scene of embryonic breathing.\n\nOnce separated from the embryo, breath is cut off. Without the mother’s navel connected to the child’s navel, one cannot but begin breathing through one’s own mouth and nose, which is the same as embryonic breathing but temporarily differs in the aperture.\"",
      "overlap_context": "he other to cover the navel, concentrating spirit on the internal kidneys. With long practice, essence flourishes.) Thus, when spirit congeals, *qi* gathers; when spirit scatters, *qi* dissipates. If one treasures essence and *qi* but neglects spirit, it is like enjoying the flower while forgetting the root.*\n\n*It also says: The Chan school’s *cessation and insight* is the essential method of preserving spirit. One day’s ‘binding to a single object’ is the same as fixing the mind on one point.\"*",
      "start_char": 7358,
      "end_char": 8580,
      "start_sentence": 201,
      "end_sentence": 230,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.54931163787842,
      "metadata": {
        "source_file": "dao\\藏外\\胎息经笺疏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "逆修返还之理，安得不以我今呼吸之息而返还为胎中息耶。 凡返还呼吸时，以口鼻呼吸之气而复归于胎息之所，如处胎时之息，渐渐炼至胎息亦真无。 真无者，灭息尽之义也。 方是未生时，而还返于未有息未有胎已前之境界，不落生死之途者矣。 然呼吸之气，最难制伏，必有元炁相依，方可相定而成胎息，所谓孤阴不成者，此亦其一也。 必要有先天炁机发动之时，又有元灵独觉及呼吸相依，三宝会合已先炼成大药者，而转归黄庭结胎之所。 于此之时，而后以胎息养胎神，得神炁乘胎息之气，在中一定，即是结胎之始，虽似有微微呼吸若在脐轮，而若不在脐轮，在虚空，渐至无息成胎，仍绵密无间，直证阳神大定，绝无动静起灭，即是胎圆，灭尽定而阳神成矣。 悟元子曰：四大不着而身斋，诸虑俱息而意斋，回光返照而眼斋，声音不入而耳斋，香臭不到而鼻斋，是非不动而舌斋，扫净万缘，离种种边，应无所往而生其心则心斋。 闵真人曰：功到此际，道体全现，若从此体认而仍有无不立、人法双忘，造至无所无边，自入无量化域，身机心机，自与造化合一，更令散斋七七，不失此况，待到时至，随机应点，自己身证自然，而六通具足，何先天之或昧，而胎有不结不圆乎。 如是大可顿超无上知德，自必一了百当，纵或有阻，而玄关一窍，亦必大开常开，采取结养脱化等等，总以无住无所，觉而勿着为用焉耳。 规中指南论药物曰：大抵玄牝为阴阳之原，神气之宅，神气为性命之药，胎息之根，呼吸之祖。 深根固蒂之道，胎者藏神之府，息者化胎之元，胎因息生，息因胎住，胎不得息不成，息不得神无主。 又曰：神仙教人炼精必欲返其本，复其初，重生五脏，再立形骸，无质生质，结成圣胎，其诀曰：专气致柔，能如婴儿乎，除垢止念，静心守一，外想不入，内想不出，终日混沌，如在母腹，神定以会乎气，气和（一作住）以合乎神，神即气而凝，气即神而住，寂然于休歇之场，恍兮于无何有之乡，天心冥冥，注意一窍，如鸡抱卵，似鱼在水，呼至于根，吸至于蒂，绵绵若存，在守胎中之一息也。 守无所宁，真息自住，泯然若无，虽心于心，无所存住，杳冥之内，但觉太虚之中，一灵为造化之主宰，时节若至，妙理自彰，轻轻然运，默默然举，微以意而定气，应造化之枢机，则金木自然混融，水火自然升降，忽然一点，大如黍珠，落于黄庭之中，此乃采铅投汞之机，为一日之内，结一日之丹。 复命篇曰：夜来混沌攧落地，万象森罗总不知，当此之时，身中混融，与虚空等，亦不知神之为气，亦不知气之为神。 似此造化，亦非存想，是皆自然之道，吾亦不知其所以然而然。 药既生矣，火斯出焉。 大抵药之生也，小则可以配坎离之造化，大则可以同乾坤之运用，金丹之旨，又于此泄，无余蕴矣。 岂傍门小法所可同语哉。 若不吾信，舍玄牝而立根基，外神气而求药物，不知自然之胎息而妄行火候，弃本趋末，逐妄迷真，天夺其算，吾未如之何也已矣。 尚按陈真人此节，虽讲玉液为主，而亦略及金液，盖小大虽殊其理一也。 所谓一者，阴阳交媾而生也。 不问小丹大丹与玄珠。 不交媾则不生，尹真人云，未有不交媾而成造化者，正指此也。",
      "translated_text": "The principle of reverse cultivation and return—how could it not involve taking one’s present breathing and reverting it to the breath within the womb? Whenever one returns the breath, the *qi* drawn through mouth and nose is restored to the locus of embryonic breathing, as if the breath were once again in the womb. Gradually refining it, even the true embryonic breath vanishes. This \"true void\" signifies the extinction of breath. Only then does one revert to the state before birth, returning to the realm prior to breath and prior to the embryo, no longer subject to the path of birth and death.\n\nYet the breath is most difficult to subdue. Only with the support of primordial *qi* can it stabilize and form embryonic breathing. This is another instance of what is meant by \"solitary yin cannot complete.\" It requires the moment when the mechanism of precelestial *qi* stirs, when the primordial spirit awakens alone, and when breath and *qi* interdepend—only when the Three Treasures converge and the Great Medicine is first refined can one return to the Yellow Court, the locus of embryo formation. At this time, one nourishes the fetal spirit with embryonic breathing, allowing spirit and *qi* to ride the breath of embryonic breathing and stabilize within. This is the beginning of embryo formation. Though there may seem to be a faint breath at the navel wheel, it is as if it is not at the navel wheel but in empty space. Gradually, breath ceases, and the embryo forms, seamless and unbroken, directly attaining the great samādhi of the yang spirit. Without movement or stillness, arising or ceasing, the embryo is perfected, and the samādhi of extinction is achieved, giving rise to the yang spirit.\n\nMaster Wuyuan said: \"When the four great elements are unattached, the body is purified; when all thoughts cease, the mind is purified; when the light is turned inward in reflection, the eyes are purified; when sounds do not enter, the ears are purified; when fragrance and stench do not reach, the nose is purified; when right and wrong do not move, the tongue is purified. Sweeping clean all conditions, departing from all extremes, responding without attachment—this is the purification of the heart.\"\n\nMaster Min said: \"At this stage, the Dao-body is fully manifest. If one recognizes this and continues to the point where nothing is established and both self and dharmas are forgotten, advancing to the boundless, one naturally enters the infinite realm of transformation. Body and mind merge with the workings of creation. Further, one maintains the scattered purification for forty-nine days without losing this state. When the time arrives, one responds to the moment with spontaneity, naturally attaining realization in one’s own body. The six supernormal powers are complete—how could the precelestial be obscured, or the embryo fail to form and perfect? Thus, one may suddenly transcend to the supreme knowledge and virtue, resolving all at once. Even if obstacles arise, the Mysterious Pass will surely open widely and remain open. The processes of gathering, forming, nourishing, and liberation—all operate through non-abiding, awareness without attachment.\"\n\n*The Guide to the Center* says of the medicine: \"Generally, the Mysterious Female is the origin of yin and yang, the dwelling of spirit and *qi*. Spirit and *qi* are the medicine of nature and life, the root of embryonic breathing, the ancestor of respiration. The Dao of deep roots and firm stems— the embryo is the palace that houses the spirit, and breath is the source that transforms the embryo. The embryo arises from breath, and breath abides through the embryo. Without breath, the embryo cannot form; without spirit, breath has no master.\"\n\nIt further states: \"The immortals teach that in refining essence, one must return to its origin, restore its beginning, regenerate the five viscera, reestablish the bodily form, and from formlessness give rise to form, structuring the sacred embryo. The secret says: 'Concentrate *qi* to achieve softness—can you be like an infant? Eliminate defilement, cease thoughts, still the heart, and guard the One. External perceptions do not enter; internal perceptions do not exit. All day, remain in primordial chaos, as if in the mother’s womb. Spirit stabilizes to meet *qi*; *qi* harmonizes (or abides) to unite with spirit. Spirit congeals as *qi*; *qi* abides as spirit. Serene in the realm of rest, dimly present in the land of nothingness, the heart of heaven is obscure, attention fixed on the One aperture. Like a hen brooding an egg, like a fish in water—exhaling to the root, inhaling to the stem, continuous yet subtle, guarding the single breath within the embryo. Guarding without fixation, the true breath naturally abides. Vanishing as if nothing, though the heart is in the heart, nothing is retained. Within the profound darkness, one only perceives the vast emptiness, where a single spirit governs creation. When the time is ripe, the wondrous principle manifests of itself. Gently it moves, silently it rises. With subtle intention, *qi* is stabilized, responding to the pivot of creation. Then metal and wood naturally merge; water and fire naturally ascend and descend. Suddenly, a single point, as large as a millet grain, falls into the Yellow Court—this is the mechanism of gathering lead and merging mercury, forming the elixir of a single day within that day.\"\n\n*The Return of Life* says: \"At night, primordial chaos crashes to the ground—all the myriad forms are utterly unknown. At this time, the body merges with emptiness, equal to the void. One does not know spirit as *qi*, nor *qi* as spirit. Such transformation is not through visualization—it is the natural Dao. I do not know why it is so, yet it is so.\"\n\nOnce the medicine is born, the fire emerges. Generally, when the medicine arises, in its small form it can align with the workings of Kan and Li; in its great form, it can synchronize with the movements of Qian and Kun. The essence of the golden elixir is fully revealed here, leaving no residue. How could it be spoken of in the same breath as lesser methods? If you do not believe me, abandon the Mysterious Female to establish a foundation, seek medicine outside spirit and *qi*, practice fire times without knowing the natural embryonic breathing—forsaking the root for the branches, chasing delusion and losing the real—heaven will shorten your allotted time. What more can I say?\n\nNow, regarding Master Chen’s passage: though it primarily discusses the Jade Fluid, it also briefly touches on the Golden Fluid. Though the small and great differ, their principle is one. This \"one\" refers to the union of yin and yang to give birth. Whether in the lesser elixir, the greater elixir, or the Mysterious Pearl—without union, there is no birth. Master Yin said, \"There has never been creation without union\"—this is precisely what he meant.",
      "overlap_context": "h. Thus, one breathes all day without feeling stifled. This is because the breath does not pass through the mouth and nose but only communicates through the navel, appearing as if without breath—this is the true scene of embryonic breathing.\n\nOnce separated from the embryo, breath is cut off. Without the mother’s navel connected to the child’s navel, one cannot but begin breathing through one’s own mouth and nose, which is the same as embryonic breathing but temporarily differs in the aperture.\"",
      "start_char": 8580,
      "end_char": 9810,
      "start_sentence": 231,
      "end_sentence": 254,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.32680654525757,
      "metadata": {
        "source_file": "dao\\藏外\\胎息经笺疏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "气入身来为之生，神去离形为之死。 凡举生物，莫不有气，而命即寓于气之中，凡生物之所以有知觉运动者，莫非气之运用也。 无气则不能动，自成死物矣。 凡蠢蠢者莫不含灵，灵者神也，而性即藏于神之内，无神以主，则有如木石，非死而何！ 故知人身之所以生者，气与神也，惟是此气与神，禀之于天，而又受天之陶铸，阴符经所谓天地万物之盗，及古哲云，天与之，天复取之，失其气，气尽而死也，皆指此。 知神气可以长生，固守虚无，以养神气。 此乃本经最要之诀，盖虚无者，即是致虚守静，建立玄牝之法。 虚者虚其心，无者无其身，虚其心则神自清，无其身则气自静，能清能静，神气自养矣。 然此非一蹶可能者，心朝斯夕斯，动静一如，方能有成，故曰固守，言不可须臾相离，一刻怠忍也。 又此固守虚无之功，即是仙家交媾阴阳，盗夺天地造化之诀。 不知此诀，不能返还，不造此境，亦无从返还，故此后广释之。 老子曰：致虚极，守静笃。 内经上古天真论曰：恬淡虚无，真气从之，精神内守，病安从来。 丹阳真人语录曰：夫道以无心为体，忘言为用，以柔弱为本，以清净为基，若施于人，必节饮食绝思虑，静坐以调息，安寝以养炁，心不驰则性定，形不劳则精生，神不扰则丹结，然后灭情于虚，宁神于极，可谓不出户庭而妙道得矣。 又曰：清净者，清为清其心源，净为净其气海。 心源清，则外物不能扰，故情定而神明生焉，炁海净，则邪欲不能干，故精全而腹实矣。 是以澄心如澄水，养炁如养儿，炁秀则神灵，神灵则炁变，乃清净所致也。 若行有心有为之功，则有尽之术法也，若行无心无为之理，乃无尽之清虚也。 又曰：无为者，不思不虑也，专一清心净意，养炁全神，飘游于逍遥之地，入于无何有之乡。 又曰：刘高尚居环堵四十年，别无他事，但虚其心，实其腹，去其华，忘其名，弃其利，清其神，全其气，丹自结，仙自成。 乃有赞之曰，塞其兑，闭其门，昔诵此语，今见斯人，可谓简且当矣。 又曰：学道人行住坐卧，不得少顷心不在道。 行则措足于坦途，住则凝情于太虚，坐则匀鼻端之息，睡则抱脐下之珠，久而调息，无有间断，而终日如愚，方是端的工夫，非干造作行持也。 又谓众曰：道无形名，是神炁之祖也。 元炁降化，神明自生，炼神合道，乃是修真，其余名相纷纭，难为凭准。 我今为汝举其大纲，夫修此之要，不离神炁，神炁是性命，性命是龙虎，龙虎是铅汞，铅汞是水火，水火是婴姹，婴姹是真阴真阳，真阴真阳即是神炁，种种名相，皆不可着，止是神炁二字而已。 欲要养炁全神，须当屏尽万缘，表里清净，久久精专，神凝气冲，三年不漏下丹结六年不漏中丹法，九年不漏上丹法，是名三丹园满，九转功成，骨髓凝化，血脉成真，内完外溢，光影澈明，寂然不动，应感无穷，千变万化，坐在立亡，三万六千神灵踊跃，游行天下，三界同迎，八难之中，千凶万毒，莫能消亡，至于大劫变化，洪炎四冲，神满太虚，亦无所碍，故天有时而崩，地有时而陷，山有时而摧，海有时而竭，凡有相等，终归于坏，惟学道者，到神与道合处，则永劫无坏，兼功及九祖升上清矣",
      "translated_text": "Qi enters the body to give life; spirit departs from form to bring death. All living things possess qi, and life dwells within qi. The awareness and movement of all living things arise from the functioning of qi. Without qi, there can be no movement—it becomes a dead thing. All creatures, however humble, contain spirit; spirit is the numinous, and nature resides within it. Without spirit to govern, it is like wood or stone—what else but death?\n\nThus, we know that what gives life to the human body is qi and spirit. Yet this qi and spirit are endowed by Heaven and further shaped by its molding. As the *Yin Fu Jing* says, \"Heaven, Earth, and the myriad things are thieves of one another,\" and the ancient sages declared, \"Heaven gives it, Heaven takes it back.\" When qi is lost, qi is exhausted, and death follows—all referring to this.\n\nKnowing that spirit and qi can prolong life, one firmly abides in emptiness to nurture them. This is the most essential secret of this classic. Emptiness here means attaining emptiness and guarding stillness, the method of establishing the Mysterious Female. To be empty is to empty the heart; to be without is to forget the body. Emptying the heart, spirit becomes clear; forgetting the body, qi becomes still. When clarity and stillness are achieved, spirit and qi nurture themselves.\n\nYet this is not something attainable in a single leap. From morning to night, in movement and stillness, one must remain unwavering—only then can success be achieved. Hence, it is called \"firmly guarding,\" meaning not a moment’s separation, not a single instant of slackness. Moreover, this practice of firmly guarding emptiness is the very method by which immortals unite yin and yang, stealing the creative power of Heaven and Earth. Without knowing this secret, there can be no return; without attaining this state, there is no path to return. Thus, it will be expounded further below.\n\nLaozi said: \"Attain utmost emptiness, guard profound stillness.\" The *Huangdi Neijing*’s \"Discourse on the Heavenly Truth of High Antiquity\" states: \"Serene and empty, true qi follows; spirit guarded within—how could illness arise?\" Master Danyang’s recorded sayings say: \"The Dao takes non-mind as its essence, forgetting words as its function, softness and weakness as its root, and purity and stillness as its foundation. If applied to cultivation, one must moderate diet, sever thoughts, sit in stillness to regulate breath, and rest peacefully to nurture qi. When the heart does not wander, nature stabilizes; when the body is not wearied, essence is born; when spirit is not disturbed, the elixir coalesces. Then, extinguishing emotions in emptiness and calming spirit to the utmost, one may be said to attain the wondrous Dao without stepping beyond the threshold.\"\n\nHe also said: \"Purity and stillness—purity is to clarify the source of the heart, stillness is to purify the sea of qi. When the heart’s source is clear, external things cannot disturb it, so emotions settle and spirit’s clarity arises. When the sea of qi is pure, base desires cannot intrude, so essence is preserved and the abdomen is full. Thus, settling the heart is like clarifying water; nurturing qi is like raising a child. When qi flourishes, spirit becomes numinous; when spirit is numinous, qi transforms—this is the result of purity and stillness. If one practices with intention and effort, it is a method with limits; if one practices the principle of non-mind and non-action, it is the boundless emptiness of purity.\"\n\nHe further said: \"Non-action means no thought, no worry—concentrating on a pure heart and tranquil mind, nurturing qi and preserving spirit, wandering in the realm of carefree ease, entering the land of nothingness.\" He also said: \"Liu Gaoshang lived in a humble abode for forty years, doing nothing else but emptying his heart, filling his abdomen, shedding vanity, forgetting fame, abandoning profit, purifying his spirit, and preserving his qi. The elixir formed of itself, and immortality was achieved.\" There is a eulogy for him that says: \"Block the openings, close the gates.\" I once recited these words, but now I see such a person—truly simple and fitting.\n\nHe also said: \"The cultivator, in walking, standing, sitting, or lying down, must not for a moment let the heart stray from the Dao. In walking, place the feet on level ground; in standing, concentrate the mind on the great void; in sitting, regulate the breath at the tip of the nose; in sleeping, embrace the pearl below the navel. Over time, breath is harmonized without interruption, and though one appears foolish all day, this is the true work—no artificial effort or forced practice.\"\n\nHe addressed the assembly, saying: \"The Dao has no form or name; it is the ancestor of spirit and qi. When primordial qi descends and transforms, numinous awareness arises of itself. Refining spirit to merge with the Dao—this is true cultivation. All other names and forms are mere distractions, unreliable as standards. I will now present its great outline for you: the essentials of this practice do not depart from spirit and qi. Spirit and qi are life and nature; life and nature are dragon and tiger; dragon and tiger are lead and mercury; lead and mercury are water and fire; water and fire are the infant and maiden; the infant and maiden are true yin and true yang; true yin and true yang are none other than spirit and qi. All these names and forms must not be clung to—they are merely the two words: spirit and qi.\n\nTo nurture qi and preserve spirit, one must cast aside all worldly ties, purify both inside and out. Over time, with unbroken focus, spirit congeals and qi surges. After three years without leakage, the lower elixir forms; after six years without leakage, the middle elixir is achieved; after nine years without leakage, the upper elixir is perfected—this is called the fulfillment of the three elixirs, the completion of the nine transformations. Marrow solidifies, blood and vessels become true, inner perfection overflows externally, radiance and clarity shine through. In stillness, there is no movement; in response, there is no limit. A thousand changes, ten thousand transformations—sitting in death, standing in life. The thirty-six thousand spirits leap forth, roaming the world. The three realms welcome you together; within the eight difficulties, a thousand perils and ten thousand poisons cannot harm you. Even in the great kalpa’s transformations, when flames rage on all sides, spirit fills the great void without obstruction. Thus, heaven may at times collapse, earth may at times sink, mountains may at times crumble, seas may at times dry up—all things with form will ultimately perish. Only the cultivator, when spirit merges with the Dao, remains eternally unbroken, and the merit extends to nine generations of ancestors, ascending to the Upper Clarity.\"",
      "overlap_context": "rten your allotted time. What more can I say?\n\nNow, regarding Master Chen’s passage: though it primarily discusses the Jade Fluid, it also briefly touches on the Golden Fluid. Though the small and great differ, their principle is one. This \"one\" refers to the union of yin and yang to give birth. Whether in the lesser elixir, the greater elixir, or the Mysterious Pearl—without union, there is no birth. Master Yin said, \"There has never been creation without union\"—this is precisely what he meant.",
      "start_char": 9811,
      "end_char": 11051,
      "start_sentence": 255,
      "end_sentence": 281,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.92001295089722,
      "metadata": {
        "source_file": "dao\\藏外\\胎息经笺疏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "。 又师谓众门人曰：一日几个时辰？ 门人对曰：一日六个时辰。 师曰：昼夜总几个时辰？ 门人曰：昼夜总十二个时辰。 师曰：昼夜十二个时中，天道运行，斡旋造化，还有顷刻停息否？ 门人对曰：无停息，师曰：凡学道之人，切须法天之道，斡旋己身中造化，十二时中，常清常净，不起纤毫尘念，则方是修行，日就月将，无有问断，决做神仙。 苟或亏功失行，怎得了达。 我观汝辈，十二时中，不曾有一个时辰专心在道，受了十方施主供养，如何还得！ 一朝合眼，复入轮回，何时出期？ 我今叮咛说与汝等，但自澄心遣欲，万缘不染，神炁冲和，便是道也。 依此修行，不得到错了。 若因循怠堕，行持不到，非吾罪也，岂不念汝等七祖，生前造诸恶孽，冥中受诸罪苦，望子孙成道救拔得生天，各宜以此为念，发坚固心，抱道而死，此吾所愿也，珍重。 规中指南论火候曰，玉蟾云，火本南方离卦，属心，心者神也，神即火也。 炁即药也。 以火炼药而成丹者，即是以神驭炁而成道也。 其说如此分明，如此直捷，夙无仙骨，讽为虚言，当面错过，深可叹息。 然火候口诀之要，尤当于真息中求之，盖息以心起，心静息调，息心归根，金丹之母，心印经曰：回风混合，百日功灵者此也。 必以神驭气，以气定息橐钥，之开合，阴阳之升降，呼吸出入，任其自然，专炁致柔含光默默，行住坐卧，绵绵若存，如妇人之怀孕，如小龙之养珠，渐采渐炼，渐凝渐结，功夫纯粹，打成一片。 动静之间，更宜消息，念不可起，念起则火炎，意不可散，意散则火冷，但使其无过不及，操舍得中，神抱于炁，炁抱于神，一意冲和，包裹混沌，斯谓火种相续，丹鼎常温，无一息之间断，无毫发之差殊。 如是炼之一刻，一刻之周天也。 如是炼之一时，一时之周天也，如是炼之一日，一日之周天也。 炼之百日，谓之立基，炼至十月，谓之胎仙，以至元海阳生，水中火起，天地循环，乾坤反复，亦皆不离一息，况所谓沐浴温养，进退抽添，其中密合天机，潜符造化，而不容吾力焉。 故曰：火虽有候不须持，些子机关我自知，但安神息任天然，此先师之的说也。 昼夜屯蒙法自然，何用孜孜看火候，此老师之确论也。 圣人传药不传火之旨，尽于斯矣。 修真秘旨曰：修士下手立基，必先使吾心如止水无波，太虚无云，一寂然不动之境。 然后于玄关一窍之中，仿父母未生以前工夫，存定真息真气，使气不离息，息不离气，合为一处，内者不出，外者不入，上下往来于一窍之内，绵绵若存，如在父母胞中未生以前，一点先天祖气，浑融磅礴，温然如春，酣然如醉，美在其中，竹然见于面，盎于背，施于四体，四体不言而喻，睹之无象，求之无形，无一刻不在于玄关，至此，则芽归于鼎炉，而火候可行矣。 如是，则元神妙用，自然运用真心，周流运转于元关之内，渐渐煅炼，渐渐凝结，真精日益，力到功深，自小至大，由微至着，元珠成象，结成圣胎，皆自然而然，莫知其所以然，自神而神，莫知其所以神，还如子藏母腹，随呼随吸，聚冲虚太和之气，成终古不坏之体，以致胎圆十月，化生婴儿，与我未生以前，在母胎中一般意象，然后勤加温养之功，专气致柔，念兹在兹，动静语默，造次串离，温养既足，体如空虚，于是劈破鸿蒙，凿开混沌，现出本来面目，身外有身，维横自在，变化无方矣",
      "translated_text": "The Master then addressed his disciples, saying, \"How many hours are there in a day?\"\nThe disciples replied, \"Six hours in a day.\"\nThe Master asked, \"How many hours are there in a day and night together?\"\nThe disciples answered, \"Twelve hours in a day and night.\"\nThe Master said, \"Within these twelve hours of day and night, the Dao of Heaven moves, revolving and creating transformations—does it ever pause even for an instant?\"\nThe disciples replied, \"It never pauses.\"\nThe Master said, \"Those who cultivate the Dao must emulate the Dao of Heaven, revolving and transforming within their own bodies. In all twelve hours, maintain constant purity and clarity, without the slightest dust-like thought arising. Only then is this true cultivation. Progressing day by day, month by month, without interruption, you will assuredly become an immortal. If you falter in effort or lose conduct, how can you attain realization? I observe that among you, in these twelve hours, there is not a single hour devoted wholeheartedly to the Dao. Having received offerings from patrons in the ten directions, how can you repay them? Once your eyes close in death, you will reenter the wheel of rebirth—when will you ever escape? I now earnestly remind you: simply settle the mind and dispel desires, unstained by the myriad entanglements. When spirit and qi harmonize and ascend, this is the Dao. Cultivate accordingly, and you will not err. If you procrastinate and grow indolent, failing to uphold the practice, the fault is not mine. Do you not consider your seven generations of ancestors, who in life committed manifold evil deeds and now suffer torments in the netherworld, hoping their descendants will attain the Dao and deliver them to rebirth in heaven? Let this be your resolve. Hold fast to the Dao even unto death—this is my wish for you. Take heed.\n\nThe *Regulations Within the Rules* on the firing process states: The Jade Toad says, 'Fire originally belongs to the southern *Li* trigram, corresponding to the heart. The heart is spirit; spirit is fire. Qi is the medicine.' To refine the medicine into the elixir with fire is to guide qi with spirit and thereby accomplish the Dao. This explanation is so clear, so direct—yet those without the bone of immortality dismiss it as empty words, missing it even as it stands before them. How lamentable!\n\nThe essential oral instructions on the firing process must be sought within true breathing. For breath arises from the heart; when the heart is still, breath is regulated. When breath and heart return to the root, this is the mother of the golden elixir. The *Heart Seal Sutra* says, 'Returning the wind to merge as one—after a hundred days, the work becomes efficacious.' This is it. One must guide qi with spirit, stabilize breath with qi, and regulate the bellows’ opening and closing, the ascent and descent of yin and yang. Let inhalation and exhalation proceed naturally. Focus the qi to attain suppleness, contain the light, and remain silent. Whether moving or still, sitting or lying down, maintain continuity as if something were present—like a woman nurturing a pregnancy, like a young dragon tending its pearl. Gradually gather, gradually refine, gradually condense, gradually solidify. When the work becomes pure, it coalesces into one. In movement and stillness, be ever mindful. Do not let thoughts arise—for when they do, fire flares. Do not let intention scatter—for when it does, fire cools. Simply ensure no excess or deficiency, maintaining balance in action and rest. Let spirit embrace qi, and qi embrace spirit. With singular intention, harmonize and envelop the primordial chaos. This is called the continuous transmission of the fire-seed, keeping the elixir crucible perpetually warm, without a single breath’s interruption or the slightest deviation. Refining thus for a moment is a moment’s celestial revolution. Refining thus for an hour is an hour’s celestial revolution. Refining thus for a day is a day’s celestial revolution. Refining for a hundred days is called establishing the foundation. Refining for ten months is called the fetal immortal. Even when yang arises from the primordial sea and fire emerges within water, when heaven and earth cycle and qian and kun reverse—all remains inseparable from a single breath. Moreover, in bathing, nurturing, advancing, retreating, withdrawing, and adding, the subtle alignment with the celestial mechanism and the hidden accord with creation brook no forced effort. Thus it is said: 'Though fire has its timing, it need not be held; the subtle mechanism I know myself. Simply rest the spirit and breath, letting nature take its course—this is the definitive teaching of the former masters.' 'Day and night, the cyclical methods proceed naturally—what need is there to diligently watch the firing process?' This is the unerring judgment of the ancient teachers. The intent of the sages—to transmit the medicine but not the fire—is fully realized herein.\n\nThe *Secret Essentials of Cultivating the Real* states: When a cultivator begins to establish the foundation, one must first make the heart like still water without ripples, like the great void without clouds—a state of absolute quiescence. Then, within the mysterious pass of the single aperture, emulate the work prior to the time of one’s parents’ birth. Stabilize the true breath and true qi, ensuring qi does not leave breath and breath does not leave qi, merging them into one. Let the inner not exit, the outer not enter. Up and down they circulate within the single aperture, continuously present as if in the womb before birth—a speck of precelestial ancestral qi, vast and harmonious, warm as spring, blissful as intoxication. Beauty resides within, manifesting on the face, flourishing on the back, extending to the four limbs. The four limbs, though silent, are eloquent. Gazing, one sees no form; seeking, one finds no shape. Not for a moment does it depart from the mysterious pass. At this point, the sprout returns to the crucible, and the firing process may commence.\n\nThus, the wondrous function of the primordial spirit naturally operates with the true heart, circulating and revolving within the primordial pass. Gradually tempered, gradually condensed, true essence increases daily. When effort reaches depth, it grows from small to great, from subtle to manifest. The primordial pearl takes form, coalescing into the sacred embryo—all proceeding naturally, without knowing how. From spirit to spirit, without knowing how it is so. Like a child nestled in the mother’s womb, following each breath, gathering the qi of profound harmony and emptiness, forming a body imperishable through the ages. When the embryo matures after ten months, it transforms into an infant, identical in appearance to when one was in the mother’s womb before birth. Then, diligently apply the work of nurturing: focus the qi to attain suppleness, concentrate the mind unwaveringly. In movement and stillness, speech and silence, in haste and separation, nurture it fully. When nurturing is complete, the body becomes empty as space. Then, split open the primordial chaos, cleave the undifferentiated, and reveal the original face. A body exists beyond the body, freely transcending dimensions, transforming without limit.\"",
      "overlap_context": "s and ten thousand poisons cannot harm you. Even in the great kalpa’s transformations, when flames rage on all sides, spirit fills the great void without obstruction. Thus, heaven may at times collapse, earth may at times sink, mountains may at times crumble, seas may at times dry up—all things with form will ultimately perish. Only the cultivator, when spirit merges with the Dao, remains eternally unbroken, and the merit extends to nine generations of ancestors, ascending to the Upper Clarity.\"",
      "start_char": 11051,
      "end_char": 12333,
      "start_sentence": 282,
      "end_sentence": 310,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.119940519332886,
      "metadata": {
        "source_file": "dao\\藏外\\胎息经笺疏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "。 玄机口诀曰：跏趺大坐，收视敛听，以意同其浮沉，勿拘勿纵，绵绵延延，则合于自然之道，金丹之法，始终若是而已，倘若工夫十分用意便错了。 老子曰：绵绵若存，用之不勤，所以下手，不拘时刻，静定守凝，散放属阴，凝守则虚，忘中之放，则为阴神，忘中之守，则为阳神，内外之机皆忘，温养之心常注，行住坐卧，常常守柔，放散则为顽空，守静则为真空，静定则精气神三者皆结，忘形不忘心，忘机不忘守，专守虚无，无中生有，常守则在，惟是不动心也，清静无为，常切照顾，恐有念头，念头才起，便一文一武却之，须是牢守，不可间断。 张三丰炼丹火候说曰，初功在寂灭情缘，扫除杂念，除杂念是第一着，筑基炼己之功也。 人心既除，则天心来复，人欲既净，则天理常存。 每日先静一时，待身心都安定了，气息都和平了，始将双目微闭，垂帘观照心下肾上一寸三分之间，不即不离，勿忘勿助，万念俱泯，一灵独存，谓之正念，斯时也 ，于此念中，活活泼泼，于彼气中，悠悠扬扬，呼之至上，上不冲心，吸之至下，下不冲肾，一阖一辟，一来一往，行之一七二七，自然渐渐两肾火蒸，丹田气暖，息不用调而自调，气不用炼而自炼，气息既和，自然于上中下，不出不入，无来无去，是为胎息，是为神息，是为真橐钥篇，真鼎炉，是为归根复命，是为玄牝之门，天地之根，气到此时，如花方蕊，如胎方胞，自然真气熏蒸营卫，由尾闾穿夹脊，升上泥丸，下鹊桥，过重楼，至绛宫而落于中丹田，是为河车初动，但气至而神未全，非真动也 ，不可理他，我只微微凝照，守于中宫，自然无尽生机，所谓养鄞鄂者此也 。 行之一月二月，我神益静，静久则气益生，此为神生气气生神之功也。 或百日，或百余日，精神益长，真气渐充，温温火候，血水有余，自然坎离交媾，乾坤会合，神融气畅，一霎时间，真气混合，自有一阵回风，上冲百脉，是为河车真动，中间若有一点灵光，觉在丹田，是为水底玄珠，土内黄芽。 尔时一阳来复，恍如红日初生，照于沧海之内，如雾如烟，若隐若见，则铅火生焉。 方其乾坤坎离未交，虚无寂灭，神凝于中，功无间断，打成一团，是为五行配合，至若水火相交，二候采取，河车逆转，四候得药，神居于内，丹光不离，谓之大周天，谓之行九转大还也。 此时一点至阳之精，凝结于中，隐藏于欲净情寂之时，而有象有形，到此地位，息住于胎，内外温养，顷刻无差，又谓之十月功夫也。 尚按此节虽载三丰全集，然不定为三丰作，但论静功入门，条理不差，故录之。 涵虚真人三车秘旨云，功夫下手，先静心，次缄口，次调息，（心静则气平，不调之调为上）鼻息和平，然后闭目内观，神注肾根之下，阴交一脉，（此脉在阴囊后，谷道前，上直通于气海）如此片时，将心息提上虚无窍内，（脐后腰前，心下肾上，中间一带，不可拘执），停神安息，以自然为主，心太严则炎，务必须其自然，即文火也 ，心太散则冷，务必守其自然，即武火也 ，文火温养，武火烹煎，始终妙用，内息匀称，勿助勿忘，是时也 ，心如太虚，有息相依则不虚，心如太空，有息相随则不空，不虚不空之间，静之又静，清而又清，一切放下，全体皆忘，心神默默，气息绵绵，皆入于杳冥之中，此之谓钻杳冥，杳冥之中有气，一神独觉，此乃真息也",
      "translated_text": "The Oral Secrets of the Mysterious Mechanism state: Assume the full lotus posture, withdraw the gaze and restrain the hearing. Align the mind with the rising and falling of the breath, neither constraining nor indulging it. In continuous, unbroken flow, one merges with the natural Dao. The method of the Golden Elixir is thus from beginning to end—if one applies effort with excessive intent, it is already mistaken.\n\nLaozi said: \"Subtle and continuous, as if existing yet not exerting force.\" Thus, in beginning the practice, one is not bound by time or moment. In stillness and concentration, dispersion belongs to yin; in concentration and emptiness, forgetfulness within dispersion gives rise to the yin spirit, while forgetfulness within concentration gives rise to the yang spirit. When both internal and external mechanisms are forgotten, the mind of nurturing remains ever-present. In walking, standing, sitting, and lying down, one constantly abides in suppleness. Dispersion leads to inert emptiness, while stillness leads to true emptiness. In quiescent concentration, essence, qi, and spirit all coalesce. Forget the form but not the mind; forget the mechanism but not the guard. Focus solely on emptiness and non-being, wherein being arises. Constant vigilance ensures presence—only the unmoving mind remains. In purity and non-action, one must ever attend closely, lest thoughts arise. The moment a thought emerges, counter it with a civil and martial response. One must firmly guard without interruption.\n\nZhang Sanfeng’s discourse on the firing times of elixir refinement states: The initial work lies in extinguishing emotional attachments and sweeping away stray thoughts—removing stray thoughts is the first step, the work of laying the foundation and refining the self. Once the human mind is eliminated, the celestial mind returns; once human desires are purified, celestial principle abides. Each day, first enter stillness for a time until body and mind are fully settled and the breath is harmonized. Then, gently close the eyes, lower the eyelids, and inwardly observe the space one *cun* and three *fen* between the heart below and the kidneys above—neither clinging nor departing, neither forgetting nor forcing. All thoughts vanish, and the solitary spirit remains—this is called the right thought. At this moment, within this thought, one is lively and free; within that qi, one is leisurely and unhurried. The exhalation rises upward without rushing the heart; the inhalation descends downward without disturbing the kidneys. With each opening and closing, each coming and going, after one or two weeks of practice, the fire of the two kidneys naturally begins to steam, and the qi of the cinnabar field warms. The breath regulates itself without effort; the qi refines itself without cultivation. Once the qi and breath harmonize, they naturally ascend, descend, and abide in the upper, middle, and lower without exiting or entering, coming or going—this is called fetal breathing, spirit breathing, the true bellows and furnace, the true cauldron. This is returning to the root and restoring life, the Mysterious Female’s gate, the root of heaven and earth. At this stage, the qi is like a budding flower or an early-stage embryo, naturally steaming and nourishing the constructive and protective qi. It passes from the coccyx through the spine, ascends to the mud-pill palace, descends the magpie bridge, traverses the multi-storied tower, and settles in the Crimson Palace before returning to the middle cinnabar field—this is the initial movement of the river chariot. However, though the qi arrives, the spirit is not yet complete; this is not the true movement. One must not interfere but merely subtly concentrate and guard the central palace. Naturally, boundless vitality arises—this is what is meant by \"nurturing the tender shoot.\"\n\nAfter one or two months of practice, the spirit becomes increasingly still, and prolonged stillness generates more qi—this is the work of spirit generating qi and qi generating spirit. After a hundred days or slightly more, the spirit flourishes, and true qi gradually fills. With a gentle firing time, the blood and water become abundant. Naturally, kan and li unite, qian and kun converge. Spirit and qi harmonize, and in an instant, true qi blends. A gust of returning wind surges upward through the hundred meridians—this is the true movement of the river chariot. Within it, a single point of numinous light is felt in the cinnabar field—this is the Mysterious Pearl at the water’s bottom, the Yellow Sprout within the earth. At this time, the first yang revives, as if the red sun rising over the vast sea, misty and hazy, now hidden, now visible—thus the lead fire is born.\n\nBefore qian and kun, kan and li unite, in the emptiness and extinction of non-being, the spirit congeals at the center. The work continues without interruption, forging into a single mass—this is the union of the Five Agents. When water and fire interact, the second phase of gathering begins. The river chariot reverses its course, and in the fourth phase, the medicine is obtained. The spirit resides within, and the elixir’s light never departs—this is called the Great Celestial Cycle, the practice of the Ninefold Great Return. At this stage, a single point of utmost yang essence congeals within, concealed in the time of purified desire and stilled emotion, taking on form and appearance. Here, the breath rests in the embryo, and both internal and external nurturing proceed without the slightest lapse—this is also called the ten-month work.\n\nThough this passage appears in the *Complete Works of Sanfeng*, it is not necessarily by Sanfeng. However, its discussion of entering stillness is logically sound, and thus it is recorded here.\n\nThe *Secret Principles of the Three Vehicles* by Master Hanxu states: In beginning the practice, first still the mind, then seal the mouth, and then regulate the breath (a still mind calms the qi; the highest regulation is no regulation). When the nasal breath is harmonized, close the eyes and inwardly observe, directing the spirit below the root of the kidneys to the yin convergence vessel (this vessel lies behind the scrotum, before the anus, and ascends directly to the sea of qi). After a time, lift the mind and breath into the void aperture (the region behind the navel, before the waist, between the heart below and the kidneys above—do not cling rigidly). Rest the spirit and settle the breath, taking naturalness as the principle. If the mind is too strict, it becomes scorching—this is the civil fire. If the mind is too scattered, it becomes cold—this is the martial fire. The civil fire nurtures; the martial fire refines. The wondrous application from beginning to end lies in the evenness of the internal breath—neither assisting nor forgetting. At this time, the mind is like the great void; if the breath accompanies it, it is not void. The mind is like the great emptiness; if the breath follows it, it is not empty. Between non-void and non-empty, stillness deepens into deeper stillness, purity into deeper purity. All is released; the entire body is forgotten. Mind and spirit are silent; the breath is continuous. All enter into profound obscurity—this is called \"piercing the profound obscurity.\" Within this obscurity, there is qi, and the solitary spirit alone awakens—this is the true breath.",
      "overlap_context": " one was in the mother’s womb before birth. Then, diligently apply the work of nurturing: focus the qi to attain suppleness, concentrate the mind unwaveringly. In movement and stillness, speech and silence, in haste and separation, nurture it fully. When nurturing is complete, the body becomes empty as space. Then, split open the primordial chaos, cleave the undifferentiated, and reveal the original face. A body exists beyond the body, freely transcending dimensions, transforming without limit.\"",
      "start_char": 12333,
      "end_char": 13619,
      "start_sentence": 311,
      "end_sentence": 329,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.760191440582275,
      "metadata": {
        "source_file": "dao\\藏外\\胎息经笺疏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "。 真气发现，熏心酥痒，展窍，仍要安入腔子里，虚无窍内，积之累之，则命蒂生而阳气长，乃可开关运气矣。 闵真人曰：观复之法，总不外乎致虚寂，守静笃，二句工诀，知此诀者，有几人哉！ 上品丹法第次曰：丹经曰，天得一以清，地得一以宁，人得一以长生。 盖此先天一炁从虚无中来，又非虚空全无，谓守静极于虚无，身居恍惚杳冥之中，混沌大定，神明自来，一灵常湛，是真先天，空而不空等也。 神行即气行，神住即气住。 此言神之与气，是一非二，无气则神无依，无神则气无主，神既为主，故神动既有气功，神不动，则气亦不动，如影之随形，古仙云，息从心生心静息调，是此义也。 尚由此节勘之，经虽神气并举，阴阳平列，然修道之功，惟在阴阳合一，而固守虚无，即是致虚极，守静笃，又为合一之手段也。 孟子曰：夫志，气之帅也。 抱朴子曰：练气之法，当于午前服之，可以移山岳，决河海，制虎豹，缚盗贼。 摄生三要曰：人之气，吹之则凉，呵之则温，温凉变于吹呵之间，是故夏可使冷也。 冬可使热也。 行气者，可以入瘟疫，可以禁蛇虎，可以居水中，可以行水上，可以嘘水使之逆流千里，气之变化无穷，总由养之得其道耳。 叔苴子曰：心之所观而气助之，则可以招风雨，排山岳，心之所止而气守之，则可以历久暂冥今古，故佛能坐五千劫于弹指之中，而道家能灵造化于股掌之上。 闵真人曰：自性本静，静久自动，动而专一，是大把柄，一归其根，仍复于静，静曰复命，即是密谛。 又曰：专一是敬以直内，动不专一，是散乱矣，散乱复静，是昏愦矣，所以动心必要专一，是择善而固执之道理，动时专一，动毕还静，心神安醒，方是清明在躬。 又曰：天地混辟，不过动静，人身死生，不过动静，譬如出阵，战罢自静，譬如戏场，做罢即静，--可知动处皆情，静即自性。 上按：闵真为北派嫡传法嗣，故于说静功处，分外亲切。 若欲长生，神气相注。 神气合一而定，即是此节之旨。 盖神行气行，气行精败，形因之衰矣，惟神凝气定，形随以泰，自然长生。 此节尤觉吃紧。 文逸真人云：混合为一，复忘一可与元化同出没。 又云：元和内运即成真，呼吸外求终来了。 三丰道言浅近说曰：大凡打坐，须将神抱住气，意系住息，在丹田中，宛转悠扬，聚而不散，则内藏之气与外来之气，交结于丹田，日充月盛，达乎四肢，流乎百脉，撞开夹脊双关而上游于泥丸，旋复降下绛宫而下丹田，神气相守，息息相依，河车之路通矣，功夫到此，筑基之效，已得一半了。 仙传玄机口诀曰：修仙之法，在乎凝神入气穴。 气穴，即玄关一窍。 此窍在心之下，肾之上，正中虚空之处，前对脐轮后对肾，乃生身立命之根蒂。 先天一气，凝而为性，后天一气，结而为命，性命之源，生死之蒂，人这寿夭，皆禀于斯，仙圣之种，亦含于斯，知此窍而摄心调养，则命在我，昧此窍而任心所为，则命由于天。 如下手之时，以心注定玄关一窍，即以心息相依之法，吸气入之，进则绵绵，出则微微，出息未已，即以入息继之，若心不守窍，则息虽入而神不注，则其关不开，必念念不离而后可。 若息不入窍，则心虽守而气不贯，其关亦不开，必息息归根而后可。",
      "translated_text": "When the true qi emerges, it warms the heart with a melting sweetness and opens the apertures—yet one must still settle it into the cavity, within the void aperture, accumulating and layering it. Then the stem of life grows and yang qi flourishes, allowing the opening of the passes and the circulation of qi.\n\nMaster Min said: The method of observing return ultimately lies in nothing beyond \"attaining utmost emptiness\" and \"maintaining deep stillness\"—these two phrases are the essential techniques. How many truly understand this secret?\n\nThe *High-Grade Alchemical Method* states: As the *Dan Jing* says, \"Heaven attains the One and becomes clear; Earth attains the One and becomes tranquil; Man attains the One and attains longevity.\" This primordial One Qi emerges from the midst of emptiness—yet it is not the same as utter void. By maintaining stillness to the extreme of emptiness, the body abides in the midst of the indistinct and obscure, in primordial chaos and great stability. Spirit and clarity arise naturally; the solitary numen remains ever serene—this is the true primordial, emptiness yet not emptiness.\n\nWhere spirit moves, qi moves; where spirit abides, qi abides. This means that spirit and qi are one, not two. Without qi, spirit has no support; without spirit, qi has no master. Since spirit is the master, when spirit moves, qi functions; when spirit does not move, qi also does not move—like a shadow following form. As the ancient immortals said, \"Breath arises from the heart; when the heart is still, breath is harmonized.\" This is the meaning.\n\nFurther examining this passage: Though the classics speak of spirit and qi in parallel, yin and yang side by side, the work of Dao cultivation lies solely in the union of yin and yang. To firmly guard emptiness is to \"attain utmost emptiness\" and \"maintain deep stillness,\" which is also the means to achieve union.\n\nMencius said: \"The will is the commander of qi.\"\nThe *Baopuzi* said: \"The method of refining qi should be practiced before noon. It can move mountains and seas, subdue tigers and leopards, and restrain bandits.\"\nThe *Three Essentials of Nurturing Life* said: \"A person’s qi, when blown, feels cool; when exhaled, feels warm. Warmth and coolness change between blowing and exhaling—thus in summer one can make things cold, and in winter, hot. Those who practice qi circulation can enter plague-ridden areas, ward off snakes and tigers, dwell underwater, walk upon water, or blow water to make it flow backward for a thousand miles. The transformations of qi are boundless, all depending on nurturing it with the proper method.\"\n\nMaster Shuju said: \"Where the heart directs and qi assists, one can summon wind and rain, move mountains. Where the heart halts and qi guards, one can traverse time—past, present, and future. Thus the Buddha could sit through five thousand kalpas in the snap of a finger, and Daoists could master creation in the palm of their hand.\"\n\nMaster Min said: \"Innate nature is fundamentally still. After long stillness, it naturally moves. When movement is concentrated, it becomes the great handle. Returning to the root, one reverts to stillness—stillness is called 'returning to life,' which is the esoteric secret. Concentration is reverence inwardly aligned; if movement is not concentrated, it is distraction. Returning from distraction to stillness is confusion. Thus, when the heart moves, it must be concentrated—this is the principle of selecting the good and firmly holding to it. When movement ends, return to stillness; when heart and spirit are calm and clear, this is clarity embodied.\"\n\nHe also said: \"The opening and closing of heaven and earth are nothing but movement and stillness. The life and death of the human body are nothing but movement and stillness. Like leaving the battlefield—after battle, one naturally returns to stillness. Like a theater—after the performance, one returns to stillness. Thus, all movement arises from emotion; stillness is one’s true nature.\"\n\n*Note: Master Min was a direct lineage holder of the Northern School, hence his teachings on stillness practice are especially intimate.*\n\nIf one desires longevity, spirit and qi must be mutually infused. When spirit and qi unite and stabilize, this is the essence of this passage. For where spirit moves, qi moves; where qi moves, essence decays, and the body withers. Only when spirit congeals and qi stabilizes does the body follow in peace—naturally attaining longevity. This passage is particularly crucial.\n\nMaster Wenyu said: \"When merged into one, then forget the one—thus may one emerge and submerge with the primordial transformation.\" He also said: \"When primordial harmony circulates internally, true attainment is achieved; seeking it externally through breath is ultimately futile.\"\n\nMaster Sanfeng’s plainspoken teachings said: \"In general, when sitting in meditation, one must embrace qi with spirit and tether breath with intention, within the Cinnabar Field, gently and leisurely, gathering without scattering. Then the internal qi and the externally drawn qi converge in the Cinnabar Field, growing day by day, month by month, reaching the four limbs and flowing through the hundred channels. It strikes open the double passes of the spine and ascends to the Muddy Pellet; then it descends again to the Crimson Palace and returns to the Cinnabar Field. Spirit and qi guard each other, breath follows breath—thus the path of the River Chariot is opened. At this stage, half the effect of laying the foundation is achieved.\"\n\nThe *Oral Secrets of the Immortals’ Mysterious Mechanism* said: \"The method of immortal cultivation lies in concentrating spirit into the qi cavity.\" The qi cavity is the Mysterious Pass. This aperture lies below the heart and above the kidneys, in the central empty space, facing the navel wheel in front and the kidneys behind—it is the root of life and the foundation of the body. The primordial qi congeals to become nature; the postnatal qi coalesces to become life. The source of nature and life, the stem of life and death—human longevity or brevity all depend on this. The seed of immortals and sages is also contained here. Knowing this aperture and gathering the heart to nurture it, life is in one’s own hands; ignoring this aperture and following the heart’s whims, life is left to heaven.\n\nWhen beginning practice, fix the heart upon the Mysterious Pass, using the method of heart and breath interdependence: inhale qi into it, gently and continuously; exhale softly and subtly. Before the exhale ends, let the inhale follow. If the heart does not guard the aperture, though breath enters, spirit does not infuse it—the pass will not open. Only with unwavering attention can it be achieved. If breath does not enter the aperture, though the heart guards it, qi does not penetrate—the pass will not open. Only when breath constantly returns to the root can it be achieved.\"",
      "overlap_context": "ath accompanies it, it is not void. The mind is like the great emptiness; if the breath follows it, it is not empty. Between non-void and non-empty, stillness deepens into deeper stillness, purity into deeper purity. All is released; the entire body is forgotten. Mind and spirit are silent; the breath is continuous. All enter into profound obscurity—this is called \"piercing the profound obscurity.\" Within this obscurity, there is qi, and the solitary spirit alone awakens—this is the true breath.",
      "start_char": 13619,
      "end_char": 14890,
      "start_sentence": 330,
      "end_sentence": 360,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.14371943473816,
      "metadata": {
        "source_file": "dao\\藏外\\胎息经笺疏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "纵心息俱到而任其出入则气不聚，而其关亦不开，必若钟离所谓多入少出而后可。 兼此三者，勿助勿忘，缓急中度，勿忘即用功不辍，勿助即不须提运助长，以神定气盈，充满丹田，而窍必开，精必至也。 譬如密室之中，香烟一缕，始甚微耳，若火不绝，其烟渐渐笼满室中，而空窍所通，无非透射之处。 人身真炁，始而腹中，渐而开窍，渐而四肢百骸，亦复如是，能积气，便能生精，不越片时，而真气周流，真精自生，所谓九还成大药，片晌显神功也。 此窍一开，百窍俱开，有病，即于病后微带热痛，或三四日，或七八日，其痛即止，病亦随去。 无病即补助，以至交媾还丹，得胎脱胎，超脱神化，皆时候至而妙窍开，不假人力造作而成者。 真精生时，只要气足神充，不终日而即达四肢百骸，皮肤状如虫行。 如是紧紧用功，顷刻不放，任督二脉，交于唇间，坎离乾坤，小周大周，三车三田，头面涌泉，无处不到。 如是刻刻不放，功效无穷，各各不同，结胎脱胎，日合月合，出神入化。 尽从此口诀始终妙悟，皆自然而然，而莫知其所以然也。 尚按此段与前此固守虚无以养神气节下之玄机口诀，乃明代遗老傅青主先生手抄，并经清儒顾亭林先生朱书批阅的口诀，傅先生多与真仙异人游，故其所述，确理事双超，不同耳食向壁之谈，有志养生入化者，大宜身体力行，决不相赚也。 汪东亭曰：能知相依，即可盗天地，夺造化。 能知心息自然相依，则是双修。 又曰：体也，真空也，神也，性也，必要到西方乾天求之。 用也妙有也，气也，命也，须至海底坤地寻之。 神气合一，性命双修。 又曰：不可着人身求之。 亦不可着口鼻求之。 得得真传者，必要知借口鼻之呼吸，返出先天真一之气，即。 又曰：凡言心息相依，心非肉团心，乃先天凝聚之元精，息非口鼻息，乃先天流行之元气，心息妙合，便是先天元神。 又曰，自然二字，为道、天、地人之宗主，要顺自然，不要听自然。 又曰：双修全赖火候，火候全赖自然。 又曰：先天一气，自虚无中来，虚者虚其心则神自睹，无者无其身则气自静。 但有先后天之别，先天属法身，后天属色身，先天虚无清静为炼己筑基，后天虚无清静则孤阴寂灭，金丹大道最重身外虚空，修先天法身，则是兼修后天色身也。 又曰：分言之，不降龙，何以伏虎，不积汞，何以取铅，汞内药也，铅外药也。 初下手，必先通内药，后通外药，故曰，内通外亦须通。 合言之，炼已即是筑基，筑基即是炼己，炼己为养神，筑基即安息也。 心不动念，无来无去，不出不入，自然常住。 心不动念，无来无去，即是心定神凝之功，岂特无来无去，直须绝对待、离二边，空三际，如如长住，住无所住方是。 心不动则气不动，故继之，以不出不入，自然常住，是气无出入，息灭尽定，心气不二矣。 闵真人曰：但作动静观，勿作动留见，无往亦非来，我故常自在，动静都不是，放下两头看。 又曰：我今常自在，无动亦非静，□里自惺惺，天人物我并。 勤而行之，是真道理。 既获如斯妙诀，应需精勤修习，必证妙果，是真仙大道之路，非旁门小法之比也。 妙果如何？ 司马承祯曰：道有至力，染易形神，形随道通，与神为一，形神合一，谓之神人。",
      "translated_text": "Though both heart and breath reach the aperture yet allow them free ingress and egress, qi will not gather, and the pass will not open—only as Zhongli Quan said, \"more in, less out,\" can it be achieved.\n\nCombining these three principles—neither forcing nor forgetting—maintaining the proper pace, neither too slow nor too swift: \"not forgetting\" means unceasing practice; \"not forcing\" means no need for deliberate effort or hastening. When spirit settles and qi fills, brimming in the cinnabar field, the aperture must open, and essence must arrive.\n\nIt is like a wisp of incense smoke in a sealed chamber—at first, barely perceptible. If the flame is never extinguished, the smoke gradually fills the room, and every crevice becomes permeated. The true qi of the human body begins in the abdomen, then gradually opens the aperture, and in time, flows through the four limbs and hundred bones—just so. To accumulate qi is to generate essence. In but a moment, true qi circulates, and true essence arises naturally. This is what is meant by \"the nine returns forming the great medicine,\" where in an instant, divine power manifests.\n\nOnce this aperture opens, all apertures open. If there is illness, after a slight warmth and pain—lasting three or four days, or seven or eight—the pain ceases, and the illness departs with it. If there is no illness, it serves as supplementation, leading to the union and return of the elixir, conception of the embryo, shedding of the embryo, transcendence, and spiritual transformation—all occurring when the time arrives and the wondrous aperture opens, without reliance on artificial effort.\n\nWhen true essence arises, as long as qi is sufficient and spirit abundant, it swiftly reaches the four limbs and hundred bones, and the skin feels as though insects crawl upon it. Practicing thus with unwavering diligence, not a moment’s slack, the Ren and Du meridians meet at the lips, Kan and Li, Qian and Kun, the small and great cycles, the three vehicles and three fields, the head and face, the bubbling spring—no place remains untouched. Practicing thus without cease, the effects are boundless, each unique: the embryo forms and is shed, the sun and moon unite, spirit emerges and transforms.\n\nAll these wondrous realizations begin and end with this oral instruction, arising naturally, without knowing how or why.\n\nFurthermore, this passage, along with the earlier esoteric oral instructions on \"firmly guarding emptiness to nurture spirit and qi,\" was hand-copied by Master Fu Qingzhu of the Ming loyalists and annotated in red by the Qing scholar Gu Tinglin. As Master Fu often associated with true immortals and extraordinary individuals, his teachings transcend both principle and practice, unlike the superficial, speculative theories of armchair scholars. Those earnest in cultivating life and entering transformation should wholeheartedly practice, for it is no deception.\n\nWang Dongting said: \"To know interdependence is to steal from heaven and earth, to seize the workings of creation.\" To know the natural interdependence of heart and breath is dual cultivation.\n\nHe also said: \"The body is true emptiness; spirit is nature. To attain these, one must seek in the Qian heaven of the West. Function is wondrous existence; qi is life. To attain these, one must seek in the Kun earth of the sea’s depths.\" When spirit and qi unite, nature and life are dually cultivated.\n\nHe further said: \"Do not seek within the physical body, nor within the mouth and nose.\" Those who receive the true transmission must know how to borrow the breath of mouth and nose to return to the primordial true unity of qi.\n\nHe also said: \"When speaking of heart and breath interdependence, the heart is not the fleshly heart but the primordial congealed original essence; the breath is not the breath of mouth and nose but the primordial flowing original qi. The wondrous union of heart and breath is the primordial original spirit.\"\n\nHe also said: \"The two characters 'natural' are the fundamental principle of the Dao, heaven, earth, and humanity. One must follow the natural, not merely listen to it.\"\n\nHe also said: \"Dual cultivation relies entirely on the firing times; the firing times rely entirely on the natural.\"\n\nHe also said: \"The primordial unity of qi comes from the midst of emptiness. To be empty is to empty the heart, and spirit naturally perceives; to be without is to be without the body, and qi naturally stills.\" There is a distinction between pre-heaven and post-heaven: pre-heaven pertains to the Dharma body, post-heaven to the physical body. Pre-heavenly emptiness and stillness are for refining the self and laying the foundation; post-heavenly emptiness and stillness lead to solitary yin’s extinction. The great path of the golden elixir most values the emptiness beyond the body—cultivating the pre-heavenly Dharma body is also cultivating the post-heavenly physical body.\n\nHe also said: \"Spoken separately: without descending the dragon, how can one subdue the tiger? Without accumulating mercury, how can one obtain lead? Mercury is the inner medicine; lead is the outer medicine. At the outset, one must first connect the inner medicine, then the outer medicine. Thus it is said: when the inner connects, the outer must also connect.\"\n\nSpoken together: refining the self is laying the foundation; laying the foundation is refining the self. Refining the self is nurturing spirit; laying the foundation is settling the breath. When the heart does not move with thoughts, there is no coming or going, no exiting or entering—naturally abiding. When the heart does not move with thoughts, there is no coming or going—this is the work of settling the heart and congealing spirit. Not only is there no coming or going, but one must transcend duality, leave the two extremes, empty the three times, and abide thusly, dwelling where there is no dwelling. When the heart does not move, qi does not move. Thus, it is said: \"no exiting or entering, naturally abiding.\" This is qi without exit or entry, breath extinguished in perfect stillness—heart and qi are not two.\n\nMaster Min said: \"Simply observe movement and stillness; do not cling to the perception of movement. There is no going, nor is there coming—I am thus ever at ease. Movement and stillness are not it; let go and observe from both ends.\"\n\nHe also said: \"I am now ever at ease, neither moving nor still. Within □, I am naturally awake—heaven, earth, beings, and I are one.\" Diligently practicing this is the true principle.\n\nHaving obtained such wondrous instructions, one must practice with utmost diligence to surely attain the wondrous fruit. This is the path of the true immortals’ great Dao, incomparable to the lesser methods of side doors.\n\nWhat is the wondrous fruit? Sima Chengzhen said: \"The Dao has supreme power, transforming form and spirit. When form follows the Dao’s flow, it unites with spirit. When form and spirit unite, this is called the spirit person.\"",
      "overlap_context": "of heart and breath interdependence: inhale qi into it, gently and continuously; exhale softly and subtly. Before the exhale ends, let the inhale follow. If the heart does not guard the aperture, though breath enters, spirit does not infuse it—the pass will not open. Only with unwavering attention can it be achieved. If breath does not enter the aperture, though the heart guards it, qi does not penetrate—the pass will not open. Only when breath constantly returns to the root can it be achieved.\"",
      "start_char": 14890,
      "end_char": 16153,
      "start_sentence": 361,
      "end_sentence": 396,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.58046293258667,
      "metadata": {
        "source_file": "dao\\藏外\\胎息经笺疏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "神性虚融，体无变灭，形与之同，故无生死，隐则形同于神，显则神同于形，所以蹈水火而无害，对日月而无影，存亡在己，出入无间，身为滓质，犹至虚妙，况其灵智益深益远乎。 然虚心之道，又有深浅，深则兼被于形，浅则唯及其心，被形者则神人也，及心者但得慧觉而已，身不免谢，何则？ 慧是心用，用多则体劳，初得小慧，悦而多辩，神气散泄，无灵润身，生致早终，道故难备，经云尸解，此之谓也。 又曰：山有三，草木因之不雕，人怀道，形体得之永固，资熏日久，变质同神，炼神入微，与道冥一，散一身为万法，混万法为一身，智照无边，形超有际，总空色以为用，合造化以为功。 又曰，身与道同，则无时而不存，心与道同，则无法而不通，耳则道耳，无声而不闻，眼则道眼，无色而不见，六根洞达，良由于此。 尚按此言证果之高低，浅者神妙而形不妙，即尸解之果，深者形神俱妙，所谓即身成圣，白日升天，然究其所以能致，亦不外慧而不用，则熏蒸四大，积累长久，变形而仙耳。 致仙道下手，即以腹有暖气为验，渐至遍体充和，口中可以干汞，吹气可以炙肉，全身一片纯阳。 夫身形之质，皆阴物耳，阳盛则阴衰，阳刚则阴柔，阳纯则阴绝，既有干汞炙肉之阳在，乌有血肉之阴不化乎？ 又考之释氏之言曰，人身之来源，唯是寿暖与识，寿者禀之于父母之施与，人寿之长短，皆以所禀之厚薄而有异； 暖即动物之生命，暖盛则旺，暖绝则亡； 识即灵识，所谓去后来先作主公者，故修养之要，不外培其寿，增其暖，则形体自健，神识有依。 以此为基，暖增不已，则形质渐妙，寿命永固，身化虹霓，无有变灭，识绝污染，返于圆明，此与道之九还七返，岂非二而一耶。 密法中关于化形之道，以修气脉明点为最直接有效，如以大圆满为主者，其前行之观修，与最后进入妥噶之行持，更是以心摄气者之化形要诀也。 胎息经笺疏，至此已圆。 兹有赘言者，此上虽汇列古哲名言，分砌于各节之下，然要知自始至终，到头不出神气二字，并非有先后之一定次序可言。 然下手行持，功夫由浅入深，而效验则步步不同，尽管效验步步不同，而修真之士，始终不离神气相守，有神有气则相守，忘神忘气则入虚，虚不自虚，道体圆明矣。",
      "translated_text": "The spirit’s nature is emptily fused, its essence without change or extinction. When form aligns with it, there is no birth or death. Concealed, form merges with spirit; revealed, spirit merges with form. Thus one treads water and fire without harm, faces sun and moon without shadow. Existence and cessation lie within oneself; entry and exit are without gap. Though the body is a coarse substance, it attains the utmost emptiness and subtlety—how much deeper and farther, then, does its numinous wisdom extend?\n\nYet the Dao of emptying the heart has depths and shallows. Deep, it pervades the form; shallow, it reaches only the heart. Those pervaded in form are spirit persons; those who reach only the heart attain but wisdom and awareness, and the body is not spared decay. Why? Wisdom is the function of the heart; excessive use wearies the substance. At first, small wisdom brings joy and much debate, scattering and depleting the spirit and qi, leaving no numinous essence to moisten the body. Life thus ends prematurely, and the Dao remains incomplete. The scriptures call this \"corpse liberation.\"\n\nIt is also said: Mountains have three [grades], and by them grasses and trees do not wither. When humans embrace the Dao, their forms endure forever. Nurtured by its influence over time, their substance transforms to match the spirit. Refining the spirit to the subtle, they merge with the Dao in darkness. They disperse one body into the ten thousand dharmas and blend the ten thousand dharmas into one body. Wisdom illumines without bound; form transcends all limits. They unify emptiness and form as their function and harmonize with creation as their achievement.\n\nIt is further said: When the body aligns with the Dao, there is no time when it does not exist. When the heart aligns with the Dao, there is no dharma it does not penetrate. The ear becomes the Dao-ear, hearing all sounds without sound. The eye becomes the Dao-eye, seeing all colors without color. The six senses become thoroughly clear—this is the reason.\n\nStill, according to these words, the fruition of practice varies in height. The shallow attain spirit’s subtlety but not the body’s; this is the fruit of corpse liberation. The deep attain subtlety in both form and spirit—this is called attaining sagehood in the body and ascending to heaven in broad daylight. Yet when one examines how this is achieved, it is nothing other than nurturing wisdom without employing it, thereby suffusing the four great elements, accumulating over long duration, transforming the form into an immortal.\n\nTo embark on the immortal’s Dao, one begins by verifying the presence of warmth in the abdomen, gradually extending it to fill the entire body with harmony. The mouth can then dry mercury, and the breath can sear flesh—one’s whole body becomes a single mass of pure yang. The substance of the body is inherently yin; when yang flourishes, yin wanes; when yang is firm, yin is soft; when yang is pure, yin is extinguished. With the presence of such yang—drying mercury and searing flesh—how could the yin of blood and flesh not be transformed?\n\nFurther, examining the words of the Śākya school: The origin of the human body lies solely in *āyus*, warmth, and consciousness. *Āyus* is endowed by the offering of father and mother; the length of a person’s life varies according to the thickness or thinness of this endowment. Warmth is the life of sentient beings; when warmth flourishes, life thrives; when warmth ceases, life ends. Consciousness is the numinous awareness—the \"master who comes last and goes first.\" Thus the essentials of cultivation lie in nurturing *āyus*, increasing warmth, so that the body is naturally robust and the spirit has a dwelling. With this as foundation, warmth increases without cease, the form gradually becomes subtle, life endures forever, the body transforms into a rainbow, without change or extinction. Consciousness severs defilement and returns to perfect clarity—is this not one with the Dao’s nine returns and seven reversions?\n\nIn esoteric methods concerning the Dao of transforming form, cultivating the qi channels and *bindu* is most direct and effective. For those who take *Dzogchen* as their main practice, the preliminary observations and the final entry into *Tögel* are the essential techniques for transforming form through the heart’s absorption of qi.\n\nThe *Commentaries on the Scripture of Embryonic Breathing* are here complete.\n\nThere is a superfluous remark: Though the above assembles the renowned sayings of ancient sages and arranges them under various sections, one must know that from beginning to end, it all comes down to the two words *spirit* and *qi*—there is no fixed sequence of before and after. Yet in embarking on practice, effort progresses from shallow to deep, and the effects differ step by step. Though the effects differ step by step, the cultivator of truth never departs from the mutual embrace of spirit and qi. With spirit and qi, there is embrace; forgetting spirit and qi, one enters emptiness. Emptiness does not empty itself—the Dao’s essence is perfectly luminous.",
      "overlap_context": "Diligently practicing this is the true principle.\n\nHaving obtained such wondrous instructions, one must practice with utmost diligence to surely attain the wondrous fruit. This is the path of the true immortals’ great Dao, incomparable to the lesser methods of side doors.\n\nWhat is the wondrous fruit? Sima Chengzhen said: \"The Dao has supreme power, transforming form and spirit. When form follows the Dao’s flow, it unites with spirit. When form and spirit unite, this is called the spirit person.\"",
      "start_char": 16153,
      "end_char": 17028,
      "start_sentence": 397,
      "end_sentence": 412,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.89065670967102,
      "metadata": {
        "source_file": "dao\\藏外\\胎息经笺疏.txt",
        "category": "藏外"
      }
    }
  ]
}