{
  "source_id": "虚皇天尊初真十戒文",
  "source_file": "chunked_daozang\\虚皇天尊初真十戒文.json",
  "total_chunks": 3,
  "total_original_chars": 2701,
  "total_translated_chars": 14761,
  "total_translation_time": 75.716548204422,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\戒律类\\虚皇天尊初真十戒文.txt",
    "category": "戒律类"
  },
  "full_translation": "**The Venerable Celestial Worthy’s Ten Precepts for Initial Realization**\n\n*Scripture Title:* *The Venerable Celestial Worthy’s Ten Precepts for Initial Realization*. One fascicle.\n*Source Text:* *Zhengtong Daoist Canon*, *Dongzhen* Section, Precepts and Disciplines Category.\n\nThe Venerable Celestial Worthy declares: Those who leave the household and transcend the mundane do so by virtue of profound karmic affinity from past lives, enabling them to rise above the common lot. If they remain steadfast from beginning to end, refining themselves with utmost dedication, their blessings shall extend to seven generations, and felicity shall flow through their entire family.\n\nAs the saying goes: \"A nine-tiered terrace begins with heaped earth; a thousand-mile journey starts with a single step.\" The gateway to the Dao and the foundation of accumulated virtue must likewise begin here. At the time of deliverance, one should receive the Ten Precepts for Initial Realization—you shall accept them.\n\n**The First Precept:** One must not be disloyal, unfilial, unkind, or untrustworthy. Instead, fulfill your duty to sovereign and kin, and extend sincerity to all beings.\n\nAs the tradition states: \"Of the ten thousand scrolls of immortals’ scriptures, loyalty and filial piety come first.\" Devoting oneself to serving the ruler and diligently attending to the sovereign’s affairs repays the grace of shelter and protection. Cultivating conduct and acting with caution, serving parents with goodness, repays the grace of birth and nurture. Serving one’s master as one serves one’s parents repays the grace of instruction. All people are born under three bonds—serving them as one repays the greatest debt of origin. Moreover, looking up, one feels no shame before Heaven; looking down, one feels no remorse before others. Revering and trusting the divine spirits repays the grace of creation. Together with the three preceding matters, these are called the **Four Graces**.\n\nAs for praying for the nation’s prosperity, dispelling demons and averting harm, transforming the people toward goodness, and supplementing where royal transformation does not reach—this is the loyalty of one who has left the household. In life, guide your kin to cherish blessings and turn toward the Dao; in death, assist them in ascending to the blessed realms. In your own conduct, sever all attachments to affection, quiet all worldly entanglements, focus the mind single-pointedly, and devote yourself to studying the Dao. Once the merit of the Dao is accomplished, even if your karmic bonds with kin span countless kalpas, all may be delivered. Above, this repays the **Fourfold Grace**; below, it relieves the suffering of the **Three Wretched Realms**—this is the filial piety of one who has left the household.\n\nAs for the unkind: they deceive themselves with reckless actions, transgressing rites and committing wrongs. As for the untrustworthy: they boast with empty exaggerations and bewilder the multitude with flowery words.\n\nOne must recognize that great loyalty means never deceiving one’s own heart, not even in the smallest matter; great filial piety means never acting contrary to principle, extending love to all beings as to one’s own body. Thus, a single deceitful word betrays loyalty; a single act against propriety violates filial piety. Loyalty and filial piety stand as the foremost of all precepts, the source of all conduct, and the primary duty of the seeker. If one can uphold and practice these as described above, one may fully serve ruler and kin, and extend sincerity to all things.\n\nThe second precept: one must not secretly scheme to harm others for personal gain. Instead, one should practice hidden virtue and broadly aid all beings. Secret scheming refers to instigating others to wrongdoing, inciting lawsuits, leading people into traps or legal snares while deriving pleasure from it—such harm for self-benefit is beyond measure. If, instead, one reflects inwardly and turns others toward goodness, one accumulates hidden virtue and universally aids all beings. This is the foremost principle of entering the Dao.\n\nThe third precept: one must not kill living beings to satisfy taste, but should practice kindness and compassion, extending it even to insects. Refraining from killing preserves benevolence. Birds and beasts share the same nature and life as humans: they form couples, have parent-child bonds, dwell in nests, seek food, and experience love, sorrow, joy, and fear—how are they different from us? To harbor a merciful heart, refusing to kill or consume them, and thus embody compassion—is this not virtuous? If one’s heart cherishes all beings but circumstances require blending with the world, one may observe the threefold purity: not intending to kill, not personally killing, and not witnessing the killing. In this way, one eats according to conditions—where is the killing in that?\n\nMoreover, sages and worthies have never rigidly prescribed meat-eating or abstention; their benevolence extends to all beings without distinction. Like a net with three sides left open, they distance themselves from the kitchen, fish with a hook but not a net, shoot birds but not roosting ones, avoid killing hibernating creatures, and refrain from breaking growing plants. Their virtue and kindness extend equally to humans, insects, and plants. Can those who abstain from meat truly live up to this? One should also recognize that the abundance or scarcity of one’s clothing and food results from the depth of past cultivation. What one receives today is one’s allotted portion; by moderating consumption, future blessings will grow immeasurably. If one acts thus, kindness extended to insects is no empty word.\n\nThe fourth precept: one must not engage in licentiousness, corrupting one’s true nature, defiling and profaning the sacred qi. Instead, one should guard one’s true integrity, ensuring no breach or transgression. Refraining from licentiousness prevents the disruption of ethical order. Marriage exists to continue the lineage and honor ancestors, so engagements are arranged through matchmakers, betrothal letters, and proper ceremonies, with feasts inviting neighbors and friends to reinforce distinctions between men and women. Thus, the way of husband and wife follows ritual propriety, avoiding encroachment on others—where is the licentiousness in this?\n\nProstitutes are deemed lowly precisely because their conduct disrupts human relationships. To associate with them is to descend to their level. Some past immortals visited brothels, either to test and strengthen their resolve against temptation or to guide those with karmic affinity toward awakening. Later, ordinary people may cite this to justify their own behavior, but such indulgence is mere heterodox wandering—true and false differ, as do immortals and mortals. Upright individuals naturally govern themselves and are not ensnared by such delusions.\n\nThose who leave the household to transcend the mundane do so due to past good fortune, enabling them to rise above ordinary ties. If they can swiftly sever worldly attachments, cut off desire, and diligently cultivate the Dao, they may attain immortality, bringing blessings to nine generations and prosperity to their entire family. As the scriptures say: \"Immortals and Daoists, though not inherently divine, accumulate essence and nurture qi to attain realization.\" However, if one’s foundation is weak and resolve unclear, one should early reflect and reform to encourage future progress, lest one squander good causes and fall back into the dust. By guarding true integrity without breach, one’s virtue and merit will daily renew, and Daoist attainment will be achieved.\n\nThe fifth precept: one must not undermine others’ success or sever others’ familial bonds. Instead, one should assist all beings with the Dao, fostering harmony among the nine relations. Not undermining others’ success means praising and supporting their virtues while concealing their faults, enabling them to succeed without losing virtue. Not severing others’ bonds means that when seeing discord among relatives—parents and children, husbands and wives, siblings, teachers and friends—one should use the Dao to exhort and reconcile them, preventing estrangement. Thus, human relationships remain intact, and both Dao and righteousness are preserved. This is the essential path of true cultivation; those who study the Dao should take heed.\n\nThe sixth precept: one must not slander the worthy, flaunt one’s own talents, or boast of one’s abilities. Instead, one should praise others’ virtues and not claim credit for one’s own merits. Sincerity is the gateway to the Dao. Speech is the voice of the heart; deceitful words arise from insincerity. To seek the Dao with an insincere heart is to turn away from it—this is impossible. Slandering the worthy, flaunting talents, and boasting of abilities are unbecoming of a true cultivator. One should praise others’ virtues, thereby completing one’s own merit and conduct. This is a profound precept for seekers.\n\nThe seventh precept: one must not overindulge in alcohol, consume forbidden meats, or disrupt the harmony of qi and nature. Instead, one should regulate temperament and focus on purity and emptiness. Refraining from alcohol prevents the disturbance of one’s nature.\n\nFor wine was originally used to conduct rituals, fostering harmony and the smooth flow of qi. The ancients, when hosting guests, would exchange a hundred bows in a day without ever becoming drunk, demonstrating moderation. Later generations, however, indulged their desires without restraint, drinking to excess in pursuit of intoxication. This led to the inversion of body and mind, the loss of ritual propriety, and sometimes illness or disaster—yet they remained oblivious to their errors. If one were to drink in moderation, adjusting intake according to one’s usual tolerance without exceeding it, how could it disturb one’s nature?\n\nAs for consuming forbidden meats: the ox labors for humanity, the dog demonstrates loyalty, the wild goose maintains order, and the carp and eel face the Dipper in reverence. How could one bear to eat such creatures? Extending this compassion to abstain from all such meats harmonizes one’s qi and nature, moves the true spirits, and dedicates one wholly to purity and emptiness. Thus, one’s Dao and practice renew daily, and profound merit manifests in due time. All learners must be vigilant in this.\n\nThe eighth precept: one must not indulge in insatiable greed, hoarding wealth without distribution. Instead, one should practice frugality and relieve the poor. A person’s poverty or wealth is ordained at the moment of birth, predetermined by fate. If one’s allotment of wealth is destined, it will return even after being spent; if one’s bones were formed in poverty, no amount of seeking will bring riches. Understanding this principle, one should leave all acquisition to nature. Wealth not one’s own must not be taken wrongfully; ill-gotten gains must not be seized; rightful gains should be taken in accordance with one’s portion. One must not fall into the desire for endless acquisition, nor hoard without sharing, lest misfortune be invited. Yet those of our fellowship must first see through the illusory and transient, relieving the poor with compassion, guarding frugality, and living in accord with conditions. Do not impose rigid demands, but keep the mind empty and at ease, letting worldly desires dissipate. Over time, one will naturally unite with the Dao in truth.\n\nThe ninth precept: one must not associate with the unworthy or dwell in impurity. Instead, one should emulate those superior to oneself and gather in purity and emptiness. When first leaving the household life, one cannot stand alone and must rely on the monastic community or form bonds with fellow cultivators, supporting one another to avoid imbalance. Yet companions are of three kinds: cloud-and-mist friends, good and wise friends, and reckless and strange friends.\n\nThose who uphold integrity, refine the heart-ground, investigate karma, sever worldly attachments, and wander beyond the dust—seeking like-minded companions—are called cloud-and-mist friends. Their hearts resemble clouds and mist, untouched by worldly affairs. Others study scriptures and engage in lofty discourse; these are called good and wise friends, for though they do not refine the heart, neither do they commit evil. Then there are those who neglect the heart-ground, do not study the classics, disregard karma, speak perversely, act wildly, and provoke conflict over the slightest offense. They boast of strength, flaunt superiority, bully the good, and form cliques—these are reckless and strange friends.\n\nAfter these three kinds of people depart this life, each is placed according to their deeds and receives their due recompense. The cloud-and-mist friends ascend into the formless, roaming and feasting in the Jade Capital, becoming immortals or celestial officials. The good and wise friends, their worldly hearts not yet exhausted, remain within the human realm. The reckless and strange friends, having received abundant offerings yet performed no merit, must repay their debts: some fall into Fengdu, others into the realm of beasts, cycling through suffering and affliction. When such a fate befalls them, how can regret avail? Of these three kinds of companions, one must choose wisely. Let learners reflect and seek what is most advantageous, emulating those superior to themselves and gathering in purity and emptiness. Thus, they will not betray the intentions of parents who sent them forth from the household, nor fail the sagely dynasty’s purpose in establishing teachings to deliver beings. Let all take this to heart, that they may attain the square and upright merit.\n\nThe tenth precept: one must not treat speech and laughter lightly or act insincerely. Instead, one should maintain gravity, speak sparingly, and devote oneself to the Dao and virtue. As the ancients said: “Those who are dignified and solemn, if not wealthy, will be noble; those who are frivolous and base, if not short-lived, will be poor.” Light and careless speech, obsequious smiles, and bending one’s learning to flatter the world—these are the refuge of petty persons, not the conduct of true cultivators. Moreover, gravity and restraint in speech, with every movement conforming to propriety, are essential for advancing on the Dao and the proper path for those who have attained understanding. If one can steadfastly uphold and practice this, what worry is there that lofty attainment will not be reached?\n\nHere ends the *Ten Precepts for Initial Realization* of the Most High Lord of the Void.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "虚皇天尊初真十戒文 经名：虚皇天尊初真十戒文。 一卷。 底本出处：《正统道藏》洞真部戒律类。 虚皇天尊初真十戒文 谨按虚皇天尊言：出家超俗，皆宿有良契，故能独拔常伦，若慎终如始，精至修炼，当福及七租，庆流一门。 所谓九层之台，起於累土，千里之行，始於足下，入道之门，积德之基，亦必由此始。 开度之时，宜受初真之戒，其戒有十，尔当受之。 第一戒者，不得不忠、不孝、不仁、不信，当尽节君亲，推诚万物。 按传曰：仙经万卷，忠孝为先。 盖致身事君，勤劳王事，所以答覆庇之恩也； 修身慎行，善事父母，所以答生育之恩也； 事师如事父母，所以答教诲之恩也。 民生於三，事之如一，乃报本之大者，加以仰不愧於天，俯不怍於人，敬信神明，所以答造化之恩也。 并前三事，谓之四恩。 至於祝国延禧，除妖却害，化民为善，裨王化之所未及，乃出家之忠也。 生则诱其亲，以惜福向道； 死则为之，迁神福乡。 其处己，则离诸恩爱，息诸尘缘，专精一心，勤於学道。 道功既就，则虽亿劫种亲，皆得超度，上可以报四重之恩，下可以济三途之苦，乃出家之孝也。 至於不仁者，欺心妄作，越礼非为； 不信者，虚诞自矜，华辞惑众。",
      "translated_text": "**The Venerable Celestial Worthy’s Ten Precepts for Initial Realization**\n\n*Scripture Title:* *The Venerable Celestial Worthy’s Ten Precepts for Initial Realization*. One fascicle.\n*Source Text:* *Zhengtong Daoist Canon*, *Dongzhen* Section, Precepts and Disciplines Category.\n\nThe Venerable Celestial Worthy declares: Those who leave the household and transcend the mundane do so by virtue of profound karmic affinity from past lives, enabling them to rise above the common lot. If they remain steadfast from beginning to end, refining themselves with utmost dedication, their blessings shall extend to seven generations, and felicity shall flow through their entire family.\n\nAs the saying goes: \"A nine-tiered terrace begins with heaped earth; a thousand-mile journey starts with a single step.\" The gateway to the Dao and the foundation of accumulated virtue must likewise begin here. At the time of deliverance, one should receive the Ten Precepts for Initial Realization—you shall accept them.\n\n**The First Precept:** One must not be disloyal, unfilial, unkind, or untrustworthy. Instead, fulfill your duty to sovereign and kin, and extend sincerity to all beings.\n\nAs the tradition states: \"Of the ten thousand scrolls of immortals’ scriptures, loyalty and filial piety come first.\" Devoting oneself to serving the ruler and diligently attending to the sovereign’s affairs repays the grace of shelter and protection. Cultivating conduct and acting with caution, serving parents with goodness, repays the grace of birth and nurture. Serving one’s master as one serves one’s parents repays the grace of instruction. All people are born under three bonds—serving them as one repays the greatest debt of origin. Moreover, looking up, one feels no shame before Heaven; looking down, one feels no remorse before others. Revering and trusting the divine spirits repays the grace of creation. Together with the three preceding matters, these are called the **Four Graces**.\n\nAs for praying for the nation’s prosperity, dispelling demons and averting harm, transforming the people toward goodness, and supplementing where royal transformation does not reach—this is the loyalty of one who has left the household. In life, guide your kin to cherish blessings and turn toward the Dao; in death, assist them in ascending to the blessed realms. In your own conduct, sever all attachments to affection, quiet all worldly entanglements, focus the mind single-pointedly, and devote yourself to studying the Dao. Once the merit of the Dao is accomplished, even if your karmic bonds with kin span countless kalpas, all may be delivered. Above, this repays the **Fourfold Grace**; below, it relieves the suffering of the **Three Wretched Realms**—this is the filial piety of one who has left the household.\n\nAs for the unkind: they deceive themselves with reckless actions, transgressing rites and committing wrongs. As for the untrustworthy: they boast with empty exaggerations and bewilder the multitude with flowery words.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 480,
      "start_sentence": 0,
      "end_sentence": 21,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.64323329925537,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\虚皇天尊初真十戒文.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "要当知大忠者，不昧其心，至一物不欺； 大孝者，不悖於理，至一体皆爱。 然则一语欺心，非忠也； 一事悖礼，非孝也。 故忠孝为诸戒之首，百行之源，学者之先务也。 若能依上遵守而行，则可以尽节君亲，推诚万物矣。 第二戒者，不得阴贼潜谋，害物利己，当行阴德，广济群生。 夫阴贼潜谋者，是暗中使人为非，教唆词讼之谓也。 令人入於陷阱宪网之中而自得快乐，害物利己之念，迨不可胜言。 若或返照回光，化人为善，则广阴德，普济群生，斯乃入道之第一义也。 第三戒者，不得杀害含生，以充滋味，当行慈惠，以及昆虫。 盖不杀生者，所以存仁爱也。 夫禽兽旁生，性命同禀，有夫妇之配，有父子之情，有巢穴之居，有饮食之念，爱僧喜惧，何异於人。 能怀恻隐之心，不忍杀戮而食，以证慈悲之行，不亦善乎？ 或心虽仁民爱物，而迹乃混俗众中，有所未便，则不起意杀、不下手杀、不眼见杀三净，是则饮食随缘，又何杀生之有？ 且圣贤於肉食，固未常必其有无，而仁爱之及物，亦何常间乎彼此，如网解三面，迹远庖厨，钓而不纲，弋不射宿，启蛰不杀，方长不折。 德惠之普，人虫草木，一视同仁。 后之不肉食者，果能然乎？ 又当知人生衣食之丰俭，皆因前世修积之浅深，今日分应所受，乃能节之，则当来之福益厚，莫可量也。 果能如是，则慈惠以及昆虫，岂虚言哉。 第四戒者，不得淫邪败真，秽慢灵炁，当守真操，使无缺犯。 盖不淫邪者，所以戒乱伦也。 夫有家者，特为继后承先而设，故凭媒议通书娉，明白婚娶。 又为酒食，以召乡党僚友，以厚男女之别，则夫妇之道，礼所当然，实不犯他人之色，又何淫之有？ 娼妓之徒，名曰下贱，正以其苟合，乱人伦也。 若亲此辈，是与等矣。 然前代仙师亦有游戏妓门者，盖或以试炼道心，令见境不动，或从化导有缘，令背尘合觉。 后之凡夫，或引以证己，实乃左道滥游，真妄不同，仙凡异致。 端人正士，自善主张，未必溺於其所惑也。 其出家超俗者，皆因宿有善庆，所以独拔常伦，果能顿息尘缘，断绝色欲，精修道行，当证仙阶，福及九祖，庆流一门。 经曰：仙人道士，非有灵质，积精养炁，以成真者，此也。 然或初基，未明志节，早宜修省，以勖将来，毋负善因，复堕尘网，当守真操，使毋缺犯，则福德日新，道功可就矣。 第五戒者，不得败人成功，离人骨肉，当以道助物，令九族雍和。 夫不败人成功者，盖闻人有一善，则赞和之，闻有诸恶，必当掩之，使之成功，不至丧德。 又不离人骨肉者，或见有亲族不和，父子、夫妻、兄弟、师友，因矛盾而至参商者，当以道劝勉，使之雍和，令不离间，则人伦不废，道义两全，实声真之要路也。 学道之士，宜各体知。 第六戒者，不得谗毁贤良，露才扬己，当称人之美善，不自伐其功能。 盖诚为入道之门。 语者，心之声也； 语之妄，由心之不诚也。 心既不诚而谓之道，是谓背道求道，无有是处。 但遇贤良而谗毁之，则露才扬己，自伐功能，皆非正士之所宜有，必当称人之美善，庶几成己之功动，此固学者之深戒也。 第七戒者，不得饮酒过差，食肉违禁，当调和气性，专务清虚。 夫不饮酒者，所以戒乱性也。",
      "translated_text": "One must recognize that great loyalty means never deceiving one’s own heart, not even in the smallest matter; great filial piety means never acting contrary to principle, extending love to all beings as to one’s own body. Thus, a single deceitful word betrays loyalty; a single act against propriety violates filial piety. Loyalty and filial piety stand as the foremost of all precepts, the source of all conduct, and the primary duty of the seeker. If one can uphold and practice these as described above, one may fully serve ruler and kin, and extend sincerity to all things.\n\nThe second precept: one must not secretly scheme to harm others for personal gain. Instead, one should practice hidden virtue and broadly aid all beings. Secret scheming refers to instigating others to wrongdoing, inciting lawsuits, leading people into traps or legal snares while deriving pleasure from it—such harm for self-benefit is beyond measure. If, instead, one reflects inwardly and turns others toward goodness, one accumulates hidden virtue and universally aids all beings. This is the foremost principle of entering the Dao.\n\nThe third precept: one must not kill living beings to satisfy taste, but should practice kindness and compassion, extending it even to insects. Refraining from killing preserves benevolence. Birds and beasts share the same nature and life as humans: they form couples, have parent-child bonds, dwell in nests, seek food, and experience love, sorrow, joy, and fear—how are they different from us? To harbor a merciful heart, refusing to kill or consume them, and thus embody compassion—is this not virtuous? If one’s heart cherishes all beings but circumstances require blending with the world, one may observe the threefold purity: not intending to kill, not personally killing, and not witnessing the killing. In this way, one eats according to conditions—where is the killing in that?\n\nMoreover, sages and worthies have never rigidly prescribed meat-eating or abstention; their benevolence extends to all beings without distinction. Like a net with three sides left open, they distance themselves from the kitchen, fish with a hook but not a net, shoot birds but not roosting ones, avoid killing hibernating creatures, and refrain from breaking growing plants. Their virtue and kindness extend equally to humans, insects, and plants. Can those who abstain from meat truly live up to this? One should also recognize that the abundance or scarcity of one’s clothing and food results from the depth of past cultivation. What one receives today is one’s allotted portion; by moderating consumption, future blessings will grow immeasurably. If one acts thus, kindness extended to insects is no empty word.\n\nThe fourth precept: one must not engage in licentiousness, corrupting one’s true nature, defiling and profaning the sacred qi. Instead, one should guard one’s true integrity, ensuring no breach or transgression. Refraining from licentiousness prevents the disruption of ethical order. Marriage exists to continue the lineage and honor ancestors, so engagements are arranged through matchmakers, betrothal letters, and proper ceremonies, with feasts inviting neighbors and friends to reinforce distinctions between men and women. Thus, the way of husband and wife follows ritual propriety, avoiding encroachment on others—where is the licentiousness in this?\n\nProstitutes are deemed lowly precisely because their conduct disrupts human relationships. To associate with them is to descend to their level. Some past immortals visited brothels, either to test and strengthen their resolve against temptation or to guide those with karmic affinity toward awakening. Later, ordinary people may cite this to justify their own behavior, but such indulgence is mere heterodox wandering—true and false differ, as do immortals and mortals. Upright individuals naturally govern themselves and are not ensnared by such delusions.\n\nThose who leave the household to transcend the mundane do so due to past good fortune, enabling them to rise above ordinary ties. If they can swiftly sever worldly attachments, cut off desire, and diligently cultivate the Dao, they may attain immortality, bringing blessings to nine generations and prosperity to their entire family. As the scriptures say: \"Immortals and Daoists, though not inherently divine, accumulate essence and nurture qi to attain realization.\" However, if one’s foundation is weak and resolve unclear, one should early reflect and reform to encourage future progress, lest one squander good causes and fall back into the dust. By guarding true integrity without breach, one’s virtue and merit will daily renew, and Daoist attainment will be achieved.\n\nThe fifth precept: one must not undermine others’ success or sever others’ familial bonds. Instead, one should assist all beings with the Dao, fostering harmony among the nine relations. Not undermining others’ success means praising and supporting their virtues while concealing their faults, enabling them to succeed without losing virtue. Not severing others’ bonds means that when seeing discord among relatives—parents and children, husbands and wives, siblings, teachers and friends—one should use the Dao to exhort and reconcile them, preventing estrangement. Thus, human relationships remain intact, and both Dao and righteousness are preserved. This is the essential path of true cultivation; those who study the Dao should take heed.\n\nThe sixth precept: one must not slander the worthy, flaunt one’s own talents, or boast of one’s abilities. Instead, one should praise others’ virtues and not claim credit for one’s own merits. Sincerity is the gateway to the Dao. Speech is the voice of the heart; deceitful words arise from insincerity. To seek the Dao with an insincere heart is to turn away from it—this is impossible. Slandering the worthy, flaunting talents, and boasting of abilities are unbecoming of a true cultivator. One should praise others’ virtues, thereby completing one’s own merit and conduct. This is a profound precept for seekers.\n\nThe seventh precept: one must not overindulge in alcohol, consume forbidden meats, or disrupt the harmony of qi and nature. Instead, one should regulate temperament and focus on purity and emptiness. Refraining from alcohol prevents the disturbance of one’s nature.",
      "overlap_context": "erit of the Dao is accomplished, even if your karmic bonds with kin span countless kalpas, all may be delivered. Above, this repays the **Fourfold Grace**; below, it relieves the suffering of the **Three Wretched Realms**—this is the filial piety of one who has left the household.\n\nAs for the unkind: they deceive themselves with reckless actions, transgressing rites and committing wrongs. As for the untrustworthy: they boast with empty exaggerations and bewilder the multitude with flowery words.",
      "start_char": 480,
      "end_char": 1725,
      "start_sentence": 22,
      "end_sentence": 65,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.140642642974854,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\虚皇天尊初真十戒文.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "盖酒本以行礼，浃洽和气，古人主宾百拜，终日而不至醉，示有节也。 后人嗜欲无厌，纵饮谋醉，遂至形骸颠倒，礼法丧失，或以致病，或以构祸，罔觉其非，傥随平日酒量深浅，减节饮之，不使过量，又何乱性之有？ 且食肉违禁者，如牛之有功，犬之有义，雁之有序，鲤鳝朝斗，此等之肉，又安忍食之？ 能推此心，戒而不食，则可以调和气性，感格真灵，专务清虚而道业日新，玄功时着矣。 凡所学者，宜自慎焉。 第八戒者，不得贪求无厌，积财不散，当行节俭，惠恤贫穷。 夫人之贫富，命禀生初，悉已前定。 若生财有分，用尽还来； 若胎骨受贫，广求不富。 能明此理，一切取觅，付之自然。 非己之财，不妄取； 非义之财，不苟得； 合得之财，随分取。 可不陷於食求无厌之欲，亦有积而不散，致招殃祸者。 然吾党之士，先须识破幻假，以惠恤贫穷，节俭谨守，随缘度日，勿苦责求常，使心地虚闲，物欲消遣，久则自然与道合真矣。 第九戒者，不得交游非贤，居处杂秽，当慕胜己，栖集清虚。 夫初心出家，未能独立，须仗丛林，或结道伴，递相扶持，不至偏颇。 然友分三等，有云朋霞友，有良朋知友，有狂朋怪友。 凡有志节、炼心地、究罪福、绝尘情，逍遥方外，同志相求，遂与为友，此等谓之云朋霞友，以其心与云霞相似，尘事碍他不住故也。 又有习学经书，高谈阔论，此等谓之良朋知友，以其不炼心，亦不能作恶故也。 又有一等，不治心地，不习经典，不顾罪福，出语乖讹，作事狂横，触着一毫，便起争斗，夸强逞俊，恃力恃胜，欺压良善，相率成党，此等谓之狂朋怪友。 此三等人身谢之后，各有安置去处，随其功业，各得受报。 其云朋霞友，升入无形，游宴玉京，或为神仙，或为天官； 其良朋知友，尘心未尽，不出人伦； 其狂朋怪友，受了十分供养，全无功德，填还口债，或堕酆都，或堕旁生，轮回苦恼，若到如斯，悔之何及。 如上三友，宜审择焉。 学者思之，各寻长便，当慕胜己，栖集清虚，不负父母遣子出家之心，不孤圣朝开教度人之意，所宜体悉，庶获成方功。 第十戒者，不得轻忽言笑，举动非真，当持重寡辞，以道德为务。 按古云：端谨严重，不富即贵； 轻浮薄劣，不夭即贫。 而轻忽语言，胁肩谄笑，曲学阿世，小人之归，实非正士之所宜有。 况持重寡辞，动容中式，乃进道之要，诚达者之所当为。 若能恪守力行，何患乎高尚之不至欤？ 虚皇天尊初真十戒文竟",
      "translated_text": "For wine was originally used to conduct rituals, fostering harmony and the smooth flow of qi. The ancients, when hosting guests, would exchange a hundred bows in a day without ever becoming drunk, demonstrating moderation. Later generations, however, indulged their desires without restraint, drinking to excess in pursuit of intoxication. This led to the inversion of body and mind, the loss of ritual propriety, and sometimes illness or disaster—yet they remained oblivious to their errors. If one were to drink in moderation, adjusting intake according to one’s usual tolerance without exceeding it, how could it disturb one’s nature?\n\nAs for consuming forbidden meats: the ox labors for humanity, the dog demonstrates loyalty, the wild goose maintains order, and the carp and eel face the Dipper in reverence. How could one bear to eat such creatures? Extending this compassion to abstain from all such meats harmonizes one’s qi and nature, moves the true spirits, and dedicates one wholly to purity and emptiness. Thus, one’s Dao and practice renew daily, and profound merit manifests in due time. All learners must be vigilant in this.\n\nThe eighth precept: one must not indulge in insatiable greed, hoarding wealth without distribution. Instead, one should practice frugality and relieve the poor. A person’s poverty or wealth is ordained at the moment of birth, predetermined by fate. If one’s allotment of wealth is destined, it will return even after being spent; if one’s bones were formed in poverty, no amount of seeking will bring riches. Understanding this principle, one should leave all acquisition to nature. Wealth not one’s own must not be taken wrongfully; ill-gotten gains must not be seized; rightful gains should be taken in accordance with one’s portion. One must not fall into the desire for endless acquisition, nor hoard without sharing, lest misfortune be invited. Yet those of our fellowship must first see through the illusory and transient, relieving the poor with compassion, guarding frugality, and living in accord with conditions. Do not impose rigid demands, but keep the mind empty and at ease, letting worldly desires dissipate. Over time, one will naturally unite with the Dao in truth.\n\nThe ninth precept: one must not associate with the unworthy or dwell in impurity. Instead, one should emulate those superior to oneself and gather in purity and emptiness. When first leaving the household life, one cannot stand alone and must rely on the monastic community or form bonds with fellow cultivators, supporting one another to avoid imbalance. Yet companions are of three kinds: cloud-and-mist friends, good and wise friends, and reckless and strange friends.\n\nThose who uphold integrity, refine the heart-ground, investigate karma, sever worldly attachments, and wander beyond the dust—seeking like-minded companions—are called cloud-and-mist friends. Their hearts resemble clouds and mist, untouched by worldly affairs. Others study scriptures and engage in lofty discourse; these are called good and wise friends, for though they do not refine the heart, neither do they commit evil. Then there are those who neglect the heart-ground, do not study the classics, disregard karma, speak perversely, act wildly, and provoke conflict over the slightest offense. They boast of strength, flaunt superiority, bully the good, and form cliques—these are reckless and strange friends.\n\nAfter these three kinds of people depart this life, each is placed according to their deeds and receives their due recompense. The cloud-and-mist friends ascend into the formless, roaming and feasting in the Jade Capital, becoming immortals or celestial officials. The good and wise friends, their worldly hearts not yet exhausted, remain within the human realm. The reckless and strange friends, having received abundant offerings yet performed no merit, must repay their debts: some fall into Fengdu, others into the realm of beasts, cycling through suffering and affliction. When such a fate befalls them, how can regret avail? Of these three kinds of companions, one must choose wisely. Let learners reflect and seek what is most advantageous, emulating those superior to themselves and gathering in purity and emptiness. Thus, they will not betray the intentions of parents who sent them forth from the household, nor fail the sagely dynasty’s purpose in establishing teachings to deliver beings. Let all take this to heart, that they may attain the square and upright merit.\n\nThe tenth precept: one must not treat speech and laughter lightly or act insincerely. Instead, one should maintain gravity, speak sparingly, and devote oneself to the Dao and virtue. As the ancients said: “Those who are dignified and solemn, if not wealthy, will be noble; those who are frivolous and base, if not short-lived, will be poor.” Light and careless speech, obsequious smiles, and bending one’s learning to flatter the world—these are the refuge of petty persons, not the conduct of true cultivators. Moreover, gravity and restraint in speech, with every movement conforming to propriety, are essential for advancing on the Dao and the proper path for those who have attained understanding. If one can steadfastly uphold and practice this, what worry is there that lofty attainment will not be reached?\n\nHere ends the *Ten Precepts for Initial Realization* of the Most High Lord of the Void.",
      "overlap_context": "ible. Slandering the worthy, flaunting talents, and boasting of abilities are unbecoming of a true cultivator. One should praise others’ virtues, thereby completing one’s own merit and conduct. This is a profound precept for seekers.\n\nThe seventh precept: one must not overindulge in alcohol, consume forbidden meats, or disrupt the harmony of qi and nature. Instead, one should regulate temperament and focus on purity and emptiness. Refraining from alcohol prevents the disturbance of one’s nature.",
      "start_char": 1725,
      "end_char": 2677,
      "start_sentence": 66,
      "end_sentence": 99,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.932672262191772,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\虚皇天尊初真十戒文.txt",
        "category": "戒律类"
      }
    }
  ]
}