{
  "source_id": "西岳华山志",
  "source_file": "chunked_daozang\\西岳华山志.json",
  "total_chunks": 14,
  "total_original_chars": 9192,
  "total_translated_chars": 53744,
  "total_translation_time": 296.69754362106323,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\记传类\\西岳华山志.txt",
    "category": "记传类"
  },
  "full_translation": "**The Western Peak Mount Hua Record**\n\n**Scripture Title:** *The Western Peak Mount Hua Record*. Compiled by Wang Chuyi of the Jin dynasty. One fascicle. Base text from the *Daoist Canon of the Zhengtong Era*, *Dongzhen* section, *Records and Biographies* category.\n\n**Preface to *The Western Peak Mount Hua Record***\n\nOf old, those who sought to compound divine elixirs invariably entered renowned mountains and blessed lands, never confining themselves to lesser hills. Why? Lesser mountains lack true deities to preside over them, being instead inhabited by the spirits of trees and stones—aged beings of a thousand years, whose qi harbors perversity and who care not to bring fortune to humankind.\n\nAccording to the *Classic of Mountains*, the peaks where one may refine the mind and concoct divine elixirs are Mount Hua, Mount Tai, Mount Huo, Mount Heng, and Mount Song. The rest lie within the Central Plains or beyond the five marches of the feudal lords. Though mountains called \"renowned\" number in the hundreds, they cannot all be enumerated. Yet all these possess true deities within their bounds, or else reclusive earthbound immortals. They also nurture magic mushrooms. Should a practitioner of the Dao ascend such a mountain, its spirits will surely bestow blessings, and the elixir will assuredly be perfected.\n\nMy homeland, Jincheng, spans a thousand *li*, commanding the three rivers. Amid its rivers and peaks, the majesty of Mount Taihua stands preeminent. Taihua, embracing the Three Dukes in its embrace and rivaling the Four Sacred Peaks, forces even Zhongnan and Taibai to stand in awe, while Shouyang and Wangwu dare not vie for supremacy. To the west, it gazes upon the dimming twilight of Mu Valley; to the east, it beholds the dawn of Fusang. No summit surpasses it in height—only the vault of heaven crowns its peak. It has received the primordial essence of the Great Simplicity and the pure qi of the Metal Heaven, shaping the myriad things and presiding over the *dui* direction. Among the Ten Great Grotto-Heavens, it is named \"Utmost Perfection.\" It cradles the sun and moon, exhales and inhales clouds and mist, giving rise to towers beyond the realm of form, to landscapes not of this mortal world.\n\nAmong the Eighteen Water Palaces, its Chexiang holds a deep pool, where the southeast rivers and seas subtly connect through hidden earth veins. It is enshrined in the sacrificial canon as an enduring norm. Here, golden dragons are cast and jade tablets presented. When the Immortal’s Palm pierces the clouds and the Azure Dragon heralds the sun, a thousand peaks bow to the mountain, while mist and qi flow like rivers. The verdant hues brush against travelers’ robes, lingering long after they depart.\n\nThen, as the slanting sun gilds the peaks, the Lotus Peak plays with hues—now golden, now jade—neither crimson nor azure, a thousand marvels beyond description. Amber pines glow at night, and the earth yields sweet springs, a national auspice. Thus, it is fitting that the Five Numinous Elders descend here, that the True Man of Hangu Pass conceals himself, that some in star-crowned feathered robes ride clouds to audience with emperors, or that others in jeweled chariots and feathered canopies mount dragons to behold the Great Veil. Summoning perfected sages and gathering divine spirits, Mount Hua becomes a grand assembly.\n\nMy friend, Master Wang Ziyuan, awakened early to guard the Dao, standing alone yet preserving harmony. He often told others: \"I long to wander clouded groves with staff in hand, to raise a cup upon misty peaks—this aspiration has endured for years.\" Soon after his marriage, he abandoned his home for the renowned mountains, refining the Golden Fluid. If not Mount Taihua, where else would he fix his intent?\n\nPeople said: \"It is fitting.\" Thereupon, Master Wang took an old copy of the *Record of Mount Hua*, fearing omissions, and further consulted the *Illustrated Classic* of his prefecture and Liu Xiang’s *Arrayed Transmissions of Immortals*, gathering all accounts of Mount Hua to supplement it. He arranged each entry in its proper place, ensuring nothing was misplaced.\n\nViewed through its landscapes, the peaks and caves, forests and valleys, cliffs and grottoes, pools and wells, streams and ravines, springs and deep pools—all may be seen. Viewed through its temples and sanctuaries, the palaces and monasteries, alchemical furnaces and altars where deities descend—all may be known. As for its medicinal produce, the *fuling*, *acorus*, *asarum*, and *aster*—all meet the Flame Emperor’s selection. Recording its immortals, the Pure Void Lord Pei, the White Ram Lord, Huang Chuping, and the Sixteen Perfected Ones—all are included. Even the Jade Emperor’s feasts here do not concern the mortal realm.\n\nAlas! The immortal traces and sacred vestiges of Mount Hua are now fully encompassed, nothing left unrecorded.\n\nHerein lie but seventy-odd essays, entrusted to craftsmen for carving onto woodblocks, that their circulation may be wide—how could this be deemed a trifling contribution? Once completed, I was entreated to compose a preface to crown the work. Though I demurred, I also rejoiced, saying: My talent is meager as the clouds of Qi, too weak to wield the thousand-jūn brush. Yet I delight to see that your aspiration is mine as well—I too long to enter the famed mountains and concoct the divine elixir, though the path remains unclear. Now that you have accomplished this, you have fulfilled my own desire.\n\nIn truth, to enter the famed mountains and concoct the divine elixir, one must have a foundation. As the *Book* states: The shaman invokes spirits, and spirits must attend; the image is set, and the deity must preside. How much more so for refining immortal medicines within the sacred peaks—would the mountain’s true spirits not protect me? The elixir’s completion may be awaited at once.\n\nYet do not assume the azure heavens are empty, that the white dragon will descend to bear you away, that one morning you will ascend to the Dark Continent, meet the assembled immortals, soar through the Purple Empyrean, pay homage to the Great Unity, listen to the Music of the Spheres, feast on the Nine-Fold Fungus, and wander without losing sight of other paths. There are the hidden words of the heavens, the numinous chapters of the Void—let us pledge to pursue these together on another day.\n\nWritten in the twelfth month, the *ren-shen* day of the *gui-mao* year of the Dading era, by Liu Dayong of Niyang.\n\n**Preface by Emperor Xuanzong of Tang**\n\nHeaven has its four seasons, with the stars and constellations marking their positions; earth has its five directions, with mountains and peaks anchoring their domains. When yin and yang harmonize, the forms of things take shape; when the two essences of *qi* intersect, the divine and luminous manifest.\n\nThe Western Peak, Mount Taihua, governs when *shaoyin* holds sway, when all things bloom—hence its name, Huashan. Seated in the west of the Central Land, it occupies the seventh palace’s true position, thus called the Western Marchmount. Consulting the maps, one sees its sheer, four-sided form—undeniable; measuring its height with a gnomon, one finds it towers five thousand *ren*—unmistakable. Its stone walls rise in majestic splendor, its might unyielding; the surrounding mountains rush forth in homage. Its *qi* is solemn, its presence awe-inspiring; its nature aligns with metal, its celestial hour corresponds to *you*. Before it lies Huayang Valley; behind, it presses upon Huayin Prefecture. To its left, it cradles the Peach Grove Barrier; to its right, it yields the jades of Lantian. Below lie the golden tripods and stone chambers of adepts and perfected beings; above dwell the Bright Star Jade Maiden, the immortal herbs, and the nectar of jade.\n\n*The Record of Mount Hua*\nCompiled by Wang Chuyi, the Recluse of Lotus Peak\n\n*The Huazhou Illustrated Classic* records in *The Annals of the Zhaowen Pavilion*: The Lotus Flower Peak comprises three summits, their heights touching the Three Luminaries. Within it lie twenty-eight stone pools, corresponding to the Twenty-Eight Constellations. Green pines and verdant bamboo thrive upon the lofty ridges; clouds and mist gather in swirling embrace about the secluded hills. Here, a trove of gold and jade lies concealed, harboring the winds and thunder—this is the Great Emperor’s detached palace, the very grotto-dwelling of immortals and transcendents.\n\n*The Gazetteer of Regions* states: Mount Hua stands within the bounds of Huayin County, Huazhou. Huazhou, according to *The Tribute of Yu*, falls under the celestial division of Yongzhou. In the reign of King Xuan of Zhou, his younger brother You was enfeoffed at Xianlin, establishing the state of Zheng. By the eleventh year of Duke Wu of Qin, Zheng was made a county. Later, the First Emperor of Qin divided the realm into thirty-six commanderies, placing Zheng under the jurisdiction of the Neishi. The Han dynasty assigned Zheng to the capital district of Jingzhao. The Western Wei established Huazhou. Through the Sui, it remained part of Jingzhao, until the first year of Emperor Gong’s Yining era, when it was formally designated Huazhou. In the second year of Empress Wu Zetian’s Chuigong reign, it was renamed Taizhou. During Emperor Zhongzong’s Shenlong era, it reverted to Huazhou. In the first year of Emperor Suzong’s Shangyuan reign, it was renamed ZhenGuo Army, only to be called Taizhou again in the second year. In the first year of the Baoying era, it reverted once more to Huazhou. In the fourth year of Emperor Zhaozong’s Qianyou reign, it became Xingde Prefecture. In the second year of the Guanghua era, it was restored to Huazhou. The Song renamed it ZhenTong Army, and Huayin was accordingly named Huayin County. Later, it was variously called Taihua County, Jinyin County, Ningtai County, and Xianzhang County.\n\n**Lotus Flower Peak**\nAscending forty *li*, it stands solitary at five thousand *ren*. At its summit lie the detached chambers of the Bright Star Jade Maiden, the central shrine of the Golden Heavenly King, the Twenty-Eight Constellation Pools, Black Dragon Pond, the Jade Maiden’s Hair-Washing Basin, Sweet Flag Pool, Sky-Gazing Pool, Eight Trigrams Pool, Great Unity Pool, and the Supreme Spring. Nearby is the Jade Well, where thousand-petaled white lotuses bloom; those who partake are said to ascend as immortals. An ancient poem reads:\n*At the peak of Great Hua, the jade-well lotus,*\n*Ten fathoms wide its blooms, its roots like boats.*\n*Fair as frost and snow, sweet as honey,*\n*A single petal in the mouth cures all ills.*\n*I long to seek it, undeterred by distance,*\n*Yet the azure cliffs offer no path to cling.*\n*If only a ladder stretched to pluck its fruit,*\n*To plant its seeds in the seven marshes, roots entwined.*\n\n**Supreme Mountain**\n**Laozi’s Grotto**\n**Supreme Spring**\n**Sweet Flag Pool**\n**Laozi’s Alchemical Furnace**\nWhen Laozi witnessed the decline of Zhou, he journeyed west beyond the Flowing Sands to the Hangu Pass. Yin Xi, the Pass Keeper, divined from the black aura that a true sage would soon pass, and indeed, he encountered Laozi. Recognizing Yin Xi’s extraordinary nature, Laozi composed for him the two-part *Book of Dao and Virtue*, then retreated into seclusion on Mount Hua. *The Annals of the Zhaowen Pavilion* states: Lotus Flower Peak is also called Supreme Mountain. Its four faces are sheer-cut, rising five thousand *ren*. Encircling ridges converge, three peaks thrusting skyward, their summit spanning ten *li*, where neither bird nor beast dwells. On the southeastern spur of its summit lies Laozi’s Grotto; to the north, the Supreme Spring. Beside the spring is Laozi’s Sweet Flag Pool, where the sweet flag’s leaves are as slender as a sword’s spine, its roots bearing nine nodes per inch. Consuming it strengthens the body, prolonging life and enhancing vitality. On the northeastern spur of Canglong Ridge stands Laozi’s Alchemical Furnace. At Xixin Flat, on the southwestern corner of the mountain’s summit, a plot of three to four *mu* is entirely overgrown with *Asarum*, whose consumption imparts a fragrant aroma to the body, perceptible a hundred paces away. Ancient records describe a plant resembling silk or cloth—what is now called \"Western Peak Cloth.\"\n\n**Purple Mulberry**\nAtop the northeastern spur of the mountain’s summit grows the Purple Mulberry. Its leaves exude a jade-like dew; when collected in an oil-silk pouch on the fifth day of the fifth month, those who consume it may become earthbound immortals.\n\n**Five-Seed Pine**\nAtop the southwestern spur of the mountain’s summit stands the Five-Seed Pine, its canopy flat as an overturned parasol. From it hangs green vine a hundred feet long, beneath which grows *fuling* in human form. At times, amber crystallizes, glowing at night like a lotus, by day like an ox’s eye. Those who consume it ascend to distant realms, and its resin may be used to write at night.\n\n**Bright Star Jade Maiden, Jade Maiden’s Stone Horse, Jade Maiden’s Hair-Washing Basin**\nThe shrine of the Bright Star Jade Maiden stands upon the tortoise-shaped back of the central peak’s summit. Within the shrine’s hall is a stone chamber housing a sacred statue of the Jade Maiden and a stone horse, whose divine nature is extraordinary—its neighing and stamping are heard at night. Hermits dwelling on the summit often witness these marvels. Before the shrine lie five stone mortars, each filled with water, known as the Jade Maiden’s Hair-Washing Basins. Their waters are jade-green and limpid, never depleting in drought nor overflowing in rain.\n\n*The Scripture of Divine Mists* states: The Bright Star Jade Maiden holds jade nectar; those who partake attain transcendence.\n\n**Jade Maiden’s Window**\nThe Jade Maiden’s Window lies on the southern spur of the Cloud Terrace Peak. Above it is a stone gate; entering a *zhang* or so, one ascends to a stone recess like a window, through which the detached chambers of the Bright Star Jade Maiden on the southern peak may be glimpsed.\n\n**Stone Tortoise Steps**\nThe shrine of the Stone Tortoise Jade Maiden rests upon a rock resembling a tortoise. From east to west, it spans eight or nine paces; from north to south, over twenty *zhang*. Its two ends rise sheer, its form like a tortoise. Before it lie stone steps, cracked as if split, about five inches wide, their depth unfathomable. When objects are cast within, the sound from below lingers for the time it takes to eat a meal—this is the ancient site where memorials were presented to the mountain’s abode.\n\n**Black Dragon Pond**\nBlack Dragon Pond lies on the southern spur of the summit, where the Sky-Gazing Pool and Black Dragon Pond are found. In times of drought, prayers for rain are invariably answered. In the second year of the Chongning era of the Song, the dragon was enfeoffed as Marquis Xianrun of Manifest Moisture.\n\n**Cavern of Mystery Stone Chamber**\nThe Cavern of Mystery Stone Chamber of the Western Peak stands upon the northwestern spur of the summit, its four sides sheer.\n\nLong ago, the Perfected Master of Pure Emptiness, Lord Pei, entered this chamber to cultivate the Dao with single-minded devotion. After twenty-three years of practice, he was visited by the abode of the Five Numinous Elders of the Mysterious. The stone chamber has two doors, one to the east and one to the west. The entrance is barely wide enough for a person to pass, but once inside, the chamber expands to five or six *zhang* in circumference. The eastern door opens onto the clouds and mist, while the western door overlooks the earth below. Within stands a stone statue, three *chi* tall, wearing a crown of the Three Luminaries and the Embracing Dawn. Its stone robes bear patterns like those of nine-colored brocade, and the statue is adorned with many ancient coins—some with one head and many legs, others with a single hole and one side inscribed with the characters \"Great Cloth\" in large seal script.\n\n**Counting Field and Reed-Flower Pool**\nThe Counting Field lies atop the summit. During the Later Wei, the Daoist Master Kou Qianzhi, well-versed in the armillary sphere and particularly skilled in celestial portents, once calculated the Heavenly Origin and Five Eras. His calculations contained errors, but later, the Perfected Master Cheng Gongxing arrived in feigned madness, posing as a merchant. He waited for Kou to cast his counting rods, and only then did the calculations align. Kou, filled with remorse, withdrew to the mountains and forests, following the Perfected Master and abandoning his remaining calculations. The counting rods transformed into water caltrops and reeds—hence the name Reed-Flower Pool.\n\n**Twilight Stone**\nThe Twilight Stone stands atop the summit’s southeastern spur, upon a solitary peak.\n\nFrom afar, a stone appears square as a well-side couch, truly resembling a *go* board at dusk.\n\nDuring the reign of Emperor Wu of Han, a figure suddenly appeared before him—clad in feathered robes and a star-crowned cap, riding a cloud chariot drawn by a white deer, descending from the heavens. The emperor, startled, asked who he was. The figure replied, \"I am Wei Shuqing of the mountains.\" The emperor said, \"If you are a man of these mountains, then you are my subject.\" Suddenly, Shuqing vanished. The emperor, filled with regret, immediately dispatched his envoy Liang Bo to the mountains to search for Shuqing, but he was nowhere to be found. Only his son, named Du Shi, was located. The emperor asked, \"Where is your father?\" Du Shi replied, \"My father, from youth, favored the Dao of immortals. He abandoned his family and entered Mount Hua over forty years ago.\" The emperor then sent Liang Bo and Du Shi to seek him at the summit of Mount Hua. There, they glimpsed his father playing *bo* with several immortals upon the stone, enveloped in thick purple mist. Several youths bearing banners and staffs stood behind them. Du Shi and the others prostrated themselves in reverence from afar. Shuqing asked, \"Why have you come?\" Du Shi said, \"The emperor regrets that the other day, in haste, he failed to speak with you.\" Shuqing replied, \"Previously, I was sent by the Supreme Lord to admonish the emperor for his reckless extravagance. Yet the emperor, arrogant and self-important, sought to make me his subject. He is unworthy of speech—that is why I left.\" He then sternly warned Du Shi, \"Beware of becoming a Han minister, and do not speak of this to the emperor.\" Liang Bo and Du Shi then bowed in farewell and returned. This account appears in *The Biographies of the Immortals*.\n\n**Stone Immortal**\n**Waterfall**\n**Stone Immortal Cave**\n**Zhaoyang Cave**\n**Zhengyang Cave**\n**Xixuan Cave**\n**Water Curtain Cave**\n\nThe Stone Immortal lies midway up the northern face of the mountain. *The Hidden Instructions for Ascending to Perfection* states: \"The mountain’s cavern extends three hundred *li* deep, within which are jade terraces and chambers. Its trees are fragrant grasses and lush groves; its azure springs flow with stone marrow and golden essence. From afar, the cavern appears roughly a *zhang* in circumference. A bird’s path cuts off all passage, and few human traces reach it. At times, clouds of strange hues emerge. At the cavern’s mouth rests cinnabar stone, while nearby green stone resembles an immortal painted in ink and cinnabar—crown, robes, and garments all perfectly rendered, its height and proportions like those of a human. Thus, it is called the Stone Immortal. Above it hangs a waterfall, cascading straight down over three thousand *zhang*. The Stone Immortal Cave is also known as the Water Curtain Cave. The mountain possesses four caves: to the east, Zhaoyang; to the west, Xixuan; to the south, Zhengyang; and to the north, Water Curtain.\"\n\n**Crab’s Abandoned Cave**\nThe Crab’s Abandoned Cave lies on the northwestern peak of the summit. *The Classic of Mountains and Seas* records: \"On Mount Hua dwells a beast with wings, six legs, and the body of a serpent. When it emerges, the world suffers great drought.\"\n\n**Giant’s Palm and the Stone Moon**\n\nThe Giant’s Left Palm features a half-wheel Stone Moon atop the northeastern peak. *The Diagram of Hidden Mechanisms for Mountain Opening* states: \"The Giant attained the Dao of Primordial Mystery and was born simultaneously with primordial *qi*, serving as the master of the Nine Ancestors of Chaos.\"\n\nEmperor Wu of Han once observed the Immortal’s Palm within the county and specially established a shrine to the Giant Spirit there.\n\n**Marvels of Mount Hua**\n\nThe summit of Mount Hua is a place where celestial perfected beings descend and immortals gather, with countless manifestations of divine presence. Here are but a few examples:\n\nAt times, one first detects an extraordinary fragrance, then beholds auspicious mists. Sometimes, a thousand chariots and ten thousand riders appear; at others, jade maidens and golden lads, or hundreds of youths with double topknots. One may see a thousand feather-robed Daoists in *yu* meditation, or pearl-canopied golden parasols, or crimson staffs and rainbow banners. Some witness riders on dragons or tigers, or visitors astride phoenixes and simurghs. At times, golden light fills the earth; at others, flames stretch to the heavens, or purple haze soars into the sky, or propitious clouds blanket the summit. The tolling of golden bells may also be heard.\n\nThese apparitions vary in form and location—sometimes on the highest peak, sometimes atop the Immortal’s Palm Peak, or gathering on Three Ministers Mountain, or assembling at the Western Mystery Cave.\n\nIn former times, the Perfected Master of Pure Emptiness, Lord Pei, secluded himself on the northwestern peak. Once, the Five Numinous Mysterious Elders of the Central Direction descended upon the Great Luo Peak. The Queen Mother of the West appeared several times, now clad in yellow robes, wearing a golden crown, riding a jeweled carriage drawn by nine multicolored, spotted dragons. Above her was a feathered canopy, flanked by golden lads, jade maidens, immortals, and celestial officials—numberless in their ranks. Later, a shrine was built at the site of her manifestation.\n\nDuring the Zhenguan era of the Tang, a Temple of the Queen Mother was constructed at the mountain’s base. To the west of Mount Hua lies a mountain called Luofu, where in the fifth year of the Dali era, the Three Officials of Heaven, Earth, and Water descended. Their visitation moved Emperor Daizong in a dream, prompting him to order the construction of the Three Officials’ Abbey. By the Xianping era, it was renamed the Temple of Heaven’s Mandate.\n\n**Divine Grove**\n\nUpon Mount Hua—whether on its slopes, within its valleys, or along the paths near its temples—all trees, whether living or dead, are called the Divine Grove. Their felling is forbidden, and those who violate this prohibition bring calamity upon themselves.\n\nOn the southwestern side of the mountain stands a grove of towering pines and cypresses, where the Mountain Spirit holds feasts. It is named the Black Mountain Grove. Those who secretly cut its trees have perished in fires or been devoured by tigers in great numbers.\n\n**Imperial Path**\n\nThe Imperial Path lies north of the Immortal’s Palm Peak and serves as the route to ascend the mountain. Emperors Wu of Han and Xuanzong of Tang once traveled this way, hence its name. Today, stone mortars remain on either side, used in their time to anchor railings and drape brocade for protection against perilous drops.\n\nTo reach the peak, one must traverse the Imperial Path, cross the Azure Dragon, and pass the Cloud Terrace and Heavenly Well. The path descends steeply for a hundred *chi*. From the summit to the Green Branch Plateau spans twenty *li*, and from the Green Branch Plateau to the valley’s mouth, another twenty *li*.\n\n**Zhang Chao Valley**\n\nZhang Chao Valley is where Zhang Kai, styled Gongchao of the Later Han, built his hut. Scholars gathered there like a marketplace. He was also capable of summoning a five-*li* mist, earning the place the name \"Zhang Chao’s Misty Market.\" Each day, he would ride a donkey to the market and return in the evening, carrying a flask of wine.\n\n**Stone Ram City and Immortal Valley**\n\nStone Ram City lies west of Zhang Chao Valley, where the brothers Huang Chuping and Huang Chuqi attained immortality. The valley is thus named Immortal Valley.\n\nHuang Chuping, a native of Dan Creek, was sent by his family to herd sheep as a youth and did not return for a long time. His brother, Chuqi, searched for nearly forty years before hearing of a Daoist in the market who could divine fortunes with divine accuracy. Chuqi asked the Daoist, \"In the Great Flower Mountain, there is a shepherd boy named Huang Chuping. Is he your younger brother?\"\n\nChuqi bowed in gratitude and followed the Daoist into the valley, where he joyfully reunited with his brother. After their conversation, Chuqi asked, \"Where are your sheep now?\"\n\nChuping replied, \"They are just east of the mountain.\"\n\nChuqi went to look but saw only stones before returning.\n\nThe brothers then said, \"Let us both go together.\" Chuping then shouted at the stones, \"Sheep, arise!\" At once, all the white stones transformed into sheep—tens of thousands of them. Chuqi kowtowed and asked, \"My brother, you alone have attained immortality. May I also learn the Way?\"\n\nChuping replied, \"If you are resolute, it can be achieved.\" Chuqi then abandoned his wife and children, bowed to his brother as his master, and later, both ascended together as immortals. The place where the stones were commanded is spacious on all sides, resembling a fortress; it is now called Stone Sheep City.\n\n**Wenxian Valley**\nWenxian Valley was the secluded abode of the Perfected Lord Lü. When the Perfected Lord came here, he changed his surname to Ji and his given name to Dongming, with the Daoist name Baozhenzi. He dwelled beneath Huashan’s Lotus Peak, within Wenxian Valley, constructing a hut where he lived for forty years, unknown to others.\n\nOn the day before the Mid-Autumn Festival of the *bingzi* year of the Shaoxing reign, he said to his disciple Liu Yu, \"Elder Zhang and Mother Li have long awaited my ascent to the Mystery. I shall leave a verse:\n\n*Above, one mouth; below, one mouth.*\n*In the world, it is firm and true.*\n*Though it holds water, it does not leak.*\n\nHaving entrusted these words to Yu, he serenely departed this world.\n\nLiu Yu then concealed the remains in a stone chamber. Several years later, the Master’s spirit manifested at the pagoda in Sizhou, where he inscribed a poem:\n\n*A scholar from Jizhou, transformed on Three Peaks.*\n\nYears afterward, he appeared to Yu again, leaving another poem:\n\n*Once I dwelled here long ago,*\n*Forty springs concealed my name.*\n*How many wanderers pass through this red dust—*\n*Who among them knows this man?*\n\nYet another poem read:\n\n*For ten years I toiled at brush and ink,*\n*Ten thousand scrolls of verse and prose locked in my breast.*\n*Like duckweed or drifting clouds, I made my home in green,*\n*Dwelling on Lotus Peak, unknown to all.*\n\nLater signed by Master Hui.\n\nYu searched for the place where the body had been seated and found only an empty coffin, within which lay two interlocking *lü* characters. From this, people at last realized he was the Perfected Lord Lü. The Perfected Lord had attained the Dao during the reign of Emperor Taizong of Tang, and five hundred years had since passed.\n\nDuring the Yuanfeng era, a poem on the zither terrace read:\n\n*A rustic was I, a visitor from Tiantai,*\n*With a dwelling south of Stone Bridge.*\n*Father and son—just the two of us—*\n*When the son sang well, I clapped in delight.*\n\nAnother poem said:\n\n*A wanderer roaming the four seas,*\n*Two flasks of frost and snow—my spirit’s essence.*\n*When the trigram’s elements are gathered,*\n*Dragon-tiger elixir moves like flowing mercury.*\n\nHis stele still stands in Wenxian Valley, now called Feather Valley Hermitage.\n\n**Oxheart Valley**\nOxheart Valley was where Yang Zhen, in his early years, lived in seclusion, lecturing on the classics. Scholars gathered like a marketplace, and the valley was thick with locust trees, hence the name \"Yang Zhen’s Locust Market.\" Among its cliffs, multicolored auspicious birds often appeared. Snow blanketed the mountain, and within it, the sacred traces of the Heavenly King could be seen—only his form clad in silver armor, mounted on a white steed, was visible.\n\n**Yellow Spirit Valley**\nYellow Spirit Valley lies east of the mountain and was the secluded abode of the Perfected Yellow Reed Master. The Master, surnamed Ge and named Yue, was a native of Chu. He dwelled on this mountain, styling himself Lord of the Western Peak. Many came from a thousand *li* away seeking his healing, and those who sent only their names found their illnesses cured. He could restrain tigers and wolves so they dared not move, and birds dared not fly away.\n\nReceiving instruction from Red Pine Master, he surpassed eighty years yet could lift a thousand *jin* and run as swiftly as a galloping horse. During a great drought, he summoned the dragon from the deep pool, urging it to ascend to heaven, and heavy rain fell. One morning, he rode away on a yellow dragon.\n\n**Hidden Horse Valley**\nHidden Horse Valley lies east of the mountain. When Emperor Wu of Han sought immortals at the foot of Mount Hua, he built the Palace of Assembled Spirits, the Hall of Preserving Immortals, and the Gate of Gazing at Immortals. A divine horse emerged from Mount Hua, and the emperor ordered it kept in the imperial stables. The horse did not stay long, so men were sent to search for it. They found it in this mountain valley beneath a stone shelter, hence the names \"Hidden Horse\" and \"Valley of the Hidden Horse Shelter.\" In the northeastern ravine, hoofprints remain imprinted on the stone.\n\n**Maiden of Fur Peak**\nMaiden of Fur Peak stands west of the mountain. The Maiden, named Yujian, was a palace woman of Qin Shihuang. Witnessing the fall of the dynasty, she took up her zither and retreated to this peak on Mount Hua to live in seclusion. She ate pine seeds and leaves, drank from mountain springs, and her body grew green fur. The world named her the \"Maiden of Fur\" after the place where she was seen, and to this day, the sound of zither music lingers in the cave. A Daoist once beheld this grotto. Below the peak stands White Stone Temple, long since abandoned.\n\n**Cloud Terrace Peak**\nCloud Terrace Peak stands to the northeast of the mountain. Its two peaks rise sharply, sheer on all sides, crowned by radiant clouds above and rooted in earth’s veins below. Towering in solitary splendor, it resembles a celestial terrace. Beneath it lies a cavern. Long ago, a man entered this cave and emerged far away at Fangshan, having passed beneath the Yellow River’s bed, where he heard the sound of flowing water.\n\nDuring the reign of Emperor Wu of Zhou, the Daoist Jiao Daoguang dwelt alone on this peak. He abstained from grains, feeding only on mist and cloud essence. Three azure crows would foretell events yet to come. Emperor Wu personally visited the mountain court, leaning from his chamber to inquire of the Dao, and thus established Cloud Terrace Abbey at the valley’s mouth. Later, his disciples Hong Xian and others saw their master, Jiao Daoguang, ride away upon a creature like a qilin, never to return.\n\n**The Trial Chisel Cavern**\nOn the northern face of Cloud Terrace Peak’s northern summit lies the Trial Chisel Cavern, a hundred feet high and unfathomably deep. Beside it stands a stone as hard as iron, its size and shape as though freshly chiseled—this is the cavern where Master Xiyi shed his mortal form.\n\n**White Cloud Peak**\nWhite Cloud Peak rises to the northeast of the mountain. It was the place where Princess Jinxian, sister of Emperor Ming of Tang, cultivated the Dao, naming it White Cloud Abbey. The Eight Immortals Cave, Viewing Peak Pavilion, Upper Bamboo Garden, Lower Bamboo Garden, jujube trees, chestnut groves, flower gardens, medicinal plots, and stone mortars remain there to this day. Beside White Dew Cliff lies the stone cavern of the Perfected Jiao.\n\n**White Ram Peak**\nWhite Ram Peak stands five *li* northwest of the mountain. Its layered cliffs gleam bright, its grottoes vast and misty. On the three Primes, the eight festivals, and all fasting days, divine lamps—sometimes three, sometimes five—appear upon the rock walls. Once, a recluse dwelt upon this peak, his name and surname unknown. He often rode a white ram through the mortal world. Later, he and his disciple Jie Dan ascended together as immortals, and so he was called the Perfected of the White Ram. The Perfected left behind his *Prohibitions of the Mountain* and seventy talismans for subduing tigers, leopards, wolves, and bears, which circulate in the world.\n\n**Pine and Cypress Peak, Dawn Peak, Jade Pillar Peak, Jade Beauty Peak**\nThese four peaks are covered entirely in verdant pines and cypresses, perpetually veiled in clouds of strange hues. Their emerald summits rise in solitary grandeur, seldom trodden by human feet.\n\n**Cavern of Master Jiao**\nThe Cavern of Master Jiao lies to the southeast of the mountain. The Perfected was surnamed Jiao, styled Xiaolong, a native of Hebei. He often consumed white stones, sometimes sharing them with guests, their taste like taro. Once, a wildfire burned his hermitage. When people from neighboring peaks came to see, they found the master seated calmly amid the flames. Though the hut was reduced to ashes, he rose unhurriedly, his robes untouched by scorching. Years later, when a great snow fell, he vanished. Suddenly, he appeared beyond the snow, clad in a single unlined garment, his complexion radiant as though it were summer. Some saw him as old, others as young—even now, some claim to encounter him.\n\n**Divine Soil Cliff, Immortal Oil Slope, Evasion of Summons Cliff**\nDivine Soil Cliff lies a hundred paces southeast of Cloud Terrace. When Jiao Daoguang concentrated his thoughts to build halls and corridors, divine soil welled forth from the stone. Though used without end, it ever renewed itself—so it remains today.\n\nImmortal Oil Slope lies within the cliff face of Cloud Terrace Peak. Whenever Jiao Daoguang held vegetarian feasts or Daoist rites, oil descended from heaven upon this slope. After he rode the qilin away, the oil was seen no more.\n\nEvasion of Summons Cliff lies southwest of Mount Hua. Here, recluses and fugitives of old concealed themselves to evade imperial decrees.\n\n**White Deer Shelter**\nWhite Deer Shelter stands to the east of the mountain, on the right of the path ascending the peak. It was established by the immortal Lu Nüsheng. A flying spring drips within the shelter.\n\nLu Nüsheng was an ancient immortal of Mount Hua who attained the Dao. She dwelt upon the mountain for two hundred years, her whereabouts unknown. Then, one day, she appeared before the mountain shrine, riding a white deer, accompanied by ten jade maidens. She bade farewell to the people and departed.\n\n**Grotto of the Supreme Ultimate and All Immortals**\nThe Grotto of the Supreme Ultimate and All Immortals lies within the western cliff of Maiden of Fur Peak. Floating above is the cavern called the Grotto of the Supreme Ultimate and All Immortals, and below it lies Carriage Box Pool.\n\n**Three Caverns of Wang and Diao**\nThe Three Caverns of Wang and Diao lie to the east of the mountain. The immortal Wang Yao, styled Boliao, was a native of Poyang. Though married, he had no children. He was skilled in healing, curing all ailments without rituals, talismans, acupuncture, or medicine. When malevolent spirits caused mischief, he would draw a prison on the ground, strike a stone, and summon them—foxes, weasels, and serpents would appear, and he would slay and burn them.\n\nThe Perfected Wang had a bamboo basket, which his disciple Qian Ge carried with a nine-jointed bamboo staff for over a decade, never once seeing it opened. When he encountered Daoist adepts, he remained unassuming, and at night, torches would light his way. Later, he came to this cavern, where he found his friend Diao Ziran. Wang opened the bamboo basket and took out three five-tongued bamboo flutes. The three played together, and when Wang Yao departed, Diao Ziran said, “You should return soon. Do not linger long in the mortal world. We shall meet again in this cavern.” Later, Wang, Diao, and Qian Ge all ascended as immortals.\n\nThe upper cavern remains inaccessible. The middle cavern is barred by a flying stone at its entrance. The lower cavern is where recluses dwell.\n\n**Azure Cloud Cavern and Azure Cloud Stream**\nAzure Cloud Cavern and Azure Cloud Stream lie to the east of the mountain. They were the secluded abodes of four lofty recluses: Zheng Ao, Luo Yinzhi, Zhai Shiduan, and Zheng Yin.\n\nZheng Ao, styled Yun Sou, was a native of Southern Yan. Of unyielding integrity, he abandoned his wife and children. Hearing that the five-needled pines of Mount Hua, with their resin like congealed fat, could extend life and reverse aging, he came to this cavern to dwell in seclusion. During the Tiancheng era, when summoned to court as Reminder, he refused to rise, and was granted the title Master Carefree.\n\nLuo Yinzhi was a Daoist of Jade Beam Abbey on Jade Bamboo Mountain in Xingan County, Linjiang Prefecture. He came to dwell on Mount Hua, sometimes by the water, sometimes upon the peaks, drinking wine and composing poetry, his lofty spirit at ease. During the Tianfu era, he was granted the title Master Xiyi.\n\nZhai Shiduan, styled Biaozheng, was a native of Qi. Well-versed in the Nine Classics, during the Xiangfu era, when Emperor Zhenzong visited Fenyin, he was summoned to court but did not rise. Without illness, he passed away; seven days later, his limbs remained warm. When cremated, a sound like thunder erupted, and a five-colored radiance blazed forth.\n\nZheng Yin, styled Mingchu, was a native of Fengfu in Dui. Upon his left arm was a black mole shaped like the Northern Dipper. He dwelled at the mouth of Wang Diao’s Three Caverns, never emerging from winter into spring, and people marveled at him. During the Xiangfu era, when Emperor Zhenzong offered sacrifices to the Earth Goddess and halted at the post station, an imperial edict was issued at the temporary palace, granting him the title Master Zhenhui. The emperor also bestowed upon him *The Return-to-the-Mountain Writ*, among the recluses of the Five Peaks. He often played the zither and raised his cup to suit his mood, reciting:\n\n> By flowing streams I watch the water’s hue,\n> At times I lean in stillness, listening to the pines.\n> Through ten thousand ravines I wander, a joyful recluse,\n> Amid a thousand peaks I dine, in perfect peace.\n>\n> I discourse on the subtle, delve into the profound,\n> Nourishing my heart, I am called the Boundless.\n> I leave the palace gates, return to mountain and forest,\n> Rejoicing in your will—how deep your resolve!\n>\n> I scorn the fleeting splendor, cherish purity’s tone,\n> With song and whistle, my carefree heart expands.\n\n**Hugong’s Stone Chamber**\nHugong’s Stone Chamber stands atop a solitary peak in the northwest of the mountain, with a cavern large enough for over ten people and a spring within. To the northeast lies Wushi Valley, where the Eastern Valley holds the former grounds of the Northern Wei Daoist Kou Qianzhi, and the Western Valley contains the pierced stone couch of Master Xiuyang.\n\nHugong’s name and origins were unknown. He often suspended an empty gourd above his seat, and after sunset, he would leap into it. Fei Zhangfang studied under him and was made to dwell in this stone chamber. There was a square stone over a *zhang* wide; Hugong struck it with a straw rope and hung it in midair, then had Zhangfang sit beneath the outer stone while serpents and insects swarmed to gnaw at the rope. Though the rope nearly snapped, Zhangfang remained unperturbed, showing no fear. Hugong sighed in admiration: \"You are teachable.\" He bestowed upon him the title Earthly Overseer and bade him ride a bamboo staff home. Later, upon reaching Ge Marsh, Zhangfang cast the staff into the water, where it transformed into a dragon and departed. He gained the power to command ghosts and spirits.\n\n**The Three Lords’ Mountain Stone Chamber**\nThe Three Lords’ Mountain lies to the southeast of the peak, its three towering summits each distinct, resembling the Three Terraces. Thus, it is called the Three Lords. Yan Ji, styled Ziwei, lived during the reign of Emperor Ming of Han. He dwelled in this stone chamber, consuming pine resin and yellow essence, his hair always unbound, save for a silk kerchief worn only on the first day of the month and festival days. At times, he played the zither and chanted poetry, and yellow and white clouds often shrouded him. Later, he bid farewell to his friends and departed upon a cloud.\n\n**Changchun Stone Chamber**\nThe Changchun Stone Chamber lies beside Cloud Terrace Mountain. During the Zhenguan era of the Great Tang, the Daoist Du Huaiqian resided here. He abstained from grain and never ate, delighting in playing the long flute. He had many flutes purchased, and after playing each to its end, he would cast it into the ravine below. When his flutes were exhausted, more would be supplied from the ravine, and for months he remained unmoved. He styled himself Master Changchun. Today, the stone chamber still stands, and the sound of flutes lingers unceasingly.\n\n**Master Xiuyang’s Stone Couch**\nThe stone couch lies within the Immortal’s Valley to the northwest of the mountain. In the stone chamber was a stone couch, upon which Master Xiuyang often lay, wearing it through. He never ate, and when Emperor Jing of Han asked, \"What skills do you possess?\" he did not answer but transformed into a stone sheep. Upon its back were inscribed the words: *Master Xiuyang thanks the Son of Heaven.* Later, the stone sheep was placed in the Tongling Terrace, but it vanished, its whereabouts unknown.\n\n**Outer Immortal’s Flat**\nOuter Immortal’s Flat lies within Zhang Chao Valley. There is a stone chamber where the True Man Zhang Chao shed his mortal form. As woodcutters and herders played nearby, a flying stone descended from the sky to seal the entrance. Today, it is known only as Outer Immortal’s Flat.\n\n**Herb-Planting Flat**\nHerb-Planting Flat was where the True Man Wang Hui often consumed pine resin and yellow essence. He possessed the art of commanding tigers and leopards, and whenever he planted yellow essence, he would harness them to plow and weed. He often rode tigers and leopards, guiding them with bamboo reins and a staff, his authority like that of a man riding a mule or horse. He frequently chanted a nine-character poem of over a hundred lines, the meaning of which no one could fathom. Later, he ascended to heaven and was seen no more.\n\n**Liquor Spring and Jade Spring**\nLiquor Spring lies directly below the Ancient Hermitage. Its waters bear a faint fragrance and mellow taste of wine, a national auspice that has repeatedly summoned phoenixes to drink. Beside it stands the shrine of the Jade Maiden. Jade Spring is situated at the mouth of Zhang Chao Valley; its waters are the color of cream, and thus the Jade Spring Abbey was established. Both springs brim with the essence of jade marrow, and those who drink them for long may cure deep-seated illnesses.\n\n**Yellow Dragon Pool**\nYellow Dragon Pool lies at the mouth of Divine Valley. When prayers for rain are answered, the spirit is enfeoffed as the Marquis of Abundant Moisture.\n\n**Chariot Box Pool**\nChariot Box Pool lies ten *li* within Immortal Valley, directly below the Cave of the Supreme Polarity and Assembly of Immortals. During the *Mingdao* era of Emperor Renzong of Song, the imperial court dispatched envoys each year to cast golden dragons and jade tablets into its depths. In the second year of *Chongning* under Emperor Huizong of Song, it was granted the title of Marquis of Bountiful Moisture by imperial decree. According to the *Record of the Water Palaces*, of the eighteen water palaces under heaven, Mount Hua’s Chariot Box Pool ranks as the seventh. It shares with the East Sea, South Sea, and Wen River the honor of receiving golden dragon tablets.\n\n**Crane-Chariot Pavilion**\nCrane-Chariot Pavilion stands halfway up the Central Peak, where the Golden Immortal Princess attained the Dao and ascended to heaven riding a crane.\n\n**Divine Maiden Grove**\nDivine Maiden Grove lies within Yellow Spirit Valley. To its east stands the Solitary Seated Maiden Shrine. The grove’s trees, numbering tens of thousands of pines and cypresses, form a dense canopy, and felling or gathering is forbidden.\n\n**Ancient Wutong Avenue**\nIn the ninth year of *Taikang* under the Jin, Prefect Wei Junshi journeyed to the ancient shrine of the Western Peak. Along the path, wutong trees were planted in such numbers that none could count them. Beacon towers lined both sides, marked with characters from the *Thousand-Character Classic*, and grazing or gathering was prohibited.\n\n**Tree of No Sorrow**\nThe Tree of No Sorrow stands beside the hermitage of Master Chen Tuan. The master, surnamed Chen and named Bo, styled himself Tunan, with the Daoist name Master Fuyao, was a native of Zhenyuan in Bozhou. During the *Changxing* era of the Tang, he sat for the imperial examinations but failed. Thereafter, he roamed mountains and rivers at will. Later, he came to the ancient site of Cloud Terrace Abbey on Mount Hua, cleared the brambles, and made his dwelling there.\n\nHe foretold fortunes and misfortunes with such precision that they matched as if tallying tokens. Later, Emperor Chai Shizong of the Later Zhou summoned him to court, detaining him within the palace for over a month. He was appointed Remonstrance Grand Master but firmly declined the post, and was bestowed the title Master of White Clouds. When Emperor Taizong of the Song issued his summons, Master Chen finally answered, donning a Huayang cap, straw sandals with dangling ribbons. He was received in the Yan Ying Hall with the courtesy due a distinguished guest, granted a seat, and engaged in prolonged conversation. The emperor then conferred upon him the title Master of Rare Serenity. His works, including *The Pointer of the Mysterious*, *The Fishing Pond Collection*, *Poems Crossing the Sea of Suffering*, *The Alchemical Formula for Entering the Chamber and Returning to the Elixir*, and *Parables of the Three Peaks*, circulated in the world.\n\n**Upper Palace:** White Cloud Abbey\n**Middle Palace:** Supreme Clarity Abbey\n**Lower Palace:** Cloud Terrace Abbey (now the present-day abbey)\n**Western Peak Perfected Lord’s Hall**\n**Mount Hua Abbey**\n**Deer Enclosure Abbey**\n**Polaris-Welcoming Abbey**\n**Taiping Xingguo Abbey**\n**Queen Mother Abbey**\n**Immortal Palace Abbey**\n**Resting Root Cloister**\n**Spirit Shrine of the Ministerial Divinity**\n**Orchid-Stone Cloister**\n\nThe Upper, Middle, and Lower Palaces were all established by the Daoist adept Jiao Daoguang. During the *Tianbao* era of Emperor Xuanzong of the Tang, the Right Rectifier of Omissions and Academician of the Jixian Institute, Wei Bao, was commissioned to compose *Records of the Three Palaces’ Restoration*.\n\nThe Western Peak Perfected Lord’s Temple was renamed Chongning Wanshou Abbey during the *Chongning* era, then Baoxiao Guangxiao Abbey in the *Shaoxing* era, and later Yingxiang Abbey in the *Fuchang* era. Formerly, Minister Sima Guang memorialized the throne to establish Perfected Lords of the Five Peaks across the realm, bestowing upon them golden tablets to eternally guard the grotto-heavens and blessed lands.\n\nMount Hua Abbey was constructed by Emperor Wu of the Han. Later, during the *Xiangfu* era, it was revived in honor of the Four Eminent Recluses. Deer Enclosure Abbey originally stood west of Bamboo Valley Ridge but was relocated to the foot of Mount Hua during the *Daguan* era at the request of the Daoist Qiu Run. Polaris-Welcoming Abbey was built at the foot of the mountain during the *Xuanhe* era. Taiping Xingguo Abbey, originally within Pass Valley, was relocated to the foot of Mount Hua during the *Shaoxing* era at the request of the Daoist Jiao Xu. Queen Mother Abbey once stood beneath Great Luo Peak, with an ancient shrine, and was later reconstructed at the foot of Mount Hua during the *Zhenguan* era of the Tang. Immortal Palace Abbey was the residence of Princess Jinxian; after she ascended on a crane, it was repurposed as Immortal Palace Abbey. Resting Root Cloister, located within the Xiangxing district, was established during the *Taiping Xingguo* era when Emperor Taizong summoned the Daoist Resting Root to court, bestowing upon him a complete canon of scriptures and a poem upon his return to the mountain. He was granted the title Great Master of Serene Crags. His *Three Hundred Poems of Resting Root* circulated widely in the world. Orchid-Stone Cloister had long fallen into ruin, leaving only the Shrine of the Giant Spirit, originally constructed by Emperor Wu of the Han.\n\n**Altar of the Mountain Worship**\nThe Altar of the Mountain Worship was the site where Emperor Wu of the Han performed sacrifices. During the reign of Emperor Taizong of the Tang, it was renovated into the Zhenyue Yiling Xian Temple, later known as Sheng Hui Cloister or Zhaoqing Temple.\n\n**Proclamation of Blessings Pavilion**\nThe Proclamation of Blessings Pavilion, where Emperor Zhenzong of the Song worshipped at the mountain altar, stood beside the Taihua Post Station. On the twentieth day of the seventh month in the fourth year of the *Tianxi* era, Emperor Zhenzong performed the rites here and bestowed the name Proclamation of Blessings Pavilion. An imperial stele was erected, its base carved with dragons, and the site was once designated forbidden ground.\n\n**Plain Spirit Abbey**\nAccording to the *Extensive Records of the Taiping Era* in the *Biography of Ma Zhou*: On Mount Hua stood the Plain Spirit Abbey, home to an Immortal King who governed all grotto-heavens, the Ten Continents, and the Three Islands, as well as the divine foxes.\n\n**Grotto-Heaven of Ultimate Perfection**\nAccording to the *Records of the Ten Great Grotto-Heavens*: The first is the Minor Grotto of Mount Wangwu, spanning ten thousand *li* in circumference. As Du Fu’s poem states: *\"Vines span ten thousand *li* to the Chouchi Cavern, / Secretly connecting the Minor Heaven.\"* The fourth is the Western Mystery Grotto of Mount Hua, spanning three thousand *li* in circumference, named the Grotto-Heaven of Ultimate Perfection. Within this grotto, the heavens and earth are vast, with sun, moon, stars, wind, clouds, grasses, and trees no different from the external world—save that the sun and moon pause their wheels, their radiance brilliant, directly illuminating the firmament, creating a realm of eternal spring. Palaces and towers are all fashioned from the seven treasures of gold and jade, surrounded by purple groves and fragrant blossoms, with jade sap and golden stalks, all scenes of the grotto-heaven. The Perfected Plain Spirit composed a hymn for the Grotto-Heaven of Ultimate Perfection:\n\n*\"Exotic fruits and wondrous flowers defy all names; / Why seek the Perfected in Penglai’s isles? / Azure clouds array the heavens within the grotto, / White jade towers rise beyond all semblance. / Myriad ravines of orchids and irises coil through sheer cliffs, / A thousand peaks of mist and haze soar in towering splendor. / The Eight Immortals once divided golden elixirs here, / And after consuming them, the whole family ascended to Supreme Clarity.\"*\n\n**Grotto-Heaven of the Assembly of Immortals**\nAccording to the *Records of the Thirty-Six Lesser Grotto-Heavens*: The first is the Grotto of Mount Huo, spanning three thousand *li* in circumference, named the Grotto-Heaven of Huolin. The second is the Grotto of Mount Tai, spanning three thousand *li* in circumference, named the Grotto-Heaven of Pengxuan. The third is the Grotto of Mount Hua, spanning three hundred *li* in circumference, named the Grotto-Heaven of the Assembly of Immortals. The Perfected Plain Spirit praised it thus:\n\n*\"A fallen stone became an immortal, named the Seven Stars; / Five gates align with sun and moon along the mysterious path. / Clouds soar and rains scatter, vanishing into the heavens, / Yet still they govern the peaks and ridges, birthing wondrous names.\"*\n\n**The Enfeoffment of Mount Hua’s Deity as the August Emperor of Golden Heaven**\nThe *Register of the August Emperor of Golden Heaven, the Compliantly Sacred*: The deity of Mount Hua commands clouds and summons rain, and among the western peaks, none is more revered. The Yellow Emperor of Xuanyuan journeyed here to convene with the spirits; Emperor Shun gazed upon it to receive the feudal lords. From the Xia dynasty through the Sui, five lineages ruled over three thousand years, their sacrificial rites passed down without alteration. Altars and temples—what era has not restored them? Thrice-yearly sacrifices have never lapsed, for repaying the blessings of life and honoring the divine spirits has never ceased. Though the deity’s blessings are luminous, calamities and malevolence have never been absent.\n\nThe deity’s shrine lies at the mouth of Yellow Spirit Valley. During the *Yongguang* era of the Han, it was relocated north of the official road, where halls and palaces were constructed. Sacrificial rites and vessels were conducted with the same ceremony as those for the Three Dukes.\n\nIn the third year of the *Xianyuan* era of the Tang, *The Record of Mount Hua of the Western Peak* was completed.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "西岳华山志 经名：西岳华山志。 金王处一编。 一卷。 底本出处：《正统道藏》洞真部记传类。 西岳华山志序 凡古之士，合作神药，必入名山福地，不止小山之中，何则？ 小山无正神为主，多是木石之精，千岁老物，此辈蕴邪之气，不念为人作福故也。 谨按山经云：可以精思合作神药者，华山、泰山、霍山、恒山、嵩山，余系中州，或在诸侯五服之外，其问称名山者以百数，乃不可以遍举，此皆有正神在其山中，或隐地仙之人，又生芝草，若有道者登之，则此山神路之为福，其药必成矣。 吾乡金城千里，控压三河，川英岳秀，太华位焉。 夫太华者，坐抱三公，抗衡四岳，终南、太白却立而屏息，首阳、王屋不敢以争雄，西观昧谷之稍昏，束顾扶桑之已白，更无峻极，惟戴高穹，盖得太素之元精，禀金天之爽气，作成万物，分主兑方，预之於十大洞天之中，则极真为号，含藏日月，吐纳云姻，生象外之楼台，匪人问之风物。 目之於十八水府之数，则车箱有潭，束南江海，地脉潜通，载祀典而为常经，投金龙，进玉简，若夫仙掌云空，苍龙日出，千山捧岳，岚气川流，翠扑客衣，经时不落。 已而，斜阳映山，莲峰弄色，如金如碧，匪丹匪青，奇丽万千，不可名状。 松生琥珀，夜即有光，地出醴泉，为国之瑞。 固宜降五灵玄老，隐函谷真人，或星冠羽衣，乘云而谒帝王者有之，或宝车羽盖，驾龙而觐大罗者有之，招邀真圣，总集仙灵，则此又华山为一都会也。 吾友王公子渊，先觉而守道，独立而全和，每语人日：我欲曳杖云林，举觞霞岭，斯志积有年矣。 方毕婚娶，弃家入名山，修炼金液，不有太华，其孰留意焉？ 人曰：可矣。 公遂取旧藏《华山记》一通，虑有阙遗，更阅本郡《图经》及刘向《列仙》等传，有载华山事者，悉采拾而附益之，俾各有分位，不失其叔。 以山水观之，则峰穴、林谷、岩宠、池井、溪洞、潭泉之境，可得而见； 以祠宇观之，则官殿、寺庙、药炉、拜坛诸神降现之处，可得而知，语其所产药品，则狭苓、莒蒲、细辛、紫梧，俱中炎帝之选； 录其所出仙人，则清虚裴君、白羊公、黄初平十六真人尽预； 玉皇之游宴，而不与下界相关乎。 噫！ ．华山仙踪圣迹於是大备，无不包也。",
      "translated_text": "**The Western Peak Mount Hua Record**\n\n**Scripture Title:** *The Western Peak Mount Hua Record*. Compiled by Wang Chuyi of the Jin dynasty. One fascicle. Base text from the *Daoist Canon of the Zhengtong Era*, *Dongzhen* section, *Records and Biographies* category.\n\n**Preface to *The Western Peak Mount Hua Record***\n\nOf old, those who sought to compound divine elixirs invariably entered renowned mountains and blessed lands, never confining themselves to lesser hills. Why? Lesser mountains lack true deities to preside over them, being instead inhabited by the spirits of trees and stones—aged beings of a thousand years, whose qi harbors perversity and who care not to bring fortune to humankind.\n\nAccording to the *Classic of Mountains*, the peaks where one may refine the mind and concoct divine elixirs are Mount Hua, Mount Tai, Mount Huo, Mount Heng, and Mount Song. The rest lie within the Central Plains or beyond the five marches of the feudal lords. Though mountains called \"renowned\" number in the hundreds, they cannot all be enumerated. Yet all these possess true deities within their bounds, or else reclusive earthbound immortals. They also nurture magic mushrooms. Should a practitioner of the Dao ascend such a mountain, its spirits will surely bestow blessings, and the elixir will assuredly be perfected.\n\nMy homeland, Jincheng, spans a thousand *li*, commanding the three rivers. Amid its rivers and peaks, the majesty of Mount Taihua stands preeminent. Taihua, embracing the Three Dukes in its embrace and rivaling the Four Sacred Peaks, forces even Zhongnan and Taibai to stand in awe, while Shouyang and Wangwu dare not vie for supremacy. To the west, it gazes upon the dimming twilight of Mu Valley; to the east, it beholds the dawn of Fusang. No summit surpasses it in height—only the vault of heaven crowns its peak. It has received the primordial essence of the Great Simplicity and the pure qi of the Metal Heaven, shaping the myriad things and presiding over the *dui* direction. Among the Ten Great Grotto-Heavens, it is named \"Utmost Perfection.\" It cradles the sun and moon, exhales and inhales clouds and mist, giving rise to towers beyond the realm of form, to landscapes not of this mortal world.\n\nAmong the Eighteen Water Palaces, its Chexiang holds a deep pool, where the southeast rivers and seas subtly connect through hidden earth veins. It is enshrined in the sacrificial canon as an enduring norm. Here, golden dragons are cast and jade tablets presented. When the Immortal’s Palm pierces the clouds and the Azure Dragon heralds the sun, a thousand peaks bow to the mountain, while mist and qi flow like rivers. The verdant hues brush against travelers’ robes, lingering long after they depart.\n\nThen, as the slanting sun gilds the peaks, the Lotus Peak plays with hues—now golden, now jade—neither crimson nor azure, a thousand marvels beyond description. Amber pines glow at night, and the earth yields sweet springs, a national auspice. Thus, it is fitting that the Five Numinous Elders descend here, that the True Man of Hangu Pass conceals himself, that some in star-crowned feathered robes ride clouds to audience with emperors, or that others in jeweled chariots and feathered canopies mount dragons to behold the Great Veil. Summoning perfected sages and gathering divine spirits, Mount Hua becomes a grand assembly.\n\nMy friend, Master Wang Ziyuan, awakened early to guard the Dao, standing alone yet preserving harmony. He often told others: \"I long to wander clouded groves with staff in hand, to raise a cup upon misty peaks—this aspiration has endured for years.\" Soon after his marriage, he abandoned his home for the renowned mountains, refining the Golden Fluid. If not Mount Taihua, where else would he fix his intent?\n\nPeople said: \"It is fitting.\" Thereupon, Master Wang took an old copy of the *Record of Mount Hua*, fearing omissions, and further consulted the *Illustrated Classic* of his prefecture and Liu Xiang’s *Arrayed Transmissions of Immortals*, gathering all accounts of Mount Hua to supplement it. He arranged each entry in its proper place, ensuring nothing was misplaced.\n\nViewed through its landscapes, the peaks and caves, forests and valleys, cliffs and grottoes, pools and wells, streams and ravines, springs and deep pools—all may be seen. Viewed through its temples and sanctuaries, the palaces and monasteries, alchemical furnaces and altars where deities descend—all may be known. As for its medicinal produce, the *fuling*, *acorus*, *asarum*, and *aster*—all meet the Flame Emperor’s selection. Recording its immortals, the Pure Void Lord Pei, the White Ram Lord, Huang Chuping, and the Sixteen Perfected Ones—all are included. Even the Jade Emperor’s feasts here do not concern the mortal realm.\n\nAlas! The immortal traces and sacred vestiges of Mount Hua are now fully encompassed, nothing left unrecorded.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 857,
      "start_sentence": 0,
      "end_sentence": 24,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.31160879135132,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\西岳华山志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "其文仅七十余篇，命工镂板，务广流传，则岂日小补之哉？ 既成，请余以文冠其首，余或拒且贺日：余才乏卿云，无力挽千钧之笔，然喜见公之志即我之志也，我亦欲入名山，合作神药，未知明指。 会公有此，乃成我之志也。 欤大凡入名山之中，合作神药，必有所依。 《书》日：为巫者，鬼必附之； 设象者，神必主之。 况修仙药而入名山，岂山之正神而不佑我耶？ 其药之成可立而待也。 但勿谓青天空阔，白龙来运，一旦造玄洲，会群仙，翔紫霄，朝太一，听钧天之乐，享九芝之撰，行亦未昧其他，有诸天之隐语，空洞之灵章，约与公异日道也。 时大定癸卯十二月壬申泥阳刘大用器之序。 唐玄宗御制序 天有四序，星辰辨其位，地有五方，山岳镇其域，阴阳交畅，则物形焉二精气相射，则神明着矣。 西岳太华山者，当少阴用事，万物生花，故日华山。 踞中土西偏七宫正位，是称西岳。 按图以察，削成而四方，信焉； 立表以筹，其高五千仞，明焉； 石壁杰竖，而雄炼，众山奔走而倾附。 其气肃，其势威，其行配金，其辰直酉，前列华阳之谷，后压华阴之郡，左抱桃林之塞，右产蓝田之玉，下有方士真人、金鼎石室，上有明星玉女、仙草琼浆焉。 西岳华山志 莲峰逸士王处一编",
      "translated_text": "Herein lie but seventy-odd essays, entrusted to craftsmen for carving onto woodblocks, that their circulation may be wide—how could this be deemed a trifling contribution? Once completed, I was entreated to compose a preface to crown the work. Though I demurred, I also rejoiced, saying: My talent is meager as the clouds of Qi, too weak to wield the thousand-jūn brush. Yet I delight to see that your aspiration is mine as well—I too long to enter the famed mountains and concoct the divine elixir, though the path remains unclear. Now that you have accomplished this, you have fulfilled my own desire.\n\nIn truth, to enter the famed mountains and concoct the divine elixir, one must have a foundation. As the *Book* states: The shaman invokes spirits, and spirits must attend; the image is set, and the deity must preside. How much more so for refining immortal medicines within the sacred peaks—would the mountain’s true spirits not protect me? The elixir’s completion may be awaited at once.\n\nYet do not assume the azure heavens are empty, that the white dragon will descend to bear you away, that one morning you will ascend to the Dark Continent, meet the assembled immortals, soar through the Purple Empyrean, pay homage to the Great Unity, listen to the Music of the Spheres, feast on the Nine-Fold Fungus, and wander without losing sight of other paths. There are the hidden words of the heavens, the numinous chapters of the Void—let us pledge to pursue these together on another day.\n\nWritten in the twelfth month, the *ren-shen* day of the *gui-mao* year of the Dading era, by Liu Dayong of Niyang.\n\n**Preface by Emperor Xuanzong of Tang**\n\nHeaven has its four seasons, with the stars and constellations marking their positions; earth has its five directions, with mountains and peaks anchoring their domains. When yin and yang harmonize, the forms of things take shape; when the two essences of *qi* intersect, the divine and luminous manifest.\n\nThe Western Peak, Mount Taihua, governs when *shaoyin* holds sway, when all things bloom—hence its name, Huashan. Seated in the west of the Central Land, it occupies the seventh palace’s true position, thus called the Western Marchmount. Consulting the maps, one sees its sheer, four-sided form—undeniable; measuring its height with a gnomon, one finds it towers five thousand *ren*—unmistakable. Its stone walls rise in majestic splendor, its might unyielding; the surrounding mountains rush forth in homage. Its *qi* is solemn, its presence awe-inspiring; its nature aligns with metal, its celestial hour corresponds to *you*. Before it lies Huayang Valley; behind, it presses upon Huayin Prefecture. To its left, it cradles the Peach Grove Barrier; to its right, it yields the jades of Lantian. Below lie the golden tripods and stone chambers of adepts and perfected beings; above dwell the Bright Star Jade Maiden, the immortal herbs, and the nectar of jade.\n\n*The Record of Mount Hua*\nCompiled by Wang Chuyi, the Recluse of Lotus Peak",
      "overlap_context": "alchemical furnaces and altars where deities descend—all may be known. As for its medicinal produce, the *fuling*, *acorus*, *asarum*, and *aster*—all meet the Flame Emperor’s selection. Recording its immortals, the Pure Void Lord Pei, the White Ram Lord, Huang Chuping, and the Sixteen Perfected Ones—all are included. Even the Jade Emperor’s feasts here do not concern the mortal realm.\n\nAlas! The immortal traces and sacred vestiges of Mount Hua are now fully encompassed, nothing left unrecorded.",
      "start_char": 857,
      "end_char": 1347,
      "start_sentence": 25,
      "end_sentence": 44,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.92992091178894,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\西岳华山志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "华州图经 《昭文馆记》云：莲花峰，上有三峰，上接三光，中有石池二十八所，应二十八宿。 青松绿竹，丛生高冈，云萃霭，旋於幽阜一怀蕴金玉，蓄藏风雷，为大帝之别宫，乃神仙之窟宅也。 《方域志》云：华山，在华州华阴县界。 华州，按《禹贡》系雍州分野，自周宣王封母弟友於咸林，是为郑国。 至秦武公十一年，以郑为县。 后始皇分天下为三十六郡，以郑隶内史。 汉以郑隶京兆。 西魏为华州。 历隋属京兆，至恭帝义宁元年一，称为华州。 唐武后垂拱二年，改为太州。 、中宗神龙年，复名华州。 肃宗上元元年，更名镇国军，至上元二年，复名太州。 宝应元年，却名华州。 昭宗乾佑四年，为兴德府。 光化二年，复名称华州。 宋更名为镇潼军，华阴因名华阴县。 后或为太华县，或为晋阴县，或为宁泰县，或为仙掌县。 莲花峰　仰天池　八卦池　太一池　白莲池　二十八宿池　十丈莲　玉井 莲花峰，一上四十里，卓立五千，上有明星玉女之别馆、金天王之正、二十八宿池、黑龙潭、玉女洗头盆、莒蒲池、仰天池、八卦池、太一池、太上泉。 傍有玉井，生千叶白莲花，食之令人羽化。 古诗云：太华峰头玉井莲，花开十丈藕如船。 玲比雪霜甘比蜜，一片入口沉病痊。 我欲求之不惮远，青壁无路难夤绿。 安得长梯上摘实，下种七泽根株连。 太上山　老君洞　太上泉　莒蒲池　老君烧丹炉 老子见周之衰，西迈流沙，至函谷关。 关令尹喜，占其黑色，即知真人将过，果得老子。 老子亦知其奇，为着书上下篇，言道德之事，后隐华山。 《昭文馆记》称：莲花峰，为太上山，四面削成，高五千仞，回峦四合，三峰峥嵘，上广十里，乌兽不居。 顶之束南峰有老君洞，次北太上泉，泉之傍有老君万蒲池，其莒蒲叶细如剑脊，其根每寸九节，服之令人强健，延年益寿耳。 苍龙岭之束北峰上，有老君炼丹炉。 细辛平，岳顶西南隅，方圆三四亩，尽是细辛，服之令人身体生香，闻及百步。 古记所称草似帛似布，今人所称西岳布是也。 紫相 岳顶束北峰上有紫相，叶际碧露，以五月五日油囊接之，食者可作地仙。 五粒松 岳顶西南峰上有五粒松，平如偃盖，上有青萝长百尺，下生袂苓，具如人形，时生琥珀，夜即有光，如荷花，昼如牛目，服之遐举矣，夜可书字。 明星玉女、玉女石马、玉女洗头盆 明星玉女祠，在顶之中峰龟背上立。 祠堂有玉女石室，一玉女圣像一尊，并玉女石马一疋，其马神灵异常，夜闻嘶瞰之声。 顶上隐者，常见之祠前，有石臼五枚，臼中俱有水，号日玉女洗头盆。 其水碧绿澄彻，早不竭，雨不溢。 《 神雾经》 云：明星玉女持玉浆，饵之令人得神。 玉女窗 玉女窗，在云台南峰，上有石门，入丈余，直上石窖如窗，望见南峰朋星玉女之别馆也。 石龟蹑 石龟玉女祠，在石龟上。 其石似龟，束西八九步，南北二十余丈，两头壁立，其形如龟。 前有石蹑，犹如拆裂，阔可有五寸，其深不可测，以物投中，食顷犹闻其下声，即古之进简於岳府之所也。 黑龙潭 黑龙潭，在顶之南峰，上有仰天池、黑龙潭。 人间叹旱，祈求必雨。 宋崇宁二年，准劝神封显润侯。 洞玄石室 西岳洞玄石室，在顶之西北峰上，四绝。",
      "translated_text": "*The Huazhou Illustrated Classic* records in *The Annals of the Zhaowen Pavilion*: The Lotus Flower Peak comprises three summits, their heights touching the Three Luminaries. Within it lie twenty-eight stone pools, corresponding to the Twenty-Eight Constellations. Green pines and verdant bamboo thrive upon the lofty ridges; clouds and mist gather in swirling embrace about the secluded hills. Here, a trove of gold and jade lies concealed, harboring the winds and thunder—this is the Great Emperor’s detached palace, the very grotto-dwelling of immortals and transcendents.\n\n*The Gazetteer of Regions* states: Mount Hua stands within the bounds of Huayin County, Huazhou. Huazhou, according to *The Tribute of Yu*, falls under the celestial division of Yongzhou. In the reign of King Xuan of Zhou, his younger brother You was enfeoffed at Xianlin, establishing the state of Zheng. By the eleventh year of Duke Wu of Qin, Zheng was made a county. Later, the First Emperor of Qin divided the realm into thirty-six commanderies, placing Zheng under the jurisdiction of the Neishi. The Han dynasty assigned Zheng to the capital district of Jingzhao. The Western Wei established Huazhou. Through the Sui, it remained part of Jingzhao, until the first year of Emperor Gong’s Yining era, when it was formally designated Huazhou. In the second year of Empress Wu Zetian’s Chuigong reign, it was renamed Taizhou. During Emperor Zhongzong’s Shenlong era, it reverted to Huazhou. In the first year of Emperor Suzong’s Shangyuan reign, it was renamed ZhenGuo Army, only to be called Taizhou again in the second year. In the first year of the Baoying era, it reverted once more to Huazhou. In the fourth year of Emperor Zhaozong’s Qianyou reign, it became Xingde Prefecture. In the second year of the Guanghua era, it was restored to Huazhou. The Song renamed it ZhenTong Army, and Huayin was accordingly named Huayin County. Later, it was variously called Taihua County, Jinyin County, Ningtai County, and Xianzhang County.\n\n**Lotus Flower Peak**\nAscending forty *li*, it stands solitary at five thousand *ren*. At its summit lie the detached chambers of the Bright Star Jade Maiden, the central shrine of the Golden Heavenly King, the Twenty-Eight Constellation Pools, Black Dragon Pond, the Jade Maiden’s Hair-Washing Basin, Sweet Flag Pool, Sky-Gazing Pool, Eight Trigrams Pool, Great Unity Pool, and the Supreme Spring. Nearby is the Jade Well, where thousand-petaled white lotuses bloom; those who partake are said to ascend as immortals. An ancient poem reads:\n*At the peak of Great Hua, the jade-well lotus,*\n*Ten fathoms wide its blooms, its roots like boats.*\n*Fair as frost and snow, sweet as honey,*\n*A single petal in the mouth cures all ills.*\n*I long to seek it, undeterred by distance,*\n*Yet the azure cliffs offer no path to cling.*\n*If only a ladder stretched to pluck its fruit,*\n*To plant its seeds in the seven marshes, roots entwined.*\n\n**Supreme Mountain**\n**Laozi’s Grotto**\n**Supreme Spring**\n**Sweet Flag Pool**\n**Laozi’s Alchemical Furnace**\nWhen Laozi witnessed the decline of Zhou, he journeyed west beyond the Flowing Sands to the Hangu Pass. Yin Xi, the Pass Keeper, divined from the black aura that a true sage would soon pass, and indeed, he encountered Laozi. Recognizing Yin Xi’s extraordinary nature, Laozi composed for him the two-part *Book of Dao and Virtue*, then retreated into seclusion on Mount Hua. *The Annals of the Zhaowen Pavilion* states: Lotus Flower Peak is also called Supreme Mountain. Its four faces are sheer-cut, rising five thousand *ren*. Encircling ridges converge, three peaks thrusting skyward, their summit spanning ten *li*, where neither bird nor beast dwells. On the southeastern spur of its summit lies Laozi’s Grotto; to the north, the Supreme Spring. Beside the spring is Laozi’s Sweet Flag Pool, where the sweet flag’s leaves are as slender as a sword’s spine, its roots bearing nine nodes per inch. Consuming it strengthens the body, prolonging life and enhancing vitality. On the northeastern spur of Canglong Ridge stands Laozi’s Alchemical Furnace. At Xixin Flat, on the southwestern corner of the mountain’s summit, a plot of three to four *mu* is entirely overgrown with *Asarum*, whose consumption imparts a fragrant aroma to the body, perceptible a hundred paces away. Ancient records describe a plant resembling silk or cloth—what is now called \"Western Peak Cloth.\"\n\n**Purple Mulberry**\nAtop the northeastern spur of the mountain’s summit grows the Purple Mulberry. Its leaves exude a jade-like dew; when collected in an oil-silk pouch on the fifth day of the fifth month, those who consume it may become earthbound immortals.\n\n**Five-Seed Pine**\nAtop the southwestern spur of the mountain’s summit stands the Five-Seed Pine, its canopy flat as an overturned parasol. From it hangs green vine a hundred feet long, beneath which grows *fuling* in human form. At times, amber crystallizes, glowing at night like a lotus, by day like an ox’s eye. Those who consume it ascend to distant realms, and its resin may be used to write at night.\n\n**Bright Star Jade Maiden, Jade Maiden’s Stone Horse, Jade Maiden’s Hair-Washing Basin**\nThe shrine of the Bright Star Jade Maiden stands upon the tortoise-shaped back of the central peak’s summit. Within the shrine’s hall is a stone chamber housing a sacred statue of the Jade Maiden and a stone horse, whose divine nature is extraordinary—its neighing and stamping are heard at night. Hermits dwelling on the summit often witness these marvels. Before the shrine lie five stone mortars, each filled with water, known as the Jade Maiden’s Hair-Washing Basins. Their waters are jade-green and limpid, never depleting in drought nor overflowing in rain.\n\n*The Scripture of Divine Mists* states: The Bright Star Jade Maiden holds jade nectar; those who partake attain transcendence.\n\n**Jade Maiden’s Window**\nThe Jade Maiden’s Window lies on the southern spur of the Cloud Terrace Peak. Above it is a stone gate; entering a *zhang* or so, one ascends to a stone recess like a window, through which the detached chambers of the Bright Star Jade Maiden on the southern peak may be glimpsed.\n\n**Stone Tortoise Steps**\nThe shrine of the Stone Tortoise Jade Maiden rests upon a rock resembling a tortoise. From east to west, it spans eight or nine paces; from north to south, over twenty *zhang*. Its two ends rise sheer, its form like a tortoise. Before it lie stone steps, cracked as if split, about five inches wide, their depth unfathomable. When objects are cast within, the sound from below lingers for the time it takes to eat a meal—this is the ancient site where memorials were presented to the mountain’s abode.\n\n**Black Dragon Pond**\nBlack Dragon Pond lies on the southern spur of the summit, where the Sky-Gazing Pool and Black Dragon Pond are found. In times of drought, prayers for rain are invariably answered. In the second year of the Chongning era of the Song, the dragon was enfeoffed as Marquis Xianrun of Manifest Moisture.\n\n**Cavern of Mystery Stone Chamber**\nThe Cavern of Mystery Stone Chamber of the Western Peak stands upon the northwestern spur of the summit, its four sides sheer.",
      "overlap_context": "nce awe-inspiring; its nature aligns with metal, its celestial hour corresponds to *you*. Before it lies Huayang Valley; behind, it presses upon Huayin Prefecture. To its left, it cradles the Peach Grove Barrier; to its right, it yields the jades of Lantian. Below lie the golden tripods and stone chambers of adepts and perfected beings; above dwell the Bright Star Jade Maiden, the immortal herbs, and the nectar of jade.\n\n*The Record of Mount Hua*\nCompiled by Wang Chuyi, the Recluse of Lotus Peak",
      "start_char": 1347,
      "end_char": 2612,
      "start_sentence": 45,
      "end_sentence": 100,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.122862100601196,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\西岳华山志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "昔清虚真人裴君入此室，精思至道，积二十三年矣，降五灵玄老之所。 其石室束西有二门，初入才容身，侧入至室中，周回五六丈。 束门上接云霞，西门下临地中，有石道像，高三尺，戴三景扶晨之冠，石衣文如九色杂罗之文，像多古钱，其钱多脚一头，多孔．一．面，有文云大布大篆。 筹场　芦花池 算场，在顶上。 后魏道士寇谦之，洞晓浑天仪，尤善玄像，曾定天元五纪，其算有差，后成公兴真人徉狂而来，假为货客，俟触等筹，其等乃合。 谦之悔恨，独居山林，遂随真人去，弃其余算，筹化为菱荻，今名芦花池是也。 暮石 暮石，在顶上束南隅别一孤峰上。",
      "translated_text": "Long ago, the Perfected Master of Pure Emptiness, Lord Pei, entered this chamber to cultivate the Dao with single-minded devotion. After twenty-three years of practice, he was visited by the abode of the Five Numinous Elders of the Mysterious. The stone chamber has two doors, one to the east and one to the west. The entrance is barely wide enough for a person to pass, but once inside, the chamber expands to five or six *zhang* in circumference. The eastern door opens onto the clouds and mist, while the western door overlooks the earth below. Within stands a stone statue, three *chi* tall, wearing a crown of the Three Luminaries and the Embracing Dawn. Its stone robes bear patterns like those of nine-colored brocade, and the statue is adorned with many ancient coins—some with one head and many legs, others with a single hole and one side inscribed with the characters \"Great Cloth\" in large seal script.\n\n**Counting Field and Reed-Flower Pool**\nThe Counting Field lies atop the summit. During the Later Wei, the Daoist Master Kou Qianzhi, well-versed in the armillary sphere and particularly skilled in celestial portents, once calculated the Heavenly Origin and Five Eras. His calculations contained errors, but later, the Perfected Master Cheng Gongxing arrived in feigned madness, posing as a merchant. He waited for Kou to cast his counting rods, and only then did the calculations align. Kou, filled with remorse, withdrew to the mountains and forests, following the Perfected Master and abandoning his remaining calculations. The counting rods transformed into water caltrops and reeds—hence the name Reed-Flower Pool.\n\n**Twilight Stone**\nThe Twilight Stone stands atop the summit’s southeastern spur, upon a solitary peak.",
      "overlap_context": "tain’s abode.\n\n**Black Dragon Pond**\nBlack Dragon Pond lies on the southern spur of the summit, where the Sky-Gazing Pool and Black Dragon Pond are found. In times of drought, prayers for rain are invariably answered. In the second year of the Chongning era of the Song, the dragon was enfeoffed as Marquis Xianrun of Manifest Moisture.\n\n**Cavern of Mystery Stone Chamber**\nThe Cavern of Mystery Stone Chamber of the Western Peak stands upon the northwestern spur of the summit, its four sides sheer.",
      "start_char": 2612,
      "end_char": 2873,
      "start_sentence": 101,
      "end_sentence": 109,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.211293458938599,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\西岳华山志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "遥望有石方如并榻，真若暮局。 汉武帝时，面前忽有人，羽衣星冠，乘云车，驾白鹿，而从天降。 武帝惊问为谁，答日：山中卫叔卿也。 帝日：若是山中人，乃朕臣也。 忽失叔卿所在，帝甚悔恨，即遣使梁伯至山中，推求叔卿不见，但得其子，名度世。 帝日：汝父在何处？ 度世日：臣父少好仙道，委家而去，入华山四十余年矣。 帝使梁伯、度世求之於华山绝顶上，望见其父，与数仙博戏於石上，但见紫雾郁郁，又见数童执幢节，立其后。 度世等望而百拜，叔卿日：汝等何来？ 度世曰：帝恨前日仓卒，不得与父语。 叔卿日：前为太上所遣，欲诚帝为穷黩事，而帝强梁自贵，而反欲臣我，不足与语，是以去耳。 买诚度世曰：汝慎不得为汉臣，亦不复为语帝也。 梁伯、度世於是拜辞而反。 事见列仙传 石仙人　瀑布　石仙洞　昭阳洞 正阳洞　西玄洞　水帘洞 石仙人者，在岳北面半腹中。 《登真隐诀》云：岳洞深三百里，中有瑶台玉室，树则苏茅、芳林，碧泉则石髓、金精，遥望洞方圆可丈余，乌道绝通，人踪罕到，时出异色云黑。 洞口上有丹石，问青石，似丹青画出仙人之状，冠被衣服无不周备，高下大小如人形，号日石仙人。 上有瀑布，飞流直下三千余丈，其石仙洞又称为水帘洞。 其岳有四洞：束日昭阳，西日西玄，南日正阳，北曰水帘。 蟹遗穴 蟹遗穴，在顶之西北峰。 《山海经》云：华山有兽而翼，六足蛇身，出 则天下大旱。",
      "translated_text": "From afar, a stone appears square as a well-side couch, truly resembling a *go* board at dusk.\n\nDuring the reign of Emperor Wu of Han, a figure suddenly appeared before him—clad in feathered robes and a star-crowned cap, riding a cloud chariot drawn by a white deer, descending from the heavens. The emperor, startled, asked who he was. The figure replied, \"I am Wei Shuqing of the mountains.\" The emperor said, \"If you are a man of these mountains, then you are my subject.\" Suddenly, Shuqing vanished. The emperor, filled with regret, immediately dispatched his envoy Liang Bo to the mountains to search for Shuqing, but he was nowhere to be found. Only his son, named Du Shi, was located. The emperor asked, \"Where is your father?\" Du Shi replied, \"My father, from youth, favored the Dao of immortals. He abandoned his family and entered Mount Hua over forty years ago.\" The emperor then sent Liang Bo and Du Shi to seek him at the summit of Mount Hua. There, they glimpsed his father playing *bo* with several immortals upon the stone, enveloped in thick purple mist. Several youths bearing banners and staffs stood behind them. Du Shi and the others prostrated themselves in reverence from afar. Shuqing asked, \"Why have you come?\" Du Shi said, \"The emperor regrets that the other day, in haste, he failed to speak with you.\" Shuqing replied, \"Previously, I was sent by the Supreme Lord to admonish the emperor for his reckless extravagance. Yet the emperor, arrogant and self-important, sought to make me his subject. He is unworthy of speech—that is why I left.\" He then sternly warned Du Shi, \"Beware of becoming a Han minister, and do not speak of this to the emperor.\" Liang Bo and Du Shi then bowed in farewell and returned. This account appears in *The Biographies of the Immortals*.\n\n**Stone Immortal**\n**Waterfall**\n**Stone Immortal Cave**\n**Zhaoyang Cave**\n**Zhengyang Cave**\n**Xixuan Cave**\n**Water Curtain Cave**\n\nThe Stone Immortal lies midway up the northern face of the mountain. *The Hidden Instructions for Ascending to Perfection* states: \"The mountain’s cavern extends three hundred *li* deep, within which are jade terraces and chambers. Its trees are fragrant grasses and lush groves; its azure springs flow with stone marrow and golden essence. From afar, the cavern appears roughly a *zhang* in circumference. A bird’s path cuts off all passage, and few human traces reach it. At times, clouds of strange hues emerge. At the cavern’s mouth rests cinnabar stone, while nearby green stone resembles an immortal painted in ink and cinnabar—crown, robes, and garments all perfectly rendered, its height and proportions like those of a human. Thus, it is called the Stone Immortal. Above it hangs a waterfall, cascading straight down over three thousand *zhang*. The Stone Immortal Cave is also known as the Water Curtain Cave. The mountain possesses four caves: to the east, Zhaoyang; to the west, Xixuan; to the south, Zhengyang; and to the north, Water Curtain.\"\n\n**Crab’s Abandoned Cave**\nThe Crab’s Abandoned Cave lies on the northwestern peak of the summit. *The Classic of Mountains and Seas* records: \"On Mount Hua dwells a beast with wings, six legs, and the body of a serpent. When it emerges, the world suffers great drought.\"",
      "overlap_context": "cted Master Cheng Gongxing arrived in feigned madness, posing as a merchant. He waited for Kou to cast his counting rods, and only then did the calculations align. Kou, filled with remorse, withdrew to the mountains and forests, following the Perfected Master and abandoning his remaining calculations. The counting rods transformed into water caltrops and reeds—hence the name Reed-Flower Pool.\n\n**Twilight Stone**\nThe Twilight Stone stands atop the summit’s southeastern spur, upon a solitary peak.",
      "start_char": 2873,
      "end_char": 3438,
      "start_sentence": 110,
      "end_sentence": 134,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.928975105285645,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\西岳华山志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "巨灵掌　仙掌石月 巨灵左掌，上有半轮石月，在顶之东北峰上。 《遁甲开山图》云：巨灵得玄元之道，与元气一时而生，混沌之师九元祖也。 汉武帝观仙掌於县内，特立巨灵神祠焉。 华山灵异 华山之顶，乃天真降临之地，神仙聚会之乡，降现之事极多，略叔其一二。 曾先闻异香，次观瑞霭，或见千乘万骑，或见玉女金童，或丫髻童子数百，或羽服道士瑜千，或见珠幢而金伞，或见绛节而霓旌，或见骑龙骑虎人，或见乘凤乘鸾客，或见金光满地，或见火焰连天，或见紫雾腾空，或见祥云覆顶，或闻金钟呜。 其降见不＇一，或在最高峰上，或於仙掌峰头，或集三公山，或聚西玄洞。 昔清虚真人裴公隐於顶之西北峰上，曾降五灵玄老中方大罗峰； 王母数现，或衣黄裳，戴金冠，乘宝辇，驾五色斑龙九头，上有羽盖，左右金童、玉女、仙官、将吏，莫穷其数，后於现处建其祠堂。 唐贞观中，山下建王母观。 华山之西，有一山名日罗敷山，大历五年，有天、地、水府三官降现，又感代宗皇帝梦中，后劫修三官院，至咸平中，更为承天观。 神林 华山之上，山之下，或谷内，或庙道中，但有生死树木，名日神林，禁人采伐，如有犯者，立祸於身。 山之西南隅有一林，侵天松桧，乃岳神游宴之处，名黑山林。 有樵窃采之者，火烧虎食甚众。 御道 御道，在仙掌峰之北，乃升岳之路也。 汉武帝、唐玄宗曾游此，因名御道。 今两傍有石臼子，乃当时栽阐干用，锦绣遮护危险。 峰顶须由御道跨苍龙临云台天井，径下有百尺状，自顶至青柯平二十里，青柯平出谷口二十里。 张超谷 张超谷者，后汉张楷字公超结庐之地。 学者如市。 又能为五里雾，故称张超雾市。 每跨赛驴入市，晚即携壶带酒而归。 石羊城仙谷 石羊城，在张超谷之西，乃黄初平、黄初起弟兄二人得仙之地，山谷故名仙谷。 黄初平者，丹溪人也，年少时，家使牧羊，久而不归。 其兄初起寻觅近四十年矣，后闻市中有一道士，言人休咎，其验如神，初起乃问之道士日：太华山中有一牧羊儿，姓黄名初平，是卿之弟耶。 初起拜谢，即随道士入此谷中，见弟悲喜，语毕，问弟：羊今何在？ 初平日：仅在山束耳。 兄初起往视之，但石而还。",
      "translated_text": "**Giant’s Palm and the Stone Moon**\n\nThe Giant’s Left Palm features a half-wheel Stone Moon atop the northeastern peak. *The Diagram of Hidden Mechanisms for Mountain Opening* states: \"The Giant attained the Dao of Primordial Mystery and was born simultaneously with primordial *qi*, serving as the master of the Nine Ancestors of Chaos.\"\n\nEmperor Wu of Han once observed the Immortal’s Palm within the county and specially established a shrine to the Giant Spirit there.\n\n**Marvels of Mount Hua**\n\nThe summit of Mount Hua is a place where celestial perfected beings descend and immortals gather, with countless manifestations of divine presence. Here are but a few examples:\n\nAt times, one first detects an extraordinary fragrance, then beholds auspicious mists. Sometimes, a thousand chariots and ten thousand riders appear; at others, jade maidens and golden lads, or hundreds of youths with double topknots. One may see a thousand feather-robed Daoists in *yu* meditation, or pearl-canopied golden parasols, or crimson staffs and rainbow banners. Some witness riders on dragons or tigers, or visitors astride phoenixes and simurghs. At times, golden light fills the earth; at others, flames stretch to the heavens, or purple haze soars into the sky, or propitious clouds blanket the summit. The tolling of golden bells may also be heard.\n\nThese apparitions vary in form and location—sometimes on the highest peak, sometimes atop the Immortal’s Palm Peak, or gathering on Three Ministers Mountain, or assembling at the Western Mystery Cave.\n\nIn former times, the Perfected Master of Pure Emptiness, Lord Pei, secluded himself on the northwestern peak. Once, the Five Numinous Mysterious Elders of the Central Direction descended upon the Great Luo Peak. The Queen Mother of the West appeared several times, now clad in yellow robes, wearing a golden crown, riding a jeweled carriage drawn by nine multicolored, spotted dragons. Above her was a feathered canopy, flanked by golden lads, jade maidens, immortals, and celestial officials—numberless in their ranks. Later, a shrine was built at the site of her manifestation.\n\nDuring the Zhenguan era of the Tang, a Temple of the Queen Mother was constructed at the mountain’s base. To the west of Mount Hua lies a mountain called Luofu, where in the fifth year of the Dali era, the Three Officials of Heaven, Earth, and Water descended. Their visitation moved Emperor Daizong in a dream, prompting him to order the construction of the Three Officials’ Abbey. By the Xianping era, it was renamed the Temple of Heaven’s Mandate.\n\n**Divine Grove**\n\nUpon Mount Hua—whether on its slopes, within its valleys, or along the paths near its temples—all trees, whether living or dead, are called the Divine Grove. Their felling is forbidden, and those who violate this prohibition bring calamity upon themselves.\n\nOn the southwestern side of the mountain stands a grove of towering pines and cypresses, where the Mountain Spirit holds feasts. It is named the Black Mountain Grove. Those who secretly cut its trees have perished in fires or been devoured by tigers in great numbers.\n\n**Imperial Path**\n\nThe Imperial Path lies north of the Immortal’s Palm Peak and serves as the route to ascend the mountain. Emperors Wu of Han and Xuanzong of Tang once traveled this way, hence its name. Today, stone mortars remain on either side, used in their time to anchor railings and drape brocade for protection against perilous drops.\n\nTo reach the peak, one must traverse the Imperial Path, cross the Azure Dragon, and pass the Cloud Terrace and Heavenly Well. The path descends steeply for a hundred *chi*. From the summit to the Green Branch Plateau spans twenty *li*, and from the Green Branch Plateau to the valley’s mouth, another twenty *li*.\n\n**Zhang Chao Valley**\n\nZhang Chao Valley is where Zhang Kai, styled Gongchao of the Later Han, built his hut. Scholars gathered there like a marketplace. He was also capable of summoning a five-*li* mist, earning the place the name \"Zhang Chao’s Misty Market.\" Each day, he would ride a donkey to the market and return in the evening, carrying a flask of wine.\n\n**Stone Ram City and Immortal Valley**\n\nStone Ram City lies west of Zhang Chao Valley, where the brothers Huang Chuping and Huang Chuqi attained immortality. The valley is thus named Immortal Valley.\n\nHuang Chuping, a native of Dan Creek, was sent by his family to herd sheep as a youth and did not return for a long time. His brother, Chuqi, searched for nearly forty years before hearing of a Daoist in the market who could divine fortunes with divine accuracy. Chuqi asked the Daoist, \"In the Great Flower Mountain, there is a shepherd boy named Huang Chuping. Is he your younger brother?\"\n\nChuqi bowed in gratitude and followed the Daoist into the valley, where he joyfully reunited with his brother. After their conversation, Chuqi asked, \"Where are your sheep now?\"\n\nChuping replied, \"They are just east of the mountain.\"\n\nChuqi went to look but saw only stones before returning.",
      "overlap_context": "r three thousand *zhang*. The Stone Immortal Cave is also known as the Water Curtain Cave. The mountain possesses four caves: to the east, Zhaoyang; to the west, Xixuan; to the south, Zhengyang; and to the north, Water Curtain.\"\n\n**Crab’s Abandoned Cave**\nThe Crab’s Abandoned Cave lies on the northwestern peak of the summit. *The Classic of Mountains and Seas* records: \"On Mount Hua dwells a beast with wings, six legs, and the body of a serpent. When it emerges, the world suffers great drought.\"",
      "start_char": 3439,
      "end_char": 4309,
      "start_sentence": 135,
      "end_sentence": 167,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.94353699684143,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\西岳华山志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "与弟日：弟兄俱往。 初平乃叱石日：羊起。 於是白石尽变为羊，数万头。 兄初起叩头日：弟独得仙，吾可学乎？ 初平曰：若有志，可得也。 初起便弃妻子，拜弟为师，后乃俱成列仙矣。 叱石处，四面宽广，有似城垒，今人称为石羊城。 文仙谷 文仙谷者，乃是吕真君隐居之所也。 真君来此，易姓姬，更名洞明，道号抱真子。 居华山莲花峰下，文仙谷内，结庵四十年矣，人无识者。 绍兴丙子中秋前一日，谓门人刘裕之日：张翁、骊母升玄待吾久矣，因作颂日：上面一个口，下面一个口。 世问坚的有，盛水不交漏。 嘱付裕之讫，怡然外化。",
      "translated_text": "The brothers then said, \"Let us both go together.\" Chuping then shouted at the stones, \"Sheep, arise!\" At once, all the white stones transformed into sheep—tens of thousands of them. Chuqi kowtowed and asked, \"My brother, you alone have attained immortality. May I also learn the Way?\"\n\nChuping replied, \"If you are resolute, it can be achieved.\" Chuqi then abandoned his wife and children, bowed to his brother as his master, and later, both ascended together as immortals. The place where the stones were commanded is spacious on all sides, resembling a fortress; it is now called Stone Sheep City.\n\n**Wenxian Valley**\nWenxian Valley was the secluded abode of the Perfected Lord Lü. When the Perfected Lord came here, he changed his surname to Ji and his given name to Dongming, with the Daoist name Baozhenzi. He dwelled beneath Huashan’s Lotus Peak, within Wenxian Valley, constructing a hut where he lived for forty years, unknown to others.\n\nOn the day before the Mid-Autumn Festival of the *bingzi* year of the Shaoxing reign, he said to his disciple Liu Yu, \"Elder Zhang and Mother Li have long awaited my ascent to the Mystery. I shall leave a verse:\n\n*Above, one mouth; below, one mouth.*\n*In the world, it is firm and true.*\n*Though it holds water, it does not leak.*\n\nHaving entrusted these words to Yu, he serenely departed this world.",
      "overlap_context": "ring of a Daoist in the market who could divine fortunes with divine accuracy. Chuqi asked the Daoist, \"In the Great Flower Mountain, there is a shepherd boy named Huang Chuping. Is he your younger brother?\"\n\nChuqi bowed in gratitude and followed the Daoist into the valley, where he joyfully reunited with his brother. After their conversation, Chuqi asked, \"Where are your sheep now?\"\n\nChuping replied, \"They are just east of the mountain.\"\n\nChuqi went to look but saw only stones before returning.",
      "start_char": 4309,
      "end_char": 4552,
      "start_sentence": 168,
      "end_sentence": 181,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.594884395599365,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\西岳华山志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "裕之即藏遗骸於石室，后数岁，先生神现泗州塔，自题诗云：姬州墨客，羽化三峰。 又数载来谒裕之，题诗云：昔日曾居此，埋名四十春。 红尘多少客，谁是识余人。 又诗云：余曾十载攻文墨，万卷诗书锁胸臆。 浮萍云水寄家绿，住在莲峰人不识。 后云回公题。 裕之寻所座尸处，惟见空棺，中有二口吕字之事。 由是，时人方悟是吕真君也。 真君唐太宗朝得道，至今五百年矣。 元丰问题琴台诗云：野人本是天台客，石桥南边有住宅。 父子从来只两口，子好歌时我好拍。 又诗云：四海遨游一野人，两壶霜雪是精神。 坎离之物会收得，龙虎丹行运水银。 其碑见在文仙谷，今称为羽谷庵。 牛心谷山 牛心谷者，昔杨震微时，隐逦居此，讲授群书，学者如市，其谷多槐，故称杨震槐市。 其山岩问多有五色姿乌，山上有雪，天王圣迹雪中观之，惟显天王披银甲骑骤白马之状。 黄神谷 黄神谷者。 岳之束，乃是真人黄芦子隐居之所也。 黄芦子者，楚人也，姓葛名越，但居此山，号日西岳公。 其治病有千里而来者众矣，或寄与姓名，病无不愈。 若禁虎狼不敢动，飞禽不敢飞去。",
      "translated_text": "Liu Yu then concealed the remains in a stone chamber. Several years later, the Master’s spirit manifested at the pagoda in Sizhou, where he inscribed a poem:\n\n*A scholar from Jizhou, transformed on Three Peaks.*\n\nYears afterward, he appeared to Yu again, leaving another poem:\n\n*Once I dwelled here long ago,*\n*Forty springs concealed my name.*\n*How many wanderers pass through this red dust—*\n*Who among them knows this man?*\n\nYet another poem read:\n\n*For ten years I toiled at brush and ink,*\n*Ten thousand scrolls of verse and prose locked in my breast.*\n*Like duckweed or drifting clouds, I made my home in green,*\n*Dwelling on Lotus Peak, unknown to all.*\n\nLater signed by Master Hui.\n\nYu searched for the place where the body had been seated and found only an empty coffin, within which lay two interlocking *lü* characters. From this, people at last realized he was the Perfected Lord Lü. The Perfected Lord had attained the Dao during the reign of Emperor Taizong of Tang, and five hundred years had since passed.\n\nDuring the Yuanfeng era, a poem on the zither terrace read:\n\n*A rustic was I, a visitor from Tiantai,*\n*With a dwelling south of Stone Bridge.*\n*Father and son—just the two of us—*\n*When the son sang well, I clapped in delight.*\n\nAnother poem said:\n\n*A wanderer roaming the four seas,*\n*Two flasks of frost and snow—my spirit’s essence.*\n*When the trigram’s elements are gathered,*\n*Dragon-tiger elixir moves like flowing mercury.*\n\nHis stele still stands in Wenxian Valley, now called Feather Valley Hermitage.\n\n**Oxheart Valley**\nOxheart Valley was where Yang Zhen, in his early years, lived in seclusion, lecturing on the classics. Scholars gathered like a marketplace, and the valley was thick with locust trees, hence the name \"Yang Zhen’s Locust Market.\" Among its cliffs, multicolored auspicious birds often appeared. Snow blanketed the mountain, and within it, the sacred traces of the Heavenly King could be seen—only his form clad in silver armor, mounted on a white steed, was visible.\n\n**Yellow Spirit Valley**\nYellow Spirit Valley lies east of the mountain and was the secluded abode of the Perfected Yellow Reed Master. The Master, surnamed Ge and named Yue, was a native of Chu. He dwelled on this mountain, styling himself Lord of the Western Peak. Many came from a thousand *li* away seeking his healing, and those who sent only their names found their illnesses cured. He could restrain tigers and wolves so they dared not move, and birds dared not fly away.",
      "overlap_context": "Peak, within Wenxian Valley, constructing a hut where he lived for forty years, unknown to others.\n\nOn the day before the Mid-Autumn Festival of the *bingzi* year of the Shaoxing reign, he said to his disciple Liu Yu, \"Elder Zhang and Mother Li have long awaited my ascent to the Mystery. I shall leave a verse:\n\n*Above, one mouth; below, one mouth.*\n*In the world, it is firm and true.*\n*Though it holds water, it does not leak.*\n\nHaving entrusted these words to Yu, he serenely departed this world.",
      "start_char": 4552,
      "end_char": 4991,
      "start_sentence": 182,
      "end_sentence": 204,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.493942975997925,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\西岳华山志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "受卫於赤松子，年过八十，力举千斤，行及奔马。 时大旱，召出潭中龙，催促使升天，降大雨。 一朝乘黄龙而去矣。 藏马谷　藏马宠 藏马谷者，在岳束。 汉武帝求仙於华山下，造集灵宫存仙殿、望仙门，有神马自华山出，帝令置内栈，马不久留，令人寻之，见在此山谷中石宠下，故名藏马、谷藏马宠。 束北涧中石上，马迹尚存焉。 毛女峰 毛女峰，在岳之西。 毛女，字玉姜，秦始皇宫人也。 见国祚流亡，遂负琴入华山此峰上隐居，服松相叶，饮泉水，体生绿毛，世人以见之所称毛女洞，至今洞中有鼓琴之声。 有道人得见此洞。 峰下有白石寺，废已久。",
      "translated_text": "Receiving instruction from Red Pine Master, he surpassed eighty years yet could lift a thousand *jin* and run as swiftly as a galloping horse. During a great drought, he summoned the dragon from the deep pool, urging it to ascend to heaven, and heavy rain fell. One morning, he rode away on a yellow dragon.\n\n**Hidden Horse Valley**\nHidden Horse Valley lies east of the mountain. When Emperor Wu of Han sought immortals at the foot of Mount Hua, he built the Palace of Assembled Spirits, the Hall of Preserving Immortals, and the Gate of Gazing at Immortals. A divine horse emerged from Mount Hua, and the emperor ordered it kept in the imperial stables. The horse did not stay long, so men were sent to search for it. They found it in this mountain valley beneath a stone shelter, hence the names \"Hidden Horse\" and \"Valley of the Hidden Horse Shelter.\" In the northeastern ravine, hoofprints remain imprinted on the stone.\n\n**Maiden of Fur Peak**\nMaiden of Fur Peak stands west of the mountain. The Maiden, named Yujian, was a palace woman of Qin Shihuang. Witnessing the fall of the dynasty, she took up her zither and retreated to this peak on Mount Hua to live in seclusion. She ate pine seeds and leaves, drank from mountain springs, and her body grew green fur. The world named her the \"Maiden of Fur\" after the place where she was seen, and to this day, the sound of zither music lingers in the cave. A Daoist once beheld this grotto. Below the peak stands White Stone Temple, long since abandoned.",
      "overlap_context": " steed, was visible.\n\n**Yellow Spirit Valley**\nYellow Spirit Valley lies east of the mountain and was the secluded abode of the Perfected Yellow Reed Master. The Master, surnamed Ge and named Yue, was a native of Chu. He dwelled on this mountain, styling himself Lord of the Western Peak. Many came from a thousand *li* away seeking his healing, and those who sent only their names found their illnesses cured. He could restrain tigers and wolves so they dared not move, and birds dared not fly away.",
      "start_char": 4991,
      "end_char": 5247,
      "start_sentence": 205,
      "end_sentence": 217,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.129007577896118,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\西岳华山志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "云台峰 云台峰，岳东北，其山两峰峥嵘，四面玄绝，上冠景云，下通地脉，疑然独秀，有若云台。 下有穴，昔有人入此穴，束出方山行，云经黄河底上，闻流水之声。 周武帝时，有道士焦道广独居此峰，辟粒餐霞，常有三青乌，报未然之事。 周武帝亲诣山庭，临轩问道，因而谷口置云台观。 后弟子洪仙等，见师道广乘一物如麟，往而不返矣。 试凿穴 云台北峰北面，有一试凿穴，可高百尺，其深不测。 穴边有一坚石如凿，大小阔狭，状如凿出。 乃希夷先生蜕骨之穴。 白云峰 白云峰，在岳之束北。 唐明皇妹金仙公主修行之所，名日白云宫。 八仙洞、看岳棚、上竹园、下竹园、枣树、栗子林、花圃、药畦、磴碓见在焉。 白蕾买侧有焦真人石洞。 白羊峰 白羊峰，在岳之西北五里。 层崖晃朗，洞室空蒙，每至三元八节及诸斋日，即有神灯，或三或五见於岩壁。 昔有人隐此峰，莫知其名姓，常乘白羊，往来尘世。 后与弟子介淡俱登仙，以此号为白羊真人。 真人有禁山录，及制虎豹狼熊符七十道行於世也。 松桧峰朝来峰玉柱峰玉秀峰 此四峰上尽是青松桧桥，常有异色云气覆之。 其峰耸翠孤峦，人迹希及之也。 焦公岩 焦公岩，在岳束南，真人姓焦，字孝龙，河束人也。 常餐白石，或分与坐客，其味如芋。 后遭野火烧其庵，邻峰人往视之，见先生危坐於火中，庵烧尽，先生乃徐徐而起，衣服并无焦灼。 后数载，天忽大雪，人觅不见，忽於雪中单袅而外，颜色赫然，如胜夏之状，或老或少，至今人有遇之者。 神土岩仙油碛避诏岩 神土岩，在云台束南百步，焦道广精思所感，欲构房廊，石上涌出神土，用尽复生，于今尚然。 仙油碛，在云台峰壁中，焦道广每设斋醮天降油于此碛。 自道广乘麟之后，此油不复见矣。 避诏岩，在华山之西南，古之隐逐之士，避诏冥隐於此处也。 白鹿宠 白鹿宠，在岳之束，升岳路之右，是仙人鲁女生置。 白鹿宠有飞泉滴流。 鲁女生者，是华山古之得道仙人也，在华山二百年，莫知所之。 后忽有人岳庙前逢女生，乘白鹿，从玉女十人，与人别而去。 太极总仙洞 太极总仙洞，在毛女峰之西壁中，浮有洞乃日太极总仙洞，其下有车箱潭。 王刁三洞 王刁三洞，在岳之束。 仙人王遥，字伯辽，鄱阳人也。 有妻无子，颇能治病，病无不愈，亦不祭祀，不用符水针药，或有邪魅作祟者，画地为狱，叩石呼之，皆见狐狸单翘音振蛇之类，皆斩而焚之。 王真人以竹筐令弟子钱哥以九节竹杖担之，十余年未尝见开，或逢羽衣，并不显，夜行见有炬火前导。 后至此岩洞中，见有友人刁自然，遥开竹筐，取出五舌竹簧三枚，三人共鼓之，及王遥辞而去，刁自然云：卿当早来，不可久在尘寰，再期此洞处。 后王、刁、钱哥俱登仙矣。 上洞莫能到，中洞有飞石遮于洞门，下洞隐居者皆在其中。 碧云洞　碧云溪 碧云洞、碧云溪，在岳之束，乃郑云叟、罗隐之、翟士端、郑隐此四高士隐居之所也。 郑遨，字云叟，南燕人氏。 高节不屈，弃其妻子，闻华山五鬣松凝脂千岁，能延年却老，至此洞隐居。 天成中，以拾遗语不起，赐号日逍遥先生。 罗隐之，居临江军新淦县玉笋山玉梁观道士。 来居华山，或临水，或登山，一觞一咏，高情自适，天福中，赐号日希夷先生。",
      "translated_text": "**Cloud Terrace Peak**\nCloud Terrace Peak stands to the northeast of the mountain. Its two peaks rise sharply, sheer on all sides, crowned by radiant clouds above and rooted in earth’s veins below. Towering in solitary splendor, it resembles a celestial terrace. Beneath it lies a cavern. Long ago, a man entered this cave and emerged far away at Fangshan, having passed beneath the Yellow River’s bed, where he heard the sound of flowing water.\n\nDuring the reign of Emperor Wu of Zhou, the Daoist Jiao Daoguang dwelt alone on this peak. He abstained from grains, feeding only on mist and cloud essence. Three azure crows would foretell events yet to come. Emperor Wu personally visited the mountain court, leaning from his chamber to inquire of the Dao, and thus established Cloud Terrace Abbey at the valley’s mouth. Later, his disciples Hong Xian and others saw their master, Jiao Daoguang, ride away upon a creature like a qilin, never to return.\n\n**The Trial Chisel Cavern**\nOn the northern face of Cloud Terrace Peak’s northern summit lies the Trial Chisel Cavern, a hundred feet high and unfathomably deep. Beside it stands a stone as hard as iron, its size and shape as though freshly chiseled—this is the cavern where Master Xiyi shed his mortal form.\n\n**White Cloud Peak**\nWhite Cloud Peak rises to the northeast of the mountain. It was the place where Princess Jinxian, sister of Emperor Ming of Tang, cultivated the Dao, naming it White Cloud Abbey. The Eight Immortals Cave, Viewing Peak Pavilion, Upper Bamboo Garden, Lower Bamboo Garden, jujube trees, chestnut groves, flower gardens, medicinal plots, and stone mortars remain there to this day. Beside White Dew Cliff lies the stone cavern of the Perfected Jiao.\n\n**White Ram Peak**\nWhite Ram Peak stands five *li* northwest of the mountain. Its layered cliffs gleam bright, its grottoes vast and misty. On the three Primes, the eight festivals, and all fasting days, divine lamps—sometimes three, sometimes five—appear upon the rock walls. Once, a recluse dwelt upon this peak, his name and surname unknown. He often rode a white ram through the mortal world. Later, he and his disciple Jie Dan ascended together as immortals, and so he was called the Perfected of the White Ram. The Perfected left behind his *Prohibitions of the Mountain* and seventy talismans for subduing tigers, leopards, wolves, and bears, which circulate in the world.\n\n**Pine and Cypress Peak, Dawn Peak, Jade Pillar Peak, Jade Beauty Peak**\nThese four peaks are covered entirely in verdant pines and cypresses, perpetually veiled in clouds of strange hues. Their emerald summits rise in solitary grandeur, seldom trodden by human feet.\n\n**Cavern of Master Jiao**\nThe Cavern of Master Jiao lies to the southeast of the mountain. The Perfected was surnamed Jiao, styled Xiaolong, a native of Hebei. He often consumed white stones, sometimes sharing them with guests, their taste like taro. Once, a wildfire burned his hermitage. When people from neighboring peaks came to see, they found the master seated calmly amid the flames. Though the hut was reduced to ashes, he rose unhurriedly, his robes untouched by scorching. Years later, when a great snow fell, he vanished. Suddenly, he appeared beyond the snow, clad in a single unlined garment, his complexion radiant as though it were summer. Some saw him as old, others as young—even now, some claim to encounter him.\n\n**Divine Soil Cliff, Immortal Oil Slope, Evasion of Summons Cliff**\nDivine Soil Cliff lies a hundred paces southeast of Cloud Terrace. When Jiao Daoguang concentrated his thoughts to build halls and corridors, divine soil welled forth from the stone. Though used without end, it ever renewed itself—so it remains today.\n\nImmortal Oil Slope lies within the cliff face of Cloud Terrace Peak. Whenever Jiao Daoguang held vegetarian feasts or Daoist rites, oil descended from heaven upon this slope. After he rode the qilin away, the oil was seen no more.\n\nEvasion of Summons Cliff lies southwest of Mount Hua. Here, recluses and fugitives of old concealed themselves to evade imperial decrees.\n\n**White Deer Shelter**\nWhite Deer Shelter stands to the east of the mountain, on the right of the path ascending the peak. It was established by the immortal Lu Nüsheng. A flying spring drips within the shelter.\n\nLu Nüsheng was an ancient immortal of Mount Hua who attained the Dao. She dwelt upon the mountain for two hundred years, her whereabouts unknown. Then, one day, she appeared before the mountain shrine, riding a white deer, accompanied by ten jade maidens. She bade farewell to the people and departed.\n\n**Grotto of the Supreme Ultimate and All Immortals**\nThe Grotto of the Supreme Ultimate and All Immortals lies within the western cliff of Maiden of Fur Peak. Floating above is the cavern called the Grotto of the Supreme Ultimate and All Immortals, and below it lies Carriage Box Pool.\n\n**Three Caverns of Wang and Diao**\nThe Three Caverns of Wang and Diao lie to the east of the mountain. The immortal Wang Yao, styled Boliao, was a native of Poyang. Though married, he had no children. He was skilled in healing, curing all ailments without rituals, talismans, acupuncture, or medicine. When malevolent spirits caused mischief, he would draw a prison on the ground, strike a stone, and summon them—foxes, weasels, and serpents would appear, and he would slay and burn them.\n\nThe Perfected Wang had a bamboo basket, which his disciple Qian Ge carried with a nine-jointed bamboo staff for over a decade, never once seeing it opened. When he encountered Daoist adepts, he remained unassuming, and at night, torches would light his way. Later, he came to this cavern, where he found his friend Diao Ziran. Wang opened the bamboo basket and took out three five-tongued bamboo flutes. The three played together, and when Wang Yao departed, Diao Ziran said, “You should return soon. Do not linger long in the mortal world. We shall meet again in this cavern.” Later, Wang, Diao, and Qian Ge all ascended as immortals.\n\nThe upper cavern remains inaccessible. The middle cavern is barred by a flying stone at its entrance. The lower cavern is where recluses dwell.\n\n**Azure Cloud Cavern and Azure Cloud Stream**\nAzure Cloud Cavern and Azure Cloud Stream lie to the east of the mountain. They were the secluded abodes of four lofty recluses: Zheng Ao, Luo Yinzhi, Zhai Shiduan, and Zheng Yin.\n\nZheng Ao, styled Yun Sou, was a native of Southern Yan. Of unyielding integrity, he abandoned his wife and children. Hearing that the five-needled pines of Mount Hua, with their resin like congealed fat, could extend life and reverse aging, he came to this cavern to dwell in seclusion. During the Tiancheng era, when summoned to court as Reminder, he refused to rise, and was granted the title Master Carefree.\n\nLuo Yinzhi was a Daoist of Jade Beam Abbey on Jade Bamboo Mountain in Xingan County, Linjiang Prefecture. He came to dwell on Mount Hua, sometimes by the water, sometimes upon the peaks, drinking wine and composing poetry, his lofty spirit at ease. During the Tianfu era, he was granted the title Master Xiyi.",
      "overlap_context": "n, named Yujian, was a palace woman of Qin Shihuang. Witnessing the fall of the dynasty, she took up her zither and retreated to this peak on Mount Hua to live in seclusion. She ate pine seeds and leaves, drank from mountain springs, and her body grew green fur. The world named her the \"Maiden of Fur\" after the place where she was seen, and to this day, the sound of zither music lingers in the cave. A Daoist once beheld this grotto. Below the peak stands White Stone Temple, long since abandoned.",
      "start_char": 5248,
      "end_char": 6538,
      "start_sentence": 218,
      "end_sentence": 273,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.470709800720215,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\西岳华山志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "翟士端，字表正，齐人也。 博通九经，祥符中，真宗幸汾阴，礼召不起，无疾而逝。 七日肢体犹温，及火之，有声如雷，五、色一光炳耀。 郑隐l 字明处，兑之奉符人也。 左臂上、有黑鹰子，如北斗状，常居王刁三洞口，自冬涉春不出，人异之。 祥符中，真宗祀后土，还驻跸驿，下韶行在，赐号贞晦先尖又赐《 归山书方岳中逸士本藏名，常咏琴樽适性情。 尽个临流看水色，有时隐几听松声。 遍游万壑成嘉遁，偶出千峰饭治平。 谈希夷，究玄默。 沃予心，号无极。 辞城阙，归山林。 乐尔志，号何深已薄纷华号存素音好，将昤啸号畅冲襟。 壶公石室 壶公石室,在岳之西北孤峰上，有石室可容十余人，有泉。 东北入雾市谷，东谷中即后魏道士寇谦之等场，西谷中修羊公石榻穿之所。 壶公者，莫知姓名，常悬空壶於座上，日入之后，辄跳入壶中。 费长房从之学，令住此石室中，有一方石，广丈余，壶公以茅绳击之，悬於空中，令长房坐外石下，使诸蛇虫竟来唱绳，绳欲断而长房坐卧自若，终无惧也。 公至怃之日：子可教矣。 赐子为地上主者，今令乘竹杖而归，后至葛陂，投於陂中，竹化龙而去。 得役鬼魅之卫。 三公山石室 三公山，在岳之东南，有三峰疑然各秀，上象三台，副此列岳，故号三公。 燕济，字子微，汉明帝时人也。 隐此石室，服木黄精，恒散发，亦有练巾，惟月朔节乃着之。 时复一琴一咏，常有黄白云覆其上，后辞别交友，乘云而去。 长春石室 长春石室，在云台山侧。 大唐贞观中，有道士杜怀谦居此石室，断谷不食，好吹长笛，令人多买笛，至於隅一吹之，投於岩下，笛尽，更供岩中，累月不动，自号长春先生。 今石室疑然，笛声不绝。 修羊公石榻 石榻，在岳之西北仙谷中，石室有石榻，修羊公常外於其石榻上，尽穿陷。 常不食，见汉景帝，问曰：公有何能？ 公不答，即化石羊，题其背有字云：修羊公谢天子。 后置石羊於通灵台，羊又去，不知所之。 外仙平 外仙平，在张超谷内。 有一石室所，张超真人蜕骨之室，为樵牧嬉戏於其问，有飞石自空来塞其穴，今只称外仙平也。 种药平 种药平，王晖真人常饵苍木黄精，有驱虎豹之术，每种黄精，即驾虎豹为耕耘，常乘虎豹，其鞯辔之属，竹杖策之，威如人乘骡马之状。 常韵九字诗百余言，人莫解其意。 后乃升天，不复见之。",
      "translated_text": "Zhai Shiduan, styled Biaozheng, was a native of Qi. Well-versed in the Nine Classics, during the Xiangfu era, when Emperor Zhenzong visited Fenyin, he was summoned to court but did not rise. Without illness, he passed away; seven days later, his limbs remained warm. When cremated, a sound like thunder erupted, and a five-colored radiance blazed forth.\n\nZheng Yin, styled Mingchu, was a native of Fengfu in Dui. Upon his left arm was a black mole shaped like the Northern Dipper. He dwelled at the mouth of Wang Diao’s Three Caverns, never emerging from winter into spring, and people marveled at him. During the Xiangfu era, when Emperor Zhenzong offered sacrifices to the Earth Goddess and halted at the post station, an imperial edict was issued at the temporary palace, granting him the title Master Zhenhui. The emperor also bestowed upon him *The Return-to-the-Mountain Writ*, among the recluses of the Five Peaks. He often played the zither and raised his cup to suit his mood, reciting:\n\n> By flowing streams I watch the water’s hue,\n> At times I lean in stillness, listening to the pines.\n> Through ten thousand ravines I wander, a joyful recluse,\n> Amid a thousand peaks I dine, in perfect peace.\n>\n> I discourse on the subtle, delve into the profound,\n> Nourishing my heart, I am called the Boundless.\n> I leave the palace gates, return to mountain and forest,\n> Rejoicing in your will—how deep your resolve!\n>\n> I scorn the fleeting splendor, cherish purity’s tone,\n> With song and whistle, my carefree heart expands.\n\n**Hugong’s Stone Chamber**\nHugong’s Stone Chamber stands atop a solitary peak in the northwest of the mountain, with a cavern large enough for over ten people and a spring within. To the northeast lies Wushi Valley, where the Eastern Valley holds the former grounds of the Northern Wei Daoist Kou Qianzhi, and the Western Valley contains the pierced stone couch of Master Xiuyang.\n\nHugong’s name and origins were unknown. He often suspended an empty gourd above his seat, and after sunset, he would leap into it. Fei Zhangfang studied under him and was made to dwell in this stone chamber. There was a square stone over a *zhang* wide; Hugong struck it with a straw rope and hung it in midair, then had Zhangfang sit beneath the outer stone while serpents and insects swarmed to gnaw at the rope. Though the rope nearly snapped, Zhangfang remained unperturbed, showing no fear. Hugong sighed in admiration: \"You are teachable.\" He bestowed upon him the title Earthly Overseer and bade him ride a bamboo staff home. Later, upon reaching Ge Marsh, Zhangfang cast the staff into the water, where it transformed into a dragon and departed. He gained the power to command ghosts and spirits.\n\n**The Three Lords’ Mountain Stone Chamber**\nThe Three Lords’ Mountain lies to the southeast of the peak, its three towering summits each distinct, resembling the Three Terraces. Thus, it is called the Three Lords. Yan Ji, styled Ziwei, lived during the reign of Emperor Ming of Han. He dwelled in this stone chamber, consuming pine resin and yellow essence, his hair always unbound, save for a silk kerchief worn only on the first day of the month and festival days. At times, he played the zither and chanted poetry, and yellow and white clouds often shrouded him. Later, he bid farewell to his friends and departed upon a cloud.\n\n**Changchun Stone Chamber**\nThe Changchun Stone Chamber lies beside Cloud Terrace Mountain. During the Zhenguan era of the Great Tang, the Daoist Du Huaiqian resided here. He abstained from grain and never ate, delighting in playing the long flute. He had many flutes purchased, and after playing each to its end, he would cast it into the ravine below. When his flutes were exhausted, more would be supplied from the ravine, and for months he remained unmoved. He styled himself Master Changchun. Today, the stone chamber still stands, and the sound of flutes lingers unceasingly.\n\n**Master Xiuyang’s Stone Couch**\nThe stone couch lies within the Immortal’s Valley to the northwest of the mountain. In the stone chamber was a stone couch, upon which Master Xiuyang often lay, wearing it through. He never ate, and when Emperor Jing of Han asked, \"What skills do you possess?\" he did not answer but transformed into a stone sheep. Upon its back were inscribed the words: *Master Xiuyang thanks the Son of Heaven.* Later, the stone sheep was placed in the Tongling Terrace, but it vanished, its whereabouts unknown.\n\n**Outer Immortal’s Flat**\nOuter Immortal’s Flat lies within Zhang Chao Valley. There is a stone chamber where the True Man Zhang Chao shed his mortal form. As woodcutters and herders played nearby, a flying stone descended from the sky to seal the entrance. Today, it is known only as Outer Immortal’s Flat.\n\n**Herb-Planting Flat**\nHerb-Planting Flat was where the True Man Wang Hui often consumed pine resin and yellow essence. He possessed the art of commanding tigers and leopards, and whenever he planted yellow essence, he would harness them to plow and weed. He often rode tigers and leopards, guiding them with bamboo reins and a staff, his authority like that of a man riding a mule or horse. He frequently chanted a nine-character poem of over a hundred lines, the meaning of which no one could fathom. Later, he ascended to heaven and was seen no more.",
      "overlap_context": "and reverse aging, he came to this cavern to dwell in seclusion. During the Tiancheng era, when summoned to court as Reminder, he refused to rise, and was granted the title Master Carefree.\n\nLuo Yinzhi was a Daoist of Jade Beam Abbey on Jade Bamboo Mountain in Xingan County, Linjiang Prefecture. He came to dwell on Mount Hua, sometimes by the water, sometimes upon the peaks, drinking wine and composing poetry, his lofty spirit at ease. During the Tianfu era, he was granted the title Master Xiyi.",
      "start_char": 6538,
      "end_char": 7461,
      "start_sentence": 274,
      "end_sentence": 314,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.425546169281006,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\西岳华山志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "醴泉　玉泉 醴泉，在古庵直下，其水微有酒香醇味，为国之瑞，屡招凤饮，傍有玉女神祠。 玉泉，在张超谷口，其水色如浆，因此置玉泉院。 二泉皆腹浆玉髓，人久服之，可去沉病也。 黄龙潭 黄龙潭，在神谷口。 祈雨感应，神封广润侯。 车箱潭 车箱潭，在仙谷裹一十里，乃太极总仙洞直下。 宋仁宗皇帝明道年，每岁朝廷遣使投金龙玉简。 宋徽宗皇帝崇宁二年，奉劫封为丰润侯。 按《水府记》云：天下一十八处水府，华山车箱潭乃第七水府也。 与东海P南海、温江同即投金龙一简之处也。 驾鹤轩 驾鹤轩，在中方半路，乃金仙公主成道乘鹤升天之处也。 神姑林 神姑林，在黄神谷内。 次东有独坐姑姑庙，其林合围，松桧数万根，禁人樵采。 古梧行 古梧行，晋太康九年，太守魏君实来去西岳古庙，道栽杠不知其几千根也。 两傍烽堠以千字文为号，禁人牧放樵采。 无忧树 无忧树者，陈希夷先生庵傍之树也。 先生姓陈名搏，字图南，道号扶摇先生，亳州真源人也。 唐长兴中，举进士不第，因肆意山水，后之华山云台观古基，辟刑榛而居之。",
      "translated_text": "**Liquor Spring and Jade Spring**\nLiquor Spring lies directly below the Ancient Hermitage. Its waters bear a faint fragrance and mellow taste of wine, a national auspice that has repeatedly summoned phoenixes to drink. Beside it stands the shrine of the Jade Maiden. Jade Spring is situated at the mouth of Zhang Chao Valley; its waters are the color of cream, and thus the Jade Spring Abbey was established. Both springs brim with the essence of jade marrow, and those who drink them for long may cure deep-seated illnesses.\n\n**Yellow Dragon Pool**\nYellow Dragon Pool lies at the mouth of Divine Valley. When prayers for rain are answered, the spirit is enfeoffed as the Marquis of Abundant Moisture.\n\n**Chariot Box Pool**\nChariot Box Pool lies ten *li* within Immortal Valley, directly below the Cave of the Supreme Polarity and Assembly of Immortals. During the *Mingdao* era of Emperor Renzong of Song, the imperial court dispatched envoys each year to cast golden dragons and jade tablets into its depths. In the second year of *Chongning* under Emperor Huizong of Song, it was granted the title of Marquis of Bountiful Moisture by imperial decree. According to the *Record of the Water Palaces*, of the eighteen water palaces under heaven, Mount Hua’s Chariot Box Pool ranks as the seventh. It shares with the East Sea, South Sea, and Wen River the honor of receiving golden dragon tablets.\n\n**Crane-Chariot Pavilion**\nCrane-Chariot Pavilion stands halfway up the Central Peak, where the Golden Immortal Princess attained the Dao and ascended to heaven riding a crane.\n\n**Divine Maiden Grove**\nDivine Maiden Grove lies within Yellow Spirit Valley. To its east stands the Solitary Seated Maiden Shrine. The grove’s trees, numbering tens of thousands of pines and cypresses, form a dense canopy, and felling or gathering is forbidden.\n\n**Ancient Wutong Avenue**\nIn the ninth year of *Taikang* under the Jin, Prefect Wei Junshi journeyed to the ancient shrine of the Western Peak. Along the path, wutong trees were planted in such numbers that none could count them. Beacon towers lined both sides, marked with characters from the *Thousand-Character Classic*, and grazing or gathering was prohibited.\n\n**Tree of No Sorrow**\nThe Tree of No Sorrow stands beside the hermitage of Master Chen Tuan. The master, surnamed Chen and named Bo, styled himself Tunan, with the Daoist name Master Fuyao, was a native of Zhenyuan in Bozhou. During the *Changxing* era of the Tang, he sat for the imperial examinations but failed. Thereafter, he roamed mountains and rivers at will. Later, he came to the ancient site of Cloud Terrace Abbey on Mount Hua, cleared the brambles, and made his dwelling there.",
      "overlap_context": "he True Man Wang Hui often consumed pine resin and yellow essence. He possessed the art of commanding tigers and leopards, and whenever he planted yellow essence, he would harness them to plow and weed. He often rode tigers and leopards, guiding them with bamboo reins and a staff, his authority like that of a man riding a mule or horse. He frequently chanted a nine-character poem of over a hundred lines, the meaning of which no one could fathom. Later, he ascended to heaven and was seen no more.",
      "start_char": 7462,
      "end_char": 7917,
      "start_sentence": 315,
      "end_sentence": 339,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.163049221038818,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\西岳华山志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "语人祸福，若合符节。 后柴世宗召见，留禁中月余，拜谏议大夫，固辞不受，赐号白云先生。 至宋太宗诏，方赴召，服华阳巾，草履垂绦，以宾客礼见延英殿，赐坐，问之久，赐号希夷先生。 有《指玄篇》、《钓潭集》、《超苦海诗》、《入室还丹诀》、《三峰寓言》行於世。 上方白云宫　中方太清官　下方 云台宫今即观也　西岳真君殿　华 岳观　鹿圈观　拱极观　太平兴 国观　王母观　仙宫观　休根院 臣灵神祠　兰石院 上方、中方、下方，此三宫皆因羽人焦道广兴建。 唐玄宗天宝中，命右补阙集贤学士卫包撰《修三方记》。 西岳真君庙，崇宁年，改为崇宁万寿观，绍兴年，政报恩广孝观．； 阜昌年，改为迎祥观。 昔可马温公奏天下建置五岳真君，给赐金牌，永镇洞天福地。 华岳观，汉武帝修建，后至祥符中，因四高士而复兴也。 鹿圈观，元在竹谷岭西，於大观中，因道士仇润之请额，修建於华山之下也。 拱极观，宣和年修建於岳前社。 太平兴国观，元在关谷内，绍兴年，因道士焦虚请额，修建於华山之下。 王母观，元在大罗峰下，古有庙焉。 至唐贞观中，修建华山之下。 仙官观，金仙公主所居之官，乘鹤之后，劫修为仙官观。 休根院，在相行内，太平兴国年，太宗绍兴休根道者赴阙，赐经一藏及还山诗，赐号岩静大师。 有《休根诗》三百章； 盛传於世。 兰石院，废已久，惟存巨灵神祠，汉武修建焉。 拜岳坛 拜岳坛，乃汉武帝拜祀之所也。 至唐太宗修为镇岳一灵仙寺，后或名胜会院，或名昭庆寺。 宣泽亭 宣泽亭，宋真宗拜岳坛，在太华驿之侧，太中祥符四年七月二十日，真宗拜岳之所也，仍赐名为宣泽亭，有御制碑龙，首龙座，昔为禁地。 素灵官 按《太平广记·马周传》：华山有素灵宫，有仙王，乃总天洞府及十洲三岛神狐之所也。 极真洞天 极真洞天，按《十大洞天记》：第一王屋山小有洞，周迥一万里。 杜甫诗云：藤万里仇池穴，潜通小有天。 第四华山西玄洞，周回三千里，名极真洞天。 其洞．中天地高大，日月、星辰、风云、草木与外无异，惟日月停轮耀赫，朗接太空，乃长春之境也。 宫阙楼台，尽是金玉七宝所成，傍生紫林、芳花，玉髓、金律，并洞天之景也。 素灵真人钻极真洞天颂日：异果奇花不可名，寻真何用到蓬瀛。 碧云天地洞中列，白玉楼台象外生。 万壑芝兰盘峭拔，千峰岚霭耸峥嵘。 八公曾此分金掖，服尽全家上太清。 总仙洞天 按《三十六小洞天记》云：第一霍童山洞，周回三千里，名霍林洞天。 第二东岳泰山洞，周回三千里，名蓬玄洞天。 第三西岳华山洞，周回三百里，名总仙洞天。 素灵真人赞日：坠石为仙号七星，五门日月配玄程。 云飞雨散天中去，管得林峦生异名。 华山之神封金天王懿号册 册金天王顺圣帝：华山之神，能兴云致雨，而西方为最贵矣。 轩辕黄帝游焉，以会神，虞舜望焉以觐群后，爰因夏氏，以迄隋室朝，更五姓，载历三千，杞典相因，旧章未改。 坛场庙宇，何代不修，一梼三祀，无岁而缺，所以报生植，事灵神，未尝有息也。 其神祉休明，灾淫慝亦未尝绝也。 神之祠在黄神谷口，汉兴光初迁於官道北，建立官殿，庭祀事牲器，视三公之礼焉。",
      "translated_text": "He foretold fortunes and misfortunes with such precision that they matched as if tallying tokens. Later, Emperor Chai Shizong of the Later Zhou summoned him to court, detaining him within the palace for over a month. He was appointed Remonstrance Grand Master but firmly declined the post, and was bestowed the title Master of White Clouds. When Emperor Taizong of the Song issued his summons, Master Chen finally answered, donning a Huayang cap, straw sandals with dangling ribbons. He was received in the Yan Ying Hall with the courtesy due a distinguished guest, granted a seat, and engaged in prolonged conversation. The emperor then conferred upon him the title Master of Rare Serenity. His works, including *The Pointer of the Mysterious*, *The Fishing Pond Collection*, *Poems Crossing the Sea of Suffering*, *The Alchemical Formula for Entering the Chamber and Returning to the Elixir*, and *Parables of the Three Peaks*, circulated in the world.\n\n**Upper Palace:** White Cloud Abbey\n**Middle Palace:** Supreme Clarity Abbey\n**Lower Palace:** Cloud Terrace Abbey (now the present-day abbey)\n**Western Peak Perfected Lord’s Hall**\n**Mount Hua Abbey**\n**Deer Enclosure Abbey**\n**Polaris-Welcoming Abbey**\n**Taiping Xingguo Abbey**\n**Queen Mother Abbey**\n**Immortal Palace Abbey**\n**Resting Root Cloister**\n**Spirit Shrine of the Ministerial Divinity**\n**Orchid-Stone Cloister**\n\nThe Upper, Middle, and Lower Palaces were all established by the Daoist adept Jiao Daoguang. During the *Tianbao* era of Emperor Xuanzong of the Tang, the Right Rectifier of Omissions and Academician of the Jixian Institute, Wei Bao, was commissioned to compose *Records of the Three Palaces’ Restoration*.\n\nThe Western Peak Perfected Lord’s Temple was renamed Chongning Wanshou Abbey during the *Chongning* era, then Baoxiao Guangxiao Abbey in the *Shaoxing* era, and later Yingxiang Abbey in the *Fuchang* era. Formerly, Minister Sima Guang memorialized the throne to establish Perfected Lords of the Five Peaks across the realm, bestowing upon them golden tablets to eternally guard the grotto-heavens and blessed lands.\n\nMount Hua Abbey was constructed by Emperor Wu of the Han. Later, during the *Xiangfu* era, it was revived in honor of the Four Eminent Recluses. Deer Enclosure Abbey originally stood west of Bamboo Valley Ridge but was relocated to the foot of Mount Hua during the *Daguan* era at the request of the Daoist Qiu Run. Polaris-Welcoming Abbey was built at the foot of the mountain during the *Xuanhe* era. Taiping Xingguo Abbey, originally within Pass Valley, was relocated to the foot of Mount Hua during the *Shaoxing* era at the request of the Daoist Jiao Xu. Queen Mother Abbey once stood beneath Great Luo Peak, with an ancient shrine, and was later reconstructed at the foot of Mount Hua during the *Zhenguan* era of the Tang. Immortal Palace Abbey was the residence of Princess Jinxian; after she ascended on a crane, it was repurposed as Immortal Palace Abbey. Resting Root Cloister, located within the Xiangxing district, was established during the *Taiping Xingguo* era when Emperor Taizong summoned the Daoist Resting Root to court, bestowing upon him a complete canon of scriptures and a poem upon his return to the mountain. He was granted the title Great Master of Serene Crags. His *Three Hundred Poems of Resting Root* circulated widely in the world. Orchid-Stone Cloister had long fallen into ruin, leaving only the Shrine of the Giant Spirit, originally constructed by Emperor Wu of the Han.\n\n**Altar of the Mountain Worship**\nThe Altar of the Mountain Worship was the site where Emperor Wu of the Han performed sacrifices. During the reign of Emperor Taizong of the Tang, it was renovated into the Zhenyue Yiling Xian Temple, later known as Sheng Hui Cloister or Zhaoqing Temple.\n\n**Proclamation of Blessings Pavilion**\nThe Proclamation of Blessings Pavilion, where Emperor Zhenzong of the Song worshipped at the mountain altar, stood beside the Taihua Post Station. On the twentieth day of the seventh month in the fourth year of the *Tianxi* era, Emperor Zhenzong performed the rites here and bestowed the name Proclamation of Blessings Pavilion. An imperial stele was erected, its base carved with dragons, and the site was once designated forbidden ground.\n\n**Plain Spirit Abbey**\nAccording to the *Extensive Records of the Taiping Era* in the *Biography of Ma Zhou*: On Mount Hua stood the Plain Spirit Abbey, home to an Immortal King who governed all grotto-heavens, the Ten Continents, and the Three Islands, as well as the divine foxes.\n\n**Grotto-Heaven of Ultimate Perfection**\nAccording to the *Records of the Ten Great Grotto-Heavens*: The first is the Minor Grotto of Mount Wangwu, spanning ten thousand *li* in circumference. As Du Fu’s poem states: *\"Vines span ten thousand *li* to the Chouchi Cavern, / Secretly connecting the Minor Heaven.\"* The fourth is the Western Mystery Grotto of Mount Hua, spanning three thousand *li* in circumference, named the Grotto-Heaven of Ultimate Perfection. Within this grotto, the heavens and earth are vast, with sun, moon, stars, wind, clouds, grasses, and trees no different from the external world—save that the sun and moon pause their wheels, their radiance brilliant, directly illuminating the firmament, creating a realm of eternal spring. Palaces and towers are all fashioned from the seven treasures of gold and jade, surrounded by purple groves and fragrant blossoms, with jade sap and golden stalks, all scenes of the grotto-heaven. The Perfected Plain Spirit composed a hymn for the Grotto-Heaven of Ultimate Perfection:\n\n*\"Exotic fruits and wondrous flowers defy all names; / Why seek the Perfected in Penglai’s isles? / Azure clouds array the heavens within the grotto, / White jade towers rise beyond all semblance. / Myriad ravines of orchids and irises coil through sheer cliffs, / A thousand peaks of mist and haze soar in towering splendor. / The Eight Immortals once divided golden elixirs here, / And after consuming them, the whole family ascended to Supreme Clarity.\"*\n\n**Grotto-Heaven of the Assembly of Immortals**\nAccording to the *Records of the Thirty-Six Lesser Grotto-Heavens*: The first is the Grotto of Mount Huo, spanning three thousand *li* in circumference, named the Grotto-Heaven of Huolin. The second is the Grotto of Mount Tai, spanning three thousand *li* in circumference, named the Grotto-Heaven of Pengxuan. The third is the Grotto of Mount Hua, spanning three hundred *li* in circumference, named the Grotto-Heaven of the Assembly of Immortals. The Perfected Plain Spirit praised it thus:\n\n*\"A fallen stone became an immortal, named the Seven Stars; / Five gates align with sun and moon along the mysterious path. / Clouds soar and rains scatter, vanishing into the heavens, / Yet still they govern the peaks and ridges, birthing wondrous names.\"*\n\n**The Enfeoffment of Mount Hua’s Deity as the August Emperor of Golden Heaven**\nThe *Register of the August Emperor of Golden Heaven, the Compliantly Sacred*: The deity of Mount Hua commands clouds and summons rain, and among the western peaks, none is more revered. The Yellow Emperor of Xuanyuan journeyed here to convene with the spirits; Emperor Shun gazed upon it to receive the feudal lords. From the Xia dynasty through the Sui, five lineages ruled over three thousand years, their sacrificial rites passed down without alteration. Altars and temples—what era has not restored them? Thrice-yearly sacrifices have never lapsed, for repaying the blessings of life and honoring the divine spirits has never ceased. Though the deity’s blessings are luminous, calamities and malevolence have never been absent.\n\nThe deity’s shrine lies at the mouth of Yellow Spirit Valley. During the *Yongguang* era of the Han, it was relocated north of the official road, where halls and palaces were constructed. Sacrificial rites and vessels were conducted with the same ceremony as those for the Three Dukes.",
      "overlap_context": "ohibited.\n\n**Tree of No Sorrow**\nThe Tree of No Sorrow stands beside the hermitage of Master Chen Tuan. The master, surnamed Chen and named Bo, styled himself Tunan, with the Daoist name Master Fuyao, was a native of Zhenyuan in Bozhou. During the *Changxing* era of the Tang, he sat for the imperial examinations but failed. Thereafter, he roamed mountains and rivers at will. Later, he came to the ancient site of Cloud Terrace Abbey on Mount Hua, cleared the brambles, and made his dwelling there.",
      "start_char": 7917,
      "end_char": 9175,
      "start_sentence": 340,
      "end_sentence": 393,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.92448139190674,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\西岳华山志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "唐先元三年。 西岳华山志竟",
      "translated_text": "In the third year of the *Xianyuan* era of the Tang, *The Record of Mount Hua of the Western Peak* was completed.",
      "overlap_context": "arly sacrifices have never lapsed, for repaying the blessings of life and honoring the divine spirits has never ceased. Though the deity’s blessings are luminous, calamities and malevolence have never been absent.\n\nThe deity’s shrine lies at the mouth of Yellow Spirit Valley. During the *Yongguang* era of the Han, it was relocated north of the official road, where halls and palaces were constructed. Sacrificial rites and vessels were conducted with the same ceremony as those for the Three Dukes.",
      "start_char": 9175,
      "end_char": 9191,
      "start_sentence": 394,
      "end_sentence": 395,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.047724723815918,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\西岳华山志.txt",
        "category": "记传类"
      }
    }
  ]
}