{
  "source_id": "西王母女修正余十则",
  "source_file": "chunked_daozang\\西王母女修正余十则.json",
  "total_chunks": 10,
  "total_original_chars": 6474,
  "total_translated_chars": 36368,
  "total_translation_time": 197.4628176689148,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\西王母女修正余十则.txt",
    "category": "藏外"
  },
  "full_translation": "**The Ten Right Paths for Female Cultivation by the Queen Mother of the West**\n\n**Preface to the Ten Right Paths**\n\nThe Pure Yang Master, having vowed to ferry all beings across the sea of suffering, previously composed the *Annotations on the Scripture of the Nine August Elixirs* as a guiding bridge for men’s immortal cultivation. Yet, unwilling to stand idle while women of innate predispositions and long-held Daoist aspirations lacked true transmission—risking stray paths and descent into ghostly realms—he ascended the Resplendent Radiance Tower on the first day of the tenth lunar month in the *jiwei* year. There, moved by the Unparalleled Immortal Maiden, he earnestly conveyed the oral transmission of the Queen Mother of the West to the Perfected Wei Yuanjun, originally titled *The Great Golden Elixir Formula for Women*. Expounding upon it, he revised it into *Nine Right Paths for Female Cultivation*, still prefaced with the name of the Queen Mother of the West, and appended the *Nine Precepts for Female Perfected* to rectify Daoist mores. Together, these form ten paths, all to be received under the compassionate sanction of the Dao. Those who fail to embody them shall bear the weight of their neglect. The Immortal Maiden exhorted all, for the Dao’s efficacy knows no bounds, yet its foundation begins with these ten paths. Thus, this preface.\n\nThe Unparalleled Perfected Sun Zhenyi declared: Though scriptures for female immortals exist in the world, most are riddled with convoluted and erroneous teachings, leading deluded followers to fabricate and misappropriate, deceiving both themselves and others. Some even guide souls into the abyss of spirits, spreading calamity far and wide. The Dao’s Ancestor, in profound generosity, lamented only their fall into ghostly realms. I, Zhenyi, have long grieved this! Fortunate to receive the Dao Ancestor’s commission to revise and refine, I meticulously collated and expurgated the texts. Adhering strictly to the original *Great Golden Elixir Formula for Women* of the Queen Mother of the West and incorporating the oral transmission of the Mysterious Shadow of the Great Dao by the Divine Mother of Jade Purity, I compiled nine paths and presented them for scrutiny. The Dao is not meant to remain forever hidden, and I was graciously permitted to revise them. Entitled *The Right Paths for Female Cultivation by the Queen Mother of the West*, they are prefaced with the *Nine Precepts for Female Perfected*, forming ten paths in total. I further sought to elucidate their profound mysteries, so that women cultivating the Dao—though the Earthly Way yields no completion—may yet fulfill their destined roles in assisting transformation and nurturing life. They may embody and practice this great Dao, receiving it under the compassionate sanction of the Dao. Henceforth, the female lineage shall not only avoid stray paths but also ascend directly to the celestial palaces. The resurgence of the Dao’s destiny is at hand. With reverent joy, I inscribe this preface at the Resplendent Radiance Tower in Wulin, a testament to my fortune.\n\nRespectfully inscribed by Sun Zhenyi, disciple of the Orthodox Quanzhen Dao, with a hundred bows.\n\n---\n\n**The Ten Right Paths for Female Cultivation by the Queen Mother of the West**\n\n**First Path: Receiving the Nine Precepts**\nIt is said that for female cultivation, one must first receive the Nine Precepts. The precepts state: Unwavering practice yields great benefit; the fruition of precepts spares one the torments of hell, ensures rebirth in a household of the Ten Virtues, inscribes one’s name in the Purple Palace, and ranks one among the immortals. Now, in promulgating the *Right Paths for Female Cultivation*, the *Nine Precepts* shall serve as the first path. The text reads:\n\n1. Be filial, respectful, gentle, and harmonious; speak cautiously and without envy.\n2. Maintain chastity and tranquility; distance yourself from all impure conduct.\n3. Cherish all living beings; be compassionate and abstain from killing.\n4. Be diligent and reverent in ritual and recitation; abstain from meat and wine. Wear plain garments and eschew ornate adornments.\n5. Cultivate your nature and temper your emotions; do not give rise to afflictions.\n6. Do not organize or attend vegetarian feasts.\n7. Do not mistreat servants or slaves.\n8. Do not conceal goodness or broadcast evil.\n\nOnly by upholding these Nine Precepts may one receive and uphold the right paths. For what is promulgated here is most precious and sacred. To transmit or receive without precepts is to profane the celestial treasure. Both giver and receiver shall share in the punishment. Be cautious and solemn.\n\n**[Note: Each of the following paths begins with “It is said,” as the text was recorded by the disciple from the oral transmission of the Queen Mother of the West, akin to the Buddhist sutras’ opening “Thus have I heard” or the Daoist scriptures’ “The Dao declares.” Originally, the Nine Precepts were placed before the first path, preceding texts on purifying the body, speech, and altar. Only after the Patriarch Lü’s revision were the precepts expounded and compiled as the first path, making the Dao’s principle of not transmitting lightly immediately apparent.]**\n\nIt is said: The Second Path of the Right Way for Women’s Cultivation, titled **\"The Original Destiny.\"**\n\nTo speak of women is to speak of yin substance, of the moon’s image. At the ages of thirteen, fourteen, or fifteen, when primordial *qi* is abundant and true blood is full, there exists within yin a single yang—like the moon at its fullest brilliance. But when the celestial waters descend, the primordial *qi* is breached, and true blood flows away. After marriage, should she bear sons or daughters, her primordial *qi* gradually wanes, her true blood steadily depletes. Though each month the menses return, each month they also bring fresh harm. Herein lies the difficulty of a woman’s cultivation.\n\nIf a woman wishes to preserve her destiny and return to the origin, she must seek the method of cultivation. With the method, her progress will be swift. This path is titled **\"The Original Destiny\"** because a woman’s destiny hinges upon the celestial waters. If the celestial waters are not transformed, how can her destiny be preserved? Without this, the return to the origin remains distant—yet the method of cultivation is most precious. Thus, the **\"Nine Precepts\"** form the first path, and **\"The Original Destiny\"** the second, embodying the principle of cultivating nature before destiny. Following this path, the next is titled **\"The Origin of Nature,\"** for the cultivation of nature is precisely what preserves destiny.\n\n**[Note: While the first path was newly compiled by Patriarch Lü, the second through ninth paths were originally edited by the Unwavering Primordial Sovereign and later revised by Patriarch Lü, ensuring clarity. The language is direct to prevent the text from obscuring the meaning and misleading later generations. Readers must not dismiss it as lacking in archaic elegance and doubt its divine authorship. As for the tenth path, it was entirely composed by Patriarch Lü, further elaborating on the principles established thereafter.]**\n\n---\n\nIt is said: The Third Path of the Right Way for Women’s Cultivation, titled **\"The Origin of Nature.\"**\n\nTo speak of women is to speak of water’s nature, of a flower’s essence. In youth, when awareness awakens, she must discipline herself, refrain from idle play, and guard against reckless movement. At this time, a single drop of initial essence resides within the inner gate—like a star, like a pearl—this is the supreme treasure of the prior heavens, concealed above the earthly womb, centered within the yellow court. If, at this time, a woman knows to purify her nature, avoids lewd entertainments, refrains from listening to licentious words, maintains serene conduct, and moves in accordance with inner principles, then this essence will adhere to the celestial nature, becoming the primordial unity, the unchanging crimson pearl, and the celestial waters will not descend.\n\nAlas, most women, ignorant and childlike, delight in motion. Whether in play or in haste, their *qi* stirs, their minds waver, their spirits become disordered, and their true *qi* unstable. Then this celestial treasure, like a star, melts away. Its heat, like fire, forces the gate open and rushes forth—what the world calls the celestial waters. From this point onward, even if she remains chaste and unwed, she is but an ordinary woman. There is no other reason: she does not recognize **\"The Origin of Nature.\"** Those who aspire to cultivation must begin from this lower path.\n\n**[Note: The \"inner gate\" refers to the yin portal. Below, it is also called the \"spring gate\" or \"yin portal,\" hence the gate within the yellow court is termed the \"inner gate.\" Furthermore, the initial essence of destiny, if one does not know stillness, will adhere to the celestial nature and transform into the primordial unity. Ancient sagely women practiced this—Bodhisattvas and Heavenly Consorts are proof. Though the world is not lacking in wise women, alas! Without inner immortal parents or outer sagely teachers and friends, their wisdom leads only to repeated falls.]**\n\n---\n\nIt is said: The Fourth Path of the Right Way for Women’s Cultivation, titled **\"Cultivating the Menses.\"**\n\nOnce the celestial waters have descended, the true *qi* is breached, and the true blood is depleted. Without cultivating the menses, true blood diminishes daily, true *qi* wanes daily. Even with diligent practice, what benefit can there be? The *Book of the Elixir* states: *\"When bamboo is broken, it must be mended with bamboo.\"* What is the method? For those with monthly menses, first sever the Red Dragon. For those without, first restore and then sever. In all cases, begin with the method of encircling greatness.\n\nAt the hours of *zi* and *wu*, sit astride a crane, release all concerns, and knock the teeth seventy-two times to open the lung and transport points. Then, using both nostrils, take thirty-six gentle breaths to circulate the blood and *qi* throughout the body. At this time, fearing leakage of *qi* downward, one must sit firmly, not allowing slackness. Place both hands in a V-shape below the navel and above the gate, directing *qi* backward and upward with intention for thirty-six breaths. Next, raise both hands as if supporting the heavens, focusing the mind on the coccyx, guiding *qi* backward and upward for another thirty-six breaths. Then perform thirty-six slow lifts and thirty-six rapid lifts, until sensing the *qi* at the tailbone stirring with an ascending momentum.\n\nAfter this, lower the hands and place them on the waist, using the shoulders to lift straight upward thirty-six times, until sensing the *qi* at the spine’s pass and lung transport points rising. If there is blockage, clench the teeth tightly, focus the mind on the back of the neck, and lift upward thirty-six times, until the jade pillow and mud pill are unobstructed. Only then, cover the upper lip with the lower lip, applying gentle pressure, so the *qi* from the mud pill descends to the bridge of the nose. At this time, merely rest the tongue on the heavenly bridge without force, focusing the mind on the point where the tongue touches—sweet dew will naturally descend. Then, slightly contract the nostrils, swallow the dew with intention, directing it straight to the vermilion palace. Hold it there briefly, then guide it backward, dividing it left and right to the waist, rotating thirty-six times on each side.\n\nThen guide the intention to divide and direct it toward the navel wheel, rotating thirty-six times to the left and thirty-six times to the right, until the entire abdomen feels unobstructed and at ease. At this moment, the hands remain clasped below the navel and above the gate, with intention simultaneously directing left and right, lifting together thirty-six times—then one senses a single point entering the womb. Here, one should maintain a state of *nearly forgetting yet faintly retaining*, lingering but briefly.\n\nThis outlines the general method of refining the meridians. Within it lies an ineffable, supreme technique, which cannot yet be spoken of—yet it is encompassed by the phrase: *\"abide in stillness and emptiness while observing.\"*\n\n[Note on terminology: The \"womb\" here refers to the *inner gate* (*nei pin*), the mysterious aperture in men. As the *Book of the Elixir* states: *\"Yang is called the mysterious, yin is called the gate.\"* Together, this is what Laozi termed the *\"gate of the mysterious female\"* and what the *Yellow Emperor’s Yin Conduit Classic* calls the *\"wondrous vessel.\"* Whether termed the wondrous vessel, the mysterious aperture, the gate of the female, or the womb—though the names differ, the cavity is one. This passage uses \"womb\" as a metaphor drawn from human affairs to clarify the point, for both the sacred embryo and the ordinary embryo take form here.\n\nAnother note: The phrase *\"not beyond\"* implies there is a subtle principle to be embodied, cautioning against carelessness.]\n\nWhen the womb receives a swirling surge of warm *qi*, the spring gate must be tightly sealed—never relaxed—to savor the blissful subtlety. The greatest danger lies in the arising of thoughts or the slightest attachment, for this will cause the entire body to dissolve into tingling numbness. If this occurs, one must swiftly settle the mind, for here the paths of immortality and mortality diverge.\n\n[This warns against laxity: if the gate is even slightly loosened, the true *qi* will leak away. What follows is even more perilous. At this stage, the gate must produce an extraordinary tingling sensation; with further lifting and sealing, the inner gate will yield an unparalleled delight. Without steadfast composure, the body will dissolve into numbness, slipping into the sea of desire. Even if one then seeks to settle the mind, it may be too late—hence, *\"the paths of immortality and mortality diverge here.\"*\n\nMaster Taixu once said: *\"The method lies in turning the back to Kan (☵) and tasting sweetness—only then can the passions be stilled.\"* Otherwise, the gate will yawn open, and essence will gush forth like a torrent. Alas!]\n\nAt this moment, one must swiftly quiet the mind for an extended time, silently awaiting stillness in the Zi Gong until it settles—this is precisely what Lady Wei Yuan meant by *\"the treasure returns to the Northern Sea, secure and at peace.\"* Yet this remains but a *\"yellow leaf to quiet a child’s cry\"*—take care not to mistake it for the formation of the embryo.\n\n[Note: The \"Sea of Awareness\" is the Southern Sea, and thus this Zi Gong is the Northern Sea, though its position lies north of the Central Ultimate and the Yellow Center—here, front and back define south and north, not above and below. Moreover, Lady Wei Yuan’s verse suffices as proof, so one must silently await stillness in the Zi Gong before ceasing practice. Another note: This method applies even to those whose *Red Dragon* has not yet been severed; when practicing up to and beyond the slaying of the Dragon, one must proceed with utmost stillness—any carelessness will ruin all progress, hence *\"the paths of immortality and mortality diverge here.\"*\n\nFurther note: This stage constitutes the full *\"round reflection\"*—the return to the origin and reversion to the root. When the embryo is formed, the mysterious image is already complete. Yet this is merely the refinement and return of the Five Phases within the microcosm of the body, a minor return and reversion. It may be achieved through daily or hourly practice, as the *Canon of the Elixir* states: *\"one grain returns to one grain\"*—this is that very treasure. Thus, the analogy of the yellow leaf is used for clarity, but the methods of gathering, forging, guiding, and settling it are nothing less than the complete process of the *\"Great Return and Mysterious Reflection.\"* One must grasp this with care and not pass over it recklessly.]\n\nAs for the fifth method in the proper path of female cultivation, it is titled *\"Return and Reversion.\"* It speaks of women in the world—some who reach old age without their bodies being purified, others whose *Dragon* has already been severed by forty-five or forty-six—all of whom should cultivate to return to the original state, just like a maiden. This practice and method are the same as those in the previous four stages, only with the upward and posterior ascent changed to a forward and downward infusion, flowing back into the *\"Stream and Sea.\"*\n\nGather the sweet nectar, swallowing only to retain it at the threshold, never allowing it to descend. Then, with hands, massage the *\"Breast Stream\"*—thirty-six rotations to the left, thirty-six to the right—until this threshold-stream reveals a melting, delightful savor. Next, divide the hands to massage both breasts: thirty-six slow strokes, thirty-six swift strokes, first light then heavy, each performed thirty-six times, totaling one hundred and forty-four. Naturally, one will feel the true *qi* suffusing both chambers and the stream, as cool liquid like a spring wells from the *\"Twin Passes\"* and surges into the *\"Southern Sea.\"* Calm the mind and await it, never permitting the *qi* to disperse into the flanks afterward. Only allow all thoughts to settle in the *\"Central Palace,\"* while refraining entirely from guiding or directing—simply let it disperse of its own accord. One will then feel the whole body profoundly clear and harmonious.\n\nPracticing thus without interruption each day, the weak will gradually grow strong, the frail will gradually become robust, and the aged will gradually regain youth. The face will bloom with color, the breasts will gradually retract like a maiden’s, and within, something will congeal like a peach pit. Within a hundred days, the *\"Heavenly Water\"* will assume the hue of rouge-water. After three days, proceed with the practices of the fourth stage, without the slightest addition or alteration—thus will the *\"Red Dragon\"* be severed once more. Yet only when the *\"Infant Sun and Moon\"* manifest as twin rings is true attainment achieved.\n\n[**Note for Clarity:** The *Daoist Canon* states that even elderly women may still have *\"trust-water,\"* though this is not true menstrual blood but rather the fluids of food and drink, transformed by the *\"ministerial fire\"* of the *qi*-phase and failing to return to the liver and spleen. It may become intestinal bleeding, red discharge, or inverted menstruation—all symptoms of deficiency. Thus, those whose menses have ceased prematurely must first cultivate restoration to a maiden-like state before attempting to sever the *\"Dragon.\"* **Further Note:** The character *\"得见\"* (*de jian*) should be read with the rhyme of *\"现\"* (*xian*), for here *\"见\"* (*jian*) takes the meaning of *\"现\"* (*manifestation*). Only when the mind is still and the body is quiescent can the signs appear. The *\"manifestation\"* (*现*) of *\"若\"* (*ruo*, \"as if\") is the very *\"见\"* (*perception*) of the body. These two characters—*\"见\"* and *\"现\"*—carry both shallow and profound meanings; they must not be read carelessly.]\n\nIf we speak of the sixth principle in the proper path of female cultivation, it is titled *\"The Breasts.\"* This refers to how the breasts connect upward to the fluids of the heart and lungs and downward to the true essences of the Sea of Blood. When the breasts are refined to resemble those of a maiden or a child, this is the female body transformed into the male form. The method of practice does not depart from the fourth and fifth principles.\n\nWomen take blood as their foundation, yet the aim of this principle lies in refining the red to return to the white. However, as the foundation is often deficient, there is the step of refining fluids into blood. To transform fluids into blood, nothing surpasses the method of *\"dew lingering at the palace gate,\"* where the spirit is directed to the twin passes. Within the passes, old stagnant turbid fluids melt naturally and flow like streams into the sea. When the blood returns and life flourishes, the subtle essence of this lies in the fifth principle.\n\nIf one wishes to transform blood back into white, nothing compares to focusing the mind on the *\"stream chambers,\"* clenching the teeth tightly, and intensifying the emptiness and stillness of the heart-mind, so that *qi* naturally returns to the streams and reaches the chambers. Then, using both palms to knead the breasts—first slowly, then swiftly; first gently, then with greater force—perform this one hundred and forty-four times. The *qi* gathers and doubles in vigor. Afterward, withdraw the intent and direct it to the two flanks. Further, guide the *qi* with the eyes, rotating it left and right, completing seventy-two breaths. The *qi* must feel as if warmed by moxibustion.\n\nThe intent should then lead the *qi* in circling the wheel without counting the cycles, until the lower extremity feels as if boiling. Thus, the red transforms into fresh white, which must then be refined into *qi*, piercing the spine, ascending the ridge, crossing the pillow, and penetrating the valley. At this moment, the inner vision reveals the Three Mystic Mountains and the Pure Garden—yet this is not as pure as the tranquil state. One must swiftly engage in *\"forgetting forgetting,\"* suddenly entering the profound darkness of night. Abiding in stillness, over time, the eyes will perceive lightning flashes and thunderous roars, dew descending like rain, the Flower Pool overflowing, swallowing beyond measure. The *qi* descends smoothly to the palace gate and reaches the navel, suffusing the entire body with clarity and harmony. I remain in quiescent observation.\n\nAfter one hundred unbroken days of practice, those with firm breasts will find them as flat as a youth’s; those with hollow breasts will find them as full as walnuts, like a maiden’s. Achieving the form of a youth results from the completion of the white-refining practice; attaining the form of a maiden results from the completion of the red-refining practice.\n\nWithin our tradition, those who have attained verification are not few; among them, one who has composed poetry is Mistress Feng. Her verses may serve as testimony. Her poem reads:\n\n*\"Left sun, right moon—one yin-yang,\nThrough the nose’s pass, the inner work is called ‘moving the Gang.’\nShould you wish yin and yang to return to sun and moon,\nGrasp the true fire and knead the twin chambers.\"*\n\nLet the practitioner take heed.\n\n[**Note:** The \"twin passes\" lie between the spine and the palace behind it. Within these passes are two cavities where the *niye* (muddy fluid) resides—left called *gao*, right called *huang*—places where medicinal power cannot reach and true *qi* does not naturally arrive. The *niye* lodges as a calamity within the body. When Nature creates a person, it establishes these passes to guard the heart, hence the name \"twin passes.\" Though called *ni* (mud) and *ye* (fluid), it is not true fluid but rather a transformation of food and drink, a kind of humor. Borne by *qi*, it spreads through the lungs to moisten the meridians throughout the body—this is its function. When the body’s true *qi* is abundant, the substance is transformed and its uses are boundless. If true *qi* declines, the substance remains untransformed, flowing into the viscera and meridians without causing harm. However, when it encounters extreme yin *qi*, it congeals into *niye*—seemingly essence yet not essence—obstructing the pathways of *qi*. The places where it lingers most are the twin passes and the lower extreme. Of these, the twin passes harbor the greatest harm, for true *qi* does not reach them naturally. Thus, it accumulates like the ice and snow of Kunlun’s yin peaks, enduring the three *fu* (hottest periods) without melting. Though the heart’s *gang* of earth serves as a barrier and guardian, when spirit is vigorous, all is well; when spirit wanes, danger arises. The ancients understood this and devised the secret of \"gathering spirit to warm the passes,\" though it is rarely heard in the world. Only Mistress Feng, who knew and practiced it with verification, recorded it in her poetry—hence its selection here as proof.\n\nYet Mistress Feng’s careful practice and verification relied first upon the secret of \"emptying and stilling the mind.\" Only by emptying and stilling the mind could spirit return and *qi* flourish. Combined with the method of \"channeling the stream and kneading the chambers,\" the *niye* was melted and surged forth from the passes, flowing abundantly to be refined. Thus, the wondrous interplay of presence and absence was achieved!\n\n**Further Note:** The left chamber of the breast connects to the liver, the right to the lungs; the \"stream\" connects to the heart, kidneys, and spleen—hence the need for constant observation. Yet in ordinary times, one need only maintain it with intention, whether conscious or not. For a woman’s life-root is rooted in the heart, corresponding to the middle line of the *Kun* hexagram, which forms *Li* and harbors true fire. Yet blood is born of coolness, and when blood is abundant, spirit is at peace—thus, the emphasis on emptiness and stillness. This is the crucial ground for curing illness, nurturing life, recovering original vitality, and attaining the Dao. The practice of the *Qingjing Jing*’s \"Three Observations\" is most effective here.]\n\n---\n\n**Seventh Rule of the Proper Path for Women’s Cultivation: \"Jade Fluid\"**\n\nThis refers to the man who begins with purity and stillness. When his practice reaches the stage of circulating the river chariot, true essence is preserved in full, not leaking from the mysterious pass. Reversing its flow, it ascends to the crown, where dew descends like rain into the heavenly valley, flowing down to the flower pool—this is also called \"jade fluid.\" Yet when the yin spirit manifests, the hun soul wanders the jade palace, the po soul pays homage to the imperial truth, a halo of light crowns the head, tides surge in the mysterious sea, and echoes resound in the jade purity—this is the true return of the elixir of jade fluid. The ancient perfected ones called it \"the pouring of ghee upon the crown.\"\n\nAs for the jade fluid of women, it is the red dragon’s fluid transformed into the white phoenix’s marrow. Only when this marrow is abundant can one proceed with the reverse flow, avoiding empty practice. Though the method does not depart from the four rules previously shown, its subtleties must follow the six rules. Only thus can its uses be inexhaustible—just as the ancients said:\n\n*\"One grain after another,\nIts use knows no end.\nWhen the true seed is attained,\nThis work must still be pursued with vigor.\"*\n\nYet the means of attaining sufficiency and success all stem from mastering the emptying and stilling of the mind. Let the practitioner take heed.\n\n[**Note:** For this rule, let us cite the self-account of the Immortal Jade Maiden:\n\n*\"In my past practice of returning the elixir, I began by forgetting the person through the method, forgetting the method itself. When the time came, I acted—thus, I forgot the self for the sake of the Dao. From this day onward, I forgot the days, forgot the hours, until one day even heaven and earth vanished. After a long while, I suddenly awoke as if from a dream, listening and seeing in stillness—yet utterly forgetting what the matter was. Only a scorching heat like fire remained, and then there appeared a grease like oil (this was the north pole’s aftermath—the red dragon’s fluid transformed into the white phoenix’s marrow). Boundless and without shore, sometimes sounding, sometimes silent like a reed, now flowing, now stopping, now surging, now spraying—at times suspended like a snow-white ribbon, at times pure like an ice-bound lake. The times were not fixed, nor the places; the eyes were not dazzled, nor the spirit wearied. Yet within this, seeing and hearing could still delude the nature. I then admonished myself: ‘Do not be lured by phenomena.’ Suddenly, I realized: ‘Heaven and earth and I are of one body.’ Turning inward to examine myself, I saw that my body was surely the same. If the principle was thus externally, it must also be thus internally—and if thus internally, then surely thus externally. Thereupon, I turned inward to reflect: I had no self. After abiding in stillness for a long time, the self appeared. Yet when I sought to delve deeper, there was no gate or opening. Suddenly, as if awakening from a dream, I felt within my body—at the lower extreme—a scorching heat like moxibustion, sounds like thunder. Wind and tide arose within, and in an instant, they pierced the gate, ascended the spine, passed the pillow, and reached the valley, pouring forth like sweet dew, then falling from the nose.\"*]\n\nThe Celestial Pond brims with water, so abundant that swallowing cannot keep pace. Yet in less than half a morning, the fluid surges into the Southern Ocean, soon flowing to encircle the waist and coil around the navel, smelting and refining. Heaven and earth share one body—externally so, internally so—truly so indeed. At this moment, I simply followed the ordinary sequence, and upon completion of the work, withdrew.”\n\nSuch was the immortal’s account, purely a transformation of inner cultivation. One can well imagine that in his daily practice, he must have first devoted himself to emptiness and stillness, then proceeded to forgetfulness and forgetting.\n\n*Here, the author appends this passage to affirm the method as a true technique of inner alchemy.*\n\n**On the Proper Path of Female Cultivation, Eighth Principle: \"Embryonic Breathing\"**\n\nEmbryonic breathing is the supreme Dao, the celestial ladder. After a woman completes the Return of the Elixir, her essence and qi become abundant, her body one with that of a man. Without embryonic breathing, the return to emptiness and nothingness would never come.\n\nThis single breath holds boundless efficacy, yet its method of cultivation is most simple. However, not all who practice achieve the same result—great differences arise. Is this determined by the Creator? Even the Creator merely allows things to become what they are.\n\nWhen one first enters stillness to seek the breath at the nose, there is no thought, no deliberation. Morning and evening thus, one day suddenly touches the ancestral aperture, which opens of itself—neither sought nor rejected. The breath and the nose merge in harmony, vast and boundless, dark and unfathomable. One no longer knows whether the ancestral is the self or the self the ancestral. This single breath through the nose is what the ancient sages called *embryonic breathing*.\n\nWithin this aperture, yin and yang, the Five Phases, heaven and earth, and all beings are born. The breath responds to the mechanism of stimulus, naturally forming the six grades of immortals: celestial, aquatic, terrestrial, human, divine, and spectral. The key lies in extreme emptiness and stillness.\n\nThose whose virtue aligns with the True One and cultivate accordingly become Celestial Immortals.\nThose whose virtue aligns with the Mysterious One and cultivate accordingly become Aquatic Immortals.\nThose whose virtue aligns with the Pure One and cultivate accordingly become Terrestrial Immortals.\nThose whose virtue aligns with the Refined One and cultivate accordingly become Human Immortals.\nThe two lesser vehicles, whose virtue aligns with the Passionate One and cultivate accordingly, become either divine (if inclined toward yang) or spectral (if inclined toward yin).\n\nThe attainment of the virtuous cannot be called true immortality. Such differences arise from the mechanism of stimulus and response. Though called heavenly endowment, is it not self-acquired? Practitioners, take heed.\n\n[With reverent attention to this discourse, the art of embryonic respiration is the true supreme Dao, the true ladder to heaven—how could one not strive diligently?]\n\nIf we speak of the ninth principle in the proper path of female cultivation, it is titled *\"Namo.\"* For in the great accomplishment of female practice, none surpasses the Bodhisattva. Through ascetic discipline and devoted cultivation, one attains the realization of the Buddha and Bodhisattvas. The source of this power lies in the two characters *Namo.* Within these two words is concealed a profound mystery. Only by embodying and guarding this body as the Buddha—like a seven-tiered crystal stupa firmly enshrined upon Mount Putuo—can one proceed. Before the stupa stands a Red Child, the leader of the consciousness aggregate, whom the Bodhisattva allows to wander eastward and southward in search, until after fifty-three pilgrimages, he at last meets the Buddha, and the koan is resolved. Then, relying on the Dragon Girl of the Southern Ocean, she offers the wondrous pearl of freedom, which is shielded by the Purple Bamboo Grove. The White Parrot is left to fly up and down at will. Holding the vase of purity, she inserts a willow branch to gather the natural nectar of sweet dew. Seated steadfastly upon Mount Putuo, she employs the *dhāraṇī* method, placing the syllable *Oṃ* upon the ground of true intent, thus securing the supreme treasure within the fish basket. Reciting *Garuḍa-vadha*, she casts all of *sahā* into the Southern Sea, where waves may surge unceasingly—yet she remains in perfect ease, observing the self in self-liberation.\n\nThis great dharma, however, cannot do without the fourth principle of inner work, which must arise moment by moment from the preceding principle. Thus, step by step, one returns to true emptiness and true quiescence. When merit is complete and conduct perfected, one may exchange smiles with the Bodhisattva, serene and at peace as the moon’s reflection. Practitioners, take heed.\n\n[With due caution, this principle wholly transforms function through the mechanism of transformation. It is to be grasped intuitively, not idly discussed. One must only devote oneself earnestly to *Namo*, embodying this body as the Buddha—living, fluid, and unbound by any fixed notion.]\n\nIf we speak of the tenth principle in the proper path of female cultivation, it is titled *\"Vigilance in Endings.\"* For women embody the virtue of *kun*, the way of earth—without achievement, yet ever completing what is begun. Thus, they too should assist in nurturing and transforming under the bright sun of civilization. Yet the work still begins with emptiness and quiescence, costing not a coin nor expending a thread of effort. Seated, one achieves it unseen, while virtue merges with the workings of creation—this is healing the world through one’s very being.\n\nThe practice relies purely on harmonizing the heart with emptiness and stillness. When the breast is calmed to purity, the celestial realm knows peace. When the womb of earth is unobstructed, villages and towns prosper. When the four limbs flow freely, the four barbarian lands are pacified. Thus, when the body is harmonized, the self is at ease; when the self is at ease, the world is governed. The resonance is immediate: a moment of clarity and harmony yields a moment of true virtue. Though no effect is seen, the effect is inherent.\n\nYet one must fear that foundational study remains shallow, the Three Fields unaligned—how can one whose own body is unfulfilled possess the capacity to fulfill the world? The secret lies in morning and evening devotion: when others advance by one, advance by a hundred; when others advance by ten, advance by a thousand. Even the foolish will surely become enlightened. Practitioners, take heed.\n\n[With due reverence: This precept was reissued by the Queen Mother of the West to the entire commandery. The Peerless Primordial Sovereign, in obedience to the oral transmission of the Jade Purity Divine Mother, compiled and refined the lesser methods of past teachings to conclude this final precept. Truly, it is an unparalleled canon since the dawn of creation—Lü Dongbin called it the greatest fortune of the cosmos, and the Primordial Sovereign declared it the rightful revival of the Dao’s destiny. Such profound hopes are placed upon later scholars that any who obtain this text are entreated to exhort one another in its study.]",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "西王母女修正余十则 正余十则序 纯阳子誓渡众生，已有《九皇丹经注》，为男子修仙之津粱。 不忍坐视女子具有夙根、素存道念者不得真传，误入歧途、沦于鬼趣。 乃于已未盂冬朔日临焕彩楼，感不二仙子，诚将西王母口授魏元君真传，原名《女大金丹诀》阐之。 申改女修正途九则，上仍冠以西王母三字，并请颁示女真九戒，以肃道风，共成十则，统沐慈准受授，然元负能身率者。 仙子勉诸，道用无边，而道基还自十则始，是为序。 不二元君孙贞一曰：女真丹书，世岂无有？ 率皆混杂曲说，以致妄徒穿凿附会，自诬诬世。 甚有导堕精灵者，祸流肆蔓。 道祖浑厚，仅以沦入鬼趣慨之。 贞一切痛久矣！ 幸沐道祖委删订鞲，爰雠剔之。 一循西王母女大金丹诀文原本，参增玉清神母口授大道玄影，辑成九则，录呈鉴政。 道不终隐，仰蒙申改。 题曰《西王母女修正途》，冠以女真九戒文，共成十则。 并请发明玄秘，俾知女子修真，地道无成而代有终，原有参赞化育之大道，大可身体而力行之，统沐慈准，便宜受授。 从此女宗，不惟不堕歧途，且易直登天阙。 道运之当重振也，敬立欢忭，拜序子武林焕彩镂，所以志幸也。 全真正宗道孙孙贞一百拜，谨序。 西王母女修正途十则 若曰按女修，应受九戒。 戒律曰：行持不退，大有利益，戒果圆成，不经地狱之苦，生逢十善之家，名登紫府，位列仙班。 今颁女修正途，应以九戒戒文为第一则。 文曰：孝敬柔和，慎言不妒； 贞静持身，离诸秽行； 惜诸物命，慈悯不杀； 礼诵勤慎，断绝荤酒，衣具质素，不事华饰l调摄性情，不生烦恼； 不得效讨斋会，不得虐便奴仆，不得隐善扬恶。 以上九戒能遵，方可受持正途。 盖以所颁，至珍至贸，不戒授受，为亵天宝，授者受者，一体受罚，慎之凛之。 [谨按，全郗则则皆冠“若曰”两字者，文成于述授之手，乃代西王母金口口宣，记者之词。 是犹佛经冠以“如是我闻”，道经冠以“道言”之义。 又按此则则中九戒文，前人取冠于第一则则前，乃在净身、净口、净坛等等文列。 吕祖申正全部，始将戒文加以申说，纂作正文笫一则。 从此道不轻传大义，开门见山矣。 ]",
      "translated_text": "**The Ten Right Paths for Female Cultivation by the Queen Mother of the West**\n\n**Preface to the Ten Right Paths**\n\nThe Pure Yang Master, having vowed to ferry all beings across the sea of suffering, previously composed the *Annotations on the Scripture of the Nine August Elixirs* as a guiding bridge for men’s immortal cultivation. Yet, unwilling to stand idle while women of innate predispositions and long-held Daoist aspirations lacked true transmission—risking stray paths and descent into ghostly realms—he ascended the Resplendent Radiance Tower on the first day of the tenth lunar month in the *jiwei* year. There, moved by the Unparalleled Immortal Maiden, he earnestly conveyed the oral transmission of the Queen Mother of the West to the Perfected Wei Yuanjun, originally titled *The Great Golden Elixir Formula for Women*. Expounding upon it, he revised it into *Nine Right Paths for Female Cultivation*, still prefaced with the name of the Queen Mother of the West, and appended the *Nine Precepts for Female Perfected* to rectify Daoist mores. Together, these form ten paths, all to be received under the compassionate sanction of the Dao. Those who fail to embody them shall bear the weight of their neglect. The Immortal Maiden exhorted all, for the Dao’s efficacy knows no bounds, yet its foundation begins with these ten paths. Thus, this preface.\n\nThe Unparalleled Perfected Sun Zhenyi declared: Though scriptures for female immortals exist in the world, most are riddled with convoluted and erroneous teachings, leading deluded followers to fabricate and misappropriate, deceiving both themselves and others. Some even guide souls into the abyss of spirits, spreading calamity far and wide. The Dao’s Ancestor, in profound generosity, lamented only their fall into ghostly realms. I, Zhenyi, have long grieved this! Fortunate to receive the Dao Ancestor’s commission to revise and refine, I meticulously collated and expurgated the texts. Adhering strictly to the original *Great Golden Elixir Formula for Women* of the Queen Mother of the West and incorporating the oral transmission of the Mysterious Shadow of the Great Dao by the Divine Mother of Jade Purity, I compiled nine paths and presented them for scrutiny. The Dao is not meant to remain forever hidden, and I was graciously permitted to revise them. Entitled *The Right Paths for Female Cultivation by the Queen Mother of the West*, they are prefaced with the *Nine Precepts for Female Perfected*, forming ten paths in total. I further sought to elucidate their profound mysteries, so that women cultivating the Dao—though the Earthly Way yields no completion—may yet fulfill their destined roles in assisting transformation and nurturing life. They may embody and practice this great Dao, receiving it under the compassionate sanction of the Dao. Henceforth, the female lineage shall not only avoid stray paths but also ascend directly to the celestial palaces. The resurgence of the Dao’s destiny is at hand. With reverent joy, I inscribe this preface at the Resplendent Radiance Tower in Wulin, a testament to my fortune.\n\nRespectfully inscribed by Sun Zhenyi, disciple of the Orthodox Quanzhen Dao, with a hundred bows.\n\n---\n\n**The Ten Right Paths for Female Cultivation by the Queen Mother of the West**\n\n**First Path: Receiving the Nine Precepts**\nIt is said that for female cultivation, one must first receive the Nine Precepts. The precepts state: Unwavering practice yields great benefit; the fruition of precepts spares one the torments of hell, ensures rebirth in a household of the Ten Virtues, inscribes one’s name in the Purple Palace, and ranks one among the immortals. Now, in promulgating the *Right Paths for Female Cultivation*, the *Nine Precepts* shall serve as the first path. The text reads:\n\n1. Be filial, respectful, gentle, and harmonious; speak cautiously and without envy.\n2. Maintain chastity and tranquility; distance yourself from all impure conduct.\n3. Cherish all living beings; be compassionate and abstain from killing.\n4. Be diligent and reverent in ritual and recitation; abstain from meat and wine. Wear plain garments and eschew ornate adornments.\n5. Cultivate your nature and temper your emotions; do not give rise to afflictions.\n6. Do not organize or attend vegetarian feasts.\n7. Do not mistreat servants or slaves.\n8. Do not conceal goodness or broadcast evil.\n\nOnly by upholding these Nine Precepts may one receive and uphold the right paths. For what is promulgated here is most precious and sacred. To transmit or receive without precepts is to profane the celestial treasure. Both giver and receiver shall share in the punishment. Be cautious and solemn.\n\n**[Note: Each of the following paths begins with “It is said,” as the text was recorded by the disciple from the oral transmission of the Queen Mother of the West, akin to the Buddhist sutras’ opening “Thus have I heard” or the Daoist scriptures’ “The Dao declares.” Originally, the Nine Precepts were placed before the first path, preceding texts on purifying the body, speech, and altar. Only after the Patriarch Lü’s revision were the precepts expounded and compiled as the first path, making the Dao’s principle of not transmitting lightly immediately apparent.]**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 850,
      "start_sentence": 0,
      "end_sentence": 36,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.62330675125122,
      "metadata": {
        "source_file": "dao\\藏外\\西王母女修正余十则.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "若曰女修正途第二则，题曰“本命”。 斋言女子，阴质也，月象也。 当十三、四、五岁时，元炁充足、真血盈满，有阴中之一阳，月圆之光正旺，至天癸一降，元炁道破，真血遂泄。 若到婚嫁之后，或生男女，元炁渐损、真血渐亏，虽月月有信水复生，即月月有信水复伤。 女命难修，在此一着。 女欲保命还元，须寻修诀，得诀以修，功成甚速也。 题曰“本命”者，盖以女命还在天癸。 天癸不化，命何能保？ 还元无日，无如修诀至珍。 故以“九戒”文为第一则，而以“本命”文为第二则。 先性后命之义。 进体此则之下，接曰\"性原\"。 盖言修性，正以保命耳！ ［谨按，全部除去第一则出自吕祖创纂，第二至九则皆属不二元君重订辑成，复经吕祖手正者，意在明显。 故措词从达，恐复因文掩义贻误后人。 见者切勿以文欠古雅，疑非仙笔焉。 至如第十则，全经吕祖纂出，益自申准以后，而续演政者也。 ］ 若曰女修正途第三则，题曰“性原”。 盖言女子，水性也，花质也。 时当年少，知识已开，即宜自饬，毋任戏游，兼戒奔驰。 子斯时也，自有一点初经含于内牝，如星如珠，乃是先天至宝，藏于坤腹之上，位在中黄之中。 女子斯时，若知洁性，不看淫戏，不听淫词，举止幽闲，动循内则，静则释如，则此一物得附性天，便成元一、不变赤珠、不化天癸。 无如凡女无知、童性喜动，或随嬉戏，或逐跳奔，不无气动心摇、精神内乱、真炁不固，则此星星天宝油然融化，其热如火，夺门而下，破扉而出，举世名曰天癸。 际此以后，纵或守贞不字，总是凡女也矣。 此无他，不识“性原”之故。 志欲修还，催自下则修起焉。 ［谨按：内牝即是牝户，以下又有泉扉，亦名牝户，故以中黄之户曰内牝云。 又按：初经命宝，不识知静，则附性天而化元一，古之圣女有行之者,大士、天妃此明证也。 世间不乏慧女，可惜内无仙父母，外无圣师友，千慧千堕，悲夫！ ] 若曰女修正途第四则，题曰“修经”。 盖言女子天癸巳下、真炁巳破、真血已亏，不事修经，真血日少、真炁日亏，纵欲精修，有何益乎？ 《丹书》曰：“竹破须将竹补宜。 ”其诀惟何：“凡有月信者，先斩赤龙； 无月信者，又须先复而再斩。 ”究其起手，皆用周大之法。 于子午二时，跨鹤而坐，万缘放下，叩齿七十二次，以通肺腧二穴； 次用两鼻，微微呼吸三十六次，以通周身血脉。 於斯时也，诚恐炁从下泄，必须跨加劲，毋任放松。 须以两手分叉脐下扉上，以意往后向上而送，约行三十六息； 再以两手作托天，必须分意存在尾闾，导炁后达而升，如是约行三十六息； 再行缓托三十六次、急托三十六次，则自觉尾阊气动，有腾腾上升之机趣。 如是后，可将两手放下，仍叉两腰，加用两肩往上直耸三十六次，则自觉夹脊关、肺腧等地气势动升。 而或有塞阻处，加行咬紧牙关，意存后颈，往上直提三十六次，则自觉玉枕、泥丸皆通矣。 如是后，方用下咀唇包上咀唇，微微着力，则自觉泥丸之气下到鼻中低处。 其时只用舌搭天桥，无须着力，须以意存舌搭之处，甘露自降。 乃于鼻中微带缩法，以意送露咽下，直降绛阙。 存留片晌，方以意导向后退降，须分左右达存两腰，各旋三十六次。",
      "translated_text": "It is said: The Second Path of the Right Way for Women’s Cultivation, titled **\"The Original Destiny.\"**\n\nTo speak of women is to speak of yin substance, of the moon’s image. At the ages of thirteen, fourteen, or fifteen, when primordial *qi* is abundant and true blood is full, there exists within yin a single yang—like the moon at its fullest brilliance. But when the celestial waters descend, the primordial *qi* is breached, and true blood flows away. After marriage, should she bear sons or daughters, her primordial *qi* gradually wanes, her true blood steadily depletes. Though each month the menses return, each month they also bring fresh harm. Herein lies the difficulty of a woman’s cultivation.\n\nIf a woman wishes to preserve her destiny and return to the origin, she must seek the method of cultivation. With the method, her progress will be swift. This path is titled **\"The Original Destiny\"** because a woman’s destiny hinges upon the celestial waters. If the celestial waters are not transformed, how can her destiny be preserved? Without this, the return to the origin remains distant—yet the method of cultivation is most precious. Thus, the **\"Nine Precepts\"** form the first path, and **\"The Original Destiny\"** the second, embodying the principle of cultivating nature before destiny. Following this path, the next is titled **\"The Origin of Nature,\"** for the cultivation of nature is precisely what preserves destiny.\n\n**[Note: While the first path was newly compiled by Patriarch Lü, the second through ninth paths were originally edited by the Unwavering Primordial Sovereign and later revised by Patriarch Lü, ensuring clarity. The language is direct to prevent the text from obscuring the meaning and misleading later generations. Readers must not dismiss it as lacking in archaic elegance and doubt its divine authorship. As for the tenth path, it was entirely composed by Patriarch Lü, further elaborating on the principles established thereafter.]**\n\n---\n\nIt is said: The Third Path of the Right Way for Women’s Cultivation, titled **\"The Origin of Nature.\"**\n\nTo speak of women is to speak of water’s nature, of a flower’s essence. In youth, when awareness awakens, she must discipline herself, refrain from idle play, and guard against reckless movement. At this time, a single drop of initial essence resides within the inner gate—like a star, like a pearl—this is the supreme treasure of the prior heavens, concealed above the earthly womb, centered within the yellow court. If, at this time, a woman knows to purify her nature, avoids lewd entertainments, refrains from listening to licentious words, maintains serene conduct, and moves in accordance with inner principles, then this essence will adhere to the celestial nature, becoming the primordial unity, the unchanging crimson pearl, and the celestial waters will not descend.\n\nAlas, most women, ignorant and childlike, delight in motion. Whether in play or in haste, their *qi* stirs, their minds waver, their spirits become disordered, and their true *qi* unstable. Then this celestial treasure, like a star, melts away. Its heat, like fire, forces the gate open and rushes forth—what the world calls the celestial waters. From this point onward, even if she remains chaste and unwed, she is but an ordinary woman. There is no other reason: she does not recognize **\"The Origin of Nature.\"** Those who aspire to cultivation must begin from this lower path.\n\n**[Note: The \"inner gate\" refers to the yin portal. Below, it is also called the \"spring gate\" or \"yin portal,\" hence the gate within the yellow court is termed the \"inner gate.\" Furthermore, the initial essence of destiny, if one does not know stillness, will adhere to the celestial nature and transform into the primordial unity. Ancient sagely women practiced this—Bodhisattvas and Heavenly Consorts are proof. Though the world is not lacking in wise women, alas! Without inner immortal parents or outer sagely teachers and friends, their wisdom leads only to repeated falls.]**\n\n---\n\nIt is said: The Fourth Path of the Right Way for Women’s Cultivation, titled **\"Cultivating the Menses.\"**\n\nOnce the celestial waters have descended, the true *qi* is breached, and the true blood is depleted. Without cultivating the menses, true blood diminishes daily, true *qi* wanes daily. Even with diligent practice, what benefit can there be? The *Book of the Elixir* states: *\"When bamboo is broken, it must be mended with bamboo.\"* What is the method? For those with monthly menses, first sever the Red Dragon. For those without, first restore and then sever. In all cases, begin with the method of encircling greatness.\n\nAt the hours of *zi* and *wu*, sit astride a crane, release all concerns, and knock the teeth seventy-two times to open the lung and transport points. Then, using both nostrils, take thirty-six gentle breaths to circulate the blood and *qi* throughout the body. At this time, fearing leakage of *qi* downward, one must sit firmly, not allowing slackness. Place both hands in a V-shape below the navel and above the gate, directing *qi* backward and upward with intention for thirty-six breaths. Next, raise both hands as if supporting the heavens, focusing the mind on the coccyx, guiding *qi* backward and upward for another thirty-six breaths. Then perform thirty-six slow lifts and thirty-six rapid lifts, until sensing the *qi* at the tailbone stirring with an ascending momentum.\n\nAfter this, lower the hands and place them on the waist, using the shoulders to lift straight upward thirty-six times, until sensing the *qi* at the spine’s pass and lung transport points rising. If there is blockage, clench the teeth tightly, focus the mind on the back of the neck, and lift upward thirty-six times, until the jade pillow and mud pill are unobstructed. Only then, cover the upper lip with the lower lip, applying gentle pressure, so the *qi* from the mud pill descends to the bridge of the nose. At this time, merely rest the tongue on the heavenly bridge without force, focusing the mind on the point where the tongue touches—sweet dew will naturally descend. Then, slightly contract the nostrils, swallow the dew with intention, directing it straight to the vermilion palace. Hold it there briefly, then guide it backward, dividing it left and right to the waist, rotating thirty-six times on each side.",
      "overlap_context": "e text was recorded by the disciple from the oral transmission of the Queen Mother of the West, akin to the Buddhist sutras’ opening “Thus have I heard” or the Daoist scriptures’ “The Dao declares.” Originally, the Nine Precepts were placed before the first path, preceding texts on purifying the body, speech, and altar. Only after the Patriarch Lü’s revision were the precepts expounded and compiled as the first path, making the Dao’s principle of not transmitting lightly immediately apparent.]**",
      "start_char": 851,
      "end_char": 2087,
      "start_sentence": 37,
      "end_sentence": 85,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.955305576324463,
      "metadata": {
        "source_file": "dao\\藏外\\西王母女修正余十则.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "再以意导分向脐轮，左旋三十六次，右旋三十六次，则自觉满腹通畅。 於斯时也，两手仍叉脐下扉上，以意分导乃是左右同刻，齐提三十六次，则自觉有一点点入子宫，则须若存若忘，片晌而巳。 此是修经之大略，个中尚有无上活法，此时未可言也，然不外夫“寂虚而视”一句云。 [谨按部位，子宫即内牝，盖男子之玄窍。 《丹书》曰：“阳曰玄，阴曰牝。 ”合而言之，是即老子所谓“玄牝之门”、《黄帝阴符经》载之“奇器”也。 曰奇器，曰玄窍、曰牝户、曰子宫，名虽有四，而穴则一穴。 谨按：此则之以子宫言，盖假人事以明之，然可见圣胎、凡胎皆结于此。 又按：“不外夫”句，盖言有消息可体行，使毋大意云尔。 ] 若夫子宫体得一阵热气盘旋，此时泉扉更宜紧闭，莫教放松，得有逸趣。 最忌念起，稍有恋情，便致遍体酥麻，非惟急宜定情，仙凡从此两分。 [言当紧闭，不可大意。 扉闭稍松，真炁扉泄。 下文云云，则更危矣。 盖以其时，扉内必有非凡震痒，再经提闭，则此牝内必得非常逸趣，不加定情，必致遍体酥麻，溜入情海，虽欲定情，恐不及矣。 故曰“仙凡从此两分”。 大师太虚翁曰：“法惟艮背甘，厥情乃定。 ”否则，扉必洞开，精漏若注也矣。 惜哉惜哉]",
      "translated_text": "Then guide the intention to divide and direct it toward the navel wheel, rotating thirty-six times to the left and thirty-six times to the right, until the entire abdomen feels unobstructed and at ease. At this moment, the hands remain clasped below the navel and above the gate, with intention simultaneously directing left and right, lifting together thirty-six times—then one senses a single point entering the womb. Here, one should maintain a state of *nearly forgetting yet faintly retaining*, lingering but briefly.\n\nThis outlines the general method of refining the meridians. Within it lies an ineffable, supreme technique, which cannot yet be spoken of—yet it is encompassed by the phrase: *\"abide in stillness and emptiness while observing.\"*\n\n[Note on terminology: The \"womb\" here refers to the *inner gate* (*nei pin*), the mysterious aperture in men. As the *Book of the Elixir* states: *\"Yang is called the mysterious, yin is called the gate.\"* Together, this is what Laozi termed the *\"gate of the mysterious female\"* and what the *Yellow Emperor’s Yin Conduit Classic* calls the *\"wondrous vessel.\"* Whether termed the wondrous vessel, the mysterious aperture, the gate of the female, or the womb—though the names differ, the cavity is one. This passage uses \"womb\" as a metaphor drawn from human affairs to clarify the point, for both the sacred embryo and the ordinary embryo take form here.\n\nAnother note: The phrase *\"not beyond\"* implies there is a subtle principle to be embodied, cautioning against carelessness.]\n\nWhen the womb receives a swirling surge of warm *qi*, the spring gate must be tightly sealed—never relaxed—to savor the blissful subtlety. The greatest danger lies in the arising of thoughts or the slightest attachment, for this will cause the entire body to dissolve into tingling numbness. If this occurs, one must swiftly settle the mind, for here the paths of immortality and mortality diverge.\n\n[This warns against laxity: if the gate is even slightly loosened, the true *qi* will leak away. What follows is even more perilous. At this stage, the gate must produce an extraordinary tingling sensation; with further lifting and sealing, the inner gate will yield an unparalleled delight. Without steadfast composure, the body will dissolve into numbness, slipping into the sea of desire. Even if one then seeks to settle the mind, it may be too late—hence, *\"the paths of immortality and mortality diverge here.\"*\n\nMaster Taixu once said: *\"The method lies in turning the back to Kan (☵) and tasting sweetness—only then can the passions be stilled.\"* Otherwise, the gate will yawn open, and essence will gush forth like a torrent. Alas!]",
      "overlap_context": "pplying gentle pressure, so the *qi* from the mud pill descends to the bridge of the nose. At this time, merely rest the tongue on the heavenly bridge without force, focusing the mind on the point where the tongue touches—sweet dew will naturally descend. Then, slightly contract the nostrils, swallow the dew with intention, directing it straight to the vermilion palace. Hold it there briefly, then guide it backward, dividing it left and right to the waist, rotating thirty-six times on each side.",
      "start_char": 2087,
      "end_char": 2580,
      "start_sentence": 86,
      "end_sentence": 105,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.342083930969238,
      "metadata": {
        "source_file": "dao\\藏外\\西王母女修正余十则.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "於斯时也，急须息心多时，寂俟子宫安静而己，盖即魏元君“宝归北海安妥妥”也。 虽然，尚是黄叶之止儿啼，切莫认作结胎云。 [谨按：觉海即南海。 则此子宫即北海，而位却在中极中黄之北，炁即《周易》“黄中通理”之处——乃以前后为南北，不以下上为北南也。 况有魏元君句足证乎，故必寂俟子宫安静乃可停功。 窃按此则足有赤龙而修，修至龙斩以后等等功法，大宜静体以行，一卤莽，功尽废，故曰“仙凡从此两分”云。 又按：此则乃是全部圆影，所谓还元返本。 造至结胎，玄景已具。 第是则就一身之天地五行炼而还返之至宝，尚属小还小返，大可日行、时行而得，《丹书》所谓“一粒复一粒”者，是此至宝也。 此则故以黄叶晓之，然于收取煅炼之诀、引归安妥等等处所，乃是完完全全一部大还玄影，大宜体识，切勿卤莽看过。 ] 若曰女修正途第五则，题曰“复还”。 盖言世上女流，有年至老而身未净者，有年仅四十五、六而龙已断者，皆当修致还元，一如处女样。 此功此法，即前四则内之功法也。 但以往上后提者，改为往前下注、流归溪海；",
      "translated_text": "At this moment, one must swiftly quiet the mind for an extended time, silently awaiting stillness in the Zi Gong until it settles—this is precisely what Lady Wei Yuan meant by *\"the treasure returns to the Northern Sea, secure and at peace.\"* Yet this remains but a *\"yellow leaf to quiet a child’s cry\"*—take care not to mistake it for the formation of the embryo.\n\n[Note: The \"Sea of Awareness\" is the Southern Sea, and thus this Zi Gong is the Northern Sea, though its position lies north of the Central Ultimate and the Yellow Center—here, front and back define south and north, not above and below. Moreover, Lady Wei Yuan’s verse suffices as proof, so one must silently await stillness in the Zi Gong before ceasing practice. Another note: This method applies even to those whose *Red Dragon* has not yet been severed; when practicing up to and beyond the slaying of the Dragon, one must proceed with utmost stillness—any carelessness will ruin all progress, hence *\"the paths of immortality and mortality diverge here.\"*\n\nFurther note: This stage constitutes the full *\"round reflection\"*—the return to the origin and reversion to the root. When the embryo is formed, the mysterious image is already complete. Yet this is merely the refinement and return of the Five Phases within the microcosm of the body, a minor return and reversion. It may be achieved through daily or hourly practice, as the *Canon of the Elixir* states: *\"one grain returns to one grain\"*—this is that very treasure. Thus, the analogy of the yellow leaf is used for clarity, but the methods of gathering, forging, guiding, and settling it are nothing less than the complete process of the *\"Great Return and Mysterious Reflection.\"* One must grasp this with care and not pass over it recklessly.]\n\nAs for the fifth method in the proper path of female cultivation, it is titled *\"Return and Reversion.\"* It speaks of women in the world—some who reach old age without their bodies being purified, others whose *Dragon* has already been severed by forty-five or forty-six—all of whom should cultivate to return to the original state, just like a maiden. This practice and method are the same as those in the previous four stages, only with the upward and posterior ascent changed to a forward and downward infusion, flowing back into the *\"Stream and Sea.\"*",
      "overlap_context": "the inner gate will yield an unparalleled delight. Without steadfast composure, the body will dissolve into numbness, slipping into the sea of desire. Even if one then seeks to settle the mind, it may be too late—hence, *\"the paths of immortality and mortality diverge here.\"*\n\nMaster Taixu once said: *\"The method lies in turning the back to Kan (☵) and tasting sweetness—only then can the passions be stilled.\"* Otherwise, the gate will yawn open, and essence will gush forth like a torrent. Alas!]",
      "start_char": 2581,
      "end_char": 3017,
      "start_sentence": 106,
      "end_sentence": 120,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.864149332046509,
      "metadata": {
        "source_file": "dao\\藏外\\西王母女修正余十则.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "应咽甘露，只许咽咽留阙，不许下送。 加用手摩乳溪，左旋三十六，右旋三十六，觉此阙溪现有溶溶趣味； 再加分摩两乳，缓摩三十六，急摩三十六，先轻后重，亦各行三十六，共成百四零四之数，自觉两房及溪之中真炁氤氲，得有凉液如泉出自双关、涌归南海。 息心俟之，毋许心后分注两腰，只许于中宫万缘放下，而却绝不用夫引导等等，随机散布而已，自觉遍体极清极和。 如是行持，一日不间，弱自渐强，衰自渐壮，老者亦渐还少，而面有花色，两乳渐收如处子，中渐结若桃核。 如是百日之内，足得天癸色若胭脂水，三日之后即行四则内功，一毫不加不换，赤龙又自斩矣。 然以得婴日月而现若双环，乃为真得云。 [谨按：《道典》言有年老妇女，尚有信水，水非信水，乃是饮食之津，是经民相火烘而成、不归肝脾之物，或变肠红，或变赤带，或成倒经，皆此物也。 症皆属亏。 故与先期而断同用修复，一如处女样后，方可从事断龙耳！ 又按“得见”见字，当从现韵读，盖此见作现韵读之。 见乃是现兆，惟心寂体，乃可见也。 现若之现，体之即见也。 按此两字，义有浅深，不可卤莽读过。 ]",
      "translated_text": "Gather the sweet nectar, swallowing only to retain it at the threshold, never allowing it to descend. Then, with hands, massage the *\"Breast Stream\"*—thirty-six rotations to the left, thirty-six to the right—until this threshold-stream reveals a melting, delightful savor. Next, divide the hands to massage both breasts: thirty-six slow strokes, thirty-six swift strokes, first light then heavy, each performed thirty-six times, totaling one hundred and forty-four. Naturally, one will feel the true *qi* suffusing both chambers and the stream, as cool liquid like a spring wells from the *\"Twin Passes\"* and surges into the *\"Southern Sea.\"* Calm the mind and await it, never permitting the *qi* to disperse into the flanks afterward. Only allow all thoughts to settle in the *\"Central Palace,\"* while refraining entirely from guiding or directing—simply let it disperse of its own accord. One will then feel the whole body profoundly clear and harmonious.\n\nPracticing thus without interruption each day, the weak will gradually grow strong, the frail will gradually become robust, and the aged will gradually regain youth. The face will bloom with color, the breasts will gradually retract like a maiden’s, and within, something will congeal like a peach pit. Within a hundred days, the *\"Heavenly Water\"* will assume the hue of rouge-water. After three days, proceed with the practices of the fourth stage, without the slightest addition or alteration—thus will the *\"Red Dragon\"* be severed once more. Yet only when the *\"Infant Sun and Moon\"* manifest as twin rings is true attainment achieved.\n\n[**Note for Clarity:** The *Daoist Canon* states that even elderly women may still have *\"trust-water,\"* though this is not true menstrual blood but rather the fluids of food and drink, transformed by the *\"ministerial fire\"* of the *qi*-phase and failing to return to the liver and spleen. It may become intestinal bleeding, red discharge, or inverted menstruation—all symptoms of deficiency. Thus, those whose menses have ceased prematurely must first cultivate restoration to a maiden-like state before attempting to sever the *\"Dragon.\"* **Further Note:** The character *\"得见\"* (*de jian*) should be read with the rhyme of *\"现\"* (*xian*), for here *\"见\"* (*jian*) takes the meaning of *\"现\"* (*manifestation*). Only when the mind is still and the body is quiescent can the signs appear. The *\"manifestation\"* (*现*) of *\"若\"* (*ruo*, \"as if\") is the very *\"见\"* (*perception*) of the body. These two characters—*\"见\"* and *\"现\"*—carry both shallow and profound meanings; they must not be read carelessly.]",
      "overlap_context": "tivation, it is titled *\"Return and Reversion.\"* It speaks of women in the world—some who reach old age without their bodies being purified, others whose *Dragon* has already been severed by forty-five or forty-six—all of whom should cultivate to return to the original state, just like a maiden. This practice and method are the same as those in the previous four stages, only with the upward and posterior ascent changed to a forward and downward infusion, flowing back into the *\"Stream and Sea.\"*",
      "start_char": 3017,
      "end_char": 3465,
      "start_sentence": 121,
      "end_sentence": 135,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.761397123336792,
      "metadata": {
        "source_file": "dao\\藏外\\西王母女修正余十则.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "若曰女修正途第六则，题曰“乳房”。 盖言乳房上通心肺之津液，下澈血海之真汁。 炼得乳房如处女小儿形，便是女换男体。 其功法不外四则五则者。 女子以血为本也，而此则题旨乃在炼赤返白，又患本亏，故有炼液化血一着。 化液成血，莫如露露留阙，神注双关，关内旧积泥液油然熔化而溪归海。 归血生必旺，其中精义乃在第五则内。 若欲化血返白，莫如意注溪房，口齿紧咬，加意虚寂心念，气自归溪达房。 加用两掌分揉两乳，先缓后急，先轻后更，其行百四零四，炁聚倍旺，加意后退，分注两腰。 更以目神分率炁旋左右，共成七十有二息，必得炁烘若灸。 要以意导绕轮，不计其数，必得下极若沸。 则此赤化新白，必自化气，穿闾升脊、逾枕透谷。 斯时内现三山玄圃不如净境，急须从事忘忘，忽又冥冥成夜。 我自寂守，久之，必目得有电掣雷轰，露洒若注，华池充满，咽不胜咽，油然降阙达脐，遍体清和。 吾仍寂体以视之。 如是，百日不间，两乳中壮者，平如小子； 两乳中空者，实若核桃，一如处子。 究其得如小子，乃从化白功足； 得如处子者，功从化赤功足。",
      "translated_text": "If we speak of the sixth principle in the proper path of female cultivation, it is titled *\"The Breasts.\"* This refers to how the breasts connect upward to the fluids of the heart and lungs and downward to the true essences of the Sea of Blood. When the breasts are refined to resemble those of a maiden or a child, this is the female body transformed into the male form. The method of practice does not depart from the fourth and fifth principles.\n\nWomen take blood as their foundation, yet the aim of this principle lies in refining the red to return to the white. However, as the foundation is often deficient, there is the step of refining fluids into blood. To transform fluids into blood, nothing surpasses the method of *\"dew lingering at the palace gate,\"* where the spirit is directed to the twin passes. Within the passes, old stagnant turbid fluids melt naturally and flow like streams into the sea. When the blood returns and life flourishes, the subtle essence of this lies in the fifth principle.\n\nIf one wishes to transform blood back into white, nothing compares to focusing the mind on the *\"stream chambers,\"* clenching the teeth tightly, and intensifying the emptiness and stillness of the heart-mind, so that *qi* naturally returns to the streams and reaches the chambers. Then, using both palms to knead the breasts—first slowly, then swiftly; first gently, then with greater force—perform this one hundred and forty-four times. The *qi* gathers and doubles in vigor. Afterward, withdraw the intent and direct it to the two flanks. Further, guide the *qi* with the eyes, rotating it left and right, completing seventy-two breaths. The *qi* must feel as if warmed by moxibustion.\n\nThe intent should then lead the *qi* in circling the wheel without counting the cycles, until the lower extremity feels as if boiling. Thus, the red transforms into fresh white, which must then be refined into *qi*, piercing the spine, ascending the ridge, crossing the pillow, and penetrating the valley. At this moment, the inner vision reveals the Three Mystic Mountains and the Pure Garden—yet this is not as pure as the tranquil state. One must swiftly engage in *\"forgetting forgetting,\"* suddenly entering the profound darkness of night. Abiding in stillness, over time, the eyes will perceive lightning flashes and thunderous roars, dew descending like rain, the Flower Pool overflowing, swallowing beyond measure. The *qi* descends smoothly to the palace gate and reaches the navel, suffusing the entire body with clarity and harmony. I remain in quiescent observation.\n\nAfter one hundred unbroken days of practice, those with firm breasts will find them as flat as a youth’s; those with hollow breasts will find them as full as walnuts, like a maiden’s. Achieving the form of a youth results from the completion of the white-refining practice; attaining the form of a maiden results from the completion of the red-refining practice.",
      "overlap_context": "fore attempting to sever the *\"Dragon.\"* **Further Note:** The character *\"得见\"* (*de jian*) should be read with the rhyme of *\"现\"* (*xian*), for here *\"见\"* (*jian*) takes the meaning of *\"现\"* (*manifestation*). Only when the mind is still and the body is quiescent can the signs appear. The *\"manifestation\"* (*现*) of *\"若\"* (*ruo*, \"as if\") is the very *\"见\"* (*perception*) of the body. These two characters—*\"见\"* and *\"现\"*—carry both shallow and profound meanings; they must not be read carelessly.]",
      "start_char": 3466,
      "end_char": 3899,
      "start_sentence": 136,
      "end_sentence": 154,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.47345757484436,
      "metadata": {
        "source_file": "dao\\藏外\\西王母女修正余十则.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "吾宗遵行，得验者不少，着有诗词者凤姑也，兹堪采以作证，其诗曰：“左日右月一阴阳，关鼻内运名运罡。 若欲阴阳归日月，手把真火揉双房。 ”受者勉诸。 [谨按：双关位在脊前宫后，关内有二穴，人身泥液之所踞，左曰膏，右曰肓，药力不能到，真炁不自至者。 泥液踞祸一身，造化生人，乃为设关以护心，故名其处曰双关。 夫液曰泥，似液而非液者，本一饮食之所化，津类也。 乘气着肺、散布一身以润经络者，此一物也。 身内真炁旺，物经则化，为用无穷。 真炁若衰，物经不化，流注脏腑经络，亦不为害。 惟适感至阴阴炁，乃成泥液，似精非精，壅塞气道，而被注留最多处，双关、下极两地。 留祸最肆莫如双关，盖以真炁不自至故。 故其聚积，积若昆阴冰雪，历经三伏而不化。 虽有己土心罡，以防以护，神旺则安，神衰则危。 古哲知之，故有聚神烘关一诀，而世罕得闻。 知而行验、载诸诗词者，其惟凤真，兹故取以印证也。 然考凤真谨行得验，还仗先事虚寂心念一诀。 惟能虚寂心念，故得神归炁旺，加以注溪揉房功法，始得泥液熔涌出关，达洋承炼，是得有无相济之妙用耳！ 又按：乳之左房通肝，右房通肺，溪则通心通肾又通脾，故宜刻时观注。 然于平时，只须有意无意以持之。 盖以女子命根根于心，义得坤卦中爻而成离，伏有真火。 然血以凉生，血旺而神安，故宜加虚寂，原是治病养生、复元成道之要地。 第当行得《清静经》三观观法为妙耳。 ] 若曰女修正途第七则，题曰“玉液”。 盖言男子清静入手，功到运澈河车，真精保足，不出玄关，逆流至顶，露洒天谷，沛下华池，亦名玉液。 然以得到阴神出现，魂游玉府，魄朝帝真，圆光罩顶，潮涌玄海，响激玉清，乃真玉液之丹还，古真名曰“醍醐灌顶”。 若夫女子玉液，乃是赤龙液化白凤髓。 厥髓充足，乃可从事逆流，不为虚行故事。 个中功法，虽不离乎四则之所示，而妙义须循六则。 盖以能如是，方能用用无穷，是即前贤所谓“一粒复一粒，用取岂有竭，得到真种子，此事还当力。 ”然其致足致得之由，总因克事虚寂心念，受者勉诸。 [谨按：此则，当引翠娥仙子自述一则注之。 则曰：“余昔从事还丹，法用人忘其人，法忘其法入手，时至则行，故能吾忘为我，但自今斯明斯，（今，今日。 明，明日。 斯，此还丹大事也。 ）日忘其日，时忘其时，一旦天地亦无。 久之，而吾忽醒如悟如，寂听寂视而已，然竟浑忘何事而事也。 但觉灸如焚如，而后现有脂如油如，（后，乃北极之后。 脂如油如，赤龙液化白凤之髓也； 无际无涯，若有声，若无芦，时流时止，载激载喷，有时而悬若雪练，有时而净若冰湖，时非一时，处非一处，目不为眩，神不为疲。 忽于个中，见见闻闻，却足迷性者。 吾于斯时，尚克自警曰：“毋为物诱。 ”又忽觉曰：“天地与我同体者，返身内省，吾身谅亦同然，理果外然内亦然，则必内然外亦然也。 ”于是反躬自省，吾无有我，寂体久之，我乃现焉，然欲深入内省，绝无门窦，遽然如梦觉，觉此身中，中下下极，火热如灸，声发如雷，风声潮声，起自个中，倏忽之间，穿闾升脊，进枕达谷，如注甘露，乃由鼻落。",
      "translated_text": "Within our tradition, those who have attained verification are not few; among them, one who has composed poetry is Mistress Feng. Her verses may serve as testimony. Her poem reads:\n\n*\"Left sun, right moon—one yin-yang,\nThrough the nose’s pass, the inner work is called ‘moving the Gang.’\nShould you wish yin and yang to return to sun and moon,\nGrasp the true fire and knead the twin chambers.\"*\n\nLet the practitioner take heed.\n\n[**Note:** The \"twin passes\" lie between the spine and the palace behind it. Within these passes are two cavities where the *niye* (muddy fluid) resides—left called *gao*, right called *huang*—places where medicinal power cannot reach and true *qi* does not naturally arrive. The *niye* lodges as a calamity within the body. When Nature creates a person, it establishes these passes to guard the heart, hence the name \"twin passes.\" Though called *ni* (mud) and *ye* (fluid), it is not true fluid but rather a transformation of food and drink, a kind of humor. Borne by *qi*, it spreads through the lungs to moisten the meridians throughout the body—this is its function. When the body’s true *qi* is abundant, the substance is transformed and its uses are boundless. If true *qi* declines, the substance remains untransformed, flowing into the viscera and meridians without causing harm. However, when it encounters extreme yin *qi*, it congeals into *niye*—seemingly essence yet not essence—obstructing the pathways of *qi*. The places where it lingers most are the twin passes and the lower extreme. Of these, the twin passes harbor the greatest harm, for true *qi* does not reach them naturally. Thus, it accumulates like the ice and snow of Kunlun’s yin peaks, enduring the three *fu* (hottest periods) without melting. Though the heart’s *gang* of earth serves as a barrier and guardian, when spirit is vigorous, all is well; when spirit wanes, danger arises. The ancients understood this and devised the secret of \"gathering spirit to warm the passes,\" though it is rarely heard in the world. Only Mistress Feng, who knew and practiced it with verification, recorded it in her poetry—hence its selection here as proof.\n\nYet Mistress Feng’s careful practice and verification relied first upon the secret of \"emptying and stilling the mind.\" Only by emptying and stilling the mind could spirit return and *qi* flourish. Combined with the method of \"channeling the stream and kneading the chambers,\" the *niye* was melted and surged forth from the passes, flowing abundantly to be refined. Thus, the wondrous interplay of presence and absence was achieved!\n\n**Further Note:** The left chamber of the breast connects to the liver, the right to the lungs; the \"stream\" connects to the heart, kidneys, and spleen—hence the need for constant observation. Yet in ordinary times, one need only maintain it with intention, whether conscious or not. For a woman’s life-root is rooted in the heart, corresponding to the middle line of the *Kun* hexagram, which forms *Li* and harbors true fire. Yet blood is born of coolness, and when blood is abundant, spirit is at peace—thus, the emphasis on emptiness and stillness. This is the crucial ground for curing illness, nurturing life, recovering original vitality, and attaining the Dao. The practice of the *Qingjing Jing*’s \"Three Observations\" is most effective here.]\n\n---\n\n**Seventh Rule of the Proper Path for Women’s Cultivation: \"Jade Fluid\"**\n\nThis refers to the man who begins with purity and stillness. When his practice reaches the stage of circulating the river chariot, true essence is preserved in full, not leaking from the mysterious pass. Reversing its flow, it ascends to the crown, where dew descends like rain into the heavenly valley, flowing down to the flower pool—this is also called \"jade fluid.\" Yet when the yin spirit manifests, the hun soul wanders the jade palace, the po soul pays homage to the imperial truth, a halo of light crowns the head, tides surge in the mysterious sea, and echoes resound in the jade purity—this is the true return of the elixir of jade fluid. The ancient perfected ones called it \"the pouring of ghee upon the crown.\"\n\nAs for the jade fluid of women, it is the red dragon’s fluid transformed into the white phoenix’s marrow. Only when this marrow is abundant can one proceed with the reverse flow, avoiding empty practice. Though the method does not depart from the four rules previously shown, its subtleties must follow the six rules. Only thus can its uses be inexhaustible—just as the ancients said:\n\n*\"One grain after another,\nIts use knows no end.\nWhen the true seed is attained,\nThis work must still be pursued with vigor.\"*\n\nYet the means of attaining sufficiency and success all stem from mastering the emptying and stilling of the mind. Let the practitioner take heed.\n\n[**Note:** For this rule, let us cite the self-account of the Immortal Jade Maiden:\n\n*\"In my past practice of returning the elixir, I began by forgetting the person through the method, forgetting the method itself. When the time came, I acted—thus, I forgot the self for the sake of the Dao. From this day onward, I forgot the days, forgot the hours, until one day even heaven and earth vanished. After a long while, I suddenly awoke as if from a dream, listening and seeing in stillness—yet utterly forgetting what the matter was. Only a scorching heat like fire remained, and then there appeared a grease like oil (this was the north pole’s aftermath—the red dragon’s fluid transformed into the white phoenix’s marrow). Boundless and without shore, sometimes sounding, sometimes silent like a reed, now flowing, now stopping, now surging, now spraying—at times suspended like a snow-white ribbon, at times pure like an ice-bound lake. The times were not fixed, nor the places; the eyes were not dazzled, nor the spirit wearied. Yet within this, seeing and hearing could still delude the nature. I then admonished myself: ‘Do not be lured by phenomena.’ Suddenly, I realized: ‘Heaven and earth and I are of one body.’ Turning inward to examine myself, I saw that my body was surely the same. If the principle was thus externally, it must also be thus internally—and if thus internally, then surely thus externally. Thereupon, I turned inward to reflect: I had no self. After abiding in stillness for a long time, the self appeared. Yet when I sought to delve deeper, there was no gate or opening. Suddenly, as if awakening from a dream, I felt within my body—at the lower extreme—a scorching heat like moxibustion, sounds like thunder. Wind and tide arose within, and in an instant, they pierced the gate, ascended the spine, passed the pillow, and reached the valley, pouring forth like sweet dew, then falling from the nose.\"*]",
      "overlap_context": "moothly to the palace gate and reaches the navel, suffusing the entire body with clarity and harmony. I remain in quiescent observation.\n\nAfter one hundred unbroken days of practice, those with firm breasts will find them as flat as a youth’s; those with hollow breasts will find them as full as walnuts, like a maiden’s. Achieving the form of a youth results from the completion of the white-refining practice; attaining the form of a maiden results from the completion of the red-refining practice.",
      "start_char": 3899,
      "end_char": 5118,
      "start_sentence": 155,
      "end_sentence": 198,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.95821261405945,
      "metadata": {
        "source_file": "dao\\藏外\\西王母女修正余十则.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "华池水满，咽不胜咽，而时不半晌，已造液涌南洋，寻将注腰绕脐，以熔以冶，天地同体，外然内然，其信然矣，我于斯时，竟循常序，功竣乃退。 ”云云，仙子所述，纯是化功，想其平时，必克专事虚寂于前，进事忘忘于后者也。 一得故采以证印事是功法者] 若曰女修正途第八则，题曰“胎息”。 盖言胎息，至道也，天梯也。 女子还丹以后，精气充足，与男同体，不假胎息，还虚无日也。 夫此一息，功用无边，而诀修至简。 然非尽人一成，其中大有差等，是非造物有以主之，造物亦自因物成物也。 方人假寂，以寻息鼻，无思也，无虑也； 朝斯夕斯，一朝摸着祖窍，窍自洞开，不招也，不拒也。 翕然息与鼻合，浩浩兮无涯，冥冥兮莫测，不知祖是我、我是祖，一鼻呼吸，古哲名曰胎息。 然此窍中，阴阳五行，天地人物，皆生于此。 息随机感而机应，自成天水地人神鬼六等仙眷者，诀惟虚寂致极。 德合真一而修，成天仙； 德合玄一而修，成水仙； 德合贞一而修，成地仙； 德合精一而修，成人仙； 以下二乘，德合情一而修，偏阳成神，偏阴成鬼。 善人之证果，未可得谓真仙也。 差等致如是，种在机感机应。 虽曰天斌，岂非自取？ 受者勉旃。",
      "translated_text": "The Celestial Pond brims with water, so abundant that swallowing cannot keep pace. Yet in less than half a morning, the fluid surges into the Southern Ocean, soon flowing to encircle the waist and coil around the navel, smelting and refining. Heaven and earth share one body—externally so, internally so—truly so indeed. At this moment, I simply followed the ordinary sequence, and upon completion of the work, withdrew.”\n\nSuch was the immortal’s account, purely a transformation of inner cultivation. One can well imagine that in his daily practice, he must have first devoted himself to emptiness and stillness, then proceeded to forgetfulness and forgetting.\n\n*Here, the author appends this passage to affirm the method as a true technique of inner alchemy.*\n\n**On the Proper Path of Female Cultivation, Eighth Principle: \"Embryonic Breathing\"**\n\nEmbryonic breathing is the supreme Dao, the celestial ladder. After a woman completes the Return of the Elixir, her essence and qi become abundant, her body one with that of a man. Without embryonic breathing, the return to emptiness and nothingness would never come.\n\nThis single breath holds boundless efficacy, yet its method of cultivation is most simple. However, not all who practice achieve the same result—great differences arise. Is this determined by the Creator? Even the Creator merely allows things to become what they are.\n\nWhen one first enters stillness to seek the breath at the nose, there is no thought, no deliberation. Morning and evening thus, one day suddenly touches the ancestral aperture, which opens of itself—neither sought nor rejected. The breath and the nose merge in harmony, vast and boundless, dark and unfathomable. One no longer knows whether the ancestral is the self or the self the ancestral. This single breath through the nose is what the ancient sages called *embryonic breathing*.\n\nWithin this aperture, yin and yang, the Five Phases, heaven and earth, and all beings are born. The breath responds to the mechanism of stimulus, naturally forming the six grades of immortals: celestial, aquatic, terrestrial, human, divine, and spectral. The key lies in extreme emptiness and stillness.\n\nThose whose virtue aligns with the True One and cultivate accordingly become Celestial Immortals.\nThose whose virtue aligns with the Mysterious One and cultivate accordingly become Aquatic Immortals.\nThose whose virtue aligns with the Pure One and cultivate accordingly become Terrestrial Immortals.\nThose whose virtue aligns with the Refined One and cultivate accordingly become Human Immortals.\nThe two lesser vehicles, whose virtue aligns with the Passionate One and cultivate accordingly, become either divine (if inclined toward yang) or spectral (if inclined toward yin).\n\nThe attainment of the virtuous cannot be called true immortality. Such differences arise from the mechanism of stimulus and response. Though called heavenly endowment, is it not self-acquired? Practitioners, take heed.",
      "overlap_context": "urned inward to reflect: I had no self. After abiding in stillness for a long time, the self appeared. Yet when I sought to delve deeper, there was no gate or opening. Suddenly, as if awakening from a dream, I felt within my body—at the lower extreme—a scorching heat like moxibustion, sounds like thunder. Wind and tide arose within, and in an instant, they pierced the gate, ascended the spine, passed the pillow, and reached the valley, pouring forth like sweet dew, then falling from the nose.\"*]",
      "start_char": 5118,
      "end_char": 5585,
      "start_sentence": 199,
      "end_sentence": 220,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.26345181465149,
      "metadata": {
        "source_file": "dao\\藏外\\西王母女修正余十则.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "[谨味则说，胎息一功，真至道、真天梯也，敢不勉旃] 若曰女修正途第九则，题曰“南无”。 盖言女修大成，无如大士。 乃苦行熏修，修证佛菩萨。 其得力乃在南无二字。 二字之中，蕴藏玄义。 惟能体守此身即怫，狁如一座晶制七级浮屠，安镇普陀岩上。 座前有个红孩儿，乃是识神领袖，大士一任他东参、南参，参到五十三参，参参见佛，公案了了； 继凭南洋龙女，捧献自在玄珠，乃用紫竹林隔住； 放任白鹦鹉，上下飞舞； 手持清净瓶，插住杨柳枝儿，收取自然甘露水； 稳坐普陀岩上，用哆罗之法，以一唵字放在真意之地，收得至宝放在鱼篮之中； 念伽罗伐哆，将一切娑婆纵在南海，海中由他波浪滚滚，俺只自在观自在。 此一部大法，却少不得第四则内功，尤当息息出自上则，则自步步步返真虚、真寂，功圆行满，乃得与大士相视而笑，穆如释如也矣。 受者勉诸。 [谨按，此则纯以化功了化机，只许意会，毋许饶舌，但须要勤勤恳恳于南无，体守此身即佛，活活泼泼，无往无所谓而已] 若曰女修正途第十则，题曰“慎终”。 盖言女子，坤德也，地道也，无成而代有终者，是亦应行赞襄化育于光天化日之下也。 而功仍自虚寂入手，不费分文、不劳丝力，坐而致之，人莫知之，而德参造化，是盖即身以医世也。 而功纯以调心虚寂为用，调至胸怀清静而天都泰安，调至坤腹通泰而闾阎富庶，调至四肢通畅而四夷安靖，如是，体调而身安，身安而世治，响应如是，故能一刻清和，即有一刻实德，虽不见效而效自有焉。 第恐素学未淳，三田不贯，盖未有一身未济而能得济世才也。 诀惟朝斯夕斯，人一己百，人十己千，虽愚必明也。 受者勉诸。",
      "translated_text": "[With reverent attention to this discourse, the art of embryonic respiration is the true supreme Dao, the true ladder to heaven—how could one not strive diligently?]\n\nIf we speak of the ninth principle in the proper path of female cultivation, it is titled *\"Namo.\"* For in the great accomplishment of female practice, none surpasses the Bodhisattva. Through ascetic discipline and devoted cultivation, one attains the realization of the Buddha and Bodhisattvas. The source of this power lies in the two characters *Namo.* Within these two words is concealed a profound mystery. Only by embodying and guarding this body as the Buddha—like a seven-tiered crystal stupa firmly enshrined upon Mount Putuo—can one proceed. Before the stupa stands a Red Child, the leader of the consciousness aggregate, whom the Bodhisattva allows to wander eastward and southward in search, until after fifty-three pilgrimages, he at last meets the Buddha, and the koan is resolved. Then, relying on the Dragon Girl of the Southern Ocean, she offers the wondrous pearl of freedom, which is shielded by the Purple Bamboo Grove. The White Parrot is left to fly up and down at will. Holding the vase of purity, she inserts a willow branch to gather the natural nectar of sweet dew. Seated steadfastly upon Mount Putuo, she employs the *dhāraṇī* method, placing the syllable *Oṃ* upon the ground of true intent, thus securing the supreme treasure within the fish basket. Reciting *Garuḍa-vadha*, she casts all of *sahā* into the Southern Sea, where waves may surge unceasingly—yet she remains in perfect ease, observing the self in self-liberation.\n\nThis great dharma, however, cannot do without the fourth principle of inner work, which must arise moment by moment from the preceding principle. Thus, step by step, one returns to true emptiness and true quiescence. When merit is complete and conduct perfected, one may exchange smiles with the Bodhisattva, serene and at peace as the moon’s reflection. Practitioners, take heed.\n\n[With due caution, this principle wholly transforms function through the mechanism of transformation. It is to be grasped intuitively, not idly discussed. One must only devote oneself earnestly to *Namo*, embodying this body as the Buddha—living, fluid, and unbound by any fixed notion.]\n\nIf we speak of the tenth principle in the proper path of female cultivation, it is titled *\"Vigilance in Endings.\"* For women embody the virtue of *kun*, the way of earth—without achievement, yet ever completing what is begun. Thus, they too should assist in nurturing and transforming under the bright sun of civilization. Yet the work still begins with emptiness and quiescence, costing not a coin nor expending a thread of effort. Seated, one achieves it unseen, while virtue merges with the workings of creation—this is healing the world through one’s very being.\n\nThe practice relies purely on harmonizing the heart with emptiness and stillness. When the breast is calmed to purity, the celestial realm knows peace. When the womb of earth is unobstructed, villages and towns prosper. When the four limbs flow freely, the four barbarian lands are pacified. Thus, when the body is harmonized, the self is at ease; when the self is at ease, the world is governed. The resonance is immediate: a moment of clarity and harmony yields a moment of true virtue. Though no effect is seen, the effect is inherent.\n\nYet one must fear that foundational study remains shallow, the Three Fields unaligned—how can one whose own body is unfulfilled possess the capacity to fulfill the world? The secret lies in morning and evening devotion: when others advance by one, advance by a hundred; when others advance by ten, advance by a thousand. Even the foolish will surely become enlightened. Practitioners, take heed.",
      "overlap_context": "s.\nThose whose virtue aligns with the Refined One and cultivate accordingly become Human Immortals.\nThe two lesser vehicles, whose virtue aligns with the Passionate One and cultivate accordingly, become either divine (if inclined toward yang) or spectral (if inclined toward yin).\n\nThe attainment of the virtuous cannot be called true immortality. Such differences arise from the mechanism of stimulus and response. Though called heavenly endowment, is it not self-acquired? Practitioners, take heed.",
      "start_char": 5587,
      "end_char": 6243,
      "start_sentence": 221,
      "end_sentence": 243,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.129343271255493,
      "metadata": {
        "source_file": "dao\\藏外\\西王母女修正余十则.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "[谨按：此则乃是西王母准重颁授全郡，不二元君乃遵玉清神母口授医世大道，辑易昔传末则，以殿则末。 信属开辟以来未有之旷典，吕祖谓为造化幸甚，元君谓为道运之当重振。 其有厚望于后学如此，一得愿得见是书者，互相劝勉云。 ]",
      "translated_text": "[With due reverence: This precept was reissued by the Queen Mother of the West to the entire commandery. The Peerless Primordial Sovereign, in obedience to the oral transmission of the Jade Purity Divine Mother, compiled and refined the lesser methods of past teachings to conclude this final precept. Truly, it is an unparalleled canon since the dawn of creation—Lü Dongbin called it the greatest fortune of the cosmos, and the Primordial Sovereign declared it the rightful revival of the Dao’s destiny. Such profound hopes are placed upon later scholars that any who obtain this text are entreated to exhort one another in its study.]",
      "overlap_context": "f clarity and harmony yields a moment of true virtue. Though no effect is seen, the effect is inherent.\n\nYet one must fear that foundational study remains shallow, the Three Fields unaligned—how can one whose own body is unfulfilled possess the capacity to fulfill the world? The secret lies in morning and evening devotion: when others advance by one, advance by a hundred; when others advance by ten, advance by a thousand. Even the foolish will surely become enlightened. Practitioners, take heed.",
      "start_char": 6245,
      "end_char": 6353,
      "start_sentence": 244,
      "end_sentence": 247,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.092109680175781,
      "metadata": {
        "source_file": "dao\\藏外\\西王母女修正余十则.txt",
        "category": "藏外"
      }
    }
  ]
}