{
  "source_id": "诸师真诰",
  "source_file": "chunked_daozang\\诸师真诰.json",
  "total_chunks": 6,
  "total_original_chars": 5799,
  "total_translated_chars": 38063,
  "total_translation_time": 213.6024684906006,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\赞颂类\\诸师真诰.txt",
    "category": "赞颂类"
  },
  "full_translation": "**True Teachings of the Various Masters**\n*Sutra Title: True Utterances of the Various Masters*\n*One Scroll*\n*Source Text: \"Daoist Canon of the Zhengtong Era,\" Dongzhen Section, Hymns and Eulogies Category*\n\n---\n\n**Eulogy of the Primordial Celestial Worthy**\nWith sincere heart, I bow in reverence:\nAbove the Three Realms, the vastness of Brahma-qi pervades.\nSupreme beyond all supremacy, the Heaven within Heaven.\nIn the lofty halls of Yuluo Xiaotai, the Jade Capital upon the Mountain,\nThe boundless Golden Towers stand, where the pure and profound waters gather.\nThe primordial One Qi, before the chaos of origins,\nWithin the Jeweled Pearl, the mystery beyond mystery.\nThe Three Luminaries unfold, giving birth to the myriad heavens,\nCountless celestial perfected ones, an immeasurable host.\nRevolving the Dipper, traversing the Winnowing Basket, cycling through the Five Constants,\nMajestic and vast, the great model, the origin of the myriad Ways.\n**The Primordial Celestial Worthy of the Great Mystery, the Void and Spontaneity, the Most Perfect Dao of the Jade Clarity and Great Luo Heaven.**\n\n---\n\n**Eulogy of the Supreme Clarity**\nWith sincere heart, I bow in reverence:\nDwelling in the realm of Supreme Clarity, titled the Numinous Treasure Lord.\nBorn of the ancestral kalpa, from ninety-nine thousand and more Brahma-qi;\nThe Crimson Script shines forth, with six hundred and sixty-eight true characters.\nBy the Crimson Script of Chaos, the Nine Empyreans were opened;\nBy the Jade Calendar of the Origin, the Five Kalpas were divided.\nHeaven’s warp and earth’s weft, majestic as the origin of creation;\nThe pivot of yin and the mechanism of yang, the august ancestor of thunder.\n**The Most Compassionate, Most Vowed, Most Sagely, Most Benevolent, Jade Emperor Dao Lord, Numinous Treasure Celestial Worthy of the Supreme Clarity.**\n\n---\n\n**Eulogy of the Grand Clarity**\nWith sincere heart, I bow in reverence:\nTeaching according to the times, delivering beings across kalpas.\nAs the teacher of emperors, the teacher of kings, adopting names and titles as expedients;\nEstablishing the Way of Heaven, the Way of Earth, the Way of Humanity, concealing sageliness and manifesting the ordinary.\nEncompassing the twelve hundred officials, embracing the myriad layers of Brahma-qi.\nTransformations spanning past and present, expounding the *Dao and Virtue* in five thousand words;\nGoverning yin and yang, commanding thunder with the power of nine and five.\n**The Most Compassionate, Most Vowed, Most Sagely, Most Benevolent, Most High Lord Lao, Celestial Worthy of the Dao and Virtue.**\n\n---\n\n**Eulogy of the Miro**\nWith sincere heart, I bow in reverence:\nThe Supreme Heaven of Miro, the wondrous and mysterious realm of the True.\nThe boundless Purple-Golden Towers, the Jade Clarity Palace of the Grand Tenuity.\nThe Saint beyond the Ultimate, the Radiance beyond the Non-Ultimate.\nSerene and vast, without origin, the profound model encompassing the ten directions.\nThe tranquil and constant Dao, the boundless great spiritual power.\nThe True Elder of the Vault of Heaven, wondrously perfect and pure.\nWisdom and eloquence, the Most Honored of the Dao.\nTeacher of the Three Realms, Ancestor of the Primordial Chaos.\nUnsurpassed Sagely Lord, Compassionate Father of the Four Kinds of Beings.\nExalted Sage of the High Heavens, the Greatly Benevolent One.\nTen titles perfected, myriad virtues embodied.\nLimitlessly delivering beings, rescuing from the suffering of birth and death.\nTeacher of all Buddhas, King of all Sages.\n**The Most High, Heaven-Opening Talisman-Holder, Calendar-Wielder and Truth-Embodier, Golden Tower of the Dao-Body, Nine-Apertured Cloud Palace, Governor of the Myriad Ways, Great Effortless Luminous Hall, August Jade Emperor of the Vast Heaven, Supreme Sovereign of the Lofty Firmament.**\n\n---\n\n**Eulogy of the Heavenly Emperor**\nWith sincere heart, I bow in reverence:\nThe Purple Tenuity’s imperial pole, the Celestial Palace of the Curved Array.\nWithin the Garden of Ninefold Radiance, above the Five Qi’s Mysterious Capital.\nEmbodying the Primordial Emperor, assisting in the mysterious transformations;\nEncompassing the Two Poles, jointly governing the Three Powers.\nHolding the balance of military authority, broadly extending great virtue;\nOverseeing the celestial bodies’ courses, ensuring constancy in their paths.\nLofty as the celestial image, vast as the true and primordial.\n**The Most Compassionate, Most Vowed, Most Sagely, Most Benevolent, Heavenly Emperor of the Curved Array’s Upper Palace.**\n\n---\n\n**Eulogy of the Star Lord**\nWith sincere heart, I bow in reverence:\nIn the towers of the Great Luo Heaven, the Star Palace of the Purple Tenuity.\nExalted in the heights of the North Culmen, enthroned above the center of heaven,\nKnown in Buddhism as the Blazing Golden Wheel, in Daoism as the Mysterious Lord of the Jade Dipper.\nThe Jade Armillary and Jade Balance, aligning the Seven Governors;\nEncompassing the warp of heaven and weft of earth, guiding the sun and moon.\nThe constellations bound, the four seasons proceed, the Purple Enclosure of the Yellow Path,\nMaster of the myriad images, governor of all heavens.\n**The Most Compassionate, Most Vowed, Most Sagely, Most Benevolent, Teaching Lord of the Myriad Stars, Boundless Primordial Emperor, Great Emperor of the Purple Tenuity and North Culmen of the Central Heaven.**\n\n---\n\n**Eulogy of the Queen of Earth**\nWith sincere heart, I bow in reverence:\nThe Nine-Flowered Jade Towers, the Jeweled Imperial Chambers.\nReceiving the mandate of heaven, wielding the handle of yin and the lever of yang.\nThe Dao exalted, vast and luminous;\nVirtue accumulated in gentleness, harmony, benefit, and constancy.\nFollowing the example of the Vast Heaven, nurturing the beauty of Earth’s origin;\nFlowing through forms and beings, bestowing the kindness of the Mother’s Way.\nMountains and rivers depend on Her, all peaks and streams submit.\n**The Most Compassionate, Most Vowed, Most Sagely, Most Benevolent, Mandate-Receiving and Heaven-Emulating, August Earth Queen and Earthly Deity.**\n\n---\n\n**Eulogy of the Divine Empyrean**\nWith sincere heart, I bow in reverence:\nThe Highest Divine Empyrean Court, the Palace of Concentrated Spirit and Radiant Illumination.\nConverging the ancestral qi of the Primordial Beginning to differentiate the true;\nResponding to the wondrous Dao’s emptiness to initiate transformation.\nEnthroned above the Nine Empyreans, governing all heavens;\nEncompassing the Ten Poles, presiding over the myriad transformations.\nProclaiming the golden talismans to bestow radiance and relieve suffering,\nDispensing beneficent moisture to nurture the multitudes.\nGrace as vast as the primal qi, benevolence as boundless as the kalpas.\n**The Most Compassionate, Most Vowed, Most Sagely, Most Benevolent, True King of the Jade Clarity, Great Emperor of Longevity of the Southern Culmen, Primordial Sage of Heaven’s Governance.**\n\n---\n\n**Eulogy of the Savior from Suffering**\nWith sincere heart, I bow in reverence:\nThe Realm of Everlasting Joy, the Wondrous and Solemn Palace of the Eastern Culmen.\nThe Fragrant Forest of Seven Treasures, the Nine-Colored Lotus Throne.\nSurrounded by the myriad perfected, within the radiance of a hundred million auspicious lights.\nThe Supreme Clarity’s Numinous Treasure Worthy, the responsive transformation of the Primordial Beginning.\nAcross kalpas, extending compassion and salvation, the gateway of sweet dew for the great thousand worlds.\nThe wondrous true body, the purple-golden auspicious form.\nResponding to conditions, vows boundless.\n**The Most Sagely, Most Benevolent, Most Compassionate, Most Vowed, Ten Directions’ Transformative Titles, Universally Delivering Beings, Limitlessly Delivering in Countless Kalpas, Responding to Cries and Appearing, Celestial Worthy of Great Unity and Salvation from Suffering, August Emperor of the Azure Heavens.**\n\n---\n\n**Eulogy of the Kehan**\nWith sincere heart, I bow in reverence:\nThe Highest Cinnabar Empyrean, attached to the Upper Primordial Court.\nThe Crimson Palace and Vermilion Towers, nurturing divine radiance in the household of vast kalpas.\n\nWith sincere heart, I bow in reverence:\nThe Precious Kānlín Grove, manifesting auspicious signs in the Great Clarity’s realm.\nWielding the transformative power of great compassion, descending the mechanism of true essence’s bellows-key.\nSevering death to ascend life, expanding the virtue of Heaven-and-Earth’s singular origin;\nRefining souls and forging spirits, restoring the lives of the ten thousand dark and numinous kinds.\nRadiating yang’s luminosity, universally dredging the yin’s domains.\n\n**The Most Sagely, Most Benevolent, Most Compassionate, Most Vowed, Nine Heavens’ Azure City, Kehan the Venerable, Vermilion Mound’s Deliverer of Lives, Celestial Worthy.**\n\n**Universal Transformation’s Title**\nWith sincere heart, I bow in reverence:\nThe Nine Heavens’ Responsive Primordial Court, the Supreme Jade Clarity King.\nTransforming forms to fill the ten directions, discoursing on the Dao while seated upon nine phoenixes.\nAbove the thirty-six heavens, perusing precious scrolls and examining jade texts;\nBefore the fifteen hundred kalpas, holding the position of true orthodoxy and wielding the authority of great transformation.\nRaising the golden radiance ruyi, proclaiming the *Jade Pivot’s Precious Scripture*.\nThose who resist are reduced to motes of dust, issuing commands swift as wind and fire.\nWith pure and still heart, vast vows are magnified;\nWith the power of wisdom, all demons are subdued.\nOverseeing the five thunders, directing intention through the three realms.\nFather of all beings, teacher of the ten thousand spirits.\n\n**The Most Sagely, Most Benevolent, Most Venerated, Most Daoic, Nine Heavens’ Responsive Primordial Thunder-Voice Universal Transformation Celestial Worthy.**\n\n**Thunder Ancestor’s Title**\nWith sincere heart, I bow in reverence:\nThe Supreme Jade Empyrean Court, the Thunderbolt’s Abyssal Palace.\nThree realms divide the true, nine heavens unfold transformation, light converges beyond the Great Net, divine power pervades the boundless heavens.\nRescuing from flood and drought below, dispelling locusts and pests across kalpas.\nIssuing vast vows, benefiting and delivering all beings.\n\n**The Most Sagely, Most Benevolent, Most Compassionate, Most Vowed, Nine Heavens’ Thunder Ancestor Great Emperor, Disaster-Removing and Salvation-Bestowing Celestial Worthy.**\n\n**Great Unity’s Title**\nWith sincere heart, I bow in reverence:\nThe Supreme Lang Empyrean Court, the Purple Tenuity’s Jasper Jade Palace.\nRadiance resplendent, the true congeals in the Supreme Ultimate.\nEmitting wondrous qi from the golden portals, blazing great transformation through the primordial vastness.\nRestoring the pure wind amid the dregs of decadence, safeguarding and regulating the kalpic destiny;\nExpanding beneficent moisture beyond the earthly realm, nurturing and fostering the black-haired people.\n\n**The Most Sagely, Most Benevolent, Most Compassionate, Most Vowed, Supreme Clarity’s Purple Tenuity Jasper Jade Palace, Great Unity Great Heavenly Emperor, Kalpic Destiny-Safeguarding Celestial Worthy.**\n\n**Abyssal Cavern’s Title**\nWith sincere heart, I bow in reverence:\nThe Supreme Great Empyrean Realm, the Six Heavens’ Abyssal Cavern Palace.\nAuspicious signs solemn and majestic, manifesting radiant light in the azure vault’s realm;\nTrue body vast and expansive, bestowing wondrous moisture upon the seed-people’s heavens.\nSuppressing demonic spirits of the five palaces, sweeping away miasmas of the ten thousand regions.\nElevating the people’s lives to benevolence and longevity, governing and transforming through the subtle and tranquil.\n\n**The Most Compassionate, Most Vowed, Most Sagely, Most Benevolent, Six Heavens’ Abyssal Cavern Great Emperor, Supreme Demon-Subduing Great Unity Celestial Worthy.**\n\n**Six Waves’ Title**\nWith sincere heart, I bow in reverence:\nThe Purple Empyrean’s Upper Realm, the Six Waves’ Heavenly Palace.\nWondrous signs radiant and luminous, manifesting a compassionate countenance in Heaven’s Unity;\nCelestial abode vast and boundless, bestowing blessings and kindness upon the human world.\nDefending against vast deluges, rescuing from scorching conflagrations.\nRefining and molding the ten thousand transformations, unifying and governing the singular origin.\n\n**The Most Sagely, Most Benevolent, Most Compassionate, Most Vowed, Six Waves’ Heavenly Lord Emperor, Universally Bestowing Dharma-Moisture Celestial Worthy.**\n\n**Investigator’s Title**\nWith sincere heart, I bow in reverence:\nThe Purple Mystery’s Resplendent Court, the Nine Heavens’ Destiny-Safeguarding Palace.\nThe supreme Dao divides its radiance, gathering the ten directions’ pure qi;\nThe true and constant reveals the wondrous, restoring the decadent winds of vast kalpas.\nInvestigating and recording the various heavens, inscribing good deeds to erase evil registers;\nGrace permeates the ten thousand transformations, inscribing names of fortune and ascending life.\n\n**The Most Sagely, Most Benevolent, Most Compassionate, Most Vowed, Nine Heavens’ Investigator Vermilion Mound Emperor, Responsive Primordial Destiny-Safeguarding Wondrous Transformation Celestial Worthy.**\n\n**Dipper Mother’s Title**\nWith sincere heart, I bow in reverence:\nIn the Western Land of India, within the Great Wisdom’s Light, the True Emptiness Wondrous Sign Dharma King Teacher, the Supreme Primordial Heavenly Mother Lord.\nWhere golden light blazes, sun and moon conceal their brilliance;\nWhen the jeweled pestle revolves, ghosts and spirits lose their color.\nManifesting numinous traces in the dusty world, guarding the sacred chariot in Jambudvīpa.\nWhen beings encounter calamity, should they invoke her name;\nThe Great Being, responding to cries, comes to deliver from suffering.\n\n**The Most Compassionate, Most Vowed, Most Sagely, Most Benevolent, Sacred Virtue’s Vast Light Heavenly Queen, Mārīcī Great Sage.**\n\n**Three Officials’ Proclamation**\nThe Three Sagely Ones are but a single Supreme Ultimate.\nReceiving the mandate of the vast kalpas’ household, bearing the infinite ranks’ commendations.\nPurple Tenuity’s pure emptiness, governing the yin’s totality, bestowing fortune according to merit, absolving sins and dissolving calamities, universally aiding the living and the dead, the Dao crowning all heavens, grace extending through the three realms.\n\n**The Most Compassionate, Most Vowed, Most Sagely, Most Benevolent, Three Origins Three Ranks Three Officials Great Emperors, Three Palaces Nine Bureaus Responsive Celestial Worthies.**\n\n**Fire Official’s Proclamation**\nFour origins, four ranks, examining the Fire Official.\nOperating to assist the firmness of Qian, virtue uniting with the clarity of Li.\nDwelling within the Vermilion Heaven of the Great Yang, presiding over the left bureau’s register of births.\nVirtue flourishing in fire, the Flame Emperor holds the balance.\nMerit assisting the Three Origins, qi circulating in the fourth month.\nRiding the red dragon to traverse the southern lands, illuminating the Palace of Mars;\nIlluminating the Vermilion Mound to reveal the Cinnabar Terrace, resplendent in the Wenchang Mansion’s precincts.\nBrilliant and luminous, shining and illuminating.\n\n**The Most Compassionate, Most Vowed, Most Sagely, Most Benevolent, Red Emperor’s Upper Rank Three Qi Fire Official Flame Emperor Perfected Lord, Cavern Yang Great Emperor Southern Vermilion Longevity Celestial Worthy.**\n\n**Dark Heaven’s Proclamation**\nPrimordial Six Heavens’ Dharma-Teaching Master, cultivating the true and attaining the Dao, delivering the deluded multitude, universally aiding beings in dispelling calamities and obstacles.\nEighty-two transformations, Three Realms’ Patriarch, **Most Compassionate, Most Vowed, Savior from Suffering, Savior from Calamity, Three Origins Commander-in-Chief, Nine Heavens’ Roaming Enforcer, Left Heavenly Stem Northern Culmen Right Wall Great General, Heaven-Fortifying and Assisting Compliance, True Martial Numinous Response, Fortune-Virtue Proliferating Blessings, Benevolent and Upright, Harmonizing Destiny Perfected Lord, Governance and Blessing Deity Jade Clarity Preceptor Minister Dark Heaven Emperor, Golden Portal’s Manifestation Demon-Quelling Kalpa-Ending Suffering-Delivering Celestial Worthy.**\n\n**Celestial Master’s Invocation**\nOriginally of the southern lands, ascending to the Shu capital, first obtaining the Yellow Emperor’s Nine-Cauldrons’ cinnabar scriptures, later serving the Venerable Lord twice at Jade Bureau. A thousand scrolls distilled the essence of cultivation; in an instant, mastery of breath and absorption was achieved. The registers of the Dharma were perfected, receiving the covenants of the Alliance and forming the radiant mudra. Right and wrong were distinguished, seizing governance of the Blessed Courts and transforming all springs. Virtue perfected the Great Elixir; the Dao aligned with the Seven Governors. Most Compassionate, Most Vowed, Most Sage, Most Benevolent, **Three Heavens’ Upholding-Teaching, Assisting-the-Mysterious, Embodying-the-Dao Great Dharma Celestial Master, Thunder Bureau’s Supreme Ministry Grand Prime Minister of the Great Law, Orthodox Unity’s Penetrating-Mystery Spirit-Transforming, Serene-Response, Manifest-Protection Perfected Lord, Six Harmonies’ Boundless Lofty Luminous Great Emperor, Demon-Quelling, Dao-Protecting Celestial Worthy.**\n\n**Ancestral Master Lu’s Invocation**\nBorn in the Han dynasty, enfeoffed in the Jin. Only by spreading qi were demons subdued; once, swallowing a tiger, he saved the world. He transmitted the Dharma of Jade Clarity Grotto-Truth and passed down the scriptures of the Mysterious Chamber’s inner teachings. Presiding over the Thunder Bureau’s punishments, executing the Military Governor’s prerogatives; conferred the title of Celestial Master, ascending to the Purple Tenuity Heaven’s Right Minister’s rank. Adjudicating the Palace of Preserving Yang, presiding over the Primordial Unity’s teachings. Most Compassionate, Most Vowed, Most Sage, Most Benevolent, **True Origin’s Pure August Supreme Emperor, Great Void’s Universally Beneficent Perfected Lord, Nine Heavens’ Treasure-Register Life-Commanding Celestial Worthy.**\n\n**Ancestral Master Wei’s Invocation**\nThe Primal Sovereign manifested transformation, his wondrous true body existing subtly. Radiance like the full moon revealed his compassionate countenance; the pure and tranquil Mysterious Wind inaugurated the Orthodox Teaching. The Dao honored the Sage Ancestor; virtue weighed heavily as the King of Medicine. Presiding over the Three Realms’ thunder, examining the registers of all beings’ fortunes. **Ancestral Master, Most Benevolent and Compassionate One, Celestial Illumination Dharma King, Southern Marchmount’s Supreme Immortal, Nine Heavens’ Life-Commanding, Golden Portal’s Supreme Guardian, Lofty Origin’s Pure and True, Purple Tenuity Primordial Lord.**\n\n**Immortal Duke’s Invocation**\nAttaining the Dao at Tiantai, merging with the dark and achieving perfection. Once receiving [transmission] from Eastern Florescence, later transmitting it in Western Shu. By imperial decree of Jade Capital and Golden Portal, he ascended to the ranks of the Supreme Ultimate’s immortals. With compassion, he rescued those sunk in suffering; with grace, he universally aided those in distress. The legacy of the Lord of Ge flourished, manifesting at Gou’lou; now, cinnabar remains, and Kuocang’s peaks are his to roam. At Luofu he tarried in carefree ease; on Yuxi he cultivated the golden scriptures.\n\n**Great Compassion, Great Vows, Great Sage, Great Mercy, Supreme Jade Capital’s Eastern Florescence, Supreme Ultimate’s Left Palace Immortal Duke, Thunder’s Mysterious Ministry Celestial Mechanism Inner Minister, Jade Purity Purple Spirit Universal Transformation Mysterious Serenity Constant Dao Penetrating Response Blessed Aid Perfected Lord; Silkworm Grace Vast Salvation Compassionate Great Emperor; Limitless Salvation Heavenly Worthy.**\n\n**Perfected Lord’s Invocation**\nPrimordial Beginning Ancestor, one *qi* divided into the true.\nCountless kalpas ago, he accumulated cultivation of the supreme Dao.\nWith diligent toil and exhaustive effort, his mastery deepened beyond measure.\nOf the myriad dharmas and thousand gates, none did he fail to traverse.\nRescuing from disaster, delivering from peril, eradicating harm, and vanquishing demons,\nHis merit aided living beings, his name exalted in the celestial registers.\nAll immortals revered and deferred to him, thus was he fittingly ennobled.\n\n**Great Compassion, Great Vows, Great Filial Piety, Great Benevolence, Nine Provinces’ All Immortals Grand Scribe Illustrious Eminent Envoy, Thunder’s Supreme Ministry Celestial Pivot Demon-Subduing Supreme Minister; Supreme Dao Mysterious Response Divine Merit Wondrous Salvation, Nine Heavens’ Controller of Destiny Life-Recording Perfected Lord; Three Heavens’ Inspector-General Universal Examiner Memorializing Remonstrating Grand Master; Celestial Physician Great Emperor; Salvation’s Patriarch; Pure Illumination Universal Transformation Heavenly Worthy.**\n\n**Canopy’s Invocation**\nJade Purity’s Lofty Sage, Empty Sovereign’s Supreme Perfected.\nPrimordial Immortal Lord, responsive transformation dividing the numinous.\nEmbodying the true and realizing the Dao, his merit and conduct perfected.\nCommanding thunder and dispatching lightning, he blessed the realm and prospered the people.\nAiding loyalty and filial piety, eradicating sins and prolonging life.\nCanopy’s Patriarch, Master of Human and Heavenly Teachings.\nCosigning Minister of Thunder’s Three Ministries Supreme Minister Golden Portal Great Immortal; Blessed Aid Manifest Numinous Transcendent Response Protector-State Perfected Lord; Nine Heavens’ Salary-Controlling High Minister Lofty Mystery Supreme Lord Wondrous Dao’s Master; Three-Five Flying Steps Right Blessing Wondrous Numinous Penetrating Response Supreme Void Perfected Lord; Southern Culmen Life-Recording Immortal Minister Mysterious Brilliance Supreme Lord; Sincere Teaching Master Nine-One Supreme Clarity Manifest Blessing Resonant Numinous Far-Reaching Perfected Lord; Northern Culmen Examiner Immortal Minister Great Brilliance Supreme Lord; Three Realms’ Transformation-Body Heavenly Worthy.\n\n**Zitong’s Invocation**\nNot arrogant in the Emperor’s realm, Jade Perfection’s Felicitous Palace.\nManifesting ninety-eight transformations in conduct and concealment,\nDisplaying billions of myriad kinds of divine marvels.\nFlying phoenixes opened enlightenment everywhere;\nWishes fulfilled, he saved kalpas through endless rebirths.\nUtmost filial piety, utmost benevolence—his merit abided in Confucian, Daoist, and Buddhist teachings;\nNeither arrogant nor indulgent—his office fulfilled the duties of Heaven, Earth, and Water officials.\nHis merit and virtue immeasurable, his numinous power unfathomable.\n\n**Great Compassion, Great Vows, Great Sage, Great Mercy, Nine Heavens’ Auxiliary Origin Transformation Governing Lord, Salary-Controlling Tribute-Examining Perfected Lord; Seven Turns’ Numinous Response Protecting Virtue Vast Benevolence Great Emperor; Scripture-Expounding Teaching-Disseminating Disaster-Dispelling Transformation-Practicing Rebirth-Prolonging Life Heavenly Worthy.**\n\n**Three Mao Perfected Lords’ Invocation**\nHeavenly and human Dao and virtue, immortals’ and sages’ true masters.\nFilial piety and fraternal duty communicated with the divine,\nTheir grace and beneficence extended to families and states.\nConcealed on Mount Heng, they awakened to the Dao;\nDwelling on Mount Gouqu, they ascended to heaven.\nPresiding over the sacred mountains of Tai, Heng, and Huo,\nOfficing over the grottoes of Chicheng, Huayang, and beyond.\nGoverning the turning of kalpas and yin-yang,\nConcurrently overseeing thunder, water, and marshlands.\nReceiving the outstanding talents of their two younger brothers,\nTransmitting the secret formulas of immortal ascension.\nAll were enrolled in the registers of immortals,\nTogether receiving the honor of jade tablets.\nTheir virtue embraced the hidden and manifest,\nTheir benevolence universally bestowed.\nResponding to circumstances and answering prayers,\nTheir vows were vast and profound.\n\n**Supreme Origin Wondrous Dao Penetrating Void Sagely Blessed Response Perfected Lord; Earth Immortal Supreme Perfected Right Register Pacifying Forbidden Penetrating Serenity Virtue-Blessed Wondrous Response Perfected Lord; Earth Immortal Supreme Perfected Three Officials Life-Protecting Penetrating Grace Benevolent Blessed Divine Response Perfected Lord; Nine Heavens’ Life-Commanding Three Mao Responsive Transformation Heavenly Worthy.**\n\n**Lady Ma Gu’s Invocation**\nPerfect penetration, profound stillness, settled response, compassionate benevolence.\nOn Kunlun Mountain, she manifested her wondrous body;\nIn Qingcheng Grotto, her sacred traces shone.\nCrossing Wu to save Cai, her kind response resonated with sincerity;\nTossing rice to form cinnabar, she played in ceaseless transformation.\nPresiding over all immortals,\nEncompassing the myriad beings.\nRefining her body with nine harmonies,\nSurpassing merit with ten perfections.\n\n**Great Compassion, Great Vows, Great Sage, Great Mercy, Ma Gu’s True Serenity Penetrating Response Benevolent Blessed Wondrous Salvation Perfected Lady.**\n\n**Immortal Elder Hongya’s Invocation**\nOne *qi* divided into the true, the five phases nurturing his essence.\nIn high antiquity, he was the teacher of the Divine Farmer;\nReceiving from the Two Modes, the true mechanism of the Numinous Treasure.\nOften manifesting in the Jin and Tang dynasties,\nEver bestowing his radiance in past and present.\nRiding the snow spirit on Western Ridge,\nUttering long whistles in the Kaiyuan era.\nHis voice moved the imperial court,\nHis purity unmatched in the Dew Palace;\nHis dharma transmitted to feathered and coarse-clad,\nHis Dao’s splendor enduring like the sun’s brilliance.\nHis grace covered the realm,\nHis kindness universally bestowed.\n\n**Great Compassion, Great Vows, Great Filial Piety, Great Benevolence, Elder Hongya, Qingcheng’s Immortal Elder; Pure Illumination Scripture Master Responsive Transformation Perfected Lord.**\n\n**Five Patriarchs of Complete Perfection’s Invocation**\nThe Great Dao opened the beginning,\nMysterious Origin unfolded transformation.\nTeachings transmitted through past and present,\nRevealed as Eastern Florescence.\nReceiving the Han dynasty’s general,\nHe concealed himself on Zhongnan and attained immortality.\nHis transformations often transcended kalpas,\nHis manifestations ever present in the human world.\nAwakening Tang dynasty’s worthy,\nHe realized immortals’ secret formulas.\nFlying swords and selling medicine,\nHis warnings and transformations boundless.\nGolden Court’s prime minister’s lofty standard,\nBravely declining the seal of office.\nAscending in rosy clouds,\nUniting North and South as one lineage.\nHeaven again produced a hero among men,\nThe Dao universally pervading the four seas.\nUnfolding seven golden lotuses,\nDisseminating immortal lineages in the ten directions.\nThe principle of longevity prevails to this day,\nMysterious and wondrous, Heaven’s grace descends upon the land.\nVastly propagating the supreme Dao,\nUniversally delivering the foolish and deluded.\n\n**Complete Perfection’s Patriarch, Eastern Florescence Purple Palace Auxiliary Mystery Establishing Ultimate Great Dao Emperor Lord; Orthodox Yang’s Awakening Transmitting Dao Bestowing Ultimate Emperor Lord; Pure Yang’s Orthodox Practice Warning Transformation Blessed Aid Emperor Lord; Sea Toad’s Illumination Propagating Dao Pure Blessed Emperor Lord; Chongyang’s Complete Perfection Opening Transformation Auxiliary Ultimate Emperor Lord; Five Patriarchs’ Dao-Expounding Heavenly Worthy.**\n\n**Ancestral Perfected Lady’s Invocation**\nPrimordial Beginning transformed *qi*,\nPure Subtlety’s orthodox lineage.\nVast, great, lofty, and luminous,\nAwakening the heart and perfecting the Dao’s body;\nFirm, strong, pure, and unalloyed,\nHis nature born of the divine and numinous.\nAchieving thunder and lightning through non-action,\nEncompassing Heaven and Earth beyond form.\n\nSupreme beyond the utmost,\nConverging the true source of the four streams;\nMystery upon mystery,\nPenetrating the wondrous meaning of the three vehicles.\nExpounding the great teaching,\nBenefiting and delivering all beings.\nIlluminating the palace with radiant clarity,\n*Pure Subtlety’s* Founding Ancestral Master,\n*Primordial Supreme’s* Attendant of the Golden Portals,\n*Luminous Mystery Dao* Preserving Immortal,\n*Unified Transformation* Shining *One Radiance* Perfected Lady.\n\n**Northern Seven Perfected’s Invocation**\nThe Dao precedes the one *qi*,\nThe world manifests the Seven Perfected.\nAwakening to words beyond the five phases,\nAttaining the ninefold cyclical return’s secret.\nSweet springs moisten all things,\nTransforming decay and restoring spring.\nGolden Kingdom’s immortal visage,\nThrough fourfold words grasped the Dao;\nWeizhou’s transformations,\nSeated for a decade to perfect truth.\nWall’s ink traces—no common mark,\nSnowy bamboo and moonlit pine—unusual grace.\nTwo wells bear records of many lives,\nOne moment reveals manifest transformation’s merit.\nSix years at Pan Brook,\nSeven years at Dragon Gate.\nDaoist merit complete, name reached the temporal lord;\nElixir talismans bestowed, wielding divine immortals’ power.\nDiscoursing on the mysterious upon stone,\nFlying canopy in empty space.\nThe Yuan ruler repeatedly summoned to inquire the Dao,\nTimely sweet rains relieved the people.\nEarly mastering the *Book of Changes’* words,\nLate achieving immortals’ secrets.\nHexagrams and charts thus unfolded,\nThe great Dao perfected.\n*Pure Serenity’s* Unattached One,\nExploring the mysterious, attaining the Dao,\nPenglai’s immortal path,\nAlone upheld through kalpas unnumbered,\nCompassionately relieving suffering,\n*Complete Perfection’s* Founding Ancestral Master.\n*Unwavering Unity’s* All-Transforming *Universal Transformation* Perfected Lord,\n*Eternal Truth’s* Spirit-Concentrating *Mysterious Serenity* Accumulating *Virtue* Perfected Lord,\n*Eternal Life’s* Assisting-Transforming *Lineage-Mystery* Illuminating *Virtue* Perfected Lord,\n*Eternal Spring’s* *Complete Virtue* Spirit-Transforming *Luminous Response* *Teaching-Master* Perfected Lord,\n*Jade Yang’s* *Embodied Mystery* *Vast Compassion* *Universal Deliverance* Perfected Lord,\n*Grand Antiquity’s* *Vast Tranquility* *Penetrating Mystery* *Wondrous Ultimate* Perfected Lord,\n*Serene Depth’s* *Profound Chastity* *Mysterious Emptiness* *Compliant Transformation* Perfected Lady,\nSeven Perfected’s Transformative Heavenly Worthies.\n\n**Southern Five Ancestors’ Invocation**\nIlluminating truth, verifying the Dao,\nPracticing transformation in the southern heavens.\n\nNine Sovereigns descended their traces upon Tiantai,\nA single lineage dredged through to Ancestor Liu.\nGathering the numinous jade-flower’s transcendence,\nComposing the *Awakening to Reality*’s cinnabar scriptures.\nThe Dao entrusted to Apricot Grove,\nSoon compiling the *Returning to the Origin*’s chapters;\nThe Dharma flowing to Cock’s Foot Mountain,\nTherein completing the *Cinnabar Marrow*’s canon.\nThe Perfected One emerged in Huizhou,\nHis nature’s ground awakening to surpassing spirit-brilliance.\nUpon ingesting the elixir-spoon’s measure, his divine transformations knew no bounds.\nManifesting thunder-rain in his palm,\nReviving the people’s lives beyond the world’s edge.\nHis virtue shone across the Southern Sea,\nAttaining the jade-essence’s noble standard;\nHis Dao pervaded distant wilds,\nSatiated with the Dharma’s wondrous subtleties.\nDragon-Tiger’s floating gauze traces,\nWuyi’s Jade Prosperity precincts—\nPassing through transformations in many realms,\nTrue writs fully revealed,\nCrowned as the foremost of immortals,\nGathering the paradigms of former ages.\nVows profound and vast,\nCompassionate, benevolent, and sagely Ancestral Master:\n*Awakening to Reality*’s Purple Yang Perfected One,\nApricot Grove’s Emerald Mystery Perfected One,\nDao-Light’s Purple Worth Perfected One,\nMud-Pill’s Emerald Emptiness Perfected One,\nJade Tube’s Purple Clarity Perfected One.\n\n**Invocation of the Vacuous Tranquility Celestial Master**\nWhite snow’s cinnabar dissolves,\nYellow sprouts’ old accumulations.\nLiterary brilliance like stars,\nThe Old Lord transmitted the *Three-Five Flying Steps*’ mystery;\nJade Bureau’s talismanic registers,\nThe Han Ancestor passed down the *Orthodox Unity*’s demon-slaying decree.\nThereby inscribing names in the Purple Palace,\nThereby wielding authority over thunder,\nEradicating pestilence in Qingcheng,\nAnnihilating demonic vapors in the lower realms.\nMajestic and boundless,\nSubtle and wondrously profound—\nDeparting the Great Ultimate,\nAscending the Purple Tenuity,\nAssembling the Three Flowers,\nFacing the Five Qi.\nAdapting to circumstances to rectify things,\nLeisurely expelling evil and preserving spirit.\nAncestral Master, the Thirty-Third-Generation Celestial Master,\n*Vacuous Tranquility’s* *Vast Penetration* *Awakening to the Dao* Perfected Lord,\n*Mystic Wind’s* *Evolving Transformation* Heavenly Worthy.\n\n**Invocation of the Attendant of the Celestial Court**\nSupreme Divine Empyrean,\nJade Clarity’s Thunder Bureau.\nLight divided from the Primordial Qi,\nConcentrated in the Jun Peak’s refinement;\nDao moving through the Five Phases,\nAttending the august ancestral temple.\nThunder-rain in his grasp,\nSaving from drought and dispelling calamities,\nDirecting yin and yang with a glance,\nPacifying the state and protecting the nation—\nMerits equaling eons,\nTeaching’s ancestral master,\nVirtue aiding the deluded,\nFather of compassion to all beings:\n*Vacuous Penetration’s* *Mystic Wonder* *Spirit-Wisdom* Perfected Lord.\n\n**Invocation of the Thunder Perfected One**\nSupreme Divine Empyrean’s Bureau,\nMystic Capital’s Law-Enforcing Venerable,\nDharma-Evolving Great Perfected One,\nJade Emperor’s Attendant Censor,\nNine Heavens’ Chief Inspector.\nDharma-expounding compassionate father,\nWorld-saving true master,\nOverseeing the Three Realms,\nGoverning the myriad spirits,\nJade Capital’s chief minister,\n*Primal Chaos’* *Wondrous Dao* *Universal Salvation* Perfected Lord,\n*Thunder’s Voice* *Dharma-Evolving* Heavenly Worthy.\n\n**Invocation of the Xin Heavenly Lord**\nSupreme Azure Empyrean’s Upper Clarity Radiant King,\nEastern Ultimate’s Life-Infusing Azure Florescence Great Emperor,\nNanchang’s Fire Bureau’s Illuminating Fierce Officer,\nYang Essence’s Refining and Liberating Law-Enforcing Perfected One,\nDividing authority and fixing the balance,\nTrue King of the Mystic Capital’s Jade Bureau’s *Great Ultimate* *Primordial* *Vacuous Mystery* *Upper Officer*,\n*Grand Monad’s* Wooden Youth,\n*Primordial* Marshal of the *All-Uniting* Host,\nNine Heavens’ Examiner and Comparator,\nOffice of the *Primordial* Treasurer of Fortune and Fate-Determining Perfected Lord,\nIron Brush’s Law-Recording Great Spirit,\n*Light’s* *Quiescence* *Heaven-Penetrating* *Dharma-Evolving* Great Marshal,\nGoverning wind, clouds, thunder, rain,\nLightning, frost, snow, hail,\nSilver fangs gleaming, eyes flashing,\nOverseeing the Three Realms,\nThirty-Six Heavens’ Thunder’s Great Commander-in-Chief,\nAzure Emperor Heavenly Lord,\n*Primordial Beginning’s* *One Qi* *Commanding* *Myriad Spirits* *Grand Monad’s* *Five Thunders* *Judgment Bureau* Heavenly Worthy.\n\n**Invocation of the Deng Heavenly Lord**\nSupreme Divine Empyrean’s Jade Clarity True King,\nSouthern Culmen’s Longevity Vermilion Mound Great Emperor,\nGrand Yang’s Nine Dragons August Lord,\nNanchang’s Upper Palace’s Refining-Receiving Perfected One,\nUtmost True Thunderclap Great Immortal,\nMystic Capital’s Nine Doubts’ Nine Yi’s Penglai’s Cangshui’s Messenger,\nUpper Clarity’s Three Realms’ Marshal,\nNine Heavens’ Investigating Commissioner,\n*Response and Transformation* *Wondrous Transformation* Perfected Lord,\n*Sudden Fire’s* *Law-Command* Great Spirit,\n*Light’s* *Wondrous* *Heaven-Spanning* *Dharma-Evolving* Great Marshal,\nGoverning wind’s dispatch and rain’s hastening,\nSlaying demons and destroying shrines,\nExpelling all from pools and caverns,\nCommanding the Three Origins’ Eighty-One Days’ Thunder’s Generalissimo,\nFlame Emperor Heavenly Lord,\n*Primordial Beginning’s* *Kalpa’s* *One Qi* *Dividing* *True* *Grand Monad’s* *Thunder’s Voice* *Universal Transformation* Heavenly Worthy.\n\n**Invocation of the Zhang Heavenly Lord**\nSupreme Divine Empyrean’s Jade Clarity True King,\nSouthern Culmen’s Life-Protecting Grotto-Yin Great Emperor,\nBright Valley’s Divine Lord,\nQing Capital’s Law-Command,\nPenglai’s Water Bureau’s Messenger,\nNine Heavens’ Investigating Commissioner,\nGreat Marshal of the Thirty-Three Heavens’ Thunder’s Generalissimo,\nGoverning the thunder-clouds and lightning-rain departments,\nJade Bureau’s Memorial-Submitting Demon-Quelling Heavenly Lord,\nThree Realms’ and Grotto-Abyss’ True Arbiter,\nSlaying the Five Treacheries’ and Rewarding Goodness’ and Punishing Evil’s Messenger,\n*Flying Swiftly* *Response-Manifesting* Perfected Lord,\n*Primordial Beginning’s* *One Qi* *Governing* *Myriad Spirits* *Grand Monad’s* *Five Thunders* *Vast Response* Heavenly Worthy.\n\n**Invocation of Marshal Zhao**\nSpirit-communication grandly evolving,\nSacred virtue luminously manifest—\nCongealing form at the Great Brahmā’s inception,\nRevealing transformations in the boundless world.\nWielding whip and lasso,\nDriving tigers and subduing demons,\nSoaring through the Three Realms—ghosts and spirits tremble;\nA single breath—heaven and earth quake.\nMajestic radiance resplendent,\nNone disobey his unspoken will;\nMystic mirror’s spirit-brilliance,\nAll who seek find response.\nRescuing living beings from suffering,\nPreserving households and nations in peace,\nExtolling the Dao’s Dharma without end,\nEternally upholding the mystic wind—\nGreat compassion, great vows,\nGreat sage, great mercy,\nHeaven-Assisting Vast Saint,\n*As-You-Will* *Harmonious* *Primordial* *Spirit* Great Divine Lord.\n\nThe Perfected Lords’ true words conclude.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "诸师真诰 经名：诸师真语。 一卷。 底本出处：《正统道藏》洞真部赞颂类。 诸师真诰 元始至尊号 志心归命礼，三界之上，梵炁弥罗。 上极无上，天中之天。 郁罗萧台，玉山上京。 渺渺金阙，森罗净泓。 玄元一炁，混沌之先。 宝珠之中，玄之又玄。 开明三景，化生诸天。 亿万天真，无鞅数众。 旋斗历箕，回度五常。 巍巍大范，万道之宗。 大罗玉清、虚无自然、至真妙道元始天尊。 上清号 志心归命礼，居上清境，号灵宝君。 祖劫化生，九万九千余梵炁； 赤书焕发，六百六十八真文。 因混沌赤文而开九霄，纪元洞玉历而分五劫。 天经地纬，巍乎造化之宗； 枢阴机阳，卓尔雷霆之祖。 大悲大愿、大圣大慈、玉宸道君灵宝天尊。 泰清号 志心归命礼，随方设教，历劫度人。 为皇者师，帝者师，王者师，假名易号； 立天之道，地之道，人之道，隐圣显凡。 总千二百之官君，包万亿重之梵炁。 化行今古，着道德凡五千言； 主握阴阳，命雷霆用九五数。 大悲大愿、大圣大慈、太上老君道德天尊。 弥罗号 志心归命礼，弥罗无上天，妙有玄真境。 渺渺紫金阙，太微玉清宫。 无极无上圣，无无复光明。 寂寂浩无宗，玄范总十方。 湛寂真常道，恢漠大神通。 穹苍真老，妙圆清静。 智慧辩才，至道至尊。 三界师，混元祖。 无能圣主，四生慈父。 高天上圣，大慈仁者。 十号圆满，万德周身。 无量度人，拔生死苦。 诸佛之师，众圣之王。 太上开天执符、御历含真、体道金阙、云宫九穹、历御万道、无为大通明殿、昊天玉皇大天尊、玄穹高上帝。 天皇号 志心归命礼，紫微宸极，勾陈天宫。 九光宝苑之中，五炁玄都之上。 体元皇，而佐司玄化； 总两极，而共理三才。 主持兵革之权衡，广推大德； 统御星辰之躔次，毋失常经。 上象巍峨，真元恢漠。 大悲大愿、大圣大慈、勾陈上宫天皇上帝。 星主号 志心归命礼，大罗天阙，紫微星宫。 尊居北极之高，位正中天之上，佛号金轮炽盛，道称玉斗玄尊。 璇玑玉衡，齐七政； 总天经地，纬日月。 星宿约，四时行，黄道紫垣，万象宗师，诸天统御。 大悲大愿、大圣大慈、万星教主、无极元皇、中天紫微北极大帝。 后土号 志心归命礼，九华玉阙，七宝皇房。 承天禀命之期，主阴执阳之柄。 道推尊而含弘光大； 德数蓄於柔顺利贞。 效法昊天，根本育坤元之美； 流形品物，生成施母道之仁。 岳渎是依，山川咸伏。 大悲大愿、大圣大慈、承天效法、后土皇地祇。 神霄号 志心归命礼，高上神霄府，凝神焕照宫。 会元始祖炁以分真； 应妙道虚无而开化。 位乎九霄之上，统理诸天； 总乎十极之中，宰制万化。 宣金符而垂光济苦，施惠泽而覆育兆民。 恩溥乾元，仁敷浩劫。 大悲大愿、大圣大慈、玉清真王、南极长生大帝、统天元圣天尊。 救苦号 志心归命礼，青华长乐界，东极妙严宫。 七宝芳骞林，九色莲花座。 万真环拱内，百亿瑞光中。 上清灵宝尊，应化玄元始。 浩劫垂慈济，大千甘露门。 妙道真身，紫金瑞相。 随机赴感，誓愿无边。 大圣大慈、大悲大愿、十方化号、普度众生、亿亿劫中、度人无量、寻声赴感、太一救苦天尊、青玄上帝。 可韩号 志心归命礼，高上丹霄，隶元上府。 朱官绛阙，毓神光於浩劫之家；",
      "translated_text": "**True Teachings of the Various Masters**\n*Sutra Title: True Utterances of the Various Masters*\n*One Scroll*\n*Source Text: \"Daoist Canon of the Zhengtong Era,\" Dongzhen Section, Hymns and Eulogies Category*\n\n---\n\n**Eulogy of the Primordial Celestial Worthy**\nWith sincere heart, I bow in reverence:\nAbove the Three Realms, the vastness of Brahma-qi pervades.\nSupreme beyond all supremacy, the Heaven within Heaven.\nIn the lofty halls of Yuluo Xiaotai, the Jade Capital upon the Mountain,\nThe boundless Golden Towers stand, where the pure and profound waters gather.\nThe primordial One Qi, before the chaos of origins,\nWithin the Jeweled Pearl, the mystery beyond mystery.\nThe Three Luminaries unfold, giving birth to the myriad heavens,\nCountless celestial perfected ones, an immeasurable host.\nRevolving the Dipper, traversing the Winnowing Basket, cycling through the Five Constants,\nMajestic and vast, the great model, the origin of the myriad Ways.\n**The Primordial Celestial Worthy of the Great Mystery, the Void and Spontaneity, the Most Perfect Dao of the Jade Clarity and Great Luo Heaven.**\n\n---\n\n**Eulogy of the Supreme Clarity**\nWith sincere heart, I bow in reverence:\nDwelling in the realm of Supreme Clarity, titled the Numinous Treasure Lord.\nBorn of the ancestral kalpa, from ninety-nine thousand and more Brahma-qi;\nThe Crimson Script shines forth, with six hundred and sixty-eight true characters.\nBy the Crimson Script of Chaos, the Nine Empyreans were opened;\nBy the Jade Calendar of the Origin, the Five Kalpas were divided.\nHeaven’s warp and earth’s weft, majestic as the origin of creation;\nThe pivot of yin and the mechanism of yang, the august ancestor of thunder.\n**The Most Compassionate, Most Vowed, Most Sagely, Most Benevolent, Jade Emperor Dao Lord, Numinous Treasure Celestial Worthy of the Supreme Clarity.**\n\n---\n\n**Eulogy of the Grand Clarity**\nWith sincere heart, I bow in reverence:\nTeaching according to the times, delivering beings across kalpas.\nAs the teacher of emperors, the teacher of kings, adopting names and titles as expedients;\nEstablishing the Way of Heaven, the Way of Earth, the Way of Humanity, concealing sageliness and manifesting the ordinary.\nEncompassing the twelve hundred officials, embracing the myriad layers of Brahma-qi.\nTransformations spanning past and present, expounding the *Dao and Virtue* in five thousand words;\nGoverning yin and yang, commanding thunder with the power of nine and five.\n**The Most Compassionate, Most Vowed, Most Sagely, Most Benevolent, Most High Lord Lao, Celestial Worthy of the Dao and Virtue.**\n\n---\n\n**Eulogy of the Miro**\nWith sincere heart, I bow in reverence:\nThe Supreme Heaven of Miro, the wondrous and mysterious realm of the True.\nThe boundless Purple-Golden Towers, the Jade Clarity Palace of the Grand Tenuity.\nThe Saint beyond the Ultimate, the Radiance beyond the Non-Ultimate.\nSerene and vast, without origin, the profound model encompassing the ten directions.\nThe tranquil and constant Dao, the boundless great spiritual power.\nThe True Elder of the Vault of Heaven, wondrously perfect and pure.\nWisdom and eloquence, the Most Honored of the Dao.\nTeacher of the Three Realms, Ancestor of the Primordial Chaos.\nUnsurpassed Sagely Lord, Compassionate Father of the Four Kinds of Beings.\nExalted Sage of the High Heavens, the Greatly Benevolent One.\nTen titles perfected, myriad virtues embodied.\nLimitlessly delivering beings, rescuing from the suffering of birth and death.\nTeacher of all Buddhas, King of all Sages.\n**The Most High, Heaven-Opening Talisman-Holder, Calendar-Wielder and Truth-Embodier, Golden Tower of the Dao-Body, Nine-Apertured Cloud Palace, Governor of the Myriad Ways, Great Effortless Luminous Hall, August Jade Emperor of the Vast Heaven, Supreme Sovereign of the Lofty Firmament.**\n\n---\n\n**Eulogy of the Heavenly Emperor**\nWith sincere heart, I bow in reverence:\nThe Purple Tenuity’s imperial pole, the Celestial Palace of the Curved Array.\nWithin the Garden of Ninefold Radiance, above the Five Qi’s Mysterious Capital.\nEmbodying the Primordial Emperor, assisting in the mysterious transformations;\nEncompassing the Two Poles, jointly governing the Three Powers.\nHolding the balance of military authority, broadly extending great virtue;\nOverseeing the celestial bodies’ courses, ensuring constancy in their paths.\nLofty as the celestial image, vast as the true and primordial.\n**The Most Compassionate, Most Vowed, Most Sagely, Most Benevolent, Heavenly Emperor of the Curved Array’s Upper Palace.**\n\n---\n\n**Eulogy of the Star Lord**\nWith sincere heart, I bow in reverence:\nIn the towers of the Great Luo Heaven, the Star Palace of the Purple Tenuity.\nExalted in the heights of the North Culmen, enthroned above the center of heaven,\nKnown in Buddhism as the Blazing Golden Wheel, in Daoism as the Mysterious Lord of the Jade Dipper.\nThe Jade Armillary and Jade Balance, aligning the Seven Governors;\nEncompassing the warp of heaven and weft of earth, guiding the sun and moon.\nThe constellations bound, the four seasons proceed, the Purple Enclosure of the Yellow Path,\nMaster of the myriad images, governor of all heavens.\n**The Most Compassionate, Most Vowed, Most Sagely, Most Benevolent, Teaching Lord of the Myriad Stars, Boundless Primordial Emperor, Great Emperor of the Purple Tenuity and North Culmen of the Central Heaven.**\n\n---\n\n**Eulogy of the Queen of Earth**\nWith sincere heart, I bow in reverence:\nThe Nine-Flowered Jade Towers, the Jeweled Imperial Chambers.\nReceiving the mandate of heaven, wielding the handle of yin and the lever of yang.\nThe Dao exalted, vast and luminous;\nVirtue accumulated in gentleness, harmony, benefit, and constancy.\nFollowing the example of the Vast Heaven, nurturing the beauty of Earth’s origin;\nFlowing through forms and beings, bestowing the kindness of the Mother’s Way.\nMountains and rivers depend on Her, all peaks and streams submit.\n**The Most Compassionate, Most Vowed, Most Sagely, Most Benevolent, Mandate-Receiving and Heaven-Emulating, August Earth Queen and Earthly Deity.**\n\n---\n\n**Eulogy of the Divine Empyrean**\nWith sincere heart, I bow in reverence:\nThe Highest Divine Empyrean Court, the Palace of Concentrated Spirit and Radiant Illumination.\nConverging the ancestral qi of the Primordial Beginning to differentiate the true;\nResponding to the wondrous Dao’s emptiness to initiate transformation.\nEnthroned above the Nine Empyreans, governing all heavens;\nEncompassing the Ten Poles, presiding over the myriad transformations.\nProclaiming the golden talismans to bestow radiance and relieve suffering,\nDispensing beneficent moisture to nurture the multitudes.\nGrace as vast as the primal qi, benevolence as boundless as the kalpas.\n**The Most Compassionate, Most Vowed, Most Sagely, Most Benevolent, True King of the Jade Clarity, Great Emperor of Longevity of the Southern Culmen, Primordial Sage of Heaven’s Governance.**\n\n---\n\n**Eulogy of the Savior from Suffering**\nWith sincere heart, I bow in reverence:\nThe Realm of Everlasting Joy, the Wondrous and Solemn Palace of the Eastern Culmen.\nThe Fragrant Forest of Seven Treasures, the Nine-Colored Lotus Throne.\nSurrounded by the myriad perfected, within the radiance of a hundred million auspicious lights.\nThe Supreme Clarity’s Numinous Treasure Worthy, the responsive transformation of the Primordial Beginning.\nAcross kalpas, extending compassion and salvation, the gateway of sweet dew for the great thousand worlds.\nThe wondrous true body, the purple-golden auspicious form.\nResponding to conditions, vows boundless.\n**The Most Sagely, Most Benevolent, Most Compassionate, Most Vowed, Ten Directions’ Transformative Titles, Universally Delivering Beings, Limitlessly Delivering in Countless Kalpas, Responding to Cries and Appearing, Celestial Worthy of Great Unity and Salvation from Suffering, August Emperor of the Azure Heavens.**\n\n---\n\n**Eulogy of the Kehan**\nWith sincere heart, I bow in reverence:\nThe Highest Cinnabar Empyrean, attached to the Upper Primordial Court.\nThe Crimson Palace and Vermilion Towers, nurturing divine radiance in the household of vast kalpas.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1274,
      "start_sentence": 0,
      "end_sentence": 93,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.70913028717041,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\赞颂类\\诸师真诰.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "宝木骞林，现瑞相於太清之境。 运大化慈悲之造，降真精橐钥之机。 削死上生，广天地一元之德； 陶魂铸魄，回幽灵万类之生。 焕发阳明，普疏阴境。 大悲大愿、大圣大慈、九天青城、可韩丈人、朱陵度命天尊。 普化号 志心归命礼，九天应元府，无上玉清王。 化形而满十方，谈道而趺九凤。 三十六天之上，阅宝笈，考琼书； 千五百劫之先，位正真，权大化。 手举金光如意，宣说玉枢宝经。 不顺化作微尘，发号疾如风火。 以清净心，而弘大愿； 以智慧力，而伏诸魔。 总司五雷，运心三界。 群生父，万灵师，大圣大慈、至皇至道、九天应元雷声普化天尊。 雷祖号 志心归命礼，高上玉霄府，雷霆洞渊宫。 三境分真，九天演化，光会大罗之表，神通浩渺之天。 拯水旱於下方，祛虫蝗於历劫。 发弘誓愿，利济众生。 大圣大慈、大悲大愿、九天雷祖大帝、除灾济物天尊。 太一号 志心归命礼，高上琅霄府，紫微碧玉宫。 光焕郁萧，真凝太极。 发妙炁於金阙，烜大化於混茫。 回淳风於浇漓之余，保制劫运； 恢利泽於寰宇之表，陶育黔黎。 大圣大慈、大悲大愿、上清紫微碧玉宫、太一大天帝、保制劫运天尊。 洞渊号 志心归命礼，高上太霄境，六天洞渊官。 瑞相端严，现光明於碧落之境； 真身广博，敷妙泽於种民之天。 遏五府之魔灵，荡万方之瘴疠。 跻民生於仁寿，抚治化於希夷。 大悲大愿、大圣大慈、六天洞渊大帝、伏魔上上太一天尊。 六波号 志心归命礼，紫霄上境，六波天宫。 妙相光明，现慈颜於天一； 宸居寥廓，施福惠於人寰。 捍浩渺之洪灾，济炎威之回禄。 陶镕万汇，综理一元。 大圣大慈、大悲大愿、六波天主帝君普施法润天尊。 采访号 志心归命礼，紫玄景曜府，九天保运宫。 至道分光，总十方之梵炁； 真常显妙，回浩劫之浇风。 采录诸天，纪善功而消恶籍； 恩融万化，标禄字而上生名。 大圣大慈、大悲大愿、九天采访朱陵上帝、应元保运妙化天尊。 斗母号 志心归命礼，西天竺国，大智光中，真空妙相法王师，无上玄元天母主。 金光烁处，日月潜辉。 宝杵旋时，鬼神失色。 显灵踪於尘世，卫圣驾於阎浮。 众生有难，若称名； 大士寻声，来救苦。 大悲大愿、大圣大慈、圣德巨光天后、摩利支天大圣。 三官诰 唯三圣人，乃一太极。 晋受浩劫家之命，鼎膺无量品之褒。 紫微清虚，洞阴总领，功过赐福，赦罪解厄，溥济存亡，道冠诸天，恩覃三界。 大悲大愿、大圣大慈、三元三品三官大帝、三宫九府应感天尊。 火官诰 四元四品，考较火官。 运扶乾健，德合离明。 居太阳丹天之中，统左府注生之籍。 盛德在火，炎帝持衡。 功参佐於三元，气运行於四月。 驾赤龙而行南陆，照明荧惑之宫； 烛朱陵而显丹台，焕赫文昌之府。 辉辉朗耀，炳炳照临。 大悲大愿、大圣大慈、赤皇上品三炁火官炎帝真君、洞阳大帝南丹纪寿天尊。 玄天诰 混元六天，传法教主，修真得道，济度群迷，普为众生，消除灾障。 八十二化三界祖师、大慈大悲、救苦救难、三元都部署、九天游弈使、左天罡北极右垣大将军、镇天助顺、真武灵应、福德衍庆、仁慈正烈、协运真君、治世福神玉虚师相玄天上帝、金阙化身荡魔终劫济苦天尊。",
      "translated_text": "With sincere heart, I bow in reverence:\nThe Precious Kānlín Grove, manifesting auspicious signs in the Great Clarity’s realm.\nWielding the transformative power of great compassion, descending the mechanism of true essence’s bellows-key.\nSevering death to ascend life, expanding the virtue of Heaven-and-Earth’s singular origin;\nRefining souls and forging spirits, restoring the lives of the ten thousand dark and numinous kinds.\nRadiating yang’s luminosity, universally dredging the yin’s domains.\n\n**The Most Sagely, Most Benevolent, Most Compassionate, Most Vowed, Nine Heavens’ Azure City, Kehan the Venerable, Vermilion Mound’s Deliverer of Lives, Celestial Worthy.**\n\n**Universal Transformation’s Title**\nWith sincere heart, I bow in reverence:\nThe Nine Heavens’ Responsive Primordial Court, the Supreme Jade Clarity King.\nTransforming forms to fill the ten directions, discoursing on the Dao while seated upon nine phoenixes.\nAbove the thirty-six heavens, perusing precious scrolls and examining jade texts;\nBefore the fifteen hundred kalpas, holding the position of true orthodoxy and wielding the authority of great transformation.\nRaising the golden radiance ruyi, proclaiming the *Jade Pivot’s Precious Scripture*.\nThose who resist are reduced to motes of dust, issuing commands swift as wind and fire.\nWith pure and still heart, vast vows are magnified;\nWith the power of wisdom, all demons are subdued.\nOverseeing the five thunders, directing intention through the three realms.\nFather of all beings, teacher of the ten thousand spirits.\n\n**The Most Sagely, Most Benevolent, Most Venerated, Most Daoic, Nine Heavens’ Responsive Primordial Thunder-Voice Universal Transformation Celestial Worthy.**\n\n**Thunder Ancestor’s Title**\nWith sincere heart, I bow in reverence:\nThe Supreme Jade Empyrean Court, the Thunderbolt’s Abyssal Palace.\nThree realms divide the true, nine heavens unfold transformation, light converges beyond the Great Net, divine power pervades the boundless heavens.\nRescuing from flood and drought below, dispelling locusts and pests across kalpas.\nIssuing vast vows, benefiting and delivering all beings.\n\n**The Most Sagely, Most Benevolent, Most Compassionate, Most Vowed, Nine Heavens’ Thunder Ancestor Great Emperor, Disaster-Removing and Salvation-Bestowing Celestial Worthy.**\n\n**Great Unity’s Title**\nWith sincere heart, I bow in reverence:\nThe Supreme Lang Empyrean Court, the Purple Tenuity’s Jasper Jade Palace.\nRadiance resplendent, the true congeals in the Supreme Ultimate.\nEmitting wondrous qi from the golden portals, blazing great transformation through the primordial vastness.\nRestoring the pure wind amid the dregs of decadence, safeguarding and regulating the kalpic destiny;\nExpanding beneficent moisture beyond the earthly realm, nurturing and fostering the black-haired people.\n\n**The Most Sagely, Most Benevolent, Most Compassionate, Most Vowed, Supreme Clarity’s Purple Tenuity Jasper Jade Palace, Great Unity Great Heavenly Emperor, Kalpic Destiny-Safeguarding Celestial Worthy.**\n\n**Abyssal Cavern’s Title**\nWith sincere heart, I bow in reverence:\nThe Supreme Great Empyrean Realm, the Six Heavens’ Abyssal Cavern Palace.\nAuspicious signs solemn and majestic, manifesting radiant light in the azure vault’s realm;\nTrue body vast and expansive, bestowing wondrous moisture upon the seed-people’s heavens.\nSuppressing demonic spirits of the five palaces, sweeping away miasmas of the ten thousand regions.\nElevating the people’s lives to benevolence and longevity, governing and transforming through the subtle and tranquil.\n\n**The Most Compassionate, Most Vowed, Most Sagely, Most Benevolent, Six Heavens’ Abyssal Cavern Great Emperor, Supreme Demon-Subduing Great Unity Celestial Worthy.**\n\n**Six Waves’ Title**\nWith sincere heart, I bow in reverence:\nThe Purple Empyrean’s Upper Realm, the Six Waves’ Heavenly Palace.\nWondrous signs radiant and luminous, manifesting a compassionate countenance in Heaven’s Unity;\nCelestial abode vast and boundless, bestowing blessings and kindness upon the human world.\nDefending against vast deluges, rescuing from scorching conflagrations.\nRefining and molding the ten thousand transformations, unifying and governing the singular origin.\n\n**The Most Sagely, Most Benevolent, Most Compassionate, Most Vowed, Six Waves’ Heavenly Lord Emperor, Universally Bestowing Dharma-Moisture Celestial Worthy.**\n\n**Investigator’s Title**\nWith sincere heart, I bow in reverence:\nThe Purple Mystery’s Resplendent Court, the Nine Heavens’ Destiny-Safeguarding Palace.\nThe supreme Dao divides its radiance, gathering the ten directions’ pure qi;\nThe true and constant reveals the wondrous, restoring the decadent winds of vast kalpas.\nInvestigating and recording the various heavens, inscribing good deeds to erase evil registers;\nGrace permeates the ten thousand transformations, inscribing names of fortune and ascending life.\n\n**The Most Sagely, Most Benevolent, Most Compassionate, Most Vowed, Nine Heavens’ Investigator Vermilion Mound Emperor, Responsive Primordial Destiny-Safeguarding Wondrous Transformation Celestial Worthy.**\n\n**Dipper Mother’s Title**\nWith sincere heart, I bow in reverence:\nIn the Western Land of India, within the Great Wisdom’s Light, the True Emptiness Wondrous Sign Dharma King Teacher, the Supreme Primordial Heavenly Mother Lord.\nWhere golden light blazes, sun and moon conceal their brilliance;\nWhen the jeweled pestle revolves, ghosts and spirits lose their color.\nManifesting numinous traces in the dusty world, guarding the sacred chariot in Jambudvīpa.\nWhen beings encounter calamity, should they invoke her name;\nThe Great Being, responding to cries, comes to deliver from suffering.\n\n**The Most Compassionate, Most Vowed, Most Sagely, Most Benevolent, Sacred Virtue’s Vast Light Heavenly Queen, Mārīcī Great Sage.**\n\n**Three Officials’ Proclamation**\nThe Three Sagely Ones are but a single Supreme Ultimate.\nReceiving the mandate of the vast kalpas’ household, bearing the infinite ranks’ commendations.\nPurple Tenuity’s pure emptiness, governing the yin’s totality, bestowing fortune according to merit, absolving sins and dissolving calamities, universally aiding the living and the dead, the Dao crowning all heavens, grace extending through the three realms.\n\n**The Most Compassionate, Most Vowed, Most Sagely, Most Benevolent, Three Origins Three Ranks Three Officials Great Emperors, Three Palaces Nine Bureaus Responsive Celestial Worthies.**\n\n**Fire Official’s Proclamation**\nFour origins, four ranks, examining the Fire Official.\nOperating to assist the firmness of Qian, virtue uniting with the clarity of Li.\nDwelling within the Vermilion Heaven of the Great Yang, presiding over the left bureau’s register of births.\nVirtue flourishing in fire, the Flame Emperor holds the balance.\nMerit assisting the Three Origins, qi circulating in the fourth month.\nRiding the red dragon to traverse the southern lands, illuminating the Palace of Mars;\nIlluminating the Vermilion Mound to reveal the Cinnabar Terrace, resplendent in the Wenchang Mansion’s precincts.\nBrilliant and luminous, shining and illuminating.\n\n**The Most Compassionate, Most Vowed, Most Sagely, Most Benevolent, Red Emperor’s Upper Rank Three Qi Fire Official Flame Emperor Perfected Lord, Cavern Yang Great Emperor Southern Vermilion Longevity Celestial Worthy.**\n\n**Dark Heaven’s Proclamation**\nPrimordial Six Heavens’ Dharma-Teaching Master, cultivating the true and attaining the Dao, delivering the deluded multitude, universally aiding beings in dispelling calamities and obstacles.\nEighty-two transformations, Three Realms’ Patriarch, **Most Compassionate, Most Vowed, Savior from Suffering, Savior from Calamity, Three Origins Commander-in-Chief, Nine Heavens’ Roaming Enforcer, Left Heavenly Stem Northern Culmen Right Wall Great General, Heaven-Fortifying and Assisting Compliance, True Martial Numinous Response, Fortune-Virtue Proliferating Blessings, Benevolent and Upright, Harmonizing Destiny Perfected Lord, Governance and Blessing Deity Jade Clarity Preceptor Minister Dark Heaven Emperor, Golden Portal’s Manifestation Demon-Quelling Kalpa-Ending Suffering-Delivering Celestial Worthy.**",
      "overlap_context": "st Vowed, Ten Directions’ Transformative Titles, Universally Delivering Beings, Limitlessly Delivering in Countless Kalpas, Responding to Cries and Appearing, Celestial Worthy of Great Unity and Salvation from Suffering, August Emperor of the Azure Heavens.**\n\n---\n\n**Eulogy of the Kehan**\nWith sincere heart, I bow in reverence:\nThe Highest Cinnabar Empyrean, attached to the Upper Primordial Court.\nThe Crimson Palace and Vermilion Towers, nurturing divine radiance in the household of vast kalpas.",
      "start_char": 1274,
      "end_char": 2534,
      "start_sentence": 94,
      "end_sentence": 170,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.539243936538696,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\赞颂类\\诸师真诰.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "祖天师诰 本来南土，上泝蜀都，先获黄帝九鼎之丹书，后事老君两度於玉局。 千轴得修行之要，一时成吐纳之功。 法箓全成，受盟威品而结璘诀； 正邪两辩，夺福庭治而化咸泉。 德就大丹，道齐七政。 大悲大愿、大圣大慈、三天扶教辅玄体道大法天师、雷霆都省泰玄上相都天大法主、正一冲玄神化静应显佑真君、六合无穷高明大帝、降魔护道天尊。 路祖师诰 诞生汉室，锡号晋朝。 惟布炁以降邪，曾吞虎而救世。 管玉霄洞真之法，传玄室内教之经。 掌雷府刑，行都督府便宜之事； 授天师职，升紫微天右相之斑。 判保阳宫，主混元教。 大悲大愿、大圣大慈、真元清皇上帝太虚普惠真君、九天宝册司命天尊。 魏祖诰 元皇演化，妙有真身。 光明满月现慈容，清静玄风开正教。 道尊圣祖，德重医王。 主三界之雷霆，校群生之禄籍。 祖师大慈仁者、宸照法王南岳总仙上真、九天司命金阙上保高元清真紫虚元君。 仙公诰 天台得道，合皂成真。 昔受东华，复传西蜀。 诏命玉京金阙，位登太极仙班。 慈怜拯拔於沈沦，恩念普资於苦爽。 葛天氏遗风，显着勾漏； 今丹砂具存，括苍任游。 罗浮乃止翛间，玉笥修理金书。",
      "translated_text": "**Celestial Master’s Invocation**\nOriginally of the southern lands, ascending to the Shu capital, first obtaining the Yellow Emperor’s Nine-Cauldrons’ cinnabar scriptures, later serving the Venerable Lord twice at Jade Bureau. A thousand scrolls distilled the essence of cultivation; in an instant, mastery of breath and absorption was achieved. The registers of the Dharma were perfected, receiving the covenants of the Alliance and forming the radiant mudra. Right and wrong were distinguished, seizing governance of the Blessed Courts and transforming all springs. Virtue perfected the Great Elixir; the Dao aligned with the Seven Governors. Most Compassionate, Most Vowed, Most Sage, Most Benevolent, **Three Heavens’ Upholding-Teaching, Assisting-the-Mysterious, Embodying-the-Dao Great Dharma Celestial Master, Thunder Bureau’s Supreme Ministry Grand Prime Minister of the Great Law, Orthodox Unity’s Penetrating-Mystery Spirit-Transforming, Serene-Response, Manifest-Protection Perfected Lord, Six Harmonies’ Boundless Lofty Luminous Great Emperor, Demon-Quelling, Dao-Protecting Celestial Worthy.**\n\n**Ancestral Master Lu’s Invocation**\nBorn in the Han dynasty, enfeoffed in the Jin. Only by spreading qi were demons subdued; once, swallowing a tiger, he saved the world. He transmitted the Dharma of Jade Clarity Grotto-Truth and passed down the scriptures of the Mysterious Chamber’s inner teachings. Presiding over the Thunder Bureau’s punishments, executing the Military Governor’s prerogatives; conferred the title of Celestial Master, ascending to the Purple Tenuity Heaven’s Right Minister’s rank. Adjudicating the Palace of Preserving Yang, presiding over the Primordial Unity’s teachings. Most Compassionate, Most Vowed, Most Sage, Most Benevolent, **True Origin’s Pure August Supreme Emperor, Great Void’s Universally Beneficent Perfected Lord, Nine Heavens’ Treasure-Register Life-Commanding Celestial Worthy.**\n\n**Ancestral Master Wei’s Invocation**\nThe Primal Sovereign manifested transformation, his wondrous true body existing subtly. Radiance like the full moon revealed his compassionate countenance; the pure and tranquil Mysterious Wind inaugurated the Orthodox Teaching. The Dao honored the Sage Ancestor; virtue weighed heavily as the King of Medicine. Presiding over the Three Realms’ thunder, examining the registers of all beings’ fortunes. **Ancestral Master, Most Benevolent and Compassionate One, Celestial Illumination Dharma King, Southern Marchmount’s Supreme Immortal, Nine Heavens’ Life-Commanding, Golden Portal’s Supreme Guardian, Lofty Origin’s Pure and True, Purple Tenuity Primordial Lord.**\n\n**Immortal Duke’s Invocation**\nAttaining the Dao at Tiantai, merging with the dark and achieving perfection. Once receiving [transmission] from Eastern Florescence, later transmitting it in Western Shu. By imperial decree of Jade Capital and Golden Portal, he ascended to the ranks of the Supreme Ultimate’s immortals. With compassion, he rescued those sunk in suffering; with grace, he universally aided those in distress. The legacy of the Lord of Ge flourished, manifesting at Gou’lou; now, cinnabar remains, and Kuocang’s peaks are his to roam. At Luofu he tarried in carefree ease; on Yuxi he cultivated the golden scriptures.",
      "overlap_context": " from Calamity, Three Origins Commander-in-Chief, Nine Heavens’ Roaming Enforcer, Left Heavenly Stem Northern Culmen Right Wall Great General, Heaven-Fortifying and Assisting Compliance, True Martial Numinous Response, Fortune-Virtue Proliferating Blessings, Benevolent and Upright, Harmonizing Destiny Perfected Lord, Governance and Blessing Deity Jade Clarity Preceptor Minister Dark Heaven Emperor, Golden Portal’s Manifestation Demon-Quelling Kalpa-Ending Suffering-Delivering Celestial Worthy.**",
      "start_char": 2535,
      "end_char": 3003,
      "start_sentence": 171,
      "end_sentence": 199,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.57916569709778,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\赞颂类\\诸师真诰.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "大悲大愿、大圣大慈、太上玉京东昊太极左宫仙公、雷霆玄省天机内相玉虚紫灵普化玄静常道冲应孚佑真君、蚕恩广救慈悲大帝、度人无量天尊。 真君诰 混元始祖，一炁分真。 多劫之前，积修至道。 勤苦备悉，经纬逾深。 万法千门，罔不斯历。 救灾拔难，除害荡妖。 功济生灵，名高王籍。 众真推仰，宜有甄陛。 大悲大愿、大孝大仁、九州都仙太史高明大使雷霆泰省天枢伏魔上相、至道玄应神功妙济掌九天司职太一定命注生真君、三天按察都检校普奏谏议大夫、天医大帝、度人祖师、净明普化天尊。 华盖诰 玉清高圣，虚皇至真。 混元仙主，应化分灵。 含真体道，功行圆成。 驱雷役电，福国康民。 辅佐忠孝，灭罪延龄。 华盖祖师，人天教主。 佥书雷霆三省上相金阙大仙、孚佑显灵超应护国真君、九天掌禄上卿高玄上帝妙道教主、三五飞步正佑妙灵冲应太虚真君、南极注生仙卿玄明上帝、克诚教主九一上清显佑感灵诚应妙远真君、北极考校仙卿大明上帝、三境化身天尊。 梓潼诰 不骄帝境，玉真庆宫。 现九十八化之行藏，显亿千万种之神异。 飞鸾开化於在在，如意救劫以生生。 至孝至仁，功存乎儒道释教； 不骄不乐，职尽乎天地水官。 功德难量，威灵莫测。 大悲大愿、大圣大慈、九天辅元开化主宰司禄职贡举真君、七曲灵应保德弘仁大帝、谈经演教消劫行化更生永命天尊。 三茅真君诰 天人道德，仙圣真师。 孝悌通於神明，恩泽被於家国。 隐恒山而悟道，栖句曲以升天。 主岱宗恒霍之山，职赤城华阳之洞。 劫运阴阳而统斡，雷霆水泽以兼司。 接二弟之英资，授登真之秘诀。 咸领神仙之籍，共膺玉册之荣。 德博幽明，仁沾普率，随机赴感，誓愿弘探。 太元妙道冲虚圣佑真应真君、地仙上真定录右禁冲静德佑妙应真君、地仙至真三官保命冲惠仁佑神应真君、九天司命三茅应化天尊。 麻姑元君诰 圆通湛寂，定应慈仁。 昆仑山示现妙身，青城洞光显圣迹。 过吴度蔡，善应诚而感通； 掷米成丹，常游戏而变化。 总领群仙之上，包罗万汇之中。 炼体九和，超功十极。 大悲大愿、大圣大慈、麻姑真寂冲应仁佑妙济元君。 洪崖仙伯诰 一炁分真，五行毓质。 作上古，神农之师表； 受二仪，灵宝之真机。 常示现於晋唐，每垂光於今昔。 跨雪精於西岭，划长啸於开元。 音动宸旒，清绝湛露之殿； 法传羽褐，绵洪道日之辉。 泽被寰区，恩周普率。 大悲大愿、大孝大仁、洪崖先生青城仙伯、净明经师应化真君。 全真五祖诰 大道开先，玄元阐化。 教垂今古，示号东华。 接汉室之将军，隐终南而仙契。 过化每超於劫运，示现常在於人寰。 启唐朝之英贤，悟神仙之秘诀。 飞剑货药，警化无方。 金廷丞相之高标，宝印力辞之勇决。 霞裾上陟，南北统宗。 天复挺於人豪，道遍通於四海。 发金莲之七朵，演仙派於十方。 长生理被於于今，玄妙天垂於率土。 恢弘至道，广度愚迷。 全真祖师东华紫府辅玄立极大道帝君、正阳开悟传道垂极帝君、纯阳演正警化孚佑帝君、海蟾明悟弘道纯佑帝君、重阳全真开化辅极帝君、五祖阐道天尊。 祖元君诰 元始化炁，清微正宗。 广大高明，悟心全於道体； 刚健纯粹，生性禀於神灵。 致雷霆於无为之中，包天地於有象之外。",
      "translated_text": "**Great Compassion, Great Vows, Great Sage, Great Mercy, Supreme Jade Capital’s Eastern Florescence, Supreme Ultimate’s Left Palace Immortal Duke, Thunder’s Mysterious Ministry Celestial Mechanism Inner Minister, Jade Purity Purple Spirit Universal Transformation Mysterious Serenity Constant Dao Penetrating Response Blessed Aid Perfected Lord; Silkworm Grace Vast Salvation Compassionate Great Emperor; Limitless Salvation Heavenly Worthy.**\n\n**Perfected Lord’s Invocation**\nPrimordial Beginning Ancestor, one *qi* divided into the true.\nCountless kalpas ago, he accumulated cultivation of the supreme Dao.\nWith diligent toil and exhaustive effort, his mastery deepened beyond measure.\nOf the myriad dharmas and thousand gates, none did he fail to traverse.\nRescuing from disaster, delivering from peril, eradicating harm, and vanquishing demons,\nHis merit aided living beings, his name exalted in the celestial registers.\nAll immortals revered and deferred to him, thus was he fittingly ennobled.\n\n**Great Compassion, Great Vows, Great Filial Piety, Great Benevolence, Nine Provinces’ All Immortals Grand Scribe Illustrious Eminent Envoy, Thunder’s Supreme Ministry Celestial Pivot Demon-Subduing Supreme Minister; Supreme Dao Mysterious Response Divine Merit Wondrous Salvation, Nine Heavens’ Controller of Destiny Life-Recording Perfected Lord; Three Heavens’ Inspector-General Universal Examiner Memorializing Remonstrating Grand Master; Celestial Physician Great Emperor; Salvation’s Patriarch; Pure Illumination Universal Transformation Heavenly Worthy.**\n\n**Canopy’s Invocation**\nJade Purity’s Lofty Sage, Empty Sovereign’s Supreme Perfected.\nPrimordial Immortal Lord, responsive transformation dividing the numinous.\nEmbodying the true and realizing the Dao, his merit and conduct perfected.\nCommanding thunder and dispatching lightning, he blessed the realm and prospered the people.\nAiding loyalty and filial piety, eradicating sins and prolonging life.\nCanopy’s Patriarch, Master of Human and Heavenly Teachings.\nCosigning Minister of Thunder’s Three Ministries Supreme Minister Golden Portal Great Immortal; Blessed Aid Manifest Numinous Transcendent Response Protector-State Perfected Lord; Nine Heavens’ Salary-Controlling High Minister Lofty Mystery Supreme Lord Wondrous Dao’s Master; Three-Five Flying Steps Right Blessing Wondrous Numinous Penetrating Response Supreme Void Perfected Lord; Southern Culmen Life-Recording Immortal Minister Mysterious Brilliance Supreme Lord; Sincere Teaching Master Nine-One Supreme Clarity Manifest Blessing Resonant Numinous Far-Reaching Perfected Lord; Northern Culmen Examiner Immortal Minister Great Brilliance Supreme Lord; Three Realms’ Transformation-Body Heavenly Worthy.\n\n**Zitong’s Invocation**\nNot arrogant in the Emperor’s realm, Jade Perfection’s Felicitous Palace.\nManifesting ninety-eight transformations in conduct and concealment,\nDisplaying billions of myriad kinds of divine marvels.\nFlying phoenixes opened enlightenment everywhere;\nWishes fulfilled, he saved kalpas through endless rebirths.\nUtmost filial piety, utmost benevolence—his merit abided in Confucian, Daoist, and Buddhist teachings;\nNeither arrogant nor indulgent—his office fulfilled the duties of Heaven, Earth, and Water officials.\nHis merit and virtue immeasurable, his numinous power unfathomable.\n\n**Great Compassion, Great Vows, Great Sage, Great Mercy, Nine Heavens’ Auxiliary Origin Transformation Governing Lord, Salary-Controlling Tribute-Examining Perfected Lord; Seven Turns’ Numinous Response Protecting Virtue Vast Benevolence Great Emperor; Scripture-Expounding Teaching-Disseminating Disaster-Dispelling Transformation-Practicing Rebirth-Prolonging Life Heavenly Worthy.**\n\n**Three Mao Perfected Lords’ Invocation**\nHeavenly and human Dao and virtue, immortals’ and sages’ true masters.\nFilial piety and fraternal duty communicated with the divine,\nTheir grace and beneficence extended to families and states.\nConcealed on Mount Heng, they awakened to the Dao;\nDwelling on Mount Gouqu, they ascended to heaven.\nPresiding over the sacred mountains of Tai, Heng, and Huo,\nOfficing over the grottoes of Chicheng, Huayang, and beyond.\nGoverning the turning of kalpas and yin-yang,\nConcurrently overseeing thunder, water, and marshlands.\nReceiving the outstanding talents of their two younger brothers,\nTransmitting the secret formulas of immortal ascension.\nAll were enrolled in the registers of immortals,\nTogether receiving the honor of jade tablets.\nTheir virtue embraced the hidden and manifest,\nTheir benevolence universally bestowed.\nResponding to circumstances and answering prayers,\nTheir vows were vast and profound.\n\n**Supreme Origin Wondrous Dao Penetrating Void Sagely Blessed Response Perfected Lord; Earth Immortal Supreme Perfected Right Register Pacifying Forbidden Penetrating Serenity Virtue-Blessed Wondrous Response Perfected Lord; Earth Immortal Supreme Perfected Three Officials Life-Protecting Penetrating Grace Benevolent Blessed Divine Response Perfected Lord; Nine Heavens’ Life-Commanding Three Mao Responsive Transformation Heavenly Worthy.**\n\n**Lady Ma Gu’s Invocation**\nPerfect penetration, profound stillness, settled response, compassionate benevolence.\nOn Kunlun Mountain, she manifested her wondrous body;\nIn Qingcheng Grotto, her sacred traces shone.\nCrossing Wu to save Cai, her kind response resonated with sincerity;\nTossing rice to form cinnabar, she played in ceaseless transformation.\nPresiding over all immortals,\nEncompassing the myriad beings.\nRefining her body with nine harmonies,\nSurpassing merit with ten perfections.\n\n**Great Compassion, Great Vows, Great Sage, Great Mercy, Ma Gu’s True Serenity Penetrating Response Benevolent Blessed Wondrous Salvation Perfected Lady.**\n\n**Immortal Elder Hongya’s Invocation**\nOne *qi* divided into the true, the five phases nurturing his essence.\nIn high antiquity, he was the teacher of the Divine Farmer;\nReceiving from the Two Modes, the true mechanism of the Numinous Treasure.\nOften manifesting in the Jin and Tang dynasties,\nEver bestowing his radiance in past and present.\nRiding the snow spirit on Western Ridge,\nUttering long whistles in the Kaiyuan era.\nHis voice moved the imperial court,\nHis purity unmatched in the Dew Palace;\nHis dharma transmitted to feathered and coarse-clad,\nHis Dao’s splendor enduring like the sun’s brilliance.\nHis grace covered the realm,\nHis kindness universally bestowed.\n\n**Great Compassion, Great Vows, Great Filial Piety, Great Benevolence, Elder Hongya, Qingcheng’s Immortal Elder; Pure Illumination Scripture Master Responsive Transformation Perfected Lord.**\n\n**Five Patriarchs of Complete Perfection’s Invocation**\nThe Great Dao opened the beginning,\nMysterious Origin unfolded transformation.\nTeachings transmitted through past and present,\nRevealed as Eastern Florescence.\nReceiving the Han dynasty’s general,\nHe concealed himself on Zhongnan and attained immortality.\nHis transformations often transcended kalpas,\nHis manifestations ever present in the human world.\nAwakening Tang dynasty’s worthy,\nHe realized immortals’ secret formulas.\nFlying swords and selling medicine,\nHis warnings and transformations boundless.\nGolden Court’s prime minister’s lofty standard,\nBravely declining the seal of office.\nAscending in rosy clouds,\nUniting North and South as one lineage.\nHeaven again produced a hero among men,\nThe Dao universally pervading the four seas.\nUnfolding seven golden lotuses,\nDisseminating immortal lineages in the ten directions.\nThe principle of longevity prevails to this day,\nMysterious and wondrous, Heaven’s grace descends upon the land.\nVastly propagating the supreme Dao,\nUniversally delivering the foolish and deluded.\n\n**Complete Perfection’s Patriarch, Eastern Florescence Purple Palace Auxiliary Mystery Establishing Ultimate Great Dao Emperor Lord; Orthodox Yang’s Awakening Transmitting Dao Bestowing Ultimate Emperor Lord; Pure Yang’s Orthodox Practice Warning Transformation Blessed Aid Emperor Lord; Sea Toad’s Illumination Propagating Dao Pure Blessed Emperor Lord; Chongyang’s Complete Perfection Opening Transformation Auxiliary Ultimate Emperor Lord; Five Patriarchs’ Dao-Expounding Heavenly Worthy.**\n\n**Ancestral Perfected Lady’s Invocation**\nPrimordial Beginning transformed *qi*,\nPure Subtlety’s orthodox lineage.\nVast, great, lofty, and luminous,\nAwakening the heart and perfecting the Dao’s body;\nFirm, strong, pure, and unalloyed,\nHis nature born of the divine and numinous.\nAchieving thunder and lightning through non-action,\nEncompassing Heaven and Earth beyond form.",
      "overlap_context": "ission] from Eastern Florescence, later transmitting it in Western Shu. By imperial decree of Jade Capital and Golden Portal, he ascended to the ranks of the Supreme Ultimate’s immortals. With compassion, he rescued those sunk in suffering; with grace, he universally aided those in distress. The legacy of the Lord of Ge flourished, manifesting at Gou’lou; now, cinnabar remains, and Kuocang’s peaks are his to roam. At Luofu he tarried in carefree ease; on Yuxi he cultivated the golden scriptures.",
      "start_char": 3003,
      "end_char": 4263,
      "start_sentence": 200,
      "end_sentence": 272,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.95872950553894,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\赞颂类\\诸师真诰.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "上极无上，会四派之真源； 玄之又玄，参三乘之妙义。 阐扬大教，利济群生。 洞照宫中清微师祖、元上侍宸金阙昭凝妙道保仙通化一辉元君。 北七真诰 道先一气，世显七真，悟五行不到之言，得九转返还之诀。 甘泉润物，变朽回春。 金国仙姿，得四言而契道； 卫州变化，坐十载以成真。 壁间墨迹之非凡，雪竹月松之姿异。 二井有多生之记，一时着显化之功。 磻溪六年、龙门七载。 道功备，而名闻时主； 丹符锡，而掌握神仙。 石上谈玄，空中飞盖。 元主屡宣而问道，甘霖克日以济民。 蚤穷易道之言，晚造神仙之诀。 卦图斯演，至道大成，清静散人，探玄得道，蓬莱仙路，亿劫独持，慈悲济苦，全真祖师。 丹阳抱一无为普化真君、长真凝神玄静蕴德真君、长生辅化宗玄明德真君、长春全德神化明应主教真君、玉阳体玄广慈普度真君、太古广宁通玄妙极真君、清静渊贞玄虚顺化元君，七真演化天尊。 南五祖诰 明真证道，行化南天。",
      "translated_text": "Supreme beyond the utmost,\nConverging the true source of the four streams;\nMystery upon mystery,\nPenetrating the wondrous meaning of the three vehicles.\nExpounding the great teaching,\nBenefiting and delivering all beings.\nIlluminating the palace with radiant clarity,\n*Pure Subtlety’s* Founding Ancestral Master,\n*Primordial Supreme’s* Attendant of the Golden Portals,\n*Luminous Mystery Dao* Preserving Immortal,\n*Unified Transformation* Shining *One Radiance* Perfected Lady.\n\n**Northern Seven Perfected’s Invocation**\nThe Dao precedes the one *qi*,\nThe world manifests the Seven Perfected.\nAwakening to words beyond the five phases,\nAttaining the ninefold cyclical return’s secret.\nSweet springs moisten all things,\nTransforming decay and restoring spring.\nGolden Kingdom’s immortal visage,\nThrough fourfold words grasped the Dao;\nWeizhou’s transformations,\nSeated for a decade to perfect truth.\nWall’s ink traces—no common mark,\nSnowy bamboo and moonlit pine—unusual grace.\nTwo wells bear records of many lives,\nOne moment reveals manifest transformation’s merit.\nSix years at Pan Brook,\nSeven years at Dragon Gate.\nDaoist merit complete, name reached the temporal lord;\nElixir talismans bestowed, wielding divine immortals’ power.\nDiscoursing on the mysterious upon stone,\nFlying canopy in empty space.\nThe Yuan ruler repeatedly summoned to inquire the Dao,\nTimely sweet rains relieved the people.\nEarly mastering the *Book of Changes’* words,\nLate achieving immortals’ secrets.\nHexagrams and charts thus unfolded,\nThe great Dao perfected.\n*Pure Serenity’s* Unattached One,\nExploring the mysterious, attaining the Dao,\nPenglai’s immortal path,\nAlone upheld through kalpas unnumbered,\nCompassionately relieving suffering,\n*Complete Perfection’s* Founding Ancestral Master.\n*Unwavering Unity’s* All-Transforming *Universal Transformation* Perfected Lord,\n*Eternal Truth’s* Spirit-Concentrating *Mysterious Serenity* Accumulating *Virtue* Perfected Lord,\n*Eternal Life’s* Assisting-Transforming *Lineage-Mystery* Illuminating *Virtue* Perfected Lord,\n*Eternal Spring’s* *Complete Virtue* Spirit-Transforming *Luminous Response* *Teaching-Master* Perfected Lord,\n*Jade Yang’s* *Embodied Mystery* *Vast Compassion* *Universal Deliverance* Perfected Lord,\n*Grand Antiquity’s* *Vast Tranquility* *Penetrating Mystery* *Wondrous Ultimate* Perfected Lord,\n*Serene Depth’s* *Profound Chastity* *Mysterious Emptiness* *Compliant Transformation* Perfected Lady,\nSeven Perfected’s Transformative Heavenly Worthies.\n\n**Southern Five Ancestors’ Invocation**\nIlluminating truth, verifying the Dao,\nPracticing transformation in the southern heavens.",
      "overlap_context": "omplete Perfection Opening Transformation Auxiliary Ultimate Emperor Lord; Five Patriarchs’ Dao-Expounding Heavenly Worthy.**\n\n**Ancestral Perfected Lady’s Invocation**\nPrimordial Beginning transformed *qi*,\nPure Subtlety’s orthodox lineage.\nVast, great, lofty, and luminous,\nAwakening the heart and perfecting the Dao’s body;\nFirm, strong, pure, and unalloyed,\nHis nature born of the divine and numinous.\nAchieving thunder and lightning through non-action,\nEncompassing Heaven and Earth beyond form.",
      "start_char": 4263,
      "end_char": 4643,
      "start_sentence": 273,
      "end_sentence": 293,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.088024854660034,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\赞颂类\\诸师真诰.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "九皇降迹於天台，一脉浚通於刘祖。 采琼花之仙异，着悟真之丹书。 道付杏林，不日还元之篇集； 法通鸡足，于焉丹髓之书成。 真人挺出惠州，性地悟超神俊，刀圭入口，神化无边。 施雷雨於掌中，苏民生於世外。 德彰南海，获琼玉之英标； 道徧遐荒，饫法言之灵妙。 龙虎浮罗之迹，武夷玉隆之区。 过化多方，真文备着，为神仙之首冠，集前代之范模。 誓愿弘深，慈悲仁圣祖师。 悟真紫阳真人、杏林翠玄真人、道光紫贤真人、泥丸翠虚真人、琼管紫清真人。 虚靖天师诰 白雪丹消，黄芽旧积。 文章星斗，老君授三五飞步之玄； 玉局箓符，汉祖传正一斩邪之旨。 于以登名於紫府，于以掌握於雷霆，伐疵疠於青城，灭妖氛於下界。 巍巍荡荡，妙妙玄玄，去太极，登紫微，聚三华，朝五炁。 随机格物，闲邪存神。 祖师三十代天师虚靖冲弘悟道真君，玄风演化天尊 侍宸诰 高上神霄，玉清雷府。 光分一炁，锺秀君峰； 道运五行，侍宸徽庙。 掌中雷雨，救旱消灾，指顾阴晴，安邦护国，功齐亿劫，教法祖师，德济群迷，众生慈父。 冲虚通妙灵慧真君。 雷真人诰 高上神霄府，玄都执法尊，演教大真人，玉帝侍御史，九天都纠察。 阐教慈父，济世真师，提点三界，统摄万灵，琼都上相，混元妙道普济真君、雷声演教天尊。 辛天君诰 高上碧霄上清华王，东极注生青华大帝，南昌火府通明猛吏阳晶炼度执法真人，分权定衡真王玄都玉府太极先天冲玄上吏，太乙木郎先天都元帅，九天考较使司元储福定命真君，铁笔注律大神光寂通天演法大元帅，掌风云雷雨、电霜雪雹、银牙耀目、提点三界，三十六天雷霆大都督青帝天君，元始一炁节制万灵太乙五雷判府天尊。 邓天君诰 高上神霄玉清真王，南极长生朱陵大帝，太阳九龙皇君，南昌上宫受炼真人，至真霹雳大仙，玄都九疑九夷蓬莱沧水使者，上清三境都元帅、九天采访使应元保运妙化真君，欻火律令大神、光妙横天演真大元帅、掌行风催雨诛邪破庙祛诸潭洞、总统三元八十一天雷霆都总管炎帝天君、元始祖劫一炁分真太一雷声普化天尊。 张天君诰 高上神霄玉清真王，南极保生洞阴大帝，旸谷神君清都律令蓬莱都水使九天采察大元帅，统摄三十三天雷霆都总管，掌雷云电雨部，玉府持奏御魔天君，校籍三界洞渊真宰，诛灭五逆赏善罚恶使者，飞捷报应真君，元始一炁宰御万灵太乙五雷广应天尊。 赵元帅诰 灵通丕演，圣德昭彰，凝形於大梵之初，显化乎无穷之世，持鞭提索，驭虎降魔，飞行三界鬼神惊，呼吸一声天地振。 威光景朗，无愿而弗从； 玄鉴灵明，有求而皆应。 救生灵疾苦，保家国安宁，赞扬道法以无穷，亶镇玄风於永劫，大悲大愿、大圣大慈、扶天广圣如意冲和大神君。 诸师真语竟",
      "translated_text": "Nine Sovereigns descended their traces upon Tiantai,\nA single lineage dredged through to Ancestor Liu.\nGathering the numinous jade-flower’s transcendence,\nComposing the *Awakening to Reality*’s cinnabar scriptures.\nThe Dao entrusted to Apricot Grove,\nSoon compiling the *Returning to the Origin*’s chapters;\nThe Dharma flowing to Cock’s Foot Mountain,\nTherein completing the *Cinnabar Marrow*’s canon.\nThe Perfected One emerged in Huizhou,\nHis nature’s ground awakening to surpassing spirit-brilliance.\nUpon ingesting the elixir-spoon’s measure, his divine transformations knew no bounds.\nManifesting thunder-rain in his palm,\nReviving the people’s lives beyond the world’s edge.\nHis virtue shone across the Southern Sea,\nAttaining the jade-essence’s noble standard;\nHis Dao pervaded distant wilds,\nSatiated with the Dharma’s wondrous subtleties.\nDragon-Tiger’s floating gauze traces,\nWuyi’s Jade Prosperity precincts—\nPassing through transformations in many realms,\nTrue writs fully revealed,\nCrowned as the foremost of immortals,\nGathering the paradigms of former ages.\nVows profound and vast,\nCompassionate, benevolent, and sagely Ancestral Master:\n*Awakening to Reality*’s Purple Yang Perfected One,\nApricot Grove’s Emerald Mystery Perfected One,\nDao-Light’s Purple Worth Perfected One,\nMud-Pill’s Emerald Emptiness Perfected One,\nJade Tube’s Purple Clarity Perfected One.\n\n**Invocation of the Vacuous Tranquility Celestial Master**\nWhite snow’s cinnabar dissolves,\nYellow sprouts’ old accumulations.\nLiterary brilliance like stars,\nThe Old Lord transmitted the *Three-Five Flying Steps*’ mystery;\nJade Bureau’s talismanic registers,\nThe Han Ancestor passed down the *Orthodox Unity*’s demon-slaying decree.\nThereby inscribing names in the Purple Palace,\nThereby wielding authority over thunder,\nEradicating pestilence in Qingcheng,\nAnnihilating demonic vapors in the lower realms.\nMajestic and boundless,\nSubtle and wondrously profound—\nDeparting the Great Ultimate,\nAscending the Purple Tenuity,\nAssembling the Three Flowers,\nFacing the Five Qi.\nAdapting to circumstances to rectify things,\nLeisurely expelling evil and preserving spirit.\nAncestral Master, the Thirty-Third-Generation Celestial Master,\n*Vacuous Tranquility’s* *Vast Penetration* *Awakening to the Dao* Perfected Lord,\n*Mystic Wind’s* *Evolving Transformation* Heavenly Worthy.\n\n**Invocation of the Attendant of the Celestial Court**\nSupreme Divine Empyrean,\nJade Clarity’s Thunder Bureau.\nLight divided from the Primordial Qi,\nConcentrated in the Jun Peak’s refinement;\nDao moving through the Five Phases,\nAttending the august ancestral temple.\nThunder-rain in his grasp,\nSaving from drought and dispelling calamities,\nDirecting yin and yang with a glance,\nPacifying the state and protecting the nation—\nMerits equaling eons,\nTeaching’s ancestral master,\nVirtue aiding the deluded,\nFather of compassion to all beings:\n*Vacuous Penetration’s* *Mystic Wonder* *Spirit-Wisdom* Perfected Lord.\n\n**Invocation of the Thunder Perfected One**\nSupreme Divine Empyrean’s Bureau,\nMystic Capital’s Law-Enforcing Venerable,\nDharma-Evolving Great Perfected One,\nJade Emperor’s Attendant Censor,\nNine Heavens’ Chief Inspector.\nDharma-expounding compassionate father,\nWorld-saving true master,\nOverseeing the Three Realms,\nGoverning the myriad spirits,\nJade Capital’s chief minister,\n*Primal Chaos’* *Wondrous Dao* *Universal Salvation* Perfected Lord,\n*Thunder’s Voice* *Dharma-Evolving* Heavenly Worthy.\n\n**Invocation of the Xin Heavenly Lord**\nSupreme Azure Empyrean’s Upper Clarity Radiant King,\nEastern Ultimate’s Life-Infusing Azure Florescence Great Emperor,\nNanchang’s Fire Bureau’s Illuminating Fierce Officer,\nYang Essence’s Refining and Liberating Law-Enforcing Perfected One,\nDividing authority and fixing the balance,\nTrue King of the Mystic Capital’s Jade Bureau’s *Great Ultimate* *Primordial* *Vacuous Mystery* *Upper Officer*,\n*Grand Monad’s* Wooden Youth,\n*Primordial* Marshal of the *All-Uniting* Host,\nNine Heavens’ Examiner and Comparator,\nOffice of the *Primordial* Treasurer of Fortune and Fate-Determining Perfected Lord,\nIron Brush’s Law-Recording Great Spirit,\n*Light’s* *Quiescence* *Heaven-Penetrating* *Dharma-Evolving* Great Marshal,\nGoverning wind, clouds, thunder, rain,\nLightning, frost, snow, hail,\nSilver fangs gleaming, eyes flashing,\nOverseeing the Three Realms,\nThirty-Six Heavens’ Thunder’s Great Commander-in-Chief,\nAzure Emperor Heavenly Lord,\n*Primordial Beginning’s* *One Qi* *Commanding* *Myriad Spirits* *Grand Monad’s* *Five Thunders* *Judgment Bureau* Heavenly Worthy.\n\n**Invocation of the Deng Heavenly Lord**\nSupreme Divine Empyrean’s Jade Clarity True King,\nSouthern Culmen’s Longevity Vermilion Mound Great Emperor,\nGrand Yang’s Nine Dragons August Lord,\nNanchang’s Upper Palace’s Refining-Receiving Perfected One,\nUtmost True Thunderclap Great Immortal,\nMystic Capital’s Nine Doubts’ Nine Yi’s Penglai’s Cangshui’s Messenger,\nUpper Clarity’s Three Realms’ Marshal,\nNine Heavens’ Investigating Commissioner,\n*Response and Transformation* *Wondrous Transformation* Perfected Lord,\n*Sudden Fire’s* *Law-Command* Great Spirit,\n*Light’s* *Wondrous* *Heaven-Spanning* *Dharma-Evolving* Great Marshal,\nGoverning wind’s dispatch and rain’s hastening,\nSlaying demons and destroying shrines,\nExpelling all from pools and caverns,\nCommanding the Three Origins’ Eighty-One Days’ Thunder’s Generalissimo,\nFlame Emperor Heavenly Lord,\n*Primordial Beginning’s* *Kalpa’s* *One Qi* *Dividing* *True* *Grand Monad’s* *Thunder’s Voice* *Universal Transformation* Heavenly Worthy.\n\n**Invocation of the Zhang Heavenly Lord**\nSupreme Divine Empyrean’s Jade Clarity True King,\nSouthern Culmen’s Life-Protecting Grotto-Yin Great Emperor,\nBright Valley’s Divine Lord,\nQing Capital’s Law-Command,\nPenglai’s Water Bureau’s Messenger,\nNine Heavens’ Investigating Commissioner,\nGreat Marshal of the Thirty-Three Heavens’ Thunder’s Generalissimo,\nGoverning the thunder-clouds and lightning-rain departments,\nJade Bureau’s Memorial-Submitting Demon-Quelling Heavenly Lord,\nThree Realms’ and Grotto-Abyss’ True Arbiter,\nSlaying the Five Treacheries’ and Rewarding Goodness’ and Punishing Evil’s Messenger,\n*Flying Swiftly* *Response-Manifesting* Perfected Lord,\n*Primordial Beginning’s* *One Qi* *Governing* *Myriad Spirits* *Grand Monad’s* *Five Thunders* *Vast Response* Heavenly Worthy.\n\n**Invocation of Marshal Zhao**\nSpirit-communication grandly evolving,\nSacred virtue luminously manifest—\nCongealing form at the Great Brahmā’s inception,\nRevealing transformations in the boundless world.\nWielding whip and lasso,\nDriving tigers and subduing demons,\nSoaring through the Three Realms—ghosts and spirits tremble;\nA single breath—heaven and earth quake.\nMajestic radiance resplendent,\nNone disobey his unspoken will;\nMystic mirror’s spirit-brilliance,\nAll who seek find response.\nRescuing living beings from suffering,\nPreserving households and nations in peace,\nExtolling the Dao’s Dharma without end,\nEternally upholding the mystic wind—\nGreat compassion, great vows,\nGreat sage, great mercy,\nHeaven-Assisting Vast Saint,\n*As-You-Will* *Harmonious* *Primordial* *Spirit* Great Divine Lord.\n\nThe Perfected Lords’ true words conclude.",
      "overlap_context": "ng-Master* Perfected Lord,\n*Jade Yang’s* *Embodied Mystery* *Vast Compassion* *Universal Deliverance* Perfected Lord,\n*Grand Antiquity’s* *Vast Tranquility* *Penetrating Mystery* *Wondrous Ultimate* Perfected Lord,\n*Serene Depth’s* *Profound Chastity* *Mysterious Emptiness* *Compliant Transformation* Perfected Lady,\nSeven Perfected’s Transformative Heavenly Worthies.\n\n**Southern Five Ancestors’ Invocation**\nIlluminating truth, verifying the Dao,\nPracticing transformation in the southern heavens.",
      "start_char": 4643,
      "end_char": 5726,
      "start_sentence": 294,
      "end_sentence": 334,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.72817420959473,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\赞颂类\\诸师真诰.txt",
        "category": "赞颂类"
      }
    }
  ]
}