{
  "source_id": "赣州圣济庙灵迹碑",
  "source_file": "chunked_daozang\\赣州圣济庙灵迹碑.json",
  "total_chunks": 3,
  "total_original_chars": 2228,
  "total_translated_chars": 12889,
  "total_translation_time": 69.88852572441101,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\赣州圣济庙灵迹碑.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**Stele of the Divine Miracles of Shengji Temple in Ganzhou #1**\n\nShengji Temple first arose in Ganzhou and gradually spread throughout the realm, with many prefectures and counties establishing their own. The deity, surnamed Shi and named Gu, was a native of Ganzhou. Born during the Qin dynasty, after his passing, he manifested his numinous power. In the sixth year of Emperor Gaozu of Han, the esteemed Marquis Guan Ying was dispatched to pacify the Jiangnan region and arrived in Ganzhou. At the time, Ganzhou belonged to Yuzhang Commandery, bordering Nanyue. When Zhao Tuo’s forces invaded the frontier, Guan Ying led troops to repel them. The deity descended upon the summit of Jueding Peak, revealing the date of victory. After the triumph, a temple was erected in Chongfu to honor him, and the locals called it the Temple of King Shi Gu.\n\nIn the first year of the Dazhong era of the Tang, a villager named Wen Liang, intoxicated, was bewitched by a demon and fell from a cliff. Fu Shuang, a merchant traveling to Changting, nearly capsized his boat. After praying to the deity, Wen Liang returned home, and Fu Shuang saw the god come to his aid. Thereupon, they divined a site at Leigang east of the Gong River and collectively built a new temple, carving a stone statue to enshrine him. Legend holds that when the temple was first constructed, heaven and earth darkened.\n\nLu Shi Wu Jun and Si Hu Xiao Jun, along with officials Kang and Huang, were sent to inspect it. All stood transfixed, and the two officials soon perished thereafter. To this day, they are venerated as attendant deities. From that time onward, the deity frequently displayed auspicious responses.\n\nTo the northeast of the prefecture lay two islets, Lantian and Qiandu. Every long summer, the waters would recede, exposing them like hills, blocking boats and oars. In the eighth year of the Jiayou era of the Song, Zhao Pu returned from his governance and dredged the channels. He urgently reported the deity’s efficacy at the temple, whereupon the waters rose eight *chi* in clarity—a phenomenon called \"clear rising,\" where water swells without rain.\n\nIn the first year of the Yuanyou era, the fifth month of summer, no rain fell, and prayers at Bianrong Mountain went unanswered. Prefect Kong Pingzhong welcomed the deity to Yugu Terrace. Before the candles could be lit, a sweet rain poured down. In the fourth year, a fire broke out in the eastern city, fanned by fierce winds, threatening the granaries. Yan Zhengpei, wearing the prefectural seal, urgently invoked the deity: *\"Have mercy on my suffering people!\"* Suddenly, the wind reversed, extinguishing the flames.\n\nIn the sixth year, another fire erupted. The elderly and young gazed toward Leigang and bowed. Though the moon shone as bright as day, dark clouds swiftly gathered, and a torrential rain quenched the raging blaze. In the third year of the Jianyan era, Empress Dowager Meng of Longyou sojourned in Ganzhou. Jin scouts advanced to Zaoshui, but upon seeing the deity leading a vast host of spectral soldiers, they retreated.\n\nIn the nineteenth year of the Shaoxing era, Xu Zhong, the prefect of Poyang, wished to renovate the deity’s shrine. He summoned twenty prominent families and addressed them in the courtyard. The assembly recommended Zhang Rui and Guo Wenzhen, whose minds were sharp and resourceful, to oversee the project. The two declined, claiming incompetence. Xu then divided a sheet of paper into twenty slips, matching the number of men, and wrote \"chief\" and \"deputy\" on two of them. After sealing them randomly, he had each draw one. When opened, the two who had drawn the marked slips were Zhang and Guo. The people marveled at the deity’s communion with their hearts, and the shrine was completed in no time.\n\nIn the twenty-seventh year, rebel bandits and forbidden troops seized the city, extorting women, gold, and silk, driving away nearly all the carts. Emperor Gaozong ordered Commander-in-Chief Li Geng to annihilate them. A dark mist shrouded Nitao, hindering the soldiers’ advance. Li Geng secretly prayed, and at dawn, the wind turned favorable, the sky cleared, and the city fell in a single assault. Thereafter, whenever the imperial army campaigned in the south, none failed to offer sacrifices and beseech the deity’s spectral troops for aid.\n\nIn the sixteenth year of the Chunxi era, during the triennial imperial examination, a local scholar named Liu Wenchai sought the deity’s sign in a dream. He dreamed of thirty men standing with tall bamboo poles, so he changed his name to Quan and was selected for the provincial examination. In the summer of the tenth year of the Jiading era, heavy rains caused the river to surge violently, leaving only three *ban* of the city walls above water. The people, fearing they would become fish, wept and prayed piteously. Soon after, the waters receded, sparing them from harm.\n\nIn the third year of the Shaoding era, the rebel soldier Zhu Xian led his followers Chen Da, Zhou Jin, and Cai Fa in revolt. An imperial edict promoted Chen Kai, then serving as military supervisor of Qixi and Xiang, to the position of judicial commissioner of Jiangxi, with authority to oversee the generals in their punitive campaign. One night, while encamped in Luling, Chen Kai dreamed that the deity told him: \"The rebel leader will flee to Panyu—you must act swiftly.\" Kai secretly ordered Hu Yan and Li Qiang to hasten to Ganzhou, where they joined forces with the troops of three strongholds and executed the rebels.\n\nIn the seventh year of the Chunyou era, the Yao and Liao tribes of Hunan, led by Zeng Zhi, rose in rebellion, their clamor shaking the lands south of the Yangtze. The regional commissioner Zheng Fengchen dispatched Wang Shunjin to attack them. As if aided by a divine presence, the rebels were struck with terror and swiftly annihilated.\n\nIn the ninth year, Cui Wenguang of Anyuan staged an uprising, taking refuge in stone caves. Yao Xide of Tongchuan arrived to enforce the law, stationing troops to besiege the rebels. After a prolonged stalemate, the bandits saw what appeared to be banners fluttering in the clouds, and their courage failed. Their ringleader was soon captured.\n\nIn the third year of the Jingding era, a case involving the Li family of the prefecture was mishandled by clerks who accepted bribes, torturing innocent people into confessing. The left minister Wu Ge suspected foul play, and the deity revealed the truth through an omen, ultimately exonerating the accused.\n\nIn the seventeenth year of the Zhiyuan era of the Yuan dynasty, a soldier named Zhang Yanzhen entered the temple, his tongue lolling several inches from his mouth and his feet suspended in midair. He confessed his hidden sins in great detail, as if interrogated by an unseen inquisitor.\n\nThe deity’s manifestations of divine power number in the hundreds, with particularly numerous instances of answered prayers for rain, sunshine, and relief from epidemics. I have recorded only the most notable cases here; those omitted may be inferred by example.\n\nDuring the Baoqing era of the Song dynasty, Fu Can of Putian served as the eastern magistrate of Gan County. Enamored of the deity’s efficacy, he composed a hundred *xianci* poems for the county. These verses, used by the people for divination, proved uncannily accurate, as if the deity spoke directly to them—another facet of its subtle influence on governance and moral order.\n\nDuring the reign of Wu Yangpu, the deity’s ability to repel the Miao tribes and defend against calamities earned it a place in the official sacrificial canon. It was enfeoffed as **Zhaoling Wang** (Illustrious Numinous King). Under the Song, it received five successive titles, culminating in **Chonghui Xianqing Zhaolie Zhongyou Wang** (August, Benevolent, Manifest, Illustrious, Loyal, and Protective King), and its temple was granted the name **Jiaji** (Auspicious Aid). Under the Yuan, its titles were thrice revised, finally settling on **Huguo Puren Chonghui Lingying Shenglie Zhongyou Wang** (Nation-Protecting, Universally Benevolent, August, Numinous, Sagely, Illustrious, Loyal, and Protective King), which remains its designation to this day. The honors bestowed upon it are truly exhaustive.\n\nAmong the relics still preserved in the temple are the vermilion-yellow robe bestowed by Emperor Gaozong, a silk-wrapped agate belt, and the Five-Dragon Inkstone presented by Li Yu of the Southern Tang.\n\nI have consulted the classics, which state that in times of famine or disaster, the state seeks the aid of spirits through sacrifice, while scholars afflicted by illness pray to the Five Domestic Deities. The former kings regarded the spirits as dependable, hence the establishment of these rituals of worship.\n\nYet many who style themselves Confucians dismiss the realm of spirits as obscure and inscrutable. If one broaches the subject, they either dismiss it as deception or condemn it as superstition—are they not, then, defying the classics?\n\nConsider this deity: its merits have served the state, its virtue has benefited the people. From the Han dynasty to the present, who has not relied upon it? Even renowned officials of recent times—Liu Anshi, the Su brothers, Hong Mai, Xin Qiji, and Wen Tianxiang—all revered it diligently and without neglect. Are these gentlemen not Confucians? How do they differ so from the skeptics of today?\n\nWhen I was first summoned to court, the deity foretold an auspicious omen of literary eminence, and I later entered the Hanlin Academy as a scholar. I privately marveled at this. Now, the temple’s invocators, Wei Zhong and his brother Zhi Qin, have presented me with accounts of the deity’s miracles from Tang and Song records, urging my nephew Fa Kai to request that I compile a comprehensive account. I could not refuse, and so I have composed this text for inscription.\n\nSome claim that Emperor Gao never campaigned in Yue, merely sending Lu Jia to present the imperial seal and appoint Zhao Tuo as King of Southern Yue. However, I have examined the historical records: Ying’s pacification of Yuzhang occurred in the sixth year (gengzi), while Tuo’s submission took place in the eleventh year (yisi). Before his submission, how can we be certain he did not invade the border, only to be repelled by Ying? Perhaps historians, deeming the event minor, omitted it. How dare I leave it unmentioned?\n\nI conclude with a poem:\n\nAmidst the emerald peaks where sacred thunder rolls,\nFive-glazed eaves soar, embracing subtle mysteries.\nThe clustered shrine, with fourfold eaves, stands lone in flight,\nIts image transformed, ochre-hued, with fivefold hues applied.\n\nCool yin pervades, stirring memories of ancient gales,\nAuspicious omens trace back to the fiery Liu’s dawn.\nWhen Yue’s miasma pierced through, heralding victory’s hour,\nCould it be a fallen star’s essence that took form?\n\nDescending in spirit to aid the workings of transformation,\nTaking stone as surname—such principle is fitting.\nIn *Da Zhong*, the tortoise-shell divined a move,\nResounding murmurs spread to the four directions.\n\nWind and thunder’s commands seem governed by unseen hands,\nRice ripples in abundance, the year knows no hunger.\nThe people, bellies full, revel in joy,\nYet the *Jian Yan* fire virtue met its mid-decline.\n\nThe imperial carriage halted in Gan’s marshes,\nAs Wanyan’s troops advanced in great strides.\nDivine soldiers unfurled banners in the clouds,\nArmor rolled up, they fled swift as startled raccoons.\n\nThe Mo Yao tribes howled, drawing near the encircling Yi,\nImperial troops cast down their loads to seize the city.\nFrom the sturdiest warriors down to infants, all were slaughtered—\nThe deity’s awe-inspiring might aided the royal forces.\n\nNot a single fiend remained, utterly annihilated,\nAs the Gan River’s waters receded, isles rose like shoals.\nMighty vessels stuck fast, immovable,\nBowing deeply, they knelt to touch the sacred threshold.\n\nEven as flames blazed and clouds lacked raiment,\nVast waves surged, submerging rocky isles.\nThe hidden workings of the kingly Dao—who could doubt its merit?\nFrom heaven descended a phoenix-sealed decree inscribed in purple mud.\n\nEnnobled as a true king, jade tablet in hand,\nHe rides the wind’s steeds and cloud-borne chariots, coming and going.\nCrimson robes bestow rare favor, sashes entwined with silk,\nFive-dragon treasures gleam with horns and manes wondrous.\n\nConcealed within, they radiate light in midnight’s heart,\nYin and yang revolve without trace or end.\nThe cries of ospreys and mallows chill the air, as if seen,\nFortune and misfortune bear signs—held in the deity’s grasp.\n\nEntrusted to the vague and distant, beyond mortal ken,\nWhy not seek the stele standing in the temple courtyard?\nIn the *xin hai* year of *Hongwu*, first month of spring,\nComposed by Song Lian of Jinhua, Supervisor of the Directorate of Education.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "赣州圣济庙灵迹碑#1 圣济庙者，初兴於赣，渐流布於四方，所在郡县多有之。 神盖姓石氏，名固，赣人也。 生于秦代，既殁，能发祥焉。 汉高帝六年，遣懿侯灌婴略定江南，至赣。 赣时属豫章郡，与南粤接壤。 尉陀寇边，婴将兵击之，神绛于绝顶峰，告以克捷之期。 已而有功，馆神於崇福，里人称为石固王庙。 唐大中元年，里民问谅，被酒为魅所惑，坠于崖下。 符爽，行贾长汀，舟几覆，成有所祷，谅即返其庐，爽见神来护之。 於是卜贡江东之雷冈，相率造新庙石为像奉焉。 相传庙初建时，天地为之晦冥。 录事昊君暨司户萧君，令康、黄二衙官，先后往视，皆立化，二君亦继亡，逮今祀为配神一云：自时厥后，神屡显嘉应。 州之东北，有二洲，曰蓝淀，曰乾渡，每当长夏，水易涸隐，起若冈阜，舟楫不通。 宋嘉佑八年，赵扑报政而归，通沟焉。 亟缴灵于庙，水清涨者八尺，清涨俗谓无雨，而水自盈也。 元佑元年夏五月，不雨，褊荣山川弗应，郡守孔平仲迎神至郁孤台，烛未见跋，甘霖如泻。 四年，东城灾，风烈火炽，将延於库。 庾林颜正佩郡章，急呼神曰：盍悯我需民。 俄，反风灭火。 六年，复灾，耄倪遥望雷冈而拜，月明如昼，忽阴云四合，大雨骤至虐焰顿熄。 建炎三年，隆佑太后孟氏驻跸于赣，金人探入至造水，髻霏观神拥阴兵甚众，乃旋。 绍兴十九年，鄱肠许中为郡，欲新神之祠，召大姓二十人立庭下谕之。 众推张锐、郭文振，心计开敏，宜为纠率。 二人谢木能。 许乃分一番纸，如其人之数，书二为正副字，杂封之，令自得墨者职如书。 各取其一开之，则得书者二人也。 众以神与心通，不日而祠成。 二十七年，禁兵合山寇据城，逆命子女金帛，驱辇殆尽。 高宗命都统制李耕歼之，阴霪逆台为患，士卒弗能前。 耕私祈焉，项之，风顺天朗，一鼓而城平。 自是王师南征，无不祀以牲牢，乞阴兵为助者。 淳熙十六年，岁当大比，州人士刘文柴以梦征于神，梦三十人执高竹而立，因更名荃，遂入乡选。 嘉定十年夏，大霖雨，江水暴溢，城不浸者三版。 民惧为鱼，泣祷甚哀，水寻退，亡害。",
      "translated_text": "**Stele of the Divine Miracles of Shengji Temple in Ganzhou #1**\n\nShengji Temple first arose in Ganzhou and gradually spread throughout the realm, with many prefectures and counties establishing their own. The deity, surnamed Shi and named Gu, was a native of Ganzhou. Born during the Qin dynasty, after his passing, he manifested his numinous power. In the sixth year of Emperor Gaozu of Han, the esteemed Marquis Guan Ying was dispatched to pacify the Jiangnan region and arrived in Ganzhou. At the time, Ganzhou belonged to Yuzhang Commandery, bordering Nanyue. When Zhao Tuo’s forces invaded the frontier, Guan Ying led troops to repel them. The deity descended upon the summit of Jueding Peak, revealing the date of victory. After the triumph, a temple was erected in Chongfu to honor him, and the locals called it the Temple of King Shi Gu.\n\nIn the first year of the Dazhong era of the Tang, a villager named Wen Liang, intoxicated, was bewitched by a demon and fell from a cliff. Fu Shuang, a merchant traveling to Changting, nearly capsized his boat. After praying to the deity, Wen Liang returned home, and Fu Shuang saw the god come to his aid. Thereupon, they divined a site at Leigang east of the Gong River and collectively built a new temple, carving a stone statue to enshrine him. Legend holds that when the temple was first constructed, heaven and earth darkened.\n\nLu Shi Wu Jun and Si Hu Xiao Jun, along with officials Kang and Huang, were sent to inspect it. All stood transfixed, and the two officials soon perished thereafter. To this day, they are venerated as attendant deities. From that time onward, the deity frequently displayed auspicious responses.\n\nTo the northeast of the prefecture lay two islets, Lantian and Qiandu. Every long summer, the waters would recede, exposing them like hills, blocking boats and oars. In the eighth year of the Jiayou era of the Song, Zhao Pu returned from his governance and dredged the channels. He urgently reported the deity’s efficacy at the temple, whereupon the waters rose eight *chi* in clarity—a phenomenon called \"clear rising,\" where water swells without rain.\n\nIn the first year of the Yuanyou era, the fifth month of summer, no rain fell, and prayers at Bianrong Mountain went unanswered. Prefect Kong Pingzhong welcomed the deity to Yugu Terrace. Before the candles could be lit, a sweet rain poured down. In the fourth year, a fire broke out in the eastern city, fanned by fierce winds, threatening the granaries. Yan Zhengpei, wearing the prefectural seal, urgently invoked the deity: *\"Have mercy on my suffering people!\"* Suddenly, the wind reversed, extinguishing the flames.\n\nIn the sixth year, another fire erupted. The elderly and young gazed toward Leigang and bowed. Though the moon shone as bright as day, dark clouds swiftly gathered, and a torrential rain quenched the raging blaze. In the third year of the Jianyan era, Empress Dowager Meng of Longyou sojourned in Ganzhou. Jin scouts advanced to Zaoshui, but upon seeing the deity leading a vast host of spectral soldiers, they retreated.\n\nIn the nineteenth year of the Shaoxing era, Xu Zhong, the prefect of Poyang, wished to renovate the deity’s shrine. He summoned twenty prominent families and addressed them in the courtyard. The assembly recommended Zhang Rui and Guo Wenzhen, whose minds were sharp and resourceful, to oversee the project. The two declined, claiming incompetence. Xu then divided a sheet of paper into twenty slips, matching the number of men, and wrote \"chief\" and \"deputy\" on two of them. After sealing them randomly, he had each draw one. When opened, the two who had drawn the marked slips were Zhang and Guo. The people marveled at the deity’s communion with their hearts, and the shrine was completed in no time.\n\nIn the twenty-seventh year, rebel bandits and forbidden troops seized the city, extorting women, gold, and silk, driving away nearly all the carts. Emperor Gaozong ordered Commander-in-Chief Li Geng to annihilate them. A dark mist shrouded Nitao, hindering the soldiers’ advance. Li Geng secretly prayed, and at dawn, the wind turned favorable, the sky cleared, and the city fell in a single assault. Thereafter, whenever the imperial army campaigned in the south, none failed to offer sacrifices and beseech the deity’s spectral troops for aid.\n\nIn the sixteenth year of the Chunxi era, during the triennial imperial examination, a local scholar named Liu Wenchai sought the deity’s sign in a dream. He dreamed of thirty men standing with tall bamboo poles, so he changed his name to Quan and was selected for the provincial examination. In the summer of the tenth year of the Jiading era, heavy rains caused the river to surge violently, leaving only three *ban* of the city walls above water. The people, fearing they would become fish, wept and prayed piteously. Soon after, the waters receded, sparing them from harm.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 806,
      "start_sentence": 0,
      "end_sentence": 34,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.008368253707886,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\赣州圣济庙灵迹碑.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "绍定三年，鲸卒朱先帅其徒陈达、周进、蔡发以叛，有旨#2擢刻襄监军陈恺，提刑江西，仍护诸将致讨。 夜驻庐陵，梦神告曰：先将窜番禺，尔宜速图。 恺密命胡岩起李强疾趋至赣，合三寨兵戮之，淳佑七年，湖南夷撩曾旨，肃聚倡乱，声提江右。 部使者郑逢辰檄王舜进攻，如有神立青霄，凶徒沮骇，卒就珍灭。 九年，安远崔文广为变，倚石壁作窟穴。 潼川姚希得来持宪节，驻兵守之，久且弗拔，寇见云中若旗帜飞翻，其胆遂落，渠魁乃擒。 景定三年，郡有黎氏狱，胥吏受球，拷掠良民使之承。 左司昊革疑焉，神告以先兆，卒白其冤。 元至元十七年，闽卒张彦真入庙，吐舌数寸，足悬半空，自述其阴私颇悉，类有人鞠识之。 盖神之显灵，共事不翅数百，而於雨旸疫疠之祷验者尤伙。 濂唯各举其着书之，所不书者，可以例见也。 宋宝庆问，莆田傅灿为赣县东尉，艳神之为，撰为县辞百章。 俾人占之，其响苔吉凶，往往如神面语之者，此亦阴栩治化之一端也。 昊杨溥时以神能御苗捍患，有合祭法，署为昭灵王，宋五封至崇惠显庆昭烈忠佑王，赐庙额日嘉济。 元三易封为护国普仁崇惠灵应圣烈忠佑王，复更之以今镇。 其褒扬光着，可谓备矣。 至若高宗所锡赭黄袍，缠丝码脑带，及南唐李煜五龙砚，至今犹藏庙中云。 濂稽诸经，国有凶荒，则索鬼神而祭之。 士有疾病，则行祷於五祀。 先王必以神为可依，故建是祠祝之制也。 世之号为儒者，多指鬼神於茫昧，稍与语及之，弗以为诬，则斥以为惑，不几於悖经矣乎。 有若神者，功在国家，德被生民，自汉及今，孰不知依之。 虽近代名臣，若刘安世，若苏轼兄弟，若洪迈，若辛弃疾，若文天祥，亦勤勤致敬而弗之怠。 是数君子者，将非儒也邪？ 何其与世人异也。 濂初被召而起，神示以文物之祥，后果入翰林为学士，心窃奇之。 今祝史韦中，及弟志勤以灵迹款见唐宋之文，使从子法凯，请濂通述之，因不欲辞，造文俾刻焉。 或谓高帝未尝伐粤，第遣陆贾责玺绶，立佗为南粤王。 濂按传记。 婴之略定豫章，在六年庚子，佗之称臣，在十一年乙巳。 其未臣之前，恶知不来侵境而婴击退之邪？ 恐史家以其事微，故略之。 尔敢并及之，系之以诗曰：",
      "translated_text": "In the third year of the Shaoding era, the rebel soldier Zhu Xian led his followers Chen Da, Zhou Jin, and Cai Fa in revolt. An imperial edict promoted Chen Kai, then serving as military supervisor of Qixi and Xiang, to the position of judicial commissioner of Jiangxi, with authority to oversee the generals in their punitive campaign. One night, while encamped in Luling, Chen Kai dreamed that the deity told him: \"The rebel leader will flee to Panyu—you must act swiftly.\" Kai secretly ordered Hu Yan and Li Qiang to hasten to Ganzhou, where they joined forces with the troops of three strongholds and executed the rebels.\n\nIn the seventh year of the Chunyou era, the Yao and Liao tribes of Hunan, led by Zeng Zhi, rose in rebellion, their clamor shaking the lands south of the Yangtze. The regional commissioner Zheng Fengchen dispatched Wang Shunjin to attack them. As if aided by a divine presence, the rebels were struck with terror and swiftly annihilated.\n\nIn the ninth year, Cui Wenguang of Anyuan staged an uprising, taking refuge in stone caves. Yao Xide of Tongchuan arrived to enforce the law, stationing troops to besiege the rebels. After a prolonged stalemate, the bandits saw what appeared to be banners fluttering in the clouds, and their courage failed. Their ringleader was soon captured.\n\nIn the third year of the Jingding era, a case involving the Li family of the prefecture was mishandled by clerks who accepted bribes, torturing innocent people into confessing. The left minister Wu Ge suspected foul play, and the deity revealed the truth through an omen, ultimately exonerating the accused.\n\nIn the seventeenth year of the Zhiyuan era of the Yuan dynasty, a soldier named Zhang Yanzhen entered the temple, his tongue lolling several inches from his mouth and his feet suspended in midair. He confessed his hidden sins in great detail, as if interrogated by an unseen inquisitor.\n\nThe deity’s manifestations of divine power number in the hundreds, with particularly numerous instances of answered prayers for rain, sunshine, and relief from epidemics. I have recorded only the most notable cases here; those omitted may be inferred by example.\n\nDuring the Baoqing era of the Song dynasty, Fu Can of Putian served as the eastern magistrate of Gan County. Enamored of the deity’s efficacy, he composed a hundred *xianci* poems for the county. These verses, used by the people for divination, proved uncannily accurate, as if the deity spoke directly to them—another facet of its subtle influence on governance and moral order.\n\nDuring the reign of Wu Yangpu, the deity’s ability to repel the Miao tribes and defend against calamities earned it a place in the official sacrificial canon. It was enfeoffed as **Zhaoling Wang** (Illustrious Numinous King). Under the Song, it received five successive titles, culminating in **Chonghui Xianqing Zhaolie Zhongyou Wang** (August, Benevolent, Manifest, Illustrious, Loyal, and Protective King), and its temple was granted the name **Jiaji** (Auspicious Aid). Under the Yuan, its titles were thrice revised, finally settling on **Huguo Puren Chonghui Lingying Shenglie Zhongyou Wang** (Nation-Protecting, Universally Benevolent, August, Numinous, Sagely, Illustrious, Loyal, and Protective King), which remains its designation to this day. The honors bestowed upon it are truly exhaustive.\n\nAmong the relics still preserved in the temple are the vermilion-yellow robe bestowed by Emperor Gaozong, a silk-wrapped agate belt, and the Five-Dragon Inkstone presented by Li Yu of the Southern Tang.\n\nI have consulted the classics, which state that in times of famine or disaster, the state seeks the aid of spirits through sacrifice, while scholars afflicted by illness pray to the Five Domestic Deities. The former kings regarded the spirits as dependable, hence the establishment of these rituals of worship.\n\nYet many who style themselves Confucians dismiss the realm of spirits as obscure and inscrutable. If one broaches the subject, they either dismiss it as deception or condemn it as superstition—are they not, then, defying the classics?\n\nConsider this deity: its merits have served the state, its virtue has benefited the people. From the Han dynasty to the present, who has not relied upon it? Even renowned officials of recent times—Liu Anshi, the Su brothers, Hong Mai, Xin Qiji, and Wen Tianxiang—all revered it diligently and without neglect. Are these gentlemen not Confucians? How do they differ so from the skeptics of today?\n\nWhen I was first summoned to court, the deity foretold an auspicious omen of literary eminence, and I later entered the Hanlin Academy as a scholar. I privately marveled at this. Now, the temple’s invocators, Wei Zhong and his brother Zhi Qin, have presented me with accounts of the deity’s miracles from Tang and Song records, urging my nephew Fa Kai to request that I compile a comprehensive account. I could not refuse, and so I have composed this text for inscription.\n\nSome claim that Emperor Gao never campaigned in Yue, merely sending Lu Jia to present the imperial seal and appoint Zhao Tuo as King of Southern Yue. However, I have examined the historical records: Ying’s pacification of Yuzhang occurred in the sixth year (gengzi), while Tuo’s submission took place in the eleventh year (yisi). Before his submission, how can we be certain he did not invade the border, only to be repelled by Ying? Perhaps historians, deeming the event minor, omitted it. How dare I leave it unmentioned?\n\nI conclude with a poem:",
      "overlap_context": "ination, a local scholar named Liu Wenchai sought the deity’s sign in a dream. He dreamed of thirty men standing with tall bamboo poles, so he changed his name to Quan and was selected for the provincial examination. In the summer of the tenth year of the Jiading era, heavy rains caused the river to surge violently, leaving only three *ban* of the city walls above water. The people, fearing they would become fish, wept and prayed piteously. Soon after, the waters receded, sparing them from harm.",
      "start_char": 806,
      "end_char": 1648,
      "start_sentence": 35,
      "end_sentence": 67,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.121097564697266,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\赣州圣济庙灵迹碑.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "神雷之冈翠参差，五璃天娇含精微。 丛祠四阿俨单飞，像变翕赭五采施。 阴爽袭人动曾飓，发祥传自炎刘初。 粤氛侵彻告捷期，岂或天星陨魄为。 降灵于人赞化机，以石为氏理则宜。 大中卜迁墨食龟，有声讽讽达四垂。 风霆号令疑所司#3，禾□获获岁不饥。 民氓鼓腹酣以嬉，建炎火德值中衰。 宫车驻跸赣之麋，完颜点卒大步追。 神兵暗树云中旗，卷甲疾走如窜狸。 莫榣啸呼引缭夷，禁军荷投据城池。 屠刘壮健到婴儿，威神有赫助王师。 一歼凶坚无孑遗，贡江水落洲如坻。 巨舟皆胶牢弗移，鞠躬再拜叩灵墀。 亦日火烈云不衣，鸿涛清涨没石矶。 阴栩王度功何疑，紫泥鸾诰自天题。 爵为真王手秉珪，风马云舆时往来。 赭袍宠异带缠丝，五龙宝研角鬣奇。 袭藏出中夜吐辉，阳阴斡运无端倪。 鸯蒿凄怆如见之，休咎有征神所持。 委以惚怳邈难知，奚不来索庭中碑。 洪武辛亥春正月，国子司业金华宋濂撰。 #1原『碑』字误为『理』字，据金华丛书本宋濂《宋学士全集·补遗》卷四《赣州圣济庙灵迹碑》改。 #2原『旨』字误为『音』字，据《宋学士全集·补遗》卷四《赣州圣济庙灵迹碑》改。 #3『风霆号令疑所司』，据《宋学士全集·补遗》卷四《赣州圣济庙灵迹碑》，此句后尚有『斥逐厉鬼旸雨时』一句。",
      "translated_text": "Amidst the emerald peaks where sacred thunder rolls,\nFive-glazed eaves soar, embracing subtle mysteries.\nThe clustered shrine, with fourfold eaves, stands lone in flight,\nIts image transformed, ochre-hued, with fivefold hues applied.\n\nCool yin pervades, stirring memories of ancient gales,\nAuspicious omens trace back to the fiery Liu’s dawn.\nWhen Yue’s miasma pierced through, heralding victory’s hour,\nCould it be a fallen star’s essence that took form?\n\nDescending in spirit to aid the workings of transformation,\nTaking stone as surname—such principle is fitting.\nIn *Da Zhong*, the tortoise-shell divined a move,\nResounding murmurs spread to the four directions.\n\nWind and thunder’s commands seem governed by unseen hands,\nRice ripples in abundance, the year knows no hunger.\nThe people, bellies full, revel in joy,\nYet the *Jian Yan* fire virtue met its mid-decline.\n\nThe imperial carriage halted in Gan’s marshes,\nAs Wanyan’s troops advanced in great strides.\nDivine soldiers unfurled banners in the clouds,\nArmor rolled up, they fled swift as startled raccoons.\n\nThe Mo Yao tribes howled, drawing near the encircling Yi,\nImperial troops cast down their loads to seize the city.\nFrom the sturdiest warriors down to infants, all were slaughtered—\nThe deity’s awe-inspiring might aided the royal forces.\n\nNot a single fiend remained, utterly annihilated,\nAs the Gan River’s waters receded, isles rose like shoals.\nMighty vessels stuck fast, immovable,\nBowing deeply, they knelt to touch the sacred threshold.\n\nEven as flames blazed and clouds lacked raiment,\nVast waves surged, submerging rocky isles.\nThe hidden workings of the kingly Dao—who could doubt its merit?\nFrom heaven descended a phoenix-sealed decree inscribed in purple mud.\n\nEnnobled as a true king, jade tablet in hand,\nHe rides the wind’s steeds and cloud-borne chariots, coming and going.\nCrimson robes bestow rare favor, sashes entwined with silk,\nFive-dragon treasures gleam with horns and manes wondrous.\n\nConcealed within, they radiate light in midnight’s heart,\nYin and yang revolve without trace or end.\nThe cries of ospreys and mallows chill the air, as if seen,\nFortune and misfortune bear signs—held in the deity’s grasp.\n\nEntrusted to the vague and distant, beyond mortal ken,\nWhy not seek the stele standing in the temple courtyard?\nIn the *xin hai* year of *Hongwu*, first month of spring,\nComposed by Song Lian of Jinhua, Supervisor of the Directorate of Education.",
      "overlap_context": "Yue, merely sending Lu Jia to present the imperial seal and appoint Zhao Tuo as King of Southern Yue. However, I have examined the historical records: Ying’s pacification of Yuzhang occurred in the sixth year (gengzi), while Tuo’s submission took place in the eleventh year (yisi). Before his submission, how can we be certain he did not invade the border, only to be repelled by Ying? Perhaps historians, deeming the event minor, omitted it. How dare I leave it unmentioned?\n\nI conclude with a poem:",
      "start_char": 1648,
      "end_char": 2217,
      "start_sentence": 68,
      "end_sentence": 92,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.75905990600586,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\赣州圣济庙灵迹碑.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}