{
  "source_id": "赤松子中诫经",
  "source_file": "chunked_daozang\\赤松子中诫经.json",
  "total_chunks": 5,
  "total_original_chars": 5420,
  "total_translated_chars": 32295,
  "total_translation_time": 149.26334357261658,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\戒律类\\赤松子中诫经.txt",
    "category": "戒律类"
  },
  "full_translation": "**The Red Pine Master’s Central Admonitions Sutra**\n\n**Title:** *The Red Pine Master’s Central Admonitions Sutra*. One scroll. Source text: *Zhengtong Daoist Canon*, *Dongzhen* Section, Precepts and Disciplines Category.\n\n**Preface to The Red Pine Master’s Central Admonitions Sutra**\n\nLong ago, Master Gongming Zigao passed through Song and saw Minister Xue Ai, who had ten sons—six afflicted with lameness, missing limbs, madness, or idiocy; one who died in prison; and three blind, deaf, or stricken with sores and ulcers. Zigao then asked: \"Minister, what deeds have you committed to bring such misfortune upon yourself?\"\n\nXue Ai replied: \"Now that you, Master, have deigned to inquire, I shall speak from the depths of my heart. As the kingdom’s chief minister, I have never recommended a single worthy person nor befriended a single scholar. I regarded the virtuous as enemies, blocking their advancement. When others suffered losses, I rejoiced as if I had gained; when others prospered, I grieved as if I had lost. I resented only that I could not do the same.\"\n\nZigao said: \"With such conduct, Minister, your entire household is doomed to destruction. A thousand calamities and ten thousand illnesses will befall your descendants, who will suffer every kind of retribution. How could it be otherwise?\"\n\nHearing the Master’s words, Xue Ai grew pale with dread, his spirit adrift. He bowed in remorse and vowed to reform. Zigao then said: \"Though Heaven is high, it observes all below. Those who do evil will surely meet with misfortune; those who do good will surely receive blessings. Correct past wrongs and cultivate future virtue—turn failure into success. It is never too late.\"\n\n\"Years ago, I received from you, Master, a scroll of *The Red Pine Master’s Admonitions*. If one follows its teachings, it can cure the myriad illnesses of the body and deliver one’s descendants from present suffering. Now that I understand the intentions behind your actions, I see they have all been misguided. I shall now bestow this admonition upon you. Follow it faithfully, and you will witness Heaven’s verification.\"\n\nThereupon, he opened his case, took out the sutra, and presented it to Xue Ai. Ai bowed, received it reverently, and Zigao took his leave. Several years later, Zigao returned and saw that the minister’s sons had all recovered from their ailments. Observing their restored health, he asked: \"Since we last parted, what skilled physician or wondrous art has cured your sons’ afflictions?\"\n\nAi replied: \"My sons did not encounter any great physician, nor did we employ any special methods. Some years ago, I received *The Central Admonitions Sutra* from you, Master. I reformed my ways and opened my heart. When I saw others suffer loss, I grieved for them; when I saw others prosper, I rejoiced inwardly. I recommended the worthy and deferred to the capable, relinquishing my salary and rank. I distributed the gold, silk, money, and grain I had hoarded to orphans and the poor, aiding the destitute. I eased my heart, lent generously, and competed with none. I purified myself, offered sacrifices to my sovereign and father, refrained from extravagant adornments and rich flavors, revered Heaven and Earth, believed in spirits, practiced contentment and frugality—and my sons each recovered on their own.\"\n\nZigao said: \"How swift! How swift is Heaven’s reward for goodness—faster than an echo answering a sound, a shadow following a form! Now that you, Minister, have wholeheartedly embraced virtue, your sons’ hundred ailments have all been cured. How much more so if you perform a thousand good deeds?\"\n\nXue Ai then offered a thousand gold pieces to Zigao in gratitude for the sutra, begging him to accept. Zigao replied: \"I have no use for your gold. Keep it to bestow as hidden charity upon others. The greatest repayment would be to copy this sutra and transmit it to those who have yet to awaken.\" Thereupon, the Master took his leave of the minister.\n\n**The Red Pine Master’s Central Admonitions Sutra**\n\nThe Yellow Emperor bowed deeply and asked the Red Pine Master: \"I observe that the lives of the people are not uniform—some are wealthy and noble, others poor and lowly; some live long, others die young; some suffer unjust imprisonment, others are plagued by chronic illness; some die suddenly without sickness, others enjoy long life and prosperity. Why are they so unequal? I beg you, Master, to explain this.\"\n\nThe Red Pine Master replied: \"The people are born solitary, each bearing a star. Some stars are large, others small, each governing the form of its host—determining longevity or brevity, prosperity or decline, poverty or wealth, life or death. Those who do good are enveloped in virtuous *qi*, with fortune and power following them. All evil departs, spirits protect them, and people respect them, distancing them from misfortune. Those who do evil are enveloped in malevolent *qi*, with disasters and calamities trailing them. Auspiciousness shuns them, evil stars shine upon them, and people despise them. All manner of suffering and decline converge upon their bodies.\n\nFrom morning to night, people’s thoughts and actions—whether good or evil—often unknowingly violate Heaven and Earth’s prohibitions, incurring punishments and accumulating sins, which are not limited to one kind. Day and night, those who do evil offend the gods and spirits. The Controller of Destiny reports their deeds, and the stars deduct from their allotted lifespan. Heaven’s *qi* abandons them, and Earth’s *qi* clings to them—hence, they decline.\"\n\nThe Yellow Emperor further asked: \"How long is a person’s natural lifespan?\"\n\nThe Red Pine Master replied: \"When a person is born, Heaven grants them a lifespan of forty-three thousand eight hundred days—amounting to one hundred and twenty years. Each year governs one year of life. Thus, all people are meant to live one hundred and twenty years, but by violating Heaven and Earth’s prohibitions, their lifespan is shortened, and their lives end prematurely.\"\n\nThe Emperor asked again: \"Some die in the womb, others perish in infancy. They have not yet acted—what prohibitions have they violated?\"\n\nThe Red Pine Master replied: \"These are the sins of their ancestors, whose misfortunes extend to their descendants. Since ancient times, the wise and virtuous have established teachings, leaving behind immortal sutras, all exhorting people to do good and recognize the myriad evils. Only then can their names be passed down through the ages, and their descendants enjoy blessings.\n\nPeople live between Heaven and Earth, endowed with the *qi* of *yin* and *yang*. Though the August Heaven is high, its response is below; though the Earth is lowly, its response is above. Heaven does not speak, yet the four seasons proceed; Earth does not speak, yet the myriad things are born. People dwell between them, indulging their desires. Every movement and breath of an ordinary person is known to Heaven and Earth. Thus, it is said that Heaven possesses four kinds of knowledge.\"\n\nPeople do not speak of repaying the grace of Heaven and Earth, yet their words brim with resentment toward them. Heaven gives birth to the people, with the *qian* and *kun* trigrams as father and mother, the sun and moon as eyes, the stars as the nine orifices, and the movement of wind and the warmth of fire as vital *qi*. When the span of life ends, all return to the earth. In the heavens, the Three Northern Asterisms—the North Star, the Controller of Fate, and the Recorder of Deeds—dispatch the Grand Rectitude Talisman, which constantly hovers above a person’s head, observing their transgressions and stripping away their allotted years. If one year is taken, the star above their head dims, and their life becomes fraught with misfortune. If ten years are taken, the star gradually fractures, and they suffer calamity, decline, and illness. If twenty years are taken, the star’s light extinguishes, and they fall into dire straits or face imprisonment. If thirty years are taken, the star scatters, and they die. When their allotted years are exhausted before their time, misfortune extends to their descendants. If the descendants’ suffering is not exhausted, it may even lead to the annihilation of the family line. Yet people, unaware of their own transgressions, merely lament their short lives.\n\nThus, Heaven does not deceive all things, manifesting its truth through shadows: the alternation of day and night, the interplay of *yin* and *yang*, thunder, lightning, rain, snow, rainbows, halos, solar and lunar eclipses, comets, and meteors. Earth does not deceive all things, manifesting its truth through resonance: the birth of the myriad things, the flow of rivers, their drying and flooding, landslides, earthquakes, fierce winds that shake trees, flying sand and rolling stones, floods, locusts, famines, droughts, miasmas, plagues, and epidemics. Ghosts and spirits do not deceive all things, manifesting their truth through fortune and misfortune: omens, anomalies, disasters, and blessings. The ruler of the state does not deceive all things, manifesting his truth through Heaven and Earth, harmonizing the stars, responding to calamities, pacifying the four directions, uniting the people, and securing the peace of the sovereign.\n\nPeople’s conduct, words, and intentions—let none say that Heaven and Earth act thus. Therefore, the sage has said: \"August Heaven shows no partiality; it aids only those who possess virtue. Revere the Mandate of Heaven, revere the great, and revere the words of the sages.\" Every day, as people secretly commit good or evil deeds, Heaven and Earth know their true nature. When they secretly take lives, the spirits see their forms; when they speak or think, the ghosts hear their voices. When they violate a hundred prohibitions, ghosts seize their essence; when they violate a thousand, Earth records their forms. With each evil deed, shackles form in an instant—this is the retribution of *yin* and *yang*. August Heaven issues warnings, and those who defy them incur the wrath of ghosts, spirits, Heaven, and Earth.\n\nThe Yellow Emperor further asked about the signs of good and evil among immortals and whether one who receives blessings could have these matters examined and explained. Red Pine replied: The methods of cultivating the self, controlling fate, and governing one’s nature involve conducting oneself with auspicious *qi* each morning, focusing the mind on virtuous thoughts, words, deeds, and gazes. If within a single day the three karmas do not arise, then within three years, Heaven will send down a fortune star, and all shall be blessings in return. If, however, one consistently utters evil words, commits evil deeds, and casts evil glances each morning, teaching others to do evil daily, then within three years, calamity will befall them, leading to the loss of wealth and life. Earth will infuse them with malevolent *qi*, and they will surely decline.\n\nThe Nine Shameful Stars of Heaven correspond to the Nine Violent Deaths of the human realm. Good is the tally of evil; evil is the proof of good. It is also said: The good are the teachers of the wicked; the wicked are the resources of the good. Fortune is the evidence of misfortune; misfortune is the remnant of fortune. When good people frequently encounter disasters and manifold misfortunes, it is the lingering calamity of their ancestors. Thus, those who cultivate goodness throughout their lives need not select auspicious times or days; whenever they act, they naturally find fortune within misfortune, with a hundred spirits secretly protecting them and malevolent forces avoiding them. Conversely, those who do evil throughout their lives, even if they carefully choose auspicious days and times, will, when the moment arrives, encounter misfortune within fortune, with evil spirits harming them and benevolent spirits shunning them.\n\nYet if people consistently cultivate good conduct each day, Heaven will naturally increase their fortune and longevity, and harmonious *qi* and rosy light will surround them—this is the Way of form and shadow. To remain unwaning and unexhausted, preserving harmony with Heaven, one must understand the gains and losses of Heaven and Earth’s prohibitions and the Dao of cultivating the self and controlling fate. Now, let these be set forth in detail:\n\nWhen a person performs one good deed, the spirits’ minds are at peace. When they perform ten good deeds, their *qi* and strength flourish. When they perform twenty, their body knows no harm. When they perform thirty, their wishes are fulfilled. When they perform forty, they enjoy wealth and joy. When they perform fifty, their descendants prosper. When they perform sixty, they avoid false accusations and the entanglements of wicked people. When they perform seventy, their learning brings them honor. When they perform eighty, they gain the benefits of the land. When they perform ninety, the heavenly spirits protect them. When they perform a hundred, Heaven bestows upon them emolument, and they encounter sages. When they perform two hundred, their names are celebrated in later generations, and their descendants receive emolument. When they perform three hundred, three generations of descendants enjoy wealth, honor, and happiness. When they perform four hundred, four generations of descendants enjoy wealth, honor, and promotion. When they perform five hundred, five generations of descendants receive enfeoffment and elevated ranks. When they perform six hundred, generation after generation of descendants serve loyally and enjoy wealth and honor. When they perform seven hundred, generation after generation produces wise and sagacious people. When they perform eight hundred, they produce people of virtue and power. When they perform nine hundred, they produce sages. When they perform a thousand, they produce a host of immortals.\n\nAncient virtuous deeds and policies are recorded by the Dao of Heaven. Those who embody them have their allotted years extended, ascend in rank, and attain immortality, their blessings extending to their descendants, who give birth to the worthy and produce sages.\n\nIf a person commits one evil deed, their mind is unsettled. If they commit ten, their *qi* and strength wane. If they commit twenty, their body suffers many illnesses. If they commit thirty, their wishes go unfulfilled. If they commit forty, they face hardship, decline, and loss, with all affairs going awry. If they commit fifty, they will never find a match. If they commit sixty, their descendants will dwindle and perish.\n\nIf a person commits seventy evil deeds, malevolent spirits plot their harm. If they commit eighty, they suffer disasters of water and fire, drowning or burning in untimely calamities. If they commit ninety, they fall into poverty, weakness, sores, scabies, and madness. If they commit a hundred, Heaven’s *qi* harms them, entangling them in misfortune, leading to execution and violent death. If they commit two hundred, Earth’s *qi* harms them, bringing ruin through bandits and thieves. If they commit three hundred, their descendants will be born lowly and base. If they commit four hundred, their descendants will live in destitution, reduced to begging. If they commit five hundred, their lineage will be cut off. If they commit six hundred, their descendants will be born blind, deaf, mute, or afflicted with idiocy and madness. If they commit seven hundred, their descendants will commit the five inversions, violate the law, and be unfilial. If they commit eight hundred, they will produce traitorous ministers and rebellious sons, leading to the extermination of their kin. If they commit nine hundred, they will produce monstrous offspring, bringing annihilation to their clan. If they commit a thousand, their descendants will be deformed, their bodies altered into the shapes of beasts, incomplete in form. When the accumulation of evil reaches its full measure, the calamity extends for generations.\n\nThis is the Controller of Fate seizing their allotted years, their stars falling as their body perishes, their soul tormented in Fengdu, their misfortune flowing to posterity.\n\nThe Yellow Emperor further asked: \"When the Controller of Fate seizes a person’s allotted lifespan, what sins have they committed to invite this?\"\n\nMaster Red Pine replied: \"I humbly observe that people in the world bring misfortune upon themselves, yet they complain that the Dao of Heaven is unjust, refusing to reflect on their own faults. They curse and rage at Heaven when imprisoned in shackles, when starving or impoverished, when stricken with illness, when afflicted by cold, heat, frost, or snow, when resenting the length of day or night. They commit evil deeds yet pray and curse Heaven, defy the four seasons, violate the five phases, expose themselves naked before the Three Luminaries, relieve themselves facing the stars, the altars, or the temples, witness the eclipses of the sun and moon without attempting to save them, indulge in self-gratification while disrespecting Heaven and Earth and the spirits, fail to honor their parents, revile wind and rain, destroy the teachings of the sages, demolish altars and temples, desecrate graves to steal the belongings of the dead, deceive the blind, deaf, or mute, steal gold and silk, pour filth into others’ homes, recklessly tear or discard clothing, use unclean vessels for food and drink, cast curses on the living, bury talismans in the earth, envy the worthy and resent the capable, cultivate venomous creatures, take lives without cause, leave anonymous slanderous letters, malign the innocent, expose others’ private affairs, block roads, fill in ditches and canals, steal others’ possessions, discard or misuse medicine, fell others’ trees, crops, flowers, fruits, or gardens, harm livestock, defile wells, springs, palaces, temples, or monasteries, sing and make merry while in mourning, set fires to mountains, ruin others’ livelihoods, drain ponds and marshes, hunt and capture aquatic creatures like soft-shelled turtles, alligators, turtles, and fish, break oaths in their dealings with others, show contempt for the divine, engage in deceit and false accusations, speak with a forked tongue, spread malicious gossip, stir up strife, teach others to file frivolous lawsuits, expose themselves naked before others, eat and drink with disheveled hair, harm the good and aid the wicked, enrich themselves at others’ expense, blindly follow corrupt masters, teach unlawful practices, attack and kill the innocent, twist justice to serve wrongdoing, rely on power and cunning, exaggerate minor offenses, engage in killing in spring, take lives in summer, fail to correct their faults in autumn, disturb the earth’s treasures in winter, separate others from their kin, delight in killing and despise life, value themselves and belittle others, bully orphans and widows, undermine others to advance themselves, endanger others for their own security, borrow without repayment, praise themselves while slandering others, ally with the wicked and chase power, flaunt others’ authority, feign kindness while harboring malice, grow angry at the sight of killing, refuse to correct their faults, ignore goodness, turn their backs on family to favor strangers, disdain the high and oppress the low, reject the teachings of parents and teachers, allow wives and concubines to sow discord, heed petty and base words, abandon their kin, regret acts of kindness, rejoice in others’ misfortune, spy on others’ secrets, seduce others’ wives and concubines, act without principle, steal others’ affections, claim others’ good deeds as their own, implicate the innocent in serious crimes as guarantors, show disrespect to superiors and inferiors, disregard rank, indulge in drunken violence, misuse objects, discard food and drink, treat clothing with contempt, seek what is not rightfully theirs, court danger and death, forget old friends for new ones, abandon roots for branches, fail to repay kindness, deceive and mock others.\n\nHerein are recorded over eight hundred transgressions, though they cannot all be listed in full. Yet when people commit any of these offenses, they violate the stars that govern their fate, and their deeds are reported to the Supreme Emperor, the Seven Stars, the Six Pitches, the Four Seasons, the Eight Winds, the Nine Palaces, and the Five Phases. The Controller of Fate is first commanded to seize their allotted years, shortening their lifespan, and bringing misfortune that extends to their descendants.\"\n\nEmperor Huang again asked: \"When people violate the prohibitions of Heaven and Earth, their allotted years are seized in measure—how grave are their offenses?\"\n\nMaster Red Pine replied: \"Humans are the root of Heaven and Earth; they ought to cultivate goodness and restrain their karma. Yet people present a gentle, harmonious appearance while harboring hidden malice. When they transgress prohibitions, their offenses accumulate without number, and the Controller of Fate records each one to be reported. Thus do people meet execution or perish on the battlefield: first, because they themselves have violated the Dao, and their past deeds become their adversaries; second, because the Five Phases intersect, and the Great Unity punishes them, their fate aligning with the shifting cycles of time, compelling them to suffer annihilation’s calamity.\"\n\nEmperor Huang again asked Master Red Pine: \"From what you have said, when people transgress, they lie uneasy upon their mats—can their offenses be absolved?\"\n\nHe replied: \"Some offenses may be absolved, others cannot. If people commit wrongs unintentionally and their hearts repent, absolution is possible. But if they hear the truth yet refuse to believe, recognize their faults yet refuse to change, persist in evil, and let their hearts grow cruel and fierce, absolution is impossible.\"\n\nMaster Red Pine said: \"When people follow the good Dao, Heaven and Earth, ghosts and spirits, bestow blessings and aid them, extending their years and longevity, sparing them from misfortune. Why, then, would one not walk the good Dao? People should revere Heaven and Earth and the Three Luminaries, avoid transgressing prohibitions, honor and love their parents, live in harmony with their siblings, pity the orphaned and solitary, rescue and assist the poor and sick, respect their teachers and elders, heed the teachings of ancient sages and village elders without defiance, and remain humble and reverent. Whenever they encounter wind and rain, cold and heat, malevolent stars, strange omens, eclipses of the sun and moon, or celestial obscurations, they should reflect on goodness, keep their distance from ghosts and spirits, and offer sacrifices to Heaven and Earth. Their merits will be recorded above, and their allotted years and blessings extended.\n\nWhen they see others doing evil, they should urge them to cultivate goodness. If they encounter good people, they should respect and follow them. When they witness danger or peril, they should rescue and protect with all their heart. When they themselves face hardship, they should ensure others remain secure. They should take on light burdens for themselves and heavy ones for others, dissuade people from engaging in lawsuits or quarrels, repair wells and irrigation channels, and mend roads.\n\nThey should not sacrifice the great for the small, nor abandon the small for the great. When they see others suffer loss, they should feel their pain deeply; when they see others gain, they should rejoice inwardly. They should support the weak and protect the infirm, bestow kindness and aid the orphaned and poor, remain reverent and humble, and yield their blessings to others. Their merits will be recorded in Heaven, and their longevity extended, bringing fortune to their descendants.\n\nIf one remains steadfast in faith, reveres the Dao and virtue, does not shirk danger, rescues those drowning in rivers and lakes, avoids illicit relations, does not encroach upon others’ homes or property, does not harm living beings without cause, cherishes life and abhors killing, upholds propriety without fail, studies the classics regularly, repays kindness without forgetting, bestows favors without regret, endures humiliation with forbearance, fulfills loyalty and filial piety, does not flaunt authority, does not squander wealth, does not covet fine clothing or lavish feasts, does not take lives unjustly, and sets an example for others to follow—then all will draw near to them. They should not consider themselves wise, virtuous, clever, wealthy, proud, domineering, boastful, self-important, self-exalting, arrogant, self-serving, or self-righteous. Their merits will be recorded below, and their allotted years extended. Those who receive even greater extensions are those who serve their lord with loyalty, their father with filial piety, remain free from arrogance, respect their teachers and elders, enlighten the young, honor their masters, cultivate humility, live in harmony with superiors and inferiors, treat all with fairness and kindness, refuse to listen to slander, act with sincerity, and ensure that women are filial and obedient to their parents-in-law, reverent toward their husbands, chaste and pure in conduct, patient and restrained in speech, diligent in morning and evening reflections, gentle and cheerful in demeanor, and selfless in their service. Such people will receive extended years, increased blessings, the dissipation of disasters, and wisdom for their sons and daughters.\n\nThose whose years are cut short and blessings diminished are ministers who murder their lords, children who murder their fathers, disciples who betray their teachers, those who forget their masters after achieving success, the rebellious and irreverent, those who fail to distinguish between kin and stranger, and those who indulge their desires and act with self-importance. Women who defy their parents, are unfilial to their parents-in-law, disdain their husbands, engage in slander and gossip, disrupt the harmony of their families, steal and act lazily, or harm their neighbors—all will have their blessings and years seized, suffer from grave illnesses, endure scorn in life, and fall into hell after death.\"\n\nEmperor Huang again asked: \"Is there yet a most wondrous Dao in the human realm that I may hear?\"\n\nMaster Red Pine replied: \"Whether people cultivate goodness or evil begins in the heart. The heart is the seed of the Five Thieves and the root of all evil. When the human heart intends to do good, though the good deed may not yet be done, the spirits of goodness already respond. When the heart conceives evil, though the evil may not yet have sprouted, the spirits of misfortune already know. Thus, a noble person may perform good deeds for a thousand days, yet their goodness may still be insufficient; but if they commit evil for even a moment, their evil will be more than enough.\n\nConsider those who usurp and seize by force—this too arises from the heart. Gain and loss alike are determined by the Dao of Heaven. Even if one harbors the intent to harm others, they may not succeed, for life and death, prosperity and decline, are governed by fate.\n\nThe classic states: 'Heaven has Five Thieves; those who perceive them prosper, those who lose them perish.' The teachings speak of Five Virtues: those who practice them prosper, those who abandon them perish. Practicing them means embodying warmth, kindness, reverence, frugality, and yielding, as well as benevolence, righteousness, propriety, wisdom, and trust. Abandoning them means embracing evil, rebellion, greed, envy, and killing, as well as cruelty, chaos, deceit, fraud, and flattery.\n\nPeople often practice the Five Abandonments, and their hearts are habitually moved by nine thoughts: when they see another’s family prosperous and noble, they speak of their past hardships and wish for their demotion; when they see another’s wealth and honor, they mock their former poverty and wish for their ruin; when they see another’s abundant wealth, they scheme to have it plundered...\"\n\nWhen they see another’s wives and concubines beautiful, they conceive lustful and illicit desires; when they see another’s house grand and imposing, they conceive the desire to burn it down; when they owe another a debt, they wish the creditor dead; when they cannot borrow another’s wealth, they grow resentful and harbor deep hatred; when they see another in peril, they speak of their past wrongs; even toward their own parents, they early wish them dead to seize their wealth and property.\n\nThese are the nine thoughts of foolish people. Thus, Heaven and Earth and the spirits abhor them, visiting them with calamity and misfortune, cutting short their allotted lifespan.\n\nThose who practice the Five Virtues constantly hold nine reflections: seeing another’s honor and nobility, they reflect on their own meager karmic conditions; seeing another’s granaries filled with grain, they reflect on their own lack of diligent cultivation; seeing another’s gold, jade, and wealth, they reflect that these are not their own possessions; seeing another’s beautiful wives and concubines, they reflect on their own spouse and refrain from wayward thoughts; seeing another’s grand and imposing house, they reflect on their own humble dwelling and find contentment; seeing another who once slighted them now entangled with officials, they conceive the thought to rescue and assist them; owing another a debt and unable to repay it at present, they constantly reflect with concern and strive to repay it earnestly; desiring to borrow another’s wealth, they reflect on their past lack of kindness or merit; seeing another serving their lord and parents, they constantly reflect on their own lack of diligent repayment to others in the world.\n\nThose who can practice these nine reflections throughout the day, abandoning the former nine thoughts, are people of supreme wisdom and luminous understanding. In this life, they obtain blessings and protection, their prosperity flowing to their descendants, and unforeseen calamities and misfortunes cannot reach them.\n\nThe Yellow Emperor further asked the Master: \"What ranks follow the wise?\"\n\nThe Master replied: \"There are three grades, all being people of benevolence.\n\nThe highest wisdom: they understand astronomy, discern geography, comprehend without learning, grasp without teaching, silently retain knowledge, distinguish tones and rhythms, discern the worthy and the foolish, their hearts filled with compassion, never belittling others, recognizing success and failure, knowing advance and retreat, distinguishing survival and demise. Such people, though poor, will ultimately prosper; though briefly lowly, will ultimately rise—these are people of the highest wisdom.\n\nThe middle wisdom: they are well-versed in the classics, constantly upholding ritual and reverence, seeing the worthy and aspiring to emulate them, aiding the imperiled and rescuing the weak, bestowing kindness without regret, maintaining loyalty and filial piety without fail, their words never harming others, humble, yielding, warm, and modest. These, though unlearned, ultimately awaken; though not yet prominent, ultimately achieve success—these are people of middle wisdom.\n\nThe lower wisdom: they are cultivators of goodness, reforming the past and cultivating the future, pursuing their work while aspiring to learn, firmly believing in matters of good and evil, never encroaching on others’ wealth, preserving life and cherishing their bodies, understanding the Dao/Way and recognizing laws and texts, naturally aiding the weak, naturally fearing calamity and decline. Such people, vigilant and without fault, do not encounter unforeseen misfortunes—these are people of lower wisdom.\"\n\nThe Yellow Emperor said: \"Excellent! Excellent! These words cannot be overstated in their merit and virtue. I shall carefully follow what has been said, record it, and show it to all people, making it a great bridge and beam.\"\n\nAll the assembled ministers bowed their heads and withdrew, adhering to the teachings and putting them into practice.\n\n*Red Pine’s Middle Admonitions* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "赤松子中诫经 经名：赤松子中诫经。 一卷。 底本出处：《正统道藏》洞真部戒律类。 赤松子中诫经序 昔公明子皋过宋，见大夫薛瑷有子一十人，六人楼跛臂颠痴，一子狱死，三子盲聋疮痘。 子皋遂问：大夫所行之行，如何而祸至此？ 薛瑷对曰：今蒙先生顾问，实以衷肠之事奉告先生。 予为国之宰相，未曾举一人，不曾接一士，见贤如雠，约截不令入。 见人遗失，予如有所得； 见人有得，予如有所失。 恨身不为之耳。 皋曰：大夫所行，如此之行，须至灭门矣。 千迍万病，殃及子孙，受诸恶报，何至如此乎？ 薛瑷闻先生所说，神色忧惧，心魂茫然，稽首知过，宁许改乎。 子皋语大夫曰：天虽高而察其下，行凶恶者必殃，行善事者必福，改往修来，转败为成，不患晚矣。 吾昔年曾於先生处，传得赤松子诫箴一轴，能依此行，治身万病，及拔见世子孙。 吾今知大夫所作用心，从来皆错，予将此诫箴，奉传与大夫，但依此而行之，必知天之验也。 於是开箧取经，授与薛瑷。 瑷拜而捧之，皋遂辞而去。 得后数年还来，到国见大夫诸子，所疾并皆差矣。 子皋见诸子疾愈，问大夫曰：予别后，得何良医妙术，郎君所损诸疾皆痊。 对曰：儿子亦不值良医，别无方术。 顷年於先生处，得《中诫经》，遂改过恢心，见人有所失，为之惨然，见人有所得，内有喜悦，举贤荐能，自退禄位，已前所贮金帛钱谷，散惠孤贫，救济穷困，宽心饶借，与物无竞，斋沐追荐君父，不淫服饰，不贪美味，敬天地，信鬼神，知足俭约，儿子各各自愈。 子皋语大夫曰：速哉，速哉，天之报善也，过於响应声、影应形。 今大夫一心行善，男女百病皆差，何况行一千余事乎。 薛缓乃将千金拜上子皋，以酬赐经之恩，乞先生见受。 子皋曰：予得大夫金亦无用处，可自留阴惠施人，唯抄此经，授与未悟之人，便是大夫报恩极也。 於是先生乃辞大夫而去。 赤松子中诚经 轩辕黄帝稽首，问赤松子曰：朕见万民受生，何不均匀，有富贵，有贫贱，有长命者，有短命者，或横罹枷禁，或久病缠身，或无病卒亡，或长寿有禄，如此不等，愿先生为朕辩之。 赤松子曰：生民焭焭，各载一星，有大有小，各主人形，延促衰盛，贫富死生。 为善者，善气覆之，福德随之，众邪去之，神灵卫之，人皆敬之，远其祸矣。 为恶之人，凶气覆之，灾祸随之，吉祥避之，恶星照之，人皆恶之，衰患之事，并集其身矣。 人之朝夕，行心用行，善恶所为，暗犯天地禁忌，谪谴罪累，事非一也。 人之朝夕，为恶人神，司命奏上，星辰夺其算寿，天气去之，地气着之，故曰衰也。 黄帝又问曰：人生寿命，合得几许。 对曰：人生堕地，天赐其寿四万三千八百日，都为一百二十岁，一年主一岁，故人受命，皆合一百二十岁，为犯天地禁忌，夺算命终。 又问：或有胎中便夭，或得数岁而亡，此既未有施为，犯何禁忌。 赤松子对曰：此乃祖宗之罪，遗殃及后。 自古英贤设教，留在仙经，皆劝人为善，知其诸恶，始乃万古传芳，子孙有福。 夫人生在天地之中，禀阴阳二气，皇天虽高，其应在下； 后土虽卑，其应在上。 天不言而四时行，地不言而万物生，人处其中，恣心情欲，凡人动息，天地皆知，故云天有四知也。",
      "translated_text": "**The Red Pine Master’s Central Admonitions Sutra**\n\n**Title:** *The Red Pine Master’s Central Admonitions Sutra*. One scroll. Source text: *Zhengtong Daoist Canon*, *Dongzhen* Section, Precepts and Disciplines Category.\n\n**Preface to The Red Pine Master’s Central Admonitions Sutra**\n\nLong ago, Master Gongming Zigao passed through Song and saw Minister Xue Ai, who had ten sons—six afflicted with lameness, missing limbs, madness, or idiocy; one who died in prison; and three blind, deaf, or stricken with sores and ulcers. Zigao then asked: \"Minister, what deeds have you committed to bring such misfortune upon yourself?\"\n\nXue Ai replied: \"Now that you, Master, have deigned to inquire, I shall speak from the depths of my heart. As the kingdom’s chief minister, I have never recommended a single worthy person nor befriended a single scholar. I regarded the virtuous as enemies, blocking their advancement. When others suffered losses, I rejoiced as if I had gained; when others prospered, I grieved as if I had lost. I resented only that I could not do the same.\"\n\nZigao said: \"With such conduct, Minister, your entire household is doomed to destruction. A thousand calamities and ten thousand illnesses will befall your descendants, who will suffer every kind of retribution. How could it be otherwise?\"\n\nHearing the Master’s words, Xue Ai grew pale with dread, his spirit adrift. He bowed in remorse and vowed to reform. Zigao then said: \"Though Heaven is high, it observes all below. Those who do evil will surely meet with misfortune; those who do good will surely receive blessings. Correct past wrongs and cultivate future virtue—turn failure into success. It is never too late.\"\n\n\"Years ago, I received from you, Master, a scroll of *The Red Pine Master’s Admonitions*. If one follows its teachings, it can cure the myriad illnesses of the body and deliver one’s descendants from present suffering. Now that I understand the intentions behind your actions, I see they have all been misguided. I shall now bestow this admonition upon you. Follow it faithfully, and you will witness Heaven’s verification.\"\n\nThereupon, he opened his case, took out the sutra, and presented it to Xue Ai. Ai bowed, received it reverently, and Zigao took his leave. Several years later, Zigao returned and saw that the minister’s sons had all recovered from their ailments. Observing their restored health, he asked: \"Since we last parted, what skilled physician or wondrous art has cured your sons’ afflictions?\"\n\nAi replied: \"My sons did not encounter any great physician, nor did we employ any special methods. Some years ago, I received *The Central Admonitions Sutra* from you, Master. I reformed my ways and opened my heart. When I saw others suffer loss, I grieved for them; when I saw others prosper, I rejoiced inwardly. I recommended the worthy and deferred to the capable, relinquishing my salary and rank. I distributed the gold, silk, money, and grain I had hoarded to orphans and the poor, aiding the destitute. I eased my heart, lent generously, and competed with none. I purified myself, offered sacrifices to my sovereign and father, refrained from extravagant adornments and rich flavors, revered Heaven and Earth, believed in spirits, practiced contentment and frugality—and my sons each recovered on their own.\"\n\nZigao said: \"How swift! How swift is Heaven’s reward for goodness—faster than an echo answering a sound, a shadow following a form! Now that you, Minister, have wholeheartedly embraced virtue, your sons’ hundred ailments have all been cured. How much more so if you perform a thousand good deeds?\"\n\nXue Ai then offered a thousand gold pieces to Zigao in gratitude for the sutra, begging him to accept. Zigao replied: \"I have no use for your gold. Keep it to bestow as hidden charity upon others. The greatest repayment would be to copy this sutra and transmit it to those who have yet to awaken.\" Thereupon, the Master took his leave of the minister.\n\n**The Red Pine Master’s Central Admonitions Sutra**\n\nThe Yellow Emperor bowed deeply and asked the Red Pine Master: \"I observe that the lives of the people are not uniform—some are wealthy and noble, others poor and lowly; some live long, others die young; some suffer unjust imprisonment, others are plagued by chronic illness; some die suddenly without sickness, others enjoy long life and prosperity. Why are they so unequal? I beg you, Master, to explain this.\"\n\nThe Red Pine Master replied: \"The people are born solitary, each bearing a star. Some stars are large, others small, each governing the form of its host—determining longevity or brevity, prosperity or decline, poverty or wealth, life or death. Those who do good are enveloped in virtuous *qi*, with fortune and power following them. All evil departs, spirits protect them, and people respect them, distancing them from misfortune. Those who do evil are enveloped in malevolent *qi*, with disasters and calamities trailing them. Auspiciousness shuns them, evil stars shine upon them, and people despise them. All manner of suffering and decline converge upon their bodies.\n\nFrom morning to night, people’s thoughts and actions—whether good or evil—often unknowingly violate Heaven and Earth’s prohibitions, incurring punishments and accumulating sins, which are not limited to one kind. Day and night, those who do evil offend the gods and spirits. The Controller of Destiny reports their deeds, and the stars deduct from their allotted lifespan. Heaven’s *qi* abandons them, and Earth’s *qi* clings to them—hence, they decline.\"\n\nThe Yellow Emperor further asked: \"How long is a person’s natural lifespan?\"\n\nThe Red Pine Master replied: \"When a person is born, Heaven grants them a lifespan of forty-three thousand eight hundred days—amounting to one hundred and twenty years. Each year governs one year of life. Thus, all people are meant to live one hundred and twenty years, but by violating Heaven and Earth’s prohibitions, their lifespan is shortened, and their lives end prematurely.\"\n\nThe Emperor asked again: \"Some die in the womb, others perish in infancy. They have not yet acted—what prohibitions have they violated?\"\n\nThe Red Pine Master replied: \"These are the sins of their ancestors, whose misfortunes extend to their descendants. Since ancient times, the wise and virtuous have established teachings, leaving behind immortal sutras, all exhorting people to do good and recognize the myriad evils. Only then can their names be passed down through the ages, and their descendants enjoy blessings.\n\nPeople live between Heaven and Earth, endowed with the *qi* of *yin* and *yang*. Though the August Heaven is high, its response is below; though the Earth is lowly, its response is above. Heaven does not speak, yet the four seasons proceed; Earth does not speak, yet the myriad things are born. People dwell between them, indulging their desires. Every movement and breath of an ordinary person is known to Heaven and Earth. Thus, it is said that Heaven possesses four kinds of knowledge.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1237,
      "start_sentence": 0,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.147082805633545,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\赤松子中诫经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "人不言报天地之恩，发言多怨天地。 天生需民，以乾坤表父母，日月表眼目，星辰表九窍，风动火力为暖气，寿命终时，总还归土。 天上三台北辰司命司录，差太一直符常在人头上，察其有罪，夺其算寿。 若夺一年，头上星无光，其人坎坷多事； 夺算十年，星渐破缺，其人灾衰疾病； 夺其算寿二十年，星光殒灭，其人困笃，或遭刑狱； 夺其算寿三十年，其星流散，其人则死。 时去算尽，不周天年，更殃后代子孙。 子孙流殃不尽，以至灭门。 人不自知过犯，只言短寿。 故天不欺物，示之以影，昼夜阴阳，雷电雨雪，虹霓交晕，日月薄蚀，彗孛飞流，天之信也； 地不欺物，示之以响应，及生万物，江河流注，乃至枯涸，山崩地动，恶风振木，飞沙走石，水捞虫蝗，饥荒天旱，瘴疠灾疫，地之信也； 鬼神不欺物，示之以祸福，怪异灾祥，是鬼神之信也； 国主不欺物，示之天地，和星辰，顺灾殃，灭四方，归万姓，安人君之信也。 人之所行，发言用意，莫言天地如此。 故圣人云：皇天无亲，惟德是辅，畏天命、畏大人、畏圣人之言。 凡人逐日私行善恶之事，天地皆知其情，暗杀物命，神见其形，心口意语，鬼闻人声，犯禁满百，鬼收其精，犯禁满千，地录人形，日行诸恶，枷锁立成，此阴阳之报也。 皇天以诫议，故作违犯，则鬼神天地祸之也。 黄帝又问神仙善恶之兆，见蒙福佑，更可为朕审而述之。 赤松子对曰：修身、制命、治性之法，清朝常行吉气，专心记念，善语、善行、善视。 一日之内，三业不生，三年之内，天降福星，皆为福报也； 如人清朝，常行恶语、恶行、恶视，教人为恶日造，三年之内，祸患及身，亡财灭口，地加妖气，人必衰矣。 天之九丑，是人间之九横。 夫善者，恶之符； 恶者，善之信也。 又云：善人者，恶人之师； 恶人者，善人之资。 吉者，凶之证； 凶者，吉之余也。 有善人常遇灾衰，多般祸患，先人之余殃也。 故一生修善之人，不必择良时吉日，凡用使之时，自然得凶中之吉，百灵潜护，神煞避矣； 一生为恶之人，纵拣得吉日良时，及至用日，却值吉中之凶，恶神害之，福神避矣。 但世人终日常修善行，自然天增福寿，和气霞光，此乃形影之道也。 欲得不衰不耗，与天相保，天地禁忌得失，修身制命之道，今具言之。 人为一善，神意安定； 为十善，气力强盛； 为二十善，身无患害； 为三十善，所求遂意； 为四十善，般富娱乐； 为五十善，子孙昌盛； 为六十善，不遭误犯、恶人牵累； 为七十善，所学显贵； 为八十善，获地之利； 为九十善，天神护之； 为一百善，天赐其禄，逢遇圣贤； 为二百善，扬名后世，子孙受禄； 为三百善，三世子孙，富贵利乐； 为四百善，四世子孙，富贵迁禄； 为五百善，五世子再受封超爵； 为六百善，世世子孙，忠奉富贵； 为七百善，世世出贤哲人，为八百善，出道德人； 为九百善，出圣人； 为一千善，出群仙。 古迹善政，天道所录，见身加算、进位登仙，楅及子孙，生贤出圣也。 若人为一恶，意不安定； 为十恶，气力虚羸； 为二十恶，身多疾病； 为三十恶，所求不遂； 为四十恶，坎坷衰耗，凡事乖张； 为五十恶，终无匹偶； 为六十恶，绝减子息；",
      "translated_text": "People do not speak of repaying the grace of Heaven and Earth, yet their words brim with resentment toward them. Heaven gives birth to the people, with the *qian* and *kun* trigrams as father and mother, the sun and moon as eyes, the stars as the nine orifices, and the movement of wind and the warmth of fire as vital *qi*. When the span of life ends, all return to the earth. In the heavens, the Three Northern Asterisms—the North Star, the Controller of Fate, and the Recorder of Deeds—dispatch the Grand Rectitude Talisman, which constantly hovers above a person’s head, observing their transgressions and stripping away their allotted years. If one year is taken, the star above their head dims, and their life becomes fraught with misfortune. If ten years are taken, the star gradually fractures, and they suffer calamity, decline, and illness. If twenty years are taken, the star’s light extinguishes, and they fall into dire straits or face imprisonment. If thirty years are taken, the star scatters, and they die. When their allotted years are exhausted before their time, misfortune extends to their descendants. If the descendants’ suffering is not exhausted, it may even lead to the annihilation of the family line. Yet people, unaware of their own transgressions, merely lament their short lives.\n\nThus, Heaven does not deceive all things, manifesting its truth through shadows: the alternation of day and night, the interplay of *yin* and *yang*, thunder, lightning, rain, snow, rainbows, halos, solar and lunar eclipses, comets, and meteors. Earth does not deceive all things, manifesting its truth through resonance: the birth of the myriad things, the flow of rivers, their drying and flooding, landslides, earthquakes, fierce winds that shake trees, flying sand and rolling stones, floods, locusts, famines, droughts, miasmas, plagues, and epidemics. Ghosts and spirits do not deceive all things, manifesting their truth through fortune and misfortune: omens, anomalies, disasters, and blessings. The ruler of the state does not deceive all things, manifesting his truth through Heaven and Earth, harmonizing the stars, responding to calamities, pacifying the four directions, uniting the people, and securing the peace of the sovereign.\n\nPeople’s conduct, words, and intentions—let none say that Heaven and Earth act thus. Therefore, the sage has said: \"August Heaven shows no partiality; it aids only those who possess virtue. Revere the Mandate of Heaven, revere the great, and revere the words of the sages.\" Every day, as people secretly commit good or evil deeds, Heaven and Earth know their true nature. When they secretly take lives, the spirits see their forms; when they speak or think, the ghosts hear their voices. When they violate a hundred prohibitions, ghosts seize their essence; when they violate a thousand, Earth records their forms. With each evil deed, shackles form in an instant—this is the retribution of *yin* and *yang*. August Heaven issues warnings, and those who defy them incur the wrath of ghosts, spirits, Heaven, and Earth.\n\nThe Yellow Emperor further asked about the signs of good and evil among immortals and whether one who receives blessings could have these matters examined and explained. Red Pine replied: The methods of cultivating the self, controlling fate, and governing one’s nature involve conducting oneself with auspicious *qi* each morning, focusing the mind on virtuous thoughts, words, deeds, and gazes. If within a single day the three karmas do not arise, then within three years, Heaven will send down a fortune star, and all shall be blessings in return. If, however, one consistently utters evil words, commits evil deeds, and casts evil glances each morning, teaching others to do evil daily, then within three years, calamity will befall them, leading to the loss of wealth and life. Earth will infuse them with malevolent *qi*, and they will surely decline.\n\nThe Nine Shameful Stars of Heaven correspond to the Nine Violent Deaths of the human realm. Good is the tally of evil; evil is the proof of good. It is also said: The good are the teachers of the wicked; the wicked are the resources of the good. Fortune is the evidence of misfortune; misfortune is the remnant of fortune. When good people frequently encounter disasters and manifold misfortunes, it is the lingering calamity of their ancestors. Thus, those who cultivate goodness throughout their lives need not select auspicious times or days; whenever they act, they naturally find fortune within misfortune, with a hundred spirits secretly protecting them and malevolent forces avoiding them. Conversely, those who do evil throughout their lives, even if they carefully choose auspicious days and times, will, when the moment arrives, encounter misfortune within fortune, with evil spirits harming them and benevolent spirits shunning them.\n\nYet if people consistently cultivate good conduct each day, Heaven will naturally increase their fortune and longevity, and harmonious *qi* and rosy light will surround them—this is the Way of form and shadow. To remain unwaning and unexhausted, preserving harmony with Heaven, one must understand the gains and losses of Heaven and Earth’s prohibitions and the Dao of cultivating the self and controlling fate. Now, let these be set forth in detail:\n\nWhen a person performs one good deed, the spirits’ minds are at peace. When they perform ten good deeds, their *qi* and strength flourish. When they perform twenty, their body knows no harm. When they perform thirty, their wishes are fulfilled. When they perform forty, they enjoy wealth and joy. When they perform fifty, their descendants prosper. When they perform sixty, they avoid false accusations and the entanglements of wicked people. When they perform seventy, their learning brings them honor. When they perform eighty, they gain the benefits of the land. When they perform ninety, the heavenly spirits protect them. When they perform a hundred, Heaven bestows upon them emolument, and they encounter sages. When they perform two hundred, their names are celebrated in later generations, and their descendants receive emolument. When they perform three hundred, three generations of descendants enjoy wealth, honor, and happiness. When they perform four hundred, four generations of descendants enjoy wealth, honor, and promotion. When they perform five hundred, five generations of descendants receive enfeoffment and elevated ranks. When they perform six hundred, generation after generation of descendants serve loyally and enjoy wealth and honor. When they perform seven hundred, generation after generation produces wise and sagacious people. When they perform eight hundred, they produce people of virtue and power. When they perform nine hundred, they produce sages. When they perform a thousand, they produce a host of immortals.\n\nAncient virtuous deeds and policies are recorded by the Dao of Heaven. Those who embody them have their allotted years extended, ascend in rank, and attain immortality, their blessings extending to their descendants, who give birth to the worthy and produce sages.\n\nIf a person commits one evil deed, their mind is unsettled. If they commit ten, their *qi* and strength wane. If they commit twenty, their body suffers many illnesses. If they commit thirty, their wishes go unfulfilled. If they commit forty, they face hardship, decline, and loss, with all affairs going awry. If they commit fifty, they will never find a match. If they commit sixty, their descendants will dwindle and perish.",
      "overlap_context": "lessings.\n\nPeople live between Heaven and Earth, endowed with the *qi* of *yin* and *yang*. Though the August Heaven is high, its response is below; though the Earth is lowly, its response is above. Heaven does not speak, yet the four seasons proceed; Earth does not speak, yet the myriad things are born. People dwell between them, indulging their desires. Every movement and breath of an ordinary person is known to Heaven and Earth. Thus, it is said that Heaven possesses four kinds of knowledge.\"",
      "start_char": 1237,
      "end_char": 2443,
      "start_sentence": 44,
      "end_sentence": 104,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.70192837715149,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\赤松子中诫经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "为七十恶，阴鬼谋害，为八十恶，水火为灾，非横烧溺； 为九十恶，贫寒困弱，疮疥风颠； 为一百恶，天气害之，横事牵引，刑法恶死； 为二百恶，地气害之，盗贼为灾； 为三百恶，世世出下贱人； 为四百恶，世世子孙，穷贱贫乞； 为五百恶，子孙绝嗣； 为六百恶，世世子孙，盲聋喑痖，出痴颠人； 为七百恶，出五逆不孝犯法子孙； 为八百恶，出叛臣逆子，诛灭亲族； 为九百恶，出妖孽之人，夷灭族类； 为一千恶，世世子孙，异形变体，为禽兽不具之状，积恶之殃满盈，祸及数世矣。 此为司命夺算，星落身亡，魂拷酆都，殃流后世。 黄帝又问曰：司命夺人算寿，世人作何罪所招？ 赤松子对曰：伏以世上之人，自犯悔咎，却言天道不平，有屈不自分雪，咒诅怒天，囚禁枷锁怒天，饥贫疾病怒天，寒暑霜雪怒天，昼夜短长怒天，自为恶事，祈咒於天，逆四时，违五行，对三光，裸体赤露，便利向三光星辰社庙之前，见日月薄蚀不救，贪自欢乐，不敬天地鬼神，不孝父母，呵骂风雨，毁拆圣人典教，破坏社庙，穿掘坟墓，取亡人财物，欺诈盲聋喑痖之人，窃盗金帛，将秽污泼他人屋舍，妄外破除衣服，以不净器物盛诸饮食，厌咒生人，埋符地下，妬贤嫉能，养诸蛊毒，杀害物命，遗无头文状，谗损平人，发觉他人私事，闭塞道路，填筑沟渠，偷他人物，抛奔用药，斫伐他人树木、苗稼、花果、园林，损害六畜，秽污井宠、宫观、庙宇、自身孝服，唱歌作乐，放火烧山，破除他人产业，涸绝池沼，捕采水族鼋鼉龟鱼，与人结交，违背盟誓，轻慢神道，奸诈诬罔，口是心非，恶言谗斗，僻要诤讼，教人官事重告，裸露对人，披发饮食，损善益恶，润己侵人，酷信邪师，教人非法，攻杀无罪，执正为非，恃势邪巧，入轻为重，春行杀伐，夏诛诸命，秋则见恶不改，冬则开掘地藏，离他人骨肉，好杀恶生，自重轻人，欺孤凌寡，败他成己，危他取安，借贷不还，誉己毁彼，和恶逐势，卖弄他权，阴毒面慈，见杀加怒，知过不改，见善不从，背亲向疏，慢高傲下，不受父母、师友教诲，妻妾谗斗，取小下言语，轻奔骨肉，施恩却悔，乐短他人穷，监窥他密事，调谴奸他妻妾，非道而行，夺人恩爱，窃他善事，自言己有，以重罪牵引平人保证，轻慢上下，不择尊卑，恃酒波物，用物不当，抛弃饮食，轻贱衣服，非分求觅，不避危亡，得新忘故，弃本逐末，知恩不报，欺诳谩人。 右所书过犯八百余件，略而言之，不可具载。 但世人有所犯，皆犯本照星辰，奏闻上帝、七星、六律、四时、八风、九宫、五行，先令司命夺算，令人短寿，令诸殃祸，延及子孙。",
      "translated_text": "If a person commits seventy evil deeds, malevolent spirits plot their harm. If they commit eighty, they suffer disasters of water and fire, drowning or burning in untimely calamities. If they commit ninety, they fall into poverty, weakness, sores, scabies, and madness. If they commit a hundred, Heaven’s *qi* harms them, entangling them in misfortune, leading to execution and violent death. If they commit two hundred, Earth’s *qi* harms them, bringing ruin through bandits and thieves. If they commit three hundred, their descendants will be born lowly and base. If they commit four hundred, their descendants will live in destitution, reduced to begging. If they commit five hundred, their lineage will be cut off. If they commit six hundred, their descendants will be born blind, deaf, mute, or afflicted with idiocy and madness. If they commit seven hundred, their descendants will commit the five inversions, violate the law, and be unfilial. If they commit eight hundred, they will produce traitorous ministers and rebellious sons, leading to the extermination of their kin. If they commit nine hundred, they will produce monstrous offspring, bringing annihilation to their clan. If they commit a thousand, their descendants will be deformed, their bodies altered into the shapes of beasts, incomplete in form. When the accumulation of evil reaches its full measure, the calamity extends for generations.\n\nThis is the Controller of Fate seizing their allotted years, their stars falling as their body perishes, their soul tormented in Fengdu, their misfortune flowing to posterity.\n\nThe Yellow Emperor further asked: \"When the Controller of Fate seizes a person’s allotted lifespan, what sins have they committed to invite this?\"\n\nMaster Red Pine replied: \"I humbly observe that people in the world bring misfortune upon themselves, yet they complain that the Dao of Heaven is unjust, refusing to reflect on their own faults. They curse and rage at Heaven when imprisoned in shackles, when starving or impoverished, when stricken with illness, when afflicted by cold, heat, frost, or snow, when resenting the length of day or night. They commit evil deeds yet pray and curse Heaven, defy the four seasons, violate the five phases, expose themselves naked before the Three Luminaries, relieve themselves facing the stars, the altars, or the temples, witness the eclipses of the sun and moon without attempting to save them, indulge in self-gratification while disrespecting Heaven and Earth and the spirits, fail to honor their parents, revile wind and rain, destroy the teachings of the sages, demolish altars and temples, desecrate graves to steal the belongings of the dead, deceive the blind, deaf, or mute, steal gold and silk, pour filth into others’ homes, recklessly tear or discard clothing, use unclean vessels for food and drink, cast curses on the living, bury talismans in the earth, envy the worthy and resent the capable, cultivate venomous creatures, take lives without cause, leave anonymous slanderous letters, malign the innocent, expose others’ private affairs, block roads, fill in ditches and canals, steal others’ possessions, discard or misuse medicine, fell others’ trees, crops, flowers, fruits, or gardens, harm livestock, defile wells, springs, palaces, temples, or monasteries, sing and make merry while in mourning, set fires to mountains, ruin others’ livelihoods, drain ponds and marshes, hunt and capture aquatic creatures like soft-shelled turtles, alligators, turtles, and fish, break oaths in their dealings with others, show contempt for the divine, engage in deceit and false accusations, speak with a forked tongue, spread malicious gossip, stir up strife, teach others to file frivolous lawsuits, expose themselves naked before others, eat and drink with disheveled hair, harm the good and aid the wicked, enrich themselves at others’ expense, blindly follow corrupt masters, teach unlawful practices, attack and kill the innocent, twist justice to serve wrongdoing, rely on power and cunning, exaggerate minor offenses, engage in killing in spring, take lives in summer, fail to correct their faults in autumn, disturb the earth’s treasures in winter, separate others from their kin, delight in killing and despise life, value themselves and belittle others, bully orphans and widows, undermine others to advance themselves, endanger others for their own security, borrow without repayment, praise themselves while slandering others, ally with the wicked and chase power, flaunt others’ authority, feign kindness while harboring malice, grow angry at the sight of killing, refuse to correct their faults, ignore goodness, turn their backs on family to favor strangers, disdain the high and oppress the low, reject the teachings of parents and teachers, allow wives and concubines to sow discord, heed petty and base words, abandon their kin, regret acts of kindness, rejoice in others’ misfortune, spy on others’ secrets, seduce others’ wives and concubines, act without principle, steal others’ affections, claim others’ good deeds as their own, implicate the innocent in serious crimes as guarantors, show disrespect to superiors and inferiors, disregard rank, indulge in drunken violence, misuse objects, discard food and drink, treat clothing with contempt, seek what is not rightfully theirs, court danger and death, forget old friends for new ones, abandon roots for branches, fail to repay kindness, deceive and mock others.\n\nHerein are recorded over eight hundred transgressions, though they cannot all be listed in full. Yet when people commit any of these offenses, they violate the stars that govern their fate, and their deeds are reported to the Supreme Emperor, the Seven Stars, the Six Pitches, the Four Seasons, the Eight Winds, the Nine Palaces, and the Five Phases. The Controller of Fate is first commanded to seize their allotted years, shortening their lifespan, and bringing misfortune that extends to their descendants.\"",
      "overlap_context": "ng to their descendants, who give birth to the worthy and produce sages.\n\nIf a person commits one evil deed, their mind is unsettled. If they commit ten, their *qi* and strength wane. If they commit twenty, their body suffers many illnesses. If they commit thirty, their wishes go unfulfilled. If they commit forty, they face hardship, decline, and loss, with all affairs going awry. If they commit fifty, they will never find a match. If they commit sixty, their descendants will dwindle and perish.",
      "start_char": 2443,
      "end_char": 3448,
      "start_sentence": 105,
      "end_sentence": 121,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.74966049194336,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\赤松子中诫经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "黄帝又问曰：人犯天地禁忌，夺算有数，人之罪如何？ 赤松子曰：人为天地之本，当为善伏缘。 世人外貌和柔，内怀阴妬，触犯禁忌，罪累非一，被司命一一录奏，应是世人遭刑杀者； 或两军相持，阵场死者。 一为自身有犯，宿业相雠，二为五运相交，太一伐之，数值迁移之历运，合受磨灭之灾殃。 黄帝又问赤松子曰：朕闻先生所说，世人违犯，卧不安席，罪可解乎？ 对曰：罪有可解者，有不可解者，世人偶行非道，心能悔过，是可解也； 若闻不信，知过不改，为恶转多，心毒炽盛，不可解也。 赤松子曰：人行善道，天地鬼神，赐福助之，增延寿考，无诸恶事，何以不为善道。 但世人尊敬天地、三光，不犯禁忌，孝爱父母，和顺兄弟，怜愍孤独，救接贫病，敬重师长，古来圣贤、乡里老人，教示不违，卑谦恭敬，每遇风雨、寒热，恶星怪异，日月交晕，亏犯薄蚀，皆宜念善，敬远鬼神，祭杞天地，上录其功，增延禄算。 见人为恶，劝人修善，若遇善人，敬而从之，或见凶危，将心救护，自就艰难，与人平稳，将己轻事，替人重役，劝人不为官事口舌争讼，葺理义井沟渠，修填道路。 不以小失其大，不以大弃其小，见人有所失，为其痛切； 见人有所．得，为之内喜。 扶赢护弱，施恩济惠孤贫，恭谨卑逊，让禄他人，天录中功，亦增遐寿，子孙获福。 如有志信不违，心崇道德，不避危险，救溺江湖，无淫外色，不侵他人屋宅、产业，不非理损害物命，好生恶杀，礼敬不亏，常习经书，恩不忘报，惠人不悔，宽怀忍辱，尽忠尽孝，不逞威仪，不枉用财物，不爱华丽之服修馔食，不非分杀命，自我作古，人无不亲，无自贤，无自善，无自解，无自富，无自矜，无自专，无自誉，无自重，无自尊，无自大，无自用，无自可，大录下功，皆增算寿。 又加算倍多者，人能事君、尽忠、事父、尽孝，不傲慢，敬师长，开悟童蒙，光赞师傅，修身谦让，和睦上下，抚爱均平，不听谗邪，直心用行，妇人孝顺，翁婆敬顺，夫婿清贞洁行，饮气吞声，参省晨昏，和颜悦色，无私奉上，并蒙加算，延寿增禄，灾横消除，男女聪慧。 人有折寿薄福者，臣弒君，子弒父，事师违背，业成忘师，悖乱无礼，不识亲疏，逞恣自我。 妇人违背父母，不孝翁婆，轻贱夫婿，口舌诽谤，斗乱六亲，盗窃巉慵，比邻为恶，皆夺福寿，恶病缠身，生遭人僧，死堕地狱。 黄帝又问曰：更有人间至妙之道，可得闻乎？ 赤松子曰：夫人修持善恶，自起於心，心是五贼之苗，万恶之根。 夫人之心拟行善，善虽未成，而善神已应矣； 心起恶，恶虽未萌，凶神已知。 故君子千日行善，善由未足； 片时造恶，恶便有余。 至如僭夺吞并，亦起於心，有得有失，会在天道。 又有起心害人，未必便得，乃其死生枯荣，亦由运也。 经云：天有五贼，见之者昌，失之者亡。 教法五德，行之者昌，背之者亡，行之为温、良、恭、俭、让，仁、义、礼、智、信，背之为恶、逆、贪、妬、杀，凶暴、乱、欺、诳诈、佞。 世人多行五背，心常九念：见他人家荣贵，说他往日风尘，起心愿他流贬； 见人富贵，笑他往日贫穷，愿他破散； 见他财帛丰盈，起心教人劫夺；",
      "translated_text": "Emperor Huang again asked: \"When people violate the prohibitions of Heaven and Earth, their allotted years are seized in measure—how grave are their offenses?\"\n\nMaster Red Pine replied: \"Humans are the root of Heaven and Earth; they ought to cultivate goodness and restrain their karma. Yet people present a gentle, harmonious appearance while harboring hidden malice. When they transgress prohibitions, their offenses accumulate without number, and the Controller of Fate records each one to be reported. Thus do people meet execution or perish on the battlefield: first, because they themselves have violated the Dao, and their past deeds become their adversaries; second, because the Five Phases intersect, and the Great Unity punishes them, their fate aligning with the shifting cycles of time, compelling them to suffer annihilation’s calamity.\"\n\nEmperor Huang again asked Master Red Pine: \"From what you have said, when people transgress, they lie uneasy upon their mats—can their offenses be absolved?\"\n\nHe replied: \"Some offenses may be absolved, others cannot. If people commit wrongs unintentionally and their hearts repent, absolution is possible. But if they hear the truth yet refuse to believe, recognize their faults yet refuse to change, persist in evil, and let their hearts grow cruel and fierce, absolution is impossible.\"\n\nMaster Red Pine said: \"When people follow the good Dao, Heaven and Earth, ghosts and spirits, bestow blessings and aid them, extending their years and longevity, sparing them from misfortune. Why, then, would one not walk the good Dao? People should revere Heaven and Earth and the Three Luminaries, avoid transgressing prohibitions, honor and love their parents, live in harmony with their siblings, pity the orphaned and solitary, rescue and assist the poor and sick, respect their teachers and elders, heed the teachings of ancient sages and village elders without defiance, and remain humble and reverent. Whenever they encounter wind and rain, cold and heat, malevolent stars, strange omens, eclipses of the sun and moon, or celestial obscurations, they should reflect on goodness, keep their distance from ghosts and spirits, and offer sacrifices to Heaven and Earth. Their merits will be recorded above, and their allotted years and blessings extended.\n\nWhen they see others doing evil, they should urge them to cultivate goodness. If they encounter good people, they should respect and follow them. When they witness danger or peril, they should rescue and protect with all their heart. When they themselves face hardship, they should ensure others remain secure. They should take on light burdens for themselves and heavy ones for others, dissuade people from engaging in lawsuits or quarrels, repair wells and irrigation channels, and mend roads.\n\nThey should not sacrifice the great for the small, nor abandon the small for the great. When they see others suffer loss, they should feel their pain deeply; when they see others gain, they should rejoice inwardly. They should support the weak and protect the infirm, bestow kindness and aid the orphaned and poor, remain reverent and humble, and yield their blessings to others. Their merits will be recorded in Heaven, and their longevity extended, bringing fortune to their descendants.\n\nIf one remains steadfast in faith, reveres the Dao and virtue, does not shirk danger, rescues those drowning in rivers and lakes, avoids illicit relations, does not encroach upon others’ homes or property, does not harm living beings without cause, cherishes life and abhors killing, upholds propriety without fail, studies the classics regularly, repays kindness without forgetting, bestows favors without regret, endures humiliation with forbearance, fulfills loyalty and filial piety, does not flaunt authority, does not squander wealth, does not covet fine clothing or lavish feasts, does not take lives unjustly, and sets an example for others to follow—then all will draw near to them. They should not consider themselves wise, virtuous, clever, wealthy, proud, domineering, boastful, self-important, self-exalting, arrogant, self-serving, or self-righteous. Their merits will be recorded below, and their allotted years extended. Those who receive even greater extensions are those who serve their lord with loyalty, their father with filial piety, remain free from arrogance, respect their teachers and elders, enlighten the young, honor their masters, cultivate humility, live in harmony with superiors and inferiors, treat all with fairness and kindness, refuse to listen to slander, act with sincerity, and ensure that women are filial and obedient to their parents-in-law, reverent toward their husbands, chaste and pure in conduct, patient and restrained in speech, diligent in morning and evening reflections, gentle and cheerful in demeanor, and selfless in their service. Such people will receive extended years, increased blessings, the dissipation of disasters, and wisdom for their sons and daughters.\n\nThose whose years are cut short and blessings diminished are ministers who murder their lords, children who murder their fathers, disciples who betray their teachers, those who forget their masters after achieving success, the rebellious and irreverent, those who fail to distinguish between kin and stranger, and those who indulge their desires and act with self-importance. Women who defy their parents, are unfilial to their parents-in-law, disdain their husbands, engage in slander and gossip, disrupt the harmony of their families, steal and act lazily, or harm their neighbors—all will have their blessings and years seized, suffer from grave illnesses, endure scorn in life, and fall into hell after death.\"\n\nEmperor Huang again asked: \"Is there yet a most wondrous Dao in the human realm that I may hear?\"\n\nMaster Red Pine replied: \"Whether people cultivate goodness or evil begins in the heart. The heart is the seed of the Five Thieves and the root of all evil. When the human heart intends to do good, though the good deed may not yet be done, the spirits of goodness already respond. When the heart conceives evil, though the evil may not yet have sprouted, the spirits of misfortune already know. Thus, a noble person may perform good deeds for a thousand days, yet their goodness may still be insufficient; but if they commit evil for even a moment, their evil will be more than enough.\n\nConsider those who usurp and seize by force—this too arises from the heart. Gain and loss alike are determined by the Dao of Heaven. Even if one harbors the intent to harm others, they may not succeed, for life and death, prosperity and decline, are governed by fate.\n\nThe classic states: 'Heaven has Five Thieves; those who perceive them prosper, those who lose them perish.' The teachings speak of Five Virtues: those who practice them prosper, those who abandon them perish. Practicing them means embodying warmth, kindness, reverence, frugality, and yielding, as well as benevolence, righteousness, propriety, wisdom, and trust. Abandoning them means embracing evil, rebellion, greed, envy, and killing, as well as cruelty, chaos, deceit, fraud, and flattery.\n\nPeople often practice the Five Abandonments, and their hearts are habitually moved by nine thoughts: when they see another’s family prosperous and noble, they speak of their past hardships and wish for their demotion; when they see another’s wealth and honor, they mock their former poverty and wish for their ruin; when they see another’s abundant wealth, they scheme to have it plundered...\"",
      "overlap_context": " recorded over eight hundred transgressions, though they cannot all be listed in full. Yet when people commit any of these offenses, they violate the stars that govern their fate, and their deeds are reported to the Supreme Emperor, the Seven Stars, the Six Pitches, the Four Seasons, the Eight Winds, the Nine Palaces, and the Five Phases. The Controller of Fate is first commanded to seize their allotted years, shortening their lifespan, and bringing misfortune that extends to their descendants.\"",
      "start_char": 3448,
      "end_char": 4652,
      "start_sentence": 122,
      "end_sentence": 152,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.0826575756073,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\赤松子中诫经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "见他妻妾美丽，起心欲作奸非； 见他屋宅宏壮，起心欲拟焚烧； 欠他债负，起心愿债主身亡； 借贷他人财物不得，起心懊恼恨多； 见他偶有危难，说他往日之非； 自生身父母，早愿亡殁，要财物、屋宅。 此是愚人九念。 是以天地鬼神恶之，赐其殃祸，夺其算寿也。 心行五德之人，常怀九思：见他荣贵，自思福业缘薄； 见他谷米盈仓，自思不勤力营种； 见他金玉资财，自思非我所有之物； 见他美色妻妾，自思匹偶不生乱心； 见他屋宅宏壮，自思弊陋且安； 见他旧曾於己不足遭官府，起救接之心； 欠他债负，目下未有还填，长思忧负勤偿之； 或欲借贷他人财物，自思旧无恩力； 见他事养君亲，常思无辛勤酬答世人。 能终日行此九思，弃前九念，为上智明慧人也，见世获於福佑，庆流子孙，横祸非灾不可及也。 黄帝又问先生曰：智人何等次之？ 对曰：有三等。 皆为仁者之人。 上智者，明天文，察地理，不学自晓，不教自解，默而识之，辩音律，鉴贤愚，心慈愍，不轻人，识成败，知进退，别存亡，此人虽贫而终富，暂卑而终高，此上智人也； 中智者，通会经书，常存礼敬，见贤思齐，扶危救弱，惠施不悔，忠孝不亏，言不伤物，卑逊温谦，此未学而终悟，虽未显而终达，此中智人也； 下智者，修善人也，改往修来，就业而思学，笃信善恶之事，不侵他人财物，保命惜身，会道理，识文法，自能好弱，自怕灾衰，如此兢兢而无过失，不遭横祸，此下智人也。 黄帝言曰：善哉，善哉，此言不可数於功德，谨依所说，录示众人，作大津梁。 诸群臣稽首而退，依教奉行。 赤松子中诫经竟",
      "translated_text": "When they see another’s wives and concubines beautiful, they conceive lustful and illicit desires; when they see another’s house grand and imposing, they conceive the desire to burn it down; when they owe another a debt, they wish the creditor dead; when they cannot borrow another’s wealth, they grow resentful and harbor deep hatred; when they see another in peril, they speak of their past wrongs; even toward their own parents, they early wish them dead to seize their wealth and property.\n\nThese are the nine thoughts of foolish people. Thus, Heaven and Earth and the spirits abhor them, visiting them with calamity and misfortune, cutting short their allotted lifespan.\n\nThose who practice the Five Virtues constantly hold nine reflections: seeing another’s honor and nobility, they reflect on their own meager karmic conditions; seeing another’s granaries filled with grain, they reflect on their own lack of diligent cultivation; seeing another’s gold, jade, and wealth, they reflect that these are not their own possessions; seeing another’s beautiful wives and concubines, they reflect on their own spouse and refrain from wayward thoughts; seeing another’s grand and imposing house, they reflect on their own humble dwelling and find contentment; seeing another who once slighted them now entangled with officials, they conceive the thought to rescue and assist them; owing another a debt and unable to repay it at present, they constantly reflect with concern and strive to repay it earnestly; desiring to borrow another’s wealth, they reflect on their past lack of kindness or merit; seeing another serving their lord and parents, they constantly reflect on their own lack of diligent repayment to others in the world.\n\nThose who can practice these nine reflections throughout the day, abandoning the former nine thoughts, are people of supreme wisdom and luminous understanding. In this life, they obtain blessings and protection, their prosperity flowing to their descendants, and unforeseen calamities and misfortunes cannot reach them.\n\nThe Yellow Emperor further asked the Master: \"What ranks follow the wise?\"\n\nThe Master replied: \"There are three grades, all being people of benevolence.\n\nThe highest wisdom: they understand astronomy, discern geography, comprehend without learning, grasp without teaching, silently retain knowledge, distinguish tones and rhythms, discern the worthy and the foolish, their hearts filled with compassion, never belittling others, recognizing success and failure, knowing advance and retreat, distinguishing survival and demise. Such people, though poor, will ultimately prosper; though briefly lowly, will ultimately rise—these are people of the highest wisdom.\n\nThe middle wisdom: they are well-versed in the classics, constantly upholding ritual and reverence, seeing the worthy and aspiring to emulate them, aiding the imperiled and rescuing the weak, bestowing kindness without regret, maintaining loyalty and filial piety without fail, their words never harming others, humble, yielding, warm, and modest. These, though unlearned, ultimately awaken; though not yet prominent, ultimately achieve success—these are people of middle wisdom.\n\nThe lower wisdom: they are cultivators of goodness, reforming the past and cultivating the future, pursuing their work while aspiring to learn, firmly believing in matters of good and evil, never encroaching on others’ wealth, preserving life and cherishing their bodies, understanding the Dao/Way and recognizing laws and texts, naturally aiding the weak, naturally fearing calamity and decline. Such people, vigilant and without fault, do not encounter unforeseen misfortunes—these are people of lower wisdom.\"\n\nThe Yellow Emperor said: \"Excellent! Excellent! These words cannot be overstated in their merit and virtue. I shall carefully follow what has been said, record it, and show it to all people, making it a great bridge and beam.\"\n\nAll the assembled ministers bowed their heads and withdrew, adhering to the teachings and putting them into practice.\n\n*Red Pine’s Middle Admonitions* concludes.",
      "overlap_context": "racing evil, rebellion, greed, envy, and killing, as well as cruelty, chaos, deceit, fraud, and flattery.\n\nPeople often practice the Five Abandonments, and their hearts are habitually moved by nine thoughts: when they see another’s family prosperous and noble, they speak of their past hardships and wish for their demotion; when they see another’s wealth and honor, they mock their former poverty and wish for their ruin; when they see another’s abundant wealth, they scheme to have it plundered...\"",
      "start_char": 4652,
      "end_char": 5273,
      "start_sentence": 153,
      "end_sentence": 179,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.582014322280884,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\赤松子中诫经.txt",
        "category": "戒律类"
      }
    }
  ]
}