{
  "source_id": "还丹秘诀养赤子神方",
  "source_file": "chunked_daozang\\还丹秘诀养赤子神方.json",
  "total_chunks": 3,
  "total_original_chars": 2011,
  "total_translated_chars": 12232,
  "total_translation_time": 58.64697456359863,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\方法类\\还丹秘诀养赤子神方.txt",
    "category": "方法类"
  },
  "full_translation": "*The Secret Formula of the Reverted Elixir for Nurturing the Divine Infant*\n\n**Title:** *The Secret Formula of the Reverted Elixir for Nurturing the Divine Infant*\n**Original Author:** Xu Mingdao of Xishan, dating to the Southern Song Dynasty. One fascicle.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, Methods Category.\n\n*The Secret Formula of the Reverted Elixir for Nurturing the Divine Infant*\nBy Xu Mingdao of Xishan\n\nIn the past, during the Chunxi era, I wandered beyond the mundane world, seeking out masters far and wide, yearning for the Dao of longevity and immortality. By chance, while passing through Xiang and Ying, I arrived at Tongbo Mountain in Suizhou, where I encountered a true teacher named Peng Mengqu, styled Boyu, a native of Yingzhou. Within the temple of the Huai River deity, I lit incense, knelt, and received the oral transmission of the Way of the Golden Fluid Reverted Elixir. Aside from diagrams, the master’s teachings were all conveyed through direct oral instruction and heart-to-heart transmission, never recorded on bamboo or silk.\n\nI have observed that in recent times, those who study the Dao are often misled by heterodox names and peripheral paths, and few succeed in refining the Great Elixir. Thus, undeterred by potential reproach, I have organized the master’s teachings into clear sections to guide later learners, laying the foundation for their progress. With diligent practice, swift attainment may be possible.\n\n### The Chamber of the Spirit\nThe Chamber of the Spirit is the palace where the myriad spirits gather and the essential locus for refining the Golden Elixir. For those who cultivate the truth, ignorance of this is like a person without a dwelling. If the spirit has no abode, qi is difficult to preserve, and the Elixir may never take form.\n\nIf one can tranquilly guard this chamber, the numinous spirit will transform of itself. As Zhuangzi said: *\"When the cosmos is at peace and settled, radiance issues forth from celestial light.\"* This is the principle. He also said: *\"The empty chamber generates brightness, and the spirit of wisdom comes of itself.\"* This is the truth of sincerity and illumination in the *Doctrine of the Mean*.\n\nThough the Chamber of the Spirit may seem to exist or not exist, the method of guarding it ensures mutual attainment. If one entirely forgets all realms and instantly stills all karmic conditions, the spirit becomes yin-quiet—this is the way of Chan masters. If one single-mindedly focuses on the One without responding to phenomena, one becomes one of the ten kinds of immortals, yet if one ceases practice entirely, all prior efforts are lost—this is the path of those who practice *daoyin*. But if one recognizes the Chamber of the Spirit, guards the method with measure, and maintains a foundation in both existence and non-existence, then mutual attainment leads to the abode of supreme tranquility.\n\nMoreover, the Chamber of the Spirit lies north of the heart, south of the kidneys, to the right of the liver, left of the lungs, and beside the spleen. Above it is the Crimson Palace, called the Yin Tripod; below it is the Yellow Court, called the Yang Furnace. These form the upper and lower cauldrons, with a space of one *cun* between them—this is the void between heart and kidneys, known as the Chamber of the Spirit, the pivot of the Mysterious Pass. How wondrous! How marvelous!\n\nThe Water Clock\n\nThe water clock is the essential subtlety of cultivating the True. If one does not recognize the water clock, the temporal markers become misaligned, and within the Chamber of the Spirit, bitter winter may turn to scorching summer, or midsummer to biting frost. Thus, the four seasons fall into disorder, the five phases intertwine in chaos, the workings of creation turn perverse, and the elixir becomes difficult to refine.\n\nThe water clock divides one day into one hundred *ke*. These one hundred *ke* are governed by the twelve hours, with each hour comprising eight *ke*, totaling ninety-six *ke* for the twelve hours. The remaining four *ke* are the pivot of Yin-Yang stagnation and harmony, the essential mechanism for the generation of the myriad things.\n\nIf one understands the water clock, one may verify it by drawing breath through the nose: Yang flows to the left, Yin to the right. The twelve hours alternate and shift, distinguishing the ninety-six *ke*, while the four *ke* are the crucial mechanism of *geng*, *jia*, *ren*, and *bing*.\n\nThe Temporal Markers\n\nThe temporal markers are the utmost essentials of cultivating the True. Without recognizing them, the workings of creation remain obscure, and the elixir difficult to refine.\n\nFrom *zi* to *si*, the six hours are the time for advancing the Yang Fire. From *wu* to *hai*, the six hours are the phase for retreating the Yin Talisman. *Zi*, *chou*, and *yin* correspond to spring; *mao*, *chen*, and *si* to summer; *wu*, *wei*, and *shen* to autumn; *you*, *xu*, and *hai* to winter.\n\nWithin these, *zi* and *wu* serve as the gates of advance and retreat, *mao* and *you* as the doors of exit and entry, and *yin* and *shen* as the omens of creation and subjugation. When these six hours form a complete cycle, they correspond to the fire numbers of the celestial revolution—truly the crucial mechanism for the adept’s refinement.\n\nPursuing the Two Qi\n\nPursuing the Two Qi refers to the primordial qi before Heaven and Earth divided, the essence of the initial encounter between Dragon and Tiger, the great medicine of the elixir. Relying on the profound and obscure moment when Heaven and Earth are indistinct, the pivot of stagnation and harmony, one may at this time concentrate the spirit within the Chamber.\n\nAwaiting the arrival of the celestial tally, the true spirit transforms and generates, becoming the true seed. The subtlety lies in the oral instructions.\n\nUniting the Three Essences\n\nThe Three Essences are the primordial qi, primordial essence, and primordial spirit. Previously, one has struck the Mysterious Pass to generate the true person. In cultivation, guarding these is called \"guarding the One and preserving the Three.\"\n\nGuarding the One ensures the full generation of the medicine, allowing the aged to regain youth, the old woman to become a maiden, white hair to turn black, fallen teeth to regrow, and the form to be transformed to escape worldly calamities—this is called the true person.\n\nGathering the Five Phases\n\nGathering the Five Phases means that when the previous five matters are complete, they converge and enter the Chamber. Advancing the fire and warming the water is called \"drilling and gathering the Five Phases.\"\n\nThe previous Two Qi are Metal and Wood, which are the transformative mechanisms of Water and Fire. Water and Fire rely on Metal and Wood, while the true person is the true Earth. Thus, the Five Phases are complete. The oral instructions follow.\n\nAdvancing the Fire\n\nAdvancing the Fire means advancing the Yang Fire. At the qi of the first Yang before the Winter Solstice, one enters the Chamber. For fifteen days, the spiritual root is fortified, and the spirit resides in the kidneys. As the Yang Fire circulates, the spirit follows and advances.\n\nThe kidneys are the root, and the Chamber of the Spirit is the stem. From root to stem, they are connected, thus enabling the formation of the embryo and the fruition of the elixir. Inhaling at the root, inhaling at the stem, when the seasonal markers complete their cycle, the great elixir is achieved.\n\nWhen advancing the Yang Fire on the night of the Winter Solstice, one must begin at the end of *hai* and the start of *zi*, igniting the fire from *ren*. For one ascent, three hours pass, and the breath neither enters nor exits. Carefully, from *zi* through *chou* to the end of *yin* at *jia*, Metal and Fire press forward into the Chamber, and the elixir gradually forms. At *mao*, one does not advance but halts the fire—this is the limit of seclusion. At *chen*, the fire is advanced again, and the oral instructions continue until the end of *si*, when Metal and Fire press into the Sea of Marrow. When the Yang Fire reaches its peak, the Yin Talisman is set in motion.\n\nWarming the Water\n\nWarming the Water means circulating the Yin Talisman. The Talisman is set in motion from within upward, proceeding for three hours, with the breath neither entering nor exiting. From *wu* through *wei* to the end of *shen* at *geng*, Metal and Water enter the Chamber via the Magpie Bridge at the Double Pass, and the Mysterious Pearl gradually manifests. At *you*, the Talisman is not circulated, and the Golden Sand undergoes bathing. At *xu*, the Talisman is circulated again, and the oral instructions continue until *hai*, when it returns to the source. The One Intestine regenerates, and the root and origin, along with the spirit, are fully transformed.\n\nTaking one grain daily, as large as a millet seed, after a year’s effort, the Returned Elixir begins to take form. Over three hundred and sixty days, totaling four thousand three hundred and twenty hours, excluding the two hours of *mao* and *you* when Metal and Water bathe—during which neither Yang Fire is advanced nor Yin Talisman circulated, and the breath enters and exits—sixty days are thus excluded. Precisely three hundred days remain for receiving the fire and talisman, refining the Golden Elixir.\n\nThis is akin to the ten months of gestation in an ordinary person. During this process, one must meticulously regulate and harmonize, applying sincere intent. If the slightest deviation occurs, misfortune arises, the elixir fails to form, the Red Dragon flees, and the Maiden escapes. Acting carelessly and lightly, one fails to align with the celestial mechanism. This is not the fault of the fire and talisman but the error of the adept who circulates them.\n\nAs the scripture states: \"One who cultivates with knowledge is called a sage.\" How can this be taken lightly?\n\nShedding the Embryo\n\nShedding the Embryo means that once the sacred embryo is formed, one must not yet exit the Chamber. Further work is required within the Chamber to carefully preserve the sacred embryo in the Sea of Marrow. This takes no more than two cycles of the Greater Yin *jiazi*. One must wait until the Celestial Gate suddenly opens with a thunderclap, and the sacred embryo sheds forth—two identical and indistinguishable forms.\n\nOne must not immediately separate from the body, for there remains the Way of Immortal Transformation to follow.\n\nThe Cloud Chamber states:\n*A thunderclap shakes Kunlun,*\n*Countless spirits silently startle.*\n*Two identical, indistinguishable forms—*\n*Only then does one know the work is complete, emerging from the dust.*\n\nSpiritual Transformation\n\nSpiritual Transformation means that once the sacred embryo has left the body, one must not yet depart far, lest one encounter the hindrance of the Corpse. Initially, one distances oneself by one step, then ten steps, a hundred *li*, a thousand *li*, and ten thousand *li*. Only then may one traverse the Three Realms, pass through stone and penetrate metal without obstruction. Going and staying are at one’s discretion, no longer subject to Heaven.\n\nThe Cloud Chamber states:\n*\"The child is young and not yet grown,*\n*Dependent on father and mother’s nurturing grace.*\n*After three years and nine, worldly ties are complete—*\n*Yet roaming the earth remains bound to kin.\"*\n\nThis is the secret formula for circulating the Returned Elixir, the method for nurturing the Divine Infant, the wondrous Dao of profound quiescence—no shallow art of peripheral schools. Whoever obtains this text must treasure and guard it in secrecy. Should it be transmitted to the unworthy, divine retribution will surely follow. Yet if one withholds it from the deserving, calamity shall likewise befall. The master’s warning is grave—how can one not take heed?\n\nLineage of Daoist Cultivation\nZhang Tiangang, styled Zizheng, of Shu;\nPeng Menglian, styled Boyu, of Shu;\nXiao Yingsou, styled Runqing, of Sanshan;\nXu Ziwei, styled Mingdao, of Shanxi;\nLin Yuanding, styled Zhengfu, of Sanshan.\n\nHere ends the *Secret Formula for the Returned Elixir and the Method for Nurturing the Divine Infant*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "还丹秘诀养赤子神方 经名：还丹秘诀养赤子神方。 原题西山许明道撰，出於南宋。 一卷。 底本出处：《正统道藏》洞真部方法类。 还丹秘诀养赤子神方 西山许明道迷 仆昨自淳熙年间，出游方外，遍参高人，慕久视长生之道。 偶经由襄郢间，至随州桐栢山，得遇真师，姓彭名梦蘧，字伯玉，郢州人也。 是於淮渎庙中，灶香，跪受金液还丹之道。 先生除图像外，并是口传心受，不曾书之竹帛。 仆闻近世学道之士，往往被异名旁道之惑，而成大丹者鲜。 遂不辞谴责，以先生之道分列条目，以示后学，为进道根基，修之庶可速成也。 神室 神室者，万神聚会之府，修炼金丹之要。 修真之士，若不知此，如人之无舍也。 神既无居，炁亦难守，丹恐难造。 若能静守其室，则灵神自化。 庄子曰：宇泰定，发乎天光。 是也。 又曰：虚室生白，神明自来。 则中庸之道，诚明是也。 虽神室若存若亡，守法事属两得。 若一向万境俱忘，诸缘顿息，神属阴静，此乃禅伯之流也。 若专心守一，不能应物，又成十种仙人，则一向不行，前功并失，为导引之士也。 若识神室，守法有度，存亡有据，不属有无，两得之则归泰定之府矣！ 且神室者，在心之北，肾之南，肝之右，肺之左，脾之旁，上有绛宫，曰阴鼎，下有黄庭，曰阳炉。 是为上下釜，其中径寸虚无，乃心肾之间，为之神室，为玄关枢纽。 玄妙哉！ 奇妙哉！",
      "translated_text": "*The Secret Formula of the Reverted Elixir for Nurturing the Divine Infant*\n\n**Title:** *The Secret Formula of the Reverted Elixir for Nurturing the Divine Infant*\n**Original Author:** Xu Mingdao of Xishan, dating to the Southern Song Dynasty. One fascicle.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, Methods Category.\n\n*The Secret Formula of the Reverted Elixir for Nurturing the Divine Infant*\nBy Xu Mingdao of Xishan\n\nIn the past, during the Chunxi era, I wandered beyond the mundane world, seeking out masters far and wide, yearning for the Dao of longevity and immortality. By chance, while passing through Xiang and Ying, I arrived at Tongbo Mountain in Suizhou, where I encountered a true teacher named Peng Mengqu, styled Boyu, a native of Yingzhou. Within the temple of the Huai River deity, I lit incense, knelt, and received the oral transmission of the Way of the Golden Fluid Reverted Elixir. Aside from diagrams, the master’s teachings were all conveyed through direct oral instruction and heart-to-heart transmission, never recorded on bamboo or silk.\n\nI have observed that in recent times, those who study the Dao are often misled by heterodox names and peripheral paths, and few succeed in refining the Great Elixir. Thus, undeterred by potential reproach, I have organized the master’s teachings into clear sections to guide later learners, laying the foundation for their progress. With diligent practice, swift attainment may be possible.\n\n### The Chamber of the Spirit\nThe Chamber of the Spirit is the palace where the myriad spirits gather and the essential locus for refining the Golden Elixir. For those who cultivate the truth, ignorance of this is like a person without a dwelling. If the spirit has no abode, qi is difficult to preserve, and the Elixir may never take form.\n\nIf one can tranquilly guard this chamber, the numinous spirit will transform of itself. As Zhuangzi said: *\"When the cosmos is at peace and settled, radiance issues forth from celestial light.\"* This is the principle. He also said: *\"The empty chamber generates brightness, and the spirit of wisdom comes of itself.\"* This is the truth of sincerity and illumination in the *Doctrine of the Mean*.\n\nThough the Chamber of the Spirit may seem to exist or not exist, the method of guarding it ensures mutual attainment. If one entirely forgets all realms and instantly stills all karmic conditions, the spirit becomes yin-quiet—this is the way of Chan masters. If one single-mindedly focuses on the One without responding to phenomena, one becomes one of the ten kinds of immortals, yet if one ceases practice entirely, all prior efforts are lost—this is the path of those who practice *daoyin*. But if one recognizes the Chamber of the Spirit, guards the method with measure, and maintains a foundation in both existence and non-existence, then mutual attainment leads to the abode of supreme tranquility.\n\nMoreover, the Chamber of the Spirit lies north of the heart, south of the kidneys, to the right of the liver, left of the lungs, and beside the spleen. Above it is the Crimson Palace, called the Yin Tripod; below it is the Yellow Court, called the Yang Furnace. These form the upper and lower cauldrons, with a space of one *cun* between them—this is the void between heart and kidneys, known as the Chamber of the Spirit, the pivot of the Mysterious Pass. How wondrous! How marvelous!",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 546,
      "start_sentence": 0,
      "end_sentence": 29,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.465607404708862,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\还丹秘诀养赤子神方.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "刻漏 刻漏者，乃修真之要妙，若不识刻漏，则时晷不正，则神室中或隆冬酷暑，盛夏严霜，致四季不调，五律错综，造化乖戾，丹亦难造。 且刻漏者，一日有一百刻，以一百统於十二时，每时得八刻，十二时共得九十六刻，其中四刻乃阴阳否泰之机，发生万汇之要也。 如知刻漏，引鼻气验之，阳左通，阴右通，十二时互换更易，只分得九十六刻，其四刻乃庚甲壬丙之要机也。 时晷 时晷者，乃修真之至要也，若不识时晷，造化难明，丹亦难造。 其时晷者，自子至巳，六辰乃进阳火之时也； 自午至亥，六辰乃退阴符之候也。 子丑寅为春，卯辰巳为夏，午未申为秋，酉戌亥为冬。 其中分子午为进退之门，卯酉为出入之户，寅申为造伏之兆如是六辰圆合，，应周天火数，实炼士之要机也。 追二炁 夫追二炁者，乃天地未判之炁，搏龙虎始姤之精，为大丹药物。 凭天地杳冥恍惚之时，否泰之机括，至斯时可以凝神於室中。 俟天地之符信一至，则真神化生，为真种子也。 要妙在口诀。 会三性 三性者，乃元气、元精、元神，以前打赓玄关，而生真人是也。 修真守此，谓之守一存三。 守一乃药物生全也，可以耆访复丁壮，老妪成姹女，发白反黑，齿落更生，改形免世厄，号之曰真人。 簇五行 簇五行者，乃前五事俱，会合入室，进火温水，谓之钻簇五行也。 前二炁者，乃金木也，金木者，水火之化机也。 水火者，金木之相须也，真人者，真土也，如是则五行全矣！ 口诀在后 进火 进火者，乃进阳火也，於冬至前一阳之炁，入室，其十五日筑固灵根，神存在肾，何阳火－运行，其神随逐而进。 肾中根也，神室蒂也。 自根至蒂，所以相连，故能结胎成果。 吸之根，吸之蒂，节候周而成大丹也。 如冬至夜进阳火，须是亥末子初，从壬上起火，一举三时，其息并无出入。 叮自子历丑，至寅末甲上，金火逼逐，入室，其丹渐结，至卯不进，住火，乃幽之限也。 辰时复进火，口诀至已末，金火逼逐至髓海，阳火既极，则运阴符矣。 温水 温水者，乃运阴符也，自内上运符，得行三时，其息并无出入，至午历未，至申末庚上，金水从双关鹊桥入室，玄珠渐兆，至酉不运符候，金砂沐浴，至戌复运符候，口诀至亥归源，一肠复生，则根源本始，神俱化也。 一日服一粒，大如黍米，一年功力，还丹始就，共三百六十日，计四千三百二十时，除卯酉二时，金水沐浴，不进阳火，不运阴符，其息出入，故除此两月六十日，正得三百日，受火符，炼就金丹。 亦如常人十个月胎圆，其间用运，须是细意调燮，志诚运图。 若纤介不正，晦吝作咎，丹之不结，则赤龙奔逸，姹女逃亡，率意轻举，不合天机。 又非符火之咎，乃运火符之士过也。 经云：知之修炼，谓之圣人。 其可忽诸。 脱胎 脱胎者，乃前圣胎既就，未可出室，更於室中行脱胎工夫谨存圣胎於髓海中，不过两太阴甲子，直待天门忽开，如霹雳一声，则圣胎脱出，两个一般无二样。 未可便离体，更有仙化之道在后。 云房曰：一声霹雳震昆仑，无限神明暗失惊，两个一般无二样，始知功满出埃尘。 神化 神化者，乃前圣胎出体，未可远离，恐逢尸障。 初离一步十步，一百里，一千里，千万里，然后巡行三界，透石贯金，俱无碍障，去住在我，不在乎天。",
      "translated_text": "The Water Clock\n\nThe water clock is the essential subtlety of cultivating the True. If one does not recognize the water clock, the temporal markers become misaligned, and within the Chamber of the Spirit, bitter winter may turn to scorching summer, or midsummer to biting frost. Thus, the four seasons fall into disorder, the five phases intertwine in chaos, the workings of creation turn perverse, and the elixir becomes difficult to refine.\n\nThe water clock divides one day into one hundred *ke*. These one hundred *ke* are governed by the twelve hours, with each hour comprising eight *ke*, totaling ninety-six *ke* for the twelve hours. The remaining four *ke* are the pivot of Yin-Yang stagnation and harmony, the essential mechanism for the generation of the myriad things.\n\nIf one understands the water clock, one may verify it by drawing breath through the nose: Yang flows to the left, Yin to the right. The twelve hours alternate and shift, distinguishing the ninety-six *ke*, while the four *ke* are the crucial mechanism of *geng*, *jia*, *ren*, and *bing*.\n\nThe Temporal Markers\n\nThe temporal markers are the utmost essentials of cultivating the True. Without recognizing them, the workings of creation remain obscure, and the elixir difficult to refine.\n\nFrom *zi* to *si*, the six hours are the time for advancing the Yang Fire. From *wu* to *hai*, the six hours are the phase for retreating the Yin Talisman. *Zi*, *chou*, and *yin* correspond to spring; *mao*, *chen*, and *si* to summer; *wu*, *wei*, and *shen* to autumn; *you*, *xu*, and *hai* to winter.\n\nWithin these, *zi* and *wu* serve as the gates of advance and retreat, *mao* and *you* as the doors of exit and entry, and *yin* and *shen* as the omens of creation and subjugation. When these six hours form a complete cycle, they correspond to the fire numbers of the celestial revolution—truly the crucial mechanism for the adept’s refinement.\n\nPursuing the Two Qi\n\nPursuing the Two Qi refers to the primordial qi before Heaven and Earth divided, the essence of the initial encounter between Dragon and Tiger, the great medicine of the elixir. Relying on the profound and obscure moment when Heaven and Earth are indistinct, the pivot of stagnation and harmony, one may at this time concentrate the spirit within the Chamber.\n\nAwaiting the arrival of the celestial tally, the true spirit transforms and generates, becoming the true seed. The subtlety lies in the oral instructions.\n\nUniting the Three Essences\n\nThe Three Essences are the primordial qi, primordial essence, and primordial spirit. Previously, one has struck the Mysterious Pass to generate the true person. In cultivation, guarding these is called \"guarding the One and preserving the Three.\"\n\nGuarding the One ensures the full generation of the medicine, allowing the aged to regain youth, the old woman to become a maiden, white hair to turn black, fallen teeth to regrow, and the form to be transformed to escape worldly calamities—this is called the true person.\n\nGathering the Five Phases\n\nGathering the Five Phases means that when the previous five matters are complete, they converge and enter the Chamber. Advancing the fire and warming the water is called \"drilling and gathering the Five Phases.\"\n\nThe previous Two Qi are Metal and Wood, which are the transformative mechanisms of Water and Fire. Water and Fire rely on Metal and Wood, while the true person is the true Earth. Thus, the Five Phases are complete. The oral instructions follow.\n\nAdvancing the Fire\n\nAdvancing the Fire means advancing the Yang Fire. At the qi of the first Yang before the Winter Solstice, one enters the Chamber. For fifteen days, the spiritual root is fortified, and the spirit resides in the kidneys. As the Yang Fire circulates, the spirit follows and advances.\n\nThe kidneys are the root, and the Chamber of the Spirit is the stem. From root to stem, they are connected, thus enabling the formation of the embryo and the fruition of the elixir. Inhaling at the root, inhaling at the stem, when the seasonal markers complete their cycle, the great elixir is achieved.\n\nWhen advancing the Yang Fire on the night of the Winter Solstice, one must begin at the end of *hai* and the start of *zi*, igniting the fire from *ren*. For one ascent, three hours pass, and the breath neither enters nor exits. Carefully, from *zi* through *chou* to the end of *yin* at *jia*, Metal and Fire press forward into the Chamber, and the elixir gradually forms. At *mao*, one does not advance but halts the fire—this is the limit of seclusion. At *chen*, the fire is advanced again, and the oral instructions continue until the end of *si*, when Metal and Fire press into the Sea of Marrow. When the Yang Fire reaches its peak, the Yin Talisman is set in motion.\n\nWarming the Water\n\nWarming the Water means circulating the Yin Talisman. The Talisman is set in motion from within upward, proceeding for three hours, with the breath neither entering nor exiting. From *wu* through *wei* to the end of *shen* at *geng*, Metal and Water enter the Chamber via the Magpie Bridge at the Double Pass, and the Mysterious Pearl gradually manifests. At *you*, the Talisman is not circulated, and the Golden Sand undergoes bathing. At *xu*, the Talisman is circulated again, and the oral instructions continue until *hai*, when it returns to the source. The One Intestine regenerates, and the root and origin, along with the spirit, are fully transformed.\n\nTaking one grain daily, as large as a millet seed, after a year’s effort, the Returned Elixir begins to take form. Over three hundred and sixty days, totaling four thousand three hundred and twenty hours, excluding the two hours of *mao* and *you* when Metal and Water bathe—during which neither Yang Fire is advanced nor Yin Talisman circulated, and the breath enters and exits—sixty days are thus excluded. Precisely three hundred days remain for receiving the fire and talisman, refining the Golden Elixir.\n\nThis is akin to the ten months of gestation in an ordinary person. During this process, one must meticulously regulate and harmonize, applying sincere intent. If the slightest deviation occurs, misfortune arises, the elixir fails to form, the Red Dragon flees, and the Maiden escapes. Acting carelessly and lightly, one fails to align with the celestial mechanism. This is not the fault of the fire and talisman but the error of the adept who circulates them.\n\nAs the scripture states: \"One who cultivates with knowledge is called a sage.\" How can this be taken lightly?\n\nShedding the Embryo\n\nShedding the Embryo means that once the sacred embryo is formed, one must not yet exit the Chamber. Further work is required within the Chamber to carefully preserve the sacred embryo in the Sea of Marrow. This takes no more than two cycles of the Greater Yin *jiazi*. One must wait until the Celestial Gate suddenly opens with a thunderclap, and the sacred embryo sheds forth—two identical and indistinguishable forms.\n\nOne must not immediately separate from the body, for there remains the Way of Immortal Transformation to follow.\n\nThe Cloud Chamber states:\n*A thunderclap shakes Kunlun,*\n*Countless spirits silently startle.*\n*Two identical, indistinguishable forms—*\n*Only then does one know the work is complete, emerging from the dust.*\n\nSpiritual Transformation\n\nSpiritual Transformation means that once the sacred embryo has left the body, one must not yet depart far, lest one encounter the hindrance of the Corpse. Initially, one distances oneself by one step, then ten steps, a hundred *li*, a thousand *li*, and ten thousand *li*. Only then may one traverse the Three Realms, pass through stone and penetrate metal without obstruction. Going and staying are at one’s discretion, no longer subject to Heaven.",
      "overlap_context": " tranquility.\n\nMoreover, the Chamber of the Spirit lies north of the heart, south of the kidneys, to the right of the liver, left of the lungs, and beside the spleen. Above it is the Crimson Palace, called the Yin Tripod; below it is the Yellow Court, called the Yang Furnace. These form the upper and lower cauldrons, with a space of one *cun* between them—this is the void between heart and kidneys, known as the Chamber of the Spirit, the pivot of the Mysterious Pass. How wondrous! How marvelous!",
      "start_char": 547,
      "end_char": 1833,
      "start_sentence": 30,
      "end_sentence": 76,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.053239583969116,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\还丹秘诀养赤子神方.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "云房曰：孩儿幼小未成人，须藉爷娘养恩，三载九年人事尽，纵横天下不由亲。 此乃运还丹秘诀，养赤子神方，希夷妙道，非旁门浅术。 此文得之者，可宝而秘之，若传非人，必遭天谴。 得人不传，亦受其殃。 师嘱甚重，可不戒焉！ 修真传派 张天罡字子正蜀人， 彭梦莲字伯玉蜀人， 萧应叟字润清三山人， 许子微字明道山西人， 林元鼎字正夫三山人。 还丹秘诀养赤子神方竟",
      "translated_text": "The Cloud Chamber states:\n*\"The child is young and not yet grown,*\n*Dependent on father and mother’s nurturing grace.*\n*After three years and nine, worldly ties are complete—*\n*Yet roaming the earth remains bound to kin.\"*\n\nThis is the secret formula for circulating the Returned Elixir, the method for nurturing the Divine Infant, the wondrous Dao of profound quiescence—no shallow art of peripheral schools. Whoever obtains this text must treasure and guard it in secrecy. Should it be transmitted to the unworthy, divine retribution will surely follow. Yet if one withholds it from the deserving, calamity shall likewise befall. The master’s warning is grave—how can one not take heed?\n\nLineage of Daoist Cultivation\nZhang Tiangang, styled Zizheng, of Shu;\nPeng Menglian, styled Boyu, of Shu;\nXiao Yingsou, styled Runqing, of Sanshan;\nXu Ziwei, styled Mingdao, of Shanxi;\nLin Yuanding, styled Zhengfu, of Sanshan.\n\nHere ends the *Secret Formula for the Returned Elixir and the Method for Nurturing the Divine Infant*.",
      "overlap_context": "merging from the dust.*\n\nSpiritual Transformation\n\nSpiritual Transformation means that once the sacred embryo has left the body, one must not yet depart far, lest one encounter the hindrance of the Corpse. Initially, one distances oneself by one step, then ten steps, a hundred *li*, a thousand *li*, and ten thousand *li*. Only then may one traverse the Three Realms, pass through stone and penetrate metal without obstruction. Going and staying are at one’s discretion, no longer subject to Heaven.",
      "start_char": 1833,
      "end_char": 2019,
      "start_sentence": 77,
      "end_sentence": 88,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.128127574920654,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\还丹秘诀养赤子神方.txt",
        "category": "方法类"
      }
    }
  ]
}