{
  "source_id": "还丹肘后诀",
  "source_file": "chunked_daozang\\还丹肘后诀.json",
  "total_chunks": 18,
  "total_original_chars": 18162,
  "total_translated_chars": 103457,
  "total_translation_time": 556.9307765960693,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\还丹肘后诀.txt",
    "category": "众术类"
  },
  "full_translation": "**The Elbow-Pocket Formula for Cyclically Transmuted Cinnabar**\n\n**Title of the Scripture:** *The Elbow-Pocket Formula for Cyclic Reversion of Cinnabar*\n**Author:** Unknown; roughly dated between the Tang and Song dynasties.\n**Volume:** Three.\nThe first volume records formulas and methods for external alchemy, much of which aligns with *The Cavern Mountain Formula*. The middle and lower volumes compile verses and formulas from various alchemical scriptures, discussing both internal and external alchemical methods.\n**Source of the Base Text:** *Daoist Canon of the Zhengtong Era*, *Section of the Cavernous Divine*, *Category of Miscellaneous Arts*.\n\n---\n\n### *The Elbow-Pocket Formula for Cyclically Transmuted Cinnabar, Volume One*\n\nThe *Elbow-Pocket Formula* was composed by the Perfected Master Ge of Zhichuan. Originally in ten volumes—nine of which expound upon the world’s medical texts and herbal remedies for healing—the tenth distinguishes the authenticity of metallic minerals, great elixirs, and the Yellow Sprout, clarifying the firing times with crystalline precision. It was written to serve as a model for future scholars, preventing errors. Whoever obtains this formula has already grasped half of the great elixir’s gate.\n\nI possess oral instructions, yet they are not burdensome to the mind. Thus, the utmost truth is conveyed with intent, guiding the benighted so that all may attain immortality. Later scholars must study this carefully.\n\n**The Formula states:**\nThe treasure elixir originates from the One, which generates the Two. The Two generates Fire, lodged in *bing*-*ding*, born of *jia*-*yi*. At the *ninth-initial*, the Hidden Dragon stirs as the solitary Yang arises. The *jianzi* celestial tally aligns, releasing and concealing in shock and trepidation, receiving the Black from the Mother—Mother being Earth.\n\nThe Dao generates the One, the One generates the Two, the Two generates the Three. The Three are the parents of Yang; Yang is the essence of Heaven and Earth. Thus, the Three, Five, and One form the foundation of cyclically transmuted cinnabar.\n\nThe celestial tally is called *Trust*. The Sun is the primordial essence of Heaven and Earth, the first illumination of the Five Phases. Years are reckoned by months, months by days, days by hours, and hours by years—thus measuring distance and discerning sameness and difference.\n\nWhen primordial chaos first divided, the essence and Black of Yin and Yang emerged. The Dipper’s handle marks the twelve branches, shifting and revolving without cease. The clepsydra’s drip never halts; release and intermingling give birth to the myriad things, shaping their forms.\n\nThe celestial tally is *Trust*—capable of release, enabling the myriad things to take form. Movement returns to the root, condensing into essence. The Yin Black stealthily circulates, congealing and transforming into essence. Essence transforms into cinnabar, its color endowed by the southern *bing*-*ding* Fire—externally Yang, internally Yin—ruling man, the Sun, and the Yang soul. The radiance of the Sun and Moon’s essence and Black shines as one, illuminating Heaven and Earth.\n\nThe Great Yang and Great Yin Blacks harmonize in the center, exchanging and receiving for 1,080 years, condensing essence into cinnabar. Another 1,080 years under the celestial tally’s illumination completes its form, named *Cinnabar*. Mercury is born within cinnabar—Yang within Yin—called the *Great Yang Vermilion Bird*, ruling Water.\n\nWhen the primordial harmony’s Black is insufficient, it is called *Cinnabar Sand*, also known as *Celestial Lead*, *Male Dragon*, or *Female Blood*. Transforming south into north, extracting the vermilion, it becomes Yin Mercury, ruling Water, numbered One—thus Mercury is said to be the Yang minister.\n\n*Celestial Lead* is divine water. The celestial tally’s movement illuminates cinnabar, nurturing it for another 1,080 years. Heavenly Fire’s transformation fills the Yang Black, while the Yin Black wanes. Yang flourishes to fullness, overflowing in brilliance, naturally generating color—endowed by the northern *ren*-*gui* Water, externally Yin and internally Yang—ruling the Moon’s Yin spirit. It is no common worldly substance, for within red stone, it spontaneously generates, flowing as Yang Mercury. Named the *Essence of Celestial Lead*, the *Ancestor of the Yellow Sprout*, it is the essence and radiance of the Sun and Moon, transformed into natural cyclically transmuted cinnabar. Naturally subduing Fire, its Black color shifts from north to west, ruling Metal, numbered Four—the foundation of Water.\n\nThus, the Three, Five, and One are the utmost essence of Heaven and Earth. The Three are the parents of Fire; the Five, the parents of cinnabar; the One, the primordial ancestor of cinnabar. Revolving and circulating, essence and primordial harmony interact to form shape, never straying from the One. The One is the root and origin of the Great Dao—Water.\n\nScholars fail to recognize that cinnabar is Lead, and the child born within Lead is Gold. A single entity of Yin and Yang self-circulates, self-regulates. Yang within Yin, Yin within Yang, Mystery within Mystery—called the *Mysterious Warrior Stone*. Transforming Water into Gold, it is thus named *Cinnabar*. Born within the Yin of Metal, it is the sovereign, named *Lead-Gold*.\n\nThe celestial tally’s movement, over 4,320 years, illuminates its parents, nurturing *Celestial Lead* into natural cyclically transmuted cinnabar.\n\n**The Formula states:**\nLater sages used Fire to illustrate the hexagrams. A month comprises 360 hours; a year’s climatic phases total 4,320 hours—matching the natural cyclically transmuted cinnabar, named *Cinnabar Mercury*, the Water within Gold. Water to the north, Fire to the south; Dragon to the east, Tiger to the west. The Five Phases unite in one body, returning to the undivided Five. By aligning with the earthly tally and adhering to the seasonal nodes’ movement, the Golden Elixir is achieved.\n\n**The Formula states:**\nThis cinnabar emerges within the Central Hua, in the twelfth terrestrial division’s second palace—the southwest *kun* region. This treasure is the utmost essence of Heaven and Earth, the correct Black of primordial harmony. Through the Sun, Moon, and celestial tally’s movement, intermingling occurs in the Five. The Five are *wu*-*ji*, the central palace’s Earth.\n\nThe places where it is born—auspicious mountains and ridges, lands of favorable terrain—possess the Qi, Blood, Bones, and Flesh of Metal, with Water and Wood both flourishing. Where bones and flesh are complete, grasses and trees thrive, soil and stone are firm and steadfast—such extraordinary realms are guarded by divine spirits. The Yin and Yang Blacks release and nurture, containing and gestating, illuminating essence and Black. Born of Earth, it transforms into cinnabar.\n\nWherever cinnabar is found, after the first clear dawn or in dim light, radiance appears like the rising Sun—now hidden, now visible—discernible only to skilled miners. The places where it emerges are called *Cinnabar*, also named *Vermilion Sand*.\n\n*Cinnabar*, *Vermilion Lead*, *Celestial Lead*, *Fire Lead*, *Gold within Lead*, *Divine Water Flower Pool*, *Yin Mercury*, *Yang Mercury*, *Quicksilver*, *Yang within Yin*, *Yin within Yang*, *Five-Colored Stone*, *Five Metals*, *Lord of the Seven Treasures*, *Cyclically Transmuted Cinnabar*, *Heaven-Born Yellow Sprout*—the origin of the Five Phases.\n\nThe regions known as *Guifu*, *Chenjin*, *Hengqiu*, *Joulou*, *Yunmeng*, *Dushan*, *Bangyong*, *Quandao*, *Tanyue*, and their governed lands—where cliffs, rocky caverns, and lush terrain abound—host both new and ancient mines. Within these, cinnabar of varying grades appears, its luminous surface smooth as a mirror, resembling lotus blossoms or hibiscus, vibrant red and translucent, all deemed top-tier. The middle and lower grades, too numerous to list, may still yield mercury for refinement and other uses, though they are unfit for the supreme elixir of great alchemy.\n\nTop-grade cinnabar is like a sovereign ascending the throne, with all officials in attendance. The middle grade resembles a renowned minister, while the lower grade is akin to common folk—serviceable, yet lacking independent mastery.\n\nThe celestial tally is the Sun, the essence and spirit of Yang, the principle of Heaven, radiating brilliance. *Huainanzi* states: \"The gathering of Yang’s *qi* forms fire; the essence of fire is the Sun, whose pure, crystalline light embodies its meaning.\" It further says: \"The Sun is born of *jia*, the position of double Yang. Fire arises from *zhen*, *zhen* being the eldest son, *xun* the eldest daughter—the parents of fire.\" Fire is called *zeng*, wood *qing*; all things are governed by them, hence the term *zengqing*.\n\nThe Moon is the essence and soul of Yin, the principle of Earth, casting its glow. *Huainanzi* says: \"The gathering of Yin’s cold *qi* ascends as water; the essence of water is the Moon, waxing and waning to fulfill its nature.\" It further states: \"The Moon is born of *geng*, the position of double Yin. Water arises from *dui*, *dui* being the youngest daughter, *kan* the middle son—the parents of water.\" Thus, man aligns with the Sun’s rise in the east, while woman mirrors the Moon’s ascent in the west.\n\nThe scriptures declare: \"Cinnabar is the essence of the Sun and Moon, the root of life and destiny, harmonizing inner and outer primal *qi*. It bears and shapes form, and when ingested, grants immortality—the mutual resonance of Sun and Moon.\" Hence it is said: \"The Moon’s birth and the Sun’s nurturance depend on the mother, who is Earth.\" These two treasures, Sun and Moon, are the purest essences of Heaven and Earth. The union of *jia* and *geng* transforms and refines, their radiance coalescing into form, crystallizing as cinnabar—first named *Vermilion Phoenix*, the most revered among the seventy-two stones, none surpassing mercury.\n\nResonating with the twenty-four *qi*, manifesting in twenty-four names, a chicken fed upon it becomes a phoenix, a serpent that swallows it transforms into a dragon, and one who consumes it attains longevity, their lifespan equaling Heaven and Earth. It gathers the hun and po, reverses aging to youth, commands the winds and clouds, and summons jade maidens—such is the power of the great cyclically transmuted cinnabar.\n\nThe formula states: \"Red lead is cinnabar. The liquid drawn from cinnabar governs water—*yang*-within-*yin* mercury. That which emerges naturally from cinnabar governs *yin*—*yang*-within-metal mercury.\" Thus, the wood that cannot be contained is restrained by metal; metal nurtures water, and water’s stability depends on its presence. Metal and wood nurture fire, and fire’s control relies on water. Therefore, lead-water restrains mercury-water, and lead-fire restrains mercury-fire. Wood embodies its nature, while fire unites its form.\n\nThe formula states: \"Lead-water is the mercury that naturally arises from cinnabar—*yang* mercury. Mercury-water is the liquid extracted from cinnabar—*yin* mercury.\" Hence it is said: \"Lead-water restrains mercury-water.\" It further says: \"Lead-fire is the metal that arises naturally. Mercury-fire is the liquid drawn out.\" Yet lead-fire restraining mercury-fire is a principle many fail to grasp, thus it is called the Dao of lead and mercury.\n\nThe Sun is the fiery essence of Great Yang—mercury-wood as the dragon. The Moon is the watery essence of Great Yin—lead-metal as the tiger. The dragon is Yang *qi*, the utmost of the number nine, the essence of wood. The tiger is Yin *qi*, the utmost of the number four, the essence of metal.\n\nThe formula states: \"Use non-being to restrain being, and the Dao is complete.\" Thus it is said: \"Cinnabar, the essence of wood, unites with metal without the slightest deviation—most sacred, most numinous.\" Yet the world, failing to comprehend, sees gold as mere earth.\n\nThe elixir is called *Tai Xuan*. The Dao of the *Yin Fu* generates Yin and Yang; Yin and Yang generate the Five Phases, their union forming cyclically transmuted cinnabar—hence the name *Dragon and Tiger*.\n\nHeaven has three: Sun, Moon, and stars. Earth has three: rivers, lakes, and seas. Man has three: essence, *qi*, and spirit. The elixir has three: water, earth, and metal. Thus, *Qian* and *Kun* are the upper and lower crucibles. *Kan* and *Li* are water and fire as the elixir. *Zhen* and *Xun* govern advance and retreat. Circulating for three years mirrors the natural cyclically transmuted cinnabar—once the *qi* of Heaven’s origin is sufficient, how could the elixir fail to form?\n\nThe formula states: \"Calculate three years as twelve thousand nine hundred and sixty hours, accounting for long and short months and intercalary months—though not within the prescribed limit, this is the true count.\" If even one *qi* is lacking, it differs not from worthless rubble. When the myriad phenomena attain numinosity, the divine and enlightened naturally align.\n\nDesignated as \"Golden Sand,\" it is called the Great Return. \"Return\" signifies the meaning of reverting to the root.\n\nThe formula states: The *yin* tally revolves, *qi* transforms into essence, essence into cinnabar, cinnabar into mercury, mercury into gold, and gold into the elixir. \"Elixir\" denotes the meaning of red hue. Mercury, by nature, is metal and water restraining each other, hence the name \"Golden Sand.\" Returning to the original substance, it is thus called the Great Return Elixir.\n\nAnother tradition says: the Five-*Qi* Metal Crucible. The formula states: the Five *Qi* subdue and prevent volatilization, generating the Five Colors, reverting to their mother—consuming it grants longevity. Cinnabar flows mercury as father, *wu-ji* yellow gold as mother. The mother’s number is five; five employs earth as the crucible, subduing and preventing volatilization, hence called the Metal Crucible. Earth engenders the myriad things; metal is born of earth, thus called the Metal Father. The Metal Father is fundamentally earth. Thus, earth is the father, water the mother. Earth acts as the ghost: earth suppresses water from rising—this is the achievement of *wu-ji*, named the Five Tallies. Without earth, mercury cannot be subdued. Earth flourishes in the metal phase; the three substances together resemble the Emperor. As a ruler with the Dao, the four directions come to pay tribute. Simply discern the true lead and mercury—these two substances form a single crucible method. Thus, the three substances are one household, all converging in *wu-ji*. Without earth to restrain metal and water, the elixir cannot form. Earth reigns for eighteen days each season; on remaining days, it rests or wanes. Refining the Metal Crucible requires thorough investigation of *yin-yang*; essence and *qi* return ceaselessly, like the unceasing drip of a water clock. The potent yang, likened to earth, stabilizes the four directions. Earth is the earth that generates metal; \"potent\" refers to the male, \"yellow\" to earth. Earth can restrain water; earth is the Metal Father—not the *qian* of realgar. The crucible governs external earth, named the Five Tallies.\n\nThe world does not comprehend that the Return Elixir’s root lies in father and mother, mistakenly using gold and silver as parents or crucibles. If *qi* is insufficient, it does not depart from the Five; the Five does not depart from the Six *Qi*. Though their names are conflated as one, their functions differ upon distinction. Original *qi* is the lord of the Five Materials; the *qi* of the Five Materials, with ruler and minister in attendance, cannot be abandoned. The Golden Elixir employs original *qi*, not the Five Tallies. The Five Tallies are *qi*; *qi* is formless, arising from essence, containing truth within and without—consuming it grants deathlessness and longevity.\n\nThe Metal Crucible is the outer lock of the elixir. The \"outer\" is *qi*; *qi* is the crucible. The crucible resembles a chicken’s egg: white outside, yellow within. Combined with mercury, white metal is used as the vessel. The vessel does not depart from the Five; Five is earth, the earth that generates metal. Through intricate mutual restraint, it ensures no mishap, preventing water from volatilizing—this is the achievement of *wu-ji*.\n\nThe formula states: \"Raise the sword, lay down the halberd, enshrouding the four directions.\" Raising the sword is the essence of metal, fundamentally the Five *Qi*. Laying down the halberd and spear ensures water, once obtained, does not fly—it dies in earth. The foundation of the Great Elixir is cinnabar as lead, born of earth and dying also in earth. That cinnabar’s root is earth—only those who attain the utmost Dao know this.\n\nThe formula states: Alternative names for the crucible include: External Spirit Water Flower Pond, Spirit Chamber Enclosure, Outer Lock Five *Qi*, White Robe Elixir Robe, Mother Metal Mother Abode, Five Palaces, Metal Crucible Spirit Furnace.\n\nThe formula states: Original *qi* broadly enshrouds the eight directions; in minute form, it lurks within a single hair. It exhales *Kun* and vomits the wheel, emerging from existence and entering non-existence. Flowing pearls undergo nine revolutions; the father does not speak to the son. Transformed into yellow and white, they naturally interact. One *yin*, one *yang*—this is the Dao, reverently subdued within the Metal Crucible.\n\nThe Golden Elixir is the harmonious radiance of Heaven and Earth, sun and moon’s original harmony, shining and secretly operating to form cinnabar. Within the cinnabar, spontaneously arises the Return Elixir. Like human conception of male and female, all arise from the mutual resonance of father and mother’s *yin-yang* essence and *qi*. The Return Elixir resembles males born face-down and females born face-up—not only in birth, but also in death. Simply cast into water: males sink face-down, females float face-up. Heaven ordains their nature; parents do not cause this.\n\nWithin the crucible, metal and water resemble male and female in mutual resonance: the male above, the female below, each attaining their desire. The two essences wrestle, forming the Great Dao.\n\nThe formula states: The Golden Elixir must obtain its original foundation, nurtured and subdued by its true father and mother. The father is yang *qi*; the father can emit and move to complete it. The mother is earth, yin *qi*; the mother can contain and nurture to give birth. The mother governs the Central Palace. Yellow earth is the earth that fundamentally generates metal. Cinnabar first receives *qi*, relying on earth to form—thus, it is called the root mother of the Yellow Sprout. Completed by yang, born by the mother—hence called Earth Father. The Earth Father is the Water Mother. Five is the mother of the Five Phases, perpetually generating earth. Water, fire, metal, wood, and earth each occupy a direction, moving to their proper positions. Fire overcomes metal; earth overcomes water. Water is the child of cinnabar. Earth is the crucible. Fire moves to form shape, obtaining earth to complete it. Earth can restrain water; original *qi* resonates to form the Dao. Thus, it is said: \"Know the white, guard the black.\"\n\nThe world entirely fails to understand that like attracts like, generating, restraining, and overcoming. Water takes earth as its ghost; earth suppresses water from rising—this is the achievement of *wu-ji*, named the Five Tallies Metal Crucible. Among ten thousand, perhaps one knows this.\n\nEarth tally: the essence of fire and wood. Fire can cook and mature the myriad things, nurturing human life. Fire is the essence of *jia*, the original *qi* of yang. Conjoined in harmony, it merges with the essence of sun and moon, returning to oneness without duality. The essence of *jia* is fire; fire’s number is two. Two generates three; the completion number is nine. Nine is the extreme number of yang, the *qi* of fire.\n\n\"Jia is called *zeng*; wood is called green, the agent of the myriad things. The east is the Azure Dragon of wood, the parent of wood and fire, the progeny of fire and wood. *Zhen* is the eldest son; one line generates *Kan*, producing the middle son. Two lines generate fire, born in *chen* and *si*; *Si* and *Li* form the middle daughter. Two lines generate yang, lodging in *bing* and *ding*—the position of fire. Wood gestates fire; to restrain fire, one must borrow water. These three are the Dao of true yang, the positions of *jia* and *yi*, called the Celestial Tally, the token of trust. They can release and discharge the myriad things.\n\nThe moon is the Yin Tally, capable of nurturing the myriad things. Earth is the Yin Tally, capable of fostering the myriad things. Fire is the Earth Tally, capable of ripening the myriad things. Metal and water, the primordial *qi*, together with the Yin Tally, can nurture the myriad things. The Direct Tally is like a mirror, likened to the sixty-four hexagrams of the sun and moon, where the six lines release and discharge, and the Celestial Tally completes the Metal Crucible. Ingesting it leads to transcendence—this is the virtue of *Ziming*.\n\nThe formula states: Use fire gently, without losing the seasonal nodes; the myriad things arise naturally—this is the meaning of the *River Chariot*. The efficacy lies in the fire timing; failure lies in withdrawal and addition.\n\nOne says: The *River Chariot* is the true position of the north, like a chariot’s carrying function.\nAnother says: *Zi* is metal, *he* is water, *che* is fire—hence *Ziheche* (River Chariot).\n\n**Diagram of Earth Tally Direct Hexagrams and Seasonal Nodes for Advancement and Retreat**\nThe formula states: Originally employing the four hexagrams, using the four seasonal Direct Tallies in rotation, like a chariot hub’s turning—yin and yang complete their numbers, and creation carries and conveys the myriad things. Thus, it lies in the pitch-pipes and monthly nodes, with the five and six warp and weft serving the sun’s agent. This is recorded in the *Cantong Qi* and will not be repeated here. The advancing and retreating line images are all within the Direct Tally, from one to nine—*Jinhu* (Metal Tiger) spits essence. The formula for the Direct Tally is not detailed here.\n\nThe formula states: Entrusting the yin-yang line images, the sixty-four hexagrams establish the analogy. Simply begin with the use of fire at the start, which is the eleventh month, applying the yang seasonal nodes. From the eleventh month’s *Fu* hexagram to the fourth month’s pure *Qian*, the six positions reach extreme yang. From the fifth month’s *Gou* hexagram to the tenth month’s pure *Kun*, the six positions reach extreme yin. This completes one full cycle.\n\nThe formula states: In the fifteen days before the full moon, the white moon governs fire and wood, their numbers being seven and eight. *Zhen* presides over spring; wood generates three, the completion number eight. *Li* presides over summer; fire generates two, the completion number seven. Seven and eight make fifteen.\n\nThe formula states: In the fifteen days after the full moon, the black moon governs metal and water, their numbers being nine and six. *Dui* presides over autumn; metal generates four, the completion number nine. *Kan* presides over winter; water generates one, the completion number six. Nine and six make fifteen.\n\nThe formula states: The foundation of the Five Phases: one is the north’s *ren* and *gui* water; two is the south’s *bing* and *ding* fire; three is the east’s *jia* and *yi* wood; four is the west’s *geng* and *xin* metal; five is the center’s *wu* and *ji* earth. The father is young, and the son is old. The father is *heavenly lead*; heavenly lead is cinnabar. The son, born from the father, is *black lead*—thus, the father is young, and the son is old. The son’s number is indefinite; the father’s number is twenty-five. Water, fire, metal, wood, and earth—the Five Phases shift and change. Five days make one node; five times five is twenty-five—thus, the father is twenty-five. The son’s years of ceaseless movement make the father young and the son old. The world does not know that the myriad things are generated and completed by the Five Phases—these are the parents.\n\n**Fire-Use Formula**\nThe formula states: The six lines of the Direct Tally move the hexagram nodes; the fire’s weight and measure begin from pure *Kun* and end at *Kun*, cycling without cease.\n\nThe formula states: Change the crucible each month; stop at nine crucibles. The tenth crucible may be used at will for rest or activity—whether using the crucible or not, both yield wondrous transformations, for this is the primordial *qi* of generative metal. Thus, it is called the *earth cauldron* or *mother*. The mother is the Metal Crucible.\n\nThe formula states: In the operation of metal and water, following the hexagram nodes for fifteen days, the metal nature is extinguished; in thirty days, the elixir is completed. By the tenth month, the original earth is no longer used as the crucible—mother and child part ways in the womb. The *nine revolutions* are the nine crucibles. The *tally* is the father’s function; the *crucible* is the mother’s function. It is likened to a human, who after receiving *qi*, is born in 270 days. The ninth month is when yin and yang are both abundant; the tenth month, when earth flourishes, mother and child separate—hence the name *womb-exiting returning elixir*. It is like a human, whose four *qi* are complete at birth. Just as a child is nurtured for three years until the primordial *qi* is full, the Golden Elixir is completed—this is called *Yellow Lift*. Transforming and returning to the north, the black color becomes translucent—only then is it named the *Great Returning Elixir*. The world does not know this.\n\nThe child is the medicine; the mother is the crucible. *Qi* resonates to generate and produce, restrain and subdue, alternately flourishing and declining. Ascending and descending within the crucible, flying and hiding above and below, yin and yang receive each other, intermingling and devouring. The four substances press upon one another; ruler and minister combine. Earth’s nature generates; metal’s nature dies. The four substances are yang within yin and yin within yang. Yet earth is the pivot; the Direct Tally moves—thus, the four substances each reside in their quadrant. When the four natures are extinguished, they return to oneness and revert to the origin—hence the name *Golden Elixir*.\n\nThe formula states: Guard and operate for one year, ingest one *liang*—no illness will arise. Guard and operate for two years, complete the White Way—ingest half a *liang*. Guard and operate for three years, the Great Primordial *Qi* is full, complete the Red Way—ingest one *fen*, abide in the world, and attain longevity. A *daogui* (knife-tip) controls mercury to complete the Red Way. Guard and operate for five years, ingest seven grains the size of sesame seeds—attain longevity. A *daogui* transmutes iron and mercury, one *jin* to complete the Red Way. After nine full years of guarding and operating, ingest three grains—the Three Corpses and Nine Worms all depart, and one attains ageless longevity.\"\n\nThe five metals, eight minerals, and even tiles and pebbles—all become supreme treasures.\n\nThe formula states: Use fire as indicated by the moving lines of the hexagrams; record the weight of fire with a hand-mirror, and employ them together. For example, in the eleventh month, when *Jianzi* begins, one yang line stirs—fire begins at two, completing the number seven. The movement and rotation are like a wheel: each month advances one line, until the fifth month when one yin line arises; each month then retreats one line, returning to earth by the tenth month. This cycle repeats endlessly. Cinnabar and gold move like the sun and moon, naturally forming the elixir. Since Suiren mastered fire, later sages used it to refine the elixir. The great creation of the celestial revolution depends on the clarity of the water clock; the fire must not lose its weight, and the seasonal nodes must be precise. Gradually, like steaming food, when the years and months are fulfilled, success comes naturally. If too hasty, the essence will fly away; if too slow, it will not be subdued. Simply follow the moving lines of the hexagrams, and the gold and water will naturally submit.\n\nIn the sixth month, yang expires, ending at *si*. In the twelfth month, yin expires, ending at *hai*.\n\nThe formula states: Cinnabar is the essence of the yang-black flowing pearl, establishing heaven and earth, circulating water and fire, responding to the celestial tally, and uniting the Three Powers. Gold is the essence of the moon, residing in the yang position. Mercury unites with the *li* hexagram, corresponding to the six lines. The spirit of heaven and earth, the essence of the sun and moon—when negativity reaches its limit, positivity arises. Thus it is said: Cinnabar is the essence of wood, which, when combined with metal, merges as one. This is the Way of the Three-in-One. Three is fire, one is the medicine—this is called \"guarding the One.\" It is also said: Cinnabar is the medicine, gold is the crucible. Hence it is said: The Three Ways originate from one root; the great Dao’s ultimate principle has no duality. Cinnabar is warm and harmonious, non-toxic, pungent in taste, and its primordial blackness connects with the numinous. Though refined ten thousand times, it does not wither—it is called \"black lead.\" Lead is the liquid born within cinnabar, the liquid drawn out by the upturned moon, black in color. When it enters the upturned moon and unites as husband and wife, the yang soul embraces the yin spirit, and the two natures naturally harmonize.\n\nThe formula states: Thus, employ the Five Phases—*Qian*, *Kun*, *Gen*, and *Xun*—with the moving tally nurturing and transforming. From *Jianzi*, when the first yang arises at *zi*, *zi* and *wu* correspond, five and six communicate. The water clock shifts, the sun, moon, and five stars move, cold and heat alternate, day as yang and night as yin—every thirty days they conjoin. Each node arrives in sequence; yin and yang, cold and heat, adjust and submit, circulating through the sixty-four hexagrams in endless repetition. Water and fire subdue each other, with nothing external; the five metals and eight minerals are transformed by human effort. The five metals are the Five Phases; the eight minerals are the Eight Trigrams. Water, when met with the dragon, transforms; fire, when met with man, moves. The cyclically transformed elixir is nurtured without exceeding the five and eight.\n\nThe formula states: When the moving tally first stirs, civil fire does not exceed nine, and martial fire does not exceed nine. Nine is the extreme number of yang. Three times three is nine; beyond this, the beginning of extreme yin arises. When yin is exhausted, yang is born—all follow the Dao of heaven’s yin and yang in movement. If gold and water are balanced and the seasonal nodes are in order, gold and water harmonize. If the nodes are disordered, gold and water become discordant. The movement is like a silkworm spinning its cocoon or a bird brooding its egg—receiving the blackness to activate its function. Their generation is like the transformation of a cold valley into sprouting branches, occurring at the appointed time and interacting—all are established as metaphors.\n\nThe formula states: The essence of the sun is primordial blackness, originally born in the southern *bing ding* fire, the *li* position, where one yin arises amid two yangs—this is the sun’s soul, yin mercury, water. When its blackness is full, it shifts to the northern *ren gui* water, the *kan* position, where one yang arises amid two yins—this is the moon’s spirit, yang mercury, metal. Water is still and unmoving, the substance of non-action. Fire flickers and flies, the origin of action. Uniting the formless with the formed completes the Way. Thus, it is known that metal is born in dark places, initially responding as mother and child.\n\nThe formula states: When gold enters the central palace, it is called the Great One, nurturing and containing the yellow, with blackness mixing with the blue. The White Tiger’s system follows the original blackness—hence the term *Cantong*. It is also said: *Kan* and *li* are numbered one and two, uniquely forming the warp of south and north. One is water, two is fire; all things are born through water and completed through fire. Fire and metal contend, water and earth overcome each other to form the elixir.\n\nThe formula states: When the moving tally first stirs at *zi*, it arises from *zhen*. In the fourth month, fire flourishes, and extreme yang retreats. Then, from *xun*, two woods gradually align. Though mercury is initially subdued in *qian*, it is not yet the great elixir. Guarding three nodes is called \"cinnabar\"; five nodes is called \"gold sand.\" One year is called \"inverted long sand,\" also named \"lesser return.\" Two years is called \"soul sand,\" also named \"middle return.\" Three years is called \"golden liquid great elixir\"—one who ingests it becomes an upper immortal.\n\nThe formula states: Those who fail to comprehend the profound principle of the golden elixir do not understand that cinnabar is the root of lead’s transformation. Misled by confusion, they mistakenly use common mercury, common lead, or common silver, unaware that common lead is the mother of worldly silver. Mercury is the child of the medicine, cinnabar is the mother of lead, and yellow is earth—earth is the father and ancestor of cinnabar. Unaware, they err in using common mercury, lead, or silver as crucibles or as mother and child. Some refine lead, extracting its mixed stones as medicine. From ancient times to the present, none have succeeded because they do not know the root of the Dao. The Way of immortals lies before one’s eyes. Cinnabar is the essence of wood, born through earth and extinguished through earth, never departing from the Five Phases’ mutual interaction. They become father and mother, generating and extinguishing to form shape.\n\nThe formula states: Blackness can preserve life; the inner elixir secures form, and the outer elixir grants longevity—nothing surpasses these two elixirs, inner and outer. The essence of the sun and moon is cinnabar, the primordial harmony of blackness—the root of nature and life.\n\nBeyond the essence of the inner and outer elixirs of gold, all else is not worth discussing.\n\nThe formula states: Take mercury, for instance—a solitary yin substance that corrodes flesh and scours the intestines. Gold harms the liver, silver the spleen, copper the kidneys, lead and tin the stomach. The Four Yellows are highly toxic, depleting one’s primordial qi. Any single metal or mineral, the thirty-six aqueous solutions, or the seventy-two stones—all bear great toxicity. Though they may cause no immediate harm upon ingestion, over time they inevitably bring grave injury. Even if cinnabar has peripheral methods to subdue them, it offers but minor benefit; it cannot serve as the Way of prolonged life and immortality.\n\nThe formula states: Consider common mercury and lead—their mother resides in the ore, receiving ample yang and blackness, their nature inherently subdued. When refined by fire and smoke, they become the mercury of the world. This worldly mercury resembles the mercury within cinnabar in appearance, yet they differ as man and woman. Cinnabar is like a man, an old yang, the essence of the hun-soul, preserving human life and nature. Its inherent mercury is subdued, never mingling with worldly mercury, restrained by external forces. The formula states: Worldly mercury is like a woman, the essence of the moon’s great yin, stealing human life and nature. A solitary yin with scant yang, it is toxic and must not be consumed. Thus it is said: Mercury possesses yin and yang. Though their natures and forms appear alike, they are the essence of heaven and earth, differing as man and woman. If cinnabar has peripheral methods to subdue it, then common lead may serve as the vessel to contain and refine the elixir.\n\nThe formula states: People today do not know the root of the yellow and white arts. They regard common mercury, lead, gold, and silver as supreme medicines. Yet they fail to see that mercury is born of lead, and cinnabar emerges from gold. The golden elixir borrows the root of blackness to become cinnabar—how can one abandon the root and favor the branch? Lead is the child, the essence of cinnabar. Blackness is the mother, the earth of metal’s earth—hence it is called \"root lead,\" or \"heavenly lead,\" which is cinnabar. Gold is born from lead, the child concealed within the mother’s womb. The child hides within gold, the mother concealed in the child’s embryo. Lead is the yellow sprout; the yellow sprout is cinnabar. Earth generates the sprout, hence it is called the \"yellow sprout.\" Lead is the fine matchmaker of the Seven Treasures, the sinew and bone of the Five Metals. When understood, all matters become clear; when deluded, a thousand paths are blocked. Thus lead subdues mercury, and mercury subdues lead. Lead and mercury unite to form the yellow and white. Therefore, the Dao is called the union of one yin and one yang; the elixir is called the union of one metal and one stone. Stone rides the yang and is hot; metal rides the yin and is cold. The hun and po respond to one another—this is the inevitable principle. The liquid of stone stabilizes the hun; the essence of metal stabilizes the po. Without the mutual transformation of yin and yang, even the depths of the Nine Darks would be unreliable. The noble man seeks earnestly; the virtuous woman matches fittingly. Only then is the principle proper, and the Dao resides therein.\n\nThe Classic states: The Old Woman of the River, numinous and most divine. When fire is applied, she takes flight, unseen in dust or earth. Ghosts hide, dragons conceal—none know where she abides.\n\nTo subdue it, the Yellow Sprout serves as the root. Without the Yellow Sprout, if one burns mercury alone, though the vessel be a foot thick and sealed a hundredfold, once fire is applied, it takes flight—none can halt it. In an instant, it vanishes without a trace, like ghosts concealed in darkest depths or dragons hidden in watery abodes, even the eyes of Li Lou could not perceive it. That mercury remains subdued and unmoving is the work of the Yellow Sprout.\n\nThe *Jue of the Golden Immortal* states: One liang of Yellow Sprout subdues one jin of mercury, like a child clinging to its mother, its countenance obedient, never fleeing—like a loyal minister’s devotion to his lord.\n\nThe world uses raw gold as the Yellow Sprout, yet the Yellow Sprout is also said to be the true essence of lead, refined and extracted. A song says:\n*The Yellow Sprout and lead-mercury create,*\n*Yin’s husk holds yang’s radiance.*\n\nThis does not depart from the Five Phases. Thus it is said: When the Five Phases achieve success, one who ingests them attains longevity. The Five are the earth within lead that generates gold—this earth is the true mother of lead. He who grasps the secret of the Yellow Sprout has mastered the gate of the Great Medicine.\n\nI preserve clarity in fire times, discerning advance and retreat, tireless day and night, steadfast from beginning to end, thus achieving the True One. Hence it is said:\n*Golden sand enters the five viscera,*\n*Mist scatters like wind and rain,*\n*Steam rises to the four limbs.*\n\nThus the sage conceals what is easy, not what is difficult. He who attains it attains the One.\n\nIf one forcibly seizes the Dao with a thieving heart, scorns the cultivation of the mind, and disrespects the revered teacher, filled with arrogance and self-satisfaction—even if some teachings are received, should the intent lie in personal glory, it is certain to bring harm instead. This is not that Heaven rejects them, but that their heart does not align with the Dao.\n\n**Direct Talisman Fire Method**\nOn the first day of the first period, apply one *liang* of fire for thirty hours.\nBy two and a half days, add two *liang*, totaling sixty hours.\nFrom the first line to the second line.\n\nOn the sixth day of the second period, apply three *liang* of fire for thirty hours.\nBy seven and a half days, increase to four *liang*, totaling sixty hours.\nFrom the third line to the fourth line.\n\nOn the eleventh day of the third period, apply five *liang* of fire for thirty hours.\nIncrease to six *liang*, totaling sixty hours.\nFrom the fifth line to the sixth line.\n\nOn the sixteenth day of the fourth period, still use six *liang* of fire for thirty hours.\nReduce to five *liang*, totaling sixty hours.\nFrom the sixth line to the fifth line.\n\nOn the twenty-first day of the fifth period, reduce fire to four *liang* for thirty hours.\nFurther reduce to three *liang*, totaling sixty hours.\nFrom the fourth line to the third line.\n\nOn the twenty-sixth day of the sixth period, reduce fire to two *liang* for thirty hours.\nFurther reduce to one *liang*, totaling sixty hours.\nFrom the second line to the first line.\n\nThe above six periods of the Direct Talisman, with lines advancing and retreating, follow this monthly method, cycling endlessly.\n\nProceeding to the second \"horse\" (phase), in the initial period, apply two *liang* for thirty hours.\nIncrease to three *liang*, totaling sixty hours.\nContinue incrementing as before.\n\nEach time the cauldron is changed at the start of a lunar month, add one *liang*.\nBy the ninth month’s initial period, the fire reaches nine *liang*.\nFrom one to nine, the Metal Tiger spits its essence.\nFor thirty hours, increase to fourteen *liang*, totaling sixty hours.\nAlign the Direct Talisman with the advance and retreat, strictly following the clepsydra’s markings. When applying fire, emulate the fourth month when fire flourishes in extreme yang. In its advance and retreat, yin and yang lie concealed. When changing the cauldron at the shift of punishment and virtue, it is the earth’s flourishing in the Metal region—where the Three Agents all perish, for Metal and earth are fundamentally black and mutually responsive.\n\nWhen the Direct Talisman aligns with retreat, it mirrors the fifth month when the first yin arises—\"At the ninth yang, the dragon soars too high and meets regret.\"\n\nWhen the Direct Talisman moves to the ninth cauldron, it is the initial period after the ninth month, consistently at nine *liang*.\nFor thirty hours, add one *liang*, totaling sixty hours.\nAt fourteen *liang*, it is extreme yang.\nThen retreat to nine *liang*.\nAfter completing the tenth month, regardless of years or months, always follow the ninth month’s initial period: begin at fourteen *liang*, retreat to nine *liang*, completing sixty hours.\n\nProceed in order with the Direct Talisman’s increments and reductions, clearly marking the clepsydra’s divisions. Cycle endlessly, and the movement will conclude after nine years.\n\n**Method Formula:**\nThe Direct Talisman’s fire advance and retreat: In the first month’s initial period, ignite the fire with twenty-four *liang* of fire as one line, following the twenty-four black method.\nMaintain until two and a half days, add one line, and by five days, it is one period.\nContinue incrementing the fire by lines; each month has six periods.\n\nAlways at the third period’s sixty hours and the fourth period’s first thirty hours, apply the martial fire. For the fire’s weight in *liang*, advancing and retreating day and night, add well-tempered fire, ensuring the fire’s surface remains exposed to gauge the proper weight.\n\nAfter completing nine and a half months of the Direct Talisman, consistently follow the ninth month’s fire period and line method for advancing and retreating *liang*—regardless of how many years or months pass.\n\nBegin the water drip at the *zi* hour, observing until *chou*, measuring the required water. Construct a barrel three *chi* high, one *chi* in inner diameter, and near the bottom edge, bore a small hole with a feathered tube tightly fitted inside. Seal the edges with wax, fill with water, and let it drip completely. Then refill and measure the water used in one double-hour to establish the standard for all times. Ensure day and night are clearly distinguished, matching the clepsydra’s accuracy before use.\n\nFor the Direct Talisman’s nine cauldrons, concealed advance and retreat, each month has six periods. Record the fire’s progression in the correct almanac, detailing each step as follows:\nOne line per month, proceeding in order.\nEach month has three advances and three retreats—do not disrupt the sequence.\n\n**Formula:**\nThe sage shifts and applies fire, emulating Heaven’s cyclical return.\n*The Celestial Sovereign’s Hand Mirror* states: Heaven and earth’s two blacks mutually resonate; sun and moon illuminate, forming the natural Reverted Elixir. The celestial immortals gather and refine it—this is not something worldly scholars can attain. It is the method of immortals, upholding the Great Dao. Cultivating life establishes the Direct Talisman. After three years of movement, the natural black emerges. Apply fire in accordance with the seasons, awaiting the hexagrams *Qian* and *Kun*, *Kan* and *Li*, incrementing the fire’s weight. One must receive the true teacher’s oral transmission. Without a teacher, haphazardly mixing ingredients and introducing杂乱杂, there will be no success. The sage observes Heaven and guards the One. Grasping the mutual restraint of the original father and mother ensures success—this is spiritual transformation through divine penetration.\n\n**Formula:**\nThe Direct Talisman method is likened to the eleventh month, *jianzi*, when yang *qi* begins to arise. On the summer solstice day, yin *qi* begins to arise. This is Heaven and earth’s yin and yang advancing and retreating, governing the twelve months of the year. Thus, each month has six periods. The Direct Talisman lies concealed, with the Five Phases emerging and submerging, their interactions and mutual restraints all contained within. Wood is obtained from earth and fire.\n\nIn the first fifteen days of the white moon, the three periods of extreme yang govern. After *Zhen*, yang moves and yin arises—nine-six yin water. In the latter fifteen days of the black moon, the three governing periods belong to yin, cycling endlessly. Thus, seven-eight and nine-six align with the Dao, completing thirty days.\n\nMetal and water are analogized to establish the monthly periods. Day and night, the fire lies concealed, emulating the yin and yang seasonal nodes of a year—one day and night’s fire application.\n\nThis is the grasp of Heaven and Earth, with the pivotal mechanism held in hand. It is called the method of transcending the world, profound beyond profundity. When the fire is first kindled, it is the eleventh month, when the first yang begins to sprout and take charge.\n\nThe formula states: The first crucible corresponds to the second initial period of the second month, with one line of fire. The Direct Talisman symbolizes the eleventh month, *Jianzi*, when yang and darkness govern, the *ninth yang* of \"the hidden dragon biding its time.\" One line is generated, lasting two and a half days and nights, totaling thirty hours. When it reaches two lines, five days form one period, comprising sixty hours. Traversing the eleventh month, one *chen* moves sequentially from *zi* to *hai*, encompassing twelve hours. Five cycles complete sixty hours, constituting one period.\n\nThe first period of five days marks the *Jingzhe* solar term. *Zhen* arrives to receive the talisman, and by the eighth day at the first quarter, the nature of metal waxes and wanes, half-submerged in deathly darkness. Maintaining this until the fifteenth day, the darkness extinguishes the nature of metal. By the twentieth day, what once sprouted no longer grows; yang ascends while yin recedes, water remains still, and hardness and softness interact—spontaneously forming the elixir.\n\nOn the twenty-first day, *Xun* arrives to receive the talisman. The nature of metal and water is extinguished, and darkness is exhausted. The two essences inhale and exhale in unison, dying together. *Zhen* and *Xun*, the two woods, gradually align, and mercury becomes *qian*. Yet this is not the Great Elixir.\n\nForty-five days later, one node after another drives and compels, until the sixtieth day when *mao* aligns with *Jiazhong*. Punishment and virtue contend, and day and night begin to divide—hence the name *YuJia* Elixir.\n\nThus it is said: The sun has three illuminations, the moon three shifts. When the sun and moon conjoin in darkness, all things undergo three transformations to reach their apex. Following the natural Dao of the four seasons, one month has three hundred sixty hours, symbolizing a year’s four thousand three hundred twenty hours—mirroring the natural cyclical elixir.\n\nThe formula states: The nine crucibles correspond to nine months, each crucible requiring three. For each crucible, one must maintain the reception of darkness for two hundred seventy days, when yin and yang are both abundant. In the tenth month, earth flourishes and gives birth—hence the phrase \"mother and child parting.\" The world remains unaware.\n\nWater and fire restrain each other, mutually overcoming and becoming father and mother. They do not exceed five and eight, concealing and nurturing to take form.\n\nGuard and circulate for one thousand days, when the celestial primordial darkness is complete, and the nature returns to the northern *ren* and *gui* waters—black in color, called the Great Returned Elixir.\n\nThe formula states: Take primordial black metal-water, divide it into two equal parts, and harmonize them into one body. This is likened to the moon’s upper and lower crescents, corresponding to the weight of two eights (one *jin*), aligning with yin and yang. Metal and water originate from one substance yet manifest as two forms. The black phase awaits the natural union of cinnabar and lead—yellow and white—following the principles of yin and yang, their essence undivided. Two parts are fire, one part is water. Beyond water and fire as ingredients, nothing else is added. If foreign elements intrude, the elixir will never form. Its attainment does not depend on weight. Simply ensure metal-water enters the crucible, seal it properly, and on a *four-killing* yang day at a yang hour, with the water clock’s divisions clear, when metal and water lie undifferentiated within the crucible, the direct spirit moves and transforms them—clarifying the turbid, white above and yellow below—embracing the true and holding to the One.\n\nThe formula states: Cinnabar, gold-sand, golden liquid, everlasting sand, yellow sprout, celestial lead, sand-mercury, lead-mercury, yin-yang, metal-earth-water-fire, *kan*-*li*, *qian*-*kun*, dragon-tiger, golden elixir, jade liquid, the Great Elixir of Nine Returns and Seven Reversions—all are alternate names. The ancients guarded these secrets, concealing them in myriad ways, yet for the enlightened, they converge as one without duality. The Returned Elixir has its reversion; blood-contaminated objects are forbidden. The ancients were discreet with this Way, never revealing it to those without shared purpose.\n\nFor all cultivation sites, utmost purity is essential—avoid places of death, birth, weeping, burials, graves, or impurity. Choose auspicious lands and renowned mountains, then offer sacrifices to the local earth deities and guardian spirits, maintaining morning and evening incense and lamps. Prevent all vulgar intrusions or defilement; proceed in secrecy. If in a pure and secluded place with like-minded companions—those of unblemished conduct and single-minded devotion—it may also be practiced. Strict cleanliness and protection are required.\n\nIllustrations and supplementary texts are recorded separately.\n\nIn praise:\nThe true formula of the precious elixir,\nTransmitted by celestial immortals.\nClarifying metals and minerals,\nDispelling all doubt.\nWith frugal conduct and a heart for relief,\nDevotion takes precedence.\nProfound and subtle, the mystery upon mystery—\nVast and boundless, its source unknowable.\nShould you lightly disclose it,\nYou shall forever sink into the dark springs.\n\nAuspicious days for refinement:\n*Jiazi*, *Jiachen*, *Yisi*, *Gengshen*, *Xinyou*, *Bingwu*, *Dingsi*, *Wushen*, *Jiyou*—\nthese nine days are suitable for the work.\nWhen the fire is complete, it opens the gateway to divine immortality.\nNo other days will suffice.\n\nFor the method: Seal the ground with a talisman, invoking the response of the hundred spirits. This talisman is prepared at the *zi* hour of midnight on the *jiazi* day of the winter solstice, then buried three feet deep within the elixir chamber. Thus, the hundred spirits dare not cause harm.\n\n*End of Volume One of the* Handbook of the Returned Elixir.\n*Volume Two of the* Handbook of the Returned Elixir *begins.*\n\n*The Heart-Mirror of the Golden Liquor Dragon-Tiger Returned Elixir*\n\nThe True Oral Instructions state:\nFear only that the lead be not true—\nWhen the elixir is formed, the medicine will be numinous of itself.\nFear only that the mercury be not upright—\nWhen the elixir is formed, the medicine will be sacred of itself.\n\nThe ancient immortals spoke only of the two principles, lead and mercury,\nNever of the four yellows and eight minerals.\nThose who speak of the four yellows and eight minerals are in error.\n\nThe Great Elixir employs the Five Phases,\nIs perfected through the Four Images—\nThis is the primordial qi of yin and yang,\nThe Dao of spontaneous resonance.\n\nIt is like a human receiving qi to form the embryo:\nOriginally endowed with the two qi, red and white—\nThe man’s essence is white, the woman’s blood is red.\nWhen the two qi intermingle and conjoin,\nAfter ten months the gestation is complete,\nAnd the form and features are fully manifest.\nIf the received qi is sufficient,\nThe person will be intelligent and robust.\nIf the received qi is insufficient,\nThe person will be dull-witted and weak.\nAll is of a kind.\n\nThis is a discourse of utmost truth—\nLet the student ponder it deeply.\n\nWhat, then, are the Dragon and Tiger?\nThe Dragon is mercury, wood, and fire.\nThe Tiger is lead, silver, Metal’s Elder, and water.\nMetal engenders water, water engenders wood,\nWood engenders fire, fire engenders earth—\nThe Dao abides therein.\n\nLead contains the five colors,\nMercury emits the three splendors.\nWhen these two substances are conjoined as one,\nIt is called the River Chariot.\nThe worldly, deluded by this,\nExhaust their fortunes and ruin their families.\nThe perfected, awakened to this,\nAscend upon clouds and tread upon rosy mists.\n\nThe Dao is not far—it may be seen before one’s eyes.\nBo Yang expounded the *Yi* and composed the *Cantong Qi*,\nIlluminating the wondrous workings of yin-yang, li-k’an, and the Five Phases.\nThough its matters are plain, they remain hidden;\nScholars find them hard to grasp.\nEven those who know of lead and mercury, medicinal substances,\nThe subtleties of fire-times, the crucible and furnace, and their symbolic forms,\nMust delve into their own minds.\nThe mind is the origin of the elixir.\nIf the mind does not accord with the Dao,\nEven should one encounter a perfected master and receive the oral transmission,\nHe may yet fear that Heaven’s principle and the numinous spirits will not protect him,\nAnd instead invite demonic obstructions.\nThus it is said: what is hardest to attain is the human mind.\nIf the mind harmonizes with the Dao, cultivation will surely succeed.\nFew are those of sincere heart and reverent resolve—\nIt is not that the immortals and sages keep secrets,\nBut that they do not find the right person.\nThe three chapters of Tao Hongjing remain obscure and difficult to fathom.\nThe *Jinbi* and *Cantong Qi*—without a teacher, how can they be understood?\nI have composed the *Xinjian*—*jian* means “to illumine.”\nIllumined and reflected in the mind, ever held in hand,\nIt explains the *Cantong Qi*’s symbolic images,\nDifferentiates the weights and measures of medicinal substances,\nAnd clarifies them into a mirror.\nYet I dare not expound at length,\nLest I invite the burden of endless scrutiny.\n\nThe arcane principles of the ancient immortals all return to this:\nOne yin and one yang are called the Dao;\nThat which is unfathomable in yin and yang is called the numinous.\nThe numinous transforms and gives rise to the myriad things.\nThus the *Cantong Qi* states:\n“Plant grain with grain,\nHatch a chicken with its egg.”\nLike attracts like;\nDeviate, and the treasure will not form.\nMaster Tao said:\n“Cinnabar is born of mercury,\nGold is born of lead”—\nThis is true principle.\nLike does not mix with unlike;\nMercury and quicksilver are distinct—\nThe deluded use them clumsily.\nIf lead is genuine,\nIt will not lose its ministerial essence.\nMercury lives, quicksilver dies;\nLead, when refined, becomes true yellow sprout—\nThis is the true teaching.\nThe ancient immortals spoke only of lead and mercury,\nNever of the Four Yellows or Eight Stones.\nLet scholars take this as a clear mirror.\nThus I reiterate and exhort again and again,\nYet still fear that later learners will remain mired in confusion.\nThe so-called Returned Elixir\nReturns to the original color of the primordial elixir—\nHence it is called the Returned Elixir.\nSimply master the fire-times,\nAnd do not lose the original essence of its fundamental body—\nThis is called the Returned Elixir.\nThe “nine revolutions” refer to the ninefold transformation of lead’s primordial qi;\nLead is not refined nine times to completion.\nAll divine elixirs and supreme medicines\nAre formed solely through the transformation of yin and yang’s qi,\nWithout the admixture of other substances—\nThey are purely and truly constituted.\nOne must obtain the true essence-qi of genuine lead.\nWithout recognizing true lead,\nThere can be no success in principle.\nMoreover, true lead does not change color,\nAnd true mercury possesses numinous power.\nThe words of the ancient immortals must not be left obscure.\nWhen base lead enters the fire,\nIt is reduced entirely to ashes—\nFor its true essence has been consumed and lost,\nAnd its primordial qi dissipated.\nIf one takes this spent and ruined substance\nAnd compounds it with mercury,\nHow can a supreme medicine be formed?\nThis teaching sweeps away the dust of the vulgar and ignorant,\nRevealing the true mystery.\nThose with the eye of Dao\nWill hear these words of mine\nAs one parched receives icy water,\nOr one benighted meets the bright moon.\nThey will penetrate the sacred canon,\nNo longer bewildered by numinous texts,\nAnd may join the immortals in song—\nHow could they not attain the realm of the immortals?\nThe foolish, hearing this,\nWill doubt and disbelieve—\nIt is not fitting to speak of such things with them.\n\nThe immortal scriptures say:\n“The wonder of the Returned Elixir lies in the Three-in-One.\nThe essence of Dragon and Tiger is the essence of Heaven and Earth.\nNo other medicines are used—\nOnly the Five Phases.”\nThese are the words of the perfected.\nThose who attain this afterward\nDo not betray the words of the ancient worthies,\nNor fail to grasp their symbolic forms.\nThe symbolic forms are the root of Heaven and Earth;\nWhen the root is established, the Dao arises.\nHeaven, Earth, and Humanity are the Three Powers—\nHow can one narrowly cling to the workings of creation,\nThe movement of yin and yang,\nWithout attending to the Three Essentials?\nLose it by a hair’s breadth,\nAnd Heaven and Earth become as distant as sky and abyss—\nHow can such words be spoken lightly?\nThe true oral transmission states:\n“Cinnabar is the essence of the Great Yang,\nOriginally receiving the true qi of the South,\nGoverned by the regulations of yin-yang water and fire.\nIt resides at the head of the Azure Emperor,\nAnd is called mercury—\nBorn of fire,\nIt inherently possesses virtue and reaches the numinous.\nLead is the essence of the Black Water of the North,\nTransformed and returning to the Metal of the West’s geng and xin.\nThus Metal engenders Water, Water engenders Wood—\nThese two substances naturally match each other.\nWere they not supremely numinous and sagely,\nHow could they form the divine elixir?”\nThe vulgar and common of the world\nHow could they believe in this most true Dao?\nI have long pitied them.\nSince ancient times, all true persons have refined and ingested this divine medicine,\nThus attaining wondrous union of form and spirit,\nAnd merging with the Dao in truth.\nHow could there be any who do not believe?\nMany cite the First Emperor of Qin and Emperor Wu of Han as examples.\nYet the numinous power of the Great Elixir\nCannot save one from the calamity of self-inflicted harm.\nFormerly, Liu Xuanyu served Master Wei,\nTending the furnace for a year,\nBut his idle thoughts gave rise to doubt,\nAnd he withdrew without attaining the Way,\nMeeting an early death.\nYu Jingxiu, by contrast,\nDiligently cultivated his mind and perfected his virtue,\nServing his teacher without cease,\nAnd obtained the divine elixir.\nAfter ingesting it, he became an immortal,\nAnd now dwells in the immortal cave of Mount Taibai,\nHaving passed over a thousand years,\nYet still wanders the markets of men.\nThese two—one doubted, one did not—\nThe difference between them is as vast as a foot and a thousand miles,\nBetween attainment and non-attainment,\nBetween muddy paths and cloudy skies.\nEven the Five Grains can sustain human life—\nHow much more the numinous power of the divine medicine?\nYet people of the world are shallow in blessing and karma,\nThus they do not believe, do not encounter, do not cultivate,\nLiving in vain and dying in delusion,\nSinking through countless kalpas.\nPeople of the world are only greedy for glory, fame, and profit,\nBewitched by wine and sensuality,\nEntangled in love and attachment,\nTheir forms withered and spirits lost,\nYet still they do not awaken.\nDay and night they fret and worry—\nWhen will they ever be satisfied?\nNoble and base, rich and poor—\nAll are the same.\nHearing of the cultivation of truth, they slander and revile it—\nHow then could they attain the Dao of the immortals?\nI do not wish to expound further.\n\nIn recent times, Xie Chongxuan and Su Dan—\nBoth ingested the Golden Elixir and became immortals,\nAs the world well knows.\n\nMoreover, those who attain it often mingle among common folk, blending their light with the dust—how could others recognize them?\n\nThe *Cantong Qi* states:\n*\"Gold takes cinnabar as its master,\nReceiving harmony from mercury.\nTransformation arises from its truth,\nBeginning and end naturally follow,\nThe two substances conceiving of themselves.\"*\n\nIt further says:\n*\"Do not use mere herbs—employ the Five Phases.\"*\nAnd:\n*\"Heaven engenders the sprout,\nIts body naturally formed.\"*\nAnd:\n*\"White Horse’s Teeth, true cinnabar,\nMao and You, the two eights, harmonize the two families.\"*\nAnd:\n*\"Huainan refines autumn stone,\nThe Yellow Emperor cherishes golden blossoms.\"*\nAnd:\n*\"The sprout is not lead,\nLead is not the sprout.\nTrue lead, true cinnabar—\nThese two hold the profound essence.\nRefined as one household,\nCirculating fire nears the ninth revolution,\nNaturally forming the yellow sprout.\"*\n\nIt also says:\n*\"Fire transforms to white,\nThe medicine turns to red,\nDivine cinnabar and autumn stone unite of themselves.\"*\nAnd:\n*\"Solitary yin cannot transform alone,\nLone yang cannot achieve completion.\nTheir original pure and limpid essence\nPossesses a numinous power of change.\"*\nAnd:\n*\"Dragon and tiger meet—\nWhen do they not attend each other?\nWhite liquid and the other swallow one another,\nSwallowing as husband and wife.\nFollowing change, they form the yellow sprout,\nProceeding in time to rely on the earth.\"*\nAnd:\n*\"If you comprehend the Purple River Chariot,\nYou will naturally ascend to the edge of heaven.\"*\nAnd:\n*\"Once the divine elixir’s method is mastered,\nIts spiritual use lies in your hands.\nLife and death rest in my grasp—\nDiscernment lies in distinguishing false from true.\"*\nAnd:\n*\"Without the elixir’s method,\nYears of effort waste the heart and spirit.\nDo not refine withered lead and mercury,\nLest your work scatter like dust.\"*\n\nIt further states:\n*\"Within heaven, earth, sun, and moon,\nThe numinous medicine is called Metal Lord.\nThe Metal Lord is not lead—\nIt is originally concealed within lead.\nI speak plainly to you,\nYet the deluded rush past in haste.\nMercury is fixed within lead,\nThe golden blossom’s intent is roughly the same.\nThis blossom is no mere herb—\nTo refine it is to waste effort in vain.\"*\nAnd:\n*\"This matter is spoken by immortals—\nHow could it not be profoundly clear?\nStudy the *Cantong Qi* closely,\nAnd still rely on the Five Categories’ fusion.\nSeek only true lead and mercury—\nCultivate them, and you will see results.\"*\n\nIt also says:\n*\"Lead and mercury unite heaven and earth,\nRefined to make the Great Return Elixir.\nWhen the elixir is complete, treasures appear of themselves—\nWithout this, success is truly difficult.\nThe Perfected of Great Antiquity spoke thus,\nYet even the wise of today are perplexed.\nOnly when you grasp the true and essential meaning\nCan you align with the Dao and find peace.\nWithin it lies fivefold radiance,\nSpiritual transformations subduing its vessel.\nAfter ten months, the embryo is shed—\nThose who witness it rejoice.\nI report to the seekers of glory:\nA hundred years wither and decay.\nWhy idly abandon the world,\nDull and content in the Dao’s embrace?\nThough I explain in detail, you still slander,\nThe numinous words’ principle grows ever more obscure.\nAlas! Behold the dust of north and south,\nPiled over years into mountains and hills.\nAmidst the boundless bitter sea,\nBirth and death churn like waves.\nSince ancient times, even emperors dwelled here—\nWhat is there to admire now?\"*\n\nIt further says:\n*\"The white liquid transforms within the furnace,\nThe yellow sprout gradually forms.\nRecall the first day they met—\nMercury’s form was hard to find.\nWhen yang reaches its extreme, yin fire arises,\nWhen fire declines, yang and black merge.\nNaturally, the yellow sprout changes—\nIngest it, and you attain long life.\nIn one month, the white liquid\nFirst congeals, like snow.\nIn two months, it resembles\nSoftened wax, slowly solidifying.\nIn three months, half-contained,\nThe medicine splits, dangling like flawed pearls.\nIn four months, the two substances\nEmbrace, like drops of blood.\nIn five months, it soars,\nYearning for its mother with mournful cries.\nIn six months, it arrives—\nThe yang qi of the Purple Palace is cut off.\nIn seven months, riding yin,\nIt receives blackness, hands and feet growing numb.\nIn eight months, nearing completion,\nThe viscera hold congealed blood.\nIn nine months, drop by drop,\nPearls form, hair grows long.\nIn ten months, mother and child\nPart, about to separate.\nAt this time, the mother is exhausted, the child’s body whole—\nAlready, the flesh and complexion turn white as snow.\nAfter the lead sheds its womb,\nThe lead is white as snow.\nObserve its gentle nurturing in the furnace,\nAnd the child’s entire body becomes radiant.\nExpel the child’s black poison as the method instructs.\"*\n\nThe Classic says:\n*\"This medicine is like a child in the mother’s womb,\nBright and clear, distinguishing flesh and bone,\nFollowing a sequence—do not transgress it.\nSimply know how to cultivate the yellow sprout,\nAchieving the power of transformation,\nWithout cessation.\nIngest it to attain long life,\nTurn white hair black,\nPossess silver’s whiteness,\nRelieve poverty and want.\nThe benevolent who obtain it never cease—\nTheir affinity with the Dao runs deep.\nIf you transmit it to the right person,\nIt must reside in the heart.\"*\n\nThose who lack the Dao incur profound transgressions;\nEven if obtained, calamity and misfortune will assail them.\nThe workings of creation are not easily grasped—\nDo not casually reveal them to others.\nHave you not seen the solemn oaths of the ancients?\nTo recklessly transmit this invites ancestral retribution.\nYou must believe without doubt,\nFor only the wise and enlightened may receive it.\nToday, I pledge to you with utmost sincerity—\nLet every vow be solemnly observed.\n\nWhen yang arises, yin follows;\nThe embryo’s furnace rests in the central earth of wu-ji’s crucible.\nAbove and below, they mutually converge and guard,\nFirmly preserving the subtle balance—\nNever let the breath of life escape.\nAttend closely to the seasons and signs.\nDragon and tiger race and chase,\nWhile the infant lies serene, its countenance youthful.\nAs the mother nurtures, her body grows lean while the child matures;\nWhen the mother falters, the child sustains her.\n\nYang culminates in qian, yin in kun—\nThe Four Symbols and Five Phases are the gateway of the *Yi*,\nThe sixty-four hexagrams hold the honored place within the Recluse.\nDragon and tiger devour and swallow one another,\nYet their fixed positions abide within this.\nWater and fire serve as mediators to bind my soul,\nYin and yang nurture me through dawn and dusk.\nThe eight nodes shift between cold and warmth—\nGradually, the root of the yellow sprout transforms.\nSun and moon urge one another, moved by the mother’s grace,\nThereby forming the fruit and establishing the true gate.\nFor a thousand autumns and ten thousand years, it begets descendants;\nGuard the method of concealing the spirit—speak of it with utmost care.\n\nThis Dao is subtle and profound, beyond discourse;\nThe world scorns it, lost in turbid confusion.\nDo not show the divine medicine to the unworthy,\nFor they will slander it with clamorous words.\nRemember this well—do not recklessly reveal it;\nStore it securely in a golden casket.\nThe Way of long life is transmitted to the worthy and wise—\nHeaven’s officials will record their names.\n\n**Song of Ingesting the Returned Elixir**\n\nTo ingest the returned elixir,\nPurify the heart and refine the black.\nObserve fasting, examine the self,\nPreserve the true and still the thoughts.\nThe spirit of the Controller of Fate descends to witness and record;\nThe youthful attendant of the medicine observes one’s reverence.\nDo not treat it lightly or grow lax—\nProceed with meticulous care to invoke its numinous response.\n\nAt times, the throat may feel warm and itchy,\nHot and on the verge of suffocation.\nOr the mouth may taste foul,\nAs if putrid flesh lies within.\nThis is the heart’s palace opening,\nExpelling stagnant blackness and evil.\nAll is drawn forth—\nSuch is the divine efficacy.\n\nSoothe with roasted licorice,\nHolding the liquid in the mouth and swallowing for five days.\nThe five spirits will become clear,\nAnd the true blackness will harmonize and dissolve.\n\nAt times, foul matter may lodge below the waist and navel,\nOr the abdomen may rumble and roar,\nExpelling various worms.\nOr blood clots may emerge,\nLike purple mallow juice,\nOr like toads—\nNow phlegm, now pus.\nLong-standing food stagnates in the stomach,\nCausing frequent oppression.\nThe urge to vomit arises,\nThe heart feels stifled and surging.\nOne may retch up stale water,\nUnable to take food or drink.\nAll these are old ailments—\nAssailed by the divine medicine.\n\nWhen the suffering in the flesh peaks,\nBrew a strong decoction of licorice,\nHalf a bowl in volume,\nThe broth rich in flavor.\nThe limbs may grow stiff and tense,\nOr one may feel parched and stifled.\nThe urge to rave and lose control may arise,\nOr one may fall into confusion.\nSuddenly seized by fear,\nThe spirit wanders in disarray.\nThe heart may feel unsettled,\nThe mind restless and distracted.\nOne may dream of falling\nFrom lofty mountains and towering rocks,\nOr of armies clashing,\nMen and horses locked in battle.\nOr of encountering evil men,\nEngaged in disputes and lawsuits.\nOr of meeting\nTigers, leopards, snakes, and insects.\nOr of beloved ones\nDying and parting in sorrow.\nOr of wicked men\nPursuing and seizing one.\nOr of weeping and wailing,\nWronged by enemies.\nAll these are the corpses and ghosts\nSeeking to depart the body.\nWhen such signs appear,\nTake heed and adjust accordingly.\nRegulate joy and anger,\nDo not indulge the heart’s desires.\n\nWhen the Three Corpses depart,\nFewer thoughts of self and others arise.\nMovements become pure and harmonious,\nDemeanor gentle and respectful.\nThe heart finds peace,\nWorldly attachments grow thin.\nDesires sever themselves,\nVirtue aligns with the celestial vault.\n\nAt times, the throat or forehead may ache slightly,\nSwallowing may feel stifled and rough,\nWith layer upon layer of heat and itching.\nOr the urine may appear\nBlue, yellow, or purple.\nOr one may suffer from dysentery,\nExpelling pus, blood, and dead worms.\nAll these are the winds and consumptive qi\nOf long-standing ailments.\nWhen a hundred illnesses vanish,\nThe divine efficacy becomes evident.\n\nAt times, sores or convulsions may appear,\nOr the gums may bleed.\nThis is the expulsion\nOf wind from skin and bone.\nWhen the limbs feel weary and strained,\nIt is the medicine’s power at work.\nWhen the limbs grow smooth and supple,\nIt is the medicine’s qi fusing within.\n\nAll old ailments will surface,\nAccumulations and toxins—black and foul—\nScars and blemishes, black and red.\nThese are the toxins and blackness\nClearly dispersing.\nAs the blackness steams through flesh and bone,\nThe eyes brighten and the ears sharpen.\nThe eyes open, the ears stir,\nA bloody taste lingers in the mouth.\nThe teeth are renewed,\nThe medicine’s power now ascendant.\nHair grows long,\nThe body light and strong.\nFlesh and bone become pure and harmonious,\nTransforming the mortal countenance.\n\nAfter one year of ingestion,\nA myriad blacknesses flourish.\nAfter two years,\nThe blood and vessels flow freely.\nAfter three years,\nSinews and bones grow firm and robust.\nThe marrow fills, the red sinews thrive,\nThe complexion resembles that of a child.\nBoth major and minor eliminations\nAre free of foul odors.\nThe hands and feet move lightly,\nThe intestines transform like sinew.\nUnaffected by cold or heat,\nUnscathed by blades or weapons.\nEntering water, one does not drown;\nEntering fire, one is as if in emptiness.\nTeeth that fell regrow,\nWhite hair turns black again.\nThe body seems poised to fly,\nSteps swift as the wind.\nNeither hunger nor thirst,\nThe five grains are naturally forsaken.\nNeither cold nor heat,\nOne transcends the mortal cage.\nA thousand evils and a hundred perils\nDare not approach.\nMountains and rivers, ghosts and spirits\nPay homage with reverence.\n\nIf under fifty,\nOne year of ingestion suffices.\nAt twenty-seven or twenty-eight,\nOne regains the springtime glow of youth.\nIf over fifty,\nTwo years of ingestion are needed.\nAt sixty-seven or sixty-eight,\nThe rosy complexion returns.\nEmerging beyond the nine yin,\nOne becomes a being of pure yang.\nLong life and eternal vision—\nOne’s years equal those of heaven and earth.\nShould one wish to ascend,\nA year of grain abstention will suffice.\n\nUpon completing one full dose, one gains the power to soar through the void.\nShould ascension not yet be desired, one may remain as an earthbound immortal.\nBy maintaining a day of pure fasting, the efficacy of the elixir endures.\nOne may then raise a family, dwell in the world, or hold office—\nUnrestrained in all endeavors, harmonizing with the dust of the mundane.\nWhen later wishing to ascend, a further half-dose after fasting will suffice.\nRiding clouds astride a crane, one ascends in broad daylight.\nTo transmute the five metals, all become treasure.\nA chicken fed the elixir becomes a phoenix; a dog, a dragon.\n\n**Secret Essentials of the True Teachings**\nLord Yin the True declares: Among the hundreds of methods of the Golden Elixir, the crux lies in the divine water of the Flowery Pond and the river chariot’s sublimation of mercury. Those who attain this may refine cinnabar and transmute stones—though among a thousand methods, the essence of the Great Elixir is found only in the *Book of the Golden Splendor* and the *Triplex Unity*. Simply mastering the refinement of lead and mercury to congeal the elixir is the Great Return, a perfection beyond further refinement.\n\nOne must recognize true lead and mercury—only then can cinnabar be sublimed. Without the true seed, all efforts are in vain. Seekers must diligently seek a master’s guidance, humbly inquiring without shame, to harbor even a glimmer of hope. Those who are arrogant or obstinate, clinging to a single method, will labor in vain until old age.\n\nAn ancient song says:\nWhite mercury births cinnabar,\nBlack lead transforms into the yellow sprout.\nIts end lies in nine nines,\nIts transformations in the Three Flowers.\nRefined to the Purple Yang Palace,\nEven gold has no boast left.\nBut when the Golden Duke unites,\nThe golden liquid cinnabar is achieved.\n\nBefore attaining this supreme perfection, merely congealing the elixir through fire-subduing is the supreme medicine of longevity.\n\nIt is further said: When using lead, do not let it dwell within mercury; one must reverently exhaust its essence. Only after discarding the ancestral lead may one proceed to refine and ingest the elixir—this is the subtle application, the Way of the Yellow Sprout.\n\nEven the herb Solomon’s seal can prolong life, while excessive wolfsbane inevitably kills. Are these not witnessed with one’s own eyes? Why then doubt the Way of longevity? It is only that the world’s people are shallow in fortune and blessings.\n\nThe scriptures say: When dragon and tiger unite, the Returned Elixir may be sought. The Way of immortals is not revealed to the common crowd. Thus, the wonder of the Great Elixir lies not beyond true lead, true mercury, the divine talisman, and the white snow.\n\n**Conclusion of the Middle Scroll of *The Oral Instructions for the Returned Elixir After Attainment***\n**Beginning of the Lower Scroll of *The Oral Instructions for the Returned Elixir After Attainment***\n**Profound Secrets of the Mysterious Path**\n\nFor those refining the divine elixir of golden liquid, one must thoroughly comprehend yin and yang, deeply penetrate the workings of creation, fathom the subtleties of the five phases’ mutual conquest, and grasp the wondrous principles of metal and water’s mutual generation. Gather the primordial *qi* of the precelestial to serve as the foundation of the elixir; unite heaven and earth as the crucible, using kan and li as the medicinal ingredients.\n\nKan and li are the sun and moon. The solar image contains yang within yin: within the sun is the crow, governed by the li trigram, yang without and yin within. Within cinnabar lies the *qi* of wood, the position of the Azure Dragon. The art of inverting the five phases: the dragon emerges from fire—this is the father’s essence.\n\nThe lunar image contains yin within yang: within the moon is the hare, governed by the kan trigram, yin without and yang within. Within lead lies the *qi* of metal, the position of the White Tiger. The five phases do not proceed in order: the tiger is born from water—this is the mother’s blood.\n\nThe father’s essence is true mercury; the mother’s blood is true lead. True lead is born within black lead; true mercury is produced within cinnabar. These two are true yin and true yang.\n\nTrue yin is the mercury within li; true yang is the lead within kan. Thus it is said: When the essence of the sun unites with the radiance of the moon, true lead naturally emerges into the world. If one obtains true lead, it is the ancestor of the elixir.\n\nTrue lead is the ancestor of the elixir—why trouble oneself with refining the mother of lead? Refining lead does not mean refining the lead within stones; one must draw the celestial lead from the waves.\n\nLead is the mother of the sprout; the sprout is the child of lead. If one obtains the golden flower, discard the lead and do not employ it. Each transformation gives rise to the next, one child begetting another. If one can transmute mercury, a thousand changes and ten thousand connections arise, unmatched in the world.\n\nYet many learners mistakenly employ the five metals, the eight minerals, herbs, and frost—all of which are postcelestial, substantial things, not of the same essence as mercury. Mercury is the essence of the primordial *qi*, the radiance of the sun and moon, not of the same essence as the world’s five metals, eight minerals, herbs, or frost.\n\nThus it is said: Substantial things are unfit as companions; the insubstantial generating substance is the Returned Elixir.\n\nIt is also said:\nMercury alone is the immortal’s bounty,\nSince ancient times, its fire-subduing has been difficult.\nIf it meets the river chariot and becomes purple powder,\nThe purple powder instantly transforms into the golden elixir.\n\nThe golden elixir is refined within the crucible, not from the five metals, eight minerals, or pottery clay. The crucible is the crucible of crucibles; the medicine is the medicine of medicines. Crucible and medicine are fundamentally one.\n\nThus it is said: The crucible is originally without crucible; the medicine is originally without medicine. The yellow sprout is not lead, yet it arises from within lead.\n\nFurthermore, one must not use common lead—once true lead is employed, it is then discarded. To abandon lead is like forsaking one’s parents to seek a child. If one uses lead, one is ten thousand miles from lead; if one does not use lead, from where does it arise?\n\nOnce the golden flower enters the abdomen, one still discards lead and does not employ it. Red lead and black lead are the heads of the Great Elixir; uniting red with black is true cultivation. Extracting the essence from red and the marrow from black—this is the true wondrous principle of the Returned Elixir.\n\nRed lead corresponds to the li trigram; black lead to the kan trigram. If one gathers the kan and li trigrams within the crucible, seizing a day’s fire timing to wrest a thousand years of creation—all accomplished in a moment’s work—one obtains the supreme treasure of true lead.\n\nDead mercury becomes lead; living mercury is mercury—this is their mutual subjugation.\n\nIf mixed with other medicines, it will never succeed. When mercury unites with lead, cinnabar befriends gold. Yin is mercury, yang is lead—these are the true man and true woman, the true yin and true yang.\n\nShould one take true earth as the golden crucible, nurturing geng and xin through the cold years, when the full month arrives and it departs the mother’s womb, how could the mercury fail to congeal? This elixir, refined by fire for a year and opened in the tenth month, yields purple powder turned to gold when the furnace is unsealed, and the crucible opened reveals yellow sprouts glowing with radiance. It encompasses the five colors and gathers the ten thousand spirits. Used, it transforms mercury into gold; ingested, it grants ageless life, perfecting both form and spirit, ascending as a supreme immortal.\n\n*Gazing at the Southern River* says:\nWhen the tenth month is full, open the crucible—a mass of red,\nA few flakes of dawn frost holding the five colors,\nThe womb’s divine water resounds with clarity,\nExuding a rare and fragrant aroma.\n\n*Song of Realizing the Dao*:\nWhy speak of metal, wood, water, fire, and earth?\nPreserve spirit and guard the body—these are dragon and tiger.\nScholars who fail to grasp the essence of the Five Phases\nMistakenly claim others as their parents.\nBlood resembles water, flesh resembles earth,\nQi resembles wood, bones resemble tiger.\nThe deathless Dao resides in the Li Palace;\nMaster the Five Phases, and the body has its sovereign.\nThe Five Phases are still akin to mercury,\nYet disparate substances cannot serve as companions.\nMercury is kin to the Metal Elder;\nMeeting the Metal Elder, it fails to recognize its ancestor.\nWithout the transmission of this teaching by a perfected one,\nOne toils in vain, exhausting body and spirit.\n\n*Song of the Yellow Sprout*:\nThe yellow sprout is wrought from lead and mercury,\nA yin husk cradling a yang flower.\nThe world refines it as medicine,\nMistaking lead for the yellow flower.\nThe yellow flower is a dead thing—\nHow could it reach the immortals’ realm?\nThe yellow sprout is no external medicine;\nIts inner image is the most refined essence.\nWhen one attains the yellow sprout’s domain,\nGold’s glory is but empty praise.\nIf asked what this means,\nI speak plainly to you:\nDo not mistake mixed flowers for lead—\nThe Metal Elder is too hard to discern.\nLead is the Metal Elder;\nThe Metal Elder flourishes with lead.\nScholars boast of the Metal Elder,\nYet the Metal Elder becomes clumsy.\nThe flowing pearl is the Crone’s daughter,\nMeeting fire, it naturally takes flight.\nSuddenly the Metal Elder arrives,\nAnd they cherish each other, reuniting.\nTogether they walk, together they sit,\nAll day behind closed doors.\nYet transformed by yin and yang,\nThey follow your changes at will.\nThe two natures both return to earth,\nThe three flowers’ qi no longer act.\nProceeding to the Purple Yang Palace,\nThey together become a yellow floral mantle.\nStanding in the moon, transformation comes easily;\nBy year’s end, its hue shines purple.\nWhen the yellow sprout is fully transmuted,\nFew immortals witness it.\nThis mercury is true mercury—\nHow could it revert and flee?\nIt is laughable that the Great Returned Elixir,\nThough revered in the world as subtle and wondrous,\nCannot be attained without a true teacher’s instructions—\nA thousand pieces of gold spent in vain.\n\n*Song of the Golden Elixir’s Lead and Mercury*:\nFrom ancient times to now, those who study the Dao and refine the Returned Elixir\nMistake the yellow sprout for mercury and lead.\nThey seek the supreme medicine in mercury,\nUnknowing that lotuses do not grow on level ground.\nBy nature, disparate kinds cannot resonate;\nOne must seek the root to obtain the verdant.\nThe one yin and one yang are the masters of Kan and Li,\nSun’s essence and moon’s spirit divide as dragon and tiger.\nThe world has all heard these names,\nBut who can distinguish what lies hidden within?\nLeft-rotating, coming to *mao*, one sees wood’s essence;\nFrom *xun* to *qian*, one reaches the extreme yin earth.\nCinnabar and mercury are both yin—\nTwo maidens dwelling together cannot harmonize like zither and lute.\nHard and soft, nature and temperament—how could they pair?\nSwallows and phoenixes do not share the same grove.\nGold and silver as crucibles are not of mountain or marsh—\nYet who recognizes which is which?\nFire resides in wood, water in metal;\nLead and mercury are clearly obtained thus.\nMercury is not quicksilver, lead is not black—\nSupreme Yin lies in the south, Supreme Yang in the north.\nMercury containing yang receives the metal’s fragrance,\nThen becomes cinnabar—discern the direction.\nLead dwelling in yin solidifies into metal’s body,\nOnly then can it generate mercury and manifest its whiteness.\nWithin yin is yang, water generates metal;\nWithin yang is yin, cinnabar and mercury are it.\nHeaven endows these two to unite and form,\nCalled true mercury, true lead, true water.\nMutually mother and child, they further conceive;\nCultivation requires the two arcs to balance.\nThe scriptures say the Three Vehicles originate from one;\nThe human body’s three fields likewise return to one.\nAs metal in the west, it begins in Kan;\nAs fire in the south, it also conceals Kan.\nAs wood in the east, it arises in the north—\nThe undivided state of metal and fire stems from this.\nWater as one, metal as four—these are *wu*;\nFire as two, wood as three—these are *ji*.\n*Wu* and *ji* unite at the center;\nOnly when yin and yang’s numbers are complete is beauty achieved.\nPitiable are the three, five, and one—\nYellow and white, purple light crisscrossing forth.\nThe ninety-day triumph is called the Returned Elixir;\nThus can one preserve life and halt the decay of form.\nIf the ten-month gestation is completed and the womb shed,\nSpirits submit and ghosts are startled—all affairs are finished.\nThough emerging alone to point to Penglai,\nAscending to heaven can rival the bright sun.\nDo not seek the River Chariot or Flowery Pond externally;\nThe eight stones and four yellows cannot compare.\nHow could jackals and wolves submit to the alchemical furnace?\nHow could brambles resemble the autumn of pines and cassia?\nWithin the crucible is also the name of Emptiness and Nonbeing—\nNot the world’s gold and silver, but naturally wrought.\nIf a realized person refines this crucible to completion,\nThe cinnabar clouds and purple palace are not hard to reach.\nSovereign and minister, husband and wife all correspond;\nThree people of like mind ultimately gain companions.\nAll streams ultimately flow to the vast sea;\nIn darkness, one must rely on the lamp of wisdom.\nA night of spring wind opens peach and plum,\nTreasure horses and fragrant carriages bear green jade.\nLight and fat, embroidered steeds delight in splendor—\nWho would believe the furnace holds divine water?\nThe beauty of youthful scenes cannot be detained;\nHow many can visit a hundred-year span?\nBlack hair turns to silk in an instant,\nThe rosy face of sunset is a lifetime’s end.\nHugging beauty and hoarding money, unwilling to use them—\nWang Rong drilled holes in plums, fearing others would share.\nHow does this compare to the true medicine of Huainan’s completion,\nWhere chickens and dogs followed into the immortal’s cave?\nThe world’s people all vie for the length of knives and awls,\nRefining the feminine to transmute copper into \"cinnabar yang.\"\nUnknowing the divine medicine’s power to turn back heaven,\nA single pill strides high to court the Jade Emperor.\nDo not be deluded, do not wait in vain for the obscure and indistinct—\nThe numinous elixir requires no external substances.\nMetal and water can fulfill the work of creation,\nEternally outshining the toad and crow’s alternating brightness.\nThe Mystery’s embrace of images is quite clear—\nIt is only the deluded whose hearts are dull and blank.\n\nIf one can suddenly awaken to the One True Source,\nAwakened, then cultivate in seclusion—do not grieve.\nThe Returned Elixir, the Returned Elixir, returns to the original root;\nWithout returning to the root, it is no Returned Elixir.\nPiled stones cannot withstand the surging waves,\nAccumulated waters never form a mountain.\nSeeking fish without casting a river-spanning net,\nHow can one fill a jade plate with rosy cheeks?\nI urge those who dwell in cliffs and those who hide in markets:\nDo not forsake the sweet and savor the bitter.\nThis verse fully reveals the subtle workings of the Mystery—\nOnly the firing times are left unspoken.\n\n**Song of the Joyous Pill**\nThe Joyous Pill—only heaven’s wood and earth’s metal suffice.\nLeft hand moves, right hand seeks,\nWhen both hands meet, seize the medicine.\nPlace it in the red mortar, pound at will,\nKnead it into a wish-fulfilling jewel.\nThe gathered medicine, small as a coin,\nHow does it grow as large as a fist?\nJust ponder—it’s laughable—\nPound on until the mortar roars.\nWithin the six ding spirits, seek it earnestly,\nOne red, one black—do not lose them.\nWhite as snow, finer than jade,\nLike a luminous pearl in the night.\nSeize the moment—where else would you need it?\nDo not let the medicine escape, or it loses its wonder.\nOnce formed into grains, fire them in the crucible,\nWhile firing, douse them with mercury.\nOpen the furnace—radiance bursts forth,\nReturn it to the mortar, pound again until dry and hard.\nGradually it grows, overflowing the mortar,\nPestle and mortar clash like thunder.\nFor ten months, thirty days,\nRefine it by the hexagram’s fire—naturally it matures.\nThere is a method, there is a number,\nAll must align with the celestial cycles.\nWho will concoct it? Who will consume it?\nThose who conjoin and ingest it gain heaven and earth’s blessings.\nThe wise keep it secret, fearing others may hear—\nThis medicine can preserve a thousand myriad springs.\nWhen conjoining, fear the wind most of all,\nFrom ancient times to now, the medicine remains the same.\nThe medicine is not far—it lies within people,\nYet fools wander in all directions.\nSpeak no more—quietly, silently,\nLest others know and mock.\nOnce formed into grains, observe the sun’s shadow,\nFrom ignorance to sagehood, without birth or chaos.\nPlace it in the gourd—do not pour carelessly,\nFollow the seasons and nodes to restore celestial truth.\nOne primordial breath, sixteen ounces,\nNurtured by three hundred sixty-four hexagrams.\nWhen the earth-thunder hexagram revives, respond to the yang line,\nIn moments of slack, take the medicine and cast it into your mouth.\nSend it with true water, swallow nine times,\nBeware—let no vulgar person see.\nPass the towering mansion, reach the five viscera,\nDispersing into the meridians, guarding heaven and man.\nCure existing illnesses, prevent future ones—\nWho would seize the true to mend their own life?\nFrom the first line to the six positions,\nThis medicine embodies the sun and moon’s principle.\nIt can reverse aging, restore youth,\nLife submits to the medicine’s power, not to heaven.\nWhen the medicine descends, seal the mysterious pass,\nLest the medicine’s power leak outward.\nAs the medicine’s power turns, the spirit’s radiance clears,\nThe mysterious pearl follows, transforming into a shooting star.\nSun and moon shine within, the belly hums,\nIlluminating all worldly affairs as unjust.\nFollow the monthly method—six nodes,\nEach node must be met without omission.\nWhen the foundation stirs, if the base moves, the medicine is useless.\nWhen taking this medicine, observe taboos:\nDispel vexations, dispel troubles, dispel entanglements.\nSecure the chamber, guard the empty room,\nA year’s time—your body will be like steel.\nBlack turns white, white turns red,\nWill resides in the heart, refinement in effort.\nThe Joyous Pill, white as snow,\nEasy to find in taste, hard to seek in its secret.\nWere it not for me to establish these guidelines,\nThe medicine’s essence would scatter through the eight vessels.\nThe medicine flows through the hundred meridians,\nThree years transform the inner sun and moon.\nThe Joyous Pill, no leaking pearl,\nFrom here, ascend to heaven on high.\nNurtured by the hexagrams, the Great Returned Elixir is complete—\nFather and son, ruler and minister—do not reveal it.\n\n**Song of the Golden Essence**\nTo obtain the golden essence, one must follow the work’s progression.\nThe golden crucible rests on earth,\nSeek again the original body.\nFire flies, water surges—\nDiscern floating and sinking.\nWhen the crucible’s mouth boils over,\nGather and swallow it again.\nNow the true secret is revealed—\nThis is the genuine essence.\nDo not harbor attachments,\nLest they harm your body.\nParents are the root, lead and mercury the foundation.\nThis is no filth—it returns to transform into an immortal.\nLike a child serving a father, like a minister serving a ruler,\nDepend on heaven, depend on earth—only then can man beget man.\nHow can an empty yin spirit give birth to man?\nOnly when parents give life to the body does this spirit arise.\nWhen this body decays, the spirit returns to emptiness.\nIf you obtain the golden essence,\nPreserve life and plant its root.\nAfter a thousand mornings of work, you endure for eternal eons.\n\n**Poem**\nProfound, profound—\nBefore earth, before heaven,\nIn the indistinct, it endlessly extends.\nThe ancestor of the Great Dao,\nThe source of yin and yang.\nAncient immortals transmitted this method,\nWorthy scholars fathomed its depths.\nIf learners grasp this principle,\nThey preserve their form and dwell in the world for long years.\nOnly when the golden elixir completes nine revolutions\nDo they know how to change their bones and become immortals.\n\nElixir, elixir—\nHard to comprehend, hard to speak,\nThe dragon’s marrow, the tiger’s liver,\nYin and yang’s creation,\nThe sun and moon’s two inquiries.\nTo gather the mid-autumn moon,\nWarm it after winter’s cold.\nIf ingested, one returns to the purple palace,\nAdvancing the fire relies entirely on the mechanism.\nIf later learners can follow this secret,\nTheir work completed, they will surely ride a soaring simurgh.\n\nMedicine, medicine—\nDiligently use, diligently refine,\nGrowing jade towers, birthing phoenix pavilions,\nAbove piercing the jade hare,\nBelow connecting the sun’s rays.\nGathered and placed in the crucible to refine,\nHarmonized—do not let it err.\nForging, drawing, adding,\nBathing in the process—\nAll depend on the encompassing frame.\nWhen the work’s merit fills three thousand,\nThe immortal lad summons me to the azure vault.\n\nLead, lead—\nThe true source of the watery realm,\nBorn of geng and xin, belonging to qian,\nAlways dwelling in the kan position,\nHidden in the north.\nWhen it meets the mercury of the li palace,\nRefine it into a ball of jade.\nEternally guard the divine furnace, tightly sealed,\nMaking one’s nature and life firm and enduring.\nOnly when the Jade Emperor’s decree arrives\nWill you steadily ride a simurgh and phoenix to the blue heavens.\n\nMercury, mercury—\nFools tamper with it,\nHidden in cinnabar, concealed in stone crevices,\nFollowing the flow, it becomes human;\nReversed, it serves as the elixir’s use.\nRefined with fire, it becomes an elixir;\nWithout fire, labor is in vain.\nHarmonized with lead in one place,\nFurther sent by the Yellow Dame.\n\nNine returns, seven reversions—enter the Central Palace,\nThe host of immortals commands me to mount simurgh and phoenix.\n\nFurnace, furnace—\nBorn of emptiness and nothingness,\nFit for refining and nurturing,\nHolding the Mysterious Pearl,\nAbove linked to celestial patterns, spread within the Eight Trigrams,\nBelow joined to earthly principles, encircled by the Four Images.\nCirculate fire through the celestial cycles,\nIn cultivating the elixir, never err or stray.\nOnly when the Central Palace’s qi is full\nWill the lotus bloom to distinguish the wise from the foolish.\n\nSword, sword—\nUtterly numinous, utterly efficacious,\nSoaring through the great void, racing with thunder and lightning,\nSevering the Three Peaks, cleaving the sea’s surface,\nDispelling all yin demons,\nMaking demonic spirits tremble in fear.\nAt midnight, seize the luminous pearl,\nDivine radiance appears and vanishes in turn.\nIn time, it preserves my life and grants longevity,\nBearing the blade straight to the Three Pure Ones’ palace.\n\nFire, fire—\nThe work is of utmost magnitude,\nAwaiting the proper moment, never let it slip by,\nThe mechanism for the steadfast, the calamity for the foolish.\nRefining the medicine relies on the xun wind,\nHost and guest take their respective seats.\nMorning and evening, the lines connect yin and yang,\nAdvancing and retreating, withdrawing and adding—all rest with me.\nOnly when the work is brought to completion\nWill man and woman leap free from the fetters of worldly toil.\n\nCrucible, crucible—\nHard to encounter yet easy to fathom,\nEstablished by the Mysterious Origin, named by the Yellow Emperor,\nForged through yin and yang, concealed among the common and the sage.\nVast and distant, its source is hard to trace,\nLike gazing at the sun’s reflection in water.\nIts position corresponds to geng, xin, and the kun earth,\nTreasure hidden at the Three Peaks’ summit.\nWielding the sword, cleave open the Three Clans’ gate,\nBehold the body leap forth into the true immortal realm.\nBlack metal transforms into white metal,\nWhite metal transforms into yellow metal,\nYellow metal becomes the supreme medicine—\nThus is perfection attained.\nWithin the mysterious lies the further mysterious—this is my life,\nWithin life lies yet another life—this is my form.\n\nRecorded by Tang Jian, the Perfected of Attained Numinosity\nIn the year I first knew my fate, I followed the imperial carriage on its western journey. During the Tianbao era, in the dinghai year of the eleventh month, I encountered the Elder of Qingcheng, who bestowed upon me the true elixir formula of Primordial Origin. Its meaning was beyond my full comprehension. As the imperial progress halted, my duties in the Bureau of Appointments grew burdensome. By the Zhide era of Emperor Suzong, in the dingyou year, I was granted leave to reside on Mount Song. There, I again met the Elder, who at last revealed the essentials of Divine Water and Yellow Sprout. Upon completion, I sought permission to return and pay homage at the imperial court, then petitioned to retire and return to my fields.\n\nAt that time, Zhang Qufei, Director of the Southern Bureau, and Cheng Taixu, Left Historian, both having left their official posts, jointly constructed a sacred chamber with me. We refined cinnabar in the crucible, and after a full cycle of days, the elixir’s radiance suffused my flesh. My complexion and hair grew vibrant, and I ascended the void without fear. My intent grew ever more attuned to the numinous, and the medicine’s efficacy became profound—yet others remained unaware of its power.\n\nSome say that to prolong life, one must return essence to supplement qi, regulate breath and expand the mechanism, so that in the exchange of entry and exit, the turbid is expelled and the pure retained—this is truly the internal issuing forth and external entering in. But where does essence return from, and where does it enter? Some regard exhalation and inhalation as the essence’s brilliance, yet how can this avoid the decline of the waist’s vitality? Some consider entry and exit as true qi, yet how can this avoid the labor that harms the skin?\n\nFor those in the prime of life, this is indeed the root of genuine depletion. Once the essence’s brilliance is lost, the spirit and soul scatter in four directions—how then can it be returned? Those who preserve their primal qi from youth and constantly practice movement may prolong their years, but this is merely a lower grade, lacking the effect of ascending the void. Only by externally refining the fire dragon and internally circulating the golden essence can one directly attain the rank of high perfection—this is the way of the supreme immortal.\n\nSince I first ingested the numinous elixir in the Zhide dingyou year, up to the present Qianfu jiawu year of the current emperor, I have traversed one hundred and twelve years across twelve reigns. Though my official duties and meritorious deeds were diligent, only upon regaining my youth and recovering my original state did my intent fully commune with the numinous. Compared to Zhang and Cheng, I lagged by twelve years.\n\nNow, as the Son of Heaven wanders in exile and treacherous ministers usurp power, I journey westward and once more encounter Master Zhongli, with whom I travel and lodge. Together, we transcend the Three Vehicles, yet deluded followers cling to the past and refuse to turn back—how truly lamentable! My purpose in writing is to awaken those lost on the demonic paths below and open the true realm of the celestial immortals above.\n\nRecorded on a bingzi day in the yiwei year of the Qianfu era.\n\nLü Men, the Perfected, Paints His True Likeness and Composes This Self-Eulogy\nThe Dao encompasses heaven and earth, unbounded by limits.\nShaking the eight directions, who can depict its form?\nIn a fleeting moment, the finest stroke is laid down,\nIlluminating the mortal world for a thousand ages in cinnabar and ink.\nStriding across the sea toward Penglai, it soars into the space between the brows.\nA raven etched in autumn’s hues transforms into radiant spirit.\nSuddenly, evening mist reveals the moon over plum blossoms,\nWhile a spring breeze swiftly traverses the six yang phases.\nIn semblance, only a fraction can be captured;\nIn transformation, its depths remain unfathomable.\nBrightly, one awakens to where things move the heart—\nWho on this sea of dust can tread the jade-strewn path?\n\nThus concludes the *Secret Formula for the Returned Elixir, Volume the Lower*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "还丹肘后诀 经名：还丹肘复诀。 撰人不详，约出矜唐宋问。 三卷。 上卷官外丹方诀，内容多与《通山诀》相同。 中下二卷慕集诸家丹经歌诀，兼论内外丹法。 底本出处：《正统道藏》洞神部众街类。 还丹肘后诀卷上 肘后诀者，稚川葛真人所撰。 十卷。 其九则论天下方书、草药救治之门，其一则辨金石大丹、黄芽之真，至於火候，皆晓然而书之，以垂范於将来学者，使无错误。 得此诀者，大药门中，分别其半矣。 余有口诀，苦不烦心。 是知至真用意，汲引昏迷，俾皆得成於仙矣。 后之学士，切宜详之。 诀曰：宝丹本乎一物，而生二。 二生火，寄位丙丁，生於甲乙。 初九，潜龙一阳生，建子天符，发泄惊垫，受黑於母，母者土也。 道生一，一生二，二生三。 三者阳之父母，阳者天地之精。 故名三五与一，还丹之本基也。 天符曰信，日者天地之元精，五行之始照耀。 以年计月，以月计日，以日计时，以时纪年，所以纪远近，则同异也。 混沌初分，精黑阴阳，斗建十二辰，推移运转，刻漏不停，发泄交娠，万物化生而成形。 天符者，信也。 能发泄，万物化生而成形，运动反本而成精，阳黑潜运，结化为精。 精化为砂，色禀南方丙丁火，外阳而内阴，主男、日，主阳魂，日月之华黑，昭一耀天地。 太阳太阴黑合中和，交接受黑一千八十年，结精为砂。 又天符照耀一千八十年，成形名朱砂。 汞於朱砂中生也，阳中阴，号日太阳朱雀，主水。 元和黑未足曰丹砂，又云天铅、男龙、女血。 化南作北，抽出朱，化为阴汞，主水，数一，故云汞阳为臣也。 天铅神水，天符运动，昭一耀丹砂，养育又一千八十年，天火造化，阳黑受足，而阴黑衰，阳熙盛满，流溢迥然，而自生色，禀北方壬癸水，而外阴内阳，主月之阴魄，非人问凡物，故赤石中自有生者，流为阳汞，名日天铅之精，黄芽之祖，是日月之精华，化为天然还丹，自然伏火黑色，化北成西，主金，数四，水基也。 故云三五与一，天地至精。 三者，火之父母。 五者，砂之父母。 一者，砂之元祖。 回还运转，精黑元和而相感成形，不越于一。 一者，大道之本宗，水也。 学者不知朱砂是铅，铅中生子是金也。 一物阴阳，自运转，自制伏。 阳中阴，阴中阳，玄中玄，名日玄武石。 化水成金，故日砂。 产於金阴中，为君名铅金。 天符运动，计四千三百二十年，照耀父母，养成天铅，自然还丹也。 诀日：后世圣人用火喻爻象，一月计三百六十时，一年气候计四千三百二十时，合自然还丹，名日朱砂汞，金中水。 水北火南，龙束虎西，五行合体，归一无二得五。 以地符依对节候运动，以成金丹。 诀曰：其丹砂出自中华，十二分野内二宫，西南坤地。 其宝乃天地之至精，元和之正黑，以日月天符，运动交娠在五。 五者，戊己，中宫土也。 所生之处、生於福德山冈，形势之地，气血骨肉俱金，水木咸秀，骨肉俱全者。 乃草木俱茂，土石坚贞、则异境神灵卫护，阴阳之黑施泄，包含孕育，照耀精黑，得土而生，化为丹砂。 凡有砂处，昼夜初晴之后，或阴暗之时，则有光彩，如日之出，或隐或现，惟采匠识之。 其所出之处名丹砂，亦名朱砂。 丹砂，朱铅，天铅，火铅，铅中金，神水华池，阴汞，阳汞，水银，阳中阴，阴中阳，五彩石，五金，七宝主，还丹，天生黄芽，五行之始。",
      "translated_text": "**The Elbow-Pocket Formula for Cyclically Transmuted Cinnabar**\n\n**Title of the Scripture:** *The Elbow-Pocket Formula for Cyclic Reversion of Cinnabar*\n**Author:** Unknown; roughly dated between the Tang and Song dynasties.\n**Volume:** Three.\nThe first volume records formulas and methods for external alchemy, much of which aligns with *The Cavern Mountain Formula*. The middle and lower volumes compile verses and formulas from various alchemical scriptures, discussing both internal and external alchemical methods.\n**Source of the Base Text:** *Daoist Canon of the Zhengtong Era*, *Section of the Cavernous Divine*, *Category of Miscellaneous Arts*.\n\n---\n\n### *The Elbow-Pocket Formula for Cyclically Transmuted Cinnabar, Volume One*\n\nThe *Elbow-Pocket Formula* was composed by the Perfected Master Ge of Zhichuan. Originally in ten volumes—nine of which expound upon the world’s medical texts and herbal remedies for healing—the tenth distinguishes the authenticity of metallic minerals, great elixirs, and the Yellow Sprout, clarifying the firing times with crystalline precision. It was written to serve as a model for future scholars, preventing errors. Whoever obtains this formula has already grasped half of the great elixir’s gate.\n\nI possess oral instructions, yet they are not burdensome to the mind. Thus, the utmost truth is conveyed with intent, guiding the benighted so that all may attain immortality. Later scholars must study this carefully.\n\n**The Formula states:**\nThe treasure elixir originates from the One, which generates the Two. The Two generates Fire, lodged in *bing*-*ding*, born of *jia*-*yi*. At the *ninth-initial*, the Hidden Dragon stirs as the solitary Yang arises. The *jianzi* celestial tally aligns, releasing and concealing in shock and trepidation, receiving the Black from the Mother—Mother being Earth.\n\nThe Dao generates the One, the One generates the Two, the Two generates the Three. The Three are the parents of Yang; Yang is the essence of Heaven and Earth. Thus, the Three, Five, and One form the foundation of cyclically transmuted cinnabar.\n\nThe celestial tally is called *Trust*. The Sun is the primordial essence of Heaven and Earth, the first illumination of the Five Phases. Years are reckoned by months, months by days, days by hours, and hours by years—thus measuring distance and discerning sameness and difference.\n\nWhen primordial chaos first divided, the essence and Black of Yin and Yang emerged. The Dipper’s handle marks the twelve branches, shifting and revolving without cease. The clepsydra’s drip never halts; release and intermingling give birth to the myriad things, shaping their forms.\n\nThe celestial tally is *Trust*—capable of release, enabling the myriad things to take form. Movement returns to the root, condensing into essence. The Yin Black stealthily circulates, congealing and transforming into essence. Essence transforms into cinnabar, its color endowed by the southern *bing*-*ding* Fire—externally Yang, internally Yin—ruling man, the Sun, and the Yang soul. The radiance of the Sun and Moon’s essence and Black shines as one, illuminating Heaven and Earth.\n\nThe Great Yang and Great Yin Blacks harmonize in the center, exchanging and receiving for 1,080 years, condensing essence into cinnabar. Another 1,080 years under the celestial tally’s illumination completes its form, named *Cinnabar*. Mercury is born within cinnabar—Yang within Yin—called the *Great Yang Vermilion Bird*, ruling Water.\n\nWhen the primordial harmony’s Black is insufficient, it is called *Cinnabar Sand*, also known as *Celestial Lead*, *Male Dragon*, or *Female Blood*. Transforming south into north, extracting the vermilion, it becomes Yin Mercury, ruling Water, numbered One—thus Mercury is said to be the Yang minister.\n\n*Celestial Lead* is divine water. The celestial tally’s movement illuminates cinnabar, nurturing it for another 1,080 years. Heavenly Fire’s transformation fills the Yang Black, while the Yin Black wanes. Yang flourishes to fullness, overflowing in brilliance, naturally generating color—endowed by the northern *ren*-*gui* Water, externally Yin and internally Yang—ruling the Moon’s Yin spirit. It is no common worldly substance, for within red stone, it spontaneously generates, flowing as Yang Mercury. Named the *Essence of Celestial Lead*, the *Ancestor of the Yellow Sprout*, it is the essence and radiance of the Sun and Moon, transformed into natural cyclically transmuted cinnabar. Naturally subduing Fire, its Black color shifts from north to west, ruling Metal, numbered Four—the foundation of Water.\n\nThus, the Three, Five, and One are the utmost essence of Heaven and Earth. The Three are the parents of Fire; the Five, the parents of cinnabar; the One, the primordial ancestor of cinnabar. Revolving and circulating, essence and primordial harmony interact to form shape, never straying from the One. The One is the root and origin of the Great Dao—Water.\n\nScholars fail to recognize that cinnabar is Lead, and the child born within Lead is Gold. A single entity of Yin and Yang self-circulates, self-regulates. Yang within Yin, Yin within Yang, Mystery within Mystery—called the *Mysterious Warrior Stone*. Transforming Water into Gold, it is thus named *Cinnabar*. Born within the Yin of Metal, it is the sovereign, named *Lead-Gold*.\n\nThe celestial tally’s movement, over 4,320 years, illuminates its parents, nurturing *Celestial Lead* into natural cyclically transmuted cinnabar.\n\n**The Formula states:**\nLater sages used Fire to illustrate the hexagrams. A month comprises 360 hours; a year’s climatic phases total 4,320 hours—matching the natural cyclically transmuted cinnabar, named *Cinnabar Mercury*, the Water within Gold. Water to the north, Fire to the south; Dragon to the east, Tiger to the west. The Five Phases unite in one body, returning to the undivided Five. By aligning with the earthly tally and adhering to the seasonal nodes’ movement, the Golden Elixir is achieved.\n\n**The Formula states:**\nThis cinnabar emerges within the Central Hua, in the twelfth terrestrial division’s second palace—the southwest *kun* region. This treasure is the utmost essence of Heaven and Earth, the correct Black of primordial harmony. Through the Sun, Moon, and celestial tally’s movement, intermingling occurs in the Five. The Five are *wu*-*ji*, the central palace’s Earth.\n\nThe places where it is born—auspicious mountains and ridges, lands of favorable terrain—possess the Qi, Blood, Bones, and Flesh of Metal, with Water and Wood both flourishing. Where bones and flesh are complete, grasses and trees thrive, soil and stone are firm and steadfast—such extraordinary realms are guarded by divine spirits. The Yin and Yang Blacks release and nurture, containing and gestating, illuminating essence and Black. Born of Earth, it transforms into cinnabar.\n\nWherever cinnabar is found, after the first clear dawn or in dim light, radiance appears like the rising Sun—now hidden, now visible—discernible only to skilled miners. The places where it emerges are called *Cinnabar*, also named *Vermilion Sand*.\n\n*Cinnabar*, *Vermilion Lead*, *Celestial Lead*, *Fire Lead*, *Gold within Lead*, *Divine Water Flower Pool*, *Yin Mercury*, *Yang Mercury*, *Quicksilver*, *Yang within Yin*, *Yin within Yang*, *Five-Colored Stone*, *Five Metals*, *Lord of the Seven Treasures*, *Cyclically Transmuted Cinnabar*, *Heaven-Born Yellow Sprout*—the origin of the Five Phases.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1274,
      "start_sentence": 0,
      "end_sentence": 55,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.33653664588928,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\还丹肘后诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "其地名桂府、辰锦、衡丘、句漏、云梦、都山、梆永、全道，潭岳等管处，岩石穴洞，形势滋茂之处，即有新旧坑穴，皆有不定丹砂，光明镜面，如莲花芙蓉，鲜红透彻，并为上品。 其次中下，不及枚举，亦可取汞制伏别甩，不作上丹大药也。 上品丹砂，如人主登位，百僚奉上。 中者如名臣，下者如庶、人。 但可指使，无自专之才。 天符者，日也。 阳之精魂，天之理也，照耀光明。 《 淮南》 曰：聚阳之黑为火，火之精为日，光咀纯晶，日之义也。 又云：日生於甲，重阳之位。 火生於震，震为长男，巽为长女，火之父母。 火曰曾，木日青，万物之使，故云曾青。 言月者阴之精魄，地之理也，耀光明。 《 淮南》 曰：聚阴之寒黑，腾为水，水之精为月，满之而缺，月之义也。 又云：月生於庚，重阴之位。 水生於兑，兑为少女，坎为中男，水之父母。 所以男依日出束，女象月升西。 故经云：丹砂者，日月之精华，性命之根基，与内外元和，般载成形，饵之长生不死，日月之感精。 故曰：月之所生，日之所育也。 生成依於母，母者土也。 是日月二宝，天地至精。 甲庚感精变化，昭一耀成形，结而为砂，始名朱雀，乃七十二石中最尊，莫过於汞。 感於二十四黑，通於二十四名，鸡餐成凤，蛇吞化龙，人食长生，天地寿同，敛魂聚魄，返老为童，呼吸风云，玉女来从，此大还丹之力也。 诀曰：红铅者，丹砂也。 砂中抽出之液，主水，阳中阴汞也。 从砂中自出者，主阴，金中阳汞也。 是以不容之木，受制於金，金孕水，安水必存。 金木孕火，制火必假水，所以铅水制汞水，铅火制汞火。 木含其性，火合其形也。 诀曰：铅水者，是砂中自生出者，为阳汞也。 汞水也，砂中抽出之液，乃阴汞是也。 故云：铅水制汞水。 又云：铅火者，自生之金。 汞火者，抽出之掖也。 且铅火制汞火，世人多不晓此义，故曰铅汞道也。 日者，太阳之火精，则汞木为龙是也。 月者，太阴之水精，则铅金为虎是也。 龙者，阳黑，九之极数，木之精黑也。 虎者，阴黑，四之极数，金之精黑也。 诀曰：以无制有，合成其道。 故云：丹砂木精，得金乃并，分铢不偏，至圣至灵。 世之不悟，见金如土也。 药日太玄。 阴符之道生阴阳，阴阳生五行，合之为还丹，故名龙虎。 天有三，日月星。 地有三，江河海。 人有三，精黑神。 药有三，水土金。 故乾坤，上下釜也。 坎离者，水火为药也。 震巽者，进退也。 运经三年，象自然还丹，即天元之黑足，岂不成丹者哉。 诀曰：计三年一万二千九百六十时，大小月并闰月也、并不在用限，归其实数也。 一黑不足，与瓦砾无殊。 万象通灵，神明自契。",
      "translated_text": "The regions known as *Guifu*, *Chenjin*, *Hengqiu*, *Joulou*, *Yunmeng*, *Dushan*, *Bangyong*, *Quandao*, *Tanyue*, and their governed lands—where cliffs, rocky caverns, and lush terrain abound—host both new and ancient mines. Within these, cinnabar of varying grades appears, its luminous surface smooth as a mirror, resembling lotus blossoms or hibiscus, vibrant red and translucent, all deemed top-tier. The middle and lower grades, too numerous to list, may still yield mercury for refinement and other uses, though they are unfit for the supreme elixir of great alchemy.\n\nTop-grade cinnabar is like a sovereign ascending the throne, with all officials in attendance. The middle grade resembles a renowned minister, while the lower grade is akin to common folk—serviceable, yet lacking independent mastery.\n\nThe celestial tally is the Sun, the essence and spirit of Yang, the principle of Heaven, radiating brilliance. *Huainanzi* states: \"The gathering of Yang’s *qi* forms fire; the essence of fire is the Sun, whose pure, crystalline light embodies its meaning.\" It further says: \"The Sun is born of *jia*, the position of double Yang. Fire arises from *zhen*, *zhen* being the eldest son, *xun* the eldest daughter—the parents of fire.\" Fire is called *zeng*, wood *qing*; all things are governed by them, hence the term *zengqing*.\n\nThe Moon is the essence and soul of Yin, the principle of Earth, casting its glow. *Huainanzi* says: \"The gathering of Yin’s cold *qi* ascends as water; the essence of water is the Moon, waxing and waning to fulfill its nature.\" It further states: \"The Moon is born of *geng*, the position of double Yin. Water arises from *dui*, *dui* being the youngest daughter, *kan* the middle son—the parents of water.\" Thus, man aligns with the Sun’s rise in the east, while woman mirrors the Moon’s ascent in the west.\n\nThe scriptures declare: \"Cinnabar is the essence of the Sun and Moon, the root of life and destiny, harmonizing inner and outer primal *qi*. It bears and shapes form, and when ingested, grants immortality—the mutual resonance of Sun and Moon.\" Hence it is said: \"The Moon’s birth and the Sun’s nurturance depend on the mother, who is Earth.\" These two treasures, Sun and Moon, are the purest essences of Heaven and Earth. The union of *jia* and *geng* transforms and refines, their radiance coalescing into form, crystallizing as cinnabar—first named *Vermilion Phoenix*, the most revered among the seventy-two stones, none surpassing mercury.\n\nResonating with the twenty-four *qi*, manifesting in twenty-four names, a chicken fed upon it becomes a phoenix, a serpent that swallows it transforms into a dragon, and one who consumes it attains longevity, their lifespan equaling Heaven and Earth. It gathers the hun and po, reverses aging to youth, commands the winds and clouds, and summons jade maidens—such is the power of the great cyclically transmuted cinnabar.\n\nThe formula states: \"Red lead is cinnabar. The liquid drawn from cinnabar governs water—*yang*-within-*yin* mercury. That which emerges naturally from cinnabar governs *yin*—*yang*-within-metal mercury.\" Thus, the wood that cannot be contained is restrained by metal; metal nurtures water, and water’s stability depends on its presence. Metal and wood nurture fire, and fire’s control relies on water. Therefore, lead-water restrains mercury-water, and lead-fire restrains mercury-fire. Wood embodies its nature, while fire unites its form.\n\nThe formula states: \"Lead-water is the mercury that naturally arises from cinnabar—*yang* mercury. Mercury-water is the liquid extracted from cinnabar—*yin* mercury.\" Hence it is said: \"Lead-water restrains mercury-water.\" It further says: \"Lead-fire is the metal that arises naturally. Mercury-fire is the liquid drawn out.\" Yet lead-fire restraining mercury-fire is a principle many fail to grasp, thus it is called the Dao of lead and mercury.\n\nThe Sun is the fiery essence of Great Yang—mercury-wood as the dragon. The Moon is the watery essence of Great Yin—lead-metal as the tiger. The dragon is Yang *qi*, the utmost of the number nine, the essence of wood. The tiger is Yin *qi*, the utmost of the number four, the essence of metal.\n\nThe formula states: \"Use non-being to restrain being, and the Dao is complete.\" Thus it is said: \"Cinnabar, the essence of wood, unites with metal without the slightest deviation—most sacred, most numinous.\" Yet the world, failing to comprehend, sees gold as mere earth.\n\nThe elixir is called *Tai Xuan*. The Dao of the *Yin Fu* generates Yin and Yang; Yin and Yang generate the Five Phases, their union forming cyclically transmuted cinnabar—hence the name *Dragon and Tiger*.\n\nHeaven has three: Sun, Moon, and stars. Earth has three: rivers, lakes, and seas. Man has three: essence, *qi*, and spirit. The elixir has three: water, earth, and metal. Thus, *Qian* and *Kun* are the upper and lower crucibles. *Kan* and *Li* are water and fire as the elixir. *Zhen* and *Xun* govern advance and retreat. Circulating for three years mirrors the natural cyclically transmuted cinnabar—once the *qi* of Heaven’s origin is sufficient, how could the elixir fail to form?\n\nThe formula states: \"Calculate three years as twelve thousand nine hundred and sixty hours, accounting for long and short months and intercalary months—though not within the prescribed limit, this is the true count.\" If even one *qi* is lacking, it differs not from worthless rubble. When the myriad phenomena attain numinosity, the divine and enlightened naturally align.",
      "overlap_context": "g Sun—now hidden, now visible—discernible only to skilled miners. The places where it emerges are called *Cinnabar*, also named *Vermilion Sand*.\n\n*Cinnabar*, *Vermilion Lead*, *Celestial Lead*, *Fire Lead*, *Gold within Lead*, *Divine Water Flower Pool*, *Yin Mercury*, *Yang Mercury*, *Quicksilver*, *Yang within Yin*, *Yin within Yang*, *Five-Colored Stone*, *Five Metals*, *Lord of the Seven Treasures*, *Cyclically Transmuted Cinnabar*, *Heaven-Born Yellow Sprout*—the origin of the Five Phases.",
      "start_char": 1274,
      "end_char": 2299,
      "start_sentence": 56,
      "end_sentence": 109,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.70901131629944,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\还丹肘后诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "号云金砂，名曰大还。 还者，返本之义也。 诀曰：阴符运转，黑化为精，精化为朱，朱化为汞，汞化为金，金化为药。 丹者，赤色之义。 汞者，本体金水相制，故号金砂。 还归本体，故号大还丹也。 一云：五黑金鼎也。 诀曰：五黑制伏不飞，能生五彩，返归其母，服之长生。 丹砂流汞父，戊己黄金母，母数五，五者是用土为鼎，制伏不飞，号曰金鼎。 土能生万物，金是土生，故云金父。 金父者，本土。 故日土父，日母水。 以土为鬼，土镇水不起，戊己之功也，名日五符。 汞者非土不可制伏，土旺金乡，三物俱之象帝。 如人主之有道，则四方来贡。 但辨得真，铅汞二物，是一鼎法。 故三物一家，都归戊己。 金水无土制御不成丹。 土每一季王十八日，余日休囚。 伏炼金鼎，惟究阴阳，精黑返还，刻漏不停。 雄阳喻土而定四维。 土者，是生金之土，雄者是男，黄者是土。 土能制水，土是金父，非干雄黄也。 鼎主外土，名五符也。 世人不悟还丹本父母，错用金银为父母，或为鼎。 故黑不足者，不离於五，五不离於六黑。 混其名即一，辨其功即殊。 元黑五材之君，五材之黑，君臣相临，而不可去也。 金丹用元黑，不曰五符。 五符者黑，黑者无形，因精而生，内外含真，得服者不死长生。 金鼎者，药之表辖。 表者黑，黑者鼎也。 鼎象鸡子，外白而内黄也。 与汞合，是用白金为器。 器者不离於五，五者土，土者生金之土，委曲相制，以使无虞，令水不飞，戊己之功也。 诀曰：提剑偃戈，笼罩四方。 提剑是金精，本黑五也。 偃戈戟，其如水得而不飞，是死於土也。 大丹之基，丹砂是铅，本生於土，死亦依於土也。 是丹砂本土，达於至道者知之。 诀曰：鼎之异名，外神水华池，神室匡廓，表辖五黑，白衣丹衣，母金母舍，五宫，金鼎神炉。 诀曰：元黑者，其大笼罩八隅，小则潜藏一毫。 吐坤呕轮，出有入无，流珠九转，父不语子，化为黄白，自然相使，一阴一阳曰道，钦伏於金鼎也。 金丹者，天地日月元和之熙，照耀潜运，而成丹砂。 砂中乃迥然而生自然还丹也。 如人孕育男女，皆由父母阴阳精气，相感而有。 还丹者，象男生而覆，女生而仰，非但生也，死亦如之。 但投於水，雄者覆而雌者仰，天使其性，非父母使然。 金水在鼎中，象男女相感，男上而女下，自得其情，两精相搏，以成大道。 诀曰：金丹须得元基，须得本父母养育制伏。 父者，阳黑也。 父能发泄，运动而成之。 母者，土，阴黑也。 母能含育而生之。 母主中宫。 黄土者，是本生金之土也。 丹砂初受黑，依土而生成，故云黄芽之本母也。 得阳而成，得母而生，故云土父。 土父日水母。 五者，五行之母，生生而土也。 水火金木土，各居一方，而运动正位。 火克金，土克水，水乃丹砂之子。 土者鼎也。 火者，运动而成形，得土而生成。 土能制水，本黑相感，而成道。 故云：知白守黑。 世人尽不知同类相从相生，相制相克。 水以土为鬼，土镇水不起，戊己之功，名曰五符金鼎，知之者万中一焉。 地符，火木之精，火能炊熟万物，以育人命。 火者，甲之精，阳之元黑，结妮交会，而同日月之精，归一无二。 甲之精火，火数二，二生三，成数九，九者阳之极数，火黑也。",
      "translated_text": "Designated as \"Golden Sand,\" it is called the Great Return. \"Return\" signifies the meaning of reverting to the root.\n\nThe formula states: The *yin* tally revolves, *qi* transforms into essence, essence into cinnabar, cinnabar into mercury, mercury into gold, and gold into the elixir. \"Elixir\" denotes the meaning of red hue. Mercury, by nature, is metal and water restraining each other, hence the name \"Golden Sand.\" Returning to the original substance, it is thus called the Great Return Elixir.\n\nAnother tradition says: the Five-*Qi* Metal Crucible. The formula states: the Five *Qi* subdue and prevent volatilization, generating the Five Colors, reverting to their mother—consuming it grants longevity. Cinnabar flows mercury as father, *wu-ji* yellow gold as mother. The mother’s number is five; five employs earth as the crucible, subduing and preventing volatilization, hence called the Metal Crucible. Earth engenders the myriad things; metal is born of earth, thus called the Metal Father. The Metal Father is fundamentally earth. Thus, earth is the father, water the mother. Earth acts as the ghost: earth suppresses water from rising—this is the achievement of *wu-ji*, named the Five Tallies. Without earth, mercury cannot be subdued. Earth flourishes in the metal phase; the three substances together resemble the Emperor. As a ruler with the Dao, the four directions come to pay tribute. Simply discern the true lead and mercury—these two substances form a single crucible method. Thus, the three substances are one household, all converging in *wu-ji*. Without earth to restrain metal and water, the elixir cannot form. Earth reigns for eighteen days each season; on remaining days, it rests or wanes. Refining the Metal Crucible requires thorough investigation of *yin-yang*; essence and *qi* return ceaselessly, like the unceasing drip of a water clock. The potent yang, likened to earth, stabilizes the four directions. Earth is the earth that generates metal; \"potent\" refers to the male, \"yellow\" to earth. Earth can restrain water; earth is the Metal Father—not the *qian* of realgar. The crucible governs external earth, named the Five Tallies.\n\nThe world does not comprehend that the Return Elixir’s root lies in father and mother, mistakenly using gold and silver as parents or crucibles. If *qi* is insufficient, it does not depart from the Five; the Five does not depart from the Six *Qi*. Though their names are conflated as one, their functions differ upon distinction. Original *qi* is the lord of the Five Materials; the *qi* of the Five Materials, with ruler and minister in attendance, cannot be abandoned. The Golden Elixir employs original *qi*, not the Five Tallies. The Five Tallies are *qi*; *qi* is formless, arising from essence, containing truth within and without—consuming it grants deathlessness and longevity.\n\nThe Metal Crucible is the outer lock of the elixir. The \"outer\" is *qi*; *qi* is the crucible. The crucible resembles a chicken’s egg: white outside, yellow within. Combined with mercury, white metal is used as the vessel. The vessel does not depart from the Five; Five is earth, the earth that generates metal. Through intricate mutual restraint, it ensures no mishap, preventing water from volatilizing—this is the achievement of *wu-ji*.\n\nThe formula states: \"Raise the sword, lay down the halberd, enshrouding the four directions.\" Raising the sword is the essence of metal, fundamentally the Five *Qi*. Laying down the halberd and spear ensures water, once obtained, does not fly—it dies in earth. The foundation of the Great Elixir is cinnabar as lead, born of earth and dying also in earth. That cinnabar’s root is earth—only those who attain the utmost Dao know this.\n\nThe formula states: Alternative names for the crucible include: External Spirit Water Flower Pond, Spirit Chamber Enclosure, Outer Lock Five *Qi*, White Robe Elixir Robe, Mother Metal Mother Abode, Five Palaces, Metal Crucible Spirit Furnace.\n\nThe formula states: Original *qi* broadly enshrouds the eight directions; in minute form, it lurks within a single hair. It exhales *Kun* and vomits the wheel, emerging from existence and entering non-existence. Flowing pearls undergo nine revolutions; the father does not speak to the son. Transformed into yellow and white, they naturally interact. One *yin*, one *yang*—this is the Dao, reverently subdued within the Metal Crucible.\n\nThe Golden Elixir is the harmonious radiance of Heaven and Earth, sun and moon’s original harmony, shining and secretly operating to form cinnabar. Within the cinnabar, spontaneously arises the Return Elixir. Like human conception of male and female, all arise from the mutual resonance of father and mother’s *yin-yang* essence and *qi*. The Return Elixir resembles males born face-down and females born face-up—not only in birth, but also in death. Simply cast into water: males sink face-down, females float face-up. Heaven ordains their nature; parents do not cause this.\n\nWithin the crucible, metal and water resemble male and female in mutual resonance: the male above, the female below, each attaining their desire. The two essences wrestle, forming the Great Dao.\n\nThe formula states: The Golden Elixir must obtain its original foundation, nurtured and subdued by its true father and mother. The father is yang *qi*; the father can emit and move to complete it. The mother is earth, yin *qi*; the mother can contain and nurture to give birth. The mother governs the Central Palace. Yellow earth is the earth that fundamentally generates metal. Cinnabar first receives *qi*, relying on earth to form—thus, it is called the root mother of the Yellow Sprout. Completed by yang, born by the mother—hence called Earth Father. The Earth Father is the Water Mother. Five is the mother of the Five Phases, perpetually generating earth. Water, fire, metal, wood, and earth each occupy a direction, moving to their proper positions. Fire overcomes metal; earth overcomes water. Water is the child of cinnabar. Earth is the crucible. Fire moves to form shape, obtaining earth to complete it. Earth can restrain water; original *qi* resonates to form the Dao. Thus, it is said: \"Know the white, guard the black.\"\n\nThe world entirely fails to understand that like attracts like, generating, restraining, and overcoming. Water takes earth as its ghost; earth suppresses water from rising—this is the achievement of *wu-ji*, named the Five Tallies Metal Crucible. Among ten thousand, perhaps one knows this.\n\nEarth tally: the essence of fire and wood. Fire can cook and mature the myriad things, nurturing human life. Fire is the essence of *jia*, the original *qi* of yang. Conjoined in harmony, it merges with the essence of sun and moon, returning to oneness without duality. The essence of *jia* is fire; fire’s number is two. Two generates three; the completion number is nine. Nine is the extreme number of yang, the *qi* of fire.",
      "overlap_context": " the natural cyclically transmuted cinnabar—once the *qi* of Heaven’s origin is sufficient, how could the elixir fail to form?\n\nThe formula states: \"Calculate three years as twelve thousand nine hundred and sixty hours, accounting for long and short months and intercalary months—though not within the prescribed limit, this is the true count.\" If even one *qi* is lacking, it differs not from worthless rubble. When the myriad phenomena attain numinosity, the divine and enlightened naturally align.",
      "start_char": 2299,
      "end_char": 3530,
      "start_sentence": 110,
      "end_sentence": 180,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.52988004684448,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\还丹肘后诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "甲曰曾，木曰青，万物之使也。 束方青龙木，木火之父母，火木之子孙。 震为长男，一爻生坎，而生中男。 二爻生火，生於辰巳，巳离为中女。 二爻生阳，寄位丙丁，火寄位也。 木孕火，制火必假水。 三者正阳之道，甲乙之位，曰天符，信也。 能发泄万物。 月，阴符，能生育万物。 土，阴符，能生长万物。 火，地符，能成熟万物。 金水元黑，并同阴符，能生育万物。 直符乎镜，喻日月六十四卦，六爻发泄，天符以成金鼎。 服之而仙，子明之德也。 诀曰：用火微微，不失节候，万物自然，河车之义。 功用在火候，失在抽添。 一云：河车，北方正位，如车般载之义。 一云：子是金，河是水，车是火，故曰子河车。 地符直卦节候进退之图 诀曰：本用四卦法，用四时直符循环，一如车毂运转，阴阳成数，造化载运万物。 故在於律纪月节，有五六经纬奉日使。 载在《参同契》内，不再录。 进退爻象，并在内直符，从一至九，金虎吐精，用诀直符，不在於此。 诀曰：托附阴阳爻象，六十四卦立喻也。 但以用火起首之初，便是十一月，受阳节候用之。 自十一月复卦，至四月纯乾，六位极阳。 自五月娠卦，至十月纯坤，六位极阴。 乃一周黑足。 诀曰：月前十五日，白月火木用事。 其数七八也。 震主春，木生三，成数八。 离主夏，火生二，成数七。 七八十五也。 诀曰：月后十五日，黑月金水用事，其数九六也。 兑主秋，金生四，成数九。 坎主冬，水生一，成数六。 九六十五也。 诀曰：五行之基，一者北方壬癸水，二者南方丙丁火，三者束方甲乙木，四者西方庚辛金，五者中央戊己土，父少而子老。 父者，天铅也。 天铅者，朱砂也。 子者从父而生金，黑铅也，故父少而子老。 子数不定，父数二十五也。 水火金木土，五行移易。 五日一候，五五二十五，故知父二十五。 子年般运动不停，故父少而子老。 举世不知，万物从五行而生成者，父母也。 用火诀曰：六爻直符，运动卦候，用火斤两，从纯坤起，终於坤，周而复始。 诀曰：一月换鼎，九鼎即止。 第十鼎任意游息，用鼎不用，并得用之转妙，绿是生金之本元黑也。 故曰土釜，曰母。 母者，金鼎也。 诀曰：其金水运用，依卦节候十五日，金性已灭，三十日丹成。 至十月，不用本土为鼎，子母脱胎。 九转者，九鼎也。 符者，父之用事。 鼎者，母之用事。 象人受黑后二百七十日而生。 九月是阴阳俱盛，十月土旺俱生，子母俱分，故名脱胎还丹。 象人四气足而生。 亦如小儿，三年养育而元黑足，而成金丹，乃日黄举。 变得却归北方，黑色通透，始得名为大还丹。 世人莫知之矣。 子是药，母是鼎，感黑相生相产，相制相伏，迭盛迭衰，升降在鼎，飞伏上下，阴阳相受，交会吞食，四物相薄，君臣相加，土性生，金性死。 四物者，阳中阴，阴中阳。 但本土为枢辖，直符运动，故有四物，各居一方。 四物性灭，归一返本，故名金丹也。 诀曰：守运一年，服之一两，凡疾不生。 守运二年，成白道，可服半两。 守运三年，太元黑足，成赤道，可服一分，住世长生，刀圭制汞成赤道。 守运五年，七粒麻子大，服之长生，刀圭点铁并汞一斤成赤道。 守运九年足，服三粒，三尸九虫并去，长生不老。",
      "translated_text": "\"Jia is called *zeng*; wood is called green, the agent of the myriad things. The east is the Azure Dragon of wood, the parent of wood and fire, the progeny of fire and wood. *Zhen* is the eldest son; one line generates *Kan*, producing the middle son. Two lines generate fire, born in *chen* and *si*; *Si* and *Li* form the middle daughter. Two lines generate yang, lodging in *bing* and *ding*—the position of fire. Wood gestates fire; to restrain fire, one must borrow water. These three are the Dao of true yang, the positions of *jia* and *yi*, called the Celestial Tally, the token of trust. They can release and discharge the myriad things.\n\nThe moon is the Yin Tally, capable of nurturing the myriad things. Earth is the Yin Tally, capable of fostering the myriad things. Fire is the Earth Tally, capable of ripening the myriad things. Metal and water, the primordial *qi*, together with the Yin Tally, can nurture the myriad things. The Direct Tally is like a mirror, likened to the sixty-four hexagrams of the sun and moon, where the six lines release and discharge, and the Celestial Tally completes the Metal Crucible. Ingesting it leads to transcendence—this is the virtue of *Ziming*.\n\nThe formula states: Use fire gently, without losing the seasonal nodes; the myriad things arise naturally—this is the meaning of the *River Chariot*. The efficacy lies in the fire timing; failure lies in withdrawal and addition.\n\nOne says: The *River Chariot* is the true position of the north, like a chariot’s carrying function.\nAnother says: *Zi* is metal, *he* is water, *che* is fire—hence *Ziheche* (River Chariot).\n\n**Diagram of Earth Tally Direct Hexagrams and Seasonal Nodes for Advancement and Retreat**\nThe formula states: Originally employing the four hexagrams, using the four seasonal Direct Tallies in rotation, like a chariot hub’s turning—yin and yang complete their numbers, and creation carries and conveys the myriad things. Thus, it lies in the pitch-pipes and monthly nodes, with the five and six warp and weft serving the sun’s agent. This is recorded in the *Cantong Qi* and will not be repeated here. The advancing and retreating line images are all within the Direct Tally, from one to nine—*Jinhu* (Metal Tiger) spits essence. The formula for the Direct Tally is not detailed here.\n\nThe formula states: Entrusting the yin-yang line images, the sixty-four hexagrams establish the analogy. Simply begin with the use of fire at the start, which is the eleventh month, applying the yang seasonal nodes. From the eleventh month’s *Fu* hexagram to the fourth month’s pure *Qian*, the six positions reach extreme yang. From the fifth month’s *Gou* hexagram to the tenth month’s pure *Kun*, the six positions reach extreme yin. This completes one full cycle.\n\nThe formula states: In the fifteen days before the full moon, the white moon governs fire and wood, their numbers being seven and eight. *Zhen* presides over spring; wood generates three, the completion number eight. *Li* presides over summer; fire generates two, the completion number seven. Seven and eight make fifteen.\n\nThe formula states: In the fifteen days after the full moon, the black moon governs metal and water, their numbers being nine and six. *Dui* presides over autumn; metal generates four, the completion number nine. *Kan* presides over winter; water generates one, the completion number six. Nine and six make fifteen.\n\nThe formula states: The foundation of the Five Phases: one is the north’s *ren* and *gui* water; two is the south’s *bing* and *ding* fire; three is the east’s *jia* and *yi* wood; four is the west’s *geng* and *xin* metal; five is the center’s *wu* and *ji* earth. The father is young, and the son is old. The father is *heavenly lead*; heavenly lead is cinnabar. The son, born from the father, is *black lead*—thus, the father is young, and the son is old. The son’s number is indefinite; the father’s number is twenty-five. Water, fire, metal, wood, and earth—the Five Phases shift and change. Five days make one node; five times five is twenty-five—thus, the father is twenty-five. The son’s years of ceaseless movement make the father young and the son old. The world does not know that the myriad things are generated and completed by the Five Phases—these are the parents.\n\n**Fire-Use Formula**\nThe formula states: The six lines of the Direct Tally move the hexagram nodes; the fire’s weight and measure begin from pure *Kun* and end at *Kun*, cycling without cease.\n\nThe formula states: Change the crucible each month; stop at nine crucibles. The tenth crucible may be used at will for rest or activity—whether using the crucible or not, both yield wondrous transformations, for this is the primordial *qi* of generative metal. Thus, it is called the *earth cauldron* or *mother*. The mother is the Metal Crucible.\n\nThe formula states: In the operation of metal and water, following the hexagram nodes for fifteen days, the metal nature is extinguished; in thirty days, the elixir is completed. By the tenth month, the original earth is no longer used as the crucible—mother and child part ways in the womb. The *nine revolutions* are the nine crucibles. The *tally* is the father’s function; the *crucible* is the mother’s function. It is likened to a human, who after receiving *qi*, is born in 270 days. The ninth month is when yin and yang are both abundant; the tenth month, when earth flourishes, mother and child separate—hence the name *womb-exiting returning elixir*. It is like a human, whose four *qi* are complete at birth. Just as a child is nurtured for three years until the primordial *qi* is full, the Golden Elixir is completed—this is called *Yellow Lift*. Transforming and returning to the north, the black color becomes translucent—only then is it named the *Great Returning Elixir*. The world does not know this.\n\nThe child is the medicine; the mother is the crucible. *Qi* resonates to generate and produce, restrain and subdue, alternately flourishing and declining. Ascending and descending within the crucible, flying and hiding above and below, yin and yang receive each other, intermingling and devouring. The four substances press upon one another; ruler and minister combine. Earth’s nature generates; metal’s nature dies. The four substances are yang within yin and yin within yang. Yet earth is the pivot; the Direct Tally moves—thus, the four substances each reside in their quadrant. When the four natures are extinguished, they return to oneness and revert to the origin—hence the name *Golden Elixir*.\n\nThe formula states: Guard and operate for one year, ingest one *liang*—no illness will arise. Guard and operate for two years, complete the White Way—ingest half a *liang*. Guard and operate for three years, the Great Primordial *Qi* is full, complete the Red Way—ingest one *fen*, abide in the world, and attain longevity. A *daogui* (knife-tip) controls mercury to complete the Red Way. Guard and operate for five years, ingest seven grains the size of sesame seeds—attain longevity. A *daogui* transmutes iron and mercury, one *jin* to complete the Red Way. After nine full years of guarding and operating, ingest three grains—the Three Corpses and Nine Worms all depart, and one attains ageless longevity.\"",
      "overlap_context": "ive Tallies Metal Crucible. Among ten thousand, perhaps one knows this.\n\nEarth tally: the essence of fire and wood. Fire can cook and mature the myriad things, nurturing human life. Fire is the essence of *jia*, the original *qi* of yang. Conjoined in harmony, it merges with the essence of sun and moon, returning to oneness without duality. The essence of *jia* is fire; fire’s number is two. Two generates three; the completion number is nine. Nine is the extreme number of yang, the *qi* of fire.",
      "start_char": 3530,
      "end_char": 4772,
      "start_sentence": 181,
      "end_sentence": 251,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.676454067230225,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\还丹肘后诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "五金八石瓦砾，并成至宝。 诀曰：用火所指喻爻象，手镜记火斤两，同用之。 假令十一月建子，一阳爻动，火生二，成数七，运动般载如车轮，一月进一爻，至五月一阴生，一月退一爻，至十月归於土，终而复始。 金砂是日月运动，自然成丹。 因燧人解火，后圣用之成丹。 周天大造化，志在更漏分明，用火不失斤两，节候有准，渐渐如蒸物，年月满足，自然成功。 急则飞走，缓则不伏。 但依直符爻象，则金水自伏矣。 六月阳绝，终於巳。 十二月阴绝，终於亥。 诀曰：丹砂者，阳黑流珠之精，是立乾坤，运水火，应天符，合三才。 金为月精，以处阳位。 汞合离黑，以应六爻。 天地之灵，日月之精，否极泰来，阴尽阳生。 故云：丹砂木精，得金乃并。 是三一之道。 三者火，一者药，名日守一。 又曰：砂是药，金是鼎。 故云：三道由一并根蒂，大道至理门无二。 其砂性温和，无毒，味辛，元黑通灵，万炼而不枯，名曰黑铅。 铅者，砂中自生液，仰月抽出之液，黑。 入仰月配合为夫妻，阳魂含阴魄，两姓自和同。 诀曰：然用五行，乾坤艮巽，直符孕育，从建子初一阳生子，子午相应，五六相通，推移刻漏，日月五星，寒暑来往，昼阳夜阴，交会三十日一。 节节相临，阴阳寒暑，调顺潜伏，循环六十四卦，周而复始，水火相伏，更无外物，五金八石，由人造化。 五金者，五行也。 八石者，八卦也。 水得龙而变化，火得人而运动，还丹养育，不越於五八，也。 诀曰：直符初发之时，文不过九，武不过九。 九者，阳之极数。 三三如九，过之极阴生之首。 阴尽阳生，皆顺天道阴阳，而为运动。 若均金水即顺，节候失序，金水乃乖。 运动如垂组抱卵，受黑而生用事。 相生如寒谷变条，发生应期互用，皆立喻也。 诀曰：日之精元黑，本生南方丙丁火，离位，二阳之中一阴生，日魂，阴汞，水也。 受黑足，移位北方壬癸水，坎寄位，二阴之中一阳生，月魄，阳汞，金也。 水即湛然而不动，无为之体。 火即焰动而乃飞，有为之宗。 将无制有，合成其道。 故知金生阴暗处，始初生是子母相生应也。 诀曰：金入中宫，是名太一，孕育含黄，黑混其青，白虎制度，本黑相从，故日参同。 又云：坎离数一二，南北独为经。 一者水，二者火，万物因水而生，因火而成，火金相伐，水土相克而成丹。 诀曰：直符初发在子，从震而生。 四月火旺，极阳合退。 又从巽而生二木渐顺。 汞初伏虽乾，未是大丹。 守三节名曰丹砂，五节名日金砂。 一年名倒长砂，亦名小还。 二年名魂砂，亦名中还。 三年名金液大丹，人得饵之，乃为上仙。 诀曰：金丹不悟玄理，盖不知丹砂，是铅造化根本。 迷迷相指，误用凡水银、凡铅、凡银，不知凡铅是世银之母。 雄是药之子，砂乃铅之母，黄是土，土乃砂之父祖。 不知错用水银凡铅金银，以为鼎器，为子母。 或炼铅，取其杂石为药。 自古至今，未见得之者，为不知道之本根。 夫神仙之道，道在目前。 砂者木精，得土而生，得土而灭，不离於五行互用，更为父母，相生相灭而成形也。 诀曰：黑能存生，内丹固形，外丹长生，莫过於内外二丹也。 日月之精华，精华者丹砂，元和之黑，乃性命之根基。",
      "translated_text": "The five metals, eight minerals, and even tiles and pebbles—all become supreme treasures.\n\nThe formula states: Use fire as indicated by the moving lines of the hexagrams; record the weight of fire with a hand-mirror, and employ them together. For example, in the eleventh month, when *Jianzi* begins, one yang line stirs—fire begins at two, completing the number seven. The movement and rotation are like a wheel: each month advances one line, until the fifth month when one yin line arises; each month then retreats one line, returning to earth by the tenth month. This cycle repeats endlessly. Cinnabar and gold move like the sun and moon, naturally forming the elixir. Since Suiren mastered fire, later sages used it to refine the elixir. The great creation of the celestial revolution depends on the clarity of the water clock; the fire must not lose its weight, and the seasonal nodes must be precise. Gradually, like steaming food, when the years and months are fulfilled, success comes naturally. If too hasty, the essence will fly away; if too slow, it will not be subdued. Simply follow the moving lines of the hexagrams, and the gold and water will naturally submit.\n\nIn the sixth month, yang expires, ending at *si*. In the twelfth month, yin expires, ending at *hai*.\n\nThe formula states: Cinnabar is the essence of the yang-black flowing pearl, establishing heaven and earth, circulating water and fire, responding to the celestial tally, and uniting the Three Powers. Gold is the essence of the moon, residing in the yang position. Mercury unites with the *li* hexagram, corresponding to the six lines. The spirit of heaven and earth, the essence of the sun and moon—when negativity reaches its limit, positivity arises. Thus it is said: Cinnabar is the essence of wood, which, when combined with metal, merges as one. This is the Way of the Three-in-One. Three is fire, one is the medicine—this is called \"guarding the One.\" It is also said: Cinnabar is the medicine, gold is the crucible. Hence it is said: The Three Ways originate from one root; the great Dao’s ultimate principle has no duality. Cinnabar is warm and harmonious, non-toxic, pungent in taste, and its primordial blackness connects with the numinous. Though refined ten thousand times, it does not wither—it is called \"black lead.\" Lead is the liquid born within cinnabar, the liquid drawn out by the upturned moon, black in color. When it enters the upturned moon and unites as husband and wife, the yang soul embraces the yin spirit, and the two natures naturally harmonize.\n\nThe formula states: Thus, employ the Five Phases—*Qian*, *Kun*, *Gen*, and *Xun*—with the moving tally nurturing and transforming. From *Jianzi*, when the first yang arises at *zi*, *zi* and *wu* correspond, five and six communicate. The water clock shifts, the sun, moon, and five stars move, cold and heat alternate, day as yang and night as yin—every thirty days they conjoin. Each node arrives in sequence; yin and yang, cold and heat, adjust and submit, circulating through the sixty-four hexagrams in endless repetition. Water and fire subdue each other, with nothing external; the five metals and eight minerals are transformed by human effort. The five metals are the Five Phases; the eight minerals are the Eight Trigrams. Water, when met with the dragon, transforms; fire, when met with man, moves. The cyclically transformed elixir is nurtured without exceeding the five and eight.\n\nThe formula states: When the moving tally first stirs, civil fire does not exceed nine, and martial fire does not exceed nine. Nine is the extreme number of yang. Three times three is nine; beyond this, the beginning of extreme yin arises. When yin is exhausted, yang is born—all follow the Dao of heaven’s yin and yang in movement. If gold and water are balanced and the seasonal nodes are in order, gold and water harmonize. If the nodes are disordered, gold and water become discordant. The movement is like a silkworm spinning its cocoon or a bird brooding its egg—receiving the blackness to activate its function. Their generation is like the transformation of a cold valley into sprouting branches, occurring at the appointed time and interacting—all are established as metaphors.\n\nThe formula states: The essence of the sun is primordial blackness, originally born in the southern *bing ding* fire, the *li* position, where one yin arises amid two yangs—this is the sun’s soul, yin mercury, water. When its blackness is full, it shifts to the northern *ren gui* water, the *kan* position, where one yang arises amid two yins—this is the moon’s spirit, yang mercury, metal. Water is still and unmoving, the substance of non-action. Fire flickers and flies, the origin of action. Uniting the formless with the formed completes the Way. Thus, it is known that metal is born in dark places, initially responding as mother and child.\n\nThe formula states: When gold enters the central palace, it is called the Great One, nurturing and containing the yellow, with blackness mixing with the blue. The White Tiger’s system follows the original blackness—hence the term *Cantong*. It is also said: *Kan* and *li* are numbered one and two, uniquely forming the warp of south and north. One is water, two is fire; all things are born through water and completed through fire. Fire and metal contend, water and earth overcome each other to form the elixir.\n\nThe formula states: When the moving tally first stirs at *zi*, it arises from *zhen*. In the fourth month, fire flourishes, and extreme yang retreats. Then, from *xun*, two woods gradually align. Though mercury is initially subdued in *qian*, it is not yet the great elixir. Guarding three nodes is called \"cinnabar\"; five nodes is called \"gold sand.\" One year is called \"inverted long sand,\" also named \"lesser return.\" Two years is called \"soul sand,\" also named \"middle return.\" Three years is called \"golden liquid great elixir\"—one who ingests it becomes an upper immortal.\n\nThe formula states: Those who fail to comprehend the profound principle of the golden elixir do not understand that cinnabar is the root of lead’s transformation. Misled by confusion, they mistakenly use common mercury, common lead, or common silver, unaware that common lead is the mother of worldly silver. Mercury is the child of the medicine, cinnabar is the mother of lead, and yellow is earth—earth is the father and ancestor of cinnabar. Unaware, they err in using common mercury, lead, or silver as crucibles or as mother and child. Some refine lead, extracting its mixed stones as medicine. From ancient times to the present, none have succeeded because they do not know the root of the Dao. The Way of immortals lies before one’s eyes. Cinnabar is the essence of wood, born through earth and extinguished through earth, never departing from the Five Phases’ mutual interaction. They become father and mother, generating and extinguishing to form shape.\n\nThe formula states: Blackness can preserve life; the inner elixir secures form, and the outer elixir grants longevity—nothing surpasses these two elixirs, inner and outer. The essence of the sun and moon is cinnabar, the primordial harmony of blackness—the root of nature and life.",
      "overlap_context": "e Great Primordial *Qi* is full, complete the Red Way—ingest one *fen*, abide in the world, and attain longevity. A *daogui* (knife-tip) controls mercury to complete the Red Way. Guard and operate for five years, ingest seven grains the size of sesame seeds—attain longevity. A *daogui* transmutes iron and mercury, one *jin* to complete the Red Way. After nine full years of guarding and operating, ingest three grains—the Three Corpses and Nine Worms all depart, and one attains ageless longevity.\"",
      "start_char": 4772,
      "end_char": 6005,
      "start_sentence": 252,
      "end_sentence": 312,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.05349779129028,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\还丹肘后诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "除内外金丹精华之外，其余未足论也。 诀曰：且如水银，孤阴之物，能腐肉搜肠。 金性损肝，银性损脾，铜性损肾，铅锡损胃，四黄大毒，损人元气。 但指於一金一石，三十六水，七十二石，皆有大毒，服之虽时下无事，久则终为大害。 丹砂纵有傍通小门制伏，止能小益耳，延驻长生之道，即不可也。 诀曰：且如水银凡铅，本母在矿，受阳黑足，性自伏。 如用火烟出，则世水银是也。 世水银与丹砂中水银，形貌相似，象人男之与女各别。 丹砂象男，老阳，是精魂，留人性命，内有水银相伏，不与世水银相合，并外物抑遏而得也。 诀曰：世之水银象女，太阴之月精，夺人性命，孤阴寡阳，有毒不可服也。 故曰：水银有阴阳，性貌虽同，乃天地之精，象男女有异也。 丹砂如有傍通小门伏之，则用凡铅为器，匡廓成药。 诀曰：世人不知黄白根本，侯用凡水银，凡铅金银为至药。 殊不知汞生於铅，砂产於金，金丹假本黑而成丹，何得遗本而好末乎。 铅者子，丹精也。 黑者母，是本土金之土，故名本铅，又云：天铅者，丹砂也。 金本从铅中生，即是子隐母胞。 子藏於金中，即是母隐子胎。 铅者黄芽，黄芽者丹砂，土能生芽，故日黄芽。 铅者七宝之良媒，五金之筋骨，解即万事俱通，迷则千途并塞。 然铅能伏汞，汞能伏铅，铅汞相成，合为黄白。 故一阴一阳之谓道，一金一石之谓丹。 石则乘阳而热，金则乘阴而寒，魂魄相应，至理必然。 石液定魂，金精定魄，非阴阳之感化，谅九幽之可恃。 君子良求，淑女相配，理乃得宜，而道有所在也。 经云：河上姥女，灵而最神。 得火则飞，不见埃尘。 鬼隐龙匿，莫知所存。",
      "translated_text": "Beyond the essence of the inner and outer elixirs of gold, all else is not worth discussing.\n\nThe formula states: Take mercury, for instance—a solitary yin substance that corrodes flesh and scours the intestines. Gold harms the liver, silver the spleen, copper the kidneys, lead and tin the stomach. The Four Yellows are highly toxic, depleting one’s primordial qi. Any single metal or mineral, the thirty-six aqueous solutions, or the seventy-two stones—all bear great toxicity. Though they may cause no immediate harm upon ingestion, over time they inevitably bring grave injury. Even if cinnabar has peripheral methods to subdue them, it offers but minor benefit; it cannot serve as the Way of prolonged life and immortality.\n\nThe formula states: Consider common mercury and lead—their mother resides in the ore, receiving ample yang and blackness, their nature inherently subdued. When refined by fire and smoke, they become the mercury of the world. This worldly mercury resembles the mercury within cinnabar in appearance, yet they differ as man and woman. Cinnabar is like a man, an old yang, the essence of the hun-soul, preserving human life and nature. Its inherent mercury is subdued, never mingling with worldly mercury, restrained by external forces. The formula states: Worldly mercury is like a woman, the essence of the moon’s great yin, stealing human life and nature. A solitary yin with scant yang, it is toxic and must not be consumed. Thus it is said: Mercury possesses yin and yang. Though their natures and forms appear alike, they are the essence of heaven and earth, differing as man and woman. If cinnabar has peripheral methods to subdue it, then common lead may serve as the vessel to contain and refine the elixir.\n\nThe formula states: People today do not know the root of the yellow and white arts. They regard common mercury, lead, gold, and silver as supreme medicines. Yet they fail to see that mercury is born of lead, and cinnabar emerges from gold. The golden elixir borrows the root of blackness to become cinnabar—how can one abandon the root and favor the branch? Lead is the child, the essence of cinnabar. Blackness is the mother, the earth of metal’s earth—hence it is called \"root lead,\" or \"heavenly lead,\" which is cinnabar. Gold is born from lead, the child concealed within the mother’s womb. The child hides within gold, the mother concealed in the child’s embryo. Lead is the yellow sprout; the yellow sprout is cinnabar. Earth generates the sprout, hence it is called the \"yellow sprout.\" Lead is the fine matchmaker of the Seven Treasures, the sinew and bone of the Five Metals. When understood, all matters become clear; when deluded, a thousand paths are blocked. Thus lead subdues mercury, and mercury subdues lead. Lead and mercury unite to form the yellow and white. Therefore, the Dao is called the union of one yin and one yang; the elixir is called the union of one metal and one stone. Stone rides the yang and is hot; metal rides the yin and is cold. The hun and po respond to one another—this is the inevitable principle. The liquid of stone stabilizes the hun; the essence of metal stabilizes the po. Without the mutual transformation of yin and yang, even the depths of the Nine Darks would be unreliable. The noble man seeks earnestly; the virtuous woman matches fittingly. Only then is the principle proper, and the Dao resides therein.\n\nThe Classic states: The Old Woman of the River, numinous and most divine. When fire is applied, she takes flight, unseen in dust or earth. Ghosts hide, dragons conceal—none know where she abides.",
      "overlap_context": " Cinnabar is the essence of wood, born through earth and extinguished through earth, never departing from the Five Phases’ mutual interaction. They become father and mother, generating and extinguishing to form shape.\n\nThe formula states: Blackness can preserve life; the inner elixir secures form, and the outer elixir grants longevity—nothing surpasses these two elixirs, inner and outer. The essence of the sun and moon is cinnabar, the primordial harmony of blackness—the root of nature and life.",
      "start_char": 6005,
      "end_char": 6644,
      "start_sentence": 313,
      "end_sentence": 340,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.24389338493347,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\还丹肘后诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "将欲制之，黄芽为根。 若不入黄芽，独烧水银，虽器厚盈尺，固塞百重，火动即飞，莫知能止，须臾去尽，不见毫厘，如鬼隐幽冥，龙潜水府，纵有离娄之目，莫之能睹。 使汞伏而不动者，黄芽之功也。 金仙诀曰：黄芽一两，制汞一斤，如子得母，颜容听圻，终不飞走，如忠臣之爱君。 世人用生金为黄芽，又日黄芽者铅之正体，炼而取之。 歌曰：黄芽铅汞造，阴壳含阳华。 是不离於五行也。 故曰：五行成功，人服长生。 五者，铅中生金之土，是铅正真之母也。 得黄芽之诀者，大药门中了矣。 余存火候分晓，审於进退，日夕无倦，终始一心，而成真一也。 故云：金砂入五内，雾散若风雨，黛蒸达四肢。 故圣人秘易，不秘难也。 得之者，得一耳。",
      "translated_text": "To subdue it, the Yellow Sprout serves as the root. Without the Yellow Sprout, if one burns mercury alone, though the vessel be a foot thick and sealed a hundredfold, once fire is applied, it takes flight—none can halt it. In an instant, it vanishes without a trace, like ghosts concealed in darkest depths or dragons hidden in watery abodes, even the eyes of Li Lou could not perceive it. That mercury remains subdued and unmoving is the work of the Yellow Sprout.\n\nThe *Jue of the Golden Immortal* states: One liang of Yellow Sprout subdues one jin of mercury, like a child clinging to its mother, its countenance obedient, never fleeing—like a loyal minister’s devotion to his lord.\n\nThe world uses raw gold as the Yellow Sprout, yet the Yellow Sprout is also said to be the true essence of lead, refined and extracted. A song says:\n*The Yellow Sprout and lead-mercury create,*\n*Yin’s husk holds yang’s radiance.*\n\nThis does not depart from the Five Phases. Thus it is said: When the Five Phases achieve success, one who ingests them attains longevity. The Five are the earth within lead that generates gold—this earth is the true mother of lead. He who grasps the secret of the Yellow Sprout has mastered the gate of the Great Medicine.\n\nI preserve clarity in fire times, discerning advance and retreat, tireless day and night, steadfast from beginning to end, thus achieving the True One. Hence it is said:\n*Golden sand enters the five viscera,*\n*Mist scatters like wind and rain,*\n*Steam rises to the four limbs.*\n\nThus the sage conceals what is easy, not what is difficult. He who attains it attains the One.",
      "overlap_context": "tone stabilizes the hun; the essence of metal stabilizes the po. Without the mutual transformation of yin and yang, even the depths of the Nine Darks would be unreliable. The noble man seeks earnestly; the virtuous woman matches fittingly. Only then is the principle proper, and the Dao resides therein.\n\nThe Classic states: The Old Woman of the River, numinous and most divine. When fire is applied, she takes flight, unseen in dust or earth. Ghosts hide, dragons conceal—none know where she abides.",
      "start_char": 6644,
      "end_char": 6933,
      "start_sentence": 341,
      "end_sentence": 354,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.139129161834717,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\还丹肘后诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "若强心贼道，不慕修心，不敬师尊，心高自满，纵有所授，志在荣身，定知反有所损，非天不容，心不合道也。 用火直符诀 第一日初候，火一两，三十时。 至两日半，加二两，共六十时。 一爻至二爻。 第六日二候，火三两，三十时。 至七日半，加至四两，共六十时。 三爻至四爻。 第十一日三候，火五两，三十时。 加至六两，共六十时。 五爻至六爻。 第十六日火四候，仍用六两，三十时。 退至五两，共六十时。 六爻至五爻。 第二十一日五候，退用火四两，三十时。 又退三两，共六十时。 四爻至三爻。 第二十六日六候，退用二两，三十时。 又退一两，共六十时。 二爻至一爻。 右件六候直符，爻生进退，一月法例如上，周而复始。 次到第二马初候，二两，三十时。 加至三两，共六十时。 以次加去如前。 每值换鼎入月头初候，加一两。 至九个月初候，乃火九两。 是一至九，金虎吐精。 三十时，加至十四两，共六十时。 以直符合进退，但依法刻漏分明，用火之时，象四月火旺极阳，用事进退，潜伏阴阳，刑德换鼎，即土旺金乡，三物俱丧，是金土本黑相感也。 直符合退之时，象五月一阴生，上九，亢龙有悔。 直符运动至九鼎，是九月后初候，常九两。 三十时，更加一两，共六十时。 至十四两，极阳也。 又退至九两。 足第十月后，不论年月，常如取九月初候，终十四两，退至九两，六十时足。 以次序直符加臧，刻漏分明，周而复始，运动九年而毕。 诀曰：直符用火进退法，第一月初候发火，用二十四两火，为一爻也，以法二十四黑。 守至二日半，加一爻，至五日是为一候也。 以次用火加爻，每月有六候。 常至第三候六十时下，与第四候三十时上，并武火处，其火斤两，进退日夜，须别添熟火，常令露火面，即候本斤两也。 其直符九个月半毕后，则常取第九月火候爻象法则进退斤两为定，不论年月远近也。 从子时放水滴，看至丑，合用多少水。 但作桶子，高三尺，内圆阔一尺，近底棱边穿一小孔，内翎管子，紧实其中，蜡塞四边，贮水令满，待滴下尽，却投其中，看待至一时辰，合用水若干，以定则诸时用水，日夜分明不失，与更漏准，无别方可用之。 用火直符九鼎，潜伏进退，每月六候，火记正历分排，逐件书之于后。 一月一爻，次第而去。 每月三进三退，毋令失次。 诀曰：圣人推移用火，以象天周而复始。 《 元君手镜》 曰：天地二黑相感，日月照耀，成自然还丹。 上界仙官收采，非人问俗士所值也。 皆是神仙则之，以弘至道。 修生以立直符，运动三年，自然之黑，运火候依节，候乾坤坎离，转加火候斤两，须得真师，授以口诀。 若不从师，参差药物，别有交杂，终无成理。 圣人观天守一，但得本父母相制，必然成功，则是神通而变化。 诀曰：直符法，喻如十一月建子，阳黑始生。 夏至一日，阴黑始生。 是天地阴阳进退，一年十二月用事也。 一月故有六候，直符潜伏，五行出没，交会刑克，并在其内，甲得土· 火木。 前十五日白月，三候极阳用事，震后阳运阴生，九六阴水也。 后十五日黑月，用事三候属阴，周而复始。 故七八、九六，道合三十日终也。 金水本喻以立月候，日夜用火潜伏，象一年阴阳节候，日一夕用火。",
      "translated_text": "If one forcibly seizes the Dao with a thieving heart, scorns the cultivation of the mind, and disrespects the revered teacher, filled with arrogance and self-satisfaction—even if some teachings are received, should the intent lie in personal glory, it is certain to bring harm instead. This is not that Heaven rejects them, but that their heart does not align with the Dao.\n\n**Direct Talisman Fire Method**\nOn the first day of the first period, apply one *liang* of fire for thirty hours.\nBy two and a half days, add two *liang*, totaling sixty hours.\nFrom the first line to the second line.\n\nOn the sixth day of the second period, apply three *liang* of fire for thirty hours.\nBy seven and a half days, increase to four *liang*, totaling sixty hours.\nFrom the third line to the fourth line.\n\nOn the eleventh day of the third period, apply five *liang* of fire for thirty hours.\nIncrease to six *liang*, totaling sixty hours.\nFrom the fifth line to the sixth line.\n\nOn the sixteenth day of the fourth period, still use six *liang* of fire for thirty hours.\nReduce to five *liang*, totaling sixty hours.\nFrom the sixth line to the fifth line.\n\nOn the twenty-first day of the fifth period, reduce fire to four *liang* for thirty hours.\nFurther reduce to three *liang*, totaling sixty hours.\nFrom the fourth line to the third line.\n\nOn the twenty-sixth day of the sixth period, reduce fire to two *liang* for thirty hours.\nFurther reduce to one *liang*, totaling sixty hours.\nFrom the second line to the first line.\n\nThe above six periods of the Direct Talisman, with lines advancing and retreating, follow this monthly method, cycling endlessly.\n\nProceeding to the second \"horse\" (phase), in the initial period, apply two *liang* for thirty hours.\nIncrease to three *liang*, totaling sixty hours.\nContinue incrementing as before.\n\nEach time the cauldron is changed at the start of a lunar month, add one *liang*.\nBy the ninth month’s initial period, the fire reaches nine *liang*.\nFrom one to nine, the Metal Tiger spits its essence.\nFor thirty hours, increase to fourteen *liang*, totaling sixty hours.\nAlign the Direct Talisman with the advance and retreat, strictly following the clepsydra’s markings. When applying fire, emulate the fourth month when fire flourishes in extreme yang. In its advance and retreat, yin and yang lie concealed. When changing the cauldron at the shift of punishment and virtue, it is the earth’s flourishing in the Metal region—where the Three Agents all perish, for Metal and earth are fundamentally black and mutually responsive.\n\nWhen the Direct Talisman aligns with retreat, it mirrors the fifth month when the first yin arises—\"At the ninth yang, the dragon soars too high and meets regret.\"\n\nWhen the Direct Talisman moves to the ninth cauldron, it is the initial period after the ninth month, consistently at nine *liang*.\nFor thirty hours, add one *liang*, totaling sixty hours.\nAt fourteen *liang*, it is extreme yang.\nThen retreat to nine *liang*.\nAfter completing the tenth month, regardless of years or months, always follow the ninth month’s initial period: begin at fourteen *liang*, retreat to nine *liang*, completing sixty hours.\n\nProceed in order with the Direct Talisman’s increments and reductions, clearly marking the clepsydra’s divisions. Cycle endlessly, and the movement will conclude after nine years.\n\n**Method Formula:**\nThe Direct Talisman’s fire advance and retreat: In the first month’s initial period, ignite the fire with twenty-four *liang* of fire as one line, following the twenty-four black method.\nMaintain until two and a half days, add one line, and by five days, it is one period.\nContinue incrementing the fire by lines; each month has six periods.\n\nAlways at the third period’s sixty hours and the fourth period’s first thirty hours, apply the martial fire. For the fire’s weight in *liang*, advancing and retreating day and night, add well-tempered fire, ensuring the fire’s surface remains exposed to gauge the proper weight.\n\nAfter completing nine and a half months of the Direct Talisman, consistently follow the ninth month’s fire period and line method for advancing and retreating *liang*—regardless of how many years or months pass.\n\nBegin the water drip at the *zi* hour, observing until *chou*, measuring the required water. Construct a barrel three *chi* high, one *chi* in inner diameter, and near the bottom edge, bore a small hole with a feathered tube tightly fitted inside. Seal the edges with wax, fill with water, and let it drip completely. Then refill and measure the water used in one double-hour to establish the standard for all times. Ensure day and night are clearly distinguished, matching the clepsydra’s accuracy before use.\n\nFor the Direct Talisman’s nine cauldrons, concealed advance and retreat, each month has six periods. Record the fire’s progression in the correct almanac, detailing each step as follows:\nOne line per month, proceeding in order.\nEach month has three advances and three retreats—do not disrupt the sequence.\n\n**Formula:**\nThe sage shifts and applies fire, emulating Heaven’s cyclical return.\n*The Celestial Sovereign’s Hand Mirror* states: Heaven and earth’s two blacks mutually resonate; sun and moon illuminate, forming the natural Reverted Elixir. The celestial immortals gather and refine it—this is not something worldly scholars can attain. It is the method of immortals, upholding the Great Dao. Cultivating life establishes the Direct Talisman. After three years of movement, the natural black emerges. Apply fire in accordance with the seasons, awaiting the hexagrams *Qian* and *Kun*, *Kan* and *Li*, incrementing the fire’s weight. One must receive the true teacher’s oral transmission. Without a teacher, haphazardly mixing ingredients and introducing杂乱杂, there will be no success. The sage observes Heaven and guards the One. Grasping the mutual restraint of the original father and mother ensures success—this is spiritual transformation through divine penetration.\n\n**Formula:**\nThe Direct Talisman method is likened to the eleventh month, *jianzi*, when yang *qi* begins to arise. On the summer solstice day, yin *qi* begins to arise. This is Heaven and earth’s yin and yang advancing and retreating, governing the twelve months of the year. Thus, each month has six periods. The Direct Talisman lies concealed, with the Five Phases emerging and submerging, their interactions and mutual restraints all contained within. Wood is obtained from earth and fire.\n\nIn the first fifteen days of the white moon, the three periods of extreme yang govern. After *Zhen*, yang moves and yin arises—nine-six yin water. In the latter fifteen days of the black moon, the three governing periods belong to yin, cycling endlessly. Thus, seven-eight and nine-six align with the Dao, completing thirty days.\n\nMetal and water are analogized to establish the monthly periods. Day and night, the fire lies concealed, emulating the yin and yang seasonal nodes of a year—one day and night’s fire application.",
      "overlap_context": " earth is the true mother of lead. He who grasps the secret of the Yellow Sprout has mastered the gate of the Great Medicine.\n\nI preserve clarity in fire times, discerning advance and retreat, tireless day and night, steadfast from beginning to end, thus achieving the True One. Hence it is said:\n*Golden sand enters the five viscera,*\n*Mist scatters like wind and rain,*\n*Steam rises to the four limbs.*\n\nThus the sage conceals what is easy, not what is difficult. He who attains it attains the One.",
      "start_char": 6933,
      "end_char": 8187,
      "start_sentence": 355,
      "end_sentence": 415,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.604084491729736,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\还丹肘后诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "此是把握天地，枢机在乎手也。 名曰出世之方，玄之又玄。 但起火之时，便是十一月，一阳始萌用事也。 诀曰：第一鼎第二月初候，火一爻，直符象十一月建子，阳黑用事，初九，潜龙勿用。 一爻生，昼夜二日半三十时。 加至二爻，五日一候，六十时。 巡十一月，一辰自子顺至亥，十二时。 五周合六十时，一候。 初候五日惊垫节，震来受符，运至上弦八日，金性低昂，半受死黑。 守至十五日，为一黑金性灭。 二十日，萌者不生，阳升阴屈，水不动，刚柔相使，自然成丹也。 二十一日，巽来受符，金水性已灭，黑乃竭，二精呼吸吞饮同死，震巽二木渐顺，汞乃乾也，未是大丹。 四十＇五日，一节一节，相驱相逼，至六十日，卯当夹锺，刑德相负，日夜始分→ 故名榆荚丹也。 故曰：日有三照，月有三移，日月合黑，万物三变而至极，经四时自然之道，一月有三百六十时，象一年四千三百二十时，以象自然还丹也。 诀曰：九鼎是九个月，九鼎各须三。 每鼎守受黑二百七十日，阴阳俱盛。 十月土旺而生，故云母子脱胎。 世人莫知矣。 水火相克，互相制伏，更为父母，不越五八，藏伏成形。",
      "translated_text": "This is the grasp of Heaven and Earth, with the pivotal mechanism held in hand. It is called the method of transcending the world, profound beyond profundity. When the fire is first kindled, it is the eleventh month, when the first yang begins to sprout and take charge.\n\nThe formula states: The first crucible corresponds to the second initial period of the second month, with one line of fire. The Direct Talisman symbolizes the eleventh month, *Jianzi*, when yang and darkness govern, the *ninth yang* of \"the hidden dragon biding its time.\" One line is generated, lasting two and a half days and nights, totaling thirty hours. When it reaches two lines, five days form one period, comprising sixty hours. Traversing the eleventh month, one *chen* moves sequentially from *zi* to *hai*, encompassing twelve hours. Five cycles complete sixty hours, constituting one period.\n\nThe first period of five days marks the *Jingzhe* solar term. *Zhen* arrives to receive the talisman, and by the eighth day at the first quarter, the nature of metal waxes and wanes, half-submerged in deathly darkness. Maintaining this until the fifteenth day, the darkness extinguishes the nature of metal. By the twentieth day, what once sprouted no longer grows; yang ascends while yin recedes, water remains still, and hardness and softness interact—spontaneously forming the elixir.\n\nOn the twenty-first day, *Xun* arrives to receive the talisman. The nature of metal and water is extinguished, and darkness is exhausted. The two essences inhale and exhale in unison, dying together. *Zhen* and *Xun*, the two woods, gradually align, and mercury becomes *qian*. Yet this is not the Great Elixir.\n\nForty-five days later, one node after another drives and compels, until the sixtieth day when *mao* aligns with *Jiazhong*. Punishment and virtue contend, and day and night begin to divide—hence the name *YuJia* Elixir.\n\nThus it is said: The sun has three illuminations, the moon three shifts. When the sun and moon conjoin in darkness, all things undergo three transformations to reach their apex. Following the natural Dao of the four seasons, one month has three hundred sixty hours, symbolizing a year’s four thousand three hundred twenty hours—mirroring the natural cyclical elixir.\n\nThe formula states: The nine crucibles correspond to nine months, each crucible requiring three. For each crucible, one must maintain the reception of darkness for two hundred seventy days, when yin and yang are both abundant. In the tenth month, earth flourishes and gives birth—hence the phrase \"mother and child parting.\" The world remains unaware.\n\nWater and fire restrain each other, mutually overcoming and becoming father and mother. They do not exceed five and eight, concealing and nurturing to take form.",
      "overlap_context": " of the white moon, the three periods of extreme yang govern. After *Zhen*, yang moves and yin arises—nine-six yin water. In the latter fifteen days of the black moon, the three governing periods belong to yin, cycling endlessly. Thus, seven-eight and nine-six align with the Dao, completing thirty days.\n\nMetal and water are analogized to establish the monthly periods. Day and night, the fire lies concealed, emulating the yin and yang seasonal nodes of a year—one day and night’s fire application.",
      "start_char": 8187,
      "end_char": 8632,
      "start_sentence": 416,
      "end_sentence": 434,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.42277717590332,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\还丹肘后诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "守运一千日，天元黑足，性归北方壬癸水，黑色，名曰大还丹也。 诀曰：取元黑金水，分为两停，相和合为一体。 本立喻月上下两弦，应二八一斤之数，以应阴阳。 金水本乎一物，而生二象。 黑候雌雄黄白，自然之情性，依阴阳而为，其体无二。 二曰火，一日水。 除水火为药，外无别入。 若有异类，终不成丹。 得之不在斤两也。 但得金水入鼎，如法固济，取四煞阳日阳时，起火刻漏分明，金水在於鼎中，混沌未分，被直符运动，变化清浊，上白下黄，含真抱一焉。 诀曰：丹砂，金砂，金液，长砂，黄芽，天铅，砂汞，铅汞，阴阳，金土水火，坎离乾坤，龙虎，金丹玉液，九还七返大丹，皆是别名。 盖古人秘藏，隐密不一耳，悟者归一无二。 还丹有返，忌血物。 上古之人慎密其道，非同心者，勿泄天道也。 凡修之所，切要清静，无死亡、生产、哭泣、安葬、址墓、不净之地，须择福地名山，方可修炼。 仍祀土地灵官神圣祈佑，晨夕香灯，勿令一切下俗，窥视触秽，秘密行之。 若有清诤之所，同志之人，心行无亏，精专惟一，亦可为之。 必要护卫洁净。 外有图本，具在别录。 赞曰： 宝丹真诀，天仙所传。 分晓金石，使无俟焉。 心行俭素，赈救为先。 精专奥妙，玄之又玄。 浩浩渺渺，莫测其源。 子若轻泄，永堕幽泉。 修炼吉辰 甲子，甲辰，乙巳，庚申，辛酉，丙午，丁巳，戊申，己酉。 右九日，可作之。 即火成，上通神仙丹灵之门。 非此日不可为。 并作法，以印印地，令百灵自感动。 此印用冬至日甲子日夜半子时刻之，将一印於丹室内埋深三尺，百神益不敢为害矣。 还丹肘后诀卷上竟 还丹肘后诀卷中",
      "translated_text": "Guard and circulate for one thousand days, when the celestial primordial darkness is complete, and the nature returns to the northern *ren* and *gui* waters—black in color, called the Great Returned Elixir.\n\nThe formula states: Take primordial black metal-water, divide it into two equal parts, and harmonize them into one body. This is likened to the moon’s upper and lower crescents, corresponding to the weight of two eights (one *jin*), aligning with yin and yang. Metal and water originate from one substance yet manifest as two forms. The black phase awaits the natural union of cinnabar and lead—yellow and white—following the principles of yin and yang, their essence undivided. Two parts are fire, one part is water. Beyond water and fire as ingredients, nothing else is added. If foreign elements intrude, the elixir will never form. Its attainment does not depend on weight. Simply ensure metal-water enters the crucible, seal it properly, and on a *four-killing* yang day at a yang hour, with the water clock’s divisions clear, when metal and water lie undifferentiated within the crucible, the direct spirit moves and transforms them—clarifying the turbid, white above and yellow below—embracing the true and holding to the One.\n\nThe formula states: Cinnabar, gold-sand, golden liquid, everlasting sand, yellow sprout, celestial lead, sand-mercury, lead-mercury, yin-yang, metal-earth-water-fire, *kan*-*li*, *qian*-*kun*, dragon-tiger, golden elixir, jade liquid, the Great Elixir of Nine Returns and Seven Reversions—all are alternate names. The ancients guarded these secrets, concealing them in myriad ways, yet for the enlightened, they converge as one without duality. The Returned Elixir has its reversion; blood-contaminated objects are forbidden. The ancients were discreet with this Way, never revealing it to those without shared purpose.\n\nFor all cultivation sites, utmost purity is essential—avoid places of death, birth, weeping, burials, graves, or impurity. Choose auspicious lands and renowned mountains, then offer sacrifices to the local earth deities and guardian spirits, maintaining morning and evening incense and lamps. Prevent all vulgar intrusions or defilement; proceed in secrecy. If in a pure and secluded place with like-minded companions—those of unblemished conduct and single-minded devotion—it may also be practiced. Strict cleanliness and protection are required.\n\nIllustrations and supplementary texts are recorded separately.\n\nIn praise:\nThe true formula of the precious elixir,\nTransmitted by celestial immortals.\nClarifying metals and minerals,\nDispelling all doubt.\nWith frugal conduct and a heart for relief,\nDevotion takes precedence.\nProfound and subtle, the mystery upon mystery—\nVast and boundless, its source unknowable.\nShould you lightly disclose it,\nYou shall forever sink into the dark springs.\n\nAuspicious days for refinement:\n*Jiazi*, *Jiachen*, *Yisi*, *Gengshen*, *Xinyou*, *Bingwu*, *Dingsi*, *Wushen*, *Jiyou*—\nthese nine days are suitable for the work.\nWhen the fire is complete, it opens the gateway to divine immortality.\nNo other days will suffice.\n\nFor the method: Seal the ground with a talisman, invoking the response of the hundred spirits. This talisman is prepared at the *zi* hour of midnight on the *jiazi* day of the winter solstice, then buried three feet deep within the elixir chamber. Thus, the hundred spirits dare not cause harm.\n\n*End of Volume One of the* Handbook of the Returned Elixir.\n*Volume Two of the* Handbook of the Returned Elixir *begins.*",
      "overlap_context": "ates: The nine crucibles correspond to nine months, each crucible requiring three. For each crucible, one must maintain the reception of darkness for two hundred seventy days, when yin and yang are both abundant. In the tenth month, earth flourishes and gives birth—hence the phrase \"mother and child parting.\" The world remains unaware.\n\nWater and fire restrain each other, mutually overcoming and becoming father and mother. They do not exceed five and eight, concealing and nurturing to take form.",
      "start_char": 8632,
      "end_char": 9284,
      "start_sentence": 435,
      "end_sentence": 469,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.814205169677734,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\还丹肘后诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "龙虎金液还丹心鉴 真诀云：只恐铅不真，丹成药自灵。 只恐汞不正，丹成药自圣。 古仙惟论铅汞二宗，不言四黄八石。 若言四黄八石者，非也。 大丹用之於五行，成之於四象，此是阴阳元黑，感通自然之道也。 如人受黑结胎，本受赤白二黑，男精白，女血赤，二黑交结，十月满足，相貌俱全，受黑若足，为人聪明强健。 受黑不足，为人愚钝衰懦。 悉相类也。 此实至理之论，学人当以思之。 何为之龙虎。 龙者，汞也，木也，火也。 虎者，铅也，银也，金公也，水也。 金生水，水生木，木生火，火生土，道在其中矣。 铅含五彩，汞吐三华，二物合璧，名日河车。 世人迷此，竭产破家。 至人悟此，升云步霞。",
      "translated_text": "*The Heart-Mirror of the Golden Liquor Dragon-Tiger Returned Elixir*\n\nThe True Oral Instructions state:\nFear only that the lead be not true—\nWhen the elixir is formed, the medicine will be numinous of itself.\nFear only that the mercury be not upright—\nWhen the elixir is formed, the medicine will be sacred of itself.\n\nThe ancient immortals spoke only of the two principles, lead and mercury,\nNever of the four yellows and eight minerals.\nThose who speak of the four yellows and eight minerals are in error.\n\nThe Great Elixir employs the Five Phases,\nIs perfected through the Four Images—\nThis is the primordial qi of yin and yang,\nThe Dao of spontaneous resonance.\n\nIt is like a human receiving qi to form the embryo:\nOriginally endowed with the two qi, red and white—\nThe man’s essence is white, the woman’s blood is red.\nWhen the two qi intermingle and conjoin,\nAfter ten months the gestation is complete,\nAnd the form and features are fully manifest.\nIf the received qi is sufficient,\nThe person will be intelligent and robust.\nIf the received qi is insufficient,\nThe person will be dull-witted and weak.\nAll is of a kind.\n\nThis is a discourse of utmost truth—\nLet the student ponder it deeply.\n\nWhat, then, are the Dragon and Tiger?\nThe Dragon is mercury, wood, and fire.\nThe Tiger is lead, silver, Metal’s Elder, and water.\nMetal engenders water, water engenders wood,\nWood engenders fire, fire engenders earth—\nThe Dao abides therein.\n\nLead contains the five colors,\nMercury emits the three splendors.\nWhen these two substances are conjoined as one,\nIt is called the River Chariot.\nThe worldly, deluded by this,\nExhaust their fortunes and ruin their families.\nThe perfected, awakened to this,\nAscend upon clouds and tread upon rosy mists.",
      "overlap_context": "complete, it opens the gateway to divine immortality.\nNo other days will suffice.\n\nFor the method: Seal the ground with a talisman, invoking the response of the hundred spirits. This talisman is prepared at the *zi* hour of midnight on the *jiazi* day of the winter solstice, then buried three feet deep within the elixir chamber. Thus, the hundred spirits dare not cause harm.\n\n*End of Volume One of the* Handbook of the Returned Elixir.\n*Volume Two of the* Handbook of the Returned Elixir *begins.*",
      "start_char": 9284,
      "end_char": 9557,
      "start_sentence": 470,
      "end_sentence": 486,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.221405982971191,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\还丹肘后诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "道之不远，目前可见。 伯阳演《易》而作《参同契》，明阴阳离坎五行之妙用。 事明而隐，学者难明。 虽知铅汞药物，火候精微，鼎炉法象，必究己心。 心者，丹之元也。 若心不契道，虽遇至人得诀，亦恐天理神明不佑，返生魔障，故言难得者人之心也。 心若合道，修之必成。 是知诚心恪志之士少也，非仙圣秘传，盖不得其人也。 陶植三篇，隐而难悟。 《金碧》、《参同》，无师岂明。 余撰《心鉴》，鉴者明也。 明照于心，常握于手，释《参同》之易象，分药数之斤两，了而会之为鉴也。 亦不敢广述多词，又恐招难究之虑。 凡古仙玄旨，本一阴一阳谓之道，阴阳不测之谓神。 神化者，化成万物也。 故《参同》云：植禾当以谷，覆鸡用其子。 类同者相从，事乖不成宝。 陶真人云：砂产於汞，金生於铅，此即真理。 同类不相杂，汞与水银别，迷人用之拙。 铅若是真，不失家臣。 汞生水银死，铅困黄芽真，此乃真说也。 古仙惟言铅汞，不说四黄八石。 学者可为明鉴，所以再三委祝，犹虑后学之人，迷迷相俟。 所名还丹者，还其元丹之色，故曰还丹。 但伏火候，不失其本体之元，号曰还丹。 所言九转者，乃九九易其铅之元气，铅非九炼而成也。 凡灵丹至药，全是阴阳化黑而成，非用他药，杂入于中，纯用方真。 须得真铅之精黑。 若不认真铅，永无成理。 且真铅不变色，真汞有神力。 古仙之言，不可不明也。 黑铅入火，悉为灰烬。 盖为其问真物被销化去矣，为失其元黑。 若将此废残之物，合汞修之，焉得成至药乎。 此说是荡涤凡蒙，显露真奥。 有道眼者，闻余此说，可为醉得冻浆，昏逢朗月，精穷圣典，毋惑灵文，可与神仙共倡，岂不至神仙之境也。 愚者闻之，狐疑不信，故不合与之言也。 仙经云：还丹之妙，在乎三一。 龙虎之英，天地之精。 不用别药，惟用五行。 此至人之言也。 后人得者，不亏古贤之言，不达古贤之法象。 法象者，是天地之本，本立而道生，天地与人为三才，可陕总持造化，运动阴阳，在乎三要，事可忘乎。 失之毫厘，天地悬隔，言何容易哉。 指真诀云：丹砂，太阳之精，本受南方之正黑，得阴阳水火制度，乃居青帝之首，为汞之名，是生于火，自含德而至灵。 铅者，北方黑水之精，化归西方庚辛之金，是以金生水，水生木，二物自相匹配，若非至灵至圣，何以为之神丹乎。 世俗凡庸，岂信此至真之道。 余尝悯之，自古真人皆修炼此神药饵之，故得形神俱妙，与道合真，岂有不信者哉，多指秦皇、汉武为喻。 然大丹之灵，不救自刑之祸。 昔刘玄穆事魏先生，看炉一年，妄情有疑，遂自退而不遇，以致夭丧。 余景休即勤心精德，奉师不息，乃得神丹，饵之而仙，今在太白山仙洞，一千余载，常游人市。 二子者疑与不疑耳，咫尺万里，得与不得，泥途云霄。 且五谷尚能养人之命，况神药之灵乎。 自是世人福薄绿浅，故所不信不遇不修，乃虚生浪死，沉沦多劫。 世人惟贪荣显利禄，沉迷酒色，恩爱牵缠，形枯神丧，犹尚不知，日夜忧思，何有厌足，贵贱富贫，悉皆如此。 见说修真而生谤毁，又何得神仙之道－哉。 不欲广陈。 近代谢冲玄、苏耽二子，并饵金丹而仙，世皆知之。",
      "translated_text": "The Dao is not far—it may be seen before one’s eyes.\nBo Yang expounded the *Yi* and composed the *Cantong Qi*,\nIlluminating the wondrous workings of yin-yang, li-k’an, and the Five Phases.\nThough its matters are plain, they remain hidden;\nScholars find them hard to grasp.\nEven those who know of lead and mercury, medicinal substances,\nThe subtleties of fire-times, the crucible and furnace, and their symbolic forms,\nMust delve into their own minds.\nThe mind is the origin of the elixir.\nIf the mind does not accord with the Dao,\nEven should one encounter a perfected master and receive the oral transmission,\nHe may yet fear that Heaven’s principle and the numinous spirits will not protect him,\nAnd instead invite demonic obstructions.\nThus it is said: what is hardest to attain is the human mind.\nIf the mind harmonizes with the Dao, cultivation will surely succeed.\nFew are those of sincere heart and reverent resolve—\nIt is not that the immortals and sages keep secrets,\nBut that they do not find the right person.\nThe three chapters of Tao Hongjing remain obscure and difficult to fathom.\nThe *Jinbi* and *Cantong Qi*—without a teacher, how can they be understood?\nI have composed the *Xinjian*—*jian* means “to illumine.”\nIllumined and reflected in the mind, ever held in hand,\nIt explains the *Cantong Qi*’s symbolic images,\nDifferentiates the weights and measures of medicinal substances,\nAnd clarifies them into a mirror.\nYet I dare not expound at length,\nLest I invite the burden of endless scrutiny.\n\nThe arcane principles of the ancient immortals all return to this:\nOne yin and one yang are called the Dao;\nThat which is unfathomable in yin and yang is called the numinous.\nThe numinous transforms and gives rise to the myriad things.\nThus the *Cantong Qi* states:\n“Plant grain with grain,\nHatch a chicken with its egg.”\nLike attracts like;\nDeviate, and the treasure will not form.\nMaster Tao said:\n“Cinnabar is born of mercury,\nGold is born of lead”—\nThis is true principle.\nLike does not mix with unlike;\nMercury and quicksilver are distinct—\nThe deluded use them clumsily.\nIf lead is genuine,\nIt will not lose its ministerial essence.\nMercury lives, quicksilver dies;\nLead, when refined, becomes true yellow sprout—\nThis is the true teaching.\nThe ancient immortals spoke only of lead and mercury,\nNever of the Four Yellows or Eight Stones.\nLet scholars take this as a clear mirror.\nThus I reiterate and exhort again and again,\nYet still fear that later learners will remain mired in confusion.\nThe so-called Returned Elixir\nReturns to the original color of the primordial elixir—\nHence it is called the Returned Elixir.\nSimply master the fire-times,\nAnd do not lose the original essence of its fundamental body—\nThis is called the Returned Elixir.\nThe “nine revolutions” refer to the ninefold transformation of lead’s primordial qi;\nLead is not refined nine times to completion.\nAll divine elixirs and supreme medicines\nAre formed solely through the transformation of yin and yang’s qi,\nWithout the admixture of other substances—\nThey are purely and truly constituted.\nOne must obtain the true essence-qi of genuine lead.\nWithout recognizing true lead,\nThere can be no success in principle.\nMoreover, true lead does not change color,\nAnd true mercury possesses numinous power.\nThe words of the ancient immortals must not be left obscure.\nWhen base lead enters the fire,\nIt is reduced entirely to ashes—\nFor its true essence has been consumed and lost,\nAnd its primordial qi dissipated.\nIf one takes this spent and ruined substance\nAnd compounds it with mercury,\nHow can a supreme medicine be formed?\nThis teaching sweeps away the dust of the vulgar and ignorant,\nRevealing the true mystery.\nThose with the eye of Dao\nWill hear these words of mine\nAs one parched receives icy water,\nOr one benighted meets the bright moon.\nThey will penetrate the sacred canon,\nNo longer bewildered by numinous texts,\nAnd may join the immortals in song—\nHow could they not attain the realm of the immortals?\nThe foolish, hearing this,\nWill doubt and disbelieve—\nIt is not fitting to speak of such things with them.\n\nThe immortal scriptures say:\n“The wonder of the Returned Elixir lies in the Three-in-One.\nThe essence of Dragon and Tiger is the essence of Heaven and Earth.\nNo other medicines are used—\nOnly the Five Phases.”\nThese are the words of the perfected.\nThose who attain this afterward\nDo not betray the words of the ancient worthies,\nNor fail to grasp their symbolic forms.\nThe symbolic forms are the root of Heaven and Earth;\nWhen the root is established, the Dao arises.\nHeaven, Earth, and Humanity are the Three Powers—\nHow can one narrowly cling to the workings of creation,\nThe movement of yin and yang,\nWithout attending to the Three Essentials?\nLose it by a hair’s breadth,\nAnd Heaven and Earth become as distant as sky and abyss—\nHow can such words be spoken lightly?\nThe true oral transmission states:\n“Cinnabar is the essence of the Great Yang,\nOriginally receiving the true qi of the South,\nGoverned by the regulations of yin-yang water and fire.\nIt resides at the head of the Azure Emperor,\nAnd is called mercury—\nBorn of fire,\nIt inherently possesses virtue and reaches the numinous.\nLead is the essence of the Black Water of the North,\nTransformed and returning to the Metal of the West’s geng and xin.\nThus Metal engenders Water, Water engenders Wood—\nThese two substances naturally match each other.\nWere they not supremely numinous and sagely,\nHow could they form the divine elixir?”\nThe vulgar and common of the world\nHow could they believe in this most true Dao?\nI have long pitied them.\nSince ancient times, all true persons have refined and ingested this divine medicine,\nThus attaining wondrous union of form and spirit,\nAnd merging with the Dao in truth.\nHow could there be any who do not believe?\nMany cite the First Emperor of Qin and Emperor Wu of Han as examples.\nYet the numinous power of the Great Elixir\nCannot save one from the calamity of self-inflicted harm.\nFormerly, Liu Xuanyu served Master Wei,\nTending the furnace for a year,\nBut his idle thoughts gave rise to doubt,\nAnd he withdrew without attaining the Way,\nMeeting an early death.\nYu Jingxiu, by contrast,\nDiligently cultivated his mind and perfected his virtue,\nServing his teacher without cease,\nAnd obtained the divine elixir.\nAfter ingesting it, he became an immortal,\nAnd now dwells in the immortal cave of Mount Taibai,\nHaving passed over a thousand years,\nYet still wanders the markets of men.\nThese two—one doubted, one did not—\nThe difference between them is as vast as a foot and a thousand miles,\nBetween attainment and non-attainment,\nBetween muddy paths and cloudy skies.\nEven the Five Grains can sustain human life—\nHow much more the numinous power of the divine medicine?\nYet people of the world are shallow in blessing and karma,\nThus they do not believe, do not encounter, do not cultivate,\nLiving in vain and dying in delusion,\nSinking through countless kalpas.\nPeople of the world are only greedy for glory, fame, and profit,\nBewitched by wine and sensuality,\nEntangled in love and attachment,\nTheir forms withered and spirits lost,\nYet still they do not awaken.\nDay and night they fret and worry—\nWhen will they ever be satisfied?\nNoble and base, rich and poor—\nAll are the same.\nHearing of the cultivation of truth, they slander and revile it—\nHow then could they attain the Dao of the immortals?\nI do not wish to expound further.\n\nIn recent times, Xie Chongxuan and Su Dan—\nBoth ingested the Golden Elixir and became immortals,\nAs the world well knows.",
      "overlap_context": "gon is mercury, wood, and fire.\nThe Tiger is lead, silver, Metal’s Elder, and water.\nMetal engenders water, water engenders wood,\nWood engenders fire, fire engenders earth—\nThe Dao abides therein.\n\nLead contains the five colors,\nMercury emits the three splendors.\nWhen these two substances are conjoined as one,\nIt is called the River Chariot.\nThe worldly, deluded by this,\nExhaust their fortunes and ruin their families.\nThe perfected, awakened to this,\nAscend upon clouds and tread upon rosy mists.",
      "start_char": 9557,
      "end_char": 10765,
      "start_sentence": 487,
      "end_sentence": 544,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.63448166847229,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\还丹肘后诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "况得之士，多混迩人问，和光同尘，人岂识之。 《参同》云：金以砂为主。 禀和於水银。 变化由其真，终始自相因，二物自含孕也。 又云：不用药，用五行。 又云：天生芽，自然体。 又云：白马牙，真丹砂，卯酉二八和两家。 又云：淮南炼秋石，黄帝美金华。 又云：芽不是铅，铅不是芽。 真铅真丹砂，二物玄旨也。 伏炼一家。 巡火近九转，自然成黄芽。 又云：火化白，药化红，灵砂秋石自相同。 又云：孤阴不独化，寡阳不可成。 本来清诤质，自有变通灵。 又云：龙虎相逢遇，何时不相顾。 白液共相吞，相吞为夫妇。 随变成黄芽，逐时依后土。 若了紫河车，自然升天涯。 又云：神丹修得诀，神用便由人。 生煞在我手，参详在伪真。 又云：修丹不得诀，终岁损心神。 莫炼枯铅汞，抛功似土尘。 又云：天地日月中，灵药号金公。 金公不是铅，本向铅裹蒙。 分明向君说，迷者又匆匆。 点汞安铅裹，金华意略同。 此华不是药，徒自枉抛功。 此事神仙说，何曾不大通。 细看《参同契》，仍依五类融。 但觅直铅汞，修之可见功。 又云：铅汞合天地，修作大还丹。 丹成自见宝，非此实为难。 太古真人说，如今达者惶。 方知真切意，须契道将安。 其中有五彩，灵变伏其盘。 十月脱胎去，令人见者欢。 为报荣华子，百年凋与残。 如何空弃世，兀兀道情宽。 细说君犹谤，灵词理更馒。 嗟见南北尘，积年为丘山。 茫茫苦海中，生死成波澜。 自古帝王居，而今何足看。 又云：白液炉中化，黄芽变渐成。 忆初相见日，难觅水银形。 阳极生阴火，火衰阳黑并。 自然变黄芽，服食乃长生。 一个月白液，初凝却如雪。 两个月状似，融苏渐渐结。 三个月半含，药绽垂珠劣。 四个月二物，抱持如点血。 五个月飞腾，恋母声呜咽。 六个月行到，紫宫阳气绝。 七个月乘阴，受黑手足厥。 八个月欲成，脏腑含凝血。 九个月点点，成珠长毛发。 十个月母子，分离欲相别。 此时母困子体全，已见肌容变白雪。 铅脱胞后，铅白如雪。 更看炉中温养之，兼为全体肌容悦，出儿毒黑当依诀。 经云：此药如子在母胎精中，爽朗分肌骨，有次第，莫亏越，但知修得黄芽，成变转之功，无休绝，饵长生，换白发，有白银，济贫乏。 仁者得之终不辍，与道契宿绿深。 传若得人，须在心。",
      "translated_text": "Moreover, those who attain it often mingle among common folk, blending their light with the dust—how could others recognize them?\n\nThe *Cantong Qi* states:\n*\"Gold takes cinnabar as its master,\nReceiving harmony from mercury.\nTransformation arises from its truth,\nBeginning and end naturally follow,\nThe two substances conceiving of themselves.\"*\n\nIt further says:\n*\"Do not use mere herbs—employ the Five Phases.\"*\nAnd:\n*\"Heaven engenders the sprout,\nIts body naturally formed.\"*\nAnd:\n*\"White Horse’s Teeth, true cinnabar,\nMao and You, the two eights, harmonize the two families.\"*\nAnd:\n*\"Huainan refines autumn stone,\nThe Yellow Emperor cherishes golden blossoms.\"*\nAnd:\n*\"The sprout is not lead,\nLead is not the sprout.\nTrue lead, true cinnabar—\nThese two hold the profound essence.\nRefined as one household,\nCirculating fire nears the ninth revolution,\nNaturally forming the yellow sprout.\"*\n\nIt also says:\n*\"Fire transforms to white,\nThe medicine turns to red,\nDivine cinnabar and autumn stone unite of themselves.\"*\nAnd:\n*\"Solitary yin cannot transform alone,\nLone yang cannot achieve completion.\nTheir original pure and limpid essence\nPossesses a numinous power of change.\"*\nAnd:\n*\"Dragon and tiger meet—\nWhen do they not attend each other?\nWhite liquid and the other swallow one another,\nSwallowing as husband and wife.\nFollowing change, they form the yellow sprout,\nProceeding in time to rely on the earth.\"*\nAnd:\n*\"If you comprehend the Purple River Chariot,\nYou will naturally ascend to the edge of heaven.\"*\nAnd:\n*\"Once the divine elixir’s method is mastered,\nIts spiritual use lies in your hands.\nLife and death rest in my grasp—\nDiscernment lies in distinguishing false from true.\"*\nAnd:\n*\"Without the elixir’s method,\nYears of effort waste the heart and spirit.\nDo not refine withered lead and mercury,\nLest your work scatter like dust.\"*\n\nIt further states:\n*\"Within heaven, earth, sun, and moon,\nThe numinous medicine is called Metal Lord.\nThe Metal Lord is not lead—\nIt is originally concealed within lead.\nI speak plainly to you,\nYet the deluded rush past in haste.\nMercury is fixed within lead,\nThe golden blossom’s intent is roughly the same.\nThis blossom is no mere herb—\nTo refine it is to waste effort in vain.\"*\nAnd:\n*\"This matter is spoken by immortals—\nHow could it not be profoundly clear?\nStudy the *Cantong Qi* closely,\nAnd still rely on the Five Categories’ fusion.\nSeek only true lead and mercury—\nCultivate them, and you will see results.\"*\n\nIt also says:\n*\"Lead and mercury unite heaven and earth,\nRefined to make the Great Return Elixir.\nWhen the elixir is complete, treasures appear of themselves—\nWithout this, success is truly difficult.\nThe Perfected of Great Antiquity spoke thus,\nYet even the wise of today are perplexed.\nOnly when you grasp the true and essential meaning\nCan you align with the Dao and find peace.\nWithin it lies fivefold radiance,\nSpiritual transformations subduing its vessel.\nAfter ten months, the embryo is shed—\nThose who witness it rejoice.\nI report to the seekers of glory:\nA hundred years wither and decay.\nWhy idly abandon the world,\nDull and content in the Dao’s embrace?\nThough I explain in detail, you still slander,\nThe numinous words’ principle grows ever more obscure.\nAlas! Behold the dust of north and south,\nPiled over years into mountains and hills.\nAmidst the boundless bitter sea,\nBirth and death churn like waves.\nSince ancient times, even emperors dwelled here—\nWhat is there to admire now?\"*\n\nIt further says:\n*\"The white liquid transforms within the furnace,\nThe yellow sprout gradually forms.\nRecall the first day they met—\nMercury’s form was hard to find.\nWhen yang reaches its extreme, yin fire arises,\nWhen fire declines, yang and black merge.\nNaturally, the yellow sprout changes—\nIngest it, and you attain long life.\nIn one month, the white liquid\nFirst congeals, like snow.\nIn two months, it resembles\nSoftened wax, slowly solidifying.\nIn three months, half-contained,\nThe medicine splits, dangling like flawed pearls.\nIn four months, the two substances\nEmbrace, like drops of blood.\nIn five months, it soars,\nYearning for its mother with mournful cries.\nIn six months, it arrives—\nThe yang qi of the Purple Palace is cut off.\nIn seven months, riding yin,\nIt receives blackness, hands and feet growing numb.\nIn eight months, nearing completion,\nThe viscera hold congealed blood.\nIn nine months, drop by drop,\nPearls form, hair grows long.\nIn ten months, mother and child\nPart, about to separate.\nAt this time, the mother is exhausted, the child’s body whole—\nAlready, the flesh and complexion turn white as snow.\nAfter the lead sheds its womb,\nThe lead is white as snow.\nObserve its gentle nurturing in the furnace,\nAnd the child’s entire body becomes radiant.\nExpel the child’s black poison as the method instructs.\"*\n\nThe Classic says:\n*\"This medicine is like a child in the mother’s womb,\nBright and clear, distinguishing flesh and bone,\nFollowing a sequence—do not transgress it.\nSimply know how to cultivate the yellow sprout,\nAchieving the power of transformation,\nWithout cessation.\nIngest it to attain long life,\nTurn white hair black,\nPossess silver’s whiteness,\nRelieve poverty and want.\nThe benevolent who obtain it never cease—\nTheir affinity with the Dao runs deep.\nIf you transmit it to the right person,\nIt must reside in the heart.\"*",
      "overlap_context": "ity,\nEntangled in love and attachment,\nTheir forms withered and spirits lost,\nYet still they do not awaken.\nDay and night they fret and worry—\nWhen will they ever be satisfied?\nNoble and base, rich and poor—\nAll are the same.\nHearing of the cultivation of truth, they slander and revile it—\nHow then could they attain the Dao of the immortals?\nI do not wish to expound further.\n\nIn recent times, Xie Chongxuan and Su Dan—\nBoth ingested the Golden Elixir and became immortals,\nAs the world well knows.",
      "start_char": 10765,
      "end_char": 11628,
      "start_sentence": 545,
      "end_sentence": 607,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.000361442565918,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\还丹肘后诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "非道者罪愆深，得亦为灾祸自侵。 关造化不容易，不可取次轻相示。 不见古人有诚词，妄有传之殃祖补。 君须信，不在疑，贤者通明须得之。 今日祝君千万意，历历设盟当戒之。 阳起复阴起，娠炉寄中央戊己土鼎。 上下互相，辏保守固之，勿令走消息。 不失看节候。 有龙有虎相奔骤，婴儿寂寂颜如幼。 犹母养之，母体瘦子成，母困长相救。 阳极乾，阴极坤，四象五行易之门，六十四卦遁中尊，龙虎相啖复相吞，立其定位此中存。 水火为媒拘我魂，阴阳育我明晨昏。 八节运移寒与温，看看渐变黄芽根。 日月相催感母恩，因之结实立真门。 千秋万岁生子孙，审藏神法慎勿言。 此道玄微不可论，世人笑道浑浊昏。 莫将神药示凡人，见之生谤言语喧。 君切记，勿妄示，慎而藏之置金柜。 长生之道传贤哲，自有天官录名字。 饵还丹应候歌 夫拟服还丹兮，澡心炼黑。 清斋省躬兮，存真息念。 司命灵兮，降鉴斜录。 司药童子兮，察人虔恭。 不可轻慢兮，毋生懈怠。 宜须审细兮，方其灵感。 或喉中温痒兮，热而欲闷绝。 或口中腥臭兮，如腐肉之在中。 是心府开兮，逐滞邪之黑。 都被赴出兮，有此神功。 热炙甘草兮，含津咽五日。 五神自爽兮，真黑皆和融。 或腰脐下兮，停滞恶物。 或腹呜吼兮，泻下诸虫。 或出血块兮，如紫葵汁。 又如蚌蟆兮，或涎或脓。 宿食在胃兮，时时郁闷。 食引欲吐兮，心闷冲冲。 呕吐宿水兮，饮食不进。 并是宿疾兮，被神药而攻。 待至苦肌兮，多煎甘草饮。 至半碗兮，汤味须浓。 四肢拘急兮，或多燥闷。 欲发狂乱兮，或致昏蒙。 忽然怕怖兮，精神恍惚。 或心不安兮，情意憧憧。 或梦坠堕兮，高山大石。 或梦军阵兮，人马相逢。 或梦恶人兮，名状论诉。 或梦逢见兮，虎豹蛇虫。 或梦亲爱兮，死亡离别。 或梦恶人兮，擒捉追踪。 或梦哭泣兮，冤家伤害。 并是尸鬼兮，欲离身中。 觉有此候兮，切须消息。 宜节喜怒兮，勿恣心胸。 三尸若去兮，少人我思虑。 举动纯和兮，体貌温恭。 心意安稳兮，世情疏薄。 嗜欲自断兮，德合上穹。 或喉额问兮，微有少痛。 咽物闷涩兮，热痒重重。 或小便兮，青黄紫汁。 或痢泄兮，脓血死虫。 并是远年兮，风劳之气。 百疾消除兮，方见神功。 或生疮痉兮，齿根出血。 此是攻去兮，皮骨之风。 觉四肢劳困兮，是药力之所及。 四肢滑腻兮，乃药气之内融。 但有宿疾兮，并皆发散。 积聚毒黑兮，痕瘢黑红。 此乃毒黑兮，分明散去。 黑蒸肌骨兮，目明耳聪。 目开耳动兮，血腥在口。 为换毂齿兮，药力方隆。 毛发生长兮，体轻身健。 肌骨清和兮，改变凡容。 服食一年兮，万黑齐旺。 服经二年兮，血脉大通。 服经三载兮，筋骨坚壮。 髓实朱筋兮，颜似婴童。 大小二便兮，都无秽气。 手足轻举兮，肠化如筋。 寒暑不侵兮，兵刃不害。 入水不溺兮，入火如空。 齿落重生兮，发白再黑。 身似欲飞兮，行步如风。 不饥不渴兮，五谷自断。 不寒不暑兮，透出凡笼。 千邪百怪兮，皆不敢近。 山川鬼神兮，朝礼敬恭。 五十以下兮，服经一岁。 二十七八兮，稚子春容。 五十以上兮，服经二载。 如六十七八兮，朱颜再红。 出九阴之表兮，为纯阳之质。 长生久视兮，天地齐同。 若欲升举兮，一年断谷。",
      "translated_text": "Those who lack the Dao incur profound transgressions;\nEven if obtained, calamity and misfortune will assail them.\nThe workings of creation are not easily grasped—\nDo not casually reveal them to others.\nHave you not seen the solemn oaths of the ancients?\nTo recklessly transmit this invites ancestral retribution.\nYou must believe without doubt,\nFor only the wise and enlightened may receive it.\nToday, I pledge to you with utmost sincerity—\nLet every vow be solemnly observed.\n\nWhen yang arises, yin follows;\nThe embryo’s furnace rests in the central earth of wu-ji’s crucible.\nAbove and below, they mutually converge and guard,\nFirmly preserving the subtle balance—\nNever let the breath of life escape.\nAttend closely to the seasons and signs.\nDragon and tiger race and chase,\nWhile the infant lies serene, its countenance youthful.\nAs the mother nurtures, her body grows lean while the child matures;\nWhen the mother falters, the child sustains her.\n\nYang culminates in qian, yin in kun—\nThe Four Symbols and Five Phases are the gateway of the *Yi*,\nThe sixty-four hexagrams hold the honored place within the Recluse.\nDragon and tiger devour and swallow one another,\nYet their fixed positions abide within this.\nWater and fire serve as mediators to bind my soul,\nYin and yang nurture me through dawn and dusk.\nThe eight nodes shift between cold and warmth—\nGradually, the root of the yellow sprout transforms.\nSun and moon urge one another, moved by the mother’s grace,\nThereby forming the fruit and establishing the true gate.\nFor a thousand autumns and ten thousand years, it begets descendants;\nGuard the method of concealing the spirit—speak of it with utmost care.\n\nThis Dao is subtle and profound, beyond discourse;\nThe world scorns it, lost in turbid confusion.\nDo not show the divine medicine to the unworthy,\nFor they will slander it with clamorous words.\nRemember this well—do not recklessly reveal it;\nStore it securely in a golden casket.\nThe Way of long life is transmitted to the worthy and wise—\nHeaven’s officials will record their names.\n\n**Song of Ingesting the Returned Elixir**\n\nTo ingest the returned elixir,\nPurify the heart and refine the black.\nObserve fasting, examine the self,\nPreserve the true and still the thoughts.\nThe spirit of the Controller of Fate descends to witness and record;\nThe youthful attendant of the medicine observes one’s reverence.\nDo not treat it lightly or grow lax—\nProceed with meticulous care to invoke its numinous response.\n\nAt times, the throat may feel warm and itchy,\nHot and on the verge of suffocation.\nOr the mouth may taste foul,\nAs if putrid flesh lies within.\nThis is the heart’s palace opening,\nExpelling stagnant blackness and evil.\nAll is drawn forth—\nSuch is the divine efficacy.\n\nSoothe with roasted licorice,\nHolding the liquid in the mouth and swallowing for five days.\nThe five spirits will become clear,\nAnd the true blackness will harmonize and dissolve.\n\nAt times, foul matter may lodge below the waist and navel,\nOr the abdomen may rumble and roar,\nExpelling various worms.\nOr blood clots may emerge,\nLike purple mallow juice,\nOr like toads—\nNow phlegm, now pus.\nLong-standing food stagnates in the stomach,\nCausing frequent oppression.\nThe urge to vomit arises,\nThe heart feels stifled and surging.\nOne may retch up stale water,\nUnable to take food or drink.\nAll these are old ailments—\nAssailed by the divine medicine.\n\nWhen the suffering in the flesh peaks,\nBrew a strong decoction of licorice,\nHalf a bowl in volume,\nThe broth rich in flavor.\nThe limbs may grow stiff and tense,\nOr one may feel parched and stifled.\nThe urge to rave and lose control may arise,\nOr one may fall into confusion.\nSuddenly seized by fear,\nThe spirit wanders in disarray.\nThe heart may feel unsettled,\nThe mind restless and distracted.\nOne may dream of falling\nFrom lofty mountains and towering rocks,\nOr of armies clashing,\nMen and horses locked in battle.\nOr of encountering evil men,\nEngaged in disputes and lawsuits.\nOr of meeting\nTigers, leopards, snakes, and insects.\nOr of beloved ones\nDying and parting in sorrow.\nOr of wicked men\nPursuing and seizing one.\nOr of weeping and wailing,\nWronged by enemies.\nAll these are the corpses and ghosts\nSeeking to depart the body.\nWhen such signs appear,\nTake heed and adjust accordingly.\nRegulate joy and anger,\nDo not indulge the heart’s desires.\n\nWhen the Three Corpses depart,\nFewer thoughts of self and others arise.\nMovements become pure and harmonious,\nDemeanor gentle and respectful.\nThe heart finds peace,\nWorldly attachments grow thin.\nDesires sever themselves,\nVirtue aligns with the celestial vault.\n\nAt times, the throat or forehead may ache slightly,\nSwallowing may feel stifled and rough,\nWith layer upon layer of heat and itching.\nOr the urine may appear\nBlue, yellow, or purple.\nOr one may suffer from dysentery,\nExpelling pus, blood, and dead worms.\nAll these are the winds and consumptive qi\nOf long-standing ailments.\nWhen a hundred illnesses vanish,\nThe divine efficacy becomes evident.\n\nAt times, sores or convulsions may appear,\nOr the gums may bleed.\nThis is the expulsion\nOf wind from skin and bone.\nWhen the limbs feel weary and strained,\nIt is the medicine’s power at work.\nWhen the limbs grow smooth and supple,\nIt is the medicine’s qi fusing within.\n\nAll old ailments will surface,\nAccumulations and toxins—black and foul—\nScars and blemishes, black and red.\nThese are the toxins and blackness\nClearly dispersing.\nAs the blackness steams through flesh and bone,\nThe eyes brighten and the ears sharpen.\nThe eyes open, the ears stir,\nA bloody taste lingers in the mouth.\nThe teeth are renewed,\nThe medicine’s power now ascendant.\nHair grows long,\nThe body light and strong.\nFlesh and bone become pure and harmonious,\nTransforming the mortal countenance.\n\nAfter one year of ingestion,\nA myriad blacknesses flourish.\nAfter two years,\nThe blood and vessels flow freely.\nAfter three years,\nSinews and bones grow firm and robust.\nThe marrow fills, the red sinews thrive,\nThe complexion resembles that of a child.\nBoth major and minor eliminations\nAre free of foul odors.\nThe hands and feet move lightly,\nThe intestines transform like sinew.\nUnaffected by cold or heat,\nUnscathed by blades or weapons.\nEntering water, one does not drown;\nEntering fire, one is as if in emptiness.\nTeeth that fell regrow,\nWhite hair turns black again.\nThe body seems poised to fly,\nSteps swift as the wind.\nNeither hunger nor thirst,\nThe five grains are naturally forsaken.\nNeither cold nor heat,\nOne transcends the mortal cage.\nA thousand evils and a hundred perils\nDare not approach.\nMountains and rivers, ghosts and spirits\nPay homage with reverence.\n\nIf under fifty,\nOne year of ingestion suffices.\nAt twenty-seven or twenty-eight,\nOne regains the springtime glow of youth.\nIf over fifty,\nTwo years of ingestion are needed.\nAt sixty-seven or sixty-eight,\nThe rosy complexion returns.\nEmerging beyond the nine yin,\nOne becomes a being of pure yang.\nLong life and eternal vision—\nOne’s years equal those of heaven and earth.\nShould one wish to ascend,\nA year of grain abstention will suffice.",
      "overlap_context": "cine is like a child in the mother’s womb,\nBright and clear, distinguishing flesh and bone,\nFollowing a sequence—do not transgress it.\nSimply know how to cultivate the yellow sprout,\nAchieving the power of transformation,\nWithout cessation.\nIngest it to attain long life,\nTurn white hair black,\nPossess silver’s whiteness,\nRelieve poverty and want.\nThe benevolent who obtain it never cease—\nTheir affinity with the Dao runs deep.\nIf you transmit it to the right person,\nIt must reside in the heart.\"*",
      "start_char": 11628,
      "end_char": 12843,
      "start_sentence": 608,
      "end_sentence": 706,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.97010016441345,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\还丹肘后诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "服满一剂兮，便获飞空。 未欲上升兮，且作地仙。 而隐清斋一日兮，饵剂之功。 可以畜妻子兮，住世居官。 任意无所禁兮，和光同尘。 后欲上升兮，清斋更服半剂。 驾云乘鹤兮，白日登空。 欲点五金兮，并化为宝。 鸡餐成凤兮，犬饵成龙。 指真秘诀 阴真君云：金丹之道百数，其要在神水华池，河车伏汞。 达者得之，飞丹炼石，千百余方，大丹之要，不出乎《金碧》、《参同》二书。 但能精修铅汞，伏火成丹，便是大还，至妙无可加矣。 ．只要认得真铅汞，即伏得丹砂也。 若非真种，类万无可成。 学者必须广寻师指，不耻下问，方希觊。 如或心高气强，自执一方，至老无成。 古歌云：白汞生丹砂，黑铅化黄芽。 其终数九九，变化在三华。 修到紫阳宫，黄金无处夸。 但得金公合，修成金液砂。 如未至此之至妙，但得伏火成丹，便是长生至药。 又云：然自用铅，不得令铅居汞内，须礼尽其铅。 去尽祖然后可修事服食，此是妙用，为黄芽之道也。 且草药黄精，尚能延驻年命，野葛多食，必致杀人。 岂不目击，何不信有长生之道耶，只是世人福绿浅薄也。 经云：龙虎相投，还丹可求。 神仙之道，不示凡流。 乃知大丹之妙，不离于真铅真汞，神符白雪也。 还丹肘徒诀卷中竟 还丹肘后诀卷下 玄迪秘奥 凡炼金液神丹者，须要洞晓阴阳，深达造化，明五行相克之幽微，识金水相生之妙理，采先天之一，用作丹基，会乾坤为鼎器，以坎离为药材。 夫坎离者J 日月也。 日象者，阳含阴也。 日中有乌，卦主於离，外阳而内阴也。 砂中有木之一，青龙之位也。 五行颠倒术，龙从火里出，父之精也。 月象者，阴含阳也。 月中有兔，卦主．於坎，外阴而内阳也。 铅中有金之一，白虎之位也。 五行不顺行，虎向水中生，母之血也。 父精是真汞，母血是真铅，真铅生在黑铅中，真汞产於朱砂内，二物为真阴真阳也。 真阴乃离中汞，真阳乃坎中铅。 故云：日精若与月华合，自有真铅出世来。 若得真铅，是为丹之祖也。 真铅便是丹之祖，何必区区炼铅母。 炼铅非炼石中铅，自有天铅波里取。 铅为芽母，芽为铅子。 若得金花，舍铅不使。 转转自相因，一子别一子。 若能转制汞，万变与千通，世问无比类。 学人多以五金八石，草木灰霜，皆为俟用也。 夫五金八石，乃天地之后生，有质之物，不与水银同体。 夫水银者，天元之秀，日月之精华，不与世之五金八石，草木灰霜同体。 故云：有质不堪为伴倡，无质生质是还丹。 又云； 水银一味仙家禄，自古流传伏火难。 若遇河车成紫粉，紫粉一时化金丹。 夫金丹者，央炼鼎器，非五金八石磁土为之。 夫鼎者，乃以鼎其鼎。 夫药者，乃以药其药。 鼎药者，本一也。 故云：鼎鼎元无鼎，药药元无药。 黄芽不是铅，不离铅中作。 又用铅不得用凡铅，用了真铅也弃捐。 若舍其铅，如弃父母，而求子也。 若用其铅，离铅万里。 不用其铅，从何而起。 既得金华入腹中，还是舍铅终不使。 红铅黑铅大丹头，将红入黑是真修。 红取精兮黑取髓，便是还丹真妙理。 红铅离卦，黑铅坎卦，若把坎离二卦撮於鼎中，采一日之火候，夺造化之千年，都来片饷工夫，永得真铅至宝。 水银死者为铅，活者为汞，此自相制伏也。",
      "translated_text": "Upon completing one full dose, one gains the power to soar through the void.\nShould ascension not yet be desired, one may remain as an earthbound immortal.\nBy maintaining a day of pure fasting, the efficacy of the elixir endures.\nOne may then raise a family, dwell in the world, or hold office—\nUnrestrained in all endeavors, harmonizing with the dust of the mundane.\nWhen later wishing to ascend, a further half-dose after fasting will suffice.\nRiding clouds astride a crane, one ascends in broad daylight.\nTo transmute the five metals, all become treasure.\nA chicken fed the elixir becomes a phoenix; a dog, a dragon.\n\n**Secret Essentials of the True Teachings**\nLord Yin the True declares: Among the hundreds of methods of the Golden Elixir, the crux lies in the divine water of the Flowery Pond and the river chariot’s sublimation of mercury. Those who attain this may refine cinnabar and transmute stones—though among a thousand methods, the essence of the Great Elixir is found only in the *Book of the Golden Splendor* and the *Triplex Unity*. Simply mastering the refinement of lead and mercury to congeal the elixir is the Great Return, a perfection beyond further refinement.\n\nOne must recognize true lead and mercury—only then can cinnabar be sublimed. Without the true seed, all efforts are in vain. Seekers must diligently seek a master’s guidance, humbly inquiring without shame, to harbor even a glimmer of hope. Those who are arrogant or obstinate, clinging to a single method, will labor in vain until old age.\n\nAn ancient song says:\nWhite mercury births cinnabar,\nBlack lead transforms into the yellow sprout.\nIts end lies in nine nines,\nIts transformations in the Three Flowers.\nRefined to the Purple Yang Palace,\nEven gold has no boast left.\nBut when the Golden Duke unites,\nThe golden liquid cinnabar is achieved.\n\nBefore attaining this supreme perfection, merely congealing the elixir through fire-subduing is the supreme medicine of longevity.\n\nIt is further said: When using lead, do not let it dwell within mercury; one must reverently exhaust its essence. Only after discarding the ancestral lead may one proceed to refine and ingest the elixir—this is the subtle application, the Way of the Yellow Sprout.\n\nEven the herb Solomon’s seal can prolong life, while excessive wolfsbane inevitably kills. Are these not witnessed with one’s own eyes? Why then doubt the Way of longevity? It is only that the world’s people are shallow in fortune and blessings.\n\nThe scriptures say: When dragon and tiger unite, the Returned Elixir may be sought. The Way of immortals is not revealed to the common crowd. Thus, the wonder of the Great Elixir lies not beyond true lead, true mercury, the divine talisman, and the white snow.\n\n**Conclusion of the Middle Scroll of *The Oral Instructions for the Returned Elixir After Attainment***\n**Beginning of the Lower Scroll of *The Oral Instructions for the Returned Elixir After Attainment***\n**Profound Secrets of the Mysterious Path**\n\nFor those refining the divine elixir of golden liquid, one must thoroughly comprehend yin and yang, deeply penetrate the workings of creation, fathom the subtleties of the five phases’ mutual conquest, and grasp the wondrous principles of metal and water’s mutual generation. Gather the primordial *qi* of the precelestial to serve as the foundation of the elixir; unite heaven and earth as the crucible, using kan and li as the medicinal ingredients.\n\nKan and li are the sun and moon. The solar image contains yang within yin: within the sun is the crow, governed by the li trigram, yang without and yin within. Within cinnabar lies the *qi* of wood, the position of the Azure Dragon. The art of inverting the five phases: the dragon emerges from fire—this is the father’s essence.\n\nThe lunar image contains yin within yang: within the moon is the hare, governed by the kan trigram, yin without and yang within. Within lead lies the *qi* of metal, the position of the White Tiger. The five phases do not proceed in order: the tiger is born from water—this is the mother’s blood.\n\nThe father’s essence is true mercury; the mother’s blood is true lead. True lead is born within black lead; true mercury is produced within cinnabar. These two are true yin and true yang.\n\nTrue yin is the mercury within li; true yang is the lead within kan. Thus it is said: When the essence of the sun unites with the radiance of the moon, true lead naturally emerges into the world. If one obtains true lead, it is the ancestor of the elixir.\n\nTrue lead is the ancestor of the elixir—why trouble oneself with refining the mother of lead? Refining lead does not mean refining the lead within stones; one must draw the celestial lead from the waves.\n\nLead is the mother of the sprout; the sprout is the child of lead. If one obtains the golden flower, discard the lead and do not employ it. Each transformation gives rise to the next, one child begetting another. If one can transmute mercury, a thousand changes and ten thousand connections arise, unmatched in the world.\n\nYet many learners mistakenly employ the five metals, the eight minerals, herbs, and frost—all of which are postcelestial, substantial things, not of the same essence as mercury. Mercury is the essence of the primordial *qi*, the radiance of the sun and moon, not of the same essence as the world’s five metals, eight minerals, herbs, or frost.\n\nThus it is said: Substantial things are unfit as companions; the insubstantial generating substance is the Returned Elixir.\n\nIt is also said:\nMercury alone is the immortal’s bounty,\nSince ancient times, its fire-subduing has been difficult.\nIf it meets the river chariot and becomes purple powder,\nThe purple powder instantly transforms into the golden elixir.\n\nThe golden elixir is refined within the crucible, not from the five metals, eight minerals, or pottery clay. The crucible is the crucible of crucibles; the medicine is the medicine of medicines. Crucible and medicine are fundamentally one.\n\nThus it is said: The crucible is originally without crucible; the medicine is originally without medicine. The yellow sprout is not lead, yet it arises from within lead.\n\nFurthermore, one must not use common lead—once true lead is employed, it is then discarded. To abandon lead is like forsaking one’s parents to seek a child. If one uses lead, one is ten thousand miles from lead; if one does not use lead, from where does it arise?\n\nOnce the golden flower enters the abdomen, one still discards lead and does not employ it. Red lead and black lead are the heads of the Great Elixir; uniting red with black is true cultivation. Extracting the essence from red and the marrow from black—this is the true wondrous principle of the Returned Elixir.\n\nRed lead corresponds to the li trigram; black lead to the kan trigram. If one gathers the kan and li trigrams within the crucible, seizing a day’s fire timing to wrest a thousand years of creation—all accomplished in a moment’s work—one obtains the supreme treasure of true lead.\n\nDead mercury becomes lead; living mercury is mercury—this is their mutual subjugation.",
      "overlap_context": "s and rivers, ghosts and spirits\nPay homage with reverence.\n\nIf under fifty,\nOne year of ingestion suffices.\nAt twenty-seven or twenty-eight,\nOne regains the springtime glow of youth.\nIf over fifty,\nTwo years of ingestion are needed.\nAt sixty-seven or sixty-eight,\nThe rosy complexion returns.\nEmerging beyond the nine yin,\nOne becomes a being of pure yang.\nLong life and eternal vision—\nOne’s years equal those of heaven and earth.\nShould one wish to ascend,\nA year of grain abstention will suffice.",
      "start_char": 12843,
      "end_char": 14074,
      "start_sentence": 707,
      "end_sentence": 780,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.57539200782776,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\还丹肘后诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "若杂以他药，终不能成。 汞与铅合，砂与金亲，阴为汞，阳为铅，是为真男真女，真阴真阳也。 若将真土为金鼎，养育庚辛，历岁寒年，终月满，离母腹，点汞何愁不肯乾。 此丹一年运火，十月开炉。 开炉则紫粉成金，启鼎而黄芽耀彩。 包含五彩，聚集万神。 用之则化汞为金，饵之则长生不老，形神俱妙，升为上仙矣。 望江南云：十月满，开鼎一团红，几片晓霜含五彩，解胎神水响玲珑，馥异香浓。 证道歌 何言金木水火土，留神保身是龙虎。 学者不识五行精，强认他人为父母。 血象水兮肉象土，气象木兮骨象虎。 不死之道在离宫，会得五行身有主。 五行仍是水银亲，殊质不堪为伴倡。 水银有类是金公，及见金公不认祖。 不得至人传此言，苦己劳形馒辛苦。 黄芽歌 黄芽铅汞造，阴壳含阳花。 世人炼至药，错认铅黄花。 黄花是死物，那得到仙家。 黄芽非外药，内象最精华。 若到黄芽地，黄金徒众夸。 问道有何言，分明向君说。 莫认杂花铅，金公太难别。 铅本是金公，金公得铅发。 学者夸金公，金公却成拙。 流珠为姥女，见火自然飞。 忽见金公到，相怜一处归。 同行又同坐，终日掩双扉。 又被阴阳化，随君变所依。 二性皆归土，三花气不为。 行到紫阳宫，共变黄华袭。 立月看应易，年终色紫辉。 化尽黄芽了，仙人见者稀。 此汞名真汞，焉能返解飞。 堪笑大还丹，世问为妙微。 不得真师诀，千金徒尔为。 金丹铅汞歌 古今学道制还丹，误认黄芽汞与铅。 例向水银征至药，岂知平地不生莲。 由来异类难相感，须向根求始得绿。 一阴一阳坎离主，日魂月魄分龙虎。 世上咸闻着此名，谁向其中辨藏否。 左旋来卯见木精，自巽抵乾至阴土。 朱砂水银俱是阴，二女同处非瑟琴。 刚柔情性诅为匹，燕雀鸾凤非同林。 金银作鼎非山泽，又须金银竟谁识。 火之居木水处金，铅汞分明是此得。 汞非水银铅非黑，太阴在南太阳北。 含阳之汞受金，然后为砂审方位。 处阴之铅结金体，乃能生汞彰其白。 阴中有阳水生金，阳中有阴砂汞是。 天资二物相配成，真汞真铅真水名。 互为母子更含孕，修持须得两弦平。 经说三乘本从一，人体三田亦还一。 为金於西肇生坎，为火於南亦藏坎。 为木於束产在北，金火未分变由此。 水一金四谓之戊，火二木三谓之己。 戊己合成处正中，阴阳数足方具美。 可怜三五并与一，黄白紫光交横出。 九旬俱胜号还丹，便可长生驻容质。 若使十月脱胞胎，神伏鬼惊万事毕。 出世虽独指蓬壶，升天可以当白日。 河车华池莫外求，八石四黄难可俦。 豺狼宁伏驿馏阜，荆棘奚同松桂秋。 鼎中更有虚无号，非世金银自然造。 达士如修此鼎成，丹霄紫府不难到。 君臣夫妇皆相承，三人同志终得朋。 众流毕竟朝沧海，暗室须资点慧灯。 春风一夜开桃李，宝马香车携绿蛆。 轻肥绣骑乐繁华，岂信炉中有神水。 韶华美景留不得，百岁为访能有几。 青鬓成丝瞬息问，朱颜落日平生已。 和娇爱钱不肯用，王戎钻李畏人共。 何似淮南真药成，鸡犬相随入仙洞。 世人皆为刀锥长，炼雌点铜为丹阳。 那知神药回天力，一丸高步朝玉皇。 莫迷莫俟穷恍惚，灵丹不用人问物。 金水能全造化功，永寿蟾乌递明没。 玄元括象甚分明，自是迷人心兀兀。",
      "translated_text": "If mixed with other medicines, it will never succeed. When mercury unites with lead, cinnabar befriends gold. Yin is mercury, yang is lead—these are the true man and true woman, the true yin and true yang.\n\nShould one take true earth as the golden crucible, nurturing geng and xin through the cold years, when the full month arrives and it departs the mother’s womb, how could the mercury fail to congeal? This elixir, refined by fire for a year and opened in the tenth month, yields purple powder turned to gold when the furnace is unsealed, and the crucible opened reveals yellow sprouts glowing with radiance. It encompasses the five colors and gathers the ten thousand spirits. Used, it transforms mercury into gold; ingested, it grants ageless life, perfecting both form and spirit, ascending as a supreme immortal.\n\n*Gazing at the Southern River* says:\nWhen the tenth month is full, open the crucible—a mass of red,\nA few flakes of dawn frost holding the five colors,\nThe womb’s divine water resounds with clarity,\nExuding a rare and fragrant aroma.\n\n*Song of Realizing the Dao*:\nWhy speak of metal, wood, water, fire, and earth?\nPreserve spirit and guard the body—these are dragon and tiger.\nScholars who fail to grasp the essence of the Five Phases\nMistakenly claim others as their parents.\nBlood resembles water, flesh resembles earth,\nQi resembles wood, bones resemble tiger.\nThe deathless Dao resides in the Li Palace;\nMaster the Five Phases, and the body has its sovereign.\nThe Five Phases are still akin to mercury,\nYet disparate substances cannot serve as companions.\nMercury is kin to the Metal Elder;\nMeeting the Metal Elder, it fails to recognize its ancestor.\nWithout the transmission of this teaching by a perfected one,\nOne toils in vain, exhausting body and spirit.\n\n*Song of the Yellow Sprout*:\nThe yellow sprout is wrought from lead and mercury,\nA yin husk cradling a yang flower.\nThe world refines it as medicine,\nMistaking lead for the yellow flower.\nThe yellow flower is a dead thing—\nHow could it reach the immortals’ realm?\nThe yellow sprout is no external medicine;\nIts inner image is the most refined essence.\nWhen one attains the yellow sprout’s domain,\nGold’s glory is but empty praise.\nIf asked what this means,\nI speak plainly to you:\nDo not mistake mixed flowers for lead—\nThe Metal Elder is too hard to discern.\nLead is the Metal Elder;\nThe Metal Elder flourishes with lead.\nScholars boast of the Metal Elder,\nYet the Metal Elder becomes clumsy.\nThe flowing pearl is the Crone’s daughter,\nMeeting fire, it naturally takes flight.\nSuddenly the Metal Elder arrives,\nAnd they cherish each other, reuniting.\nTogether they walk, together they sit,\nAll day behind closed doors.\nYet transformed by yin and yang,\nThey follow your changes at will.\nThe two natures both return to earth,\nThe three flowers’ qi no longer act.\nProceeding to the Purple Yang Palace,\nThey together become a yellow floral mantle.\nStanding in the moon, transformation comes easily;\nBy year’s end, its hue shines purple.\nWhen the yellow sprout is fully transmuted,\nFew immortals witness it.\nThis mercury is true mercury—\nHow could it revert and flee?\nIt is laughable that the Great Returned Elixir,\nThough revered in the world as subtle and wondrous,\nCannot be attained without a true teacher’s instructions—\nA thousand pieces of gold spent in vain.\n\n*Song of the Golden Elixir’s Lead and Mercury*:\nFrom ancient times to now, those who study the Dao and refine the Returned Elixir\nMistake the yellow sprout for mercury and lead.\nThey seek the supreme medicine in mercury,\nUnknowing that lotuses do not grow on level ground.\nBy nature, disparate kinds cannot resonate;\nOne must seek the root to obtain the verdant.\nThe one yin and one yang are the masters of Kan and Li,\nSun’s essence and moon’s spirit divide as dragon and tiger.\nThe world has all heard these names,\nBut who can distinguish what lies hidden within?\nLeft-rotating, coming to *mao*, one sees wood’s essence;\nFrom *xun* to *qian*, one reaches the extreme yin earth.\nCinnabar and mercury are both yin—\nTwo maidens dwelling together cannot harmonize like zither and lute.\nHard and soft, nature and temperament—how could they pair?\nSwallows and phoenixes do not share the same grove.\nGold and silver as crucibles are not of mountain or marsh—\nYet who recognizes which is which?\nFire resides in wood, water in metal;\nLead and mercury are clearly obtained thus.\nMercury is not quicksilver, lead is not black—\nSupreme Yin lies in the south, Supreme Yang in the north.\nMercury containing yang receives the metal’s fragrance,\nThen becomes cinnabar—discern the direction.\nLead dwelling in yin solidifies into metal’s body,\nOnly then can it generate mercury and manifest its whiteness.\nWithin yin is yang, water generates metal;\nWithin yang is yin, cinnabar and mercury are it.\nHeaven endows these two to unite and form,\nCalled true mercury, true lead, true water.\nMutually mother and child, they further conceive;\nCultivation requires the two arcs to balance.\nThe scriptures say the Three Vehicles originate from one;\nThe human body’s three fields likewise return to one.\nAs metal in the west, it begins in Kan;\nAs fire in the south, it also conceals Kan.\nAs wood in the east, it arises in the north—\nThe undivided state of metal and fire stems from this.\nWater as one, metal as four—these are *wu*;\nFire as two, wood as three—these are *ji*.\n*Wu* and *ji* unite at the center;\nOnly when yin and yang’s numbers are complete is beauty achieved.\nPitiable are the three, five, and one—\nYellow and white, purple light crisscrossing forth.\nThe ninety-day triumph is called the Returned Elixir;\nThus can one preserve life and halt the decay of form.\nIf the ten-month gestation is completed and the womb shed,\nSpirits submit and ghosts are startled—all affairs are finished.\nThough emerging alone to point to Penglai,\nAscending to heaven can rival the bright sun.\nDo not seek the River Chariot or Flowery Pond externally;\nThe eight stones and four yellows cannot compare.\nHow could jackals and wolves submit to the alchemical furnace?\nHow could brambles resemble the autumn of pines and cassia?\nWithin the crucible is also the name of Emptiness and Nonbeing—\nNot the world’s gold and silver, but naturally wrought.\nIf a realized person refines this crucible to completion,\nThe cinnabar clouds and purple palace are not hard to reach.\nSovereign and minister, husband and wife all correspond;\nThree people of like mind ultimately gain companions.\nAll streams ultimately flow to the vast sea;\nIn darkness, one must rely on the lamp of wisdom.\nA night of spring wind opens peach and plum,\nTreasure horses and fragrant carriages bear green jade.\nLight and fat, embroidered steeds delight in splendor—\nWho would believe the furnace holds divine water?\nThe beauty of youthful scenes cannot be detained;\nHow many can visit a hundred-year span?\nBlack hair turns to silk in an instant,\nThe rosy face of sunset is a lifetime’s end.\nHugging beauty and hoarding money, unwilling to use them—\nWang Rong drilled holes in plums, fearing others would share.\nHow does this compare to the true medicine of Huainan’s completion,\nWhere chickens and dogs followed into the immortal’s cave?\nThe world’s people all vie for the length of knives and awls,\nRefining the feminine to transmute copper into \"cinnabar yang.\"\nUnknowing the divine medicine’s power to turn back heaven,\nA single pill strides high to court the Jade Emperor.\nDo not be deluded, do not wait in vain for the obscure and indistinct—\nThe numinous elixir requires no external substances.\nMetal and water can fulfill the work of creation,\nEternally outshining the toad and crow’s alternating brightness.\nThe Mystery’s embrace of images is quite clear—\nIt is only the deluded whose hearts are dull and blank.",
      "overlap_context": " cultivation. Extracting the essence from red and the marrow from black—this is the true wondrous principle of the Returned Elixir.\n\nRed lead corresponds to the li trigram; black lead to the kan trigram. If one gathers the kan and li trigrams within the crucible, seizing a day’s fire timing to wrest a thousand years of creation—all accomplished in a moment’s work—one obtains the supreme treasure of true lead.\n\nDead mercury becomes lead; living mercury is mercury—this is their mutual subjugation.",
      "start_char": 14074,
      "end_char": 15401,
      "start_sentence": 781,
      "end_sentence": 860,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.01276707649231,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\还丹肘后诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "若能顿悟一真宗，悟了潜修莫怆悴。 还丹还丹归本元，不归本元非还丹。 迭石无因能敖浪，积水何曾作得山。 求鱼不结截江网，安得红腮满玉盘。 为劝岩栖并市隐，莫抛甘美味辛酸。 此一篇妙尽玄征，但不言火候耳。 快活丸歌 快活丸，天木地金惟两般。 左手使，右手寻，两手到时把药擒。 入赤臼，恣意捣，和就一丸如意宝。 采得药，小如钱，因何捣得大如拳。 但寻思，堪失笑，连捣至捣哮吼叫。 六丁里，实求觅，一红一黑不可失。 白似雪，玉不如，恰似一颗夜明珠。 时中讨，那里要，莫教走了药不妙。 元成粒，炉中烧，烧时故使水银浇。 开炉看，霞光迸，入臼再捣枯又硬。 渐渐长，臼中溢，杵臼连忙如霹雳。 十个月，三十辰，依爻火练自然成。 合有法、元有数，元元尽合周天度。 谁肯合，谁肯服，会合能服天地福。 知者秘，怕人闻，此药可驻千万春。 元合时，最怕风，自古从今药一同。 药不远，是人有，往往迷徒八方走。 休多说，静悄悄，勿使人知怕人笑。 元成粒，日影看，始愚终圣无生乱。 投入壶，莫乱倾，依时按节补天真。 一元子，十六两，三百六十四爻养。 地雷复，应阳爻，怠时将药向口抛。 真水送，咽九咽，切忌莫教俗人见。 过重楼，达五内，散入经络天人卫。 治已疾，除未病，谁肯夺真补自命。 从一爻，至六位，此药便是日月义。 可却老，再少年，命归药力不由天。 药下，锁玄关，莫教药力外边钻。 药力转，神清，玄珠随变流星。 日月照，腹中呜，照见世事尽不平。 按月法，六个节，一节付节莫教缺。 基脚动，基动服药不做用。 服此药，有所忌，除烦除恼除萦击。 密固室，守空房，一岁不若体如钢。 黑变白，白变红，志在心坚炼在功。 快活丸，色如雪，药味易寻难求诀。 不因我为立纪纲，药味归身走八血。 药相随，传百脉，三载变化内日月， 快活丸，不漏珠，腾空登天从此去。 依爻养就大还丹，父子君臣不可泄。 金晶歌 欲取金晶，须用功程。 金鼎居地，复求本身。 火飞水发，辨验浮沉。 鼎口沸出，复用收吞。 今方诀破，此是真晶。 莫生爱念，害及其身。 父母为本，铅汞为根。 此非秽浊，返化仙真。 如子事父，如臣事君。 依天依地，人方生人。 阴灵空性，何能生人。 父母生身，方有此灵。 此身一坏，此灵归空。 若得金精，保命生根。 千朝功毕，永劫长存。 诗 玄玄，先地先天，恍惚里，自绵绵，大道之祖，阴阳之源。 古仙传此法，贤士达深渊。 学人若明此理，留形住世长年。 直候金丹成九转，方知换骨化神仙。 丹丹，难会难言，龙之髓，虎之肝，阴阳造化，日月两问，要采中秋月，温时冬后寒。 得服能归紫府，进火全借机关。 后学若能依此诀，功成必定驾翔鸾。 药药，勤用勤作，长琼楼，生凤阁，上穿玉兔，下连日脚。 采来入鼎烹，和合莫教错。 缎炼抽添，运用沐浴，全在匡廓。 任时功行满三千，仙童诏我归碧落。 铅铅，水乡真源，庚辛产，位属乾，常居坎位，隐在北边。 得遇离宫汞，烹成玉一团。 永守神炉密固，使人性命牢坚。 直待玉皇符到日，稳骑鸾凤上青天。 汞汞，愚人窃弄，隐砂中，藏石缝，顺则成人，逆为丹用。 有火炼成丹，无火空劳动。 与铅一处调和，更用黄婆相送。",
      "translated_text": "If one can suddenly awaken to the One True Source,\nAwakened, then cultivate in seclusion—do not grieve.\nThe Returned Elixir, the Returned Elixir, returns to the original root;\nWithout returning to the root, it is no Returned Elixir.\nPiled stones cannot withstand the surging waves,\nAccumulated waters never form a mountain.\nSeeking fish without casting a river-spanning net,\nHow can one fill a jade plate with rosy cheeks?\nI urge those who dwell in cliffs and those who hide in markets:\nDo not forsake the sweet and savor the bitter.\nThis verse fully reveals the subtle workings of the Mystery—\nOnly the firing times are left unspoken.\n\n**Song of the Joyous Pill**\nThe Joyous Pill—only heaven’s wood and earth’s metal suffice.\nLeft hand moves, right hand seeks,\nWhen both hands meet, seize the medicine.\nPlace it in the red mortar, pound at will,\nKnead it into a wish-fulfilling jewel.\nThe gathered medicine, small as a coin,\nHow does it grow as large as a fist?\nJust ponder—it’s laughable—\nPound on until the mortar roars.\nWithin the six ding spirits, seek it earnestly,\nOne red, one black—do not lose them.\nWhite as snow, finer than jade,\nLike a luminous pearl in the night.\nSeize the moment—where else would you need it?\nDo not let the medicine escape, or it loses its wonder.\nOnce formed into grains, fire them in the crucible,\nWhile firing, douse them with mercury.\nOpen the furnace—radiance bursts forth,\nReturn it to the mortar, pound again until dry and hard.\nGradually it grows, overflowing the mortar,\nPestle and mortar clash like thunder.\nFor ten months, thirty days,\nRefine it by the hexagram’s fire—naturally it matures.\nThere is a method, there is a number,\nAll must align with the celestial cycles.\nWho will concoct it? Who will consume it?\nThose who conjoin and ingest it gain heaven and earth’s blessings.\nThe wise keep it secret, fearing others may hear—\nThis medicine can preserve a thousand myriad springs.\nWhen conjoining, fear the wind most of all,\nFrom ancient times to now, the medicine remains the same.\nThe medicine is not far—it lies within people,\nYet fools wander in all directions.\nSpeak no more—quietly, silently,\nLest others know and mock.\nOnce formed into grains, observe the sun’s shadow,\nFrom ignorance to sagehood, without birth or chaos.\nPlace it in the gourd—do not pour carelessly,\nFollow the seasons and nodes to restore celestial truth.\nOne primordial breath, sixteen ounces,\nNurtured by three hundred sixty-four hexagrams.\nWhen the earth-thunder hexagram revives, respond to the yang line,\nIn moments of slack, take the medicine and cast it into your mouth.\nSend it with true water, swallow nine times,\nBeware—let no vulgar person see.\nPass the towering mansion, reach the five viscera,\nDispersing into the meridians, guarding heaven and man.\nCure existing illnesses, prevent future ones—\nWho would seize the true to mend their own life?\nFrom the first line to the six positions,\nThis medicine embodies the sun and moon’s principle.\nIt can reverse aging, restore youth,\nLife submits to the medicine’s power, not to heaven.\nWhen the medicine descends, seal the mysterious pass,\nLest the medicine’s power leak outward.\nAs the medicine’s power turns, the spirit’s radiance clears,\nThe mysterious pearl follows, transforming into a shooting star.\nSun and moon shine within, the belly hums,\nIlluminating all worldly affairs as unjust.\nFollow the monthly method—six nodes,\nEach node must be met without omission.\nWhen the foundation stirs, if the base moves, the medicine is useless.\nWhen taking this medicine, observe taboos:\nDispel vexations, dispel troubles, dispel entanglements.\nSecure the chamber, guard the empty room,\nA year’s time—your body will be like steel.\nBlack turns white, white turns red,\nWill resides in the heart, refinement in effort.\nThe Joyous Pill, white as snow,\nEasy to find in taste, hard to seek in its secret.\nWere it not for me to establish these guidelines,\nThe medicine’s essence would scatter through the eight vessels.\nThe medicine flows through the hundred meridians,\nThree years transform the inner sun and moon.\nThe Joyous Pill, no leaking pearl,\nFrom here, ascend to heaven on high.\nNurtured by the hexagrams, the Great Returned Elixir is complete—\nFather and son, ruler and minister—do not reveal it.\n\n**Song of the Golden Essence**\nTo obtain the golden essence, one must follow the work’s progression.\nThe golden crucible rests on earth,\nSeek again the original body.\nFire flies, water surges—\nDiscern floating and sinking.\nWhen the crucible’s mouth boils over,\nGather and swallow it again.\nNow the true secret is revealed—\nThis is the genuine essence.\nDo not harbor attachments,\nLest they harm your body.\nParents are the root, lead and mercury the foundation.\nThis is no filth—it returns to transform into an immortal.\nLike a child serving a father, like a minister serving a ruler,\nDepend on heaven, depend on earth—only then can man beget man.\nHow can an empty yin spirit give birth to man?\nOnly when parents give life to the body does this spirit arise.\nWhen this body decays, the spirit returns to emptiness.\nIf you obtain the golden essence,\nPreserve life and plant its root.\nAfter a thousand mornings of work, you endure for eternal eons.\n\n**Poem**\nProfound, profound—\nBefore earth, before heaven,\nIn the indistinct, it endlessly extends.\nThe ancestor of the Great Dao,\nThe source of yin and yang.\nAncient immortals transmitted this method,\nWorthy scholars fathomed its depths.\nIf learners grasp this principle,\nThey preserve their form and dwell in the world for long years.\nOnly when the golden elixir completes nine revolutions\nDo they know how to change their bones and become immortals.\n\nElixir, elixir—\nHard to comprehend, hard to speak,\nThe dragon’s marrow, the tiger’s liver,\nYin and yang’s creation,\nThe sun and moon’s two inquiries.\nTo gather the mid-autumn moon,\nWarm it after winter’s cold.\nIf ingested, one returns to the purple palace,\nAdvancing the fire relies entirely on the mechanism.\nIf later learners can follow this secret,\nTheir work completed, they will surely ride a soaring simurgh.\n\nMedicine, medicine—\nDiligently use, diligently refine,\nGrowing jade towers, birthing phoenix pavilions,\nAbove piercing the jade hare,\nBelow connecting the sun’s rays.\nGathered and placed in the crucible to refine,\nHarmonized—do not let it err.\nForging, drawing, adding,\nBathing in the process—\nAll depend on the encompassing frame.\nWhen the work’s merit fills three thousand,\nThe immortal lad summons me to the azure vault.\n\nLead, lead—\nThe true source of the watery realm,\nBorn of geng and xin, belonging to qian,\nAlways dwelling in the kan position,\nHidden in the north.\nWhen it meets the mercury of the li palace,\nRefine it into a ball of jade.\nEternally guard the divine furnace, tightly sealed,\nMaking one’s nature and life firm and enduring.\nOnly when the Jade Emperor’s decree arrives\nWill you steadily ride a simurgh and phoenix to the blue heavens.\n\nMercury, mercury—\nFools tamper with it,\nHidden in cinnabar, concealed in stone crevices,\nFollowing the flow, it becomes human;\nReversed, it serves as the elixir’s use.\nRefined with fire, it becomes an elixir;\nWithout fire, labor is in vain.\nHarmonized with lead in one place,\nFurther sent by the Yellow Dame.",
      "overlap_context": "ne to transmute copper into \"cinnabar yang.\"\nUnknowing the divine medicine’s power to turn back heaven,\nA single pill strides high to court the Jade Emperor.\nDo not be deluded, do not wait in vain for the obscure and indistinct—\nThe numinous elixir requires no external substances.\nMetal and water can fulfill the work of creation,\nEternally outshining the toad and crow’s alternating brightness.\nThe Mystery’s embrace of images is quite clear—\nIt is only the deluded whose hearts are dull and blank.",
      "start_char": 15402,
      "end_char": 16731,
      "start_sentence": 861,
      "end_sentence": 942,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.54468393325806,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\还丹肘后诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "九还七返入中宫，群仙命我乘鸾凤。 炉炉，本出虚无，堪炼养，有玄珠，上关天象，八卦中铺。 下接地理处，周回四象居。 运火周天度数，修丹切莫差殊。 直候中宫足日，蕾买生足下别贤愚。 剑剑，至灵至验，飞太空，走雷电，斫断三峰，劈开海面。 辟尽阴魔魂，魔鬼心胆战。 半夜夺得明珠，神光往来出现。 他时保我命长生，携锋直上三清殿。 火火，工夫最大，待时刻，莫蹉过，志士之机，愚人之祸。 炼药凭巽风，主客分位坐。 朝昏爻接阴阳，进退抽添在我。 直待工夫用到头，男女跳出尘劳锁。 鼎鼎，难逢易省，玄元立，黄帝名，阴阳制造，潜於凡圣。 渺渺难寻源，水中看日影。 位应庚辛坤地，宝藏三峰尖顶。 仗剑劈开三姓门，观身跳出真仙境。 黑金变白金，白金变黄金，黄金成至药，尽之矣。 玄中有玄是我命，命中有命是我形。 唐件达灵真人记 余自知命之年，从銮舆西幸。 当天宝丁亥十一月，遇青城丈人，授以真元丹诀，旨意百不能晓。 属驻跸行，在掌命颇烦。 及肃宗至德丁酉岁，嘴命里于嵩岳，复遇丈人，始授神水黄芽之要。 洎毕，请告回觐宸宸，乞骸归田。 会南曹郎张公去非，左史程公太虚，皆以故庐，共制神室，皇天下，卷丹鼎，融光服之浃辰，肌容发爽，凌空不慑，意愈通神，意至药之灵，人不知其灵。 或曰人之延龄，至有还精补气，运息张机，出入之问，归清出浊，此诚内出外入也。 精之所还，何出而何入也。 或以吐、纳为精华，何有败腰之玲。 或以出入为真气，何有伤肤之劳。 凡壮室之年，诚为败真之本。 精华一失，神魂四离，此何以还之。 其或幼全真，常习运动，长其年龄者，抑亦下品也，且无凌空之效。 若外炼火龙，内运金精，直证高真，上仙也。 余自得饵灵丹，自至德丁酉，迄于今上乾符甲午，历春秋励一百一十二载，更十二朝。 余自念宦身功行虽勤，及得返童复元，比张程二公相去十二载，意方通神。 今天子蒙尘，奸臣窃位，余西迈，又值锺离公得偕行同宿，超越三乘，感迷惑之徒，执往不回，良可悲哉。 余志辞者，关下鬼之迷途，开上仙之真境。 乾符乙未岁丙子日记。 吕闷真人写真自赞 道包天地，不可宥以边。 撼八极，孰能写其形。 出纤毫一时之挥洒，炳人问千古之丹青。 跨海方蓬，飞入眉宇。 横秋雕鸦，翻作精神。 晚烟忽闻梅花月，束风俄遍六阳春。 彷象兮，仅可一二。 变化兮，莫穷涯津。 皎然悟物动人处，海上其谁步玉尘。 还丹肘后诀卷下竟",
      "translated_text": "Nine returns, seven reversions—enter the Central Palace,\nThe host of immortals commands me to mount simurgh and phoenix.\n\nFurnace, furnace—\nBorn of emptiness and nothingness,\nFit for refining and nurturing,\nHolding the Mysterious Pearl,\nAbove linked to celestial patterns, spread within the Eight Trigrams,\nBelow joined to earthly principles, encircled by the Four Images.\nCirculate fire through the celestial cycles,\nIn cultivating the elixir, never err or stray.\nOnly when the Central Palace’s qi is full\nWill the lotus bloom to distinguish the wise from the foolish.\n\nSword, sword—\nUtterly numinous, utterly efficacious,\nSoaring through the great void, racing with thunder and lightning,\nSevering the Three Peaks, cleaving the sea’s surface,\nDispelling all yin demons,\nMaking demonic spirits tremble in fear.\nAt midnight, seize the luminous pearl,\nDivine radiance appears and vanishes in turn.\nIn time, it preserves my life and grants longevity,\nBearing the blade straight to the Three Pure Ones’ palace.\n\nFire, fire—\nThe work is of utmost magnitude,\nAwaiting the proper moment, never let it slip by,\nThe mechanism for the steadfast, the calamity for the foolish.\nRefining the medicine relies on the xun wind,\nHost and guest take their respective seats.\nMorning and evening, the lines connect yin and yang,\nAdvancing and retreating, withdrawing and adding—all rest with me.\nOnly when the work is brought to completion\nWill man and woman leap free from the fetters of worldly toil.\n\nCrucible, crucible—\nHard to encounter yet easy to fathom,\nEstablished by the Mysterious Origin, named by the Yellow Emperor,\nForged through yin and yang, concealed among the common and the sage.\nVast and distant, its source is hard to trace,\nLike gazing at the sun’s reflection in water.\nIts position corresponds to geng, xin, and the kun earth,\nTreasure hidden at the Three Peaks’ summit.\nWielding the sword, cleave open the Three Clans’ gate,\nBehold the body leap forth into the true immortal realm.\nBlack metal transforms into white metal,\nWhite metal transforms into yellow metal,\nYellow metal becomes the supreme medicine—\nThus is perfection attained.\nWithin the mysterious lies the further mysterious—this is my life,\nWithin life lies yet another life—this is my form.\n\nRecorded by Tang Jian, the Perfected of Attained Numinosity\nIn the year I first knew my fate, I followed the imperial carriage on its western journey. During the Tianbao era, in the dinghai year of the eleventh month, I encountered the Elder of Qingcheng, who bestowed upon me the true elixir formula of Primordial Origin. Its meaning was beyond my full comprehension. As the imperial progress halted, my duties in the Bureau of Appointments grew burdensome. By the Zhide era of Emperor Suzong, in the dingyou year, I was granted leave to reside on Mount Song. There, I again met the Elder, who at last revealed the essentials of Divine Water and Yellow Sprout. Upon completion, I sought permission to return and pay homage at the imperial court, then petitioned to retire and return to my fields.\n\nAt that time, Zhang Qufei, Director of the Southern Bureau, and Cheng Taixu, Left Historian, both having left their official posts, jointly constructed a sacred chamber with me. We refined cinnabar in the crucible, and after a full cycle of days, the elixir’s radiance suffused my flesh. My complexion and hair grew vibrant, and I ascended the void without fear. My intent grew ever more attuned to the numinous, and the medicine’s efficacy became profound—yet others remained unaware of its power.\n\nSome say that to prolong life, one must return essence to supplement qi, regulate breath and expand the mechanism, so that in the exchange of entry and exit, the turbid is expelled and the pure retained—this is truly the internal issuing forth and external entering in. But where does essence return from, and where does it enter? Some regard exhalation and inhalation as the essence’s brilliance, yet how can this avoid the decline of the waist’s vitality? Some consider entry and exit as true qi, yet how can this avoid the labor that harms the skin?\n\nFor those in the prime of life, this is indeed the root of genuine depletion. Once the essence’s brilliance is lost, the spirit and soul scatter in four directions—how then can it be returned? Those who preserve their primal qi from youth and constantly practice movement may prolong their years, but this is merely a lower grade, lacking the effect of ascending the void. Only by externally refining the fire dragon and internally circulating the golden essence can one directly attain the rank of high perfection—this is the way of the supreme immortal.\n\nSince I first ingested the numinous elixir in the Zhide dingyou year, up to the present Qianfu jiawu year of the current emperor, I have traversed one hundred and twelve years across twelve reigns. Though my official duties and meritorious deeds were diligent, only upon regaining my youth and recovering my original state did my intent fully commune with the numinous. Compared to Zhang and Cheng, I lagged by twelve years.\n\nNow, as the Son of Heaven wanders in exile and treacherous ministers usurp power, I journey westward and once more encounter Master Zhongli, with whom I travel and lodge. Together, we transcend the Three Vehicles, yet deluded followers cling to the past and refuse to turn back—how truly lamentable! My purpose in writing is to awaken those lost on the demonic paths below and open the true realm of the celestial immortals above.\n\nRecorded on a bingzi day in the yiwei year of the Qianfu era.\n\nLü Men, the Perfected, Paints His True Likeness and Composes This Self-Eulogy\nThe Dao encompasses heaven and earth, unbounded by limits.\nShaking the eight directions, who can depict its form?\nIn a fleeting moment, the finest stroke is laid down,\nIlluminating the mortal world for a thousand ages in cinnabar and ink.\nStriding across the sea toward Penglai, it soars into the space between the brows.\nA raven etched in autumn’s hues transforms into radiant spirit.\nSuddenly, evening mist reveals the moon over plum blossoms,\nWhile a spring breeze swiftly traverses the six yang phases.\nIn semblance, only a fraction can be captured;\nIn transformation, its depths remain unfathomable.\nBrightly, one awakens to where things move the heart—\nWho on this sea of dust can tread the jade-strewn path?\n\nThus concludes the *Secret Formula for the Returned Elixir, Volume the Lower*.",
      "overlap_context": " divine furnace, tightly sealed,\nMaking one’s nature and life firm and enduring.\nOnly when the Jade Emperor’s decree arrives\nWill you steadily ride a simurgh and phoenix to the blue heavens.\n\nMercury, mercury—\nFools tamper with it,\nHidden in cinnabar, concealed in stone crevices,\nFollowing the flow, it becomes human;\nReversed, it serves as the elixir’s use.\nRefined with fire, it becomes an elixir;\nWithout fire, labor is in vain.\nHarmonized with lead in one place,\nFurther sent by the Yellow Dame.",
      "start_char": 16731,
      "end_char": 17695,
      "start_sentence": 943,
      "end_sentence": 992,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.44211506843567,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\还丹肘后诀.txt",
        "category": "众术类"
      }
    }
  ]
}