{
  "source_id": "通幽诀",
  "source_file": "chunked_daozang\\通幽诀.json",
  "total_chunks": 10,
  "total_original_chars": 10978,
  "total_translated_chars": 61436,
  "total_translation_time": 324.1076261997223,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\通幽诀.txt",
    "category": "众术类"
  },
  "full_translation": "**Tongyou Jue**\n\n**Scripture Title:** *Tongyou Jue* (*The Formula for Penetrating the Mysteries*). The author is unknown, approximately dating to the Tang or Song dynasties. It records both internal and external alchemical formulas. One fascicle.\n\n**Source of the Base Text:** *Zhengtong Daozang* (*Daoist Canon of the Zhengtong Era*), *Dongshen* section, *Zhongshu* category.\n\n---\n\n**The Formula States:**\n\nThe treasure elixir fundamentally arises from the One, which then generates the Two. The Two governs Fire, residing in *bing* and *ding*, born of *jia*. At the *Initial Nine*, the *Hidden Dragon* first line emerges, establishing Yang in the *zi* position. The *Celestial Tally* releases and disperses, startling the mat to receive qi from the Mother. The Mother is Earth.\n\nThe Dao is born of the One; the One generates the Two; the Two generates the Three. The Three are the ultimate parents of Yang. Yang is the essence of Heaven and Earth, thus called the *Three-Five and One*—the fundamental basis of the Returned Elixir.\n\nThe *Celestial Tally* is the *solar sign*. The Sun is the primordial essence of Heaven and Earth, the first illumination of the Five Phases. Its radiance follows the affairs of the day; the day follows the month; the month follows the seasons; the seasons follow the years—thus measuring distance and distinguishing differences.\n\nAt the initial division of the primordial qi of Chaos into Yin and Yang, the Dipper establishes the Twelve Branches, shifting and revolving without cease. The clepsydra never halts; release and union alternate, and the myriad things transform and take form.\n\nThe *Celestial Tally* is the sign. It can release and disperse the myriad things, moving them to return to their root and become essence and qi. Subtle movement congeals into essence; essence transforms into cinnabar. Its color inherits the *bing-ding* Fire of the South—externally Yang yet internally Yin—ruling the male, the Yang soul of the Sun.\n\nThe radiant qi of the Sun and Moon illuminates Heaven and Earth. The harmonious qi of the Great Yang and Great Yin intermingle and ascend, receiving qi. After 1,080 years, essence and qi congeal. When the *Celestial Tally* shines upon cinnabar for another 1,080 years, it becomes cinnabar, called *Zhusha* (Vermilion Sand).\n\nYang within Yin is named the *Great Yang* and *Vermilion Bird Stone*, ruling Water. The primordial harmonious qi is not yet sufficient—this is the *solar cinnabar*. The *Celestial Lead* of the ten thousand heavens, the essence of the *Imperial Male*, the blood of the *Dragon Maiden*, transforms South into North, extracting the untransformed Yin Mercury, ruling Water. Water’s number is One, thus it is said that Mercury is born of Lead, and Yang serves as the minister.\n\nThe *Celestial Lead* and *Divine Water*, driven by the *Celestial Tally*, illuminate cinnabar, nurturing it for another 1,080 years. Heavenly Fire transforms it into the Great Yang; Yang qi becomes sufficient while Yin qi wanes. When Yang qi flourishes and overflows, it turns back and generates its own color, inheriting the *ren-gui* Water of the North—externally Yin yet internally Yang—ruling the female, the Yin soul of the Moon. It is no ordinary substance of the human realm.\n\nThus, that which arises naturally in the Red Water is called *Yang Mercury*, the essence of *Celestial Lead* and the ancestor of the *Yellow Sprout*. It is the radiant qi-water of the Sun and Moon, transformed into the *Natural Returned Elixir*. When the *Celestial Tally* shines upon it for another 1,080 years—totaling 4,320 years—primordial qi becomes sufficient, and the Returned Elixir forms naturally.\n\nThe naturally subdued Fire is black in color, turning from North to West. West rules Metal, and Metal’s number is Four, the foundation of Water. Thus, we know the *Three-Five and One* are the supreme essences of Heaven and Earth. The Three is Fire; the Five are the parents of cinnabar; the One is the primordial ancestor of cinnabar.\n\nThe cycle revolves and turns; essence and primordial harmony interact to form shapes, never exceeding the One. The One is the fundamental origin of the Dao—Water.\n\nScholars fail to realize that cinnabar is Lead, and the child born within Lead is Gold. It is but a single thing of Yin and Yang, moving and self-regulating. Yang within Yin, Yin within Yang, Mystery within Mystery—this is called the *Mysterious Warrior Stone*, turning Water into Gold.\n\nThus it is said: *Cinnabar is produced from the Yin of Metal, serving as the ruler and refining agent of Gold.* When the *Celestial Tally* moves, totaling 4,320 years of illumination, the parents nurture and form *Celestial Lead*, the *Natural Returned Elixir*.\n\n**The Formula States:**\n\nLater sages used Fire to illustrate the line images. A month comprises 360 hours; a year comprises 4,320 hours of qi and seasons. Combined, they total 4,320 years—when qi and seasons align, the *Celestial Tally* naturally forms the Returned Elixir.\n\nThus it is said: *Vermilion Sand, Mercury, Gold, Water, Dragon and Tiger, the Five Phases—united in body, returning to the One, no duality, attaining the Five.* By following the *Earthly Tally* and the hexagrams’ seasonal nodes, the Golden Elixir is accomplished.\n\n**The Formula States:**\n\nThe essence-soul of this cinnabar emerges from within the Twelve Divisions of China, ruling the *First Palace* in the southwest corner of *Kun* Earth. This treasure is the supreme essence and primordial qi of Heaven and Earth. Through the movement of the Sun, Moon, and *Celestial Tally*, union occurs in the Five. The Five is *wu-ji*, the central palace of Earth.\n\nThe places where it is born possess auspicious mountains and ridges, where qi, bones, and flesh are complete. Water and land flourish with lush grasses and trees; soil and stone are firm and extraordinary. Spirits guard and attend; Yin qi bestows, and Yang qi disperses. Enveloping and nurturing, illuminating essence and qi, it is born of Earth and transforms into cinnabar.\n\nWhere cinnabar exists, whether day or night, after initial clearing or during overcast moments, qi and radiance often appear, resembling sunlight emerging, sometimes vanishing, sometimes visible—discernible only to the adept miner.\n\nHerein are recorded the names of the mountains, valleys, and administrative regions where it is produced, along with its various appellations:\n\n*Cinnabar, Vermilion Sand, Vermilion Lead, Gold within Lead, Celestial Lead, Fire Lead, Divine Water, Radiant Pool, Yin Mercury, Yang Mercury, Yang within Yin, Yin within Yang, Quicksilver, Five-Colored Stone, Five Metals, Lord of the Seven Treasures, Returned Elixir, Heaven-Born Sprout, Yellow Sprout, Embryo of the Five Phases.*\n\n**Names of Administrative Regions, Mountains, and Valleys:**\n\n*Guifu, Chen, Jin, Heng, Lang, Shao, Goulou, Duyun, Xiangdu, Yong, Bang, Rong*, and the borders of *Hunan*, among other places. In the mountains, rocks, and valleys where terrain and vegetation flourish, it is found.\n\nIf one seeks the essence of cinnabar without refinement—naturally self-generated—simply search in previously mined areas, where stones have been struck or cavities filled, regardless of whether they are new or old; it will be present.\n\nNewly opened mines and ancient ones do not necessarily yield it. When cinnabar glows radiantly upon the matrix, with a natural hierarchy of lord and minister on all four sides, or when it grows in obeisant clusters—its hue like an unopened red lotus, translucent and luminous as the sun, or resembling hibiscus, purple and diaphanous, its form like a zither; or when it appears in well-defined flakes with sharp edges, clearly lustrous—these are all of the highest grade. Or when it resembles mica sheets, white and translucent (also called \"white horse’s tooth\"), or occurs in granules of two or three, even weighing one or two catties, extracted from stone, with granules of bright red, fragmented brilliance. Or when it appears in flakes with sharp edges and white luster, invisible when submerged in water. Or when it exhibits a clear blue-green luster with well-formed edges—these are all of the middle grade. Though used similarly to the highest grade, they suffice as supreme medicine. Varieties with an iron-like hue, or those gathered from bamboo-lined valleys, earthen caves, or water, with granules of indeterminate weight, or mere handfuls of powdered cinnabar, are of the lowest grade. Though the land’s veins may flourish and their essence be drawn and subdued, they serve only to cure worldly ailments, not to prolong life, and are unfit as supreme medicine.\n\nThis is akin to the ranks of officials: the highest and middle grades hold titles, while those without are common. The lowly lack autonomy and cannot achieve extraordinary feats. Hence the saying: \"They only cure worldly ailments, not prolong life.\"\n\n**Heavenly Talisman: The Sun.**\nThe *Spring and Autumn Annals* speaks of the sun as the \"Heavenly Talisman.\" The sun is the essence and spirit of yang, the principle of heaven, thus its radiant illumination. *The Master of Huainan* states: \"The accumulated heat of yang qi surges and transforms into fire. The essence of fire is the sun, embodying the power of luminous brilliance.\" It also says: \"The sun is born in *jia*, the position of double yang. Fire is born in *zhen*, the *chen-si* position. *Zhen* is the eldest son, *xun* the middle son—they are the parents of southern fire. Fire is called *ceng*, wood is called *qing*; they are the agents of all things, hence the term *cengqing*.\"\n\n**Earthly Talisman: The Moon.**\nThe *Spring and Autumn Annals* refers to the moon as the \"Earthly Talisman.\" The moon is the essence and spirit of yin, the principle of earth, casting its singular luminous glow. *The Master of Huainan* states: \"The accumulated cold of yin qi surges and transforms into water. The essence of water is the moon, which waxes and wanes in response to the sun.\" It also says: \"The moon is born in *geng*, the position of double yin. Water is born in *dui*, the youngest daughter—they are the parents of water. Thus, men stand to the east of the sun, while women, like the moon, rise in the west.\"\n\nThe cinnabar of the alchemical path is the radiant essence of the sun and moon, the root of life and destiny. In harmony with the inner and outer primal forces, it assumes form through transformation. Ingesting it grants immortality, for it is the union of the sun and moon’s essences—hence the term \"Earthly Talisman.\" The moon’s birth and the sun’s nurturance depend on yin and yang’s workings, which in turn rely on their mother: earth. The sun and moon are the most numinous treasures of heaven and earth. When base emotions stir their essences, they transform and illuminate, coalescing into cinnabar, first called the \"Vermilion Bird Stone.\" Among the seventy-two stones, none surpasses mercury. Responsive to the twenty-four qi and corresponding to the twenty-four names, it transmutes into the Elixir. When crows consume it, they become phoenixes; when serpents ingest it, they become dragons; when humans partake, they attain longevity, sharing the lifespan of heaven and earth. It gathers the hun and po souls, reverses aging to return to youth, summons wind and clouds, and commands jade maidens to attend—such is the power of the Great Elixir.\n\nThe formula states: Lead is the liquid drawn from cinnabar, ruling water, yang within yin—mercury. That which naturally emerges from cinnabar rules metal, yin within yang—mercury. The formula states: Thus, the unyielding wood is subdued by metal. When metal nurtures water, water must preserve metal. When wood nurtures fire, fire must rely on wood. Therefore, lead-water governs mercury-water, and lead-fire governs mercury-fire, harmonizing their natures and forms.\n\nThe formula states: Lead-water is that which naturally emerges from cinnabar, ruling yang mercury. Mercury-water is the liquid drawn from water, ruling yin mercury. Thus, lead-water governs mercury-water. It also says: Lead-fire is self-generated metal. Mercury-fire is the drawn liquid. Water is lead-fire governing mercury-fire. Many fail to grasp this, hence the term \"Golden Mercury Dao.\"\n\nThe sun is the fire essence of Great Yang—vermilion mercury, the Dragon. The moon is the water essence of Great Yin—lead-silver, the Tiger. The Dragon is the qi of yang, the utmost of the number nine, the non-being of wood. The Tiger is the qi of yin, the utmost of the number four, the being of metal. The formula states: \"Use non-being to govern being, and the Dao is complete.\" Hence it is said: \"Cinnabar, the essence of wood, unites with metal. In perfect balance, it becomes supremely sacred and numinous.\" Yet the world does not awaken; people see gold and regard it as mere earth.\n\nThe *Song of the Elixir* says:\nThe Great Mystery and Earthly Talisman give birth to yin and yang.\nYin and yang generate the Five Phases, which unite to form the Returned Elixir—\nHence the names Dragon and Tiger.\nHeaven has three revered: the sun, moon, and stars.\nEarth has three revered: the rivers, lakes, and seas.\nHumans have three revered: ruler, father, and teacher.\nThe body has three revered: the Three Elixir Fields.\nThe Elixir has three revered: earth, fire, and metal.\nThus, *Qian* and *Kun* are the father and mother above and below.\n*Kan* and *Li* are water and fire as medicine.\n*Zhen* and *Xun* are the moving trigrams.\nAfter three years of circulation, the Elixir naturally returns—\nThis is the qi of the Great Origin; how could it not become the Elixir?\n\nThe formula states: Calculate 12,960 hours, excluding the varying lengths of months and intercalary months, to arrive at the true count. If even one qi is lacking, it is no different from worthless rubble. When the myriad phenomena’s essences align, the numinous naturally resonates.\n\nThe formula states:\nYin and Yang revolve, qi transforms into essence,\nessence into cinnabar, cinnabar into mercury,\nmercury into gold, gold into medicine—\nthus called \"golden sand,\" named the Great Return.\nThe Great Return means the meaning of returning.\n\"Elixir\" is the name of the red color.\n\"Mercury\" is fundamentally gold;\ngold and water restrain each other,\nhence called \"golden sand.\"\nWhen the fundamental body is refined, it is called the Great Return Elixir.\nEarth is the Yin tally, the central palace of Wu and Ji,\nalso called the Five Qi Golden Crucible.\n\nThe formula states:\nThe Five Qi restrain and subdue without flying,\nable to generate the Five Colors,\nreturning to their mother—\ningested, they grant longevity.\n\nThe formula states:\nCinnabar is the father of flowing mercury.\nWu and Ji are the mother of yellow gold.\nThe mother’s number is five; five is earth.\nUsing earth as the crucible,\nits restraining power is called the Golden Crucible.\nEarth can generate the myriad things;\ngold is born of earth, thus it is the father of gold.\nThe mother is gold’s fundamental origin in earth,\nhence called the earth mother.\nWater regards earth as its ghost—\nearth fills water so it does not rise.\nThe merit of Wu and Ji is called the Five Tally Golden Crucible.\nMercury cannot be subdued without earth.\nEarth rules the realm of metal;\nthe three substances all seek it,\nfollowing the image of the emperor and king.\nAs when a ruler has the Dao, the four directions come to offer tribute.\nSimply discern the true lead and mercury—\nthis is the primary crucible method.\nThus, the three substances form one family,\nall returning to Wu and Ji.\nWithout earth to govern, gold and water cannot form the Elixir.\n\nThe earth mother reigns for eighteen days in each season;\nthe remaining days are abandoned, imprisoned, or concealed.\nIn refining the Golden Crucible,\ninvestigate Yin and Yang,\nthe essence and qi returning—\nthe clepsydra does not cease.\nRealgar is likened to earth, pacifying the four barbarians.\nEarth is the fundamental soil that generates gold.\n\"Xiong\" means male; \"huang\" means earth.\nIt can suppress water and earth—\nthis is metal and fire, unrelated to realgar.\nThe crucible’s outer master is called the Five Tally.\n\nThe world does not awaken to the Elixir’s fundamental father and mother,\nmistakenly using gold and silver as the mother\nor as crucible vessels.\nThus, the primordial qi does not depart from the Five,\nand the Five do not depart from the primordial qi.\nTheir names are blended as one,\nbut their functions differ when distinguished.\nThe primordial qi is the ruler of the Five Agents;\nthe Five Agents are the ministers of the primordial qi.\nRuler and ministers govern in tandem—\nthey cannot be separated.\nThe Golden Elixir employs the primordial qi,\nnot exceeding the Five.\nThe Five are the Five Tally.\nThe Five Tally are qi.\nQi is originally formless,\nborn from essence,\ncontaining truth within and without.\nWhen ingested, one neither dies nor is born.\n\nThe Golden Crucible is the outer control of the medicine—\nthe outer is qi, the control is the crucible.\nThe crucible resembles a hen’s egg,\nwhite outside encasing yellow,\ncombined with mercury—\nusing white gold as the vessel,\nthe vessel does not depart from the Five.\nThe Five are earth, the earth that generates gold.\nThrough intricate mutual restraint,\nit seems effortless,\npreventing water from escaping—\nthis is the merit of Wu and Ji.\n\nThe formula states:\nGrasp the sword, lay down the halberd,\nencompassing the four directions.\nGrasping the sword is the primordial qi of metal, the Five.\nLaying down the weapons—\nlike water meeting earth and not flowing—\nthis is gold dying in earth.\n\nThe foundation of the Great Elixir is cinnabar.\nCinnabar is lead,\nfundamentally born of earth,\nand in death also returns to earth—\nthus, use the earth that generates cinnabar.\nThe world knows this in number.\n\nThe crucible has alternate names:\nOuter Spirit Water, Flowery Pond, Spirit Chamber,\nEnclosing Frame, Outer Control, Five Qi,\nWhite Robe, Elixir Robe, Mother’s Abode,\nGolden Crucible, Spirit Hut.\n\nThe formula states:\nThe Five Qi—\nin greatness, they encompass the eight directions;\nin smallness, they conceal even a hair’s tip.\nThey spit forth Kun and vomit forth Xu,\nemerging from existence, entering non-existence.\n\nThe formula states:\nThe flowing pearl revolves nine times,\ntransforming into yellow and white.\nNaturally interacting,\none Yin, one Yang—\nthis is called the Dao.\nIt must be subdued within the Golden Crucible,\nthe merit of the central palace.\nSpiritual penetration is free and unobstructed,\nnurturing and subduing—\nhence called the Golden Crucible.\n\nThe Golden Elixir is the primordial harmonious qi of Heaven, Earth, sun, and moon.\nShining and silently revolving,\nit becomes cinnabar.\nWithin the sand, it spontaneously generates—\nthis is the Return Elixir.\nLike humans conceiving sons and daughters,\nall arise from the union of father and mother’s Yin-Yang essence and qi—\nthus, the Return Elixir resembles male and female.\nMales are born facing downward; females, upward.\nNot only in life—\neven in death, it is so.\nSimply cast them into water:\nmales float downward, females upward.\nHeaven causes this—\nit is not by the parents’ instruction.\n\nGold and water within the crucible\nresemble male and female playing,\nmale above, female below,\nnaturally attaining mutual affinity,\nfulfilling the Dao.\n\nThe formula states:\nThough the Golden Elixir obtains its primordial foundation,\none must know the nurturing and subduing of its fundamental father and mother.\nThe father is the Yang qi of fire—\nthe father can emit, move, and complete it.\nThe mother is the Yin qi of earth—\nthe mother can contain and nurture it.\nThe mother rules the central palace, yellow—\nyellow is earth, the earth that generates gold.\nWhen cinnabar first receives qi,\nit relies on earth to be born—\nthus, it is called the fundamental mother of the yellow sprout.\nFormed by Yang, born by the mother—\nhence named the earth cauldron, the mother.\n\nEarth is the earth of the Five Agents,\nthe earth of generation and completion.\nWater, fire, wood, metal, earth—\neach resides in its direction,\nmoving to its proper position.\nFire comes to overcome metal;\nearth comes to overcome water.\nWater is the child of cinnabar.\nEarth is the crucible.\nFire is movement, contending—\nyet forming shape, obtaining earth’s generation.\nEarth can restrain water;\nthe fundamental qi resonate,\nbecoming the ancestral Dao.\nThus it is said: Know the white, guard the black.\n\nThe world entirely does not know that like kinds\nfollow and generate each other,\novercome and restrain each other—\nmetal generates water,\nearth is the ghost of water.\nEarth fills water so it does not rise—\nthe merit of Wu and Ji is called the Five Tally Golden Crucible.\nNone among the world’s people know this.\nEarth tally is the essence of fire and wood.\n\nThe formula states: The earth tally is fire.\nFire can cook and ripen the myriad things,\nnurturing the people.\nFire is the root yang qi of *jia*,\nconjoining and uniting with the essence qi of sun and moon,\nreturning to the undivided essence of *jia*.\nFire’s number is two; its generating number, three; its completing number, nine.\nNine is the extreme number of yang—yang qi.\n*Jia* is called *zeng*; wood is called *qing*.\nThe agent of all things, the Azure Dragon of the East—wood.\nWood is the parent of fire; fire and wood, its descendants.\n*Zhen* is the eldest son, born of one yang line;\n*Xun* the middle son, born of two yang lines—\nthus fire is born in *chen* and *si*.\n*Li* is the middle daughter, born of two yang lines.\nYang *bing* resides in the *zi* position.\nWood conceives fire and restrains it;\nfire must borrow from wood.\nThree is the essence of wood, the Way of true yang,\nthe position of *jia* and *yi*—the sun.\n\nThe celestial tally is trust, able to activate and release the myriad things.\nThe moon, a yin tally, can nurture the myriad things.\nEarth, a yin tally, can nurture the myriad things.\nFire, an earth tally, can cook and ripen the myriad things.\nThe primordial qi of metal and water, likewise yin tallies,\ncan nurture the myriad things.\n\n*The Straight Tally Hand Mirror* compares the sixty-four hexagrams of sun and moon,\nthe six lines activating and releasing,\nthe celestial tally—\nthus forming the golden elixir.\nIngesting it, one ascends in feathered transformation—\nthe power of *Ziming*.\n\nThe Perfected Lord of the Primordial Emperor,\nwhose name has changed through the ages,\nhas summarized the subtleties of yin and yang,\nthe mutual resonance of the Five Phases,\nthe line images of the *Zhouyi*,\nand the straight tally of *Can Si*—\nlike tally and contract, perfectly aligned.\nObserving the cycles of heaven and earth,\nthe revolutions of yin and yang,\nthe proper positions of *zi* and *wu*,\nthe mutual gazing of *mao* and *you*:\nIn the eleventh month, the first yang arises—\nthe myriad things are born.\nIn the fifth month, the first yin arises—\nthe myriad things take form.\n\nSpring gives life, autumn brings harvest—such is the natural Dao.\nThe formula states: Use fire gently, without missing the seasonal nodes.\nThe myriad things ripen of themselves—this is the meaning of the *River Chariot*.\n\nThe formula states: *Zi* governs the fire-tally, first in withdrawal and addition.\nOne says: *River* is the northern position.\n*Chariot* means the conveyance of burdens.\nAnother says: *Zi* is metal, *River* is water—hence *Zi River Chariot*.\n\n**Earth-Tally Straight Hexagram Seasonal Advance-Retreat Diagram**\nThe formula states: Originally employing the four hexagrams,\nthe sun and moon through the four seasons,\nthe straight tally cycles endlessly—\nlike the wheels of a chariot,\nrevolving yin and yang,\ncompleting the numbers of creation,\nbearing and conveying the myriad things.\nThus, in the pitch-pipes and monthly nodes,\nthere are five and six taboos,\nhonoring the solar terms and their combinations.\n\nThe sixty-four hexagrams,\nhard and soft with outer and inner,\nat dawn the long day begins with the hexagram of duty,\nby dusk the receptive takes its turn—\nday and night each employ one hexagram.\nThe sequence, having reached its end at the dark of the moon,\nrenews itself with advancing and retreating line images,\nall within this straight tally.\n\nFrom one to nine,\nthe Metal Tiger spits forth essence—\nthe formula for the straight tally is not recorded here.\n\nThe formula states: Borrowing the yin-yang line images,\nthe sixty-four hexagrams establish their metaphors.\nWhen deploying fire for release,\nit is the eleventh month that governs,\nreceiving the yang seasonal tally.\n\n**Eleventh month, first nine:**\n\"The hidden dragon does not act.\"\n*Earth-Thunder Fu* (Return), aligned with *Yu* (Enthusiasm).\n\n**Twelfth month, second nine:**\n\"The dragon appears in the field.\"\n*Earth-Marsh Lin* (Approach), aligned with *Cui* (Gathering).\n\n**First month, third nine:**\n\"The noble one toils ceaselessly all day.\"\n*Earth-Heaven Tai* (Peace), aligned with *Pi* (Stagnation).\n\n**Second month, fourth nine:**\n\"Perhaps leaping in the abyss.\"\n*Heaven-Thunder Wuwang* (Innocence), aligned with *Dazhuang* (Great Strength).\n\n**Third month, fifth nine:**\n\"The flying dragon is in the heavens.\"\n*Heaven-Marsh Lü* (Treading), aligned with *Fu* (The Gentle).\n\n**Fourth month, upper nine:**\n\"The exalted dragon has regrets.\"\n*Pure Qian* (The Creative) governs—yang qi surges and intermingles.\n\n**Right: The Six Yang Positions**\nThe yang arises to its extreme—\nthe hexagram of the exalted dragon, *Great Excess*—\nmodeled on heaven,\nthus from *zi* to *si*.\n\n**Fifth month, first yin arises.**\n*Heaven-Wind Gu* (The Taming Power of the Small), aligned with *Xiaoxu* (Small Accumulation).\n\n**Sixth month, second yin arises.**\n*Heaven-Mountain Dun* (Retreat), aligned with *Daxu* (Great Accumulation).\n\n**Seventh month, third yin arises.**\n*Heaven-Earth Pi* (Stagnation), aligned with *Tai* (Peace).\n\n**Eighth month, fourth yin arises.**\n*Wind-Earth Guan* (Contemplation), aligned with *Sheng* (Ascending).\n\n**Ninth month, fifth yin arises.**\n*Mountain-Earth Bo* (Splitting Apart), aligned with *Qian* (Modesty).\n\n**Tenth month, sixth yin arises.**\n*Pure Kun* (The Receptive) governs.\n\n**Right: The Six Yin Positions**\nThe yin arises to its extreme—\nthe hexagram of qi lying hidden,\nmodeled on earth,\nthus from *wu* to *hai*.\n\n**Zhen** governs spring wood:\ngenerating three, completing eight.\n\n**Li** governs summer fire:\ngenerating two, completing seven.\n\nThe formula states: Verifying the preceding fifteen days as white,\nthe moon’s fire and wood govern—hence seven and eight.\n\n**Dui** governs autumn metal:\ngenerating four, completing nine.\n\n**Kan** governs winter water:\ngenerating one, completing six.\n\nThe formula states: Verifying the following fifteen days as black,\nthe moon’s metal and water govern—hence nine and six.\n\nAll are the straight tally’s six lines,\nemploying hexagram nodes to interpret qi and seasons,\nthe numbers of the Five Phases overcoming one another.\nThus, seven and eight sum to fifteen,\nnine and six likewise correspond—\nthe Dao is complete.\n\nOne, two, three, four, five—\nall are the foundations of the Five Phases.\n\nThe formula states:\nOne is the northern *ren gui* water.\nTwo is the southern *bing ding* fire.\nThree is the eastern *jia yi* wood.\nFour is the western *geng xin* metal.\nFive is the central *wu ji* earth.\n\nThe classic states: \"The father is young, the child is old.\"\nThe father is celestial lead—\ncinnabar lead.\nThe child emerges from the father—\nblack lead of metal.\nThus, the father is young, the child is old.\n\nIf the child is not fixed, the father’s lineage spans five generations.\nWater, fire, metal, wood, earth—\nthe Five Phases shift and transform the myriad things.\nFive days make one *hou*,\nfive *hou* make twenty-five—\nthus the father’s age is twenty-five.\nThe child’s number is unfixed,\nits age conveyed and revolving without constancy—\nhence the father is young, the child is old.\n\nThe world does not know that the myriad things\narise and are completed from the Five Phases as parents.\n\n**Employing Fire**\nThe formula states: The six lines of the straight tally,\nrevolving hexagrams to employ fire—\nweights and measures begin with *Pure Kun*,\nend with *Kun*,\ncycling without cease.\n\nThe formula states: One cauldron is changed each month,\nthus nine cauldrons are used before stopping.\nThe tenth cauldron is left to natural ebb and flow—\nwhether used or not, both yield wondrous transformation,\nfor this is the original qi of metal’s birth.\n\nThus, the earthen crucible—\nthe earthen crucible is called the mother,\nthe mother of the metal cauldron.\n\nThe formula states: The metal cauldron follows the revolving qi and seasons—\nafter fifteen days, the metal nature perishes;\nafter thirty days, the elixir forms.\nWhen the cycle reaches the tenth month,\nthe original earth is no longer used as the cauldron—\nmother and child shed their forms,\nnine transformations, nine cauldrons.\nNine is the fire in service;\nthe cauldron is the mother in service.\n\nAll elixirs resemble humans—\nfrom receiving qi to birth, three hundred seventy days,\nnine months when yin and yang are both abundant,\nthe tenth month when earth is sovereign—\nthus mother and child part,\nhence the name *shedding the womb*.\n\nThe returning elixir resembles a person—\nfour qi complete, it is born,\nlike an infant nourished for three years,\nuntil the great original qi is full,\nand the golden elixir is achieved.\nThis is called *Yellow Fame*,\ntransforming and returning to the north,\nblack color penetrating through—\nonly then is it named *Great Return*.\nThe world does not know this.\n\nThe child is the medicine,\nthe mother is the cauldron—\nresponding to qi, they generate one another,\nproduce and subdue,\nrestrain and overcome,\nalternately flourishing and declining.\nAscending and descending within the cauldron,\nflying and hiding above and below,\nyin and yang govern each other,\nintermingling and devouring,\nthe four agents pressing upon one another,\nruler and minister attending.\n\nEarth’s nature gives birth,\nmetal’s nature dies,\nfire’s nature extinguishes,\nwater’s nature unites.\nThe four agents—\nyin within yang, yang within yin.\n\nBut with the original earth as the axle,\nthe straight tally revolves—\nthus the four agents,\neach dwelling in its quadrant.\nWhen the natures of the four agents all perish,\nreturning to unity and the root—\nthis is called the golden elixir.\n\nThe formula states: Guard and revolve for one year,\ningest one *liang* and a half—\nno illness will assail you.\n\nAfter two years, the White Way is achieved—ingest half a *liang*.\nAfter three years, the Great Original *qi* is full and the Red Way is achieved—ingest one *fen* to dwell in the world while death’s register omits your name.\nA *daogui* measure refines mercury into the White Way; after five years, ingest seven grains the size of sesame seeds. With a *daogui* measure, transmute one *jin* each of iron and mercury into the Red Way. After nine years of guarding and revolving, ingest three grains—the Three Corpses and Nine Worms will all depart, and you will attain longevity without death.\nYou will be able to transform the Five Metals and Eight Stones, turning even tiles and pebbles into treasures according to their original colors.\n\nThe fire method states: The established symbolic trigrams, hand-mirror fire records of weights, and reliance on yin and yang conceal the mechanism of hidden transformations. Though the descendants’ methods differ slightly, the essential technique remains the same.\nFor example, in the eleventh month, when *jianzi* begins, the first yang line stirs the fire. The generating number is two, the completing number seven—movement and bearing proceed like a wheel.\nIn the first month, one yang arises; by the fifth month, one yin arises. Each month, one yang line retreats until the tenth month, when all returns to earth, ending in *kun*—then the cycle begins anew.\nThe Golden Elixir is the movement of the sun and moon, naturally forming the elixir.\nSince Suiren altered fire, later sages have used it, aligning with celestial fire. The utmost of creation lies herein—timekeeping is precise, seasonal fire adjustments and weight movements proceed gradually, like steaming. When the four seasons, months, and hours are fulfilled, the Golden Elixir is complete, for the fire-timing dictates it.\nIf driven too hastily, it flees like a chicken; if too lenient, it will not submit. But by following the straight tally’s trigrams, gold and water will naturally obey.\n\nIn the sixth month, yang ends at *si*; in the twelfth month, yin ends at *chou*.\nThe formula states: Cinnabar is the essence of flowing yang pearls, establishing *qian* and *kun*, moving water and fire, responding to celestial tally, and harmonizing the Three Powers.\nGold is the essence of the moon, dwelling in the yin position. Mercury contains the *qi* of *li*, corresponding to the yang line.\nThe numinous embryo of heaven and earth, the essence of the sun and moon—when the negative reaches its extreme, the positive arises. Thus it is said: Cinnabar is the essence of wood, which merges with metal—this is the Way of the Three-in-One.\nThe Three are fire; the One is the medicine—hence the name \"guarding the One.\"\nIt is also said: Cinnabar is the medicine; gold is the cauldron. Thus, the Three Ways derive from the One, all rooted in the fundamental.\nThe supreme principle of the Great Way admits no second gate.\nCinnabar’s nature is mild and non-toxic, its flavor pungent. The original *qi* communicates with the numinous, and all things do not wither—it is called Black Lead.\nBlack Lead is the natural liquid within cinnabar, the liquid drawn out by the upturned moon.\nThus it is said: Black Lead enters the upturned moon, pairing as husband and wife. Yin soul unites with yang spirit, and the two natures naturally harmonize.\n\nThe formula states: Employ the Five Agents—*qian*, *kun*, *zhen*, and *xun*—the straight tally nurtures from the inception of *jian*, when the first yang arises. *Zi* and *wu* correspond, eight eights interconnect, shifting with the hours. The sun, moon, and five planets, the coming and going of cold and heat, day as yang and night as yin—every forty-five days, a new phase arrives. Yin and yang adjust and submit, moving and returning, circulating through the sixty-four hexagrams in endless cycles. Water and fire follow one another, dwelling without external things—the Five Metals and Eight Stones are subject to human transformation.\nThe Five Metals are the Five Agents; the Eight Stones are the Eight Trigrams.\n\nThe formula states: Water meets the dragon and becomes rain; fire meets man and moves yin and yang. *Qi* governs the growth of all things; the dragon’s movement and rain’s descent bring all things to life.\nThe Reverted Elixir nurtures creation, not exceeding the Five Agents.\nThe formula states: When the straight tally first stirs, water is pure and timing is not lost. The civil fire does not exceed nine; the martial fire does not exceed nine.\nNine is the extreme of yang. Three threes make nine—the utmost of *daguo*, the inception of yin’s birth. When yin is exhausted, yang arises—all follows the Dao of heaven, with yin and yang in motion.\nIf gold and water are balanced, the seasonal nodes are followed. If the sequence is lost, gold and water perish.\nMovement is like a silkworm warming and hatching eggs, receiving *qi* to generate life. The workings of mutual generation and destruction resemble the transformation of a cold valley into spring—yin and yang, the Five Agents, mutually employ one another, all established through analogy.\n\nThe formula states: Essence is original *qi*. It is born in the southern fire of *bing* and *ding*—*li*, lodged in the two yang lines with one yin arising, the sun’s soul, yin mercury, water.\nWhen its *qi* is full, it shifts to the northern water of *ren* and *gui*—*kan*, lodged in the two yin lines with one yang arising, the moon’s spirit, yang mercury, metal.\nWater is still and unmoving, the body of non-action. Fire is blazing and ceaseless, the ancestor of action. Bringing the active under the control of the inactive completes the wondrous Way.\nThus, know that metal is born in dark yin places—this is the inception, the correspondence of *zi* and *wu*.\n\nThe formula states: When gold enters the Central Palace, it is the Great One’s *geng* city. It nurtures the yellow *qi*, blending its original essence.\nThe Red Horse guards the Yellow Crow; the Azure Dragon rides the White Tiger. Control and submission follow their kind—hence the name *Cantong*.\nIt is also said: *Kan* and *li* are one and two—south and north alone form the path.\nOne is water; two is fire. All things are born through water and completed through fire. Fire and metal contend; water and earth overcome—thus the Great Elixir is achieved.\nThe straight tally first stirs in *zi*, the eleventh month, arising from *zhen*. In the fourth month, fire reigns, extreme yang retreats. Then it arises from *xun*—the two woods gradually submit.\nThough mercury is initially subdued in *qian*, it is not yet the Fire Elixir. After guarding and revolving for three phases, it is called Cinnabar Sand; after five phases, Gold Sand. After one year, it is called Long Sand or the Lesser Reverted Elixir; after two years, the Soul-Returning Elixir or the Middle Reverted Elixir.\nAfter one thousand days, when the *qi* is full, it is called the *Qi* Beast Great Reverted Golden Liquid Elixir—ingesting it grants immortality.\n\nThe formula states: Those who cultivate the Golden Elixir without awakening to the mysterious principle fail because they do not comprehend that cinnabar is the root of lead’s transformation. Lost in confusion, they mistakenly use common mercury, common lead, gold, silver, realgar, and azurite.\n\nThe common lead is the mother of worldly silver; realgar is the child of the medicine; cinnabar is the mother of lead; yellow is earth, and earth is the parent of cinnabar. Azurite belongs to *jia*, the parent of fire; azurite belongs to wood, stationed in the east. The unenlightened mistakenly use mercury, common lead, gold, silver, realgar, and azurite as medicines, or as crucibles and vessels, or as mother and child, or refine lead to extract its flower, or mix stones into the medicine—from ancient times to the present, none have succeeded.\n\nThe root of the Dao, the path of immortality, lies in unity before one’s eyes. Cinnabar, the essence of wood, is born from earth and dies in earth; its arising and ceasing do not depart from the Five Phases. They alternately serve as parents, mutually overcoming and generating to form substance.\n\nThe formula states: *Qi* sustains life—this is the Inner Elixir. Medicine preserves form—this is the Outer Elixir. For attaining long life through ingestion, nothing surpasses the Inner and Outer Elixirs, the radiant *qi* of the sun and moon. This radiant *qi* is the primordial harmonious *qi* of cinnabar, the very foundation of nature and life. Beyond the essence of the Inner and Outer Elixirs, the five metals, two azurites, four yellows, miscellaneous stones, magnetite, and five alums are not within the scope of discussion.\n\nThe formula states: Consider mercury—solitary yin, widowed yang—it corrodes bones and searches marrow. Gold damages the liver; silver damages the spleen; copper damages the kidneys; lead and tin damage the stomach. The four yellows are highly toxic, all possessing material nature, severing yang and harming the primordial harmonious *qi*. To speak of a single metal or stone is not to speak of common metals or stones. The six waters of the world are all highly toxic; though no immediate harm may appear upon ingestion, they ultimately cause great injury. Cinnabar, if governed by minor auxiliary methods, can treat worldly illnesses and slightly prolong life, but it cannot grant immortality.\n\nThe method states: Using the four ingredients—prepared sulphur, realgar, and azurite—to make vessels, when they mutually subdue one another, success is achieved. If various toxic medicines are suppressed and forced together, the resulting conglomeration of *qi* is impure and cannot be ingested. Exercise caution.\n\nThe formula states: Common lead is the mother of worldly silver; within the ore, it receives sufficient yang *qi* and naturally subdues fire. When smelted, it becomes worldly silver.\n\nThe formula states: Mercury and the mercury within cinnabar may appear similar in form, yet they differ as distinctly as man and woman. Cinnabar resembles man, the essence and spirit of the Great Yang sun, capable of preserving human nature and life. It inherently contains mercury to subdue and restrain itself, neither mingling with external mercury nor being forced by external substances—thus it benefits human nature and life. Common mercury resembles woman, the essence and soul of the Great Yin moon, capable of seizing human nature and life. Solitary yin, widowed yang, it is highly toxic and cannot be ingested.\n\nThe formula states: Though the yin and yang natures of mercury differ, they are both the essence of heaven and earth, resembling the distinction between male and female yin and yang. When cinnabar is governed by minor auxiliary methods, common lead may be used as a vessel to frame and complete the medicine.\n\nThe formula states: The unenlightened do not know the root of the Yellow and White; they mistakenly use common mercury, common lead, gold, and silver as supreme medicines. Little do they realize that mercury is born from lead, and cinnabar is produced from gold. In the Golden Elixir, one must know that lead is the foundation of *qi* and its transformation—how can one abandon the root and rely on external things? Lead is the child, the essence of cinnabar; *qi* is the mother, the earth that generates essence—hence it is called the root lead *qi*.\n\nThe formula states: Celestial lead is vermilion lead. Gold is born from lead, meaning the child is concealed within the mother’s womb. The child is also hidden within gold, meaning the mother is concealed within the child’s womb. Lead is the Yellow Sprout; yellow is earth; sprout is cinnabar. Earth can generate sprouts, hence it is called the Yellow Sprout. Lead and mercury are the fine matchmakers of the Seven Treasures and the marrow of the Five Metals. When understood, all matters become clear; when deluded, all paths are blocked. Thus, lead restrains mercury, and lead and mercury mutually complete one another to form the Way of the Yellow and White.\n\nThe formula states: The Dao consists of one yin and one yang; the Elixir consists of one metal and one stone. Stone rides the yang and is hot; metal receives the yin and is cold. This is the mutual resonance of spirit and soul, an inevitable principle. Stone liquid stabilizes the spirit; metal essence stabilizes the soul. Without the interaction of yin and yang, how could one await the depths of the Nine Darks?\n\nThus it is said: The gentleman seeks a fine companion, as the virtuous maiden is his perfect match. The Old Woman of the River is numinous and most divine. When she meets fire, she flies, leaving no trace of dust. Ghosts hide and dragons conceal themselves—none know where they reside. To subdue her, the Yellow Sprout is the root. If one does not enter the Yellow Sprout and burns mercury alone, even with a vessel a foot thick and sealed a hundredfold, when fire is applied, it will fly away, leaving nothing behind in an instant, like a ghost vanishing into darkness or a dragon hiding in the watery abyss. Even with the eyes of Li Lou, one could not perceive its trace. That water cannot flow east or west is the power of the Yellow Sprout.\n\nThe formula of the Primordial Lord states: The Yellow Sprout is the *jia-zi* of the Five Phases. *Jia* belongs to wood, the parent of yang. The mother belongs to the *qi* of earth. After the winter solstice, one yang surges forth—this is called the birth of one yang. The sprout receives *qi* from the mother earth and is named *jia*. *Jia* relies on earth to sprout; the sprout depends on the mother. The mother is *kun*, which is the Yellow Sprout of *gui*. The position of the Six *Jia* is imprisoned, dead, resting, or abandoned—all share one *jia*, which is extinguished in *gui*. The Five Grains, Five Vegetables, flourishing grasses and trees, the myriad creatures born from wombs and eggs, medicinal substances, and people—all arise from the Yellow Sprout. The yang *qi* is warm and diffuse, moving the earth to act, breathing as a fetus breathes. All things in spring and summer disperse and grow as the Yellow Sprout; in autumn and winter, they contract and mature, each returning to its color and original flavor, unchanged in form—hence the meaning of Reverted Elixir is to return to the root. If a person alters their constant nature, they must die; if a thing changes its color, it must decay.\n\nThus we know that medicinal substances move directly, the yang *qi* bears and transports, yet they do not alter their original form—aligned with the celestial fire in creation. The Reverted Elixir receives *qi* and returns to the root. The yang *qi* shines and congeals by the natural Dao, hence called the Yellow Sprout. People of the world do not know that when the Three Luminaries of heaven and earth first divided into clear and turbid, all people and the myriad things arose from the Yellow Sprout, born without transcending the Five Phases. The Yellow Sprout is the first budding, stretching, and bending of the initial sprout. It coalesces through yang and is born through yin, where yin and yang intersect. At the moment of receiving *qi*, it is initially a primordial chaos. After the separation of clear and turbid, the Yellow Sprout first emerges. In *jia*, it is called \"yellow\"; in the crescent, it is called \"sprout\"; in extension, it is called \"bud\"—hence the name Yellow Sprout. Thus we know the primordial does not depart from the Five Phases: the Five Phases are metal, wood, water, fire, and earth. Water is said to moisten and descend; fire, to flame and ascend; metal, to follow and transform; wood, to bend and straighten; earth, to sow and reap.\n\nThe formula states: The great Dao of heaven and earth endures forever; the *qi* of primordial harmony grants long life, yet none surpass the sun, moon, and stars. Yin and yang, the Five Phases, all depend on earth to be born and ultimately return to earth. They follow the four seasons in cyclic transformation—this too is the natural Dao. For instance, animal fat, receiving the *qi* of the great yang for a thousand years, transforms into *fushen*. After another thousand years, it becomes amber; after yet another thousand, it becomes crystal. All are the essence of the sun and moon’s radiant *qi*, congealed into essence by illumination. Another example: toads and frogs playing in the moonlight, clams and oysters bearing pearls—all gather and receive the *qi* of the great yin’s lunar radiance, forming pearls in the womb. These pearls are the congealed yin essence of the moon. Both substances are fit for ingestion, particularly effective for lung *qi*, fright and evil, and forgetfulness. Form them into pills with wood honey, the size of sesame seeds, and take three after meals with saliva—pearls from clams can restrain mercury.\n\nWhen a person cultivates inner virtue and power, the *qi* of primordial harmony surges and harmonizes. Through cultivation and embracing the Dao, essence congeals into a pearl, naturally granting long life. The pearl resides in the red waters—red waters are blood. Consider birds, beasts, insects, ants, fish, and crabs: all that dwell and endure receive the *qi* of primordial harmony, sustaining life without reliance on parental instruction. How could they attain enlightenment? By steadfast resolve, harmonious resonance in sound, mutual resonance among things, interpenetration of being and non-being, yin and yang embracing to fulfill the great Dao—when the two *qi* harmonize, being and non-being distinguish yet complete each other, realizing the true Dao.\n\nThe River Chariot is the master of the Five Metals, also the northern position. Water can ferry the chariot, bearing the myriad things; its wheels turn without cease. This is yang dwelling in the yin position, yin uniting with yang essence—when metal and mercury meet, it is called the River Chariot. The Dao of primordial harmony is the ancestor, establishing heaven and earth, regulating yin and yang. The four seasons proceed, and the myriad things are born. Receiving *qi* is called destiny; the most numinous is humanity. No blessing surpasses life, no misfortune surpasses death. Yet hating death while desiring life is to lose the Dao and fail to attain life. Strive, strive!\n\nMoreover, what I have annotated differs from other schools, its meaning aligning with the orthodox classics, its principle resonating with the great Dao. In discussing hexagrams and images, fire timing comes first; in selecting yin and yang, medicinal substances are primary. *Can* means to blend. Water, earth, and metal—three substances—form one family, like tallying tokens or contracts, uniting in a single principle, hence called *Cantong* (Triple Unity).\n\nThe formula states: The myriad things are not born without the sun and moon; metal and water are not perfected without fire and earth. Metal and water are the origin of transformation; fire and earth are the beginning of yin and yang. When heaven and earth were in primordial chaos, they were silent, though not yet transformed, they were ultimately the root of the myriad things. Metal is white, water is black; they meet within *qi*, resembling a chicken’s egg. The yang burning-mirror gathers fire, yet without the sun, it does not emit light. The Dog Rong use a fire-mirror to hold mugwort, transforming it in an instant—thus fire emerges, resembling the Reverted Elixir, the union of yin-yang metal and fire. Such things also exist within the Great Tang’s domain, but \"words cannot exhaust speech, nor speech exhaust meaning.\" Yet can the intent of the sages not be glimpsed?\n\nThose who use common mercury to make the Golden Elixir are deluded. Those who speak of cinnabar without grasping its principle do not know the Dao—they have strayed far from the truth. Some say: Using common mercury and common lead yields no numinosity, for they fail to comprehend the true essence of mercury and true lead, only praising the efficacy of common lead. They do not speak of mercury’s subtlety and wonder, insisting on singular success without acknowledging dual excellence. If common lead is used as medicine, it strays far from the Dao. If common mercury is used for the Golden Elixir, it is not the true method. Those who grasp it rightly take mercury and fire-lead as primary. As long as lead retains its original *qi*, encountering the Five Phases, it forms the Elixir without losing its root. If one comprehends primordial transformation, a single application yields boundless marvels. If one clings to external things as emotion, nature cannot unite. If mercury is substituted for cinnabar, lead cannot be embraced. If nature cannot unite the Three Palaces, how can it be secured? If lead cannot embrace the Eight Stones, how can it be wondrous?\n\nGold retains its original weight; gold does not lose its heaviness. The sun and moon retain their usual forms. Yin mercury does not lose its weight—this is the sun and moon’s gold, retaining its original heaviness. My destiny lies in lead; lead does not lose heaven. When lead completes the Reverted Elixir, gold endures for ten thousand myriad years. Lead is the two mercuries, originally one body without duality—hence called celestial lead. Do not harm my lead, that my destiny may be preserved. Do not break my chariot, that I may return home. Lead is that which naturally arises within cinnabar; the chariot is the liquid drawn from cinnabar. Within lead is gold; within gold is return. Discerning treasure from treasure, the worthy attain the Dao. Lead is that which naturally arises within cinnabar; gold, through fire’s movement, returns with the moon.\n\nThe Perfected One speaks: the golden essence and yellow sprouts possess the power to restrain water from overflowing—this is the Dark Water. The golden essence and yellow sprouts share a name, being the self-generated lead. Water is the liquid drawn from cinnabar. To use lead or not to use lead—without it, one cannot attain longevity. Using lead means the cinnabar naturally contains lead to restrain it. Not using lead refers to the mother of common silver, which is ordinary lead. If lead is not true, the supreme Dao is hard to attain. If lead is true, one does not lose one’s household retainer. If lead is not true, it is ordinary lead. If lead is true, it is cinnabar-lead. Better to refine the gold within lead—this is the gold self-generated within cinnabar. Do not refine the treasure within gold—this is common mercury. The sage clearly sets forth analogies to instruct later learners.\n\nWhat is the crucible? It is the native soil where raw cinnabar is born. What is the medicine? It is the mercury that naturally flows from cinnabar. Fire-lead is the mercury produced when cinnabar is moved by the sun and moon. Water-silver is another name for mercury, drawn from cinnabar when its yang qi is insufficient. When mercury resides within cinnabar, its essence incomplete, it is called the maiden. When fire-lead resides within cinnabar, its essence complete and self-generated, it is called the youth. Male and female unite, yin and yang naturally harmonize, their union free from any foreign element. The Golden Elixir originates from a single substance, with nothing external added; through the movement of yang qi, it is called the Dao of the Three-in-One. The white is the essence of metal, the black the essence of water—they return to oneness without duality. The sage borrows the hexagrams of the *Zhouyi* as metaphors, moving and refining the elixir through reversal of time. When the hun and po are lost, like the sun and moon eclipsing and losing their positions, they do not submit to one another. The sage guards this secret, unwilling to speak plainly, often using veiled language. From this, scriptural instructions diverge, and many fail to succeed. Some, despising the loss, incur great resentment.\n\nThe method of the golden crucible must be guarded with care. When medicines are combined, achieving efficacy is difficult. The heavenly Dao is secretly revealed, sometimes hidden in celestial images, sometimes attached to yin and yang, falsely expounded among men. Its words are subtle, its principles profound, yet some remain deluded and uncomprehending. Since the time of Fuxi, those who sought the Dao and long life have been many, but those who encountered and attained it have been few. Relying on their own conjectures without discernment, and without seeking a teacher’s instruction, they compose their own formulas, seeking the way to transcend the world. In vain, they toil in famous mountains and deep valleys, decaying like foolish scholars. Those who seek immortality never attain it. Eating the five grains, indulging the six desires, man dwells in yang, ghosts in yin. Unable to command ghosts and spirits or direct yin and yang, they fail to obtain the elixir of transcendence and all perish in the world. Like seeking warmth by grasping silk in the cold or drinking water to ride the wind in the heat, born within the bounds of yin and yang, governed by the five phases, consuming earthly things, they return to earth at death, repaying the earth with their bodies to revert to their origin.\n\nWithout encountering the radiant qi of the sun and moon, circulating their essence and fluids, and refining the Reverted Elixir of the Three-in-One, how can one transcend the world? They crowd together like walking corpses, like stones cast into rivers, gone without return, sinking into servitude and transformation—truly pitiable. But if one encounters the inner and outer Golden Elixir and consumes it, the body is transformed and appearance preserved in an extraordinary manner. One can escape the bounds of yin and yang, free from the five phases’ control, unrecorded in the registers of death, with ghosts and spirits as attendants.\n\nThe scripture states: Daoist books and immortal transmissions, secret records of elixir classics—*The Dragon and Tiger*, *The Supreme Clarity Scripture*, the five works akin to the *Zhouyi* hexagrams, the songs and verses of the *Cantong Qi*—all expound the sages’ intent. The Yellow Emperor, Laozi, Confucius, and the twenty-four Perfected Immortals were all immortals who attained the Dao. Worldly people, deluded and uncomprehending, must cultivate practice to achieve it. There are also unnamed individuals who attained it and concealed it. Those who deny the existence of the immortal Dao are truly foolish and deluded. All the songs, records, scriptural instructions, and hexagrams reveal only branches and leaves, not the direct path. From ancient times to the present, one must receive oral instructions from a teacher to succeed; without the proper destiny, one cannot learn it. Those who transmit this method must treasure and guard it, for the heavenly Dao must not be lightly revealed. Nurturing a tiger invites it to bite you; entrusting it to the unworthy brings calamity for seven generations, demoting one to a lowly ghost, eternally serving the ghost officials—how can one not fear this?\n\nEven when one finds a worthy person, one must still examine their conduct. Only those of unwavering inner practice and destined signs may receive the transmission. One must first purify one’s intent, invoke the hundred spirits, swear oaths, and establish a covenant before passing it on—this must be done with utmost care. Cultivation must be unwavering, the supreme medicine peerless. When human Dao aligns with the primordial principle, it can naturally be encountered. One must endure hardship and toil without complaint, not seeking it hastily or recklessly. Upon meeting an enlightened teacher, one awakens to the great medicine through a single word—there is only one gate. The three substances—water, earth, and metal—are not the common water, earth, and metal of the world. Attaining them, the hun and po return, and one achieves long life without death. With a mind of unwavering practice, the teacher will surely come.\n\nThe Golden Elixir and Inner Elixir, once their gate is attained and consumed, confer immortality, equaling heaven and earth in duration. The secret method of long life, called the *Elbow-Behind Method*, is revealed to later learners who fail to comprehend. The construction of the crucible, the addition of metal, the use of the direct tally, and the hexagram timing of the clepsydra are not recorded here—those who understand should examine and consider them carefully.\n\n**Method for Unchanging-Colored Sulfur:**\nTake a duck egg, remove the yolk and white, and wipe the inside clean with paper. The opening should be small. Once dry, take fine yellow sulfur, grind it, and mix it with egg white until slightly moist. Fill the egg with this mixture, packing it tightly with a chopstick. Seal the opening with egg white mixed with lead powder to ensure it is airtight.\n\nThen mix red lead with egg white to form a paste, and coat the entire duck egg with it to a thickness of approximately two *fen*. Once dry, apply yellow clay to a thickness of two *fen* and let it dry in the sun. Next, wrap it finely with lead, layering it to a thickness of four or five *fen*, repeating this process three times. Stand the egg upright in an iron mortar, then pour molten lead over it until half-submerged. When cool, pour more molten lead to cover the top, leaving a thickness of five or six *cun* above. Around the mortar, construct a mud fire furnace as usual, placing fire at three points to keep the mortar slightly warm, ensuring the lead does not melt completely. On the fourteenth day, apply intense heat to melt the lead, and once melted, skim off the floating dross and collect it. When cool, open the egg to find the sulfur subdued by fire, its color unchanged. This can be used to prepare a vessel for subduing cinnabar and mercury. One *liang* of subdued sulfur can subdue half a *liang* of raw sulfur in five days, which is also sufficient for the fire-subduing process.\n\n**Wood-Elixir Formula:**\nTake one *hu* of wood, wash it clean with water, dry it, and pound it finely into powder. Boil it in two *hu* of clear water until soft, then strain the liquid through silk. Steam the liquid in a copper vessel over boiling water. Add one *sheng* of white honey and one *sheng* of pitted, mashed dates, blending the pulp and skin thoroughly. Mix this into the wood liquid, stirring until it reaches a jerky-like consistency. Take daily a piece the size of a bullet, three or four pieces, and all illnesses will be cured, no evil will harm you, your complexion will glow, your ears and eyes will sharpen, and after three years, your face will resemble that of a maiden. You will become an immortal and never die.\n\n**Another Formula:**\nTake one *hu* of wood, wash it clean, dry it, and pound it into powder. Remove the pits from four *dou* of large dates, mix with five *dou* of wine, and simmer slowly while stirring until it forms a thick syrup. Take daily three pills the size of a plum, and no illness will harm you. Your face will become like that of a child, and you will withstand cold and frost.\n\nThe *Secret of Penetrating the Profound* concludes here.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "通幽诀 经名：通幽诀。 撰人不详，约出於唐宋间。 兼书内外丹诀。 一卷。 底本出处：《正统道藏》洞神部众术类。 通幽诀 诀曰：宝丹本乎一物，而生二。 二主火，寄位丙丁，生於甲。 初九，潜龙一爻生，建阳在子，天符发泄，惊垫受气於母。 母者土也。 道生於一，一生二，二生三，三者阳极之父母。 阳者，天地之精，故名三五与一，还丹之本基。 天符者，日信。 日者，天地之元精，五行之始照。 曜以事继日，以日继月，以月继时，以时继年，所以记远近，别异同也。 初分混沌精气阴阳，斗建十二辰，推移运转，刻漏不停，发泄交媾，万物化生而成形。 天符者，信也。 能发泄万物，运动返本，而成精气。 潜运结为精，精化为砂，色禀南方丙丁火，外阳而内阴，主男，日之阳魂。 日月之华气，照曜天地。 太阳太阴冲和之气，交腾受气，一千八十年结精气。 丹砂天符照曜，又一千八十年，成丹砂，名朱砂也。 阳中阴，号日太阳、朱雀石，主水。 元和之气未足； 日丹砂。 亡万天铅，帝男精，龙女血，化南作北，抽出未化为阴汞，主水。 水数一，故云汞生於铅，阳为臣也。 天铅神水，天符运动，照曜丹砂，养育又一千八十年，天火化为太阳，阳气足，阴气衰，阳气盛满流缢，回而自生色，禀北方壬癸水，外阴而内阳，主女月之阴魂，非人间之凡物。 故之赤水中自生者，流为阳汞，名曰天铅之精，黄芽之祖。 是日月之华气水，化为天然还丹。 天符又照曜一千八十年，合四千三百二十年，元气足，自然成还丹。 天然伏火黑色，转北成西，西主金，金数四，水基也。 故知三五与一，天地至精。 三者火也，五者砂之父母，一者砂之元祖。 轮还运转，精气元和，相感成形，不越於一。 一者，夫道之本宗，水也。 学者不悟朱砂是铅，铅中生子是金。 即一物阴阳，运动自制伏，阳中阴，阴中阳，玄中玄，名日玄武石，转水成金。 故云：砂产於金阴，为君铋金。 天符运动，都计四千三百二十年照曜，父母养育，成天铅，自然还丹。 诀曰：后圣用火喻爻象，月计三百六十时，年计气候四千三百二十时，合四千三百二十年，气候喻合，天符自然还丹。 故云：朱砂汞金水，龙虎五行，合体归一，无二得五。 以地符依卦节气候运动，以成金丹。 诀曰：其丹砂精魂，出自中华十二分野内，主一宫坤地西南隅，其宝天地至精元气，以日月天符运动，交媾在五。 五者，戊己，中宫土也。 所生之处，生於福德山岗形势之地，气候骨肉俱全，水陆草木秀茂，土石坚贞异境，神灵卫侍，阴气施，阳气泄，包含孕育，照曜精气，得土而生，化为丹砂。 有砂之处，或昼或夜，或初晴之后，或阴暗之时，即有气候光彩，往往如日光而出，或没或见，唯采匠而鉴之。 今具载所出土产管属州县山谷之名，并异名等。 曰丹砂，曰朱砂，曰朱铅，曰铅中金，曰天铅，曰火铅，曰神水，曰华池，曰阴汞，曰阳汞，曰阳中阴，曰阴中阳，曰水银，曰五采石，曰五金，曰七宝主，曰还丹，曰天生芽，曰黄芽，曰五行之胎。 州县山谷名 桂府、辰、锦、衡、朗、邵、勾漏、都云、象都、永、梆、容，湖南等界，山石岩谷，形势滋茂处，并有。 如要采砂精不烹炼、天然自生出者，但於曾采砂处打石及穴填处，不问新旧，即有之。",
      "translated_text": "**Tongyou Jue**\n\n**Scripture Title:** *Tongyou Jue* (*The Formula for Penetrating the Mysteries*). The author is unknown, approximately dating to the Tang or Song dynasties. It records both internal and external alchemical formulas. One fascicle.\n\n**Source of the Base Text:** *Zhengtong Daozang* (*Daoist Canon of the Zhengtong Era*), *Dongshen* section, *Zhongshu* category.\n\n---\n\n**The Formula States:**\n\nThe treasure elixir fundamentally arises from the One, which then generates the Two. The Two governs Fire, residing in *bing* and *ding*, born of *jia*. At the *Initial Nine*, the *Hidden Dragon* first line emerges, establishing Yang in the *zi* position. The *Celestial Tally* releases and disperses, startling the mat to receive qi from the Mother. The Mother is Earth.\n\nThe Dao is born of the One; the One generates the Two; the Two generates the Three. The Three are the ultimate parents of Yang. Yang is the essence of Heaven and Earth, thus called the *Three-Five and One*—the fundamental basis of the Returned Elixir.\n\nThe *Celestial Tally* is the *solar sign*. The Sun is the primordial essence of Heaven and Earth, the first illumination of the Five Phases. Its radiance follows the affairs of the day; the day follows the month; the month follows the seasons; the seasons follow the years—thus measuring distance and distinguishing differences.\n\nAt the initial division of the primordial qi of Chaos into Yin and Yang, the Dipper establishes the Twelve Branches, shifting and revolving without cease. The clepsydra never halts; release and union alternate, and the myriad things transform and take form.\n\nThe *Celestial Tally* is the sign. It can release and disperse the myriad things, moving them to return to their root and become essence and qi. Subtle movement congeals into essence; essence transforms into cinnabar. Its color inherits the *bing-ding* Fire of the South—externally Yang yet internally Yin—ruling the male, the Yang soul of the Sun.\n\nThe radiant qi of the Sun and Moon illuminates Heaven and Earth. The harmonious qi of the Great Yang and Great Yin intermingle and ascend, receiving qi. After 1,080 years, essence and qi congeal. When the *Celestial Tally* shines upon cinnabar for another 1,080 years, it becomes cinnabar, called *Zhusha* (Vermilion Sand).\n\nYang within Yin is named the *Great Yang* and *Vermilion Bird Stone*, ruling Water. The primordial harmonious qi is not yet sufficient—this is the *solar cinnabar*. The *Celestial Lead* of the ten thousand heavens, the essence of the *Imperial Male*, the blood of the *Dragon Maiden*, transforms South into North, extracting the untransformed Yin Mercury, ruling Water. Water’s number is One, thus it is said that Mercury is born of Lead, and Yang serves as the minister.\n\nThe *Celestial Lead* and *Divine Water*, driven by the *Celestial Tally*, illuminate cinnabar, nurturing it for another 1,080 years. Heavenly Fire transforms it into the Great Yang; Yang qi becomes sufficient while Yin qi wanes. When Yang qi flourishes and overflows, it turns back and generates its own color, inheriting the *ren-gui* Water of the North—externally Yin yet internally Yang—ruling the female, the Yin soul of the Moon. It is no ordinary substance of the human realm.\n\nThus, that which arises naturally in the Red Water is called *Yang Mercury*, the essence of *Celestial Lead* and the ancestor of the *Yellow Sprout*. It is the radiant qi-water of the Sun and Moon, transformed into the *Natural Returned Elixir*. When the *Celestial Tally* shines upon it for another 1,080 years—totaling 4,320 years—primordial qi becomes sufficient, and the Returned Elixir forms naturally.\n\nThe naturally subdued Fire is black in color, turning from North to West. West rules Metal, and Metal’s number is Four, the foundation of Water. Thus, we know the *Three-Five and One* are the supreme essences of Heaven and Earth. The Three is Fire; the Five are the parents of cinnabar; the One is the primordial ancestor of cinnabar.\n\nThe cycle revolves and turns; essence and primordial harmony interact to form shapes, never exceeding the One. The One is the fundamental origin of the Dao—Water.\n\nScholars fail to realize that cinnabar is Lead, and the child born within Lead is Gold. It is but a single thing of Yin and Yang, moving and self-regulating. Yang within Yin, Yin within Yang, Mystery within Mystery—this is called the *Mysterious Warrior Stone*, turning Water into Gold.\n\nThus it is said: *Cinnabar is produced from the Yin of Metal, serving as the ruler and refining agent of Gold.* When the *Celestial Tally* moves, totaling 4,320 years of illumination, the parents nurture and form *Celestial Lead*, the *Natural Returned Elixir*.\n\n**The Formula States:**\n\nLater sages used Fire to illustrate the line images. A month comprises 360 hours; a year comprises 4,320 hours of qi and seasons. Combined, they total 4,320 years—when qi and seasons align, the *Celestial Tally* naturally forms the Returned Elixir.\n\nThus it is said: *Vermilion Sand, Mercury, Gold, Water, Dragon and Tiger, the Five Phases—united in body, returning to the One, no duality, attaining the Five.* By following the *Earthly Tally* and the hexagrams’ seasonal nodes, the Golden Elixir is accomplished.\n\n**The Formula States:**\n\nThe essence-soul of this cinnabar emerges from within the Twelve Divisions of China, ruling the *First Palace* in the southwest corner of *Kun* Earth. This treasure is the supreme essence and primordial qi of Heaven and Earth. Through the movement of the Sun, Moon, and *Celestial Tally*, union occurs in the Five. The Five is *wu-ji*, the central palace of Earth.\n\nThe places where it is born possess auspicious mountains and ridges, where qi, bones, and flesh are complete. Water and land flourish with lush grasses and trees; soil and stone are firm and extraordinary. Spirits guard and attend; Yin qi bestows, and Yang qi disperses. Enveloping and nurturing, illuminating essence and qi, it is born of Earth and transforms into cinnabar.\n\nWhere cinnabar exists, whether day or night, after initial clearing or during overcast moments, qi and radiance often appear, resembling sunlight emerging, sometimes vanishing, sometimes visible—discernible only to the adept miner.\n\nHerein are recorded the names of the mountains, valleys, and administrative regions where it is produced, along with its various appellations:\n\n*Cinnabar, Vermilion Sand, Vermilion Lead, Gold within Lead, Celestial Lead, Fire Lead, Divine Water, Radiant Pool, Yin Mercury, Yang Mercury, Yang within Yin, Yin within Yang, Quicksilver, Five-Colored Stone, Five Metals, Lord of the Seven Treasures, Returned Elixir, Heaven-Born Sprout, Yellow Sprout, Embryo of the Five Phases.*\n\n**Names of Administrative Regions, Mountains, and Valleys:**\n\n*Guifu, Chen, Jin, Heng, Lang, Shao, Goulou, Duyun, Xiangdu, Yong, Bang, Rong*, and the borders of *Hunan*, among other places. In the mountains, rocks, and valleys where terrain and vegetation flourish, it is found.\n\nIf one seeks the essence of cinnabar without refinement—naturally self-generated—simply search in previously mined areas, where stones have been struck or cavities filled, regardless of whether they are new or old; it will be present.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1267,
      "start_sentence": 0,
      "end_sentence": 52,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.14183592796326,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\通幽诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "新坑及古者不定有之。 丹砂光明在床，有君臣自然四面，有朝揖而生者，色如未开红莲，通透曜日，或如芙蓉，紫色通透，形貌如筝者，或片段棱角成就，分明通光，并为上品。 或如云母片，白光者通透，一云白马牙，或颗粒两数，至一二斤者，在石中采得，颗粒碎红光明者。 或片段棱角白光者，入水中不见者。 或青光分明，棱角成就者，并为中品。 与上品同用，堪为至药。 或有铁色者，及竹溪谷、土穴、并水中采得者，或颗不定分两多少，及掬得末砂，并为下品。 但川源滋茂，抽得液制伏，只得治世疾，不延驻，不堪为至药。 亦比人之百寮，为上中品，无名位者为庶品。 则卑贱无自专之分，不能致人非常之事。 故喻云：只治世疾，不延驻。 天符，日。 《春秋》天符之日。 日者阳之精魂，天之理也，故照曜光明。 《淮南子》曰：积阳之热气，交腾为火。 火之精为日，光明威精之义也。 又云：日生於甲，重阳之位。 火生於震，震位辰巳。 震为长男，巽为中男，南火之父母。 火曰曾，木曰青，万物之使，故云曾青。 阴符，月。 《春秋》阴符之月者。 阴之精魄，地之理也，昭一曜光明。 《淮南子》曰：积阴之寒气，交腾为水，水之精为月，满而缺者，感日之义也。 又云：月生於庚，重阴之位。 水生於兑，兑为少女，水之父母。 所以男依日束立，女之象月，生而西端。 丹径之丹砂，日月之华气，性命之根基，与内外元和，般载成形，饵之故长生不死，日月之感精，故曰阴符。 月之所生，日之所育，阴阳用事，生成依於母，母曰土。 日月二宝，是天地至灵。 卑情感精，变化照曜，结成砂，始名朱雀石。 七十二石最尊，莫过於汞。 感於二十四气，通於二十四名，变化成丹。 乌餐成凤，蛇饵成龙，人食长生，天地同寿，收人魂魄，返老归童，呼吸风云，玉女来侍，即大丹之功力也。 诀曰：铅者，即砂中抽出之液，主水，阳中阴，汞也。 从砂中自生出者，主金，阴中阳，汞。 诀曰：是以不容之木，受制於金。 金孕水安，水必存金。 木孕火制，火必假木。 所以铅水制汞水，铅火制汞火，水合其性，火合其形。 诀曰：铅水者，是砂中自生出者，主阳汞。 汞水者，是水中抽出者液，主阴汞。 是铅水制汞水。 又云：铅火者，自生之金。 汞火者，是抽出之液也。 水是铅火制汞火，多不晓此，故名金汞道耶。 日者，是太阳之火精，即朱汞，为龙是也。 月者，是太阴之水精，是铅银，为虎是也。 龙者，阳之气。 九之极数，木之无也。 虎者，阴之气，四之极数，金之有也。 诀曰：以无制有，合成其道。 故云：丹砂木精，得金乃并。 参铢不偏，至圣至灵。 世人不悟，见金视之如土。 药歌曰：太玄阴符，道生阴阳。 阴阳生五行，五行合而为还丹。 故名龙虎。 天有三尊，日月星。 地有三尊，江河海。 人有三尊，君父师。 身有三尊，三丹田。 药有三尊，土火金。 故乾坤者，上下父也。 坎离者，水火为药也。 震巽者，运卦也。 运经三载，自然还丹，即太元之气，何以不成丹矣。 诀曰：计一万二千九百六十时，大小月及闰月并不在用很，归其实数也。 一气不足，与瓦砾无殊。 万象精通； 神灵自契。",
      "translated_text": "Newly opened mines and ancient ones do not necessarily yield it. When cinnabar glows radiantly upon the matrix, with a natural hierarchy of lord and minister on all four sides, or when it grows in obeisant clusters—its hue like an unopened red lotus, translucent and luminous as the sun, or resembling hibiscus, purple and diaphanous, its form like a zither; or when it appears in well-defined flakes with sharp edges, clearly lustrous—these are all of the highest grade. Or when it resembles mica sheets, white and translucent (also called \"white horse’s tooth\"), or occurs in granules of two or three, even weighing one or two catties, extracted from stone, with granules of bright red, fragmented brilliance. Or when it appears in flakes with sharp edges and white luster, invisible when submerged in water. Or when it exhibits a clear blue-green luster with well-formed edges—these are all of the middle grade. Though used similarly to the highest grade, they suffice as supreme medicine. Varieties with an iron-like hue, or those gathered from bamboo-lined valleys, earthen caves, or water, with granules of indeterminate weight, or mere handfuls of powdered cinnabar, are of the lowest grade. Though the land’s veins may flourish and their essence be drawn and subdued, they serve only to cure worldly ailments, not to prolong life, and are unfit as supreme medicine.\n\nThis is akin to the ranks of officials: the highest and middle grades hold titles, while those without are common. The lowly lack autonomy and cannot achieve extraordinary feats. Hence the saying: \"They only cure worldly ailments, not prolong life.\"\n\n**Heavenly Talisman: The Sun.**\nThe *Spring and Autumn Annals* speaks of the sun as the \"Heavenly Talisman.\" The sun is the essence and spirit of yang, the principle of heaven, thus its radiant illumination. *The Master of Huainan* states: \"The accumulated heat of yang qi surges and transforms into fire. The essence of fire is the sun, embodying the power of luminous brilliance.\" It also says: \"The sun is born in *jia*, the position of double yang. Fire is born in *zhen*, the *chen-si* position. *Zhen* is the eldest son, *xun* the middle son—they are the parents of southern fire. Fire is called *ceng*, wood is called *qing*; they are the agents of all things, hence the term *cengqing*.\"\n\n**Earthly Talisman: The Moon.**\nThe *Spring and Autumn Annals* refers to the moon as the \"Earthly Talisman.\" The moon is the essence and spirit of yin, the principle of earth, casting its singular luminous glow. *The Master of Huainan* states: \"The accumulated cold of yin qi surges and transforms into water. The essence of water is the moon, which waxes and wanes in response to the sun.\" It also says: \"The moon is born in *geng*, the position of double yin. Water is born in *dui*, the youngest daughter—they are the parents of water. Thus, men stand to the east of the sun, while women, like the moon, rise in the west.\"\n\nThe cinnabar of the alchemical path is the radiant essence of the sun and moon, the root of life and destiny. In harmony with the inner and outer primal forces, it assumes form through transformation. Ingesting it grants immortality, for it is the union of the sun and moon’s essences—hence the term \"Earthly Talisman.\" The moon’s birth and the sun’s nurturance depend on yin and yang’s workings, which in turn rely on their mother: earth. The sun and moon are the most numinous treasures of heaven and earth. When base emotions stir their essences, they transform and illuminate, coalescing into cinnabar, first called the \"Vermilion Bird Stone.\" Among the seventy-two stones, none surpasses mercury. Responsive to the twenty-four qi and corresponding to the twenty-four names, it transmutes into the Elixir. When crows consume it, they become phoenixes; when serpents ingest it, they become dragons; when humans partake, they attain longevity, sharing the lifespan of heaven and earth. It gathers the hun and po souls, reverses aging to return to youth, summons wind and clouds, and commands jade maidens to attend—such is the power of the Great Elixir.\n\nThe formula states: Lead is the liquid drawn from cinnabar, ruling water, yang within yin—mercury. That which naturally emerges from cinnabar rules metal, yin within yang—mercury. The formula states: Thus, the unyielding wood is subdued by metal. When metal nurtures water, water must preserve metal. When wood nurtures fire, fire must rely on wood. Therefore, lead-water governs mercury-water, and lead-fire governs mercury-fire, harmonizing their natures and forms.\n\nThe formula states: Lead-water is that which naturally emerges from cinnabar, ruling yang mercury. Mercury-water is the liquid drawn from water, ruling yin mercury. Thus, lead-water governs mercury-water. It also says: Lead-fire is self-generated metal. Mercury-fire is the drawn liquid. Water is lead-fire governing mercury-fire. Many fail to grasp this, hence the term \"Golden Mercury Dao.\"\n\nThe sun is the fire essence of Great Yang—vermilion mercury, the Dragon. The moon is the water essence of Great Yin—lead-silver, the Tiger. The Dragon is the qi of yang, the utmost of the number nine, the non-being of wood. The Tiger is the qi of yin, the utmost of the number four, the being of metal. The formula states: \"Use non-being to govern being, and the Dao is complete.\" Hence it is said: \"Cinnabar, the essence of wood, unites with metal. In perfect balance, it becomes supremely sacred and numinous.\" Yet the world does not awaken; people see gold and regard it as mere earth.\n\nThe *Song of the Elixir* says:\nThe Great Mystery and Earthly Talisman give birth to yin and yang.\nYin and yang generate the Five Phases, which unite to form the Returned Elixir—\nHence the names Dragon and Tiger.\nHeaven has three revered: the sun, moon, and stars.\nEarth has three revered: the rivers, lakes, and seas.\nHumans have three revered: ruler, father, and teacher.\nThe body has three revered: the Three Elixir Fields.\nThe Elixir has three revered: earth, fire, and metal.\nThus, *Qian* and *Kun* are the father and mother above and below.\n*Kan* and *Li* are water and fire as medicine.\n*Zhen* and *Xun* are the moving trigrams.\nAfter three years of circulation, the Elixir naturally returns—\nThis is the qi of the Great Origin; how could it not become the Elixir?\n\nThe formula states: Calculate 12,960 hours, excluding the varying lengths of months and intercalary months, to arrive at the true count. If even one qi is lacking, it is no different from worthless rubble. When the myriad phenomena’s essences align, the numinous naturally resonates.",
      "overlap_context": "inistrative Regions, Mountains, and Valleys:**\n\n*Guifu, Chen, Jin, Heng, Lang, Shao, Goulou, Duyun, Xiangdu, Yong, Bang, Rong*, and the borders of *Hunan*, among other places. In the mountains, rocks, and valleys where terrain and vegetation flourish, it is found.\n\nIf one seeks the essence of cinnabar without refinement—naturally self-generated—simply search in previously mined areas, where stones have been struck or cavities filled, regardless of whether they are new or old; it will be present.",
      "start_char": 1267,
      "end_char": 2486,
      "start_sentence": 53,
      "end_sentence": 123,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.33265924453735,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\通幽诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "诀曰：阴阳运转，气化为精，精化为朱，朱化为汞，汞化为金，金化为药，故号金砂，名曰大还。 大还者，返归之义。 丹者，赤色之名。 汞者，本体是金，金水相制，故号金砂，运本体得称大还丹． 土是阴符，戊己中宫五符，一云五气金鼎。 诀曰：五气制伏不飞，能生五彩，返归其母，饵之长生。 诀曰：丹砂，流汞父。 戊己，黄金母。 母数五，五是土，用土为鼎，制伏号曰金鼎。 土能生万物，金是土生，故为金父。 母者，金本生土，故曰土母。 水以土为鬼，土填水不起，戊己之功，名曰五符。 汞者非土不可制伏，土王金乡，三物俱求，依象帝王。 如人主有道，即四方来贡。 但辨得真铅汞二物，即是第一鼎法。 故为三物一家，都归戊己，金水无土制驭不成丹。 土母，季王十八日，余日休废囚死藏伏。 凡伏炼金鼎，推究阴阳，精气返还，刻漏不停。 雄黄喻土，而定四夷。 土者生金本土。 雄者男，黄者土，能偃水土，是金火，非关雄黄。 鼎主外上名五符。 世人不悟还丹本之父母，错用金银为母，或为鼎器，故元气不离於五，五不离於元气，混其名即一，辨其功即殊。 元气者，五才之君。 五才者，元气之臣。 君相臣临，而不可去也。 金丹用其元气，不越於五，五者五符也。 五符者，气。 气本无形，因精而生，内外含真，得饵不死不生。 金鼎药之表辖，表者气也，辖者鼎也。 鼎象鸡子，外白裹黄，与汞柑合，是用白金为器，器不离於五。 五者土，土者生金之土，委曲相制，似使无虞，令水不逃溢，戊己之功也。 诀曰：提剑偃戈，笼罩四方。 提剑者，金精本气五也。 偃其戈戟，如水得土而不流，是金死於土也。 大丹之基，丹砂。 丹砂是铅，本生於土，死亦归依於土，是用生丹砂土也。 世人知之有数。 鼎之异名，有曰外神水，曰华池，曰神室，曰匡郭，曰表辖，曰五气，曰白衣，曰丹衣，曰母舍，曰金鼎、曰神庐。 诀曰：五气者，其大笼罩八隅，小则潜藏一毫，吐坤呕输，出有入无。 诀曰：流珠九转，化为黄白。 自然相使，一阴一阳。 曰道须伏於金鼎，中宫之功，神通自在，孕育制伏，故云金鼎。 夫金丹，天地日月元和之气，照曜潜运，成为丹砂，砂中迥然而自生，乃为还丹。 如人育孕男女，皆由父母阴阳精气相成，而有还丹，象男女。 男生而覆，女生而仰，非但在生，死亦如此。 但投於水，雄者覆，雌者仰，天使其然，非干父母教令。 金水在於鼎中，象男女弄戏，男上女下，自得情意相符，以成其道。 诀曰：金丹虽得元基，须知本父母养育制伏。 父者，火之阳气也。 父能发泄运动而成之。 母者，土之阴气也。 母能含育生之。 母主中宫黄，黄者土，是生金之土。 丹砂初分受气，依於土而生，故云黄芽之本母也。 得阳而成，得母而生，故名土釜，曰母。 土者，五行之土，生成土也。 水火木金土，各居一方，运动正位，火来克金，土来克水。 水者，丹砂之子。 土者，鼎。 火者，运动相伐，而成形，得土相生。 土能制水，本气相感，以成大道之宗。 故云：知白守黑。 世人尽不知同类，相从相生，相克相制，以金生水，以土为鬼，土填水不起，戊己之功，名曰五符金鼎，知者无一焉。 地符火木之精",
      "translated_text": "The formula states:\nYin and Yang revolve, qi transforms into essence,\nessence into cinnabar, cinnabar into mercury,\nmercury into gold, gold into medicine—\nthus called \"golden sand,\" named the Great Return.\nThe Great Return means the meaning of returning.\n\"Elixir\" is the name of the red color.\n\"Mercury\" is fundamentally gold;\ngold and water restrain each other,\nhence called \"golden sand.\"\nWhen the fundamental body is refined, it is called the Great Return Elixir.\nEarth is the Yin tally, the central palace of Wu and Ji,\nalso called the Five Qi Golden Crucible.\n\nThe formula states:\nThe Five Qi restrain and subdue without flying,\nable to generate the Five Colors,\nreturning to their mother—\ningested, they grant longevity.\n\nThe formula states:\nCinnabar is the father of flowing mercury.\nWu and Ji are the mother of yellow gold.\nThe mother’s number is five; five is earth.\nUsing earth as the crucible,\nits restraining power is called the Golden Crucible.\nEarth can generate the myriad things;\ngold is born of earth, thus it is the father of gold.\nThe mother is gold’s fundamental origin in earth,\nhence called the earth mother.\nWater regards earth as its ghost—\nearth fills water so it does not rise.\nThe merit of Wu and Ji is called the Five Tally Golden Crucible.\nMercury cannot be subdued without earth.\nEarth rules the realm of metal;\nthe three substances all seek it,\nfollowing the image of the emperor and king.\nAs when a ruler has the Dao, the four directions come to offer tribute.\nSimply discern the true lead and mercury—\nthis is the primary crucible method.\nThus, the three substances form one family,\nall returning to Wu and Ji.\nWithout earth to govern, gold and water cannot form the Elixir.\n\nThe earth mother reigns for eighteen days in each season;\nthe remaining days are abandoned, imprisoned, or concealed.\nIn refining the Golden Crucible,\ninvestigate Yin and Yang,\nthe essence and qi returning—\nthe clepsydra does not cease.\nRealgar is likened to earth, pacifying the four barbarians.\nEarth is the fundamental soil that generates gold.\n\"Xiong\" means male; \"huang\" means earth.\nIt can suppress water and earth—\nthis is metal and fire, unrelated to realgar.\nThe crucible’s outer master is called the Five Tally.\n\nThe world does not awaken to the Elixir’s fundamental father and mother,\nmistakenly using gold and silver as the mother\nor as crucible vessels.\nThus, the primordial qi does not depart from the Five,\nand the Five do not depart from the primordial qi.\nTheir names are blended as one,\nbut their functions differ when distinguished.\nThe primordial qi is the ruler of the Five Agents;\nthe Five Agents are the ministers of the primordial qi.\nRuler and ministers govern in tandem—\nthey cannot be separated.\nThe Golden Elixir employs the primordial qi,\nnot exceeding the Five.\nThe Five are the Five Tally.\nThe Five Tally are qi.\nQi is originally formless,\nborn from essence,\ncontaining truth within and without.\nWhen ingested, one neither dies nor is born.\n\nThe Golden Crucible is the outer control of the medicine—\nthe outer is qi, the control is the crucible.\nThe crucible resembles a hen’s egg,\nwhite outside encasing yellow,\ncombined with mercury—\nusing white gold as the vessel,\nthe vessel does not depart from the Five.\nThe Five are earth, the earth that generates gold.\nThrough intricate mutual restraint,\nit seems effortless,\npreventing water from escaping—\nthis is the merit of Wu and Ji.\n\nThe formula states:\nGrasp the sword, lay down the halberd,\nencompassing the four directions.\nGrasping the sword is the primordial qi of metal, the Five.\nLaying down the weapons—\nlike water meeting earth and not flowing—\nthis is gold dying in earth.\n\nThe foundation of the Great Elixir is cinnabar.\nCinnabar is lead,\nfundamentally born of earth,\nand in death also returns to earth—\nthus, use the earth that generates cinnabar.\nThe world knows this in number.\n\nThe crucible has alternate names:\nOuter Spirit Water, Flowery Pond, Spirit Chamber,\nEnclosing Frame, Outer Control, Five Qi,\nWhite Robe, Elixir Robe, Mother’s Abode,\nGolden Crucible, Spirit Hut.\n\nThe formula states:\nThe Five Qi—\nin greatness, they encompass the eight directions;\nin smallness, they conceal even a hair’s tip.\nThey spit forth Kun and vomit forth Xu,\nemerging from existence, entering non-existence.\n\nThe formula states:\nThe flowing pearl revolves nine times,\ntransforming into yellow and white.\nNaturally interacting,\none Yin, one Yang—\nthis is called the Dao.\nIt must be subdued within the Golden Crucible,\nthe merit of the central palace.\nSpiritual penetration is free and unobstructed,\nnurturing and subduing—\nhence called the Golden Crucible.\n\nThe Golden Elixir is the primordial harmonious qi of Heaven, Earth, sun, and moon.\nShining and silently revolving,\nit becomes cinnabar.\nWithin the sand, it spontaneously generates—\nthis is the Return Elixir.\nLike humans conceiving sons and daughters,\nall arise from the union of father and mother’s Yin-Yang essence and qi—\nthus, the Return Elixir resembles male and female.\nMales are born facing downward; females, upward.\nNot only in life—\neven in death, it is so.\nSimply cast them into water:\nmales float downward, females upward.\nHeaven causes this—\nit is not by the parents’ instruction.\n\nGold and water within the crucible\nresemble male and female playing,\nmale above, female below,\nnaturally attaining mutual affinity,\nfulfilling the Dao.\n\nThe formula states:\nThough the Golden Elixir obtains its primordial foundation,\none must know the nurturing and subduing of its fundamental father and mother.\nThe father is the Yang qi of fire—\nthe father can emit, move, and complete it.\nThe mother is the Yin qi of earth—\nthe mother can contain and nurture it.\nThe mother rules the central palace, yellow—\nyellow is earth, the earth that generates gold.\nWhen cinnabar first receives qi,\nit relies on earth to be born—\nthus, it is called the fundamental mother of the yellow sprout.\nFormed by Yang, born by the mother—\nhence named the earth cauldron, the mother.\n\nEarth is the earth of the Five Agents,\nthe earth of generation and completion.\nWater, fire, wood, metal, earth—\neach resides in its direction,\nmoving to its proper position.\nFire comes to overcome metal;\nearth comes to overcome water.\nWater is the child of cinnabar.\nEarth is the crucible.\nFire is movement, contending—\nyet forming shape, obtaining earth’s generation.\nEarth can restrain water;\nthe fundamental qi resonate,\nbecoming the ancestral Dao.\nThus it is said: Know the white, guard the black.\n\nThe world entirely does not know that like kinds\nfollow and generate each other,\novercome and restrain each other—\nmetal generates water,\nearth is the ghost of water.\nEarth fills water so it does not rise—\nthe merit of Wu and Ji is called the Five Tally Golden Crucible.\nNone among the world’s people know this.\nEarth tally is the essence of fire and wood.",
      "overlap_context": " *Li* are water and fire as medicine.\n*Zhen* and *Xun* are the moving trigrams.\nAfter three years of circulation, the Elixir naturally returns—\nThis is the qi of the Great Origin; how could it not become the Elixir?\n\nThe formula states: Calculate 12,960 hours, excluding the varying lengths of months and intercalary months, to arrive at the true count. If even one qi is lacking, it is no different from worthless rubble. When the myriad phenomena’s essences align, the numinous naturally resonates.",
      "start_char": 2487,
      "end_char": 3726,
      "start_sentence": 124,
      "end_sentence": 188,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.45887875556946,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\通幽诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "诀曰：地符，火者。 火能爨熟万物，以育人民。 火者，甲之本阳之元气，结媾交会，同日月之精气，归一无二甲之精。 火数二，生数三，成数九。 九者，阳之极数，阳气也。 甲曰曾，木曰青。 万物之使，束方青龙木。 木是火之父母，火木之子孙。 震为长男一爻生，巽为中男二爻生，故火生辰巳。 离为中女二爻生。 阳丙子寄位也。 木孕火制，火必假木。 三者，木之精，正阳之道，甲乙之位日。 天符，信也，能发泄万物。 月，阴符，能生育万物。 土，阴符，能生育万物。 火，地符，能爨熟万物。 金水元气，并同阴符，能生育万物。 《直符手镜》喻日月六十四卦，六爻发泄，运动，天符，以成金丹，饵之羽化，子明之力也。 混元皇帝真君，历代变名，叔阴阳统略，五行相类，《周易》爻象，直符《参伺》，如符若契，观察天地徘徊，阴阳轮转，子午正位，卯酉相望。 十一月一阳生，万物生也。 五月一阴生，万物结也。",
      "translated_text": "The formula states: The earth tally is fire.\nFire can cook and ripen the myriad things,\nnurturing the people.\nFire is the root yang qi of *jia*,\nconjoining and uniting with the essence qi of sun and moon,\nreturning to the undivided essence of *jia*.\nFire’s number is two; its generating number, three; its completing number, nine.\nNine is the extreme number of yang—yang qi.\n*Jia* is called *zeng*; wood is called *qing*.\nThe agent of all things, the Azure Dragon of the East—wood.\nWood is the parent of fire; fire and wood, its descendants.\n*Zhen* is the eldest son, born of one yang line;\n*Xun* the middle son, born of two yang lines—\nthus fire is born in *chen* and *si*.\n*Li* is the middle daughter, born of two yang lines.\nYang *bing* resides in the *zi* position.\nWood conceives fire and restrains it;\nfire must borrow from wood.\nThree is the essence of wood, the Way of true yang,\nthe position of *jia* and *yi*—the sun.\n\nThe celestial tally is trust, able to activate and release the myriad things.\nThe moon, a yin tally, can nurture the myriad things.\nEarth, a yin tally, can nurture the myriad things.\nFire, an earth tally, can cook and ripen the myriad things.\nThe primordial qi of metal and water, likewise yin tallies,\ncan nurture the myriad things.\n\n*The Straight Tally Hand Mirror* compares the sixty-four hexagrams of sun and moon,\nthe six lines activating and releasing,\nthe celestial tally—\nthus forming the golden elixir.\nIngesting it, one ascends in feathered transformation—\nthe power of *Ziming*.\n\nThe Perfected Lord of the Primordial Emperor,\nwhose name has changed through the ages,\nhas summarized the subtleties of yin and yang,\nthe mutual resonance of the Five Phases,\nthe line images of the *Zhouyi*,\nand the straight tally of *Can Si*—\nlike tally and contract, perfectly aligned.\nObserving the cycles of heaven and earth,\nthe revolutions of yin and yang,\nthe proper positions of *zi* and *wu*,\nthe mutual gazing of *mao* and *you*:\nIn the eleventh month, the first yang arises—\nthe myriad things are born.\nIn the fifth month, the first yin arises—\nthe myriad things take form.",
      "overlap_context": "neration.\nEarth can restrain water;\nthe fundamental qi resonate,\nbecoming the ancestral Dao.\nThus it is said: Know the white, guard the black.\n\nThe world entirely does not know that like kinds\nfollow and generate each other,\novercome and restrain each other—\nmetal generates water,\nearth is the ghost of water.\nEarth fills water so it does not rise—\nthe merit of Wu and Ji is called the Five Tally Golden Crucible.\nNone among the world’s people know this.\nEarth tally is the essence of fire and wood.",
      "start_char": 3726,
      "end_char": 4090,
      "start_sentence": 189,
      "end_sentence": 210,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.725682735443115,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\通幽诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "春生秋杀，自然之道也。 诀曰：用火微微，不失节候。 万物自熟，河车之义。 诀曰：子者，火候先在抽添。 一云河者，北之位。 车者，般载之义。 一云子是金，河是水，故曰子河车。 地符直卦节候进退图 诀曰：本用四卦法，日月四时，直符循环，一如车脚，转运阴阳，成数造化，载运万物。 故在律纪月节，有五六讳，奉日使兼并。 六十四卦，刚柔有表裹，朔旦长直事，至暮蒙当受，昼夜各一卦用之。 次序既末主晦爽终，即复更始进退爻象，并在此直符。 从一至九，金虎吐精，用诀直符，不载於此。 诀曰：托附阴阳爻象，六十四卦立喻也。 但发泄用火之时，便是十一月用事，受阳节候也。 十一月初九，潜龙勿用。 地雷复，豫直。 十二月九二，见龙在田。 地泽临，萃直。 正月九三，君子终日乾乾。 地天泰，否直。 二月九四，或跃在渊。 天雷无妄，大壮直。 三月九五，飞龙在天。 天泽履，夫直。 四月上九，亢龙有悔。 纯乾直，阳气交腾。 右阳生六位，极阳之卦，亢龙大过，法象於天，故云自子终於巳。 五月一阴生。 天风妮，小畜直。 六月二阴生。 天山遁，大畜直。 七月三阴生。 天地否，泰直。 八月四阴生。 风地观升直。 九月五阴生。 山地剥，谦直。 十月六阴生。 纯坤直。 右阴生六位，极阴之卦，气潜伏法象於地，故曰自午讫於亥。 震主春木。 生三，成八。 离主夏火。 生二，成七。 诀曰：证前十五日白，月火木用事，故七八也。 兑主秋金。 生四，成九。 坎主冬水。 生一，成六。 诀曰：证后十五日黑，月金水用事，故九六也。 并是直符六爻，用节卦翻译气候，五行相克之数。 故知七八数十五，九六亦相应，道自毕也。 一二三四五，并是五行之基。 诀曰：一者，北方壬癸水。 二者，南方丙丁火。 三者，东方甲乙木。 四者，西方庚辛金。 五者，中央戊己土。 经曰：父少而子老。 父者，天铅，丹砂铅也。 子者，从父而出，金黑铅，故父少而子老。 子不定，父数世五。 水火金木土，五行移易万物。 五日一候，五五二十五，故父年二十五也。 子数不定，子年般载，运动不定，故知父少而子老。 举世不知万物，从五行而生成父母也。 用火 诀曰：六爻直符，运卦用火，斤两从纯坤起，终於坤，周而复始也。 诀曰：一月换一鼎，故用九鼎，即止。 第十鼎任意消息，用不用并得用之转妙，绿是生金之本气也。 故云土釜，土釜曰母，母金鼎也。 诀曰：其金鼎依运气候，十五日金性灭，三十日成丹。 运至十月，不用本土为鼎，子母脱胎，九转九鼎。 九者，火用事。 鼎者，母用事也。 凡丹象人、从受气后三百七十日而生，九月是阴阳俱盛，十月土王，故子母相分，故名脱胎。 还丹象人，四气足而生，亦如婴儿，乳育三年，大元气足，而成金丹。 乃为黄誉，变转却归北方，黑色通透，始得．名大还。 世人不知之矣。 子是药，母是鼎，感气相生，相产相伏，相制相杀，迭盛迭衰，升降在鼎，飞伏上下，阴阳相管，交会吞食，四物相薄，君臣相临。 土性生，金性死，火性灭，水性个。 四物者，阳中阴，阴中阳。 但以本土为轴辖，直符运动，故有四物，各居一方，四物性并灭，归一返本，故名金丹。 诀曰：守运一年，饵一两半，凡病不侵。",
      "translated_text": "Spring gives life, autumn brings harvest—such is the natural Dao.\nThe formula states: Use fire gently, without missing the seasonal nodes.\nThe myriad things ripen of themselves—this is the meaning of the *River Chariot*.\n\nThe formula states: *Zi* governs the fire-tally, first in withdrawal and addition.\nOne says: *River* is the northern position.\n*Chariot* means the conveyance of burdens.\nAnother says: *Zi* is metal, *River* is water—hence *Zi River Chariot*.\n\n**Earth-Tally Straight Hexagram Seasonal Advance-Retreat Diagram**\nThe formula states: Originally employing the four hexagrams,\nthe sun and moon through the four seasons,\nthe straight tally cycles endlessly—\nlike the wheels of a chariot,\nrevolving yin and yang,\ncompleting the numbers of creation,\nbearing and conveying the myriad things.\nThus, in the pitch-pipes and monthly nodes,\nthere are five and six taboos,\nhonoring the solar terms and their combinations.\n\nThe sixty-four hexagrams,\nhard and soft with outer and inner,\nat dawn the long day begins with the hexagram of duty,\nby dusk the receptive takes its turn—\nday and night each employ one hexagram.\nThe sequence, having reached its end at the dark of the moon,\nrenews itself with advancing and retreating line images,\nall within this straight tally.\n\nFrom one to nine,\nthe Metal Tiger spits forth essence—\nthe formula for the straight tally is not recorded here.\n\nThe formula states: Borrowing the yin-yang line images,\nthe sixty-four hexagrams establish their metaphors.\nWhen deploying fire for release,\nit is the eleventh month that governs,\nreceiving the yang seasonal tally.\n\n**Eleventh month, first nine:**\n\"The hidden dragon does not act.\"\n*Earth-Thunder Fu* (Return), aligned with *Yu* (Enthusiasm).\n\n**Twelfth month, second nine:**\n\"The dragon appears in the field.\"\n*Earth-Marsh Lin* (Approach), aligned with *Cui* (Gathering).\n\n**First month, third nine:**\n\"The noble one toils ceaselessly all day.\"\n*Earth-Heaven Tai* (Peace), aligned with *Pi* (Stagnation).\n\n**Second month, fourth nine:**\n\"Perhaps leaping in the abyss.\"\n*Heaven-Thunder Wuwang* (Innocence), aligned with *Dazhuang* (Great Strength).\n\n**Third month, fifth nine:**\n\"The flying dragon is in the heavens.\"\n*Heaven-Marsh Lü* (Treading), aligned with *Fu* (The Gentle).\n\n**Fourth month, upper nine:**\n\"The exalted dragon has regrets.\"\n*Pure Qian* (The Creative) governs—yang qi surges and intermingles.\n\n**Right: The Six Yang Positions**\nThe yang arises to its extreme—\nthe hexagram of the exalted dragon, *Great Excess*—\nmodeled on heaven,\nthus from *zi* to *si*.\n\n**Fifth month, first yin arises.**\n*Heaven-Wind Gu* (The Taming Power of the Small), aligned with *Xiaoxu* (Small Accumulation).\n\n**Sixth month, second yin arises.**\n*Heaven-Mountain Dun* (Retreat), aligned with *Daxu* (Great Accumulation).\n\n**Seventh month, third yin arises.**\n*Heaven-Earth Pi* (Stagnation), aligned with *Tai* (Peace).\n\n**Eighth month, fourth yin arises.**\n*Wind-Earth Guan* (Contemplation), aligned with *Sheng* (Ascending).\n\n**Ninth month, fifth yin arises.**\n*Mountain-Earth Bo* (Splitting Apart), aligned with *Qian* (Modesty).\n\n**Tenth month, sixth yin arises.**\n*Pure Kun* (The Receptive) governs.\n\n**Right: The Six Yin Positions**\nThe yin arises to its extreme—\nthe hexagram of qi lying hidden,\nmodeled on earth,\nthus from *wu* to *hai*.\n\n**Zhen** governs spring wood:\ngenerating three, completing eight.\n\n**Li** governs summer fire:\ngenerating two, completing seven.\n\nThe formula states: Verifying the preceding fifteen days as white,\nthe moon’s fire and wood govern—hence seven and eight.\n\n**Dui** governs autumn metal:\ngenerating four, completing nine.\n\n**Kan** governs winter water:\ngenerating one, completing six.\n\nThe formula states: Verifying the following fifteen days as black,\nthe moon’s metal and water govern—hence nine and six.\n\nAll are the straight tally’s six lines,\nemploying hexagram nodes to interpret qi and seasons,\nthe numbers of the Five Phases overcoming one another.\nThus, seven and eight sum to fifteen,\nnine and six likewise correspond—\nthe Dao is complete.\n\nOne, two, three, four, five—\nall are the foundations of the Five Phases.\n\nThe formula states:\nOne is the northern *ren gui* water.\nTwo is the southern *bing ding* fire.\nThree is the eastern *jia yi* wood.\nFour is the western *geng xin* metal.\nFive is the central *wu ji* earth.\n\nThe classic states: \"The father is young, the child is old.\"\nThe father is celestial lead—\ncinnabar lead.\nThe child emerges from the father—\nblack lead of metal.\nThus, the father is young, the child is old.\n\nIf the child is not fixed, the father’s lineage spans five generations.\nWater, fire, metal, wood, earth—\nthe Five Phases shift and transform the myriad things.\nFive days make one *hou*,\nfive *hou* make twenty-five—\nthus the father’s age is twenty-five.\nThe child’s number is unfixed,\nits age conveyed and revolving without constancy—\nhence the father is young, the child is old.\n\nThe world does not know that the myriad things\narise and are completed from the Five Phases as parents.\n\n**Employing Fire**\nThe formula states: The six lines of the straight tally,\nrevolving hexagrams to employ fire—\nweights and measures begin with *Pure Kun*,\nend with *Kun*,\ncycling without cease.\n\nThe formula states: One cauldron is changed each month,\nthus nine cauldrons are used before stopping.\nThe tenth cauldron is left to natural ebb and flow—\nwhether used or not, both yield wondrous transformation,\nfor this is the original qi of metal’s birth.\n\nThus, the earthen crucible—\nthe earthen crucible is called the mother,\nthe mother of the metal cauldron.\n\nThe formula states: The metal cauldron follows the revolving qi and seasons—\nafter fifteen days, the metal nature perishes;\nafter thirty days, the elixir forms.\nWhen the cycle reaches the tenth month,\nthe original earth is no longer used as the cauldron—\nmother and child shed their forms,\nnine transformations, nine cauldrons.\nNine is the fire in service;\nthe cauldron is the mother in service.\n\nAll elixirs resemble humans—\nfrom receiving qi to birth, three hundred seventy days,\nnine months when yin and yang are both abundant,\nthe tenth month when earth is sovereign—\nthus mother and child part,\nhence the name *shedding the womb*.\n\nThe returning elixir resembles a person—\nfour qi complete, it is born,\nlike an infant nourished for three years,\nuntil the great original qi is full,\nand the golden elixir is achieved.\nThis is called *Yellow Fame*,\ntransforming and returning to the north,\nblack color penetrating through—\nonly then is it named *Great Return*.\nThe world does not know this.\n\nThe child is the medicine,\nthe mother is the cauldron—\nresponding to qi, they generate one another,\nproduce and subdue,\nrestrain and overcome,\nalternately flourishing and declining.\nAscending and descending within the cauldron,\nflying and hiding above and below,\nyin and yang govern each other,\nintermingling and devouring,\nthe four agents pressing upon one another,\nruler and minister attending.\n\nEarth’s nature gives birth,\nmetal’s nature dies,\nfire’s nature extinguishes,\nwater’s nature unites.\nThe four agents—\nyin within yang, yang within yin.\n\nBut with the original earth as the axle,\nthe straight tally revolves—\nthus the four agents,\neach dwelling in its quadrant.\nWhen the natures of the four agents all perish,\nreturning to unity and the root—\nthis is called the golden elixir.\n\nThe formula states: Guard and revolve for one year,\ningest one *liang* and a half—\nno illness will assail you.",
      "overlap_context": "s,\nhas summarized the subtleties of yin and yang,\nthe mutual resonance of the Five Phases,\nthe line images of the *Zhouyi*,\nand the straight tally of *Can Si*—\nlike tally and contract, perfectly aligned.\nObserving the cycles of heaven and earth,\nthe revolutions of yin and yang,\nthe proper positions of *zi* and *wu*,\nthe mutual gazing of *mao* and *you*:\nIn the eleventh month, the first yang arises—\nthe myriad things are born.\nIn the fifth month, the first yin arises—\nthe myriad things take form.",
      "start_char": 4090,
      "end_char": 5362,
      "start_sentence": 211,
      "end_sentence": 295,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.10449457168579,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\通幽诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "二年成白道，可饵半两。 三年大元气足成赤道，可饵一分，住世死籍不录。 刀圭制汞为白道，五年，麻子大，饵七粒，以刀圭点铁及汞各一斤，并成赤道，守九年毕，法饵三粒，三尸九蛊尽出，长生不死。 能化五金八石，尽瓦砾等，随本色形成宝。 又用火法曰：所立指喻爻象，手镜火记斤两，托附阴阳，隐秘变化之机，苗裔略同，用之正诀。 假令十一月建子，一阳生爻动火，生数二，成数七，运动般载，如车轮。 一月一阳生，加至五月一阴生，一月退一阳爻，至十月归於土，终於坤，周而复始。 金丹是日月运动，自然成丹。 因燧人改火，后圣用之，同於天火，造化至在，更漏分明，节候用火，斤两运动，渐渐如蒸，四时年月刻漏足，以成金丹，火候所然。 如驱鸡即走，宽又不伏。 但依直符爻象，即金水自伏。 六月阳终於巳，十二月阴终於丑。 诀曰：丹砂，阳气流珠之精，是立乾坤，运水火，应天符，合三才也。 金为月精，以处阴位。 汞含离气，以应阳爻。 天地之灵孕，日月之精。 否极泰来，阴尽阳生。 故云：丹砂木精，得金乃并，三一之道。 三者，火一．者药，故名守一。 又云：砂者，药。 金者，鼎。 故云：三道由一，并在根蒂。 大道至理，得门无二。 砂性温和，无毒，味辛。 元气通灵，万物不枯，名曰黑铅。 黑铅者，砂中自然之液，仰月抽出之液。 故云：黑铅入仰月，配合为夫妻。 阴魂合阳魄，两性自和同。 诀曰：然用五行，乾坤震巽，直符孕育，从建之初一阳生，子午相应，八八相通，以推移刻漏，日月五星，寒暑来往，昼阳夜阴，交会四十五日一节节相临阴阳调顺潜伏，运动输还，巡於六十四卦。 周而复始，水火相从，处无外物，五金八石，由人之造化。 五金，五行也。 八石，八卦也。 诀曰：水得龙而为雨，火得人而运动阴阳。 气用事万物长，龙行雨施万物生。 还丹养育造化，不越五行。 诀曰：直符初发之时，水净不失时，文不过九，武不过九。 九者，阳之极数。 三三如九，大过之极，阴生之首，阴尽阳生，皆顺天道，阴阳为之运动。 若匀金水，即顺节候。 失序金水即亡。 运动如垂温抱卵，受气而生。 用事相生相杀，如寒谷变春，阴阳五行所生互用，皆立喻者也。 诀曰：精，元气。 本生於南方丙丁火，离，寄位二阳之中一阴生，日之魂，阴汞，水也。 受气之足，移位北方壬癸水，坎，寄位二阴之中一阳生，月之魄，阳汞，金也。 水则湛然不动，无为之体也。 火则炎动不已，有为之宗。 将有制无，合成妙道。 故知金生於阴暗之处，始初也，是子午相应。 诀曰：金入中宫，太一庚城。 含育黄炁，混其元精。 赤马守黄乌，苍龙藉白虎，制驭本类相从，故曰参同。 又云：坎离一二，南北独为径。 一者，水。 二者，火。 万物因水而生，因火而成，火金相伐，水土相克，以成大丹。 直符初发在子，十一月，从震而生。 四月火王，极阳合退。 又从巽生，二木渐顺。 汞初伏虽乾，未是火丹。 守运三节名丹砂，五节名金砂、一年名长砂，一名小还丹，二年名还魂丹，一名中还丹。 一千日受气足，名炁兽大还金液丹，饵之不死。 诀曰：修金丹不悟玄理者，盖为不悟丹砂，是铅造化根本。 迷迷相指，错用凡水银、凡铅、金银、雄黄、曾青。",
      "translated_text": "After two years, the White Way is achieved—ingest half a *liang*.\nAfter three years, the Great Original *qi* is full and the Red Way is achieved—ingest one *fen* to dwell in the world while death’s register omits your name.\nA *daogui* measure refines mercury into the White Way; after five years, ingest seven grains the size of sesame seeds. With a *daogui* measure, transmute one *jin* each of iron and mercury into the Red Way. After nine years of guarding and revolving, ingest three grains—the Three Corpses and Nine Worms will all depart, and you will attain longevity without death.\nYou will be able to transform the Five Metals and Eight Stones, turning even tiles and pebbles into treasures according to their original colors.\n\nThe fire method states: The established symbolic trigrams, hand-mirror fire records of weights, and reliance on yin and yang conceal the mechanism of hidden transformations. Though the descendants’ methods differ slightly, the essential technique remains the same.\nFor example, in the eleventh month, when *jianzi* begins, the first yang line stirs the fire. The generating number is two, the completing number seven—movement and bearing proceed like a wheel.\nIn the first month, one yang arises; by the fifth month, one yin arises. Each month, one yang line retreats until the tenth month, when all returns to earth, ending in *kun*—then the cycle begins anew.\nThe Golden Elixir is the movement of the sun and moon, naturally forming the elixir.\nSince Suiren altered fire, later sages have used it, aligning with celestial fire. The utmost of creation lies herein—timekeeping is precise, seasonal fire adjustments and weight movements proceed gradually, like steaming. When the four seasons, months, and hours are fulfilled, the Golden Elixir is complete, for the fire-timing dictates it.\nIf driven too hastily, it flees like a chicken; if too lenient, it will not submit. But by following the straight tally’s trigrams, gold and water will naturally obey.\n\nIn the sixth month, yang ends at *si*; in the twelfth month, yin ends at *chou*.\nThe formula states: Cinnabar is the essence of flowing yang pearls, establishing *qian* and *kun*, moving water and fire, responding to celestial tally, and harmonizing the Three Powers.\nGold is the essence of the moon, dwelling in the yin position. Mercury contains the *qi* of *li*, corresponding to the yang line.\nThe numinous embryo of heaven and earth, the essence of the sun and moon—when the negative reaches its extreme, the positive arises. Thus it is said: Cinnabar is the essence of wood, which merges with metal—this is the Way of the Three-in-One.\nThe Three are fire; the One is the medicine—hence the name \"guarding the One.\"\nIt is also said: Cinnabar is the medicine; gold is the cauldron. Thus, the Three Ways derive from the One, all rooted in the fundamental.\nThe supreme principle of the Great Way admits no second gate.\nCinnabar’s nature is mild and non-toxic, its flavor pungent. The original *qi* communicates with the numinous, and all things do not wither—it is called Black Lead.\nBlack Lead is the natural liquid within cinnabar, the liquid drawn out by the upturned moon.\nThus it is said: Black Lead enters the upturned moon, pairing as husband and wife. Yin soul unites with yang spirit, and the two natures naturally harmonize.\n\nThe formula states: Employ the Five Agents—*qian*, *kun*, *zhen*, and *xun*—the straight tally nurtures from the inception of *jian*, when the first yang arises. *Zi* and *wu* correspond, eight eights interconnect, shifting with the hours. The sun, moon, and five planets, the coming and going of cold and heat, day as yang and night as yin—every forty-five days, a new phase arrives. Yin and yang adjust and submit, moving and returning, circulating through the sixty-four hexagrams in endless cycles. Water and fire follow one another, dwelling without external things—the Five Metals and Eight Stones are subject to human transformation.\nThe Five Metals are the Five Agents; the Eight Stones are the Eight Trigrams.\n\nThe formula states: Water meets the dragon and becomes rain; fire meets man and moves yin and yang. *Qi* governs the growth of all things; the dragon’s movement and rain’s descent bring all things to life.\nThe Reverted Elixir nurtures creation, not exceeding the Five Agents.\nThe formula states: When the straight tally first stirs, water is pure and timing is not lost. The civil fire does not exceed nine; the martial fire does not exceed nine.\nNine is the extreme of yang. Three threes make nine—the utmost of *daguo*, the inception of yin’s birth. When yin is exhausted, yang arises—all follows the Dao of heaven, with yin and yang in motion.\nIf gold and water are balanced, the seasonal nodes are followed. If the sequence is lost, gold and water perish.\nMovement is like a silkworm warming and hatching eggs, receiving *qi* to generate life. The workings of mutual generation and destruction resemble the transformation of a cold valley into spring—yin and yang, the Five Agents, mutually employ one another, all established through analogy.\n\nThe formula states: Essence is original *qi*. It is born in the southern fire of *bing* and *ding*—*li*, lodged in the two yang lines with one yin arising, the sun’s soul, yin mercury, water.\nWhen its *qi* is full, it shifts to the northern water of *ren* and *gui*—*kan*, lodged in the two yin lines with one yang arising, the moon’s spirit, yang mercury, metal.\nWater is still and unmoving, the body of non-action. Fire is blazing and ceaseless, the ancestor of action. Bringing the active under the control of the inactive completes the wondrous Way.\nThus, know that metal is born in dark yin places—this is the inception, the correspondence of *zi* and *wu*.\n\nThe formula states: When gold enters the Central Palace, it is the Great One’s *geng* city. It nurtures the yellow *qi*, blending its original essence.\nThe Red Horse guards the Yellow Crow; the Azure Dragon rides the White Tiger. Control and submission follow their kind—hence the name *Cantong*.\nIt is also said: *Kan* and *li* are one and two—south and north alone form the path.\nOne is water; two is fire. All things are born through water and completed through fire. Fire and metal contend; water and earth overcome—thus the Great Elixir is achieved.\nThe straight tally first stirs in *zi*, the eleventh month, arising from *zhen*. In the fourth month, fire reigns, extreme yang retreats. Then it arises from *xun*—the two woods gradually submit.\nThough mercury is initially subdued in *qian*, it is not yet the Fire Elixir. After guarding and revolving for three phases, it is called Cinnabar Sand; after five phases, Gold Sand. After one year, it is called Long Sand or the Lesser Reverted Elixir; after two years, the Soul-Returning Elixir or the Middle Reverted Elixir.\nAfter one thousand days, when the *qi* is full, it is called the *Qi* Beast Great Reverted Golden Liquid Elixir—ingesting it grants immortality.\n\nThe formula states: Those who cultivate the Golden Elixir without awakening to the mysterious principle fail because they do not comprehend that cinnabar is the root of lead’s transformation. Lost in confusion, they mistakenly use common mercury, common lead, gold, silver, realgar, and azurite.",
      "overlap_context": "arth’s nature gives birth,\nmetal’s nature dies,\nfire’s nature extinguishes,\nwater’s nature unites.\nThe four agents—\nyin within yang, yang within yin.\n\nBut with the original earth as the axle,\nthe straight tally revolves—\nthus the four agents,\neach dwelling in its quadrant.\nWhen the natures of the four agents all perish,\nreturning to unity and the root—\nthis is called the golden elixir.\n\nThe formula states: Guard and revolve for one year,\ningest one *liang* and a half—\nno illness will assail you.",
      "start_char": 5362,
      "end_char": 6614,
      "start_sentence": 296,
      "end_sentence": 359,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.912951946258545,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\通幽诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "不知凡铅是世银之母，雄是药之子，砂是铅之母，黄是土，土是砂之父母。 曾属甲，火之父母。 青属木，位束方。 世人不悟，错用水银、凡金银铅、雄黄丫曾青为药，或为鼎器，或为子母，或炼铅取花，及杂石为药，自古至今，未有得者。 夫道之根本，神仙之道在一於目前。 丹砂木精，得土而生，得土而死，生灭不离於五行，互用更为父母，相伐相生成形也。 诀曰：气能存生，内丹也。 药能固形，外丹也。 服饵长生，莫过於内外丹，日月之华气。 华气者，丹砂元和之气，并是性命之本。 除内外丹精外，五金二青，四黄杂石，磁誉五矾等，并不在议限。 诀曰：只如水银，孤阴寡阳，能腐骨搜髓。 金性损肝，银性损脾，铜性损肾，铅锡损胃，四黄大毒，并有质性，绝阳而损元和之气，但指於一金一石，乃非凡金石也。 世问六水，皆有大毒。 饵之纵目下未虞，终为大害。 丹砂如有傍小门制之，能治世疾，小益延驻，不可长生。 法曰：用炮硫雄曾四味为器，相伏即得。 如用诸毒药抑遏，感气聚杂而成，即不可饵也。 慎之。 诀曰：凡铅是世银之母，在矿受阳气足，性自伏火，坏出即世银是也。 诀曰：水银与丹砂中水银，形貌虽相似，然象人男与女俱别。 丹砂象男，太阳曰之精魂，能留人性命。 内自有水银相制伏，不与外水银情合、及外物抑遏而得，故益人性命。 凡水银象女，太阴月之精魄，能夺人性命，孤阴寡阳，有大毒，不可饵也。 诀曰：水银阴阳性虽异同，是天地之精，象男女阴阳有异。 丹砂有傍小门制之，即用凡铅为器，匡郭成药。 诀曰：世人不知黄白之根基，错用凡水银、凡铅金银为至药。 殊不知汞生於铅，砂产於金。 金丹但知铅本气而成，何得遗本，存乎外物。 铅者，子，丹之精也。 气者，母，本土生精之土，故名本铅气。 诀曰：天铅者，朱铅也。 金本从铅中生，即是子隐母胎。 又子藏於金中，即是母隐子胎。 铅者，黄芽。 黄者，土。 芽者，砂。 土能生芽，故云黄芽也。 铅汞者，本是七宝之良媒，五金之筋髓，解则百事俱通，迷则百途并塞。 然铅制汞能伏铅铅汞汞相成合为黄白之道。 诀曰：一阴一阳之为道，一金一石之为丹。 石乘阳而热，金得阴而寒。 此乃魂魄相应，理势必然。 夫石液定魂，金精定魄，非阴阳感化，谅九幽之可待。 故曰：君子好述，淑女之良配。 河上姥女，灵而最神。 得火即飞，不见垢尘。 鬼隐龙匿，莫知所存。 将欲制伏，黄芽为根。 傥不入黄芽，独烧水银，虽器厚盈尺，固塞百重，火动即飞，莫之能止，须臾去尽，不见纤毫，如鬼隐冥中，龙匿水府，纵有离娄之目，亦不能睹踪也。 使水不能东西，黄芽之力也。 元君诀曰：黄芽者，五行甲子是也。 甲属木，木是阳之父母。 母属地之气，冬至后一阳冲，其曰一阳生，萌芽受气於母土，名甲。 甲依土吐，甲以生芽。 芽依於母，母曰坤，即是癸之黄芽。 六甲之位，囚死休废，同其一甲，在癸而绝位。 五谷五菜，草木茂荣，万类胎卵，药物人民，皆从黄芽生，阳气氤氲，运动地为，胎息为气。 万物以春夏发泄为黄芽，秋冬收敛同成熟，各归其色及本味，不改旧容，故名还丹之义，反本也。 夫人改常必死，物改色必坏。",
      "translated_text": "The common lead is the mother of worldly silver; realgar is the child of the medicine; cinnabar is the mother of lead; yellow is earth, and earth is the parent of cinnabar. Azurite belongs to *jia*, the parent of fire; azurite belongs to wood, stationed in the east. The unenlightened mistakenly use mercury, common lead, gold, silver, realgar, and azurite as medicines, or as crucibles and vessels, or as mother and child, or refine lead to extract its flower, or mix stones into the medicine—from ancient times to the present, none have succeeded.\n\nThe root of the Dao, the path of immortality, lies in unity before one’s eyes. Cinnabar, the essence of wood, is born from earth and dies in earth; its arising and ceasing do not depart from the Five Phases. They alternately serve as parents, mutually overcoming and generating to form substance.\n\nThe formula states: *Qi* sustains life—this is the Inner Elixir. Medicine preserves form—this is the Outer Elixir. For attaining long life through ingestion, nothing surpasses the Inner and Outer Elixirs, the radiant *qi* of the sun and moon. This radiant *qi* is the primordial harmonious *qi* of cinnabar, the very foundation of nature and life. Beyond the essence of the Inner and Outer Elixirs, the five metals, two azurites, four yellows, miscellaneous stones, magnetite, and five alums are not within the scope of discussion.\n\nThe formula states: Consider mercury—solitary yin, widowed yang—it corrodes bones and searches marrow. Gold damages the liver; silver damages the spleen; copper damages the kidneys; lead and tin damage the stomach. The four yellows are highly toxic, all possessing material nature, severing yang and harming the primordial harmonious *qi*. To speak of a single metal or stone is not to speak of common metals or stones. The six waters of the world are all highly toxic; though no immediate harm may appear upon ingestion, they ultimately cause great injury. Cinnabar, if governed by minor auxiliary methods, can treat worldly illnesses and slightly prolong life, but it cannot grant immortality.\n\nThe method states: Using the four ingredients—prepared sulphur, realgar, and azurite—to make vessels, when they mutually subdue one another, success is achieved. If various toxic medicines are suppressed and forced together, the resulting conglomeration of *qi* is impure and cannot be ingested. Exercise caution.\n\nThe formula states: Common lead is the mother of worldly silver; within the ore, it receives sufficient yang *qi* and naturally subdues fire. When smelted, it becomes worldly silver.\n\nThe formula states: Mercury and the mercury within cinnabar may appear similar in form, yet they differ as distinctly as man and woman. Cinnabar resembles man, the essence and spirit of the Great Yang sun, capable of preserving human nature and life. It inherently contains mercury to subdue and restrain itself, neither mingling with external mercury nor being forced by external substances—thus it benefits human nature and life. Common mercury resembles woman, the essence and soul of the Great Yin moon, capable of seizing human nature and life. Solitary yin, widowed yang, it is highly toxic and cannot be ingested.\n\nThe formula states: Though the yin and yang natures of mercury differ, they are both the essence of heaven and earth, resembling the distinction between male and female yin and yang. When cinnabar is governed by minor auxiliary methods, common lead may be used as a vessel to frame and complete the medicine.\n\nThe formula states: The unenlightened do not know the root of the Yellow and White; they mistakenly use common mercury, common lead, gold, and silver as supreme medicines. Little do they realize that mercury is born from lead, and cinnabar is produced from gold. In the Golden Elixir, one must know that lead is the foundation of *qi* and its transformation—how can one abandon the root and rely on external things? Lead is the child, the essence of cinnabar; *qi* is the mother, the earth that generates essence—hence it is called the root lead *qi*.\n\nThe formula states: Celestial lead is vermilion lead. Gold is born from lead, meaning the child is concealed within the mother’s womb. The child is also hidden within gold, meaning the mother is concealed within the child’s womb. Lead is the Yellow Sprout; yellow is earth; sprout is cinnabar. Earth can generate sprouts, hence it is called the Yellow Sprout. Lead and mercury are the fine matchmakers of the Seven Treasures and the marrow of the Five Metals. When understood, all matters become clear; when deluded, all paths are blocked. Thus, lead restrains mercury, and lead and mercury mutually complete one another to form the Way of the Yellow and White.\n\nThe formula states: The Dao consists of one yin and one yang; the Elixir consists of one metal and one stone. Stone rides the yang and is hot; metal receives the yin and is cold. This is the mutual resonance of spirit and soul, an inevitable principle. Stone liquid stabilizes the spirit; metal essence stabilizes the soul. Without the interaction of yin and yang, how could one await the depths of the Nine Darks?\n\nThus it is said: The gentleman seeks a fine companion, as the virtuous maiden is his perfect match. The Old Woman of the River is numinous and most divine. When she meets fire, she flies, leaving no trace of dust. Ghosts hide and dragons conceal themselves—none know where they reside. To subdue her, the Yellow Sprout is the root. If one does not enter the Yellow Sprout and burns mercury alone, even with a vessel a foot thick and sealed a hundredfold, when fire is applied, it will fly away, leaving nothing behind in an instant, like a ghost vanishing into darkness or a dragon hiding in the watery abyss. Even with the eyes of Li Lou, one could not perceive its trace. That water cannot flow east or west is the power of the Yellow Sprout.\n\nThe formula of the Primordial Lord states: The Yellow Sprout is the *jia-zi* of the Five Phases. *Jia* belongs to wood, the parent of yang. The mother belongs to the *qi* of earth. After the winter solstice, one yang surges forth—this is called the birth of one yang. The sprout receives *qi* from the mother earth and is named *jia*. *Jia* relies on earth to sprout; the sprout depends on the mother. The mother is *kun*, which is the Yellow Sprout of *gui*. The position of the Six *Jia* is imprisoned, dead, resting, or abandoned—all share one *jia*, which is extinguished in *gui*. The Five Grains, Five Vegetables, flourishing grasses and trees, the myriad creatures born from wombs and eggs, medicinal substances, and people—all arise from the Yellow Sprout. The yang *qi* is warm and diffuse, moving the earth to act, breathing as a fetus breathes. All things in spring and summer disperse and grow as the Yellow Sprout; in autumn and winter, they contract and mature, each returning to its color and original flavor, unchanged in form—hence the meaning of Reverted Elixir is to return to the root. If a person alters their constant nature, they must die; if a thing changes its color, it must decay.",
      "overlap_context": ", the Soul-Returning Elixir or the Middle Reverted Elixir.\nAfter one thousand days, when the *qi* is full, it is called the *Qi* Beast Great Reverted Golden Liquid Elixir—ingesting it grants immortality.\n\nThe formula states: Those who cultivate the Golden Elixir without awakening to the mysterious principle fail because they do not comprehend that cinnabar is the root of lead’s transformation. Lost in confusion, they mistakenly use common mercury, common lead, gold, silver, realgar, and azurite.",
      "start_char": 6614,
      "end_char": 7855,
      "start_sentence": 360,
      "end_sentence": 419,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.4887535572052,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\通幽诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "乃知药物径运动，阳气般载，不改旧容，与天火同造化，还丹受气，反本也。 阳气照曜，凝结自然之道，故曰黄芽。 世人莫知天地三光，清浊初分，人民万物，皆从黄芽，不越五行而生。 黄芽者，萌芽伸屈始初也。 因阳而结，因阴而生，阴阳交接。 当受气之时，初为混沌。 清浊之后，始有黄芽。 在甲曰黄，在句曰萌，在伸曰芽，故名黄芽。 乃知元不离於五行，五行金木水火土也。 水曰润下，火曰炎上，金曰从革，木曰曲直，土曰稼穑。 诀曰：天地大道，万物久长，元和之气，长生不过日月星辰，阴阳五行，尽依土而生，终归於土。 随四时更变然有期，亦是自然之道。 假令毛脂，含受太阳气一千年，化为伏神。 又一千年为琥珀，又一千年为水精。 皆是日月之华气，照曜成精。 又假如蟾蚝弄月，蚌蛤有珠。 并是采弄含受太阴月华之气，成胎为珠。 其珠是月之阴魄所结，二味并堪服食，偏治肺气、惊邪、健忘。 以木蜜为丸，如麻子大，食后津下三丸蚌珠，能制汞。 夫人内修道德，元和之气冲融，修养含道，结精为珠，自然长生。 珠居於赤水中，赤水血也。 假令禽兽虫蚁鱼蟹垫伏者，皆得元和之气，所托存生，非关父母教令，得悟之哉。 自固其志，音声相和，物类相感，有无相贯，阴阳抱而全其大道，二气和合，有无相别，无有相成，成其真道也。 河车者，五金之主，亦北之位。 水能渡车，般载万物，轮还不住，是阳居阴位，阴合阳精，金汞相得，故曰河车也。 元和之道祖，立天地，调阴阳，四时行焉，万物生焉。 受气曰命，最灵曰人，人福莫大於生，祸莫大於死。 既恶其死，又欲其生，为失道而不得生也。 勉之勉之。 且余所注类异诸家，义合正经，理契大道，论卦象则火候为先，择阴阳则药物为正。 参者，杂也。 水土金三物，同为一家，如符若契，契其一理，故曰参同。 诀曰：万物非日月不生，金水非火土不成，金水则变化之元，火土乃阴阳之始。 天地混沌之时，天地默然，虽未变化，终为万物之根。 金白水黑，相会气中，状如鸡子。 阳燧以取火，非日不生光。 犬戎以火镜盛艾，化之须臾。 则火出象还丹，阴阳金火。 大唐国内时亦有之，书不尽言，言不尽意。 然则圣人之意，其不可见乎。 若用凡水银为金丹者，妄人也。 言朱砂未得理者，不知道也。 即去真远矣。 或曰：用凡水银、凡铅而为之者，无灵。 盖不足悟水银真铅之正体，唯赞凡铅之功效。 不说水银之精妙，必以一事而成，不得兼而美之耳。 若用凡铅为药，即去道乖远。 若安水银为金丹，即不是真法。 若悟之者，正以水银、火铅为主。 但得铅本气，遇五而成丹，不遗本也。 若悟元化，一施妙用无极。 若以外物为情，则性不可合。 以水银代汞，则铅不可亲。 性不可合三宫，其可固乎。 铅不可亲八石，岂能妙乎。 金重如本初，金不失其重，日月形如常。 阴汞不失斤两，是日与月金重，不失本初。 我命在铅，铅不失天。 铅还丹成，金亿万年。 铅者二汞，本一体无二，故曰天铅。 莫坏我铅，令我命全。 莫破我车，废我还家。 铅者，砂中自生曰铅。 车者，是砂中抽出液曰车。 铅中有金，金中有还，见宝别宝，贤人得道。 铅者砂中自生日，金得火运动月还。",
      "translated_text": "Thus we know that medicinal substances move directly, the yang *qi* bears and transports, yet they do not alter their original form—aligned with the celestial fire in creation. The Reverted Elixir receives *qi* and returns to the root. The yang *qi* shines and congeals by the natural Dao, hence called the Yellow Sprout. People of the world do not know that when the Three Luminaries of heaven and earth first divided into clear and turbid, all people and the myriad things arose from the Yellow Sprout, born without transcending the Five Phases. The Yellow Sprout is the first budding, stretching, and bending of the initial sprout. It coalesces through yang and is born through yin, where yin and yang intersect. At the moment of receiving *qi*, it is initially a primordial chaos. After the separation of clear and turbid, the Yellow Sprout first emerges. In *jia*, it is called \"yellow\"; in the crescent, it is called \"sprout\"; in extension, it is called \"bud\"—hence the name Yellow Sprout. Thus we know the primordial does not depart from the Five Phases: the Five Phases are metal, wood, water, fire, and earth. Water is said to moisten and descend; fire, to flame and ascend; metal, to follow and transform; wood, to bend and straighten; earth, to sow and reap.\n\nThe formula states: The great Dao of heaven and earth endures forever; the *qi* of primordial harmony grants long life, yet none surpass the sun, moon, and stars. Yin and yang, the Five Phases, all depend on earth to be born and ultimately return to earth. They follow the four seasons in cyclic transformation—this too is the natural Dao. For instance, animal fat, receiving the *qi* of the great yang for a thousand years, transforms into *fushen*. After another thousand years, it becomes amber; after yet another thousand, it becomes crystal. All are the essence of the sun and moon’s radiant *qi*, congealed into essence by illumination. Another example: toads and frogs playing in the moonlight, clams and oysters bearing pearls—all gather and receive the *qi* of the great yin’s lunar radiance, forming pearls in the womb. These pearls are the congealed yin essence of the moon. Both substances are fit for ingestion, particularly effective for lung *qi*, fright and evil, and forgetfulness. Form them into pills with wood honey, the size of sesame seeds, and take three after meals with saliva—pearls from clams can restrain mercury.\n\nWhen a person cultivates inner virtue and power, the *qi* of primordial harmony surges and harmonizes. Through cultivation and embracing the Dao, essence congeals into a pearl, naturally granting long life. The pearl resides in the red waters—red waters are blood. Consider birds, beasts, insects, ants, fish, and crabs: all that dwell and endure receive the *qi* of primordial harmony, sustaining life without reliance on parental instruction. How could they attain enlightenment? By steadfast resolve, harmonious resonance in sound, mutual resonance among things, interpenetration of being and non-being, yin and yang embracing to fulfill the great Dao—when the two *qi* harmonize, being and non-being distinguish yet complete each other, realizing the true Dao.\n\nThe River Chariot is the master of the Five Metals, also the northern position. Water can ferry the chariot, bearing the myriad things; its wheels turn without cease. This is yang dwelling in the yin position, yin uniting with yang essence—when metal and mercury meet, it is called the River Chariot. The Dao of primordial harmony is the ancestor, establishing heaven and earth, regulating yin and yang. The four seasons proceed, and the myriad things are born. Receiving *qi* is called destiny; the most numinous is humanity. No blessing surpasses life, no misfortune surpasses death. Yet hating death while desiring life is to lose the Dao and fail to attain life. Strive, strive!\n\nMoreover, what I have annotated differs from other schools, its meaning aligning with the orthodox classics, its principle resonating with the great Dao. In discussing hexagrams and images, fire timing comes first; in selecting yin and yang, medicinal substances are primary. *Can* means to blend. Water, earth, and metal—three substances—form one family, like tallying tokens or contracts, uniting in a single principle, hence called *Cantong* (Triple Unity).\n\nThe formula states: The myriad things are not born without the sun and moon; metal and water are not perfected without fire and earth. Metal and water are the origin of transformation; fire and earth are the beginning of yin and yang. When heaven and earth were in primordial chaos, they were silent, though not yet transformed, they were ultimately the root of the myriad things. Metal is white, water is black; they meet within *qi*, resembling a chicken’s egg. The yang burning-mirror gathers fire, yet without the sun, it does not emit light. The Dog Rong use a fire-mirror to hold mugwort, transforming it in an instant—thus fire emerges, resembling the Reverted Elixir, the union of yin-yang metal and fire. Such things also exist within the Great Tang’s domain, but \"words cannot exhaust speech, nor speech exhaust meaning.\" Yet can the intent of the sages not be glimpsed?\n\nThose who use common mercury to make the Golden Elixir are deluded. Those who speak of cinnabar without grasping its principle do not know the Dao—they have strayed far from the truth. Some say: Using common mercury and common lead yields no numinosity, for they fail to comprehend the true essence of mercury and true lead, only praising the efficacy of common lead. They do not speak of mercury’s subtlety and wonder, insisting on singular success without acknowledging dual excellence. If common lead is used as medicine, it strays far from the Dao. If common mercury is used for the Golden Elixir, it is not the true method. Those who grasp it rightly take mercury and fire-lead as primary. As long as lead retains its original *qi*, encountering the Five Phases, it forms the Elixir without losing its root. If one comprehends primordial transformation, a single application yields boundless marvels. If one clings to external things as emotion, nature cannot unite. If mercury is substituted for cinnabar, lead cannot be embraced. If nature cannot unite the Three Palaces, how can it be secured? If lead cannot embrace the Eight Stones, how can it be wondrous?\n\nGold retains its original weight; gold does not lose its heaviness. The sun and moon retain their usual forms. Yin mercury does not lose its weight—this is the sun and moon’s gold, retaining its original heaviness. My destiny lies in lead; lead does not lose heaven. When lead completes the Reverted Elixir, gold endures for ten thousand myriad years. Lead is the two mercuries, originally one body without duality—hence called celestial lead. Do not harm my lead, that my destiny may be preserved. Do not break my chariot, that I may return home. Lead is that which naturally arises within cinnabar; the chariot is the liquid drawn from cinnabar. Within lead is gold; within gold is return. Discerning treasure from treasure, the worthy attain the Dao. Lead is that which naturally arises within cinnabar; gold, through fire’s movement, returns with the moon.",
      "overlap_context": " substances, and people—all arise from the Yellow Sprout. The yang *qi* is warm and diffuse, moving the earth to act, breathing as a fetus breathes. All things in spring and summer disperse and grow as the Yellow Sprout; in autumn and winter, they contract and mature, each returning to its color and original flavor, unchanged in form—hence the meaning of Reverted Elixir is to return to the root. If a person alters their constant nature, they must die; if a thing changes its color, it must decay.",
      "start_char": 7855,
      "end_char": 9085,
      "start_sentence": 420,
      "end_sentence": 485,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.48900246620178,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\通幽诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "真人言金精黄芽，制水不流溢之力，玄水也。 金精黄芽同名，自生铅也。 水者，是砂中抽出之液。 用铅不用铅，不用得长年。 用铅者，是朱砂自有铅相制。 不用铅者，是世银之母，凡铅也。 铅若不真，至道难亲。 铅若是真，不失家臣。 铅若不真，凡铅也。 铅若是真，朱铅也。 宁修铅中金，是丹砂中自生曰金。 不修金中宝，是凡水银也。 圣人明立喻，以示后学也。 鼎鼎是何鼎，是用生丹砂之本土为鼎也。 药药是何药，是用丹砂中自流生汞为药也。 火铅是丹砂被日月运动，自生出汞，为火铅也。 水银，汞之异名，是丹砂阳气未足，抽出为水银也。 水银在丹砂中含甲，精气未足曰女。 火铅在丹砂中含甲，精气足回然自生曰男。 男女相配，阴阳自得，其情更无异类也。 金丹本乎一物，而无外物入之，阳气运动，故名三一之道。 白者金精，黑者水精，其归一无二。 圣人托喻於周易爻象，运动成丹制伏，皆时逆而用之。 即魂魄丧亡，如日月交蚀失位，不相宾伏。 圣人秘惜之，不肯正论，多有隐秘之言。 从此经诀差互，多有不成。 有鄙之以失，而起大怨者。 金鼎之诀，宜慎守之。 凡药合和，见功难矣。 天道秘泄，或隐言玄象，或托附阴阳，僭说人间，言微理妙群，或自迷而不解。 自羲皇已来，好道求长生者甚众，遇而得之者寡矣。 擅率胸臆而不鉴悟，又不求师受，自立方书，求出世之方，虚自勤苦名山大谷，朽败愚儒，求不死者，未见得之。 食五谷，纵六情，人在阳，鬼在阴。 又不能驱役鬼神，策使阴阳，不得出世之丹，倒皆死没於世。 寒举绵求以自暖，热饮水而乘风驭冻，生於阴阳之界，五行所管，食土之物，死归於土，以身报土，而返本也。 若非遇日月之华气，运转其精液，三一之还丹，焉能度世。 行尸比肩，若坠石投川，往而不返，沦役归化，实可悲夫。 若遇内外金丹，饵之运形驻貌，异常然。 可出阴阳之界，五行不管，死籍不录，鬼神侍卫。 诀曰：道书仙传，秘录丹经。 《龙虎》、《上清经》五相类《周易》爻象，《参同契》歌诀，卷卷述圣人之意。 黄帝、老子、宣尼，二十四圣诸仙，并是得道之仙。 世人迷遇不会，须修行始得之。 次有不显名之士，得而隐之者，不一以为无仙道者，实愚迷哉。 所有歌录经诀爻象，皆露枝条苗裔，不说径门。 自古至今，皆须师受口诀而成，非有分者，不得而学矣。 传得此诀者，秘之宝之，天道不可轻露泄矣。 养虎还自噬，付与不道之人，殃罚七代，谪身为下鬼，长役鬼官，可不惧哉。 得其贤人，犹须探迹，内行不二，征兆有分，始可传受。 仍先虔志，启告百灵，分誓立券，方可传之，切宜慎之。 修行不二，至药无双。 夫人道合元理，自然可遇。 必须勤苦疲劳，无怨，不可仓卒，渔猎而得之。 遇明师，悟於一言大药，只有一门。 而三物水土金，非人问水土金凡物等。 得之魂魄归，长生不死。 但行不二之心，师必自至矣。 金丹内丹得门，饵者不死，与天地齐毕也。 叔诀长生，号肘后诀，以示后学不悟之者。 其造鼎并入金，及直符用卦刻漏，并不载於此，知道者审而详之。 不变色硫黄法 取鸭子去黄白了，以纸拭其中令净，其口须小，候裹乾，取黄细研，以鸡子白拌令浥浥，入鸭子中，以筋头筑令实满，口上以鸡子白和胡粉固令密。",
      "translated_text": "The Perfected One speaks: the golden essence and yellow sprouts possess the power to restrain water from overflowing—this is the Dark Water. The golden essence and yellow sprouts share a name, being the self-generated lead. Water is the liquid drawn from cinnabar. To use lead or not to use lead—without it, one cannot attain longevity. Using lead means the cinnabar naturally contains lead to restrain it. Not using lead refers to the mother of common silver, which is ordinary lead. If lead is not true, the supreme Dao is hard to attain. If lead is true, one does not lose one’s household retainer. If lead is not true, it is ordinary lead. If lead is true, it is cinnabar-lead. Better to refine the gold within lead—this is the gold self-generated within cinnabar. Do not refine the treasure within gold—this is common mercury. The sage clearly sets forth analogies to instruct later learners.\n\nWhat is the crucible? It is the native soil where raw cinnabar is born. What is the medicine? It is the mercury that naturally flows from cinnabar. Fire-lead is the mercury produced when cinnabar is moved by the sun and moon. Water-silver is another name for mercury, drawn from cinnabar when its yang qi is insufficient. When mercury resides within cinnabar, its essence incomplete, it is called the maiden. When fire-lead resides within cinnabar, its essence complete and self-generated, it is called the youth. Male and female unite, yin and yang naturally harmonize, their union free from any foreign element. The Golden Elixir originates from a single substance, with nothing external added; through the movement of yang qi, it is called the Dao of the Three-in-One. The white is the essence of metal, the black the essence of water—they return to oneness without duality. The sage borrows the hexagrams of the *Zhouyi* as metaphors, moving and refining the elixir through reversal of time. When the hun and po are lost, like the sun and moon eclipsing and losing their positions, they do not submit to one another. The sage guards this secret, unwilling to speak plainly, often using veiled language. From this, scriptural instructions diverge, and many fail to succeed. Some, despising the loss, incur great resentment.\n\nThe method of the golden crucible must be guarded with care. When medicines are combined, achieving efficacy is difficult. The heavenly Dao is secretly revealed, sometimes hidden in celestial images, sometimes attached to yin and yang, falsely expounded among men. Its words are subtle, its principles profound, yet some remain deluded and uncomprehending. Since the time of Fuxi, those who sought the Dao and long life have been many, but those who encountered and attained it have been few. Relying on their own conjectures without discernment, and without seeking a teacher’s instruction, they compose their own formulas, seeking the way to transcend the world. In vain, they toil in famous mountains and deep valleys, decaying like foolish scholars. Those who seek immortality never attain it. Eating the five grains, indulging the six desires, man dwells in yang, ghosts in yin. Unable to command ghosts and spirits or direct yin and yang, they fail to obtain the elixir of transcendence and all perish in the world. Like seeking warmth by grasping silk in the cold or drinking water to ride the wind in the heat, born within the bounds of yin and yang, governed by the five phases, consuming earthly things, they return to earth at death, repaying the earth with their bodies to revert to their origin.\n\nWithout encountering the radiant qi of the sun and moon, circulating their essence and fluids, and refining the Reverted Elixir of the Three-in-One, how can one transcend the world? They crowd together like walking corpses, like stones cast into rivers, gone without return, sinking into servitude and transformation—truly pitiable. But if one encounters the inner and outer Golden Elixir and consumes it, the body is transformed and appearance preserved in an extraordinary manner. One can escape the bounds of yin and yang, free from the five phases’ control, unrecorded in the registers of death, with ghosts and spirits as attendants.\n\nThe scripture states: Daoist books and immortal transmissions, secret records of elixir classics—*The Dragon and Tiger*, *The Supreme Clarity Scripture*, the five works akin to the *Zhouyi* hexagrams, the songs and verses of the *Cantong Qi*—all expound the sages’ intent. The Yellow Emperor, Laozi, Confucius, and the twenty-four Perfected Immortals were all immortals who attained the Dao. Worldly people, deluded and uncomprehending, must cultivate practice to achieve it. There are also unnamed individuals who attained it and concealed it. Those who deny the existence of the immortal Dao are truly foolish and deluded. All the songs, records, scriptural instructions, and hexagrams reveal only branches and leaves, not the direct path. From ancient times to the present, one must receive oral instructions from a teacher to succeed; without the proper destiny, one cannot learn it. Those who transmit this method must treasure and guard it, for the heavenly Dao must not be lightly revealed. Nurturing a tiger invites it to bite you; entrusting it to the unworthy brings calamity for seven generations, demoting one to a lowly ghost, eternally serving the ghost officials—how can one not fear this?\n\nEven when one finds a worthy person, one must still examine their conduct. Only those of unwavering inner practice and destined signs may receive the transmission. One must first purify one’s intent, invoke the hundred spirits, swear oaths, and establish a covenant before passing it on—this must be done with utmost care. Cultivation must be unwavering, the supreme medicine peerless. When human Dao aligns with the primordial principle, it can naturally be encountered. One must endure hardship and toil without complaint, not seeking it hastily or recklessly. Upon meeting an enlightened teacher, one awakens to the great medicine through a single word—there is only one gate. The three substances—water, earth, and metal—are not the common water, earth, and metal of the world. Attaining them, the hun and po return, and one achieves long life without death. With a mind of unwavering practice, the teacher will surely come.\n\nThe Golden Elixir and Inner Elixir, once their gate is attained and consumed, confer immortality, equaling heaven and earth in duration. The secret method of long life, called the *Elbow-Behind Method*, is revealed to later learners who fail to comprehend. The construction of the crucible, the addition of metal, the use of the direct tally, and the hexagram timing of the clepsydra are not recorded here—those who understand should examine and consider them carefully.\n\n**Method for Unchanging-Colored Sulfur:**\nTake a duck egg, remove the yolk and white, and wipe the inside clean with paper. The opening should be small. Once dry, take fine yellow sulfur, grind it, and mix it with egg white until slightly moist. Fill the egg with this mixture, packing it tightly with a chopstick. Seal the opening with egg white mixed with lead powder to ensure it is airtight.",
      "overlap_context": "the two mercuries, originally one body without duality—hence called celestial lead. Do not harm my lead, that my destiny may be preserved. Do not break my chariot, that I may return home. Lead is that which naturally arises within cinnabar; the chariot is the liquid drawn from cinnabar. Within lead is gold; within gold is return. Discerning treasure from treasure, the worthy attain the Dao. Lead is that which naturally arises within cinnabar; gold, through fire’s movement, returns with the moon.",
      "start_char": 9086,
      "end_char": 10350,
      "start_sentence": 486,
      "end_sentence": 547,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.05703592300415,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\通幽诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "即以黄丹和鸡子白为泥，泥鸭子周回，可厚二分许。 候乾，以黄泥泥，令厚二分，晒乾。 又以铅细细裹之，可四五分，已来三如之。 丛立於铁臼中，消铅汁淋取一半，候玲，又淋以没头，头上可厚五六寸。 即臼外如泥火炉法，三处安火，常令臼微热，不令铅销。 至第十四日，即大火令铅销，销即浮出收。 候玲开之，已伏火，其色不变，可作伏汞砂子匮。 用一两伏了者，勾得半两生者，五日伏火亦堪。 服木方 木一斛，水清诤洗，乾，细梼为末。 以清水二斛煮令烂，以绢绞取汁，於铜器中汤上蒸之。 又入白蜜一升，乾枣去核烂研，令皮肉相得，取一升入木中，搅令相入，如脯状。 日服如弹子大，三四枚，百病皆除，万恶不伤，面有光泽，耳目聪明，三年颜如女子，神仙不死。 又方 木一斛，净洗，乾，梼为末。 大枣四斗去核，酒五斗和，慢煎搅令成煎。 日服李子大，三丸，百病不伤，面如童子，耐寒冻。 通幽诀竟",
      "translated_text": "Then mix red lead with egg white to form a paste, and coat the entire duck egg with it to a thickness of approximately two *fen*. Once dry, apply yellow clay to a thickness of two *fen* and let it dry in the sun. Next, wrap it finely with lead, layering it to a thickness of four or five *fen*, repeating this process three times. Stand the egg upright in an iron mortar, then pour molten lead over it until half-submerged. When cool, pour more molten lead to cover the top, leaving a thickness of five or six *cun* above. Around the mortar, construct a mud fire furnace as usual, placing fire at three points to keep the mortar slightly warm, ensuring the lead does not melt completely. On the fourteenth day, apply intense heat to melt the lead, and once melted, skim off the floating dross and collect it. When cool, open the egg to find the sulfur subdued by fire, its color unchanged. This can be used to prepare a vessel for subduing cinnabar and mercury. One *liang* of subdued sulfur can subdue half a *liang* of raw sulfur in five days, which is also sufficient for the fire-subduing process.\n\n**Wood-Elixir Formula:**\nTake one *hu* of wood, wash it clean with water, dry it, and pound it finely into powder. Boil it in two *hu* of clear water until soft, then strain the liquid through silk. Steam the liquid in a copper vessel over boiling water. Add one *sheng* of white honey and one *sheng* of pitted, mashed dates, blending the pulp and skin thoroughly. Mix this into the wood liquid, stirring until it reaches a jerky-like consistency. Take daily a piece the size of a bullet, three or four pieces, and all illnesses will be cured, no evil will harm you, your complexion will glow, your ears and eyes will sharpen, and after three years, your face will resemble that of a maiden. You will become an immortal and never die.\n\n**Another Formula:**\nTake one *hu* of wood, wash it clean, dry it, and pound it into powder. Remove the pits from four *dou* of large dates, mix with five *dou* of wine, and simmer slowly while stirring until it forms a thick syrup. Take daily three pills the size of a plum, and no illness will harm you. Your face will become like that of a child, and you will withstand cold and frost.\n\nThe *Secret of Penetrating the Profound* concludes here.",
      "overlap_context": "of the clepsydra are not recorded here—those who understand should examine and consider them carefully.\n\n**Method for Unchanging-Colored Sulfur:**\nTake a duck egg, remove the yolk and white, and wipe the inside clean with paper. The opening should be small. Once dry, take fine yellow sulfur, grind it, and mix it with egg white until slightly moist. Fill the egg with this mixture, packing it tightly with a chopstick. Seal the opening with egg white mixed with lead powder to ensure it is airtight.",
      "start_char": 10350,
      "end_char": 10726,
      "start_sentence": 548,
      "end_sentence": 565,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.396331071853638,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\通幽诀.txt",
        "category": "众术类"
      }
    }
  ]
}