{
  "source_id": "道德真经颂",
  "source_file": "chunked_daozang\\道德真经颂.json",
  "total_chunks": 3,
  "total_original_chars": 3225,
  "total_translated_chars": 16084,
  "total_translation_time": 46.26731634140015,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\赞颂类\\道德真经颂.txt",
    "category": "赞颂类"
  },
  "full_translation": "**Ode to the Dao/Way of the *Zhenjing* of *De*\n\n**Title:** Ode to the Dao/Way of the *Zhenjing* of *De*.\nComposed by Jiang Rong’an of the Song dynasty. One scroll.\nSource text: *Zhengtong Daozang* (Canon of the Dao in the Era of Rectified Statutes), in the *Dongshen* (Cavernous Divinity) section under *Zansong* (Praise/Odes).\n\n**Ode to the Dao/Way of the *Zhenjing* of *De*\nComposed by Jiang Rong’an of Mount Mao.\n\n**Preliminary Ode on the Entire Scripture:**\nWithin the violet mist, truths flow unbound,\nI leisurely play with golden leaves, a child at heart.\nIf one clings to words and seeks the doctrine’s core,\nOne wrongs the aged sage of yore.\n\n**Chapter 1:**\nTender and dense beyond all origin,\nStirring dust yet never can be parted.\nToday I open one thread for you—\nLet all the qi blow through this door.\n\n**Chapter 2:**\nThe root essence differs not from delusion’s guise,\nYet other teachings twist it endlessly.\nWhen effort comes, muster bold resolve,\nFor the Dao itself never stains the pure tide.\n\n**Chapter 3:**\nDiscernment sharp yet applied with grace,\nNot letting wealth spoil the child’s pride.\nThrough winter’s chill and summer’s heat no strife,\nThe Four Seas rejoice in this holy age.\n\n**Chapter 4:**\nPity the labor over fame and rank,\nThe bitterest torment the world doth know.\nCast aside, reclaim—no fixed intent,\nLest the land sink beneath the weight you bear.\n\n**Chapter 5:**\nOne thing, ever luminous and ancient,\nRefined in eight facets, all-pervasive.\nSeemingly vanished, yet never spent—\nWhen plucked, its use knows no end.\n\n**Chapter 6:**\nHeaven and Earth, from the start, are natural,\nNo contrivance ever marked their frame.\nIf one gains even a spark of its power,\nSitting alone on a peak, they rule the myriad.\n\n**Chapter 7:**\nI, without intent, have no strife,\nBeyond kalpas, free in boundless flight.\nSince one phrase named me, form and face,\nTo this day, the truth remains unclear.\n\n**Chapter 8:**\nBefore Heaven’s birth, the Dao abides,\nEight myriad dusts of toil from its gates.\nSeize the root—unmoved, unshaken—\nWherever it stands, it is ever honored.\n\n**Chapter 9:**\nWith intent, how unlike the Dao’s own?\nIts own essence is ever true.\nDo not turn nectar into venom,\nOnly then shall you see the truly wise.\n\n**Chapter 10:**\nAll conditioned things are suffering’s mark,\nSeeking branches and leaves—when shall it cease?\nThough one cuts off a thousand paths,\nThey’ve already fallen into another’s scheme.\n\n**Chapter 11:**\nIts marvel lies in its natural flow,\nEach moment’s use demands no deviation.\nOnly fear this truth no one can grasp—\nThen call for the ferry at the river’s edge.\n\n**Chapter 12:**\nOutside the gate, a myriad winds,\nHow many wanderers never turn back.\nWithout the strength to lift the cauldron or shift the mountain,\nWho dares to gaze upon the cold path home?\n\n**Chapter 13:**\nHonor and insult, no self remains,\nYet self-grasping spawns endless strife.\nIf one sees self-grasping is not self,\nWhy cling to another’s fleeting dust?\n\n**Chapter 14:**\nFree of all names, yet not true,\nExplain it clearly—yet still it flees.\nOnly in present joys and sorrows’ weight,\nDoes one know what law can ease the heart.\n\n**Chapter 15:**\nThe Six Eyes of the inverted mountain defy measure,\nIn vain one compares its form to mortal speech.\nNot a single particle is ever the same—\nEach pluck reveals a fresh new face.\n\n**Chapter 16:**\nCold paths alone deserve the whip,\nAt home, all things return to their nature.\nBorrowing the old woman’s robe to worship her,\nStill, one must return to her very presence.\n\n**Chapter 17:**\nKnowing the Dao too soon brings ill,\nHow can one bear the world’s sharp blades?\nWhen deeds are done and virtue stands,\nTo forsake the Sage is to break one’s heart.\n\n**Chapter 18:**\nThe true hero seeks no medicine for illness,\nThe fool mistakes the flower for his own gaze.\nBetter the boundless blue of ten thousand miles,\nThan a single moonbeam shared with none.\n\n**Chapter 19:**\nGood deeds need not be sought in vain,\nYet turning them brings sorrow again.\nClinging to trifles—what purpose serves?\nIn the end, one must return to home.\n\n**Chapter 20:**\nThe great round mirror holds no distinction,\nA hundred feet of pole—yet one must turn.\nWhen breath is cut, the path is found,\nAs ever, the Dao is the original man.\n\n**Chapter 21:**\nAll sights are revealed without concealment,\nWithin them, the finest grace is seen.\nThrough ages clear, yet never dimmed—\nGazing at green hills, autumn comes again.\n\n**Chapter 22:**\nCast aside, reclaim—many ways,\nYet its use lies in the slightest thread.\n\n**Chapter 23:**\nMountains are mountains, waters are waters,\nYet waters are not waters, mountains are not mountains.\nEach man has his own path to the heavens—\nYet why do men make things so difficult?\n\n**Chapter 24:**\nThe footwork must be firm and grounded,\nYet boasting of one’s own shame becomes a demon.\nIf even the slightest thread is not grasped,\nThen gazing upon it already brings excess.\n\n**Chapter 25:**\nIn the midst of all things, no separation—\nYet the transcendent stands at the pinnacle, like the Emperor’s image.\nSeeking fame by force, fame cannot be attained,\nOnly when the moon sets does one see it never leaves the sky.\n\n**Chapter 26:**\nOnce the slightest thread is touched, change arises—\nThe whole roof is a board, not so light.\nAt the moment, discerning guest from host,\nOne sits in judgment at the southern gate, declaring peace.\n\n**Chapter 27:**\nThe marvel lies not in contrivance,\nBut in its warmth, like a loving heart.\nWho understands the teacher’s hidden intent?\nAlone before the bound winds, it vexes the mind.\n\n**Chapter 28:**\nIn smallness, deceit thrives on the pair,\nYet poverty and vexation bring early age—how so?\nAt the end, one must establish his household,\nYet men are troubled by the world’s endless turns.\n\n**Chapter 29:**\nTo shape the heart as if returning—\nThis too must be mistaken.\nWhat fear of the world’s myriad affairs?\nOne should guard against them in leisure’s embrace.\n\n**Chapter 30:**\nVictory through force is but a fleeting condition,\nWhen delight is thick, it’s best to rest.\nIt’s not the general’s bold heart,\nBut the thought that even flat ground brings sorrow.\n\n**Chapter 31:**\nPoison cures poison, as the saying goes—\nOnce the sickness is gone, no further need for medicine.\nDo not boast that poison can cure the ailment,\nFor one must consider the time before the fever’s peak.\n\n**Chapter 32:**\nThe signs precede all names—\nYet within them lies the finest crown.\nWithout cause, names are specially bestowed,\nAnd the grand procession flows eastward day and night.\n\n**Chapter 33:**\nAll means are employed with ease,\nYet all is swept away by one law.\nEven if black winds overturn the sea,\nNo tale tells of capsizing the fishing boat.\n\n**Chapter 34:**\nIts glory is ever revealed without concealment,\nYet it shines fully where it should.\nBorn of all things, it is not their master—\nAlone, it sits majestic—who can measure it?\n\n**Chapter 35:**\nThough its form lacks grandeur or imposing presence,\nAll who come are encompassed within its embrace.\nThe six uses cannot deplete its flow,\nEach moment’s application knows no end.\n\n**Chapter 36:**\nIts workings are profound and far-reaching—\nTruly difficult to fathom.\nIts transformations vast and boundless—\nNo logic can encompass them.\nDo not bring your judgments to it,\nFor in the end, it will not align with you.\n\n**Chapter 37:**\nThe Dao stands idle, yet encompasses all wonders,\nAll phenomena are clearly divided within it.\nBeyond ten thousand miles, the dust settles—\nEndless days of quiet, rejoicing in the peace.\n\n**Chapter 38:**\nIn the great round mirror, no distinctions exist,\nYet distinctions of beauty and ugliness harm not the mirror.\nPity those who follow as examples,\nFor they shorten the path and stretch the measure.\n\n**Chapter 39:**\nThe marvel lies not in multiplicity,\nFor excess only breeds confusion and error.\nEven if distinctions of right and wrong are set aside,\nJade and stone remain as they always were.\n\n**Chapter 40:**\nAt the cliff’s edge, one must turn back,\nFor effort lies not in strength, but in restraint.\nThe world is ever in tumult—\nYet who knows what we toil for all day?\n\n**Chapter 41:**\nTrue gold has its own true worth,\nOther treasures must be returned to their owner.\nAt the end, no need to break it with weighty words,\nYet to this day, none truly understands the connoisseur.\n\n**Chapter 42:**\nOne must overturn the brambles’ nest,\nYet avoid entangling oneself in nets.\nOnly when they rest must we wait,\nFor many are misled by many misleaders.\n\n**Chapter 43:**\nThe crimson flame burns like fire in men,\nYet a stone man in fire cannot smoke.\nBetween them, little good remains,\nYet one buys the wind’s light without cost.\n\n**Chapter 44:**\nLight and heavy have their constant measure—\nAt the time, avoid miscalculating.\nDo not treat good things as strange or rare,\nFor good things turn the heart to sorrow.\n\n**Chapter 45:**\nClear discernment brings true use,\nWithin it, distinctions of shallow and deep.\nTwofold judgment without reliance,\nAfter rain, a thousand peaks remain green.\n\n**Chapter 46:**\nWhen the world is in turmoil, I am in turmoil,\nYet when I am at ease, the world is at ease.\nBrightly recognizing the idle law,\nA single laugh makes heaven and earth vast.\n\n**Chapter 47:**\nIts wind arises where it should not leave,\nYet the slightest movement brings it no clarity.\nSitting and watching the trifling guests outside,\nHow many chariots and horses pass at will?\n\n**Chapter 48:**\nFor the Dao, do not mistake it for study,\nBeyond ten thousand miles, the skulls lie dry.\nMajestic, it sits in judgment over the land of no birth,\nAnd gazes further toward the shores of no birth.\n\n**Chapter 49:**\nThe Dao is level, yet no faction tilts it,\nWherever spring flowers bloom, they are fresh and fair.\nThe fool sits opposite, unable to speak of dreams,\nSo he ties the crane’s glue to mend the broken string.\n\n**Chapter 50:**\nThe belly is split, the entrails spilled—\nAll is revealed, no need for further doubt.\nWhen doubt arises, the path to clarity is found,\nYet men are forbidden from peering with their eyes.\n\n**Chapter 51:**\nWithout stirring a hair, all things respond,\nYet who knows gratitude after it is given?\nWhen affairs are met without attachment,\nOne asks: *What was the original heart?*\n\n**Chapter 52:**\nFrom the thread’s beginning, the root of life is pondered,\nYet knowing its source is still not enough.\nEven sealed like water, it is not yet the full measure—\nOnly at home does one truly grasp its advantage.\n\n**Chapter 53:**\nThe Dao lies within, yet is hard to know,\nThe distant path is clear, yet foes cannot cross it.\nThe fool does not understand establishing his household,\nChasing youthful splendor ever outward.\n\n**Chapter 54:**\nThe effort is steady where no wind passes,\nThick and endless, yet never exhausted.\nWhat is this? The hair’s end contains the Dharma-realm,\nAll green recognizes its master.\n\n**Chapter 55:**\nAll day, the child plays freely,\nYet the body remains still, unaware.\nOnce touched by contrivance, it becomes artificial—\nReturning it, the leaves fall, and the branches sprout anew.\n\n**Chapter 56:**\nSeated firm at the fortress gate, one thread connects—\nNaturally, wherever one goes, grace flows unbound.\nMorning rain washes a thousand peaks to emerald,\nA lone seagull skims the waves, its flight so light.\n\n**Chapter 57:**\nWithin all dharmas, constancy abides unseen,\nYet stir a speck of dust, and all is undone.\nAutumn winds scatter rain in vain—\nNo malice in the cold, yet all grow chilled.\n\n**Chapter 58:**\nNeither wise nor foolish, yet boundless in intent,\nClouds shift, rain falls—how many times?\nFew grasp this fleeting thought,\nAlone in borrowed robes, he turns to go.\n\n**Chapter 59:**\nCold, unadorned effort—truly plain and true,\nAt home, its work defies all measure.\nWhen virtue is complete and practice fulfilled,\nAcross kalpas and lives, its fragrance lingers.\n\n**Chapter 60:**\nA thought or impulse brings lack and want,\nYet with candle held, all doubt is cut.\nHeaven and earth stretch wide in perfect peace—\nThis grace must be known by all alike.\n\n**Chapter 61:**\nWhen trees fall and mountains stand bare in autumn’s wealth,\nYin and yang’s craft demands deep pursuit.\nBut hide the water of *kan*, suppress the fire of *li*,\nAnd spirit soars to crown the land.\n\n**Chapter 62:**\nOne bright point, round and clear, is everywhere the same—\nHigh or low, rich or poor, none compare to this.\nWhat’s gained is borrowed, lacking from the start,\nEven sages bow before its might.\n\n**Chapter 63:**\nThe Dao in emptiness—early or late, it fails not,\nNo need for schemes when effort is complete.\nDo not think this easy—here, even needles clash.\n\n**Chapter 64:**\nCut off the paths of a thousand contrivances first,\nFor every move of the iron brush brings harm.\nPity those who lack patience for others’ affairs,\nTheir idle worries twist the heart.\n\n**Chapter 65:**\nAwake to the Dao, yet not like the foolish—\nAwake to schemes, yet more entangled still.\nIf one knows this true foundation,\nMystery’s play is beyond all knowing.\n\n**Chapter 66:**\nAll streams converge where the great river flows,\nBecause his home’s message reaches far.\nTo force the heartless into intent,\nStirs chaos—spring’s flowers scatter in vain.\n\n**Chapter 67:**\nStrike at the core, and heaven and earth shift—\nEven Wang Wei’s brush could not capture this.\nToo bad the muddy path is left undisturbed,\nFew dare tread where the depths lie hidden.\n\n**Chapter 68:**\nUnderstanding the family’s wind, it serves with ease,\nKnow that water shapes itself as it flows.\nThis truth is boundless—how to measure it?\nTides recede, yet the moon rises anew.\n\n**Chapter 69:**\nLike a general with fortified walls, bending foes,\nNo harm done, yet peace is won.\nWhen all is done and nothing remains,\nThe hall of old is still born anew.\n\n**Chapter 70:**\nThis question is clear, yet none dare answer truly—\nWhy do people shrink from what’s plain?\nIf all could see this, they’d scorn a single bowl of soup.\n\n**Chapter 71:**\nGained or lost, it’s the same as before,\nYet not a hair’s breadth escapes its reach.\nBefore the body leaves the critical stage,\nA thousand wounds—what cure could there be?\n\n**Chapter 72:**\nBorn bold in spirit, unbounded in mind,\nVastness itself is no constraint.\nWho could gather this as he has done?\nOn coral branches, the sunbird dances.\n\n**Chapter 73:**\nTo kill or spare at the decisive moment—how profound!\nLight or heavy, only the master knows.\nLet me speak plainly to you now,\nFor winter’s chill pierces bone and marrow.\n\n**Chapter 74:**\nFear the law, yet know those who grasp it well—\nFrom first to last, the law knows no kin.\nTo see where law’s impartiality lies,\nObserve the moon’s reflection—no trace remains.\n\n**Chapter 75:**\nIn this peaceful world, no deceit remains,\nYet the master’s helplessness is the key.\nOnly in action does the original goodness show—\nBarefoot, he laughs, his toes dangling free.\n\n**Chapter 76:**\nThis origin is no different in kind,\nYet who would forcefully divide strong and weak?\nOnce life and death are split asunder,\nNo scales could weigh the worth of a grain.\n\n**Chapter 77:**\nHeaven and man differ by not a hair’s breadth,\nYet stray a hair’s breadth, and all is undone.\nFearful of night’s advance, they rise too soon—\nWho knows they’ll only catch the dew on their clothes?\n\n**Chapter 78:**\nFacing each other, no words are false,\nYet why does no one truly understand?\nHere, deep meaning is offered plainly—\nThe sun rises in the east, yet sets in the west.\n\n**Chapter 79:**\nTo see through clearly is no wrong,\nYet to recognize, one must first reach the source.\nWhen the source is known in truth,\nThe Way of Heaven stands without deviation.\n\n**Chapter 80:**\nRich or poor, the family’s ease is sure,\nWithin all dharmas, all is green and bright.\nEating, dressing—no greater task,\nAll share the wind and moon as one with Heaven.\n\n**Chapter 81:**\nChoose the law with eyes wide open,\nFor truth’s use lies beyond dust and root.\nAt the end, a turn without private intent—\nNo separation from this very place, this master.\n\n*The Ode to the Classic of the Way and Its Virtue concludes.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "道德真经颂 经名：道德真经颂。 宋蒋融庵撰。 一卷。 底本出处：《正统道藏》洞神部赞颂类。 道德真经颂 茅山蒋融庵撰 经总序颂 紫雾光中信息通，聊将黄叶玩儿童。 若拘语句明宗旨，辜负当年白发翁。 一章 绵绵密密绝胚胎，动着尘埃拨不开。 今日为君通一线，一齐吹向此门来。 二章 本元差别与肴讹，无奈他家事转多。 用力到时须勇猛，端然元不犯清波。 三章 见得分明用得高，不教家富小儿娇。 寒来暑往无多事，四海清平贺圣朝。 四章 惜功名位劳心力，说尽人间最苦心。 放去收来元限意，免教陆地受平沉。 五章 一物灵然亘古雄，玲珑八面总疏通。 看时恰似无踪迹，及至拈来用不穷。 六章 天地由来本自然，何曾有意着中边。 若人荐得丝毫力，独坐孤峰压大千。 七章 我本无心岂有争，迢迢劫外惫纵横。 自从一句相名貌，直至如今说不清。 八章 先天有物镇长存，八万尘劳出此门。 识取根源端不动，巍巍何处不称尊。 九章 有心何似本无心，自己家风处处真。 莫把醍醐成毒药，到头方见出头人。 十章 一切有为俱是苦，寻枝摘叶几时休。 直饶坐断千差路，已落他家第二筹。 十一章 妙在机先本自然，头头应用勿颇偏。 只愁此意无人会，更向滩头唤渡船。 十二章 门外风光几万般，几多游子不知还。 若无举鼎拔山力，争得回头冷处看。 十三章 宠辱本来无我相，只因我相逐绿生。 若明我相无非我，岂受他家一点尘。 十四章 离诸名相且非真，说得分明转不亲。 只把目前恩苦事，方知何法可当情。 十五章 反山六目犹难测，徒把形容乱比伦。 不是其中些子别，一回拈出一回新。 十六章 冷处方才好着鞭，到家万事总如然。 借婆衫子拜婆节，依旧还归婆面前。 十七章 道着知之早不祥，那堪遍地是刀枪。 及乎到得功成后，辜负束君枉断肠。 十八章 好汉不求元病药，痴人认着眼中花。 何如万里长天碧，一月孤光共一家。 十九章 好事端然不用求，谁知转地却成愁。 区区依倚成何事，毕竟归家是到头。 二十章 大圆镜裹无差别，百尺竿头要转身。 消息断时方活路，依前不离本来人。 二十－章 触目全彰无背向，於中些子最风流。 寥寥千古分明在，坐看青山几度秋。 二十二章 放去收来几百般，用时总在一毫端。",
      "translated_text": "**Ode to the Dao/Way of the *Zhenjing* of *De*\n\n**Title:** Ode to the Dao/Way of the *Zhenjing* of *De*.\nComposed by Jiang Rong’an of the Song dynasty. One scroll.\nSource text: *Zhengtong Daozang* (Canon of the Dao in the Era of Rectified Statutes), in the *Dongshen* (Cavernous Divinity) section under *Zansong* (Praise/Odes).\n\n**Ode to the Dao/Way of the *Zhenjing* of *De*\nComposed by Jiang Rong’an of Mount Mao.\n\n**Preliminary Ode on the Entire Scripture:**\nWithin the violet mist, truths flow unbound,\nI leisurely play with golden leaves, a child at heart.\nIf one clings to words and seeks the doctrine’s core,\nOne wrongs the aged sage of yore.\n\n**Chapter 1:**\nTender and dense beyond all origin,\nStirring dust yet never can be parted.\nToday I open one thread for you—\nLet all the qi blow through this door.\n\n**Chapter 2:**\nThe root essence differs not from delusion’s guise,\nYet other teachings twist it endlessly.\nWhen effort comes, muster bold resolve,\nFor the Dao itself never stains the pure tide.\n\n**Chapter 3:**\nDiscernment sharp yet applied with grace,\nNot letting wealth spoil the child’s pride.\nThrough winter’s chill and summer’s heat no strife,\nThe Four Seas rejoice in this holy age.\n\n**Chapter 4:**\nPity the labor over fame and rank,\nThe bitterest torment the world doth know.\nCast aside, reclaim—no fixed intent,\nLest the land sink beneath the weight you bear.\n\n**Chapter 5:**\nOne thing, ever luminous and ancient,\nRefined in eight facets, all-pervasive.\nSeemingly vanished, yet never spent—\nWhen plucked, its use knows no end.\n\n**Chapter 6:**\nHeaven and Earth, from the start, are natural,\nNo contrivance ever marked their frame.\nIf one gains even a spark of its power,\nSitting alone on a peak, they rule the myriad.\n\n**Chapter 7:**\nI, without intent, have no strife,\nBeyond kalpas, free in boundless flight.\nSince one phrase named me, form and face,\nTo this day, the truth remains unclear.\n\n**Chapter 8:**\nBefore Heaven’s birth, the Dao abides,\nEight myriad dusts of toil from its gates.\nSeize the root—unmoved, unshaken—\nWherever it stands, it is ever honored.\n\n**Chapter 9:**\nWith intent, how unlike the Dao’s own?\nIts own essence is ever true.\nDo not turn nectar into venom,\nOnly then shall you see the truly wise.\n\n**Chapter 10:**\nAll conditioned things are suffering’s mark,\nSeeking branches and leaves—when shall it cease?\nThough one cuts off a thousand paths,\nThey’ve already fallen into another’s scheme.\n\n**Chapter 11:**\nIts marvel lies in its natural flow,\nEach moment’s use demands no deviation.\nOnly fear this truth no one can grasp—\nThen call for the ferry at the river’s edge.\n\n**Chapter 12:**\nOutside the gate, a myriad winds,\nHow many wanderers never turn back.\nWithout the strength to lift the cauldron or shift the mountain,\nWho dares to gaze upon the cold path home?\n\n**Chapter 13:**\nHonor and insult, no self remains,\nYet self-grasping spawns endless strife.\nIf one sees self-grasping is not self,\nWhy cling to another’s fleeting dust?\n\n**Chapter 14:**\nFree of all names, yet not true,\nExplain it clearly—yet still it flees.\nOnly in present joys and sorrows’ weight,\nDoes one know what law can ease the heart.\n\n**Chapter 15:**\nThe Six Eyes of the inverted mountain defy measure,\nIn vain one compares its form to mortal speech.\nNot a single particle is ever the same—\nEach pluck reveals a fresh new face.\n\n**Chapter 16:**\nCold paths alone deserve the whip,\nAt home, all things return to their nature.\nBorrowing the old woman’s robe to worship her,\nStill, one must return to her very presence.\n\n**Chapter 17:**\nKnowing the Dao too soon brings ill,\nHow can one bear the world’s sharp blades?\nWhen deeds are done and virtue stands,\nTo forsake the Sage is to break one’s heart.\n\n**Chapter 18:**\nThe true hero seeks no medicine for illness,\nThe fool mistakes the flower for his own gaze.\nBetter the boundless blue of ten thousand miles,\nThan a single moonbeam shared with none.\n\n**Chapter 19:**\nGood deeds need not be sought in vain,\nYet turning them brings sorrow again.\nClinging to trifles—what purpose serves?\nIn the end, one must return to home.\n\n**Chapter 20:**\nThe great round mirror holds no distinction,\nA hundred feet of pole—yet one must turn.\nWhen breath is cut, the path is found,\nAs ever, the Dao is the original man.\n\n**Chapter 21:**\nAll sights are revealed without concealment,\nWithin them, the finest grace is seen.\nThrough ages clear, yet never dimmed—\nGazing at green hills, autumn comes again.\n\n**Chapter 22:**\nCast aside, reclaim—many ways,\nYet its use lies in the slightest thread.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 981,
      "start_sentence": 0,
      "end_sentence": 74,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 13.499208927154541,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\赞颂类\\道德真经颂.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "直须截断功勋路，方得全军战胜还。 二十三章 山是山兮水是水，水不是水山非山。 人人自有通天窍，争奈时人自作难。 二十四章 脚下工夫须踏实，自扬家丑却成魔。 假饶不把丝毫者，着眼观来已自多。 二十五章 浑沦一物离中边，卓越端居象帝先。 只为强名名不得，方知月落不离天。 二十六章 才涉丝毫变态生，全身檐板实非轻。 当场辨得宾中主，坐断南头称太平。 二十七章 妙处初非由造作，为人亲切老婆心。 师资密意谁人会，独对束风恼杀人。 二十八章 做小着奸全仗俩，贫烦早老又如何。 至头须是成家业，争奈人间事转多。 二十九章 将心拟待还应错，着意为时又转伤。 何怕世间多少事，也宜闲处着堤防。 三十章 强兵战胜若为条，得意浓时便好休。 不是将军心胆大，想应平地使人愁。 三十一章 毒病还他毒药医，病除毒药不须治。 不夸毒药能除病，病疟当思未酸时。 三十二章 朕兆机先岂有名，其中些子冠群伦。 无端特地安名后，衮衮东流日夜倾。 三十三章 万般施设甚优游，一切都卢一法收。 假使黑风翻大海，未闻沉却钓鱼舟。 三十四章 遍体时时不覆藏，不离当处尽风光。 生成万有元非主，独坐巍巍孰可量。 三十五章 形状虽无气象雄，憧憧来者总包容。 六用不行消息尽，头头应用了元穷。 三十六章 机关深远诚难测，变化恢张理莫穷。 休把是非来着我，到头应不与君通。 三十七章 大道闲闲该众妙，森罗万象尽分明。 三千里外灰消息，永日寥寥贺太平。 三十八章 大圆镜裹元分别，分别妍媸镜不伤。 可惜后人成榜样，从兹较短复量长。 三十九章 妙处元来不在多，事多徒自起肴讹。 直饶分别肴讹去，玉石依前不似他。 四十章 悬崖断处须回首，省力工夫不在强。 扰扰世间多少事，不知终日为谁忙。 四十一章 真金自有真金价，别宝须还识宝人。 末后不因重说破，至今不复解知音。 四十二章 便须掀倒葛藤窠，切忌将身入网罗。 直得待他休歇后，误人多处误人多。 四十三章 红焰烁人流似火，石人入火不能烟。 其间好处无多子，买得风光不用钱。 四十四章 轻重由来自有常，当时切忌错商量。 莫将好事为奇特，好事令人转断肠。 四十五章 见得分明用得真，个中别自涉疏亲。 两头坐断无依倚，雨过千峰一样青。 四十六章 事扰扰时吾扰扰，我闲闲后事闲闲。 明明识得闲闲法，长笑一声天地宽。 四十七章 不离当处自风生，动着丝毫便不清。 坐看区区门外客，几多车马任纵横。 四十八章 为道休将为学观，三千里外髑髅乾。 巍巍坐断无生国，更向无生那畔看。 四十九章 大道平平绝党偏，春花何处不鲜妍。 痴人相对难言梦，故把鸾胶续断弦。 五十章 剖腹倾肠都说破，何须特地转生疑。 疑时自有通霄路，不许时人着眼窥。 五十－章 不动纤毫应万机，知恩之后更谁知。 及乎事向无心得，却问元心是阿谁。 五十二章 丝头念念生之本，识得根源善执持。 水泄不通犹未是，到家正好着便宜。 五十三章 道在其中不易知，迢迢大路绝倾敌。 痴人不解成家业，尽逐韶华向外驰。 五十四章 工夫稳处不通风，密密绵绵又不穷。 底事毛端含法界，都绿认得主人翁。 五十五章 终朝赤子恣熙熙，当体凝然总不知。 才涉有为成造作，还他叶落又抽枝。",
      "translated_text": "**Chapter 23:**\nMountains are mountains, waters are waters,\nYet waters are not waters, mountains are not mountains.\nEach man has his own path to the heavens—\nYet why do men make things so difficult?\n\n**Chapter 24:**\nThe footwork must be firm and grounded,\nYet boasting of one’s own shame becomes a demon.\nIf even the slightest thread is not grasped,\nThen gazing upon it already brings excess.\n\n**Chapter 25:**\nIn the midst of all things, no separation—\nYet the transcendent stands at the pinnacle, like the Emperor’s image.\nSeeking fame by force, fame cannot be attained,\nOnly when the moon sets does one see it never leaves the sky.\n\n**Chapter 26:**\nOnce the slightest thread is touched, change arises—\nThe whole roof is a board, not so light.\nAt the moment, discerning guest from host,\nOne sits in judgment at the southern gate, declaring peace.\n\n**Chapter 27:**\nThe marvel lies not in contrivance,\nBut in its warmth, like a loving heart.\nWho understands the teacher’s hidden intent?\nAlone before the bound winds, it vexes the mind.\n\n**Chapter 28:**\nIn smallness, deceit thrives on the pair,\nYet poverty and vexation bring early age—how so?\nAt the end, one must establish his household,\nYet men are troubled by the world’s endless turns.\n\n**Chapter 29:**\nTo shape the heart as if returning—\nThis too must be mistaken.\nWhat fear of the world’s myriad affairs?\nOne should guard against them in leisure’s embrace.\n\n**Chapter 30:**\nVictory through force is but a fleeting condition,\nWhen delight is thick, it’s best to rest.\nIt’s not the general’s bold heart,\nBut the thought that even flat ground brings sorrow.\n\n**Chapter 31:**\nPoison cures poison, as the saying goes—\nOnce the sickness is gone, no further need for medicine.\nDo not boast that poison can cure the ailment,\nFor one must consider the time before the fever’s peak.\n\n**Chapter 32:**\nThe signs precede all names—\nYet within them lies the finest crown.\nWithout cause, names are specially bestowed,\nAnd the grand procession flows eastward day and night.\n\n**Chapter 33:**\nAll means are employed with ease,\nYet all is swept away by one law.\nEven if black winds overturn the sea,\nNo tale tells of capsizing the fishing boat.\n\n**Chapter 34:**\nIts glory is ever revealed without concealment,\nYet it shines fully where it should.\nBorn of all things, it is not their master—\nAlone, it sits majestic—who can measure it?\n\n**Chapter 35:**\nThough its form lacks grandeur or imposing presence,\nAll who come are encompassed within its embrace.\nThe six uses cannot deplete its flow,\nEach moment’s application knows no end.\n\n**Chapter 36:**\nIts workings are profound and far-reaching—\nTruly difficult to fathom.\nIts transformations vast and boundless—\nNo logic can encompass them.\nDo not bring your judgments to it,\nFor in the end, it will not align with you.\n\n**Chapter 37:**\nThe Dao stands idle, yet encompasses all wonders,\nAll phenomena are clearly divided within it.\nBeyond ten thousand miles, the dust settles—\nEndless days of quiet, rejoicing in the peace.\n\n**Chapter 38:**\nIn the great round mirror, no distinctions exist,\nYet distinctions of beauty and ugliness harm not the mirror.\nPity those who follow as examples,\nFor they shorten the path and stretch the measure.\n\n**Chapter 39:**\nThe marvel lies not in multiplicity,\nFor excess only breeds confusion and error.\nEven if distinctions of right and wrong are set aside,\nJade and stone remain as they always were.\n\n**Chapter 40:**\nAt the cliff’s edge, one must turn back,\nFor effort lies not in strength, but in restraint.\nThe world is ever in tumult—\nYet who knows what we toil for all day?\n\n**Chapter 41:**\nTrue gold has its own true worth,\nOther treasures must be returned to their owner.\nAt the end, no need to break it with weighty words,\nYet to this day, none truly understands the connoisseur.\n\n**Chapter 42:**\nOne must overturn the brambles’ nest,\nYet avoid entangling oneself in nets.\nOnly when they rest must we wait,\nFor many are misled by many misleaders.\n\n**Chapter 43:**\nThe crimson flame burns like fire in men,\nYet a stone man in fire cannot smoke.\nBetween them, little good remains,\nYet one buys the wind’s light without cost.\n\n**Chapter 44:**\nLight and heavy have their constant measure—\nAt the time, avoid miscalculating.\nDo not treat good things as strange or rare,\nFor good things turn the heart to sorrow.\n\n**Chapter 45:**\nClear discernment brings true use,\nWithin it, distinctions of shallow and deep.\nTwofold judgment without reliance,\nAfter rain, a thousand peaks remain green.\n\n**Chapter 46:**\nWhen the world is in turmoil, I am in turmoil,\nYet when I am at ease, the world is at ease.\nBrightly recognizing the idle law,\nA single laugh makes heaven and earth vast.\n\n**Chapter 47:**\nIts wind arises where it should not leave,\nYet the slightest movement brings it no clarity.\nSitting and watching the trifling guests outside,\nHow many chariots and horses pass at will?\n\n**Chapter 48:**\nFor the Dao, do not mistake it for study,\nBeyond ten thousand miles, the skulls lie dry.\nMajestic, it sits in judgment over the land of no birth,\nAnd gazes further toward the shores of no birth.\n\n**Chapter 49:**\nThe Dao is level, yet no faction tilts it,\nWherever spring flowers bloom, they are fresh and fair.\nThe fool sits opposite, unable to speak of dreams,\nSo he ties the crane’s glue to mend the broken string.\n\n**Chapter 50:**\nThe belly is split, the entrails spilled—\nAll is revealed, no need for further doubt.\nWhen doubt arises, the path to clarity is found,\nYet men are forbidden from peering with their eyes.\n\n**Chapter 51:**\nWithout stirring a hair, all things respond,\nYet who knows gratitude after it is given?\nWhen affairs are met without attachment,\nOne asks: *What was the original heart?*\n\n**Chapter 52:**\nFrom the thread’s beginning, the root of life is pondered,\nYet knowing its source is still not enough.\nEven sealed like water, it is not yet the full measure—\nOnly at home does one truly grasp its advantage.\n\n**Chapter 53:**\nThe Dao lies within, yet is hard to know,\nThe distant path is clear, yet foes cannot cross it.\nThe fool does not understand establishing his household,\nChasing youthful splendor ever outward.\n\n**Chapter 54:**\nThe effort is steady where no wind passes,\nThick and endless, yet never exhausted.\nWhat is this? The hair’s end contains the Dharma-realm,\nAll green recognizes its master.\n\n**Chapter 55:**\nAll day, the child plays freely,\nYet the body remains still, unaware.\nOnce touched by contrivance, it becomes artificial—\nReturning it, the leaves fall, and the branches sprout anew.",
      "overlap_context": "se serves?\nIn the end, one must return to home.\n\n**Chapter 20:**\nThe great round mirror holds no distinction,\nA hundred feet of pole—yet one must turn.\nWhen breath is cut, the path is found,\nAs ever, the Dao is the original man.\n\n**Chapter 21:**\nAll sights are revealed without concealment,\nWithin them, the finest grace is seen.\nThrough ages clear, yet never dimmed—\nGazing at green hills, autumn comes again.\n\n**Chapter 22:**\nCast aside, reclaim—many ways,\nYet its use lies in the slightest thread.",
      "start_char": 981,
      "end_char": 2380,
      "start_sentence": 75,
      "end_sentence": 174,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 18.103315830230713,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\赞颂类\\道德真经颂.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "五十六章 坐断牢关通一线，自然到处便风流。 晓来雨洗千峰碧，一点翩翩海上鸥。 五十七章 万法门中自有常，纤尘才动便乖张。 秋风断送一番雨，无意冻人人自凉。 五十八章 不慧不痴无限意，翻云覆雨几多时。 可伶此意人稀识，倒着栏衫独自归。 五十九章 冷淡工夫真朴实，到家活计岂能量。 功成行满超三际，万劫千生扑鼻香。 六十章 举心动念成亏缺，秉烛当场绝所疑。 上下升平天地阔，此恩须是大家知。 六十一章 木落山空万宝秋，阴阳造化妙推求。 但将坎水藏离火，赢得精神盖九州。 六十二章 一点圆明处处同，高低富贵不如侬。 见成受用元亏缺，千圣从教立下风。 六十三章 道着无中早不中，不劳计较自收功。 莫将此事为容易，这裹针锋也不容。 六十四章 机先截断千差路，动着铁毫事转伤。 可煞傍人无耐性，为他闲事惹愁肠。 六十五章 向道惺惺不似痴，惺惺多事复多机。 若知此个真端的，妙用纵横总不知。 六十六章 众流衰衮尽朝宗，只为他家信息通。 若把无心成有意，百花撩乱恼春风。 六十七章 当头触着动乾坤，任是王维画不成。 可惜掺开泥水路，为他深处少人行。 六十八章 省得家风用得亲，当知水到自渠成。 寥寥此意知何尽，几度潮平月又生。 六十九章 将军坚壁屈人兵，不犯秋毫致太平。 待得功成无一事，却伶当日太厅生。 七十章 此问明明无问隔，时人何不便承当。 若教此事人都识，不直他家一盏汤。 七十一章 得了还同未得时，於中无不涉毫厘。 脱身未到膏肓外，万孔千疮作么医。 七十二章 生来胆大又心厅，豁达精神自有余。 收拾得来谁得似，珊瑚枝上舞金乌。 七十三章 当机杀活甚玄微，轻重还他作者知。 子细为君重说破，夜寒毛骨玲凄赓。 七十四章 惧法须还识法人，从来王法等无亲。 欲知王法无亲处，月影穿潭不见痕。 七十五章 清平世界没肴讹，只为家翁不奈何。 临事始知元事好，双垂赤脚笑呵呵。 七十六章 这个由来本不殊，谁将强弱巧分疏。 直下既分生死路，无星秤子较辎铢。 七十七章 天人无不隔毫厘，才涉毫厘转背驰。 为怕夜行侵早起，谁知独惹露沾衣。 七十八章 观面相逢语不欺，奈何独自少人知。 当场荐得深深意，日出扶桑却在西。 七十九章 分明识破不为冤，要识先须达本源。 识得本源真要的，了知天道没颇偏。 八十章 随家丰俭乃安然，万法之中尽省绿。 吃饭着衣无一事，大家风月本同天。 八十－章 择法须还眼目亲，至真用处出根尘。 到头一转无私句，不离当场这主人。 道德真经颂竟",
      "translated_text": "**Chapter 56:**\nSeated firm at the fortress gate, one thread connects—\nNaturally, wherever one goes, grace flows unbound.\nMorning rain washes a thousand peaks to emerald,\nA lone seagull skims the waves, its flight so light.\n\n**Chapter 57:**\nWithin all dharmas, constancy abides unseen,\nYet stir a speck of dust, and all is undone.\nAutumn winds scatter rain in vain—\nNo malice in the cold, yet all grow chilled.\n\n**Chapter 58:**\nNeither wise nor foolish, yet boundless in intent,\nClouds shift, rain falls—how many times?\nFew grasp this fleeting thought,\nAlone in borrowed robes, he turns to go.\n\n**Chapter 59:**\nCold, unadorned effort—truly plain and true,\nAt home, its work defies all measure.\nWhen virtue is complete and practice fulfilled,\nAcross kalpas and lives, its fragrance lingers.\n\n**Chapter 60:**\nA thought or impulse brings lack and want,\nYet with candle held, all doubt is cut.\nHeaven and earth stretch wide in perfect peace—\nThis grace must be known by all alike.\n\n**Chapter 61:**\nWhen trees fall and mountains stand bare in autumn’s wealth,\nYin and yang’s craft demands deep pursuit.\nBut hide the water of *kan*, suppress the fire of *li*,\nAnd spirit soars to crown the land.\n\n**Chapter 62:**\nOne bright point, round and clear, is everywhere the same—\nHigh or low, rich or poor, none compare to this.\nWhat’s gained is borrowed, lacking from the start,\nEven sages bow before its might.\n\n**Chapter 63:**\nThe Dao in emptiness—early or late, it fails not,\nNo need for schemes when effort is complete.\nDo not think this easy—here, even needles clash.\n\n**Chapter 64:**\nCut off the paths of a thousand contrivances first,\nFor every move of the iron brush brings harm.\nPity those who lack patience for others’ affairs,\nTheir idle worries twist the heart.\n\n**Chapter 65:**\nAwake to the Dao, yet not like the foolish—\nAwake to schemes, yet more entangled still.\nIf one knows this true foundation,\nMystery’s play is beyond all knowing.\n\n**Chapter 66:**\nAll streams converge where the great river flows,\nBecause his home’s message reaches far.\nTo force the heartless into intent,\nStirs chaos—spring’s flowers scatter in vain.\n\n**Chapter 67:**\nStrike at the core, and heaven and earth shift—\nEven Wang Wei’s brush could not capture this.\nToo bad the muddy path is left undisturbed,\nFew dare tread where the depths lie hidden.\n\n**Chapter 68:**\nUnderstanding the family’s wind, it serves with ease,\nKnow that water shapes itself as it flows.\nThis truth is boundless—how to measure it?\nTides recede, yet the moon rises anew.\n\n**Chapter 69:**\nLike a general with fortified walls, bending foes,\nNo harm done, yet peace is won.\nWhen all is done and nothing remains,\nThe hall of old is still born anew.\n\n**Chapter 70:**\nThis question is clear, yet none dare answer truly—\nWhy do people shrink from what’s plain?\nIf all could see this, they’d scorn a single bowl of soup.\n\n**Chapter 71:**\nGained or lost, it’s the same as before,\nYet not a hair’s breadth escapes its reach.\nBefore the body leaves the critical stage,\nA thousand wounds—what cure could there be?\n\n**Chapter 72:**\nBorn bold in spirit, unbounded in mind,\nVastness itself is no constraint.\nWho could gather this as he has done?\nOn coral branches, the sunbird dances.\n\n**Chapter 73:**\nTo kill or spare at the decisive moment—how profound!\nLight or heavy, only the master knows.\nLet me speak plainly to you now,\nFor winter’s chill pierces bone and marrow.\n\n**Chapter 74:**\nFear the law, yet know those who grasp it well—\nFrom first to last, the law knows no kin.\nTo see where law’s impartiality lies,\nObserve the moon’s reflection—no trace remains.\n\n**Chapter 75:**\nIn this peaceful world, no deceit remains,\nYet the master’s helplessness is the key.\nOnly in action does the original goodness show—\nBarefoot, he laughs, his toes dangling free.\n\n**Chapter 76:**\nThis origin is no different in kind,\nYet who would forcefully divide strong and weak?\nOnce life and death are split asunder,\nNo scales could weigh the worth of a grain.\n\n**Chapter 77:**\nHeaven and man differ by not a hair’s breadth,\nYet stray a hair’s breadth, and all is undone.\nFearful of night’s advance, they rise too soon—\nWho knows they’ll only catch the dew on their clothes?\n\n**Chapter 78:**\nFacing each other, no words are false,\nYet why does no one truly understand?\nHere, deep meaning is offered plainly—\nThe sun rises in the east, yet sets in the west.\n\n**Chapter 79:**\nTo see through clearly is no wrong,\nYet to recognize, one must first reach the source.\nWhen the source is known in truth,\nThe Way of Heaven stands without deviation.\n\n**Chapter 80:**\nRich or poor, the family’s ease is sure,\nWithin all dharmas, all is green and bright.\nEating, dressing—no greater task,\nAll share the wind and moon as one with Heaven.\n\n**Chapter 81:**\nChoose the law with eyes wide open,\nFor truth’s use lies beyond dust and root.\nAt the end, a turn without private intent—\nNo separation from this very place, this master.\n\n*The Ode to the Classic of the Way and Its Virtue concludes.*",
      "overlap_context": "nnot cross it.\nThe fool does not understand establishing his household,\nChasing youthful splendor ever outward.\n\n**Chapter 54:**\nThe effort is steady where no wind passes,\nThick and endless, yet never exhausted.\nWhat is this? The hair’s end contains the Dharma-realm,\nAll green recognizes its master.\n\n**Chapter 55:**\nAll day, the child plays freely,\nYet the body remains still, unaware.\nOnce touched by contrivance, it becomes artificial—\nReturning it, the leaves fall, and the branches sprout anew.",
      "start_char": 2381,
      "end_char": 3479,
      "start_sentence": 175,
      "end_sentence": 253,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 14.664791584014893,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\赞颂类\\道德真经颂.txt",
        "category": "赞颂类"
      }
    }
  ]
}